{
  "id": 322,
  "title": {
    "ar": "الباب الثاني والعشرون وثلاثمائة في معرفة منزل من باع الحق بالخلق وهو من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Twenty-Two, Concerning the Gnosis (معرفة) of the Station (منزل) of him who exchanged The Real (الحق) for Creation (الخلق), and he belongs to the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو بائیس: اس شخص کی منزل کی معرفت (المعرفۃ) کے بیان میں جس نے الحق (ذات حق) کو خلق (مخلوق) کے عوض بیچ دیا، اور یہ الحضرة المحمدية (حضور محمدی) سے ہے۔",
    "fa": "باب سیصد و بیست و دوم در معرفت منزل کسی که حق را به خلق فروخت، و او از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب الثاني والعشرون وثلاثمائة في معرفة منزل من باع الحق بالخلق وهو من الحضرة المحمدية»\n\n\n> جمع الأنام على إمام واحد *** عين الدليل على الإله الواحد\n\n\n> فإذا ادعى غير الإله مقامه *** ذاك الدليل على الخيال الفاسد\n\n\n> هيهات أين الواحد العلم الذي *** لا يقبل النسب التي في الشاهد\n\n\n> لا يقبل العقل الصحيح من الذي *** تعطي الشريعة من وجود الزائد\n> إلا الذي للفكر فيه مداخل *** والواقفي مماثل للجاحد\n\n\n> لا تعبد الأقوام غير عقولهم *** والناس بين مسلم ومعاند\n\n\nقال الله عز وجل وإِلهُكُمْ إِلهٌ واحِدٌ وقال تعالى لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا وقال سبحانه إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً وقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إذا بويع لخليفتين فاقتلوا الآخر منهما\n\n\nوقال صَلَّى اللهُ عَليهِ وسَلَّم الخلفاء من قريش‏\n\n\nوالتقرش التقبض والاجتماع ولما كانت هذه القبيلة جمعت قبائل سميت قريشا أي مجموع قبائل ومنها حيوان بحري يقال له القرش رأيته وهو متقبض مجتمع وكذلك الإمام إن لم يكن متصفا بأخلاق من استخلفه جامعا لها مما يحتاج إليه من استخلف عليهم وإلا فلا تصح خلافته فهو الواحد المجموع فأحديته أحدية الجمع وله من الأيام يوم الجمعة وهو الاجتماع في المصر على إمام واحد وله من الأحوال الصلاة لأنه لا يقيمها إلا إمام واحد في الجماعة ويكون أقرأهم أي أكثرهم جمعا للقرآن وله من مراتب العلوم علوم الأنوار وإن لم يعط علوم الأسرار فلا يبالي صاحب هذا المقام فإن الصلاة نور والنور يهتدى به ولا بد للإمام من نور يكشف به ويمشي به في العالم الذي ولاة الله عليهم وقد توفرت همم العالم في كل قرية أو بلدة أو جماعة أن يكون لهم رأس يرجعون إليه ويكونون تحت أمره وكان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إذا بعث سرية ولو كانت السرية رجلين أمر أحدهما\n\n\nوهو مقام شريف له علم خاص من كان فيه ذلك العلم ينبغي أن يكون إماما أ لا ترى‏\n\n\nلما طعنت الصحابة في إمارة أسامة بن زيد لما قدمه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم على الجيش فبرز خارج المدينة وأمره أن يطأ بجيشه ذلك أرض الروم وفي جملة الجيش أبو بكر وعمر فقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم للطاعنين في إمارته طال والله ما طعنتم في إمارة أبيه قبل ذلك أما والله إنه لخليق بها أو جدير بها\n\n\nوقد طعنت الملائكة في خلافة آدم عليه السلام فأجابهم الله على ذلك كما أجاب رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في حق أسامة تخلقا بأخلاق الله في ذلك واتخاذ الإمام واجب شرعا مع كونه موجودا في فطرة العالم أعني طلب نصب الإمام فإن قلت فما نص الشارع بالأمر على اتخاذ الإمام فمن أين يكون واجبا قلنا إن الله تعالى قد أمر بإقامة الدين بلا شك ولا سبيل إلى إقامته إلا بوجود الأمان في أنفس الناس على أنفسهم وأموالهم وأهليهم من تعدى بعضهم على بعض وذلك لا يكون أبدا ما لم يكن ثم من تخاف سطوته وترجى رحمته يرجع أمرهم إليه ويجتمعون عليه فإذا تفرغت قلوبهم من الخوف الذي كانوا يخافونه على أموالهم ونفوسهم وأهليهم تفرغوا إلى إقامة الدين الذي أوجب الله عليهم إقامته وما لا يتوصل إلى الواجب إلا به فهو واجب فاتخاذ الإمام واجب ويجب أن يكون واحدا لئلا يختلفا فيؤدي إلى امتناع وقوع المصلحة وإلى الفساد فقد تبين لك ما المراد بتوحيد الله الذي أمرنا بالعلم به أنه توحيد الألوهية له سبحانه لا إله إلا هو قال تعالى فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله ولم يقل‏\n\n\n### [إن الله لا تنقسم ذاته‏]\n\n\nفاعلم أنه لا تنقسم ذاته ولا أنه ليس بمركب ولا أنه مركب من شي‏ء ولا أنه جسم ولا أنه ليس بجسم بل قال في صفته إنه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ ولما لم يتعرض الحق سبحانه إلى تعريف عباده بما خاضوا فيه بعقولهم ولا أمرهم الله في كتابه بالنظر الفكري إلا ليستدلوا بذلك على أنه إله واحد أي أنها لا تدل إلا على الوحدانية في المرتبة ف لا تَتَّخِذُوا إِلهَيْنِ اثْنَيْنِ إِنَّما هُوَ إِلهٌ واحِدٌ فزادوا في النظر وخرجوا عن المقصود الذي كلفوه فأثبتوا له صفات لم يثبتها لنفسه ونفت عنه طائفة أخرى تلك الصفات ولم ينفها عن نفسه ولا نص عليها في كتابه ولا على السنة أنبيائه ثم اختلفوا في إطلاق الأسماء عليه فمنهم من أطلق عليه ما لم يطلق على نفسه وإن كان اسم تنزيه ولكنه فضول من القائل به والخائض فيه ثم أخذوا يتكلمون في ذاته وقد نهاهم الشرع عن التفكر في ذاته جل وتعالى وقد قال سبحانه ويُحَذِّرُكُمُ الله نَفْسَهُ أي لا تتعرضوا للتفكر فيها فانضاف إلى فضولهم عصيان الشرع بالخوض فيما نهوا عنه فمن قائل هو جسم ومن قائل ليس بجسم ومن قائل هو جوهر ومن قائل ليس بجوهر ومن قائل هو في جهة ومن قائل ليس في جهة وما أمر الله أحدا من خلقه بالخوض في ذلك جملة واحدة لا النافي ولا المثبت ولو سألوا عن تحقيق معرفة ذات واحدة من العالم ما عرفوها ولو قيل لهذا الخائض كيف تدبير نفسك لبدنك وهل هي داخلة فيه أو خارجة عنه أو لا داخلة ولا خارجة وانظر بعقلك في ذلك وهل هذا الزائد الذي يتحرك به هذا الجسم الحيواني ويبصر ويسمع ويتخيل ويتفكر لما ذا يرجع هل‏\nلواحد أو لكثيرين وهل يرجع إلى عرض أو إلى جوهر أو إلى جسم وتطلبه بالأدلة العقلية على ذلك دون الشرعية ما وجد لذلك دليلا عقليا أبدا ولا عرف بالعقل أن للأرواح بقاء ووجودا بعد الموت وكل ما اتخذوه دليلا في ذلك مدخول لا يقوم على ساق فما من مأخذ فيه إلا وهو ممكن والممكن لا يقوم دليل عقلي على وجوب وجوده ولا وجوب عدمه إذ لو كان كذلك لاستحالت حقيقة إمكانه فما لنا إلا ما نص عليه الشرع فالعاقل يشغل نفسه بالنظر في الأوجب عليه لا يتعداه فإن المدة يسيرة والأنفاس نفائس وما مضى منها لا يعود\n\n\n### [إن الله إله واحد لا إله إلا هو]\n\n\nفاعلم إن الله إله واحد لا إله إلا هو مسمى بالأسماء التي يفهم منها ومن معانيها أنها لا تنبغي إلا له ولمن تكون له هذه المرتبة ولا تتعرض يا ولي للخوض في الماهية والكمية والكيفية فإن ذلك يخرجك عن الخوض فيما كلفته وألزم طريقة الايمان والعمل بما فرض الله عليك واذْكُرْ رَبَّكَ ... بِالْغُدُوِّ والْآصالِ بالذكر الذي شرعه لك من تهليل وتسبيح وتحميد واتق الله فإذا شاء الحق أن يعرفك بما شاءه من علمه فاحضر عقلك ولبك لقبول ما يعطيك ويهبك من العلم به فذلك هو النافع وهو النور الذي يحيي به قلبك وتمشي به في عالمك وتأمن فيه من ظلم الشبه والشكوك التي تطرأ في العلوم التي تنتجها الأفكار فإن النور هو النفور فالنور منفر الظلم في المحل الذي يظهر فيه فلو كان هذا العلم الذي أغطاه التفكر في الله نورا كما يزعم ما طرأ على المحل ظلمة شبهة ولا ظلمة تشكيك أصلا وقد طرأت والظلمة ليس من شأنها أن تنفر النور ولا لها سلطان عليه وإنما السلطان للنور المنفر الظلم فدل ذلك على إن علوم المتكلمين في ذات الله والخائضين فيه ليست أنوارا وهم يتخيلون قبل ورود الشبهة أنهم في نور وعلى بينة من ربهم في ذلك فلا يبدو لهم نقصهم حتى ترد عليهم الشبهة وما يدريك لعل تلك الشبهة التي يزعمون أنها شبهة هي الحق والعلم فإنك تعلم قطعا إن دليل الأشعري في إثبات المسألة التي ينفيها المعتزلي هو الحق وأنه شبهة عند المعتزلي ودليل المعتزلي الذي ينفي به ما يثبته الأشعري شبهة عند الأشعري ثم إنه ما من مذهب إلا وله أئمة يقومون به وهم فيه مختلفون وإن اتصفوا جميعهم مثلا بالأشاعرة فيذهب أبو المعالي خلاف ما ذهب إليه القاضي ويذهب القاضي إلى مذهب يخالف فيه الأستاذ ويذهب الأستاذ إلى مذهب في مسألة يخالف فيه الشيخ والكل يدعي أنه أشعري وكذلك المعتزلة وكذلك الفلاسفة في مقالاتهم في الله وفيما ينبغي أن يعتقد ولا يَزالُونَ مُخْتَلِفِينَ مع كون كل طائفة يجمعها مقام واحد واسم واحد وهم مختلفون في أصول ذلك المذهب الذي جمعهم فإن الفروع لا تعتبر ورأينا المسلمين رسلا وأنبياء قديما وحديثا من آدم إلى محمد ومن بينهما عليهم الصلاة والسلام ما رأينا أحدا منهم قط اختلفوا في أصول معتقدهم في جناب الله بل كل واحد منهم يصدق بعضهم بعضا ولا سمعنا عن أحد منهم إنه طرأ عليه في معتقده وعلمه بربه شبهة قط فانفصل عنها بدليل ولو كان لنقل ودون ونطقت به الكتب كما نقل سائر ما تكلم فيه من ذلك ممن تكلم فيه ولا سيما والأنبياء تحكمت في العامة في أنفسها وأموالها وأهليها وحجرت وأباحت وأوجبت ولم يكن لغيرها هذه القوة من التحكم فكانت الدواعي تتوفر على نقل ما اختلفوا فيه في جانب الحق لأنهم ينتمون إليه ويقولون إنه أرسلهم وأتوا بالدلائل على ذلك من المعجزات ولا نقل عن أحد منهم إنه طرأت عليه شبهة في علمه بربه ولا اختلف واحد منهم على الآخر في ذلك وكذلك أهل الكشف المتقون من أتباع الرسل ما اختلفوا في الله أي في علمهم به ولا نقل عن أحد منهم ما يخالف به الآخر فيه من حيث كشفه وإخباره لا من حيث فكره فإن ذلك يدخل مع أهل الأفكار فهذا مما يدلك على إن علومهم كانت أنوارا لم تتمكن لشبهة إن تتعرض إليهم جملة واحدة فقد علمت إن النور إنما اختص بأهل النور وهم الأنبياء والرسل ومن سلك على ما شرعوه ولم يتعد حدود ما قرروه واتقوا الله ولزموا الأدب مع الله فهم على نور من ربهم نُورٌ عَلى‏ نُورٍ ولَوْ كانَ من عِنْدِ غَيْرِ الله لَوَجَدُوا فِيهِ اخْتِلافاً كَثِيراً يعني في نعت الحق وما يجب له فإن الناظر بفكره في معتقده لا يبقى على حالة واحدة دائما بل هو في كل وقت بحسب ما يعطيه دليله في زعمه في وقته فيخرج من أمر إلى نقيضه وقد دللتك يا أخي على طريق العلم النافع من أين يحصل لك فإن سلكت على صراطه المستقيم‏\n\n\n### [إن لله عبد قد اعتنى به واصطنعه لنفسه‏]\n\n\nفاعلم إن الله قد أخذ بيدك واعتنى بك واصطنعك لنفسه فالله يحول بيننا وبين سلطان أفكارنا فيما لم نؤمر بالتفكر فيه وقد بان لك بما ذكرناه أنه ما دخل عليهم ما دخل إلا من الفضول ولهذا وقع الخلاف ولعبت بهم الأفكار والأهواء أ لا ترى الأمر الذي أباح لهم الشارع أن‏\nيطلبوا علمه ما اختلف فيه اثنان منهم فلو طلب منهم غير ذلك مما اختلفوا فيه ما اختلفوا أيضا فيه فدل ذلك على أنه ما طلب الحق منهم ذلك فإن قلت فما هو الذي اتفقوا فيه قلنا اجتمعت الأدلة العقلية من كل طائفة بل من ضرورات العقول أن لهم موجدا أوجدهم يستندون إليه في وجودهم وهو غني عنهم ما اختلف في ذلك اثنان وهو الذي طلب الحق من عباده إثبات وجوده فلو وقفوا هنا حتى يكون الحق هو الذي يعرفهم على لسان رسوله بما ينبغي أن يضاف إليه ويسمى به أفلحوا وإنما الإنسان خلق عجولا ورأى في نفسه قوة فكرية فتصرف بها في غير محلها فتكلم في الله بحسب ما أعطاه نظره والأمزجة مختلفة والقوة المفكرة متولدة من المزاج فيختلف نظرها باختلاف مزاجها فيختلف إدراكها وحكمها فيما أدركته فالله يرشدنا ويجعلنا ممن جعل الحق إمامه والتزم ما شرع له ومشى عليه أنه الملي‏ء بذلك لا رب غيره‏\n\n\n### [أن الله ما بعث الرسل سدى‏]\n\n\nفاعلم يا ولي أن الله ما بعث الرسل سدى ولو استقلت العقول بأمور سعادتها ما احتاجت إلى الرسل وكان وجود الرسل عبثا ولكن لما كان من استندنا إليه لا يشبهنا ولا نشبهه ولو أشبهنا عينا ما كان استنادنا إليه بأولى من استناده إلينا فعلمنا قطعا علما لا يدخله شبهة في هذا المقام أنه ليس مثلنا ولا تجمعنا حقيقة واحدة فبالضرورة يجهل الإنسان ما له وإلى أين ينتقل وما سبب سعادته إن سعد أو شقاوته إن شقي عند هذا الذي استند إليه لأنه يجهل علم الله فيه لا يعرف ما يريد به ولا لما ذا خلقه تعالى فافتقر بالضرورة إلى التعريف الإلهي بذلك فلو شاء تعالى عرف كل شخص بأسباب سعادته وأبان له عن الطريق التي ينبغي له أن يسلك عليها ولكن ما شاء إلا أن يبعث في كل أمة رسولا من جنسها لا من غيرها قدمه عليها وأمرها باتباعه والدخول في طاعته ابتلاء منه لها لإقامة الحجة عليها لما سبق في علمه فيها ثم أيده بالبينة والآية على صدقه في رسالته التي جاء بها ليقوم له الحجة عليها وإنما قلنا من جنسها لأنه كذا وقع الأمر قال تعالى ولَوْ جَعَلْناهُ مَلَكاً لَجَعَلْناهُ رَجُلًا أي لو كان الرسول للبشر ملكا لنزل في صورة رجل حتى لا يعرفوا أنه ملك فإن الحسد على المرتبة إنما يقع بين الجنس وقال تعالى لَوْ كانَ في الْأَرْضِ مَلائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنا عَلَيْهِمْ من السَّماءِ مَلَكاً رَسُولًا ولنا في ذلك‏\n\n\n> خليفة القوم من أبناء جنسهم *** لأن ذلك أنكى في نفوسهم‏\n\n\n> لو لم يكن منهم لصدقوه ولم *** يقم بهم حسد لغير جنسهم‏\n\n\nقد علم الإنسان أن البهائم وجميع الحيوانات دونه في المرتبة فلو تكلم حيوان ولو كان خنفساء ونطقت وقالت أنا رسول من الله إليكم احذروا من كذا وافعلوا كذا لتوفرت الدواعي من العامة على اتباعها والتبرك بها وتعظيمها وانقادت لها الملوك ولم يطلبوها بآية على صدقها وجعلوا نطقها نفس الآية على صدقها وإن كان الأمر ليس كذلك وإنما لما نال المرتبة غير الجنس لم يقم بهم حسد لغير الجنس فأول ابتلاء ابتلى الله به خلقه بعث الرسل إليهم منهم لا من غيرهم ومع الدلالات التي نصبها لهم على صدقهم واستيقنوها حملهم سلطان الحسد الغالب عليهم إن يجحدوا ما هم به عالمون موقنون ظلما وعلوا قال تعالى وجَحَدُوا بِها واسْتَيْقَنَتْها أَنْفُسُهُمْ ظُلْماً أي ظلموا بذلك أنفسهم وعُلُوًّا على من أرسل إليهم فاندرج في ذلك علوهم على الله ولو قلت له يا فلان كيف تتكبر على من خلقك لاستعاذ من ذلك وقال إن هذا الذي يزعم أنه من عند الله يكذب على الله حاشا الله أن يبعث مثل هذا إلينا لَوْ لا نُزِّلَ هذَا الْقُرْآنُ عَلى‏ رَجُلٍ من الْقَرْيَتَيْنِ عَظِيمٍ فإن قيل له فقد جاء بالعلامة على أنه رسول من الله إليكم فيقول أ لست تعلم أن السحر حق هذه الآية من ذلك القبيل هذا مع العامة وأما مع العلماء والخواص مثل الحكماء وغيرهم فإذا قيل لهم أ لستم ترون هذه الآيات الدالة على صدق ما يدعيه فأما العالمون بالنفوس وقواها فيجيبون عن ذلك بأن يقولوا قد علمنا إن القوي النفسانية تبلغ أن يتأثر لها أجرام العالم فهذا من ذلك القبيل ويحتج بصاحب العين وبعلم الزجر وأمثال ذلك مما يشبه هذا الفن وأما إن كان عنده علم بمجاري الكواكب ويرى قواها وسيران ذلك في العالم العنصري على مقادير مخصوصة يقول إن الطالع أعطاه ذلك وإن روحانية الكواكب تمده وإنه بهذا الطالع في مسقط النطفة شرفت عنه وأعطته هذه القوي نفسا شريفة ونال بها المراتب العلية في الإلهيات والذي قال به صحيح فإن الله أودع هذا كله في العالم العلوي حين خلقه ابتلاء\nيبتلي الله به عباده فإذا أضافوا ذلك إلى هذه القوي الروحانية وجردوه عن نظر الله إليه في ذلك بهذا القدر يسمون كفارا وإن كانوا مصيبين فيما قالوه فإنه هكذا رتب الله العالم ولكن أتى عليهم من جهلهم في علمهم فمن هنا قالت الطائفة العلم حجاب وإن كان الأمر ليس كذلك فإن علمهم بهذا لا ينافي العلم بأن الله أودع هذا في روحانياتها فما أتى عليهم على الحقيقة من علمهم وإنما أتى عليهم من جهلهم فلما تبينت طرق السعادة بالرسل قال تعالى إِنَّا هَدَيْناهُ السَّبِيلَ إِمَّا شاكِراً وإِمَّا كَفُوراً وما بقي بعد هذا إلا أن يوفق الله عباده للعمل بما أمرهم الله به من اتباع رسوله صَلَّى اللهُ عَليهِ وسَلَّم فيما أمر ونهى والوقوف عند حدوده ومراسمه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ ويحوي هذا المنزل على علم التنزيه وعلم الأسماء وعلم الابتلاء وعلم النسب وعلم العلل وعلم الأخبار وعلم مأخذ الأدلة وسبب كثرتها على المدلول الواحد وعلم الاختصاص وعلم المراتب وعلم الصفات وعلم القضاء وعلم الإمامة وعلم الشرائع وعلم الانتقالات وعلم الرجاء وعلم أسباب الفوز والبقاء وعلم الترجيح ومن هذا العلم اتبع الناس أهواءهم وتركوا الحق ونبذوه فالله يعصمنا من قيام هذه الصفة بنا فسبحانك اللهم وبحمدك لا إله إلا أنت أستغفرك وأتوب إليك‏\n\n",
    "en": "Chapter Three Hundred and Twenty-Two: Concerning the Knowledge of the Station of the One Who Sells the Real for the Creation, and this Station Belongs to the Muhammadan Presence (الحضرة المحمدية).\n\nThe gathering of mankind upon a single Imam (leader)\nIs the very eye of the proof for the One God (الإله الواحد).\n\nBut if other than God claims His station,\nThat is the proof of corrupt imagination (الخيال الفاسد).\n\nFar be it! Where is the Knowing One (الواحد العلم)\nWho accepts not the relations found in the witnessed world (الشاهد)?\n\nThe sound intellect accepts not from that which\nThe Law (الشريعة) grants of supererogatory existence (وجود الزائد),\n\nExcept that into which thought (الفكر) has entry,\nAnd the one who halts (الواقفي) is similar to the denier (الجاحد).\n\nThe nations worship nothing but their own intellects,\nAnd people are divided between the submitting and the obstinate.\n\nAllah, the Mighty and Majestic, said: <<وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ>> (And your God is One God). And He, the Most High, said: <<لَوْ كَانَ فِيهِمَا آلِهَةٌ إِلَّا اللَّهُ لَفَسَدَتَا>> (Had there been in them [heaven and earth] gods besides Allah, they would surely have been ruined). And He, the Glorified, said: <<إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً>> (Indeed, I am going to place upon the earth a vicegerent [خليفة]). And the Messenger of Allah, peace and blessings be upon him, said: \"If allegiance is sworn to two caliphs, kill the latter of them.\"\n\nHe, peace and blessings be upon him, also said: \"The Caliphs are from Quraysh.\"\n\nAl-Taqarrush (the root of Quraysh) means contraction and gathering. Since this tribe gathered many tribes, it was named Quraysh, meaning a collection of tribes. From this root also comes a marine animal called the *Qirsh* (shark), which I have seen, and it is contracted and gathered. Likewise, the Imam (leader) must be characterized by the qualities of the one who appointed him as vicegerent, gathering those qualities necessary for the people over whom he is appointed. Otherwise, his vicegerency is not valid. He is the One who is Gathered (الواحد المجموع). His Oneness (أحدية) is the Oneness of Gathering (جمع). Among the days, he has Friday (Yawm al-Jumu'ah), which is the gathering in the city upon a single Imam. Among the spiritual states (أحوال), he has the Prayer (الصلاة), because only one Imam leads the congregation (الجماعة), and he should be the best reciter (أقرأهم), meaning the one who has gathered the most of the Quran. Among the levels of knowledge (مراتب العلوم), he possesses the sciences of Lights (علوم الأنوار). If the possessor of this station is not granted the sciences of Secrets (علوم الأسرار), he should not worry, for the Prayer is Light (نور), and Light is used for guidance. The Imam must possess a Light by which he unveils and by which he walks in the World (العالم) over which God has appointed him. The aspirations of the people in every village, town, or group have converged on having a head to whom they can refer and under whose command they can gather. The Messenger of Allah, peace and blessings be upon him, whenever he dispatched a detachment (سرية), even if it consisted of only two men, would appoint one of them as commander.\n\nThis is a noble station, possessing a specific knowledge. Whoever possesses that knowledge ought to be an Imam. Do you not see that when the Companions questioned the command of Usama ibn Zayd when the Messenger of Allah, peace and blessings be upon him, placed him in charge of the army, and he marched out of Medina, ordering his army to tread the land of the Romans, and among that army were Abu Bakr and Umar? The Messenger of Allah, peace and blessings be upon him, said to those who questioned his command: \"By God, you have questioned the command of his father before this. By God, he is indeed worthy of it, or deserving of it.\"\n\nThe angels questioned the vicegerency (خلافة) of Adam, peace be upon him, and God answered them just as the Messenger of Allah, peace and blessings be upon him, answered concerning Usama, thereby manifesting the Divine qualities in that matter. The appointment of an Imam is legally obligatory (واجب شرعا), in addition to its being inherent in the primordial nature of the Cosmos (فطرة العالم)—meaning the demand for the establishment of a leader. If you ask: \"Where did the Lawgiver explicitly command the appointment of an Imam, such that it becomes obligatory?\" We reply: God Almighty has commanded the establishment of the Religion (إقامة الدين) without doubt. There is no way to establish it except through the existence of security (الأمان) among people for their lives, wealth, and families, preventing mutual transgression. This security can never exist unless there is someone whose might is feared and whose mercy is hoped for, to whom their affairs are referred and upon whom they gather. When their hearts are freed from the fear they held for their wealth, lives, and families, they become free to establish the Religion which God has obligated them to establish. That without which an obligation cannot be fulfilled is itself obligatory (واجب). Therefore, the appointment of an Imam is obligatory, and he must be one, lest they differ, leading to the prevention of the common good and resulting in corruption (فساد). Thus, it has become clear to you that the intended meaning of the Unity of God (توحيد الله) which we were commanded to know is the Unity of Divinity (توحيد الألوهية) belonging to Him, the Glorified, there is no god but Him. He, the Most High, said: <<فَاعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ>> (So know that there is no god except Allah). He did not say:\n\n### [Indeed, the Essence of Allah is indivisible]\n\nKnow that His Essence (ذات) is indivisible, nor that He is not composite, nor that He is composite of something, nor that He is a body, nor that He is not a body. Rather, He said concerning His Attribute: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). Since the Real (الحق), the Glorified, did not undertake to inform His servants about what they delved into with their intellects, nor did God command them in His Book to engage in intellectual speculation (النظر الفكري) except to deduce from it that He is One God—meaning that these proofs only point to Oneness (الوحدانية) in the rank—<<لَا تَتَّخِذُوا إِلَهَيْنِ اثْنَيْنِ إِنَّمَا هُوَ إِلَهٌ وَاحِدٌ>> (Do not take two gods; He is but one God). Yet, they increased their speculation and departed from the intended purpose (المقصود) with which they were charged. They affirmed Attributes for Him that He did not affirm for Himself, and another group denied those Attributes which He did not deny for Himself, nor did He explicitly state them in His Book or upon the tongue of His Prophets. Then they differed concerning the application of the Names (الأسماء) to Him. Some applied to Him what He did not apply to Himself, even if it was a Name of Transcendence (تنزيه), yet it is a superfluity (فضول) on the part of the one who utters it and delves into it. Then they began to speak about His Essence (ذات), though the Law (الشرع) forbade them from contemplating His Essence, Exalted and Glorified is He. He, the Glorified, said: <<وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ>> (And Allah warns you of Himself)—meaning, do not expose yourselves to contemplation of it. Thus, their disobedience to the Law by delving into what they were forbidden was added to their superfluity. So, some said He is a body, and some said He is not a body; some said He is a substance (جوهر), and some said He is not a substance; some said He is in a direction, and some said He is not in a direction. God did not command any of His creation to delve into this matter at all, neither the denier nor the affirmer. If they were asked to truly know the essence (ذات) of a single thing in the Cosmos, they would not know it. If it were said to this delver: \"How does your self (نفسك) manage your body? Is it inside it, outside it, or neither inside nor outside? Look into that with your intellect. And this supererogatory thing (الزائد) by which this animal body moves, sees, hears, imagines, and thinks—to what does it return? Does it return to one thing or to many? Does it return to an accident (عرض) or to a substance (جوهر) or to a body?\" If you sought proof for this through rational evidence (الأدلة العقلية) alone, without relying on the Law, you would never find rational proof for it, nor would you know by intellect that souls (الأرواح) have subsistence and existence after death. All the proofs they have adopted in this regard are flawed and cannot stand firm, for every premise they take is merely possible (ممكن), and rational proof cannot establish the necessity of its existence or the necessity of its non-existence, for if it were so, the reality of its possibility would be impossible. Therefore, we have nothing but what the Law has explicitly stated. The intelligent person occupies himself with contemplating what is most obligatory upon him and does not exceed that, for the duration of life is short, and breaths are precious treasures (نفائس), and what has passed does not return.\n\n### [Indeed, Allah is One God, there is no god but Him]\n\nKnow that Allah is One God, there is no god but Him, named by the Names (الأسماء) from which it is understood, by their meanings, that they are fitting only for Him and for whoever attains this rank. O friend (ولي), do not expose yourself to delving into quiddity (ماهية), quantity (كمية), or quality (كيفية), for that will lead you away from delving into what you were charged with. Adhere to the path of faith (طريقة الايمان) and acting upon what God has obligated you. <<وَاذْكُرْ رَبَّكَ ... بِالْغُدُوِّ وَالْآصَالِ>> (And remember your Lord... in the mornings and the evenings) with the remembrance (الذكر) He has prescribed for you, such as *tahlil* (saying *la ilaha illa Allah*), glorification (تسبيح), and praise (تحميد). Fear God. If the Real wills to make known to you what He wills of His Knowledge, then prepare your intellect and mind to accept what He grants and bestows upon you of the knowledge of Him. That is the beneficial knowledge (النافع), and it is the Light (النور) by which your heart is revived and by which you walk in your world, and in which you are safe from the darkness of ambiguities (ظلم الشبه) and doubts that arise in the sciences produced by thoughts (الأفكار). For Light is repulsion (النفور); Light repels darkness in the place where it appears. If this knowledge, which is the result of speculation about God, were Light, as they claim, the darkness of ambiguity or the darkness of doubt would never arise in the locus at all. But they have arisen. Darkness is not capable of repelling Light, nor does it have authority over it. Rather, authority belongs to the Light that repels darkness. This indicates that the sciences of the speculative theologians (المتكلمين) who delve into the Essence of God are not Lights. They imagine, before the ambiguity arises, that they are in Light and upon clear evidence from their Lord in that matter. Their deficiency does not become apparent to them until the ambiguity arises. And what makes you know? Perhaps that ambiguity which they claim is ambiguity is actually the Real (الحق) and the Knowledge. For you know with certainty that the proof of the Ash'ari in establishing the issue that the Mu'tazili denies is the Real, yet it is an ambiguity (شبهة) to the Mu'tazili. And the proof of the Mu'tazili by which he denies what the Ash'ari affirms is an ambiguity to the Ash'ari. Furthermore, there is no school of thought (مذهب) that does not have Imams who uphold it, yet they differ within it, even if they are all described, for example, as Ash'aris. Abu al-Ma'ali holds a view contrary to that of the Qadi, and the Qadi holds a view that contradicts the Master (al-Ustadh), and the Master holds a view on an issue that contradicts the Shaykh, yet all claim to be Ash'aris. Likewise are the Mu'tazilis, and likewise are the Philosophers in their doctrines concerning God and what ought to be believed. <<وَلَا يَزَالُونَ مُخْتَلِفِينَ>> (And they will continue to differ), despite the fact that every faction is united by a single station and a single name, yet they differ in the fundamentals (أصول) of the very doctrine that unites them—for the branches (فروع) are not considered. We have seen the Messengers and Prophets, ancient and modern, from Adam to Muhammad, and those between them, peace and blessings be upon them: we have never seen any of them differ in the fundamentals of their belief concerning the Divine Presence (جناب الله). Rather, each one confirms the others. Nor have we ever heard that any of them was afflicted by an ambiguity (شبهة) in his belief and his knowledge of his Lord, from which he had to extricate himself by proof. Had this occurred, it would have been transmitted, recorded, and spoken of in books, just as all other matters discussed by those who spoke about them were transmitted. Especially since the Prophets exercised authority over the common people regarding their lives, wealth, and families; they restricted, permitted, and obligated, and no one else possessed this power of authority. Thus, the motives would have been abundant to transmit what they differed upon concerning the side of the Real, because they attributed themselves to Him and claimed that He sent them, and they brought proofs for this through miracles. Yet, it was never transmitted that any of them was afflicted by an ambiguity in his knowledge of his Lord, nor did any of them differ with another in this regard. Likewise, the pious people of Unveiling (أهل الكشف المتقون) among the followers of the Messengers have not differed concerning God—that is, in their knowledge of Him—nor has it been transmitted that any of them contradicted another in this matter based on his unveiling (كشفه) and reporting, though they may differ based on their thought (فكر), for that falls under the category of the people of thought. This indicates to you that their sciences were Lights (أنوار) which no ambiguity could ever approach. You have thus learned that Light is specific to the People of Light (أهل النور), who are the Prophets and Messengers, and those who follow the path they prescribed, who do not transgress the limits they established, who fear God, and who maintain proper conduct (الأدب) with God. They are upon a Light from their Lord: <<نُورٌ عَلَى نُورٍ>> (Light upon Light). And <<وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا>> (And if it had been from [any] other than Allah, they would have found within it much contradiction)—meaning in the description of the Real and what is due to Him. For the one who looks with his thought (فكر) into his belief does not remain in one state permanently; rather, he is constantly changing according to what his supposed proof grants him at that moment, moving from one position to its opposite. I have guided you, my brother, to the path of beneficial knowledge (العلم النافع) and how you may attain it. If you walk upon its straight path:\n\n### [Indeed, Allah has a servant whom He has cared for and chosen for Himself]\n\nKnow that God has taken your hand, cared for you, and chosen you for Himself. May God intervene between us and the authority of our thoughts concerning what we were not commanded to contemplate. It has become clear to you from what we have mentioned that the problems that afflicted them arose only from superfluity (فضول). This is why disagreement occurred, and thoughts and desires played games with them. Do you not see that the matter concerning which the Lawgiver permitted them to seek knowledge—not two of them differed concerning it? Had they been commanded to seek knowledge of those other matters about which they differed, they would not have differed concerning them either. This indicates that the Real did not demand that of them. If you ask: \"What is the matter upon which they agreed?\" We say: The rational proofs from every faction, indeed, the necessities of the intellects, converged on the fact that they have a Creator (موجدا) who brought them into existence, upon whom they rely for their existence, and who is independent of them. Not two people differed on this, and this is what the Real demanded of His servants: the affirmation of His existence. Had they stopped here until the Real Himself informed them, through the tongue of His Messenger, of what ought to be attributed to Him and by what He should be named, they would have succeeded. But man was created hasty (عجولا) and saw in himself an intellectual power, so he used it in the wrong place, speaking about God according to what his speculation granted him. Temperaments (الأمزجة) differ, and the thinking faculty is generated from temperament, so its speculation differs according to the difference in temperament, and thus its perception and judgment concerning what it perceives differ. May God guide us and make us among those who take the Real as their Imam and adhere to what He has prescribed for them and walk upon it. He is fully capable of that, and there is no lord but Him.\n\n### [That Allah did not send the Messengers in vain]\n\nKnow, O friend, that God did not send the Messengers in vain (سدى). If intellects were sufficient for the matters of their happiness, they would not have needed the Messengers, and the existence of the Messengers would have been futile (عبثا). However, since the One upon whom we rely does not resemble us, nor do we resemble Him—and had He resembled us essentially, our reliance upon Him would be no more appropriate than His reliance upon us—we know with absolute certainty, a knowledge into which no ambiguity enters in this station, that He is not like us, and no single reality unites us. Therefore, man is necessarily ignorant of what is due to him, where he will transition, and what is the cause of his happiness, if he is happy, or his wretchedness, if he is wretched, in relation to the One upon whom he relies, because he is ignorant of God's Knowledge concerning him. He does not know what God intends for him or why He created him, Exalted is He. Thus, he necessarily required Divine definition (التعريف الإلهي) concerning this. Had He willed, He would have informed every person individually of the causes of his happiness and clarified the path he ought to follow. But He willed only to send to every nation a Messenger from their own kind, not from another, whom He advanced over them and commanded them to follow and obey, as a trial (ابتلاء) from Him to establish the proof against them, based on what preceded in His Knowledge concerning them. Then He supported him with clear evidence and a sign (آية) of his truthfulness in the message he brought, so that the proof might be established against them. We said \"from their own kind\" because this is how the matter occurred. He, the Most High, said: <<وَلَوْ جَعَلْنَاهُ مَلَكًا لَجَعَلْنَاهُ رَجُلًا>> (And had We made him an angel, We would have made him [appear as] a man)—meaning, if the Messenger to mankind were an angel, he would descend in the form of a man so that they would not know he was an angel, for envy over rank occurs only between those of the same kind. And He, the Most High, said: <<لَوْ كَانَ فِي الْأَرْضِ مَلَائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنَا عَلَيْهِمْ مِنَ السَّمَاءِ مَلَكًا رَسُولًا>> (Had there been upon the earth angels walking securely, We would have sent down to them from the heaven an angel as a messenger). And concerning this, we say:\n\nThe Caliph of the people is from their own kind,\nBecause that is more painful to their souls.\n\nHad he not been one of them, they would have believed him,\nAnd envy for one not of their kind would not have arisen in them.\n\nMan knows that beasts and all animals are below him in rank. If an animal, even a beetle, were to speak and say, \"I am a Messenger from God to you, beware of such-and-such and do such-and-such,\" the common people would rush to follow it, seek blessings from it, and venerate it. Kings would submit to it and would not demand a sign of its truthfulness, taking its speech itself as the sign of its truthfulness. Although the matter is not truly so, it is because when the rank is attained by one not of their kind, envy does not arise in them for one not of their kind. Thus, the first trial (ابتلاء) with which God tested His creation was the sending of Messengers to them from among themselves, not from others. Despite the proofs He established for them concerning their truthfulness, which they ascertained, the dominant power of envy (سلطان الحسد) led them to deny what they knew and were certain of, out of injustice and haughtiness. He, the Most High, said: <<وَجَحَدُوا بِهَا وَاسْتَيْقَنَتْهَا أَنْفُسُهُمْ ظُلْمًا وَعُلُوًّا>> (And they rejected them, while their souls were certain of them, out of injustice—meaning they wronged themselves by that—and haughtiness) toward the one sent to them. This included their haughtiness toward God. If you were to say to one of them, \"How can you be arrogant toward the One who created you?\" he would seek refuge from that and say, \"This one who claims to be from God is lying about God. God forbid that He should send someone like this to us! <<لَوْ لَا نُزِّلَ هَذَا الْقُرْآنُ عَلَى رَجُلٍ مِنَ الْقَرْيَتَيْنِ عَظِيمٍ>> (Why was this Qur'an not sent down upon a great man from [one of] the two towns?)” If it is said to him, \"But he has brought the sign that he is a Messenger from God to you,\" he replies, \"Do you not know that sorcery (السحر) is real? This sign is of that kind.\" This is the response of the common people. As for the scholars and the elite, such as the philosophers and others, when it is said to them, \"Do you not see these signs indicating the truthfulness of what he claims?\" those who know the souls and their powers reply by saying, \"We know that psychic powers (القوي النفسانية) can reach the point where the bodies of the Cosmos are affected by them, and this is of that kind.\" They cite the example of the evil eye (صاحب العين) and the science of augury (علم الزجر) and similar arts. If one of them possesses knowledge of the courses of the stars (مجاري الكواكب) and sees their powers and their flow in the elemental world (العالم العنصري) according to specific measures, he says that the ascendant (الطالع) granted him that, and that the spirituality of the stars (روحانية الكواكب) supports him, and that by this ascendant at the moment the sperm was cast, his soul was ennobled and granted these powers, and he attained high ranks in Divine matters. What he says is correct, for God deposited all this in the celestial world when He created it, as a trial (ابتلاء) by which God tests His servants. However, when they attribute this to these spiritual powers and strip it of God's regard for it in this capacity, they are called disbelievers (كفارا), even though they are correct in what they said, for God arranged the Cosmos in this way. But their error comes from their ignorance within their knowledge. It is from this perspective that a faction said, \"Knowledge (العلم) is a veil,\" although the matter is not truly so, for their knowledge of this does not negate the knowledge that God deposited this in their spiritualities. Thus, their downfall did not truly come from their knowledge, but from their ignorance. When the paths to happiness were clarified by the Messengers, He, the Most High, said: <<إِنَّا هَدَيْنَاهُ السَّبِيلَ إِمَّا شَاكِرًا وَإِمَّا كَفُورًا>> (Indeed, We guided him to the way, whether grateful or ungrateful). Nothing remains after this except that God grants His servants success in acting upon what God commanded them: following His Messenger, peace and blessings be upon him, in what he commanded and forbade, and adhering to his limits and ordinances. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way). This station encompasses the Science of Transcendence (علم التنزيه), the Science of Names (علم الأسماء), the Science of Trial (علم الابتلاء), the Science of Relations (علم النسب), the Science of Causes (علم العلل), the Science of Reports (علم الأخبار), the Science of the Source of Proofs (علم مأخذ الأدلة) and the reason for their multiplicity concerning a single object of proof, the Science of Specificity (علم الاختصاص), the Science of Levels (علم المراتب), the Science of Attributes (علم الصفات), the Science of Decree (علم القضاء), the Science of Imamate (علم الإمامة), the Science of Laws (علم الشرائع), the Science of Transitions (علم الانتقالات), the Science of Hope (علم الرجاء), the Science of the Causes of Triumph and Subsistence (علم أسباب الفوز والبقاء), and the Science of Preference (علم الترجيح). It is from this last science that people follow their desires and abandon the Real (الحق) and cast it aside. May God protect us from this quality arising in us. Glory be to You, O God, and with Your praise. There is no god but You. I seek Your forgiveness and repent to You.",
    "ur": "باب نمبر تین سو بائیس: اس شخص کے مقام کی معرفت میں جس نے الحق (ذات حق) کو الخلق (مخلوق) کے عوض بیچ دیا، اور یہ مقام الحقیقۃ المحمدیۃ (حقیقت محمدیہ) سے ہے۔\n\nتمام مخلوق کا ایک امام پر جمع ہونا *** واحد الٰہ پر دلیل کی عین حقیقت ہے۔\n\nپس اگر الٰہ کے سوا کوئی اور اس مقام کا دعویٰ کرے *** تو یہ فاسد خیال پر دلیل ہے۔\n\nافسوس! وہ واحد، علیم (ذات) کہاں ہے *** جو مشہود (دیکھی جانے والی) نسبتوں کو قبول نہیں کرتی؟\n\nصحیح عقل اس چیز کو قبول نہیں کرتی *** جو شریعت زائد وجود کے طور پر عطا کرتی ہے۔\n\nسوائے اس کے جس میں فکر کے لیے مداخلتیں ہوں *** اور توقف کرنے والا منکر کے مشابہ ہے۔\n\nقومیں اپنی عقلوں کے سوا کسی کی عبادت نہیں کرتیں *** اور لوگ مسلمان اور عناد رکھنے والے کے درمیان ہیں۔\n\nاللہ عزوجل نے فرمایا: وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ (اور تمہارا معبود ایک ہی معبود ہے)۔ اور فرمایا: لَوْ كَانَ فِيهِمَا آلِهَةٌ إِلَّا اللَّهُ لَفَسَدَتَا (اگر آسمانوں اور زمین میں اللہ کے سوا اور معبود ہوتے تو دونوں میں فساد برپا ہو جاتا)۔ اور سبحانہ نے فرمایا: إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً (میں زمین میں ایک خلیفہ بنانے والا ہوں)۔ اور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: إِذَا بُويِعَ لِخَلِيفَتَيْنِ فَاقْتُلُوا الْآخِرَ مِنْهُمَا (جب دو خلیفوں کی بیعت کی جائے تو ان میں سے بعد والے کو قتل کر دو)۔\n\nاور آپ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: الْخُلَفَاءُ مِنْ قُرَيْشٍ (خلفاء قریش میں سے ہوں گے)۔\n\n\"التقرش\" (تقرش) کا معنی ہے سمٹنا اور جمع ہونا۔ چونکہ اس قبیلے نے کئی قبائل کو جمع کیا، اس لیے اسے قریش کہا گیا، یعنی قبائل کا مجموعہ۔ اسی سے ایک سمندری جانور ہے جسے قرش کہتے ہیں، میں نے اسے دیکھا ہے اور وہ سمٹا ہوا اور جمع شدہ ہوتا ہے۔ اسی طرح امام بھی، اگر وہ ان اخلاق سے متصف نہ ہو جن کے ساتھ اس کے مستخلف (جس نے اسے خلیفہ بنایا) نے اسے جمع کیا ہے، اور ان اخلاق کو جمع کرنے والا نہ ہو جن کی ضرورت ان لوگوں کو ہے جن پر اسے خلیفہ بنایا گیا ہے، تو اس کی خلافت صحیح نہیں ہے۔ پس وہ واحد المجموع (جمع شدہ واحد) ہے۔ اس کی احدیت (وحدانیت) جمع کی احدیت ہے۔ ایام میں سے اس کے لیے جمعہ کا دن ہے، جو ایک ہی امام پر شہر میں اجتماع کا دن ہے۔ احوال میں سے اس کے لیے نماز ہے، کیونکہ جماعت میں اسے ایک ہی امام قائم کرتا ہے، اور وہ ان سب میں زیادہ قاری (قرآن کو زیادہ جمع کرنے والا) ہوتا ہے۔ علوم کے مراتب میں سے اس کے لیے انوار کے علوم ہیں، اور اگر اسے اسرار کے علوم نہ بھی دیے جائیں تو اس مقام کا حامل پرواہ نہیں کرتا، کیونکہ نماز نور ہے، اور نور کے ذریعے ہدایت حاصل کی جاتی ہے۔ امام کے لیے ضروری ہے کہ اس کے پاس ایک ایسا نور ہو جس کے ذریعے وہ الکشف (کشف) کرے اور اس عالم میں چلے جس پر اللہ نے اسے والی بنایا ہے۔ دنیا کے لوگوں کی ہمتیں ہر گاؤں، شہر یا جماعت میں اس بات پر متفق رہی ہیں کہ ان کا ایک سربراہ ہو جس کی طرف وہ رجوع کریں اور اس کے حکم کے تحت رہیں۔ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم جب بھی کوئی سریہ (چھوٹا لشکر) بھیجتے، خواہ وہ دو آدمیوں پر مشتمل ہوتا، تو ان میں سے ایک کو امیر مقرر فرماتے۔\n\nیہ ایک شریف مقام ہے جس کا ایک خاص علم ہے۔ جس شخص میں وہ علم ہو، اسے امام ہونا چاہیے۔ کیا تم نہیں دیکھتے کہ جب صحابہ نے اسامہ بن زید کی امارت پر اعتراض کیا جب رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے انہیں لشکر کا امیر بنایا اور انہیں حکم دیا کہ وہ اپنے لشکر کے ساتھ روم کی سرزمین کو روندیں، اور اس لشکر میں ابوبکر اور عمر بھی شامل تھے، تو رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے اعتراض کرنے والوں سے فرمایا: \"اللہ کی قسم! تم نے اس سے پہلے اس کے باپ کی امارت پر بھی اعتراض کیا تھا۔ اللہ کی قسم! وہ اس کا اہل ہے یا اس کا مستحق ہے۔\"\n\nاور فرشتوں نے بھی آدم علیہ السلام کی خلافت پر اعتراض کیا تھا، تو اللہ نے انہیں اس کا جواب دیا، جیسا کہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے اسامہ کے حق میں جواب دیا، اس طرح اللہ کے اخلاق سے تخلق (اخلاق اپنانا) کرتے ہوئے اس معاملے میں۔ امام کا مقرر کرنا شرعاً واجب ہے، اس کے باوجود کہ یہ عالم کی فطرت میں موجود ہے، یعنی امام کے نصب کا مطالبہ۔ اگر تم کہو کہ شارع (شریعت ساز) نے امام مقرر کرنے کا حکم واضح طور پر کیوں نہیں دیا، تو یہ واجب کیسے ہوا؟ ہم کہتے ہیں کہ اللہ تعالیٰ نے دین کو قائم کرنے کا حکم دیا ہے، اس میں کوئی شک نہیں، اور دین کو قائم کرنے کا کوئی راستہ نہیں ہے سوائے اس کے کہ لوگوں کے نفوس میں ان کی جانوں، مالوں اور اہل و عیال پر امن قائم ہو، تاکہ ایک دوسرے کی زیادتی سے محفوظ رہیں۔ اور یہ کبھی نہیں ہو سکتا جب تک کوئی ایسا شخص نہ ہو جس کی سختی سے ڈرا جائے اور جس کی رحمت کی امید رکھی جائے، جس کی طرف ان کا معاملہ لوٹے اور جس پر وہ جمع ہوں۔ پس جب ان کے دل اس خوف سے فارغ ہو جائیں گے جو انہیں اپنے مالوں، جانوں اور اہل و عیال پر تھا، تو وہ اس دین کو قائم کرنے کی طرف متوجہ ہوں گے جسے اللہ نے ان پر قائم کرنا واجب کیا ہے۔ اور جس چیز کے بغیر واجب تک رسائی نہ ہو، وہ بھی واجب ہے۔ لہٰذا امام کا مقرر کرنا واجب ہے، اور اس کا ایک ہونا ضروری ہے تاکہ اختلاف نہ ہو، جو مصلحت کے وقوع میں رکاوٹ اور فساد کا باعث بنے۔ پس تمہارے لیے واضح ہو گیا کہ اللہ کی توحید سے کیا مراد ہے جس کے علم کا ہمیں حکم دیا گیا ہے، وہ اس کی الوہیت کی توحید ہے، سبحانہ، لَا إِلَهَ إِلَّا هُوَ (اس کے سوا کوئی معبود نہیں)۔ اللہ تعالیٰ نے فرمایا: فَاعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ (پس جان لو کہ اللہ کے سوا کوئی معبود نہیں ہے)۔ اور یہ نہیں فرمایا:\n\n### اللہ کی ذات تقسیم نہیں ہوتی (إن الله لا تنقسم ذاته‏)\n\n...کہ جان لو کہ اس کی ذات تقسیم نہیں ہوتی، نہ یہ کہ وہ مرکب نہیں ہے، نہ یہ کہ وہ کسی چیز سے مرکب ہے، نہ یہ کہ وہ جسم ہے، نہ یہ کہ وہ جسم نہیں ہے۔ بلکہ اس نے اپنی صفت میں فرمایا: لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثل کوئی چیز نہیں ہے)۔ اور جب الحق (ذات حق) سبحانہ نے اپنے بندوں کو اس چیز کی تعریف سے آگاہ نہیں کیا جس میں انہوں نے اپنی عقلوں سے غور و خوض کیا، اور نہ ہی اللہ نے انہیں اپنی کتاب میں فکری نظر کا حکم دیا، سوائے اس کے کہ وہ اس سے یہ استدلال کریں کہ وہ ایک ہی الٰہ ہے، یعنی یہ چیزیں صرف مرتبے میں وحدانیت پر دلالت کرتی ہیں، لہٰذا: لَا تَتَّخِذُوا إِلَهَيْنِ اثْنَيْنِ إِنَّمَا هُوَ إِلَهٌ وَاحِدٌ (دو معبود نہ بناؤ، وہ تو بس ایک ہی معبود ہے)۔ پس انہوں نے نظر و فکر میں اضافہ کیا اور اس مقصد سے باہر نکل گئے جس کے وہ مکلف تھے، تو انہوں نے اس کے لیے ایسی صفات ثابت کر دیں جو اس نے خود ثابت نہیں کیں۔ اور ایک دوسرے گروہ نے ان صفات کی نفی کر دی، حالانکہ اس نے خود ان کی نفی نہیں کی اور نہ ہی اپنی کتاب میں یا اپنے انبیاء کی سنت پر ان کا ذکر کیا۔ پھر وہ اس پر اسماء کے اطلاق میں اختلاف کرنے لگے، تو ان میں سے بعض نے اس پر وہ نام بھی اطلاق کیے جو اس نے خود پر اطلاق نہیں کیے، اگرچہ وہ تنزیہ کا نام ہی کیوں نہ ہو، لیکن یہ اس کے قائل اور اس میں غور و خوض کرنے والے کی فضول گوئی ہے۔ پھر انہوں نے اس کی ذات کے بارے میں بات کرنا شروع کر دی، حالانکہ شریعت نے انہیں اس کی ذات جل و تعالیٰ میں تفکر کرنے سے منع کیا ہے۔ اور سبحانہ نے فرمایا: وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ (اور اللہ تمہیں اپنی ذات سے ڈراتا ہے)۔ یعنی اس میں تفکر کرنے کی کوشش نہ کرو۔ پس ان کی فضول گوئی میں شریعت کی نافرمانی کا اضافہ ہو گیا کہ انہوں نے اس چیز میں غور و خوض کیا جس سے انہیں منع کیا گیا تھا۔ تو کوئی کہنے والا ہے کہ وہ جسم ہے، اور کوئی کہنے والا ہے کہ وہ جسم نہیں ہے۔ کوئی کہنے والا ہے کہ وہ جوہر ہے، اور کوئی کہنے والا ہے کہ وہ جوہر نہیں ہے۔ کوئی کہنے والا ہے کہ وہ کسی جہت میں ہے، اور کوئی کہنے والا ہے کہ وہ کسی جہت میں نہیں ہے۔ حالانکہ اللہ نے اپنی مخلوق میں سے کسی کو بھی اس میں غور و خوض کرنے کا حکم نہیں دیا، نہ نفی کرنے والے کو اور نہ ہی ثابت کرنے والے کو۔ اگر وہ عالم کی کسی ایک ذات کی معرفت کی تحقیق کے بارے میں پوچھتے تو وہ اسے بھی نہ جان پاتے۔ اور اگر اس غور و خوض کرنے والے سے کہا جائے کہ تم اپنے نفس کو اپنے بدن کے لیے کیسے تدبیر کرتے ہو؟ اور کیا وہ اس کے اندر ہے یا اس سے باہر ہے، یا نہ اندر ہے اور نہ باہر؟ اور اپنی عقل سے اس میں غور کرو۔ اور یہ زائد چیز جس سے یہ حیوانی جسم حرکت کرتا ہے، دیکھتا ہے، سنتا ہے، تخیل کرتا ہے اور تفکر کرتا ہے، یہ کس چیز کی طرف لوٹتی ہے؟ کیا یہ ایک کی طرف لوٹتی ہے یا بہت سوں کی طرف؟ اور کیا یہ عرض کی طرف لوٹتی ہے یا جوہر کی طرف یا جسم کی طرف؟ اور تم اس کی تلاش عقلی دلائل سے کرو، نہ کہ شرعی دلائل سے، تو اسے کبھی کوئی عقلی دلیل نہیں ملے گی، اور نہ ہی عقل سے یہ معلوم ہو گا کہ روحوں کے لیے موت کے بعد البقاء (بقا) اور الوجود (ہستی) ہے۔ اور جو کچھ بھی انہوں نے اس بارے میں دلیل کے طور پر اختیار کیا ہے، وہ ناقص ہے اور کسی بنیاد پر قائم نہیں ہے۔ ان کا کوئی بھی ماخذ ایسا نہیں ہے مگر وہ ممکن ہے، اور ممکن کے وجوبِ وجود یا وجوبِ عدم پر کوئی عقلی دلیل قائم نہیں ہو سکتی، کیونکہ اگر ایسا ہوتا تو اس کے امکان کی حقیقت ہی باطل ہو جاتی۔ پس ہمارے لیے وہی ہے جو شریعت نے واضح کیا ہے۔ عاقل شخص اپنے آپ کو اس چیز میں غور و فکر کرنے میں مشغول رکھتا ہے جو اس پر سب سے زیادہ واجب ہے، وہ اس سے تجاوز نہیں کرتا، کیونکہ مدت بہت کم ہے اور سانسیں قیمتی ہیں، اور جو گزر گیا وہ واپس نہیں آتا۔\n\n### بے شک اللہ ایک الٰہ ہے، اس کے سوا کوئی معبود نہیں (إن الله إله واحد لا إله إلا هو)\n\nپس جان لو کہ اللہ ایک الٰہ ہے، اس کے سوا کوئی معبود نہیں، وہ ان اسماء سے موسوم ہے جن سے اور جن کے معانی سے یہ سمجھا جاتا ہے کہ وہ صرف اسی کے لیے مناسب ہیں اور اس مرتبے کے حامل کے لیے۔ اے ولی! تم ماہیت، کمیت اور کیفیت میں غور و خوض کرنے کی کوشش نہ کرو، کیونکہ یہ تمہیں اس چیز میں غور و خوض کرنے سے نکال دے گا جس کے تم مکلف ہو۔ اور ایمان کے طریقے کو لازم پکڑو اور اس پر عمل کرو جو اللہ نے تم پر فرض کیا ہے۔ اور وَاذْكُرْ رَبَّكَ بِالْغُدُوِّ وَالْآصَالِ (اور صبح و شام اپنے رب کو یاد کرو) اس ذکر کے ساتھ جو اس نے تمہارے لیے مشروع کیا ہے، جیسے تہلیل، تسبیح اور تحمید۔ اور اللہ سے ڈرو۔ پس جب الحق (ذات حق) چاہے کہ وہ تمہیں اپنے علم میں سے جو چاہے، اس کی المعرفۃ (معرفت) کرائے، تو تم اپنی عقل اور اپنے لب (دل) کو اس علم کو قبول کرنے کے لیے حاضر رکھو جو وہ تمہیں عطا کرتا ہے اور بخشتا ہے۔ پس یہی نفع بخش ہے اور یہی وہ نور ہے جس سے تمہارا دل زندہ ہوتا ہے اور تم اپنے عالم میں اس کے ذریعے چلتے ہو، اور اس میں تم ان شبہات اور شکوک کے اندھیروں سے محفوظ رہتے ہو جو ان علوم پر طاری ہوتے ہیں جو افکار سے پیدا ہوتے ہیں۔ کیونکہ نور ہی نفور (دور کرنے والا) ہے۔ پس نور اس جگہ سے ظلمت کو دور کرنے والا ہے جہاں وہ ظاہر ہوتا ہے۔ اگر یہ علم جو اللہ کے بارے میں تفکر سے حاصل ہوتا ہے، نور ہوتا جیسا کہ وہ دعویٰ کرتے ہیں، تو اس جگہ پر شبہ کی ظلمت یا تشکیک کی ظلمت کبھی طاری نہ ہوتی۔ حالانکہ وہ طاری ہوتی ہے، اور ظلمت کی یہ شان نہیں ہے کہ وہ نور کو دور کرے اور نہ ہی اس پر اس کا کوئی تسلط ہے۔ بلکہ تسلط تو نور کا ہے جو ظلمت کو دور کرتا ہے۔ پس یہ اس بات پر دلالت کرتا ہے کہ اللہ کی ذات کے بارے میں کلام کرنے والوں اور اس میں غور و خوض کرنے والوں کے علوم انوار نہیں ہیں، اور وہ شبہ کے وارد ہونے سے پہلے یہ خیال کرتے ہیں کہ وہ نور میں ہیں اور اپنے رب کی طرف سے بصیرت پر ہیں اس معاملے میں۔ پس ان کی کمی ان پر ظاہر نہیں ہوتی جب تک کہ ان پر شبہ وارد نہ ہو۔ اور تمہیں کیا معلوم، شاید وہ شبہ جسے وہ شبہ سمجھتے ہیں، وہی حق اور علم ہو۔ کیونکہ تم یقیناً جانتے ہو کہ اشعری کی دلیل اس مسئلے کو ثابت کرنے میں جسے معتزلی نفی کرتا ہے، حق ہے، اور وہ معتزلی کے نزدیک شبہ ہے۔ اور معتزلی کی دلیل جس سے وہ اس چیز کی نفی کرتا ہے جسے اشعری ثابت کرتا ہے، وہ اشعری کے نزدیک شبہ ہے۔ پھر یہ کہ کوئی بھی مذہب ایسا نہیں ہے جس کے ائمہ نہ ہوں جو اسے قائم کرتے ہوں، اور وہ اس میں مختلف ہوتے ہیں، اگرچہ وہ سب مثلاً اشاعرہ کہلاتے ہیں۔ تو ابو المعالی اس کے خلاف رائے رکھتے ہیں جو قاضی نے اختیار کی، اور قاضی ایک ایسا مذہب اختیار کرتے ہیں جس میں وہ استاد کی مخالفت کرتے ہیں، اور استاد ایک مسئلے میں ایسا مذہب اختیار کرتے ہیں جس میں وہ شیخ کی مخالفت کرتے ہیں، اور سب دعویٰ کرتے ہیں کہ وہ اشعری ہے۔ اور اسی طرح معتزلہ ہیں، اور اسی طرح فلاسفہ اللہ کے بارے میں اور ان چیزوں کے بارے میں جو اعتقاد میں ہونی چاہئیں، اپنے اقوال میں مختلف ہیں۔ اور وہ ہمیشہ اختلاف کرتے رہیں گے: وَلَا يَزَالُونَ مُخْتَلِفِينَ (اور وہ ہمیشہ اختلاف کرتے رہیں گے)، اس کے باوجود کہ ہر گروہ ایک ہی مقام اور ایک ہی نام سے جمع ہوتا ہے، لیکن وہ اس مذہب کے اصولوں میں مختلف ہیں جس نے انہیں جمع کیا ہے، کیونکہ فروع کا اعتبار نہیں کیا جاتا۔ اور ہم نے قدیم و جدید میں آدم سے لے کر محمد تک اور ان کے درمیان تمام رسولوں اور انبیاء کو دیکھا، ان سب پر صلوٰۃ و سلام ہو، ہم نے ان میں سے کسی کو بھی اللہ کی جناب میں اپنے عقیدے کے اصولوں میں اختلاف کرتے ہوئے نہیں دیکھا، بلکہ ان میں سے ہر ایک دوسرے کی تصدیق کرتا ہے۔ اور نہ ہی ہم نے ان میں سے کسی کے بارے میں سنا کہ اس کے عقیدے اور اپنے رب کے علم میں کبھی کوئی شبہ طاری ہوا ہو، اور پھر اس نے کسی دلیل سے اس سے چھٹکارا پایا ہو۔ اگر ایسا ہوتا تو وہ نقل کیا جاتا، لکھا جاتا، اور کتابوں میں بیان کیا جاتا، جیسا کہ ان لوگوں کے بارے میں نقل کیا گیا ہے جنہوں نے اس میں کلام کیا ہے۔ خاص طور پر جب کہ انبیاء نے عام لوگوں پر ان کی جانوں، مالوں اور اہل و عیال میں حکم چلایا، پابندیاں لگائیں، اجازت دی، اور واجب قرار دیا، اور یہ قوتِ تحکم کسی اور کے پاس نہیں تھی۔ پس ان کے درمیان الحق (ذات حق) کے معاملے میں جو اختلاف ہوا، اسے نقل کرنے کے لیے محرکات بہت زیادہ تھے، کیونکہ وہ اس کی طرف منسوب ہوتے تھے اور کہتے تھے کہ اس نے انہیں بھیجا ہے، اور انہوں نے معجزات سے اس پر دلائل پیش کیے۔ لیکن ان میں سے کسی کے بارے میں بھی یہ نقل نہیں کیا گیا کہ اس پر اپنے رب کے علم میں کوئی شبہ طاری ہوا ہو، اور نہ ہی ان میں سے کسی نے دوسرے سے اس معاملے میں اختلاف کیا۔ اور اسی طرح رسولوں کے متبعین میں سے متقی اہل الکشف (کشف) نے بھی اللہ کے بارے میں، یعنی اپنے علم میں، اختلاف نہیں کیا، اور نہ ہی ان میں سے کسی کے بارے میں یہ نقل کیا گیا کہ اس نے دوسرے کی مخالفت کی ہو، جہاں تک اس کے کشف اور خبر دینے کا تعلق ہے، نہ کہ اس کی فکر کا، کیونکہ فکر تو اہل افکار کے ساتھ شامل ہو جاتی ہے۔ یہ چیز تمہیں اس بات پر دلالت کرتی ہے کہ ان کے علوم انوار تھے، جن پر شبہ کو بالکل بھی تعرض کرنے کی طاقت نہیں ملی۔ پس تم نے جان لیا کہ نور صرف اہل نور کے لیے مخصوص ہے، اور وہ انبیاء اور رسول ہیں اور وہ لوگ جنہوں نے ان کے مشروع کردہ راستے پر عمل کیا اور ان کی مقرر کردہ حدود سے تجاوز نہیں کیا، اور اللہ سے ڈرے اور اللہ کے ساتھ ادب کو لازم پکڑا۔ پس وہ اپنے رب کی طرف سے نور پر ہیں: نُورٌ عَلَى نُورٍ (نور پر نور)۔ اور لَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا (اور اگر یہ اللہ کے سوا کسی اور کی طرف سے ہوتا تو وہ اس میں بہت زیادہ اختلاف پاتے)۔ یعنی الحق (ذات حق) کی تعریف اور اس کے لیے جو واجب ہے اس میں۔ کیونکہ جو شخص اپنے عقیدے میں اپنی فکر سے غور کرتا ہے، وہ ہمیشہ ایک ہی حالت پر قائم نہیں رہتا، بلکہ وہ ہر وقت اپنے زعم میں اس وقت کی دلیل کے مطابق ہوتا ہے، تو وہ ایک امر سے اس کے نقیض کی طرف نکل جاتا ہے۔ اے میرے بھائی! میں نے تمہیں نفع بخش علم کا راستہ دکھا دیا ہے کہ وہ تمہیں کہاں سے حاصل ہو گا۔ پس اگر تم اس کے صراط مستقیم پر چلو:\n\n### بے شک اللہ کا ایک بندہ ہے جس پر اس نے توجہ دی اور اسے اپنے لیے چن لیا (إن لله عبد قد اعتنى به واصطنعه لنفسه‏)\n\nپس جان لو کہ اللہ نے تمہارا ہاتھ پکڑ لیا ہے، تم پر توجہ دی ہے اور تمہیں اپنے لیے چن لیا ہے۔ پس اللہ ہمارے اور ہمارے افکار کے تسلط کے درمیان حائل ہو جاتا ہے اس چیز میں جس میں ہمیں تفکر کا حکم نہیں دیا گیا۔ اور جو کچھ ہم نے ذکر کیا ہے، اس سے تمہارے لیے واضح ہو گیا ہے کہ ان پر جو کچھ بھی آیا، وہ صرف فضول گوئی کی وجہ سے آیا، اور اسی وجہ سے اختلاف واقع ہوا اور افکار اور خواہشات نے ان سے کھیل کیا۔ کیا تم نہیں دیکھتے کہ وہ امر جس کے علم کو شارع نے ان کے لیے مباح کیا، اس میں ان میں سے دو نے بھی اختلاف نہیں کیا؟ اگر ان سے اس کے علاوہ کسی اور چیز کا مطالبہ کیا جاتا جس میں انہوں نے اختلاف کیا، تو وہ اس میں بھی اختلاف نہ کرتے۔ پس یہ اس بات پر دلالت کرتا ہے کہ الحق (ذات حق) نے ان سے اس کا مطالبہ نہیں کیا۔ اگر تم کہو کہ وہ کیا ہے جس پر وہ متفق ہوئے؟ ہم کہتے ہیں: ہر گروہ کے عقلی دلائل، بلکہ عقلوں کی ضروریات اس بات پر متفق ہوئیں کہ ان کا ایک موجد ہے جس نے انہیں الوجود (ہستی) بخشا، جس پر وہ اپنے وجود میں انحصار کرتے ہیں، اور وہ ان سے بے نیاز ہے۔ اس میں دو نے بھی اختلاف نہیں کیا، اور یہی وہ چیز ہے جس کے وجود کو ثابت کرنے کا الحق (ذات حق) نے اپنے بندوں سے مطالبہ کیا ہے۔ اگر وہ یہاں رک جاتے، یہاں تک کہ الحق (ذات حق) خود اپنے رسول کی زبان سے انہیں اس چیز کی المعرفۃ (معرفت) کراتا جو اس کی طرف منسوب ہونی چاہیے اور جس سے اسے موسوم کیا جانا چاہیے، تو وہ کامیاب ہو جاتے۔ لیکن انسان جلد باز پیدا کیا گیا ہے اور اس نے اپنے نفس میں فکری قوت دیکھی، تو اس نے اسے غلط جگہ استعمال کیا، اور اللہ کے بارے میں اس نے اس کے مطابق کلام کیا جو اس کی نظر نے اسے عطا کیا۔ اور مزاج مختلف ہوتے ہیں، اور فکری قوت مزاج سے پیدا ہوتی ہے، تو اس کی نظر مزاج کے اختلاف سے مختلف ہوتی ہے، پس اس کا ادراک اور اس کے ادراک کردہ چیز کے بارے میں اس کا حکم مختلف ہوتا ہے۔ اللہ ہمیں ہدایت دے اور ہمیں ان لوگوں میں شامل کرے جنہوں نے الحق (ذات حق) کو اپنا امام بنایا اور اس چیز کو لازم پکڑا جو اس نے ان کے لیے مشروع کی اور اس پر چلے۔ بے شک وہ اس کا مالک ہے، اس کے سوا کوئی رب نہیں۔\n\n### بے شک اللہ نے رسولوں کو بے کار نہیں بھیجا (أن الله ما بعث الرسل سدى‏)\n\nپس اے ولی! جان لو کہ اللہ نے رسولوں کو بے کار نہیں بھیجا۔ اگر عقلیں اپنی سعادت کے امور میں خود کفیل ہوتیں، تو انہیں رسولوں کی ضرورت نہ ہوتی اور رسولوں کا الوجود (ہستی) عبث ہوتا۔ لیکن چونکہ وہ ذات جس پر ہم انحصار کرتے ہیں، وہ ہماری مشابہت نہیں رکھتی اور نہ ہم اس کی مشابہت رکھتے ہیں، اور اگر وہ عیناً ہماری مشابہت رکھتی، تو ہمارا اس پر انحصار کرنا اس کے ہم پر انحصار کرنے سے زیادہ اولیٰ نہ ہوتا۔ پس ہم نے یقیناً جان لیا، ایسا علم جس میں اس مقام پر کوئی شبہ داخل نہیں ہو سکتا، کہ وہ ہماری مثل نہیں ہے اور نہ ہی کوئی ایک حقیقت ہمیں جمع کرتی ہے۔ پس انسان کے لیے یہ ضروری ہے کہ وہ اس چیز سے جاہل ہو جو اس کے لیے ہے، اور وہ کہاں منتقل ہو گا، اور اس کی سعادت کا سبب کیا ہے اگر وہ سعید ہوا، یا اس کی شقاوت کا سبب کیا ہے اگر وہ شقی ہوا، اس ذات کے نزدیک جس پر اس نے انحصار کیا ہے، کیونکہ وہ اس میں اللہ کے علم سے جاہل ہے، وہ نہیں جانتا کہ وہ اس سے کیا چاہتا ہے اور اسے کس لیے پیدا کیا ہے۔ پس اسے اس بارے میں الٰہی تعریف کی ضرورت پڑی۔ اگر وہ چاہتا تو ہر شخص کو اس کی سعادت کے اسباب سے آگاہ کر دیتا اور اسے وہ راستہ واضح کر دیتا جس پر اسے چلنا چاہیے۔ لیکن اس نے یہی چاہا کہ وہ ہر امت میں ان ہی کی جنس سے ایک رسول بھیجے، نہ کہ کسی اور جنس سے، جسے وہ ان پر مقدم کرے اور انہیں اس کی پیروی کرنے اور اس کی اطاعت میں داخل ہونے کا حکم دے، یہ اس کی طرف سے ان کے لیے آزمائش ہے تاکہ ان پر حجت قائم ہو جائے، اس علم کی بنا پر جو اس کے علم میں پہلے سے موجود تھا۔ پھر اس نے اسے بینہ (واضح دلیل) اور آیت (نشانی) سے اس کی رسالت میں سچائی پر تائید دی جو وہ لایا تھا، تاکہ اس پر ان کے خلاف حجت قائم ہو۔ اور ہم نے یہ اس لیے کہا کہ \"ان ہی کی جنس سے\" کیونکہ معاملہ ایسا ہی واقع ہوا ہے۔ اللہ تعالیٰ نے فرمایا: وَلَوْ جَعَلْنَاهُ مَلَكًا لَّجَعَلْنَاهُ رَجُلًا (اور اگر ہم اسے فرشتہ بناتے تو بھی اسے مرد ہی بناتے)۔ یعنی اگر بشر کے لیے رسول فرشتہ ہوتا تو وہ ایک مرد کی صورت میں نازل ہوتا تاکہ وہ نہ جانیں کہ وہ فرشتہ ہے۔ کیونکہ مرتبے پر حسد صرف ہم جنسوں کے درمیان واقع ہوتا ہے۔ اور اللہ تعالیٰ نے فرمایا: لَّوْ كَانَ فِي الْأَرْضِ مَلَائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنَا عَلَيْهِم مِّنَ السَّمَاءِ مَلَكًا رَّسُولًا (اگر زمین میں فرشتے ہوتے جو اطمینان سے چلتے پھرتے، تو ہم ان پر آسمان سے ایک فرشتہ رسول نازل کرتے)۔ اور اس بارے میں ہمارا قول ہے:\n\nقوم کا خلیفہ ان ہی کی جنس کے بیٹوں میں سے ہوتا ہے *** کیونکہ یہ ان کے نفوس پر زیادہ گراں گزرتا ہے۔\n\nاگر وہ ان میں سے نہ ہوتا تو وہ اس کی تصدیق کرتے *** اور ان میں غیر جنس کے لیے حسد پیدا نہ ہوتا۔\n\nانسان جانتا ہے کہ چوپائے اور تمام حیوانات مرتبے میں اس سے کم ہیں۔ پس اگر کوئی حیوان، خواہ وہ بھونرا ہی کیوں نہ ہو، کلام کرتا اور کہتا کہ میں اللہ کی طرف سے تمہاری طرف رسول ہوں، فلاں چیز سے بچو اور فلاں کام کرو، تو عام لوگوں کے محرکات اس کی پیروی کرنے، اس سے برکت حاصل کرنے اور اس کی تعظیم کرنے پر متفق ہو جاتے، اور بادشاہ بھی اس کے تابع ہو جاتے، اور وہ اس سے اس کی سچائی پر کوئی نشانی طلب نہ کرتے، اور اس کے کلام کو ہی اس کی سچائی پر نشانی قرار دیتے۔ حالانکہ معاملہ ایسا نہیں ہے۔ بلکہ جب مرتبے کو غیر جنس نے حاصل کیا تو ان میں غیر جنس کے لیے حسد پیدا نہیں ہوا۔ پس پہلی آزمائش جو اللہ نے اپنی مخلوق کو دی، وہ یہ تھی کہ ان کی طرف ان ہی میں سے رسول بھیجے، نہ کہ کسی اور سے۔ اور ان دلائل کے باوجود جو اس نے ان کی سچائی پر قائم کیے اور جن کا انہوں نے یقین کر لیا، ان پر غالب حسد کے تسلط نے انہیں مجبور کیا کہ وہ اس چیز کا انکار کر دیں جسے وہ جانتے اور یقین رکھتے تھے، ظلم اور تکبر کی وجہ سے۔ اللہ تعالیٰ نے فرمایا: وَجَحَدُوا بِهَا وَاسْتَيْقَنَتْهَا أَنفُسُهُمْ ظُلْمًا وَعُلُوًّا (اور انہوں نے ان کا انکار کر دیا، حالانکہ ان کے دلوں نے ان کا یقین کر لیا تھا، ظلم اور تکبر کی وجہ سے)۔ یعنی انہوں نے اس سے اپنے نفوس پر ظلم کیا اور ان لوگوں پر تکبر کیا جن کی طرف انہیں بھیجا گیا تھا۔ پس اس میں اللہ پر ان کا تکبر بھی شامل ہو گیا۔ اگر تم ان سے کہو: اے فلاں! تم اپنے خالق پر کیسے تکبر کرتے ہو؟ تو وہ اس سے پناہ مانگے گا اور کہے گا کہ یہ شخص جو دعویٰ کرتا ہے کہ وہ اللہ کی طرف سے ہے، وہ اللہ پر جھوٹ بولتا ہے۔ اللہ کی پناہ کہ وہ ہمارے پاس ایسا شخص بھیجے۔ لَوْلَا نُزِّلَ هَذَا الْقُرْآنُ عَلَى رَجُلٍ مِّنَ الْقَرْيَتَيْنِ عَظِيمٍ (یہ قرآن ان دو بستیوں کے کسی بڑے آدمی پر کیوں نہ نازل کیا گیا؟)۔ اگر ان سے کہا جائے کہ وہ تو تمہارے پاس اللہ کی طرف سے رسول ہونے کی علامت لے کر آیا ہے، تو وہ کہے گا: کیا تم نہیں جانتے کہ جادو حق ہے؟ یہ نشانی اسی قبیل سے ہے۔ یہ تو عام لوگوں کے ساتھ معاملہ ہے۔ جہاں تک علماء اور خواص جیسے حکماء وغیرہ کا تعلق ہے، تو جب ان سے کہا جاتا ہے کہ کیا تم ان نشانیوں کو نہیں دیکھتے جو اس کے دعوے کی سچائی پر دلالت کرتی ہیں؟ تو نفوس اور ان کی قوتوں کے عالم اس کا جواب یہ دیتے ہیں کہ وہ کہتے ہیں: ہم جانتے ہیں کہ نفسانی قوتیں اس حد تک پہنچ جاتی ہیں کہ عالم کے اجسام ان سے متاثر ہوتے ہیں، تو یہ اسی قبیل سے ہے۔ اور وہ صاحبِ عین (نظر لگانے والے) اور علمِ زجر (فال نکالنے کا علم) اور اس طرح کی چیزوں سے دلیل پکڑتے ہیں جو اس فن سے مشابہ ہیں۔ اور اگر اس کے پاس ستاروں کی گردش کا علم ہو اور وہ ان کی قوتوں کو دیکھتا ہو اور عنصری عالم میں ان کا مخصوص انداز میں چلنا دیکھتا ہو، تو وہ کہتا ہے کہ طالع نے اسے یہ عطا کیا ہے، اور ستاروں کی روحانیت اسے مدد دیتی ہے، اور نطفے کے گرنے کے وقت اس طالع کی وجہ سے اسے شرف حاصل ہوا اور اس نے اسے یہ شریف قوتیں عطا کیں اور اس نے الٰہیات میں بلند مراتب حاصل کیے۔ اور جو کچھ اس نے کہا ہے وہ صحیح ہے، کیونکہ اللہ نے یہ سب کچھ عالم علوی میں اس وقت ودیعت کر دیا تھا جب اس نے اسے پیدا کیا تھا، یہ ایک آزمائش ہے جس سے اللہ اپنے بندوں کو آزماتا ہے۔ پس جب وہ اس چیز کو ان روحانی قوتوں کی طرف منسوب کرتے ہیں اور اس قدر میں اللہ کی نظر سے اسے الگ کر دیتے ہیں، تو انہیں کفار کہا جاتا ہے، اگرچہ وہ اپنی بات میں درست ہوں، کیونکہ اللہ نے عالم کی ترتیب اسی طرح رکھی ہے۔ لیکن ان پر ان کے علم کی جہالت کی وجہ سے آفت آئی۔ اسی وجہ سے ایک گروہ نے کہا کہ علم حجاب ہے، حالانکہ معاملہ ایسا نہیں ہے۔ کیونکہ ان کا یہ علم اس علم کے منافی نہیں ہے کہ اللہ نے یہ سب کچھ ان کی روحانیت میں ودیعت کر رکھا ہے۔ پس حقیقت میں ان پر ان کے علم کی وجہ سے آفت نہیں آئی، بلکہ ان کی جہالت کی وجہ سے آئی۔ پس جب رسولوں کے ذریعے سعادت کے راستے واضح ہو گئے، تو اللہ تعالیٰ نے فرمایا: إِنَّا هَدَيْنَاهُ السَّبِيلَ إِمَّا شَاكِرًا وَإِمَّا كَفُورًا (بے شک ہم نے اسے راستہ دکھا دیا، خواہ وہ شکر گزار ہو یا ناشکرا)۔ اور اس کے بعد صرف یہی باقی رہ جاتا ہے کہ اللہ اپنے بندوں کو اس پر عمل کرنے کی توفیق دے جس کا اللہ نے انہیں اپنے رسول صَلَّى اللهُ عَليهِ وسَلَّم کی پیروی کرنے کا حکم دیا ہے، ان چیزوں میں جن کا اس نے حکم دیا اور جن سے منع کیا، اور اس کی حدود اور رسموں پر قائم رہیں۔ اور وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔ اور یہ منزل علمِ تنزیہ، علمِ اسماء، علمِ ابتلاء (آزمائش)، علمِ نسب، علمِ علل (اسباب)، علمِ اخبار، علمِ مآخذِ ادلہ (دلائل کے ماخذ) اور ایک ہی مدلول پر ان کی کثرت کے سبب، علمِ اختصاص، علمِ مراتب، علمِ صفات، علمِ قضاء، علمِ امامت، علمِ شرائع، علمِ انتقالات (منتقلی)، علمِ رجاء (امید)، علمِ اسبابِ فوز و البقاء (بقا) اور علمِ ترجیح پر مشتمل ہے۔ اور اسی علم کی وجہ سے لوگوں نے اپنی خواہشات کی پیروی کی اور الحق (ذات حق) کو چھوڑ دیا اور اسے پس پشت ڈال دیا۔ پس اللہ ہمیں اس صفت کے ہم میں قائم ہونے سے محفوظ رکھے۔ فَسُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ (پس اے اللہ! تو پاک ہے اور تیری ہی حمد ہے، تیرے سوا کوئی معبود نہیں، میں تجھ سے مغفرت چاہتا ہوں اور تیری طرف توبہ کرتا ہوں)۔",
    "fa": "باب سیصد و بیست و دوم در معرفت منزل کسی که حق را به خلق فروخت، و او از حضرت محمدیه (الحضرة المحمدية) است.\n\nگرد آمدن مردمان بر امامی واحد،\nخود دلیل آشکار بر خدای یگانه است.\nو اگر غیر خدا ادعای مقام او کند،\nآن دلیل بر خیال فاسد است.\nهیهات، کجاست آن یگانه دانایی که\nنسبت‌های موجود در عالم شهود را نمی‌پذیرد؟\nعقل سلیم نمی‌پذیرد آنچه را\nکه شریعت از وجود زائد (وجود الزائد) عطا می‌کند،\nمگر آنکه فکر را در آن مداخل باشد،\nو کسی که توقف کند (الواقفي) مانند منکر (الجاحد) است.\nاقوام جز عقل‌های خود را نمی‌پرستند،\nو مردم میان مسلمان و معاند هستند.\n\nخداوند عز و جل فرمود: «و خدای شما خدایی یگانه است» (وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ). و فرمود: «اگر در آسمان‌ها و زمین خدایانی جز الله می‌بود، قطعاً تباه می‌شدند» (لَوْ كَانَ فِيهِمَا آلِهَةٌ إِلَّا اللَّهُ لَفَسَدَتَا). و فرمود: «من در زمین جانشینی (خلیفه) قرار خواهم داد» (إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً). و رسول خدا (صلی الله علیه و سلم) فرمود: «اگر با دو خلیفه بیعت شد، دومی را بکشید.»\n\nو فرمود (صلی الله علیه و سلم): «خلفا از قریش هستند.»\n\n«تقرّش» به معنای جمع شدن و گرد آمدن است. و چون این قبیله، قبایل دیگر را گرد آورد، قریش نامیده شد، یعنی مجموع قبایل. و از همین ریشه، حیوان دریایی‌ای است که به آن قِرش (کوسه) می‌گویند؛ من آن را دیدم در حالی که جمع و منقبض بود. همچنین امام نیز اگر متصف به اخلاق کسی که او را جانشین کرده نباشد و جامع آن اخلاقیات که مورد نیاز کسانی است که بر آن‌ها خلیفه شده، نباشد، خلافتش صحیح نیست. پس او واحدِ مجموع است. احدیت (أحدية) او، احدیت جمع است. و از میان روزها، روز جمعه از آنِ اوست که اجتماع در شهر بر یک امام واحد است. و از میان احوال، نماز از آنِ اوست، زیرا نماز را جز یک امام در جماعت اقامه نمی‌کند و باید «أقرأ»ترین آن‌ها باشد، یعنی کسی که بیشترین جمع‌آوری قرآن را کرده است. و از مراتب علوم، علوم انوار (علوم الأنوار) از آنِ اوست، و اگر علوم اسرار (علوم الأسرار) به او داده نشود، صاحب این مقام باکی ندارد؛ زیرا نماز نور است و با نور هدایت می‌شود. و امام ناگزیر از نوری است که با آن کشف کند و در عالمی که خداوند او را بر آن ولایت داده، با آن حرکت کند. همت‌های مردم در هر روستا یا شهر یا جماعتی بر این قرار گرفته است که رئیسی داشته باشند که به او رجوع کنند و تحت امر او باشند. و رسول خدا (صلی الله علیه و سلم) هرگاه سریه‌ای (گروه نظامی) می‌فرستاد، حتی اگر آن سریه دو نفر بودند، یکی از آن دو را امیر می‌ساخت.\n\nاین مقامی شریف است که علم خاصی دارد؛ کسی که آن علم را داشته باشد، شایسته است که امام باشد. آیا نمی‌بینی هنگامی که صحابه در امارت اسامة بن زید طعنه زدند، زمانی که رسول خدا (صلی الله علیه و سلم) او را بر سپاه مقدم داشت و او بیرون مدینه اردو زد و به او فرمان داد که با سپاهش به سرزمین روم بتازد، در حالی که ابوبکر و عمر نیز در میان آن سپاه بودند؟ پس رسول خدا (صلی الله علیه و سلم) به طعنه‌زنندگان در امارت او فرمود: «به خدا سوگند، شما پیش از این نیز در امارت پدرش طعنه زدید. به خدا سوگند، او شایسته و سزاوار آن است.»\n\nو ملائکه در خلافت آدم (علیه السلام) طعنه زدند، پس خداوند به آن‌ها پاسخ داد، همان‌گونه که رسول خدا (صلی الله علیه و سلم) در حق اسامه پاسخ داد، که این تخلق به اخلاق الهی در این زمینه است. و اتخاذ امام شرعاً واجب است، با وجود اینکه در فطرت عالم نیز موجود است، یعنی طلب نصب امام. اگر بگویی: «شارع (قانون‌گذار) به طور صریح به اتخاذ امام امر نکرده است، پس چگونه واجب می‌شود؟» می‌گوییم: خداوند متعال بی‌شک به اقامه دین امر کرده است، و راهی برای اقامه آن نیست مگر با وجود امنیت در میان مردم بر جان‌ها، اموال و خانواده‌هایشان از تجاوز برخی به برخی دیگر. و این هرگز محقق نمی‌شود مگر اینکه کسی باشد که از سطوتش بترسند و به رحمتش امید داشته باشند، و امورشان به او بازگردد و بر او اجتماع کنند. پس هنگامی که دل‌هایشان از ترسی که بر اموال و جان‌ها و خانواده‌هایشان داشتند، فارغ شود، برای اقامه دینی که خداوند بر آن‌ها واجب کرده است، فارغ می‌شوند. و چیزی که واجب جز به واسطه آن حاصل نمی‌شود، خود واجب است. پس اتخاذ امام واجب است و واجب است که یک نفر باشد تا اختلاف نکنند و این اختلاف به جلوگیری از تحقق مصلحت و به فساد منجر نشود. پس برای تو روشن شد که مقصود از توحید (توحيد) خداوند که به علم آن امر شده‌ایم، توحید الوهیت (توحيد الألوهية) برای اوست، سبحانه، که هیچ خدایی جز او نیست. خداوند متعال فرمود: «پس بدان که هیچ خدایی جز الله نیست» (فَاعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ). و نفرمود:\n\n### [همانا ذات خداوند تقسیم‌پذیر نیست]\n\nپس بدان که ذات او تقسیم‌پذیر نیست، و نه اینکه مرکب نیست، و نه اینکه از چیزی مرکب است، و نه اینکه جسم است، و نه اینکه جسم نیست؛ بلکه در وصف خود فرمود: «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْءٌ). و چون حق (الحق) سبحانه متعرض تعریف بندگانش به آنچه با عقل‌هایشان در آن فرو رفته‌اند، نشد و خداوند در کتابش به آن‌ها امر به نظر فکری نکرد، مگر برای اینکه با آن استدلال کنند که او خدایی یگانه است، یعنی این‌ها جز بر وحدانیت در مرتبه دلالت نمی‌کنند. پس «دو خدا نگیرید، همانا او خدایی یگانه است» (لَا تَتَّخِذُوا إِلَهَيْنِ اثْنَيْنِ إِنَّمَا هُوَ إِلَهٌ وَاحِدٌ). اما آن‌ها در نظر فکری زیاده‌روی کردند و از مقصودی که مکلف به آن بودند، خارج شدند. پس صفاتی را برای او اثبات کردند که او برای خود اثبات نکرده بود، و گروهی دیگر آن صفات را از او نفی کردند، در حالی که او خود آن‌ها را نفی نکرده بود و در کتابش و بر زبان پیامبرانش نیز بر آن‌ها تصریح ننموده بود. سپس در اطلاق اسماء بر او اختلاف کردند. برخی بر او نام‌هایی اطلاق کردند که او بر خود اطلاق نکرده بود، هرچند آن نام، اسم تنزیه باشد، اما این از فضولیات گوینده و خوض‌کننده در آن است. سپس شروع به سخن گفتن در ذات او کردند، در حالی که شرع آن‌ها را از تفکر در ذات او جل و تعالی نهی کرده است. و خداوند سبحانه فرمود: «و خداوند شما را از [عواقب مخالفت با] خود برحذر می‌دارد» (وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ)، یعنی متعرض تفکر در آن نشوید. پس به فضولیات آن‌ها، نافرمانی از شرع با خوض در آنچه نهی شده بودند، اضافه شد. پس برخی گفتند او جسم است، و برخی گفتند جسم نیست. برخی گفتند جوهر است، و برخی گفتند جوهر نیست. برخی گفتند در جهت است، و برخی گفتند در جهت نیست. در حالی که خداوند هیچ‌یک از خلقش را به خوض در این امور، نه نفی‌کننده و نه اثبات‌کننده، امر نکرده است. اگر از آن‌ها خواسته می‌شد که معرفت ذات واحدی از عالم را محقق سازند، نمی‌توانستند آن را بشناسند. و اگر به این خوض‌کننده گفته می‌شد: «تدبیر نفس تو برای بدنت چگونه است؟ آیا نفس در بدن داخل است یا خارج از آن، یا نه داخل است و نه خارج؟ و با عقلت در این باره بنگر. و آیا این امر زائدی که این جسم حیوانی با آن حرکت می‌کند و می‌بیند و می‌شنود و تخیل می‌کند و تفکر می‌نماید، به چه چیزی بازمی‌گردد؟ آیا به یک چیز بازمی‌گردد یا به چیزهای متعدد؟ و آیا به عرض بازمی‌گردد یا به جوهر یا به جسم؟» و اگر این را با ادله عقلی، نه شرعی، طلب می‌کرد، هرگز دلیلی عقلی برای آن نمی‌یافت و با عقل نمی‌دانست که ارواح پس از مرگ بقا و وجود دارند. و هر دلیلی که در این باره اتخاذ کرده‌اند، معیوب است و بر پای خود نمی‌ایستد. هیچ مأخذی در آن نیست مگر اینکه ممکن است، و ممکن را هرگز دلیل عقلی بر وجوب وجود یا وجوب عدمش اقامه نمی‌کند، زیرا اگر چنین بود، حقیقت امکانش محال می‌شد. پس ما را جز آنچه شرع بر آن تصریح کرده، نیست. پس عاقل خود را به نظر در آنچه بر او واجب‌تر است مشغول می‌سازد و از آن تجاوز نمی‌کند، زیرا مدت کوتاه است و نفس‌ها نفیس‌اند و آنچه از آن گذشته، بازنمی‌گردد.\n\n### [همانا خداوند خدایی یگانه است، هیچ خدایی جز او نیست]\n\nپس بدان که خداوند خدایی یگانه است، هیچ خدایی جز او نیست، و به نام‌هایی نامیده شده که از آن‌ها و معانی‌شان فهمیده می‌شود که جز برای او و کسی که این مرتبه را دارد، شایسته نیست. ای ولیّ، متعرض خوض در ماهیت، کمیت و کیفیت نشو، زیرا این تو را از خوض در آنچه مکلف شده‌ای، خارج می‌سازد. و طریق ایمان و عمل به آنچه خداوند بر تو فرض کرده است را لازم بگیر و «پروردگارت را یاد کن... در بامدادان و شامگاهان» (وَاذْكُرْ رَبَّكَ... بِالْغُدُوِّ وَالْآصَالِ) با ذکری که برایت تشریع کرده است، از تهلیل و تسبیح و تحمید. و تقوای الهی پیشه کن. پس اگر حق (الحق) بخواهد تو را به آنچه از علمش خواسته، بشناساند، عقل و لُبّ خود را برای پذیرش آنچه به تو عطا می‌کند و می‌بخشد، حاضر کن. این همان علم نافع است و نوری است که قلب تو را با آن زنده می‌کند و با آن در عالم خود حرکت می‌کنی و در آن از تاریکی شبهات و شک‌هایی که در علومی که زاییده افکار هستند، عارض می‌شوند، در امان می‌مانی. زیرا نور، نفور (گریزاننده) است؛ پس نور، تاریکی را از محلی که در آن ظاهر می‌شود، می‌گریزاند. اگر این علمی که تفکر در خدا آن را پوشانده است، نور بود، چنانکه گمان می‌کنند، هرگز تاریکی شبهه و تاریکی تشکیک بر آن محل عارض نمی‌شد، در حالی که عارض شده است. و شأن تاریکی این نیست که نور را بگریزاند و بر آن سلطه‌ای ندارد، بلکه سلطه از آنِ نور است که تاریکی را می‌گریزاند. پس این دلالت می‌کند بر اینکه علوم متکلمین در ذات خدا و خوض‌کنندگان در آن، انوار نیستند. و آن‌ها پیش از ورود شبهه، خیال می‌کنند که در نور هستند و بر بینه‌ای از پروردگارشان در این باره قرار دارند. پس نقصشان بر آن‌ها آشکار نمی‌شود تا اینکه شبهه بر آن‌ها وارد شود. و چه می‌دانی، شاید آن شبهه‌ای که گمان می‌کنند شبهه است، همان حق و علم باشد. زیرا تو قطعاً می‌دانی که دلیل اشعری در اثبات مسئله‌ای که معتزلی آن را نفی می‌کند، حق است و نزد معتزلی شبهه است؛ و دلیل معتزلی که با آن چیزی را که اشعری اثبات می‌کند، نفی می‌نماید، نزد اشعری شبهه است. سپس هیچ مذهبی نیست مگر اینکه امامانی دارد که آن را برپا می‌دارند و در آن با هم اختلاف دارند، هرچند همگی مثلاً به اشاعره متصف باشند. پس ابوالمعالی خلاف آنچه قاضی بدان رفته، می‌رود؛ و قاضی به مذهبی می‌رود که با استاد در آن مخالفت می‌کند؛ و استاد در مسئله‌ای به مذهبی می‌رود که با شیخ در آن مخالفت می‌کند، و همه ادعا می‌کنند که اشعری هستند. و همچنین معتزله و فلاسفه در مقالاتشان درباره خدا و آنچه باید اعتقاد شود. و «همواره در اختلاف خواهند بود» (وَلَا يَزَالُونَ مُخْتَلِفِينَ)، با وجود اینکه هر طایفه‌ای را یک مقام و یک نام جمع کرده است، اما در اصول آن مذهبی که آن‌ها را جمع کرده، اختلاف دارند، زیرا فروع مورد اعتبار نیستند. و ما مسلمانان، رسولان و پیامبران را از قدیم و جدید، از آدم تا محمد و کسانی که بین آن‌ها بودند (علیهم الصلاة والسلام)، دیدیم که هرگز هیچ‌یک از آن‌ها در اصول اعتقادشان در جناب حق (الحق) اختلاف نکردند، بلکه هر یک دیگری را تصدیق می‌کرد. و هرگز نشنیدیم که بر هیچ‌یک از آن‌ها در اعتقاد و علمشان به پروردگارشان شبهه‌ای عارض شده باشد که با دلیلی از آن جدا شده باشند. اگر چنین بود، قطعاً نقل و تدوین می‌شد و کتاب‌ها بدان نطق می‌کردند، همان‌گونه که سایر آنچه متکلمین در آن سخن گفته‌اند، نقل شده است. به ویژه اینکه پیامبران بر عموم مردم در جان‌ها، اموال و خانواده‌هایشان حاکم بودند و محدودیت‌هایی قرار دادند و مباح کردند و واجب ساختند، و غیر آن‌ها این قدرت حاکمیت را نداشتند. پس انگیزه‌ها برای نقل آنچه در جانب حق (الحق) اختلاف کرده بودند، فراهم بود، زیرا آن‌ها خود را به حق نسبت می‌دادند و می‌گفتند که او آن‌ها را فرستاده است و دلایل آن را از معجزات آوردند. با این حال، از هیچ‌یک از آن‌ها نقل نشده است که شبهه‌ای در علمش به پروردگارش بر او عارض شده باشد و هیچ‌یک از آن‌ها با دیگری در این باره اختلاف نکرده است. همچنین اهل کشف (الکشف) پرهیزکار از پیروان رسولان، در مورد خدا، یعنی در علمشان به او، اختلاف نکرده‌اند و از هیچ‌یک از آن‌ها چیزی نقل نشده است که از حیث کشف و اخبارش با دیگری مخالفت کند، نه از حیث فکرش، زیرا آن [فکر] با اهل افکار وارد می‌شود. این امر دلالت می‌کند بر اینکه علوم آن‌ها انوار (أنوار) بوده است و شبهه نتوانسته است به طور کلی متعرض آن‌ها شود. پس دانستی که نور تنها به اهل نور اختصاص دارد، و آن‌ها پیامبران و رسولان هستند و کسانی که بر آنچه آن‌ها تشریع کرده‌اند، سلوک کرده‌اند و از حدود آنچه مقرر کرده‌اند، تجاوز نکرده‌اند و تقوای الهی پیشه کرده‌اند و ادب با خدا را لازم گرفته‌اند. پس آن‌ها بر نوری از پروردگارشان هستند: «نوری بر فراز نور» (نُورٌ عَلَى نُورٍ). و «اگر از جانب غیر خدا بود، قطعاً در آن اختلاف بسیاری می‌یافتند» (وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا)، یعنی در وصف حق (الحق) و آنچه برای او واجب است. زیرا کسی که با فکر خود در اعتقادش نظر می‌کند، همیشه بر یک حالت باقی نمی‌ماند، بلکه در هر زمان بر حسب آنچه دلیلش در گمان او در آن وقت به او می‌دهد، از امری به نقیض آن خارج می‌شود. ای برادر، من تو را به راه علم نافع راهنمایی کردم که از کجا برایت حاصل می‌شود. اگر بر صراط مستقیم آن سلوک کنی،\n\n### [همانا خداوند بنده‌ای دارد که به او عنایت کرده و او را برای خود ساخته است]\n\nپس بدان که خداوند دست تو را گرفته و به تو عنایت کرده و تو را برای خود ساخته است. پس خداوند میان ما و سلطه افکارمان در آنچه به تفکر در آن امر نشده‌ایم، حائل می‌شود. و برای تو روشن شد که آنچه بر آن‌ها وارد شد، جز از فضولیات نبوده است، و به همین دلیل اختلاف رخ داد و افکار و هواها با آن‌ها بازی کردند. آیا نمی‌بینی امری را که شارع به آن‌ها اجازه داد علم آن را طلب کنند، دو نفر از آن‌ها در آن اختلاف نکردند؟ اگر از آن‌ها غیر از آنچه در آن اختلاف کردند، طلب می‌شد، در آن نیز اختلاف نمی‌کردند. پس این دلالت می‌کند بر اینکه حق (الحق) آن را از آن‌ها نخواسته است. اگر بگویی: «آنچه در آن اتفاق نظر داشتند، چیست؟» می‌گوییم: ادله عقلی از هر طایفه‌ای، بلکه از ضروریات عقول، بر این امر اجماع کردند که آن‌ها خالقی دارند که آن‌ها را ایجاد کرده و در وجودشان به او استناد می‌کنند و او از آن‌ها بی‌نیاز است. در این امر دو نفر اختلاف نکردند، و این همان چیزی است که حق (الحق) از بندگانش خواسته است که وجودش را اثبات کنند. اگر در اینجا توقف می‌کردند تا حق (الحق) خود بر زبان رسولش آن‌ها را به آنچه شایسته است به او نسبت داده شود و با آن نامیده شود، بشناساند، رستگار می‌شدند. اما انسان عجول آفریده شده است و در خود نیروی فکری دید، پس آن را در غیر محلش به کار برد و درباره خدا بر اساس آنچه نظرش به او داد، سخن گفت. و مزاج‌ها مختلف است و نیروی متفکره از مزاج متولد می‌شود، پس نظر آن با اختلاف مزاجش متفاوت می‌شود و ادراک و حکم آن در آنچه ادراک کرده، مختلف می‌گردد. پس خداوند ما را ارشاد کند و ما را از کسانی قرار دهد که حق (الحق) را امام خود قرار داده‌اند و به آنچه برایشان تشریع شده، ملتزم شده و بر آن راه رفته‌اند. همانا او شایسته این کار است و پروردگاری جز او نیست.\n\n### [همانا خداوند رسولان را بیهوده نفرستاده است]\n\nای ولیّ، بدان که خداوند رسولان را بیهوده نفرستاده است. اگر عقل‌ها به تنهایی برای امور سعادتشان کفایت می‌کردند، نیازی به رسولان نبود و وجود رسولان عبث می‌شد. اما چون کسی که به او استناد می‌کنیم، شبیه ما نیست و ما نیز شبیه او نیستیم، و اگر عیناً شبیه ما بود، استناد ما به او اولی‌تر از استناد او به ما نبود. پس قطعاً دانستیم، دانشی که در این مقام شبهه‌ای در آن راه ندارد، که او مثل ما نیست و حقیقت واحدی ما را جمع نمی‌کند. پس انسان بالضروره جاهل است به آنچه برای اوست و به کجا منتقل می‌شود و سبب سعادتش اگر سعادتمند شود یا شقاوتش اگر شقی گردد، نزد این کسی که به او استناد کرده، چیست؛ زیرا او علم خدا را در مورد خود نمی‌داند و نمی‌داند که خدا چه می‌خواهد و چرا او را آفریده است. پس بالضروره نیازمند تعریف الهی در این باره شد. اگر خداوند می‌خواست، هر شخصی را به اسباب سعادتش می‌شناساند و راهی را که باید بر آن سلوک کند، برایش آشکار می‌ساخت. اما نخواست مگر اینکه در هر امتی رسولی از جنس خودشان، نه از غیر آن‌ها، مبعوث کند که او را بر آن‌ها مقدم داشت و به آن‌ها امر کرد که از او پیروی کنند و در طاعتش درآیند، که این ابتلایی از جانب او برای اقامه حجت بر آن‌ها بود، به سبب آنچه در علم سابق او درباره آن‌ها گذشته بود. سپس او را با بینه و آیه بر صدق رسالتش که آورده بود، تأیید کرد تا حجت بر آن‌ها تمام شود. و اینکه گفتیم از جنس خودشان، به این دلیل است که امر چنین واقع شده است. خداوند متعال فرمود: «و اگر او را فرشته قرار می‌دادیم، قطعاً او را به صورت مردی درمی‌آوردیم» (وَلَوْ جَعَلْنَاهُ مَلَكًا لَجَعَلْنَاهُ رَجُلًا)، یعنی اگر رسول برای بشر فرشته بود، به صورت مردی نازل می‌شد تا ندانند که او فرشته است، زیرا حسد بر مرتبه تنها میان همجنسان رخ می‌دهد. و خداوند متعال فرمود: «اگر در زمین فرشتگانی بودند که با اطمینان راه می‌رفتند، قطعاً فرشته‌ای را به عنوان رسول از آسمان بر آن‌ها نازل می‌کردیم» (لَوْ كَانَ فِي الْأَرْضِ مَلَائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنَا عَلَيْهِمْ مِنَ السَّمَاءِ مَلَكًا رَسُولًا). و ما در این باره داریم:\n\nخلیفه قوم از فرزندان جنس خودشان است،\nزیرا این در نفوس آن‌ها مؤثرتر است.\nاگر از جنس آن‌ها نبود، او را تصدیق می‌کردند\nو حسدی نسبت به غیر جنس خود در آن‌ها برنمی‌خاست.\n\nانسان می‌داند که چهارپایان و همه حیوانات در مرتبه پایین‌تر از او هستند. پس اگر حیوانی، حتی اگر سوسک بود، سخن می‌گفت و می‌گفت: «من رسولی از جانب خدا به سوی شما هستم، از فلان چیز بپرهیزید و فلان کار را انجام دهید»، انگیزه‌ها از سوی عوام برای پیروی از آن و تبرک جستن به آن و تعظیمش فراهم می‌شد و پادشاهان نیز تسلیم آن می‌شدند و از آن آیه و نشانه‌ای بر صدقش نمی‌خواستند و سخن گفتن آن را عین آیه بر صدقش قرار می‌دادند، هرچند امر چنین نباشد. و این تنها به این دلیل است که وقتی مرتبه را غیر همجنس به دست آورد، حسدی نسبت به غیر همجنس در آن‌ها برنمی‌خیزد. پس اولین ابتلایی که خداوند خلقش را با آن آزمود، فرستادن رسولانی از جنس خودشان به سوی آن‌ها بود، نه از غیر آن‌ها. و با وجود دلایلی که برای صدقشان نصب کرد و به آن یقین داشتند، سلطه حسد غالب بر آن‌ها باعث شد که آنچه را به آن عالم و یقین داشتند، از روی ظلم و برتری‌جویی انکار کنند. خداوند متعال فرمود: «و آن را از روی ظلم و برتری‌جویی انکار کردند، در حالی که جان‌هایشان به آن یقین داشت» (وَجَحَدُوا بِهَا وَاسْتَيْقَنَتْهَا أَنْفُسُهُمْ ظُلْمًا وَعُلُوًّا)، یعنی با این کار به خودشان ظلم کردند و بر کسی که به سوی آن‌ها فرستاده شده بود، برتری جستند. و در این، برتری‌جویی آن‌ها بر خدا نیز مندرج است. و اگر به او بگویی: «ای فلان، چگونه بر کسی که تو را آفریده، تکبر می‌کنی؟» از این سخن پناه می‌جوید و می‌گوید: «این کسی که گمان می‌کند از جانب خداست، بر خدا دروغ می‌بندد. حاشا که خدا چنین کسی را به سوی ما بفرستد: «چرا این قرآن بر مردی بزرگ از دو شهر [مکه و طائف] نازل نشد؟» (لَوْلَا نُزِّلَ هَذَا الْقُرْآنُ عَلَى رَجُلٍ مِنَ الْقَرْيَتَيْنِ عَظِيمٍ). اگر به او گفته شود: «او با نشانه آمده است که رسولی از جانب خدا به سوی شماست»، می‌گوید: «آیا نمی‌دانی که سحر حق است؟ این آیه از آن قبیل است.» این در مورد عوام است. اما در مورد علما و خواص، مثل حکما و دیگران، اگر به آن‌ها گفته شود: «آیا این آیات دال بر صدق ادعای او را نمی‌بینید؟» کسانی که به نفوس و قوای آن عالم هستند، در پاسخ می‌گویند: «ما می‌دانیم که قوای نفسانی به حدی می‌رسد که اجرام عالم از آن متأثر شوند. پس این [معجزه] از آن قبیل است.» و به صاحب چشم‌زخم و علم زجر (فال‌گیری) و امثال آن از آنچه شبیه این فن است، احتجاج می‌کنند. و اما اگر کسی علم به مجاری کواکب داشته باشد و قوای آن‌ها و جریان آن در عالم عنصری را بر مقادیر مخصوص ببیند، می‌گوید: «طالع این را به او داده است و روحانیت کواکب او را مدد می‌رساند و او به واسطه این طالع در مسقط نطفه، شرافت یافته و این قوا به او نفسی شریف داده و با آن به مراتب عالی در الهیات رسیده است.» و آنچه او گفته، صحیح است، زیرا خداوند همه این‌ها را در عالم علوی هنگام خلق آن به ودیعه نهاده است تا با آن بندگانش را بیازماید. پس اگر این را به این قوای روحانی نسبت دهند و آن را از نظر خداوند در این باره مجرد سازند، کافر نامیده می‌شوند، هرچند در آنچه گفته‌اند، بر صواب باشند، زیرا خداوند عالم را این‌گونه مرتب کرده است. اما آنچه بر آن‌ها وارد شده، از جهلشان در علمشان است. از اینجاست که گروهی گفته‌اند: «علم حجاب است»، هرچند امر چنین نیست، زیرا علم آن‌ها به این [قوا] منافاتی با علم به این ندارد که خداوند این را در روحانیات آن‌ها به ودیعه نهاده است. پس آنچه حقیقتاً بر آن‌ها وارد شده، از علمشان نیست، بلکه از جهلشان است. پس هنگامی که راه‌های سعادت به واسطه رسولان روشن شد، خداوند متعال فرمود: «ما راه را به او نشان دادیم، خواه شاکر باشد و خواه ناسپاس» (إِنَّا هَدَيْنَاهُ السَّبِيلَ إِمَّا شَاكِرًا وَإِمَّا كَفُورًا). و پس از این، چیزی باقی نمی‌ماند جز اینکه خداوند بندگانش را برای عمل به آنچه خداوند به آن‌ها امر کرده است، یعنی پیروی از رسولش (صلی الله علیه و سلم) در آنچه امر و نهی کرده و توقف در حدود و رسوم او، توفیق دهد. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ). و این منزل شامل علم تنزیه، علم اسماء، علم ابتلاء، علم نسب، علم علل، علم اخبار، علم مأخذ ادله و سبب کثرت آن‌ها بر مدلول واحد، علم اختصاص، علم مراتب، علم صفات، علم قضا، علم امامت، علم شرایع، علم انتقالات، علم رجاء، علم اسباب فوز و بقا (البقاء) و علم ترجیح است. و از همین علم است که مردم از هواهای خود پیروی کردند و حق (الحق) را ترک کرده و دور انداختند. پس خداوند ما را از قیام این صفت در ما حفظ کند. پس منزهی تو ای خدا و به حمد تو، هیچ خدایی جز تو نیست. از تو آمرزش می‌طلبم و به سوی تو توبه می‌کنم."
  },
  "page_count": 5
}