{
  "id": 526,
  "title": {
    "ar": "الباب السادس والعشرون وخمسمائة في معرفة حال قطب كان منزله ولَوْ لا أَنْ ثَبَّتْناكَ لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا",
    "en": "Chapter Five Hundred and Twenty-Six: Concerning the knowledge of the state of a Pole (قطب) whose station was: <<وَلَوْ لا أَنْ ثَبَّتْناكَ لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا>> (And had We not strengthened you, you would have almost inclined toward them slightly).",
    "ur": "باب پانچ سو چھبیس: ایک قطب (قطب) کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور اگر ہم تمہیں ثابت قدم نہ رکھتے تو تم قریب تھے کہ ان کی طرف تھوڑا سا جھک جاتے۔\" (سورۃ الاسراء، ۱۷:۷۴)",
    "fa": "باب پانصد و بیست و ششم در شناخت حال قطب (قطب) که مقام او بود: ولَوْ لا أَنْ ثَبَّتْناكَ لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا (و اگر ما تو را ثابت قدم نمی‌ساختیم، نزدیک بود که اندکی به سوی آنان تمایل پیدا کنی)."
  },
  "content": {
    "ar": "## (الباب السادس والعشرون وخمسمائة في معرفة حال قطب كان منزله ولَوْ لا أَنْ ثَبَّتْناكَ لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا)\n\n\n> إن الركون إلى الأغيار حرمان *** في الدين وهو ركون فيه خسران‏\n\n\n> ناط العذاب به شرع يحققه *** ضعفين قلبي وإيمان وإحسان‏\n\n\n> هذا لمن قد رأى في ذاك مصلحة *** فكيف من حاله زور وبهتان‏\n\n\n> الله يعلم أني لا أقول به *** ولو تقطع أوصال وأركان‏\n\n\n> والله ما كان ذاك الحكم إلا لنا *** كالشك والشرك يقضي فيه برهان‏\n\n\n> بأن قائله ذو عصمة وله *** على الذي قاله في الله سلطان‏\n\n\nأنزل الله تعالى في مثل هذا بل في هذا قُلْ يا أَيُّهَا الْكافِرُونَ إلى آخر السورة وهي سورة تعدل ربع القرآن إذا قسم أرباعا كما إن سورة الإخلاص تعدل ثلث القرآن إذا قسم أثلاثا كما إن إذا زلزلت تعدل نصف القرآن إذا قسم قسمين‏\n\n\n### [الأعضاء الثمانية المكلفون‏]\n\n\nاعلم أن هذا الذكر يطلعك كشفا على أعضاء التكليف منك وهي ثمانية أعضاء القلب والسمع والبصر واللسان واليد والبطن والفرج والرجل وما ثم تاسع وهي على عدد الجنات الثمانية فيدخل العبد في عبادته من أي أبواب الجنة شاء وإن شاء من الأبواب كلها في الزمن الواحد الفرد كأبي بكر الصديق رضي الله عنه دخل منها كلها في يوم واحد وكما أنه في كل عضو عمل يخصه فلكل عمل نتيجة تخصه من الكون تسمى كرامة ينتجها حال\n\n\nذلك العمل تناسب الكرامة العضو المكلف وحال العمل الذي يختص بذلك العضو ويقع في عمل كل عضو تفصيل وله أيضا أعني العمل نتيجة تخصه من الحق تسمى منزلا ينتجه مقام ذلك العمل يناسب ذلك المنزل عند الله العضو المكلف وتفاصيل المقام الذي يختص بذلك العضو يفصل المنازل على اختلافها وقد بينا ذلك كله في كتاب مواقع النجوم لنا وهو كتاب يقوم للطالب مقام الشيخ يأخذ بيده كلما عثر المريد ويهديه إلى المعرفة إذا هو ضل وتاه ويعرفه مراتب الأنوار من هذا الذكر المقسمة على الأعضاء التي يهتدى بها وهي نور الهلال والقمر والبدر والكوكب والنار والشمس والسراج والبرق وما يكشف بنور كل واحد من هذه الأنوار من الصفات التي تحصر الأسماء الإلهية والذات كالحياة والعلم والإرادة والقدرة والكلام والسمع والبصر والذات المنعوتة بهذه الصفات فلكل صفة نور من هذه الأنوار ويعرف الموازنات بين الأشياء الموزونة والمناسبات فلا يخفى عليه شي‏ء فإنه نور كله وهودعاء النبي صَلَّى اللهُ عَليهِ وسَلَّم فقال واجعلني نورا\n\n\nوتعرف من هذا الذكر أرباب القوي وهي ثمانية القوي الخمسة الحسية والقوة العاقلة والفكرة والخيالية وما عدا هذه القوي فكالسدنة لهذه الثمانية كما أن هؤلاء الثمانية وإن كانوا أمهات ففيها ما منزلتها من غيرها منزلة السادن ومنزلة الإقليد وما زال التفاضل في الأنواع معلوما وكل ما ذكرناه في مواقع النجوم فإنه بعض ما يعطيه هذا الذكر والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## (Chapter 526: On the Gnosis of the State of a Pole Whose Station is Defined by: <<وَلَوْ لا أَنْ ثَبَّتْناكَ لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا>>)\n\nIndeed, inclining toward 'otherness' (الأغيار) is deprivation in religion, and it is an inclination that entails ruin.\nThe Law (شرع) links punishment to this, confirming it as double: affecting the heart, faith (إيمان), and spiritual excellence (إحسان).\nThis [punishment] is for one who saw some expediency (مصلحة) in that inclination; so what of the one whose state is falsehood (زور) and deceit (بهتان)?\nAllah knows that I do not affirm this [inclination], even if my limbs (أوصال) and pillars (أركان) were severed.\nBy Allah, that judgment was only for us, like doubt (شك) and association (شرك), where a decisive proof (برهان) settles the matter,\nThat its speaker possesses infallibility (عصمة) and has authority (سلطان) over what he speaks concerning Allah.\n\nConcerning a matter like this—indeed, concerning this very matter—Allah Almighty revealed: <<قُلْ يا أَيُّهَا الْكافِرُونَ>> (Say: O disbelievers) until the end of the Surah. This Surah [Al-Kafirun] is equivalent to a quarter of the Quran when divided into quarters, just as Surah Al-Ikhlas is equivalent to a third of the Quran when divided into thirds, and just as Surah Al-Zalzalah is equivalent to half of the Quran when divided into halves.\n\n### [The Eight Responsible Limbs]\n\nKnow that this invocation (ذكر) grants you an unveiling (كشف) regarding the limbs of responsibility (أعضاء التكليف) within you. They are eight: the heart (القلب), hearing (السمع), sight (البصر), the tongue (اللسان), the hand (اليد), the belly (البطن), the private parts (الفرج), and the foot (الرجل). There is no ninth. They correspond to the number of the eight Gardens [of Paradise] (الجنات الثمانية). The servant enters into his worship through whichever of the gates of Paradise he wishes, or, if he wishes, through all the gates in a single, unique moment, like Abu Bakr al-Siddiq (may Allah be pleased with him), who entered through all of them in one day.\n\nJust as every limb has a specific action pertaining to it, so too does every action have a specific result stemming from the Cosmos (الكون), which is called a Divine favor (كرامة). This favor is produced by the spiritual state (حال) of that action, and the favor is commensurate with the responsible limb and the state of the action specific to that limb.\n\nFurthermore, the action of every limb involves detailed elaboration. And that action—I mean the action—also has a specific result stemming from The Real (الحق), which is called a station (منزل). This station is produced by the spiritual rank (مقام) of that action, and that station before Allah is commensurate with the responsible limb and the details of the rank (مقام) specific to that limb, which differentiates the various stations (منازل). We have explained all of this in our book, *The Settings of the Stars* (مواقع النجوم), which serves the seeker (الطالب) in the place of a Shaykh, taking his hand whenever the aspirant (المريد) stumbles, and guiding him to Gnosis (المعرفة) when he is lost and wandering.\n\n[The book] also makes known the levels of Lights (مراتب الأنوار) derived from this invocation, which are distributed among the limbs by which guidance is attained. These Lights are: the light of the crescent (الهلال), the moon (القمر), the full moon (البدر), the star (الكوكب), the fire (النار), the sun (الشمس), the lamp (السراج), and the lightning (البرق). [It also reveals] what is unveiled by the light of each of these Lights concerning the Attributes (الصفات) that encompass the Divine Names (الأسماء الإلهية) and the Essence (الذات), such as Life (الحياة), Knowledge (العلم), Will (الإرادة), Power (القدرة), Speech (الكلام), Hearing (السمع), Sight (البصر), and the Essence (الذات) described by these Attributes.\n\nThus, every Attribute (صفة) has a light corresponding to one of these Lights. [The seeker] also comes to know the balances (الموازنات) between weighed things and the correspondences (المناسبات), so nothing remains hidden from him, for he is entirely Light. This is the prayer of the Prophet (peace and blessings be upon him) when he said: \"And make me Light.\"\n\nThrough this invocation (ذكر), you also come to know the masters of the faculties (أرباب القوي), which are eight: the five sensory faculties (القوي الخمسة الحسية), the rational faculty (القوة العاقلة), the cogitative faculty (الفكرة), and the imaginative faculty (الخيالية). All faculties besides these are like custodians (السدنة) for these eight. Just as these eight, though they are the mothers [of the faculties], contain some whose rank relative to others is that of the custodian or that of the key (الإقليد). The differentiation in types (التفاضل في الأنواع) has always been known. Everything we have mentioned in *The Settings of the Stars* (مواقع النجوم) is but a portion of what this invocation grants. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر پانچ سو چھبیس: اس قطب کے حال کی معرفت میں جس کا روحانی منزل یہ تھا: \"اور اگر ہم آپ کو ثابت قدم نہ رکھتے تو آپ ان کی طرف تھوڑا سا جھکنے ہی والے تھے\" (وَلَوْ لا أَنْ ثَبَّتْناكَ لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا)۔\n\nبے شک اغیار (الأغيار) کی طرف جھکاؤ دین میں محرومی ہے،\nاور یہ ایسا جھکاؤ ہے جس میں خسارہ ہے۔\n\nشریعت نے اس پر عذاب کو معلق کیا ہے، جو اسے دوگنا ثابت کرتا ہے:\nقلبی، ایمانی اور احسانی۔\n\nیہ اس شخص کے لیے ہے جس نے اس میں کوئی مصلحت دیکھی ہو،\nتو اس کا کیا حال ہوگا جس کا حال جھوٹ اور بہتان ہو؟\n\nاللہ جانتا ہے کہ میں اس کا قائل نہیں ہوں،\nخواہ میرے جوڑ اور اعضاء کاٹ دیے جائیں۔\n\nاور اللہ کی قسم! یہ حکم ہمارے لیے ہی تھا،\nجیسے شک اور شرک، جس میں دلیل فیصلہ کرتی ہے۔\n\nکہ اس کا کہنے والا معصوم ہے اور اسے\nاللہ کے بارے میں جو کچھ اس نے کہا ہے اس پر مکمل اختیار (سلطان) حاصل ہے۔\n\nاللہ تعالیٰ نے اس کے مثل، بلکہ اسی کے بارے میں نازل فرمایا: \"کہہ دیجیے: اے کافرو!\" (قُلْ يا أَيُّهَا الْكافِرُونَ) آخر سورت تک۔ اور یہ وہ سورت ہے جو قرآن کے چوتھائی کے برابر ہے اگر اسے چار حصوں میں تقسیم کیا جائے، جیسا کہ سورۃ الاخلاص قرآن کے تہائی کے برابر ہے اگر اسے تین حصوں میں تقسیم کیا جائے، اور جیسا کہ سورۃ الزلزال قرآن کے نصف کے برابر ہے اگر اسے دو حصوں میں تقسیم کیا جائے۔\n\n### [آٹھ مکلف اعضاء]\n\nجان لو کہ یہ ذکر تمہیں کشف (الکشف) کے ذریعے تمہارے مکلف اعضاء پر مطلع کرتا ہے، اور وہ آٹھ اعضاء ہیں: قلب، کان (السمع)، آنکھ (البصر)، زبان (اللسان)، ہاتھ (الید)، پیٹ (البطن)، شرمگاہ (الفرج) اور پاؤں (الرجل)۔ اور کوئی نواں عضو نہیں ہے۔ یہ آٹھ اعضاء جنتوں کی تعداد کے مطابق ہیں، چنانچہ بندہ اپنی عبادت میں جنت کے جس دروازے سے چاہے داخل ہو سکتا ہے، اور اگر چاہے تو ایک ہی وقت میں تمام دروازوں سے داخل ہو سکتا ہے، جیسے کہ ابو بکر صدیق رضی اللہ عنہ ایک ہی دن میں ان سب سے داخل ہوئے۔\n\nاور جس طرح ہر عضو کا ایک خاص عمل ہے، اسی طرح ہر عمل کا کائنات سے ایک خاص نتیجہ نکلتا ہے جسے کرامت (الکرامۃ) کہا جاتا ہے۔ یہ کرامت اس عمل کے حال سے پیدا ہوتی ہے اور مکلف عضو اور اس عضو سے متعلق عمل کے حال کے مناسب ہوتی ہے۔\n\nاور ہر عضو کے عمل میں تفصیل پائی جاتی ہے، اور اس عمل کا ذات حق (الحق) کی طرف سے بھی ایک خاص نتیجہ ہوتا ہے جسے منزل (المنزل) کہا جاتا ہے۔ یہ منزل اس عمل کے مقام (المقام) سے پیدا ہوتی ہے اور اللہ کے نزدیک مکلف عضو کے لیے اس منزل کے مناسب ہوتی ہے۔ اور اس عضو سے متعلق مقام کی تفصیلات مختلف منازل کو واضح کرتی ہیں۔\n\nاور ہم نے یہ سب اپنی کتاب \"مواقع النجوم\" میں بیان کر دیا ہے، جو طالب کے لیے شیخ کا مقام رکھتی ہے، جب بھی مرید ٹھوکر کھاتا ہے تو اس کا ہاتھ پکڑتی ہے، اور جب وہ بھٹک جاتا ہے تو اسے معرفت (المعرفۃ) کی طرف رہنمائی کرتی ہے۔\n\nاور یہ کتاب اسے اس ذکر سے حاصل ہونے والے انوار کے مراتب سے آگاہ کرتی ہے جو ان اعضاء پر تقسیم ہیں جن کے ذریعے ہدایت حاصل کی جاتی ہے۔ یہ انوار ہیں: ہلال کا نور، چاند کا نور، بدر کا نور، ستارے کا نور، آگ کا نور، سورج کا نور، چراغ کا نور، اور بجلی کا نور۔ اور ہر نور کے ذریعے ان صفات کا کشف (الکشف) ہوتا ہے جو اسماء الٰہیہ اور ذات کو گھیرے ہوئے ہیں، جیسے حیات، علم، ارادہ، قدرت، کلام، سمع، بصر، اور وہ ذات جو ان صفات سے متصف ہے۔ چنانچہ ہر صفت کے لیے ان انوار میں سے ایک نور ہے۔\n\nاور وہ تولی جانے والی چیزوں کے درمیان توازن اور مناسبتوں کو جانتا ہے، چنانچہ اس پر کوئی چیز پوشیدہ نہیں رہتی، کیونکہ یہ سب نور ہی نور ہے۔ اور یہ نبی اکرم صلی اللہ علیہ وسلم کی دعا ہے، جب آپ نے فرمایا: \"اور مجھے نور بنا دے۔\"\n\nاور اس ذکر سے تم قوتوں کے مالکوں کو پہچانتے ہو، اور وہ آٹھ ہیں: پانچ حسی قوتیں، قوت عاقلہ، قوت فکریہ، اور قوت خیالیہ۔ اور ان قوتوں کے علاوہ جو کچھ ہے وہ ان آٹھ کے خادموں کی طرح ہے۔ اگرچہ یہ آٹھ قوتیں بنیادی (امّہات) ہیں، لیکن ان میں سے بعض کا درجہ دوسروں کے مقابلے میں خادم (سادن) اور کنجی (اقلید) کا سا ہے۔ اور انواع میں تفاضل ہمیشہ سے معلوم رہا ہے۔\n\nاور جو کچھ ہم نے \"مواقع النجوم\" میں ذکر کیا ہے، وہ اس ذکر کے عطا کردہ فوائد کا ایک حصہ ہے۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و بیست و ششم در شناخت حال قطبی که منزل او بود: (وَلَوْ لا أَنْ ثَبَّتْناكَ لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا) [و اگر تو را استوار نمی‌داشتیم، نزدیک بود اندکی به سوی آنان متمایل شوی] (قرآن ۱۷:۷۴).\n\nهمانا تکیه بر اغیار (غیر حق) محرومیت است *** در دین، و آن تکیه‌ای است که در آن زیان است.\nشریعت عذاب را به آن (تکیه بر اغیار) گره زده است که آن را محقق می‌سازد *** دو برابر: قلبی، و ایمان و احسان.\nاین (عذاب) برای کسی است که در آن (تکیه بر اغیار) مصلحتی دیده باشد *** پس چگونه است حال کسی که حالش دروغ و بهتان است؟\nخدا می‌داند که من به آن (تکیه بر اغیار) قائل نیستم *** حتی اگر بندها و ارکانم قطع شوند.\nو سوگند به خدا، آن حکم جز برای ما نبود *** مانند شک و شرک که برهان در آن حکم می‌کند.\nبه اینکه گوینده‌اش صاحب عصمت است و او را *** بر آنچه در مورد خدا گفته است، سلطنت (قدرت معنوی) است.\n\nخداوند متعال در مثل این مورد، بلکه در همین مورد، نازل فرمود: (قُلْ يا أَيُّهَا الْكافِرُونَ) [بگو ای کافران] تا آخر سوره. و این سوره‌ای است که معادل یک چهارم قرآن است، اگر قرآن به چهار بخش تقسیم شود؛ همان‌طور که سوره اخلاص معادل یک سوم قرآن است، اگر به سه بخش تقسیم شود؛ و همان‌طور که سوره (إذا زلزلت) [هنگامی که زمین لرزانده شود] معادل نصف قرآن است، اگر به دو بخش تقسیم شود.\n\n### [اعضای هشت‌گانه مکلف]\n\nبدان که این ذکر، تو را از طریق کشف (کشف) بر اعضای مکلف تو آگاه می‌سازد، و آن‌ها هشت عضو هستند: قلب، گوش، چشم، زبان، دست، شکم، فرج و پا. و عضو نهمی وجود ندارد. این اعضا به تعداد هشت بهشت هستند، پس بنده در عبادت خود از هر دری از درهای بهشت که بخواهد وارد می‌شود، و اگر بخواهد، در یک زمان واحد و فرد از همه درها وارد می‌شود، مانند ابوبکر صدیق (رضی الله عنه) که در یک روز از همه آن‌ها وارد شد.\n\nو همان‌طور که در هر عضوی عملی مخصوص به آن وجود دارد، برای هر عملی نیز نتیجه‌ای مخصوص به آن از عالم کون (هستی) وجود دارد که کرامت نامیده می‌شود. این کرامت را حال (حال) آن عمل تولید می‌کند و کرامت با عضو مکلف و حال عملی که مخصوص آن عضو است، تناسب دارد.\n\nو در عمل هر عضوی تفصیلی وجود دارد، و همچنین برای آن (یعنی عمل) نتیجه‌ای مخصوص به آن از جانب الحق (حق) وجود دارد که منزل نامیده می‌شود. این منزل را مقام (مقام) آن عمل تولید می‌کند و آن منزل نزد خداوند با عضو مکلف و جزئیات مقامی که مخصوص آن عضو است، تناسب دارد و منازل را با اختلافشان تفصیل می‌دهد.\n\nو ما همه این‌ها را در کتاب \"مواقع النجوم\" خود بیان کرده‌ایم. این کتاب برای سالک به منزله شیخ است که هرگاه مرید بلغزد، دست او را می‌گیرد و اگر گمراه و سرگردان شود، او را به سوی معرفت (معرفت) هدایت می‌کند. و مراتب انوار حاصل از این ذکر را که بر اعضای هدایت‌شونده تقسیم شده‌اند، به او می‌شناساند؛ و آن انوار عبارتند از: نور هلال، ماه، بدر (ماه کامل)، ستاره، آتش، خورشید، چراغ (سراج) و برق.\n\nو آنچه با نور هر یک از این انوار کشف (کشف) می‌شود، از صفاتی است که اسماء الهی و ذات را در بر می‌گیرد، مانند حیات، علم، اراده، قدرت، کلام، سمع، بصر و ذاتی که به این صفات منسوب است. پس برای هر صفتی نوری از این انوار وجود دارد. و (سالک) موازنات بین اشیاء موزون و مناسبات را می‌شناسد، پس چیزی بر او پوشیده نمی‌ماند، زیرا او سراسر نور است. و این دعای پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) بود که فرمود: «و مرا نور قرار ده.»\n\nو از این ذکر، ارباب قوا را می‌شناسی که هشت تا هستند: قوای پنج‌گانه حسی، و قوه عاقله، و قوه فکریه، و قوه خیالیه. و آنچه غیر از این قوا باشد، مانند خادمان (سدنه) برای این هشت قوه است. همان‌طور که این هشت قوه، اگرچه مادر (اصلی) هستند، اما در میان آن‌ها نیز آنچه منزلتش نسبت به دیگری منزلت خادم و منزلت کلید است، وجود دارد. و برتری در انواع همواره معلوم بوده است.\n\nو هر آنچه در \"مواقع النجوم\" ذکر کردیم، تنها بخشی از چیزی است که این ذکر عطا می‌کند. و خداوند (يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ) [حق را می‌گوید و اوست که راه را هدایت می‌کند]."
  },
  "page_count": 1
}