{
  "id": 472,
  "title": {
    "ar": "الباب الثاني والسبعون وأربعمائة في حال قطب كان منزله الَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ أُولئِكَ الَّذِينَ هَداهُمُ الله وأُولئِكَ هُمْ أُولُوا الْأَلْبابِ",
    "en": "Chapter Four Hundred and Seventy-Two: Concerning the State of a Pole (قطب) Whose Station (منزل) Was: <<الَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ أُولئِكَ الَّذِينَ هَداهُمُ الله وأُولئِكَ هُمْ أُولُوا الْأَلْبابِ>> (Those who listen to the Word and follow the best of it. Those are the ones whom Allah has guided, and those are the ones possessed of understanding).",
    "ur": "باب چار سو بہتر (۴۷۲) ایک قطب (Quṭb) کے حال (حال) کے بیان میں جس کا روحانی مقام (منزل) یہ تھا: \"جو لوگ قول (القول) کو سنتے ہیں اور اس کے بہترین (أحسن) کی پیروی کرتے ہیں۔ یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی اور یہی لوگ عقل والے (أُولُوا الْأَلْبابِ) ہیں\" (الزمر: ۱۸)۔",
    "fa": "باب چهارصد و هفتاد و دوم در بیان حال قطبی که منزلش این آیه بود: «آنان که سخن را می‌شنوند و از بهترین آن پیروی می‌کنند، ایشان کسانی هستند که خداوند هدایتشان کرده و ایشان صاحبان خردند» (الَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ أُولئِكَ الَّذِينَ هَداهُمُ الله وأُولئِكَ هُمْ أُولُوا الْأَلْبابِ)."
  },
  "content": {
    "ar": "## «الباب الثاني والسبعون وأربعمائة في حال قطب كان منزله الَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ أُولئِكَ الَّذِينَ هَداهُمُ الله وأُولئِكَ هُمْ أُولُوا الْأَلْبابِ»\n\n\n> من يستمع قول من تعنو الوجوه له *** يفز بحسن الذي يأتيه في كلمه‏\n\n\n> وهو الحكيم فمن في الكون حكمته *** وأنت في كونه فأنت من حكمه‏\n\n\n> فمنك تسمع إن حققت ما سمعت *** أذناك من قوله في رتبتي قدمه‏\n\n\n> العرش يفرد ما الكرسي يقسمه *** من الخطاب لما في القول من قدمه‏\n\n\n> إن الحدوث له وجه لمحدثه *** وآخر ناظر منه إلى عدمه‏\n\n\nقال الله جل جلاله ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ وقال تعالى ما يَأْتِيهِمْ من ذِكْرٍ من الرَّحْمنِ مُحْدَثٍ‏\n\n\n### [أن كل كلام في العالم كلام الله تعالى‏]\n\n\nاعلم أن هذا تنبيه من الحق على إن كل كلام في العالم كلامه لأنه ما أتى من الله إلينا إلا كل ذكر محدث لأن الإتيان يحدث بلا شك في الآتي وما أتى إلا من قام به الحادث وليس إلا الصورة التي يتجلى فيها في أعين الناظرين ويتخلى عنها في أعين الناظرين فما ثم إلا سامع ومتكلم وقائل ومقول له ومقول به ومقول وكله حسن إلا أنه بين حسن وأحسن فكل كلام حسن وما وافق الغرض من القول فهو أحسن فالقول كله حسن وأما قوله لا يُحِبُّ الله الْجَهْرَ بِالسُّوءِ من الْقَوْلِ فنفى المحبة أن يكون متعلقها الجهر بالسوء من القول والسوء من القول أن يقول في القول إنه سوء ولا قائل به إلا الله والجهر بالسوء قد يكون قولا وقد يكون في الأفعال التي لا تكون قولا فيريد بالجهر فيها ظهور الفحشاء من العبد كما\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم من بلي منكم بهذه القاذورات فليستتر\n\n\nيعني لا يجهر بها والسوء على نوعين سوء شرعي وسوء ما يسوؤك وإن حمده الشرع ولم يدمه فقد يكون هذا السوء من كونه يسوءك لا إن السوء فيه حكم الله كما قال تعالى وجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها فالسيئة الأولى شرعية لأنه تعدى والسيئة الأخرى ما يسوء المجازي عليها وليس الجزاء بسيئة مشروعة لأن الله لا يشرع السوء ولما وقع الاصطلاح في اللسان على السيئ والحسن نزل الشرع من عند الله بحسب التواطؤ فهم سموه سوء\nوقالوا إن ثم سوء فقال الله لا يُحِبُّ الله الْجَهْرَ بِالسُّوءِ من الْقَوْلِ الذي سميتموه سوء لكونه لا يوافق أغراضكم كما\n\n\nقد سمعت أن حسنات الأبرار سيئات المقربين‏\n\n\nوليس ثم الأحسن بالنسبة سيئ بالنسبة على الحقيقة فكل شي‏ء من الله حسن ساء ذلك الشي‏ء أم سر فالأمر إضافي فقوله أُولئِكَ الَّذِينَ هَداهُمُ الله إلى معرفة الحسن والأحسن وأُولئِكَ هُمْ أُولُوا الْأَلْبابِ يعني بالألباب المستخرجين لب الأمر المستور بالقشر صيانة له فإن العين لا تقع إلا على الحجاب والمحجوب لأولي الألباب تنبيه على الصورة الحجابية التي يتجلى فيها الحق ثم يتحول عنها إلى حجاب فما ثم في الحقيقة إلا انتقال من حجاب إلى حجاب لأنه ما يتكرر تجل إلهي قط فلا بد من اختلاف الصور والحق وراء ذلك كله فما لنا منه إلا الاسم الظاهر رؤية وحجابا وأما الاسم الباطن فلا يزال باطنا وهو اللب المعقول الذي يدركه أولو الألباب يعني يعلمون أن ثم لبا وهو هذا الذي ظهر حجاب عليه وليس إلا الاسم الظاهر وهو المسمى في الحالين فمن قال بالرؤية صدق ومن قال بنفي الرؤية صدق فإن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أثبت لنا الرؤية\n\n\nبقوله صَلَّى اللهُ عَليهِ وسَلَّم ترون ربكم‏\n\n\nالحديث ونفى الرؤية\n\n\nفإنه صَلَّى اللهُ عَليهِ وسَلَّم سئل هل رأيت ربك يعني ليلة الإسراء فقال يتعجب من السائل نور أني أراه‏\n\n\nأي أنه نور فلا أدرك النور لضعف الحدوث والنور لله وصف ذاتي والحدوث لنا كذلك نسبة ذاتية فنحن لا نزال على ما نحن عليه وهو لا يزال على ما هو عليه والرَّاسِخُونَ في الْعِلْمِ الَّذِينَ هَداهُمُ الله أي تولى تعليمهم بنفسه وأُولئِكَ هُمْ أُولُوا الْأَلْبابِ فكان من العلم الذي علمهم إن ثم لنا مستورا بقشر فصدق النافي والمثبت فمن قال إن الله ظاهر فما قال على الله إلا ما قال الله عن نفسه ولا فائدة لكون الأمر ظاهرا إلا مشاهدته فهو مشهود مرئي من هذا الوجه ومن قال إن الله باطن فما قال على الله إلا ما قال الله عن نفسه ولا فائدة لكون الأمر باطنا إلا أنه لا تُدْرِكُهُ الْأَبْصارُ فهو لا يشهد ولا يرى من هذا الوجه فلما اتبع هذا الذكر أحسن القول أدرك أن ثم لبا مستورا حين قال الآخر إنه ليس ثم إلا هذا الذي وقع عليه البصر فهو كمن لا يرى أن خلف هذه الصورة الظاهرة الإنسانية أمرا آخر يدبرها ويصرفها ومن أبصر عنده صورة زيد فقد أبصره بلا شك والذي اعترف باللب علم إن خلف هذه الصورة أمرا آخر هذا الأثر الظاهر من هذه الصورة لذلك الباطن المستور في هذا الحجاب دليله الموت مع بقاء الصورة وإزالة الحكم فمن قال إن زيدا عين ذلك المدبر لا عين الصورة وإن الصورة عنده لا فرق بينها وبين ما أجمعنا عليه من صورة مثله من خشب أو جص قال إنه ما رآه ومن قال إن زيدا هو المجموع فهو الظاهر والباطن قال رآه ما رآه كما قال في المعنى وما رَمَيْتَ إِذْ رَمَيْتَ فأحسن القول إثبات الأمرين على الوجهين‏\n\n\n> فما ثم مشهود وما ثم شاهد *** سوى واحد والفرق يعقل بالجمع‏\n\n\n> فمن قال شاهدناه يصدق قوله *** ومن قال لم نشهد فللضعف والصدع‏\n\n\n> إذا اتصفت عين بصدع ولم تزل *** بها صفة الصدع المزيلة للنفع‏\n\n\n> على السمع عولنا فكنا أولي النهى *** ولا علم فيما لا يكون عن السمع‏\n\n\n> إذا كان معصوما وقال فقوله *** هو الحق لا يأتيه مين على القطع‏\n\n\n> فعقل وشرع صاحبان تألفا *** فبورك من عقل وبورك من شرع‏\n\n\n### [الاتباع محدود بما حده‏]\n\n\nواعلم أن الاتباع إنما هو فيما حده لك في قوله ورسمه فتمشي حيث مشى بك وتقف حيث وقف بك وتنظر فيما قال لك انظر وتسلم فيما قال لك سلم وتعقل فيما قال لك اعقل وتؤمن فيما قال لك آمن فإن الآيات الإلهية الواردة في الذكر الحكيم وردت متنوعة وتنوع لتنوعها وصف المخاطب بها فمنها آيات لِقَوْمٍ يَتَفَكَّرُونَ وآيات لِقَوْمٍ يَعْقِلُونَ وآيات لِقَوْمٍ يَسْمَعُونَ وآيات لِلْمُؤْمِنِينَ وآيات لِلْعالِمِينَ وآيات للمتقين وآيات لِأُولِي النُّهى‏ وآيات لِأُولِي الْأَلْبابِ وآيات لأولي الأبصار ففصل كما فصل ولا نتعد إلى غير ما ذكر بل نزل كل آية وغيرها بموضعها وانظر فيمن خاطب بها وكن أنت المخاطب بها فإنك مجموع ما ذكر فإنك المنعوت بالبصر والنهي واللب والعقل والتفكر والعلم والايمان والسمع والقلب فأظهر بنظرك بالصفة التي نعتك بها في تلك الآية الخاصة تكن ممن جمع له القرآن فاجتمع عليه فاستظهره‏\nفكان من أهله بل هو عين القرآن إذا كان على هذا الوصف وهو من أهل الله وخاصته فالقول كله حسن وأحسن وما ثم سوء إلا في المقول عنه ذلك هو السوء أو في المتكلم به ليس في القول‏\n\n\n> ليس في القول والكلام قبيح *** إنما القبح في الذي قيل عنه‏\n\n\nأو قيل أو تكلم به أو تكلم عنه فافهم ذلك وخذ الوجود كله على أنه كتاب مسطور وإن قلت مرقوم فهو أبلغ فإنه ذو وجهين ناطق بالحق وعن الحق تكن من الَّذِينَ هَداهُمُ الله أي وفقهم بما أعطاهم من البيان وأُولئِكَ هُمْ أُولُوا الْأَلْبابِ الغواصون على خفايا الأمور وحقائقها المستخرجون كنوزها والحالون عقودها ورموزها والعالمون بما تقع به الإشارات في الموضع الذي تسمح فيه العبارات والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Four Hundred and Seventy-Two: Concerning the spiritual station (حال) of a Pole (قطب) whose station (منزل) was: <<Those who listen to the Word (الْقَوْلَ) and follow the best of it (أَحْسَنَهُ). Those are the ones whom Allah has guided, and those are the people of understanding (أُولُوا الْأَلْبابِ)>> (Q 39:18).\n\nHe who listens to the Word of Him before Whom faces bow,\nWill triumph through the beauty of what comes to him in His speech.\n\nHe is the Wise, so whose wisdom is in the Cosmos (الكون)?\nAnd you are within His Being (كونه), so you are part of His wisdom.\n\nFrom yourself you hear, if you verify what your ears have heard,\nFrom His Word (قوله) in the two degrees (رتبتي) of His Eternity (قدمه).\n\nThe Throne (العرش) unifies what the Footstool (الكرسي) divides,\nOf the Discourse (الخطاب), due to the Eternity inherent in the Word.\n\nIndeed, Contingency (الحدوث) has one face turned toward its Originator,\nAnd another looking from it toward its non-existence (عدمه).\n\nAllah, Glorious is His Majesty, said: <<No fresh reminder (ذِكْرٍ) comes to them from their Lord, but they listen to it while they play>> (Q 21:2). And He, the Exalted, said: <<No fresh reminder (ذِكْرٍ) comes to them from the All-Merciful (الرَّحْمنِ)>> (Q 26:5).\n\n### [That all speech in the World (العالم) is the Speech of Allah, the Exalted]\n\nKnow that this is an admonition from the Real (الحق) that all speech (كلام) in the World (العالم) is His Speech, because nothing comes from Allah to us except every contingent reminder (ذكر محدث). This coming (الإتيان) undoubtedly occurs in the one to whom it comes (الآتي). And nothing comes except from that in which the contingent (الحادث) subsists, and that is none other than the form (الصورة) in which He manifests Himself (يتجلى) in the eyes of the observers, and from which He withdraws in the eyes of the observers.\n\nThus, there is nothing there except a listener, a speaker, a sayer, one spoken to, that by which the saying occurs, and the thing said. All of it is good (حسن), yet it is divided between good and better (أحسن). All speech is good, but that saying which conforms to the purpose is better.\n\nAll the Word (القول) is good. As for His saying: <<Allah does not love the public utterance of evil (السُّوءِ) in speech (الْقَوْلِ)>> (Q 4:148), He negated love being attached to the public utterance of evil in speech. The evil in speech is to say of the Word that it is evil, and none says this but Allah. The public utterance of evil may be speech, or it may be in actions that are not speech, in which case the public utterance refers to the manifestation of indecency (الفحشاء) by the servant, as the Prophet, peace and blessings be upon him, said: \"Whoever among you is afflicted by these abominations, let him conceal himself,\" meaning he should not utter it publicly.\n\nEvil (السوء) is of two types: legal evil (سوء شرعي) and evil that displeases you (ما يسوؤك), even if the Law (الشرع) praises it and does not condemn it. This evil may stem from the fact that it displeases you, not because the judgment of Allah is that it is evil, as the Exalted said: <<The recompense of an evil deed (سَيِّئَةٍ) is an evil deed (سَيِّئَةٌ) like it>> (Q 42:40). The first evil deed is legal, because it was a transgression. The second evil deed is what displeases the one being recompensed for it. The recompense is not a legislated evil deed, because Allah does not legislate evil.\n\nWhen the convention (الاصطلاح) arose in language regarding the bad (السيئ) and the good (الحسن), the Law descended from Allah according to this consensus (التواطؤ). They named it evil and said that evil exists. So Allah said: <<Allah does not love the public utterance of evil in speech>>—that which you have named evil because it does not conform to your purposes, just as you have heard that: \"The good deeds of the pious are the evil deeds of the near ones [to Allah] (حسنات الأبرار سيئات المقربين).\"\n\nIn reality, the better (الأحسن) is not relatively bad (سيئ بالنسبة). Everything from Allah is good, whether that thing displeases or delights. The matter is relative (إضافي).\n\nThus, His saying: <<Those are the ones whom Allah has guided (هَداهُمُ الله)>> means guided to the knowledge (معرفة) of the good (الحسن) and the better (الأحسن). And <<those are the people of understanding (أُولُوا الْأَلْبابِ)>> means those who extract the kernel (لب) of the matter, which is concealed by the husk (القشر) for its protection.\n\nFor the eye falls only upon the veil (الحجاب). The veiled (المحجوب) for the people of understanding (أولي الألباب) is an indication of the veiling form (الصورة الحجابية) in which the Real (الحق) manifests Himself (يتجلى), and then shifts from it to another veil. In reality, there is only a transition from veil to veil, because a Divine Theophany (تجل إلهي) is never repeated. Therefore, the forms must necessarily differ. The Real is beyond all of that.\n\nThus, we have nothing of Him except the Name the Manifest (الاسم الظاهر), both as vision and as veil. As for the Name the Hidden (الاسم الباطن), it remains hidden (باطنا). It is the intelligible kernel (اللب المعقول) that the people of understanding perceive. That is, they know that there is a kernel, and that this manifest thing is merely a veil over it. Yet, it is none other than the Name the Manifest, which is the Named in both states.\n\nSo, whoever affirms the vision (الرؤية) speaks truly, and whoever negates the vision speaks truly. For the Messenger of Allah, peace and blessings be upon him, affirmed the vision for us by his saying, peace and blessings be upon him: \"You will see your Lord\"—the Hadith. And he negated the vision, for when he, peace and blessings be upon him, was asked, \"Did you see your Lord?\"—meaning on the Night Journey (الإسراء)—he replied, expressing astonishment at the questioner: \"Light! How could I see Him?\"\n\nMeaning, He is Light, and I cannot perceive the Light due to the weakness of contingency (الحدوث). Light is an essential Attribute (وصف ذاتي) for Allah, and contingency is likewise an essential relation (نسبة ذاتية) for us. We remain upon our state, and He remains upon His state.\n\nAnd <<those firmly rooted in Knowledge (الرَّاسِخُونَ في الْعِلْمِ)>> (Q 3:7) are those whom Allah has guided (هَداهُمُ الله), meaning He personally undertook their instruction. And <<those are the people of understanding (أُولُوا الْأَلْبابِ)>>. Part of the knowledge He taught them is that there is a kernel (لب) for us concealed by a husk (قشر). Thus, the negator and the affirmer both speak truly.\n\nWhoever says that Allah is the Manifest (ظاهر) has said nothing about Allah except what Allah has said about Himself. The only benefit of the matter being manifest is its witnessing (مشاهدته). Thus, He is witnessed and seen from this perspective. Whoever says that Allah is the Hidden (باطن) has said nothing about Allah except what Allah has said about Himself. The only benefit of the matter being hidden is that <<vision does not encompass Him (لا تُدْرِكُهُ الْأَبْصارُ)>> (Q 6:103). Thus, He is neither witnessed nor seen from this perspective.\n\nWhen one follows this reminder (الذكر) with the best of the Word (أحسن القول), he realizes that there is a concealed kernel, while the other person says that there is nothing except that upon which the sight falls. This latter person is like one who does not see that behind this manifest human form (الصورة الظاهرة الإنسانية) there is another reality (أمرا آخر) that manages and directs it. Whoever sees the form of Zayd has undoubtedly seen him. But the one who acknowledges the kernel (اللب) knows that behind this form there is another reality.\n\nThis manifest effect (الأثر الظاهر) of this form, which belongs to that Hidden (الباطن) reality concealed within this veil (الحجاب), is proven by death, where the form remains but the ruling (الحكم) is removed. So, whoever says that Zayd is the very essence (عين) of that Director, not the essence of the form—and that the form, in his view, is no different from a similar form made of wood or plaster, upon which we all agree—says that he has not seen Him. And whoever says that Zayd is the totality, being both the Manifest and the Hidden, says: \"He saw Him, yet he did not see Him,\" just as it was said concerning the meaning of: <<And you did not throw when you threw, but Allah threw>> (Q 8:17). Thus, the best of the Word is the affirmation of both matters according to both perspectives.\n\nThere is neither witnessed (مشهود) nor witness (شاهد) there,\nExcept One, and the distinction is understood through the synthesis (الجمع).\n\nSo whoever says, \"We witnessed Him,\" his saying is true,\nAnd whoever says, \"We did not witness,\" it is due to weakness and fracture (الصدع).\n\nIf an eye (عين) is characterized by fracture, and the attribute of fracture, which removes benefit, does not cease from it,\n\nWe relied upon hearing (السمع), and thus we became people of discernment (أولي النهى),\nFor there is no knowledge (علم) in that which does not come through hearing.\n\nIf he is protected (معصوما) and speaks, then his word\nIs the Truth (الحق); falsehood will certainly not come to it.\n\nThus, intellect (عقل) and Law (شرع) are two companions who have harmonized,\nSo blessed is he who understands, and blessed is he who legislates.\n\n### [Following (الاتباع) is restricted by what He has defined]\n\nKnow that following (الاتباع) is only in what He has defined for you in His Word (قوله) and His delineation (رسمه). You walk where He causes you to walk, and you stop where He causes you to stop. You look into what He told you to look into, you submit to what He told you to submit to, you use your intellect (تعقل) regarding what He told you to use your intellect regarding, and you believe (تؤمن) in what He told you to believe in.\n\nFor the Divine verses (الآيات الإلهية) contained in the Wise Reminder (الذكر الحكيم) came down varied, and their variation corresponds to the varied description of the one addressed by them. Among them are verses <<for a people who reflect (يَتَفَكَّرُونَ)>>, verses <<for a people who use their intellect (يَعْقِلُونَ)>>, verses <<for a people who hear (يَسْمَعُونَ)>>, verses <<for the believers (لِلْمُؤْمِنِينَ)>>, verses <<for the knowledgeable (لِلْعالِمِينَ)>>, verses for the pious (للمتقين), verses <<for the people of discernment (لِأُولِي النُّهى)>>, verses <<for the people of understanding (لِأُولِي الْأَلْبابِ)>>, and verses for the people of sight (أولي الأبصار).\n\nSo, distinguish as He distinguished, and do not transgress beyond what He mentioned. Rather, place every verse and its counterpart in its proper place. Look at who is addressed by it, and be yourself the one addressed, for you are the totality of what was mentioned. You are described by sight, discernment, understanding, intellect, reflection, knowledge, faith, hearing, and heart (القلب). Therefore, manifest through your contemplation the attribute by which He described you in that specific verse. You will then be among those for whom the Quran was gathered, who synthesized it, and who mastered it. He will then be among its people; indeed, he is the very essence (عين) of the Quran if he possesses this description, and he is one of the People of Allah (أهل الله) and His elect.\n\nThus, the Word (القول) is all good and better. There is no evil (سوء) except in that about which the saying is made—that is the evil—or in the one who speaks it, but not in the Word itself.\n\nThere is no ugliness (قبيح) in the Word or Speech (الكلام),\nUgliness is only in that about which it was said.\n\nOr in that which was said, or that by which one spoke, or that about which one spoke. Understand this, and take the whole of Existence (الوجود) as a written book (كتاب مسطور). If you say \"inscribed\" (مرقوم), it is more eloquent, for it has two faces: speaking with the Real (الحق) and speaking about the Real. You will then be among <<those whom Allah has guided (هَداهُمُ الله)>>, meaning He granted them success through the clear expression (البيان) He gave them. And <<those are the people of understanding (أُولُوا الْأَلْبابِ)>>—the divers who seek the hidden secrets (خفايا الأمور) and realities (حقائقها) of matters, the extractors of its treasures, the solvers of its knots and symbols (رموزها), and the knowers of that by which allusions (الإشارات) occur in the place where expressions (العبارات) are permissible. <<And Allah speaks the Truth (الْحَقَّ), and He guides to the Way (السَّبِيلَ)>> (Q 33:4).",
    "ur": "باب نمبر چار سو بہتر (۴۷۲) اس قطب کے حال میں جس کی منزل یہ ہے: \"جو بات کو غور سے سنتے ہیں، پھر اس میں سے بہترین کی پیروی کرتے ہیں، یہی وہ لوگ ہیں جنہیں اللہ نے ہدایت دی اور یہی عقل والے (أُولُوا الْأَلْبابِ) ہیں\" (الزمر: ۱۸)۔\n\nجو شخص اس ذات کا قول سنتا ہے جس کے سامنے چہرے جھکتے ہیں،\nوہ اس حسن کو پا لیتا ہے جو اس کے کلام میں آتا ہے۔\n\nاور وہ (الحق) ہی حکیم ہے، پس کائنات میں کون ہے جو اس کی حکمت نہ ہو؟\nاور تو اس کی کائنات میں ہے، پس تو اس کی حکمت میں سے ہے۔\n\nپس اگر تو اس بات کی تحقیق کرے جو تیرے کانوں نے اس کے قول سے سنی ہے،\nتو تو اسے اس کے قدم (قدیم ہونے) کے دو مرتبوں میں سے سنتا ہے۔\n\nعرش اس خطاب کو منفرد کرتا ہے جسے کرسی تقسیم کرتی ہے،\nاس لیے کہ قول میں قدم (قدیم ہونا) موجود ہے۔\n\nبے شک حدوث (نئی چیز) کا ایک رُخ اس کے محدث (پیدا کرنے والے) کی طرف ہوتا ہے،\nاور دوسرا رُخ اس کی نیستی (عدم) کی طرف دیکھتا ہے۔\n\nاللہ جل جلالہ نے فرمایا: \"ان کے پاس ان کے رب کی طرف سے کوئی نئی نصیحت (ذِكْرٍ مُحْدَثٍ) نہیں آتی\" (الأنبياء: ۲)۔ اور اللہ تعالیٰ نے فرمایا: \"ان کے پاس رحمن کی طرف سے کوئی نئی نصیحت (ذِكْرٍ مُحْدَثٍ) نہیں آتی\" (الشعراء: ۵)۔\n\n### [یہ کہ عالم میں ہر کلام اللہ تعالیٰ کا کلام ہے]\n\nجان لو کہ یہ (الحق) کی طرف سے ایک تنبیہ ہے کہ عالم میں ہر کلام اسی کا کلام ہے، کیونکہ اللہ کی طرف سے ہمارے پاس جو کچھ آیا ہے وہ ہر نئی نصیحت (ذکر محدث) ہی ہے، اس لیے کہ آنے والے میں آنا بلا شک حادث (نئی چیز) ہوتا ہے۔ اور وہ (ذکر) نہیں آیا مگر اس سے جس کے ساتھ حادث قائم ہے۔ اور وہ کچھ نہیں مگر وہ صورت جس میں وہ دیکھنے والوں کی آنکھوں میں ظہور الٰہی (التجلی) کرتا ہے اور دیکھنے والوں کی آنکھوں میں اس سے خالی ہو جاتا ہے۔ پس وہاں سننے والا، کلام کرنے والا، کہنے والا، جس سے کہا گیا، جس کے ذریعے کہا گیا، اور کہا گیا سب موجود ہیں۔ اور یہ سب حسن ہے، مگر یہ حسن اور احسن کے درمیان ہے۔ پس ہر کلام حسن ہے، اور جو قول مقصد کے موافق ہو وہ احسن ہے۔\n\nپس قول سب کا سب حسن ہے۔ اور جہاں تک اس کے قول کا تعلق ہے کہ \"اللہ بری بات کے کھلے عام کہنے کو پسند نہیں کرتا\" (النساء: ۱۴۸)، تو اس نے محبت کی نفی کی ہے کہ اس کا تعلق قول میں برائی (سوء) کے اظہار سے ہو۔ اور قول میں برائی یہ ہے کہ کوئی قول کے بارے میں کہے کہ یہ برا ہے، حالانکہ اس کا قائل اللہ کے سوا کوئی نہیں۔ اور برائی کا کھلے عام اظہار کبھی قول میں ہوتا ہے اور کبھی ان افعال میں جو قول نہیں ہوتے۔ پس اس میں جہر (کھلے عام اظہار) سے مراد بندے سے بے حیائی کا ظاہر ہونا ہے، جیسا کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"تم میں سے جو شخص ان گندی باتوں میں مبتلا ہو جائے تو اسے چاہیے کہ پردہ ڈال لے\" (حدیث)۔ یعنی اسے کھلے عام ظاہر نہ کرے۔ اور برائی (سوء) دو طرح کی ہے: ایک شرعی برائی، اور دوسری وہ برائی جو تمہیں ناگوار گزرے، اگرچہ شریعت نے اس کی تعریف کی ہو اور اس کی مذمت نہ کی ہو۔ پس یہ برائی اس وجہ سے ہو سکتی ہے کہ وہ تمہیں ناگوار گزرتی ہے، نہ کہ اس لیے کہ اس برائی میں اللہ کا حکم ہے۔ جیسا کہ اللہ تعالیٰ نے فرمایا: \"اور برائی کا بدلہ اسی جیسی برائی ہے\" (الشوری: ۴۰)۔ پس پہلی برائی شرعی ہے کیونکہ اس نے تجاوز کیا، اور دوسری برائی وہ ہے جو بدلہ دیے جانے والے کو ناگوار گزرتی ہے۔ اور یہ بدلہ کوئی مشروع برائی نہیں ہے، کیونکہ اللہ برائی کو مشروع نہیں کرتا۔ اور جب زبان میں برے اور اچھے پر اصطلاح قائم ہو گئی، تو اللہ کی طرف سے شریعت اسی توافق کے مطابق نازل ہوئی، پس انہوں نے اسے برائی کا نام دیا اور کہا کہ وہاں برائی موجود ہے۔ تو اللہ نے فرمایا: \"اللہ بری بات کے کھلے عام کہنے کو پسند نہیں کرتا\" (النساء: ۱۴۸)، جسے تم نے برائی کا نام دیا ہے کیونکہ وہ تمہارے مقاصد کے موافق نہیں ہے۔ جیسا کہ تم نے سنا ہے کہ \"ابرار کی نیکیاں مقربین کی برائیاں ہیں\"۔\n\nاور حقیقت میں احسن، نسبت کے اعتبار سے، برائی نہیں ہے۔ پس اللہ کی طرف سے ہر چیز حسن ہے، خواہ وہ چیز ناگوار ہو یا خوش کرے۔ پس معاملہ اضافی ہے۔ تو اس کا قول \"یہی وہ لوگ ہیں جنہیں اللہ نے ہدایت دی\" (الزمر: ۱۸) سے مراد حسن اور احسن کی معرفت (المعرفۃ) کی طرف ہدایت دینا ہے۔ اور \"یہی عقل والے (أُولُوا الْأَلْبابِ) ہیں\" (الزمر: ۱۸) سے مراد وہ لوگ ہیں جو امر کے مغز (لب) کو نکالنے والے ہیں جو حفاظت کے لیے چھلکے (قشر) میں چھپا ہوا ہے۔ کیونکہ آنکھ صرف حجاب پر پڑتی ہے، اور محجوب (پردے میں چھپی ہوئی چیز) پر نہیں پڑتی۔ أُولُوا الْأَلْبابِ کے لیے یہ حجابی صورت پر تنبیہ ہے جس میں (الحق) ظہور الٰہی (التجلی) کرتا ہے، پھر اس سے دوسرے حجاب کی طرف منتقل ہو جاتا ہے۔ پس حقیقت میں وہاں حجاب سے حجاب کی طرف انتقال کے سوا کچھ نہیں، کیونکہ کوئی بھی ظہور الٰہی (التجلی) کبھی دہرایا نہیں جاتا۔ لہٰذا صورتوں کا مختلف ہونا ضروری ہے، اور (الحق) ان سب کے پیچھے ہے۔ پس ہمیں اس سے صرف الاسم الظاہر ہی حاصل ہے، خواہ وہ رؤیت ہو یا حجاب۔ اور جہاں تک الاسم الباطن کا تعلق ہے، وہ ہمیشہ باطن ہی رہتا ہے، اور یہی وہ معقول مغز (لب) ہے جسے أُولُوا الْأَلْبابِ ادراک کرتے ہیں۔ یعنی وہ جانتے ہیں کہ وہاں ایک مغز (لب) ہے، اور یہ وہی ہے جس پر یہ ظاہر ہونے والی چیز حجاب بن کر آئی ہے۔ اور یہ دونوں حالتوں میں الاسم الظاہر کے سوا کچھ نہیں، اور وہی مسمیٰ ہے۔\n\nپس جس نے رؤیت کا قول کیا اس نے سچ کہا، اور جس نے رؤیت کی نفی کی اس نے بھی سچ کہا۔ کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے ہمارے لیے رؤیت کو ثابت کیا، اپنے اس قول سے: \"تم اپنے رب کو دیکھو گے\" (حدیث)۔ اور رؤیت کی نفی بھی کی، کیونکہ آپ صلی اللہ علیہ وسلم سے شبِ معراج کے بارے میں پوچھا گیا کہ کیا آپ نے اپنے رب کو دیکھا؟ تو آپ نے سائل پر تعجب کرتے ہوئے فرمایا: \"وہ نور ہے، میں اسے کیسے دیکھ سکتا ہوں؟\" (حدیث)۔ یعنی وہ نور ہے، اور میں حدوث (نئی ہونے) کی کمزوری کی وجہ سے نور کا ادراک نہیں کر سکتا۔ اور نور اللہ کے لیے ایک ذاتی وصف ہے، اور حدوث ہمارے لیے اسی طرح ایک ذاتی نسبت ہے۔ پس ہم ہمیشہ اسی حال پر رہیں گے جس پر ہم ہیں، اور وہ ہمیشہ اسی حال پر رہے گا۔\n\nاور \"علم میں پختہ کار (الرَّاسِخُونَ في الْعِلْمِ) وہ ہیں جنہیں اللہ نے ہدایت دی\" (آل عمران: ۷)، یعنی اس نے خود ان کی تعلیم کی ذمہ داری لی۔ اور \"یہی عقل والے (أُولُوا الْأَلْبابِ) ہیں\" (الزمر: ۱۸)۔ پس اس علم میں سے جو اس نے انہیں سکھایا، یہ بھی تھا کہ ہمارے لیے ایک مغز ہے جو چھلکے میں چھپا ہوا ہے۔ پس نفی کرنے والے اور ثابت کرنے والے دونوں نے سچ کہا۔ پس جس نے کہا کہ اللہ ظاہر ہے، تو اس نے اللہ کے بارے میں وہی کہا جو اللہ نے اپنے بارے میں کہا ہے۔ اور امر کے ظاہر ہونے کا کوئی فائدہ نہیں مگر اس کا مشاہدہ (الشہود) کرنا، پس وہ اس رُخ سے مشہود اور مرئی ہے۔ اور جس نے کہا کہ اللہ باطن ہے، تو اس نے اللہ کے بارے میں وہی کہا جو اللہ نے اپنے بارے میں کہا ہے۔ اور امر کے باطن ہونے کا کوئی فائدہ نہیں مگر یہ کہ \"اسے نگاہیں نہیں پا سکتیں\" (الأنعام: ۱۰۳)۔ پس وہ اس رُخ سے نہ مشہود ہے اور نہ مرئی۔\n\nپس جب اس نے اس ذکر میں احسن القول کی پیروی کی، تو اس نے ادراک کیا کہ وہاں ایک چھپا ہوا مغز (لب) موجود ہے، جبکہ دوسرے نے کہا کہ وہاں اس کے سوا کچھ نہیں جس پر نگاہ پڑی ہے۔ پس وہ اس شخص کی طرح ہے جو یہ نہیں دیکھتا کہ اس ظاہری انسانی صورت کے پیچھے کوئی دوسرا امر ہے جو اسے تدبیر کرتا ہے اور چلاتا ہے۔ اور جس نے زید کی صورت کو دیکھا، تو بلا شک اس نے اسے دیکھ لیا۔ اور جس نے مغز (لب) کا اعتراف کیا، اس نے جان لیا کہ اس صورت کے پیچھے کوئی دوسرا امر ہے۔ اس ظاہری صورت کا یہ ظاہر اثر اس باطن کی طرف ہے جو اس حجاب میں چھپا ہوا ہے۔ اس کی دلیل موت ہے، جبکہ صورت باقی رہتی ہے اور حکم زائل ہو جاتا ہے۔ پس جس نے کہا کہ زید اس مدبر کی عین ہے نہ کہ صورت کی عین، اور یہ کہ صورت اس کے نزدیک لکڑی یا چونے سے بنی ہوئی اس کی مثال کی صورت سے مختلف نہیں ہے جس پر ہم متفق ہیں، تو اس نے کہا کہ اس نے اسے نہیں دیکھا۔ اور جس نے کہا کہ زید مجموعہ ہے، یعنی وہ ظاہر بھی ہے اور باطن بھی، تو اس نے کہا کہ اس نے اسے دیکھا، اور نہیں دیکھا، جیسا کہ اس معنی میں فرمایا: \"اور جب تم نے پھینکا تو درحقیقت تم نے نہیں پھینکا\" (الأنفال: ۱۷)۔ پس احسن القول دونوں امور کو دونوں رُخوں سے ثابت کرنا ہے۔\n\nپس وہاں نہ کوئی مشہود ہے اور نہ کوئی شاہد،\nسوائے ایک کے، اور فرق کو جمع کے ذریعے سمجھا جاتا ہے۔\n\nپس جس نے کہا کہ ہم نے اس کا مشاہدہ کیا، اس کا قول سچا ہے،\nاور جس نے کہا کہ ہم نے مشاہدہ نہیں کیا، تو یہ کمزوری اور دراڑ کی وجہ سے ہے۔\n\nجب کوئی آنکھ دراڑ سے متصف ہو جائے اور اس میں دراڑ کی وہ صفت باقی رہے\nجو نفع کو زائل کر دیتی ہے۔\n\nہم نے سننے پر بھروسہ کیا، پس ہم عقل و فہم والے (أولي النهى) بن گئے،\nاور اس چیز میں کوئی علم نہیں جو سننے سے حاصل نہ ہو۔\n\nجب وہ معصوم ہو اور کوئی بات کہے، تو اس کا قول حق ہے،\nاس میں یقیناً کوئی جھوٹ نہیں آتا۔\n\nپس عقل اور شریعت دو دوست ہیں جو باہم مل گئے،\nپس مبارک ہو وہ جس نے عقل استعمال کی اور مبارک ہو وہ جس نے شریعت کو اپنایا۔\n\n### [پیروی اسی چیز تک محدود ہے جس کی حد مقرر کی گئی ہے]\n\nاور جان لو کہ پیروی صرف اسی چیز میں ہے جس کی حد اس نے اپنے قول اور رسم میں تمہارے لیے مقرر کر دی ہے۔ پس تم وہاں چلو جہاں وہ تمہیں چلائے، اور وہاں ٹھہرو جہاں وہ تمہیں ٹھہرائے، اور اس میں غور کرو جس میں اس نے تمہیں غور کرنے کو کہا، اور اس میں تسلیم کرو جس میں اس نے تمہیں تسلیم کرنے کو کہا، اور اس میں عقل استعمال کرو جس میں اس نے تمہیں عقل استعمال کرنے کو کہا، اور اس میں ایمان لاؤ جس میں اس نے تمہیں ایمان لانے کو کہا۔ کیونکہ ذکر حکیم میں وارد ہونے والی الٰہی آیات مختلف انداز میں آئی ہیں، اور ان کا تنوع مخاطب کے وصف کے تنوع کی وجہ سے ہے۔ پس ان میں سے کچھ آیات \"ان لوگوں کے لیے ہیں جو غور و فکر کرتے ہیں\" (لِقَوْمٍ يَتَفَكَّرُونَ)، اور کچھ آیات \"ان لوگوں کے لیے ہیں جو عقل استعمال کرتے ہیں\" (لِقَوْمٍ يَعْقِلُونَ)، اور کچھ آیات \"ان لوگوں کے لیے ہیں جو سنتے ہیں\" (لِقَوْمٍ يَسْمَعُونَ)، اور کچھ آیات \"مؤمنین کے لیے\"، اور کچھ آیات \"عالمین کے لیے\"، اور کچھ آیات \"متقیوں کے لیے\"، اور کچھ آیات \"عقل و فہم والوں کے لیے\" (لِأُولِي النُّهى)، اور کچھ آیات \"عقل والوں کے لیے\" (لِأُولِي الْأَلْبابِ)، اور کچھ آیات \"بصیرت والوں کے لیے\" (لأولي الأبصار) ہیں۔ پس تم بھی اسی طرح تفریق کرو جس طرح اس نے تفریق کی ہے، اور جو کچھ ذکر کیا گیا ہے اس سے تجاوز نہ کرو، بلکہ ہر آیت اور اس کے علاوہ کو اس کی جگہ پر رکھو۔ اور دیکھو کہ اس نے کس کو مخاطب کیا ہے، اور تم خود کو اس کا مخاطب سمجھو، کیونکہ تم ان تمام مذکورہ اوصاف کا مجموعہ ہو۔ بے شک تم بصیرت، عقل و فہم (النہي)، مغز (اللب)، عقل، تفکر، علم، ایمان، سماعت اور قلب سے موصوف ہو۔ پس اپنی نظر کو اس صفت کے ساتھ ظاہر کرو جس کے ساتھ اس نے تمہیں اس خاص آیت میں موصوف کیا ہے، تو تم ان لوگوں میں سے ہو جاؤ گے جن کے لیے قرآن جمع کر دیا گیا، پس وہ اس پر مجتمع ہو گیا اور انہوں نے اسے یاد کر لیا۔\n\nپس وہ اس کا اہل ہو گیا، بلکہ اگر وہ اس وصف پر ہو تو وہ عین قرآن ہے، اور وہ اللہ کے خاص لوگوں میں سے ہے۔ پس قول سب کا سب حسن اور احسن ہے، اور وہاں کوئی برائی نہیں مگر اس چیز میں جس کے بارے میں کہا گیا کہ وہ برائی ہے، یا اس میں جس نے اس کے ساتھ کلام کیا، نہ کہ قول میں۔\n\nقول اور کلام میں کوئی قبیح (برا) نہیں ہے،\nبرائی تو صرف اس چیز میں ہے جس کے بارے میں کہا گیا۔\n\nیا جس کے ذریعے کہا گیا یا جس کے بارے میں کلام کیا گیا۔ پس اسے سمجھو، اور پورے الوجود (ہستی) کو ایک لکھی ہوئی کتاب (کتاب مسطور) سمجھو، اور اگر تم اسے مرقوم (نقش کی ہوئی) کہو تو یہ زیادہ بلیغ ہے، کیونکہ اس کے دو رُخ ہیں: (الحق) کے ساتھ ناطق اور (الحق) کی طرف سے ناطق۔ تب تم ان لوگوں میں سے ہو جاؤ گے \"جنہیں اللہ نے ہدایت دی\" (الزمر: ۱۸)، یعنی انہیں اس بیان کے ذریعے توفیق دی جو اس نے انہیں عطا کیا، اور \"یہی عقل والے (أُولُوا الْأَلْبابِ) ہیں\" (الزمر: ۱۸)۔ یہ وہ لوگ ہیں جو امور کے پوشیدہ رازوں اور ان کی حقائق (حقائق) پر غوطہ زن ہوتے ہیں، ان کے خزانوں کو نکالتے ہیں، ان کی گرہوں اور رموز کو کھولتے ہیں، اور اس بات کو جانتے ہیں کہ اشارات کس مقام پر واقع ہوتے ہیں جہاں عبارات کی گنجائش ہوتی ہے۔ اور \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (الأحزاب: ۴)۔",
    "fa": "باب چهارصد و هفتاد و دوم در بیان حال قطبی که منزلگاه او این آیه بود: «آنان که سخن را می‌شنوند و بهترین آن را پیروی می‌کنند، ایشان کسانی هستند که خداوند هدایتشان کرده و ایشان صاحبان خرد (أُولُوا الْأَلْبابِ) هستند.» (الزمر: ۱۸)\n\nهر کس سخن کسی را بشنود که چهره‌ها در برابرش خضوع می‌کنند،\nبه نیکی آنچه در کلامش به او می‌رسد، رستگار می‌شود.\n\nاو حکیم است، پس حکمتش در کیست که در هستی است؟\nو تو در هستی او هستی، پس تو از حکمت او هستی.\n\nپس اگر آنچه را گوش‌هایت از سخن او شنیدند، در مرتبه قدمش (قدمه) محقق سازی،\nاز خودت می‌شنوی.\n\nعرش آنچه را کرسی تقسیم می‌کند، یگانه می‌سازد،\nاز خطاب، به سبب قدمت (قدمه) موجود در آن سخن.\n\nهمانا حدوث (الحدوث) را رویی به سوی پدیدآورنده‌اش هست،\nو روی دیگرش از آن به سوی عدمش می‌نگرد.\n\nخداوند جل جلاله فرمود: «هیچ یادآوری (ذِكْرٍ) تازه‌ای (مُحْدَثٍ) از پروردگارشان برایشان نمی‌آید.» (الأنبیاء: ۲) و فرمود: «هیچ یادآوری (ذِكْرٍ) تازه‌ای (مُحْدَثٍ) از [خدای] رحمان برایشان نمی‌آید.» (الشعراء: ۵)\n\n### [اینکه هر کلامی در عالم، کلام خداوند متعال است]\n\nبدان که این تنبیهی از جانب حق (الحق) است بر اینکه هر کلامی در عالم، کلام اوست؛ زیرا از جانب خداوند به ما نرسیده است مگر هر ذکر (ذِكْر) تازه‌ای (محدث). چون آمدن (الإتيان) بدون شک در آنچه می‌آید، حادث می‌شود. و نیامده است مگر از کسی که حادث (الحادث) به او قائم است، و آن نیست مگر صورتی که حق (الحق) در آن در چشم بینندگان تجلی (التجلی) می‌کند و در چشم بینندگان از آن کناره می‌گیرد. پس در آنجا نیست مگر شنونده و گوینده، و قائل و مقولٌ له (کسی که به او گفته می‌شود) و مقولٌ به (چیزی که با آن گفته می‌شود) و مقول (گفته شده)، و همه آن نیکوست، جز اینکه میان نیکو و نیکوتر تفاوت است. پس هر کلامی نیکوست، و آنچه از سخن موافق غرض باشد، نیکوتر است. پس تمام سخن نیکوست.\n\nو اما قول او [خداوند]: «خداوند بلند گفتن سخن بد (السُّوءِ) را دوست ندارد.» (النساء: ۱۴۸) [این آیه] نفی محبتی است که متعلق آن بلند گفتن بدی از سخن باشد. و بدی از سخن این است که در مورد سخن بگوید که آن بد است، و هیچ گوینده‌ای جز خداوند به آن قائل نیست. و بلند گفتن بدی (الجهر بالسوء) گاهی می‌تواند سخن باشد و گاهی در افعالی که سخن نیستند، که در آنجا منظور از بلند گفتن، آشکار شدن فحشا از بنده است، چنانکه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «هر کس از شما به این پلیدی‌ها مبتلا شد، پس باید خود را بپوشاند (فلیستتر).» یعنی آن را آشکار نکند.\n\nو بدی (السوء) بر دو نوع است: بدی شرعی، و بدی‌ای که تو را ناراحت می‌کند، هرچند شرع آن را ستوده و نکوهش نکرده باشد. پس این بدی ممکن است از این جهت باشد که تو را ناراحت می‌کند، نه اینکه بدی در آن حکم خداوند باشد، چنانکه خداوند متعال فرمود: «و جزای بدی، بدی‌ای مانند آن است.» (الشوری: ۴۰) پس بدی اول شرعی است، زیرا تجاوز کرده است، و بدی دوم چیزی است که مجازات شونده را ناراحت می‌کند، و این جزا، بدی مشروع نیست، زیرا خداوند بدی را تشریع نمی‌کند. و چون در زبان، اصطلاح بر بد (السيئ) و نیکو (الحسن) واقع شد، شرع از نزد خداوند بر اساس توافق [مردم] نازل شد. پس آنان آن را بد نامیدند و گفتند که بدی وجود دارد.\n\nپس خداوند فرمود: «خداوند بلند گفتن سخن بد (السُّوءِ) را دوست ندارد.» (النساء: ۱۴۸) که شما آن را بد نامیده‌اید، به دلیل اینکه موافق اغراض شما نیست، چنانکه شنیده‌ای: «حسنات نیکان، سیئات مقربان هستند.» و در حقیقت، نیکوتر (الأحسن) نسبت به بد (السيئ) نیست. پس هر چیزی از جانب خداوند نیکوست، چه آن چیز ناراحت کننده باشد و چه شاد کننده. پس امر، اضافی (إضافي) است.\n\nپس قول او: «ایشان کسانی هستند که خداوند هدایتشان کرده» (الزمر: ۱۸) یعنی به معرفت (المعرفة) نیکو و نیکوتر، و «ایشان صاحبان خرد (أُولُوا الْأَلْبابِ) هستند.» (الزمر: ۱۸) یعنی منظور از خردها (الألباب)، کسانی هستند که مغز (لب) امر را که به خاطر صیانت، با پوست پوشیده شده است، استخراج می‌کنند. زیرا چشم جز بر حجاب (الحجاب) واقع نمی‌شود. و محجوب (المحجوب) برای صاحبان خرد (أولي الألباب) تنبیهی است بر صورت حجابی (الصورة الحجابية) که حق (الحق) در آن تجلی (التجلی) می‌کند، سپس از آن به حجابی دیگر منتقل می‌شود. پس در حقیقت، جز انتقال از حجابی به حجاب دیگر نیست، زیرا تجلی الهی (تجل إلهي) هرگز تکرار نمی‌شود. پس ناگزیر باید صور مختلف باشند، و حق (الحق) ورای همه اینهاست.\n\nپس ما از او نداریم مگر اسم ظاهر (الاسم الظاهر) را، چه به صورت رؤیت و چه به صورت حجاب. و اما اسم باطن (الاسم الباطن)، پیوسته باطن است، و آن مغز (اللب) معقولی است که صاحبان خرد (أولو الألباب) آن را درک می‌کنند، یعنی می‌دانند که مغزی وجود دارد، و آن همین است که حجاب بر آن ظاهر شده است، و آن نیست مگر اسم ظاهر (الاسم الظاهر) که در هر دو حال نامیده می‌شود.\n\nپس هر کس به رؤیت (دیدن) قائل شد، راست گفت، و هر کس به نفی رؤیت قائل شد، راست گفت. زیرا رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) رؤیت را برای ما اثبات کرد: «با قولش (صَلَّى اللهُ عَليهِ وسَلَّم): پروردگارتان را می‌بینید.» (حدیث) و رؤیت را نفی کرد: «زیرا از او (صَلَّى اللهُ عَليهِ وسَلَّم) پرسیده شد: آیا پروردگارت را دیدی؟ یعنی در شب معراج. فرمود: از پرسشگر تعجب می‌کند: نوری است، چگونه او را ببینم؟» یعنی او نور است، و من نور را به دلیل ضعف حدوث (الحدوث) درک نمی‌کنم. و نور برای خداوند وصف ذاتی است، و حدوث نیز برای ما نسبت ذاتی است. پس ما پیوسته بر آنچه هستیم، هستیم، و او پیوسته بر آنچه هست، هست.\n\nو «راسخون در علم (الرَّاسِخُونَ في الْعِلْمِ)» (آل عمران: ۷) کسانی هستند که خداوند هدایتشان کرده، یعنی خود تعلیم آنان را بر عهده گرفته است، و «ایشان صاحبان خرد (أُولُوا الْأَلْبابِ) هستند.» (الزمر: ۱۸) پس از جمله علمی که به آنان آموخت، این بود که برای ما مغزی وجود دارد که با پوست پوشیده شده است. پس نفی کننده و اثبات کننده هر دو راست گفتند.\n\nپس هر کس گفت که خداوند ظاهر است، بر خداوند نگفته است مگر آنچه خداوند درباره خود گفته است، و فایده ظاهر بودن امر جز مشاهده آن نیست. پس او از این وجه مشهود و مرئی است. و هر کس گفت که خداوند باطن است، بر خداوند نگفته است مگر آنچه خداوند درباره خود گفته است، و فایده باطن بودن امر جز این نیست که «چشم‌ها او را درک نمی‌کنند.» (الأنعام: ۱۰۳) پس او از این وجه شهود نمی‌شود و دیده نمی‌شود.\n\nپس هنگامی که این ذاکر، نیکوترین سخن را پیروی کرد، درک نمود که مغزی پوشیده وجود دارد، در حالی که دیگری گفت: جز همین که چشم بر آن افتاده، چیزی نیست. پس او مانند کسی است که نمی‌بیند پشت این صورت ظاهری انسانی، امر دیگری است که آن را تدبیر و تصرف می‌کند. و هر کس صورت زید را نزد خود ببیند، بدون شک او را دیده است. و کسی که به مغز (اللب) اعتراف کرد، دانست که پشت این صورت، امر دیگری است. این اثر ظاهری از این صورت، دلیل آن باطن پوشیده در این حجاب است. دلیل آن، مرگ است با باقی ماندن صورت و از بین رفتن حکم.\n\nپس هر کس گفت که زید عین آن مدبر است نه عین صورت، و صورت نزد او فرقی با آنچه ما بر آن اجماع داریم، مانند صورت چوبی یا گچی ندارد، گفت که او را ندیده است. و هر کس گفت که زید همان مجموعه است، یعنی ظاهر و باطن، گفت که او را دیده است، ندیده است، چنانکه در این معنا فرمود: «و تو پرتاب نکردی هنگامی که پرتاب کردی.» (الأنفال: ۱۷) پس نیکوترین سخن، اثبات هر دو امر بر هر دو وجه است.\n\nپس نه مشهودی (مشهود) هست و نه شاهدی (شاهد)،\nجز یکی، و تفاوت با جمع (الجمع) تعقل می‌شود.\n\nپس هر کس گفت او را شهود کردیم، سخنش راست است،\nو هر کس گفت شهود نکردیم، به دلیل ضعف و شکاف (الصدع) است.\n\nاگر چشمی به شکافی متصف شود و صفت شکاف که از بین برنده منفعت است،\nاز آن زائل نشود.\n\nبر شنیدن (السمع) تکیه کردیم، پس صاحبان خرد (أولي النهى) شدیم،\nو در آنچه از شنیدن نباشد، علمی نیست.\n\nاگر معصوم باشد و سخنی بگوید، پس سخن او\nحق است و قطعاً در آن دروغی راه نمی‌یابد.\n\nپس عقل و شرع دو دوست هستند که با هم الفت گرفتند،\nپس مبارک باد آنکه تعقل کرد و مبارک باد آنکه تشریع کرد.\n\n### [پیروی محدود به چیزی است که او حد گذاشته است]\n\nو بدان که پیروی (الاتباع) تنها در چیزی است که [حق] برای تو در قولش حد گذاشته و رسم کرده است. پس هر جا تو را به راه رفتن واداشت، راه می‌روی، و هر جا تو را به توقف واداشت، می‌ایستی، و در آنچه به تو گفت بنگر، می‌نگری، و در آنچه به تو گفت تسلیم شو، تسلیم می‌شوی، و در آنچه به تو گفت تعقل کن، تعقل می‌کنی، و در آنچه به تو گفت ایمان بیاور، ایمان می‌آوری. زیرا آیات الهی که در ذکر حکیم (قرآن) آمده‌اند، متنوع وارد شده‌اند، و این تنوع به دلیل تنوع وصف مخاطبان آن است. پس برخی از آیات برای «گروهی که تفکر می‌کنند (لِقَوْمٍ يَتَفَكَّرُونَ)» (یونس: ۲۴) است، و آیاتی برای «گروهی که تعقل می‌کنند (لِقَوْمٍ يَعْقِلُونَ)» (الرعد: ۴)، و آیاتی برای «گروهی که می‌شنوند (لِقَوْمٍ يَسْمَعُونَ)» (النحل: ۶۵)، و آیاتی برای مؤمنان (لِلْمُؤْمِنِينَ)، و آیاتی برای عالمان (لِلْعالِمِينَ)، و آیاتی برای پرهیزکاران (لِلْمُتَّقِينَ)، و آیاتی برای «صاحبان خرد (لِأُولِي النُّهى)» (طه: ۵۴)، و آیاتی برای «صاحبان مغز و خرد (لِأُولِي الْأَلْبابِ)» (الزمر: ۱۸)، و آیاتی برای صاحبان بینش (لأولي الأبصار).\n\nپس تفکیک کن چنانکه او تفکیک کرده است، و از آنچه ذکر کرده فراتر نرو، بلکه هر آیه و غیر آن را در جایگاه خود قرار ده، و بنگر که با چه کسی خطاب کرده است، و خودت مخاطب آن باش، زیرا تو مجموع آنچه ذکر شد هستی. چرا که تو به بینایی (البصر)، خرد (النهي)، مغز (اللب)، عقل، تفکر، علم، ایمان، شنیدن (السمع) و قلب توصیف شده‌ای. پس با صفتی که در آن آیه خاص تو را به آن توصیف کرده است، بنگر تا از کسانی باشی که قرآن برایشان جمع شده و بر او گرد آمده و آن را آشکار ساخته است.\n\nپس او از اهل آن بود، بلکه اگر بر این وصف باشد، عین قرآن است، و او از اهل خاص خداوند است. پس تمام سخن نیکو و نیکوتر است، و بدی‌ای نیست مگر در چیزی که درباره آن گفته شده که بد است، یا در کسی که با آن سخن می‌گوید، نه در خود سخن.\n\nدر قول و کلام، زشتی نیست،\nزشتی تنها در چیزی است که درباره آن گفته شده است.\n\nیا گفته شده، یا با آن سخن گفته شده، یا درباره آن سخن گفته شده است. پس این را بفهم و تمام هستی (الوجود) را به مثابه کتابی نوشته شده (مسطور) بگیر، و اگر بگویی مرقوم (نوشته شده با ارقام) است، رساتر است، زیرا دو وجه دارد: ناطق به حق (الحق) و ناطق از حق. تا از کسانی باشی که «خداوند هدایتشان کرده» (الزمر: ۱۸)، یعنی به آنچه از بیان به آنان داده، موفقشان ساخته است، و «ایشان صاحبان خرد (أُولُوا الْأَلْبابِ) هستند.» (الزمر: ۱۸) یعنی غواصان بر نهان‌های امور و حقایق آنها، استخراج کنندگان گنج‌هایشان، و گشاینده‌های گره‌ها و رموزشان، و دانایان به آنچه اشارات در موضعی که عبارات در آن اجازه می‌دهند، بر آن واقع می‌شود. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند.» (الأحزاب: ۴)"
  },
  "page_count": 3
}