{
  "id": 265,
  "title": {
    "ar": "الباب الخامس والستون ومائتان في معرفة الوارد",
    "en": "Chapter Two Hundred and Sixty-Five: On the Gnosis of the Incoming (الوارد)",
    "ur": "پینسٹھواں اور دو سوواں باب وارد کی معرفت میں",
    "fa": "باب دویست و شصت و پنجم در معرفت وارد (الوارد)"
  },
  "content": {
    "ar": "## «الباب الخامس والستون ومائتان في معرفة الوارد»\n\n\n> تعشقت بالصادر الوارد *** تعشق شفعي بالواحد\n\n\n> وأسماؤه كلها ورد *** سراعا لتخفى على الراصد\n\n\n> وتعطي بآثارها همة *** إلى كل قلب لها قاصد\n\n\n### [كل اسم إلهى يرد على القلب فهو الوارد]\n\n\nالوارد عند القوم وعندنا ما يرد على القلب من كل اسم إلهي فالكلام عليه بما هو وارد لا بما ورد فقد يرد بصحو وبسكر وبقبض وببسط وبهيبة وبأنس وبأمور لا تحصى وكلها واردات غير أن القوم اصطلحوا على أن يسموا الوارد ما ذكرناه من الخواطر المحمودة\n\n\n### [أن الوارد بما هو وارد لا يتقيد بحدوث ولا قدم‏]\n\n\nفاعلم يا أخي أن الوارد بما هو وارد لا يتقيد بحدوث ولا قدم فإن الله قد وصف نفسه مع قدمه بالإتيان والورود إتيان والوارد قد تختلف أحواله في الإتيان فقد يرد فجأة كالهجوم والبوادة وقد يرد غير فجأة عن شعور من الوارد عليه بعلامات وقرائن أحوال تدل على ورود أمر معين يطلبه استعداد المحل وكل وارد إلهي لا يأتي إلا بفائدة وما ثم وارد الإلهي\n\n\nكونيا كان أو غير كوني والفائدة التي تعم كل وارد ما يحصل عند الوارد عليه من العلم من ذلك الورود ولا يشترط فيه ما يسره ولا ما يسوءه فإن ذلك ما هو حكم الوارد وإنما حكم الوارد ما حصل من العلم وما وراء ذلك فمن حيث ما ورد به لا من حيث نفسه فيأتي الله يوم القيامة للفصل والقضاء بين الناس فمن الناس من يقضي له بما فيه سعادته ومن الناس من يقضي له بما فيه شقاوته والإتيان واحد والقضاء واحد والمقضي به مختلف والوارد لا يخلو ما أن يكون متصفا بالصدور في حال وروده فيكون واردا من حيث من ورد عليه صادرا من حيث من صدر عنه فلا بد أن يكون هذا الوارد محدثا من الله وإن لم يتصف بالصدور في حال وروده فإنه وارد قديم والورود نسبة تحدث له عند العبد الوارد عليه فالواحد صادر وارد والآخر وارد لا غير وما ثم قديم يرد غير الأسماء الإلهية فإن وردت من حيث العين فلا تختلف في الورود وإن وردت من حيث الحكم فتختلف باختلاف الأحكام فإنها مختلفة الحقائق إلا ما تكون عليه من دلالتها على العين فلا تختلف وسواء كان الوارد قديما أو محدثا فإن الذي ورد به لا بد أن يكون محدثا وهو الذي يبقى عند الوارد عليه وينصرف الوارد ولا بد من انصرافه وسبب ذلك بقاء الحرمة عليه فإنه لا بد من وارد آخر يرد عليه فلا بد من القبول عليه من هذا الشخص والإعراض عمن يكون هناك فيقع عدم وفاء باحترام الوارد الأول فلهذا يرحل بعد أداء ما ورد به فإذا ورد الوارد الثاني وجده مفرغا له فاستقبله وما ثم خاطر يجذبه عنه بتعلقه به فكل وارد يصدر عنه بحرمته وحشمته فيثني عليه خيرا عند الله فيكون ذلك الثناء سعادته والواردات على الحقيقة إذا كانت محدثة فما هي سوى عين الأنفاس والذي ترد به من الأمور والأحكام هي التي تعرفها أهل الطريق بالواردات فإن الأنفاس هي الحاملة لصور هذه الواردات فليست الواردات المحدثة فإنها بأنفسها بل هي صور الأنفاس فتختلف صورها باختلاف أحكام الأسماء الإلهية فيها فالوارد لها كالتحيز للعرض بحكم التبعية للجوهر فيه فالجوهر هو المتحيز لا العرض كذلك النفس هو الوارد لا الصورة\nوالفائدة في الصورة كالرسالة في الرسول فوارد بعلم ووارد بعمل ووارد جامع لهما ووارد بحال ووارد بعلم وحال ووارد بعمل وحال ووارد بعلم وعمل وحال وذلك كوارد الصحو والسكر وأمثاله وهو أقوى الواردات وإذا كان الوارد غير محدث فهو المعبر عنه بارتفاع الوسائط بين الله وبين عبده فهو تجل من الوجه الخاص الذي لكل مخلوق فما ينقال ما يعطيه ولا ما يحصل له فيه وقليل من أهل الله من يكون له ذلك وليس في الواردات مثله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Sixty-Five: Concerning the Knowledge of the Influx (الوارد)\n\nI am enamored of the Emanation (الصادر) and the Influx (الوارد),\nThe love of my duality for the Unity (الواحد).\n\nAnd all His Names are an Influx (وَرْد),\nSwift so as to be concealed from the watcher (الراصد).\n\nAnd by their effects, they grant aspiration (هِمَّة)\nTo every heart that seeks them.\n\n### [Every Divine Name that descends upon the Heart is the Influx]\n\nThe Influx (الوارد), according to the People [of the Way] and according to us, is that which descends upon the heart (القلب) from every Divine Name (اسم إلهي). The discussion concerning it is based on its nature *as* an Influx, not merely on the specific thing that has descended. It may descend accompanied by sobriety (صحو) or intoxication (سكر), by contraction (قبض) or expansion (بسط), by awe (هيبة) or intimacy (أنس), and by innumerable other states. All of these are influxes (واردات). Nevertheless, the People have conventionally agreed to designate the Influx as the praiseworthy thoughts (الخواطر المحمودة) we have mentioned.\n\n### [That the Influx, in its nature as Influx, is not restricted by Contingency or Eternity]\n\nKnow, O my brother, that the Influx (الوارد), in its nature as Influx, is not restricted by contingency (حدوث) or eternity (قدم). For Allah has described Himself, despite His eternity, with the act of Coming (الإتيان), and Coming is a form of Influx (ورود). The states of the Influx may vary in its coming. It may descend suddenly, like an assault (الهجوم) or an unexpected flash (البوادة), or it may descend gradually, with the recipient being aware of signs and circumstantial indicators that point to the descent of a specific matter sought by the preparedness (استعداد) of the locus (المحل). Every Divine Influx (وارد إلهي) comes only with a benefit. The benefit that encompasses every Influx, whether cosmic (كوني) or non-cosmic, is the knowledge (العلم) that the recipient gains from that descent. It is not a condition that this knowledge be pleasing or displeasing to him, for that is not the essential ruling (حكم) of the Influx. Rather, the ruling of the Influx is the knowledge that is attained. What lies beyond that is related to the means by which it descended, not to the Influx itself.\n\nThus, Allah comes on the Day of Resurrection for the separation and judgment (القضاء) between people. For some people, He decrees what brings them felicity (سعادتهم), and for others, He decrees what brings them wretchedness (شقاوته). The Coming (الإتيان) is one, and the Decree (القضاء) is one, but the object of the decree (المقضي به) is different. The Influx (الوارد) must either be characterized by emanation (الصدور) at the time of its descent—in which case it is an Influx from the perspective of the recipient, and an Emanation (صادر) from the perspective of the source. In this case, this Influx must be contingent (محدث) from Allah. Or, if it is not characterized by emanation at the time of its descent, then it is an eternal (قديم) Influx. The descent (الورود) is a relation that arises for the servant upon whom it descends.\n\nThus, one [type of Influx] is an Emanation and an Influx, while the other is an Influx only. There is no eternal reality that descends other than the Divine Names (الأسماء الإلهية). If they descend from the perspective of the Essence (العين), they do not differ in the descent. But if they descend from the perspective of the ruling (الحكم), they differ according to the difference in the rulings, for their realities (حقائق) are different, except in their indication of the Essence, in which case they do not differ.\n\nWhether the Influx is eternal (قديم) or contingent (محدث), that which it brings (الذي ورد به) must necessarily be contingent. This is what remains with the recipient, while the Influx itself departs, and its departure is necessary. The reason for this is the preservation of respect (الحرمة) for it. For there must necessarily be another Influx that descends upon the recipient, and this person must accept the new one and turn away from whatever was present [from the previous one]. This would result in a failure to fulfill the respect due to the first Influx. For this reason, it departs after delivering what it brought. When the second Influx descends, it finds the recipient emptied for it and ready to receive it, and there is no thought (خاطر) that pulls him away due to attachment to the former.\n\nEvery Influx departs from him with its respect and dignity (حشمته), and thus praises him well before Allah. This praise becomes his felicity. The Influxes (الواردات), in reality, if they are contingent, are nothing but the very essence of the Breaths (عين الأنفاس). The matters and rulings (الأحكام) that they bring are what the People of the Way (أهل الطريق) recognize as the Influxes. For the Breaths are the carriers of the forms (صور) of these Influxes. The contingent Influxes are not the Breaths themselves, but rather the forms of the Breaths. Their forms differ according to the difference in the rulings of the Divine Names within them. The Influx is to them like the spatial determination (التحيز) of the accident (العرض) by virtue of its necessary dependence on the substance (الجوهر) in which it resides. The substance is what is spatially determined, not the accident. Likewise, the Breath (النفس) is the Influx, not the form.\n\nThe benefit contained within the form is like the message contained within the messenger. [The Influx] may be one of knowledge (علم), or one of action (عمل), or one that combines both. It may be one of state (حال), or one of knowledge and state, or one of action and state, or one of knowledge, action, and state—such as the Influx of sobriety (صحو) and intoxication (سكر) and their likes, which is the strongest of the Influxes.\n\nIf the Influx is non-contingent (غير محدث), it is that which is expressed as the removal of intermediaries (الوسائط) between Allah and His servant. It is a Theophany (تجلي) from the specific Face (الوجه الخاص) that belongs to every creature. What it grants or what is attained therein cannot be described. Few among the People of Allah experience this, and there is nothing like it among the Influxes. And Allah says the Truth, and He guides the Way. (<<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>>)",
    "ur": "باب نمبر دو سو پینسٹھ: الوارد (الوارِد) کی معرفت میں\n\nمیں نے الصادر (الصادِر) اور الوارد (الوارِد) سے عشق کیا،\nجیسے جفت کا عشق طاق (الواحد) سے ہوتا ہے۔\nاور اس کے تمام اسماء تیزی سے وارد ہوتے ہیں،\nتاکہ وہ دیکھنے والے (راصد) سے پوشیدہ رہیں۔\nاور وہ اپنے آثار کے ذریعے ہر اس قلب کو ہمت عطا کرتے ہیں،\nجو ان کا قصد کرنے والا ہو۔\n\n[ہر وہ اسم الٰہی جو قلب پر وارد ہو، وہی الوارد (الوارِد) ہے]\n\nصوفیاء کے نزدیک اور ہمارے نزدیک الوارد (الوارِد) وہ ہے جو ہر اسم الٰہی کی طرف سے قلب پر وارد ہو۔ لہٰذا اس پر کلام اس حیثیت سے ہوگا کہ وہ وارد ہے، نہ کہ اس حیثیت سے کہ وہ کس حالت میں وارد ہوا۔ یہ صحو (صَحْو) (ہوشمندی) کے ساتھ، سکر (سُکْر) (مستی) کے ساتھ، قبض (قَبْض) (تنگی) کے ساتھ، بسط (بَسْط) (فراخی) کے ساتھ، ہیبت کے ساتھ، اُنس کے ساتھ، اور ان گنت امور کے ساتھ وارد ہو سکتا ہے۔ یہ سب واردات ہیں۔ تاہم، صوفیاء نے اصطلاحاً الوارد (الوارِد) صرف ان محمود (قابل تعریف) خواطر کو نام دیا ہے جن کا ہم نے ذکر کیا۔\n\n[یہ کہ الوارد (الوارِد) اپنی حیثیت کے اعتبار سے حدوث (حُدُوث) یا قدم (قِدَم) سے مقید نہیں ہوتا]\n\nپس اے میرے بھائی! جان لو کہ الوارد (الوارِد) اپنی حیثیت کے اعتبار سے حدوث (حُدُوث) یا قدم (قِدَم) سے مقید نہیں ہوتا، کیونکہ اللہ تعالیٰ نے اپنی ازلیت (قدم) کے باوجود اپنے آپ کو اتیان (آنا) سے متصف کیا ہے، اور ورود (وارد ہونا) بھی اتیان ہی ہے۔ وارد کی اتیان کی حالتیں مختلف ہو سکتی ہیں۔ کبھی وہ اچانک حملہ یا بوادہ (ناگہانی آمد) کی طرح وارد ہوتا ہے، اور کبھی وہ اچانک وارد نہیں ہوتا بلکہ اس شخص کو جس پر وہ وارد ہو رہا ہے، علامات اور قرائنِ احوال کے ذریعے اس کا شعور ہو جاتا ہے جو کسی مخصوص امر کے ورود پر دلالت کرتے ہیں جسے محل (قلب) کی استعداد طلب کرتی ہے۔ ہر اسم الٰہی کا وارد کسی نہ کسی فائدے کے بغیر نہیں آتا، اور کوئی بھی الٰہی وارد، خواہ وہ کونی (کائنات سے متعلق) ہو یا غیر کونی، فائدے سے خالی نہیں ہوتا۔ وہ فائدہ جو ہر وارد میں مشترک ہے، وہ علم ہے جو اس ورود کے ذریعے وارد ہونے والے شخص کو حاصل ہوتا ہے۔ اس میں یہ شرط نہیں ہے کہ وہ اسے خوش کرے یا غمگین کرے، کیونکہ یہ وارد کا حکم نہیں ہے۔ وارد کا حکم صرف وہ علم ہے جو حاصل ہوا، اور اس کے علاوہ جو کچھ ہے وہ اس چیز کی وجہ سے ہے جسے لے کر وہ وارد ہوا، نہ کہ وارد کی اپنی ذات کی وجہ سے۔\n\nپس اللہ تعالیٰ قیامت کے دن لوگوں کے درمیان فیصلہ اور قضا کے لیے تشریف لائے گا۔ کچھ لوگ ایسے ہوں گے جن کے حق میں وہ فیصلہ ہوگا جس میں ان کی سعادت ہے، اور کچھ لوگ ایسے ہوں گے جن کے حق میں وہ فیصلہ ہوگا جس میں ان کی شقاوت (بدبختی) ہے۔ اتیان (آنا) ایک ہے اور قضا (فیصلہ) ایک ہے، لیکن جس کا فیصلہ کیا گیا وہ مختلف ہے۔ الوارد (الوارِد) اس سے خالی نہیں ہوتا کہ وہ اپنے ورود کی حالت میں صدور (صُدُور) (صادر ہونے) سے متصف ہو۔ پس وہ اس شخص کی طرف سے وارد ہوتا ہے جس پر وہ وارد ہوا، اور اس ذات کی طرف سے صادر ہوتا ہے جس سے وہ صادر ہوا۔ لہٰذا ضروری ہے کہ یہ وارد اللہ کی طرف سے محدث (عارضی طور پر پیدا شدہ) ہو۔ اور اگر وہ اپنے ورود کی حالت میں صدور سے متصف نہ ہو، تو وہ وارد قدیم (ازلی) ہے۔ اور ورود ایک نسبت ہے جو اس بندے کے ہاں پیدا ہوتی ہے جس پر وہ وارد ہوتا ہے۔ پس ایک (وارد) صادر (صادِر) بھی ہے اور وارد (وارِد) بھی، اور دوسرا صرف وارد ہے۔ اور اسماء الٰہیہ کے علاوہ کوئی قدیم چیز وارد نہیں ہوتی۔ اگر وہ عین (ذات) کی حیثیت سے وارد ہوں تو ورود میں مختلف نہیں ہوتیں، اور اگر وہ حکم کی حیثیت سے وارد ہوں تو احکام کے اختلاف کی وجہ سے مختلف ہو جاتی ہیں، کیونکہ ان کی حقائق مختلف ہیں، سوائے اس کے کہ جب وہ عین (ذات) پر دلالت کر رہی ہوں، تو وہ مختلف نہیں ہوتیں۔ خواہ الوارد (الوارِد) قدیم ہو یا محدث (عارضی)، وہ چیز جسے لے کر وہ وارد ہوا ہے، وہ لازماً محدث ہوتی ہے، اور وہی وارد ہونے والے شخص کے پاس باقی رہتی ہے، جبکہ وارد خود لوٹ جاتا ہے، اور اس کا لوٹ جانا ضروری ہے۔ اس کی وجہ یہ ہے کہ اس پر حرمت (احترام) باقی رہے۔ کیونکہ لازماً کوئی دوسرا وارد اس پر وارد ہوگا، اور اس شخص کے لیے ضروری ہے کہ وہ اسے قبول کرے اور جو وہاں موجود ہو اس سے اعراض کرے۔ اس طرح پہلے وارد کے احترام میں کمی واقع ہوتی ہے۔ اسی لیے وہ اس چیز کو ادا کرنے کے بعد کوچ کر جاتا ہے جسے لے کر وہ وارد ہوا تھا۔\n\nپس جب دوسرا الوارد (الوارِد) وارد ہوتا ہے تو وہ اسے اپنے لیے خالی پاتا ہے اور اس کا استقبال کرتا ہے، اور وہاں کوئی ایسا خیال نہیں ہوتا جو اس سے وابستگی کی وجہ سے اسے کھینچ لے۔ پس ہر وارد اپنی حرمت اور حشمت کے ساتھ اس سے صادر ہوتا ہے، اور اللہ کے ہاں اس کی تعریف کرتا ہے، اور یہی تعریف اس کی سعادت بن جاتی ہے۔ حقیقت میں، اگر واردات محدث (عارضی) ہوں، تو وہ عین انفاس (سانسوں) کے سوا کچھ نہیں ہیں، اور وہ امور اور احکام جنہیں لے کر وہ وارد ہوتی ہیں، انہیں ہی اہل طریق واردات کے نام سے جانتے ہیں۔ کیونکہ انفاس ہی ان واردات کی صورتوں کو اٹھانے والی ہیں۔ پس محدث واردات اپنی ذات میں واردات نہیں ہیں، بلکہ وہ انفاس کی صورتیں ہیں، اور ان کی صورتیں ان میں اسماء الٰہیہ کے احکام کے اختلاف کی وجہ سے مختلف ہوتی ہیں۔ پس وارد کا ان کے لیے ہونا ایسا ہی ہے جیسے جوہر (ذات) میں تبعیت کے حکم سے عرض (صفت) کا تحیز (جگہ گھیرنا)۔ پس جوہر ہی تحیز اختیار کرتا ہے، نہ کہ عرض۔ اسی طرح نفس ہی وارد ہے، نہ کہ صورت۔\n\nاور صورت میں فائدہ ایسا ہی ہے جیسے رسول میں رسالت۔ پس ایک وارد علم کے ساتھ ہوتا ہے، ایک عمل کے ساتھ، ایک ان دونوں کو جمع کرنے والا ہوتا ہے، ایک حال کے ساتھ، ایک علم اور حال کے ساتھ، ایک عمل اور حال کے ساتھ، اور ایک علم، عمل اور حال کے ساتھ ہوتا ہے۔ اور یہ صحو (صَحْو) اور سکر (سُکْر) کے وارد کی طرح ہے، اور یہ سب سے قوی واردات ہیں۔ اور جب الوارد (الوارِد) غیر محدث (ازلی) ہو، تو اسے اللہ اور اس کے بندے کے درمیان واسطوں کے اٹھ جانے سے تعبیر کیا جاتا ہے۔ یہ ہر مخلوق کے لیے مخصوص وجہ (خاص رُخ) سے ایک التجلی (ظہور الٰہی) ہے۔ اس میں جو کچھ عطا ہوتا ہے اور جو کچھ حاصل ہوتا ہے، اسے بیان نہیں کیا جا سکتا۔ اور اہل اللہ میں سے بہت کم لوگ ہیں جنہیں یہ حاصل ہوتا ہے، اور واردات میں اس کی کوئی مثال نہیں ہے۔ اور اللہ ذات حق (الحق) فرماتا ہے اور وہی سیدھے راستے کی ہدایت دیتا ہے۔ (وَهُوَ يَهْدِي السَّبِيلَ) [الاحزاب: 4]",
    "fa": "باب دویست و شصت و پنجم در معرفت وارد (Al-Wārid)\n\nبه صادر (Al-Ṣādir) و وارد (Al-Wārid) عشق ورزیدم،\nعشق جفت من به واحد (Al-Wāḥid).\n\nو همه نام‌های او وارد (Wārid) شدند،\nشتابان تا بر رصدکننده پنهان بمانند.\n\nو با آثار خود، همتی می‌بخشند،\nبه هر قلبی که قصد او را دارد.\n\n[هر نام الهی که بر قلب وارد شود، همان وارد (Al-Wārid) است]\n\nوارد (Al-Wārid) نزد این طایفه (صوفیان) و نزد ما، آن چیزی است که از هر اسم الهی (Ism Ilāhī) بر قلب وارد می‌شود. پس سخن درباره آن به اعتبار وارد بودن آن است، نه به اعتبار آنچه وارد شده است. چه بسا با صحو (Ṣaḥw) و سُکر (Sukr)، با قبض (Qabḍ) و بسط (Basṭ)، با هیبت و با اُنس، و با اموری بی‌شمار وارد شود؛ و همه اینها واردات (Wāridāt) هستند. با این حال، این طایفه اصطلاح کرده‌اند که وارد (Al-Wārid) را همان خواطر ستوده‌ای بنامند که ذکر کردیم.\n\n[وارد (Al-Wārid) به اعتبار وارد بودن، مقید به حدوث و قدم نیست]\n\nپس ای برادر من، بدان که وارد (Al-Wārid) به اعتبار وارد بودن، مقید به حدوث (حادث بودن) و قدم (قدیم بودن) نیست. زیرا خداوند با وجود قدمت خود، خویشتن را به اتیان (آمدن) وصف کرده است، و ورود همان اتیان است. احوال وارد (Al-Wārid) در اتیان ممکن است متفاوت باشد؛ گاهی ناگهانی وارد می‌شود، مانند هجوم و حمله، و گاهی غیر ناگهانی، با آگاهی کسی که وارد بر او می‌شود، از طریق نشانه‌ها و قرائن احوالی که دلالت بر ورود امری معین دارند که استعداد محل آن را می‌طلبد. و هر وارد الهی جز با فایده نمی‌آید، و هیچ وارد الهی نیست، چه کونی باشد و چه غیر کونی، مگر اینکه فایده‌ای داشته باشد. و فایده‌ای که شامل هر وارد می‌شود، همان علمی است که در اثر آن ورود برای کسی که وارد بر او شده حاصل می‌گردد. و شرط نیست که آن وارد، او را شاد کند یا غمگین سازد، زیرا این حکم وارد (Al-Wārid) نیست. بلکه حکم وارد، همان علمی است که حاصل شده است، و آنچه فراتر از آن است، از جهت چیزی است که وارد با آن آمده، نه از جهت خود وارد.\n\nپس خداوند در روز قیامت برای فصل و قضاوت میان مردم می‌آید. برای برخی از مردم به آنچه سعادتشان در آن است حکم می‌کند و برای برخی دیگر به آنچه شقاوتشان در آن است. اتیان (آمدن) یکی است و قضاوت یکی است، اما آنچه به آن حکم شده متفاوت است.\n\nوارد (Al-Wārid) خالی از این نیست که در حال ورودش متصف به صدور (Al-Ṣudūr) باشد؛ در این صورت، از جهت کسی که بر او وارد شده، وارد است، و از جهت کسی که از او صادر شده، صادر (Al-Ṣādir) است. پس ناگزیر این وارد باید از جانب خداوند حادث (مُحدَث) باشد. و اگر در حال ورودش متصف به صدور نباشد، آن وارد، قدیم است. و ورود (Al-Wurūd) نسبتی است که برای آن نزد بنده‌ای که وارد بر او شده، حادث می‌گردد. پس یکی صادر (Ṣādir) و وارد (Wārid) است، و دیگری فقط وارد است. و هیچ قدیم دیگری جز اسماء الهی (Al-Asmā’ al-Ilāhiyya) وارد نمی‌شود. اگر این اسماء از حیث عین (ذات) وارد شوند، در ورود تفاوتی ندارند، اما اگر از حیث حکم وارد شوند، به دلیل اختلاف احکام، متفاوت خواهند بود، زیرا حقایق آنها متفاوت است، مگر در دلالتشان بر عین (ذات) که در آن صورت تفاوتی ندارند.\n\nو چه وارد (Al-Wārid) قدیم باشد و چه حادث، آنچه وارد با آن آمده است، ناگزیر باید حادث باشد، و این همان چیزی است که نزد کسی که وارد بر او شده باقی می‌ماند، در حالی که وارد (خودش) منصرف می‌شود و ناگزیر باید منصرف گردد. و علت این امر، باقی ماندن حرمت بر اوست. زیرا ناگزیر وارد دیگری بر او وارد خواهد شد، و این شخص باید او را بپذیرد و از هر کس دیگری که در آنجا باشد روی برگرداند. در نتیجه، عدم وفای به احترام وارد اول پیش می‌آید. به همین دلیل، وارد اول پس از انجام آنچه با آن آمده، کوچ می‌کند. پس هنگامی که وارد دوم می‌آید، آن محل را برای خود خالی می‌یابد و مورد استقبال قرار می‌گیرد، و هیچ خاطری نیست که به دلیل تعلق به وارد قبلی، او را از وارد جدید باز دارد. پس هر وارد (Wārid) با حرمت و حشمت خود از آنجا صادر می‌شود و نزد خداوند از آن شخص به نیکی یاد می‌کند، و این ثنا، سعادت آن شخص خواهد بود.\n\nو واردات (Al-Wāridāt) در حقیقت، اگر حادث باشند، چیزی جز عین انفاس (Anfās - دم‌ها و بازدم‌ها) نیستند. و اموری و احکامی که وارد با آنها می‌آید، همان‌هایی هستند که اهل طریقت آنها را واردات می‌نامند. زیرا انفاس حامل صور این واردات هستند. پس واردات حادث، خودشان نیستند، بلکه صور انفاس هستند. و صور آنها به دلیل اختلاف احکام اسماء الهی (Al-Asmā’ al-Ilāhiyya) در آنها، متفاوت می‌شود. پس وارد (Al-Wārid) برای آن (صورت)، مانند تحیّز (مکان گرفتن) عرض است به حکم تبعیت از جوهر در آن. پس جوهر است که مکان می‌گیرد نه عرض. به همین ترتیب، نفس (Nafs) همان وارد است نه صورت.\n\nو فایده در صورت، مانند رسالت در رسول است. پس واردی است به علم، و واردی به عمل، و واردی که جامع هر دو است. و واردی به حال، و واردی به علم و حال، و واردی به عمل و حال، و واردی به علم و عمل و حال. و این مانند وارد صحو (Ṣaḥw) و سُکر (Sukr) و امثال آن است، که قوی‌ترین واردات است. و اگر وارد (Al-Wārid) غیر حادث باشد، همان است که از آن به برداشته شدن واسطه‌ها میان خداوند و بنده‌اش تعبیر می‌شود. این تجلی (Al-Tajallī) از وجه خاصی است که برای هر مخلوقی وجود دارد. آنچه را که این وارد می‌بخشد و آنچه در آن برای شخص حاصل می‌شود، قابل بیان نیست. و اندکی از اهل الله هستند که این وارد برایشان حاصل می‌شود، و در میان واردات، نظیری برای آن نیست.\n\nو خداوند حق (Al-Ḥaqq) را می‌گوید و اوست که راه را هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 2
}