{
  "id": 537,
  "title": {
    "ar": "الباب السابع والثلاثون وخمسمائة في معرفة حال قطب كان هجيره وتَخْشَى النَّاسَ والله أَحَقُّ أَنْ تَخْشاهُ وهذه آية عجيبة",
    "en": "Chapter Five Hundred and Thirty-Seven: Concerning the knowledge of the state of a Pole (قطب) whose constant preoccupation was [the verse]: <<and you feared the people, while Allah is more deserving that you should fear Him>>, and this is a wondrous verse.",
    "ur": "باب پانچ سو سینتیس (۵۳۷): ایک قطب (قطب) کے حال کی معرفت کے بیان میں جس کا روزمرہ کا ورد یہ تھا: \"اور آپ لوگوں سے ڈرتے تھے، حالانکہ اللہ زیادہ حقدار ہے کہ آپ اس سے ڈریں۔\" (وَتَخْشَى النَّاسَ وَاللَّهُ أَحَقُّ أَن تَخْشَاهُ) اور یہ ایک عجیب آیت ہے۔",
    "fa": "باب پانصد و سی و هفتم در معرفت حال قطبی که ورد زبانش این بود: «و از مردم می‌ترسیدی، در حالی که خداوند سزاوارتر است که از او بترسی» (وَتَخْشَى النَّاسَ وَاللَّهُ أَحَقُّ أَنْ تَخْشَاهُ) و این آیتی شگفت‌انگیز است."
  },
  "content": {
    "ar": "## (الباب السابع والثلاثون وخمسمائة في معرفة حال قطب كان هجيره وتَخْشَى النَّاسَ والله أَحَقُّ أَنْ تَخْشاهُ وهذه آية عجيبة)\n\n\n> رأيت في واقعتي إنني *** أدار أهل الأرض بالأرض‏\n\n\n> لأنهم ليست لهم همة *** ترفعهم عن عالم الخفض‏\n\n\n> فهم حيارى ما لهم فاصل *** يفصل بين الأمر والعرض‏\n\n\n> لم يخش خلق الله إلا الذي *** يقام في السنة والفرض‏\n\n\nقال الله تبارك وتعالى لِكَيْ لا يَكُونَ عَلَى الْمُؤْمِنِينَ حَرَجٌ في أَزْواجِ أَدْعِيائِهِمْ‏\n\n\n### [نسبة المؤمن الكامل والرسول صَلَّى اللهُ عَليهِ وسَلَّم إلى الخلق‏]\n\n\nاعلم أن الرجل الكامل واقف مع ما تمسك عليه المروءة العرفية حتى يأتي أمر الله الحتم فإنه بحسب ما يؤمر فإن كان عرضا نظر إلى قرائن الأحوال فإن كانت قرينة الحال تعطيه حكم الأمر الحتم بادر إلى القبول مبادرته إلى الأمر الحتم الذي لا يسعه خلافه وإن‏\nكانت قرينة الحال تحيره بقي على الأمر العرفي الذي يشهد له بمكارم الأخلاق ولذلك قال ما كانَ مُحَمَّدٌ أَبا أَحَدٍ من رِجالِكُمْ ولكِنْ رَسُولَ الله وخاتَمَ النَّبِيِّينَ فهو واقف مع حكم الله وهكذا المؤمن الكامل الايمان ما هو مع الناس وإنما هو مع ما يحكم الله به عليه على لسان رسوله صَلَّى اللهُ عَليهِ وسَلَّم الذي بالإيمان به صَلَّى اللهُ عَليهِ وسَلَّم ثبت الايمان له فإن النبي صَلَّى اللهُ عَليهِ وسَلَّم يقول في حق من يؤمن بالله ويؤمن بي وبما جئت به وما بعثه الله تعالى إلا ليتمم مكارم الأخلاق فأحواله كلها مكارم أخلاق فهو مبين لها بالحال وهو أتم وأعدل وأمضى في الحكم من القول فإن الحق‏\n\n\n> له نزول إلى عباده *** وما لنا نحوه عروج‏\n\n\n> فإنه لم يزل عليا *** يجهله العالم المريج‏\n\n\n> من ليس في حيز تراه *** فلا ولوج ولا خروج‏\n\n\n> ونحن في حيز ووقت *** يصح فيه لنا الولوج‏\n\n\n> لاح بأرض الجسوم عنه *** من كل شي‏ء زوج بهيج‏\n\n\nفنسبة المؤمن الكامل والرسول إلى الخلق نسبة ليلة القدر إلى الليالي وما أراد بألف شهر توقيتا بل أراد أنها خير على الإطلاق من جميع ليالي الزمان في أي وجود كان‏\n\n\n> إذا بدا فيك كل أمر *** فأنت خَيْرٌ من أَلْفِ شَهْرٍ\n\n\n> في ليلة ما لها صباح *** يذهبها منك نور فجر\n\n\n> ما الروح في كونها سوائي *** يا ليلة القدر فيك قدري‏\n\n\n> في ليلة القدر من وجودي *** ينزل الحق كل أمر\n\n\nفكان مما نزل وتَخْشَى النَّاسَ والله أَحَقُّ أَنْ تَخْشاهُ وما جعله في ذلك إلا\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم لو كنت أنا بدل يوسف لأجبت الداعي‏\n\n\nيعني داعي الملك لما دعاه إلى الخروج من السجن فلم يخرج يوسف حتى قال ارْجِعْ إِلى‏ رَبِّكَ يعني العزيز الذي حبسه فَسْئَلْهُ ما بالُ النِّسْوَةِ ليثبت عنده براءته فلا تصح له المنة عليه في إخراجه من السجن بَلِ الله يَمُنُّ عَلَيْكُمْ إذ لو بقي الاحتمال لقدح في عدالته وهو رسول من الله فلا بد من عدالته أن تثبت في قلوبهم فلذلك كانت الخشية حتى لا ترد دعوة الحق فابتلى الله نبيه صَلَّى اللهُ عَليهِ وسَلَّم بنكاح زوجة من تبناه وكان لو فعله عند العرب مما يقدح في مقامه وهو رسول الله فأبان الله لهم عن العلة في ذلك وهو رفع الحرج عن المؤمنين في مثل هذا الفعل ثم فصل بينه وبينهم بالرسالة والختم فكان من الله في حق رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ما كان من يوسف حين لم يجب الداعي فهذا من هدى الأنبياء الذي قال فيه لرسوله صَلَّى اللهُ عَليهِ وسَلَّم حين ذكر الأنبياء عليه السلام أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ فلو كان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الحال الذي كان فيه يوسف عليه السلام ما أجاب الداعي ولقال مثل ما قال يوسف فما\n\n\nقال لو كنت أنا لأجبت الداعي‏\n\n\nإلا تعظيما في حق يوسف كما قال نحن أولى بالشك من إبراهيم ولم يكن في شك لا هو ولا إبراهيم من الشك الذي يزعمونه الذي نفاه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فإنه لو شك إبراهيم لكان محمد أولى بالشك منه فإنه مأموران يهتدي بهداهم فالرسل والمؤمنون الكمل ما هم واقفون مع ما يعطيهم نظرهم وإنما يقفون مع ما يأتيهم من ربهم والذي يأتيهم من الله قد يكون كما قلنا أمرا وعرضا فالأمر معمول به ولا بد وفي العرض التخيير كما قررنا وأما حالهم في معرفتهم بالله فكما قلنا في قصيدة لنا\n\n\n> معارف الحق لا تخفى على أحد *** إلا على أحد لا يعرف الأحدا\n\n\n(و كما قلنا)\n\n\n> إذا كان مشهودي هو الكيف والكم *** فما ذاك إلا الوهم ما ذلك العلم‏\n\n\n> بما هو عين الأمر في عين ذاته *** وهل يتجلى الحق فيما له كم‏\n\n\n> فما هو حق في الحقيقة واضح *** ولكنه حق عليه بنا ختم‏\n> تنزهت بي عن لم وكيف وكم وما *** وهل عين لفظ قد يكون له الحكم‏\n\n\n> وهل ثم موجود يصح فإن تزد *** فما زدت إلا ما يكونه الوهم‏\n\n\n> بذاك أتى القرآن إن كنت ناظرا *** كما قد أتى للمؤمنين به الفهم‏\n\n\nفهذا ذكر حكيم يعطي من عوارف المعارف والآداب ما لا يسعه كتاب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## (Chapter 537: Concerning the Gnosis of the State of a Pole whose Constant Companion was: And you feared the people, while Allah is more deserving that you should fear Him, and this is a wondrous verse)\n\nI saw in my spiritual vision (واقعتي) that I govern the people of the earth by means of the earth,\nBecause they lack the aspiration (همة) that would raise them above the world of lowliness (عالم الخفض).\nThey are bewildered, having no separator to distinguish between the definitive command (الأمر) and the contingent matter (العرض).\nThe creation of God fears only that which is established in the Sunnah and the obligatory duty (Fard).\n\nAllah, the Blessed and Exalted, said: <<لِكَيْ لا يَكُونَ عَلَى الْمُؤْمِنِينَ حَرَجٌ في أَزْواجِ أَدْعِيائِهِمْ>> (So that there may be no difficulty for the believers concerning the wives of their adopted sons).\n\n### The relationship of the Perfect Believer and the Messenger (peace and blessings of Allah be upon him) to Creation\n\nKnow that the Perfect Man (الرجل الكامل) adheres to the customary virtue (المروءة العرفية) until the definitive command (أمر الله الحتم) of Allah arrives. For he acts according to what he is commanded. If the matter is contingent (عرض), he looks at the contextual signs of the situation. If the contextual sign grants it the ruling of the definitive command (الأمر الحتم), he hastens to accept it just as he hastens to the definitive command which he cannot oppose. But if the contextual sign confuses him, he remains upon the customary practice (الأمر العرفي) which testifies to his noble character traits (مكارم الأخلاق).\n\nThat is why He said: <<مَا كَانَ مُحَمَّدٌ أَبَا أَحَدٍ مِنْ رِجَالِكُمْ وَلَكِنْ رَسُولَ اللَّهِ وَخَاتَمَ النَّبِيِّينَ>> (Muhammad is not the father of any of your men, but he is the Messenger of Allah and the Seal of the Prophets).\n\nThus, he adheres to the ruling of Allah. Likewise, the believer whose faith is perfect is not with the people; rather, he is with what Allah decrees upon him through the tongue of His Messenger (peace and blessings of Allah be upon him), by believing in whom (peace and blessings of Allah be upon him) his faith is established. For the Prophet (peace and blessings of Allah be upon him) speaks concerning the one who believes in Allah and believes in me and in what I have brought, and Allah the Exalted only sent him to perfect noble character traits (مكارم الأخلاق). Thus, all his states are noble character traits. He is the one who clarifies them through his spiritual state (الحال), which is more complete, more just, and more decisive in judgment than mere speech. For The Real (الحق):\n\nHe has a descent toward His servants,\nAnd we have no ascent toward Him.\nFor He has ever been Exalted,\nUnknown to the confused world (العالم المريج).\nHe who is not within a domain (حيز), you cannot see Him;\nThere is neither entering nor exiting.\nWhile we are in a domain and a time\nWhere entering is valid for us.\nFrom Him, a delightful pair (زوج بهيج) appeared\nIn the land of bodies from everything.\n\nThe relationship of the Perfect Believer (المؤمن الكامل) and the Messenger to creation (الخلق) is like the relationship of the Night of Power (Laylat al-Qadr) to all other nights. And by \"a thousand months,\" He did not intend a specific time limit, but rather that it is absolutely better than all the nights of time, in whatever existence (وجود) they may be.\n\nIf every matter appears within you,\nThen you are <<خَيْرٌ مِنْ أَلْفِ شَهْرٍ>> (better than a thousand months).\nIn a night that has no morning,\nWhose light of dawn departs from you.\nThe Spirit (الروح) in its being is none other than me.\nO Night of Power, within you is my destiny (qadr)!\nIn the Night of Power of my Being (وجودي),\nThe Real (الحق) descends every command.\n\nAnd among what descended was: <<وَتَخْشَى النَّاسَ وَاللهُ أَحَقُّ أَنْ تَخْشَاهُ>> (And you feared the people, while Allah is more deserving that you should fear Him). What caused this descent was nothing other than his (peace and blessings of Allah be upon him) saying: \"Had I been in the place of Joseph, I would have answered the caller.\"\n\nMeaning the caller of the King when he invited him to leave the prison. But Joseph did not leave until he said: <<ارْجِعْ إِلَى رَبِّكَ>> (Return to your lord)—meaning the Aziz (governor) who imprisoned him—<<فَاسْأَلْهُ مَا بَالُ النِّسْوَةِ>> (and ask him what was the case of the women), so that his innocence might be established before him. Thus, the Aziz could not claim favor (المنة) over him for his release from prison. Rather, <<بَلِ اللَّهُ يَمُنُّ عَلَيْكُمْ>> (But Allah confers favor upon you). For if the possibility [of guilt] remained, it would impugn his integrity (عدالته), and he is a Messenger from Allah. Therefore, his integrity must be established in their hearts.\n\nFor this reason, the fear (الخشية) existed, so that the call of The Real (دعوة الحق) would not be rejected. Thus, Allah tested His Prophet (peace and blessings of Allah be upon him) by marrying the wife of his adopted son, an act which, had he done it according to the Arabs, would have impugned his status, even though he was the Messenger of Allah. So Allah clarified the reason for this to them, which was the removal of difficulty (الحرج) from the believers regarding such an action. Then He separated him from them by the Messengership (الرسالة) and the Seal (الختم).\n\nThus, what occurred from Allah concerning the Messenger of Allah (peace and blessings of Allah be upon him) was similar to what occurred with Joseph when he did not answer the caller. This is part of the guidance of the Prophets, concerning which He said to His Messenger (peace and blessings of Allah be upon him) when mentioning the Prophets (upon them be peace): <<أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ>> (Those are the ones whom Allah has guided; so follow their guidance).\n\nTherefore, had the Messenger of Allah (peace and blessings of Allah be upon him) been in the situation that Joseph (upon him be peace) was in, he would not have answered the caller and would have said the same thing Joseph said. He only said, \"Had I been in the place of Joseph, I would have answered the caller,\" out of reverence for Joseph. Just as he said, \"We are more deserving of doubt than Abraham,\" yet neither he nor Abraham was in the kind of doubt that people claim, which the Messenger of Allah (peace and blessings of Allah be upon him) negated. For if Abraham had doubted, Muhammad would have been more deserving of doubt than him, since he was commanded to follow their guidance.\n\nThus, the Messengers and the Perfect Believers (المؤمنون الكمل) do not adhere to what their own consideration dictates; rather, they adhere to what comes to them from their Lord. And what comes to them from Allah may be, as we said, a definitive command (أمر) or a contingent matter (عرض). The definitive command must necessarily be acted upon, while in the contingent matter there is choice, as we have established.\n\nAs for their state concerning their Gnosis (معرفة) of Allah, it is as we said in one of our poems:\n\nThe gnoses (معارف) of The Real (الحق) are not hidden from anyone,\nExcept from one who does not know the One (الأحد).\n\n(And as we said):\nIf what I witness (مشهودي) is quality (الكيف) and quantity (الكم),\nThen that is nothing but illusion (الوهم); that is not Knowledge (العلم).\n[Knowledge is] by that which is the very essence of the matter in the very Essence (الذات) of Him.\nDoes The Real (الحق) manifest in that which has quantity (كم)?\nSo He is not The Real (حق) clearly manifest in reality (الحقيقة),\nBut He is The Real upon whom the seal is placed by us.\nI have transcended through Him beyond 'Why,' 'How,' 'How much,' 'What,' and 'Whether.'\nCan the essence of a word possess the ruling?\nIs there then an existent (موجود) that is sound? If you add [to this],\nYou have only added what illusion (الوهم) constitutes.\nThe Quran came with this, if you are one who observes,\nJust as the understanding (الفهم) came to the believers through it.\n\nThis is a wise remembrance that imparts such gifts of gnoses (معارف) and spiritual manners (آداب) as no book can contain. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر ۵۳۷: اس قطب کے حال کی معرفت میں جس کا ورد یہ تھا: \"اور تم لوگوں سے ڈرتے ہو، حالانکہ اللہ زیادہ حقدار ہے کہ تم اس سے ڈرو۔\" اور یہ ایک عجیب آیت ہے۔\n\nمیں نے اپنے کشف (الکشف) میں دیکھا کہ میں\nاہل زمین کو زمین کے ذریعے چلاتا ہوں\nکیونکہ ان میں وہ ہمت نہیں ہے\nجو انہیں پستی کے عالم سے بلند کر سکے\nوہ حیران ہیں، ان کے پاس کوئی فرق کرنے والا نہیں\nجو لازمی امر (الأمر) اور عارضی معاملے (العرض) میں فرق کر سکے\nاللہ کی مخلوق میں سے کوئی نہیں ڈرتا مگر وہ\nجو سنت اور فرض میں قائم ہوتا ہے۔\n\nاللہ تبارک و تعالیٰ نے فرمایا: \"تاکہ مومنوں پر ان کے منہ بولے بیٹوں کی بیویوں کے معاملے میں کوئی تنگی نہ رہے۔\"\n\n### [انسان کامل (الإنسان الکامل) اور رسول صلی اللہ علیہ وسلم کی مخلوق سے نسبت]\n\nجان لو کہ انسان کامل (الإنسان الکامل) عرفی مروت (المروءة العرفية) کے تقاضوں پر قائم رہتا ہے جب تک کہ اللہ کا حکم قطعی (الأمر الحتم) نہ آ جائے۔ وہ اسی کے مطابق عمل کرتا ہے جس کا اسے حکم دیا جاتا ہے۔ اگر کوئی معاملہ عارضی (العرض) ہو تو وہ حالات کے قرائن پر غور کرتا ہے۔ اگر حالات کا قرینہ اسے حکم قطعی (الأمر الحتم) کا درجہ دے دے تو وہ اسے قبول کرنے میں اسی طرح جلدی کرتا ہے جیسے وہ حکم قطعی (الأمر الحتم) کو قبول کرنے میں کرتا ہے جس کی مخالفت کی اسے گنجائش نہیں ہوتی۔ اور اگر حالات کا قرینہ اسے حیران کر دے تو وہ عرفی معاملے پر قائم رہتا ہے جو اس کے لیے اخلاق حسنہ کی گواہی دیتا ہے۔ اسی لیے اللہ نے فرمایا: \"محمد تمہارے مردوں میں سے کسی کے باپ نہیں ہیں، لیکن وہ اللہ کے رسول اور آخری نبی ہیں۔\" پس وہ اللہ کے حکم پر قائم ہیں۔ اسی طرح کامل ایمان والا مومن لوگوں کے ساتھ نہیں ہوتا، بلکہ وہ اس کے ساتھ ہوتا ہے جس کا حکم اللہ تعالیٰ اپنے رسول صلی اللہ علیہ وسلم کی زبان سے اس پر نافذ کرتا ہے، وہ رسول جن پر ایمان لانے سے اس کا ایمان ثابت ہوتا ہے۔ کیونکہ نبی صلی اللہ علیہ وسلم اس شخص کے حق میں فرماتے ہیں جو اللہ پر ایمان لاتا ہے اور مجھ پر اور اس چیز پر ایمان لاتا ہے جو میں لایا ہوں۔ اور اللہ تعالیٰ نے آپ کو صرف اس لیے مبعوث فرمایا تاکہ آپ اخلاق حسنہ کی تکمیل کریں۔ پس آپ کے تمام احوال اخلاق حسنہ ہیں، اور آپ حال کے ذریعے ان کی وضاحت کرنے والے ہیں، اور حال قول کے مقابلے میں حکم میں زیادہ مکمل، زیادہ عادل اور زیادہ نافذ ہوتا ہے۔ کیونکہ ذات حق (الحق)\n\nاس کا اپنے بندوں کی طرف نزول ہوتا ہے\nاور ہمارے لیے اس کی طرف کوئی عروج نہیں\nکیونکہ وہ ہمیشہ سے بلند ہے\nجسے یہ مضطرب عالم نہیں جانتا\nجو کسی دائرے میں نہیں ہے جسے تم دیکھو\nاس کے لیے نہ داخل ہونا ہے نہ باہر نکلنا\nاور ہم ایک دائرے اور وقت میں ہیں\nجس میں ہمارے لیے داخل ہونا درست ہے\nاجسام کی زمین میں اس کی طرف سے ظاہر ہوا\nہر شے کا ایک خوش کن جوڑا۔\n\nپس انسان کامل (الإنسان الکامل) اور رسول کی مخلوق سے نسبت وہی ہے جو شب قدر کی تمام راتوں سے ہے۔ اور ہزار مہینوں سے مراد وقت کی تعیین نہیں ہے، بلکہ مراد یہ ہے کہ وہ زمان و مکان کی تمام راتوں سے مطلقاً بہتر ہے، خواہ وہ کسی بھی ہستی (الوجود) میں ہو۔\n\nجب تجھ میں ہر امر ظاہر ہو جائے\nتو تو ہزار مہینوں سے بہتر ہے\nاس رات میں جس کی کوئی صبح نہیں\nجسے تجھ سے فجر کا نور زائل کر دے\nروح اپنی کائنات میں میرے سوا کیا ہے؟\nاے شب قدر! تجھ میں میری قدر ہے\nمیری ہستی (الوجود) کی شب قدر میں\nذات حق (الحق) ہر امر نازل کرتا ہے۔\n\nپس جو کچھ نازل ہوا ان میں یہ بھی تھا: \"اور تم لوگوں سے ڈرتے ہو، حالانکہ اللہ زیادہ حقدار ہے کہ تم اس سے ڈرو۔\" اور اس معاملے میں آپ صلی اللہ علیہ وسلم کو صرف آپ کا یہ قول ہی لے گیا: \"اگر میں یوسف کی جگہ ہوتا تو میں بلانے والے کی دعوت قبول کر لیتا۔\"\n\nیعنی بادشاہ کے بلانے والے کی دعوت، جب اس نے آپ کو جیل سے باہر آنے کے لیے بلایا۔ لیکن یوسف علیہ السلام باہر نہیں آئے یہاں تک کہ انہوں نے کہا: \"اپنے رب (یعنی اس عزیز جس نے انہیں قید کیا تھا) کے پاس واپس جاؤ اور اس سے پوچھو کہ ان عورتوں کا کیا معاملہ تھا؟\" تاکہ ان کے نزدیک آپ کی براءت ثابت ہو جائے اور عزیز کا آپ کو جیل سے نکالنے کا احسان آپ پر نہ رہے۔ بلکہ اللہ تم پر احسان کرتا ہے۔ کیونکہ اگر شک کا کوئی امکان باقی رہتا تو یہ آپ کی عدالت (عدل) پر قدح کرتا، حالانکہ آپ اللہ کے رسول ہیں۔ لہٰذا ضروری تھا کہ آپ کی عدالت ان کے دلوں میں ثابت ہو جائے۔ اسی لیے خشیت (ڈر) تھی تاکہ ذات حق (الحق) کی دعوت رد نہ ہو۔ پس اللہ نے اپنے نبی صلی اللہ علیہ وسلم کو اس شخص کی بیوی سے نکاح کرنے کی آزمائش میں ڈالا جسے آپ نے منہ بولا بیٹا بنایا تھا۔ اگر آپ صلی اللہ علیہ وسلم عربوں کے نزدیک ایسا کرتے تو یہ آپ کے مقام میں قدح کا سبب بنتا، حالانکہ آپ اللہ کے رسول ہیں۔ پس اللہ نے ان کے لیے اس کی علت واضح کر دی، اور وہ یہ تھی کہ مومنوں سے اس طرح کے فعل میں تنگی کو دور کر دیا جائے۔ پھر اللہ نے آپ صلی اللہ علیہ وسلم اور ان کے درمیان رسالت اور ختم نبوت کے ذریعے فرق کر دیا۔ پس اللہ کی طرف سے رسول اللہ صلی اللہ علیہ وسلم کے حق میں وہی ہوا جو یوسف علیہ السلام کی طرف سے ہوا جب انہوں نے بلانے والے کی دعوت قبول نہیں کی۔ یہ انبیاء کی ہدایت میں سے ہے، جس کے بارے میں اللہ نے اپنے رسول صلی اللہ علیہ وسلم سے فرمایا جب انبیاء علیہم السلام کا ذکر کیا: \"یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی، پس آپ ان کی ہدایت کی پیروی کریں۔\" لہٰذا اگر رسول اللہ صلی اللہ علیہ وسلم اس حال میں ہوتے جس میں یوسف علیہ السلام تھے، تو آپ بھی بلانے والے کی دعوت قبول نہ کرتے اور وہی کہتے جو یوسف نے کہا تھا۔ آپ نے یہ نہیں فرمایا: \"اگر میں ہوتا تو میں بلانے والے کی دعوت قبول کر لیتا،\" مگر یوسف علیہ السلام کے حق میں تعظیم کے طور پر، جیسا کہ آپ نے فرمایا: \"ہم ابراہیم سے زیادہ شک کے حقدار ہیں۔\" حالانکہ نہ آپ کو اور نہ ابراہیم علیہ السلام کو اس شک میں مبتلا کیا گیا تھا جس کا وہ گمان کرتے ہیں، جسے رسول اللہ صلی اللہ علیہ وسلم نے رد کر دیا۔ کیونکہ اگر ابراہیم شک کرتے تو محمد صلی اللہ علیہ وسلم ان سے زیادہ شک کے حقدار ہوتے، حالانکہ دونوں کو حکم دیا گیا ہے کہ وہ ان کی ہدایت کی پیروی کریں۔ پس رسول اور کامل مومن (المؤمنون الکمل) اپنے ذاتی نظر پر قائم نہیں رہتے، بلکہ وہ اس پر قائم رہتے ہیں جو ان کے رب کی طرف سے ان کے پاس آتا ہے۔ اور جو کچھ اللہ کی طرف سے ان کے پاس آتا ہے، وہ جیسا کہ ہم نے کہا، حکم (الأمر) اور عارضی معاملہ (العرض) ہو سکتا ہے۔ حکم پر عمل کرنا ضروری ہے، اور عارضی معاملے میں اختیار ہوتا ہے جیسا کہ ہم نے بیان کیا۔ اور جہاں تک اللہ کی معرفت (المعرفۃ) کے بارے میں ان کے حال کا تعلق ہے، تو وہ ایسا ہے جیسا کہ ہم نے اپنے ایک قصیدے میں کہا ہے:\n\nذات حق (الحق) کی معرفتیں کسی پر پوشیدہ نہیں رہتیں\nسوائے اس شخص کے جو احد (اللہ) کو نہیں جانتا۔\n\n(اور جیسا کہ ہم نے کہا)\n\nجب میرا شہود (الشہود) کیفیت (الکیف) اور کمیت (الکم) ہو\nتو وہ صرف وہم ہے، وہ معرفت (العلم) نہیں\nاس کے بارے میں جو اس کی عین ذات میں عین امر ہے\nاور کیا ذات حق (الحق) اس چیز میں ظہور (التجلی) کرتا ہے جس کی کوئی کمیت ہو؟\nپس وہ حقیقت میں واضح ذات حق (الحق) نہیں ہے\nلیکن وہ ذات حق (الحق) ہے جس پر ہم سے مہر لگائی گئی ہے\nمیں نے اپنے آپ کو کیوں، کیسے، کتنا، اور کیا سے پاک رکھا\nاور کیا لفظ کی عینیت کا کوئی حکم ہو سکتا ہے؟\nاور کیا وہاں کوئی ہستی (موجود) ہے جو صحیح ہو؟ اگر تم اضافہ کرو\nتو تم نے صرف اس چیز کا اضافہ کیا جو وہم بناتا ہے\nقرآن اسی کے ساتھ آیا ہے اگر تم غور کرنے والے ہو\nجیسا کہ مومنوں کے لیے اس کے ذریعے فہم آیا ہے۔\n\nپس یہ ایک حکیمانہ ذکر ہے جو معرفتوں اور آداب کے ایسے خزانے عطا کرتا ہے جسے کوئی کتاب اپنے اندر نہیں سما سکتی۔ اور اللہ حق فرماتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے۔",
    "fa": "باب پانصد و سی و هفتم در شناخت حال قطبی که ورد (هجیره) او این بود: «و از مردم می‌ترسیدی، در حالی که خداوند سزاوارتر است که از او بترسی» (تَخْشَى النَّاسَ والله أَحَقُّ أَنْ تَخْشاهُ) و این آیه شگفتی است.\n\nدیدم در واقعه (کشف) خود که من\nاهل زمین را با زمین می‌گردانم\nزیرا آنان همتی ندارند\nکه ایشان را از عالم پستی (خفض) بالا ببرد\nپس آنان حیرانند و فاصله‌ای ندارند\nکه میان امر و عرض جدایی افکند\nخلق خدا جز آن کس را که\nدر سنت و فرض برپا داشته می‌شود، نمی‌ترسند.\n\nخداوند تبارک و تعالی فرمود: «تا بر مؤمنان در [مورد ازدواج با] همسران پسرخواندگانشان حرجی نباشد» (لِكَيْ لا يَكُونَ عَلَى الْمُؤْمِنِينَ حَرَجٌ في أَزْواجِ أَدْعِيائِهِمْ).\n\n### نسبت مؤمن کامل و رسول (صَلَّى اللهُ عَليهِ وسَلَّم) به خلق\n\nبدان که انسان کامل (الرجل الكامل) بر آنچه جوانمردی عرفی (المروءة العرفية) بر آن استوار است، می‌ایستد تا امر حتمی (الأمر الحتم) الهی فرا رسد. پس او بر حسب آنچه مأمور می‌شود عمل می‌کند. اگر آن امر، عرضی (غیر حتمی) باشد، به قرائن احوال می‌نگرد؛ اگر قرینه حال حکم امر حتمی را به او بدهد، به همان سرعت که امر حتمی را که مخالفتش جایز نیست می‌پذیرد، به قبول آن مبادرت می‌ورزد. و اگر قرینه حال او را متحیر سازد، بر امر عرفی که گواه مکارم اخلاق اوست باقی می‌ماند. به همین دلیل [خداوند] فرمود: «محمد پدر هیچ یک از مردان شما نبوده است، بلکه فرستاده خدا و خاتم پیامبران است» (ما كانَ مُحَمَّدٌ أَبا أَحَدٍ من رِجالِكُمْ ولكِنْ رَسُولَ الله وخاتَمَ النَّبِيِّينَ). پس او بر حکم خدا ایستاده است. و همچنین مؤمن کامل الایمان، با مردم نیست، بلکه با حکمی است که خداوند بر او به زبان رسولش (صَلَّى اللهُ عَليهِ وسَلَّم) جاری می‌سازد؛ رسولی که ایمان به او (صَلَّى اللهُ عَليهِ وسَلَّم) موجب ثبوت ایمان برای مؤمن می‌شود. زیرا پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در حق کسی که به خدا و به من و به آنچه آورده‌ام ایمان می‌آورد، می‌فرماید: «خداوند مرا مبعوث نکرد مگر برای تکمیل مکارم اخلاق.» پس تمام احوال او مکارم اخلاق است و او با حال خود، مکارم اخلاق را بیان می‌کند، و این بیان با حال، در حکم، کامل‌تر، عادلانه‌تر و نافذتر از قول است. زیرا حق (الحق):\n\nاو را نزولی به سوی بندگانش هست\nو ما را به سوی او عروجی نیست\nزیرا او همواره والا (علی) بوده است\nو عالم آشفته (مریج) او را نمی‌شناسد\nآن کس که در حیطه‌ای نیست که او را ببینی\nنه دخول (ولوج) دارد و نه خروج\nو ما در حیطه‌ای و زمانی هستیم\nکه دخول برای ما در آن صحیح است\nاز او در سرزمین جسم‌ها آشکار شد\nاز هر چیزی، زوجی شادمان.\n\nپس نسبت مؤمن کامل و رسول به خلق، نسبت شب قدر به شب‌های دیگر است. و [خداوند] از «هزار ماه» قصد تعیین وقت نداشت، بلکه قصدش این بود که آن شب، به طور مطلق، از تمام شب‌های زمان در هر وجودی که باشد، بهتر است.\n\nچون هر امری در تو آشکار شود\nپس تو بهتر از هزار ماه هستی\nدر شبی که صبحی ندارد\nکه نور فجر آن را از تو ببرد\nروح در هستی خود جز من نیست\nای شب قدر، قدر من در توست\nدر شب قدرِ وجود من\nحق (الحق) هر امری را نازل می‌کند.\n\nپس از جمله آنچه نازل شد این بود: «و از مردم می‌ترسیدی، در حالی که خداوند سزاوارتر است که از او بترسی» (تَخْشَى النَّاسَ والله أَحَقُّ أَنْ تَخْشاهُ). و آنچه او را در این امر قرار داد، جز این قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) نبود که فرمود: «اگر من به جای یوسف بودم، دعوت‌کننده را اجابت می‌کردم.»\n\nیعنی دعوت‌کننده پادشاه را، هنگامی که او را به خروج از زندان فراخواند. اما یوسف خارج نشد تا اینکه گفت: «به سوی پروردگارت (یعنی عزیزی که او را زندانی کرده بود) بازگرد و از او بپرس که حال آن زنان چه بود؟» (ارْجِعْ إِلى‏ رَبِّكَ فَسْئَلْهُ ما بالُ النِّسْوَةِ) تا بی‌گناهی او نزد عزیز ثابت شود و عزیز نتواند در بیرون آوردن او از زندان بر او منت بگذارد. بلکه «خداوند بر شما منت می‌گذارد» (بَلِ الله يَمُنُّ عَلَيْكُمْ). زیرا اگر احتمال [گناه] باقی می‌ماند، در عدالت او خدشه وارد می‌شد، در حالی که او رسولی از جانب خداست. پس لازم بود که عدالت او در قلب‌های مردم ثابت شود. به همین دلیل، خشیت (ترس) وجود داشت تا دعوت حق (الحق) رد نشود. پس خداوند پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) را به ازدواج با همسر کسی که او را به فرزندی پذیرفته بود، مبتلا ساخت. این کار اگر نزد عرب انجام می‌شد، در مقام او که رسول خداست، قدح وارد می‌کرد. پس خداوند علت آن را برای ایشان آشکار ساخت و آن، رفع حرج از مؤمنان در چنین فعلی بود. سپس میان او و ایشان با رسالت و ختم [نبوت] جدایی افکند. پس آنچه از جانب یوسف رخ داد که دعوت‌کننده را اجابت نکرد، همانند آن از جانب خدا در حق رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) رخ داد. این از هدایت انبیاست که خداوند در حق رسولش (صَلَّى اللهُ عَليهِ وسَلَّم) هنگامی که انبیا (علیهم السلام) را ذکر کرد، فرمود: «آنان کسانی هستند که خداوند هدایتشان کرده است، پس به هدایت آنان اقتدا کن» (أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ). پس اگر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در حالی بود که یوسف (علیه السلام) در آن بود، دعوت‌کننده را اجابت نمی‌کرد و همانند یوسف می‌گفت.\n\n[پیامبر] این را که «اگر من بودم، دعوت‌کننده را اجابت می‌کردم» نگفت، مگر برای بزرگداشت حق یوسف. همان‌طور که فرمود: «ما به شک سزاوارتر از ابراهیم هستیم.» در حالی که نه او و نه ابراهیم در شکی که [برخی] گمان می‌کنند، نبودند؛ شکی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آن را نفی کرد. زیرا اگر ابراهیم شک می‌کرد، محمد به شک سزاوارتر از او بود، در حالی که هر دو مأمورند که به هدایتشان اقتدا شود. پس رسولان و مؤمنان کامل (الکمل) بر آنچه نظرشان به آنان می‌دهد، نمی‌ایستند، بلکه بر آنچه از پروردگارشان به آنان می‌رسد، توقف می‌کنند. و آنچه از خدا به آنان می‌رسد، همان‌طور که گفتیم، ممکن است امر یا عرض باشد. امر حتماً باید به آن عمل شود، و در عرض، همان‌طور که مقرر کردیم، اختیار وجود دارد. و اما حال ایشان در معرفتشان (المعرفة) به خدا، همان‌طور است که در قصیده‌ای از خود گفته‌ایم:\n\nمعارف حق (معارف الحق) بر هیچ کس پنهان نمی‌ماند\nمگر بر کسی که احد (خداوند یگانه) را نمی‌شناسد.\n\n(و همان‌طور که گفتیم):\n\nاگر مشهود (مشهودي) من، چگونگی (کیف) و چندی (کم) باشد\nپس آن جز وهم نیست، آن معرفت (العلم) نیست\nبه آنچه عین امر در عین ذات اوست.\nو آیا حق (الحق) در آنچه کمّیت دارد، تجلی (التجلی) می‌کند؟\nپس او در حقیقت، حق (الحق) آشکار نیست\nبلکه حقی است که با ما بر او ختم شده است\nبا من از «چرا»، «چگونه»، «چند» و «چه» منزه شدی\nو آیا عین لفظ می‌تواند حکم داشته باشد؟\nو آیا موجودی هست که صحیح باشد؟ اگر اضافه کنی\nجز آنچه وهم آن را می‌سازد، چیزی اضافه نکرده‌ای\nقرآن با همین [معنا] آمده است اگر ناظر باشی\nهمان‌طور که فهم آن برای مؤمنان آمده است.\n\nپس این ذکر حکیمانه‌ای است که از عطایای معارف و آداب، چیزی می‌بخشد که کتابی گنجایش آن را ندارد. و خداوند حق (الحق) را می‌گوید و او راه را می‌نمایاند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 3
}