{
  "id": 488,
  "title": {
    "ar": "الباب الثامن والثمانون وأربعمائة في معرفة حال قطب كان منزله ولا تَمُدَّنَّ عَيْنَيْكَ إِلى‏ ما مَتَّعْنا به أَزْواجاً مِنْهُمْ زَهْرَةَ الْحَياةِ الدُّنْيا لِنَفْتِنَهُمْ فِيهِ ورِزْقُ رَبِّكَ خَيْرٌ وأَبْقى‏",
    "en": "Chapter Four Hundred and Eighty-Eight: Concerning the knowledge of the state of a Pole (قطب) whose station was: <<وَلا تَمُدَّنَّ عَيْنَيْكَ إِلى‏ ما مَتَّعْنا به أَزْواجاً مِنْهُمْ زَهْرَةَ الْحَياةِ الدُّنْيا لِنَفْتِنَهُمْ فِيهِ ورِزْقُ رَبِّكَ خَيْرٌ وأَبْقى‏>> (And do not extend your eyes toward that by which We have given enjoyment to [various] kinds of them - the flower of worldly life - that We may test them therein. And the provision of your Lord is better and more lasting.)",
    "ur": "باب چار سو اٹھاسی: ایک قطب (قطب) کے حال کی معرفت (معرفۃ) کے بیان میں جس کا منزل (روحانی مقام) یہ تھا:\n\"اور اپنی آنکھیں اس چیز کی طرف نہ اٹھاؤ جس سے ہم نے ان میں سے مختلف قسم کے لوگوں کو فائدہ پہنچایا ہے، جو دنیاوی زندگی کی رونق ہے، تاکہ ہم انہیں اس میں آزمائیں، اور آپ کے رب کا رزق بہتر اور زیادہ باقی رہنے والا ہے۔\" (قرآن ۲۰:۱۳۱)",
    "fa": "باب چهارصد و هشتاد و هشتم در شناخت حال قطبی که منزل او این آیه بود: «و هرگز چشمان خود را به آنچه گروه‌هایی از آنان را از آن بهره‌مند ساختیم، یعنی شکوفه زندگی دنیا، مدوز، تا آنان را در آن بیازماییم؛ و روزی پروردگارت بهتر و پایدارتر است» (وَلَا تَمُدَّنَّ عَيْنَيْكَ إِلَى مَا مَتَّعْنَا بِهِ أَزْوَاجًا مِّنْهُمْ زَهْرَةَ الْحَيَاةِ الدُّنْيَا لِنَفْتِنَهُمْ فِيهِ وَرِزْقُ رَبِّكَ خَيْرٌ وَأَبْقَى)."
  },
  "content": {
    "ar": "## «الباب الثامن والثمانون وأربعمائة في معرفة حال قطب كان منزله ولا تَمُدَّنَّ عَيْنَيْكَ إِلى‏ ما مَتَّعْنا به أَزْواجاً مِنْهُمْ زَهْرَةَ الْحَياةِ الدُّنْيا لِنَفْتِنَهُمْ فِيهِ ورِزْقُ رَبِّكَ خَيْرٌ وأَبْقى‏»\n\n\n> كل شخص زوجه من نفسه *** ولهذا زوجه من جنسه‏\n\n\n> فهو كل وهي جزء فلذا *** كثرت أزواجه من نفسه‏\n\n\n> وكذا اليوم الذي أوجده *** إنما أوجده من أمسه‏\n\n\n> ولذا جاء على صورته *** في نقيض القدس أو في قدسه‏\n\n\n> لا تمدن إلى حرمة من *** كان عينيك فذا من بخسه‏\n\n\n> وفه ميزانه لا تلتفت *** للذي تبصره من أنسه‏\n\n\n> إنما يأنس من لست له *** بك للجمع الذي في أسه‏\n\n\n> ولتجرده من الشك وما *** جاء من شيطانه في مسه‏\n\n\n> ولتفرق بين ما تسمع من *** ليس في النطق به أو أيسه‏\n\n\n> ولتخف من زلل النطق وما *** جاء في محكمه من لبسه‏\n\n\n### [الرزق مقسوم‏]\n\n\nقال الله تعالى في مثل هذه الآية وهو من تمام هذا المنزل ويدخله صاحبه في هجيره ولا تَحْزَنْ عَلَيْهِمْ واخْفِضْ جَناحَكَ لِلْمُؤْمِنِينَ وقُلْ إِنِّي أَنَا النَّذِيرُ الْمُبِينُ ينبهه بذلك على نفسه في إنذاره ورزق ربك ما أعطاك مما أنت عليه في وقتك وما لم يعطك وهو لك فلا بد من وصوله إليك وما أبطأ به إلا الوقت الزماني الذي هو له وما ليس لك فلا يصل إليك فتتعب نفسك حيث طمعت في غير مطمع وما أعني بقولنا إنه لك إلا ما تناله على الحد الإلهي الذي أباحه لك وإن نلته على غير ذلك الحد فما نلت ما هو لك من جانب الحق إنما نلت ما هو لك من جانب الطبع وليس المراد في الدنيا إلا ما تناله من جانب الحق فالحق للدنيا والطبع للآخرة والطبع له الإباحة والحق له التحجير وإن كانت الآخرة على صورة الدنيا كما إن اليوم المولود عن نكاح أمس لليلته يخرج بصورته في الزمان وقد لا يخرج في الحكم فانظر إلى عطايا ربك فإنها أكثر ما تكون ابتلاء ولا تعرف ذلك إلا بالميزان وذلك أن كل عطاء يصل إليك منه فهو رزق ربك ولكن على الميزان فإن خرج عن الميزان وهو لك طبعا فلا بد لك من أخذه فإياك أن تأخذه في حال غفلة فخذه بحضور على كره في نفسك وجبر واضطرار وليكن حضورك في ذلك قوله ما يُبَدَّلُ الْقَوْلُ لَدَيَّ فأظهر في هذا النيل بصورة الحق في ذلك الحكم الذي لا تبدل له ولا يصح أن يبدل فإنه هكذا علمه وبهذه الصورة كان الأمر الذي أعطى العلم للحق به ففي هذا الميزان حصله وزنه به وهو ميزان خفي فإن غيبك الحق عن حال الكرة في ذلك فإنه من الإكراه فاعلم إنك محروم فإنه لما كان‏\nمن الإكراه حصول الكراهة في نفس العامل لذلك العمل الخارج عن ميزان الأدب دخل في حكم الميزان المأمور بالوزن به في قوله إِلَّا من أُكْرِهَ وقَلْبُهُ مُطْمَئِنٌّ بِالْإِيمانِ وطمأنينته في هذه النازلة إنما هو بما له فيه من الكراهة فيجمع في هذا الفعل بين حب الطبع وكراهة الايمان فإن الله حبب الايمان للمؤمن وكره إليه الفسوق والعصيان مع وقوعه منه وجعلك من أهل الرشد ثم إن الله جعلهن زهرة حيث كن فإذا كن في الدنيا كن زهرة الحياة الدنيا فوقع النعيم بهن حيث كن وأحكام الأماكن تختلف فهن وإن خلقن للنعيم في الدنيا فهن فتنة يستخرج الحق بهن ما خفي عنا فينا مما هو به عالم ولا نعلمه من نفوسنا فيقوم به الحجة لنا وعلينا وهذا مقام أعطانيه الحق بمدينة فاس سنة ثلاث وتسعين وخمسمائة قبل ذلك ما كان لي فيه ذوق‏\n\n\n### [إن المعصية من العبد لا يقع إلا عن غفلة]\n\n\nواعلم أن المعصية لا تقع أبدا إلا عن غفلة أو تأويل لا غير ذلك في حق المؤمن وإذا وقع عين ذلك العمل من صاحب الشهود فلا يسمى معصية عند الله وإن انطلق عليه لسان الذنب في العموم فللغشاوة التي على أبصار المحجوبين فيعذرهم الله فيما أنكروه على من ظهر منه هذا الفعل وهو في نفس الأمر ليس بعاص مسألة الخضر مع موسى في قتل النفس أين حكم موسى عليه السلام فيه من حكم الخضر رضي الله عنه وكل واحد له وجه في الحق ومستند وهذا حال أهل الشهود يشهدون المقدور قبل وقوعه في الوجود فيأتونه على بصيرة فهم على بينة من ربهم في ذلك وهو مقام لا يناله إلا من كان الله سمعه وبصره ولما كانت الزهرة دليلة على الثمرة ومتنزها للبصر ومعطية الرائحة الطيبة هنا أعني في زهرة هذه المسألة كان صاحب هذا الأمر من أهل الأنفاس والشهود والأدلة ولست أعني بالأدلة أن ذلك عن فكر وإنما هو في كشفه لما جرت العادة به أن لا ينال إلا بالدليل النظري إن يعطيه الله كشفا بدليله فيعرف أدلته كما يعرفه وارتباطه بأدلته فما يحصل له من علمه بوجوه الدلالات فيكون علمه أتم من علم من يعطي علم مدلول الدليل من غير علم الدليل فما فتنهم الحق إلا بما سماه زهرة لهم فإذا لم يدرك صاحب هذه الزهرة رائحتها ولا شهدها زهرة وإنما شهدها امرأة ولا علم دلالتها التي سبقت له على الخصوص وزوجت به وتنعم بها ونال منها ما نال بحيوانيته لا بروحه وعقله فلا فرق بينه وبين سائر الحيوان بل الحيوان خير منه لأن كل حيوان مشاهد لفصله المقوم له وهذا الشخص ما وقف مع فصله المقوم له وليس الفصول المقومة للحيوانات غيره فهو لا حيوان ولا إنسان فإن كل حيوان جرى بفصله المقوم له على ما تعطيه حقيقة ذلك الفصل‏\n\n\n### [ما هي الرؤية]\n\n\nواعلم أن صاحب هذا الهجير يشاهد ما حير العقول ولم يقدر على تحصيله وهو العلم بالمرئي في المرآة ما هو وبالمرئي ما هو من حيث تعلق الرؤية هل ينطبع المرئي في عين الرائي أو أشعة نور البصر تتعلق بالمرئي حيث كان وما من حكم إلا وعليه دخل إلا عند صاحب هذا الذكر فإنه يعلم كيفية إدراك الرائي المرئي وما هي الرؤية ولما ذا ترجع وليس يعطيه هذا العلم من هذا الذكر إلا قوله لا تَمُدَّنَّ عَيْنَيْكَ ولا خوطب إلا بما علم فعلمنا على القطع أن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قد علم ذلك وما هو قوله لا تَمُدَّنَّ عَيْنَيْكَ عين قوله قُلْ لِلْمُؤْمِنِينَ يَغُضُّوا من أَبْصارِهِمْ فإن الغض له حكم آخر لأنه نقص مما تمتد العين إليه والنقص هنا أن لا يمد إلى أمر خاص أي إلى مرئي خاص فإن فهمت يا ولي ما نبهتك عليه علمت علما ينفعك في الدنيا والآخرة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيل‏\n\n",
    "en": "## Chapter Four Hundred and Eighty-Eight: Concerning the Gnosis of the State of a Pole (قطب) whose Station was: <<And strain not your eyes toward that which We have given to [various] classes of them to enjoy—the splendor of worldly life—that We may test them thereby. But the provision of your Lord is better and more lasting.>> (Quran 20:131)\n\n> Every person marries from his own self,\n> And for this reason, He married him from his own kind.\n\n> So He is the Whole, and she is a part, and thus\n> His spouses multiplied from His own Self.\n\n> Likewise, the day which He brought into existence\n> He only brought it forth from its yesterday.\n\n> And thus it came upon its form,\n> Whether in the antithesis of Holiness or in its Holiness.\n\n> Do not strain toward the sanctity of one\n> Who was your very eyes, for that is a diminution of him.\n\n> Understand his Balance (ميزان), do not turn\n> To that which you perceive of his intimacy (أنس).\n\n> Only he finds intimacy who is not for you,\n> Due to the synthesis (جمع) that is in his foundation (أس).\n\n> And due to his stripping away of doubt, and that which\n> Came from his devil in his touch.\n\n> And so that you may distinguish between what you hear from\n> One who is not in the utterance of it, or who denies it.\n\n> And so that you may fear the slip of speech, and that which\n> Came in its decisive (محكم) text concerning its ambiguity (لبس).\n\n### [Provision (الرزق) is Apportioned]\n\nAllah the Exalted said concerning a verse like this—which is the completion of this station (منزل) and which its possessor enters in its midday heat (هجيره): <<And grieve not over them, and lower your wing to the believers, and say: 'Indeed, I am the clear Warner.'>> (Quran 15:88-89).\n\nHe alerts him thereby to his own self in his warning. \"The provision of your Lord\" (رزق ربك) is what He has given you, which you possess in your present time, and what He has not given you yet but is destined for you, which must inevitably reach you. The only thing delaying it is the temporal time (الوقت الزماني) appointed for it. That which is not for you will not reach you, so you tire yourself by desiring the unattainable.\n\nWhat I mean by our saying \"it is yours\" is only that which you attain according to the Divine Limit (الحد الإلهي) that He permitted for you. If you attain it outside of that limit, then you have not attained what is yours from the side of the Real (جانب الحق); rather, you attained what is yours from the side of Nature/Temperament (جانب الطبع). The only thing intended in this world (الدنيا) is what you attain from the side of the Real. Thus, the Real belongs to the world, and Nature belongs to the Hereafter. Nature has permission (الإباحة), and the Real has restriction (التحجير).\n\nEven though the Hereafter is in the form of the world, just as the day born from the marriage of yesterday to its night emerges in its form in time, yet it may not emerge in its ruling.\n\nLook at the gifts of your Lord, for they are mostly a trial (ابتلاء). You only recognize this through the Balance (الميزان). This is because every gift that reaches you from Him is the provision of your Lord, but it must be weighed on the Balance. If it falls outside the Balance, and it is yours naturally (طبعا), you must take it. Beware of taking it in a state of heedlessness (غفلة). Take it with presence (حضور), even if it involves inner aversion (كره), compulsion (جبر), and necessity (اضطرار).\n\nYour presence in that act should be His saying: <<The word will not be changed with Me.>> (Quran 50:29). In this attainment, manifest the form of the Real in that ruling which cannot be changed and is not proper to be changed, for thus He knew it. It was in this form that the matter was, which gave the Real the Knowledge (العلم) of it. Therefore, obtain it in this Balance and weigh it by it.\n\nThis Balance is subtle (خفي). If the Real conceals you from the state of aversion in that matter, then it is a matter of compulsion (الإكراه), and know that you are deprived. Since compulsion necessitates the presence of aversion in the soul of the agent performing that action which falls outside the Balance of propriety (ميزان الأدب), he enters into the ruling of the Balance commanded for weighing, as in His saying: <<...except for one who is compelled [to renounce faith] while his heart is secure in faith.>> (Quran 16:106). His security (طمأنينته) in this predicament is only due to the aversion he holds toward it. Thus, in this action, he combines the love of Nature and the aversion of Faith. Allah has made faith beloved to the believer and made disbelief, wickedness, and disobedience hateful to him, even when they occur from him, and He made you among the rightly guided (أهل الرشد).\n\nThen Allah made them (the things enjoyed) a splendor (زهرة) wherever they are. If they are in the world, they are the splendor of worldly life (زهرة الحياة الدنيا). Enjoyment occurs through them wherever they are, but the rulings of places differ. Even though they were created for enjoyment in the world, they are a trial (فتنة) by which the Real extracts from us what was hidden from us, which He knows but we do not know about ourselves. Through this, He establishes the proof for us and against us. This is a station (مقام) the Real granted me in the city of Fez in the year 593 AH (1197 CE). Before that, I had no taste (ذوق) of it.\n\n### [Disobedience from the Servant Occurs Only Through Heedlessness (غفلة)]\n\nKnow that disobedience (معصية) never occurs except through heedlessness or interpretation (تأويل), and nothing else, concerning the believer. If the very same action occurs from the person of Witnessing (صاحب الشهود), it is not called disobedience in the sight of Allah. Even if the tongue of blame applies to it generally, this is due to the veil (الغشاوة) over the eyes of the veiled (المحجوبين). Allah excuses them for what they deny concerning the one from whom this action appeared, even though in reality he is not disobedient.\n\nConsider the case of Al-Khidr with Moses regarding the killing of the soul. Where is the ruling of Moses (peace be upon him) compared to the ruling of Al-Khidr (may Allah be pleased with him)? Each one has a face (وجه) in the Real and a basis (مستند).\n\nThis is the state of the People of Witnessing (أهل الشهود): they witness the decreed event (المقدور) before its occurrence in Existence (الوجود). They approach it with insight (بصيرة), being upon clear evidence (بينة) from their Lord concerning it. This is a station attained only by one whose hearing and sight Allah becomes.\n\nSince the splendor (الزهرة) is an indicator of the fruit (الثمرة), a pleasure for the eye, and gives a pleasant fragrance—here, I mean in the splendor of this matter—the possessor of this matter is among the People of Breaths (أهل الأنفاس), Witnessing, and Proofs (الأدلة). I do not mean by \"Proofs\" that it comes through reflection (فكر). Rather, it is in his Unveiling (كشفه) of what custom dictates can only be attained through theoretical proof (الدليل النظري): that Allah grants him an unveiling along with its proof, so he knows its proofs just as he knows the thing itself, and its connection to its proofs. The knowledge he gains concerning the aspects of the indications (وجوه الدلالات) makes his knowledge more complete than the knowledge of one who is given the knowledge of the indicated meaning (مدلول الدليل) without the knowledge of the proof.\n\nThe Real only tests them with what He named \"splendor\" for them. If the possessor of this splendor does not perceive its fragrance, nor witness it as a splendor, but only witnesses it as a woman, and does not know its specific indication that preceded for him, and he marries her and enjoys her and attains from her what he attains by his animality (حيوانيته) and not by his spirit (روحه) and intellect (عقله)—then there is no difference between him and the rest of the animals. In fact, the animal is better than him, because every animal witnesses its constitutive differentia (فصله المقوم له). This person did not stand with his constitutive differentia. Since the constitutive differentiae of the animals are nothing other than him, he is neither animal nor human. For every animal proceeds according to its constitutive differentia based on what the reality of that differentia dictates.\n\n### [What is Vision (الرؤية)]\n\nKnow that the possessor of this midday heat witnesses what confounds intellects and what they cannot attain: the knowledge of what the seen object (المرئي) in the mirror (المرآة) truly is, and what the seen object truly is in terms of the connection of vision. Does the seen object become imprinted in the eye of the viewer, or do the rays of the light of sight (أشعة نور البصر) connect with the seen object wherever it is? There is no ruling that does not have an objection (دخل) against it, except with the possessor of this remembrance (الذكر). He knows the modality of the viewer's perception of the seen object, what vision is, and why it returns.\n\nHe is not granted this knowledge from this remembrance except through His saying: <<And strain not your eyes (لا تَمُدَّنَّ عَيْنَيْكَ)>>. He was only addressed concerning what He knew. Thus, we know with certainty that the Messenger of Allah (peace and blessings be upon him) had known that.\n\nHis saying <<And strain not your eyes>> is the very same as His saying: <<Tell the believing men to lower their gaze (يَغُضُّوا مِنْ أَبْصَارِهِمْ)>> (Quran 24:30). Lowering the gaze has another ruling, because it is a reduction (نقص) from that toward which the eye strains. The reduction here is that one should not strain toward a specific matter, meaning a specific seen object.\n\nIf you, O friend (ولي), understand what I have alerted you to, you will gain knowledge that benefits you in this world and the Hereafter. <<And Allah speaks the Truth, and He guides to the Way.>> (Quran 33:4).",
    "ur": "باب نمبر چار سو اٹھاسی: اس قطب (قطب) کے حال کی معرفت میں جس کا منزل (منزل) یہ آیت تھی: \"اور اپنی آنکھیں ہرگز نہ اٹھا کر دیکھو اس چیز کی طرف جس سے ہم نے ان میں سے مختلف جوڑوں کو بہرہ مند کیا ہے، جو دنیاوی زندگی کی زینت (زهرة الحياة الدنيا) ہے، تاکہ ہم انہیں اس میں آزمائیں، اور آپ کے رب کا رزق (رزق ربك) بہتر اور زیادہ باقی رہنے والا ہے۔\" (وَلَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِ أَزْوَاجًا مِّنْهُمْ زَهْرَةَ الْحَيَاةِ الدُّنْيَا لِنَفْتِنَهُمْ فِيهِ وَرِزْقُ رَبِّكَ خَيْرٌ وَأَبْقَىٰ) [سورۃ طٰہٰ: ۱۳۱]\n\nہر شخص نے اپنی ذات سے اپنا جوڑا بنایا،\nاور اسی لیے اس نے اسے اپنی جنس سے جوڑا بنایا۔\n\nپس وہ (مرد) کُل ہے اور وہ (عورت) جزو ہے، اسی لیے\nاس کے جوڑے اس کی ذات سے کثرت اختیار کر گئے۔\n\nاور اسی طرح وہ دن جسے اس نے وجود بخشا،\nاس نے اسے اپنے گزرے ہوئے کل (أمس) سے ہی وجود بخشا۔\n\nاور اسی لیے وہ اس کی صورت پر آیا،\nخواہ تقدس (قدس) کے مخالف میں ہو یا خود اس کے تقدس میں۔\n\nاس شخص کی حرمت کی طرف آنکھیں نہ اٹھاؤ\nجو تمہاری آنکھیں تھا، کیونکہ یہ اس کی قدر گھٹانا ہے۔\n\nاور اس کا میزان (توازن) پورا کرو، اس چیز کی طرف مت دیکھو\nجسے تم اس کی انسیت (أنس) سے دیکھتے ہو۔\n\nانسیت تو اسے حاصل ہوتی ہے جو تمہارے لیے نہیں ہے،\nتمہاری وجہ سے اس مجموعے کے لیے جو اس کی بنیاد (أس) میں ہے۔\n\nاور اس کے شک سے پاک ہونے کے لیے، اور اس چیز سے\nجو اس کے شیطان کی طرف سے اس کے چھونے (مس) میں آئی۔\n\nاور اس چیز میں فرق کرنے کے لیے جو تم سنتے ہو،\nجو اس کے بولنے میں نہیں ہے یا اس نے اسے مایوس کر دیا۔\n\nاور کلام کی لغزش سے ڈرنے کے لیے، اور اس چیز سے\nجو اس کے محکم (مضبوط) حکم میں اس کے التباس (لبس) سے آئی۔\n\n### [رزق تقسیم شدہ ہے]\n\nاللہ تعالیٰ نے اس آیت کی مانند ایک اور آیت میں فرمایا، جو اس منزل (منزل) کی تکمیل ہے اور اس کا صاحب اسے اپنی دوپہر (ہجیر) میں داخل کرتا ہے: \"اور ان پر غم نہ کھاؤ اور مومنوں کے لیے اپنے بازو جھکا دو (اخفض جناحك للمؤمنين)، اور کہہ دو کہ میں ہی کھلم کھلا ڈرانے والا ہوں (إِنِّي أَنَا النَّذِيرُ الْمُبِينُ)\" (وَلَا تَحْزَنْ عَلَيْهِمْ وَاخْفِضْ جَنَاحَكَ لِلْمُؤْمِنِينَ وَقُلْ إِنِّي أَنَا النَّذِيرُ الْمُبِينُ) [سورۃ الحجر: ۸۸-۸۹]۔ اس کے ذریعے وہ اسے اس کے انذار (ڈرانے) میں اس کی اپنی ذات پر متنبہ کرتا ہے۔ اور آپ کے رب کا رزق (رزق ربك) وہ ہے جو اس نے آپ کو اس وقت میں عطا کیا جس پر آپ قائم ہیں، اور وہ بھی جو اس نے عطا نہیں کیا مگر وہ آپ کے لیے ہے، لہٰذا اس کا آپ تک پہنچنا ضروری ہے۔ اور اس میں تاخیر صرف زمانی وقت (الوقت الزماني) کی وجہ سے ہوئی جو اس کے لیے مقرر ہے۔ اور جو آپ کے لیے نہیں ہے وہ آپ تک نہیں پہنچے گا، لہٰذا آپ اپنی جان کو تھکاتے ہیں جہاں آپ نے غیر مطلوب چیز کی طمع کی۔ اور ہمارے اس قول سے کہ \"یہ آپ کے لیے ہے\" میری مراد صرف وہ ہے جو آپ اس الٰہی حد (الحد الإلهي) پر حاصل کریں جو اس نے آپ کے لیے مباح کی ہے۔ اور اگر آپ نے اسے اس حد کے علاوہ حاصل کیا، تو آپ نے وہ چیز حاصل نہیں کی جو آپ کے لیے حق (الحق) کی جانب سے تھی، بلکہ آپ نے وہ حاصل کی جو آپ کے لیے طبع (الطبع) کی جانب سے تھی۔ اور دنیا میں مراد صرف وہ ہے جو آپ حق (الحق) کی جانب سے حاصل کریں۔ پس حق (الحق) دنیا کے لیے ہے اور طبع (الطبع) آخرت کے لیے ہے۔ اور طبع کے لیے اباحت ہے اور حق کے لیے تحجیر (محدود کرنا) ہے۔ اگرچہ آخرت دنیا کی صورت پر ہے، جیسا کہ کل رات کے ساتھ آج کا دن جو نکاح سے پیدا ہوا، وہ زمانے میں اپنی صورت کے ساتھ ظاہر ہوتا ہے، اور بعض اوقات حکم میں ظاہر نہیں ہوتا۔ پس اپنے رب کی عطا پر غور کرو، کیونکہ اکثر اوقات وہ آزمائش ہوتی ہے، اور تم اسے میزان (توازن) کے بغیر نہیں جان سکتے۔ اور وہ یہ ہے کہ ہر عطا جو اس کی طرف سے تم تک پہنچتی ہے وہ تمہارے رب کا رزق (رزق ربك) ہے، لیکن میزان (توازن) پر۔ پس اگر وہ میزان سے باہر ہو اور وہ طبعاً تمہارے لیے ہو، تو تمہیں اسے لینا ضروری ہے۔ لہٰذا خبردار! اسے غفلت (غفلة) کی حالت میں نہ لو، بلکہ اسے اپنے نفس میں کراہت اور جبر و اضطرار کے ساتھ حضور (حضور) میں لو۔ اور اس میں تمہارا حضور (حضور) اس کا یہ قول ہونا چاہیے: \"میرے ہاں بات بدلی نہیں جاتی\" (مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ) [سورۃ ق: ۲۹]۔ پس اس حصول میں اس حکم میں حق (الحق) کی صورت میں ظاہر ہو جس میں کوئی تبدیلی نہیں، اور نہ ہی اس کا بدلنا صحیح ہے، کیونکہ اس نے اسے اسی طرح سکھایا، اور اسی صورت میں وہ امر تھا جس نے حق (الحق) کو علم عطا کیا۔ پس اسے اس میزان (توازن) میں حاصل کرو اور اس کے ساتھ وزن کرو۔ اور یہ ایک مخفی میزان ہے۔ پس اگر حق (الحق) تمہیں اس میں کراہت (کُرہ) کی حالت سے غائب کر دے، تو یہ اکراہ (مجبوری) میں سے ہے، تو جان لو کہ تم محروم ہو۔ کیونکہ جب یہ اکراہ (مجبوری) میں سے تھا، تو اس عمل کو کرنے والے کے نفس میں کراہت کا پیدا ہونا جو ادب کے میزان (توازن) سے باہر ہے، وہ اس میزان کے حکم میں داخل ہو گیا جس کے ساتھ وزن کرنے کا حکم دیا گیا ہے، جیسا کہ اس کے قول میں ہے: \"سوائے اس کے جسے مجبور کیا گیا ہو اور اس کا دل ایمان (الإيمان) پر مطمئن ہو\" (إِلَّا مَنْ أُكْرِهَ وَقَلْبُهُ مُطْمَئِنٌّ بِالْإِيمَانِ) [سورۃ النحل: ۱۰۶]۔ اور اس نازلہ (واقعہ) میں اس کا اطمینان صرف اس کراہت کی وجہ سے ہے جو اسے اس میں حاصل ہے۔ پس وہ اس فعل میں طبع (الطبع) کی محبت اور ایمان (الإيمان) کی کراہت کو جمع کرتا ہے۔ کیونکہ اللہ نے مومن کے لیے ایمان کو محبوب بنا دیا اور اس کے لیے فسق و عصیاں کو ناپسندیدہ کر دیا، باوجود اس کے کہ وہ اس سے واقع ہوتا ہے، اور تمہیں رشد (ہدایت) والوں میں شامل کر دیا۔ پھر اللہ نے انہیں زینت (زهرة) بنا دیا جہاں بھی وہ ہوں، پس جب وہ دنیا میں ہوں تو وہ دنیاوی زندگی کی زینت (زهرة الحياة الدنيا) ہیں۔ پس ان کے ذریعے نعمت حاصل ہوئی جہاں بھی وہ ہوں، اور مقامات کے احکام مختلف ہوتے ہیں۔ پس وہ اگرچہ دنیا میں نعمت کے لیے پیدا کی گئی ہیں، لیکن وہ فتنہ ہیں جن کے ذریعے حق (الحق) ہم میں سے وہ چیزیں نکالتا ہے جو ہم سے پوشیدہ ہیں، جنہیں وہ جانتا ہے اور ہم اپنی جانوں سے نہیں جانتے، پس وہ اس کے ذریعے ہمارے حق میں اور ہمارے خلاف حجت قائم کرتا ہے۔ اور یہ وہ مقام ہے جو حق (الحق) نے مجھے فاس شہر میں پانچ سو ترانوے ہجری میں عطا کیا تھا، اس سے پہلے مجھے اس میں کوئی ذوق (ذوق) حاصل نہیں تھا۔\n\n### [بندے سے معصیت کا وقوع غفلت کے بغیر نہیں ہوتا]\n\nاور جان لو کہ مومن کے حق میں معصیت (گناہ) کبھی بھی غفلت (غفلة) یا تاویل (تأويل) کے بغیر واقع نہیں ہوتی، اس کے علاوہ کچھ نہیں۔ اور جب وہی عمل صاحب شہود (صاحب الشہود) سے واقع ہوتا ہے، تو اللہ کے نزدیک اسے معصیت نہیں کہا جاتا، اگرچہ عام طور پر اس پر گناہ کی زبان جاری ہو، تو یہ ان پردہ نشینوں (محجوبین) کی آنکھوں پر پڑی ہوئی غشاوت (پردے) کی وجہ سے ہے۔ پس اللہ انہیں معذور رکھتا ہے اس چیز میں جس کا انہوں نے اس شخص پر انکار کیا جس سے یہ فعل ظاہر ہوا، حالانکہ وہ فی نفس الامر گناہ گار نہیں ہے۔ خضر (علیہ السلام) کا موسیٰ (علیہ السلام) کے ساتھ ایک جان کے قتل کا مسئلہ، موسیٰ (علیہ السلام) کا حکم اس میں خضر (رضی اللہ عنہ) کے حکم سے کہاں ہے؟ اور ہر ایک کے لیے حق (الحق) میں ایک پہلو اور ایک سند ہے۔ اور یہ اہل شہود (أهل الشہود) کا حال ہے، وہ وجود میں واقع ہونے سے پہلے مقدور (مقدر) کا مشاہدہ کرتے ہیں، پس وہ بصیرت کے ساتھ اس پر آتے ہیں، لہٰذا وہ اس میں اپنے رب کی طرف سے واضح دلیل پر ہیں۔ اور یہ وہ مقام ہے جسے صرف وہی حاصل کرتا ہے جس کا اللہ اس کا کان اور اس کی آنکھ بن جاتا ہے۔ اور چونکہ زینت (زهرة) ثمر (پھل) کی دلیل ہے، اور آنکھ کے لیے تفریح گاہ ہے، اور یہاں اچھی خوشبو دینے والی ہے—یعنی اس مسئلے کی زینت میں—اس لیے اس امر کا صاحب اہل انفاس (أهل الأنفاس) اور شہود (الشہود) اور دلائل (الأدلة) میں سے تھا۔ اور دلائل (الأدلة) سے میری مراد یہ نہیں کہ وہ فکر (فکر) سے حاصل ہوں، بلکہ یہ اس کے کشف (کشف) میں ہے، کیونکہ یہ عادت جاری ہے کہ جو چیز نظری دلیل (الدليل النظري) کے بغیر حاصل نہیں ہوتی، اللہ اسے اس کی دلیل کے ساتھ کشف (کشف) عطا کر دیتا ہے، پس وہ اپنی دلیلوں کو اسی طرح جانتا ہے جس طرح وہ اسے جانتا ہے اور اس کا اپنی دلیلوں سے تعلق۔ پس جو علم اسے دلالتوں کے پہلوؤں سے حاصل ہوتا ہے، اس کا علم اس شخص کے علم سے زیادہ مکمل ہوتا ہے جسے دلیل کے مدلول کا علم تو دیا جاتا ہے مگر دلیل کا علم نہیں۔ پس حق (الحق) نے انہیں صرف اسی چیز سے آزمایا جسے اس نے ان کے لیے زینت (زهرة) کا نام دیا۔ پس اگر اس زینت (زهرة) کا صاحب اس کی خوشبو کو نہ پائے اور نہ ہی اسے زینت کے طور پر دیکھے، بلکہ اسے عورت کے طور پر دیکھے، اور اس کی اس دلالت کو نہ جانے جو اسے خاص طور پر حاصل ہوئی تھی، اور اس کے ساتھ اس کی شادی ہوئی اور اس نے اس سے نعمت حاصل کی اور اپنی حیوانیت (حیوانية) کے ذریعے اس سے وہ کچھ حاصل کیا جو حاصل کیا، نہ کہ اپنی روح اور عقل کے ذریعے، تو اس میں اور باقی حیوانات میں کوئی فرق نہیں، بلکہ حیوان اس سے بہتر ہے، کیونکہ ہر حیوان اپنے مقوم فصل (فصل المقوم) کا مشاہدہ کرنے والا ہے، اور یہ شخص اپنے مقوم فصل پر نہیں ٹھہرا۔ اور حیوانات کے مقوم فصول اس کے علاوہ نہیں ہیں، پس وہ نہ حیوان ہے اور نہ انسان۔ کیونکہ ہر حیوان اپنے مقوم فصل کے ساتھ اس چیز پر چلا جو اس فصل کی حقیقت عطا کرتی ہے۔\n\n### [رؤیت کیا ہے]\n\nاور جان لو کہ اس دوپہر (ہجیر) کا صاحب اس چیز کا مشاہدہ کرتا ہے جس نے عقلوں کو حیران کر دیا اور وہ اسے حاصل کرنے پر قادر نہ ہوئیں، اور وہ یہ علم ہے کہ آئینے میں نظر آنے والی چیز کیا ہے، اور مرئی (دیکھی جانے والی چیز) کیا ہے، اس لحاظ سے کہ رؤیت (دیکھنے) کا تعلق کس چیز سے ہے؟ کیا مرئی دیکھنے والے کی آنکھ میں نقش ہو جاتا ہے، یا بصارت کے نور کی شعاعیں مرئی سے جہاں بھی وہ ہو، متعلق ہو جاتی ہیں؟ اور کوئی حکم ایسا نہیں جس پر کوئی اعتراض نہ ہو، سوائے اس ذکر کے صاحب کے نزدیک۔ کیونکہ وہ جانتا ہے کہ دیکھنے والا مرئی کو کس طرح ادراک کرتا ہے، اور رؤیت (رؤية) کیا ہے، اور وہ کیوں لوٹتی ہے۔ اور یہ علم اسے اس ذکر سے صرف اس کے قول سے حاصل ہوتا ہے: \"اور اپنی آنکھیں ہرگز نہ اٹھا کر دیکھو\" (لَا تَمُدَّنَّ عَيْنَيْكَ)۔ اور اسے صرف اسی چیز سے مخاطب کیا گیا جو وہ جانتا تھا۔ پس ہم قطعی طور پر جانتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے یہ جان لیا تھا۔ اور اس کا قول \"اور اپنی آنکھیں ہرگز نہ اٹھا کر دیکھو\" (لَا تَمُدَّنَّ عَيْنَيْكَ) بعینہٖ اس کے قول \"مومنوں سے کہہ دو کہ وہ اپنی نگاہیں نیچی رکھیں\" (قُل لِّلْمُؤْمِنِينَ يَغُضُّوا مِنْ أَبْصَارِهِمْ) [سورۃ النور: ۳۰] کے مترادف ہے۔ کیونکہ غض (نیچا کرنے) کا ایک اور حکم ہے، کیونکہ یہ اس چیز میں کمی ہے جس کی طرف آنکھ اٹھتی ہے۔ اور یہاں کمی یہ ہے کہ کسی خاص امر کی طرف آنکھ نہ اٹھائی جائے، یعنی کسی خاص مرئی کی طرف۔ پس اے ولی (ولی)! اگر تم نے وہ سمجھ لیا جس پر میں نے تمہیں متنبہ کیا ہے، تو تم ایسا علم جان لو گے جو تمہیں دنیا اور آخرت میں فائدہ دے گا۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و هشتاد و هشتم در معرفت حال قطبی که منزل او این آیه بود: «و هرگز چشمان خود را به سوی آنچه اصنافی از ایشان را بدان بهره‌مند ساختیم، یعنی شکوفه (زهرة) زندگی دنیا، مدوز، تا آنان را در آن بیازماییم؛ و روزی پروردگار تو بهتر و پایدارتر است.» (طه: ۱۳۱)\n\nهر شخصی همسرش از خود اوست *** و به همین دلیل همسرش را از جنس او قرار داد\nپس او کل است و آن (همسر) جزء، از این رو *** همسرانش از خود او بسیار شدند\nو همچنین روزی که آن را ایجاد کرد *** تنها آن را از دیروزش (امس) ایجاد نمود\nو از این رو بر صورت آن آمد *** در نقیض قدس یا در قدس آن\nچشمانت را به حرمت کسی که *** عین تو بود، مدوز، که این از کاستی اوست\nو میزانش را بفهم و به آنچه *** از اُنس او می‌بینی، توجه مکن\nتنها کسی اُنس می‌گیرد که تو برای او نیستی *** به خاطر جمعی که در اساس اوست\nو به خاطر تجردش از شک و آنچه *** از شیطانش در تماس با او آمد\nو تا فرق بگذاری میان آنچه می‌شنوی *** از کسی که در نطقش نیست یا آن را ناامید کرده است\nو از لغزش گفتار و آنچه *** در محکم آن از پوشیدگی‌اش آمده، بترس\n\n### [روزی تقسیم شده است]\n\nخداوند متعال در مثل این آیه فرمود، که از تمامیت این منزل است و صاحبش در نیمروز (هجیر) خود وارد آن می‌شود: «و بر آنان غمگین مباش و بال خود را برای مؤمنان فرود آر (اخفض جناحك للمؤمنين) و بگو: من همان بیم‌دهنده آشکارم (النذير المبين).» (حجر: ۸۸-۸۹) با این آیه او را بر نفس خود در انذارش آگاه می‌سازد. و روزی پروردگار تو، آن چیزی است که به تو داده است از آنچه در وقت خود بر آن هستی، و آنچه به تو نداده و آن برای توست، پس ناگزیر به تو خواهد رسید، و تأخیر آن تنها به سبب وقت زمانی است که برای آن مقرر شده است. و آنچه برای تو نیست، به تو نمی‌رسد، پس خود را خسته می‌کنی آنجا که در غیر محل طمع، طمع ورزیدی. و منظور ما از اینکه می‌گوییم «آن برای توست» تنها چیزی است که آن را بر حد الهی که برایت مباح کرده است، به دست آوری. و اگر آن را بر غیر آن حد به دست آوری، آنچه برای توست را از جانب حق (الحق) به دست نیاورده‌ای، بلکه آنچه برای توست را از جانب طبع (الطبع) به دست آورده‌ای. و مراد در دنیا تنها چیزی است که از جانب حق به دست آوری؛ پس حق برای دنیاست و طبع برای آخرت. و طبع برایش اباحه است و حق برایش تحجیر (محدودیت)، اگرچه آخرت بر صورت دنیا باشد، همان‌گونه که روزی که از نکاح دیروز برای شبش متولد می‌شود، در زمان با صورت آن خارج می‌شود و گاهی در حکم خارج نمی‌شود. پس به عطایای پروردگارت بنگر، زیرا بیشتر آنها ابتلا و آزمایش است و این را جز با میزان (الميزان) نمی‌شناسی. و آن این است که هر عطایی که از او به تو می‌رسد، روزی پروردگار توست، اما بر اساس میزان. پس اگر از میزان خارج شد و آن از نظر طبع برای توست، ناگزیر باید آن را بگیری. پس مبادا آن را در حال غفلت بگیری، بلکه آن را با حضور و با کراهت در نفس خود و به جبر و اضطرار بگیر. و باید حضور تو در آن، این قول باشد: «سخن نزد من دگرگون نمی‌شود (ما يبدل القول لدي).» (ق: ۲۹) پس در این نیل، صورت حق را در آن حکم که دگرگونی ندارد و صحیح نیست که دگرگون شود، آشکار کن. زیرا امر این‌گونه به حق تعلیم داده شده و به همین صورت بود امری که علم را به حق داد. پس آن را در این میزان به دست آور و با آن وزن کن، و آن میزان پنهانی است. پس اگر حق تو را از حال کراهت در آن غایب کرد، بدان که آن از اکراه (الإكراه) است و تو محرومی. زیرا وقتی که حصول کراهت در نفس عامل برای آن عمل خارج از میزان ادب، از اکراه بود، در حکم میزان مأمور به وزن کردن داخل شد، در قول او: «مگر کسی که مجبور شده (أكره) و قلبش به ایمان مطمئن است (وقلبه مطمئن بالإيمان).» (نحل: ۱۰۶) و اطمینان قلب او در این واقعه تنها به سبب کراهتی است که در آن دارد. پس در این فعل، میان محبت طبع و کراهت ایمان جمع می‌کند. زیرا خداوند ایمان را برای مؤمن محبوب گردانید و فسوق و عصیان را برای او مکروه ساخت، با وجود اینکه از او سر می‌زند، و تو را از اهل رشد قرار داد. سپس خداوند آنها را شکوفه (زهرة) قرار داد، هر جا که باشند. پس اگر در دنیا باشند، شکوفه زندگی دنیا (زهرة الحياة الدنيا) هستند. پس نعمت در آنها هر جا که باشند واقع می‌شود، و احکام مکان‌ها متفاوت است. پس آنها اگرچه برای نعمت در دنیا خلق شده‌اند، اما فتنه‌ای هستند که حق به وسیله آنها آنچه را که در ما پنهان است و او به آن عالم است و ما از نفوس خود نمی‌دانیم، استخراج می‌کند، و به وسیله آن حجت را برای ما و علیه ما اقامه می‌کند. و این مقامی است که حق در شهر فاس در سال پانصد و نود و سه به من عطا کرد، و پیش از آن در آن ذوقی نداشتم.\n\n### [همانا معصیت از بنده واقع نمی‌شود مگر از غفلت]\n\nو بدان که معصیت هرگز واقع نمی‌شود مگر از غفلت یا تأویل، و غیر از این در حق مؤمن نیست. و اگر عین آن عمل از صاحب شهود (الشهود) واقع شود، نزد خداوند معصیت نامیده نمی‌شود، اگرچه زبان گناه در عموم بر آن جاری شود. این به دلیل پرده‌ای است که بر چشمان محجوبان است، پس خداوند آنها را در آنچه بر کسی که این فعل از او ظاهر شده، انکار کرده‌اند، معذور می‌دارد، در حالی که او در نفس الامر عاصی نیست. مسئله خضر (الخضر) با موسی در کشتن نفس؛ حکم موسی (علیه السلام) در آن کجا و حکم خضر (رضی الله عنه) کجا؟ و هر یک در حق وجهی و مستندی دارند. و این حال اهل شهود است که مقدور را پیش از وقوعش در وجود مشاهده می‌کنند، پس آن را بر بصیرت انجام می‌دهند و بر بینه‌ای از پروردگارشان در آن هستند. و این مقامی است که جز کسی که خداوند گوش و چشم او باشد، به آن نمی‌رسد. و چون شکوفه (الزهرة) دلیلی بر ثمره و تفرجگاهی برای چشم و بخشنده بوی خوش است، در اینجا، یعنی در شکوفه این مسئله، صاحب این امر از اهل انفاس (الأنفاس)، شهود (الشهود) و ادله است. و منظورم از ادله این نیست که آن از فکر است، بلکه در کشف (کشف) اوست؛ زیرا عادت بر این جاری شده که جز با دلیل نظری به دست نمی‌آید، مگر اینکه خداوند آن را با دلیلش به صورت کشف به او عطا کند، پس ادله‌اش را بشناسد، همان‌گونه که آن را می‌شناسد و ارتباطش را با ادله‌اش می‌داند. پس علمی که از وجوه دلالات به او حاصل می‌شود، کامل‌تر از علم کسی است که علم مدلول دلیل به او داده می‌شود بدون علم به دلیل. پس حق آنان را نیازمود مگر با آنچه آن را برایشان شکوفه نامید. پس اگر صاحب این شکوفه بوی آن را درک نکند و آن را شکوفه نبیند، بلکه آن را زن ببیند، و دلالت آن را که به خصوص برای او سبقت گرفته بود، نداند، و با آن ازدواج کند و از آن بهره‌مند شود و آنچه را که به حیوانیت خود از آن به دست آورد، نه به روح و عقل خود، پس فرقی میان او و سایر حیوانات نیست. بلکه حیوان بهتر از اوست، زیرا هر حیوانی مشاهده‌کننده فصل مقوم خود است، و این شخص بر فصل مقوم خود توقف نکرده است. و فصول مقوم حیوانات غیر از او نیست، پس او نه حیوان است و نه انسان. زیرا هر حیوانی بر اساس آنچه حقیقت آن فصل اقتضا می‌کند، با فصل مقوم خود جاری شده است.\n\n### [رؤیت چیست]\n\nو بدان که صاحب این نیمروز (هجیر) چیزی را مشاهده می‌کند که عقل‌ها را حیران کرده و نتوانسته‌اند آن را به دست آورند، و آن علم به این است که مرئی (المرئي) در آینه چیست، و مرئی از حیث تعلق رؤیت چیست؛ آیا مرئی در چشم بیننده نقش می‌بندد یا اشعه نور بصر به مرئی در هر کجا که باشد تعلق می‌گیرد؟ و هیچ حکمی نیست مگر اینکه بر آن اشکالی وارد شده است، جز نزد صاحب این ذکر. زیرا او کیفیت ادراک بیننده نسبت به مرئی را می‌داند و می‌داند که رؤیت (الرؤية) چیست و چرا باز می‌گردد. و این علم را از این ذکر به او نمی‌دهد مگر قول او: «و هرگز چشمان خود را مدوز (لا تمدن عينيك).» و جز به آنچه می‌دانست مورد خطاب قرار نگرفت. پس ما به قطع می‌دانیم که رسول خدا (صلی الله علیه و سلم) آن را می‌دانست. و قول او «و هرگز چشمان خود را مدوز (لا تمدن عينيك)» عین قول اوست: «به مردان مؤمن بگو چشمان خود را فرو بندند (قل للمؤمنين يغضوا من أبصارهم).» (نور: ۳۰) زیرا غض (فرو بستن) حکم دیگری دارد، چون نقصانی است از آنچه چشم به سوی آن کشیده می‌شود. و نقصان در اینجا این است که به امر خاصی، یعنی به مرئی خاصی، کشیده نشود. پس ای ولی، اگر آنچه را که به تو تذکر دادم فهمیدی، علمی را آموختی که در دنیا و آخرت به تو سود می‌رساند. و خداوند حق می‌گوید و او راه را هدایت می‌کند (والله يقول الحق وهو يهدي السبيل)."
  },
  "page_count": 2
}