{
  "id": 117,
  "title": {
    "ar": "الباب السابع عشر ومائة في مقام الشرة والحرص في الزيادة على الاكتفاء",
    "en": "Chapter 117: Concerning the Station of Avidity and Zeal in Seeking Increase Beyond Sufficiency.",
    "ur": "باب ایک سو سترہ: اکتفاء (الاكتفاء) سے زیادہ کی طلب میں شرہ (الشرة) اور حرص (الحرص) کے مقام کا بیان۔",
    "fa": "باب صد و هفدهم در مقام شره و حرص در زیاده‌طلبی بر اکتفا"
  },
  "content": {
    "ar": "### (الباب السابع عشر ومائة في مقام الشرة والحرص في الزيادة على الاكتفاء)\n\n\n> لا تقنعن بشي‏ء دونه أبدا *** واشره فإنك مجبول على الشرة\n\n\n> واحرص على طلب العليا تحظ بها *** فليس نائمها عنها كمنتبه‏\n\n\n> إن الحلال حلال ما وثقت به *** وليس مال حرام مثل مشتبه‏\n\n\n### [الشره والحرص نحيزتان في جبلة الإنسان‏]\n\n\nاعلم أيدك الله أن هاتين الصفتين مجبول عليهما الإنسان بما هو إنسان وكل ما هو الإنسان مجبول عليه فمن المحال زواله فهو مقام لا حال فإنه ثابت ويتطرق إليه الذم من جهة متعلقة إذا كان مذموما شرعا وعقلا قال تعالى ولَتَجِدَنَّهُمْ أَحْرَصَ النَّاسِ عَلى‏ حَياةٍ وقال صَلَّى اللهُ عَليهِ وسَلَّم زادك الله حرصا ولا تعد\n\n\nفالآية موجهة لطرفي الحمد والذم لو لا الضمير الذي في قوله ولَتَجِدَنَّهُمْ فإنه يعود على قوم مذمومين وقرينة الحال تدل على أن مساقه الحرص فيها على الذم تكذيبا لهم فيما ادعوه من أن الدار الآخرة خالصة لهم من دون الناس فمن نظر في الحرص هنا الدلالة على كذبهم كان محمودا فيهم لأنه دليل إلهي على كذبهم فهو من جانب الحق فيهم عليهم حجة لله ولله الْحُجَّةُ الْبالِغَةُ والمذموم هو المذموم من كل وجه من حيث ما هو فيهم لا من حيث دلالته عليهم وكان متعلقة ما يفنى وتكذيب الصادق كان مذموما وأما في الخبر الذي أوردناه فهو محمود لأنه حرص على أداء عبادة مفروضة\n\n\n### [الشره والحرص من صفات الوارث سائس الأمة]\n\n\nثم إنه مع هذا فإنهما صفتان من صفات العالم الوارث‏\nالمكمل الذي هو سائس أمة فهو ينظر فيما فيه صلاحهم كما قال في نبيه صَلَّى اللهُ عَليهِ وسَلَّم يمدحه به حَرِيصٌ عَلَيْكُمْ فمدحه بالحرص على ما تسعد به أمته وشرهه وحرصه على إسلام عمه أبي طالب إلى أن قال له قلها في أذني حتى أشهد لك بها\n\n\nلعلمه بأن شهادته مقبولة وكلامه مسموع فيعرف الكامل نائب الله في عباده نوائب الزمان المستأنفة فيستعد لها عن الأمر الذي كان له منه الاطلاع على منازلتها فيتخيل من لا علم له أنه سعى في حق نفسه وليس الأمر كذلك وهو كذلك فإنه يباهي الأمم بالأتباع من أمته فكان يطلب الكثرة من المؤمنين‏\n\n\n### [شرطا حرص الوارث المكمل وشرهه‏]\n\n\nولكن لا بد لهذا الشرة من وجود الشرطين الاطلاع والأمر الإلهي وهو الشرط الأعظم وأما الاطلاع وإن اشترط فهو شرط ضعيف فإنه لا يشترط إلا لمن ادعى أنه يدخر في حق الغير ثم يتناول من ذلك المدخر في حق نفسه فيقال له هل أطلعك الله على من له هذا المدخر عندك وهل اطلعت على أنه لا يصل إليهم إلا على يدك فإن قال نعم سلم له الادخار وإن قال لا قيل له فحرصك ما قام على أصل مقطوع بصحته فدخله الخلل فإن قيل فقد قالت طائفة من صح توكله في نفسه صح توكله في غيره قلنا هذا صحيح وهذا لا يناقض حال هذا الحريص على الكسب والادخار والمزاحمة لأبناء الدنيا الذين لا توكل لهم على ذلك فإن التوكل أمر باطن وهو الاعتماد على الله وهذا المدخر إن كان اعتماده على ما ادخره فهذا يناقض التوكل وإن لم يعتمد عليه فليس يناقض لكن يناقض التجريد الظاهر وقطع الأسباب وليس هذا من أحوال المكملين وإنما هو من أحوال السالكين ليكون لهم ما اتخذوه عقدا ذوقا فإن الذوق أتم في التمكن فإنه يزيل الاضطراب في حال عدم السبب الذي من عادة النفس أن تسكن إليه وسيرد تحقيق هذا في مقام التوكل بعد هذا إن شاء الله‏\n\n\n### [درجات الشره والحرص عند العارفين‏]\n\n\nولهذا الشرة والحرص من الدرجات عند العارفين سواء كانوا من أهل الأدب والوقوف أو من أهل الأنس والوصال ثمانمائة وخمس وستون درجة وعند الملامتية سواء كان الملامي من أهل الأنس والوصال أو من أهل الأدب والوقوف ثمانمائة درجة وثلاث درجات فإن كان العارفون من أهل الأسرار فلهم من الدرجات ألف وخمسمائة وخمس وثلاثون درجة وإن كانوا من أهل الأنوار فلهم ثمانمائة درجة وخمس وستون درجة وإن كان الملامية من أهل الأسرار فلهم ألف وأربعمائة وثلاث وسبعون درجة وإن كانوا من أهل الأنوار فلهم ثمانمائة وثلاث درجات‏\n\n\n### [النعوت الإلهية التي هي مجرد أفعال والتي لها أسماء]\n\n\nوهو نعت إلهي فإنه يقول عَجَّلْنا لَهُ فِيها ما نَشاءُ لِمَنْ نُرِيدُ وكذلك الحرص نعت إلهي أيضا وهو الذي يقتضيه‏\n\n\nقول الله لملائكته في المتشاحنين أنظروا هذين حتى يصطلحا\n\n\nوتسخير الملائكة في حق المؤمنين بالاستغفار والدعاء لهم فهذا من ثمرته وإن لم يرد الإطلاق اللفظي به فإن هذه الأمور على قسمين منهما ما ورد إطلاق اللفظ بأسمائها على الجناب الإلهي ومنها ما وجد منه آثارها ولم يطلق عليه منها اسم ومنها ما نسب الفعل الذي يكون منها إليه ولم يطلق عليه منه اسما ومنه ما أطلق عليه منه اسما في جماعة بحكم التضمين فمثل ما نسب إليه الفعل ولم يطلق الاسم قوله الله يَسْتَهْزِئُ بِهِمْ وقوله سَخِرَ الله مِنْهُمْ ومثل ما نسب إليه الفعل وأطلق عليه الاسم في جماعة بحكم التضمين قوله ومَكَرَ الله والله خَيْرُ الْماكِرِينَ ومثل ما أطلق عليه منه اسم قوله وهُوَ خادِعُهُمْ ومثل ما وجد منه آثارها ولم يطلق عليه منها اسم ولا فعل قوله عَجَّلْنا لَهُ فِيها ما نَشاءُ\n\n",
    "en": "### Chapter One Hundred and Seventeen: Concerning the Station of Intense Desire and Eagerness in Seeking Increase Beyond Sufficiency\n\n> Never be content with anything less than Him, ever,\n> And desire intensely, for you are naturally inclined toward intense desire (الشَّرَه).\n\n> Be eager in seeking the Highest (العليا), so that you may attain it,\n> For the one who sleeps concerning it is not like the one who is awake.\n\n> Indeed, the lawful (الحلال) is lawful as long as you trust in it,\n> And unlawful wealth is not like that which is doubtful.\n\n### Intense Desire and Eagerness are Innate Dispositions in the Constitution of Man\n\nKnow, may Allah support you, that these two qualities are inherent in man by virtue of his being human. Everything that is inherent in man is impossible to remove; thus, it is a station (مقام) and not a state (حال), for it is fixed. Blame is directed toward it only based on its object (متعلق), if that object is blameworthy according to the Law (شرعاً) and reason (عقلاً).\n\nThe Exalted said: <<وَلَتَجِدَنَّهُمْ أَحْرَصَ النَّاسِ عَلى‏ حَياةٍ>> (And you will surely find them the most eager of people for life). And the Prophet, peace and blessings be upon him, said: \"May Allah increase your eagerness (حرصاً), and do not return [to that state].\"\n\nThe Quranic verse points toward both praise and blame, were it not for the pronoun in His saying <<وَلَتَجِدَنَّهُمْ>>, which refers back to a blameworthy people. The context indicates that the direction of eagerness in that verse is toward blame, as a refutation of their claim that the Hereafter belongs exclusively to them, excluding all others.\n\nThus, whoever views this eagerness as evidence of their falsehood is praiseworthy, because it is a Divine proof of their lies. It is, from the side of the Real (الحق), a conclusive argument against them, for <<وَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ>> (And Allah’s is the conclusive argument).\n\nThe blameworthy aspect is that which is blameworthy in every respect, insofar as it exists within them, not insofar as it serves as evidence against them. Its object was that which perishes, and the denial of the truthful person is blameworthy. As for the tradition (خبر) we cited, the eagerness is praiseworthy because it is eagerness to perform an obligatory act of worship.\n\n### Intense Desire and Eagerness are Qualities of the Inheritor, the Regulator of the Community\n\nFurthermore, despite this, they are two qualities belonging to the perfect, knowing Inheritor (الوارث المكمل), who is the regulator (سائس) of a community (أمة). He looks after what is beneficial for them, just as [Allah] said concerning His Prophet, peace and blessings be upon him, praising him: <<حَرِيصٌ عَلَيْكُمْ>> (Eager for you).\n\nThus, He praised him for his eagerness concerning that which brings happiness to his community, and his intense desire and eagerness for his uncle Abu Talib to embrace Islam, until [the Prophet] said to him: \"Say it in my ear so that I may bear witness for you with it.\"\n\nKnowing that his testimony is accepted and his word is heard, the Perfect Human (الكامل), who is Allah’s deputy among His servants, recognizes the renewed calamities of time. He prepares for them based on the matter through which he gained insight into their descent. Thus, the one who lacks knowledge imagines that [the Perfect Human] strives for his own benefit, but the matter is not so, yet it is also so. For he boasts to the nations by the followers of his community, and thus he sought a great number of believers.\n\n### The Two Conditions for the Eagerness and Intense Desire of the Perfect Inheritor\n\nHowever, this intense desire (شرة) requires the existence of two conditions: Insight (الاطلاع) and the Divine Command (الأمر الإلهي), which is the greater condition.\n\nAs for Insight, although it is a condition, it is a weak condition. It is only required of one who claims that he saves [or stores] something for the benefit of others, and then takes from that stored amount for his own benefit. He is asked: \"Has Allah given you insight into who owns this stored amount with you? And have you gained insight that it will not reach them except through your hand?\" If he says yes, the storing is accepted from him. If he says no, he is told: \"Then your eagerness is not based on a principle whose validity is certain, and thus defect has entered it.\"\n\nIf it is said: \"A group has stated that whoever’s reliance (توكله) is sound concerning himself, his reliance is sound concerning others,\" we say: \"This is true, and it does not contradict the state of this eager person who strives for acquisition, storage, and competition with the people of the world who lack reliance (توكل) in that regard.\"\n\nReliance (التوكل) is an inward matter, which is dependence upon Allah. If this person who stores relies upon what he has stored, this contradicts reliance. If he does not rely upon it, it does not contradict reliance, but it does contradict outward detachment (التجريد الظاهر) and the cutting off of means (الأسباب).\n\nThis is not among the states of the Perfected Ones (المكملين), but rather among the states of the spiritual travelers (السالكين), so that what they have adopted as a contract becomes a direct experience (ذوق). For direct experience is more complete in establishing certainty, as it removes agitation in the absence of the means upon which the soul habitually relies. The verification of this will follow in the Station of Reliance, God willing.\n\n### The Degrees of Intense Desire and Eagerness according to the Gnostics\n\nFor this intense desire (شرة) and eagerness (حرص) have, among the Gnostics (العارفين)—whether they are the People of Proper Conduct and Halting (أهل الأدب والوقوف) or the People of Intimacy and Union (أهل الأنس والوصال)—eight hundred and sixty-five degrees.\n\nAnd among the People of Blame (اللامتية)—whether the Malamati is from the People of Intimacy and Union or the People of Proper Conduct and Halting—eight hundred and three degrees.\n\nIf the Gnostics are from the People of Secrets (أهل الأسرار), they have one thousand five hundred and thirty-five degrees. And if they are from the People of Lights (أهل الأنوار), they have eight hundred and sixty-five degrees.\n\nIf the Malamatiyya are from the People of Secrets, they have one thousand four hundred and seventy-three degrees. And if they are from the People of Lights, they have eight hundred and three degrees.\n\n### The Divine Descriptions that are Merely Acts and Those that Have Names\n\nAnd [Sharah/Hirs] is a Divine description (نعت إلهي), for He says: <<عَجَّلْنَا لَهُ فِيهَا مَا نَشَاءُ لِمَنْ نُرِيدُ>> (We hasten for him therein what We will, for whom We intend). Likewise, eagerness (حرص) is also a Divine description, which is necessitated by Allah’s saying to His angels concerning those who dispute: \"Look upon these two until they reconcile.\"\n\nAnd the subjugation of the angels to seek forgiveness and supplicate for the believers—this is a fruit of it, even if the verbal term is not explicitly applied to Him.\n\nFor these matters are of two types: those whose names are explicitly applied to the Divine Presence (الجناب الإلهي), and those whose effects are found but no name derived from them is applied to Him. Among them are those whose corresponding act is attributed to Him, but no name derived from it is applied to Him. And among them are those whose name is applied to Him in a collective sense by way of implication (حكم التضمين).\n\nAn example of that whose act is attributed to Him but the name is not applied is His saying: <<اللَّهُ يَسْتَهْزِئُ بِهِمْ>> (Allah mocks them), and His saying: <<سَخِرَ اللَّهُ مِنْهُمْ>> (Allah scoffs at them).\n\nAn example of that whose act is attributed to Him and the name is applied to Him in a collective sense by way of implication is His saying: <<وَمَكَرَ اللَّهُ وَاللَّهُ خَيْرُ الْمَاكِرِينَ>> (And Allah planned, and Allah is the best of planners).\n\nAn example of that whose name is applied to Him is His saying: <<وَهُوَ خَادِعُهُمْ>> (And He is deceiving them).\n\nAnd an example of that whose effects are found but neither a name nor an act derived from it is applied to Him is His saying: <<عَجَّلْنَا لَهُ فِيهَا مَا نَشَاءُ>> (We hasten for him therein what We will).",
    "ur": "(باب نمبر ایک سو سترہ: اکتفا سے زیادہ کی طلب میں شدید حرص (الشرة) اور حرص (الحرص) کا مقام)\n\nاس کے (حق) سوا کسی شے پر کبھی قناعت نہ کر، اور شدید حرص رکھ، کیونکہ تو شدید حرص (الشرة) پر ہی سرشت کیا گیا ہے۔\nبلندی کی طلب میں حرص کر تاکہ تو اسے حاصل کر لے، کیونکہ اس سے غافل سونے والا اس کے لیے بیدار رہنے والے جیسا نہیں ہے۔\nحلال وہی ہے جس پر تو نے بھروسہ کیا، اور حرام مال مشتبہ مال جیسا نہیں ہے۔\n\n[شدید حرص (الشرة) اور حرص (الحرص) انسان کی سرشت میں دو فطری خصلتیں ہیں]\n\nاللہ تعالیٰ تمہاری تائید فرمائے، جان لو کہ یہ دونوں صفات انسان کی سرشت میں شامل ہیں، اس حیثیت سے کہ وہ انسان ہے۔ اور ہر وہ چیز جس پر انسان سرشت کیا گیا ہے، اس کا زائل ہونا محال ہے۔ لہٰذا یہ ایک مقام ہے، نہ کہ حال (حال)، کیونکہ یہ ثابت ہے۔ اور اس پر مذمت اس کے متعلق (متعلقہ) کی وجہ سے آتی ہے، جب وہ شرعاً اور عقلاً مذموم ہو۔ اللہ تعالیٰ نے فرمایا: **(وَلَتَجِدَنَّهُمْ أَحْرَصَ النَّاسِ عَلى‏ حَياةٍ)** \"اور تم انہیں زندگی پر سب لوگوں سے زیادہ حریص پاؤ گے۔\" اور نبی اکرم ﷺ نے فرمایا: **(زادك الله حرصا ولا تعد)** \"اللہ تمہارے حرص میں اضافہ کرے اور تم حد سے تجاوز نہ کرو۔\"\n\nپس یہ آیت حمد اور مذمت دونوں پہلوؤں کی طرف متوجہ ہے، اگر اس کے قول **(وَلَتَجِدَنَّهُمْ)** میں ضمیر نہ ہوتی، کیونکہ یہ ضمیر مذموم لوگوں کی طرف لوٹتی ہے۔ اور قرینہ حال اس بات پر دلالت کرتا ہے کہ اس میں حرص کا مقصد ان کی مذمت کرنا ہے، اس دعوے کی تکذیب کرتے ہوئے جو انہوں نے کیا تھا کہ آخرت کا گھر صرف ان کے لیے ہے، نہ کہ دوسرے لوگوں کے لیے۔ لہٰذا جس نے یہاں حرص میں ان کے جھوٹ پر دلالت دیکھی، تو وہ ان میں قابل تعریف تھا، کیونکہ یہ ان کے جھوٹ پر ایک الٰہی دلیل ہے۔ پس یہ ان کے خلاف ان کے حق میں ذات حق (الحق) کی طرف سے اللہ کی حجت ہے۔ اور **(وَلِلَّهِ الْحُجَّةُ الْبالِغَةُ)** \"اور اللہ ہی کے لیے کامل حجت ہے۔\" اور مذموم وہ ہے جو ہر لحاظ سے مذموم ہو، اس حیثیت سے کہ وہ ان میں موجود ہے، نہ کہ اس حیثیت سے کہ وہ ان پر دلالت کرتا ہے۔ اور اس کا متعلق (متعلقہ) وہ ہو جو فنا ہو جانے والا ہو، اور سچے کی تکذیب کرنا مذموم تھا۔ لیکن جو حدیث ہم نے بیان کی ہے، اس میں یہ (حرص) محمود ہے، کیونکہ یہ فرض عبادت کی ادائیگی پر حرص ہے۔\n\n[شدید حرص (الشرة) اور حرص (الحرص) امت کے منتظم (سائس) وارث کی صفات میں سے ہیں]\n\nپھر اس کے باوجود، یہ دونوں صفات عالم وارث (الوارث) کامل (المكمل) کی صفات میں سے ہیں، جو امت کا منتظم (سائس) ہے۔ پس وہ اس چیز کو دیکھتا ہے جس میں ان کی بھلائی ہو، جیسا کہ اللہ تعالیٰ نے اپنے نبی ﷺ کی تعریف کرتے ہوئے فرمایا: **(حَرِيصٌ عَلَيْكُمْ)** \"تمہارے لیے حریص (فکرمند) ہیں۔\" پس اللہ نے آپ ﷺ کی تعریف اس حرص کی وجہ سے کی جس سے آپ کی امت سعادت مند ہو، اور آپ ﷺ کی شدید حرص (شرہ) اور حرص اپنے چچا ابو طالب کے اسلام لانے پر تھی، یہاں تک کہ آپ نے ان سے فرمایا: \"یہ کلمہ میرے کان میں کہہ دو تاکہ میں تمہارے لیے اس کی گواہی دوں۔\" یہ آپ ﷺ کے اس علم کی بنا پر تھا کہ آپ کی گواہی مقبول ہے اور آپ کا کلام سنا جاتا ہے۔ پس انسان کامل (الکامل) اپنے بندوں میں اللہ کے نائب کی حیثیت سے زمانے کے نئے پیش آنے والے واقعات (نوائب الزمان المستأنفة) کو جانتا ہے، اور اس امر کی بنا پر ان کے لیے تیاری کرتا ہے جس سے اسے ان کے نزول کا علم ہوتا ہے۔ پس وہ شخص جسے علم نہیں، یہ گمان کرتا ہے کہ اس نے اپنے حق میں کوشش کی ہے، حالانکہ معاملہ ایسا نہیں ہے، اور وہ ایسا ہی ہے (یعنی دونوں پہلو درست ہیں)، کیونکہ وہ اپنی امت کے پیروکاروں کے ذریعے دوسری امتوں پر فخر کرتے ہیں، لہٰذا وہ مومنوں کی کثرت کے طالب تھے۔\n\n[وارث کامل (الوارث المكمل) کے حرص اور شدید حرص (الشرة) کی دو شرطیں]\n\nلیکن اس شدید حرص (الشرة) کے لیے دو شرطوں کا پایا جانا ضروری ہے: اطلاع (الاطلاع) اور امر الٰہی (الأمر الإلهي)، اور یہی سب سے بڑی شرط ہے۔ جہاں تک اطلاع کا تعلق ہے، اگرچہ وہ شرط ہے، لیکن وہ ایک کمزور شرط ہے، کیونکہ یہ صرف اس شخص کے لیے مشروط ہے جو یہ دعویٰ کرے کہ وہ دوسروں کے حق میں ذخیرہ کر رہا ہے، پھر اس ذخیرہ شدہ مال میں سے اپنے حق میں لے لے۔ تو اس سے کہا جائے گا: کیا اللہ نے تمہیں اس شخص کے بارے میں مطلع کیا ہے جس کا یہ ذخیرہ تمہارے پاس ہے؟ اور کیا تمہیں یہ معلوم ہے کہ یہ ان تک تمہارے ہاتھ کے بغیر نہیں پہنچ سکتا؟ اگر وہ کہے: ہاں، تو اس کے ذخیرہ کرنے کو تسلیم کر لیا جائے گا۔ اور اگر وہ کہے: نہیں، تو اس سے کہا جائے گا: تمہارا حرص کسی ایسے اصول پر قائم نہیں ہوا جس کی صحت یقینی ہو، لہٰذا اس میں نقص آ گیا۔ اگر کہا جائے کہ ایک گروہ نے کہا ہے کہ جس کا توکل (التوکل) اپنے نفس پر صحیح ہو گیا، اس کا توکل دوسروں کے حق میں بھی صحیح ہو گیا۔ ہم کہیں گے: یہ صحیح ہے، اور یہ اس شخص کے حال کے منافی نہیں ہے جو کمانے، ذخیرہ کرنے اور دنیا داروں سے مقابلہ کرنے کا حریص ہے، جنہیں اس پر توکل نہیں ہے۔ کیونکہ توکل (التوکل) ایک باطنی امر ہے، اور وہ اللہ پر بھروسہ کرنا ہے۔ اور یہ ذخیرہ شدہ مال، اگر اس کا بھروسہ اس چیز پر ہو جو اس نے ذخیرہ کی ہے، تو یہ توکل کے منافی ہے۔ اور اگر وہ اس پر بھروسہ نہ کرے، تو یہ منافی نہیں ہے، لیکن یہ ظاہری تجرید (التجريد الظاہر) اور اسباب کو ترک کرنے کے منافی ہے۔ اور یہ کاملین (المکملین) کے احوال میں سے نہیں ہے، بلکہ یہ سالکین (السالکین) کے احوال میں سے ہے، تاکہ جو چیز انہوں نے عقیدہ کے طور پر اختیار کی ہے، وہ ان کے لیے ذوق (ذوق) بن جائے۔ کیونکہ ذوق تمکن (تمکن) میں زیادہ کامل ہوتا ہے، اس لیے کہ یہ سبب کے نہ ہونے کی حالت میں اضطراب کو دور کر دیتا ہے، جس کی طرف نفس کا سکون کرنا عادت ہے۔ اور ان شاء اللہ اس کی تحقیق اس کے بعد مقام توکل (التوکل) میں آئے گی۔\n\n[عارفین کے ہاں شدید حرص (الشرة) اور حرص (الحرص) کے درجات]\n\nاور اسی وجہ سے، عارفین (العارفین) کے ہاں شدید حرص (الشرة) اور حرص (الحرص) کے درجات ہیں، خواہ وہ اہل ادب و وقوف (اہل الأدب والوقوف) میں سے ہوں یا اہل انس و وصال (اہل الأنس والوصال) میں سے، ان کے لیے آٹھ سو پینسٹھ (865) درجات ہیں۔ اور ملامتیہ (الملامتية) کے ہاں، خواہ ملامتی اہل انس و وصال میں سے ہو یا اہل ادب و وقوف میں سے، ان کے لیے آٹھ سو تین (803) درجات ہیں۔ اگر عارفین اہل اسرار (أهل الأسرار) میں سے ہوں، تو ان کے لیے ایک ہزار پانچ سو پینتیس (1535) درجات ہیں۔ اور اگر وہ اہل انوار (أهل الأنوار) میں سے ہوں، تو ان کے لیے آٹھ سو پینسٹھ (865) درجات ہیں۔ اور اگر ملامتیہ اہل اسرار میں سے ہوں، تو ان کے لیے ایک ہزار چار سو تہتر (1473) درجات ہیں۔ اور اگر وہ اہل انوار میں سے ہوں، تو ان کے لیے آٹھ سو تین (803) درجات ہیں۔\n\n[وہ الٰہی صفات (النعوت الإلهية) جو محض افعال ہیں اور وہ جن کے اسماء ہیں]\n\nاور یہ ایک الٰہی صفت (نعت إلهي) ہے، کیونکہ اللہ تعالیٰ فرماتا ہے: **(عَجَّلْنا لَهُ فِيها ما نَشاءُ لِمَنْ نُرِيدُ)** \"ہم نے اس کے لیے اس میں جلدی کر دی جو ہم نے چاہا، جس کے لیے ہم نے چاہا۔\" اور اسی طرح حرص (الحرص) بھی ایک الٰہی صفت ہے، اور یہ وہی ہے جس کا تقاضا کرتا ہے، اللہ کا اپنے فرشتوں سے جھگڑنے والوں کے بارے میں یہ کہنا کہ: \"ان دونوں کو دیکھو یہاں تک کہ یہ صلح کر لیں۔\" اور مومنوں کے حق میں فرشتوں کا استغفار اور دعا کے ذریعے مسخر ہونا، یہ اسی کا ثمرہ ہے، اگرچہ اس کا لفظی اطلاق وارد نہیں ہوا۔ کیونکہ یہ امور دو قسموں پر ہیں: ان میں سے کچھ وہ ہیں جن کے اسماء کا لفظی اطلاق ذات الٰہی (الجناب الإلهي) پر وارد ہوا ہے، اور کچھ وہ ہیں جن کے آثار پائے گئے لیکن ان پر کوئی نام نہیں رکھا گیا، اور کچھ وہ ہیں جن کا فعل اللہ کی طرف منسوب کیا گیا لیکن ان پر کوئی نام نہیں رکھا گیا، اور کچھ وہ ہیں جن پر ایک گروہ میں تضمن (تضمین) کے حکم سے نام کا اطلاق کیا گیا۔ پس جس کی طرف فعل منسوب کیا گیا لیکن نام کا اطلاق نہیں کیا گیا، اس کی مثال اللہ کا یہ قول ہے: **(الله يَسْتَهْزِئُ بِهِمْ)** \"اللہ ان سے استہزاء کرتا ہے۔\" اور اس کا یہ قول: **(سَخِرَ الله مِنْهُمْ)** \"اللہ نے ان سے تمسخر کیا۔\" اور جس کی طرف فعل منسوب کیا گیا اور ایک گروہ میں تضمن کے حکم سے نام کا اطلاق کیا گیا، اس کی مثال اس کا یہ قول ہے: **(ومَكَرَ الله والله خَيْرُ الْماكِرِينَ)** \"اور اللہ نے بھی خفیہ تدبیر کی، اور اللہ سب سے بہتر خفیہ تدبیر کرنے والا ہے۔\" اور جس پر نام کا اطلاق کیا گیا، اس کی مثال اس کا یہ قول ہے: **(وهُوَ خادِعُهُمْ)** \"اور وہ انہیں دھوکہ دینے والا ہے۔\" اور جس کے آثار پائے گئے لیکن اس پر نہ نام کا اطلاق کیا گیا اور نہ فعل کا، اس کی مثال اس کا یہ قول ہے: **(عَجَّلْنا لَهُ فِيها ما نَشاءُ)** \"ہم نے اس کے لیے اس میں جلدی کر دی جو ہم نے چاہا۔\"",
    "fa": "باب صد و هفدهم در مقام شره و حرص در زیاده‌خواهی بر اکتفا\n\nهرگز به چیزی جز او (خداوند) قناعت مکن،\nو حریص باش، زیرا تو بر شره سرشته شده‌ای.\n\nو بر طلب مقام والا حریص باش تا به آن دست یابی،\nزیرا کسی که از آن غافل است (خوابیده) مانند کسی که بیدار است نیست.\n\nهمانا حلال، حلالی است که به آن اطمینان داشته باشی،\nو مال حرام مانند مال شبهه‌ناک نیست.\n\n### [شره و حرص دو سرشت در فطرت انسان هستند]\n\nبدان، خداوند تو را تأیید کند، که این دو صفت بر انسان بما هو انسان سرشته شده‌اند، و هر آنچه انسان بر آن سرشته شده، زوالش محال است. پس این یک مقام (مقام) است نه یک حال (حال)، زیرا ثابت است. و نکوهش از جهت متعلق آن وارد می‌شود، اگر شرعاً و عقلاً مذموم باشد. خداوند متعال می‌فرماید: «وَلَتَجِدَنَّهُمْ أَحْرَصَ النَّاسِ عَلى‏ حَياةٍ» (و قطعاً آنان را حریص‌ترین مردم بر زندگی خواهی یافت). و پیامبر (صلی الله علیه و سلم) فرمود: «زادك الله حرصا ولا تعد» (خداوند حرص تو را بیفزاید و بازنگرد).\n\nپس آیه متوجه دو سوی ستایش و نکوهش است، اگر ضمیری که در قول اوست «وَلَتَجِدَنَّهُمْ» نبود، زیرا آن ضمیر به قومی نکوهیده بازمی‌گردد. و قرینه حال دلالت دارد بر اینکه جهت حرص در آن آیه، نکوهش است، به جهت تکذیب ادعای آنان که سرای آخرت را مخصوص خودشان و نه دیگر مردم می‌دانستند. پس کسی که در اینجا به حرص به عنوان دلیلی بر دروغگویی آنان بنگرد، در مورد آنان ستوده است، زیرا آن دلیلی الهی بر کذب ایشان است. پس این از جانب الحق (الحق) در مورد آنان، حجتی علیه ایشان برای خداوند است، و «وَلِلَّهِ الْحُجَّةُ الْبالِغَةُ» (و حجت رسا از آنِ خداست). و نکوهیده آن است که از هر جهت نکوهیده باشد، از آن حیث که در ایشان است نه از حیث دلالتش بر علیه آنان، و متعلق آن چیزی باشد که فانی می‌شود و تکذیب صادق باشد، که این مذموم است. اما در حدیثی که آوردیم، آن حرص ستوده است، زیرا حرص بر ادای عبادتی واجب است.\n\n### [شره و حرص از صفات وارث، مدبر امت هستند]\n\nعلاوه بر این، این دو صفت از صفات عالم وارث (الوارث) کامل (المكمل) هستند که مدبر امت است. او به آنچه صلاح امت در آن است می‌نگرد، چنانکه خداوند در مدح پیامبرش (صلی الله علیه و سلم) فرمود: «حَرِيصٌ عَلَيْكُمْ» (بر شما حریص است). پس او را به حرص بر آنچه امتش با آن سعادتمند می‌شود ستود، و شره و حرص او بر اسلام آوردن عمویش ابوطالب، تا جایی که به او فرمود: آن را در گوش من بگو تا برایت به آن شهادت دهم.\n\nزیرا می‌دانست که شهادتش پذیرفته و کلامش شنیده می‌شود. پس انسان کامل (الکامل)، که نایب خداوند در میان بندگان است، حوادث نوظهور زمان را می‌شناسد و از طریق امری که به او امکان آگاهی از نزول آن حوادث را داده، برای آن‌ها آماده می‌شود. پس کسی که علم ندارد گمان می‌کند که او برای حق خود تلاش کرده است، در حالی که چنین نیست، و در عین حال چنین است؛ زیرا او به پیروان امتش بر دیگر امت‌ها مباهات می‌کند، پس خواهان کثرت مؤمنان بود.\n\n### [دو شرط حرص و شره وارث کامل (المكمل)]\n\nاما این شره نیازمند وجود دو شرط است: آگاهی (الاطلاع) و امر الهی (الأمر الإلهي)، که شرط اعظم است. و اما آگاهی، اگرچه شرط است، اما شرطی ضعیف است، زیرا تنها برای کسی شرط می‌شود که ادعا کند برای دیگری ذخیره می‌کند و سپس از آن ذخیره برای خود برمی‌دارد. به او گفته می‌شود: آیا خداوند تو را بر کسی که این ذخیره نزد تو برای اوست آگاه کرده است؟ و آیا آگاه شده‌ای که این ذخیره جز به دست تو به آن‌ها نمی‌رسد؟ اگر بگوید بله، ذخیره‌سازی او پذیرفته می‌شود. و اگر بگوید نه، به او گفته می‌شود: پس حرص تو بر اصلی که قطع به صحت آن باشد استوار نیست و خلل در آن راه یافته است.\n\nاگر گفته شود: گروهی گفته‌اند هر کس توکلش (التوکل) در حق خودش صحیح باشد، توکلش در حق دیگری نیز صحیح است. می‌گوییم: این صحیح است و با حال این شخص حریص بر کسب و ذخیره‌سازی و رقابت با دنیاطلبان که توکلی بر آن ندارند، منافاتی ندارد. زیرا توکل امری باطنی است و آن اعتماد بر خداوند است. اگر اعتماد این ذخیره‌کننده بر چیزی باشد که ذخیره کرده، این با توکل منافات دارد. و اگر بر آن اعتماد نکرده باشد، منافاتی ندارد، اما با تجرید (التجرید) ظاهری و قطع اسباب منافات دارد. و این از احوال انسان‌های کامل (المكملین) نیست، بلکه از احوال سالکان (السالکین) است تا آنچه را که به صورت عقد (باور) پذیرفته‌اند، به صورت ذوق (الذوق) برایشان حاصل شود. زیرا ذوق در تمکن کامل‌تر است، چرا که اضطراب را در هنگام نبود سببی که نفس عادت به آرامش با آن دارد، از بین می‌برد. و تحقیق این مطلب ان‌شاءالله پس از این در مقام توکل (مقام التوکل) خواهد آمد.\n\n### [درجات شره و حرص نزد عارفان]\n\nو به همین دلیل، این شره و حرص نزد عارفان (العارفین)، چه از اهل ادب و وقوف باشند و چه از اهل انس و وصال (الوصال)، هشتصد و شصت و پنج درجه دارند. و نزد ملامتیه (الملامتیة)، چه ملامتی از اهل انس و وصال باشد و چه از اهل ادب و وقوف، هشتصد و سه درجه دارند. و اگر عارفان از اهل اسرار (الأسرار) باشند، برایشان هزار و پانصد و سی و پنج درجه است، و اگر از اهل انوار (الأنوار) باشند، برایشان هشتصد و شصت و پنج درجه است. و اگر ملامتیه از اهل اسرار باشند، برایشان هزار و چهارصد و هفتاد و سه درجه است، و اگر از اهل انوار باشند، برایشان هشتصد و سه درجه است.\n\n### [نعوت الهی که صرفاً افعال هستند و آنهایی که دارای اسماء می‌باشند]\n\nو آن (شره) نعت (صفت) الهی است، زیرا خداوند می‌فرماید: «عَجَّلْنا لَهُ فِيها ما نَشاءُ لِمَنْ نُرِيدُ» (هر آنچه را بخواهیم، برای هر کس که بخواهیم، در آن [دنیا] شتابان فراهم می‌سازیم). و همچنین حرص نیز نعت الهی است و آن چیزی است که مقتضای قول خداوند به فرشتگانش در مورد کسانی که با هم دشمنی دارند، می‌باشد: «به این دو بنگرید تا با هم صلح کنند.»\n\nو تسخیر فرشتگان در حق مؤمنان برای استغفار و دعا کردن برای آنان، این از ثمره آن است، اگرچه اطلاق لفظی آن وارد نشده باشد. زیرا این امور بر دو بخش هستند: برخی از آن‌ها که اطلاق لفظی اسماءشان بر ساحت الهی وارد شده است، و برخی که آثارشان یافت شده اما اسمی از آن‌ها بر خداوند اطلاق نشده است، و برخی که فعلی که از آن‌ها ناشی می‌شود به او نسبت داده شده اما اسمی از آن بر او اطلاق نشده است، و برخی که اسمی از آن در جمعی به حکم تضمین بر او اطلاق شده است.\n\nمانند آنچه که فعل به او نسبت داده شده و اسم اطلاق نشده، قول خداوند است: «الله يَسْتَهْزِئُ بِهِمْ» (خداوند آنان را استهزا می‌کند) و قول او: «سَخِرَ الله مِنْهُمْ» (خداوند آنان را مسخره کرد). و مانند آنچه که فعل به او نسبت داده شده و اسم در جمعی به حکم تضمین بر او اطلاق شده، قول اوست: «وَمَكَرَ الله وَالله خَيْرُ الْماكِرِينَ» (و خداوند مکر کرد و خداوند بهترین مکرکنندگان است). و مانند آنچه که اسمی از آن بر او اطلاق شده، قول اوست: «وَهُوَ خادِعُهُمْ» (و او فریب‌دهنده آن‌هاست). و مانند آنچه که آثارش یافت شده اما نه اسم و نه فعلی از آن بر او اطلاق نشده، قول اوست: «عَجَّلْنا لَهُ فِيها ما نَشاءُ» (هر آنچه را بخواهیم، برای او در آن شتابان فراهم می‌سازیم)."
  },
  "page_count": 2
}