{
  "id": 502,
  "title": {
    "ar": "الباب الثاني وخمسمائة في معرفة حال قطب كان منزله لا تَخُونُوا الله والرَّسُولَ وتَخُونُوا أَماناتِكُمْ وأَنْتُمْ تَعْلَمُونَ",
    "en": "Chapter Five Hundred and Two: Concerning the knowledge of the spiritual state of a Pole (قطب) whose station was [the meaning of the verse]: \"Do not betray Allah and the Messenger, nor betray your trusts while you know.\" (Quran 8:27)",
    "ur": "باب پانچ سو دو: ایک قطب (قطب) کے حال کی معرفت (معرفت) میں، جس کا روحانی مقام یہ آیت تھی: \"لَا تَخُونُوا اللَّهَ وَالرَّسُولَ وَتَخُونُوا أَمَانَاتِكُمْ وَأَنتُمْ تَعْلَمُونَ\" (اللہ اور رسول سے خیانت نہ کرو اور نہ اپنی امانتوں میں خیانت کرو جبکہ تم جانتے ہو۔) (سورۃ الأنفال، ۸:۲۷)",
    "fa": "باب پانصد و دوم در معرفت حال قطبی که منزل او [آیه] «به خدا و پیامبر خیانت نکنید و به امانت‌های خود خیانت نورزید در حالی که می‌دانید» بود."
  },
  "content": {
    "ar": "## «الباب الثاني وخمسمائة في معرفة حال قطب كان منزله لا تَخُونُوا الله والرَّسُولَ وتَخُونُوا أَماناتِكُمْ وأَنْتُمْ تَعْلَمُونَ»\n\n\n> لا تخونوا الله إن كنتم له *** والأمانات كذاكم لا تخان‏\n\n\n> لا تكن بالحمل إن حملتها *** دون أمر جاهلا ليس تعان‏\n\n\n> كل من حملها يحملها *** بأمان فالأمانات أمان‏\n\n\n> ولها حق على حاملها *** ليس يدري ذاك إلا ذو عيان‏\n\n\n> فيؤديها كما قال لنا *** في الكتاب الحق من قال فكان‏\n\n\n> ذا كم الله تعالى جده *** في يراع ولسان وجنان‏\n\n\n### [الخيانات ثلاث‏]\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم موصيا لا تسألوا الإمارة فإنك إن أعطيتها من غير سؤال أعنت عليها وإن أعطيتها عن سؤال لم تعن عليها\n\n\nفالخيانة ثلاث أعني الذين يخانون خيانة الله وخيانة الرسول وخيانة الأمانات وما أيه الله في هذه الخيانات إلا بالمؤمنين فإن كنت مؤمنا فأنت المخاطب فأما خيانة الله في أمانته وخيانة الرسول وخيانة الأمانات فإنا أذكرها إن شاء الله تعالى لما قال الله تعالى إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ فَأَبَيْنَ أَنْ يَحْمِلْنَها لأنها كانت عرضا لا أمرا وأَشْفَقْنَ مِنْها وحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً جَهُولًا يريد ظلوما\nلنفسه جهولا بقدر ما حمل قال لنا تعالى لما حملناها إِنَّ الله يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى‏ أَهْلِها وما حملها أحد من خلق الله إلا الإنسان فلا يخلو ما أن يحملها عرضا أو جبرا فإن حملها عرضا فقد خاطر بنفسه وإن حملها جبرا فإنه مؤد لها على كل حال ولا بد\n\n\n### [إن الله أمرنا أن نؤدي الأمانات إلى أهلها]\n\n\nواعلم أن أهل الأمانات الذين أمرنا الله أن نوديها إليهم ليس المعتبر من أعطاها ولا بد وإنما أهلها من تؤدي إليه فإن كان الذي أعطاها بنية أن تؤدي إليه في وقت آخر فهو أهلها من حيث ما تؤدي إليه لا من حيث إنه أعطاها وإن أعطاها هذا الأمين المؤتمن إلى من أعطاه إياها ليحملها إلى غيره فذلك الغير هو أهلها لا من أعطى فقد أعلمك بالأهلية فيها فإن الحق إنما هو لمن يستحقه فاعلم ذلك واعمل عليه‏\n\n\n### [إن الرسالة أمانة من الله‏]\n\n\nواعلم بأن الله قد أعطاك أمانة أخرى لتردها إليه كما أعطاك أمانة لتوصلها إلى غيرك لا تردها إليه كالرسالة فإن الله يقول يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ من رَبِّكَ وإِنْ لَمْ تَفْعَلْ فَما بَلَّغْتَ رِسالَتَهُ وقال ما عَلَى الرَّسُولِ إِلَّا الْبَلاغُ وأما ما يرد إليه عز وجل من الأمانات فهو كل علم آمنك عليه من العلوم التي إذا ظهرت بها في العموم ضل به من لا يسمعه منك بسمع الحق فإذا حصل لك مثل هذا العلم ورأيت من كان الحق سمعه وبصره وجميع قواه وليس له هذا العلم فأداه إليه فإنه ما يسمعه منك إلا بسمع الحق فالحق على الحقيقة هو الذي سمع فرددت الأمانة إليه تعالى وهو الذي أعطاكها وحصلت لهذا الشخص الذي الحق سمعه فائدة لم يكن يعلمها ولكن حامل هذه الأمانة إن لم يكن عالما بأن هذا ممن يكون صفته أن يكون الحق سمعه وإلا فهو ممن خان الله وقد نهاه الله أن يخون الله وكذلك أيضا من خيانة من أطلعه الله على العلم بأن العالم وجوده وجود الحق ثم تصرف فيه بتعدي حد من حدود الله يعلم أنه متعد فيه فإن الله في هذا الحال هو عين الأمانة في وجوده عند أهل الحجاب سواء علم ذلك شرعا أو عقلا فقد خان الله في تصرفه باعتقاده التعدي ومن يَتَعَدَّ حُدُودَ الله فَقَدْ ظَلَمَ نَفْسَهُ وحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً جَهُولًا وكذلك من خان الله في أهل الله فقد خان الله وكل أمر بيدك أمرك الله فيه إن ترده إليه فلم تفعل فذلك من خيانة الله والله يقول وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ وأما خيانة من خان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فهي فيما أعطاك الله من الآداب أن تعامل به رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وهذه المعاملة هي عين أدائها إليه صَلَّى اللهُ عَليهِ وسَلَّم فإذا لم تتأدب معه فما أديت أمانته إليه فقد خنت رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فيما أمنك الله عليه من ذلك ومن خيانتك رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ما سألك فيه من المودة في قرابته وأهل بيته فإنه وأهل بيته على السواء في مودتنا فيهم فمن كره أهل بيته فقد كرهه فإنه صَلَّى اللهُ عَليهِ وسَلَّم واحد من أهل البيت ولا يتبعض حب أهل البيت فإن الحب ما تعلق إلا بالأهل لا بواحد بعينه فاجعل بالك وأعرف قدر أهل البيت فمن خان أهل البيت فقد خان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ومن خان ما سنه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فقد خانه صَلَّى اللهُ عَليهِ وسَلَّم في سنته ولقد أخبرني الثقة عندي بمكة قال كنت أكره ما تفعله الشرفاء بمكة في الناس فرأيت في النوم فاطمة بنت رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وهي معرضة عني فسلمت عليها وسألتها عن إعراضها فقالت إنك تقع في الشرفاء فقلت لها يا سيدتي أ لا ترين إلى ما يفعلون في الناس فقالت أ ليس هم بنى فقلت لها من الآن وتبت فأقبلت علي واستيقظت‏\n\n\n> فلا تعدل بأهل البيت خلقا *** فأهل البيت هم أهل السيادة\n\n\n> فبغضهم من الإنسان خسر *** حقيقي وحبهم عبادة\n\n\nومن خيانتك رسول الله صَلَّى اللهُ عَليهِ وسَلَّم المفاضلة بين الأنبياء والرسل سلام الله عليهم مع علمنا بأن الله فضل بعضهم على بعض كما قال تعالى ولَقَدْ فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ وقال تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ فله سبحانه أن يفضل بين عباده بما شاء وليس لنا ذلك فإنا لا نعلم ذلك إلا بإعلامه فإن ذلك راجع إلى ما في نفس الحق سبحانه منهم ولا يعلم أحد ما في نفس الحق كما قال عيسى عليه السلام تَعْلَمُ ما في نَفْسِي ولا أَعْلَمُ ما في نَفْسِكَ إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ ولا دخول هنا للمراتب الظاهرة والتحكم وقد نهى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أن نفضل بين الأنبياء وأن نفضله صَلَّى اللهُ عَليهِ وسَلَّم عليهم إلا بإعلامه أيضا وعين يونس عليه السلام وغيره فمن فضل من غير إعلام الله فقد خان رسول الله ص‏\nوتعدى ما حده له رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وأما خيانة الأمانات فيتناولها\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم لا تعطوا الحكمة غير أهلها فتظلموها ولا تمنعوها أهلها فتظلموهم‏\n\n\nوالخيانة ظلم فالحكمة أمانة وخيانتها أن تعطيها غير أهلها وأنت تعلم أنه غير أهلها فرفع الله الحرج عمن لا يعلم إلا أنه أمره بأن يتعرض لتحصيل العلم بالأمور فلا عذر له في التخلف عن ذلك فمن خان فيه قبل حصول العلم وهو متعمل في حصول العلم ودعاه الوقت إلى ذلك التصريف الخاص المسمى خيانة فإنه غير مؤاخذ بتلك الخيانة ولا بالتفريط فإنه في حال التعمل لتحصيل العلم والوقت حكم بما وقع به التصرف فمن كان له هذا الذكر فإنه تحصل له به العصمة من الخيانة ويطلعه على العلم بالأهلية في كل أمانة بعناية هذا الذكر والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\n> إني خصصت بسر ليس يعلمه *** إلا أنا والذي في الشرع نتبعه‏\n\n\n> هو النبي رسول الله خير فتى *** بالله نتبعه فيما يشرعه‏\n\n",
    "en": "Chapter Five Hundred and Two: Concerning the Knowledge of the State of a Pole (قطب) Whose Station Was: <<Do not betray Allah and the Messenger, nor betray your trusts while you know>>.\n\n> Do not betray Allah if you belong to Him,\n> And likewise, the trusts (أمانات) must not be betrayed.\n\n> Do not be ignorant of the burden if you carry it\n> Without command, for you will not be aided.\n\n> Everyone who carries it bears it\n> With security (أمان), for the trusts are security.\n\n> And it has a right upon its bearer,\n> Which none knows save the one who possesses direct witnessing (عيان).\n\n> So he renders it as He told us\n> In the Book, the Truth (الحق), He who spoke and it came to be.\n\n> That is Allah, exalted is His Majesty,\n> In the pen, the tongue, and the heart.\n\n### [The Three Betrayals]\n\nThe Messenger of Allah, may Allah bless him and grant him peace, said, advising: \"Do not ask for authority (الإمارة), for if you are given it without asking, you will be aided in it; but if you are given it because of asking, you will not be aided in it.\"\n\nThe betrayals are three, meaning those who commit the betrayal of Allah, the betrayal of the Messenger, and the betrayal of the trusts (أمانات). Allah only addressed the believers (المؤمنين) concerning these betrayals. If you are a believer, then you are the one being addressed.\n\nAs for the betrayal of Allah in His trust, the betrayal of the Messenger, and the betrayal of the trusts, I shall mention them, if Allah the Exalted wills. This relates to when Allah the Exalted said: <<إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ فَأَبَيْنَ أَنْ يَحْمِلْنَها>> (Indeed, We offered the Trust (الأمانة) to the heavens and the earth and the mountains, but they refused to bear it), because it was an offer (عرضًا), not a command (أمرًا). <<وأَشْفَقْنَ مِنْها وحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً جَهُولًا>> (And they feared it, and man carried it. Indeed, he was unjust (ظلومًا) and ignorant (جهولًا)). He means unjust to himself, ignorant of the measure of what he carried.\n\nThe Exalted said to us when we carried it: <<إِنَّ الله يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى‏ أَهْلِها>> (Indeed, Allah commands you to render the trusts (أمانات) to their rightful owners). None of Allah’s creation carried it except the human (الإنسان). Thus, he either carries it by offer (عرضًا) or by compulsion (جبرًا). If he carries it by offer, he has risked his soul. But if he carries it by compulsion, he must render it in any case, inevitably.\n\n### [Indeed, Allah commanded us to render the trusts to their rightful owners]\n\nKnow that the rightful owners (أهل الأمانات) to whom Allah commanded us to render the trusts are not necessarily the ones who gave them. Rather, the rightful owner is the one to whom you render it. If the one who gave it intended that you render it to him at a later time, then he is the rightful owner from the perspective of the rendering, not from the perspective of his giving it. And if this trustworthy custodian (الأمين المؤتمن) gave it to someone else to carry it to a third party, then that third party is the rightful owner, not the one who gave it. Thus, He has informed you of the eligibility (الأهلية) concerning it, for the right (الحق) belongs only to the one who deserves it. Know this and act upon it.\n\n### [Indeed, the Message is a trust from Allah]\n\nKnow that Allah has given you another trust (أمانة) to return to Him, just as He gave you a trust to deliver to others, which you do not return to Him, such as the Message (الرسالة). For Allah says: <<يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ من رَبِّكَ وإِنْ لَمْ تَفْعَلْ فَما بَلَّغْتَ رِسالَتَهُ>> (O Messenger, convey that which has been revealed to you from your Lord; and if you do not, then you have not conveyed His message). And He said: <<ما عَلَى الرَّسُولِ إِلَّا الْبَلاغُ>> (The Messenger is only responsible for the clear conveyance).\n\nAs for the trusts that are returned to Him, the Mighty and Majestic, they consist of every knowledge (علم) He entrusted you with—knowledge which, if you revealed it publicly, would cause those who do not hear it from you with the hearing of the Real (سمع الحق) to go astray. If you acquire such knowledge and see someone whose hearing, sight, and all his faculties are the Real (الحق), yet he does not possess this knowledge, then render it to him. For he will only hear it from you with the hearing of the Real. Thus, the Real, in reality, is the one who heard, and you have returned the trust to Him, the Exalted, who is the one who gave it to you. And this person, whose hearing is the Real, has gained a benefit he did not previously know.\n\nHowever, if the bearer of this trust does not know that this person is one whose attribute is that the Real is his hearing, then he is among those who have betrayed Allah. And Allah has forbidden him to betray Allah.\n\nLikewise, among the betrayals is that committed by one whom Allah has informed with the knowledge (علم) that the existence (وجود) of the world (العالم) is the existence of the Real (وجود الحق), yet he acts in it by transgressing a limit (حد) set by Allah, knowing that he is transgressing. For in this state, Allah is the very essence of the trust (عين الأمانة) in His existence (وجود) according to the People of the Veil (أهل الحجاب). Whether he knows this legally (شرعًا) or rationally (عقلًا), he has betrayed Allah in his action by believing in the transgression. <<ومن يَتَعَدَّ حُدُودَ الله فَقَدْ ظَلَمَ نَفْسَهُ>> (And whoever transgresses the limits of Allah has certainly wronged himself). <<وحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً جَهُولًا>> (And man carried it. Indeed, he was unjust (ظلومًا) and ignorant (جهولًا)).\n\nLikewise, whoever betrays Allah concerning the People of Allah (أهل الله) has betrayed Allah. And every matter in your hand concerning which Allah commanded you to return it to Him, if you fail to do so, that is a betrayal of Allah. And Allah says: <<وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him is returned the whole affair).\n\nAs for the betrayal of the one who betrays the Messenger of Allah, may Allah bless him and grant him peace, it lies in the manners (الآداب) Allah gave you with which to treat the Messenger of Allah, may Allah bless him and grant him peace. This treatment is the very essence of rendering the trust to him, may Allah bless him and grant him peace. If you do not observe proper manners with him, you have not rendered his trust to him, and thus you have betrayed the Messenger of Allah, may Allah bless him and grant him peace, concerning what Allah entrusted you with in that regard.\n\nAmong your betrayals of the Messenger of Allah, may Allah bless him and grant him peace, is what he asked of you concerning affection (المودة) for his relatives and the People of his House (أهل بيته). For he and the People of his House are equal in our affection for them. Whoever dislikes the People of his House has disliked him. For he, may Allah bless him and grant him peace, is one of the People of the House, and the love of the People of the House cannot be fragmented. For affection is attached only to the Family (الأهل), not to one specific individual. Pay attention and know the worth of the People of the House, for whoever betrays the People of the House has betrayed the Messenger of Allah, may Allah bless him and grant him peace. And whoever betrays what the Messenger of Allah, may Allah bless him and grant him peace, established as a Sunnah, has betrayed him, may Allah bless him and grant him peace, in his Sunnah.\n\nIndeed, a trustworthy person (الثقة) informed me in Mecca, saying: \"I used to dislike what the *Shurafa* (descendants of the Prophet) in Mecca did to the people. Then I saw in a dream Fatima, the daughter of the Messenger of Allah, may Allah bless him and grant him peace, and she was turning away from me. I greeted her and asked her about her turning away. She said: 'You speak ill of the *Shurafa*.' I said to her: 'O my mistress, do you not see what they do to the people?' She replied: 'Are they not my children?' I said to her: 'From now on, I repent.' Then she turned toward me, and I awoke.\"\n\n> So do not equate any creation with the People of the House,\n> For the People of the House are the People of Sovereignty (السيادة).\n\n> Disliking them is a true loss for a person,\n> And loving them is worship.\n\nAmong your betrayals of the Messenger of Allah, may Allah bless him and grant him peace, is making distinctions of superiority (المفاضلة) between the Prophets and Messengers, peace be upon them, even though we know that Allah has favored some of them over others, as the Exalted said: <<ولَقَدْ فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ>> (And We have certainly favored some of the prophets over others). And He said: <<تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ>> (Those are the Messengers; We favored some of them over others). So, it is for Him, the Glorified, to favor between His servants as He wills, but it is not for us to do so. For we do not know this except by His informing us. For that refers back to what is in the Essence (نفس) of the Real (الحق), the Glorified, concerning them. And no one knows what is in the Essence of the Real, as Jesus, peace be upon him, said: <<تَعْلَمُ ما في نَفْسِي ولا أَعْلَمُ ما في نَفْسِكَ إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ>> (You know what is in my soul, and I do not know what is in Your Soul. Indeed, You are the Knower of the unseen). There is no room here for apparent levels (المراتب الظاهرة) or arbitrary judgment. The Messenger of Allah, may Allah bless him and grant him peace, forbade us from making distinctions of superiority between the Prophets, and from favoring him, may Allah bless him and grant him peace, over them, except also by His informing us, and specifically mentioning Jonah (يونس), peace be upon him, and others. So, whoever makes a distinction of superiority without Allah’s informing him has betrayed the Messenger of Allah and transgressed the limit set for him by the Messenger of Allah, may Allah bless him and grant him peace.\n\nAs for the betrayal of the trusts (الأمانات), it is covered by his saying, may Allah bless him and grant him peace: \"Do not give wisdom (الحكمة) to those who are not worthy of it, lest you wrong it; and do not withhold it from those who are worthy of it, lest you wrong them.\"\n\nAnd betrayal is injustice (ظلم). Thus, wisdom is a trust (أمانة). And its betrayal is that you give it to one who is not worthy of it, while you know that he is not worthy of it. Allah has removed the blame from the one who does not know, except that He commanded him to expose himself to the acquisition of knowledge (العلم) concerning matters, so he has no excuse for failing to do so. So, whoever commits betrayal before acquiring knowledge, while he is striving to acquire that knowledge, and the moment calls him to that specific action called betrayal, he is not held accountable for that betrayal or for the negligence. For he is in the state of striving to acquire knowledge, and the moment dictated the action that occurred. Whoever possesses this remembrance (الذكر) will achieve thereby immunity (العصمة) from betrayal, and it will inform him of the worthiness (الأهلية) concerning every trust, through the care of this remembrance. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth (الحق), and He guides to the way).\n\n> I have been singled out with a secret that none knows\n> Except me and the one whom we follow in the Law (الشرع).\n\n> He is the Prophet, the Messenger of Allah, the best youth,\n> By Allah, we follow him in what he legislates.",
    "ur": "باب نمبر پانچ سو دو: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اللہ اور رسول سے خیانت نہ کرو اور نہ اپنی امانتوں میں خیانت کرو جبکہ تم جانتے ہو\" (لَا تَخُونُوا الله والرَّسُولَ وتَخُونُوا أَماناتِكُمْ وأَنْتُمْ تَعْلَمُونَ)۔\n\nاگر تم اللہ کے لیے ہو تو اللہ سے خیانت نہ کرو،\nاور اسی طرح امانتوں میں بھی خیانت نہیں کی جاتی۔\n\nاگر تم نے اسے (امانت کو) بغیر حکم کے اٹھا لیا،\nتو بوجھ کے ساتھ جاہل نہ بنو، تمہیں مدد نہیں ملے گی۔\n\nہر وہ شخص جو اسے اٹھاتا ہے، وہ امان کے ساتھ اٹھاتا ہے،\nپس امانتیں امان ہیں۔\n\nاور اس (امانت) کا اس کے اٹھانے والے پر حق ہے،\nیہ بات صرف صاحبِ مشاہدہ (ذو عيان) ہی جانتا ہے۔\n\nپس وہ اسے اسی طرح ادا کرتا ہے جیسا کہ اس ذات حق نے ہمیں کتاب میں فرمایا،\nجس نے کہا اور وہ ہو گیا۔\n\nیہ ہے اللہ تعالیٰ کی عظمت (تعالى جده)، قلم، زبان اور دل میں۔\n\n### [خیانتیں تین ہیں]\n\nرسول اللہ صلی اللہ علیہ وسلم نے نصیحت کرتے ہوئے فرمایا: \"امارت (سرداری) طلب نہ کرو، کیونکہ اگر تمہیں یہ بغیر مانگے دی گئی تو تمہیں اس پر مدد دی جائے گی، اور اگر تم نے اسے مانگ کر حاصل کیا تو تمہیں اس پر مدد نہیں دی جائے گی۔\"\n\nپس خیانتیں تین ہیں، یعنی وہ جو خیانت کرتے ہیں: اللہ کی خیانت، رسول کی خیانت، اور امانتوں کی خیانت۔ اور اللہ نے ان خیانتوں میں صرف مؤمنین کو مخاطب کیا ہے۔ پس اگر تم مؤمن ہو تو تم ہی مخاطب ہو۔\n\nجہاں تک اللہ کی امانت میں خیانت، رسول کی خیانت، اور امانتوں کی خیانت کا تعلق ہے، تو میں ان کا ذکر کروں گا، ان شاء اللہ تعالیٰ، اس فرمانِ الٰہی کی روشنی میں: \"بے شک ہم نے امانت کو آسمانوں، زمین اور پہاڑوں پر پیش کیا، تو انہوں نے اسے اٹھانے سے انکار کر دیا\" (إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ فَأَبَيْنَ أَنْ يَحْمِلْنَها) کیونکہ یہ پیشکش تھی، حکم نہیں تھا، \"اور وہ اس سے ڈر گئے\" (وأَشْفَقْنَ مِنْها) \"اور اسے انسان نے اٹھا لیا، بے شک وہ بڑا ظالم، بڑا جاہل ہے\" (وحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً جَهُولًا)۔ اس سے مراد یہ ہے کہ وہ اپنی جان پر ظلم کرنے والا ہے، اور اس بوجھ کی قدر و قیمت سے جاہل ہے جو اس نے اٹھایا۔\n\nجب ہم نے اسے اٹھا لیا تو ذات حق (اللہ تعالیٰ) نے ہمیں فرمایا: \"بے شک اللہ تمہیں حکم دیتا ہے کہ تم امانتیں ان کے اہل (مستحقین) کو ادا کرو\" (إِنَّ الله يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى‏ أَهْلِها)۔ اور اللہ کی مخلوق میں سے انسان کے سوا کسی نے اسے نہیں اٹھایا۔ پس یہ صورت حال خالی نہیں کہ یا تو وہ اسے پیشکش کے طور پر اٹھائے یا جبر کے طور پر۔ اگر اس نے اسے پیشکش کے طور پر اٹھایا تو اس نے اپنی جان کو خطرے میں ڈالا، اور اگر اس نے اسے جبر کے طور پر اٹھایا تو وہ بہرحال اسے ادا کرنے والا ہے اور یہ ضروری ہے۔\n\n### [بے شک اللہ نے ہمیں حکم دیا ہے کہ ہم امانتیں ان کے اہل کو ادا کریں]\n\nاور جان لو کہ امانتوں کے اہل (مستحقین) جنہیں اللہ نے ہمیں ادا کرنے کا حکم دیا ہے، ضروری نہیں کہ وہ وہی ہوں جس نے امانت دی ہو۔ بلکہ اس کے اہل وہ ہیں جنہیں تم ادا کرتے ہو۔ پس اگر دینے والے نے اس نیت سے دی کہ تم اسے کسی دوسرے وقت میں اسی کو ادا کرو گے، تو وہ اس لحاظ سے اہل ہے کہ تم اسے ادا کر رہے ہو، نہ کہ اس لحاظ سے کہ اس نے تمہیں دی تھی۔ اور اگر اس امین (مؤتمن) نے وہ امانت اسے دی جس نے اسے دی تھی تاکہ وہ اسے کسی اور تک پہنچائے، تو وہ دوسرا شخص ہی اس کا اہل ہے، نہ کہ وہ جس نے دی تھی۔ پس اس نے تمہیں اس میں اہلیت کے بارے میں آگاہ کر دیا ہے۔ کیونکہ حق صرف اسی کا ہے جو اس کا مستحق ہو، پس یہ جان لو اور اسی پر عمل کرو۔\n\n### [بے شک رسالت اللہ کی طرف سے ایک امانت ہے]\n\nاور جان لو کہ اللہ نے تمہیں ایک اور امانت دی ہے تاکہ تم اسے اسی کی طرف لوٹاؤ، جیسا کہ اس نے تمہیں ایک امانت دی ہے تاکہ تم اسے کسی اور تک پہنچاؤ اور اسے اللہ کی طرف نہ لوٹاؤ، جیسے کہ رسالت۔ کیونکہ اللہ فرماتا ہے: \"اے رسول! جو کچھ آپ کے رب کی طرف سے آپ پر نازل کیا گیا ہے، اسے پہنچا دیجیے، اور اگر آپ نے ایسا نہ کیا تو آپ نے اس کا پیغام نہیں پہنچایا\" (يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ من رَبِّكَ وإِنْ لَمْ تَفْعَلْ فَما بَلَّغْتَ رِسالَتَهُ)۔ اور فرمایا: \"رسول پر صرف پہنچا دینا ہے\" (ما عَلَى الرَّسُولِ إِلَّا الْبَلاغُ)۔\n\nاور جہاں تک ان امانتوں کا تعلق ہے جو اللہ عز و جل کی طرف لوٹائی جاتی ہیں، تو وہ ہر وہ علم ہے جس پر اس نے تمہیں امین بنایا ہے، ان علوم میں سے جو اگر عام لوگوں میں ظاہر کیے جائیں تو وہ شخص گمراہ ہو جائے گا جو اسے تم سے \"سمع الحق\" (ذات حق کی سماعت) کے ذریعے نہیں سنتا۔ پس جب تمہیں ایسا علم حاصل ہو جائے اور تم کسی ایسے شخص کو دیکھو جس کی سماعت، بصارت اور تمام قوتیں ذات حق (الحق) ہوں، اور اسے یہ علم حاصل نہ ہو، تو تم اسے یہ علم ادا کر دو۔ بے شک وہ اسے تم سے صرف \"سمع الحق\" (ذات حق کی سماعت) کے ذریعے ہی سنے گا۔ پس حقیقت میں ذات حق (الحق) ہی وہ ہے جس نے سنا، اور تم نے امانت اسی کی طرف لوٹا دی، اور وہی ہے جس نے تمہیں یہ امانت دی تھی۔ اور اس شخص کو، جس کی سماعت ذات حق (الحق) ہے، ایک ایسا فائدہ حاصل ہوا جو وہ نہیں جانتا تھا۔ لیکن اس امانت کو اٹھانے والا اگر یہ نہ جانتا ہو کہ یہ شخص ان لوگوں میں سے ہے جن کی صفت یہ ہے کہ ذات حق (الحق) ان کی سماعت ہو، تو وہ اللہ سے خیانت کرنے والوں میں سے ہے، اور اللہ نے اسے اللہ سے خیانت کرنے سے منع فرمایا ہے۔\n\nاسی طرح، ان لوگوں کی خیانت میں سے ہے جنہیں اللہ نے اس علم پر مطلع کیا کہ عالم کا وجود، وجود حق (الوجود) ہی ہے، پھر وہ اس میں اللہ کی حدود میں سے کسی حد کو پار کر کے تصرف کرے، جبکہ وہ جانتا ہو کہ وہ تجاوز کر رہا ہے۔ کیونکہ اس حال میں، اہل حجاب کے نزدیک، اللہ اپنے وجود میں عین امانت ہے، خواہ وہ اسے شرعاً جانے یا عقلاً۔ پس اس نے اپنے تصرف میں تجاوز کا اعتقاد رکھ کر اللہ سے خیانت کی، اور \"جو کوئی اللہ کی حدود سے تجاوز کرتا ہے تو اس نے یقیناً اپنی جان پر ظلم کیا\" (ومن يَتَعَدَّ حُدُودَ الله فَقَدْ ظَلَمَ نَفْسَهُ)۔ اور \"اسے انسان نے اٹھا لیا، بے شک وہ بڑا ظالم، بڑا جاہل ہے\" (وحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً جَهُولًا)۔\n\nاسی طرح، جس نے اہل اللہ کے معاملے میں اللہ سے خیانت کی، اس نے اللہ سے خیانت کی۔ اور ہر وہ معاملہ جو تمہارے ہاتھ میں ہے اور اللہ نے تمہیں حکم دیا ہے کہ تم اسے اسی کی طرف لوٹاؤ، اور تم نے ایسا نہ کیا، تو یہ اللہ سے خیانت ہے۔ اور اللہ فرماتا ہے: \"اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں\" (وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ)۔\n\nاور جس نے رسول اللہ صلی اللہ علیہ وسلم سے خیانت کی، وہ اس ادب میں ہے جو اللہ نے تمہیں عطا کیا ہے کہ تم اس کے ساتھ رسول اللہ صلی اللہ علیہ وسلم سے معاملہ کرو۔ اور یہ معاملہ ہی عین اس امانت کی ادائیگی ہے جو ان کی طرف ہے۔ پس اگر تم نے ان کے ساتھ ادب کا برتاؤ نہ کیا تو تم نے ان کی امانت ادا نہیں کی، اور تم نے اس معاملے میں رسول اللہ صلی اللہ علیہ وسلم سے خیانت کی جس پر اللہ نے تمہیں امین بنایا تھا۔\n\nاور رسول اللہ صلی اللہ علیہ وسلم سے تمہاری خیانت میں سے وہ بھی ہے جس میں انہوں نے تم سے اپنے قرابت داروں اور اہل بیت سے محبت کا مطالبہ کیا۔ کیونکہ وہ اور ان کے اہل بیت ہماری محبت میں برابر ہیں۔ پس جس نے ان کے اہل بیت سے نفرت کی، اس نے ان سے نفرت کی۔ کیونکہ وہ صلی اللہ علیہ وسلم اہل بیت میں سے ایک ہیں۔ اور اہل بیت کی محبت تقسیم نہیں ہوتی، کیونکہ محبت کا تعلق صرف اہل سے ہے، نہ کہ کسی ایک فرد سے۔ پس تم اپنا دھیان رکھو اور اہل بیت کی قدر پہچانو۔ پس جس نے اہل بیت سے خیانت کی، اس نے رسول اللہ صلی اللہ علیہ وسلم سے خیانت کی، اور جس نے رسول اللہ صلی اللہ علیہ وسلم کی سنت سے خیانت کی، اس نے ان کی سنت میں ان سے خیانت کی۔\n\nاور مجھے مکہ میں میرے ایک ثقہ (قابل اعتماد) شخص نے خبر دی، اس نے کہا: میں مکہ کے شرفاء کے لوگوں کے ساتھ کیے جانے والے سلوک کو ناپسند کرتا تھا۔ پھر میں نے خواب میں رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی فاطمہ رضی اللہ عنہا کو دیکھا، وہ مجھ سے منہ پھیرے ہوئے تھیں۔ میں نے انہیں سلام کیا اور ان کے منہ پھیرنے کی وجہ پوچھی۔ انہوں نے فرمایا: تم شرفاء کے بارے میں برا کہتے ہو۔ میں نے عرض کیا: اے میری سیدہ! کیا آپ نہیں دیکھتیں کہ وہ لوگوں کے ساتھ کیا کرتے ہیں؟ انہوں نے فرمایا: کیا وہ میرے بیٹے نہیں ہیں؟ میں نے کہا: اب سے میں توبہ کرتا ہوں۔ تو انہوں نے میری طرف توجہ کی اور میں بیدار ہو گیا۔\n\nپس اہل بیت کے برابر کسی مخلوق کو نہ ٹھہراؤ،\nکیونکہ اہل بیت ہی سرداری کے اہل ہیں۔\nان سے بغض رکھنا انسان کے لیے حقیقی خسارہ ہے،\nاور ان سے محبت کرنا عبادت ہے۔\n\nاور رسول اللہ صلی اللہ علیہ وسلم سے تمہاری خیانت میں سے ایک یہ بھی ہے کہ تم انبیاء اور رسولوں (سلام اللہ علیہم) کے درمیان فضیلت میں فرق کرو، باوجود اس کے کہ ہم جانتے ہیں کہ اللہ نے ان میں سے بعض کو بعض پر فضیلت دی ہے، جیسا کہ ذات حق (اللہ تعالیٰ) نے فرمایا: \"اور بے شک ہم نے بعض نبیوں کو بعض پر فضیلت دی\" (ولَقَدْ فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ)۔ اور فرمایا: \"یہ وہ رسول ہیں جن میں سے ہم نے بعض کو بعض پر فضیلت دی\" (تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ)۔ پس اس ذات سبحانہ کے لیے یہ حق ہے کہ وہ اپنے بندوں میں سے جسے چاہے فضیلت دے، لیکن یہ حق ہمارے لیے نہیں ہے۔ کیونکہ ہم یہ فضیلت صرف اس کے بتانے سے ہی جان سکتے ہیں۔ یہ معاملہ اس بات کی طرف لوٹتا ہے کہ ذات حق (الحق) سبحانہ کے ہاں ان کا کیا مقام ہے۔ اور کوئی نہیں جانتا کہ ذات حق (الحق) کے ہاں کیا ہے، جیسا کہ عیسیٰ علیہ السلام نے فرمایا: \"تو جانتا ہے جو میرے دل میں ہے اور میں نہیں جانتا جو تیرے دل میں ہے، بے شک تو ہی غیبوں کا جاننے والا ہے\" (تَعْلَمُ ما في نَفْسِي ولا أَعْلَمُ ما في نَفْسِكَ إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ)۔ اور یہاں ظاہری مراتب اور حکم چلانے کی کوئی گنجائش نہیں ہے۔ اور رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا ہے کہ ہم انبیاء کے درمیان فضیلت میں فرق کریں، اور یہ بھی کہ ہم انہیں صلی اللہ علیہ وسلم پر فضیلت دیں، مگر یہ بھی اللہ کے بتانے سے ہو۔ اور یونس علیہ السلام وغیرہ کا معاملہ بھی یہی ہے۔ پس جس نے اللہ کے بتائے بغیر فضیلت دی، اس نے رسول اللہ صلی اللہ علیہ وسلم سے خیانت کی اور اس حد سے تجاوز کیا جو رسول اللہ صلی اللہ علیہ وسلم نے اس کے لیے مقرر کی تھی۔\n\nاور جہاں تک امانتوں کی خیانت کا تعلق ہے، تو اس میں رسول اللہ صلی اللہ علیہ وسلم کا یہ فرمان شامل ہے: \"حکمت کو اس کے غیر اہل کو نہ دو کہ تم اس پر ظلم کرو، اور نہ ہی اسے اس کے اہل سے روکو کہ تم ان پر ظلم کرو۔\"\n\nاور خیانت ظلم ہے۔ پس حکمت ایک امانت ہے، اور اس کی خیانت یہ ہے کہ تم اسے اس کے غیر اہل کو دو، جبکہ تم جانتے ہو کہ وہ اس کا اہل نہیں ہے۔ پس اللہ نے اس شخص سے حرج اٹھا لیا جو نہیں جانتا، لیکن اسے حکم دیا ہے کہ وہ معاملات کے علم کو حاصل کرنے کی کوشش کرے۔ لہٰذا اس کے لیے اس سے پیچھے ہٹنے کا کوئی عذر نہیں ہے۔ پس جس نے علم حاصل ہونے سے پہلے اس میں خیانت کی، جبکہ وہ علم حاصل کرنے کی کوشش میں تھا، اور وقت نے اسے اس خاص تصرف کی طرف بلایا جسے خیانت کہا جاتا ہے، تو اس پر اس خیانت یا کوتاہی کی کوئی پکڑ نہیں ہوگی۔ کیونکہ وہ علم حاصل کرنے کی کوشش کی حالت میں تھا اور وقت نے اس تصرف کا حکم دیا جو واقع ہوا۔ پس جس شخص کو یہ ذکر حاصل ہو، تو اس ذکر کی عنایت سے اسے خیانت سے عصمت حاصل ہو جاتی ہے، اور وہ ہر امانت میں اہلیت کے علم پر مطلع ہو جاتا ہے۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)۔\n\nبے شک میں ایک ایسے راز کے ساتھ خاص کیا گیا ہوں جسے کوئی نہیں جانتا،\nسوائے میرے اور اس کے جس کی ہم شریعت میں پیروی کرتے ہیں۔\nوہ نبی، رسول اللہ، بہترین جوان ہیں،\nہم اللہ کی قسم، ان کی پیروی کرتے ہیں جو وہ شریعت بناتے ہیں۔",
    "fa": "باب پانصد و دوم در معرفت حال قطبی که منزل او این آیه بود: «لَا تَخُونُوا اللَّهَ وَالرَّسُولَ وَتَخُونُوا أَمَانَاتِكُمْ وَأَنْتُمْ تَعْلَمُونَ» (به خدا و پیامبر خیانت نکنید و به امانت‌های خود خیانت نورزید در حالی که می‌دانید).\n\nاگر از آنِ حق هستید، به خدا خیانت نکنید؛\nو همچنین امانت‌ها نیز خیانت نمی‌شوند.\n\nاگر آن (امانت) را بدون امر (الهی) حمل کردی،\nجاهل مباش که یاری نمی‌شوی.\n\nهر کس آن را حمل کند، با امان حمل می‌کند،\nپس امانت‌ها خود امان هستند.\n\nو آن (امانت) بر حامل خود حقی دارد؛\nاین را جز صاحب شهود (ذو عیان) نمی‌داند.\n\nپس آن را ادا می‌کند، چنان که حق (الحق) که گفت و شد،\nدر کتاب برای ما فرمود.\n\nاین است خدایی که جلالش والاست،\nدر قلم و زبان و دل (جنان).\n\n[خیانت‌ها سه گونه‌اند]\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در مقام وصیت فرمودند: «امارت (حکومت) را درخواست نکنید، زیرا اگر بدون درخواست به شما داده شود، بر آن یاری می‌شوید، و اگر با درخواست به شما داده شود، بر آن یاری نمی‌شوید.»\n\nخیانت سه گونه است، منظورم کسانی هستند که خیانت به خدا، خیانت به رسول و خیانت به امانت‌ها می‌کنند. و خداوند در این خیانت‌ها جز مؤمنان را مورد خطاب قرار نداده است. پس اگر مؤمن هستی، تو مخاطب هستی. اما خیانت به خدا در امانتش، و خیانت به رسول، و خیانت به امانت‌ها، اگر خداوند متعال بخواهد، آن‌ها را ذکر خواهم کرد، به دلیل فرموده خداوند متعال: «إِنَّا عَرَضْنَا الْأَمَانَةَ عَلَى السَّمَاوَاتِ وَالْأَرْضِ وَالْجِبَالِ فَأَبَيْنَ أَنْ يَحْمِلْنَهَا» (ما امانت را بر آسمان‌ها و زمین و کوه‌ها عرضه کردیم، پس از حمل آن سر باز زدند) زیرا این عرضه بود نه امر، «وَأَشْفَقْنَ مِنْهَا وَحَمَلَهَا الْإِنْسَانُ إِنَّهُ كَانَ ظَلُومًا جَهُولًا» (و از آن ترسیدند و انسان آن را حمل کرد، همانا او بسیار ستمکار و نادان بود). منظور این است که نسبت به خود ستمکار و نسبت به قدر و منزلت آنچه حمل کرده، نادان بود. خداوند متعال هنگامی که آن را حمل کردیم، به ما فرمود: «إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَمَانَاتِ إِلَى أَهْلِهَا» (همانا خداوند به شما فرمان می‌دهد که امانت‌ها را به اهلش بازگردانید). هیچ یک از خلق خدا جز انسان آن را حمل نکرد. پس انسان از این حالت خارج نیست که آن را به صورت عرضه (اختیاری) یا به صورت جبر حمل کند. اگر آن را به صورت عرضه حمل کند، خود را به خطر انداخته است، و اگر آن را به صورت جبر حمل کند، در هر حال و ناگزیر آن را ادا خواهد کرد.\n\n[همانا خداوند به ما امر کرده است که امانت‌ها را به اهلش بازگردانیم]\n\nو بدان که اهل امانت‌ها که خداوند به ما امر کرده است که آن‌ها را به ایشان بازگردانیم، کسی نیست که آن را داده است، بلکه اهل آن کسی است که امانت به او ادا می‌شود. اگر کسی که امانت را داده است، با این نیت داده باشد که در وقت دیگری به او بازگردانده شود، او اهل آن است، اما از آن جهت که به او ادا می‌شود، نه از آن جهت که آن را داده است. و اگر این امینِ مورد اعتماد، آن را به کسی بدهد تا برای دیگری حمل کند، آن دیگری اهل آن است، نه کسی که آن را داده است. پس خداوند تو را به اهلیت در این امر آگاه ساخته است، زیرا حق (الحق) تنها از آنِ کسی است که مستحق آن باشد. این را بدان و بر اساس آن عمل کن.\n\n[همانا رسالت امانتی از جانب خداست]\n\nو بدان که خداوند امانت دیگری به تو داده است تا آن را به خودش بازگردانی، همان‌طور که امانتی به تو داده است تا به دیگری برسانی و به خودش بازنگردانی، مانند رسالت. زیرا خداوند می‌فرماید: «يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ وَإِنْ لَمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسَالَتَهُ» (ای پیامبر، آنچه از پروردگارت بر تو نازل شده است، ابلاغ کن؛ و اگر نکنی، رسالت او را ابلاغ نکرده‌ای). و فرمود: «مَا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ» (بر پیامبر جز ابلاغ نیست).\nاما آنچه از امانت‌ها که به سوی او (عز و جل) بازگردانده می‌شود، هر علمی است که تو را بر آن امین ساخته است؛ از علومی که اگر در عموم آشکار شود، کسی که آن را از تو با گوش حق (سمع الحق) نمی‌شنود، گمراه می‌شود. پس اگر چنین علمی برای تو حاصل شد و دیدی کسی را که حق (الحق) گوش و چشم و تمام قوای اوست و این علم را ندارد، و آن را به او ادا کردی، او آن را از تو جز با گوش حق (سمع الحق) نمی‌شنید. پس در حقیقت، حق (الحق) همان کسی است که شنید و تو امانت را به سوی او تعالی بازگرداندی، و او همان کسی است که آن را به تو داده بود. و برای این شخص که حق (الحق) گوش اوست، فایده‌ای حاصل شد که قبلاً نمی‌دانست.\nاما حامل این امانت، اگر نداند که این شخص از کسانی است که صفتش این است که حق (الحق) گوش او باشد، در این صورت او از کسانی است که به خدا خیانت کرده است، و خداوند او را از خیانت به خدا نهی کرده است.\nهمچنین، از خیانت کسی است که خداوند او را بر این علم آگاه ساخته که وجودِ عالَم، وجود حق (الحق) است، سپس در آن تصرفی کند که از حدی از حدود الهی تجاوز نماید، در حالی که می‌داند در حال تجاوز است. زیرا در این حال، خداوند عین امانت در وجود اوست نزد اهل حجاب (کسانی که در حجابند)، چه این را شرعاً بداند و چه عقلاً. پس او در تصرف خود با اعتقاد به تجاوز، به خدا خیانت کرده است. و «وَمَنْ يَتَعَدَّ حُدُودَ اللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ» (و هر کس از حدود خدا تجاوز کند، قطعاً به خود ستم کرده است). و «وَحَمَلَهَا الْإِنْسَانُ إِنَّهُ كَانَ ظَلُومًا جَهُولًا» (و انسان آن را حمل کرد، همانا او بسیار ستمکار و نادان بود).\nهمچنین، کسی که در حق اهل الله خیانت کند، به خدا خیانت کرده است. و هر امری که در دست توست و خداوند به تو امر کرده است که آن را به او بازگردانی و تو انجام ندهی، این از خیانت به خداست. و خداوند می‌فرماید: «وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ» (و همه امور به سوی او بازگردانده می‌شود).\nو اما خیانت کسی که به رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) خیانت کرده است، در آدابی است که خداوند به تو داده تا با رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) رفتار کنی. و این رفتار، عین ادای امانت به سوی او (صَلَّى اللهُ عَليهِ وسَلَّم) است. پس اگر با او ادب نورزی، امانت او را به او ادا نکرده‌ای و به رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در آنچه خداوند تو را بر آن امین ساخته، خیانت کرده‌ای.\nو از خیانت تو به رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) این است که در مورد خویشاوندان و اهل بیتش، در مودت (دوستی) که از تو خواسته است، کوتاهی کنی. زیرا او و اهل بیتش در مودت ما نسبت به ایشان یکسان هستند. پس هر کس اهل بیت او را ناخوش بدارد، او را ناخوش داشته است، زیرا او (صَلَّى اللهُ عَليهِ وسَلَّم) خود یکی از اهل بیت است. و محبت اهل بیت تجزیه نمی‌پذیرد، زیرا محبت تنها به اهل تعلق گرفته است، نه به یک فرد خاص. پس توجه کن و قدر اهل بیت را بشناس. هر کس به اهل بیت خیانت کند، به رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) خیانت کرده است.\nو هر کس به آنچه رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) سنت نهاده خیانت کند، به او (صَلَّى اللهُ عَليهِ وسَلَّم) در سنتش خیانت کرده است.\nفرد مورد اعتماد من در مکه به من خبر داد و گفت: «من از کارهایی که اشراف مکه با مردم می‌کردند، بیزار بودم. پس در خواب فاطمه دختر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را دیدم که از من روی گردانده بود. به او سلام کردم و از روی گردانی‌اش پرسیدم. گفت: تو درباره اشراف بدگویی می‌کنی. گفتم: ای سرور من، آیا نمی‌بینی که با مردم چه می‌کنند؟ گفت: آیا آن‌ها فرزندان من نیستند؟ گفتم: از همین لحظه توبه کردم. پس او به من روی آورد و بیدار شدم.»\n\nپس هیچ خلقی را هم‌تراز اهل بیت قرار مده،\nزیرا اهل بیت، اهل سروری و آقایی هستند.\n\nپس دشمنی با آنان برای انسان، زیانی حقیقی است،\nو محبتشان عبادت است.\n\nو از خیانت تو به رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) برتری دادن میان پیامبران و رسولان (سلام الله علیهم) است، با وجود علم ما به اینکه خداوند برخی از آنان را بر برخی دیگر برتری داده است، چنان که فرمود: «وَلَقَدْ فَضَّلْنَا بَعْضَ النَّبِيِّينَ عَلَى بَعْضٍ» (و به راستی برخی از پیامبران را بر برخی دیگر برتری دادیم) و فرمود: «تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَى بَعْضٍ» (آن رسولان، برخی از ایشان را بر برخی دیگر برتری دادیم). پس برای او سبحانه است که میان بندگانش به هر چه بخواهد برتری دهد، اما این کار برای ما جایز نیست. زیرا ما این را جز با اعلام او نمی‌دانیم، چرا که این امر به آنچه در نفس حق (الحق) سبحانه از ایشان است، باز می‌گردد. و هیچ کس آنچه در نفس حق (الحق) است را نمی‌داند، چنان که عیسی (علیه السلام) فرمود: «تَعْلَمُ مَا فِي نَفْسِي وَلَا أَعْلَمُ مَا فِي نَفْسِكَ إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ» (تو آنچه در نفس من است می‌دانی، و من آنچه در نفس توست نمی‌دانم؛ همانا تو خود بسیار دانای غیب‌هایی). و در اینجا جایگاهی برای مراتب ظاهری و حکم کردن نیست. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) نهی فرمود که میان پیامبران برتری دهیم و نیز نهی فرمود که او (صَلَّى اللهُ عَليهِ وسَلَّم) را بر آنان برتری دهیم، مگر با اعلام او. و به عین یونس (علیه السلام) و دیگران اشاره کرد. پس هر کس بدون اعلام خدا برتری دهد، به رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) خیانت کرده و از آنچه رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) برای او حد نهاده، تجاوز کرده است.\nو اما خیانت به امانت‌ها، شامل این فرموده او (صَلَّى اللهُ عَليهِ وسَلَّم) می‌شود: «حکمت را به نااهلان ندهید که به آن ستم کرده‌اید، و آن را از اهلش دریغ نکنید که به آنان ستم کرده‌اید.»\nو خیانت، ظلم است. پس حکمت امانت است و خیانت به آن این است که آن را به نااهلش بدهی، در حالی که می‌دانی او نااهل است. پس خداوند حرج را از کسی که نمی‌داند برداشته است، جز اینکه به او امر کرده است که برای کسب علم به امور تلاش کند، پس در کوتاهی از آن عذری ندارد.\nپس کسی که قبل از حصول علم خیانت کند، در حالی که در حال تلاش برای کسب علم است و وقت او را به آن تصرف خاص که خیانت نامیده می‌شود، فراخوانده است، به آن خیانت و کوتاهی مؤاخذه نمی‌شود. زیرا او در حال تلاش برای کسب علم است و وقت بر اساس آنچه تصرف با آن واقع شده، حکم کرده است.\nپس هر کس این ذکر را داشته باشد، به واسطه آن از خیانت مصونیت می‌یابد و به عنایت این ذکر، بر علم اهلیت در هر امانتی آگاه می‌شود. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را می‌نمایاند).\n\nمن به رازی اختصاص داده شده‌ام که آن را جز من\nو کسی که در شریعت از او پیروی می‌کنیم، نمی‌داند.\n\nاو پیامبر، رسول خدا، بهترین جوانمرد است؛\nبه خدا سوگند، در آنچه تشریع می‌کند، از او پیروی می‌کنیم."
  },
  "page_count": 3
}