{
  "id": 443,
  "title": {
    "ar": "الباب الثالث والأربعون وأربعمائة في معرفة منازلة واجب الكشوف العرفاني",
    "en": "Chapter Four Hundred and Forty-Three: Concerning the Gnosis of the Necessary Stations (منازلة واجب) of Gnostic Unveilings (الكشوف العرفاني)",
    "ur": "باب چار سو تینتالیس: واجب عرفانی کشف (الکشف) کی منازل کی معرفت (المعرفۃ) کے بیان میں",
    "fa": "باب چهارصد و چهل و سوم در معرفت منازل واجب کشف‌های (الکشوف) عرفانی"
  },
  "content": {
    "ar": "## «الباب الثالث والأربعون وأربعمائة في معرفة منازلة واجب الكشوف العرفاني»\n\n\n> إن المعارف تعطي واحدا أبدا *** فواجب الكشف عرفان بآحاد\n> فإن تعدى إلى ثان فإن له *** من نفسه وله الإسعاد في النادي‏\n\n\n> تساعد العلم وقتا إذ يساعدها *** العلم وقتا فإسعاد بإسعاد\n\n\n> لا تَعْلَمُونَهُمُ الله يَعْلَمُهُمْ *** علم كمعرفة والحكم للبادي‏\n\n\n### [إن السبب الكشف العرفانى هو الطمع الطبيعي في الربوبية]\n\n\nاعلم أيدنا الله وإياك أن الذي أوجب الكشوف العرفاني الطمع الطبيعي في الربوبية ليشهد ما هو عليه الرب من الصفات المؤثرة في الأكوان فيظهر بها في ربوبيته عن كشف وتحقيق فلا نتعدى بالصفة أثرها فإن الأسماء الإلهية تتقارب وربما يتخيل من لا كشف له عليها ولا ذوق له فيها إنها متداخلة أو مترادفة وإنما هي في أنفسها مشتبهة ولا يصل إلى تحقيق ذلك أحد إلا بالكشف إلا أن هنا دقيقة وهي أن نسبة ذلك الاسم الإلهي إلى الرب تعالى ما يكون على مثل نسبته إلى المخلوق فإن الأمور إذا نسبت إلى شي‏ء تختلف نسبتها باختلاف من تنسب إليه وإن كان معنى ذلك الاسم المنسوب على حقيقة واحدة فإذا اطلع أهل الكشف من نفوسهم على تهيؤ المحال التي تتأثر لها يشوقها ذلك إلى تحصيل الوجوه التي تبقي عليها الأدب مع الله إذا أثرت بها لأنها قد علمت بالخبر الإلهي أنها مخلوقة على الصورة الإلهية وأن الخلافة ما صحت لها إلا بالصورة وأن كل إنسان ما هو على الصورة فإنه ثم إنسان حيوان وإنسان خليفة ولم يعلم هذا الإنسان الطالب أي إنسان هو هل هو الحيوان أو الإمام فأوجب له هذا الاطلاع أن يطلب من الحق تجليا خاصا في ربوبيته ويرى انفعال الأكوان عنه كما قال الصديق ما رأيت شيئا إلا رأيت الله قبله فيرى صدور الأكوان عنه في الأكوان ويرى صورة التعلق وهل يكون الحق في ذلك التحلي على صورة ما يتكون عنه أو على صورة النسبة التي يكون بها التي يقول للشي‏ء كن فيكون ذلك الشي‏ء ويرى من أين يقبل المأمور بالتكوين التكون هل يقبله من أمر وجودي أم لا فإذا ظهر هل يظهر بصورة الاسم الذي قال به الحق له كن أو يكون هو عين الصورة التي قال بها كن فكانت في حق الحق أسماء وفي جوهر المكون فيه خلقا وصورة وإذا كانت بهذه المثابة فهل تبقي تلك الصورة الاسمية على ما شهدها في الحق أو تظهر بذلك الاسم في صورة أخرى لتكوين عين أخرى لاختلاف الأمثال لما بينهم من التميز الذي به يقال هذا ليس هذا أو هذا مثل هذا كل هذا يطلبه العارف حتى يقف عليه من نفسه وهذا هو الشخص الذي يدعو إلى الله على بصيرة ويكون من نفسه على بصيرة ويرى تأثير الخلق في الخلق هل هو أمر صحيح أو هو تأثير حق في خلق أو خلق في حق أو حق في حق أو هو المجموع أو لا أثر في نفس الأمر وإن ظهر أنه أثر كما تقدم في الرؤية هل المرئي الحق أو نفس الرائي وليس هذا مع ثبوت مرئي لا يعرف ما هو كذلك ربما يكون ثبوت أثر في الكشف وفي الوقوع فإن جعلنا محله حقا أو خلقا لم يصدق هذا الجعل وما ثم إلا حق وخلق فأين محل الأثر وهذا من أشكل ما تروم النفس تحصيله فإذا اطلع العارف على الوجه الصحيح انتقل من درجة المعرفة إلى درجة العلم فكان عالما إلهيا بعد ما كان عارفا ربانيا ولا يقال إلهي إلا فيمن هذه صفته فإن له الأمر العام الجامع فإذا نظرت إليه قلت إنه حق ثم تنظر إليه فنقول إنه خلق ثم تنظر إليه فتقول لا حق ولا خلق ثم تنظر إليه فتقول حق خلق فتحار فيه حيرتك في الله فحينئذ تعرف أنه قد حصل الصورة وأنه فارق الإنسان الحيوان ومتى لم يعرف الإنسان هذا من نفسه ذوقا وحالا وكشفا وشهودا فليس بالإنسان المخلوق على الصورة الذي له الإمامة في الكون صاحب العهد فإن الله لا ينال عهده الظالمون وليس عهده سوى صورته فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 443: Concerning the Knowledge of the Stations of the Necessary Gnostic Unveiling\n\nGnostic knowledges always yield a single reality,\nThus the necessary Unveiling is Gnosis of the unities.\nIf it moves beyond to a second, then that second belongs\nTo its own self, and for it is felicity in the assembly.\n\nIt assists Knowledge at one time, just as Knowledge assists it at another time,\nResulting in felicity by felicity.\n\n<<You do not know them; Allah knows them.>> (Knowledge is like Gnosis, and the ruling belongs to the Manifest One.)\n\n### [The Cause of the Gnostic Unveiling is the Natural Aspiration toward Lordship (الربوبية)]\n\nKnow, may Allah support us and you, that what necessitates the Gnostic Unveiling (الكشوف العرفاني) is the natural aspiration toward Lordship (الربوبية), so that the seeker may witness the Attributes (الصفات) upon which the Lord subsists—those Attributes that influence the created worlds (الأكوان)—and thereby manifest through them in his own Lordship, based on unveiling (كشف) and verification (تحقيق). Thus, we do not allow the Attribute to exceed its proper effect.\n\nThe Divine Names (الأسماء الإلهية) are closely related, and perhaps one who has no unveiling (كشف) of them and no taste (ذوق) for them imagines that they are interpenetrating or synonymous. Rather, they are similar in themselves, and no one attains the verification (تحقيق) of this except through Unveiling. However, there is a subtlety (دقيقة) here: the relation of that Divine Name to the exalted Lord is not the same as its relation to the creature. When matters are related to something, their relation differs according to the one to whom they are related, even if the meaning of that related Name is based upon a single reality (حقيقة).\n\nWhen the people of Unveiling (أهل الكشف) perceive within their own souls the preparedness of the loci that are affected by these Names, this excites them to attain the aspects that maintain proper spiritual conduct (الأدب) with Allah when they act through those Names. This is because they have learned through Divine report that they were created upon the Divine Form (الصورة الإلهية), and that Vicegerency (الخلافة) is only valid for them through this Form. Any human who is not upon this Form is merely an animal human (إنسان حيوان), whereas the one who is upon it is the vicegerent human (إنسان خليفة). This seeking human does not know which type of human he is—the animal or the Imam (leader).\n\nThis perception necessitates that he seek from The Real (الحق) a specific theophany (تجليا خاصا) in His Lordship (الربوبية) and see the passive effect of the cosmos (الأكوان) originating from Him, just as the Veracious One (الصديق) said: \"I did not see a thing except that I saw Allah before it.\" He sees the issuance of the cosmos from Him within the cosmos, and he sees the form of the relation. Is The Real (الحق) in that self-disclosure (التحلي) upon the form of that which comes into being from Him, or upon the form of the relation by which He says to the thing, 'Be!' (كن), and it is? He sees from where the commanded entity accepts the coming-into-being: does it accept it from an existent command or not?\n\nWhen it appears, does it appear in the form of the Name by which The Real said 'Be!' to it, or is it the very essence of the form by which He said 'Be!'? In relation to The Real, these are Names (أسماء), but in the essence of the entity brought into being, they are creation (خلق) and form (صورة). If they are of this status, does that nominal form remain as he witnessed it in The Real, or does it appear through that Name in another form to bring another entity (عين أخرى) into being, due to the difference between similars, which is the distinction by which it is said, 'This is not that,' or 'This is like that'? The Gnostic (العارف) seeks all of this until he stands upon it from his own self. This is the person who calls to Allah upon clear insight (بصيرة) and possesses clear insight regarding his own self. He sees whether the effect of creation (الخلق) upon creation is a sound matter, or if it is the effect of The Real upon creation, or creation upon The Real, or The Real upon The Real, or if it is the totality, or if there is no effect in reality (نفس الأمر) even if it appears to be an effect, just as was mentioned regarding the vision: Is the seen object The Real, or the self of the viewer? This is not the case when there is a fixed visible object whose nature is unknown.\n\nSimilarly, there may be the establishment of an effect in the Unveiling (كشف) and in occurrence. If we posit its locus as The Real or creation, this positing is not true, yet there is nothing there except The Real and creation—so where is the locus of the effect? This is one of the most difficult things the soul seeks to attain. When the Gnostic perceives the correct aspect, he moves from the degree of Gnosis (المعرفة) to the degree of Knowledge (العلم), becoming a Divine Knower (عالما إلهيا) after having been a Lordly Gnostic (عارفا ربانيا). The term 'Divine' (إلهي) is only applied to one whose description is this, for he possesses the comprehensive universal command. When you look at him, you say he is The Real; then you look at him and say he is creation; then you look at him and say he is neither The Real nor creation; then you look at him and say he is The Real-creation. You are bewildered by him, just as you are bewildered by Allah. It is then that you know he has attained the Form (الصورة) and has departed from the animal human (الإنسان الحيوان). If a human does not know this about himself through taste (ذوق), spiritual state (حال), unveiling (كشف), and witnessing (شهود), then he is not the human created upon the Form who possesses the Imamate (الإمامة) in the cosmos, the possessor of the Covenant. For Allah says: <<Indeed, My covenant does not reach the wrongdoers.>> His covenant is nothing other than His Form. Know this. And Allah says the truth, and He guides to the way. (وَاللهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)",
    "ur": "باب نمبر ۴۴۳: واجب الکشوف العرفانی (واجب الكشوف العرفاني) کے مقامات کی معرفت کے بیان میں\n\nمعرفتیں ہمیشہ ایک ہی چیز عطا کرتی ہیں،\nپس واجب الکشف (واجب الكشف) افراد کے ذریعے عرفان (عرفان) ہے۔\nاگر وہ کسی دوسرے کی طرف تجاوز کرے، تو اس کے لیے اپنی ذات سے ہے،\nاور اس کے لیے محفل میں سعادت ہے۔\n\nعلم وقت پر مدد کرتا ہے، جب وہ (معرفتیں) وقت پر علم کی مدد کرتی ہیں،\nتو یہ سعادت پر سعادت ہے۔\n\n\"تم انہیں نہیں جانتے، اللہ انہیں جانتا ہے۔\" (قرآن)\nیہ علم معرفت (معرفۃ) کی طرح ہے اور حکم ظاہر ہونے والے کے لیے ہے۔\n\n### [عرفانی کشف (الكشف العرفاني) کا سبب ربوبیت (الربوبیۃ) میں فطری طمع ہے]\n\nجان لو، اللہ ہماری اور تمہاری مدد کرے، کہ جس چیز نے عرفانی کشف (الكشوف العرفاني) کو واجب کیا، وہ ربوبیت (الربوبیۃ) میں فطری طمع ہے، تاکہ سالک ان صفات کا مشاہدہ کرے جن پر رب قائم ہے اور جو کائنات میں مؤثر ہیں، اور ان صفات کے ذریعے اپنی ربوبیت میں کشف (كشف) اور تحقیق کے ساتھ ظہور کرے۔\n\nپس ہم صفت کے اثر سے تجاوز نہیں کرتے، کیونکہ اسماء الٰہیہ قریب قریب ہیں، اور شاید وہ شخص جسے ان پر کشف (كشف) حاصل نہیں اور نہ ہی ان کا ذوق ہے، یہ گمان کرے کہ وہ آپس میں مدغم (متداخلۃ) یا مترادف ہیں، حالانکہ وہ اپنی ذات میں مشتبہ ہیں، اور کوئی بھی شخص کشف (كشف) کے بغیر اس کی حقیقت تک نہیں پہنچ سکتا۔ مگر یہاں ایک باریک نکتہ ہے، اور وہ یہ ہے کہ اس اسم الٰہی کی نسبت رب تعالیٰ کی طرف ویسی نہیں ہوتی جیسی اس کی نسبت مخلوق کی طرف ہوتی ہے۔ کیونکہ جب امور کی نسبت کسی چیز کی طرف کی جاتی ہے تو ان کی نسبت اس کے اختلاف سے مختلف ہو جاتی ہے جس کی طرف وہ منسوب کیے جاتے ہیں، اگرچہ اس منسوب اسم کا معنی ایک ہی حقیقت پر ہو۔\n\nپس جب اہل کشف (أهل الكشف) اپنی جانوں سے ان مقامات کی تیاری پر مطلع ہوتے ہیں جو ان سے متاثر ہوتے ہیں، تو یہ چیز انہیں ان طریقوں کے حصول کا شوق دلاتی ہے جو ان پر اللہ کے ساتھ ادب کو باقی رکھتے ہیں جب وہ ان سے اثر انداز ہوتے ہیں، کیونکہ وہ خبر الٰہی کے ذریعے جان چکے ہیں کہ وہ صورت الٰہیہ (الصورة الإلهیۃ) پر پیدا کیے گئے ہیں، اور خلافت ان کے لیے صرف اسی صورت کی وجہ سے صحیح ہوئی ہے، اور ہر وہ انسان جو اس صورت پر نہیں ہے، وہ محض حیوانی انسان ہے، اور ایک خلیفہ انسان ہے۔\n\nاور یہ طالب انسان نہیں جانتا کہ وہ کون سا انسان ہے، کیا وہ حیوانی ہے یا امام (خلیفہ)؟ پس اس اطلاع نے اسے مجبور کیا کہ وہ حق (الحق) سے اس کی ربوبیت (ربوبیۃ) میں ایک خاص ظہور الٰہی (تجلی) طلب کرے اور کائنات کا اس سے متاثر ہونا دیکھے، جیسا کہ صدیق (ابوبکر رضی اللہ عنہ) نے فرمایا: \"میں نے کوئی چیز نہیں دیکھی مگر یہ کہ میں نے اللہ کو اس سے پہلے دیکھا۔\"\n\nپس وہ کائنات میں کائنات کا اس سے صادر ہونا دیکھتا ہے اور تعلق کی صورت دیکھتا ہے، اور کیا حق (الحق) اس ظہور (تحلی) میں اس چیز کی صورت پر ہوتا ہے جو اس سے وجود میں آتی ہے، یا اس نسبت کی صورت پر ہوتا ہے جس کے ذریعے وہ کہتا ہے: \"ہو جا\" تو وہ چیز ہو جاتی ہے؟ اور وہ دیکھتا ہے کہ جس چیز کو وجود میں لانے کا حکم دیا گیا ہے وہ وجود کو کہاں سے قبول کرتی ہے، کیا وہ اسے کسی وجودی امر سے قبول کرتی ہے یا نہیں؟ پس جب وہ ظاہر ہوتی ہے، تو کیا وہ اس اسم کی صورت میں ظاہر ہوتی ہے جس کے ذریعے حق (الحق) نے اسے \"ہو جا\" کہا، یا وہ بعینہٖ وہی صورت ہوتی ہے جس کے ذریعے \"ہو جا\" کہا گیا اور وہ ہو گئی؟ جو حق (الحق) کے حق میں اسماء ہیں اور جس چیز کو وجود بخشا گیا اس کے جوہر میں خلق اور صورت ہیں۔\n\nاور جب وہ اس مقام پر ہو، تو کیا وہ اس اسمی صورت کو اسی طرح باقی رکھتی ہے جیسا کہ اس نے حق (الحق) میں اس کا مشاہدہ کیا، یا وہ اس اسم کے ذریعے کسی دوسری صورت میں ظاہر ہوتی ہے تاکہ کسی دوسری عین کو وجود بخشا جائے، امثال کے اختلاف کی وجہ سے، اس امتیاز کے سبب جو ان کے درمیان ہے جس سے کہا جاتا ہے کہ یہ وہ نہیں ہے یا یہ اس جیسا ہے؟ عارف یہ سب کچھ طلب کرتا ہے یہاں تک کہ وہ اپنی ذات سے اس پر مطلع ہو جائے۔\n\nاور یہی وہ شخص ہے جو بصیرت کے ساتھ اللہ کی طرف بلاتا ہے اور اپنی ذات سے بصیرت پر ہوتا ہے، اور وہ دیکھتا ہے کہ کیا خلق کا خلق میں اثر صحیح امر ہے، یا یہ حق (الحق) کا خلق میں اثر ہے، یا خلق کا حق (الحق) میں، یا حق (الحق) کا حق (الحق) میں، یا یہ سب کا مجموعہ ہے، یا نفس الامر میں کوئی اثر نہیں ہے اگرچہ یہ ظاہر ہو کہ وہ اثر ہے۔ جیسا کہ رؤیت میں گزر چکا ہے، کیا مرئی حق (الحق) ہے یا خود دیکھنے والا؟ اور یہ اس کے ساتھ نہیں ہے کہ کوئی مرئی ثابت ہو جس کے بارے میں معلوم نہ ہو کہ وہ کیا ہے۔ اسی طرح شاید کشف (كشف) اور وقوع میں کسی اثر کا ثبوت ہو، پس اگر ہم اس کے محل کو حق (الحق) یا خلق قرار دیں تو یہ قرار دینا سچ نہیں ہو گا، حالانکہ وہاں حق (الحق) اور خلق کے سوا کچھ نہیں ہے، تو اثر کا محل کہاں ہے؟\n\nاور یہ ان مشکل ترین چیزوں میں سے ہے جنہیں نفس حاصل کرنا چاہتا ہے۔ پس جب عارف صحیح طریقے پر مطلع ہو جاتا ہے، تو وہ معرفت (المعرفۃ) کے درجے سے علم کے درجے کی طرف منتقل ہو جاتا ہے، اور ربانی عارف ہونے کے بعد الٰہی عالم بن جاتا ہے۔ اور الٰہی (إلهي) صرف اسی شخص کو کہا جاتا ہے جس کی یہ صفت ہو، کیونکہ اس کے لیے عام جامع امر ہوتا ہے۔ پس جب تم اس کی طرف دیکھتے ہو تو کہتے ہو کہ یہ حق (الحق) ہے، پھر تم اس کی طرف دیکھتے ہو تو ہم کہتے ہیں کہ یہ خلق ہے، پھر تم اس کی طرف دیکھتے ہو تو کہتے ہو کہ نہ حق (الحق) ہے نہ خلق، پھر تم اس کی طرف دیکھتے ہو تو کہتے ہو کہ حق (الحق) خلق ہے۔ پس تم اس میں اسی طرح حیران ہوتے ہو جیسے اللہ میں حیران ہوتے ہو، تب تم جانتے ہو کہ اس نے صورت حاصل کر لی ہے اور وہ حیوانی انسان سے جدا ہو چکا ہے۔\n\nاور جب تک انسان اپنی ذات سے ذوق، حال، کشف (كشف) اور شہود (شہود) کے ذریعے یہ نہیں جانتا، تو وہ اس صورت پر پیدا کیا گیا انسان نہیں ہے جسے کائنات میں امامت حاصل ہے اور جو صاحب عہد ہے۔ کیونکہ اللہ کا عہد ظالموں کو نہیں پہنچتا، اور اس کا عہد اس کی صورت کے سوا کچھ نہیں ہے۔ پس یہ جان لو، اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے۔ (قرآن ۳۳:۴)",
    "fa": "باب چهارصد و چهل و سوم در معرفت منازل واجبِ کشفِ عرفانی (واجب الكشوف العرفاني).\n\nهمانا معارف همواره یک چیز را می‌بخشند *** پس واجبِ کشف، عرفان به آحاد است\nو اگر به دومی تجاوز کند، پس از جانب نفس خود است *** و برای او در محفل سعادت است\nعلم را در زمانی یاری می‌کند، آنگاه که علم او را یاری می‌کند *** پس سعادتی است با سعادت\nشما آنان را نمی‌شناسید، **اللَّهُ يَعْلَمُهُمْ** (خداوند آنان را می‌شناسد) *** علمی چون معرفت (المعرفة)، و حکم از آنِ آشکارشونده است.\n\n[همانا سبب کشف عرفانی، طمع طبیعی در ربوبیت است]\n\nبدان، خداوند ما و تو را تأیید کند، که آنچه موجب کشف عرفانی (الکشف العرفاني) شده، طمع طبیعی در ربوبیت است تا سالک آنچه را که پروردگار از صفات مؤثر در کائنات داراست، شهود کند و به واسطه آن صفات در ربوبیت خود از طریق کشف (الکشف) و تحقیق ظاهر شود. پس ما نباید با صفت از اثر آن تجاوز کنیم، زیرا اسماء الهی به هم نزدیک‌اند و چه بسا کسی که کشف (الکشف) و ذوقی در آن‌ها ندارد، گمان کند که آن‌ها در هم تنیده یا مترادف هستند. در حالی که آن‌ها ذاتاً شبیه به هم هستند و هیچ کس جز با کشف (الکشف) به تحقیق آن دست نمی‌یابد. اما در اینجا نکته‌ای دقیق وجود دارد و آن این است که نسبت آن اسم الهی به پروردگار متعال، مانند نسبت آن به مخلوق نیست؛ زیرا امور هنگامی که به چیزی نسبت داده می‌شوند، نسبتشان با توجه به کسی که به او نسبت داده می‌شوند، متفاوت می‌شود، هرچند معنای آن اسم منسوب بر یک حقیقت (الحقیقة) واحد باشد.\n\nپس هنگامی که اهل کشف (الکشف) از نفوس خود بر آمادگی محل‌هایی که متأثر می‌شوند آگاه گردند، این آگاهی آنان را به سوی به دست آوردن وجوهی مشتاق می‌سازد که اگر با آن وجوه تأثیر بگذارند، ادب با خدا را حفظ کنند؛ زیرا آنان به واسطه خبر الهی دانسته‌اند که بر صورت الهی آفریده شده‌اند و خلافت جز به واسطه این صورت برایشان صحیح نیست. و هر انسانی که بر این صورت نباشد، پس او انسان حیوانی است، و انسان خلیفه نیز هست. و این انسان طالب نمی‌داند که کدام انسان است، آیا انسان حیوانی است یا امام؟ پس این آگاهی او را وادار می‌کند که از حق (الحق) تجلی (التجلی) خاصی را در ربوبیتش طلب کند و انفعال کائنات را از او ببیند، چنانکه صدیق (ابوبکر) فرمود: «چیزی را ندیدم مگر آنکه خدا را پیش از آن دیدم.» پس صدور کائنات را از او در کائنات می‌بیند و صورت تعلق را مشاهده می‌کند و می‌بیند که آیا حق (الحق) در آن تجلی (التجلی) بر صورت آنچه از او تکوّن می‌یابد است، یا بر صورت نسبتی است که به واسطه آن می‌گوید: «باش» (كن) پس آن چیز موجود می‌شود.\n\nو می‌بیند که مأمور به تکوین، تکوّن را از کجا می‌پذیرد، آیا آن را از امری وجودی می‌پذیرد یا خیر؟ و هنگامی که ظاهر می‌شود، آیا به صورت اسمی ظاهر می‌شود که حق (الحق) به واسطه آن به او گفت: «باش»، یا خودِ همان صورتی است که حق به واسطه آن گفت: «باش»؟ که در حقِ حق (الحق) اسماء بودند و در جوهرِ متکوَّن، خلق و صورت. و اگر چنین باشد، آیا آن صورت اسمی بر همان حالتی که آن را در حق (الحق) شهود (الشهود) کرده باقی می‌ماند، یا با آن اسم در صورتی دیگر برای تکوین عین دیگری ظاهر می‌شود، به دلیل اختلاف امثال و تمایزی که میان آن‌هاست و به واسطه آن گفته می‌شود: «این، آن نیست» یا «این، مانند آن است»؟ عارف همه این‌ها را می‌طلبد تا از نفس خود بر آن وقوف یابد. و این همان شخصی است که بر بصیرت به سوی خدا دعوت می‌کند و از نفس خود بر بصیرت است.\n\nو می‌بیند که آیا تأثیر خلق در خلق امری صحیح است، یا تأثیر حق (الحق) در خلق است، یا خلق در حق، یا حق در حق، یا مجموعه این‌هاست، یا در نفس‌الامر اثری وجود ندارد، هرچند که به نظر می‌رسد اثر هست؟ چنانکه در رؤیت پیشتر آمد، آیا مرئی، حق (الحق) است یا نفسِ بیننده؟ و این در حالی نیست که مرئی ثابتی وجود داشته باشد که ماهیتش معلوم نباشد. همچنین ممکن است ثبوت اثری در کشف (الکشف) و در وقوع باشد؛ اگر محل آن را حق (الحق) یا خلق قرار دهیم، این قرار دادن صادق نیست، در حالی که جز حق و خلق چیزی نیست. پس محل اثر کجاست؟ و این از دشوارترین اموری است که نفس در پی تحصیل آن است. پس هنگامی که عارف بر وجه صحیح آگاه شود، از درجه معرفت (المعرفة) به درجه علم منتقل می‌شود و پس از آنکه عارفی ربانی بود، عالمی الهی می‌گردد. و صفت الهی جز بر کسی که این ویژگی را دارد اطلاق نمی‌شود، زیرا او امر عام جامع را داراست. هنگامی که به او بنگری، می‌گویی او حق (الحق) است؛ سپس به او می‌نگری و می‌گوییم او خلق است؛ سپس به او می‌نگری و می‌گویی نه حق است و نه خلق؛ سپس به او می‌نگری و می‌گویی حقِ خلق است. پس در او حیران می‌شوی، همانند حیرتت در خدا. در آن هنگام می‌دانی که او صورت را به دست آورده و از انسان حیوانی جدا شده است. و هرگاه انسان این را از نفس خود به ذوق و حال و کشف (الکشف) و شهود (الشهود) نشناسد، پس او آن انسان مخلوق بر صورت نیست که امامت در کون از آن اوست و صاحب عهد است؛ زیرا **إِنَّ اللَّهَ لَا يَنَالُ عَهْدَهُ الظَّالِمُونَ** (همانا عهد من به ستمکاران نمی‌رسد) و عهد او چیزی جز صورتش نیست. پس این را بدان. **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}