{
  "id": 377,
  "title": {
    "ar": "الباب السابع والسبعون وثلاثمائة في معرفة منزل سجود القيومية والصدق والمجد واللؤلؤة والسور",
    "en": "Chapter Three Hundred and Seventy-Seven: Concerning the Gnosis (المعرفة) of the Station (المنزل) of the Prostration of Self-Subsistence (سجود القيومية), Truthfulness (الصدق), Glory (المجد), the Pearl (اللؤلؤة), and the Rampart (السور).",
    "ur": "باب تین سو ستترواں: قیومیت کے سجدے (سجود القيومية)، صدق (الصدق)، مجد (المجد)، لؤلؤہ (اللؤلؤة)، اور سور (السور) کے مقام کی معرفت میں",
    "fa": "باب سیصد و هفتاد و هفتم در معرفت منزل سجود قیومیت و صدق و مجد و لؤلؤ و سور (دیوار)"
  },
  "content": {
    "ar": "## «الباب السابع والسبعون وثلاثمائة في معرفة منزل سجود القيومية والصدق والمجد واللؤلؤة والسور»\n\n\n> إذا وضع الميزان في قبة العدل *** وجاء الحق للحكم والفصل‏\n\n\n> يقوم لنا شكل بديع مثلث *** فضلعان في مثل وضلع بلا مثل‏\n\n\n> ولا بد من ترجيحه لبقائه *** فلا بد من أمر يؤيد بالفضل‏\n\n\n> فيذهب حكم الميل عند استواءه *** ويرجح ميزان السعادة بالثقل‏\n\n\n### [كل ما سوى الله ملك‏]\n\n\nاعلم أيدك الله أنه ثبت شرعا وعقلا أنه تعالى سبحانه أحدي المرتبة فلا إله إلا هو الله وحده لا شريك له في الملك والملك كل ما سوى الله وأما أن يكون له تعالى ولي فما هومثل الشريك في الملك فإن ذلك منفي على الإطلاق لأنه في نفس الأمر منفي العين وأما الولي فموجود العين فهو ينصر الله ابتغاء القربة إليه والتحجب عسى يصطفيه ويدنيه لا لذل ناله فينصره على من أذله أو ينصره لضعفه تعالى الله قال تعالى إِنْ تَنْصُرُوا الله وقال وهُوَ خَيْرُ النَّاصِرِينَ فما قال إِنْ تَنْصُرُوا الله إلا ولا بد من وقوع هذا النصر ولكن كما ذكرنا وهو قوله تعالى ولَمْ يَكُنْ لَهُ وَلِيٌّ من الذُّلِّ أي ناصر من أجل الذل وكَبِّرْهُ تَكْبِيراً عن هذين الوصفين كما أنه تعالى بدليل العقل والشرع أحدي الكثرة بأسمائه الحسنى أو صفاته أو نسبه وهو بالشرع خاصة أحدي الكثرة في ذاته بما أخبر به عن نفسه بقوله بَلْ يَداهُ مَبْسُوطَتانِ ولِما خَلَقْتُ بِيَدَيَّ وتَجْرِي بِأَعْيُنِنا والقلب بين أصبعين من أصابع الرحمن‏\n\n\nوالسَّماواتُ مَطْوِيَّاتٌ بِيَمِينِهِ وكلتا يدي ربي يمين مباركة\n\n\nوهذه كلها وأمثالها إخبار عن الذات أخبر الله بها عن نفسه والأدلة العقلية تحيل ذلك فإن كان السامع صاحب النظر العقلي مؤمنا تكلف التأويل في ذلك لوقوفه مع عقله وإن كان السامع منور الباطن بالإيمان آمن بذلك على علم الله فيه مع معقول المعنى الوارد المتلفظ به من يد وأصبع وعين وغير ذلك ولكن يجهل النسبة إلى أن يكشف الله له عن بصيرته فيدرك المراد من تلك العبارة كشفا فإن الله ما أرسل رسولا إِلَّا بِلِسانِ قَوْمِهِ أي بما تواطئوا عليه من التعبير عن المعاني التي يريد المتكلم أن يوصل مراده فيما يريد منها إلى السامع فالمعنى لا يتغير البتة عن دلالة ذلك اللفظ عليه وإن جهل كيف ينسب فلا يقدح ذلك في المعقول من معنى تلك العبارة\n\n\n> واحد وهو كثير عجب *** وهو للحاصل فيه مذهب‏\n\n\n> إنما العلم لمن حصله *** بطريق الذوق فهو المشرب‏\n\n\n> أيها الطالب كنزا إنه *** عين ما جئت به ما تطلب‏\n\n\n### [الوحدة التي لا كثرة فيها محال‏]\n\n\nواعلم أيدك الله أنه من المحال أن يكون في المعلومات أمر لا يكون له حكم ذلك الحكم ما هو عين ذاته بل هو معقول آخر فلا واحد في نفس الأمر في عينه لا يكون واحد الكثرة فما ثم إلا مركب أدنى نسبة التركيب إليه أن يكون عينه وما يحكم به على عينه فالوحدة التي لا كثرة فيها محال‏\n\n\n### [التركيب الذاتي الواجب للمركب الواجب الوجود لنفسه‏]\n\n\nواعلم أن التركيب الذاتي الواجب للمركب الواجب الوجود لنفسه لا يقدح فيه القدح الذي يتوهمه النظار فإن ذلك في التركيب الإمكانى في الممكنات بالنظر إلى اختلاف التركيبات الإمكانية فيطلب التركيب الخاص في هذا المركب مخصصا بخلاف الأمر الذي يستحقه الشي‏ء لنفسه كما يقول في الشي‏ء الذي يقبل الأشكال لنفسه لا تقول إن ذلك له بجعل جاعل أعني قبول الأشكال وإنما الذي يكون له بالمخصص كون شكل خاص دون غيره مع إمكان قيام شكل آخر به فلا بد\nمن مخصص لا قابل للاشكال فإن ذلك لنفسه فالتركيب الذاتي الذي يقتضيه الواجب الوجود لنفسه خارج عن هذا الحكم لأنه مجهول الماهية عند النظار فنسبة التركيب إليه مجهولة مع معقولية التركيب ومعنى التركيب كونه كثيرا في ذاته كما لم يقدح فيه كونه له صفات قديمة عند مثبتي الصفات من النظار كالأشاعرة وما وجدنا عقلا يقيم دليلا قط على أنه تعالى لا يحكم عليه بأمر فغاية من غاص في النظر العقلي واشتهر من العلماء أنه عقل صرف لا حظ له في الايمان إنه حكم عليه بأنه علة فما خلص التوحيد له في ذاته حين حكم عليه بالعلية وأما غيرهم من النظار فحكموا عليه بالنسب وأن ثم أمرا يسمى القائلية والقادرية بهما حكمنا حكما عليه إنه قائل وقادر وأما غير هؤلاء من النظار فحكموا عليه بأن له صفات زائدة على ذاته قديمة أزلية قائمة بذاته تسمى حياة وعلما وقدرة وإرادة وكلاما وسمعا وبصرا بها يقال فيه إنه حي عالم قادر مريد متكلم سميع بصير وجميع الأسماء من حيث معانيه أعني الأسماء الإلهية تندرج تحت هذه الصفات الأزلية القديمة القائمة بذات الحق ومن النظار من جعل لكل اسم إلهي معنى معقولا يعقل منه أن ذلك المعنى قائم بذات الحق قديم أزلي ولو كان ما كان وبلغ ما بلغ من الأعداد وروينا عن أبي بكر القاضي الباقلاني أنه يقول بهذا غير أنهم اتفقوا بالنظر العقلي على إن الحوادث لا تقوم به فما أخلوا ذاته عن حكم إما بنسب وإما بصفات وإما بمعاني أسماء ثم جاء الشرع وهو ما ترجمه الرسول صَلَّى اللهُ عَليهِ وسَلَّم وقال إنه كلام الله وأقام الدلالة على صدقه أنه من عند الله وأخبر أنه في كل ما ينطق عن الله ما يَنْطِقُ عَنِ الْهَوى‏ إِنْ هُوَ إِلَّا وَحْيٌ يُوحى‏ ينزل به الروح الأمين على قلبه أو يلهمه الله إلهاما في نفسه بأنه تعالى على كذا وكذا من أمور وصف بها نفسه وذكر عن ذاته أنها على ما أخبر بعبارات تعلم في العرف بالتواطؤ معانيها لا نشك في ذلك بأي لسان أرسل ذلك الرسول وأضاف تلك المعاني إلى نفسه وذاته إنه عليها من يدين وأصبعين ويمين وأعين ومعية وضحك وفرح وتعجب وتبشبش وإتيان ومجي‏ء واستواء ونزول وبصر وعلم وكلام وصوت وأمثال ذلك من هرولة وحد ومقدار ورضي وغضب لأسباب حادثة من العبيد المكلفين فعلوها أغضبوا بها ربهم فقبل الغضب ووصف نفسه به ووصف نفسه بأن العبد إذا تصدق مثلا يطفئ بصدقته غضب الله عليه وهذا كله معقول المعنى مجهول لنسبة إلى الله يجب الايمان به على كل إنسان خوطب أو كلف به من عند الله وهذا كله خارج عن الدلالة العقلية إلا أن يتأول فحينئذ يقبله العقل فقبوله بالإيمان أولى لأنه حكم حكم به الحق على نفسه أنه كذا مع أنه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فنفى عنا العلم بوجه النسبة إليه ما نفى الحكم بذلك عن نفسه وحكمه سبحانه بأمر على نفسه أولى بنا أن نقبله منه من حكم حكم به مخلوق وهو العقل عليه فما أعمى من اتبع عقله في حكمه بما حكم به على ربه ولم يتبع ما حكم به الرب على نفسه وأي عمى أشد من هذا ولا سيما والمترجم عن الله تعالى وهو الرسول صَلَّى اللهُ عَليهِ وسَلَّم قد نهى المكلفين أصحاب العقول أن يفكروا في ذات الله وأن يصفوها بنعت ليس في إخبار الله عن نفسه فعكسوا القضية وفكروا في ذات الله وحكموا بما حكموا به على ذاته تعالى ولما جاء إخباره إلينا بما هو عليه في ذاته أنكروا ذلك بعقولهم وردوه وكذبوا الرسل ومن صدقهم من هؤلاء جعلوا ذلك سياسة من حكيم عاقل لمصلحة الوقت وتوفر الدواعي بالجمعية على إله هذه صفته تقريرا في النفوس القاصرة فإذا قرروا ذلك ظهروا للناس في العامة بالارتباط بتلك الصفات مثل ما هي العامة عليه وفي أنفسهم خلاف ما ظهروا به وأما من أعطاه نظره وجود الرسول وصدقه فيما أخبر فغايته التأويل حتى لا يخرج عن حكم عقله على ربه فيما أخبر به عن نفسه فكأنه في تصديقه مكذب وأما أهل السلامة الذين لا نور عندهم إلا نور الايمان سلموا ذلك إلى الله على علم الله فيه مع الايمان والتحقيق لما تعطيه‏\n\n\nتلك العبارات من المعاني بالتواطؤ عليها في ذلك اللسان المبعوث به هذا الرسول وأما أهل الكشف والوجود فآمنوا كما آمن هؤلاء ثم اتقوا الله فيما حد لهم وشرع فجعل لهم فرقانا فرقوا به بين نسبة هذه الأحكام إلى الله ونسبتها إلى المخلوق فعرفوا معانيها عن عيان وعلم ضروري وإلى هنا انتهوا فانظر في تفاوت العقول في الأمر الواحد واختلاف الطرق فيه لمن كان له عقل سليم وألقى السمع لخطاب الحق وهو شهيد لمواقع الخطاب الإلهي على الشهود والكشف فإذا تقرر ما ذكرناه وكان الأمر على ما شرحناه وبيناه فاعلم أن الله هو الظاهر الذي تشهده العيون والباطن الذي‏\nتشهده العقول فكما أنه ما ثم في المعلومات غيب عنه جملة واحدة بل كل شي‏ء له مشهود كذلك ما هو غيب لخلقه لا في حال عدمهم ولا في حال وجودهم بل هو مشهود لهم بنعت الظهور والبطون للبصائر والأبصار غير أنه لا يلزم من الشهود العلم بأنه هو ذلك المطلوب إلا بإعلام الله وجعله العلم الضروري في نفس العبد أنه هو مثل ما يجد لنائم إذا رأى صورة الرسول أو الحق تعالى في النوم فيجد في نفسه من غير سبب ظاهر أن ذلك المرئي هو الرسول إن كان الرسول أو الحق إن كان الحق وذلك الوجد إن حق في نفسه مطابق لما هو الأمر عليه فيما رآه هكذا يكون العلم بالله فلا يدرك إلا هكذا إلا بتفكر ولا بنظر حتى لا يدخل تحت حكم مخلوق وإذا كان الأمر بهذه المثابة وأخبر عن نفسه أنه يتحول في الصور مع ثبوت هذه الأحكام حكمنا عليه بما يحكم به على الصور التي يتجلى فيها لعباده كانت ما كانت فليس ثم غيره ولا سيما في الموطن الذي يعلم من حقيقته أنه لا يمكن فيه دعوى في الألوهية إلا لله فلا نضرب له مثلا\n\n\n> فإنه عين المثل *** سبحانه عز وجل‏\n\n\n> وكلنا منه إذا *** حققته علي وجل‏\n\n\n> إلا الذي بشره *** بالأمن منه وبجل‏\n\n\nففعل ما يقتضيه الموطن فإن العالم بالأمور لا يزيد في الظهور على حكم ما يقضي به الوقت ولذلك قالت الطائفة في الصوفي إنه ابن وقته وهذا حكم الكمل من الرجال كما\n\n\nيقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وهو الرءوف الرحيم في حق طائفة يوم القيامة سحقا سحقا\n\n\nفإذا زال ذلك الحال تلطف في المسألة وشفع فيمن هوت به الريح وهو قوة حكم هوى النفس في مكان سحيق فيقوم الحق في الحال الواحد بصفة الغضب والرضي والرحمة والعذاب لحكم الظاهر والباطن والمعز والمذل فكأنه برزخ بين صفتيه فإنه ذو قبضتين ويدين لكل يد حكم وفي كل قبضة قوم مثل الكتابين اللذين خرج بهما رسول الله صَلَّى اللهُ عَليهِ وسَلَّم على أصحابه وأخبرهم أن في أحدهما أسماء أهل الجنة وأسماء آبائهم وعشائرهم وقبائلهم من حين خلق الله الناس إلى يوم القيامة وفي الكتاب الآخر أسماء أهل النار وأسماء آبائهم وقبائلهم وعشائرهم من حين خلق الله الناس إلى يوم القيامة ولو كتب هذا بالكتابة المعهودة ما وسعت الأوراق مدينة فكيف أن يحيط بذلك كتابان في يدي الرسول صَلَّى اللهُ عَليهِ وسَلَّم فهذا من علم إدخال الواسع في الضيق من غير أن يوسع الضيق أو يضيق الواسع فمن شاهد هذه الأمور مشاهدة وحصلت له ذوقا فذلك هو العالم بالله وبما هو الأمر عليه في نفسه وعينه فإن الصحيح أن لشي‏ء لا يدرك إلا بنفسه وليس له دليل قاطع عليه سوى نفسه والبصر له الشهود والعقل له القبول وأما من طلب معرفة الأمور بالدلائل الغريبة التي ليست عين المطلوب فمن المحال أن يحصل على طائل ولا تظفر يداه إلا بالخيبة فأما المقربون فهم بين يدي الله في مقابلة الذات الموصوفة باليدين فإنهم لتنفيذ الأوامر\n\n\nالإلهية في الخلق في كل دار وأما أهل اليمين فليس لهم هذا التصريف بل هم أهل سلامة وبراءة لما كانوا عليه وهم عليه من قوة الحكم على نفوسهم وقمعهم هواهم باتباع الحق وأما أهل اليد الأخرى الذين قيل فيهم إنهم أصحاب الشمال فنكسوا رءوسهم ومنهم المقنع رأسه الذي لا يرتد إليه طرفه بهتا لعظيم ما يرى فلا يرى طائفة من هؤلاء الثلاثة إلا ما يعطيه مقامها ومنزلها ومكانها فتشهد كل طائفة من الله خلاف ما تشهده الأخرى والحق واحد فلو لا ما هو الأمر واحد الكثرة لما اختلف شهودهم فلو لا الكثرة في الواحد لما كان الأمر إلا واحد إلا يقبل القسمة وقد قبل القسمة فالأصل كهو وهذا سبب وجود الدارين في الآخرة والكفتين في الميزان والرحمة المقيدة بالوجوب والمطلقة بالامتنان وتفاضل المراتب في الدرجات في الجنان والدركات في النار\n\n\n> فليس إلا الواحد الكثير *** بمثل هذا تشهد الأمور\n\n\n> فانظر إذا ما جاءك الغرور *** حقا بلا شك له النذير\n\n\n> وكل ما تقوله فزور *** تضيق من سماعه الصدور\n\n\nفإذا تجلى الحق في صفة الجبروت لمن تجلى من عباده فإن كان المتجلي له ليس له مدبر غير الله كجبل موسى تدكدك لتجليه فإنه ما فيه غير نفسه وإن كان له مدبر قد جعله الله له كتدبير النفوس الناطقة أبدانها لم تتدكدك أجسامها لكن‏\nأرواحها حكم فيها ذلك التجلي حكمه في الجبل فبعد إن كان قائما بتدبير الجسد زال عن قيامه فظهر حكم الصعق في جسد موسى وما هو إلا إزالة قيام المدبر له خاصة كما زال الجبل عن وتديته فثبت في نفسه ولم يثبت غيره فإن الجبل ما وضعه الله إلا ليسكن به ميد الأرض فزال حكمه إذا زالت جبليته كما زال تدبير الروح لجسد صاحب الصعق إذ زال قيامه به فأفاق موسى بعد صعقه ولم يرجع الجبل إلى وتديته لأنه لم يكن هناك من يطلبه لوجود العوض هو غيره من الجبال وهذا الجسد الخاص ما له مدبر مخلوق سوى هذا الروح فطلب الجسم من الله بالحال مدبره فرده الله إليه فأفاق فالنشأة الطبيعية تحفظ التدبير على روحها المدبر لها لأنها لا غنى لها عن مدبر يدبرها والأرض لا تحفظ وتدية جبل عليه معين لاستغنائها عنه بأمثاله لكن لا غنى لها عن المجموع إذا طلب السكون فهذا سبب علة إفاقة موسى وعدم رجوع الوتدية للجبل فالجبال مخلوقة بالأصالة صفة الرحمة واللطف والتنزل فظهرت ابتداء بصورة القهر حيث سكنت ميد الأرض فكانت رحمتها في القهر فلا تعرف التواضع فإنها ما كانت أرضا ثم صارت جبالا فأول جبل أنزله الله عن قهره وجبروته بالحجاب الذي كان الحق احتجب عنه حجاب شهود لا حجاب علم جبل موسى بالتدكدك فصار أرضا بعد ما كان جبلا فهو أول جبل عرف نفسه ثم بعد ذلك في القيامة تصير الجبال دكا دكا لتجلى الحق إذا كانت كالعهن المنفوش فمد الأرض إنما هو مزيد امتداد الجبال وتصييرها أرضا فما كان منها في العلو في الجو إذا انبسط زاد في بسط الأرض ولهذا جاء الخبر أن الله يمد الأرض يوم القيامة مد الأديم فشبه مدها بمد الأديم وإذا مد الإنسان الأديم فإنه يطول من غير أن يزيد فيه شي‏ء لم يكن في عينه وإنما كان فيه تقبض ونتوء فلما مدا نبسط عن قبضه وفرش ذلك النتوء الذي كان فيه فزاد في سعة الأرض ورفع المنخفض منها حتى بسطة فزاد فيها ما كان من طول من سطحها إلى القاع منها كما يكون في الجلد سواء فلا ترى في الأرض عِوَجاً ولا أَمْتاً فيأخذ البصر جميع من في الموقف بلا حجاب من ارتفاع وانخفاض ليرى الخلق بعضهم بعضا فيشهدوا حكم الله بالفصل والقضاء في عباده لوجود الصفتين وحكم القدمين من الظاهر والباطن‏\n\n\n> فلو لا ظهور الحق ما كان إنسان *** ولو لا بطون الحق ما قام برهان‏\n\n\n> فما ثم إلا واجب ثم واجب *** إذا ما علمت الأمر ما ثم إمكان‏\n\n\n> فما أكمل في الكون من عين ذاته *** وهذا الذي سماه في الكون إنسان‏\n\n\n> وما ثم مقصود سواه فإنه *** هو الحق لا يحجبك خلد ونيران‏\n\n\n> فإن الذي أبداه أعلم أنه *** له غضب يبديه ووقتا ورضوان‏\n\n\n> فلا بد من دارين دار كرامة *** ودار عذاب فيه للعقل تبيان‏\n\n\n> وهذا الذي جئنا به في كلامنا *** هو الحق إن فكرت ما فيه بهتان‏\n\n\nوكيف لا تعرف هذا من نفس ما نطقت به وترجمت عنه‏\n\n\n> وقد علمت بأن الحق أيدني *** فما أفوه به عنه وقيدني‏\n\n\n> به فلا تبرح الأرواح تنزل بي *** على الدوام وتهواني فتقصدني‏\n\n\n> وذاك أن لنا عينا مكملة *** بها يرى نفسه من كان يشهدني‏\n\n\n> لذاك أوجدني ربي وخصصني *** فكل ما فيه منه حين يوجدني‏\n\n\n> وانظر إلي ترى في صورتي عجبا *** في كل حال إله الحق يسعدني‏\n\n\n> إذا هممت بأمر لا يقاومه *** أمر وجدت إلهي فيه يعضدني‏\n\n\n> فكل عقل يرى ربي يوحده *** والحق حين يراني بي يوحدني‏\n\n\n> فالله يعلم ما في الغيب من عجب *** وبالوصول إليه الحق يفردني‏\n\n\nوفي هذا المنزل من العلوم ما في الكتب الأربعة وهي القرآن والتوراة والإنجيل والزبور وفيه علم ما سبب إنزال الكتب وما نزل إلا كلام على الرسل وكتب عن الرسل في الكتب وإنما نزل كتابة إلى السماء الدنيا فيما نقل وذلك ليلة القدر\nموافقة ليلة النصف من شعبان ثم نَزَلَ به الرُّوحُ الْأَمِينُ على قلب محمد صَلَّى اللهُ عَليهِ وسَلَّم منجما في ثلاث وعشرين سنة أو في عشرين سنة على الخلاف وفيه علم تسمية الترجمة انزالا وتنزيلا وفيه علم من كشف عنه الغطاء حتى شاهد الأمر على ما هو عليه هل هو مخاطب بالآداب السمعية أو يقتضي ذلك المقام الذهول وذهاب عقل التكليف فيبقى بلا رسم مع المهيمن من الملائكة وفيه علم الوصايا والآداب وأحوال المخاطبين والمطرفين وفيه علم حفظ الجوار على الجار وهل الجار إذا انتهك حرمة جاره هل يجازيه جاره بمثل ما أتى به أو يكون مخاطبا بحفظ الجوار ولا يحازيه بالإساءة على إساءته وفيه علم حال الموصوف بأنه يأمر بمكارم الأخلاق ومنها العفو والصفح وتفريج الكرب بضمان التبعات لما هو عليه من الغني في الأداء عنه ثم بعد ذلك يعاقب والعفو مندوب إليه والضمان أيضا مندوب إليه فبأي صفة تكون العقوبة ممن هذا نعته وفيه علم الفرق بين الأمر وصفته وفيه علم ما حرم من الزينة وما أبيح منها وما حظر منها وموطن كل زينة وفيه علم الفرق بين الخبيث والطيب وفيه علم مرجع الدرك في الدار الآخرة على من يكون إذا كان في ضمنه شخصان الواحد مفلس والآخر موسر وفيه علم الثناء وتفاصيله بالأحوال وفيه علم مخاطبة الموتى بعضهم بعضا في حال موتهم وهل حالهم بعد الموت مثل حالهم قبل الإيجاد أم لا وفيه علم الموت وماهيته وفيه علم الفصل بين القبضتين وفيه علم التكليف يوم القيامة وقبل دخول الجنة وفيه علم العلامات في السعداء والأشقياء ومن لا علامة له لأي فريق يكون وفيه علم من حلف على شي‏ء أكذبه الله وقد ورد من يتألى على الله يكذبه وفيه علم ما السبب الموجب للمنعوت بالكرم إذا سأله المضطر المحروم وهو قادر على مواساته وبذله ما سأله بذله فلم يفعل وبما ذا يعتذر وما صفة هذا السائل المرحوم وفيه علم أولاد الليل والنهار بما ذا يفرق بينهم وفيه علم سباحة عالم الأنوار وفيه علم قيام العبد بالصفتين المتضادتين وهو محمود عند الله عز وجل في الحالين وفيه علم كون الرحمة قد وَسِعَتْ كُلَّ شَيْ‏ءٍ ثم وصفت بالقرب من بعض الأشخاص لصفات قامت به فهل هي هذه الرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ أو رحمة أخرى وفيه علم من أسعده الله على كره منه في السعادة وهو في علم الله سعيد وفيه علم قول الأعمى للبصير ما لك أعمى لا تبصر شيئا أما تراني أبصر الظلمة وأنت لا تراها وتزعم أنك تبصر وفيه علم الاعتبار وعلم الإمكان والممكنات وعلم السيمياء وعلم الورث والوارثين وعلم الدلالات على الوقائع وعلم التشبيه وعلم الغيرة وفيه علم الشوق والاشتياق وفيه علم التوبة ما هي وتقاسيمها والتائبين وفيه علم كل شي‏ء وفيه علم الذوق وفيه علم تأثير الأحوال وفيه علم التقييد والإطلاق وفيه علم رفع الأثقال وفيه علم الاختصاص وفيه علم تقاسيم العلوم وفيه علم المراتب وفيه علم تبديل الشرائع ونسخ بعضها بعضا وفيه علم الخلف والخلف بسكون اللام وفتحها وفيه علم التهويل والتخويف من غير إيقاع ما يخوف به وفيه علم العهود والمواثيق البرزخية وفيه علم التسليم وفيه علم الاستدراج وإظهار البعد في عين القرب وما صفة من يعرف ذلك وفيه علم أوقات الموقتات وفيه علم ما يعطيه العلم الذي يقتضي العمل من العمل فإنه من المحال أن يكون علم يعطي العمل قيامه بصاحبه ولا يعمل ولا يجوز ذلك كثير من الناس وهم فيه على غلط فالعلم يقتضي العمل ولا بد وفيه علم الشركة في الأسماء وما يؤثر وفيه علم العجز وحيث ينفع ويكون دليلا وفيه علم منافع الأعضاء وفيه علم ما يدفع به الخاطر الشيطاني والنفسي من الإنسان وفيه علم مراتب السجود في الساجدين وما الذي أسجدهم وما السجود الذي لا رفع بعده لمن سجده والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Seventy-Seven: Concerning the Gnosis of the Station of the Prostration of Self-Subsistence (Qayyumiyya), Sincerity (Sidq), Glory (Majd), the Pearl, and the Wall.\n\nWhen the Balance is placed in the Dome of Justice,\nAnd the Real (al-Haqq) comes for judgment and decision,\n\nA wondrous triangular form arises for us,\nTwo sides are in likeness, and one side is without likeness.\n\nAnd it must be weighted down for its subsistence (baqa’),\nSo there must be a matter supported by grace (fadl).\n\nThe rule of inclination vanishes when it is level,\nAnd the balance of felicity is weighted down by heaviness.\n\n### [Everything other than Allah is Dominion (Mulk)]\n\nKnow, may Allah support you, that it is established legally (shar‘an) and rationally (‘aqlan) that He, the Exalted, is One (ahadi) in rank (martaba). There is no god but Him, Allah alone, having no partner in the Dominion (Mulk). And the Dominion is everything other than Allah. As for Him having a protector (wali), this is not like a partner in the Dominion, for that is absolutely negated because it is negated in its very essence (‘ayn). But the protector (wali) is existent in essence. He supports Allah seeking proximity to Him and seeking concealment, hoping that He may choose him and draw him near, not because of some humiliation He suffered that the protector might help Him against the one who humiliated Him, or help Him because of His weakness—exalted is Allah! Allah the Exalted said: <<If you support Allah>> (Qur’an 47:7), and He said: <<And He is the best of helpers>> (Qur’an 3:150). He only said <<If you support Allah>> because this support must necessarily occur, but it is as we mentioned, and as He said: <<And He has no protector (wali) out of weakness>> (Qur’an 17:111)—meaning, a helper due to weakness—<<And magnify Him with all magnificence>> (Qur’an 17:111) far above these two descriptions.\n\nJust as He, by rational and legal proof, is the Unity of Multiplicity (ahadiyyat al-kathra) through His Beautiful Names (Asma’ al-Husna), or His Attributes (Sifat), or His relations (nisab); so too, specifically by legal proof (shar‘an), He is the Unity of Multiplicity in His Essence (Dhat) through what He has reported about Himself in His saying: <<Nay, both His Hands are outstretched>> (Qur’an 5:64), and <<To that which I created with My two Hands>> (Qur’an 38:75), and <<And sailing under Our Eyes>> (Qur’an 54:14), and [the Hadith]: \"The heart is between two Fingers of the Fingers of the Merciful.\" And <<And the heavens will be rolled up in His Right Hand>> (Qur’an 39:67), and [the Hadith]: \"And both Hands of my Lord are a blessed Right Hand.\"\n\nAll these and their likes are reports concerning the Essence (Dhat) that Allah reported about Himself. Rational proofs (al-adilla al-‘aqliyya) deem this impossible. If the listener is a person of rational speculation (al-nazar al-‘aqli) and a believer, he will force an interpretation (ta’wil) of this, due to his adherence to his intellect. But if the listener is illuminated in his inner being (batin) by faith, he believes in this based on Allah’s Knowledge concerning it, along with the intelligible meaning (ma‘qul al-ma‘na) of the incoming, uttered terms like Hand, Finger, Eye, and so forth. However, he remains ignorant of the proportion/relation (nisba) until Allah unveils his inner sight (basira) for him, so that he grasps the intended meaning of that expression through unveiling (kashf). For Allah did not send any messenger <<Except with the language of his people>> (Qur’an 14:4)—meaning, with the expressions they agreed upon (tawata’u) for conveying the meanings that the speaker intends to communicate to the listener. Thus, the meaning never changes from the indication of that word, even if the manner of its relation (kayf yunsab) is unknown. This ignorance does not invalidate the intelligible meaning of that expression.\n\nOne, yet He is Multiplicity—a wonder!\nAnd He is the path for the one who attains Him.\n\nKnowledge belongs only to him who attains it\nBy the path of tasting (dhawq); that is the drinking place.\n\nO seeker of a treasure, verily, it is\nThe very essence of what you brought forth, that which you seek.\n\n### [Unity (Wahda) without Multiplicity (Kathra) is Impossible]\n\nKnow, may Allah support you, that it is impossible (muhal) for there to be anything among the known things (ma‘lumat) that does not possess a ruling (hukm) where that ruling is not the very essence of its self (‘ayn dhatihi), but rather is another intelligible concept (ma‘qul akhar). Thus, there is no One in reality (fi nafs al-amr) whose essence is not the One of Multiplicity (wahid al-kathra). Therefore, there is nothing but a composite (murakkab), the lowest degree of composition (tarkib) being that it is its essence and that which is ruled upon its essence. Hence, Unity (Wahda) that contains no Multiplicity is impossible (muhal).\n\n### [The Essential Composition (al-Tarkib al-Dhati) Necessary for the Composite Necessary of Existence (Wajib al-Wujud) in Itself]\n\nKnow that the Essential Composition (al-Tarkib al-Dhati) necessary for the Composite Necessary of Existence (Wajib al-Wujud) in Itself does not suffer the flaw that speculative thinkers (al-nuzzar) imagine. That flaw applies only to contingent composition (al-tarkib al-imkani) in contingent things (al-mumkinat), when considering the differences in contingent compositions. They seek a specific composition in this composite that is specialized by a specific factor (mukhassis), unlike the matter which a thing deserves inherently (li-nafsihi). For example, concerning a thing that accepts forms inherently, you do not say that this acceptance is due to the action of a maker (ja‘il); rather, what is due to the specific factor is the existence of a particular form rather than another, even though the possibility of another form subsisting in it exists. Thus, there must be a specific factor, but not for the acceptance of forms, for that is inherent to the thing itself. Therefore, the Essential Composition (al-Tarkib al-Dhati) that the Necessary Existent (Wajib al-Wujud) requires inherently is outside this ruling, because its quiddity (mahiyya) is unknown to the speculative thinkers. The relation of composition (nisbat al-tarkib) to Him is unknown, even though composition and the meaning of composition—His being Multiplicity in His Essence—are intelligible concepts.\n\nJust as His being Multiplicity in His Essence did not flaw Him in the view of those speculative thinkers, like the Ash‘aris, who affirm that He possesses Eternal Attributes (sifat qadima). We have never found a rational proof that establishes that He, the Exalted, cannot be ruled upon by some matter. The utmost achievement of those who delved into rational speculation and became famous among scholars—those who claim He is pure intellect (‘aql sarf) and have no share in faith—is that they ruled upon Him as being a Cause (‘illa). Thus, their affirmation of Unity (Tawhid) was not perfected in His Essence when they ruled upon Him with causality. As for other speculative thinkers, they ruled upon Him by relations (nisab), holding that there is a matter called \"Being a Speaker\" (al-qa’iliyya) and \"Being Powerful\" (al-qadiriyya), by which we rule upon Him that He is a Speaker (qa’il) and Powerful (qadir). As for yet other speculative thinkers, they ruled upon Him that He possesses Attributes (sifat) that are additional to His Essence (Dhat), eternal (azaliyya), subsisting in His Essence, called Life, Knowledge, Power, Will, Speech, Hearing, and Sight. By these, it is said of Him that He is Living, Knowing, Powerful, Willing, Speaking, Hearing, Seeing. All the Names (al-Asma’), in terms of their meanings—meaning the Divine Names (al-Asma’ al-Ilahiyya)—fall under these eternal, ancient Attributes subsisting in the Essence of the Real (Dhat al-Haqq). Among the speculative thinkers are those who assigned to every Divine Name an intelligible meaning (ma‘nan ma‘qul) from which it is understood that this meaning subsists in the Essence of the Real, ancient and eternal, no matter what it was or how high the number reached. We have narrated from the Qadi Abu Bakr al-Baqillani that he held this view. However, they all agreed, based on rational speculation, that contingent events (al-hawadith) do not subsist in Him. Thus, they did not leave His Essence devoid of a ruling, whether by relations (nisab), or by attributes (sifat), or by the meanings of the Names.\n\nThen came the Divine Law (al-Shar‘), which the Messenger (peace and blessings of Allah be upon him) translated and said was the Speech of Allah (Kalam Allah). He established the proof of its truthfulness, that it is from Allah, and reported that in everything he speaks on behalf of Allah, <<He does not speak from [his own] desire. It is nothing but a Revelation revealed>> (Qur’an 53:3-4), which the Trustworthy Spirit (al-Ruh al-Amin) brings down upon his heart, or which Allah inspires in his soul (ilhama) that He, the Exalted, is such-and-such concerning matters by which He described Himself. He mentioned concerning His Essence (Dhat) that it is as He reported, using expressions whose meanings are known by common agreement (‘urf bi-l-tawatu’)—we do not doubt this, regardless of the language in which that Messenger was sent. He attributed those meanings to Himself and His Essence, stating that He possesses them: two Hands (yadayn), two Fingers (asba‘ayn), a Right Hand (yamin), Eyes (a‘yun), Companionship (ma‘iyya), Laughter (dahk), Joy (farah), Wonder (ta‘ajjub), Affection (tabashbush), Coming (ityan), Arrival (maji’), Ascending (istiwa’), Descending (nuzul), Sight (basar), Knowledge (‘ilm), Speech (kalam), Voice (sawt), and similar things like Hurrying (harwala), Limit (hadd), Measure (miqdar), Pleasure (rida), and Wrath (ghadab)—due to contingent causes (asbab haditha) from the obligated servants (al-‘abid al-mukallafin) who performed acts that angered their Lord, so He accepted the Wrath and described Himself with it. He also described Himself by saying that when the servant gives charity, for example, his charity extinguishes Allah’s Wrath upon him. All this is intelligible in meaning (ma‘qul al-ma‘na) but unknown in its relation (nisba) to Allah. Belief in it is obligatory upon every human being who is addressed or obligated by Allah. All this is outside the scope of rational proof (al-dalala al-‘aqliyya), unless it is allegorized (yata’awwal), in which case the intellect accepts it. But accepting it through faith (iman) is more appropriate, because it is a ruling (hukm) that the Real (al-Haqq) decreed upon Himself, that He is thus, even though <<There is nothing whatever like unto Him>> (Qur’an 42:11). He negated our knowledge of the manner of relation (wajh al-nisba) to Him, but He did not negate the ruling itself from Himself. His ruling, Exalted is He, upon Himself is more worthy for us to accept from Him than a ruling decreed upon Him by a creature, which is the intellect. How blind is he who follows his intellect in the ruling it decreed upon his Lord, and does not follow what the Lord decreed upon Himself! What blindness is greater than this? Especially since the translator on behalf of Allah, the Messenger (peace and blessings of Allah be upon him), forbade the obligated people (al-mukallafin) who possess intellects from pondering the Essence of Allah (Dhat Allah) or describing it with an attribute not found in Allah’s reports about Himself. Yet they reversed the case: they pondered the Essence of Allah and decreed upon His Essence what they decreed. And when His reports came to us concerning what He is in His Essence, they denied that with their intellects and rejected it, and they accused the Messengers and those who believed them of lying. Those among them who did believe considered this a political strategy (siyasa) from a wise, rational ruler for the benefit of the time and to ensure the convergence of motives (tawaffur al-dawa‘i) in gathering around a god with these attributes, establishing this in the minds of the deficient masses. Once they established this, they appeared to the common people (al-‘amma) to be connected to those attributes just as the common people are, while inwardly they held the opposite of what they displayed. As for the one whose speculation granted him the existence of the Messenger and his truthfulness in what he reported, his utmost effort is allegorization (ta’wil) so that he does not depart from the ruling his intellect decreed upon his Lord concerning what He reported about Himself. Thus, in his affirmation, he is effectively a denier. As for the People of Safety (Ahl al-Salama), who have no light except the light of faith, they submit this to Allah, based on Allah’s Knowledge concerning it, along with faith and the verification of the meanings that those expressions convey by common agreement (tawatu’) in the language by which this Messenger was sent.\n\nAs for the People of Unveiling and Existence (Ahl al-Kashf wa al-Wujud), they believed just as these others believed. Then they feared Allah concerning what He limited and legislated for them, and He granted them a Criterion (furqan) by which they distinguished between the attribution of these rulings to Allah and their attribution to the creature. Thus, they knew their meanings through direct vision (‘iyan) and necessary knowledge (‘ilm daruri). This is where they reached. Look then at the disparity of intellects concerning a single matter and the difference in paths for one who possesses a sound intellect and lends an ear to the address of the Real (Haqq) while being present (shahid) at the points of the Divine Address through witnessing (shuhud) and unveiling (kashf).\n\nIf what we have mentioned is established, and the matter is as we have explained and clarified, then know that Allah is the Manifest (al-Zahir) whom the eyes witness, and the Hidden (al-Batin) whom the intellects witness. Just as there is nothing among the known things that is entirely hidden from Him—rather, everything is witnessed by Him—likewise, He is not hidden from His creation, neither in their state of non-existence nor in their state of existence. Rather, He is witnessed by them through the description of Manifestation (zuhur) and Hiddenness (butun) to the inner sights (basa’ir) and the outer eyes (absar). However, witnessing does not necessarily entail the knowledge that He is that sought object, except by Allah’s declaration and His placing necessary knowledge in the soul of the servant that the object seen is Him—just as a sleeper finds within himself, without any apparent cause, that the image he saw is the Messenger, if it was the Messenger, or the Real, if it was the Real. And if that inner finding (al-wajd) is true in his soul, it corresponds to the reality of what he saw. Knowledge of Allah is like this; it is not attained except in this manner, neither by contemplation nor by speculation, so that it does not fall under the ruling of a creature.\n\nSince the matter is of this magnitude, and He reported about Himself that He transforms into forms (yathawwal fi al-suwar) while these rulings remain fixed, we rule upon Him with what is ruled upon the forms in which He manifests (yatajalla) to His servants, whatever they may be. For there is none other than Him, especially in the station (mawtan) whose reality is known to be one where the claim to Divinity (uluhiyya) can only belong to Allah. Therefore, we do not strike a likeness for Him.\n\nFor He is the very essence of the likeness (al-mithl),\nGlory be to Him, Exalted and Majestic.\n\nAnd all of us are from Him, if\nYou verify it, high and majestic.\n\nExcept for the one whom He gave glad tidings\nOf safety from Him and honored.\n\nSo he acts according to what the station requires. For the one who knows the matters does not exceed in manifestation the ruling dictated by the moment (al-waqt). That is why the Sufi group said that the Sufi is \"the son of his time\" (ibn waqtihi). This is the ruling of the Perfect Men (al-kummal min al-rijal), just as the Messenger of Allah (peace and blessings of Allah be upon him), who is the Compassionate and Merciful, says concerning a group on the Day of Resurrection: \"Away! Away!\" (suhqan suhqan). When that state (hal) passes, he becomes gentle in the matter and intercedes for those whom the wind cast down—which is the power of the ruling of the soul’s desire (hawa al-nafs) in a distant place (sahiq). Thus, the Real (al-Haqq) stands in the single state with the attribute of Wrath, Pleasure, Mercy, and Punishment, due to the ruling of the Manifest (al-Zahir) and the Hidden (al-Batin), the Honorer (al-Mu‘izz) and the Humiliator (al-Mudhill). It is as if He is an Isthmus (Barzakh) between His two attributes, for He is the Possessor of two Grips (qabdatayn) and two Hands (yadayn). Each Hand has a ruling, and in each Grip there is a people, like the two books with which the Messenger of Allah (peace and blessings of Allah be upon him) came out to his Companions, informing them that in one were the names of the People of Paradise, and the names of their fathers, clans, and tribes, from the time Allah created mankind until the Day of Resurrection. And in the other book were the names of the People of the Fire, and the names of their fathers, clans, and tribes, from the time Allah created mankind until the Day of Resurrection. If this were written with conventional writing, the papers would not suffice for a city. How then could two books in the hands of the Messenger (peace and blessings of Allah be upon him) encompass that? This is from the science of inserting the vast into the narrow (idkhal al-wasi‘ fi al-dayyiq) without widening the narrow or narrowing the vast.\n\nWhoever witnesses these matters through direct vision (mushahada) and attains them through tasting (dhawq), that person is the one who knows Allah and the reality of the matter in itself and its essence (‘ayn). For the correct view is that a thing is only perceived by itself, and it has no decisive proof (dalil qati‘) other than itself. Sight (al-basar) is for witnessing (al-shuhud), and the intellect (‘aql) is for acceptance (al-qabul). As for the one who seeks the knowledge of matters through external proofs (al-dala’il al-ghariba) that are not the essence of the sought object, it is impossible for him to achieve anything worthwhile, and his hands will only grasp disappointment.\n\nAs for the Near Ones (al-Muqarrabun), they are before Allah, corresponding to the Essence (Dhat) described by the two Hands, for they are responsible for executing the Divine Commands (al-awamir al-ilahiyya) among creation in every abode. As for the People of the Right Hand (Ahl al-Yamin), they do not have this disposition (tasrif); rather, they are the people of safety (salama) and innocence, due to the strength of the ruling they maintain over their souls and their suppression of their desires by following the Real (al-Haqq). As for the people of the other Hand, who are called the Companions of the Left Hand (Ashab al-Shimal), they hang their heads low. Among them is the one whose head is covered, whose gaze does not return to him, stunned by the magnitude of what he sees. None of these three groups witnesses anything except what their station (maqam), level (manzil), and place (makan) grant them. Thus, each group witnesses something different from Allah than what the other witnesses. Yet the Real (al-Haqq) is One. Were it not that the matter is the One of Multiplicity (wahid al-kathra), their witnessing would not differ. Were it not for the Multiplicity (kathra) in the One, the matter would only be One that accepts no division. But it has accepted division. Thus, the Origin (al-Asl) is like Him. This is the reason for the existence of the two abodes (al-darayn) in the Hereafter, the two pans (al-kaffatayn) of the Balance, the Mercy restricted by obligation (al-rahma al-muqayyada bi-l-wujub) and the Mercy absolute by grace (al-mutlaqa bi-l-imtinan), and the gradation of levels (maratib) in the degrees of Paradise (jinnan) and the depths of the Fire (nar).\n\nThere is none but the One, the Multiplicity,\nBy such a thing are matters witnessed.\n\nLook, then, when delusion comes to you,\nTruly, without doubt, the Warner belongs to Him.\n\nAnd everything you say is falsehood,\nHearing it causes breasts to tighten.\n\nWhen the Real (al-Haqq) manifests (yatajalla) in the attribute of Compulsion (al-Jabarut) to whichever of His servants He manifests, if the one to whom He manifests has no director (mudabbir) other than Allah—like the mountain of Moses, which crumbled (tadakdaka) due to His Theophany (tajalli)—then there is nothing in it but its own self. But if he has a director that Allah appointed for him, such as the rational souls (al-nufus al-natiqa) directing their bodies, their bodies do not crumble. Rather, that Theophany affects their spirits (arwah) just as it affected the mountain. After the spirit was standing in the direction of the body, it ceased its standing, and the ruling of the swoon (al-sa‘q) appeared in the body of Moses. This was nothing but the removal of the standing of its director specifically, just as the mountain ceased its function of pegging (watadiyya). Thus, He remained fixed in Himself, and nothing else remained fixed. For Allah only placed the mountain to stabilize the shaking of the earth (mayd al-ard). Its ruling ceased when its mountainous nature (jabaliyya) ceased, just as the direction of the spirit for the body of the one who swooned ceased when its standing in it ceased. Moses recovered after his swoon, but the mountain did not return to its function of pegging, because there was no one there to demand it, due to the existence of a substitute (al-‘awad) which was other mountains. This specific body, however, has no created director other than this spirit. So the body requested its director from Allah through its state (hal), and Allah returned it to it, and Moses recovered. The natural constitution (al-nash’a al-tabi‘iyya) preserves the direction for its directing spirit because it cannot dispense with a director to manage it. And the earth does not preserve the pegging function of a specific mountain upon it, because it can dispense with it through its likes. However, the earth cannot dispense with the totality of mountains when it seeks stillness. This is the reason for the recovery of Moses and the non-return of the pegging function to the mountain.\n\nMountains were created primarily as an attribute of Mercy, Gentleness, and Descent (al-tanazzul). They initially appeared in the form of Compulsion (qahr) when they stabilized the shaking of the earth. Thus, their mercy was in their compulsion. They do not know humility, for they were not earth that later became mountains. The first mountain that Allah brought down from His Compulsion (qahr) and Majesty (jabarut) by the veil (hijab) with which the Real veiled Himself from it—a veil of witnessing (shuhud) not a veil of knowledge—was the mountain of Moses, by crumbling. It became earth after it was a mountain. It is the first mountain that knew itself. Then, on the Day of Resurrection, the mountains will be crushed into dust (dakkan dakka) due to the Theophany of the Real, when they become like carded wool (al-‘ihn al-manfush). The stretching of the earth (mad al-ard) is merely the increased extension of the mountains and their transformation into earth. Whatever part of them was high in the atmosphere, when spread out, increased the expanse of the earth. That is why the report came that Allah will stretch the earth on the Day of Resurrection like the stretching of a hide (mad al-adim). He likened its stretching to the stretching of a hide. When a person stretches a hide, it lengthens without adding anything that was not already in its essence; rather, it contained contraction and protrusions. When stretched, it unfolds from its contraction and flattens those protrusions that were in it. Thus, the earth’s breadth increases, and its low parts are raised until it is flat. It increases by what was its height, from its surface to its depths, just as it is with the hide. You will see in the earth <<neither crookedness nor unevenness>> (Qur’an 20:107). Thus, the sight will encompass everyone in the standing place (al-mawgif) without obstruction from height or depth, so that creation may see one another and witness Allah’s ruling of separation and judgment among His servants, due to the existence of the two attributes and the ruling of the two Feet (al-qadamayn) of the Manifest (al-Zahir) and the Hidden (al-Batin).\n\nWere it not for the Manifestation (zuhur) of the Real, there would be no human,\nAnd were it not for the Hiddenness (butun) of the Real, no proof would stand.\n\nThere is nothing there but Necessary, then Necessary,\nIf you know the matter, there is no contingency (imkan) there.\n\nNothing in the cosmos is more perfect than the essence of His Self,\nAnd this is what He named \"Human\" in the cosmos.\n\nThere is no intended object other than Him, for He\nIs the Real (al-Haqq); neither eternity nor fires veil you.\n\nKnow that He who manifested it\nHas wrath that He displays, and at times, pleasure.\n\nSo there must be two abodes: an abode of honor,\nAnd an abode of punishment, in which there is clarification for the intellect.\n\nAnd this which we brought forth in our speech\nIs the Real (al-Haqq); if you ponder, there is no falsehood in it.\n\nAnd how could you not know this from the very thing you spoke and translated?\n\nI have known that the Real (al-Haqq) supported me,\nSo what I utter is from Him, and He bound me\n\nBy it, so the spirits (arwah) continuously descend upon me,\nAlways, and they love me, so they seek me out.\n\nAnd that is because we have a perfected eye,\nBy which whoever witnesses me sees his own self.\n\nFor that, my Lord brought me into existence and specialized me,\nSo everything in Him is from Him when He finds me.\n\nLook at me, and you will see a wonder in my form;\nIn every state, the God of the Real makes me happy.\n\nIf I intend a matter that no other matter can resist,\nI find my God supporting me in it.\n\nEvery intellect that sees my Lord affirms His Unity (yuwahhiduhu),\nAnd the Real (al-Haqq), when He sees me, affirms His Unity through me.\n\nAllah knows the wonder that is in the Unseen (al-Ghayb),\nAnd by reaching Him, the Real singles me out.\n\nIn this station (manzil) are sciences contained in the Four Books: the Qur’an, the Torah, the Gospel, and the Psalms (Zabur). It contains the knowledge of the reason for the revelation of the Books. They were only revealed as speech upon the Messengers and written down from the Messengers in the Books. They were only revealed in writing to the lowest heaven (al-sama’ al-dunya), as transmitted, and that was on the Night of Power (Laylat al-Qadr), coinciding with the Night of the Middle of Sha‘ban. Then <<the Trustworthy Spirit brought it down>> (Qur’an 26:193) upon the heart of Muhammad (peace and blessings of Allah be upon him) piecemeal (munajjaman) over twenty-three years, or twenty years, according to the difference of opinion. It contains the knowledge of naming the translation as ‘Inzal’ (sending down) and ‘Tanzil’ (gradual sending down). It contains the knowledge of whether the one from whom the veil is lifted, so that he witnesses the matter as it truly is, is obligated by the auditory manners (al-adab al-sam‘iyya), or whether that station necessitates oblivion (dhuhul) and the loss of the intellect of obligation (‘aql al-taklif), so that he remains without formal observance (rasm) with the Guardian Angels (al-muhaymin min al-mala’ika). It contains the knowledge of bequests, manners, and the states of those addressed and those favored. It contains the knowledge of protecting the rights of the neighbor (al-jar). If a neighbor violates the sanctity of his neighbor, should the neighbor retaliate with the like of what was done, or is he obligated to preserve the rights of neighborliness and not retaliate for the offense with an offense? It contains the knowledge of the state of the one described as commanding noble character (makarim al-akhlaq), which includes pardon, forgiveness, and relieving distress by guaranteeing liabilities (daman al-taba‘at) due to His self-sufficiency in paying them off, and yet He punishes afterwards. Pardon is recommended (mandub), and guarantee is also recommended. By what attribute, then, does the punishment come from one whose description is this? It contains the knowledge of the difference between the command (al-amr) and its attribute (sifa). It contains the knowledge of what is forbidden of adornment (zina) and what is permitted, and what is restricted, and the station of every adornment. It contains the knowledge of the difference between the foul (al-khabith) and the good (al-tayyib). It contains the knowledge of who bears the ultimate consequence (al-dark) in the Hereafter if two persons are involved, one bankrupt and the other solvent. It contains the knowledge of praise (al-thana’) and its details according to the states. It contains the knowledge of the dead addressing one another in the state of their death, and whether their state after death is like their state before creation or not. It contains the knowledge of death and its quiddity (mahiyya). It contains the knowledge of the separation between the two Grips (al-qabdatayn). It contains the knowledge of obligation (al-taklif) on the Day of Resurrection and before entering Paradise. It contains the knowledge of the signs (al-‘alamat) in the felicitous (al-su‘ada’) and the wretched (al-ashqiya’), and to which group belongs the one who has no sign. It contains the knowledge of one who swears by something that Allah proves false—and it has been reported that whoever presumes to swear by Allah, Allah proves him false. It contains the knowledge of the necessary cause for the one described by Generosity (al-Karam) when the distressed, deprived person asks him, and he is able to console him and give him what he asked, but he did not give it. With what excuse does he apologize, and what is the description of this merciful petitioner? It contains the knowledge of the children of the night and the day, and by what are they distinguished. It contains the knowledge of the swimming of the world of lights (‘alam al-anwar). It contains the knowledge of the servant standing with two contradictory attributes, yet being praised by Allah, the Mighty and Majestic, in both states. It contains the knowledge of Mercy having <<encompassed everything>> (Qur’an 7:156), yet being described as near to certain individuals due to attributes subsisting in them. Is this the same Mercy that encompassed everything, or another Mercy? It contains the knowledge of one whom Allah made felicitous (as‘adahu) against his will in felicity, yet he is felicitous in Allah’s knowledge. It contains the knowledge of the blind man saying to the sighted man: \"Why are you blind, seeing nothing? Do you not see that I see the darkness, while you do not see it, yet you claim to see?\" It contains the knowledge of consideration (al-i‘tibar), the knowledge of contingency (al-imkan) and contingent things (al-mumkinat), the knowledge of alchemy (al-simiya’), the knowledge of inheritance (al-wirth) and the inheritors (al-warithin), the knowledge of indications (al-dalalat) concerning events, the knowledge of similitude (al-tashbih), and the knowledge of jealousy (al-ghira). It contains the knowledge of longing (al-shawq) and yearning (al-ishtiyaq). It contains the knowledge of repentance (al-tawba), its divisions, and the penitents. It contains the knowledge of everything. It contains the knowledge of tasting (al-dhawq). It contains the knowledge of the effect of spiritual states (al-ahwal). It contains the knowledge of restriction (al-taqyid) and absolute freedom (al-itlaq). It contains the knowledge of lifting burdens (raf‘ al-athqal). It contains the knowledge of specialization (al-ikhtisas). It contains the knowledge of the divisions of the sciences. It contains the knowledge of the levels (al-maratib). It contains the knowledge of the changing of Divine Laws (al-shara’i‘) and the abrogation of some by others. It contains the knowledge of the successor (khalaf) and the successor (khalif) [with different vowelings]. It contains the knowledge of terrifying (al-tahwil) and frightening (al-takhwif) without bringing about the thing feared. It contains the knowledge of the covenants and compacts of the Isthmus (al-‘uhud wa al-mawathiq al-barzakhiyya). It contains the knowledge of submission (al-taslim). It contains the knowledge of gradual enticement (al-istidraj) and the manifestation of distance in the very essence of proximity, and the description of one who knows that. It contains the knowledge of the times of the appointed things (al-muwaqqatat). It contains the knowledge of the action necessitated by the knowledge that requires action, for it is impossible for knowledge that requires action to subsist in its possessor and yet he does not act. Many people permit this, and they are mistaken in it, for knowledge necessarily requires action. It contains the knowledge of partnership in the Names (al-shirka fi al-asma’) and what it affects. It contains the knowledge of incapacity (al-‘ajz) and where it is beneficial and serves as a proof. It contains the knowledge of the benefits of the limbs. It contains the knowledge of what repels the satanic and psychic suggestion (al-khatir al-shaytani wa al-nafsi) from the human being. It contains the knowledge of the levels of prostration (al-sujud) among those who prostrate, and what caused them to prostrate, and the prostration after which there is no rising for the one who performs it. <<And Allah speaks the Truth, and He guides to the Way>> (Qur’an 33:4).",
    "ur": "باب نمبر تین سو ستتر (۳۷۷): قیومیت (القیومیۃ)، سچائی (الصدق)، بزرگی (المجد)، موتی (اللؤلؤۃ) اور دیوار (السور) کے سجدے کے مقام کی معرفت میں\n\nجب میزان عدل کے گنبد میں رکھا جائے گا،\nاور حق (الحق) فیصلہ اور تفریق کے لیے آئے گا۔\n\nہمارے لیے ایک انوکھی مثلث شکل قائم ہوگی،\nجس کے دو پہلو مماثلت میں ہوں گے اور ایک پہلو بے مثال ہوگا۔\n\nاور اس کے باقی رہنے کے لیے اس کا وزن بڑھانا ضروری ہے،\nلہٰذا فضل (فضل) سے تائید شدہ امر کا ہونا لازم ہے۔\n\nجب وہ برابر ہو جائے گا تو جھکاؤ کا حکم زائل ہو جائے گا،\nاور سعادت کا میزان وزن کے سبب غالب آ جائے گا۔\n\n### [اللہ کے سوا ہر چیز ملک (ملک) ہے]\n\nجان لو، اللہ تمہاری تائید کرے، کہ شرعاً اور عقلاً یہ ثابت ہے کہ وہ سبحانہ و تعالیٰ مرتبے میں احدی (أحدی المرتبۃ) ہے، لہٰذا اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، بادشاہت (الملک) میں اس کا کوئی شریک نہیں۔ اور بادشاہت (الملک) اللہ کے سوا ہر چیز ہے۔ اور جہاں تک یہ بات ہے کہ اس کا کوئی ولی (ولی) ہو، تو وہ بادشاہت میں شریک کی طرح نہیں ہے، کیونکہ اس کی مطلقاً نفی کی گئی ہے، اس لیے کہ وہ نفسِ امر میں معدوم العین ہے۔ اور ولی (الولی) تو موجود العین ہے۔ وہ اللہ کی مدد کرتا ہے تاکہ اس کا قرب حاصل کرے اور پردہ نشین ہو جائے، شاید کہ اللہ اسے چن لے اور قریب کر لے، نہ اس لیے کہ اللہ کو کوئی ذلت پہنچی ہو اور وہ اس کی مدد کرے اس شخص کے خلاف جس نے اسے ذلیل کیا، یا اس کی مدد اس کی کمزوری کی وجہ سے کرے—اللہ اس سے بہت بلند ہے۔ اللہ تعالیٰ فرماتا ہے: \"اگر تم اللہ کی مدد کرو گے\" (إِنْ تَنْصُرُوا الله) اور فرمایا: \"اور وہ بہترین مددگار ہے\" (وَهُوَ خَيْرُ النَّاصِرِينَ)۔ اس نے \"اگر تم اللہ کی مدد کرو گے\" (إِنْ تَنْصُرُوا الله) صرف اس لیے نہیں فرمایا کہ یہ نصرت واقع نہ ہو، بلکہ جیسا کہ ہم نے ذکر کیا، اور وہ اس کا یہ فرمان ہے: \"اور اس کا کوئی ولی (مددگار) ذلت کی وجہ سے نہیں ہے\" (وَلَمْ يَكُنْ لَهُ وَلِيٌّ مِّنَ الذُّلِّ) یعنی ذلت کی وجہ سے کوئی مددگار نہیں، اور \"اس کی خوب بڑائی بیان کرو\" (وَكَبِّرْهُ تَكْبِيراً) ان دونوں اوصاف سے۔\n\nاسی طرح، عقل اور شرع کی دلیل سے، وہ تعالیٰ اپنے اسماء حسنیٰ، یا اپنی صفات، یا اپنی نسبتوں کے ذریعے کثرت میں احدی (أحدی الکثرۃ) ہے۔ اور خاص طور پر شرع کے ذریعے، وہ اپنی ذات میں کثرت میں احدی ہے، جیسا کہ اس نے اپنے بارے میں خود خبر دی ہے، اپنے اس قول سے: \"بلکہ اس کے دونوں ہاتھ کھلے ہیں\" (بَلْ يَدَاهُ مَبْسُوطَتَانِ)، اور \"جسے میں نے اپنے دونوں ہاتھوں سے بنایا\" (لِمَا خَلَقْتُ بِيَدَيَّ)، اور \"وہ ہماری آنکھوں کے سامنے چلتی رہی\" (وَتَجْرِي بِأَعْيُنِنَا)، اور \"دل رحمن کی انگلیوں میں سے دو انگلیوں کے درمیان ہے\"۔ اور \"آسمان اس کے داہنے ہاتھ میں لپیٹے ہوئے ہوں گے\" (وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ)، اور \"میرے رب کے دونوں ہاتھ مبارک داہنے ہیں\"۔\n\nیہ سب اور ان کی مثالیں ذات (الذات) کے بارے میں خبریں ہیں جو اللہ نے اپنے بارے میں دی ہیں۔ اور عقلی دلائل اسے محال قرار دیتے ہیں۔ اگر سننے والا عقلی نظر (النظر العقلی) کا مالک اور مومن ہو، تو وہ اپنے عقل پر ٹھہرنے کی وجہ سے اس میں تاویل کی مشقت اٹھائے گا۔ اور اگر سننے والا ایمان کے ذریعے باطن میں منور ہو، تو وہ اس پر اللہ کے علم کے مطابق ایمان لائے گا، ساتھ ہی ان وارد شدہ معانی کی معقولیت کو بھی تسلیم کرے گا جن کا تلفظ ہاتھ، انگلی، آنکھ اور دیگر سے کیا گیا ہے، لیکن وہ نسبت (النسبۃ) سے ناواقف رہے گا، یہاں تک کہ اللہ اس کی بصیرت سے پردہ ہٹا دے، تو وہ اس عبارت کے مراد کو کشف (الکشف) کے ذریعے پا لے گا۔ کیونکہ اللہ نے کوئی رسول نہیں بھیجا مگر \"اس کی قوم کی زبان میں\" (إِلَّا بِلِسَانِ قَوْمِهِ)، یعنی ان معانی کے اظہار کے ذریعے جن پر وہ متفق تھے، جنہیں متکلم سامع تک پہنچانا چاہتا ہے۔ لہٰذا معنی اس لفظ کی دلالت سے مطلقاً تبدیل نہیں ہوتا، اگرچہ یہ معلوم نہ ہو کہ اس کی نسبت کیسے کی جائے، اور یہ اس عبارت کے معقول معنی میں کوئی نقص پیدا نہیں کرتا۔\n\nوہ ایک ہے اور کثیر بھی، یہ تعجب خیز ہے،\nاور جو اس میں حاصل ہوتا ہے اس کے لیے ایک خاص طریقہ ہے۔\n\nعلم تو صرف اس کے لیے ہے جو اسے ذوق (الذوق) کے طریقے سے حاصل کرے،\nپس وہی اس کا چشمہ ہے۔\n\nاے خزانے کے طالب! جو کچھ تو طلب کر رہا ہے،\nوہ بعینہٖ وہی ہے جسے تو لے کر آیا ہے۔\n\n### [وہ وحدت جس میں کثرت نہ ہو، محال ہے]\n\nجان لو، اللہ تمہاری تائید کرے، کہ یہ محال ہے کہ معلومات میں کوئی ایسی چیز ہو جس پر کوئی حکم لاگو نہ ہو، اور وہ حکم اس کی عین ذات (عین ذاتہ) نہ ہو، بلکہ وہ کوئی اور معقول ہو۔ لہٰذا نفسِ امر میں کوئی ایسا واحد نہیں ہے جو اپنی عین میں واحدِ کثرت (واحد الکثرۃ) نہ ہو۔ پس وہاں صرف مرکب ہی ہے، اور ترکیب کی ادنیٰ نسبت یہ ہے کہ وہ اس کی عین ہو اور وہ جو اس کی عین پر حکم لگایا جائے۔ لہٰذا وہ وحدت جس میں کثرت نہ ہو، محال ہے۔\n\n### [واجب الوجود لنفسہ مرکب کے لیے واجب ذاتی ترکیب (الترکیب الذاتی الواجب)]\n\nاور جان لو کہ واجب الوجود لنفسہ مرکب کے لیے واجب ذاتی ترکیب (الترکیب الذاتی الواجب) میں وہ نقص نہیں آتا جس کا وہم اہل نظر (النظار) کرتے ہیں۔ کیونکہ وہ نقص ممکنات میں امکانی ترکیب (الترکیب الإمکانی) میں ہوتا ہے، امکانی ترکیبوں کے اختلاف کے پیش نظر، جہاں اس مرکب میں خاص ترکیب کے لیے مخصص (مخصوص کرنے والے) کی ضرورت ہوتی ہے۔ یہ اس امر کے برعکس ہے جس کا کوئی شے اپنے لیے مستحق ہو۔ جیسا کہ وہ اس شے کے بارے میں کہتے ہیں جو اشکال کو اپنے لیے قبول کرتی ہے، تم یہ نہیں کہتے کہ اشکال کا قبول کرنا کسی بنانے والے کے بنانے سے ہے، بلکہ جو چیز مخصص (مخصوص کرنے والے) کے ذریعے اس کے لیے ہوتی ہے وہ کسی خاص شکل کا ہونا ہے نہ کہ کسی اور کا، جبکہ اس میں دوسری شکل کے قائم ہونے کا امکان بھی ہو۔ لہٰذا مخصص کا ہونا ضروری ہے، نہ کہ اشکال کو قبول کرنے والے کا، کیونکہ وہ اس کے لیے بذات خود ہے۔ پس وہ ذاتی ترکیب (الترکیب الذاتی) جو واجب الوجود لنفسہ کا تقاضا ہے، اس حکم سے خارج ہے، کیونکہ اہل نظر کے نزدیک اس کی ماہیت (الماہیۃ) مجہول ہے۔ پس اس کی طرف ترکیب کی نسبت مجہول ہے، باوجود اس کے کہ ترکیب معقول ہے۔ اور ترکیب کا معنی یہ ہے کہ وہ اپنی ذات میں کثیر ہے۔ جیسا کہ اس میں اس بات سے کوئی نقص نہیں آتا کہ اس کی قدیم صفات ہیں، جیسا کہ اہل نظر میں سے صفات کو ثابت کرنے والے (مثلاً اشاعرہ) کے نزدیک ہے۔ اور ہم نے کوئی ایسی عقلی دلیل نہیں پائی جو یہ ثابت کرے کہ اس پر کسی امر کا حکم نہیں لگایا جا سکتا۔ پس جو شخص عقلی نظر (النظر العقلی) میں گہرا اترا اور علماء میں مشہور ہوا کہ وہ عقلِ محض ہے اور ایمان میں اس کا کوئی حصہ نہیں، اس کی انتہا یہ ہے کہ اس نے اس پر علت (علۃ) ہونے کا حکم لگایا، تو جب اس نے اس پر علیت کا حکم لگایا تو اس کی ذات میں توحید (التوحید) خالص نہ رہی۔ اور ان کے علاوہ دیگر اہل نظر نے اس پر نسبتوں کا حکم لگایا، اور یہ کہ وہاں ایک امر ہے جسے قائلیت (القائلیۃ) اور قادریت (القادریۃ) کہا جاتا ہے، جن کے ذریعے ہم نے اس پر یہ حکم لگایا کہ وہ قائل (بولنے والا) اور قادر (قدرت رکھنے والا) ہے۔ اور ان کے علاوہ دیگر اہل نظر نے اس پر یہ حکم لگایا کہ اس کی ذات پر زائد صفات ہیں جو قدیم، ازلی اور اس کی ذات حق (ذات الحق) کے ساتھ قائم ہیں، جنہیں حیات، علم، قدرت، ارادہ، کلام، سمع اور بصر کہا جاتا ہے، جن کی بنا پر اس کے بارے میں کہا جاتا ہے کہ وہ حی، عالم، قادر، مرید، متکلم، سمیع، بصیر ہے۔ اور تمام اسماء، اپنے معانی کے لحاظ سے—یعنی اسماء الٰہیہ—ان ازلی، قدیم صفات کے تحت آتے ہیں جو ذات حق کے ساتھ قائم ہیں۔ اور اہل نظر میں سے بعض نے ہر اسم الٰہی کے لیے ایک معقول معنی قرار دیا، جس سے یہ سمجھا جاتا ہے کہ وہ معنی ذات حق کے ساتھ قائم، قدیم اور ازلی ہے، خواہ وہ کتنی ہی تعداد کو پہنچ جائے۔ اور ہم نے قاضی ابو بکر الباقلانی سے روایت کی ہے کہ وہ اس کے قائل ہیں۔ تاہم، وہ عقلی نظر کے ذریعے اس بات پر متفق ہیں کہ حوادث (حادث ہونے والی چیزیں) اس کے ساتھ قائم نہیں ہو سکتیں۔ پس انہوں نے اس کی ذات کو کسی نہ کسی حکم سے خالی نہیں چھوڑا، خواہ وہ نسبتوں کا حکم ہو، یا صفات کا، یا اسماء کے معانی کا۔\n\nپھر شریعت (الشرع) آئی، اور وہ وہی ہے جس کی ترجمانی رسول اللہ صلی اللہ علیہ وسلم نے کی اور فرمایا کہ یہ اللہ کا کلام ہے، اور اس کی سچائی پر دلیل قائم کی کہ یہ اللہ کی طرف سے ہے۔ اور آپ نے خبر دی کہ وہ ہر اس چیز میں جو اللہ کی طرف سے بولتے ہیں، \"اپنی خواہش سے نہیں بولتے\" (مَا يَنطِقُ عَنِ الْهَوَىٰ)، \"وہ تو صرف وحی ہے جو نازل کی جاتی ہے\" (إِنْ هُوَ إِلَّا وَحْيٌ يُوحَىٰ)، جسے روح الامین ان کے دل پر نازل کرتے ہیں، یا اللہ انہیں ان کے نفس میں الہام (إلہام) کرتا ہے کہ وہ تعالیٰ فلاں فلاں امور پر ہے جن سے اس نے اپنی ذات کو موصوف کیا ہے۔ اور اپنی ذات کے بارے میں ذکر کیا کہ وہ ان عبارات پر ہے جن کے معانی عرف میں باہمی اتفاق سے معلوم ہیں، ہمیں اس میں کوئی شک نہیں کہ وہ رسول جس بھی زبان میں بھیجا گیا ہو۔ اور اس نے ان معانی کو اپنی ذات اور نفس کی طرف منسوب کیا کہ وہ ان پر ہے، جیسے دو ہاتھ، دو انگلیاں، دایاں ہاتھ، آنکھیں، معیت (معیۃ)، ہنسنا، خوش ہونا، تعجب کرنا، بشاشت دکھانا، آنا، جانا، استواء (استواء)، نزول، بصارت، علم، کلام، آواز، اور اس کی مثالیں جیسے دوڑنا، حد، مقدار، اور رضا و غضب، جو مکلف بندوں کے حادث اسباب کی وجہ سے ہوتے ہیں، جنہیں انہوں نے کیا اور اپنے رب کو ناراض کیا، تو اس نے غضب کو قبول کیا اور خود کو اس سے موصوف کیا۔ اور اس نے خود کو اس سے بھی موصوف کیا کہ جب بندہ صدقہ کرتا ہے، مثال کے طور پر، تو وہ اپنے صدقے سے اللہ کے غضب کو بجھا دیتا ہے۔ یہ سب معانی میں معقول ہیں، لیکن اللہ کی طرف ان کی نسبت مجہول ہے، اور ہر اس انسان پر ان پر ایمان لانا واجب ہے جسے اللہ کی طرف سے ان کا خطاب یا تکلیف دی گئی ہو۔ اور یہ سب عقلی دلالت (الدلالۃ العقلیۃ) سے خارج ہے، مگر یہ کہ تاویل کی جائے، تب عقل اسے قبول کرتی ہے۔ لہٰذا اسے ایمان کے ذریعے قبول کرنا زیادہ بہتر ہے، کیونکہ یہ وہ حکم ہے جو حق (الحق) نے خود پر لگایا ہے کہ وہ ایسا ہے، باوجود اس کے کہ \"اس کی مثال کوئی چیز نہیں\" (لَيْسَ كَمِثْلِهِ شَيْءٌ)۔ پس اس نے ہم سے اس کی نسبت کے طریقے کا علم تو زائل کر دیا، لیکن اس حکم کو اپنی ذات سے زائل نہیں کیا۔ اور اس کا سبحانہ و تعالیٰ کا اپنی ذات پر کسی امر کا حکم لگانا ہمارے لیے زیادہ اولیٰ ہے کہ ہم اسے قبول کریں، بہ نسبت اس حکم کے جو کسی مخلوق یعنی عقل نے اس پر لگایا ہو۔ پس وہ شخص کتنا اندھا ہے جس نے اپنے رب پر حکم لگانے میں اپنی عقل کی پیروی کی اور اس کی پیروی نہیں کی جو رب نے خود پر حکم لگایا! اور اس سے بڑھ کر اور کون سا اندھا پن ہو سکتا ہے؟ خاص طور پر جب اللہ تعالیٰ کی طرف سے ترجمانی کرنے والے، یعنی رسول اللہ صلی اللہ علیہ وسلم نے، مکلفین اور عقل والوں کو منع فرمایا کہ وہ اللہ کی ذات میں غور و فکر کریں اور اسے ایسی صفت سے موصوف کریں جو اللہ کی اپنی خبر میں نہیں ہے۔ مگر انہوں نے معاملہ الٹ دیا اور اللہ کی ذات میں غور و فکر کیا اور اس کی ذات پر وہ حکم لگائے جو انہوں نے لگائے۔ اور جب اس کی خبریں ہم تک پہنچیں کہ وہ اپنی ذات میں کیسا ہے، تو انہوں نے اپنی عقلوں سے اس کا انکار کیا اور اسے رد کر دیا اور رسولوں کو جھٹلایا۔ اور ان میں سے جس نے ان کی تصدیق کی، اس نے اسے ایک دانا حکیم کی طرف سے وقت کی مصلحت اور قاصر نفوس میں اس صفت والے معبود پر اجتماع کے لیے ایک سیاسی تدبیر قرار دیا۔ جب انہوں نے یہ طے کر لیا، تو وہ عام لوگوں کے سامنے ان صفات سے وابستگی ظاہر کرتے ہیں جیسا کہ عام لوگ کرتے ہیں، جبکہ ان کے دلوں میں اس کے برعکس ہوتا ہے جو وہ ظاہر کرتے ہیں۔ اور رہے اہل سلامتی، جن کے پاس ایمان کے نور کے سوا کوئی نور نہیں، تو انہوں نے اسے اللہ کے سپرد کر دیا، اللہ کے علم کے مطابق، اس ایمان اور تحقیق کے ساتھ جو وہ عبارات ان معانی سے دیتی ہیں جن پر اس رسول کی بھیجی گئی زبان میں اتفاق کیا گیا ہے۔ اور رہے اہل کشف (الکشف) اور وجود (الوجود)، تو وہ اسی طرح ایمان لائے جیسے یہ لوگ ایمان لائے، پھر انہوں نے اللہ سے اس چیز میں ڈر اختیار کیا جو اس نے ان کے لیے مقرر کی اور مشروع کی، تو اللہ نے انہیں فرقان عطا کیا جس سے انہوں نے ان احکام کی اللہ کی طرف نسبت اور مخلوق کی طرف نسبت میں فرق کیا۔ پس انہوں نے ان کے معانی کو عیاں (عیاں) اور علم ضروری (علم ضروری) کے ذریعے پہچانا۔ اور یہیں تک وہ پہنچے۔ پس غور کرو کہ ایک ہی معاملے میں عقلوں میں کتنا تفاوت ہے اور اس میں طریقوں کا کتنا اختلاف ہے، اس شخص کے لیے جس کے پاس عقل سلیم ہو اور جس نے حق (الحق) کے خطاب کے لیے کان لگائے ہوں، اور وہ الٰہی خطاب کے مواقع کا شہود (الشہود) اور کشف (الکشف) پر شاہد ہو۔\n\nپس جب جو کچھ ہم نے ذکر کیا وہ ثابت ہو گیا اور معاملہ اسی طرح ہے جیسا کہ ہم نے بیان کیا اور واضح کیا، تو جان لو کہ اللہ ہی الظاہر (ظاہر) ہے جسے آنکھیں دیکھتی ہیں، اور الباطن (باطن) ہے جسے عقلیں دیکھتی ہیں۔ جس طرح معلومات میں کوئی چیز اس سے مکمل طور پر غائب نہیں ہے، بلکہ ہر چیز اس کے لیے مشہود ہے، اسی طرح وہ اپنی مخلوق سے بھی غائب نہیں ہے، نہ ان کے عدم کی حالت میں اور نہ ان کے وجود کی حالت میں، بلکہ وہ بصیرتوں اور آنکھوں کے لیے ظہور اور بطون کی صفت کے ساتھ ان کے لیے مشہود ہے۔ تاہم، شہود سے یہ لازم نہیں آتا کہ یہ علم ہو جائے کہ وہ مطلوب وہی ہے، مگر اللہ کے بتانے سے اور اس کے بندے کے نفس میں یہ علم ضروری (العلم الضروری) پیدا کرنے سے کہ وہ وہی ہے۔ جیسے سونے والا جب خواب میں رسول کی صورت یا حق تعالیٰ کو دیکھتا ہے، تو وہ اپنے نفس میں بغیر کسی ظاہری سبب کے یہ پاتا ہے کہ وہ مرئی رسول ہے اگر وہ رسول ہو، یا حق ہے اگر وہ حق ہو۔ اور وہ وجد (وجد) اگر اس کے نفس میں سچا ہو تو وہ اس امر کے مطابق ہوتا ہے جو اس نے دیکھا ہے۔ اللہ کا علم بھی اسی طرح ہوتا ہے، وہ نہ تو تفکر سے اور نہ ہی نظر سے حاصل ہوتا ہے، تاکہ وہ کسی مخلوق کے حکم کے تحت نہ آئے۔ اور جب معاملہ اس مقام پر ہو اور اس نے اپنے بارے میں خبر دی ہو کہ وہ صورتوں میں تبدیل ہوتا ہے، ان احکام کے ثابت ہونے کے ساتھ، تو ہم اس پر وہی حکم لگاتے ہیں جو ان صورتوں پر لگایا جاتا ہے جن میں وہ اپنے بندوں پر تجلی (التجلی) کرتا ہے، خواہ وہ کچھ بھی ہوں۔ پس وہاں اس کے سوا کوئی نہیں ہے، خاص طور پر اس موطن میں جہاں اس کی حقیقت سے معلوم ہوتا ہے کہ اس میں الوہیت کا دعویٰ صرف اللہ کے لیے ہی ممکن ہے، لہٰذا ہم اس کے لیے کوئی مثال قائم نہیں کرتے۔\n\nکیونکہ وہ عین مثال ہے،\nوہ پاک ہے، وہ عزت والا اور جلال والا ہے۔\n\nاور ہم سب اسی سے ہیں، جب تو نے اس کی تحقیق کی،\nتو وہ مجھ پر غالب آ گیا۔\n\nسوائے اس کے جسے اس نے اپنی طرف سے امن کی بشارت دی\nاور اسے عزت بخشی۔\n\nپس اس نے وہ کام کیا جو مقام کا تقاضا تھا۔ کیونکہ امور کا عالم اس حکم سے زیادہ ظاہر نہیں ہوتا جو وقت (الوقت) کا تقاضا ہو۔ اسی لیے صوفیاء (الصوفی) کے بارے میں طائفہ نے کہا کہ وہ اپنے وقت کا بیٹا ہے۔ اور یہ کامل مردوں کا حکم ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم، جو رؤف و رحیم ہیں، قیامت کے دن ایک گروہ کے حق میں فرمائیں گے: \"دوری ہو، دوری ہو\" (سحقا سحقا)۔ پھر جب وہ حال (الحال) زائل ہو جائے گا، تو وہ معاملے میں نرمی اختیار کریں گے اور اس شخص کی شفاعت کریں گے جسے ہوا نے گرا دیا، اور وہ نفس کی خواہش کے حکم کی قوت ہے، ایک دور دراز جگہ میں۔ پس حق (الحق) ایک ہی حال میں غضب، رضا، رحمت اور عذاب کی صفت کے ساتھ قائم ہوتا ہے، ظاہر (الظاہر) اور باطن (الباطن)، عزت دینے والے (المعز) اور ذلت دینے والے (المذل) کے حکم کے سبب۔ گویا وہ اپنی دو صفات کے درمیان برزخ (برزخ) ہے۔ کیونکہ وہ دو مٹھیاں اور دو ہاتھ رکھتا ہے، ہر ہاتھ کا ایک حکم ہے اور ہر مٹھی میں ایک قوم ہے۔ جیسا کہ وہ دو کتابیں جنہیں لے کر رسول اللہ صلی اللہ علیہ وسلم اپنے صحابہ کے پاس تشریف لائے اور انہیں خبر دی کہ ان میں سے ایک میں اہل جنت کے نام، ان کے آباؤ اجداد، ان کے قبیلوں اور ان کے خاندانوں کے نام ہیں، جب سے اللہ نے لوگوں کو پیدا کیا قیامت کے دن تک۔ اور دوسری کتاب میں اہل نار کے نام، ان کے آباؤ اجداد، ان کے قبیلوں اور ان کے خاندانوں کے نام ہیں، جب سے اللہ نے لوگوں کو پیدا کیا قیامت کے دن تک۔ اگر یہ معمول کی کتابت سے لکھا جاتا تو کاغذات ایک شہر کو بھی کافی نہ ہوتے، تو یہ کیسے ممکن ہے کہ دو کتابیں رسول اللہ صلی اللہ علیہ وسلم کے ہاتھوں میں اس کا احاطہ کر لیں؟ یہ علمِ واسع کو تنگی میں داخل کرنے کے علم میں سے ہے، بغیر اس کے کہ تنگی کو وسیع کیا جائے یا وسیع کو تنگ کیا جائے۔ پس جس نے ان امور کا مشاہدہ (مشاہدۃ) کیا اور اسے ذوق (الذوق) کے ذریعے حاصل کیا، تو وہی اللہ کو جاننے والا ہے اور اس امر کو جاننے والا ہے جو اس کے نفس اور عین میں ہے۔ کیونکہ صحیح بات یہ ہے کہ کوئی شے اپنی ذات کے سوا ادراک نہیں کی جا سکتی، اور اس پر اس کی ذات کے سوا کوئی قطعی دلیل نہیں ہے۔ بصارت کے لیے شہود (الشہود) ہے اور عقل کے لیے قبول ہے۔ اور جس نے امور کی معرفت ان اجنبی دلائل سے طلب کی جو مطلوب کی عین نہیں ہیں، تو اس کے لیے کچھ حاصل کرنا محال ہے اور اس کے ہاتھ ناکامی کے سوا کچھ نہیں لگے گا۔ پس رہے مقربین (المقربون)، تو وہ اللہ کے سامنے ہیں، دو ہاتھوں سے موصوف ذات کے بالمقابل، کیونکہ وہ ہر جہان میں مخلوق میں الٰہی احکام کو نافذ کرنے والے ہیں۔ اور رہے اہل یمین (اہل الیمین)، تو انہیں یہ تصرف حاصل نہیں، بلکہ وہ سلامتی اور براءت والے ہیں، اس وجہ سے کہ وہ اپنے نفوس پر حکم چلانے اور حق کی پیروی کے ذریعے اپنی خواہشات کو دبانے کی قوت رکھتے ہیں۔ اور رہے دوسرے ہاتھ والے، جن کے بارے میں کہا گیا کہ وہ اصحاب الشمال (بائیں ہاتھ والے) ہیں، تو انہوں نے اپنے سر جھکا لیے، اور ان میں سے وہ بھی ہے جس نے اپنے سر کو ڈھانپ لیا ہے اور اس کی نگاہ اس عظیم منظر کی وجہ سے اس کی طرف پلٹتی نہیں جو وہ دیکھتا ہے۔ پس ان تینوں گروہوں میں سے ہر گروہ صرف وہی دیکھتا ہے جو اس کا مقام (مقام)، منزل (منزل) اور جگہ اسے عطا کرتی ہے۔ پس ہر گروہ اللہ کا مشاہدہ اس کے برعکس کرتا ہے جو دوسرا گروہ کرتا ہے، حالانکہ حق (الحق) ایک ہے۔ اگر معاملہ واحدِ کثرت (واحد الکثرۃ) نہ ہوتا تو ان کے مشاہدات مختلف نہ ہوتے۔ اگر واحد میں کثرت نہ ہوتی تو معاملہ صرف ایک ہی ہوتا جو تقسیم قبول نہ کرتا، حالانکہ اس نے تقسیم قبول کی ہے۔ پس اصل اسی کی طرح ہے۔ اور یہی آخرت میں دو جہانوں، میزان میں دو پلڑوں، وجوب کے ساتھ مقید رحمت اور احسان کے ساتھ مطلق رحمت، اور جنت میں درجات اور جہنم میں درکات کے مراتب کے تفاوت کا سبب ہے۔\n\nپس وہ واحد کثیر (الواحد الکثیر) کے سوا کچھ نہیں،\nامور کا مشاہدہ اسی طرح کیا جاتا ہے۔\n\nپس دیکھو جب تمہارے پاس غرور آئے،\nتو یقیناً اس کے لیے بغیر شک کے ڈرانے والا ہے۔\n\nاور جو کچھ تم کہتے ہو وہ سب جھوٹ ہے،\nجسے سن کر سینے تنگ ہو جاتے ہیں۔\n\nپس جب حق (الحق) اپنے بندوں میں سے کسی پر صفتِ جبروت (صفۃ الجبروت) میں تجلی (التجلی) فرماتا ہے، تو اگر جس پر تجلی ہوئی اس کا اللہ کے سوا کوئی مدبر نہ ہو، جیسے موسیٰ کا پہاڑ، تو وہ اس تجلی سے ریزہ ریزہ ہو گیا، کیونکہ اس میں اس کی ذات کے سوا کچھ نہ تھا۔ اور اگر اس کا کوئی مدبر ہو جو اللہ نے اس کے لیے مقرر کیا ہو، جیسے ناطق نفوس کا اپنے اجسام کو تدبیر کرنا، تو ان کے اجسام ریزہ ریزہ نہیں ہوتے، لیکن ان کی روحوں میں اس تجلی نے وہی حکم کیا جو پہاڑ میں کیا تھا۔ پس روح جو جسم کی تدبیر پر قائم تھی، وہ اپنی قیام گاہ سے زائل ہو گئی، تو موسیٰ کے جسم میں صعق (بے ہوشی) کا حکم ظاہر ہوا۔ اور یہ صرف اس کے مدبر کے قیام کا زائل ہونا تھا، جیسا کہ پہاڑ اپنی میخیت (وتدیۃ) سے زائل ہو گیا، تو وہ اپنی ذات میں ثابت رہا اور اس کے سوا کوئی ثابت نہ رہا۔ کیونکہ اللہ نے پہاڑ کو صرف اس لیے رکھا تھا کہ زمین کا ڈولنا تھم جائے، پس جب اس کی جبلیت (پہاڑی پن) زائل ہوئی تو اس کا حکم بھی زائل ہو گیا۔ جیسا کہ صعق والے شخص کے جسم کی روح کی تدبیر زائل ہو گئی جب اس کا قیام اس سے زائل ہوا۔ پس موسیٰ اپنی بے ہوشی کے بعد ہوش میں آ گئے، لیکن پہاڑ اپنی میخیت کی طرف واپس نہیں آیا، کیونکہ وہاں کوئی ایسا نہیں تھا جو اس کا مطالبہ کرتا، کیونکہ اس کا بدل دوسرے پہاڑوں کی صورت میں موجود تھا۔ اور اس خاص جسم کا اس روح کے سوا کوئی مخلوق مدبر نہیں ہے، لہٰذا جسم نے حال (الحال) کے ذریعے اللہ سے اپنے مدبر کا مطالبہ کیا، تو اللہ نے اسے واپس کر دیا اور وہ ہوش میں آ گئے۔ پس نشأۃ طبیعیہ (النشأۃ الطبیعیۃ) اپنے مدبر روح پر تدبیر کو محفوظ رکھتی ہے، کیونکہ وہ اپنے مدبر کے بغیر بے نیاز نہیں ہو سکتی۔ اور زمین کسی خاص پہاڑ کی میخیت کو محفوظ نہیں رکھتی، کیونکہ وہ اس کے امثال سے بے نیاز ہو سکتی ہے، لیکن جب سکون مطلوب ہو تو وہ مجموعی طور پر پہاڑوں سے بے نیاز نہیں ہو سکتی۔ پس یہ موسیٰ کے ہوش میں آنے اور پہاڑ کی میخیت کے واپس نہ آنے کی وجہ ہے۔ پس پہاڑ اصل میں رحمت، لطف اور تنزل (التنزل) کی صفت سے پیدا کیے گئے، لیکن ابتداء میں وہ قہر کی صورت میں ظاہر ہوئے، جب انہوں نے زمین کے ڈولنے کو تھام لیا۔ پس ان کی رحمت قہر میں تھی، لہٰذا وہ تواضع کو نہیں جانتے، کیونکہ وہ زمین نہیں تھے جو بعد میں پہاڑ بن گئے۔ پس پہلا پہاڑ جسے اللہ نے اپنے قہر اور جبروت سے نیچے اتارا، اس حجاب کے ذریعے جس سے حق نے پردہ کیا تھا—یہ حجابِ شہود تھا نہ کہ حجابِ علم—وہ موسیٰ کا پہاڑ تھا جو ریزہ ریزہ ہو گیا، اور پہاڑ ہونے کے بعد زمین بن گیا۔ پس یہ پہلا پہاڑ ہے جس نے اپنی ذات کو پہچانا۔ پھر اس کے بعد قیامت میں، جب پہاڑ دھنی ہوئی رنگین اون کی طرح ہو جائیں گے، تو حق کی تجلی کے لیے ریزہ ریزہ ہو جائیں گے۔ اور زمین کا پھیلانا دراصل پہاڑوں کا مزید پھیلنا اور ان کا زمین بن جانا ہے۔ پس جو حصہ ان کا فضا میں بلندی پر تھا، جب وہ پھیل جائے گا تو زمین کے پھیلاؤ میں اضافہ کرے گا۔ اسی لیے خبر آئی ہے کہ اللہ قیامت کے دن زمین کو چمڑے کی طرح پھیلائے گا۔ اس کے پھیلانے کو چمڑے کے پھیلانے سے تشبیہ دی گئی ہے۔ اور جب انسان چمڑے کو پھیلاتا ہے، تو وہ لمبا ہو جاتا ہے بغیر اس کے کہ اس میں کوئی ایسی چیز شامل ہو جو اس کی عین میں نہ تھی، بلکہ اس میں سکڑاؤ اور ابھار تھا۔ جب اسے پھیلایا گیا تو وہ اپنے سکڑاؤ سے پھیل گیا اور اس ابھار کو ہموار کر دیا جو اس میں تھا۔ پس اس نے زمین کی وسعت میں اضافہ کیا اور اس کے نشیب کو بلند کر دیا یہاں تک کہ اسے ہموار کر دیا، تو اس میں وہ اضافہ ہوا جو اس کی سطح سے اس کے گہرائی تک تھا، بالکل اسی طرح جیسے چمڑے میں ہوتا ہے۔ پس تم زمین میں \"نہ کوئی کجی دیکھو گے اور نہ کوئی اونچ نیچ\" (عِوَجًا وَلَا أَمْتًا)۔ پس نگاہ تمام اہل موقف کا احاطہ کرے گی، بغیر کسی بلندی یا پستی کے حجاب کے، تاکہ مخلوق ایک دوسرے کو دیکھ سکے اور وہ ظاہر (الظاہر) اور باطن (الباطن) کی دو صفات اور دو قدموں کے حکم کی موجودگی میں اللہ کے فیصلے اور قضاء کا مشاہدہ کریں۔\n\nاگر حق کا ظہور (ظہور الحق) نہ ہوتا تو انسان نہ ہوتا،\nاور اگر حق کا بطون (بطون الحق) نہ ہوتا تو کوئی دلیل قائم نہ ہوتی۔\n\nپس وہاں واجب (واجب) کے سوا کچھ نہیں، پھر واجب ہی ہے،\nجب تم نے معاملہ جان لیا تو وہاں کوئی امکان (إمکان) نہیں ہے۔\n\nکائنات میں اس کی عین ذات (عین ذاتہ) سے زیادہ کامل کوئی نہیں،\nاور اسی کو اس نے کائنات میں انسان (إنسان) کا نام دیا۔\n\nاور اس کے سوا کوئی مقصود نہیں، کیونکہ وہ حق (الحق) ہے،\nنہ تمہیں ہمیشہ کی جنتیں حجاب میں ڈالیں گی اور نہ آگیں۔\n\nپس جس نے اسے ظاہر کیا، جان لو کہ اس کے لیے غضب ہے جسے وہ ظاہر کرتا ہے،\nاور ایک وقت رضا (رضوان) بھی ہے۔\n\nپس دو جہانوں کا ہونا ضروری ہے: ایک عزت کا گھر (دار کرامۃ)\nاور ایک عذاب کا گھر، جس میں عقل کے لیے وضاحت ہے۔\n\nاور یہ جو ہم اپنی گفتگو میں لائے ہیں،\nاگر تم غور کرو تو یہ حق ہے، اس میں کوئی بہتان نہیں۔\n\nاور تم اس چیز کو کیسے نہیں پہچانتے جس کا تم نے خود سے نطق کیا اور ترجمانی کی؟\n\nاور میں جان چکا ہوں کہ حق (الحق) نے میری تائید کی ہے،\nپس جو کچھ میں کہتا ہوں وہ اسی کی طرف سے ہے اور اس نے مجھے مقید کر دیا ہے۔\n\nاس کے ذریعے، روحیں (الأرواح) مجھ پر مسلسل نازل ہوتی رہتی ہیں،\nاور وہ مجھ سے محبت کرتی ہیں اور میرا قصد کرتی ہیں۔\n\nاور یہ اس لیے ہے کہ ہمارے پاس ایک کامل آنکھ ہے،\nجس کے ذریعے جو شخص میرا مشاہدہ کرتا ہے وہ اپنی ذات کو دیکھتا ہے۔\n\nاسی لیے میرے رب نے مجھے وجود بخشا اور مجھے خاص کیا،\nپس جو کچھ اس میں ہے وہ اسی کی طرف سے ہے جب وہ مجھے پاتا ہے۔\n\nاور میری طرف دیکھو، تم میری صورت میں ایک عجوبہ دیکھو گے،\nہر حال میں حق کا معبود مجھے سعادت بخشتا ہے۔\n\nجب میں کسی ایسے کام کا ارادہ کرتا ہوں جس کا کوئی دوسرا کام مقابلہ نہ کر سکے،\nتو میں اپنے معبود کو اس میں اپنی تائید کرتے ہوئے پاتا ہوں۔\n\nپس ہر عقل جو میرے رب کو دیکھتی ہے، وہ اسے واحد مانتی ہے،\nاور حق جب مجھے دیکھتا ہے تو میرے ذریعے مجھے واحد مانتا ہے۔\n\nپس اللہ جانتا ہے کہ غیب میں کیا عجوبہ ہے،\nاور اس تک رسائی کے ذریعے حق مجھے یکتا کر دیتا ہے۔\n\nاور اس مقام (منزل) میں وہ علوم ہیں جو چاروں کتابوں یعنی قرآن، تورات، انجیل اور زبور میں ہیں۔ اور اس میں یہ علم ہے کہ کتابوں کے نازل ہونے کا سبب کیا ہے، اور وہ صرف رسولوں پر کلام کی صورت میں نازل ہوئیں اور رسولوں کی طرف سے کتابوں میں لکھی گئیں۔ اور جو کچھ نقل کیا گیا ہے، اس کے مطابق وہ کتابت کی صورت میں آسمان دنیا پر لیلۃ القدر کو نازل ہوا، جو نصف شعبان کی رات کے موافق تھی۔ پھر \"روح الامین اسے لے کر نازل ہوئے\" (نَزَلَ بِهِ الرُّوحُ الْأَمِينُ) محمد صلی اللہ علیہ وسلم کے قلب پر، اختلاف کے مطابق، تیئیس سال یا بیس سال میں تھوڑا تھوڑا کر کے۔ اور اس میں ترجمانی کو انزال (انزال) اور تنزیل (تنزیل) کہنے کا علم ہے۔ اور اس میں یہ علم ہے کہ جس سے پردہ ہٹا دیا گیا یہاں تک کہ اس نے امر کا مشاہدہ کیا جیسا کہ وہ ہے، کیا وہ سمعی آداب کا مکلف ہے یا وہ مقام غفلت اور عقلِ تکلیف کے زائل ہونے کا تقاضا کرتا ہے، تو وہ فرشتوں میں سے مہیمن (المهیمن) کے ساتھ بغیر کسی رسم کے باقی رہتا ہے؟ اور اس میں وصیتوں اور آداب کا علم ہے، اور مخاطبین اور طرفین کے احوال کا علم ہے۔ اور اس میں پڑوسی کے لیے پڑوس کی حفاظت کا علم ہے، اور کیا پڑوسی اگر اپنے پڑوسی کی حرمت پامال کرے تو کیا پڑوسی اسے اسی طرح بدلہ دے گا جیسا کہ اس نے کیا، یا وہ پڑوس کی حفاظت کا مکلف ہو گا اور اس کی برائی کا بدلہ برائی سے نہیں دے گا؟ اور اس میں اس ذات کا حال ہے جو مکرم اخلاق کا حکم دینے والی ہے، اور ان میں عفو و درگزر اور ذمہ داریوں کی ضمانت دے کر غموں کو دور کرنا شامل ہے، کیونکہ وہ اس کی ادائیگی میں غنی ہے۔ پھر اس کے بعد وہ سزا بھی دیتا ہے، اور عفو بھی مستحب ہے اور ضمانت بھی مستحب ہے، تو جس کی یہ صفت ہو اس کی طرف سے سزا کس صفت کے تحت ہو گی؟ اور اس میں امر (الأمر) اور اس کی صفت میں فرق کا علم ہے۔ اور اس میں اس زینت کا علم ہے جو حرام کی گئی، جو مباح کی گئی، اور جو ممنوع کی گئی، اور ہر زینت کا مقام۔ اور اس میں خبیث (ناپاک) اور طیب (پاکیزہ) میں فرق کا علم ہے۔ اور اس میں یہ علم ہے کہ آخرت میں نقصان کا مرجع کس پر ہو گا، جب اس میں دو شخص ہوں، ایک مفلس اور دوسرا مالدار۔ اور اس میں ثناء (تعریف) اور اس کی احوال کے ساتھ تفصیلات کا علم ہے۔ اور اس میں مردوں کا اپنی موت کی حالت میں ایک دوسرے سے مخاطب ہونے کا علم ہے، اور کیا موت کے بعد ان کا حال ان کے ایجاد سے پہلے کے حال جیسا ہے یا نہیں؟ اور اس میں موت اور اس کی ماہیت (ماہیۃ) کا علم ہے۔ اور اس میں دو مٹھیوں کے درمیان تفریق کا علم ہے۔ اور اس میں قیامت کے دن اور جنت میں داخل ہونے سے پہلے کی تکلیف (مکلف ہونے) کا علم ہے۔ اور اس میں نیک بختوں (السعداء) اور بد بختوں (الأشقیاء) میں علامات کا علم ہے، اور جس کی کوئی علامت نہ ہو وہ کس گروہ میں ہو گا؟ اور اس میں اس شخص کا علم ہے جس نے کسی چیز پر قسم کھائی اور اللہ نے اسے جھوٹا کر دیا، اور یہ وارد ہوا ہے کہ جو اللہ پر قسم کھاتا ہے، اللہ اسے جھوٹا کر دیتا ہے۔ اور اس میں یہ علم ہے کہ کرم (الکرم) سے موصوف شخص کے لیے کیا سبب ہے کہ جب کوئی مجبور محروم اس سے سوال کرے اور وہ اس کی غم خواری کرنے اور جو اس نے مانگا ہے وہ دینے پر قادر ہو، لیکن وہ ایسا نہ کرے، تو وہ کیا عذر پیش کرے گا، اور اس رحم کیے گئے سائل کی صفت کیا ہے؟ اور اس میں رات اور دن کی اولاد میں کس چیز سے فرق کیا جاتا ہے، اس کا علم ہے۔ اور اس میں عالم انوار (عالم الأنوار) کے تیرنے کا علم ہے۔ اور اس میں بندے کا دو متضاد صفات کے ساتھ قائم ہونے کا علم ہے، اور وہ دونوں حالتوں میں اللہ عزوجل کے نزدیک قابل تعریف ہے۔ اور اس میں اس بات کا علم ہے کہ رحمت (الرحمۃ) نے \"ہر چیز کو گھیر رکھا ہے\" (وَسِعَتْ كُلَّ شَيْءٍ)، پھر اسے بعض اشخاص سے قریب ہونے کی صفت سے موصوف کیا گیا ان صفات کی وجہ سے جو ان میں قائم ہوئیں، تو کیا یہ وہی رحمت ہے جس نے \"ہر چیز کو گھیر رکھا ہے\" (وَسِعَتْ كُلَّ شَيْءٍ) یا کوئی اور رحمت ہے؟ اور اس میں اس شخص کا علم ہے جسے اللہ نے سعادت پر مجبور کیا، حالانکہ وہ اسے ناپسند کرتا ہے، اور وہ اللہ کے علم میں سعید ہے۔ اور اس میں اندھے کا بینا سے یہ کہنا کہ \"تم کیوں اندھے ہو، کچھ نہیں دیکھتے؟ کیا تم مجھے نہیں دیکھتے کہ میں اندھیرا دیکھتا ہوں اور تم اسے نہیں دیکھتے اور دعویٰ کرتے ہو کہ تم دیکھتے ہو؟\" کا علم ہے۔ اور اس میں اعتبار کا علم، امکان (الإمکان) اور ممکنات (الممکنات) کا علم، سیمیاء (علم السیمیاء) کا علم، وراثت اور وارثین کا علم، واقعات پر دلالتوں کا علم، تشبیہ (التشبیہ) کا علم، اور غیرت (الغیرۃ) کا علم ہے۔ اور اس میں شوق اور اشتیاق کا علم ہے۔ اور اس میں توبہ (التوبۃ) کیا ہے، اس کی تقسیمات اور توبہ کرنے والوں کا علم ہے۔ اور اس میں ہر چیز کا علم ہے۔ اور اس میں ذوق (الذوق) کا علم ہے۔ اور اس میں احوال (الأحوال) کے اثر کا علم ہے۔ اور اس میں تقیید (التقييد) اور اطلاق (الإطلاق) کا علم ہے۔ اور اس میں بوجھ اٹھانے کا علم ہے۔ اور اس میں اختصاص (الاختصاص) کا علم ہے۔ اور اس میں علوم کی تقسیمات کا علم ہے۔ اور اس میں مراتب (المراتب) کا علم ہے۔ اور اس میں شرائع کے بدلنے اور بعض کا بعض کو منسوخ کرنے کا علم ہے۔ اور اس میں خلف (خلف) اور خلف (خَلَف) (لام کے سکون اور فتحہ کے ساتھ) کا علم ہے۔ اور اس میں خوفزدہ کرنے والی چیز کو واقع کیے بغیر ہیبت اور خوف دلانے کا علم ہے۔ اور اس میں برزخی عہد و پیمان (العهود والمواثيق البرزخیۃ) کا علم ہے۔ اور اس میں تسلیم (التسلیم) کا علم ہے۔ اور اس میں استدراج (الاستدراج) کا علم ہے اور قرب (القرب) کی عین میں دوری کا اظہار، اور جو شخص اسے جانتا ہے اس کی صفت کیا ہے؟ اور اس میں موقتات (وقت مقرر کردہ چیزوں) کے اوقات کا علم ہے۔ اور اس میں اس علم کا علم ہے جو عمل کا تقاضا کرتا ہے، اس عمل میں سے جو وہ عطا کرتا ہے۔ کیونکہ یہ محال ہے کہ کوئی علم اپنے حامل کے ساتھ قائم ہو اور وہ عمل نہ کرے، اور بہت سے لوگ اس میں غلطی پر ہیں، پس علم لازماً عمل کا تقاضا کرتا ہے۔ اور اس میں اسماء میں شرکت اور اس کے اثر کا علم ہے۔ اور اس میں عجز (العجز) کا علم ہے اور یہ کہاں فائدہ مند ہوتا ہے اور دلیل بنتا ہے۔ اور اس میں اعضاء کے منافع کا علم ہے۔ اور اس میں اس چیز کا علم ہے جس سے انسان سے شیطانی اور نفسانی خیال کو دور کیا جاتا ہے۔ اور اس میں سجدہ کرنے والوں میں سجدے کے مراتب کا علم ہے، اور کس چیز نے انہیں سجدہ کروایا، اور وہ سجدہ کون سا ہے جس کے بعد سجدہ کرنے والے کے لیے سر اٹھانا نہیں ہے؟ اور اللہ \"حق فرماتا ہے\" (يَقُولُ الْحَقَّ) اور \"وہی راہ دکھاتا ہے\" (وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "«باب سیصد و هفتاد و هفتم: در معرفت منزل سجود قیومیت (القيومية)، صدق (الصدق)، مجد (المجد)، لؤلؤه و سور»\n\nآنگاه که میزان در گنبد عدل نهاده شود *** و حق (الحق) برای حکم و فصل آید\nشکلی بدیع و مثلث برای ما پدیدار گردد *** دو ضلع در مِثل و یک ضلع بی‌مِثل\nو برای بقای آن، ناگزیر از ترجیح است *** پس امری که با فضل تأیید شود، ضروری است\nحکم میل با اعتدال آن از میان می‌رود *** و ترازوی سعادت با سنگینی (ثقل) رجحان می‌یابد.\n\n### [هر آنچه غیر خداست، مُلک است]\n\nبدان، خداوند تو را تأیید کند، که شرعاً و عقلاً ثابت شده است که او سبحانه و تعالی در مرتبه احدیت (أحدي المرتبة) است، پس هیچ معبودی جز او نیست، الله یگانه است و شریکی در مُلک ندارد. و مُلک (الملك) هر آن چیزی است که غیر خدا باشد. اما اینکه او تعالی ولیّ (ولی) داشته باشد، مانند شریک در مُلک نیست؛ زیرا شریک در مُلک مطلقاً نفی شده است، چرا که در نفس‌الامر (نفس الأمر) وجود عینی ندارد. اما ولیّ (الولي) وجود عینی دارد. او خدا را یاری می‌کند به قصد تقرب به او و پرده‌پوشی، به امید آنکه او را برگزیند و نزدیک گرداند، نه به خاطر خواری‌ای که به خدا رسیده باشد تا او را بر کسی که خوارش کرده یاری دهد، یا به خاطر ضعف او یاری‌اش کند؛ خداوند برتر است. خداوند تعالی می‌فرماید: **إِنْ تَنْصُرُوا الله** (اگر خدا را یاری کنید) و فرمود: **وَهُوَ خَيْرُ النَّاصِرِينَ** (و او بهترین یاری‌دهندگان است). او نفرمود: **إِنْ تَنْصُرُوا الله** مگر آنکه وقوع این نصرت (یاری) ضروری است، اما همان‌گونه که ذکر کردیم، و آن قول خداوند تعالی است: **وَلَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ** (و برای او ولیّ و یاوری از روی خواری نیست)، یعنی یاوری به خاطر خواری. و **وَكَبِّرْهُ تَكْبِيراً** (و او را بسیار بزرگ شمار) از این دو وصف. همان‌گونه که او تعالی به دلیل عقل و شرع، احدیّت کثرت (أحدي الكثرة) است به واسطه اسماء حسنی یا صفات یا نِسب خود. و به طور خاص، به واسطه شرع، احدیّت کثرت در ذات (الذات) خود است، به آنچه از خود خبر داده است، با این قولش: **بَلْ يَدَاهُ مَبْسُوطَتَانِ** (بلکه هر دو دست او گشاده است) و **لِمَا خَلَقْتُ بِيَدَيَّ** (به آنچه با دو دست خود آفریدم) و **وَتَجْرِي بِأَعْيُنِنَا** (و زیر نظر ما روان است) و «قلب بین دو انگشت از انگشتان رحمان است» و **وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ** (و آسمان‌ها در هم پیچیده به دست راست اوست) و «هر دو دست پروردگارم یمین (دست راست) مبارک است».\n\nو این‌ها و امثال آن‌ها، همگی اخباری درباره ذات (الذات) هستند که خداوند از خود خبر داده است، در حالی که ادله عقلی آن را محال می‌دانند. اگر شنونده صاحب نظر عقلی و مؤمن باشد، به دلیل توقف بر عقل خود، در آن تأویل (تأويل) می‌کند. و اگر شنونده با ایمان، باطن (الباطن) نورانی داشته باشد، به آن ایمان می‌آورد بر اساس علم خداوند در آن، همراه با معنای معقولی که از الفاظ وارد شده مانند دست، انگشت، چشم و غیره فهمیده می‌شود، اما نسبت (النسبة) آن را نمی‌داند تا زمانی که خداوند پرده از بصیرتش بردارد و مراد از آن عبارت را از طریق کشف (الکشف) درک کند. زیرا خداوند هیچ رسولی را نفرستاد مگر **إِلَّا بِلِسَانِ قَوْمِهِ** (مگر به زبان قومش)، یعنی با آنچه بر آن توافق کرده بودند برای بیان معانی‌ای که متکلم می‌خواهد مراد خود را از آن به شنونده برساند. پس معنا به هیچ وجه از دلالت آن لفظ تغییر نمی‌کند، اگرچه چگونگی نسبت دادن آن مجهول باشد، و این امر به معنای معقول آن عبارت خدشه‌ای وارد نمی‌کند.\n\nواحد است و بسیار، شگفتا *** و برای کسی که آن را حاصل کند، مذهبی است\nعلم تنها از آن کسی است که آن را *** از طریق ذوق (الذوق) به دست آورد، پس او نوشنده است\nای طالب گنج، همانا آن *** عین همان چیزی است که با خود آورده‌ای، نه آنچه می‌جویی.\n\n### [وحدتی که کثرت در آن نباشد، محال است]\n\nو بدان، خداوند تو را تأیید کند، که محال است در معلومات (المعلومات) امری وجود داشته باشد که حکمی نداشته باشد، و آن حکم عین ذات (الذات) آن نباشد، بلکه معقولی دیگر باشد. پس هیچ واحدی در نفس‌الامر (نفس الأمر) در عین خود نیست که واحد کثرت (واحد الكثرة) نباشد. بنابراین، جز مرکب (مركب) وجود ندارد که کمترین نسبت ترکیب (التركيب) به آن این باشد که عین آن و آنچه بر عین آن حکم می‌شود، باشد. پس وحدتی که کثرت در آن نباشد، محال است.\n\n### [ترکیب ذاتی واجب برای مرکب واجب‌الوجود بالذات]\n\nو بدان که ترکیب ذاتی (التركيب الذاتي) واجبی که برای مرکب واجب‌الوجود بالذات (الواجب الوجود لنفسه) است، خدشه‌ای را که متفکران (النظار) توهم می‌کنند، در آن وارد نمی‌سازد؛ زیرا آن خدشه مربوط به ترکیب امکانی (التركيب الإمكانى) در ممکنات است، با توجه به اختلاف ترکیبات امکانی، که در آن ترکیب خاص در این مرکب، نیازمند مخصص است. برخلاف امری که شیء به ذات خود مستحق آن است. همان‌گونه که درباره شیئی که اشکال را به ذات خود می‌پذیرد، نمی‌گویی که این پذیرش اشکال به واسطه جاعل (سازنده) است، بلکه آنچه به واسطه مخصص برای آن حاصل می‌شود، وجود شکل خاصی است نه غیر آن، با وجود امکان قیام شکل دیگری به آن. پس مخصص برای شیئی که قابلیت پذیرش اشکال را دارد، ضروری است، زیرا این قابلیت برای ذات اوست. بنابراین، ترکیب ذاتی که واجب‌الوجود بالذات مقتضی آن است، خارج از این حکم است، زیرا ماهیت (الماهية) آن نزد متفکران مجهول است. پس نسبت ترکیب به آن مجهول است، با وجود معقول بودن ترکیب. و معنای ترکیب، کثیر بودن آن در ذات خود است. همان‌گونه که وجود صفات قدیم برای او، نزد مثبتان صفات از متفکران مانند اشاعره، خدشه‌ای وارد نکرده است. و ما هرگز عقلی نیافتیم که دلیلی قاطع بر این اقامه کند که بر او تعالی به امری حکم نمی‌شود. نهایت کسی که در نظر عقلی غرق شده و از علمایی که مشهورند به عقل محض و بهره‌ای از ایمان ندارند، این است که بر او حکم کرده که او علت است. پس توحید (التوحيد) برای او در ذاتش خالص نشد، هنگامی که بر او حکم به علیت کرد. اما دیگر متفکران بر او به نِسب (النسب) حکم کردند و اینکه امری وجود دارد که «قائلیت» و «قادریت» نامیده می‌شود و به واسطه آن دو، حکمی بر او صادر می‌کنیم که او قائل و قادر است. اما غیر از این متفکران، حکم کردند که او صفاتی زائد بر ذات خود دارد، قدیم و ازلی که قائم به ذات او هستند و حیات، علم، قدرت، اراده، کلام، سمع و بصر نامیده می‌شوند، و به واسطه آن‌ها گفته می‌شود که او زنده، دانا، توانا، مرید، متکلم، شنوا و بیناست. و همه اسماء از حیث معانی‌شان، یعنی اسماء الهی، تحت این صفات ازلی و قدیم که قائم به ذات حق (ذات الحق) هستند، مندرج می‌شوند. و برخی از متفکران برای هر اسم الهی معنایی معقول قائل شدند که از آن فهمیده می‌شود که آن معنا قائم به ذات حق، قدیم و ازلی است، هر چه که باشد و به هر عددی که برسد. و از ابوبکر قاضی باقلانی روایت کرده‌ایم که او به این قائل است. با این حال، آن‌ها با نظر عقلی توافق کردند که حوادث به او قائم نمی‌شوند. پس ذات او را از حکمی خالی نگذاشتند، یا به نِسب، یا به صفات، یا به معانی اسماء. سپس شرع آمد، که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آن را ترجمه کرد و گفت که آن کلام خداست و دلالت بر صدق خود اقامه کرد که از نزد خداست و خبر داد که در هر آنچه از خدا سخن می‌گوید، **مَا يَنْطِقُ عَنِ الْهَوَىٰ إِنْ هُوَ إِلَّا وَحْيٌ يُوحَىٰ** (از روی هوس سخن نمی‌گوید، این نیست مگر وحیی که به او الهام می‌شود)، که روح‌الامین بر قلب او نازل می‌کند یا خداوند آن را به او الهام می‌کند که او تعالی بر فلان و فلان امور است که خود را به آن‌ها وصف کرده است. و درباره ذات خود خبر داد که بر همان چیزی است که خبر داده، با عباراتی که معانی آن‌ها در عرف به توافق دانسته می‌شود. در این امر شک نداریم، به هر زبانی که آن رسول فرستاده شده باشد. و آن معانی را به خود و ذات خود نسبت داد که او بر آن‌هاست: از دو دست، دو انگشت، یمین (دست راست)، چشم‌ها، معیت (همراهی)، خنده، شادی، تعجب، گشاده‌رویی (تبشبش)، آمدن، رفتن، استواء (بر تخت نشستن)، نزول، بینایی، علم، کلام، صدا و امثال آن از شتابان رفتن (هروله)، حد، مقدار، خشنودی و غضب به خاطر اسباب حادثی که بندگان مکلف انجام داده‌اند و پروردگارشان را به غضب آورده‌اند، پس غضب را پذیرفت و خود را به آن وصف کرد. و خود را وصف کرد به اینکه بنده اگر صدقه دهد، مثلاً، با صدقه خود غضب خدا را بر خود خاموش می‌کند. این همه، معقول‌المعنا (معنایش فهمیده می‌شود) است، اما نسبت آن به خدا مجهول است، و ایمان به آن بر هر انسانی که از جانب خدا مورد خطاب یا تکلیف قرار گرفته، واجب است. و این همه خارج از دلالت عقلی است، مگر اینکه تأویل شود، که در آن صورت عقل آن را می‌پذیرد. پس پذیرش آن با ایمان (الإيمان) اولی‌تر است، زیرا حکمی است که حق (الحق) بر خود جاری کرده که چنین است، با وجود آنکه **لَيْسَ كَمِثْلِهِ شَيْءٌ** (هیچ چیز مانند او نیست). پس نفی علم ما به وجه نسبت آن به خود، نفی حکم به آن از خود نیست. و حکم او سبحانه بر خود به امری، برای ما اولی‌تر است که از او بپذیریم تا حکمی که مخلوقی، یعنی عقل، بر او جاری کرده است. پس چقدر کور است کسی که از عقل خود در حکمی که بر پروردگارش جاری کرده، پیروی کند و از آنچه پروردگار بر خود حکم کرده، پیروی نکند. و چه کوری‌ای سخت‌تر از این؟ به ویژه آنکه مترجم از جانب خداوند تعالی، یعنی رسول (صَلَّى اللهُ عَليهِ وسَلَّم)، مکلفین صاحب عقول را نهی کرده است که در ذات خدا تفکر کنند و او را به صفتی وصف کنند که در اخبار خداوند از خود نیست. اما آن‌ها قضیه را برعکس کردند و در ذات خدا تفکر کردند و به آنچه حکم کردند، بر ذات او تعالی حکم راندند. و هنگامی که اخبار او درباره آنچه در ذاتش هست به ما رسید، آن را با عقول خود انکار کردند و رد نمودند و رسولان و کسانی که آن‌ها را تصدیق کردند، تکذیب نمودند. و کسانی از این‌ها که تصدیق کردند، آن را سیاستی از سوی حکیمی عاقل برای مصلحت وقت و فراهم آوردن انگیزه‌ها برای اجتماع بر خدایی با این صفات دانستند، به عنوان تقریری در نفوس قاصر. پس هنگامی که این را مقرر کردند، در میان عموم مردم با ارتباط به آن صفات، همانند عموم، ظاهر شدند، در حالی که در باطن خود خلاف آنچه ظاهر کردند، داشتند. اما کسی که نظرش وجود رسول و صدق او در اخبارش را به او داده است، نهایت کارش تأویل است تا از حکم عقل خود بر پروردگارش در آنچه از خود خبر داده، خارج نشود. پس او در تصدیق خود، گویی تکذیب‌کننده است. اما اهل سلامت که نوری جز نور ایمان (الإيمان) ندارند، آن را به خداوند واگذار کردند، بر اساس علم خداوند در آن، همراه با ایمان و تحقیق آنچه آن عبارات از معانی، به واسطه توافق بر آن‌ها در آن زبانی که این رسول به آن مبعوث شده، افاده می‌کنند. و اما اهل کشف (الکشف) و شهود (الشهود)، همان‌گونه که این گروه ایمان آوردند، ایمان آوردند، سپس در آنچه برایشان حد و شرع قرار داده، تقوای الهی پیشه کردند. پس خداوند برای آن‌ها فرقانی قرار داد که به واسطه آن بین نسبت این احکام به خدا و نسبت آن‌ها به مخلوق فرق گذاشتند. پس معانی آن‌ها را از طریق عیان و علم ضروری شناختند. و تا اینجا به پایان رسیدند. پس بنگر به تفاوت عقول در یک امر واحد و اختلاف راه‌ها در آن، برای کسی که عقل سلیم دارد و گوش به خطاب حق (خطاب الحق) سپرده و شاهد مواضع خطاب الهی بر اساس شهود (الشهود) و کشف (الکشف) است. پس اگر آنچه ذکر کردیم مقرر شد و امر بر همان بود که شرح دادیم و بیان کردیم، بدان که خداوند همان ظاهر (الظاهر) است که چشم‌ها او را مشاهده می‌کنند و باطن (الباطن) است که عقل‌ها او را مشاهده می‌کنند. همان‌گونه که در معلومات (المعلومات) هیچ غیبی به طور کامل از او پنهان نیست، بلکه هر چیزی برای او مشهود است، همچنین او برای خلقش غیب نیست، نه در حال عدمشان و نه در حال وجودشان، بلکه برای آن‌ها با وصف ظهور و بطون، برای بصیرت‌ها و دیده‌ها، مشهود است. جز اینکه از شهود، علم به اینکه او همان مطلوب است، لازم نمی‌آید، مگر به اعلام خداوند و قرار دادن علم ضروری در نفس بنده که او همان است. مانند آنچه برای شخص خوابیده رخ می‌دهد، هنگامی که صورت رسول یا حق تعالی را در خواب می‌بیند و در نفس خود بدون سبب ظاهری می‌یابد که آن مرئی رسول است اگر رسول باشد، یا حق است اگر حق باشد. و آن وجد (الوجد)، اگر در نفس او محقق شود، مطابق با همان چیزی است که امر بر آن است در آنچه دیده است. علم به خدا نیز این‌گونه است. جز این‌گونه درک نمی‌شود، نه با تفکر و نه با نظر، تا تحت حکم مخلوقی درنیاید. و هنگامی که امر بدین منزلت است و او از خود خبر داده که در صور (الصور) متحول می‌شود، با ثبوت این احکام، بر او حکم می‌کنیم به آنچه بر صورهایی که در آن‌ها برای بندگانش تجلی (التجلی) می‌کند، حکم می‌شود، هر چه که باشند. پس غیر او وجود ندارد، به ویژه در موطنی که از حقیقت آن دانسته می‌شود که ادعای الوهیت در آن جز برای خدا ممکن نیست. پس برای او مَثَلی نمی‌زنیم.\n\nزیرا او عین مَثَل است *** پاک و منزه است، عزیز و جلیل است\nو همه ما از او هستیم، اگر *** حقیقتش را دریابی، بر من بزرگ و جلیل است\nمگر آن کس که او را *** به ایمنی از خود بشارت داد و بزرگ داشت.\n\nپس کاری را انجام داد که آن موطن (الموطن) اقتضا می‌کرد، زیرا عالم به امور در ظهور از حکم آنچه وقت اقتضا می‌کند، فراتر نمی‌رود. به همین دلیل، طایفه‌ای درباره صوفی گفتند که او «ابن وقت» (فرزند زمان خود) است. و این حکم کاملان از مردان است. همان‌گونه که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) که رئوف و رحیم است، درباره گروهی در روز قیامت می‌گوید: «دور باد، دور باد» (سحقا سحقا). پس هنگامی که آن حال زائل شود، در مسئله تلطف می‌کند و برای کسی که باد او را به پایین افکنده، شفاعت می‌کند، و آن باد، نیروی حکم هوای نفس (هوى النفس) در مکانی دوردست است. پس حق (الحق) در یک حال واحد با صفت غضب و خشنودی و رحمت و عذاب، به حکم ظاهر (الظاهر) و باطن (الباطن) و معز (عزت‌دهنده) و مذل (خوارکننده) قیام می‌کند. پس گویی او برزخی (برزخ) بین دو صفت خود است، زیرا او صاحب دو قبضه و دو دست است. برای هر دستی حکمی است و در هر قبضه‌ای قومی. مانند دو کتابی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) با آن‌ها نزد اصحابش آمد و به آن‌ها خبر داد که در یکی از آن‌ها نام‌های اهل بهشت و نام پدران و عشایر و قبایلشان از زمانی که خداوند مردم را آفریده تا روز قیامت است، و در کتاب دیگر نام‌های اهل آتش و نام پدران و قبایل و عشایرشان از زمانی که خداوند مردم را آفریده تا روز قیامت است. اگر این با کتابت معمول نوشته می‌شد، اوراق یک شهر را هم در بر نمی‌گرفت، پس چگونه ممکن است دو کتاب در دستان رسول (صَلَّى اللهُ عَليهِ وسَلَّم) آن را احاطه کند؟ این از علم وارد کردن وسیع در تنگ است، بدون آنکه تنگ وسیع شود یا وسیع تنگ گردد. پس کسی که این امور را مشاهده کند و از طریق ذوق (الذوق) برایش حاصل شود، او همان عالم به خداست و به آنچه امر بر آن است در نفس و عین خود. زیرا صحیح آن است که شیء جز به ذات خود درک نمی‌شود و دلیلی قاطع بر آن جز خود آن نیست. و بصر برای آن شهود (الشهود) است و عقل برای آن قبول. اما کسی که معرفت امور را با دلایل غریبه‌ای که عین مطلوب نیستند، طلب کند، محال است که به مقصودی دست یابد و دستانش جز به نومیدی ظفر نخواهد یافت. اما مقربان (المقربون) در مقابل ذات (الذات) موصوف به دو دست، در پیشگاه خدا هستند، زیرا آن‌ها برای اجرای اوامر الهی در خلق در هر سرایی هستند. اما اهل یمین (اهل اليمين) این تصرف را ندارند، بلکه آن‌ها اهل سلامت و برائت هستند به دلیل آنچه بر آن بوده‌اند و هستند، از نیروی حکم بر نفوس خود و سرکوب هوای نفسشان با پیروی از حق (الحق). و اما اهل دست دیگر که درباره آن‌ها گفته شده است اصحاب شمال (أصحاب الشمال)، سرهای خود را پایین انداخته‌اند و از جمله آن‌ها کسی است که سر خود را پوشانده و چشمش از شدت عظمت آنچه می‌بیند، به او باز نمی‌گردد. پس هیچ طایفه‌ای از این سه گروه جز آنچه مقام و منزلت و مکانشان به آن‌ها می‌دهد، نمی‌بیند. پس هر طایفه‌ای از خدا خلاف آنچه دیگری مشاهده می‌کند، شهود می‌کند، در حالی که حق (الحق) واحد است. اگر امر، واحد کثرت (واحد الكثرة) نبود، شهود آن‌ها مختلف نمی‌شد. اگر کثرت در واحد نبود، امر جز واحدی که تقسیم نمی‌پذیرد، نبود، در حالی که تقسیم را پذیرفته است. پس اصل مانند اوست. و این سبب وجود دو سرا در آخرت، و دو کفه در میزان، و رحمت مقید به وجوب و مطلق به امتنان، و تفاوت مراتب در درجات بهشت و درکات آتش است.\n\nپس جز واحد کثیر (الواحد الكثير) نیست *** امور با مانند این شهود می‌شوند\nپس بنگر، اگر غرور به تو روی آورد *** حقاً که بیم‌دهنده (نذیر) برای آن بدون شک است\nو هر آنچه می‌گویی، دروغ است *** که سینه‌ها از شنیدن آن تنگ می‌شود.\n\nپس هنگامی که حق (الحق) در صفت جبروت (الجبروت) بر بنده‌ای از بندگانش تجلی (التجلی) کند، اگر آن کسی که تجلی بر او شده، مدبری جز خدا نداشته باشد، مانند کوه موسی که به خاطر تجلی الهی متلاشی شد (تدكدك)، زیرا در آن کوه جز خودش نبود. و اگر مدبری داشته باشد که خداوند برای او قرار داده است، مانند تدبیر نفوس ناطقه (النفوس الناطقة) برای ابدانشان، اجسامشان متلاشی نمی‌شود، بلکه آن تجلی در ارواحشان همان حکمی را جاری می‌کند که در کوه جاری کرد. پس روح، پس از آنکه قائم به تدبیر جسد بود، از قیام خود زائل شد و حکم صعق (بیهوشی) در جسد موسی ظاهر گشت. و این چیزی نیست جز از بین رفتن قیام مدبر برای آن جسد به طور خاص، همان‌گونه که کوه از تثبیت خود (وتدیته) زائل شد، پس در نفس خود ثابت ماند و غیر آن ثابت نماند. زیرا خداوند کوه را قرار نداد مگر برای اینکه لرزش زمین را با آن آرام کند. پس حکم آن با زوال کوه بودنش زائل شد، همان‌گونه که تدبیر روح برای جسد صاحب صعق زائل شد، زیرا قیام روح به جسد از بین رفت. پس موسی پس از صعق به هوش آمد، اما کوه به تثبیت خود بازنگشت، زیرا در آنجا کسی نبود که آن را طلب کند، به دلیل وجود عوض آن که کوه‌های دیگر بودند. اما این جسد خاص، مدبر مخلوقی جز این روح ندارد. پس جسم با حال خود، مدبرش را از خدا طلب کرد و خداوند آن را به او بازگرداند و به هوش آمد. پس نشأت طبیعی (النشأة الطبيعية) تدبیر را بر روح مدبر خود حفظ می‌کند، زیرا از مدبری که آن را تدبیر کند، بی‌نیاز نیست. اما زمین، تثبیت کوهی معین را بر خود حفظ نمی‌کند، زیرا از امثال آن بی‌نیاز است، اما از مجموع کوه‌ها برای طلب سکون بی‌نیاز نیست. پس این سبب علت به هوش آمدن موسی و عدم بازگشت تثبیت به کوه است. کوه‌ها در اصل به صفت رحمت، لطف و تنزل آفریده شده‌اند، اما در ابتدا به صورت قهر ظاهر شدند، زیرا لرزش زمین را آرام کردند. پس رحمت آن‌ها در قهر بود. بنابراین، کوه‌ها تواضع را نمی‌شناسند، زیرا آن‌ها زمین نبودند و سپس کوه شدند. پس اولین کوهی که خداوند آن را از قهر و جبروت خود پایین آورد، با حجابی که حق (الحق) از آن محجوب بود، حجاب شهود (حجاب شهود) نه حجاب علم، کوه موسی بود که متلاشی شد و پس از کوه بودن، زمین شد. پس او اولین کوهی است که خود را شناخت. سپس در قیامت، کوه‌ها به هنگام تجلی الهی، چون پشم حلاجی شده، ریز ریز می‌شوند (دکا دکا). و کشیدن زمین (مد الأرض) در واقع افزایش امتداد کوه‌ها و تبدیل آن‌ها به زمین است. پس آنچه از آن‌ها در بلندی در جو بود، هنگامی که گسترده شود، بر گستردگی زمین می‌افزاید. و به همین دلیل خبر آمده است که خداوند زمین را در روز قیامت مانند کشیدن پوست (مد الأديم) می‌کشد. و هنگامی که انسان پوست را می‌کشد، دراز می‌شود بدون آنکه چیزی به آن اضافه شود که در عین آن نبوده است، بلکه در آن جمع‌شدگی و برآمدگی وجود داشته است. پس هنگامی که کشیده شد، از جمع‌شدگی خود باز شد و آن برآمدگی که در آن بود، پهن شد. پس بر وسعت زمین افزود و قسمت‌های پست آن را بالا برد تا آن را هموار ساخت. پس آنچه از طول از سطح آن تا قعرش بود، به آن اضافه شد، همان‌گونه که در پوست است. پس در زمین **عِوَجاً وَلَا أَمْتاً** (هیچ کجی و پستی و بلندی) نمی‌بینی. پس دیدگان همه کسانی که در موقف هستند، بدون حجاب از بلندی و پستی، همه را در بر می‌گیرد تا خلق یکدیگر را ببینند و حکم خداوند را به فصل و قضاوت در میان بندگانش، به دلیل وجود دو صفت و حکم دو قدم (القدمين) از ظاهر (الظاهر) و باطن (الباطن)، شهود کنند.\n\nاگر ظهور حق (ظهور الحق) نبود، انسانی وجود نداشت *** و اگر بطون حق (بطون الحق) نبود، برهانی اقامه نمی‌شد\nپس جز واجب (الواجب) و سپس واجب نیست *** اگر امر را بدانی، امکانی (إمكان) وجود ندارد\nپس در هستی (الكون) کامل‌تر از عین ذات او نیست *** و این همان است که در هستی، انسان (إنسان) نامیده شده است\nو مقصودی جز او نیست، زیرا او *** حق (الحق) است، و جاودانگی و آتش‌ها تو را محجوب نمی‌کند\nپس بدان که آنکه او را آشکار ساخت *** برای او غضبی است که آشکار می‌کند و گاهی خشنودی\nپس ناگزیر از دو سراست: سرای کرامت *** و سرای عذاب که در آن برای عقل بیان است\nو این که در کلام خود آوردیم *** حق است، اگر بیندیشی، در آن دروغی نیست.\n\nو چگونه این را از نفس آنچه به آن نطق کرده و از آن ترجمه نموده‌ای، نمی‌شناسی؟\n\nو دانستم که حق (الحق) مرا تأیید کرده است *** پس آنچه بر زبان می‌آورم از اوست و مرا مقید ساخته است\nبه آن، پس ارواح پیوسته بر من نازل می‌شوند *** و مرا دوست دارند و قصد من می‌کنند\nو این بدان سبب است که ما چشمی کامل داریم *** که هر کس مرا شهود (يشهدني) کند، خود را در آن می‌بیند\nبه همین دلیل پروردگارم مرا ایجاد کرد و اختصاص داد *** پس هر آنچه در اوست، از اوست هنگامی که مرا می‌یابد\nو به من بنگر تا در صورتم شگفتی ببینی *** در هر حالی، خدای حق مرا سعادتمند می‌سازد\nاگر قصد کاری کنم که امری با آن مقاومت نکند *** خدایم را می‌یابم که در آن مرا یاری می‌دهد\nپس هر عقلی که پروردگارم را ببیند، او را توحید (توحيد) می‌کند *** و حق (الحق) هنگامی که مرا می‌بیند، مرا به واسطه خود توحید می‌کند\nپس خداوند آنچه در غیب (الغيب) از شگفتی است، می‌داند *** و با وصول (الوصول) به او، حق مرا یگانه می‌سازد.\n\nو در این منزل، علومی وجود دارد که در کتب چهارگانه، یعنی قرآن، تورات، انجیل و زبور، هست. و در آن علم سبب نزول کتب است، و نازل نشد مگر کلامی بر رسولان و نوشته شده از رسولان در کتب. و آنچه نقل شده، این است که کتابت آن در شب قدر، موافق با شب نیمه شعبان، به آسمان دنیا نازل شد. سپس **نَزَلَ بِهِ الرُّوحُ الْأَمِينُ** (روح‌الامین آن را نازل کرد) بر قلب محمد (صَلَّى اللهُ عَليهِ وسَلَّم) به صورت تدریجی در بیست و سه سال یا بیست سال، بر اساس اختلاف اقوال. و در آن علم نامگذاری ترجمه به انزال و تنزیل است. و در آن علم کسی است که پرده از او برداشته شده تا امر را بر آنچه هست مشاهده کند، که آیا او مخاطب به آداب سمعی است یا آن مقام، ذهول و زوال عقل تکلیف را اقتضا می‌کند، پس بدون رسم با مهیمن (المهيمن) از ملائکه باقی می‌ماند. و در آن علم وصایا و آداب و احوال مخاطبان و کسانی که مورد لطف قرار گرفته‌اند، هست. و در آن علم حفظ جوار (همسایگی) بر همسایه است، و آیا اگر همسایه حرمت همسایه‌اش را هتک کند، همسایه‌اش او را به مثل آنچه انجام داده، جزا می‌دهد، یا مخاطب به حفظ جوار است و او را به بدی در مقابل بدی‌اش جزا نمی‌دهد؟ و در آن علم حال کسی است که به کرم وصف شده و به مکارم اخلاق امر می‌کند، و از جمله آن‌ها عفو و گذشت و گشایش اندوه با ضمانت تبعات است، به دلیل غنایی که در ادای آن از جانب او دارد، سپس بعد از آن عقوبت می‌کند، در حالی که عفو مستحب است و ضمانت نیز مستحب است. پس عقوبت از کسی که این وصف اوست، به چه صفتی خواهد بود؟ و در آن علم فرق بین امر و صفت آن است. و در آن علم آنچه از زینت حرام شده و آنچه مباح گشته و آنچه ممنوع شده و موطن هر زینت است. و در آن علم فرق بین خبیث و طیب است. و در آن علم مرجع درک (عقوبت) در سرای آخرت بر چه کسی خواهد بود، اگر در ضمن او دو شخص باشند که یکی مفلس و دیگری توانگر است. و در آن علم ثنا و تفصیلات آن با احوال است. و در آن علم مخاطبه مردگان با یکدیگر در حال مرگشان است، و آیا حال آن‌ها پس از مرگ مانند حالشان قبل از ایجاد است یا خیر. و در آن علم مرگ و ماهیت آن است. و در آن علم فصل بین دو قبضه است. و در آن علم تکلیف در روز قیامت و قبل از ورود به بهشت است. و در آن علم علامات در سعادتمندان و شقاوتمندان و کسی که علامتی ندارد، که به کدام گروه خواهد بود، هست. و در آن علم کسی است که بر چیزی سوگند یاد کند و خداوند او را تکذیب کند، و وارد شده است که هر کس بر خدا سوگند یاد کند، خداوند او را تکذیب می‌کند. و در آن علم سبب ایجاب برای کسی که به کرم وصف شده، چیست، هنگامی که مضطر محروم از او درخواست کند و او قادر به مواسات و بخشش آنچه درخواست کرده است باشد، اما این کار را نکند، و با چه چیزی عذرخواهی می‌کند و صفت این سائل مرحوم چیست؟ و در آن علم اولاد شب و روز است که با چه چیزی بین آن‌ها فرق گذاشته می‌شود. و در آن علم شناوری عالم انوار است. و در آن علم قیام بنده به دو صفت متضاد است، در حالی که در هر دو حال نزد خداوند عز و جل ستوده است. و در آن علم این است که رحمت **وَسِعَتْ كُلَّ شَيْءٍ** (همه چیز را فرا گرفته است)، سپس به دلیل صفاتی که در برخی اشخاص قائم شده، به نزدیکی به آن‌ها وصف شده است. پس آیا این همان رحمتی است که **وَسِعَتْ كُلَّ شَيْءٍ** یا رحمت دیگری است؟ و در آن علم کسی است که خداوند او را به اکراه در سعادت، سعادتمند کرده، در حالی که در علم خدا سعید است. و در آن علم سخن کور به بینا است که: چرا تو کوری و چیزی نمی‌بینی؟ آیا نمی‌بینی که من تاریکی را می‌بینم و تو آن را نمی‌بینی و گمان می‌کنی که می‌بینی؟ و در آن علم اعتبار، و علم امکان و ممکنات، و علم سیمیا (علم السيمياء)، و علم ارث و وارثان، و علم دلالات بر وقایع، و علم تشبیه، و علم غیرت است. و در آن علم شوق و اشتیاق است. و در آن علم توبه چیست و تقسیمات آن و توبه‌کنندگان است. و در آن علم هر چیزی است. و در آن علم ذوق (الذوق) است. و در آن علم تأثیر احوال است. و در آن علم تقیید و اطلاق است. و در آن علم رفع اثقال است. و در آن علم اختصاص است. و در آن علم تقسیمات علوم است. و در آن علم مراتب است. و در آن علم تبدیل شرایع و نسخ برخی از آن‌ها توسط برخی دیگر است. و در آن علم خَلْف (جانشین) با سکون لام و خَلَف (نسل) با فتح لام است. و در آن علم تهویل (ترساندن) و تخویف بدون وقوع آنچه از آن ترسانده می‌شود، هست. و در آن علم عهود و مواثیق برزخی (البرزخية) است. و در آن علم تسلیم است. و در آن علم استدراج (به تدریج به هلاکت افکندن) و اظهار دوری در عین نزدیکی است، و صفت کسی که این را می‌شناسد چیست؟ و در آن علم اوقات موقتات است. و در آن علم آنچه علمی که مقتضی عمل است، از عمل می‌دهد، هست. زیرا محال است که علمی وجود داشته باشد که عمل را ایجاب کند، اما قائم به صاحبش باشد و عمل نکند. و بسیاری از مردم این را جایز می‌دانند و در آن بر خطا هستند. پس علم قطعاً مقتضی عمل است. و در آن علم شرکت در اسماء و تأثیر آن است. و در آن علم عجز و جایی که سودمند است و دلیل می‌شود، هست. و در آن علم منافع اعضا است. و در آن علم آنچه با آن خاطر شیطانی و نفسی از انسان دفع می‌شود، هست. و در آن علم مراتب سجود در ساجدان است، و چه چیزی آن‌ها را به سجده واداشته است، و سجودی که پس از آن برخاستنی نیست، برای کسی که آن را به جا آورد، چیست. و **وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}