{
  "id": 144,
  "title": {
    "ar": "الباب الرابع والأربعون ومائة في معرفة مقام الفكر وأسراره",
    "en": "Chapter One Hundred and Forty-Four: Concerning the Knowledge (معرفة) of the Spiritual Station (مقام) of Contemplation (الفكر) and its Mysteries.",
    "ur": "باب ایک سو چوالیس: مقام فکر (الفكر) اور اس کے اسرار کی معرفت کے بیان میں",
    "fa": "باب صد و چهل و چهارم در معرفت مقام فکر و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الرابع والأربعون ومائة في معرفة مقام الفكر وأسراره)\n\n\n> إن التفكر في الآيات والعبر *** ليس التفكر في الأحكام والقدر\n> إن التفكر حال لست أجهله *** فالله قرره في الآي والسور\n\n\n> لو لا التفكر كان الناس في دعة *** وفي نعيم مع الأرواح في سرر\n\n\n> الفكر نعت طبيعي وليس له *** حكم على أحد يدري سوى البشر\n\n\n> ولو يكون الذي قلناه ما نظرت *** بالغا عيني إلى الأحوال والصور\n\n\n> به المؤثر والأسماء قائمة *** تنفذ الأمر في بدو وفي حضر\n\n\n### [الفكر بمعنى الاعتبار هو نعت طبيعى خاص بالبشر]\n\n\nاعلم وفقك الله أن الفكر ليس بنعت إلهي إلا إذا كان بمعنى التدبير والتردد في الأولى فحينئذ يكون نعتا إلهيا وأما الفكر بمعنى الاعتبار فهو نعت طبيعي ولا يكون في أحد من المخلوقين سوى هذا الصنف البشري وهو لأهل العبر الناظرين في الموجودات من حيث ما هي دلالات لا من حيث أعيانها ولا من حيث ما تعطي حقائقها قال تعالى ويَتَفَكَّرُونَ في خَلْقِ السَّماواتِ والْأَرْضِ فإذا تفكروا أفادهم ذلك التفكر علما لم يكن عندهم فقالوا رَبَّنا ما خَلَقْتَ هذا باطِلًا سُبْحانَكَ فَقِنا عَذابَ النَّارِ فما عدلوا إلى الاستجارة به من عذاب النار إلا وقد أعطاهم الفكر في خلق السموات والأرض علما أشهدهم النار ذلك العلم فطلبوا من الله أن يحول بينهم وبين عذاب النار وهكذا فائدة كل مفكر فيه إذا أعطى للمفكر علما ما يسأل الله منه بحسب ما يعطيه‏\n\n\n### [أمر الشارع بالتفكر وهو نعت طبيعى ليكون عبادة وهي مقام روحى‏]\n\n\nفمقام الفكر لا يتعدى النظر في الإله من كونه إلها وفيما ينبغي أن يستحقه من له صفة الألوهية من التعظيم والإجلال والافتقار إليه بالذات وهذا كله يوجد حكمه قبل وجود الشرائع ثم جاء الشرع به مخبرا وآمرا فأمر به وإن أعطته فطرة البشر ليكون عبادة يؤجر عليها فإنه إذا كان عملا مشروعا للعبد أثمر له ما لا يثمر له إذا اتصف به لا من حيث ما هو مشروع‏\n\n\n### [ليس للفكر حكم ولا مجال في ذات الحق لا عقلا ولا شرعا]\n\n\nوليس للفكر حكم ولا مجال في ذات الحق لا عقلا ولا شرعا فإن الشرع قد منع من التفكر\n\n\nفي ذات الله وإلى ذلك الإشارة بقوله ويُحَذِّرُكُمُ الله نَفْسَهُ أي لا تتفكروا فيها وسبب ذلك ارتفاع المناسبة بين ذات الحق وذات الخلق وأهل الله لما علموا مرتبة الفكر وأنه غاية علماء الرسوم وأهل الاعتبار من الصالحين وأنه يعطي المناسبات بين الأشياء تركوه لأهله وأنفوا منه أن يكون حالا لهم كما سيأتي في باب ترك الفكر\n\n\n### [كيف يفوز صاحب الفكر بالصواب مع أن الفكر حال لا يعطى العصمة]\n\n\nوالفكر حال لا يعطي العصمة ولهذا مقامه خطر لأن صاحبه لا يدري هل يصيب أو يخطئ لأنه قابل للاصابة والخطاء فإذا أراد صاحبه أن يفوز بالصواب فيه غالبا في العلم بالله فليبحث عن كل آية نزلت في القرآن فيها ذكر التفكر والاعتبار ولا يتعدى ما جاء من ذلك في غير كتاب ولا سنة متواترة فإن الله ما ذكر في القرآن أمرا يتفكر فيه ونص على إيجاده عبرة أو قرن معه التفكر إلا والإصابة معه والحفظ وحصول المقصود منه الذي أراده الله لا بد من ذلك لأن الحق ما نصبه وخصه في هذا الموضع دون غيره إلا وقد مكن العبد من الوصول إلى علم ما قصد به هناك فقد ألقيت بك على الطريق وهكذا وجده أهل الله‏\n\n\n### [التزم الموضوعات التي نصبها الحق ميدانا للفكر ولا تتعد بالأمور مراتبها ولا تعدل بالآيات إلى غير منازلها]\n\n\nفإن تعديت آيات التفكر إلى آيات العقل أو آيات السمع أو آيات العلم أو آيات الايمان واستعملت فيها الفكر لم تصب جملة واحدة فالتزم الآيات التي نصبها الحق لقوم يتفكرون ولا تتعدى بالأمور مراتبها ولا تعدل بالآيات إلى غير منازلها وإذا سلكت على ما قلته لك حمدت مسعاك وشكرتني على ذلك فابحث على كل آية عبرة وتفكر تسعد إن شاء الله تعالى وكذلك الآيات التي فيها النظر من هذا الباب الفكري مثل قوله تعالى أَ فَلا يَنْظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ ومثل قوله أَ ولَمْ يَنْظُرُوا في مَلَكُوتِ السَّماواتِ والْأَرْضِ وكذلك أَ لَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحابِ الْفِيلِ وقوله أَ لَمْ تَرَ إِلى‏ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ الآية وكذلك آيات التدبر من هذا الباب مثل قوله أَ فَلا يَتَدَبَّرُونَ الْقُرْآنَ واجعل بالك إذا ذكر الله شيئا من ذلك بأي اسم ذكره فلا تتعدى التفكر فيه من حيث ذلك الاسم إن أردت الإصابة للمعنى المقصود لله مثل قوله أَ فَلا يَتَدَبَّرُونَ الْقُرْآنَ فانظر فيه من حيث ما هو قرآن لا من حيث ما هو كلام الله ولا من حيث ما هو فرقان ولا من حيث ما هو ذكر من قوله إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ\n\n\n### [كل اسم في القرآن له حكم وتعيينه بالذكر كى يفهم ذلك الحكم من ذلك الاسم‏]\n\n\nفكل اسم له حكم وما عينه الحق في الذكر إلا حتى يفهمه عباده ويعلمهم كيف ينزلون الأشياء منازلها فتلك الحكمة وصاحبها الحكيم وقد مدح الله من شرفه بالحكمة فقال ويُعَلِّمُهُ الْكِتابَ والْحِكْمَةَ وقال وآتَيْناهُ الْحِكْمَةَ وفَصْلَ الْخِطابِ وقال ومن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْراً كَثِيراً وما يَذَّكَّرُ إِلَّا أُولُوا الْأَلْبابِ‏\nفإن حكمها يسرى في جميع الأشياء وهو أن الحكيم لا يتعدى بالشي‏ء قدره ولا منزلته‏\n\n",
    "en": "## Chapter One Hundred and Forty-Four: On the Knowledge of the Station of Reflection and its Secrets\n\nIndeed, contemplation upon the Signs (الآيات) and lessons (العبر)\nIs not contemplation upon rulings (الأحكام) and destiny (القدر).\nContemplation is a spiritual state (حال) that I do not ignore,\nFor Allah has established it in the verses (الآي) and chapters (السور).\n\nWere it not for contemplation, people would be in ease,\nAnd in bliss with the spirits upon couches.\n\nReflection (الفكر) is a natural characteristic (نعت طبيعي), and it has no\nAuthority over anyone who knows, except for humankind.\n\nIf what we said were not true, my eye would not have gazed\nUpon the states (الأحوال) and forms (الصور) with full realization.\n\nThrough it (Contemplation), the Effector and the Names (الأسماء) are established,\nExecuting the Command in the desert and in the settled land.\n\n### [Reflection (الفكر) in the sense of Taking Heed (الاعتبار) is a Natural Characteristic Specific to Humankind]\n\nKnow, may Allah grant you success, that Reflection (الفكر) is not a Divine Attribute (نعت إلهي) unless it is understood in the sense of management (التدبير) and deliberation (التردد) regarding the First Cause (الأولى); in that case, it is a Divine Attribute. As for Reflection (الفكر) in the sense of taking heed (الاعتبار), it is a natural characteristic (نعت طبيعي) and does not exist in any of the created beings except this human species.\n\nIt belongs to those who take lessons (أهل العبر), who look at existing things (الموجودات) insofar as they are indications (دلالات), not insofar as they are their fixed entities (أعيانها) or insofar as their realities (حقائقها) yield. The Exalted said: <<وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ>> (And they reflect upon the creation of the heavens and the earth).\n\nWhen they reflected, that contemplation yielded them a knowledge they did not possess, so they said: <<رَبَّنَا مَا خَلَقْتَ هَذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ>> (Our Lord, You have not created this in vain; glory be to You, so protect us from the punishment of the Fire). They would not have turned to seeking refuge with Him from the punishment of the Fire unless contemplation upon the creation of the heavens and the earth had granted them a knowledge that made them witness the Fire. Thus, they asked Allah to interpose between them and the punishment of the Fire. This is the benefit of everything contemplated: when it grants the contemplator a certain knowledge, he asks Allah based on what that knowledge provides.\n\n### [The Lawgiver Commanded Reflection, which is a Natural Characteristic, so that it Might Become an Act of Worship, which is a Spiritual Station (مقام)]\n\nThe station (مقام) of Reflection (الفكر) does not exceed looking at the Deity (الإله) from the perspective of His being a Deity, and at what is necessary for the one possessing the attribute of Divinity (الألوهية) to deserve, such as veneration, majesty, and essential need (الافتقار إليه بالذات) for Him.\n\nThe ruling (حكمه) for all this existed before the advent of the revealed laws (الشرائع). Then the Law (الشرع) came, informing and commanding it. It commanded it, even though the human nature (فطرة البشر) already provided it, so that it might become an act of worship (عبادة) for which one is rewarded. For when it is a prescribed act (عملا مشروعا) for the servant, it yields results that it would not yield if the servant merely possessed the characteristic without it being prescribed.\n\n### [Reflection Has Neither Authority Nor Scope Regarding the Essence (الذات) of the Real (الحق), Neither Rationally Nor Legally]\n\nReflection (الفكر) has neither authority nor scope regarding the Essence (ذات) of the Real (الحق), neither rationally (عقلا) nor legally (شرعا). For the Law has indeed prohibited contemplation upon the Essence of Allah. The indication of this is His saying: <<وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ>> (And Allah warns you of Himself)—meaning, do not contemplate upon it (His Essence).\n\nThe reason for this is the absence of correspondence (المناسبة) between the Essence of the Real (ذات الحق) and the essence of creation (ذات الخلق). When the People of Allah (أهل الله) knew the level (مرتبة) of Reflection, and that it is the limit for the scholars of external forms (علماء الرسوم) and the righteous people of consideration (أهل الاعتبار), and that it yields correspondences between things, they left it to its practitioners and disdained it being a spiritual state (حال) for themselves, as will come in the chapter on abandoning Reflection.\n\n### [How the Practitioner of Reflection Can Achieve Correctness, Given that Reflection is a State that Does Not Grant Infallibility (العصمة)]\n\nReflection (الفكر) is a spiritual state (حال) that does not grant infallibility (العصمة). Therefore, its station (مقام) is dangerous, because its practitioner does not know whether he will be correct or mistaken, as it is susceptible to both correctness and error.\n\nIf its practitioner wishes to generally achieve correctness in the knowledge of Allah through it, he must search for every verse (آية) revealed in the Quran that mentions contemplation (التفكر) and taking heed (الاعتبار), and he must not exceed what has come regarding this in the Book or in a continuously transmitted Sunna (سنة متواترة).\n\nFor Allah has never mentioned a matter in the Quran for contemplation, explicitly stating that it contains a lesson (عبرة) or coupling it with contemplation, except that correctness, preservation, and the attainment of the intended purpose willed by Allah are necessarily associated with it. This is because the Real (الحق) would not have established it and singled it out in this place rather than another unless He had enabled the servant to reach the knowledge intended therein. I have thus set you upon the path, and this is how the People of Allah (أهل الله) found it.\n\n### [Adhere to the Subjects that the Real Has Established as the Field for Reflection, and Do Not Exceed the Proper Levels of Things, Nor Divert the Signs to Other than Their Stations]\n\nIf you exceed the Signs (آيات) of Contemplation to the Signs of Intellect (آيات العقل), or the Signs of Hearing (آيات السمع), or the Signs of Knowledge (آيات العلم), or the Signs of Faith (آيات الإيمان), and you employ Reflection therein, you will not achieve a single correct point.\n\nTherefore, adhere strictly to the Signs that the Real (الحق) has established for a people who reflect, and do not exceed the proper levels (مراتبها) of things, nor divert the Signs (الآيات) to places other than their proper stations (منازلها). If you proceed according to what I have told you, you will praise your endeavor and thank me for it. So search for every Sign (آية) that is a lesson (عبرة) and a subject for contemplation; you will be successful, God willing.\n\nLikewise, the Signs that involve looking (النظر) fall under this category of Reflection (الفكري), such as His saying, the Exalted: <<أَفَلَا يَنظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ>> (Do they not look at the camels, how they are created?), and His saying: <<أَوَلَمْ يَنظُرُوا فِي مَلَكُوتِ السَّمَاوَاتِ وَالْأَرْضِ>> (Have they not looked into the dominion of the heavens and the earth?), and likewise: <<أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ>> (Have you not considered how your Lord dealt with the People of the Elephant?), and His saying: <<أَلَمْ تَرَ إِلَى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ>> (Have you not considered your Lord, how He extends the shadow?)—and the rest of the verse.\n\nSimilarly, the Signs concerning pondering (التدبر) are of this category, such as His saying: <<أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ>> (Do they not ponder the Quran?). And pay attention: when Allah mentions something by a specific Name, do not exceed contemplating it from the perspective of that Name if you desire to attain the meaning intended by Allah. For example, His saying: <<أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ>> (Do they not ponder the Quran?). Look at it insofar as it is the Quran, not insofar as it is the Speech of Allah (كلام الله), nor insofar as it is the Criterion (الفرقان), nor insofar as it is the Reminder (الذكر) from His saying: <<إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ>> (Indeed, We have sent down the Reminder).\n\n### [Every Name in the Quran Has a Ruling, and its Specification in the Reminder is So that that Ruling May Be Understood from that Name]\n\nEvery Name (اسم) has a ruling (حكم), and the Real (الحق) only specified it in the Reminder (الذكر) so that His servants might understand it and know how to place things in their proper stations (منازلها). That is Wisdom (الحكمة), and its possessor is the wise person (الحكيم).\n\nAllah has praised those He honored with Wisdom, saying: <<وَيُعَلِّمُهُ الْكِتَابَ وَالْحِكْمَةَ>> (And He will teach him the Book and the Wisdom). And He said: <<وَآتَيْنَاهُ الْحِكْمَةَ وَفَصْلَ الْخِطَابِ>> (And We gave him Wisdom and decisive speech). And He said: <<وَمَن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْرًا كَثِيرًا وَمَا يَذَّكَّرُ إِلَّا أُولُو الْأَلْبَابِ>> (And whoever is granted Wisdom has certainly been granted much good. And none will remember except those of understanding).\n\nFor the ruling of Wisdom permeates all things, which is that the wise person (الحكيم) does not exceed the proper measure (قدره) or station (منزلته) of anything.",
    "ur": "(باب ایک سو چوالیس: مقامِ فکر اور اس کے اسرار کی معرفت میں)\n\nآیات اور عبرتوں میں تفکر کرنا، احکام اور تقدیر میں تفکر کرنا نہیں ہے۔\nتفکر ایک ایسا حال ہے جسے میں نہیں جانتا، جسے اللہ نے آیات اور سورتوں میں مقرر کیا ہے۔\nاگر تفکر نہ ہوتا تو لوگ آسانی میں ہوتے، اور روحوں کے ساتھ تختوں پر نعمتوں میں ہوتے۔\nفکر ایک طبعی صفت ہے اور اس کا حکم کسی جاننے والے پر نہیں ہے سوائے انسانوں کے۔\nاور اگر ایسا ہوتا جو ہم نے کہا، تو میری آنکھیں حالات اور صورتوں کو نہ دیکھتیں۔\nاسی کے ذریعے مؤثر (اثر ڈالنے والا) اور اسماء قائم ہیں، جو حکم کو دیہات اور شہر میں نافذ کرتے ہیں۔\n\n[فکر، عبرت حاصل کرنے کے معنی میں، ایک طبعی صفت ہے جو انسانوں کے لیے خاص ہے]\n\nاللہ آپ کو توفیق دے، جان لیجیے کہ فکر کوئی صفتِ الٰہی نہیں ہے، مگر جب وہ تدبیر اور اول میں تردد کے معنی میں ہو، تب وہ صفتِ الٰہی ہو سکتی ہے۔ لیکن فکر، عبرت حاصل کرنے (الاعتبار) کے معنی میں، ایک طبعی صفت ہے اور یہ مخلوقات میں سے کسی میں نہیں پائی جاتی سوائے اس نوعِ بشری کے۔ یہ ان اہل عبرت کے لیے ہے جو موجودات میں اس حیثیت سے دیکھتے ہیں کہ وہ دلالتیں ہیں، نہ کہ ان کی حقیقتوں کی حیثیت سے اور نہ اس حیثیت سے کہ وہ کیا حقائق دیتی ہیں۔ اللہ تعالیٰ نے فرمایا:\n**وَيَتَفَكَّرُونَ في خَلْقِ السَّماواتِ والْأَرْضِ**\n(اور وہ آسمانوں اور زمین کی تخلیق میں غور و فکر کرتے ہیں)۔\nجب انہوں نے تفکر کیا تو اس تفکر نے انہیں ایسا علم عطا کیا جو ان کے پاس نہیں تھا، چنانچہ انہوں نے کہا:\n**رَبَّنا ما خَلَقْتَ هذا باطِلًا سُبْحانَكَ فَقِنا عَذابَ النَّارِ**\n(اے ہمارے رب! تو نے یہ سب بے مقصد نہیں بنایا، تو پاک ہے، پس ہمیں آگ کے عذاب سے بچا)۔\nانہوں نے آگ کے عذاب سے پناہ مانگنے کی طرف رجوع نہیں کیا مگر اس لیے کہ آسمانوں اور زمین کی تخلیق میں فکر نے انہیں ایسا علم عطا کیا جس نے انہیں آگ کا مشاہدہ (الشہود) کرایا۔ پس انہوں نے اللہ سے درخواست کی کہ وہ ان کے اور آگ کے عذاب کے درمیان رکاوٹ ڈال دے۔ اور یہی ہر اس چیز میں فکر کا فائدہ ہے جس میں فکر کی جائے، جب وہ مفکر کو کوئی علم عطا کرتی ہے تو وہ اس علم کے مطابق اللہ سے سوال کرتا ہے۔\n\n[شارع (شریعت دینے والے) نے تفکر کا حکم دیا، حالانکہ یہ ایک طبعی صفت ہے، تاکہ یہ عبادت بن جائے اور ایک روحانی مقام ہو]\n\nپس مقامِ فکر اس بات سے تجاوز نہیں کرتا کہ معبود (الإله) میں اس حیثیت سے غور کیا جائے کہ وہ معبود ہے، اور اس میں غور کیا جائے کہ جو الوہیت کی صفت رکھتا ہے وہ کس تعظیم، جلال اور ذاتی محتاجی کا مستحق ہے۔ ان سب کا حکم شرائع کے وجود سے پہلے بھی موجود تھا۔ پھر شریعت اس کی خبر دیتے ہوئے اور حکم دیتے ہوئے آئی۔ شریعت نے اس کا حکم دیا، اگرچہ فطرتِ بشر نے اسے عطا کیا تھا، تاکہ یہ ایک ایسی عبادت بن جائے جس پر اجر دیا جائے۔ کیونکہ جب یہ بندے کے لیے ایک مشروع عمل بن جاتا ہے تو یہ اسے وہ ثمر دیتا ہے جو اسے اس وقت نہیں ملتا جب وہ اس سے صرف اس حیثیت سے متصف ہو کہ یہ مشروع نہیں ہے۔\n\n[فکر کے لیے ذات حق (الحق) میں نہ عقلی طور پر اور نہ شرعی طور پر کوئی حکم یا میدان ہے]\n\nفکر کے لیے ذات حق (الحق) میں نہ عقلی طور پر اور نہ شرعی طور پر کوئی حکم یا میدان ہے۔ کیونکہ شریعت نے ذاتِ اللہ میں تفکر کرنے سے منع کیا ہے۔ اس کی طرف اللہ تعالیٰ کے اس فرمان میں اشارہ ہے:\n**وَيُحَذِّرُكُمُ الله نَفْسَهُ**\n(اور اللہ تمہیں اپنی ذات سے ڈراتا ہے)۔\nیعنی اس میں تفکر نہ کرو۔ اس کی وجہ ذات حق (الحق) اور ذاتِ خلق کے درمیان مناسبت کا ختم ہو جانا ہے۔ اہل اللہ (اللہ والے) جب فکر کے مرتبے کو جان گئے، اور یہ کہ یہ علماءِ رسوم اور صالحین میں سے اہل عبرت کی انتہا ہے، اور یہ کہ یہ چیزوں کے درمیان مناسبتیں عطا کرتا ہے، تو انہوں نے اسے اس کے اہل کے لیے چھوڑ دیا اور اس سے نفرت کی کہ یہ ان کا حال (روحانی کیفیت) بنے، جیسا کہ باب \"ترک الفکر\" میں آئے گا۔\n\n[صاحبِ فکر کس طرح درستگی (الصواب) حاصل کر سکتا ہے جبکہ فکر ایک ایسا حال ہے جو عصمت (معصومیت) عطا نہیں کرتا]\n\nفکر ایک حال ہے جو عصمت (معصومیت) عطا نہیں کرتا، اسی لیے اس کا مقام خطرناک ہے، کیونکہ اس کا حامل نہیں جانتا کہ وہ درستگی (الإصابة) کو پائے گا یا غلطی کرے گا، کیونکہ یہ درستگی اور غلطی دونوں کو قبول کرنے والا ہے۔ پس اگر اس کا حامل چاہتا ہے کہ وہ اللہ کے علم میں زیادہ تر درستگی (الصواب) حاصل کرے، تو اسے چاہیے کہ وہ قرآن میں نازل ہونے والی ہر اس آیت کو تلاش کرے جس میں تفکر اور عبرت کا ذکر ہے، اور وہ اس سے تجاوز نہ کرے جو کتاب یا سنتِ متواترہ میں آیا ہے۔ کیونکہ اللہ نے قرآن میں کسی ایسی چیز کا ذکر نہیں کیا جس میں تفکر کیا جائے، اور اس کے عبرت ہونے پر نص نہ کی ہو، یا اس کے ساتھ تفکر کو نہ جوڑا ہو، مگر یہ کہ اس کے ساتھ درستگی (الإصابة)، حفاظت اور اس مقصد کا حصول لازم ہے جو اللہ نے ارادہ کیا ہے۔ یہ ضروری ہے، کیونکہ ذات حق (الحق) نے اسے اس جگہ خاص طور پر مقرر نہیں کیا مگر اس لیے کہ اس نے بندے کو وہاں اس علم تک پہنچنے کے قابل بنا دیا ہے جس کا اس نے ارادہ کیا تھا۔ پس میں نے آپ کو راستے پر ڈال دیا ہے، اور اہل اللہ نے اسے اسی طرح پایا ہے۔\n\n[ان موضوعات کو لازم پکڑو جنہیں ذات حق (الحق) نے فکر کا میدان بنایا ہے، اور معاملات کو ان کے مراتب سے تجاوز نہ کراؤ، اور آیات کو ان کے مقامات سے نہ ہٹاؤ]\n\nاگر آپ نے تفکر کی آیات سے تجاوز کر کے عقل کی آیات، یا سمع (سماعت) کی آیات، یا علم کی آیات، یا ایمان کی آیات کی طرف گئے اور ان میں فکر کو استعمال کیا تو آپ ایک بھی درستگی (الإصابة) حاصل نہیں کر پائیں گے۔ پس ان آیات کو لازم پکڑو جنہیں ذات حق (الحق) نے ان لوگوں کے لیے مقرر کیا ہے جو تفکر کرتے ہیں، اور معاملات کو ان کے مراتب سے تجاوز نہ کراؤ، اور آیات کو ان کے مقامات سے نہ ہٹاؤ۔ اور اگر آپ نے اس طریقے پر عمل کیا جو میں نے آپ کو بتایا ہے تو آپ اپنی کوشش کی تعریف کریں گے اور میرا شکریہ ادا کریں گے۔ پس ہر اس آیت کو تلاش کریں جس میں عبرت اور تفکر ہو، آپ ان شاء اللہ کامیاب ہوں گے۔ اسی طرح وہ آیات جن میں نظر (غور) کا ذکر ہے، وہ بھی اسی فکری باب سے ہیں، جیسے اللہ تعالیٰ کا فرمان:\n**أَ فَلا يَنْظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ**\n(کیا وہ اونٹوں کو نہیں دیکھتے کہ انہیں کیسے پیدا کیا گیا؟)\nاور جیسے اس کا فرمان:\n**أَ ولَمْ يَنْظُرُوا في مَلَكُوتِ السَّماواتِ والْأَرْضِ**\n(اور کیا انہوں نے آسمانوں اور زمین کے ملکوت میں غور نہیں کیا؟)\nاور اسی طرح:\n**أَ لَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحابِ الْفِيلِ**\n(کیا آپ نے نہیں دیکھا کہ آپ کے رب نے ہاتھی والوں کے ساتھ کیا کیا؟)\nاور اس کا فرمان:\n**أَ لَمْ تَرَ إِلى‏ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ**\n(کیا آپ نے اپنے رب کی طرف نہیں دیکھا کہ اس نے سائے کو کیسے پھیلایا؟) (آیت)\nاور اسی طرح تدبر کی آیات بھی اسی باب سے ہیں، جیسے اس کا فرمان:\n**أَ فَلا يَتَدَبَّرُونَ الْقُرْآنَ**\n(کیا وہ قرآن میں تدبر نہیں کرتے؟)\nاور جب اللہ کسی چیز کا ذکر کرے، تو جس نام سے بھی اس کا ذکر کرے، آپ کا دھیان اسی طرف ہونا چاہیے، اور آپ اس نام کی حیثیت سے اس میں تفکر کرنے سے تجاوز نہ کریں، اگر آپ اللہ کے مقصود معنی کی درستگی (الإصابة) چاہتے ہیں۔ مثال کے طور پر، اس کے فرمان:\n**أَ فَلا يَتَدَبَّرُونَ الْقُرْآنَ**\n(کیا وہ قرآن میں تدبر نہیں کرتے؟)\nتو اس میں اس حیثیت سے غور کریں کہ وہ قرآن ہے، نہ کہ اس حیثیت سے کہ وہ کلام اللہ ہے، اور نہ اس حیثیت سے کہ وہ فرقان ہے، اور نہ اس حیثیت سے کہ وہ ذکر ہے، جیسا کہ اس کے فرمان:\n**إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ**\n(بے شک ہم ہی نے ذکر (قرآن) نازل کیا ہے)۔\n\n[قرآن میں ہر نام کا ایک حکم ہے اور اسے ذکر میں اس لیے متعین کیا گیا تاکہ اس نام سے وہ حکم سمجھا جائے]\n\nپس ہر نام کا ایک حکم ہے، اور ذات حق (الحق) نے اسے ذکر میں صرف اس لیے متعین کیا تاکہ اس کے بندے اسے سمجھیں اور انہیں سکھائے کہ وہ چیزوں کو ان کے مقامات پر کیسے نازل کریں۔ پس یہی حکمت ہے اور اس کا حامل حکیم ہے۔ اور اللہ نے اس شخص کی تعریف کی جسے اس نے حکمت سے شرف بخشا، چنانچہ فرمایا:\n**وَيُعَلِّمُهُ الْكِتابَ والْحِكْمَةَ**\n(اور وہ اسے کتاب اور حکمت سکھاتا ہے)۔\nاور فرمایا:\n**وآتَيْناهُ الْحِكْمَةَ وفَصْلَ الْخِطابِ**\n(اور ہم نے اسے حکمت اور فیصلہ کن بات عطا کی)۔\nاور فرمایا:\n**ومن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْراً كَثِيراً وما يَذَّكَّرُ إِلَّا أُولُوا الْأَلْبابِ‏**\n(اور جسے حکمت دی گئی، اسے بہت زیادہ بھلائی دی گئی، اور نصیحت صرف عقل والے ہی حاصل کرتے ہیں)۔\nکیونکہ اس (حکمت) کا حکم تمام چیزوں میں جاری ہوتا ہے، اور وہ یہ ہے کہ حکیم کسی چیز کو اس کی قدر اور اس کے مقام سے تجاوز نہیں کراتا۔",
    "fa": "(باب صد و چهل و چهارم در معرفت مقام تفکر و اسرار آن)\n\nهمانا تفکر در آیات و عبرت‌ها،\nتفکر در احکام و قضا و قدر نیست.\nهمانا تفکر، حالی است که من آن را نادان نیستم؛\nزیرا خداوند آن را در آیات و سوره‌ها مقرر داشته است.\n\nاگر تفکر نبود، مردم در آسایش بودند،\nو در نعمت، همراه با ارواح بر تخت‌ها (ی بهشتی) بودند.\n\nتفکر صفتی طبیعی است و بر هیچ داننده‌ای\nجز بشر حکمی ندارد.\n\nو اگر آنچه گفتیم نبود،\nچشم من به احوال و صورت‌ها نمی‌نگریست.\n\nبه واسطه آن (تفکر)، مؤثر و اسماء (الهی) قائم هستند،\nو امر را در بادیه و حضر (شهر) نافذ می‌سازند.\n\n[تفکر به معنای عبرت‌گیری، صفتی طبیعی و مختص بشر است]\n\nبدان، خداوند تو را توفیق دهد، که تفکر صفتی الهی نیست، مگر آنکه به معنای تدبیر و تردد در امر نخستین (اولی) باشد؛ در آن صورت صفتی الهی خواهد بود. اما تفکر به معنای عبرت‌گیری (الاعتبار)، صفتی طبیعی است و در هیچ‌یک از مخلوقات جز این صنف بشری وجود ندارد. و این (تفکر) برای اهل عبرت است که به موجودات از آن حیث می‌نگرند که دلالت‌هایی هستند، نه از حیث اعیانشان و نه از حیث آنچه حقایقشان اقتضا می‌کند. خداوند متعال می‌فرماید: «و در آفرینش آسمان‌ها و زمین تفکر می‌کنند» (وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ). پس چون تفکر کردند، آن تفکر به آنان دانشی داد که پیش از آن نداشتند و گفتند: «پروردگارا، این را بیهوده نیافریده‌ای، منزهی تو، پس ما را از عذاب آتش حفظ کن» (رَبَّنَا مَا خَلَقْتَ هَذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ). آنان به پناه بردن به او از عذاب آتش روی نیاوردند، مگر پس از آنکه تفکر در آفرینش آسمان‌ها و زمین به آنان دانشی داد که آتش را به شهود (الشهود) آن علم دیدند. پس از خداوند خواستند که میان آنان و عذاب آتش حائل شود. و فایده هر چیزی که در آن تفکر شود همین است؛ هنگامی که به متفکر دانشی دهد، او از خداوند به اندازه آنچه آن دانش به او می‌دهد، درخواست می‌کند.\n\n[امر شارع به تفکر، در حالی که صفتی طبیعی است، تا عبادت باشد و آن مقامی روحانی است]\n\nمقام تفکر از نظر کردن در ذات الهی از حیث الوهیتش و در آنچه شایسته کسی است که صفت الوهیت دارد، از تعظیم و اجلال و فقر ذاتی به سوی او، فراتر نمی‌رود. حکم این امور همگی پیش از وجود شرایع نیز وجود داشت، سپس شریعت با خبر دادن و امر کردن به آن آمد. پس به آن امر کرد، هرچند فطرت بشر آن را به او داده بود، تا عبادتی باشد که بر آن پاداش داده شود. زیرا هنگامی که عملی مشروع برای بنده باشد، ثمره‌ای برای او دارد که اگر صرفاً به آن متصف شود، بدون آنکه مشروع باشد، آن ثمره را نخواهد داشت.\n\n[تفکر نه عقلاً و نه شرعاً، حکمی و مجالی در ذات حق (الحق) ندارد]\n\nتفکر نه عقلاً و نه شرعاً، حکمی و مجالی در ذات حق (الحق) ندارد، زیرا شریعت از تفکر در ذات خداوند منع کرده است. و اشاره به این مطلب در فرموده اوست: «و خداوند شما را از (ناحیه) خود برحذر می‌دارد» (وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ)؛ یعنی در آن تفکر نکنید. و سبب آن، از میان رفتن تناسب (المناسبة) میان ذات حق (الحق) و ذات خلق است. و اهل الله (عرفا)، چون مرتبه تفکر را دانستند و اینکه نهایت کار علمای رسوم و اهل عبرت از صالحین است و اینکه تفکر تناسبات میان اشیاء را به دست می‌دهد، آن را به اهلش واگذاشتند و از اینکه تفکر حالی برای آنان باشد، ابا کردند، چنانکه در باب ترک تفکر خواهد آمد.\n\n[چگونه صاحب تفکر به صواب دست یابد، در حالی که تفکر حالی است که عصمت نمی‌دهد]\n\nتفکر حالی است که عصمت نمی‌دهد و به همین دلیل مقام آن خطرناک است، زیرا صاحبش نمی‌داند که آیا به صواب می‌رسد یا خطا می‌کند، چون قابلیت اصابت و خطا را دارد. پس اگر صاحب آن بخواهد غالباً در علم به خداوند به صواب دست یابد، باید هر آیه‌ای را که در قرآن نازل شده و در آن ذکر تفکر و عبرت آمده است، جستجو کند و از آنچه در غیر کتاب و سنت متواتر آمده است، فراتر نرود. زیرا خداوند در قرآن امری را که باید در آن تفکر شود، ذکر نکرده و بر وجود عبرت در آن تصریح ننموده یا تفکر را با آن همراه نساخته است، مگر آنکه صواب و حفظ و حصول مقصود الهی حتماً با آن همراه است. زیرا حق (الحق) آن را در این موضع خاص، نه جای دیگر، نصب و اختصاص نداده است، مگر آنکه بنده را قادر ساخته تا به علم آنچه در آنجا قصد شده است، دست یابد. من تو را بر سر راه قرار دادم و اهل الله (عرفا) نیز این‌گونه آن را یافته‌اند.\n\n[به موضوعاتی که حق (الحق) آن‌ها را میدان تفکر قرار داده است، ملتزم باش و امور را از مراتبشان فراتر مبر و آیات را به غیر منازلشان متمایل مساز]\n\nاگر از آیات تفکر به آیات عقل یا آیات سمع یا آیات علم یا آیات ایمان فراتر روی و تفکر را در آن‌ها به کار ببری، حتی یک جمله هم به صواب نخواهی رسید. پس به آیاتی که حق (الحق) برای قومی که تفکر می‌کنند، نصب کرده است، ملتزم باش و امور را از مراتبشان فراتر مبر و آیات را به غیر منازلشان متمایل مساز. و اگر بر اساس آنچه به تو گفتم سلوک کنی، تلاشت را ستایش خواهی کرد و از من سپاسگزار خواهی بود. پس هر آیه عبرت و تفکر را جستجو کن تا ان‌شاءالله سعادتمند شوی. و همچنین آیاتی که در آن‌ها نظر (نگریستن) آمده است، از این باب فکری هستند، مانند فرموده خداوند متعال: «آیا به شتر نمی‌نگرند که چگونه آفریده شده است؟» (أَفَلَا يَنظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ). و مانند فرموده او: «آیا در ملکوت آسمان‌ها و زمین نظر نکرده‌اند؟» (أَوَلَمْ يَنظُرُوا فِي مَلَكُوتِ السَّمَاوَاتِ وَالْأَرْضِ). و همچنین: «آیا ندیدی پروردگارت با اصحاب فیل چه کرد؟» (أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ). و فرموده او: «آیا به پروردگارت ننگریستی که چگونه سایه را گسترانید؟» (أَلَمْ تَرَ إِلَى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ) تا آخر آیه. و همچنین آیات تدبر از این باب هستند، مانند فرموده او: «آیا در قرآن تدبر نمی‌کنند؟» (أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ). و اگر خداوند چیزی از این امور را با هر نامی که ذکر کرد، توجه داشته باش که اگر قصد رسیدن به معنای مقصود الهی را داری، تفکر در آن را از حیث آن نام فراتر نبری. مانند فرموده او: «آیا در قرآن تدبر نمی‌کنند؟» (أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ)؛ پس در آن از حیث اینکه قرآن است بنگر، نه از حیث اینکه کلام خداست، نه از حیث اینکه فرقان است و نه از حیث اینکه ذکر است، از قبیل فرموده او: «همانا ما خود ذکر را نازل کردیم» (إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ).\n\n[هر اسمی در قرآن حکمی دارد و تعیین آن در ذکر برای آن است که آن حکم از آن اسم فهمیده شود]\n\nپس هر اسمی حکمی دارد و حق (الحق) آن را در ذکر تعیین نکرده است، مگر برای اینکه بندگانش آن را بفهمند و به آنان بیاموزد که چگونه اشیاء را در منازل خود قرار دهند؛ این همان حکمت است و صاحب آن، حکیم است. و خداوند کسی را که به حکمت شرافت بخشیده، ستوده و فرموده است: «و کتاب و حکمت را به او می‌آموزد» (وَيُعَلِّمُهُ الْكِتَابَ وَالْحِكْمَةَ). و فرموده است: «و به او حکمت و فصل الخطاب (داوری قاطع) دادیم» (وَآتَيْنَاهُ الْحِكْمَةَ وَفَصْلَ الْخِطَابِ). و فرموده است: «و به هر کس حکمت داده شود، خیر فراوانی به او داده شده است؛ و جز خردمندان (اولوا الألباب) متذکر نمی‌شوند» (وَمَن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْرًا كَثِيرًا وَمَا يَذَّكَّرُ إِلَّا أُولُو الْأَلْبَابِ). زیرا حکم آن (حکمت) در همه اشیاء جاری است و آن این است که حکیم شیء را از قدر و منزلتش فراتر نمی‌برد."
  },
  "page_count": 3
}