{
  "id": 434,
  "title": {
    "ar": "الباب الرابع والثلاثون وأربعمائة في معرفة منازلة لا يحجبنك لو شئت فإني لا أشاء بعد فأثبت",
    "en": "Chapter 434: Concerning the Gnosis of the Spiritual Station (منازلة): \"Do not let them veil you if you willed, for I do not will subsequently, so be steadfast.\"",
    "ur": "باب چار سو چونتیس (۴۳۴) اس روحانی مقام کی معرفت میں کہ وہ تمہیں حجاب میں نہ ڈال دے، اگر تم چاہو تو میں اس کے بعد نہیں چاہتا، پس ثابت قدم رہو۔",
    "fa": "باب چهارصد و سی و چهارم: در معرفت منزلتی که تو را محجوب نسازند، اگر بخواهی، پس من دیگر نمی‌خواهم، پس ثابت‌قدم باش."
  },
  "content": {
    "ar": "## «الباب الرابع والثلاثون وأربعمائة في معرفة منازلة لا يحجبنك لو شئت فإني لا أشاء بعد فأثبت»\n\n\n> إن المشيئة عرش الذات ليس لها *** في غيرها نسبة تبدو ولا أثر\n\n\n> وهي الوجود فلا عين تغايرها *** تفني وتعدم لا تُبْقِي ولا تَذَرُ\n\n\n> عزت فليس يرى سلطانها ملك *** وليس يدركها في الصورة البشر\n\n\n> بكون آدم مخصوصا بصورته *** لأن فيه جميع الكون مختصر\n\n\n> له المقاليد في الأكوان أجمعها *** له التنزل والآيات والسور\n\n\n> فمن تنزله أن قال ندركه *** في صورة هي شمس الحق أو قمر\n\n\n> مع التنزه عن تشبيه خالقنا *** وقد حوته بما قد قاله الصور\n\n\nقال الله عز وجل ما يُبَدَّلُ الْقَوْلُ لَدَيَّ وإن عارضته المشيئة وما في النسب أعجب منها لاستصحاب لو لها ولو لها أثر ما لها أثر فهو حرف عجيب‏\n\n\n### [اختصاص آدم بالخلافة ليست إلا بالمشيئة]\n\n\nاعلم أنه ما اختص آدم بالخلافة إلا بالمشيئة ولو شاء جعلها فيمن جعلها من خلقه قلنا لا يصح أن تكون إلا في مسمى الإنسان الكامل ولو جمعها في غير الإنسان من المخلوقات لكان ذلك الجامع عين الإنسان الكامل فهو الخليفة التي خلق عليها فإن قلت فالعالم كله إنسان كبير فكان يكفي قلنا سبيل فإنه لو كان هو عين الخليفة لم يكن ثم على من فلا بد من واحد جامع صور العالم وصورة الحق يكون لهذه الجمعية خليفة في العالم من أجل الاسم الظاهر يعبر عن ذلك الإمام بالإنسان الكبير القدر الجامع الصورتين فبعض العالم أكبر من بعض الإنسان لا بالمجموع فإنه في الإنسان الكامل ما ليس في الواحد الواحد من العالم فما هو بالمشيئة إلا في النوع الإنساني لكون هذا النوع فيه خلفاء ثم عم تأثيره في الجميع فيطلب من الحق أن يمده فيمده وهذا أثر في الصورة الحقية ويطلب أيضا الأمر في العالم فيمضي ثم إنه مؤثر فيه من العالم ومن الحق فاختلط الأمر والتبس على أهل الله فطلب بعض العارفين الخروج من هذا الالتباس فاطلعه الله على صورة الأمر فرأى ما لا يمكن التلفظ به إلا لرسول قد عصم فكن أنت ذلك الطالب حتى ترى ما رأيت فتقول كما قلنا\n\n\n> ملكتني ملك كسرى إذ تملك كن *** كوني فكنت بكن ملكا ولم أكن‏\n\n\n> لكنني كنت كن والكون مملكة *** وكل كون لكم فالكون لم يكن‏\nوهو قوله وما أَمْرُنا إِلَّا واحِدَةٌ ثم شبه الإمضاء بلمح الْبَصَرِ أَوْ هُوَ أَقْرَبُ وكذلك هو أقرب فانظر حكمة الله تعالى في هذا التشبيه وما حوته تلك اللمحة من الكثرة في الوحدة فعندها تعرف ما هو الأمر فأثبت ولا تفشه تكن من الأمناء الأخفياء الأبرياء\n\n\n### [العلم والمشيئة ثابتان لله تعالى‏]\n\n\nواعلم أن قوله تعالى لَوْ شاءَ الله ولَوْ عَلِمَ الله فِيهِمْ خَيْراً لَأَسْمَعَهُمْ يقتضي نفي العلم بكذا ونفي المشيئة عن الحق كما يقتضي قوله قَدْ يَعْلَمُ الله الَّذِينَ يَتَسَلَّلُونَ مِنْكُمْ لِواذاً وقوله يُرِيدُ الله بِكُمُ فأثبت العلم والمشيئة معا لله وعلم الله لا يخلو من أحد أمرين وكذلك إرادته إما أن تكون صفة له قائمة به زائدة على ذاته وإن كان مثبتو الصفات يقولون لا هي هو ولا هي غيره ولكن لا بد أن يقولوا بأنها زائدة كما يعتقده الأشعري أو تكون عين ذاته إلا أن لها نسبة خاصة لأمر ما تسمى بتلك النسبة علما وهكذا سائر ما تسمى به مما يطلبه تعالى فما أثبت ولا نفي إلا تعلق العلم والإرادة ولكن ما ورد الكلام إلا بنفي العلم بأمر ما والإرادة فتعلم قطعا إن نفي العلم علم وأن العلم تابع للمعلوم يصير معه حيث صار ويتعلق به على ما هو عليه في نفسه وذاته لا ينتفي عنها الوجود ولا كل ما ثبت له القدم من صفة وغيرها فما بقي أن ينتفي إلا التعلق الخاص وهو أمر يحدث أو نسبة كيف شئت فقل ولا يتوجه النفي والإثبات إلا على حادث أي على ممكن‏\n\n\nسواء كان ذلك الحكم موصوفا بالوجود أو بالعدم فناب العلم هنا مناب التعلق حين نفيته بأداة لو في قوله لَوْ عَلِمَ ولَوْ شاءَ فما علم وما شاء هذا هو الأمر الحادث المعين فقد علم أنه لو علم ولا يقال أنه قد شاء أن يقول لو شاء فإن المشيئة متعلقها العدم ولا يصح أن يحدث القول في ذات الله فإنه ليس بمحل للحوادث فلا يقال قد شاء أن يقول والتحقيق أنه ما أراد من المراد إلا ما هو المراد عليه من الاستعداد في حال العدم أن يكون به في حال الوجود أو يتصف به عند انتفائه عن الوجود أو انتفاء حكم الوجود عنه كيف شئت فقل ولما بان الفرقان بين المشيئة والعلم علمنا أنهما نسبتان لذات العالم والمريد أو صفتان في مذهب من يقول بالصفات من المتكلمين ولو لا علمنا بالأصل الذي هون علينا سماع مثل هذا لكانت الحيرة في الله أشد والأصل ما هو إلا أن الله تعالى ما أرسل رسولا إِلَّا بِلِسانِ قَوْمِهِ لأنه يريد إفهامهم فمن المحال أن يخرج في خطابه إياهم عما تواطئوا عليه في لسانهم فوجد العاقل في ذلك راحة وأما أهل الشهود فلا راحة عندهم في ذلك لما رأوه من اختلاف الصور على المشهود فما هم مثل أهل اللسان وجاءت الطبقة العليا فقالت علمنا أن الشهود تابع للاعتقاد كما إن الخطاب تابع لما تواطأ عليه أهل ذلك اللسان فهان عليهم الأمر فرأوه في كل معتقد كما فهموه في كل لسان فما حاروا واهتدوا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Thirty-Four: Concerning the Knowledge of its Station: \"Let it not veil you if you willed, for I do not will subsequently, so be firm.\"\n\nIndeed, the Will (المشيئة) is the Throne of the Essence (الذات); it has no relation or trace appearing in anything other than itself.\nIt is Existence (الوجود), so no entity (عين) is distinct from it; it annihilates and brings to naught, neither leaving nor sparing.\nIt is mighty, so no king sees its dominion, nor does humanity grasp it in the form.\nBy Adam being distinguished by His Form, because in him the entire Cosmos (الكون) is summarized.\nTo him belong the keys (المقاليد) of all the universes (الأكوان); to him belong the descent (التنزل), the signs, and the chapters.\nPart of his descent is that He said, \"We perceive Him in a form that is the Sun of the Real (الحق) or the Moon.\"\nAlong with the transcendence (التنزه) from likening our Creator, yet the forms (الصور) have contained Him by what He has said.\n\nAllah, the Mighty and Majestic, said: <<مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ>> (The word is not changed with Me), even if the Will (المشيئة) contradicts it. Nothing in the relations is stranger than the Will due to its association with \"if\" (لو). And if \"if\" had an effect, it would have no effect. It is a wondrous particle.\n\n### [Adam's Specialization in Vicegerency is Only by the Will]\n\nKnow that Adam was not specialized in the Vicegerency (الخلافة) except by the Will (المشيئة). Had He willed, He would have placed it in whomever He willed among His creation. We say: It is not valid for it to be except in the designation of the Perfect Human (الإنسان الكامل). Even if He gathered it in something other than humanity among the creatures, that comprehensive entity would be the very essence (عين) of the Perfect Human. So he is the Vicegerent upon whom he was created.\n\nIf you say, \"The entire World (العالم) is a Great Human, so that would suffice,\" we say, \"Go ahead.\" For if it were the very essence of the Vicegerent, there would be no one above whom to be Vicegerent. Thus, there must be one who comprehensively unites the forms of the World and the Form of the Real (الحق). He becomes, by virtue of this comprehensiveness (الجمعية), the Vicegerent in the World because of the Manifest Name (الاسم الظاهر). The Imam expresses this by calling him the Great Human (الإنسان الكبير) who possesses the capacity to unite the two Forms.\n\nThus, some parts of the World are greater than some parts of humanity, but not greater than the totality. For in the Perfect Human (الإنسان الكامل) is what is not found in any single individual part of the World. Therefore, by the Will (المشيئة), it is only in the human species (النوع الإنساني), because this species contains Vicegerents. Then his influence spreads throughout all. So he seeks aid from the Real (الحق), and He aids him. This is an effect in the Form of the Real (الصورة الحقية). He also seeks the command in the World, and it proceeds. Then he is influenced by the World and by the Real.\n\nSo the matter became mixed and confused for the People of Allah (أهل الله). Some of the Gnostics (العارفين) sought to exit this confusion, and Allah informed him of the form of the matter. And he saw what cannot be uttered except by an infallible Messenger (رسول قد عصم). So be you that seeker until you see what I have seen, and then you will say as we have said:\n\nYou possessed me with the kingdom of Khosrau when \"Be\" (كن) took possession;\nMy being was, so I was a king by \"Be,\" yet I was not.\nBut I was \"Be,\" and the cosmos was a kingdom,\nAnd every cosmos belongs to you, so the cosmos was not.\n\nAnd this is His saying: <<وَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ>> (And Our command is but a single [word]). Then He likened the execution to the twinkling of the eye (لمح الْبَصَرِ) or it is nearer (أَوْ هُوَ أَقْرَبُ). And thus it is nearer. So look at the wisdom of Allah the Exalted in this simile, and what that twinkling contains of Multiplicity (الكثرة) within Unity (الوحدة). Then you will know what the Command (الأمر) is. So be firm and do not disclose it, and you will be among the trustworthy, the hidden, the innocent.\n\n### [Knowledge and Will are Established for Allah the Exalted]\n\nKnow that His saying, the Exalted: <<لَوْ شَاءَ اللَّهُ>> (Had Allah willed) and <<وَلَوْ عَلِمَ اللَّهُ فِيهِمْ خَيْرًا لَّأَسْمَعَهُمْ>> (And had Allah known any good in them, He would have made them hear) implies the negation of Knowledge (العلم) concerning a certain thing and the negation of the Will (المشيئة) from the Real (الحق). Just as His saying <<قَدْ يَعْلَمُ اللَّهُ الَّذِينَ يَتَسَلَّلُونَ مِنكُمْ لِوَاذًا>> (Allah certainly knows those who slip away among you, concealing themselves) and His saying <<يُرِيدُ اللَّهُ بِكُمُ>> (Allah desires for you) implies [the affirmation]. So affirm Knowledge and Will together for Allah.\n\nAnd Allah's Knowledge is not devoid of one of two matters, and likewise His Will (إرادته). Either it is an Attribute (صفة) subsisting in Him, additional to His Essence (ذاته)—even though those who affirm the Attributes say, \"It is neither He nor other than He,\" they must still say that it is additional, as the Ash'ari school believes—or it is the very essence (عين) of His Essence, except that it has a specific relation (نسبة خاصة) to a certain matter, and by that relation, it is called Knowledge. And similarly for all that He is named with, which the Exalted demands.\n\nThus, nothing is affirmed or negated except the connection (تعلق) of Knowledge and Will. But the discourse only came concerning the negation of Knowledge regarding a certain matter and the Will. So know definitively that the negation of Knowledge is [itself] Knowledge, and that Knowledge is dependent upon the object of knowledge (المعلوم), moving with it wherever it goes, and it relates to it according to what it is in itself and its essence (ذاته). Existence (الوجود) is not negated from it, nor is everything that is eternally established for it, whether Attribute or otherwise. So nothing remains to be negated except the specific connection (التعلق الخاص), which is a matter that occurs or a relation—say what you will. And negation and affirmation are only directed toward what is originated (حادث), meaning toward what is possible (ممكن), whether that ruling is described by Existence or by non-existence.\n\nThus, Knowledge here substitutes for the connection when you negate it using the particle \"if\" (لو) in His saying <<لَوْ عَلِمَ>> (Had He known) and <<لَوْ شَاءَ>> (Had He willed). So He did not know and He did not will—this is the specific originated matter. For He certainly knew that had He known. And it is not said that He willed to say \"Had He willed.\" For the object of the Will is non-existence (العدم), and it is not valid for speech to originate in the Essence of Allah, for He is not a locus for originated things (محل للحوادث). So it is not said, \"He willed to say.\"\n\nThe verification is that He only willed of the willed object (المراد) what that object was prepared for (الاستعداد) in the state of non-existence to be in the state of Existence, or to be described by it when it is negated from Existence, or when the ruling of Existence is negated from it—say what you will.\n\nAnd when the distinction (الفرقان) between the Will and Knowledge became clear, we knew that they are two relations to the Essence of the Knower and the Willer, or two Attributes according to the doctrine of the theologians who affirm Attributes. Were it not for our knowledge of the fundamental principle (الأصل) that made hearing such things easy for us, the perplexity (الحيرة) concerning Allah would be more severe. And the fundamental principle is none other than that Allah the Exalted did not send any Messenger <<إِلَّا بِلِسَانِ قَوْمِهِ>> (except with the language of his people), because He desires to make them understand. Thus, it is impossible for Him to depart in His address to them from what they have agreed upon in their language. So the rational person finds comfort in that.\n\nAs for the People of Witnessing (أهل الشهود), they find no comfort in that, due to the variation of forms they see upon the object of witnessing (المشهود). So they are not like the people of language. Then the highest stratum came and said: \"We know that Witnessing is dependent upon belief (الاعتقاد), just as the discourse is dependent upon what the people of that language have agreed upon.\" So the matter became easy for them, and they saw it in every belief just as they understood it in every language. Thus, they were not perplexed, but were guided. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (says the truth, and He guides to the way).",
    "ur": "باب نمبر چار سو چونتیس: اس کے مقام کی معرفت میں کہ اگر تو چاہے تو تجھے حجاب میں نہ ڈالے، کیونکہ میں اس کے بعد نہیں چاہتا، پس ثابت قدم رہ۔\n\nمشیئت (Al-Mashī’ah) ذات کا عرش ہے، اس کے لیے\nاپنے غیر میں نہ کوئی نسبت ظاہر ہوتی ہے اور نہ کوئی اثر۔\n\nاور وہ (مشیئت) ہی الوجود (ہستی) ہے، پس کوئی ایسی عین نہیں جو اس سے مختلف ہو\nجو فنا کر دیتی ہے اور معدوم کر دیتی ہے، نہ باقی رکھتی ہے اور نہ چھوڑتی ہے۔\n\nوہ عزت والی ہے، پس کوئی فرشتہ اس کی سلطنت کو نہیں دیکھتا\nاور نہ ہی بشر اسے صورت میں پا سکتا ہے۔\n\nسوائے اس کے کہ آدم اپنی صورت کے ساتھ مخصوص ہے\nکیونکہ اس میں تمام کائنات مختصر ہے۔\n\nتمام کائناتوں کی کنجیاں اسی کے لیے ہیں\nاسی کے لیے تنزل، آیات اور سورتیں ہیں۔\n\nپس اس کے تنزل میں سے یہ ہے کہ اس نے کہا: ہم اسے پاتے ہیں\nاس صورت میں جو ذات حق (Al-Ḥaqq) کا سورج ہے یا چاند ہے۔\n\nاپنے خالق کو تشبیہ دینے سے پاکیزگی کے ساتھ\nاور صورتوں نے اسے اس چیز کے ساتھ گھیر لیا ہے جو اس نے کہا ہے۔\n\nاللہ عزوجل نے فرمایا: \"میرے ہاں بات بدلی نہیں جاتی\" (مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ)۔ اگرچہ مشیئت (Al-Mashī’ah) اس کی مخالفت کرے، اور نسبتوں میں اس سے زیادہ عجیب کوئی چیز نہیں کیونکہ \"لو\" (اگر) اس کے ساتھ رہتی ہے، اور اگرچہ اس کا اثر ہے لیکن اس کا کوئی اثر نہیں، پس یہ ایک عجیب حرف ہے۔\n\n### [آدم کا خلافت کے ساتھ مخصوص ہونا صرف مشیئت (Al-Mashī’ah) کے سبب ہے]\n\nجان لو کہ آدم (علیہ السلام) کو خلافت (Al-Khilāfah) کے ساتھ صرف مشیئت (Al-Mashī’ah) کے ذریعے ہی مخصوص کیا گیا ہے۔ اگر وہ چاہتا تو اسے اپنی مخلوق میں سے کسی اور میں بھی رکھ دیتا۔ ہم کہیں گے: یہ درست نہیں کہ خلافت انسان کامل (Al-Insān al-Kāmil) کے مسمیٰ کے علاوہ کسی اور میں ہو۔ اور اگر وہ اسے مخلوقات میں سے انسان کے علاوہ کسی اور میں جمع کر دیتا، تو وہ جامع ہی عین انسان کامل (Al-Insān al-Kāmil) ہوتا۔ پس وہی خلیفہ ہے جس پر اسے تخلیق کیا گیا۔ اگر تم کہو کہ پوری کائنات ایک بڑا انسان ہے، تو کیا یہ کافی نہیں تھا؟ ہم کہیں گے: یہ ایک راستہ ہے، کیونکہ اگر وہ (کائنات) عین خلیفہ ہوتی تو پھر اس پر کوئی \"علیٰ من\" (جس پر خلافت ہو) نہ ہوتا۔ لہٰذا، ایک ایسے جامع کا ہونا ضروری ہے جو عالم کی صورتوں اور ذات حق (Al-Ḥaqq) کی صورت کو جمع کرتا ہو، تاکہ وہ اس جامعیت کی وجہ سے عالم میں خلیفہ ہو، اسم الظاہر کی خاطر۔ امام اس کا اظہار انسان کبیر (بڑے انسان) کے ذریعے کرتے ہیں جو دونوں صورتوں کو جمع کرنے والا ہے۔ عالم کا بعض حصہ انسان کے بعض حصے سے بڑا ہے، لیکن مجموعی طور پر نہیں۔ کیونکہ انسان کامل (Al-Insān al-Kāmil) میں وہ کچھ ہے جو عالم کے ایک ایک فرد میں نہیں ہے۔ پس مشیئت (Al-Mashī’ah) کے ذریعے یہ (خلافت) صرف نوع انسانی میں ہے، کیونکہ اس نوع میں خلفاء موجود ہیں۔ پھر اس کا اثر سب میں عام ہو جاتا ہے، پس وہ ذات حق (Al-Ḥaqq) سے مدد طلب کرتا ہے، اور وہ اسے مدد دیتا ہے۔ اور یہ صورت حقّیہ میں ایک اثر ہے۔ اور وہ عالم میں بھی امر طلب کرتا ہے، تو وہ نافذ ہو جاتا ہے۔ پھر وہ عالم کی طرف سے بھی اور ذات حق (Al-Ḥaqq) کی طرف سے بھی اس میں مؤثر ہوتا ہے۔ پس یہ معاملہ اہل اللہ پر خلط ملط ہو گیا اور الجھ گیا۔ چنانچہ بعض عارفین نے اس الجھن سے نکلنے کی کوشش کی، تو اللہ نے انہیں امر کی صورت پر مطلع کر دیا۔ پس انہوں نے وہ کچھ دیکھا جس کا اظہار صرف ایک معصوم رسول ہی کر سکتا ہے۔ پس تم بھی وہی طالب بن جاؤ تاکہ تم وہ دیکھو جو میں نے دیکھا، اور پھر تم وہی کہو جو ہم نے کہا:\n\nمجھے کسریٰ کی بادشاہت کا مالک بنا دیا جب \"کن\" نے ملکیت حاصل کی\nمیرے وجود کی، پس میں \"کن\" کے ذریعے بادشاہ بنا حالانکہ میں نہیں تھا۔\n\nلیکن میں \"کن\" تھا اور کائنات مملکت تھی\nاور ہر کائنات تمہارے لیے ہے، پس کائنات نہیں تھی۔\n\nاور یہ اس کا قول ہے: \"اور ہمارا حکم تو بس ایک ہی ہوتا ہے\" (وَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ)۔ پھر اس نے نفاذ کو \"پلک جھپکنے\" (لَمْحِ الْبَصَرِ) یا \"اس سے بھی قریب\" (أَوْ هُوَ أَقْرَبُ) سے تشبیہ دی ہے۔ اور وہ اسی طرح قریب تر ہے۔ پس اللہ تعالیٰ کی حکمت کو اس تشبیہ میں دیکھو، اور اس کثرت کو دیکھو جو اس ایک لمحے نے وحدت میں سمیٹ رکھی ہے۔ تب تم جانو گے کہ امر کیا ہے، پس ثابت قدم رہو اور اسے فاش نہ کرو، تاکہ تم امانت داروں، پوشیدہ رہنے والوں اور نیک لوگوں میں سے ہو جاؤ۔\n\n### [علم (Al-’Ilm) اور مشیئت (Al-Mashī’ah) اللہ تعالیٰ کے لیے ثابت ہیں]\n\nاور جان لو کہ اللہ تعالیٰ کا یہ قول: \"اگر اللہ چاہتا\" (لَوْ شَاءَ اللَّهُ) اور \"اگر اللہ ان میں کوئی بھلائی جانتا تو انہیں ضرور سناتا\" (وَلَوْ عَلِمَ اللَّهُ فِيهِمْ خَيْرًا لَأَسْمَعَهُمْ)۔ یہ کسی خاص چیز کے علم (Al-’Ilm) کی نفی اور ذات حق (Al-Ḥaqq) سے مشیئت (Al-Mashī’ah) کی نفی کا تقاضا کرتا ہے، جیسا کہ اس کا یہ قول تقاضا کرتا ہے: \"اللہ ان لوگوں کو خوب جانتا ہے جو تم میں سے چھپ کر نکل جاتے ہیں\" (قَدْ يَعْلَمُ اللَّهُ الَّذِينَ يَتَسَلَّلُونَ مِنْكُمْ لِوَاذًا) اور اس کا قول: \"اللہ تمہارے ساتھ ارادہ کرتا ہے\" (يُرِيدُ اللَّهُ بِكُمُ)۔\n\nپس علم (Al-’Ilm) اور مشیئت (Al-Mashī’ah) دونوں کو اللہ کے لیے ثابت کرو۔ اور اللہ کا علم دو باتوں میں سے کسی ایک سے خالی نہیں، اور اسی طرح اس کا ارادہ (Al-Irādah) بھی۔ یا تو وہ اس کی ایک صفت ہو جو اس کے ساتھ قائم ہو اور اس کی ذات پر زائد ہو (اگرچہ صفات کو ثابت کرنے والے کہتے ہیں کہ وہ نہ تو وہ ہے اور نہ ہی اس کا غیر، لیکن انہیں یہ ضرور کہنا پڑتا ہے کہ وہ زائد ہے جیسا کہ اشعری کا عقیدہ ہے)۔ یا وہ عین ذات ہو، مگر کسی خاص امر کی وجہ سے اس کی ایک خاص نسبت ہو جسے اس نسبت کے سبب علم (Al-’Ilm) کہا جاتا ہے۔ اور اسی طرح وہ تمام چیزیں جن سے وہ مسمیٰ ہوتا ہے اور جن کا وہ تقاضا کرتا ہے۔\n\nپس نہ تو علم (Al-’Ilm) اور ارادہ (Al-Irādah) کے تعلق (Al-Ta’alluq) کے علاوہ کچھ ثابت کیا گیا اور نہ ہی نفی کیا گیا۔ لیکن کلام میں کسی خاص امر کے علم (Al-’Ilm) اور ارادہ (Al-Irādah) کی نفی ہی وارد ہوئی ہے۔ پس تم یقیناً جان لو کہ علم کی نفی بھی علم ہے، اور یہ کہ علم معلوم کے تابع ہے، جہاں وہ جاتا ہے علم بھی اس کے ساتھ ہو جاتا ہے، اور اس سے اسی طرح متعلق ہوتا ہے جیسا کہ وہ اپنی ذات اور نفس میں ہے۔ اس (ذات) سے نہ تو الوجود (ہستی) کی نفی ہوتی ہے اور نہ ہی ہر اس چیز کی جو اس کے لیے قدیم ثابت ہے، خواہ وہ صفت ہو یا کوئی اور چیز۔ پس نفی ہونے کے لیے صرف خاص تعلق (Al-Ta’alluq) باقی بچتا ہے، اور وہ ایک امر ہے جو حادث ہوتا ہے، یا ایک نسبت ہے، تم جیسے چاہو کہہ لو۔ اور نفی اور اثبات کا رخ صرف حادث کی طرف ہوتا ہے، یعنی ممکن کی طرف۔\n\nخواہ وہ حکم وجود (Al-Wujūd) کے ساتھ موصوف ہو یا عدم کے ساتھ۔ پس یہاں علم (Al-’Ilm) نے تعلق (Al-Ta’alluq) کی جگہ لے لی جب تم نے اسے \"لو\" (اگر) کے ذریعے نفی کیا، اس کے قول \"اگر وہ جانتا\" (لَوْ عَلِمَ) اور \"اگر وہ چاہتا\" (لَوْ شَاءَ) میں۔ پس اس نے نہ جانا اور نہ چاہا، اور یہی وہ معین حادث امر ہے۔ پس یہ معلوم ہو گیا کہ اگر وہ جانتا۔ اور یہ نہیں کہا جائے گا کہ اس نے چاہا کہ وہ \"اگر وہ چاہتا\" کہے۔ کیونکہ مشیئت (Al-Mashī’ah) کا تعلق عدم سے ہے۔ اور اللہ کی ذات میں قول کا حادث ہونا درست نہیں، کیونکہ وہ حوادث کا محل نہیں ہے۔ لہٰذا یہ نہیں کہا جائے گا کہ اس نے چاہا کہ وہ کہے۔ اور تحقیق یہ ہے کہ اس نے مراد سے صرف وہی چاہا جو مراد پر عدم کی حالت میں استعداد کی صورت میں تھا کہ وہ وجود (Al-Wujūd) کی حالت میں اس کے ساتھ ہو، یا وجود سے اس کے منتفی ہونے پر یا وجود کے حکم کے اس سے منتفی ہونے پر اس کے ساتھ متصف ہو، تم جیسے چاہو کہہ لو۔\n\nاور جب مشیئت (Al-Mashī’ah) اور علم (Al-’Ilm) کے درمیان فرق واضح ہو گیا، تو ہم نے جان لیا کہ وہ عالم اور مرید کی ذات کے لیے دو نسبتیں ہیں، یا متکلمین میں سے صفات کے قائلین کے مذہب میں دو صفات ہیں۔ اور اگر ہمیں اس اصل کا علم نہ ہوتا جس نے ہم پر ایسی باتیں سننا آسان کر دیا، تو اللہ کے بارے میں حیرت زیادہ شدید ہوتی۔ اور وہ اصل یہ ہے کہ اللہ تعالیٰ نے کوئی رسول نہیں بھیجا \"مگر اس کی قوم کی زبان میں\" (إِلَّا بِلِسَانِ قَوْمِهِ)، کیونکہ وہ انہیں سمجھانا چاہتا ہے۔ پس یہ محال ہے کہ وہ ان سے خطاب کرنے میں اس چیز سے باہر نکلے جس پر وہ اپنی زبان میں متفق ہیں۔ پس عاقل نے اس میں راحت پائی۔\n\nلیکن اہل شہود (Al-Shuhūd) کے نزدیک اس میں کوئی راحت نہیں، کیونکہ انہوں نے مشہود پر صورتوں کا اختلاف دیکھا ہے۔ پس وہ اہل لسان (زبان والوں) کی طرح نہیں ہیں۔ اور اعلیٰ طبقہ آیا اور کہا: ہم نے جان لیا کہ شہود (Al-Shuhūd) اعتقاد کے تابع ہے، جیسا کہ خطاب اس چیز کے تابع ہے جس پر اس زبان کے لوگ متفق ہوئے ہیں۔ پس ان پر معاملہ آسان ہو گیا، اور انہوں نے اسے ہر اعتقاد میں اسی طرح دیکھا جیسا کہ انہوں نے اسے ہر زبان میں سمجھا۔ پس وہ حیران نہیں ہوئے اور ہدایت پا گئے۔ اور \"اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و سی و چهارم در معرفت منزلتی که اگر بخواهی تو را محجوب نمی‌کند، زیرا من پس از آن نمی‌خواهم، پس ثابت قدم باش.\n\nهمانا مشیئت (المشيئة) عرش ذات است و برای آن در غیر خود، نه نسبتی آشکار است و نه اثری.\nو آن (مشیئت) همان هستی (الوجود) است، پس هیچ عینی با آن مغایرت ندارد؛ نابود می‌کند و معدوم می‌سازد، نه باقی می‌گذارد و نه رها می‌کند.\nعزت یافت، پس هیچ پادشاهی سلطنت آن را نمی‌بیند، و بشر در صورت (ظاهری) آن را درک نمی‌کند.\nبه واسطه آنکه آدم به صورت او (حق) اختصاص یافته است، زیرا تمام کائنات (الکون) در او خلاصه شده است.\nکلیدهای تمام عوالم (الأكوان) از آن اوست، تنزل و آیات و سوره‌ها از آن اوست.\nپس از تنزل او این است که گفت: او را در صورتی درمی‌یابیم که خورشید حق (الحق) یا ماه باشد.\nبا وجود تنزه خالق ما از تشبیه، صور (ظاهری) او را در بر گرفته است، به آنچه گفته است.\n\nخداوند عز و جل فرمود: «سخن نزد من دگرگون نمی‌شود» (مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ) و اگرچه مشیئت (المشيئة) با آن معارضه کند. و در نسبت‌ها چیزی شگفت‌تر از آن نیست، به دلیل همراهی \"لو\" (اگر) با آن. و اگر \"لو\" اثری داشت، اثری نداشت. پس آن حرفی شگفت است.\n\n### [اختصاص آدم به خلافت تنها به مشیئت است]\n\nبدان که آدم به خلافت (الخلافة) اختصاص نیافت مگر به مشیئت (المشيئة). و اگر می‌خواست، آن را در هر یک از مخلوقاتش که اراده می‌کرد، قرار می‌داد. ما می‌گوییم: صحیح نیست که خلافت جز در مسمای انسان کامل (الإنسان الکامل) باشد. و اگر آن را در غیر انسان از مخلوقات جمع می‌کرد، آن جامع، عین انسان کامل می‌بود. پس او خلیفه‌ای است که بر آن خلق شده است. اگر بگویی: پس تمام عالم، انسان بزرگی است و همین کافی بود. می‌گوییم: راهی است؛ زیرا اگر او (عالم) عین خلیفه بود، دیگر بر چه کسی خلیفه می‌بود؟ پس ناگزیر باید یک فرد جامع وجود داشته باشد که صور عالم و صورت حق (الحق) را جمع کند و به واسطه این جامعیت، خلیفه در عالم باشد، به خاطر اسم ظاهر. امام از این فرد به «انسان بزرگ قدر» که جامع دو صورت است، تعبیر می‌کند. برخی از عالم بزرگتر از برخی از انسان‌ها هستند، اما نه از نظر مجموع؛ زیرا در انسان کامل (الإنسان الکامل) چیزی هست که در تک تک افراد عالم نیست. پس این (خلافت) به مشیئت (المشيئة) جز در نوع انسانی نیست، به دلیل اینکه این نوع دارای خلفایی است. سپس تأثیر او در همه عمومیت می‌یابد. پس از حق (الحق) می‌خواهد که او را مدد رساند و حق او را مدد می‌رساند. و این اثری در صورت حقی است. و همچنین امر را در عالم می‌طلبد و آن امر جاری می‌شود. سپس او (انسان کامل) هم از عالم و هم از حق (الحق) در آن تأثیرگذار است. پس امر بر اهل الله مختلط و مشتبه شد. برخی از عارفان (العارفين) خواستار خروج از این التباس شدند، پس خداوند آنان را بر صورت امر آگاه ساخت. او چیزی را دید که جز برای رسول معصوم، امکان بیان آن با زبان نیست. پس تو نیز آن طالب باش تا آنچه را که او دید، ببینی و همان‌گونه که ما گفتیم، بگویی.\n\nمرا به پادشاهی کسری درآورد، آنگاه که «کُن» (باش) مالک شد،\nهستی من را؛ پس من به واسطه «کُن» پادشاه شدم، در حالی که نبودم.\nاما من «کُن» بودم و کائنات (الکون) قلمرو پادشاهی بود،\nو هر کائنی از آن شماست، پس کائنات (الکون) وجود نداشت.\n\nو این همان قول اوست: «و فرمان ما جز یک امر نیست» (وَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ). سپس جاری شدن امر را به «چشم بر هم زدن» (لَمْحِ الْبَصَرِ) یا «نزدیک‌تر از آن» (أَوْ هُوَ أَقْرَبُ) تشبیه کرد. و همچنین نزدیک‌تر است. پس به حکمت خداوند متعال در این تشبیه بنگر و به آنچه آن یک لحظه (لمحه) از کثرت در وحدت در بر دارد. در آن هنگام است که امر را خواهی شناخت. پس ثابت قدم باش و آن را فاش مکن تا از امینان پنهان و پاک باشی.\n\n### [علم و مشیئت برای خداوند متعال ثابت هستند]\n\nو بدان که قول خداوند متعال: «اگر خدا می‌خواست» (لَوْ شَاءَ اللَّهُ) و «اگر خدا در آنان خیری می‌دانست، قطعاً آنان را شنوا می‌ساخت» (وَلَوْ عَلِمَ اللَّهُ فِيهِمْ خَيْرًا لَأَسْمَعَهُمْ)، نفی علم به چیزی و نفی مشیئت (المشيئة) از حق (الحق) را اقتضا می‌کند، همان‌گونه که قول او: «خداوند کسانی از شما را که پنهانی بیرون می‌روند، می‌داند» (قَدْ يَعْلَمُ اللَّهُ الَّذِينَ يَتَسَلَّلُونَ مِنْكُمْ لِوَاذًا) و قول او: «خداوند برای شما می‌خواهد» (يُرِيدُ اللَّهُ بِكُمُ) اقتضا می‌کند. پس علم و مشیئت (المشيئة) را با هم برای خداوند ثابت کن. علم خداوند از دو حالت خارج نیست، و همچنین اراده او: یا صفتی است قائم به او و زائد بر ذات او (الذات)، اگرچه اثبات‌کنندگان صفات می‌گویند: نه عین اوست و نه غیر او، اما ناگزیر باید بگویند که زائد است، همان‌گونه که اشعری معتقد است؛ یا عین ذات اوست، جز اینکه برای امری خاص، نسبتی ویژه دارد که به آن نسبت، علم نامیده می‌شود. و همچنین است سایر آنچه که خداوند به آن نامیده می‌شود و آن را می‌طلبد. پس نه اثبات شده و نه نفی، مگر تعلق علم و اراده. اما کلام جز در نفی علم به امری و اراده وارد نشده است. پس قطعاً بدان که نفی علم، خود علم است، و علم تابع معلوم است؛ هر جا که معلوم برود، علم نیز با او می‌رود و به همان صورتی که معلوم در نفس و ذات خود هست، به آن تعلق می‌گیرد. نه هستی (الوجود) از آن (ذات) نفی می‌شود و نه هر آنچه که قدم برای آن ثابت شده است، از صفت و غیره. پس باقی نمی‌ماند که نفی شود، مگر تعلق خاص، و آن امری حادث یا نسبتی است؛ هر طور که می‌خواهی بگو. و نفی و اثبات جز بر حادث، یعنی بر ممکن، وارد نمی‌شود.\n\nچه آن حکم موصوف به هستی (الوجود) باشد یا به نیستی (العدم). پس علم در اینجا به جای تعلق نشست، هنگامی که آن را با ادات \"لو\" (اگر) در قولش: «اگر می‌دانست» (لَوْ عَلِمَ) و «اگر می‌خواست» (لَوْ شَاءَ) نفی کردی. پس ندانست و نخواست. این همان امر حادث معین است. پس دانست که اگر می‌دانست. و گفته نمی‌شود که او خواسته است که بگوید «اگر می‌خواست»، زیرا متعلق مشیئت (المشيئة) عدم است و صحیح نیست که قول در ذات خداوند حادث شود، زیرا او محل حوادث نیست. پس گفته نمی‌شود که او خواسته است که بگوید. و تحقیق این است که او از مراد، جز آنچه که مراد بر آن است، از استعداد در حال عدم، اراده نکرده است؛ اینکه در حال هستی (الوجود) به آن باشد، یا هنگام زوال از هستی (الوجود) یا زوال حکم هستی از آن، به آن متصف شود؛ هر طور که می‌خواهی بگو. و چون فرقان میان مشیئت (المشيئة) و علم آشکار شد، دانستیم که آن دو، دو نسبت برای ذات عالم و مرید هستند، یا دو صفت در مذهب متکلمانی که قائل به صفات هستند. و اگر علم ما به اصلی که شنیدن چنین مطلبی را بر ما آسان کرد، نبود، قطعاً حیرت در مورد خداوند شدیدتر می‌شد. و آن اصل چیزی نیست جز اینکه خداوند متعال هیچ رسولی را نفرستاد «مگر به زبان قومش» (إِلَّا بِلِسَانِ قَوْمِهِ)، زیرا می‌خواهد آنان را بفهماند. پس محال است که در خطاب خود به آنان، از آنچه در زبانشان بر آن توافق کرده‌اند، خارج شود. پس عاقل در این امر راحتی یافت. اما اهل شهود (الشهود) در این امر راحتی ندارند، به دلیل اختلاف صورتی که بر مشهود دیده‌اند. پس آنان مانند اهل زبان نیستند. و طبقه عالی‌تر آمدند و گفتند: دانستیم که شهود (الشهود) تابع اعتقاد است، همان‌گونه که خطاب تابع چیزی است که اهل آن زبان بر آن توافق کرده‌اند. پس امر بر آنان آسان شد و آن را در هر اعتقادی دیدند، همان‌گونه که در هر زبانی فهمیدند. پس متحیر نشدند و هدایت یافتند. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}