{
  "id": 459,
  "title": {
    "ar": "الباب التاسع والخمسون وأربعمائة في معرفة منازلة وإِنَّهُمْ عِنْدَنا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيارِ",
    "en": "Chapter Four Hundred and Fifty-Nine: Concerning the knowledge of their spiritual stations (منازل) and [the meaning of the verse]: <<وَإِنَّهُمْ عِنْدَنا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيارِ>> (And indeed, with Us, they are surely among the chosen, the excellent).",
    "ur": "باب چار سو انسٹھ: ان کے مقامات کی معرفت (المعرفۃ) کے بیان میں، اور یہ کہ: \"اور بے شک وہ ہمارے نزدیک چنے ہوئے نیک لوگوں میں سے ہیں\" (وَإِنَّهُمْ عِنْدَنَا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيَارِ)۔",
    "fa": "باب چهارصد و پنجاه و نهم در معرفت منازل آنان و اینکه «و همانا آنان نزد ما از برگزیدگان نیکوکارند» (و إِنَّهُمْ عِنْدَنا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيارِ)."
  },
  "content": {
    "ar": "## «الباب التاسع والخمسون وأربعمائة في معرفة منازلة وإِنَّهُمْ عِنْدَنا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيارِ»\n\n\n> ثلاثة كلهم مصطفى *** ذو الظلم والسابق والمقتصد\n\n\n> ورثهم كتابه فاعتلوا *** بالعلم في ذاك عن المعتقد\n\n\n> واختارهم لنفسه فاعتلت *** همتهم عن كل أمر شهد\n\n\n### [الظلم الذي من الفضل الإلهي‏]\n\n\nقال الله تعالى ثُمَّ أَوْرَثْنَا الْكِتابَ الَّذِينَ اصْطَفَيْنا من عِبادِنا فَمِنْهُمْ ظالِمٌ لِنَفْسِهِ ومِنْهُمْ مُقْتَصِدٌ ومِنْهُمْ سابِقٌ بِالْخَيْراتِ بِإِذْنِ الله ذلِكَ هُوَ الْفَضْلُ الْكَبِيرُ أي كل ذلك بأمر الله فالظالم لنفسه لعلمه بقدرها عند الله فهو يظلم لها لا يظلمها فيعطي كل ذي حق حقه إلا الحق فإنه لا يعطيه كل حقه بل يعطيه من حقه تعالى ما يسمى به أديبا وما لا يسمى به أديبا يظلمه فيه من أجل نفسه حتى يلحق برتبة الأنبياء فمثل هذا الظلم من الفضل الإلهي على عبده فمن كان مشهده هذا سمي ظالما لنفسه مع أنه مصطفى وما أوقفه على ذلك إلا علمه بالكتاب فهو يحكم به كما قالَ الَّذِي عِنْدَهُ عِلْمٌ من الْكِتابِ لسليمان عليه السلام أَنَا آتِيكَ به قَبْلَ أَنْ يَرْتَدَّ إِلَيْكَ طَرْفُكَ فلو لا الكتاب ما علم آصف بن برخيا ذلك وأما المقتصد فهو الذي اقتصد في كل موطن على ما يقتضيه حكم الموطن فهو بحكم الموطن لا بحكم نفسه وهو أهل الله الأخفياء الأبرياء فمشهد الظالم ما يجب للحق فلا ينسبه إليه ومشهد المقتصد المواطن وما تستحق فالظالم يدخل في حكم المقتصد ولهذا كان المقتصد وسطا لأنه على حقيقة ليست للطرفين وفيه من حكم الطرفين ما يحتاج إليه أو يندرج فيه وأما السابق بالخيرات فهو الذي يتهيأ لحكم المواطن قبل قدومها عليه وتجتمع هذه الأحوال في الشخص الواحد فيكون ظالما مقتصدا سابقا بالخيرات والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 459: Concerning the Knowledge of Their Stations, and <<AND INDEED, THEY ARE, IN OUR PRESENCE, AMONG THE CHOSEN AND THE BEST>>\n\nThree, all of them are chosen (مصطفى):\nThe one who wrongs, the foremost, and the moderate.\n\nHe bequeathed His Book to them, so they rose high,\nThrough Knowledge (العلم) concerning that, beyond mere belief (المعتقد).\n\nAnd He chose them for Himself, so their aspiration (همتهم) rose high,\nTheir aspiration rose above every witnessed matter.\n\n### [The Wrongdoing (الظلم) that Stems from Divine Grace (الفضل الإلهي)]\n\nAllah the Exalted said: <<ثُمَّ أَوْرَثْنَا الْكِتَابَ الَّذِينَ اصْطَفَيْنَا مِنْ عِبَادِنَا فَمِنْهُمْ ظَالِمٌ لِنَفْسِهِ وَمِنْهُمْ مُقْتَصِدٌ وَمِنْهُمْ سَابِقٌ بِالْخَيْرَاتِ بِإِذْنِ اللَّهِ ذَلِكَ هُوَ الْفَضْلُ الْكَبِيرُ>> (Then We caused to inherit the Book those We chose of Our servants; and among them is he who wrongs himself (ظالم لنفسه), and among them is he who is moderate (مقتصد), and among them is he who is foremost in good deeds (سابق بالخيرات), by permission of Allah. That is the great bounty (الفضل الكبير)).\n\nMeaning, all of that is by the command of Allah. The one who wrongs himself (الظالم لنفسه) does so because of his Knowledge (علم) of his soul’s worth (قدرها) before Allah. Thus, he wrongs *for* it, not *against* it. So he gives every rightful claimant his due, except The Real (الحق), for he does not give Him His full due. Rather, he gives Him (The Real) of His due that by which he is called 'well-mannered' (أديبا), but that part of His due by which he is *not* called 'well-mannered,' he withholds (يظلمه فيه) for the sake of his own soul (نفسه), until he attains the rank of the Prophets (رتبة الأنبياء).\n\nSuch wrongdoing (الظلم) is thus part of the Divine Grace (الفضل الإلهي) upon His servant. Whoever has this station of witnessing (مشهد) is called 'one who wrongs himself,' even though he is chosen (مصطفى). Nothing established him in that station except his Knowledge (علم) of the Book (الكتاب), and he judges according to it. Just as the one who possessed Knowledge of the Book said to Solomon (عليه السلام): <<أَنَا آتِيكَ بِهِ قَبْلَ أَنْ يَرْتَدَّ إِلَيْكَ طَرْفُكَ>> (I will bring it to you before your gaze returns to you). Were it not for the Book, Asaf ibn Barkhiya would not have known that.\n\nAs for the Moderate (المقتصد), he is the one who is moderate in every station (موطن) according to what the ruling (حكم) of that station necessitates. Thus, he acts according to the ruling of the station, not according to the ruling of his own soul (نفسه). He is among the people of Allah (أهل الله), the hidden ones (الأخفياء), the innocent ones (الأبرياء).\n\nThe station of witnessing (مشهد) of the Wrongdoer (الظالم) is what is due to The Real (الحق), but he does not attribute it to Him. And the station of witnessing of the Moderate is the stations and what they deserve. Thus, the Wrongdoer enters into the ruling of the Moderate. For this reason, the Moderate is a middle ground (وسطا), because he possesses a Reality (حقيقة) that does not belong to the two extremes, yet he contains within himself the ruling of the two extremes that he needs or that is encompassed within him.\n\nAs for the Foremost in Good Deeds (السابق بالخيرات), he is the one who prepares himself for the ruling of the stations before they arrive upon him.\n\nAnd these states (الأحوال) may gather in a single person, so he is simultaneously a wrongdoer, a moderate, and a foremost in good deeds. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو انسٹھ (459): ان کے مقامات کی معرفت میں اور \"بے شک وہ ہمارے نزدیک چنے ہوئے نیک لوگوں میں سے ہیں\" (إِنَّهُمْ عِنْدَنا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيارِ)۔\n\nتین ہیں جو سب کے سب چنے ہوئے (مصطفى) ہیں،\nظالم، سابق، اور مقتصد۔\n\nاس نے انہیں اپنی کتاب کا وارث بنایا، پس وہ\nاس میں علم کے ذریعے معتقد (المعتقد) سے بلند ہو گئے۔\n\nاور اس نے انہیں اپنے لیے چن لیا، پس ان کی ہمت\nہر مشہود (شہد) امر سے بلند ہو گئی۔\n\n### [وہ ظلم جو فضل الٰہی (الفضل الإلهي) سے ہے]\n\nاللہ تعالیٰ نے فرمایا: \"پھر ہم نے ان لوگوں کو کتاب کا وارث بنایا جنہیں ہم نے اپنے بندوں میں سے چن لیا، پس ان میں سے کچھ اپنی جانوں پر ظلم کرنے والے ہیں، اور کچھ میانہ روی اختیار کرنے والے ہیں، اور کچھ اللہ کے حکم سے نیکیوں میں سبقت لے جانے والے ہیں، یہی بہت بڑا فضل ہے\" (ثُمَّ أَوْرَثْنَا الْكِتابَ الَّذِينَ اصْطَفَيْنا من عِبادِنا فَمِنْهُمْ ظالِمٌ لِنَفْسِهِ ومِنْهُمْ مُقْتَصِدٌ ومِنْهُمْ سابِقٌ بِالْخَيْراتِ بِإِذْنِ الله ذلِكَ هُوَ الْفَضْلُ الْكَبِيرُ)۔ یعنی یہ سب اللہ کے حکم سے ہے۔ پس اپنی جان پر ظلم کرنے والا (ظالم لنفسه) اپنی جان کی قدر اللہ کے نزدیک جانتا ہے، لہٰذا وہ اس کے لیے ظلم کرتا ہے، نہ کہ اس پر ظلم کرتا ہے۔ وہ ہر حقدار کو اس کا حق دیتا ہے، سوائے الحق (ذات حق) کے، کیونکہ وہ اسے اس کا پورا حق نہیں دیتا، بلکہ اسے اللہ تعالیٰ کے حق میں سے اتنا دیتا ہے جس سے وہ مؤدب کہلائے، اور جس میں وہ مؤدب نہیں کہلاتا، اس میں وہ اپنی جان کی خاطر اس پر ظلم کرتا ہے، تاکہ وہ انبیاء کے مرتبے کو پہنچ جائے۔ پس اس طرح کا ظلم بندے پر فضل الٰہی (الفضل الإلهي) میں سے ہے۔ لہٰذا جس کا مشاہدہ (مشہد) یہ ہو، وہ اپنی جان پر ظلم کرنے والا (ظالم لنفسه) کہلاتا ہے، حالانکہ وہ چنا ہوا (مصطفى) ہے۔ اور اسے اس مقام پر اس کے علمِ کتاب کے سوا کسی چیز نے نہیں پہنچایا، پس وہ اس کے مطابق حکم کرتا ہے، جیسا کہ سلیمان علیہ السلام سے اس شخص نے کہا تھا جس کے پاس کتاب کا علم تھا: \"میں اسے آپ کے پاس لے آؤں گا اس سے پہلے کہ آپ کی پلک جھپکے\" (قالَ الَّذِي عِنْدَهُ عِلْمٌ من الْكِتابِ أَنَا آتِيكَ به قَبْلَ أَنْ يَرْتَدَّ إِلَيْكَ طَرْفُكَ)۔ اگر کتاب نہ ہوتی تو آصف بن برخیا یہ نہ جانتا۔\n\nاور مقتصد (میانہ روی اختیار کرنے والا) وہ ہے جو ہر مقام (موطن) میں اس کے حکم کے مطابق میانہ روی اختیار کرتا ہے جو اس مقام کا تقاضا ہوتا ہے۔ پس وہ مقام کے حکم کے مطابق ہوتا ہے، نہ کہ اپنے نفس کے حکم کے مطابق۔ اور یہی اللہ کے پوشیدہ، بے گناہ اہل ہیں۔ پس ظالم کا مشاہدہ (مشہد) وہ ہے جو الحق (ذات حق) کے لیے واجب ہے، لیکن وہ اسے اس کی طرف منسوب نہیں کرتا۔ اور مقتصد کا مشاہدہ (مشہد) مقامات اور ان کے استحقاق کا ہے۔ پس ظالم مقتصد کے حکم میں داخل ہوتا ہے، اور اسی لیے مقتصد درمیانی ہوتا ہے، کیونکہ وہ ایسی حقیقت پر قائم ہے جو دونوں کناروں کے لیے نہیں ہے، اور اس میں دونوں کناروں کے حکم میں سے وہ کچھ شامل ہے جس کی اسے ضرورت ہوتی ہے یا جو اس میں شامل ہو جاتا ہے۔ اور سابق بالخیرات (نیکیوں میں سبقت لے جانے والا) وہ ہے جو مقامات کے حکم کے لیے ان کے آنے سے پہلے ہی تیار ہو جاتا ہے۔ اور یہ تمام احوال ایک ہی شخص میں جمع ہو سکتے ہیں، پس وہ ظالم، مقتصد، اور سابق بالخیرات ہو سکتا ہے۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و پنجاه و نهم در معرفت منازل ایشان و اینکه «و همانا آنان نزد ما از برگزیدگان نیکوکارند» (إِنَّهُمْ عِنْدَنا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيارِ).\n\nسه گروهند که همگی برگزیده‌اند\nستمگر، پیشتاز و میانه‌رو\n\nکتابش را به آنان به ارث داد، پس به واسطه علم در آن [کتاب]\nاز معتقدات [عامیانه] برتری یافتند\n\nو آنان را برای خود برگزید، پس همتشان\nاز هر امر مشهودی فراتر رفت\n\n### [ستمگری که از فضل الهی است]\n\nخداوند متعال می‌فرماید: «سپس کتاب را به کسانی از بندگانمان که برگزیدیم، به ارث دادیم؛ پس برخی از آنان ستمگر بر خویشند و برخی از آنان میانه‌رو و برخی از آنان به اذن خدا در نیکی‌ها پیشتازند. این همان فضل بزرگ است» (ثُمَّ أَوْرَثْنَا الْكِتابَ الَّذِينَ اصْطَفَيْنا من عِبادِنا فَمِنْهُمْ ظالِمٌ لِنَفْسِهِ ومِنْهُمْ مُقْتَصِدٌ ومِنْهُمْ سابِقٌ بِالْخَيْراتِ بِإِذْنِ الله ذلِكَ هُوَ الْفَضْلُ الْكَبِيرُ). یعنی همه اینها به فرمان خداست. اما ستمگر بر خویش (ظالم لنفسه)، به دلیل علمش به قدر و منزلت نفس نزد خداوند، برای نفس ستم می‌کند، نه اینکه بر آن ستم روا دارد. پس حق هر صاحب حقی را به او می‌دهد، مگر حق (الحق) را؛ زیرا حق را تمام و کمال به او نمی‌دهد، بلکه از حق تعالی به اندازه‌ای به او می‌دهد که به واسطه آن مؤدب نامیده شود. و آنچه را که به واسطه آن مؤدب نامیده نمی‌شود، به خاطر نفسش در آن ستم می‌کند تا به مرتبه انبیا ملحق شود. پس چنین ستمی از فضل الهی بر بنده اوست. پس هر کس شهود (الشهود) او این باشد، ستمگر بر خویش نامیده می‌شود، با وجود اینکه برگزیده است. و چیزی او را بر این امر واقف نساخت مگر علمش به کتاب، پس به واسطه آن حکم می‌کند. چنانکه آن کس که دانشی از کتاب نزدش بود (الَّذِي عِنْدَهُ عِلْمٌ من الْكِتابِ)، به سلیمان علیه السلام گفت: «من آن را پیش از آنکه پلک چشمت به سویت بازگردد، نزد تو می‌آورم» (أَنَا آتِيكَ به قَبْلَ أَنْ يَرْتَدَّ إِلَيْكَ طَرْفُكَ). و اگر کتاب نبود، آصف بن برخیا آن را نمی‌دانست.\n\nو اما میانه‌رو (مقتصد)، کسی است که در هر موطنی بر اساس آنچه حکم آن موطن اقتضا می‌کند، میانه‌روی می‌کند. پس او تابع حکم موطن است نه حکم نفس خویش، و او از اهل الله، پنهان و بی‌گناه است. پس شهود (الشهود) ستمگر، آن چیزی است که برای حق (الحق) واجب است، اما آن را به حق نسبت نمی‌دهد. و شهود (الشهود) میانه‌رو، موطن‌ها و آنچه سزاوار آن هستند، می‌باشد. پس ستمگر در حکم میانه‌رو داخل می‌شود، و به همین دلیل میانه‌رو (مقتصد) در وسط قرار دارد، زیرا او بر حقیقتی است که برای دو طرف دیگر نیست، و در عین حال از حکم هر دو طرف آنچه را که بدان نیاز دارد یا در آن مندرج می‌شود، داراست. و اما پیشتاز در نیکی‌ها (السابق بالخيرات)، کسی است که پیش از فرارسیدن موطن‌ها، برای حکم آنها آماده می‌شود. و این احوال در یک شخص واحد جمع می‌شود، پس او هم ستمگر، هم میانه‌رو و هم پیشتاز در نیکی‌ها خواهد بود. و خداوند حق (الحق) را می‌گوید و اوست که راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 1
}