{
  "id": 153,
  "title": {
    "ar": "الباب الثالث والخمسون ومائة في معرفة مقام الولاية البشرية وأسرارها",
    "en": "Chapter One Hundred and Fifty-Three, Concerning the Gnosis (معرفة) of the Station (مقام) of Human Sainthood (الولاية البشرية) and its Mysteries.",
    "ur": "باب ایک سو ترپن (۱۵۳): مقام ولایت بشریہ (الولایۃ البشریۃ) کی معرفت (المعرفۃ) اور اس کے اسرار۔",
    "fa": "باب صد و پنجاه و سوم در معرفت مقام ولایت بشری و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الثالث والخمسون ومائة في معرفة مقام الولاية البشرية وأسرارها)\n\n\n> من صورة الحق نلنا من ولايته *** جميعها فلنا في الحرب أقدام‏\n\n\n> لنا الخلافة في الدنيا محققة *** وما لها في جنان الخلد أحكام‏\n\n\n> إنا على النصف من جناتنا أبدا *** وما لنا في كثيب العين أقدام‏\n\n\n> وهو الكمال كمال الذات يجمعنا *** فيه ابتهاج بنا ما فيه آلام‏\n\n\n> ودار دنياك أمراض وعافية *** تعصى الأوامر فيها وهو علام‏\n\n\n> يقول افعل فلا تسمع مقالته *** ولا يرى منه عند النقض إبرام‏\n\n\n> لذاك قلنا فلم تسمع مقالتنا *** وفيه لله إتقان وإحكام‏\n\n\n> لو قال من قال كن بنعت خالقه *** بدت لعينك أرواح وأجسام‏\n\n\n> لذاك خص من الألفاظ لفظة كن *** لها الوجود وما في الكون إعدام‏\n\n\n### [المقابلة المعقولة أو المرتبة الوسط بين وجوب الوجود والعدم المطلق‏]\n\n\nالولاية البشرية قوله تعالى إِنْ تَنْصُرُوا الله وقوله أمرا كُونُوا أَنْصارَ الله فعلمنا أنه لو لم يكن ثم مقابل لوجود الحق ولوجوب وجوده يطلبنا ذلك المقابل بالنصر لنكون في قبضته وملكه على وجود الحق ما قال الله لنا كُونُوا أَنْصارَ الله على هذا المقابل المنازع وهذه تعرف بالمقابلة المعقولة ولما كان الحق تعالى له صفة الوجود وصفة وجوب الوجود النفسي وكان المقابل يقال له العدم المطلق وله صفة يسمى بها المحال فلا يقبل الوجود أبدا لهذه الصفة فلا حظ له في الوجود كما لا حظ للوجوب الوجود النفسي في العدم ولما كان الأمر هكذا كنا نحن في مرتبة الوسط نقبل الوجود لذاتنا ونقبل العدم لذاتنا ونحن لما نقبل عليه فيحكم فينا بما يعطيه حقيقته ونكون ملكا له ويظهر سلطانه فينا\n\n\n### [الأعيان الثابتة عليها يقع الخطاب من طرفي الوجود المطلق والعدم المطلق‏]\n\n\nفصار العدم المحال يطلبنا أن نكون ملكا له وصار الحق الواجب الوجود لنفسه يطلبنا لنكون ملكه ويظهر فينا سلطانه ونحن على حقيقة نقبل بها الوصفين ونحن إلى العدم أقرب نسبة منا إلى الوجود فإنا معدومون ولكن غير موصوفين بالمحال لكن نعتنا في ذلك العدم الإمكان وهو أنه ليس في قوتنا أن ندفع عن نفوسنا الوجود ولا العدم لكن لنا أعيان ثابتة متميزة عليها يقع الخطاب من الطرفين فيقول العدم لنا كونوا على ما أنتم عليه من العدم لأنه ليس لكم أن تكونوا في مرتبتي ويقول الحق لكل عين من أعيان الممكنات كن فيأمره بالوجود فيقول الممكن نحن في العدم قد عرفناه وذقناه وقد جاءنا أمر الواجب الوجود بالوجود وما نعرفه وما لنا فيه قدم فتعالوا ننصره على هذا المحال العدمي لنعلم ما هذا الوجود ذوقا فكانوا عند قوله كن فلما حصلوا في قبضته لم يرجعوا بعد ذلك إلى العدم أصلا لحلاوة لذة الوجود وحمدوا رأيهم ورأوا بركة نصرهم الله على العدم المحال‏\n\n\n### [انعدام الأعراض في الزمان الثاني من زمان وجودها]\n\n\nفالعالم من حيث جوهريته ناصر لله فهو منصور أبدا وجاءت الأعراض فقبلت‏\nالوجود فلما ذاقته وعلمته دعاها العدم إلى نفسه وقال لها إلى مردك لأنك عرض ولا بقاء لك في الوجود إذ العارض حقيقته أنه لا بقاء له فارجع إلى عن أمري فلذلك دل دليل العقل أن العرض ينعدم لنفسه إذ الفاعل لا يفعل العدم لأنه حكم لا شي‏ء موجود فانعدمت الأعراض في الزمان الثاني من زمان وجودها فحصلت في قبضة العدم المحال فلم ترجع بعد ذلك إلى الوجود بل يوجد الله أمثالها فتشبهها في الحد والحقيقة وما هي أعيان تلك التي وجدت وانعدمت للاتساع الإلهي فهذه ولاية ما سوى الله أي نصر ما سوى الله لله وهذا من أسرار الولاية البشرية ومدركها عسير فإن مبناه على العلم بمراتب المعلومات‏\n\n\n### [الولاية البشرية العامة]\n\n\nفإذا فهمت هذا فاعلم إن الولاية البشرية على قسمين خاصة وعامة فالعامة توليهم بعضهم بعضا بما في قوتهم من إعطاء المصالح المعلومة في الكون فهم مسخرون بعضهم لبعض الأعلى للأدنى والأدنى للأعلى وهذا لا ينكره عاقل فإنه الواقع فإن أعلى المراتب الملك فالملك مسخر في مصالح الرعايا والسوقة والرعايا والسوقة مسخرون للملك فتسخير الملك الرعايا ليس عن أمر الرعايا ولكن لما تقتضيه المصلحة لنفسه وتنتفع الرعايا بحكم التبع لا أنهم المقصودون بذلك الانتفاع الذي يعود عليهم من التسخير وتسخير الرعايا على الوجهين الوجه الواحد يشاركون فيه الملك من أنهم لا يبعثهم على التسخير إلا طلب المنفعة العائدة عليهم من ذلك كما يفعله الملك سواء والتسخير الثاني ما هم عليه من قبول أمر الملك في العسر واليسر والمنشط والمكره وبهذا ينفصلون عن تسخير الملوك فهم أذلاء أبدا لا يرتفع لهم رأس مع حاجة الملوك إليهم وهذا هو القسم العام‏\n\n\n### [الولاية البشرية الخاصة]\n\n\nوأما القسم الخاص فهو ما لهم من الولاية التي هي النصرة في قبول بعض أحكام الأسماء الإلهية على غيرها من الأسماء الأخر بمجرد أفعالهم وما يظهر في أكوانهم لكونهم قابلين لآثار الأسماء فيهم فينزلون بهذه الولاية منازل الحقائق الإلهية فيكون الحكم لهم مثل ما هو الحكم للأسماء بما هم عليه من الاستعداد\n\n\n### [أصحاب الأحوال وأصحاب المقامات في دائرة الولاية البشرية الخاصة]\n\n\nوهذه الولاية في أصحاب الأحوال أظهر في العامة من ظهورها في أصحاب المقامات وهي في أصحاب المقامات في الخصوص أظهر من ظهورها في أصحاب الأحوال ولكن مدركها عسير فإن صاحب المقام على العادة المستمرة وهو متغير في كل زمان مع كل نفس لأنه في كل نفس في شأن إلهي لا علم لكل أحد به مع قيامه به من حيث لا يشعر فلا يحمد عليه وهذا الخاص يحمد عليه وصاحب الحال خارق للعادة فتحيد إليه الأبصار وتقبل عليه النفوس وهو ثابت مدة طويلة على حالة واحدة لا يشعر لتغيرها عليه ويحجبه عن معرفة ذلك حبه لسلطنته التي أعطاها الحال فهو على النقيض من صاحب المقام ولو استشعر بنقصه في مرتبته لما رغب في الحال فإنه يدل على جهله‏\n\n\n### [الأحوال المختلفة لصاحب مقام الحال في الولاية البشرية الخاصة]\n\n\nولصاحب هذا المقام أحوال مختلفة منها حال الأمانة وحال الدنو وحال القرب وحال الكشف وحال الجمع وحال اللطف وحال القوة وحال الحماسة وحال اللين وحال الطيب وحال النظافة وحال الأدب فإذا تجلى في السلطنة ارتاض وقيل فيه سلطان وإذا تجلى في الجلال تأدب فهو أديب وفي تجلى الجمال نظيف وفي تجلى العظمة طاهر زكى قدوس وإذا تجلى في الطيب عطر عرفه وفي الهيبة جعله سيدا وفي اللطف ذوبه وفي الحسن عشقه فروحنه‏\n\n\n### [التفريغ والإقبال والستور والحجال لأولياء الله‏]\n\n\nفللأولياء التفريع والإقبال ولهم الستور والحجاب إذا قربهم صانهم وسترهم وخبأهم فجهلوا وإذا عاقبهم وليسوا بأنبياء أظهر عليهم خرق العوائد فعرفوا فحجبوا الخلق عن الله وهم مأمورون بدعوتهم إلى الله فالحق لأصحاب المقامات من الأولياء مطيع ولكلامهم سميع لهم جميع المقامات والأحوال وهم ذكران الرجال لا يلحقهم عيب ولا يقوم بهم فيما هم فيه ريب لهم الآخرة مخلصة كما هي لله ولهم الدنيا ممتزجة كما هي لسيدهم فهم بصفات الحق ظاهرون ولذلك جهلوا\n\n",
    "en": "(Chapter 153: Concerning the Knowledge of the Station of Human Sainthood [Wilāya Bashariyya] and its Secrets)\n\nFrom the Form of the Real (صورة الحق) we attained all of His Sainthood (ولاية); thus, we have firm footing in the war.\n\nThe Vicegerency (الخلافة) is realized for us in this world, but its rulings do not apply in the Gardens of Eternity.\n\nWe are forever upon the half of our Gardens, and we have no footing upon the dune of the Eye (كثيب العين).\n\nAnd that is Perfection, the Perfection of the Essence (كمال الذات) that gathers us; in it is joy in us, and no pains.\n\nAnd the abode of your world holds sicknesses and health; in it, commands are disobeyed, yet He is All-Knowing (علام).\n\nHe says, \"Do!\" but His saying is not heard, and when the command is broken, no ratification is seen from Him.\n\nTherefore, we spoke, but our saying was not heard, yet in it is God's perfection and mastery.\n\nIf one who speaks were to say \"Be!\" [Kun] with the attribute of his Creator, spirits and bodies would appear to your eye.\n\nFor that reason, the word \"Be!\" [Kun] was singled out among utterances; Existence (الوجود) belongs to it, and there is no annihilation (إعدام) in the cosmos.\n\n### [The Intelligible Counterpart or the Middle Level between the Necessity of Existence and Absolute Non-existence]\n\nHuman Sainthood (الولاية البشرية) is related to His saying, <<إِنْ تَنْصُرُوا الله>> (If you help Allah), and His commanding saying, <<كُونُوا أَنْصارَ الله>> (Be helpers of Allah). We understood that if there were no counterpart to the Being (وجود) of the Real (الحق) and the Necessity of His Existence (وجوب وجوده)—a counterpart that demands our help so that we may be in His grasp and dominion—then God would not have said to us, <<كُونُوا أَنْصارَ الله>> (Be helpers of Allah) against this contending counterpart. This is known as the Intelligible Counterpart (المقابلة المعقولة). Since the Real (الحق) possesses the attribute of Being (الوجود) and the attribute of the Necessity of Self-Existence (وجوب الوجود النفسي), and the counterpart is called Absolute Non-existence (العدم المطلق) and possesses an attribute by which it is named The Impossible (المحال)—it never accepts Existence due to this attribute—it has no share in Existence, just as the Necessity of Self-Existence has no share in non-existence. Since the matter stands thus, we are in the Middle Level (مرتبة الوسط). We accept Existence for our essence (ذاتنا) and we accept non-existence for our essence. When we turn toward something, it rules over us according to what its reality dictates, and we become its possession, and its sovereignty manifests in us.\n\n### [The Fixed Entities are Addressed by the Two Extremes: Absolute Existence and Absolute Non-existence]\n\nThus, the Impossible Non-existence (العدم المحال) demands that we become its possession, and the Real (الحق), whose Existence is necessary for Himself (الواجب الوجود لنفسه), demands us so that we may be His possession and His sovereignty may manifest in us. We are upon a reality (حقيقة) by which we accept both descriptions. We are closer in proportion to non-existence than we are to Existence, for we are non-existent, yet not described by the Impossible (المحال). Rather, our description in that non-existence is Contingency (الإمكان). This means that it is not in our power to repel Existence or non-existence from ourselves. However, we possess distinct Fixed Entities (أعيان ثابتة) upon which the address falls from both sides. Non-existence says to us, \"Remain upon the non-existence that you are, for you cannot be in my level.\" And the Real says to every Fixed Entity (عين) of the contingent beings, \"Be!\" [Kun], commanding it to Existence. The contingent being says, \"We have known and tasted non-existence. The command of the Necessary Being (الواجب الوجود) has come to us for Existence, but we do not know it, nor do we have any footing in it. So, let us help Him against this Non-existent Impossible (المحال العدمي) so that we may know this Existence by tasting (ذوقا).\" Thus, they were present at His saying \"Be!\" [Kun]. When they came into His grasp, they never returned to non-existence thereafter, due to the sweetness of the pleasure of Existence. They praised their judgment and saw the blessing of God helping them against the Impossible Non-existence.\n\n### [The Annihilation of Accidents in the Second Moment of their Existence]\n\nThe world (العالم), in terms of its substantiality (جوهريته), is a helper of God, and thus it is perpetually helped. Then came the accidents (الأعراض), and they accepted Existence. When they tasted and knew it, Non-existence called them back to itself and said to them, \"To me is your return, because you are an accident, and you have no subsistence (بقاء) in Existence, since the reality of the accidental is that it has no permanence. So, return by my command.\" For this reason, the proof of reason indicates that the accident annihilates itself, since the Agent (الفاعل) does not effect non-existence, because non-existence is a ruling of 'nothing existing.' Thus, the accidents annihilated themselves in the second moment (الزمان الثاني) of their existence. They came into the grasp of the Impossible Non-existence (العدم المحال) and did not return to Existence thereafter. Rather, God brings into existence their likes, which resemble them in definition and reality, but they are not the same Fixed Entities (أعيان) that existed and annihilated themselves, due to the Divine Vastness (الاتساع الإلهي). This is the sainthood (ولاية) of what is other than God—that is, the helping of what is other than God for God. This is one of the secrets of Human Sainthood (الولاية البشرية), and its comprehension is difficult, for its foundation rests upon the knowledge of the Levels of the Known Things (مراتب المعلومات).\n\n### [General Human Sainthood]\n\nIf you have understood this, know that Human Sainthood (الولاية البشرية) is of two types: special and general. The general type is their mutual guardianship (توليهم بعضهم بعضا) based on the power they possess to provide known benefits in the cosmos. Thus, they are subjugated (مسخرون) one to another: the higher to the lower, and the lower to the higher. No rational person denies this, for it is what occurs in reality. The highest level is the ruler (الملك), and the ruler is subjugated for the benefit of the subjects and the common people. Likewise, the subjects and the common people are subjugated to the ruler. The ruler's subjugation of the subjects is not by the command of the subjects, but rather by what the benefit requires for himself, and the subjects benefit by way of consequence, not because they are the intended recipients of the benefit resulting from the subjugation. The subjugation of the subjects is twofold: In the first aspect, they share with the ruler the fact that nothing motivates them to subjugation except the pursuit of benefit returning to them from it, just as the ruler does. The second subjugation is their acceptance of the ruler's command in hardship and ease, willingness and reluctance. By this, they are distinct from the subjugation of the rulers; they are perpetually humbled, never raising their heads, despite the rulers' need for them. This is the general type.\n\n### [Special Human Sainthood]\n\nAs for the special type, it is the Sainthood (الولاية) they possess, which is the help (النصرة) in accepting the rulings of certain Divine Names (الأسماء الإلهية) over others, purely through their actions and what manifests in their existences (أكوانهم). This is because they are receptive to the effects of the Names within them. By means of this Sainthood, they descend to the stations of the Divine Realities (الحقائق الإلهية), and the ruling belongs to them just as it belongs to the Names, based on the preparedness (الاستعداد) they possess.\n\n### [The People of States and the People of Stations within the Sphere of Special Human Sainthood]\n\nThis Sainthood (الولاية) is more apparent in the People of States (أصحاب الأحوال) among the general populace than its appearance in the People of Stations (أصحاب المقامات). However, in the People of Stations, it is more apparent in the specific sense (الخصوص) than its appearance in the People of States. Yet, its comprehension is difficult. The Person of the Station (صاحب المقام) is upon continuous custom, though he changes in every moment with every breath, because in every breath he is engaged in a Divine Affair (شأن إلهي) of which no one has knowledge, even while he maintains it without realizing it. Thus, he is not praised for it. This special person (صاحب المقام) is praised for it. The Person of the State (صاحب الحال) breaks custom, so eyes turn toward him and souls approach him. He remains fixed for a long duration upon a single state, unaware of its change upon him. His love for the sovereignty granted by the State (الحال) veils him from knowing this. He is the opposite of the Person of the Station. If he were aware of his deficiency in his level, he would not desire the State, for it indicates his ignorance.\n\n### [The Different States of the Person of the Station of the State in Special Human Sainthood]\n\nThe Person of this Station (صاحب هذا المقام) has different states (أحوال), among them: the state of Trustworthiness (الأمانة), the state of Nearness (الدنو), the state of Proximity (القرب), the state of Unveiling (الكشف), the state of Gathering (الجمع), the state of Subtlety (اللطف), the state of Power (القوة), the state of Zeal (الحماسة), the state of Gentleness (اللين), the state of Goodness (الطيب), the state of Purity (النظافة), and the state of Propriety (الأدب). When He (God) manifests in Sovereignty (السلطنة), the person is disciplined, and it is said of him that he is a sovereign. When He manifests in Majesty (الجلال), the person becomes well-mannered, so he is an adept. In the manifestation of Beauty (الجمال), he is pure. In the manifestation of Grandeur (العظمة), he is purified, sanctified, and holy (قدوس). When He manifests in Goodness (الطيب), He perfumes his essence. In Awe (الهيبة), He makes him a master. In Subtlety (اللطف), He melts him. In Beauty (الحسن), He makes him love Him, thus spiritualizing him (فروحنه).\n\n### [The Emptying, the Turning, the Veils, and the Curtains for the Friends of God]\n\nFor the Friends of God (الأولياء) there is the Emptying (التفريغ) and the Turning (الإقبال), and for them are the Veils (الستور) and the Curtains (الحجاب). When He brings them near, He protects them, veils them, and hides them, so they are unknown. When He punishes them—and they are not prophets—He manifests upon them the breaking of customs (خرق العوائد), so they become known, and thus they veil creation from God, even though they are commanded to invite them to God. The Real (الحق) is obedient to the People of Stations (أصحاب المقامات) among the Friends of God and is hearing of their speech. They possess all the Stations (المقامات) and States (الأحوال). They are the males among men (ذكران الرجال); no defect attaches to them, and no doubt arises concerning their condition. The Hereafter is purely theirs, just as it is purely God’s, and the world is mixed for them, just as it is for their Master. Thus, they are manifest by the Attributes (صفات) of the Real, and for that reason, they are unknown.",
    "ur": "(باب ایک سو ترپن: بشری ولایت (الولایۃ البشریۃ) کے مقام اور اس کے اسرار کی معرفت میں)\n\nذات حق (الحق) کی صورت سے ہم نے اس کی تمام ولایت حاصل کی، پس جنگ میں ہمارے قدم جمے ہوئے ہیں۔\nدنیا میں خلافت ہمارے لیے یقینی ہے، لیکن جنت خلد میں اس کے کوئی احکام نہیں۔\nہم ہمیشہ اپنی جنتوں کے نصف پر ہیں، اور ہمیں عین (ذات) کے ٹیلے پر قدم رکھنے کی اجازت نہیں۔\nاور وہ کمال، کمال ذات (کمال الذات) ہے جو ہمیں جمع کرتا ہے، اس میں ہمارے ساتھ خوشی ہے، کوئی تکلیف نہیں۔\nاور تیری دنیا کا گھر بیماریوں اور عافیت کا گھر ہے، جہاں اوامر کی نافرمانی کی جاتی ہے، حالانکہ وہ (اللہ) سب کچھ جاننے والا ہے۔\nوہ کہتا ہے \"کر\" لیکن اس کی بات نہیں سنی جاتی، اور توڑنے کے وقت اس کی طرف سے کوئی پختگی نظر نہیں آتی۔\nاسی لیے ہم نے کہا، تو ہماری بات نہیں سنی گئی، حالانکہ اس میں اللہ کے لیے پختگی اور مضبوطی ہے۔\nاگر کوئی اپنے خالق کی صفت کے ساتھ \"کن\" (ہو جا) کہے، تو تیری آنکھ کے سامنے ارواح اور اجسام ظاہر ہو جائیں۔\nاسی لیے تمام الفاظ میں سے لفظ \"کن\" (ہو جا) کو خاص کیا گیا، اس کے لیے ہستی (الوجود) ہے اور کائنات میں کوئی معدومیت نہیں۔\n\n### [معقول مقابلہ (المقابلۃ المعقولۃ) یا وجوب الوجود اور عدم مطلق (العدم المطلق) کے درمیان درمیانی مرتبہ]\n\nبشری ولایت (الولایۃ البشریۃ) اللہ تعالیٰ کے اس فرمان میں ہے: \"اگر تم اللہ کی مدد کرو گے\" (إِنْ تَنْصُرُوا الله) اور اس کے حکمی فرمان میں: \"اللہ کے مددگار بن جاؤ\" (كُونُوا أَنْصارَ الله)۔ پس ہم نے جانا کہ اگر ذات حق (الحق) کی ہستی (الوجود) اور اس کے وجوب وجود (وجوب الوجود) کے مقابلے میں کوئی فریق نہ ہوتا جو ہم سے مدد طلب کرتا تاکہ ہم ذات حق کی ہستی پر اس کی گرفت اور ملکیت میں ہوں، تو اللہ ہمیں اس متنازع فریق کے مقابلے میں \"اللہ کے مددگار بن جاؤ\" (كُونُوا أَنْصارَ الله) نہ کہتا۔ اور یہ (حالت) معقول مقابلہ (المقابلۃ المعقولۃ) کہلاتی ہے۔ اور چونکہ حق تعالیٰ کے لیے صفت ہستی (الوجود) اور صفت وجوب وجود نفسی (وجوب الوجود النفسی) ہے، اور مقابل کو عدم مطلق (العدم المطلق) کہا جاتا ہے، اور اس کے لیے ایک صفت ہے جسے محال (المحال) کہا جاتا ہے، لہٰذا وہ اس صفت کی وجہ سے کبھی بھی ہستی کو قبول نہیں کرتا۔ پس اس کا ہستی میں کوئی حصہ نہیں، جیسا کہ وجوب وجود نفسی کا عدم میں کوئی حصہ نہیں۔ اور جب معاملہ ایسا تھا، تو ہم درمیانی مرتبے میں تھے، ہم اپنی ذات کے لیے ہستی کو قبول کرتے ہیں اور اپنی ذات کے لیے عدم کو قبول کرتے ہیں۔ اور ہم جس کی طرف مائل ہوتے ہیں، وہ ہم پر اس چیز کے ساتھ حکم کرتا ہے جو اس کی حقیقت عطا کرتی ہے، اور ہم اس کی ملکیت بن جاتے ہیں اور اس کی سلطنت ہم میں ظاہر ہوتی ہے۔\n\n### [اعیان ثابتہ (الأعیان الثابتۃ) جن پر وجود مطلق (الوجود المطلق) اور عدم مطلق (العدم المطلق) دونوں طرف سے خطاب واقع ہوتا ہے]\n\nپس محال عدم (العدم المحال) ہم سے مطالبہ کرتا ہے کہ ہم اس کی ملکیت بن جائیں، اور ذات حق (الحق) جو واجب الوجود لنفسہ ہے، ہم سے مطالبہ کرتا ہے کہ ہم اس کی ملکیت بنیں اور اس کی سلطنت ہم میں ظاہر ہو۔ اور ہم ایک ایسی حقیقت پر ہیں جس کے ذریعے ہم دونوں اوصاف کو قبول کرتے ہیں، اور ہم ہستی (الوجود) کی نسبت عدم سے زیادہ قریب ہیں۔ کیونکہ ہم معدوم ہیں، لیکن محال (المحال) کے وصف سے متصف نہیں ہیں۔ بلکہ اس عدم میں ہماری صفت امکان (الإمکان) ہے۔ اور وہ یہ ہے کہ ہمارے اختیار میں نہیں کہ ہم اپنی جانوں سے ہستی کو دفع کریں یا عدم کو، لیکن ہمارے لیے متمیز اعیان ثابتہ (الأعیان الثابتۃ) ہیں جن پر دونوں طرف سے خطاب واقع ہوتا ہے۔ پس عدم ہم سے کہتا ہے کہ تم اسی عدم پر رہو جس پر تم ہو، کیونکہ تمہارے لیے میرے مرتبے میں ہونا ممکن نہیں ہے۔ اور ذات حق (الحق) ممکنات (الممکنات) کے ہر عین سے کہتا ہے: \"کن\" (ہو جا)، پس اسے ہستی (الوجود) کا حکم دیتا ہے۔ تو ممکن (الممکن) کہتا ہے: ہم عدم میں ہیں، ہم نے اسے پہچانا اور چکھا ہے۔ اور ہمارے پاس واجب الوجود (الواجب الوجود) کا حکم ہستی کے ساتھ آیا ہے، جسے ہم نہیں جانتے اور نہ ہی اس میں ہمارا کوئی قدم ہے۔ پس آؤ، ہم اس عدمی محال (المحال العدمی) کے مقابلے میں اس (واجب الوجود) کی مدد کریں تاکہ ہم اس ہستی کو ذوق (ذوقا) کے ذریعے جانیں۔ پس وہ اس کے \"کن\" (ہو جا) کہنے پر موجود ہو گئے، اور جب وہ اس کی گرفت میں آ گئے تو اس کے بعد ہستی کی لذت کی مٹھاس کی وجہ سے کبھی بھی عدم کی طرف واپس نہیں لوٹے، اور انہوں نے اپنی رائے کی تعریف کی اور عدم محال (العدم المحال) پر اللہ کی مدد کرنے کی برکت دیکھی۔\n\n### [اعراض (الأعراض) کا ان کے وجود کے زمانے کے دوسرے زمانے میں معدوم ہو جانا]\n\nپس عالم اپنی جوہریت (جوھریۃ) کے لحاظ سے اللہ کا مددگار ہے، لہٰذا وہ ہمیشہ منصور ہے۔ اور اعراض (الأعراض) آئے اور انہوں نے ہستی (الوجود) کو قبول کیا، جب انہوں نے اسے چکھا اور جانا تو عدم نے انہیں اپنی طرف بلایا اور کہا: تمہاری واپسی میری طرف ہے، کیونکہ تم عرض ہو اور ہستی میں تمہارے لیے بقا نہیں ہے، اس لیے کہ عرض کی حقیقت یہ ہے کہ اس کے لیے بقا نہیں ہوتی، پس میرے حکم سے میری طرف لوٹ آؤ۔ اسی لیے دلیل عقل نے رہنمائی کی کہ عرض خود بخود معدوم ہو جاتا ہے، کیونکہ فاعل عدم کو نہیں کرتا، اس لیے کہ وہ ایک حکم ہے کہ کوئی شے موجود نہیں ہے۔ پس اعراض اپنے وجود کے زمانے کے دوسرے زمانے میں معدوم ہو گئے، اور عدم محال (العدم المحال) کی گرفت میں آ گئے۔ اس کے بعد وہ ہستی کی طرف واپس نہیں لوٹے، بلکہ اللہ ان کی مثالیں پیدا کرتا ہے جو حد اور حقیقت میں ان سے مشابہت رکھتی ہیں، لیکن وہ ان اعیان (الأعیان) کی ذات نہیں ہیں جو الٰہی وسعت (الإتساع الإلٰہی) کی وجہ سے موجود ہوئے اور معدوم ہو گئے۔ پس یہ ماسوی اللہ کی ولایت ہے، یعنی ماسوی اللہ کی اللہ کے لیے مدد ہے۔ اور یہ بشری ولایت (الولایۃ البشریۃ) کے اسرار میں سے ہے، اور اس کا ادراک مشکل ہے، کیونکہ اس کی بنیاد معلومات کے مراتب کے علم پر ہے۔\n\n### [عام بشری ولایت (الولایۃ البشریۃ العامۃ)]\n\nپس جب تم یہ سمجھ لو تو جان لو کہ بشری ولایت (الولایۃ البشریۃ) دو قسموں پر ہے: خاصہ اور عامہ۔ عامہ یہ ہے کہ وہ کائنات میں معلوم مصالح کو عطا کرنے کی اپنی قوت کے ذریعے ایک دوسرے کے ولی بنتے ہیں، پس وہ ایک دوسرے کے لیے مسخر ہیں، اعلیٰ ادنیٰ کے لیے اور ادنیٰ اعلیٰ کے لیے۔ اور کوئی بھی عقل مند اس کا انکار نہیں کر سکتا، کیونکہ یہی حقیقت ہے۔ کیونکہ مراتب میں سب سے اعلیٰ بادشاہ ہے، پس بادشاہ رعایا اور عام لوگوں کے مفادات کے لیے مسخر ہے، اور رعایا اور عام لوگ بادشاہ کے لیے مسخر ہیں۔ پس بادشاہ کا رعایا کو مسخر کرنا رعایا کے حکم سے نہیں ہوتا، بلکہ اس مصلحت کے تقاضے سے ہوتا ہے جو اس کے اپنے لیے ہوتی ہے، اور رعایا ضمنی طور پر فائدہ اٹھاتی ہے، نہ کہ وہ اس فائدے کے لیے مقصود ہوں جو تسخیر سے انہیں حاصل ہوتا ہے۔ اور رعایا کا مسخر ہونا دو طریقوں پر ہے: ایک طریقہ جس میں وہ بادشاہ کے ساتھ شریک ہوتے ہیں، وہ یہ کہ انہیں تسخیر پر صرف اس منفعت کا حصول ابھارتا ہے جو انہیں اس سے حاصل ہوتی ہے، بالکل اسی طرح جیسے بادشاہ کرتا ہے۔ اور دوسرا تسخیر وہ ہے جس پر وہ بادشاہ کے حکم کو تنگی اور آسانی، خوشی اور ناگواری میں قبول کرتے ہیں، اور اس طرح وہ بادشاہوں کے تسخیر سے الگ ہو جاتے ہیں، پس وہ ہمیشہ ذلیل رہتے ہیں، بادشاہوں کی ان کی ضرورت کے باوجود ان کا سر بلند نہیں ہوتا۔ اور یہ عام قسم ہے۔\n\n### [خاص بشری ولایت (الولایۃ البشریۃ الخاصۃ)]\n\nاور خاص قسم وہ ہے جو انہیں ولایت (الولایۃ) کی صورت میں حاصل ہے، جو کہ ان کے محض افعال اور ان کی کائناتوں میں ظاہر ہونے والی چیزوں کے ذریعے بعض اسماء الٰہیہ (الأسماء الإلٰہیۃ) کے احکام کو دوسرے اسماء کے مقابلے میں قبول کرنے میں مدد (النصرۃ) ہے۔ یہ اس لیے ہے کہ وہ اپنے اندر اسماء کے آثار کو قبول کرنے والے ہوتے ہیں۔ پس وہ اس ولایت کے ذریعے حقائق الٰہیہ (الحقائق الإلٰہیۃ) کے منازل پر اترتے ہیں، اور ان کے لیے وہی حکم ہوتا ہے جو اسماء کے لیے ہوتا ہے، ان کی استعداد (الإستعداد) کی بنا پر۔\n\n### [خاص بشری ولایت (الولایۃ البشریۃ الخاصۃ) کے دائرے میں اصحاب احوال (أصحاب الأحوال) اور اصحاب مقامات (أصحاب المقامات)]\n\nاور یہ ولایت اصحاب احوال (أصحاب الأحوال) میں عام لوگوں کے لیے زیادہ ظاہر ہوتی ہے بہ نسبت اصحاب مقامات (أصحاب المقامات) میں اس کے ظاہر ہونے کے، اور یہ اصحاب مقامات میں خاص لوگوں کے لیے زیادہ ظاہر ہوتی ہے بہ نسبت اصحاب احوال میں اس کے ظاہر ہونے کے۔ لیکن اس کا ادراک مشکل ہے، کیونکہ صاحب مقام (صاحب المقام) مسلسل عادت پر ہوتا ہے، اور وہ ہر وقت ہر سانس کے ساتھ متغیر ہوتا رہتا ہے، کیونکہ وہ ہر سانس میں ایک الٰہی شان (شأن إلٰہی) میں ہوتا ہے جس کا علم ہر کسی کو نہیں ہوتا، حالانکہ وہ اسے انجام دے رہا ہوتا ہے جہاں سے اسے شعور نہیں ہوتا، پس اس پر اس کی تعریف نہیں کی جاتی، جبکہ اس خاص (ولایت) پر اس کی تعریف کی جاتی ہے۔ اور صاحب حال (صاحب الحال) خرق عادت (خارق للعادۃ) ہوتا ہے، پس نگاہیں اس کی طرف مائل ہوتی ہیں اور نفوس اس کی طرف متوجہ ہوتے ہیں۔ اور وہ ایک طویل عرصے تک ایک ہی حالت پر ثابت رہتا ہے، اسے اپنے اوپر اس کے تغیر کا شعور نہیں ہوتا، اور اس کی معرفت سے اسے اس سلطنت کی محبت روکتی ہے جو حال نے اسے عطا کی ہے۔ پس وہ صاحب مقام کے بالکل برعکس ہے، اور اگر اسے اپنے مرتبے میں اپنی کمی کا احساس ہوتا تو وہ حال (الحال) کی رغبت نہ کرتا، کیونکہ یہ اس کی جہالت پر دلالت کرتا ہے۔\n\n### [خاص بشری ولایت (الولایۃ البشریۃ الخاصۃ) میں صاحب مقام حال کے مختلف احوال (الأحوال)]\n\nاور اس مقام کے صاحب کے لیے مختلف احوال ہیں، جن میں حال امانت (حال الأمانۃ)، حال دنو (حال الدنو)، حال قرب (حال القرب)، حال کشف (حال الکشف)، حال جمع (حال الجمع)، حال لطف (حال اللطف)، حال قوت (حال القوۃ)، حال حماسہ (حال الحماسۃ)، حال نرمی (حال اللین)، حال پاکیزگی (حال الطیب)، حال صفائی (حال النظافۃ) اور حال ادب (حال الأدب) شامل ہیں۔ پس جب وہ سلطنت میں ظہور الٰہی (التجلی) کرتا ہے تو ریاضت کرتا ہے اور اس کے بارے میں کہا جاتا ہے کہ اس میں سلطان ہے۔ اور جب وہ جلال (الجلال) میں ظہور الٰہی کرتا ہے تو مؤدب ہوتا ہے، پس وہ ادیب ہے۔ اور جمال (الجمال) کے ظہور الٰہی میں وہ صاف ستھرا ہوتا ہے، اور عظمت (العظمۃ) کے ظہور الٰہی میں وہ طاہر، زکی، قدوس ہوتا ہے۔ اور جب وہ پاکیزگی (الطیب) میں ظہور الٰہی کرتا ہے تو اس کی خوشبو کو معطر کر دیتا ہے، اور ہیبت (الہیبۃ) میں اسے سردار بنا دیتا ہے، اور لطف (اللطف) میں اسے پگھلا دیتا ہے، اور حسن (الحسن) میں اسے عشق میں مبتلا کر کے اسے روحانی بنا دیتا ہے۔\n\n### [اولیاء اللہ کے لیے تفریغ (التفریغ)، اقبال (الإقبال)، پردے (الستور) اور حجاب (الحجال)]\n\nپس اولیاء (الأولیاء) کے لیے تفریغ (التفریغ) اور اقبال (الإقبال) ہے، اور ان کے لیے پردے (الستور) اور حجاب (الحجاب) ہیں۔ جب اللہ انہیں قریب کرتا ہے تو ان کی حفاظت کرتا ہے، انہیں چھپاتا ہے اور انہیں پوشیدہ رکھتا ہے، پس وہ مجہول رہتے ہیں۔ اور جب وہ انہیں سزا دیتا ہے—حالانکہ وہ انبیاء نہیں ہیں—تو ان پر خرق عادات (خرق العوائد) ظاہر کرتا ہے، پس وہ پہچانے جاتے ہیں، اور وہ مخلوق کو اللہ سے حجاب میں رکھتے ہیں، حالانکہ انہیں مخلوق کو اللہ کی طرف دعوت دینے کا حکم دیا گیا ہے۔ پس ذات حق (الحق) اولیاء میں سے اصحاب مقامات (أصحاب المقامات) کا مطیع ہوتا ہے اور ان کی بات سننے والا ہوتا ہے۔ ان کے لیے تمام مقامات (المقامات) اور احوال (الأحوال) ہوتے ہیں، اور وہ مردوں میں سے مردانِ کامل ہوتے ہیں، انہیں کوئی عیب لاحق نہیں ہوتا اور نہ ہی ان کے معاملے میں کوئی شک پیدا ہوتا ہے۔ ان کے لیے آخرت خالص ہے جیسا کہ وہ اللہ کے لیے ہے، اور ان کے لیے دنیا ملی جلی ہے جیسا کہ ان کے آقا (سید) کے لیے ہے۔ پس وہ صفات حق (صفات الحق) کے ساتھ ظاہر ہوتے ہیں، اور اسی وجہ سے وہ مجہول رہتے ہیں۔",
    "fa": "باب صد و پنجاه و سوم در معرفت مقام ولایت بشری و اسرار آن\n\nاز صورت حق (الحق)، تمام ولایت او را به دست آوردیم؛ پس ما در نبرد (جهاد) قدم‌هایی راسخ داریم.\nخلافت در دنیا برای ما محقق است، اما در بهشت‌های جاودان احکامی برای آن نیست.\nما همیشه بر نیمی از بهشت‌های خود هستیم، و در تپه چشم (کثیب العین) قدمی نداریم.\nو آن کمال، کمال ذات است که ما را گرد می‌آورد؛ در آن شادمانی به ماست و هیچ رنجی نیست.\nو سرای دنیای تو بیماری‌ها و عافیت است؛ در آن از اوامر سرپیچی می‌شود، در حالی که او بسیار داناست.\nمی‌گوید «انجام بده»، اما سخن او شنیده نمی‌شود؛ و هنگام نقض، از او هیچ تأییدی دیده نمی‌شود.\nاز این رو ما گفتیم، اما سخن ما شنیده نشد؛ و در آن برای خداوند اتقان و استحکام است.\nاگر کسی که گفت «باش» (کن)، با وصف خالقش می‌گفت، ارواح و اجسام برای چشمت آشکار می‌شد.\nاز این رو، از میان الفاظ، لفظ «کن» (باش) اختصاص داده شد؛ که هستی (الوجود) از آن اوست و در هستی (الکون) نیستی (إعدام) نیست.\n\n### [مقابله معقول یا مرتبه میانی بین وجوب هستی (وجوب الوجود) و نیستی مطلق (العدم المطلق)]\n\nولایت بشری همان قول خداوند متعال است: إِنْ تَنْصُرُوا الله (اگر خدا را یاری کنید) و امر او: كُونُوا أَنْصارَ الله (یاری‌کنندگان خدا باشید). پس دانستیم که اگر مقابلی برای هستی (الوجود) حق (الحق) و وجوب هستی (وجوب الوجود) او وجود نداشت که ما را به یاری می‌طلبید تا در قبضه و ملک او بر هستی (الوجود) حق (الحق) باشیم، خداوند به ما نمی‌گفت: كُونُوا أَنْصارَ الله در برابر این مقابلِ منازع. این مرتبه به «مقابله معقوله» شناخته می‌شود. و چون حق تعالی دارای صفت هستی (الوجود) و صفت وجوب هستی (وجوب الوجود) ذاتی است، و مقابل او «نیستی مطلق» (العدم المطلق) نامیده می‌شود و صفتی دارد که به آن «محال» گفته می‌شود، و به دلیل این صفت هرگز هستی (الوجود) را نمی‌پذیرد، پس نصیبی در هستی (الوجود) ندارد، همان‌طور که وجوب هستی (وجوب الوجود) ذاتی نصیبی در نیستی (العدم) ندارد. و چون امر چنین بود، ما در مرتبه میانی قرار گرفتیم که هستی (الوجود) را برای ذات خود می‌پذیریم و نیستی (العدم) را نیز برای ذات خود می‌پذیریم. و ما هرگاه به چیزی روی آوریم، آن چیز در ما حکم می‌کند به آنچه حقیقتش اقتضا می‌کند، و ما ملک او می‌شویم و سلطنتش در ما آشکار می‌گردد.\n\n### [اعیان ثابته (الأعيان الثابتة) که خطاب از دو سوی هستی مطلق (الوجود المطلق) و نیستی مطلق (العدم المطلق) بر آن‌ها واقع می‌شود]\n\nپس نیستی محال (العدم المحال) ما را می‌طلبد که ملک او باشیم، و حق (الحق) که وجوب هستی (وجوب الوجود) ذاتی دارد، ما را می‌طلبد تا ملک او باشیم و سلطنتش در ما آشکار شود. و ما بر حقیقتی هستیم که هر دو وصف را می‌پذیریم، و نسبت ما به نیستی (العدم) نزدیک‌تر است تا به هستی (الوجود). زیرا ما معدوم هستیم، اما به محال (المحال) وصف نشده‌ایم، بلکه وصف ما در آن نیستی (العدم)، امکان است. و آن این است که در توان ما نیست که هستی (الوجود) یا نیستی (العدم) را از خود دور کنیم، اما ما اعیان ثابته (الأعيان الثابتة) متمایزی داریم که خطاب از دو طرف بر آن‌ها واقع می‌شود. پس نیستی (العدم) به ما می‌گوید: بر همان نیستی که هستید بمانید، زیرا شما را شایسته نیست که در مرتبه من باشید. و حق (الحق) به هر عین از اعیان ممکنات می‌گوید: «باش» (کن)، و او را به هستی (الوجود) امر می‌کند. پس ممکن می‌گوید: ما در نیستی (العدم) بودیم، آن را شناختیم و چشیدیم، و امر واجب هستی (الواجب الوجود) به هستی (الوجود) به ما رسیده است، در حالی که ما آن را نمی‌شناسیم و در آن قدمی نداریم. پس بیایید او را بر این محالِ عدمی یاری کنیم تا این هستی (الوجود) را از راه ذوق (چشیدن) بشناسیم. پس آن‌ها به هنگام فرمان «باش» (کن) موجود شدند. و چون در قبضه او قرار گرفتند، پس از آن هرگز به نیستی (العدم) بازنگشتند، به دلیل شیرینی لذت هستی (الوجود)، و رأی خود را ستودند و برکت یاری کردن خداوند بر نیستی محال (العدم المحال) را دیدند.\n\n### [نابود شدن اعراض در زمان دوم از زمان وجودشان]\n\nپس عالم از حیث جوهریت خود، یاری‌کننده خداست، و همیشه یاری شده است. و اعراض آمدند و هستی (الوجود) را پذیرفتند. هنگامی که آن را چشیدند و شناختند، نیستی (العدم) آن‌ها را به سوی خود فراخواند و گفت: بازگشت شما به سوی من است، زیرا شما عرض هستید و بقایی برای شما در هستی (الوجود) نیست، چرا که حقیقت عارض این است که بقایی برایش نیست. پس به امر من بازگردید. به همین دلیل، دلیل عقل دلالت کرد که عرض به خودی خود نابود می‌شود، زیرا فاعل، نیستی (العدم) را ایجاد نمی‌کند، چرا که نیستی حکمی است که شیئی موجود نیست. پس اعراض در زمان دوم از زمان وجودشان نابود شدند و در قبضه نیستی محال (العدم المحال) قرار گرفتند. پس از آن هرگز به هستی (الوجود) بازنگشتند، بلکه خداوند امثال آن‌ها را ایجاد می‌کند که در حد و حقیقت شبیه آن‌ها هستند، اما آن‌ها اعیان همان‌هایی نیستند که موجود شدند و نابود گشتند، به دلیل گستردگی الهی. پس این ولایتِ ماسوی الله است، یعنی یاری کردن ماسوی الله برای خدا. و این از اسرار ولایت بشری است و درک آن دشوار است، زیرا اساس آن بر علم به مراتب معلومات بنا شده است.\n\n### [ولایت بشری عامه]\n\nاگر این را فهمیدی، بدان که ولایت بشری بر دو قسم است: خاصه و عامه. ولایت عامه این است که برخی از انسان‌ها برخی دیگر را یاری می‌کنند، به واسطه آنچه در توانشان از اعطای مصالح معلوم در هستی (الکون) است. پس آن‌ها مسخر یکدیگرند؛ بالاتر برای پایین‌تر و پایین‌تر برای بالاتر. و هیچ عاقلی این را انکار نمی‌کند، زیرا این همان واقعیت است. بالاترین مراتب، پادشاه است. پس پادشاه در مصالح رعایا و مردم عادی مسخر است، و رعایا و مردم عادی مسخر پادشاه هستند. تسخیر پادشاه نسبت به رعایا از روی امر رعایا نیست، بلکه به اقتضای مصلحتی است که برای خودش لازم است، و رعایا به حکم تبعیت از آن بهره‌مند می‌شوند، نه اینکه مقصود اصلی آن انتفاعی باشند که از این تسخیر به آن‌ها بازمی‌گردد. و تسخیر رعایا بر دو وجه است: وجه اول که در آن با پادشاه شریک هستند، این است که آن‌ها را به تسخیر وادار نمی‌کند مگر طلب منفعتی که از آن به خودشان بازمی‌گردد، همان‌طور که پادشاه انجام می‌دهد. و تسخیر دوم، حالتی است که آن‌ها بر آن هستند، یعنی پذیرش امر پادشاه در سختی و آسانی، و در میل و اکراه. و به این واسطه از تسخیر پادشاهان جدا می‌شوند. پس آن‌ها همیشه خوار و فروتن هستند و با وجود نیاز پادشاهان به آن‌ها، سری بلند نمی‌کنند. و این همان قسم عام است.\n\n### [ولایت بشری خاصه]\n\nو اما قسم خاص، آن ولایتی است که برای آن‌هاست و همان نصرت (یاری) در پذیرش برخی از احکام اسماء الهی بر دیگر اسماء، صرفاً به واسطه افعالشان و آنچه در اکوانشان ظاهر می‌شود، به دلیل اینکه آن‌ها پذیرای آثار اسماء در خود هستند. پس با این ولایت، در منازل حقایق الهیه فرود می‌آیند و حکم برای آن‌ها مانند حکمی است که برای اسماء است، به واسطه استعدادی که دارند.\n\n### [اصحاب احوال (أصحاب الأحوال) و اصحاب مقامات (أصحاب المقامات) در دایره ولایت بشری خاصه]\n\nاین ولایت در اصحاب احوال (أصحاب الأحوال) در میان عامه آشکارتر است تا ظهور آن در اصحاب مقامات (أصحاب المقامات). اما در اصحاب مقامات (أصحاب المقامات) در میان خواص، آشکارتر است تا ظهور آن در اصحاب احوال (أصحاب الأحوال). ولی درک آن دشوار است، زیرا صاحب مقام (صاحب المقام) بر عادت مستمر است، در حالی که در هر زمان با هر نفس (دم) متغیر است، زیرا او در هر نفس در شأن الهی است که هیچ کس از آن آگاه نیست، با وجود اینکه او بدون اینکه احساس کند به آن قیام می‌کند. پس بر آن ستایش نمی‌شود. و این خاص (صاحب مقام) بر آن ستایش می‌شود. و صاحب حال (صاحب الحال) خارق عادت است، پس چشم‌ها به سوی او متمایل می‌شوند و نفوس به او روی می‌آورند، و او مدت طولانی بر یک حالت ثابت است و از تغییر آن بر خود آگاه نمی‌شود. و حب او به سلطنتی که حال به او داده است، او را از معرفت آن محجوب می‌سازد. پس او در نقطه مقابل صاحب مقام (صاحب المقام) است. و اگر نقص خود را در مرتبه‌اش احساس می‌کرد، به حال رغبت نمی‌کرد، زیرا حال دلالت بر جهل او دارد.\n\n### [احوال مختلف صاحب مقام حال در ولایت بشری خاصه]\n\nو برای صاحب این مقام احوال مختلفی است، از جمله حال امانت، حال نزدیکی (الدنو)، حال قرب، حال کشف (الکشف)، حال جمع، حال لطف، حال قوت، حال حماسه، حال نرمی (اللين)، حال پاکیزگی (الطيب)، حال نظافت، و حال ادب. پس هرگاه در سلطنت تجلی (التجلی) کند، رام می‌شود و درباره‌اش گفته می‌شود که سلطان است. و هرگاه در جلال تجلی (التجلی) کند، مؤدب می‌شود، پس او ادیب است. و در تجلی (التجلی) جمال، نظیف است. و در تجلی (التجلی) عظمت، طاهر، پاک و قدوس است. و هرگاه در پاکیزگی (الطيب) تجلی (التجلی) کند، عطر او شناخته می‌شود. و در هیبت، او را سید قرار می‌دهد. و در لطف، او را ذوب می‌کند. و در حُسن، عاشق او می‌شود و او را روحانی می‌سازد.\n\n### [تفریغ، اقبال، پرده‌ها (الستور) و حجله‌ها (الحجال) برای اولیاء الله]\n\nپس برای اولیاء تفریغ (فراغت) و اقبال (روی آوردن) است، و برای آن‌ها پرده‌ها (الستور) و حجاب‌ها (الحجاب) است. هرگاه آن‌ها را نزدیک کند، حفظشان می‌کند و می‌پوشاندشان و پنهانشان می‌سازد، پس ناشناخته می‌مانند. و هرگاه آن‌ها را عقوبت کند – و آن‌ها پیامبر نیستند – خرق عادات را بر آن‌ها آشکار می‌سازد، پس شناخته می‌شوند و خلق را از خدا محجوب می‌سازند، در حالی که مأمور به دعوت خلق به سوی خدا هستند. پس حق (الحق) مطیع اصحاب مقامات (أصحاب المقامات) از اولیاء است و شنونده کلام آن‌هاست. تمام مقامات و احوال برای آن‌هاست. آن‌ها مردانِ مرد هستند که عیبی به آن‌ها نمی‌رسد و شکی در آنچه در آن هستند، در آن‌ها راه نمی‌یابد. آخرت برای آن‌ها خالص است، همان‌طور که برای خداست، و دنیای آن‌ها آمیخته است، همان‌طور که برای سیدشان است. پس آن‌ها با صفات حق (الحق) ظاهرند، و به همین دلیل ناشناخته مانده‌اند."
  },
  "page_count": 2
}