{
  "id": 174,
  "title": {
    "ar": "الباب الرابع والسبعون ومائة في معرفة مقام السفر وأسراره",
    "en": "Chapter One Hundred and Seventy-Four: Concerning the Gnosis (معرفة) of the Station of Spiritual Journeying (مقام السفر) and its Mysteries.",
    "ur": "باب ایک سو چوہتر: مقامِ سفر (مقام السفر) اور اس کے اسرار کی معرفت میں۔",
    "fa": "باب صد و هفتاد و چهارم در معرفت مقام سفر و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الرابع والسبعون ومائة في معرفة مقام السفر وأسراره)\n\n\n> إن السفور دليل الخوف والحذر *** هذا هو العرف في الأعراض بالخبر\n\n\n> فإن رأيت فتاة الحي قد سفرت *** فكن فديتك من هذا على حذر\n\n\n> لذا نقول بأن الممكنات على *** أصولها ما لها عين من الصور\n\n\n> ولا تقل بحلول إنها عدم *** وقد يكون لها التكوين في السور\n\n\n### [في وصف أهل الله السائحون‏]\n\n\nقال تعالى في وصف أهل الله السَّائِحُونَ والسياحة الجولان في الأرض على طريق الاعتبار والقربة إلى الله لما في الأنس بالخلق من الوحشة فاعلم أن أهل الله ما طلبوا السياحة في الأرض ولزوم الفقر وسواحل البحار إلا لما غلب عليهم من الأنس بالجنس الذين هم أشكاله من الأناسي وهو وإن كان ذلك الأنس في الظاهر فهو استيحاش في الباطن من حيث لا يشعر طالب السياحة ولا يعلم طالب السياحة أنه ما دعاه إلى ذلك إلا الوحشة إلا بعد وقوفه على ما تنتج له السياحة وذلك أن الله خلق الإنسان الذي هو آدم وكل خليفة على صورته نفى عنه المماثلة فقال إنه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وسرت هذه الحقيقة في الإنسان فإذا جنح إلى الله وتاب استشرفت نفسه على هذه المرتبة أعني نفي المثلية فلما رأى أمثاله من الناس غار أن يكون له مثل كما غار الحق أن يكون ثم من ينسب إليه الألوهية غيره فاستوحش من المخلوقين وطلب الانفراد بذاته من أمثاله حتى لا يبقى له آنس إلا بذاته وحده ولا يرى له مثلا ففر بنفسه إلى الأماكن القاصية عن رؤية أمثاله فلازم الجبال وبطون الأودية وهذه الحالة هي السياحة فأسفرت له هذه السياحة عن مطلوبه فآنس بذاته فذلك تشبهه بمقام قوله لِمَنِ الْمُلْكُ الْيَوْمَ لأنه لم يبق مدع كان يدعي الألوهية موجودا كذلك هذا ما بقي له في الفقر الذي هو فيه من يتسمى بإنسان الذي هو مثله غير الوحش فالوحش وغير الجنس له بمنزلة العالم من الله فلهذا طلب السفر أي المعنى الذي يظهر ما ذكرناه ولهذا المعنى أشار الشبلي حين بات عند بعض إخوانه فسامره الشبلي فقال له صاحبه يا شبلي قم نتعبد فقال له الشبلي العبادة لا تكون بالشركة وكذلك الربوبية لا تكون بالشركة فبقوة الصورة التي خلق الإنسان عليها طلب الفرار من الناس دون غيرهم من المخلوقين ولهذا ما ادعى أحد من الخلق الألوهية إلا هذا الجنس الإنساني فلم يرد السائح أن يرى مثله لهذا الذي ذكرناه هذا مقام هذا السفر\n\n\nوأما السفر في المعقولات بالفكر\n\n\nوفي مراتب المعارف والعلوم فله باب آخر في هذا الكتاب يريد بعد هذا إن شاء الله في باب من أبواب الأحوال فهذه سياحة الخصوص من أهل الله‏\n\n\n### وأما سياحة العموم [من أهل الله‏]\n\n\nمنهم فسبب سياحتهم قوله تعالى يا عِبادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي واسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ فنظروا ما هي أرض الله فقالوا كل أرض موات لا يكون عليها ملك لغير الله فتلك أرضه الخاصة به المضافة إليه البريئة من الشركة فيها البعيدة من المعمور فإن الأرض الميتة القريبة من العمران يمكن أن يصل إليها بعض الناس فيحييها فيملكها بإحيائها والبعيدة من العمران سالمة من هذا التخيل فقالوا ما أمرنا الله بالعبادة فيها إلا ولها خصوص وصف وليس فيها من خصوص الأوصاف إلا كونها ليس فيها نفس لغير الله ففيها نفس الرحمن فإذا عبد الإنسان ربه في مثل هذه الأرض وجد أنسا من تلك الوحشة التي كانت له في العمران ووجد لذة وطيبا في قلبه وانفراده وذلك كله من أثر نفس الرحمن الذي نفس الله به عنه ما كان يجده من الغم والضيق والحرج في الأرض المشتركة فهذا الذي أدى العامة من أهل الله إلى السياحة ثم إنهم رأوا في هذه الأرض من الآيات والعجائب والاعتبارات ما دعاهم إلى النظر فيما ينبغي لما لك هذه الأرض فأنار الله قلوبهم بأنوار العلوم وفتح لهم في النظر في الآيات وهي العلامات الدالة على عظمة من‏\nانقطعوا إليه وهو الله تعالى ورثا نبويا من قوله تعالى سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ ثم قال لِنُرِيَهُ من آياتِنا فعرج به إلى السموات إلى أن بلغ به الإسراء إلى حيث قدره الله له من المنازل العالية فأراه من الآيات ما زاده علما بالله إلى علمه لذا قرن به أنه هو السميع لما خوطب به البصير لما شاهده من الآيات فالسائحون من عباد الله يشاهدون من آيات الله ومن خرق العوائد ما يزيدهم قوة في إيمانهم ونفسهم ومعرفتهم بالله وأنسابه ورحمة بخلقه وشفقة عليهم فإذا رأوا قنة جبل شامخ تذكروا علوا لهم حيث لم يطلبوا من الله إلا الأنفس وهو الانفراد به في خلوة من أشكالهم حذرا من الشغل بسواهم وإذا كانوا في بطن واد أو قاع من القيعان ذكرهم ذلك بعبوديتهم وتواضعهم تحت جبروت سلطان خالقهم فذلوا في أنفسهم وعرفوا مقدارهم وعلموا إن ما ينالونه من الرفعة إنما ذلك عناية الله لا باستحقاق ثم إذا كانوا على ساحل بحر تذكروا بالبحر سعة علم الله وسعة عظمته ورحمته ثم يرون مع هذه العظمة ما تحدث فيه الرياح من تلاطم الأمواج وتداخل بعضها في بعض فيذكرهم ذلك في جناب الحق تعارض الأسماء الإلهية وتداخل بعضها في بعض في تعلقاتها مثل الاسم المنتقم والسريع الحساب والشديد العقاب عند معصية العاصي ويجي‏ء أيضا في مقابلة هذه الأسماء الاسم الغفار والعفو والمحسان فتتقابل الأسماء على هذا العبد العاصي وكذلك التردد الإلهي يعتبرونه في تموج هذا البحر فيفتح لهم في بواطنهم في علوم إلهية لا ينالونها إلا في مشاهدة ذلك البحر في سياحتهم فيكثر منهم التكبير والتعظيم لجناب الله ثم ما يحصل لهم من خرق العوائد في استئناس الوحوش بهم وإقبالهم عليهم وفيهم من تكلمه الوحوش بلسانه وفيهم من يعلم منطقها وترى ما هم عليه من عبادة الله ما يزيدهم ذلك حرصا واجتهادا في طاعة ربهم والحكايات في كتب القوة في ذلك كثيرة جدا ولو لا أن كتابنا هذا مبناه على المعارف والأسرار لسقنا من الحكايات ما شاهدناه بنفوسنا في سياحتنا واجتماعنا بهذه الطائفة وما رأينا فيهم من العجائب وهذا القدر كاف في الغرض المقصود من هذا الباب حتى يرد الكلام إن شاء الله في السفر ومراتبه فيما بعد عند ذكر المسافر والسالك والطريق والله يَهْدِي من يَشاءُ إلى الحق وإِلى‏ طَرِيقٍ مُسْتَقِيمٍ‏\n\n",
    "en": "Indeed, the unveiling (السفور) is a sign of fear and caution;\nThis is the known custom regarding symptoms by report.\nSo if you see the maiden of the tribe unveiled,\nThen be, may I be your ransom, cautious of this.\nTherefore, we say that the contingent things (الممكنات) are, according to\nTheir principles (أصولها), without an essential form (عين من الصور).\nAnd do not speak of indwelling (حلول), for they are non-existence (عدم),\nThough they may have formation (التكوين) within the enclosures (السور).\n\n### Concerning the Description of the People of Allah, the Travelers (السائحون)\n\nAllah the Exalted said in describing the People of Allah: \"The Travelers (السائحون).\" And *siyaha* (spiritual travel) is wandering in the earth by way of contemplation (الاعتبار) and drawing near (القربة) to Allah, because of the alienation (الوحشة) inherent in familiarity (الأنس) with creation (الخلق).\n\nKnow that the People of Allah did not seek *siyaha* in the earth, nor adherence to poverty, nor the shores of the seas, except due to the overwhelming familiarity (الأنس) they felt with their own kind—those who are their forms among humanity (الأناسي). And although that familiarity is apparent, it is alienation (استيحاش) in the inner reality (الباطن), even though the seeker of *siyaha* does not perceive it. Nor does the seeker of *siyaha* know that nothing called him to it except alienation, until after he stands upon what *siyaha* produces for him.\n\nThis is because Allah created the human being, who is Adam and every vicegerent (خليفة), upon His form (صورته). He negated resemblance (المماثلة) from Himself, saying: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). This Reality (الحقيقة) flowed into the human being. So when he inclines toward Allah and repents, his soul aspires to this Level (المرتبة), meaning the negation of resemblance. When he saw his likes among people, he became jealous of having a like, just as The Real (الحق) became jealous that there should be anyone other than Him to whom Divinity (الألوهية) is ascribed. So he became alienated (استوحش) from creatures (المخلوقين) and sought solitude (الانفراد) for his Essence (ذاته) away from his likes, so that he would have no familiarity except with his own Essence alone, and see no like for himself. So he fled with his soul to distant places, far from seeing his likes, adhering to the mountains and the depths of the valleys.\n\nThis state is *siyaha*. This *siyaha* unveiled his objective for him, and he became familiar with his own Essence (ذاته). That is his resemblance to the station of His saying: \"Whose is the Sovereignty (الملك) today?\" because no claimant who claimed Divinity remained existent. Likewise, in the poverty (الفقر) he is in, there remains no one who calls himself 'human'—who is his like—other than the wild beasts (الوحش). The wild beasts and the non-human species are to him in the position of the World (العالم) is to Allah. For this reason, he sought the journey (السفر), meaning the reality that manifests what we have mentioned.\n\nTo this meaning, Al-Shibli alluded when he spent the night with one of his brethren. Al-Shibli kept him company, and his companion said to him, \"O Shibli, let us rise and worship.\" Al-Shibli replied, \"Worship cannot be shared (بالشركة), and likewise, Lordship (الربوبية) cannot be shared.\" Thus, by the strength of the form (الصورة) upon which the human was created, he sought flight from people, but not from other creatures (المخلوقين). And for this reason, no creature has claimed Divinity (الألوهية) except this human species. Therefore, the Traveler (السائح) did not wish to see his like, due to what we have mentioned. This is the station (مقام) of this journey (السفر).\n\nAs for the journey (السفر) in the intelligibles (المعقولات) through contemplation (الفكر), and in the Levels (المراتب) of Gnosis (المعارف) and Sciences (العلوم), it has another chapter in this book, which he intends to place after this, God willing, in one of the chapters concerning the Spiritual States (الأحوال). This, then, is the *siyaha* of the elite (الخصوص) among the People of Allah.\n\n### As for the *Siyaha* of the Commonalty [among the People of Allah]\n\nThe reason for their *siyaha* is His saying, the Exalted: <<يا عِبادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي واسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ>> (O My servants who have believed, indeed My earth is vast, so worship Me alone). So they looked into what the earth of Allah is, and they said: Every desolate land (أرض موات) upon which no one but Allah has ownership (ملك)—that is His earth, specific to Him, attributed to Him, free from partnership (الشركة) therein, and far from civilization (المعمور). For the dead land near civilization can be reached by some people who revive it and thus own it by reviving it. But the land far from civilization is safe from this conjecture.\n\nThey said: Allah did not command us to worship in it unless it possessed a specific quality, and there is no specific quality in it except that there is no breath (نفس) in it belonging to anyone other than Allah; rather, the Breath of the All-Merciful (نفس الرحمن) is in it. When the human being worships his Lord in such a land, he finds familiarity (أنسا) away from the alienation (الوحشة) he experienced in civilization, and he finds pleasure and goodness in his heart and in his solitude (انفراده). And all of that is from the effect of the Breath of the All-Merciful (نفس الرحمن), by which Allah relieved him of the sorrow, distress, and constraint he found in the shared land.\n\nThis is what led the commonalty (العامة) of the People of Allah to *siyaha*. Then, in this land, they saw signs (الآيات), wonders, and contemplations (الاعتبارات) that called them to reflect upon what is fitting for the Owner of this earth. So Allah illuminated their hearts with the lights of the Sciences (العلوم) and opened for them the contemplation of the signs (الآيات)—which are the indicators pointing to the Magnificence of the One to whom they devoted themselves, who is Allah the Exalted.\n\nAnd they inherited a prophetic legacy from His saying, the Exalted: <<سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ>> (Glory be to Him Who took His servant on a night journey), and then He said: <<لِنُرِيَهُ من آياتِنا>> (that We might show him some of Our signs). So He ascended with him through the heavens until the Night Journey (الإسراء) reached the high stations (المنازل العالية) that Allah decreed for him, and He showed him signs (الآيات) that increased his Knowledge (العلم) of Allah beyond his existing knowledge. Therefore, He coupled with this that He is the All-Hearing (السميع) of what was addressed to him, and the All-Seeing (البصير) of the signs (الآيات) he witnessed.\n\nThus, the Travelers (السائحون) among the servants of Allah witness signs of Allah and breaches of custom (خرق العوائد) that increase them in strength in their faith, their souls, their Gnosis (معرفتهم) of Allah, their lineage, their mercy toward His creation, and their compassion for them. When they see the peak of a towering mountain, they remember their own elevation, since they sought nothing from Allah except the souls—which is solitude (الانفراد) with Him in retreat, away from their likes, cautious of being preoccupied with others. And when they are in the depth of a valley or a low plain, that reminds them of their servitude (عبوديتهم) and their humility beneath the Omnipotence (جبروت) of the Sovereign of their Creator. So they become humble in their souls, recognize their measure, and know that the elevation they attain is only by the Providence of Allah, not by merit.\n\nThen, when they are on a seashore, the sea reminds them of the vastness of Allah’s Knowledge (علم), the vastness of His Magnificence, and His Mercy. Then, alongside this Magnificence, they see the clashing of waves caused by the winds and their intermingling, which reminds them, in the Divine Presence (جناب الحق), of the conflict of the Divine Names (الأسماء الإلهية) and their intermingling in their relations. Such as the Name The Avenger (المنتقم), The Swift in Reckoning (السريع الحساب), and The Severe in Punishment (الشديد العقاب) when the disobedient one sins. And also, in opposition to these Names, comes the Name The Forgiving (الغفار), The Pardoner (العفو), and The Benefactor (المحسان). Thus, the Names confront this disobedient servant. Likewise, they contemplate the Divine Hesitation (التردد الإلهي) in the surging of this sea, and this opens up for them, in their inner realities, Divine Sciences (علوم إلهية) that they would not attain except by witnessing that sea during their *siyaha*. So they frequently pronounce the magnification (*takbir*) and glorification of the Divine Presence (جناب الله).\n\nFurthermore, the breaches of custom (خرق العوائد) that occur for them, such as the wild beasts becoming familiar with them and approaching them—among them are those to whom the beasts speak in their own tongue, and among them are those who know their speech. And seeing the devotion to Allah that these beasts maintain increases the travelers’ eagerness and striving in the obedience of their Lord. The stories regarding this in the books of spiritual power are very numerous. Were it not that the foundation of this book of ours is based upon Gnosis (المعارف) and Secrets (الأسرار), we would have recounted the stories we witnessed ourselves during our *siyaha* and our meetings with this group, and the wonders we saw among them.\n\nThis much is sufficient for the intended purpose of this chapter, until the discussion returns, God willing, to the journey (السفر) and its Levels (مراتبه) later, when mentioning the traveler (المسافر), the seeker (السالك), and the path (الطريق). And Allah <<يَهْدِي من يَشاءُ إلى الحق وإِلى‏ طَرِيقٍ مُسْتَقِيمٍ>> (guides whom He wills to the Truth and to a straight path).",
    "ur": "(باب نمبر ایک سو چوہتر: مقامِ سفر اور اس کے اسرار کی معرفت میں)\n\nبے شک، پردہ ہٹانا (السفور) خوف اور احتیاط کی دلیل ہے،\nیہ ہی خبروں میں عوارض (عارضی چیزوں) کے بارے میں معروف ہے۔\nپس اگر تم نے محلے کی لڑکی کو بے پردہ دیکھا،\nتو میں تم پر قربان، اس سے ہوشیار رہنا۔\nاسی لیے ہم کہتے ہیں کہ ممکنات (الممكنات) اپنی\nاصلوں پر ہیں، ان کے لیے صورتوں (الصور) میں کوئی عین (حقیقت) نہیں۔\nاور حلول (حلول) کا قول نہ کرو، کیونکہ وہ عدم ہیں،\nاور ہو سکتا ہے کہ ان کے لیے سورتوں (حدود) میں تکوین (تخلیق) ہو۔\n\n### [اہلِ اللہ میں سے سیاحت کرنے والوں کا بیان]\n\nاللہ تعالیٰ نے اہلِ اللہ (أهل الله) کی صفت میں فرمایا: \"السَّائِحُونَ\" (سیاحت کرنے والے)۔ اور سیاحت (السياحة) زمین میں عبرت اور اللہ کے قرب کی راہ پر گھومنا ہے، کیونکہ مخلوق سے اُنس (الأنس) میں وحشت (الوحشة) پائی جاتی ہے۔ پس جان لو کہ اہلِ اللہ نے زمین میں سیاحت، فقر کو لازم پکڑنے، اور سمندروں کے ساحلوں کو اختیار کرنے کا مطالبہ صرف اس لیے کیا کہ ان پر ان کی جنس (انسانوں) سے اُنس غالب آ گیا تھا جو ان کی شکلیں ہیں۔ اور اگرچہ یہ اُنس ظاہر میں ہوتا ہے، لیکن باطن میں یہ وحشت (استیحاش) ہے، جہاں سے سیاحت کا طالب شعور نہیں رکھتا۔ اور سیاحت کا طالب یہ نہیں جانتا کہ اسے اس کی طرف وحشت کے سوا کسی چیز نے نہیں بلایا، مگر اس کے بعد جب وہ اس نتیجے پر پہنچتا ہے جو سیاحت اسے دیتی ہے۔\n\nاور یہ اس لیے ہے کہ اللہ نے انسان کو، جو آدم ہے اور ہر خلیفہ ہے، اپنی صورت پر پیدا کیا، اور اس سے مماثلت کی نفی کی، پس فرمایا: **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (اس کی مانند کوئی چیز نہیں ہے)۔ اور یہ حقیقت انسان میں سرایت کر گئی۔ پس جب وہ اللہ کی طرف مائل ہوتا ہے اور توبہ کرتا ہے، تو اس کا نفس اس مرتبے کی طرف جھکتا ہے، یعنی مماثلت کی نفی۔ پس جب وہ اپنے جیسے لوگوں کو دیکھتا ہے، تو اسے غیرت آتی ہے کہ اس کا کوئی مثل ہو، جیسا کہ ذات حق (الحق) کو غیرت آئی کہ اس کے سوا کوئی اور ہو جسے الوہیت منسوب کی جائے۔ پس وہ مخلوق سے وحشت محسوس کرتا ہے اور اپنے جیسے لوگوں سے اپنی ذات کے لیے انفرادیت طلب کرتا ہے، تاکہ اسے صرف اپنی ذات کے ساتھ ہی اُنس رہے اور وہ اپنا کوئی مثل نہ دیکھے۔\n\nپس وہ اپنی جان لے کر اپنے جیسے لوگوں کو دیکھنے سے دور، دور دراز مقامات کی طرف بھاگتا ہے، اور پہاڑوں اور وادیوں کے اندرونی حصوں کو لازم پکڑتا ہے۔ اور یہی حالت سیاحت (السياحة) ہے۔ پس اس سیاحت نے اس کے مطلوب کو اس پر ظاہر کر دیا، اور اسے اپنی ذات سے اُنس ہو گیا۔ یہ اس کے اس مقام سے مشابہت ہے جہاں فرمایا گیا: **لِمَنِ الْمُلْكُ الْيَوْمَ** (آج بادشاہت کس کی ہے؟)، کیونکہ کوئی مدعی جو الوہیت کا دعویٰ کرتا تھا، موجود نہیں رہا۔ اسی طرح، اس فقر میں جو اسے حاصل ہے، اس کے لیے کوئی ایسا شخص باقی نہیں رہتا جو انسان کہلاتا ہو جو اس کا مثل ہو، سوائے وحشی جانوروں کے۔ پس وحشی جانور اور غیر جنس اس کے لیے اللہ کے مقابلے میں عالم کی مانند ہیں۔ اسی لیے اس نے سفر (السفر) کو طلب کیا، یعنی وہ معنی جو ہم نے بیان کیا اسے ظاہر کرے۔\n\nاور اسی معنی کی طرف شبلی نے اشارہ کیا جب وہ اپنے بعض بھائیوں کے پاس رات کو ٹھہرے، تو شبلی نے ان سے گفتگو کی۔ اس کے ساتھی نے اس سے کہا: اے شبلی، اٹھو ہم عبادت کریں۔ تو شبلی نے اسے جواب دیا: عبادت شراکت سے نہیں ہوتی، اور اسی طرح ربوبیت بھی شراکت سے نہیں ہوتی۔ پس اس صورت کی قوت کی وجہ سے جس پر انسان کو پیدا کیا گیا، اس نے دوسرے مخلوقات کے بجائے لوگوں سے فرار طلب کیا۔ اور اسی وجہ سے مخلوق میں سے کسی نے بھی الوہیت کا دعویٰ نہیں کیا سوائے اس انسانی جنس کے۔ پس سیاحت کرنے والا نہیں چاہتا کہ وہ اپنا مثل دیکھے، اس وجہ سے جو ہم نے بیان کی۔ یہ اس سفر کا مقام ہے۔\n\nاور جہاں تک معقولات میں فکر کے ذریعے سفر (السفر) کا تعلق ہے، اور معارف (المعارف) اور علوم کے مراتب میں سفر کا، تو اس کتاب میں اس کے لیے ایک اور باب ہے، جو انشاء اللہ اس کے بعد احوال کے ابواب میں سے کسی باب میں آئے گا۔ پس یہ اہلِ اللہ (أهل الله) کے خواص کی سیاحت ہے۔\n\n### اور جہاں تک اہلِ اللہ کے عوام کی سیاحت کا تعلق ہے\n\nتو ان کی سیاحت کا سبب اللہ تعالیٰ کا یہ فرمان ہے: **يا عِبادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي واسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ** (اے میرے وہ بندو جو ایمان لائے ہو، بے شک میری زمین وسیع ہے، پس صرف میری ہی عبادت کرو)۔ پس انہوں نے غور کیا کہ اللہ کی زمین کیا ہے؟ تو انہوں نے کہا: ہر وہ بنجر زمین جس پر اللہ کے سوا کسی اور کی ملکیت نہ ہو، وہ اس کی خاص زمین ہے جو اس کی طرف منسوب ہے، جو شراکت سے پاک ہے، اور آبادی سے دور ہے۔ کیونکہ آبادی کے قریب کی بنجر زمین تک بعض لوگ پہنچ سکتے ہیں اور اسے آباد کر کے اس کی ملکیت حاصل کر سکتے ہیں، لیکن آبادی سے دور کی زمین اس وہم سے محفوظ ہے۔ پس انہوں نے کہا: اللہ نے ہمیں اس میں عبادت کا حکم نہیں دیا مگر اس لیے کہ اس کی کوئی خاص صفت ہے۔ اور اس میں خاص صفات میں سے صرف یہ ہے کہ اس میں اللہ کے سوا کسی اور کا نَفَس (نفس) نہیں ہے، بلکہ اس میں نَفَسِ رحمن (نفس الرحمن) ہے۔ پس جب انسان ایسی زمین میں اپنے رب کی عبادت کرتا ہے، تو اسے اس وحشت سے اُنس ملتا ہے جو اسے آبادی میں تھی، اور وہ اپنے دل میں اور اپنی انفرادیت میں لذت اور پاکیزگی پاتا ہے۔ اور یہ سب نَفَسِ رحمن (نفس الرحمن) کا اثر ہے، جس کے ذریعے اللہ نے اس غم، تنگی اور حرج کو دور کیا جو وہ مشترکہ زمین میں محسوس کرتا تھا۔\n\nپس یہی وہ چیز ہے جس نے اہلِ اللہ کے عوام کو سیاحت کی طرف مائل کیا۔ پھر انہوں نے اس زمین میں ایسی آیات (الآيات)، عجائبات اور عبرتیں دیکھیں جنہوں نے انہیں اس بات پر غور کرنے کی دعوت دی کہ اس زمین کے مالک کے لیے کیا مناسب ہے۔ پس اللہ نے ان کے دلوں کو علوم کے انوار سے منور کر دیا اور ان کے لیے آیات (الآيات) میں غور و فکر کے دروازے کھول دیے، جو اس ذات کی عظمت پر دلالت کرنے والی نشانیاں ہیں جس کی طرف انہوں نے خود کو منقطع کر لیا ہے، اور وہ اللہ تعالیٰ ہے۔ اور یہ ایک نبوی میراث ہے اللہ تعالیٰ کے اس فرمان سے: **سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ** (پاک ہے وہ ذات جو اپنے بندے کو لے گئی) پھر فرمایا: **لِنُرِيَهُ مِنْ آياتِنا** (تاکہ ہم اسے اپنی کچھ نشانیاں دکھائیں)۔ پس اسے آسمانوں کی طرف عروج کرایا گیا یہاں تک کہ اسراء اسے ان بلند منازل تک لے گیا جو اللہ نے اس کے لیے مقدر کی تھیں، اور اسے ایسی آیات دکھائیں جنہوں نے اس کے علم میں اللہ کے بارے میں مزید اضافہ کیا۔ اسی لیے اس کے ساتھ یہ بات جوڑی گئی کہ وہ سننے والا ہے اس بات کو جو اس سے مخاطب کی گئی، اور دیکھنے والا ہے ان آیات کو جن کا اس نے مشاہدہ کیا۔\n\nپس اللہ کے بندوں میں سے سیاحت کرنے والے اللہ کی آیات (الآيات) اور خرقِ عادات کا مشاہدہ کرتے ہیں جو ان کے ایمان، ان کے نفس، اللہ کی معرفت (المعرفۃ)، اس کے نسبوں، اور اس کی مخلوق پر رحم اور شفقت میں اضافہ کرتا ہے۔ پس جب وہ کسی بلند پہاڑ کی چوٹی دیکھتے ہیں، تو انہیں اپنی بلندی یاد آتی ہے، کیونکہ انہوں نے اللہ سے صرف انفس (انفرادیت) طلب کی، اور وہ یہ ہے کہ اپنے جیسے لوگوں سے خلوت میں اس کے ساتھ تنہا رہیں، تاکہ اس کے سوا کسی اور کے ساتھ مشغول ہونے سے بچیں۔ اور جب وہ کسی وادی کے اندر یا کسی میدان میں ہوتے ہیں، تو یہ انہیں ان کی عبودیت (العبودية) اور اپنے خالق کے جبروتِ سلطان کے سامنے ان کی عاجزی یاد دلاتا ہے۔ پس وہ اپنے نفوس میں ذلیل ہوتے ہیں اور اپنی قدر و منزلت کو پہچانتے ہیں، اور جانتے ہیں کہ جو رفعت انہیں حاصل ہوتی ہے وہ صرف اللہ کی عنایت سے ہے نہ کہ استحقاق سے۔\n\nپھر جب وہ سمندر کے ساحل پر ہوتے ہیں، تو سمندر کے ذریعے اللہ کے علم کی وسعت، اس کی عظمت اور اس کی رحمت کی وسعت کو یاد کرتے ہیں۔ پھر وہ اس عظمت کے ساتھ یہ بھی دیکھتے ہیں کہ ہواؤں سے جو لہروں کا ٹکراؤ اور ایک دوسرے میں داخل ہونا پیدا ہوتا ہے، تو یہ انہیں ذات حق (الحق) میں اسماء الٰہیہ (الأسماء الإلهية) کے تعارض اور ان کے تعلقات میں ایک دوسرے میں داخل ہونے کو یاد دلاتا ہے، جیسے کہ گناہ گار کی نافرمانی کے وقت اسم المنتقم (انتقام لینے والا)، السریع الحساب (جلد حساب لینے والا)، اور الشدید العقاب (سخت سزا دینے والا)۔ اور ان اسماء کے مقابلے میں اسم الغفار (بخشنے والا)، العفو (معاف کرنے والا)، اور المحسان (احسان کرنے والا) بھی آتا ہے۔ پس یہ اسماء اس گناہ گار بندے پر ایک دوسرے کے مقابل آتے ہیں۔ اور اسی طرح وہ اس سمندر کی لہروں میں ترددِ الٰہی کو بھی عبرت کے طور پر دیکھتے ہیں، تو ان کے باطن میں ایسے الٰہی علوم کے دروازے کھلتے ہیں جو انہیں اپنی سیاحت میں اس سمندر کے مشاہدے کے بغیر حاصل نہیں ہو سکتے۔ پس وہ اللہ کی جناب میں کثرت سے تکبیر اور تعظیم کرتے ہیں۔\n\nپھر جو خرقِ عادات انہیں حاصل ہوتے ہیں، جیسے وحشی جانوروں کا ان سے مانوس ہونا اور ان کی طرف متوجہ ہونا، اور ان میں سے بعض ایسے ہیں جن سے وحشی جانور ان کی زبان میں بات کرتے ہیں، اور ان میں سے بعض ایسے ہیں جو ان کی بولی جانتے ہیں۔ اور جو عبادتِ الٰہی وہ کرتے ہیں، وہ ان کے رب کی اطاعت میں ان کی حرص اور کوشش کو مزید بڑھا دیتی ہے۔ اور اس بارے میں قوت کی کتابوں میں حکایات بہت زیادہ ہیں۔ اور اگر ہماری اس کتاب کی بنیاد معارف (المعارف) اور اسرار پر نہ ہوتی، تو ہم وہ حکایات بھی بیان کرتے جن کا ہم نے اپنی سیاحت میں اور اس گروہ سے ملاقات میں خود مشاہدہ کیا، اور جو عجائبات ہم نے ان میں دیکھے۔ اور یہ مقدار اس باب کے مقصود کے لیے کافی ہے، تاکہ انشاء اللہ سفر (السفر) اور اس کے مراتب کے بارے میں کلام بعد میں آئے جب مسافر، سالک، اور طریق کا ذکر ہو گا۔ اور اللہ جسے چاہتا ہے حق کی طرف اور **إِلى‏ طَرِيقٍ مُسْتَقِيمٍ** (سیدھے راستے کی طرف) ہدایت دیتا ہے۔",
    "fa": "باب صد و هفتاد و چهارم در معرفت مقام سفر و اسرار آن\n\nهمانا آشکار شدن (السفور) نشانه ترس و احتیاط است\nاین است عرف در عوارض به واسطه خبر\n\nپس اگر دیدی دوشیزه قبیله پرده برداشت (سفرت)\nفدایت شوم، از این امر بر حذر باش\n\nاز این رو می‌گوییم که ممکنات بر\nاصول خود، هیچ عینی از صورت‌ها ندارند\n\nو به حلول (حلول) قائل مشو، زیرا آن‌ها عدم هستند\nو شاید برایشان تکوین در صورت‌ها باشد\n\n### [در وصف اهل الله سیاحت‌کننده]\n\nخداوند متعال در وصف اهل الله (السَّائِحُونَ) می‌فرماید: و سیاحت، گشت و گذار در زمین به طریق عبرت و تقرب به سوی خداست، به دلیل وحشتی که در انس با خلق وجود دارد. پس بدان که اهل الله سیاحت در زمین و ملازمت فقر و سواحل دریاها را نطلبیدند، مگر به دلیل غلبه انسی که با جنس خودشان، یعنی انسان‌هایی که شبیه آن‌ها هستند، داشتند. و این انس، اگرچه در ظاهر است، اما در باطن نوعی وحشت است، به طوری که طالب سیاحت متوجه نمی‌شود و نمی‌داند که او را به این کار نخوانده مگر وحشت، مگر پس از وقوف بر آنچه سیاحت برای او به بار می‌آورد.\n\nو این بدان سبب است که خداوند انسان را که آدم است و هر خلیفه‌ای را بر صورت خود آفرید، و مماثلت را از خود نفی کرد و فرمود: «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی مانند او نیست). و این حقیقت در انسان جاری شد. پس هنگامی که به سوی خدا متمایل شد و توبه کرد، نفس او به این مرتبه، یعنی نفی مثل بودن، مشرف شد. پس چون امثال خود را از مردم دید، غیرت ورزید که برای او مثلی باشد، همان‌طور که حق (الحق) غیرت ورزید که کسی جز او الوهیت را به خود نسبت دهد. پس از مخلوقات وحشت کرد و طلب انفراد به ذات خود از امثال خویش نمود تا جز به ذات یگانه خود مأنوس نباشد و مثلی برای خود نبیند. پس با جان خود به مکان‌های دور از دیدن امثال خود گریخت و ملازم کوه‌ها و بطن دره‌ها شد. و این حالت همان سیاحت است. پس این سیاحت مطلوب او را آشکار ساخت و به ذات خود انس گرفت. این تشبه او به مقام قول خداوند است: «لِمَنِ الْمُلْكُ الْيَوْمَ» (امروز فرمانروایی از آن کیست؟)، زیرا هیچ مدعی الوهیتی باقی نمانده بود. همچنین برای این شخص در فقری که در آن است، کسی که به نام انسان خوانده شود و مثل او باشد، جز وحوش باقی نمانده است. پس وحوش و غیر جنس او، برای او به منزله عالَم برای خدا هستند. به همین دلیل سفر را طلب کرد، یعنی معنایی که آنچه را ذکر کردیم آشکار می‌سازد.\n\nو شبلی به همین معنا اشاره کرد، هنگامی که نزد یکی از برادرانش شب را گذراند. شبلی با او شب‌نشینی کرد. صاحبش به او گفت: ای شبلی، برخیز تا عبادت کنیم. شبلی به او گفت: عبادت با شراکت (شرکه) صورت نمی‌گیرد، و همچنین ربوبیت با شراکت صورت نمی‌گیرد. پس به نیروی صورتی که انسان بر آن آفریده شده است، فرار از مردم را طلب کرد نه از دیگر مخلوقات. و به همین دلیل هیچ‌کس از مخلوقات ادعای الوهیت نکرد مگر همین جنس انسانی. پس سالک (السائح) نمی‌خواهد مثل خود را ببیند به دلیل آنچه ذکر کردیم. این مقام این سفر است.\n\nو اما سفر در معقولات به واسطه فکر، و در مراتب معارف (المعرفة) و علوم، بابی دیگر در این کتاب دارد که ان‌شاءالله پس از این در بابی از ابواب احوال خواهد آمد. پس این سیاحت خواص از اهل الله است.\n\n### و اما سیاحت عموم [از اهل الله]\n\nسبب سیاحت آنان قول خداوند متعال است: «يا عِبادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي واسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ» (ای بندگان من که ایمان آورده‌اید، همانا زمین من وسیع است، پس تنها مرا بپرستید). پس نگریستند که زمین خدا چیست؟ گفتند: هر زمین مرده‌ای که بر آن مالکی جز خدا نباشد، آن زمین خاص اوست که به او اضافه شده و از شراکت در آن مبرا و از آبادی دور است. زیرا زمین مرده نزدیک به آبادی ممکن است کسی به آن برسد و آن را احیا کند و با احیای آن مالک شود، اما زمین دور از آبادی از این تصور سالم است. پس گفتند: خداوند ما را به عبادت در آن امر نکرده مگر به دلیل وصف خاصی که دارد، و از خصوصیات اوصاف آن نیست مگر اینکه در آن نفسی جز برای خدا نیست، پس در آن نفس رحمان است.\n\nپس هنگامی که انسان پروردگارش را در چنین زمینی عبادت کند، انسی از آن وحشتی که در آبادی داشت می‌یابد و در قلب و انفراد خود لذت و طراوتی می‌یابد. و همه این‌ها از اثر نفس رحمان است که خداوند به واسطه آن، غم و تنگی و حرجی را که در زمین مشترک می‌یافت، از او برطرف ساخت. این همان چیزی است که عامه اهل الله را به سیاحت سوق داد. سپس در این زمین از آیات (آیات) و عجایب و عبرت‌ها دیدند که آن‌ها را به نظر در آنچه شایسته مالک این زمین است فراخواند. پس خداوند قلب‌هایشان را به انوار علوم روشن ساخت و برایشان در نظر در آیات (آیات) گشود، که همان نشانه‌های دال بر عظمت کسی است که به او پیوسته‌اند، یعنی خداوند متعال.\n\nو میراثی نبوی از قول خداوند متعال: «سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ» (پاک و منزه است آن کس که بنده‌اش را شبانه سیر داد)، سپس فرمود: «لِنُرِيَهُ مِنْ آياتِنا» (تا برخی از آیات خود را به او نشان دهیم). پس او را به آسمان‌ها عروج داد تا جایی که اسراء او را به منازل عالیه‌ای که خداوند برایش مقدر کرده بود رساند. پس از آیات (آیات) به او نشان داد که علم او را به خدا افزود. از این رو، این را قرین ساخت که او شنونده آنچه مورد خطاب قرار گرفت و بیننده آنچه از آیات (آیات) مشاهده کرد، است.\n\nپس سیاحت‌کنندگان از بندگان خدا، از آیات (آیات) الهی و خرق عادات، چیزهایی مشاهده می‌کنند که بر قوت ایمان و نفس و معرفت (المعرفة) آن‌ها به خدا و انساب او و رحمتشان بر خلق و شفقتشان بر آنان می‌افزاید. پس هنگامی که قله کوهی سر به فلک کشیده را می‌بینند، علوّ خود را به یاد می‌آورند، زیرا از خدا جز انفس (انفراد) نخواستند، که همان انفراد با او در خلوت از امثال خود است، به دلیل احتراز از مشغول شدن به غیر او. و هنگامی که در بطن دره‌ای یا گودی از گودی‌ها باشند، این امر عبودیت و تواضع آن‌ها را تحت جبروت سلطان خالقشان به یادشان می‌آورد. پس در نفس خود خوار می‌شوند و قدر خود را می‌شناسند و می‌دانند که هر رفعتی که به دست می‌آورند، تنها عنایت خداست نه به استحقاق.\n\nسپس هنگامی که بر ساحل دریا باشند، به واسطه دریا، وسعت علم خدا و وسعت عظمت و رحمت او را به یاد می‌آورند. سپس با این عظمت، آنچه را که بادها در آن ایجاد می‌کنند، از تلاطم امواج و تداخل برخی در برخی دیگر می‌بینند. این امر در ساحت حق (الحق)، تعارض اسماء الهی و تداخل برخی در برخی دیگر را در تعلقاتشان به یادشان می‌آورد، مانند اسم المنتقم (انتقام‌گیرنده)، السریع الحساب (سریع در حساب) و الشدید العقاب (سخت‌کیفر) هنگام معصیت گناهکار، و همچنین در مقابل این اسماء، اسم الغفار (بسیار آمرزنده)، العفو (بخشاینده) و المحسان (نیکوکار) می‌آید. پس اسماء بر این بنده گناهکار متقابل می‌شوند. و همچنین تردد الهی را در موج‌خیز بودن این دریا در نظر می‌گیرند. پس در بواطنشان علوم الهی برایشان گشوده می‌شود که جز در مشاهده آن دریا در سیاحتشان به آن‌ها دست نمی‌یابند. پس تکبیر و تعظیم برای ساحت خدا از آن‌ها بسیار می‌شود.\n\nسپس آنچه از خرق عادات برایشان حاصل می‌شود، در انس گرفتن وحوش با آن‌ها و روی آوردنشان به ایشان است. و در میان آن‌ها کسانی هستند که وحوش با زبان خود با آن‌ها سخن می‌گویند، و کسانی هستند که منطق آن‌ها را می‌دانند. و آنچه را که آن‌ها بر آن از عبادت خدا هستند، می‌بینی که بر حرص و کوشششان در طاعت پروردگارشان می‌افزاید. و حکایات در کتب قوت در این باره بسیار زیاد است. و اگر بنای این کتاب ما بر معارف (المعرفة) و اسرار نبود، حکایاتی را که خودمان در سیاحت و ملاقات با این طایفه مشاهده کرده‌ایم و عجایبی که در آن‌ها دیده‌ایم، نقل می‌کردیم. و این مقدار برای غرض مقصود از این باب کافی است تا ان‌شاءالله سخن در باب سفر و مراتب آن در آینده، هنگام ذکر مسافر و سالک و طریق، بیاید. و خداوند هر که را بخواهد به سوی حق (الحق) و «إِلى‏ طَرِيقٍ مُسْتَقِيمٍ» (به سوی راه راست) هدایت می‌کند."
  },
  "page_count": 2
}