{
  "id": 245,
  "title": {
    "ar": "الباب الخامس والأربعون ومائتان في الحضور",
    "en": "Chapter Two Hundred and Forty-Five, Concerning Presence (الحضور)",
    "ur": "پینتالیسواں اور دو سوواں باب: حضور (الحضور) کے بیان میں",
    "fa": "باب دویست و چهل و پنجم در حضور"
  },
  "content": {
    "ar": "## «الباب الخامس والأربعون ومائتان في الحضور»\n\n\nوهو الحضور مع الله جل ثناؤه وتقدست أسماؤه مع الغيبة هكذا هو عند القوم‏\n\n\n> حضوري مع الحق في غيبتي *** حضوري به فهو الحاضر\n> هو الباطن الحق في غيبتي *** وعند حضوري هو الظاهر\n\n\n> فإن فته فأنا أول *** وإن فاتني فأنا الآخر\n\n\nاعلم أنه لا تكون غيبة إلا بحضور فغيبتك من تحضر معه لقوة سلطان المشاهدة كما أن سلطان البقاء يفنيك لأنه صاحب الوقت والحكم والتفصيل في الحضور في أهله كما ذكرناه في الغيبة سواء فكل غائب حاضر وكل حاضر غائب لأنه لا يتصور الحضور مع المجموع وإنما هو مع آحاد المجموع لأن أحكام الأسماء والأعيان تختلف والحكم للحاضر فلو حضر بالمجموع لتقابلت وأدى إلى التمانع وفسد الأمر فلا يصح الحضور مع المجموع لا عند من يرى حضوره بحق ولا عند من يرى حضوره بخلق فإن حكم الأعيان مثل حكم الأسماء في التقابل والاختلاف وظهور السلطان فتدبر ما ذكرناه تجد العلم إن شاء الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 245: On Presence (الحضور)\n\nThis Presence (الحضور) is being with Allah, glorious is His praise and sanctified are His Names, simultaneously with Absence (غيبة). This is the understanding held by the People [the Sufis].\n\n> My presence with The Real (الحق) is in my absence (غيبتي),\n> My presence is through Him, for He is the Present One (الحاضر).\n> He is The Inner (الباطن), The Real, in my absence,\n> And when I am present, He is The Outer (الظاهر).\n\n> If I precede Him, then I am the First (أول),\n> And if He precedes me, then I am the Last (الآخر).\n\nKnow that there is no Absence (غيبة) except through Presence (حضور). Your absence is from the one with whom you are present, due to the overwhelming power (سلطان) of the Witnessing (المشاهدة). This is just as the sovereignty of Subsistence (البقاء) annihilates you (يفنيك), because it [Subsistence] is the master of the moment, the ruling, and the detailed manifestation in the Presence among its people, exactly as we mentioned concerning Absence.\n\nThus, every absent one is present, and every present one is absent. This is because Presence cannot be conceived with the totality (المجموع); rather, it is only with the individuals (آحاد) of the totality. This is because the rulings (أحكام) of the Names (الأسماء) and the Entities (الأعيان) differ, and the ruling belongs to the Present One. If one were present with the totality, they [the rulings] would oppose each other, leading to mutual exclusion (التمانع), and the matter would be corrupted. Therefore, Presence with the totality is not valid, neither according to those who see their presence through The Real (بحق) nor according to those who see their presence through creation (بخلق). For the ruling of the Entities is like the ruling of the Names in terms of opposition, difference, and the manifestation of sovereignty.\n\nPonder what we have mentioned, and you will find the Knowledge (العلم), if God wills. And Allah speaks the Truth (الحق), and He guides to the Way (السبيل).",
    "ur": "باب نمبر دو سو پینتالیس: حضور (Al-Ḥuḍūr) کے بیان میں\n\nیہ حضور (Al-Ḥuḍūr) ہے اللہ جل ثناؤہ و تقدست اسماؤہ کے ساتھ، غیبت (Al-Ghayba) کے ہمراہ۔ اہل تصوف (القوم) کے نزدیک یہ اسی طرح ہے۔\n\nذات حق (Al-Ḥaqq) کے ساتھ میرا حضور (Al-Ḥuḍūr) میری غیبت (Al-Ghayba) میں ہے\nمیرا حضور (Al-Ḥuḍūr) اُس کے ذریعے ہے، پس وہی حاضر (Al-Ḥāḍir) ہے۔\nوہ میری غیبت (Al-Ghayba) میں باطن حق (Al-Bāṭin al-Ḥaqq) ہے\nاور میرے حضور (Al-Ḥuḍūr) کے وقت وہی ظاہر (Al-Ẓāhir) ہے۔\n\nاگر میں اُس سے سبقت لے جاؤں تو میں اوّل (Al-Awwal) ہوں\nاور اگر وہ مجھ سے سبقت لے جائے تو میں آخر (Al-Ākhir) ہوں۔\n\nجان لو کہ غیبت (Al-Ghayba) حضور (Al-Ḥuḍūr) کے بغیر نہیں ہوتی۔ پس تمہاری غیبت (Al-Ghayba) اُس سے جس کے ساتھ تم حاضر ہو، مشاہدہ (Al-Mushāhada) کے سلطان کی قوت کی وجہ سے ہے۔ جیسا کہ بقا (Al-Baqā’) کا سلطان تمہیں فنا (Al-Fanā’) کر دیتا ہے۔ کیونکہ وہ (حضور) اپنے اہل میں وقت، حکم اور تفصیل کا مالک ہے، جیسا کہ ہم نے غیبت (Al-Ghayba) کے باب میں بیان کیا تھا، بالکل اسی طرح۔ پس ہر غائب حاضر ہے اور ہر حاضر غائب ہے، کیونکہ مجموعی طور پر حضور (Al-Ḥuḍūr) کا تصور نہیں کیا جا سکتا، بلکہ یہ مجموعہ کے افراد کے ساتھ ہوتا ہے۔ کیونکہ اسماء (Al-Asmā’) اور اعیان (Al-A‘yān) کے احکام مختلف ہوتے ہیں، اور حکم حاضر (Al-Ḥāḍir) کے لیے ہوتا ہے۔ اگر وہ مجموعی طور پر حاضر ہو جائے تو وہ (احکام) ایک دوسرے کے مقابل آ جائیں گے، جس سے رکاوٹ پیدا ہو گی اور معاملہ بگڑ جائے گا۔ لہٰذا مجموعی طور پر حضور (Al-Ḥuḍūr) درست نہیں، نہ اُس کے نزدیک جو اُس کے حضور کو حق (Al-Ḥaqq) کے ساتھ دیکھتا ہے اور نہ اُس کے نزدیک جو اُس کے حضور کو خلق (Creation) کے ساتھ دیکھتا ہے۔ کیونکہ اعیان (Al-A‘yān) کا حکم اسماء (Al-Asmā’) کے حکم جیسا ہے تقابل، اختلاف اور سلطان کے ظہور کے معاملے میں۔ پس جو کچھ ہم نے بیان کیا ہے اس پر غور کرو، ان شاء اللہ تمہیں علم حاصل ہو گا۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راہ دکھاتا ہے)۔",
    "fa": "باب دویست و چهل و پنجم در حضور\n\nو آن حضور با خداوند جل ثناؤه و تقدست أسماؤه (که ثنایش بزرگ و نام‌هایش مقدس است) همراه با غیبت (الغيبة) است؛ نزد قوم (صوفیان) این‌گونه است.\n\n> حضوري مع الحق في غيبتي *** حضوري به فهو الحاضر\n> حضور من با حق (الحق) در غیبت (الغيبة) من است *** حضور من به واسطه اوست، پس اوست حاضر.\n\n> هو الباطن الحق في غيبتي *** وعند حضوري هو الظاهر\n> اوست باطن (الباطن) حق (الحق) در غیبت (الغيبة) من *** و هنگام حضور (الحضور) من، اوست ظاهر (الظاهر).\n\n> فإن فته فأنا أول *** وإن فاتني فأنا الآخر\n> پس اگر او از من پیشی گیرد، من اول (الأول) هستم *** و اگر من از او پیشی گیرم، من آخر (الآخر) هستم.\n\nبدان که غیبت (الغيبة) رخ نمی‌دهد مگر به واسطه حضور (الحضور). پس غیبت (الغيبة) تو از کسی که با او حاضری، به دلیل قدرت سلطان مشاهده (المشاهدة) است. همان‌طور که سلطان بقا (البقاء) تو را فانی (فنا) می‌سازد، زیرا او صاحب وقت و حکم و تفصیل (التفصيل) در حضور (الحضور) در میان اهل آن است، همان‌گونه که در غیبت (الغيبة) نیز ذکر کردیم. پس هر غایبی حاضر است و هر حاضری غایب؛ زیرا حضور (الحضور) با مجموع (کل) تصور نمی‌شود، بلکه تنها با آحاد (تک‌تک) آن مجموع است. زیرا احکام اسماء و اعیان (الأسماء والأعيان) متفاوت است و حکم از آنِ حاضر است. پس اگر با مجموع حاضر می‌شد، با یکدیگر تقابل می‌کردند و به تمانع (مانع شدن متقابل) می‌انجامید و کار تباه می‌شد. بنابراین، حضور (الحضور) با مجموع صحیح نیست، نه نزد کسی که حضور او را به حق (الحق) می‌بیند و نه نزد کسی که حضور او را به خلق می‌بیند. زیرا حکم اعیان (الأعيان) مانند حکم اسماء (الأسماء) است در تقابل و اختلاف و ظهور سلطان. پس در آنچه ذکر کردیم تدبر کن تا علم را بیابی، ان شاء الله. و **اللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}