{
  "id": 496,
  "title": {
    "ar": "الباب السادس والتسعون وأربعمائة في معرفة حال قطب كان منزله وما قَدَرُوا الله حَقَّ قَدْرِهِ",
    "en": "Chapter Four Hundred and Ninety-Six, Concerning the Knowledge of the State of a Pole (قطب) Whose Station Was: \"And they did not estimate Allah with the estimation due to Him.\"",
    "ur": "باب چار سو چھیانوے: ایک قطب کے حال کی معرفت میں جس کا منزل یہ تھا: \"اور انہوں نے اللہ کی قدر نہ کی جیسا کہ اس کی قدر کا حق ہے (وما قَدَرُوا الله حَقَّ قَدْرِهِ)\"۔",
    "fa": "باب چهارصد و نود و ششم در معرفت (معرفة) حال قطبی (قطب) که منزلش (منزل) بود: «و خدا را چنان که شایسته قدر اوست، قدر ننهادند (وما قَدَرُوا الله حَقَّ قَدْرِهِ)»"
  },
  "content": {
    "ar": "## «الباب السادس والتسعون وأربعمائة في معرفة حال قطب كان منزله وما قَدَرُوا الله حَقَّ قَدْرِهِ»\n\n\n> ما قدر الله غيره أبدا *** وليس غير فكلهم قدرا\n\n\n> ما حق قدر الآلة عندي سوى *** بأنه الله فاعرف الصورا\n\n\n> لو يعرف الخلق ما أفوه به *** في حق قدر الآلة ما اعتبرا\n\n\n> لو عبروا عن وجود ذاتهم *** ما عرفوا الحق لا ولا البشرا\n\n\n### [لا يعرف قدر الحق إلا من عرف الإنسان الكامل‏]\n\n\nقال الله تعالى سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ قدر الأمر موازنته لمقداره وهذا لا يعلم من الأمر حتى يكون له ما يعادله في ذاته فيكون ذلك المعادل مقدارا له لأنه يزنه فأثبت هذا الذكر لله قدرا لكنه مجهول عند أصحاب هذا الضمير ولا يعرف قدر الحق إلا من عرف الإنسان الكامل الذي خلقه الله على صورته وهي الخلافة ثم وصف الحق في الصورة الظاهرة نفسه باليدين والرجلين والأعين وشبه ذلك مما وردت به الأخبار مما يقتضيه الدليل العقلي من تنزيه حكم الظاهر من ذلك في المحدثات عن جناب الله فحق قدره إضافة ما أضافه إلى نفسه مما ينكر الدليل إضافته إليه تعالى إذ لو انفرد دون الشرع لم يضف شيئا من ذلك إليه فمن أضاف مثل هذا إليه عقلا فذلك هو الذي ما قدر الله حق قدره وما قال أخطأ المضيف ومن أضافه شرعا وشهودا وكان عَلى‏ بَيِّنَةٍ من رَبِّهِ فذلك الذي قدر الله حق قدره فالإنسان الكامل الذي هو الخليفة قدر الحق ظاهرا وباطنا صورة ومنزلة ومعنى فمن كل شي‏ء في الوجود زوجان لأن الإنسان الكامل والعالم بالإنسان الكامل على صورة الحق والزوجان الذكر والأنثى ففاعل ومنفعل فيه فالحق الفاعل والعالم منفعل فيه لأنه محل ظهور الانفعال بما يتناوب عليه من صور الأكوان من حركة وسكون واجتماع وافتراق ومن صور الألوان والصفات والنسب فالعالم قدر الحق وجودا وأما في الثبوت فهو أظهر لحكم الأزل الذي هو للممكنات في ثبوتها لأن الإمكان للممكن نعت ذاتي نفسي ولم يزل الممكن ممكنا في حال عدمه ووجوده فبقاء ما بقي منه في العدم وما بقي إلا بالمرجح فهو الذي أبقاه لما فيه من قبول الوجود كما هو ممكن مرجح في حال الوجود بالوجود لقبوله العدم بإمساك شرطه المصحح لبقائه فكما سبح الله نفسه عن التشبيه سبح الممكن نفسه عن التنزيه لما في التشبيه والتنزيه من الحد فهم بين مدخل ومخرج وما ظفر بالأمر على ما هو عليه إلا من جمع بينهما فقال بالتنزيه من وجه عقلا وشرعا وقال بالتشبيه من وجه شرعا لا عقلا والشهود يقضي بما جاءت به الرسل إلى أممها في الله فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ فكل واصف فإنما هو واقف مع نعت مخصوص فينزه الله\n\n\nنفسه عن ذلك النعت من حيث تخصيصه لا من حيث إنه له فإن له أحدية المجموع لا أحدية كل واحد من المجموع والواصف إنما يصفه بأحدية كل واحد من المجموع فهو المخاطب أعني من نعته بذلك بقوله سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ وأما تسبيح الخلق له بقوله تعالى تُسَبِّحُ لَهُ السَّماواتُ السَّبْعُ والْأَرْضُ ومن فِيهِنَّ وشبه ذلك مما ورد من الآيات والتعريف الإلهي فإنما يسبح الله عن عقد غيره فيه لأن نظر كل مسبح فيه نظر جزئي فالذي يثبت له واحد هو عين ما ينفيه عنه الآخر وكل واحد منهما مسبح بحمد الله فأثبت الله لهذا ما نفاه عن الله لا ما أثبته الآخر وأثبت الله الآخر عين ما نفاه الأول لا ما أثبته فما أثبت الله لأحد من أهل الثناء عليه إلا نفى ما نفاه عنه فذلك هو التسبيح بحمده فما يثنى عليه بالإثبات دون نفي ولا يوصف بالتسبيح ولا بنقيضه إلا العبد الجامع الكامل الظاهر بصورة الحق فإنه يشاهد الجمع ومن شاهد الجمع فقد شاهد التفصيل لأنه شاهده جمعا فالعبد الكامل مجموع الحق ولا يقال الحق مجموع العبد الكامل ومع هذا فللحق خصوص نعت ليس للعالم أصلا وللعالم‏\nخصوص وصف ليس للحق أصلا كالذلة والافتقار والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الباب السادس والتسعون وأربعمائة بانتهاء السفر الثلاثين والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ‏\n\n\nبسم الله الرحمن الرحيم‏\n\n",
    "en": "Chapter 496: Concerning the Knowledge of the State of a Pole (قطب) whose Station was [Defined by the Verse] \"And they did not estimate Allah with the estimation due to Him.\"\n\nNothing other than Him ever estimated Allah,\nAnd since there is no 'other,' all of them estimated Him.\n\nThe true estimation of the Divinity, in my view, is nothing\nOther than that He is Allah; so know the forms (صور).\n\nIf creation knew what I utter\nConcerning the true estimation of the Divinity, they would not consider it.\n\nIf they were to express the existence of their own essences (ذات),\nThey would not know the Real (الحق), nor would they know humanity.\n\n### [The True Estimation of the Real is Known Only by One Who Knows the Perfect Human (الإنسان الكامل)]\n\nAllah the Exalted said: <<سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ>> (Exalted is your Lord, the Lord of Might, above what they describe). The estimation (قدر) of a matter is its equivalence to its measure (مقداره). This is not known of the matter unless it has something equivalent to it in its essence (ذاته), and that equivalent then becomes its measure because it weighs it. Thus, this mention establishes an estimation (قدر) for Allah, but it remains unknown to those referred to by this pronoun [i.e., those who describe Him].\n\nThe true estimation of the Real (الحق) is known only by one who knows the Perfect Human (الإنسان الكامل), whom Allah created upon His form (صورته), and this is the Vicegerency (الخلافة). Then, in the manifest form (الصورة الظاهرة), the Real (الحق) described Himself with two hands, two feet, eyes, and similar descriptions mentioned in the reports (الأخبار). This is what the rational proof (الدليل العقلي) necessitates regarding the transcendence (تنزيه) of the apparent ruling concerning these attributes in created things (المحدثات) away from the Divine Presence (جناب الله).\n\nTherefore, His true estimation (حق قدره) is the attribution to Him of what He attributed to Himself, even though rational proof (الدليل) denies its attribution to Him the Exalted. For if reason stood alone, without the Sacred Law (الشرع), it would not attribute any of that to Him. Thus, whoever attributes such things to Him purely by reason (عقلا) is the one who has not estimated Allah with the estimation due to Him, and the attributor has erred in what he said. But whoever attributes it based on the Sacred Law (شرعا) and direct Witnessing (شهودا), and is <<عَلى‏ بَيِّنَةٍ من رَبِّهِ>> (upon clear evidence from his Lord), that is the one who has estimated Allah with the estimation due to Him.\n\nThe Perfect Human (الإنسان الكامل), who is the Vicegerent (الخليفة), is the measure (قدر) of the Real (الحق), outwardly and inwardly, in form (صورة), station (منزلة), and meaning (معنى). Thus, everything in Existence (الوجود) consists of pairs (زوجان), because the Perfect Human and the world (العالم) are in the form of the Real, and the pairs are the male and the female. Therefore, there is an active agent (فاعل) and a passive recipient (منفعل) within it. The Real is the active agent, and the world is the passive recipient within Him, because it is the locus where passivity manifests through the alternating forms of existence (صور الأكوان)—such as movement and rest, union and separation—and through the forms of colors, attributes (الصفات), and relations (النسب). Thus, the world is the measure of the Real in terms of Existence (وجودا).\n\nAs for the state of Immutability (الثبوت), it is more manifest due to the ruling of Eternity (الأزل), which belongs to the possibles (الممكنات) in their immutability, because possibility (الإمكان) is an essential, inherent attribute (نعت ذاتي نفسي) of the possible. The possible has never ceased to be possible, whether in its state of non-existence (عدمه) or its state of existence (وجوده). The persistence of what remained of it in non-existence—and it only persisted through the Determiner (المرجح)—is what kept it, due to its capacity to accept Existence. Similarly, it is a possible determined in the state of Existence by Existence, due to its acceptance of non-existence (العدم) through the withholding of the condition that validates its subsistence (بقاء).\n\nJust as Allah transcended (سبح) Himself above similarity (التشبيه), the possible transcends itself above absolute transcendence (التنزيه), due to the limitation (الحد) inherent in both similarity and transcendence. Thus, they are between an entrance and an exit. No one grasps the matter as it truly is except the one who combines both, affirming transcendence from one perspective, rationally (عقلا) and legally (شرعا), and affirming similarity from another perspective, legally (شرعا) but not rationally (عقلا).\n\nAnd the Witnessing (الشهود) confirms what the Messengers brought to their communities concerning Allah: <<فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ>> (So let him who wills believe, and let him who wills disbelieve). Every describer (واصف) stands only with a specific attribute (نعت مخصوص). Allah transcends Himself above that attribute insofar as it is specialized, not insofar as it belongs to Him. For Him is the Oneness (أحدية) of the totality (المجموع), not the oneness of each individual part of the totality. The describer only describes Him with the oneness of each individual part of the totality. Thus, the one who attributes Him with that is the one addressed by His saying: <<سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ>> (Exalted is your Lord, the Lord of Might, above what they describe).\n\nAs for the glorification (تسبيح) of creation for Him, as in His saying, the Exalted: <<تُسَبِّحُ لَهُ السَّماواتُ السَّبْعُ والْأَرْضُ ومن فِيهِنَّ>> (The seven heavens and the earth and whoever is in them glorify Him), and similar verses and Divine definitions (التعريف الإلهي), they only glorify Allah by transcending the belief (عقد) of others concerning Him. This is because the view of every glorifier (مسبح) is a partial view (نظر جزئي). What one affirms for Him is precisely what another denies concerning Him. Yet, each of them glorifies with the praise of Allah. Allah affirmed for the former what he negated concerning Allah, not what the other affirmed. And Allah affirmed for the latter precisely what the former negated, not what he affirmed. Allah did not affirm anything for any of those who praise Him except by negating what they negated concerning Him. That is the glorification (التسبيح) with His praise.\n\nHe is not praised through affirmation without negation, nor is He described by glorification or its opposite, except by the comprehensive, Perfect Servant (العبد الجامع الكامل) who manifests in the form of the Real (صورة الحق). For he witnesses the totality (الجمع), and whoever witnesses the totality has witnessed the detail (التفصيل), because he witnessed it as a totality. Thus, the Perfect Servant is the totality of the Real, but it is not said that the Real is the totality of the Perfect Servant.\n\nDespite this, the Real possesses a specific attribute (نعت) that the world (العالم) does not possess at all, and the world possesses a specific description (وصف) that the Real does not possess at all, such as lowliness (الذلة) and need (الافتقار). And <<الله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (Allah speaks the Truth, and He guides to the way).\n\nChapter 496 is concluded with the conclusion of the Thirtieth Volume. <<وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ>> (And praise be to Allah, Lord of the Worlds).\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "باب نمبر چار سو چھیانوے: اس قطب کے حال کی معرفت میں جو اس منزل پر تھا اور (اللہ تعالیٰ کا فرمان) \"اور انہوں نے اللہ کی قدر نہیں کی جیسا کہ اس کی قدر کرنے کا حق تھا\" (وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ)۔\n\nاللہ کی قدر اس کے غیر نے کبھی نہیں کی *** اور کوئی غیر نہیں، پس سب نے قدر کی\nمیرے نزدیک ذات حق (الحق) کی قدر کا حق صرف یہ ہے *** کہ وہ اللہ ہے، پس ان صورتوں کو پہچان\nاگر مخلوق جان لیتی جو میں ذات حق (الحق) کی قدر کے بارے میں کہتا ہوں *** تو وہ اسے خاطر میں نہ لاتے\nاگر وہ اپنی ذات کی ہستی (الوجود) کا اظہار کرتے *** تو وہ نہ حق (الحق) کو پہچانتے اور نہ ہی بشر کو\n\n[ذات حق (الحق) کی قدر کو صرف وہی جانتا ہے جس نے انسان کامل (الإنسان الکامل) کو پہچانا]\n\nاللہ تعالیٰ نے فرمایا: \"پاک ہے تیرا رب، عزت کا رب، ان باتوں سے جو وہ بیان کرتے ہیں\" (سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ)۔ کسی شے کی قدر اس کی مقدار کے ساتھ موازنہ کرنا ہے۔ اور یہ کسی شے کے بارے میں اس وقت تک معلوم نہیں ہو سکتا جب تک کہ اس کی ذات میں کوئی ایسی چیز نہ ہو جو اس کے برابر ہو، تاکہ وہ برابر کی چیز اس کی مقدار بن جائے کیونکہ وہ اسے تولتی ہے۔ پس یہ ذکر اللہ کے لیے ایک قدر (مقدار) ثابت کرتا ہے، لیکن یہ اس ضمیر (ذات) کے حاملین کے نزدیک مجہول ہے۔ اور ذات حق (الحق) کی قدر کو صرف وہی جانتا ہے جس نے انسان کامل (الإنسان الکامل) کو پہچانا، جسے اللہ نے اپنی صورت پر پیدا کیا، اور یہی خلافت ہے۔\n\nپھر ذات حق (الحق) نے ظاہری صورت میں اپنے آپ کو ہاتھوں، پیروں، آنکھوں اور اس جیسی دیگر چیزوں سے متصف کیا جو ان اخبار میں وارد ہوئی ہیں، جن کا تقاضا عقلی دلیل کرتی ہے کہ ان ظاہری احکام کو مخلوقات میں اللہ کی جناب سے تنزیہ (التنزيه) دی جائے۔ پس اس کی قدر کا حق یہ ہے کہ جو کچھ اس نے اپنی ذات کی طرف منسوب کیا ہے، اسے اس کی طرف منسوب کیا جائے، اگرچہ دلیل اس کی طرف اس کی نسبت کو تسلیم نہ کرے۔ کیونکہ اگر وہ شریعت کے بغیر اکیلا ہوتا تو ان میں سے کوئی چیز بھی اپنی طرف منسوب نہ کرتا۔ پس جس نے عقلی طور پر ایسی چیزوں کو اس کی طرف منسوب کیا، تو وہی ہے جس نے اللہ کی قدر نہیں کی جیسا کہ اس کی قدر کرنے کا حق تھا، اور اس نے غلطی کی جس نے یہ نسبت دی۔ اور جس نے اسے شرعی اور شہودی (الشہود) طور پر منسوب کیا اور وہ \"اپنے رب کی طرف سے روشن دلیل پر تھا\" (عَلَى بَيِّنَةٍ مِّن رَّبِّهِ)، تو وہی ہے جس نے اللہ کی قدر کی جیسا کہ اس کی قدر کرنے کا حق تھا۔ پس انسان کامل (الإنسان الکامل) جو کہ خلیفہ ہے، اس نے ذات حق (الحق) کی قدر ظاہری اور باطنی، صورت، منزلت اور معنی کے لحاظ سے کی۔\n\nپس ہستی (الوجود) میں ہر شے کے دو جوڑے ہیں، کیونکہ انسان کامل (الإنسان الکامل) اور انسان کامل (الإنسان الکامل) کے ذریعے عالم ذات حق (الحق) کی صورت پر ہے۔ اور دو جوڑے نر اور مادہ ہیں، پس اس میں فاعل اور منفعل موجود ہے۔ پس ذات حق (الحق) فاعل ہے اور عالم اس میں منفعل ہے، کیونکہ یہ انفعال کے ظہور کا مقام ہے، ان کونی صورتوں کے ذریعے جو اس پر گردش کرتی ہیں، جیسے حرکت و سکون، اجتماع و افتراق، اور رنگوں، صفات اور نسبتوں کی صورتیں۔ پس عالم نے ہستی (الوجود) کے لحاظ سے ذات حق (الحق) کی قدر کی۔ اور جہاں تک ثبوت کا تعلق ہے، تو یہ ازل کے حکم کی وجہ سے زیادہ ظاہر ہے جو ممکنات کے لیے ان کے ثبوت میں ہے۔ کیونکہ امکان ممکن کے لیے ایک ذاتی، نفسی وصف ہے، اور ممکن اپنے عدم اور وجود دونوں حالتوں میں ہمیشہ ممکن رہا ہے۔ پس جو کچھ اس میں سے عدم میں باقی رہا، وہ باقی نہیں رہا مگر مرجح (ترجیح دینے والے) کے ذریعے، پس وہی ہے جس نے اسے باقی رکھا، اس لیے کہ اس میں وجود کو قبول کرنے کی صلاحیت ہے۔ جیسا کہ وہ وجود کی حالت میں وجود کے ذریعے مرجح (ترجیح دیا گیا) ہے، کیونکہ وہ اپنے باقی رہنے کی تصحیح کرنے والی شرط کو روکنے کے ذریعے عدم کو قبول کرتا ہے۔\n\nپس جس طرح اللہ نے اپنی ذات کو تشبیہ (التشبيه) سے پاک قرار دیا، اسی طرح ممکن نے اپنی ذات کو تنزیہ (التنزيه) سے پاک قرار دیا، کیونکہ تشبیہ (التشبيه) اور تنزیہ (التنزيه) میں ایک حد ہے۔ پس وہ داخل ہونے اور نکلنے کے درمیان ہیں۔ اور اس امر کو جیسا کہ وہ ہے، صرف اسی نے پایا جس نے ان دونوں کو جمع کیا، پس اس نے ایک پہلو سے عقلی اور شرعی طور پر تنزیہ (التنزيه) کا قول کیا، اور ایک پہلو سے شرعی طور پر تشبیہ (التشبيه) کا قول کیا، نہ کہ عقلی طور پر۔ اور شہود (الشہود) اسی کا فیصلہ کرتا ہے جو رسول اللہ کے بارے میں اپنی امتوں کے پاس لائے، \"پس جو چاہے ایمان لائے اور جو چاہے کفر کرے\" (فَمَنْ شَاءَ فَلْيُؤْمِنْ وَمَنْ شَاءَ فَلْيَكْفُرْ)۔ پس ہر وصف بیان کرنے والا ایک مخصوص وصف کے ساتھ کھڑا ہے، لہٰذا وہ اللہ کو اس وصف سے پاک قرار دیتا ہے اس لحاظ سے کہ وہ اسے خاص کرتا ہے، نہ کہ اس لحاظ سے کہ وہ اس کا ہے۔ کیونکہ اس کے لیے مجموع کی احدیت ہے، نہ کہ مجموع میں سے ہر ایک کی احدیت۔ اور وصف بیان کرنے والا اسے مجموع میں سے ہر ایک کی احدیت کے ساتھ متصف کرتا ہے، پس وہی مخاطب ہے، یعنی جس نے اسے اس وصف سے متصف کیا، اس کے اس قول کے ذریعے: \"پاک ہے تیرا رب، عزت کا رب، ان باتوں سے جو وہ بیان کرتے ہیں\" (سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ)۔\n\nاور جہاں تک مخلوق کا اس کی تسبیح کرنا ہے، جیسا کہ اللہ تعالیٰ کا فرمان ہے: \"ساتوں آسمان اور زمین اور جو کچھ ان میں ہے، سب اس کی تسبیح کرتے ہیں\" (تُسَبِّحُ لَهُ السَّمَاوَاتُ السَّبْعُ وَالْأَرْضُ وَمَن فِيهِنَّ)، اور اس جیسی دیگر آیات اور تعریف الٰہی جو وارد ہوئی ہیں، تو وہ صرف اللہ کو اس عقد سے پاک قرار دیتے ہیں جو اس میں اس کے غیر کا ہوتا ہے۔ کیونکہ ہر تسبیح کرنے والے کی نظر اس میں جزوی ہوتی ہے۔ پس جو ایک اس کے لیے ثابت کرتا ہے، وہی عین وہ چیز ہے جسے دوسرا اس سے نفی کرتا ہے، اور ان میں سے ہر ایک اللہ کی حمد کے ساتھ تسبیح کرنے والا ہے۔ پس اللہ نے اس کے لیے وہ ثابت کیا جو اس نے اللہ سے نفی کیا، نہ کہ وہ جو دوسرے نے ثابت کیا۔ اور اللہ نے دوسرے کے لیے عین وہ ثابت کیا جو پہلے نے نفی کیا، نہ کہ وہ جو اس نے ثابت کیا۔ پس اللہ نے اہل ثنا میں سے کسی کے لیے بھی کوئی چیز ثابت نہیں کی مگر یہ کہ اس نے اس چیز کی نفی کی جو اس نے اس سے نفی کی تھی، پس یہی اس کی حمد کے ساتھ تسبیح ہے۔ اور اس کی ثنا صرف اثبات کے ساتھ نہیں کی جاتی، نفی کے بغیر، اور نہ ہی اس کی تسبیح یا اس کے برعکس سے وصف کیا جاتا ہے، سوائے اس جامع، کامل بندے کے جو ذات حق (الحق) کی صورت میں ظاہر ہوتا ہے۔ کیونکہ وہ جمع کا مشاہدہ کرتا ہے، اور جس نے جمع کا مشاہدہ کیا، اس نے تفصیل کا بھی مشاہدہ کیا، کیونکہ اس نے اسے مجموعی طور پر دیکھا۔ پس عبد کامل ذات حق (الحق) کا مجموعہ ہے، اور یہ نہیں کہا جائے گا کہ ذات حق (الحق) عبد کامل کا مجموعہ ہے۔\n\nاس کے باوجود، ذات حق (الحق) کے لیے ایک خاص وصف ہے جو عالم کے لیے بالکل نہیں ہے، اور عالم کے لیے ایک خاص وصف ہے جو ذات حق (الحق) کے لیے بالکل نہیں ہے، جیسے ذلت اور محتاجی۔ اور \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔ باب نمبر چار سو چھیانوے تیسویں سفر کے اختتام کے ساتھ مکمل ہوا، اور \"تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے\" (وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ)۔\n\nبسم اللہ الرحمن الرحیم۔",
    "fa": "باب چهارصد و نود و ششم در معرفت حال قطبی که منزل او «و خدا را آن‌گونه که شایسته اوست نشناختند» بود.\n\nهیچ‌کس جز او خدا را هرگز نشناخت *** و غیر او نیست، پس همگی او را شناختند.\nحق قدر معبود نزد من نیست مگر *** اینکه او الله است، پس صورت‌ها را بشناس.\nاگر خلق آنچه را که من به زبان می‌آورم بدانند *** در مورد حق قدر معبود، آن را به حساب نمی‌آورند.\nاگر از وجود ذات خود سخن می‌گفتند *** نه حق (الحق) را می‌شناختند و نه بشر را.\n\n[قدر حق (الحق) را نمی‌شناسد مگر کسی که انسان کامل (الإنسان الکامل) را بشناسد]\n\nخداوند متعال فرمود: سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ (منزه است پروردگار تو، پروردگار عزت، از آنچه وصف می‌کنند). قدر هر امر، سنجش آن با اندازه‌اش است. و این امر دانسته نمی‌شود مگر آنکه در ذات خود معادل و هم‌سنگی داشته باشد تا آن معادل، مقدار آن باشد، زیرا آن را وزن می‌کند. پس این ذکر برای خداوند قدری را اثبات می‌کند، اما نزد صاحبان این ضمیر (اشاره) مجهول است. و قدر حق (الحق) را نمی‌شناسد مگر کسی که انسان کامل (الإنسان الکامل) را بشناسد؛ همان که خداوند او را بر صورت خود آفرید و آن همان خلافت است. سپس حق (الحق) در صورت ظاهر، خود را به دست‌ها، پاها، چشم‌ها و مانند آن توصیف کرد؛ از آنچه اخبار (احادیث) بدان وارد شده است. این در حالی است که دلیل عقلی مقتضی تنزیه حکم ظاهر این امور در مخلوقات از ساحت الهی است. پس حق قدر او (خداوند) اضافه کردن آن چیزهایی است که خود به خویشتن نسبت داده است، در حالی که دلیل (عقل) اضافه کردن آن را به خداوند متعال انکار می‌کند؛ زیرا اگر عقل به تنهایی و بدون شرع بود، هیچ‌یک از این امور را به او نسبت نمی‌داد. پس کسی که چنین اموری را عقلاً به او نسبت دهد، او همان کسی است که ما قَدَرُوا الله حَقَّ قَدْرِهِ (خدا را آن‌گونه که شایسته اوست نشناخته است) و نگفته است که نسبت‌دهنده خطا کرده است. و کسی که آن را شرعاً و از طریق شهود (الشهود) نسبت دهد و عَلى‏ بَيِّنَةٍ من رَبِّهِ (بر دلیلی روشن از پروردگارش) باشد، او همان کسی است که خدا را آن‌گونه که شایسته اوست شناخته است.\n\nپس انسان کامل (الإنسان الکامل) که خلیفه است، قدر حق (الحق) را ظاهراً و باطناً، صورت، منزلت و معناً شناخته است. از هر چیزی در هستی (الوجود) دو زوج وجود دارد، زیرا انسان کامل و عالم به انسان کامل بر صورت حق (الحق) هستند، و این دو زوج، مذکر و مؤنث می‌باشند؛ پس در آن فاعل و منفعل وجود دارد. حق (الحق) فاعل است و عالم منفعل در اوست، زیرا عالم محل ظهور انفعال است به واسطه صور کائنات که بر آن در گردش است؛ از حرکت و سکون، اجتماع و افتراق، و از صور رنگ‌ها، صفات و نسبت‌ها. پس عالم، قدر حق (الحق) را از حیث وجود (الوجود) شناخته است. اما در مقام ثبوت، این امر برای حکم ازل که برای ممکنات در ثبوتشان است، آشکارتر است؛ زیرا امکان برای ممکن، نعت ذاتی و نفسی است و ممکن همواره در حال عدم و وجودش ممکن بوده است. پس بقای آنچه از آن در عدم باقی ماند، و باقی نماند مگر به واسطه مرجّح، همان است که آن را باقی نگه داشت به دلیل قبول وجودی که در آن بود. همان‌گونه که در حال وجود نیز ممکن است و به واسطه وجود مرجّح می‌شود، به دلیل قبول عدم، با نگه داشتن شرطی که بقای آن را تصحیح می‌کند. همان‌گونه که خداوند خود را از تشبیه منزه ساخت، ممکن نیز خود را از تنزیه منزه ساخت، به دلیل حدی که در تشبیه و تنزیه وجود دارد. پس آن‌ها بین مدخل و مخرج قرار دارند. و کسی به حقیقت امر آن‌گونه که هست دست نیافت مگر کسی که میان این دو جمع کرد؛ پس از یک جهت عقلاً و شرعاً قائل به تنزیه شد، و از یک جهت شرعاً نه عقلاً قائل به تشبیه شد. و شهود (الشهود) حکم می‌کند به آنچه رسولان برای امت‌هایشان در مورد خداوند آورده‌اند: فَمَنْ شاءَ فَلْيُؤْمِنْ ومَنْ شاءَ فَلْيَكْفُرْ (پس هر که می‌خواهد ایمان بیاورد و هر که می‌خواهد کفر ورزد).\n\nپس هر وصف‌کننده‌ای، تنها با نعت مخصوصی توقف کرده است. پس خداوند خود را از آن نعت، از حیث تخصیص آن، منزه می‌سازد، نه از حیث اینکه آن نعت از آنِ اوست. زیرا برای او احدیت مجموع است، نه احدیت هر یک از اجزای مجموع. و وصف‌کننده تنها او را به احدیت هر یک از اجزای مجموع وصف می‌کند. پس او (وصف‌کننده) همان مخاطب است، یعنی کسی که او را به آن نعت وصف کرده است، با این قول خداوند: سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ (منزه است پروردگار تو، پروردگار عزت، از آنچه وصف می‌کنند). و اما تسبیح خلق برای او، با این قول خداوند متعال: تُسَبِّحُ لَهُ السَّماواتُ السَّبْعُ والْأَرْضُ ومَنْ فِيهِنَّ (آسمان‌های هفت‌گانه و زمین و هر که در آن‌هاست او را تسبیح می‌گویند) و مانند آن از آیاتی که وارد شده و تعریف الهی، پس همانا خداوند را از اعتقاد غیر در او تسبیح می‌گویند؛ زیرا نظر هر تسبیح‌کننده‌ای در او، نظری جزئی است. پس آنچه یکی برای او اثبات می‌کند، عین همان چیزی است که دیگری از او نفی می‌کند، و هر یک از آن دو با حمد خداوند تسبیح می‌گویند. پس خداوند برای این (تسبیح‌کننده) چیزی را اثبات کرد که او از خداوند نفی کرده بود، نه آنچه دیگری اثبات کرده بود. و خداوند برای دیگری عین آنچه را که اولی نفی کرده بود اثبات کرد، نه آنچه را که اثبات کرده بود. پس خداوند برای هیچ‌یک از اهل ثنای بر او چیزی را اثبات نکرد مگر اینکه آنچه را که او از خداوند نفی کرده بود، نفی کرد. پس آن همان تسبیح به حمد اوست. و کسی با اثبات بدون نفی بر او ثنا نمی‌گوید و به تسبیح و نه به نقیض آن وصف نمی‌شود، مگر بنده جامع کامل (الإنسان الکامل) که به صورت حق (الحق) ظاهر شده است. زیرا او جمع را مشاهده می‌کند، و کسی که جمع را مشاهده کند، تفصیل را نیز مشاهده کرده است، زیرا او آن را به صورت جمع مشاهده کرده است. پس بنده کامل، مجموع حق (الحق) است، اما گفته نمی‌شود که حق مجموع بنده کامل است. با این حال، حق (الحق) خصوصیتی دارد که اصلاً برای عالم نیست، و عالم نیز وصفی خاص دارد که اصلاً برای حق (الحق) نیست، مانند خواری و نیازمندی. و الله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند). باب چهارصد و نود و ششم با پایان سفر سی‌ام به اتمام رسید. والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ (و ستایش مخصوص پروردگار جهانیان است).\n\nبسم الله الرحمن الرحیم (به نام خداوند بخشنده مهربان)."
  },
  "page_count": 2
}