{
  "id": 509,
  "title": {
    "ar": "الباب التاسع وخمسمائة في معرفة حال قطب كان منزله وما أَنْفَقْتُمْ من شَيْ‏ءٍ فَهُوَ يُخْلِفُهُ",
    "en": "Chapter Five Hundred and Nine: Concerning the knowledge of the state of a Pole (قطب) whose station was [the meaning of the verse]: <<And whatever thing you spend, He will replace it>> (وَمَا أَنفَقْتُم مِّن شَيْءٍ فَهُوَ يُخْلِفُهُ).",
    "ur": "باب پانچ سو نو: ایک قطب (قطب) کے حال کی معرفت (معرفۃ) کے بیان میں جس کا منزل (منزل) یہ تھا: \"وَمَا أَنْفَقْتُمْ مِنْ شَيْءٍ فَهُوَ يُخْلِفُهُ\" (اور تم جو کچھ بھی خرچ کرتے ہو، وہ اس کا بدلہ دیتا ہے)۔",
    "fa": "باب پانصد و نهم در معرفت حال قطبی که منزل او این آیه بود: «و هر چیزی را که انفاق کردید، پس او جایگزین آن می‌شود» (وَمَا أَنْفَقْتُمْ مِنْ شَيْءٍ فَهُوَ يُخْلِفُهُ)."
  },
  "content": {
    "ar": "## «الباب التاسع وخمسمائة في معرفة حال قطب كان منزله وما أَنْفَقْتُمْ من شَيْ‏ءٍ فَهُوَ يُخْلِفُهُ»\n\n\n> إلا إنما الإنفاق من حضرة النفق *** فإن له بابين في كل ما خلق‏\n\n\n> فيأتي إليه الرزق من باب غيبه *** وليس لذاك الباب باب فينطبق‏\n\n\n> فما زال مفتوحا على كل حالة *** لأن اسمه الفتاح ما عنده غلق‏\n\n\n> إذا أنفق الإنسان فالله مخلف *** فلا تيأسن فالوقت بالوقت متسق‏\n\n\n> وإن غلق الإنسان باب عطائه *** يواليه رب الجود جودا إن اتفق‏\n\n\n> وإن غلق الإنسان باب هباته *** فذلك إغلاق الإله إذا انغلق‏\n\n\n> ويغلقه إن شاء فالأمر أمره *** كما جاء في القرآن في سورة العلق‏\n\n\n> إذا عذت بالرحمن في كل حالة *** تعوذ بما قد جاء في سورة الفلق‏\n\n\n> وفي سورة الناس التي جاء ذكرها *** إلى جنبها تتلى كما عاذ من سبق‏\n\n\n> وإن عذت عذبا لرب إن كنت مؤمنا *** بما جاء في القرآن فانظر تعذ بحق‏\n\n\n> فما ذكر التعويذ إلا بربنا *** فكن تابعا لا تتبع غير من صدق‏\n\n\n### [الطلب من الفقير والخوف من الغني‏]\n\n\nقال الله تعالى كَلَّا إِنَّ الْإِنْسانَ لَيَطْغى‏ أَنْ رَآهُ اسْتَغْنى‏ فيغلق عليه باب العطاء لما جعل في قلبه من خوف الفقر إن أعطى فيطغى في غناه في عين فقره فإن هو أعطى ما به استغنى افتقر فاحتقر فلا يزال الغني خائفا ولا يزال الفقير طالبا فالرجاء للفقير فإنه يأمل الغناء والخوف للغني فإنه يخاف الفقر ف ما أَنْفَقْتُمْ من شَيْ‏ءٍ فإن الله يخلفه بهويته فيخلفه بفتح الياء فإنه ما ينفق حتى يشهد العوض وهوقولهم من أيقن بالخلف جاد بالأعطية\n\n\nفما ينفق أحد إلا عن ظهر غنا لأن العبد فقير بالذات غني بالعرض وكان الأولى أن يكون غنيا بالذات لأنه المصرف لمن يتصرف فيه كالمال فإنه المتصرف فيمن يتصرف فيه فهو يصرفه لأنه لا يتعدى فيه علمه وعلمه ما كان إلا من معلومه فما تصرف فيه إلا بما أعطاه من ذاته فمن حكمك في نفسه فهو الحاكم في تحكمك فيه فافهم‏\n\n\n> لقد جاد الإله على وجودي *** بما أخفاه عن خلق كثير\n\n\n> من العلم الذي ما فيه ريب *** ولا شك لذي الفطن الخبير\n\n\n### [الإنفاق إهلاك ولا يهلك إلا المحدث‏]\n\n\nواعلم أنه لا يقبل الإنفاق إلا المحدث فإن الإنفاق إهلاك ولا يهلك إلا المحدث وكُلُّ شَيْ‏ءٍ هالِكٌ إِلَّا وَجْهَهُ فمن أهلك شيئا فقد فقده وإذا فقده لم يجده وإذا لم يجده وجد الله عنده فهو يخلفه فكما عاد إلى الضمير على الشي‏ء من يخلفه ولا يخلف إلا مثله لا عينه فليس هو هو وإذا لم يكن هو هو ولا بد من الخلف فيخلفه الله وجوده وهو قوله ووَجَدَ الله عِنْدَهُ فحيث تفني الأسباب هناك يوجد الله وإِذا مَسَّكُمُ الضُّرُّ في الْبَحْرِ ضَلَّ من تَدْعُونَ إِلَّا إِيَّاهُ ومعنى ضل منكم وتلف فلم تجدوه وما وجدتم عند فقده إلا الله‏\n\n\nيقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في دعائه ربه في سفره أنت الصاحب في السفر والخليفة في الأهل‏\n\n\nفما جعله خليفة في أهله إلا عند فقدهم إياه فينوب الله عن كل شي‏ء أي يقوم فيهم مقام ذلك الشي‏ء بهويته ولهذا قال فَهُوَ يُخْلِفُهُ فأي سبب يكون للمنفق بعد الإنفاق يسد مسد ما أنفقه من أمر ظاهر أو باطن حتى اليقين أو الاستغناء عن الأمر الذي كان يصل إليه بذلك الذي أنفقه في عين تحصيله لذلك الشي‏ء فهو مجعول من هوية الحق أو هوية الحق والهو عند الطائفة أتم الأذكار وأرفعها وأعظمها وهو ذكر خواص الخواص وليس بعده ذكر أتم منه فيكون ما يعطيه الهو في إعطائه أعظم‏\nمن إعطاء اسم من الأسماء الإلهية حتى من الاسم الله فإن الاسم الله دلالة على الرتبة والهوية دلالة على العين لا تدل على أمر آخر غير الذات ولهذا يرجع إليها محلول لفظة الله فإنك تزيل الألف واللامين على الطريقة المعروفة عند أهل الله فيبقى هو فإن جعلته سببا لتعلق الخلق به مكنت الضمة فقلت هو فجئت بواو العلة وفيها رائحة الغناء عن العالمين والعلة ما لها هذا المقام من أجل طلبها المعلول كما يطلبها المعلول فحركت بالفتح تخفيفا من ثقل العلية فقيل هو فدل على عين غائبه عن أن يحصرها علم مخلوق فلا يزال غيبا عند كل من يزعم أنه عالم به حتى عن الأسماء الإلهية فشغلها بما وضعها له من المعاني فجعل الرزاق همته متعلقة بالرزق والمقيت بالتقويت والعالم بالعلم والحي بالحياة وكل اسم بما وضع له وما دل عليه من الحكم فالأسماء موضوعة وضعتها الممكنات في حال ثبوتها وعدمها فالأسماء أحكامها والهوية تقوم للممكنات بهذه الأحكام فإليه وهو الهو يُرْجَعُ الْأَمْرُ كُلُّهُ وإلى الهو من أَلا إِلَى الله تَصِيرُ الْأُمُورُ ترجع الأمور كلها وما ذكر إلا الهو بالتصريح أو الله ما ذكر اسما غيره فافهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 509: On the Gnosis of the State of a Pole Whose Station is Defined by the Verse: \"And whatever thing you spend, He will replace it (وما أَنْفَقْتُمْ من شَيْ‏ءٍ فَهُوَ يُخْلِفُهُ)\"\n\nIndeed, spending (الإنفاق) is only from the Presence of Expenditure (حضرة النفق),\nFor it has two doors in everything created.\n\nSustenance comes to him from the door of His Unseen,\nAnd that door has no door to be closed.\n\nIt remains open in every state,\nBecause His Name is The Opener (الفتاح); He has no closure.\n\nIf the human spends, Allah is the Replacer (مخلف),\nSo do not despair, for time is consistent with time.\n\nAnd if the human closes the door of his giving,\nThe Lord of Generosity (رب الجود) continues His generosity, if it is decreed.\n\nAnd if the human closes the door of his gifts,\nThat is the closure of the Deity (الإله) when He closes.\n\nHe closes it if He wills, for the Command is His Command,\nAs came in the Quran in Surat al-Alaq.\n\nIf you seek refuge in the All-Merciful (الرحمن) in every state,\nSeek refuge with what came in Surat al-Falaq.\n\nAnd in Surat al-Nas, whose mention came,\nIt is recited alongside it, just as those before sought refuge.\n\nAnd if you seek refuge, seek refuge in the Lord, if you are a believer\nIn what came in the Quran, then look, and seek refuge truly.\n\nFor seeking refuge is mentioned only through our Lord,\nSo be a follower, and do not follow anyone other than the one who speaks the truth.\n\n### [The Seeking of the Poor and the Fear of the Rich]\n\nAllah the Exalted said: <<Nay, verily, man transgresses, because he sees himself self-sufficient (كَلَّا إِنَّ الْإِنْسانَ لَيَطْغى‏ أَنْ رَآهُ اسْتَغْنى‏)>>.\n\nSo the door of giving is closed upon him because of the fear of poverty placed in his heart if he gives. Thus, he transgresses in his wealth despite his poverty. If he gives what makes him self-sufficient, he becomes poor and is despised. Thus, the rich person remains fearful, and the poor person remains seeking. Hope belongs to the poor, for he anticipates wealth, and fear belongs to the rich, for he dreads poverty.\n\nThus, \"whatever thing you spend (ما أَنْفَقْتُمْ من شَيْ‏ءٍ),\" Allah replaces it with His Ipseity (هويته), pronouncing *yukh-lifuhu* (يخلفه) with a *fatha* on the *ya*. For he does not spend until he witnesses the compensation (العوض). This is their saying: \"Whoever is certain of the replacement (الخلف) is generous with gifts.\"\n\nNo one spends except from a position of wealth, because the servant is poor essentially (بالذات) but rich accidentally (بالعرض). It would be more fitting for him to be rich essentially, because he is the disposer of that which disposes of him, just as wealth is the disposer of the one who disposes of it. He disposes of it because his knowledge does not exceed it. And his knowledge is only from his known object (معلومه). Thus, he only disposes of it by what He (God) gave him from His Essence (ذاته). So, He who rules you in your own self is the Ruler in your control over it. Understand this.\n\nThe Deity (الإله) has indeed been generous to my existence,\nWith what He concealed from many creatures,\n\nOf the Knowledge (العلم) in which there is no doubt,\nNor uncertainty for the possessor of experienced insight.\n\n### [Spending is Destruction, and Only the Contingent is Destroyed]\n\nKnow that spending (الإنفاق) is only accepted from the contingent being (المحدث), for spending is destruction (إهلاك), and only the contingent being is destroyed. <<And everything is perishing except His Face (كُلُّ شَيْ‏ءٍ هالِكٌ إِلَّا وَجْهَهُ)>>.\n\nWhoever destroys something has lost it. And when he loses it, he does not find it. And when he does not find it, he finds Allah with it, and He replaces it. Just as the pronoun refers back to the thing that replaces it, and nothing is replaced except by its like, not its essence (عينه), so it is not the same thing. And since it is not the same thing, and replacement (الخلف) is necessary, Allah replaces its existence (وجوده). This is His saying: <<and he found Allah with him (وَجَدَ الله عِنْدَهُ)>>.\n\nThus, where the means (الأسباب) perish, there Allah is found. <<And when affliction touches you in the sea, lost is [all] that you invoke except Him (إِذا مَسَّكُمُ الضُّرُّ في الْبَحْرِ ضَلَّ من تَدْعُونَ إِلَّا إِيَّاهُ)>>. The meaning is that what you invoked was lost and perished, so you did not find it. And you found nothing upon its loss except Allah.\n\nThe Messenger of Allah, may Allah bless him and grant him peace, says in his supplication to his Lord during travel: \"You are the Companion in the journey and the Successor (الخليفة) over the family.\"\n\nHe only made Him the Successor over his family when they lost him (the traveler). Thus, Allah acts as a deputy for everything, meaning He stands in their place as that thing, by His Ipseity (هويته). This is why He said: \"He will replace it (فَهُوَ يُخْلِفُهُ).\"\n\nSo, whatever means the spender has after spending, which fills the place of what he spent, whether it is an outward or inward matter—even certainty (اليقين) or self-sufficiency from the thing he used to attain through what he spent, even while attaining that very thing—that replacement is made from the Ipseity of the Real (هوية الحق) or is the Ipseity of the Real itself.\n\nAnd 'He' (الهو) is, according to the Sufi community (الطائفة), the most complete, highest, and greatest form of remembrance (ذكر). It is the remembrance of the elite of the elite (خواص الخواص), and there is no remembrance more complete after it. Thus, what 'He' grants in His giving is greater than the giving of any of the Divine Names (الأسماء الإلهية), even greater than the Name Allah. For the Name Allah is an indication of the Level (الرتبة), while the Ipseity (الهوية) is an indication of the Essence (العين), pointing to nothing other than the Essence (الذات).\n\nFor this reason, the dissolved form of the word Allah returns to it. If you remove the two *alifs* and the two *lams* according to the method known among the People of Allah (أهل الله), 'Huwa' (هو) remains. If you make it a means for creation to attach itself to Him, you strengthen the *damma* (vowel sound) and say *Huwwa*, bringing in the *waw* of causality (واو العلة), which carries the scent of self-sufficiency from the worlds. Causality does not possess this station because it seeks the effect (المعلول), just as the effect seeks it. So, it was vocalized with the *fatha* (vowel sound) to lighten the burden of causality, and it was said *Huwa*.\n\nThis indicates the Essence that is absent from being encompassed by the knowledge of any creature. It remains Unseen (غيبا) to everyone who claims to know Him, even to the Divine Names themselves, which are preoccupied with the meanings for which they were established. Thus, The Provider (الرزاق) has His concern attached to provision, The Maintainer (المقيت) to maintenance, The Knower (العالم) to knowledge, The Living (الحي) to life, and every Name to what it was established for and the ruling (الحكم) it indicates.\n\nThe Names are established; the possibilities (الممكنات) established them in their state of immutability (ثبوتها) and non-existence (عدمها). The Names are their rulings, and the Ipseity subsists for the possibilities through these rulings. To Him, who is 'He' (الهو), <<the whole matter is returned (يُرْجَعُ الْأَمْرُ كُلُّهُ)>>. And to 'He' (الهو) from <<Unquestionably, to Allah belong the outcomes of [all] matters (أَلا إِلَى الله تَصِيرُ الْأُمُورُ)>>, all matters return. Nothing is mentioned except 'He' (الهو) explicitly, or Allah. No Name other than these is mentioned. Understand this. And <<Allah speaks the Truth, and He guides to the way (يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)>>.",
    "ur": "باب نمبر پانچ سو نو: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: اور تم جو کچھ بھی خرچ کرو گے، تو وہ اس کا بدل دے گا (وَمَا أَنْفَقْتُمْ مِنْ شَيْءٍ فَهُوَ يُخْلِفُهُ)۔\n\nخبردار! انفاق (خرچ کرنا) صرف نفق (خرچ) کے حضور (حضرة النفق) سے ہوتا ہے،\nکیونکہ ہر مخلوق میں اس کے دو دروازے ہیں۔\nپس رزق اس کے پاس غیب کے دروازے سے آتا ہے،\nاور اس دروازے کا کوئی کواڑ نہیں جو بند ہو جائے۔\nپس وہ ہر حال میں کھلا رہتا ہے،\nکیونکہ اس کا نام الفتاح (بڑی کشادگی دینے والا) ہے، اس کے پاس کوئی بندش نہیں۔\nجب انسان خرچ کرتا ہے تو اللہ بدل دینے والا ہے،\nپس مایوس نہ ہو، کیونکہ وقت وقت کے ساتھ ہم آہنگ ہے۔\nاور اگر انسان اپنے عطا کا دروازہ بند کر دے،\nتو ربِ جود (سخاوت کا رب) اسے سخاوت سے نوازتا ہے اگر وہ موافق ہو۔\nاور اگر انسان اپنی بخششوں کا دروازہ بند کر دے،\nتو یہ اللہ کا بند کرنا ہے جب وہ بند ہو جائے۔\nاور وہ چاہے تو اسے بند کر دیتا ہے، پس حکم اسی کا ہے،\nجیسا کہ قرآن میں سورۃ العلق میں آیا ہے۔\nجب تم ہر حال میں رحمن کی پناہ چاہو،\nتو اس چیز کی پناہ مانگو جو سورۃ الفلق میں آئی ہے۔\nاور سورۃ الناس میں جس کا ذکر آیا ہے،\nوہ اس کے پہلو میں تلاوت کی جاتی ہے، جیسا کہ پہلے لوگوں نے پناہ مانگی۔\nاور اگر تم رب کی پناہ مانگو، اگر تم قرآن میں آئی ہوئی باتوں پر ایمان رکھتے ہو،\nتو دیکھو، تم حق کے ساتھ پناہ مانگتے ہو۔\nپناہ مانگنے کا ذکر صرف ہمارے رب کے ساتھ ہی کیا گیا ہے،\nپس تابعدار بنو، اور سچے کے علاوہ کسی کی پیروی نہ کرو۔\n\n### [فقیر کا طلب کرنا اور غنی کا خوف]\n\nاللہ تعالیٰ نے فرمایا: \"ہرگز نہیں! بے شک انسان سرکشی کرتا ہے (كَلَّا إِنَّ الْإِنْسانَ لَيَطْغىٰ)، جب وہ اپنے آپ کو بے نیاز دیکھتا ہے (أَنْ رَآهُ اسْتَغْنىٰ)۔\" پس اس پر عطا کا دروازہ بند کر دیا جاتا ہے، اس خوفِ فقر کی وجہ سے جو اس کے دل میں ڈال دیا گیا ہے کہ اگر وہ دے گا تو فقیر ہو جائے گا۔ پس وہ اپنے فقر کے عین میں اپنی غنا (بے نیازی) میں سرکشی کرتا ہے۔ اگر وہ وہ چیز دے دے جس سے وہ بے نیاز ہوا تھا، تو وہ فقیر ہو جائے گا اور حقیر سمجھا جائے گا۔ پس غنی ہمیشہ خوف زدہ رہتا ہے اور فقیر ہمیشہ طلبگار رہتا ہے۔ پس امید فقیر کے لیے ہے، کیونکہ وہ غنا (بے نیازی) کی امید رکھتا ہے، اور خوف غنی کے لیے ہے، کیونکہ وہ فقر سے ڈرتا ہے۔ پس \"اور تم جو کچھ بھی خرچ کرو گے (وَمَا أَنْفَقْتُمْ مِنْ شَيْءٍ)\" تو اللہ اسے اپنی ہویت (الهوية) کے ساتھ بدل دے گا۔ وہ اسے (یُخْلِفُہُ) یاء کے فتحہ کے ساتھ بدلتا ہے، کیونکہ وہ اس وقت تک خرچ نہیں کرتا جب تک کہ وہ عوض (بدل) کا شہود (الشہود) نہ کر لے۔ اور یہی ان کا قول ہے کہ جس نے بدل کا یقین کر لیا، اس نے سخاوت سے عطا کیا۔\n\nپس کوئی بھی شخص غنا (بے نیازی) کی پشت پناہی کے بغیر خرچ نہیں کرتا، کیونکہ بندہ بالذات فقیر ہے اور بالعرض غنی ہے۔ اور اولیٰ یہ تھا کہ وہ بالذات غنی ہوتا، کیونکہ وہ اس کا متصرف ہے جو اس میں تصرف کرتا ہے، جیسے مال، جو اس میں تصرف کرنے والے میں متصرف ہوتا ہے۔ پس وہ اسے خرچ کرتا ہے کیونکہ اس میں اس کا علم تجاوز نہیں کرتا۔ اور اس کا علم اس کے معلوم کے سوا کچھ نہیں تھا، پس اس نے اس میں تصرف نہیں کیا مگر اس چیز کے ساتھ جو اس نے اپنی ذات سے اسے عطا کی۔ پس جس نے تمہارے نفس میں حکم کیا، وہی تمہارے اس میں تصرف کرنے میں حاکم ہے، پس سمجھو۔\n\nبے شک الٰہ نے میرے وجود (الوجود) پر سخاوت کی،\nاس چیز کے ساتھ جسے اس نے بہت سی مخلوق سے چھپا رکھا ہے۔\nاس علم میں سے جس میں کوئی شک نہیں،\nاور نہ ہی صاحبِ بصیرت اور باخبر کے لیے کوئی تردد ہے۔\n\n### [انفاق (خرچ کرنا) ہلاک کرنا ہے، اور ہلاک صرف محدث (نئی چیز) ہوتی ہے]\n\nاور جان لو کہ انفاق (خرچ کرنا) صرف محدث (نئی چیز) ہی قبول کرتا ہے، کیونکہ انفاق ہلاک کرنا ہے، اور ہلاک صرف محدث ہی ہوتا ہے۔ اور \"ہر چیز ہلاک ہونے والی ہے سوائے اس کی ذات کے (وَكُلُّ شَيْءٍ هَالِكٌ إِلَّا وَجْهَهُ)۔\" پس جس نے کسی چیز کو ہلاک کیا، اس نے اسے کھو دیا، اور جب اس نے اسے کھو دیا تو اسے نہیں پایا، اور جب اسے نہیں پایا تو اللہ کو اپنے پاس پایا، پس وہی اس کا بدل دیتا ہے۔ پس جیسا کہ ضمیر (ضمیر) اس چیز کی طرف لوٹا جو اس کا بدل دیتا ہے، اور بدل صرف اس کا مثل ہوتا ہے، نہ کہ عین (حقیقت)، پس وہ وہی نہیں ہوتا۔ اور جب وہ وہی نہیں ہوتا، اور بدل (الخلف) ضروری ہے، تو اللہ اس کے وجود (الوجود) کا بدل دیتا ہے، اور یہی اس کا قول ہے: \"اور اس نے اللہ کو اپنے پاس پایا (وَوَجَدَ اللَّهَ عِنْدَهُ)۔\" پس جہاں اسباب فنا ہوتے ہیں، وہاں اللہ موجود ہوتا ہے۔ \"اور جب تمہیں سمندر میں کوئی تکلیف پہنچتی ہے تو وہ سب گم ہو جاتے ہیں جنہیں تم پکارتے ہو سوائے اس کے (وَإِذَا مَسَّكُمُ الضُّرُّ فِي الْبَحْرِ ضَلَّ مَنْ تَدْعُونَ إِلَّا إِيَّاهُ)۔\" اور اس کا مطلب یہ ہے کہ وہ تم سے گم ہو گئے اور ضائع ہو گئے، پس تم نے انہیں نہیں پایا، اور ان کے کھو جانے پر تم نے اللہ کے سوا کسی کو نہیں پایا۔\n\nرسول اللہ صلی اللہ علیہ وسلم اپنے سفر میں اپنے رب سے دعا کرتے ہوئے فرماتے ہیں: \"تو ہی سفر میں ساتھی ہے اور گھر والوں میں خلیفہ (بدل) ہے۔\"\n\nپس اللہ نے اسے گھر والوں میں خلیفہ (بدل) نہیں بنایا مگر اس وقت جب وہ اسے کھو دیتے ہیں۔ پس اللہ ہر چیز کا نائب بن جاتا ہے، یعنی ان میں اس چیز کے مقام پر اپنی ہویت (الهوية) کے ساتھ قائم ہو جاتا ہے۔ اور اسی لیے فرمایا: \"پس وہ اس کا بدل دیتا ہے (فَهُوَ يُخْلِفُهُ)۔\" پس خرچ کرنے والے کے لیے خرچ کرنے کے بعد کون سا سبب ہوتا ہے جو اس چیز کی جگہ لے لے جسے اس نے خرچ کیا، خواہ وہ ظاہری ہو یا باطنی، یہاں تک کہ یقین یا اس چیز سے بے نیازی جو اسے اس خرچ کی ہوئی چیز کے ذریعے حاصل ہوتی تھی، عین اس چیز کے حصول میں۔ پس وہ ذات حق (الحق) کی ہویت (الهوية) سے بنایا گیا ہے، یا وہ ہویت (الهوية) ہی ہے۔\n\nاور الہو (الهو) اس گروہ (صوفیاء) کے نزدیک سب سے کامل، سب سے بلند اور سب سے عظیم ذکر ہے، اور یہ خواص الخواص کا ذکر ہے۔ اس کے بعد کوئی ذکر اس سے زیادہ کامل نہیں، پس جو کچھ الہو (الهو) اپنی عطا میں دیتا ہے، وہ اسماء الٰہیہ میں سے کسی بھی اسم کی عطا سے زیادہ عظیم ہوتا ہے، یہاں تک کہ اسم اللہ سے بھی۔ کیونکہ اسم اللہ رتبے پر دلالت کرتا ہے، جبکہ ہویت (الهوية) عین (ذات) پر دلالت کرتی ہے، جو ذات کے علاوہ کسی اور چیز پر دلالت نہیں کرتی۔ اور اسی لیے لفظ اللہ کا تحلیل شدہ حصہ اسی کی طرف لوٹتا ہے، کیونکہ تم اہل اللہ کے ہاں معروف طریقے کے مطابق الف اور دونوں لاموں کو ہٹا دیتے ہو، تو ہو (هو) باقی رہ جاتا ہے۔ پس اگر تم اسے مخلوق کے اس سے متعلق ہونے کا سبب بناؤ، تو تم ضمہ (پیش) کو مضبوط کرتے ہو اور کہتے ہو: \"ہو (هو)\"، اور تم واؤ العلہ (واؤِ سبب) لاتے ہو، اور اس میں عالمین سے بے نیازی کی خوشبو ہے۔ اور علت (سبب) کو یہ مقام حاصل نہیں ہے، کیونکہ وہ معلول (مسبب) کو طلب کرتی ہے، جیسا کہ معلول اسے طلب کرتا ہے۔ پس علیت (سببیت) کے بوجھ کو ہلکا کرنے کے لیے اسے فتحہ (زبر) کے ساتھ حرکت دی گئی، اور کہا گیا: \"ہو (هو)\"، پس یہ اس غائب عین (ذات) پر دلالت کرتا ہے جسے مخلوق کا علم احاطہ نہیں کر سکتا۔ پس وہ ہر اس شخص کے نزدیک غیب ہی رہتا ہے جو یہ دعویٰ کرتا ہے کہ وہ اسے جانتا ہے، یہاں تک کہ اسماء الٰہیہ سے بھی، کیونکہ اس نے انہیں ان معانی میں مشغول کر رکھا ہے جن کے لیے انہیں وضع کیا گیا تھا۔ پس الرزاق (رزق دینے والا) نے اپنی ہمت کو رزق سے متعلق کر دیا، المقیت (قوت دینے والا) نے قوت دینے سے، العالم (جاننے والا) نے علم سے، اور الحی (زندہ) نے حیات سے، اور ہر اسم اس چیز سے متعلق ہے جس کے لیے اسے وضع کیا گیا اور جس حکم پر اس نے دلالت کی۔ پس اسماء موضوع ہیں، جنہیں ممکنات نے اپنے ثبوت اور عدم کی حالت میں وضع کیا ہے۔ پس اسماء ان کے احکام ہیں، اور ہویت (الهوية) ان احکام کے ذریعے ممکنات کے لیے قائم ہوتی ہے۔ پس اسی کی طرف، اور وہ الہو (الهو) ہے، \"تمام معاملات لوٹائے جاتے ہیں (يُرْجَعُ الْأَمْرُ كُلُّهُ)\"، اور الہو (الهو) کی طرف ہی \"خبردار! تمام معاملات اللہ کی طرف لوٹتے ہیں (أَلَا إِلَى اللَّهِ تَصِيرُ الْأُمُورُ)\"، تمام معاملات لوٹتے ہیں۔ اور صراحتاً الہو (الهو) یا اللہ کے سوا کسی اسم کا ذکر نہیں کیا گیا، اس کے علاوہ کسی اور اسم کا ذکر نہیں کیا گیا، پس سمجھو۔ اور \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔\"",
    "fa": "باب پانصد و نهم در معرفت حال قطبی که منزل او این آیه بود: «و هر چیزی را که انفاق کردید، پس او (خدا) جایگزین آن می‌شود» (وَمَا أَنْفَقْتُمْ مِنْ شَيْءٍ فَهُوَ يُخْلِفُهُ).\n\nانفاق تنها از حضرت نَفَق (محل انفاق) است *** زیرا برای او در هر آنچه آفریده شده دو در است.\n\nپس روزی از درِ غیبش به سوی او می‌آید *** و آن در، دری نیست که بسته شود.\n\nپس پیوسته در هر حالی گشوده است *** زیرا نام او فتاح (گشاینده) است و نزد او بستگی نیست.\n\nاگر انسان انفاق کند، خداوند جایگزین می‌کند *** پس ناامید مشو، زیرا زمان با زمان هماهنگ است.\n\nو اگر انسان درِ عطای خود را ببندد *** پروردگار جود، اگر موافق باشد، جود را پیوسته به او می‌رساند.\n\nو اگر انسان درِ بخشش‌های خود را ببندد *** آن بستن، بستنِ الهی است، آنگاه که بسته شود.\n\nو اگر بخواهد آن را می‌بندد، زیرا امر، امر اوست *** چنانکه در قرآن در سوره علق آمده است.\n\nاگر در هر حالی به رحمان پناه بردی *** به آنچه در سوره فلق آمده است پناه ببر.\n\nو در سوره ناس که ذکرش آمده است *** در کنار آن تلاوت می‌شود، چنانکه پیشینیان پناه بردند.\n\nو اگر پناه بردی، به پروردگار پناه ببر، اگر مؤمن هستی *** به آنچه در قرآن آمده است بنگر، پس به حق پناه ببر.\n\nپناه بردن جز به پروردگار ما ذکر نشده است *** پس پیرو باش و از غیرِ کسی که راست گفت، پیروی مکن.\n\n### [طلب فقیر و ترس غنی]\n\nخداوند متعال می‌فرماید: «چنین نیست، همانا انسان سرکشی می‌کند» (كَلَّا إِنَّ الْإِنْسانَ لَيَطْغىٰ) «همین که خود را بی‌نیاز ببیند» (أَنْ رَآهُ اسْتَغْنىٰ). پس درِ عطا بر او بسته می‌شود، به سبب ترسی از فقر که در قلبش قرار داده شده است اگر عطا کند. پس در عین فقرش، در غنای خود طغیان می‌کند. اگر آنچه را که به واسطه آن بی‌نیاز شده است، ببخشد، فقیر می‌شود و حقیر می‌گردد. پس غنی پیوسته ترسان است و فقیر پیوسته طالب. امید برای فقیر است، زیرا او آرزوی غنا دارد، و ترس برای غنی است، زیرا او از فقر می‌ترسد. پس «هر چیزی را که انفاق کردید» (مَا أَنْفَقْتُمْ مِنْ شَيْءٍ)، خداوند آن را با هویتش (هویته) جایگزین می‌کند. و آن را با فتح یاء (یُخْلِفُهُ) جایگزین می‌کند، زیرا انفاق نمی‌کند مگر آنکه عوض را شهود کند. و این همان قول ایشان است که: «هر کس به خلف (جانشینی) یقین داشته باشد، در بخشش‌ها سخاوتمند است.»\n\nهیچ کس انفاق نمی‌کند مگر از پشتوانه غنا، زیرا بنده در ذات خود فقیر است و به عرض غنی. و سزاوارتر آن بود که در ذات خود غنی باشد، زیرا اوست که در آنچه در آن تصرف می‌کند، تصرف می‌نماید، مانند مال که در کسی که در آن تصرف می‌کند، تصرف می‌نماید. پس او آن را به کار می‌گیرد، زیرا علم او از آن فراتر نمی‌رود، و علم او جز از معلومش نبوده است. پس در آن تصرف نکرده است مگر به آنچه از ذاتش به او عطا کرده است. پس کسی که در نفس تو حکم می‌کند، او حاکم بر تصرف تو در آن است. پس بفهم.\n\nهمانا حق (الإله) بر هستی من بخشش کرد *** به آنچه از خلق کثیری پنهان داشت.\n\nاز علمی که در آن هیچ شکی نیست *** و برای صاحبان هوش و خبره تردیدی ندارد.\n\n### [انفاق، هلاکت است و جز مُحدَث (مخلوق) هلاک نمی‌شود]\n\nو بدان که انفاق پذیرفته نمی‌شود مگر از مُحدَث (مخلوق)، زیرا انفاق، هلاکت است و جز مُحدَث هلاک نمی‌شود. و «هر چیزی جز وجه او (خدا) هلاک شونده است» (كُلُّ شَيْءٍ هَالِكٌ إِلَّا وَجْهَهُ). پس هر کس چیزی را هلاک کند، آن را از دست داده است، و چون آن را از دست داد، آن را نمی‌یابد، و چون آن را نیافت، خدا را نزد آن می‌یابد، و او جایگزین آن می‌شود. پس همانطور که ضمیر به شیء بازگشت، کسی که جایگزین آن می‌شود، جایگزین نمی‌کند مگر مثل آن را، نه عین آن را. پس آن، خودِ آن نیست. و چون خودِ آن نیست و ناگزیر باید جانشینی باشد، خداوند هستی (وجود) آن را جایگزین می‌کند. و این همان قول اوست: «و خدا را نزد آن یافت» (وَوَجَدَ اللَّهَ عِنْدَهُ). پس هر جا که اسباب فانی شوند، در آنجا خدا یافت می‌شود. و «هنگامی که در دریا به شما زیانی رسد، هر که را می‌خوانید جز او، گم می‌شود» (وَإِذَا مَسَّكُمُ الضُّرُّ فِي الْبَحْرِ ضَلَّ مَنْ تَدْعُونَ إِلَّا إِيَّاهُ). و معنای «گم شد» این است که از شما تلف شد و آن را نیافتید، و نزد فقدان آن جز خدا را نیافتید.\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در دعای خود به پروردگارش در سفر می‌فرماید: «تو در سفر همراه و در خانواده جانشین (الخليفة) هستی.»\n\nخداوند او را در خانواده‌اش جانشین قرار نداد مگر هنگام فقدان او. پس خداوند از هر چیزی نیابت می‌کند، یعنی به هویت (هویته) خود در میان آنان به جای آن شیء می‌ایستد. و به همین دلیل فرمود: «پس او (خدا) جایگزین آن می‌شود» (فَهُوَ يُخْلِفُهُ). پس چه سببی برای انفاق‌کننده پس از انفاق وجود دارد که جای خالی آنچه را انفاق کرده است، از امر ظاهر یا باطن پر کند، حتی یقین یا بی‌نیازی از امری که به واسطه آنچه انفاق کرده بود به آن می‌رسید، در عین به دست آوردن آن شیء. پس آن از هویت حق (هوية الحق) یا هویت حق ساخته شده است. و «هو» (الهو) نزد این طایفه کامل‌ترین، والاترین و عظیم‌ترین اذکار است. و آن ذکر خواص الخواص است و پس از آن ذکر کامل‌تری نیست. پس آنچه «هو» (الهو) در عطای خود می‌بخشد، عظیم‌تر است.\n\nاز عطای هر یک از اسماء الهی، حتی از اسم «الله»، زیرا اسم «الله» دلالت بر رتبه دارد، در حالی که هویت (الهوية) دلالت بر عین (ذات) دارد و بر امر دیگری جز ذات دلالت نمی‌کند. و به همین دلیل، محلول لفظ «الله» به آن باز می‌گردد، زیرا الف و دو لام را طبق روش شناخته شده نزد اهل الله حذف می‌کنی، پس «هو» باقی می‌ماند. اگر آن را سببی برای تعلق خلق به آن قرار دهی، ضمه را محکم می‌کنی و می‌گویی «هُوَ»، و واو عله را می‌آوری که در آن بوی بی‌نیازی از عالمیان است. و عله این مقام را ندارد، به دلیل طلب معلول، همانطور که معلول آن را می‌طلبد. پس برای تخفیف از سنگینی علیت، با فتحه حرکت داده شد و «هُوَ» گفته شد. پس بر عین غایبی دلالت کرد که علم هیچ مخلوقی نمی‌تواند آن را در بر گیرد. پس نزد هر کس که گمان می‌کند به آن عالم است، حتی نزد اسماء الهی، پیوسته غیب است. پس اسماء را به آنچه برای آن وضع شده‌اند، مشغول کرد؛ رزاق همتش را به رزق، مقیت به قوت دادن، عالم به علم، حی به حیات، و هر اسمی به آنچه برای آن وضع شده و از احکام بر آن دلالت کرده است، مشغول ساخت. پس اسماء، احکام هستند و هویت (الهوية) به واسطه این احکام برای ممکنات قیام می‌کند. پس «امر همه به سوی او (الهو) بازگردانده می‌شود» (إِلَيْهِ وَهُوَ الْهُو يُرْجَعُ الْأَمْرُ كُلُّهُ). و به سوی «هو» (الهو) است که «آگاه باشید که امور همه به سوی خدا باز می‌گردد» (أَلَا إِلَى اللَّهِ تَصِيرُ الْأُمُورُ). امور همه باز می‌گردند و جز «هو» (الهو) به صراحت یا «الله» نام دیگری ذکر نشده است. پس بفهم. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}