{
  "id": 166,
  "title": {
    "ar": "الباب السادس والعشرون ومائة في معرفة مقام الحكمة والحكماء",
    "en": "Chapter One Hundred and Twenty-Six: Concerning the Knowledge of the Station of Wisdom (مقام الحكمة) and the Sages (الحكماء)",
    "ur": "ایک سو چھبیسواں باب: مقامِ حکمت اور حکماء کی معرفت میں",
    "fa": "باب صد و بیست و ششم در معرفت مقام حکمت و حکما"
  },
  "content": {
    "ar": "## (الباب السادس والعشرون ومائة في معرفة مقام الحكمة والحكماء)\n\n\n> إن الحكيم مرتب الأشياء *** في أعين الأكوان والأسماء\n\n\n> يجري مع العلم القديم بحكمه *** في الحكمة المزدانة الغراء\n\n\n> فتراه يعطي كل شي‏ء خلقه *** في حالة السراء والضراء\n\n\n> وعن العوارض لا يزال منزها *** في بدء ما تهوي من الأشياء\n\n\n> لكنه المعصوم في أفعاله *** في كل ما يجري من الأهواء\n\n\n### [أن الحكمة علم بمعلوم خاص‏]\n\n\nاعلم أيدك الله أن الحكمة علم بمعلوم خاص وهي صفة تحكم ويحكم بها ولا يحكم عليها واسم الفاعل منها حكيم فلها الحكم واسم الفاعل من الحكم الذي هو أثرها حاكم وحكم وبهذا سمي الرسن الذي يحكم به الفرس حكمة فكل علم له هذا النعت فهو الحكمة والأشياء المحكوم عليها بكذا تطلب بذاتها واستعدادها ما يحتاج إليه فلا يعطيها ذلك إلا من نعته الحكمة واسمه الحكيم فهل للاستعدادات حكم في هذا المسمى حكيما أو الحكمة لها الحكم أو المجموع فأما الاستعداد على الانفراد فلا أثر له فإنا نرى من يستحق أمرا ما باستعداده وهو بين يدي عالم لكنه ليس بحكيم فلا يعطيه ما يستحقه لكونه جاهلا وقد يمنعه ما يستحقه مع كونه موصوفا بالعلم بما يستحقه ذلك الأمر وما يفعل فلا بالمجموع ولا بالانفراد فعلمنا إن ذلك راجع إلى أمر رابع ما هو الحكمة ولا العليم بالحكمة ولا استعداد الأمر الذي يطلب الحكمة وذلك الأمر الزائد هو الذي يبعثه على إعطاء ذلك الأمر حقه لعلمه بما يستحقه وحينئذ يسمى حكيما وما لم يكن منه ذلك فهو عالم بالحكمة وبما تستحقه وما يستحقه ذلك الأمر باستعداده فلا يسمى حكيما إلا بوجود هذا الاستعمال وهو قوله أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ من اسمه الحكيم فبالإعطاء الذي تعطيه الحكمة يسمى حكيما فهو علم تفصيلي عملي والعلم بالمجمل علم تفصيلي فإنه فصله عن العلم التفصيلي ولو لا ذلك لم يتميز المجمل من المفصل فمن الحكمة العلم بالمجمل والتجميل والمفصل والتفصيل قال تعالى وآتَيْناهُ الْحِكْمَةَ عملا وفَصْلَ الْخِطابِ في المقال‏\n\n\n### [موطن الحكيم موطن الملامية فإنهم مجهولون في الدنيا]\n\n\nفالحكيم يجري مع كل حال وموطن بحسب ذلك الحال وذلك الموطن وليس هذا إلا للملامية خاصة فهم المجهولون في الدنيا لأنهم لا يتميزون بأمر يخرجهم عن حكم ما يعطيه موطن الدنيا فإن قام به حال يناقض الموطن من وجه وهو حال النبوة أعني الرسالة فإنه لا بد أن يحكم عليه الحال وهو الذي تعطيه الحكمة فيتميز في موطن الدنيا بأنه عند الله بمكان ولم يكن له ذلك ولكن حال التبليغ يطلب‏\nالدلالة على صحة ما يدعو إليه فهذا هو حكم الحال فإن كان وليا دون رسول تعين عليه الجري بحكم الموطن لا بحكم الحال فإن ظهر من هذا الولي ما يدل على منزلته من ربه بما يعطي من التمكن والتصرف في العالم وليس برسول فهو رعونة وصاحب نقص فإن ظهر بعلم غريب فهل يكون مثل صاحب الحال النفسي المؤثر أم لا قلنا لا فإن العلم الذي لا يكون معه أثر كوني سوى نفسه لا يقوم عند العامة ولا عند الخاصة له ذلك الوزن ولا لصاحبه ذلك التميز إلا عند الأكابر من أهل الله وممن له تحقق واستشراف على ذلك المقام الأعلى ولذلك قال الله لنبيه صَلَّى اللهُ عَليهِ وسَلَّم قُلْ رَبِّ زِدْنِي عِلْماً من أجل الموطن وما أظهر آية في دعائه إلى الله في كل وقت ولا عند كل مدعو مع حاجته إلى ذلك ولكن لما كان مأمورا بالتبليغ ما عليه إلا البلاغ فإن شاء الحق أيده كان بالمعجزات وإن شاء زاد دعاؤه من أرسل إليهم فرارا مما دعاهم إليه من توحيده كنوح عليه السلام فأخبر فقال إِنِّي دَعَوْتُ قَوْمِي لَيْلًا ونَهاراً فَلَمْ يَزِدْهُمْ دُعائِي إِلَّا فِراراً وإِنِّي كُلَّما دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصابِعَهُمْ في آذانِهِمْ واسْتَغْشَوْا ثِيابَهُمْ وأَصَرُّوا واسْتَكْبَرُوا اسْتِكْباراً وللحكماء السياسة في العالم بالطريقة المشروعة التي شرع الله لعباده ليسلكوا فيها فيقودهم ذلك السلوك إلى سعادتهم انتهى الجزء السابع ومائة\n\n\n(بسم الله الرحمن الرحيم)\n\n",
    "en": "## Chapter One Hundred and Twenty-Six: Concerning the Knowledge of the Station of Wisdom (الحكمة) and the Wise Ones (الحكماء)\n\nThe Wise One (الحكيم) orders all things\nIn the eyes of the Universes (الأكوان) and the Names (الأسماء).\n\nHe proceeds according to the Pre-Eternal Knowledge (العلم القديم) by His ruling,\nIn the radiant, adorned Wisdom.\n\nThus you see Him granting every thing its nature/form (خلقه),\nIn the state of ease and hardship.\n\nAnd He remains transcendent (منزها) above accidents (العوارض),\nIn the beginning of what things desire.\n\nBut He is the Infallible (المعصوم) in His Acts (أفعاله),\nIn all that proceeds from desires.\n\n### That Wisdom is Knowledge of a Specific Known Thing\n\nKnow, may Allah strengthen you, that Wisdom (الحكمة) is knowledge (علم) of a specific known thing. It is an attribute (صفة) that rules and by which judgment is passed, but upon which judgment is not passed. Its active participle is *Hakim* (حكيم), so the ruling (الحكم) belongs to it. The active participle derived from the ruling (*hukm*), which is its effect, is *hakim* (ruler) and *hakam* (judge). It is for this reason that the bridle (الرسن) used to control the horse is called *hikma*.\n\nThus, every knowledge that possesses this description is Wisdom. The things upon which a certain judgment is passed seek, through their essence and their preparedness (استعدادها), what they need. Nothing grants them that except the one whose description is Wisdom and whose Name is The Wise One (الحكيم).\n\nDoes preparedness have a ruling in this one called *Hakim*? Or does Wisdom have the ruling? Or is it the combination? As for preparedness alone, it has no effect. We see someone who deserves a certain matter by their preparedness, and they are before a knower, but that knower is not Wise, so he does not grant them what they deserve because he is ignorant [of the proper application]. He might withhold what they deserve even though he is described by the knowledge of what that thing deserves and what it does. Thus, the ruling is neither by the combination nor by the individual parts.\n\nTherefore, we know that this refers back to a fourth matter, which is neither Wisdom, nor the Knower of Wisdom, nor the preparedness of the thing seeking Wisdom. That additional matter is what motivates him to grant that thing its due right, because of his knowledge of what it deserves. It is only then that he is called *Hakim* (Wise).\n\nIf this action does not proceed from him, he is merely a knower of Wisdom, and of what Wisdom deserves, and of what that thing deserves by its preparedness, but he is not called *Hakim* except through the existence of this application, which is His saying: <<أَعْطى‏ كُلَّ شَيْءٍ خَلْقَهُ>> (He gave every thing its creation/form) [Q. 20:50], derived from His Name, The Wise One. It is through the granting that Wisdom provides that He is called *Hakim*. Thus, it is detailed, practical knowledge (علم تفصيلي عملي). Knowledge of the general (المجمل) is detailed knowledge, for it separates it from detailed knowledge; otherwise, the general would not be distinguished from the detailed. Therefore, among Wisdom is the knowledge of the general and generalization, and the detailed and detailing. Allah the Exalted said: <<وآتَيْناهُ الْحِكْمَةَ>> (And We gave him Wisdom)—which is action—<<وفَصْلَ الْخِطابِ>> (and decisive speech) [Q. 38:20]—which is discourse.\n\n### The Station of the Wise One is the Station of the Malamiyya, for they are Unknown in the World\n\nThe Wise One proceeds according to every spiritual state (حال) and station (موطن) in accordance with that state and that station. This belongs exclusively to the Malamiyya (الملامية), for they are the unknown ones in the world, because they are not distinguished by any matter that removes them from the ruling granted by the station of the world.\n\nIf a state arises in him that contradicts the station in one respect—namely, the state of prophethood, meaning messengership (الرسالة)—then the state must rule over him, and this is what Wisdom grants. Thus, he is distinguished in the station of the world by having a high rank with Allah, which he did not previously possess. However, the state of conveying the message (التبليغ) demands evidence for the validity of what he calls to. This is the ruling of the state.\n\nIf he is a saint (ولي) but not a messenger, he is obliged to proceed according to the ruling of the station, not the ruling of the state. If this saint manifests something that indicates his rank with his Lord—such as the power and disposal (التصرف) in the Cosmos (العالم) that he is granted—while not being a messenger, then this is recklessness and a sign of deficiency.\n\nIf he manifests through strange knowledge, is he then like the possessor of the effective psychic state or not? We say no. For knowledge that is not accompanied by a cosmic effect (أثر كوني) other than itself does not carry that weight, neither among the common people nor among the elite, nor does its possessor gain that distinction, except among the great ones among the People of Allah (أهل الله) and those who have realized and glimpsed that highest station.\n\nFor this reason, Allah said to His Prophet (may Allah bless him and grant him peace): <<قُلْ رَبِّ زِدْنِي عِلْماً>> (Say: My Lord, increase me in knowledge) [Q. 20:114]—due to the station. He did not manifest a sign in his call to Allah at every moment or to every person he called, despite his need for it. However, since he was commanded to convey the message, his duty was only the conveyance. If The Real (الحق) willed, He supported him with miracles (المعجزات); and if He willed, his call only increased those sent to him in flight from the Oneness (توحيده) to which he called them, like Noah (peace be upon him). He reported, saying: <<إِنِّي دَعَوْتُ قَوْمِي لَيْلًا ونَهاراً فَلَمْ يَزِدْهُمْ دُعائِي إِلَّا فِراراً وإِنِّي كُلَّما دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصابِعَهُمْ في آذانِهِمْ واسْتَغْشَوْا ثِيابَهُمْ وأَصَرُّوا واسْتَكْبَرُوا اسْتِكْباراً>> (Indeed, I called my people night and day, but my call only increased their flight. And indeed, every time I called them that You might forgive them, they put their fingers in their ears, covered themselves with their garments, persisted, and were proudly arrogant with great arrogance) [Q. 71:5-7].\n\nThe Wise Ones possess governance (السياسة) in the World through the prescribed path (الطريقة المشروعة) that Allah has legislated for His servants to follow, so that this following may lead them to their felicity.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "(باب ایک سو چھبیس: حکمت اور حکماء کے مقام کی معرفت میں)\n\nحکیم (الحکیم) ہی اشیاء کو ترتیب دیتا ہے\nکائناتوں (الأکوان) اور اسماء کی نظروں میں\n\nوہ اپنے حکم کے ساتھ علم قدیم کے مطابق چلتا ہے\nاس حکمت میں جو مزین اور روشن ہے\n\nپس تم اسے دیکھتے ہو کہ وہ ہر شے کو اس کی خلقت عطا کرتا ہے\nخوشی اور غم کی حالت میں\n\nاور وہ عوارض (عارضی نقائص) سے ہمیشہ پاک رہتا ہے\nاشیاء کی ابتدا میں جن کی وہ خواہش کرتی ہیں\n\nلیکن وہ اپنے افعال میں معصوم (محفوظ) ہے\nہر اس چیز میں جو خواہشات سے جاری ہوتی ہے\n\n### (یہ کہ حکمت ایک خاص معلوم کا علم ہے)\n\nجان لو، اللہ تمہاری مدد کرے، کہ حکمت (الحکمۃ) ایک خاص معلوم (معلوم خاص) کا علم ہے، اور یہ ایک ایسی صفت ہے جو حکم کرتی ہے اور جس کے ذریعے حکم کیا جاتا ہے، لیکن اس پر حکم نہیں کیا جاتا۔ اور اس کا اسم فاعل حکیم (حکیم) ہے۔ پس حکم (الحكم) اسی کے لیے ہے۔ اور اس حکم کا جو اس کا اثر ہے، اس کا اسم فاعل حاکم (حاکم) اور حکم (حکم) ہے۔ اسی وجہ سے اس لگام کو جس سے گھوڑے کو قابو کیا جاتا ہے، حِکمۃ (لگام) کہا جاتا ہے۔ پس ہر وہ علم جو یہ صفت رکھتا ہے، وہ حکمت (الحکمۃ) ہے۔\n\nاور وہ اشیاء جن پر کسی چیز کا حکم لگایا جاتا ہے، وہ اپنی ذات اور اپنی استعداد (الاستعداد) کے ذریعے اس چیز کا تقاضا کرتی ہیں جس کی انہیں ضرورت ہے۔ اور انہیں وہ چیز صرف وہی عطا کرتا ہے جس کی صفت حکمت (الحکمۃ) ہو اور جس کا نام الحکیم (حکیم) ہو۔ تو کیا اس حکیم کہلانے والے میں استعدادات کا حکم ہے، یا حکمت کا حکم ہے، یا دونوں کا مجموعہ؟\n\nجہاں تک صرف استعداد (الاستعداد) کا تعلق ہے، تو اس کا کوئی اثر نہیں ہوتا۔ کیونکہ ہم دیکھتے ہیں کہ کوئی شخص اپنی استعداد کے باعث کسی امر کا مستحق ہوتا ہے، اور وہ ایک عالم کے سامنے ہوتا ہے لیکن وہ حکیم نہیں ہوتا، تو وہ اسے وہ چیز عطا نہیں کرتا جس کا وہ مستحق ہے، کیونکہ وہ جاہل ہے۔ اور بسا اوقات وہ اسے اس چیز سے روک دیتا ہے جس کا وہ مستحق ہے، باوجود اس کے کہ وہ اس امر کے استحقاق اور اس کے فعل کے علم سے موصوف ہو۔ پس نہ تو مجموعے کا حکم ہے اور نہ ہی انفراد کا۔\n\nتو ہمیں معلوم ہوا کہ یہ ایک چوتھے امر کی طرف لوٹتا ہے، جو نہ تو حکمت ہے، نہ حکمت کا جاننے والا، اور نہ ہی اس امر کی استعداد جو حکمت کا طالب ہے۔ اور وہ زائد امر ہی ہے جو اسے اس امر کا حق دینے پر آمادہ کرتا ہے، کیونکہ وہ جانتا ہے کہ وہ کس چیز کا مستحق ہے۔ اور تب ہی اسے حکیم (حکیم) کہا جاتا ہے۔\n\nاور جب تک اس سے یہ استعمال ظاہر نہ ہو، تو وہ حکمت کا اور اس کے استحقاق کا اور اس امر کے اپنی استعداد کے باعث مستحق ہونے کا عالم تو ہوتا ہے، لیکن اسے حکیم نہیں کہا جاتا، مگر اس استعمال کے پائے جانے سے، اور وہ اس کا قول ہے: **أَعْطى‏ كُلَّ شَيْءٍ خَلْقَهُ** (اس نے ہر چیز کو اس کی خلقت عطا کی)۔ یہ اس کے نام الحکیم (حکیم) کی طرف سے ہے۔ پس اس عطا کے ذریعے جو حکمت عطا کرتی ہے، اسے حکیم کہا جاتا ہے۔\n\nپس یہ ایک تفصیلی عملی علم ہے۔ اور مجمل کا علم بھی تفصیلی علم ہے، کیونکہ اس نے اسے تفصیلی علم سے الگ کیا ہے۔ اگر ایسا نہ ہوتا تو مجمل (اجمالی) مفصل (تفصیلی) سے ممتاز نہ ہوتا۔ پس حکمت میں سے مجمل کا علم اور تجميل (اجمال پیدا کرنا) اور مفصل کا علم اور تفصیل (تفصیل پیدا کرنا) ہے۔ اللہ تعالیٰ نے فرمایا: **وَآتَيْنَاهُ الْحِكْمَةَ** (اور ہم نے اسے حکمت عطا کی) (عملی طور پر) **وَفَصْلَ الْخِطَابِ** (اور فیصلہ کن بات) (قول میں)۔\n\n### (حکیم کا مقام ملامتیہ کا مقام ہے، کیونکہ وہ دنیا میں گمنام ہوتے ہیں)\n\nپس حکیم (الحکیم) ہر حال اور ہر مقام کے ساتھ اس حال اور اس مقام کے مطابق چلتا ہے۔ اور یہ خاص طور پر صرف ملامتیہ (الملامیۃ) کے لیے ہے۔ پس وہ دنیا میں گمنام ہوتے ہیں، کیونکہ وہ کسی ایسے امر سے ممتاز نہیں ہوتے جو انہیں دنیاوی مقام کے حکم سے باہر نکال دے۔\n\nاگر اس کے ساتھ کوئی ایسا حال قائم ہو جائے جو ایک پہلو سے مقام کے منافی ہو، اور وہ نبوت کا حال ہو، یعنی رسالت، تو لازمی ہے کہ حال اس پر حکم کرے، اور یہی وہ چیز ہے جو حکمت (الحکمۃ) عطا کرتی ہے۔ پس وہ دنیاوی مقام میں اس بات سے ممتاز ہو جاتا ہے کہ وہ اللہ کے نزدیک ایک مقام رکھتا ہے، حالانکہ اس کے لیے یہ نہیں تھا۔ لیکن تبلیغ کا حال اس بات کی دلیل کا تقاضا کرتا ہے جس کی طرف وہ دعوت دیتا ہے۔ پس یہ حال کا حکم ہے۔\n\nاگر وہ ولی ہو، رسول نہ ہو، تو اس پر مقام کے حکم کے مطابق چلنا لازم ہے، نہ کہ حال کے حکم کے مطابق۔ اگر اس ولی سے کوئی ایسی چیز ظاہر ہو جو دنیا میں تصرف اور تمکن (اختیار) کے ذریعے اس کے رب کے ہاں اس کے مرتبے پر دلالت کرے، اور وہ رسول نہ ہو، تو یہ رعونت (تکبر) اور نقص (کمی) کا حامل ہے۔\n\nاگر وہ کسی عجیب علم کے ساتھ ظاہر ہو، تو کیا وہ مؤثر نفسیاتی حال والے شخص کی طرح ہوگا یا نہیں؟ ہم کہتے ہیں: نہیں۔ کیونکہ وہ علم جس کے ساتھ اس کی ذات کے علاوہ کوئی کونیاتی اثر نہ ہو، نہ تو عوام کے نزدیک اس کا کوئی وزن ہوتا ہے اور نہ ہی خواص کے نزدیک، اور نہ ہی اس کے حامل کو وہ امتیاز حاصل ہوتا ہے، سوائے اہل اللہ کے اکابر کے نزدیک اور ان کے نزدیک جنہیں اس اعلیٰ مقام پر تحقق (تحقق) اور استشراف (جھانکنے) کا موقع ملا ہو۔\n\nاسی لیے اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم سے فرمایا: **قُلْ رَبِّ زِدْنِي عِلْماً** (کہو: اے میرے رب! میرے علم میں اضافہ فرما)۔ یہ مقام کی وجہ سے تھا۔ اور آپ صلی اللہ علیہ وسلم نے ہر وقت اور ہر مدعو کے سامنے اللہ کی طرف اپنی دعوت میں کوئی نشانی ظاہر نہیں کی، باوجود اس کے کہ آپ کو اس کی ضرورت تھی۔ لیکن جب آپ کو تبلیغ کا حکم دیا گیا، تو آپ پر صرف پہنچا دینا لازم تھا۔ اگر حق (الحق) چاہتا تو معجزات کے ذریعے آپ کی تائید کرتا، اور اگر چاہتا تو آپ کی دعا ان لوگوں کے فرار میں اضافہ کر دیتی جن کی طرف آپ کو بھیجا گیا تھا، اس توحید سے جس کی طرف آپ نے انہیں بلایا تھا، جیسے نوح علیہ السلام۔\n\nپس انہوں نے خبر دی اور کہا: **إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا ۝ فَلَمْ يَزِدْهُمْ دُعَائِي إِلَّا فِرَارًا ۝ وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا** (میں نے اپنی قوم کو رات دن بلایا، مگر میرے بلانے سے ان کا بھاگنا ہی بڑھا ۝ اور جب بھی میں نے انہیں بلایا تاکہ تو انہیں بخش دے، تو انہوں نے اپنی انگلیاں اپنے کانوں میں ڈال لیں اور اپنے کپڑے اوڑھ لیے، اور اڑ گئے اور بڑا تکبر کیا)۔\n\nاور حکماء (الحکماء) کے لیے دنیا میں سیاست (انتظام) اس شرعی طریقے کے مطابق ہوتی ہے جو اللہ نے اپنے بندوں کے لیے مقرر کیا ہے تاکہ وہ اس پر چلیں، اور یہ سلوک انہیں ان کی سعادت کی طرف لے جائے۔\n\nایک سو ساتواں حصہ مکمل ہوا۔\n\n(شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے)",
    "fa": "باب صد و بیست و ششم در معرفت مقام حکمت و حکیمان\n\nحکیم، مرتب‌کننده اشیاست\nدر دیدگان کائنات و اسماء (الأسماء)\n\nبا علم قدیم، به حکم خویش جاری است\nدر حکمت آراسته و درخشان\n\nپس او را می‌بینی که به هر چیز خلقتش را می‌بخشد\nدر حالت آسایش و سختی\n\nو پیوسته از عوارض (العوارض) منزه است\nدر آغاز آنچه اشیا بدان میل دارند\n\nاما او در افعال خویش معصوم است\nدر هر آنچه از هواها (الأهواء) جاری می‌شود\n\n### [اینکه حکمت، علمی است به معلومی خاص]\n\nبدان – خداوند تو را تأیید کند – که حکمت (الحکمة)، علمی است به معلومی خاص، و آن صفتی است که حکم می‌کند و به واسطه آن حکم می‌شود، اما بر آن حکم نمی‌شود. اسم فاعل آن «حکیم» است، پس حکم از آنِ حکمت است. و اسم فاعل از «حکم» که اثر آن است، «حاکم» و «حَکَم» است. به همین دلیل، افساری که اسب به وسیله آن مهار می‌شود، «حِکمه» نامیده شده است. پس هر علمی که این وصف را داشته باشد، حکمت است. و اشیایی که بر آن‌ها به چیزی حکم شده است، به ذات و استعداد خود، آنچه را بدان نیاز دارند، طلب می‌کنند. و آن را جز کسی که وصفش حکمت و نامش حکیم است، به آن‌ها نمی‌دهد. پس آیا استعدادها در این شخص که حکیم نامیده می‌شود، حکمی دارند، یا حکمت حکم دارد، یا مجموعه آن دو؟ اما استعداد به تنهایی اثری ندارد؛ زیرا ما کسی را می‌بینیم که به واسطه استعدادش مستحق امری است، در حالی که نزد عالمی است که حکیم نیست، پس آنچه را استحقاق دارد به او نمی‌دهد، به دلیل نادانی‌اش (نسبت به نحوه اعطا). و گاهی آنچه را استحقاق دارد، از او منع می‌کند، با وجود اینکه به علم به آنچه آن امر مستحق آن است و آنچه باید انجام شود، موصوف است. پس نه به مجموعه (علم و استعداد) و نه به تنهایی (استعداد) نیست. بنابراین دانستیم که این امر به امر چهارمی بازمی‌گردد که نه حکمت است، نه عالم به حکمت، و نه استعداد امری که حکمت را می‌طلبد. و آن امر زائد، همان چیزی است که او را برمی‌انگیزد تا حق آن امر را به دلیل علمش به آنچه استحقاق دارد، به آن بدهد. در این هنگام است که حکیم نامیده می‌شود. و اگر این عمل از او سر نزند، او عالم به حکمت و به آنچه حکمت مستحق آن است و آنچه آن امر به واسطه استعدادش مستحق آن است، می‌باشد، اما حکیم نامیده نمی‌شود، مگر با وجود این به کارگیری، که همان قول خداوند است: «أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ» (طه: ۵۰) [به هر چیزی خلقتش را عطا کرد] از اسم الحکیم (الحکیم). پس به واسطه اعطایی که حکمت می‌بخشد، حکیم نامیده می‌شود. پس حکمت، علمی تفصیلی و عملی است. و علم به مجمل، خود علم تفصیلی است، زیرا آن را از علم تفصیلی جدا کرده است؛ وگرنه مجمل از مفصل متمایز نمی‌شد. پس از حکمت است، علم به مجمل و تجميل (اجمال) و مفصل و تفصيل. خداوند متعال می‌فرماید: «وآتَيْناهُ الْحِكْمَةَ» (ص: ۲۰) [و به او حکمت دادیم] در عمل، «وفَصْلَ الْخِطابِ» (ص: ۲۰) [و فصل الخطاب] در گفتار.\n\n### [جایگاه حکیم، جایگاه ملامتیه است، زیرا آنان در دنیا ناشناخته‌اند]\n\nپس حکیم با هر حال و جایگاهی، مطابق آن حال و آن جایگاه، جاری می‌شود. و این جز برای ملامتیه (الملامیة) خاص نیست. آنان در دنیا ناشناخته‌اند، زیرا به امری متمایز نمی‌شوند که آن‌ها را از حکم آنچه جایگاه دنیا اقتضا می‌کند، خارج سازد. اما اگر حالی در او پدید آید که از جهتی با جایگاه (موطن) تناقض داشته باشد، و آن حال نبوت، یعنی رسالت باشد، در این صورت ناگزیر است که حال بر او حکم کند، و این همان چیزی است که حکمت به او می‌بخشد. پس در جایگاه دنیا متمایز می‌شود به اینکه نزد خداوند دارای مقامی است، در حالی که پیش از آن چنین نبود. اما حال تبلیغ، دلالت بر صحت آنچه بدان دعوت می‌کند را می‌طلبد، پس این حکم حال است. و اگر ولی باشد نه رسول، بر او واجب است که به حکم جایگاه (موطن) جاری شود، نه به حکم حال. اگر از این ولی چیزی ظاهر شود که بر منزلت او نزد پروردگارش دلالت کند، از قبیل تمکن و تصرف در عالم، در حالی که رسول نیست، این از روی رعونت و نشانه‌ی نقص است. اگر با علم غریبی ظاهر شود، آیا مانند صاحب حال نفسانی مؤثر خواهد بود یا خیر؟ می‌گوییم خیر. زیرا علمی که اثر کونی (کیهانی) جز خود آن علم به همراه نداشته باشد، نه نزد عامه و نه نزد خاصه، آن وزن را ندارد و صاحبش آن تمایز را نمی‌یابد، مگر نزد بزرگان از اهل الله و کسانی که به آن مقام اعلی تحقق (تحقق) و اشراف دارند. و به همین دلیل خداوند به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «قُلْ رَبِّ زِدْنِي عِلْماً» (طه: ۱۱۴) [بگو پروردگارا، علم مرا زیاد کن] به خاطر جایگاه (موطن). و او در دعوتش به سوی خدا، در هر زمان و نزد هر مدعو، با وجود نیازش به آن، معجزه‌ای آشکار نکرد، بلکه چون مأمور به تبلیغ بود، وظیفه‌اش فقط رساندن پیام بود. اگر حق (الحق) می‌خواست، او را با معجزات تأیید می‌کرد، و اگر می‌خواست، دعوت او بر فرار کسانی که به سوی آن‌ها فرستاده شده بود، از توحیدی که بدان دعوت می‌کرد، می‌افزود، مانند نوح (علیه السلام) که خبر داد و گفت: «إِنِّي دَعَوْتُ قَوْمِي لَيْلًا ونَهاراً فَلَمْ يَزِدْهُمْ دُعائِي إِلَّا فِراراً * وإِنِّي كُلَّما دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصابِعَهُمْ في آذانِهِمْ واسْتَغْشَوْا ثِيابَهُمْ وأَصَرُّوا واسْتَكْبَرُوا اسْتِكْباراً» (نوح: ۵-۷) [من قوم خود را شب و روز دعوت کردم * اما دعوت من جز بر فرارشان نیفزود * و من هر بار که آن‌ها را دعوت کردم تا تو آن‌ها را بیامرزی، انگشتانشان را در گوش‌هایشان قرار دادند و جامه‌هایشان را بر سر کشیدند و اصرار ورزیدند و به شدت تکبر کردند]. و حکیمان در عالم، سیاست را به روش مشروعی که خداوند برای بندگانش تشریع کرده است، به کار می‌برند تا در آن سلوک کنند و آن سلوک آن‌ها را به سعادتشان رهنمون شود. جزء صد و هفتم به پایان رسید.\n\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 2
}