{
  "id": 303,
  "title": {
    "ar": "الباب الثالث وثلاثمائة في معرفة منزل العارف الجبرئيلي من الحضرة المحمدية",
    "en": "Chapter 303: Concerning the Knowledge of the Station of the Gabrielic Gnostic within the Muhammadan Presence (الحضرة المحمدية)",
    "ur": "باب تین سو تین: محمدی حضور (الحضرة المحمدية) سے عارف جبرئیلی کے مقام کی معرفت کے بیان میں",
    "fa": "باب سیصد و سوم در شناخت منزل عارف جبرئیلی از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب الثالث وثلاثمائة في معرفة منزل العارف الجبرئيلي من الحضرة المحمدية»\n\n\n> للشمس في الفلك الأقصى علامات *** يدري بذلك أقوام إذا ماتوا\n\n\n> تسري به أنفس مثلي مطهرة *** لا تنجلي لهم إلا إذا باتوا\n\n\n> من الخمور سكارى في محاربهم *** وما لهم في وجود السكرنيات‏\n\n\n> فلو أراد زوال السكر صحوهم *** تتلى عليهم من القرآن آيات‏\n\n\n### [أن من الأرواح العلوية السماوية المعبر عنها بالملائكة هم أصحاب أمر]\n\n\nاعلم أيدك الله أن من الأرواح العلوية السماوية المعبر عنها بالملائكة مقدمين لهم أمر مطاع فيمن قدموا عليه من الملإ الأعلى وهم أصحاب أمر لا أصحاب نهي ف لا يَعْصُونَ الله ما أَمَرَهُمْ ويَفْعَلُونَ ما يُؤْمَرُونَ وقد نبه الله تعالى على إن جبريل عليه السلام منهم بقوله مُطاعٍ ثَمَّ أَمِينٍ ولا يكون مطاعا إلا من له الأمر فيمن يطيعه‏\n\n\n### [إن للعارف أثر في العالم العلوي والسفلي بقدر مرتبة ذلك الروح‏]\n\n\nفاعلم إن العارف إذا كان يمده من‏\nالملإ الأعلى روح من هذه الأرواح الآمرة التي لها التقدم على غيرها كإسرافيل وإسماعيل وعزرائيل وجبريل وميكائيل والنور والروح وأمثالهم فإن العارف يكون له أثر في العالم العلوي والسفلي بقدر مرتبة ذلك الروح الذي يتولاه من هناك فمن تولاه إسرافيل يكون له من الأثر بحسب مرتبة إسرافيل وما يكون تحت نظره وأمره وكذلك كل روح بهذه المثابة له رجل أو امرأة على مقامه وهو الذي تسمعونه من الطائفة من أن فلانا على قلب آدم أو جماعة على قلب آدم وجماعة على قلب إبراهيم أي لهم من المنازل ما لإبراهيم وآدم من مقام الولاية التي لهم لا من مقام النبوة وإن كان لهم منها شرب فمن بعض مقاماتها لا كلها كالرؤيا جزء من أجزاء النبوة وغيرها وأما النبوة بالجملة فلا تحصل إلا لنبي وأما الولي فلا إلا أن يكون له من ظهره تمده وتقويه وتؤيده هكذا أخذتها مشاهدة من نفسي وأخبرت أن كل ولي كذا يأخذها من المكملين في الولاية ويترجم عنها ولكن من حجاب الظهر ويكون للنبي من الفوق أو من الأمام تنزل على قلبه أو يخاطب بها في سمعه فالولي يجد أثرها ذوقا وهو فيها كالأعمى الذي يحس بجانبه شخص ولا يعرف من هو ذلك الشخص ولهذا تقول الطائفة لا يعرف الله إلا الله ولا النبي إلا النبي ولا الولي إلا ولي مثله فالنبي ذو عين مفتوحة لمشاهدة النبوة والولي ذو عين مفتوحة لمشاهدة الولاية ذو عين عمياء لمشاهدة النبوة فإنها من خلفه فهو فيها كحافظ القرآن لأنه من حفظ القرآن فقد أدرجت النبوة بين جنبيه ولم يقل في صدره ولا بين عينيه ولا في قلبه فإن تلك رتبة النبي لا رتبة الولي وأين الاكتساب من التخصيص فالنبوة اختصاص من الله يختص بها من يَشاءُ من عِبادِهِ وقد أغلق ذلك الباب وختم برسول الله محمد صَلَّى اللهُ عَليهِ وسَلَّم والولاية مكتسبة إلى يوم القيامة فمن تعمل في تحصيلها حصلت له والتعمل في تحصيلها اختصاص من الله يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ قال تعالى إِنَّكَ لا تَهْدِي من أَحْبَبْتَ ولكِنَّ الله يَهْدِي من يَشاءُ كما قال تعالى نَهْدِي به من نَشاءُ من عِبادِنا فبنور النبوة تكتسب الولاية فالأولياء هم ولاة الحق على عباده والخواص منهم الأكابر يقال لهم رسل وأنبياء ومن نزل عنهم بقي عليه اسم الولاية فالولاية الفلك المحيط الجامع للكل فهم وإن اجتمعوا في منصب الولاية فالولاة لهم مراتب فالسلطان وال على الخلق والقاضي وال والمحتسب وال وأين رتبة السلطان من مرتبة صاحب الحسبة وكلهم لهم الأمر في الولاية وهكذا ما ذكرناه في حق الأنبياء والرسل والأقطاب كل ولي على مرتبته فالسلطنة لا تحصل بالكسب جملة وما عداها يتعمل في تحصيلها فثم وال يقدم للسلطان خدمة من مال أو متاع فيوليه السلطان المنصب الذي يليق به وخدم عليه وهو بمنزلة من تحصل له الولاية من عند الله بالصدقة والقرض الحسن وصلة الرحم ومن الناس من يلازم خدمة السلطان في ركوبه وخروجه ويتعرض له فإذا أمر السلطان بأمر يفعل ما لم يعين أحدا بادر هذا الشخص لامتثال أوامر السلطان فيراه السلطان ملازما مشاهدته مبادرا لأوامره فيوليه فهذا بمنزلة من تحصل له الولاية من الله بمراقبته والمبادرة لأوامر الله التي ندب إليها لا التي افترضها عليه وهوقوله ولا يزال العبد يتقرب إلي بالنوافل حتى أحبه فإذا أحببته كنت له سمعا وبصرا ويدا ومؤيدا\n\n\nفهذا معنى الكسب في الولاية وكذلك من تعرض للسلطان وخدمه عن أمره وواجهه بالأمر فرأى محافظته على الأوامر السلطانية التي أوجبها عليه لا يغفل عنها ولا يتأولها بل يأخذها على الوجوب ويسارع إليها ويسبق إلى امتثالها حين يبطى‏ء عنها ويتأولها من هو معه في رتبته فيرى له السلطان ذلك فيوليه ويعطيه النيابة عنه في رعيته كذلك المسارع إلى ما أوجب الله عليه من الطاعات وافترضها عليه وأخذ أوامره على الوجوب ولم يتأول عليه كلامه ولا أمره فإن الله يصطفيه ويوليه أكبر ولاياته وقد عرفت الكسب ومحله والاختصاص وأهله فاسلك عليه فهو الباب الذي من دخل عليه نجا وتولى ودنا وتدلى ونودي بالأفق الأعلى‏\n\n\n### [الولي هو من الأمناء الذين لله تعالى في خلقه‏]\n\n\nواعلم أن الولي الذي تمتد إليه رقيقة روحانية جبرئيلية هو من الأمناء الذين لله تعالى في خلقه الذين لا يعرفون في الدنيا فإذا كان في الآخرة وظهرت منزلته هناك وما كان ينطوي عليه في هذه الدار مما لا يعرف هنا فإنه كان إما تاجرا في السوق أو بائعا صاحب حرفة أو صنعة أو واليا من ولاة المسلمين من حسبة أو قضاء أو سلطنة وبينه وبين الله أسرار لا تعرف منه فيقال عنه يوم القيامة عند ظهور ما كان عنده في الآخرة إن الله أمناء حيث كان هذا عندهم وما ظهروا به في الدنيا حين ظهر غيرهم بما أعطاه الله من الكشف بالكلام على الخواطر أو على‏\nالأرض واختراق الهواء والمشي على الماء والأكل من الكون وما ظهر عليه شي‏ء من ذلك وهو في قوته وتحت تصريفه وأبي أن يكون إلا على ما هم عليه عامة المسلمين إلا وهم الملامية من أهل هذا الطريق خاصة كبيرهم وصغيرهم فيكون هذا الشخص في الأمة المحمدية كجبريل في الأمة الملكية مطاع الباطن فإن جبريل روح وله الباطن غير مطاع في الظاهر لو أمر لكنه لا يأمر فإنه ما امتاز عن العامة بشي‏ء فلو امتاز عندهم بخرق عادة تظهر منه مما لا يقتضيها الموطن عظم وامتثل أمره للتفوق الذي ظهر له على العامة فهذا سبب رد أمره لو أمر لكنه لا يأمر ولكنه في الباطن مطاع الأمر ورأينا من هؤلاء جماعة مثل عبد الله بن تاخمست ومثل ابن جعدون الحناوي وهو من الأوتاد كان كبير الشأن فهذا العارف الذي له هذا المقام الذي ذكرناه له التمكن من نفسه ومن مكن من نفسه فهو أقوى خلق الله فإن النفس تريد الظهور في العالم بالربوبية وصاحب هذا المقام قد خلع الله عليه من أوصاف السيادة وقواه بحيث أن يقول للشي‏ء كن فيكون ذلك الشي‏ء لمكانته من ربه فكان من قوته أنه ملك نفسه فلم يظهر عليه من ذلك شي‏ء لا في أقواله ولا في أفعاله ولا عبادته وهو ممن‏\n\n\nنص عليه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الحديث الحسن الغريب حين خلق الله الجبال عند ميد الأرض فرست وسكن ميدها فقالت الملائكة يا ربنا هل خلقت شيئا أشد من الجبال قال نعم الحديد قالت يا ربنا هل خلقت شيئا أشد من الحديد قال نعم النار قالت يا ربنا هل خلقت شيئا أشد من النار قال نعم الماء قالت يا ربنا هل خلقت شيئا أشد من الماء قال نعم الهواء قالت يا ربنا هل خلقت شيئا أشد من الهواء قال المؤمن يتصدق بيمينه لا تعرف بذلك شماله أو قال فيخفيها عن شماله‏\n\n\nوهذه حالة من ذكرنا وقد وصفه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بالقوة وأن له منها أكثر مما ذكره من الأقوياء فإن النفس مجبولة على حب الرئاسة على جنسها هذا في أصل جبلتها وخلقها ومن قيل له اخرج عن جبلتك وطبعك فقد كلف أمرا عظيما فسبحان من رزقهم من القوة بحيث إن هان عليهم مثل هذا وسبب ذلك أنه أعطاهم من المعرفة بالله التي خلقوا لها ما شغلهم الوفاء بحق العبودة عن مثل هذا فهم على الطريقة المثلى التي اختارها الله لعباده ولهم المكانة الزلفى بثبوتهم عليها مكرمون عند الله وهذا العارف الذي بهذه المثابة من الأفراد الذين أفردهم الحق إليه واختصهم له وأرخى الحجاب حجاب العادة بينهم وبين الخلق فاستخلصهم لنفسه ورضي عنهم ورضوا عنه وأعطى صاحب هذا المقام من القوي المؤثرة في العالم الأعلى والأسفل ألفا ومائتي قوة قوة واحدة منها لو سلطها على الكون أعدمته ومع هذا التمكن من هذه القوي إذا نزل الذباب عليه لا يقدر على إزالته حياء من الله ومعرفة فأما المعرفة التي له فيه فإن ذلك الذباب رسول من الحق إليه وهو الذي أنزله عليه فهو يراقب ما جاءه به من العلم فإذا فرغ من رسالته إن شاء نهض إن استدعاه خالقه وإن شاء أقام فيكون هذا العارف كرسي ذلك الرسول الذبابي فهذا سبب تركه إياه ولا يشرده عن نفسه كما تفعله العامة للمعرفة وأما الحياء من الله فإن في إزالة الذباب راحة للنفس ونعيما معجلا وما خلق الله الإنسان في هذه الدار للراحة والنعيم وإنما خلق لعبادة ربه فيستحي إن يراه الله في طلب الراحة من أذى الذباب حيث إن الموطن لا يقتضيه فإن قلت فالمتنعم في الدنيا المباح له التنعم في الحلال قلنا لا نمنع ذلك في حق غير العارف ولكن العارف تحت سلطان التكليف فما من نعمة ينعم الله بها عليه باطنة كانت أو ظاهرة إلا والتكليف من الله بالشكر عليها يصحبها فذلك التكليف ينغص على العارف التنعم بتلك النعمة لاشتغاله بموازنة الشكر عليها وإذا وفى الشكر عليها فالوفاء به نعمة من الله عليه يجب عليه الشكر عليها فلا يزال متعوب الخاطر في إقامة الوزن بالقسط أن لا يخسر الميزان ومن هذه حالته كيف ينعم فظاهرها نعمة وباطنها غصص وهو لا يبرح يتقلب في نعم الله ظاهرا وباطنا ولا تؤثر عنده إلا ألما وتنغيصا والعامة تفرح بتلك النعم وتتصرف فيها أشرا وبطرا والعارف مسدود عليه في الدنيا باب الراحة في قلبه وإن استراح في ظاهره فهو يموت في كل نفس ألف موتة ولا يشعر به يقول عمر بن الخطاب ما ابتلاني الله بمصيبة إلا رأيت لله علي فيها ثلاث نعم إحداها أن لم تكن في ديني الثانية حيث لم تكن أكبر منها الثالثة ما وعد الله عليها من الثواب ومن كان في مصيبة واحدة يرى ثلاث نعم فقد انتقل إلى مصيبة أعظم من تلك المصيبة فإنه يتعين عليه إقامة ميزان الشكر على ثلاث نعم فابتلاه الله بمصيبة واحدة\nليصبر عليها وابتلته معرفته في تلك المصيبة بثلاث مصائب كلفه الله الشكر عليها حيث أعلمه بتلك النعم في تلك المصيبة الواحدة فانظر إلى معرفة عمر رضي الله عنه كيف أوجب على نفسه مثل هذا وانظر إلى ما فيها من الأدب حيث عدل عن النظر فيها من كونها مصيبة إلى رؤية النعم فتلقاها بالقبول لأن النعمة محبوبة لذاتها فرضي فكان له مقام الرضاء والاستسلام والتفويض والصبر والاعتماد على الله وأين الناس من هذا الذوق الشريف ولم يحكم أحد من الأولياء ولا قام فيه مثل هذا المقام مثل أبي بكر الصديق إلا من لا أعرفه فإنه رضي الله عنه ما ظهر قط عليه مما كان عليه في باطنه من المعرفة شي‏ء لقوته إلا يوم مات رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وذهلت الجماعة وقالوا ما حكى عنهم إلا الصديق فإن الله تعالى وفقه لإظهار القوة التي أعطاه لكون الله أهله دون الجماعة للامامة والتقدم والإمام لا بد أن يكون صاحيا لا يكون سكران فقامت له تلك القوة في الدلالة على إن الله قد جعله مقدم الجماعة في الخلافة عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في أمته كالمعجزة للنبي صَلَّى اللهُ عَليهِ وسَلَّم في الدلالة على نبوته فلم يتقدم ولا حصل الأمر الإله عن طوع من جماعة وكره من آخرين وذلك ليس نقصا في إمامته كراهة من كره فإن ذلك هو المقام الإلهي والله يقول ولِلَّهِ يَسْجُدُ من في السَّماواتِ والْأَرْضِ طَوْعاً وكَرْهاً فإذا كان الخالق الذي بِيَدِهِ مَلَكُوتُ كُلِّ شَيْ‏ءٍ يسجد له كرها فكيف حال خليفته ونائبه في خلقه وهم الرسل فكيف حال أبي بكر وغيره فلا بد من طائع وكاره يدخل في الأمر على كره لشبهة تقوم عنده إذا كان ذا دين أو هوى نفس إذا لم يكن له دين فأما من كره إمامته من الصحابة رضي الله عنهم فما كان عن هوى نفس نحاشيهم من ذلك على طريق حسن الظن بالجماعة ولكن كان لشبهة قامت عندهم رأى من رأى ذلك أنه أحق بها منه في رأيه وما أعطته شبهته لا في علم الله فإن الله قد سبق علمه بأن يجعله خليفة في الأرض وكذلك عمر وعثمان وعلي والحسن ولو تقدم غير أبي بكر لمات أبو بكر في خلافة من تقدمه ولا بد في علم الله أن يكون خليفة فتقدمهم بالزمان بأنه أولهم لحوقا بالآخرة فكان سبب هذا الترتيب في الخلافة ترتيب أعمارهم فلا بد أن يتأخر عنها من يتأخر مفارقته للدنيا ليلي الجميع ذلك المنصب وفضل بعضهم على بعض مصروف إلى الله هو العالم بمنازلهم عنده فإن المخلوق ما يعلم ما في نفس الخالق إلا ما يعلمه به الخالق سبحانه وما أعلم بشي‏ء من ذلك فلا يعلم ما في نفسه إلا إذا أوجد أمرا علمنا أنه لو لا ما سبق في علم الله كونه ما كان فالله يعصمنا من الفضول إنه ذُو الْفَضْلِ الْعَظِيمِ فهذا قد أبنت لك منزلة العارف من هذا المنزل على غاية الاختصار بطريق التنبيه والإيماء فإن المقام عظيم فيه تفاصيل عجيبة فلنذكر فهرست ما يتضمنه هذا المنزل من العلوم فمن ذلك علم ذهاب النور الأعظم وبقاء حكمه وهو من أعجب الأشياء وجود الحكم مع عدم عين الحاكم ويتعلق بهذه المسألة فقد النبي صَلَّى اللهُ عَليهِ وسَلَّم وبقاء شريعته في المكلفين إلا في مذهب من يقول إن الشارع هو الله وهو موجود وفيه علم طموس العلوم وما سببها ومنها سبب عزل أهل المراتب من مراتبهم مع وجود الأهلية منهم ولما ذا عزلوا وهم يستحقونها وهل يصح هذا العزل أم لا مع وجود الأهلية وهل للسلطان عزل القاضي العادل إذا ولاة أو لا ينعزل في نفس الأمر إذا جار عليه السلطان وأخره عن الحكم فإن حكم وهو بهذه المثابة هل ينفذ حكمه شرعا أو لا ينفذ وبعد أن يحكم وهو بهذه المثابة لشخص بأمر ما فيأبى السلطان إمضائه ويطلب الخصم المحكوم عليه الرجوع إلى القاضي الذي ولاة السلطان فيظهر عند القاضي الثاني أن الحكم للذي كان الحكم عليه عند الأول هل لهذا المحكوم له عند القاضي الثاني أن يأخذ ما حكم له به مما كان قد انتزعه منه خصمه بالحاكم الأول أم لا وهل يصح قضاء هذا الثاني أم لا وإن صح فهل هو مستقل فيه كالأول أو هو كالنائب عن الأول إلا أنه بأمر سلطاني أو ينعزل الحاكم الأول إذا عزله السلطان من‏\n\n\nهذا المنزل يعرف ذلك ومن أراد تحقيق هذه المسألة ودليلها فلينظر في النسخ الوارد في الشريعة الواحدة فيصح العزل ومن نظر في حكم المشرعين وأن الله ما عزل نبيا رسولا عن رسالته بغيره في تلك الأمة التي له إلا بعد موته قال لا ينعزل فهو على حسب ما يكشف له فافهم ومن علوم هذا المنزل علم الجور في العالم من أي حضرة صدر وما ثم إلا العدل المحض فمن أين هذا الجور وأي حقيقة ترتبط به وأي اسم يدل عليه وذهاب الرجال الذين يحفظ الله بهم العالم وعلم نزول الكلم‏\nوالهمم على مراكب الأعمال لم كان ذلك وعلم البعث الأخروي هل هو عام في كل حيوان أو خاص بالإنس والجان وما معنى قوله سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ وعلم الاستحالات العنصرية وعلم ما يتولد عن تأليف الروح والجسم الطبيعي وهل الجسم للروح كالمرأة للبعل في النكاح لما يتولد بينهما أم لا وهل الموت طلاق رجعي أو بائن فإن العلماء قالوا إن المرأة إذا ماتت كانت من زوجها كالأجنبية ولا بد فليس له أن يكشف عليها وذهب آخرون إلى بقاء حرمة الزوجية فله إن يغسلها وحاله معها كحاله في حياتها فإن كان رجعيا فإن الأرواح ترد إلى أعيان هذه الأجسام من حيث جواهرها في البعث وإن لم يكن رجعيا وكان بائنا فقد ترد إليها ويختلف التأليف وقد تنشأ لها أجسام أخر لأهل النعيم أصفى وأحسن ولأهل العذاب بالعكس وعلم كلام الأطفال من أين ينطقون ومن ينطقهم مثل كلام عيسى في المهد وصبي يوسف عليه السلام وجريج وأما أنا فرأيت في زماننا شخصا شابا اسمه والله أعلم عبد القادر بمدرسة ابن رواحة بمدينة دمشق فجاء وسلم فأخبرني عنه جماعة منهم الزكي بن رواحة صاحب المدرسة قالوا إن أم هذا الشاب لما كانت حاملة به عطست فحمدت الله فقال لها من جوفها يرحمك الله بصوت سمعه كل من حضر هنالك وأما أبا فكانت لي بنت ترضع وكان عمرها دون السنتين وفوق السنة لا نتكلم فأخذت ألاعبها يوما فقلت لها يا زينب فأصغت إلي فقلت لها إني أريد أن أسألك عن مسألة مستفتيا ما قولك في رجل جامع امرأته ولم ينزل ما ذا يجب عليه قالت لي يجب عليه الغسل بكلام فصيح وأمها وجدتها يسمعان فصرخت جدتها وغشى عليها وعلم النشر بعد الطي كما قال تعالى والسَّماواتُ مَطْوِيَّاتٌ بِيَمِينِهِ وعلم المحو والإثبات وعلم تضاعف الأنوار وعلم القرب\n\n\nالإلهية التي تعطي التجلي وعلم الغيبة والحضور وعلم النجوم وعلم الزمان وعلم تنزيل الشرائع وصفة من ينزل بها ومن تنزل عليه وهل هي من باب الاختصاص أم لا وعلم التأييد والسلطان والنيابة عن الحق في العالم حتى الإنسان في نفسه وعلم الكشف وما الحجاب الذي بين الناس وبين ما يكشفه هذا المكاشف وهل هو شرط في الطريق أم لا وعلم رؤية الأرواح العلوية وعلامة الصدق فيمن يدعي رؤية الأرواح الصادق فيه من الكاذب ولنا فيهم علامات تعرف من يصدق منهم ممن يكذب وعلامات أخر لنا أيضا في الصادق منهم إذا أخبر عما رأى هل هو مخبر عن الأرواح أنفسها أو عن خيالات قامت له فيتخيل أنه رأى الملك أو الجني وهو ما رأى أمثلة في خياله قامت له لقوة سلطان الخيال عليه خارجة عن وهمه فلنا في مثل هؤلاء علامات فهو يصدق فيما يراه ويخطئ في الحكم أنه رأى ملكا أو جانا وذلك المرئي ليس بملك ولا جان فهذا من خصائص علم هذا المنزل وعلم الوعيد ولما ذا يرجع ومن عارض القرآن من أين أتى عليه كالحلاج حين دخل عليه عمرو بن عثمان المكي فقال له يا حلاج ما تصنع فقال هو ذا أعارض القرآن فدعا عليه فكانت المشيخة تقول ما أصيب الحلاج إلا بدعاء هذا الشيخ عليه وكالمهذب ثابت بن عنتر الحلوي لقيته بالموصل سنة إحدى وستمائة عارض القرآن وسمعته يتلو منه سورا وكان في مزاجه اختلال إلا أنه كان من أزهد الناس وأشرفهم نفسا ومات في تلك السنة وفي هذا المنزل علم المشيئة المحدثة هل لها أثر في الأفعال كما تقوله الأشاعرة في مسألة الكسب أو لا أثر لها وهل هي مظهر من مظاهر الحق أو تكون في وقت من مظاهر الحق وهي المشيئة التي ينفذ حكمها وفي أوقات لا تكون مظهر الحق فتكون قاصرة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 303: On the Knowledge of the Station of the Gabrielic Gnostic within the Muhammadan Presence\n\nThe sun in the outermost sphere possesses signs,\nWhich are known only to people when they have died.\n\nPurified souls, like mine, travel by its light,\nYet it is not unveiled to them unless they spend the night (in contemplation).\n\nThey are intoxicated by the wines (of Divine Love) in their prayer niches,\nYet they have no existence in the reality of intoxication (Sikr).\n\nIf their sobriety desired the removal of that intoxication,\nVerses from the Qur'an would be recited to them.\n\n### [That the Celestial, Heavenly Spirits, referred to as the Angels, are Masters of Command]\n\nKnow, may Allah aid you, that among the celestial, heavenly spirits, referred to as the Angels (الملائكة), are leaders who possess an obeyed command over those beneath them in the Highest Assembly (الملإ الأعلى). They are masters of command (أصحاب أمر), not masters of prohibition, for <<لَا يَعْصُونَ اللهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ>> (They do not disobey Allah in what He commands them, and they do what they are commanded). Allah the Exalted drew attention to the fact that Gabriel (عليه السلام) is one of them by His saying: <<مُطَاعٍ ثَمَّ أَمِينٍ>> (Obeyed there, trustworthy). And none is obeyed except one who holds command over those who obey him.\n\n### [That the Gnostic has an Effect in the Higher and Lower Worlds commensurate with the Degree of that Spirit]\n\nKnow that when the Gnostic ('Arif) is supported by a spirit (روح) from the Highest Assembly (الملإ الأعلى)—one of these commanding spirits that has precedence over others, such as Israfil, Isma'il, Azra'il, Gabriel, Mika'il, the Light (النور), and the Spirit (الروح), and their likes—then the Gnostic will have an effect (أثر) in the higher and lower worlds (العالم العلوي والسفلي) commensurate with the degree (مرتبة) of that spirit which governs him from that realm.\n\nHe whose patron is Israfil will have an effect corresponding to the degree of Israfil and what falls under his supervision and command. Similarly, every spirit of this rank has a man or woman upon its station. This is what you hear from the Sufi community (الطائفة): that so-and-so is \"upon the heart of Adam,\" or \"a group is upon the heart of Adam,\" and \"a group is upon the heart of Abraham.\" This means they possess the stations (المنازل) that Abraham and Adam hold in the rank of Sainthood (الولاية) that belongs to them, not in the rank of Prophethood (النبوة). Even if they have a share (شرب) of Prophethood, it is only from some of its stations, not all of them, such as the true dream (الرؤيا), which is one of the parts of Prophethood, and others. As for Prophethood (النبوة) in its totality, it is attained only by a Prophet (نبي). The Saint (ولي), however, does not attain it, unless he receives support, strength, and confirmation from its *back* (ظهره).\n\nThis is how I received it through my own witnessing (مشاهدة), and I was informed that every Saint receives it thus from the Perfected Ones (المكملين) in Sainthood and expresses it, but from behind the veil of the back (حجاب الظهر). For the Prophet, it descends upon his heart from above or from the front, or he is addressed with it in his hearing. The Saint, however, finds its effect through spiritual taste (ذوق), and in relation to it, he is like a blind person who senses someone beside him but does not know who that person is.\n\nThis is why the community (الطائفة) says: \"None knows Allah but Allah, none knows the Prophet but the Prophet, and none knows the Saint but a Saint like him.\" The Prophet has an open eye for witnessing Prophethood, and the Saint has an open eye for witnessing Sainthood (الولاية), but a blind eye for witnessing Prophethood, because it comes from behind him. He is in it like the memorizer of the Qur'an, for whoever memorizes the Qur'an has had Prophethood *enfolded between his sides* (أدرجت النبوة بين جنبيه). It is not said \"in his chest,\" nor \"between his eyes,\" nor \"in his heart,\" for those are the ranks of the Prophet, not the rank of the Saint.\n\nAnd where is acquisition (الاكتساب) compared to Divine Selection (التخصيص)? Prophethood is a selection from Allah, by which He singles out <<مَن يَشَاءُ مِنْ عِبَادِهِ>> (whom He wills among His servants). That door has been closed and sealed by the Messenger of Allah, Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم). Sainthood, however, is acquired (مكتسبة) until the Day of Resurrection. Whoever strives to attain it will achieve it. Yet, the striving to attain it is also a selection from Allah, by which He <<يَخْتَصُّ بِرَحْمَتِهِ مَن يَشَاءُ>> (singles out whom He wills for His Mercy). Allah the Exalted said: <<إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللهَ يَهْدِي مَن يَشَاءُ>> (Indeed, you do not guide whom you love, but Allah guides whom He wills), just as He said: <<نَهْدِي بِهِ مَن نَّشَاءُ مِنْ عِبَادِنَا>> (We guide by it whom We will among Our servants).\n\nThrough the light of Prophethood, Sainthood is acquired. The Saints (الأولياء) are the vicegerents (ولاة) of the Real (الحق) over His servants. The elite among them, the great ones, are called Messengers (رسل) and Prophets (أنبياء). Those who fall below them retain only the name of Sainthood. Sainthood (الولاية) is the encompassing sphere (الفلك المحيط) that gathers all. Although they are united in the station of Sainthood, the vicegerents (الولاة) have ranks. The Sultan is a vicegerent over the creation, the Judge (القاضي) is a vicegerent, and the Market Inspector (المحتسب) is a vicegerent. Yet, where is the rank of the Sultan compared to the rank of the Market Inspector? All of them possess command within the realm of Sainthood.\n\nSimilarly, regarding what we mentioned concerning the Prophets, Messengers, and Poles (الأقطاب): every Saint is upon his own rank. Sovereignty (السلطنة) is not attained by acquisition (الكسب) entirely, but everything else can be striven for. There is a vicegerent who offers the Sultan a service of wealth or goods, and the Sultan appoints him to a suitable position. This is analogous to one who attains Sainthood from Allah through charity, a good loan, and maintaining kinship ties.\n\nAnd there are people who constantly serve the Sultan in his riding and going out, exposing themselves to him. If the Sultan commands something without specifying anyone, this person rushes to comply with the Sultan's orders. The Sultan sees him constantly present and quick to obey, and so appoints him. This is analogous to one who attains Sainthood from Allah through constant vigilance and rushing to obey the supererogatory commands (النوافل) of Allah, not those which He made obligatory (افترضها). This is referred to in the Hadith Qudsi: \"My servant does not cease drawing near to Me through supererogatory acts (النوافل) until I love him. When I love him, I am his hearing, his sight, his hand, and his supporter.\"\n\nThis is the meaning of acquisition (الكسب) in Sainthood. Likewise, one who presents himself to the Sultan and serves him by his command, and confronts the command directly, and the Sultan sees his strict adherence to the Sultanic orders that were made obligatory upon him—he neither neglects them nor interprets them away, but takes them as obligatory and rushes to them, preceding those of his rank who delay or interpret them—the Sultan sees this and appoints him, granting him deputyship (النيابة) over his subjects. Similarly, the one who rushes to what Allah has made obligatory upon him in acts of obedience, taking His commands as obligatory, and neither interpreting away His word nor His command—Allah chooses him and grants him the greatest of His vicegerencies (ولاياته). Now that you know acquisition (الكسب) and its place, and selection (الاختصاص) and its people, follow this path, for it is the door through which whoever enters is saved, becomes a vicegerent, draws near, descends (تدلى), and is called out to in the highest horizon.\n\n### [The Saint is one of the Trustworthy Ones whom Allah the Exalted has among His Creation]\n\nKnow that the Saint (الولي) who is supported by a subtle Gabrielic spirit (رقيقة روحانية جبرئيلية) is one of the Trustworthy Ones (الأمناء) whom Allah the Exalted has among His creation, who are not known in this world. When the Hereafter comes, and his station is revealed there, along with what he concealed in this abode—which was unknown here—he might have been a merchant in the market, a seller, a craftsman, or a governor among the Muslim authorities (in charge of market inspection, judiciary, or sovereignty). Between him and Allah are secrets unknown to others. On the Day of Resurrection, when what he possessed is revealed in the Hereafter, it will be said: \"Allah has Trustworthy Ones (أمناء),\" since this person was among them, yet they did not manifest themselves in the world with the unveiling (الكشف) that Allah granted to others—such as speaking about inner thoughts, traversing the earth, flying through the air, walking on water, or eating from the cosmos. Nothing of this appeared through him, even though it was within his power and under his disposal. He refused to be anything other than what the general body of Muslims are upon. These are specifically the Blameworthy Ones (الملامية) of this Path, both their great and small.\n\nThis person is, within the Muhammadan Community (الأمة المحمدية), like Gabriel (جبريل) in the Angelic Community (الأمة الملكية): obeyed in the inner realm (مطاع الباطن). Gabriel is a spirit (روح) and possesses the inner realm. He is not obeyed outwardly if he were to command, but he does not command, because he has not distinguished himself from the common people in anything. If he were to distinguish himself among them by a breaking of custom (خرق عادة) that appears from him—something not required by the situation—he would be magnified, and his command would be obeyed due to the superiority that appeared to him over the common folk. This is the reason his command would be rejected if he commanded, but he does not command. However, in the inner realm (الباطن), his command is obeyed.\n\nWe have seen a group of these, such as 'Abdullah ibn Takhmasat and Ibn Ja'dun al-Hannawi, who was one of the Pegs (الأوتاد) and was of great importance. This Gnostic ('Arif) who holds this station we have mentioned has mastery over his own soul (نفسه). And whoever masters his own soul is the strongest of Allah's creation. The soul desires to manifest in the world through Lordship (الربوبية). The possessor of this station has been clothed by Allah with the attributes of mastery (السيادة) and strengthened to the point that he can say to a thing, \"Be,\" and it is, due to his standing with his Lord. Yet, such is his strength that he controls his soul, so nothing of that power appears through him, neither in his sayings, his actions, nor his worship. He is one whom the Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم) specified in the sound, rare Hadith (الحسن الغريب) when Allah created the mountains. When the earth was shaking, the mountains anchored it and stopped its shaking. The Angels said: \"O our Lord, have You created anything stronger than the mountains?\" He said: \"Yes, iron.\" They said: \"O our Lord, have You created anything stronger than iron?\" He said: \"Yes, fire.\" They said: \"O our Lord, have You created anything stronger than fire?\" He said: \"Yes, water.\" They said: \"O our Lord, have You created anything stronger than water?\" He said: \"The believer who gives charity with his right hand, and his left hand does not know of it,\" or he said, \"and he conceals it from his left hand.\"\n\nThis is the state of the one we mentioned. The Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم) described him with strength, and he possesses more of it than the strong ones mentioned. The soul is naturally inclined to love leadership over its own kind—this is in its original nature and creation. And to be told to abandon one's nature and disposition is to be tasked with a tremendous thing. Glory be to Him who provided them with such strength that such a thing became easy for them. The reason for this is that He gave them the Gnosis of Allah (المعرفة بالله) for which they were created, which preoccupied them with fulfilling the right of servitude ('ubūda) away from such matters. They are upon the perfect path (الطريقة المثلى) that Allah chose for His servants, and they have the closest station (المكانة الزلفى) due to their steadfastness upon it, honored by Allah.\n\nThis Gnostic of this rank is one of the Individuals (الأفراد) whom the Real (الحق) has singled out for Himself and chosen for His own sake. He has lowered the veil—the veil of custom (حجاب العادة)—between them and creation, thus purifying them for Himself. He is pleased with them, and they are pleased with Him. The possessor of this station is given one thousand two hundred effective powers (القوي المؤثرة) in the higher and lower worlds. If he were to unleash just one of these powers upon the cosmos, it would annihilate it. Yet, despite this mastery over these powers, if a fly lands on him, he is unable to remove it, out of shyness (حياء) before Allah and Gnosis (معرفة).\n\nAs for the Gnosis he possesses concerning it: that fly is a messenger from the Real (الحق) to him, and it is He who sent it down upon him. He observes what knowledge it has brought him. When it finishes its message, if his Creator calls him, he may rise, or he may remain. Thus, this Gnostic becomes the throne (كرسي) of that fly-messenger. This is the reason he leaves it alone and does not drive it away, as common people do, due to his Gnosis.\n\nAs for shyness before Allah (الحياء من الله): removing the fly is a comfort (راحة) and an immediate enjoyment (نعيما معجلا) for the soul. Allah did not create humanity in this abode for comfort and enjoyment, but rather for the worship of their Lord. Thus, he is shy that Allah should see him seeking comfort from the annoyance of the fly, since the station does not require it. If you say, \"What about the one who enjoys permissible worldly pleasures?\" We say: We do not forbid that for anyone other than the Gnostic. But the Gnostic is under the authority of Divine Obligation (سلطان التكليف). There is no blessing (نعمة) that Allah bestows upon him, whether inward or outward, except that the Divine Obligation (التكليف) of gratitude (الشكر) accompanies it. That obligation spoils the Gnostic's enjoyment of that blessing, due to his preoccupation with balancing the gratitude due for it. If he fulfills the gratitude, the fulfillment itself is a blessing from Allah upon him, for which he must offer gratitude.\n\nThus, his mind is perpetually troubled (متعوب الخاطر) in establishing the balance with justice (القسط), lest the scale lose weight. How can one whose state is this enjoy comfort? Its outward aspect is a blessing, but its inward aspect is bitterness. He constantly turns over in Allah's blessings, outwardly and inwardly, yet they only affect him as pain and vexation. The common people rejoice in those blessings and use them with insolence and pride. The door of comfort in the heart is closed to the Gnostic in this world. Even if he finds rest outwardly, he dies a thousand deaths with every breath, yet he is not aware of it.\n\nUmar ibn al-Khattab said: \"Allah has never afflicted me with a calamity except that I saw three blessings of Allah upon me in it: first, that it was not in my religion; second, that it was not greater than it was; third, the reward that Allah promised for it.\" Whoever sees three blessings in a single calamity has moved to a calamity greater than the first, because he is now obliged to establish the balance of gratitude (الشكر) for three blessings. Allah afflicted him with one calamity so that he might endure it patiently, but his Gnosis (معرفته) afflicted him within that calamity with three calamities for which Allah tasked him with gratitude, since He informed him of those blessings within that single calamity.\n\nLook at the Gnosis of Umar (رضي الله عنه) and how he imposed such a thing upon himself. And look at the spiritual courtesy (الأدب) within it, as he turned away from viewing it as a calamity toward seeing the blessings. He received it with acceptance, because the blessing is beloved for its own sake. Thus, he was pleased, and he attained the station of contentment (الرضاء), submission (الاستسلام), reliance (التفويض), patience (الصبر), and dependence upon Allah.\n\nWhere are people compared to this noble spiritual taste (الذوق الشريف)? No Saint (ولي) has ever ruled or stood in such a station like Abu Bakr al-Siddiq, except for one whom I do not know. For nothing of what he possessed inwardly of Gnosis ever appeared outwardly due to his strength, except on the day the Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم) died, and the community was bewildered. What was narrated about them was only narrated about al-Siddiq, for Allah the Exalted granted him success in manifesting the strength He had given him, because Allah qualified him, rather than the community, for the Imamate (الإمامة) and precedence. And the Imam must be sober (صاحيا), not intoxicated (سكران). That strength arose in him as proof that Allah had made him the leader of the community in the Caliphate (الخلافة) after the Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم) among his nation, like a miracle (المعجزة) for the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) proving his prophethood.\n\nHis precedence and the attainment of the Divine Command (الأمر الإله) did not come about through the willing consent of all and the aversion of others. That aversion is not a defect in his Imamate, for that is the Divine Station (المقام الإلهي). Allah says: <<وَلِلَّهِ يَسْجُدُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا>> (And to Allah prostrates whoever is in the heavens and the earth, willingly or unwillingly). If the Creator, in whose hand is the dominion of all things, is prostrated to unwillingly, then what is the state of His Caliph and Deputy among His creation, who are the Messengers? And what is the state of Abu Bakr and others? There must be both the willing and the unwilling who enter into the command reluctantly due to a doubt that arises in them, if they are religious, or due to self-interest if they lack religion.\n\nAs for those Companions (رضي الله عنهم) who disliked his Imamate, it was not due to self-interest—we absolve them of that, based on good assumption regarding the community—but rather due to a doubt that arose in them. Some who held that view believed that they were more entitled to it than him, according to their opinion and the doubt that arose in them, not according to Allah's Knowledge. For Allah's prior knowledge determined that He would make him the Caliph on earth, and likewise Umar, Uthman, Ali, and Al-Hasan. Had anyone other than Abu Bakr preceded him, Abu Bakr would have died during the caliphate of the one who preceded him. It was necessary, in Allah's Knowledge, that he be the Caliph. Their precedence in time was due to his being the first of them to join the Hereafter. Thus, the reason for this order in the Caliphate was the order of their lifespans. Whoever was delayed in departing this world had to be delayed from the Caliphate so that all of them might hold that position. The superiority of some over others is referred back to Allah; He is the Knower of their stations with Him. For the created being does not know what is in the Essence (نفس) of the Creator except what the Creator (سبحانه) informs him of. I was not informed of anything of that. He does not know what is in His Essence unless He brings forth a matter, and we know that had it not preceded in Allah's Knowledge that it would be, it would not have been. May Allah protect us from meddling, for He is <<ذُو الْفَضْلِ الْعَظِيمِ>> (Possessor of Great Bounty).\n\nI have now explained to you the station of the Gnostic in relation to this station, with the utmost brevity, by way of indication and allusion, for the station is immense and contains marvelous details. Let us mention a list of the sciences contained within this station.\n\nAmong them is the science of the disappearance of the Greatest Light (النور الأعظم) and the persistence of its ruling (حكمه). This is one of the most astonishing things: the existence of the ruling despite the non-existence of the ruler (عين الحاكم). Related to this issue is the passing of the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) and the persistence of his Law (شريعته) among the legally responsible (المكلفين), except according to the school of thought that says the Lawgiver is Allah, and He is existent.\n\nAnd the science of the effacement of sciences (طموس العلوم) and its cause.\n\nAnd the cause of the dismissal of people of rank (أهل المراتب) from their ranks despite their continued qualification (الأهلية). Why were they dismissed when they deserved the rank? Is this dismissal valid or not, given the existence of the qualification? Does the Sultan have the right to dismiss a just judge (القاضي العادل) after appointing him, or does the judge not become dismissed in reality (في نفس الأمر) if the Sultan acts unjustly toward him and prevents him from judging? If he judges while in this state, is his ruling legally enforceable (شرعا) or not? And after he judges in this state in favor of a person regarding a matter, and the Sultan refuses to execute it, and the losing litigant requests to return to the judge whom the Sultan appointed—and it becomes apparent to the second judge that the ruling should be in favor of the one who was ruled against by the first judge—does the one ruled in favor of by the second judge have the right to take what was ruled for him, which his opponent had seized from him through the first judge, or not? Is the judgment of this second judge valid or not? If it is valid, is he independent in it like the first, or is he like a deputy for the first, but by Sultanic command? Or is the first judge dismissed if the Sultan dismisses him?\n\nThe answer to this is known from this station (المنزل). Whoever desires the verification and proof of this issue should look into the issue of abrogation (النسخ) within a single Law (الشريعة الواحدة). In that case, dismissal is valid. Whoever looks into the ruling concerning Lawgivers (المشرعين) and notes that Allah never dismissed a Prophet-Messenger (نبيا رسولا) from his mission for the sake of another in that nation, except after his death, says that he is not dismissed. Thus, it depends on what is unveiled (يكشف) to him. Understand this.\n\nAmong the sciences of this station is the science of injustice (الجور) in the world: from which Divine Presence (حضرة) does it originate, when there is nothing but pure justice (العدل المحض)? Where does this injustice come from? What reality (حقيقة) is connected to it? And what Name (اسم) indicates it?\n\nAnd the disappearance of the men (الرجال) by whom Allah preserves the world.\n\nAnd the science of the descent of the Words (الكلم) and the spiritual aspirations (الهمم) upon the vehicles of actions (مراكب الأعمال): why did that occur?\n\nAnd the science of the resurrection in the Hereafter (البعث الأخروي): is it general for every living creature, or specific to humans and jinn? And what is the meaning of His saying: <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ>> (We will attend to you, O you two heavy ones [humans and jinn])?\n\nAnd the science of elemental transformations (الاستحالات العنصرية).\n\nAnd the science of what is generated from the combination of the spirit (الروح) and the natural body (الجسم الطبيعي). Is the body to the spirit like the woman to the husband in marriage, due to what is generated between them, or not?\n\nAnd is death a revocable divorce (طلاق رجعي) or an irrevocable divorce (بائن)? Scholars have said that when a woman dies, she becomes like a stranger to her husband, necessarily, so he may not uncover her. Others hold that the sanctity of marriage remains, so he may wash her, and his state with her is as it was in her life. If it is revocable, then the spirits will return to the essences (أعيان) of these bodies in their substance (جواهرها) at the Resurrection. If it is not revocable, but irrevocable (بائن), they may still return to them, but the composition (التأليف) will differ. Or, new bodies may be created for the people of bliss, purer and better, and the opposite for the people of torment.\n\nAnd the science of the speech of children: from where do they speak, and who makes them speak? Such as the speech of Jesus in the cradle, the boy of Joseph (عليه السلام), and Jurayj. As for myself, I saw in our time a young man—his name, Allah knows best, was 'Abd al-Qadir—at the Ibn Rawaha school in the city of Damascus. He came and greeted me. A group of people, including al-Zaki ibn Rawaha, the owner of the school, informed me about him. They said that when this young man's mother was pregnant with him, she sneezed and praised Allah. He said to her from inside her womb, \"May Allah have mercy on you,\" in a voice heard by everyone present there. As for my own experience, I had a daughter who was nursing. She was less than two years old and more than one, and she did not speak. One day, I was playing with her and said, \"O Zaynab.\" She listened to me. I said to her, \"I want to ask you a question, seeking a legal opinion: What is your view on a man who has intercourse with his wife but does not ejaculate? What is required of him?\" She said to me, \"The ritual bath (الغسل) is required of him,\" in eloquent speech. Her mother and grandmother heard this, and her grandmother screamed and fainted.\n\nAnd the science of spreading after folding, as Allah the Exalted said: <<وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ>> (And the heavens will be folded in His right hand).\n\nAnd the science of effacement (المحو) and affirmation (الإثبات).\n\nAnd the science of the multiplication of lights (تضاعف الأنوار).\n\nAnd the science of the Divine Proximities (القرب الإلهية) that grant Theophany (التجلي).\n\nAnd the science of absence (الغيبة) and presence (الحضور).\n\nAnd the science of the stars (النجوم).\n\nAnd the science of time (الزمان).\n\nAnd the science of the descent of the Divine Laws (الشرائع), the description of the one who brings them down, and the one upon whom they descend. Is this a matter of selection (الاختصاص) or not?\n\nAnd the science of Divine Support (التأييد), sovereignty (السلطان), and deputyship (النيابة) on behalf of the Real (الحق) in the world, even within the human being himself.\n\nAnd the science of Unveiling (الكشف): what is the veil (الحجاب) between people and what the one who receives the unveiling (المكاشف) unveils? Is it a prerequisite for the Path or not?\n\nAnd the science of seeing the celestial spirits (الأرواح العلوية) and the sign of truthfulness in one who claims to see spirits—how to distinguish the truthful from the liar. We have signs concerning them by which we know who speaks the truth and who lies. And we have other signs concerning the truthful one when he reports what he saw: is he reporting about the spirits themselves, or about images (خيالات) that arose for him, so he imagines he saw the Angel or the Jinn, when he only saw similitudes (أمثلة) that arose in his Imagination (خيال) due to the strength of the authority of Imagination over him, external to his delusion (وهمه)? We have signs for such people. He is truthful in what he sees but errs in judging that he saw an Angel or a Jinn, and that perceived thing is neither an Angel nor a Jinn. This is one of the specialties of the knowledge of this station.\n\nAnd the science of the threat (الوعيد) and why it is retracted.\n\nAnd the science of one who contests the Qur'an: from where did this come upon him? Like al-Hallaj, when 'Amr ibn 'Uthman al-Makki entered upon him and said, \"O Hallaj, what are you doing?\" He replied, \"I am contesting the Qur'an.\" So, he prayed against him. The Shaykhs used to say that al-Hallaj was only afflicted due to the prayer of this Shaykh against him. And like the refined Thabit ibn 'Antar al-Halawi, whom I met in Mosul in the year 601 AH. He contested the Qur'an, and I heard him reciting chapters from it. He had some mental imbalance, yet he was one of the most ascetic people and noblest in spirit. He died that same year.\n\nIn this station is the science of the created Will (المشيئة المحدثة): does it have an effect on actions, as the Ash'aris say in the issue of acquisition (الكسب), or does it have no effect? Is it a manifestation (مظهر) of the Real (الحق), or is it sometimes a manifestation of the Real—which is the Will whose ruling is executed—and sometimes not a manifestation of the Real, thus being deficient? And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تین سو تین: حضرت محمدیہ (الحضرة المحمدیة) سے جبریلی عارف کے مقام کی معرفت میں\n\nفلکِ اقصیٰ میں سورج کی نشانیاں ہیں،\nجنہیں وہ لوگ جانتے ہیں جب وہ فنا (الفناء) ہو جاتے ہیں۔\nپاکیزہ نفوس، جیسے میرے، ان کے ساتھ سفر کرتے ہیں،\nجو ان پر منکشف نہیں ہوتے مگر جب وہ رات گزارتے (یعنی دنیا سے بے خبر ہو کر قیام کرتے) ہیں۔\nوہ اپنی عبادت گاہوں میں شرابوں کے نشے میں سرشار ہیں،\nحالانکہ ان کی ہستی (الوجود) میں نشہ آور چیزوں کا کوئی وجود نہیں۔\nاگر وہ اس نشے کے زائل ہونے اور ہوش میں آنے کا ارادہ کریں،\nتو ان پر قرآن کی آیات تلاوت کی جاتی ہیں۔\n\n[ان علوی سماوی ارواح میں سے جنہیں ملائکہ سے تعبیر کیا جاتا ہے، وہ اصحابِ امر ہیں]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ علوی سماوی ارواح میں سے جنہیں ملائکہ سے تعبیر کیا جاتا ہے، وہ پیشوا ہیں جن کا حکم ملأ اعلیٰ (الملإ الأعلى) میں ان سے نیچے والوں پر مانا جاتا ہے۔ وہ اصحابِ امر ہیں، نہ کہ اصحابِ نہی (منع کرنے والے)، پس وہ:\n**لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ** (اللہ کی نافرمانی نہیں کرتے جو وہ انہیں حکم دیتا ہے اور وہی کرتے ہیں جس کا انہیں حکم دیا جاتا ہے)۔\nاللہ تعالیٰ نے اس بات پر متنبہ فرمایا ہے کہ جبرئیل علیہ السلام بھی انہی میں سے ہیں، اپنے اس قول سے: **مُطَاعٍ ثَمَّ أَمِينٍ** (وہاں اس کا حکم مانا جاتا ہے، امانت دار ہے)۔ اور مطاع (جس کا حکم مانا جائے) وہی ہو سکتا ہے جسے ان پر امر حاصل ہو جو اس کی اطاعت کرتے ہیں۔\n\n[عارف کے لیے علوی اور سفلی عالم میں اس روح کے مرتبے کے مطابق اثر ہوتا ہے]\n\nپس جان لیجیے کہ جب عارف کو ملأ اعلیٰ (الملإ الأعلى) سے ان آمر ارواح میں سے کوئی روح مدد پہنچاتی ہے جنہیں دوسروں پر تقدم حاصل ہے، جیسے اسرافیل، اسماعیل، عزرائیل، جبرئیل، میکائیل، النور (نور) اور الروح (روح) اور ان جیسے دیگر، تو اس عارف کے لیے علوی اور سفلی عالم میں اس روح کے مرتبے کے مطابق اثر ہوتا ہے جو وہاں سے اس کی سرپرستی کرتی ہے۔\nپس جس کی سرپرستی اسرافیل کرتے ہیں، اس کا اثر اسرافیل کے مرتبے اور ان کے زیرِ نگرانی اور حکم میں آنے والی چیزوں کے مطابق ہوتا ہے۔ اور اسی طرح ہر وہ روح جو اس مرتبے پر فائز ہے، اس کے لیے کوئی مرد یا عورت اس کے مقام پر ہوتا ہے۔\nیہی وہ بات ہے جو آپ اس طائفہ (صوفیاء) سے سنتے ہیں کہ فلاں شخص قلبِ آدم (آدم کے دل) پر ہے، یا ایک جماعت قلبِ آدم پر ہے، اور ایک جماعت قلبِ ابراہیم پر ہے۔ یعنی انہیں ولایت (الولایۃ) کے مقام میں وہ منازل حاصل ہیں جو ابراہیم اور آدم کو حاصل ہیں، نہ کہ نبوت (النبوۃ) کے مقام میں۔ اگرچہ انہیں نبوت سے کچھ حصہ ملتا ہے، تو وہ اس کے بعض مقامات میں سے ہوتا ہے، نہ کہ تمام میں، جیسے خواب (الرؤیا) جو نبوت کے اجزاء میں سے ایک جز ہے اور دیگر۔\nلیکن نبوت بالجملہ صرف نبی کو ہی حاصل ہوتی ہے۔ جہاں تک ولی کا تعلق ہے، تو اسے نبوت حاصل نہیں ہوتی، مگر یہ کہ اس کی پشت سے کوئی چیز اسے مدد، تقویت اور تائید پہنچاتی ہے۔\nمیں نے اسے اپنے نفس سے مشاہدہ (مشاہدۃ) کے طور پر حاصل کیا ہے اور مجھے خبر دی گئی ہے کہ ہر ولی اسی طرح ولایت میں کاملین سے حاصل کرتا ہے اور اس کی ترجمانی کرتا ہے، لیکن پردہِ پشت (حجاب الظهر) سے۔\nجبکہ نبی کے لیے یہ (وحی) اوپر سے یا سامنے سے نازل ہوتی ہے، جو اس کے قلب پر اترتی ہے یا اسے اس کے کان میں مخاطب کیا جاتا ہے۔\nولی اس کا اثر ذوقاً پاتا ہے، اور وہ اس میں اس اندھے کی طرح ہے جو اپنے پہلو میں کسی شخص کو محسوس کرتا ہے لیکن نہیں جانتا کہ وہ شخص کون ہے۔ اسی لیے یہ طائفہ کہتا ہے کہ اللہ کو اللہ کے سوا کوئی نہیں جانتا، اور نبی کو نبی کے سوا کوئی نہیں جانتا، اور ولی کو اس جیسے ولی کے سوا کوئی نہیں جانتا۔\nپس نبی وہ ہے جس کی آنکھ نبوت کے مشاہدے کے لیے کھلی ہوتی ہے، اور ولی وہ ہے جس کی آنکھ ولایت کے مشاہدے کے لیے کھلی ہوتی ہے، لیکن نبوت کے مشاہدے کے لیے اس کی آنکھ اندھی ہوتی ہے، کیونکہ نبوت اس کی پشت کی طرف سے ہوتی ہے۔ پس وہ اس میں قرآن کے حافظ کی طرح ہے، کیونکہ جس نے قرآن حفظ کیا، اس نے نبوت کو اپنے پہلوؤں کے درمیان داخل کر لیا، اور یہ نہیں کہا گیا کہ اس کے سینے میں، یا اس کی آنکھوں کے درمیان، یا اس کے قلب میں۔ کیونکہ وہ رتبہ نبی کا ہے، ولی کا نہیں۔\nاور کسب (کوشش سے حاصل کرنا) اور تخصیص (خاص کر دیا جانا) میں کیا نسبت؟\nنبوت اللہ کی طرف سے ایک اختصاص ہے، وہ اپنے بندوں میں سے جسے چاہتا ہے اس کے لیے خاص کر دیتا ہے، اور یہ دروازہ بند کر دیا گیا ہے اور رسول اللہ محمد صلی اللہ علیہ وسلم پر ختم کر دیا گیا ہے۔\nاور ولایت قیامت تک کسبی (کوشش سے حاصل ہونے والی) ہے۔ پس جو شخص اسے حاصل کرنے کی کوشش کرتا ہے، اسے حاصل ہو جاتی ہے۔ اور اسے حاصل کرنے کی کوشش بھی اللہ کی طرف سے ایک اختصاص ہے: **يَخْتَصُّ بِرَحْمَتِهِ مَن يَشَاءُ** (وہ اپنی رحمت کے لیے جسے چاہتا ہے خاص کر لیتا ہے)۔\nاللہ تعالیٰ نے فرمایا: **إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَن يَشَاءُ** (بیشک آپ جسے چاہیں ہدایت نہیں دے سکتے، لیکن اللہ جسے چاہتا ہے ہدایت دیتا ہے)۔\nجیسا کہ اللہ تعالیٰ نے فرمایا: **نَهْدِي بِهِ مَن نَّشَاءُ مِنْ عِبَادِنَا** (ہم اس کے ذریعے اپنے بندوں میں سے جسے چاہتے ہیں ہدایت دیتے ہیں)۔\nپس نبوت کے نور سے ولایت حاصل کی جاتی ہے۔ اولیاء (الأولیاء) اپنے بندوں پر حق (الحق) کے والی (حکمران) ہوتے ہیں، اور ان میں سے خواص اور اکابر کو رسول اور نبی کہا جاتا ہے۔ اور جو ان سے نیچے ہوتے ہیں، ان پر ولایت کا نام باقی رہتا ہے۔\nپس ولایت وہ محیط فلک ہے جو سب کو جامع ہے۔ اگرچہ وہ ولایت کے منصب میں جمع ہیں، لیکن والیوں کے مراتب ہوتے ہیں۔ سلطان حاکم پر والی ہے، قاضی والی ہے، محتسب والی ہے۔ اور سلطان کے مرتبے کو محتسب کے مرتبے سے کیا نسبت؟ حالانکہ وہ سب ولایت میں امر کے حامل ہیں۔\nاور اسی طرح جو ہم نے انبیاء، رسولوں اور اقطاب کے حق میں ذکر کیا، ہر ولی اپنے مرتبے پر ہے۔\nسلطنت کلی طور پر کسب سے حاصل نہیں ہوتی، اور اس کے علاوہ دیگر چیزوں کے حصول میں کوشش کی جاتی ہے۔\nپس ایک والی ہوتا ہے جو سلطان کو مال یا سامان کی خدمت پیش کرتا ہے، تو سلطان اسے وہ منصب عطا کرتا ہے جو اس کے لائق ہو اور جس پر وہ خدمت کرے۔ یہ اس شخص کی طرح ہے جسے اللہ کی طرف سے صدقہ، قرضِ حسن اور صلہ رحمی کے ذریعے ولایت حاصل ہوتی ہے۔\nاور کچھ لوگ وہ ہوتے ہیں جو سلطان کی سواری اور باہر نکلنے میں اس کی خدمت کو لازم پکڑتے ہیں اور اس کے سامنے آتے ہیں۔ جب سلطان کسی چیز کا حکم دیتا ہے اور کسی کو خاص طور پر مقرر نہیں کرتا، تو یہ شخص سلطان کے احکام کی تعمیل کے لیے جلدی کرتا ہے۔ سلطان اسے اپنی نگرانی میں لازم اور اپنے احکام کی تعمیل میں پیش قدمی کرنے والا دیکھتا ہے، تو اسے والی بنا دیتا ہے۔\nیہ اس شخص کی طرح ہے جسے اللہ کی طرف سے اس کی مراقبت (اللہ کی نگرانی) اور اللہ کے ان احکام کی تعمیل میں جلدی کرنے سے ولایت حاصل ہوتی ہے جن کی طرف اللہ نے ترغیب دی ہے، نہ کہ جو اس پر فرض کیے ہیں۔\nاور یہی وہ قول ہے: \"میرا بندہ نوافل کے ذریعے مجھ سے قریب ہوتا رہتا ہے یہاں تک کہ میں اسے اپنا محبوب بنا لیتا ہوں۔ جب میں اسے اپنا محبوب بنا لیتا ہوں تو میں اس کا کان، اس کی آنکھ، اس کا ہاتھ اور اس کا مؤید بن جاتا ہوں۔\"\n\nپس یہ ولایت میں کسب کا مفہوم ہے۔ اور اسی طرح وہ شخص جو سلطان کے سامنے آیا اور اس کے حکم سے اس کی خدمت کی اور حکم کے ساتھ اس کا سامنا کیا، تو سلطان نے دیکھا کہ وہ ان سلطانی احکام کی حفاظت کرتا ہے جو اس پر واجب کیے گئے ہیں، نہ ان سے غفلت برتتا ہے اور نہ ان کی تاویل کرتا ہے، بلکہ انہیں وجوب کے طور پر لیتا ہے اور ان کی طرف تیزی سے بڑھتا ہے اور ان کی تعمیل میں سبقت لے جاتا ہے، جبکہ اس کے مرتبے میں موجود دوسرا شخص سستی کرتا ہے اور تاویل کرتا ہے۔ تو سلطان اس کے لیے یہ دیکھتا ہے اور اسے والی بنا دیتا ہے اور اپنی رعایا میں اپنی نیابت (النیابۃ) عطا کرتا ہے۔\nاسی طرح وہ شخص جو اللہ کی طرف سے واجب کردہ اطاعات اور فرائض کی طرف تیزی سے بڑھتا ہے اور اس کے احکام کو وجوب کے طور پر لیتا ہے اور اس کے کلام یا حکم کی کوئی تاویل نہیں کرتا، تو اللہ اسے چن لیتا ہے اور اسے اپنی سب سے بڑی ولایت عطا کرتا ہے۔\nآپ نے کسب اور اس کی جگہ کو، اور اختصاص اور اس کے اہل کو جان لیا ہے۔ پس اسی راستے پر چلیں، کیونکہ یہ وہ دروازہ ہے جس سے داخل ہونے والا نجات پا گیا، والی بن گیا، قریب ہوا، جھک گیا (دنا وتدلى)، اور اسے افقِ اعلیٰ (الأفق الأعلى) میں پکارا گیا۔\n\n[ولی اللہ تعالیٰ کی مخلوق میں سے امانت داروں میں سے ہے]\n\nاور جان لیجیے کہ وہ ولی جس کی طرف جبریلی رقیقہ روحانیہ (رقيقة روحانية جبرئيلية) بڑھتی ہے، وہ اللہ تعالیٰ کی مخلوق میں سے ان امانت داروں (الأمناء) میں سے ہے جو دنیا میں پہچانے نہیں جاتے۔ جب آخرت ہو گی اور وہاں ان کا مقام ظاہر ہو گا اور وہ سب کچھ ظاہر ہو گا جو اس دنیا میں پوشیدہ تھا اور یہاں معلوم نہیں ہو سکا، تو وہ شخص یا تو بازار میں تاجر تھا، یا کوئی پیشہ ور یا کاریگر تھا، یا مسلمانوں کے والیوں میں سے تھا، خواہ محتسب، قاضی یا سلطان۔ اور اس کے اور اللہ کے درمیان ایسے راز تھے جو اس سے معلوم نہیں ہو سکے۔\nپس قیامت کے دن، جب آخرت میں اس کے پاس موجود چیزیں ظاہر ہوں گی، تو اس کے بارے میں کہا جائے گا کہ اللہ کے امانت دار ہیں، کیونکہ یہ چیزیں ان کے پاس تھیں اور انہوں نے دنیا میں انہیں ظاہر نہیں کیا، جبکہ دوسرے لوگ ان چیزوں کو ظاہر کرتے تھے جو اللہ نے انہیں کشف (الکشف) کے ذریعے عطا کی تھیں، جیسے خواطر (دل میں آنے والے خیالات) پر کلام کرنا، یا زمین پر کلام کرنا، ہوا میں اڑنا، پانی پر چلنا، اور کائنات سے کھانا۔\nحالانکہ ان پر ان میں سے کوئی چیز ظاہر نہیں ہوئی، جبکہ وہ ان کی قوت میں تھی اور ان کے تصرف کے تحت تھی۔ اور انہوں نے انکار کیا کہ وہ عام مسلمانوں کے حال کے علاوہ کسی اور حال پر ہوں، اور وہ خاص طور پر اس طریق کے اہل میں سے ملامیہ (الملامية) ہیں۔ ان کے بڑے اور چھوٹے سب اسی حال پر ہوتے ہیں۔\nپس یہ شخص امت محمدیہ (الأمة المحمدیة) میں ایسا ہوتا ہے جیسے جبرئیل ملکی امت (فرشتوں کی جماعت) میں، باطن میں مطاع (جس کا حکم مانا جائے)۔ کیونکہ جبرئیل ایک روح ہیں اور ان کا باطن ہے، اگر وہ حکم دیں تو ظاہر میں ان کا حکم نہیں مانا جائے گا، لیکن وہ حکم دیتے ہی نہیں، کیونکہ وہ عام لوگوں سے کسی چیز میں ممتاز نہیں ہوئے۔ اگر وہ عام لوگوں کے سامنے کسی ایسی خرقِ عادت (عادت کے خلاف) چیز سے ممتاز ہو جاتے جو اس مقام کا تقاضا نہیں کرتی، تو وہ عظیم سمجھے جاتے اور عام لوگوں پر ان کی برتری ظاہر ہونے کی وجہ سے ان کے حکم کی تعمیل کی جاتی۔\nپس یہی وجہ ہے کہ اگر وہ حکم دیتے تو ان کا حکم رد کر دیا جاتا، لیکن وہ حکم نہیں دیتے۔ لیکن وہ باطن میں مطاع الامر (جس کا حکم مانا جائے) ہیں۔\nہم نے ان میں سے ایک جماعت کو دیکھا ہے، جیسے عبداللہ بن تاخمست اور ابن جعدون الحناوی، جو اوتاد (الأوتاد) میں سے تھے اور بڑی شان والے تھے۔\nپس یہ عارف، جسے یہ مقام حاصل ہے جو ہم نے ذکر کیا، اسے اپنے نفس پر تمکن (مکمل اختیار) حاصل ہے۔ اور جسے اپنے نفس پر تمکن حاصل ہو گیا، وہ اللہ کی مخلوق میں سب سے زیادہ قوی ہے۔ کیونکہ نفس دنیا میں ربوبیت کے ساتھ ظاہر ہونا چاہتا ہے۔\nاور اس مقام کے مالک کو اللہ نے سیادت (سرداری) کے اوصاف سے نوازا ہے اور اسے اتنی قوت دی ہے کہ وہ کسی چیز کو \"ہو جا\" کہے تو وہ ہو جاتی ہے، اپنے رب کے ہاں اس کے مقام کی وجہ سے۔\nپس اس کی قوت میں سے یہ تھا کہ اس نے اپنے نفس کو قابو کر لیا، چنانچہ اس پر ان میں سے کوئی چیز ظاہر نہیں ہوئی، نہ اس کے اقوال میں، نہ اس کے افعال میں، اور نہ اس کی عبادت میں۔ اور وہ ان لوگوں میں سے ہے جن کے بارے میں رسول اللہ صلی اللہ علیہ وسلم نے حسن غریب حدیث میں صراحت فرمائی، جب اللہ نے زمین کے ڈولنے پر پہاڑوں کو پیدا کیا تو وہ جم گئے اور ان کا ڈولنا رک گیا۔\nتو فرشتوں نے کہا: \"اے ہمارے رب! کیا تو نے پہاڑوں سے زیادہ سخت کوئی چیز پیدا کی ہے؟\" اللہ نے فرمایا: \"ہاں، لوہا۔\" فرشتوں نے کہا: \"اے ہمارے رب! کیا تو نے لوہے سے زیادہ سخت کوئی چیز پیدا کی ہے؟\" اللہ نے فرمایا: \"ہاں، آگ۔\" فرشتوں نے کہا: \"اے ہمارے رب! کیا تو نے آگ سے زیادہ سخت کوئی چیز پیدا کی ہے؟\" اللہ نے فرمایا: \"ہاں، پانی۔\" فرشتوں نے کہا: \"اے ہمارے رب! کیا تو نے پانی سے زیادہ سخت کوئی چیز پیدا کی ہے؟\" اللہ نے فرمایا: \"ہاں، ہوا (ہوا)۔\" فرشتوں نے کہا: \"اے ہمارے رب! کیا تو نے ہوا سے زیادہ سخت کوئی چیز پیدا کی ہے؟\" اللہ نے فرمایا: \"ہاں، وہ مومن جو اپنے دائیں ہاتھ سے صدقہ کرتا ہے اور اس کا بایاں ہاتھ اسے نہیں جانتا، یا فرمایا: وہ اسے اپنے بائیں ہاتھ سے چھپاتا ہے۔\"\n\nاور یہ ان لوگوں کا حال ہے جن کا ہم نے ذکر کیا، اور رسول اللہ صلی اللہ علیہ وسلم نے انہیں قوت سے متصف کیا ہے، اور ان کے پاس ان اقویاء سے زیادہ قوت ہے جن کا آپ نے ذکر کیا۔ کیونکہ نفس اپنی جنس پر سرداری کی محبت پر جبلت اور تخلیق کے اعتبار سے پیدا کیا گیا ہے۔ اور جسے کہا جائے کہ اپنی جبلت اور فطرت سے باہر آ جا، تو اسے ایک عظیم کام کا مکلف کیا گیا ہے۔\nپس پاک ہے وہ ذات جس نے انہیں اتنی قوت عطا کی کہ ان کے لیے ایسی چیزیں آسان ہو گئیں! اور اس کی وجہ یہ ہے کہ اللہ نے انہیں وہ معرفت (المعرفۃ) عطا کی جس کے لیے وہ پیدا کیے گئے تھے، جس نے انہیں حقِ عبودیت (العبودیۃ) کی ادائیگی میں مشغول کر دیا، ایسی چیزوں سے۔\nپس وہ اس بہترین طریقے پر ہیں جسے اللہ نے اپنے بندوں کے لیے چنا ہے، اور اس پر ثابت قدم رہنے کی وجہ سے انہیں قربت (الزلفی) کا مقام حاصل ہے، وہ اللہ کے ہاں مکرم ہیں۔\nاور یہ عارف جو اس مرتبے پر فائز ہے، ان افراد (الأفراد) میں سے ہے جنہیں حق (الحق) نے اپنے لیے خاص کر لیا اور ان کے اور مخلوق کے درمیان عادت کا پردہ (حجاب العادة) گرا دیا۔ پس انہیں اپنے لیے خالص کر لیا اور ان سے راضی ہوا اور وہ اس سے راضی ہوئے۔\nاور اس مقام کے مالک کو علوی اور سفلی عالم میں مؤثر ہونے والی ایک ہزار دو سو (۱۲۰٠) قوتیں عطا کی گئیں، جن میں سے ایک قوت اگر کائنات پر مسلط کر دی جائے تو اسے نیست و نابود کر دے۔\nاس کے باوجود، ان قوتوں پر تمکن رکھنے کے باوجود، جب اس پر مکھی بیٹھتی ہے تو وہ اسے ہٹانے کی قدرت نہیں رکھتا، اللہ سے حیاء (الحیاء) اور معرفت (المعرفۃ) کی وجہ سے۔\nجہاں تک اس معرفت کا تعلق ہے جو اسے اس معاملے میں حاصل ہے، تو وہ مکھی حق (الحق) کی طرف سے اس کے پاس ایک قاصد ہے، اور وہی ہے جس نے اسے اس پر اتارا ہے۔ پس وہ اس علم کی نگرانی کرتا ہے جو وہ اس کے پاس لائی ہے۔ جب وہ اپنے پیغام سے فارغ ہو جاتی ہے، اگر وہ چاہے تو اٹھ جائے اگر اس کے خالق نے اسے بلایا ہو، اور اگر وہ چاہے تو ٹھہری رہے۔ پس یہ عارف اس مکھی قاصد کی کرسی ہوتا ہے۔\nپس یہ وجہ ہے کہ وہ اسے چھوڑ دیتا ہے اور اسے اپنے سے دور نہیں بھگاتا جیسا کہ عام لوگ کرتے ہیں، اس معرفت کی وجہ سے۔\nاور جہاں تک اللہ سے حیاء کا تعلق ہے، تو مکھی کو ہٹانے میں نفس کے لیے راحت اور جلد ملنے والی نعمت ہے۔ اور اللہ نے انسان کو اس دنیا میں راحت اور نعمت کے لیے پیدا نہیں کیا، بلکہ اپنے رب کی عبادت کے لیے پیدا کیا ہے۔ پس وہ حیاء کرتا ہے کہ اللہ اسے مکھی کی اذیت سے راحت طلب کرتے ہوئے دیکھے، جبکہ یہ مقام اس کا تقاضا نہیں کرتا۔\nاگر آپ کہیں کہ وہ شخص جو دنیا میں حلال میں نعمتوں سے لطف اندوز ہوتا ہے، تو ہم کہیں گے کہ ہم عارف کے علاوہ کسی اور کے حق میں اس سے منع نہیں کرتے، لیکن عارف تکلیف (التکلیف) کے دائرے میں ہے۔\nپس اللہ اسے جو بھی نعمت عطا کرتا ہے، خواہ باطنی ہو یا ظاہری، اس کے ساتھ اللہ کی طرف سے اس پر شکر کا تکلیف (فرض) بھی ہوتا ہے۔ پس وہ تکلیف عارف کے لیے اس نعمت سے لطف اندوز ہونے میں تلخی پیدا کر دیتی ہے، کیونکہ وہ اس پر شکر کے توازن میں مشغول ہو جاتا ہے۔ اور جب وہ اس کا شکر ادا کرتا ہے، تو اس کی ادائیگی بھی اللہ کی طرف سے اس پر ایک نعمت ہے جس پر اسے شکر کرنا واجب ہے۔\nپس وہ ہمیشہ اپنے دل میں پریشان رہتا ہے کہ وہ انصاف کے ساتھ وزن قائم کرے تاکہ میزان میں خسارہ نہ ہو۔ اور جس کا یہ حال ہو، وہ کیسے لطف اندوز ہو سکتا ہے؟ اس کا ظاہر نعمت ہے اور اس کا باطن غم ہے۔ وہ مسلسل اللہ کی ظاہری اور باطنی نعمتوں میں پلٹتا رہتا ہے، اور وہ اس کے نزدیک صرف درد اور تلخی ہی پیدا کرتی ہیں۔\nجبکہ عام لوگ ان نعمتوں پر خوش ہوتے ہیں اور ان میں فخر اور غرور سے تصرف کرتے ہیں۔ اور عارف پر دنیا میں اس کے قلب میں راحت کا دروازہ بند ہے، اگرچہ وہ اپنے ظاہر میں راحت محسوس کرے۔ وہ ہر سانس میں ہزار موتیں مرتا ہے اور اسے اس کا احساس نہیں ہوتا۔\nعمر بن خطاب رضی اللہ عنہ فرماتے ہیں: \"اللہ نے مجھے کسی مصیبت میں مبتلا نہیں کیا مگر میں نے اس میں اللہ کی طرف سے تین نعمتیں دیکھیں۔ پہلی یہ کہ وہ میرے دین میں نہیں تھی۔ دوسری یہ کہ وہ اس سے بڑی نہیں تھی۔ تیسری یہ کہ اللہ نے اس پر ثواب کا وعدہ کیا ہے۔\"\nاور جو شخص ایک مصیبت میں تین نعمتیں دیکھتا ہے، وہ اس مصیبت سے بھی بڑی مصیبت میں منتقل ہو گیا، کیونکہ اس پر تین نعمتوں پر شکر کا میزان قائم کرنا لازم ہو جاتا ہے۔ اللہ نے اسے ایک مصیبت میں مبتلا کیا تاکہ وہ اس پر صبر کرے، اور اس کی معرفت نے اسے اس مصیبت میں تین مصیبتوں میں مبتلا کر دیا، جن پر اللہ نے اسے شکر کا مکلف کیا، کیونکہ اس نے اسے اس ایک مصیبت میں ان نعمتوں سے آگاہ کر دیا۔\nپس عمر رضی اللہ عنہ کی معرفت کو دیکھیں کہ انہوں نے اپنے نفس پر کس طرح یہ چیز واجب کر لی، اور اس میں موجود ادب کو دیکھیں کہ انہوں نے اسے مصیبت سمجھنے کے بجائے نعمتوں کو دیکھنے کی طرف موڑ دیا، پس اسے قبولیت کے ساتھ لیا، کیونکہ نعمت اپنی ذات میں محبوب ہے۔ پس وہ راضی ہوئے، اور انہیں رضا، تسلیم، تفویض، صبر اور اللہ پر بھروسے کا مقام حاصل ہوا۔\nاور لوگ اس شریف ذوق سے کہاں ہیں؟\nاور اولیاء میں سے کسی نے بھی اس مقام کو قائم نہیں کیا اور نہ اس میں حکم دیا، سوائے ابوبکر صدیق رضی اللہ عنہ کے، مگر جسے میں نہیں جانتا۔ کیونکہ ان پر ان کی باطنی معرفت میں سے کوئی چیز ظاہر نہیں ہوئی، ان کی قوت کی وجہ سے، سوائے اس دن جب رسول اللہ صلی اللہ علیہ وسلم کی وفات ہوئی اور جماعت حیران رہ گئی اور انہوں نے وہ باتیں کہیں جو ان سے منقول ہیں، سوائے صدیق کے۔\nکیونکہ اللہ تعالیٰ نے انہیں اس قوت کے اظہار کی توفیق دی جو اس نے انہیں عطا کی تھی، کیونکہ اللہ نے انہیں جماعت کے بجائے امامت اور تقدم کے لیے اہل بنایا تھا۔ اور امام کا ہوش میں ہونا ضروری ہے، وہ نشے میں نہیں ہو سکتا۔\nپس وہ قوت ان کے لیے اس بات پر دلالت کرنے کے لیے قائم ہوئی کہ اللہ نے انہیں رسول اللہ صلی اللہ علیہ وسلم کی امت میں ان کی خلافت کے لیے جماعت کا مقدم بنا دیا ہے، جیسے نبی صلی اللہ علیہ وسلم کے لیے ان کی نبوت پر دلالت کرنے کے لیے معجزہ ہوتا ہے۔\nپس وہ آگے بڑھے اور یہ امرِ الٰہی بعض کی رضامندی اور بعض کی ناپسندیدگی کے بغیر حاصل نہیں ہوا۔ اور یہ ان کی امامت میں کوئی نقص نہیں ہے کہ کسی نے ناپسند کیا، کیونکہ یہ مقامِ الٰہی ہے۔\nاور اللہ فرماتا ہے: **وَلِلَّهِ يَسْجُدُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا** (اور اللہ ہی کے لیے سجدہ کرتے ہیں جو آسمانوں اور زمین میں ہیں، خوشی سے اور ناخوشی سے)۔\nپس جب خالق، جس کے ہاتھ میں ہر چیز کی بادشاہت ہے، اس کے لیے ناخوشی سے سجدہ کیا جاتا ہے، تو اس کے خلیفہ اور مخلوق میں اس کے نائب، جو کہ رسول ہیں، کا کیا حال ہو گا؟ اور ابوبکر اور دیگر کا کیا حال ہو گا؟\nپس اطاعت کرنے والا اور ناپسند کرنے والا دونوں کا ہونا ضروری ہے جو ناپسندیدگی کے ساتھ امر میں داخل ہوتا ہے، اگر وہ دیندار ہو تو کسی شبہ کی وجہ سے، یا اگر وہ دیندار نہ ہو تو نفسانی خواہش کی وجہ سے۔\nجہاں تک ان صحابہ رضی اللہ عنہم کا تعلق ہے جنہوں نے ان کی امامت کو ناپسند کیا، تو وہ نفسانی خواہش کی وجہ سے نہیں تھا—ہم جماعت کے بارے میں حسن ظن رکھتے ہوئے انہیں اس سے پاک سمجھتے ہیں—بلکہ یہ کسی شبہ کی وجہ سے تھا جو ان کے ہاں قائم ہوا، جس کی وجہ سے جس نے یہ رائے رکھی، اس نے اپنے خیال میں خود کو ان سے زیادہ حقدار سمجھا، نہ کہ اللہ کے علم میں۔\nکیونکہ اللہ کے علم میں یہ بات پہلے سے طے تھی کہ وہ انہیں زمین میں خلیفہ بنائے گا، اور اسی طرح عمر، عثمان، علی اور حسن کو بھی۔\nاگر ابوبکر کے علاوہ کوئی اور آگے بڑھتا تو ابوبکر اس کی خلافت میں وفات پا جاتے، حالانکہ اللہ کے علم میں ان کا خلیفہ ہونا ضروری تھا۔\nپس وہ زمانے کے لحاظ سے ان سے آگے بڑھے، کیونکہ وہ آخرت سے سب سے پہلے ملنے والے تھے۔ پس خلافت میں اس ترتیب کی وجہ ان کی عمروں کی ترتیب تھی۔\nپس جو دنیا سے دیر سے جدا ہو گا، اس کا اس منصب سے پیچھے رہنا ضروری ہے تاکہ وہ سب اس منصب پر فائز ہوں۔\nاور ان میں سے بعض کی فضیلت بعض پر اللہ کی طرف موقوف ہے، وہی ان کے مراتب کو اپنے ہاں جانتا ہے۔ کیونکہ مخلوق خالق کے نفس میں موجود چیز کو نہیں جانتی، سوائے اس کے جو خالق سبحانہ اسے بتا دے۔ اور مجھے اس میں سے کسی چیز کی خبر نہیں دی گئی ہے۔\nپس وہ اپنے نفس میں موجود چیز کو نہیں جانتا مگر جب وہ کوئی ایسا امر وجود میں لائے جس سے ہم جان لیں کہ اگر اللہ کے علم میں اس کا ہونا پہلے سے نہ ہوتا تو وہ نہ ہوتا۔\nاللہ ہمیں فضول باتوں سے بچائے، بیشک وہ **ذُو الْفَضْلِ الْعَظِيمِ** (عظیم فضل والا) ہے۔\nپس میں نے آپ کے لیے اس مقام سے عارف کے مقام کو انتہائی اختصار کے ساتھ، تنبیہ اور اشارے کے طریقے پر واضح کر دیا ہے۔ کیونکہ یہ مقام عظیم ہے اور اس میں عجیب و غریب تفصیلات ہیں۔\nاب ہم ان علوم کی فہرست ذکر کرتے ہیں جو یہ مقام اپنے اندر رکھتا ہے:\n\nان میں سے ایک علمِ نورِ اعظم (النور الأعظم) کے زوال اور اس کے حکم کے باقی رہنے کا ہے۔ اور یہ عجیب ترین چیزوں میں سے ہے کہ حاکم کی عین (ذات) کے نہ ہونے کے باوجود حکم کا وجود باقی رہے۔\nاور اس مسئلے سے رسول اللہ صلی اللہ علیہ وسلم کا فقدان اور مکلفین میں ان کی شریعت کا باقی رہنا متعلق ہے، سوائے اس مذہب کے جو کہتا ہے کہ شارع (قانون ساز) اللہ ہے اور وہ موجود ہے۔\nاور اس میں علمِ علوم کے مٹ جانے (طموس العلوم) اور اس کی وجہ کا علم ہے۔\nاور ان میں سے ایک سبب یہ ہے کہ اہل مراتب کو ان کے مراتب سے معزول کر دیا جاتا ہے، باوجود اس کے کہ ان میں اہلیت موجود ہوتی ہے۔ اور انہیں کیوں معزول کیا گیا جبکہ وہ اس کے مستحق تھے؟ اور کیا اہلیت کے باوجود یہ معزولی صحیح ہے یا نہیں؟\nاور کیا سلطان کو یہ حق ہے کہ وہ قاضیِ عادل کو معزول کر دے جب وہ اسے والی بنائے؟ یا اگر سلطان اس پر ظلم کرے اور اسے حکم دینے سے روک دے تو کیا وہ نفسِ امر میں معزول نہیں ہوتا؟\nاگر وہ اس حالت میں حکم دے تو کیا شرعاً اس کا حکم نافذ ہو گا یا نہیں؟\nاور اس حالت میں کسی شخص کے حق میں کسی امر کا فیصلہ کرنے کے بعد، اگر سلطان اس کے نفاذ سے انکار کر دے، اور جس فریق کے خلاف فیصلہ ہوا ہے وہ سلطان کے مقرر کردہ دوسرے قاضی کی طرف رجوع کا مطالبہ کرے، اور دوسرے قاضی کے ہاں یہ ظاہر ہو کہ فیصلہ اس شخص کے حق میں تھا جس کے خلاف پہلے قاضی نے فیصلہ کیا تھا، تو کیا اس دوسرے قاضی کے ہاں جس کے حق میں فیصلہ ہوا ہے، اسے وہ چیز لینے کا حق ہے جو اس کے فریق نے پہلے حاکم کے ذریعے اس سے چھین لی تھی یا نہیں؟\nاور کیا اس دوسرے قاضی کا فیصلہ صحیح ہے یا نہیں؟ اور اگر صحیح ہے، تو کیا وہ پہلے کی طرح اس میں مستقل ہے، یا وہ پہلے کا نائب ہے، مگر سلطانی حکم سے؟ یا کیا پہلا حاکم سلطان کے معزول کرنے سے معزول ہو جاتا ہے؟\nاس منزل سے یہ سب معلوم ہوتا ہے۔ اور جو شخص اس مسئلے کی تحقیق اور دلیل چاہتا ہے، تو وہ ایک ہی شریعت میں وارد ہونے والے نسخ (منسوخ ہونے) کو دیکھے، تو معزولی صحیح ہے۔ اور جس نے شارعین (قانون سازوں) کے حکم کو دیکھا اور یہ کہ اللہ نے کسی نبی یا رسول کو اس امت میں اس کے علاوہ کسی اور سے اس کی رسالت سے معزول نہیں کیا مگر اس کی موت کے بعد، تو اس نے کہا کہ وہ معزول نہیں ہوتا۔ پس یہ اس کے مطابق ہے جو اس پر کشف (الکشف) ہوتا ہے۔ پس سمجھ لو۔\nاور اس منزل کے علوم میں سے علمِ جور (ظلم) ہے کہ عالم میں یہ کس حضرت (حضورِ الٰہی) سے صادر ہوا، حالانکہ وہاں عدلِ محض (مکمل انصاف) کے سوا کچھ نہیں ہے۔ تو یہ جور کہاں سے آیا؟ اور اس سے کون سی حقیقت وابستہ ہے؟ اور کون سا اسم اس پر دلالت کرتا ہے؟\nاور ان مردوں کا زوال جن کے ذریعے اللہ عالم کی حفاظت کرتا ہے۔\nاور علمِ کلمات اور ہمتوں کا اعمال کی سواریوں پر نزول، یہ کیوں ہوتا ہے؟\nاور علمِ بعثِ اخروی (البعث الأخروی)، کیا یہ ہر حیوان کے لیے عام ہے یا صرف انسان اور جن کے لیے خاص ہے؟ اور اللہ کے اس قول کا کیا مطلب ہے: **سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ** (عنقریب ہم تمہاری طرف متوجہ ہوں گے، اے دونوں بوجھ والو!)۔\nاور علمِ استحالاتِ عنصریہ (العنصریۃ) (عناصر کی تبدیلیوں) کا۔\nاور علمِ اس چیز کا جو روح اور جسمِ طبیعی کے تالیف (ملنے) سے پیدا ہوتی ہے۔ اور کیا جسم روح کے لیے نکاح میں بیوی کے لیے شوہر کی طرح ہے، اس چیز کے لیے جو ان دونوں کے درمیان پیدا ہوتی ہے یا نہیں؟\nاور کیا موت طلاقِ رجعی ہے یا طلاقِ بائن؟ کیونکہ علماء نے کہا ہے کہ جب عورت مر جاتی ہے تو وہ اپنے شوہر کے لیے اجنبی کی طرح ہو جاتی ہے، اور یہ ضروری ہے، پس اسے اس پر پردہ اٹھانے کا حق نہیں ہے۔ اور دوسرے لوگ زوجیت کی حرمت کے باقی رہنے کی طرف گئے ہیں، پس اسے اسے غسل دینے کا حق ہے، اور اس کا حال اس کے ساتھ اس کی زندگی کے حال کی طرح ہے۔\nاگر یہ طلاقِ رجعی ہے، تو ارواح بعث میں ان اجسام کی عین (ذات) کی طرف ان کے جوہر کے لحاظ سے لوٹیں گی۔ اور اگر یہ رجعی نہیں، بلکہ بائن ہے، تو ہو سکتا ہے کہ وہ ان کی طرف لوٹیں اور تالیف مختلف ہو، اور اہل نعمت کے لیے دوسرے اجسام پیدا کیے جائیں جو زیادہ صاف اور بہتر ہوں، اور اہل عذاب کے لیے اس کے برعکس۔\nاور علمِ بچوں کے کلام کا، وہ کہاں سے بولتے ہیں اور انہیں کون بلواتا ہے؟ جیسے عیسیٰ علیہ السلام کا گہوارے میں کلام، اور یوسف علیہ السلام کے بچے کا کلام، اور جریج کا۔\nجہاں تک میرا تعلق ہے، تو میں نے اپنے زمانے میں دمشق شہر میں ابن رواحہ کے مدرسے میں ایک نوجوان شخص کو دیکھا، جس کا نام، واللہ اعلم، عبدالقادر تھا۔ وہ آیا اور سلام کیا۔ تو مجھے اس کے بارے میں ایک جماعت نے خبر دی، جن میں مدرسے کے مالک زکی بن رواحہ بھی تھے، انہوں نے کہا کہ جب یہ نوجوان اپنی ماں کے پیٹ میں تھا، تو اس کی ماں کو چھینک آئی اور اس نے الحمد للہ کہا، تو اس نے اپنے پیٹ کے اندر سے اسے کہا: \"یرحمک اللہ\" (اللہ تم پر رحم کرے)، ایسی آواز میں جسے وہاں موجود ہر شخص نے سنا۔\nاور جہاں تک میرے والد کا تعلق ہے، تو میری ایک بیٹی تھی جو دودھ پیتی تھی، اور اس کی عمر دو سال سے کم اور ایک سال سے زیادہ تھی، وہ بات نہیں کرتی تھی۔ ایک دن میں اسے کھلا رہا تھا، تو میں نے اسے کہا: \"اے زینب!\" تو اس نے میری طرف توجہ کی۔ میں نے اس سے کہا: \"میں تم سے ایک مسئلہ پوچھنا چاہتا ہوں، فتویٰ طلب کرتے ہوئے، تمہارا کیا خیال ہے اس شخص کے بارے میں جو اپنی بیوی سے جماع کرے اور انزال نہ ہو، تو اس پر کیا واجب ہے؟\" تو اس نے مجھے فصیح کلام میں کہا: \"اس پر غسل واجب ہے۔\" اور اس کی ماں اور نانی سن رہی تھیں، تو اس کی نانی چیخ اٹھی اور بے ہوش ہو گئی۔\nاور علمِ لپیٹنے کے بعد پھیلانے (النشر بعد الطی) کا، جیسا کہ اللہ تعالیٰ نے فرمایا: **وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ** (اور آسمان اس کے داہنے ہاتھ میں لپیٹے ہوئے ہوں گے)۔\nاور علمِ محو و اثبات (مٹانا اور ثابت کرنا) کا۔\nاور علمِ انوار کے دوگنا ہونے کا۔\nاور علمِ قربِ الٰہیہ (القرب الإلهیۃ) کا جو تجلی (التجلی) عطا کرتی ہے۔\nاور علمِ غیبت اور حضور کا۔\nاور علمِ نجوم کا۔\nاور علمِ زمان (وقت) کا۔\nاور علمِ شرائع کے نازل ہونے کا اور اس کی صفت کا کہ کون انہیں نازل کرتا ہے اور کس پر نازل ہوتی ہیں، اور کیا یہ اختصاص (الاختصاص) کے باب سے ہے یا نہیں؟\nاور علمِ تائید، سلطان اور عالم میں حق (الحق) کی نیابت (النیابۃ) کا، یہاں تک کہ انسان کے اپنے نفس میں بھی۔\nاور علمِ کشف (الکشف) کا، اور وہ پردہ کیا ہے جو لوگوں اور اس چیز کے درمیان ہے جسے یہ مکاشف (کشف کرنے والا) دیکھتا ہے؟ اور کیا یہ طریق (راستے) میں شرط ہے یا نہیں؟\nاور علمِ ارواحِ علویہ (الأرواح العلویۃ) کو دیکھنے کا۔\nاور اس شخص میں سچائی کی علامت کا جو ارواح کو دیکھنے کا دعویٰ کرتا ہے، کہ ان میں سچا کون ہے اور جھوٹا کون؟ اور ہمارے پاس ان کے بارے میں ایسی علامات ہیں جن سے معلوم ہوتا ہے کہ ان میں سے کون سچ بولتا ہے اور کون جھوٹ بولتا ہے۔\nاور ہمارے پاس سچے شخص کے بارے میں بھی دوسری علامات ہیں، جب وہ اس چیز کے بارے میں خبر دیتا ہے جو اس نے دیکھی، تو کیا وہ خود ارواح کے بارے میں خبر دے رہا ہے یا ان خیالات کے بارے میں جو اس کے لیے قائم ہوئے، اور وہ یہ خیال کرتا ہے کہ اس نے فرشتہ یا جن دیکھا، حالانکہ اس نے نہیں دیکھا، بلکہ اس کے خیال میں مثالیں قائم ہوئیں جو اس پر سلطانِ خیال (خیال کی قوت) کے غلبے کی وجہ سے اس کے وہم سے باہر تھیں۔\nپس ہمارے پاس ایسے لوگوں کے بارے میں علامات ہیں، وہ جو کچھ دیکھتے ہیں اس میں سچے ہوتے ہیں، لیکن اس حکم میں غلطی کرتے ہیں کہ انہوں نے فرشتہ یا جن دیکھا، حالانکہ وہ مرئی چیز نہ فرشتہ ہے اور نہ جن۔ پس یہ اس منزل کے علم کی خصوصیات میں سے ہے۔\nاور علمِ وعید (سزا کی دھمکی) کا، اور یہ کیوں واپس لی جاتی ہے؟\nاور جس نے قرآن کا مقابلہ کیا، اس پر کیا گزری؟ جیسے حلاج (الحلاج) کے ساتھ ہوا، جب عمرو بن عثمان مکی ان کے پاس آئے اور کہا: \"اے حلاج! تم کیا کر رہے ہو؟\" تو انہوں نے کہا: \"میں قرآن کا مقابلہ کر رہا ہوں۔\" تو انہوں نے ان کے لیے بددعا کی۔ پس مشائخ کہا کرتے تھے کہ حلاج کو صرف اس شیخ کی بددعا کی وجہ سے مصیبت پہنچی۔\nاور جیسے مہذب ثابت بن عنتر حلوی، میں ان سے موصل میں سنہ چھ سو ایک (۶۰۱ھ) میں ملا، انہوں نے قرآن کا مقابلہ کیا اور میں نے انہیں اس کی سورتیں تلاوت کرتے ہوئے سنا۔ ان کے مزاج میں کچھ خلل تھا، لیکن وہ لوگوں میں سب سے زیادہ زاہد اور نفس کے اعتبار سے سب سے زیادہ شریف تھے۔ اور وہ اسی سال وفات پا گئے۔\nاور اس منزل میں علمِ مشیئتِ محدثہ (المشیئۃ المحدثۃ) (پیدا کی گئی مشیت) کا ہے، کیا اس کا افعال میں کوئی اثر ہے، جیسا کہ اشاعرہ کسب (الکسب) کے مسئلے میں کہتے ہیں، یا اس کا کوئی اثر نہیں؟\nاور کیا یہ حق (الحق) کے مظاہر (ظہور کی جگہوں) میں سے ہے، یا یہ کسی وقت حق کے مظاہر میں سے ہوتی ہے، اور وہ مشیت ہے جس کا حکم نافذ ہوتا ہے، اور بعض اوقات حق کا مظہر نہیں ہوتی تو قاصر رہتی ہے؟\nاور اللہ **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و سوم: در معرفت منزل عارف جبرئیلی از حضرت محمدیه (الحضرة المحمدية)\n\nخورشید را در فلک اقصی نشان‌هایی است\nکه اقوامی چون بمیرند، آن را درمی‌یابند\n\nجان‌هایی پاکیزه چون من، با آن سیر می‌کنند\nکه بر ایشان آشکار نمی‌شود مگر آنگاه که شب را به سر برند\n\nدر محراب‌هایشان از باده‌ها مست‌اند\nحال آنکه در هستی (الوجود)، مستی‌ای برایشان نیست\n\nپس اگر بخواهند که مستی‌شان زایل شود و به هوشیاری رسند\nآیاتی از قرآن بر آنان تلاوت می‌شود\n\n### [اینکه برخی از ارواح علوی سماوی که به ملائکه تعبیر می‌شوند، صاحبان امر هستند]\n\nبدان، خداوند تو را تأیید کند، که برخی از ارواح علوی سماوی که به ملائکه تعبیر می‌شوند، پیشوایانی هستند که در میان ملأ اعلی (الملإ الأعلى) بر کسانی که بر آنان مقدم شده‌اند، امری مطاع دارند. و ایشان صاحبان امرند، نه صاحبان نهی. پس از آنچه خدا به آنان امر کرده، سرپیچی نمی‌کنند و آنچه را که مأمورند انجام می‌دهند (لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ). و خداوند متعال با این سخن که: «مطاع است و امین» (مُطَاعٍ ثَمَّ أَمِينٍ)، هشدار داده است که جبرئیل (علیه السلام) از ایشان است. و کسی مطاع نمی‌شود مگر آنکه بر کسی که از او اطاعت می‌کند، امر داشته باشد.\n\n### [اینکه عارف به اندازه مرتبه آن روح، در عالم علوی و سفلی اثر دارد]\n\nپس بدان که اگر عارفی از ملأ اعلی (الملإ الأعلى) توسط روحی از این ارواح آمره که بر دیگران تقدم دارند، مانند اسرافیل، اسماعیل، عزرائیل، جبرئیل، میکائیل، نور و روح و امثال ایشان، مدد گیرد؛ آن عارف به اندازه مرتبه آن روحی که از آنجا سرپرستی او را بر عهده دارد، در عالم علوی و سفلی اثرگذار خواهد بود. پس کسی که اسرافیل سرپرستی او را بر عهده گیرد، اثرگذاری‌اش به حسب مرتبه اسرافیل و آنچه تحت نظر و امر اوست خواهد بود. و همچنین هر روحی در این مرتبه، مرد یا زنی بر مقام او دارد. و این همان چیزی است که از این طایفه (صوفیه) می‌شنوید که می‌گویند: «فلانی بر قلب آدم است» یا «گروهی بر قلب آدم و گروهی بر قلب ابراهیم هستند». یعنی ایشان از مقام ولایت (الولاية) که آدم و ابراهیم دارند، بهره‌مندند، نه از مقام نبوت (النبوة). و اگرچه بهره‌ای از نبوت داشته باشند، آن بهره از برخی مقامات آن است نه همه آن، مانند رؤیا که جزئی از اجزای نبوت است و غیر آن. اما نبوت به طور کلی جز برای پیامبر حاصل نمی‌شود. و اما ولی (الولي) چنین نیست، مگر آنکه از پشت سرش کسی او را مدد رساند و تقویت و تأیید کند.\n\nمن این را به صورت مشاهده از خود گرفته‌ام و به من خبر داده شده است که هر ولی‌ای این‌گونه آن را از کاملان در ولایت (الولاية) می‌گیرد و از آن ترجمه می‌کند، اما از پس پرده پشت. و برای پیامبر، از بالا یا از پیش رو بر قلبش نازل می‌شود یا در گوشش با آن مخاطب می‌گردد. پس ولی (الولي) اثر آن را به صورت ذوق (ذوق) می‌یابد و در آن مانند نابینایی است که وجود شخصی را در کنار خود حس می‌کند اما نمی‌داند آن شخص کیست. و به همین دلیل این طایفه (صوفیه) می‌گویند: «خدا را جز خدا نمی‌شناسد، و پیامبر را جز پیامبر نمی‌شناسد، و ولی را جز ولی مانند خودش نمی‌شناسد.» پس پیامبر دارای چشمی گشوده برای مشاهده نبوت (النبوة) است، و ولی دارای چشمی گشوده برای مشاهده ولایت (الولاية) است، اما چشمی کور برای مشاهده نبوت دارد؛ زیرا نبوت از پشت سر اوست. او در این امر مانند حافظ قرآن است؛ زیرا کسی که قرآن را حفظ کند، نبوت در میان دو پهلویش جای داده شده است، و گفته نشده است که در سینه‌اش یا میان دو چشمش یا در قلبش قرار دارد؛ زیرا آن رتبه پیامبر است نه رتبه ولی.\n\nو کسب (الاكتساب) کجا و اختصاص (التخصيص) کجا؟ نبوت اختصاصی از جانب خداوند است که هر که را از بندگانش بخواهد، به آن مخصوص می‌گرداند. و آن باب بسته شده و به رسول خدا محمد (صَلَّى اللهُ عَليهِ وسَلَّم) ختم گردیده است. اما ولایت (الولاية) تا روز قیامت اکتسابی است؛ پس هر کس در به دست آوردن آن تلاش کند، برایش حاصل می‌شود. و تلاش در به دست آوردن آن نیز اختصاصی از جانب خداوند است که هر که را بخواهد به رحمت خود مخصوص می‌گرداند (يَخْتَصُّ بِرَحْمَتِهِ مَن يَشَاءُ). خداوند متعال می‌فرماید: «تو هر که را دوست داری هدایت نمی‌کنی، بلکه خدا هر که را بخواهد هدایت می‌کند» (إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَن يَشَاءُ). همان‌طور که فرمود: «به وسیله آن هر که را از بندگانمان بخواهیم هدایت می‌کنیم» (نَهْدِي بِهِ مَن نَّشَاءُ مِنْ عِبَادِنَا).\n\nپس ولایت (الولاية) به نور نبوت کسب می‌شود. اولیا (الأولياء) همان والیان حق (الحق) بر بندگان او هستند. و خواص بزرگ‌تر ایشان، رسول و نبی نامیده می‌شوند. و کسی که از مرتبه آنان پایین‌تر باشد، نام ولایت بر او باقی می‌ماند. پس ولایت فلک محیطی است که همه را در بر می‌گیرد. اگرچه همه در منصب ولایت مشترک باشند، اما والیان دارای مراتب هستند؛ سلطان والی بر خلق است، قاضی والی است، و محتسب والی است. و کجا مرتبه سلطان با مرتبه صاحب حسبه (ناظر بر امور عمومی) برابر است؟ و همه ایشان در ولایت دارای امر هستند. و همچنین است آنچه در حق انبیا، رسولان و اقطاب ذکر کردیم؛ هر ولی‌ای بر مرتبه خود قرار دارد. پس سلطنت به طور کلی با کسب حاصل نمی‌شود، اما آنچه غیر از آن است، در به دست آوردنش تلاش می‌شود.\n\nپس والی‌ای هست که خدمتی از مال یا متاع به سلطان تقدیم می‌کند، و سلطان او را به منصبی که شایسته اوست و بر آن خدمت کرده است، می‌گمارد. و این به منزله کسی است که ولایت (الولاية) را از نزد خداوند به واسطه صدقه، قرض نیکو و صله رحم به دست می‌آورد. و برخی از مردم هستند که در سواری و خروج، ملازم خدمت سلطان می‌شوند و خود را در معرض او قرار می‌دهند. پس هرگاه سلطان امری کند و کسی را معین نکرده باشد، این شخص برای امتثال اوامر سلطان می‌شتابد. سلطان او را می‌بیند که ملازم مشاهده اوست و به اوامرش مبادرت می‌ورزد، پس او را والی می‌گرداند. این به منزله کسی است که ولایت (الولاية) را از خداوند به واسطه مراقبه و مبادرت به اوامر مستحبی خداوند (نه اوامر واجب) به دست می‌آورد. و این همان سخن [خداوند در حدیث قدسی] است که: «بنده پیوسته با نوافل (اعمال مستحب) به من نزدیک می‌شود تا آنکه دوستش بدارم. پس چون دوستش بدارم، من گوش و چشم و دست و مؤید او می‌شوم.»\n\nپس این معنای کسب (الکسب) در ولایت (الولاية) است. و همچنین کسی که خود را در معرض سلطان قرار دهد و به امر او خدمت کند و با امر او مواجه شود، و سلطان ببیند که او بر اوامر سلطانی که بر او واجب کرده است محافظت می‌کند، از آن غفلت نمی‌ورزد و تأویل نمی‌کند، بلکه آن را بر وجوب می‌گیرد و به سوی آن می‌شتابد و در امتثال آن پیشی می‌گیرد، در حالی که هم‌رتبه‌اش در انجام آن کندی می‌کند و تأویل می‌نماید. سلطان این را در او می‌بیند و او را والی می‌گرداند و نیابت خود را در میان رعیتش به او می‌دهد. همچنین است کسی که به سوی طاعاتی که خداوند بر او واجب کرده و فرض نموده است می‌شتابد و اوامر او را بر وجوب می‌گیرد و کلام و امر او را تأویل نمی‌کند؛ خداوند او را برمی‌گزیند و بزرگ‌ترین ولایت‌هایش را به او می‌سپارد. و اکنون کسب (الکسب) و جایگاه آن، و اختصاص (الاختصاص) و اهل آن را شناختی. پس بر این راه سلوک کن، که آن دری است که هر کس از آن وارد شود، نجات می‌یابد، سرپرستی می‌شود، نزدیک می‌گردد، آویخته می‌شود و در افق اعلی (الأفق الأعلى) ندا داده می‌شود.\n\n### [ولی (الولي) از امنای خداوند متعال در خلق اوست]\n\nو بدان که ولی‌ای (الولي) که رقیقه روحانی جبرئیلی به او امتداد می‌یابد، از امنای خداوند متعال در خلق اوست که در دنیا شناخته نمی‌شوند. پس چون در آخرت باشد و منزلت او در آنجا آشکار گردد و آنچه در این دنیا بر او پوشیده بود و در اینجا شناخته نمی‌شد، آشکار شود؛ او یا تاجری در بازار بوده، یا فروشنده‌ای صاحب حرفه یا صنعت، یا والی‌ای از والیان مسلمانان در حسبه یا قضاوت یا سلطنت. و میان او و خداوند اسراری است که از او شناخته نمی‌شود. پس در روز قیامت، هنگام ظهور آنچه نزد او بوده است، گفته می‌شود: «خداوند امنایی دارد که این [اسرار] نزدشان بود و در دنیا با آن ظاهر نشدند، در حالی که دیگران با آنچه خداوند از کشف (الکشف) به آنان داده بود، مانند سخن گفتن بر خواطر یا بر زمین، و شکافتن هوا، و راه رفتن بر آب، و خوردن از کائنات، ظاهر شدند.» و هیچ یک از این امور بر او ظاهر نشد، در حالی که در قدرت و تحت تصرف او بود، اما او امتناع ورزید که جز بر آنچه عموم مسلمانان بر آن هستند، باشد. اینان ملامتیه (الملامية) از اهل این طریق هستند، خاصه بزرگ و کوچکشان.\n\nپس این شخص در امت محمدیه (الأمة المحمدية) مانند جبرئیل در امت ملکیه است؛ مطاع باطن. زیرا جبرئیل روحی است و باطن دارد، اما در ظاهر مطاع نیست اگر امر کند، ولی او امر نمی‌کند؛ زیرا او به هیچ چیز از عامه متمایز نشده است. اگر نزد آنان با خرق عادتی که از او ظاهر شود و موطن آن را اقتضا نکند، متمایز می‌شد، بزرگ شمرده می‌شد و امرش به دلیل برتری که بر عامه ظاهر شده بود، امتثال می‌شد. پس این سبب رد امر اوست اگر امر کند، اما او امر نمی‌کند، ولی در باطن مطاع امر است. و ما گروهی از اینان را دیده‌ایم، مانند عبدالله بن تاخمست و مانند ابن جعدون الحناوی که از اوتاد (الأوتاد) و بزرگ‌شأن بود.\n\nپس این عارفی که این مقام مذکور را دارد، بر نفس خود تمکن دارد. و کسی که بر نفس خود تمکن یابد، قوی‌ترین خلق خداست؛ زیرا نفس می‌خواهد در عالم با ربوبیت (الربوبية) ظاهر شود. و صاحب این مقام، خداوند از اوصاف سیادت بر او خلعت پوشانده و او را چنان قوی کرده است که به شیء بگوید «باش» و آن شیء به خاطر جایگاهش نزد پروردگارش موجود شود. پس از جمله قوت او این بود که مالک نفس خود شد و هیچ یک از آن [قدرت‌ها] نه در گفتار، نه در کردار و نه در عبادتش بر او ظاهر نشد. و او از کسانی است که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در حدیث حسن غریب بر او تصریح کرده است، آنگاه که خداوند کوه‌ها را هنگام لرزش زمین آفرید، پس کوه‌ها زمین را محکم کردند و لرزش آن آرام گرفت. ملائکه گفتند: «پروردگارا، آیا چیزی سخت‌تر از کوه‌ها آفریده‌ای؟» فرمود: «آری، آهن.» گفتند: «پروردگارا، آیا چیزی سخت‌تر از آهن آفریده‌ای؟» فرمود: «آری، آتش.» گفتند: «پروردگارا، آیا چیزی سخت‌تر از آتش آفریده‌ای؟» فرمود: «آری، آب.» گفتند: «پروردگارا، آیا چیزی سخت‌تر از آب آفریده‌ای؟» فرمود: «آری، هوا.» گفتند: «پروردگارا، آیا چیزی سخت‌تر از هوا آفریده‌ای؟» فرمود: «مؤمنی که با دست راستش صدقه می‌دهد و دست چپش از آن آگاه نمی‌شود» یا فرمود: «آن را از دست چپش پنهان می‌کند.»\n\nو این حال کسی است که ذکر کردیم. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) او را به قوت وصف کرده است و اینکه او از آن [قوت] بیشتر از آنچه برای اقویا ذکر شد، بهره دارد. زیرا نفس در اصل سرشت و خلقتش بر حب ریاست بر هم‌نوعان خود سرشته شده است. و کسی که به او گفته شود از سرشت و طبع خود خارج شو، به امر عظیمی مکلف شده است. پس منزه است آنکه به ایشان چنان قوتی روزی داد که چنین امری بر آنان آسان شد. و سبب آن این است که خداوند از معرفت (المعرفة) به خود که برای آن آفریده شده‌اند، به ایشان عطا کرده است، به طوری که وفای به حق عبودیت، آنان را از امثال این [ظهورات] مشغول داشته است. پس ایشان بر طریقه مثلی هستند که خداوند برای بندگانش برگزیده است، و به واسطه ثبات بر آن، جایگاه قرب (الزلفى) دارند و نزد خداوند گرامی داشته شده‌اند.\n\nو این عارف که در این مرتبه است، از افراد (الأفراد) است که حق (الحق) آنان را برای خود یگانه ساخته و مخصوص گردانیده است و حجاب عادت را میان ایشان و خلق رها کرده است. پس آنان را برای خود خالص گردانیده و از ایشان راضی شده و ایشان نیز از او راضی گشته‌اند. و به صاحب این مقام از قوای مؤثر در عالم اعلی و اسفل، هزار و دویست قوه عطا شده است که اگر یک قوه از آن‌ها را بر کائنات مسلط کند، آن را نابود می‌سازد. با وجود این تمکن از این قوا، اگر مگسی بر او بنشیند، به دلیل حیا از خداوند و معرفت (المعرفة)، قادر به دور کردن آن نیست.\n\nاما معرفتی که در این باره دارد، این است که آن مگس فرستاده‌ای از حق (الحق) به سوی اوست و اوست که آن را بر او نازل کرده است. پس او مراقب علمی است که مگس با خود آورده است. هنگامی که از رسالت خود فارغ شود، اگر خالقش او را فراخواند، برخیزد و اگر بخواهد، بماند. پس این عارف کرسی آن رسول مگسی است. این سبب رها کردن اوست و او را از خود نمی‌راند، چنانکه عامه به دلیل معرفت (المعرفة) چنین می‌کنند. و اما حیا از خداوند، این است که در دور کردن مگس، آسایش و نعمتی زودرس برای نفس وجود دارد. و خداوند انسان را در این دنیا برای آسایش و نعمت نیافریده، بلکه برای عبادت پروردگارش آفریده است. پس حیا می‌کند که خداوند او را در طلب آسایش از آزار مگس ببیند، در حالی که این موطن (دنیا) اقتضای آن را ندارد.\n\nاگر بگویی: «پس کسی که در دنیا متنعم است و تنعم در حلال برایش مباح است [چه؟]»، می‌گوییم: ما این را در حق غیر عارف منع نمی‌کنیم، اما عارف تحت سلطه تکلیف است. هیچ نعمتی نیست که خداوند به او عطا کند، چه باطنی و چه ظاهری، مگر آنکه تکلیف الهی به شکرگزاری بر آن، همراهش باشد. آن تکلیف، تنعم عارف را به آن نعمت مکدر می‌سازد، به دلیل اشتغال او به موازنه شکر بر آن. و چون شکر آن را به جا آورد، وفای به شکر خود نعمتی از جانب خداوند بر اوست که باید بر آن شکر کند. پس پیوسته خاطرش در برپایی وزن به عدل، خسته است تا مبادا میزان را زیانکار کند. و کسی که حالش چنین است، چگونه متنعم می‌شود؟ ظاهر آن نعمت است و باطنش اندوه. و او پیوسته در نعمت‌های خداوند، ظاهراً و باطناً، غوطه‌ور است، اما نزد او جز درد و مکدر شدن اثری ندارد. در حالی که عامه از آن نعمت‌ها شاد می‌شوند و با سرمستی و غرور در آن تصرف می‌کنند، باب آسایش در قلب عارف در دنیا بسته است. و اگرچه در ظاهر آسوده باشد، در هر نفس هزار بار می‌میرد و کسی متوجه آن نمی‌شود.\n\nعمر بن خطاب می‌گوید: «خداوند مرا به هیچ مصیبتی مبتلا نکرد، مگر آنکه در آن سه نعمت از جانب خدا بر خود دیدم: اول اینکه در دینم نبود، دوم اینکه بزرگ‌تر از آن نبود، و سوم اینکه وعده ثوابی که خداوند بر آن داده است.» و کسی که در یک مصیبت، سه نعمت می‌بیند، به مصیبتی بزرگ‌تر از آن مصیبت منتقل شده است؛ زیرا بر او واجب می‌شود که میزان شکر را بر سه نعمت برپا دارد. خداوند او را به یک مصیبت مبتلا کرد تا بر آن صبر کند، اما معرفت (المعرفة) او در آن مصیبت، او را به سه مصیبت مبتلا ساخت که خداوند او را مکلف به شکر بر آن‌ها کرد، چرا که او را از وجود آن نعمت‌ها در آن مصیبت واحد آگاه ساخت. پس به معرفت (المعرفة) عمر (رضی الله عنه) بنگر که چگونه چنین چیزی را بر خود واجب ساخت، و به ادبی که در آن است بنگر؛ زیرا از نگریستن به مصیبت بودن آن روی گرداند و به دیدن نعمت‌ها پرداخت، پس آن را با قبول دریافت کرد؛ زیرا نعمت ذاتاً محبوب است. پس راضی شد و مقام رضا، تسلیم، تفویض، صبر و اعتماد بر خدا برای او حاصل شد.\n\nو مردم کجا و این ذوق شریف کجا؟ و هیچ یک از اولیا (الأولياء) در این مقام مانند ابوبکر صدیق (الصديق) حکم نکرد و در آن نایستاد، مگر کسی که من او را نمی‌شناسم. زیرا ابوبکر (رضی الله عنه) به دلیل قوتش، هیچ‌گاه چیزی از معرفت (المعرفة) باطنی‌اش بر او ظاهر نشد، مگر روزی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) درگذشت و جماعت مبهوت شدند و سخنانی گفتند که جز صدیق (الصديق) از آنان حکایت نشد. زیرا خداوند متعال او را موفق ساخت تا قوتی را که به او داده بود، آشکار سازد؛ به این دلیل که خداوند او را شایسته امامت و تقدم قرار داده بود، نه جماعت را. و امام باید هوشیار باشد، نه مست. پس آن قوت برای او برخاست تا دلالت کند بر اینکه خداوند او را پیشوای جماعت در خلافت از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در امتش قرار داده است، مانند معجزه برای پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در دلالت بر نبوتش.\n\nپس او پیشی نگرفت و امر الهی جز با میل گروهی و کراهت گروهی دیگر حاصل نشد. و کراهت کسی که کراهت ورزید، نقصانی در امامت او نیست؛ زیرا آن مقام الهی است. و خداوند می‌فرماید: «و هر که در آسمان‌ها و زمین است، خواه ناخواه، برای خدا سجده می‌کند» (وَلِلَّهِ يَسْجُدُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا). پس اگر خالقی که ملکوت هر چیز به دست اوست (بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ)، برای او به کراهت سجده می‌شود، حال خلیفه و نایب او در خلقش که همان رسولان هستند، چگونه است؟ و حال ابوبکر و دیگران چگونه است؟ پس ناگزیر باید مطیع و کراهت‌ورزی باشد که به اکراه وارد امر شود؛ یا به دلیل شبهه‌ای که نزد او برپا شده است، اگر دیندار باشد، یا به دلیل هوای نفس، اگر دین نداشته باشد.\n\nاما کسانی از صحابه (رضی الله عنهم) که امامت او را ناخوش داشتند، از روی هوای نفس نبود – ما آنان را از این امر مبرا می‌دانیم، بر اساس حسن ظن به جماعت – بلکه به دلیل شبهه‌ای بود که نزدشان برپا شد. کسی که چنین می‌دید، در رأی خود می‌پنداشت که خود شایسته‌تر از اوست، و این چیزی بود که شبهه‌اش به او می‌داد، نه آنچه در علم خداوند بود. زیرا علم خداوند پیشی گرفته بود که او را خلیفه در زمین قرار دهد، و همچنین عمر و عثمان و علی و حسن را. و اگر غیر ابوبکر پیشی می‌گرفت، ابوبکر در خلافت کسی که پیشی گرفته بود، می‌مرد. و در علم خداوند حتمی بود که او خلیفه باشد. پس تقدم او بر آنان به زمان بود، به این دلیل که او اولین کسی بود که به آخرت پیوست. پس سبب این ترتیب در خلافت، ترتیب عمرهای ایشان بود. و ناگزیر کسی که دیرتر از دنیا مفارقت می‌کند، از آن [خلافت] تأخیر می‌یابد تا همه آن منصب را عهده‌دار شوند. و برتری برخی از ایشان بر برخی دیگر، به خداوند واگذار شده است؛ اوست که به منزلت‌های آنان نزد خود آگاه است. زیرا مخلوق آنچه در ذات خالق است نمی‌داند، مگر آنچه خالق سبحانه او را به آن آگاه سازد. و من به چیزی از آن آگاه نیستم. پس [خالق] آنچه در ذات اوست نمی‌داند، مگر زمانی که امری را ایجاد کند که ما بدانیم اگر در علم خداوند پیشی نگرفته بود، وجود نمی‌یافت. پس خداوند ما را از فضول (سخنان بیهوده) حفظ کند، که او صاحب فضل عظیم است (ذُو الْفَضْلِ الْعَظِيمِ).\n\nپس منزلت عارف را از این منزل، به نهایت اختصار و از طریق هشدار و اشاره برای تو بیان کردم؛ زیرا این مقام عظیم است و دارای جزئیات شگفت‌انگیزی است. اکنون فهرست علومی را که این منزل در بر می‌گیرد، ذکر می‌کنیم:\n\nاز جمله آن علوم، علم زوال نور اعظم و بقای حکم آن است، و این از شگفت‌انگیزترین امور است: وجود حکم با عدم عین حاکم. و به این مسئله، فقدان پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) و بقای شریعت او در میان مکلفین مربوط می‌شود، مگر در مذهب کسی که می‌گوید شارع (قانون‌گذار) همان خداوند است و او موجود است. و در آن، علم محو شدن علوم و سبب آن است. و از جمله آن، سبب عزل اهل مراتب از مراتبشان با وجود شایستگی در آنان است، و اینکه چرا عزل شدند در حالی که استحقاق آن را داشتند؟ و آیا این عزل با وجود شایستگی صحیح است یا خیر؟ و آیا سلطان حق عزل قاضی عادلی را که خود او را گمارده است، دارد یا خیر؟ و آیا اگر سلطان بر او ستم کند و او را از حکم کردن باز دارد، در نفس امر منعزل می‌شود یا خیر؟ و اگر با این حال حکم کند، آیا حکم او شرعاً نافذ است یا نافذ نیست؟ و پس از آنکه او با این حال برای شخصی به امری حکم کند و سلطان از اجرای آن سر باز زند، و خصم محکوم‌علیه درخواست رجوع به قاضی‌ای کند که سلطان او را گمارده است، و نزد قاضی دوم آشکار شود که حکم به نفع کسی است که در نزد قاضی اول محکوم شده بود؛ آیا این محکوم‌له نزد قاضی دوم حق دارد آنچه را که به نفع او حکم شده است و خصمش با حکم حاکم اول از او گرفته بود، پس بگیرد یا خیر؟ و آیا قضاوت این قاضی دوم صحیح است یا خیر؟ و اگر صحیح باشد، آیا او در آن مستقل است مانند قاضی اول، یا مانند نایب قاضی اول است، جز اینکه به امر سلطانی است؟ یا اینکه حاکم اول با عزل سلطان منعزل می‌شود؟ پاسخ این مسائل از این منزل شناخته می‌شود. و هر کس بخواهد تحقیق این مسئله و دلیل آن را بداند، باید به نسخ (النسخ) وارد شده در یک شریعت بنگرد، که در این صورت عزل صحیح است. و کسی که به حکم شارعان بنگرد و اینکه خداوند هیچ نبی رسولی را از رسالتش در آن امتی که برای اوست، جز پس از مرگش، عزل نکرده است، می‌گوید: منعزل نمی‌شود. پس این امر بر حسب چیزی است که برای او کشف (الکشف) می‌شود. پس بفهم.\n\nو از علوم این منزل، علم جور (ستم) در عالم است که از کدام حضرت (حضرة) صادر شده است، در حالی که جز عدل محض در آنجا نیست؟ پس این جور از کجا آمده و به کدام حقیقت (حقیقة) مرتبط است و کدام اسم بر آن دلالت می‌کند؟ و [علم] رفتن مردانی که خداوند عالم را به واسطه آنان حفظ می‌کند. و علم نزول کلمات و همت‌ها بر مرکب‌های اعمال، که چرا چنین بوده است؟ و علم بعث اخروی، که آیا در هر حیوانی عام است یا خاص به انس و جن؟ و معنای این سخن خداوند چیست: «به زودی برای شما فارغ خواهیم شد، ای دو گروه سنگین (انس و جن)» (سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ). و علم استحالات عنصری. و علم آنچه از تألیف روح و جسم طبیعی متولد می‌شود. و آیا جسم برای روح مانند زن برای شوهر در نکاح است، به دلیل آنچه میان آن دو متولد می‌شود، یا خیر؟ و آیا مرگ طلاق رجعی است یا بائن؟ زیرا علما گفته‌اند که اگر زن بمیرد، نسبت به شوهرش مانند بیگانه است و ناگزیر شوهر حق ندارد او را ببیند. و گروهی دیگر بر این رفته‌اند که حرمت زوجیت باقی است، پس شوهر می‌تواند او را غسل دهد و حال او با زن مانند حالش در زمان حیات اوست. پس اگر رجعی باشد، ارواح در بعث (رستاخیز) از حیث جواهرشان به عین همین اجسام باز می‌گردند. و اگر رجعی نباشد و بائن باشد، ممکن است به آن بازگردند و تألیف (ترکیب) متفاوت باشد، و ممکن است اجسام دیگری برای اهل نعمت، صاف‌تر و بهتر، و برای اهل عذاب، برعکس آن، ایجاد شود.\n\nو علم سخن گفتن کودکان، که از کجا سخن می‌گویند و چه کسی آنان را به سخن می‌آورد، مانند سخن گفتن عیسی در گهواره، و کودک یوسف (علیه السلام) و جریج. و اما من، در زمان خودمان شخصی جوان را دیدم که نامش، و خدا داناتر است، عبدالقادر بود، در مدرسه ابن رواحه در شهر دمشق. او آمد و سلام کرد. گروهی از جمله زکی بن رواحه، صاحب مدرسه، درباره او به من خبر دادند و گفتند: هنگامی که مادر این جوان به او حامله بود، عطسه کرد و خدا را حمد گفت. پس [جنین] از درون شکم به او گفت: «خدا تو را رحمت کند» (يرحمك الله)، با صدایی که هر کس در آنجا حاضر بود، شنید. و اما پدرم، دختری شیرخوار داشت که سنش کمتر از دو سال و بیشتر از یک سال بود و سخن نمی‌گفت. روزی شروع به بازی با او کردم و گفتم: «ای زینب!» او به من گوش داد. به او گفتم: «می‌خواهم از تو درباره مسئله‌ای استفتا کنم. نظر تو درباره مردی که با همسرش نزدیکی کند و انزال نشود، چیست؟ چه چیزی بر او واجب است؟» او با کلامی فصیح به من گفت: «غسل بر او واجب است.» مادر و مادربزرگش می‌شنیدند. مادربزرگش فریاد زد و بیهوش شد.\n\nو علم باز شدن پس از درهم پیچیده شدن، چنانکه خداوند متعال می‌فرماید: «و آسمان‌ها به دست راست او درهم پیچیده شده‌اند» (وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ). و علم محو و اثبات. و علم تضاعف انوار. و علم قرب‌های الهی که تجلی (التجلی) را عطا می‌کنند. و علم غیبت و حضور. و علم نجوم. و علم زمان. و علم تنزیل شرایع و صفت کسی که آن را نازل می‌کند و کسی که بر او نازل می‌شود، و اینکه آیا این از باب اختصاص (الاختصاص) است یا خیر. و علم تأیید و سلطنت و نیابت از حق (الحق) در عالم، حتی انسان در نفس خود. و علم کشف (الکشف) و اینکه حجابی که میان مردم و آنچه این مکاشف کشف می‌کند چیست؟ و آیا کشف شرط در طریق (سلوک) است یا خیر. و علم رؤیت ارواح علوی و نشانه صدق در کسی که ادعای رؤیت ارواح می‌کند، که صادق از کاذب در آن کیست. و ما در مورد ایشان نشانه‌هایی داریم که به واسطه آن، کسی که راست می‌گوید از کسی که دروغ می‌گوید، شناخته می‌شود. و نشانه‌های دیگری نیز برای ما در مورد صادقین وجود دارد، هنگامی که از آنچه دیده‌اند خبر می‌دهند: آیا از خود ارواح خبر می‌دهند یا از خیالاتی که برایشان برپا شده است؟ پس خیال می‌کند که فرشته یا جن دیده است، در حالی که او نمونه‌هایی را در خیال خود دیده که به دلیل قوت سلطه خیال بر او، خارج از وهمش برپا شده است. پس ما در مورد چنین کسانی نشانه‌هایی داریم. او در آنچه می‌بیند راست می‌گوید، اما در حکم کردن به اینکه فرشته یا جن دیده است، خطا می‌کند، در حالی که آن مرئی نه فرشته است و نه جن. این از خصایص علم این منزل است.\n\nو علم وعید (تهدید الهی) و اینکه چرا بازگردانده می‌شود. و کسی که با قرآن معارضه کرد، از کجا بر او آمد؟ مانند حلاج، هنگامی که عمرو بن عثمان مکی بر او وارد شد و گفت: «ای حلاج، چه می‌کنی؟» گفت: «اینک با قرآن معارضه می‌کنم.» پس [عمرو] بر او نفرین کرد. و مشایخ می‌گفتند: «حلاج جز به نفرین این شیخ دچار مصیبت نشد.» و مانند مهذب ثابت بن عنتر حلوی که او را در موصل در سال ششصد و یکم ملاقات کردم. او با قرآن معارضه کرد و شنیدم که سوره‌هایی از آن را تلاوت می‌کرد. در مزاجش اختلالی بود، اما از زاهدترین مردم و شریف‌ترین آنان از نظر نفس بود و در همان سال درگذشت. و در این منزل، علم مشیئت (اراده) حادث است: آیا در افعال اثر دارد، چنانکه اشاعره در مسئله کسب (الکسب) می‌گویند، یا اثری ندارد؟ و آیا آن مظهر (تجلی) از مظاهر حق (الحق) است، یا در زمانی از مظاهر حق است که همان مشیئتی است که حکمش نافذ می‌شود، و در زمان‌هایی مظهر حق نیست و ناقص می‌ماند؟ و خداوند حق (الحق) را می‌گوید و او راه را می‌نمایاند (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 5
}