{
  "id": 210,
  "title": {
    "ar": "الباب العاشر ومائتان في المكاشفة",
    "en": "Chapter Two Hundred and Ten, Concerning the Unveiling (المكاشفة)",
    "ur": "باب نمبر دو سو دس کشف (الکشف) کے بیان میں",
    "fa": "باب دویست و دهم در مکاشفه"
  },
  "content": {
    "ar": "## «الباب العاشر ومائتان في المكاشفة»\n\n\n> إذا الحق أعطاك أسماءه *** فخذها أمانة من قد فهم‏\n\n\n> بأن الأمانة محمولة *** وحاملها جاهل قد ظلم‏\n\n\n> فإن أنت أفهمت مقصوده *** فأنت المكاشف فلتلتزم‏\n\n\n> بأحكامها فمتى ما دعي *** بها فأجب أمره واحتشم‏\n\n\n> من أجل التصرف فيها ولم *** يكن ينبغي لك أن تحتكم‏\n\n\n> فإنك عبد وأسماؤه *** ربوبية عرضت فاحترم‏\n\n\n> مقام الأمانة أوردها *** إلى ربها أولا واعتصم‏\n\n\n> بما زادك الحال في أمرها *** وحقق إشارتها واغتنم‏\n\n\n> فهذي مكاشفة ترتضي *** وصاحبها سيد قد عصم‏\n\n\n### [المكاشفة تطلق بإزاء الأمانة بالفهم وتطلق بإزاء تحقيق زيادة الحال وتطلق بإزاء تحقيق الإشارة]\n\n\nاعلم أن المكاشفة عند القوم تطلق بإزاء الأمانة بالفهم وتطلق بإزاء تحقيق زيادة الحال وتطلق بإزاء تحقيق الإشارة اعلم أن المكاشفة متعلقها المعاني والمشاهدة متعلقها الذوات فالمشاهدة للمسمى والمكاشفة لحكم الأسماء والمكاشفة عندنا أتم من المشاهدة إلا لو صحت مشاهدة ذات الحق لكانت المشاهدة أتم وهي لا تصح فلذلك قلنا المكاشفة أتم لأنها ألطف فالمكاشفة تلطف الكثيف والمشاهدة تكثف اللطيف وبقولنا هذا تقول طائفة كبيرة من أهل الله مثل أبي حامد وابن فورك والمنذري وقالت طائفة بالنقيض وإنما قلنا إنها أتم لأنه ما من أمر تشهده إلا وله حكم زائد على ما وقع عليه الشهود لا يدرك إلا بالكشف فإن أقيم لك ذلك الأمر في الشهود من حيث ذاته صحب ذلك المشهود حكم ولا بد لا يدرك إلا بالكشف هكذا أبدا فالمكاشفة إدراك معنوي فهي مختصة بالمعاني ومثال ذلك إذا شاهدت متحركا يطلب بالكشف محركه لأنه يعلم أن له محركا كشفا ولهذا يتعلق العلم بمعلومين ويتعلق البصر الذي هو للمشاهدة بمعلوم واحد فيدرك بالكشف ما لا يدرك بالشهود ويفصل الكشف ما هو مجمل في الشهود\n\n\n### [المكاشفة على ثلاثة معان‏]\n\n\nفالمكاشفة كما قلنا على ثلاثة معان‏\nمكاشفة بالعلم ومكاشفة بالحال ومكاشفة بالوجد\n\n\nفأما مكاشفة العلم‏\n\n\nفهي تحقيق الأمانة بالفهم وهو أن تعرف من المشهود لما تجلى لك ما أراد بذلك التجلي لك لأنه ما تجلى لك إلا ليفهمك ما ليس عندك فالمشاهدة طريق إلى العلم والكشف غاية ذلك الطريق وهو حصول العلم في النفس وكذلك إذا خاطبك فقد أسمعك خطابه وهو شهود سمعي فإن المشاهدة آنذا للقوى الحسية لا غير والكشف للقوى المعنوية فما أسمعك إلا لتفهم عنه وإذا أفهمك بأي نوع تجلى لك من إدراك صور الحواس فإنما ذلك الفهم أمانة منه عندك لتلك الأمانة أهل لا ينبغي لك أن تودعها إلا لأهلها وإن لم تفعل فأنت خائن وقال عليه السلام المجالس بالأمانة\n\n\nأي لا تحدث بما وقع في المجالس إلا لمن أعطاك الله الفهم منها من ينبغي أن تتحدث معه بما وقع فيها فذلك أهلها وإذا حدثك إنسان ورأيته يلتفت فاعلم إن ذلك الحديث أمانة أودعها إياك فحظ المشاهدة ما أبصرت وما سمعت وما طعمت وما شممت وما لمست وحظ الكشف ما فهمت من ذلك كله وما فهمت فهو أمانة وإذا كان أمانة حكم عليك الأمر الإلهي بأدائها إلى أهلها أو ردها وردها أن تتناساها إذ ما قد علمت لا تقدر على جهله فتجعل نفسك كأنك ما أبصرت وما سمعت وهذا باب صعب جدا على العارفين يحتاج إلى أدب وحفظ ومراعاة حد فإنه ليس بينه وبين الكذب إلا حجاب واحد وكذلك الخيانة ليس بينه وبينها إلا حجاب واحد ومراعاة الحد تحول بينك وبين الخيانة والكذب فأما علم هذا فهو إذا سألك من يكرم عليك عما تحملته أمانة من شهود بصرك أو سمعك أو ما كان من قوى حواسك والسائل ليس من أهله ومعنى ليس من أهله أن الذي أعطاك هذه الأمانة علمت منه لمن أراد أن توصلها إليه فإن أجبت السائل لكرامته عليك فقد خنت وإن لم تجب وعدلت في الجواب إلى أمر آخر يقنع به السائل ولو عرف ما سترت عنه عز عليه ذلك فقد كذبت كمسألة الخليل في الكذبات الثلاث أثرت عنده في القيامة فاستحيا من الله أن يكلمه في فتح باب الشفاعة مع القصد الجميل في ذلك والصدق في دلالة اللفظ ولكن لم يكن ذلك مقصود المخاطب فسمي كذبا فانظر ما أخطر هذا الموضع وإن قلت ما عندي خبر كذبت أشد من التعريض والحق أَحَقُّ أَنْ يُتَّبَعَ وجواب الصادقين عن ذلك الذين آثروا الحق على غيره أن يقولوا للسائل إن الذي سألت عنه لنا وجوه في الجواب عنه فلا أدري عن أي وجه سألت لتعلمه فإن قال لك فصل الوجوه قل له أنت ابن لي عن مقصودك فإذا قال لك مقصوده من الجواب فإن كان مما يدخل في الأمانة فقل له إنه أمانة أخذ علينا العهد في حفظها وحق الله أحق أن يراعى ولا تستحي في ذلك منه وإن كرم عليك أو كان ذا سلطان ولا يكون السموأل اليهودي المحجوب أوفى منك وأنت العارف المشاهد حتى ضرب به المثل في الوفاء وإن ذكر هذا السائل وجه مطلوبه من حيث لا تعلق له بالأمانة فأجبه ولا بد لينتفع ولا تعطه ما ليس في وسعه حمله فيعود وباله عليك فهذا معنى قولهم تحقيق الأمانة بالفهم‏\n\n\nوأما المكاشفة بالحال‏\n\n\nوهي تحقيق زيادة الحال فاعلم إن كل متصف بصفة في كل وقت فإن تلك الصفة هي حاله في ذلك الوقت أي صفة كانت ولهذا لا يأتي الحال إلا بعد تمام الكلام أي لو لم تذكر لأفاد الكلام دونها فإن كانت هي المقصودة بالإخبار عنها فما أفاد الكلام بالنظر إلى قصد المخبر تقول رأيت زيدا فاستقل الكلام وتم ثم بعد ذلك زدت راكبا فتقول رأيت زيدا راكبا أي في حال ركوبه فإن كان مقصودك التعريف برؤيتك إياه راكبا فما تم الكلام بهذا الاعتبار أي ما حصلت الفائدة التي اعتبرتها وقصدتها ولكن حصلت فائدة بالجملة وهي رؤية زيد أنك رأيته ولم تذكر على أي حالة فهذا معنى تحقيق زيادة الحال أن يتحقق إن الحال زائدة على ما تقع به الفائدة مطلقا من غير نظر إلى قصد وهذا راجع إلى الأول الذي هو تحقيق الأمانة بالفهم فلو لقيك أحد سألك هل رأيت زيدا فقلت له رأيته ثم زدت حالا لم يسألك عنها فقلت له مسافرا وكان في نفسه عند سؤاله هل رأيت زيدا حتى يعلم أنه في البلد فيجتمع به فلما قلت له مسافرا أعلمته بهذه الزيادة التي هي زيادة الحال بسفره فارحته من طلب الاجتماع به إذ لا يتمكن له ذلك مع كونه ليس في البلد فهذا وأمثاله من زيادة الحال وأما في طريق أهل الله فزيادة الحال هي أن تشهد ذاتا ما على حال ما فتطلع من ذلك الحال إلى ما يؤول إليه أمره لأجل ذلك الحال فسمى مثل هذا زيادة الحال ومكاشفة بالحال مثال ذلك أن تشاهد ذاتا ما على حال خاص من حركة أو سكون أو صفة ملائمة طبع الناظر أو غير ملائمة فتعرف من ذلك الحال أمرا\nزائدا وهو أن ذلك الحال يؤدي في حق المدرك له ودا أو بغضا أو كراهة أو ما كان فهذه زيادة الحال التي أعطاك وبهذا يقع العلم بالمنزلة عند الله قال بعضهم إني لأعرف متى يحبني ربي فقيل له ومن أين لك معرفة ذلك فقال هو عرفني به فقيل له أوحي بعد رسول الله صلى الله عليه وسلم قال قوله فَاتَّبِعُونِي يُحْبِبْكُمُ الله وأنا في هذه الساعة في حال اتباع لما شرع وهو صادق القول فأعطاني الحال إن الله محب لي في هذه الساعة لكونى مجلى لما أحب وهو تعالى ناظر إلى محبوبه ومحبوبه ما أنا عليه فأضاف تعلق المحبة التي تصيرني محبوبا بالاتباع‏\n\n\nوأما المكاشفة بالوجد\n\n\nوهي تحقيق الإشارة أعني إشارة المجلس لا الإشارة التي هي نداء على رأس البعد لأنه لا يبلغ مداها الصوت وذلك أن مجالس الحق على نوعين النوع الواحد لا يتمكن فيه إلا الخلوة به تعالى فهذا لا تقع فيه الإشارة وذلك إذا جالسته من حيث هو له على علمه به والنوع الثاني ما تمكن فيه المشاركة في المجلس وهو إذا تجلى للعبد في صورة أمكن أن تحضر في تلك المجالسة جماعة قلوا أو كثروا ولو كان واحدا زائدا على هذا الجليس ففي مثل هذا المجلس تكون الإشارة فإن الجليس الآخر فما زاد لا يمكن أن يجتمعا على قدم واحدة حتى لو اطلع كل واحد من الجلساء على حال الآخر مع الله ما احتمله وكفر به وأنكره وقال هذا إبليس فلا بد إذا وقع الإفهام من الله لكل جليس له في هذه الحضرة والمجلس الصوري أن يكون بالإشارة لا بالتصريح فيفهم كل إنسان من تلك الإشارة ما في وسعه فالكلمة عنده تعالى واحدة وبالنظر إلى الجلساء كلمات كثيرة فينصرف كل جليس راضيا يزعم أنه أخص من الباقين ولله رجال أعطاهم من الفهم والاتساع وحفظ الأمانة أن يفهموا عن الله في مثل هذه المجالس جميع إشارات كل مشار إليه وهم الذين يعرفونه في تجلى الإنكار والشاهدون إياه في كل اعتقاد والحمد لله الذي جعلنا منهم إنه ولي ذلك وهذا القدر كاف انتهى السفر السابع عشر بانتهاء الباب العاشر ومائتين‏\n\n\n( «بسم الله الرحمن الرحيم»)\n\n",
    "en": "## Chapter Two Hundred and Ten: Concerning Unveiling (المكاشفة)\n\n> If The Real grants you His Names, then take them as a Trust (أمانة) from one who understands,\n> That the Trust is carried, and its carrier is ignorant and has wronged himself.\n> If you are made to understand His purpose, then you are the one who has attained Unveiling (المكاشف), so you must adhere,\n> To their rules (أحكامها). Whenever He is invoked by them, respond to His command and be cautious,\n> Regarding the disposal of them, for it is not fitting for you to judge,\n> For you are a servant (عبد), and His Names are Lordship (ربوبية) presented, so respect,\n> The station of the Trust. Bring it back to its Lord first, and hold fast,\n> To what the State (الحال) has added to you concerning it, and realize its Indication (إشارتها) and seize the opportunity.\n> This is the Unveiling (مكاشفة) that is pleasing, and its possessor is a master who is protected.\n\n### [Unveiling (المكاشفة) is applied to the Trust (الأمانة) through understanding, and it is applied to the realization of the increase of the State (الحال), and it is applied to the realization of the Indication (الإشارة)]\n\nKnow that Unveiling (المكاشفة) among the People [of God] is applied to the Trust through understanding, and it is applied to the realization of the increase of the State, and it is applied to the realization of the Indication. Know that the object of Unveiling is meanings (المعاني), while the object of Witnessing (المشاهدة) is Essences (الذوات). Thus, Witnessing is for the Named (المسمى), and Unveiling is for the effect of the Names (حكم الأسماء). Unveiling, in our view, is more complete than Witnessing, unless the Witnessing of the Essence of The Real (ذات الحق) were valid, in which case Witnessing would be more complete. But since that is not valid, we say that Unveiling is more complete because it is subtler. Unveiling refines the dense (الكثيف), and Witnessing densifies the subtle (اللطيف). A large group of the People of God (أهل الله), such as Abu Hamid [al-Ghazali], Ibn Furak, and al-Mundhiri, agree with this statement of ours. Another group holds the opposite view. We maintain that Unveiling is more complete because there is no thing you witness except that it has an effect (حكم) exceeding what the Witnessing perceived, which is only grasped through Unveiling. If that thing is established for you in Witnessing from the perspective of its Essence, that witnessed thing must necessarily be accompanied by an effect that is only grasped through Unveiling—this is always the case. Therefore, Unveiling is a conceptual perception (إدراك معنوي); it is specific to meanings. An example of this is when you witness a moving object: its mover is sought through Unveiling, because it is known through Unveiling that it has a mover. For this reason, Knowledge (العلم) relates to two known things, while sight (البصر), which is for Witnessing, relates to only one known thing. Thus, Unveiling grasps what Witnessing does not grasp, and Unveiling details what is summarized in Witnessing.\n\n### [Unveiling (المكاشفة) has three meanings]\n\nUnveiling, as we have stated, has three meanings: Unveiling through Knowledge (مكاشفة بالعلم), Unveiling through the State (مكاشفة بالحال), and Unveiling through Ecstasy (مكاشفة بالوجد).\n\n#### As for Unveiling through Knowledge\n\nThis is the realization of the Trust through understanding. It means that you recognize, from the witnessed object when The Real discloses Himself to you (تجلى لك), what He intended by that Self-disclosure to you, for He only disclosed Himself to you to make you understand what you did not possess. Witnessing is thus a path to Knowledge, and Unveiling is the goal of that path, which is the attainment of Knowledge in the soul. Similarly, when He addresses you, He has made you hear His address, which is auditory Witnessing, for Witnessing at that moment belongs only to the sensory faculties, while Unveiling belongs to the conceptual faculties. He only made you hear so that you might understand from Him. When He makes you understand, regardless of the type of sensory form He discloses Himself through, that understanding is a Trust from Him deposited with you. This Trust has people worthy of it, and you should not entrust it except to those who are worthy. If you fail to do so, you are a betrayer. The Prophet (peace be upon him) said: \"Gatherings are by Trust (المجالس بالأمانة).\" That is, do not speak of what occurred in the gatherings except to those whom God has given you the understanding to know that you should speak with them about what occurred therein—those are the worthy people. If a person speaks to you and you see him looking around, know that this conversation is a Trust he has deposited with you. The share of Witnessing is what you saw, heard, tasted, smelled, or touched. The share of Unveiling is what you understood from all of that. What you understood is a Trust. Since it is a Trust, the Divine Command obligates you to deliver it to its worthy recipients or to return it. Returning it means forgetting it, since what you have known you cannot unknow; thus, you make yourself as if you had not seen or heard. This is a very difficult matter for the Gnostics (العارفين); it requires discipline, preservation, and observance of the limit (مراعاة الحد). For there is only one veil between it and lying, and likewise, there is only one veil between it and betrayal. Observance of the limit prevents you from betrayal and lying. The test of this occurs when someone dear to you asks you about what you bore as a Trust from the Witnessing of your sight, hearing, or any of your sensory faculties, and the questioner is not worthy of it. The meaning of \"not worthy of it\" is that the One who gave you this Trust made known to you to whom He intended you to deliver it. If you answer the questioner because of his dearness to you, you have betrayed the Trust. If you do not answer and shift the reply to another matter that satisfies the questioner—even if he would be distressed if he knew what you concealed—you have lied. This is like the matter of the Friend [Abraham] (الخليل) regarding the three lies, which affected him on the Day of Resurrection, causing him to feel shame before God to speak to Him about opening the door of intercession, despite his beautiful intention and the truthfulness in the literal meaning of the words. However, that was not the intent of the one addressed, so it was called a lie. Look how dangerous this position is! If you say, \"I have no knowledge,\" you have lied more severely than by equivocation (التعريض). The Real is more deserving of being followed. The answer of the truthful ones who prefer The Real over all else is to say to the questioner: \"The matter you asked about has several facets in its answer, and I do not know which facet you asked about so that you may know it.\" If he tells you to detail the facets, tell him, \"You inform me of your purpose.\" If he states his purpose for the answer, and it falls under the category of the Trust, then tell him, \"It is a Trust, and we have taken a covenant to preserve it, and the right of God is more deserving of being observed.\" Do not feel shy about this, even if he is dear to you or holds authority. You, the Gnostic who witnesses, should not be less faithful than the veiled Jew, Al-Samaw'al, who was cited as an example of faithfulness. If this questioner mentions the facet of his request in a way that has no connection to the Trust, then you must answer him so that he may benefit. But do not give him what he cannot bear, lest its harm return upon you. This is the meaning of their saying: \"The realization of the Trust through understanding.\"\n\n#### As for Unveiling through the State (الحال)\n\nThis is the realization of the increase of the State. Know that everyone characterized by an attribute at any time, that attribute is his State (حال) at that time, whatever the attribute may be. For this reason, the grammatical term *al-ḥāl* (adverbial state) only comes after the completion of the sentence—meaning that if it were not mentioned, the sentence would still convey meaning without it. If the State itself is the intended subject of the statement, then the sentence has not conveyed meaning, considering the intention of the speaker. You say, \"I saw Zayd,\" and the sentence is complete and self-sufficient. Then you add a State, saying, \"riding,\" so you say, \"I saw Zayd riding,\" meaning in the state of his riding. If your intention was to inform that you saw him *while* riding, then the sentence is not complete in this regard—meaning the intended benefit you considered and aimed for was not achieved. However, a general benefit was achieved, which is the sight of Zayd, that you saw him, without mentioning his condition. This is the meaning of the realization of the increase of the State: realizing that the State is an addition to that by which the benefit is achieved absolutely, without regard to intention. This relates back to the first type, which is the realization of the Trust through understanding. For example, if someone met you and asked, \"Did you see Zayd?\" and you replied, \"I saw him,\" and then you added a State he did not ask about, saying, \"traveling.\" He was intending, when he asked, to know if Zayd was in the city so he could meet him. When you told him \"traveling,\" you informed him of this addition, which is the increase of the State through his journey, thus relieving him of the effort of seeking a meeting, since that is impossible while Zayd is not in the city. This and similar examples constitute the increase of the State. As for the path of the People of God, the increase of the State is that you witness a certain Essence (ذات) in a certain State, and from that State, you perceive what its outcome will be because of that State. Such a thing is called the increase of the State and Unveiling through the State. An example of this is witnessing a certain Essence in a specific State, such as movement, stillness, or an attribute that is agreeable or disagreeable to the observer's nature. From that State, you come to know an additional matter: that this State leads, for the one who perceives it, to affection, hatred, aversion, or whatever it may be. This is the increase of the State that was granted to you. Through this, knowledge of one's rank with God is attained. One of them said, \"I know when my Lord loves me.\" He was asked, \"How do you know that?\" He replied, \"He informed me of it.\" He was asked, \"Is there revelation after the Messenger of God (peace be upon him)?\" He said, [No, but] His saying: <<فَاتَّبِعُونِي يُحْبِبْكُمُ الله>> (Follow me, [and] Allah will love you). And I am at this moment in a State of following what has been legislated, and he is truthful in his statement. Thus, the State granted me [the knowledge] that God loves me at this moment, because I am the locus of manifestation (مجلى) for what He loves, and He is looking upon His beloved, and His beloved is the condition I am in. Thus, He linked the attachment of love, which makes me beloved, to the following (الِاتِّبَاع).\n\n#### As for Unveiling through Ecstasy (الوجد)\n\nThis is the realization of the Indication (الإشارة)—I mean the Indication of the gathering (المجلس), not the Indication which is a call over a great distance, the reach of which the voice cannot attain. This is because the gatherings of The Real are of two types. One type is where only seclusion with Him (The Real) is possible. In this type, no Indication occurs. This is when you sit with Him from the perspective of His being for Himself, based on His Knowledge of Himself. The second type is where participation in the gathering is possible. This occurs when He discloses Himself to the servant in a form where a group—few or many—can be present in that gathering, even if it is just one person in addition to the primary companion. In such a gathering, the Indication occurs. This is because the other companion, and those added, cannot possibly stand on the same footing. Even if each of the companions were to perceive the State of the others with God, he would not tolerate it, would disbelieve in it, and would deny it, saying, \"This is Iblis.\" Therefore, when understanding is conveyed by God to every companion in this Presence and formal gathering, it must be through Indication (الإشارة), not explicit statement (التصريح). Thus, every person understands from that Indication what is within his capacity. The Word (الكلمة) is one with Him (The Real), but in relation to the companions, they are many words. So, every companion departs satisfied, claiming that he is more specific [in favor] than the rest. Yet, God has men whom He has granted understanding, breadth, and the preservation of the Trust, such that they understand from God in such gatherings all the Indications directed to every recipient. These are the ones who recognize Him in the Self-disclosure of denial (تجلي الإنكار) and witness Him in every belief. Praise be to God, who made us among them. He is the Guardian of that. This much is sufficient. The seventeenth journey concludes with the end of the two hundred and tenth chapter.\n\n(In the Name of God, the Most Compassionate, the Most Merciful)",
    "ur": "## باب دو سو دسواں: مکاشفہ (الکشف) کے بیان میں\n\n> جب ذات حق (الحق) تمہیں اپنے اسماء عطا کرے،\n> تو اسے امانت کے طور پر لے لو، اس شخص کی طرف سے جو سمجھ رکھتا ہے۔\n\n> کہ امانت اٹھائی گئی ہے،\n> اور اسے اٹھانے والا جاہل ہے جس نے ظلم کیا۔\n\n> پس اگر تم اس کے مقصود کو سمجھ گئے،\n> تو تم ہی مکاشف (الکاشف) ہو، لہٰذا لازم پکڑو۔\n\n> اس کے احکام کو، اور جب بھی اس کے ذریعے پکارا جائے،\n> تو اس کے حکم کو قبول کرو اور احتیاط برتو۔\n\n> اس میں تصرف کرنے سے، اور\n> تمہارے لیے یہ مناسب نہیں کہ تم خود حکم لگاؤ۔\n\n> کیونکہ تم بندے ہو، اور اس کے اسماء\n> ربوبیت (الربوبیۃ) ہیں جو ظاہر ہوئے ہیں، لہٰذا احترام کرو۔\n\n> مقام امانت کو، اسے پہلے اس کے رب کی طرف لوٹاؤ اور مضبوطی سے تھام لو۔\n\n> اس چیز کو جو حال (الحال) نے تمہیں اس کے معاملے میں زیادہ عطا کیا،\n> اور اس کے اشارے (الإشارۃ) کو متحقق کرو اور فائدہ اٹھاؤ۔\n\n> پس یہ وہ مکاشفہ (الکشف) ہے جو پسندیدہ ہے،\n> اور اس کا حامل وہ سردار ہے جسے محفوظ کر لیا گیا۔\n\n### [مکاشفہ (الکشف) کا اطلاق فہم کے ساتھ امانت کے مقابلے میں ہوتا ہے، اور حال (الحال) کی زیادتی کے تحقق کے مقابلے میں ہوتا ہے، اور اشارے (الإشارۃ) کے تحقق کے مقابلے میں ہوتا ہے]\n\nجان لو کہ صوفیاء (القوم) کے نزدیک مکاشفہ (الکشف) کا اطلاق فہم (الفہم) کے ساتھ امانت (الأمانۃ) کے مقابلے میں ہوتا ہے، اور حال (الحال) کی زیادتی کے تحقق کے مقابلے میں ہوتا ہے، اور اشارے (الإشارۃ) کے تحقق کے مقابلے میں ہوتا ہے۔ جان لو کہ مکاشفہ (الکشف) کا تعلق معانی (المعانی) سے ہے اور مشاہدہ (المشاھدۃ) کا تعلق ذوات (الذوات) سے ہے۔ پس مشاہدہ (المشاھدۃ) مسمیٰ کے لیے ہے اور مکاشفہ (الکشف) اسماء کے حکم کے لیے ہے۔ ہمارے نزدیک مکاشفہ (الکشف) مشاہدہ (المشاھدۃ) سے زیادہ کامل (أتم) ہے، سوائے اس کے کہ اگر ذات حق (ذات الحق) کا مشاہدہ صحیح ہو جاتا تو مشاہدہ زیادہ کامل ہوتا، لیکن وہ صحیح نہیں ہے۔ اسی لیے ہم نے کہا کہ مکاشفہ زیادہ کامل ہے کیونکہ یہ زیادہ لطیف ہے۔ پس مکاشفہ کثیف کو لطیف بناتا ہے اور مشاہدہ لطیف کو کثیف بناتا ہے۔ ہمارے اس قول کی تائید اہل اللہ (أهل الله) کی ایک بڑی جماعت کرتی ہے، جیسے ابو حامد، ابن فورک اور منذری۔ اور ایک جماعت نے اس کے برعکس کہا ہے۔ ہم نے اسے زیادہ کامل اس لیے کہا کہ کوئی بھی ایسی چیز نہیں جس کا تم مشاہدہ کرو مگر اس کا ایک زائد حکم ہوتا ہے جو شہود (الشہود) پر واقع ہونے والی چیز سے زیادہ ہوتا ہے، اور وہ صرف کشف (الکشف) کے ذریعے ہی ادراک کیا جا سکتا ہے۔ اگر وہ امر تمہارے لیے شہود میں اس کی ذات کے اعتبار سے قائم کیا جائے، تو اس مشہود کے ساتھ لازمی طور پر ایک حکم ہوتا ہے جو صرف کشف کے ذریعے ہی ادراک کیا جا سکتا ہے۔ یہ ہمیشہ اسی طرح ہوتا ہے۔ پس مکاشفہ ایک معنوی ادراک ہے، لہٰذا یہ معانی (المعانی) کے ساتھ خاص ہے۔ اس کی مثال یہ ہے کہ جب تم کسی متحرک چیز کا مشاہدہ کرتے ہو، تو کشف کے ذریعے اس کے محرک کو طلب کیا جاتا ہے، کیونکہ کشف کے ذریعے یہ معلوم ہوتا ہے کہ اس کا کوئی محرک ہے۔ اسی وجہ سے علم کا تعلق دو معلوموں سے ہوتا ہے، اور بصر (آنکھ) کا تعلق جو مشاہدہ کے لیے ہے، ایک معلوم سے ہوتا ہے۔ پس کشف کے ذریعے وہ ادراک کیا جاتا ہے جو شہود (الشہود) کے ذریعے ادراک نہیں ہوتا، اور کشف اس چیز کی تفصیل کرتا ہے جو شہود میں مجمل ہوتی ہے۔\n\n### [مکاشفہ (الکشف) تین معانی پر ہے]\n\nپس مکاشفہ (الکشف)، جیسا کہ ہم نے کہا، تین معانی پر ہے:\nعلم کے ذریعے مکاشفہ، حال (الحال) کے ذریعے مکاشفہ، اور وجد (الوجد) کے ذریعے مکاشفہ۔\n\n**جہاں تک علم کے مکاشفہ کا تعلق ہے:**\n\nیہ فہم (الفہم) کے ساتھ امانت (الأمانۃ) کا تحقق ہے۔ اور وہ یہ ہے کہ جب ذات حق (الحق) تمہارے لیے ظہور الٰہی (التجلی) کرے تو تم مشہود سے یہ جان لو کہ اس ظہور الٰہی سے اس کا کیا ارادہ تھا۔ کیونکہ اس نے تمہارے لیے ظہور نہیں کیا مگر اس لیے کہ تمہیں وہ چیز سمجھا دے جو تمہارے پاس نہیں ہے۔ پس مشاہدہ (المشاھدۃ) علم کا راستہ ہے، اور کشف (الکشف) اس راستے کی انتہا ہے، اور وہ نفس میں علم کا حصول ہے۔ اسی طرح جب وہ تم سے مخاطب ہوتا ہے، تو اس نے تمہیں اپنا خطاب سنایا، اور یہ سمعی شہود (الشہود) ہے۔ کیونکہ اس وقت مشاہدہ صرف حسی قوتوں کے لیے ہوتا ہے، اور کشف معنوی قوتوں کے لیے ہوتا ہے۔ پس اس نے تمہیں نہیں سنایا مگر اس لیے کہ تم اس کی بات سمجھو۔ اور جب وہ تمہیں سمجھا دے، خواہ وہ حواس کی صورتوں کے ادراک کے ذریعے کسی بھی نوعیت کا ظہور الٰہی (التجلی) کرے، تو وہ فہم اس کی طرف سے تمہارے پاس ایک امانت ہے۔ اس امانت کے اہل ہیں، اور تمہارے لیے مناسب نہیں کہ تم اسے اس کے اہل کے سوا کسی اور کے پاس رکھو۔ اور اگر تم ایسا نہیں کرتے تو تم خائن ہو۔ اور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: **\"مجالس امانت کے ساتھ ہیں\"**۔\n\nیعنی جو کچھ مجالس میں واقع ہوا، اسے کسی سے بیان نہ کرو مگر اس شخص سے جسے اللہ نے اس کا فہم (الفہم) عطا کیا ہو، اور جس سے تمہیں اس میں واقع ہونے والی چیز کے بارے میں بات کرنی چاہیے۔ پس وہی اس کا اہل ہے۔ اور جب کوئی شخص تم سے بات کرے اور تم اسے مڑ کر دیکھتے ہوئے پاؤ، تو جان لو کہ وہ بات ایک امانت ہے جو اس نے تمہارے پاس رکھی ہے۔ پس مشاہدہ (المشاھدۃ) کا حصہ وہ ہے جو تم نے دیکھا، جو تم نے سنا، جو تم نے چکھا، جو تم نے سونگھا، اور جو تم نے چھوا۔ اور کشف (الکشف) کا حصہ وہ ہے جو تم نے ان سب سے سمجھا۔ اور جو تم نے سمجھا وہ امانت ہے۔ اور جب وہ امانت ہے، تو امر الٰہی (الأمر الإلٰہی) نے تم پر حکم لگایا کہ اسے اس کے اہل تک پہنچاؤ یا اسے واپس کر دو۔ اور اسے واپس کرنے کا مطلب یہ ہے کہ تم اسے بھلا دو، کیونکہ جو تم جان چکے ہو، تم اسے جہالت میں تبدیل نہیں کر سکتے۔ پس تم اپنے آپ کو ایسا بنا لو جیسے تم نے نہ دیکھا اور نہ سنا۔ اور یہ عارفین (العارفین) کے لیے ایک بہت مشکل باب ہے، جسے ادب، حفاظت، اور حد کی رعایت کی ضرورت ہے۔ کیونکہ اس کے اور جھوٹ کے درمیان صرف ایک پردہ ہے، اور اسی طرح خیانت کے درمیان بھی صرف ایک پردہ ہے۔ اور حد کی رعایت تمہیں خیانت اور جھوٹ کے درمیان حائل کر دیتی ہے۔ اس کا علم یہ ہے کہ جب کوئی ایسا شخص جو تمہارے نزدیک مکرم ہو، تم سے اس امانت کے بارے میں سوال کرے جو تم نے اپنے بصر (آنکھ) یا سمع (کان) کے شہود (الشہود) سے یا تمہاری حواس کی قوتوں میں سے کسی بھی چیز سے حاصل کی ہے، اور سوال کرنے والا اس کا اہل نہیں ہے۔ اور \"اہل نہیں\" کا مطلب یہ ہے کہ جس نے تمہیں یہ امانت دی ہے، تم نے اس سے جان لیا ہے کہ وہ کس تک پہنچانا چاہتا ہے۔ پس اگر تم نے سائل کو اس کے اکرام کی وجہ سے جواب دے دیا تو تم نے خیانت کی۔ اور اگر تم نے جواب نہ دیا اور جواب میں کسی دوسرے امر کی طرف عدول کیا جس سے سائل مطمئن ہو جائے، اگرچہ وہ جان لے کہ تم نے اس سے کیا چھپایا ہے تو یہ اس پر گراں گزرے گا، تو تم نے جھوٹ بولا۔ جیسے خلیل (ابراہیم علیہ السلام) کا تین جھوٹوں کا مسئلہ، جس نے قیامت کے دن ان پر اثر کیا، تو وہ اللہ سے شفاعت کا دروازہ کھولنے کے بارے میں بات کرنے سے شرمائے، باوجود اس کے کہ اس میں نیک مقصد تھا اور لفظ کی دلالت میں سچائی تھی، لیکن وہ مخاطب کا مقصود نہیں تھا، لہٰذا اسے جھوٹ کہا گیا۔ پس دیکھو یہ مقام کتنا خطرناک ہے۔ اور اگر تم نے کہا کہ \"میرے پاس کوئی خبر نہیں\"، تو تم نے تعریض سے بھی زیادہ سخت جھوٹ بولا۔ اور **\"حق زیادہ حقدار ہے کہ اس کی پیروی کی جائے\"**۔ اور اس بارے میں سچے لوگوں کا جواب، جنہوں نے حق کو دوسروں پر ترجیح دی، یہ ہے کہ وہ سائل سے کہیں کہ جس چیز کے بارے میں تم نے سوال کیا ہے، ہمارے پاس اس کے جواب کے کئی پہلو ہیں، تو میں نہیں جانتا کہ تم نے کس پہلو کے بارے میں سوال کیا ہے تاکہ تم اسے جان سکو۔ پس اگر وہ تم سے کہے کہ ان پہلوؤں کی تفصیل بیان کرو، تو تم اس سے کہو کہ تم مجھے اپنے مقصود کے بارے میں بتاؤ۔ پس جب وہ تمہیں جواب میں اپنا مقصود بتا دے، تو اگر وہ امانت میں داخل ہونے والی چیزوں میں سے ہو، تو تم اس سے کہو کہ یہ ایک امانت ہے جس کی حفاظت کا ہم سے عہد لیا گیا ہے، اور اللہ کا حق زیادہ حقدار ہے کہ اس کی رعایت کی جائے۔ اور تم اس معاملے میں اس سے شرم محسوس نہ کرو، خواہ وہ تمہارے نزدیک مکرم ہو یا صاحبِ اقتدار۔ اور ایسا نہ ہو کہ محجوب یہودی سموأل تم سے زیادہ وفادار ہو، حالانکہ تم عارف (العارف) اور مشاہد (المشاھد) ہو، یہاں تک کہ وفاداری میں اس کی مثال دی جاتی ہے۔ اور اگر یہ سائل اپنے مطلوب کا وہ پہلو بیان کرے جس کا امانت سے کوئی تعلق نہ ہو، تو تم اسے ضرور جواب دو تاکہ وہ فائدہ اٹھائے، اور اسے وہ چیز نہ دو جسے اٹھانے کی اس میں وسعت نہ ہو، ورنہ اس کا وبال تم پر پڑے گا۔ پس یہ ان کے قول \"فہم (الفہم) کے ساتھ امانت (الأمانۃ) کا تحقق\" کا معنی ہے۔\n\n**اور جہاں تک حال (الحال) کے ذریعے مکاشفہ (الکشف) کا تعلق ہے:**\n\nاور یہ حال (الحال) کی زیادتی کا تحقق ہے۔ جان لو کہ ہر وہ شخص جو کسی بھی وقت کسی صفت سے متصف ہو، تو وہ صفت اس وقت اس کا حال (الحال) ہوتی ہے، خواہ وہ کوئی بھی صفت ہو۔ اسی لیے حال (الحال) ہمیشہ کلام کے مکمل ہونے کے بعد آتا ہے، یعنی اگر اسے ذکر نہ بھی کیا جائے تو کلام اس کے بغیر بھی فائدہ دے گا۔ لیکن اگر حال ہی خبر دینے کا مقصود ہو، تو مخبر کے قصد کے اعتبار سے کلام نے فائدہ نہیں دیا۔ تم کہتے ہو: \"میں نے زید کو دیکھا\"، تو کلام مستقل ہو گیا اور مکمل ہو گیا۔ پھر اس کے بعد تم نے \"سوار\" کا اضافہ کیا، تو تم کہتے ہو: \"میں نے زید کو سوار دیکھا\"، یعنی اس کے سواری کی حالت میں۔ لیکن اگر تمہارا مقصود اسے سوار دیکھنے کی تعریف کرنا تھا، تو اس اعتبار سے کلام مکمل نہیں ہوا، یعنی وہ فائدہ حاصل نہیں ہوا جس کا تم نے اعتبار کیا اور قصد کیا، لیکن مجموعی طور پر ایک فائدہ حاصل ہوا، اور وہ زید کا دیکھنا ہے کہ تم نے اسے دیکھا، اور تم نے یہ ذکر نہیں کیا کہ وہ کس حالت پر تھا۔ پس یہ حال (الحال) کی زیادتی کے تحقق کا معنی ہے کہ یہ متحقق ہو جائے کہ حال اس چیز پر زائد ہے جس سے فائدہ مطلقاً حاصل ہوتا ہے، بغیر کسی قصد کے۔ اور یہ پہلے معنی کی طرف لوٹتا ہے جو فہم (الفہم) کے ساتھ امانت (الأمانۃ) کا تحقق ہے۔ پس اگر کوئی تم سے ملا اور تم سے پوچھا: \"کیا تم نے زید کو دیکھا؟\" تو تم نے اسے کہا: \"میں نے اسے دیکھا\"۔ پھر تم نے ایک ایسے حال کا اضافہ کیا جس کے بارے میں اس نے تم سے نہیں پوچھا تھا، تو تم نے اسے کہا: \"مسافر\"۔ اور اس کے دل میں جب اس نے پوچھا تھا کہ \"کیا تم نے زید کو دیکھا؟\" تو یہ تھا کہ وہ جان لے کہ وہ شہر میں ہے تاکہ وہ اس سے مل سکے۔ پس جب تم نے اسے \"مسافر\" کہا، تو تم نے اسے اس زیادتی سے آگاہ کیا جو اس کے سفر کا حال ہے، اور تم نے اسے ملاقات کی طلب سے راحت دی، کیونکہ شہر میں نہ ہونے کی وجہ سے اس کے لیے یہ ممکن نہیں ہے۔ پس یہ اور اس کی مثالیں حال کی زیادتی میں سے ہیں۔ اور اہل اللہ (أهل الله) کے طریقے میں، حال کی زیادتی یہ ہے کہ تم کسی ذات کا کسی حال پر مشاہدہ (الشہود) کرو، پھر تم اس حال سے اس چیز پر مطلع ہو جاؤ جس کی طرف اس حال کی وجہ سے اس کا معاملہ لوٹتا ہے۔ پس ایسی چیز کو حال کی زیادتی اور حال کے ذریعے مکاشفہ (الکشف) کہا جاتا ہے۔ اس کی مثال یہ ہے کہ تم کسی ذات کا کسی خاص حال پر مشاہدہ کرو، خواہ وہ حرکت ہو یا سکون، یا کوئی ایسی صفت جو دیکھنے والے کی طبیعت کے موافق ہو یا غیر موافق، تو تم اس حال سے ایک زائد امر کو جان لیتے ہو، اور وہ یہ ہے کہ وہ حال اس کے ادراک کرنے والے کے حق میں محبت، یا بغض، یا کراہت، یا جو کچھ بھی ہو، کی طرف لے جاتا ہے۔ پس یہ حال کی وہ زیادتی ہے جو تمہیں عطا کی گئی ہے۔ اور اسی سے اللہ کے ہاں منزلت کا علم حاصل ہوتا ہے۔ بعض نے کہا: \"میں جانتا ہوں کہ میرا رب مجھ سے کب محبت کرتا ہے\"۔ تو ان سے پوچھا گیا: \"تمہیں یہ معرفت کہاں سے حاصل ہوئی؟\" تو انہوں نے کہا: \"اس نے مجھے اس سے آگاہ کیا\"۔ تو ان سے پوچھا گیا: \"کیا رسول اللہ صلی اللہ علیہ وسلم کے بعد کوئی وحی ہے؟\" انہوں نے کہا: اللہ کا قول: **\"پس تم میری پیروی کرو، اللہ تم سے محبت کرے گا\"** (آل عمران: ۳۱)۔ اور میں اس وقت شریعت کی پیروی کی حالت میں ہوں، اور وہ قول میں سچے ہیں۔ پس حال (الحال) نے مجھے یہ عطا کیا کہ اللہ اس وقت مجھ سے محبت کرنے والا ہے، کیونکہ میں اس چیز کا مظہر ہوں جسے وہ پسند کرتا ہے، اور وہ تعالیٰ اپنے محبوب کو دیکھ رہا ہے، اور میرا محبوب وہ ہے جس پر میں قائم ہوں۔ پس اس نے محبت کے تعلق کو جو مجھے محبوب بناتا ہے، اتباع (پیروی) کے ساتھ جوڑ دیا۔\n\n**اور جہاں تک وجد (الوجد) کے ذریعے مکاشفہ (الکشف) کا تعلق ہے:**\n\nاور یہ اشارے (الإشارۃ) کا تحقق ہے، میرا مطلب مجلس کے اشارے سے ہے، نہ کہ اس اشارے سے جو دور سے پکارنا ہو، کیونکہ آواز اس کی حد تک نہیں پہنچتی۔ اور یہ اس لیے کہ ذات حق (الحق) کی مجالس دو قسم کی ہیں۔ ایک قسم وہ ہے جس میں صرف اللہ تعالیٰ کے ساتھ خلوت ممکن ہوتی ہے، پس اس میں اشارہ واقع نہیں ہوتا۔ اور یہ تب ہوتا ہے جب تم اس کے ساتھ اس حیثیت سے بیٹھو کہ وہ اس کے لیے ہے، اس کے علم کے مطابق۔ اور دوسری قسم وہ ہے جس میں مجلس میں شرکت ممکن ہوتی ہے، اور یہ تب ہوتا ہے جب وہ بندے کے لیے کسی ایسی صورت میں ظہور الٰہی (التجلی) کرے کہ اس مجلس میں ایک جماعت حاضر ہو سکے، خواہ وہ کم ہوں یا زیادہ، اگرچہ اس ہم نشین کے علاوہ صرف ایک ہی شخص ہو۔ پس ایسی مجلس میں اشارہ ہوتا ہے۔ کیونکہ دوسرا ہم نشین اور اس سے زیادہ لوگ ایک ہی قدم پر جمع نہیں ہو سکتے، یہاں تک کہ اگر ہر ایک ہم نشین اللہ کے ساتھ دوسرے کے حال پر مطلع ہو جائے تو وہ اسے برداشت نہیں کرے گا اور اس کا انکار کرے گا اور کہے گا کہ یہ ابلیس ہے۔ پس جب اللہ کی طرف سے اس حضوری اور صوری مجلس میں ہر ہم نشین کو فہم (الفہم) حاصل ہوتا ہے، تو یہ ضروری ہے کہ وہ اشارے کے ذریعے ہو نہ کہ صراحت کے ذریعے۔ پس ہر شخص اس اشارے سے وہ سمجھتا ہے جو اس کی وسعت میں ہوتا ہے۔ پس اللہ تعالیٰ کے نزدیک کلمہ ایک ہی ہوتا ہے، لیکن ہم نشینوں کے اعتبار سے وہ بہت سے کلمات ہوتے ہیں۔ پس ہر ہم نشین مطمئن ہو کر لوٹتا ہے، یہ گمان کرتے ہوئے کہ وہ باقیوں سے زیادہ خاص ہے۔ اور اللہ کے کچھ ایسے رجال ہیں جنہیں اس نے فہم (الفہم)، وسعت، اور امانت (الأمانۃ) کی حفاظت عطا کی ہے کہ وہ ایسی مجالس میں ہر مشار الیہ کے تمام اشارات کو اللہ سے سمجھ لیتے ہیں۔ اور وہی وہ لوگ ہیں جو اسے انکار کے ظہور الٰہی (التجلی) میں بھی پہچانتے ہیں، اور ہر اعتقاد میں اس کا شہود (الشہود) کرتے ہیں۔ اور تمام تعریفیں اللہ کے لیے ہیں جس نے ہمیں ان میں سے بنایا۔ بے شک وہ اس کا ولی ہے۔ اور یہ مقدار کافی ہے۔ سفر سترہواں باب دو سو دسواں کے اختتام پر مکمل ہوا۔\n\n(شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے)",
    "fa": "«باب دویست و دهم در مکاشفه (المکاشفة)»\n\nچون حق (الحق) اسماء خود را به تو عطا کرد *** آن را امانتی از کسی که فهمیده است، بپذیر.\nزیرا امانت حمل شده است *** و حامل آن جاهلی است که ستم کرده است.\nپس اگر تو مقصود او را فهمیدی *** تو مکاشف هستی، پس باید ملتزم باشی.\nبه احکام آن (اسماء)، پس هرگاه به آن خوانده شدی *** امر او را اجابت کن و حیا کن.\nاز جهت تصرف در آن (اسماء)، و سزاوار نیست *** که تو حکم کنی.\nزیرا تو بنده هستی و اسماء او *** ربوبیت است که عرضه شده، پس احترام بگذار.\nمقام امانت را به جای آور *** آن را ابتدا به پروردگارش بازگردان و چنگ بزن.\nبه آنچه حال (الحال) در کار آن بر تو افزود *** و اشارت آن را محقق ساز و غنیمت شمار.\nپس این مکاشفه‌ای است که مورد رضایت است *** و صاحب آن سروری است که معصوم شده است.\n\n[مکاشفه (المکاشفة) در برابر امانت با فهم، و در برابر تحقق فزونی حال، و در برابر تحقق اشاره به کار می‌رود]\n\nبدان که مکاشفه (المکاشفة) نزد این طایفه (صوفیان) در برابر امانت با فهم، و در برابر تحقق فزونی حال (الحال)، و در برابر تحقق اشاره (الإشارة) به کار می‌رود. بدان که متعلق مکاشفه معانی است و متعلق مشاهده (المشاهدة) ذوات (هویت‌ها) است. پس مشاهده برای مسمّی (نامیده شده) است و مکاشفه برای حکم اسماء (الأسماء) است. مکاشفه نزد ما کامل‌تر از مشاهده است، مگر اینکه مشاهده ذات حق (الحق) صحیح باشد که در آن صورت مشاهده کامل‌تر می‌بود، اما این (مشاهده ذات) صحیح نیست. به همین دلیل گفتیم مکاشفه کامل‌تر است، زیرا لطیف‌تر است. مکاشفه کثیف را لطیف می‌کند و مشاهده لطیف را کثیف می‌سازد. با این سخن ما، گروه بزرگی از اهل الله (مانند ابوحامد، ابن فورک و منذری) موافق‌اند، و گروهی دیگر به عکس آن قائل شده‌اند. ما از این رو گفتیم مکاشفه کامل‌تر است که هیچ امری نیست که آن را شهود (الشهود) کنی مگر اینکه حکمی زائد بر آنچه شهود بر آن واقع شده دارد که جز با کشف (الکشف) درک نمی‌شود. اگر آن امر از حیث ذاتش در شهود برای تو اقامه شود، آن مشهود ناگزیر همراه با حکمی است که جز با کشف درک نمی‌شود، و این همیشه چنین است. پس مکاشفه ادراکی معنوی است و مختص به معانی است. مثال آن این است که وقتی متحرکی را مشاهده می‌کنی، محرک آن با کشف طلب می‌شود، زیرا با کشف دانسته می‌شود که آن متحرک، محرکی دارد. به همین دلیل، علم به دو معلوم تعلق می‌گیرد، در حالی که بصر (بینایی) که برای مشاهده است، به یک معلوم تعلق می‌گیرد. پس با کشف چیزی درک می‌شود که با شهود درک نمی‌شود، و کشف آنچه را که در شهود مجمل است، تفصیل می‌دهد.\n\n[مکاشفه (المکاشفة) بر سه معنا است]\n\nپس مکاشفه، همان‌طور که گفتیم، بر سه معنا است: مکاشفه به علم، مکاشفه به حال (الحال)، و مکاشفه به وجد (الوجد).\n\nاما مکاشفه علم (العلم):\nآن تحقق امانت با فهم است. و آن این است که از مشهود، هنگامی که بر تو تجلی (التجلی) کرد، بدانی که او از آن تجلی چه اراده کرده است، زیرا او بر تو تجلی نکرده مگر برای اینکه چیزی را که نزد تو نیست، به تو بفهماند. پس مشاهده راهی به سوی علم است و کشف (الکشف) غایت آن راه است که همان حصول علم در نفس است. همچنین، هنگامی که با تو سخن گفت، کلام خود را به تو شنوانده است که این شهود سمعی است. در این هنگام، مشاهده فقط برای قوای حسی است و کشف برای قوای معنوی. او تو را نشنوانده مگر برای اینکه از او بفهمی. و هنگامی که تو را فهماند، به هر نوعی که بر تو تجلی کرد از ادراک صور حواس، آن فهم امانتی از جانب او نزد توست. این امانت اهلی دارد و سزاوار نیست که آن را جز به اهلش بسپاری، و اگر چنین نکنی، تو خائن هستی. و پیامبر (ص) فرمود: «المجالس بالأمانة» (مجالس به امانت است).\nیعنی آنچه در مجالس واقع شده را بازگو نکن مگر برای کسی که خداوند فهم آن را به تو داده و سزاوار است که با او درباره آنچه در آن واقع شده سخن بگویی، پس او اهل آن است. و اگر کسی با تو سخن گفت و دیدی که به اطراف نگاه می‌کند، بدان که آن سخن امانتی است که نزد تو سپرده است. بهره مشاهده (المشاهدة) چیزی است که دیدی، شنیدی، چشیدی، بوییدی و لمس کردی؛ و بهره کشف (الکشف) چیزی است که از همه آن فهمیدی. و آنچه فهمیدی امانت است. و چون امانت است، امر الهی بر تو حکم می‌کند که آن را به اهلش ادا کنی یا آن را بازگردانی. و بازگرداندن آن این است که آن را به فراموشی بسپاری، زیرا آنچه را دانستی نمی‌توانی نادیده بگیری، پس خود را چنان کنی که گویی ندیدی و نشنیدی. این بابی است بسیار دشوار بر عارفان که نیازمند ادب، حفظ و رعایت حد است، زیرا میان آن و دروغ جز یک حجاب نیست، و همچنین میان آن و خیانت جز یک حجاب نیست. و رعایت حد میان تو و خیانت و دروغ حائل می‌شود. اما علم این (حد) آن است که اگر کسی که نزد تو گرامی است، از تو درباره امانتی که از شهود (الشهود) بصر یا سمعت یا هر یک از قوای حواست برداشته‌ای، بپرسد و سائل از اهل آن نباشد. و معنای «از اهل آن نیست» این است که کسی که این امانت را به تو داده، تو می‌دانی که او می‌خواسته آن را به چه کسی برسانی. اگر به خاطر گرامی بودنش نزد تو، سائل را پاسخ دهی، خیانت کرده‌ای. و اگر پاسخ ندهی و در جواب به امر دیگری روی آوری که سائل به آن قانع شود، هرچند اگر آنچه را که از او پوشانده‌ای بداند، برایش دشوار باشد، دروغ گفته‌ای؛ مانند مسئله خلیل (ابراهیم) در سه دروغی که نزد او در قیامت تأثیر گذاشت و از خداوند حیا کرد که در مورد گشودن باب شفاعت با او سخن بگوید، با وجود قصد نیکو در آن و صدق در دلالت لفظ، اما چون آن مقصود مخاطب نبود، دروغ نامیده شد. پس بنگر که این موضع چقدر خطرناک است. و اگر بگویی «خبری ندارم»، دروغی گفته‌ای که از تعریض (کنایه) شدیدتر است. و «الحق أَحَقُّ أَنْ يُتَّبَعَ» (حق سزاوارتر است که پیروی شود). پاسخ صادقان در این باره، کسانی که حق را بر غیر آن ترجیح داده‌اند، این است که به سائل بگویند: «آنچه درباره‌اش پرسیدی، برای ما وجوهی در پاسخ دارد، پس نمی‌دانم از کدام وجه پرسیدی تا آن را بدانی.» اگر به تو گفت: «وجوه را تفصیل بده»، بگو: «تو مقصودت را برای من روشن کن.» پس اگر مقصودش را از جواب گفت، اگر از اموری بود که داخل در امانت می‌شود، به او بگو: «این امانتی است که بر حفظ آن با ما عهد بسته شده است، و حق خداوند سزاوارتر است که رعایت شود.» و در این باره از او حیا مکن، هرچند نزد تو گرامی باشد یا صاحب سلطنت باشد. و نباید سموأل یهودی محجوب از تو وفادارتر باشد، در حالی که تو عارفِ شاهد هستی، تا جایی که در وفاداری به او مثل زده شده است. و اگر این سائل وجه مطلوب خود را از جهتی ذکر کرد که به امانت تعلق ندارد، حتماً او را پاسخ ده تا بهره‌مند شود، و چیزی را که در توان حمل آن نیست به او مده که وبال آن بر تو بازگردد. این است معنای سخن آنان: «تحقق امانت با فهم».\n\nو اما مکاشفه به حال (الحال):\nآن تحقق فزونی حال است. بدان که هر کس در هر زمانی به صفتی متصف باشد، آن صفت حال او در آن زمان است، هر صفتی که باشد. به همین دلیل، حال جز پس از تمام شدن کلام نمی‌آید، یعنی اگر ذکر نمی‌شد، کلام بدون آن نیز فایده می‌داد. اما اگر حال مقصود از خبر دادن باشد، کلام با توجه به قصد خبردهنده فایده نداده است. می‌گویی: «زید را دیدم»، کلام مستقل و تمام است. سپس بعد از آن، حال «سوار» را اضافه می‌کنی و می‌گویی: «زید را سوار دیدم»، یعنی در حال سوار بودنش. اگر مقصود تو شناساندن رؤیت او در حال سوار بودن باشد، کلام به این اعتبار تمام نشده است، یعنی فایده‌ای که در نظر داشتی و قصد کردی حاصل نشده است، اما فایده‌ای به طور کلی حاصل شده است که همان رؤیت زید است که او را دیده‌ای و نگفته‌ای در چه حالی. این است معنای تحقق فزونی حال، که محقق شود حال، زائد بر چیزی است که فایده مطلقاً با آن واقع می‌شود، بدون توجه به قصد. و این به معنای اول بازمی‌گردد که همان تحقق امانت با فهم است. اگر کسی تو را ملاقات کند و بپرسد: «آیا زید را دیدی؟» و تو بگویی: «او را دیدم»، سپس حالی را اضافه کنی که او نپرسیده است و بگویی: «مسافر بود»، در حالی که قصد او هنگام پرسش این بود که آیا زید را دیدی تا بداند که او در شهر است و با او ملاقات کند. وقتی گفتی «مسافر بود»، او را از این فزونی که همان فزونی حال سفر اوست، آگاه کردی و او را از طلب ملاقات با او آسوده ساختی، زیرا با نبودن او در شهر، این امر برایش ممکن نیست. این و امثال آن از فزونی حال است. اما در طریق اهل الله، فزونی حال (زیادة الحال) این است که ذاتی را بر حالتی مشاهده کنی، و از آن حال به آنچه امر او به خاطر آن حال به آن می‌انجامد، آگاه شوی. چنین چیزی فزونی حال و مکاشفه به حال نامیده می‌شود. مثال آن این است که ذاتی را بر حال خاصی از حرکت یا سکون یا صفتی که موافق طبع ناظر است یا غیر موافق، مشاهده کنی، و از آن حال امری زائد را بشناسی، و آن این است که آن حال در حق درک‌کننده، به دوستی یا دشمنی یا کراهت یا هر چیز دیگری منجر می‌شود. این همان فزونی حالی است که به تو عطا شده است. و با این (فزونی حال) علم به منزلت نزد خداوند حاصل می‌شود. یکی از آنان گفت: «من می‌دانم پروردگارم چه زمانی مرا دوست دارد.» به او گفته شد: «این معرفت را از کجا داری؟» گفت: «او مرا به آن شناساند.» به او گفته شد: «آیا بعد از رسول الله (صلی الله علیه و سلم) وحی آمده است؟» گفت: سخن او (خداوند): «فَاتَّبِعُونِي يُحْبِبْكُمُ الله» (پس مرا پیروی کنید تا خداوند شما را دوست بدارد). و من در این ساعت در حال پیروی از آنچه تشریع شده هستم، و او راستگوست. پس حال به من عطا کرد که خداوند در این ساعت دوستدار من است، به دلیل اینکه من مظهر چیزی هستم که او دوست دارد، و او تعالی ناظر به محبوب خود است و محبوب او همان چیزی است که من بر آن هستم. پس تعلق محبتی را که مرا محبوب می‌سازد، به پیروی اضافه کرد.\n\nو اما مکاشفه به وجد (الوجد):\nآن تحقق اشاره (الإشارة) است. منظورم اشاره مجلس است، نه اشارتی که ندایی از دوردست باشد که صدا به نهایت آن نمی‌رسد. و آن این است که مجالس حق (الحق) بر دو نوع است: نوع اول آن است که در آن جز خلوت با او تعالی ممکن نیست، پس در این نوع اشاره‌ای واقع نمی‌شود، و آن هنگامی است که با او مجالست کنی از حیث اینکه او برای خود اوست بر علم او به خودش. و نوع دوم آن است که مشارکت در مجلس در آن ممکن است، و آن هنگامی است که بر بنده در صورتی تجلی (التجلی) کند که ممکن باشد گروهی کم یا زیاد در آن مجالست حاضر باشند، حتی اگر یک نفر اضافه بر این همنشین باشد. در چنین مجلسی اشاره واقع می‌شود، زیرا همنشین دیگر و بیشتر نمی‌توانند بر یک قدم (مقام) واحد جمع شوند، تا جایی که اگر هر یک از همنشینان بر حال دیگری با خدا مطلع شود، تحمل نمی‌کند و به آن کفر می‌ورزد و آن را انکار می‌کند و می‌گوید: «این ابلیس است.» پس ناگزیر است که اگر افهامی از جانب خداوند برای هر همنشین او در این حضرت و مجلس صوری واقع شود، با اشاره باشد نه با تصریح. پس هر انسانی از آن اشاره آنچه را در توانش است می‌فهمد. پس کلمه نزد او تعالی یکی است، اما با توجه به همنشینان، کلمات بسیاری است. پس هر همنشینی راضی بازمی‌گردد و گمان می‌کند که از بقیه خاص‌تر است. و خداوند مردانی دارد که از فهم و وسعت و حفظ امانت به آنان عطا کرده است که در چنین مجالسی تمام اشارات هر مشارٌالیه را از خداوند بفهمند. و آنان کسانی هستند که او را در تجلی انکار می‌شناسند و او را در هر اعتقادی شهود (الشهود) می‌کنند. و سپاس خدای را که ما را از آنان قرار داد، همانا او ولیّ این امر است. و این مقدار کافی است. سفر هفدهم با پایان باب دویست و دهم به اتمام رسید.\n\n(به نام خداوند بخشنده مهربان)"
  },
  "page_count": 3
}