{
  "id": 293,
  "title": {
    "ar": "الباب الثالث والتسعون ومائتان في معرفة منزل سبب وجود عالم الشهادة وسبب ظهور عالم الغيب من الحضرة الموسوية",
    "en": "Chapter Two Hundred and Ninety-Three: Concerning the Gnosis (معرفة) of the Station (منزل) that is the Cause of the Existence of the World of Witnessing (عالم الشهادة) and the Cause of the Manifestation of the World of the Unseen (عالم الغيب), derived from the Mosaic Presence (الحضرة الموسوية).",
    "ur": "باب دو سو ترانوے: حضرت موسویہ سے عالم شہادت کے وجود کے سبب اور عالم غیب کے ظہور کے سبب کے مقام (منزل) کی معرفت (معرفۃ) کے بیان میں",
    "fa": "باب دویست و نود و سوم در معرفت منزل سبب وجود عالم شهادت و سبب ظهور عالم غیب از حضرت موسوی."
  },
  "content": {
    "ar": "## «الباب الثالث والتسعون ومائتان في معرفة منزل سبب وجود عالم الشهادة وسبب ظهور عالم الغيب من الحضرة الموسوية»\n\n\n> إذا ما الشمس كان لها شعاع *** فذاك النور من قبلي أتاها\n\n\n> إذا ما الموت حل بكل نفس *** فذاك الموت من رب براها\n\n\n> إذا ما جنة المأوى تجلت *** مزينة إلينا في حلاها\n\n\n> نعمنا بالرياح لما حوته *** من الطيب الممسك في شذاها\n\n\n> وإن طمست نجوم في سماء *** فذاك الطمس أورثها زهاها\n\n\n> وإن دخلت نفوس في نفوس *** فإن دخولها فيها مناها\n\n\n> وعمار القفار لها شرود *** من الصيد الذي يفنى ذماها\n\n\n> ولو أن الرسول يرى نفوسا *** ترد رسالتيه لما أتاها\n\n\n> ولو عرضت عليه الحجب عما *** يجي‏ء به المنازع ما أباها\n\n\n> ولو أن الجواري سابحات *** إلى أمد لحقق منتهاها\n\n\n> ولو أن الليالي مرسلات *** غدائرها لما شقوا دجاها\n\n\n> ولو أن الصباح يرى وجوها *** منورة الجوانب من ضحاها\n> لأخجله ومات بها عزاما *** وهيمه وتيمه هواها\n\n\n> ولو أن الهلال يكون بدرا *** لأربعة وعشر ما تلاها\n\n\n> ولو أن البحار تكون ماء *** فراتا لم يلذ به سواها\n\n\n> ولو أن الأراضي ذات سطح *** لما قال المهيمن قد دحاها\n\n\n> وأظهر فبه زينة كل شي‏ء *** وأخفى حكمة فيه ثراها\n\n\n> ولو أن الديار بها أنيس *** لكان أنيسها رب بناها\n\n\n> ولكن لا يصح الأنس عندي *** بذات ما لها صفة تراها\n\n\n> ولو أن العوالي في سفال *** لكان سفالها أعلى ذراها\n\n\n> ولو أن الرواسي شامخات *** لكان شموخها ممن علاها\n\n\n> ولكن الشموخ لها مقام *** به رب البرية قد حباها\n\n\n> ولو أن الصحيفة قيدت من *** يقيدها لري وقد محاها\n\n\n> ولو أن الجحيم تكون نارا *** بلا برد مشيت على هواها\n\n\n> ولكن العذاب وجود ضد *** تراه النفس ذوقا في جناها\n\n\n> ولو أن المحبة ذات شخص *** لا ضعف شوقها منها قواها\n\n\n> ولو نظر المشرع حين تخلو *** بمن تهواه شرعا ما نهاها\n\n\n> ولو أن السماء بلا نجوم *** لنورها قليل من سناها\n\n\n> ولو أن الرياح جرت رخاء *** لزعزعها وأفقدها رخاها\n\n\n> ولو أن المياه تغور غورا *** لاحيا العالمين ندا يداها\n\n\n> ولو أن السحاب حمت حياها *** عن الكفار أغناهم حياها\n\n\n> ولو أن الجبال تسير سيرا *** لكان سماؤها منها ثراها\n\n\n> ولو أن العيون ترى سناها *** بلا حجب لحل بها عماها\n\n\n> ولو أن الملوك تراك عينا *** إذا أقبلتم حلت حباها\n\n\n> ولو نطق الكتاب بكل حمد *** على أحد من الدنيا عناها\n\n\n> ولو أن المغير يغير صبحا *** عليها في الفلاة لما سباها\n\n\n> ويثبت في مواقف مهلكات *** لقوتها إذا أمر دهاها\n\n\n> لقد أقسمت بالسبع المثاني *** ومن سور الحروف بعين طاها\n\n\n> لقد أبصرت عين الشمس تخفى *** عن الأبصار إذ تعطي نداها\n\n\n> فتبصر جوها بيدي سحابا *** وتبصر أرضها تزهو رباها\n\n\n> وتظهر حسنها لعمي عيون *** ويخفى طرفها عنا عناها\n\n\n> ولما قيل قد رحلت وغابت *** وقد تركت خليفتها أخاها\n\n\n> أجبت رسولها لما أتاني *** ليسأل أن تكلمني شفاها\n\n\n> فقلت الستر أولى بي لأني *** رأيت فناء عيني في فناها\n\n\n> فما رحلت لبغض كان منها *** ولكن كان عن حاد حداها\n\n\n> إجابته لأمر واعتناء *** به جود المهيمن قد حذاها\n\n\n> فصار الكل مفتقرا إليها *** وصار الكون يرغب في حداها\n> فكم من حفرة قد كنت فيها *** ولولاها لملت على شفاها\n\n\n> لعلة شهوة لو أن عيسى *** تؤيده الأساة لما شفاها\n\n\n> وكم من طعمة أكلت بحرص *** لشهوتها ولم تبلغ أناها\n\n\n> وكم من شهوة نظرت إلينا *** ونلناها عصمنا من أذاها\n\n\n> ولم تك نفسنا يوما نوتها *** وكان العقل قد أخفى نواها\n\n\n> مخافة أن تطالبه نفوس *** بها والعقل يحذر من جفاها\n\n\n> ولا خطرت له يوما ببال *** ولا حكمت عليه ولا نواها\n\n\n> ولكن الشريعة أثبتتها *** إلى أهل السعادة في خساها\n\n\n> فنالوها ولم تعقب حجابا *** وصانهم المهيمن عن زكاها\n\n\nاعلم أيدنا الله وإياك أن هذه القصيدة وكل قصيدة في أول كل باب من هذا الكتاب ليس المقصود منها إجمال ما يأتي مفصلا في نثر الباب والكلام عليه بل الشعر في نفسه من جملة شرح ذلك الباب فلا يتكرر في الكلام الذي يأتي بعد الشعر فلينظر الشعر في شرح الباب كما ينظر النثر من الكلام عليه ففي الشعر من مسائل ذلك الباب ما ليس في الكلام عليه بطريق النثر وهي مسائل مفردات تستقل كل مسألة في الغالب بنفسها إلا أن يكون\n\n\nبين المسألتين رابط فيطلب بعضها بعضا كالإنسان فإنه يطلب الكلام في الحيوان بما فيه من الإحساس ويطلب النبات بما فيه من النمو والغذاء ويطلب الجماد بما فيه مما لا يحس كالأظفار والشعر فيتعلق بالنبات لنموها ويتعلق بالجماد لعدم إحساسها وما في الوجود شي‏ء أصلا لا يكون بينه وبين شي‏ء آخر ارتباط أصلا حتى بين الرب والمربوب فإن المخلوق يطلب الخالق والخالق يطلب المخلوق ولذا كان العلم من العالم على صورة المعلوم وخرج المعلوم على صورة العلم وإن لم يكن كذلك فمن أين يقع التعلق فلا تصح المنافرة من جميع الوجوه أصلا فلا بد أن تتداخل المسائل للارتباط الذاتي الذي في الوجود بين الأشياء كلها فافهم ما أشرت به إليك في هذا الارتباط فإنه ينبئ عن أمر عظيم إن لم تتحققه زلت بك قدم الغرور في مهواة من التلف فإنه من هنا تعرف ما معنى قول من قال بحدوث العالم ومن قال بقدم العالم مع الإجماع من الطائفتين بأنه ممكن وإن كل جزء منه حادث وليس له مرتبة واجب الوجود بنفسه وإنما هو عند بعضهم واجب الوجود بغيره إما لذات الموجد عند بعضهم وإما لسبق العلم بوجوده عند آخرين ولو لا صحة الارتباط الذي أشرنا إليه لما صح أن يكون العالم أصلا وهو كائن فالارتباط كائن والمنافرة وعدم المنافرة من وجه آخر فكل حقيقة إلهية لها حكم في العالم ليس للأخرى وهي نسب فنسبة العالم إلى حقيقة العلم غير نسبته إلى حقيقة القدرة فحكم العلم فيه لا مناسبة بينه وبين المقدور وإنما مناسبته بينه وبين المعلوم والأمر من كونه معلوما يغاير كونه مقدورا فإذا نظرته على هذا النسق قلت لا مناسبة بين الله وبين عباده وإذا نظرت بالعين الأخرى أثبت النسبة فإنها موجودة في الكل فاحكم بحسب ما تراه وما يغلب عليك في الوقت وإذا تبينت الحقائق لذي عينين فليقل ما حد له الشرع أن يقول ولا يقل بعقله فإن إطلاق الألفاظ منها ما هو محجور علينا مع صحة المعنى ومنها ما هو مباح لنا مطلقا مع فساد المعنى طلاق نسبة الظرفية لمن لا يقبل الظرفية وكنسبة استفادة العلم لمن لا يستفيد علما فالإطلاق مشروع والوجه المنافي معقول كما حجر إطلاق نسبة الولد وأدخله تحت حكم لو وكما حجر تبديل القول الإلهي في قوله ما يبدل القول لدي وأدخله تحت لو ولا يدخل تحت لو إلا الممكن والعقل يدل على الإحالة في الولد دلالة عقلية ويدل على الإمكان في هداية الناس أجمعين دلالة عقلية ويدل على إحالة هداية الناس أجمعين لما سبق في العلم من الاختلاف دلالة عقلية وتدل لفظة لو على أنه مخير في نفسه إن شاء شاء أمرا ما وإن شاء لم يشأ ذلك الأمر وهذا ورد به الإخبار الإلهي ويحيله العقل وقد أمرنا الله بالعلم به وجعل الآيات دلائل لأولي الألباب ولكن لما هي دلائل عليه خاصة فلا يخلو الأمر في أمره إيانا بالعلم به هل نسلك في ذلك دلالة الشارع والوقوف عند إخباره تقليدا أو نسلك طريقة النظر فيكون معقولا أو نأخذه من دلالة العقل ما يثبت به عندنا كونه إلها\nونأخذ من دلالة الشرع ما نضيفه إلى هذا الإله من الأسماء والأحكام فنكون مأمورين في العلم به سبحانه شرعا وعقلا وهو الصحيح فإن الشرع لا يثبت إلا بالعقل ولو لم يكن كذلك لقال كل أحد في الحق ما شاء مما تحيله العقول وما لا تحيله وهم قد فعلوا ذلك مع الايمان بالشرع ودخلوا بالتأويل في أمور لا حاجة لهم بها ولو استغنوا عنها لم يطالبهم العقل بذلك ولا سألهم الشرع عن ترك ذلك بل يسألهم الشرع عن فعل ذلك وهم فيه على خطر ولا حجة على ساكت إلا إذا وجب عليه الكلام فيما سكت فيه وقد اندرج في هذا الكلام جميع ما ذكرناه في القصيدة التي في أول الباب فإنه جميع ما عدد فيها من الأمور تطلب حقائق إلهية تستند إليها وتنافر حقائق إلهية فمما يتضمن هذا المنزل تجلى الحجاب بين كشفين وتجلى الكشف بين حجابين وما في المنازل منزل يتضمن هذا الضرب من التجلي إلا هذا المنزل فإن التجلي المنفرد في المظهر من غير بينية يعطي ما لا يعطيه في البينية والتجلي المفرد الذاتي في غير المظهر يعطي ما لا يعطيه في البينية وهذا التجلي الواقع في البينية يعطي الحصر بين أمرين وكل محصور محدود بمن حصره وهذا أعجب المعارف في هذا الطريق أن يكون التجلي الذاتي الذي له الإطلاق محصورا فهو كما يقال عن القاعد في حال قعوده إنه قائم فظاهر الأمر أنه لا يتصور فسبحان من تنزه عن الأضداد وقبلتها أوصافه‏\n\n\nقال صلى الله عليه وسلم ترون ربكم كما ترون الشمس بالظهيرة\n\n\nفإن كان أراد النهار بهذا اللفظ فقد عم التجليات الذاتية وإن اختلفت في حكم التجلي كاختلاف صفة تنزيهه باسمه الغني عن الفقر وصفة تنزيهه بالأحدية عن الشريك بقوله ولَمْ يَكُنْ لَهُ شَرِيكٌ في الْمُلْكِ كذلك التجليات الذاتية البصرية مثل هذه التجليات الذاتية العقلية وإن كان أراد بالظهيرة وقتا معينا في النهار وهو الأظهر في المعنى المحقق واللفظ وعليه أولى أن يحمل هذا القول فإن النهار كله تجل ذاتي لأن الشمس فيه ظاهرة بذاتها فإن النهار جلاها للابصار وإن كان النهار معلولا عنها فظهرت بذاتها من أول شروقها إلى حال غروبها ولها تجل وحكم في كل دقيقة يعرفها من يعرفها ويجهلها من يجهلها والذي يعرف الكل من ذلك ما امتد زمانه فيفرقون ما بين حكمها في طلوعها وشروقها وحكمها في إشراقها وحكمها في ضحاها وحكمها في زوالها وهو أول غشيها وحكمها في عصرها وحكمها في قبض ضوئها وقلة سلطانه عما كان عليه فيما يقابله من أول النهار وصدره وحكمها عند سقوطها ولكل تجل وإن كان ذاتيا حكم ليس للآخر فما عدا الطرفين فهو تجل ذاتي بين تجليين ذاتيين إلا الطرفين فهو تجل ذاتي عقيب تجل حجابي والطرف الآخر تجل ذاتي يعقبه تجل حجابي فهو تجل ذاتي بين تجل ذاتي وحجابي وقد رمينا بك على الطريق فافهم من حالات تغير الأحكام الشمسية في هذه الآنات ووقوع التشبيه منها في آن معين وهو الظهيرة وحالة الصحو وعدم السحاب بينها وبين الرائي وخذ أنت في الآنات الباقية آثار التجلي الذاتي‏\n\n\n### [إن النور المنبسط على الأرض ليس له حقيقة وجودية إلا بنور البصر]\n\n\nفاعلم إن النور المنبسط على الأرض الذي هو من شعاع الشمس الساري في الهواء ليس له حقيقة وجودية إلا بنور البصر المدرك لذلك فإذا اجتمعت العينان عين الشمس وعين البصر استنارت المبصرات وقيل قد انبسط الشمس عليها ولذلك يزول ذلك الإشراق بوجود السحاب الحائل لأن العين فارقت هذه العين الأخرى بوجود السحاب وهي مسألة في غاية الغموض لأني أقول لو أن الشمس في جو السماء وما في العالم عين تبصر من حيوان ما كان لها شعاع منبسط في الأرض أصلا فإن نور كل مخلوق مقصور على ذاته لا يستنير به غيره فوجود أبصارنا ووجود الشمس معا أظهر النور المنبسط أ لا ترى الألوان تنقلب في الجسم الواحد المتلون بالخضرة مثلا أو الحمرة إذا اختلفت منك كيفيات النظر إليه من الاستقامات والانحرافات كيف يعطيك ألوانا مختلفة محسوسة تدركها ببصرك لا وجود لها في الجسم المنظور إليه في الشمس ولا تقدر تنكر ذلك ولا سيما إذا كان الجسم المنظور إليه في الشمس فقد أدركت ما لا وجود له حقيقة بل نسبة كذلك النور المنبسط على الأرض وكتقلب الحرباء في لون ما تكون عليه من الأجسام على التدريج شيئا بعد شي‏ء ما هي مثل المرآة تقبل الصورة بسرعة ولا هي جسم صقيل وإدراك تقلبها في الألوان محسوس مع علمك بأن تلك الألوان لا وجود لها في ذلك الجسم الذي أنت ناظر إليه ولا في أعيانها في علمك كذلك العالم مدرك لله في حال عدمه فهو معدوم العين مدرك لله يراه فيوجده لنفوذ الاقتدار الإلهي فيه ففيض الوجود العيني إنما وقع على تلك المرئيات لله في حال عدمها فمن نظر إلى وجود تعلق رؤية العالم في‏\nحال عدمه وإنها رؤية حقيقية لا شك فيها وهو المسمى بالعالم ولا يتصف الحق بأنه لم يكن يراه ثم رآه بل لم يزل يراه فمن قال بالقدم فمن هنا قال ومن نظر إلى وجود العالم في عينه لنفسه ولم يكن له هذه الحالة في حال رؤية الحق إياه قال بحدوثه ومن هنا تعلم أن علة رؤية الرائي الأشياء ليس هو لكونها موجودة كما ذهب إليه من ذهب من الأشاعرة وإنما وجه الحق في ذلك إنما هو استعداد المرئي لأن يرى سواء كان موجودا أو معدوما فإن الرؤية تتعلق به وأما غير الأشاعرة من المعتزلة فإنها اشترطت في الرؤية البصرية أمورا زائدة على هذا تابعة للوجود ولهذا صرفت الرؤية إلى العلم خاصة فأما تجلى الذات بين تجليين حجابيين فلا بد أن يظهر في ذلك التجلي الذاتي من صور الحجابين أمر للرائي فيكون ذلك التجلي له كالمرآة يقابل بها صورتين فيرى الحجابين بنور ذلك التجلي الذاتي في مرآة الذات كما تشهد الفقر في حال تنزيهك الحق عنه سبحانه الغني الحميد وإن لم يكن الأمر كذلك فكيف تنزهه عما ليس بمشهود لك عقلا فهكذا صورة الحجاب في الذات عند التجلي وأوضح من هذا فلا يمكن فإذا أدرك العارف صورة هذين الحجابين أو صورة الحجاب والتجلي الذاتي الذي هذا التجلي الذاتي الآخر بينهما أو أدرك التجليين الذاتيين في مجلى الحجاب الواقع بينهما فليكن ذكره وعمله بحسب ما تعطيه تلك الصورتان في ذلك المجلى والعلة في أنه لا يدرك أبدا في التجلي أي تجل كان إلا صورتين لا بد منهما لكون الواحد يستحيل أن يشهد في أحديته ولما كان الإنسان لا تصح له الأحدية وهو في الرتبة الثانية من الوجود فله الشفعية لهذا لا يشاهد في التجلي إلا الصورتين الذي هو المجلى بينهما فلا يرى الرائي من الحق أبدا حيث رآه إلا نفسه فهذا التجلي يعرفك بنفسك وبنفسه فإن كان التجلي بين حجابين كانت الصورتان عملا إن كان في الدنيا فيكون عمل تكليف مشروع وإن كان في الآخرة فيكون عمل نعيم في منكوح أو ملبوس أو مأكول أو مشروب أو تفرج بحديث أو كل ذلك أو ما أشبه ذلك بحسب الحجاب ولهذا إذا رجع الناس من التجلي في الدار الآخرة يرجعون بتلك الصورة ويرون ملكهم بتلك الصورة وبها يقع النعيم ويظهر أن النعيم متعلقة الأشياء وليس كذلك وإنما متعلق النعيم وجود الأشياء أو إدراكها على تلك الصور الحجابية التي أدركها في المجلى الذاتي وإن كان التجلي تجليا حجابيا بين تجليين ذاتيين كتجلي القمر بين الضحى والظهيرة وتجلى الليل بين نهارين كانت الصورتان في ذلك المجلى الحجابي علما لا عملا ولكن من علوم التنزيه فتتحلى به النفس وتنعم به النعيم المعنوي وتلك جنتها المناسبة لها فافهم وإن كان التجلي الذاتي بين تجل حجابي وذاتي كانت الصورتان صورة علم لا صورة عمل فالتجلي الذاتي في الذاتي صورة علم تنزيه لا غير وصورة التجلي الحجابي فيه صورة علم تشبيه وهو تخلق العبد بالأسماء الإلهية وظهوره في ملكه بالصفات الربانية وفي هذا\n\n\nالمقام يكون المخلوق خالقا ويظهر بأحكام جميع الأسماء الإلهية وهذه مرتبة الخلافة والنيابة عن الحق في الملك وبه يكون التحكم له في الموجودات بالفعل بالهمة والمباشرة والقول فأما الهمة فإنه يريد الشي‏ء فيتمثل المراد بين يديه على ما أراده من غير زيادة ولا نقصان وأما القول فإنه يقول لما أراده كُنْ فَيَكُونُ ذلك المراد أو يباشره بنفسه إن كان عملا كمباشرة عيسى الطين في خلق الطائر وتصويره طائرا وهو قوله لِما خَلَقْتُ بِيَدَيَّ فللإنسان في كل حضرة إلهية نصيب لمن عقل وعرف وإن كان التجلي الحجابي بين تجل حجابي وذاتي فالتجلي الحجابي في الحجابي علم ارتباطه بالحق من حيث ما هو دليل عليه وكونه سببا عنه وأنه على صورته ونسبة الشبه به وأما صورة التجلي الذاتي في الحجابي فهو علم تجلى الحق في صفات المخلوق من الفرح والتعجب والتبشبش واليد والقدم والعين والناجذ واليدين والقبضة واليمين والقسم للمخلوق بالمخلوقين وبنفسه واتصافه بحجب النور والظلم وبحصر سبحانه المحرقة خلف تلك الحجب النورية والظلمية وقد حصرت لك مقام التجليات في أربع وليس ثم غيرها أصلا ولما أعطت الحقيقة في التجليات الإلهية إنها لا تكون إلا في هذه الأربع‏\n\n\nفي العالم كانت الموجودات كلها على التربيع في أصلها الذي ترجع إليه فكل موجود لا بد أن يكون في علمه علم تنزيه أو علم تشبيه وفي عمله إما في عمل صناعي أو عمل فكري روحاني ولا تخلو من هذه الأربعة الأقسام وكذا الطبيعة أعطت بذاتها لحكم هذه التجليات فإن الموجودات إنما خرجت على صورة هذه التجليات فكانت الحرارة والبرودة واليبوسة والرطوبة وهي في كل جسم بكمالها غير أنه‏\nقد تكون في الجسم على التساوي في القوة وهو سبب بقاء ذلك الجسم وقد لا تكون في الجسم على السواء في القوة فتكون العلل لذلك الجسم مستصحبة وحالات الأمراض تنقلب عليه بحسب غلبة بعضها على بعض فإن أفرطت كان الموت وإفراطها منها فإن السبب الموجب لإفراطها إنما وقع منها بمأكول يأكله الإنسان أو الحيوان فما يكون الغالب في ذلك المأكول أو المباشر يزيد في كمية ما يناسبه من الجسم إن كان حارا قوي الحرارة وإن كان باردا قوي البرودة وكذلك ما بقي ثم إنه لما ألف بين هذه الأربعة لم يظهر إلا أربعا ولا قبلت إلا أربعة وجوه فإن حقائق تلك التجليات الأربعة أعطت أن لا تأتلف من هذه الأربع إلا وزنها في العدد ولهذا كانت منها المنافرة من جميع الوجوه والمناسبة كما ذكرناه في الإلهيات في أول هذا الباب وتلك الحقيقة الإلهية حكمت على العالم أن يكون بتلك المثابة إذ كان المعلوم على صورة العلم وعلمه ذاته فافهم فالمنافرة كالحرارة والبرودة وكذلك الرطوبة واليبوسة فلذلك لا تجتمع الحرارة والبرودة ولا الرطوبة واليبوسة في حكم أبدا وأوجد الله العناصر أربعة عن تأليف هذه الطبائع فكان النار عن الحرارة واليبوسة ثم لم يجعل ما يليه ما ينافره من جميع الوجوه بل جعل إليه ما يناسبه من وجه وإن فارقه من وجه فكان الهواء له جارا بما يناسبه من الحرارة وإن نافره بالرطوبة فإن للوساطة أثرا وحكما لجمعها بين الطرفين فقويت على المنافرة لهما فالهواء حار رطب فبما هو حار يستحيل إلى النار بالمناسب وغلب الوساطة وبما هو رطب يستحيل إلى الماء بالمناسب ثم جاور الهواء من الطرف الأسفل الماء فقبل الهواء جوار النار للحرارة وقبل جوار الماء للرطوبة وإن نافره بالبرودة كما نافره الهواء بالحرارة وكذلك جاور بين التراب وبين الماء للبرودة الجامعة لمجاورتهما فما ظهر عنها إلا أربعة لذلك الأصل وكذلك الجسم الحيواني المولد جعل أثر النار فيه الصفراء وأثر الهواء الدم وأثر الماء البلغم وأثر التراب السوداء فركب الجسم على أربع طبائع وكذلك القوي الأربعة الجاذبة والماسكة والهاضمة والدافعة وكذلك قرن السعادة والشقاء بالأربعة باليمين والشمال والخلف والأمام لأن الفوقية لا يمشي الجسم فيها بطبعه والتحتية لا يمشي فيها الروح بطبعه والإنسان والحيوان مركب منهما فما جعلت سعادته وشقاوته إلا فيما يقبله طبعه في روحه وجسمه وهي الجهات الأربع وبها خوطب ومنها دخل عليه إبليس فقال ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ ولم يقل من فوقهم ولا من تحتهم لما ذكرناه فإبليس ما جاءه إلا من الجهات التي تؤثر في سعادته إن سمع منه وقبل ما يدعوه إليه وفي شقاوته إن لم يسمع منه ولم يقبل ما دعاه إليه فسبحان العليم الحكيم مرتب الأشياء مراتبها وهكذا فعل العالم الجسماني العلوي فجعل البروج التي جعل الأحكام عنها في العالم على أربع نارية وترابية وهوائية ومائية وكذلك جعل أمهات المطالب أربعة هل وما ولم وكيف وكذلك أمهات الأسماء المؤثرة في العالم وهو العالم والمريد والقادر والقائل فعلمه بكونه يكون في وقت كذا على حالة كذا دون ذلك لا يمكن فهذا العلم علق الإرادة بتعين ذلك الحال فالقائل علق القدرة بإيجاد تلك العين فعلم فأراد وقال فقدر فظهرت الأعيان عن هذه الأربعة فالحرارة للعلم واليبوسة للإرادة والبرودة للقول والرطوبة للقدرة فللحرارة التسخين ولليبوسة التجفيف وللرطوبة التليين وللبرودة التبريد قال تعالى ولا رطب ولا يابس فذكر المنفعلين دون الفاعلين لدلالتهما على من كانا منفعلين عنهما وهما الحرارة انفعل عنها اليبوسة وكذلك البرودة انفعل عنها الرطوبة فانظر ما أعطته هذه التجليات بحصرها فيما ذكرناه وكذلك العالم سعيد مطلق وشقي مطلق وشقي ينتقل إلى سعادة وسعيد ينتقل إلى شقاوة فانحصرت الحالات في أربع ومنه الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ وما ثم خامس وهذه نعوت نسبته مع العالم ومراتب العدد أربعة لا خامس لها وهي الآحاد والعشرات والمئات والآلاف ثم يقع التركيب وتركيبها كتركيب الطبائع لوجود الأركان سواء\n\n\n### [ما دام البدر طالعا فالنفوس في البساتين نائمة]\n\n\nواعلم يا أخي أنه ليلة تقييدي لبقية هذا المنزل من بركاته رأيت رسول الله صلى الله عليه وسلم وقد استلقى على ظهره وهو يقول ينبغي للعبد أن يرى عظمة الله في كل شي‏ء حتى في المسح على الخفين ولباس القفازين وكنت أرى في رجليه صلى الله عليه وسلم نعلين أسودين جديدين وفي يديه قفازين وكأنه يشير إلي مسرورا بما وضعته في هذا المنزل من العلم بما يستحقه جلال الله ثم يقول ما دام البدر طالعا فالنفوس في البساتين نائمة وفي جواسقها آمنة فإذا كان الظلام ولم يطلع‏\nالبدر خيف من اللصوص فينبغي إن يدخل الإنسان المدينة حذرا من اللصوص فكنت أفهم عنه من هذا الكلام أنه يريد أن النفوس إذا كان شهود الحق غالبا عليها محققة به وفيه عند من يدخل بساتين معرفة الله والكلام في جلاله على ضروبه وكثرة فنونه فشبه الحق بالبدر وشبه ما تحويه البساتين من ضروب الفواكه بما تحوي عليه الحضرة الإلهية من معارف الأسماء الإلهية وصفات الجلال والتعظيم وفهمت منه في المنام من قوله إذا غاب البدر وذلك شهود الحق في الأشياء والحضور معه والنية الخالصة فيه كان ظلام الجهل والغفلة عن الله والخطاء وخيف من اللصوص يريد الشبه المضلة الطارئة لأصحاب النظر الفكري وأصحاب الكشف الصوري فذكر ذلك خوفا على النفوس إذا اشتدت في الكلام على ما يستحقه جناب الحق فليدخل المدينة يريد فليتحصن من ذلك بالشرع الظاهر وليلزم الجماعة وهم أهل البلد فإن يد الله مع الجماعة ثم رأيته صلى الله عليه وسلم يتقلق قلقا عظيما بجميع أعضائه لعظيم ما هو فيه من السرور بما يتضمنه هذا المنزل من المعرفة وكانتا في الليل والبدر طالع حتى كان منه في النهار أرى البدر يضي‏ء في كبد السماء وقائل يقول لم ير رسول الله صلى الله عليه وسلم في قلق عظيم لما يرد عليه من الله ويشهده واستيقظت فقيدت الرؤيا في هذا المنزل واستبشرت بما رأيته لله الحمد على ذلك ويتضمن هذا المنزل علوما جمة وما من منزل إلا ويحتمل ما يحوي عليه من المعارف مجلدات كثيرة فقلت لأصحابى في هذه الليلة إنما أجعل من المنزل بعض ما يحوي عليه من المعارف مسألة من مسائله فسألني بعض أصحابي قال إذا كان الأمر على هذا فنبهنا على عدد ما يحويه من المسائل بذكر رءوس أصولها خاصة لنعرفها من غير تفصيل مخافة التطويل فقلت إن شاء الله ربما أفعل ذلك فبما بقي علينا من هذه المنازل في هذا الكتاب فكانت على هذه الليلة ليلة مباركة\n\n\n### [علم التجلي في النجوم‏]\n\n\nفاعلم إن هذا المنزل يتضمن علم التجلي في النجوم على كثرتها في كل نجم منها في آن واحد برؤية واحدة وعلم تداخل التجليات وعلم تجلى التابع والمتبوع وهل يحصل للتابع ذوق من تجلى المتبوع أم لا فإن المتبوع إنما جاء يدعو إلى الله ما جاء يدعو إلى نفسه فقال تَعالَوْا إِلى‏ كَلِمَةٍ سَواءٍ بَيْنَنا وبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا الله ولا نُشْرِكَ به شَيْئاً ولا يَتَّخِذَ بَعْضُنا بَعْضاً أَرْباباً من دُونِ الله وقال أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي فجعل للتابع نصيبا في الدعاء إلى الله فكل علم يستقل به الإنسان من كونه عاقلا لا يحتاج فيه إلى غيره من رسول ولا دل عليه كالعلم بتوحيد الله وما يجب له وكذلك ما يحصل له من الفيض الإلهي في الكشف في خلواته وطهارة نفسه بمكارم الأخلاق فمثل هذا يكون له من التجلي مثل ما للمتبوع لأنه ليس بتابع إنما هو ذو بصيرة إما لدليل عقل سار أو لكشف محقق هو فيه مثل المتبوع وكل إنسان ما له هذا المقام وكان الذي عنده من العلم بالله أخذه إيمانا من المتبوع ومشى عليه ويكون ذلك العلم مما لا يمكن أن يحصل إلا على طريقة الرسول صلى الله عليه وسلم وهو علم التقرب إلى الله من كونه قربة لا من كونه علما وكذلك الأعمال البدنية والقلبية على طريق القربة لا تعلم إلا من المتبوع فإذا كان التجلي في هذا المقام لصاحب هذا العلم فلا يلحق فيه التابع المتبوع أبدا فهو للمتبوع تجل شمسي وهو للتابع تجل قمري ونجومي فاعلم ذلك‏\n\n\n### [تجلى الحق لأهل الشقاء في غير الاسم الرب‏]\n\n\nومما يتضمنه هذا المنزل تجلى الحق لأهل الشقاء في غير الاسم الرب مع أن الله ما جعل الحجاب إلا في يومئذ مخصوصا وفي اسم الرب المضاف إليهم لا في إطلاق الاسم فهم في الحجاب في زمان مختص من اسم مضاف خاص بهم فلا يمنع تجليه في هذا الاسم الخاص لهم في غير ذلك الزمان وفي اسم الرب المطلق وفي غيره من الأسماء قال تعالى كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ فأضافه إليهم يومئذ لَمَحْجُوبُونَ فجعله زمانا معينا فافهم‏\n\n\n### [النعيم بالتجلي إنما يقع للمحبين المشتاقين‏]\n\n\nويتضمن هذا المنزل أنه ليس كل تجل يقع به النعيم وأن النعيم بالتجلي إنما يقع للمحبين المشتاقين الذين وفوا بشروط المحبة ويتضمن هذا المنزل بطون عالم الشهادة في الغيب فيرجع ما كان شهادة غيبا وما كان غيبا شهادة وهكذا ذهب إليه بعض العارفين في نشأة الآخرة إن الأجسام تكون مبطونة في الأرواح وأن الأرواح تكون لها ظروفا ظاهرة بعكس ما هي في الدنيا فيكون الظاهر في الدار الآخرة والحكم للروح لا للجسم ولهذا يتحولون في أية صورة شاءوا لغلبة الروحية عليهم وغيبية الجسم فيها كما هم اليوم عندنا الملائكة وعالم الأرواح يظهرون في أية صورة شاءوا ومن منازل أصحاب الكشف الذين أنكروا حشر الأجسام فإنهم أبصروا في كشفهم الأمر الواقع في الدار الآخرة ورأوا أرواحا تتحول في الصور كما يريدون وغيب عنهم ما تحوي عليه تلك الأرواح‏\nمن الجسمية كما غاب عنهم في هذه الدار في البشر الروحانية المبطونة في الأجسام فكانت الأجسام قبورا لها وفي الآخرة بالعكس الأرواح قبور الأجسام فلهذا أنكروا ذلك والكشف التام الذي فزنا به وأصحابنا هنا وفي الآخرة إنا كشفنا الأرواح هنا وغلب الأجسام الطبيعية عليها في الصورة الظاهرة فلا يرى من الأرواح في ظاهر الأجسام إلا آثارها ولو لا الموت والنوم ما عرف غير المكاشف إن ثم أمرا زائدا على ما يشاهده في الظاهر ومع وجود الموت والسكون وظهور الجسم عريا عما كان له من الآثار ذهبت طائفة إلى هذا المذهب وهم الحشيشية فما رأت أن ثم خلف هذه الصورة الظاهرة شيئا أصلا فكيف بهؤلاء لو لم يكن موت في العالم ويتضمن هذا المنزل معرفة العالم العلوي وترتيب صورته في تركيبه وإنه على خلاف ما يذكره أصحاب علم الهيئة وإن كان ما قالوه يعطيه الدليل ويجوز أن يكون الله يرتبه على ذلك ولكن ما فعل مع أنه يعطي هذا الترتيب ما يعطيه ما ذهب إليه أصحاب علم الهيئة ويتضمن علم ما أودع الله في العالم السفلي في ترتيبه من الأمور ويتضمن معرفة المكلفين ومن أين كلفت وما يحركهم ويتضمن علم القربات ويتضمن علم سبب قصم الجبابرة المتكبرين على الله ويتضمن إلحاق الحيوان بالإنسان في العلم بالله ويتضمن علم العواقب وما آل كل عالم فقد ذكرت رءوس ومسائله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Ninety-Three: Concerning the Knowledge of the Station of the Cause of the Existence of the World of Witnessing and the Cause of the Manifestation of the World of the Unseen, from the Mosaic Presence (الحضرة الموسوية).\n\nIf the sun has a ray,\nThat light came to it from before me.\nIf death descends upon every soul,\nThat death is from the Lord who created it.\nIf the Garden of Abode (جنة المأوى) manifests,\nAdorned for us in its beauty,\nWe are blessed by the winds for what they contain\nOf the musk fragrance in their scent.\nAnd if stars are extinguished in a heaven,\nThat extinction bequeaths them their splendor.\nAnd if souls enter into souls,\nTheir entry therein is their ultimate desire.\nAnd the inhabitants of the desolate lands flee\nFrom the prey whose blame is annihilated.\nIf the Messenger saw souls\nRejecting his two messages, he would not have come to them.\nAnd if the veils were presented to him concerning what\nThe contender brings, he would not refuse them.\nIf the running ships were swimming\nToward a limit, they would realize their destination.\nAnd if the nights were letting down\nTheir tresses, they would not cleave their darkness.\nAnd if the morning saw faces\nIlluminated on their sides by its light,\nIt would be ashamed and die of resolve for them,\nAnd their love would make it passionately devoted and enslaved.\nIf the crescent moon were a full moon\nFor fourteen (nights), it would not follow them.\nIf the seas were sweet, palatable water,\nNone but they would delight in it.\nIf the lands were flat surfaces,\nThe Dominant One (المهيمن) would not have said He spread them out (daha).\nAnd He manifested in it the adornment of everything,\nAnd concealed in its dust the wisdom of it.\nIf the dwellings had an intimate companion,\nTheir companion would be the Lord who built them.\nBut intimacy (الأنس) is not valid for me\nWith an Essence (ذات) that has no attribute you can see.\nIf the high places were in low places,\nTheir low places would be their highest peaks.\nIf the firm mountains were towering,\nTheir towering would be from Him who elevated them.\nBut the towering height is a station (مقام)\nWith which the Lord of Creation has favored them.\nIf the scroll recorded the one\nWho records it, it would see that it had erased it.\nIf Hell (الجحيم) were fire\nWithout coldness, I would walk according to its desire.\nBut the torment is the existence of an opposite,\nWhich the soul tastes in its reaping.\nIf Love (المحبة) were a person,\nThe weakness of its longing would strengthen it.\nIf the Lawgiver looked when she is alone\nWith the one she loves, the Law would not forbid her.\nIf the heaven were without stars,\nIts light would be little of its radiance.\nIf the winds blew gently,\nHe would shake them and make them lose their gentleness.\nIf the waters sank deep down,\nThe dew of its hands would revive the worlds.\nIf the clouds withheld their rain\nFrom the disbelievers, their rain would enrich them.\nIf the mountains moved a movement,\nTheir heaven would be their dust.\nIf the eyes saw its radiance\nWithout veils, blindness would befall them.\nIf the kings saw you directly,\nWhen you approach, they would bestow their gifts.\nIf the Book spoke with all praise\nConcerning anyone in the world, it would mean them.\nIf the raider raided them at dawn\nIn the desert, he would not capture them.\nAnd he would stand firm in deadly situations\nDue to their strength when a matter overtakes them.\nI have sworn by the Seven Oft-Repeated Verses (السبع المثاني)\nAnd by the chapters of the letters, by the essence of Ta-Ha.\nI have seen the eye of the sun conceal itself\nFrom sight when it gives its dew.\nSo you see its atmosphere by the hands of clouds,\nAnd you see its earth whose hills flourish.\nAnd it reveals its beauty to blind eyes,\nAnd its gaze conceals its meaning from us.\nAnd when it was said, \"It has departed and vanished,\nAnd has left its successor, its brother,\"\nI answered its messenger when he came to me,\nAsking me to speak to him directly.\nI said, \"Concealment (الستر) is more fitting for me, for I saw\nThe annihilation (فناء) of my eye in its annihilation.\"\nIt did not depart due to hatred from it,\nBut rather due to a driver who drove it.\nIts response was to a command and a concern,\nWhich the generosity of the Dominant One (المهيمن) had guided it toward.\nThus, all became dependent upon it,\nAnd the cosmos desired its guidance.\nHow many a pit I was in,\nAnd were it not for it, I would have leaned over its edge,\nDue to an ailment of desire that, even if Jesus\nWere supported by healers, they could not cure.\nHow many a morsel I ate with greed\nFor its desire, yet did not reach its fulfillment.\nHow many a desire looked upon us,\nAnd when we attained it, He protected us from its harm.\nOur soul never intended it one day,\nAnd the intellect (العقل) had concealed its intention,\nFearing that souls might demand it from him,\nAnd the intellect warns against its harshness.\nIt never crossed his mind one day,\nNor did it rule over him, nor did he intend it.\nBut the Sacred Law (الشريعة) established it\nFor the people of felicity (أهل السعادة) in its lowliness.\nSo they attained it, and it did not result in a veil (حجاب),\nAnd the Dominant One protected them from its purification.\n\nKnow—may Allah aid us and you—that this poem, and every poem at the beginning of each chapter of this book, is not intended to summarize what will follow in detail in the prose of the chapter and its commentary. Rather, the poetry itself is part of the explanation of that chapter. Therefore, it is not repeated in the discourse that follows the poetry. The poetry should be viewed in the explanation of the chapter just as the prose commentary is viewed. The poetry contains issues pertaining to that chapter that are not present in the prose commentary, and these are usually individual, independent issues, unless there is a link between two issues that causes one to seek the other.\n\nFor example, the human (الإنسان) seeks discourse on the animal (الحيوان) due to the sensation it possesses, and it seeks the plant (النبات) due to the growth and nourishment it possesses, and it seeks the inanimate (الجماد) due to what it possesses that does not sense, such as nails and hair. Thus, it relates to the plant due to its growth, and it relates to the inanimate due to its lack of sensation. There is absolutely nothing in Existence (الوجود) that does not have a connection with something else, even between the Lord (الرب) and the creature (المربوب). For the created seeks the Creator, and the Creator seeks the created. This is why Knowledge (العلم) from the Knower is in the form of the known, and the known emerges in the form of the Knowledge. If it were not so, how could the connection occur? Therefore, complete incompatibility (المنافرة) is absolutely impossible from all perspectives. The issues must necessarily overlap due to the intrinsic connection (الارتباط الذاتي) that exists between all things in Existence. Understand what I have indicated to you regarding this connection, for it reveals a tremendous matter. If you do not realize it, the foot of delusion will slip with you into a pit of destruction.\n\nIt is from here that you understand the meaning of the saying of those who affirm the contingency (حدوث) of the world and those who affirm its eternity (قدم), despite the consensus of both groups that it is contingent and that every part of it is contingent, and that it does not possess the level of the Necessary Existent (واجب الوجود) by itself. Rather, according to some, it is the Necessary Existent by virtue of another—either due to the Essence (الذات) of the Originator, according to some, or due to the precedence of Knowledge of its existence, according to others. Were it not for the validity of the connection we have indicated, the world could not exist at all, and yet it does exist. Thus, the connection exists. Incompatibility and non-incompatibility exist from another perspective.\n\nEvery Divine Reality (حقيقة إلهية) has a ruling in the world that is not shared by another; these are relations (نسب). The relation of the world to the Reality of Knowledge (حقيقة العلم) is different from its relation to the Reality of Power (حقيقة القدرة). The ruling of Knowledge in it has no suitability between it and the object of Power; rather, its suitability is between it and the object of Knowledge. The state of being known differs from the state of being subject to Power. If you view it according to this sequence, you would say there is no suitability between Allah and His servants. But if you look with the other eye, you affirm the relation, for it exists in everything. Therefore, judge according to what you see and what prevails over you at the moment. When the realities become clear to the one with two eyes, let him say what the Sacred Law (الشرع) has permitted him to say, and let him not speak according to his intellect (عقل).\n\nFor among the usages of terms, some are forbidden to us despite the validity of the meaning, and some are permissible to us absolutely despite the corruption of the meaning—such as applying the relation of containment to one who does not accept containment, or the relation of gaining knowledge to one who does not gain knowledge. The usage is sanctioned, but the contradictory aspect is intelligible. Just as the usage of attributing a son was forbidden and placed under the ruling of \"if\" (لو), and just as the changing of the Divine Word was forbidden in His saying: <<مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ>> (The Word is not changed with Me), and placed under \"if.\" Nothing enters under \"if\" except the contingent (الممكن). The intellect indicates the impossibility of a son by rational indication, and it indicates the possibility of guiding all people by rational indication, and it indicates the impossibility of guiding all people due to the precedence of Knowledge regarding difference by rational indication. The word \"if\" (لو) indicates that He is free in Himself: if He wills a certain matter, He wills it, and if He does not will that matter, He does not will it. This has been conveyed by Divine report, yet the intellect deems it impossible.\n\nAllah has commanded us to know Him and made the signs (الآيات) proofs for those of understanding (أولي الألباب). But since they are proofs specifically for Him, the matter of His command to us to know Him is not devoid of the question: Do we follow the indication of the Lawgiver and stop at His report through imitation, or do we follow the path of contemplation so that it becomes intelligible, or do we take from the indication of the intellect what establishes for us His being God, and take from the indication of the Law what we attribute to this God of Names (الأسماء) and rulings (الأحكام)? The latter is the correct approach, for we are commanded to know Him, Exalted is He, both legally and rationally. If it were not so, everyone would say whatever they wished about the Real (الحق) that the intellect deems impossible or possible. Indeed, they have done this even while believing in the Law, entering through interpretation (التأويل) into matters they have no need for. If they had dispensed with them, the intellect would not have demanded it, nor would the Law have questioned them for abandoning it. Rather, the Law questions them for doing it, and they are in danger concerning it. There is no argument against one who remains silent unless speech is obligatory upon him concerning that about which he is silent.\n\nAll that we mentioned in the opening poem is included in this discourse, for all the matters enumerated therein seek Divine Realities (حقائق إلهية) upon which they rely, and they are incompatible with other Divine Realities. Among what this station (منزل) encompasses is the manifestation (تجلي) of the veil (الحجاب) between two unveilings (كشفين), and the manifestation of the unveiling between two veils. No station among the stations encompasses this type of Theophany (التجلي) except this one. For the singular Theophany in the locus of manifestation (المظهر) without intermediacy (بينية) gives what it does not give in intermediacy. And the singular Essential Theophany (التجلي المفرد الذاتي) outside the locus of manifestation gives what it does not give in intermediacy. This Theophany that occurs in intermediacy necessitates confinement between two things. Every confined thing is limited by that which confines it. This is the most astonishing of gnoses (المعارف) on this path: that the Essential Theophany, which possesses absolute freedom (الإطلاق), should be confined. It is like saying that the one sitting is standing while he is sitting. The apparent matter is that this cannot be conceived. Glory be to Him who is exalted above opposites (الأضداد) and yet whose Attributes (أوصافه) accepted them.\n\nThe Prophet, peace and blessings be upon him, said: \"You will see your Lord just as you see the sun at noon (الظهيرة).\"\n\nIf he intended the daytime by this phrase, then he generalized the Essential Theophanies (التجليات الذاتية), even though they differ in the ruling of the Theophany, just as the attribute of His transcendence (تنزيه) by His Name, the Rich, differs from poverty, and the attribute of His transcendence by Oneness (الأحدية) differs from a partner, by His saying: <<وَلَمْ يَكُنْ لَهُ شَرِيكٌ فِي الْمُلْكِ>> (And He has no partner in the dominion). Likewise, the visual Essential Theophanies are like these intellectual Essential Theophanies. If he intended by \"noon\" (الظهيرة) a specific time in the day—which is the clearer meaning in the realized sense and the wording, and upon which this saying should primarily be carried—then the entire day is an Essential Theophany because the sun is manifest in it by its essence. The day reveals it to sight, even though the day is caused by it. Thus, it is manifest by its essence from the beginning of its rising until its setting, and it has a Theophany and a ruling in every minute, known by those who know it and ignored by those who ignore it. Those whose time has extended and who know all of this differentiate between its ruling at its rising and shining, its ruling at its illumination, its ruling at its forenoon (ضحاها), its ruling at its decline (زوالها)—which is the beginning of its covering—its ruling at its afternoon (عصرها), and its ruling at the contraction of its light and the decrease of its authority compared to what it was at the beginning and early part of the day, and its ruling at its setting. Every Theophany, even if Essential, has a ruling that the other does not possess. Everything except the two extremes is an Essential Theophany between two Essential Theophanies. The two extremes, however, are an Essential Theophany immediately following a Veiling Theophany (تجل حجابي), and the other extreme is an Essential Theophany followed by a Veiling Theophany. Thus, it is an Essential Theophany between an Essential Theophany and a Veiling Theophany. We have placed you on the path, so understand from the states of changing solar rulings in these moments and the occurrence of the simile from it at a specific moment, which is noon, and the state of clear weather and the absence of clouds between it and the viewer. Take for yourself the effects of the Essential Theophany in the remaining moments.\n\n### [Indeed, the light spread upon the earth has no existential reality except through the light of sight]\n\nKnow that the light spread upon the earth, which is the ray of the sun traveling through the air, has no existential reality (حقيقة وجودية) except through the light of the sight (نور البصر) that perceives it. When the two eyes—the eye of the sun and the eye of sight—meet, the visible objects are illuminated, and it is said that the sun has spread upon them. This is why that illumination vanishes with the presence of an intervening cloud, because the eye has separated from this other eye due to the presence of the cloud. This is an extremely subtle issue, for I say: If the sun were in the atmosphere, and there were no eye in the world belonging to any living creature that could see, it would have no ray spread upon the earth at all. The light of every created thing is confined to its own essence; nothing else is illuminated by it. The simultaneous existence of our sights and the existence of the sun manifested the spread light. Do you not see how colors change in a single body colored, for example, green or red, when your modes of viewing it change, such as straightness or deviation? How it gives you different sensible colors that you perceive with your sight, yet they have no existence in the body being viewed in the sun? You cannot deny this, especially when the body being viewed is in the sun. You have perceived what has no reality in existence, but is merely a relation (نسبة). Likewise is the light spread upon the earth, and like the changing of the chameleon's color according to the bodies it is upon, gradually, little by little. It is not like a mirror that accepts the image quickly, nor is it a polished body. The perception of its color change is sensible, even though you know that those colors have no existence in the body you are looking at, nor in their immutable essences (أعيانها) in your knowledge.\n\nSimilarly, the world (العالم) perceives God (Allah) in its state of non-existence. Thus, it is non-existent in essence (معدوم العين) yet perceives God, seeing Him, and He brings it into existence due to the penetration of Divine Power (الاقتدار الإلهي) into it. The effusion of essential existence (فيض الوجود العيني) only occurred upon those things seen by God in their state of non-existence. Whoever looks at the existence of the world's attachment to vision in the state of its non-existence—and that is a true vision, no doubt about it—which is called the world, and the Real (الحق) is not described as having not seen it and then seeing it, but rather He has always seen it—whoever affirms eternity (القدم) affirms it from this perspective. And whoever looks at the existence of the world in its essence for itself, and does not consider this state during the Real's vision of it, affirms its contingency (الحدوث).\n\nFrom this, you learn that the cause of the viewer seeing things is not because they are existent, as the Ash'aris held. Rather, the aspect of the Real in this is only the preparedness (استعداد) of the object seen to be seen, whether it is existent or non-existent, for vision relates to it. As for the Mu'tazila, other than the Ash'aris, they stipulated additional conditions for visual perception that are dependent on existence. For this reason, they restricted vision specifically to Knowledge (العلم).\n\nAs for the manifestation of the Essence (تجلى الذات) between two veiling Theophanies (تجليين حجابيين), it is necessary that from that Essential Theophany there appears to the viewer something of the form of the two veils. Thus, that Theophany acts for him like a mirror with which he confronts two forms, seeing the two veils by the light of that Essential Theophany in the mirror of the Essence (مرآة الذات). This is like witnessing poverty while you are transcending the Real from it—Exalted is He, the Rich, the Praiseworthy. If the matter were not so, how could you transcend Him from what is not rationally witnessed by you? This is the form of the veil in the Essence during the Theophany, and a clearer explanation than this is impossible.\n\nWhen the Gnostic (العارف) perceives the form of these two veils, or the form of the veil and the Essential Theophany between which this other Essential Theophany occurs, or perceives the two Essential Theophanies in the locus of the veil (مجلى الحجاب) situated between them, let his remembrance and action ('عمل) be according to what those two forms yield in that locus of manifestation. The reason why one never perceives more than two forms in any Theophany is necessary because the One is impossible to witness in His Oneness (أحديته). Since Oneness is not valid for the human (الإنسان), and he is in the second degree (المرتبة الثانية) of Existence, he possesses duality (الشفعية). For this reason, he only witnesses the two forms in the Theophany, which is the locus of manifestation between them. The viewer never sees anything of the Real, wherever he sees Him, except himself. This Theophany makes you know yourself and know Him.\n\nIf the Theophany is between two veils, the two forms are action. If this is in the world (الدنيا), it is the action of prescribed obligation (تكليف مشروع). If it is in the Hereafter (الآخرة), it is the action of bliss (نعيم) in what is married, worn, eaten, drunk, or enjoyment through conversation, or all of these, or what resembles them, according to the veil. For this reason, when people return from the Theophany in the Hereafter, they return with that form and see their dominion with that form. Bliss occurs through it, and it appears that bliss is related to things, but this is not the case. Rather, the object of bliss is the existence of things or their perception in those veiling forms (الصور الحجابية) that he perceived in the Essential Locus of Manifestation (المجلى الذاتي).\n\nIf the Theophany is a veiling Theophany (تجلي حجابي) between two Essential Theophanies (تجليين ذاتيين)—like the manifestation of the moon between the forenoon and noon, or the manifestation of the night between two days—the two forms in that veiling locus of manifestation are Knowledge (علم), not action. However, they are from the sciences of transcendence (التنزيه). The soul is adorned by it and enjoys spiritual bliss (النعيم المعنوي), and that is its appropriate paradise (جنتها). Understand this.\n\nIf the Essential Theophany is between a veiling and an Essential Theophany, the two forms are the form of Knowledge, not the form of action. The Essential Theophany in the Essential is the form of the Knowledge of transcendence only. The form of the Veiling Theophany within it is the form of the Knowledge of similitude (التشبيه), which is the servant's assumption of the Divine Names (الأسماء الإلهية) and his manifestation in his dominion with the Lordly Attributes (الصفات الربانية). In this station (المقام), the created becomes the creator, manifesting through the rulings of all the Divine Names. This is the level of Vicegerency (الخلافة) and deputyship (النيابة) for the Real in the dominion. Through this, he gains control over existing things actively, through spiritual resolve (الهمة), direct action (المباشرة), and speech (القول). As for spiritual resolve, he wills a thing, and the willed object appears before him exactly as he willed it, without addition or omission. As for speech, he says to what he wills, \"Be!\" (كُنْ), and it is (فَيَكُونُ) that willed object. Or he acts upon it directly if it is an action, like the direct action of Jesus (peace be upon him) with the clay in creating the bird and shaping it as a bird. This is His saying: <<لِمَا خَلَقْتُ بِيَدَيَّ>> (To that which I created with My two hands). For every human has a share in every Divine Presence (حضرة إلهية), for those who understand and know.\n\nIf the Veiling Theophany is between a veiling and an Essential Theophany: the Veiling Theophany within the Veiling is the Knowledge of its connection to the Real from the perspective that it is a proof for Him, a cause originating from Him, that it is upon His form, and the relation of resemblance to Him. As for the form of the Essential Theophany within the Veiling, it is the Knowledge of the Real's manifestation in the attributes of the created: joy, wonder, smiling, the hand, the foot, the eye, the molar, the two hands, the grasp, the right side, and His swearing by created things and by Himself, and His description of Himself with the veils of light and darkness, and His confinement, Exalted is He, of the burning fire behind those luminous and dark veils.\n\nI have confined the station of Theophanies for you to four, and there is absolutely nothing else. Since the Reality in the Divine Theophanies yielded that they only occur in these four in the world, all existing things (الموجودات) are based on the quaternary (التربيع) in their origin to which they return. Every existent must necessarily have in its knowledge either the Knowledge of transcendence (تنزيه) or the Knowledge of similitude (تشبيه), and in its action, either industrial action or spiritual intellectual action. It is not devoid of these four divisions.\n\nLikewise, Nature (الطبيعة) yielded by its essence the ruling of these Theophanies, for existing things only emerged upon the form of these Theophanies. Thus, there was heat (الحرارة), coldness (البرودة), dryness (اليبوسة), and moisture (الرطوبة). These exist in every body in their completeness, except that they may be in the body in equal strength, which is the cause of that body's subsistence. Or they may not be in the body in equal strength, in which case ailments accompany that body, and states of illness change upon it according to the dominance of one over the others. If they become excessive, death occurs. Their excess originates from them, for the cause necessitating their excess only occurs from food eaten by the human or animal. Whatever is dominant in that food or direct action increases the quantity of what suits it in the body: if it is hot, it strengthens the heat, and if it is cold, it strengthens the coldness, and likewise for the rest.\n\nThen, when these four were harmonized, only four appeared, and they only accepted four aspects. For the realities of those four Theophanies yielded that nothing should be harmonized from these four except their weight in number. For this reason, there is incompatibility (منافرة) among them from all aspects, and suitability (مناسبة), as we mentioned in the Divine matters at the beginning of this chapter. That Divine Reality ruled that the world should be in that state, since the known is in the form of the Knowledge, and His Knowledge is His Essence (ذاته). Understand this.\n\nIncompatibility is like heat and coldness, and likewise moisture and dryness. Therefore, heat and coldness never combine in a ruling, nor do moisture and dryness. Allah brought the elements (العناصر) into existence as four through the composition of these natures. Fire (النار) resulted from heat and dryness. Then He did not place next to it what is incompatible with it from all aspects, but rather placed next to it what is suitable from one aspect, even if it differs from another aspect. Air (الهواء) was adjacent to it, being suitable due to heat, even though it was incompatible due to moisture. For intermediacy has an effect and a ruling, as it combines the two extremes, thus strengthening it against their incompatibility. Air is hot and moist. By being hot, it transforms into fire through suitability and the dominance of intermediacy. By being moist, it transforms into water through suitability. Then air was adjacent to water from the lower side. Air accepted the adjacency of fire due to heat, and accepted the adjacency of water due to moisture, even though it was incompatible with it due to coldness, just as air was incompatible with it due to heat. Likewise, He made earth (التراب) adjacent to water due to the coldness that unites their adjacency. Thus, only four emerged from this original principle.\n\nSimilarly, the generated animal body had the effect of fire made into yellow bile (الصفراء), the effect of air into blood (الدم), the effect of water into phlegm (البلغم), and the effect of earth into black bile (السوداء). Thus, the body was composed of four natures. Likewise, the four powers: the attractive, the retentive, the digestive, and the repulsive. Likewise, felicity (السعادة) and wretchedness (الشقاء) were paired with the four directions: the right, the left, the back, and the front. This is because the body does not naturally walk in the upward direction, and the spirit does not naturally walk in the downward direction. The human and the animal are composed of both. Thus, their felicity and wretchedness were only placed in what their nature accepts in their spirit and body, which are the four directions. It is through these that he was addressed, and from these that Iblis approached him, saying: <<ثُمَّ لَآتِيَنَّهُمْ مِنْ بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ وَعَنْ أَيْمَانِهِمْ وَعَنْ شَمَائِلِهِمْ>> (Then I will come upon them from before them and from behind them and from their right and from their left). He did not say \"from above them\" or \"from beneath them\" for the reason we mentioned. Iblis only came to him from the directions that affect his felicity, if he listened to him and accepted what he called him to, and affect his wretchedness, if he did not listen to him and did not accept what he called him to. Glory be to the All-Knowing, the Wise, who orders things according to their ranks.\n\nThe physical celestial world acted similarly, making the constellations (البروج) from which the rulings in the world are derived four: fiery, earthy, airy, and watery. Likewise, He made the mothers of demands four: *Hal* (Is it?), *Ma* (What is it?), *Lam* (Why is it?), and *Kayf* (How is it?). Likewise, the mothers of the Names effective in the world are four: the Knower (العالم), the Willer (المريد), the Powerful (القادر), and the Speaker (القائل). His Knowledge that a thing will exist at a certain time in a certain state, and not otherwise, is impossible. This Knowledge attached the Will (الإرادة) to the determination of that state. The Speaker attached the Power (القدرة) to the bringing into existence of that essence ('عين). Thus, He knew, willed, spoke, and then empowered. The essences manifested from these four. Heat is for Knowledge, dryness is for Will, coldness is for Speech, and moisture is for Power. Heat causes warming, dryness causes drying, moisture causes softening, and coldness causes cooling. Allah the Exalted said: <<وَلَا رَطْبٍ وَلَا يَابِسٍ>> (Nor anything moist nor dry). He mentioned the passive effects without the active causes, because they indicate those from which they were passively affected: dryness was passively affected by heat, and moisture was passively affected by coldness. Look at what these Theophanies yielded by confining them to what we mentioned. Likewise, the world is absolutely felicitous, absolutely wretched, wretched transitioning to felicity, and felicitous transitioning to wretchedness. The states are confined to four. From this are <<الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ>> (The First, the Last, the Manifest, and the Hidden). There is no fifth. These are the descriptive attributes of His relation with the world. The levels of number are four, with no fifth: ones, tens, hundreds, and thousands. Then composition occurs, and their composition is like the composition of the natures due to the existence of the pillars exactly.\n\n### [As long as the full moon is rising, souls are sleeping in the gardens]\n\nKnow, my brother, that on the night I was recording the remainder of this station, among its blessings, I saw the Messenger of Allah (peace and blessings be upon him) lying on his back, saying: \"The servant should see the greatness of Allah in everything, even in wiping over the leather socks and wearing gloves.\" I saw on his feet (peace and blessings be upon him) two new black sandals and on his hands two gloves. It was as if he was pointing to me, pleased with the knowledge I had placed in this station concerning what is due to the Majesty (جلال) of Allah. Then he said: \"As long as the full moon (البدر) is rising, souls are sleeping safely in the gardens (البساتين) and in their castles. But when darkness falls and the full moon does not rise, thieves are feared. Therefore, a person should enter the city, wary of thieves.\"\n\nI understood from this speech that he meant that when the witnessing (شهود) of the Real (الحق) is dominant over the souls, realizing Him and being in Him, for those who enter the gardens of the Gnosis of Allah (معرفة الله) and discourse upon His Majesty in its various forms and numerous arts—He likened the Real to the full moon. He likened the various fruits contained in the gardens to the gnoses (معارف) of the Divine Names and the attributes of Majesty and Glorification contained in the Divine Presence. I understood from his saying in the dream, \"When the full moon is absent\"—meaning the witnessing of the Real in things, presence with Him, and sincere intention toward Him—\"there is the darkness of ignorance (الجهل), heedlessness of Allah, and error, and thieves are feared.\" He meant the misleading ambiguities (الشبه المضلة) that afflict the people of intellectual contemplation and the people of formal unveiling (الكشف الصوري). He mentioned this out of fear for the souls. When they delve deeply into discourse concerning what is due to the Divine Presence, they should \"enter the city,\" meaning they should fortify themselves against that by the manifest Sacred Law (الشرع الظاهر) and adhere to the community (الجماعة), who are the people of the land, for the Hand of Allah is with the community.\n\nThen I saw the Prophet (peace and blessings be upon him) moving with great agitation in all his limbs due to the greatness of the secret knowledge contained in this station. This occurred at night while the full moon was rising, until in the daytime, I saw the full moon shining in the middle of the sky, and a speaker said: \"The Messenger of Allah (peace and blessings be upon him) was never seen in such great agitation due to what came upon him from Allah and what he witnessed.\" I awoke and recorded the vision in this station, rejoicing in what I had seen. Praise be to Allah for that.\n\nThis station encompasses numerous sciences. There is no station that does not contain knowledge that could fill many volumes. I said to my companions that night, \"I only make a single issue from the knowledge contained in the station.\" One of my companions asked me, \"If the matter is so, then alert us to the number of issues it contains by mentioning only their main headings, so that we may know them without detail, for fear of prolixity.\" I said, \"If Allah wills, perhaps I will do that for the remaining stations in this book.\" That night was a blessed night.\n\n### [The Science of Theophany in the Stars]\n\nKnow that this station encompasses the science of Theophany (التجلي) in the stars (النجوم) in their multiplicity, in every single star at one moment with a single vision; the science of the interpenetration of Theophanies; and the science of the Theophany of the follower (التابع) and the followed (المتبوع). Does the follower attain a taste (ذوق) of the Theophany of the followed or not? The followed one (the Messenger) only came to call to Allah, not to call to himself. He said: <<تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا اللَّهَ وَلَا نُشْرِكَ بِهِ شَيْئًا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ>> (Come to a word that is equitable between us and you—that we worship none but Allah and associate nothing with Him, and that none of us take others as lords besides Allah). And he said: <<أَدْعُوا إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي>> (I call to Allah upon clear insight—I and whoever follows me). Thus, he gave the follower a share in the call to Allah.\n\nAny knowledge that a person possesses independently by virtue of being rational, in which he does not need anyone else, such as a Messenger, or anyone to guide him—like the knowledge of the Oneness of Allah (توحيد) and what is incumbent upon Him—as well as what he receives from Divine Effusion (الفيض الإلهي) in unveiling (الكشف) during his solitude and the purification of his soul through noble character: such a person has a share of the Theophany equal to that of the followed one, because he is not merely a follower; rather, he possesses clear insight (بصيرة), either due to a sound rational proof or a realized unveiling (كشف محقق) in which he is like the followed one. However, any person who does not possess this station, and whose knowledge of Allah was taken through faith (إيمان) from the followed one, and upon which he proceeded—and that knowledge is such that it cannot be attained except through the method of the Messenger (peace and blessings be upon him), which is the science of drawing near to Allah (القربات) by virtue of being an act of proximity, not by virtue of being mere knowledge—likewise, physical and spiritual acts performed as acts of proximity are only learned from the followed one. If the Theophany occurs in this station for the possessor of this knowledge, the follower will never catch up to the followed one in it. For the followed one, it is a Solar Theophany (تجلي شمسي), and for the follower, it is a Lunar and Stellar Theophany (تجلي قمري ونجومي). Know this.\n\n### [The Theophany of the Real to the People of Wretchedness in other than the Name 'Lord']\n\nAmong what this station encompasses is the Theophany of the Real (الحق) to the people of wretchedness (أهل الشقاء) in other than the Name 'Lord' (الرب), even though Allah only established the veil (الحجاب) on a specific day and in the Name 'Lord' attributed to them, not in the absolute usage of the Name. Thus, they are in the veil at a specific time concerning a specific Name attributed to them. This does not prevent His Theophany to them in this specific Name outside of that time, and in the absolute Name 'Lord' and in other Names. Allah the Exalted said: <<كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ>> (Nay! Indeed, from their Lord, that Day, they will be veiled). He attributed Him to them \"that Day\" (يومئذ), making it a specific time. Understand this.\n\n### [Bliss through Theophany only occurs for the loving and longing ones]\n\nThis station encompasses the fact that not every Theophany results in bliss (النعيم), and that bliss through Theophany only occurs for the loving and longing ones (المحبين المشتاقين) who have fulfilled the conditions of love. This station encompasses the inwardness (بطون) of the world of witnessing (عالم الشهادة) within the unseen (الغيب), so that what was witnessing returns to being unseen, and what was unseen returns to being witnessing. This is the view held by some Gnostics (العارفين) regarding the creation of the Hereafter (نشأة الآخرة): that bodies (الأجسام) will be inward within the spirits (الأرواح), and the spirits will be manifest containers for them, contrary to their state in the world. Thus, the manifest in the Hereafter will be the spirit, and the ruling will be for the spirit, not the body. For this reason, they will transform into whatever form they wish, due to the dominance of spirituality (الروحية) over them and the unseen nature of the body within it, just as the angels and the world of spirits are for us today: they appear in whatever form they wish.\n\nAmong the stations of the people of unveiling (الكشف) who denied the resurrection of bodies (حشر الأجسام) is that they saw in their unveiling the reality that occurs in the Hereafter. They saw spirits transforming into the forms they desired, but the corporeality contained within those spirits was veiled from them, just as the spirituality contained within bodies is veiled from them in this world. In this world, bodies were graves for the spirits, and in the Hereafter, the spirits are the graves for the bodies. For this reason, they denied bodily resurrection. The complete unveiling (الكشف التام) with which we and our companions have been blessed, here and in the Hereafter, is that we unveiled the spirits here, and the natural bodies dominated them in the manifest form. Nothing of the spirits is seen in the manifest bodies except their effects. Were it not for death and sleep, the non-unveiled person would not know that there is something extra beyond what he witnesses outwardly. Even with the existence of death, stillness, and the body appearing stripped of the effects it once had, one group—the Hashishiyya—adopted the view that there is absolutely nothing behind this manifest form. How would it be for them if there were no death in the world?\n\nThis station encompasses the knowledge of the celestial world (العالم العلوي) and the arrangement of its form in its composition, and that it is contrary to what the masters of astronomy mention. Although what they said is supported by evidence, and it is permissible that Allah might arrange it according to that, He did not do so, even though this arrangement yields what the masters of astronomy held. It encompasses the science of what Allah deposited in the lower world (العالم السفلي) in its arrangement of matters. It encompasses the knowledge of the obligated ones (المكلفين), and from where they were obligated, and what moves them. It encompasses the science of acts of proximity (القربات). It encompasses the science of the reason for the crushing of the arrogant tyrants (الجبابرة المتكبرين) against Allah. It encompasses the inclusion of the animal (الحيوان) with the human (الإنسان) in the knowledge of Allah. It encompasses the science of consequences (العواقب) and what every world has come to. I have mentioned the headings of its issues. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو ترانوے: عالم شہادت (عالم الشهادة) کے وجود کے سبب اور حضرت موسویہ (الحضرة الموسوية) سے عالم غیب (عالم الغيب) کے ظہور کے سبب کی معرفت کا مقام۔\n\nجب سورج کی کوئی شعاع ہوتی ہے\nتو وہ نور میری طرف سے اس کے پاس آتا ہے\n\nجب موت ہر نفس پر وارد ہوتی ہے\nتو وہ موت اس رب کی طرف سے ہے جس نے اسے پیدا کیا\n\nجب جنت الماویٰ (جنة المأوى) اپنی خوبصورتی میں آراستہ ہو کر ہم پر ظاہر ہوتی ہے\n\nتو ہم ان ہواؤں سے لطف اندوز ہوتے ہیں جو اپنے اندر مشک کی خوشبو رکھتی ہیں\n\nاور اگر آسمان کے ستارے ماند پڑ جائیں\nتو یہ ماند پڑنا ہی ان کی چمک کا وارث بنتا ہے\n\nاور اگر نفوس دوسرے نفوس میں داخل ہو جائیں\nتو ان کا داخل ہونا ہی ان کی آرزو ہے\n\nاور ویرانوں کو آباد کرنے والے اس شکار سے بھاگنے والے ہیں جو ان کی مذمت کو فنا کر دیتا ہے\n\nاور اگر رسول ایسے نفوس کو دیکھتے جو ان کے پیغامات کو رد کرتے\nتو وہ ان کے پاس نہ آتے\n\nاور اگر ان پر وہ حجابات پیش کیے جاتے جو جھگڑنے والے لاتے ہیں\nتو وہ ان سے انکار نہ کرتے\n\nاور اگر چلنے والی کشتیاں ایک مدت تک تیرتی رہتیں\nتو وہ اپنی انتہا کو پا لیتیں\n\nاور اگر راتیں اپنی زلفیں لٹکا دیتیں\nتو لوگ ان کے اندھیرے کو نہ چیرتے\n\nاور اگر صبح ایسے چہروں کو دیکھتی جن کے اطراف اس کی روشنی سے منور ہوتے\n\nتو وہ اسے شرمندہ کر دیتی اور وہ ان کے عزم میں مر جاتا، اور ان کی محبت اسے دیوانہ بنا دیتی\n\nاور اگر ہلال چودہ (راتوں) کے بعد بدر بن جاتا\nتو وہ اس کی پیروی نہ کرتا\n\nاور اگر سمندر میٹھا پانی بن جاتے\nتو ان کے علاوہ کوئی اس سے لطف اندوز نہ ہوتا\n\nاور اگر زمینیں ہموار سطح کی ہوتیں\nتو مہیمن (المهيمن) یہ نہ فرماتے کہ اس نے انہیں پھیلایا ہے\n\nاور اس نے اس میں ہر چیز کی زینت ظاہر کی، اور اس میں اس کی حکمت کو پوشیدہ رکھا\n\nاور اگر گھروں میں کوئی مونس ہوتا\nتو اس کا مونس وہ رب ہوتا جس نے اسے بنایا\n\nلیکن میرے نزدیک ایسی ذات سے انس صحیح نہیں جس کی کوئی صفت تم دیکھ سکو\n\nاور اگر بلندیاں پستی میں ہوتیں\nتو ان کی پستی ہی ان کی بلند ترین چوٹی ہوتی\n\nاور اگر پہاڑ بلند ہوتے\nتو ان کی بلندی ان کی وجہ سے ہوتی جس نے انہیں بلند کیا\n\nلیکن بلندی ان کے لیے ایک مقام ہے\nجس سے رب البریہ (رب البرية) نے انہیں نوازا ہے\n\nاور اگر صحیفہ اس کو قید کر لیتا جو اسے قید کرتا ہے\nتو وہ دیکھتا اور اسے مٹا دیتا\n\nاور اگر جہنم ٹھنڈک کے بغیر آگ ہوتی\nتو میں اس کی مرضی پر چلتا\n\nلیکن عذاب ضد کا وجود ہے\nجسے نفس اپنے کیے کے بدلے میں چکھتا ہے\n\nاور اگر محبت کوئی شخص ہوتی\nتو اس کے شوق کی کمزوری اس کی قوت نہ بنتی\n\nاور اگر شارع (شریعت بنانے والا) اس وقت دیکھتا جب وہ (نفس) اپنے محبوب کے ساتھ تنہا ہوتی\nتو شریعت اسے منع نہ کرتی\n\nاور اگر آسمان ستاروں کے بغیر ہوتا\nتو اس کے نور کی چمک کم ہوتی\n\nاور اگر ہوائیں نرمی سے چلتیں\nتو وہ اسے ہلا دیتا اور اس کی نرمی کو ختم کر دیتا\n\nاور اگر پانی گہرائی میں اتر جاتا\nتو اس کے ہاتھ کی نمی دونوں جہانوں کو زندہ کر دیتی\n\nاور اگر بادل اپنی بارش کو کفار سے روک لیتے\nتو ان کی بارش انہیں بے نیاز کر دیتی\n\nاور اگر پہاڑ چلتے\nتو ان کا آسمان ان کی مٹی بن جاتا\n\nاور اگر آنکھیں اس کی چمک کو بغیر حجاب کے دیکھتیں\nتو ان پر اندھا پن چھا جاتا\n\nاور اگر بادشاہ تمہیں آنکھوں سے دیکھتے، جب تم آتے\nتو وہ اپنے تحفے کھول دیتیں\n\nاور اگر کتاب دنیا کے کسی شخص پر ہر تعریف کے ساتھ بولتی\nتو وہ اسے مراد لیتی\n\nاور اگر حملہ آور صبح کے وقت اس پر صحرا میں حملہ کرتا\nتو وہ اسے قیدی نہ بنا پاتا\n\nاور وہ ہلاک کر دینے والے مقامات پر اپنی قوت کی وجہ سے ثابت قدم رہتا\nجب کوئی معاملہ اسے پیش آتا\n\nمیں نے سبع مثانی (سورۃ الفاتحہ) کی قسم کھائی ہے\nاور حروف کی سورتوں میں سے طہٰ (طاها) کی آنکھ کی\n\nمیں نے سورج کی آنکھ کو دیکھا ہے کہ وہ نگاہوں سے چھپ جاتی ہے\nجب وہ اپنی نمی دیتی ہے\n\nتو تم اس کی فضا کو بادلوں کے ہاتھوں میں دیکھتے ہو\nاور اس کی زمین کو دیکھتے ہو کہ اس کی پہاڑیاں چمک رہی ہیں\n\nاور وہ اپنی خوبصورتی اندھی آنکھوں کے لیے ظاہر کرتی ہے\nاور اس کی نگاہ ہم سے اس کی مشقت کو چھپاتی ہے\n\nاور جب کہا گیا کہ وہ کوچ کر گئی اور غائب ہو گئی\nاور اپنا خلیفہ اپنے بھائی کو چھوڑ گئی\n\nمیں نے اس کے قاصد کو جواب دیا جب وہ میرے پاس آیا\nتاکہ وہ مجھ سے زبانی بات کرنے کا سوال کرے\n\nتو میں نے کہا کہ میرے لیے پردہ بہتر ہے\nکیونکہ میں نے اپنی آنکھ کی فنا اس کی فنا میں دیکھی ہے\n\nاس نے کسی بغض کی وجہ سے کوچ نہیں کیا\nبلکہ یہ اس ہانکنے والے کی وجہ سے تھا جس نے اسے ہانکا\n\nیہ ایک حکم اور توجہ کا جواب تھا\nجس کی پیروی مہیمن (المهيمن) کے جود (سخاوت) نے کی\n\nتو سب اس کے محتاج ہو گئے\nاور کائنات اس کے ہانکنے کی خواہش کرنے لگی\n\nکتنے ہی گڑھے تھے جن میں میں تھا\nاور اگر وہ نہ ہوتی تو میں ان کے کنارے پر جھک جاتا\n\nایک ایسی شہوت کی بیماری کے لیے، اگر عیسیٰ (علیہ السلام) کی تائید کرنے والے طبیب ہوتے\nتو وہ اسے شفا نہ دے پاتے۔\n\nاور کتنے ہی لقمے میں نے حرص سے کھائے، اس کی شہوت کے لیے\nلیکن وہ اپنی انتہا کو نہ پہنچا\n\nاور کتنی ہی شہوتوں نے ہماری طرف دیکھا، اور جب ہم نے انہیں حاصل کیا\nتو اس نے ہمیں ان کی اذیت سے بچا لیا\n\nاور ہمارے نفس نے کبھی اس کی نیت نہیں کی تھی\nاور عقل نے اس کی نیت کو چھپا رکھا تھا\n\nاس خوف سے کہ نفوس اس کا مطالبہ کریں گے\nاور عقل اس کی بے رخی سے ڈرتی ہے\n\nاور نہ ہی وہ کبھی اس کے خیال میں آئی\nاور نہ ہی اس نے اس پر حکم لگایا اور نہ ہی اس کی نیت کی\n\nلیکن شریعت نے اسے اہل سعادت کے لیے اس کی پستی میں ثابت کر دیا\n\nتو انہوں نے اسے حاصل کیا اور اس کے بعد کوئی حجاب نہیں آیا\nاور مہیمن (المهيمن) نے انہیں اس کی پاکیزگی سے محفوظ رکھا۔\n\n***\n\nجان لو، اللہ تعالیٰ ہماری اور تمہاری تائید فرمائے، کہ اس قصیدے اور اس کتاب کے ہر باب کے شروع میں موجود ہر قصیدے کا مقصد اس تفصیل کا خلاصہ بیان کرنا نہیں ہے جو باب کے نثر میں آئے گی اور جس پر کلام کیا جائے گا، بلکہ شعر بذات خود اس باب کی شرح کا ایک حصہ ہے۔ لہٰذا یہ اس کلام میں دہرایا نہیں جائے گا جو شعر کے بعد آئے گا۔ پس شعر کو باب کی شرح میں اسی طرح دیکھا جائے جس طرح نثر کو اس پر کلام میں دیکھا جاتا ہے۔ شعر میں اس باب کے وہ مسائل شامل ہیں جو نثر کے ذریعے کلام میں موجود نہیں ہیں، اور یہ انفرادی مسائل ہیں جو عموماً بذات خود مستقل ہوتے ہیں، مگر یہ کہ دو مسائل کے درمیان کوئی ربط ہو جو ایک دوسرے کا تقاضا کرے۔ جیسے انسان، وہ حیوان پر کلام کا تقاضا کرتا ہے کیونکہ اس میں احساس پایا جاتا ہے، اور نباتات پر کلام کا تقاضا کرتا ہے کیونکہ اس میں نشوونما اور غذا پائی جاتی ہے، اور جمادات پر کلام کا تقاضا کرتا ہے کیونکہ اس میں وہ چیزیں ہیں جو محسوس نہیں ہوتیں جیسے ناخن اور بال۔ پس وہ نباتات سے اپنی نشوونما کی وجہ سے متعلق ہوتا ہے اور جمادات سے اپنے عدم احساس کی وجہ سے متعلق ہوتا ہے۔ اور ہستی (الوجود) میں کوئی بھی چیز ایسی نہیں ہے جس کا کسی دوسری چیز سے بالکل کوئی تعلق نہ ہو، یہاں تک کہ رب اور مربوب (پروردہ) کے درمیان بھی۔ کیونکہ مخلوق خالق کا تقاضا کرتی ہے اور خالق مخلوق کا تقاضا کرتا ہے۔ اسی لیے عالم (جاننے والے) کا علم معلوم کی صورت پر تھا، اور معلوم علم کی صورت پر ظاہر ہوا۔ اگر ایسا نہ ہوتا تو تعلق کہاں سے پیدا ہوتا؟ لہٰذا تمام پہلوؤں سے مکمل منافرت (نفرت) بالکل صحیح نہیں ہو سکتی۔ پس مسائل کا آپس میں داخل ہونا ضروری ہے، اس ذاتی ربط کی وجہ سے جو تمام اشیاء کے درمیان ہستی (الوجود) میں موجود ہے۔ پس اس ربط کے بارے میں جو کچھ میں نے تمہیں اشارہ کیا ہے اسے سمجھو، کیونکہ یہ ایک عظیم امر کی خبر دیتا ہے۔ اگر تم اسے متحقق نہ کرو گے تو غرور کا قدم تمہیں ہلاکت کے گڑھے میں پھسلا دے گا۔ کیونکہ یہیں سے تم اس قول کا معنی جانو گے جس نے عالم کے حادث ہونے کا کہا اور جس نے عالم کے قدیم ہونے کا کہا، حالانکہ دونوں فریقوں کا اس بات پر اجماع ہے کہ یہ ممکن ہے اور اس کا ہر جز حادث ہے، اور اس کے لیے واجب الوجود بنفسہ کا مرتبہ نہیں ہے۔ بلکہ یہ بعض کے نزدیک واجب الوجود بغیرہ ہے، یا تو موجد کی ذات کی وجہ سے بعض کے نزدیک، یا دوسروں کے نزدیک اس کے وجود کے بارے میں سابقہ علم کی وجہ سے۔ اور اگر اس ربط کی صحت نہ ہوتی جس کی طرف ہم نے اشارہ کیا ہے، تو عالم کا وجود ہی صحیح نہ ہوتا، حالانکہ وہ موجود ہے۔ پس ربط موجود ہے، اور منافرت اور عدم منافرت دوسرے پہلو سے ہے۔ پس ہر حقیقت الٰہیہ کا عالم میں ایک حکم ہے جو دوسری کے لیے نہیں ہے، اور یہ نسبتیں ہیں۔ پس عالم کی نسبت حقیقت علم کی طرف اس کی نسبت حقیقت قدرت کی طرف سے مختلف ہے۔ پس اس میں علم کا حکم مقدور کے ساتھ کوئی مناسبت نہیں رکھتا، بلکہ اس کی مناسبت معلوم کے ساتھ ہے۔ اور اس کا معلوم ہونا اس کے مقدور ہونے سے مختلف ہے۔ پس جب تم اسے اس ترتیب سے دیکھو گے تو کہو گے کہ اللہ اور اس کے بندوں کے درمیان کوئی مناسبت نہیں ہے، اور جب تم دوسری آنکھ سے دیکھو گے تو نسبت کو ثابت کرو گے، کیونکہ وہ سب میں موجود ہے۔ پس تم اس کے مطابق حکم کرو جو تم دیکھتے ہو اور جو تم پر اس وقت غالب ہوتا ہے۔ اور جب حقائق دو آنکھوں والے کے لیے واضح ہو جائیں، تو اسے وہی کہنا چاہیے جو شریعت نے اس کے لیے مقرر کیا ہے، اور اپنی عقل سے نہیں کہنا چاہیے۔ کیونکہ الفاظ کے اطلاق میں سے کچھ ایسے ہیں جن سے ہمیں روکا گیا ہے، باوجود اس کے کہ معنی صحیح ہے، اور کچھ ایسے ہیں جو ہمیں مطلقاً مباح ہیں، باوجود اس کے کہ معنی فاسد ہے۔ جیسے ظرفیت کی نسبت اس کی طرف کرنا جو ظرفیت قبول نہیں کرتا، اور علم کے استفادے کی نسبت اس کی طرف کرنا جو علم کا استفادہ نہیں کرتا۔ پس اطلاق مشروع ہے اور مخالف پہلو معقول ہے۔ جیسا کہ ولد (بیٹے) کی نسبت کے اطلاق سے روکا گیا اور اسے \"لو\" (اگر) کے حکم کے تحت داخل کیا گیا، اور جیسا کہ اللہ تعالیٰ کے قول \"مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ\" (میرے ہاں بات بدلی نہیں جاتی) میں قول الٰہی کو بدلنے سے روکا گیا اور اسے \"لو\" کے تحت داخل کیا گیا۔ اور \"لو\" کے تحت صرف ممکن ہی داخل ہوتا ہے۔ اور عقل ولد کے معاملے میں عقلی دلیل سے محال ہونے پر دلالت کرتی ہے، اور تمام لوگوں کی ہدایت کے امکان پر عقلی دلیل سے دلالت کرتی ہے، اور علم میں اختلاف کے سبق کی وجہ سے تمام لوگوں کی ہدایت کے محال ہونے پر عقلی دلیل سے دلالت کرتی ہے۔ اور لفظ \"لو\" اس بات پر دلالت کرتا ہے کہ وہ اپنی ذات میں مختار ہے، اگر چاہے تو کسی چیز کا ارادہ کرے اور اگر چاہے تو اس چیز کا ارادہ نہ کرے۔ اور یہ بات خبر الٰہی سے وارد ہوئی ہے اور عقل اسے محال قرار دیتی ہے۔ اور اللہ نے ہمیں اس کا علم حاصل کرنے کا حکم دیا ہے اور آیات کو عقل والوں کے لیے دلائل بنایا ہے۔ لیکن چونکہ وہ خاص طور پر اسی پر دلائل ہیں، تو ہمیں اس کے علم کے بارے میں اس کے حکم میں یہ معاملہ خالی نہیں ہے کہ کیا ہم اس میں شارع کی دلالت اور اس کی خبر پر تقلیداً رک جائیں، یا ہم نظر و فکر کا طریقہ اختیار کریں تاکہ وہ معقول ہو جائے، یا ہم عقل کی دلالت سے وہ لیں جس سے ہمارے نزدیک اس کا الٰہ ہونا ثابت ہو جائے، اور شریعت کی دلالت سے وہ لیں جو ہم اس الٰہ کے اسماء و احکام میں شامل کریں؟ پس ہم اس کے علم کے بارے میں شرعاً اور عقلاً مامور ہوں گے، اور یہی صحیح ہے۔ کیونکہ شریعت عقل کے بغیر ثابت نہیں ہوتی۔ اور اگر ایسا نہ ہوتا تو ہر کوئی ذات حق (الحق) کے بارے میں وہ کچھ کہتا جو عقلیں محال قرار دیتی ہیں اور جو محال نہیں قرار دیتیں۔ اور انہوں نے شریعت پر ایمان کے باوجود ایسا کیا ہے اور تاویل کے ذریعے ایسے امور میں داخل ہوئے ہیں جن کی انہیں ضرورت نہیں تھی۔ اور اگر وہ ان سے بے نیاز ہو جاتے تو عقل ان سے اس کا مطالبہ نہ کرتی اور نہ ہی شریعت ان سے اس کے ترک کے بارے میں سوال کرتی، بلکہ شریعت ان سے اس کے فعل کے بارے میں سوال کرے گی اور وہ اس میں خطرے میں ہیں۔ اور خاموش رہنے والے پر کوئی حجت نہیں ہے، مگر جب اس پر اس معاملے میں بات کرنا واجب ہو جس میں وہ خاموش رہا۔ اور اس کلام میں وہ سب کچھ شامل ہو گیا ہے جو ہم نے باب کے شروع میں قصیدے میں ذکر کیا ہے، کیونکہ اس میں شمار کی گئی تمام چیزیں الٰہی حقائق کا تقاضا کرتی ہیں جن پر وہ مستند ہیں اور الٰہی حقائق سے منافرت رکھتی ہیں۔ پس اس مقام (منزل) میں جو چیزیں شامل ہیں ان میں دو کشفوں (الکشف) کے درمیان حجاب کا ظہور الٰہی (التجلی) اور دو حجابوں کے درمیان کشف (الکشف) کا ظہور الٰہی (التجلی) ہے۔ اور مقامات (منازل) میں کوئی مقام ایسا نہیں ہے جو اس قسم کے ظہور الٰہی (التجلی) کو شامل ہو سوائے اس مقام کے۔ کیونکہ مظہر میں انفرادیت کے ساتھ ظہور الٰہی (التجلی) بغیر بینیت (درمیانی حالت) کے وہ کچھ دیتا ہے جو بینیت میں نہیں دیتا، اور غیر مظہر میں انفرادی ذاتی ظہور الٰہی (التجلی) وہ کچھ دیتا ہے جو بینیت میں نہیں دیتا۔ اور یہ ظہور الٰہی (التجلی) جو بینیت میں واقع ہوتا ہے، دو چیزوں کے درمیان حصر (محدودیت) دیتا ہے، اور ہر محصور اس سے محدود ہوتا ہے جس نے اسے محدود کیا۔ اور یہ اس راستے کی سب سے عجیب معرفتوں میں سے ہے کہ وہ ذاتی ظہور الٰہی (التجلی الذاتی) جو اطلاق رکھتا ہے، محصور ہو۔ پس یہ ایسا ہی ہے جیسے بیٹھے ہوئے شخص کے بارے میں کہا جائے کہ وہ کھڑا ہے۔ پس ظاہر امر یہ ہے کہ اس کا تصور نہیں کیا جا سکتا۔ پس پاک ہے وہ ذات جو اضداد سے منزہ ہے اور اس کی صفات نے انہیں قبول کر لیا۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"تم اپنے رب کو اسی طرح دیکھو گے جس طرح تم دوپہر کے وقت سورج کو دیکھتے ہو۔\" (تَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ الشَّمْسَ بِالظَّهِيرَةِ)\n\nپس اگر آپ صلی اللہ علیہ وسلم نے اس لفظ سے دن مراد لیا ہے، تو اس میں ذاتی ظہور الٰہی (التجلیات الذاتية) شامل ہیں، اگرچہ ظہور الٰہی (التجلی) کے حکم میں اختلاف ہو، جیسے اس کے نام الغنی (بے نیاز) کے ذریعے فقر سے اس کی تنزیہ کی صفت کا اختلاف، اور اس کے قول \"وَلَمْ يَكُن لَّهُ شَرِيكٌ فِي الْمُلْكِ\" (اور بادشاہی میں اس کا کوئی شریک نہیں) کے ذریعے احدیت کے ساتھ شریک سے اس کی تنزیہ کی صفت کا اختلاف۔ اسی طرح بصری ذاتی ظہور الٰہی (التجلیات الذاتية) بھی ان عقلی ذاتی ظہور الٰہی (التجلیات الذاتية) کی طرح ہیں۔ اور اگر آپ صلی اللہ علیہ وسلم نے ظہیرہ (دوپہر) سے دن کا کوئی خاص وقت مراد لیا ہے، اور محقق معنی اور لفظ میں یہی زیادہ ظاہر ہے، اور اس قول کو اسی پر محمول کرنا زیادہ بہتر ہے، کیونکہ پورا دن ذاتی ظہور الٰہی (تجلی ذاتی) ہے، اس لیے کہ سورج اس میں اپنی ذات کے ساتھ ظاہر ہوتا ہے۔ اگرچہ دن سورج کا معلول ہے، لیکن وہ اپنے طلوع کے آغاز سے لے کر غروب ہونے تک اپنی ذات کے ساتھ ظاہر ہوتا ہے، اور ہر منٹ میں اس کا ایک ظہور الٰہی (تجلی) اور حکم ہوتا ہے، جسے جاننے والا جانتا ہے اور نہ جاننے والا نہیں جانتا۔ اور جو شخص ان سب کو جانتا ہے، اس کا زمانہ دراز ہو چکا ہے، پس وہ اس کے طلوع اور شروق کے حکم، اس کے اشراق کے حکم، اس کے چاشت کے حکم، اس کے زوال کے حکم (جو اس کے چھپنے کا آغاز ہے)، اس کے عصر کے حکم، اور اس کی روشنی کے سمٹنے اور اس کی سلطنت کے کم ہونے کے حکم میں فرق کرتے ہیں، اس کے مقابلے میں جو دن کے آغاز اور صدر میں تھا۔ اور اس کے غروب کے وقت کا حکم۔ اور ہر ظہور الٰہی (تجلی) کا، اگرچہ وہ ذاتی ہو، ایک حکم ہے جو دوسرے کے لیے نہیں ہے۔ پس دونوں کناروں کے علاوہ جو کچھ ہے، وہ دو ذاتی ظہور الٰہی (تجلیین ذاتین) کے درمیان ذاتی ظہور الٰہی (تجلی ذاتی) ہے، سوائے دونوں کناروں کے۔ ایک کنارہ حجابی ظہور الٰہی (تجلی حجابی) کے بعد ذاتی ظہور الٰہی (تجلی ذاتی) ہے، اور دوسرا کنارہ ذاتی ظہور الٰہی (تجلی ذاتی) ہے جس کے بعد حجابی ظہور الٰہی (تجلی حجابی) آتا ہے۔ پس یہ ایک ذاتی ظہور الٰہی (تجلی ذاتی) ہے جو ایک ذاتی اور ایک حجابی ظہور الٰہی (تجلی) کے درمیان ہے۔ ہم نے تمہیں راستے پر ڈال دیا ہے، پس ان لمحات میں شمسی احکام کی تبدیلی کی حالتوں سے سمجھو، اور ایک خاص لمحے میں تشبیہ کا واقع ہونا، جو کہ ظہیرہ (دوپہر) ہے، اور دیکھنے والے کے درمیان صاف موسم اور بادل کا نہ ہونا۔ اور تم باقی لمحات میں ذاتی ظہور الٰہی (التجلی الذاتی) کے آثار کو لے لو۔\n\n### [زمین پر پھیلے ہوئے نور کی کوئی حقیقی ہستی (وجودية) نہیں ہے مگر بصارت کے نور کے ساتھ]\n\nپس جان لو کہ زمین پر پھیلا ہوا نور جو ہوا میں سرایت کرنے والی سورج کی شعاع سے ہے، اس کی کوئی حقیقی ہستی (وجودية) نہیں ہے مگر اس بصارت کے نور کے ساتھ جو اسے ادراک کرتی ہے۔ پس جب دونوں آنکھیں، سورج کی آنکھ اور بصارت کی آنکھ، جمع ہوتی ہیں تو مبصرات روشن ہو جاتے ہیں اور کہا جاتا ہے کہ سورج ان پر پھیل گیا ہے۔ اسی لیے حائل بادل کے وجود سے وہ چمک زائل ہو جاتی ہے، کیونکہ آنکھ بادل کے وجود کی وجہ سے اس دوسری آنکھ سے جدا ہو گئی ہے۔ اور یہ ایک انتہائی پیچیدہ مسئلہ ہے، کیونکہ میں کہتا ہوں کہ اگر سورج آسمان کی فضا میں ہوتا اور عالم میں کسی حیوان کی کوئی آنکھ دیکھنے والی نہ ہوتی، تو زمین پر اس کی کوئی پھیلی ہوئی شعاع بالکل نہ ہوتی۔ کیونکہ ہر مخلوق کا نور اس کی ذات تک محدود ہوتا ہے، کوئی دوسرا اس سے روشن نہیں ہوتا۔ پس ہماری بصارتوں کا وجود اور سورج کا وجود دونوں نے مل کر پھیلے ہوئے نور کو ظاہر کیا۔ کیا تم نہیں دیکھتے کہ ایک ہی جسم میں جو مثلاً سبز یا سرخ رنگ سے رنگا ہوا ہو، رنگ کیسے بدل جاتے ہیں، جب تمہاری طرف سے اسے دیکھنے کے طریقے مختلف ہوتے ہیں، جیسے سیدھا دیکھنا یا ٹیڑھا دیکھنا؟ یہ تمہیں مختلف محسوس رنگ کیسے دیتا ہے جنہیں تم اپنی بصارت سے ادراک کرتے ہو، حالانکہ سورج میں دیکھے جانے والے جسم میں ان کا کوئی وجود نہیں ہوتا؟ اور تم اس کا انکار نہیں کر سکتے، خاص طور پر جب جسم سورج میں دیکھا جا رہا ہو۔ پس تم نے اس چیز کا ادراک کیا جس کا حقیقت میں کوئی وجود نہیں ہے، بلکہ وہ ایک نسبت ہے۔ اسی طرح زمین پر پھیلا ہوا نور ہے۔ اور جیسے گرگٹ کا رنگ بدلنا، جو وہ اجسام پر تدریجاً، ایک کے بعد ایک، اختیار کرتا ہے۔ وہ آئینے کی طرح نہیں ہے کہ تصویر کو تیزی سے قبول کرے، اور نہ ہی وہ کوئی چمکدار جسم ہے۔ اور اس کے رنگوں میں تبدیلی کا ادراک محسوس ہوتا ہے، باوجود اس کے کہ تم جانتے ہو کہ وہ رنگ اس جسم میں موجود نہیں ہیں جسے تم دیکھ رہے ہو، اور نہ ہی تمہارے علم میں ان کی اپنی حقیقت ہے۔ اسی طرح عالم عدم کی حالت میں اللہ کا ادراک کرنے والا ہے۔ پس وہ معدوم العین (آنکھ کے اعتبار سے معدوم) ہے، جو اللہ کا ادراک کرتا ہے، اسے دیکھتا ہے اور اسے موجود کر دیتا ہے، اس میں اقتدار الٰہی (الاقتدار الإلهي) کے نفوذ کی وجہ سے۔ پس وجود عینی کا فیض اللہ کے لیے ان مرئیات پر ان کے عدم کی حالت میں ہی واقع ہوا۔ پس جس نے عالم کے عدم کی حالت میں اس کے رؤیت کے تعلق کے وجود کو دیکھا، اور یہ کہ وہ ایک حقیقی رؤیت ہے جس میں کوئی شک نہیں، اور اسی کو عالم کہا جاتا ہے، اور ذات حق (الحق) اس صفت سے متصف نہیں ہے کہ وہ اسے نہیں دیکھتا تھا اور پھر دیکھا، بلکہ وہ ہمیشہ سے اسے دیکھتا رہا ہے۔ پس جس نے قدم (قدیم ہونے) کا قول کیا، اس نے یہیں سے کہا۔ اور جس نے عالم کے وجود کو اس کی اپنی آنکھ میں دیکھا، اور ذات حق (الحق) کے اسے دیکھنے کی حالت میں اس کے لیے یہ حالت نہیں تھی، اس نے اس کے حادث ہونے کا قول کیا۔ اور یہیں سے تم جانتے ہو کہ دیکھنے والے کے لیے اشیاء کو دیکھنے کی علت یہ نہیں ہے کہ وہ موجود ہیں، جیسا کہ اشاعرہ میں سے بعض کا خیال ہے، بلکہ اس میں ذات حق (الحق) کا پہلو یہ ہے کہ مرئی میں دیکھے جانے کا استعداد موجود ہو، خواہ وہ موجود ہو یا معدوم، کیونکہ رؤیت اس سے متعلق ہوتی ہے۔ اور اشاعرہ کے علاوہ معتزلہ نے بصری رؤیت میں اس سے زائد امور کی شرط لگائی ہے جو وجود کے تابع ہیں، اور اسی لیے انہوں نے رؤیت کو خاص طور پر علم کی طرف پھیر دیا۔\n\nجہاں تک ذات کا ظہور الٰہی (تجلی الذات) دو حجابی ظہور الٰہی (تجلیین حجابین) کے درمیان ہے، تو ضروری ہے کہ اس ذاتی ظہور الٰہی (التجلی الذاتی) میں دونوں حجابوں کی صورتوں میں سے کوئی امر دیکھنے والے کے لیے ظاہر ہو، اور وہ ظہور الٰہی (التجلی) اس کے لیے آئینے کی طرح ہو جس سے وہ دو صورتوں کا مقابلہ کرے، اور وہ ذات کے آئینے میں اس ذاتی ظہور الٰہی (التجلی الذاتی) کے نور سے دونوں حجابوں کو دیکھے، جیسا کہ تم فقر کا مشاہدہ کرتے ہو جب تم ذات حق (الحق) کو اس سے منزہ کرتے ہو، وہ سبحانہ الغنی الحمید (بے نیاز، قابل تعریف) ہے۔ اور اگر معاملہ ایسا نہ ہوتا، تو تم اسے اس چیز سے کیسے منزہ کرتے جو تمہارے لیے عقلی طور پر مشہود نہیں ہے؟ پس ظہور الٰہی (التجلی) کے وقت ذات میں حجاب کی صورت ایسی ہی ہوتی ہے، اور اس سے زیادہ واضح ممکن نہیں ہے۔ پس جب عارف ان دونوں حجابوں کی صورت کو ادراک کر لے، یا حجاب اور ذاتی ظہور الٰہی (التجلی الذاتی) کی صورت کو، جس کے درمیان یہ دوسرا ذاتی ظہور الٰہی (التجلی الذاتی) ہے، یا حجاب کے مجلیٰ (مظہر) میں واقع ہونے والے دو ذاتی ظہور الٰہی (التجلیین الذاتین) کو ادراک کر لے، تو اس کا ذکر اور عمل اس کے مطابق ہونا چاہیے جو وہ دونوں صورتیں اس مجلیٰ میں دیتی ہیں۔ اور اس کی علت یہ ہے کہ ظہور الٰہی (التجلی) میں، خواہ وہ کوئی بھی ظہور الٰہی (تجلی) ہو، ہمیشہ دو صورتوں کا ادراک ہوتا ہے جو ضروری ہیں، کیونکہ واحد کے لیے اپنی احدیت میں مشاہدہ کرنا محال ہے۔ اور چونکہ انسان کے لیے احدیت صحیح نہیں ہے، اور وہ وجود کے دوسرے مرتبے میں ہے، اس لیے اس کے لیے شفعیت (دوئی) ہے۔ اسی لیے وہ ظہور الٰہی (التجلی) میں صرف دو صورتوں کا مشاہدہ کرتا ہے، جس کے درمیان وہ مجلیٰ (مظہر) ہے۔ پس دیکھنے والا ذات حق (الحق) میں جہاں بھی اسے دیکھتا ہے، ہمیشہ اپنی ذات کو ہی دیکھتا ہے۔ پس یہ ظہور الٰہی (التجلی) تمہیں تمہاری ذات اور اس کی ذات سے متعارف کراتا ہے۔ اگر ظہور الٰہی (التجلی) دو حجابوں کے درمیان ہو، تو دونوں صورتیں عمل ہوں گی، اگر دنیا میں ہو تو وہ مشروع تکلیف کا عمل ہو گا، اور اگر آخرت میں ہو تو وہ منکوحہ، ملبوس، ماکول، مشروب، یا گفتگو سے تفریح، یا یہ سب، یا اس سے ملتی جلتی چیزوں میں نعمت کا عمل ہو گا، حجاب کے مطابق۔ اسی لیے جب لوگ آخرت میں ظہور الٰہی (التجلی) سے واپس آئیں گے، تو وہ اسی صورت کے ساتھ واپس آئیں گے اور اپنی بادشاہت کو اسی صورت میں دیکھیں گے، اور اسی سے نعمت واقع ہو گی، اور یہ ظاہر ہو گا کہ نعمت اشیاء سے متعلق ہے، حالانکہ ایسا نہیں ہے۔ بلکہ نعمت کا تعلق اشیاء کے وجود یا ان حجابی صورتوں پر ان کے ادراک سے ہے جنہیں اس نے ذاتی مجلیٰ (مظہر) میں ادراک کیا تھا۔\n\nاور اگر ظہور الٰہی (التجلی) دو ذاتی ظہور الٰہی (تجلیین ذاتین) کے درمیان حجابی ظہور الٰہی (تجلی حجابی) ہو، جیسے چاشت اور دوپہر کے درمیان چاند کا ظہور الٰہی (تجلی) اور دو دنوں کے درمیان رات کا ظہور الٰہی (تجلی)، تو اس حجابی مجلیٰ (مظہر) میں دونوں صورتیں علم ہوں گی، عمل نہیں، لیکن تنزیہ کے علوم میں سے ہوں گی، پس نفس اس سے آراستہ ہو گا اور معنوی نعمت سے لطف اندوز ہو گا، اور وہ اس کی مناسب جنت ہو گی۔ پس سمجھو۔\n\nاور اگر ذاتی ظہور الٰہی (التجلی الذاتی) ایک حجابی اور ایک ذاتی ظہور الٰہی (تجلی) کے درمیان ہو، تو دونوں صورتیں علم کی صورت ہوں گی، عمل کی صورت نہیں۔ پس ذاتی میں ذاتی ظہور الٰہی (التجلی الذاتی) صرف تنزیہ کے علم کی صورت ہے، اور اس میں حجابی ظہور الٰہی (التجلی الحجابی) کی صورت تشبیہ کے علم کی صورت ہے، اور وہ بندے کا اسماء الٰہیہ سے متخلق ہونا اور اپنی بادشاہت میں صفات ربانیہ کے ساتھ ظاہر ہونا ہے۔ اور اس مقام پر مخلوق خالق ہوتا ہے اور تمام اسماء الٰہیہ کے احکام کے ساتھ ظاہر ہوتا ہے۔ اور یہ بادشاہت میں ذات حق (الحق) کی خلافت اور نیابت کا مرتبہ ہے، اور اسی سے اسے موجودات میں بالفعل ہمت، براہ راست عمل اور قول کے ذریعے تصرف حاصل ہوتا ہے۔ جہاں تک ہمت کا تعلق ہے، تو وہ کسی چیز کا ارادہ کرتا ہے تو وہ مراد اس کے سامنے اسی طرح مجسم ہو جاتی ہے جیسا کہ اس نے ارادہ کیا تھا، بغیر کسی کمی بیشی کے۔ اور جہاں تک قول کا تعلق ہے، تو وہ جس چیز کا ارادہ کرتا ہے اسے \"كُنْ فَيَكُونُ\" (ہو جا، تو وہ ہو جاتی ہے) کہتا ہے، یا اگر وہ عمل ہو تو وہ خود اس کا براہ راست عمل کرتا ہے، جیسے عیسیٰ (علیہ السلام) کا پرندے کی تخلیق میں مٹی کو براہ راست استعمال کرنا اور اسے پرندے کی صورت دینا، اور یہ اس کا قول ہے: \"لِمَا خَلَقْتُ بِيَدَيَّ\" (جسے میں نے اپنے دونوں ہاتھوں سے پیدا کیا)۔ پس ہر الٰہی حضوری (حضرة إلهية) میں انسان کے لیے ایک حصہ ہے، اس کے لیے جو عقل رکھتا ہے اور جانتا ہے۔\n\nاور اگر حجابی ظہور الٰہی (التجلی الحجابی) ایک حجابی اور ایک ذاتی ظہور الٰہی (تجلی) کے درمیان ہو، تو حجابی میں حجابی ظہور الٰہی (التجلی الحجابی) ذات حق (الحق) کے ساتھ اس کے تعلق کا علم ہے، اس لحاظ سے کہ وہ اس پر دلیل ہے اور اس سے سبب ہے، اور یہ کہ وہ اس کی صورت پر ہے اور اس سے مشابہت کی نسبت رکھتا ہے۔ اور جہاں تک حجابی میں ذاتی ظہور الٰہی (التجلی الذاتی) کی صورت کا تعلق ہے، تو وہ مخلوق کی صفات میں ذات حق (الحق) کے ظہور الٰہی (تجلی) کا علم ہے، جیسے خوشی، تعجب، مسکراہٹ، ہاتھ، قدم، آنکھ، داڑھ، دونوں ہاتھ، مٹھی، دایاں ہاتھ، اور مخلوق کی مخلوقات کے ساتھ اور اپنی ذات کے ساتھ قسم کھانا، اور نور اور ظلمت کے حجابوں سے متصف ہونا، اور ان نوری اور ظلمتی حجابوں کے پیچھے جلانے والے (اللہ) کا حصر (محدودیت)۔ اور میں نے تمہارے لیے ظہور الٰہی (التجلیات) کے مقام کو چار میں محدود کر دیا ہے، اور اس کے علاوہ وہاں کوئی اور نہیں ہے۔ اور چونکہ الٰہی ظہور الٰہی (التجلیات الإلهية) میں حقیقت نے یہ دیا کہ وہ عالم میں صرف ان چار میں ہی ہوں گے، تو تمام موجودات اپنی اصل میں، جس کی طرف وہ لوٹتے ہیں، مربع (چار) پر تھیں۔ پس ہر موجود کے علم میں یا تو تنزیہ کا علم ہو گا یا تشبیہ کا علم، اور اس کے عمل میں یا تو صنعتی عمل ہو گا یا فکری روحانی عمل۔ اور وہ ان چار اقسام سے خالی نہیں ہو گا۔\n\nاسی طرح طبیعت نے بھی ان ظہور الٰہی (التجلیات) کے حکم کے لیے اپنی ذات سے دیا، کیونکہ موجودات ان ظہور الٰہی (التجلیات) کی صورت پر ہی ظاہر ہوئیں، پس حرارت، برودت، خشکی اور رطوبت وجود میں آئیں، اور یہ ہر جسم میں اپنی کمال کے ساتھ موجود ہیں۔ مگر یہ کہ وہ جسم میں قوت میں برابر ہو سکتی ہیں، اور یہی اس جسم کے بقا کا سبب ہے۔ اور ہو سکتا ہے کہ وہ جسم میں قوت میں برابر نہ ہوں، تو اس جسم کے لیے بیماریاں ساتھ لگی رہتی ہیں، اور بیماریوں کی حالتیں ایک دوسرے پر غلبے کے مطابق اس پر پلٹتی رہتی ہیں۔ اگر وہ حد سے بڑھ جائیں تو موت واقع ہو جاتی ہے، اور ان کا حد سے بڑھنا ان ہی کی طرف سے ہوتا ہے، کیونکہ ان کے حد سے بڑھنے کا موجب سبب انسان یا حیوان کے کھائے ہوئے کھانے سے واقع ہوتا ہے۔ پس جو چیز اس ماکول (کھانے) یا براہ راست عمل میں غالب ہو گی، وہ جسم کے اس حصے کی مقدار میں اضافہ کرے گی جو اس کے مناسب ہے، اگر گرم ہو تو حرارت کو قوی کرے گی، اور اگر ٹھنڈا ہو تو برودت کو قوی کرے گی۔ اور اسی طرح باقی بھی۔ پھر جب ان چار کے درمیان الفت پیدا کی گئی، تو صرف چار ہی ظاہر ہوئے، اور انہوں نے صرف چار ہی پہلو قبول کیے۔ کیونکہ ان چار ظہور الٰہی (التجلیات) کی حقائق نے یہ دیا کہ ان چار میں سے صرف ان کا عددی وزن ہی الفت پیدا کرے۔ اسی لیے ان میں تمام پہلوؤں سے منافرت اور مناسبت تھی، جیسا کہ ہم نے اس باب کے شروع میں الٰہیات میں ذکر کیا۔ اور اس حقیقت الٰہیہ نے عالم پر حکم لگایا کہ وہ اسی طرح ہو، کیونکہ معلوم علم کی صورت پر تھا اور اس کا علم اس کی ذات تھا۔ پس سمجھو۔\n\nپس منافرت حرارت اور برودت کی طرح ہے، اور اسی طرح رطوبت اور یبوست (خشکی)۔ اسی لیے حرارت اور برودت، اور رطوبت اور یبوست کبھی بھی کسی حکم میں جمع نہیں ہو سکتے۔ اور اللہ نے ان طبائع کی تالیف سے چار عناصر پیدا کیے، پس آگ حرارت اور یبوست سے بنی۔ پھر اس نے اس کے قریب وہ چیز نہیں بنائی جو تمام پہلوؤں سے اس سے منافرت رکھتی ہو، بلکہ اس کے قریب وہ چیز بنائی جو ایک پہلو سے اس کے مناسب ہو، اگرچہ دوسرے پہلو سے اس سے جدا ہو۔ پس ہوا اس کے لیے پڑوسی بنی، حرارت کی مناسبت کی وجہ سے، اگرچہ رطوبت کی وجہ سے اس سے منافرت رکھتی تھی۔ کیونکہ وساطت (درمیانی حالت) کا ایک اثر اور حکم ہوتا ہے، کیونکہ وہ دونوں کناروں کو جمع کرتی ہے، پس وہ ان دونوں سے منافرت پر قوی ہو گئی۔ پس ہوا گرم اور مرطوب ہے۔ پس چونکہ وہ گرم ہے، وہ مناسبت کی وجہ سے آگ کی طرف مائل ہوتی ہے اور وساطت غالب آتی ہے۔ اور چونکہ وہ مرطوب ہے، وہ مناسبت کی وجہ سے پانی کی طرف مائل ہوتی ہے۔ پھر ہوا نے نچلے کنارے سے پانی کا پڑوس اختیار کیا، پس ہوا نے حرارت کی وجہ سے آگ کا پڑوس قبول کیا اور رطوبت کی وجہ سے پانی کا پڑوس قبول کیا، اگرچہ وہ برودت کی وجہ سے اس سے منافرت رکھتی تھی، جیسا کہ ہوا نے حرارت کی وجہ سے اس سے منافرت رکھی تھی۔ اسی طرح اس نے مٹی اور پانی کے درمیان برودت کی وجہ سے پڑوس قائم کیا جو ان کے پڑوس کو جمع کرتی ہے۔ پس اس اصل کی وجہ سے صرف چار ہی ظاہر ہوئے۔\n\nاسی طرح پیدا ہونے والے حیوانی جسم میں آگ کا اثر صفراء (زرد مادہ)، ہوا کا اثر خون، پانی کا اثر بلغم، اور مٹی کا اثر سوداء (سیاہ مادہ) بنایا گیا۔ پس جسم چار طبائع پر مرکب ہوا۔ اور اسی طرح چار قوتیں: جاذبہ (کھینچنے والی)، ماسکہ (روکنے والی)، ہاضمہ (ہضم کرنے والی)، اور دافعہ (دفع کرنے والی)۔ اور اسی طرح سعادت اور شقاوت کو چار کے ساتھ جوڑا گیا: دائیں، بائیں، پیچھے اور آگے، کیونکہ جسم اپنی طبیعت کے مطابق اوپر کی طرف نہیں چلتا اور روح اپنی طبیعت کے مطابق نیچے کی طرف نہیں چلتی۔ اور انسان اور حیوان ان دونوں سے مرکب ہیں۔ پس اس کی سعادت اور شقاوت صرف اسی میں رکھی گئی جسے اس کی طبیعت اس کی روح اور جسم میں قبول کرتی ہے، اور وہ چار جہات ہیں۔ اور اسی سے اسے مخاطب کیا گیا، اور اسی سے ابلیس اس پر داخل ہوا اور کہا: \"ثُمَّ لَآتِيَنَّهُم مِّن بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ وَعَنْ أَيْمَانِهِمْ وَعَن شَمَائِلِهِمْ\" (پھر میں ان کے پاس ان کے آگے سے، ان کے پیچھے سے، ان کے دائیں سے اور ان کے بائیں سے آؤں گا)۔ اور اس نے اوپر سے اور نیچے سے نہیں کہا، اس وجہ سے جو ہم نے ذکر کی۔ پس ابلیس اس کے پاس صرف ان جہات سے آیا جو اس کی سعادت پر اثر انداز ہوتی ہیں اگر وہ اس کی بات سنتا اور جو وہ اسے دعوت دیتا ہے اسے قبول کرتا، اور اس کی شقاوت پر اثر انداز ہوتی ہیں اگر وہ اس کی بات نہیں سنتا اور جو وہ اسے دعوت دیتا ہے اسے قبول نہیں کرتا۔ پس پاک ہے وہ علیم (جاننے والا) حکیم (حکمت والا) جو اشیاء کو ان کے مراتب پر رکھتا ہے۔\n\nاور اسی طرح علوی جسمانی عالم نے کیا، پس اس نے وہ برج بنائے جن سے عالم میں احکام جاری ہوتے ہیں، چار پر: ناری، ترابی، ہوائی اور مائی۔ اور اسی طرح اس نے مطالبات کی ماؤں کو چار بنایا: \"ھل\" (کیا)، \"ما\" (کیا ہے)، \"لم\" (کیوں)، اور \"کیف\" (کیسے)۔ اور اسی طرح عالم میں مؤثر اسماء کی ماؤں کو چار بنایا، اور وہ ہیں: العالم (جاننے والا)، المرید (ارادہ کرنے والا)، القادر (قدرت والا)، اور القائل (کہنے والا)۔ پس اس کا علم کہ وہ فلاں وقت میں فلاں حالت پر ہو گا، اس کے بغیر ممکن نہیں ہے۔ پس یہ علم ارادے کو اس حال کے تعین سے متعلق کرتا ہے۔ پس قائل (کہنے والا) قدرت کو اس عین کے ایجاد سے متعلق کرتا ہے۔ پس اس نے جانا، پھر ارادہ کیا، اور کہا، پھر قدرت دی، پس اعیان ان چار سے ظاہر ہوئے۔ پس حرارت علم کے لیے ہے، یبوست ارادے کے لیے، برودت قول کے لیے، اور رطوبت قدرت کے لیے ہے۔ پس حرارت کے لیے گرم کرنا ہے، یبوست کے لیے خشک کرنا، رطوبت کے لیے نرم کرنا، اور برودت کے لیے ٹھنڈا کرنا ہے۔ اللہ تعالیٰ نے فرمایا: \"وَلَا رَطْبٍ وَلَا يَابِسٍ\" (اور نہ کوئی تر اور نہ کوئی خشک)۔ پس اس نے منفعل (متاثر ہونے والے) کو ذکر کیا، فاعل (اثر ڈالنے والے) کو نہیں، کیونکہ وہ ان پر دلالت کرتے ہیں جن سے وہ منفعل ہوئے، اور وہ حرارت ہے جس سے یبوست منفعل ہوئی، اور اسی طرح برودت ہے جس سے رطوبت منفعل ہوئی۔ پس دیکھو کہ ان ظہور الٰہی (التجلیات) نے اپنے حصر کے ساتھ جو کچھ ہم نے ذکر کیا ہے، کیا دیا ہے۔\n\nاسی طرح عالم مطلق سعید (خوش بخت) ہے اور مطلق شقی (بد بخت)، اور شقی جو سعادت کی طرف منتقل ہوتا ہے، اور سعید جو شقاوت کی طرف منتقل ہوتا ہے۔ پس حالتیں چار میں محدود ہو گئیں، اور اسی سے \"هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ\" (وہ اول ہے اور آخر ہے اور ظاہر ہے اور باطن ہے) ہے۔ اور پانچواں کوئی نہیں ہے۔ اور یہ عالم کے ساتھ اس کی نسبت کے اوصاف ہیں، اور عدد کے مراتب چار ہیں، پانچواں نہیں، اور وہ ہیں: آحاد (اکائیاں)، عشرات (دہائیاں)، مئات (سینکڑے)، اور آلاف (ہزاروں)۔ پھر ترکیب واقع ہوتی ہے، اور ان کی ترکیب ارکان کے وجود کی وجہ سے طبائع کی ترکیب کی طرح ہے۔\n\n### [جب تک بدر (چودھویں کا چاند) طلوع ہے، نفوس باغات میں سوئے ہوئے ہیں]\n\nاور اے میرے بھائی! جان لو کہ اس مقام (منزل) کے بقیہ حصے کو قلمبند کرنے کی رات، اس کی برکات میں سے، میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ اپنی پشت پر لیٹے ہوئے تھے اور فرما رہے تھے: \"بندے کو چاہیے کہ وہ اللہ کی عظمت کو ہر چیز میں دیکھے، یہاں تک کہ موزوں پر مسح کرنے اور دستانے پہننے میں بھی۔\" اور میں نے آپ صلی اللہ علیہ وسلم کے پاؤں میں نئے سیاہ جوتے اور آپ کے ہاتھوں میں دستانے دیکھے۔ اور گویا آپ اس علم پر خوش ہو کر میری طرف اشارہ کر رہے تھے جو میں نے اس مقام میں رکھا ہے، جو اللہ کے جلال کا حق ہے۔ پھر آپ نے فرمایا: \"جب تک بدر (چودھویں کا چاند) طلوع ہے، نفوس باغات میں سوئے ہوئے ہیں اور اپنے محلات میں محفوظ ہیں۔ پس جب اندھیرا ہو جائے اور بدر طلوع نہ ہو، تو چوروں کا خوف ہوتا ہے، لہٰذا انسان کو چاہیے کہ وہ چوروں کے خوف سے شہر میں داخل ہو جائے۔\"\n\nمیں اس کلام سے یہ سمجھ رہا تھا کہ آپ کا مطلب یہ ہے کہ جب نفوس پر ذات حق (الحق) کا شہود (الشہود) غالب ہو، اور وہ اس کے ساتھ اور اس میں متحقق ہوں، ان لوگوں کے نزدیک جو اللہ کی معرفت (المعرفۃ) کے باغات میں داخل ہوتے ہیں اور اس کے جلال پر اس کی اقسام اور کثرت فنون کے ساتھ کلام کرتے ہیں، تو آپ نے ذات حق (الحق) کو بدر سے تشبیہ دی، اور باغات میں موجود مختلف قسم کے پھلوں کو ان معارف سے تشبیہ دی جو حضرت الٰہیہ (الحضرة الإلهية) اسماء الٰہیہ اور صفات جلال و تعظیم میں رکھتی ہے۔ اور میں نے خواب میں آپ کے اس قول سے سمجھا کہ جب بدر غائب ہو جائے، اور یہ اشیاء میں ذات حق (الحق) کا شہود (الشہود) اور اس کے ساتھ حضور اور اس میں خالص نیت ہے، تو جہالت، اللہ سے غفلت اور غلطی کا اندھیرا چھا جاتا ہے، اور چوروں کا خوف ہوتا ہے، جس سے آپ کا مطلب فکری نظر رکھنے والوں اور صوری کشف (الکشف الصوری) والوں پر آنے والے گمراہ کن شبہات ہیں۔ پس آپ نے یہ ذکر نفوس پر خوف کی وجہ سے کیا کہ جب وہ جناب حق کے شایان شان کلام میں شدت اختیار کریں، تو انہیں چاہیے کہ وہ شہر میں داخل ہوں، یعنی اس سے ظاہر شریعت (الشرع الظاهر) کے ذریعے پناہ لیں اور جماعت کو لازم پکڑیں، اور وہ اہل بلد ہیں، کیونکہ اللہ کا ہاتھ جماعت پر ہے۔\n\nپھر میں نے آپ صلی اللہ علیہ وسلم کو دیکھا کہ آپ اپنے تمام اعضاء کے ساتھ بہت زیادہ بے چینی سے کروٹیں بدل رہے تھے، اس معرفت پر عظیم خوشی کی وجہ سے جو یہ مقام (منزل) اپنے اندر رکھتا ہے۔ اور یہ رات کا وقت تھا اور بدر طلوع تھا۔ یہاں تک کہ دن میں بھی میں بدر کو آسمان کے بیچ میں چمکتا ہوا دیکھ رہا تھا، اور ایک کہنے والا کہہ رہا تھا کہ رسول اللہ صلی اللہ علیہ وسلم کو کبھی اتنی عظیم بے چینی میں نہیں دیکھا گیا، اس چیز کی وجہ سے جو اللہ کی طرف سے آپ پر وارد ہوتی ہے اور جس کا آپ مشاہدہ کرتے ہیں۔ اور میں بیدار ہوا اور اس رؤیا کو اس مقام میں قلمبند کیا اور جو کچھ میں نے دیکھا اس پر خوش ہوا، اللہ کے لیے حمد ہے۔\n\nاور یہ مقام (منزل) بہت سے علوم کو شامل ہے، اور کوئی مقام ایسا نہیں ہے جو اپنے اندر موجود معارف کو کئی جلدوں میں نہ سمو سکے۔ پس میں نے اس رات اپنے ساتھیوں سے کہا کہ میں اس مقام کے بعض معارف کو اس کے مسائل میں سے ایک مسئلہ بناؤں گا۔ تو میرے بعض ساتھیوں نے مجھ سے سوال کیا: \"اگر معاملہ ایسا ہے، تو ہمیں اس کے مسائل کی تعداد پر تنبیہ کریں، صرف ان کے اصولوں کے سروں کو ذکر کر کے، تاکہ ہم انہیں تفصیل کے بغیر جان لیں، طوالت کے خوف سے۔\" تو میں نے کہا: \"ان شاء اللہ، شاید میں اس کتاب میں باقی ماندہ مقامات کے ساتھ ایسا کروں گا۔\" پس یہ رات ایک بابرکت رات تھی۔\n\n### [ستاروں میں ظہور الٰہی (التجلی) کا علم]\n\nپس جان لو کہ یہ مقام (منزل) ستاروں میں ان کی کثرت کے باوجود ایک ہی وقت میں ایک ہی رؤیت کے ساتھ ظہور الٰہی (التجلی) کے علم کو شامل ہے، اور ظہور الٰہی (التجلیات) کے تداخل کے علم کو، اور تابع اور متبوع کے ظہور الٰہی (تجلی) کے علم کو، اور کیا تابع کو متبوع کے ظہور الٰہی (تجلی) سے کوئی ذوق حاصل ہوتا ہے یا نہیں؟ کیونکہ متبوع تو اللہ کی طرف بلانے آیا ہے، اپنی طرف بلانے نہیں آیا۔ پس اس نے فرمایا: \"تَعَالَوْا إِلَىٰ كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا اللَّهَ وَلَا نُشْرِكَ بِهِ شَيْئًا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِّن دُونِ اللَّهِ\" (آؤ ایک ایسی بات کی طرف جو ہمارے اور تمہارے درمیان یکساں ہے کہ ہم اللہ کے سوا کسی کی عبادت نہ کریں اور نہ اس کے ساتھ کسی کو شریک ٹھہرائیں اور نہ ہم میں سے کوئی دوسرے کو اللہ کے سوا رب بنائے)۔ اور فرمایا: \"أَدْعُو إِلَى اللَّهِ عَلَىٰ بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي\" (میں اللہ کی طرف بلاتا ہوں، بصیرت کے ساتھ، میں بھی اور وہ بھی جنہوں نے میری پیروی کی)۔ پس اس نے تابع کے لیے اللہ کی طرف بلانے میں ایک حصہ رکھا۔\n\nپس ہر وہ علم جس میں انسان اپنی عاقل ہونے کی حیثیت سے خود کفیل ہو، اور اس میں کسی رسول یا اس پر دلالت کرنے والے کی ضرورت نہ ہو، جیسے اللہ کی توحید کا علم اور جو اس کے لیے واجب ہے، اور اسی طرح وہ فیض الٰہی (الفیض الإلهي) جو اسے اپنی خلوتوں میں اور اخلاق حسنہ سے اپنے نفس کی طہارت میں کشف (الکشف) کے ذریعے حاصل ہوتا ہے، تو ایسے شخص کے لیے ظہور الٰہی (التجلی) میں وہی حصہ ہوتا ہے جو متبوع کے لیے ہوتا ہے، کیونکہ وہ تابع نہیں ہے، بلکہ وہ بصیرت والا ہے، یا تو چلنے والی عقلی دلیل کی وجہ سے یا متحقق کشف (الکشف) کی وجہ سے، جس میں وہ متبوع کی طرح ہے۔\n\nاور ہر وہ انسان جس کا یہ مقام نہیں ہے، اور اس کے پاس اللہ کے بارے میں جو علم ہے وہ اس نے متبوع سے ایمان کے طور پر لیا ہے اور اس پر چلا ہے، اور وہ علم ایسا ہو جو صرف رسول صلی اللہ علیہ وسلم کے طریقے پر ہی حاصل ہو سکتا ہو، اور وہ اللہ کا قرب حاصل کرنے کا علم ہے، اس لحاظ سے کہ وہ قربت ہے نہ کہ علم، اور اسی طرح بدنی اور قلبی اعمال قربت کے طریقے پر صرف متبوع سے ہی معلوم ہوتے ہیں۔ پس جب اس علم کے حامل کے لیے اس مقام میں ظہور الٰہی (التجلی) ہو، تو تابع کبھی بھی متبوع کو نہیں پا سکتا۔ پس وہ متبوع کے لیے شمسی ظہور الٰہی (تجلی شمسی) ہے اور تابع کے لیے قمری اور نجومی ظہور الٰہی (تجلی قمری و نجومی) ہے۔ پس یہ جان لو۔\n\n### [اہل شقاوت (بد بختی) کے لیے اسم الرب کے علاوہ میں ذات حق (الحق) کا ظہور الٰہی (تجلی)]\n\nاور جو کچھ یہ مقام (منزل) شامل ہے، ان میں سے ایک اہل شقاوت (بد بختی) کے لیے اسم الرب کے علاوہ میں ذات حق (الحق) کا ظہور الٰہی (تجلی) ہے۔ حالانکہ اللہ نے حجاب صرف ایک مخصوص دن میں اور ان کی طرف مضاف اسم الرب میں رکھا ہے، نہ کہ اسم کے مطلق اطلاق میں۔ پس وہ ایک خاص زمانے میں اپنے خاص مضاف اسم سے حجاب میں ہوں گے۔ پس یہ اس خاص نام میں ان کے لیے اس مخصوص زمانے کے علاوہ اور مطلق اسم الرب میں اور دیگر اسماء میں اس کے ظہور الٰہی (تجلی) کو نہیں روکتا۔ اللہ تعالیٰ نے فرمایا: \"كَلَّا إِنَّهُمْ عَن رَّبِّهِمْ يَوْمَئِذٍ لَّمَحْجُوبُونَ\" (ہرگز نہیں، بے شک وہ اس دن اپنے رب سے ضرور پردے میں ہوں گے)۔ پس اس نے اس دن اسے ان کی طرف مضاف کیا، اور اسے ایک معین زمانہ بنا دیا۔ پس سمجھو۔\n\n### [ظہور الٰہی (التجلی) سے نعمت صرف محبین مشتاقین کو حاصل ہوتی ہے]\n\nاور یہ مقام (منزل) اس بات کو شامل ہے کہ ہر ظہور الٰہی (تجلی) سے نعمت حاصل نہیں ہوتی، اور ظہور الٰہی (التجلی) سے نعمت صرف محبین مشتاقین کو حاصل ہوتی ہے جنہوں نے محبت کی شرائط کو پورا کیا۔\n\nیہ مقام (منزل) عالم شہادت (عالم الشهادة) کے غیب میں باطن ہونے کو بھی شامل ہے، پس جو شہادت تھا وہ غیب بن جاتا ہے اور جو غیب تھا وہ شہادت بن جاتا ہے۔ اور بعض عارفین آخرت کی نشوونما کے بارے میں اسی طرف گئے ہیں کہ اجسام ارواح میں باطن ہوں گے اور ارواح ان کے لیے ظاہر ظروف ہوں گی، اس کے برعکس جو دنیا میں ہے۔ پس آخرت میں ظاہر روح ہو گی اور حکم روح کا ہو گا نہ کہ جسم کا۔ اسی لیے وہ جس صورت میں چاہیں گے تبدیل ہو جائیں گے، ان پر روحانیت کے غلبے اور جسم کے اس میں غیب ہونے کی وجہ سے، جیسا کہ آج ہمارے ہاں فرشتے اور عالم ارواح ہیں جو جس صورت میں چاہیں ظاہر ہوتے ہیں۔\n\nاور یہ ان اصحاب کشف (الکشف) کے مقامات میں سے ہے جنہوں نے اجسام کے حشر کا انکار کیا، کیونکہ انہوں نے اپنے کشف (الکشف) میں آخرت میں واقع ہونے والے امر کو دیکھا اور ارواح کو دیکھا کہ وہ اپنی مرضی کے مطابق صورتوں میں تبدیل ہو رہی ہیں، اور ان سے وہ جسمیت پوشیدہ رہی جو وہ ارواح اپنے اندر رکھتی ہیں، جیسا کہ اس دنیا میں انسانوں میں اجسام میں باطن روحانیت ان سے غائب رہی۔ پس اجسام ان کے لیے قبریں تھیں، اور آخرت میں اس کے برعکس ارواح اجسام کی قبریں ہوں گی۔ اسی لیے انہوں نے اس کا انکار کیا۔\n\nاور وہ کامل کشف (الکشف التام) جو ہمیں اور ہمارے ساتھیوں کو یہاں اور آخرت میں حاصل ہوا، وہ یہ ہے کہ ہم نے یہاں ارواح کا کشف (الکشف) کیا، اور ظاہری صورت میں ان پر طبعی اجسام غالب رہے۔ پس اجسام کے ظاہر میں ارواح کے صرف آثار ہی نظر آتے ہیں۔ اور اگر موت اور نیند نہ ہوتی، تو غیر مکاشف کو یہ معلوم نہ ہوتا کہ ظاہر میں جو کچھ وہ دیکھتا ہے اس کے علاوہ بھی کوئی چیز ہے۔ اور موت اور سکون کے وجود اور جسم کے ان آثار سے عاری ہو کر ظاہر ہونے کے باوجود، ایک گروہ اس مذہب کی طرف گیا، اور وہ حشیشیہ ہیں، جنہوں نے یہ نہیں دیکھا کہ اس ظاہری صورت کے پیچھے کوئی چیز بالکل موجود ہے۔ پس ان لوگوں کا کیا حال ہو گا اگر عالم میں موت نہ ہوتی؟\n\nاور یہ مقام (منزل) عالم علوی کی معرفت اور اس کی ترکیب میں اس کی صورت کی ترتیب کو شامل ہے، اور یہ اس کے خلاف ہے جو علم ہیئت (علم الهيئة) والے ذکر کرتے ہیں، اگرچہ ان کا قول دلیل دیتا ہے اور جائز ہے کہ اللہ اسے اس طرح ترتیب دے، لیکن اس نے ایسا نہیں کیا، حالانکہ یہ ترتیب وہی دیتی ہے جو علم ہیئت والے کہتے ہیں۔\n\nاور یہ مقام (منزل) ان امور کے علم کو شامل ہے جو اللہ نے عالم سفلی میں اس کی ترتیب میں ودیعت کیے ہیں، اور مکلفین کی معرفت کو، اور انہیں کہاں سے مکلف کیا گیا اور کون سی چیز انہیں حرکت دیتی ہے، اور قربات (قرب حاصل کرنے کے اعمال) کے علم کو، اور اللہ پر تکبر کرنے والے جباروں کو توڑنے کے سبب کے علم کو، اور حیوان کو اللہ کے علم میں انسان کے ساتھ ملانے کو، اور انجام کے علم کو، اور ہر عالم کا کیا انجام ہوا، ان سب کو شامل ہے۔ پس میں نے اس کے مسائل کے سروں کو ذکر کر دیا ہے، اور \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "## باب دویست و نود و سوم: در معرفت منزل (مقام) سبب وجود عالم شهود (عالم الشهادة) و سبب ظهور عالم غیب (عالم الغيب) از حضرت موسوی (الحضرة الموسوية)\n\nاگر خورشید را شعاعی باشد، *** آن نور از پیش من به او رسیده است.\n\nاگر مرگ بر هر جانی فرود آید، *** آن مرگ از سوی پروردگاری است که او را آفریده است.\n\nاگر بهشت مأوا (جنة المأوى) تجلی کند، *** آراسته به زیبایی‌هایش به سوی ما.\n\nاز بادهایی که در خود دارند، بهره‌مند می‌شویم، *** از بوی خوش مشک‌فام در عطر آن.\n\nو اگر ستارگانی در آسمان خاموش شوند، *** آن خاموشی، شکوهشان را به ارث می‌گذارد.\n\nو اگر جان‌هایی در جان‌های دیگر داخل شوند، *** همانا ورودشان در آن‌ها آرزوی آن‌هاست.\n\nو آبادکنندگان بیابان‌ها، گریزانند، *** از شکاری که خونش ریخته می‌شود.\n\nو اگر پیامبر (الرسول) جان‌هایی را می‌دید، *** که رسالتش را رد می‌کنند، هرگز به سوی آن‌ها نمی‌آمد.\n\nو اگر حجاب‌ها بر او عرضه می‌شدند، از آنچه *** منازع می‌آورد، آن را رد نمی‌کرد.\n\nو اگر کشتی‌ها در حال حرکت بودند، *** تا به مقصدی برسند، پایانش را محقق می‌ساخت.\n\nو اگر شب‌ها گیسوان خود را رها می‌کردند، *** تاریکی‌شان شکافته نمی‌شد.\n\nو اگر صبح، چهره‌هایی را می‌دید، *** که جوانبشان از پرتو آن روشن شده است،\n\nاو را شرمنده می‌ساخت و با عزم راسخ در آن می‌مُرد، *** و شیفته و دلباخته هوای آن می‌شد.\n\nو اگر هلال ماه، پس از چهارده شب، *** ماه کامل (بدر) می‌شد، دیگر آن را دنبال نمی‌کرد.\n\nو اگر دریاها آبی گوارا (فرات) می‌شدند، *** جز آن، کسی از آن لذت نمی‌برد.\n\nو اگر زمین‌ها دارای سطحی صاف بودند، *** خداوند مهیمن (المهيمن) نمی‌فرمود که آن را گسترانده است (دحاها).\n\nو با آن، زینت هر چیزی را آشکار ساخت، *** و حکمتی را در خاک آن پنهان نمود.\n\nو اگر در خانه‌ها انیسی بود، *** انیس آن، پروردگاری بود که آن را بنا نهاد.\n\nاما انس گرفتن نزد من صحیح نیست، *** با ذاتی که صفتی برای دیدن ندارد.\n\nو اگر بلندی‌ها در پستی قرار می‌گرفتند، *** پستی‌شان، بلندترین قله‌هایشان می‌شد.\n\nو اگر کوه‌های استوار (الرواسي) سر به فلک می‌کشیدند، *** سر به فلک کشیدنشان از کسی بود که آن‌ها را بالا برد.\n\nاما سر به فلک کشیدن برای آن‌ها مقامی است، *** که پروردگار هستی (رب البرية) به آن‌ها بخشیده است.\n\nو اگر صحیفه، کسی را که آن را ثبت می‌کند، به بند می‌کشید، *** او را می‌دید و محو می‌کرد.\n\nو اگر دوزخ (الجحيم) آتشی بدون سرما بود، *** بر هوای آن راه می‌رفتم.\n\nاما عذاب، وجود ضدی است، *** که نفس آن را با چشیدن در نتیجه عملش می‌بیند.\n\nو اگر محبت دارای شخصیتی بود، *** ضعف اشتیاقش، قوّت آن را از بین نمی‌برد.\n\nو اگر قانون‌گذار (المشرع) هنگامی که با معشوقش خلوت می‌کند، نگاه می‌کرد، *** شریعت او را نهی نمی‌کرد.\n\nو اگر آسمان بدون ستارگان بود، *** نورش اندکی از روشنایی آن بود.\n\nو اگر بادها به آرامی می‌وزیدند (رخاء)، *** آن را متزلزل می‌ساخت و آرامش آن را از دست می‌داد.\n\nو اگر آب‌ها در اعماق فرو می‌رفتند، *** رطوبت دستانش جهانیان را زنده می‌کرد.\n\nو اگر ابر، باران خود را از کافران باز می‌داشت، *** بارانش آن‌ها را بی‌نیاز می‌ساخت.\n\nو اگر کوه‌ها به حرکت درمی‌آمدند، *** آسمانشان، خاکشان می‌شد.\n\nو اگر چشم‌ها روشنایی خود را، *** بدون حجاب‌ها می‌دیدند، کوری بر آن‌ها چیره می‌شد.\n\nو اگر پادشاهان شما را به چشم می‌دیدند، *** هنگامی که روی می‌آوردید، عطایای خود را می‌بخشیدند.\n\nو اگر کتاب به هر ستایشی سخن می‌گفت، *** درباره کسی از دنیا که قصد آن را داشت.\n\nو اگر غارتگر، صبحگاهان بر آن در بیابان حمله می‌کرد، *** آن را به اسارت نمی‌گرفت.\n\nو در مواقف هلاکت‌بار استوار می‌ماند، *** به خاطر قدرتش، هنگامی که امری ناگوار به او روی می‌آورد.\n\nبه هفت آیه مکرر (السبع المثاني) سوگند خوردم، *** و به سوره‌های حروف، به عین «طاها».\n\nبه راستی که چشم خورشید را دیدم که پنهان می‌شود، *** از دیدگان، هنگامی که بخشش خود را می‌دهد.\n\nپس جوّ آن را به دست ابری می‌بینی، *** و زمین آن را می‌بینی که تپه‌هایش می‌درخشند.\n\nو زیبایی خود را برای چشمان کور آشکار می‌سازد، *** و نگاهش، رنج آن را از ما پنهان می‌دارد.\n\nو هنگامی که گفته شد: کوچ کرد و غایب شد، *** و جانشین خود، برادرش را ترک کرد.\n\nپاسخ فرستاده‌اش را دادم، هنگامی که نزد من آمد، *** تا بوهد که با من رو در رو سخن بگوید.\n\nگفتم: پوشیده ماندن برای من سزاوارتر است، زیرا *** فنای چشم خود را در فنای او دیدم (فناء عيني في فناها).\n\nپس او به خاطر کینه‌ای که از او بود، کوچ نکرد، *** بلکه به خاطر راننده‌ای بود که او را راند.\n\nپاسخ دادن او به یک امر و توجهی بود، *** که جود خداوند مهیمن (المهيمن) آن را برای او مقرر کرده بود.\n\nپس همه چیز نیازمند او شد، *** و هستی (الكون) مشتاق آهنگ او شد.\n\nچه بسیار گودال‌هایی که در آن بودم، *** و اگر او نبود، بر لبه آن سقوط می‌کردم.\n\nبه خاطر بیماری شهوتی که اگر عیسی (علیه السلام) *** طبیبان را تأیید می‌کرد، آن را شفا نمی‌داد.\n\nو چه بسیار خوراکی که با حرص خوردم، *** به خاطر شهوتش، و به آرزویش نرسیدم.\n\nو چه بسیار شهوتی که به ما نگریست، *** و ما به آن دست یافتیم، و خداوند ما را از آزار آن حفظ کرد.\n\nو هرگز نفس ما قصد آن را نداشت، *** و عقل، نیت آن را پنهان کرده بود.\n\nاز ترس اینکه جان‌ها آن را از او بخواهند، *** و عقل از جفای آن برحذر بود.\n\nو هرگز یک روز هم به ذهن او خطور نکرد، *** و بر او حکم نکرد و قصد آن را نداشت.\n\nاما شریعت آن را ثابت کرد، *** برای اهل سعادت در پستی آن.\n\nپس به آن دست یافتند و حجابی در پی نداشت، *** و خداوند مهیمن (المهيمن) آن‌ها را از تزکیه آن حفظ کرد.\n\n***\n\nبدان، خداوند ما و تو را تأیید کند، که این قصیده و هر قصیده‌ای که در ابتدای هر باب از این کتاب آمده است، مقصودش خلاصه کردن مطالبی نیست که به تفصیل در نثر آن باب خواهد آمد و مورد بحث قرار خواهد گرفت؛ بلکه خود شعر جزئی از شرح آن باب است و در کلامی که پس از شعر می‌آید تکرار نمی‌شود. پس باید به شعر در شرح باب نگریست، همان‌گونه که به نثر در بحث از آن نگریسته می‌شود. در شعر، مسائلی از آن باب وجود دارد که در کلام منثور نیست، و این‌ها مسائل منفردی هستند که غالباً هر مسئله‌ای به خودی خود مستقل است، مگر اینکه بین دو مسئله پیوندی باشد که یکی دیگری را طلب کند؛ مانند انسان که سخن گفتن درباره حیوان را به دلیل احساسی که در اوست، طلب می‌کند، و نبات را به دلیل رشد و غذایی که در اوست، طلب می‌کند، و جماد را به دلیل آنچه در اوست و احساس نمی‌کند، مانند ناخن‌ها و مو، طلب می‌کند. پس به نبات به دلیل رشدش مرتبط است و به جماد به دلیل عدم احساسش. هیچ چیزی در هستی (الوجود) وجود ندارد که هیچ ارتباطی با چیز دیگری نداشته باشد، حتی بین پروردگار (الرب) و مربوب (پرورده)، زیرا مخلوق، خالق را می‌طلبد و خالق، مخلوق را می‌طلبد. به همین دلیل، علم از عالم (دانا) بر صورت معلوم خارج شد و معلوم بر صورت علم خارج شد. اگر چنین نبود، چگونه تعلق (ارتباط) رخ می‌داد؟ بنابراین، ناسازگاری (المنافرة) از همه جهات اصلاً صحیح نیست. پس ناگزیر مسائل به دلیل پیوند ذاتی (الارتباط الذاتي) که در هستی (الوجود) بین همه چیز وجود دارد، در هم تنیده می‌شوند. آنچه را که در این پیوند به تو اشاره کردم، بفهم، زیرا از امری عظیم خبر می‌دهد که اگر آن را درنیابی، پای غرور (الغرور) تو در پرتگاه هلاکت می‌لغزد. زیرا از اینجاست که می‌فهمی معنای سخن کسی که به حدوث عالم (حدوث العالم) قائل شد و کسی که به قدم عالم (قدم العالم) قائل شد، چیست؛ با وجود اجماع هر دو گروه بر اینکه عالم ممکن است و هر جزء آن حادث است و مرتبه واجب الوجود بالذات (واجب الوجود بنفسه) را ندارد، بلکه نزد برخی از آن‌ها واجب الوجود بالغیر (واجب الوجود بغيره) است، یا به دلیل ذات ایجادکننده نزد برخی، یا به دلیل سبقت علم به وجود آن نزد دیگران. اگر صحت پیوندی که به آن اشاره کردیم نبود، اصلاً صحیح نبود که عالم وجود داشته باشد، در حالی که عالم موجود است، پس پیوند موجود است. ناسازگاری و عدم ناسازگاری از وجهی دیگر است. هر حقیقت الهی (حقيقة إلهية) حکمی در عالم دارد که برای دیگری نیست، و این‌ها نسبت‌ها هستند. نسبت عالم به حقیقت علم، غیر از نسبت آن به حقیقت قدرت است. پس حکم علم در آن، هیچ مناسبتی با مقدور ندارد، بلکه مناسبت آن بین آن و معلوم است. و امر از جهت معلوم بودن، با مقدور بودن متفاوت است. اگر از این منظر بنگری، می‌گویی هیچ مناسبتی بین خداوند و بندگانش نیست، و اگر با چشم دیگر بنگری، نسبت را اثبات می‌کنی، زیرا در همه چیز موجود است. پس بر اساس آنچه می‌بینی و آنچه در آن لحظه بر تو غالب است، حکم کن. و هنگامی که حقایق برای صاحب دو چشم آشکار شد، باید آنچه را که شرع برای او تعیین کرده است بگوید و با عقل خود سخن نگوید، زیرا برخی از الفاظ هستند که با وجود صحت معنا، از به کار بردن آن‌ها منع شده‌ایم، و برخی دیگر با وجود فساد معنا، مطلقاً برای ما مباح هستند؛ مانند اطلاق نسبت ظرفیت (الظرفية) به کسی که ظرفیت را نمی‌پذیرد، و مانند نسبت استفاده از علم به کسی که علمی استفاده نمی‌کند. پس اطلاق مشروع است و وجه ناسازگار معقول است. همان‌گونه که اطلاق نسبت فرزند (الولد) منع شد و تحت حکم «لو» (اگر) قرار گرفت، و همان‌گونه که تبدیل قول الهی در سخن او: «ما يبدل القول لدي» (نزد من سخن دگرگون نمی‌شود) منع شد و تحت «لو» قرار گرفت. و تحت «لو» جز ممکن وارد نمی‌شود. عقل به محال بودن فرزند دلالت عقلی می‌کند و به امکان هدایت همه مردم دلالت عقلی می‌کند و به محال بودن هدایت همه مردم به دلیل سبقت اختلاف در علم، دلالت عقلی می‌کند. و لفظ «لو» دلالت می‌کند که او در ذات خود مختار است، اگر بخواهد امری را می‌خواهد و اگر نخواهد آن امر را نمی‌خواهد. و این با خبر الهی وارد شده است و عقل آن را محال می‌داند، در حالی که خداوند ما را به علم به آن امر کرده و آیات را دلایلی برای صاحبان خرد (أولي الألباب) قرار داده است. اما چون این‌ها دلایلی خاص بر او هستند، امر در فرمان او به ما برای علم به او، خالی از این نیست که آیا در این راه، از دلالت شارع پیروی کنیم و نزد خبر او به تقلید توقف کنیم، یا راه نظر را بپیماییم تا معقول باشد، یا از دلالت عقل آنچه را که با آن الوهیت او نزد ما ثابت می‌شود، بگیریم و از دلالت شرع آنچه را که از اسماء و احکام به این اله اضافه می‌کنیم، بگیریم. پس ما در علم به او سبحانه، شرعاً و عقلاً مأمور هستیم، و این صحیح است، زیرا شرع جز با عقل ثابت نمی‌شود. اگر چنین نبود، هر کسی در مورد حق هر چه می‌خواست می‌گفت، از آنچه عقول آن را محال می‌دانند و آنچه محال نمی‌دانند. و آن‌ها این کار را با ایمان به شرع انجام داده‌اند و با تأویل وارد اموری شده‌اند که نیازی به آن‌ها نداشتند، و اگر از آن‌ها بی‌نیاز می‌شدند، عقل آن‌ها را به آن مطالبه نمی‌کرد و شرع آن‌ها را به خاطر ترک آن بازخواست نمی‌کرد، بلکه شرع آن‌ها را به خاطر انجام آن بازخواست می‌کند و آن‌ها در خطر هستند. و بر ساکت حجتی نیست، مگر زمانی که سخن گفتن در مورد آنچه در آن سکوت کرده، بر او واجب باشد. و در این کلام، تمام آنچه در قصیده ابتدای باب ذکر کردیم، گنجانده شده است، زیرا تمام اموری که در آن برشمرده شده، حقایق الهی را می‌طلبند که به آن‌ها استناد کنند و با حقایق الهی ناسازگاری دارند.\n\nاز جمله آنچه این منزل در بر می‌گیرد، تجلی (التجلی) حجاب بین دو کشف (الکشف) و تجلی کشف بین دو حجاب است. هیچ منزلی در میان منازل نیست که متضمن این نوع از تجلی باشد مگر این منزل. زیرا تجلی منفرد در مظهر، بدون واسطه بودن، چیزی را می‌دهد که در واسطه بودن نمی‌دهد، و تجلی منفرد ذاتی در غیر مظهر، چیزی را می‌دهد که در واسطه بودن نمی‌دهد. و این تجلی که در واسطه بودن رخ می‌دهد، حصر بین دو امر را می‌دهد، و هر محصوری محدود به کسی است که آن را حصر کرده است. و این شگفت‌انگیزترین معارف در این راه است که تجلی ذاتی (التجلي الذاتي) که دارای اطلاق است، محصور باشد. پس این مانند آن است که درباره نشسته در حال نشستنش گفته شود که ایستاده است. ظاهر امر این است که قابل تصور نیست. پس منزه است کسی که از اضداد منزه است و صفاتش آن‌ها را پذیرفته است.\n\nپیامبر (صلی الله علیه و آله و سلم) فرمود: «پروردگارتان را می‌بینید، همان‌گونه که خورشید را در نیمروز می‌بینید.»\n\nاگر منظور او از این لفظ، روز باشد، پس تجلیات ذاتی (التجلیات الذاتية) را شامل می‌شود، هرچند در حکم تجلی متفاوت باشند، مانند تفاوت صفت تنزیه او به اسم غنی بودن از فقر، و صفت تنزیه او به احدیت (الأحدية) از شریک، با قول او: «وَلَمْ يَكُنْ لَهُ شَرِيكٌ فِي الْمُلْكِ» (و در فرمانروایی شریکی برای او نبوده است). همچنین تجلیات ذاتی بصری مانند این تجلیات ذاتی عقلی هستند. و اگر منظور او از نیمروز (الظهيرة)، وقت معینی در روز باشد، که این در معنای محقق و لفظ آشکارتر است و سزاوارتر است که این قول بر آن حمل شود، زیرا تمام روز، تجلی ذاتی است، چون خورشید در آن با ذات خود آشکار است. اگرچه روز معلول خورشید است، اما خورشید با ذات خود از ابتدای طلوع تا هنگام غروبش آشکار شده است و در هر دقیقه‌ای تجلی و حکمی دارد که کسی که می‌داند، آن را می‌شناسد و کسی که نمی‌داند، آن را نمی‌شناسد. و کسی که همه این‌ها را می‌شناسد، کسی است که زمانش طولانی شده است. پس آن‌ها بین حکم خورشید در طلوع و اشراقش، و حکم آن در ضحای آن، و حکم آن در زوالش که آغاز پوشیده شدن آن است، و حکم آن در عصرش، و حکم آن در جمع شدن نورش و کم شدن سلطه‌اش نسبت به آنچه در مقابل آن در ابتدای روز و صدر آن بود، و حکم آن هنگام سقوطش، تفاوت می‌گذارند. و هر تجلی، اگرچه ذاتی باشد، حکمی دارد که دیگری ندارد. پس آنچه غیر از دو طرف است، تجلی ذاتی بین دو تجلی ذاتی است، مگر دو طرف که یکی تجلی ذاتی پس از تجلی حجابی است و طرف دیگر تجلی ذاتی است که پس از آن تجلی حجابی می‌آید. پس آن تجلی ذاتی بین تجلی ذاتی و حجابی است. ما تو را به راه انداختیم، پس از حالات تغییر احکام خورشیدی در این لحظات و وقوع تشبیه از آن در لحظه‌ای معین که نیمروز است و حالت صاف بودن هوا و نبودن ابر بین آن و بیننده، بفهم، و تو آثار تجلی ذاتی را در لحظات باقی‌مانده دریاب.\n\n### [نور گسترده بر زمین، جز به نور بینایی، حقیقت وجودی ندارد]\n\nپس بدان که نور گسترده بر زمین که از شعاع خورشید جاری در هواست، جز به نور بینایی (نور البصر) که آن را درک می‌کند، حقیقت وجودی ندارد. پس هنگامی که دو چشم، چشم خورشید و چشم بینایی، جمع شوند، دیدنی‌ها روشن می‌شوند و گفته می‌شود که خورشید بر آن‌ها گسترده شده است. و به همین دلیل، آن اشراق با وجود ابر حائل از بین می‌رود، زیرا چشم به دلیل وجود ابر، از این چشم دیگر جدا شده است. این مسئله‌ای در نهایت ابهام است، زیرا من می‌گویم اگر خورشید در جو آسمان بود و هیچ چشمی در عالم نبود که ببیند، اصلاً شعاعی گسترده بر زمین نداشت. زیرا نور هر مخلوقی محدود به ذات خود اوست و دیگری با آن روشن نمی‌شود. پس وجود بینایی‌های ما و وجود خورشید با هم، نور گسترده را آشکار ساخت. آیا نمی‌بینی که رنگ‌ها در یک جسم واحد که مثلاً به سبزی یا سرخی رنگین شده است، چگونه تغییر می‌کنند، هنگامی که کیفیت‌های نگاه تو به آن، از راست بودن و انحراف، متفاوت می‌شود؟ چگونه رنگ‌های مختلف محسوس را به تو می‌دهد که با چشمت درک می‌کنی، در حالی که در جسم مورد نظر در خورشید وجود ندارند؟ و نمی‌توانی این را انکار کنی، به ویژه اگر جسم مورد نظر در خورشید باشد. پس تو چیزی را درک کرده‌ای که حقیقتاً وجود ندارد، بلکه یک نسبت است. همچنین نور گسترده بر زمین و مانند تغییر رنگ آفتاب‌پرست در رنگ اجسامی که بر روی آن‌ها قرار می‌گیرد، به تدریج و پی در پی، در حالی که مانند آینه نیست که تصویر را به سرعت بپذیرد و نه جسمی صیقلی است. و درک تغییر رنگ آن محسوس است، با علم تو به اینکه آن رنگ‌ها در آن جسمی که به آن نگاه می‌کنی و نه در اعیان آن‌ها در علم تو، وجود ندارند. همچنین عالم، خداوند را در حال عدمش درک می‌کند. پس عالم، معدوم العین است و خداوند را درک می‌کند و او را می‌بیند، پس او را به دلیل نفوذ اقتدار الهی در آن، موجود می‌سازد. پس فیض وجود عینی، تنها بر آن دیدنی‌ها برای خداوند در حال عدمشان واقع شد. پس کسی که به وجود تعلق رؤیت عالم در حال عدمش نگریست و اینکه آن رؤیتی حقیقی است که شکی در آن نیست و آن را عالم می‌نامند، و حق به این صفت متصف نمی‌شود که او را نمی‌دید و سپس دید، بلکه همیشه او را می‌بیند. پس کسی که به قدم (ازلیت) قائل شد، از اینجاست که قائل شد. و کسی که به وجود عالم در عین خود برای خودش نگریست و این حالت را در حال رؤیت حق به آن نداشت، به حدوث آن قائل شد. و از اینجاست که می‌فهمی علت دیدن بیننده اشیاء را، موجود بودن آن‌ها نیست، چنانکه اشاعره (الأشاعرة) به آن قائل شدند، بلکه وجه حق در این امر، تنها استعداد مرئی برای دیده شدن است، خواه موجود باشد یا معدوم، زیرا رؤیت به آن تعلق می‌گیرد. اما غیر اشاعره از معتزله (المعتزلة)، در رؤیت بصری اموری را علاوه بر این شرط کردند که تابع وجود است، و به همین دلیل رؤیت را تنها به علم منحصر کردند.\n\nاما تجلی ذات (التجلي الذات) بین دو تجلی حجابی (حجابيين)، ناگزیر است که در آن تجلی ذاتی، صورتی از دو حجاب برای بیننده آشکار شود. پس آن تجلی برای او مانند آینه‌ای است که دو صورت را با آن مقابله می‌کند و دو حجاب را با نور آن تجلی ذاتی در آینه ذات می‌بیند، همان‌گونه که فقر را در حال تنزیه حق از آن مشاهده می‌کنی، سبحانه الغنی الحمید (منزه است او که بی‌نیاز و ستوده است). و اگر امر چنین نبود، چگونه او را از آنچه عقلاً برای تو مشهود نیست، تنزیه می‌کردی؟ پس صورت حجاب در ذات هنگام تجلی این‌گونه است، و واضح‌تر از این ممکن نیست. پس هنگامی که عارف صورت این دو حجاب یا صورت حجاب و تجلی ذاتی را که این تجلی ذاتی دیگر بین آن‌هاست، درک کرد، یا دو تجلی ذاتی را در مظهر حجاب واقع شده بین آن‌ها درک کرد، باید ذکر و عمل او بر اساس آنچه آن دو صورت در آن مظهر می‌دهند، باشد. و علت اینکه در تجلی، هر تجلی که باشد، هرگز جز دو صورت درک نمی‌شود، این است که محال است واحد در احدیت (أحديته) خود مشاهده شود. و چون انسان در حالی که در مرتبه دوم هستی (الوجود) است، احدیت برای او صحیح نیست، پس او دارای زوجیت (الشفعية) است. به همین دلیل، در تجلی جز دو صورت که مظهر بین آن‌هاست، مشاهده نمی‌کند. پس بیننده هرگز از حق، هر جا که او را ببیند، جز خود را نمی‌بیند. پس این تجلی، تو را به خودت و به ذات او می‌شناساند. اگر تجلی بین دو حجاب باشد، آن دو صورت، عمل خواهند بود. اگر در دنیا باشد، عمل تکلیف مشروع خواهد بود، و اگر در آخرت باشد، عمل نعمت در نکاح یا پوشیدنی یا خوردنی یا نوشیدنی یا تفریح با سخن یا همه این‌ها یا آنچه شبیه آن است، بر اساس حجاب خواهد بود. به همین دلیل، هنگامی که مردم از تجلی در سرای آخرت باز می‌گردند، با آن صورت باز می‌گردند و ملک خود را با آن صورت می‌بینند و نعمت با آن واقع می‌شود. و ممکن است به نظر آید که نعمت متعلق به اشیاء است، در حالی که چنین نیست، بلکه متعلق نعمت، وجود اشیاء یا درک آن‌ها بر آن صور حجابی است که در مظهر ذاتی درک کرده است. و اگر تجلی، تجلی حجابی بین دو تجلی ذاتی باشد، مانند تجلی ماه بین ضحی و نیمروز، و تجلی شب بین دو روز، آن دو صورت در آن مظهر حجابی، علم خواهند بود نه عمل، اما از علوم تنزیه (التنزيه). پس نفس با آن آراسته می‌شود و به نعمت معنوی متنعم می‌گردد، و آن بهشت مناسب اوست، پس بفهم. و اگر تجلی ذاتی بین تجلی حجابی و ذاتی باشد، آن دو صورت، صورت علم خواهند بود نه صورت عمل. پس تجلی ذاتی در ذاتی، صورت علم تنزیه است و بس. و صورت تجلی حجابی در آن، صورت علم تشبیه است، و آن تخلق بنده به اسماء الهی و ظهور او در ملک خود با صفات ربانی است. و در این مقام، مخلوق، خالق می‌شود و با احکام تمام اسماء الهی ظاهر می‌شود. و این مرتبه خلافت و نیابت از حق در ملک است، و با آن، تسلط بر موجودات بالفعل، با همت و مباشرت و قول برای او حاصل می‌شود. اما همت، این است که چیزی را اراده می‌کند و مراد، همان‌گونه که اراده کرده است، بدون کم و کاست، در برابر او مجسم می‌شود. و اما قول، این است که به آنچه اراده کرده است، می‌گوید: «كُنْ فَيَكُونُ» (باش، پس می‌شود) آن مراد، یا خود مستقیماً آن را انجام می‌دهد، اگر عملی باشد، مانند مباشرت عیسی (علیه السلام) با گِل در خلق پرنده و تصویر آن به صورت پرنده، و این همان قول اوست: «لِمَا خَلَقْتُ بِيَدَيَّ» (برای آنچه با دستان خود آفریدم). پس برای انسان در هر حضرت الهی، نصیبی است برای کسی که تعقل کند و بشناسد.\n\nو اگر تجلی حجابی بین تجلی حجابی و ذاتی باشد، تجلی حجابی در حجابی، علم ارتباط آن با حق است از آن جهت که دلیل بر اوست و سببی از اوست و بر صورت او و نسبت شباهت به اوست. و اما صورت تجلی ذاتی در حجابی، علم تجلی حق در صفات مخلوق است، از شادی و تعجب و خوشرویی و دست و پا و چشم و دندان و دو دست و قبضه و یمین و سوگند خوردن برای مخلوق به مخلوقات و به ذات خود، و متصف شدن او به حجاب‌های نور و ظلمت و حصر سبحانه المحرقة (منزه است او که سوزاننده است) در پشت آن حجاب‌های نوری و ظلمانی. و من مقام تجلیات را برای تو در چهار مورد محصور کردم و اصلاً غیر از این‌ها وجود ندارد. و چون حقیقت در تجلیات الهی این را داد که جز در این چهار مورد در عالم نباشد، موجودات همه بر اساس تربيع (چهارگانه بودن) در اصل خود که به آن باز می‌گردند، قرار گرفتند. پس هر موجودی ناگزیر است که در علم خود، علم تنزیه یا علم تشبیه داشته باشد، و در عمل خود، یا در عمل صنعتی یا عمل فکری روحانی. و از این چهار بخش خالی نیست. همچنین طبیعت با ذات خود به حکم این تجلیات این را داده است، زیرا موجودات تنها بر صورت این تجلیات خارج شدند. پس حرارت و برودت و یبوست و رطوبت به وجود آمدند، و این‌ها در هر جسمی به کمال خود هستند، جز اینکه ممکن است در جسمی بر تساوی در قوت باشند، که این سبب بقای آن جسم است، و ممکن است در جسمی بر تساوی در قوت نباشند، پس علل برای آن جسم همراه باشند و حالات بیماری‌ها بر اساس غلبه برخی بر برخی دیگر بر آن تغییر کند. اگر افراط کنند، مرگ خواهد بود. و افراط آن‌ها از خود آن‌هاست، زیرا سبب موجب افراط آن‌ها تنها از طریق خوراکی است که انسان یا حیوان می‌خورد. پس آنچه در آن خوراک یا مباشرت غالب باشد، در کمیت آنچه در جسم با آن مناسبت دارد، افزایش می‌یابد، اگر گرم باشد، حرارت را تقویت می‌کند و اگر سرد باشد، برودت را تقویت می‌کند. همچنین آنچه باقی ماند. سپس چون بین این چهار الفت داده شد، جز چهار چیز ظاهر نشد و جز چهار وجه را نپذیرفت، زیرا حقایق آن تجلیات چهارگانه این را داد که جز وزن خود در عدد، از این چهار چیز با هم الفت نگیرند. و به همین دلیل، از آن‌ها ناسازگاری از همه جهات و مناسبت وجود داشت، همان‌گونه که در الهیات در ابتدای این باب ذکر کردیم. و آن حقیقت الهی بر عالم حکم کرد که بر آن مثابه باشد، زیرا معلوم بر صورت علم بود و علم او ذات او بود، پس بفهم. ناسازگاری مانند حرارت و برودت است و همچنین رطوبت و یبوست. به همین دلیل، حرارت و برودت و رطوبت و یبوست هرگز در یک حکم جمع نمی‌شوند. و خداوند عناصر را چهارگانه آفرید از تألیف این طبایع. پس آتش از حرارت و یبوست بود. سپس آنچه را که کاملاً با آن ناسازگار است، در کنار آن قرار نداد، بلکه آنچه را که از یک جهت با آن مناسبت دارد، در کنار آن قرار داد، هرچند از جهتی دیگر با آن متفاوت باشد. پس هوا به دلیل مناسبت با حرارت، همسایه آن شد، هرچند با رطوبت با آن ناسازگار بود، زیرا واسطه بودن اثری و حکمی دارد که با جمع کردن بین دو طرف، بر ناسازگاری با هر دو قوی می‌شود. پس هوا گرم و مرطوب است. از آن جهت که گرم است، به دلیل مناسبت و غلبه واسطه بودن، به آتش تبدیل می‌شود، و از آن جهت که مرطوب است، به آب تبدیل می‌شود به دلیل مناسبت. سپس هوا از طرف پایین با آب همسایه شد. پس هوا همسایگی آتش را به دلیل حرارت پذیرفت و همسایگی آب را به دلیل رطوبت پذیرفت، هرچند با برودت با آن ناسازگار بود، همان‌گونه که هوا با حرارت با آن ناسازگار بود. همچنین بین خاک و آب به دلیل برودت که جامع همسایگی آن‌هاست، همسایگی برقرار کرد. پس جز چهار چیز از آن ظاهر نشد به دلیل آن اصل. همچنین در جسم حیوانی متولد شده، اثر آتش را صفرا، و اثر هوا را خون، و اثر آب را بلغم، و اثر خاک را سودا قرار داد. پس جسم بر چهار طبع ترکیب شد. همچنین قوای چهارگانه: جاذبه، ماسکه، هاضمه و دافعه. همچنین سعادت و شقاوت را به چهار جهت پیوند داد: راست، چپ، پشت و جلو، زیرا جسم به طبع خود در جهت بالا حرکت نمی‌کند و روح به طبع خود در جهت پایین حرکت نمی‌کند، و انسان و حیوان از هر دو ترکیب شده‌اند. پس سعادت و شقاوت او جز در آنچه طبع او در روح و جسمش می‌پذیرد، قرار داده نشد، و آن جهات چهارگانه است. و با آن‌ها مورد خطاب قرار گرفت و ابلیس از آن‌ها بر او وارد شد و گفت: «ثُمَّ لَآتِيَنَّهُمْ مِنْ بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ وَعَنْ أَيْمَانِهِمْ وَعَنْ شَمَائِلِهِمْ» (سپس از پیش رو و از پشت سر و از راست و از چپشان بر آن‌ها وارد می‌شوم) و نگفت از بالا و از پایین، به دلیل آنچه ذکر کردیم. پس ابلیس جز از جهاتی که در سعادت او تأثیر می‌گذارد، اگر از او بشنود و آنچه را که به آن دعوت می‌کند بپذیرد، و در شقاوت او اگر از او نشنود و آنچه را که به آن دعوت کرده است نپذیرد، بر او وارد نشد. پس منزه است خداوند دانا و حکیم که اشیاء را در مراتب خود قرار داده است. و عالم جسمانی علوی نیز چنین کرد. پس برج‌هایی را که احکام از آن‌ها در عالم جاری می‌شود، بر چهار نوع قرار داد: ناری، ترابی، هوایی و آبی. همچنین مادران مطالبات را چهار چیز قرار داد: آیا (هل)، چه (ما)، چرا (لم) و چگونه (کیف). همچنین مادران اسماء مؤثر در عالم را چهار چیز قرار داد: عالم، مرید، قادر و قائل. پس علم او به اینکه چیزی در وقت معینی بر حالتی خاص باشد و نه غیر آن، ممکن نیست. پس این علم، اراده را به تعیین آن حال معلق کرد. پس قائل، قدرت را به ایجاد آن عین معلق کرد. پس دانست، پس اراده کرد، و گفت، پس قدرت داد. پس اعیان از این چهار چیز ظاهر شدند. حرارت برای علم است و یبوست برای اراده و برودت برای قول و رطوبت برای قدرت. پس برای حرارت گرم کردن است و برای یبوست خشک کردن و برای رطوبت نرم کردن و برای برودت سرد کردن. خداوند متعال می‌فرماید: «وَلَا رَطْبٍ وَلَا يَابِسٍ» (و نه تر و نه خشک). پس منفعل‌ها را ذکر کرد نه فاعل‌ها را، زیرا آن‌ها دلالت بر کسی می‌کنند که از او منفعل شده‌اند، و آن‌ها حرارت است که یبوست از آن منفعل شده است و همچنین برودت که رطوبت از آن منفعل شده است. پس بنگر که این تجلیات با حصر خود در آنچه ذکر کردیم، چه داده‌اند. همچنین عالم، سعید مطلق و شقی مطلق و شقی‌ای که به سعادت منتقل می‌شود و سعیدی که به شقاوت منتقل می‌شود، است. پس حالات در چهار مورد محصور شدند. و از این روست: «الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ» (اول و آخر و ظاهر و باطن). و پنجمی وجود ندارد. و این‌ها صفات نسبت او با عالم هستند. و مراتب عدد چهار است و پنجمی ندارد، و آن‌ها آحاد، عشرات، مئات و آلاف هستند. سپس ترکیب رخ می‌دهد و ترکیب آن‌ها مانند ترکیب طبایع است به دلیل وجود ارکان.\n\n### [تا زمانی که ماه کامل (بدر) طلوع کرده است، جان‌ها در بوستان‌ها خفته‌اند]\n\nو ای برادر من، بدان که در شبی که بقیه این منزل را از برکات آن ثبت می‌کردم، رسول خدا (صلی الله علیه و آله و سلم) را دیدم که به پشت دراز کشیده بود و می‌فرمود: «سزاوار است که بنده عظمت خدا را در هر چیزی ببیند، حتی در مسح بر خفین (کفش‌های چرمی) و پوشیدن دستکش.» و من در پاهای پیامبر (صلی الله علیه و آله و سلم) دو نعل سیاه نو و در دستانش دو دستکش می‌دیدم. و گویا او با خوشحالی به آنچه در این منزل از علم به آنچه شایسته جلال خداست، قرار داده بودم، اشاره می‌کرد. سپس می‌فرمود: «تا زمانی که ماه کامل (البدر) طلوع کرده است، جان‌ها در بوستان‌ها خفته‌اند و در قصرهای خود در امان هستند. اما هنگامی که تاریکی باشد و ماه کامل طلوع نکند، از دزدان ترسیده می‌شود. پس سزاوار است که انسان از ترس دزدان وارد شهر شود.» من از این سخن او درک می‌کردم که منظور او این است که هنگامی که شهود حق (شهود الحق) بر جان‌ها غالب باشد و نزد کسی که وارد بوستان‌های معرفت خدا و سخن گفتن در جلال او با انواع و کثرت فنون آن می‌شود، محقق باشد، حق را به ماه کامل تشبیه کرده است و آنچه را که بوستان‌ها از انواع میوه‌ها در بر دارند، به آنچه حضرت الهی (الحضرة الإلهية) از معارف اسماء الهی و صفات جلال و تعظیم در بر دارد، تشبیه کرده است. و از قول او در خواب درک کردم که هنگامی که ماه کامل غایب شود، و آن شهود حق در اشیاء و حضور با او و نیت خالص در اوست، تاریکی جهل و غفلت از خدا و خطا خواهد بود و از دزدان ترسیده می‌شود، و منظور او شبهات گمراه‌کننده (الشبه المضلة) است که برای صاحبان نظر فکری و صاحبان کشف صوری عارض می‌شوند. پس این را به دلیل ترس بر جان‌ها ذکر کرد که اگر در سخن گفتن درباره آنچه شایسته جناب حق است، شدت یابند، باید وارد شهر شوند، یعنی باید با شرع ظاهر از آن پناه جویند و ملازم جماعت باشند، و آن‌ها اهل شهر هستند، زیرا دست خدا با جماعت است. سپس دیدم که پیامبر (صلی الله علیه و آله و سلم) با تمام اعضای خود به شدت بی‌قراری می‌کرد، به دلیل عظمت سروری که در آن بود، به خاطر معرفتی که این منزل در بر داشت. و این در شب بود و ماه کامل طلوع کرده بود، تا اینکه در روز از او دیدم که ماه کامل در وسط آسمان می‌درخشد و گوینده‌ای می‌گفت: رسول خدا (صلی الله علیه و آله و سلم) در بی‌قراری عظیمی دیده نشد به خاطر آنچه از خدا بر او وارد می‌شود و آن را مشاهده می‌کند. و بیدار شدم و رؤیا را در این منزل ثبت کردم و به آنچه دیدم مژده دادم. سپاس و ستایش از آن خداست. و این منزل علوم بسیاری را در بر می‌گیرد، و هیچ منزلی نیست مگر اینکه آنچه از معارف در بر دارد، مجلدات بسیاری را تحمل می‌کند. پس در این شب به یارانم گفتم: من از منزل، تنها برخی از معارفی را که در بر دارد، به عنوان مسئله‌ای از مسائل آن قرار می‌دهم. پس یکی از یارانم از من پرسید: اگر امر چنین است، ما را بر تعداد مسائلی که در بر دارد، با ذکر رؤوس اصول آن‌ها آگاه کن تا آن‌ها را بشناسیم، بدون تفصیل، از ترس طولانی شدن. گفتم: ان شاء الله، شاید این کار را در مورد آنچه از این منازل در این کتاب بر ما باقی مانده است، انجام دهم. پس این شب، شب مبارکی بود.\n\n### [علم تجلی در ستارگان]\n\nپس بدان که این منزل متضمن علم تجلی (التجلی) در ستارگان است، با کثرت آن‌ها، در هر ستاره‌ای در یک لحظه با یک رؤیت، و علم تداخل تجلیات، و علم تجلی تابع و متبوع، و اینکه آیا برای تابع، ذوقی از تجلی متبوع حاصل می‌شود یا خیر؟ زیرا متبوع تنها برای دعوت به سوی خدا آمده است، نه برای دعوت به سوی خود. او گفت: «تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا اللَّهَ وَلَا نُشْرِكَ بِهِ شَيْئًا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ» (بیایید به سوی سخنی که بین ما و شما یکسان است، که جز خدا را نپرستیم و چیزی را شریک او قرار ندهیم و برخی از ما برخی دیگر را به جای خدا به عنوان پروردگار نگیرند). و گفت: «أَدْعُو إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي» (من و کسانی که از من پیروی کردند، با بصیرت به سوی خدا دعوت می‌کنیم). پس برای تابع، نصیبی در دعوت به سوی خدا قرار داد. هر علمی که انسان به دلیل عاقل بودن خود، در آن مستقل باشد و به غیر از رسول یا دلالت‌کننده دیگری نیاز نداشته باشد، مانند علم به توحید خدا و آنچه برای او واجب است، و همچنین آنچه از فیض الهی در کشف (الکشف) در خلوت‌ها و طهارت نفس با مکارم اخلاق برای او حاصل می‌شود، چنین کسی از تجلی، مانند متبوع بهره‌مند است، زیرا او تابع نیست، بلکه صاحب بصیرت است، یا به دلیل دلیل عقلی جاری یا کشف محققی که در آن مانند متبوع است. و هر انسانی که این مقام را نداشته باشد و آنچه از علم به خدا نزد اوست، آن را با ایمان از متبوع گرفته باشد و بر آن راه رفته باشد، و آن علم از جمله علومی باشد که جز بر طریق رسول (صلی الله علیه و آله و سلم) حاصل نمی‌شود، و آن علم تقرب به خداست از جهت قربت بودن نه از جهت علم بودن، و همچنین اعمال بدنی و قلبی بر طریق قربت، جز از متبوع آموخته نمی‌شود. پس اگر تجلی در این مقام برای صاحب این علم باشد، تابع هرگز به متبوع نمی‌رسد. پس آن برای متبوع، تجلی شمسی است و برای تابع، تجلی قمری و نجومی است، پس این را بدان.\n\n### [تجلی حق برای اهل شقاوت در غیر اسم «رب»]\n\nو از جمله آنچه این منزل در بر می‌گیرد، تجلی حق برای اهل شقاوت (أهل الشقاء) در غیر اسم «رب» است، با اینکه خداوند حجاب را تنها در آن روز مخصوص و در اسم «رب» که به آن‌ها اضافه شده است، قرار داده است، نه در اطلاق اسم. پس آن‌ها در حجاب در زمانی مختص از اسم مضاف خاص به خود هستند. پس تجلی او در این اسم خاص برای آن‌ها در غیر آن زمان و در اسم «رب» مطلق و در غیر آن از اسماء، منع نمی‌شود. خداوند متعال می‌فرماید: «كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ» (هرگز! آن‌ها در آن روز از پروردگارشان محجوبند). پس آن را در آن روز به آن‌ها اضافه کرد و آن را زمانی معین قرار داد، پس بفهم.\n\n### [نعمت یافتن به تجلی، تنها برای محبان مشتاق رخ می‌دهد]\n\nو این منزل در بر می‌گیرد که هر تجلی‌ای نعمت‌آور نیست و نعمت یافتن به تجلی، تنها برای محبان مشتاق (المحبين المشتاقين) رخ می‌دهد که به شروط محبت وفا کرده‌اند. و این منزل در بر می‌گیرد بطون عالم شهود (عالم الشهادة) در غیب را. پس آنچه شهود بود، غیب می‌شود و آنچه غیب بود، شهود می‌شود. و برخی از عارفان در نشئه آخرت به این قائل شده‌اند که اجسام در ارواح پنهان می‌شوند و ارواح برای آن‌ها ظروف ظاهری می‌شوند، برعکس آنچه در دنیاست. پس ظاهر در سرای آخرت و حکم برای روح است نه برای جسم. و به همین دلیل، به هر صورتی که بخواهند، تبدیل می‌شوند، به دلیل غلبه روحانیت بر آن‌ها و غیبت جسمیت در آن، همان‌گونه که امروز فرشتگان و عالم ارواح نزد ما هستند که در هر صورتی که بخواهند ظاهر می‌شوند. و از منازل اصحاب کشف (أصحاب الكشف) که حشر اجسام را انکار کردند، این است که آن‌ها در کشف خود، امر واقع شده در سرای آخرت را دیدند و ارواحی را دیدند که در صورت‌ها تبدیل می‌شوند، همان‌گونه که می‌خواهند، و آنچه آن ارواح از جسمیت در بر دارند، از آن‌ها پنهان ماند، همان‌گونه که در این دنیا روحانیت پنهان در اجسام از آن‌ها پنهان ماند. پس اجسام برای آن‌ها قبرها بودند و در آخرت برعکس، ارواح قبور اجسام هستند. به همین دلیل، آن‌ها آن را انکار کردند. و کشف تام که ما و یارانمان در اینجا و در آخرت به آن دست یافتیم، این است که ما ارواح را در اینجا کشف کردیم و اجسام طبیعی بر آن‌ها در صورت ظاهر غلبه کردند. پس از ارواح در ظاهر اجسام جز آثار آن‌ها دیده نمی‌شود. و اگر مرگ و خواب نبود، غیر مکاشف نمی‌دانست که امری علاوه بر آنچه در ظاهر مشاهده می‌کند، وجود دارد. و با وجود مرگ و سکون و ظهور جسم عریان از آثاری که داشت، گروهی به این مذهب رفتند و آن‌ها حشیشیه هستند. پس آن‌ها ندیدند که پشت این صورت ظاهر، اصلاً چیزی وجود دارد. پس حال این‌ها چگونه بود اگر مرگی در عالم نبود؟ و این منزل متضمن معرفت عالم علوی و ترتیب صورت آن در ترکیبش است و اینکه بر خلاف آنچه صاحبان علم هیئت ذکر می‌کنند، است. اگرچه آنچه آن‌ها گفتند، دلیل آن را می‌دهد و جایز است که خداوند آن را بر آن ترتیب قرار دهد، اما این کار را نکرده است، با اینکه این ترتیب، همان چیزی را می‌دهد که آنچه صاحبان علم هیئت به آن قائل شدند، می‌دهد. و متضمن علم آنچه خداوند در عالم سفلی در ترتیب آن از امور به ودیعه نهاده است، می‌باشد. و متضمن معرفت مکلفین و اینکه از کجا مکلف شدند و چه چیزی آن‌ها را به حرکت درمی‌آورد، است. و متضمن علم قربات است. و متضمن علم سبب در هم شکستن جباران متکبر بر خداست. و متضمن ملحق کردن حیوان به انسان در علم به خداست. و متضمن علم عواقب و سرانجام هر عالمی است. پس من رؤوس و مسائل آن را ذکر کردم. و خداوند حق می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 8
}