{
  "id": 428,
  "title": {
    "ar": "الباب الثامن والعشرون وأربعمائة في معرفة منازلة الاستفهام عن الإنيتين",
    "en": "Chapter Four Hundred and Twenty-Eight: Concerning the Gnosis of the Modes of Interrogation Regarding the Two Selfhoods (الإنيتين)",
    "ur": "باب چار سو اٹھائیس (۴۲۸): دو انیتوں (الإنيتين) کے متعلق استفہام کی منازل کی معرفت میں",
    "fa": "باب چهارصد و بیست و هشتم در معرفت منزلگاه‌های پرسش از دو «من» (الإنيتين)"
  },
  "content": {
    "ar": "## «الباب الثامن والعشرون وأربعمائة في معرفة منازلة الاستفهام عن الإنيتين»\n\n\n> إذا ما كنت عيني في وجودي *** وكل أين قواي أنا وأنتا\n\n\n> فأما إن يكون الشأن عيني *** وإما أن يكون الشأن أنتا\n\n\n> وإما أن أكون أنا بوجه *** ومن وجه سواه تكون أنتا\n\n\n> فأنت الحرف لا يقرأ فيدرى *** وأنت محير الحيران أنتا\n\n\n> أرى عجزا وذاك العجز عيني *** وجهلا بالأمور فأين أنتا\n\n\n> فما أقوى على تحصيل علم *** ولا تقوى على التوصيل أنتا\n\n\n> فحرنا في وجود الحق عجزا *** وحرت وعزة الرحمن أنتا\n\n\n> فزال أنا وهو والأنت فانظر *** إلى قولي إذا ما قلت أنتا\n\n\n> فمن أعني بأنت ولست عيني *** ولا غيري فحرت بلفظ أنتا\n\n\n> لأني لا أرى مدلول لفظي *** ولا أنا عالم من قال أنتا\n\n\n> أرى أمرا تضمنه وجودي *** وأنت تغار منه وليس أنتا\n\n\n> فإن زلنا تقول فعلت عبدي *** فتثبتنا بأمر ليس أنتا\n\n\n> فقل لي من أنا حتى أراه *** فاعرف هل أنا أو أنت أنتا\n\n\n> فلو لا الله ما كنا عبيدا *** ولو لا العبد لم تك أنت أنتا\n\n\n> فأثبتني لنثبتكم إلها *** ولا تنفي الأنا فيزول أنتا\nقال الله تعالى وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ فهذا إثبات الإنيتين وإثبات حكمهما ثم نفى الحكم عن إحداهما بعد إثباته وهو الصادق القول‏\n\n\n### [أن إنية الشي‏ء حقيقته في اصطلاح القوم‏]\n\n\nفاعلم أن إنية الشي‏ء حقيقته في اصطلاح القوم فهي في جانب الحق إني أنا ربك وفي جانب الخلق الكامل إني رسول الله فهاتان أنيتان ضبطتهما العبارة وهما طرفان فلكل واحدة من الإنيتين حكم ليس للأخرى‏\n\n\n> وذاك الذي قالوا وذاك الذي عنوا *** وما ثم إلا الله ليس سواه‏\n\n\n> وكلف والتكليف يطلب حادثا *** ويطلب من يدري وما ثم إلا هوفالإنية الإلهية قائلة والإنية القابلة سامعة وما لها قول إلا بالتكوين فلا يقال لإنية الخلق في حال وجودها وما القول إلا لمن هو في حال العدم فلا تكليف إلا في المعدوم لعدم نسبة الإيجاد للحادث فلا يقال للمنفعل انفعل فقد انفعل بقبوله الوجود ولا إيجاد يكون عنه فلا قول له وما ثم عبث فإذا كلف قال لما كلف به كن في حال عدمه فيكون في محل هذا الحادث فينسب إليه وليس إليه فلهذا كانت الإنيتان طرفين فتميزتا إلا أن لإنية الحادث منزلة الفداء والإيثار لجناب الحق بكونها وقاية وبهذه الصفة من الوقاية تندرج إنية العبد في الحق اندراجا في ظهور وهو قوله تعالى إِنَّنِي أَنَا الله فلو لا نون العبد التي أثر فيها حرف الياء الذي هو ضمير الحق فخفض النون فظهر أثر القديم في المحدث ولولاه لخفضت النون من أن وهي إنية الحق كما أثرت في قوله إِنِّي أَنَا رَبُّكَ فإنه لا بد لها من أثر فلما لم تجد إنية العبد التي هي نون الوقاية أثرت في إنية الحق فخفضتها ومقامها الرحمة التي هي الفتح فما أزاله عن مقامه إلا هو ولا أثر فيه سواه فأقرب ما يكون العبد من الحق إذا كان وقاية بين إنية الحق وبين ضميره فيكون محصورا قد أحاط به الحق من كل جانب وكان به رحيما لبقاء صفة الرحمة فبابها مفتوح وبها حفظ على المحدث وجوده فبقي عين نون الوقاية الحادثة في مقام العبودية الذي هو الخفض المتولد عن ياء ضمير الحق فظهر في العبد أثر الحق وهو عين مقام العبد الذلة والافتقار فما للعبد مقام في الوصلة بالحق تعالى أعظم من هذا حيث له وجود العين بظهور مقامه فيه وهو في حال اندراج في الحق محاط به من كل جانب فعرف نفسه بربه حين أثر فيه الخفض فعرف ربه حين أبقاه على ما هو عليه من الرحمة فإنه الرحمن الرحيم فما زال عنه الفتح بوجود عين العبد فلا يشهده أبدا إلا رحمانا ولا يعلمه أبدا إلا مؤثرا فيه فلا يزال في عبوديته قائما وهذا غاية القرب ولما حار أبو يزيد في القرب من الله قبل أن يشهد هذا المقام قال لربه يا رب بما ذا أتقرب إليك فقال بما ليس لي فقال يا رب وما ليس لك وكل شي‏ء لك فقال الذلة والافتقار فعلم عند ذلك ما لإنية الحق وما لإنية العبد فدخل في هذا المقام فكان له القرب الأتم فجمع بين الشهود والوجود إذ كان كل شي‏ء هالك فإن الشهود عند القوم فناء حكم لا فناء عين وفي هذا المقام شهود بلا فناء عين وهو محل الجمع بيننا وبين الطائفة وبلا فناء حكم فإنه أبقى للحق ما يستحقه من الفتح الرحموتي إذ لولاه أعني لو لا هذا القرب المعين لعاد الأثر على إنية الحق ولهذا أظهر في إِنِّي أَنَا رَبُّكَ ليعلم أن الأثر إذا صدر من الحق لا بد له من ظهور حكم وما وجد إلا الحق فعاد عليه فجاء العبد فدخل بين الإنية الإلهية والمؤثر فعمل فيه‏\n\n\n> فانية الخلق مضبوطة *** وإنية الحق ما تنضبط\n\n\n> فيأخذ من ذا ويعطيه ذا *** وكل بأحواله مغتبط\n\n\n> فربط الوجود بعين الشهود *** مقام جليل لمن يرتبط\n\n\n> وليس ينال مقام الدنو *** عبيد إذا سره قد شحط\n\n\nوما فرحت بشي‏ء قط مما وهبنيه الحق من المنح التي تقبلها الأكوان فرحى بهذا المقام إذ حلاني به ربي وهو أعلى المقامات وأسناها وهو مقام كل ما سوى الله ولا يشعر به وليست العناية من الله ببعض عباده إلا أن يشهده هذا المقام من نفسه فما يزيد على العالم كله إلا بالعلم به حالا وذوقا ولا يجني أحد ثمرة الإيثار مثل ما يجنيها صاحب هذا المقام فإن ثمرة الإيثار على قدر من تؤثره على نفسك والذي تؤثره على نفسك هنا إنما هو الحق فينسب إليك الفرح بما تجنيه من ثمرة هذا الإيثار على صورة نسبة الفرح إلى الحق‏\n\n\nفانظر ما أعظمها من لذة وابتهاج وهذا أخصر\nما يمكن من الإبانة عن هذا المقام والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 428: On the Knowledge of the Station of Questioning Concerning the Two I-nesses\n\nIf I am My very Essence (عين) in My Existence (وجود),\nAnd every 'where' (أين) of My powers is 'I' and 'You'.\n\nThen either the Affair (الشأن) is My Essence,\nOr the Affair is You.\n\nAnd either I am 'I' by one aspect,\nAnd by an aspect other than it, You are 'You'.\n\nSo You are the Letter that is not read so as to be known,\nAnd You are the bewilderer of the bewildered, You.\n\nI see incapacity, and that incapacity is My Essence,\nAnd ignorance of affairs, so where are You?\n\nI am not strong enough to attain knowledge,\nNor are You strong enough to deliver (it).\n\nSo we are bewildered in the existence of the Real (الحق) through incapacity,\nAnd You are bewildered, by the glory of the All-Merciful, You.\n\nThen 'I' and 'He' and 'You' vanished, so look\nAt My saying when I said 'You'.\n\nWhom do I mean by 'You' when You are not My Essence,\nNor other than Me? So I am bewildered by the word 'You'.\n\nBecause I do not see the referent of My word,\nNor do I know who said 'You'.\n\nI see an affair contained within My existence,\nAnd You are jealous of it, yet it is not You.\n\nIf we vanish, You say, \"My servant acted,\"\nSo You establish us by an affair that is not You.\n\nTell me, who am I, so that I may see him,\nAnd know whether 'I' or 'You' are You.\n\nWere it not for Allah, we would not be servants,\nAnd were it not for the servant, You would not be You.\n\nSo establish me, that we may establish You as God,\nAnd do not negate the 'I' (الأنا), lest 'You' vanish.\n\nAllah the Exalted said: <<وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللهَ رَمَى>> (And you did not throw when you threw, but Allah threw). This is the affirmation of the two I-nesses (الإنيتين) and the affirmation of their respective rulings, followed by the negation of the ruling from one of them after its affirmation. And He is the Truthful in speech.\n\n### [That the I-ness (إنّية) of a thing is its Reality (حقيقة) in the terminology of the People]\n\nKnow that the I-ness (إنّية) of a thing is its Reality (حقيقة) in the terminology of the People [of Sufism]. Thus, in the aspect of the Real (الحق), it is: \"Indeed, I, I am your Lord\" (إِنِّي أَنَا رَبُّكَ), and in the aspect of the Perfect Human (الخلق الكامل), it is: \"Indeed, I am the Messenger of Allah\" (إِنِّي رَسُولُ الله). These are two I-nesses (أنيتان) defined by the expression, and they are two extremes (طرفان). Each of the two I-nesses has a ruling (حكم) that the other does not possess.\n\nThat is what they said, and that is what they meant,\nAnd there is nothing there but Allah; there is none besides Him.\n\nAnd He imposes obligation, and obligation requires a contingent being (حادث),\nAnd it requires one who knows, yet there is nothing there but Him.\n\nThe Divine I-ness (الإنية الإلهية) is the Speaker, and the receptive I-ness (الإنية القابلة) is the Hearer. The latter has no speech except through the act of bringing into existence (التكوين). Thus, the I-ness of creation is not addressed in its state of existence, for speech belongs only to that which is in the state of non-existence. Therefore, obligation (تكليف) applies only to the non-existent, due to the impossibility of attributing the act of origination (الإيجاد) to the contingent being. It is not said to the passive entity (المنفعل), \"Be passive,\" for it has already become passive by accepting Existence (الوجود), and no origination proceeds from it, so it has no speech. There is no futility (عبث) in the matter. When He imposes obligation, He says to that which is obligated, \"Be\" (كن), while it is in its state of non-existence, and it comes to be in the locus of this contingent being, and the act is attributed to it, though it is not truly from it. For this reason, the two I-nesses are two extremes and are distinct.\n\nHowever, the I-ness of the contingent being holds the station of ransom (الفداء) and preference (الإيثار) for the Divine Presence (جناب الحق) by acting as a protective particle (وقاية). By means of this quality of protection, the I-ness of the servant is integrated into the Real (الحق) in a manifestation, which is His saying, <<إِنَّنِي أَنَا الله>> (Indeed, I, I am Allah).\n\nWere it not for the *nūn* (ن) of the servant, which is affected by the letter *yā’* (ي) – the pronoun of the Real (ضمير الحق) – causing the *nūn* to be lowered (خفض), the effect of the Eternal (القديم) would not have appeared in the contingent (المحدث). Were it not for this, the *nūn* of *inna* (إنّ), which is the I-ness of the Real, would have been lowered, just as it was affected in His saying, <<إِنِّي أَنَا رَبُّكَ>> (Indeed, I, I am your Lord). For it must necessarily have an effect. When the I-ness of the servant, which is the protective *nūn* (نون الوقاية), found no effect, it affected the I-ness of the Real, lowering it.\n\nIts station is Mercy (الرحمة), which is the Opening (الفتح). Nothing removed it from its station except Him, and nothing affected it but Him.\n\nThe closest the servant can be to the Real is when he acts as a protection (وقاية) between the I-ness of the Real and His pronoun. He is thus encompassed, surrounded by the Real on every side, and He is Merciful to him due to the persistence of the Attribute of Mercy (صفة الرحمة). Its door remains open, and by it, the contingent being maintains its existence.\n\nThus, the very essence of the contingent protective *nūn* remains in the station of servanthood (العبودية), which is the lowering (الخفض) generated by the *yā’* of the Real’s pronoun. The effect of the Real appears in the servant, which is the very station of the servant: humility (الذلة) and need (الافتقار).\n\nThe servant has no station in connection (وصلة) with the Exalted Real greater than this, where he possesses the existence of the essence (وجود العين) through the manifestation of his station within it, while simultaneously being integrated into the Real and encompassed by Him on every side.\n\nHe knew himself by his Lord when the lowering affected him, and he knew his Lord when He preserved him upon what He is: Mercy, for He is the All-Merciful (الرحمن) and the Compassionate (الرحيم). The Opening never departs from him due to the existence of the servant’s essence. Thus, he never witnesses Him except as the All-Merciful, and he never knows Him except as the One who affects him. He remains perpetually established in his servanthood. This is the ultimate proximity (غاية القرب).\n\nWhen Abu Yazid was bewildered concerning proximity to Allah before witnessing this station, he said to his Lord, \"O Lord, by what means shall I draw near to You?\" He replied, \"By that which is not Mine.\" Abu Yazid asked, \"O Lord, what is not Yours, when everything belongs to You?\" He replied, \"Humility (الذلة) and need (الافتقار).\"\n\nHe then understood what belonged to the I-ness of the Real and what belonged to the I-ness of the servant. He entered this station and attained the most complete proximity (القرب الأتم), combining witnessing (الشهود) and existence (الوجود), since everything is perishing (هالك).\n\nWitnessing (الشهود), according to the People, is the annihilation of the ruling (فناء حكم), not the annihilation of the essence (فناء عين). In this station, there is witnessing without the annihilation of the essence—which is the point of convergence between us and the [other] group—and without the annihilation of the ruling, for it preserves for the Real what is due to Him of the Merciful Opening (الفتح الرحموتي).\n\nWere it not for this—meaning, were it not for this specific proximity—the effect would revert to the I-ness of the Real. For this reason, He manifested in <<إِنِّي أَنَا رَبُّكَ>> (Indeed, I, I am your Lord), so that it might be known that when an effect proceeds from the Real, the manifestation of a ruling is necessary. Since nothing exists but the Real, the effect reverted to Him. Then the servant came and entered between the Divine I-ness and the One who affects, and he acted upon it.\n\nThe I-ness of creation (انية الخلق) is constrained,\nBut the I-ness of the Real (إنية الحق) is not constrained.\n\nSo He takes from this one and gives to that one,\nAnd each is delighted in its states.\n\nThe binding of Existence (الوجود) to the Essence of Witnessing (عين الشهود)\nIs a glorious station for the one who is bound.\n\nAnd the station of proximity (مقام الدنو) is not attained\nBy servants whose secret has been removed far away.\n\nI have never rejoiced in anything that the Real granted me—among the gifts accepted by the cosmoses—as much as I rejoiced in this station, for my Lord adorned me with it. It is the highest and most sublime of stations, and it is the station of everything other than Allah, though it does not perceive it. The special Divine care (العناية) shown to some of His servants is nothing other than making them witness this station within themselves. Thus, one does not surpass the entire world except through the knowledge of this station, both as a spiritual state (حالا) and as direct experience (ذوقا). No one reaps the fruit of preference (الإيثار) like the possessor of this station, for the fruit of preference is proportional to the one whom you prefer over yourself. And the one whom you prefer over yourself here is none other than the Real (الحق). Thus, the joy you reap from the fruit of this preference is attributed to you in the manner that joy is attributed to the Real.\n\nLook, then, at how immense this delight and joy are. This is the most concise explanation possible concerning this station. And <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو اٹھائیس: دو انیتوں (الإنيتين) کے بارے میں استفہام کی منزلوں کی معرفت میں\n\nجب تم میری ہستی (الوجود) میں میری آنکھ ہو، اور میری تمام قوتوں کا ہر مقام میں 'میں' اور 'تم' ہو۔\nتو یا تو یہ معاملہ میری آنکھ ہے، اور یا تو یہ معاملہ 'تم' ہو۔\nاور یا تو میں ایک رُخ سے 'میں' ہوں، اور اس کے سوا دوسرے رُخ سے 'تم' ہوں۔\nپس تم وہ حرف ہو جو پڑھا نہیں جاتا تاکہ سمجھا جائے، اور تم ہی حیران کو حیران کرنے والے ہو۔\nمیں عجز دیکھتا ہوں اور وہ عجز میری آنکھ ہے، اور معاملات سے جہالت دیکھتا ہوں، تو 'تم' کہاں ہو؟\nپس نہ تو میں علم حاصل کرنے کی طاقت رکھتا ہوں، اور نہ ہی تم (اسے) پہنچانے کی طاقت رکھتے ہو۔\nپس ہم ذات حق (الحق) کی ہستی (الوجود) میں عاجزی کے سبب حیران ہوئے، اور رحمن کی عزت کی قسم، تم بھی حیران ہوئے۔\nپس 'میں'، 'وہ'، اور 'تم' سب زائل ہو گئے، تو میرے اس قول پر غور کرو جب میں نے کہا 'تم'۔\nمیں 'تم' سے کس کو مراد لیتا ہوں جبکہ تم نہ میری آنکھ ہو اور نہ ہی میرے غیر، پس میں لفظ 'تم' میں حیران ہوا۔\nکیونکہ میں اپنے لفظ کا مدلول نہیں دیکھتا، اور نہ ہی میں جانتا ہوں کہ 'تم' کس نے کہا۔\nمیں ایک ایسا امر دیکھتا ہوں جسے میری ہستی (الوجود) نے اپنے اندر شامل کر رکھا ہے، اور تم اس سے غیرت کھاتے ہو، حالانکہ وہ تم نہیں ہو۔\nپس اگر ہم زائل ہو جائیں تو تم کہتے ہو: \"میرے بندے، تم نے کیا\"، پس تم ہمیں ایک ایسے امر سے ثابت کرتے ہو جو تم نہیں ہو۔\nپس مجھے بتاؤ کہ میں کون ہوں تاکہ میں اسے دیکھوں، اور جانوں کہ کیا 'میں' یا 'تم' ہی 'تم' ہو۔\nاور اگر اللہ نہ ہوتا تو ہم بندے نہ ہوتے، اور اگر بندہ نہ ہوتا تو تم 'تم' نہ ہوتے۔\nپس مجھے ثابت کرو تاکہ ہم تمہیں معبود کے طور پر ثابت کریں، اور 'میں' کی نفی نہ کرو ورنہ 'تم' زائل ہو جاؤ گے۔\n\nاللہ تعالیٰ نے فرمایا: \"وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَىٰ\" (اور جب تم نے پھینکا تو تم نے نہیں پھینکا، بلکہ اللہ نے پھینکا)۔ پس یہ دو انیتوں (الإنيتين) کا اثبات ہے اور ان کے حکم کا اثبات ہے، پھر اثبات کے بعد ان میں سے ایک سے حکم کی نفی کر دی گئی، اور وہ (اللہ) سچا کہنے والا ہے۔\n\n### [قوم (صوفیاء) کی اصطلاح میں شے کی انیت (الإنية) ہی اس کی حقیقت ہے]\n\nپس جان لو کہ قوم (صوفیاء) کی اصطلاح میں شے کی انیت (الإنية) ہی اس کی حقیقت ہے۔ پس یہ ذات حق (الحق) کی جانب سے \"إِنِّي أَنَا رَبُّكَ\" (بے شک میں ہی تمہارا رب ہوں) ہے، اور انسان کامل (الإنسان الکامل) کی جانب سے \"إِنِّي رَسُولُ اللَّهِ\" (بے شک میں اللہ کا رسول ہوں) ہے۔ یہ دو انیتیں (الإنيتان) ہیں جنہیں عبارت نے ضبط کیا ہے، اور یہ دو کنارے ہیں۔ پس ان دو انیتوں میں سے ہر ایک کا ایک ایسا حکم ہے جو دوسرے کے لیے نہیں ہے۔\n\nاور یہی وہ ہے جو انہوں نے کہا، اور یہی وہ ہے جو ان کا مطلب تھا، اور وہاں اللہ کے سوا کچھ نہیں، اس کے سوا کوئی نہیں۔\nاور مکلف بنایا گیا، اور تکلیف (شرعی ذمہ داری) حادث (پیدا شدہ) کو چاہتی ہے، اور اس کو چاہتی ہے جو جانتا ہو، اور وہاں اس (اللہ) کے سوا کوئی نہیں۔\n\nپس انیتِ الٰہیہ (الإنية الإلهية) کہنے والی ہے اور انیتِ قبول کرنے والی (القابلة) سننے والی ہے۔ اور اس (قبول کرنے والی انیت) کا کوئی قول نہیں مگر تکوین (پیدا کرنے) کے ذریعے، لہٰذا خلق (الخلق) کی انیت (الإنية) کو اس کی حالتِ وجود (الوجود) میں کچھ نہیں کہا جاتا۔ اور قول صرف اس کے لیے ہے جو حالتِ عدم میں ہو۔ پس تکلیف (شرعی ذمہ داری) صرف معدوم (جو موجود نہ ہو) میں ہے، کیونکہ حادث (پیدا شدہ) کی طرف ایجاد کی نسبت نہیں کی جاتی۔ پس منفعل (جس پر فعل کیا گیا ہو) کو یہ نہیں کہا جاتا کہ \"تم نے فعل کیا\"، کیونکہ وہ تو وجود (الوجود) کو قبول کرنے سے منفعل ہوا ہے، اور اس کی طرف سے کوئی ایجاد نہیں ہوتی، لہٰذا اس کا کوئی قول نہیں۔ اور وہاں کوئی عبث (بے کار چیز) نہیں ہے۔ پس جب اسے مکلف بنایا جاتا ہے تو جو چیز مکلف بنائی گئی ہے اسے حالتِ عدم میں کہا جاتا ہے \"کُن\" (ہو جا)، تو وہ اس حادث کے محل میں ہو جاتا ہے، پس اس کی نسبت اس کی طرف کی جاتی ہے حالانکہ وہ اس کی طرف سے نہیں ہے۔ اسی لیے دو انیتیں (الإنيتان) دو کنارے ہیں اور ان میں تمیز ہے۔ مگر یہ کہ انیتِ حادث کے لیے فداء (قربانی) اور ایثار کی منزل ہے ذات حق (الحق) کے لیے، اس طرح کہ وہ ایک وقایہ (حفاظت/سپر) بن جاتی ہے۔ اور وقایہ (الوقاية) کی اس صفت کے ذریعے بندے کی انیت (الإنية) ذات حق (الحق) میں ایک ظہور کے ساتھ داخل ہو جاتی ہے، اور وہ اللہ تعالیٰ کا یہ قول ہے: \"إِنَّنِي أَنَا اللَّهُ\" (بے شک میں ہی اللہ ہوں)۔ اگر بندے کا وہ نون نہ ہوتا جس پر حرفِ یاء نے اثر کیا جو کہ ذات حق (الحق) کا ضمیر ہے، پس اس نے نون کو خفض (زیر) دیا، تو قدیم کا اثر محدث (پیدا شدہ) میں ظاہر ہوا۔ اور اگر وہ نہ ہوتا تو 'اَن' (ان) کا نون خفض (زیر) دیا جاتا، اور وہ انیتِ حق (الإنية الحق) ہے، جیسا کہ اس نے اس قول میں اثر کیا: \"إِنِّي أَنَا رَبُّكَ\" (بے شک میں ہی تمہارا رب ہوں)۔ کیونکہ اس (نون) کے لیے اثر کا ہونا ضروری ہے۔ پس جب اسے بندے کی انیت (الإنية) جو کہ نونِ وقایہ ہے، نہ ملی تو اس نے انیتِ حق (الإنية الحق) پر اثر کیا اور اسے خفض (زیر) دیا۔ اور اس کا مقام رحمت (الرحمة) ہے جو کہ فتح (الفتح) ہے۔ پس اسے اس کے مقام سے اس (اللہ) کے سوا کسی نے نہیں ہٹایا، اور نہ ہی اس میں اس کے سوا کسی نے اثر کیا۔ پس بندہ ذات حق (الحق) سے سب سے زیادہ قریب اس وقت ہوتا ہے جب وہ انیتِ حق (الإنية الحق) اور اس کے ضمیر کے درمیان وقایہ (الوقاية) بن جاتا ہے، پس وہ محصور ہو جاتا ہے، ذات حق (الحق) نے اسے ہر طرف سے گھیر لیا ہوتا ہے، اور وہ اس پر رحیم ہوتا ہے کیونکہ صفتِ رحمت (الرحمة) باقی رہتی ہے، پس اس کا دروازہ کھلا ہے۔ اور اسی کے ذریعے محدث (پیدا شدہ) کی ہستی (الوجود) کو محفوظ رکھا گیا ہے۔ پس حادث نونِ وقایہ (الوقاية) کا عین، مقامِ عبودیت (بندگی) میں باقی رہا جو کہ ذات حق (الحق) کے ضمیر کی یاء سے پیدا ہونے والا خفض (زیر) ہے۔ پس بندے میں ذات حق (الحق) کا اثر ظاہر ہوا، اور وہ بندے کے مقامِ ذلت اور افتقار کا عین ہے۔ پس بندے کے لیے حق تعالیٰ کے ساتھ وصل (ملاپ) میں اس سے بڑا کوئی مقام نہیں، جہاں اسے عین کا وجود حاصل ہے اس کے مقام کے اس میں ظاہر ہونے سے، اور وہ ذات حق (الحق) میں اندراج کی حالت میں ہے، ہر طرف سے اس کا احاطہ کیا گیا ہے۔ پس اس نے اپنے رب کو پہچانا جب اس میں خفض (زیر) نے اثر کیا، اور اس نے اپنے رب کو پہچانا جب اس نے اسے رحمت (الرحمة) پر باقی رکھا جس پر وہ ہے، کیونکہ وہ رحمن و رحیم ہے۔ پس بندے کے عین کے وجود سے فتح (الفتح) اس سے زائل نہیں ہوا، پس وہ اسے کبھی نہیں دیکھتا مگر رحمان کی صورت میں، اور اسے کبھی نہیں جانتا مگر اس میں اثر کرنے والے کی صورت میں۔ پس وہ اپنی عبودیت (بندگی) میں ہمیشہ قائم رہتا ہے، اور یہ قرب کی انتہا ہے۔ اور جب ابو یزید (بسطامی) اس مقام کا شہود (الشهود) کرنے سے پہلے اللہ کے قرب میں حیران ہوئے تو انہوں نے اپنے رب سے کہا: \"اے رب! میں کس چیز کے ذریعے تیرا قرب حاصل کروں؟\" تو اللہ نے فرمایا: \"اس چیز کے ذریعے جو میری نہیں ہے۔\" تو انہوں نے کہا: \"اے رب! وہ کیا چیز ہے جو تیری نہیں، حالانکہ ہر چیز تیری ہے؟\" تو اللہ نے فرمایا: \"ذلت اور افتقار (محتاجی)۔\" پس اس وقت انہوں نے جان لیا کہ انیتِ حق (الإنية الحق) کے لیے کیا ہے اور انیتِ عبد (الإنية العبد) کے لیے کیا ہے۔ پس وہ اس مقام میں داخل ہوئے اور انہیں کامل ترین قرب حاصل ہوا، پس انہوں نے شہود (الشهود) اور وجود (الوجود) کو جمع کر لیا، کیونکہ ہر چیز ہلاک ہونے والی ہے۔ اور قوم (صوفیاء) کے نزدیک شہود (الشهود) حکم کی فنا ہے نہ کہ عین کی فنا۔ اور اس مقام میں عین کی فنا کے بغیر شہود (الشهود) ہے، اور یہی ہمارے اور اس طائفہ (صوفیاء) کے درمیان جمع ہونے کا محل ہے، اور حکم کی فنا کے بغیر، کیونکہ اس نے ذات حق (الحق) کے لیے وہ باقی رکھا جس کا وہ رحمتی فتح (الفتح) سے مستحق ہے۔ کیونکہ اگر وہ نہ ہوتا، یعنی اگر یہ معین قرب نہ ہوتا، تو اثر انیتِ حق (الإنية الحق) پر لوٹ آتا۔ اور اسی لیے اس نے \"إِنِّي أَنَا رَبُّكَ\" میں ظاہر کیا تاکہ یہ معلوم ہو جائے کہ جب اثر ذات حق (الحق) سے صادر ہوتا ہے تو اس کے حکم کا ظاہر ہونا ضروری ہے، اور وہاں ذات حق (الحق) کے سوا کچھ موجود نہیں تھا، پس وہ اثر اسی پر لوٹ آیا۔ پھر بندہ آیا اور انیتِ الٰہیہ (الإنية الإلهية) اور مؤثر کے درمیان داخل ہوا اور اس میں عمل کیا۔\n\nپس خلق (الخلق) کی انیت (الإنية) تو مضبوط ہے، اور ذات حق (الحق) کی انیت (الإنية) مضبوط نہیں ہوتی۔\nپس وہ اس سے لیتا ہے اور اسے دیتا ہے، اور ہر کوئی اپنی حالتوں پر خوش ہے۔\nپس وجود (الوجود) کو عینِ شہود (الشهود) سے باندھنا، اس شخص کے لیے ایک عظیم مقام ہے جو اس سے جڑ جائے۔\nاور قرب (الدنو) کا مقام وہ بندے حاصل نہیں کرتے جن کا راز دور ہو چکا ہو۔\n\nاور مجھے کبھی بھی کسی ایسی عطا پر اتنی خوشی نہیں ہوئی جو ذات حق (الحق) نے مجھے بخشی ہو اور جسے اکوان (کائناتیں) قبول کرتی ہیں، جتنی خوشی مجھے اس مقام پر ہوئی جب میرے رب نے مجھے اس سے آراستہ کیا۔ اور یہ تمام مقامات میں سب سے اعلیٰ اور بلند ہے، اور یہ ہر اس چیز کا مقام ہے جو اللہ کے سوا ہے، مگر وہ اسے محسوس نہیں کرتا۔ اور اللہ کی طرف سے اپنے بعض بندوں پر عنایت صرف یہ ہے کہ وہ اسے یہ مقام اس کے نفس سے دکھا دے۔ پس وہ تمام عالم پر صرف اس کے علم کے ذریعے، حال اور ذوق کے اعتبار سے، بڑھ جاتا ہے۔ اور کوئی بھی ایثار (دوسرے کو ترجیح دینے) کا پھل اس طرح نہیں کاٹتا جس طرح اس مقام کا مالک کاٹتا ہے۔ کیونکہ ایثار کا پھل اس شخص کے مرتبے کے مطابق ہوتا ہے جسے تم اپنے نفس پر ترجیح دیتے ہو، اور جسے تم یہاں اپنے نفس پر ترجیح دیتے ہو وہ ذات حق (الحق) ہی ہے، پس تمہیں اس ایثار کے پھل سے جو خوشی حاصل ہوتی ہے، اس کی نسبت ذات حق (الحق) کی طرف خوشی کی نسبت کی صورت میں کی جاتی ہے۔\n\nپس دیکھو یہ کتنی عظیم لذت اور شادمانی ہے۔ اور یہ اس مقام کی وضاحت کا مختصر ترین طریقہ ہے جو ممکن ہے۔ \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و بیست و هشتم در معرفت جایگاه‌های پرسش از دو انیت (I-ness)\n\nاگر در هستی‌ام، چشم من باشی\nو هر «کجا»یی، قوای من، من و تو باشیم\n\nپس یا شأن (امر) چشم من است\nو یا شأن (امر) تو هستی\n\nو یا من از یک وجه، من هستم\nو تو از وجهی دیگر، تو هستی\n\nتو حرفی هستی که خوانده نمی‌شود تا درک گردد\nو تویی که حیران را حیران می‌کنی، تو هستی\n\nعجز می‌بینم و آن عجز، چشم من است\nو جهل به امور؛ پس تو کجایی؟\n\nمن بر تحصیل علم توانا نیستم\nو تو بر رساندن (علم) توانا نیستی\n\nپس ما در هستی حق (الحق) از عجز حیران شدیم\nو به عزت خداوند رحمان، تو حیران شدی\n\nپس «من» و «او» و «تو» زائل شدند، پس بنگر\nبه سخن من آنگاه که گفتم «تو»\n\nمنظورم از «تو» کیست، در حالی که نه چشم من هستی\nو نه غیر من؛ پس در لفظ «تو» حیران شدم\n\nزیرا مدلول لفظ خود را نمی‌بینم\nو نمی‌دانم چه کسی «تو» گفت\n\nامری را می‌بینم که هستی‌ام (وجودي) آن را در بر گرفته\nو تو بر آن غیرت می‌ورزی، در حالی که تو نیستی\n\nاگر ما زائل شویم، تو می‌گویی: «بنده‌ام، انجام دادی»\nپس ما را با امری که تو نیستی، ثابت می‌کنی\n\nپس به من بگو من کیستم تا او را ببینم\nو بدانم آیا من هستم یا تو، تو هستی؟\n\nاگر خدا نبود، ما بنده نبودیم\nو اگر بنده نبود، تو، تو نبودی\n\nپس مرا ثابت کن تا شما را به عنوان خدا ثابت کنیم\nو «من» را نفی مکن که «تو» زائل شود.\n\nخداوند متعال فرمود: «و چون [تیر] انداختی، تو نبودی که انداختی، بلکه خدا بود که انداخت» (وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏). این اثبات دو انیت (إنِّيَة) و اثبات حکم آن دو است، سپس نفی حکم از یکی از آن دو پس از اثبات آن، و او راستگو در گفتار است.\n\n### [انیت (I-ness) شیء، حقیقت آن در اصطلاح اهل طریقت است]\n\nبدان که انیت (إنِّيَة) شیء، حقیقت آن در اصطلاح اهل طریقت (القوم) است. پس در جانب حق (الحق)، انیت این است: «منم، من پروردگار تو» (إني أنا ربك) و در جانب خلق کامل، انیت این است: «من فرستاده خدا هستم» (إني رسول الله). این دو انیت هستند که عبارت آن‌ها را ضبط کرده است و این دو، دو طرف هستند. برای هر یک از این دو انیت، حکمی است که برای دیگری نیست.\n\nو این همان است که گفتند و این همان است که قصد کردند\nو در آنجا جز خدا نیست و غیر او وجود ندارد\n\nو تکلیف کرد، و تکلیف، حادثی را می‌طلبد\nو کسی را می‌طلبد که بداند، و در آنجا جز او نیست.\n\nپس انیت الهی گوینده است و انیت پذیرنده (قابله) شنونده است، و برای آن قولی نیست مگر به تکوین (ایجاد). پس به انیت خلق در حال وجودش گفته نمی‌شود [که بگو]، و قول تنها برای کسی است که در حال عدم است. پس تکلیفی نیست مگر در معدوم، به دلیل عدم نسبت ایجاد به حادث. پس به منفعل گفته نمی‌شود که منفعل شو، زیرا او با پذیرش هستی (الوجود) منفعل شده است و ایجادی از او صادر نمی‌شود، پس قولی برای او نیست. و در آنجا عبثی نیست. پس هنگامی که تکلیف شد، به آنچه تکلیف شده گفته می‌شود: «باش» (کن) در حال عدمش، پس در محل این حادث موجود می‌شود و به او نسبت داده می‌شود، در حالی که از او نیست. به همین دلیل، دو انیت دو طرف بودند و از هم متمایز شدند. مگر اینکه برای انیت حادث، جایگاه فداکاری و ایثار برای جناب حق (الحق) وجود دارد، به این دلیل که سپر (وقایة) است. و با این صفت سپر بودن، انیت بنده در حق (الحق) به صورت ظهوری درمی‌آید، و این همان قول خداوند متعال است: «منم، من الله هستم» (إِنَّنِي أَنَا الله). اگر نون بنده نبود که حرف یاء (ياء) که ضمیر حق است در آن اثر گذاشته و نون را مجرور (خفض) کرده است، اثر قدیم در محدث (مخلوق) ظاهر می‌شد. و اگر این نبود، نون از «إنّ» که انیت حق است، مجرور می‌شد، همان‌طور که در قول او اثر گذاشت: «منم، من پروردگار تو» (إِنِّي أَنَا رَبُّكَ). زیرا ناگزیر باید اثری داشته باشد. پس چون انیت بنده که نون وقایه (سپر) است را نیافت، در انیت حق اثر گذاشت و آن را مجرور کرد. و مقام آن، رحمت است که همان گشایش (الفتح) است. پس هیچ چیز آن را از مقامش زائل نکرد مگر خود او، و هیچ چیز جز او در آن اثر نگذاشت. پس نزدیک‌ترین حالتی که بنده به حق (الحق) دارد، زمانی است که سپر (وقایة) باشد بین انیت حق و بین ضمیر او. پس محصور می‌شود و حق او را از هر سو احاطه کرده است و به او رحیم است، به دلیل بقای صفت رحمت. پس باب آن باز است و با آن، هستی (وجود) محدث حفظ شده است. پس عین نون وقایه حادث در مقام عبودیت که همان جر (خفض) متولد شده از یاء ضمیر حق است، باقی ماند. پس اثر حق در بنده ظاهر شد، و آن عین مقام بنده است: ذلت و فقر. پس بنده در وصله با حق تعالی مقامی بزرگ‌تر از این ندارد، زیرا هستی عین (وجود) را با ظهور مقامش در آن دارد، و در حال اندراج در حق است و از هر سو احاطه شده است. پس خود را به پروردگارش شناخت، هنگامی که جر (خفض) در او اثر گذاشت. و پروردگارش را شناخت، هنگامی که او را بر آنچه هست، یعنی رحمت، باقی گذاشت. زیرا او رحمان و رحیم است. پس گشایش (الفتح) با وجود عین بنده از او زائل نشد. پس هرگز او را جز رحمان شهود نمی‌کند و هرگز او را جز مؤثر در خود نمی‌داند. پس پیوسته در عبودیت خود پایدار است. و این نهایت قرب است.\n\nو هنگامی که ابویزید (بسطامی) در قرب به خدا، پیش از شهود این مقام، حیران شد، به پروردگارش گفت: «ای پروردگار، با چه چیزی به تو تقرب جویم؟» خداوند فرمود: «با آنچه که برای من نیست.» ابویزید گفت: «ای پروردگار، چه چیزی برای تو نیست، در حالی که همه چیز از آن توست؟» خداوند فرمود: «ذلت و فقر.» پس در آن هنگام دانست که چه چیزی برای انیت حق (إنِّيَة الحق) و چه چیزی برای انیت بنده (إنِّيَة العبد) است. پس وارد این مقام شد و برای او قرب اتم حاصل گشت. پس میان شهود و وجود جمع کرد، زیرا هر چیزی هلاک شونده است. شهود نزد اهل طریقت (القوم)، فنای حکم است نه فنای عین. و در این مقام، شهود بدون فنای عین وجود دارد، و این محل جمع میان ما و این طایفه است، و بدون فنای حکم، زیرا آنچه را که حق از گشایش رحمانی (الفتح الرحموتي) سزاوار است، باقی گذاشت. زیرا اگر این قرب معین نبود، اثر به انیت حق باز می‌گشت. و به همین دلیل در «منم، من پروردگار تو» (إِنِّي أَنَا رَبُّكَ) آشکار ساخت تا دانسته شود که اگر اثر از حق صادر شود، ناگزیر باید حکم آن ظاهر شود. و جز حق (الحق) یافت نشد، پس اثر به خود او بازگشت. پس بنده آمد و میان انیت الهی و مؤثر وارد شد و در آن عمل کرد.\n\nپس انیت خلق مهار شده است\nو انیت حق مهار نمی‌شود\n\nپس از این می‌گیرد و به آن می‌دهد\nو هر یک به احوال خود شادمان است\n\nپس پیوند دادن هستی (الوجود) به عین شهود\nمقامی بزرگ است برای کسی که پیوند می‌خورد\n\nو مقام نزدیکی (الدنو) را به دست نمی‌آورند\nبندگانی که رازشان دور شده است.\n\nو هرگز به چیزی از عطایایی که حق (الحق) به من بخشیده و اکوان (هستی‌ها) آن‌ها را پذیرفته‌اند، شادمان نشدم، مانند شادمانی‌ام به این مقام، زیرا پروردگارم مرا به آن آراست. و این بالاترین و والاترین مقامات است و مقام هر آنچه غیر خداست، در حالی که از آن آگاه نیست. و عنایت از جانب خدا به برخی از بندگانش نیست، مگر اینکه این مقام را از خودشان شهود کنند. پس بر تمام عالم جز به علم به آن، از نظر حال و ذوق، برتری نمی‌یابد. و هیچ کس ثمره ایثار را مانند صاحب این مقام درو نمی‌کند، زیرا ثمره ایثار به اندازه کسی است که او را بر خود ایثار می‌کنی. و کسی که در اینجا او را بر خود ایثار می‌کنی، حق (الحق) است. پس شادی به آنچه از ثمره این ایثار درو می‌کنی، به تو نسبت داده می‌شود، به صورتی که نسبت شادی به حق است.\n\nپس بنگر که چه لذت و شادمانی بزرگی است. و این کوتاه‌ترین بیانی است که می‌توان درباره این مقام ارائه داد. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏)."
  },
  "page_count": 3
}