{
  "id": 82,
  "title": {
    "ar": "الباب الثاني والثمانون في الفرار",
    "en": "Chapter Eighty-two, Concerning Flight",
    "ur": "بیان بیاسیواں: فرار کے بارے میں",
    "fa": "باب هشتاد و دوم در فرار (الفرار)"
  },
  "content": {
    "ar": "## (الباب الثاني والثمانون في الفرار)\n\n\n> جزاء من فر أن ينبأ *** فرار موسى لما تابا\n\n\n> من فر منه به إليه *** صير محبوبه محبا\n\n\n> وكان وترا فصار شفعا *** وكان عينا فصار قلبا\n\n\n> أظهرني في الوجود تاجا *** فعدت في ساعديه قلبا\n\n\n> أعطان كن ثم قال عبدي *** فقال كن بي تكون ربا\n\n\n### [الفرار أنتج لموسى الرسالة والحكم‏]\n\n\nالضمير في ساعديه يعود على الوجود قال الله تعالى حكاية عن موسى عليه السلام إنه قال لفرعون وآله فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ فَوَهَبَ لِي رَبِّي حُكْماً وجَعَلَنِي من الْمُرْسَلِينَ ثم قال وتِلْكَ نِعْمَةٌ تَمُنُّها عَلَيَّ أَنْ عَبَّدْتَ بَنِي إِسْرائِيلَ فقوله وتِلْكَ نِعْمَةٌ قوله أَ لَمْ نُرَبِّكَ فِينا فتلك النعمة تربية فرعون والمن يبطل الإنعام لأنه استعجال جزاء فلو لم يقل لنفعه ذلك عند الله إذ كان من شأن فرعون إذلال بنى إسرائيل وموسى منهم وكان قد أعزه وتبناه فهذا معنى قوله أَنْ عَبَّدْتَ بَنِي إِسْرائِيلَ والفرار أنتج لموسى الرسالة والحكم فكان خليفة رسولا لأن الرسول لا يكون حاكما حتى يكون خليفة\n\n\n### [ففروا إلى الله إنى لكم منه نذير مبين‏]\n\n\nثم قال لنا ربنا لما قضاه من أن جعلنا ورثة النبيين والمرسلين في نبوتهم ورسالتهم ما أعطانا الله من حفظ دينه والفتيا فيه والاجتهاد في استنباط الحكم فقال فَفِرُّوا إِلَى الله فجاء بالاسم الجامع والمراد منه اسم خاص يقتضي لنا ما اقتضى لموسى عليه السلام في فراره وهو الاسم الوهاب الذي يعطي لينعم خاصة وذلك الوهب يجعله رسولا ضرورة لأن الحكم في غير محكوم عليه لا يصح وقال فيمن تربص في أهله ولم يفر إليه ما ذكره في كتابه وهو قوله تعالى قُلْ إِنْ كانَ آباؤُكُمْ وأَبْناؤُكُمْ وإِخْوانُكُمْ وأَزْواجُكُمْ وعَشِيرَتُكُمْ وأَمْوالٌ اقْتَرَفْتُمُوها وتِجارَةٌ تَخْشَوْنَ كَسادَها ومَساكِنُ تَرْضَوْنَها أَحَبَّ إِلَيْكُمْ من الله ورَسُولِهِ وجِهادٍ في سَبِيلِهِ فَتَرَبَّصُوا والتربص نقيض الفرار فَفِرُّوا إِلَى الله إِنِّي لَكُمْ مِنْهُ نَذِيرٌ مُبِينٌ وقد ذكرنا هذا الفرار الموسوي في كتاب الأسفار عن نتائج الأسفار وسميت هذا الفرار الموسوي سفر الطلب‏\n\n\n### [معنى الفرار وكيف هو وما ينتج‏]\n\n\nفلنحقق هنا معنى الفرار وكيف هو مقام وما ينتج فإنه يظهر أنه نسبة لا مقام كالعزلة والخلوة فإن كونه من المقامات مجهول عند أكثر أهل الله‏\n\n\n### [الفرار بين طرفى ابتداء وانتهاء]\n\n\nفاعلم إن الفرار بين طرفي ابتداء وانتهاء فابتداؤه من وانتهاؤه إلى فقد يكون السبب الموجب للفرار من كفرار موسى عليه السلام ولا يتعين إلي فإن الفار من من إنما يطلب النجاة من غير تعيين غاية والفار إذا كان هو السبب الموجب للفرار لا بد أن يكون معينا ولا يتعين من وهو عكس الأول ولما كان الأمر بهذه المثابة أمرنا الله أن نفر إليه ولا بد وقد نفر إليه منه مثل‏\n\n\nقوله وأعوذ بك منك‏\n\n\nوقد نفر إليه من كون ما من الأكوان أو من صفة ما من الصفات إلهية كانت أو غير إلهية أو صفة فعل أو غير صفة فعل‏\n\n\n### [عناية الله بهذه الأمة المحمدية]\n\n\nفعلمنا الله كيف نفر في قوله إِلَى الله وهذه عناية من الله بنا أعني بهذه الأمة المحمدية يستروح منها ما لا يخفى على أحد فإن الأنبياء عليهم السلام يصدقون في كل ما يخبرون به من أحوالهم منزهون أن يلبسوا ثوبي زور فقال موسى عليه السلام فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ فانتج له ذلك الفرار الحكم الذي هو الإمامة والخلافة والرسالة مع كون السبب الموجب الذي ذكره وما ذكر إلى أين فر فإذا فر الفار إلى الله وعين من فر إليه وأبهم ما فر منه فما ترون تكون جائزته فإن جائزة موسى جائزة منقطعة فإن الخلافة هنا تترك والرسالة كذلك ينقطع الأمران بالموت والانقلاب إلى الدار الآخرة فهذا أعطى حكم ما فر منه لما كان منقطعا فإنه انقطع بغرقه أو بموته لو مات ولا بد له من الموت فكانت النتيجة والهبة مناسبة بما أعطيه من انقطاعهما بالموت فإن الإمامة والرسالة ينقطعان بالموت والفرار إلى الله يعطي ما يبقى ببقاء الله ولا أعين فإن التعيين في ذلك إلى الله وسواء كان الفرار من الله أو لم يكن فإن المراعاة هنا لمن فر إليه وفي حق موسى لما فر منه وإذا كانت هذه الأمة مع الأنبياء بهذا الحكم وهذه المنزلة\nفما ظنك بمنزلة أمم الأنبياء منا والله ما يعرفون على أي طريق سلكت هذه الأمة في فرارها فإن الله مجهول الأينية والفرار كان إليه فلا يدري أحد يفر إليه إذا تلقاه وأخذ بيده إلى أين يسير به فإن الله أسرع إلى من فر إليه في تلقيه من الفار إليه‏\n\n\nفإنه يقول وهو الصادق تعالى ومن أتاني يسعى أتيته هرولة\n\n\nفوصف نفسه بالإقبال على عبده إذا أتاه بأضعاف مما يأتيه به من الحال وإتيان الفار أشد من الهرولة فيكون إتيان الحق إليه أشد من ذلك فتحقق هذا في العلم الإلهي تر العجب فيما أعطى الله هذه الأمة بعناية محمد صلى الله عليه وسلم‏\n\n\n### [مقامك من الفرار لا يتعين‏]\n\n\nفاعلم إن مقامك من الفرار لا يتعين فنتكلم عليه فإن حكمه في الفار بحسب ما فر منه وهي أمور كثيرة لا تنضبط جزئياتها وإن انحصرت أمهاتها أو ما فر إليه وهي أسماء كثيرة إلهية أو أحكام بحسب ما يراه الفار إليه ولكن الذي أمر الله به أن نفر إلى الله والفرار إلى الله لا يصح من حيث المجموع فإنا منه نفر إليه فإن فيه ما نفر منه ومن وإلى لا يجتمعان فإن أحكامهما مختلفة فإن قلت‏\n\n\nفقوله وأعوذ بك منك‏\n\n\nقلنا فيه وجهان الواحد أن قوله وأعوذ بك ما هو حكم الباء هنا حكم إلي فإنه يستعيذ بالله في حال فراره وما بلغ إلى حكم إلى ونحن إنما نتكلم في لفظة إلى من حيث ما تدل عليه وهذا التعويذ النبوي إنما وقع بالباء فلا وجه لقولك هذا بالاستعاذة والوجه الآخر أنه وإن جعلتها مطلوب إلى عين المستعاذ به في نهاية الفرار فمعلوم أنه لو كان عين من تفر منه عين من يفر إليه من غير اختلاف نسبة لم يصح فرار فلا بد من اختلاف النسبة فالنسبة التي جعلتك تفر منه عين النسبة التي فررت إليه من أجلها والعين واحدة مثل قوله يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ فالعين التي تحشر منها هي العين التي تحشر إليها وبعينها ما وصفت به فانظر أي اسم يكون مشهود المتقي فما تجده الرحمن وإن كان معه في حال اتقائه ولكن تحشر إليه لينفرد بك دون أن تكون لاسم آخر تصرف فيك وقوله إِنِّي لَكُمْ مِنْهُ نَذِيرٌ مُبِينٌ تعلم ما هو الاسم الذي من أجله كان الإنذار المبين من المنذر لك وقوله مِنْهُ يعود على الله هو الذي وجهه إليك ليأمرك بالفرار إلى الله وإنما جاء بالاسم الجامع إذ كان في عرف الطبع الاستناد إلى الكثرة\n\n\nيقول النبي صلى الله عليه وسلم يد الله مع الجماعة\n\n\nفالنفس يحصل لها الأمان باستنادها إلى الكثرة والله مجموع أسماء الخير إذا حققت معرفة الأسماء الإلهية وجدت أسماء الأخذ قليلة وأسماء الرحمة كثيرة في الاسم الله فلذلك أمرك بالفرار إلى الله فاعلم ذلك‏\n\n\n### [الفرار حكم يستصحب العبد دنيا وآخرة]\n\n\nوما من اسم إلهي إلا ويريد أن يربطك به ويقيدك وتكون له لظهور سلطانه فيك وأنت قد علمت إن سعادتك في المزيد والمزيد لا يكون لك إلا بالانتقال إلى حكم اسم آخر لتستفيد علما لم يكن عندك والذي أنت عنده لا يتركك فتعين الفرار ويكون الإنذار أن لا يحكم عليك الاسم الذي أنت عنده بالبقاء معه ففررت إلى موطن الزيادة فالفرار حكم يستصحب العبد في الدنيا والآخرة ودرجات العارفين من أهل الأنس والوصال منه خمسمائة واثنتا عشرة درجة ودرجات العارفين من أهل الأدب والوقوف مثلهم ودرجات الملامية من أهل الأنس والوصال أربعمائة وإحدى وثمانون درجة ودرجات الملامية من أهل الأدب والوقوف مثلهم‏\n\n",
    "en": "## Chapter Eighty-Two Concerning Flight (الفرار)\n\nThe reward of him who flees is that he is made a prophet,\nLike the flight of Moses when he turned (to God).\n\nHe who flees from Him, by Him, to Him,\nMakes his Beloved a lover.\n\nHe was single (وتر) and became paired (شفع);\nHe was an eye (عين) and became a heart (قلب).\n\nHe manifested me in Existence (الوجود) as a crown,\nSo I returned within His two supports (ساعديه) as a heart.\n\nHe gave me 'Be!' (كن), then said, 'My servant.'\nSo He said, 'Be by Me, and you shall be a Lord (رب).'\n\n### [Flight Produced Messengership and Rule for Moses]\n\nThe pronoun in \"His two supports\" refers back to Existence (الوجود). Allah the Exalted said, relating the account of Moses, peace be upon him, that he said to Pharaoh and his people: <<So I fled from you when I feared you, and my Lord granted me wisdom/rule (حكما) and made me one of the Messengers>>. Then he said: <<And is that a favor (نعمة) you remind me of, that you enslaved the Children of Israel?>>\n\nHis saying, <<And is that a favor>>, refers to Pharaoh's saying: <<Did we not raise you among us?>> That favor was Pharaoh's raising of him. Reminding someone of a favor (المن) invalidates the beneficence because it is an immediate demand for recompense. Had he not said it, it would have benefited him with Allah, since it was Pharaoh’s custom to humiliate the Children of Israel, and Moses was one of them, yet Pharaoh had honored him and adopted him. This is the meaning of his saying: <<that you enslaved the Children of Israel>>.\n\nAnd the Flight (الفرار) produced for Moses the Messengership (الرسالة) and the Rule (الحكم). Thus, he was a Caliph (خليفة) and a Messenger, because a Messenger cannot be a ruler unless he is also a Caliph.\n\n### [So Flee to Allah; Indeed, I am to you from Him a clear Warner]\n\nThen our Lord said to us—having decreed that He made us the inheritors of the Prophets and Messengers in their prophecy and messengership, which Allah granted us for the preservation of His religion, issuing legal rulings (الفتيا), and exerting effort (الاجتهاد) in deriving judgments—He said: <<So flee to Allah>>.\n\nHe brought the Comprehensive Name (الاسم الجامع), but the intended meaning is a specific Name that necessitates for us what was necessitated for Moses, peace be upon him, in his flight: namely, the Name *al-Wahhāb* (The Bestower), Who gives specifically to confer grace. And that bestowal necessarily makes him a Messenger, because rule (الحكم) is not valid without someone to be ruled over.\n\nAnd concerning those who tarry (تربص) among their families and do not flee to Him, He mentioned in His Book, which is His saying, the Exalted: <<Say: If your fathers, and your sons, and your brothers, and your spouses, and your kindred, and wealth you have acquired, and commerce you fear may decline, and dwellings you approve—are dearer to you than Allah and His Messenger and striving in His cause, then wait>>. And tarrying (التربص) is the opposite of Flight (الفرار). <<So flee to Allah; indeed, I am to you from Him a clear Warner>>.\n\nWe have mentioned this Mosaic Flight (الفرار الموسوي) in the book *Al-Asfār 'an Natā'ij al-Asfār* (The Journeys Concerning the Results of the Journeys), and I named this Mosaic Flight the Journey of Seeking (سفر الطلب).\n\n### [The Meaning of Flight, How it is, and What it Produces]\n\nLet us verify here the meaning of Flight (الفرار), how it is a station (مقام), and what it produces. For it appears to be a relationship (نسبة), not a station like seclusion (العزلة) or retreat (الخلوة), since its status as one of the stations is unknown to most of the People of Allah (أهل الله).\n\n### [Flight Between Two Extremes: Beginning and End]\n\nKnow that Flight is between two extremes: a beginning and an end. Its beginning is *from* (من) and its end is *to* (إلى).\n\nThe compelling cause for the flight may be *from* (من), as in the flight of Moses, peace be upon him, and the destination *to* (إلى) is not specified. For the one who flees *from* (من) something only seeks salvation without specifying a goal.\n\nAnd if the destination *to* (إلى) is the compelling cause for the flight, it must necessarily be specified, while the origin *from* (من) is not specified. This is the reverse of the first case.\n\nSince the matter is thus, Allah commanded us to flee *to* Him necessarily. And sometimes we flee *to* Him *from* Him, such as His saying: <<And I seek refuge in You from You>>.\n\nAnd sometimes one flees *to* Him from a specific state of existence (كون) among the states of existence, or from a specific Attribute (صفة) among the Attributes, whether Divine or non-Divine, or an Attribute of Act (صفة فعل) or other than an Attribute of Act.\n\n### [Allah's Providence for this Muhammadan Community]\n\nSo Allah taught us how to flee in His saying: *to Allah* (إِلَى الله). This is a providence (عناية) from Allah toward us—meaning this Muhammadan Community (الأمة المحمدية)—from which one derives comfort that is hidden from no one.\n\nFor the Prophets, peace be upon them, are truthful in everything they report concerning their states, and they are purified from wearing the garments of falsehood. So Moses, peace be upon him, said: <<So I fled from you when I feared you.>> That flight produced for him the Rule (الحكم), which is the Imamate, the Caliphate, and the Messengership, despite the compelling cause being what he mentioned, and without mentioning where he fled *to*.\n\nSo, if the one who flees flees *to* Allah, specifying the One he flees *to*, but leaving vague what he flees *from*, what do you think his reward will be? For the reward of Moses was a temporary reward, since the Caliphate here is left behind, and the Messengership likewise—both matters cease with death and the transition to the Hereafter. Thus, he was given the ruling of that which he fled *from*, since it was temporary; it ceased with their drowning, or with their death had they died, and death is inevitable for them. So the result and the bestowal were appropriate to the temporary nature of what he was given, since the Imamate and the Messengership cease with death.\n\nBut the Flight *to* Allah gives that which remains by the Subsistence (البقاء) of Allah, and I do not specify it, for the specification in that belongs to Allah. It is irrelevant whether the flight was *from* Allah or not, for the consideration here is for the One fled *to*, whereas in the case of Moses, it was for that which he fled *from*.\n\nIf this Community holds this ruling and this rank in relation to the Prophets, what do you think of the rank of the communities of the Prophets in relation to us? By Allah, they do not know which path this Community took in its flight, for Allah is unknown in His 'Whereness' (الأينية), and the flight was *to* Him. Thus, no one who flees *to* Him knows, when He receives him and takes his hand, where He will lead him.\n\nFor Allah is swifter in receiving the one who flees *to* Him than the one who flees *to* Him is in fleeing. For He says—and He, the Exalted, is the Truthful One: <<And whoever comes to Me walking, I come to him running>>. Thus, He described Himself as approaching His servant when the servant comes to Him, with a speed manifold greater than the state with which the servant approaches Him. And the approach of the one who flees is more intense than running, so the approach of The Real (الحق) to him is even more intense than that. Realize this in the Divine Knowledge (العلم الإلهي), and you will see wonders in what Allah has granted this Community through the providence (عناية) of Muhammad, may Allah bless him and grant him peace.\n\n### [Your Station of Flight is Not Specified]\n\nKnow that your station (مقام) concerning Flight (الفرار) is not specified, so let us discuss it. Its ruling upon the one who flees is determined by what he flees *from*—which are many things whose particulars cannot be enumerated, even if their general categories are confined—or by what he flees *to*—which are many Divine Names (أسماء إلهية) or rulings, according to what the one who flees sees in the destination.\n\nBut what Allah commanded is that we flee *to* Allah. Yet, Flight *to* Allah is not valid in its totality, for we flee *to* Him *from* Him, and *from* (من) and *to* (إلى) do not combine, as their rulings are different.\n\nIf you say: \"Then what about His saying: <<And I seek refuge in You from You>>?\"\n\nWe say there are two aspects. First: The ruling of the letter *bā’* (ب) in His saying <<And I seek refuge in You>> is not the ruling of *ilā* (إلى / to). For he seeks refuge *in* Allah during his flight, but has not reached the ruling of *ilā*. We are only discussing the word *ilā* in terms of what it signifies, and this Prophetic seeking of refuge occurred with the *bā’*, so your argument based on seeking refuge is unfounded.\n\nThe second aspect is that even if you consider the object sought *to* be the very essence of the One sought refuge in at the end of the flight, it is known that if the essence of the one you flee *from* were the very essence of the One you flee *to*, without a difference in relationship (نسبة), the flight would not be valid. Therefore, a difference in relationship is necessary. The relationship that caused you to flee *from* Him is the very relationship for the sake of which you fled *to* Him, and the Essence (العين) is one.\n\nLike His saying: <<The Day We will gather the righteous (المتقين) to the Most Merciful (الرحمن)>>. The Essence (العين) from which you are gathered is the Essence to which you are gathered, and it is precisely what you are described by. Look at which Name is witnessed by the righteous person; you will find it is *al-Rahmān* (The Most Merciful), even though He was with him during his state of righteousness. But you are gathered *to* Him so that He may be singular with you, without another Name having influence over you.\n\nAnd His saying: <<Indeed, I am to you from Him a clear Warner>>—you know what Name is the cause of the clear warning from the one who warns you. And His saying *from Him* (مِنْهُ) refers back to Allah, Who directed him to you to command you to flee *to* Allah. He only used the Comprehensive Name (الاسم الجامع) because, by natural custom, reliance is placed upon Multiplicity (الكثرة).\n\nThe Prophet, may Allah bless him and grant him peace, says: <<The Hand of Allah is with the community>>. Thus, the soul achieves security by relying on Multiplicity. And Allah is the totality of the Names of Goodness. If you realize the Gnosis (معرفة) of the Divine Names (الأسماء الإلهية), you will find the Names of Taking/Grasping are few, and the Names of Mercy (أسماء الرحمة) are many within the Name Allah. Therefore, He commanded you to flee *to* Allah. Know this.\n\n### [Flight is a Ruling that Accompanies the Servant in This World and the Next]\n\nThere is no Divine Name (اسم إلهي) except that it desires to bind you to it, restrict you, and make you belong to it, so that its dominion may appear in you. And you know that your felicity lies in increase (المزيد), and increase is only attained by transitioning to the ruling of another Name, so that you may gain knowledge (علما) you did not possess. And the Name under whose sway you are will not leave you, so Flight (الفرار) becomes necessary. The warning is that the Name under whose sway you are should not rule over you by compelling you to remain with it, so you flee to the station of increase.\n\nThus, Flight is a ruling that accompanies the servant in this world and the Hereafter. The degrees of the Gnostics (العارفين) among the People of Intimacy (الأنس) and Union (الوصال) concerning it are five hundred and twelve degrees. And the degrees of the Gnostics among the People of Propriety (الأدب) and Standing (الوقوف) are the same number. And the degrees of the Malamiyya (الـملامية) among the People of Intimacy and Union are four hundred and eighty-one degrees. And the degrees of the Malamiyya among the People of Propriety and Standing are the same number.",
    "ur": "باب بیاسیواں: فرار (بھاگنے) کے بیان میں\n\nجزا اس کی جو بھاگا یہ خبر ہے *** کہ موسیٰ کا فرار جب توبہ لایا\nجو اس سے بھاگا، اسی کے ذریعے، اس کی طرف *** اس نے اپنے محبوب کو محب بنا دیا\nوہ طاق (وتر) تھا تو جفت (شفع) ہو گیا *** وہ آنکھ (عین) تھا تو دل (قلب) بن گیا\nاس نے مجھے ہستی (الوجود) میں تاج بنا کر ظاہر کیا *** تو میں اس کے بازوؤں میں دل بن کر لوٹا\nاس نے \"کُن\" (ہو جا) عطا کیا پھر کہا: \"اے میرے بندے\" *** تو اس نے کہا: \"میرے ذریعے ہو جا، تو رب بن جائے گا\"\n\n### [فرار نے موسیٰ کے لیے رسالت اور حکم پیدا کیا]\n\n\"اس کے بازوؤں\" میں ضمیر ہستی (الوجود) کی طرف لوٹتی ہے۔ اللہ تعالیٰ نے موسیٰ علیہ السلام کے بارے میں فرعون اور اس کی قوم سے حکایت کرتے ہوئے فرمایا:\n\nفَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ فَوَهَبَ لِي رَبِّي حُكْماً وجَعَلَنِي من الْمُرْسَلِينَ\n(جب میں نے تم سے خوف محسوس کیا تو تم سے بھاگ گیا، پھر میرے رب نے مجھے حکم (حکمت و اختیار) عطا کیا اور مجھے رسولوں میں شامل کر دیا)۔\n\nپھر موسیٰ نے کہا:\n\nوتِلْكَ نِعْمَةٌ تَمُنُّها عَلَيَّ أَنْ عَبَّدْتَ بَنِي إِسْرائِيلَ\n(اور کیا یہ وہ احسان ہے جو تو مجھ پر جتلائے گا کہ تو نے بنی اسرائیل کو غلام بنا رکھا تھا؟)\n\nموسیٰ کا قول \"وتِلْكَ نِعْمَةٌ\" (اور یہ وہ انعام ہے) دراصل فرعون کے اس قول کا جواب ہے: أَ لَمْ نُرَبِّكَ فِينا (کیا ہم نے تجھے اپنے ہاں نہیں پالا تھا؟)۔\n\nوہ انعام فرعون کی تربیت تھی۔ اور احسان جتلانا (المن) انعام کو باطل کر دیتا ہے، کیونکہ یہ جزا کو جلد طلب کرنا ہے۔ اگر وہ یہ بات نہ کہتا تو اللہ کے ہاں اسے فائدہ ہوتا، کیونکہ فرعون کا کام بنی اسرائیل کو ذلیل کرنا تھا اور موسیٰ بھی انہی میں سے تھے، مگر فرعون نے انہیں عزت دی اور اپنا بیٹا بنا لیا۔ یہی معنی ہے اس قول کا: أَنْ عَبَّدْتَ بَنِي إِسْرائِيلَ (کہ تو نے بنی اسرائیل کو غلام بنا رکھا تھا)۔\n\nاور فرار نے موسیٰ کے لیے رسالت اور حکم (اختیار) پیدا کیا، چنانچہ وہ خلیفہ اور رسول بنے، کیونکہ رسول اس وقت تک حاکم نہیں بن سکتا جب تک کہ وہ خلیفہ نہ ہو۔\n\n### [پس اللہ کی طرف بھاگو، بے شک میں تمہارے لیے اس کی طرف سے واضح ڈرانے والا ہوں]\n\nپھر ہمارے رب نے ہمیں حکم دیا، جب اس نے ہمیں نبیوں اور رسولوں کی نبوت اور رسالت میں وارث بنایا، جو اللہ نے ہمیں اپنے دین کی حفاظت، اس میں فتویٰ دینے اور حکم کے استنباط میں اجتہاد کرنے کی صورت میں عطا کیا۔\n\nچنانچہ فرمایا: فَفِرُّوا إِلَى الله (پس اللہ کی طرف بھاگو)۔\n\nیہاں اسم جامع (اللہ) لایا گیا، حالانکہ مراد اس سے ایک خاص اسم ہے جو ہمارے لیے وہی چیز لازم کرتا ہے جو موسیٰ علیہ السلام کے لیے ان کے فرار میں لازم ہوئی تھی، اور وہ اسم الوہاب (بہت عطا کرنے والا) ہے، جو خاص طور پر انعام دینے کے لیے عطا کرتا ہے۔ اور یہ عطا (الوہب) اسے لازمی طور پر رسول بنا دیتی ہے، کیونکہ حکم (اختیار) بغیر محکوم علیہ کے صحیح نہیں ہوتا۔\n\nاور اس شخص کے بارے میں جو اپنے اہل و عیال میں ٹھہرا رہا اور اس کی طرف فرار اختیار نہ کیا، اللہ نے اپنی کتاب میں وہ ذکر کیا جو یہ ہے:\n\nقُلْ إِنْ كانَ آباؤُكُمْ وأَبْناؤُكُمْ وإِخْوانُكُمْ وأَزْواجُكُمْ وعَشِيرَتُكُمْ وأَمْوالٌ اقْتَرَفْتُمُوها وتِجارَةٌ تَخْشَوْنَ كَسادَها ومَساكِنُ تَرْضَوْنَها أَحَبَّ إِلَيْكُمْ من الله ورَسُولِهِ وجِهادٍ في سَبِيلِهِ فَتَرَبَّصُوا\n(کہہ دیجیے: اگر تمہارے باپ، تمہارے بیٹے، تمہارے بھائی، تمہاری بیویاں، تمہارا قبیلہ، وہ مال جو تم نے کمائے ہیں، وہ تجارت جس کے کساد (ماند پڑ جانے) کا تمہیں ڈر ہے، اور وہ مکانات جنہیں تم پسند کرتے ہو، تمہیں اللہ اور اس کے رسول اور اس کی راہ میں جہاد سے زیادہ محبوب ہیں، تو انتظار کرو)۔\n\nاور انتظار (التربص) فرار کی ضد ہے۔\n\nفَفِرُّوا إِلَى الله إِنِّي لَكُمْ مِنْهُ نَذِيرٌ مُبِينٌ\n(پس اللہ کی طرف بھاگو، بے شک میں تمہارے لیے اس کی طرف سے واضح ڈرانے والا ہوں)۔\n\nہم نے اس فرار موسوی کا ذکر کتاب \"الأسفار عن نتائج الأسفار\" میں کیا ہے اور اس فرار موسوی کو \"سفر الطلب\" (طلب کا سفر) کا نام دیا ہے۔\n\n### [فرار کا معنی، اس کی کیفیت اور اس کا نتیجہ]\n\nتو ہم یہاں فرار کے معنی کی تحقیق کرتے ہیں، کہ یہ کیسا مقام (المقام) ہے اور کیا نتیجہ دیتا ہے، کیونکہ یہ ظاہر ہوتا ہے کہ یہ ایک نسبت (النسبة) ہے، نہ کہ عزلت اور خلوت کی طرح کوئی مقام، کیونکہ اس کا مقامات میں سے ہونا اکثر اہل اللہ کے نزدیک نامعلوم ہے۔\n\n### [فرار ابتداء اور انتہا کے دو کناروں کے درمیان]\n\nجان لو کہ فرار ابتداء اور انتہا کے دو کناروں کے درمیان ہے۔ اس کی ابتداء \"مِنْ\" (سے) ہے اور اس کی انتہا \"إِلَى\" (کی طرف) ہے۔\n\nکبھی فرار کا سبب \"مِنْ\" (سے) ہوتا ہے، جیسے موسیٰ علیہ السلام کا فرار، اور \"إِلَى\" (کی طرف) متعین نہیں ہوتا۔ کیونکہ جو شخص \"مِنْ\" (سے) بھاگتا ہے، وہ صرف نجات طلب کرتا ہے، بغیر کسی غایت (منزل) کے تعین کے۔\n\nاور جب فرار کرنے والا خود فرار کا سبب ہو، تو \"إِلَى\" (کی طرف) کا متعین ہونا ضروری ہے، اور \"مِنْ\" (سے) متعین نہیں ہوتا، اور یہ پہلے کے برعکس ہے۔\n\nچونکہ معاملہ اس طرح ہے، اس لیے اللہ نے ہمیں حکم دیا کہ ہم اس کی طرف فرار کریں (إِلَى الله)، اور یہ ضروری ہے۔ اور کبھی ہم اس کی طرف، اسی سے فرار کرتے ہیں، جیسے:\n\nنبی کا قول: وأعوذ بك منك (اور میں تیری پناہ مانگتا ہوں تجھ سے)۔\n\nاور کبھی اس کی طرف، کسی بھی کَون (وجود) سے، یا کسی بھی صفت سے فرار کیا جاتا ہے، خواہ وہ صفات الٰہیہ ہوں یا غیر الٰہیہ، یا صفت فعل ہو یا غیر صفت فعل۔\n\n### [اس امت محمدیہ کے ساتھ اللہ کی عنایت]\n\nچنانچہ اللہ نے ہمیں سکھایا کہ ہم کس طرح فرار کریں، اپنے اس قول میں: إِلَى الله (اللہ کی طرف)۔\n\nاور یہ اللہ کی طرف سے ہم پر عنایت ہے، یعنی اس امت محمدیہ پر، جس سے وہ راحت حاصل ہوتی ہے جو کسی پر پوشیدہ نہیں۔ کیونکہ انبیاء علیہم السلام اپنے احوال کے بارے میں جو کچھ خبر دیتے ہیں، اس میں سچے ہوتے ہیں، اور وہ اس سے پاک ہیں کہ وہ جھوٹ کے دو لباس پہنیں۔\n\nچنانچہ موسیٰ علیہ السلام نے فرمایا: فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ (جب میں نے تم سے خوف محسوس کیا تو تم سے بھاگ گیا)۔\n\nاس فرار نے ان کے لیے حکم (اختیار)، جو کہ امامت، خلافت اور رسالت ہے، پیدا کیا۔ حالانکہ جو سبب انہوں نے ذکر کیا وہ \"مِنْ\" (سے) تھا، اور انہوں نے یہ ذکر نہیں کیا کہ وہ \"إِلَى\" (کی طرف) کہاں بھاگے۔\n\nتو جب فرار کرنے والا اللہ کی طرف فرار کرے اور جس کی طرف فرار کیا ہے (إِلَى) اسے متعین کرے، اور جس سے فرار کیا ہے (مِنْ) اسے مبہم رکھے، تو تمہارا کیا خیال ہے کہ اس کا انعام کیا ہوگا؟\n\nکیونکہ موسیٰ کا انعام ایک منقطع ہونے والا انعام تھا۔ اس لیے کہ خلافت یہاں چھوڑ دی جاتی ہے، اور رسالت بھی اسی طرح، یہ دونوں امور موت اور دار آخرت کی طرف پلٹنے سے منقطع ہو جاتے ہیں۔\n\nتو موسیٰ کو اس چیز کا حکم عطا کیا گیا جس سے وہ فرار ہوئے تھے، کیونکہ وہ منقطع ہونے والا تھا، وہ فرعون کے غرق ہونے یا اس کی موت سے منقطع ہو گیا، اور موسیٰ کو بھی موت آنی تھی۔ چنانچہ نتیجہ اور عطا اس چیز کے مناسب تھی جو انہیں دی گئی تھی، یعنی ان دونوں (امامت و رسالت) کا موت سے منقطع ہو جانا۔\n\nجبکہ اللہ کی طرف فرار وہ چیز عطا کرتا ہے جو اللہ کے بقا (البقاء) کے ساتھ باقی رہتی ہے۔ اور میں اسے متعین نہیں کرتا، کیونکہ اس میں تعین اللہ کے سپرد ہے۔\n\nاور یہ برابر ہے کہ فرار اللہ سے ہو یا نہ ہو، کیونکہ یہاں لحاظ اس کا ہے جس کی طرف فرار کیا گیا (إِلَى)، جبکہ موسیٰ کے حق میں لحاظ اس کا تھا جس سے فرار کیا گیا (مِنْ)۔\n\nاور جب یہ امت انبیاء کے ساتھ اس حکم اور اس منزلت میں ہے، تو تمہارا کیا خیال ہے کہ انبیاء کی امتوں کی منزلت ہمارے مقابلے میں کیا ہوگی؟\n\nاللہ کی قسم، وہ نہیں جانتے کہ یہ امت اپنے فرار میں کس راستے پر چلی ہے، کیونکہ اللہ کی \"اَینِیَّت\" (کہاں ہونا) مجہول ہے۔ اور فرار اسی کی طرف تھا۔\n\nچنانچہ کوئی نہیں جانتا کہ جب وہ اس کی طرف فرار کرتا ہے اور وہ اسے قبول کر کے اس کا ہاتھ پکڑ لیتا ہے تو اسے کہاں لے جائے گا۔ کیونکہ اللہ اس شخص کی طرف جو اس کی طرف فرار کرتا ہے، اسے قبول کرنے میں، فرار کرنے والے سے زیادہ تیز ہے۔\n\nکیونکہ وہ (اللہ) فرماتا ہے، اور وہ سچا ہے:\n\nومن أتاني يسعى أتيته هرولة\n(اور جو میری طرف چل کر آتا ہے، میں اس کی طرف دوڑ کر آتا ہوں)۔\n\nچنانچہ اس نے اپنے آپ کو بندے کی طرف متوجہ ہونے میں اس حال سے کئی گنا زیادہ وصف کیا ہے جس حال میں بندہ اس کی طرف آتا ہے۔ اور فرار کرنے والے کا آنا تیز دوڑنے (الہرولۃ) سے بھی زیادہ شدید ہوتا ہے، تو حق کا اس کی طرف آنا اس سے بھی زیادہ شدید ہوگا۔\n\nپس تم اس کو علم الٰہی میں متحقق کرو، تو تم اس چیز میں تعجب دیکھو گے جو اللہ نے محمد صلی اللہ علیہ وسلم کی عنایت سے اس امت کو عطا کی ہے۔\n\n### [فرار میں تمہارا مقام متعین نہیں ہے]\n\nجان لو کہ فرار میں تمہارا مقام (المقام) متعین نہیں ہوتا، اس لیے ہم اس پر بات کرتے ہیں۔\n\nکیونکہ فرار کرنے والے کے حق میں اس کا حکم اس چیز کے مطابق ہوتا ہے جس سے اس نے فرار کیا ہے (مِنْ)، اور یہ بہت سے امور ہیں جن کے جزئیات تو ضبط نہیں ہو سکتے، اگرچہ ان کے اصول محدود ہیں۔ یا اس چیز کے مطابق جس کی طرف اس نے فرار کیا ہے (إِلَى)، اور یہ بہت سے الٰہی اسماء یا احکام ہیں، اس کے مطابق جو فرار کرنے والا دیکھتا ہے۔\n\nلیکن اللہ نے جس کا حکم دیا ہے وہ یہ ہے کہ ہم اللہ کی طرف فرار کریں (إِلَى الله)۔ اور اللہ کی طرف فرار مجموعی حیثیت سے صحیح نہیں ہے، کیونکہ ہم اسی سے فرار کر کے اسی کی طرف جاتے ہیں۔ کیونکہ اس میں وہ کچھ ہے جس سے ہم فرار کرتے ہیں، اور \"مِنْ\" (سے) اور \"إِلَى\" (کی طرف) جمع نہیں ہو سکتے، کیونکہ ان کے احکام مختلف ہیں۔\n\nاگر تم کہو:\n\nتو نبی کا قول: وأعوذ بك منك (اور میں تیری پناہ مانگتا ہوں تجھ سے)؟\n\nہم کہیں گے: اس میں دو پہلو ہیں۔\n\nپہلا یہ کہ \"وأعوذ بك\" (اور میں تیری پناہ مانگتا ہوں) میں باء (بِ) کا حکم یہاں \"إِلَى\" (کی طرف) کا حکم ہے۔ کیونکہ وہ اپنے فرار کی حالت میں اللہ کی پناہ مانگتا ہے، اور وہ ابھی \"إِلَى\" (کی طرف) کے حکم تک نہیں پہنچا۔ اور ہم صرف لفظ \"إِلَى\" (کی طرف) پر بات کر رہے ہیں، اس لحاظ سے کہ وہ کس چیز پر دلالت کرتا ہے۔ اور یہ نبوی تعویذ (پناہ مانگنا) باء (بِ) کے ساتھ واقع ہوا ہے، لہٰذا تمہارے اس قول کا استعاذہ (پناہ مانگنے) سے کوئی تعلق نہیں۔\n\nدوسرا پہلو یہ ہے کہ اگر تم اسے مطلوب \"إِلَى\" (کی طرف) بھی بنا دو، تو فرار کی انتہا میں جس سے پناہ مانگی گئی ہے وہ متعین ہے۔ اور یہ معلوم ہے کہ اگر جس سے تم فرار کر رہے ہو، وہ بعینہٖ وہی ہو جس کی طرف تم فرار کر رہے ہو، بغیر نسبت (النسبة) کے اختلاف کے، تو فرار صحیح نہیں ہوگا۔\n\nلہٰذا نسبت کا اختلاف ضروری ہے۔ تو وہ نسبت جس نے تمہیں اس سے فرار کرنے پر مجبور کیا، بعینہٖ وہی نسبت ہے جس کی وجہ سے تم اس کی طرف فرار ہوئے۔ اور عین (ذات) ایک ہی ہے۔\n\nجیسے اللہ کا قول: يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ\n(جس دن ہم پرہیزگاروں کو رحمن کی طرف جمع کریں گے)۔\n\nوہ عین (ذات) جس سے تم جمع کیے جاتے ہو، وہی عین ہے جس کی طرف تم جمع کیے جاتے ہو، اور بعینہٖ وہی ہے جس کے ساتھ تم متصف ہو۔\n\nپس دیکھو متقی کا مشہود (جس کا وہ شہود کرتا ہے) کون سا اسم ہوتا ہے؟ تم اسے رحمن ہی پاؤ گے، اگرچہ وہ اس کے ساتھ اس کے تقویٰ کی حالت میں بھی ہوتا ہے۔ لیکن اس کی طرف جمع کیا جاتا ہے تاکہ وہ تمہارے ساتھ منفرد ہو جائے، اس کے بغیر کہ کوئی دوسرا اسم تم پر تصرف کرے۔\n\nاور اس کا قول: إِنِّي لَكُمْ مِنْهُ نَذِيرٌ مُبِينٌ (بے شک میں تمہارے لیے اس کی طرف سے واضح ڈرانے والا ہوں)۔\n\nتم جان لو کہ وہ کون سا اسم ہے جس کی وجہ سے ڈرانے والے کی طرف سے واضح ڈرانا (الإنذار المبين) ہوا ہے۔ اور اس کا قول \"مِنْهُ\" (اس کی طرف سے) اللہ کی طرف لوٹتا ہے، وہی ہے جس نے اسے تمہاری طرف بھیجا تاکہ وہ تمہیں اللہ کی طرف فرار کا حکم دے۔\n\nاور اسم جامع (اللہ) اس لیے لایا گیا کہ طبعی عرف میں کثرت پر بھروسہ کیا جاتا ہے۔\n\nنبی صلی اللہ علیہ وسلم فرماتے ہیں: يد الله مع الجماعة (اللہ کا ہاتھ جماعت کے ساتھ ہے)۔\n\nچنانچہ نفس کو کثرت پر بھروسہ کرنے سے امان حاصل ہوتی ہے۔ اور اللہ خیر کے اسماء کا مجموعہ ہے۔ اگر تم اسماء الٰہیہ کی معرفت (المعرفۃ) کی تحقیق کرو تو تم پاؤ گے کہ اسم \"اللہ\" میں پکڑنے والے اسماء (اسماء الأخذ) کم ہیں اور رحمت کے اسماء زیادہ ہیں۔ اسی لیے تمہیں اللہ کی طرف فرار کا حکم دیا گیا۔ پس یہ جان لو۔\n\n### [فرار ایک حکم ہے جو بندے کے ساتھ دنیا اور آخرت میں رہتا ہے]\n\nاور کوئی اسم الٰہی ایسا نہیں جو تمہیں اپنے ساتھ باندھنا اور مقید کرنا نہ چاہتا ہو، اور تم اس کے لیے ہو جاؤ تاکہ اس کا تسلط تم میں ظاہر ہو۔ اور تم یہ جان چکے ہو کہ تمہاری سعادت مزید (اضافے) میں ہے، اور مزید تمہیں تب ہی حاصل ہوگا جب تم کسی دوسرے اسم کے حکم کی طرف منتقل ہو جاؤ، تاکہ تم ایسا علم حاصل کرو جو تمہارے پاس نہیں تھا۔ اور جس اسم کے پاس تم ہو، وہ تمہیں چھوڑتا نہیں۔\n\nچنانچہ فرار متعین ہو جاتا ہے۔ اور انذار (ڈرانا) یہ ہے کہ جس اسم کے پاس تم ہو، وہ تمہیں اپنے ساتھ بقا (البقاء) کا حکم نہ دے۔\n\nپس تم زیادتی کے مقام کی طرف فرار کر گئے۔\n\nچنانچہ فرار ایک ایسا حکم ہے جو بندے کے ساتھ دنیا اور آخرت میں رہتا ہے۔\n\nاور اہل انس و وصال (قربت) میں سے عارفین کے درجات اس میں پانچ سو بارہ (۵۱۲) ہیں۔\n\nاور اہل ادب و وقوف (ٹھہراؤ) میں سے عارفین کے درجات بھی اتنے ہی ہیں۔\n\nاور اہل انس و وصال میں سے ملامتیہ (ملامیہ) کے درجات چار سو اکیاسی (۴۸۱) ہیں۔\n\nاور اہل ادب و وقوف میں سے ملامتیہ کے درجات بھی اتنے ہی ہیں۔",
    "fa": "## (باب هشتاد و دوم در فرار)\n\nپاداش آنکه گریخت، آن است که پیامبر شود *** فرار موسی (علیه السلام) هنگامی که توبه کرد\nآنکه از او به سوی او گریخت *** محبوبش را دوستدار (خود) گرداند\nو او (فرد) طاق بود و جفت شد *** و (فرد) چشم بود و قلب شد\nمرا در هستی (الوجود) چون تاجی آشکار ساخت *** پس در بازوان او قلبی بازگشتم\nبه من «کُن» (باش) عطا کرد، سپس گفت: بنده‌ام *** پس گفت: به واسطه من «کُن» (باش) تا پروردگار شوی.\n\n### [فرار برای موسی (علیه السلام) رسالت و حکم را به بار آورد]\n\nضمیر در «ساعدیه» (بازوان او) به هستی (الوجود) بازمی‌گردد. خداوند متعال به نقل از موسی (علیه السلام) می‌فرماید که او به فرعون و خاندانش گفت: «فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ فَوَهَبَ لِي رَبِّي حُكْماً وجَعَلَنِي من الْمُرْسَلِينَ» (پس چون از شما ترسیدم، از شما گریختم؛ آنگاه پروردگارم به من حکمتی بخشید و مرا از زمره فرستادگان قرار داد). سپس گفت: «وتِلْكَ نِعْمَةٌ تَمُنُّها عَلَيَّ أَنْ عَبَّدْتَ بَنِي إِسْرائِيلَ» (و آیا این نعمتی است که بر من منت می‌نهی که بنی‌اسرائیل را بنده خود ساختی؟). پس منظور از سخن او «وتِلْكَ نِعْمَةٌ» (و این نعمتی است) همان سخن (فرعون) است که گفت: «أَ لَمْ نُرَبِّكَ فِينا» (آیا تو را در میان خود پرورش ندادیم؟). پس آن نعمت، تربیت فرعون بود. و منت نهادن، نعمت‌بخشی را باطل می‌کند، زیرا شتاب در دریافت پاداش است. اگر (موسی) این سخن را نمی‌گفت، آن (تربیت) نزد خدا برای او سودمند بود، زیرا شأن فرعون خوار ساختن بنی‌اسرائیل بود و موسی از آنان بود، در حالی که فرعون او را عزیز داشته و به فرزندی پذیرفته بود. این است معنای سخن او: «أَنْ عَبَّدْتَ بَنِي إِسْرائِيلَ» (که بنی‌اسرائیل را بنده خود ساختی). و فرار برای موسی (علیه السلام) رسالت و حکم را به بار آورد، پس او خلیفه و رسول بود، زیرا رسول تا خلیفه نباشد، حاکم نخواهد بود.\n\n### [پس به سوی خدا بگریزید، همانا من از جانب او برای شما بیم‌دهنده‌ای آشکارم]\n\nسپس پروردگارمان به ما فرمود، هنگامی که مقدر ساخت ما را وارثان پیامبران و رسولان در نبوت و رسالتشان قرار دهد، آنچه را که خداوند از حفظ دینش و فتوا دادن در آن و اجتهاد در استنباط حکم به ما عطا کرده است، فرمود: «فَفِرُّوا إِلَى الله» (پس به سوی خدا بگریزید). پس با اسم جامع (الله) آمد، در حالی که مراد از آن، اسم خاصی است که برای ما همان چیزی را اقتضا می‌کند که برای موسی (علیه السلام) در فرارش اقتضا کرد، و آن اسم «الوهاب» است که عطا می‌کند تا به طور خاص نعمت بخشد. و آن بخشش (وهب) ضرورتاً او را رسول می‌گرداند، زیرا حکم در مورد کسی که بر او حکم رانده نشود، صحیح نیست. و درباره کسی که در میان خانواده‌اش درنگ کند و به سوی او نگریزد، آنچه را در کتابش ذکر کرده، فرموده است، و آن این سخن خداوند متعال است: «قُلْ إِنْ كانَ آباؤُكُمْ وأَبْناؤُكُمْ وإِخْوانُكُمْ وأَزْواجُكُمْ وعَشِيرَتُكُمْ وأَمْوالٌ اقْتَرَفْتُمُوها وتِجارَةٌ تَخْشَوْنَ كَسادَها ومَساكِنُ تَرْضَوْنَها أَحَبَّ إِلَيْكُمْ من الله ورَسُولِهِ وجِهادٍ في سَبِيلِهِ فَتَرَبَّصُوا» (بگو: اگر پدرانتان و پسرانتان و برادرانتان و همسرانتان و خویشاوندانتان و اموالی که به دست آورده‌اید و تجارتی که از کسادی آن می‌ترسید و خانه‌هایی که به آن‌ها دلخوش هستید، نزد شما از خدا و رسولش و جهاد در راه او دوست‌داشتنی‌تر است، پس درنگ کنید). و درنگ (التربص) نقیض فرار است. «فَفِرُّوا إِلَى الله إِنِّي لَكُمْ مِنْهُ نَذِيرٌ مُبِينٌ» (پس به سوی خدا بگریزید، همانا من از جانب او برای شما بیم‌دهنده‌ای آشکارم). ما این فرار موسوی را در کتاب *الأسفار عن نتائج الأسفار* ذکر کرده‌ایم و این فرار موسوی را «سفر الطلب» (سفر طلب) نامیده‌ایم.\n\n### [معنای فرار و چگونگی آن و آنچه به بار می‌آورد]\n\nپس در اینجا معنای فرار و اینکه چگونه مقامی است و چه چیزی به بار می‌آورد را تحقیق کنیم. زیرا آشکار می‌شود که فرار یک نسبت (رابطه) است نه یک مقام، مانند عزلت و خلوت. چرا که مقام بودن آن نزد بیشتر اهل الله (اهل حق) ناشناخته است.\n\n### [فرار میان دو سوی آغاز و انجام]\n\nپس بدان که فرار میان دو سوی آغاز و انجام است؛ آغازش «مِن» (از) و انجامش «إلی» (به سوی) است. گاهی سبب ایجاب‌کننده فرار، «مِن» است، مانند فرار موسی (علیه السلام)، و «إلی» (به سوی) معین نیست. زیرا فرارکننده «از» چیزی، تنها نجات را می‌طلبد بدون تعیین مقصد. و اگر فرارکننده خود سبب ایجاب‌کننده فرار باشد، حتماً باید «إلی» (به سوی) معین باشد و «مِن» (از) معین نیست، که این عکس حالت اول است. و چون امر بدین منوال بود، خداوند به ما امر کرد که حتماً به سوی او بگریزیم. و گاهی به سوی او از خود او می‌گریزیم، مانند:\nسخن (پیامبر): «وأعوذ بك منك» (و از تو به تو پناه می‌برم).\nو گاهی به سوی او از کونی از اکوان (موجودات) یا از صفتی از صفات، چه الهی باشد یا غیر الهی، یا صفت فعل باشد یا غیر صفت فعل، می‌گریزیم.\n\n### [عنایت خداوند به این امت محمدی]\n\nپس خداوند در سخن خود «إِلَى الله» (به سوی خدا) به ما آموخت که چگونه بگریزیم. و این عنایتی از جانب خداوند به ما، یعنی این امت محمدیه، است که از آن آسودگی‌ای حاصل می‌شود که بر کسی پوشیده نیست. زیرا پیامبران (علیهم السلام) در هر آنچه از احوال خود خبر می‌دهند، راستگو هستند و منزه از آنند که جامه دروغ بپوشند. پس موسی (علیه السلام) گفت: «فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ» (پس چون از شما ترسیدم، از شما گریختم). و آن فرار برای او حکم (الحکم) را به بار آورد که همان امامت، خلافت و رسالت است، با وجود اینکه سبب ایجاب‌کننده را ذکر کرد و نگفت به کجا گریخت. پس اگر فرارکننده به سوی خدا بگریزد و کسی را که به سویش گریخته معین کند و آنچه را که از آن گریخته مبهم بگذارد، به نظر شما پاداش او چه خواهد بود؟ پاداش موسی (علیه السلام) پاداشی منقطع است، زیرا خلافت در اینجا ترک می‌شود و رسالت نیز به همین ترتیب با مرگ و انتقال به سرای آخرت منقطع می‌گردد. پس به او حکم چیزی داده شد که از آن گریخته بود، زیرا آن (فرعون) منقطع شد؛ یا با غرق شدن یا با مرگش اگر می‌مرد، و او ناگزیر از مرگ بود. پس نتیجه و بخشش (الهی) متناسب با انقطاع آن دو (امامت و رسالت) با مرگ بود. اما فرار به سوی خدا چیزی را عطا می‌کند که با بقای خدا باقی می‌ماند، و من آن را معین نمی‌کنم، زیرا تعیین آن در اختیار خداست. و فرقی نمی‌کند که فرار از خدا باشد یا نباشد، زیرا در اینجا توجه به کسی است که به سویش گریخته شده، در حالی که در حق موسی (علیه السلام) توجه به چیزی بود که از آن گریخته بود. و اگر این امت در این حکم و منزلت با پیامبران برابر باشد،\nپس گمانت درباره منزلت امت‌های پیامبران نسبت به ما چیست؟ به خدا سوگند، آنان نمی‌دانند این امت در فرار خود چه راهی را پیموده است، زیرا خداوند مجهول الأینیة (ناشناخته از حیث «کجا بودن») است و فرار به سوی او بوده است. پس هیچ کس نمی‌داند کسی که به سوی او می‌گریزد، هنگامی که او را دریافت کند و دستش را بگیرد، او را به کجا می‌برد. زیرا خداوند در دریافت کسی که به سویش گریخته، از خود فرارکننده سریع‌تر است.\nزیرا او که راستگوست، می‌فرماید: «ومن أتاني يسعى أتيته هرولة» (و هر کس شتابان به سوی من آید، من دوان به سوی او می‌روم).\nپس خود را به روی آوردن به بنده، هنگامی که با حالتی (از طلب) به سویش می‌آید، با چندین برابر آنچه بنده می‌آورد، وصف کرده است. و آمدن فرارکننده شدیدتر از هروله (دوان دوان رفتن) است، پس آمدن حق (الحق) به سوی او شدیدتر از آن خواهد بود. پس این را در علم الهی (العلم الإلهی) دریاب تا شگفتی را در آنچه خداوند به این امت به واسطه عنایت محمد (صلی الله علیه و سلم) عطا کرده است، ببینی.\n\n### [مقام تو از فرار معین نیست]\n\nپس بدان که مقام تو از فرار معین نیست، از این رو درباره آن سخن می‌گوییم. زیرا حکم آن در مورد فرارکننده، بسته به چیزی است که از آن گریخته، که این‌ها امور بسیاری هستند و جزئیاتشان قابل ضبط نیست، هرچند اصولشان محدود باشد؛ یا بسته به چیزی است که به سوی آن گریخته، که این‌ها اسماء الهی بسیاری هستند یا احکامی بر اساس آنچه فرارکننده به سوی آن می‌بیند. اما آنچه خداوند به آن امر کرده، این است که به سوی «الله» بگریزیم. و فرار به سوی «الله» از حیث مجموع صحیح نیست، زیرا ما از او به سوی او می‌گریزیم، چرا که در او چیزی هست که از آن می‌گریزیم. و «مِن» (از) و «إلی» (به سوی) با هم جمع نمی‌شوند، زیرا احکامشان متفاوت است. اگر بگویی:\nپس سخن (پیامبر): «وأعوذ بك منك» (و از تو به تو پناه می‌برم) چیست؟\nمی‌گوییم: در آن دو وجه است. اول اینکه حکم حرف «باء» در «وأعوذ بك» در اینجا حکم «إلی» (به سوی) نیست، زیرا او در حال فرار به خدا پناه می‌برد و به حکم «إلی» نرسیده است. و ما تنها درباره لفظ «إلی» از حیث دلالتش سخن می‌گوییم، و این تعویذ نبوی (پناه بردن پیامبر) تنها با «باء» واقع شده است، پس سخن تو با استعاذه (پناه بردن) وجهی ندارد. وجه دیگر این است که اگرچه آن را مطلوب «إلی» (به سوی) عین مستعاذ به (کسی که به او پناه برده می‌شود) در نهایت فرار قرار دهی، معلوم است که اگر عین کسی که از او می‌گریزی، عین کسی باشد که به سویش می‌گریزی، بدون اختلاف نسبت، فرار صحیح نخواهد بود. پس ناگزیر باید اختلاف نسبت وجود داشته باشد. نسبتی که تو را واداشته تا از او بگریزی، عین نسبتی است که به خاطر آن به سوی او گریخته‌ای، در حالی که عین (ذات) یکی است. مانند سخن خداوند: «يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ» (روزی که پرهیزگاران را به سوی رحمان محشور می‌کنیم). پس عینی که از آن محشور می‌شوی، همان عینی است که به سویش محشور می‌شوی، و دقیقاً همان است که به آن وصف شده‌ای. پس بنگر که مشهود متقی کدام اسم است؟ آن را «الرحمن» می‌یابی، اگرچه در حال تقوا نیز با او بوده است، اما به سوی او محشور می‌شوی تا او به تنهایی تو را در بر گیرد، بدون اینکه اسم دیگری در تو تصرف کند. و سخن او: «إِنِّي لَكُمْ مِنْهُ نَذِيرٌ مُبِينٌ» (همانا من از جانب او برای شما بیم‌دهنده‌ای آشکارم)، می‌دانی که آن اسمی که به خاطر آن، بیم‌دهنده آشکار از جانب بیم‌دهنده برای تو آمده، چیست. و سخن او «مِنْهُ» (از جانب او) به خدا بازمی‌گردد؛ اوست که او را به سوی تو فرستاده تا تو را به فرار به سوی خدا امر کند. و تنها به اسم جامع (الله) آمده است، زیرا در عرف طبع، تکیه بر کثرت است.\nپیامبر (صلی الله علیه و سلم) می‌فرماید: «يد الله مع الجماعة» (دست خدا با جماعت است).\nپس نفس با تکیه بر کثرت، احساس امنیت می‌کند. و «الله» مجموع اسماء خیر است. اگر معرفت (المعرفة) اسماء الهی را محقق سازی، اسماء قبض (گرفتن) را اندک و اسماء رحمت را در اسم «الله» بسیار خواهی یافت. به همین دلیل تو را به فرار به سوی «الله» امر کرده است. پس این را بدان.\n\n### [فرار حکمی است که بنده را در دنیا و آخرت همراهی می‌کند]\n\nو هیچ اسم الهی نیست مگر اینکه می‌خواهد تو را به خود پیوند دهد و مقید سازد و تو از آن او باشی تا سلطنتش در تو آشکار شود. و تو خود دانسته‌ای که سعادتت در فزونی (المزید) است، و فزونی برای تو حاصل نمی‌شود مگر با انتقال به حکم اسم دیگری تا علمی را که نزدت نبوده، کسب کنی. و آن اسمی که نزد آن هستی، تو را رها نمی‌کند، پس فرار ضروری می‌شود. و بیم‌دهی (الإنذار) این است که اسمی که نزد آن هستی، بر تو حکم به بقا با خود نکند. پس به سوی جایگاه فزونی گریخته‌ای. بنابراین، فرار حکمی است که بنده را در دنیا و آخرت همراهی می‌کند. و درجات عارفان (العارفین) از اهل اُنس و وصال (الوصال) از آن، پانصد و دوازده درجه است. و درجات عارفان از اهل ادب و وقوف نیز به همین تعداد است. و درجات ملامتیه (الملامية) از اهل اُنس و وصال، چهارصد و هشتاد و یک درجه است. و درجات ملامتیه از اهل ادب و وقوف نیز به همین تعداد است."
  },
  "page_count": 2
}