{
  "id": 170,
  "title": {
    "ar": "الباب السبعون ومائة في معرفة مقام الصحبة وأسراره",
    "en": "Chapter 170: Concerning the Knowledge of the Station (مقام) of Companionship (الصحبة) and its Secrets.",
    "ur": "ایک سو سترواں باب: مقامِ صحبت (مقام الصحبة) کی معرفت اور اس کے اسرار کے بیان میں",
    "fa": "باب صد و هفتادم در معرفت مقام صحبت و اسرار آن"
  },
  "content": {
    "ar": "## «الباب السبعون ومائة في معرفة مقام الصحبة وأسراره»\n\n\n> صحبة الله بالأدب *** صحبة الله في السبب‏\n\n\n> صحبة الكون كله *** بالذي فيه من نسب‏\n\n\n> فإذا ما علمت ذا *** أجل إن شئت في الطلب‏\n\n\n> لم يزل كل من يرى *** صحبة الحق في تعب‏\n\n\n> ذل من يصحب الإله *** على صحة النسب‏\n\n\nاعلم أن الصحبة نعت إلهي‏\n\n\nللخبر الوارد أنت الصاحب في السفر يقول النبي صَلَّى اللهُ عَليهِ وسَلَّم في سفره لله والخليفة في الأهل‏\n\n\nكما جعل الله الرسول خليفة في العالم جعله العالم إذا فارقوا أهلهم خليفة في أهلهم وهو قوله فَاتَّخِذْهُ وَكِيلًا\nوأوحى إلى من أوحى إليهم أَلَّا تَتَّخِذُوا من دُونِي وَكِيلًا يقول لهم فالصحبة تطلب أعيان الأغيار ما يَكُونُ من نَجْوى‏ ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ ولا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ ولا أَدْنى‏ من ذلِكَ ولا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ ما كانُوا والمعية صحبة عامة والخلة صحبة خاصة وسيرد بابها إن شاء الله غير إن في الصحبة أمرا يتعذر من وجه في الجناب الإلهي وهو المناسبة والمشاكلة إما من كل وجه وإما من أكثر الوجوه ولا مناسبة كما يرد في باب مقام ترك الصحبة فلا صحبة وقد وردت الصحبة فلا بد لها من وجه يستدعيها فإنه إخبار إلهي لا يَأْتِيهِ الْباطِلُ من بَيْنِ يَدَيْهِ ولا من خَلْفِهِ تَنْزِيلٌ من حَكِيمٍ حَمِيدٍ فلا تثبت الصحبة إلا إذا لم تأخذ في حدها الكفاءة فإذا أزلت الكفاءة في الصحبة ثبتت الصحبة في الجناب الإلهي فهو تعالى يصحبنا في كل حال نكون عليه ونحن لا نصحبه إلا في الوقوف عند حدوده فما نصحب على الحقيقة إلا أحكامه لا هو فهو معنا ما نحن معه لأنه يعرفنا ونحن لا نعرفه لذا أتى يصحبنا ولم يجي‏ء نصحبه فإنه يحفظنا له لا لنا من هذه الحقيقة نطلبه لنا لا له فإن طالبنا طالبناه فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ فشرع تعالى لنا ما شرع فقال من عَمِلَ صالِحاً فَلِنَفْسِهِ وهو قولنا نطلبه لنا لا له وقال فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ تحقيقا لطلبنا إياه لنا لا له وحقيقة طلبه إيانا له لا لنا قوله تعالى وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فأوجدنا له لا لنا فطلبناه لنا لا له بما خلقنا له ف الْتَفَّتِ السَّاقُ بِالسَّاقِ فأمر الصحبة عظيم وشأنها كبير وما يرعاها إلا الأكابر وأحسن ما بلغني في رعى حقها والقيام به ما حكي عن الحجاج رحمه الله أنه أمر بضرب عنق شخص فقال لي أمر نحب أن أذكره للأمير قبل أن يقتلني فقال له الحجاج قل قال أيها الأمير لا أحب أن أقوله لك إلا حتى تتركني مكتوفا بحالي أمشي معك في إيوانك هذا من أوله إلى آخره وما على الأمير في ذلك من بأس ولا يحول ذلك بينه وبين ما يريده مني ويقضي لي بهذا حاجة فقال لحاجبه أصعد به إلي وقام الحجاج يسايره في الإيوان ويصغي إليه ليرى ما ذا يقول له فلما بلغ معه إلى آخر الإيوان وعاد إلى مكانه قال أيها الأمير إن الكريم يراعي حق صحبة ساعة وقد صحبني الأمير وصحبته في هذه المشية والأمير أولى من رعى حق الصحبة فقال الحجاج خلوا سبيله فو الله لقد صدق ولقد نبه عاقلا فلو قتلته لكنت ألأم الناس ثم أمر أن يجزل له في الأعطية وخيره في صحبته والإقامة عنده فما أدري بعد ذلك هل أقام عنده أم لا فهذا من حسن ما يسمع في حق الصحبة من الوفاء به والرعاية هذا من الحجاج فلا بد لعبيد الله أن يخلصوا مع الله نفسا واحدا يصح به إطلاق الصحبة مع الله فلا بد أن يرعى الله حق ذلك النفس وأما صحبة أهل الله بعضهم مع بعض أو صحبتهم للخلق أو صحبة الخلق إياهم فهم يطالبون أنفسهم بحق ما يجب للصاحب على الصاحب فإن كان عين الحق له حقا عنده لزمه الوفاء به امتثالا لأمر سيده ووقوفا عند حده وإن كان لم يأته في ذلك أمر وأبيح له وجعل له الاختيار في ذلك فليرجح مع صاحبه مكارم الخلق بترك غرضه وعمله لغرض صاحبه ما لم يسخط الله في واجب معين فصحبة الله أولى وكذلك في صحبة غير الأشكال وغير الجنس مثل صحبته لما يملكه من الدواب والأشجار وما يصحبه من ذلك وإن لم يملكه فإن رأى شجرة ذابلة لاحتياجها إلى الماء وإن لم يكن مالكها حاضرا وقدر على سقيها في صحبة تلك الساعة حيث استظل بها أو استند إليها طلبا لراحة من تعب أو وقف عندها ساعة لشغل طرأ له فهذه كلها صحبة وهو قادر على الماء فتعين عليه رعى حق الصحبة أن يسقيها لذلك لا لأجل صاحبها ولا طمعا فيما نثمر سواء أثمرت أو لم نثمر أو كانت مملوكة أو مباحة وكذلك الحيوانات المؤذية وغير المؤذية فإنه في كل ذي كبد رطبة أجر وقد وردت في ذلك أخبار نبوية من سقى البغي الكلب فشكر الله فعلها فغفر لها وكوالي‏\n\n\nبخارى وكان ظالما فوهبه الله لكلب أحسن في صحبته ثلاثة أيام فنودي كنت كلبا فوهبناك لكلب‏\n\n",
    "en": "## Chapter One Hundred and Seventy: On the Knowledge of the Station of Companionship and its Secrets (مقام الصحبة وأسراره)\n\nCompanionship with Allah is through proper conduct (الأدب),\nCompanionship with Allah is within the means (السبب).\nCompanionship with the entire cosmos (الكون كله),\nThrough the relationship (نسب) that is within it.\nAnd when you know this,\nThen be noble, if you wish, in the quest (الطلب).\nEveryone who perceives has not ceased\nTo find Companionship with The Real (الحق) in toil.\nHumbled is he who accompanies the God (الإله),\nUpon the soundness of the relationship.\n\nKnow that Companionship (الصحبة) is a Divine Attribute (نعت إلهي), due to the reported tradition: \"You are the Companion (الصاحب) in the journey.\" The Prophet, peace and blessings be upon him, said this regarding his journey to Allah, and \"the Successor (الخليفة) over the family.\" Just as Allah made the Messenger a Successor in the World (العالم), He made him the Successor over their families when the people of the world departed from them. This is His saying: <<فَاتَّخِذْهُ وَكِيلًا>> (So take Him as a Trustee/Disposer of Affairs). And He revealed to those to whom He revealed: <<أَلَّا تَتَّخِذُوا من دُونِي وَكِيلًا>> (Do not take any trustee besides Me). He says to them: Companionship seeks the essences of others (أعيان الأغيار): <<ما يَكُونُ من نَجْوى‏ ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ ولا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ ولا أَدْنى‏ من ذلِكَ ولا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ ما كانُوا>> (There is no secret counsel of three but that He is their fourth, nor of five but that He is their sixth, nor of fewer than that nor of more, but that He is with them wherever they may be). This Being-With (المعية) is general companionship (صحبة عامة), while Intimate Friendship (الخلة) is specific companionship (صحبة خاصة). Its chapter will come, God willing.\n\nHowever, there is a matter in Companionship that is difficult from one perspective regarding the Divine Presence (الجناب الإلهي), which is suitability (المناسبة) and similarity (المشاكلة), either in every respect or in most respects. And there is no suitability, as will be mentioned in the chapter on the station of abandoning Companionship (مقام ترك الصحبة), so there is no companionship. Yet Companionship has been reported, so there must be an aspect that necessitates it, for it is a Divine declaration: <<لا يَأْتِيهِ الْباطِلُ من بَيْنِ يَدَيْهِ ولا من خَلْفِهِ تَنْزِيلٌ من حَكِيمٍ حَمِيدٍ>> (Falsehood cannot approach it from before it or from behind it; [it is] a revelation from One Wise and Praiseworthy).\n\nTherefore, Companionship is not established unless parity (الكفاءة) is not taken into account in its definition. If you remove parity in Companionship, then Companionship is established in the Divine Presence. Thus, He, the Exalted, accompanies us in every state we are in, but we do not accompany Him except by standing at His limits (حدوده). So, in reality, we only accompany His rulings (أحكامه), not Him. He is with us as long as we are with Him, because He knows us, and we do not know Him. This is why the text came saying He accompanies us, and did not come saying we accompany Him. For He preserves us for His sake, not for ours. From this reality, we seek Him for our sake, not for His. If He seeks us, we seek Him, for <<فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ>> (So to Allah belongs the conclusive argument).\n\nThus, the Exalted legislated for us what He legislated, saying: <<من عَمِلَ صالِحاً فَلِنَفْسِهِ>> (Whoever does righteousness, it is for his own soul). This confirms our statement that we seek Him for our sake, not for His. And He said: <<فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ>> (Indeed, Allah is free from need of the worlds), confirming our seeking Him for our sake, not for His. And the reality of His seeking us for His sake, not for ours, is His saying, the Exalted: <<وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except to worship Me). So He brought us into existence for His sake, not for ours. Yet we sought Him for our sake, not for His, by means of that for which He created us. <<ف الْتَفَّتِ السَّاقُ بِالسَّاقِ>> (And the leg is joined with the leg). Thus, the matter of Companionship is momentous and its status is great, and none observes it except the great ones.\n\nThe best account that reached me concerning the observance of its right and the fulfillment thereof is what was narrated about Al-Hajjaj, may Allah have mercy on him. He ordered a person to be executed. The man said, \"I have a matter I would like to mention to the Amir before he kills me.\" Al-Hajjaj told him, \"Speak.\" The man said, \"O Amir, I do not wish to tell you unless you leave me bound as I am and walk with me in this hall (iwan) of yours from one end to the other. There is no harm to the Amir in that, nor will it prevent him from what he intends for me, and by this, he will fulfill a need for me.\" He said to his chamberlain, \"Bring him up to me.\" Al-Hajjaj stood up, walking alongside him in the hall, listening intently to see what he would say. When he reached the end of the hall with him and returned to his place, the man said, \"O Amir, the noble person observes the right of companionship (صحبة) even if it is for an hour. The Amir has accompanied me, and I have accompanied him in this walk, and the Amir is the most worthy of those who observe the right of companionship.\" Al-Hajjaj said, \"Release him! By God, he has spoken the truth, and he has alerted a wise man. If I had killed him, I would have been the basest of people.\" Then he ordered generous gifts for him and gave him the choice of his companionship and residence with him. I do not know whether he stayed with him after that or not. This is among the finest things heard regarding the right of Companionship, concerning its fulfillment and observance, and this is from Al-Hajjaj.\n\nTherefore, the servants of Allah (عبيد الله) must dedicate a single soul (نفسًا واحدًا) to Allah, by which the application of Companionship with Allah (الصحبة مع الله) becomes valid. And Allah must observe the right of that soul.\n\nAs for the companionship of the People of Allah (أهل الله) with one another, or their companionship with creation (الخلق), or the companionship of creation with them: they hold themselves accountable for the right that is due from the companion to the companion. If the very essence of The Real (عين الحق) has a right with him, he is obliged to fulfill it, in compliance with the command of his Master and standing at His limit. And if no command concerning that has come to him, and it is permissible for him, and he is given the choice in the matter, then let him prioritize noble character (مكارم الخلق) with his companion by abandoning his own purpose and working for his companion's purpose, as long as it does not incur Allah's displeasure regarding a specific obligation. For Companionship with Allah is paramount.\n\nLikewise, in companionship with non-equals (غير الأشكال) and non-kind (غير الجنس), such as his companionship with the animals and trees he owns, and what he accompanies of them even if he does not own them. If he sees a wilting tree needing water, even if its owner is not present, and he is able to water it—in the companionship of that hour where he sought shade beneath it, or leaned against it seeking rest from fatigue, or stood by it for an hour due to an urgent matter—all of this constitutes companionship. Since he is capable of providing water, the observance of the right of companionship is incumbent upon him: that he water it for that reason, not for the sake of its owner, nor out of greed for its fruit—whether it bears fruit or not, or whether it is owned or permissible. Likewise, harmful and non-harmful animals, for in every creature with a moist liver there is a reward. Prophetic traditions have been reported concerning this, such as the prostitute who watered the dog, and Allah thanked her deed and forgave her. And the governor of Bukhara, who was a tyrant, whom Allah granted to a dog because he showed kindness in its companionship for three days. Then it was proclaimed: \"You were a dog, so We granted you to a dog.\"",
    "ur": "## باب ایک سو ستر: مقامِ صحبت (الصحبة) اور اس کے اسرار کی معرفت میں\n\nاللہ کی صحبت ادب کے ساتھ ہے،\nاللہ کی صحبت سبب (السبب) میں ہے۔\nتمام کائنات کی صحبت اس نسبت کے ساتھ ہے\nجو اس میں موجود ہے۔\nپس جب تم یہ جان لو، تو اگر چاہو تو طلب میں عظمت حاصل کرو۔\nہر وہ شخص جو حق (الحق) کی صحبت دیکھتا ہے، وہ ہمیشہ مشقت میں رہتا ہے۔\nوہ شخص ذلیل ہو گیا جو الٰہ کی صحبت اختیار کرے، نسبت کی صحت کے باوجود۔\n\nجان لو کہ صحبت (الصحبة) ایک الٰہی صفت (نعت إلهي) ہے۔\n\nاس وارد شدہ خبر کی بنا پر کہ \"تم سفر میں ساتھی (الصاحب) ہو\"، نبی اکرم صلی اللہ علیہ وسلم نے اللہ کی طرف اپنے سفر کے بارے میں فرمایا، اور (فرمایا) کہ \"اہل میں خلیفہ (الخليفة) ہو۔\"\n\nجس طرح اللہ نے رسول کو عالم میں خلیفہ بنایا، اسی طرح جب لوگ اپنے اہل کو چھوڑ کر جاتے ہیں تو اللہ نے اسے ان کے اہل میں خلیفہ بنایا، اور یہی اس کا قول ہے: \"تو اسے کارساز بنا لو\" (فَاتَّخِذْهُ وَكِيلًا)۔\n\nاور اس نے ان لوگوں کی طرف وحی کی جن کی طرف وحی کرتا ہے کہ: \"میرے سوا کسی کو کارساز نہ بناؤ\" (أَلَّا تَتَّخِذُوا من دُونِي وَكِيلًا)۔ وہ ان سے فرماتا ہے۔ پس صحبت (الصحبة) اغیار (الأغيار) کے اعیان (ذوات) کو طلب کرتی ہے: \"تین آدمیوں کی کوئی سرگوشی نہیں ہوتی مگر وہ ان کا چوتھا ہوتا ہے، اور نہ پانچ کی مگر وہ ان کا چھٹا ہوتا ہے، اور نہ اس سے کم کی اور نہ اس سے زیادہ کی مگر وہ ان کے ساتھ ہوتا ہے جہاں کہیں بھی وہ ہوں\" (ما يَكُونُ من نَجْوى‏ ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ ولا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ ولا أَدْنى‏ من ذلِكَ ولا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ ما كانُوا)۔\n\nاور معیت (المعية) عام صحبت ہے، جبکہ خلت (الخلة) خاص صحبت ہے۔ ان شاء اللہ اس کا باب بھی آئے گا۔\n\nالبتہ صحبت میں ایک ایسا معاملہ ہے جو جنابِ الٰہی میں ایک پہلو سے دشوار ہو جاتا ہے، اور وہ ہے مناسبت (المناسبة) اور مشاکلت (المشاكلة)۔ یا تو ہر پہلو سے، یا اکثر پہلوؤں سے۔ اور کوئی مناسبت نہیں ہے، جیسا کہ مقامِ ترکِ صحبت کے باب میں آئے گا، تو پھر صحبت نہیں ہے۔ اور چونکہ صحبت وارد ہوئی ہے، لہٰذا اس کے لیے کوئی نہ کوئی ایسا پہلو ضرور ہونا چاہیے جو اس کا متقاضی ہو۔ کیونکہ یہ ایک الٰہی خبر ہے: \"جس کے پاس باطل نہ اس کے آگے سے آ سکتا ہے اور نہ اس کے پیچھے سے، یہ حکمت والے، قابل تعریف (اللہ) کی طرف سے نازل کردہ ہے\" (لا يَأْتِيهِ الْباطِلُ من بَيْنِ يَدَيْهِ ولا من خَلْفِهِ تَنْزِيلٌ من حَكِيمٍ حَمِيدٍ)۔\n\nپس صحبت (الصحبة) ثابت نہیں ہوتی مگر جب اس کی تعریف میں کفایت (الکفاءة) کو شامل نہ کیا جائے۔ جب تم صحبت میں کفایت کو ہٹا دو گے، تو جنابِ الٰہی میں صحبت ثابت ہو جائے گی۔ پس وہ (اللہ تعالیٰ) ہر حال میں ہمارا ساتھی ہوتا ہے جس پر ہم ہوتے ہیں، لیکن ہم اس کی صحبت صرف اس کی حدود پر ٹھہرنے میں اختیار کرتے ہیں۔ حقیقت میں ہم صرف اس کے احکام کی صحبت اختیار کرتے ہیں، نہ کہ خود اس کی۔ پس وہ ہمارے ساتھ ہے جب تک ہم اس کے ساتھ ہیں، کیونکہ وہ ہمیں جانتا ہے اور ہم اسے نہیں جانتے۔ اسی لیے وہ ہماری صحبت اختیار کرتا ہے، اور یہ نہیں آیا کہ ہم اس کی صحبت اختیار کرتے ہیں۔ وہ ہمیں اپنے لیے محفوظ رکھتا ہے، ہمارے لیے نہیں۔ اس حقیقت کی بنا پر ہم اسے اپنے لیے طلب کرتے ہیں، نہ کہ اس کے لیے۔ اگر وہ ہمیں طلب کرے تو ہم اسے طلب کرتے ہیں۔ \"پس اللہ ہی کے لیے کامل دلیل ہے\" (فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ)۔\n\nپس اللہ تعالیٰ نے ہمارے لیے جو شریعت مقرر کی، اس میں فرمایا: \"جس نے نیک عمل کیا تو اپنے ہی لیے\" (من عَمِلَ صالِحاً فَلِنَفْسِهِ)۔ اور یہی ہمارا قول ہے کہ ہم اسے اپنے لیے طلب کرتے ہیں، نہ کہ اس کے لیے۔ اور فرمایا: \"تو بے شک اللہ تمام جہانوں سے بے نیاز ہے\" (فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ)۔ یہ ہمارے اس طلب کی تصدیق ہے کہ ہم اسے اپنے لیے طلب کرتے ہیں، نہ کہ اس کے لیے۔ اور اس کا ہمیں اپنے لیے طلب کرنا، نہ کہ ہمارے لیے، اس کا مصداق یہ قول ہے: \"اور میں نے جنوں اور انسانوں کو صرف اس لیے پیدا کیا کہ وہ میری عبادت کریں\" (وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ)۔ پس اس نے ہمیں اپنے لیے وجود بخشا، ہمارے لیے نہیں۔ تو ہم نے اسے اپنے لیے طلب کیا، نہ کہ اس کے لیے، اس چیز کے ذریعے جس کے لیے اس نے ہمیں پیدا کیا۔ \"پس پنڈلی سے پنڈلی لپٹ جائے گی\" (ف الْتَفَّتِ السَّاقُ بِالسَّاقِ)۔\n\nپس صحبت کا معاملہ عظیم ہے اور اس کی شان بڑی ہے۔ اس کی رعایت صرف اکابر ہی کرتے ہیں۔ اس کے حق کی رعایت اور اس کی ادائیگی کے بارے میں جو بہترین بات مجھ تک پہنچی ہے، وہ یہ ہے جو حجاج (رحمہ اللہ) کے بارے میں بیان کی جاتی ہے کہ اس نے ایک شخص کی گردن مارنے کا حکم دیا۔ اس شخص نے کہا: \"میرے پاس ایک بات ہے جو میں قتل ہونے سے پہلے امیر کو بتانا چاہتا ہوں۔\" حجاج نے اس سے کہا: \"بتاؤ۔\" اس نے کہا: \"اے امیر! میں آپ کو یہ بات تب تک نہیں بتانا چاہتا جب تک آپ مجھے اسی حالت میں بندھا ہوا اپنے اس ایوان میں میرے ساتھ شروع سے آخر تک چلنے کی اجازت نہ دیں۔ اس میں امیر پر کوئی بوجھ نہیں ہے، اور یہ آپ کے اور آپ کے مجھ سے مطلوبہ ارادے کے درمیان حائل نہیں ہو گا، اور اس طرح آپ میری ایک حاجت پوری کر دیں گے۔\" حجاج نے اپنے حاجب سے کہا: \"اسے میرے پاس لاؤ۔\" حجاج اس کے ساتھ ایوان میں چلنے لگا اور اس کی بات سننے لگا تاکہ دیکھے کہ وہ کیا کہتا ہے۔ جب وہ اس کے ساتھ ایوان کے آخر تک پہنچا اور اپنی جگہ واپس آیا تو اس شخص نے کہا: \"اے امیر! بے شک کریم شخص ایک گھڑی کی صحبت کا حق بھی ادا کرتا ہے۔ امیر نے اس چلنے میں میری صحبت اختیار کی اور میں نے امیر کی صحبت اختیار کی، اور امیر صحبت کے حق کی رعایت کرنے میں سب سے زیادہ حقدار ہے۔\" حجاج نے کہا: \"اسے چھوڑ دو۔ خدا کی قسم، اس نے سچ کہا اور ایک عقلمند کو متنبہ کیا۔ اگر میں اسے قتل کر دیتا تو میں سب سے زیادہ کمینہ شخص ہوتا۔\" پھر اس نے حکم دیا کہ اسے کثرت سے عطیات دیے جائیں اور اسے اپنی صحبت میں رہنے یا وہاں قیام کرنے کا اختیار دیا۔ مجھے نہیں معلوم کہ اس کے بعد وہ وہاں ٹھہرا یا نہیں۔ یہ صحبت کے حق میں وفاداری اور رعایت کے بارے میں سنی جانے والی بہترین باتوں میں سے ہے۔\n\nیہ حجاج کی طرف سے تھا، تو اللہ کے بندوں کے لیے ضروری ہے کہ وہ اللہ کے ساتھ ایک نفس (نفس) کو خالص کریں جس کے ذریعے اللہ کے ساتھ صحبت (الصحبة) کا اطلاق صحیح ہو جائے، تو اللہ کے لیے ضروری ہے کہ وہ اس نفس کے حق کی رعایت کرے۔\n\nاور جہاں تک اہل اللہ کی آپس میں صحبت کا، یا ان کی مخلوق کے ساتھ صحبت کا، یا مخلوق کا ان کے ساتھ صحبت کا تعلق ہے، تو وہ اپنے آپ کو اس حق کی ادائیگی کا پابند کرتے ہیں جو ایک ساتھی کا دوسرے ساتھی پر واجب ہے۔ پس اگر عینِ حق (عین الحق) کا کوئی حق اس کے پاس ہو، تو اس پر لازم ہے کہ وہ اپنے آقا کے حکم کی تعمیل اور اس کی حد پر ٹھہرتے ہوئے اسے پورا کرے۔ اور اگر اس بارے میں کوئی حکم نہ آیا ہو اور اسے مباح کر دیا گیا ہو اور اسے اختیار دیا گیا ہو، تو اسے چاہیے کہ وہ اپنے ساتھی کے ساتھ اخلاقِ کریمہ کو ترجیح دے، اپنے مقصد کو چھوڑ کر اور اپنے ساتھی کے مقصد کے لیے کام کرے، بشرطیکہ وہ کسی معین واجب میں اللہ کو ناراض نہ کرے۔ پس اللہ کی صحبت (صحبة الله) زیادہ اولیٰ ہے۔\n\nاور اسی طرح غیر ہم شکل اور غیر ہم جنس کی صحبت میں بھی (حق کی رعایت ضروری ہے)، جیسے اس کی صحبت جو وہ جانوروں اور درختوں میں سے رکھتا ہے، اور جو کچھ وہ ان میں سے اپنے ساتھ رکھتا ہے، اگرچہ وہ اس کا مالک نہ ہو۔ پس اگر وہ کسی مرجھائے ہوئے درخت کو دیکھے جسے پانی کی ضرورت ہو، اور اگرچہ اس کا مالک موجود نہ ہو، اور وہ اسے پانی دینے پر قادر ہو، تو اس ایک گھڑی کی صحبت میں، جب اس نے اس کے نیچے سایہ حاصل کیا یا تھکاوٹ سے آرام کی طلب میں اس سے ٹیک لگائی، یا کسی عارضی کام کے لیے ایک گھڑی اس کے پاس ٹھہرا، تو یہ سب صحبت (الصحبة) ہے۔ اور وہ پانی پر قادر ہے، تو اس پر صحبت کے حق کی رعایت کرنا متعین ہو گیا کہ وہ اسے پانی دے۔ یہ اس لیے نہیں کہ وہ اس کے مالک کے لیے ہو، اور نہ اس لالچ میں کہ وہ پھل دے گا، خواہ وہ پھل دے یا نہ دے، یا وہ مملوکہ ہو یا مباح۔ اور اسی طرح موذی اور غیر موذی جانوروں کے ساتھ بھی (حق کی رعایت ضروری ہے)، کیونکہ ہر تر جگر والے میں اجر ہے۔ اور اس بارے میں نبوی خبریں وارد ہوئی ہیں، جیسے اس فاحشہ عورت کا قصہ جس نے کتے کو پانی پلایا، تو اللہ نے اس کے فعل کو قبول کیا اور اسے بخش دیا۔\n\nاور بخاری کا والی جو ظالم تھا، تو اللہ نے اسے ایک کتے کے لیے بخش دیا جس کی صحبت میں اس نے تین دن تک احسان کیا، تو اسے ندا دی گئی: \"تو کتا تھا، پس ہم نے تجھے ایک کتے کے لیے بخش دیا ہے۔\"",
    "fa": "باب صد و هفتادم در معرفت مقام صحبت (الصحبة) و اسرار آن\n\nمصاحبت حق (الحق) با ادب *** مصاحبت حق (الحق) در سبب\nمصاحبت با کل هستی *** به واسطه نسبتی که در آن است\nپس اگر این را دانستی *** در طلب، اگر خواهی، بزرگ باش\nهر که مصاحبت حق (الحق) را می‌بیند *** پیوسته در رنج است\nخوار است آن که با اله مصاحبت می‌کند *** بر اساس صحت نسبت\n\nبدان که صحبت (الصحبة) صفتی الهی است، به دلیل خبر وارده: «أنت الصاحب في السفر» (تو همراه در سفر هستی). پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در سفرش به سوی خدا می‌فرماید: «والخليفة في الأهل» (و جانشین در میان خانواده).\n\nهمان‌گونه که خداوند رسول را جانشین (خليفة) در عالم قرار داد، او را جانشین در میان خانواده اهل عالم قرار داد هنگامی که از خانواده خود جدا می‌شوند، و این همان قول اوست: «فَاتَّخِذْهُ وَكِيلًا» (پس او را وکیل بگیر). و به کسانی که به آن‌ها وحی فرستاد، وحی کرد که: «أَلَّا تَتَّخِذُوا من دُونِي وَكِيلًا» (جز من وکیلی نگیرید).\n\nاو به آن‌ها می‌گوید: پس صحبت (الصحبة) عین اغیار (أعيان الأغيار) را می‌طلبد. «ما يَكُونُ من نَجْوى‏ ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ ولا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ ولا أَدْنى‏ من ذلِكَ ولا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ ما كانُوا» (هیچ رازگویی سه نفری نیست مگر آنکه او چهارمی آن‌هاست، و نه پنج نفری مگر آنکه او ششمی آن‌هاست، و نه کمتر از آن و نه بیشتر، مگر آنکه او هر کجا باشند با آن‌هاست). و معیت (المعية) صحبت (الصحبة) عام است و خلت (الخلة) صحبت (الصحبة) خاص است، و باب آن به خواست خداوند خواهد آمد.\n\nاما در صحبت (الصحبة) امری وجود دارد که از یک جهت در جناب الهی (الجناب الإلهي) دشوار است، و آن مناسبت (المناسبة) و مشابهت (المشاكلة) است، یا از هر جهت یا از بیشتر جهات. و مناسبتی وجود ندارد، چنانکه در باب مقام ترک صحبت (الصحبة) خواهد آمد، پس صحبتی نیست. و چون صحبت (الصحبة) وارد شده است، ناگزیر باید وجهی داشته باشد که آن را ایجاب کند، زیرا این خبری الهی است که: «لَا يَأْتِيهِ الْبَاطِلُ مِن بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ تَنزِيلٌ مِّنْ حَكِيمٍ حَمِيدٍ» (که باطل از پیش رو و از پشت سر به آن راه نیابد؛ فرو فرستاده‌ای است از جانب حکیمی ستوده).\n\nپس صحبت (الصحبة) ثابت نمی‌شود مگر آنکه کفویت (الكفاءة) را در تعریف آن لحاظ نکنی. هنگامی که کفویت (الكفاءة) را در صحبت (الصحبة) برداری، صحبت (الصحبة) در جناب الهی (الجناب الإلهي) ثابت می‌شود. پس او تعالی در هر حالی که ما بر آن هستیم، با ما مصاحبت می‌کند، اما ما با او مصاحبت نمی‌کنیم مگر در ایستادن بر حدود او.\n\nپس ما در حقیقت مصاحبت نمی‌کنیم مگر احکام او را، نه خود او را. او با ماست تا زمانی که ما با او هستیم، زیرا او ما را می‌شناسد و ما او را نمی‌شناسیم (المعرفة). از این رو، او آمد تا با ما مصاحبت کند و نیامد که ما با او مصاحبت کنیم. او ما را برای خودش حفظ می‌کند نه برای ما. از این حقیقت است که ما او را برای خودمان می‌طلبیم نه برای او. اگر او ما را طلب کند، ما نیز او را طلب می‌کنیم، «فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ» (پس حجت رسا از آن خداست).\n\nپس او تعالی آنچه را که تشریع کرد، برای ما تشریع کرد و فرمود: «مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهِ» (هر کس کار شایسته کند، به سود خود اوست). و این همان قول ماست که او را برای خودمان می‌طلبیم نه برای او. و فرمود: «فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ» (پس همانا خداوند از جهانیان بی‌نیاز است)، که این تأییدی است بر طلب ما او را برای خودمان نه برای او. و حقیقت طلب او ما را برای خودش نه برای ما، این قول او تعالی است: «وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ» (و جن و انس را نیافریدم جز برای آنکه مرا بپرستند).\n\nپس ما را برای او به وجود آورد نه برای ما، و ما او را برای خودمان می‌طلبیم نه برای او، به واسطه آنچه ما را برای آن آفرید. پس «الْتَفَّتِ السَّاقُ بِالسَّاقِ» (ساق به ساق در پیچید).\n\nپس امر صحبت (الصحبة) عظیم و شأن آن بزرگ است و جز بزرگان (الأكابر) آن را رعایت نمی‌کنند. و بهترین چیزی که در رعایت حق آن و قیام به آن به من رسیده، حکایتی است که از حجاج (رحمه الله) نقل شده است که دستور داد گردن شخصی را بزنند. آن شخص گفت: «کاری دارم که دوست دارم قبل از کشته شدنم آن را برای امیر بازگو کنم.» حجاج به او گفت: «بگو.» مرد گفت: «ای امیر، دوست ندارم آن را به تو بگویم مگر اینکه مرا در همین حال که دست‌بسته هستم رها کنی تا با تو در این ایوانت از اول تا آخر راه بروم.» و این کار برای امیر هیچ ضرری ندارد و مانع از آنچه او در مورد من می‌خواهد نمی‌شود، و با این کار حاجتی از من برآورده می‌شود. حجاج به حاجب خود گفت: «او را نزد من بیاور.» و حجاج برخاست و در ایوان با او همراهی کرد و گوش می‌داد تا ببیند چه می‌گوید. هنگامی که با او به انتهای ایوان رسید و به جای خود بازگشت، مرد گفت: «ای امیر، شخص کریم حق مصاحبت (صحبة) حتی یک ساعت را رعایت می‌کند. امیر با من مصاحبت کرد و من با او در این راه رفتن مصاحبت کردم، و امیر سزاوارترین فرد برای رعایت حق صحبت (الصحبة) است.» حجاج گفت: «او را رها کنید! به خدا سوگند که راست گفت و عاقلی را آگاه ساخت. اگر او را می‌کشتم، پست‌ترین مردم بودم.» سپس دستور داد که عطایای فراوانی به او بدهند و او را در مصاحبت (صحبته) و اقامت نزد خود مخیر ساخت. نمی‌دانم پس از آن نزد او ماند یا خیر.\n\nاین از جمله نیکوترین چیزهایی است که در مورد حق صحبت (الصحبة)، وفای به آن و رعایتش شنیده می‌شود، و این از حجاج است. پس بر بندگان خدا لازم است که با خدا یک نفس (نفس واحد) اخلاص ورزند تا اطلاق صحبت (الصحبة) با خدا صحیح باشد، و آنگاه خداوند ناگزیر حق آن نفس را رعایت خواهد کرد.\n\nاما صحبت (الصحبة) اهل الله با یکدیگر، یا مصاحبت آن‌ها با خلق، یا مصاحبت خلق با آن‌ها، اینان خود را به حق آنچه بر مصاحب نسبت به مصاحب واجب است، ملزم می‌دانند. اگر عین حق (عين الحق) حقی نزد او داشته باشد، وفای به آن بر او لازم است، به جهت امتثال امر مولای خود و ایستادن بر حد او. و اگر در آن مورد امری به او نرسیده باشد و برایش مباح باشد و اختیار به او داده شده باشد، باید با ترک غرض خود و عمل برای غرض مصاحبش، مکارم اخلاق (مكارم الخلق) را در حق مصاحبش ترجیح دهد، مادامی که در واجبی معین، موجب خشم خدا نشود؛ زیرا صحبت (الصحبة) با خدا اولویت دارد.\n\nو همچنین در صحبت (الصحبة) با غیر هم‌شکل‌ها و غیر هم‌جنس‌ها، مانند مصاحبت او با حیوانات و درختانی که مالک آن‌هاست، و آنچه از آن‌ها مصاحبت می‌کند حتی اگر مالک آن نباشد. اگر درختی را دید که به دلیل نیاز به آب پژمرده شده است، و مالک آن حاضر نیست، و او در آن ساعت مصاحبت (صحبة) قادر به آب دادن آن باشد—آنجا که زیر سایه‌اش استراحت کرده یا برای رفع خستگی به آن تکیه داده یا برای کاری که برایش پیش آمده ساعتی کنار آن ایستاده است—همه این‌ها صحبت (صحبة) است. و چون او قادر به آب دادن است، رعایت حق صحبت (حق الصحبة) بر او واجب می‌شود که به همین دلیل به آن آب دهد، نه به خاطر صاحبش و نه به طمع آنچه ثمر می‌دهد، چه ثمر دهد یا ندهد، یا چه ملک باشد یا مباح.\n\nو همچنین حیوانات موذی و غیر موذی، زیرا در هر موجود زنده‌ای که جگر تر دارد، پاداشی است. و در این باره اخبار نبوی وارد شده است: زن بدکاره‌ای که به سگی آب داد، و خداوند عمل او را شکر کرد و او را آمرزید. و والی بخارا که ظالم بود، خداوند او را به سگی بخشید، زیرا سه روز در مصاحبت (صحبته) با آن نیکی کرد. پس ندا داده شد: «تو سگ بودی، پس تو را به سگی بخشیدیم.»"
  },
  "page_count": 2
}