{
  "id": 485,
  "title": {
    "ar": "الباب الخامس والثمانون وأربعمائة في معرفة حال قطب كان منزله من كانَ يُرِيدُ الْحَياةَ الدُّنْيا وزِينَتَها نُوَفِّ إِلَيْهِمْ أَعْمالَهُمْ فِيها وهُمْ فِيها لا يُبْخَسُونَ",
    "en": "Chapter Four Hundred and Eighty-Five: Concerning the Gnosis of the State of a Pole (قطب) whose Station was [the meaning of the verse]: <<مَنْ كَانَ يُرِيدُ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا نُوَفِّ إِلَيْهِمْ أَعْمَالَهُمْ فِيهَا وَهُمْ فِيهَا لَا يُبْخَسُونَ>> (Whoever desires the life of this world and its adornment, We will fully repay them for their deeds therein, and they will not be deprived therein).",
    "ur": "باب چار سو پچاسی: ایک قطب (قطب) کے حال کی معرفت (المعرفۃ) کے بیان میں جس کا روحانی منزل (منزل) یہ تھا:\n\"مَن كَانَ يُرِيدُ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا نُوَفِّ إِلَيْهِمْ أَعْمَالَهُمْ فِيهَا وَهُمْ فِيهَا لَا يُبْخَسُونَ\"\n(جو شخص دنیا کی زندگی اور اس کی زینت چاہتا ہے، ہم ان کے اعمال کا بدلہ انہیں دنیا ہی میں پورا پورا دے دیتے ہیں، اور انہیں اس میں کوئی کمی نہیں کی جاتی۔)",
    "fa": "باب چهارصد و هشتاد و پنجم در معرفت حال قطبی که منزل او این آیه بود: «هر کس زندگی دنیا و زینت آن را بخواهد، اعمالشان را در آن به طور کامل به ایشان می‌دهیم و در آن هیچ کاستی نمی‌بینند» (مَنْ كانَ يُرِيدُ الْحَياةَ الدُّنْيا وزِينَتَها نُوَفِّ إِلَيْهِمْ أَعْمالَهُمْ فِيها وهُمْ فِيها لا يُبْخَسُونَ)."
  },
  "content": {
    "ar": "## «الباب الخامس والثمانون وأربعمائة في معرفة حال قطب كان منزله من كانَ يُرِيدُ الْحَياةَ الدُّنْيا وزِينَتَها نُوَفِّ إِلَيْهِمْ أَعْمالَهُمْ فِيها وهُمْ فِيها لا يُبْخَسُونَ»\n> إن الحياة هي النعيم فمن يرد *** تحصيله قبل الممات فقد أسا\n\n\n> إلا النعيم بربه وشهوده *** فهو المرجى في لعل وفي عسى‏\n\n\n> عند المحقق والمخصص بالهدى *** وتسهل الأمر الذي بي قد عسا\n\n\n> الواحد الفرد الذي بوجوده *** لم يتخذ غير المهيمن مؤنسا\n\n\n> وهو الذي عند الإله مقامه *** إذ كان من أدنى الخلائق مجلسا\n\n\nيقول الله تعالى أنا جليس من ذكرني‏\n\n\nومجالسة الحق بما يقتضيه مقام ذلك الذكر كان ما كان‏\n\n\n### [أن نية العبد خير من عمله‏]\n\n\nفاعلم إن نية العبد خير من عمله والنية إرادة أي تعلق خاص في الإرادة كالمحبة والشهوة والكرة فالعبد تحت إرادته فلا يخلو في إرادته إما أن يكون على علم بالمراد أو لا يكون فإن كان على علم فيها فلا يريد إلا ما يلائم طبعه ويحصل غرضه وإن كان غير عالم بمراده فقد يتضرر به إذا حصل له فإن راعى الحق الإرادة الطبيعية الأصلية نعم فإن كل مريد إنما يطلب ما يسر به لا ما يسوؤه ولكن يجهل الطريق إلى ذلك بعض القاصدين ويعرفه بعضهم فالعالم يجتنب طريق ما يسوءه والجاهل لا علم له فإن حصل له ما يسره فبالعرض بالنظر إليه وبالعناية الإلهية به فإن الله تعالى وصف نفسه بأنه لا يبخس أحدا في مراده كان المراد ما كان ومعلوم أن الإرادة الطبيعية ما قلناه وهي الأصل وأرجو من الله مراعاة الأصل لنا ولبعض الخلق ابتداء وأما الانتهاء فإليه مصير الكل فإذا وصف الله نفسه بأنه يوفي كل أحد عمله أي أجرة عمله في الزمان الذي يريدها فيه ولا يبخسه من ذلك شيئا فقد حبط عمله إن كانت إرادته الحياة الدنيا فلا حظ له في الآخرة التي هي الجنة أو النعيم الذي ينتجه العمل لأنه قد استوفاه في الدنيا فإن سعد بنيل راحة فذلك من الاسم الوهاب والإنعام الذي لا يكون جزاء فلا يكون لمن هذه حاله إن سعد إلا نعيم الاختصاص سكن حيث سكن واستقر حيث استقر فإن كان ممن يريد الحياة الدنيا ونقصه من ذلك نفس واحد لم ينعم به فليس هو ممن وفي الله له فيها عمله لأنه ما مكنه من كل ما تعلقت به إرادته في الحياة الدنيا وهل يتصور وجود هذا مع قرصة البرغوث والعثرة المؤلمة في الطريق أو لا فالآية تتضمن الأمرين وهي في الواحد المحال وقوعه في الوجود أظهر فإنه بعيد أن لا يتألم أحد في الدنيا فمن أراد الحياة الدنيا فقد أراد المحال فلو صح أن يقع هذا المراد لكان على الوجه الذي ذكرناه لكنه ليس بواقع وأما الأمر الآخر فإنه إذا تألم مثلا بقرصة برغوث إلى ما فوق ذلك من أكبر أو أصغر فإن كان مؤمنا فله عليه ثواب في الآخرة فيكون لهذا المريد الحياة الدنيا يعطيه الله ذلك الثواب في الدنيا معجلا فينعم به كما كان يفعل الله تعالى بأبي العباس السبتي بمراكش من بلاد الغرب رأيته وفاوضته في شأنه فأخبرني عن نفسه أنه استعجل من الله في الحياة الدنيا ذلك كله فعجله الله له فكان يمرض ويشفي ويحيي ويميت ويولي ويعزل ويفعل ما يريد كل ذلك بالصدقة وكان ميزانه في ذلك سباعيا إلا أنه ذكر لي قال خبأت لي عنده سبحانه ربع درهم لآخرتي خاصة فشكرت الله على إيمانه وسررت به وكان شأنه من أعجب الأشياء لا يعرف ذلك الأصل منه كل أحد إلا من ذاقه أو من سأله عن ذلك من الأجانب أولي الفهم فأخبرهم غير هذين الصنفين لا يعرف ذلك وقد يعطي الله ما أعطى السبتي المذكور لا من كونه أراد ذلك ولكن الله عجل له ذلك زيادة على ما ادخره له في الآخرة فإنه غير مريد تعجيل ذلك المدخر كعمر الواعظ بالأندلس ومن رأينا من هذا الصنف وعملت أنا عليه زمانا في بلدي في أول دخولي هذا الطريق ورأيت فيه عجائب وكان هذا لهم من الله ولنا لا من إرادتهم ولا من إرادتنا ولو عرف أبو العباس السبتي نفسه معرفتي بها منه ما استعجل ذلك فإنه كان على صورة لا يكون عنها إلا هذا إلا أنه سأل ذلك من الله فأعطاه إياه عن سؤال منه ولو سكت لفاز بالأمرين في الدارين لكن جهله بنفسه وطبعها الذي طبعت عليه وصورته التي ركبه الله عليها جعلته يسأل فخسر حين ربح غيره والعمل واحد ولهذا يفرح بالعلم لأنه أشرف صفة يتحلى بها العبد\n\n\n### [أن الحياة الدنيا ليست غير نعيمها]\n\n\nواعلم أن الحياة الدنيا ليست غير نعيمها فمن فاته من نعيمها شي‏ء فما وفيت له وما ذكر الله إلا توفيه العمل فهو نعيم العمل وصبره الذي ذكرناه على العثرة في محل التكليف وقرصة البرغوث وإن لم يكن مؤمنا بالدار الآخرة وفاه الله ما يطلبه ذلك العمل في الحياة الدنيا فما أعطى الله أحدا الحياة الدنيا مخلصة قط ولا هو واقع ولو وقع له كل مراد لكان‏\nأسعد الخلق فإنه من إرادته النجاة والبشرى من الله تعالى له بها وإن لم يكن مؤمنا فما وقع المشروط وقع عموم الشرط فافهم واعمل بحسب ما تعلم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Four Hundred and Eighty-Five: On the Knowledge of the State of a Pole Whose Station Was [the meaning of the verse]: <<مَنْ كَانَ يُرِيدُ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا نُوَفِّ إِلَيْهِمْ أَعْمَالَهُمْ فِيهَا وَهُمْ فِيهَا لَا يُبْخَسُونَ>> (Whoever desires the life of this world and its adornment, We will fully repay them for their deeds therein, and they will not be deprived therein)\n\nIndeed, life is felicity, so whoever desires\nIts attainment before death has done wrong.\n\nExcept for the felicity through his Lord and the witnessing (شهوده) of Him,\nThat is what is hoped for in 'perhaps' and 'maybe.'\n\n[It is found] with the Verifier (المحقق) and the one specialized by guidance,\nAnd it eases the matter that has become difficult for me.\n\nThe Unique, Singular One (الواحد الفرد) who, by his existence (وجوده),\nHas taken no companion other than the Guardian (المهيمن).\n\nAnd he is the one whose station (مقامه) is with God,\nEven though his assembly is among the lowest of creatures.\n\nGod Almighty says: \"I am the companion of him who remembers Me.\"\n\nAnd the companionship (مجالسة) of the Real (الحق), according to what the station (مقام) of that remembrance necessitates, is what it is.\n\n### That the Intention of the Servant is Better than His Action\n\nKnow that the intention (نية) of the servant is better than his action (عمل). Intention is volition (إرادة), meaning a specific attachment within volition, such as love, desire, or aversion. The servant is subject to his volition. His volition is either based on knowledge (علم) of the desired object (المراد) or it is not. If he has knowledge concerning it, he only wills what suits his nature and achieves his purpose. If he is ignorant of what he wills, he may be harmed by it when he attains it.\n\nIf the Real (الحق) observes the original natural volition (الإرادة الطبيعية الأصلية), then yes, for every wisher only seeks what brings him joy, not what harms him. However, some seekers are ignorant of the path to that, while others know it. The knowledgeable person avoids the path of what harms him, while the ignorant person has no knowledge. If the latter attains what brings him joy, it is incidentally in relation to his view, and due to Divine Providence (العناية الإلهية) concerning him.\n\nFor God Almighty described Himself as not depriving (لا يبخس) anyone of what he wills, whatever the desired object may be. It is known that the natural volition is what we have stated, and it is the origin (الأصل). I hope from God that He observes this origin for us and for some of creation initially. As for the end, the destiny of all is toward Him.\n\nThus, when God describes Himself as fully repaying (يوفي) everyone for his deed—meaning the wage of his deed—at the time he desires it, and does not deprive him of anything thereof, his deed is rendered void (حبط عمله) if his volition was the life of this world (الحياة الدنيا). He will have no share (حظ) in the Hereafter, which is Paradise, or the felicity (النعيم) produced by the deed, because he has already received full payment (استوفاه) for it in this world.\n\nIf he is made happy by attaining comfort, that is due to the Name al-Wahhab (The Bestower) and is a favor that is not a recompense. Therefore, if a person in this state is made happy, it is only the felicity of specialization (نعيم الاختصاص). He dwells where he dwells and settles where he settles.\n\nIf he is among those who desire the life of this world, and he is deprived of even a single breath of its felicity, then he is not among those whom God has fully repaid for their deeds therein, because God did not enable him to attain everything his volition was attached to in the life of this world. Is the existence of such a person conceivable, given the bite of a flea (قرصة البرغوث) or a painful stumble on the path, or not? The verse implies both possibilities, but it is more evident concerning the singular individual whose occurrence in existence is impossible (المحال وقوعه في الوجود).\n\nFor it is unlikely that anyone should not suffer pain in this world. Thus, whoever desires the life of this world has desired the impossible (المحال). If it were possible for this desired object to occur, it would be in the manner we mentioned, but it is not actualized.\n\nAs for the other matter: if he suffers pain, for example, from a flea bite, or anything greater or smaller than that, and he is a believer, he has a reward (ثواب) for it in the Hereafter. In this case, God gives this person who desires the life of this world that reward immediately in this world, and he enjoys it.\n\nThis is as God Almighty used to do with Abu al-Abbas al-Sabti in Marrakesh, in the lands of the West (al-Gharb). I saw him and discussed his affair with him. He informed me about himself that he had requested all of that immediately from God in the life of this world, and God hastened it for him. He would cause sickness and healing, give life and cause death, appoint and dismiss, and do whatever he wished, all through charity. His balance (ميزانه) in this was septenary, except that he mentioned to me, saying: \"I have hidden a quarter of a dirham specifically for my Hereafter with Him, the Glorified.\" I thanked God for his faith and was pleased with him.\n\nHis affair was among the most wondrous things. Not everyone knows the origin of this from him, except for those who tasted it or those insightful strangers who asked him about it, and he informed them. Others besides these two types do not know it.\n\nGod may grant what He granted the aforementioned Al-Sabti, not because the recipient willed it, but because God hastened it for him as an addition to what He had stored up for him in the Hereafter, since he did not will the hastening of that stored reward. Examples include Umar the Preacher in Al-Andalus, and others of this type whom we have seen. I myself practiced this for a time in my own country at the beginning of my entry into this Path (الطريق), and I saw wonders in it.\n\nThis was granted to them and to us by God, not due to their volition or our volition. Had Abu al-Abbas al-Sabti known himself as I knew him from his state, he would not have hastened that reward. For he was upon a form (صورة) from which nothing but this could issue forth. However, he asked God for it, and God gave it to him based on his request. Had he remained silent, he would have won both matters (in both abodes). But his ignorance of his own self, the nature upon which it was stamped, and the form upon which God composed him, caused him to ask, so he lost when others gained, even though the action was the same. This is why one rejoices in Knowledge (العلم), because it is the noblest Attribute (صفة) with which the servant adorns himself.\n\n### That the Life of This World is Nothing but Its Felicity\n\nKnow that the life of this world (الحياة الدنيا) is nothing but its felicity (نعيمها). Whoever misses anything of its felicity has not been fully repaid. God only mentioned the full repayment of the deed (توفيه العمل), which is the felicity of the deed.\n\nAnd the patience we mentioned regarding the stumble in the place of obligation (محل التكليف) and the flea bite: even if he is not a believer in the Last Abode, God fully repays him in the life of this world for what that deed demands.\n\nGod has never granted the life of this world purely (مخلصة) to anyone, nor is it actualized. If every desired object were actualized for him, he would be the happiest of creation, for among his volitions is salvation and the glad tidings from God Almighty concerning it, even if he is not a believer. Since the conditioned thing did not occur, the generality of the condition occurred. Understand this and act according to what you know. And God <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو پچاسی: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"جو کوئی دنیا کی زندگی اور اس کی زینت کا ارادہ کرتا ہے، ہم ان کے اعمال کا پورا بدلہ اسی میں دے دیتے ہیں اور انہیں اس میں کوئی کمی نہیں دی جائے گی (نُوَفِّ إِلَيْهِمْ أَعْمالَهُمْ فِيها وهُمْ فِيها لا يُبْخَسُونَ)\"۔\n\nبے شک زندگی ہی نعمت (النعیم) ہے، پس جو شخص\nموت سے پہلے اسے حاصل کرنا چاہے، اس نے برا کیا۔\n\nسوائے اس نعمت کے جو اپنے رب کے ساتھ ہو اور اس کے شہود (الشہود) کے ساتھ،\nوہی ہے جس کی امید \"شاید\" (لعل) اور \"ہو سکتا ہے\" (عسى) میں کی جاتی ہے۔\n\nمحقق اور ہدایت کے ساتھ مخصوص کیے گئے شخص کے نزدیک،\nاور اس امر کو آسان کرنے والا جو مجھ پر مشکل ہو چکا تھا۔\n\nوہ واحد، فرد (الفرد) جس کے وجود (الوجود) کے سبب\nاس نے مہیمن (اللہ) کے سوا کسی کو اپنا مونس نہیں بنایا۔\n\nاور وہی ہے جس کا مقام معبود کے نزدیک ہے،\nاگرچہ وہ مخلوقات میں سب سے کم تر مجلس والا تھا۔\n\nاللہ تعالیٰ فرماتا ہے: \"میں اس کا ہم نشین ہوں جو مجھے یاد کرتا ہے۔\"\n\nاور ذات حق (الحق) کی ہم نشینی اس ذکر کے مقام کے تقاضے کے مطابق تھی جو کچھ بھی تھی۔\n\n### [کہ بندے کی نیت اس کے عمل سے بہتر ہے]\n\nجان لو کہ بندے کی نیت (النیۃ) اس کے عمل سے بہتر ہے۔ اور نیت ارادہ (الإرادة) ہے، یعنی ارادے میں ایک خاص تعلق، جیسے محبت، شہوت، اور نفرت۔ پس بندہ اپنے ارادے کے تحت ہے۔ اس کا ارادہ اس سے خالی نہیں ہوتا کہ یا تو وہ مراد کے بارے میں علم رکھتا ہو یا نہ رکھتا ہو۔ اگر وہ اس کے بارے میں علم رکھتا ہے تو وہ صرف وہی چاہتا ہے جو اس کی طبیعت کے مطابق ہو اور اس کا مقصد پورا کرے۔ اور اگر وہ اپنی مراد سے ناواقف ہے تو جب وہ اسے حاصل ہو جائے تو اسے نقصان پہنچ سکتا ہے۔ اگر ذات حق (الحق) نے اصلی فطری ارادے کا لحاظ رکھا تو یہ بہت اچھا ہے۔ کیونکہ ہر ارادہ کرنے والا صرف وہی طلب کرتا ہے جس سے اسے خوشی ہو، نہ کہ وہ جو اسے ناگوار ہو۔ لیکن بعض طالبین اس کا راستہ نہیں جانتے اور بعض جانتے ہیں۔ عالم اس راستے سے اجتناب کرتا ہے جو اسے ناگوار ہو، اور جاہل کو علم نہیں ہوتا۔ اگر اسے وہ چیز حاصل ہو جائے جو اسے خوش کرتی ہے، تو یہ اس کی طرف نظر کرنے سے اور عنایت الٰہیہ کے سبب بالواسطہ ہوتا ہے۔ کیونکہ اللہ تعالیٰ نے اپنی صفت بیان کی ہے کہ وہ کسی کو بھی اس کی مراد میں کمی نہیں دیتا، مراد جو بھی ہو۔ اور یہ معلوم ہے کہ فطری ارادہ وہی ہے جو ہم نے بیان کیا، اور یہی اصل ہے۔ اور میں اللہ سے امید کرتا ہوں کہ وہ ہمارے لیے اور بعض مخلوق کے لیے ابتداء میں اس اصل کا لحاظ رکھے۔ اور جہاں تک انتہا کا تعلق ہے، تو سب کا ٹھکانہ اسی کی طرف ہے۔\n\nپس جب اللہ نے اپنی صفت بیان کی کہ وہ ہر ایک کو اس کا عمل پورا دیتا ہے، یعنی اس کے عمل کا معاوضہ اس وقت میں جب وہ اسے چاہتا ہے، اور اس میں سے کوئی چیز کم نہیں کرتا، تو اگر اس کا ارادہ دنیا کی زندگی (الحیاۃ الدنیا) تھا تو اس کا عمل ضائع ہو گیا، اور آخرت (الآخرۃ) میں، جو کہ جنت ہے یا وہ نعمت (النعیم) جو عمل سے پیدا ہوتی ہے، اس کا کوئی حصہ نہیں ہوگا۔ کیونکہ وہ اسے دنیا میں پورا حاصل کر چکا ہے۔ اگر وہ کسی راحت کے حصول سے خوش ہوتا ہے، تو یہ اسم \"الوہاب\" کی طرف سے ہے اور یہ وہ انعام ہے جو بدلہ نہیں ہوتا۔ لہٰذا جس شخص کا یہ حال ہو، اگر وہ خوش ہو، تو یہ صرف اختصاص کی نعمت (نعیم الاختصاص) ہوگی۔ وہ جہاں ٹھہرا، ٹھہرا رہا، اور جہاں قرار پکڑا، قرار پکڑا رہا۔ اگر وہ ان لوگوں میں سے تھا جو دنیا کی زندگی چاہتے ہیں اور اس میں سے ایک سانس بھی کم ہو گئی جس سے وہ لطف اندوز نہ ہو سکا، تو وہ ان لوگوں میں سے نہیں ہے جنہیں اللہ نے دنیا میں ان کا عمل پورا دیا، کیونکہ اللہ نے اسے ہر وہ چیز حاصل کرنے کا موقع نہیں دیا جس سے اس کا ارادہ دنیا کی زندگی میں متعلق تھا۔ اور کیا یہ تصور کیا جا سکتا ہے کہ یہ حالت پِسو کے کاٹنے یا راستے میں تکلیف دہ ٹھوکر لگنے کے باوجود موجود ہو؟ یا نہیں؟ پس یہ آیت دونوں امور کو شامل ہے، اور یہ اس واحد شخص کے بارے میں ہے جس کا وجود (الوجود) میں واقع ہونا محال ہے، یہ زیادہ ظاہر ہے۔ کیونکہ یہ بعید ہے کہ دنیا میں کسی کو تکلیف نہ ہو۔ پس جس نے دنیا کی زندگی کا ارادہ کیا، اس نے محال کا ارادہ کیا۔ اگر یہ مراد واقع ہونا صحیح ہوتا، تو یہ اسی طریقے پر ہوتا جو ہم نے ذکر کیا، لیکن یہ واقع نہیں ہے۔\n\nاور جہاں تک دوسرے امر کا تعلق ہے، تو اگر اسے تکلیف پہنچتی ہے، مثال کے طور پر پِسو کے کاٹنے سے لے کر اس سے بڑی یا چھوٹی کسی بھی چیز سے، تو اگر وہ مومن ہے تو اس کے لیے آخرت میں اس پر ثواب ہے۔ پس دنیا کی زندگی کا ارادہ کرنے والے اس شخص کو اللہ وہ ثواب دنیا میں جلد دے دیتا ہے، اور وہ اس سے لطف اندوز ہوتا ہے، جیسا کہ اللہ تعالیٰ مراکش (بلاد الغرب) میں ابو العباس السبتي کے ساتھ کرتا تھا۔ میں نے انہیں دیکھا اور ان کے معاملے میں ان سے بات چیت کی، تو انہوں نے مجھے اپنے بارے میں بتایا کہ انہوں نے اللہ سے دنیا کی زندگی میں یہ سب کچھ جلد مانگ لیا تھا، تو اللہ نے انہیں جلد دے دیا۔ چنانچہ وہ بیمار کرتے، شفا دیتے، زندہ کرتے، مارتے، مقرر کرتے، معزول کرتے، اور جو چاہتے کرتے، یہ سب صدقہ کے ذریعے ہوتا تھا۔ اور اس میں ان کا میزان سباعی (سات گنا) تھا۔ البتہ انہوں نے مجھے بتایا کہ: \"میں نے خاص طور پر اپنی آخرت کے لیے اس کے پاس (اللہ کے پاس) ایک چوتھائی درہم چھپا رکھا ہے۔\" میں نے ان کے ایمان پر اللہ کا شکر ادا کیا اور ان سے خوش ہوا۔ ان کا معاملہ عجیب ترین چیزوں میں سے تھا، اس کی اصل کو ہر کوئی نہیں جانتا تھا، سوائے اس کے جس نے اسے چکھا ہو، یا ان اجنبیوں میں سے جس نے ان سے اس بارے میں پوچھا ہو جو سمجھ بوجھ رکھتے تھے، تو انہوں نے انہیں بتایا۔ ان دو قسموں کے علاوہ کوئی نہیں جانتا۔ اور اللہ تعالیٰ وہ چیزیں عطا کر سکتا ہے جو اس نے مذکورہ السبتي کو عطا کیں، نہ اس وجہ سے کہ اس نے ان کا ارادہ کیا تھا، بلکہ اللہ نے اسے آخرت کے لیے جو کچھ ذخیرہ کر رکھا تھا، اس پر اضافہ کرتے ہوئے اسے جلد دے دیا۔ کیونکہ وہ اس ذخیرہ شدہ چیز کو جلد حاصل کرنے کا ارادہ نہیں رکھتا تھا، جیسے اندلس میں عمر الواعظ اور اس قسم کے دوسرے لوگ جنہیں ہم نے دیکھا۔ اور میں نے خود بھی اپنے شہر میں اس راستے میں داخل ہونے کے آغاز میں ایک زمانے تک اس پر عمل کیا اور اس میں عجائبات دیکھے۔ اور یہ ان کے لیے اور ہمارے لیے اللہ کی طرف سے تھا، نہ ان کے ارادے سے اور نہ ہمارے ارادے سے۔ اگر ابو العباس السبتي اپنی ذات کو اس طرح جانتے جس طرح میں انہیں جانتا تھا، تو وہ اسے جلد حاصل کرنے کی خواہش نہ کرتے۔ کیونکہ وہ ایک ایسی صورت پر تھے جس سے صرف یہی نتیجہ نکل سکتا تھا، لیکن انہوں نے اللہ سے یہ مانگا، تو اللہ نے ان کے سوال پر انہیں دے دیا۔ اگر وہ خاموش رہتے تو دونوں جہانوں میں دونوں چیزوں سے کامیاب ہوتے، لیکن ان کی اپنی ذات سے ناواقفیت اور وہ فطرت جس پر وہ پیدا کیے گئے تھے، اور وہ صورت جس پر اللہ نے انہیں مرکب کیا تھا، نے انہیں سوال کرنے پر مجبور کیا، تو جب دوسرے نے نفع کمایا تو انہوں نے نقصان اٹھایا، حالانکہ عمل ایک ہی تھا۔ اور اسی لیے علم سے خوشی ہوتی ہے، کیونکہ یہ سب سے اشرف صفت ہے جس سے بندہ مزین ہوتا ہے۔\n\n### [کہ دنیا کی زندگی اس کی نعمت (نعیم) کے سوا کچھ نہیں]\n\nاور جان لو کہ دنیا کی زندگی (الحیاۃ الدنیا) اس کی نعمت (نعیم) کے سوا کچھ نہیں ہے۔ پس جس سے اس کی نعمت میں سے کوئی چیز چھوٹ گئی، تو اسے پورا نہیں دیا گیا۔ اور اللہ نے صرف عمل کو پورا کرنے کا ذکر کیا ہے، پس وہ عمل کی نعمت ہے اور اس کا صبر جو ہم نے تکلیف کی جگہ پر ٹھوکر لگنے اور پِسو کے کاٹنے پر ذکر کیا، اگرچہ وہ دار آخرت پر ایمان نہ رکھتا ہو۔ اللہ اسے وہ چیز دنیا کی زندگی میں پوری دے دیتا ہے جو وہ عمل طلب کرتا ہے۔ اللہ نے کبھی بھی کسی کو دنیا کی زندگی خالص طور پر عطا نہیں کی، اور نہ ہی یہ واقع ہونے والا ہے۔ اور اگر اسے ہر مراد حاصل ہو جاتی تو وہ سب سے زیادہ خوش بخت مخلوق ہوتا، کیونکہ اس کے ارادے میں نجات اور اللہ تعالیٰ کی طرف سے اس کے لیے بشارت شامل ہے، اگرچہ وہ مومن نہ ہو۔ پس جب مشروط واقع نہیں ہوا تو شرط کا عموم واقع ہوا۔ پس سمجھو اور جو کچھ تم جانتے ہو اس کے مطابق عمل کرو۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و هشتاد و پنجم در معرفت حال قطبی که منزل او این آیه بود: «هر کس زندگی دنیا و زینت آن را بخواهد، اعمالشان را در آن به طور کامل به ایشان می‌دهیم و در آنجا چیزی از حقشان کاسته نمی‌شود.» (مَنْ كانَ يُرِيدُ الْحَياةَ الدُّنْيا وزِينَتَها نُوَفِّ إِلَيْهِمْ أَعْمالَهُمْ فِيها وهُمْ فِيها لا يُبْخَسُونَ)\n\nهمانا زندگی همان نعمت است، پس هر که بخواهد\nآن را پیش از مرگ به دست آورد، بد کرده است.\n\nمگر نعمتی که به پروردگار و شهود (الشهود) او باشد\nکه آن در «شاید» و «امید است» مورد انتظار است.\n\nنزد محقق و کسی که به هدایت اختصاص یافته است\nو کار دشواری که برای من سخت شده بود، آسان می‌شود.\n\nآن یگانه فردی که به واسطه هستی (الوجود) خود\nجز مهیمن (خداوند) را مونس نگرفت.\n\nو او کسی است که مقامش نزد خداست\nهرچند در پایین‌ترین جایگاه خلایق نشسته باشد.\n\nخداوند متعال می‌فرماید: «من همنشین کسی هستم که مرا یاد کند.» (أنا جليس من ذكرني)\n\nو همنشینی با حق (الحق) به مقتضای مقام آن ذکر، همان بود که بود.\n\n### [اینکه نیت بنده بهتر از عمل اوست]\n\nپس بدان که نیت بنده بهتر از عمل اوست. و نیت همان اراده است، یعنی تعلقی خاص در اراده، مانند محبت، شهوت و کراهت. پس بنده تحت اراده خود است و اراده او از دو حال خارج نیست: یا بر مراد خود علم دارد یا ندارد. اگر بر آن علم داشته باشد، جز آنچه با طبعش سازگار است و هدفش را محقق می‌سازد، اراده نمی‌کند. و اگر به مراد خود عالم نباشد، ممکن است با حصول آن متضرر شود.\n\nاگر حق (الحق) اراده طبیعی اصلی را رعایت کند، آری؛ زیرا هر اراده‌کننده‌ای تنها چیزی را می‌طلبد که او را شاد کند، نه آنچه او را بدحال سازد. اما برخی از سالکان راه رسیدن به آن را نمی‌دانند و برخی دیگر می‌دانند. پس عالم از راه آنچه او را بدحال می‌سازد دوری می‌کند، اما جاهل علمی ندارد. اگر چیزی که او را شاد می‌کند به دست آورد، این به واسطه عرضی است که به او نظر شده و به واسطه عنایت الهی به اوست.\n\nزیرا خداوند متعال خود را چنین وصف کرده که هیچ کس را در مرادش کم نمی‌گذارد، هر چه آن مراد باشد. و معلوم است که اراده طبیعی همان است که گفتیم و آن اصل است. و از خداوند امید دارم که این اصل را برای ما و برای برخی از خلق، در ابتدا رعایت کند. اما در انتها، بازگشت همه به سوی اوست.\n\nپس هنگامی که خداوند خود را چنین وصف می‌کند که عمل هر کس را به طور کامل می‌دهد، یعنی پاداش عملش را در زمانی که آن را می‌خواهد، به او می‌دهد و چیزی از آن کم نمی‌گذارد؛ اگر اراده‌اش زندگی دنیا باشد، عملش تباه شده است. پس او در آخرت که همان بهشت است یا نعمتی که عمل تولید می‌کند، بهره‌ای ندارد، زیرا آن را در دنیا به طور کامل دریافت کرده است. اگر با رسیدن به آسایشی سعادتمند شود، این از اسم «الوهاب» و انعام الهی است که پاداش نیست. پس برای کسی که حالش چنین است، اگر سعادتمند شود، جز نعمت اختصاصی نخواهد بود؛ هر جا که ساکن شود و هر جا که مستقر گردد.\n\nاگر او از کسانی باشد که زندگی دنیا را می‌خواهند و حتی یک نفس از آن نعمت بر او ناقص شود، پس او از کسانی نیست که خداوند عملش را در دنیا به طور کامل به او داده باشد، زیرا خداوند او را بر تمام آنچه اراده‌اش در زندگی دنیا به آن تعلق گرفته بود، مسلط نساخته است. و آیا تصور وجود چنین حالتی با نیش پشه و لغزش دردناک در راه ممکن است یا خیر؟ پس آیه شامل هر دو امر است، و در مورد آن فرد واحدی که وقوعش در هستی (الوجود) محال است، آشکارتر است. زیرا بعید است که کسی در دنیا درد نکشد. پس هر کس زندگی دنیا را اراده کند، محال را اراده کرده است. اگر صحیح بود که این مراد واقع شود، بر وجهی بود که ذکر کردیم، اما واقع نمی‌شود.\n\nاما امر دیگر این است که اگر مثلاً به واسطه نیش پشه یا چیزی بزرگتر یا کوچکتر از آن، دردی به او برسد، اگر مؤمن باشد، در آخرت برایش ثوابی است. پس برای این اراده‌کننده زندگی دنیا، خداوند آن ثواب را در دنیا به صورت تعجیل‌شده به او می‌دهد و او از آن متنعم می‌شود، همان‌گونه که خداوند متعال با ابوالعباس سبتی در مراکش از بلاد مغرب رفتار می‌کرد. من او را دیدم و درباره کارش با او گفتگو کردم. او به من خبر داد که همه آن را در زندگی دنیا از خداوند خواسته و خداوند نیز آن را برایش تعجیل کرده است. پس او بیمار می‌کرد و شفا می‌داد، زنده می‌کرد و می‌میراند، ولایت می‌داد و عزل می‌کرد، و هر چه می‌خواست انجام می‌داد، و همه اینها به واسطه صدقه بود. و میزان او در این کار هفت‌گانه بود. جز اینکه به من گفت: «نزد او سبحانه، یک چهارم درهم را به طور خاص برای آخرتم ذخیره کرده‌ام.» پس من خدا را بر ایمان او شکر کردم و از او شادمان شدم.\n\nو کار او از شگفت‌انگیزترین امور بود. اصل آن را هر کسی نمی‌داند، مگر کسی که آن را چشیده باشد یا از او در این باره سؤال کرده باشد، از غریبه‌های صاحب فهم، و او به ایشان خبر داده باشد. غیر از این دو صنف، کسی آن را نمی‌داند. و گاهی خداوند آنچه را که به سبتی مذکور داد، نه به دلیل اراده او، بلکه خداوند آن را برای او تعجیل کرد، به عنوان افزایشی بر آنچه برای او در آخرت ذخیره کرده بود؛ زیرا او تعجیل آن ذخیره را اراده نکرده بود، مانند عمر واعظ در اندلس و کسانی از این صنف که ما دیدیم. و من خود نیز زمانی در ابتدای ورودم به این راه، در شهر خود بر اساس آن عمل کردم و عجایبی در آن دیدم. و این برای آنان و برای ما از جانب خدا بود، نه از اراده آنان و نه از اراده ما. و اگر ابوالعباس سبتی خود را آن‌گونه که من او را شناختم، می‌شناخت، آن را تعجیل نمی‌کرد. زیرا او بر صورتی بود که جز این از آن حاصل نمی‌شد، جز اینکه آن را از خدا خواست و خداوند نیز به واسطه درخواستش به او عطا کرد. اگر سکوت می‌کرد، به هر دو امر در دو سرا دست می‌یافت، اما جهل او به نفس خود و طبعی که بر آن سرشته شده بود و صورتی که خداوند او را بر آن مرکب ساخته بود، باعث شد که درخواست کند. پس در حالی که دیگری سود برد، او زیان دید، در حالی که عمل یکی بود. و به همین دلیل است که به علم شادمان می‌شود، زیرا علم شریف‌ترین صفتی است که بنده به آن آراسته می‌شود.\n\n### [اینکه زندگی دنیا چیزی جز نعمت آن نیست]\n\nو بدان که زندگی دنیا چیزی جز نعمت آن نیست. پس هر کس چیزی از نعمت آن را از دست بدهد، به طور کامل به او داده نشده است. و خداوند جز به وفای کامل عمل اشاره نکرده است، پس آن نعمت عمل است. و صبر او که ذکر کردیم بر لغزش در محل تکلیف و نیش پشه، حتی اگر به سرای آخرت مؤمن نباشد، خداوند آنچه را که آن عمل در زندگی دنیا می‌طلبد، به او به طور کامل می‌دهد. پس خداوند هرگز زندگی دنیا را به طور خالص به کسی نداده است و این واقع نمی‌شود. و اگر تمام مرادش برای او واقع می‌شد، خوشبخت‌ترین خلق بود، زیرا نجات و بشارت از جانب خداوند متعال نیز از اراده اوست. و اگر مؤمن نباشد، هرگاه مشروط واقع نشود، عموم شرط واقع می‌شود. پس بفهم و بر اساس آنچه می‌دانی عمل کن. و خداوند حق (الحق) را می‌گوید و اوست که راه را هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 3
}