{
  "id": 368,
  "title": {
    "ar": "الباب الثامن والستون وثلاثمائة في معرفة منزل الأفعال مثل أتى ولم يأت وحضرة الأمر وحده",
    "en": "Chapter Three Hundred and Sixty-Eight: Concerning the Gnosis of the Station of the Acts (منزل الأفعال), such as \"He came and He did not come,\" and the Presence of the Command (حضرة الأمر) alone.",
    "ur": "باب تین سو اڑسٹھ: افعال کی منزل کی معرفت میں، جیسے کہ 'آیا' اور 'نہیں آیا'، اور حضرۃ الامر (حضرۃ الأمر) کی تنہا معرفت۔",
    "fa": "باب سیصد و شصت و هشتم در معرفت منزل افعال، مانند «آمد» و «نیامد»، و حضرت امر به تنهایی."
  },
  "content": {
    "ar": "## «الباب الثامن والستون وثلاثمائة في معرفة منزل الأفعال مثل أتى ولم يأت وحضرة الأمر وحده»\n\n\n> إذا كان غير الجنس مثلي في الفصل *** فأين امتيازي بالحديث عن النحل‏\n\n\n> أنا ناطق والطير مثلي ناطق *** كما جاء في القرآن في سورة النمل‏\n\n\n> فلا تفرحن إلا بما أنت واحد *** به فوجود الشكل يأنس بالشكل‏\n\n\n> لقد كان لي شيخ عزير مقدس *** يقول بتفضيل الأمور وبالوصل‏\n\n\n### [قد ورد في القرآن عن أمر المستقبل بلفظ الماضي لتحقق وقوعه‏]\n\n\nقال الله تعالى وإِذْ قالَ الله يا عِيسَى ابْنَ مَرْيَمَ أَ أَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وأُمِّي إِلهَيْنِ من دُونِ الله وهذا القول لا يكون إلا يوم القيامة فما وقع فعبر بالماضي عن المستقبل لتحقق وقوعه ولا بد وزوال حكم الإمكان فيه إلى حكم الوجوب وكل ما كان بهذه المثابة فحكم الماضي فيه والمستقبل على السواء وسياقه بالماضي آكد في الوقوع وتحققه من بقائه على الاستقبال اعلم يا ولي أسعدك الله بالحق ونطقك به إن جماعة من أهل الله غلطوا في أمر جاء من عند الله تعالى وساعدناهم على غلطهم وما ساعدناهم ولكن مشينا أقوالهم لانتمائهم إلى الله حتى لا ينتمي إليه سبحانه إلا أهل حق وصدق وذلك أن الأمر الذي غلطوا فيه علم الحق المخلوق به وجعلوا هذا المخلوق به عينا موجودة لما سمعوا الله يقول إنه خَلَقَ السَّماواتِ والْأَرْضَ بِالْحَقِّ وما أشبه هذه الآيات الواردة في القرآن والباء هنا بمعنى اللام ولهذا قال تعالى في تمام الآية فَتَعالَى الله عَمَّا يُشْرِكُونَ من أجل الباء والأمر في نفسه في حق السماء والأرض وما أنزل ما بينهما حتى يعم الوجود كله مثل قوله وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ كذلك ما خلق السماوات والأرض إلا بالحق أي للحق فاللام التي نابت الباء هنا منابها عين اللام التي في قوله لِيَعْبُدُونِ فخلق السموات والأرض للحق والحق أن يعبدوه ولهذا قال فَتَعالَى الله عَمَّا يُشْرِكُونَ والشرك هو الظلم العظيم وما ظهر من موجود إلا من هذا النوع الإنساني وما ذكر الجن معه في الخلق للعبادة إلا لكونه أغواه بالشرك لا أنه أشرك والإنس هو الذي أشرك هذا إذا لم تكن الجن عبارة عن باطن الإنسان فكأنه يقول وما خلقت الجن وهو ما استتر من الإنسان وما بطن منه والإنس وهو ما يبصر منه لظهوره إلا ليعبدون‏\nظاهرا وباطنا ثم قال أَ ولَمْ يَرَ الْإِنْسانُ أَنَّا خَلَقْناهُ من نُطْفَةٍ فَإِذا هُوَ خَصِيمٌ مُبِينٌ أي بين الخصومة ظاهر بها وقال خَلَقَ الْإِنْسانَ من نُطْفَةٍ فَإِذا هُوَ خَصِيمٌ مُبِينٌ وذلك لدعواه في الربوبية وما خلقه الله إلا عبدا فلا يتجاوز قدره فنازع ربه في ربوبيته وما نازعه مخلوق إلا هو ووصف خصومته بالإبانة دون من وصفه بالخصومة من الملإ الأعلى وغيرهم وفي دعوى غير الربوبية فإنه ما من خصام يكون من مخلوق في أمر خلاف دعوى الربوبية إلا وهو ممكن أن يكون الحق بيده في ذلك ويخفى على السامع والحاكم فلا يدري هل الحق معه أو مع خصمه وهل هو صادق في دعواه أو هو كاذب للاحتمال المتطرق في ذلك إلا دعواه في الربوبية فإنه يعلم من نفسه ويعلم كل سامع من خلق الله أنه كاذب في دعواه وأنه عبد ولذلك خلقه الله فلهذا قيل فيه إنه خصيم مبين أي ظاهر الظلم في خصومته فمن نازع ربه في ربوبيته كيف يكون حاله ثم إن هذا الإنسان ليته يسعى في ذلك في حق نفسه فإنه يعلم من نفسه أنه ليس له حظ في الربوبية ثم يعترف بالربوبية لخلق من خلق الله من حجر أو نبات أو حيوان أو إنسان مثله أو جان أو ملك أو كوكب فإنه ما بقي صنف من المخلوقات إلا وقد عبد منه وما عبده إلا الإنسان الحيوان فأشقى الناس من باع آخرته بدنيا غيره ومن هلك فيما لا يحصل بيده منه شي‏ء فيشهد على نفسه أنه أجهل الناس بغيره وأعلم الناس بنفسه لأنه ما ادعاها لنفسه ومن ادعاها لنفسه فإنما فَاسْتَخَفَّ قَوْمَهُ فَأَطاعُوهُ لذلك وهو يعلم خلاف ذلك من نفسه ولذلك قال ما عَلِمْتُ لَكُمْ من إِلهٍ غَيْرِي أي في اعتقادكم‏\n\n\n### [أن الحق تعالى لا يخلق شيئا بشي‏ء لكن يخلق شيئا عند شي‏ء]\n\n\nواعلم أن الحق تعالى لا يخلق شيئا بشي‏ء لكن يخلق شيئا عند شي‏ء فكل ما يقتضي\n\n\nالاستعانة والسببية فهي لام الحكمة فما خلق الله شيئا إلا للحق والحق أن يعبدوه فَإِذا هُوَ خَصِيمٌ مُبِينٌ وما ذاك إلا من عمى القلوب الَّتِي في الصُّدُورِ عن الحق فلو كانت غير معرضة عن الحق مقبلة عليه لأبصرت الحق فأقرت بالربوبية له في كل شي‏ء ولم يشرك بعبادة ربه أحدا ولذلك قال فَمَنْ كانَ يَرْجُوا لِقاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صالِحاً والصالح الذي لا يدخله خلل فإن ظهر فيه خلل فليس بصالح وليس الخلل في العمل وعدم الصلاح فيه إلا الشرك فقال ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً فنكر فعم كل من ينطلق عليه اسم أحد وهو كل شي‏ء في عالم الخلق والأمر وعم الشرك الأصغر وهو الشرك الذي في العموم وهو الربوبية المستورة المنتهكة في مثل فعلت وصنعت وفعل فلان ولو لا فلان فهذا هو الشرك المغفور فإنك إذا راجعت أصحاب هذا القول فيه رجعوا إلى الله تعالى والشرك الذي في الخصوص فهم الَّذِينَ يَجْعَلُونَ مَعَ الله إِلهاً آخَرَ وهو الظلم العظيم الذي ظلموا به هذا المقول عليه إنه إله مع الله فظلموا الله في وحدانية الألوهية له وظلموا الشريك في نسبة الألوهية إليه فيأخذهم الله بظلم الشريك لا بظلمه في أحديته فإن الذي جعلوه شريكا يتبرأ منهم يوم القيامة حيث تظهر الحقوق إلى أربابها المستحقين لها فعلى الحقيقة أن الله لا يخلق شيئا بشي‏ء وإن خلقه لشي‏ء فتلك لام الحكمة وعين خلقه عين الحكمة إذ خلقه تعالى لا يعلل فالخلق عبد بالذات أثرت فيه العوارض ولا سيما الشخص الإنساني بل ما أثرت العوارض إلا في الشخص الإنساني وحده دون سائر الخلق وما سواه فعلى أصله من تنزيه خالقه عن الشريك ولذلك قال وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ ولكِنْ لا تَفْقَهُونَ وهذا ضمير الجمع في تفقهون إنما هم الناس خاصة فجميع المخلوقات عبدوا الله إلا بعض الناس فالإنسان أَلَدُّ الْخِصامِ حيث خاصم فيما هو ظاهر الظلم فيه وليس إلا الربوبية وهل رأيتم عبدا يخاصم ربه إلا إذا خرج عن عبوديته وزاحم سيده في ربوبيته فادعى ملكا لنفسه فإذا تصرف فيه سيده نازعه فيه وخاصمه فما وقعت خصومة من عبد في عبودية وإنما وقعت فيما هو رب فيه ومالك له وكثير من أهل الله من العلماء منهم ممن لا أذكره ولا أسميه فإن هذه النسبة إليه نسبة تنص على جهله فلذلك تأدبت معه فقرروا المخلوق به على وجهين فمنهم من جعل هذا الحق المخلوق به عين علة الخلق والحق تعالى لا يعلل خلقه هذا هو الصحيح في نفسه حتى لا يعقل فيه أمر يوجب عليه ما ظهر من خلقه بل خلقه الخلق منة منه على الخلق وابتداء فضل وهو الغني عن العالمين ومنهم من جعل هذا الحق المخلوق به عينا موجودة بها خلق الله ما سواها وهم القائلون بأنه ما صدر عن الواحد إلا واحد وكان صدور ذلك الواحد صدور معلول عن علة أوجبت العلة صدوره وهذا فيه ما فيه والذي أقول به إنه‏\n\n\n> إذا جاء أمر الله فالآمر الأمر *** وذلك توحيد إلى من له الأمر\n> فلا تشركوا فالشرك ظلم مبرهن *** عليه وهذا الظلم قد عمه الحجر\n\n\nولما كان العلم تحيا به القلوب كما تحيا بالأرواح أعيان الأجسام كلها سمي العلم روحا تنزل به الملائكة على قلوب عباد الله وتلقيه وتوحى به من غير واسطة في حق عباده أيضا فأما القاؤه ووحيه به فهو قوله يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ وقوله وكَذلِكَ أَوْحَيْنا إِلَيْكَ رُوحاً من أَمْرِنا وأما تنزيل الملائكة به على قلوب عباده فهو قوله تعالى يُنَزِّلُ الْمَلائِكَةَ بِالرُّوحِ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ فهم المعلمون والأستاذون في الغيب يشهدهم من نزلوا عليه فإذا نزل هذا الروح في قلب العبد بتنزيل الملك أو بإلقاء الله ووحيه حيي به قلب المنزل عليه فكان صاحب شهود ووجود لا صاحب فكر وتردد ولا علم يقبل عليه دخلا فينتقل صاحبه من درجة القطع إلى حال النظر فالعبد العالم المجتبى إما يعرج فيرى وإما ينزل عليه في موضعه‏\n\n\n> إن العروج لرؤية الآيات *** نعت المحقق في شهود الذات‏\n\n\n> فانظر بفعل الحال تشهد كونه *** وانظر إلى الماضي يريك الآتي‏\n\n\n> إن الوجود مبرهن عن نفسه *** بوجوده في أكثر الحالات‏\n\n\n> فالحال في الأحياء يشهد دائما *** والماضي والآتي مع الأموات‏\n\n\nفإن قال المعتذر عن هؤلاء فما فائدة خلق الإنسان الكامل على الصورة قلنا ليظهر عنه صدور الأفعال والمخلوقات كلها مع وجود عينه عنده أنه عبد فإن غاية الأمر الإلهي أن يكون الحق مع العبد وبصره بل جميع قواه‏\n\n\nفقال تعالى فإذا أحببته كنت سمعه وبصره ويده‏\n\n\nالحديث فأثبت بالضمير عينه عبدا لا ربوبية له وجعل ما يظهر به وعليه ومنه أن ذلك هو الحق تعالى لا للعبد فهذا الخبر يؤيد ما ذهبنا إليه وهو عليهم لو اعتذروا به محتجين علينا كما فعلت أنت ولم يكن لهم هذا الخبر فلا شي‏ء أعلى من كلام النبوة ولا سيما فيما أخبرت به عن الله عز وجل فإن قالوا إن الإمكان جعلنا أن نقول ما نقول قلنا الإمكان حكم وهمى لا معقول لا في الله ولا في المسمى ممكنا فإنه لا يعقل أبدا هذا المسمى ممكنا إلا مرجحا وحالة الاختيار لا تعقل إلا ولا ترجيح وهذا غير واقع فهو غير واقع عقلا لكن تقع وهما والوهم حكم عدمي فما ثم إلا واجب بذاته أو واجب به فمشيئة الحق في الأشياء واحدة\n\n\n> والحق ليس له إلا مشيئته *** وحيدة العين لا شرك يثنيها\n\n\n> والاختيار محال فرضه فإذا *** أتى فحكمته الإمكان تدريها\n\n\n> فلا تزال على الترجيح نشأته *** والله بالحال أخفى نفسه فيها\n\n\n> فزال من علمنا الإمكان عن نظر *** في الممكنات فيبديها ويخفيها\n\n\nوإذا زال الإمكان زال الاختيار وما بقي سوى عين واحدة لأن المشيئة الإلهية ما عندها إلا أمر واحد في الأشياء ولا تزال الأشياء على حكم واحد معين من الحكمين فما الأمر كما توهمه القائل بالإمكان فثبت أنه ما ثم إلا حق لحق وحق لخلق فحق الحق ربوبيته وحق الخلق عبوديته فنحن عبيد وإن ظهرنا بنعوته وهو ربنا وإن ظهر بنعوتنا فإن النعوت عند المحققين لا أثر لها في العين المنعوتة ولهذا تزول بمقابلها إذا جاء ولا تذهب عينا بل لا يزال كونها في الحالين فالقائم عين القاعد من حيث عينه والقائم ليس القاعد من حيث حكمه فالقائم لا يمكن أن يقعد في حال قيامه والقاعد لا يمكن أن يقوم في حال قعوده وما شاء الحق إلا ما هو الأمر عليه في نفسه فمشيئة الحق في الأمور عين ما هي الأمور عليه فزال الحكم فإن المشيئة إن جعلتها خلاف عين الأمر فأما إن تتبع الأمر وهو محال وإما أن يتبعها الأمر وهو محال وبيان ذلك أن الأمر هو أمر لنفسه كان ما كان فهو لا يقبل التبديل فهو غير مشاء بمشيئة ليست عينه فالمشيئة عينه فلا تابع ولا متبوع فتحفظ من الوهم فإن له سلطانا قويا في النفس يحول بينها وبين العلم الصحيح الذي يعطيه العقل السليم ولما دخلت هذا المنزل عند ما رفعت إلى أعلامه فاستدللت عليه بأعلامه حتى وصلت إليه بعد ما قاسيت مشقة وطالت على الشقة فلما دخلته صعب على التصرف فيه لما فيه من المهالك وهو منزل مظلم لا سراج فيه فكنت أمشي فيه بحس‏\nالرجل والتثبت مخافة الوقوع في مهلك من مهالكه فإذا ثبت قدمي في موضع أحس به ولا أبصره حينئذ شرعت في نقله أطلب موضعا أنتقل إليه فإذا وقعت قدمي بفراغ علمت إن هنالك مهلكا فسرت أتتبع بقدمي يمينا وشمالا حتى أجد لقدمي موضعا يستقر فيه وأنا معتمد على القدم الأخرى وما زلت كذلك أنتقل من مكان إلى مكان في هذه الظلمة ولا أبصر شيئا لعدم النور من الخارج المقارن لنور بصري فكان رجلي بصري فعلمت من ذلك قدر ما تصرفت فيه وأنا على حذر ما أدري ما يعرض لي في طريقي من حيوان يؤذيني ولا أحس به حتى يوقع الأذى بي ومع هذا خاطرت بنفسي لأني قلت أنا في ظلمة على كل حال فسواء علي قعدت أو تصرفت فإني إذا قعدت لم آمن أن يأتيني حيوان يؤذيني وإن تصرفت لم آمن أيضا من حيوان يؤذيني أو مهلك أقع فيه فالتثبت في التصرف أرجى لي فرجحته على القعود طلبا للفائدة فبينا أنا كذلك إذ فجئني نور الشرع من خارج بصورة سراج مصباح لا تحركه الأهواء لكونه في مشكاة ومشكاته الرسول فهو محفوظ من الأهواء التي تطفيه وذلك المصباح في زجاجة قلبه وجسمه المصباح واللسان ترجمته والإمداد الإلهي زيته والشجرة حضرة إمداده فاجتمع نور البصر مع هذا النور الخارج فكشفنا ما في الطريق من المهالك والحيوانات المضرة فاجتنبنا كل ما يخاف منها ويحذر وسلكنا محجة بيضاء ما فيها مهلك ولا حيوان مضر ولو تعرض إلينا عدلنا عنه لاتساع الطريق وسهولته والموانع والحصون التي فيه المانعة ضرر تلك الحيوانات ف من لَمْ يَجْعَلِ الله لَهُ نُوراً فَما لَهُ من نُورٍ وبعد أن ظهر هذا المصباح لم ينطف ولا زال فمن استدبره وأعرض عنه مشى في ظلمة ذاته وتلك الظلمة ظلمته فيكون ممن جنى على نفسه بإعراضه عن المصباح واستدباره فهذا حكم من ترك الشرع واستقل بنظره فهو وإن ثبت في سعيه لظلمة ذاته على خطر من دواب الطريق وإن لم يقع في مهلك فينبغي للعاقل أن لا يستعجل في أمر له فيه اناة ولا يتأتى في أمر يكون الحق في المبادرة إليه والإسراع في تحصيله هذا فائدة العقل في العاقل ورأيت في هذا المنزل علوما جمة منها علم الحاصل في عين الفائت لأنه لو لا ذلك ما علمت فضل الحاصل على الفائت في حقك إذا كان فيه سعادتك ولا فضل الفائت على الحاصل إذا كان الفائت مطلوبك ولو حصل لك أشقاك وأنت لا تعلم فكان الفضل فيه في حقك فوته فإن بفوته سعدت وهذا لا يكون إلا لمن أسعده الله وهو قوله تعالى وعَسى‏ أَنْ تَكْرَهُوا شَيْئاً وهُوَ خَيْرٌ لَكُمْ وعَسى‏ أَنْ تُحِبُّوا شَيْئاً وهُوَ شَرٌّ لَكُمْ والله يَعْلَمُ وأَنْتُمْ لا تَعْلَمُونَ ومنه‏\n\n\nما روى أن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قبل رسالته كان يرعى الغنم بالبادية فيريد أن يدخل إلى مكة ليصيب فيها ما يصيب الشبان فإذا دخل مكة وترك في الغنم بعض من يعرفه يحفظها حتى يأتي إليه يرسل الله عليه النوم فيفوته تحصيل ما دخل من أجله فيستعجل الرجوع إلى غنمه فيخرج وقد فاته ما دخل من أجله‏\n\n\nوكانت في ذلك عصمته وحفظه من حيث لا يشعر ويقال في المثل في هذا المعنى من العصمة أن لا تجد وفي هذا المنزل من العلوم علم أحدية الأفعال وهو أمر مختلف فيه فمن مثبت ذلك للحق تعالى ومن مثبت ذلك للخلق فهو أحدي في الطائفتين ومن مثبت في ذلك شركا خفيا وهم القائلون بالكسب وفيه علم ما لا يعلم إلا بالوهب ليس للكشف فيه مدخل جملة واحدة وهو ما لا يدرك إلا بذات المدرك اسم فاعل على حسب ما هو المدرك اسم\n\n\nفاعل عليه فإن كان ممن تنسب إليه الحواس فالحواس له ذاتية لا محالها المعين لها وإن كان ممن لا تنسب إليه الحواس فإدراكه للأمور المحسوسة كصاحب الحواس أيضا بذاته ولا يقال إنها محسوسة له لأنه لا ينسب إليه حس فهي معلومة له والحواس طريق موصلة إلى العلم والعلم بالأمر هو المطلوب لا بما حصل فقد رأيت الأكمه يدرك الفرق بين الألوان مع فقد حس البصر وجعل الله بصره في لمسه فيبصر بما به يلمس وفيه علم الإعلام بتوحيد الحق نفسه في ألوهيته بأي لسان اعلم ذلك وما السمع الذي أدرك هذا الإعلام الإلهي إذا تبعه الفهم عنه فإن لم يتبعه فهم فهل يقال فيه إنه سمع أم لا وفيه علم رتبة الإنسان الحيوان ومزاحمته الإنسان الكامل بالقوة فيما لا يكون من الإنسان الكامل إلا بالفعل وأن الإنسان الكامل يخالف الإنسان الحيوان في الحكم فإن الإنسان الحيوان يرزق رزق الحيوان وهو للكامل وزيادة فإن الكامل له رزق إلهي لا يناله الإنسان الحيوان وهو ما يتغذى به من علوم الفكر الذي لا يكون للإنسان الحيوان والكشف والذوق والفكر الصحيح وفيه علم رحمة الله بالعالم حيث أحالهم على الأسباب وما جعل لهم رزقا إلا فيها\nليجدوا العذر في إثباتها فمن أثبتها جعلا فهو صاحب عبادة ومن أثبتها عقلا فهو مشرك وإن كان مؤمنا فما كل مؤمن موحد عن بصيرة شهودية أعطاه الله إياها وفيه علم رتبة المباح من الشرائع وما حدوه به من أنه لا أجر فيه ولا وزر حد صحيح أم لا وهل فيه حصول الأجر في فعله وتركه وما ينظر إليه من أفعال الله ومما يحكم به في الله فإنه لا يماثلها إلا الاختيار المنسوب إلى الله فإن لم يثبت هنالك اختيار على حد الاختيار فلا يثبت هنا مباح على حد المباح لأنه ما هو ثم وفيه علم ما يعلمه المخلوق وأنه محدود مقيد لا ينسب إليه الإطلاق في العلم به فإن ذلك من خصائص الحق سبحانه وتعالى وفيه علم اختلاف الطبائع فيمن تركب منها وبما ذا اختلف من لا طبيعة له ولو لا حكم الاختلاف فيمن لا طبيعة له ما ظهر الاختلاف في الطبيعة كما أنه لو لا اختلاف الطبيعة ما ظهر خلاف فيما تألف منها وهو علم عجيب في المفرد العين والمفرد الحكم فبالقوابل ظهر الخلاف بالفعل وهو في المفرد بالقوة وفيه علم حكمة توقف العالم بعضه على بعض فيما يستفاد منه مع التمكن من ذلك دونه وفيه علم رتبة من كثرت علومه ممن قلت علومه ومن قلت علومه عن كثرة أو من قلت لا عن كثرة وإن كان الشرف عند بعضهم في قلة العلم فلما ذا أمر الله عز وجل رسوله صَلَّى اللهُ عَليهِ وسَلَّم أن يطلب الزيادة من العلم والزيادة كثرة ومن كان علمه من المعلومات وإن كثرت أحدية كل معلوم التي هي عين الدلالة على أحدية الحق فهو صاحب علم واحد ولا أقل من الواحد في معلومات كثيرة مجمل كل معلوم أحدية هي معلومة للعالم بالله وحده وما نبه على هذه المسألة إلا ابن السيد البطليوسي فإنه قال فيما وقفنا عليه من كلامه إن الإنسان كلما علا قدره في العالم قلت علومه وكلما نزل عن هذه المرتبة لشريفة اتسعت علومه وأعني العلم بالأفعال وأعني بالقلة العلم بالذات من طريق الشهود وكان رأيه في علم التوحيد رأى الفيثاغوريين وهم القوم الذين أثبتوا التوحيد بالعدد وجعلوه دليلا على أحدية الحق وعلى ذلك جماعة من العقلاء وفيه علم العلم الثابت الذي لا يقبل الزوال في الدنيا ولا الآخرة وفيه علم نصب الأدلة لمن لا يعرف الأمر إلا بالنظر الفكري وفيه علم ما لا يمكن أن ينسب إلا إلى الله فإن نسب إلى غير الله دل عند من يعرف ذلك العلم على جهل من ينسبه إلى غير الله بالله وفيه علم كون الموجودات كلها نعما إلهية أنعم الله بها وعلم من هو الذي أنعم الله بها عليه وهل هو هذا المنعم عليه من جملة النعم فيكون عين النعمة عين المنعم اسم مفعول فاعلم ذلك‏\n\n\n### [علم الموت في الحياة والحياة في الموت‏]\n\n\nوفيه علم الموت في الحياة والحياة في الموت ومن هو الحي الذي لا يموت والميت الذي لا يحيا ومن يموت ويحيا ومن لا يموت ولا يحيا وفيه علم سبب وجود الإنكار في العالم ولما ذا يستند من الحضرة الإلهية وهل قوله لعبده عند ما ينسب إليه ما ظهر عليه من الأمور التي نهى أن يعملها وما أصابك من سيئة فمن نفسك إنكار إلهي عن نسبة ذلك الفعل إلى الله ولما ذا سمي منكرا وهو معروف وقوله الذين يَأْمُرُونَ بِالْمَعْرُوفِ وهو الأمر بما هو معلوم له ويَنْهَوْنَ عَنِ الْمُنْكَرِ وهو أن يأمر بما ليس معلوما عنده من النكرة التي لا تتعرف ولما كان المنكر فعل ما أمر بتركه أو ترك ما أمر بفعله ولا يوصف بأنه أتى منكرا حتى يعلم أنه مأمور به ذلك العمل أو منهي عنه فصح له اسم المنكر لما يحصل للعبد من الحيرة في ذلك وعدم تخلصه إلى أحد الجانبين فإن نسبه إلى الحق في بعض الأمور عارضة الأدب أو الدليل الحسي والعقلي والسمعي فيسلب عن ذلك العمل نعت المعرفة ويلحقه بالنكرة ولما اختص المنكر بالمذموم من الأفعال لا بالمحمود وفيه علم ذم الله المتكبر والكبرياء صفته وقد علم الله عز وجل أنه لا يدخل قلب إنسان الكبر على الله ولكن يدخله الكبر على خلق الله وهو الذي يزال منه وحينئذ يدخل الجنة فإنه لا يدخل الجنة من في قلبه مثقال حبة من كبر على غير الله حتى يزال وأما على الله فمحال فإن الله قد طبع على القلوب التواضع له وإن ظهر من بعض الأشخاص صورة الكبرياء على أمر الله وهو الذي جاءت به الوسائط وهم الرسل عليه السلام من الله لا على الله فإنه يستحيل الكبرياء من المخلوق عليه لأن الافتقار له ذاتي ولا يمكن للإنسان أن يجهل ذاته وفيه علم الحيل والكفالة وانتقال الحق إلى الكفيل من الذي عليه الحق وبراءة من انتقل الحق عنه منه وفيه علم السبب الذي أوجب للإنسان أن يؤخذ من مأمنه وفيه علم التسليم والتفويض وفيه علم اختلاف أحوال الخلق عند الموت ما سبب ذلك ولما ذا لم يقبضوا على الفطرة كما ولدوا عليها وما الذي أخرجهم عن الفطرة أو أخرج بعضهم وما هي الفطرة وهل يصح‏\nالخروج عنها أو لا يصح ورحمة الله تعالى بخلقه في أخذ العهد على الناس لما أخذهم الله من ظهور آبائهم وأشهدهم على أنفسهم بربوبيته عليهم فقالوا بلى أنت ربنا ولم يشهدهم بتوحيده إبقاء عليهم لعلمه أن فيهم من يشرك به إذا خرج إلى الدنيا وتبريه من الشريك في العقبي يوم العرض الأكبر وفيه علم المحاجة يوم القيامة والفرق بين الحجة الداحضة والحجة البالغة وما هو الموطن الذي يقال فيه للإنسان لا يُسْئَلُ عَمَّا يَفْعَلُ وهُمْ يُسْئَلُونَ وفيه علم ما يجب على المبلغين عن الله تعالى من رسول ووارث وفيه علم ما يؤتى عن أمر الله وما يجتنب وأحكامهم في ذلك عن بينة وعن غير بينة وفيه علم ما لا يمكن التبدل فيه عقلا مع إمكان ذلك عقلا وكيف يدخل النسخ في أدلة العقول كما يدخل في أحكام الشرائع وفيه علم التحكم على الله هل يسوغ ذلك لأحد من أهل الله من غير أمر الله أو لا يسوغ وفيه علم كيف يوجد الله من يوجده من العالم وفيه علم هل عين الاعتماد على الله في دفع المكروه والضراء عين الاعتماد عليه في إبقاء النعم على المنعم عليه اسم مفعول وعلى أي اسم إلهي يكون كل اعتماد من هذين الاعتمادين وفيه علم صفة الشخص الذي ينبغي أن يسأل في العلم الذي يعطي السعادة للعامل به وفيه علم السبب الذي يوجب الخوف عند من أعطاه الله الأمان في الدار الدنيا وارتفاع ذلك عنه في الدار الآخرة واختلاف وجوه الأخذ الإلهي مع الأمان وفيه علم تنقل الصور الموجودة عن الأشخاص تطلب وجه الله في تنقلها وهي كالظلال مع الأشخاص الظاهرة عنه عند استقبال النور واستدباره أو يكون عن يمينه ذلك النور أو شماله وفيه علم نفى أن يتخذ الحق إلها في المجموع وهل يتخذ بغير المجموع أو لا يصح أن يكون متخذا فإنه إله لعينه لا بالاتخاذ فاعلم ذلك وفيه علم ما لله من الدين وما للعبد منه أَلا لِلَّهِ الدِّينُ الْخالِصُ والدين الذي تدخله المشقة هل هو لله فإنه يقول وما جَعَلَ عَلَيْكُمْ في الدِّينِ من حَرَجٍ وقال يُرِيدُ الله بِكُمُ الْيُسْرَ ولا يُرِيدُ بِكُمُ الْعُسْرَ وقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم دين الله يسر\n\n\nوقال بعثت بالحنيفية السمحة\n\n\nكما قال أيضا ولَهُ الدِّينُ واصِباً وقال من يشاد هذا الدين يغلبه‏\n\n\nوقال لا يُكَلِّفُ الله نَفْساً إِلَّا وُسْعَها فإنه ما كلفها إلا ما آتاها من القوة عليه وفيه علم رد النعم إلى الله ولما ذا يغلب على الإنسان شهود الضراء حتى تحول بينه وبين ما فيها من طعم النعم حتى يضجر من البلاء وهذا كان مقام عمر بن الخطاب رضي الله عنه يشاهد نعم البلاء في البلاء فيجمع بين الصبر والشكر في الآن الواحد وكان صاحب عملين وفيه علم الاستدراج بالنعم وفيه علم حكم من عامل الحق بجهله وهو يظن في نفسه أنه على علم في ذلك وفيه علم التعرية وفيه علم صفة المفتي والفتيا ومتى يفتي المفتي هل بعد الاستفتاء أو يفتي وإن لم يستفت وهل يفتقر المفتي إلى إذن الإمام له في ذلك أم لا وفيه علم استخراج العلوم من النظر في الموجودات وتفاصيله وفيه علم أنواع الوحي وضروبه وما يختص بالأولياء الاتباع من ذلك وما لا يشارك فيه النبي من الوحي وفيه علم الإحاطة بوجوه كل معلوم من هو ذلك العالم بها وما صفته وفيه علم تفاضل الصفات لما ذا يرجع وفيه علم الأرزاق الروحانية وما هو الرزق الذي في تناوله حياة القلوب من أرزق الذي فيه موت القلوب فإنه قد يكون الموت من الجوع وقد يكون من الشبع والامتلاء وما هو الرزق الذي يشبع منه والرزق الذي لا يشبع منه والرزق الذي يتساوى فيه جميع العالم والرزق الذي يخص بعض العالم دون بعض وفيه علم لعلم بالرازق وأنه أحق بالعبادة لافتقار المرزوق إلى الرزق وفيه علم التحرك والسكون ومن أحق بالمقام هل المتحرك أو الساكن وحكاية المتحرك والساكن لما تحاكما في ذلك إلى العالم بذلك ذوقا وما جرى لهما وإن صاحب الرزق من يأكله لا من يجمعه وأخبر تعالى عن لقمان الحكيم فيما أوصى به لابنه يا بُنَيَّ إِنَّها إِنْ تَكُ مِثْقالَ حَبَّةٍ من خَرْدَلٍ فَتَكُنْ في صَخْرَةٍ أَوْ في السَّماواتِ أَوْ في الْأَرْضِ يَأْتِ بِهَا الله ولم يقل يأت إليها وفيه علم العدل وأداء الحقوق وفيه علم النسيان بعد العلم بحيث لا يدري أنه علم ما قد نسيه أصلا وفيه علم الاسم الإلهي الواقي واختلاف صوره في العالم مثل اختلاف الاسم الرزاق وفيه علم اختلاف الحال على المشاهد في حال رؤيته وفيه علم من يدعو الناس إلى ما هو عليه حتى يكون داعي حق وفيه علم الأوامر الإلهية وفيه علم المحسن والإحسان وفيه علم الأنساب و\n\n\nقول النبي صَلَّى اللهُ عَليهِ وسَلَّم إن ربكم واحد وإن أباكم واحد فلا فضل لعربي على أعجمي ولا لأعجمي على عربي إلا بالتقوى فإن الله يقول اليوم أرفع نسبكم وأضع نسبي أين المتقون‏\n\n\nوقال تعالى إِنَّ أَكْرَمَكُمْ عِنْدَ الله أَتْقاكُمْ فهل هو المتقي من يكون وقاية لله أو من يتخذ الله وقاية ولهذا\nرجال ولهذا رجال وفيه علم الإيلاء وأقسامه وأحكامه في المولى وصورة الإيلاء وما يكون لله من ذلك وما يكون للعبد وفيه علم كون العالم العامل في دنياه في جنة معجلة في نفسه وإن كان ردى‏ء الحال فنعيمه في نفسه أعظم النعيم وفيه علم المداخلة في القرآن مع كونه محفوظا من عند الله فلا يصح في القرآن تحريف ولا تبديل كما وقع في غيره من الكتب المنزلة وفيه علم النسخ ما هو وفيه علم حكم من يخالف ظاهره باطنه عن شهود وفيه علم دفع الإنسان عن نفسه إعظاما لها لما رأى من تعظيم الله حقها في تحريم الجنة على من قتل نفسه وإن كان قاتل نفسه لا يدخل جهنم إلا بنفسه الحيوانية لأن جهنم ليست موطنا للنفس الناطقة ولو أشرفت عليها طفئ لهيبها بلا شك لأن نورها أعظم فإن الذي قتل نفسه عظم جرمه لحق الجوار الأقرب وحال بذلك بينها وبين ملكها وما سوى نفسه فبعيد عن هذا القرب الخاص الذي لنفسه وفيه علم ما حلل وحرم هل حرم أو حلل لنفسه أو لأمور مخصوصة وأحوال في المحرم والمحرم عليه ولا محلل ولا محرم إلا الله بلسان الشرع لسان الرسول صَلَّى اللهُ عَليهِ وسَلَّم أو المجتهد من علماء الرسوم كالفقهاء وفيه علم تغير الإقبال الإلهي لتغير الأحوال وفيه علم إقامة العظيم مقام الجماعة وفيه علم السياسات في المخاطبات من العلماء والعارفين الدعاة إلى الله وفيه علم الجزاء بالمماثل في أي نوع كان وفيما يحمد من ذلك كله وفيما يذم وفيه علم المعية الإلهية والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Sixty-Eight: Concerning the Knowledge of the Station of Acts (منزل الأفعال), such as \"He came\" and \"He did not come,\" and the Divine Presence of the Command (حضرة الأمر) Alone.\n\nIf a non-human species is like me in articulation,\nThen where is my distinction in speaking about the bees?\n\nI am a speaker (نَاطِق), and the bird is a speaker like me,\nAs came in the Qur’an in the Surah of the Ants (Surat al-Naml).\n\nSo do not rejoice except in that by which you are unique,\nFor the existence of a form finds familiarity with its like.\n\nI had a revered and sanctified Shaykh,\nWho spoke of the preference of matters and of connection (الوصل).\n\n### [The Future Command is Mentioned in the Qur’an in the Past Tense Due to the Certainty of its Occurrence]\n\nAllah the Exalted said: <<And [mention] when Allah will say, \"O Jesus, Son of Mary, did you say to the people, 'Take me and my mother as two deities besides Allah?'\">> (Q. 5:116). This statement will only occur on the Day of Resurrection, so it has not yet happened. Yet, it is expressed in the past tense concerning the future due to the certainty (تحقق) of its inevitable occurrence, and the removal of the ruling of possibility (الإمكان) within it to the ruling of necessity (الوجوب). Everything that is of this nature, the ruling of the past and the future are equal concerning it. Its expression in the past tense is more emphatic regarding its occurrence and certainty than leaving it in the future tense.\n\nKnow, O friend (ولي)—may Allah grant you happiness through the Real (الحق) and make you speak it—that a group of the People of Allah (أهل الله) erred concerning a matter that came from Allah the Exalted. We supported them in their error, yet we did not support them; rather, we allowed their statements to pass because of their affiliation with Allah, so that none but the people of truth and sincerity (أهل حق وصدق) affiliate themselves with Him, the Glorified.\n\nThe matter concerning which they erred is the knowledge of the Real (الحق) by which creation occurs. They made this \"by which creation occurs\" an existing entity (عينا موجودة) when they heard Allah say that <<He created the heavens and the earth with the Truth (بِالْحَقِّ)>> (Q. 46:3) and similar verses found in the Qur’an. The letter *bā’* (ب) here is in the meaning of the letter *lām* (ل) [meaning 'for the sake of']. This is why the Exalted said at the end of the verse: <<Exalted is Allah above what they associate [with Him]>> (Q. 46:5) because of this *bā’*.\n\nThe matter itself, concerning the heavens and the earth and what He sent down between them, so that it encompasses all Existence (الوجود), is like His saying: <<And I did not create the jinn and mankind except to worship Me>> (Q. 51:56). Likewise, He did not create the heavens and the earth except *bi-l-Haqq* (with the Real), meaning *li-l-Haqq* (for the Real). Thus, the *lām* that substitutes for the *bā’* here is the very *lām* in His saying *li-ya‘budūn* (to worship Me). So, He created the heavens and the earth for the Real, and the Real is that they should worship Him. This is why He said: <<Exalted is Allah above what they associate [with Him]>>.\n\nAssociation (الشرك) is the tremendous injustice (الظلم العظيم). No existing thing appeared except from this human species. The jinn were only mentioned alongside mankind in creation for worship because the human species misled them into association, not that the jinn themselves committed association. It is mankind (الإنس) who committed association. This is if the jinn are not an expression of the inner aspect of man. It is as if He is saying: \"I did not create the jinn\"—which is what is hidden and internal in man—\"and mankind (الإنس)\"—which is what is visible due to its manifestation—\"except to worship Me, outwardly and inwardly.\"\n\nThen He said: <<Does man not consider that We created him from a sperm-drop? Then suddenly he is a clear contender (خَصِيمٌ مُبِينٌ)>> (Q. 36:77)—meaning, clear in his contention and manifest in it. And He said: <<He created man from a sperm-drop; then suddenly he is a clear contender>> (Q. 16:4). This is due to his claim to Lordship (الربوبية). Allah only created him as a servant (عبدا), so he should not exceed his measure, yet he disputes his Lord concerning His Lordship. No creature disputes Him except this one.\n\nHis contention is described as \"clear\" (مبين), unlike those from the Highest Assembly (الملإ الأعلى) and others who are described as merely contentious, or those who contend regarding claims other than Lordship. For there is no dispute that arises from a creature concerning a matter other than the claim to Lordship except that it is possible that the truth (الحق) is on his side, and this may be hidden from the listener and the judge, who cannot know whether the truth is with him or his opponent, or whether he is truthful or lying in his claim, due to the possibility (الاحتمال) involved. Except for his claim to Lordship: he knows within himself, and every listener among Allah’s creation knows, that he is lying in his claim and that he is a servant, and that is why Allah created him. Therefore, it is said of him that he is a clear contender (خصيم مبين), meaning manifest in the injustice (الظلم) of his contention.\n\nWhat then is the state of one who disputes his Lord concerning His Lordship? Furthermore, this human being, would that he only sought this for himself, for he knows within himself that he has no share in Lordship. Yet, he then attributes Lordship to a creature of Allah’s creation, whether stone, plant, animal, a human like himself, jinn, angel, or star. There remains no category of creatures that has not been worshipped by him, and none worshipped it except the animalistic human (الإنسان الحيوان). The most wretched of people is he who sells his Hereafter for the worldly life of another, and he who perishes in pursuit of something from which he gains nothing. He testifies against himself that he is the most ignorant of people concerning others and the most knowledgeable of people concerning himself, because he did not claim it for himself. As for one who did claim it for himself, he merely <<made his people light [in mind], and they obeyed him>> (Q. 43:54) for that reason, while he knew the opposite within himself. That is why he said: <<I do not know of any deity for you other than me>> (Q. 28:38)—meaning, in your belief.\n\n### [That the Real (الحق) the Exalted does not create a thing *by* a thing, but rather creates a thing *at* a thing]\n\nKnow that the Real (الحق) the Exalted does not create a thing *by* a thing, but rather creates a thing *at* a thing. Everything that implies seeking assistance or causality (السببية) is the *lām* of wisdom (لام الحكمة). Allah created nothing except for the Real (للحق), and the Real is that they should worship Him. <<Then suddenly he is a clear contender>> (Q. 36:77). This is only due to the blindness of the hearts which are in the breasts (الصدور) concerning the Real. If they were not turning away from the Real but turning towards it, they would have perceived the Real and acknowledged Lordship (الربوبية) for Him in everything, and would not have associated anyone (أحداً) with the worship of their Lord.\n\nTherefore, He said: <<So whoever hopes for the meeting with his Lord, let him work righteous work (عَمَلًا صالِحاً)>> (Q. 18:110). The righteous work is that which no defect (خلل) enters. If a defect appears in it, it is not righteous. The only defect in the work and the lack of righteousness in it is association (الشرك). So He said: <<and not associate anyone (أَحَداً) with the worship of his Lord>> (Q. 18:110). He used the indefinite form, thereby encompassing everyone to whom the name \"anyone\" applies, which is everything in the world of Creation (الخلق) and Command (الأمر).\n\nIt encompasses the minor association (الشرك الأصغر), which is the association found generally, namely the veiled Lordship (الربوبية المستورة) violated in phrases like \"I did,\" \"I made,\" \"So-and-so did,\" or \"If it were not for so-and-so.\" This is the forgiven association, for if you refer the proponents of this statement back to it, they return to Allah the Exalted. As for the specific association (الشرك الذي في الخصوص), these are those <<who make with Allah another deity (إِلهاً آخَرَ)>> (Q. 51:51). This is the tremendous injustice (الظلم العظيم) by which they wronged the one they claimed was a deity alongside Allah. They wronged Allah in the Oneness (وحدانية) of His Divinity (الألوهية), and they wronged the partner by attributing Divinity to him. Allah will seize them for the injustice done to the partner, not for the injustice done to His Oneness (أحديته). For the one they made a partner will disown them on the Day of Resurrection, when rights (الحقوق) are made manifest to their rightful owners.\n\nTherefore, in reality, Allah does not create a thing *by* a thing, and if He creates it *for* a thing, that is the *lām* of wisdom (لام الحكمة), and the essence of His creation is the essence of wisdom, since His creation, the Exalted, is not caused (لا يعلل). Creation (الخلق) is a servant by Essence (بالذات), upon which accidents (العوارض) have had an effect, especially the human individual (الشخص الإنساني). Indeed, accidents have only affected the human individual alone, apart from the rest of creation. Everything else remains upon its original state of declaring the transcendence (تنزيه) of its Creator from any partner. That is why He said: <<There is not a thing except that it exalts [Him] with praise (يُسَبِّحُ بِحَمْدِهِ), but you do not understand their glorification>> (Q. 17:44). This plural pronoun in \"you do not understand\" refers specifically to mankind. Thus, all creatures worship Allah except some people. Man is the most contentious (أَلَدُّ الْخِصامِ) where he disputes concerning that in which the injustice is manifest, and that is nothing but Lordship (الربوبية). Have you ever seen a servant dispute his Lord unless he has departed from his servitude (عبوديته) and contended with his Master concerning His Lordship, claiming ownership for himself? If his Master then acts upon it, the servant disputes and contends with Him. No contention has ever occurred from a servant regarding servitude; rather, it occurs regarding that in which the Master is Lord and Owner.\n\nMany of the People of Allah (أهل الله) among the scholars—whom I will not mention or name, for this attribution to them explicitly states their ignorance, and thus I maintain courtesy towards them—established the \"by which creation occurs\" (المخلوق به) in two ways. Some of them made this Real (الحق) by which creation occurs the very cause (*illah*) of creation. However, the Real (الحق) the Exalted does not cause His creation; this is the sound position in itself, so that no matter can be conceived that necessitates upon Him what has manifested of His creation. Rather, He created creation as a favor (منة) upon creation and an initiation of grace, for He is the Independent (الغني) of the worlds. Others made this Real (الحق) by which creation occurs an existing entity (عينا موجودة) by which Allah created everything else. These are the proponents of the idea that nothing proceeds from the One except one, and that the emanation (صدور) of that one was the emanation of an effect (*ma‘lūl*) from a cause (*illah*) that necessitated its emanation. This position has its own issues. What I maintain is:\n\nWhen the Command (أمر) of Allah comes, the Commander is the Command,\nAnd that is a declaration of Unity (توحيد) to Him to Whom the Command belongs.\n\nSo do not associate partners, for association is a proven injustice,\nAnd this injustice has encompassed the stone.\n\nSince Knowledge (العلم) gives life to hearts, just as spirits (الأرواح) give life to the essences (أعيان) of all bodies, Knowledge is called a Spirit (روح). The angels descend with it upon the hearts of Allah’s servants, and He casts it (يلقيه) and reveals it (يوحى به) without intermediary to His servants as well. As for His casting and revealing it, that is His saying: <<He casts the Spirit (الرُّوح) by His Command (أَمْرِهِ) upon whomever He wills of His servants>> (Q. 40:15), and His saying: <<And thus We have revealed to you a Spirit (رُوحاً) from Our Command>> (Q. 42:52). As for the descent of the angels with it upon the hearts of His servants, that is the saying of the Exalted: <<He sends down the angels with the Spirit (الرُّوح) by His Command (أَمْرِهِ) upon whomever He wills of His servants>> (Q. 16:2). They are the teachers and masters in the Unseen (الغيب); the one upon whom they descend witnesses them. When this Spirit descends into the heart of the servant, either through the descent of the angel or through Allah’s casting and revelation, the heart of the recipient is brought to life by it. He then becomes a person of Witnessing (شهود) and Existence (وجود), not a person of reflection (فكر) and hesitation, nor of knowledge that accepts doubt, causing its possessor to move from the degree of certainty (القطع) to the state of speculation (النظر). The chosen, knowing servant either ascends and sees, or the revelation descends upon him in his place.\n\nIndeed, the ascent for the vision of the Signs (الآيات)\nIs the description of the Realized One (المحقق) in the Witnessing of the Essence (الذات).\n\nLook through the act of the Present State (الحال), you will witness its being,\nAnd look to the Past, it will show you the Coming (الآتي).\n\nIndeed, Existence (الوجود) proves itself\nBy its presence in most states.\n\nThe Present State (الحال) is witnessed perpetually among the living,\nWhile the Past and the Coming are with the dead.\n\nIf the apologist for these people says, \"What is the benefit of creating the Perfect Human (الإنسان الكامل) upon the Form?\" We reply: So that the issuance of all acts (الأفعال) and creatures may manifest through him, while his essence (عينه) remains, in his view, a servant. For the ultimate goal of the Divine Command is that the Real (الحق) should be with the servant, and his sight, indeed, all his powers. The Exalted said [in the Hadith Qudsi]: \"If I love him, I am his hearing, his sight, and his hand...\" (The Hadith). By the pronoun, He affirmed his essence (عينه) as a servant who has no Lordship (ربوبية), and He made what manifests through him, upon him, and from him, to be the Real (الحق) the Exalted, not belonging to the servant. This report supports what we have concluded, and it would be used against them if they used it as an excuse to argue against us, as you have done. There is nothing higher than the speech of Prophethood, especially concerning what it reports about Allah, the Mighty and Majestic.\n\nIf they say that possibility (الإمكان) caused us to say what we say, we reply: Possibility is an illusory ruling (حكم وهمى), not intelligible, neither concerning Allah nor concerning that which is called possible (ممكنا). For this thing called possible is never conceived except as having a preponderant factor (مرجح). The state of choice (الاختيار) is not conceived except with a preponderant factor, and this is not actualized. Thus, it is not actualized rationally, but it occurs as an illusion (وهما), and illusion (الوهم) is a non-existent ruling. Therefore, there is nothing there except that which is Necessary by its Essence (واجب بذاته) or Necessary by Him (واجب به). The Will (مشيئة) of the Real (الحق) concerning things is one.\n\nThe Real has nothing but His Will (مشيئته),\nSingular in essence (وحيدة العين), no association (شرك) can double it.\n\nChoice (الاختيار) is impossible to impose, so if\nIt comes, its ruling is possibility (الإمكان), you know it.\n\nIts origination (نشأته) never ceases to be based on preponderance,\nAnd Allah has hidden Himself within it by means of the State (الحال).\n\nThus, possibility (الإمكان) vanished from our knowledge through contemplation\nOf the possibles (الممكنات), which He manifests and conceals.\n\nWhen possibility (الإمكان) vanishes, choice (الاختيار) vanishes, and nothing remains except a single Essence (عين واحدة), because the Divine Will (المشيئة الإلهية) has only one Command concerning things. Things never cease to be upon one specific ruling out of the two rulings. Thus, the matter is not as the proponent of possibility imagines. It is established that there is nothing there except a right belonging to the Real (حق لحق) and a right belonging to creation (حق لخلق). The right of the Real is His Lordship (ربوبيته), and the right of creation is its servitude (عبوديته). We are servants, even if we manifest by His descriptions (نعوته), and He is our Lord, even if He manifests by our descriptions (نعوتنا). For descriptions (النعوت), according to the Realized Ones (المحققين), have no effect on the described Essence (العين المنعوتة). Therefore, they vanish when their opposite comes, but the Essence does not depart; rather, its being remains in both states. The standing person is the essence (عين) of the sitting person in terms of his entity, but the standing person is not the sitting person in terms of his ruling. The standing person cannot sit while he is standing, and the sitting person cannot stand while he is sitting. The Real (الحق) wills nothing except what the Command (الأمر) is upon in itself. The Will of the Real concerning matters is the very essence of what those matters are upon. Thus, the ruling vanishes, for if you make the Will contrary to the essence of the Command, then either the Will follows the Command—which is impossible—or the Command follows the Will—which is also impossible. The clarification of this is that the Command (الأمر) is a command for itself, whatever it may be. It does not accept alteration. Therefore, it is not willed by a Will that is not its essence (عينه). Thus, the Will is its essence, so there is neither follower nor followed. Guard yourself against illusion (الوهم), for it has a powerful dominion over the soul (النفس) that intervenes between it and the sound knowledge (العلم الصحيح) granted by the healthy intellect (العقل السليم).\n\nWhen I entered this Station (منزل), having been raised to its signs, I used its signs to guide myself until I reached it, after enduring hardship and a long journey. When I entered it, it was difficult for me to move about within it due to the perils it contained. It was a dark station with no lamp. I walked through it by the sense of my foot and with caution, fearing falling into one of its dangers. When my foot settled in a place I could feel but not see, I began to move it, seeking a place to step. If my foot landed on emptiness, I knew there was a peril there, so I proceeded to trace with my foot, right and left, until I found a place for my foot to settle, while relying on the other foot. I continued moving from place to place in this darkness, seeing nothing due to the absence of external light accompanying the light of my sight. Thus, my foot was my sight.\n\nFrom this, I learned the extent of my movement, yet I was cautious, not knowing what harmful creature might cross my path, and I would not sense it until it inflicted harm upon me. Despite this, I risked myself, for I said: \"I am in darkness in any case. It is the same whether I sit still or move about. If I sit still, I am not safe from a harmful creature approaching me, and if I move about, I am also not safe from a harmful creature or a pitfall I might fall into. Caution in movement is more hopeful for me.\" So I preferred movement over sitting, seeking benefit.\n\nWhile I was in that state, the Light of the Law (نور الشرع) suddenly came to me from outside, in the form of a lamp—a light that is not moved by whims (الأهواء) because it is in a niche (مشكاة). Its niche is the Messenger, so it is protected from the whims that extinguish it. That lamp is in the glass of his heart, and his body is the lamp, and his tongue is its interpreter, and the Divine Sustenance (الإمداد الإلهي) is its oil, and the Tree is the Presence of its Sustenance (حضرة إمداده). The light of my sight combined with this external light, and we uncovered the perils and harmful creatures on the path. We avoided everything feared and guarded against, and we traversed a clear, white path (محجة بيضاء) that contained neither peril nor harmful creature. Even if one approached us, we would turn away from it due to the spaciousness and ease of the path, and the barriers and fortifications within it that prevent the harm of those creatures. <<And he for whom Allah has not made light, for him there is no light>> (Q. 24:40). After this lamp appeared, it neither went out nor vanished. Whoever turns his back on it and turns away walks in the darkness of his own essence (ظلمة ذاته), and that darkness is his injustice. Thus, he is among those who wronged themselves by turning away from the lamp and turning their backs on it. This is the ruling concerning one who abandons the Law (الشرع) and relies solely on his own speculation (نظره); even if he is firm in his striving, due to the darkness of his essence, he is in danger from the beasts of the path, even if he does not fall into a pitfall. The intelligent person (العاقل) should therefore not rush in a matter that requires deliberation, nor should he delay in a matter where the truth lies in hastening and quickly attaining it. This is the benefit of the intellect (العقل) in the intelligent person.\n\nIn this Station (منزل), I saw abundant knowledges (علوم). Among them is the knowledge of what is attained (الحاصل) within the essence (عين) of what is missed (الفائت). Were it not for this, you would not know the superiority of what is attained over what is missed, if the former contains your happiness; nor the superiority of what is missed over what is attained, if the missed thing was your desire, but its attainment would have made you wretched without your knowing it. Thus, the superiority lay, for your sake, in missing it, for by missing it you became happy. This is His saying, the Exalted: <<But perhaps you hate a thing and it is good for you; and perhaps you love a thing and it is bad for you. And Allah knows, while you know not>> (Q. 2:216).\n\nAmong them is what is narrated: that the Messenger of Allah, peace and blessings be upon him, before his prophethood, used to herd sheep in the desert. He would wish to enter Mecca to obtain what young men obtain there. When he entered Mecca, leaving someone he knew to guard the sheep until he returned, Allah would send sleep upon him, causing him to miss the attainment of what he entered for. He would then hasten back to his sheep, leaving having missed what he entered for. In this lay his protection (عصمته) and preservation, without his realizing it. It is said in the proverb concerning this meaning of protection: \"That you do not find.\"\n\nIt contains the knowledge of the Oneness of Acts (أحدية الأفعال), which is a disputed matter. Some affirm it for the Real (الحق) the Exalted, and some affirm it for creation (الخلق); thus, it is one (أحدي) in both groups. Others affirm a subtle association (شركا خفيا) in it, and these are the proponents of acquisition (الكسب).\n\nIt contains the knowledge of what is known only through Divine Gift (الوهب), in which Unveiling (الكشف) has absolutely no entry. This is what is perceived only by the essence (ذات) of the perceiver, according to what the perceived is upon. If the perceiver is one to whom the senses (الحواس) are attributed, then the senses are intrinsic (ذاتية) to him, not merely their designated locations. If the perceiver is one to whom the senses are not attributed, his perception of sensible matters is also by his essence, like the possessor of senses. It is not said that they are \"sensed\" by him because no sense is attributed to him; rather, they are known to him. The senses are a path leading to knowledge (العلم), and knowledge of the matter is the goal, not that by which it was attained. Indeed, I have seen the blind person perceive the difference between colors despite lacking the sense of sight, for Allah placed his sight in his touch, so he sees by what he touches.\n\nIt contains the knowledge of the declaration of the Real’s (الحق) Unity (توحيد) in His Divinity (ألوهيته) by any tongue that knows it, and what is the hearing (السمع) that perceives this Divine declaration if it is followed by understanding? If it is not followed by understanding, is it still said that he heard or not?\n\nIt contains the knowledge of the rank of the Animalistic Human (الإنسان الحيوان) and his contention with the Perfect Human (الإنسان الكامل) potentially (بالقوة) in matters that only proceed from the Perfect Human actually (بالفعل). And that the Perfect Human differs from the Animalistic Human in ruling. For the Animalistic Human is provided with the provision (رزق) of the animal, which the Perfect Human also receives, plus an increase. The Perfect Human has a Divine provision (رزق إلهي) that the Animalistic Human does not attain, which is what he is nourished by: the knowledges of reflection (علوم الفكر) that the Animalistic Human does not possess, Unveiling (الكشف), Taste (الذوق), and sound reflection.\n\nIt contains the knowledge of Allah’s Mercy (رحمة) upon the world, where He referred them to causes (الأسباب) and made their provision only within them, so that they might find an excuse for affirming them. Whoever affirms them by making (جعلا) is a person of worship (عبادة), but whoever affirms them rationally (عقلا) is an associator (مشرك), even if he is a believer. For not every believer is a monotheist (موحد) based on a witnessing insight (بصيرة شهودية) granted to him by Allah.\n\nIt contains the knowledge of the rank of the Permissible (المباح) in the Divine Laws (الشرائع), and whether the definition they set for it—that there is neither reward nor sin in it—is a correct definition or not. And whether there is reward in performing it or abandoning it, and what is contemplated concerning the Acts of Allah (أفعال الله) and what is ruled concerning Allah. For nothing parallels them except the Choice (الاختيار) attributed to Allah. If there is no established choice there, in the manner of choice, then there is no established permissible here, in the manner of the permissible, because it is not there.\n\nIt contains the knowledge of what the creature knows, and that it is limited and restricted; absolute knowledge (الإطلاق في العلم) is not attributed to him, for that is among the exclusive characteristics of the Real (الحق), the Glorified and Exalted.\n\nIt contains the knowledge of the difference in natures (الطبائع) among those composed of them, and by what means those who have no nature differ. Were it not for the ruling of difference in those who have no nature, difference would not have appeared in nature. Just as, were it not for the difference in nature, no difference would have appeared in what is composed of it. This is a wondrous knowledge concerning the singular Essence (المفرد العين) and the singular Ruling (المفرد الحكم). Through the receptive capacities (القوابل), difference appeared actually (بالفعل), while it exists potentially (بالقوة) in the singular.\n\nIt contains the knowledge of the wisdom behind the world’s dependence of one part upon another regarding what is benefited from it, despite the possibility of achieving that without such dependence.\n\nIt contains the knowledge of the rank of one whose knowledges are many compared to one whose knowledges are few, and whether one’s knowledges are few due to a prior multiplicity or few not due to a prior multiplicity. If honor, according to some, lies in the paucity of knowledge, then why did Allah, the Mighty and Majestic, command His Messenger, peace and blessings be upon him, to seek increase in knowledge, and increase is multiplicity? As for one whose knowledge, even if the known things (المعلومات) are many, consists of the Oneness (أحدية) of every known thing—which is the very essence of the indication of the Oneness of the Real (أحدية الحق)—he is the possessor of a single knowledge, and no less than the single knowledge, within many known things, the summary of every known thing being a Oneness known only to the one who knows Allah. No one drew attention to this issue except Ibn al-Sayyid al-Baṭalyūsī, for he said, in what we have found of his speech, that the higher a person’s rank in the world, the fewer his knowledges become, and the lower he descends from this noble rank, the broader his knowledges become. I mean by \"knowledges\" the knowledge of Acts (الأفعال), and by \"fewness\" I mean the knowledge of the Essence (الذات) through the path of Witnessing (الشهود). His view on the science of Unity (علم التوحيد) was the view of the Pythagoreans, who are the people who established Unity through number and made it a proof for the Oneness of the Real (أحدية الحق). A group of rational people (العقلاء) hold this view.\n\nIt contains the knowledge of the established knowledge (العلم الثابت) that does not accept vanishing in this world or the Hereafter.\n\nIt contains the knowledge of establishing proofs (الأدلة) for those who only know the matter through intellectual speculation (النظر الفكري).\n\nIt contains the knowledge of what cannot be attributed except to Allah. If it is attributed to other than Allah, this indicates, to one who knows that knowledge, the ignorance of the one who attributes it to other than Allah concerning Allah.\n\nIt contains the knowledge that all existing things (الموجودات) are Divine favors (نعما إلهية) bestowed by Allah, and the knowledge of who is the one upon whom Allah bestowed them. Is this recipient of favor (المنعم عليه) one of the favors himself, such that the essence of the favor is the essence of the recipient of the favor? Know that.\n\n### [The Knowledge of Death in Life and Life in Death]\n\nIt contains the knowledge of death in life and life in death, and who is the Living One who does not die, the Dead one who does not live, the one who dies and lives, and the one who neither dies nor lives.\n\nIt contains the knowledge of the reason for the existence of denial (الإنكار) in the world, and why it is supported by the Divine Presence (الحضرة الإلهية). Is His saying to His servant, when the servant attributes to himself the matters he was forbidden to do, <<And whatever evil afflicts you is from yourself>> (Q. 4:79), a Divine denial (إنكار إلهي) of attributing that act to Allah? And why is it called a denial (منكراً) when it is known (معروف)? And His saying: <<Those who enjoin the recognized (بِالْمَعْرُوفِ)>> (Q. 3:104)—which is the command concerning what is known to Him—<<and forbid the denied (عَنِ الْمُنْكَرِ)>>—which is to command concerning what is not known to Him, derived from the indefinite (النكرة) which is not recognized. Since the denied (المنكر) is the performance of what was commanded to be abandoned, or the abandonment of what was commanded to be performed, and one is not described as having committed a denial until it is known whether that action was commanded or forbidden, the name *al-munkar* (the denied) is valid for it due to the confusion (الحيرة) that occurs to the servant regarding it and his inability to resolve himself to one of the two sides. If he attributes it to the Real (الحق) in some matters, courtesy (الأدب) or the sensory, rational, and transmitted proof (الدليل الحسي والعقلي والسمعي) opposes him, thereby stripping that action of the description of \"known\" (المعرفة) and attaching it to the \"indefinite\" (النكرة). And why the denied (المنكر) is specific to blameworthy acts, not praiseworthy ones.\n\nIt contains the knowledge of Allah’s condemnation of the arrogant (المتكبر), while Arrogance (الكبرياء) is His Attribute. Allah, the Mighty and Majestic, knows that arrogance against Allah does not enter the heart of any human, but arrogance against Allah’s creation does enter it. This is what must be removed from him, and only then will he enter Paradise. For no one who has an atom’s weight of arrogance against other than Allah in his heart will enter Paradise until it is removed. As for arrogance against Allah, that is impossible, for Allah has imprinted humility towards Him upon hearts. Even if the appearance of arrogance against the Command of Allah—which came through intermediaries, namely the Messengers, peace be upon them—manifests from some individuals, arrogance against Allah is impossible for a creature, because neediness (الافتقار) is intrinsic (ذاتي) to him, and it is impossible for man to be ignorant of his own essence.\n\nIt contains the knowledge of legal stratagems (الحيل), suretyship (الكفالة), the transfer of a right (الحق) to the guarantor (الكفيل) from the one who owes the right, and the absolution of the one from whom the right was transferred.\n\nIt contains the knowledge of the reason that necessitated man being seized from his place of safety.\n\nIt contains the knowledge of submission (التسليم) and delegation (التفويض).\n\nIt contains the knowledge of the difference in the states of creation at the time of death, what causes this, why they were not seized upon the primordial nature (الفطرة) upon which they were born, what removed them or some of them from the primordial nature, what the primordial nature is, and whether it is valid to depart from it or not.\n\nAnd the Mercy of Allah the Exalted upon His creation in taking the covenant (العهد) from people when Allah took them from the loins of their fathers and made them testify against themselves concerning His Lordship (ربوبيته) over them, so they said, \"Yes, You are our Lord.\" He did not make them testify to His Unity (توحيده), out of preservation for them, knowing that among them would be those who would associate partners with Him when they came into the world, and His disavowal of the partner in the Hereafter on the Day of the Greatest Presentation.\n\nIt contains the knowledge of argumentation (المحاجة) on the Day of Resurrection, the difference between the refuted argument (الحجة الداحضة) and the conclusive argument (الحجة البالغة), and what is the station where it is said concerning man: <<He is not questioned about what He does, but they will be questioned>> (Q. 21:23).\n\nIt contains the knowledge of what is incumbent upon those who convey from Allah the Exalted, whether a Messenger or an inheritor (وارث).\n\nIt contains the knowledge of what is performed by the Command of Allah and what is avoided, and their rulings concerning this, whether based on clear proof (بينة) or without clear proof.\n\nIt contains the knowledge of what cannot be rationally changed, despite the rational possibility of that, and how abrogation (النسخ) enters the proofs of the intellects (أدلة العقول) just as it enters the rulings of the Divine Laws (الشرائع).\n\nIt contains the knowledge of exercising authority over Allah (التحكم على الله): is this permissible for any of the People of Allah (أهل الله) without Allah’s Command, or is it not permissible?\n\nIt contains the knowledge of how Allah finds those who find Him among the world.\n\nIt contains the knowledge of whether the essence of reliance upon Allah (الاعتماد على الله) in repelling the disliked and harm (الضراء) is the same as the essence of reliance upon Him in preserving favors (النعم) upon the recipient of favor, and upon which Divine Name (اسم إلهي) each of these two forms of reliance is based.\n\nIt contains the knowledge of the description of the person who should be asked concerning the knowledge that grants happiness to the one who acts upon it.\n\nIt contains the knowledge of the reason that necessitates fear in one to whom Allah has granted security (الأمان) in the worldly abode, and the removal of that fear from him in the Hereafter, and the difference in the aspects of Divine Seizure (الأخذ الإلهي) alongside security.\n\nIt contains the knowledge of the shifting of existing forms (الصور الموجودة) away from individuals, seeking the Face of Allah (وجه الله) in their shifting. They are like shadows relative to the individuals that manifest them, whether facing the light, turning away from it, or having that light to their right or left.\n\nIt contains the knowledge of denying that the Real (الحق) is taken as a deity (إلها) in totality, and whether He is taken as a deity by something other than the totality, or whether it is not valid for Him to be taken as a deity at all, for He is a Deity by His Essence (لعينه), not by being taken (بالاتخاذ). Know that.\n\nIt contains the knowledge of what belongs to Allah of the Religion (الدين) and what belongs to the servant of it. <<Unquestionably, to Allah belongs the pure religion (الدِّينُ الْخالِصُ)>> (Q. 39:3). Is the religion into which hardship (المشقة) enters for Allah? For He says: <<and has not placed upon you in the religion any difficulty (حَرَجٍ)>> (Q. 22:78). And He said: <<Allah intends for you ease and does not intend for you hardship>> (Q. 2:185). And the Messenger of Allah, peace and blessings be upon him, said: \"The religion of Allah is ease.\" He also said: \"I was sent with the tolerant, upright religion (الحنيفية السمحة).\" As He also said: <<And to Him belongs the religion perpetually (واصِباً)>> (Q. 16:52). And [the Prophet] said: \"Whoever strives against this religion will be overcome by it.\" And He said: <<Allah does not charge a soul except [with that within] its capacity (وُسْعَها)>> (Q. 2:286), for He only charged it with what He gave it the strength for.\n\nIt contains the knowledge of returning favors (النعم) to Allah, and why the witnessing of harm (الضراء) often overcomes man, intervening between him and the taste of the favors contained within it, until he becomes distressed by the affliction (البلاء). This was the station (مقام) of Umar ibn al-Khattab, may Allah be pleased with him, who witnessed the favors of affliction within the affliction, thereby combining patience and gratitude in a single instant, being the possessor of two acts.\n\nIt contains the knowledge of gradual enticement (الاستدراج) through favors.\n\nIt contains the knowledge of the ruling concerning one who deals with the Real (الحق) through his ignorance, while believing himself to be knowledgeable in that matter.\n\nIt contains the knowledge of stripping (التعرية).\n\nIt contains the knowledge of the description of the jurist (المفتي) and the legal opinion (الفتيا), and when the jurist issues a ruling: is it after being asked for a ruling (الاستفتاء) or does he issue a ruling even if not asked? And does the jurist require the permission of the Imam for this or not?\n\nIt contains the knowledge of extracting knowledges from contemplation of existing things (الموجودات) and its details.\n\nIt contains the knowledge of the types and forms of Revelation (الوحي), what is specific to the follower-saints (الأولياء الاتباع) among them, and what the Prophet does not share in of the Revelation.\n\nIt contains the knowledge of encompassing the aspects of every known thing: who is that knower of them, and what is his description?\n\nIt contains the knowledge of the reason for the superiority of Attributes (الصفات).\n\nIt contains the knowledge of spiritual provisions (الأرزاق الروحانية), and what provision, in its consumption, brings life to hearts, compared to the provision that brings death to hearts. For death may come from hunger, and it may come from satiety and fullness. And what is the provision from which one is satisfied, and the provision from which one is never satisfied, and the provision in which the entire world is equal, and the provision that is specific to some parts of the world over others.\n\nIt contains the knowledge of the Knower of the Provider (الرازق), and that He is most deserving of worship due to the neediness of the provided (المرزوق) for provision.\n\nIt contains the knowledge of movement (التحرك) and stillness (السكون), and who is more deserving of the station (المقام): the moving one or the still one, and the story of the moving one and the still one when they referred their dispute concerning this to the one who knew it by taste (ذوقا), and what transpired between them. And that the owner of the provision is the one who consumes it, not the one who gathers it.\n\nThe Exalted reported concerning Luqman the Wise in his advice to his son: <<O my son, indeed if it should be the weight of a mustard seed and it be in a rock or [anywhere] in the heavens or in the earth, Allah will bring it forth>> (Q. 31:16). He said, \"Allah will bring *it* forth,\" and did not say, \"He will bring *to* it.\"\n\nIt contains the knowledge of justice (العدل) and the fulfillment of rights (الحقوق).\n\nIt contains the knowledge of forgetting after knowing, such that one does not even know that he once knew what he has forgotten.\n\nIt contains the knowledge of the Divine Name, the Protector (الواقي), and the difference in its forms in the world, similar to the difference in the Name, the Provider (الرزاق).\n\nIt contains the knowledge of the difference in the state (الحال) upon the witnesser (المشاهد) during his vision.\n\nIt contains the knowledge of who calls people to what he is upon, so that he may be a caller to the Real (داعي حق).\n\nIt contains the knowledge of the Divine Commands (الأوامر الإلهية).\n\nIt contains the knowledge of the Doer of Good (المحسن) and Goodness (الإحسان).\n\nIt contains the knowledge of lineages (الأنساب) and the saying of the Prophet, peace and blessings be upon him: \"Indeed, your Lord is one, and your father is one. There is no superiority for an Arab over a non-Arab, nor for a non-Arab over an Arab, except by piety (التقوى). For Allah says: 'Today I raise your lineage and lower My lineage. Where are the pious ones?'\" And the Exalted said: <<Indeed, the most noble of you in the sight of Allah is the most pious (أَتْقاكُمْ) of you>> (Q. 49:13). Is the pious one (المتقي) he who is a protection for Allah, or he who takes Allah as a protection? There are men for the former, and men for the latter.\n\nIt contains the knowledge of the oath of abstinence (الإيلاء), its divisions, its rulings concerning the one who takes the oath, the form of the oath, and what belongs to Allah of that, and what belongs to the servant.\n\nIt contains the knowledge that the knowledgeable person who acts (العالم العامل) is in an expedited paradise (جنة معجلة) in his soul in this world, and even if his outward state is poor, his inner bliss is the greatest bliss.\n\nIt contains the knowledge of interpolation (المداخلة) in the Qur’an, despite its being preserved by Allah, so that no distortion or alteration is valid in the Qur’an, unlike what occurred in other revealed Books.\n\nIt contains the knowledge of what abrogation (النسخ) is.\n\nIt contains the knowledge of the ruling concerning one whose outward (ظاهره) contradicts his inward (باطنه) based on witnessing (شهود).\n\nIt contains the knowledge of man defending his soul (النفس) out of reverence for it, due to what he saw of Allah’s magnification of its right in forbidding Paradise to one who kills himself. Although the self-killer does not enter Hellfire except with his animalistic soul (نفسه الحيوانية), because Hellfire is not the abode of the rational soul (النفس الناطقة), and if the rational soul were to overlook it, its flames would undoubtedly be extinguished because its light is greater. The crime of the self-killer is magnified due to the right of the nearest neighbor, and by doing so, he intervened between the soul and its King. Everything other than his soul is far from this specific proximity that belongs to his soul.\n\nIt contains the knowledge of what is made lawful (حلل) and unlawful (حرم): was it made unlawful or lawful for its own sake, or for specific matters and states concerning the forbidden thing and the one forbidden from it? And there is no one who makes lawful or unlawful except Allah, by the tongue of the Law (لسان الشرع)—the tongue of the Messenger, peace and blessings be upon him, or the independent jurist (المجتهد) among the scholars of outward forms, such as the jurists (الفقهاء).\n\nIt contains the knowledge of the change in Divine Turning (الإقبال الإلهي) due to the change in states (الأحوال).\n\nIt contains the knowledge of establishing the great one in the place of the multitude.\n\nIt contains the knowledge of policies (السياسات) in the addresses of the scholars and the Gnostics (العارفين) who call to Allah.\n\nIt contains the knowledge of recompense by equivalence (الجزاء بالمماثل) in whatever type it may be, and what is praiseworthy in all of that, and what is blameworthy.\n\nIt contains the knowledge of Divine Companionship (المعية الإلهية). <<And Allah speaks the Truth (الْحَقَّ), and He guides to the way>> (Q. 33:4).",
    "ur": "باب تین سو اڑسٹھ: افعال کے مقام کی معرفت میں، جیسے 'آیا' اور 'نہیں آیا'، اور صرف امر (الأمر) کی حضوری کا بیان\n\nاگر ہو غیر جنس میری طرح فصل (امتیاز) میں،\nتو پھر شہد کی مکھیوں کے بارے میں بات کرنے میں میرا امتیاز کہاں رہا؟\n\nمیں ناطق ہوں اور پرندہ بھی میری طرح ناطق ہے،\nجیسا کہ قرآن میں سورۃ النمل میں آیا ہے۔\n\nپس خوش نہ ہو مگر اس چیز پر جس میں تو واحد (منفرد) ہے،\nکیونکہ شکل کا وجود شکل سے مانوس ہوتا ہے۔\n\nمیرا ایک بزرگ، مقدس شیخ تھا،\nجو امور کی فضیلت اور وصل (اتصال) کا قائل تھا۔\n\n***\n\n### \\[قرآن میں مستقبل کے امر کو ماضی کے لفظ سے بیان کیا گیا ہے تاکہ اس کا وقوع یقینی ہو جائے]\n\nذات حق (الحق) نے فرمایا: *وَإِذْ قَالَ اللَّهُ يَا عِيسَى ابْنَ مَرْيَمَ أَأَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وَأُمِّيَ إِلَهَيْنِ مِنْ دُونِ اللَّهِ* (اور جب اللہ فرمائے گا اے عیسیٰ ابن مریم! کیا تم نے لوگوں سے کہا تھا کہ مجھے اور میری ماں کو اللہ کے سوا دو معبود بنا لو؟)۔ یہ بات قیامت کے دن ہی ہو گی، ابھی واقع نہیں ہوئی، لیکن اس کے وقوع کے یقینی ہونے کی وجہ سے مستقبل کو ماضی کے صیغے سے بیان کیا گیا ہے۔ اس میں امکان (الإمكان) کا حکم زائل ہو کر وجوب (الوجوب) کے حکم میں بدل جاتا ہے۔ ہر وہ چیز جو اس مرتبے کی ہو، اس میں ماضی اور مستقبل کا حکم برابر ہوتا ہے، اور اس کا ماضی کے صیغے میں بیان ہونا وقوع اور تحقق میں مستقبل کے صیغے میں باقی رہنے سے زیادہ مؤکد ہے۔\n\nاے ولی! جان لو، اللہ تمہیں حق (الحق) کے ساتھ سعادت مند کرے اور تمہیں اس کے ساتھ گویائی عطا کرے، کہ اہل اللہ کی ایک جماعت نے ایک ایسے امر میں غلطی کی جو حق تعالیٰ (الحق) کی طرف سے آیا تھا، اور ہم نے ان کی غلطی پر ان کی مدد کی، یا یوں کہو کہ ہم نے ان کی مدد نہیں کی بلکہ ان کے اقوال کو اس لیے چلنے دیا کہ وہ اللہ سے منسوب ہیں، تاکہ اس کی طرف صرف اہل حق اور صدق ہی منسوب ہوں۔ وہ امر جس میں انہوں نے غلطی کی، وہ وہ علم حق تھا جس کے ذریعے مخلوق کو پیدا کیا گیا، اور انہوں نے اس مخلوق بہ (جس کے ذریعے پیدا کیا گیا) کو ایک موجود عین (حقیقت) بنا دیا، جب انہوں نے اللہ کو یہ فرماتے سنا کہ: *إِنَّهُ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ* (بیشک اس نے آسمانوں اور زمین کو حق کے ساتھ پیدا کیا) اور اس سے ملتی جلتی دیگر آیات جو قرآن میں وارد ہوئی ہیں۔ یہاں \"باء\" (بِ) کا معنی \"لام\" (لِ) کے معنی میں ہے، اسی لیے حق تعالیٰ (الحق) نے آیت کے آخر میں فرمایا: *فَتَعَالَى اللَّهُ عَمَّا يُشْرِكُونَ* (پس اللہ اس سے بہت بلند ہے جو وہ شریک ٹھہراتے ہیں)۔ یہ \"باء\" کی وجہ سے ہے۔ اور یہ امر بذات خود آسمان و زمین اور جو کچھ ان کے درمیان نازل کیا گیا، سب کے حق میں ہے، یہاں تک کہ یہ پورے وجود (الوجود) کو شامل ہو جاتا ہے، جیسا کہ اس کا فرمان ہے: *وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ* (اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا)۔ اسی طرح، اس نے آسمانوں اور زمین کو حق کے ساتھ ہی پیدا کیا، یعنی حق کے لیے۔ پس وہ لام جو یہاں باء کی جگہ آئی ہے، وہی لام ہے جو اس کے قول *لِيَعْبُدُونِ* (تاکہ وہ میری عبادت کریں) میں ہے۔ پس اس نے آسمانوں اور زمین کو حق کے لیے پیدا کیا، اور حق یہ ہے کہ وہ اس کی عبادت کریں۔ اسی لیے فرمایا: *فَتَعَالَى اللَّهُ عَمَّا يُشْرِكُونَ* (پس اللہ اس سے بہت بلند ہے جو وہ شریک ٹھہراتے ہیں)۔ اور شرک (الشرك) ہی سب سے بڑا ظلم ہے۔ اور کوئی موجود ظاہر نہیں ہوا مگر اسی نوع انسانی سے۔ اور جنوں کا ذکر عبادت کے لیے تخلیق میں اس کے ساتھ صرف اس لیے کیا گیا کہ انسان نے انہیں شرک (الشرك) کے ذریعے گمراہ کیا، نہ کہ جنوں نے شرک کیا، بلکہ انسان ہی وہ ہے جس نے شرک کیا۔ یہ اس صورت میں ہے جب جن سے مراد انسان کا باطن نہ ہو۔ تو گویا وہ فرما رہا ہے: اور میں نے جنوں کو، جو انسان کا پوشیدہ اور باطنی حصہ ہے، اور انسانوں کو، جو اس کا ظاہری حصہ ہے، صرف اس لیے پیدا کیا کہ وہ ظاہراً اور باطناً میری عبادت کریں۔\n\nپھر فرمایا: *أَوَلَمْ يَرَ الْإِنْسَانُ أَنَّا خَلَقْنَاهُ مِنْ نُطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُبِينٌ* (کیا انسان نے نہیں دیکھا کہ ہم نے اسے ایک نطفے سے پیدا کیا، پھر اچانک وہ کھلم کھلا جھگڑنے والا بن گیا؟) یعنی اس کی خصومت واضح اور ظاہر ہے۔ اور فرمایا: *خَلَقَ الْإِنْسَانَ مِنْ نُطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُبِينٌ* (اس نے انسان کو نطفے سے پیدا کیا، پھر اچانک وہ کھلم کھلا جھگڑنے والا بن گیا)۔ یہ اس کی ربوبیت (الربوبية) کے دعوے کی وجہ سے ہے، حالانکہ اللہ نے اسے صرف ایک بندہ پیدا کیا ہے، لہٰذا وہ اپنی حد سے تجاوز کرتا ہے۔ پس وہ اپنے رب سے اس کی ربوبیت (الربوبية) میں جھگڑتا ہے۔ اور مخلوقات میں سے کسی نے اس سے جھگڑا نہیں کیا سوائے اس کے۔ اور اس کی خصومت کو واضح (مبین) قرار دیا گیا ہے، برخلاف ان کے جن کی خصومت کا وصف ملأ اعلیٰ یا دیگر مخلوقات میں بیان کیا گیا ہے، اور ربوبیت (الربوبية) کے دعوے کے علاوہ دیگر امور میں۔ کیونکہ مخلوق کی طرف سے ربوبیت کے دعوے کے خلاف کسی بھی معاملے میں کوئی جھگڑا نہیں ہوتا مگر یہ کہ ممکن ہے کہ حق اس کے ہاتھ میں ہو اور وہ سننے والے اور حاکم سے پوشیدہ ہو، لہٰذا وہ نہیں جانتا کہ حق اس کے ساتھ ہے یا اس کے جھگڑنے والے کے ساتھ، اور کیا وہ اپنے دعوے میں سچا ہے یا جھوٹا، کیونکہ اس میں احتمال کی گنجائش ہوتی ہے۔ سوائے ربوبیت (الربوبية) کے دعوے کے، کیونکہ وہ خود بھی جانتا ہے اور اللہ کی مخلوق میں سے ہر سننے والا بھی جانتا ہے کہ وہ اپنے دعوے میں جھوٹا ہے اور وہ ایک عبد ہے، اور اللہ نے اسے اسی لیے پیدا کیا ہے۔ اسی لیے اس کے بارے میں کہا گیا کہ وہ *خَصِيمٌ مُبِينٌ* (کھلم کھلا جھگڑنے والا) ہے، یعنی اپنی خصومت میں واضح طور پر ظالم ہے۔ پس جو اپنے رب سے اس کی ربوبیت (الربوبية) میں جھگڑے، اس کا کیا حال ہو گا؟ پھر یہ انسان کاش کہ یہ کوشش اپنے حق میں کرتا، کیونکہ وہ خود جانتا ہے کہ ربوبیت (الربوبية) میں اس کا کوئی حصہ نہیں ہے۔ پھر وہ اللہ کی مخلوق میں سے کسی پتھر، پودے، حیوان، اپنے جیسے انسان، جن یا ستارے کے لیے ربوبیت کا اقرار کرتا ہے۔ کیونکہ مخلوقات کی کوئی صنف باقی نہیں رہی جس کی عبادت نہ کی گئی ہو، اور اس کی عبادت صرف انسان حیوان نے کی ہے۔ پس سب سے بدبخت وہ ہے جو اپنی آخرت کو کسی دوسرے کی دنیا کے بدلے بیچ دے، اور وہ ہلاک ہو جائے اس چیز میں جو اس کے ہاتھ نہیں آتی۔ پس وہ خود پر گواہی دیتا ہے کہ وہ دوسروں کے بارے میں سب سے زیادہ جاہل ہے اور اپنے بارے میں سب سے زیادہ جاننے والا ہے، کیونکہ اس نے ربوبیت کا دعویٰ اپنے لیے نہیں کیا۔ اور جس نے اپنے لیے دعویٰ کیا، اس نے تو *فَاسْتَخَفَّ قَوْمَهُ فَأَطَاعُوهُ* (پس اس نے اپنی قوم کو ہلکا سمجھا تو انہوں نے اس کی اطاعت کی)۔ اور وہ خود اپنے بارے میں اس کے خلاف جانتا تھا۔ اسی لیے اس نے کہا: *مَا عَلِمْتُ لَكُمْ مِنْ إِلَهٍ غَيْرِي* (میں تمہارے لیے اپنے سوا کوئی معبود نہیں جانتا) یعنی تمہارے اعتقاد میں۔\n\n***\n\n### \\[حق تعالیٰ (الحق) کسی چیز کو کسی چیز کے ذریعے پیدا نہیں کرتا بلکہ کسی چیز کو کسی چیز کے پاس پیدا کرتا ہے]\n\nاور جان لو کہ حق تعالیٰ (الحق) کسی چیز کو کسی چیز کے ذریعے پیدا نہیں کرتا، بلکہ کسی چیز کو کسی چیز کے پاس پیدا کرتا ہے۔ پس ہر وہ چیز جو استعانت اور سببیت کا تقاضا کرتی ہے، وہ لامِ حکمت ہے۔ اللہ نے کوئی چیز پیدا نہیں کی مگر حق کے لیے، اور حق یہ ہے کہ وہ اس کی عبادت کریں۔ *فَإِذَا هُوَ خَصِيمٌ مُبِينٌ* (پھر اچانک وہ کھلم کھلا جھگڑنے والا بن گیا)۔ اور یہ صرف سینوں میں موجود دلوں کے حق (الحق) سے اندھے ہونے کی وجہ سے ہے۔ اگر وہ حق سے روگردانی نہ کرتے اور اس کی طرف متوجہ ہوتے تو وہ حق کو دیکھ لیتے اور ہر چیز میں اس کی ربوبیت (الربوبية) کا اقرار کرتے اور اپنے رب کی عبادت میں کسی کو شریک نہ کرتے۔ اسی لیے فرمایا: *فَمَنْ كَانَ يَرْجُو لِقَاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صَالِحًا* (پس جو کوئی اپنے رب کی ملاقات کی امید رکھتا ہو، اسے چاہیے کہ نیک عمل کرے)۔ اور نیک عمل وہ ہے جس میں کوئی خلل نہ ہو۔ اگر اس میں خلل ظاہر ہو تو وہ نیک نہیں ہے۔ اور عمل میں خلل اور عدمِ صلاح صرف شرک (الشرك) ہے۔ پس فرمایا: *وَلَا يُشْرِكْ بِعِبَادَةِ رَبِّهِ أَحَدًا* (اور اپنے رب کی عبادت میں کسی کو شریک نہ کرے)۔ یہاں نکرہ (اَحَدًا) استعمال کیا گیا ہے، جو ہر اس چیز کو شامل ہے جس پر \"احد\" کا نام بولا جا سکتا ہے، اور وہ عالمِ خلق اور عالمِ امر کی ہر چیز ہے۔ اور اس میں شرکِ اصغر بھی شامل ہے، جو عام لوگوں میں پایا جاتا ہے، اور وہ پوشیدہ ربوبیت (الربوبية) ہے جس کی بے حرمتی \"میں نے کیا\"، \"میں نے بنایا\"، \"فلاں نے کیا\" اور \"اگر فلاں نہ ہوتا\" جیسے اقوال میں ہوتی ہے۔ یہ وہ شرک ہے جو بخش دیا جاتا ہے، کیونکہ جب تم اس قول کے قائلین سے رجوع کرتے ہو تو وہ اللہ تعالیٰ کی طرف لوٹ آتے ہیں۔ اور شرکِ خصوصی وہ ہے جو *الَّذِينَ يَجْعَلُونَ مَعَ اللَّهِ إِلَهًا آخَرَ* (جو اللہ کے ساتھ کوئی اور معبود بناتے ہیں)۔ اور یہ وہ ظلمِ عظیم ہے جو انہوں نے اس پر کیا جسے وہ اللہ کے ساتھ معبود کہتے ہیں۔ پس انہوں نے اللہ پر اس کی الوہیت کی وحدانیت میں ظلم کیا اور شریک پر اس کی طرف الوہیت کی نسبت کرنے میں ظلم کیا۔ پس اللہ انہیں شریک پر کیے گئے ظلم کی وجہ سے پکڑے گا، نہ کہ اس کی احدیت میں کیے گئے ظلم کی وجہ سے، کیونکہ جسے انہوں نے شریک بنایا وہ قیامت کے دن ان سے براءت کا اظہار کرے گا، جب حقوق ان کے مستحقین کی طرف ظاہر ہوں گے۔ پس حقیقت یہ ہے کہ اللہ کسی چیز کو کسی چیز کے ذریعے پیدا نہیں کرتا، اور اگر وہ اسے کسی چیز کے لیے پیدا کرتا ہے تو وہ لامِ حکمت ہے، اور اس کی تخلیق کا عین (حقیقت) ہی حکمت کا عین ہے، کیونکہ اس کی تخلیق معلول نہیں ہوتی۔ پس مخلوق ذاتاً عبد ہے، جس پر عوارض نے اثر کیا، خاص طور پر شخصِ انسانی پر۔ بلکہ عوارض نے صرف شخصِ انسانی پر ہی اثر کیا ہے، باقی تمام مخلوقات پر نہیں۔ اور جو اس کے سوا ہیں وہ اپنے اصل پر قائم ہیں کہ اپنے خالق کو شریک سے پاک سمجھتے ہیں۔ اسی لیے فرمایا: *وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لَا تَفْقَهُونَ* (اور کوئی چیز ایسی نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے، لیکن تم ان کی تسبیح کو نہیں سمجھتے)۔ اور یہاں *لَا تَفْقَهُونَ* (تم نہیں سمجھتے) میں جمع کا ضمیر خاص طور پر انسانوں کے لیے ہے۔ پس تمام مخلوقات نے اللہ کی عبادت کی سوائے بعض انسانوں کے۔ پس انسان سب سے زیادہ جھگڑالو ہے، جہاں وہ اس چیز میں جھگڑتا ہے جس میں ظلم واضح ہے، اور وہ صرف ربوبیت (الربوبية) ہے۔ کیا تم نے کسی بندے کو اپنے رب سے جھگڑتے دیکھا ہے، سوائے اس کے کہ جب وہ اپنی عبودیت (العبودية) سے نکل جائے اور اپنے آقا کی ربوبیت (الربوبية) میں مداخلت کرے، اور اپنے لیے ملکیت کا دعویٰ کرے؟ پس جب اس کا آقا اس میں تصرف کرتا ہے تو وہ اس سے جھگڑتا ہے۔ پس بندے کی طرف سے عبودیت (العبودية) میں کوئی خصومت واقع نہیں ہوئی، بلکہ وہ اس چیز میں واقع ہوئی جس کا وہ رب اور مالک ہے۔ اور اہل اللہ میں سے بہت سے علماء ہیں جن کا میں ذکر نہیں کرتا اور نہ ہی نام لیتا ہوں، کیونکہ ان کی طرف یہ نسبت ان کی جہالت پر دلالت کرتی ہے، اس لیے میں نے ان کے ساتھ ادب کا برتاؤ کیا۔ انہوں نے \"مخلوق بہ\" (جس کے ذریعے پیدا کیا گیا) کو دو طرح سے مقرر کیا: ان میں سے بعض نے اس حق (الحق) کو جس کے ذریعے مخلوق کو پیدا کیا گیا، تخلیق کی علت کا عین قرار دیا، حالانکہ حق تعالیٰ (الحق) اپنی تخلیق کو معلول نہیں کرتا۔ یہ بذات خود صحیح ہے، یہاں تک کہ اس میں کوئی ایسا امر سمجھا نہیں جا سکتا جو اس پر اس کی ظاہر کردہ تخلیق کو واجب کر دے، بلکہ اس نے مخلوق کو مخلوق پر اپنی طرف سے احسان اور ابتدائی فضل کے طور پر پیدا کیا، اور وہ تمام جہانوں سے بے نیاز ہے۔ اور ان میں سے بعض نے اس حق (الحق) کو جس کے ذریعے مخلوق کو پیدا کیا گیا، ایک موجود عین (حقیقت) قرار دیا جس کے ذریعے اللہ نے اس کے سوا ہر چیز کو پیدا کیا، اور یہ وہ لوگ ہیں جو کہتے ہیں کہ واحد سے صرف واحد ہی صادر ہوا، اور اس واحد کا صدور ایک علت سے معلول کے صدور کی طرح تھا، جس علت نے اس کے صدور کو واجب کر دیا۔ اور اس میں بہت کچھ ہے۔ اور جو میں کہتا ہوں وہ یہ ہے:\n\nجب اللہ کا امر (الأمر) آ جائے تو امر ہی آمر ہے،\nاور یہ توحید ہے اس کے لیے جس کا امر (الأمر) ہے۔\n\nپس شرک نہ کرو، کیونکہ شرک (الشرك) ایک ثابت شدہ ظلم ہے،\nاور یہ ظلم پتھر کو بھی شامل ہے۔\n\nاور چونکہ علم سے دل زندہ ہوتے ہیں، جیسے کہ جسموں کے اعیان روحوں سے زندہ ہوتے ہیں، اس لیے علم کو روح (الروح) کہا گیا، جسے فرشتے اللہ کے بندوں کے دلوں پر نازل کرتے ہیں، اور وہ اسے القاء کرتے ہیں، اور اللہ اپنے بندوں کے حق میں بغیر کسی واسطے کے بھی اس کی وحی کرتا ہے۔ جہاں تک اس کے القاء اور وحی کا تعلق ہے، تو وہ اس کا فرمان ہے: *يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ* (وہ اپنے امر (الأمر) سے روح کو اپنے بندوں میں سے جس پر چاہتا ہے نازل کرتا ہے) اور اس کا فرمان: *وَكَذَلِكَ أَوْحَيْنَا إِلَيْكَ رُوحًا مِنْ أَمْرِنَا* (اور اسی طرح ہم نے آپ کی طرف اپنے امر (الأمر) سے ایک روح کی وحی کی)۔ اور جہاں تک فرشتوں کے ذریعے اسے بندوں کے دلوں پر نازل کرنے کا تعلق ہے، تو وہ حق تعالیٰ (الحق) کا فرمان ہے: *يُنَزِّلُ الْمَلَائِكَةَ بِالرُّوحِ مِنْ أَمْرِهِ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ* (وہ فرشتوں کو روح کے ساتھ اپنے امر (الأمر) سے اپنے بندوں میں سے جس پر چاہتا ہے نازل کرتا ہے)۔ پس وہ غیب میں معلم اور استاد ہیں، جن پر وہ نازل ہوتے ہیں وہ انہیں دیکھتے ہیں۔ پس جب یہ روح بندے کے دل میں فرشتے کے نازل کرنے سے یا اللہ کے القاء اور وحی سے نازل ہوتی ہے، تو جس پر یہ نازل ہوتی ہے اس کا دل اس سے زندہ ہو جاتا ہے، اور وہ شہود (الشهود) اور وجود (الوجود) کا مالک بن جاتا ہے، نہ کہ فکر اور تردد کا مالک، اور نہ ہی ایسے علم کا جو اس پر کوئی خلل قبول کرے، جس سے اس کا مالک یقین کے درجے سے نظر و فکر کی حالت کی طرف منتقل ہو جائے۔ پس برگزیدہ عالم بندہ یا تو عروج کرتا ہے اور دیکھتا ہے، یا اس کے مقام پر اس پر نازل کیا جاتا ہے۔\n\nآیات کو دیکھنے کے لیے عروج کرنا،\nذات (الحق) کے شہود (الشهود) میں محقق کی صفت ہے۔\n\nپس حال کے فعل سے دیکھ، تو اس کے وجود (الوجود) کا شہود کرے گا،\nاور ماضی کی طرف دیکھ، وہ تجھے آنے والا (مستقبل) دکھائے گا۔\n\nبیشک وجود (الوجود) اکثر حالات میں اپنے وجود سے،\nخود پر دلیل قائم کرتا ہے۔\n\nپس حال ہمیشہ زندوں میں شہود (الشهود) کرتا ہے،\nاور ماضی اور آنے والا مردوں کے ساتھ ہیں۔\n\nاگر ان لوگوں کی طرف سے معذرت کرنے والا کہے کہ انسان کامل (الإنسان الکامل) کو اس صورت پر پیدا کرنے کا کیا فائدہ ہے؟ ہم کہیں گے: تاکہ اس سے افعال اور تمام مخلوقات کا صدور ظاہر ہو، اس کے باوجود کہ اس کی عین (حقیقت) اس کے نزدیک عبد ہی ہے، کیونکہ امرِ الٰہی کی انتہا یہ ہے کہ حق (الحق) بندے کے ساتھ ہو، اور اس کی بصارت، بلکہ اس کی تمام قوتیں ہوں۔\nپس حق تعالیٰ (الحق) نے فرمایا: \"جب میں اس سے محبت کرتا ہوں تو میں اس کا کان، اس کی آنکھ اور اس کا ہاتھ بن جاتا ہوں\" (حدیث قدسی)۔\nپس ضمیر کے ذریعے اس کی عین (حقیقت) کو عبد ثابت کیا، جس کے لیے کوئی ربوبیت (الربوبية) نہیں، اور جو کچھ اس کے ذریعے، اس پر اور اس سے ظاہر ہوتا ہے، اسے حق تعالیٰ (الحق) قرار دیا، نہ کہ بندے کے لیے۔ پس یہ خبر ہمارے مسلک کی تائید کرتی ہے، حالانکہ اگر وہ اس سے معذرت کرتے ہوئے ہم پر حجت قائم کرتے، جیسا کہ تم نے کیا، تو یہ خبر ان کے پاس نہ ہوتی۔ پس نبوت کے کلام سے بڑھ کر کوئی چیز نہیں، خاص طور پر اس میں جو اللہ عزوجل کی طرف سے خبر دی گئی ہو۔ اگر وہ کہیں کہ امکان (الإمكان) نے ہمیں یہ کہنے پر مجبور کیا جو ہم کہتے ہیں، تو ہم کہیں گے: امکان (الإمكان) ایک وہمی حکم ہے، جو نہ اللہ کے حق میں معقول ہے اور نہ ہی اس کے حق میں جسے ممکن کہا جاتا ہے، کیونکہ جسے ممکن کہا جاتا ہے وہ کبھی بھی بغیر کسی مرجح (ترجیح دینے والے) کے معقول نہیں ہوتا۔ اور اختیار کی حالت بغیر ترجیح کے معقول نہیں ہوتی، اور یہ واقع نہیں ہے۔ پس یہ عقلی طور پر واقع نہیں، لیکن وہم کے طور پر واقع ہوتا ہے، اور وہم ایک عدمی حکم ہے۔ پس وہاں یا تو واجب بالذات ہے یا واجب بالغیر۔ پس اشیاء میں حق (الحق) کی مشیئت ایک ہی ہے۔\n\nاور حق (الحق) کے لیے اس کی مشیئت کے سوا کچھ نہیں،\nجو عین میں واحد ہے، کوئی شرک اسے دو نہیں کرتا۔\n\nاور اختیار کا فرض کرنا محال ہے، پس اگر\nوہ آئے تو اس کی حکمت امکان (الإمكان) ہے، جسے تو جانتا ہے۔\n\nپس اس کی نشوونما ہمیشہ ترجیح پر رہتی ہے،\nاور اللہ نے حال کے ذریعے اپنے آپ کو اس میں چھپا رکھا ہے۔\n\nپس ممکنات میں نظر کرنے سے امکان (الإمكان) ہمارے علم سے زائل ہو گیا،\nپس وہ انہیں ظاہر کرتا ہے اور چھپاتا ہے۔\n\nاور جب امکان (الإمكان) زائل ہو گیا تو اختیار بھی زائل ہو گیا، اور صرف ایک ہی عین (حقیقت) باقی رہی، کیونکہ مشیئتِ الٰہیہ کے پاس اشیاء میں صرف ایک ہی امر (الأمر) ہے۔ اور اشیاء دونوں حکموں میں سے ایک معین حکم پر ہی رہتی ہیں۔ پس امر (الأمر) ویسا نہیں ہے جیسا کہ امکان (الإمكان) کا قائل وہم کرتا ہے۔ پس یہ ثابت ہوا کہ وہاں صرف حق (الحق) کے لیے حق اور خلق کے لیے حق ہے۔ پس حق (الحق) کا حق اس کی ربوبیت (الربوبية) ہے اور خلق کا حق اس کی عبودیت (العبودية) ہے۔ پس ہم بندے ہیں اگرچہ ہم اس کی صفات کے ساتھ ظاہر ہوں، اور وہ ہمارا رب ہے اگرچہ وہ ہماری صفات کے ساتھ ظاہر ہو۔ کیونکہ محققین کے نزدیک صفات کا موصوف کی عین (حقیقت) میں کوئی اثر نہیں ہوتا۔ اسی لیے جب ان کی ضد آتی ہے تو وہ زائل ہو جاتی ہیں، لیکن عین (حقیقت) زائل نہیں ہوتی، بلکہ دونوں حالتوں میں اس کا وجود باقی رہتا ہے۔ پس کھڑا ہونے والا اپنی عین (حقیقت) کے لحاظ سے بیٹھے ہوئے کا عین ہے، اور کھڑا ہونے والا اپنے حکم کے لحاظ سے بیٹھا ہوا نہیں ہے۔ پس کھڑا ہونے والا اپنی قیام کی حالت میں بیٹھ نہیں سکتا، اور بیٹھا ہوا اپنی قعود کی حالت میں کھڑا نہیں ہو سکتا۔ اور حق (الحق) نے وہی چاہا جو امر (الأمر) بذات خود ہے۔ پس امور میں حق کی مشیئت وہی عین ہے جو امور کی ہے۔ پس حکم زائل ہو گیا، کیونکہ اگر تم مشیئت کو عینِ امر (الأمر) کے خلاف قرار دو، تو یا تو مشیئت امر کی پیروی کرے گی، جو محال ہے، یا امر اس کی پیروی کرے گا، جو محال ہے۔ اس کی وضاحت یہ ہے کہ امر (الأمر) بذات خود اپنے لیے امر ہے، جو کچھ بھی ہو، وہ تبدیلی قبول نہیں کرتا۔ پس وہ ایسی مشیئت سے مشاء (مطلوب) نہیں ہے جو اس کا عین نہ ہو۔ پس مشیئت اس کا عین ہے، لہٰذا نہ کوئی تابع ہے اور نہ کوئی متبوع۔ پس وہم سے بچو، کیونکہ اس کا نفس پر ایک قوی تسلط ہے جو اس کے اور صحیح علم کے درمیان حائل ہو جاتا ہے جو عقلِ سلیم عطا کرتی ہے۔ اور جب میں اس مقام میں داخل ہوا، جب مجھے اس کے نشانات کی طرف بلند کیا گیا، تو میں نے اس کے نشانات سے اس پر استدلال کیا یہاں تک کہ میں اس تک پہنچ گیا، بہت سی مشقتیں اٹھانے اور لمبا سفر طے کرنے کے بعد۔ جب میں اس میں داخل ہوا تو اس میں تصرف کرنا میرے لیے مشکل ہو گیا، کیونکہ اس میں ہلاکتیں تھیں، اور یہ ایک تاریک مقام تھا جس میں کوئی چراغ نہیں تھا۔ پس میں اس میں قدم کے احساس اور ثابت قدمی کے ساتھ چلتا تھا، اس خوف سے کہ کہیں اس کی ہلاکتوں میں سے کسی میں نہ گر جاؤں۔ جب میرا قدم کسی ایسی جگہ پر جم جاتا جسے میں محسوس کرتا لیکن دیکھ نہ پاتا، تو میں اسے منتقل کرنے کی کوشش کرتا اور ایسی جگہ تلاش کرتا جہاں منتقل ہو سکوں۔ جب میرا قدم کسی خالی جگہ پر پڑتا تو میں جان لیتا کہ وہاں کوئی ہلاکت ہے۔ پس میں اپنے قدم سے دائیں بائیں ٹٹولتا رہا یہاں تک کہ مجھے اپنے قدم کے لیے کوئی ایسی جگہ مل جاتی جہاں وہ ٹھہر سکے، اور میں دوسرے قدم پر بھروسہ کیے ہوئے ہوتا۔ میں اسی طرح اس تاریکی میں ایک جگہ سے دوسری جگہ منتقل ہوتا رہا اور کچھ بھی نہیں دیکھ پاتا تھا، کیونکہ میری بصارت کے نور کے ساتھ باہر سے کوئی نور نہیں تھا۔ پس میرا پاؤں ہی میری بصارت تھا۔ اس سے میں نے جان لیا کہ میں نے کتنا تصرف کیا، اور میں احتیاط میں تھا، مجھے نہیں معلوم تھا کہ میرے راستے میں کوئی تکلیف دہ جانور آ جائے گا اور مجھے محسوس بھی نہیں ہو گا یہاں تک کہ وہ مجھے تکلیف پہنچا دے۔ اس کے باوجود میں نے اپنی جان کو خطرے میں ڈالا، کیونکہ میں نے کہا کہ میں ہر حال میں تاریکی میں ہوں، پس میرے لیے بیٹھنا یا تصرف کرنا برابر ہے۔ کیونکہ اگر میں بیٹھا رہا تو مجھے یہ خوف رہے گا کہ کوئی تکلیف دہ جانور آ جائے گا، اور اگر میں تصرف کیا تو بھی مجھے تکلیف دہ جانور یا کسی ہلاکت میں گرنے کا خوف رہے گا۔ پس تصرف میں ثابت قدمی میرے لیے زیادہ امید افزا تھی، لہٰذا میں نے فائدہ کی تلاش میں اسے بیٹھنے پر ترجیح دی۔ میں اسی حال میں تھا کہ اچانک باہر سے شرع کا نور ایک چراغ کی صورت میں مجھ پر ظاہر ہوا، جو ایسا چراغ تھا جسے خواہشات نہیں ہلا سکتی تھیں، کیونکہ وہ ایک طاق میں تھا، اور اس کا طاق رسول (صلی اللہ علیہ وسلم) ہیں، پس وہ ان خواہشات سے محفوظ ہے جو اسے بجھا دیں۔ اور وہ چراغ ان کے قلب کے شیشے میں تھا، اور ان کا جسم چراغ تھا، اور زبان اس کا ترجمہ، اور امدادِ الٰہی اس کا تیل، اور درخت اس کی امداد کی حضوری۔ پس بصارت کا نور اس خارجی نور کے ساتھ مل گیا، تو ہم نے راستے کی ہلاکتوں اور نقصان دہ جانوروں کو بے نقاب کر دیا، اور ہم نے ہر اس چیز سے اجتناب کیا جس سے خوف اور احتیاط کی جاتی ہے۔ اور ہم نے ایک سفید شاہراہ پر سفر کیا جس میں نہ کوئی ہلاکت تھی اور نہ کوئی نقصان دہ جانور۔ اور اگر وہ ہمارے سامنے آتے تو ہم راستے کی وسعت اور آسانی اور ان رکاوٹوں اور قلعوں کی وجہ سے جو ان جانوروں کے نقصان کو روکتے تھے، ان سے بچ کر نکل جاتے۔ پس *مَنْ لَمْ يَجْعَلِ اللَّهُ لَهُ نُورًا فَمَا لَهُ مِنْ نُورٍ* (جس کے لیے اللہ نے نور نہ بنایا ہو، تو اس کے لیے کوئی نور نہیں ہے)۔ اور جب یہ چراغ ظاہر ہوا تو نہ بجھا اور نہ زائل ہوا۔ پس جس نے اس سے پیٹھ پھیری اور اعراض کیا، وہ اپنی ذات کی تاریکی میں چلتا رہا، اور وہ تاریکی اس پر ظلمت بن گئی، پس وہ ان لوگوں میں سے ہو گیا جنہوں نے چراغ سے اعراض اور پیٹھ پھیر کر خود پر ظلم کیا۔ پس یہ اس شخص کا حکم ہے جس نے شرع کو چھوڑ دیا اور اپنی نظر پر اکتفا کیا، پس اگرچہ وہ اپنی کوشش میں ثابت قدم رہا، لیکن اپنی ذات کی تاریکی کی وجہ سے راستے کے جانوروں کے خطرے میں رہا، اگرچہ وہ کسی ہلاکت میں نہ گرا ہو۔ پس عاقل کو چاہیے کہ وہ ایسے امر میں جلدی نہ کرے جس میں اس کے لیے مہلت ہو، اور نہ ہی ایسے امر میں سستی کرے جس میں حق کی طرف پہل کرنا اور اس کے حصول میں تیزی کرنا ہو۔ یہ عاقل میں عقل کا فائدہ ہے۔\n\nاور میں نے اس مقام میں بہت سے علوم دیکھے، ان میں سے ایک علمِ حاصل فی عینِ فوت (حاصل کا فوت شدہ کے عین میں ہونا) ہے۔ کیونکہ اگر ایسا نہ ہوتا تو تم اپنے حق میں حاصل کی فضیلت کو فوت شدہ پر نہ جان پاتے، اگر اس میں تمہاری سعادت ہوتی، اور نہ ہی فوت شدہ کی فضیلت کو حاصل پر جان پاتے، اگر فوت شدہ تمہارا مطلوب ہوتا اور اگر وہ تمہیں مل جاتا تو تمہیں بدبخت کر دیتا، اور تم نہیں جانتے تھے۔ پس تمہارے حق میں اس کی فضیلت اس کا فوت ہو جانا تھا، کیونکہ اس کے فوت ہونے سے تم سعادت مند ہوئے۔ اور یہ صرف اسی کے لیے ہوتا ہے جسے اللہ سعادت مند کرے۔ اور یہ اس کا فرمان ہے: *وَعَسَى أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ وَعَسَى أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمْ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ* (اور ہو سکتا ہے کہ تم کسی چیز کو ناپسند کرو اور وہ تمہارے لیے بہتر ہو، اور ہو سکتا ہے کہ تم کسی چیز کو پسند کرو اور وہ تمہارے لیے بری ہو، اور اللہ جانتا ہے اور تم نہیں جانتے)۔ اور ان علوم میں سے وہ روایت بھی ہے کہ رسول اللہ صلی اللہ علیہ وسلم اپنی رسالت سے پہلے بادیہ میں بکریاں چرایا کرتے تھے، اور آپ مکہ میں داخل ہونا چاہتے تھے تاکہ وہاں وہ چیزیں حاصل کریں جو نوجوان حاصل کرتے ہیں۔ جب آپ مکہ میں داخل ہوتے اور بکریاں کسی جاننے والے کے پاس چھوڑ جاتے جو آپ کے آنے تک ان کی حفاظت کرتا، تو اللہ آپ پر نیند طاری کر دیتا، اور آپ اس چیز کے حصول سے محروم رہ جاتے جس کے لیے آپ داخل ہوئے تھے۔ پس آپ جلدی سے اپنی بکریوں کی طرف لوٹ جاتے اور اس چیز سے محروم ہو کر نکلتے جس کے لیے آپ داخل ہوئے تھے۔ اور اسی میں آپ کی عصمت اور حفاظت تھی، جہاں سے آپ کو شعور بھی نہیں ہوتا تھا۔ اور اس معنی میں کہاوت ہے کہ عصمت یہ ہے کہ تم نہ پاؤ۔ اور اس میں علمِ احدیتِ افعال ہے، جو ایک اختلافی امر ہے۔ پس بعض اسے حق تعالیٰ (الحق) کے لیے ثابت کرتے ہیں، اور بعض اسے خلق کے لیے ثابت کرتے ہیں، پس یہ دونوں گروہوں میں احدی ہے۔ اور بعض اس میں شرکِ خفی ثابت کرتے ہیں، اور وہ کسب کے قائل ہیں۔ اور اس میں وہ علم ہے جو صرف وہب (عطا) سے معلوم ہوتا ہے، کشف (الکشف) کا اس میں بالکل کوئی دخل نہیں، اور وہ وہ ہے جو مدرک (ادراک کرنے والا) کی ذات سے ہی ادراک کیا جاتا ہے، اس کے مطابق جس پر مدرک (ادراک کیا گیا) کا اسم فاعل ہے۔ پس اگر وہ ان میں سے ہے جن کی طرف حواس منسوب کیے جاتے ہیں، تو حواس اس کے لیے ذاتی ہیں نہ کہ ان کے معین مقامات۔ اور اگر وہ ان میں سے ہے جن کی طرف حواس منسوب نہیں کیے جاتے، تو محسوسات کا ادراک بھی حواس والے کی طرح اپنی ذات سے کرتا ہے، اور یہ نہیں کہا جاتا کہ وہ اس کے لیے محسوس ہیں، کیونکہ اس کی طرف حس منسوب نہیں کی جاتی، پس وہ اس کے لیے معلوم ہیں۔ اور حواس علم تک پہنچانے کا راستہ ہیں، اور امر (الأمر) کا علم ہی مطلوب ہے نہ کہ وہ جو حاصل ہوا۔ پس میں نے دیکھا ہے کہ پیدائشی نابینا بصارت کی حس کھو دینے کے باوجود رنگوں کے درمیان فرق کو جان لیتا ہے، اور اللہ نے اس کی بصارت اس کے لمس میں رکھ دی ہے، پس وہ اس چیز سے دیکھتا ہے جس سے وہ چھوتا ہے۔ اور اس میں علمِ اعلام ہے، جس میں حق (الحق) کی توحید کو اس کی الوہیت میں کسی بھی زبان سے جاننا شامل ہے۔ اور وہ سماعت کیا ہے جس نے اس اعلامِ الٰہی کو ادراک کیا، اگر اس کے بعد اس کی سمجھ بھی آ جائے؟ اور اگر اس کے بعد سمجھ نہ آئے تو کیا اسے سنا ہوا کہا جائے گا یا نہیں؟ اور اس میں انسانِ حیوان کے مرتبے کا علم ہے، اور اس کا انسان کامل (الإنسان الکامل) سے قوت کے ذریعے اس چیز میں مزاحمت کرنا جو انسان کامل (الإنسان الکامل) سے صرف فعل کے ذریعے ہوتی ہے۔ اور یہ کہ انسان کامل (الإنسان الکامل) حکم میں انسانِ حیوان سے مختلف ہے۔ کیونکہ انسانِ حیوان کو حیوان کا رزق ملتا ہے، اور وہ کامل کے لیے بھی ہے اور اس سے زیادہ بھی۔ کیونکہ کامل کے لیے رزقِ الٰہی ہے جو انسانِ حیوان کو نہیں ملتا، اور وہ وہ ہے جس سے وہ فکر کے علوم سے غذا حاصل کرتا ہے جو انسانِ حیوان کے لیے نہیں ہوتے، اور کشف (الکشف)، ذوق اور صحیح فکر۔ اور اس میں عالم پر اللہ کی رحمت کا علم ہے، جہاں اس نے انہیں اسباب پر محول کیا، اور ان کے لیے رزق صرف ان اسباب میں رکھا، تاکہ وہ ان کے اثبات میں عذر تلاش کر سکیں۔ پس جس نے انہیں جعلاً (بناوٹ کے طور پر) ثابت کیا، وہ صاحبِ عبادت ہے، اور جس نے انہیں عقلاً ثابت کیا، وہ مشرک ہے، اگرچہ وہ مومن ہو۔ پس ہر مومن وہ نہیں جو بصیرتِ شہودیہ کے ذریعے موحد ہو جو اللہ نے اسے عطا کی ہو۔ اور اس میں شرائع میں مباح کے مرتبے کا علم ہے، اور جو حد انہوں نے اس کی مقرر کی ہے کہ اس میں نہ اجر ہے اور نہ گناہ، کیا وہ حد صحیح ہے یا نہیں؟ اور کیا اس کے فعل اور ترک میں اجر کا حصول ہے؟ اور اللہ کے افعال میں سے کس چیز کو دیکھا جاتا ہے، اور اللہ کے بارے میں کس چیز کا حکم لگایا جاتا ہے؟ کیونکہ اس کی مماثلت صرف اللہ سے منسوب اختیار سے ہی ہو سکتی ہے۔ پس اگر وہاں اختیار کی حد پر اختیار ثابت نہ ہو، تو یہاں مباح کی حد پر مباح ثابت نہیں ہو گا، کیونکہ وہ وہاں نہیں ہے۔ اور اس میں اس علم کا بیان ہے جو مخلوق جانتی ہے، اور یہ کہ وہ محدود اور مقید ہے، اس کے علم میں اطلاق کی نسبت نہیں کی جا سکتی، کیونکہ یہ حق سبحانہ و تعالیٰ کی خصوصیات میں سے ہے۔ اور اس میں ان لوگوں میں طبائع کے اختلاف کا علم ہے جن سے وہ مرکب ہیں، اور وہ کس چیز سے مختلف ہیں جن کی کوئی طبیعت نہیں ہے؟ اور اگر ان میں اختلاف کا حکم نہ ہوتا جن کی کوئی طبیعت نہیں ہے، تو طبیعت میں اختلاف ظاہر نہ ہوتا، جیسا کہ اگر طبیعت میں اختلاف نہ ہوتا تو ان چیزوں میں اختلاف ظاہر نہ ہوتا جو اس سے مرکب ہیں۔ اور یہ مفردِ عین اور مفردِ حکم میں ایک عجیب علم ہے۔ پس قابلوں کے ذریعے بالفعل اختلاف ظاہر ہوا، حالانکہ وہ مفرد میں بالقوہ تھا۔ اور اس میں اس حکمت کا علم ہے کہ عالم کا بعض حصہ بعض پر موقوف ہے اس چیز میں جو اس سے حاصل ہوتی ہے، باوجود اس کے کہ وہ اس کے بغیر بھی ممکن ہے۔ اور اس میں اس شخص کے مرتبے کا علم ہے جس کے علوم زیادہ ہیں، اس شخص کے مقابلے میں جس کے علوم کم ہیں، اور جس کے علوم کم ہیں، کیا وہ کثرت سے کم ہیں یا بغیر کثرت کے کم ہیں؟ اور اگرچہ بعض کے نزدیک شرف کم علمی میں ہے، تو اللہ عزوجل نے اپنے رسول صلی اللہ علیہ وسلم کو علم میں اضافے کی دعا کرنے کا حکم کیوں دیا، حالانکہ اضافہ کثرت ہے۔ اور جس کا علم معلومات سے ہو، اگرچہ وہ کثیر ہوں، لیکن ہر معلوم کی احدیت جو حق (الحق) کی احدیت پر دلالت کا عین ہے، تو وہ ایک ہی علم کا مالک ہے، اور کثیر معلومات میں ایک سے کم نہیں، ہر معلوم کا خلاصہ احدیت ہے جو صرف اللہ کو جاننے والے کے لیے معلوم ہے۔ اور اس مسئلے پر ابن السید البطلیوسی کے سوا کسی نے تنبیہ نہیں کی، کیونکہ انہوں نے اپنے کلام میں جو ہمیں ملا ہے، کہا ہے کہ انسان کا مرتبہ عالم میں جتنا بلند ہوتا ہے، اس کے علوم اتنے ہی کم ہوتے ہیں، اور جتنا وہ اس شریف مرتبے سے نیچے آتا ہے، اس کے علوم اتنے ہی وسیع ہوتے ہیں۔ اور میرا مطلب افعال کے علم سے ہے، اور قلت سے میرا مطلب شہود (الشہود) کے ذریعے ذات کے علم سے ہے۔ اور علمِ توحید میں ان کی رائے فیثاغورثیوں کی رائے تھی، اور وہ وہ قوم ہیں جنہوں نے توحید کو عدد کے ذریعے ثابت کیا اور اسے حق (الحق) کی احدیت پر دلیل بنایا، اور عقلمندوں کی ایک جماعت اسی پر ہے۔ اور اس میں اس ثابت علم کا علم ہے جو دنیا اور آخرت میں زوال قبول نہیں کرتا۔ اور اس میں ان لوگوں کے لیے دلائل قائم کرنے کا علم ہے جو امر (الأمر) کو صرف فکری نظر سے جانتے ہیں۔ اور اس میں اس چیز کا علم ہے جو صرف اللہ کی طرف منسوب کی جا سکتی ہے، پس اگر اسے غیر اللہ کی طرف منسوب کیا جائے تو جو اس علم کو جانتا ہے اس کے نزدیک یہ اس شخص کی جہالت پر دلالت کرتا ہے جو اسے غیر اللہ کی طرف منسوب کرتا ہے۔ اور اس میں اس علم کا بیان ہے کہ تمام موجودات اللہ کی طرف سے عطا کردہ نعمتیں ہیں، اور اس شخص کا علم ہے جس پر اللہ نے یہ نعمتیں عطا کیں، اور کیا یہ منعم علیہ (جس پر انعام کیا گیا) نعمتوں کے مجموعے میں سے ہے؟ پس نعمت کا عین ہی منعم (جس پر انعام کیا گیا) کا عین ہو گا۔ پس یہ جان لو۔\n\n***\n\n### \\[زندگی میں موت کا علم اور موت میں زندگی کا علم]\n\nاور اس میں زندگی میں موت کا علم اور موت میں زندگی کا علم ہے، اور یہ کہ وہ کون ہے جو زندہ ہے اور نہیں مرتا، اور وہ کون ہے جو مردہ ہے اور زندہ نہیں ہوتا، اور وہ کون ہے جو مرتا اور زندہ ہوتا ہے، اور وہ کون ہے جو نہ مرتا ہے اور نہ زندہ ہوتا ہے۔ اور اس میں عالم میں انکار کے وجود کا سبب ہے، اور یہ کہ وہ حضرتِ الٰہیہ سے کیوں منسوب ہوتا ہے؟ اور کیا اس کا اپنے بندے سے یہ کہنا، جب اس کی طرف وہ امور منسوب کیے جاتے ہیں جن کے کرنے سے منع کیا گیا ہے، کہ *وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ* (اور جو برائی تمہیں پہنچتی ہے، وہ تمہاری اپنی جان کی طرف سے ہے)، اللہ کی طرف سے اس فعل کی نسبت سے انکارِ الٰہی ہے؟ اور اسے منکر کیوں کہا گیا حالانکہ وہ معروف ہے؟ اور اس کا فرمان: *الَّذِينَ يَأْمُرُونَ بِالْمَعْرُوفِ* (جو نیکی کا حکم دیتے ہیں)، اور وہ اس چیز کا حکم دینا ہے جو اس کے لیے معلوم ہے، اور *وَيَنْهَوْنَ عَنِ الْمُنْكَرِ* (اور برائی سے روکتے ہیں)، اور وہ اس چیز کا حکم دینا ہے جو اس کے نزدیک نکرہ (نامعلوم) ہونے کی وجہ سے معلوم نہیں ہے۔ اور چونکہ منکر اس فعل کو کرنا ہے جس کے ترک کا حکم دیا گیا ہو، یا اس فعل کو ترک کرنا ہے جس کے کرنے کا حکم دیا گیا ہو، اور اسے منکر کا مرتکب نہیں کہا جاتا جب تک یہ معلوم نہ ہو جائے کہ وہ عمل مامور بہ ہے یا ممنوع عنہ، تو اس کے لیے منکر کا نام صحیح ہوا، اس حیرت کی وجہ سے جو بندے کو اس میں لاحق ہوتی ہے اور دونوں پہلوؤں میں سے کسی ایک کی طرف اس کا نہ نکل پانا۔ پس اگر وہ اسے بعض امور میں حق (الحق) کی طرف منسوب کرے تو ادب یا دلیلِ حسی، عقلی اور سمعی اس کے آڑے آتی ہے، پس اس عمل سے معرفت (المعرفۃ) کی صفت سلب ہو جاتی ہے اور وہ نکرہ (نامعلوم) سے ملحق ہو جاتا ہے۔ اور چونکہ منکر مذموم افعال کے ساتھ خاص ہے نہ کہ محمود کے ساتھ۔ اور اس میں اللہ کا متکبر کی مذمت کرنا ہے، حالانکہ کبریاء اس کی صفت ہے۔ اور اللہ عزوجل جانتا ہے کہ کسی انسان کے دل میں اللہ کے خلاف کبر داخل نہیں ہوتا، بلکہ اس کے دل میں اللہ کی مخلوق کے خلاف کبر داخل ہوتا ہے، اور یہی وہ چیز ہے جو اس سے زائل کی جاتی ہے، اور تب وہ جنت میں داخل ہوتا ہے۔ کیونکہ جس کے دل میں غیر اللہ کے خلاف ایک ذرہ برابر بھی کبر ہو، وہ جنت میں داخل نہیں ہو گا جب تک وہ زائل نہ ہو جائے۔ اور اللہ کے خلاف کبر محال ہے، کیونکہ اللہ نے دلوں کو اس کے لیے تواضع پر پیدا کیا ہے۔ اور اگر بعض اشخاص سے اللہ کے امر (الأمر) کے خلاف کبر کی صورت ظاہر ہو، جو واسطوں یعنی رسولوں علیہم السلام کے ذریعے اللہ کی طرف سے آیا ہے، نہ کہ اللہ پر، کیونکہ مخلوق کی طرف سے اس پر کبر محال ہے، کیونکہ اس کے لیے افتقار ذاتی ہے، اور انسان کے لیے اپنی ذات سے جاہل ہونا ممکن نہیں ہے۔ اور اس میں حیل (تدابیر)، کفالت، اور حق کا حقدار سے کفیل کی طرف منتقل ہونے، اور جس سے حق منتقل ہوا اس کی براءت کا علم ہے۔ اور اس میں اس سبب کا علم ہے جس نے انسان کے لیے واجب کیا کہ اسے اس کے مامون مقام سے پکڑا جائے۔ اور اس میں تسلیم اور تفویض کا علم ہے۔ اور اس میں موت کے وقت مخلوق کے احوال کے اختلاف کا علم ہے، اس کا سبب کیا ہے؟ اور انہیں فطرت پر کیوں نہیں قبض کیا گیا جیسا کہ وہ اس پر پیدا ہوئے تھے؟ اور کس چیز نے انہیں فطرت سے نکالا یا ان میں سے بعض کو نکالا؟ اور فطرت کیا ہے؟ اور کیا اس سے نکلنا صحیح ہے یا نہیں؟ اور لوگوں سے عہد لینے میں اللہ تعالیٰ کی اپنی مخلوق پر رحمت کا علم ہے، جب اللہ نے انہیں ان کے آباء کی پشتوں سے نکالا اور انہیں ان پر اپنی ربوبیت (الربوبية) پر گواہ بنایا، تو انہوں نے کہا: ہاں، تو ہمارا رب ہے۔ اور اس نے انہیں اپنی توحید پر گواہ نہیں بنایا، ان پر شفقت کرتے ہوئے، کیونکہ وہ جانتا تھا کہ ان میں سے بعض دنیا میں آ کر اس کے ساتھ شرک کریں گے، اور قیامت کے دن، روزِ عرضِ اکبر، شریک سے اس کی براءت کا علم ہے۔ اور اس میں قیامت کے دن محاجہ (حجت بازی) کا علم ہے، اور حجتِ داحضہ (باطل حجت) اور حجتِ بالغہ (کامل حجت) کے درمیان فرق کا علم ہے۔ اور وہ کون سا مقام ہے جہاں انسان کے بارے میں کہا جائے گا: *لَا يُسْأَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْأَلُونَ* (وہ جو کچھ کرتا ہے اس کے بارے میں اس سے سوال نہیں کیا جائے گا، اور ان سے سوال کیا جائے گا)۔ اور اس میں اس چیز کا علم ہے جو اللہ تعالیٰ کی طرف سے تبلیغ کرنے والوں پر واجب ہے، رسول اور وارث پر۔ اور اس میں اس چیز کا علم ہے جو اللہ کے امر (الأمر) سے کی جاتی ہے اور جس سے اجتناب کیا جاتا ہے، اور ان کے احکام اس بارے میں واضح دلیل کے ساتھ اور بغیر دلیل کے۔ اور اس میں اس چیز کا علم ہے جس میں عقلی طور پر تبدیلی ممکن نہیں، باوجود اس کے کہ عقلی طور پر یہ ممکن ہو، اور عقول کے دلائل میں نسخ کیسے داخل ہوتا ہے جیسا کہ شرائع کے احکام میں داخل ہوتا ہے۔ اور اس میں اللہ پر تحکم (حکم چلانے) کا علم ہے، کیا اہل اللہ میں سے کسی کے لیے اللہ کے امر (الأمر) کے بغیر یہ جائز ہے یا نہیں؟ اور اس میں اس علم کا بیان ہے کہ اللہ عالم میں سے اسے کیسے وجود بخشتا ہے جو اسے وجود بخشتا ہے۔ اور اس میں اس علم کا بیان ہے کہ کیا مکروہ اور نقصان کو دور کرنے میں اللہ پر اعتماد کا عین، منعم علیہ (جس پر انعام کیا گیا) پر نعمتوں کو باقی رکھنے میں اس پر اعتماد کا عین ہے؟ اور ان دونوں اعتمادوں میں سے ہر ایک کس اسمِ الٰہی پر ہوتا ہے؟ اور اس میں اس شخص کی صفت کا علم ہے جس سے اس علم کے بارے میں سوال کرنا چاہیے جو اس پر عمل کرنے والے کو سعادت عطا کرتا ہے۔ اور اس میں اس سبب کا علم ہے جو اس شخص میں خوف پیدا کرتا ہے جسے اللہ نے دنیا میں امان دی ہے، اور آخرت میں اس کا خوف ختم ہو جاتا ہے، اور امان کے ساتھ اخذِ الٰہی کے مختلف طریقوں کا علم ہے۔ اور اس میں اشخاص سے موجود ہونے والی صورتوں کے منتقل ہونے کا علم ہے، جو اپنے انتقال میں اللہ کا چہرہ (وجہ اللہ) تلاش کرتی ہیں، اور وہ ان اشخاص کے سائے کی طرح ہیں جو نور کے استقبال یا پیٹھ پھیرنے پر ظاہر ہوتے ہیں، یا وہ نور ان کے دائیں یا بائیں ہوتا ہے۔ اور اس میں اس نفی کا علم ہے کہ حق (الحق) کو مجموعی طور پر معبود بنایا جائے، اور کیا اسے مجموعی کے علاوہ کسی اور طریقے سے معبود بنایا جا سکتا ہے یا نہیں؟ کیونکہ وہ اپنی عین (حقیقت) کے لحاظ سے الٰہ ہے، نہ کہ اتخاذ (بنائے جانے) سے۔ پس یہ جان لو۔ اور اس میں اس دین کا علم ہے جو اللہ کا ہے اور اس کا جو بندے کا ہے: *أَلَا لِلَّهِ الدِّينُ الْخَالِصُ* (خبردار! خالص دین اللہ ہی کے لیے ہے)۔ اور کیا وہ دین جس میں مشقت شامل ہو، اللہ کا ہے؟ کیونکہ وہ فرماتا ہے: *وَمَا جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ* (اور اس نے تم پر دین میں کوئی تنگی نہیں رکھی)۔ اور فرمایا: *يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ* (اللہ تمہارے لیے آسانی چاہتا ہے اور تمہارے لیے تنگی نہیں چاہتا)۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"اللہ کا دین آسان ہے۔\" اور فرمایا: \"میں حنیفیہ سمحہ (آسان اور سیدھے دین) کے ساتھ بھیجا گیا ہوں۔\" جیسا کہ یہ بھی فرمایا: *وَلَهُ الدِّينُ وَاصِبًا* (اور اسی کے لیے ہمیشہ رہنے والا دین ہے)۔ اور فرمایا: \"جو اس دین سے مقابلہ کرے گا، وہ اس پر غالب آ جائے گا۔\" اور فرمایا: *لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا* (اللہ کسی جان کو اس کی طاقت سے زیادہ تکلیف نہیں دیتا)، کیونکہ اس نے اسے صرف وہی تکلیف دی جس کی طاقت اسے عطا کی۔ اور اس میں نعمتوں کو اللہ کی طرف لوٹانے کا علم ہے۔ اور انسان پر مصیبت کے شہود (الشهود) کا غلبہ کیوں ہوتا ہے، یہاں تک کہ وہ اس میں موجود نعمتوں کے ذائقے کے درمیان حائل ہو جاتا ہے، یہاں تک کہ وہ بلا سے تنگ آ جاتا ہے؟ اور یہ عمر بن خطاب رضی اللہ عنہ کا مقام تھا، وہ بلا میں بلا کی نعمتوں کا شہود (الشہود) کرتے تھے، پس ایک ہی لمحے میں صبر اور شکر کو جمع کرتے تھے، اور وہ دو عملوں کے مالک تھے۔ اور اس میں نعمتوں کے ذریعے استدراج کا علم ہے۔ اور اس میں اس شخص کے حکم کا علم ہے جو حق (الحق) کے ساتھ اپنی جہالت سے معاملہ کرتا ہے، حالانکہ وہ اپنے دل میں سمجھتا ہے کہ وہ اس بارے میں علم رکھتا ہے۔ اور اس میں تعریہ (ننگا کرنے) کا علم ہے۔ اور اس میں مفتی اور فتویٰ کی صفت کا علم ہے، اور مفتی کب فتویٰ دیتا ہے؟ کیا استفتاء (سوال) کے بعد یا وہ فتویٰ دیتا ہے اگرچہ استفتاء نہ کیا گیا ہو؟ اور کیا مفتی کو اس بارے میں امام کی اجازت کی ضرورت ہوتی ہے یا نہیں؟ اور اس میں موجودات میں نظر کرنے سے علوم کے استخراج اور ان کی تفصیلات کا علم ہے۔ اور اس میں وحی کی اقسام اور اس کی صورتوں کا علم ہے، اور وہ وحی جو اولیاءِ اتباع کے ساتھ خاص ہے، اور وہ وحی جس میں نبی شریک نہیں ہوتا۔ اور اس میں ہر معلوم کے وجوہ کے احاطے کا علم ہے، وہ عالم کون ہے اور اس کی صفت کیا ہے؟ اور اس میں صفات کے تفاضل کا علم ہے کہ وہ کس چیز کی طرف لوٹتا ہے۔ اور اس میں روحانی رزق کا علم ہے، اور وہ کون سا رزق ہے جس کے تناول میں دلوں کی زندگی ہے، اس رزق سے جو دلوں کی موت کا سبب بنتا ہے؟ کیونکہ موت بھوک سے بھی ہو سکتی ہے اور شکم سیری اور بھرے ہونے سے بھی۔ اور وہ کون سا رزق ہے جس سے سیری ہوتی ہے، اور وہ رزق جس سے سیری نہیں ہوتی، اور وہ رزق جس میں تمام عالم برابر ہیں، اور وہ رزق جو بعض عالم کے ساتھ خاص ہے اور بعض کے ساتھ نہیں۔ اور اس میں رازق کے علم کا علم ہے، اور یہ کہ وہ عبادت کا زیادہ حقدار ہے، کیونکہ مرزوق رزق کا محتاج ہے۔ اور اس میں حرکت اور سکون کا علم ہے، اور مقام کا زیادہ حقدار کون ہے، متحرک یا ساکن؟ اور متحرک اور ساکن کا قصہ جب انہوں نے اس کے عالم کے پاس ذوقاً فیصلہ کے لیے رجوع کیا اور ان کے ساتھ کیا ہوا۔ اور یہ کہ رزق کا مالک وہ ہے جو اسے کھاتا ہے نہ کہ وہ جو اسے جمع کرتا ہے۔ اور حق تعالیٰ (الحق) نے لقمان حکیم کے بارے میں خبر دی، جو انہوں نے اپنے بیٹے کو نصیحت کی: *يَا بُنَيَّ إِنَّهَا إِنْ تَكُ مِثْقَالَ حَبَّةٍ مِنْ خَرْدَلٍ فَتَكُنْ فِي صَخْرَةٍ أَوْ فِي السَّمَاوَاتِ أَوْ فِي الْأَرْضِ يَأْتِ بِهَا اللَّهُ* (اے میرے بیٹے! اگر کوئی چیز رائی کے دانے کے برابر بھی ہو، پھر وہ کسی چٹان میں ہو یا آسمانوں میں یا زمین میں، تو اللہ اسے لے آئے گا)۔ اور یہ نہیں کہا کہ اس کی طرف لے آئے گا۔ اور اس میں عدل اور حقوق کی ادائیگی کا علم ہے۔ اور اس میں علم کے بعد نسیان کا علم ہے، یہاں تک کہ اسے یہ بھی معلوم نہیں ہوتا کہ اس نے وہ چیز کبھی جانی بھی تھی جسے وہ بھول چکا ہے۔ اور اس میں اسمِ الٰہی الواقی (حفاظت کرنے والا) کا علم ہے، اور عالم میں اس کی صورتوں کا اختلاف، جیسے اسمِ الرزاق کا اختلاف۔ اور اس میں مشاہدہ کرنے والے پر رؤیت کی حالت میں حال کے اختلاف کا علم ہے۔ اور اس میں اس شخص کا علم ہے جو لوگوں کو اس چیز کی طرف بلاتا ہے جس پر وہ خود ہے، تاکہ وہ داعیِ حق ہو۔ اور اس میں اوامرِ الٰہیہ کا علم ہے۔ اور اس میں محسن اور احسان کا علم ہے۔ اور اس میں انساب کا علم ہے، اور نبی صلی اللہ علیہ وسلم کا فرمان: \"بیشک تمہارا رب ایک ہے اور تمہارا باپ ایک ہے، پس کسی عربی کو کسی عجمی پر اور کسی عجمی کو کسی عربی پر کوئی فضیلت نہیں مگر تقویٰ کے ساتھ۔ بیشک اللہ فرماتا ہے: آج میں تمہارے نسب کو بلند کرتا ہوں اور اپنے نسب کو پست کرتا ہوں، متقی کہاں ہیں؟\" اور حق تعالیٰ (الحق) نے فرمایا: *إِنَّ أَكْرَمَكُمْ عِنْدَ اللَّهِ أَتْقَاكُمْ* (بیشک تم میں سے اللہ کے نزدیک سب سے زیادہ عزت والا وہ ہے جو سب سے زیادہ متقی ہے)۔ پس کیا متقی وہ ہے جو اللہ کے لیے وقایہ (حفاظت) ہو، یا وہ جو اللہ کو وقایہ بنائے؟ اور اس کے لیے بھی رجال ہیں اور اس کے لیے بھی رجال ہیں۔ اور اس میں ایلاء (قسم کھا کر بیوی سے دوری اختیار کرنا) اور اس کی اقسام اور مولیٰ (قسم کھانے والے) کے بارے میں اس کے احکام کا علم ہے، اور ایلاء کی صورت، اور اس میں سے جو اللہ کے لیے ہے اور جو بندے کے لیے ہے۔ اور اس میں اس علم کا بیان ہے کہ عامل عالم اپنی دنیا میں اپنے نفس میں ایک جلدی والی جنت میں ہے، اگرچہ اس کا حال برا ہو، تو اس کے نفس میں اس کی نعمت سب سے بڑی نعمت ہے۔ اور اس میں قرآن میں مداخلت کا علم ہے، باوجود اس کے کہ وہ اللہ کی طرف سے محفوظ ہے، پس قرآن میں کوئی تحریف یا تبدیلی صحیح نہیں، جیسا کہ دیگر نازل شدہ کتابوں میں واقع ہوا۔ اور اس میں نسخ کیا ہے، اس کا علم ہے۔ اور اس میں اس شخص کے حکم کا علم ہے جس کا ظاہر اس کے باطن کے خلاف ہو، شہود (الشہود) کی بنا پر۔ اور اس میں انسان کا اپنے نفس کی تعظیم کی وجہ سے اسے خود سے دور کرنے کا علم ہے، جب اس نے دیکھا کہ اللہ نے اس کے حق کی تعظیم کی ہے کہ جس نے خود کو قتل کیا اس پر جنت حرام کر دی، اگرچہ خود کو قتل کرنے والا جہنم میں صرف اپنی نفسِ حیوانی کے ساتھ داخل ہو گا، کیونکہ جہنم نفسِ ناطقہ کا ٹھکانہ نہیں ہے، اور اگر وہ اس پر جھانک بھی لے تو اس کا شعلہ بلا شبہ بجھ جائے گا، کیونکہ اس کا نور زیادہ عظیم ہے۔ پس جس نے خود کو قتل کیا، اس کا جرم قریب ترین پڑوسی کے حق کی وجہ سے عظیم ہوا، اور اس طرح اس نے اس کے اور اس کی ملکیت کے درمیان رکاوٹ ڈال دی، اور اس کے نفس کے علاوہ جو کچھ ہے وہ اس خاص قرب سے دور ہے جو اس کے نفس کے لیے ہے۔ اور اس میں اس چیز کا علم ہے جو حلال اور حرام کی گئی، کیا وہ اپنے لیے حرام یا حلال کی گئی، یا مخصوص امور اور حالات کے لیے حرام اور حلال کی گئی، حرام کرنے والے اور جس پر حرام کیا گیا اس کے حق میں؟ اور حلال کرنے والا اور حرام کرنے والا صرف اللہ ہے، شرع کی زبان سے، رسول صلی اللہ علیہ وسلم کی زبان سے، یا فقہاء جیسے علماءِ رسوم کے مجتہد کی زبان سے۔ اور اس میں احوال کی تبدیلی کی وجہ سے اقبالِ الٰہی کے بدلنے کا علم ہے۔ اور اس میں عظیم کو جماعت کے مقام پر قائم کرنے کا علم ہے۔ اور اس میں علماء اور عارفین جو اللہ کی طرف بلانے والے ہیں، ان کے مخاطبات میں سیاستوں کا علم ہے۔ اور اس میں مماثل کے ساتھ بدلہ دینے کا علم ہے، خواہ وہ کسی بھی نوعیت کا ہو، اور اس میں سے جو سب قابل تعریف ہے اور جو قابل مذمت ہے۔ اور اس میں معیتِ الٰہیہ کا علم ہے: *وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ* (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و شصت و هشتم: در معرفت منزل افعال، مانند «آمد و نیامد» و حضرت امر به تنهایی\n\nإذا كان غير الجنس مثلي في الفصل *** فأين امتيازي بالحديث عن النحل‏\nاگر غیر جنس من در فصل (تمایز) مانند من باشد *** پس امتیاز من در سخن گفتن از زنبور عسل کجاست؟\nأنا ناطق والطير مثلي ناطق *** كما جاء في القرآن في سورة النمل‏\nمن ناطقم و پرنده نیز مانند من ناطق است *** چنانکه در قرآن در سوره نمل آمده است.\nفلا تفرحن إلا بما أنت واحد *** به فوجود الشكل يأنس بالشكل‏\nپس شاد مباش مگر به آنچه که تو به واسطه آن یگانه هستی *** زیرا وجود شکل با شکل مأنوس می‌شود.\nلقد كان لي شيخ عزير مقدس *** يقول بتفضيل الأمور وبالوصل‏\nبه راستی که من شیخی گرامی و مقدس داشتم *** که به برتری دادن امور و به وصل (اتصال) قائل بود.\n\n[به راستی که در قرآن، امر آینده به لفظ گذشته آمده است به دلیل تحقق وقوع آن]\n\nخداوند متعال می‌فرماید: «وَإِذْ قَالَ اللَّهُ يَا عِيسَى ابْنَ مَرْيَمَ أَأَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وَأُمِّيَ إِلَهَيْنِ مِنْ دُونِ اللَّهِ» (و [یاد کن] هنگامی را که خداوند فرمود: ای عیسی پسر مریم، آیا تو به مردم گفتی که من و مادرم را به جای خدا، دو معبود بگیرید؟). این سخن جز در روز قیامت واقع نمی‌شود، پس چون وقوع آن حتمی است، با لفظ ماضی (گذشته) از آینده تعبیر شده است، زیرا وقوع آن قطعی و ضروری است و حکم امکان (احتمال) در آن زائل شده و به حکم وجوب (ضرورت) تبدیل گشته است. هر آنچه چنین باشد، حکم ماضی و مستقبل در آن یکسان است، و بیان آن به صیغه ماضی در وقوع و تحقق آن مؤکدتر است تا باقی ماندن بر صیغه استقبال (آینده).\n\nای ولیّ، بدان که خداوند تو را به حق (الحق) سعادتمند گرداند و به آن گویا سازد، گروهی از اهل الله (عرفا) در امری که از جانب خداوند متعال آمده، دچار اشتباه شده‌اند. ما با اشتباه آنان موافقت کردیم و در عین حال موافقت نکردیم، بلکه اقوالشان را به دلیل انتسابشان به خداوند جاری ساختیم تا جز اهل حق و صدق به او سبحانه و تعالی منسوب نشوند. آن امری که در آن اشتباه کردند، علم به حقی است که خلق به واسطه آن صورت گرفته است، و آنان این «مخلوق به» را یک عین موجود پنداشتند، زیرا شنیدند که خداوند می‌فرماید: «إِنَّهُ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ» (او آسمان‌ها و زمین را به حق آفرید) و آیات مشابهی که در قرآن آمده است. در اینجا حرف «باء» به معنای «لام» است. به همین دلیل خداوند متعال در ادامه آیه می‌فرماید: «فَتَعَالَى اللَّهُ عَمَّا يُشْرِكُونَ» (پس خداوند برتر است از آنچه شریک می‌سازند) به خاطر همین حرف «باء». و امر در ذات خود، در حق آسمان و زمین و آنچه میان آن دو نازل شده، تا جایی که تمام الوجود (الوجود) را در بر می‌گیرد، مانند قول اوست: «وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ» (و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند). همچنین آسمان‌ها و زمین را نیافرید مگر «بالحق» یعنی «للحق» (برای حق). پس لامی که در اینجا جانشین باء شده، عین همان لامی است که در «لِيَعْبُدُونِ» آمده است. پس آسمان‌ها و زمین را برای حق آفرید، و حق این است که او را بپرستند. به همین دلیل فرمود: «فَتَعَالَى اللَّهُ عَمَّا يُشْرِكُونَ». و شرک همان ظلم عظیم است. و هیچ موجودی جز از این نوع انسانی ظاهر نشده است. و جن در آفرینش برای عبادت همراه انسان ذکر نشده، مگر به این دلیل که انسان را به شرک اغوا می‌کند، نه اینکه خود شرک ورزیده باشد. و این انسان است که شرک ورزیده است. این در صورتی است که جن عبارت از باطن انسان نباشد. در این صورت گویا می‌فرماید: و جن را که همان امر پنهان و باطن انسان است، و انس را که همان امر آشکار و ظاهر اوست، نیافریدم مگر برای آنکه مرا بپرستند، ظاهراً و باطناً.\n\nسپس فرمود: «أَوَلَمْ يَرَ الْإِنْسَانُ أَنَّا خَلَقْنَاهُ مِنْ نُطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُبِينٌ» (آیا انسان ندیده است که ما او را از نطفه‌ای آفریدیم، پس ناگهان او ستیزه‌جویی آشکار است؟) یعنی خصومت او آشکار و واضح است. و فرمود: «خَلَقَ الْإِنْسَانَ مِنْ نُطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُبِينٌ» (انسان را از نطفه‌ای آفرید، پس ناگهان او ستیزه‌جویی آشکار است). و این به دلیل ادعای او در ربوبیت است، در حالی که خداوند او را جز بنده نیافریده است، پس از حد خود تجاوز می‌کند و با پروردگارش در ربوبیت او به نزاع برمی‌خیزد. و هیچ مخلوقی جز او با پروردگارش نزاع نکرده است. و خصومت او را به «آشکار بودن» توصیف کرد، برخلاف کسانی که از ملأ اعلی و غیر ایشان به خصومت توصیف شده‌اند، و این در ادعای غیر ربوبیت است. زیرا هیچ نزاعی از مخلوقی در امری غیر از ادعای ربوبیت نیست، مگر اینکه ممکن است حق با او باشد و بر شنونده و حاکم پنهان بماند، و نداند که آیا حق با اوست یا با خصمش، و آیا در ادعای خود صادق است یا کاذب، به دلیل احتمالی که در آن راه دارد. مگر ادعای او در ربوبیت، که او خود می‌داند و هر شنونده‌ای از خلق خدا می‌داند که او در ادعای خود دروغگوست و بنده است و خداوند او را برای همین آفریده است. به همین دلیل درباره او گفته شده است که «خصیم مبین» (ستیزه‌جوی آشکار) است، یعنی ظلم او در خصومتش آشکار است. پس حال کسی که با پروردگارش در ربوبیت او نزاع کند چگونه خواهد بود؟ سپس این انسان، ای کاش تنها در حق خودش در این امر می‌کوشید، زیرا او خود می‌داند که بهره‌ای از ربوبیت ندارد، اما سپس به ربوبیت برای مخلوقی از مخلوقات خدا، از سنگ یا گیاه یا حیوان یا انسانی مانند خودش یا جن یا فرشته یا ستاره، اعتراف می‌کند. زیرا هیچ صنفی از مخلوقات باقی نمانده است مگر اینکه از آن پرستش شده است، و آن را جز انسان حیوانی (الإنسان الحيوان) نپرستیده است. پس بدبخت‌ترین مردم کسی است که آخرت خود را به دنیای دیگری بفروشد، و کسی که در راه چیزی هلاک شود که هیچ بهره‌ای از آن به دستش نمی‌رسد، بر خود گواهی می‌دهد که نادان‌ترین مردم نسبت به دیگران و داناترین مردم نسبت به خود است، زیرا آن را برای خود ادعا نکرده است. و کسی که آن را برای خود ادعا کرد، تنها «فَاسْتَخَفَّ قَوْمَهُ فَأَطَاعُوهُ» (قوم خود را سبک شمرد، پس از او اطاعت کردند)، در حالی که او خود خلاف آن را می‌دانست. به همین دلیل فرعون گفت: «مَا عَلِمْتُ لَكُمْ مِنْ إِلَهٍ غَيْرِي» (من برای شما معبودی جز خودم نمی‌شناسم)، یعنی در اعتقاد شما.\n\n[اینکه حق تعالی چیزی را به واسطه چیزی نمی‌آفریند، بلکه چیزی را در نزد چیزی می‌آفریند]\n\nو بدان که حق تعالی (الحق تعالی) چیزی را به واسطه چیزی نمی‌آفریند، بلکه چیزی را در نزد چیزی می‌آفریند. پس هر آنچه که مستلزم استعانت و سببیت باشد، لام حکمت است. خداوند هیچ چیز را نیافرید مگر برای حق (الحق)، و حق این است که او را بپرستند، «فَإِذَا هُوَ خَصِيمٌ مُبِينٌ» (پس ناگهان او ستیزه‌جویی آشکار است). و این نیست مگر از کوری قلب‌هایی که در سینه‌هاست نسبت به حق (الحق). اگر این قلب‌ها از حق روی‌گردان نبودند و به آن روی می‌آوردند، حق را می‌دیدند و به ربوبیت او در هر چیزی اقرار می‌کردند و هیچ کس را در عبادت پروردگارشان شریک نمی‌ساختند. به همین دلیل فرمود: «فَمَنْ كَانَ يَرْجُو لِقَاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صَالِحًا» (پس هر کس امید دیدار پروردگارش را دارد، باید کار شایسته انجام دهد). و عمل صالح آن است که خللی در آن راه نیابد. اگر خللی در آن ظاهر شود، صالح نیست. و خلل در عمل و عدم صلاح آن، چیزی جز شرک نیست. پس فرمود: «وَلَا يُشْرِكْ بِعِبَادَةِ رَبِّهِ أَحَدًا» (و هیچ کس را در عبادت پروردگارش شریک نسازد). پس «أحداً» (هیچ کس) نکره آمد تا شامل هر کسی شود که نام «احد» بر او اطلاق می‌گردد، و آن هر چیزی در عالم خلق و امر است. و شامل شرک اصغر نیز می‌شود، که همان شرک در عموم است و آن ربوبیت پنهانی است که در مواردی مانند «من انجام دادم»، «من ساختم»، «فلانی انجام داد» و «اگر فلانی نبود» نقض می‌شود. این شرک، شرک مغفور است، زیرا اگر صاحبان این قول را در آن مورد بازخواست کنی، به سوی خداوند متعال باز می‌گردند. و اما شرک در خصوص، آنان کسانی هستند که «الَّذِينَ يَجْعَلُونَ مَعَ اللَّهِ إِلَهًا آخَرَ» (کسانی که با خدا معبود دیگری قرار می‌دهند)، و این همان ظلم عظیمی است که به این موجودی که او را معبود دیگری با خدا نامیدند، روا داشتند. پس به خداوند در وحدانیت الوهیت او ظلم کردند و به شریک نیز در نسبت الوهیت به او ظلم کردند. پس خداوند آنان را به دلیل ظلم به شریک مؤاخذه می‌کند، نه به دلیل ظلم به احدیت او. زیرا آن کسی که او را شریک قرار دادند، در روز قیامت از آنان بیزاری می‌جوید، آنجا که حقوق به صاحبان مستحق خود باز می‌گردد. پس بر حقیقت این است که خداوند چیزی را به واسطه چیزی نمی‌آفریند، و اگر آن را برای چیزی می‌آفریند، آن لام حکمت است، و عین آفرینش او عین حکمت است، زیرا آفرینش او معلول نیست. پس خلق ذاتاً بنده است و عوارض در او تأثیر گذاشته‌اند، به ویژه شخص انسانی. بلکه عوارض تنها در شخص انسانی تأثیر گذاشته‌اند، نه در سایر مخلوقات. و غیر انسان بر اصل خود باقی است که تنزیه خالقش از شریک است. به همین دلیل فرمود: «وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لَا تَفْقَهُونَ» (و هیچ چیز نیست مگر اینکه با ستایش او تسبیح می‌گوید، ولی شما تسبیح آنها را در نمی‌یابید). و این ضمیر جمع در «تَفْقَهُونَ» (در نمی‌یابید) تنها به انسان‌ها اختصاص دارد. پس همه مخلوقات خداوند را عبادت کردند مگر برخی از انسان‌ها. پس انسان «أَلَدُّ الْخِصَامِ» (سخت‌ترین ستیزه‌جویان) است، زیرا در امری که ظلم در آن آشکار است، نزاع می‌کند، و آن چیزی جز ربوبیت نیست. آیا دیده‌اید که بنده‌ای با پروردگارش نزاع کند، مگر زمانی که از بندگی خود خارج شود و با مولای خود در ربوبیت او رقابت کند و برای خود مالکیتی ادعا کند؟ پس اگر مولایش در آن تصرف کند، با او نزاع و خصومت می‌کند. پس هیچ خصومتی از بنده در مورد بندگی واقع نشده است، بلکه در مورد چیزی واقع شده که پروردگار، رب و مالک آن است. و بسیاری از اهل الله (عرفا) از علما هستند که نامشان را نمی‌برم و ذکر نمی‌کنم، زیرا این نسبت دادن به آنان، تصریح به جهلشان است، لذا با آنان با ادب رفتار کردم. آنان «مخلوق به» را به دو صورت تقریر کرده‌اند: برخی از آنان این حق مخلوق به را عین علت خلق قرار داده‌اند، در حالی که حق تعالی (الحق تعالی) آفرینش خود را معلول نمی‌سازد. این همان صحیح در ذات خود است، به طوری که امری در آن تصور نمی‌شود که آنچه از خلق او ظاهر شده را بر او واجب سازد، بلکه خلق را از روی منت بر خلق و آغاز فضل آفرید، و او از جهانیان بی‌نیاز است. و برخی از آنان این حق مخلوق به را عین موجودی قرار داده‌اند که خداوند ما سوی (غیر خود) را به واسطه آن آفریده است. و اینان همان کسانی هستند که می‌گویند: از واحد جز واحد صادر نشده است، و صدور آن واحد، صدور معلول از علتی بوده که آن علت صدور آن را واجب ساخته است. و این قول جای بحث دارد. و آنچه من می‌گویم این است که:\n\nإذا جاء أمر الله فالآمر الأمر *** وذلك توحيد إلى من له الأمر\nچون امر خدا آید، پس امرکننده همان امر است *** و این توحیدی است به سوی کسی که امر از آن اوست.\nفلا تشركوا فالشرك ظلم مبرهن *** عليه وهذا الظلم قد عمه الحجر\nپس شرک نورزید، زیرا شرک ظلمی است که بر آن برهان اقامه شده *** و این ظلم سنگ را نیز فرا گرفته است.\n\nو چون علم، قلب‌ها را زنده می‌کند، همان‌گونه که ارواح، اعیان اجسام را زنده می‌سازند، علم «روح» نامیده شد که فرشتگان آن را بر قلب‌های بندگان خدا نازل می‌کنند و آن را القا می‌نمایند و همچنین بدون واسطه در حق بندگانش به آن وحی می‌شود. اما القا و وحی آن، قول خداوند است: «يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ» (روح [وحی] را به فرمان خود بر هر کس از بندگانش که بخواهد القا می‌کند) و قول او: «وَكَذَلِكَ أَوْحَيْنَا إِلَيْكَ رُوحًا مِنْ أَمْرِنَا» (و بدین‌سان روحی از امر خود را به سوی تو وحی کردیم). و اما نازل کردن فرشتگان به واسطه آن بر قلب‌های بندگانش، قول خداوند متعال است: «يُنَزِّلُ الْمَلَائِكَةَ بِالرُّوحِ مِنْ أَمْرِهِ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ» (فرشتگان را با روح [وحی] به فرمان خود بر هر کس از بندگانش که بخواهد نازل می‌کند). پس آنان معلمان و استادان در غیب هستند که کسی که بر او نازل شده‌اند، آنان را مشاهده می‌کند. پس هنگامی که این روح به واسطه نزول فرشته یا القا و وحی خداوند در قلب بنده نازل شود، قلبِ کسی که بر او نازل شده، به واسطه آن زنده می‌شود. پس او صاحب شهود (الشهود) و وجود (الوجود) خواهد بود، نه صاحب فکر و تردید، و نه علمی که در آن خللی راه یابد که صاحبش را از درجه قطع به حال نظر منتقل سازد. پس بنده عالم برگزیده یا عروج می‌کند و می‌بیند، یا در جایگاه خود بر او نازل می‌شود.\n\nإن العروج لرؤية الآيات *** نعت المحقق في شهود الذات‏\nبه راستی که عروج برای دیدن آیات *** صفت محقق در شهود (الشهود) ذات است.\nفانظر بفعل الحال تشهد كونه *** وانظر إلى الماضي يريك الآتي‏\nپس با فعل حال بنگر تا هستی او را مشاهده کنی *** و به گذشته بنگر تا آینده را به تو نشان دهد.\nإن الوجود مبرهن عن نفسه *** بوجوده في أكثر الحالات‏\nبه راستی که الوجود (هستی) با وجود خود *** در بیشتر حالات بر خویشتن برهان می‌آورد.\nفالحال في الأحياء يشهد دائما *** والماضي والآتي مع الأموات‏\nپس حال در زندگان همواره شهادت می‌دهد *** و گذشته و آینده با مردگان است.\n\nاگر کسی که از جانب اینان عذر می‌آورد بگوید: فایده آفرینش انسان کامل (الإنسان الکامل) بر این صورت چیست؟ می‌گوییم: برای آنکه صدور افعال و همه مخلوقات از او ظاهر شود، در حالی که عین او نزد خودش بنده است. زیرا غایت امر الهی این است که حق (الحق) همراه بنده و چشم او، بلکه همه قوای او باشد.\nسپس خداوند متعال فرمود: «فإذا أحببته كنت سمعه وبصره ويده» (پس چون او را دوست بدارم، گوش و چشم و دست او می‌شوم) (حدیث قدسی).\nپس با ضمیر، عین او را بنده اثبات کرد که ربوبیتی برای او نیست، و آنچه را که به واسطه او و بر او و از او ظاهر می‌شود، حق تعالی (الحق تعالی) قرار داد، نه برای بنده. پس این خبر مؤید راهی است که ما رفته‌ایم، و اگر آنان با این خبر عذر می‌آوردند و بر ما احتجاج می‌کردند، همان‌گونه که تو انجام دادی، این خبر علیه آنان بود. و هیچ چیز بالاتر از کلام نبوت نیست، به ویژه در آنچه که پیامبر از جانب خداوند عز و جل خبر داده است.\n\nاگر بگویند: امکان (احتمال) باعث شد که ما آنچه می‌گوییم را بگوییم. می‌گوییم: امکان (احتمال) حکمی وهمی است و معقول نیست، نه در مورد خدا و نه در مورد آنچه ممکن نامیده می‌شود. زیرا این امر ممکن نامیده شده هرگز جز با مرجّح (ترجیح‌دهنده) معقول نیست، و حالت اختیار جز با ترجیح معقول نیست، و این واقع نمی‌شود. پس عقلاً واقع نمی‌شود، اما به صورت وهم واقع می‌گردد، و وهم حکمی عدمی است. پس در آنجا جز واجب بالذات یا واجب بالغیر (واجب به واسطه او) نیست. پس مشیت حق (الحق) در اشیاء یکی است.\n\nوالحق ليس له إلا مشيئته *** وحيدة العين لا شرك يثنيها\nو حق (الحق) را جز مشیت او نیست *** که یگانه عین است و شرکی آن را دوگانه نمی‌سازد.\nوالاختيار محال فرضه فإذا *** أتى فحكمته الإمكان تدريها\nو فرض اختیار محال است، پس اگر *** آمد، حکمتش امکان است که آن را می‌دانی.\nفلا تزال على الترجيح نشأته *** والله بالحال أخفى نفسه فيها\nپس آفرینش او همواره بر ترجیح است *** و خداوند خود را در آن به واسطه حال پنهان کرده است.\nفزال من علمنا الإمكان عن نظر *** في الممكنات فيبديها ويخفيها\nپس امکان از علم ما زائل شد، از نظر *** در ممکنات، که او آنها را آشکار و پنهان می‌سازد.\n\nو هنگامی که امکان (احتمال) زائل شود، اختیار نیز زائل می‌گردد و جز یک عین باقی نمی‌ماند، زیرا مشیت الهی در اشیاء جز یک امر ندارد، و اشیاء همواره بر یک حکم معین از دو حکم باقی می‌مانند. پس امر آن‌گونه نیست که قائل به امکان (احتمال) توهم کرده است. پس ثابت شد که در آنجا جز «حق برای حق» و «حق برای خلق» نیست. حق حق، ربوبیت اوست و حق خلق، عبودیت اوست. پس ما بنده‌ایم، اگرچه به صفات او ظاهر شویم، و او پروردگار ماست، اگرچه به صفات ما ظاهر شود. زیرا صفات نزد محققان (اهل تحقیق) در عین موصوف تأثیری ندارند، و به همین دلیل هنگامی که ضد آنها بیاید، زائل می‌شوند، اما عین (ذات) از بین نمی‌رود، بلکه هستی آن در هر دو حال باقی است. پس ایستاده، عین نشسته است از حیث ذاتش، و ایستاده، نشسته نیست از حیث حکمش. پس ایستاده نمی‌تواند در حال ایستادن بنشیند، و نشسته نمی‌تواند در حال نشستن بایستد. و حق (الحق) جز آنچه امر در ذات خود بر آن است، نخواسته است. پس مشیت حق در امور، عین همان چیزی است که امور بر آن هستند، و حکم زائل می‌شود. زیرا اگر مشیت را خلاف عین امر قرار دهی، یا مشیت باید تابع امر باشد که محال است، و یا امر باید تابع مشیت باشد که آن نیز محال است. و بیان این مطلب آن است که امر، امری است برای ذات خود، هر چه که باشد، و تغییر نمی‌پذیرد. پس به مشیتی که عین آن نیست، مشاء (مورد مشیت) قرار نمی‌گیرد. پس مشیت عین امر است، نه تابعی هست و نه متبوعی. پس از وهم برحذر باش، زیرا وهم سلطانی قوی در نفس دارد که میان نفس و علم صحیحی که عقل سلیم می‌دهد، حائل می‌شود.\n\nو هنگامی که به این منزل وارد شدم، چون به نشانه‌های آن بالا برده شدم، با نشانه‌هایش بر آن استدلال کردم تا پس از تحمل مشقت و طولانی شدن راه، به آن رسیدم. وقتی وارد آن شدم، تصرف در آن برایم دشوار بود، به دلیل مهالکی که در آن بود. آن منزلی تاریک بود که چراغی در آن نبود. پس با حس پا و احتیاط در آن راه می‌رفتم، از ترس افتادن در یکی از مهلکه‌هایش. هنگامی که پایم در جایی که آن را حس می‌کردم اما نمی‌دیدم، محکم می‌شد، شروع به جابه‌جایی می‌کردم و به دنبال جایی می‌گشتم که به آن منتقل شوم. اگر پایم در فضای خالی قرار می‌گرفت، می‌دانستم که در آنجا مهلکه‌ای است. پس با پایم به چپ و راست می‌گشتم تا جایی برای پایم پیدا کنم که در آن مستقر شود، در حالی که بر پای دیگر تکیه داشتم. و همواره این‌گونه بودم که در این ظلمت از مکانی به مکان دیگر منتقل می‌شدم و چیزی نمی‌دیدم، به دلیل نبود نور خارجی که با نور چشم من همراه باشد. پس پای من، چشم من بود. از این طریق، به اندازه‌ای که در آن تصرف کردم، آگاه شدم، در حالی که بر حذر بودم و نمی‌دانستم چه حیوانی در راهم به من آسیب می‌رساند و آن را حس نمی‌کردم تا اینکه آسیب را به من وارد می‌کرد. با این حال، خود را به خطر انداختم، زیرا گفتم: در هر حال من در تاریکی هستم، پس نشستن یا تصرف کردن برایم فرقی ندارد. اگر بنشینم، ایمن نیستم که حیوانی بیاید و به من آسیب برساند، و اگر تصرف کنم نیز از حیوان آسیب‌رسان یا مهلکه‌ای که در آن بیفتم، ایمن نیستم. پس احتیاط در تصرف برایم امیدبخش‌تر است. لذا آن را بر نشستن ترجیح دادم، به طلب فایده. در همین حال بودم که ناگهان نور شرع از بیرون به صورت چراغی روشن به من رسید که هواها آن را تکان نمی‌داد، زیرا در مشکات (طاقچه) بود، و مشکات آن رسول (پیامبر) است. پس از هواهایی که آن را خاموش می‌کنند، محفوظ است. و آن چراغ در شیشه قلب اوست، و جسم او چراغ است و زبان او ترجمان آن، و امداد الهی (الإمداد الإلهی) روغن آن است، و درخت، حضرت امداد اوست. پس نور چشم با این نور خارجی جمع شد و ما مهالک و حیوانات زیان‌آور در راه را کشف کردیم. پس از هر آنچه از آن می‌ترسیدیم و برحذر بودیم، دوری جستیم و در راهی روشن و آشکار قدم گذاشتیم که نه مهلکه‌ای در آن بود و نه حیوان زیان‌آوری. و اگر چیزی به ما نزدیک می‌شد، به دلیل وسعت و آسانی راه و موانع و حصارهایی که در آن بود و مانع ضرر آن حیوانات می‌شد، از آن دوری می‌کردیم. پس «مَنْ لَمْ يَجْعَلِ اللَّهُ لَهُ نُورًا فَمَا لَهُ مِنْ نُورٍ» (کسی که خداوند برای او نوری قرار نداده باشد، پس او هیچ نوری ندارد). و پس از آنکه این چراغ ظاهر شد، خاموش نشد و از بین نرفت. پس هر کس به آن پشت کند و از آن روی بگرداند، در تاریکی ذات خود راه می‌رود، و آن تاریکی، ظلمت اوست. پس او از کسانی است که با روی‌گردانی و پشت کردن به چراغ، بر خود ستم کرده است. این حکم کسی است که شریعت را ترک کند و به نظر خود اکتفا نماید. پس او اگرچه در تلاش خود ثابت قدم باشد، به دلیل تاریکی ذاتش در خطر حیوانات راه است، حتی اگر در مهلکه‌ای نیفتد. پس شایسته است که عاقل در امری که در آن تأنی (آهستگی) جایز است، شتاب نکند، و در امری که حق در مبادرت و سرعت در تحصیل آن است، درنگ ننماید. این فایده عقل در شخص عاقل است.\n\nو در این منزل، علوم بسیاری دیدم، از جمله علم «حاصل در عین فوت شده» (آنچه به دست آمده در ذات آنچه از دست رفته است). زیرا اگر این نبود، تو برتری حاصل بر فوت شده را در حق خود نمی‌دانستی، اگر سعادت تو در آن بود، و نه برتری فوت شده بر حاصل را، اگر فوت شده مطلوب تو بود و اگر به دست می‌آمد تو را بدبخت می‌کرد و تو نمی‌دانستی. پس برتری در حق تو، در از دست رفتن آن بود، زیرا با از دست رفتن آن سعادتمند شدی. و این جز برای کسی که خداوند او را سعادتمند کرده، رخ نمی‌دهد، و آن قول خداوند متعال است: «وَعَسَى أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ وَعَسَى أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمْ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ» (و بسا چیزی را ناخوش دارید و آن برای شما خیر است، و بسا چیزی را دوست دارید و آن برای شما شر است، و خدا می‌داند و شما نمی‌دانید). و از جمله این علوم است:\n\nآنچه روایت شده است که رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) پیش از رسالتش در بادیه به چوپانی مشغول بود. می‌خواست وارد مکه شود تا آنچه را که جوانان در آنجا به دست می‌آورند، به دست آورد. هنگامی که وارد مکه می‌شد و کسی از آشنایانش را نزد گوسفندان می‌گذاشت تا از آنها مراقبت کند تا بازگردد، خداوند خواب را بر او مسلط می‌کرد و از به دست آوردن آنچه به خاطرش وارد شده بود، باز می‌ماند. پس با شتاب به سوی گوسفندانش باز می‌گشت و خارج می‌شد در حالی که آنچه به خاطرش وارد شده بود، از دستش رفته بود. و در این امر، عصمت و حفظ او بود، در حالی که خود نمی‌دانست. و در این معنی از عصمت، در مثل گفته می‌شود: «اینکه نیابی».\n\nو در این منزل از علوم، علم احدیت افعال است، که امری مورد اختلاف است. برخی آن را برای حق تعالی (الحق تعالی) اثبات می‌کنند و برخی برای خلق. پس در هر دو طایفه احدی است. و برخی در آن شرک خفی (پنهان) اثبات می‌کنند، و آنان قائلان به کسب (اختیار جزئی بنده) هستند. و در آن، علم به آنچه جز با موهبت (الوهب) دانسته نمی‌شود، وجود دارد، که کشف (الکشف) به هیچ وجه در آن راه ندارد. و آن چیزی است که جز به ذات درک‌کننده (اسم فاعل) ادراک نمی‌شود، بر حسب آنچه که مدرَک (اسم مفعول) بر آن است. اگر درک‌کننده از کسانی باشد که حواس به او نسبت داده می‌شود، حواس برای او ذاتی است، نه محل‌های معین آن. و اگر از کسانی باشد که حواس به او نسبت داده نمی‌شود، ادراک او از امور محسوسه نیز مانند صاحب حواس، به ذات اوست، و گفته نمی‌شود که آن امور برای او محسوس هستند، زیرا حسی به او نسبت داده نمی‌شود، بلکه برای او معلوم هستند. و حواس راهی است که به علم می‌رساند، و علم به امر مطلوب است، نه به آنچه حاصل شده است.\n\nبه راستی دیده‌ام که کور مادرزاد، با فقدان حس بینایی، تفاوت میان رنگ‌ها را درک می‌کند و خداوند بینایی او را در لمس او قرار داده است، پس با آنچه لمس می‌کند، می‌بیند. و در آن، علم به اعلام توحید حق (الحق) در الوهیت خود، به هر زبانی که آن را بداند، وجود دارد. و آن شنوایی که این اعلام الهی را درک کرده، چیست، اگر فهم از آن تبعیت کند؟ و اگر فهم از آن تبعیت نکند، آیا گفته می‌شود که شنیده است یا نه؟ و در آن، علم به مرتبه انسان حیوانی (الإنسان الحيوان) و رقابت او با انسان کامل (الإنسان الکامل) به قوه (بالقوة) در امری که از انسان کامل جز به فعل (بالفعل) صادر نمی‌شود، وجود دارد. و اینکه انسان کامل در حکم با انسان حیوانی متفاوت است، زیرا انسان حیوانی رزق حیوانات را می‌خورد، و این رزق برای انسان کامل نیز هست، به علاوه رزق الهی که انسان حیوانی به آن نمی‌رسد، و آن چیزی است که انسان کامل از علوم فکر که برای انسان حیوانی نیست، و کشف (الکشف) و ذوق و فکر صحیح تغذیه می‌کند.\n\nو در آن، علم به رحمت خداوند بر عالَم وجود دارد، زیرا آنان را به اسباب ارجاع داد و رزقی برایشان قرار نداد مگر در اسباب، تا عذری برای اثبات آن بیابند. پس کسی که اسباب را به صورت جعلی (قراردادی) اثبات کند، صاحب عبادت است، و کسی که آن را عقلی اثبات کند، مشرک است، اگرچه مؤمن باشد. زیرا هر مؤمنی موحدی نیست که از بصیرت شهودی (الشهود) که خداوند به او عطا کرده، برخوردار باشد. و در آن، علم به مرتبه مباح در شرایع و اینکه آیا تعریفی که برای آن کرده‌اند مبنی بر اینکه نه اجر دارد و نه وزر، تعریفی صحیح است یا خیر. و آیا در انجام و ترک آن، اجر حاصل می‌شود؟ و آنچه از افعال خداوند به آن نگریسته می‌شود و آنچه در مورد خداوند حکم می‌شود، زیرا چیزی جز اختیار منسوب به خداوند با آن مشابهت ندارد. پس اگر در آنجا اختیاری به حد اختیار اثبات نشود، در اینجا نیز مباحی به حد مباح اثبات نمی‌شود، زیرا در آنجا چنین چیزی نیست. و در آن، علم به آنچه مخلوق می‌داند وجود دارد، و اینکه علم او محدود و مقید است و اطلاق در علم به او نسبت داده نمی‌شود، زیرا این از خصایص حق سبحانه و تعالی (الحق سبحانه و تعالی) است.\n\nو در آن، علم به اختلاف طبایع در کسانی که از آن ترکیب شده‌اند، و اینکه کسی که طبیعت ندارد، به واسطه چه چیزی متفاوت شده است، وجود دارد. و اگر حکم اختلاف در کسی که طبیعت ندارد، نبود، اختلاف در طبیعت ظاهر نمی‌شد، همان‌گونه که اگر اختلاف طبیعت نبود، اختلافی در آنچه از آن تألیف شده، ظاهر نمی‌شد. و این علمی شگفت‌انگیز در مفرد عین و مفرد حکم است. پس به واسطه قابلیت‌ها، اختلاف به فعل (بالفعل) ظاهر شد، در حالی که در مفرد به قوه (بالقوة) بود. و در آن، علم به حکمت توقف عالم بر یکدیگر در آنچه از آن استفاده می‌شود، با وجود امکان استفاده از آن بدون دیگری، وجود دارد.\n\nو در آن، علم به مرتبه کسی که علومش زیاد است نسبت به کسی که علومش کم است، و کسی که علومش از روی کثرت کم شده یا نه از روی کثرت، وجود دارد. و اگرچه شرف نزد برخی در کمی علم است، پس چرا خداوند عز و جل به رسولش (صَلَّى اللهُ عَليهِ وسَلَّم) امر کرد که طلب زیادی علم کند، در حالی که زیادی، کثرت است؟ و کسی که علمش از معلومات باشد، اگرچه زیاد باشند، احدیت هر معلوم که عین دلالت بر احدیت حق (الحق) است، پس او صاحب یک علم است، و نه کمتر از یک علم در معلومات بسیار، که مجمل هر معلوم، احدیتی است که تنها برای عالم بالله معلوم است. و کسی جز ابن السید البطلیوسی به این مسئله توجه نکرده است. او در کلامی که از او به دست ما رسیده، گفته است: انسان هر چه قدرش در عالم بالاتر رود، علومش کمتر می‌شود، و هر چه از این مرتبه شریف پایین‌تر آید، علومش گسترده‌تر می‌شود. و منظورم از علوم، علم به افعال است، و منظورم از کمی، علم به ذات از طریق شهود (الشهود) است. و رأی او در علم توحید، رأی فیثاغورثیان بود، و آنان قومی هستند که توحید را با عدد اثبات کردند و آن را دلیلی بر احدیت حق (الحق) قرار دادند، و گروهی از عقلا نیز بر این عقیده‌اند.\n\nو در آن، علم به علم ثابتی که در دنیا و آخرت زوال نمی‌پذیرد، وجود دارد. و در آن، علم به نصب ادله برای کسی که امر را جز با نظر فکری نمی‌شناسد، وجود دارد. و در آن، علم به آنچه که ممکن نیست جز به خدا نسبت داده شود، وجود دارد. اگر به غیر خدا نسبت داده شود، نزد کسی که آن علم را می‌شناسد، بر جهل کسی که آن را به غیر خدا نسبت می‌دهد، دلالت می‌کند. و در آن، علم به اینکه همه موجودات نعمت‌های الهی هستند که خداوند عطا کرده است، و علم به اینکه چه کسی است که خداوند این نعمت‌ها را به او عطا کرده است، و آیا این نعمت‌داده شده (منعم علیه) از جمله نعمت‌هاست؟ پس عین نعمت، عین نعمت‌داده شده (منعم) است. پس این را بدان.\n\n[علم مرگ در زندگی و زندگی در مرگ]\n\nو در آن، علم به مرگ در زندگی و زندگی در مرگ، و اینکه حیّ (زنده) که نمی‌میرد کیست، و میّت (مرده) که زنده نمی‌شود کیست، و کسی که می‌میرد و زنده می‌شود کیست، و کسی که نمی‌میرد و زنده نمی‌شود کیست، وجود دارد. و در آن، علم به سبب وجود انکار در عالم و اینکه چرا از حضرت الهی (الحضرة الإلهیة) استناد می‌شود، وجود دارد. و آیا قول خداوند به بنده‌اش هنگامی که آنچه از امور نهی شده بر او ظاهر می‌شود و آن را به خود نسبت می‌دهد: «وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ» (و هر بدی به تو رسد، از جانب خود توست)، انکار الهی از نسبت دادن آن فعل به خداست؟ و چرا منکر نامیده شده در حالی که معروف است؟ و قول او: «الَّذِينَ يَأْمُرُونَ بِالْمَعْرُوفِ» (کسانی که به معروف امر می‌کنند)، و آن امر به چیزی است که برای او معلوم است، و «وَيَنْهَوْنَ عَنِ الْمُنْكَرِ» (و از منکر نهی می‌کنند)، و آن نهی از چیزی است که نزد او معلوم نیست، از نکرِه (ناشناخته) که شناخته نمی‌شود. و چون منکر، انجام کاری است که به ترک آن امر شده یا ترک کاری است که به انجام آن امر شده، و تا زمانی که دانسته نشود آن عمل مأمور به است یا منهی عنه، به آن وصف «منکر» داده نمی‌شود. پس نام منکر برای آن صحیح است به دلیل حیرتی که برای بنده در آن حاصل می‌شود و عدم رهایی او به یکی از دو جانب. اگر آن را در برخی امور به حق (الحق) نسبت دهد، ادب یا دلیل حسی و عقلی و سمعی با او معارضه می‌کند، پس صفت معرفت از آن عمل سلب می‌شود و به نکرِه ملحق می‌گردد. و چون منکر به افعال مذموم اختصاص دارد نه به افعال ستوده. و در آن، علم به مذمت خداوند از متکبر وجود دارد، در حالی که کبریا صفت اوست. و خداوند عز و جل می‌داند که کبر بر خدا وارد قلب هیچ انسانی نمی‌شود، بلکه کبر بر خلق خدا وارد می‌شود، و این همان چیزی است که باید از او زائل شود و آنگاه وارد بهشت می‌شود. زیرا کسی که در قلبش به اندازه ذره‌ای کبر بر غیر خدا باشد، وارد بهشت نمی‌شود تا زمانی که زائل گردد. اما کبر بر خدا محال است، زیرا خداوند قلب‌ها را بر تواضع برای خود سرشته است، اگرچه از برخی اشخاص، صورت کبریا بر امر خدا ظاهر شود، که آن امری است که واسطه‌ها (رسولان) از جانب خدا آورده‌اند، نه بر خدا. زیرا کبریا از مخلوق بر او محال است، چون افتقار (نیازمندی) برای مخلوق ذاتی است و انسان نمی‌تواند ذات خود را نشناسد.\n\nو در آن، علم به حیله‌ها و کفالت و انتقال حق به کفیل از کسی که حق بر عهده اوست، و برائت کسی که حق از او منتقل شده، وجود دارد. و در آن، علم به سببی که موجب شد انسان از مأمن خود گرفته شود، وجود دارد. و در آن، علم به تسلیم و تفویض (واگذاری) وجود دارد. و در آن، علم به اختلاف احوال خلق هنگام مرگ، و سبب آن چیست، و چرا بر فطرت (الفطرة) که بر آن متولد شدند، قبض روح نشدند، و چه چیزی آنان را از فطرت خارج کرد یا برخی از آنان را خارج کرد، و فطرت چیست، و آیا خروج از آن صحیح است یا صحیح نیست، وجود دارد. و رحمت خداوند متعال بر خلقش در گرفتن عهد از مردم، هنگامی که خداوند آنان را از پشت پدرانشان گرفت و بر خودشان به ربوبیتش بر آنان گواه گرفت، پس گفتند: «بله، تو پروردگار مایی»، و آنان را بر توحید خود گواه نگرفت، به دلیل شفقت بر آنان، زیرا می‌دانست که در میانشان کسانی هستند که وقتی به دنیا بیایند، به او شرک می‌ورزند، و بیزاری او از شریک در آخرت در روز عرضه بزرگ.\n\nو در آن، علم به محاجه (جدال) در روز قیامت و فرق میان حجت باطل (الحجة الداحضة) و حجت رسا (الحجة البالغة)، و اینکه آن موطنی که در آن به انسان گفته می‌شود: «لَا يُسْأَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْأَلُونَ» (او از آنچه انجام می‌دهد بازخواست نمی‌شود، ولی آنان بازخواست می‌شوند) کجاست، وجود دارد. و در آن، علم به آنچه بر مبلغان از جانب خداوند متعال، از رسول و وارث، واجب است، وجود دارد. و در آن، علم به آنچه از امر خدا انجام می‌شود و آنچه اجتناب می‌گردد، و احکام آنان در این باره با دلیل و بدون دلیل، وجود دارد. و در آن، علم به آنچه عقلاً ممکن نیست در آن تبدلی رخ دهد، با وجود امکان عقلی آن، و اینکه چگونه نسخ در ادله عقول وارد می‌شود، همان‌گونه که در احکام شرایع وارد می‌گردد، وجود دارد. و در آن، علم به اینکه آیا تحکم بر خدا برای احدی از اهل الله (عرفا) بدون امر خدا جایز است یا جایز نیست.\n\nو در آن، علم به اینکه چگونه خداوند کسی را که او را از عالَم به وجود می‌آورد، می‌یابد، وجود دارد. و در آن، علم به اینکه آیا عین اعتماد بر خدا در دفع مکروه و سختی، عین اعتماد بر او در باقی نگه داشتن نعمت‌ها بر نعمت‌داده شده (منعم علیه) است، و هر یک از این دو اعتماد بر کدام اسم الهی است، وجود دارد. و در آن، علم به صفت شخصی که شایسته است در مورد علمی که به عامل آن سعادت می‌بخشد، از او سؤال شود، وجود دارد. و در آن، علم به سببی که موجب ترس نزد کسی می‌شود که خداوند در دنیا به او امان داده است، و برطرف شدن آن از او در دار آخرت، و اختلاف وجوه مؤاخذه الهی با وجود امان، وجود دارد.\n\nو در آن، علم به انتقال صور موجود از اشخاص که در انتقال خود وجه الله را می‌طلبند، و این صور مانند سایه‌ها هستند با اشخاصی که از آنها ظاهر می‌شوند، هنگام رو به رو شدن با نور و پشت کردن به آن، یا اینکه آن نور در سمت راست یا چپ آن شخص باشد، وجود دارد. و در آن، علم به نفی اینکه حق (الحق) در مجموع به عنوان معبود گرفته شود، وجود دارد. و آیا به غیر مجموع گرفته می‌شود یا اصلاً صحیح نیست که متخذ (گرفته شده) باشد؟ زیرا او به ذات خود معبود است، نه به واسطه اتخاذ (برگزیدن). پس این را بدان.\n\nو در آن، علم به آنچه از دین برای خداست و آنچه از آن برای بنده است، وجود دارد. «أَلَا لِلَّهِ الدِّينُ الْخَالِصُ» (آگاه باشید که دین خالص از آن خداست). و آیا دینی که مشقت در آن راه می‌یابد، از آن خداست؟ زیرا او می‌فرماید: «وَمَا جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ» (و در دین برای شما هیچ سختی قرار نداد) و فرمود: «يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ» (خداوند برای شما آسانی می‌خواهد و برای شما دشواری نمی‌خواهد). و رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «دين الله يسر» (دین خدا آسان است). و فرمود: «بعثت بالحنيفية السمحة» (من به آیین حنیف آسان‌گیر مبعوث شدم). همان‌گونه که همچنین فرمود: «وَلَهُ الدِّينُ وَاصِبًا» (و دین پیوسته از آن اوست). و فرمود: «من يشاد هذا الدين يغلبه» (هر کس با این دین درشتی کند، مغلوب آن می‌شود). و فرمود: «لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا» (خداوند هیچ کس را جز به اندازه توانش تکلیف نمی‌کند)، زیرا او را جز به اندازه قدرتی که به او داده، مکلف نکرده است.\n\nو در آن، علم به بازگرداندن نعمت‌ها به سوی خدا، و اینکه چرا شهود (الشهود) سختی بر انسان غلبه می‌کند تا میان او و طعم نعمت‌ها در آن سختی حائل شود، به طوری که از بلا به ستوه آید، وجود دارد. و این مقام عمر بن خطاب (رضی الله عنه) بود که نعمت‌های بلا را در خود بلا مشاهده می‌کرد، پس صبر و شکر را در یک لحظه جمع می‌کرد و صاحب دو عمل بود. و در آن، علم به استدراج (به تدریج به هلاکت کشاندن) با نعمت‌ها وجود دارد. و در آن، علم به حکم کسی که با حق (الحق) از روی جهل رفتار می‌کند، در حالی که گمان می‌کند در آن علم دارد، وجود دارد. و در آن، علم به تعریه (برهنه شدن از صفات) وجود دارد. و در آن، علم به صفت مفتی و فتوا، و اینکه مفتی چه زمانی فتوا می‌دهد، آیا پس از استفتا (درخواست فتوا) یا بدون استفتا فتوا می‌دهد، و آیا مفتی به اذن امام برای این کار نیاز دارد یا خیر، وجود دارد.\n\nو در آن، علم به استخراج علوم از نظر در موجودات و جزئیات آن وجود دارد. و در آن، علم به انواع و اقسام وحی، و آنچه از آن به اولیای تابع اختصاص دارد و آنچه پیامبر در آن از وحی شریک نمی‌شود، وجود دارد. و در آن، علم به احاطه بر وجوه هر معلوم، و اینکه آن عالم کیست و صفت او چیست، وجود دارد. و در آن، علم به اینکه برتری صفات به چه چیزی باز می‌گردد، وجود دارد. و در آن، علم به روزی‌های روحانی، و اینکه کدام روزی است که در تناول آن حیات قلب‌هاست، از روزی‌ای که در آن مرگ قلب‌هاست، وجود دارد. زیرا مرگ ممکن است از گرسنگی باشد و ممکن است از سیری و پرخوری باشد. و کدام روزی است که از آن سیر می‌شوند و کدام روزی است که از آن سیر نمی‌شوند، و کدام روزی است که همه عالَم در آن مساوی هستند و کدام روزی است که به برخی از عالَم اختصاص دارد و به برخی دیگر نه. و در آن، علم به رازق و اینکه او به دلیل نیازمندی روزی‌داده شده (مرزوق) به روزی، سزاوارتر به عبادت است، وجود دارد.\n\nو در آن، علم به حرکت و سکون، و اینکه چه کسی سزاوارتر به مقام است، آیا متحرک یا ساکن، و حکایت متحرک و ساکن هنگامی که در این باره نزد عالمی که آن را به ذوق (تجربه عرفانی) می‌داند، محاکمه کردند و آنچه بر آنان گذشت، وجود دارد. و اینکه صاحب روزی کسی است که آن را می‌خورد، نه کسی که آن را جمع می‌کند. و خداوند متعال از لقمان حکیم در آنچه به پسرش وصیت کرد، خبر داد: «يَا بُنَيَّ إِنَّهَا إِنْ تَكُ مِثْقَالَ حَبَّةٍ مِنْ خَرْدَلٍ فَتَكُنْ فِي صَخْرَةٍ أَوْ فِي السَّمَاوَاتِ أَوْ فِي الْأَرْضِ يَأْتِ بِهَا اللَّهُ» (ای پسرک من، اگر [عمل] به اندازه سنگینی دانه خردلی باشد و در دل سنگی یا در آسمان‌ها یا در زمین باشد، خداوند آن را می‌آورد)، و نگفت «به سوی آن می‌آید». و در آن، علم به عدل و ادای حقوق وجود دارد. و در آن، علم به فراموشی پس از علم، به طوری که اصلاً نداند آنچه را که فراموش کرده، قبلاً می‌دانسته است، وجود دارد.\n\nو در آن، علم به اسم الهی «الواقی» (نگهدارنده) و اختلاف صور آن در عالم، مانند اختلاف اسم «الرزاق» (روزی‌دهنده)، وجود دارد. و در آن، علم به اختلاف حال بر مشاهده‌کننده (مشاهد) در حال رؤیتش وجود دارد. و در آن، علم به کسی که مردم را به آنچه خود بر آن است دعوت می‌کند تا داعی حق (الحق) باشد، وجود دارد. و در آن، علم به اوامر الهی وجود دارد. و در آن، علم به محسن و احسان وجود دارد. و در آن، علم به انساب و\n\nقول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم): «إن ربكم واحد وإن أباكم واحد فلا فضل لعربي على أعجمي ولا لأعجمي على عربي إلا بالتقوى فإن الله يقول اليوم أرفع نسبكم وأضع نسبي أين المتقون» (به راستی که پروردگار شما یکی است و پدر شما یکی است. پس هیچ برتری برای عرب بر عجم و برای عجم بر عرب نیست مگر به تقوا. زیرا خداوند می‌فرماید: امروز نسب شما را بالا می‌برم و نسب خود را پایین می‌آورم. پرهیزگاران کجایند؟).\nو خداوند متعال فرمود: «إِنَّ أَكْرَمَكُمْ عِنْدَ اللَّهِ أَتْقَاكُمْ» (به راستی که گرامی‌ترین شما نزد خداوند، پرهیزگارترین شماست). پس آیا پرهیزگار کسی است که برای خدا وقایه (سپر) باشد یا کسی که خدا را وقایه بگیرد؟ و برای این (حالت اول) مردانی هستند و برای آن (حالت دوم) مردانی. پس این را بدان.\n\nو در آن، علم به ایلاء (سوگند خوردن) و اقسام آن و احکام آن در مورد سوگند خورنده و صورت ایلاء، و آنچه از آن برای خداست و آنچه برای بنده است، وجود دارد. و در آن، علم به اینکه عالم عامل در دنیای خود در بهشتی تعجیل شده در نفس خویش است، و اگرچه حالش بد باشد، نعمت درونی او بزرگترین نعمت است، وجود دارد. و در آن، علم به مداخلت در قرآن، با وجود اینکه از جانب خدا محفوظ است، پس تحریف و تبدیلی در قرآن صحیح نیست، همان‌گونه که در سایر کتب نازل شده رخ داده است، وجود دارد. و در آن، علم به اینکه نسخ چیست، وجود دارد. و در آن، علم به حکم کسی که ظاهرش با باطنش از روی شهود (الشهود) مخالف است، وجود دارد. و در آن، علم به دفاع انسان از نفس خود به دلیل بزرگداشت آن، هنگامی که تعظیم حق نفس را از جانب خدا در حرام کردن بهشت بر کسی که خود را کشته، می‌بیند، وجود دارد. و اگرچه قاتل نفس، جز با نفس حیوانی خود وارد جهنم نمی‌شود، زیرا جهنم موطن نفس ناطقه نیست و اگر نفس ناطقه بر آن مشرف شود، شعله‌اش بدون شک خاموش می‌شود، زیرا نور آن عظیم‌تر است. به راستی کسی که خود را کشته، جرمش به دلیل حق جوار الأقرب (نزدیک‌ترین همسایه) بزرگ است و میان آن و ملکش حائل شده است. و غیر از نفس او، از این قرب خاص که برای نفس اوست، دور است. و در آن، علم به آنچه حلال و حرام شده، وجود دارد. آیا برای ذات خود حلال یا حرام شده، یا برای امور مخصوص و احوالی در مورد حرام و حرام شده بر او؟ و حلال‌کننده و حرام‌کننده جز خدا نیست، به زبان شرع، زبان رسول (صَلَّى اللهُ عَليهِ وسَلَّم) یا مجتهد از علمای رسوم مانند فقها. و در آن، علم به تغییر اقبال الهی به دلیل تغییر احوال وجود دارد. و در آن، علم به قرار دادن شخص عظیم به جای جماعت وجود دارد. و در آن، علم به سیاست‌ها در مخاطبات از سوی علما و عارفان دعوت‌کننده به سوی خدا وجود دارد. و در آن، علم به جزا دادن به مثل در هر نوعی که باشد، و آنچه از آن ستوده و آنچه مذموم است، وجود دارد. و در آن، علم به معیت الهی وجود دارد. «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را می‌نمایاند)."
  },
  "page_count": 7
}