{
  "id": 480,
  "title": {
    "ar": "الباب الثمانون وأربعمائة في حال قطب كان منزله وآتَيْناهُ الْحُكْمَ صَبِيًّا",
    "en": "Chapter Four Hundred and Eighty: Concerning the spiritual state (حال) of a Pole (قطب) Whose station (منزل) was: <<وَآتَيْنَاهُ الْحُكْمَ صَبِيًّا>> (And We gave him the judgment while yet a child).",
    "ur": "چار سو اسیواں باب: ایک ایسے قطب (قطب) کے حال کے بارے میں جس کا روحانی مقام (منزل) یہ تھا: \"اور ہم نے اسے بچپن میں ہی حکم (حکمت) عطا کر دیا\" (وَآتَيْنَاهُ الْحُكْمَ صَبِيًّا)۔",
    "fa": "باب چهارصد و هشتادم در بیان حال قطبی که منزل او این آیه بود: «و آتَیْناهُ الْحُکْمَ صَبِیًّا» (و به او در کودکی حکمت دادیم)"
  },
  "content": {
    "ar": "## «الباب الثمانون وأربعمائة في حال قطب كان منزله وآتَيْناهُ الْحُكْمَ صَبِيًّا»\n\n\n> من المزاج قوى الإنسان أجمعها *** روحا وجسما فلا تعدل عن الرشد\n\n\n> بذاك يضعف في حال تصرفها *** لعلة قبلتها نشأة الجسد\n\n\n> فإن بدا لك ما يذهب بعادتها *** فذاك حكم الآلة الواحد الصمد\n\n\n> كمثل عيسى ومن قد كان أشبهه *** من الأناسي وما بالربع من أحد\n\n\n> يأتي بما جاءكم من خرق عادته *** سوى الذي خلق الإنسان في كبد\n\n\n### [معنى حديث عهد بربه‏]\n\n\nقال الله عز وجل وسَلامٌ عَلَيْهِ يَوْمَ وُلِدَ ويَوْمَ يَمُوتُ ويَوْمَ يُبْعَثُ حَيًّا فهذا سلام من الله عليه وقال عيسى عن نفسه عليه السلام إخبارا بحاله مع الله فيما أخبر الله به عن عنايته بيحيى عليه السلام والسَّلامُ عَلَيَّ يَوْمَ وُلِدْتُ ويَوْمَ أَمُوتُ ويَوْمَ أُبْعَثُ حَيًّا وزاد المحمدي الوارث كنت نبيا وآدم بين الماء والطين‏\n\n\n> عناية ريعان الشباب قوية *** لأن لها القرب الإلهي بالنص‏\n\n\n> لأن علوم القوم ذوق وخبرة *** وهذي علوم ليس تدرك بالفحص‏\n\n\nفإن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم برز بنفسه وحسر الثوب وقال لما أقبل الغيث حتى أصابه إنه حديث عهد بربه‏\n\n\nفهذا هو النص الجلي الذي أتى من الشرع في الغيث القريب من الرب فكل أول في العالم فإنه حديث عهد بربه وكل ما في العالم أول فإنه شي‏ء فهو في وجوده حديث عهد بربه إذ قال له كُنْ فالعالم كله عالم الأمر سواء كان من عالم الخلق أو لم يكن وقد بينا عالم الأمر والخلق ما هو وهو الوجه الخاص الذي في عالم الخلق وما عثر عليه أحد من أهل النظر في العلم الإلهي إلا أهل الله ذوقا ولما كان للصبي حدثان هذا القرب وهو قرب التكوين والسماع ولم يحل بينه وبين إدراك قربه من الله حائل لبعده عن عالم الأركان في خلقه فلم يكن عن أب عنصري ولكن كان روح الله وكَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ فلم يكن ثم ما يغيبه عمن صدر عنه فقال مخبرا عن ما شاهده من الحال فحكم في مهده على مرأى من قومه الذين افتروا في حقه على أمه مريم فبرأها الله بنطقه وبحنين جذع النخلة إليه إذ أكثر الشرع في الحكومة بشاهدين عدلين ولا أعدل من هذين فقال إِنِّي عَبْدُ الله فحكم على نفسه بالعبودية لله وما قال ابن فلان لأنه لم يكن ثم وإنما كان حق تجلى في صورة روح جبريل لما في القضية من الجبر الذي حكم في الطبيعة بهذا التكوين الخاص الغير معتاد آتانِيَ الْكِتابَ فحصل له إنجيله قبل بعثه فكان على بينة من ربه فحكم بأنه مالك كتابه الإلهي وجَعَلَنِي نَبِيًّا فحكم بأن النبوة بالجعل لأن الله يقول في أَيِّ صُورَةٍ ما شاءَ رَكَّبَكَ فهو في الصورة بالجعل لئلا يتخيل أن ذلك بالذات بل هو اختصاص إلهي وجَعَلَنِي مُبارَكاً أي خصني بزيادة لم تحصل لغيري وتلك الزيادة ختمه للولاية ونزوله في آخر الزمان وحكمه بشرع محمد صَلَّى اللهُ عَليهِ وسَلَّم حتى يكون يوم القيامة ممن يرى ربه الرؤية المحمدية في الصورة المحمدية أينما كنت من دنيا وآخرة فإنه ذو حشرين يحشر في صف الرسل ويحشر معنا في أتباع محمد صَلَّى اللهُ عَليهِ وسَلَّم وأَوْصانِي بِالصَّلاةِ المفروضة في أمة محمد صَلَّى اللهُ عَليهِ وسَلَّم أن أقيمها لأنه جاء بالألف واللام فيها والزَّكاةِ أيضا كذلك ما دُمْتُ حَيًّا زمان التكليف وهو الحياة الدنيا وبَرًّا بِوالِدَتِي فأخبر أنه شق في خلفه فإن لأمه عليه ولادة لما كانت محل تكوينه فقلت نسبته العنصرية في خلقه فكان‏\nأقرب إلى ربه فكان أحدث عهد بعبوديته لربه ولَمْ يَجْعَلْنِي جَبَّاراً شَقِيًّا إذ لا يكون ذلك ممن يكون إلا بالجهل والجهل فيه إنما هو من قوة سلطان ظلمة العنصر وقد بينا مرتبة عالم الطبيعة من عالم العناصر في هذا الكتاب في مواضع منه والسَّلامُ عَلَيَّ لعلمه بمرتبته من ربه وحظه منه يَوْمَ وُلِدْتُ يعني له السلامة في ولادته من تأثير العبد المطرود الموكل بالأطفال عند الولادة حين يصرخ الولد إذا وقع من طعنته فلم يكن لعيسى عليه السلام صراخ بل وقع ساجد الله تعالى ويَوْمَ أَمُوتُ يكذب من يفتري عليه أنه قتل فلم يقل ويوم أقتل ويَوْمَ أُبْعَثُ حَيًّا يعني في القيامة الكبرى أكد موته فأتاه الحكم بما ذكره وهو صبي رضيع في المهد فكان أتم في الوصلة بربه من يحيى بن خالته فإن عيسى سلم على نفسه بسلام ربه ولهذا ادعى فيه أنه إله ويحيى سلم عليه ربه تعالى ولم ينص على أنه عرف بذلك السلام عليه أو لم يعرف‏\n\n\n### [أن للناس غريب أن تأخذ الحكمة من الصبي الصغير]\n\n\nواعلم أن الناس إنما يستغربون الحكمة من الصبي الصغير دون الكبير لأنهم ما عهدوا إلا الحكمة الظاهرة عن التفكر والرؤية وليس الصبي في العادة بمحل لذلك فيقولون إنه ينطق بها فتظهر عناية الله بهذا المحل الظاهر فزاد يحيى وعيسى بأنهما على علم مما نطقا به علم ذوق لأن مثل هذا في هذا الزمان والسن لا يصح أن يكون إلا ذوقا وأن الله آتاه الحكم صبيا وهو حكم النبوة التي لا تكون إلا ذوقا فمن كان هجيره هذا فوراثته وإن كان محمديا لهذين النبيين أو لأحدهما على حسب قوة نسبته منهما أو من أحدهما وقد نطق في المهد جماعة أعني في حال الرضاعة وقد رأينا أعظم من هذا رأينا من تكلم في بطن أمه وأدى واجبا وذلك أن أمه عطست وهي حامل به فحمدت الله فقال لها من بطنها يرحمك الله بكلام سمعه الحاضرون وأما ما يناسب الكلام فإن ابنتي زينب سألتها كالملاعب لها وهي في سن الرضاعة وكان عمرها في ذلك الوقت سنة أو قريبا منها فقلت لها بحضور أمها وجدتها يا بنية ما تقولين في الرجل يجامع أهله ولا ينزل فقالت يجب عليه الغسل فتعجب الحاضرون من ذلك وفارقت هذه البنت في تلك السنة وتركتها عند أمها وغبت عنها وأذنت لأمها في الحج في تلك السنة ومشيت أنا على العراق إلى مكة فلما جئنا المعرف خرجت في جماعة معي أطلب أهلي في الركب الشامي فرأتني وهي ترضع ثدي أمها فقالت يا أمي هذا أبي قد جاء فنظرت الأم حتى رأتني مقبلا على بعد وهي تقول هذا أبي هذا أبي فناداني خالها فأقبلت فعند ما رأتني ضحكت ورمت بنفسها علي وصارت تقول لي يا أبت يا أبت فهذا وأمثاله من هذا الباب‏\n\n",
    "en": "## Chapter 480, Concerning the State of a Pole (قطب) whose Station was [the Divine Saying]: \"And We gave him the Wisdom (الحكم) while yet a child (صبيًا).\"\n\nAll the powers of the human being, both spirit and body, derive from the temperament (المزاج); thus, do not deviate from the guidance (الرشد).\n\nBy that [temperament], it weakens during its activity due to a defect accepted by the constitution (نشأة) of the body.\n\nIf there appears to you that which removes its customary state, then that is the decree (حكم) of the One Deity (الآلة), the Eternal Refuge (الصمد).\n\nLike Jesus (عيسى) and those among mankind who resembled him, and no one else in that category.\n\nHe comes to you with the breaking of his customary state (خرق عادته), save for the One who created humanity in toil (كبد).\n\n### [The Meaning of Being Recently Connected to His Lord]\n\nAllah, the Mighty and Majestic, said: <<وَسَلَامٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوتُ وَيَوْمَ يُبْعَثُ حَيًّا>> (And peace be upon him the day he was born and the day he dies and the day he is raised alive). This is a peace (سلام) from Allah upon him [Yahya]. And Jesus (عيسى), peace be upon him, spoke concerning himself, informing of his state with Allah, in the same way that Allah informed of His care (عناية) for John (يحيى), peace be upon him: <<وَالسَّلَامُ عَلَيَّ يَوْمَ وُلِدْتُ وَيَوْمَ أَمُوتُ وَيَوْمَ أُبْعَثُ حَيًّا>> (And peace is upon me the day I was born and the day I die and the day I am raised alive).\n\nAnd the Muhammadan Heir (الوارث المحمدي) added: \"I was a Prophet while Adam was between water and clay.\"\n\nThe care (عناية) of the prime of youth is strong,\nfor it possesses the Divine Proximity (القرب الإلهي) according to the text.\n\nBecause the sciences (علوم) of the Folk (القوم) are direct tasting (ذوق) and experience (خبرة),\nand these are sciences that cannot be attained through investigation (الفحص).\n\nIndeed, the Messenger of Allah, peace and blessings be upon him, exposed himself and uncovered his garment when the rain (الغيث) came and touched him, saying: \"It is recently connected to its Lord (حديث عهد بربه).\"\n\nThis is the clear textual evidence (النص الجلي) that came from the Law (الشرع) concerning the rain that is close to the Lord. Thus, every beginning (أول) in the World (العالم) is recently connected to its Lord (حديث عهد بربه). Everything in the World that is a beginning is a thing (شيء), and in its existence (وجوده) it is recently connected to its Lord, since He said to it: <<كُنْ>> (Be!).\n\nThe entire World is the World of Command (عالم الأمر), whether it belongs to the World of Creation (عالم الخلق) or not. We have already explained what the World of Command and Creation is: it is the specific aspect (الوجه الخاص) found within the World of Creation. No one among the people of theoretical speculation (أهل النظر) in Divine Science (العلم الإلهي) has discovered this, except the People of Allah (أهل الله) through direct tasting (ذوقًا).\n\nSince the child (الصبي) possesses two instances of this proximity (قرب): the proximity of formation (قرب التكوين) and the proximity of hearing (السماع), and since no barrier intervened between him and the realization of his proximity to Allah—due to his distance from the World of Elements (عالم الأركان) in his creation—he was not born of an elemental father. Rather, he was the Spirit of Allah (روح الله) and <<كَلِمَتُهُ أَلْقَاهَا إِلَى مَرْيَمَ>> (His Word which He cast unto Mary). Thus, there was nothing there to veil him from the One from whom he originated.\n\nSo he spoke, informing of the state (الحال) he witnessed, and he decreed (حكم) in his cradle, in the sight of his people who had slandered his mother Mary (مريم) concerning him. Allah acquitted her through his speech and through the yearning (حنين) of the palm trunk toward him. Since the Law (الشرع) generally requires two just witnesses (شاهدين عدلين) for a judgment (الحكومة), there are none more just than these two [the speech and the palm trunk].\n\nHe said: <<إِنِّي عَبْدُ اللَّهِ>> (Indeed, I am the servant of Allah). Thus, he decreed servitude (العبودية) for himself before Allah and did not say \"the son of so-and-so,\" because that [paternity] was not present. Rather, it was the Real (الحق) manifesting (تجلى) in the form of the Spirit of Gabriel (روح جبريل), due to the compulsion (الجبر) inherent in the matter, which decreed this specific, uncustomary formation (التكوين الخاص) in nature (الطبيعة).\n\n[He said:] <<آتَانِيَ الْكِتَابَ>> (He has given me the Book). Thus, he received his Gospel (إنجيل) before his mission (بعثه), and he was upon clear evidence (بينة) from his Lord. He thereby decreed that he was the possessor of his Divine Book.\n\n[He said:] <<وَجَعَلَنِي نَبِيًّا>> (And He has made me a Prophet). Thus, he decreed that Prophethood (النبوة) is by appointment (بالجعل), because Allah says: <<فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ>> (In whatever form He willed, He put you together). Therefore, his form is by appointment, lest it be imagined that this is by Essence (بالذات); rather, it is a Divine specialization (اختصاص إلهي).\n\n[He said:] <<وَجَعَلَنِي مُبَارَكًا>> (And He has made me blessed). That is, He specialized me with an increase (زيادة) that was not granted to others. That increase is his sealing of Sainthood (ختمه للولاية), his descent at the End of Time (آخر الزمان), and his ruling according to the Law (شرع) of Muhammad, peace and blessings be upon him, so that on the Day of Resurrection he will be among those who see their Lord with the Muhammadan Vision (الرؤية المحمدية) in the Muhammadan Form (الصورة المحمدية), wherever you may be, in this world or the Hereafter.\n\nFor he possesses two gatherings (حشرين): he will be gathered in the rank of the Messengers (الرسل), and he will be gathered with us among the followers of Muhammad, peace and blessings be upon him.\n\n[He said:] <<وَأَوْصَانِي بِالصَّلَاةِ>> (And He enjoined upon me the Prayer). This refers to the obligatory Prayer (الصلاة المفروضة) within the Community (أمة) of Muhammad, peace and blessings be upon him, that I should establish it, because the definite article (ال) is used here [implying a specific, known Prayer], and likewise <<وَالزَّكَاةِ>> (and the Zakat/Purifying Alms), as long as <<مَا دُمْتُ حَيًّا>> (I remain alive)—which is the period of religious obligation (زمان التكليف), namely, the life of this world.\n\n[He said:] <<وَبَرًّا بِوَالِدَتِي>> (And dutiful to my mother). He thus informed that he was split in his origin, for his mother had a birthright over him since she was the locus of his formation (محل تكوينه). I say: his elemental lineage (نسبته العنصرية) was diminished in his creation, so he was closer to his Lord, and thus was more recently connected (أحدث عهد) to his servitude (عبوديته) to his Lord.\n\n[He said:] <<وَلَمْ يَجْعَلْنِي جَبَّارًا شَقِيًّا>> (And He has not made me a wretched tyrant). This state only occurs through ignorance (الجهل), and ignorance in this context arises from the powerful dominion of the darkness of the element (ظلمة العنصر). We have already explained the rank of the World of Nature (عالم الطبيعة) relative to the World of Elements (عالم العناصر) in various places in this Book.\n\n[He said:] <<وَالسَّلَامُ عَلَيَّ>> (And peace is upon me), due to his knowledge of his rank (مرتبته) with his Lord and his portion thereof, <<يَوْمَ وُلِدْتُ>> (the day I was born). This means he had safety (السلامة) in his birth from the influence of the banished servant [Satan] who is assigned to children at birth, when the child cries out upon being struck by his thrust. Jesus, peace be upon him, did not cry out; rather, he fell prostrating to Allah, the Most High.\n\n[He said:] <<وَيَوْمَ أَمُوتُ>> (And the day I die). This refutes those who who falsely claim he was killed, for he did not say \"and the day I am killed.\"\n\n[He said:] <<وَيَوْمَ أُبْعَثُ حَيًّا>> (And the day I am raised alive), meaning on the Greater Resurrection (القيامة الكبرى). He confirmed his death. Thus, the Wisdom (الحكم) came to him, which he mentioned, while he was an infant suckling in the cradle. He was therefore more complete in his connection (الوصلة) to his Lord than John (يحيى), the son of his maternal aunt, for Jesus pronounced peace upon himself with the peace of his Lord, whereas his Lord pronounced peace upon John, the Most High, and it is not explicitly stated whether John knew of that peace upon him or not.\n\n### [That People Find it Strange to Receive Wisdom from a Young Child]\n\nKnow that people only find wisdom (الحكمة) strange when it comes from a young child rather than an adult, because they are accustomed only to the wisdom that appears through reflection (التفكر) and observation (الرؤية). The child is not customarily the locus for this, so they say that [the child] speaks it, thereby manifesting Allah’s care (عناية) through this apparent locus.\n\nJohn and Jesus were distinguished by the fact that they possessed knowledge (علم) of what they spoke—the knowledge of direct tasting (علم ذوق)—because such a thing at that time and age cannot be valid except through direct tasting. And Allah gave him the Wisdom (الحكم) while yet a child, which is the Wisdom of Prophethood (حكم النبوة), which is only attained through direct tasting (ذوقًا).\n\nWhoever makes this his constant practice, his inheritance (وراثته), even if he is Muhammadan, belongs to these two Prophets, or to one of them, according to the strength of his relation (نسبته) to them or to one of them.\n\nA group of people have spoken in the cradle—I mean, while suckling. We have seen something greater than this: we have seen one who spoke in his mother’s womb and fulfilled an obligation (واجب). This occurred when his mother sneezed while pregnant with him and praised Allah. He said to her from her womb, \"May Allah have mercy on you,\" in words heard by those present.\n\nAs for what is relevant to this speech, I asked my daughter Zaynab, as if playing with her, while she was still suckling, being about one year old or close to it at the time. In the presence of her mother and grandmother, I said to her, \"O little daughter, what do you say concerning a man who has intercourse with his wife but does not ejaculate?\" She replied, \"Ghusl (ritual bathing) is obligatory upon him.\" Those present were astonished by this.\n\nI parted from this daughter that year, leaving her with her mother, and I was absent from her. I gave her mother permission to perform the Hajj that year, and I traveled through Iraq to Mecca. When we reached Al-Mu'arrif [Arafat], I went out with a group seeking my family in the Syrian caravan. She saw me while she was suckling at her mother’s breast and said, \"O Mother, my father has come!\" Her mother looked until she saw me approaching from a distance, while [the daughter] kept saying, \"This is my father, this is my father!\" Her maternal uncle called out to me, and I approached. When she saw me, she laughed and threw herself upon me, saying, \"O my father! O my father!\" This and similar incidents belong to this chapter.",
    "ur": "باب نمبر چار سو اسی اس قطب (قطب) کے حال کے بیان میں جس کا مقام یہ تھا: \"اور ہم نے اسے بچپن میں ہی حکم (حکمت) عطا کر دیا\" (وَآتَيْنَاهُ الْحُكْمَ صَبِيًّا)۔\n\nتمام انسانی قوتیں مزاج سے ہیں، روح اور جسم دونوں میں، لہٰذا ہدایت سے منہ نہ موڑ۔\nاسی وجہ سے وہ (قوتیں) اپنے تصرف کی حالت میں کمزور ہو جاتی ہیں، اس علت کی بنا پر جسے جسمانی نشأت نے قبول کیا۔\nپس اگر تمہارے سامنے کوئی ایسی چیز ظاہر ہو جو اس کی عادت کو ختم کر دے، تو وہ واحد و صمد (الواحد الصمد) معبود کا حکم ہے۔\nجیسے کہ عیسیٰ (علیہ السلام) اور وہ لوگ جو ان سے مشابہ تھے، انسانوں میں سے، اور اس چوتھائی (دنیا) میں کوئی اور نہیں۔\nوہ ایسی چیز لاتا ہے جو تمہارے پاس اس کی عادت کو توڑ کر آئی ہے، سوائے اس کے جس نے انسان کو مشقت (کبد) میں پیدا کیا۔\n\n[اپنے رب سے نیا عہد (حديث عهد بربه) کا معنی]\n\nاللہ عزوجل نے فرمایا: \"اور سلامتی ہو اس پر جس دن وہ پیدا ہوا اور جس دن وہ مرے گا اور جس دن وہ زندہ اٹھایا جائے گا\" (وَسَلَامٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوتُ وَيَوْمَ يُبْعَثُ حَيًّا)۔ یہ اللہ کی طرف سے اس پر سلامتی ہے۔ اور عیسیٰ علیہ السلام نے اپنے حال کی خبر دیتے ہوئے خود اپنے بارے میں فرمایا، جیسا کہ اللہ نے یحییٰ علیہ السلام پر اپنی عنایت کے بارے میں خبر دی: \"اور سلامتی ہو مجھ پر جس دن میں پیدا ہوا اور جس دن میں مروں گا اور جس دن میں زندہ اٹھایا جاؤں گا\" (وَالسَّلَامُ عَلَيَّ يَوْمَ وُلِدْتُ وَيَوْمَ أَمُوتُ وَيَوْمَ أُبْعَثُ حَيًّا)۔ اور محمدی وارث نے اس میں اضافہ کیا: \"میں نبی تھا جبکہ آدم پانی اور مٹی کے درمیان تھے\"۔\n\nجوانی کے ابتدائی دور کی عنایت قوی ہوتی ہے، کیونکہ نص (نص) کے ذریعے اس کے لیے قربِ الٰہی (القرب الإلهي) ہے۔\nکیونکہ قوم (صوفیاء) کے علوم ذوق (ذوق) اور تجربہ (خبرة) ہیں، اور یہ وہ علوم ہیں جو محض جانچ پڑتال سے حاصل نہیں ہوتے۔\n\nپس رسول اللہ صلی اللہ علیہ وسلم خود باہر تشریف لائے اور کپڑا ہٹا دیا اور جب بارش آئی اور آپ کو لگی تو فرمایا: \"یہ اپنے رب سے نیا عہد (حديث عهد بربه) ہے\"۔\n\nپس یہ وہ واضح نص (نص) ہے جو شریعت میں رب سے قریب بارش کے بارے میں آئی ہے۔ لہٰذا، عالم میں ہر اول چیز اپنے رب سے نیا عہد (حديث عهد بربه) رکھتی ہے، اور عالم میں ہر وہ چیز جو اول ہے، وہ ایک شے ہے، پس وہ اپنے وجود میں اپنے رب سے نیا عہد (حديث عهد بربه) رکھتی ہے، کیونکہ اللہ نے اسے \"ہو جا\" (كُنْ) کہا۔ پس سارا عالم عالمِ امر (عالم الأمر) ہے، خواہ وہ عالمِ خلق (عالم الخلق) سے ہو یا نہ ہو۔ اور ہم نے بیان کیا ہے کہ عالمِ امر (عالم الأمر) اور عالمِ خلق (عالم الخلق) کیا ہے، اور وہ خاص وجہ (الوجه الخاص) ہے جو عالمِ خلق (عالم الخلق) میں ہے، اور علمِ الٰہی (العلم الإلهي) میں اہل نظر میں سے کسی نے بھی اس پر ٹھوکر نہیں کھائی سوائے اہل اللہ کے جو ذوقاً (ذوقاً) جانتے ہیں۔\n\nاور چونکہ بچے کے لیے یہ قربت (قرب) دو طرح سے ہوتی ہے: ایک قربِ تکوین (قرب التكوين) اور سماع (سماع)، اور اس کی تخلیق میں عالمِ ارکان (عالم الأركان) سے دوری کی وجہ سے کوئی رکاوٹ اس کے اور اللہ سے اس کی قربت (قرب) کے ادراک کے درمیان حائل نہیں ہوتی۔ اور وہ کسی عنصری باپ سے نہیں تھے، بلکہ وہ روح اللہ اور اس کا کلمہ (كَلِمَتُهُ) تھے جسے اس نے مریم کی طرف ڈالا (أَلْقَاهَا إِلَى مَرْيَمَ)۔ پس وہاں کوئی ایسی چیز نہیں تھی جو اسے اس ذات سے غائب کر دے جس سے وہ صادر ہوئے تھے۔\n\nچنانچہ انہوں نے اس حال کی خبر دیتے ہوئے فرمایا جس کا انہوں نے مشاہدہ کیا، اور انہوں نے اپنے گہوارے میں اپنی قوم کے سامنے فیصلہ سنایا، جنہوں نے ان کی والدہ مریم پر بہتان لگایا تھا۔ پس اللہ نے ان کے بولنے اور کھجور کے تنے کے ان کی طرف جھکنے سے انہیں بری کر دیا۔ کیونکہ شریعت میں اکثر فیصلے دو عادل گواہوں سے ہوتے ہیں، اور ان دونوں سے زیادہ عادل کوئی نہیں تھا۔\n\nپس انہوں نے فرمایا: \"میں اللہ کا بندہ ہوں\" (إِنِّي عَبْدُ اللَّهِ)۔ پس انہوں نے اپنے لیے اللہ کی بندگی (العبودية) کا حکم لگایا، اور یہ نہیں کہا کہ میں فلاں کا بیٹا ہوں، کیونکہ وہاں کوئی (باپ) نہیں تھا۔ بلکہ وہ ذات حق (حق) تھی جس نے جبرائیل کی روح کی صورت میں ظہور الٰہی (تجلی) فرمایا، کیونکہ اس معاملے میں جبر (الجبر) شامل تھا جس نے اس خاص غیر معمولی تخلیق کے ذریعے طبیعت (الطبيعة) میں حکم فرمایا۔\n\n\"اس نے مجھے کتاب دی\" (آتَانِيَ الْكِتَابَ)۔ پس انہیں اپنی بعثت سے پہلے ہی اپنی انجیل حاصل ہو گئی، اور وہ اپنے رب کی طرف سے واضح دلیل پر تھے۔ پس انہوں نے حکم لگایا کہ وہ اپنی الٰہی کتاب کے مالک ہیں۔\n\n\"اور مجھے نبی بنایا\" (وَجَعَلَنِي نَبِيًّا)۔ پس انہوں نے حکم لگایا کہ نبوت جعل (بنائے جانے) سے ہے، کیونکہ اللہ فرماتا ہے: \"جس صورت میں چاہا تجھے جوڑ دیا\" (فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ)۔ پس وہ صورت میں جعل (بنائے جانے) سے ہیں، تاکہ یہ خیال نہ کیا جائے کہ یہ بالذات (بالذات) ہے، بلکہ یہ ایک الٰہی اختصاص ہے۔\n\n\"اور مجھے بابرکت بنایا\" (وَجَعَلَنِي مُبَارَكًا)۔ یعنی مجھے ایک ایسی زیادتی کے ساتھ خاص کیا جو کسی اور کو حاصل نہیں ہوئی، اور وہ زیادتی ان کا ولایت (الولاية) کو ختم کرنا اور آخری زمانے میں ان کا نزول، اور محمد صلی اللہ علیہ وسلم کی شریعت کے مطابق ان کا فیصلہ کرنا ہے۔ یہاں تک کہ قیامت کے دن وہ ان لوگوں میں سے ہوں گے جو محمدی صورت (الصورة المحمدية) میں اپنے رب کا محمدی رؤیت (الرؤية المحمدية) کے ساتھ دیدار کریں گے، خواہ تم دنیا میں ہو یا آخرت میں۔ کیونکہ وہ دو حشر والے ہیں: رسولوں کی صف میں بھی حشر ہوں گے اور محمد صلی اللہ علیہ وسلم کے پیروکاروں میں ہمارے ساتھ بھی حشر ہوں گے۔\n\n\"اور مجھے نماز کا حکم دیا\" (وَأَوْصَانِي بِالصَّلَاةِ)۔ یعنی محمد صلی اللہ علیہ وسلم کی امت میں فرض کی گئی نماز کو قائم کرنے کا، کیونکہ انہوں نے اس میں الف لام (تعریف) کے ساتھ ذکر کیا۔\n\n\"اور زکوٰۃ کا بھی\" (وَالزَّكَاةِ)۔ اسی طرح، \"جب تک میں زندہ رہوں\" (مَا دُمْتُ حَيًّا)، یعنی زمانۂ تکلیف (التكليف) تک، جو کہ دنیاوی زندگی ہے۔\n\n\"اور اپنی والدہ کے ساتھ نیک سلوک کرنے والا\" (وَبَرًّا بِوَالِدَتِي)۔ پس انہوں نے خبر دی کہ ان کی تخلیق میں ان کی والدہ کا حصہ ہے، کیونکہ وہ ان کی تکوین (تكوين) کا محل تھیں۔ پس میں نے کہا کہ ان کی تخلیق میں ان کی عنصری نسبت کم ہو گئی، پس وہ اپنے رب سے زیادہ قریب ہو گئے، اور اپنے رب کے لیے اپنی بندگی (عبودية) کے ساتھ زیادہ نئے عہد والے ہو گئے ہیں۔\n\n\"اور مجھے سرکش، بدبخت نہیں بنایا\" (وَلَمْ يَجْعَلْنِي جَبَّارًا شَقِيًّا)۔ کیونکہ یہ صرف جہالت سے ہوتا ہے، اور ان میں جہالت صرف عنصر (العنصر) کی تاریکی کے غلبے کی قوت سے ہوتی ہے۔ اور ہم نے اس کتاب میں کئی مقامات پر عالمِ طبیعت (عالم الطبيعة) کے عالمِ عناصر (عالم العناصر) سے مرتبے کو بیان کیا ہے۔\n\n\"اور سلامتی ہو مجھ پر\" (وَالسَّلَامُ عَلَيَّ)۔ اپنے رب سے اپنے مرتبے اور اس میں اپنے حصے کے علم کی وجہ سے، \"جس دن میں پیدا ہوا\" (يَوْمَ وُلِدْتُ)۔ یعنی پیدائش کے وقت اس مطرود بندے (شیطان) کے اثر سے سلامتی جو بچوں پر پیدائش کے وقت مقرر ہوتا ہے، جب بچہ اس کے چھونے سے گرتے ہی چیختا ہے۔ پس عیسیٰ علیہ السلام کے لیے کوئی چیخ نہیں تھی، بلکہ وہ اللہ تعالیٰ کے لیے سجدہ کرتے ہوئے گرے۔\n\n\"اور جس دن میں مروں گا\" (وَيَوْمَ أَمُوتُ)۔ یہ ان لوگوں کو جھٹلاتا ہے جو ان پر بہتان لگاتے ہیں کہ وہ قتل کیے گئے، پس انہوں نے یہ نہیں کہا کہ \"جس دن میں قتل کیا جاؤں گا\"۔\n\n\"اور جس دن میں زندہ اٹھایا جاؤں گا\" (وَيَوْمَ أُبْعَثُ حَيًّا)۔ یعنی قیامت کبریٰ میں۔ انہوں نے اپنی موت کی تاکید کی۔ پس انہیں یہ حکم اس وقت ملا جب وہ گہوارے میں ایک شیر خوار بچے تھے، پس وہ اپنی خالہ کے بیٹے یحییٰ سے اپنے رب کے ساتھ وصل (الوصلة) میں زیادہ کامل تھے۔ کیونکہ عیسیٰ نے اپنے رب کی سلامتی کے ساتھ خود پر سلامتی بھیجی، اور اسی وجہ سے ان کے بارے میں یہ دعویٰ کیا گیا کہ وہ خدا ہیں۔ جبکہ یحییٰ پر ان کے رب تعالیٰ نے سلامتی بھیجی، اور اس بات پر کوئی نص (نص) نہیں ہے کہ آیا وہ اس سلامتی کو جانتے تھے یا نہیں۔\n\n[کہ لوگوں کے لیے چھوٹے بچے سے حکمت (الحكمة) حاصل کرنا عجیب ہے]\n\nاور جان لو کہ لوگ چھوٹے بچے سے حکمت (الحكمة) کو عجیب سمجھتے ہیں، بڑے سے نہیں، کیونکہ انہوں نے صرف تفکر اور رؤیت (دیکھنے) سے ظاہر ہونے والی حکمت کو ہی جانا ہے۔ اور بچہ عام طور پر اس کا محل نہیں ہوتا، لہٰذا وہ کہتے ہیں کہ وہ اس کے ذریعے بولتا ہے، پس اس ظاہر محل کے ذریعے اللہ کی عنایت ظاہر ہوتی ہے۔\n\nپس یحییٰ اور عیسیٰ کو اس بات میں فضیلت حاصل تھی کہ وہ جو کچھ بولے وہ علمِ ذوق (علم ذوق) پر مبنی تھا، کیونکہ اس زمانے اور اس عمر میں ایسی بات کا ہونا ذوقاً (ذوقاً) ہی صحیح ہو سکتا ہے۔ اور اللہ نے انہیں بچپن میں ہی حکم (حکم) عطا کر دیا، اور وہ نبوت کا حکم تھا جو صرف ذوقاً (ذوقاً) ہی ہوتا ہے۔ پس جس کا یہ حال ہو، تو اس کی وراثت، اگرچہ وہ محمدی ہو، ان دونوں نبیوں یا ان میں سے کسی ایک کی وراثت ہو گی، ان دونوں سے یا ان میں سے کسی ایک سے اس کی نسبت کی قوت کے مطابق۔\n\nاور گہوارے میں ایک جماعت نے کلام کیا ہے، یعنی دودھ پینے کی حالت میں۔ اور ہم نے اس سے بھی بڑا دیکھا ہے: ہم نے ایسے شخص کو دیکھا جس نے اپنی ماں کے پیٹ میں کلام کیا اور ایک واجب ادا کیا، اور وہ یہ کہ اس کی ماں کو چھینک آئی جب وہ اس سے حاملہ تھی، تو اس نے اللہ کی حمد کی۔ تو اس نے اپنی ماں کے پیٹ سے کہا: \"اللہ تم پر رحم کرے\" (يرحمك الله)، ایسی بات جو حاضرین نے سنی۔\n\nاور جہاں تک کلام کے مناسبت کی بات ہے، تو میری بیٹی زینب سے میں نے کھیل کے انداز میں سوال کیا، جب وہ دودھ پینے کی عمر میں تھی اور اس وقت اس کی عمر ایک سال یا اس کے قریب تھی۔ میں نے اس کی ماں اور نانی کی موجودگی میں اس سے کہا: \"اے میری بیٹی! تم اس شخص کے بارے میں کیا کہتی ہو جو اپنی بیوی سے جماع کرتا ہے اور انزال نہیں ہوتا؟\" تو اس نے کہا: \"اس پر غسل واجب ہے\"۔ تو حاضرین کو اس پر تعجب ہوا۔\n\nاور میں نے اس سال اس بیٹی کو چھوڑ دیا اور اسے اس کی ماں کے پاس چھوڑ کر اس سے غائب ہو گیا، اور میں نے اس سال اس کی ماں کو حج کی اجازت دی، اور میں عراق سے مکہ کی طرف چلا۔ جب ہم عرفات پہنچے، تو میں اپنے ساتھ ایک جماعت میں شامی قافلے میں اپنے اہل خانہ کو تلاش کرنے کے لیے نکلا۔ اس نے مجھے دیکھا جب وہ اپنی ماں کا دودھ پی رہی تھی، تو اس نے کہا: \"اے میری ماں! یہ میرے والد آ گئے ہیں\"۔ تو ماں نے دیکھا یہاں تک کہ مجھے دور سے آتے ہوئے دیکھا، اور وہ کہہ رہی تھی: \"یہ میرے والد ہیں، یہ میرے والد ہیں\"۔ تو اس کے ماموں نے مجھے آواز دی، اور میں آگے بڑھا۔ جب اس نے مجھے دیکھا تو ہنسی اور اپنے آپ کو مجھ پر ڈال دیا اور مجھ سے کہنے لگی: \"اے میرے ابا! اے میرے ابا!\"۔ پس یہ اور اس کی مثالیں اسی باب سے ہیں۔",
    "fa": "باب چهارصد و هشتادم در حال قطبی که منزل او [آیه] «و به او در کودکی حکم (نبوت) دادیم» (وَآتَيْنَاهُ الْحُكْمَ صَبِيًّا) بود.\n\n***\n\nتمام قوای انسان، چه روح و چه جسم، از مزاج (طبیعت) اوست؛ پس از راه رشد منحرف مشو.\n\nبه همین دلیل، در هنگام تصرف (فعالیت) ضعیف می‌شود، به سبب علتی که نشأت گرفتن از جسم آن را پذیرفته است.\n\nپس اگر برای تو چیزی آشکار شد که عادت آن را از بین می‌برد، آن حکم خداوند یگانه و بی‌نیاز (الواحد الصمد) است.\n\nمانند عیسی و هر کس از انسان‌ها که شبیه او بود، و هیچ کس در این ربع (جهان) نیست.\n\nاو آنچه را که از خرق عادت برای شما آمده است، می‌آورد، مگر آنکه انسان را در رنج (کبد) آفرید.\n\n### [معنای «تازه عهد پروردگارش»]\n\nخداوند عز و جل فرمود: «و سلام بر او، روزی که زاده شد و روزی که می‌میرد و روزی که زنده برانگیخته می‌شود» (وَسَلَامٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوتُ وَيَوْمَ يُبْعَثُ حَيًّا). این سلامی از جانب خداوند بر اوست. و عیسی علیه السلام از حال خود با خداوند خبر داد، در آنچه خداوند درباره عنایتش به یحیی علیه السلام خبر داده بود: «و سلام بر من، روزی که زاده شدم و روزی که می‌میرم و روزی که زنده برانگیخته می‌شوم» (وَالسَّلَامُ عَلَيَّ يَوْمَ وُلِدْتُ وَيَوْمَ أَمُوتُ وَيَوْمَ أُبْعَثُ حَيًّا). و وارث محمدی (ص) افزود: «من پیامبر بودم در حالی که آدم میان آب و گِل بود.»\n\n***\n\nعنایت دوران جوانی قوی است، زیرا به نص (صریح) دارای قرب الهی است.\n\nزیرا علوم این قوم (اهل الله) ذوق و تجربه (خبرة) است، و اینها علومی نیستند که با کاوش (فحص) درک شوند.\n\n***\n\nهمانا رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) خود را آشکار ساخت و لباس را کنار زد و هنگامی که باران آمد و به او رسید، فرمود: «این تازه عهد پروردگارش است» (إنه حديث عهد بربه).\n\nاین همان نص آشکاری است که از شریعت درباره بارانی که به پروردگار نزدیک است، آمده است. پس هر اولی در عالم، تازه عهد پروردگارش است. و هر آنچه در عالم اول است، یک شیء است، و در وجود خود تازه عهد پروردگارش است، زیرا به آن فرمود: «باش» (كُنْ). پس تمام عالم، عالم امر است، چه از عالم خلق باشد و چه نباشد. و ما بیان کردیم که عالم امر و خلق چیست؛ و آن وجه خاصی است که در عالم خلق وجود دارد و هیچ یک از اهل نظر در علم الهی بر آن آگاه نشده‌اند، مگر اهل الله از طریق ذوق.\n\nو چون برای کودک دو نوع از این قرب وجود دارد، که یکی قرب تکوین و شنیدن است، و هیچ مانعی بین او و درک قربش به خداوند حائل نمی‌شود، به دلیل دوری‌اش از عالم ارکان (عناصر) در خلقتش؛ پس او از پدری عنصری نبود، بلکه روح خدا و «کلمه‌ای بود که آن را به مریم القا کرد» (وَكَلِمَتُهُ أَلْقَاهَا إِلَى مَرْيَمَ). پس چیزی نبود که او را از مبدأ صدورش غایب کند. لذا در حالی که از آنچه مشاهده کرده بود خبر می‌داد، در گهواره‌اش در برابر قومش که بر مادرش مریم تهمت زده بودند، حکم کرد. پس خداوند او را با سخن گفتن عیسی و با ناله کردن تنه درخت خرما به سوی او تبرئه کرد. زیرا شریعت در حکم کردن بیشتر به دو شاهد عادل نیاز دارد، و هیچ عادلی عادل‌تر از این دو نیست.\n\nپس گفت: «من بنده خدا هستم» (إِنِّي عَبْدُ اللَّهِ). بدین ترتیب بر خود به عبودیت (بندگی) برای خدا حکم کرد و نگفت پسر فلان، زیرا او در آنجا نبود. بلکه حق (الحق) در صورت روح جبرئیل تجلی (التجلی) کرد، به دلیل جبری که در این قضیه وجود داشت و طبیعت را با این تکوین خاص و غیرمعمول حکم کرد. «به من کتاب داده است» (آتَانِيَ الْكِتَابَ). پس انجیلش را پیش از بعثتش به دست آورد و بر بینه‌ای از پروردگارش بود. پس حکم کرد که مالک کتاب الهی خود است. و «مرا پیامبر قرار داده است» (وَجَعَلَنِي نَبِيًّا). پس حکم کرد که نبوت با جعل (قرار دادن الهی) است، زیرا خداوند می‌فرماید: «در هر صورتی که خواست تو را ترکیب کرد» (فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ). پس او در صورت با جعل است تا کسی گمان نکند که این امر ذاتی است، بلکه اختصاصی الهی است. و «مرا مبارک قرار داده است» (وَجَعَلَنِي مُبَارَكًا)، یعنی مرا به افزایشی اختصاص داده که برای دیگری حاصل نشده است. و آن افزایش، ختم ولایت او، و نزولش در آخرالزمان، و حکم کردنش به شریعت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است، تا روز قیامت از کسانی باشد که پروردگارش را با رؤیت محمدی (ص) در صورت محمدی (ص) می‌بیند، هر کجا که باشی، چه در دنیا و چه در آخرت. زیرا او صاحب دو حشر است: در صف رسولان محشور می‌شود و با ما در پیروان محمد (صَلَّى اللهُ عَليهِ وسَلَّم) محشور می‌شود. و «مرا به نماز سفارش کرده است» (وَأَوْصَانِي بِالصَّلَاةِ) که در امت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) واجب شده است که آن را برپا دارم، زیرا در آن الف و لام (تعریف) آمده است. و «زکات» (وَالزَّكَاةِ) نیز همین‌طور، «تا زمانی که زنده‌ام» (مَا دُمْتُ حَيًّا)، یعنی در زمان تکلیف که همان زندگی دنیاست. و «نیکوکار به مادرم» (وَبَرًّا بِوَالِدَتِي). پس خبر داد که در خلقتش شکافی وجود دارد، زیرا مادرش بر او ولادتی دارد، چون محل تکوین او بوده است. پس گفتم: نسبت عنصری او در خلقتش کم بود، پس به پروردگارش نزدیک‌تر بود و عهدش به عبودیت (بندگی) پروردگارش تازه‌تر بود. و «مرا زورگوی بدبخت قرار نداده است» (وَلَمْ يَجْعَلْنِي جَبَّارًا شَقِيًّا). زیرا این صفات جز از کسی که جاهل باشد صادر نمی‌شود، و جهل در این مورد تنها از قدرت سلطه ظلمت عنصر (طبیعت) ناشی می‌شود. و ما مرتبه عالم طبیعت را نسبت به عالم عناصر در مواضعی از این کتاب بیان کرده‌ایم. و «سلام بر من» (وَالسَّلَامُ عَلَيَّ)، به دلیل علمش به مرتبه خود نزد پروردگارش و بهره‌اش از او، «روزی که زاده شدم» (يَوْمَ وُلِدْتُ). یعنی برای او در ولادتش سلامتی از تأثیر بنده رانده شده‌ای (شیطان) است که هنگام تولد موکل بر کودکان است، زمانی که کودک به دلیل ضربه او فریاد می‌زند. اما عیسی علیه السلام فریادی نداشت، بلکه سجده‌کنان برای خداوند متعال فرود آمد. و «روزی که می‌میرم» (وَيَوْمَ أَمُوتُ)، دروغ کسانی را که بر او افترا می‌بندند که کشته شده است، تکذیب می‌کند. پس نگفت: «روزی که کشته می‌شوم». و «روزی که زنده برانگیخته می‌شوم» (وَيَوْمَ أُبْعَثُ حَيًّا)، یعنی در قیامت کبری، مرگ خود را تأکید کرد. پس حکم (نبوت) در حالی که او کودکی شیرخوار در گهواره بود، به او داده شد. بنابراین، او در وصله (اتصال) به پروردگارش کامل‌تر از یحیی پسر خاله‌اش بود، زیرا عیسی با سلام پروردگارش بر خود سلام کرد و به همین دلیل ادعا شد که او خداست، در حالی که یحیی را پروردگارش سلام داد و نص صریحی وجود ندارد که آیا یحیی از آن سلام بر خود آگاه بود یا نبود.\n\n### [اینکه مردم گرفتن حکمت از کودک خردسال را عجیب می‌دانند]\n\nو بدان که مردم تنها از کودک خردسال در مقابل بزرگسال، حکمت را عجیب می‌شمارند، زیرا آنها جز به حکمت ظاهری که از تفکر و دیدن (رؤیت) حاصل می‌شود، عادت نکرده‌اند، و کودک به طور معمول محل این امور نیست. پس می‌گویند: او به آن نطق می‌کند و عنایت خداوند در این محل ظاهر می‌شود. پس یحیی و عیسی برتری یافتند به اینکه بر آنچه نطق کردند، علم داشتند؛ علم ذوق. زیرا چنین چیزی در این زمان و سن، صحیح نیست که جز ذوق باشد. و خداوند در کودکی به او حکم (الحکم) داد، و آن حکم نبوت است که جز با ذوق حاصل نمی‌شود. پس هر کس که این (ذوق) عادت او باشد، وراثت او، اگرچه محمدی (ص) باشد، از این دو پیامبر یا از یکی از آنهاست، بر حسب قوت نسبت او با آن دو یا با یکی از آنها.\n\nو گروهی در گهواره، یعنی در حال شیرخوارگی، سخن گفته‌اند. و ما بزرگ‌تر از این را دیده‌ایم: کسی را دیدیم که در شکم مادرش سخن گفت و واجبی را ادا کرد. و آن این بود که مادرش در حالی که به او حامله بود عطسه کرد و خدا را حمد گفت. پس او از شکم مادرش به او گفت: «خدا تو را رحمت کند» (يرحمك الله)، با کلامی که حاضران آن را شنیدند.\n\nو اما آنچه مناسب این سخن است، این است که من از دخترم زینب، در حالی که با او بازی می‌کردم و او در سن شیرخوارگی بود و در آن زمان حدود یک سال یا نزدیک به آن سن داشت، پرسیدم. در حضور مادر و مادربزرگش به او گفتم: ای دخترکم، درباره مردی که با همسرش نزدیکی می‌کند و انزال نمی‌شود، چه می‌گویی؟ او گفت: غسل بر او واجب است. حاضران از این امر تعجب کردند.\n\nو من در همان سال از این دختر جدا شدم و او را نزد مادرش گذاشتم و غایب شدم. و به مادرش اجازه دادم که در همان سال به حج برود و من از طریق عراق به مکه رفتم. هنگامی که به عرفات رسیدیم، من با گروهی که همراهم بودند بیرون رفتم تا خانواده‌ام را در کاروان شامی پیدا کنم. او مرا دید در حالی که پستان مادرش را می‌مکید، پس گفت: ای مادرم، این پدرم آمده است. مادرش نگاه کرد تا مرا دید که از دور می‌آیم، در حالی که دختر می‌گفت: این پدرم است، این پدرم است. دایی‌اش مرا صدا زد و من جلو رفتم. هنگامی که مرا دید، خندید و خود را به آغوش من انداخت و شروع کرد به گفتن: ای پدرم، ای پدرم. این و امثال آن از این باب است."
  },
  "page_count": 2
}