{
  "id": 410,
  "title": {
    "ar": "الباب العاشر وأربعمائة في معرفة منازلة وأَنَّ إِلى‏ رَبِّكَ الْمُنْتَهى‏ فاعتزوا بي تسعدوا",
    "en": "Chapter Four Hundred and Ten: Concerning the knowledge of His stations [of descent] (منازلة), and that <<وَأَنَّ إِلَى رَبِّكَ الْمُنْتَهَى>> (And that to your Lord is the final end), so seek might through Me, and you shall attain felicity.",
    "ur": "باب چار سو دس: اس کے منازل (منازلة) کی معرفت (المعرفۃ) کے بیان میں اور یہ کہ: \"اور یہ کہ آپ کے رب ہی کی طرف آخری ٹھکانہ ہے (وَأَنَّ إِلَىٰ رَبِّكَ الْمُنتَهَىٰ)\"، پس مجھ سے عزت حاصل کرو، تم سعادت مند ہو جاؤ گے۔",
    "fa": "باب چهارصد و دهم در معرفت منازل او و اینکه «پایان (و بازگشت) به سوی پروردگار توست» (إِلَىٰ رَبِّكَ الْمُنتَهَىٰ)؛ پس به من پناه بگیرید تا سعادتمند شوید."
  },
  "content": {
    "ar": "## «الباب العاشر وأربعمائة في معرفة منازلة وأَنَّ إِلى‏ رَبِّكَ الْمُنْتَهى‏ فاعتزوا بي تسعدوا»\n\n\n> وليس وراء الله مرمى لرام *** هذا هو الحق الذي لا يرام‏\n\n\n> هذا مقام الحق لا تعتدوا *** يحرم في هذا المقام المقام‏\n\n\n> إذا وصلتم إخوتي فارجعوا *** هذا وجود ما لديه انصرام‏\n\n\n> رجوعكم منه إليكم فما *** ثم سوى عين الورى والإمام‏\n> كونوا أعزاء به تسعدوا *** فليس عز غير عز الإمام‏\n\n\n> لما رأوا أعراضهم لم تقم *** ولم يروا أحوالهم في دوام‏\n\n\n> قالوا أنام الحق عن كوننا *** لذاك سموا في اللسان الأنام‏\n\n\n### [ليس وراء الله وجود]\n\n\nقال الله تعالى يا أَهْلَ يَثْرِبَ لا مُقامَ لَكُمْ فَارْجِعُوا وقال تعالى وأَنَّ إِلى‏ رَبِّكَ الْمُنْتَهى‏ وقال صَلَّى اللهُ عَليهِ وسَلَّم ليس وراء الله مرمى وقال والله من وَرائِهِمْ مُحِيطٌ وما ثم إلا الله ونحن وهو من ورائنا محيط فليس وراء الله مرمى إلا العدم المحض الذي ما فيه حق ولا خلق فهو تعالى المحيط بنا فالوراء منا له من كل وجهة فلا نراه أبدا من هذه الآية لأن وجوهنا إنما هي مقبلة مصروفة إلى نقطة المحيط لأنا منها خرجنا فلم يتمكن لنا أن نستقبل بوجوهنا إلا هي فهي قبلتنا وهي إمامنا ومن كان هذا نعته والأمر كرى فبالضرورة يكون الوراء منا للمحيط بنا فإذا نظرنا إلى قوله وأَنَّ إِلى‏ رَبِّكَ الْمُنْتَهى‏ فإنما يريد بظهورنا لا بوجوهنا فإن مشينا إلى المحيط القهقري فهو من ورائنا محيط لأنه الوجود فلو لم يكن من ورائنا لكان انتهاؤنا إلى العدم ولو وقعنا في العدم ما ظهر لنا عين فمن المحال وقوعنا في العدم لأن الله وهو الوجود المحض من ورائنا محيط بنا إليه ننتهي فيحول وجوده وإحاطته بيننا وبين العدم فليس بين قوله وأَنَّ إِلى‏ رَبِّكَ الْمُنْتَهى‏ وبين قوله والله من وَرائِهِمْ مُحِيطٌ تقابل لا يمكن معه الجمع بينهما بل الجمع بينهما معلوم فالعالم بين النقطة والمحيط فالنقطة الأول والمحيط الآخر فالحفظ الإلهي يصحبنا حيثما كنا فيصرفنا\n\n\nمنه إليه والأمر دائرة ما لها طرف يشهد فيوقف عنده فلهذا قيل للمحمدي الذي له مثل هذا الكشف لا مُقامَ لَكُمْ لكون الأمر دوريا فارجعوا فلا يزال العالم سابحا في فلك الوجود دائما إلى غير نهاية إذ لا نهاية هناك ولا يزال وجه العالم أبدا إلى الاسم الأول الذي أوجده ناظرا ولا يزال ظهر العالم إلى الاسم الآخر المحيط الذي ينتهي إليه بورائه ناظرا فإن العالم يرى من خلفه كما يرى من أمامه ولكن يختلف إدراكه باختلاف الحال عليه ولو لا الاختلاف ما تميز عين ولا كان فرقان‏\n\n\n> إن الوجود رحى علي تدور *** وأنا لها قطب فلست أبور\n\n\n> لو زلت ما دارت ولا كانت رحى *** فالفقر نعت الكون فهو فقير\n\n\n> يا جاهلا بالأمر وهو مشاهد *** اعلم بأنك بالأمور خبير\n\n\n> الجمع يحجب فرقه عن عينه *** وهو الدليل عليه فهو بصير\n\n\nقيل لطائفة ارْجِعُوا وَراءَكُمْ فَالْتَمِسُوا نُوراً فقيل لهم حق لأن الله من وَرائِهِمْ مُحِيطٌ وهو النور فلو لم يضرب بالسور بينه وبينهم لوجدوا النور الذي التمسوه حين قيل لهم فَالْتَمِسُوا نُوراً فإن الحياة الدنيا محل اكتساب الأنوار بالتكاليف وأنها دار عمل مشروع فهي دار ارتقاء واكتساب فلما أقبلوا على الآخرة صارت الدنيا وراءهم فقيل لهم ارْجِعُوا وَراءَكُمْ فَالْتَمِسُوا نُوراً أي لا يكون لأحد نور إلا من حياته الدنيا فحال سور المنع بينهم وبين الحياة الدنيا فالسور دائرة بين النقطة والمحيط فأهل الجنان بين السور والمحيط فالنور من ورائهم وباطن السور إليهم الذي فيه الرحمة ووجه السور الذي هو ظاهره ينظر إلى نقطة المحيط وأهل النار بين النقطة وظاهر السور وظاهِرُهُ من قِبَلِهِ الْعَذابُ إلى الأجل المسمى فهو حائل بين الدارين لا بين الصفتين فإن السور في نفسه رحمة وعينه عين الفصل بين الدارين لأن العذاب من قبله ما هو فيه والرحمة فيه فلو كان فيه العذاب لتسرمد العذاب على أهل النار كما تتسرمد الرحمة على أهل الجنة فالسور لا يرتفع وكونه رحمة لا يرتفع ولا بد أن يظهر ما في الباطن على الظاهر فلا بد من شمول الرحمة لمن هو قبل ظاهر السور ولهذا قيل لهم فَالْتَمِسُوا نُوراً فلو قيل لهم التمسوا رحمة لوجدوها من حينهم بوجود السور فإذا أراد أهل الجنة أن يتنعموا برؤية أهل النار يصعدون على ذلك السور فينغمسون في الرحمة فيطلعون على أهل النار فيجدون من لذة النجاة منها ما لا يجدونه من نعيم الجنة لأن الأمن الوارد على الخائف أعظم لذة عنده من الأمن المستصحب له وينظرن أهل النار إليهم بعد شمول الرحمة فيجدون من اللذة بما هم في النار ويحمدون الله تعالى حيث لم يكونوا في الجنة وذلك لما يقتضيه مزاجهم في تلك الحالة فلو دخلوا الجنة بذلك المزاج لأدركهم الألم‏\nولتضرروا فإذا عقلت فليس النعيم إلا الملائم وليس العذاب إلا غير الملائم كان ما كان فكن حيث كنت إذا لم يصبك إلا ما يلائمك فأنت في نعيم وإذا لم يصبك إلا ما لا يلائم مزاجك فأنت في عذاب حببت المواطن إلى أهلها وأهل النار الذين هم أهلها هي موطنهم ومنها خلقوا وإليها رجعوا وأهل الجنة الذين هم أهلها منها خلقوا وإليها رجعوا فلذة الموطن ذاتية لأهل الموطن غير أنهم محجوبون بأمر عارض عرض لهم من أعمالهم من إفراط وتفريط فتغير عليهم الحال فحجبهم عن لذة الموطن ما قام بهم من الأمراض التي أدخلوها على أنفسهم حتى إنهم لو لم يعملوا ما يوجب لهم وجود الآلام والأسقام وحشروا من قبورهم على مزاج وطنهم وخيروا بين الجنة والنار لاختاروا النار كما يختار السمك الماء ويفر من الهواء الذي به حياة أهل البر فيموت أهل البر بما يحيا به أهل الماء ويموت أهل الماء بما يحيا به أهل البر فاعلم ذلك وأنت فلا يصح لك البقاء مع الحق على الدوام فإنه لا بد أن يقال ردوهم إلى قصورهم ولم يقل ردوهم إلى بيوتهم ولا إلى أزواجهم فما جاء بلفظ القصور إلا للمعنى المعقول منه فإذا ردوهم إلى قصورهم وأشرفوا على ملكهم فمن المحال أن يظهروا فيه عبيدا وإنما يظهرون فيه ملوكا فيعظمهم أهلهم وتقوم العزة عليهم في نفوسهم فتقول لهم الحقيقة ليكن عزكم الذي اقتضاه لكم الموطن بالله لا بنفوسكم فيعتزون في ملكهم بعز الله فتكون العزة لله بالأصالة ولِرَسُولِهِ ولِلْمُؤْمِنِينَ خلعة إلهية لا بالأصالة فيسعدون بهذا العلم عند الله ويجدونه في التجلي المستأنف مع أن العلماء بالله لا يزالون في تجل دائم لما علموا أن الحق عين كل صورة ومع هذا فلهم التجلي العام في الكثيب فإن ذلك يعطي ذوقا آخر خلاف هذا الذوق الذي يجدونه دائما والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى السفر الثامن والعشرون بانتهاء الباب العاشر وأربعمائة\n\n\nبسم الله الرحمن الرحيم‏\n\n",
    "en": "Chapter Four Hundred and Ten: Concerning the Gnosis of its Stations, and that <<to your Lord is the ultimate end>> (Quran 53:42), so seek might through Me, and you shall be blessed.\n\nThere is no target beyond Allah for the seeker,\nThis is The Real (الحق) that cannot be sought.\n\nThis is the Station of The Real; do not transgress.\nDwelling (المقام) is forbidden in this Station.\n\nWhen you reach, my brothers, then return.\nThis is an Existence (وجود) that has no cessation.\n\nYour return from Him is back to yourselves, for\nThere is nothing there but the very Essence (عين) of creatures and the Leader (الإمام).\nBe mighty through Him, and you shall be blessed,\nFor there is no might (عز) other than the might of the Leader.\n\nWhen they saw that their accidents (أعراضهم) did not endure,\nAnd they did not see their spiritual states (أحوالهم) in permanence,\n\nThey said, \"Did The Real (الحق) sleep concerning our existence?\"\nFor that reason, they were named *al-Anām* (mankind) in language.\n\n[There is no Existence beyond Allah]\n\nAllah Almighty said: <<O people of Yathrib, there is no dwelling place for you, so return>> (Quran 33:13). And He Almighty said: <<and that to your Lord is the ultimate end>> (Quran 53:42). And the Prophet, peace and blessings be upon him, said: \"There is no target beyond Allah.\" And He said: <<But Allah is encompassing them from behind>> (Quran 85:20). There is nothing there except Allah, and we are He, and He is encompassing us from behind. Thus, there is no target beyond Allah except pure non-existence (العدم المحض), in which there is neither The Real (حق) nor creation (خلق). He, exalted is He, is the One who encompasses us. Therefore, the 'behind' (الوراء) is from us to Him, from every direction. We never see Him from the perspective of this verse, because our faces are only turned and directed toward the point of the Encompasser (المحيط), for we emerged from it. It is not possible for us to face anything with our faces except Him. He is our *Qibla* (direction of prayer), and He is our Leader (إمام). When this is the description of a person, and the matter is circular (كرى), then necessarily, the 'behind' is from us to the One who encompasses us.\n\nWhen we consider His saying: <<and that to your Lord is the ultimate end>>, He only means by our backs (بظهورنا), not by our faces (بوجوهنا). For if we walk backward (القهقري) toward the Encompasser, He is encompassing us from behind, because He is Existence (الوجود). If He were not behind us, our end would be non-existence (العدم). And if we fell into non-existence, no essence (عين) would appear for us. It is impossible for us to fall into non-existence, because Allah, who is Pure Existence (الوجود المحض), encompasses us from behind. We end at Him, and His Existence and His encompassing intervene between us and non-existence. Thus, there is no contradiction (تقابل) between His saying <<and that to your Lord is the ultimate end>> and His saying <<But Allah is encompassing them from behind>> that would prevent their reconciliation. Rather, their reconciliation is known.\n\nThe world (العالم) is between the Point (النقطة) and the Encompasser (المحيط). The Point is the First (الأول), and the Encompasser is the Last (الآخر). The Divine Preservation (الحفظ الإلهي) accompanies us wherever we are, turning us from Him to Him. The matter is a circle (دائرة) that has no discernible end (طرف يشهد) at which one might stop. For this reason, the Muhammadan (المحمدي) who possesses such Unveiling (الكشف) is told: <<there is no dwelling place for you>> (لا مُقامَ لَكُمْ), because the matter is cyclical (دوريا), so <<return>> (فارجعوا). The world will perpetually swim in the orbit of Existence (فلك الوجود) eternally, without end, since there is no end there. The face of the world will forever look toward the Name *al-Awwal* (The First) who brought it into existence, and the back of the world will forever look toward the Name *al-Akhir* (The Last), the Encompasser, to whom it ultimately returns by its back. The world sees from behind just as it sees from in front, but its perception differs according to the difference in its state. Were it not for this difference, no essence (عين) would be distinguished, nor would there be a Criterion (فرقان).\n\nExistence (الوجود) is a millstone that turns upon me,\nAnd I am its Pole (قطب), so I shall not perish.\n\nIf I were removed, it would not turn, nor would it be a millstone,\nFor poverty (الفقر) is the description of the cosmos, and thus it is poor.\n\nO ignorant one concerning the matter, though it is witnessed,\nKnow that you are expert in all matters.\n\nThe Unity (الجمع) veils its separation (فرق) from its essence (عينه),\nYet it is the proof for it, so it is seeing (بصير).\n\nA group was told: <<Return behind you and seek light>> (Quran 57:13). They were told the truth, because Allah is <<encompassing them from behind>> (Quran 85:20), and He is the Light (النور). If the Wall (السور) had not been erected between Him and them, they would have found the Light they sought when they were told: <<and seek light>>. For the life of this world (الحياة الدنيا) is the place for acquiring lights through divine obligations (التكاليف). It is the abode of prescribed action (عمل مشروع); thus, it is the abode of ascent and acquisition. When they turned toward the Hereafter, the world became behind them. So they were told: <<Return behind you and seek light>>—meaning, no one has light except from his life in this world.\n\nThe wall of prevention (سور المنع) intervened between them and the life of this world. The Wall (السور) is a circle between the Point (النقطة) and the Encompasser (المحيط). The people of Paradise (أهل الجنان) are between the Wall and the Encompasser. The Light is behind them, and the inner side (باطن) of the Wall, which contains Mercy (الرحمة), faces them. The face of the Wall, which is its outer side (ظاهره), looks toward the Point of the Encompasser. The people of the Fire (أهل النار) are between the Point and the outer side of the Wall, and <<its outer side, toward it, is the torment>> (Quran 57:13) until the appointed term. It is a barrier (حائل) between the two abodes (الدارين), but not between the two Attributes (الصفات). For the Wall itself is Mercy, and its essence (عينه) is the very essence of separation (الفصل) between the two abodes, because the torment is *from* its side, not *in* it, while the Mercy is *in* it. If the torment were in it, the torment upon the people of the Fire would be eternal (تسرمد) just as the Mercy upon the people of Paradise is eternal. The Wall does not lift, and its being Mercy does not lift.\n\nWhat is in the inner side (الباطن) must necessarily appear on the outer side (الظاهر). Therefore, Mercy must encompass those who are before the outer side of the Wall. This is why they were told: <<and seek light>>. If they had been told to seek mercy, they would have found it immediately by the very existence of the Wall.\n\nWhen the people of Paradise wish to enjoy the sight of the people of the Fire, they ascend that Wall and immerse themselves in Mercy. They look down upon the people of the Fire and find a pleasure in having been saved from it that they do not find in the bliss of Paradise, because the security granted to the fearful is a greater pleasure for him than the security that is constantly with him. The people of the Fire look up at them after the Mercy has encompassed them, and they find pleasure in being in the Fire, and they praise Allah Almighty that they were not in Paradise. This is due to what their temperament (مزاجهم) requires in that state. If they had entered Paradise with that temperament, pain would have afflicted them and they would have been harmed.\n\nIf you understand this, then bliss (النعيم) is nothing but what is suitable (الملائم), and torment (العذاب) is nothing but what is unsuitable (غير الملائم), whatever the case may be. So be wherever you are: if nothing afflicts you except what is suitable for you, you are in bliss. If nothing afflicts you except what is unsuitable for your temperament, you are in torment.\n\nThe abodes (المواطن) were made beloved to their inhabitants. The people of the Fire, who are its inhabitants, that is their abode; from it they were created and to it they returned. The people of Paradise, who are its inhabitants, from it they were created and to it they returned. The pleasure of the abode is intrinsic (ذاتية) to the inhabitants of the abode, except that they are veiled by an accidental matter (أمر عارض) that befell them due to their actions—excess or negligence—so their state changed. The illnesses they brought upon themselves veiled them from the pleasure of the abode.\n\nIndeed, if they had not performed the actions that necessitated the existence of pains and sicknesses for them, and they were resurrected from their graves according to the temperament of their homeland, and they were given a choice between Paradise and the Fire, they would choose the Fire, just as the fish chooses water and flees from the air, which is the life of the land dwellers. The land dwellers die by what the water dwellers live by, and the water dwellers die by what the land dwellers live by. Know this.\n\nAs for you, it is not correct for you to remain in Subsistence (البقاء) with The Real (الحق) perpetually, for it must inevitably be said: \"Return them to their palaces (قصورهم).\" It was not said: \"Return them to their houses (بيوتهم)\" or \"to their spouses (أزواجهم).\" The word \"palaces\" (القصور) was only used for the conceptual meaning (المعنى المعقول) derived from it. When they are returned to their palaces and look upon their dominion (ملكهم), it is impossible for them to appear therein as slaves; rather, they appear therein as kings. Their families honor them, and might (العزة) arises within their souls. Then the Reality (الحقيقة) says to them: \"Let your might, which the abode necessitated for you, be through Allah, not through your souls.\" So they seek might in their dominion through the Might of Allah. Thus, the Might belongs to Allah by originality (بالأصالة), and to <<His Messenger and to the believers>> (Quran 63:8) as a Divine Robe of Honor (خلعة إلهية), not by originality. They are blessed by this Knowledge (العلم) in the presence of Allah and find it in the renewed Theophany (التجلي المستأنف).\n\nDespite this, the Gnostics of Allah (العلماء بالله) remain in perpetual Theophany (تجل دائم) because they know that The Real (الحق) is the essence (عين) of every form. Nevertheless, they have the general Theophany (التجلي العام) on the Mound (الكثيب), for that grants another taste (ذوقا آخر) contrary to this taste they find constantly. <<And Allah speaks the Truth, and He guides to the way>> (Quran 33:4).\n\nThe twenty-eighth journey (السفر الثامن والعشرون) concluded with the end of Chapter Four Hundred and Ten.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "باب نمبر چار سو دس، اس کے ٹھکانوں کی معرفت میں اور اس فرمان کے بارے میں کہ \"اور یہ کہ آپ کے رب ہی کی طرف آخری ٹھکانہ ہے (وَأَنَّ إِلَىٰ رَبِّكَ الْمُنْتَهَىٰ)\"، پس مجھ سے عزت حاصل کرو تاکہ تم کامیاب ہو جاؤ۔\n\n***\n\n> اللہ کے ماوراء کسی تیر انداز کے لیے کوئی نشانہ نہیں،\n> یہی وہ حق (الحق) ہے جس کا نشانہ نہیں لیا جا سکتا۔\n\n> یہ ذات حق (الحق) کا مقام ہے، تجاوز نہ کرو،\n> اس مقام پر قیام (المقام) حرام ہے۔\n\n> اے میرے بھائیو! جب تم پہنچ جاؤ تو واپس لوٹ آؤ،\n> یہ وہ وجود (الوجود) ہے جس کے پاس کوئی انتہا نہیں۔\n\n> تمہارا اس سے تمہاری طرف لوٹنا ہے، پس\n> وہاں مخلوق کی عین (حقیقت) اور امام کے سوا کچھ نہیں۔\n> اس کے ذریعے معزز بنو تاکہ تم کامیاب ہو جاؤ،\n> کیونکہ امام کی عزت کے سوا کوئی عزت نہیں۔\n\n> جب انہوں نے دیکھا کہ ان کی صفات (أعراض) قائم نہیں رہیں،\n> اور نہ ہی ان کے احوال (أحوال) میں دوام رہا۔\n\n> انہوں نے کہا کہ ذات حق (الحق) ہماری ہستی (کون) سے سو گئی،\n> اسی لیے زبان میں انہیں \"انام\" (مخلوق) کہا گیا۔\n\n***\n\n### [اللہ کے ماوراء کوئی وجود نہیں]\n\nاللہ تعالیٰ نے فرمایا: \"اے یثرب والو! تمہارے لیے ٹھہرنے کی جگہ نہیں، پس لوٹ جاؤ (يَا أَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ فَارْجِعُوا)\"۔ اور اللہ تعالیٰ نے فرمایا: \"اور یہ کہ آپ کے رب ہی کی طرف آخری ٹھکانہ ہے (وَأَنَّ إِلَىٰ رَبِّكَ الْمُنْتَهَىٰ)\"۔ اور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"اللہ کے ماوراء کوئی نشانہ نہیں (ليس وراء الله مرمى)\"۔ اور فرمایا: \"اور اللہ ان کے پیچھے سے انہیں گھیرے ہوئے ہے (وَاللَّهُ مِنْ وَرَائِهِمْ مُحِيطٌ)\"۔ اور وہاں اللہ کے سوا کچھ نہیں، اور ہم اور وہ (اللہ) ہمارے پیچھے سے ہمیں گھیرے ہوئے ہے۔ پس اللہ کے ماوراء کوئی نشانہ نہیں سوائے عدم محض (العدم المحض) کے، جس میں نہ حق (الحق) ہے اور نہ خلق (الخلق)۔ پس وہ (اللہ) ہی ہمیں گھیرنے والا (المحيط) ہے۔ لہٰذا ہر جہت سے ہمارا \"ماوراء\" (الوراء) اسی کے لیے ہے۔\n\nہم اسے اس آیت کی وجہ سے کبھی نہیں دیکھ سکتے، کیونکہ ہمارے چہرے صرف نقطۂ محیط (نقطة المحيط) کی طرف متوجہ اور مائل ہیں۔ اس لیے کہ ہم اسی سے نکلے ہیں۔ پس ہمارے لیے ممکن نہیں کہ ہم اپنے چہروں سے کسی اور کا استقبال کریں سوائے اس کے۔ پس وہی ہمارا قبلہ ہے اور وہی ہمارا امام ہے۔ اور جس کی یہ صفت ہو اور معاملہ دائرہ نما ہو، تو لازمی طور پر ہمارا \"ماوراء\" (الوراء) ہمیں گھیرنے والے (المحيط) کے لیے ہوگا۔\n\nپس جب ہم اس فرمان پر غور کرتے ہیں کہ \"اور یہ کہ آپ کے رب ہی کی طرف آخری ٹھکانہ ہے (وَأَنَّ إِلَىٰ رَبِّكَ الْمُنْتَهَىٰ)\"، تو اس سے مراد ہمارا ظہور ہے نہ کہ ہمارے چہروں سے۔ کیونکہ اگر ہم محیط (المحيط) کی طرف پیچھے کی جانب چلیں، تو وہ ہمارے پیچھے سے گھیرے ہوئے ہے، کیونکہ وہ وجود (الوجود) ہے۔ اگر وہ ہمارے پیچھے سے نہ ہوتا تو ہماری انتہا عدم (العدم) پر ہوتی۔ اور اگر ہم عدم میں جا پڑتے تو ہماری کوئی عین (حقیقت) ظاہر نہ ہوتی۔\n\nپس ہمارا عدم میں واقع ہونا محال ہے، کیونکہ اللہ، جو کہ وجود محض (الوجود المحض) ہے، ہمارے پیچھے سے ہمیں گھیرے ہوئے ہے۔ ہم اسی کی طرف منتہی ہوتے ہیں، پس اس کا وجود (الوجود) اور اس کا احاطہ (إحاطته) ہمارے اور عدم کے درمیان حائل ہو جاتا ہے۔ پس اس کے فرمان \"اور یہ کہ آپ کے رب ہی کی طرف آخری ٹھکانہ ہے (وَأَنَّ إِلَىٰ رَبِّكَ الْمُنْتَهَىٰ)\" اور اس کے فرمان \"اور اللہ ان کے پیچھے سے انہیں گھیرے ہوئے ہے (وَاللَّهُ مِنْ وَرَائِهِمْ مُحِيطٌ)\" کے درمیان کوئی تضاد نہیں جس کی وجہ سے ان دونوں کو جمع کرنا ممکن نہ ہو۔ بلکہ ان دونوں کا جمع ہونا معلوم ہے۔\n\nعالم نقطہ (النقطة) اور محیط (المحيط) کے درمیان ہے۔ پس نقطہ اول (الأول) ہے اور محیط آخر (الآخر) ہے۔ پس الٰہی حفاظت (الحفظ الإلهي) ہر جگہ ہمارے ساتھ رہتی ہے، جو ہمیں اس سے اسی کی طرف پھیرتی رہتی ہے۔ اور معاملہ ایک دائرہ (دائرة) ہے جس کا کوئی ایسا کنارہ نہیں جو مشاہدہ (الشہود) میں آئے اور جہاں ٹھہر جایا جائے۔ اسی لیے محمدی (المحمدي) شخص سے، جسے ایسا کشف (الکشف) حاصل ہو، کہا گیا: \"تمہارے لیے ٹھہرنے کی جگہ نہیں (لَا مُقَامَ لَكُمْ)\"، کیونکہ معاملہ دوری (دائروی) ہے۔ پس \"لوٹ جاؤ (فَارْجِعُوا)\"۔ پس عالم ہمیشہ وجود (الوجود) کے فلک میں ہمیشہ کے لیے تیرتا رہے گا، کیونکہ وہاں کوئی انتہا نہیں ہے۔ اور عالم کا چہرہ ہمیشہ اس اسمِ اول (الاسم الأول) کی طرف دیکھتا رہے گا جس نے اسے وجود بخشا، اور عالم کی پشت ہمیشہ اس اسمِ آخر (الاسم الآخر) کی طرف دیکھتی رہے گی جو محیط (المحيط) ہے اور جس کی طرف وہ اپنی پشت کے ذریعے منتہی ہوتا ہے۔ کیونکہ عالم اپنی پشت سے بھی دیکھتا ہے جیسے وہ اپنے سامنے سے دیکھتا ہے، لیکن اس کا ادراک (إدراكه) اس پر طاری ہونے والے حال (الحال) کے اختلاف سے مختلف ہوتا ہے۔ اگر یہ اختلاف نہ ہوتا تو کوئی عین (حقیقت) ممتاز نہ ہوتی اور نہ ہی کوئی فرقان (تمیز) ہوتا۔\n\n> بے شک وجود (الوجود) ایک چکی ہے جو مجھ پر گھومتی ہے،\n> اور میں اس کا قطب ہوں، پس میں کبھی فنا نہیں ہوتا۔\n\n> اگر میں ہٹ جاؤں تو وہ نہ گھومے اور نہ ہی چکی رہے،\n> پس فقر (الفقر) کون (ہستی) کی صفت ہے، لہٰذا وہ فقیر ہے۔\n\n> اے معاملے سے ناواقف، حالانکہ وہ مشاہدہ (مشاهد) میں ہے،\n> جان لے کہ تو ہی تمام امور کا خبیر ہے۔\n\n> جمع (الجمع) اپنے فرق (الفرق) کو اپنی عین (حقیقت) سے چھپاتا ہے،\n> اور وہی اس پر دلیل ہے، پس وہ بصیر ہے۔\n\nایک گروہ سے کہا گیا: \"اپنے پیچھے لوٹ جاؤ اور نور تلاش کرو (ارْجِعُوا وَرَاءَكُمْ فَالْتَمِسُوا نُورًا)\"۔ ان سے حق کہا گیا، کیونکہ اللہ ان کے پیچھے سے گھیرے ہوئے ہے (وَاللَّهُ مِنْ وَرَائِهِمْ مُحِيطٌ) اور وہی نور (النور) ہے۔ اگر ان کے اور اس کے درمیان دیوار (السور) حائل نہ کی جاتی تو وہ اس نور کو پا لیتے جسے انہوں نے تلاش کیا جب ان سے کہا گیا: \"پس نور تلاش کرو (فَالْتَمِسُوا نُورًا)\"۔ کیونکہ دنیا کی زندگی (الحياة الدنيا) تکالیف کے ذریعے انوار (الأنوار) کے حصول کی جگہ ہے، اور یہ عمل مشروع کا گھر ہے، پس یہ ترقی اور حصول کا گھر ہے۔ جب وہ آخرت کی طرف متوجہ ہوئے تو دنیا ان کے پیچھے رہ گئی۔ پس ان سے کہا گیا: \"اپنے پیچھے لوٹ جاؤ اور نور تلاش کرو (ارْجِعُوا وَرَاءَكُمْ فَالْتَمِسُوا نُورًا)\"، یعنی کسی کے لیے نور نہیں ہوگا مگر اس کی دنیا کی زندگی سے۔\n\nپس منع کی دیوار (سور المنع) ان کے اور دنیا کی زندگی کے درمیان حائل ہو گئی۔ پس یہ دیوار نقطہ (النقطة) اور محیط (المحيط) کے درمیان ایک دائرہ ہے۔ جنت والے (أهل الجنان) دیوار اور محیط کے درمیان ہیں۔ پس نور ان کے پیچھے سے ہے، اور دیوار کا باطن (باطن السور) ان کی طرف ہے جس میں رحمت (الرحمة) ہے۔ اور دیوار کا چہرہ جو اس کا ظاہر (ظاهره) ہے، وہ نقطۂ محیط کی طرف دیکھتا ہے۔ اور جہنم والے (أهل النار) نقطہ اور دیوار کے ظاہر کے درمیان ہیں۔ اور اس کا ظاہر (ظَاهِرُهُ) اس کی طرف سے عذاب (الْعَذَابُ) ہے ایک مقررہ مدت تک۔ پس یہ دونوں گھروں کے درمیان حائل ہے، نہ کہ دونوں صفات کے درمیان۔ کیونکہ دیوار بذات خود رحمت ہے اور اس کی عین (حقیقت) دونوں گھروں کے درمیان فصل (جدائی) کی عین ہے۔ کیونکہ عذاب اس کی طرف سے ہے، وہ اس میں نہیں ہے۔ اور رحمت اس میں ہے۔ اگر عذاب اس میں ہوتا تو جہنم والوں پر عذاب ہمیشہ کے لیے ہوتا، جیسے جنت والوں پر رحمت ہمیشہ کے لیے ہے۔\n\nپس دیوار ختم نہیں ہوگی، اور اس کا رحمت ہونا ختم نہیں ہوگا۔ اور لازمی ہے کہ جو باطن (الباطن) میں ہے وہ ظاہر (الظاهر) پر ظاہر ہو، لہٰذا لازمی ہے کہ رحمت اس شخص کو بھی شامل ہو جو دیوار کے ظاہر سے پہلے ہے۔ اسی لیے ان سے کہا گیا: \"پس نور تلاش کرو (فَالْتَمِسُوا نُورًا)\"۔ اگر ان سے کہا جاتا کہ رحمت تلاش کرو، تو وہ دیوار کے وجود کی وجہ سے اسی وقت اسے پا لیتے۔\n\nپس جب جنت والے جہنم والوں کو دیکھ کر لطف اندوز ہونا چاہیں گے، تو وہ اس دیوار پر چڑھ جائیں گے اور رحمت میں غوطہ زن ہو جائیں گے۔ پھر وہ جہنم والوں پر جھانکیں گے، تو انہیں اس سے نجات کی ایسی لذت ملے گی جو انہیں جنت کی نعمتوں سے نہیں ملتی۔ کیونکہ خوف زدہ شخص کے لیے وارد ہونے والا امن اس امن سے زیادہ لذیذ ہوتا ہے جو اسے پہلے سے حاصل ہو۔ اور جہنم والے رحمت کے شامل ہونے کے بعد ان کی طرف دیکھیں گے، تو انہیں اس لذت کا احساس ہوگا جس میں وہ جہنم میں ہیں، اور وہ اللہ کا شکر ادا کریں گے کہ وہ جنت میں نہیں ہیں۔ یہ اس لیے ہے کہ یہ ان کے مزاج (مزاجهم) کا تقاضا ہے اس حالت میں۔ اگر وہ اس مزاج کے ساتھ جنت میں داخل ہوتے تو انہیں تکلیف پہنچتی اور وہ نقصان اٹھاتے۔\n\nپس اگر تم سمجھ لو، تو نعمت (النعيم) صرف موافقت (الملائم) ہے، اور عذاب (العذاب) صرف ناموافقت (غیر الملائم) ہے۔ جو کچھ بھی ہوا، پس تم جہاں بھی ہو، اگر تمہیں صرف وہی پہنچتا ہے جو تمہارے موافق ہے، تو تم نعمت میں ہو۔ اور اگر تمہیں صرف وہی پہنچتا ہے جو تمہارے مزاج کے موافق نہیں، تو تم عذاب میں ہو۔ مواطن (ٹھکانے) اپنے اہل کو محبوب ہوتے ہیں۔ اور جہنم والے جو اس کے اہل ہیں، وہ ان کا ٹھکانہ ہے، اور وہ اسی سے پیدا کیے گئے اور اسی کی طرف لوٹائے گئے۔ اور جنت والے جو اس کے اہل ہیں، وہ اسی سے پیدا کیے گئے اور اسی کی طرف لوٹائے گئے۔ پس ٹھکانے کی لذت ٹھکانے والوں کے لیے ذاتی ہوتی ہے، مگر وہ ایک عارضی امر کے ذریعے محجوب (محجوبون) ہوتے ہیں جو ان کے اعمال کی وجہ سے ان پر طاری ہوا، جیسے افراط و تفریط۔ پس ان پر حال (الحال) بدل گیا، اور ان بیماریوں نے انہیں ٹھکانے کی لذت سے روک دیا جو انہوں نے خود پر وارد کر لی تھیں۔ یہاں تک کہ اگر انہوں نے ایسے اعمال نہ کیے ہوتے جو ان کے لیے درد اور بیماریوں کا سبب بنتے، اور وہ اپنی قبروں سے اپنے وطن کے مزاج پر اٹھائے جاتے، اور انہیں جنت اور جہنم کے درمیان اختیار دیا جاتا، تو وہ جہنم کو منتخب کرتے، جیسے مچھلی پانی کو منتخب کرتی ہے اور ہوا سے بھاگتی ہے جو خشکی والوں کی زندگی ہے۔ پس خشکی والے اس چیز سے مرتے ہیں جس سے پانی والے زندہ رہتے ہیں، اور پانی والے اس چیز سے مرتے ہیں جس سے خشکی والے زندہ رہتے ہیں۔\n\nپس یہ جان لو۔ اور تمہارے لیے حق (الحق) کے ساتھ ہمیشہ بقا (البقاء) صحیح نہیں ہے، کیونکہ لازمی ہے کہ کہا جائے: \"انہیں ان کے قصوروں (قصورهم) کی طرف لوٹا دو\"۔ اور یہ نہیں کہا گیا کہ انہیں ان کے گھروں یا ان کی بیویوں کی طرف لوٹا دو۔ پس لفظ \"قصور\" (القُصُور) صرف اس معقول معنی کے لیے آیا ہے جو اس سے مراد ہے۔ پس جب انہیں ان کے قصوروں کی طرف لوٹا دیا جائے گا اور وہ اپنی بادشاہت (ملکهم) پر جھانکیں گے، تو یہ محال ہے کہ وہ اس میں غلاموں کی طرح ظاہر ہوں، بلکہ وہ اس میں بادشاہوں کی طرح ظاہر ہوں گے۔ پس ان کے اہل ان کی تعظیم کریں گے اور ان کے نفوس میں ان پر عزت (العزة) قائم ہو جائے گی۔ پس حقیقت (الحقيقة) ان سے کہے گی: تمہاری عزت، جس کا تمہارے ٹھکانے نے تقاضا کیا ہے، اللہ کے ذریعے ہو، نہ کہ تمہارے نفوس کے ذریعے۔ پس وہ اپنی بادشاہت میں اللہ کی عزت کے ذریعے معزز ہوں گے۔ پس عزت (العزة) اللہ کے لیے بالاصالت ہوگی، اور \"اس کے رسول (لِرَسُولِهِ) اور مومنوں (وَلِلْمُؤْمِنِينَ)\" کے لیے الٰہی خلعت ہوگی، نہ کہ بالاصالت۔ پس وہ اللہ کے ہاں اس علم (العلم) کے ذریعے کامیاب ہوں گے اور اسے تجلی مستأنف (التجلي المستأنف) میں پائیں گے، حالانکہ اللہ کے عارفین (العلماء بالله) ہمیشہ دائمی تجلی (تجل دائم) میں رہتے ہیں، کیونکہ وہ جانتے ہیں کہ حق (الحق) ہر صورت کی عین (حقیقت) ہے۔ اس کے باوجود، انہیں ٹیلے (الکثیب) پر عمومی تجلی (التجلي العام) حاصل ہوگی، کیونکہ وہ ایک دوسرا ذوق (ذوق) عطا کرے گی جو اس ذوق سے مختلف ہے جسے وہ ہمیشہ پاتے ہیں۔ اور اللہ حق کہتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ) اور وہی راستہ دکھاتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)۔\n\nسفر نمبر اٹھائیس باب نمبر چار سو دس کے اختتام پر مکمل ہوا۔\n\nبسم اللہ الرحمن الرحیم",
    "fa": "باب چهارصد و دهم در معرفت منازل آن و اینکه «و همانا پایان (منتها) به سوی پروردگار توست» (وَأَنَّ إِلَىٰ رَبِّكَ الْمُنتَهَىٰ)؛ پس به من عزت جویید تا سعادتمند شوید.\n\nو ورای حق (الله) برای جوینده‌ای مقصدی نیست\nاین همان حقی است که طلب نمی‌شود (یا: به آن دسترسی نیست).\n\nاین مقام حق است، تجاوز نکنید\nدر این مقام، اقامت (مقام) حرام است.\n\nای برادرانم، چون رسیدید، بازگردید\nاین هستی (الوجود) است که نزد او گسستنی نیست.\n\nبازگشت شما از او به سوی خودتان است، زیرا\nآنجا جز عین خلق و امام نیست.\nبه او عزیز باشید تا سعادتمند شوید\nزیرا عزتی جز عزت امام نیست.\n\nچون دیدند که اعراضشان (کیفیات عارضی‌شان) پایدار نیست\nو احوالشان را در دوام ندیدند،\n\nگفتند: حق از هستی ما خوابید (غافل شد)\nاز این رو در زبان، «انام» (خلق) نامیده شدند.\n\n[ورای حق (الله) هستی‌ای نیست]\n\nخداوند متعال فرمود: «ای اهل یثرب، برای شما اقامتی نیست، پس بازگردید» (يَا أَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ فَارْجِعُوا). و فرمود: «و همانا پایان (منتها) به سوی پروردگار توست» (وَأَنَّ إِلَىٰ رَبِّكَ الْمُنتَهَىٰ). و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «ورای حق (الله) مقصدی نیست». و فرمود: «و خداوند از پشت سرشان احاطه دارد» (وَاللَّهُ مِن وَرَائِهِم مُّحِيطٌ). و آنجا جز حق (الله) نیست و ما و او هستیم که از پشت سر ما احاطه دارد. پس ورای حق (الله) مقصدی نیست مگر عدم محض (العدم المحض) که در آن نه حق است و نه خلق. پس اوست که بر ما احاطه دارد. بنابراین، ورای ما از هر جهت به سوی اوست. از این آیه، ما هرگز او را نمی‌بینیم، زیرا روی‌های ما تنها به سوی نقطه محیط (المحيط) متوجه و مصروف شده است، چون ما از آن خارج شده‌ایم. پس برای ما ممکن نیست که با روی‌هایمان جز به سوی آن استقبال کنیم؛ پس آن قبله ما و امام ماست. و کسی که وصفش چنین باشد و امر، کروی (دایره‌ای) باشد، بالضروره ورای ما برای محیط (المحيط) احاطه‌کننده بر ما خواهد بود. پس هنگامی که به قول او می‌نگریم: «و همانا پایان (منتها) به سوی پروردگار توست» (وَأَنَّ إِلَىٰ رَبِّكَ الْمُنتَهَىٰ)، منظور او تنها با پشت ماست نه با روی‌های ما. زیرا اگر ما به سوی محیط (المحيط) قهقرایی (عقب‌عقب) حرکت کنیم، او از پشت سر ما احاطه دارد، چون او هستی (الوجود) است. اگر از پشت سر ما نبود، انتهای ما به عدم می‌رسید. و اگر در عدم واقع می‌شدیم، هیچ عینی برای ما ظاهر نمی‌شد. پس وقوع ما در عدم محال است، زیرا حق (الله) که هستی محض (الوجود المحض) است، از پشت سر ما احاطه دارد. ما به سوی او منتهی می‌شویم، و هستی و احاطه او میان ما و عدم حائل می‌شود. پس میان قول او: «و همانا پایان (منتها) به سوی پروردگار توست» (وَأَنَّ إِلَىٰ رَبِّكَ الْمُنتَهَىٰ) و قول او: «و خداوند از پشت سرشان احاطه دارد» (وَاللَّهُ مِن وَرَائِهِم مُّحِيطٌ) تقابلی نیست که جمع میان آن دو ممکن نباشد، بلکه جمع میان آن دو معلوم است. پس عالم میان نقطه و محیط (المحيط) قرار دارد. نقطه، اول است و محیط، آخر. پس حفظ الهی ما را در هر کجا که باشیم همراهی می‌کند و ما را از او به سوی او می‌گرداند. و امر، دایره‌ای است که طرفی ندارد که شهود شود و در آنجا توقف صورت گیرد. به همین دلیل به محمدی (سالک کامل) که چنین کشفی (الکشف) دارد، گفته شده است: «برای شما اقامتی نیست» (لَا مُقَامَ لَكُمْ)، به دلیل دورانی بودن امر، «پس بازگردید» (فَارْجِعُوا). پس عالم پیوسته در فلک هستی (الوجود) شناور است، همیشه و بدون نهایت، زیرا در آنجا نهایتی نیست. و روی عالم پیوسته به سوی اسم اولی است که آن را ایجاد کرده، ناظر است، و پشت عالم پیوسته به سوی اسم آخر احاطه‌کننده است که با پشت خود به آن منتهی می‌شود، ناظر است. زیرا عالم از پشت سر خود می‌بیند، همان‌طور که از پیش روی خود می‌بیند، اما ادراک او به اختلاف حال بر او متفاوت می‌شود. و اگر این اختلاف نبود، هیچ عینی متمایز نمی‌شد و فرقانی (تمایزی) وجود نمی‌داشت.\n\nهمانا هستی (الوجود) آسیایی است که بر من می‌چرخد\nو من قطب آن هستم، پس تباه نمی‌شوم.\n\nاگر من زائل شوم، نمی‌چرخد و آسیایی وجود نخواهد داشت\nپس فقر، صفت کون است و او فقیر است.\n\nای نادان به امر، در حالی که آن مشهود است\nبدان که تو به امور آگاه هستی.\n\nجمع، فرق (تمایز) خود را از عینش می‌پوشاند\nو او دلیل بر آن است، پس او بیناست.\n\nبه گروهی گفته شد: «به پشت سر خود بازگردید و نوری بجویید» (ارْجِعُوا وَرَاءَكُمْ فَالْتَمِسُوا نُورًا). پس به آنان حق گفته شد، زیرا خداوند از پشت سرشان احاطه دارد (وَاللَّهُ مِن وَرَائِهِم مُّحِيطٌ) و او نور است. اگر میان او و آنان دیواری (سور) زده نمی‌شد، نوری را که در پی آن بودند، هنگامی که به آنان گفته شد: «پس نوری بجویید» (فَالْتَمِسُوا نُورًا)، می‌یافتند. همانا زندگی دنیا محل کسب انوار از طریق تکالیف است و آن سرای عمل مشروع است؛ پس آن سرای ارتقاء و کسب است. هنگامی که به آخرت روی آوردند، دنیا پشت سرشان قرار گرفت. پس به آنان گفته شد: «به پشت سر خود بازگردید و نوری بجویید» (ارْجِعُوا وَرَاءَكُمْ فَالْتَمِسُوا نُورًا)، یعنی هیچ کس نوری ندارد مگر از زندگی دنیوی خود. پس دیوار منع میان آنان و زندگی دنیا حائل شد. این دیوار (السور) دایره‌ای است میان نقطه و محیط (المحيط). اهل بهشت میان دیوار و محیط قرار دارند، پس نور از پشت سرشان و باطن دیوار به سوی آنان است که در آن رحمت است. و روی دیوار که ظاهر آن است، به نقطه محیط می‌نگرد. و اهل آتش میان نقطه و ظاهر دیوار قرار دارند و «ظاهر آن از سوی آن عذاب است» (وَظَاهِرُهُ مِنْ قِبَلِهِ الْعَذَابُ) تا اجل مسمی. پس آن حائل میان دو سراست، نه میان دو صفت. زیرا دیوار (السور) فی‌نفسه رحمت است و عین آن، عین فصل میان دو سراست، زیرا عذاب از سوی آن است، نه در آن. و رحمت در آن است. اگر عذاب در آن بود، عذاب بر اهل آتش جاودانه می‌شد، همان‌طور که رحمت بر اهل بهشت جاودانه می‌شود. پس دیوار برداشته نمی‌شود و رحمت بودن آن نیز برداشته نمی‌شود. و ناگزیر است که آنچه در باطن است بر ظاهر آشکار شود. پس ناگزیر است که رحمت شامل کسی شود که پیش از ظاهر دیوار است. به همین دلیل به آنان گفته شد: «پس نوری بجویید» (فَالْتَمِسُوا نُورًا). اگر به آنان گفته می‌شد: «رحمتی بجویید»، آن را در همان لحظه به واسطه وجود دیوار می‌یافتند. هنگامی که اهل بهشت بخواهند از دیدن اهل آتش متنعم شوند، بر آن دیوار بالا می‌روند و در رحمت غوطه‌ور می‌شوند، سپس بر اهل آتش مشرف می‌شوند و از لذت نجات از آن، چیزی را می‌یابند که از نعیم بهشت نمی‌یابند، زیرا امنی که بر شخص ترسان وارد می‌شود، نزد او لذتی عظیم‌تر از امنی است که همواره همراه اوست. و اهل آتش پس از شمول رحمت به آنان می‌نگرند و از اینکه در آتش هستند، لذتی می‌یابند و خداوند متعال را سپاس می‌گویند که در بهشت نبوده‌اند. و این به دلیل چیزی است که مزاجشان در آن حالت اقتضا می‌کند. اگر با آن مزاج وارد بهشت می‌شدند، درد به آنان می‌رسید و متضرر می‌شدند. پس اگر درک کنی، نعیم جز ملایم (سازگار) نیست و عذاب جز ناموافق (ناسازگار) نیست، هر چه که باشد. پس هر جا که بودی، باش. اگر جز آنچه با تو سازگار است به تو نرسد، تو در نعیم هستی. و اگر جز آنچه با مزاجت ناسازگار است به تو نرسد، تو در عذاب هستی. موطن‌ها برای اهلشان محبوب شده‌اند. و اهل آتش که اهل آن هستند، آن موطنشان است و از آن خلق شده‌اند و به آن بازگشته‌اند. و اهل بهشت که اهل آن هستند، از آن خلق شده‌اند و به آن بازگشته‌اند. پس لذت موطن، ذاتی اهل موطن است، جز اینکه آنان به امری عارضی که از اعمالشان بر آنان عارض شده، از افراط و تفریط، محجوب گشته‌اند. پس حال بر آنان تغییر کرده و بیماری‌هایی که خود بر خویش وارد کرده‌اند، آنان را از لذت موطنشان محجوب ساخته است. تا جایی که اگر عملی انجام نمی‌دادند که موجب وجود آلام و بیماری‌ها شود و از گورهایشان بر مزاج وطنشان محشور می‌شدند و میان بهشت و آتش مخیر می‌شدند، آتش را انتخاب می‌کردند، همان‌طور که ماهی آب را انتخاب می‌کند و از هوایی که مایه حیات اهل خشکی است، می‌گریزد. پس اهل خشکی به آنچه اهل آب با آن زنده می‌مانند، می‌میرند و اهل آب به آنچه اهل خشکی با آن زنده می‌مانند، می‌میرند. این را بدان. و برای تو صحیح نیست که بقای (البقاء) دائمی با حق داشته باشی، زیرا ناگزیر گفته می‌شود: «آنان را به قصرهایشان بازگردانید». و گفته نشد: «آنان را به خانه‌هایشان» یا «به همسرانشان بازگردانید». پس لفظ قصر جز برای معنای معقول از آن نیامده است. پس هنگامی که آنان را به قصرهایشان بازگردانند و بر مُلک خود مشرف شوند، محال است که در آنجا به صورت بنده ظاهر شوند، بلکه در آنجا به صورت پادشاه ظاهر می‌شوند. پس اهلشان آنان را تعظیم می‌کنند و عزت در نفوسشان بر آنان استوار می‌شود. پس حقیقت (الحقیقة) به آنان می‌گوید: «عزت شما که موطن برایتان اقتضا کرده، به حق (بالله) باشد نه به نفوس خودتان». پس در مُلک خود به عزت حق (عز الله) عزت می‌جویند. پس عزت به اصالت برای حق (الله) است و برای «پیامبرش و برای مؤمنان» (وَلِرَسُولِهِ وَلِلْمُؤْمِنِينَ) خلعت الهی است نه به اصالت. پس با این علم نزد حق (الله) سعادتمند می‌شوند و آن را در تجلی مستأنف (التجلی المستأنف) می‌یابند. با وجود اینکه عالمان به حق (الله) پیوسته در تجلی دائم (التجلی الدائم) هستند، زیرا می‌دانند که حق (الحق) عین هر صورت است. با این حال، آنان تجلی عام (التجلی العام) را در کثیب (تپه نور) دارند، زیرا آن ذوق دیگری غیر از این ذوقی که دائماً می‌یابند، می‌دهد. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ). سفر بیست و هشتم با پایان باب چهارصد و دهم به اتمام رسید.\n\nبسم الله الرحمن الرحیم"
  },
  "page_count": 3
}