{
  "id": 447,
  "title": {
    "ar": "الباب السابع والأربعون وأربعمائة في معرفة منازلة من دخل حضرة التطهير نطق عني",
    "en": "Chapter Four Hundred and Forty-Seven: Concerning the Gnosis (المعرفة) of the Spiritual Station (المنزلة) of him who enters the Presence of Purification (حضرة التطهير), and who spoke on my behalf.",
    "ur": "باب چار سو سینتالیس: اس شخص کے مقامات کی معرفت کے بیان میں جو حضرۃ التطهير (حضرة التطهير) میں داخل ہوا، وہ میری طرف سے گویا ہوا۔",
    "fa": "باب چهارصد و چهل و هفتم در معرفت منازل کسی که وارد ساحت تطهیر (حضرة التطهير) شد و از جانب من سخن گفت"
  },
  "content": {
    "ar": "## «الباب السابع والأربعون وأربعمائة في معرفة منازلة من دخل حضرة التطهير نطق عني»\n\n\n> إذا طهر العبد من كونه *** يكون الآلة هو الناطق‏\n\n\n> كمثل المصلي إذا قام من *** ركوع الصلاة هو الصادق‏\n\n\n> ينوب عن الحق في نطقه *** فليس يقوم به عائق‏\n\n\n> فكل كلام له صادق *** وكل شراب له رائق‏\n\n\n### [إن الجوارح ارتبطت بالنفس الناطقة ارتباط الملك بمالكه‏]\n\n\nقال الله تعالى يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ بِما كانُوا يَعْمَلُونَ يعني بها ولا تشهد إلا بالأجنبية إذ لا بد من شهود عليه وإن لم يكن على ما قلناه وكان عين الشاهد عين المشهود عليه فهو إقرار لا شهادة وما ذكر الله تعالى أنه إقرار فدل على إن الجوارح ارتبطت بالنفس الناطقة ارتباط الملك بمالكه كما هو الأصل عليه والأصل هو الحق ولم يزل في أزله مدبرا فلا بد أن يكون تدبيره في مدبر معين له أزلا وليس إلا أعيان الممكنات فهي مشهودة له في حال عدمها فإنها ثابتة فيدبر فيها ما يكون من تقدم بعضها على بعض وتأخرها في تكوين أعيانها وصور ما توجد فيها وهنالك هو سر القدر الذي أخفى الله تعالى علمه عن خلقه حتى يظهر الحكم به في الصور الموجودة في رأى العين فكذلك لما أراد الله إنشاء الأرواح المدبرة فهي لا تكون إلا مدبرة فإن لم يكن لها أعيان وصور يظهر تدبيرها فيها بطلت حقيقتها إذ هي لذاتها مدبرة هكذا هو الأمر عند أهل الكشف وهنا سر عجيب غريب أومئ إليه إن شاء الله في هذا التفصيل فنقول إن الله أنشأ هذه الصور الجسدية من نور ونار وتراب وماء مهين على اختلاف أصول هذه النشأة المتعددة فعند ما كملت التسوية في الصورة التي هي محل تدبير الأرواح المدبرة أنشأ الله منها أي من قبولها ما ينفخ فيها من أوجدها وهو الفيض الدائم أرواحا مدبرة لها قائمة بها على صورة قبولها فتفاضلت الأرواح لتفاضل النشآت فلم يكونوا على مرتبة واحدة إلا في كونهم مدبرين فالأرواح المدبرة إنما ظهرت بصور مزاج القوابل فلا تتعدى الأرواح في التدبير ما تقتضيه إلهيا كل المدبرة فانظر إلى أعيان الممكنات قبل ظهورها في عينها لا يمكن أن يظهر الحق فيها إلا بصورة ما تقبله فما هي على صورة الحق في الحقيقة وإنما المدبر على صورة المدبر إذ لا يظهر فيه منه إلا على قدر قبوله لا غير فليس الحق إلا ما هو عليه الخلق لا يرى من الحق ولا يعلم غير هذا وهو في نفسه على ما علم وله في نفسه ما لا يصح أن يعلم أصلا وذلك الأمر الذي لا يعلم أصلا هو الذي له بنفسه المشار إليه بقوله فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ وهذا الذي نبهناك عليه من العلم بالله تعالى ما أظهرناه باختبارنا ولكن حكم الجبر به علينا فتحفظ به ولا تغفل عنه فإنه يعلمك الأدب مع الله تعالى ومن هذا المقام نزل قوله تعالى وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ أي ما أعطيتك إلا على قدر قبولك فالفيض الإلهي واسع لأنه واسع العطاء فما عنده تقصير ومالك منه إلا ما تقبله ذاتك فذاتك حجرت عليك هذا الواسع وأدخلتك في الضيق فذلك القدر الذي حصل تدبيره فيك هو ربك الذي تعبده ولا تعرف إلا هو وهذه هي العلامة التي يتحول لك فيها يوم القيامة على الكشف وهي في الدنيا في العموم على الغيب يعلمها كل إنسان من نفسه ولا يعلم أنها المعلومة له ولهذا تقول العامة إن الله ما عودني إلا كذا وكذا فإذا فهمت هذا علمت أن الحق معك على ما أنت عليه ما أنت معه وقد نبهك على هذا في القرآن بقوله تعالى وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ ما أنتم معه ولا يصح أن يكون أحد مع الله فالله مع كل أحد بما هو عليه ذلك الواحد من الحال فانظر إلى أفراد العالم فما تراه فيه فذلك عين الحق لا غيره‏\n\n\n> فليس وراء هذا الكشف كشف *** ولا من بعد هذا الوصف وصف‏\n\n\n> فسبحان الذي يبدو ويخفى *** وشاهده بذا شرع وعرف‏\n\n\nفلا يصح التجريد عن التدبير لأنه لو صح بطلت الربوبية وهي لا تبطل فالتجريد محال فلا مستند للتجريد لأنك لا تعقل إلهك إلا مدبرا فيك فلا تعرفه إلا من نفسك فلا بد أن تكون على تدبير فلا بد من جسم وروح دنيا وآخرة كل دار بما يليق بها من النشآت وتتنوع أرواحها لتنوعها صورة الخلق والحق كما تقدم ذكره في هذا الكتاب في هذا المعنى في الترجمة عن الحق‏\n\n\n> كن كيف شئت فإني *** كما تكون أكون‏\n\n\nهكذا هو الأمر في عينه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏",
    "en": "## Chapter 447: Concerning the Knowledge of the Station of One Who Enters the Presence of Purification, Speaking on My Behalf\n\nIf the servant is purified from his own being,\nHe becomes the instrument, and He is the Speaker.\n\nLike the one praying, when he rises from\nThe bowing of the prayer, he is the truthful one.\n\nHe acts as the deputy of the Real (الحق) in his utterance,\nSo no impediment stands in his way.\n\nThus, every word of his is truthful,\nAnd every drink for him is pure.\n\n### [Indeed, the Limbs are Connected to the Rational Soul like the Connection of the Property to its Owner]\n\nAllah the Exalted said: <<يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ بِما كانُوا يَعْمَلُونَ>> (The Day when their tongues, their hands, and their feet will bear witness against them as to what they used to do.) He means by this that they only bear witness against the alien self, for there must be a witness against him. If it were not as we have stated, and the witness were the very essence of the one witnessed against, then it would be an admission (إقرار), not a testimony (شهادة). What Allah the Exalted mentioned as an admission indicates that the limbs are connected to the rational soul (النفس الناطقة) like the connection of the property to its owner, as is the fundamental principle (الأصل).\n\nThe fundamental principle is the Real (الحق), and He has never ceased being the Disposer (مدبرا) in His Eternity (أزله). Thus, His disposal must be within something disposed that is eternally determined for Him, and this is none other than the Fixed Entities (الأعيان الثابتة) of the possibles. These are witnessed by Him in their state of non-existence, for they are immutable. So He disposes within them what occurs regarding the precedence of some over others, and their delay in the formation of their essences and the forms in which they come into existence. And there lies the secret of Divine Decree (سر القدر), the knowledge of which Allah the Exalted concealed from His creation, until the ruling concerning it appears in the forms visible to the eye.\n\nSimilarly, when Allah willed the creation of the Disposing Spirits (الأرواح المدبرة), they cannot be anything but disposers. If they did not have essences and forms in which their disposal could manifest, their reality would be nullified, since they are, by their very essence, disposers. This is the matter according to the People of Unveiling (أهل الكشف). And here is a strange and wondrous secret to which I shall allude, God willing, in this detailed explanation.\n\nSo we say that Allah created these corporeal forms from light, fire, dust, and despicable water, according to the differing origins of this manifold creation (النشأة المتعددة). When the leveling (التسوية) was completed in the form—which is the locus of disposal for the Disposing Spirits—Allah created from it, meaning from its receptivity (قبولها), that which is breathed into it by the One who brought it into existence, which is the Perpetual Effusion (الفيض الدائم): Disposing Spirits belonging to it, subsisting within it according to the form of its receptivity. Thus, the spirits differed due to the difference in the creations, and they were not on a single level (مرتبة) except in their being disposers. The Disposing Spirits only appeared in the forms of the temperament (مزاج) of the receptive entities (القوابل). Therefore, the spirits do not exceed, in their disposal, what is divinely necessitated for every disposed entity.\n\nLook at the Fixed Entities (أعيان الممكنات) of the possibles before their manifestation: the Real (الحق) cannot appear in them except in the form that they accept. Thus, they are not truly upon the form of the Real. Rather, the Disposer is upon the form of the disposed, for nothing of Him appears in it except according to the measure of its receptivity, and nothing else. Therefore, the Real is nothing but what the creation (الخلق) is upon. Nothing of the Real is seen or known other than this. Yet He, in His Essence (الذات), is upon what is known, and He has in His Essence that which is fundamentally impossible to know. And that matter which is fundamentally unknowable is what belongs to Him by Himself, referred to in His saying: <<فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ>> (Indeed, Allah is free from need of the worlds.)\n\nAnd this knowledge of Allah the Exalted, which we have alerted you to, we did not manifest through our own choice, but rather the ruling of compulsion (الجبر) was imposed upon us concerning it. So guard it and do not neglect it, for it teaches you proper conduct (الأدب) with Allah the Exalted.\n\nAnd from this station (مقام) descended His saying, the Exalted: <<وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ>> (And whatever evil befalls you is from yourself.) Meaning: I only gave you according to the measure of your receptivity. The Divine Effusion (الفيض الإلهي) is vast because He is vast in giving, so there is no deficiency with Him. And you possess nothing of it except what your essence accepts. Thus, your essence has restricted this vastness from you and brought you into narrowness. That measure whose disposal occurred within you is your Lord whom you worship and know none other than Him.\n\nAnd this is the sign by which He will transform Himself for you on the Day of Resurrection through Unveiling (الكشف). In this world, generally, it is based on the Unseen (الغيب); every person knows it from himself but does not know that it is the thing known to him. This is why the common people say, \"Allah has accustomed me only to such-and-such.\" If you understand this, you know that the Real is with you according to what you are upon, but you are not with Him. He has alerted you to this in the Quran by His saying, the Exalted: <<وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ>> (And He is with you wherever you are.) You are not with Him, and it is not possible for anyone to be *with* Allah. For Allah is with everyone according to the state that individual is upon. So look at the individuals of the world; whatever you see in them, that is the very essence of the Real (عين الحق), and nothing else.\n\nThere is no unveiling (كشف) beyond this unveiling,\nNor any description after this description.\n\nGlory be to the One who manifests and conceals,\nAnd whose witness, by this, is prescribed and known.\n\nThus, abstraction (التجريد) from disposal (التدبير) is not valid, because if it were valid, Lordship (الربوبية) would be nullified, and Lordship is not nullified. Therefore, abstraction is impossible. There is no basis for abstraction, because you do not comprehend your God except as the Disposer within you. Thus, you only know Him through yourself. Therefore, you must be subject to disposal. There must be a body and a spirit, this world (دنيا) and the Hereafter (آخرة), each abode having the creations (النشآت) appropriate to it, and their spirits varying according to the variation in the form of Creation (الخلق) and the Real (الحق), as previously mentioned in this book concerning this meaning in the interpretation of the Real.\n\nBe as you will, for I am\nAs you are.\n\nThis is the matter in its essence, and Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way.)",
    "ur": "باب ۴۴۷: اس شخص کے مقام کی معرفت میں جو حضرہ تطہیر (حضرة التطهير) میں داخل ہوا، وہ میری طرف سے گویا ہوا۔\n\nجب بندہ اپنے وجود سے پاک ہو جاتا ہے\nتو وہ آلہ (ذریعہ) ہی گویا ہوتا ہے\nجیسے نماز پڑھنے والا جب رکوع سے کھڑا ہوتا ہے\nتو وہ سچا ہوتا ہے\nوہ اپنی گفتگو میں الحق (ذات حق) کا نائب بنتا ہے\nپس کوئی رکاوٹ اسے روک نہیں سکتی\nپس اس کی ہر بات سچی ہوتی ہے\nاور اس کا ہر مشروب صاف (شفاف) ہوتا ہے۔\n\n### [بے شک اعضاء کا نفس ناطقہ (النفس الناطقة) سے تعلق ایسا ہی ہے جیسا ملکیت کا اس کے مالک سے]\n\nاللہ تعالیٰ نے فرمایا: \"جس دن ان کے خلاف ان کی زبانیں، ان کے ہاتھ اور ان کے پاؤں گواہی دیں گے، ان اعمال کی جو وہ کرتے تھے\" (النور: ۲۴)۔ اس سے مراد یہ ہے کہ وہ صرف اجنبی (غیر) کے خلاف ہی گواہی دیں گے، کیونکہ اس پر گواہی کا ہونا ضروری ہے۔ اور اگر ایسا نہ ہو جیسا کہ ہم نے کہا، اور گواہ ہی عین مشہود علیہ (جس پر گواہی دی جا رہی ہے) ہو، تو یہ اقرار ہے، گواہی نہیں۔ اور اللہ تعالیٰ نے اسے اقرار نہیں کہا، لہٰذا یہ اس بات کی دلیل ہے کہ اعضاء (الجوارح) کا نفس ناطقہ (النفس الناطقة) سے تعلق ایسا ہی ہے جیسا ملکیت کا اس کے مالک سے، جیسا کہ اصل (الأصل) کا تقاضا ہے۔ اور اصل (الأصل) ہی الحق (ذات حق) ہے، اور وہ اپنے ازل میں ہمیشہ سے مدبر (تدبیر کرنے والا) رہا ہے۔ لہٰذا ضروری ہے کہ اس کی تدبیر کسی معین مدبر (جس میں تدبیر کی جائے) میں ہو جو ازل سے اس کے لیے مقرر ہے۔ اور وہ ممکنات (الممکنات) کے اعیان (حقائق) کے سوا کچھ نہیں، جو عدم کی حالت میں بھی اس کے لیے مشہود (دیکھے ہوئے) ہیں، کیونکہ وہ ثابت ہیں۔ پس وہ ان میں تدبیر کرتا ہے کہ ان میں سے بعض کو بعض پر مقدم کرے اور ان کے اعیان کی تشکیل میں تاخیر کرے، اور ان صورتوں کی جو ان میں موجود ہوتی ہیں۔ اور یہیں وہ سرِ قدر (رازِ تقدیر) ہے جس کا علم اللہ تعالیٰ نے اپنی مخلوق سے پوشیدہ رکھا، یہاں تک کہ اس کا حکم موجودہ صورتوں میں بظاہر آنکھوں کے سامنے ظاہر ہو جائے۔\n\nاسی طرح جب اللہ نے مدبر ارواح (الأرواح المدبرة) کو پیدا کرنا چاہا، تو وہ تدبیر کرنے والی ہی ہوں گی۔ اگر ان کے لیے ایسے اعیان اور صورتیں نہ ہوں جن میں ان کی تدبیر ظاہر ہو، تو ان کی حقیقت باطل ہو جائے گی، کیونکہ وہ اپنی ذات کے اعتبار سے مدبر ہیں۔ اہل کشف (أهل الکشف) کے نزدیک معاملہ ایسا ہی ہے۔ اور یہاں ایک عجیب و غریب راز ہے جس کی طرف ہم ان شاء اللہ اس تفصیل میں اشارہ کریں گے، پس ہم کہتے ہیں: بے شک اللہ نے یہ جسمانی صورتیں نور، نار، مٹی اور حقیر پانی سے پیدا کیں، اس متعدد نشأت (پیدائش) کے اصولوں کے اختلاف کے مطابق۔ پس جب اس صورت میں تسویہ (تکمیل) مکمل ہو گئی جو مدبر ارواح (الأرواح المدبرة) کی تدبیر کا محل ہے، اللہ نے اس (یعنی اس کے قبول کرنے کی صلاحیت) سے وہ چیز پیدا کی جو اس میں پھونکی جاتی ہے، جو اسے وجود بخشتا ہے، اور وہ فیض دائم (الفیض الدائم) ہے، جو مدبر ارواح ہیں جو اس صورت کے ساتھ قائم ہیں جو اس کے قبول کی صورت ہے۔ پس ارواح نشأتوں کے تفاوت کی وجہ سے مختلف ہو گئیں، اور وہ ایک ہی مرتبے پر نہیں ہیں، سوائے اس کے کہ وہ سب مدبر ہیں۔ پس مدبر ارواح (الأرواح المدبرة) صرف قبول کرنے والوں کے مزاج کی صورتوں میں ہی ظاہر ہوئیں۔ لہٰذا ارواح تدبیر میں اس چیز سے تجاوز نہیں کرتیں جو ہر مدبر (جس میں تدبیر کی گئی) الٰہی طور پر تقاضا کرتا ہے۔\n\nپس ممکنات (الممکنات) کے اعیان کو ان کے عین میں ظاہر ہونے سے پہلے دیکھو۔ الحق (ذات حق) ان میں صرف اسی صورت میں ظاہر ہو سکتا ہے جسے وہ قبول کریں۔ پس وہ حقیقت میں الحق (ذات حق) کی صورت پر نہیں ہیں، بلکہ مدبر (تدبیر کرنے والا) مدبر (جس میں تدبیر کی گئی) کی صورت پر ہے۔ کیونکہ اس میں اس (الحق) کی طرف سے صرف اسی قدر ظاہر ہوتا ہے جتنا اس کا قبول (قبولیت) ہوتا ہے، اور بس۔ پس الحق (ذات حق) وہی نہیں ہے جس پر مخلوق ہے، مخلوق الحق (ذات حق) میں سے اس کے سوا کچھ نہیں دیکھتی اور نہ جانتی۔ اور وہ (الحق) اپنی ذات میں اس پر ہے جو اس نے جانا، اور اس کی ذات میں وہ بھی ہے جسے جاننا اصلاً درست نہیں۔ اور وہ امر جسے اصلاً نہیں جانا جا سکتا، وہی ہے جو اس کی اپنی ذات کے لیے ہے، جس کی طرف اس قول میں اشارہ کیا گیا ہے: \"بے شک اللہ تمام جہانوں سے بے نیاز ہے\" (آل عمران: ۹۷)۔ اور یہ جو ہم نے تمہیں اللہ تعالیٰ کے علم کے بارے میں آگاہ کیا ہے، یہ ہم نے اپنے اختیار سے ظاہر نہیں کیا، بلکہ جبر کے حکم نے ہم پر اسے لازم کر دیا۔ پس اسے محفوظ رکھو اور اس سے غافل نہ ہو، کیونکہ یہ تمہیں اللہ تعالیٰ کے ساتھ ادب سکھاتا ہے۔ اور اسی مقام سے اللہ تعالیٰ کا یہ قول نازل ہوا: \"اور جو برائی تمہیں پہنچتی ہے، وہ تمہارے نفس کی طرف سے ہے\" (النساء: ۷۹)۔ یعنی میں نے تمہیں تمہارے قبول (قبولیت) کی مقدار کے مطابق ہی عطا کیا۔ پس فیض الٰہی (الفیض الإلهي) وسیع ہے، کیونکہ وہ وسیع العطاء ہے، اس کے ہاں کوئی کمی نہیں۔ اور تمہیں اس میں سے صرف وہی ملتا ہے جسے تمہاری ذات قبول کرتی ہے، پس تمہاری ذات نے ہی اس وسعت کو تم پر محدود کر دیا اور تمہیں تنگی میں داخل کر دیا۔ پس وہ مقدار جس کی تدبیر تم میں واقع ہوئی، وہی تمہارا رب ہے جس کی تم عبادت کرتے ہو اور اس کے سوا کسی کو نہیں جانتے۔ اور یہی وہ علامت ہے جو قیامت کے دن تمہارے لیے کشف (الکشف) پر بدل جائے گی، جبکہ دنیا میں یہ عموماً غیب پر رہتی ہے، ہر انسان اسے اپنے نفس سے جانتا ہے لیکن یہ نہیں جانتا کہ یہ وہی معلوم ذات ہے۔ اور اسی لیے عام لوگ کہتے ہیں کہ اللہ نے مجھے صرف اسی چیز کا عادی بنایا ہے۔ پس جب تم یہ سمجھ لو گے تو جان لو گے کہ الحق (ذات حق) تمہارے ساتھ ہے اس حالت پر جس پر تم ہو، نہ کہ تم اس کے ساتھ ہو۔ اور اس نے تمہیں قرآن میں اپنے اس قول سے اس پر متنبہ کیا ہے: \"اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو\" (الحدید: ۴)۔ تم اس کے ساتھ نہیں ہو، اور یہ درست نہیں کہ کوئی اللہ کے ساتھ ہو۔ پس اللہ ہر ایک کے ساتھ ہے اس حال کے مطابق جس پر وہ واحد ہے۔ پس عالم کے افراد کو دیکھو، جو کچھ تم اس میں دیکھتے ہو، وہی عین الحق (عین الحق) ہے، کوئی اور نہیں۔\n\nپس اس کشف (الکشف) کے پیچھے کوئی اور کشف نہیں\nاور اس وصف کے بعد کوئی اور وصف نہیں\nپس پاک ہے وہ ذات جو ظاہر بھی ہوتی ہے اور پوشیدہ بھی رہتی ہے\nاور اس کے شاہد نے اسی کے ذریعے شریعت اور معرفت (المعرفۃ) کو جانا۔\n\nپس تدبیر سے تجرید (الگ ہونا) درست نہیں، کیونکہ اگر یہ درست ہو جائے تو ربوبیت باطل ہو جائے گی، اور ربوبیت باطل نہیں ہوتی، لہٰذا تجرید محال ہے۔ پس تجرید کی کوئی بنیاد نہیں، کیونکہ تم اپنے معبود کو اپنے اندر تدبیر کرنے والے کے سوا نہیں سمجھ سکتے۔ پس تم اسے اپنے نفس کے ذریعے ہی جانتے ہو، لہٰذا تمہارا تدبیر پر ہونا ضروری ہے۔ پس جسم اور روح، دنیا اور آخرت کا ہونا ضروری ہے، ہر دار (مقام) اپنی نشأتوں کے مطابق جو اس کے لائق ہیں، اور ان کی ارواح ان کے تنوع کے لیے مختلف ہوتی ہیں، جو خلق اور الحق (ذات حق) کی صورت ہے، جیسا کہ اس کتاب میں اس معنی میں الحق (ذات حق) کی ترجمانی میں پہلے ذکر ہو چکا ہے۔\n\nتو جیسا چاہے ہو جا، پس میں\nجیسا تو ہوتا ہے، ویسا ہی ہوتا ہوں۔\n\nحقیقت میں معاملہ ایسا ہی ہے، اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔",
    "fa": "باب چهارصد و چهل و هفتم در معرفت منزلتی که برای کسی است که وارد حضرت تطهیر شود و از جانب من سخن گوید.\n\nچون بنده از هستی (کون) خود پاک شود،\nاو ابزار و سخنگو خواهد بود.\n\nمانند نمازگزاری که چون از رکوع نماز برخیزد،\nاو راستگو است.\n\nدر گفتارش از حق (الحق) نیابت می‌کند،\nپس هیچ مانعی او را باز نمی‌دارد.\n\nپس هر سخنی که گوید صادق است،\nو هر شرابی که نوشد زلال است.\n\n### [همانا جوارح (اعضا) به نفس ناطقه (النفس الناطقة) پیوسته‌اند، پیوستن ملک به مالک خود]\n\nخداوند متعال می‌فرماید: «يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ بِما كانُوا يَعْمَلُونَ» (روزی که زبان‌ها و دست‌ها و پاهایشان بر ضدّ آنان به آنچه انجام می‌دادند، شهادت می‌دهند). منظور از آن این است که [جوارح] جز بر بیگانه شهادت نمی‌دهند، زیرا ناگزیر باید شاهدی بر او باشد. و اگر بر خلاف آنچه گفتیم باشد و عین شاهد، عین مشهودٌعلیه باشد، آن اقرار است نه شهادت. و آنچه خداوند متعال ذکر کرده که اقرار است، دلالت دارد بر اینکه جوارح (اعضا) به نفس ناطقه (النفس الناطقة) پیوسته‌اند، پیوستن ملک به مالک خود، چنانکه اصل بر آن است. و اصل، حق (الحق) است و پیوسته در ازل خود مدبّر بوده است. پس ناگزیر باید تدبیر او در مدبَّری باشد که از ازل برای او معین شده است، و آن چیزی جز اعیان ممکنات (الأعيان الممكنات) نیست. پس این اعیان در حال عدمشان برای او مشهودند، زیرا ثابت هستند. پس در آنها تدبیر می‌کند آنچه را که از تقدم و تأخر برخی بر برخی دیگر در تکوین اعیانشان و صور آنچه در آنها موجود می‌شود، حاصل می‌گردد. و در آنجاست سرّ قدر که خداوند علم آن را از خلق خود پنهان داشت تا حکم آن در صور موجود در برابر چشم آشکار شود. همچنین، هنگامی که خداوند اراده کرد ارواح مدبّره را ایجاد کند، این ارواح جز مدبّره نیستند. اگر برای آنها اعیان و صوری نباشد که تدبیرشان در آنها آشکار شود، حقیقتشان باطل می‌گردد، زیرا آنها ذاتاً مدبّره هستند. امر نزد اهل کشف (الکشف) این‌گونه است. و در اینجا سرّی عجیب و غریب است که اگر خداوند بخواهد در این تفصیل به آن اشاره خواهم کرد. پس می‌گوییم: خداوند این صور جسمانی را از نور و آتش و خاک و آب پست (ماء مهين) بر اساس اختلاف اصول این نشأت‌های متعدد ایجاد کرد. هنگامی که تسویه در صورتی که محل تدبیر ارواح مدبّره است کامل شد، خداوند از آن [صورت]، یعنی از قبول آن، آنچه را که در آن دمیده می‌شود، یعنی کسی که آن را ایجاد کرده و آن فیض دائم است، ارواحی مدبّره برای آن ایجاد کرد که به صورت قبول آن، قائم به آن هستند. پس ارواح به دلیل تفاوت نشأت‌ها با یکدیگر متفاوت شدند و بر یک مرتبه نبودند، مگر در مدبّر بودنشان. پس ارواح مدبّره تنها به صور مزاج قوابل (محل‌های پذیرش) ظاهر شدند. بنابراین، ارواح در تدبیر از آنچه مقتضای الهی هر مدبَّری است، فراتر نمی‌روند. پس به اعیان ممکنات (الأعيان الممكنات) پیش از ظهورشان در عین خود بنگر؛ حق (الحق) نمی‌تواند در آنها ظاهر شود مگر به صورتی که آن را می‌پذیرند. پس آنها در حقیقت بر صورت حق نیستند، بلکه مدبَّر بر صورت مدبِّر است، زیرا از او جز به اندازه قبولش در آن ظاهر نمی‌شود و بس. پس حق (الحق) جز آنچه خلق بر آن است، نیست. از حق جز این دیده و دانسته نمی‌شود، و او در نفس خود بر آنچه دانسته است، می‌باشد، و در نفس خود چیزی دارد که اصلاً صحیح نیست دانسته شود. و آن امری که اصلاً دانسته نمی‌شود، همان است که برای او به نفس خود است و به این قول اشاره شده است: «فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ» (همانا خداوند از جهانیان بی‌نیاز است). و این علمی که ما تو را به آن آگاه ساختیم، با اختیار ما آشکار نشده، بلکه حکم جبر بر ما جاری شده است. پس آن را حفظ کن و از آن غافل مشو، زیرا تو را ادب با خداوند متعال می‌آموزد. و از این مقام است که این قول خداوند نازل شده است: «وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ» (و آنچه از بدی به تو می‌رسد، از جانب خود توست). یعنی: من به تو ندادم مگر به اندازه قبول تو. پس فیض الهی گسترده است، زیرا او واسع العطاء است. نزد او تقصیری نیست، و تو از آن فیض جز آنچه ذاتت می‌پذیرد، نداری. پس ذات تو این گستردگی را بر تو محدود ساخت و تو را در ضیق وارد کرد. پس آن مقداری که تدبیرش در تو حاصل شده، پروردگار توست که او را می‌پرستی و جز او را نمی‌شناسی. و این همان علامتی است که در روز قیامت بر اساس کشف (الکشف) برای تو متحول می‌شود، و در دنیا به طور عمومی بر اساس غیب است که هر انسانی آن را از نفس خود می‌داند، اما نمی‌داند که آن، معلوم اوست. و به همین دلیل عوام می‌گویند: خداوند مرا جز به فلان و فلان عادت نداده است. پس اگر این را فهمیدی، دانستی که حق (الحق) با توست بر آنچه تو بر آن هستی، نه اینکه تو با او باشی. و او تو را در قرآن به این امر آگاه ساخته است، آنجا که می‌فرماید: «وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ» (و او با شماست هر کجا که باشید). شما با او نیستید و صحیح نیست که کسی با خدا باشد، بلکه خداوند با هر کسی است به واسطه حالی که آن فرد بر آن است. پس به افراد عالم بنگر؛ آنچه در آن می‌بینی، عین حق (الحق) است و نه غیر آن.\n\nپس ورای این کشف (الکشف)، کشفی نیست،\nو پس از این وصف، وصفی نیست.\n\nپس منزّه است آنکه آشکار می‌شود و پنهان می‌گردد،\nو شاهد او به این [حقیقت]، شریعت و عرفان را شناخت.\n\nپس تجرید (جدا شدن) از تدبیر صحیح نیست، زیرا اگر صحیح بود، ربوبیت باطل می‌شد، در حالی که ربوبیت باطل نمی‌شود. پس تجرید محال است و مستندی برای تجرید وجود ندارد، زیرا تو خدای خود را تعقل نمی‌کنی مگر در حالی که در تو تدبیر می‌کند. پس او را نمی‌شناسی مگر از نفس خودت. پس ناگزیر باید بر تدبیر باشی. پس ناگزیر باید جسم و روح، دنیا و آخرت وجود داشته باشد، و هر سرایی با نشأت‌هایی که شایسته آن است، و ارواح آنها به دلیل تنوعشان، صورت خلق و حق (الحق) را متنوع می‌سازند، چنانکه ذکر آن در این کتاب در این معنی در ترجمه از حق (الحق) گذشت.\n\nهرگونه که می‌خواهی باش، زیرا من نیز\nهمان‌گونه که تو باشی، خواهم بود.\n\nامر در عین خود این‌گونه است، و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 1
}