{
  "id": 534,
  "title": {
    "ar": "الباب الرابع والثلاثون وخمسمائة في معرفة حال قطب كان منزله وإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ",
    "en": "Chapter Five Hundred and Thirty-Four: Concerning the Knowledge of the State of a Pole (قطب) whose Station was <<وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ>> (And indeed, you are upon a magnificent character).",
    "ur": "باب پانچ سو چونتیس (۵۳۴) قطب (قطب) کے حال کی معرفت (معرفت) کے بیان میں جس کا منزل (منزل) یہ تھا: \"اور بے شک آپ عظیم اخلاق پر فائز ہیں\" (وَإِنَّكَ لَعَلى خُلُقٍ عَظِيمٍ)",
    "fa": "باب پانصد و سی و چهارم در معرفت حال قطبی که منزل او «و همانا تو بر اخلاق عظیمی هستی» (وَإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ) بود."
  },
  "content": {
    "ar": "## (الباب الرابع والثلاثون وخمسمائة في معرفة حال قطب كان منزله وإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ)\n\n\n> إذا هيئت للخلق العظيم *** فذاك بشارة الرب الكريم‏\n\n\n> أتاك بها رسول الحال يسعى *** بآيات العناية للعليم‏\n\n\n> فقمت بها مقام الحق فيها *** كما قام الحديث من القديم‏\n\n\n> فحق لك الثناء بكل وجه *** وكنت الوجه بالخلق العظيم‏\n\n\n> فأنت الوارث الفرد الذي لم *** يزل ندعوه بالبر الرحيم‏\n\n\n> لك العلم الذي ما فيه ريب *** أتتك به مؤاخاة الكليم‏\n\n\n> فتدعى بالخليل وبالنديم *** وتدعى بالحميم وبالقسيم‏\n\n\n### [إذا أراد الله بعبد خيرا جعل خلقه القرآن‏]\n\n\nهذه الآية تليت علينا تلاوة ننزل إلهي من أول السورة إلى قوله زَنِيمٍ عرفنا الحق في هذه التلاوة المنزلة من عند الله في المبشرة التي أبقى الله علينا من الوحي النبوي وراثة نبوية لله الحمد ورثته فيها من قوله ولا تَكُ في ضَيْقٍ مِمَّا يَمْكُرُونَ وفي قوله ولَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِما يَقُولُونَ وقوله فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا ولَمْ يُرِدْ إِلَّا الْحَياةَ الدُّنْيا فشكرت الله على ما حققني به من حقائق الورث النبوي وأرجو أن أكون ممن لا ينطق عن هوى نفسه جعلنا الله منهم فإن ذلك هو عين العصمة الإلهية فإذا أراد الله بصاحب هذا الذكر خيرا ألهمه‏\n\n\nلحديث عائشة في رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لما سألت عن خلق رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فقالت كان خلقه القرآن‏\n\n\nتريد هذه الآية وكل شي‏ء عظمه الله يتعين تعظيمه على كل مؤمن فينظر صاحب هذا الذكر في القرآن فكل نعت فيه قد مدحه الله ومدح به طائفة من عباده كانوا ما كانوا فيعلم إن ذلك صفة مدح إلهي فليعمل على الاتصاف بتلك الصفات وإذا ذكر الله في القرآن صفة ذم بها طائفة من عباده كانوا ما كانوا تعين عليه اجتنابها فيأخذ القرآن منزلا فيه كان الحق ما خاطب به غيره فإذا فعل مثل هذا كان خلقه القرآن وعظمه الحق فعظم حيث تنفع العظمة ومكارم الأخلاق معلومة عقلا وعرفا والتصرف بها وفيها معلوم شرعا فمن اتصف بها على الوجه المشروع وزاد تتميم مكارم الأخلاق وهو إلحاق سفسافها بها فتكون كلها مكارم أخلاق بالتصرف المشروع والمعقول فقد اتصف بكل ثناء إلهي وصاحب هذا الذكر يفتح له في معاني آيات السورة التي نزل فيها على أكمل الوجوه ولا يزال محسودا وبالعداوة مقصودا وينكشف له أمر الآخرة عيانا ومن هذه السورة علم رسول الله صَلَّى اللهُ عَليهِ وسَلَّم علم الأولين والآخرين والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏",
    "en": "Chapter 534: Concerning the Knowledge of the State of a Pole (قطب) whose Station was <<وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ>> (And indeed, you are upon a magnificent character)\n\nIf you are prepared for the magnificent character (الخلق العظيم) *** then that is the glad tidings of the Generous Lord (الرب الكريم).\nThe messenger of the spiritual state (رسول الحال) comes to you with it, striving *** bearing the signs of Providence (العناية) for the All-Knowing (العليم).\nSo you stand by it in the station of the Real (الحق) within it *** just as the temporal (الحديث) stands by the Eternal (القديم).\nPraise is due to you in every respect *** and you are the Face (الوجه) through the magnificent character.\nFor you are the unique inheritor (الوارث الفرد) whom we never cease *** to call by the Beneficent, the Merciful (البر الرحيم).\nYours is the Knowledge (العلم) in which there is no doubt *** brought to you by the brotherhood of the one who spoke with God (الكليم).\nSo you are called the Intimate Friend (الخليل) and the Companion (النديم) *** and you are called the Close Kin (الحميم) and the Distributor (القسيم).\n\n[If Allah desires good for a servant, He makes his character the Quran]\n\nThis verse was recited to us in a Divine descent (تلاوة ننزل إلهي) from the beginning of the Surah up to His saying: *zanīm* (زَنِيمٍ). We came to know the Real (الحق) through this recitation, which descended from Allah, concerning the glad tidings that Allah preserved for us from the prophetic revelation (الوحي النبوي), a prophetic inheritance (وراثة نبوية)—praise be to Allah. I inherited it through His saying: <<وَلَا تَكُ فِي ضَيْقٍ مِمَّا يَمْكُرُونَ>> (And do not be in distress by reason of what they plot), and in His saying: <<وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ>> (And We certainly know that your breast is constrained by what they say), and His saying: <<فَأَعْرِضْ عَنْ مَنْ تَوَلَّى عَنْ ذِكْرِنَا وَلَمْ يُرِدْ إِلَّا الْحَيَاةَ الدُّنْيَا>> (So turn away from whoever turns away from Our remembrance and desires not except the life of this world). So I thanked Allah for what He realized in me concerning the realities of the prophetic inheritance (الورث النبوي), and I hope to be among those who do not speak out of personal desire (هوى نفسه)—may Allah make us among them—for that is the very essence of Divine infallibility (العصمة الإلهية). If Allah desires good for the possessor of this remembrance (الذكر), He inspires him.\n\n[This refers] to the hadith of Aisha concerning the Messenger of Allah (PBUH), when she was asked about the character of the Messenger of Allah (PBUH), and she said: \"His character was the Quran.\"\n\nShe meant this verse [<<وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ>>]. Everything that Allah magnifies necessitates magnification by every believer. Therefore, the possessor of this remembrance (الذكر) looks into the Quran, and every description (نعت) within it that Allah has praised, and by which He has praised a group of His servants, whoever they may be, he knows that this is a quality of Divine praise, so he must strive to be characterized by those qualities. And when Allah mentions in the Quran a quality by which He censures a group of His servants, whoever they may be, it becomes incumbent upon him to avoid it. Thus, he takes the Quran as if it were revealed concerning him, and as if the Real (الحق) addressed no one else by it. If he does this, his character becomes the Quran, and the Real magnifies him, so he is magnified where magnification is beneficial. Noble moral qualities (مكارم الأخلاق) are known rationally (عقلا) and customarily (عرفا), and acting upon them and within them is known legally (شرعا). Whoever is characterized by them according to the prescribed legal manner (الوجه المشروع), and adds the completion of noble moral qualities—which is the inclusion of their trivial aspects (سفسافها) within them, so that all of them become noble moral qualities through the legally prescribed and rational conduct—has indeed been characterized by every Divine praise. The possessor of this remembrance (الذكر) is granted an unveiling (يفتح له) into the meanings of the verses of the Surah in which it was revealed, in the most complete manner. He will constantly be envied and targeted by enmity, and the matter of the Hereafter (الآخرة) will be unveiled to him by direct witnessing (عيانا). It is from this Surah that the Messenger of Allah (PBUH) knew the knowledge of the first and the last (علم الأولين والآخرين). And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (says the truth, and He guides to the way).",
    "ur": "باب پانچ سو چونتیس: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور بے شک آپ اخلاق کے عظیم مرتبے پر فائز ہیں (وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ)\"۔\n\nجب آپ کو خلق عظیم کے لیے تیار کیا گیا\nتو یہ رب کریم کی بشارت ہے۔\n\nحال کا رسول اسے لے کر آپ کے پاس دوڑتا ہوا آیا\nعلیم (اللہ) کی طرف سے عنایت کی نشانیوں کے ساتھ۔\n\nپس آپ نے اس میں حق (الحق) کا مقام حاصل کیا\nجیسے قدیم سے جدید قائم ہے۔\n\nپس آپ ہر لحاظ سے تعریف کے مستحق ہوئے\nاور آپ ہی خلق عظیم کے ساتھ (حق کا) چہرہ تھے۔\n\nپس آپ وہ وارث فرد ہیں جسے ہم ہمیشہ سے\nالبر الرحیم (نیکوکار، رحم کرنے والا) کہہ کر پکارتے ہیں۔\n\nآپ کے لیے وہ علم ہے جس میں کوئی شک نہیں\nجو کلیم (موسیٰ علیہ السلام) کی اخوت کے ذریعے آپ تک پہنچا۔\n\nپس آپ کو خلیل (دوست) اور ندیم (ہم نشین) کہا جاتا ہے\nاور آپ کو حمیم (قریبی دوست) اور قسیم (تقسیم کرنے والا) کہا جاتا ہے۔\n\n[جب اللہ کسی بندے کے ساتھ بھلائی کا ارادہ کرتا ہے تو اس کے اخلاق کو قرآن بنا دیتا ہے]\n\nیہ آیت ہم پر ایک الٰہی نزول کی تلاوت کے طور پر پڑھی گئی، سورت کے آغاز سے لے کر اس کے قول \"زَنِيمٍ\" (بدنام) تک۔ ہم نے اس نازل شدہ تلاوت میں حق (الحق) کو اس بشارت میں پہچانا جسے اللہ نے ہم پر نبوی وحی سے نبوی وراثت کے طور پر باقی رکھا، اللہ کا شکر ہے۔ میں نے اس میں وراثت پائی اس کے قول سے: \"اور آپ ان کی سازشوں سے تنگی میں نہ ہوں (وَلَا تَكُ فِي ضَيْقٍ مِمَّا يَمْكُرُونَ)\"، اور اس کے قول میں: \"اور ہم یقیناً جانتے ہیں کہ جو کچھ وہ کہتے ہیں اس سے آپ کا سینہ تنگ ہوتا ہے (وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ)\"، اور اس کے قول میں: \"پس آپ اس شخص سے منہ پھیر لیں جس نے ہمارے ذکر سے منہ موڑا اور دنیا کی زندگی کے سوا کچھ نہ چاہا (فَأَعْرِضْ عَنْ مَنْ تَوَلَّى عَنْ ذِكْرِنَا وَلَمْ يُرِدْ إِلَّا الْحَيَاةَ الدُّنْيَا)\"۔ پس میں نے اللہ کا شکر ادا کیا کہ اس نے مجھے نبوی وراثت کی حقیقتوں (حقائق الورث النبوي) سے نوازا۔ اور میں امید کرتا ہوں کہ میں ان لوگوں میں سے ہوں گا جو اپنی خواہش سے نہیں بولتے۔ اللہ ہمیں ان میں شامل فرمائے، کیونکہ یہی عین عصمت الٰہیہ ہے۔\n\nپس جب اللہ اس ذکر کے حامل کے ساتھ بھلائی کا ارادہ کرتا ہے تو اسے الہام کرتا ہے۔\n\nحضرت عائشہ رضی اللہ عنہا کی حدیث کے مطابق، جب رسول اللہ صلی اللہ علیہ وسلم کے اخلاق کے بارے میں پوچھا گیا تو انہوں نے فرمایا: \"آپ کا خلق قرآن تھا (كَانَ خُلُقُهُ الْقُرْآنَ)\"۔\n\nاس سے مراد یہی آیت ہے۔ اور ہر وہ چیز جسے اللہ نے عظیم قرار دیا ہے، ہر مومن پر اس کی تعظیم لازم ہے۔ پس اس ذکر کا حامل قرآن میں غور کرتا ہے، تو ہر وہ صفت جس کی اللہ نے تعریف کی ہے اور اس کے ذریعے اپنے بندوں کی ایک جماعت کی تعریف کی ہے، وہ جانتا ہے کہ یہ الٰہی مدح کی صفت ہے۔ پس اسے چاہیے کہ وہ ان صفات سے متصف ہونے کی کوشش کرے۔ اور جب اللہ قرآن میں کسی ایسی صفت کا ذکر کرے جس کے ذریعے اس نے اپنے بندوں کی ایک جماعت کی مذمت کی ہو، تو اس پر لازم ہے کہ وہ اس سے اجتناب کرے۔ پس وہ قرآن کو اس طرح لیتا ہے گویا وہ اس پر نازل ہوا ہے، اور حق (الحق) نے اس کے ذریعے کسی اور کو مخاطب نہیں کیا۔ جب وہ ایسا کرتا ہے تو اس کا خلق قرآن بن جاتا ہے، اور حق (الحق) اسے عظمت دیتا ہے، پس وہ وہاں عظیم ہوتا ہے جہاں عظمت فائدہ دیتی ہے۔ اور مکارم اخلاق (اچھے اخلاق) عقلی اور عرفی طور پر معلوم ہیں، اور ان میں تصرف شرعی طور پر معلوم ہے۔ پس جس نے ان سے شرعی طریقے پر خود کو متصف کیا اور مکارم اخلاق کی تکمیل میں اضافہ کیا، جو کہ ان کے ادنیٰ پہلوؤں کو بھی ان کے ساتھ شامل کرنا ہے، تاکہ وہ سب شرعی اور معقول تصرف کے ذریعے مکارم اخلاق بن جائیں، تو وہ ہر الٰہی تعریف سے متصف ہو گیا۔\n\nاور اس ذکر کے حامل کے لیے اس سورت کی آیات کے معانی میں، جس میں یہ نازل ہوئی، کامل ترین طریقوں سے کشف (الکشف) ہوتا ہے۔ اور وہ ہمیشہ حسد کا نشانہ بنتا ہے اور دشمنی کا ہدف ہوتا ہے۔ اور اس کے لیے آخرت کا معاملہ عیاناً (آنکھوں سے) منکشف ہو جاتا ہے۔ اور اسی سورت سے رسول اللہ صلی اللہ علیہ وسلم نے اولین و آخرین کا علم حاصل کیا۔ اور اللہ حق (الحق) فرماتا ہے اور وہی سیدھے راستے کی رہنمائی کرتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و سی و چهارم در معرفت حال قطبی که منزل او (و همانا تو بر اخلاق بزرگی هستی) [قرآن، قلم: ۴] بود.\n\nچون برای خلق عظیم آماده شدی\nاین بشارت پروردگار کریم است.\n\nرسول حال (حال) شتابان آن را برایت آورد\nبا نشانه‌های عنایت برای دانای مطلق (العلیم).\n\nپس تو در آن به مقام حق (الحق) قیام کردی\nهمان‌گونه که حدیث از ازل (القدیم) قیام کرد.\n\nپس ستایش از هر جهت حق توست\nو تو با خلق عظیم (الخلق العظیم) آن وجه بودی.\n\nپس تو وارث یگانه‌ای هستی که\nهمواره او را به نیکوکار مهربان (البر الرحیم) می‌خوانیم.\n\nعلمی که در آن شکی نیست از آن توست\nکه برادری با کلیم (موسی) آن را برایت آورد.\n\nپس به خلیل (الخلیل) و ندیم (الندیم) خوانده می‌شوی\nو به دوست صمیمی (الحمیم) و قسیم (القسیم) خوانده می‌شوی.\n\n(هرگاه خداوند برای بنده‌ای خیری بخواهد، اخلاق او را قرآن قرار می‌دهد).\n\nاین آیه بر ما تلاوت شد، تلاوتی که نزول الهی داشت، از ابتدای سوره تا قول او: زَنِيمٍ (حرام‌زاده) [قرآن، قلم: ۱۳]. ما حق (الحق) را در این تلاوت نازل شده از نزد خداوند، در بشارتی که خداوند از وحی نبوی برای ما باقی گذاشت، به عنوان میراث نبوی (وراثة نبوية) شناختیم. سپاس خدای را که مرا در آن وارث گردانید، از قول او: وَلَا تَكُ فِي ضَيْقٍ مِمَّا يَمْكُرُونَ (و از آنچه مکر می‌ورزند، دلتنگ مباش) [قرآن، نمل: ۷۰] و در قول او: وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ (و به یقین می‌دانیم که سینه تو از آنچه می‌گویند تنگ می‌شود) [قرآن، حجر: ۹۷] و قول او: فَأَعْرِضْ عَنْ مَنْ تَوَلَّى عَنْ ذِكْرِنَا وَلَمْ يُرِدْ إِلَّا الْحَيَاةَ الدُّنْيَا (پس از کسی که از یاد ما روی گردانده و جز زندگی دنیا را نخواسته است، اعراض کن) [قرآن، نجم: ۲۹]. پس خداوند را شکر کردم بر آنچه از حقایق میراث نبوی (الورث النبوي) به من محقق ساخت و امیدوارم که از کسانی باشم که از روی هوای نفس سخن نمی‌گویند. خداوند ما را از آنان قرار دهد، زیرا این همان عین عصمت الهی است. پس هرگاه خداوند برای صاحب این ذکر خیری بخواهد، آن را به او الهام می‌کند.\n\nبه دلیل حدیث عایشه درباره رسول خدا (صلی الله علیه و سلم)، هنگامی که از اخلاق رسول خدا (صلی الله علیه و سلم) سؤال شد، فرمود: (اخلاق او قرآن بود).\n\nمنظور این آیه است. و هر چیزی که خداوند آن را بزرگ داشته، تعظیم آن بر هر مؤمنی واجب است. پس صاحب این ذکر در قرآن می‌نگرد؛ هر صفتی که خداوند آن را ستوده و با آن گروهی از بندگانش را ستایش کرده است، هر که می‌خواهند باشند، می‌داند که آن صفت، ستایش الهی است. پس باید برای متصف شدن به آن صفات بکوشد. و هرگاه خداوند در قرآن صفتی را ذکر کند که با آن گروهی از بندگانش را نکوهیده است، هر که می‌خواهند باشند، اجتناب از آن بر او واجب می‌شود. پس قرآن را به گونه‌ای می‌گیرد که گویی در آن نازل شده و حق (الحق) با کسی جز او سخن نگفته است. اگر چنین کند، اخلاق او قرآن خواهد بود و حق (الحق) او را بزرگ می‌دارد، پس در جایی که عظمت سودمند است، بزرگ داشته می‌شود. مکارم اخلاق (مکارم الأخلاق) عقلاً و عرفاً معلوم است و تصرف در آن‌ها شرعاً معلوم است. پس هر کس به وجه مشروع به آن‌ها متصف شود و بر آن، تکمیل مکارم اخلاق را بیفزاید، که همان ملحق کردن امور پست (سفسافها) به آن‌هاست تا همه آن‌ها با تصرف مشروع و معقول، مکارم اخلاق شوند، به هر ستایش الهی متصف شده است. و برای صاحب این ذکر، معانی آیات سوره‌ای که در آن نازل شده، به کامل‌ترین وجه گشوده می‌شود و پیوسته مورد حسادت و هدف دشمنی قرار می‌گیرد و امر آخرت برای او آشکارا (عیاناً) کشف (الکشف) می‌شود. و از این سوره بود که رسول خدا (صلی الله علیه و سلم) علم اولین و آخرین را دانست. وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند) [قرآن، احزاب: ۴]."
  },
  "page_count": 1
}