{
  "id": 96,
  "title": {
    "ar": "الباب السادس والتسعون في الصمت وأسراره",
    "en": "Chapter Ninety-Six: On Silence and its Secrets.",
    "ur": "چھانوےواں باب: صمت (خاموشی) اور اس کے اسرار کے بیان میں",
    "fa": "باب نود و ششم در صمت (سکوت) و اسرار آن"
  },
  "content": {
    "ar": "## (الباب السادس والتسعون في الصمت وأسراره)\n\n\n> الله قال على لسان عبيده *** فالصمت في الأكوان نعت لازم‏\n\n\n> ما ثم إلا من يكلم نفسه *** فهو السميع كلامه والعالم‏\n\n\n> وهو الوجود فليس إلا عينه *** هذا هو الحق الصريح الحاكم‏\n\n\n### [الصمت أحد أركان مقام البدلية]\n\n\nاعلم وفقك الله أن الصمت أحد الأربعة الأركان التي بها يكون الرجال والنساء أبدا لا قيل لبعضهم كم الأبدال قال أربعون نفسا قيل له لم لم تقل رجلا قال قد يكون فيهم النساء كما\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم في الكمال فذكر أنه يكون أيضا في النساء وعين منهن مريم ابنة عمران وآسية امرأة فرعون‏\n\n\n### [مقام الصمت وحاله وحكمه‏]\n\n\nوله حال ومقام فأما مقامه فهو إنه لا يرى متكلما إلا من خلق الكلام في عباده وهو الله تعالى خالِقُ كُلِّ شَيْ‏ءٍ فالعبد صامت بذاته متكلم بالعرض وأما حاله فهو أن يرى أن الله وإن خلق الكلام فيه فالعبد هو المتكلم فيه كما هو المتحرك بخلق الحركة فيه ولا يصح أن يصمت مطلقا أصلا فإنه مأمور بذكر الله تعالى في أحوال مخصوصة أمر وجوب فهو مقام مقيد بصفة تنزيه لأنه وصف سلبي وحكمه في ظاهر الإنسان وأما باطنه فلا يصح فيه صمت فإنه كله ناطق بتسبيح الله فالصمت محال وإنما الكلام على الصمت المعلوم بالعرف ومن تخلل صمته كلام في غير فرض ولا ذكر لله فما صمت‏\n\n\n### [الصامت في طريق الله‏]\n\n\nفالصامت هنا هو الذي يقيم نشأة مصمتة الأجزاء لا يتخللها حين فارغ مقدر حينئذ يكون صامتا وإذا أراد الإنسان أن يختبر نفسه هل هو ممن صمت كما ينبغي فلينظر هل له فعل بالهمة المجردة فيما من شأنه أن لا يفعل إلا بالكلام أم لا فإن أثر وحصل المقصود فهو صامت حقيقة مثل أن يريد أن يقول لخادمه اسقني ماء وأتني بطعام أو سر إلى فلان فقل له كذا وكذا ولا يشير إلى الخادم بشي‏ء من هذا كله فيجد الخادم في نفسه ذلك كله بأن يخلق الله في سمع الخادم عن ذلك يقول فلان قال لي افعل كذا وكذا يسمع ذلك حسا بإذنه ولكن‏\nيتخيل أنه صوت ذلك الصامت وليس كذلك فمن ليست له هذه الحالة فلا يدعي أنه صامت‏\n\n\n### [المتكلم بالإشارة]\n\n\nوأما الصامت المتكلم بالإشارة فهو يتعب نفسه وغيره ولا ينتج له شيئا بل هو ممن يتشبه بالأخرس الذي يتكلم بالإشارة فلا يعول عليه وهذا مما غلط فيه جماعة من أهل الطريق فمن نصح نفسه فقد أقمنا له ميزان هذا المقام الذي يزنه به حتى لا يتلبس عليه الأمر وهذا لا يكون إلا للالهيين المحسنين لا لغيرهم من المؤمنين والمسلمين الذين لم يحصل لهم مقام الإحسان‏\n\n",
    "en": "Allah speaks upon the tongues of His servants,\nThus, silence in the cosmos is a necessary attribute.\nThere is nothing there save the One who speaks to Himself,\nFor He is the Hearer of His own speech, and the Knower.\nHe is Existence (الوجود), so there is nothing but His very Essence,\nThis is the clear, decisive Truth (الحق).\n\n### Silence is one of the Pillars of the Station of the Substitutes\n\nKnow, may Allah grant you success, that silence is one of the four pillars by which the men and women who are perpetually the Substitutes (الأبدال) are constituted. It was once asked of one of them, \"How many are the Substitutes?\" He replied, \"Forty souls.\" When asked why he did not say 'men,' he answered, \"Women may be among them,\" just as the Prophet, peace and blessings be upon him, spoke concerning perfection (الكمال), mentioning that it also exists among women, specifically naming Maryam the daughter of Imran and Asiya the wife of Pharaoh.\n\n### The Station of Silence, its State, and its Ruling\n\nIt has a state (حال) and a station (مقام). As for its station, it is that one sees no speaker except the One who creates speech in His servants, and that is Allah, the Exalted, <<خَالِقُ كُلِّ شَيْءٍ>> (Creator of all things). Thus, the servant is silent by his Essence (بذاته) and speaks accidentally (بالعرض).\n\nAs for its state, it is that one sees that even though Allah creates speech within him, the servant is the one speaking through it, just as he is the one moving through the creation of movement within him. It is not permissible for him to be absolutely silent, for he is commanded to remember Allah (ذكر الله) in specific circumstances as a matter of obligation (وجوب).\n\nThus, it is a station restricted by the attribute of transcendence (تنزيه) because it is a negative description, and its ruling applies to the outward aspect of the human being. As for his inward aspect (باطنه), silence is not valid therein, for it is entirely speaking (ناطق) with the glorification (تسبيح) of Allah; thus, absolute silence is impossible. The discussion is only concerning the silence known by common usage. And whoever's silence is interspersed with speech that is neither an obligation (فرض) nor remembrance of Allah, then he has not truly been silent.\n\n### The Silent One on the Path of Allah\n\nThe silent one (الصامت) here is he who establishes a state (نشأة) whose parts are solid (مصمتة), not interspersed with any estimated empty moment; only then is he truly silent. If a person wishes to test himself, whether he is among those who are silent as they ought to be, let him observe whether he can perform an action purely through spiritual resolve (الهمة المجردة) in matters that are normally only accomplished through speech, or not. If it takes effect and the desired goal is achieved, then he is truly silent.\n\nFor example, if he wishes to tell his servant, \"Give me water,\" or \"Bring me food,\" or \"Go to so-and-so and tell him such-and-such,\" and he does not signal the servant with any of this, yet the servant finds all of that within himself. This happens because Allah creates in the servant's hearing [the knowledge] concerning that, so the servant says, \"So-and-so told me to do such-and-such.\" He hears this sensually, by Allah's permission, but he imagines it is the voice of that silent person, which is not the case. Whoever does not possess this state should not claim that he is silent.\n\n### The One Who Speaks Through Signaling\n\nAs for the silent one who speaks through signaling (الإشارة), he tires himself and others and produces nothing for himself. Rather, he is one who resembles the mute person who speaks through signaling, and no reliance should be placed upon him. This is a point where a group of the people of the Path (أهل الطريق) have erred. Whoever advises himself sincerely, we have established for him the balance (ميزان) of this station by which he may weigh it, so that the matter does not become confused for him. This is only attained by the Divine ones (الالهيين) who possess spiritual excellence (المحسنين), not by others among the believers (المؤمنين) and Muslims who have not achieved the station of Spiritual Excellence (مقام الإحسان).",
    "ur": "(صمت اور اس کے اسرار کے بارے میں چھانوےواں باب)\n\nاللہ نے اپنے بندوں کی زبان پر کہا ہے *** پس کائناتوں میں صمت (خاموشی) ایک لازمی صفت ہے\nوہاں اس کے سوا کوئی نہیں جو خود سے کلام کرتا ہے *** پس وہی اس کا کلام سننے والا اور جاننے والا ہے\nاور وہی ہستی (الوجود) ہے، پس اس کی عین ذات کے سوا کچھ نہیں *** یہی وہ واضح اور حاکم ذات حق (الحق) ہے\n\n### [صمت، مقام بدلیت کے ارکان میں سے ایک ہے]\n\nجان لو، اللہ تمہیں توفیق دے، کہ صمت ان چار ارکان میں سے ایک ہے جن کے ذریعے مرد اور عورتیں ابدال (البدلیۃ) بنتے ہیں۔ کسی نے ان میں سے بعض سے پوچھا کہ ابدال کتنے ہیں؟ انہوں نے کہا: چالیس نفوس۔ ان سے پوچھا گیا کہ آپ نے 'مرد' کیوں نہیں کہا؟ انہوں نے جواب دیا: ان میں عورتیں بھی ہو سکتی ہیں، جیسا کہ نبی اکرم صلی اللہ علیہ وسلم نے کمال کے بارے میں فرمایا، اور ذکر کیا کہ یہ عورتوں میں بھی ہوتا ہے، اور ان میں سے مریم بنت عمران اور آسیہ زوجہ فرعون کو خاص طور پر نامزد کیا۔\n\n### [صمت کا مقام، اس کا حال اور اس کا حکم]\n\nصمت کا ایک حال (الحال) اور ایک مقام (المقام) ہے۔ جہاں تک اس کے مقام کا تعلق ہے، وہ یہ ہے کہ وہ کسی کو متکلم نہیں دیکھتا سوائے اس ذات کے جس نے اپنے بندوں میں کلام پیدا کیا، اور وہ اللہ تعالیٰ ہے، خالِقُ كُلِّ شَيْ‏ءٍ (ہر چیز کا خالق) ہے۔ پس بندہ اپنی ذات کے اعتبار سے صامت (خاموش) ہے اور بالعرض متکلم ہے۔ اور جہاں تک اس کے حال کا تعلق ہے، وہ یہ ہے کہ وہ دیکھتا ہے کہ اگرچہ اللہ نے اس میں کلام پیدا کیا ہے، لیکن بندہ ہی اس میں متکلم ہے، جیسا کہ وہ اس میں حرکت پیدا کرنے سے متحرک ہوتا ہے۔ اور یہ درست نہیں کہ وہ مطلقاً بالکل خاموش رہے، کیونکہ اسے مخصوص حالات میں اللہ تعالیٰ کے ذکر کا حکم دیا گیا ہے، جو وجوب کا حکم ہے۔ پس یہ ایک ایسا مقام ہے جو صفت تنزیہ کے ساتھ مقید ہے، کیونکہ یہ ایک سلبی وصف ہے، اور اس کا حکم انسان کے ظاہر میں ہے۔ لیکن اس کے باطن میں صمت (خاموشی) درست نہیں، کیونکہ اس کا پورا باطن اللہ کی تسبیح کے ساتھ ناطق ہے۔ لہٰذا صمت محال ہے، اور کلام صرف اس صمت کے بارے میں ہے جو عرف عام میں معلوم ہے۔ اور جس کی خاموشی میں فرض کے علاوہ یا اللہ کے ذکر کے علاوہ کوئی کلام شامل ہو جائے، تو اس نے صمت اختیار نہیں کیا۔\n\n### [طریق اللہ میں صامت]\n\nپس یہاں صامت وہ ہے جو ایک ایسی نشأت قائم کرتا ہے جس کے اجزاء خاموش ہوں، جس میں کوئی خالی وقت داخل نہ ہو، تب وہ صامت ہوتا ہے۔ اور جب انسان یہ جانچنا چاہے کہ آیا وہ ان لوگوں میں سے ہے جنہوں نے کما حقہ صمت اختیار کیا ہے یا نہیں، تو اسے دیکھنا چاہیے کہ کیا وہ مجرد ہمت (الہمۃ المجردۃ) کے ذریعے ایسے کاموں میں فعل کر سکتا ہے جو عام طور پر صرف کلام کے ذریعے ہی کیے جاتے ہیں یا نہیں؟ اگر اس کا اثر ہو اور مقصد حاصل ہو جائے، تو وہ حقیقت میں صامت ہے۔ مثال کے طور پر، وہ اپنے خادم سے کہنا چاہے کہ مجھے پانی پلاؤ، اور میرے لیے کھانا لاؤ، یا فلاں کے پاس جاؤ اور اسے یہ یہ بات کہو، اور وہ خادم کو ان میں سے کسی چیز کا اشارہ بھی نہ کرے، لیکن خادم اپنے اندر وہ سب کچھ پائے۔ یہ اس طرح ہوتا ہے کہ اللہ تعالیٰ خادم کے کان میں اس کلام کو پیدا کر دیتا ہے، اور وہ کہتا ہے کہ فلاں نے مجھ سے کہا کہ یہ یہ کام کرو۔ وہ اسے اپنے کان سے محسوس طور پر سنتا ہے، لیکن وہ یہ گمان کرتا ہے کہ یہ اس صامت کی آواز ہے، حالانکہ ایسا نہیں ہے۔ پس جس شخص کو یہ حال حاصل نہ ہو، اسے صامت ہونے کا دعویٰ نہیں کرنا چاہیے۔\n\n### [اشارے سے کلام کرنے والا]\n\nاور جہاں تک اشارے سے کلام کرنے والے صامت کا تعلق ہے، تو وہ خود کو اور دوسروں کو تھکاتا ہے اور اس سے کوئی نتیجہ برآمد نہیں ہوتا۔ بلکہ وہ ان لوگوں میں سے ہے جو گونگے کی مشابہت اختیار کرتے ہیں جو اشارے سے کلام کرتا ہے، لہٰذا اس پر بھروسہ نہیں کیا جا سکتا۔ اور یہ وہ چیز ہے جس میں اہل طریق کے ایک گروہ نے غلطی کی ہے۔ پس جس نے اپنے نفس کی خیر خواہی کی، تو ہم نے اس کے لیے اس مقام کا میزان قائم کر دیا ہے جس سے وہ اسے تولے گا تاکہ معاملہ اس پر مشتبہ نہ ہو۔ اور یہ (صمت حقیقی) صرف الٰہیین محسنین کے لیے ہوتا ہے، نہ کہ ان دوسرے مومنین اور مسلمین کے لیے جنہیں مقام احسان (الإحسان) حاصل نہیں ہوا۔",
    "fa": "باب نود و ششم در باب سکوت (الصمت) و اسرار آن\n\nخداوند بر زبان بندگانش سخن گفت *** پس سکوت (الصمت) در هستی‌ها صفتی لازم است\nدر آنجا جز کسی که با نفس خود سخن می‌گوید نیست *** پس اوست شنونده کلامش و دانا\nو اوست هستی (الوجود)، پس جز عین او نیست *** این است حق (الحق) صریح و حاکم\n\n### [سکوت (الصمت) یکی از ارکان مقام ابدال]\n\nبدان، خداوند تو را توفیق دهد، که سکوت (الصمت) یکی از چهار رکنی است که مردان و زنان ابدال (الأبدال) به واسطه آن محقق می‌شوند. از برخی از ایشان پرسیده شد: ابدال چند نفرند؟ گفت: چهل نفس. به او گفته شد: چرا نگفتی مرد؟ گفت: ممکن است زنان نیز در میان آنان باشند، چنانکه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در باب کمال فرمود و ذکر کرد که کمال در زنان نیز هست و مریم دختر عمران و آسیه همسر فرعون را از ایشان نام برد.\n\n### [مقام سکوت (الصمت)، حال و حکم آن]\n\nو برای آن (سکوت) حال و مقامی است. اما مقام آن این است که جز کسی که کلام را در بندگانش آفریده است، یعنی خداوند متعال که خالقُ کُلِّ شَيْ‏ءٍ (آفریننده هر چیز) است، متکلمی نمی‌بیند. پس بنده به ذات خود ساکت و به عرض متکلم است. و اما حال آن این است که ببیند اگرچه خداوند کلام را در او آفریده است، اما بنده همان کسی است که در او سخن گفته می‌شود، همان‌گونه که با خلق حرکت در او، متحرک است. و شایسته نیست که بنده مطلقاً سکوت کند، زیرا او در احوال مخصوصی به ذکر خداوند متعال امر شده است که امر وجوبی است. پس این مقام، مقید به صفت تنزیه است، زیرا وصفی سلبی است و حکم آن در ظاهر انسان است. اما باطن انسان، سکوت در آن صحیح نیست، زیرا باطن تماماً به تسبیح خداوند گویاست. پس سکوت (مطلق) محال است. بلکه سخن درباره سکوتی است که در عرف شناخته شده است. و کسی که در سکوتش کلامی غیر از واجبات و ذکر خدا وارد شود، سکوت نکرده است.\n\n### [ساکت در راه خدا]\n\nپس ساکت (الصامت) در اینجا کسی است که نشأتی با اجزای خاموش برپا می‌دارد که هیچ لحظه خالی در آن وارد نمی‌شود؛ در این هنگام است که او ساکت است. و اگر انسان بخواهد خود را بیازماید که آیا او از کسانی است که آن‌گونه که شایسته است سکوت کرده‌اند یا نه، باید بنگرد که آیا او با همت (الهمة) مجرد، در اموری که شأن آن است که جز با کلام انجام نشود، فعلی دارد یا نه؟ اگر تأثیر گذاشت و مقصود حاصل شد، او حقیقتاً ساکت است. مثلاً، می‌خواهد به خادمش بگوید: به من آب بده، یا برایم غذا بیاور، یا نزد فلانی برو و به او چنین و چنان بگو؛ و به هیچ وجه به خادم اشاره‌ای نمی‌کند، اما خادم همه آن را در نفس خود می‌یابد، به این صورت که خداوند در گوش خادم از آن (امر) خلق می‌کند. خادم می‌گوید: فلانی به من گفت فلان کار را بکن. او این را به صورت حسی با گوش خود می‌شنود، اما تصور می‌کند که آن صدای آن ساکت است، در حالی که چنین نیست. پس کسی که این حال را ندارد، نباید ادعا کند که ساکت است.\n\n### [متکلم با اشاره]\n\nو اما ساکتی که با اشاره سخن می‌گوید، او خود و دیگران را به زحمت می‌اندازد و چیزی برایش به بار نمی‌آورد، بلکه او از کسانی است که خود را شبیه به لال‌هایی می‌کند که با اشاره سخن می‌گویند، پس بر او اعتمادی نیست. این از مواردی است که گروهی از اهل طریق در آن دچار اشتباه شده‌اند. پس هر کس که خیرخواه نفس خود باشد، ما ترازوی این مقام را برایش برپا داشتیم تا با آن خود را بسنجد و امر بر او مشتبه نشود. و این (مقام) جز برای الهیون نیکوکار (المحسنين) حاصل نمی‌شود، نه برای دیگر مؤمنان و مسلمانانی که مقام احسان (الإحسان) را به دست نیاورده‌اند."
  },
  "page_count": 2
}