{
  "id": 187,
  "title": {
    "ar": "الباب السابع والثمانون ومائة في معرفة مقام المعجزة وكيف يكون هذا المعجز كرامة لمن كان له معجزا لاختلاف الحال",
    "en": "Chapter One Hundred and Eighty-Seven: Concerning the Gnosis (معرفة) of the Station (مقام) of the Miracle (المعجزة), and how this miraculous act becomes a Spiritual Favor (كرامة) for the one for whom it was a miracle, due to the difference in the Spiritual State (الحال).",
    "ur": "باب ایک سو ستاسی: معجزہ (Mu'jiza) کے مقام کی معرفت (Ma'rifa) اور یہ کہ یہ معجزہ اس شخص کے لیے کرامت (Karāma) کیسے بن جاتا ہے جس کے لیے یہ معجزہ تھا، حال (Ḥāl) کے اختلاف کی بنا پر۔",
    "fa": "باب صد و هشتاد و هفتم در معرفت مقام معجزه و چگونگی اینکه این معجزه برای کسی که معجزه برای اوست، به دلیل اختلاف حال، کرامت باشد."
  },
  "content": {
    "ar": "## (الباب السابع والثمانون ومائة في معرفة مقام المعجزة وكيف يكون هذا المعجز كرامة لمن كان له معجزا لاختلاف الحال)\n\n\n> ما كان معجزة فلا سبيل إلى *** ظهوره مرة أخرى إلى الأبد\n\n\n> لا في ولي ولا في غيره فإذا *** حققت قولي فلا تعدل عن الرشد\n\n\n> ولو تحدي به خلق لأكذبه *** صدق المقدم في الأدنى وفي البعد\n\n\n> لذلك اختلفت في الأنبياء فلم *** يظهر لها أثر من بعد في أحد\n\n\n### [اختلف الناس في أن معجزة النبي هل يكون كرامة لولي أم لا]\n\n\nاختلف الناس فيما كان معجزة لنبي هل يكون كرامة لولي أم لا فالجمهور أجاز ذلك إلا الأستاذ أبا إسحاق الأسفراييني فإنه منع من ذلك وهو الصحيح عندنا إلا أنا نشترط أمرا لم يذكره الأستاذ وهو أن نقول إلا إن قام الولي بذلك الأمر المعجز على تصديق النبي لا على جهة الكرامة به فهو واقع عندنا بل قد شهدناه فيظهر على الولي ما كان معجزة لنبي على ما قلناه ولو تنبه لذلك الأستاذ لقال به ولم ينكره فإنه ما خرج عن بابه فإن الذي وقع فيه الخلاف أنه هل يكون كرامة لولي وهذا ليس بكرامة لولي إلا إن الذين أجازوا ذلك قالوا بشرط أن لا يظهر عليه بالطريق التي ظهرت على يد الرسول الذي بها سميت معجزة وجوزوا أن الولي لو تحدي بذلك على ولايته لجاز أن يخرق الله له تلك العادة والكاذب لو تحدي بها على كذبه وهو صادق في أنه كاذب فجائز أن يخرق الله له تلك العادة على صدقه أنه كاذب فإن الفارق عندهم حاصل وهو وجه يقال والصحيح ما ذهب إليه الأستاذ وهو الذي يعطيه الدليل النظري إلا أن يقول الرسول في وقت تحديه بالمنع في الوقت خاصة أو في مدة حياته خاصة فإنه جائز أن يقع ذلك الفعل كرامة لغيره بعد انقضاء زمانه الذي اشترطه وأما إن أطلقه فلا سبيل إلى ما قاله الأستاذ وهذا التفصيل الذي ذكرناه يقتضيه الدليل النظري للطائفتين على أنا ما رأينا أحدا تنبه إلى هذا في علمنا ولا ذكره والله أعلم‏\n\n\n### [الإعجاز على ضربين‏]\n\n\nوالإعجاز على ضربين الضرب الواحد أن يأتي بأمر لا يكون مقدور البشر ولا يقدر عليه إلا الله وذلك عزيز أعني الوصول إلى العلم به كإحياء الموتى لا يقدر عليه إلا الله ولكن الوصول إليه على طريق العلم أنه حي في نفس الأمر عزيز فإنا رأينا عصا موسى عليه السلام حية وعصى السحرة حيات ولم تفرق العامة بين الحياتين فلهذا قلنا إن الوصول إلى علم ذلك عزيز والضرب الآخر وهو الذي يمكن أن يكون أقرب وهو الصرف فيدعي في ذلك أن الذي هو مقدور لكم في العادة إذا أتيت أنابه على صدق دعواي فإن الذي أرسلني يصرفكم عنه فلا تقدرون على معارضته فكل من في قدرته ذلك يجد في نفسه العجز في ذلك الوقت فلا يقدر على إتيان ما كان قبل هذه الدعوى يقدر عليه وهذا أرفع للبس من الأول فهذا معنى الأمر المعجز ومع هذا فقد وقع وعرف أنه معجزة وحصل العلم به عند الناظر بصدق هذا الرسول وما رزق الايمان به وجَحَدُوا بِها واسْتَيْقَنَتْها أَنْفُسُهُمْ ظُلْماً وعُلُوًّا فتعلم أن الايمان لا تعطيه إقامة الدليل بل هو نور إلهي يلقيه الله في قلب من شاء من عباده وقد يكون عقيب الدليل وقد لا يكون هناك دليل أصلا كما قال تعالى ولكِنْ جَعَلْناهُ نُوراً نَهْدِي به من نَشاءُ من عِبادِنا فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء السادس عشر ومائة\n( (بسم الله الرحمن الرحيم))\n\n",
    "en": "Chapter 187: On the Knowledge of the Station of the Miracle (Mu'jiza) and How This Miracle May Become a Wonder (Karāma) for the One Who Performed It, Due to the Difference in Circumstance.\n\nThat which was a miracle has no path to its appearance ever again,\nNeither through a saint (walī) nor through anyone else. If you verify my statement, do not deviate from guidance (al-rushd).\nAnd if creation were to challenge with it, the truthfulness of the Predecessor would belie them, both near and far.\nFor this reason, it was unique to the Prophets, and its effect has not appeared in anyone since.\n\n### [People Differ on Whether the Prophet's Miracle Can Be a Saint's Wonder]\n\nPeople differed regarding whether the miracle (mu'jiza) of a Prophet can become a wonder (karāma) for a saint (walī). The majority permitted this, except for the Master Abu Ishaq al-Isfara'ini, who prohibited it. This latter view is the correct one according to us, except that we stipulate a condition that the Master did not mention.\n\nThis condition is that we say: unless the saint performs that miraculous act in affirmation of the Prophet, and not on the basis of it being a wonder (karāma) for himself. In this case, it is realized according to us; indeed, we have witnessed it. Thus, what was a miracle for a Prophet appears through the saint, according to what we have stated. Had the Master been aware of this distinction, he would have affirmed it and not denied it, for it does not depart from his principle. The point of contention was whether it could be a wonder (karāma) for a saint, and this is not a wonder for the saint.\n\nHowever, those who permitted it stipulated that it must not appear through the same method by which it appeared at the hands of the Messenger, which is why it was called a miracle (mu'jiza). They permitted that if the saint were to challenge (تحدي) with it based on his sainthood (wilāya), God might break the custom (خرق العادة) for him. And if a liar were to challenge with it based on his lie—while being truthful in his claim that he is a liar—it is permissible for God to break the custom for him based on his truthfulness in being a liar. For the distinguishing factor (الفارق) is present according to them, which is a viewpoint that is stated.\n\nThe correct view is that which the Master adopted, and it is what the theoretical proof (الدليل النظري) dictates. Unless the Messenger, at the time of his challenge, stipulated a prohibition specifically for that time, or specifically for the duration of his life. In that case, it is permissible for that act to occur as a wonder (karāma) for someone else after the expiration of the time he stipulated. But if he stated it absolutely, then there is no path to the repetition [which the Master denied]. This detailed distinction we have mentioned is required by the theoretical proof (al-dalīl al-naẓarī) for both parties, although we have not seen anyone in our knowledge who has noted this or mentioned it. And Allah knows best.\n\n### [The Miracle (I'jāz) is of Two Types]\n\nThe miracle (الإعجاز) is of two types. The first type is to bring forth an act that is not within the capacity of human beings and which only God is capable of performing. This is rare—meaning, the attainment of knowledge concerning it—such as the raising of the dead, which only God can do. However, the attainment of the knowledge that the raised person is truly alive in reality (في نفس الأمر) is rare. For we saw the staff of Moses (peace be upon him) become a living creature, and the staffs of the sorcerers became living creatures, and the common people did not distinguish between the two types of living creatures. For this reason, we said that the attainment of knowledge concerning that is rare.\n\nThe second type, which may be closer [to understanding], is the Diversion (الصرف). In this type, the claimant asserts that if I bring forth something that is ordinarily within your capacity, based on the truthfulness of my claim, then the One who sent me will divert you (يصرفكم) from it, so you will be unable to oppose it. Everyone who possesses the capacity for that act finds themselves incapable at that moment, unable to perform what they were capable of before this claim. This removes ambiguity (اللبس) more effectively than the first type.\n\nThis is the meaning of the miraculous act (al-amr al-mu'jiz). Despite this, the event occurred, and it was known to be a miracle (mu'jiza), and the observer attained knowledge of the truthfulness of this Messenger. Yet, those who were not granted faith in him denied it: <<وَجَحَدُوا بِهَا وَاسْتَيْقَنَتْهَا أَنفُسُهُمْ ظُلْمًا وَعُلُوًّا>> (And they denied them, though their souls were convinced of them, out of injustice and arrogance). [Quran 27:14]\n\nThus, you know that faith (al-īmān) is not granted by the establishment of proof (إقامة الدليل); rather, it is a divine light (نور إلهي) that God casts into the heart of whomever He wills among His servants. It may occur following the proof, or there may be no proof at all, as the Exalted said: <<وَلَكِن جَعَلْنَاهُ نُورًا نَّهْدِي بِهِ مَن نَّشَاءُ مِنْ عِبَادِنَا>> (But We have made it a light by which We guide whom We will of Our servants). [Quran 42:52] Know this, and <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way). [Quran 33:4]\n\nEnd of the one hundred and sixteenth part.\n(In the Name of God, the Most Compassionate, the Most Merciful)",
    "ur": "ایک سو ستاسیواں باب: معجزے کے مقام کی معرفت میں اور یہ معجزہ کس طرح اس شخص کے لیے کرامت بن جاتا ہے جس کے لیے وہ معجزہ تھا، حالت کے اختلاف کی بنا پر۔\n\nجو چیز معجزہ تھی، اس کے لیے ہمیشہ کے لیے دوبارہ ظاہر ہونے کا کوئی راستہ نہیں۔\nنہ کسی ولی میں اور نہ کسی اور میں۔ پس جب تم میرے قول کی تحقیق کر لو تو ہدایت سے منہ نہ موڑنا۔\nاور اگر کوئی مخلوق اس کے ذریعے چیلنج کرے تو مقدم (پہلے سے موجود) کی سچائی اسے جھٹلا دے گی، خواہ وہ قریب ہو یا دور۔\nاسی لیے انبیاء میں (معجزات) مختلف ہوئے، چنانچہ بعد میں کسی میں بھی ان کا اثر ظاہر نہیں ہوا۔\n\n### [اس بارے میں لوگوں کا اختلاف کہ کیا نبی کا معجزہ ولی کے لیے کرامت ہو سکتا ہے یا نہیں]\n\nلوگوں نے اس بارے میں اختلاف کیا ہے کہ جو چیز کسی نبی کا معجزہ تھی، کیا وہ کسی ولی کے لیے کرامت ہو سکتی ہے یا نہیں؟ جمہور نے اسے جائز قرار دیا ہے، سوائے استاد ابو اسحاق الاسفرائینی کے، جنہوں نے اس سے منع کیا ہے، اور ہمارے نزدیک یہی صحیح ہے۔ البتہ ہم ایک ایسی شرط لگاتے ہیں جس کا ذکر استاد نے نہیں کیا، اور وہ یہ ہے کہ ہم کہیں گے: مگر یہ کہ ولی اس معجزانہ امر کو نبی کی تصدیق کی بنا پر انجام دے، نہ کہ کرامت کے طور پر۔ تو یہ ہمارے نزدیک واقع ہو سکتا ہے، بلکہ ہم نے اس کا مشاہدہ کیا ہے۔ پس ولی پر وہ چیز ظاہر ہو جاتی ہے جو کسی نبی کا معجزہ تھی، جیسا کہ ہم نے کہا۔ اور اگر استاد اس پر متنبہ ہوتے تو وہ اسے ضرور کہتے اور اس کا انکار نہ کرتے، کیونکہ یہ ان کے اصول سے باہر نہیں ہے۔ کیونکہ جس چیز میں اختلاف واقع ہوا ہے وہ یہ ہے کہ کیا یہ ولی کے لیے کرامت ہو سکتی ہے؟ اور یہ (ہمارا بیان کردہ صورت) ولی کے لیے کرامت نہیں ہے۔ البتہ جن لوگوں نے اسے جائز قرار دیا ہے، انہوں نے یہ شرط لگائی ہے کہ وہ اس طریقے سے ظاہر نہ ہو جس طریقے سے وہ اس رسول کے ہاتھ پر ظاہر ہوا تھا جس کی وجہ سے اسے معجزہ کہا گیا تھا۔ اور انہوں نے یہ بھی جائز قرار دیا کہ اگر ولی اپنی ولایت کی بنا پر اس کے ذریعے چیلنج کرے تو اللہ تعالیٰ اس کے لیے اس عادت کو توڑ سکتا ہے۔ اور اگر کوئی جھوٹا شخص اپنے جھوٹ کی بنا پر اس کے ذریعے چیلنج کرے، جبکہ وہ اس بات میں سچا ہو کہ وہ جھوٹا ہے، تو جائز ہے کہ اللہ تعالیٰ اس کے لیے اس عادت کو توڑ دے، اس کے اس سچ کی بنا پر کہ وہ جھوٹا ہے۔ کیونکہ ان کے نزدیک فرق کرنے والی چیز موجود ہے، اور یہ ایک قابل ذکر پہلو ہے۔ اور صحیح وہی ہے جس کی طرف استاد گئے ہیں، اور یہی وہ ہے جو نظری دلیل فراہم کرتی ہے۔ مگر یہ کہ رسول اپنے چیلنج کے وقت خاص طور پر اس وقت کے لیے یا خاص طور پر اپنی حیات کی مدت کے لیے منع کر دے۔ کیونکہ جائز ہے کہ وہ فعل اس کی مقرر کردہ مدت کے ختم ہونے کے بعد کسی دوسرے کے لیے کرامت کے طور پر واقع ہو جائے۔ لیکن اگر اس نے اسے مطلق چھوڑ دیا تو استاد کے قول کی طرف کوئی راستہ نہیں ہے۔ اور یہ تفصیل جو ہم نے بیان کی ہے، دونوں گروہوں کی نظری دلیل کا تقاضا ہے، اگرچہ ہم نے اپنے علم میں کسی کو اس پر متنبہ ہوتے یا اس کا ذکر کرتے نہیں دیکھا۔ اور اللہ ہی بہتر جانتا ہے۔\n\n### [اعجاز (معجزہ دکھانا) دو قسم کا ہے]\n\nاور اعجاز (معجزہ دکھانا) دو قسم کا ہے۔ پہلی قسم یہ ہے کہ ایسا امر لایا جائے جو انسان کی قدرت میں نہ ہو اور جس پر صرف اللہ ہی قادر ہو۔ اور یہ (علم) نایاب ہے، یعنی اس کے علم تک رسائی۔ جیسے مردوں کو زندہ کرنا، جس پر صرف اللہ ہی قادر ہے۔ لیکن اس علم تک رسائی کہ وہ حقیقت میں زندہ ہے، نایاب ہے۔ کیونکہ ہم نے موسیٰ علیہ السلام کا عصا بھی سانپ دیکھا اور جادوگروں کے عصا بھی سانپ دیکھے، اور عام لوگوں نے دونوں سانپوں میں فرق نہیں کیا۔ اسی لیے ہم نے کہا کہ اس کے علم تک رسائی نایاب ہے۔\n\nاور دوسری قسم، جو زیادہ قریب ہو سکتی ہے، وہ ہے الصرف (روک دینا)۔ اس میں یہ دعویٰ کیا جاتا ہے کہ جو چیز تمہاری عادت میں تمہاری قدرت میں ہے، اگر میں اپنی سچائی کے دعوے پر اسے لے آؤں، تو جس نے مجھے بھیجا ہے وہ تمہیں اس سے پھیر دے گا، چنانچہ تم اس کا مقابلہ نہیں کر سکو گے۔ پس ہر وہ شخص جو اس پر قدرت رکھتا ہے، وہ اس وقت اپنے اندر عاجزی پاتا ہے، اور وہ اس چیز کو لانے پر قادر نہیں ہوتا جس پر وہ اس دعوے سے پہلے قادر تھا۔ اور یہ (طریقہ) پہلے طریقے سے زیادہ ابہام کو دور کرنے والا ہے۔\n\nتو یہ ہے معجزانہ امر کا مفہوم۔ اور اس کے باوجود یہ واقع ہوا اور اسے معجزہ کے طور پر پہچانا گیا، اور دیکھنے والے کے نزدیک اس رسول کی سچائی کا علم حاصل ہوا۔ اور جسے ایمان کی روزی نہیں ملی، (اس نے انکار کیا)۔\n**جَحَدُوا بِها واسْتَيْقَنَتْها أَنْفُسُهُمْ ظُلْماً وعُلُوًّا**\n(اور انہوں نے ان (آیات) کا انکار کر دیا، حالانکہ ان کے دلوں نے ظلم اور تکبر کی بنا پر انہیں یقین کر لیا تھا۔)\n\nپس تم جان لو کہ ایمان دلیل قائم کرنے سے حاصل نہیں ہوتا، بلکہ یہ ایک نورِ الٰہی ہے جسے اللہ اپنے بندوں میں سے جس کے دل میں چاہتا ہے ڈال دیتا ہے۔ اور یہ کبھی دلیل کے بعد ہوتا ہے اور کبھی وہاں کوئی دلیل سرے سے موجود نہیں ہوتی، جیسا کہ اللہ تعالیٰ نے فرمایا:\n**ولكِنْ جَعَلْناهُ نُوراً نَهْدِي به من نَشاءُ من عِبادِنا**\n(لیکن ہم نے اسے ایک نور بنایا ہے، جس کے ذریعے ہم اپنے بندوں میں سے جسے چاہتے ہیں ہدایت دیتے ہیں۔)\n\nپس یہ جان لو، اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔\n**والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ**\n(اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔)\nایک سو سولہواں حصہ مکمل ہوا۔\n\n(شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے)",
    "fa": "باب صد و هشتاد و هفتم در معرفت مقام معجزه و چگونگی تبدیل این معجزه به کرامت برای کسی که معجزه برای او بوده است، به دلیل اختلاف حال.\n\nآنچه معجزه بود، راهی نیست *** تا ابد بار دیگر ظاهر شود\nنه در ولی و نه در غیر او؛ پس اگر *** سخن مرا محقق ساختی، از راه درست منحرف مشو\nو اگر خلقی با آن تحدی کند، *** صدق پیشینیان در نزدیک و دور او را تکذیب کند\nبه همین دلیل در میان پیامبران متفاوت بود و *** پس از آن اثری از آن در هیچ کس ظاهر نشد.\n\n[مردم در مورد اینکه آیا معجزه پیامبر می‌تواند کرامت ولی باشد یا خیر، اختلاف نظر دارند]\n\nمردم در مورد اینکه آیا آنچه معجزه پیامبر بوده است، می‌تواند کرامت ولی باشد یا خیر، اختلاف نظر دارند. جمهور این امر را جایز دانسته‌اند، مگر استاد ابواسحاق اسفرايینی که آن را منع کرده است. و این نظر نزد ما صحیح است، جز اینکه ما شرطی را اضافه می‌کنیم که استاد آن را ذکر نکرده است؛ و آن این است که بگوییم: مگر اینکه ولی آن امر معجز را برای تصدیق پیامبر انجام دهد، نه به عنوان کرامت برای خود. در این صورت، نزد ما واقع می‌شود و ما آن را شهود (شهود) کرده‌ایم. پس آنچه معجزه پیامبر بوده است، بر ولی ظاهر می‌شود، همان‌طور که گفتیم. و اگر استاد به این نکته توجه می‌کرد، آن را می‌پذیرفت و انکار نمی‌کرد، زیرا از باب خود خارج نشده است. زیرا آنچه مورد اختلاف واقع شده، این است که آیا آن امر کرامت ولی خواهد بود یا خیر؟ و این امر کرامت ولی نیست. مگر اینکه کسانی که آن را جایز دانسته‌اند، گفته‌اند به شرطی که به آن طریقی که بر دست رسول ظاهر شد و به واسطه آن معجزه نامیده شد، بر ولی ظاهر نشود. و جایز دانسته‌اند که اگر ولی با آن بر ولایت خود تحدی کند، جایز است که خداوند آن عادت را برای او بشکند. و اگر دروغگو با آن بر دروغ خود تحدی کند، در حالی که در دروغگو بودن خود صادق است، جایز است که خداوند آن عادت را به خاطر صدق او در دروغگو بودن بشکند. زیرا نزد آنان فرق‌گذاری حاصل است و این وجهی است که گفته می‌شود. و صحیح همان است که استاد به آن رفته است و این چیزی است که دلیل نظری آن را اقتضا می‌کند، مگر اینکه رسول در وقت تحدی خود، منع را به آن وقت خاص یا به مدت حیات خود خاص کند. در این صورت، جایز است که آن فعل پس از انقضای زمانی که شرط کرده بود، به عنوان کرامت برای غیر او واقع شود. اما اگر آن را مطلق بگذارد، راهی به آنچه استاد گفته است، نیست. و این تفصیلی که ذکر کردیم، دلیل نظری هر دو گروه آن را اقتضا می‌کند، با وجود اینکه ما ندیده‌ایم کسی در علم ما به این نکته توجه کرده باشد یا آن را ذکر کرده باشد. و خداوند داناتر است.\n\n[اعجاز بر دو گونه است]\n\nو اعجاز بر دو گونه است. گونه اول آن است که امری را بیاورد که در توان بشر نباشد و جز خداوند بر آن قادر نباشد. و این امر، یعنی رسیدن به علم آن، دشوار است؛ مانند زنده کردن مردگان که جز خداوند بر آن قادر نیست. اما رسیدن به علم اینکه آن مرده در واقع زنده است، دشوار است. زیرا ما دیدیم که عصای موسی (علیه السلام) زنده شد و عصاهای ساحران نیز زنده شدند، و عامه مردم بین این دو حیات تفاوتی قائل نشدند. به همین دلیل گفتیم که رسیدن به علم آن دشوار است. و گونه دیگر که ممکن است نزدیک‌تر باشد، «صرف» است. در این مورد ادعا می‌شود که آنچه در حالت عادی در توان شماست، اگر من آن را به دلیل صدق دعوای خود بیاورم، فرستنده من شما را از معارضه با آن باز می‌دارد و نمی‌توانید با آن مقابله کنید. پس هر کس که توانایی انجام آن را دارد، در آن زمان در خود عجز می‌یابد و نمی‌تواند آنچه را که قبل از این ادعا قادر به انجامش بود، بیاورد. و این از گونه اول ابهام کمتری دارد. این معنای امر معجز است. با این حال، این امر واقع شده و به عنوان معجزه شناخته شده است و علم به صدق این رسول نزد بیننده حاصل شده است. اما کسی که ایمان به او روزی‌اش نشده است، «و با آنکه در دل به آن یقین داشتند، از روی ستم و برتری‌جویی آن را انکار کردند» (وَجَحَدُوا بِها وَاسْتَيْقَنَتْها أَنْفُسُهُمْ ظُلْماً وَعُلُوًّا). پس بدان که ایمان را اقامه دلیل نمی‌دهد، بلکه نوری الهی است که خداوند در قلب هر کس از بندگانش که بخواهد می‌افکند. و گاهی ممکن است پس از دلیل باشد و گاهی اصلاً دلیلی در کار نباشد، چنانکه خداوند متعال فرموده است: «بلکه آن را نوری قرار دادیم که به وسیله آن هر کس از بندگانمان را که بخواهیم هدایت می‌کنیم» (وَلَكِنْ جَعَلْناهُ نُوراً نَهْدِي بِهِ مَنْ نَشاءُ مِنْ عِبادِنا). پس این را بدان، و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند.\n\nپایان جزء صد و شانزدهم.\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 2
}