{
  "id": 49,
  "title": {
    "ar": "الباب التاسع والأربعون في معرفة قوله صلى الله عليه وسلم إني لأجد نفس الرحمن من قبل اليمن‏",
    "en": "Chapter Forty-Nine: Concerning the Gnosis of his saying (peace and blessings be upon him), \"Indeed, I find the Breath of the All-Merciful (نفس الرحمن) from the direction of Yemen.\"",
    "ur": "باب انتالیسواں: نبی اکرم صلی اللہ علیہ وسلم کے اس قول کی معرفت (المعرفۃ) میں: \"إني لأجد نفس الرحمن من قبل اليمن\" (میں رحمن کی سانس (نفس الرحمن) کو یمن کی طرف سے پاتا ہوں)۔",
    "fa": "باب چهل و نهم در معرفت قول پیامبر (صلی الله علیه و سلم) که فرمود: «من نسیم (نفس) رحمان را از سوی یمن می‌یابم.»"
  },
  "content": {
    "ar": "## (الباب التاسع والأربعون) في معرفة قوله صلى الله عليه وسلم إني لأجد نفس الرحمن من قبل اليمن‏\n\n\nمعرفة هذا المنزل ورجاله (بسم الله الرحمن الرحيم)\n\n\n> نفس الرحمن ليس له *** في سوى الرحمن مستند\n\n\n> حكمه في كل طائفة *** ما لها ركن ولا سند\n\n\n> يمن الأكوان منزله *** وهو لا روح ولا جسد\n\n\n> ما له حد يعينه *** وهو المطلوب والصمد\n\n\n> فجميع الخلق يطلبه *** ثم لم يظفر به أحد\n> أحد ما مثله أحد *** بكمال النعت منفرد\n\n\n### [الإتيان إلهي والإتيان الإلهي الخاص‏]\n\n\nاعلم يا ولي أن لله عبادا من حيث اسمه الرحمن وهو قوله وعِبادُ الرَّحْمنِ الَّذِينَ يَمْشُونَ عَلَى الْأَرْضِ هَوْناً وإِذا خاطَبَهُمُ الْجاهِلُونَ قالُوا سَلاماً يقول تعالى يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً ولله عباد يأتي إليهم الرحمن من اسمه الرب فإن الله يقول قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏ فكماله من الاسم الله الأسماء الحسنى كذلك له من الاسم الرحمن الأسماء الحسنى‏\n\n\nقال رسول الله صلى الله عليه وسلم ينزل ربنا إلى السماء الدنيا\n\n\nوقال وجاءَ رَبُّكَ فثم إتيان عام مثل هذا وهو الإتيان للفصل والقضاء وثم إتيان خاص بالرحمة لمن اعتنى به من عباده‏\n\n\nقال رسول الله صلى الله عليه وسلم لما اشتد كربه من المنازعين إني لأجد نفس الرحمن من قبل اليمن‏\n\n\nوهو ما مشى إلى اليمن لكن النفس أدركه من قبل اليمن وما أدركه حتى أتاه فجاء بالتنفيس من الشدة والضيق الذي كان فيه بالأنصار رضي الله عن جميعهم فتقدم إليه النفس في باطنه وقلبه مبشرا بما يظهره الله من نصرة الدين وإقامته على أيدي الأنصار\n\n\n### [ابن عربي بدمشق وحديث الأنصار]\n\n\nولقد جرى لنا في حديث الأنصار ما نذكره إن شاء الله وذلك أنه عندنا بدمشق رجل من أهل الفضل والأدب والدين يقال له يحيى بن الأخفش من أهل مراكش كان أبوه يدرس العربية بها فكتب إلي يوما من منزله بدمشق وأنا بها يقول لي في كتابه يا ولي رأيت رسول الله صلى الله عليه وسلم البارحة بجامع دمشق وقد نزل بمقصورة الخطابة إلى جانب خزانه المصحف المنسوب إلى عثمان رضي الله عنه والناس يهرعون إليه ويدخلون عليه يبايعونه فبقيت واقفا حتى خف الناس فدخلت عليه وأخذت يده فقال لي هل تعرف محمدا قلت له يا رسول الله من محمد فقال له ابن العربي قال فقلت له نعم أعرفه فقال له رسول الله صلى الله عليه وسلم إنا قد أمرناه بأمر فقل له يقول لك رسول الله انهض لما أمرت به واصحبه أنت فإنك تنتفع بصحبته وقل له يقول لك رسول الله امتدح الأنصار ولتعين منهم سعد بن عبادة ولا بد ثم استدعى بحسان بن ثابت فقال له رسول الله صلى الله عليه وسلم يا حسان حفظه بيتا يوصله إلى محمد بن العربي يبني عليه وينسج على منواله في العروض والروي فقال حسان يا يحيى خذ إليك وأنشدني بيتا وهو\n\n\n> شغف السهاد بمقلتي ومزاري *** فعلى الدموع معولي ومشاري‏\n\n\nوما زال يردده علي حتى حفظته ثم قال لي رسول الله صلى الله عليه وسلم إذا مدح الأنصار فاكتبه بخط بين واحمله ليلة الخميس إلى تربة هذا الذي تسمونها قبر الست فستجد عندها شخصا اسمه حامد فادفع إليه المديح فلما أخبرني بذلك هذا الرائي وفقه الله عملت القصيدة من وقتي من غير فكرة ولا روية ولا تثبط ودفعت القصيدة إليه فكتب إلى أنه لما جاء قبر الست وصل إليه بعد العشاء الآخرة قال فرأيت رجلا عند القبر فقال لي ابتداء أنت يحيى الذي جاء من عند فلان وسماني قال فقلت له نعم قال فأين القصيد الذي مدح به الأنصار عن أمر رسول الله صلى الله عليه وسلم فقلت هو ذا عندي فناولته إياه فقرب من الشمعة ليقرأ القصيدة فلم أره يخبر ذلك الخط فقلت له تأمرني أنشدك إياها قال نعم فأنشدته إياها وهذا نص القصيدة\n\n\n> قال ابن ثابت الذي فخرت به *** فقر الكلام ونشأة الأشعار\n\n\n> شغف السهاد بمقلتي ومزاري *** فعلى الدموع معولي ومشاري‏\n\n\nوكانت أمي تنسب إلى الأنصار فقلت‏\n\n\n> فلذا جعلت رويه الراء التي *** هي من حروف الرد والتكرار\n\n\n> فأقول مبتدئا لطاعة أحمد *** في مدح قوم سادة أبرار\n\n\n> إني امرؤ من جملة الأنصار *** فإذا مدحتهمو مدحت نجاري‏\n\n\n> بسيوفهم قام الهدى وبهم علت *** أنواره في رأس كل منار\n\n\n> قاموا بنصر الهاشمي محمد *** المصطفى المختار من مختار\n\n\n> صحبوا النبي بنية وعزائم *** فازوا بهن حميدة الآثار\n> باعوا نفوسهمو لنصرة دينه *** ولذاك ما صحبوه بالإيثار\n\n\n> عنهم كنى المختار بالنفس الذي *** يأتيه من يمن مع الأقدار\n\n\n> سعد سليل عبادة فخرت به *** يوم السقيفة جملة الأنصار\n\n\n> لله آساد لكل كريهة *** نزلت بدين الله والأخيار\n\n\n> عزوا بدين الله في إعزازهم *** دين الهدى بالعسكر الجرار\n\n\n> فيهم علا يوم القيامة مشهدي *** وبهم ترى يوم الورود فخاري‏\n\n\n> لو أنني صغت الكلام قلائدا *** في مدحهم ما كنت بالمكثار\n\n\n> كرش النبي وعيبة لرسوله *** لحقت بهم أعداؤه بتبار\n\n\n> رهبان ليلا يقرءون كلامه *** آساد غاب في الوغى بنهار\n\n\nوقصة الرؤيا طويلة فاقتصرت من ذلك على ما نحتاج إليه في هذا الباب من ذكر الأنصار\n\n\n### [الأنصار، مع المهاجرين، عون النبي على إقامة دين الله‏]\n\n\nثم نرجع فنقول فما جاءت الأنصار إلا بعد أن نفس الله عن نبيه بما بشره به فلقيته الأنصار في حال اتساع وانشراح وسرور وتلقاها صلى الله عليه وسلم تلقي الغني بربه فكان معها والمهاجرين عونا على إقامة دين الله كما أمرهم الله قال الله عز وجل والله يَقْبِضُ ويَبْصُطُ فلله الأسماء الحسنى ولها آثار وتحكم في خلقه وهي المتوجهة من الله تعالى على إيجاد الممكنات وما تحوي عليه من المعاني التي لا نهاية لها\n\n\n### [الجن، مع الإنس، خلقوا للعبادة]\n\n\nوالله من حيث ذاته غني عن العالمين وإنما عرفنا الله تعالى أنه غَنِيٌّ عَنِ الْعالَمِينَ ليعلمنا أنه سبحانه ما أوجدنا إلا لنا لا لنفسه وما خلقنا لعبادته إلا ليعود ثواب ذلك العمل وفضله إلينا ولذلك ما خص بهذا الخطاب إلا الثقلين فقال تعالى وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ ولا نشك أن كل ما خلق من الملائكة وغيرهم من العالم ما خلقهم إلا مسبحين بحمده وما خص بهذه الصفة غير الثقلين أعني صفة العبادة وهي الذلة فما خلقهم حين خلقهم إذ لا وإنما خلقهم ليذلوا وخلق ما سواهم إذ لا في أصل خلقهم فما جعل العلة في سوى الثقلين الذلة كما جعلها فينا\n\n\n### [الملائكة لا يعصون الله ما أمرهم ويفعلون ما يؤمرون‏]\n\n\nوذلك أنه ما تكبر أحد من خلق الله على أمر الله غير الثقلين ولا عصى الله أحد من خلق الله سوى الثقلين فأمر إبليس فعصى ونهى آدم عليه السلام أن يقرب الشجرة فكان من أمره ما قال الله لنا في كتابه وعَصى‏ آدَمُ رَبَّهُ وأما الملائكة فقد شهد لهم الله بأنهم لا يَعْصُونَ الله ما أَمَرَهُمْ ويَفْعَلُونَ ما يُؤْمَرُونَ ردا على من تكلم بما لا ينبغي في حق الملكين ببابل من المفسرين بما لا يليق بهم ولا يعطيه ظاهر الآية لكن الإنسان يجترئ على الله تعالى فيقول فيه ما لا يليق بجلاله فكيف لا يقول في الملائكة فكما كذب الإنسان ربه في أمور فيكون هذا القائل قد كذب ربه في قوله في حق الملائكة لا يَعْصُونَ الله ما أَمَرَهُمْ وفي صحيح الخبر عن رسول الله صلى الله عليه وسلم عن الله عز وجل يقول الله عز وجل كذبني ابن آدم ولم يكن ينبغي له ذلك وشتمني ابن آدم ولم يكن ينبغي له ذلك‏\n\n\nفلا أحد أصبر على أذى من الله كذا ورد أيضا في الخبر\n\n\nوهو سبحانه يرزقهم ويحسن إليهم وهم في حقه بهذه الصفة\n\n\n### [السبب الموجب لتكبر الثقلين دون سائر الموجودات‏]\n\n\nفاعلم إن السبب الموجب لتكبر الثقلين دون سائر الموجودات إن سائر المخلوقات توجه على إيجادهم من الأسماء الإلهية أسماء الجبروت والكبرياء والعظمة والقهر والعزة فخرجوا أذلاء تحت هذا القهر الإلهي وتعرف إليهم حين أوجدهم بهذه الأسماء فلم يتمكن لمن خلق بهذه المثابة أن يرفع رأسه ولا إن يجد في نفسه طعما للكبرياء على أحد من خلق الله فكيف على من خلقه وقد أشهده أنه في قبضته وتحت قهره وشهدوا كشفا نواصبهم ونواصي كل دابة بيده في القرآن العزيز ما من دَابَّةٍ إِلَّا هُوَ آخِذٌ بِناصِيَتِها ثم قال متمما إِنَّ رَبِّي عَلى‏ صِراطٍ مُسْتَقِيمٍ والأخذ بالناصية عند العرب إذلال هذا هو المقرر عرفا عندنا فمن كان حاله في شهود نظره إلى ربه أخذ النواصي بيده ويرى ناصيته من جملة النواصي كيف يتصور منه عز أو كبرياء على خالقه مع هذا الكشف وأما الثقلان فخلقهم بأسماء اللطف والحنان والرأفة والرحمة والتنزل الإلهي فعند ما خرجوا لم يروا عظمة ولا عزا ولا كبرياء ورأوا نفوسهم مستندة في وجودها إلى رحمة وعطف وتنزل ولم يبد الله لهم من جلاله ولا كبريائه ولا عظمته في خروجهم إلى الدنيا شيئا يشغلهم عن نفوسهم أ لا تراهم في الأخذ الذي عرض لهم‏\nمن ظهورهم حين قال لهم أَ لَسْتُ بِرَبِّكُمْ هل قال أحد منهم نعم لا والله بل قالُوا بَلى‏ فأقروا له بالربوبية لأنهم في قبضة الآخذ محصورون فلو شهدوا أن نواصيهم بيد الله شهادة عين أو إيمان كشهادة عين كشهادة الأخذ ما عصوا الله طرفة عين وكانوا مثل سائر المخلوقات يُسَبِّحُونَ اللَّيْلَ والنَّهارَ لا يَفْتُرُونَ فلما ظهروا عن هذه الأسماء الرحمانية قالوا يا ربنا لم خلقتنا قال لتعبدون أي لتكونوا أذلاء بين يدي فلم يروا صفة قهر ولا جناب عزة تذلهم ولا سيما وقد قال لهم لتذلوا إلي فأضاف فعل الإذلال إليهم فزادوا بذلك كبرا فلو قال لهم ما خلقتكم إلا لأذلكم لفرقوا وخافوا فإنها كلمة قهر فكانوا يبادرون إلى الذلة من نفوسهم خوفا من هذه الكلمة كما قال للسماوات والأرض ائْتِيا طَوْعاً أَوْ كَرْهاً فلو لم يقل كرها فإنها كلمة قهر حيثما أتت فلهذا قلنا ما أوجد كل ما عدا الثقلين ولا خاطبهم إلا بصفة القهر والجبروت فلما قال للثقلين عن السبب الذي لأجله أوجدهم وخلقهم نظروا إلى الأسماء التي وجدوا عنها فما رأوا اسما إلهيا منها يقتضي أخذهم وعقوبتهم إن عصوا أمره ونهيه وتكبروا على أمره فلم يطيعوه وعصوه ف عَصى‏ آدَمُ رَبَّهُ وهو أول الناس وعصى إبليس ربه فسرت المخالفة من هذين الأصلين في جميع الثقلين يقول النبي صلى الله عليه وسلم عن آدم لما جحد ونسي ما وهبه لداود من عمره فنسي آدم فنسيت ذريته وجحد آدم فجحدت ذريته إِلَّا من رَحِمَ رَبُّكَ فعصمه ولكن من التكبر على الله لا من تكبر بعضهم على بعض وعلى سائر المخلوقين فما عصم أحد من ذلك ابتداء فإن الله قد شاء أن يتخذ بَعْضُهُمْ بَعْضاً سُخْرِيًّا ولكن إذا اعتنى الله بعبده ففي الحالة الثانية يرزقه التوفيق والعناية فيلزم ما خلق له من العبادة فيلحق بسائر المخلوقات وهو عزيز الوجود وأين العبد الذي هو في نفسه مع أنفاسه عبد لله دائما فلا يدل أحد من الثقلين إلا عن قهر يجده فهو في ذله مجبور فإذا وجد ذلك حينئذ يلتفت إلى الأسماء التي عنها وجد وهي أسماء الرحمة فيطلبها لتزيل عنه ما هو فيه من الضيق والحرج الذي ما اعتاده فيحن إلى جهتها ويعرف أن لها قوة وسلطانا فتنفس عنه ما يجده من ذلك‏\n\n\n### [نفس الرحمن من قبل اليمن‏]\n\n\nقال رسول الله صلى الله عليه وسلم إن نفس الرحمن فأشار إلى الاسم الذي خلق به الثقلين وقرن معه جهة القوة فقال من قبل اليمن والقبل الناحية والجهة واليمن من اليمين وهو القوة قال الشاعر\n\n\n> إذا ما راية رفعت لمجد *** تلقاها عرابة باليمين‏\n\n\nأراد بالقوة فإن اليمين محل القوة والسَّماواتُ مَطْوِيَّاتٌ بِيَمِينِهِ وكذلك كان لما نظر إليه الاسم الرحمن الذي عنه وجد كان النصر على أيدي الأنصار\n\n\n### [رحمة الله سبقت غضبه‏]\n\n\nوكذلك قوله يَوْمَ نَحْشُرُ الْمُتَّقِينَ فإن المتقي هو الحذر الخائف الوجل ولا يكون أحد يشهد الرحمن الرحيم الرءوف ويتقيه وإنما مشهود المتقي السريع الحساب الشديد العقاب المتكبر الجبار فيتقي ويخاف فيؤمنه الله تعالى بأن يحشره إلى الرحمن فيأمن سطوة الجبار القهار ولهذا\n\n\nقال تعالى فينا إن رحمته سبقت غضبه‏\n\n\nلأنه بالرحمة أوجدنا لم يوجدنا بصفة القهر وكذلك تأخرت المعصية فتأخر الغضب عن الرحمة في الثقلين فالله يجعل حكمهما في الآخرة كذلك ولو كانت بعد حين أ لا ترى الله تعالى إذا ذكر أسماءه لنا يبتدئ بأسماء الرحمة ويؤخر أسماء الكبرياء لأنا لا نعرفها فإذا قدم لنا أسماء الرحمة عرفناها وحننا إليها عند ذلك يتبعها أسماء الكبرياء لنأخذها بحكم التبعية فقال تعالى هُوَ الله الَّذِي لا إِلهَ إِلَّا هُوَ عالِمُ الْغَيْبِ والشَّهادَةِ فهذا نعت يعم الجميع وليس واحدته بأولى من الآخر ثم ابتدأ فقال هُوَ الرَّحْمنُ فعرفنا الرحمن الرَّحِيمُ لأنا عنه وجدنا ثم قال بعد ذلك هُوَ الله الَّذِي لا إِلهَ إِلَّا هُوَ ابتداء ليجعله فصلا بين الرَّحْمنُ الرَّحِيمُ وبين الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ فقال الْمَلِكُ الْقُدُّوسُ السَّلامُ الْمُؤْمِنُ وهذا كله من نعوت الرحمن ثم جاء وقال الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ فقبلنا هذه النعوت بعد أن آنسنا بأسماء اللطف والحنان وأسماء الاشتراك التي لها وجه إلى الرحمة ووجه إلى الكبرياء وهو الله والملك فلما جاء بأسماء العظمة والمحل قد تأنس بترادف الأسماء الكثيرة الموجبة الرحمة قبلنا أسماء العظمة لما رأينا أسماء الرحمة قد قبلتها حيث كانت نعوتا لها فقبلناها ضمنا تبعا لأسمائنا ثم إنه لما علم الخلق أن صاحب القلب والعلم بالله وبمواقع خطابه إذا سمع مثل أسماء العظمة لا بد أن تؤثر فيه أثر خوف وقبض نعتها بعد ذلك وأردفها بأسماء لا تختص بالرحمة على الإطلاق ولا تعرى عن العظمة على الإطلاق فقال هُوَ الله الْخالِقُ الْبارِئُ الْمُصَوِّرُ لَهُ الْأَسْماءُ الْحُسْنى‏ وهذا كله تعليم من الله عباده وتنزل إليهم‏\n\n\n### [بسملة النمل السليمانية تكميل لسورة التوبة]\n\n\nفمنازل أصحاب هذا الباب هي هذه الأسماء المذكورة وحضراتها ولهذا قدم‏\nسبحانه في كتابه بِسْمِ الله الرَّحْمنِ الرَّحِيمِ في كل سورة إذ كانت السور تحوي على أمور مخوفة تطلب أسماء العظمة والاقتدار فقدم أسماء الرحمة تأنيسا وبشرى ولهذا قالوا في سورة التوبة إنها والأنفال سورة واحدة حيث لم يفصل بينهما بالبسملة وفي ذلك خلاف منقول بين علماء هذا الشأن من الصحابة ولما علم الله تعالى ما يجري من الخلاف في هذه الأمة في حذف البسملة من سورة براءة فمن ذهب إلى أنها سورة مستقلة وكان القرآن عنده مائة وثلاث عشرة سورة فيحتاج إلى مائة وثلاث عشرة بسملة أظهر لهم في سورة النمل بسملة ليكمل العدد وجاء بها كما جاء بها في أوائل السور بعينها فإن لغة سليمان عليه السلام لم تكن عربية وإنما كانت أخرى فما كتب لغة هذا اللفظ في كتابه وإنما كتب لفظة بلغته تقتضي معناها باللسان العربي إذا عبر عنها بِسْمِ الله الرَّحْمنِ الرَّحِيمِ 27 وأتى بها محذوفة الألف كما جاءت في أوائل السور ليعلم أن المقصود بها هو المقصود بها في أوائل السور ولم يعمل ذلك في بِسْمِ الله مَجْراها واقْرَأْ بِاسْمِ رَبِّكَ فأثبت الألف هناك ليفرق ما بين اسم البسملة وغيرها\n\n\n### [سورة التوبة هي سورة الرحمة]\n\n\nولهذا تتضمن سورة التوبة من صفات الرحمة والتنزل الإلهي كثيرا فإن فيها شراء الله نفوس المؤمنين منهم بِأَنَّ لَهُمُ الْجَنَّةَ وأي تنزل أعظم من أن يشتري السيد ملكه من عبده وهل يكون في الرحمة أبلغ من هذا فلا بد أن تكون التوبة والأنفال سورة واحدة أو تكون بسملة النمل السليمانية لسورة التوبة ثم انظر في اسمها سورة التوبة والتوبة تطلب الرحمة ما تطلب التبري وإن ابتدأ عز وجل بالتبري فقد ختم بآية لم يأت بها ولا وجدت إلا عند من جعل الله شهادته شهادة رجلين فإن كنت تعقل علمت ما في هذه السورة من الرحمة المدرجة ولا سيما في قوله تعالى ومِنْهُمْ ومِنْهُمْ وذلك كله رحمة بنا لنحذر الوقوع فيه والاتصاف بتلك الصفات فإن القرآن علينا نزل فلم تتضمن سورة من القرآن في حقنا رحمة أعظم من هذه السورة لأنه كثر من الأمور التي ينبغي أن يتقيها المؤمن ويجتنبها فلو لم يعرفنا الحق تعالى بها ربما وقعنا فيها ولا نشعر فهي سورة رحمة للمؤمنين‏\n\n\n### [رجال نفس الرحمن‏]\n\n\nوإذ وقد عرفناك بمنازله فاعلم أن رجاله هم كل من كان حاله من أهل الله حال من أحاطت به الأسماء الجبروتية من جميع عالمه العلوي والسفلي فيقع منه اللجأ والتضرع إلى أسماء الرحمة فيتجلى له الاسم الرحمن الذي له الأسماء الحسنى والذي به على العرش استوى فيهبه الاقتدار الإلهي فيمحو به آثار الأسماء القهرية فيتسع له المجال فينشرح الصدر ويجري النفس ويسرى فيه روح الحياة وتأتي إليه وفود الأسماء الرحمانية والحقائق الإلهية بالتهاني والبشائر فمن كانت هذه حالته ويعرفها ذوقا من نفسه وهو من رجال هذا المقام فلا يغالط نفسه وكل إنسان أعلم بحاله ولا ينفعك أن تنزل نفسك عند الناس منزلة ليست لك في نفس الأمر وقد نصحتك وأبنت لك عن طريق القوم فلا تكن من الجاهلين بما عرفناك به واعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ ف إِنَّ الله لا يَخْفى‏ عَلَيْهِ شَيْ‏ءٌ في الْأَرْضِ ولا في السَّماءِ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## (Chapter Forty-Nine) Concerning the knowledge of his saying, peace and blessings be upon him: \"I find the Breath of the All-Merciful coming from the direction of Yemen.\"\n\nKnowledge of this Station and its People (In the Name of Allah, the All-Merciful, the Especially Merciful).\n\n> The Breath of the All-Merciful (نفس الرحمن) has no support,\n> Except in the All-Merciful Himself.\n> Its ruling upon every group,\n> Is that they have neither pillar nor support.\n> The strength (Yumn) of the cosmos is its station,\n> Yet it is neither spirit nor body.\n> It has no limit to define it,\n> Yet it is the Sought and the Eternal Refuge (al-Ṣamad).\n> All creation seeks it,\n> Yet none has attained it.\n> The One (Aḥad), nothing is like Him, the One,\n> Singular in the perfection of description.\n\n### [The Divine Approach and the Specific Divine Approach]\n\nKnow, O friend (wali), that Allah has servants by virtue of His Name, the All-Merciful (al-Raḥmān), which is His saying: <<وَعِبَادُ الرَّحْمَنِ الَّذِينَ يَمْشُونَ عَلَى الْأَرْضِ هَوْنًا وَإِذَا خَاطَبَهُمُ الْجَاهِلُونَ قَالُوا سَلَامًا>> (And the servants of the All-Merciful are those who walk upon the earth humbly, and when the ignorant address them, they say, \"Peace\"). The Exalted says: <<يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمَنِ وَفْدًا>> (The Day We will gather the righteous to the All-Merciful as a delegation). And Allah has servants to whom the All-Merciful approaches (ya’tī) from His Name, the Lord (al-Rabb), for Allah says: <<قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَّا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَىٰ>> (Say, \"Call upon Allah or call upon the All-Merciful. Whichever you call—to Him belong the Most Beautiful Names\"). Just as His perfection derives the Beautiful Names (الأسماء الحسنى) from the Name Allah, so too does He derive the Beautiful Names from the Name the All-Merciful (الرحمن).\n\nThe Messenger of Allah, peace and blessings be upon him, said: \"Our Lord descends to the lowest heaven.\"\n\nAnd He said: <<وَجَاءَ رَبُّكَ>> (And your Lord has come). Thus, there is a general approach (إتيان عام) like this, which is the approach for separation and judgment, and there is a specific approach (إتيان خاص) characterized by mercy for those of His servants whom He favors.\n\nThe Messenger of Allah, peace and blessings be upon him, said when his distress intensified due to the disputants: \"I find the Breath of the All-Merciful (نفس الرحمن) coming from the direction of Yemen.\"\n\nHe did not travel to Yemen, but the Breath (النفس) reached him from the direction of Yemen. It did not reach him until it came to him, bringing relief (التنفيس) from the severity and constriction he was experiencing due to the Helpers (الأنصار)—may Allah be pleased with all of them. Thus, the Breath advanced to him in his inner being and his heart, bringing glad tidings of the victory of the Religion and its establishment that Allah would manifest through the hands of the Helpers.\n\n### [Ibn Arabi in Damascus and the Account of the Helpers]\n\nAnd indeed, an event concerning the Helpers (الأنصار) occurred to us, which we shall mention, if Allah wills. This is that we had in Damascus a man of virtue, literature, and piety named Yahya ibn al-Akhfash, originally from Marrakesh, whose father used to teach Arabic there. One day, he wrote to me from his house in Damascus, where I also was, saying in his letter: \"O friend (wali), I saw the Messenger of Allah, peace and blessings be upon him, last night in the Umayyad Mosque of Damascus. He had descended to the pulpit enclosure next to the cabinet containing the copy of the Qur’an attributed to Uthman, may Allah be pleased with him. People were rushing to him and entering to pledge allegiance to him. I remained standing until the crowd thinned, then I entered and took his hand. He asked me, 'Do you know Muhammad?' I replied, 'O Messenger of Allah, who is Muhammad?' He said, 'Ibn al-Arabi.' I said, 'Yes, I know him.' The Messenger of Allah, peace and blessings be upon him, then said to him, 'We have commanded him with a matter. Tell him that the Messenger of Allah says: Arise for what you have been commanded, and accompany him, for you will benefit from his companionship. And tell him that the Messenger of Allah says: Praise the Helpers (الأنصار), and you must specifically mention Sa'd ibn Ubadah among them.' Then he summoned Hassan ibn Thabit and the Messenger of Allah, peace and blessings be upon him, said to him, 'O Hassan, memorize a verse for him to deliver to Muhammad ibn al-Arabi, upon which he should build and weave according to its meter and rhyme (العروض والروي).' Hassan said, 'O Yahya, take this,' and recited a verse to me, which was:\n\n> Sleeplessness has captivated my eye and my visitation,\n> So upon tears is my reliance and my path.\n\nHe kept repeating it to me until I memorized it. Then the Messenger of Allah, peace and blessings be upon him, said to me, 'When he praises the Helpers, let him write it in clear script and carry it on Thursday night to the tomb you call the grave of the Lady (Qabr al-Sitt). He will find a person named Hamid there, and he should hand the eulogy to him.'\"\n\nWhen this visionary, may Allah grant him success, informed me of this, I composed the ode immediately, without reflection, deliberation, or hesitation. I handed the ode to him. He wrote back to me saying that when he arrived at the grave of the Lady after the last evening prayer ('Ishā'), he saw a man by the grave. The man immediately said to him, \"Are you Yahya, who came from so-and-so?\"—naming me. I replied, \"Yes.\" He said, \"Where is the ode praising the Helpers by command of the Messenger of Allah, peace and blessings be upon him?\" I said, \"It is here with me,\" and handed it to him. He approached the candle to read the ode, but I saw that he could not make out the handwriting. So I said to him, \"Shall I recite it to you?\" He said, \"Yes.\" So I recited it to him. This is the text of the ode:\n\n> Ibn Thabit, of whom I boast, said,\n> The poverty of speech and the genesis of poems:\n> Sleeplessness has captivated my eye and my visitation,\n> So upon tears is my reliance and my path.\n\nSince my mother was related to the Helpers, I said:\n\n> Therefore, I made its rhyme the letter Raa (الراء),\n> Which is among the letters of return and repetition.\n> So I begin, in obedience to Ahmad,\n> In praise of a people who are noble, righteous masters:\n> I am a man from the company of the Helpers,\n> So when I praise them, I praise my own lineage.\n> By their swords, guidance was established, and by them ascended,\n> Its lights upon the top of every minaret.\n> They rose to aid the Hashimite Muhammad,\n> The Chosen, the Select of the Select.\n> They accompanied the Prophet with intention and resolve,\n> By which they attained praiseworthy results.\n> They sold their souls for the support of His religion,\n> And thus they accompanied Him with altruism (īthār).\n> The Chosen One alluded to them by the Breath (Nafs),\n> Which comes to him from Yemen, accompanied by the Divine Decrees (al-Aqdār).\n> Sa'd, the descendant of Ubadah, was boasted of,\n> By the entire company of the Helpers on the Day of Saqifah.\n> They are lions of Allah against every calamity,\n> That descended upon the Religion of Allah and the righteous.\n> They gained might through the Religion of Allah in their strengthening,\n> The Religion of Guidance with the mighty army.\n> In them my witnessing (mashhadī) is exalted on the Day of Resurrection,\n> And by them you shall see my pride on the Day of Arrival (al-Wurūd).\n> Even if I fashioned words into necklaces,\n> In their praise, I would not be excessive.\n> They are the Prophet's family and the repository for his Messenger,\n> By them, his enemies met destruction.\n> Monks by night, reciting His word,\n> Lions of the thicket in battle by day.\n\nThe story of the vision is long, so I have limited it to what we need for this chapter concerning the mention of the Helpers.\n\n### [The Helpers, along with the Emigrants, Aided the Prophet in Establishing the Religion of Allah]\n\nWe return now and say: The Helpers (الأنصار) did not come until after Allah had brought relief (naffasa) to His Prophet through the glad tidings He gave him. The Helpers met him in a state of expansion, joy, and serenity, and he, peace and blessings be upon him, received them with the reception of one who is rich through his Lord. Thus, he and the Emigrants (المهاجرين) were an aid in establishing the Religion of Allah, as Allah commanded them. The Mighty and Majestic Allah says: <<وَاللَّهُ يَقْبِضُ وَيَبْسُطُ>> (And Allah contracts and expands). To Allah belong the Beautiful Names (الأسماء الحسنى), and they have effects and exert governance over His creation. They are the Names directed by the Exalted Allah toward the creation of possibilities (الممكنات) and all the endless meanings they encompass.\n\n### [The Jinn, along with Humans, Were Created for Worship]\n\nAllah, in terms of His Essence (الذات), is independent of the worlds (غَنِيٌّ عَنِ الْعَالَمِينَ). We only know Allah, the Exalted, as being <<غَنِيٌّ عَنِ الْعَالَمِينَ>> (Independent of the worlds) so that He may teach us that He, the Glorified, created us only for our own benefit, not for His own. He only created us for His worship so that the reward and merit of that action would return to us. For this reason, He singled out only the Two Weighty Ones (الثقلين)—jinn and mankind—with this address, saying: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except to worship Me). We do not doubt that everything created—including the angels and the rest of the cosmos (العالم)—was created only to glorify Him with His praise. But He did not single out any besides the Two Weighty Ones with this attribute, meaning the attribute of worship (العبادة), which is abasement (الذلة). He did not create them when He created them *as* abased; rather, He created them *to become* abased. He created everything else *as* abased in the origin of their creation. Thus, He did not make abasement the cause (العلة) for anything other than the Two Weighty Ones, as He made it the cause for us.\n\n### [The Angels Do Not Disobey Allah in What He Commands Them, and They Do What They Are Commanded]\n\nThis is because no one among Allah’s creation has shown arrogance (تكبر) toward Allah’s command except the Two Weighty Ones, and no one among Allah’s creation has disobeyed Allah except the Two Weighty Ones. He commanded Iblis, and he disobeyed. He forbade Adam, peace be upon him, from approaching the tree, and his affair was as Allah told us in His Book: <<وَعَصَىٰ آدَمُ رَبَّهُ>> (And Adam disobeyed his Lord). As for the angels, Allah testified concerning them that <<لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ>> (They do not disobey Allah in what He commands them but do what they are commanded). This is a refutation of those commentators who spoke inappropriately regarding the two angels in Babylon, attributing to them what is unfitting and not supported by the apparent meaning of the verse. However, humans dare to speak against Allah, the Exalted, saying things unfitting for His Majesty, so how could they not speak against the angels? Just as humans have lied against their Lord in certain matters, this speaker has lied against his Lord concerning His statement about the angels: <<لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ>> (They do not disobey Allah in what He commands them).\n\nIn the sound narration (صحيح الخبر) from the Messenger of Allah, peace and blessings be upon him, reporting from Allah, the Mighty and Majestic, Allah says: \"The son of Adam belied Me, and it was not proper for him to do so. And the son of Adam insulted Me, and it was not proper for him to do so.\"\n\nNo one is more patient concerning harm than Allah, as also mentioned in the narration.\n\nYet He, the Glorified, provides for them and is kind to them, even though they are characterized by this trait regarding Him.\n\n### [The Reason Necessitating the Arrogance of the Two Weighty Ones, Excluding All Other Existents]\n\nKnow that the reason necessitating the arrogance (تكبر) of the Two Weighty Ones, excluding all other existents, is that the creation of all other creatures was directed by the Divine Names of Majesty (Jabarūt), Grandeur (Kibriyā'), Might ('Aẓamah), Compulsion (Qahr), and Glory ('Izzah). Thus, they emerged abased (أذلاء) under this Divine Compulsion. When He brought them into existence, He introduced Himself to them through these Names. Therefore, it was impossible for those created in this manner to raise their heads or to find in themselves any taste of arrogance toward any of Allah’s creation, let alone toward their Creator, especially since He made them witness that they are in His grasp and under His compulsion. They witnessed, through unveiling (كشف), their forelocks and the forelocks of every creature being in His Hand, as stated in the Glorious Qur’an: <<مَا مِن دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا>> (There is no creature except that He holds it by its forelock). Then He completed the statement: <<إِنَّ رَبِّي عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ>> (Indeed, my Lord is on a straight path). Holding by the forelock (الأخذ بالناصية) among the Arabs is a sign of abasement (إذلال); this is the established custom for us. So, how can arrogance or pride toward his Creator be conceived of someone whose state, in his witnessed contemplation of his Lord, is that He holds the forelocks in His Hand, and who sees his own forelock as one of those forelocks, given this unveiling?\n\nAs for the Two Weighty Ones (Jinn and Humans), their creation was through the Names of Kindness (Luṭf), Tenderness (Ḥanān), Compassion (Ra’fah), Mercy (Raḥmah), and Divine Descent (التنزل الإلهي). When they emerged, they did not perceive Majesty, Glory, or Grandeur. They saw their souls relying for their existence upon mercy, affection, and descent. Allah did not reveal to them anything of His Majesty (Jalāl), Grandeur (Kibriyā'), or Might ('Aẓamah) during their emergence into the world that would distract them from their own selves.\n\nDo you not see them in the seizure (al-Akhdh) that occurred to them during their manifestation when He said to them: <<أَلَسْتُ بِرَبِّكُمْ>> (Am I not your Lord?)? Did any of them say, \"Yes, by Allah, no\"? Rather, <<قَالُوا بَلَىٰ>> (They said, \"Yes, indeed\"). Thus, they affirmed His Lordship because they were confined within the grasp of the Seizer (al-Ākhidh). If they had witnessed that their forelocks were in Allah’s Hand—a witnessing of the eye ('ayn) or a faith (īmān) like the witnessing of the eye, like the witnessing of the Seizure—they would not have disobeyed Allah for the blink of an eye. They would have been like the rest of creation, <<يُسَبِّحُونَ اللَّيْلَ وَالنَّهَارَ لَا يَفْتُرُونَ>> (Glorifying [Him] night and day, without tiring).\n\nWhen they manifested from these Names of the All-Merciful (الرحمانية), they said, \"O our Lord, why did You create us?\" He said, \"To worship Me,\" meaning: \"So that you may be abased before Me.\" But they did not perceive any attribute of Compulsion (Qahr) or any aspect of Glory ('Izzah) that would abase them, especially since He said to them, \"So that *you* may be abased before Me,\" attributing the act of abasement to *them*. This increased their arrogance. Had He said to them, \"I only created you so that *I* may abase you,\" they would have been terrified and afraid, for that is a word of compulsion. They would have hastened to abasement out of fear of that word, just as He said to the heavens and the earth: <<ائْتِيَا طَوْعًا أَوْ كَرْهًا>> (Come willingly or unwillingly). Had He not said \"unwillingly,\" it would still be a word of compulsion wherever it appears.\n\nThis is why we said that He did not bring into existence or address anything other than the Two Weighty Ones except with the attribute of Compulsion and Majesty (Qahr wa Jabarūt). But when He told the Two Weighty Ones the reason for which He brought them into existence and created them, they looked at the Names from which they originated. They did not see among those Divine Names any Name that necessitated their seizure or punishment if they disobeyed His command and prohibition and showed arrogance toward His command. So they did not obey Him and they disobeyed Him. <<وَعَصَىٰ آدَمُ رَبَّهُ>> (And Adam disobeyed his Lord), and he was the first of mankind, and Iblis disobeyed his Lord. The transgression spread from these two origins throughout all the Two Weighty Ones.\n\nThe Prophet, peace and blessings be upon him, said concerning Adam, when he denied and forgot what he had granted to David of his lifespan: \"Adam forgot, so his progeny forgot. Adam denied, so his progeny denied,\" <<إِلَّا مَن رَّحِمَ رَبُّكَ>> (Except those upon whom your Lord has mercy) and protected. But this protection is not from arrogance toward Allah; it is from arrogance of some of them toward others and toward the rest of creation. No one is protected from that initially, for Allah willed that <<بَعْضُهُمْ بَعْضًا سُخْرِيًّا>> (Some of them take others in subjection). However, if Allah favors His servant, in the second state, He grants him success (tawfīq) and care ('ināyah), so he adheres to the worship for which he was created, thus joining the rest of creation. Such a servant is rare in existence. Where is the servant who, in his very self and with his breaths, is perpetually a servant of Allah?\n\nNo one among the Two Weighty Ones submits (yadhill) except through a compulsion (qahr) that he experiences; thus, in his abasement, he is compelled (majbūr). When he experiences that, he then turns to the Names from which he originated—the Names of Mercy—and seeks them to remove the constriction and distress he is in, which he is unaccustomed to. He yearns toward their direction and recognizes that they possess power and authority, so they bring him relief (tunaffisu) from what he is experiencing.\n\n### [The Breath of the All-Merciful from the Direction of Yemen]\n\nThe Messenger of Allah, peace and blessings be upon him, said: \"Indeed, the Breath of the All-Merciful (نفس الرحمن).\" He pointed to the Name by which the Two Weighty Ones were created, and coupled it with the direction of strength, saying: \"from the direction (qibal) of Yemen.\" *Al-Qibal* means the side or direction. *Al-Yaman* (Yemen) is derived from *al-Yamīn* (the right hand), meaning strength. The poet said:\n\n> When a banner is raised for glory,\n> 'Urābah receives it with the right hand (al-Yamīn).\n\nHe meant strength, for the right hand is the locus of strength. And <<وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ>> (And the heavens will be folded in His right hand). Similarly, when the Name the All-Merciful (الرحمن), from which he originated, was contemplated, the victory came through the hands of the Helpers (الأنصار).\n\n### [Allah's Mercy Preceded His Wrath]\n\nLikewise, His saying: <<يَوْمَ نَحْشُرُ الْمُتَّقِينَ>> (The Day We will gather the righteous). The righteous (al-muttaqī) is the cautious, the fearful, the apprehensive. No one who witnesses the All-Merciful (al-Raḥmān), the Especially Merciful (al-Raḥīm), the Compassionate (al-Ra’ūf) would fear Him (yattaqīhi). Rather, the object of the righteous person's witnessing is the Swift in Account, the Severe in Punishment, the Grand (al-Mutakabbir), the Compeller (al-Jabbār). Thus, he is cautious and afraid. Allah then grants him security by gathering him to the All-Merciful (al-Raḥmān), so he is safe from the might of the Compeller and the Subduer (al-Qahhār).\n\nFor this reason, He said concerning us that His Mercy preceded His Wrath.\n\nBecause He brought us into existence through Mercy, not through the attribute of Compulsion (Qahr). Similarly, disobedience was delayed, so Wrath was delayed after Mercy in the case of the Two Weighty Ones. Allah makes their ruling in the Hereafter likewise, even if it is after a time.\n\nDo you not see that when Allah, the Exalted, mentions His Names to us, He begins with the Names of Mercy and delays the Names of Grandeur (Kibriyā')? This is because we do not know them. When He presents the Names of Mercy to us, we recognize them and yearn toward them. At that point, the Names of Grandeur follow, so that we may accept them by way of subordination.\n\nThus, He said: <<هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ>> (He is Allah, other than whom there is no deity, Knower of the unseen and the witnessed). This is an attribute that encompasses all, and His Oneness is not more primary than the other. Then He began by saying: <<هُوَ الرَّحْمَٰنُ>> (He is the All-Merciful), introducing us to the All-Merciful, <<الرَّحِيمُ>> (the Especially Merciful), because we originated from Him. Then, after that, He said: <<هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ>> (He is Allah, other than whom there is no deity), starting anew to make a separation between the All-Merciful, the Especially Merciful, and the Mighty (al-'Azīz), the Compeller (al-Jabbār), the Grand (al-Mutakabbir). He said: <<الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ>> (The Sovereign, the Holy, the Source of Peace, the Giver of Security). All of this is from the attributes of the All-Merciful. Then He came and said: <<الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ>> (The Mighty, the Compeller, the Grand). We accepted these attributes after He had made us familiar with the Names of Kindness and Tenderness, and the Names of shared meaning which have one face toward Mercy and one face toward Grandeur, namely Allah and the Sovereign (al-Malik). When He presented the Names of Might, the context had already been made familiar by the succession of many Names necessitating Mercy. We accepted the Names of Might because we saw that the Names of Mercy had accepted them, as they were attributes for them. Thus, we accepted them implicitly, following our own Names.\n\nFurthermore, when the creation knew that the person of spiritual heart and knowledge of Allah and the contexts of His address, upon hearing Names of Might, must inevitably be affected by fear and contraction (qabḍ), He subsequently described them and followed them with Names that are neither exclusively Mercy nor entirely devoid of Might. He said: <<هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ>> (He is Allah, the Creator, the Inventor, the Fashioner; to Him belong the Beautiful Names). All of this is instruction from Allah to His servants and a descent (tanazzul) toward them.\n\n### [The Basmala of Sulayman in Surah al-Naml Completes Surah al-Tawbah]\n\nThe stations (manāzil) of the people of this chapter are these mentioned Names and their Presences (الحضرات). For this reason, the Glorified preceded every Surah in His Book with <<بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ>> (In the Name of Allah, the All-Merciful, the Especially Merciful), since the Surahs contain fearful matters that demand the Names of Might and Power. He presented the Names of Mercy first for familiarity and glad tidings.\n\nFor this reason, they said concerning Surah al-Tawbah (Repentance) and al-Anfāl (The Spoils) that they are a single Surah, as they are not separated by the Basmala. There is a reported difference of opinion on this matter among the scholars of this science (ahl al-sha’n) among the Companions.\n\nWhen Allah, the Exalted, knew the difference of opinion that would arise in this Community regarding the omission of the Basmala from Surah Barā’ah (al-Tawbah)—for whoever held that it was an independent Surah and thus the Qur’an had one hundred and thirteen Surahs would require one hundred and thirteen Basmalas—He manifested the Basmala for them in Surah al-Naml (The Ants) to complete the number. He brought it exactly as it appears at the beginning of the Surahs. The language of Sulayman, peace be upon him, was not Arabic; it was another language. He did not write the Arabic wording of this phrase in his letter; rather, he wrote a phrase in his own language whose meaning, when expressed in the Arabic tongue, is <<بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ>> (In the Name of Allah, the All-Merciful, the Especially Merciful). He brought it with the omission of the *alif* (Bism), just as it appears at the beginning of the Surahs, to indicate that the intention behind it is the same as the intention behind it at the beginning of the Surahs. He did not do this in <<بِسْمِ اللَّهِ مَجْرَاهَا>> (In the name of Allah is its course) or <<اقْرَأْ بِاسْمِ رَبِّكَ>> (Recite in the name of your Lord), where the *alif* is affirmed, in order to differentiate between the name of the Basmala and others.\n\n### [Surah al-Tawbah is the Surah of Mercy]\n\nFor this reason, Surah al-Tawbah contains many attributes of Mercy and Divine Descent (التنزل الإلهي). In it is Allah’s purchase of the souls of the believers from them <<بِأَنَّ لَهُمُ الْجَنَّةَ>> (in exchange for that they will have Paradise). What descent is greater than the Master purchasing His own possession from His servant? Can there be anything more eloquent in Mercy than this? Therefore, al-Tawbah and al-Anfāl must be a single Surah, or the Basmala of Sulayman in al-Naml must belong to Surah al-Tawbah.\n\nFurthermore, look at its name: Surah al-Tawbah (Repentance). Repentance seeks Mercy; it does not seek disavowal. Even though the Mighty and Majestic began with disavowal, He concluded with a verse that has not come, nor is it found, except with the one whose testimony Allah made equal to the testimony of two men. If you understand, you will know the Mercy contained within this Surah, especially in His saying: <<وَمِنْهُمْ>> (And among them...) and <<وَمِنْهُمْ>> (And among them...). All of that is Mercy toward us, so that we may beware of falling into those states and being characterized by those attributes, for the Qur’an was revealed for us. No Surah in the Qur’an contains greater Mercy concerning us than this Surah, because it enumerates many matters that the believer ought to fear and avoid. Had the Real (الحق), the Exalted, not informed us of them, we might have fallen into them without realizing it. Thus, it is a Surah of Mercy for the believers.\n\n### [The People of the Breath of the All-Merciful]\n\nNow that we have informed you of its stations (manāzil), know that its people (رجال) are all those whose spiritual state (ḥāl) among the people of Allah is that of one surrounded by the Names of Majesty (الجبروتية) from all his upper and lower worlds. He then resorts and supplicates to the Names of Mercy. The Name the All-Merciful (الرحمن)—to whom belong the Beautiful Names and who established Himself upon the Throne (istawā)—then manifests (yatajallā) to him. He grants him Divine Power (الاقتدار الإلهي) by which he erases the effects of the Compelling Names (الأسماء القهرية). The field of action expands for him, the breast is opened (yanshariḥ al-ṣadr), the breath flows (yajrī al-nafas), and the spirit of life courses through him. Delegations of the Names of Mercy (الأسماء الرحمانية) and Divine Realities (الحقائق الإلهية) come to him with congratulations and glad tidings.\n\nWhoever is in this state and knows it by direct taste (ذوقا) within himself is one of the people of this station. Let him not deceive himself. Every person knows his own state best. It will not benefit you to place yourself among people in a station that is not truly yours. I have advised you and clarified the path of the people for you. Do not be among the ignorant regarding what we have made known to you. <<وَاعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ الْيَقِينُ>> (And worship your Lord until there comes to you the certainty [al-yaqīn]). For <<إِنَّ اللَّهَ لَا يَخْفَىٰ عَلَيْهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ>> (Indeed, Allah—nothing is hidden from Him in the earth nor in the heaven). And Allah speaks the Truth, and He guides to the way.",
    "ur": "(باب انتالیسواں) رسول اللہ صلی اللہ علیہ وسلم کے اس قول کی معرفت میں کہ \"میں نفس رحمن (نفس الرحمن) کو یمن کی طرف سے پاتا ہوں\"۔\n\nاس منزل اور اس کے رجال کی معرفت (بسم اللہ الرحمن الرحیم)\n\n> نفس رحمن (نفس الرحمن) کو نہیں ہے، *** رحمن کے سوا کوئی سہارا۔\n> اس کا حکم ہر اس گروہ میں ہے، *** جس کے لیے کوئی ستون یا پشت پناہ نہیں۔\n> اکوان (الاکوان) کا یمن اس کی منزل ہے، *** اور وہ نہ روح ہے نہ جسم۔\n> اس کی کوئی حد نہیں جو اسے متعین کرے، *** اور وہی مطلوب و صمد (الصمد) ہے۔\n> پس تمام مخلوق اسے طلب کرتی ہے، *** پھر بھی کسی نے اسے نہیں پایا۔\n> وہ اکیلا ہے، اس جیسا کوئی نہیں، *** کمالِ صفت کے ساتھ منفرد ہے۔\n\n### [ظہور الٰہی (الإتيان الإلهي) اور خاص ظہور الٰہی (الإتيان الإلهي الخاص)]\n\nاے ولی! جان لو کہ اللہ کے کچھ بندے اس کے اسم رحمن (الرحمن) کے تحت ہیں، اور یہ اس کا قول ہے: \"اور رحمن (الرحمن) کے بندے وہ ہیں جو زمین پر آہستگی سے چلتے ہیں، اور جب جاہل انہیں مخاطب کرتے ہیں تو وہ سلام کہتے ہیں\" (وَعِبَادُ الرَّحْمَنِ الَّذِينَ يَمْشُونَ عَلَى الْأَرْضِ هَوْنًا وَإِذَا خَاطَبَهُمُ الْجَاهِلُونَ قَالُوا سَلَامًا)۔ اللہ تعالیٰ فرماتا ہے: \"جس دن ہم پرہیزگاروں کو رحمن (الرحمن) کی طرف بطور وفد جمع کریں گے\" (يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمَنِ وَفْدًا)۔ اور اللہ کے کچھ بندے ہیں جن کے پاس رحمن (الرحمن) اس کے اسم رب (الرب) کی طرف سے آتا ہے۔ کیونکہ اللہ فرماتا ہے: \"کہو، اللہ کو پکارو یا رحمن (الرحمن) کو پکارو، جس نام سے بھی پکارو، اسی کے لیے اسماء حسنیٰ (الأسماء الحسنى) ہیں\" (قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَّا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَىٰ)۔ پس جس طرح اس کے لیے اسم اللہ (اللہ) سے اسماء حسنیٰ (الأسماء الحسنى) کا کمال ہے، اسی طرح اس کے لیے اسم رحمن (الرحمن) سے بھی اسماء حسنیٰ (الأسماء الحسنى) کا کمال ہے۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"ہمارا رب آسمان دنیا کی طرف نزول فرماتا ہے\"۔\n\nاور فرمایا: \"اور تمہارا رب آئے گا\" (وَجَاءَ رَبُّكَ)۔ پس ایک عام ظہور (الإتيان) ہے جیسے یہ، جو فیصلے اور قضا کے لیے ہوتا ہے، اور ایک خاص ظہور (الإتيان) ہے جو اس کے بندوں میں سے ان لوگوں کے لیے رحمت کے ساتھ ہوتا ہے جن پر وہ توجہ فرماتا ہے۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے جب مخالفین کی طرف سے آپ کی پریشانی شدید ہوئی تو فرمایا: \"میں نفس رحمن (نفس الرحمن) کو یمن کی طرف سے پاتا ہوں\"۔\n\nآپ صلی اللہ علیہ وسلم یمن کی طرف نہیں چلے، لیکن نفس (النفس) نے آپ کو یمن کی طرف سے پایا، اور اس نے آپ کو اس وقت تک نہیں پایا جب تک کہ وہ آپ کے پاس نہیں آیا۔ پس وہ اس شدت اور تنگی سے، جس میں آپ انصار (الأنصار) کی وجہ سے تھے، کشادگی لے کر آیا۔ اللہ ان سب سے راضی ہو۔ پس نفس (النفس) آپ کے باطن اور قلب میں آگے بڑھا، اس نصرتِ دین اور اس کے قیام کی بشارت دیتے ہوئے جسے اللہ انصار (الأنصار) کے ہاتھوں ظاہر کرنے والا تھا۔\n\n### [ابن عربی دمشق میں اور انصار (الأنصار) کا واقعہ]\n\nاور انصار (الأنصار) کے واقعے میں ہمارے ساتھ جو کچھ پیش آیا، ہم اسے ان شاء اللہ ذکر کریں گے۔ وہ یہ کہ دمشق میں ہمارے پاس مراکش کے ایک فاضل، ادیب اور دیندار شخص تھے جن کا نام یحییٰ بن اخفش تھا، ان کے والد وہاں عربی پڑھایا کرتے تھے۔ ایک دن انہوں نے دمشق میں اپنے گھر سے مجھے خط لکھا، جبکہ میں بھی دمشق میں تھا، وہ اپنے خط میں مجھ سے کہتے ہیں: \"اے ولی! میں نے گزشتہ رات رسول اللہ صلی اللہ علیہ وسلم کو جامع دمشق میں دیکھا، آپ منبر کے حجرے میں اس مصحف کے خزانے کے پہلو میں تشریف فرما تھے جو عثمان رضی اللہ عنہ سے منسوب ہے۔ لوگ آپ کی طرف دوڑ رہے تھے اور آپ کے پاس داخل ہو کر بیعت کر رہے تھے۔ میں کھڑا رہا یہاں تک کہ لوگوں کا ہجوم کم ہو گیا۔ پھر میں آپ کے پاس داخل ہوا اور آپ کا ہاتھ پکڑا۔ آپ نے مجھ سے پوچھا: 'کیا تم محمد کو جانتے ہو؟' میں نے عرض کیا: 'یا رسول اللہ! کون محمد؟' آپ نے فرمایا: 'ابن عربی۔' راوی کہتے ہیں: میں نے عرض کیا: 'ہاں، میں انہیں جانتا ہوں۔' تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: 'ہم نے انہیں ایک کام کا حکم دیا ہے، پس تم ان سے کہو کہ رسول اللہ صلی اللہ علیہ وسلم تمہیں حکم دیتے ہیں کہ جس کام کا تمہیں حکم دیا گیا ہے اس کے لیے اٹھ کھڑے ہو، اور تم ان کی صحبت اختیار کرو، کیونکہ تم ان کی صحبت سے فائدہ اٹھاؤ گے۔ اور ان سے کہو کہ رسول اللہ صلی اللہ علیہ وسلم تمہیں حکم دیتے ہیں کہ انصار (الأنصار) کی مدح کرو اور ان میں سے سعد بن عبادہ کو ضرور خاص کرو۔'\" پھر آپ نے حسان بن ثابت کو بلایا۔ رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: \"اے حسان! یحییٰ کو ایک شعر یاد کراؤ جو وہ محمد بن عربی تک پہنچائے تاکہ وہ اس پر بنیاد رکھیں اور اسی وزن اور قافیے پر اپنی شاعری کریں۔\" حسان نے کہا: \"اے یحییٰ! یہ لو،\" اور مجھے یہ شعر پڑھ کر سنایا:\n\n> شغف السهاد بمقلتي ومزاري *** فعلى الدموع معولي ومشاري‏\n\n*   \"بے خوابی نے میری آنکھوں اور میرے ٹھکانے کو مشغول کر دیا ہے، پس میرا بھروسہ اور میرا ٹھکانہ آنسوؤں پر ہے۔\"\n\nوہ اسے مجھ پر دہراتے رہے یہاں تک کہ مجھے یاد ہو گیا۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: \"جب تم انصار (الأنصار) کی مدح کر چکو تو اسے واضح خط میں لکھو اور جمعرات کی رات کو اس قبر پر لے جاؤ جسے تم 'قبر الست' کہتے ہو۔ تم وہاں ایک شخص کو پاؤ گے جس کا نام حامد ہو گا، اسے وہ مدح دے دینا۔\" جب اس دیکھنے والے (اللہ اسے توفیق دے) نے مجھے یہ بتایا تو میں نے فوراً بغیر کسی سوچ و بچار یا تاخیر کے قصیدہ تیار کیا اور وہ قصیدہ اسے دے دیا۔ اس نے مجھے لکھ بھیجا کہ جب وہ قبر الست پر پہنچا تو عشاء آخر کے بعد وہاں پہنچا۔ اس نے کہا: \"میں نے قبر کے پاس ایک شخص کو دیکھا، اس نے مجھ سے خود ہی کہا: 'کیا تم یحییٰ ہو جو فلاں کے پاس سے آئے ہو؟' اور میرا نام لیا۔\" راوی کہتے ہیں: میں نے کہا: \"ہاں۔\" اس نے کہا: \"وہ قصیدہ کہاں ہے جس میں رسول اللہ صلی اللہ علیہ وسلم کے حکم سے انصار (الأنصار) کی مدح کی گئی ہے؟\" میں نے کہا: \"یہ میرے پاس ہے۔\" میں نے اسے دے دیا۔ اس نے شمع کے قریب جا کر قصیدہ پڑھنا چاہا، لیکن میں نے دیکھا کہ وہ اس خط کو نہیں پڑھ پا رہا۔ میں نے اس سے کہا: \"کیا آپ مجھے حکم دیتے ہیں کہ میں آپ کو یہ پڑھ کر سناؤں؟\" اس نے کہا: \"ہاں۔\" تو میں نے اسے پڑھ کر سنایا۔ اور یہ ہے اس قصیدے کا متن:\n\n> قال ابن ثابت الذي فخرت به *** فقر الكلام ونشأة الأشعار\n> شغف السهاد بمقلتي ومزاري *** فعلى الدموع معولي ومشاري‏\n\n*   ابن ثابت نے کہا جس پر میں نے فخر کیا، کلام کی فصاحت اور اشعار کی پیدائش۔\n*   بے خوابی نے میری آنکھوں اور میرے ٹھکانے کو مشغول کر دیا ہے، پس میرا بھروسہ اور میرا ٹھکانہ آنسوؤں پر ہے۔\n\nمیری والدہ کا تعلق انصار (الأنصار) سے تھا، اس لیے میں نے کہا:\n\n> فلذا جعلت رويه الراء التي *** هي من حروف الرد والتكرار\n> فأقول مبتدئا لطاعة أحمد *** في مدح قوم سادة أبرار\n> إني امرؤ من جملة الأنصار *** فإذا مدحتهمو مدحت نجاري‏\n> بسيوفهم قام الهدى وبهم علت *** أنواره في رأس كل منار\n> قاموا بنصر الهاشمي محمد *** المصطفى المختار من مختار\n> صحبوا النبي بنية وعزائم *** فازوا بهن حميدة الآثار\n> باعوا نفوسهمو لنصرة دينه *** ولذاك ما صحبوه بالإيثار\n> عنهم كنى المختار بالنفس الذي *** يأتيه من يمن مع الأقدار\n> سعد سليل عبادة فخرت به *** يوم السقيفة جملة الأنصار\n> لله آساد لكل كريهة *** نزلت بدين الله والأخيار\n> عزوا بدين الله في إعزازهم *** دين الهدى بالعسكر الجرار\n> فيهم علا يوم القيامة مشهدي *** وبهم ترى يوم الورود فخاري‏\n> لو أنني صغت الكلام قلائدا *** في مدحهم ما كنت بالمكثار\n> كرش النبي وعيبة لرسوله *** لحقت بهم أعداؤه بتبار\n> رهبان ليلا يقرءون كلامه *** آساد غاب في الوغى بنهار\n\n*   اسی لیے میں نے اس کا قافیہ 'را' کو بنایا، جو رد اور تکرار کے حروف میں سے ہے۔\n*   پس میں احمد (صلی اللہ علیہ وسلم) کی اطاعت میں، سردار اور نیک لوگوں کی مدح کرتے ہوئے آغاز کرتا ہوں۔\n*   میں انصار (الأنصار) کے گروہ میں سے ایک شخص ہوں، پس جب میں ان کی مدح کرتا ہوں تو گویا اپنی اصل کی مدح کرتا ہوں۔\n*   ان کی تلواروں سے ہدایت قائم ہوئی، اور ان کے ذریعے اس کے انوار ہر مینار کی چوٹی پر بلند ہوئے۔\n*   وہ ہاشمی محمد، مصطفیٰ، مختار کے منتخب کردہ کی نصرت کے لیے کھڑے ہوئے۔\n*   انہوں نے نیت اور پختہ ارادوں کے ساتھ نبی کی صحبت اختیار کی، جن کے ذریعے وہ قابل تعریف آثار کے ساتھ کامیاب ہوئے۔\n*   انہوں نے اپنے نفوس کو دین کی نصرت کے لیے بیچ دیا، اور اسی لیے انہوں نے ایثار کے ساتھ آپ کی صحبت اختیار کی۔\n*   مختار (صلی اللہ علیہ وسلم) نے ان ہی سے نفس (النفس) کے ذریعے کنایہ کیا جو تقدیروں کے ساتھ یمن کی طرف سے آتا ہے۔\n*   سعد، عبادہ کے بیٹے، جن پر سقیفہ کے دن تمام انصار (الأنصار) نے فخر کیا۔\n*   اللہ کے شیر ہیں ہر اس مصیبت کے لیے جو دینِ خدا اور نیک لوگوں پر نازل ہوئی۔\n*   انہوں نے اللہ کے دین میں عزت پائی، اپنے اس اعزاز میں کہ انہوں نے عظیم لشکر کے ساتھ دینِ ہدایت کو عزت دی۔\n*   ان ہی میں قیامت کے دن میرا مقام بلند ہو گا، اور ان ہی کے ذریعے تم ورود کے دن میرا فخر دیکھو گے۔\n*   اگر میں کلام کو ہار بنا کر ان کی مدح میں پروتا، تب بھی میں زیادہ کہنے والا نہ ہوتا۔\n*   وہ نبی کا خاندان اور ان کے رسول کا خزانہ ہیں، ان کے ذریعے ان کے دشمن ہلاکت میں پڑے۔\n*   رات کو راہب ہیں، اس کے کلام کی تلاوت کرتے ہیں، اور دن کو میدان جنگ میں جنگل کے شیر ہیں۔\n\nاور خواب کا قصہ طویل ہے، پس میں نے اس میں سے صرف اسی پر اکتفا کیا جو ہمیں اس باب میں انصار (الأنصار) کے ذکر کے حوالے سے درکار ہے۔\n\n### [انصار (الأنصار)، مہاجرین کے ساتھ، دینِ خدا کے قیام پر نبی کے مددگار]\n\nپھر ہم واپس آتے ہیں اور کہتے ہیں کہ انصار (الأنصار) اس وقت آئے جب اللہ نے اپنے نبی کو اس بشارت کے ذریعے کشادگی عطا فرما دی تھی جو اس نے آپ کو دی تھی۔ پس انصار (الأنصار) آپ سے کشادگی، شرح صدر اور خوشی کی حالت میں ملے، اور آپ صلی اللہ علیہ وسلم نے ان کا استقبال اپنے رب کے ذریعے غنی ہونے والے کا سا استقبال کیا۔ پس وہ اور مہاجرین (المهاجرين) اللہ کے دین کو قائم کرنے میں مددگار بنے، جیسا کہ اللہ نے انہیں حکم دیا۔ اللہ عزوجل فرماتا ہے: \"اور اللہ ہی قبض کرتا ہے اور پھیلاتا ہے\" (وَاللَّهُ يَقْبِضُ وَيَبْسُطُ)۔ پس اللہ کے لیے اسماء حسنیٰ (الأسماء الحسنى) ہیں، اور ان کے آثار ہیں اور وہ اپنی مخلوق میں حکم فرماتے ہیں، اور وہی اللہ تعالیٰ کی طرف سے ممکنات (الممکنات) کے وجود پر متوجہ ہیں اور ان معانی پر جو ان میں شامل ہیں جن کی کوئی انتہا نہیں۔\n\n### [جن (الجن)، انسان کے ساتھ، عبادت کے لیے پیدا کیے گئے]\n\nاور اللہ اپنی ذات کے اعتبار سے تمام جہانوں سے بے نیاز ہے (غَنِيٌّ عَنِ الْعَالَمِينَ)۔ اور ہم نے اللہ کو اس لیے پہچانا کہ وہ جہانوں سے بے نیاز ہے تاکہ وہ ہمیں یہ سکھائے کہ اس نے ہمیں صرف ہمارے لیے پیدا کیا ہے، نہ کہ اپنے لیے۔ اور اس نے ہمیں اپنی عبادت کے لیے صرف اس لیے پیدا کیا تاکہ اس عمل کا ثواب اور فضل ہماری طرف لوٹے۔ اور اسی لیے اس نے اس خطاب کو صرف دو بھاری مخلوقات (الثقلین) کے ساتھ خاص کیا، پس اللہ تعالیٰ نے فرمایا: \"اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا\" (وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ)۔ اور ہمیں اس میں کوئی شک نہیں کہ جو کچھ بھی فرشتوں اور دیگر عالم سے پیدا کیا گیا، اللہ نے انہیں صرف اپنی حمد کے ساتھ تسبیح کرنے والا ہی پیدا کیا۔ اور اس نے اس صفت (عبادت) کو، جو کہ ذلت (الذلة) ہے، صرف دو بھاری مخلوقات کے ساتھ خاص نہیں کیا۔ پس اس نے انہیں اس وقت پیدا نہیں کیا جب وہ نہیں تھے، بلکہ اس نے انہیں اس لیے پیدا کیا تاکہ وہ ذلیل ہوں۔ اور ان کے سوا جو کچھ بھی پیدا کیا، انہیں ان کی اصل تخلیق میں اس وقت پیدا کیا جب وہ نہیں تھے۔ پس اس نے دو بھاری مخلوقات کے علاوہ کسی میں ذلت کو علت نہیں بنایا، جیسا کہ اس نے ہم میں بنایا۔\n\n### [فرشتے اللہ کے حکم کی نافرمانی نہیں کرتے اور وہی کرتے ہیں جس کا انہیں حکم دیا جاتا ہے]\n\nاور یہ اس لیے ہے کہ اللہ کی مخلوق میں سے کسی نے بھی دو بھاری مخلوقات کے سوا اللہ کے حکم پر تکبر نہیں کیا، اور نہ ہی اللہ کی مخلوق میں سے کسی نے دو بھاری مخلوقات کے سوا اللہ کی نافرمانی کی۔ پس ابلیس کو حکم دیا گیا تو اس نے نافرمانی کی، اور آدم علیہ السلام کو درخت کے قریب جانے سے منع کیا گیا تو ان کے معاملے میں وہی ہوا جو اللہ نے ہمیں اپنی کتاب میں بتایا: \"اور آدم نے اپنے رب کی نافرمانی کی\" (وَعَصَى آدَمُ رَبَّهُ)۔ اور جہاں تک فرشتوں کا تعلق ہے، اللہ نے ان کے حق میں گواہی دی ہے کہ \"وہ اللہ کے حکم کی نافرمانی نہیں کرتے اور وہی کرتے ہیں جس کا انہیں حکم دیا جاتا ہے\" (لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ)۔ یہ ان مفسرین کی تردید ہے جنہوں نے بابل میں دو فرشتوں کے حق میں ایسی بات کی جو ان کے شایانِ شان نہیں اور نہ ہی ظاہر آیت اسے دیتی ہے۔ لیکن انسان اللہ تعالیٰ پر جرات کرتا ہے، پس وہ اس کے بارے میں ایسی بات کہتا ہے جو اس کے جلال کے لائق نہیں، تو وہ فرشتوں کے بارے میں کیوں نہ کہے گا؟ پس جس طرح انسان نے کئی معاملات میں اپنے رب کو جھٹلایا، اسی طرح یہ کہنے والا فرشتوں کے حق میں اللہ کے اس قول کو جھٹلاتا ہے کہ \"وہ اللہ کے حکم کی نافرمانی نہیں کرتے\" (لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ)۔ اور رسول اللہ صلی اللہ علیہ وسلم سے اللہ عزوجل کے بارے میں صحیح خبر میں آیا ہے کہ اللہ عزوجل فرماتا ہے: \"ابن آدم نے مجھے جھٹلایا، اور اسے ایسا نہیں کرنا چاہیے تھا، اور ابن آدم نے مجھے گالی دی، اور اسے ایسا نہیں کرنا چاہیے تھا\"۔\n\nاور خبر میں یہ بھی آیا ہے کہ \"اللہ سے زیادہ کوئی بھی اذیت پر صبر کرنے والا نہیں\"۔\n\nاور وہ سبحانہ انہیں رزق دیتا ہے اور ان پر احسان کرتا ہے، جبکہ وہ اس کے حق میں اس صفت پر ہیں۔\n\n### [دو بھاری مخلوقات کے علاوہ دیگر موجودات کے تکبر نہ کرنے کا سبب]\n\nپس جان لو کہ دو بھاری مخلوقات کے علاوہ دیگر موجودات کے تکبر نہ کرنے کا سبب یہ ہے کہ دیگر مخلوقات کی تخلیق پر اسماء الٰہیہ (الأسماء الإلهية) میں سے جبروت (الجبروت)، کبریاء (الکبریاء)، عظمت (العظمة)، قہر (القہر) اور عزت (العزة) کے اسماء متوجہ ہوئے، پس وہ اس قہر الٰہی کے تحت ذلیل ہو کر نکلے۔ اور اللہ نے انہیں ان اسماء کے ذریعے پہچانا جب انہیں وجود بخشا، پس جو اس طرح پیدا ہوا، اس کے لیے ممکن نہ ہوا کہ وہ اپنا سر اٹھائے یا اپنے نفس میں اللہ کی مخلوق میں سے کسی پر بھی تکبر کا ذائقہ پائے، تو اپنے خالق پر کیسے؟ جبکہ اس نے اسے کشف (الکشف) کے ذریعے دکھا دیا کہ وہ اس کی گرفت میں اور اس کے قہر کے تحت ہے۔ اور انہوں نے کشف (الکشف) کے ذریعے اپنی پیشانیوں اور ہر جاندار کی پیشانیوں کو دیکھا کہ وہ اس کے ہاتھ میں ہیں۔ قرآن عزیز میں ہے: \"کوئی جاندار نہیں مگر وہ اس کی پیشانی پکڑے ہوئے ہے\" (مَا مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا)۔ پھر اسے مکمل کرتے ہوئے فرمایا: \"بے شک میرا رب سیدھے راستے پر ہے\" (إِنَّ رَبِّي عَلَى صِرَاطٍ مُّسْتَقِيمٍ)۔ اور عربوں کے ہاں پیشانی پکڑنا ذلیل کرنا ہے، یہ ہمارے ہاں عرف میں طے شدہ ہے۔ پس جس کا حال اپنے رب کے مشاہدے میں یہ ہو کہ وہ پیشانیوں کو اپنے ہاتھ میں پکڑے ہوئے دیکھتا ہے، اور اپنی پیشانی کو ان پیشانیوں کے مجموعے میں دیکھتا ہے، تو اس کشف (الکشف) کے باوجود اس سے اپنے خالق پر عزت یا تکبر کا تصور کیسے کیا جا سکتا ہے؟\n\nاور جہاں تک دو بھاری مخلوقات کا تعلق ہے، تو انہیں لطف (اللطف)، حنان (الحنان)، رافت (الرأفة)، رحمت (الرحمة) اور تنزل الٰہی (التنزل الإلهي) کے اسماء کے ذریعے پیدا کیا گیا۔ پس جب وہ ظاہر ہوئے تو انہوں نے عظمت، عزت یا کبریاء نہیں دیکھی، اور انہوں نے اپنے نفوس کو اپنے وجود میں رحمت، شفقت اور تنزل (التنزل) پر مبنی پایا۔ اور اللہ نے ان کے لیے اپنے جلال، کبریاء یا عظمت میں سے کچھ بھی ظاہر نہیں کیا جب وہ دنیا میں آئے، جو انہیں ان کے نفوس سے مشغول کر دیتا۔ کیا تم نہیں دیکھتے کہ جب انہیں ان کے ظہور کے وقت گرفت کا سامنا ہوا، جب ان سے کہا گیا: \"کیا میں تمہارا رب نہیں ہوں؟\" (أَلَسْتُ بِرَبِّكُمْ) تو کیا ان میں سے کسی نے کہا: \"ہاں، نہیں، اللہ کی قسم!\"؟ بلکہ انہوں نے کہا: \"کیوں نہیں!\" (قَالُوا بَلَىٰ)۔ پس انہوں نے اس کی ربوبیت کا اقرار کیا کیونکہ وہ پکڑنے والے کی گرفت میں محصور تھے۔ اگر وہ یہ شہود (الشہود) کرتے کہ ان کی پیشانیاں اللہ کے ہاتھ میں ہیں، خواہ وہ شہودِ عین ہو یا ایمان کا شہود جو شہودِ عین جیسا ہو، جیسا کہ گرفت کا شہود، تو وہ پلک جھپکنے کے برابر بھی اللہ کی نافرمانی نہ کرتے، اور وہ دیگر مخلوقات کی طرح ہوتے جو \"رات دن تسبیح کرتے ہیں اور تھکتے نہیں\" (يُسَبِّحُونَ اللَّيْلَ وَالنَّهَارَ لَا يَفْتُرُونَ)۔\n\nپس جب وہ ان رحمانی اسماء (الأسماء الرحمانية) سے ظاہر ہوئے تو انہوں نے کہا: \"اے ہمارے رب! تو نے ہمیں کیوں پیدا کیا؟\" اللہ نے فرمایا: \"تاکہ تم میری عبادت کرو، یعنی میرے سامنے ذلیل ہو جاؤ۔\" پس انہوں نے قہر کی کوئی صفت یا عزت کا کوئی پہلو نہیں دیکھا جو انہیں ذلیل کرتا، خاص طور پر جب اللہ نے ان سے کہا: \"تاکہ تم میری طرف ذلیل ہو جاؤ۔\" پس اس نے ذلیل کرنے کا فعل ان کی طرف منسوب کیا، جس سے ان کا تکبر مزید بڑھ گیا۔ اگر وہ ان سے کہتا: \"میں نے تمہیں صرف اس لیے پیدا کیا ہے تاکہ میں تمہیں ذلیل کروں،\" تو وہ خوفزدہ ہو جاتے، کیونکہ یہ قہر کا کلمہ ہے۔ پس وہ اس کلمے کے خوف سے اپنے نفوس سے ذلت کی طرف لپکتے، جیسا کہ اس نے آسمانوں اور زمین سے کہا: \"خواہ خوشی سے آؤ یا ناخوشی سے\" (ائْتِيَا طَوْعًا أَوْ كَرْهًا)۔ اگر وہ \"ناخوشی سے\" نہ کہتا، کیونکہ یہ قہر کا کلمہ ہے جہاں بھی آتا ہے۔ اسی لیے ہم نے کہا کہ اس نے دو بھاری مخلوقات کے علاوہ ہر چیز کو صرف قہر (القہر) اور جبروت (الجبروت) کی صفت کے ساتھ ہی وجود بخشا اور انہیں مخاطب کیا۔\n\nپس جب اس نے دو بھاری مخلوقات سے اس سبب کے بارے میں کہا جس کے لیے اس نے انہیں وجود بخشا اور پیدا کیا، تو انہوں نے ان اسماء کی طرف دیکھا جن سے وہ وجود میں آئے تھے، اور ان میں کوئی ایسا اسم الٰہی (اسم إلهي) نہیں دیکھا جو ان کی گرفت اور سزا کا تقاضا کرتا اگر وہ اس کے حکم اور نہی کی نافرمانی کرتے اور اس کے حکم پر تکبر کرتے۔ پس انہوں نے اس کی اطاعت نہیں کی اور نافرمانی کی، تو \"آدم نے اپنے رب کی نافرمانی کی\" (عَصَى آدَمُ رَبَّهُ)، اور وہ پہلے انسان تھے، اور ابلیس نے اپنے رب کی نافرمانی کی۔ پس ان دونوں اصولوں سے تمام دو بھاری مخلوقات میں مخالفت سرایت کر گئی۔ نبی صلی اللہ علیہ وسلم آدم کے بارے میں فرماتے ہیں جب انہوں نے انکار کیا اور وہ عمر بھول گئے جو انہوں نے داؤد کو ہبہ کی تھی: \"آدم بھول گئے تو ان کی ذریت بھول گئی، اور آدم نے انکار کیا تو ان کی ذریت نے انکار کیا، سوائے اس کے جس پر تمہارے رب نے رحم کیا\" (إِلَّا مَن رَّحِمَ رَبُّكَ) اور اسے محفوظ رکھا۔ لیکن یہ تکبر اللہ پر نہیں، بلکہ بعض کا بعض پر اور دیگر مخلوقات پر تکبر ہے۔ پس ابتداء میں کوئی بھی اس سے محفوظ نہیں رہا، کیونکہ اللہ نے چاہا کہ \"ان میں سے بعض کو بعض کے لیے مسخر کرے\" (بَعْضُهُمْ بَعْضًا سُخْرِيًّا)۔ لیکن جب اللہ اپنے بندے پر توجہ فرماتا ہے، تو دوسری حالت میں اسے توفیق اور عنایت عطا کرتا ہے، پس وہ اس عبادت کو لازم پکڑتا ہے جس کے لیے وہ پیدا کیا گیا تھا، اور دیگر مخلوقات سے جا ملتا ہے، اور یہ وجود میں بہت کمیاب ہے۔ اور وہ بندہ کہاں ہے جو اپنے نفوس کے ساتھ، اپنی سانسوں کے ساتھ ہمیشہ اللہ کا بندہ ہو؟ پس دو بھاری مخلوقات میں سے کوئی بھی ذلیل نہیں ہوتا مگر اس قہر کی وجہ سے جو وہ پاتا ہے، پس وہ اپنی ذلت میں مجبور ہوتا ہے۔ جب وہ اسے پاتا ہے، تب وہ ان اسماء کی طرف متوجہ ہوتا ہے جن سے وہ وجود میں آیا تھا، یعنی اسماء رحمت (أسماء الرحمة)، اور انہیں طلب کرتا ہے تاکہ وہ اس تنگی اور حرج کو دور کر دیں جس کا وہ عادی نہیں تھا، پس وہ ان کی طرف جھکتا ہے اور جانتا ہے کہ ان میں قوت اور سلطنت ہے، پس وہ اس تنگی سے اسے کشادگی عطا کرتے ہیں۔\n\n### [نفس رحمن (نفس الرحمن) یمن کی طرف سے]\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"بے شک نفس رحمن (نفس الرحمن)\"، پس آپ نے اس اسم کی طرف اشارہ کیا جس سے دو بھاری مخلوقات کو پیدا کیا گیا، اور اس کے ساتھ قوت کی جہت کو ملا دیا، پس فرمایا: \"یمن کی طرف سے\" (مِن قِبَلِ الْيَمَنِ)۔ اور 'قبل' کا مطلب ہے ناحیہ اور جہت، اور 'یمن' یمین (دایاں) سے ہے، جس کا مطلب قوت ہے۔ شاعر نے کہا:\n\n> إذا ما راية رفعت لمجد *** تلقاها عرابة باليمين‏\n\n*   \"جب بھی کوئی پرچم عظمت کے لیے بلند کیا گیا، عرابہ نے اسے دائیں ہاتھ سے تھاما۔\"\n\nاس سے مراد قوت ہے، کیونکہ دایاں ہاتھ قوت کی جگہ ہے۔ اور \"آسمان اس کے دائیں ہاتھ میں لپیٹے ہوئے ہیں\" (وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ)۔ اور اسی طرح تھا جب آپ نے اسم رحمن (الرحمن) کی طرف دیکھا جس سے آپ وجود میں آئے، تو نصرت انصار (الأنصار) کے ہاتھوں پر تھی۔\n\n### [اللہ کی رحمت اس کے غضب پر سبقت لے گئی]\n\nاور اسی طرح اس کا قول: \"جس دن ہم پرہیزگاروں کو جمع کریں گے\" (يَوْمَ نَحْشُرُ الْمُتَّقِينَ)۔ کیونکہ متقی (المتقی) وہ ہے جو محتاط، خوفزدہ اور ڈرنے والا ہو۔ اور کوئی بھی رحمن (الرحمن)، رحیم (الرحيم)، رؤف (الرؤوف) کا شہود (الشہود) کرنے والا نہیں ہوتا اور اس سے ڈرتا نہیں، بلکہ متقی کا مشہود (المشہود) وہ ہوتا ہے جو جلد حساب لینے والا، سخت سزا دینے والا، متکبر (المتکبر)، جبار (الجبار) ہو۔ پس وہ ڈرتا ہے اور خوف کھاتا ہے، تو اللہ تعالیٰ اسے امن دیتا ہے کہ وہ اسے رحمن (الرحمن) کی طرف جمع کرے گا، پس وہ جبار (الجبار) اور قہار (القہار) کی سختی سے محفوظ ہو جاتا ہے۔ اور اسی لیے:\n\nاللہ تعالیٰ نے ہمارے بارے میں فرمایا کہ اس کی رحمت اس کے غضب پر سبقت لے گئی۔\n\nکیونکہ اس نے ہمیں رحمت کے ذریعے وجود بخشا، اس نے ہمیں قہر (القہر) کی صفت سے وجود نہیں بخشا۔ اور اسی طرح نافرمانی میں تاخیر ہوئی، پس دو بھاری مخلوقات میں غضب رحمت سے مؤخر ہوا۔ اللہ ان دونوں کا حکم آخرت میں بھی اسی طرح رکھے گا، اگرچہ کچھ دیر بعد ہو۔ کیا تم نہیں دیکھتے کہ جب اللہ تعالیٰ ہمارے لیے اپنے اسماء کا ذکر کرتا ہے تو وہ اسماء رحمت (أسماء الرحمة) سے آغاز کرتا ہے اور اسماء کبریاء (أسماء الکبریاء) کو مؤخر کرتا ہے، کیونکہ ہم انہیں نہیں جانتے۔ پس جب وہ ہمارے لیے اسماء رحمت (أسماء الرحمة) کو مقدم کرتا ہے تو ہم انہیں پہچانتے ہیں اور ان کی طرف جھکتے ہیں، اس وقت وہ ان کے بعد اسماء کبریاء (أسماء الکبریاء) لاتا ہے تاکہ ہم انہیں تبعیت کے حکم سے قبول کریں۔ پس اللہ تعالیٰ نے فرمایا: \"وہ اللہ ہے جس کے سوا کوئی معبود نہیں، غیب اور شہادت کا جاننے والا ہے\" (هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ)۔ یہ ایک صفت ہے جو سب کو شامل ہے، اور اس کی وحدانیت دوسرے سے زیادہ اولیٰ نہیں ہے۔ پھر اس نے آغاز کیا اور فرمایا: \"وہ رحمن (الرحمن) ہے\" (هُوَ الرَّحْمَنُ)، پس اس نے ہمیں رحمن (الرحمن) اور رحیم (الرحيم) سے پہچنوایا، کیونکہ ہم اسی سے وجود میں آئے۔ پھر اس کے بعد فرمایا: \"وہ اللہ ہے جس کے سوا کوئی معبود نہیں\" (هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ)، یہ ایک آغاز ہے تاکہ اسے رحمن (الرحمن) اور رحیم (الرحيم) کے درمیان اور عزیز (العزیز)، جبار (الجبار)، متکبر (المتکبر) کے درمیان فصل بنا دے۔ پس فرمایا: \"بادشاہ (الملک)، قدوس (القدوس)، سلام (السلام)، مومن (المؤمن)\"۔ اور یہ سب رحمن (الرحمن) کی صفات میں سے ہیں۔ پھر آیا اور فرمایا: \"عزیز (العزیز)، جبار (الجبار)، متکبر (المتکبر)\"۔ پس ہم نے ان صفات کو قبول کیا جب ہمیں لطف (اللطف) اور حنان (الحنان) کے اسماء اور ان مشترک اسماء سے انس ہو گیا جن کا ایک رخ رحمت کی طرف ہے اور ایک رخ کبریاء (الکبریاء) کی طرف، اور وہ اللہ اور ملک (الملک) ہیں۔ پس جب وہ عظمت کے اسماء لایا، اور مقام رحمت کو واجب کرنے والے کثیر اسماء کے تسلسل سے مانوس ہو چکا تھا، تو ہم نے عظمت کے اسماء کو قبول کیا، کیونکہ ہم نے دیکھا کہ اسماء رحمت (أسماء الرحمة) نے انہیں قبول کر لیا ہے، چونکہ وہ ان کی صفات تھے۔ پس ہم نے انہیں ضمنی طور پر، اپنے اسماء کی تبعیت میں قبول کر لیا۔ پھر جب اللہ نے مخلوق کو یہ علم دیا کہ صاحب قلب اور اللہ کی معرفت رکھنے والا اور اس کے خطاب کے مواقع کو جاننے والا جب عظمت کے اسماء سنتا ہے تو لازماً اس پر خوف اور قبض کا اثر ہوتا ہے، تو اس کے بعد اس نے ان اسماء کی صفت بیان کی اور ان کے ساتھ ایسے اسماء کو شامل کیا جو نہ تو مطلقاً رحمت کے ساتھ خاص ہیں اور نہ ہی مطلقاً عظمت سے خالی ہیں۔ پس فرمایا: \"وہ اللہ ہے، خالق (الخالق)، بارئ (البارئ)، مصور (المصور)، اسی کے لیے اسماء حسنیٰ (الأسماء الحسنى) ہیں\" (هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ)۔ اور یہ سب اللہ کی طرف سے اپنے بندوں کو تعلیم دینا اور ان کی طرف تنزل (التنزل) فرمانا ہے۔\n\n### [سورۃ النمل کی سلیمانی بسملہ، سورۃ التوبہ کی تکمیل]\n\nپس اس باب کے اصحاب کی منزلیں یہی مذکورہ اسماء اور ان کی حضرات ہیں۔ اور اسی لیے اللہ سبحانہ نے اپنی کتاب میں ہر سورت میں \"بسم اللہ الرحمن الرحیم\" (بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ) کو مقدم کیا، کیونکہ سورتیں خوفناک امور پر مشتمل ہوتی ہیں جو اسماء عظمت (أسماء العظمة) اور اقتدار (الاقتدار) کا تقاضا کرتے ہیں، پس اللہ نے اسماء رحمت (أسماء الرحمة) کو انس اور بشارت کے لیے مقدم کیا۔ اور اسی لیے انہوں نے سورۃ التوبہ کے بارے میں کہا کہ یہ اور سورۃ الانفال ایک ہی سورت ہیں، کیونکہ ان کے درمیان بسملہ سے فصل نہیں کیا گیا۔ اور اس بارے میں صحابہ میں سے اس فن کے علماء کے درمیان منقول اختلاف ہے۔ اور جب اللہ تعالیٰ نے اس امت میں سورۃ براءت سے بسملہ کے حذف کے بارے میں ہونے والے اختلاف کو جان لیا، تو جو شخص اس طرف گیا کہ یہ ایک مستقل سورت ہے اور اس کے نزدیک قرآن ایک سو تیرہ سورتوں پر مشتمل تھا، تو اسے ایک سو تیرہ بسملہ کی ضرورت تھی، تو اللہ نے ان کے لیے سورۃ النمل میں ایک بسملہ ظاہر کر دی تاکہ عدد مکمل ہو جائے، اور وہ اسے اسی طرح لایا جس طرح وہ سورتوں کے آغاز میں آئی ہے، بعینہٖ۔ کیونکہ سلیمان علیہ السلام کی زبان عربی نہیں تھی، بلکہ کوئی اور تھی، پس انہوں نے اپنی کتاب میں اس لفظ کی زبان نہیں لکھی، بلکہ اپنی زبان میں ایک لفظ لکھا جو عربی زبان میں اس کے معنی کا تقاضا کرتا ہے جب اس کا ترجمہ \"بسم اللہ الرحمن الرحیم\" (بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ) سے کیا جائے۔ اور وہ اسے الف کے حذف کے ساتھ لایا، جیسا کہ وہ سورتوں کے آغاز میں آئی ہے، تاکہ یہ معلوم ہو جائے کہ اس سے وہی مقصود ہے جو سورتوں کے آغاز میں مقصود ہے۔ اور اس نے \"بسم اللہ مجراھا\" (بِسْمِ اللَّهِ مَجْرَاهَا) اور \"اقرأ باسم ربک\" (اقْرَأْ بِاسْمِ رَبِّكَ) میں ایسا نہیں کیا، پس وہاں الف کو ثابت رکھا تاکہ بسملہ کے اسم اور دیگر کے درمیان فرق کیا جا سکے۔\n\n### [سورۃ التوبہ رحمت کی سورت ہے]\n\nاور اسی لیے سورۃ التوبہ رحمت (الرحمة) اور تنزل الٰہی (التنزل الإلهي) کی صفات میں سے بہت کچھ شامل کرتی ہے، کیونکہ اس میں اللہ کا مومنوں کے نفوس کو ان سے خریدنا شامل ہے \"اس کے بدلے کہ ان کے لیے جنت ہے\" (بِأَنَّ لَهُمُ الْجَنَّةَ)۔ اور اس سے بڑھ کر کون سا تنزل (التنزل) ہو سکتا ہے کہ آقا اپنے غلام سے اس کی ملکیت خریدے؟ اور کیا رحمت میں اس سے زیادہ بلیغ کوئی چیز ہو سکتی ہے؟ پس لازمی ہے کہ سورۃ التوبہ اور الانفال ایک ہی سورت ہوں، یا سورۃ النمل کی سلیمانی بسملہ سورۃ التوبہ کے لیے ہو۔ پھر اس کے نام پر غور کرو، سورۃ التوبہ (التوبة)، اور توبہ رحمت (الرحمة) کا تقاضا کرتی ہے، تبرّی (بیزاری) کا تقاضا نہیں کرتی۔ اگرچہ اللہ عزوجل نے تبرّی سے آغاز کیا، لیکن اس نے ایک ایسی آیت پر ختم کیا جو نہیں آئی اور نہ ہی پائی گئی مگر اس کے پاس جس کی گواہی کو اللہ نے دو آدمیوں کی گواہی کے برابر قرار دیا۔ اگر تم عقل رکھتے ہو تو تم جان لو گے کہ اس سورت میں کتنی رحمت پوشیدہ ہے، خاص طور پر اس کے قول میں: \"اور ان میں سے بعض ہیں اور ان میں سے بعض ہیں\" (وَمِنْهُمْ وَمِنْهُمْ)۔ اور یہ سب ہمارے لیے رحمت ہے تاکہ ہم اس میں پڑنے اور ان صفات سے متصف ہونے سے بچیں۔ کیونکہ قرآن ہم پر نازل ہوا ہے۔ پس قرآن کی کسی بھی سورت میں ہمارے حق میں اس سورت سے زیادہ عظیم رحمت شامل نہیں، کیونکہ اس میں ان امور کی کثرت ہے جن سے مومن کو بچنا اور اجتناب کرنا چاہیے۔ اگر ذات حق (الحق) ہمیں ان سے نہ پہچنواتا تو شاید ہم ان میں پڑ جاتے اور ہمیں شعور بھی نہ ہوتا۔ پس یہ مومنوں کے لیے رحمت کی سورت ہے۔\n\n### [نفس رحمن (نفس الرحمن) کے رجال]\n\nاور چونکہ ہم نے تمہیں اس کی منزلوں سے آگاہ کر دیا ہے، تو جان لو کہ اس کے رجال (رجال) وہ ہیں جن کا حال اہل اللہ میں سے اس شخص کا حال ہو جسے اس کے تمام عالم علوی اور سفلی سے اسماء جبروتیہ (الأسماء الجبروتية) نے گھیر لیا ہو، پس وہ اسماء رحمت (أسماء الرحمة) کی طرف پناہ اور تضرع کرتا ہے۔ تو اس کے لیے اسم رحمن (الرحمن) کا ظہور (التجلی) ہوتا ہے، جس کے لیے اسماء حسنیٰ (الأسماء الحسنى) ہیں اور جو عرش پر مستوی ہوا، پس وہ اسے اقتدار الٰہی (الاقتدار الإلهي) عطا کرتا ہے، جس سے وہ اسماء قہریہ (الأسماء القهرية) کے آثار کو مٹا دیتا ہے۔ پس اس کے لیے میدان وسیع ہو جاتا ہے، سینہ کھل جاتا ہے، نفس (النفس) جاری ہو جاتا ہے، اور اس میں حیات کی روح سرایت کر جاتی ہے۔ اور اسماء رحمانیہ (الأسماء الرحمانية) کے وفود اور حقائق الٰہیہ (الحقائق الإلهية) مبارکبادوں اور بشارتوں کے ساتھ اس کے پاس آتے ہیں۔ پس جس کا یہ حال ہو اور وہ اسے اپنے نفس سے ذوقاً (ذوقا) پہچانتا ہو، تو وہ اس مقام کے رجال (رجال) میں سے ہے، پس وہ اپنے آپ کو دھوکہ نہ دے۔ اور ہر انسان اپنے حال کو زیادہ جانتا ہے۔ اور یہ تمہیں فائدہ نہیں دے گا کہ تم لوگوں کے نزدیک اپنے آپ کو اس منزل پر رکھو جو حقیقت میں تمہاری نہیں ہے۔ اور میں نے تمہیں نصیحت کی ہے اور قوم کے راستے کو تمہارے لیے واضح کر دیا ہے، پس تم ان لوگوں میں سے نہ ہو جو اس سے ناواقف ہیں جس سے ہم نے تمہیں آگاہ کیا ہے۔ اور \"اپنے رب کی عبادت کرو یہاں تک کہ تمہیں یقین (الیقین) آ جائے\" (وَاعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ)۔ پس \"بے شک اللہ سے کوئی چیز زمین میں اور نہ آسمان میں پوشیدہ ہے\" (إِنَّ اللَّهَ لَا يَخْفَى عَلَيْهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ)۔ اور \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "(باب چهل و نهم) در معرفت این سخن پیامبر (صلی الله علیه و سلم) که فرمود: «من نَفَس رحمان را از سوی یمن می‌یابم.»\n\nمعرفت این منزل و مردان آن (بسم الله الرحمن الرحیم)\n\n> نَفَس رحمان را در غیر حق (الحق) تکیه‌گاهی نیست\n>\n> حکم او در هر طایفه‌ای جاری است که نه رکن دارد و نه سند\n>\n> منزل او یمنِ (برکت) کائنات است، و او نه روح است و نه جسد\n>\n> حدی ندارد که او را معین کند، و او مطلوب و صمد است\n>\n> پس همه خلق او را می‌طلبند، اما هیچ‌کس به او دست نمی‌یابد\n>\n> او احدی است که هیچ‌کس مانند او نیست، به کمال وصف منفرد است\n\n### [آمدن الهی و آمدن خاص الهی]\n\nای ولی، بدان که خداوند را بندگانی است از حیث اسم او «الرحمن» (رحمان)؛ و این همان سخن اوست: «وَعِبَادُ الرَّحْمَنِ الَّذِينَ يَمْشُونَ عَلَى الْأَرْضِ هَوْنًا وَإِذَا خَاطَبَهُمُ الْجَاهِلُونَ قَالُوا سَلَامًا» (و بندگان رحمان کسانی هستند که بر روی زمین با فروتنی راه می‌روند و چون نادانان آنان را خطاب کنند، سلام گویند). خداوند متعال می‌فرماید: «يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمَنِ وَفْدًا» (روزی که پرهیزگاران را به سوی رحمان، گروه گروه محشور می‌کنیم). و خداوند را بندگانی است که رحمان از اسم «الرب» (پروردگار) به سوی آنان می‌آید. زیرا خداوند می‌فرماید: «قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَّا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَى» (بگو: «الله» را بخوانید یا «رحمان» را بخوانید؛ هر کدام را بخوانید، پس اسماء حسنی از آن اوست). پس کمال او از اسم «الله» همان اسماء حسنی است، و همچنین از اسم «الرحمن» نیز اسماء حسنی از آن اوست.\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «پروردگار ما به آسمان دنیا فرود می‌آید.» و فرمود: «وَجَاءَ رَبُّكَ» (و پروردگارت بیاید). پس آمدنی عام مانند این وجود دارد که آمدن برای فصل و قضاوت است، و آمدنی خاص به رحمت برای کسانی از بندگانش که به او توجه کرده‌اند.\n\nرسول خدا (صلی الله علیه و سلم) هنگامی که شدت اندوهش از سوی منازعان فزونی یافت، فرمود: «من نَفَس رحمان را از سوی یمن می‌یابم.» و او به سوی یمن نرفت، بلکه نَفَس (نفس الرحمن) او را از سوی یمن دریافت. و او را درنیافت تا اینکه به نزدش آمد، و با خود گشایش (تنفیس) از شدت و تنگی‌ای که به سبب انصار (یاوران) در آن بود، آورد. خداوند از همه آنان راضی باد. پس نَفَس در باطن و قلب او پیش آمد و او را به پیروزی دین و برپایی آن به دست انصار بشارت داد.\n\n### [ابن عربی در دمشق و حدیث انصار]\n\nو برای ما در مورد حدیث انصار آنچه را که ان‌شاءالله ذکر می‌کنیم، رخ داد. و آن این است که در دمشق مردی از اهل فضل و ادب و دین به نام یحیی بن اخفش از اهالی مراکش نزد ما بود که پدرش در آنجا عربی تدریس می‌کرد. روزی از منزلش در دمشق برای من نوشت – در حالی که من نیز در آنجا بودم – و در نامه‌اش گفت: «ای ولی، دیشب رسول خدا (صلی الله علیه و سلم) را در جامع دمشق دیدم که در مقصوره خطابه، کنار خزانه مصحف منسوب به عثمان (رضی الله عنه) فرود آمده بود. و مردم با شتاب به سوی او می‌آمدند و بر او وارد می‌شدند و با او بیعت می‌کردند. من ایستاده ماندم تا اینکه جمعیت کم شد، سپس بر او وارد شدم و دستش را گرفتم. به من فرمود: «آیا محمد را می‌شناسی؟» گفتم: «ای رسول خدا، کدام محمد؟» فرمود: «ابن عربی.» گفتم: «بله، او را می‌شناسم.» رسول خدا (صلی الله علیه و سلم) به او فرمود: «ما او را به امری فرمان داده‌ایم. به او بگو که رسول خدا به تو می‌گوید: به آنچه مأمور شده‌ای برخیز و تو نیز با او همراه شو، زیرا از مصاحبت او بهره‌مند خواهی شد. و به او بگو که رسول خدا به تو می‌گوید: انصار را مدح کن و حتماً سعد بن عباده را از میان آنان مشخص کن.» سپس حسان بن ثابت را فراخواند و رسول خدا (صلی الله علیه و سلم) به او فرمود: «ای حسان، بیتی را به او بیاموز تا آن را به محمد بن عربی برساند و او بر اساس آن، قصیده‌ای در همان وزن و قافیه (عروض و روی) بسازد.» حسان گفت: «ای یحیی، این را بگیر» و بیتی را برایم خواند که این است:\n\n> شغف السهاد بمقلتي ومزاري *** فعلى الدموع معولي ومشاري‏\n>\n> (بی‌خوابی، چشمان و خوابگاه مرا شیفته خود کرده است؛ پس تکیه‌گاه و مشورت‌گاه من بر اشک‌هاست.)\n\nو پیوسته آن را برایم تکرار کرد تا حفظش کردم. سپس رسول خدا (صلی الله علیه و سلم) به من فرمود: «هنگامی که انصار را مدح کردی، آن را با خطی واضح بنویس و شب پنجشنبه به تربت این کسی که او را قبر سِت می‌نامید، ببر. در آنجا شخصی به نام حامد خواهی یافت، مدح را به او بسپار.» هنگامی که این بیننده (رؤیا) که خداوند او را موفق بدارد، مرا از این امر آگاه ساخت، من بی‌درنگ و بدون فکر و تأمل و درنگ، قصیده را سرودم. و قصیده را به او سپردم. او برایم نوشت که وقتی به قبر سِت رسید، بعد از نماز عشاء بود. گفت: «مردی را کنار قبر دیدم. او بدون مقدمه به من گفت: تو یحیی هستی که از نزد فلان آمده‌ای؟» و نام مرا برد. گفتم: «بله.» گفت: «قصیده‌ای که به امر رسول خدا (صلی الله علیه و سلم) در مدح انصار سروده شده، کجاست؟» گفتم: «اینجاست.» و آن را به او دادم. او نزدیک شمع رفت تا قصیده را بخواند، اما دیدم که خط را نمی‌شناسد. گفتم: «آیا امر می‌کنی که آن را برایت بخوانم؟» گفت: «بله.» پس آن را برایش خواندم. و این متن قصیده است:\n\n> قال ابن ثابت الذي فخرت به *** فقر الكلام ونشأة الأشعار\n>\n> (ابن ثابت که به او فخر ورزیدم، فقر کلام و منشأ اشعار را گفت.)\n>\n> شغف السهاد بمقلتي ومزاري *** فعلى الدموع معولي ومشاري‏\n>\n> (بی‌خوابی، چشمان و خوابگاه مرا شیفته خود کرده است؛ پس تکیه‌گاه و مشورت‌گاه من بر اشک‌هاست.)\n\nو چون مادرم به انصار منسوب بود، گفتم:\n\n> فلذا جعلت رويه الراء التي *** هي من حروف الرد والتكرار\n>\n> (از این رو قافیه آن را «راء» قرار دادم که از حروف رد و تکرار است.)\n>\n> فأقول مبتدئا لطاعة أحمد *** في مدح قوم سادة أبرار\n>\n> (پس در اطاعت از احمد (پیامبر) و در مدح قومی سرور و نیکوکار، آغاز می‌کنم و می‌گویم:)\n>\n> إني امرؤ من جملة الأنصار *** فإذا مدحتهمو مدحت نجاري‏\n>\n> (من مردی از جمله انصار هستم؛ پس اگر آنان را مدح کنم، اصل و نسب خود را مدح کرده‌ام.)\n>\n> بسيوفهم قام الهدى وبهم علت *** أنواره في رأس كل منار\n>\n> (هدایت با شمشیرهای آنان برپا شد و به واسطه آنان، انوارش بر فراز هر مناره‌ای بلند گشت.)\n>\n> قاموا بنصر الهاشمي محمد *** المصطفى المختار من مختار\n>\n> (به یاری هاشمی، محمد مصطفی، برگزیده از برگزیدگان، برخاستند.)\n>\n> صحبوا النبي بنية وعزائم *** فازوا بهن حميدة الآثار\n>\n> (با نیت و عزم‌های راسخ، پیامبر را همراهی کردند و به واسطه آن، به آثار ستوده دست یافتند.)\n>\n> باعوا نفوسهمو لنصرة دينه *** ولذاك ما صحبوه بالإيثار\n>\n> (جان‌های خود را برای یاری دین او فروختند، و از این رو با ایثار او را همراهی کردند.)\n>\n> عنهم كنى المختار بالنفس الذي *** يأتيه من يمن مع الأقدار\n>\n> (برگزیده (پیامبر) از آنان با «نَفَس»ی کنایه برد که از یمن همراه با تقدیرات به او می‌رسد.)\n>\n> سعد سليل عبادة فخرت به *** يوم السقيفة جملة الأنصار\n>\n> (سعد، فرزند عباده، کسی است که همه انصار در روز سقیفه به او فخر ورزیدند.)\n>\n> لله آساد لكل كريهة *** نزلت بدين الله والأخيار\n>\n> (شیرانی برای خدا در برابر هر ناگواری که بر دین خدا و نیکان نازل شد.)\n>\n> عزوا بدين الله في إعزازهم *** دين الهدى بالعسكر الجرار\n>\n> (به دین خدا عزت یافتند، در حالی که دین هدایت را با سپاهی عظیم عزت بخشیدند.)\n>\n> فيهم علا يوم القيامة مشهدي *** وبهم ترى يوم الورود فخاري‏\n>\n> (در میان آنان، جایگاه شهود من در روز قیامت بلند است، و به واسطه آنان، فخر مرا در روز ورود (به حوض) خواهی دید.)\n>\n> لو أنني صغت الكلام قلائدا *** في مدحهم ما كنت بالمكثار\n>\n> (اگر کلام را به صورت گردنبندهایی در مدح آنان می‌ساختم، باز هم پرگو نبودم.)\n>\n> كرش النبي وعيبة لرسوله *** لحقت بهم أعداؤه بتبار\n>\n> (آنان خویشاوندان نزدیک پیامبر و صندوق اسرار رسول او بودند؛ دشمنانش به واسطه آنان به هلاکت رسیدند.)\n>\n> رهبان ليلا يقرءون كلامه *** آساد غاب في الوغى بنهار\n>\n> (شب‌ها راهب‌اند و کلام او را می‌خوانند، و روزها در جنگ، شیران بیشه‌اند.)\n\nو داستان رؤیا طولانی است، پس از آن تنها به آنچه در این باب از ذکر انصار به آن نیاز داریم، اکتفا کردم.\n\n### [انصار، همراه با مهاجرین، یاور پیامبر در برپایی دین خدا]\n\nسپس باز می‌گردیم و می‌گوییم: انصار نیامدند مگر پس از آنکه خداوند به واسطه آنچه به پیامبرش بشارت داده بود، از او گشایش (تنفیس) کرد. پس انصار او را در حال گشایش و شرح صدر و سرور ملاقات کردند. و پیامبر (صلی الله علیه و سلم) آنان را با پذیرش غنی به پروردگارش ملاقات کرد، پس او همراه انصار و مهاجرین، یاوری برای برپایی دین خدا بود، همان‌گونه که خداوند به آنان امر کرده بود. خداوند عز و جل فرمود: «وَاللَّهُ يَقْبِضُ وَيَبْسُطُ» (و خداوند است که تنگ می‌گیرد و گشایش می‌دهد). پس اسماء حسنی از آن خداست و این اسماء آثاری دارند و در خلق او حکم می‌رانند، و این اسماء از جانب خداوند متعال برای ایجاد ممکنات و آنچه از معانی بی‌نهایت در بر دارند، متوجه می‌شوند.\n\n### [جن، همراه با انس، برای عبادت خلق شدند]\n\nو خداوند از حیث ذات خود، از عالمیان بی‌نیاز است. و ما خداوند متعال را از آن جهت شناختیم که «غَنِيٌّ عَنِ الْعَالَمِينَ» (از عالمیان بی‌نیاز است)، تا به ما بیاموزد که او ما را جز برای خودمان نیافریده است، نه برای خودش. و ما را برای عبادتش خلق نکرده است، مگر برای اینکه ثواب و فضل آن عمل به خود ما بازگردد. و به همین دلیل، این خطاب را جز به ثقلین (جن و انس) اختصاص نداد، پس خداوند متعال فرمود: «وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ» (و جن و انس را نیافریدم مگر برای اینکه مرا بپرستند). و شک نداریم که هر آنچه از فرشتگان و دیگر موجودات عالم خلق شده‌اند، جز برای تسبیح و ستایش او خلق نشده‌اند. و جز ثقلین به این صفت اختصاص داده نشده‌اند، منظورم صفت عبادت است که همان خواری و فروتنی است. پس آنان را هنگام خلق کردن، از آن جهت که «نیست» خلق نکرد، بلکه آنان را خلق کرد تا خوار شوند. و آنچه غیر از آنان است را در اصل خلقتشان از آن جهت که «نیست» خلق کرد. پس علت خلقت غیر از ثقلین را خواری قرار نداد، همان‌گونه که آن را در ما قرار داد.\n\n### [فرشتگان از آنچه به آنان امر شده سرپیچی نمی‌کنند و آنچه را مأمورند انجام می‌دهند]\n\nو این بدان سبب است که هیچ‌کس از خلق خدا بر امر خدا تکبر نورزید، جز ثقلین. و هیچ‌کس از خلق خدا، جز ثقلین، خدا را نافرمانی نکرد. پس به ابلیس امر کرد و او نافرمانی نمود، و آدم (علیه السلام) را از نزدیک شدن به درخت نهی کرد و سرانجام کار او همان شد که خداوند در کتابش برای ما فرمود: «وَعَصَى آدَمُ رَبَّهُ» (و آدم پروردگارش را نافرمانی کرد). اما فرشتگان، خداوند برایشان شهادت داده است که: «لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ» (از آنچه خدا به آنان امر کرده سرپیچی نمی‌کنند و آنچه را مأمورند انجام می‌دهند). این در رد کسانی است که در حق دو فرشته در بابل سخنانی ناروا گفته‌اند؛ از مفسرانی که تفسیری نامناسب ارائه داده‌اند که شایسته آنان نیست و ظاهر آیه نیز آن را نمی‌دهد. اما انسان بر خداوند متعال جسارت می‌ورزد و درباره او چیزی می‌گوید که شایسته جلالش نیست، پس چگونه درباره فرشتگان نگوید؟ همان‌گونه که انسان در اموری پروردگارش را تکذیب کرد، این گوینده نیز پروردگارش را در سخن او درباره فرشتگان که «لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ» تکذیب کرده است. و در خبر صحیح از رسول خدا (صلی الله علیه و سلم) از خداوند عز و جل آمده است که خداوند عز و جل می‌فرماید: «فرزند آدم مرا تکذیب کرد و شایسته او نبود، و فرزند آدم مرا دشنام داد و شایسته او نبود.» و در خبر نیز آمده است که: «هیچ‌کس بر آزار، صبورتر از خدا نیست.» و او سبحانه به آنان روزی می‌دهد و نیکی می‌کند، در حالی که آنان در حق او چنین صفتی دارند.\n\n### [علت وجوب تکبر ثقلین به جای سایر موجودات]\n\nپس بدان که علت وجوب تکبر ثقلین (جن و انس) به جای سایر موجودات این است که: سایر مخلوقات در ایجادشان، از اسماء الهی، اسماء جبروت، کبریا، عظمت، قهر و عزت بر آنان متوجه شد. پس آنان در زیر این قهر الهی، خوار بیرون آمدند و خداوند هنگام ایجادشان، خود را با این اسماء به آنان شناساند. پس برای کسی که بدین‌گونه خلق شده، ممکن نیست که سر بلند کند یا در نفس خود طعمی از کبریا بر هیچ‌یک از خلق خدا بیابد، چه رسد به کسی که او را خلق کرده است. و خداوند به او شهود داده است که او در قبضه و تحت قهر اوست. و آنان به صورت کشف (الکشف)، پیشانی‌های خود و پیشانی هر جنبنده‌ای را در دست او دیدند، چنانکه در قرآن عزیز آمده است: «مَا مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا» (هیچ جنبنده‌ای نیست مگر اینکه او گیرنده پیشانی اوست). سپس برای تکمیل فرمود: «إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ» (همانا پروردگار من بر راهی راست است). و گرفتن پیشانی نزد عرب، خوار کردن است. این همان چیزی است که عرفاً نزد ما مقرر است. پس کسی که حالش در شهود (الشهود) نظر به پروردگارش، گرفتن پیشانی‌ها به دست اوست و پیشانی خود را جزئی از آن پیشانی‌ها می‌بیند، چگونه با وجود این کشف، عزت یا کبریا بر خالقش از او تصور می‌شود؟\n\nاما ثقلین (جن و انس)، خلقتشان با اسماء لطف، حنان، رأفت، رحمت و تنزل الهی بود. هنگامی که بیرون آمدند، نه عظمت دیدند و نه عزت و نه کبریا، بلکه نفس‌های خود را در وجودشان متکی به رحمت، عطوفت و تنزل دیدند. و خداوند هنگام خروجشان به دنیا، چیزی از جلال و کبریا و عظمت خود را بر آنان آشکار نکرد که آنان را از نفس‌هایشان باز دارد. آیا نمی‌بینی که در آن گرفتن (اخذ) که هنگام ظهورشان برایشان پیش آمد، وقتی به آنان گفت: «أَلَسْتُ بِرَبِّكُمْ» (آیا من پروردگار شما نیستم؟)، آیا کسی از آنان گفت: «بله»؟ نه، به خدا سوگند، بلکه گفتند: «بَالَى» (آری). پس به ربوبیت او اقرار کردند، زیرا در قبضه گیرنده محصور بودند.\n\nپس اگر آنان شهود می‌کردند که پیشانی‌هایشان در دست خداست، شهود عین یا ایمانی مانند شهود عینِ آن گرفتن، حتی یک چشم بر هم زدن خدا را نافرمانی نمی‌کردند. و مانند سایر مخلوقات بودند که: «يُسَبِّحُونَ اللَّيْلَ وَالنَّهَارَ لَا يَفْتُرُونَ» (شب و روز تسبیح می‌گویند و سستی نمی‌کنند). هنگامی که از این اسماء رحمانی ظاهر شدند، گفتند: «ای پروردگار ما، چرا ما را خلق کردی؟» فرمود: «تا مرا بپرستید»، یعنی تا در برابر من خوار باشید. پس نه صفت قهری دیدند و نه جناب عزتی که آنان را خوار کند، به ویژه که به آنان فرمود: «تا شما به سوی من خوار شوید»، و فعل خوار شدن را به خودشان نسبت داد، پس به واسطه آن بر کبرشان افزوده شد. اگر به آنان می‌فرمود: «شما را خلق نکردم مگر برای اینکه خوار کنم»، می‌ترسیدند و بیمناک می‌شدند، زیرا این کلمه قهر است. پس از ترس این کلمه، از نفس خود به سوی خواری می‌شتافتند، همان‌گونه که به آسمان‌ها و زمین فرمود: «ائْتِيَا طَوْعًا أَوْ كَرْهًا» (خواه یا ناخواه بیایید). اگر «کرهاً» (ناخواه) را نمی‌گفت، باز هم کلمه قهر بود، هر جا که بیاید. به همین دلیل گفتیم که هر آنچه غیر از ثقلین است را نیافرید و با آنان جز به صفت قهر و جبروت خطاب نکرد.\n\nهنگامی که به ثقلین درباره علتی که به خاطر آن ایجاد و خلقشان کرد، فرمود، آنان به اسمایی که از آن به وجود آمده بودند، نگریستند. و هیچ اسم الهی در میان آن اسماء ندیدند که مقتضی گرفتن و عقوبت آنان باشد، اگر امر و نهی او را نافرمانی کنند و بر امر او تکبر ورزند. پس اطاعت نکردند و نافرمانی نمودند. پس «وَعَصَى آدَمُ رَبَّهُ» (و آدم پروردگارش را نافرمانی کرد)، و او اولین انسان بود، و ابلیس پروردگارش را نافرمانی کرد. پس مخالفت از این دو اصل در تمام ثقلین جاری شد. پیامبر (صلی الله علیه و سلم) درباره آدم می‌فرماید: هنگامی که آنچه را از عمرش به داوود بخشیده بود، انکار کرد و فراموش نمود، آدم فراموش کرد و ذریه‌اش فراموش کردند، و آدم انکار کرد و ذریه‌اش انکار کردند، «إِلَّا مَن رَّحِمَ رَبُّكَ» (مگر کسی که پروردگارت رحم کند) و او را حفظ نماید. اما این حفظ شدن از تکبر بر خداست، نه از تکبر برخی بر برخی دیگر و بر سایر مخلوقات. هیچ‌کس در ابتدا از آن معصوم نماند. زیرا خداوند خواسته است که «يَتَّخِذَ بَعْضُهُمْ بَعْضًا سُخْرِيًّا» (برخی از آنان، برخی دیگر را به خدمت گیرند). اما هنگامی که خداوند به بنده‌اش عنایت کند، در حالت دوم، توفیق و عنایت به او روزی می‌دهد، پس به آنچه برای آن خلق شده است، یعنی عبادت، ملتزم می‌شود و به سایر مخلوقات می‌پیوندد، و این بسیار نادر است. و کجاست بنده‌ای که در نفس خود، با هر نَفَسش، پیوسته بنده خدا باشد؟ پس هیچ‌یک از ثقلین خوار نمی‌شود، مگر به واسطه قهری که می‌یابد، و در خواری خود مجبور است. هنگامی که آن را یافت، در آن هنگام به اسمایی که از آن به وجود آمده است، یعنی اسماء رحمت، روی می‌آورد و آن‌ها را می‌طلبد تا تنگی و حرجی را که به آن عادت نکرده است، از او برطرف سازند. پس به سوی آن جهت اشتیاق می‌ورزد و می‌داند که آن اسماء قدرت و سلطانی دارند، پس آنچه را از آن می‌یابد، از او گشایش می‌دهد.\n\n### [نَفَس رحمان از سوی یمن]\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «نَفَس رحمان»؛ پس به اسمی اشاره کرد که ثقلین با آن خلق شده‌اند. و جهت قوت را با آن قرین ساخت و فرمود: «از سوی یمن». و «قِبَل» به معنای ناحیه و جهت است، و «یُمن» از «یَمین» (دست راست) است که به معنای قوت است. شاعر گفته است:\n\n> إذا ما راية رفعت لمجد *** تلقاها عرابة باليمين‏\n>\n> (هرگاه پرچمی برای مجد برافراشته شود، عرابه آن را با یمین (قوت) دریافت می‌کند.)\n\nمنظور او قوت است، زیرا یمین جایگاه قوت است. و «السَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ» (آسمان‌ها در دست راست او درهم پیچیده شده‌اند). و همچنین بود که چون اسم «الرحمن» که از آن به وجود آمده بود، به او نگریست، پیروزی به دست انصار (یاوران) حاصل شد.\n\n### [رحمت خدا بر غضبش پیشی گرفته است]\n\nو همچنین سخن او: «يَوْمَ نَحْشُرُ الْمُتَّقِينَ» (روزی که پرهیزگاران را محشور می‌کنیم). زیرا متقی (پرهیزگار) کسی است که محتاط، ترسان و بیمناک است. و هیچ‌کس نیست که رحمان، رحیم و رؤوف را شهود کند و از او بپرهیزد. بلکه مشهود متقی، سریع‌الحساب، شدیدالعقاب، متکبر و جبار است. پس پرهیز می‌کند و می‌ترسد. پس خداوند متعال او را ایمن می‌سازد به اینکه او را به سوی رحمان محشور می‌کند، تا از سطوت جبار و قهار در امان باشد. و به همین دلیل خداوند متعال درباره ما فرمود که رحمتش بر غضبش پیشی گرفته است. زیرا ما را با رحمت ایجاد کرد، نه با صفت قهر. و همچنین نافرمانی به تأخیر افتاد، پس غضب نیز در ثقلین از رحمت به تأخیر افتاد. پس خداوند حکم آن دو را در آخرت نیز چنین قرار می‌دهد، هرچند پس از مدتی باشد.\n\nآیا نمی‌بینی که خداوند متعال هنگامی که اسماء خود را برای ما ذکر می‌کند، با اسماء رحمت آغاز می‌کند و اسماء کبریا را به تأخیر می‌اندازد، زیرا ما آن‌ها را نمی‌شناسیم؟ هنگامی که اسماء رحمت را برای ما پیش می‌آورد، آن‌ها را می‌شناسیم و به سوی آن‌ها مشتاق می‌شویم. در آن هنگام، اسماء کبریا را به دنبال آن می‌آورد تا ما آن‌ها را به حکم تبعیت بپذیریم. پس خداوند متعال فرمود: «هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ» (او خدایی است که جز او معبودی نیست، دانای نهان و آشکار است). این وصفی است که همه را در بر می‌گیرد و هیچ‌یک از وحدت آن بر دیگری برتری ندارد. سپس آغاز کرد و فرمود: «هُوَ الرَّحْمَنُ الرَّحِيمُ» (او رحمان و رحیم است). پس رحمان و رحیم را به ما شناساند، زیرا ما از او به وجود آمده‌ایم. سپس بعد از آن، دوباره با «هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ» آغاز کرد تا آن را فصلی میان رحمان و رحیم و عزیز، جبار و متکبر قرار دهد. پس فرمود: «الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ» (پادشاه، پاک، سلام، مؤمن). و این همه از اوصاف رحمان است. سپس آمد و فرمود: «الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ» (عزیز، جبار، متکبر). پس ما این اوصاف را پذیرفتیم، بعد از آنکه با اسماء لطف و حنان مأنوس شدیم. و اسماء مشترکی که یک وجهشان به رحمت و وجه دیگرشان به کبریاست، و آن «الله» و «الملک» است. هنگامی که اسماء عظمت را آورد، در حالی که محل (قلب) به واسطه توالی اسماء کثیر موجب رحمت مأنوس شده بود، اسماء عظمت را پذیرفتیم، زیرا دیدیم که اسماء رحمت آن‌ها را پذیرفته‌اند، چرا که اوصافی برای آن‌ها بودند. پس ما نیز آن‌ها را به طور ضمنی و به تبع اسماء خودمان پذیرفتیم. سپس چون خداوند دانست که صاحب قلب و علم به خدا و مواضع خطاب او، هنگامی که اسماء عظمت را می‌شنود، ناگزیر اثر ترس و قبض در او تأثیر می‌گذارد، بعد از آن، آن‌ها را وصف کرد و به دنبالشان اسمایی آورد که نه مطلقاً به رحمت اختصاص دارند و نه مطلقاً از عظمت خالی‌اند. پس فرمود: «هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاءُ الْحُسْنَى» (او خدای خالق، آفریننده، صورت‌بخش است. اسماء حسنی از آن اوست). و این همه، تعلیم خداوند به بندگانش و تنزل او به سوی آنان است.\n\n### [بسم الله الرحمن الرحیم سلیمانی در سوره نمل، تکمیل‌کننده سوره توبه]\n\nپس منازل اصحاب این باب، همین اسماء مذکور و حضرات آن‌هاست. و به همین دلیل، خداوند سبحانه در کتاب خود، «بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ» را در ابتدای هر سوره مقدم داشت. زیرا سوره‌ها حاوی اموری ترسناک هستند که اسماء عظمت و اقتدار را می‌طلبند، پس اسماء رحمت را برای انس دادن و بشارت، مقدم داشت. و به همین دلیل درباره سوره توبه گفته‌اند که آن و سوره انفال یک سوره هستند، زیرا با بسمله از هم جدا نشده‌اند. و در این باره، اختلافی منقول میان علمای این فن از صحابه وجود دارد. و چون خداوند متعال می‌دانست که چه اختلافی در این امت در مورد حذف بسمله از سوره برائت (توبه) رخ خواهد داد، پس کسی که معتقد بود سوره توبه سوره‌ای مستقل است و قرآن نزد او صد و سیزده سوره داشت، به صد و سیزده بسمله نیاز داشت. خداوند در سوره نمل بسمله‌ای را برای آنان آشکار کرد تا عدد کامل شود، و آن را دقیقاً همان‌گونه که در اوایل سوره‌ها آمده است، آورد. زیرا زبان سلیمان (علیه السلام) عربی نبود، بلکه زبان دیگری بود. پس او لفظ این کلمات را در نامه‌اش ننوشت، بلکه کلمه‌ای به زبان خود نوشت که معنای آن در زبان عربی، هنگامی که از آن تعبیر شود، «بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ» است. و آن را با حذف الف آورد، همان‌گونه که در اوایل سوره‌ها آمده است، تا دانسته شود که مقصود از آن، همان مقصود در اوایل سوره‌هاست. و این کار را در «بِسْمِ اللَّهِ مَجْرَاهَا» (به نام خدا، روان شدن آن) و «اقْرَأْ بِاسْمِ رَبِّكَ» (بخوان به نام پروردگارت) انجام نداد، بلکه الف را در آنجا ثابت نگه داشت تا میان اسم بسمله و غیر آن تفاوت بگذارد.\n\n### [سوره توبه، سوره رحمت است]\n\nو به همین دلیل، سوره توبه بسیاری از صفات رحمت و تنزل الهی را در بر دارد. زیرا در آن، خریدن جان‌های مؤمنان توسط خداوند از خودشان است، «بِأَنَّ لَهُمُ الْجَنَّةَ» (به بهای اینکه بهشت از آنِ ایشان است). و کدام تنزل عظیم‌تر از این است که آقا، ملک خود را از بنده‌اش بخرد؟ و آیا در رحمت، بلیغ‌تر از این می‌تواند باشد؟ پس ناگزیر باید توبه و انفال یک سوره باشند، یا بسمله سلیمانی سوره نمل، برای سوره توبه باشد. سپس به نام آن بنگر: سوره توبه. و توبه، رحمت را می‌طلبد، نه بیزاری را. و اگرچه خداوند عز و جل با بیزاری آغاز کرد، اما با آیه‌ای ختم نمود که نیامده و یافت نشده است، مگر نزد کسی که خداوند شهادت او را شهادت دو مرد قرار داده است. اگر عقل داشته باشی، خواهی دانست که چه رحمتی در این سوره نهفته است. به ویژه در سخن خداوند متعال: «وَمِنْهُمْ» (و از ایشان) و «وَمِنْهُمْ» (و از ایشان). و این همه رحمت به ماست تا از افتادن در آن و متصف شدن به آن صفات برحذر باشیم. زیرا قرآن بر ما نازل شده است. پس هیچ سوره‌ای از قرآن در حق ما رحمتی عظیم‌تر از این سوره در بر ندارد. زیرا بسیاری از اموری را که مؤمن باید از آن‌ها بپرهیزد و اجتناب کند، زیاد ذکر کرده است. اگر حق (الحق) تعالی ما را به آن‌ها نمی‌شناساند، شاید در آن‌ها می‌افتادیم و آگاه نمی‌شدیم. پس این سوره، سوره رحمت برای مؤمنان است.\n\n### [مردان نَفَس رحمان]\n\nو اکنون که تو را به منازل آن شناساندیم، بدان که مردان آن، هر کسی از اهل الله (اهل حق) هستند که حالش مانند حال کسی باشد که اسماء جبروتی از تمام عالم علوی و سفلی او را احاطه کرده باشد. پس از او پناه بردن و تضرع به اسماء رحمت سر می‌زند، و اسم «الرحمن» که اسماء حسنی از آن اوست و با آن بر عرش استوا (استقرار) یافته است، بر او تجلی (التجلی) می‌کند. پس اقتدار الهی را به او می‌بخشد و با آن، آثار اسماء قهری را محو می‌کند، و میدان برای او گشاده می‌شود. پس سینه گشاده می‌شود و نَفَس جاری می‌گردد و روح حیات در او جریان می‌یابد. و هیئت‌های اسماء رحمانی و حقایق الهیه با تبریکات و بشارت‌ها به سوی او می‌آیند. پس هر کس حالش چنین باشد و آن را از نفس خود به صورت ذوق (تجربه عرفانی) بشناسد، او از مردان این مقام است، پس نباید خود را فریب دهد. و هر انسانی به حال خود داناتر است، و اینکه خود را نزد مردم در جایگاهی قرار دهی که در واقعیت (نفس الأمر) از آن تو نیست، سودی به تو نمی‌رساند. تو را نصیحت کردم و راه این قوم را برایت آشکار ساختم، پس از جاهلان به آنچه تو را شناساندیم، مباش. «وَاعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ» (و پروردگارت را بپرست تا یقین به تو رسد). پس «إِنَّ اللَّهَ لَا يَخْفَى عَلَيْهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ» (همانا هیچ چیز در زمین و نه در آسمان بر خدا پوشیده نیست). و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 5
}