{
  "id": 268,
  "title": {
    "ar": "الباب الثامن والستون ومائتان في معرفة الروح",
    "en": "Chapter Two Hundred and Sixty-Eight: Concerning the Knowledge (المعرفة) of the Spirit (الروح).",
    "ur": "باب نمبر دو سو اڑسٹھ روح کی معرفت میں",
    "fa": "باب دویست و شصت و هشتم در معرفت روح"
  },
  "content": {
    "ar": "## «الباب الثامن والستون ومائتان في معرفة الروح»\n\n\nوهو الملقي إلى القلب علم الغيب على وجه مخصوص»\n\n\n> الروح روحان روح الياء والأمر *** والحكم يثبت بين النهي والأمر\n\n\n> وما سواه فأخبار منبئة *** أن الكوائن بين السر والجهر\n\n\n> وعالم البرزخ الأعلى يخلصه *** عناية حاله من قبضة الأسر\n\n\nقال تعالى وكَذلِكَ أَوْحَيْنا إِلَيْكَ رُوحاً من أَمْرِنا وقال يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ وقال نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ لِتَكُونَ من الْمُنْذِرِينَ فذكر الإنذار وهكذا في قوله يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ لِيُنْذِرَ وكذلك\n\n\nيُنَزِّلُ الْمَلائِكَةَ بِالرُّوحِ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ أَنْ أَنْذِرُوا فما جاء إلا بالإعلام وفيه ضرب‏\nمن الزجر حيث ساق الإعلام بلفظة الإنزال فهو إعلام بزجر فإنه البشير النذير والبشارة لا تكون إلا عن إعلام فغلب في الإنزال الروحاني باب الزجر والخوف لما قام بالنفوس من الطمأنينة الموجبة إرسال الرسل ليعلموهم أنهم عن الدنيا إلى الآخرة منقلبون وإلى الله من نفوسهم راجعون وأما قولنا روح الياء فأردنا قوله ونَفَخْتُ فِيهِ من رُوحِي بياء الإضافة إلى نفسه ينبهه على مقام التشريف أي أنك شريف الأصل فلا تفعل إلا بحسب أصلك لا تفعل فعل الأراذل وروح الأمر قوله ويَسْئَلُونَكَ عَنِ الرُّوحِ أي من أين ظهر فقيل له قُلِ الرُّوحُ من أَمْرِ رَبِّي فما كان سؤالا عن الماهية كما زعم بعضهم فإنهم ما قالوا ما الروح وإن كان السؤال بهذه الصيغة محتملا ولكن قوي الوجه الذي ذهبنا إليه في السؤال ما جاء في الجواب من قوله من أَمْرِ رَبِّي ولم يقل هو كذا فعلوم الغيب تنزل بها الأرواح على قلوب العباد فمن عرفهم تلقاهم بالأدب وأخذ منهم بالأدب ومن لم يعرفهم أخذ علم الغيب ولا يدري ممن كالكهنة وأهل الزجر وأصحاب الخواطر وأهل الإلهام يجدون العلم بذلك في قلوبهم ولا يعرفون من جاءهم به وأهل الله يشاهدون تنزل الأرواح على قلوبهم ولا يرون الملك النازل إلا أن يكون المنزل عليه نبيا أو رسولا فالولي يشهد الملائكة ولكن لا يشهدها ملقية عليه أو يشهدون الإلقاء ويعلمون أنه من الملك من غير شهود فلا يجمع بين رؤية الملك والإلقاء منه إليه إلا نبي أو رسول وبهذا يفترق عند القوم وبتميز النبي من الولي أعني النبي صاحب الشرع المنزل وقد أغلق الله باب التنزل بالأحكام المشروعة وما أغلق باب التنزل بالعلم بها على قلوب أوليائه وأبقى لهم التنزل الروحاني بالعلم بها ليكونوا على بصيرة في دعائهم إلى الله بها كما كان من اتبعوه وهو الرسول ولذلك قال أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي فهو أخذ لا يتطرق إليه تهمة عندهم ولهذا قال القشيري في الثناء على علم أهل الله ما ظنك بعلم علم العلماء فيه تهمة لأن غيرهم من العلماء ما هم على بصيرة لا في الفروع ولا في الأصول أما في الفروع فللاحتمال في التأويل وأما في الأصول فلما يتطرق إلى الناظر صاحب الدليل إلى دليله من الدخل عليه فيه والشبه من نفسه أو من نفس غيره فيتهم دليله لهذا الدخل وقد كان يقطع به وأهل البصائر من الله لا يتصفون بهذا في علمهم وذلك العلم هو حق اليقين أي حق استقراره في القلب أن لا يزلزله شي‏ء عن مقره وهذا القدر كاف في علم الروح الملقي وأما كيفية الإلقاء فموقوفة على الذوق وهو الحال ولكن أعلمك أنه بالمناسبة لا بد أن يكون قلب الملقي إليه مستعدا لما يلقى إليه ولولاه ما كان القبول وليس الاستعداد في القبول وإنما ذلك اختصاص إلهي نعم قد تكون النفوس تمشي على الطريق الموصلة إلى الباب الذي يكون منه إذا فتح هذا الإلقاء الخاص وغيره فإذا وصلوا إلى هذا الباب وقفوا حتى يروا بما ذا يفتح في حقهم فإذا فتح خرج الأمر واحد العين وقبله من خلف الباب بقدر استعدادهم الذي لا تعمل لهم فيه بل اختص الله كل واحد باستعداد وهناك تتميز الطوائف والأتباع من غير الأتباع والأنبياء من الرسل والرسل من الأتباع المسلمين في العرف أولياء فيتخيل من لا علم له أن سلوكهم إلى الباب سبب به وقع الكسب لما حصل لهم عند الفتح ولو كان ذلك لتساوى الكل وما تساوى فما كان ذلك إلا بالاستعداد الذي هو غير مكتسب ومن هنا أخطأ من قال باكتساب النبوة من النظار ولا يقول باكتسابها إلا من يرى أنها ليست من الله وإنما هي فيض من العقل والأرواح العلوية على بعض النفوس المنعوتة بالصفاء والتخلص من أسباب الطبيعة فانتقش فيها صور ما في العالم لصفائها وصفاؤها مكتسب فما حصله صفاؤها فهو مكتسب وهذا غلط بل الصفاء صحيح ونقش صور ما في العالم صحيح في نفس من لها هذه الصفة من الاطلاع وكون هذا الشخص دون غيره من أهل الصفاء مثله رسولا ونبيا وصاحب تشريع دون غيره اختصاص إلهي ينقشه في نفسه ما في صور العالم فإن اللوح المحفوظ هو العام لما ذكرناه ففيه منقوش صورة الرسول ورسالته وصورة النبي‏\n\n\nونبوته وصورة الولي وولايته فإذا صفت النفس وانتقش فيها ما في اللوح لم يلزم أن يكون رسولا بل انتقش فيها من يكون رسولا وتميزت الأشياء عندها وهذا خلاف ما توهموه مما يحصل بصفاء النفوس فانتقشت فيها المراتب وأصحابها علوا وسفلا وأما حكم الاستعداد الذي يقبل الإلقاء بالمناسبة التي هي الحبل الإلهي الحاصل في القلب الموجود بالاستعداد إذا اتصل بحضرة الحق نزل الإلقاء عليه وهو الطريق فيتنور القلب بما حصل فيه من علم الغيب ولا سيما إذا\nكان من العلم بالله الذي لا تعلق له بالكون كالعلم بأنه غني عن العالمين وبتنزيهه عن الأوصاف وب لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ ومثال الاستعداد والتنزل والحبل المتصل مثل الفتيلة إذا بقي فيها النار خرج من ذلك النار شبه دخان يطلب الصعود بطبعه إلى فوق ويكون هناك سراج موقد فيضع الفتيلة الخارج منها الدخان تحت السراج وعلى سمته بحيث يتصل ذلك الدخان بسرعة فيتصل برأس الفتيلة فتتقد الفتيلة فتظهر صورة السراج المنير الذي منه نزل النور إليها وينظر هل انتقص من السراج شي‏ء أو هل حل منه فيه شي‏ء فلا تجد مع وجود الصورة كأنه هو فمن علم سر هذا علم معنى‏\n\n\nقوله إن الله خلق آدم على صورته‏\n\n\nوعلم إن الاستعداد إذا كان على المقابلة وصحة المناسبة وتعلقت الهمة الخاصة به أنه ينزل عليه بحسب ذلك ويكون النور الحاصل في الفتيلة في العظم الجرمي والصغر بحسب كبر جرمها وصغره وتكون إضاءته بحسب صفائها وصفاء دهنها وتكون إقامته فيها بحسب كثرة دهنها وقلته فإنه الممد لبقائه فإن فهمت ما قلناه في هذا التشبيه فقد علمت علما لا يعلمه إلا العلماء بالله وتحققت إلقاء الروح على القلب علم الغيب كيف يكون وأي قلب يقبل ذلك وما يكون عليه من الصفات وتعلم أن همة الأدنى تؤثر في الأعلى إذا تعلقت به كما وقع الجواب من الله للعبد إذا دعاه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Sixty-Eight: Concerning the Knowledge of the Spirit\n\nAnd it is that which casts the Knowledge of the Unseen (علم الغيب) into the Heart (القلب) in a specific manner.\n\n> The Spirit (الروح) is two spirits: the Spirit of the *Yā’* and the Spirit of the Command (الأمر) *** And the ruling is established between the prohibition and the command.\n> And what is other than that are informing reports *** That the existents are between the secret and the manifest.\n> And the higher World of the Isthmus (عالم البرزخ الأعلى) is purified *** By the providence of its state from the grip of captivity.\n\nThe Exalted said: <<وَكَذلِكَ أَوْحَيْنا إِلَيْكَ رُوحاً من أَمْرِنا>> (Thus have We revealed to you a Spirit [روحاً] of Our Command [أَمْرِنا]). And He said: <<يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ>> (He casts the Spirit [الرُّوحَ] by His Command [أَمْرِهِ] upon whomever He wills of His servants). And He said: <<نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ لِتَكُونَ من الْمُنْذِرِينَ>> (The Trustworthy Spirit [الرُّوحُ الْأَمِينُ] has descended with it upon your heart [قَلْبِكَ], that you may be one of the warners).\n\nThus, He mentioned warning (الإنذار). Likewise, in His saying: <<يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ لِيُنْذِرَ>> (He casts the Spirit by His Command upon whomever He wills of His servants, that he may warn). And similarly: <<يُنَزِّلُ الْمَلائِكَةَ بِالرُّوحِ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ أَنْ أَنْذِرُوا>> (He sends down the angels with the Spirit by His Command upon whomever He wills of His servants, [saying]: Warn!).\n\nTherefore, it comes only with announcement (الإعلام), and within it is a form of restraint, since He conveyed the announcement using the word of descent (الإنزال). It is an announcement coupled with restraint, for He is the Bearer of Good Tidings and the Warner (البشير النذير), and good tidings are only based on announcement. Thus, in the spiritual descent (الإنزال الروحاني), the aspect of restraint and fear predominates, due to the complacency that has settled in the souls, necessitating the sending of Messengers to inform them that they are turning away from this world toward the Hereafter, and that they are returning to God from their own selves.\n\nAs for our saying, \"the Spirit of the *Yā’*,\" we intended His saying: <<وَنَفَخْتُ فِيهِ من رُوحِي>> (And I breathed into him of My Spirit), with the *yā’* of attribution to Himself, alerting the recipient to the station of honor (التشريف), meaning: \"You are noble in origin, so act only according to your origin; do not act like the base.\"\n\nAnd the Spirit of the Command (روح الأمر) is His saying: <<وَيَسْئَلُونَكَ عَنِ الرُّوحِ>> (And they ask you concerning the Spirit), meaning: from where did it manifest? So it was said to him: <<قُلِ الرُّوحُ من أَمْرِ رَبِّي>> (Say: The Spirit is of the Command [أَمْرِ] of my Lord). The question was not about the quiddity (الماهية), as some have claimed, for they did not ask, \"What is the Spirit?\" even though the question in this form is possible. However, the view we have adopted is strengthened by the answer, which states: <<من أَمْرِ رَبِّي>> (of the Command of my Lord), and did not say, \"It is such-and-such.\"\n\nThe Spirits descend with the Knowledge of the Unseen (علوم الغيب) upon the hearts of the servants. Whoever knows them receives them with spiritual etiquette (الأدب) and takes from them with etiquette. Whoever does not know them receives the Knowledge of the Unseen but does not know from whom, such as soothsayers, those who practice divination, those with passing thoughts (أصحاب الخواطر), and the people of inspiration (أهل الإلهام); they find that knowledge in their hearts but do not know who brought it to them.\n\nThe People of God (أهل الله) witness the descent of the Spirits upon their hearts, but they do not see the descending Angel (الملك النازل) unless the recipient is a Prophet or a Messenger. The Saint (الولي) witnesses the angels, but he does not witness them casting the message upon him, or they witness the casting and know that it is from the Angel without witnessing the Angel. Thus, only a Prophet or a Messenger combines the vision of the Angel and the casting from the Angel to him. By this, the Prophet is distinguished from the Saint among the People [of God]—meaning the Prophet who brings a revealed Law (الشرع المنزل).\n\nGod has closed the door of descent with prescribed rulings (الأحكام المشروعة), but He has not closed the door of descent with the knowledge of those rulings upon the hearts of His saints (أوليائه). He has preserved for them the spiritual descent (التنزل الروحاني) with the knowledge of those rulings so that they may possess insight (بصيرة) in their calling to God with them, just as the Messenger, whom they follow, possessed. That is why He said: <<أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي>> (I call to Allah upon insight, I and those who follow me). This is a reception of knowledge that is free from suspicion (تهمة) in their view.\n\nFor this reason, Al-Qushayri said, in praise of the knowledge of the People of God: \"What do you think of a knowledge in which the knowledge of the scholars is subject to suspicion?\" This is because other scholars do not possess insight, neither in the particulars (Furu') nor in the fundamentals (Usul). As for the particulars, it is due to the possibility of interpretation (التأويل). As for the fundamentals, it is due to the potential intrusion (الدخل) and doubts (الشبه) that may affect the rational investigator (الناظر) regarding his proof, either from himself or from others, leading him to suspect his proof, even though he was previously certain of it.\n\nThe People of Insight (أهل البصائر) from God are not characterized by this in their knowledge. That knowledge is the Reality of Certainty (حق اليقين)—that is, the reality of its stability in the heart such that nothing can shake it from its place. This much is sufficient concerning the knowledge of the Spirit that casts the message.\n\nAs for the manner of casting (كيفية الإلقاء), it depends on spiritual taste (الذوق), which is the spiritual state (الحال). However, I inform you that, due to suitability (المناسبة), the heart of the recipient must necessarily be prepared (مستعدا) for what is cast into it; otherwise, acceptance would not occur. This preparedness is not in the acceptance itself, but rather it is a Divine specialization (اختصاص إلهي).\n\nYes, souls may travel the path leading to the door from which this specific casting, and others, occurs when it is opened. When they reach this door, they wait until they see by what means it will be opened for them. When it is opened, the matter emerges, one in essence, and they receive it from behind the door according to their preparedness (استعدادهم), in which they have no agency, but rather God has specialized each one with a preparedness.\n\nIt is here that the groups are distinguished: the followers from the non-followers, the Prophets from the Messengers, and the Messengers from the followers who are saints (أولياء) in the common usage. Thus, those who lack knowledge imagine that their journeying to the door was the cause by which acquisition (الكسب) occurred for what they received upon the opening. If that were the case, everyone would be equal, but they are not. This was only due to the Preparedness (الاستعداد) which is not acquired.\n\nFrom this point, those rational investigators (النظار) who claimed the acquisition of prophethood erred. No one claims its acquisition except those who believe it is not from God, but rather an emanation (فيض) from the Intellect and the celestial Spirits upon certain souls characterized by purity and freedom from the causes of nature, so that the forms of what is in the World (العالم) are inscribed upon them due to their purity, and their purity is acquired. Thus, what their purity achieves is acquired. This is a mistake.\n\nRather, purity is true, and the inscription of the forms of what is in the World is true in the soul that possesses this quality of observation. However, the fact that this person, and not another person of similar purity, is a Messenger, a Prophet, and a bringer of Law (صاحب تشريع) is a Divine specialization (اختصاص إلهي). He inscribes in his soul what is in the forms of the World, for the Preserved Tablet (اللوح المحفوظ) encompasses what we have mentioned. In it is inscribed the form of the Messenger and his message, the form of the Prophet and his prophecy, and the form of the Saint and his sainthood.\n\nWhen the soul is purified and what is in the Tablet is inscribed upon it, it is not necessarily a Messenger; rather, the form of the one who *is* a Messenger is inscribed upon it, and things are distinguished in its view. This is contrary to what they imagined concerning what is achieved by the purity of souls. Thus, the Levels (المراتب) and their possessors, high and low, are inscribed upon it.\n\nAs for the ruling of Preparedness (الاستعداد) that accepts the casting by suitability (المناسبة)—which is the Divine Cord (الحبل الإلهي) present in the heart by virtue of Preparedness—when it connects to the Divine Presence (حضرة الحق), the casting descends upon it, and this is the path. The heart is illuminated by the Knowledge of the Unseen (علم الغيب) that settles within it, especially if it is knowledge concerning God that has no connection to the cosmos, such as the knowledge that He is independent of the worlds, and the knowledge of His transcendence from attributes, and of <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him).\n\nThe example of Preparedness, Descent, and the Connecting Cord is like a wick (الفتيلة) that still holds fire; smoke emerges from it, naturally seeking to ascend upwards. If a lit lamp (سراج موقد) is placed above it and directly in line with it, the smoke quickly connects to the head of the wick, causing the wick to ignite. The image of the illuminating lamp, from which the light descended to it, then appears. If one examines whether anything was diminished from the lamp or whether anything from it entered the wick, one finds nothing, yet the image exists as if it were the lamp itself.\n\nWhoever understands the secret of this understands the meaning of His saying: <<إِنَّ اللهَ خَلَقَ آدَمَ عَلَى صُورَتِهِ>> (Indeed, Allah created Adam upon His form).\n\nAnd he knows that if the Preparedness is based on correspondence and sound suitability, and the specific aspiration (الهمة الخاصة) is attached to it, the descent will occur accordingly. The light produced in the wick will be large or small in physical size according to the size of its body, and its illumination will be according to its purity and the purity of its oil, and its duration will be according to the abundance or scarcity of its oil, for the oil is the sustenance (الممد) for its subsistence (بقائه).\n\nIf you have understood what we have said in this analogy, you have attained a knowledge known only to the Gnostics of God (العلماء بالله). You have realized how the casting of the Spirit upon the heart with the Knowledge of the Unseen occurs, which heart accepts that, and what attributes it must possess. You also learn that the aspiration of the lower affects the Higher when it is attached to it, just as the answer comes from God to the servant when he supplicates. <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب دو سو اڑسٹھ (۲۶۸) روح (Rūḥ) کی معرفت (Al-Ma‘rifah) میں\n\nاور یہ (روح) ہی ہے جو ایک مخصوص طریقے پر قلب (Qalb) کی طرف علم الغیب (Unseen Knowledge) القا کرتی ہے۔\n\n> روح (Rūḥ) دو ہیں: روح الیاء اور روح الامر (Rūḥ al-Amr)\n> اور حکم نہی (ممانعت) اور امر (حکم) کے درمیان ثابت ہوتا ہے۔\n> اور جو کچھ اس کے سوا ہے وہ ایسی خبریں ہیں جو بتاتی ہیں\n> کہ تمام کائنات سر (پوشیدگی) اور جہر (ظاہری پن) کے درمیان ہیں۔\n> اور عالم برزخ (Barzakh) اعلیٰ اس کی حالت کی عنایت کو\n> قید کی گرفت سے آزاد کر دیتی ہے۔\n\nاللہ تعالیٰ نے فرمایا: \"اور اسی طرح ہم نے آپ کی طرف اپنے امر (Divine Command) سے ایک روح (Rūḥ) وحی کی\" (وَكَذلِكَ أَوْحَيْنا إِلَيْكَ رُوحاً من أَمْرِنا)۔ اور فرمایا: \"وہ اپنے بندوں میں سے جس پر چاہتا ہے اپنے امر (Divine Command) سے روح (Rūḥ) القا کرتا ہے\" (يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ)۔ اور فرمایا: \"اسے روح الامین (Rūḥ al-Amīn) نے آپ کے قلب (Qalb) پر نازل کیا تاکہ آپ ڈرانے والوں میں سے ہو جائیں\" (نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ لِتَكُونَ من الْمُنْذِرِينَ)۔\n\nپس اس نے ڈرانے (انذار) کا ذکر کیا، اور اسی طرح اس کے اس قول میں بھی ہے: \"وہ اپنے بندوں میں سے جس پر چاہتا ہے اپنے امر (Divine Command) سے روح (Rūḥ) القا کرتا ہے تاکہ وہ ڈرائے\" (يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ لِيُنْذِرَ)۔ اور اسی طرح: \"وہ فرشتوں کو اپنے امر (Divine Command) سے روح (Rūḥ) کے ساتھ اپنے بندوں میں سے جس پر چاہتا ہے نازل کرتا ہے کہ تم ڈراؤ\" (يُنَزِّلُ الْمَلائِكَةَ بِالرُّوحِ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ أَنْ أَنْذِرُوا)۔\n\nپس یہ (روح) صرف خبر دینے (اعلام) کے لیے آئی ہے اور اس میں ایک قسم کی ڈانٹ (زجر) بھی ہے، کیونکہ اس نے خبر دینے کو انزال (نازل کرنے) کے لفظ سے بیان کیا ہے۔ لہٰذا یہ ڈانٹ کے ساتھ خبر دینا ہے۔ کیونکہ وہ (رسول) بشیر (خوشخبری دینے والا) اور نذیر (ڈرانے والا) ہے۔ اور بشارت صرف خبر دینے سے ہی ہوتی ہے۔ پس روحانی انزال (نزول) میں ڈانٹ اور خوف کا پہلو غالب رہا، اس اطمینان کی وجہ سے جو نفوس میں قائم ہو چکا تھا، جس نے رسولوں کو بھیجنا واجب کر دیا تاکہ وہ انہیں بتائیں کہ وہ دنیا سے آخرت کی طرف پلٹنے والے ہیں اور اپنی جانوں سمیت اللہ کی طرف لوٹنے والے ہیں۔\n\nاور جہاں تک ہمارے قول \"روح الیاء\" کا تعلق ہے، تو اس سے ہماری مراد اللہ تعالیٰ کا یہ قول ہے: \"اور میں نے اس میں اپنی روح (Rūḥ) میں سے پھونکا\" (ونَفَخْتُ فِيهِ من رُوحِي)۔ یہاں یاءِ اضافت (ضمیر متکلم) اللہ نے اپنی ذات کی طرف کی ہے تاکہ اسے مقام تشریف پر متنبہ کرے، یعنی تمہاری اصل شریف ہے، لہٰذا تم صرف اپنی اصل کے مطابق ہی عمل کرو، کمینوں والا فعل نہ کرو۔\n\nاور روح الامر (Rūḥ al-Amr) اللہ کا یہ قول ہے: \"اور وہ آپ سے روح (Rūḥ) کے بارے میں پوچھتے ہیں\" (ويَسْئَلُونَكَ عَنِ الرُّوحِ)۔ یعنی یہ کہاں سے ظاہر ہوئی؟ تو انہیں کہا گیا: \"کہہ دیجیے کہ روح (Rūḥ) میرے رب کے امر (Divine Command) سے ہے\" (قُلِ الرُّوحُ من أَمْرِ رَبِّي)۔ پس یہ سوال ماہیت (Essence) کے بارے میں نہیں تھا جیسا کہ بعض لوگوں نے گمان کیا ہے، کیونکہ انہوں نے یہ نہیں کہا تھا کہ روح (Rūḥ) کیا ہے؟ اگرچہ سوال اس صیغے میں بھی احتمال رکھتا ہے، لیکن جس پہلو کی طرف ہم گئے ہیں، اس کی تائید جواب میں آنے والے اس قول سے ہوتی ہے کہ \"میرے رب کے امر (Divine Command) سے ہے\" اور یہ نہیں کہا گیا کہ وہ یہ ہے۔\n\nپس علم الغیب (Unseen Knowledge) کو ارواح (Spirits) بندوں کے قلوب (Qalb) پر نازل کرتی ہیں۔ پس جس نے انہیں پہچانا، اس نے ادب کے ساتھ ان کا استقبال کیا اور ادب کے ساتھ ان سے لیا۔ اور جس نے انہیں نہیں پہچانا، وہ علم الغیب (Unseen Knowledge) تو حاصل کر لیتا ہے لیکن اسے یہ معلوم نہیں ہوتا کہ یہ کس کی طرف سے آیا ہے، جیسے کاہن، اہل زجر (ڈانٹ والے)، اصحاب خواطر (خیالات والے) اور اہل الہام (Inspiration)۔ وہ اس علم کو اپنے قلوب (Qalb) میں پاتے ہیں لیکن یہ نہیں جانتے کہ اسے کون لایا ہے۔\n\nاور اہل اللہ (اللہ والے) ارواح (Spirits) کے اپنے قلوب (Qalb) پر نازل ہونے کا شہود (Ash-Shuhūd) کرتے ہیں، لیکن وہ نازل ہونے والے فرشتے کو نہیں دیکھتے، الا یہ کہ جس پر نازل ہو رہا ہے وہ نبی یا رسول ہو۔ پس ولی فرشتوں کا شہود (Ash-Shuhūd) تو کرتا ہے لیکن انہیں اپنے اوپر القا کرتے ہوئے نہیں دیکھتا، یا وہ القا کا شہود (Ash-Shuhūd) کرتے ہیں اور جانتے ہیں کہ یہ فرشتے کی طرف سے ہے لیکن شہود (Ash-Shuhūd) کے بغیر۔ پس نبی یا رسول کے علاوہ کوئی بھی فرشتے کے دیدار اور اس کے ذریعے القا ہونے کو جمع نہیں کر سکتا۔ اور اسی سے قوم کے نزدیک نبی اور ولی میں فرق ہوتا ہے، یعنی وہ نبی جو صاحب شریعت منزل ہو۔\n\nاور اللہ نے احکام مشروعہ (شرعی احکام) کے ساتھ نزول کا دروازہ بند کر دیا ہے، لیکن اس کے علم کے ساتھ اپنے اولیاء کے قلوب (Qalb) پر نزول کا دروازہ بند نہیں کیا ہے۔ اور ان کے لیے اس علم کے ساتھ روحانی نزول باقی رکھا ہے تاکہ وہ اس کے ذریعے اللہ کی طرف بلانے میں بصیرت (Insight) پر ہوں، جیسا کہ ان کا متبع (پیروی کرنے والا) تھا اور وہ رسول ہیں۔ اسی لیے آپ نے فرمایا: \"میں اللہ کی طرف بصیرت (Insight) پر بلاتا ہوں، میں بھی اور وہ بھی جس نے میری پیروی کی\" (أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي)۔\n\nپس یہ ایسا اخذ (حصول) ہے جس میں ان کے نزدیک کوئی تہمت داخل نہیں ہو سکتی۔ اسی لیے قشیری نے اہل اللہ کے علم کی تعریف میں کہا: \"تمہارا کیا خیال ہے اس علم کے بارے میں جس میں علماء کا علم تہمت زدہ ہوتا ہے؟\" کیونکہ ان کے علاوہ دوسرے علماء نہ فروع میں بصیرت (Insight) پر ہوتے ہیں اور نہ اصول میں۔ فروع میں تو تاویل کے احتمال کی وجہ سے، اور اصول میں اس وجہ سے کہ دلیل کا حامل ناظر اپنی دلیل میں جو دخل (نقص) پاتا ہے، اور جو شبہات اس پر اپنی ذات سے یا کسی دوسرے کی ذات سے وارد ہوتے ہیں، تو وہ اس دخل کی وجہ سے اپنی دلیل پر تہمت لگاتا ہے، حالانکہ وہ اس پر یقین رکھتا تھا۔ لیکن اللہ کی طرف سے بصیرت (Insight) والے اپنے علم میں اس صفت سے متصف نہیں ہوتے۔ اور وہ علم حق الیقین (Ḥaqq al-Yaqīn) ہے، یعنی قلب (Qalb) میں اس کا ایسا استقرار کہ کوئی چیز اسے اس کے مقام سے متزلزل نہ کر سکے۔\n\nاور یہ مقدار روح (Rūḥ) کے القا کرنے والے علم کے لیے کافی ہے۔ اور جہاں تک القا کی کیفیت کا تعلق ہے، تو وہ ذوق (Adh-Dhauq) پر موقوف ہے، اور یہی حال (Spiritual State) ہے۔ لیکن میں تمہیں بتاتا ہوں کہ یہ مناسبت (Affinity) کے ذریعے ہوتا ہے۔ ضروری ہے کہ جس کی طرف القا کیا جا رہا ہے اس کا قلب (Qalb) اس چیز کے لیے مستعد (Prepared) ہو جو اس کی طرف القا کی جا رہی ہے۔ اگر یہ استعداد (Istidad) نہ ہوتی تو قبولیت نہ ہوتی۔ اور استعداد (Istidad) قبولیت میں نہیں ہے، بلکہ یہ ایک الٰہی اختصاص ہے۔\n\nہاں، نفوس اس راستے پر چلتے ہیں جو اس دروازے تک پہنچاتا ہے جہاں سے یہ خاص القا اور دیگر القا ہوتے ہیں جب وہ کھلتا ہے۔ جب وہ اس دروازے پر پہنچتے ہیں تو رک جاتے ہیں یہاں تک کہ وہ دیکھیں کہ ان کے حق میں کس چیز سے کھولا جاتا ہے۔ جب وہ کھلتا ہے تو امر (Divine Command) ایک ہی عین (Essence) کے ساتھ باہر آتا ہے، اور دروازے کے پیچھے سے وہ اسے اپنی استعداد (Istidad) کے مطابق قبول کرتے ہیں، جس میں ان کا کوئی عمل دخل نہیں ہوتا، بلکہ اللہ نے ہر ایک کو ایک خاص استعداد (Istidad) کے ساتھ مختص کیا ہے۔ اور وہیں پر گروہ اور متبعین غیر متبعین سے، انبیاء رسولوں سے، اور رسول عرف میں مسلمان متبعین (جو اولیاء ہیں) سے ممتاز ہوتے ہیں۔\n\nپس وہ شخص جسے علم نہیں ہے، یہ گمان کرتا ہے کہ ان کا دروازے تک سلوک (سفر) ہی وہ سبب ہے جس سے فتح کے وقت انہیں جو کچھ حاصل ہوا وہ کسب (حاصل کیا گیا) ہے۔ اگر ایسا ہوتا تو سب برابر ہو جاتے، حالانکہ وہ برابر نہیں ہوئے۔ پس یہ صرف استعداد (Istidad) کی وجہ سے تھا جو غیر کسبی (غیر حاصل شدہ) ہے۔ اور اسی وجہ سے ان ناظرین (فلسفیوں) نے غلطی کی جنہوں نے نبوت کو کسبی (حاصل شدہ) کہا۔ اور نبوت کو کسبی وہی کہتا ہے جو یہ سمجھتا ہے کہ یہ اللہ کی طرف سے نہیں ہے، بلکہ یہ عقل اور علوی ارواح (Upper Spirits) کی طرف سے بعض نفوس پر فیض ہے جو صفائی اور اسباب طبیعت سے چھٹکارا پانے کی صفت سے متصف ہیں۔ پس ان میں دنیا کی صورتیں ان کی صفائی کی وجہ سے نقش ہو جاتی ہیں، اور ان کی صفائی کسبی (حاصل شدہ) ہے، لہٰذا جو کچھ ان کی صفائی نے حاصل کیا وہ کسبی ہے۔ اور یہ غلط ہے۔\n\nبلکہ صفائی صحیح ہے، اور دنیا کی صورتوں کا نقش ہونا بھی اس نفس میں صحیح ہے جس میں اطلاع کی یہ صفت ہو۔ لیکن یہ شخص اپنے جیسے دوسرے اہل صفاء کے مقابلے میں رسول، نبی، اور صاحب تشریع (قانون ساز) ہو، یہ ایک الٰہی اختصاص ہے جو اس کے نفس میں دنیا کی صورتوں کو نقش کرتا ہے۔ کیونکہ لوح محفوظ (Al-Lauḥ al-Maḥfūẓ) ان تمام چیزوں کے لیے عام ہے جن کا ہم نے ذکر کیا ہے۔ پس اس میں رسول کی صورت اور اس کی رسالت، نبی کی صورت اور اس کی نبوت، اور ولی کی صورت اور اس کی ولایت نقش ہے۔ پس جب نفس صاف ہو جاتا ہے اور اس میں وہ نقش ہو جاتا ہے جو لوح میں ہے، تو یہ ضروری نہیں کہ وہ رسول ہو، بلکہ اس میں یہ نقش ہوتا ہے کہ کون رسول ہو گا، اور چیزیں اس کے نزدیک ممتاز ہو جاتی ہیں۔ اور یہ اس کے خلاف ہے جو انہوں نے گمان کیا کہ نفوس کی صفائی سے حاصل ہوتا ہے، پس اس میں مراتب اور ان کے حاملین علو اور سفلی طور پر نقش ہو جاتے ہیں۔\n\nاور جہاں تک استعداد (Istidad) کے حکم کا تعلق ہے جو مناسبت (Affinity) کے ذریعے القا کو قبول کرتی ہے، جو کہ قلب (Qalb) میں موجود الٰہی رسی (حبل الٰہی) ہے جو استعداد (Istidad) سے حاصل ہوتی ہے، جب یہ ذات حق (Al-Ḥaqq) کی بارگاہ سے متصل ہوتی ہے تو اس پر القا نازل ہوتا ہے، اور یہی راستہ ہے۔ پس قلب (Qalb) اس علم الغیب (Unseen Knowledge) سے منور ہو جاتا ہے جو اس میں حاصل ہوا، خاص طور پر جب وہ علم باللہ (اللہ کا علم) ہو جس کا تعلق کائنات سے نہ ہو، جیسے یہ علم کہ وہ تمام جہانوں سے بے نیاز ہے، اور اس کا اوصاف سے منزہ ہونا، اور یہ کہ \"کوئی چیز اس کے مثل نہیں\" (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)۔\n\nاور استعداد (Istidad)، نزول، اور متصل رسی کی مثال بتی (فتیلہ) کی طرح ہے، جب اس میں آگ باقی رہتی ہے تو اس آگ سے دھواں جیسا کچھ نکلتا ہے جو اپنی طبیعت کے مطابق اوپر کی طرف چڑھنے کی کوشش کرتا ہے۔ اور وہاں ایک روشن چراغ (سراج) ہوتا ہے۔ پس وہ اس بتی کو جس سے دھواں نکل رہا ہے، چراغ کے نیچے اور اس کی سیدھ میں اس طرح رکھتا ہے کہ وہ دھواں تیزی سے متصل ہو جائے اور بتی کے سرے سے جا ملے، تو بتی روشن ہو جاتی ہے اور اس روشن چراغ کی صورت ظاہر ہوتی ہے جس سے نور اس کی طرف نازل ہوا تھا۔ اور اگر دیکھا جائے کہ کیا چراغ میں کوئی کمی آئی یا کیا اس میں سے کوئی چیز اس میں حلول کر گئی؟ تو آپ کو صورت کے موجود ہونے کے باوجود ایسا نہیں ملے گا، گویا کہ وہ (بتی) وہی (چراغ) ہے۔\n\nپس جس نے اس راز کو جان لیا، اس نے اللہ کے اس قول کا معنی جان لیا کہ: \"بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا\" (إن الله خلق آدم على صورته)۔\n\nاور اس نے یہ بھی جان لیا کہ جب استعداد (Istidad) مقابلہ (آمنے سامنے ہونے) اور مناسبت (Affinity) کی صحت پر ہو اور خاص ہمت اس سے متعلق ہو جائے، تو اس پر اسی کے مطابق نزول ہوتا ہے۔ اور بتی میں حاصل ہونے والا نور جسمانی حجم میں بڑا یا چھوٹا اس کے جسم کے بڑے یا چھوٹے ہونے کے مطابق ہوتا ہے۔ اور اس کی روشنی اس کی صفائی اور اس کے تیل کی صفائی کے مطابق ہوتی ہے۔ اور اس کا اس میں قیام اس کے تیل کی کثرت یا قلت کے مطابق ہوتا ہے، کیونکہ تیل ہی اس کے باقی رہنے کا مددگار ہے۔\n\nپس اگر تم نے اس تشبیہ میں ہماری بات کو سمجھ لیا، تو تم نے وہ علم جان لیا جسے صرف علماء باللہ (اللہ کو جاننے والے) ہی جانتے ہیں۔ اور تم نے یہ تحقیق کر لی کہ روح (Rūḥ) کا قلب (Qalb) پر علم الغیب (Unseen Knowledge) کا القا کیسے ہوتا ہے، اور کون سا قلب (Qalb) اسے قبول کرتا ہے، اور اس پر کون سی صفات ہوتی ہیں۔ اور تم یہ بھی جان لو گے کہ ادنیٰ کی ہمت اعلیٰ میں اثر کرتی ہے جب وہ اس سے متعلق ہو جائے، جیسا کہ بندے کے دعا کرنے پر اللہ کی طرف سے جواب آتا ہے۔ اور \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "«باب دویست و شصت و هشتم در معرفت روح»\n\nو آن (روح) است که علم غیب را به وجهی مخصوص بر قلب القا می‌کند.\n\n> روح دو روح است: روحِ یاء و روحِ امر (الروح روحان روح الياء والأمر)\n> و حکم میان نهی و امر ثابت می‌گردد (والحكم يثبت بين النهي والأمر)\n> و آنچه غیر از این است، اخباری است که خبر می‌دهد (وما سواه فأخبار منبئة)\n> که کائنات میان سرّ و جهر قرار دارند (أن الكوائن بين السر والجهر)\n> و عالم برزخ اعلی، عنایت حالش او را (روح) از چنگال اسارت می‌رهاند (وعالم البرزخ الأعلى يخلصه *** عناية حاله من قبضة الأسر)\n\nخداوند متعال می‌فرماید: «و بدین‌سان روحی از امر خویش را به سوی تو وحی کردیم» (وَكَذلِكَ أَوْحَيْنا إِلَيْكَ رُوحاً من أَمْرِنا). و می‌فرماید: «روح (فرمان) را به امر خویش بر هر کس از بندگانش که بخواهد القا می‌کند» (يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ). و می‌فرماید: «روح‌الامین آن را بر قلب تو نازل کرد تا از بیم‌دهندگان باشی» (نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ لِتَكُونَ من الْمُنْذِرِينَ). پس انذار (بیم‌دهی) را ذکر کرد. و همچنین در این قولش: «روح (فرمان) را به امر خویش بر هر کس از بندگانش که بخواهد القا می‌کند تا بیم دهد» (يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ لِيُنْذِرَ). و همچنین: «فرشتگان را با روح (فرمان) به امر خویش بر هر کس از بندگانش که بخواهد نازل می‌کند که: بیم دهید» (يُنَزِّلُ الْمَلائِكَةَ بِالرُّوحِ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ أَنْ أَنْذِرُوا). پس (این نزول) جز با اعلام نیامده است، و در آن نوعی از زجر (بازدارندگی) وجود دارد، زیرا اعلام را با لفظ انزال (نازل کردن) همراه ساخته است. پس این اعلامی است همراه با زجر؛ چرا که او (پیامبر) بشارت‌دهنده و بیم‌دهنده است، و بشارت جز از طریق اعلام نیست. از این رو، در انزال روحانی، باب زجر و خوف غلبه یافته است، به دلیل آرامشی که در نفوس (انسان‌ها) مستقر شده و موجب فرستادن رسولان گشته تا به آنان بیاموزند که از دنیا به آخرت بازگشت می‌کنند و از نفوس خود به سوی خدا رجوع خواهند نمود.\n\nو اما منظور ما از «روحِ یاء»، قول خداوند است: «و از روح خود در او دمیدم» (وَنَفَخْتُ فِيهِ من رُوحِي) که با یاء اضافه به ذات خویش، او را بر مقام تشریف آگاه می‌سازد؛ یعنی تو شریف‌الاصل هستی، پس جز مطابق اصل خود عمل مکن و فعل فرومایگان را انجام مده. و «روحِ امر» قول خداوند است: «و از تو درباره روح می‌پرسند» (وَيَسْئَلُونَكَ عَنِ الرُّوحِ)؛ یعنی از کجا ظاهر شد؟ پس به او گفته شد: «بگو: روح از امر پروردگار من است» (قُلِ الرُّوحُ من أَمْرِ رَبِّي). این سؤال درباره ماهیت (چیستی) نبود، چنانکه برخی گمان کرده‌اند، زیرا آنان نگفتند «روح چیست؟» هرچند سؤال با این صیغه محتمل است. اما وجهی که ما بدان قائل شدیم، به دلیل پاسخی که در آن آمده است: «از امر پروردگار من است» (من أَمْرِ رَبِّي)، تقویت می‌شود، و نفرمود که «آن چنین و چنان است».\n\nپس علوم غیب را ارواح بر قلب‌های بندگان نازل می‌کنند. کسی که آنان را بشناسد، با ادب از ایشان استقبال می‌کند و با ادب از آنان می‌گیرد. و کسی که آنان را نشناسد، علم غیب را می‌گیرد و نمی‌داند از کیست؛ مانند کاهنان، اهل زجر (فال‌گیران)، صاحبان خواطر و اهل الهام که آن علم را در قلب خود می‌یابند، اما نمی‌دانند چه کسی آن را برایشان آورده است. اما اهل الله (اولیاء) نزول ارواح بر قلب‌هایشان را مشاهده می‌کنند، ولی فرشته نازل‌شونده را نمی‌بینند، مگر اینکه کسی که بر او نازل می‌شود، نبی یا رسول باشد. پس ولی (الولي) فرشتگان را شهود می‌کند، اما شهود نمی‌کند که فرشته بر او القا می‌کند، یا القا را شهود می‌کنند و می‌دانند که از فرشته است بدون شهود (رؤیت) فرشته. پس جمع میان رؤیت فرشته و القای او به شخص، جز برای نبی یا رسول میسر نیست. و به این وسیله است که نزد این قوم، نبی از ولی متمایز می‌شود؛ منظورم نبی صاحب شریعت نازل‌شده است.\n\nخداوند باب نزول احکام تشریعی را بسته است، اما باب نزول علم به آن احکام را بر قلب‌های اولیای خود نبسته است و نزول روحانی علم به آن احکام را برایشان باقی گذاشته تا در دعوتشان به سوی خدا بر بصیرت باشند، همان‌گونه که پیروان رسول چنین بودند. به همین دلیل فرمود: «من و هر کس که از من پیروی کند، با بصیرت به سوی خدا دعوت می‌کنیم» (أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي). پس این دریافتی است که نزد آنان هیچ تهمتی به آن راه نمی‌یابد.\n\nو به همین دلیل قشیری در ستایش علم اهل الله (اولیاء) می‌گوید: گمانت درباره علمی که علمای دیگر در آن متهم هستند چیست؟ زیرا علمای دیگر بر بصیرت نیستند، نه در فروع و نه در اصول. اما در فروع، به دلیل احتمال در تأویل (تفسیر) است؛ و اما در اصول، به دلیل دخلی است که از جانب خود یا دیگری در دلیلِ ناظرِ صاحبِ دلیل راه می‌یابد و شبهه ایجاد می‌کند، و به همین دلیل دلیل خود را متهم می‌سازد، در حالی که پیش از آن به آن قطع داشت. اما اهل بصائر از جانب خدا، در علم خود به این امر متصف نمی‌شوند. و آن علم، حق الیقین (حق اليقين) است؛ یعنی حق استقرار آن در قلب به گونه‌ای که هیچ چیز آن را از جایگاهش متزلزل نسازد. این مقدار در علم روحِ القاکننده کافی است.\n\nو اما کیفیت القا، موقوف بر ذوق (الذوق) است که همان حال (الحال) است. اما تو را آگاه می‌سازم که این القا به واسطه مناسبت (المناسبة) است؛ ناگزیر قلب کسی که به او القا می‌شود، باید برای آنچه به او القا می‌گردد، مستعد باشد، و اگر این استعداد نبود، قبولی صورت نمی‌گرفت. و استعداد در قبول نیست، بلکه آن اختصاصی الهی است. آری، ممکن است نفوس در راهی که به بابی می‌رسد که این القای خاص و غیر آن از آنجا صورت می‌گیرد، حرکت کنند. پس چون به این باب رسیدند، توقف می‌کنند تا ببینند به چه چیزی در حقشان گشوده می‌شود. هنگامی که گشوده شد، امر واحدالعین خارج می‌شود و آن را از پشت باب به اندازه استعدادشان که در آن هیچ عملی برایشان نیست، می‌پذیرند؛ بلکه خداوند هر کس را به استعداد خاصی اختصاص داده است. و در آنجاست که طوایف و پیروان از غیر پیروان، و انبیا از رسل، و رسل از پیروان (که در عرف، مسلمان و در حقیقت، اولیاء هستند) متمایز می‌شوند.\n\nپس کسی که علم ندارد، گمان می‌کند که سلوک آنان به سوی باب، سببی است که به واسطه آن، آنچه هنگام گشایش برایشان حاصل شده، کسب شده است. اگر چنین بود، همه مساوی می‌شدند، در حالی که مساوی نیستند. پس این (دریافت) جز به واسطه استعداد غیر اکتسابی نبوده است. و از اینجاست که کسانی از متفکران که قائل به اکتساب نبوت (النبوة) هستند، خطا کرده‌اند. و کسی قائل به اکتساب آن نمی‌شود، مگر کسی که معتقد باشد نبوت از جانب خدا نیست، بلکه فیضی است از عقل و ارواح علوی بر برخی نفوس که به صفا و رهایی از اسباب طبیعت متصف شده‌اند، و به دلیل صفایشان، صور آنچه در عالم است در آن‌ها نقش بسته است، و صفای آن‌ها اکتسابی است، پس آنچه صفایشان حاصل کرده، اکتسابی است. این غلط است. بلکه صفا صحیح است و نقش بستن صور آنچه در عالم است در نفس کسی که این صفت اطلاع را دارد، صحیح است. اما اینکه این شخص، نه دیگری از اهل صفای مانند او، رسول و نبی و صاحب شریعت باشد، اختصاصی الهی است که آنچه در صور عالم است را در نفس او نقش می‌زند. زیرا لوح محفوظ (اللوح المحفوظ) عام است برای آنچه ذکر کردیم؛ پس در آن، صورت رسول و رسالتش، و صورت نبی و نبوتش، و صورت ولی و ولایتش نقش بسته است. پس اگر نفس صفا یابد و آنچه در لوح است در آن نقش بندد، لازم نیست که رسول باشد، بلکه در آن نقش می‌بندد که چه کسی رسول است و اشیاء نزد او متمایز می‌شوند. و این خلاف چیزی است که آنان گمان کرده‌اند که به واسطه صفای نفوس حاصل می‌شود.\n\nپس مراتب و صاحبان آن‌ها، از بالا و پایین، در آن (نفس) نقش بسته‌اند. و اما حکم استعداد که القا را می‌پذیرد، به واسطه مناسبت (المناسبة) است که همان ریسمان الهی (الحبل الإلهي) است که در قلب موجود به واسطه استعداد حاصل می‌شود. هنگامی که به حضرت حق متصل شود، القا بر او نازل می‌گردد و این همان راه است. پس قلب به آنچه از علم غیب در آن حاصل شده، نورانی می‌شود، به ویژه اگر از علم به خدا باشد که تعلقی به کَون (جهان) ندارد، مانند علم به اینکه او بی‌نیاز از جهانیان است، و به تنزیه او از اوصاف، و به اینکه «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ).\n\nو مثال استعداد و تنزل و ریسمان متصل، مانند فتیله‌ای است که اگر آتش در آن باقی بماند، از آن آتش، چیزی شبیه دود خارج می‌شود که طبعاً به بالا صعود می‌کند. و در آنجا چراغی روشن (سراج موقد) وجود دارد. پس فتیله‌ای که دود از آن خارج می‌شود را زیر چراغ و در راستای آن قرار می‌دهد، به طوری که آن دود به سرعت متصل شود و به سر فتیله برسد. پس فتیله شعله‌ور می‌شود و صورت چراغ نورانی که نور از آن به فتیله نازل شده، ظاهر می‌گردد. و اگر بنگری که آیا چیزی از چراغ کاسته شده یا چیزی از آن در فتیله حلول کرده است، با وجود صورت (نور)، چیزی نمی‌یابی، گویی که فتیله همان چراغ است. پس هر کس راز این را بداند، معنای قول خداوند را می‌داند که: «خداوند آدم را بر صورت خویش آفرید» (إن الله خلق آدم على صورته).\n\nو می‌داند که اگر استعداد بر اساس مقابله و صحت مناسبت باشد و همت (الهمة) خاص به آن تعلق گیرد، نزول بر او مطابق آن صورت می‌گیرد. و نور حاصل در فتیله، از نظر بزرگی و کوچکی جسمانی، به اندازه بزرگی و کوچکی جسم آن است، و روشنایی آن به اندازه صفای فتیله و صفای روغن آن است، و بقای آن در فتیله به اندازه کمی و زیادی روغن آن است، زیرا روغن است که بقای آن را امتداد می‌بخشد. اگر آنچه را در این تشبیه گفتیم فهمیدی، علمی را دانسته‌ای که جز عالمان بالله (العلماء بالله) نمی‌دانند، و به حقیقت دریافته‌ای که القای روح بر قلب، علم غیب چگونه است و چه قلبی آن را می‌پذیرد و چه صفاتی باید داشته باشد. و می‌دانی که همت (الهمة) پایین‌تر در بالاتر تأثیر می‌گذارد، اگر به آن تعلق گیرد، همان‌گونه که پاسخ از جانب خدا به بنده هنگام دعا واقع می‌شود. و خداوند «حق را می‌گوید و اوست که راه را هدایت می‌کند» (وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 3
}