{
  "id": 33,
  "title": {
    "ar": "الباب الثالث والثلاثون في معرفة أقطاب النيات وأسرارهم وكيفية أصولهم ويقال لهم النياتيون",
    "en": "Chapter Thirty-Three: Concerning the Gnosis of the Poles of Intentions (أقطاب النيات) and their Mysteries, and the Modality of their Principles, and they are called the Niyyatiyyun (النياتيون)",
    "ur": "باب تینتیسواں: نیتوں کے اقطاب (أقطاب النيات) اور ان کے اسرار کی معرفت میں، اور ان کے اصولوں کی کیفیت میں، اور انہیں النیاتيون (النياتيون) کہا جاتا ہے۔",
    "fa": "باب سی و سوم در معرفت اقطاب نیات و اسرارشان و چگونگی اصولشان و به ایشان نیات‌گرایان (النیاتيون) گفته می‌شود."
  },
  "content": {
    "ar": "## (الباب الثالث والثلاثون في معرفة أقطاب النيات وأسرارهم وكيفية أصولهم ويقال لهم النياتيون)\n\n\n(بسم الله الرحمن الرحيم)\n\n\n> الروح للجسم والنيات للعمل *** تحيا بها كحياة الأرض بالمطر\n\n\n> فتبصر الزهر والأشجار بارزة *** وكل ما تخرج الأشجار من ثمر\n\n\n> كذاك تخرج من أعمالنا صور *** لها روائح من نتن ومن عطر\n\n\n> لو لا الشريعة كان المسك يخجل من *** أعرافها هكذا يقضي به نظري‏\n\n\n> إذا كان مستند التكوين أجمعه *** له فلا فرق بين النفع والضرر\n\n\n> فالزم شريعته تنعم بها سورا *** تحلها صور تزهو على سرر\n\n\n> مثل الملوك تراها في أسرتها *** أو كالعرائس معشوقين للبصر\n\n\n### [النيات والأعمال‏]\n\n\nروينا من حديث رسول الله صلى الله عليه وسلم أنه قال إنما الأعمال بالنيات وإنما لامرئ ما نوى فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها فهجرته إلى ما هاجر إليه‏\n\n\nرواه عمر بن الخطاب رضي الله عنه‏\n\n\n### [النية واحدة من حيث ذاتها مختلفة ومتعددة من حيث منوياتها]\n\n\nاعلم أن لمراعاة النيات رجالا على حال مخصوص ونعت خاص أذكرهم إن شاء الله وأذكر أحوالهم والنية لجميع الحركات والسكنات في المكلفين للأعمال كالمطر لما تنبته الأرض فالنية من حيث ذاتها واحدة وتختلف بالمتعلق وهو المنوي فتكون النتيجة بحسب المتعلق به لا بحسبها فإن حظ النية إنما هو القصد للفعل أو تركه وكون ذلك الفعل حسنا أو قبيحا وخيرا أو شرا ما هو من أثر النية وإنما هو من أمر عارض عرض ميزه الشارع وعينه للمكلف فليس للنية أثر البتة من هذا الوجه خاصة كالماء إنما منزلته أن ينزل أو يسبح في الأرض وكون الأرض الميتة تحيا به أو ينهدم بيت العجوز الفقيرة بنزوله ليس ذلك له فتخرج الزهرة الطيبة الريح والمنتنة والثمرة الطيبة والخبيثة من خبث مزاج البقعة أو طيبها أو من خبث البزرة أو طيبها قال تعالى يُسْقى‏ بِماءٍ واحِدٍ ونُفَضِّلُ بَعْضَها عَلى‏ بَعْضٍ في الْأُكُلِ ثم قال إِنَّ في ذلِكَ لَآياتٍ لِقَوْمٍ يَعْقِلُونَ فليس للنية في ذلك إلا الإمداد كما قال تعالى يُضِلُّ به كَثِيراً ويَهْدِي به كَثِيراً يعني المثل المضروب به في القرآن أي بسببه وهو من القرآن فكما كان الماء سببا في ظهور هذه الروائح المختلفة والطعوم المختلفة كذلك هي النيات سبب في الأعمال الصالحة وغير الصالحة\n\n\n### [الهدى والضلال‏]\n\n\nومعلوم أن القرآن مهداة كله ولكن بالتأويل في المثل المضروب ضل من ضل وبه اهتدى من اهتدى فهو من كونه مثلا لم تتغير حقيقته وإنما العيب وقع في عين الفهم كذلك النية أعطت حقيقتها وهو تعلقها بالمنوي وكون ذلك المنوي حسنا أو قبيحا ليس لها وإنما ذلك لصاحب الحكم فيه بالحسن والقبح وقال تعالى إِنَّا هَدَيْناهُ السَّبِيلَ أي بينا له طريق السعادة والشقاء ثم قال إِمَّا شاكِراً وإِمَّا كَفُوراً هذا راجع للمخاطب المكلف فإن نوى الخير أثمر خيرا وإن نوى الشر أثمر شرا فما أتى عليه إلا من المحل من طيبه أو خبثه يقول الله تعالى وعَلَى الله قَصْدُ السَّبِيلِ أي هذا أوجبته على نفسي كان الله يقول الذي يلزم جانب الحق منكم أن يبين لكم السبيل الموصل إلى سعادتكم وقد فعلت فإنكم لا تعرفونه إلا بإعلامي لكم به وتبييني‏\n\n\n### [طريقا السعادة والشقاء والإيجاب الإلهي‏]\n\n\nوسبب ذلك أنه سبق في العلم إن طريق سعادة العباد إنما هو في سبب خاص وسبب شقائهم أيضا إنما هو في طريق خاص وليس إلا العدول عن طريق السعادة وهو الايمان بالله وبما جاء من عند الله مما ألزمنا فيه الايمان به ولما كان العالم في حال جهل بما في علم الله من تعيين تلك الطريق تعين الإعلام به بصفة الكلام فلا بد من الرسول قال الله تعالى وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا ولا نوجب على الله إلا ما أوجبه على نفسه وقد أوجب التعريف على نفسه بقوله تعالى وعَلَى الله قَصْدُ السَّبِيلِ مثل قوله وكانَ حَقًّا عَلَيْنا نَصْرُ الْمُؤْمِنِينَ وقوله كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ وعلى الحقيقة إنما وجب ذلك على النسبة لا على نفسه فإنه يتعالى أن يجب عليه من أجل حد الواجب الشرعي فكأنه لما تعلق العلم الإلهي أزلا بتعيين الطريق التي فيها سعادتنا ولم يكن للعلم بما هو علم صورة التبليغ وكان‏\nالتبليغ من صفة الكلام تعين التبليغ على نسبة كونه متكلما بتعريف الطريق التي فيها سعادة العباد التي عينها العلم فأبان الكلام الإلهي بترجمته عن العلم ما عينه من ذلك فكان الوجوب على النسبة فإنها نسب مختلفة وكذلك سائر النسب الإلهية من إرادة وقدرة وغير ذلك‏\n\n\n### [الأسماء والذات‏]\n\n\nوقد بينا محاضرة الأسماء الإلهية ومحاورتها ومجاراتها في حلبة المناظرة على إيجاد هذا العالم الذي هو عبارة عن كل ما سوى الله في كتاب عنقاء مغرب بوبنا عليه محاضرة أزلية على نشأة أبدية وكذلك في كتاب إنشاء الجداول والدوائر لنا فقد علمت كيف تعلق الوجوب الإلهي على الحضرة الإلهية إن كنت فطنا لعلم النسب وعلى هذا يخرج قوله تعالى يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً وكيف يحشر إليه من هو جليسه وفي قبضته سمع أبو يزيد البسطامي قارئا يقرأ هذه الآية يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً فبكى حتى ضرب الدمع المنبر بل روى أنه طار الدم من عينيه حتى ضرب المنبر وصاح وقال يا عجبا كيف يحشر إليه من هو جليسه فلما جاء زماننا سألنا عن ذلك فقلت ليس العجب إلا من قول أبي يزيد فاعلموا إنما كان ذلك لأن المتقي جليس الجبار فيتقي سطوته والاسم الرحمن ما له سطوة من كونه الرحمن إنما الرحمن يعطي اللين واللطف والعفو والمغفرة فلذلك يحشر إليه من الاسم الجبار الذي يعطي السطوة والهيبة فإنه جليس المتقين في الدنيا من كونهم متقين وعلى هذا الأسلوب تأخذ الأسماء الإلهية كلها وكذا تجدها حيث وردت في ألسنة النبوات إذا قصدت حقيقة الاسم وتميزه من غيره فإن له دلالتين دلالة على المسمى به ودلالة على حقيقته التي بها يتميز عن اسم آخر فافهم‏\n\n\n### [السماع المطلق والسماع المقيد]\n\n\nواعلم أن هؤلاء الرجال إنما كان سبب اشتغالهم بمعرفة النية كونهم نظروا إلى الكلمة وفيها فعلموا أنها ما ألفت حروفها وجمعت إلا لظهور نشأة قائمة تدل على المعنى الذي جمعت له في الاصطلاح فإذا تلفظ بها المتكلم فإن السامع يكون همه في فهم المعنى الذي جاءت له فإن بذلك تقع الفائدة ولهذا وجدت في ذلك اللسان على هذا الوضع الخاص ولهذا لا يقول هؤلاء الرجال بالسماع المقيد بالنغمات لعلو همتهم ويقولون بالسماع المطلق فإن السماع المطلق لا يؤثر فيهم إلا فهم المعاني وهو السماع الروحاني الإلهي وهو سماع الأكابر والسماع المقيد إنما يؤثر في أصحابه النغم وهو السماع الطبيعي فإذا ادعى من ادعى أنه يسمع في السماع المقيد بالألحان المعنى ويقول لو لا المعنى ما تحركت ويدعي أنه قد خرج عن حكم الطبيعة في ذلك يعني في السبب المحرك فهو غير صادق وقد رأينا من ادعى ذلك من المتشيخين المتطفلين على الطريقة فصاحب هذه الدعوى إذا لم يكن صادقا يكون سريع الفضيحة وذلك أن هذا المدعي إذا حضر مجلس السماع فاجعل بالك منه فإذا أخذ القوال في القول بتلك النغمات المحركة بالطبع للمزاج القابل أيضا وسرت الأحوال أ النفوس الحيوانية فحركت الهياكل حركة دورية لحكم استدارة الفلك وهو أعني الدور مما يدلك على إن السماع طبيعي لأن اللطيفة الإنسانية ما هي عن الفلك وإنما هي عن الروح المنفوخ منه وهي غير متحيزة فهي فوق الفلك فما لها في الجسم تحريك دوري ولا غير دوري وإنما ذلك للروح الحيواني الذي هو تحت الطبيعة والفلك فلا تكن جاهلا بنشأتك ولا بمن يحركك فإذا تحرك هذا المدعي وأخذه الحال ودار أو قفز إلى جهة فوق من غير دور وقد غاب عن إحساسه بنفسه وبالمجلس الذي هو فيه فإذا فرغ من حاله ورجع إلى إحساسه فاسأله ما الذي حركه فيقول إن القوال قال كذا وكذا ففهمت منه معنى كذا وكذا فذلك المعنى حركني فقل له ما حركك سوى حسن النغمة والفهم إنما وقع لك في حكم التبعية فالطبع حكم على حيوانيتك فلا فرق بينك وبين الجمل في تأثير النغمة فيك فيعز عليه مثل هذا الكلام ويثقل ويقول لك ما عرفتني وما عرفت ما حركني فاسكت عنه ساعة فإن صاحب هذه الدعوى تكون الغفلة مستولية عليه ثم خذ معه في الكلام الذي يعطي ذلك المعنى فقل له ما أحسن قول الله تعالى حيث يقول واتل عليه آية من كتاب الله تتضمن ذلك المعنى الذي كان حركه من صوت المغني وحققه عنده حتى يتحققه فيأخذ معك فيه ويتكلم ولا يأخذه لذلك حال ولا حركة ولا فناء ولكن يستحسنه ويقول لقد تتضمن هذه الآية معنى جليلا من المعرفة بالله فما أشد فضيحته في دعواه فقل له يا أخي هذا المعنى بعينه هو الذي ذكرت لي أنه حركك في السماع البارحة لما جاء به القوال في شعره بنغمته الطيبة فلأي معنى سرى فيك الحال البارحة وهذا المعنى موجود فيما قد صغته لك وسقته بكلام الحق تعالى الذي هو أعلى وأصدق وما رأيتك تهتز مع الاستحسان وحصول الفهم وكنت البارحة\nيتخبطك الشَّيْطانُ من الْمَسِّ كما قال الله تعالى وحجبك عن عين الفهم السماع الطبيعي فما حصل لك في سماعك إلا الجهل بك فمن لا يفرق بين فهمه وحركته كيف يرجى فلاحه‏\n\n\n### [الوارد الطبيعي والروحاني والإلهي‏]\n\n\nفالسماع من عين الفهم هو السماع الإلهي وإذا ورد على صاحبه وكان قويا لما يرد به من الإجمال فغاية فعله في الجسم أن يضجعه لا غير ويغيبه عن إحساسه ولا يصدر منه حركة أصلا بوجه من الوجوه سواء كان من الرجال الأكابر أو الصغار هذا حكم الوارد الإلهي القوي وهو الفارق بينه وبين حكم الوارد الطبيعي فإن الوارد الطبيعي كما قلنا يحركه الحركة الدورية والهيمان والتخبط فعل المجنون وإنما يضجعه الوارد الإلهي لسبب أذكره لك وذلك أن نشأة الإنسان مخلوقة من تراب قال تعالى مِنْها خَلَقْناكُمْ وفِيها نُعِيدُكُمْ ومِنْها نُخْرِجُكُمْ وإن كان فيه من جميع العناصر ولكن العنصر الأعظم التراب قال عز وجل فيه أيضا إِنَّ مَثَلَ عِيسى‏ عِنْدَ الله كَمَثَلِ آدَمَ خَلَقَهُ من تُرابٍ والإنسان في قعوده وقيامه بعد عن أصله الأعظم الذي منه نشأ من أكثر جهاته فإن قعوده وقيامه وركوعه فروع فإذا جاءه الوارد الإلهي وللوارد الإلهي صفة القيومية وهي في الإنسان من حيث جسميته بحكم العرض وروحه المدبر هو الذي كان يقيمه ويقعده فإذا اشتغل الروح الإنساني المدبر عن تدبيره بما يتلقاه من الوارد الإلهي من العلوم الإلهية لم يبق للجسم من يحفظ عليه قيامه ولا قعوده فرجع إلى أصله وهو لصوقه بالأرض المعبر عنه بالاضطجاع ولو كان على سرير فإن السرير هو المانع له من وصوله إلى التراب فإذا فرغ روحه من ذلك التلقي وصدر الوارد إلى ربه رجع الروح إلى تدبير جسده فأقامه من ضجعته هذا سبب اضطجاع الأنبياء على ظهورهم عند نزول الوحي عليهم وما سمع قط عن نبي أنه تخبط عند نزول الوحي هذا مع وجود الواسطة في الوحي وهو الملك فكيف إذا كان الوارد برفع الوسائط لا يصح أن يكون منه قط غيبة عن إحساسه ولا يتغير عن حاله الذي هو عليه فإن الوارد الإلهي برفع الوسائط الروحانية يسرى في كلية الإنسان ويأخذ كل عضو بل كل جوهر فرد فيه حظه من ذلك الوارد الإلهي من لطيف وكثيف ولا يشعر بذلك جليسه ولا يتغير عليه من حاله الذي هو عليه من جليسه شي‏ء إن كان يأكل بقي على أكله في حاله أو شربه أو حديثه الذي هو في حديثه فإن ذلك الوارد يعم وهو قوله تعالى وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ فمن كانت أينيته في ذلك الوقت حالة الأكل أو الشرب أو الحديث أو اللعب أو ما كان بقي على حاله‏\n\n\n### [محاسبة النفس ومراعاة الأنفاس‏]\n\n\nفلما رأت هذه الطائفة الجليلة هذا الفرق بين الواردات الطبيعية والروحانية والإلهية ورأت أن الالتباس قد ظرأ على من يزعم أنه في نفسه من رجال الله تعالى أنفوا أن يتصفوا بالجهل والتخليط فإنه محل الوجود الطبيعي فارتقت همتهم إلى الاشتغال بالنيات إذ كان الله قد قال لهم وما أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ والإخلاص النية ولهذا قيدها بقوله له ولم يقل مخلصين وهو من الاستخلاص فإن الإنسان قد يخلص نيته للشيطان ويسمى مخلصا فلا يكون في عمله لله شي‏ء وقد يخلص للشركة وقد يخلص لله فلهذا قال تعالى مُخْلِصِينَ لَهُ الدِّينَ لا لغيره ولا لحكم الشركة فشغلوا نفوسهم بالأصل في قبول الأعمال ونيل السعادات وموافقة الطلب الإلهي منهم فيما كلفهم به من الأعمال الخالصة له وهو المعبر عنه بالنية فنسبوا إليها لغلبة شغلهم بها وتحققوا إن الأعمال ليست مطلوبة لأنفسها وإنما هي من حيث ما قصد بها وهو النية في العمل كالمعنى في الكلمة فإن الكلمة ما هي مطلوبة لنفسها وإنما هي لما تضمنته فانظر يا أخي ما أدق نظر هؤلاء الرجال وهذا هو المعبر عنه في الطريق بمحاسبة النفس وقد قال رسول الله صلى الله عليه وسلم حاسبوا أنفسكم قبل أن تحاسبوا\n\n\nولقيت من هؤلاء الرجال اثنين أبو عبد الله بن المجاهد وأبو عبد الله بن قسوم بإشبيلية كان هذا مقامهم وكانوا من أقطاب الرجال النياتيين ولما شرعنا في هذا المقام تأسيا بهما وبأصحابهما وامتثالا لأمر رسول الله صلى الله عليه وسلم الواجب امتثاله في أمره حاسبوا أنفسكم وكان أشياخنا يحاسبون أنفسهم على ما يتكلمون به وما يفعلونه ويقيدونه في دفتر فإذا كان بعد صلاة العشاء وخلوا في بيوتهم حاسبوا أنفسهم وأحضروا دفترهم ونظروا فيما صدر منهم في يومهم من قول وعمل وقابلوا كل عمل بما يستحقه إن استحق استغفارا استغفروا وإن استحق توبة تابوا وإن استحق شكرا شكروا إلى أن يفرغ ما كان منهم في ذلك اليوم وبعد ذلك ينامون فزدنا عليهم في هذا الباب بتقييد الخواطر فكنا نقيد ما تحدثنا به نفوسنا وما تهم به زائدا على كلامنا وأفعالنا وكنت أحاسب نفسي مثلهم في ذلك الوقت وأحضر الدفتر وأطالبها بجميع ما خطر لها وما حدثت به‏\nنفسها وما ظهر للحس من ذلك من قول وعمل وما نوته في ذلك الخاطر والحديث فقلت الخواطر والفضول إلا فيما يعني فهذا فائدة هذا الباب وفائدة الاشتغال بالنية وما في الطريق ما يغفل عنه أكثر من هذا الباب فإن ذلك راجع إلى مراعاة الأنفاس وهي عزيزة\n\n\n### [قلب يونس أو الولادة الثانية]\n\n\nوبعد أن عرفتك بأصول هذه الطائفة وما هو سبب شغلهم بذلك وأنه لهم أمر شرعي وما لهم في ذلك من الأسرار والعلوم فاعلم أيضا مقامهم في ذلك وما لهم فهذه الطائفة على قلب يونس عليه السلام فإنه لما ذَهَبَ مُغاضِباً وظن أن الله لا يضيق عليه لما عهده من سعة رحمة الله فيه وما نظر ذلك الاتساع الإلهي الرحماني في حق غيره فتناله أمته واقتصر به على نفسه والغضب ظلمة القلب فأثرت لعلو منصبه في ظاهره فاسكن في ظلمة بطن الحوت ما شاء الله لينبهه الله على حالته حين كان جنينا في بطن أمه من كان يدبره فيه وهل كان في ذلك الموطن يتصور منه أن يغاضب أو يغاضب بل كان في كنف الله لا يعرف سوى ربه فرده إلى هذه الحالة في بطن الحوت تعليما له بالفعل لا بالقول فَنادى‏ في الظُّلُماتِ أَنْ لا إِلهَ إِلَّا أَنْتَ عذرا عن أمته في هذا التوحيد أي تفعل ما تريد وتبسط رحمتك على من تشاء سُبْحانَكَ إِنِّي كُنْتُ من الظَّالِمِينَ مشتق من الظلمة أي ظلمتي عادت على ما أنت ظلمتني بل ما كان في باطني سرى إلى ظاهري وانتقل النور إلى باطني فاستنار فأزال ظلمة المغاضبة وانتشر فيه نور التوحيد وانبسطت الرحمة فسرى ذلك النور في ظاهره مثل ما سرت ظلمة الغضب فاستجاب له ربه فنجاه من الغم فقذفه الحوت من بطنه مولودا على الفطرة السليمة فلم يولد أحد من ولد آدم ولادتين سوى يونس عليه السلام فخرج ضعيفا كالطفل كما قال وهُوَ سَقِيمٌ ورباه باليقطين فإن ورقه ناعم ولا ينزل عليه ذباب فإن الطفل لضعفه لا يستطيع أن يزيل الذباب عن نفسه فغطاه بشجرة خاصيتها أن لا يقربها ذباب مع نعمة ورقها فإن ورق اليقطين مثل القطن في النعمة بخلاف سائر ورق الأشجار كلها فإن فيها خشونة وأنشأه الله عز وجل نشأة أخرى‏\n\n\n### [تمحيص النيات والقصد في الحركات‏]\n\n\nولما رأت هذه الطائفة أن يونس عليه السلام ما أتى عليه إلا من باطنه من الصفة التي قامت به ومن قصده شغلوا نفوسهم بتمحيص النيات والقصد في حركاتهم كلها حتى لا ينوون إلا ما أمرهم الله به أن ينووه ويقصدوه وهذا غاية ما يقدر عليه رجال الله وهذه الطائفة في الرجال قليلون فإنه مقام ضيق جدا يحتاج صاحبه إلى حضور دائم وأكبر من كان فيه أبو بكر الصديق رضي الله عنه ولهذا قال عمر بن الخطاب رضي الله عنه فيه في حرب اليمامة فما هو إلا أن رأيت أن الله عز وجل قد شرح صدر أبي بكر للقتال فعرفت أنه الحق لمعرفة عمر باشتغال أبي بكر بباطنه فإذا صدرت منه حركة في ظاهره فما تصدر إلا من إل وهو عزيز ولهذا كان من يفهم المقامات من المتقدمين من أهل الكتاب إذا سمعوا أو يقال لهم إن رسول الله صلى الله عليه وسلم يقول كذا وكذا يقولون هذا كلام ما خرج إلا من إل أي هو كلام إلهي ما هو كلام مخلوق فانظر ما أحسن العلم وفي أي مقام ثبتت هذه الطائفة وبأي قائمة استمسكت جعلنا الله منهم فجل أعمالهم في الباطن مساكن السائحين منهم الغيران والكهوف وفي الأمصار ما بناه غيرهم من عباد الله تعالى لا يضعون لبنة على لبنة ولا قصبة على قصبة وهكذا كان رسول الله صلى الله عليه وسلم إلى أن انتقل إلى ربه ما بنى قط مسكنا لنفسه‏\n\n\n### [الدنيا قنطرة خشب على نهر عظيم جرار]\n\n\nوسبب ذلك أنهم رأوا الدنيا جسرا منصوبا من خشب على نهر عظيم وهم عابرون فيه راحلون عنه فهل رأيتم أحدا بنى منزلا على جسر خشب لا والله ولا سيما وقد عرف أن الأمطار تنزل وأن النهر يعظم بالسيول التي تأتي وأن الجسور تنقطع فكل من بنى على جسر فإنما يعرض به للتلف فلو أن عمار الدنيا يكشف الله عن بصيرتهم حتى يروها جسرا ويروا النهر الذي بنيت عليه أنه خطر قوي ما بنوا الذي بنوا عليه من القصور المشيدة فلم يكن لهم عيون يبصرون بها إن الدنيا قنطرة خشب على نهر عظيم خرار ولا كان لهم سمع يسمعون به قول الرسول العالم بما أوحى الله إليه به إن الدنيا قنطرة فلا بالإيمان عملوا ولا على الرؤية والكشف حصلوا فهم كما قال الله فيهم وحَسِبُوا أَلَّا تَكُونَ فِتْنَةٌ فَعَمُوا وصَمُّوا ثُمَّ تابَ الله عَلَيْهِمْ في حال سماعهم من الرسول صلى الله عليه وسلم حين‏\n\n\nقال لهم إن الدنيا قنطرة\n\n\nوأشباه ذلك فلا تشغلوا نفوسكم بعمارتها وانهضوا فما فرغ من قوله صلى الله عليه وسلم حتى رجع كثير منهم إلى عماهم وصممهم مع كونهم مسلمين مؤمنين فأخبر الله تعالى نبيه بقوله ثُمَّ عَمُوا وصَمُّوا كَثِيرٌ مِنْهُمْ بعد التوبة يقول ما نفع القول فيهم يا ولي لو فرضنا إن الدنيا باقية أ لسنا نبصر رحلتنا عنها جيلا بعد جيل‏\n\n\n### [مراعاة القلوب ومقتضيات «المحبوب»]\n\n\nفمن أحوال هذه الطائفة مراعاتهم‏\nلقلوبهم وأسرارهم متعلقة بالله من حيث معرفة نفوسهم ولا اجتماع لهم بالنهار مع الغافلين بل حركتهم ليلية ونظرهم في الغيب الغالب عليهم مقام الحزن فإن الحزن إذا فقد من القلب خرب فالعارف يأكل الحلوى والعسل والمحقق الكبير يأكل الحنظل فهو كثير التنغيص لا يلتذ بنعمة أبدا ما دام في هذه الدار لشغله بما كلفه الله من الشكر عليها لقيت منهم بدنيسر عمر الفرقوي وبمدينة فاس عبد الله السماد والعارفون بالنظر إلى هؤلاء كالأطفال الذين لا عقول لهم يفرحون ويلتذون بخشخاشة فما ظنك بالمريدين فما ظنك بالعامة لهم القدم الراسخة في التوحيد ولهم المشافهة في الفهوانية يقدمون النفي على الإثبات لأن التنزيه شأنهم كلفظة لا إله إلا الله وهي أفضل كلمة جاءت بها الرسل والأنبياء توحيدهم كوني عقلي ليسوا من اللهو في شي‏ء لهم الحضور التام على الدوام وفي جميع الأفعال اختصوا بعلم الحياة والأحياء لهم اليد البيضاء فيعلمون من الحيوان ما لا يعلمه سواهم ولا سيما من كل حيوان يمشي على بطنه لقربه من أصله الذي عنه تكون فإن كل حيوان يبعد عن أصله ينقص من معرفته بأصله على قدر ما بعد منه أ لا ترى المريض الذي لا يقدر على القيام والقعود ويبقى طريحا لضعفه وهو رجوعه إلى أصله تراه فقيرا إلى ربه مسكينا ظاهر الضعف والحاجة بلسان الحال والمقال وذلك أن أصله حكم عليه لما قرب منه يقول الله خَلَقَكُمْ من ضَعْفٍ وقال خُلِقَ الْإِنْسانُ ضَعِيفاً فإذا استوى قائما وبعد عن أصله تفرعن وتجبر وادعى القوة وقال أنا فالرجل من كان مع الله في حال قيامه وصحته كحاله في اضطجاعه من المرض والضعف وهو عزيز لهم البحث الشديد في النظر في أفعالهم وأفعال غيرهم معهم من أجل النيات التي بها يتوجهون وإليها ينسبون لشدة بحثهم عنها حتى تخلص لهم الأعمال ويخلصوها من غيرهم ولهذا قيل فيهم النياتيون كما قيل الملامية والصوفية لأحوال خاصة هم عليها فلهم معرفة الهاجس والهمة والعزم والإرادة والقصد وهذه كلها أحوال مقدمة للنية والنية هي التي تكون منه عند مباشرة أفعاله وهي المعتبرة في الشرع الإلهي ففيها يبحثون وهي متعلق الإخلاص وكان عالمنا الإمام سهل بن عبد الله يدقق في هذا الشأن وهو الذي نبه على نقر الخاطر ويقول إن النية هو ذلك الهاجس وأنه السبب الأول في حدوث الهم والعزم والإرادة والقصد فكان يعتمد عليه وهو الصحيح عندنا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Thirty-Three: Concerning the Knowledge of the Poles of Intentions (أقطاب النيات), their Secrets, and the Nature of their Principles, and they are called the Intentionalists (النياتيون)\n\n(In the Name of Allah, the Most Merciful, the Most Compassionate)\n\nThe Spirit (الروح) is to the body what intentions are to the deed,\nBy them the deed lives, like the earth lives by the rain.\n\nSo you see the flowers and trees emerging,\nAnd all the fruit that the trees bring forth.\n\nLikewise, from our actions emerge forms\nThat possess scents, both foul and fragrant.\n\nWere it not for the Law (الشريعة), musk would be ashamed\nOf their fragrances; this is what my insight dictates.\n\nIf the foundation of all creation (التكوين)\nBelongs to Him, then there is no difference between benefit and harm.\n\nSo adhere to His Law, and you will enjoy walls (سورا)\nWithin which forms reside, shining upon couches (سرر).\n\nYou see them like kings upon their thrones,\nOr like brides, beloved to the sight.\n\n### [Intentions and Actions (النيات والأعمال)]\n\nWe have narrated from the Hadith of the Messenger of Allah (peace and blessings be upon him) that he said: \"Actions are only by intentions (النيات), and every person shall have only what he intended. Thus, whoever’s emigration (hijra) was for Allah and His Messenger, his emigration is for Allah and His Messenger; and whoever’s emigration was for worldly gain he might acquire, or a woman he might marry, his emigration is to that for which he emigrated.\"\n\nNarrated by Umar ibn al-Khattab (may Allah be pleased with him).\n\n### [Intention is One in its Essence, but Different and Multiple in terms of its Objects (منوياتها)]\n\nKnow that there are men dedicated to the observance of intentions (النيات) upon a specific state and a particular description, whom I shall mention, God willing, along with their spiritual states (أحوالهم). Intention (النية) is to all movements and stillness in the legally responsible (المكلفين) for their actions, as rain is to what the earth brings forth. The intention, in terms of its Essence (ذاتها), is one, but it differs according to its object (المتعلق), which is the intended thing (المنوي). Thus, the result is according to the object to which it relates, not according to the intention itself. The role of the intention is merely the purpose (القصد) for the action or its omission. Whether that action is good or ugly, or beneficial or harmful, is not an effect of the intention; rather, it is due to an accidental matter (أمر عارض) that the Lawgiver (الشارع) distinguished and specified for the legally responsible person. Therefore, the intention has absolutely no effect from this specific perspective. It is like water: its function is only to descend or flow through the earth. The fact that dead earth is revived by it, or that the house of a poor old woman is destroyed by its descent, is not due to the water itself. Thus, the fragrant flower and the foul-smelling one, and the good and bad fruit, emerge due to the corruption or goodness of the soil’s temperament (مزاج البقعة) or the corruption or goodness of the seed (البزرة). Allah the Exalted said: <<يُسْقى‏ بِماءٍ واحِدٍ ونُفَضِّلُ بَعْضَها عَلى‏ بَعْضٍ في الْأُكُلِ>> (They are watered with one water, yet We favor some of them over others in [the taste of] the fruit). Then He said: <<إِنَّ في ذلِكَ لَآياتٍ لِقَوْمٍ يَعْقِلُونَ>> (Indeed, in that are signs for a people who reason). The intention’s role in this is only that of supply (الإمداد), just as the Exalted said: <<يُضِلُّ به كَثِيراً ويَهْدِي به كَثِيراً>> (He misleads many thereby and guides many thereby)—meaning the parable struck in the Quran, i.e., by its means, and it is from the Quran. Just as water was the cause for the appearance of these different scents and tastes, so too are intentions the cause for righteous and unrighteous actions.\n\n### [Guidance and Misguidance (الهدى والضلال)]\n\nIt is known that the Quran is entirely guidance (مهداة), but through the interpretation (التأويل) of the parable struck therein, those who are misguided are misguided, and those who are guided are guided. Thus, its reality (حقيقته) as a parable has not changed; rather, the fault lies in the eye of understanding (عين الفهم). Similarly, the intention gives its reality, which is its connection to the intended object (المنوي). Whether that intended object is good or ugly is not due to the intention, but rather to the one who judges it as good or ugly. The Exalted said: <<إِنَّا هَدَيْناهُ السَّبِيلَ>> (Indeed, We guided him to the way)—meaning, We clarified for him the path of felicity and wretchedness. Then He said: <<إِمَّا شاكِراً وإِمَّا كَفُوراً>> (Either grateful or ungrateful). This refers back to the addressed, legally responsible person (المخاطب المكلف). If he intends good, it yields good; and if he intends evil, it yields evil. The result comes only from the recipient (المحل), whether it is good or corrupt. Allah the Exalted says: <<وعَلَى الله قَصْدُ السَّبِيلِ>> (And upon Allah is the direction of the way). That is, \"I have made this incumbent upon Myself.\" It is as if God is saying: \"What is incumbent upon the side of the Real (الحق) among you is to clarify for you the path that leads to your felicity, and I have done so, for you would not know it except by My informing you and My clarification.\"\n\n### [The Two Paths of Felicity and Wretchedness, and the Divine Obligation (الإيجاب الإلهي)]\n\nThe reason for this is that it was predetermined in [Divine] Knowledge (العلم) that the path to the servants' felicity is only through a specific means, and the means of their wretchedness is also only through a specific path. Wretchedness is nothing but deviation from the path of felicity, which is faith in Allah and in what came from Allah, which He obligated us to believe in. Since the world was in a state of ignorance regarding what was in Allah's Knowledge concerning the designation of that path, clarification became necessary through the attribute of Speech (صفة الكلام). Therefore, a Messenger is indispensable. Allah the Exalted said: <<وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا>> (And We would not punish until We had sent a messenger). We do not impose an obligation upon Allah except what He has imposed upon Himself. He has obligated the definition [of the path] upon Himself by His saying: <<وعَلَى الله قَصْدُ السَّبِيلِ>> (And upon Allah is the direction of the way), similar to His saying: <<وكانَ حَقًّا عَلَيْنا نَصْرُ الْمُؤْمِنِينَ>> (And it was incumbent upon Us to support the believers), and His saying: <<كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ>> (Your Lord has decreed upon Himself mercy). In reality, this obligation (الوجوب) is incumbent upon the relationship (النسبة), not upon His Essence (نفسه), for He is exalted above having anything incumbent upon Him due to the definition of a legal obligation (الواجب الشرعي). It is as if, when the Divine Knowledge (العلم الإلهي) related eternally to the designation of the path in which our felicity lies, and Knowledge, as Knowledge, did not possess the form of transmission (صورة التبليغ), and transmission is an attribute of Speech, the transmission became incumbent upon the relationship (نسبة) of His being the Speaker (متكلما), by defining the path in which the servants' felicity lies, which Knowledge had designated. Thus, the Divine Speech (الكلام الإلهي), through its interpretation of Knowledge, clarified what Knowledge had designated. Therefore, the obligation was upon the relationship, for these are different relationships (نسب مختلفة). The same applies to all other Divine relationships (النسب الإلهية), such as Will (إرادة), Power (قدرة), and so forth.\n\n### [The Names and the Essence (الأسماء والذات)]\n\nWe have already clarified the presence (محاضرة), dialogue (محاورة), and competition (مجاراة) of the Divine Names (الأسماء الإلهية) in the arena of debate concerning the creation of this world (العالم)—which is an expression for everything other than Allah—in our book *Anqa’ Mughrib* (The Fabulous Gryphon), where we dedicated a chapter to \"An Eternal Presence upon an Everlasting Genesis.\" Likewise, in our book *Insha’ al-Jadawil wa al-Dawa’ir* (The Creation of Tables and Circles). You have thus learned how the Divine Obligation (الوجوب الإلهي) relates to the Divine Presence (الحضرة الإلهية), if you are discerning regarding the science of relationships (علم النسب). Based on this principle, one understands His saying, the Exalted: <<يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً>> (The Day We will gather the righteous to the Most Merciful as a delegation). How can they be gathered to Him when they are already His companions (جليس) and in His grasp? Abu Yazid al-Bistami heard a reciter reciting this verse: <<يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً>> (The Day We will gather the righteous to the Most Merciful as a delegation). He wept until his tears struck the pulpit. It is even narrated that blood flew from his eyes and struck the pulpit. He cried out, saying, \"How astonishing! How can they be gathered to Him when they are already His companions?\" When our time came, we were asked about this, and I said, \"The only astonishment is in the saying of Abu Yazid.\" Know that this is only because the righteous person (المتقي) is the companion of the Compeller (الجبار), and thus he fears His overwhelming power (سطوته). The Name *al-Rahman* (The Most Merciful) has no overwhelming power by virtue of being *al-Rahman*; rather, *al-Rahman* grants gentleness, kindness, pardon, and forgiveness. Therefore, they are gathered to Him away from the Name *al-Jabbar* (The Compeller), which grants overwhelming power and awe (الهيبة). For the righteous are the companions of the Compeller in this world by virtue of their righteousness. All the Divine Names (الأسماء الإلهية) follow this pattern, and you will find them thus wherever they appear in the language of the prophets, provided you seek the reality of the Name and its distinction from others. For every Name has two indications: an indication of the Named (المسمى به), and an indication of its reality (حقيقته) by which it is distinguished from another Name. Understand this.\n\n### [Absolute Audition and Restricted Audition (السماع المطلق والسماع المقيد)]\n\nKnow that the reason for these men’s preoccupation with the knowledge of intention (النية) is that they looked into the word (الكلمة) and realized that its letters were only composed and gathered together for the manifestation of an established genesis (نشأة قائمة) that indicates the meaning for which it was gathered in convention (الاصطلاح). When the speaker utters it, the listener’s concern is to understand the meaning for which it was brought, for that is where the benefit lies. This is why it was found in that language in this specific form. For this reason, these men do not accept restricted audition (السماع المقيد) with melodies (النغمات), due to the loftiness of their aspiration (علو همتهم). They accept absolute audition (السماع المطلق). Absolute audition affects them only by the understanding of meanings, which is the spiritual, Divine audition (السماع الروحاني الإلهي), the audition of the great masters (الأكابر). Restricted audition affects its practitioners only through the melody, which is the natural audition (السماع الطبيعي). If someone claims that he hears the meaning in the restricted audition with melodies, and says, \"Were it not for the meaning, I would not have moved,\" and claims that he has departed from the rule of nature (الطبيعة) in that—meaning in the moving cause—he is not truthful. We have seen some of the self-proclaimed shaykhs (المتشيخين) who intrude upon the Path (الطريقة) make this claim. The claimant of this is quickly exposed if he is not truthful. This is because if this claimant attends an audition session (مجلس السماع), pay attention to him. When the singer (القوال) begins to sing with those melodies that naturally move the receptive temperament (المزاج القابل), and the states (الأحوال) of the animal souls (النفوس الحيوانية) begin to circulate, moving the physical structures (الهياكل) in a circular motion (حركة دورية) due to the rule of the celestial sphere’s rotation (استدارة الفلك)—this circular movement (الدور) indicates to you that the audition is natural. This is because the human subtlety (اللطيفة الإنسانية) is not from the celestial sphere; rather, it is from the Spirit (الروح) breathed into man, and it is unlocalized (غير متحيزة), being above the celestial sphere. Therefore, it does not cause circular or non-circular movement in the body. That movement belongs only to the animal spirit (الروح الحيواني), which is subject to nature and the celestial sphere. Do not be ignorant of your own genesis (نشأتك) or of what moves you. If this claimant moves and is seized by the state (الحال), and he whirls or leaps upward without whirling, having lost awareness of himself and the assembly he is in, then when his state is over and he returns to his senses, ask him what moved him. He will say, \"The singer said such-and-such, and I understood such-and-such a meaning from it, and that meaning moved me.\" Tell him, \"Nothing moved you except the beauty of the melody, and the understanding you achieved was merely secondary. Nature ruled over your animality (حيوانيتك). There is no difference between you and the camel in the effect of the melody upon you.\" Such talk will be difficult and heavy for him, and he will say to you, \"You do not know me, nor do you know what moved me.\" Be silent for a while, for heedlessness (الغفلة) usually dominates the claimant of this. Then, engage him in conversation that conveys that same meaning. Say to him, \"How excellent is the saying of Allah the Exalted,\" and recite to him a verse from the Book of Allah that contains the very meaning that moved him from the singer's voice, and confirm it for him until he realizes it. He will engage with you and speak, but he will not be seized by a state, nor movement, nor annihilation (فناء). Rather, he will appreciate it and say, \"This verse contains a magnificent meaning of gnosis (المعرفة) of Allah.\" How severe is his exposure in his claim! Say to him, \"My brother, this exact meaning is what you told me moved you in the audition last night when the singer brought it forth in his poetry with his pleasant melody. For what reason did the state circulate within you last night, while this meaning is present in what I have formulated for you and conveyed through the Speech of the True One (كلام الحق تعالى), which is higher and more truthful, yet I do not see you trembling, despite your appreciation and understanding? Last night, <<يَتَخَبَّطُهُ الشَّيْطانُ مِنَ الْمَسِّ>> (Satan struck you down by the touch), as Allah the Exalted said, and natural audition veiled you from the eye of understanding (عين الفهم). All you gained from your audition was ignorance of yourself. How can the success of one who cannot distinguish between his understanding and his movement be hoped for?\"\n\n### [The Natural, Spiritual, and Divine Influx (الوارد الطبيعي والروحاني والإلهي)]\n\nAudition that stems from the eye of understanding (عين الفهم) is the Divine Audition (السماع الإلهي). If it descends upon its practitioner, and it is powerful due to the comprehensiveness (الإجمال) with which it descends, its ultimate effect on the body is merely to lay him down (يضجعه) and make him lose awareness of himself, without any movement whatsoever, whether he is one of the great masters (الأكابر) or the lesser ones. This is the ruling of the powerful Divine Influx (الوارد الإلهي), and it is the distinguishing factor between it and the ruling of the Natural Influx (الوارد الطبيعي). For the Natural Influx, as we said, moves him in a circular motion, causing wandering and staggering, like the action of a madman. The Divine Influx lays him down for a reason I shall mention to you. This is because the human genesis (نشأة الإنسان) is created from dust. The Exalted said: <<مِنْها خَلَقْناكُمْ وفِيها نُعِيدُكُمْ ومِنْها نُخْرِجُكُمْ>> (From it We created you, and into it We will return you, and from it We will bring you forth once more). Although man contains all elements, the greatest element is dust. The Mighty and Majestic also said concerning him: <<إِنَّ مَثَلَ عِيسى‏ عِنْدَ الله كَمَثَلِ آدَمَ خَلَقَهُ من تُرابٍ>> (Indeed, the example of Jesus to Allah is like that of Adam. He created him from dust). In his sitting and standing, man is distant from his greatest origin (أصله الأعظم) from which he originated, in most respects, for his sitting, standing, and bowing are branches. When the Divine Influx comes to him, the Divine Influx possesses the attribute of Self-Subsistence (القيومية). This attribute exists in man, in terms of his physicality, by way of accident (العرض), and his governing spirit (روحه المدبر) is what kept him standing and sitting. If the governing human spirit (الروح الإنساني المدبر) becomes preoccupied with receiving the Divine sciences (العلوم الإلهية) from the Divine Influx, it ceases its governance. Nothing remains to maintain the body's standing or sitting, so it returns to its origin, which is its adherence to the earth, expressed as lying down (الاضطجاع), even if he is on a couch, for the couch merely prevents him from reaching the dust. When his spirit finishes that reception and the Influx returns to its Lord, the spirit returns to governing his body and raises him from his prostration. This is the reason for the prophets lying down on their backs when the Revelation (الوحي) descended upon them. It was never heard that a prophet staggered when the Revelation descended, even with the presence of the intermediary in the Revelation, which is the Angel. How much more so when the Influx comes by the removal of intermediaries (رفع الوسائط)? It is not proper for him to lose awareness of himself at all, nor to change from the state he is in. For the Divine Influx, when intermediaries are removed, flows through the entirety (كلية) of the human being, and every limb, indeed every single indivisible substance (جوهر فرد) within him, takes its share of that Divine Influx, both subtle and dense. His companion does not perceive this, nor does anything change in his state in the eyes of his companion. If he is eating, he remains eating in his state; or drinking, or speaking, he remains in his conversation. For that Influx is comprehensive, and this is His saying, the Exalted: <<وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ>> (And He is with you wherever you are). So, whoever's \"where-ness\" (أينيته) at that time was the state of eating, drinking, speaking, playing, or whatever it was, he remains in that state.\n\n### [Self-Reckoning and the Observance of Breaths (محاسبة النفس ومراعاة الأنفاس)]\n\nWhen this noble group (الطائفة الجليلة) saw this difference between the Natural, Spiritual, and Divine Influxes, and saw that confusion had afflicted those who claimed to be among the men of Allah, they disdained to be characterized by ignorance and confusion, for that is the locus of natural existence (الوجود الطبيعي). Their aspiration ascended to preoccupation with intentions (النيات), since Allah had said to them: <<وما أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ>> (And they were not commanded except to worship Allah, sincere to Him). Sincerity (الإخلاص) is the intention, and this is why He qualified it by saying \"to Him\" (له) and did not just say \"sincere\" (مخلصين). This is derived from *istikhlas* (extraction/purification). A person may purify his intention for Satan and be called sincere, yet his action contains nothing for Allah. He may purify it for partnership, or he may purify it for Allah. Therefore, the Exalted said: <<مُخْلِصِينَ لَهُ الدِّينَ>> (Sincere to Him in religion), not to another, nor to the rule of partnership. So, they occupied themselves with the foundation (الأصل) for the acceptance of actions and the attainment of felicity, and with conforming to the Divine demand concerning the actions He obligated them to perform purely for Him, which is expressed as the intention (النية). They were thus attributed to it due to the dominance of their preoccupation with it. They realized that actions are not sought for their own sake, but only for what was intended by them, which is the intention in the action, like the meaning in the word. For the word is not sought for its own sake, but only for what it contains. Look, my brother, at the subtlety of the insight of these men! This is what is expressed in the Path as self-reckoning (محاسبة النفس). The Messenger of Allah (peace and blessings be upon him) said: \"Reckon yourselves before you are reckoned.\"\n\nI met two of these men: Abu Abdullah ibn al-Mujahid and Abu Abdullah ibn Qassum in Seville. This was their station, and they were among the Poles (أقطاب) of the Intentionalists (النياتيين). When we began this station, following their example and the example of their companions, and in compliance with the command of the Messenger of Allah (peace and blessings be upon him) which must be obeyed—his command to \"Reckon yourselves\"—our shaykhs used to reckon themselves regarding what they spoke and what they did, recording it in a ledger. After the evening prayer (*Isha*) when they were alone in their homes, they would reckon themselves, bring out their ledger, and review what had issued from them during the day in terms of speech and action. They would match every action with what it deserved: if it deserved seeking forgiveness (استغفارا), they sought forgiveness; if it deserved repentance (توبة), they repented; if it deserved thanks (شكرا), they gave thanks, until they finished reviewing what had occurred that day. After that, they would sleep. We added to this chapter by recording thoughts (الخواطر). We used to record what our souls spoke to us and what they intended, in addition to our speech and actions. I used to reckon myself like them at that time, bringing out the ledger and demanding accountability for every thought that crossed my mind and every conversation my soul had with itself, and what appeared to the senses from that in terms of speech and action, and what I intended in that thought and conversation. I concluded that thoughts and superfluities (الفضول) should be avoided except in what concerns one. This is the benefit of this chapter and the benefit of preoccupation with intention. There is nothing in the Path that is more neglected than this chapter, for it relates to the observance of breaths (مراعاة الأنفاس), and that is precious.\n\n### [The Heart of Jonah or the Second Birth (قلب يونس أو الولادة الثانية)]\n\nAfter I have informed you of the principles of this group, the reason for their preoccupation with this—that it is a legal matter for them—and the secrets and sciences they possess, know also their station (مقامهم) in this and what they possess. This group is upon the heart of Jonah (Yunus) (peace be upon him). When he <<ذَهَبَ مُغاضِباً>> (went off in anger), he thought that Allah would not restrict him, due to the vastness of Allah's mercy he had experienced in himself. He did not consider that Divine, Merciful vastness (الاتساع الإلهي الرحماني) in relation to others, so that his community might attain it, confining it instead to himself. Anger is the darkness of the heart (ظلمة القلب), and due to the loftiness of his rank, it affected his exterior. So, he was confined in the darkness of the whale's belly (بطن الحوت) for as long as Allah willed, so that Allah might alert him to his state when he was a fetus in his mother's womb: who was governing him there? Was it conceivable for him in that place to be angry or to be angered? Rather, he was in the protection of Allah, knowing nothing but his Lord. He was returned to this state in the whale's belly as a teaching through action, not through speech. <<فَنادى‏ في الظُّلُماتِ أَنْ لا إِلهَ إِلَّا أَنْتَ>> (So he called out in the darknesses, \"There is no god except You\")—an excuse on behalf of his community in this declaration of Unity (التوحيد), meaning: \"You do what You will, and You extend Your mercy to whomever You wish.\" <<سُبْحانَكَ إِنِّي كُنْتُ من الظَّالِمِينَ>> (Exalted are You! Indeed, I was among the wrongdoers)—derived from *al-dhulma* (darkness), meaning: \"My darkness returned upon what You darkened for me,\" or rather, \"What was in my interior flowed to my exterior, and the light moved into my interior, so it became illuminated, removing the darkness of anger, and the light of Unity spread within it, and mercy expanded.\" That light then flowed into his exterior just as the darkness of anger had flowed. So his Lord answered him and saved him from grief. The whale cast him forth from its belly, born upon the sound primordial nature (الفطرة السليمة). No one among the children of Adam was born twice except Yunus (peace be upon him). He emerged weak, like a child, as He said: <<وهُوَ سَقِيمٌ>> (And he was sick). And He nourished him with the gourd (اليقطين), for its leaves are soft and no flies land upon it. Since the child, due to his weakness, cannot ward off flies from himself, Allah covered him with a tree whose property is that no fly approaches it, along with the softness of its leaves—for the leaves of the gourd are like cotton in softness, unlike all other tree leaves, which have roughness. And Allah the Mighty and Majestic brought him forth in a second genesis (نشأة أخرى).\n\n### [Purification of Intentions and Purpose in Movements (تمحيص النيات والقصد في الحركات)]\n\nWhen this group saw that what afflicted Yunus (peace be upon him) came only from his interior, from the attribute that arose within him and from his purpose (قصده), they occupied themselves with purifying intentions (تمحيص النيات) and purpose (القصد) in all their movements, so that they intend nothing but what Allah commanded them to intend and purpose. This is the utmost that the men of Allah can achieve. This group is few among men, for it is a very narrow station (مقام ضيق جدا) that requires constant presence (حضور دائم) from its practitioner. The greatest among those who held this station was Abu Bakr al-Siddiq (may Allah be pleased with him). For this reason, Umar ibn al-Khattab (may Allah be pleased with him) said concerning him during the Battle of Yamama: \"It was only that I saw that Allah the Mighty and Majestic had opened the breast of Abu Bakr for fighting, so I knew that it was the Truth (الحق).\" This was due to Umar's knowledge of Abu Bakr's preoccupation with his interior (باطنه). If a movement issued from his exterior, it issued only from *Il* (إل)—and this is precious. For this reason, those among the early People of the Book who understood the spiritual stations (المقامات), when they heard or were told that the Messenger of Allah (peace and blessings be upon him) said such-and-such, they would say, \"This speech did not issue except from *Il*,\" meaning it is Divine speech, not the speech of a creature. Look at how excellent this knowledge is, and in what station this group is established, and by what foundation they hold fast! May Allah make us among them. The majority of their actions are internal. The dwellings of the wanderers (السائحين) among them are caves and caverns. In the cities, they dwell in what others of Allah's servants have built; they do not place brick upon brick, nor reed upon reed. This was also the way of the Messenger of Allah (peace and blessings be upon him) until he passed away to his Lord; he never built a dwelling for himself.\n\n### [The World is a Wooden Bridge over a Great, Rushing River (الدنيا قنطرة خشب على نهر عظيم جرار)]\n\nThe reason for this is that they saw the world (الدنيا) as a bridge (جسرا) erected from wood over a great river, and they are merely crossing it, departing from it. Have you ever seen anyone build a house on a wooden bridge? No, by Allah! Especially when it is known that rains descend, and the river swells with incoming floods, and bridges are cut off. Everyone who builds upon a bridge exposes himself to destruction. If Allah were to unveil the inner sight (بصيرتهم) of the builders of the world so that they saw it as a bridge, and saw the river upon which it is built as a powerful danger, they would not build the towering palaces they have built upon it. They have no eyes with which to see that the world is a wooden bridge over a great, rushing river (خرار), nor do they have ears with which to hear the saying of the Messenger, who knows what Allah revealed to him: that the world is a bridge, so do not occupy yourselves with its construction, but move on! They neither acted upon faith nor attained vision and unveiling (الكشف). They are as Allah said concerning them: <<وحَسِبُوا أَلَّا تَكُونَ فِتْنَةٌ فَعَمُوا وصَمُّوا ثُمَّ تابَ الله عَلَيْهِمْ>> (And they assumed there would be no trial, so they became blind and deaf. Then Allah turned to them [in mercy]). This was during the time they heard from the Messenger (peace and blessings be upon him) when he said to them that the world is a bridge, and similar statements. Yet, no sooner had he finished speaking than many of them returned to their blindness and deafness, despite being Muslims and believers. So Allah the Exalted informed His Prophet by saying: <<ثُمَّ عَمُوا وصَمُّوا كَثِيرٌ مِنْهُمْ>> (Then many of them became blind and deaf) after the repentance. He says: \"O Wali (friend of God), what good was the saying in them? Even if we assume the world remains, do we not see our departure from it, generation after generation?\"\n\n### [Observance of Hearts and the Requirements of the Beloved (مراعاة القلوب ومقتضيات «المحبوب»)]\n\nAmong the states of this group is their observance of their hearts (قلوبهم) and their secrets (أسرارهم) related to Allah through the knowledge of their own souls. They have no daytime gatherings with the heedless. Rather, their movement is nocturnal, and their contemplation is in the Unseen (الغيب). The dominant station (مقام) over them is sorrow (الحزن), for if sorrow is lost from the heart, the heart is ruined. The Gnostic (*Arif*) eats sweets and honey, but the great Realizer (*Muhhaqiq*) eats colocynth (حنظل). He is frequently troubled; he never enjoys a blessing as long as he is in this abode, due to his preoccupation with the gratitude (الشكر) Allah has obligated upon him for it. I met two of them: Umar al-Farqawi in Dinaysar, and Abdullah al-Sammad in the city of Fez. Gnostics, when compared to these men, are like children who lack intellect, rejoicing and delighting in a rattle. What then do you think of the novices (*Muridin*)? What then do you think of the common people? They possess a firm footing (القدم الراسخة) in Unity (التوحيد). They possess direct address (المشافهة) in the science of understanding (الفهوانية). They prioritize negation over affirmation, because transcendence (التنزيه) is their concern, like the phrase *La ilaha illa Allah* (There is no god but Allah), which is the best word brought by the Messengers and Prophets. Their Unity is cosmic and intellectual. They are not involved in frivolity at all. They possess complete and perpetual presence (الحضور التام) in all actions. They are specialized in the science of life and living things (علم الحياة والأحياء). They have the \"White Hand\" (اليد البيضاء) in knowing about animals what others do not know, especially every animal that crawls on its belly, due to its proximity to its origin (أصله) from which it was formed. For every animal that moves away from its origin decreases in its knowledge of that origin in proportion to its distance from it. Do you not see the sick person who cannot stand or sit, remaining prostrate due to his weakness—which is his return to his origin? You see him poor before his Lord, wretched, manifesting weakness and need through the language of state and speech. This is because his origin ruled over him when he drew near to it. Allah says: <<خَلَقَكُمْ من ضَعْفٍ>> (He created you from weakness), and He said: <<خُلِقَ الْإِنْسانُ ضَعِيفاً>> (Man was created weak). When he stands upright and moves away from his origin, he becomes arrogant, tyrannical, claims strength, and says \"I.\" The true man is he who is with Allah in his state of standing and health just as he is in his state of prostration from sickness and weakness—and this is precious. They have intense scrutiny in observing their actions and the actions of others toward them, because of the intentions (النيات) by which they are directed and to which they are attributed, due to the intensity of their search for them, so that their actions may be purified for them, and they may purify them from others. For this reason, they were called the Intentionalists (النياتيون), just as others were called the Malamiyya (Blameworthy Ones) and the Sufiyya (Sufis) due to specific states they maintain. They possess knowledge of the passing thought (الهاجس), the aspiration (الهمة), the resolve (العزم), the will (الإرادة), and the purpose (القصد). All of these are states preceding the intention (النية). The intention is what issues from him when he undertakes his actions, and it is what is considered in the Divine Law (الشرع الإلهي). This is what they investigate, and it is the object of sincerity (الإخلاص). Our scholar, Imam Sahl ibn Abdullah, was meticulous in this matter. He is the one who drew attention to the subtle movement of the thought (نقر الخاطر) and said that the intention is that passing thought (الهاجس), and that it is the primary cause for the occurrence of aspiration, resolve, will, and purpose. He relied upon it, and that is the correct view according to us. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب تینتیسواں: اقطاب النیات (أقطاب النيات) کی معرفت، ان کے اسرار اور ان کے اصول کی کیفیت کے بیان میں، اور انہیں نیتیون (النياتيون) کہا جاتا ہے۔\n\n(بسم الله الرحمن الرحيم)\n\n> روح جسم کے لیے ہے اور نیتیں عمل کے لیے\n> عمل ان سے زندہ ہوتا ہے جیسے زمین بارش سے زندہ ہوتی ہے\n\n> پس تم پھولوں اور درختوں کو ابھرتے ہوئے دیکھتے ہو\n> اور ہر وہ چیز جو درخت پھل کی صورت میں نکالتے ہیں\n\n> اسی طرح ہمارے اعمال سے ایسی صورتیں نکلتی ہیں\n> جن میں بدبو اور خوشبو دونوں ہوتی ہیں\n\n> اگر شریعت نہ ہوتی تو مشک بھی ان کی خوشبوؤں سے شرما جاتا\n> میرا نظریہ یہی فیصلہ کرتا ہے\n\n> جب تمام تکوین (تخلیق) کا انحصار اسی (ذات حق) پر ہو\n> تو نفع اور نقصان میں کوئی فرق نہیں\n\n> پس اس کی شریعت کو لازم پکڑو، تم اس میں ایسی سورتوں سے لطف اندوز ہو گے\n> جو تختوں پر چمکتی ہیں\n\n> تم انہیں تختوں پر بادشاہوں کی طرح دیکھو گے\n> یا دلہنوں کی طرح جو آنکھوں کو محبوب ہوں\n\n### [نیات اور اعمال]\n\nہم نے رسول اللہ صلی اللہ علیہ وسلم کی حدیث سے روایت کی ہے کہ آپ نے فرمایا: \"اعمال کا دار و مدار نیتوں پر ہے، اور ہر شخص کے لیے وہی ہے جو اس نے نیت کی ہو۔ پس جس کی ہجرت اللہ اور اس کے رسول کی طرف ہو، تو اس کی ہجرت اللہ اور اس کے رسول کی طرف ہے، اور جس کی ہجرت دنیا حاصل کرنے یا کسی عورت سے شادی کرنے کے لیے ہو، تو اس کی ہجرت اسی کی طرف ہے جس کی طرف اس نے ہجرت کی۔\"\n\nاسے عمر بن خطاب رضی اللہ عنہ نے روایت کیا۔\n\n### [نیت اپنی ذات کے اعتبار سے ایک ہے، لیکن اپنے منویات کے اعتبار سے مختلف اور متعدد ہے]\n\nجان لو کہ نیتوں کی رعایت کرنے والے کچھ خاص حال اور خاص صفت والے لوگ ہیں، میں ان شاء اللہ ان کا اور ان کے احوال کا ذکر کروں گا۔ مکلفین کے اعمال میں تمام حرکات اور سکنات کے لیے نیت ایسی ہے جیسے بارش اس چیز کے لیے جو زمین اگاتی ہے۔ نیت (النية) اپنی ذات کے اعتبار سے ایک ہے، لیکن متعلق یعنی منوی (المنوي) کے اعتبار سے مختلف ہوتی ہے۔ پس نتیجہ متعلق کے مطابق ہوتا ہے، نہ کہ نیت کی ذات کے مطابق۔ کیونکہ نیت کا حصہ صرف فعل یا اس کے ترک کا قصد کرنا ہے۔ اور اس فعل کا اچھا یا برا، خیر یا شر ہونا نیت کا اثر نہیں ہے، بلکہ یہ ایک عارضی امر ہے جسے شارع نے ممتاز کیا اور مکلف کے لیے مقرر کیا۔ اس خاص پہلو سے نیت کا کوئی اثر نہیں ہے، جیسے پانی کا کام صرف یہ ہے کہ وہ نازل ہو یا زمین میں بہے۔ اور اس کے ذریعے مردہ زمین کا زندہ ہو جانا یا کسی غریب بڑھیا کا گھر اس کے نزول سے گر جانا، یہ پانی کا فعل نہیں ہے۔ پس خوشبودار اور بدبودار پھول، اور اچھا اور برا پھل، زمین کے مزاج کی خباثت یا اچھائی، یا بیج کی خباثت یا اچھائی سے نکلتا ہے۔ اللہ تعالیٰ فرماتا ہے: \"يُسْقى‏ بِماءٍ واحِدٍ ونُفَضِّلُ بَعْضَها عَلى‏ بَعْضٍ في الْأُكُلِ\" (انہیں ایک ہی پانی سے سیراب کیا جاتا ہے، اور ہم کھانے میں بعض کو بعض پر فضیلت دیتے ہیں)۔ پھر فرمایا: \"إِنَّ في ذلِكَ لَآياتٍ لِقَوْمٍ يَعْقِلُونَ\" (بے شک اس میں عقل رکھنے والوں کے لیے نشانیاں ہیں)۔ پس نیت کا اس میں صرف امداد کا کام ہے، جیسا کہ اللہ تعالیٰ نے فرمایا: \"يُضِلُّ به كَثِيراً ويَهْدِي به كَثِيراً\" (وہ اس کے ذریعے بہت سے لوگوں کو گمراہ کرتا ہے اور بہت سے لوگوں کو ہدایت دیتا ہے)۔ یعنی قرآن میں بیان کردہ مثال کے ذریعے، یعنی اس کے سبب سے، اور وہ قرآن میں سے ہے۔ پس جس طرح پانی مختلف خوشبوؤں اور مختلف ذائقوں کے ظاہر ہونے کا سبب بنا، اسی طرح نیتیں نیک اور غیر صالح اعمال کا سبب ہیں۔\n\n### [ہدایت اور گمراہی]\n\nیہ معلوم ہے کہ پورا قرآن ہدایت ہے، لیکن مثال میں تاویل کی وجہ سے جو گمراہ ہوا وہ گمراہ ہوا، اور جو ہدایت یافتہ ہوا وہ اس کے ذریعے ہدایت یافتہ ہوا۔ پس اس کے مثال ہونے کی وجہ سے اس کی حقیقت تبدیل نہیں ہوئی، بلکہ نقص فہم کی آنکھ میں واقع ہوا۔ اسی طرح نیت نے اپنی حقیقت دی، جو کہ منوی (جس کی نیت کی گئی) سے اس کا تعلق ہے۔ اور اس منوی کا اچھا یا برا ہونا نیت کا کام نہیں ہے، بلکہ یہ اس ذات کا کام ہے جو اس میں حسن و قبح کا حکم دینے والا ہے۔ اللہ تعالیٰ نے فرمایا: \"إِنَّا هَدَيْناهُ السَّبِيلَ\" (بے شک ہم نے اسے راستہ دکھا دیا) یعنی ہم نے اسے سعادت اور شقاوت کا راستہ واضح کر دیا۔ پھر فرمایا: \"إِمَّا شاكِراً وإِمَّا كَفُوراً\" (خواہ وہ شکر گزار ہو یا ناشکرا)۔ یہ مخاطب مکلف کی طرف راجع ہے۔ اگر اس نے خیر کی نیت کی تو خیر کا پھل دے گا، اور اگر شر کی نیت کی تو شر کا پھل دے گا۔ پس اس پر جو کچھ آیا وہ صرف محل (نفس) کی اچھائی یا خباثت کی وجہ سے آیا۔ اللہ تعالیٰ فرماتا ہے: \"وعَلَى الله قَصْدُ السَّبِيلِ\" (اور اللہ پر ہی سیدھے راستے کا بیان ہے) یعنی یہ میں نے اپنے اوپر واجب کیا ہے۔ گویا اللہ فرما رہا ہے کہ تم میں سے جو حق کی طرف مائل ہو، اس پر لازم ہے کہ وہ تمہارے لیے تمہاری سعادت تک پہنچانے والے راستے کو واضح کر دے، اور میں نے یہ کر دیا ہے، کیونکہ تم اسے میری اطلاع اور وضاحت کے بغیر نہیں جان سکتے۔\n\n### [سعادت اور شقاوت کے دو راستے اور ایجاب الٰہی]\n\nاس کا سبب یہ ہے کہ علمِ ازل میں یہ طے ہو چکا تھا کہ بندوں کی سعادت کا راستہ ایک خاص سبب میں ہے، اور ان کی شقاوت کا سبب بھی ایک خاص راستے میں ہے۔ اور وہ صرف سعادت کے راستے سے انحراف ہے، جو کہ اللہ پر اور اللہ کی طرف سے آئی ہوئی ان چیزوں پر ایمان لانا ہے جن پر ہمیں ایمان لانے کا حکم دیا گیا ہے۔ اور چونکہ عالم اس وقت جہالت کی حالت میں تھا کہ اللہ کے علم میں اس راستے کا تعین کیا ہے، اس لیے کلام کی صفت کے ذریعے اس کی اطلاع دینا ضروری ہو گیا۔ پس رسول کا ہونا ناگزیر ہے۔ اللہ تعالیٰ نے فرمایا: \"وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا\" (اور ہم عذاب دینے والے نہیں ہیں جب تک کہ ہم رسول نہ بھیج دیں)۔ اور ہم اللہ پر صرف وہی واجب کرتے ہیں جو اس نے خود پر واجب کیا ہے۔ اور اس نے اپنے اوپر تعریف (تعارف) کو واجب کیا ہے اپنے اس قول سے: \"وعَلَى الله قَصْدُ السَّبِيلِ\" (اور اللہ پر ہی سیدھے راستے کا بیان ہے)، جیسے اس کا قول: \"وكانَ حَقًّا عَلَيْنا نَصْرُ الْمُؤْمِنِينَ\" (اور ہم پر مومنوں کی مدد کرنا حق تھا) اور اس کا قول: \"كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ\" (تمہارے رب نے اپنے اوپر رحمت کو لازم کر لیا ہے)۔ اور حقیقت میں، یہ نسبت (النسبة) پر واجب ہوا ہے نہ کہ اس کی ذات پر، کیونکہ وہ اس سے بلند ہے کہ شرعی واجب کی حد کی وجہ سے اس پر کوئی چیز واجب ہو۔ پس گویا جب ازل میں الٰہی علم کا تعلق ہماری سعادت کے راستے کے تعین سے ہوا، اور علم کے لیے بذات خود تبلیغ کی صورت نہیں تھی، اور تبلیغ کلام کی صفت سے تھی، تو یہ تبلیغ اس نسبت پر متعین ہوئی کہ وہ متکلم ہے، تاکہ وہ بندوں کی سعادت کے راستے کی تعریف کرے جسے علم نے متعین کیا تھا۔ پس الٰہی کلام نے علم کی ترجمانی کرتے ہوئے اس متعین راستے کو واضح کر دیا۔ پس وجوب نسبت پر تھا، کیونکہ یہ مختلف نسبتیں ہیں۔ اور اسی طرح دیگر تمام الٰہی نسبتیں ہیں، جیسے ارادہ، قدرت، وغیرہ۔\n\n### [اسماء اور ذات]\n\nہم نے الٰہی اسماء (الأسماء الإلهية) کی حاضری، ان کی گفتگو، اور مناظرے کے میدان میں ان کی ہم آہنگی کو اس عالم کے وجود میں لانے کے بارے میں بیان کیا ہے، جو کہ اللہ کے سوا ہر چیز کا اظہار ہے، اپنی کتاب *عنقاء مغرب* میں، جہاں ہم نے اس پر ایک ازلی حاضری کو ابدی نشأت پر باب باندھا ہے۔ اسی طرح ہماری کتاب *إنشاء الجداول والدوائر* میں بھی ہے۔ پس اگر تم نسبتوں (النسب) کے علم سے واقف ہو تو تم جان چکے ہو گے کہ الٰہی وجوب کا تعلق الٰہی حضور (الحضرة الإلهية) سے کیسے ہوا۔ اور اسی پر اللہ تعالیٰ کا یہ قول نکلتا ہے: \"يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً\" (جس دن ہم پرہیزگاروں کو رحمن کی طرف مہمان بنا کر جمع کریں گے)۔ اور اس کی طرف کیسے جمع کیا جائے گا جو اس کا ہم نشین اور اس کی گرفت میں ہے؟ ابو یزید بسطامی نے ایک قاری کو یہ آیت پڑھتے ہوئے سنا: \"يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً\" (جس دن ہم پرہیزگاروں کو رحمن کی طرف مہمان بنا کر جمع کریں گے)۔ تو وہ اتنا روئے کہ آنسو منبر سے ٹکرائے، بلکہ روایت ہے کہ ان کی آنکھوں سے خون کے قطرے نکلے اور منبر سے ٹکرائے، اور انہوں نے پکار کر کہا: \"کیا تعجب ہے! اس کی طرف کیسے جمع کیا جائے گا جو اس کا ہم نشین ہے؟\" جب ہمارا زمانہ آیا تو ہم سے اس بارے میں پوچھا گیا، تو میں نے کہا: \"تعجب صرف ابو یزید کے قول پر ہے۔\" پس جان لو کہ ایسا اس لیے تھا کہ متقی (المتقي) جبار (الجبار) کا ہم نشین ہوتا ہے، لہٰذا وہ اس کی سطوت سے ڈرتا ہے۔ اور اسم رحمن (الرحمن) کو رحمن ہونے کی حیثیت سے کوئی سطوت نہیں ہے۔ رحمن تو نرمی، لطف، عفو اور مغفرت عطا کرتا ہے۔ اس لیے اسے اسم جبار (الجبار) سے رحمن کی طرف جمع کیا جائے گا، جو سطوت اور ہیبت عطا کرتا ہے۔ کیونکہ متقی اپنی تقویٰ کی وجہ سے دنیا میں جبار کا ہم نشین ہے۔ اور اسی اسلوب پر تمام الٰہی اسماء (الأسماء الإلهية) کو لیا جاتا ہے۔ اور تم انہیں نبوتوں کی زبانوں میں بھی اسی طرح پاؤ گے جب تم اسم کی حقیقت اور اسے دوسرے اسم سے ممتاز کرنے کا ارادہ کرو۔ کیونکہ اس کی دو دلالتیں ہیں: ایک مسمیٰ (جس کا نام رکھا گیا) پر دلالت، اور دوسری اس کی حقیقت پر دلالت جس سے وہ دوسرے اسم سے ممتاز ہوتا ہے۔ پس سمجھ لو۔\n\n### [سماع مطلق اور سماع مقید]\n\nجان لو کہ ان لوگوں کے نیت کی معرفت میں مشغول ہونے کا سبب یہ تھا کہ انہوں نے کلمہ پر غور کیا اور جانا کہ اس کے حروف کو صرف اس لیے جمع اور تالیف نہیں کیا گیا مگر اس معنی کو ظاہر کرنے کے لیے جس کے لیے اسے اصطلاح میں جمع کیا گیا ہے۔ پس جب متکلم اسے بولتا ہے، تو سننے والے کا مقصد اس معنی کو سمجھنا ہوتا ہے جس کے لیے وہ آیا ہے، کیونکہ اسی سے فائدہ حاصل ہوتا ہے۔ اور اسی لیے وہ اس خاص وضع پر اس زبان میں پایا گیا۔ اور اسی لیے یہ لوگ اپنی بلند ہمت کی وجہ سے نغمات کے ساتھ مقید سماع (السماع المقيد) کے قائل نہیں ہیں، بلکہ وہ سماع مطلق (السماع المطلق) کے قائل ہیں۔ کیونکہ سماع مطلق ان پر صرف معانی کے فہم کا اثر ڈالتا ہے، اور یہ روحانی الٰہی سماع ہے۔ اور یہ اکابر کا سماع ہے۔ جبکہ سماع مقید اپنے اصحاب پر صرف نغمہ کا اثر ڈالتا ہے، اور یہ طبعی سماع ہے۔ پس اگر کوئی یہ دعویٰ کرے کہ وہ نغموں کے ساتھ مقید سماع میں معنی سنتا ہے اور کہتا ہے کہ اگر معنی نہ ہوتا تو میں حرکت نہ کرتا، اور یہ دعویٰ کرتا ہے کہ وہ اس میں (یعنی محرک سبب میں) طبیعت کے حکم سے باہر نکل چکا ہے، تو وہ سچا نہیں ہے۔ ہم نے ایسے متشیخین (شیخ ہونے کا دعویٰ کرنے والے) کو دیکھا ہے جو اس طریقے پر طفیلی بن کر آتے ہیں۔ اس دعویٰ کرنے والے کی اگر وہ سچا نہ ہو تو بہت جلد رسوائی ہوتی ہے۔ وہ اس طرح کہ جب یہ مدعی سماع کی مجلس میں حاضر ہو، تو تم اس پر نظر رکھو۔ جب قوال ان نغمات میں گانا شروع کرتا ہے جو طبعاً مزاج کو حرکت دیتی ہیں جو اسے قبول کرنے والا بھی ہو، اور احوال حیوانی نفوس میں سرایت کر جاتے ہیں، تو وہ ڈھانچوں کو ایک دوری حرکت دیتے ہیں، جو فلک کے گھومنے کے حکم کی وجہ سے ہے۔ اور یہ (یعنی دور) تمہیں اس بات پر دلالت کرتا ہے کہ سماع طبعی ہے، کیونکہ انسانی لطیفہ فلک سے نہیں ہے، بلکہ وہ اس روح سے ہے جو اس میں پھونکی گئی ہے، اور وہ غیر متحیز (غیر مادی) ہے۔ پس وہ فلک سے اوپر ہے۔ لہٰذا جسم میں اس کے لیے کوئی دوری یا غیر دوری حرکت نہیں ہے۔ یہ حرکت صرف روح حیوانی کے لیے ہے جو طبیعت اور فلک کے تحت ہے۔ پس تم اپنی نشأت اور اپنے محرک سے جاہل نہ بنو۔ پس جب یہ مدعی حرکت کرتا ہے اور اس پر حال طاری ہوتا ہے اور وہ گھومتا ہے یا بغیر گھومے اوپر کی طرف اچھلتا ہے، اور وہ اپنے آپ اور مجلس کے احساس سے غائب ہو جاتا ہے، تو جب وہ اپنے حال سے فارغ ہو کر اپنے احساس کی طرف لوٹتا ہے، تو اس سے پوچھو کہ تمہیں کس چیز نے حرکت دی؟ وہ کہے گا کہ قوال نے فلاں فلاں بات کہی، اور میں نے اس سے فلاں فلاں معنی سمجھا، اور اس معنی نے مجھے حرکت دی۔ تو تم اس سے کہو کہ تمہیں صرف نغمے کی خوبصورتی نے حرکت دی، اور فہم تمہیں صرف تبعیت میں حاصل ہوا۔ طبیعت نے تمہاری حیوانیت پر حکم لگایا، لہٰذا تم میں اور اونٹ میں کوئی فرق نہیں ہے کہ نغمہ تم پر اثر کرے۔ تو یہ بات اس پر گراں گزرے گی اور وہ کہے گا کہ تم نے مجھے نہیں پہچانا اور نہ ہی تم نے جانا کہ مجھے کس چیز نے حرکت دی۔ تم تھوڑی دیر کے لیے خاموش ہو جاؤ، کیونکہ اس دعویٰ کرنے والے پر غفلت غالب ہوتی ہے۔ پھر اس کے ساتھ اس کلام میں بات شروع کرو جو وہی معنی دیتا ہے۔ تم اس سے کہو کہ اللہ تعالیٰ کا قول کتنا اچھا ہے، جہاں وہ فرماتا ہے: اور اس پر اللہ کی کتاب سے ایک ایسی آیت پڑھو جو اس معنی پر مشتمل ہو جس نے اسے مغنی کی آواز سے حرکت دی تھی، اور اسے اس کے پاس ثابت کرو تاکہ وہ اسے ثابت کرے۔ پس وہ تمہارے ساتھ اس میں شامل ہو گا اور بات کرے گا، لیکن اسے اس کے لیے کوئی حال، کوئی حرکت، یا کوئی فنا نہیں آئے گی۔ بلکہ وہ اسے اچھا سمجھے گا اور کہے گا کہ اس آیت میں اللہ کی معرفت (المعرفۃ) کا ایک عظیم معنی شامل ہے۔ پس اس کے دعوے میں اس کی کتنی بڑی رسوائی ہے! تو تم اس سے کہو: \"اے میرے بھائی! یہ بعینہٖ وہی معنی ہے جو تم نے مجھے بتایا تھا کہ کل رات سماع میں تمہیں حرکت دی تھی، جب قوال نے اسے اپنے شعر میں اپنی اچھی نغمہ کے ساتھ لایا تھا۔ تو کل رات تم میں حال کس معنی کی وجہ سے سرایت کر گیا تھا؟ جبکہ یہ معنی اس کلام حق تعالیٰ میں موجود ہے جو میں نے تمہارے لیے بیان کیا ہے، جو سب سے اعلیٰ اور سچا ہے، اور میں نے تمہیں تحسین اور فہم حاصل ہونے کے باوجود ہلتے ہوئے نہیں دیکھا۔ اور کل رات تو تمہیں شیطان نے چھو کر خبط میں ڈال دیا تھا، جیسا کہ اللہ تعالیٰ نے فرمایا، اور طبعی سماع نے تمہیں عین فہم سے حجاب میں رکھا۔ پس تمہارے سماع میں تمہیں اپنے آپ سے جہالت کے سوا کچھ حاصل نہیں ہوا۔ پس جو اپنے فہم اور اپنی حرکت میں فرق نہ کر سکے، اس کی فلاح کی کیا امید کی جا سکتی ہے؟\"\n\n### [وارد طبعی، روحانی اور الٰہی]\n\nپس عین فہم سے سماع الٰہی سماع (السماع الإلهي) ہے۔ اور جب یہ اپنے صاحب پر وارد ہوتا ہے، اور وہ اس اجمال کی وجہ سے قوی ہوتا ہے جو اس کے ساتھ وارد ہوتا ہے، تو جسم میں اس کا آخری فعل صرف اسے لٹا دینا ہوتا ہے، اور کچھ نہیں، اور اسے اپنے احساس سے غائب کر دیتا ہے۔ اور اس سے کسی بھی صورت میں کوئی حرکت سرزد نہیں ہوتی، خواہ وہ اکابر رجال میں سے ہو یا صغار میں سے۔ یہ قوی وارد الٰہی (الوارد الإلهي) کا حکم ہے، اور یہی اس کے اور وارد طبعی (الوارد الطبيعي) کے حکم کے درمیان فرق ہے۔ کیونکہ وارد طبعی، جیسا کہ ہم نے کہا، اسے دوری حرکت، ہیجان اور خبط میں مبتلا کرتا ہے، جو کہ پاگل کا فعل ہے۔ اور وارد الٰہی اسے صرف اس سبب سے لٹاتا ہے جو میں تمہیں بتاؤں گا۔ اور وہ یہ ہے کہ انسان کی نشأت مٹی سے پیدا کی گئی ہے۔ اللہ تعالیٰ نے فرمایا: \"مِنْها خَلَقْناكُمْ وفِيها نُعِيدُكُمْ ومِنْها نُخْرِجُكُمْ\" (ہم نے تمہیں اسی سے پیدا کیا، اور اسی میں تمہیں لوٹائیں گے، اور اسی سے تمہیں دوبارہ نکالیں گے)۔ اگرچہ اس میں تمام عناصر شامل ہیں، لیکن سب سے بڑا عنصر مٹی ہے۔ اللہ عزوجل نے اس کے بارے میں بھی فرمایا: \"إِنَّ مَثَلَ عِيسى‏ عِنْدَ الله كَمَثَلِ آدَمَ خَلَقَهُ من تُرابٍ\" (بے شک عیسیٰ کی مثال اللہ کے نزدیک آدم کی مثال کی طرح ہے، جسے اس نے مٹی سے پیدا کیا)۔ اور انسان اپنے بیٹھنے اور کھڑے ہونے میں اپنے اس عظیم اصل سے دور ہوتا ہے جس سے وہ پیدا ہوا ہے، کیونکہ اس کا بیٹھنا، کھڑا ہونا اور رکوع کرنا فروع ہیں۔ پس جب اس پر وارد الٰہی آتا ہے، اور وارد الٰہی میں قیومیت (القيومية) کی صفت ہوتی ہے، جو انسان میں اس کی جسمانیت کے لحاظ سے عرض کے حکم میں ہے، اور اس کی مدبر روح ہی اسے کھڑا کرتی اور بٹھاتی تھی۔ پس جب مدبر انسانی روح الٰہی وارد سے حاصل ہونے والے الٰہی علوم (العلوم الإلهية) میں مشغول ہو جاتی ہے، تو جسم کے لیے کوئی باقی نہیں رہتا جو اس کے کھڑے ہونے یا بیٹھنے کو برقرار رکھے۔ پس وہ اپنی اصل کی طرف لوٹ جاتا ہے، جو زمین سے چمٹ جانا ہے، جسے اضطجاع (لیٹنا) سے تعبیر کیا جاتا ہے، خواہ وہ پلنگ پر ہی کیوں نہ ہو۔ کیونکہ پلنگ ہی اسے مٹی تک پہنچنے سے روکتا ہے۔ پس جب اس کی روح اس وصولی سے فارغ ہو جاتی ہے اور وارد اپنے رب کی طرف لوٹ جاتا ہے، تو روح اپنے جسم کی تدبیر کی طرف لوٹ آتی ہے اور اسے اس کے لیٹنے سے کھڑا کر دیتی ہے۔ یہ انبیاء کا وحی کے نزول کے وقت اپنی پیٹھ کے بل لیٹ جانے کا سبب ہے۔ اور کبھی کسی نبی کے بارے میں نہیں سنا گیا کہ وہ وحی کے نزول کے وقت خبط میں مبتلا ہوئے ہوں۔ یہ اس وقت ہے جب وحی میں واسطہ (فرشتہ) موجود ہوتا ہے۔ تو پھر کیا حال ہو گا جب وارد واسطوں کو ہٹا کر ہو؟ اس سے ہرگز یہ نہیں ہو سکتا کہ وہ اپنے احساس سے غائب ہو جائے یا اپنی موجودہ حالت سے تبدیل ہو جائے۔ کیونکہ واسطوں کو ہٹا کر آنے والا الٰہی وارد (الوارد الإلهي) انسان کی کلیت میں سرایت کرتا ہے اور ہر عضو، بلکہ ہر جوہر فرد، اس الٰہی وارد سے اپنا حصہ لیتا ہے، خواہ وہ لطیف ہو یا کثیف۔ اور اس کا ہم نشین اس کا احساس نہیں کرتا، اور نہ ہی اس کی حالت میں اس کے ہم نشین کے لیے کوئی تبدیلی آتی ہے۔ اگر وہ کھا رہا ہو تو اپنی حالت میں کھانے پر باقی رہتا ہے، یا پی رہا ہو، یا بات کر رہا ہو، یا کھیل رہا ہو، تو وہ اپنی حالت پر باقی رہتا ہے۔ کیونکہ وہ وارد عام ہوتا ہے، اور یہ اللہ تعالیٰ کا قول ہے: \"وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ\" (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)۔ پس جس کی \"اینیّت\" (جہاں ہونا) اس وقت کھانے، پینے، بات کرنے، یا کھیلنے کی حالت میں ہو، وہ اپنی حالت پر باقی رہتا ہے۔\n\n### [نفس کا محاسبہ اور سانسوں کی نگرانی]\n\nپس جب اس جلیل القدر گروہ نے واردات طبعی (الطبيعية)، روحانی (الروحانية) اور الٰہی (الإلهية) کے درمیان یہ فرق دیکھا، اور یہ دیکھا کہ جو شخص اپنے آپ کو اللہ کے رجال میں سے ہونے کا دعویٰ کرتا ہے، اس پر التباس (التباس) طاری ہو گیا ہے، کیونکہ وہ وجود طبعی کا محل ہے، تو انہوں نے جہالت اور خلط ملط ہونے کی صفت سے نفرت کی۔ پس ان کی ہمت نیتوں (النيات) میں مشغول ہونے کی طرف بلند ہوئی، کیونکہ اللہ نے ان سے فرمایا تھا: \"وما أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ\" (اور انہیں صرف اسی کا حکم دیا گیا تھا کہ وہ اللہ کی عبادت کریں، اس کے لیے دین کو خالص کرتے ہوئے)۔ اور اخلاص نیت ہے۔ اسی لیے اسے \"لَهُ\" (اس کے لیے) کی قید لگائی، اور \"مخلصین\" (خالص کرنے والے) نہیں کہا۔ اور یہ استخلاص (خالص کرنا) سے ہے۔ کیونکہ انسان اپنی نیت شیطان کے لیے بھی خالص کر سکتا ہے اور اسے مخلص کہا جائے گا، تو اس کے عمل میں اللہ کے لیے کچھ نہیں ہو گا۔ اور کبھی وہ شرکت کے لیے خالص کرتا ہے، اور کبھی اللہ کے لیے۔ اسی لیے اللہ تعالیٰ نے فرمایا: \"مُخْلِصِينَ لَهُ الدِّينَ\" (اس کے لیے دین کو خالص کرتے ہوئے)، نہ کسی اور کے لیے اور نہ ہی شرکت کے حکم کے لیے۔ پس انہوں نے اپنے نفوس کو اعمال کی قبولیت، سعادتوں کے حصول، اور الٰہی طلب کی موافقت کے اصل میں مشغول کر لیا، جو ان سے ان اعمال میں مطلوب ہے جو اس کے لیے خالص ہوں، اور اسی کو نیت (النية) سے تعبیر کیا جاتا ہے۔ پس وہ اس میں اپنی غالب مشغولیت کی وجہ سے اس کی طرف منسوب کیے گئے، اور انہوں نے یہ یقین کر لیا کہ اعمال بذات خود مطلوب نہیں ہیں، بلکہ وہ اس مقصد کے لحاظ سے مطلوب ہیں جو ان سے مقصود ہے، اور وہ عمل میں نیت ہے۔ جیسے کلمہ میں معنی، کیونکہ کلمہ بذات خود مطلوب نہیں ہے، بلکہ اس لیے مطلوب ہے جو اس میں شامل ہے۔ پس اے میرے بھائی! دیکھو کہ ان لوگوں کا نظریہ کتنا دقیق ہے۔ اور اسی کو طریقت میں محاسبہ نفس (محاسبة النفس) سے تعبیر کیا جاتا ہے۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"حاسبوا أنفسكم قبل أن تحاسبوا\" (اپنے نفسوں کا محاسبہ کرو اس سے پہلے کہ تمہارا محاسبہ کیا جائے)۔\n\nاور میں ان لوگوں میں سے دو سے ملا: ابو عبد اللہ بن المجاہد اور ابو عبد اللہ بن قسوم اشبیلیہ میں۔ یہ ان کا مقام تھا اور وہ نیتیون (النياتيون) کے اقطاب رجال میں سے تھے۔ اور جب ہم نے اس مقام میں قدم رکھا، ان کی اور ان کے اصحاب کی پیروی کرتے ہوئے، اور رسول اللہ صلی اللہ علیہ وسلم کے اس حکم کی تعمیل کرتے ہوئے جس کی تعمیل واجب ہے، یعنی \"اپنے نفسوں کا محاسبہ کرو\"، تو ہمارے شیوخ اپنے آپ کا محاسبہ کرتے تھے کہ وہ کیا بولتے ہیں اور کیا کرتے ہیں، اور اسے ایک رجسٹر میں درج کرتے تھے۔ جب نماز عشاء کے بعد وہ اپنے گھروں میں تنہا ہوتے، تو وہ اپنے نفسوں کا محاسبہ کرتے اور اپنا رجسٹر حاضر کرتے، اور دیکھتے کہ دن بھر میں ان سے کیا قول و فعل سرزد ہوا ہے۔ اور ہر عمل کا اس کے مستحق کے ساتھ مقابلہ کرتے۔ اگر وہ استغفار کا مستحق ہوتا تو استغفار کرتے، اگر توبہ کا مستحق ہوتا تو توبہ کرتے، اور اگر شکر کا مستحق ہوتا تو شکر کرتے، یہاں تک کہ اس دن کا حساب مکمل ہو جاتا۔ اس کے بعد وہ سوتے۔ ہم نے اس باب میں ان پر خواطر (خیالات) کو بھی درج کرنے کا اضافہ کیا۔ پس ہم اپنے کلام اور افعال کے علاوہ ان باتوں کو بھی درج کرتے تھے جو ہمارے نفوس ہم سے کرتے تھے اور جن کا ارادہ کرتے تھے۔ اور میں اس وقت ان کی طرح اپنے نفس کا محاسبہ کرتا تھا اور رجسٹر حاضر کرتا تھا اور اس سے ہر اس چیز کا مطالبہ کرتا تھا جو اس کے دل میں خطور ہوئی، جو اس نے اپنے آپ سے بات کی، اور جو حس کے ذریعے قول و فعل کی صورت میں ظاہر ہوا، اور اس خاطر اور بات میں اس کی کیا نیت تھی۔ پس میں نے کہا کہ خواطر اور فضول باتوں سے بچو، سوائے اس کے جو تمہیں فائدہ دے۔ پس یہ اس باب کا فائدہ ہے، اور نیت میں مشغول ہونے کا فائدہ ہے۔ اور طریقت میں اس باب سے زیادہ غفلت برتنے والی کوئی چیز نہیں ہے، کیونکہ یہ سانسوں کی نگرانی (مراعاة الأنفاس) کی طرف راجع ہے، اور یہ بہت نایاب ہے۔\n\n### [یونس کا قلب یا دوسری پیدائش]\n\nاور جب میں نے تمہیں اس گروہ کے اصولوں سے آگاہ کر دیا اور یہ کہ ان کے اس میں مشغول ہونے کا سبب ایک شرعی امر ہے، اور ان کے لیے اس میں کیا اسرار اور علوم ہیں، تو ان کا مقام بھی جان لو۔ یہ گروہ یونس علیہ السلام کے قلب پر ہے۔ کیونکہ جب وہ \"ذَهَبَ مُغاضِباً\" (غصے میں چلے گئے) اور یہ گمان کیا کہ اللہ ان پر تنگی نہیں کرے گا، اس رحمت الٰہی کی وسعت کی وجہ سے جو انہوں نے اپنے حق میں دیکھی تھی، اور انہوں نے اس رحمانی الٰہی وسعت کو دوسروں کے حق میں نہیں دیکھا، تو ان کی قوم نے انہیں حاصل کر لیا اور انہوں نے اسے اپنے تک محدود رکھا۔ اور غصہ قلب کی تاریکی ہے۔ پس ان کے بلند مرتبے کی وجہ سے اس نے ان کے ظاہر پر اثر کیا، تو انہیں مچھلی کے پیٹ کی تاریکی میں رکھا گیا، جب تک اللہ نے چاہا، تاکہ اللہ انہیں ان کی اس حالت پر متنبہ کرے جب وہ اپنی ماں کے پیٹ میں جنین تھے، کہ اس وقت کون ان کی تدبیر کر رہا تھا؟ اور کیا اس مقام پر ان سے غصہ کرنا یا غصہ دلانا متصور تھا؟ بلکہ وہ اللہ کی پناہ میں تھے اور اپنے رب کے سوا کسی کو نہیں جانتے تھے۔ پس اللہ نے انہیں مچھلی کے پیٹ میں اس حالت کی طرف لوٹا دیا، انہیں قول سے نہیں بلکہ فعل سے تعلیم دیتے ہوئے، پس انہوں نے \"فَنادى‏ في الظُّلُماتِ أَنْ لا إِلهَ إِلَّا أَنْتَ\" (تاریکیوں میں پکارا کہ تیرے سوا کوئی معبود نہیں)۔ یہ توحید میں اپنی قوم کی طرف سے عذر تھا، یعنی تو جو چاہے کرتا ہے اور اپنی رحمت جس پر چاہے پھیلاتا ہے۔ \"سُبْحانَكَ إِنِّي كُنْتُ من الظَّالِمِينَ\" (تو پاک ہے، بے شک میں ظالموں میں سے تھا)۔ یہ ظلمت (تاریکی) سے مشتق ہے، یعنی میری تاریکی مجھ پر لوٹ آئی، جو تم نے مجھ پر ظلم کیا، بلکہ جو میرے باطن میں تھا وہ میرے ظاہر میں سرایت کر گیا، اور نور میرے باطن میں منتقل ہو گیا، پس وہ روشن ہو گیا، اور غصے کی تاریکی کو دور کر دیا، اور اس میں توحید کا نور پھیل گیا، اور رحمت پھیل گئی، پس وہ نور ان کے ظاہر میں سرایت کر گیا، جیسے غصے کی تاریکی سرایت کر گئی تھی۔ پس ان کے رب نے ان کی دعا قبول کی اور انہیں غم سے نجات دی، تو مچھلی نے انہیں اپنے پیٹ سے فطرت سلیمہ پر پیدا شدہ بچے کی طرح باہر پھینک دیا۔ پس آدم کی اولاد میں یونس علیہ السلام کے سوا کسی نے دو پیدائشیں نہیں پائی ہیں۔ پس وہ بچے کی طرح کمزور نکلے، جیسا کہ فرمایا: \"وهُوَ سَقِيمٌ\" (اور وہ بیمار تھے)۔ اور اللہ نے انہیں کدو کے پودے سے پالا، کیونکہ اس کے پتے نرم ہوتے ہیں اور اس پر مکھی نہیں بیٹھتی۔ کیونکہ بچہ اپنی کمزوری کی وجہ سے مکھی کو اپنے سے دور نہیں کر سکتا۔ پس اللہ نے انہیں ایک ایسے درخت سے ڈھانپ دیا جس کی خاصیت یہ ہے کہ مکھی اس کے قریب نہیں آتی، ساتھ ہی اس کے پتوں کی نرمی بھی۔ کیونکہ کدو کے پتے نرمی میں روئی کی طرح ہوتے ہیں، برخلاف دیگر تمام درختوں کے پتوں کے، جن میں سختی ہوتی ہے۔ اور اللہ عزوجل نے انہیں ایک دوسری نشأت دی۔\n\n### [نیتوں کی جانچ اور حرکات میں قصد]\n\nاور جب اس گروہ نے دیکھا کہ یونس علیہ السلام پر جو کچھ آیا وہ صرف ان کے باطن سے، اس صفت سے جو ان میں قائم تھی، اور ان کے قصد سے آیا، تو انہوں نے اپنے نفوس کو نیتوں کی جانچ (تمحيص النيات) اور اپنی تمام حرکات میں قصد (القصد) میں مشغول کر لیا، تاکہ وہ صرف اسی کی نیت کریں جس کی نیت کرنے کا اللہ نے انہیں حکم دیا ہے۔ اور یہ وہ آخری حد ہے جس پر اللہ کے رجال قادر ہو سکتے ہیں۔ اور یہ گروہ رجال میں بہت کم ہے، کیونکہ یہ بہت تنگ مقام ہے، جس کے صاحب کو دائمی حضور کی ضرورت ہوتی ہے۔ اور ان میں سب سے بڑے ابو بکر صدیق رضی اللہ عنہ تھے۔ اسی لیے عمر بن خطاب رضی اللہ عنہ نے جنگ یمامہ کے بارے میں ان کے حق میں کہا: \"یہ تو بس اتنا ہوا کہ میں نے دیکھا کہ اللہ عزوجل نے ابو بکر کا سینہ قتال کے لیے کھول دیا ہے، تو میں جان گیا کہ یہ حق ہے۔\" یہ عمر کی ابو بکر کے اپنے باطن میں مشغول ہونے کی معرفت کی وجہ سے تھا۔ پس جب ان سے ظاہر میں کوئی حرکت سرزد ہوتی ہے، تو وہ صرف \"إل\" (الٰہی) سے سرزد ہوتی ہے، اور یہ نایاب ہے۔ اسی لیے متقدمین میں سے مقامات کو سمجھنے والے اہل کتاب جب سنتے تھے یا انہیں بتایا جاتا تھا کہ رسول اللہ صلی اللہ علیہ وسلم یوں فرماتے ہیں، تو وہ کہتے تھے: \"یہ کلام 'إل' سے ہی نکلا ہے،\" یعنی یہ الٰہی کلام ہے، مخلوق کا کلام نہیں ہے۔ پس دیکھو کہ علم کتنا اچھا ہے، اور یہ گروہ کس مقام پر ثابت ہوا، اور کس بنیاد کو مضبوطی سے تھاما۔ اللہ ہمیں ان میں سے بنائے۔ ان کے زیادہ تر اعمال باطن میں ہوتے ہیں۔ ان میں سے سیاحوں کے مسکن غار اور کھوہ ہوتے ہیں۔ اور شہروں میں وہ عمارتیں ہوتی ہیں جو اللہ کے دوسرے بندوں نے بنائی ہوتی ہیں۔ وہ ایک اینٹ پر دوسری اینٹ یا ایک بانس پر دوسرا بانس نہیں رکھتے۔ اور رسول اللہ صلی اللہ علیہ وسلم بھی اسی طرح تھے یہاں تک کہ اپنے رب کی طرف منتقل ہو گئے، آپ نے کبھی اپنے لیے کوئی مسکن نہیں بنایا۔\n\n### [دنیا ایک لکڑی کا پل ہے جو ایک بڑے بہتے دریا پر ہے]\n\nاس کا سبب یہ ہے کہ انہوں نے دنیا کو ایک بڑے بہتے دریا پر لکڑی کا پل (جسر) دیکھا، اور وہ اس پر سے گزرنے والے اور اس سے کوچ کرنے والے ہیں۔ تو کیا تم نے کسی کو دیکھا ہے جس نے لکڑی کے پل پر گھر بنایا ہو؟ اللہ کی قسم نہیں! خاص طور پر جب یہ معلوم ہو کہ بارشیں نازل ہوتی ہیں اور دریا سیلابوں سے بڑا ہو جاتا ہے جو آتے ہیں، اور پل ٹوٹ جاتے ہیں۔ پس جو بھی پل پر عمارت بناتا ہے، وہ اسے تباہی کے لیے پیش کرتا ہے۔ اگر دنیا کے معماروں کی بصیرت سے اللہ پردہ ہٹا دیتا، یہاں تک کہ وہ اسے پل دیکھتے اور اس دریا کو دیکھتے جس پر یہ بنائی گئی ہے کہ وہ کتنا بڑا خطرہ ہے، تو وہ وہ محلات نہ بناتے جو انہوں نے بنائے ہیں۔ پس ان کے پاس ایسی آنکھیں نہیں تھیں جن سے وہ دیکھ سکیں کہ دنیا ایک بڑے بہتے دریا پر لکڑی کا پل ہے، اور نہ ہی ان کے پاس ایسا کان تھا جس سے وہ اس رسول کا قول سن سکیں جو اس بات کو جانتا تھا جو اللہ نے اس پر وحی کی تھی کہ دنیا ایک پل ہے۔ پس نہ تو انہوں نے ایمان پر عمل کیا اور نہ ہی رؤیت اور کشف (الكشف) پر حاصل کیا۔ پس وہ ایسے ہیں جیسا کہ اللہ نے ان کے بارے میں فرمایا: \"وحَسِبُوا أَلَّا تَكُونَ فِتْنَةٌ فَعَمُوا وصَمُّوا ثُمَّ تابَ الله عَلَيْهِمْ\" (اور انہوں نے گمان کیا کہ کوئی فتنہ نہیں ہو گا، تو وہ اندھے اور بہرے ہو گئے، پھر اللہ نے ان پر توبہ قبول کی)۔ یہ اس وقت ہوا جب انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، جب آپ نے ان سے فرمایا: \"دنیا ایک پل ہے،\" اور اسی طرح کی دوسری باتیں، \"پس اپنے نفوس کو اس کی عمارت میں مشغول نہ کرو اور اٹھ کھڑے ہو!\" پس آپ صلی اللہ علیہ وسلم کے قول سے فارغ ہونے سے پہلے ہی ان میں سے بہت سے اپنی نابینائی اور بہرے پن کی طرف لوٹ گئے، باوجود اس کے کہ وہ مسلمان اور مومن تھے۔ پس اللہ تعالیٰ نے اپنے نبی کو ان کے بارے میں اپنے قول سے خبر دی: \"ثُمَّ عَمُوا وصَمُّوا كَثِيرٌ مِنْهُمْ\" (پھر ان میں سے بہت سے اندھے اور بہرے ہو گئے) توبہ کے بعد۔ وہ کہتے ہیں: \"اے میرے ولی! اگر ہم فرض کر لیں کہ دنیا باقی رہنے والی ہے، تو کیا ہم اپنی رحلت کو نسل در نسل نہیں دیکھتے؟\"\n\n### [قلوب کی نگرانی اور محبوب کے تقاضے]\n\nاس گروہ کے احوال میں سے یہ ہے کہ وہ اپنے قلوب (القلوب) کی نگرانی کرتے ہیں اور ان کے اسرار (أسرارهم) اللہ سے متعلق ہوتے ہیں، اپنے نفوس کی معرفت (المعرفۃ) کے لحاظ سے۔ اور وہ دن میں غافلوں کے ساتھ جمع نہیں ہوتے، بلکہ ان کی حرکت رات کی ہوتی ہے، اور ان پر غیب کا نظارہ غالب ہوتا ہے۔ ان پر حزن (الحزن) کا مقام غالب ہوتا ہے، کیونکہ جب حزن قلب سے ختم ہو جاتا ہے تو وہ ویران ہو جاتا ہے۔ پس عارف حلوہ اور شہد کھاتا ہے، اور بڑا محقق حنظل (اندرائن) کھاتا ہے، پس وہ کثرت سے رنجیدہ رہتا ہے، اس دنیا میں کبھی کسی نعمت سے لذت نہیں لیتا، کیونکہ وہ اس شکر میں مشغول ہوتا ہے جو اللہ نے اس پر واجب کیا ہے۔ میں ان میں سے بدنیصر میں عمر الفرقوی اور فاس شہر میں عبد اللہ السماد سے ملا۔ ان لوگوں کے مقابلے میں عارفین ایسے ہیں جیسے وہ بچے جن میں عقل نہیں ہوتی، جو جھنجھنے سے خوش ہوتے ہیں اور لذت لیتے ہیں۔ تو مریدین کے بارے میں تمہارا کیا خیال ہے؟ اور عوام کے بارے میں تمہارا کیا خیال ہے؟ ان کا توحید (التوحيد) میں قدم راسخ ہے۔ اور انہیں فہوانیت (فہمی ادراک) میں مشافہہ حاصل ہے۔ وہ اثبات پر نفی کو مقدم رکھتے ہیں، کیونکہ تنزیہ (التنزيه) ان کا شیوہ ہے، جیسے کلمہ \"لا إله إلا الله\" (اللہ کے سوا کوئی معبود نہیں)، جو رسولوں اور انبیاء کی لائی ہوئی سب سے افضل کلمہ ہے۔ ان کی توحید کونی عقلی ہے، وہ لہو و لعب میں سے کسی چیز میں نہیں ہیں۔ انہیں ہر وقت اور تمام افعال میں کامل حضور (الحضور التام) حاصل ہوتا ہے۔ وہ علم حیات اور احیاء (زندہ کرنے) کے علم کے ساتھ خاص ہیں۔ انہیں ید بیضاء (سفید ہاتھ) حاصل ہے، پس وہ حیوانات کے بارے میں وہ جانتے ہیں جو ان کے سوا کوئی نہیں جانتا، خاص طور پر ہر وہ حیوان جو اپنے پیٹ کے بل چلتا ہے، کیونکہ وہ اپنی اصل سے قریب ہوتا ہے جس سے وہ بنا ہے۔ کیونکہ ہر وہ حیوان جو اپنی اصل سے دور ہوتا ہے، اس کی اپنی اصل کی معرفت میں کمی آتی ہے، اس قدر جس قدر وہ اس سے دور ہوا۔ کیا تم مریض کو نہیں دیکھتے جو کھڑا ہونے اور بیٹھنے پر قادر نہیں ہوتا اور اپنی کمزوری کی وجہ سے بستر پر پڑا رہتا ہے، اور یہ اس کی اپنی اصل کی طرف واپسی ہے؟ تم اسے اپنے رب کا محتاج، مسکین، حال اور قال کی زبان سے ظاہر کمزوری اور حاجت والا دیکھتے ہو۔ اور یہ اس لیے کہ اس کی اصل نے اس پر حکم لگایا جب وہ اس کے قریب ہوا۔ اللہ فرماتا ہے: \"خَلَقَكُمْ من ضَعْفٍ\" (اس نے تمہیں کمزوری سے پیدا کیا) اور فرمایا: \"خُلِقَ الْإِنْسانُ ضَعِيفاً\" (انسان کمزور پیدا کیا گیا ہے)۔ پس جب وہ سیدھا کھڑا ہوتا ہے اور اپنی اصل سے دور ہوتا ہے، تو وہ فرعون بن جاتا ہے، تکبر کرتا ہے، طاقت کا دعویٰ کرتا ہے اور کہتا ہے: \"میں ہوں۔\" پس مرد وہ ہے جو اپنی صحت اور کھڑے ہونے کی حالت میں اللہ کے ساتھ ویسا ہی ہو جیسا کہ وہ بیماری اور کمزوری میں لیٹنے کی حالت میں ہوتا ہے، اور یہ نایاب ہے۔ وہ اپنے اور دوسروں کے افعال میں نیتوں کی وجہ سے شدید تحقیق کرتے ہیں، جن کی طرف وہ متوجہ ہوتے ہیں اور جن کی طرف وہ منسوب ہوتے ہیں، اپنی شدید تحقیق کی وجہ سے، تاکہ ان کے اعمال خالص ہو جائیں اور وہ انہیں دوسروں سے خالص کر لیں۔ اسی لیے انہیں نیتیون (النياتيون) کہا گیا، جیسا کہ خاص احوال کی وجہ سے ملامتیہ (الملامية) اور صوفیہ (الصوفية) کہا گیا۔ انہیں ہاجس (دل میں آنے والا خیال)، ہمت (ارادہ)، عزم (پختہ ارادہ)، ارادہ (الإرادة)، اور قصد (مقصد) کی معرفت حاصل ہے۔ یہ سب نیت سے پہلے کے احوال ہیں۔ اور نیت وہ ہے جو اس سے اپنے افعال کے شروع کرنے کے وقت ہوتی ہے، اور یہی الٰہی شریعت میں معتبر ہے۔ پس وہ اس میں تحقیق کرتے ہیں، اور یہ اخلاص (الإخلاص) کا متعلق ہے۔ اور ہمارے عالم امام سہل بن عبد اللہ اس معاملے میں بہت باریک بینی سے کام لیتے تھے، اور وہی تھے جنہوں نے خاطر (خیال) کے ٹکرانے پر متنبہ کیا، اور کہتے تھے کہ نیت وہی ہاجس (الهاجس) ہے، اور یہ ہم، عزم، ارادہ اور قصد کے پیدا ہونے کا پہلا سبب ہے۔ پس وہ اس پر اعتماد کرتے تھے، اور ہمارے نزدیک یہی صحیح ہے۔ \"والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "(باب سی و سوم در شناخت اقطاب نیت‌ها و اسرارشان و چگونگی اصولشان؛ و به آنان نیت‌گرایان (النیاتيون) گفته می‌شود)\n\nبه نام خداوند بخشنده مهربان\n\n> الروح للجسم والنيات للعمل *** تحيا بها كحياة الأرض بالمطر\n> روح برای جسم است و نیت‌ها برای عمل *** که عمل به واسطه آن زنده می‌شود، همچون زنده شدن زمین به باران\n\n> فتبصر الزهر والأشجار بارزة *** وكل ما تخرج الأشجار من ثمر\n> پس گل‌ها و درختان را آشکار می‌بینی *** و هر آنچه درختان از میوه بیرون می‌دهند\n\n> كذاك تخرج من أعمالنا صور *** لها روائح من نتن ومن عطر\n> همچنین از اعمال ما صورت‌هایی خارج می‌شود *** که بوی‌هایی دارند، از گند و از عطر\n\n> لو لا الشريعة كان المسك يخجل من *** أعرافها هكذا يقضي به نظري‏\n> اگر شریعت نبود، مشک از *** بوی‌های آن شرم می‌کرد؛ نظر من چنین حکم می‌کند\n\n> إذا كان مستند التكوين أجمعه *** له فلا فرق بين النفع والضرر\n> اگر پشتوانه تمام هستی (التكوين) *** برای اوست، پس تفاوتی میان سود و زیان نیست\n\n> فالزم شريعته تنعم بها سورا *** تحلها صور تزهو على سرر\n> پس شریعت او را لازم بگیر تا در آن از دیوارهایی بهره‌مند شوی *** که صورت‌هایی بر تخت‌ها (سرر) بر آن‌ها فرود می‌آیند\n\n> مثل الملوك تراها في أسرتها *** أو كالعرائس معشوقين للبصر\n> آن‌ها را مانند پادشاهانی در تخت‌هایشان می‌بینی *** یا مانند عروسانی که معشوق دیدگان هستند\n\n### [نیت‌ها و اعمال‏]\n\nاز حدیث رسول خدا (صلی الله علیه و سلم) روایت کرده‌ایم که فرمود: «همانا اعمال به نیت‌ها بسته‌اند (إنما الأعمال بالنيات) و همانا برای هر کس همان است که نیت کرده است (وإنما لامرئ ما نوى). پس هر کس هجرتش به سوی خدا و رسولش باشد، هجرتش به سوی خدا و رسولش است (فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله) و هر کس هجرتش برای دنیایی باشد که به آن دست یابد یا زنی که با او ازدواج کند، هجرتش به سوی همان چیزی است که به خاطر آن هجرت کرده است (ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها فهجرته إلى ما هاجر إليه)».\n\nاین را عمر بن خطاب (رضی الله عنه) روایت کرده است.\n\n### [نیت از حیث ذات واحد است، اما از حیث منویات (آنچه نیت شده) متفاوت و متعدد است]\n\nبدان که برای مراعات نیت‌ها، مردانی با حال مخصوص و وصف خاص وجود دارند که اگر خدا بخواهد، آن‌ها و احوالشان را ذکر خواهم کرد. نیت برای تمام حرکات و سکنات مکلفین در اعمال، مانند باران برای آنچه زمین می‌رویاند، است. نیت از حیث ذات خود واحد است، اما به واسطه متعلق (آنچه نیت شده) متفاوت می‌شود. پس نتیجه بر اساس متعلق است، نه بر اساس خود نیت؛ زیرا بهره نیت تنها قصد انجام یا ترک فعل است. اما اینکه آن فعل نیکو یا زشت، خیر یا شر باشد، از اثر نیت نیست، بلکه از امری عارضی است که شارع (الشارع) آن را متمایز کرده و برای مکلف تعیین نموده است. بنابراین، نیت از این وجه خاص هیچ اثری ندارد، مانند آب که منزلتش تنها در فرود آمدن یا جاری شدن در زمین است؛ اما اینکه زمین مرده به واسطه آن زنده شود یا خانه پیرزن فقیر با نزول آن ویران گردد، این‌ها به آب مربوط نیست. پس گل خوشبو و بدبو، و میوه خوب و بد، از خباثت یا طراوت مزاج آن قطعه زمین، یا از خباثت یا طراوت بذر خارج می‌شود. خداوند متعال می‌فرماید: «با آبی واحد سیراب می‌شوند (يُسْقى‏ بِماءٍ واحِدٍ) و برخی از آن‌ها را بر برخی دیگر در خوراکی برتری می‌دهیم (ونُفَضِّلُ بَعْضَها عَلى‏ بَعْضٍ في الْأُكُلِ)». سپس فرمود: «همانا در این امر نشانه‌هایی است برای قومی که تعقل می‌کنند (إِنَّ في ذلِكَ لَآياتٍ لِقَوْمٍ يَعْقِلُونَ)». پس نیت در این میان جز امدادرسانی نقشی ندارد، چنانکه خداوند متعال فرمود: «بسیاری را به واسطه آن گمراه می‌کند و بسیاری را هدایت می‌کند (يُضِلُّ به كَثِيراً ويَهْدِي به كَثِيراً)»؛ یعنی مثلی که در قرآن زده شده است، یعنی به سبب آن (قرآن)، و آن خود از قرآن است. همان‌طور که آب سبب ظهور این بوها و طعم‌های مختلف است، نیت‌ها نیز سبب اعمال صالحه و غیر صالحه هستند.\n\n### [هدایت و گمراهی‏]\n\nو معلوم است که تمام قرآن هدایت است، اما به واسطه تأویل در مثل زده شده، هر که گمراه شد، گمراه شد و هر که هدایت یافت، هدایت یافت. پس حقیقت آن از جهت اینکه مَثَل است، تغییر نکرده است، بلکه عیب در چشم فهم واقع شده است. همچنین نیت حقیقت خود را داده است، که همان تعلقش به منوی (آنچه نیت شده) است؛ اما اینکه آن منوی نیکو یا زشت باشد، به نیت مربوط نیست، بلکه به صاحب حکمی مربوط است که حکم به نیکویی و زشتی آن می‌دهد. خداوند متعال فرمود: «همانا ما راه را به او نشان دادیم (إِنَّا هَدَيْناهُ السَّبِيلَ)»؛ یعنی راه سعادت و شقاوت را برای او بیان کردیم. سپس فرمود: «یا شاکر باشد یا ناسپاس (إِمَّا شاكِراً وإِمَّا كَفُوراً)». این به مخاطب مکلف بازمی‌گردد؛ اگر نیت خیر کند، خیر ثمر می‌دهد و اگر نیت شر کند، شر ثمر می‌دهد. پس آنچه بر او وارد می‌شود، تنها از محل (فرد) است، از طراوت یا خباثت آن. خداوند می‌فرماید: «و بر خداست که راه را نشان دهد (وعَلَى الله قَصْدُ السَّبِيلِ)»؛ یعنی این را بر خود واجب کردم. گویی خداوند می‌گوید: بر کسی از شما که جانب حق را لازم می‌گیرد، واجب است که راه رساننده به سعادتتان را برای شما بیان کند، و من چنین کرده‌ام، زیرا شما آن را جز با آگاهی و بیان من نمی‌شناسید.\n\n### [دو راه سعادت و شقاوت و ایجاب الهی‏]\n\nو سبب آن این است که در علم الهی سبقت گرفته است که راه سعادت بندگان تنها در سببی خاص است و سبب شقاوتشان نیز تنها در راهی خاص است، و آن چیزی نیست جز عدول از راه سعادت، که همان ایمان به خدا و آنچه از جانب خدا آمده و ما را به ایمان به آن ملزم کرده است. و چون عالَم در حال جهل نسبت به آنچه در علم خدا از تعیین آن راه وجود دارد، بود، اعلام آن به صفت کلام ضروری شد. پس ناگزیر از رسول است. خداوند متعال فرمود: «و ما عذاب‌کننده نبودیم تا اینکه رسولی بفرستیم (وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا)». و ما بر خدا چیزی را واجب نمی‌کنیم مگر آنچه را که او بر خود واجب کرده است. و او تعریف (شناساندن) را بر خود واجب کرده است با این قولش: «و بر خداست که راه را نشان دهد (وعَلَى الله قَصْدُ السَّبِيلِ)»، مانند قولش: «و یاری مؤمنان بر ما حق بود (وكانَ حَقًّا عَلَيْنا نَصْرُ الْمُؤْمِنِينَ)» و قولش: «پروردگارتان رحمت را بر خود مقرر کرده است (كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ)». و در حقیقت، این امر تنها بر نسبت (النسبة) واجب شده است، نه بر ذات او؛ زیرا او متعالی‌تر از آن است که چیزی به واسطه حد واجب شرعی بر او واجب شود. پس گویی چون علم الهی از ازل به تعیین راهی که سعادت ما در آن است تعلق گرفت، و علم به خودی خود صورت ابلاغ را نداشت، و ابلاغ از صفت کلام بود، ابلاغ بر نسبتِ متکلم بودن او واجب شد تا راهی را که سعادت بندگان در آن است و علم آن را تعیین کرده، تعریف کند. پس کلام الهی با ترجمه از علم، آنچه را که علم تعیین کرده بود، آشکار ساخت. بنابراین، وجوب بر نسبت (النسبة) بود، زیرا نسبت‌ها متفاوتند. و همچنین است سایر نسبت‌های الهی از اراده و قدرت و غیره.\n\n### [اسماء و ذات‏]\n\nما در کتاب *عنقاء مغرب* (عنقاء مغرب) که بابی را به «محاوره ازلی بر نشأت ابدی» اختصاص دادیم، و همچنین در کتاب *انشاء الجداول والدوائر* (انشاء الجداول والدوائر) خود، حضور، محاوره و مجارات اسماء الهی در میدان مناظره بر ایجاد این عالم را که عبارت است از هر آنچه غیر خداست، بیان کرده‌ایم. پس اگر به علم نسبت‌ها (النسب) فطانت داشته باشی، دانسته‌ای که چگونه وجوب الهی بر حضرت الهیه تعلق گرفته است. و بر این اساس است که قول خداوند متعال تفسیر می‌شود: «روزی که پرهیزگاران را به سوی رحمان، به صورت هیئت‌های پذیرایی، محشور می‌کنیم (يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً)». و چگونه کسی که همنشین و در قبضه اوست، به سوی او محشور می‌شود؟ ابویزید بسطامی شنید که قاری این آیه را می‌خواند: «روزی که پرهیزگاران را به سوی رحمان، به صورت هیئت‌های پذیرایی، محشور می‌کنیم (يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً)». پس گریست تا جایی که اشک او به منبر اصابت کرد، بلکه روایت شده که خون از چشمانش پرید و به منبر خورد. فریاد زد و گفت: شگفتا! چگونه کسی که همنشین اوست، به سوی او محشور می‌شود؟ وقتی زمان ما فرا رسید، در این باره از ما سؤال شد. گفتم: شگفتی تنها از سخن ابویزید است. پس بدانید که این امر به این دلیل است که پرهیزگار (المتقي) همنشین جبار است، پس از سطوت او پرهیز می‌کند. و اسم رحمان از جهت رحمان بودنش سطوتی ندارد، بلکه رحمان نرمی، لطف، عفو و مغفرت می‌بخشد. به همین دلیل، از اسم جبار که سطوت و هیبت می‌بخشد، به سوی او محشور می‌شوند؛ زیرا او (خداوند) در دنیا از جهت پرهیزگار بودنشان، همنشین پرهیزگاران است. و بر این شیوه، تمام اسماء الهی را در نظر بگیر، و همچنین آن‌ها را در هر جا که در زبان‌های نبوت‌ها آمده‌اند، خواهی یافت، اگر قصد حقیقت اسم و تمایز آن از غیرش را داشته باشی؛ زیرا اسم دو دلالت دارد: دلالتی بر مسمای خود و دلالتی بر حقیقت خود که به واسطه آن از اسم دیگر متمایز می‌شود. پس بفهم.\n\n### [سماع مطلق و سماع مقید]\n\nو بدان که سبب اشتغال این مردان به معرفت نیت، این بود که به کلمه و آنچه در آن است نظر کردند و دانستند که حروف آن تألیف و جمع نشده‌اند مگر برای ظهور نشأتی قائم که دلالت بر معنایی کند که کلمه برای آن در اصطلاح جمع شده است. پس هنگامی که متکلم آن را بر زبان می‌آورد، همّ شنونده در فهم معنایی است که کلمه برای آن آمده است؛ زیرا فایده با آن حاصل می‌شود. و به همین دلیل، کلمه در آن زبان بر این وضع خاص یافت شده است. و به همین دلیل، این مردان به دلیل علو همتشان، قائل به سماع مقید به نغمات نیستند و قائل به سماع مطلق هستند؛ زیرا سماع مطلق در آن‌ها جز فهم معانی تأثیر نمی‌کند، و آن سماع روحانی الهی است و سماع اکابر است. اما سماع مقید تنها در اصحابش نغمه تأثیر می‌گذارد، و آن سماع طبیعی است. پس اگر کسی ادعا کند که در سماع مقید به الحان، معنا را می‌شنود و می‌گوید اگر معنا نبود، حرکت نمی‌کردم، و ادعا کند که از حکم طبیعت در آن (یعنی در سبب محرک) خارج شده است، صادق نیست. ما کسانی از متشیخین (مدعیان شیخی) که بر طریقت طفیلی هستند، دیده‌ایم که چنین ادعایی کرده‌اند. صاحب این ادعا اگر صادق نباشد، سریعاً رسوا می‌شود. و آن این است که اگر این مدعی در مجلس سماع حاضر شد، به او توجه کن. هنگامی که قوال (خواننده) با آن نغمات که طبعاً مزاج مستعد را به حرکت درمی‌آورند، شروع به خواندن می‌کند و احوال در نفوس حیوانی (الحيوانية) جاری می‌شود و هیکل‌ها را به حرکت دورانی درمی‌آورد به حکم استداره فلک؛ و این دور (حرکت دورانی) دلالت بر آن دارد که سماع طبیعی است، زیرا لطیفه انسانی از فلک نیست، بلکه از روح دمیده شده است و غیر متحیز است، پس فوق فلک است. بنابراین، در جسم، حرکت دورانی یا غیر دورانی ندارد، بلکه این حرکت برای روح حیوانی است که تحت طبیعت و فلک قرار دارد. پس نسبت به نشأت خود و نسبت به آنچه تو را به حرکت درمی‌آورد، جاهل مباش. اگر این مدعی به حرکت درآمد و حال او را گرفت و چرخید یا بدون دور به سمت بالا پرید و از احساس خود و مجلسی که در آن است غایب شد، هنگامی که از حالش فارغ شد و به احساس خود بازگشت، از او بپرس چه چیزی تو را به حرکت درآورد؟ او می‌گوید: قوال چنین و چنان گفت و من از آن معنای چنین و چنان را فهمیدم، و آن معنا مرا به حرکت درآورد. پس به او بگو: تو را جز زیبایی نغمه به حرکت درنیاورد و فهم تنها به حکم تبعیت برای تو حاصل شد. طبع بر حیوانیت تو حکم کرد، پس تفاوتی میان تو و شتر در تأثیر نغمه بر تو نیست. چنین سخنی بر او گران و سنگین می‌آید و می‌گوید: تو مرا نشناختی و ندانستی چه چیزی مرا به حرکت درآورد. ساعتی ساکت شو. زیرا غفلت بر صاحب این ادعا غالب است. سپس با او در مورد کلامی که همان معنا را می‌دهد، سخن بگو. به او بگو: چقدر نیکوست قول خداوند متعال آنجا که می‌فرماید: و آیه‌ای از کتاب خدا را که متضمن همان معنایی است که او را از صدای مغنی به حرکت درآورده بود، بر او بخوان و آن را برایش محقق کن تا آن را دریابد. پس او با تو در آن سخن می‌گوید و صحبت می‌کند، اما نه حالی او را می‌گیرد و نه حرکتی و نه فنایی (الفناء)، بلکه آن را نیکو می‌شمارد و می‌گوید: این آیه متضمن معنای بزرگی از معرفت بالله (المعرفة) است. پس رسوایی او در ادعایش چقدر شدید است! به او بگو: ای برادر، همین معنای دقیقاً همان چیزی است که به من گفتی دیشب در سماع، هنگامی که قوال آن را در شعر خود با نغمه خوش آورد، تو را به حرکت درآورد. پس به چه معنایی حال دیشب در تو جاری شد، در حالی که این معنا در آنچه برایت ساختم و با کلام حق تعالی که بالاتر و صادق‌تر است، آوردم، موجود است و تو را ندیدم که با وجود نیکو شمردن و حصول فهم، به اهتزاز درآیی؟ تو دیشب «مانند کسی که شیطان او را مس کرده، آشفته بودی (يتخبطك الشَّيْطانُ من الْمَسِّ)» چنانکه خداوند متعال فرمود، و سماع طبیعی تو را از عین فهم محجوب کرد. پس در سماع تو جز جهل به خودت حاصل نشد. کسی که میان فهم و حرکت خود تفاوت نمی‌گذارد، چگونه امید رستگاری او می‌رود؟\n\n### [وارد طبیعی، روحانی و الهی‏]\n\nپس سماع از عین فهم، سماع الهی است. و اگر بر صاحبش وارد شود و او نسبت به آنچه وارد می‌شود قوی باشد، نهایت فعل آن در جسم این است که او را به زمین می‌اندازد و بس، و او را از احساس خود غایب می‌کند و هیچ حرکتی از او صادر نمی‌شود، چه از مردان اکابر باشد و چه از صغار. این حکم وارد الهی قوی است و این همان چیزی است که میان آن و حکم وارد طبیعی تفاوت می‌گذارد؛ زیرا وارد طبیعی، همان‌طور که گفتیم، او را به حرکت دورانی، سرگردانی و آشفتگی (فعل دیوانه) وامی‌دارد. اما وارد الهی او را به زمین می‌اندازد به دلیلی که برایت ذکر می‌کنم: و آن این است که نشأت انسان از خاک آفریده شده است. خداوند متعال فرمود: «از آن شما را آفریدیم و در آن بازتان می‌گردانیم و از آن شما را بیرون می‌آوریم (مِنْها خَلَقْناكُمْ وفِيها نُعِيدُكُمْ ومِنْها نُخْرِجُكُمْ)». اگرچه در او از تمام عناصر وجود دارد، اما عنصر اعظم خاک است. خداوند عز و جل در مورد عیسی نیز فرمود: «همانا مَثَل عیسی نزد خدا مانند مَثَل آدم است که او را از خاک آفرید (إِنَّ مَثَلَ عِيسى‏ عِنْدَ الله كَمَثَلِ آدَمَ خَلَقَهُ من تُرابٍ)». و انسان در نشستن و ایستادنش از اصل اعظم خود که از آن نشأت گرفته، از بیشتر جهات دور است؛ زیرا نشستن، ایستادن و رکوع او فروع هستند. پس هنگامی که وارد الهی به او می‌رسد، و وارد الهی صفت قیومیت دارد، و این صفت در انسان از حیث جسمیتش به حکم عَرَض است، و روح مدبر اوست که او را برپا می‌داشت و می‌نشاند. پس اگر روح انسانی مدبر، به واسطه آنچه از علوم الهی از وارد الهی دریافت می‌کند، از تدبیر جسمش مشغول شود، دیگر کسی برای جسم باقی نمی‌ماند که قیام و قعود او را حفظ کند. پس به اصل خود بازمی‌گردد، که همان چسبیدن به زمین است که از آن به اضطجاع (به پهلو افتادن) تعبیر می‌شود، حتی اگر بر تختی باشد؛ زیرا تخت مانع رسیدن او به خاک است. پس هنگامی که روحش از آن دریافت فارغ شد و وارد به سوی پروردگارش بازگشت، روح به تدبیر جسدش بازمی‌گردد و او را از حالت افتادگی بلند می‌کند. این سبب به پشت افتادن انبیا هنگام نزول وحی بر آن‌هاست. و هرگز شنیده نشده است که پیامبری هنگام نزول وحی آشفته شده باشد. این در حالی است که واسطه (ملک) در وحی وجود دارد. پس چگونه است اگر وارد با رفع واسطه‌ها باشد؟ صحیح نیست که از او غیبت از احساسش رخ دهد یا از حالی که بر آن است تغییر کند؛ زیرا وارد الهی با رفع واسطه‌های روحانی در تمامیت انسان جاری می‌شود و هر عضو، بلکه هر جوهر فردی در او، بهره خود را از آن وارد الهی، چه لطیف و چه کثیف، می‌گیرد. و همنشین او این را احساس نمی‌کند و هیچ تغییری در حال او که بر آن است، برای همنشینش رخ نمی‌دهد. اگر در حال خوردن باشد، بر خوردن خود باقی می‌ماند، یا نوشیدن، یا سخنی که در آن است. زیرا آن وارد فراگیر است و این همان قول خداوند متعال است: «و او با شماست هر جا که باشید (وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ)». پس هر کس در آن وقت، «أینیت» (کجا بودنش) حالت خوردن یا نوشیدن یا سخن گفتن یا بازی یا هر چیز دیگری باشد، بر حال خود باقی می‌ماند.\n\n### [محاسبه نفس و مراعات انفاس‏]\n\nهنگامی که این طایفه جلیل این تفاوت را میان واردات طبیعی، روحانی و الهی دیدند و مشاهده کردند که التباس بر کسانی که گمان می‌کنند از رجال خدا هستند، عارض شده است، از اینکه به جهل و خلط متصف شوند، ننگ داشتند؛ زیرا آن (جهل و خلط) محل وجود طبیعی است. پس همتشان به اشتغال به نیت‌ها (النیات) ارتقا یافت، زیرا خداوند به آن‌ها فرموده بود: «و امر نشدند مگر برای اینکه خدا را بپرستند در حالی که دین را برای او خالص کرده باشند (وما أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ)». و اخلاص همان نیت است. و به همین دلیل آن را با قید «برای او (لَهُ)» محدود کرد و نگفت «مخلصین»؛ و این از استخلاص (خالص کردن) است. زیرا انسان ممکن است نیت خود را برای شیطان خالص کند و مخلص نامیده شود، در حالی که در عملش چیزی برای خدا نباشد. و ممکن است برای شریک خالص کند، و ممکن است برای خدا خالص کند. به همین دلیل خداوند متعال فرمود: «دین را برای او خالص کنند (مُخْلِصِينَ لَهُ الدِّينَ)»، نه برای غیر او و نه برای حکم شرکت. پس آن‌ها نفوس خود را به اصل در قبول اعمال و نیل به سعادات و موافقت با طلب الهی از آن‌ها در آنچه به آن مکلف کرده است، مشغول کردند، که همان اعمال خالص برای اوست و از آن به نیت تعبیر می‌شود. پس به دلیل غلبه اشتغالشان به نیت، به آن منسوب شدند و محقق ساختند که اعمال به خودی خود مطلوب نیستند، بلکه از حیث آنچه به آن قصد شده است، مطلوبند، که همان نیت در عمل است، مانند معنا در کلمه؛ زیرا کلمه به خودی خود مطلوب نیست، بلکه به خاطر آنچه دربردارد، مطلوب است. پس ای برادر، ببین که نظر این مردان چقدر دقیق است. و این همان چیزی است که در طریقت از آن به محاسبه نفس تعبیر می‌شود. و رسول خدا (صلی الله علیه و سلم) فرمود: «پیش از آنکه مورد محاسبه قرار گیرید، خود را محاسبه کنید (حاسبوا أنفسكم قبل أن تحاسبوا)».\n\nمن دو نفر از این مردان را ملاقات کردم: ابوعبدالله بن مجاهد و ابوعبدالله بن قسوم در اشبیلیه. این مقام آن‌ها بود و آن‌ها از اقطاب رجال نیت‌گرا (النیاتيون) بودند. هنگامی که ما به تأسی از آن‌ها و اصحابشان و امتثال امر رسول خدا (صلی الله علیه و سلم) که امتثال آن در امر «خود را محاسبه کنید» واجب است، وارد این مقام شدیم، مشایخ ما نفوس خود را بر آنچه می‌گفتند و انجام می‌دادند، محاسبه می‌کردند و آن را در دفتری ثبت می‌نمودند. پس از نماز عشاء، هنگامی که در خانه‌های خود خلوت می‌کردند، نفوس خود را محاسبه می‌کردند و دفتر خود را حاضر می‌ساختند و به آنچه در روز از قول و عمل از آن‌ها صادر شده بود، نگاه می‌کردند و هر عملی را با آنچه سزاوار آن بود، مقابله می‌کردند؛ اگر مستحق استغفار بود، استغفار می‌کردند، اگر مستحق توبه بود، توبه می‌کردند، و اگر مستحق شکر بود، شکر می‌کردند، تا اینکه از آنچه در آن روز از آن‌ها صادر شده بود، فارغ می‌شدند. پس از آن می‌خوابیدند. ما در این باب بر آن‌ها افزودیم و آن ثبت خواطر (الخواطر) بود. ما آنچه را که نفوسمان با ما سخن می‌گفت و آنچه را که قصد می‌کرد، علاوه بر کلام و افعالمان، ثبت می‌کردیم. من نیز در آن زمان نفسم را مانند آن‌ها محاسبه می‌کردم و دفتر را حاضر می‌ساختم و آن را به تمام آنچه به ذهنش خطور کرده بود و آنچه با خود گفته بود و آنچه از آن به حس ظاهر شده بود از قول و عمل، و آنچه در آن خاطر و حدیث نیت کرده بود، بازخواست می‌کردم. پس گفتم: خواطر و فضول (سخنان بیهوده) جز در آنچه اهمیت دارد، ممنوع است. این فایده این باب و فایده اشتغال به نیت است. و در طریقت چیزی نیست که بیشتر از این باب از آن غفلت شود، زیرا این امر به مراعات انفاس (لحظات) بازمی‌گردد و آن بسیار عزیز است.\n\n### [قلب یونس یا ولادت دوم]\n\nو پس از آنکه اصول این طایفه و سبب اشتغالشان به آن را که امری شرعی است و اسرار و علومی که در آن دارند، به تو شناساندم، مقام آن‌ها را نیز در این باره و آنچه برایشان هست، بدان. این طایفه بر قلب یونس (علیه السلام) هستند. زیرا هنگامی که «خشمگین رفت (ذَهَبَ مُغاضِباً)» و گمان کرد که خداوند بر او تنگ نمی‌گیرد، به دلیل آنچه از وسعت رحمت خدا در حق خود می‌دانست، و آن وسعت الهی رحمانی را در حق غیر خود ندید تا امت او نیز از آن بهره‌مند شوند و آن را به خود محدود کرد. و غضب، ظلمت قلب است. پس به دلیل علو منصبش، در ظاهر او تأثیر گذاشت. پس او را در ظلمت شکم ماهی، تا هر زمان که خدا خواست، ساکن کرد تا خداوند او را به حالتی که در شکم مادرش جنین بود، آگاه سازد؛ اینکه چه کسی او را در آنجا تدبیر می‌کرد و آیا در آن موطن تصور می‌شد که او خشمگین شود یا مورد خشم قرار گیرد؟ بلکه در کنف خدا بود و جز پروردگارش را نمی‌شناخت. پس او را به این حالت در شکم ماهی بازگرداند تا او را با فعل، نه با قول، تعلیم دهد. پس «در تاریکی‌ها ندا داد که معبودی جز تو نیست (فَنادى‏ في الظُّلُماتِ أَنْ لا إِلهَ إِلَّا أَنْتَ)»؛ این عذری است از جانب امت خود در این توحید، یعنی هر چه می‌خواهی انجام می‌دهی و رحمتت را بر هر که بخواهی می‌گسترانی. «منزهی تو، همانا من از ستمکاران بودم (سُبْحانَكَ إِنِّي كُنْتُ من الظَّالِمِينَ)»؛ مشتق از ظلمت (تاریکی)، یعنی ظلمت من بر من بازگشت، بلکه آنچه در باطن من بود، به ظاهر من سرایت کرد و نور به باطن من منتقل شد و روشن گشت. پس ظلمت خشم را از بین برد و نور توحید در آن منتشر شد و رحمت گسترده گشت. پس آن نور در ظاهر او سرایت کرد، همان‌طور که ظلمت غضب سرایت کرده بود. پس پروردگارش دعای او را اجابت کرد و او را از غم نجات داد. ماهی او را از شکم خود بیرون انداخت، در حالی که بر فطرت سلیمه متولد شده بود. هیچ کس از فرزندان آدم جز یونس (علیه السلام) دو ولادت نداشت. او ضعیف مانند کودک خارج شد، چنانکه فرمود: «و او بیمار بود (وهُوَ سَقِيمٌ)». و او را با کدو (الیقطین) پرورش داد؛ زیرا برگ آن نرم است و مگس بر آن نمی‌نشیند. چون کودک به دلیل ضعفش نمی‌تواند مگس را از خود دور کند، او را با درختی پوشاند که خاصیتش این است که مگس به آن نزدیک نمی‌شود، همراه با نرمی برگش؛ زیرا برگ کدو مانند پنبه نرم است، برخلاف سایر برگ درختان که در آن‌ها خشونت وجود دارد. و خداوند عز و جل او را نشأتی دیگر بخشید.\n\n### [خالص‌سازی نیت‌ها و قصد در حرکات‏]\n\nو چون این طایفه دیدند که آنچه بر یونس (علیه السلام) وارد شد، تنها از باطن او، از صفتی که در او قائم بود و از قصدش، بود، نفوس خود را به خالص‌سازی نیت‌ها (تمحيص النيات) و قصد در تمام حرکاتشان مشغول کردند تا جز آنچه خداوند به آن‌ها امر کرده که نیت و قصد کنند، نیت نکنند. و این نهایت چیزی است که مردان خدا می‌توانند انجام دهند. و این طایفه در میان مردان اندک هستند، زیرا این مقام بسیار تنگ است و صاحبش به حضور دائمی نیاز دارد. و بزرگترین کسی که در این مقام بود، ابوبکر صدیق (رضی الله عنه) بود. و به همین دلیل عمر بن خطاب (رضی الله عنه) در مورد او در جنگ یمامه گفت: «چیزی نگذشت جز اینکه دیدم خداوند عز و جل سینه ابوبکر را برای جنگ گشاده کرده است، پس دانستم که حق است». این به دلیل معرفت عمر به اشتغال ابوبکر به باطن خود بود. پس اگر حرکتی در ظاهر او صادر می‌شد، جز از «إل» (حق/خدا) صادر نمی‌شد، و این عزیز است. و به همین دلیل، کسانی از متقدمین اهل کتاب که مقامات را می‌فهمیدند، هنگامی که می‌شنیدند یا به آن‌ها گفته می‌شد که رسول خدا (صلی الله علیه و سلم) چنین و چنان می‌گوید، می‌گفتند: این کلام جز از «إل» خارج نشده است؛ یعنی کلامی الهی است، نه کلام مخلوق. پس ببین که این علم چقدر نیکوست و این طایفه در چه مقامی ثابت شده‌اند و به چه پایه‌ای چنگ زده‌اند. خداوند ما را از آن‌ها قرار دهد. بیشتر اعمال آن‌ها در باطن است. مسکن‌های سیاحان (السائحين) از آن‌ها، غارها و کهف‌هاست. و در شهرها، آنچه دیگر بندگان خدا ساخته‌اند. آن‌ها لبنه‌ای بر لبنه و نی‌ای بر نی نمی‌گذارند. و رسول خدا (صلی الله علیه و سلم) نیز چنین بود تا اینکه به سوی پروردگارش منتقل شد و هرگز مسکنی برای خود نساخت.\n\n### [دنیا پل چوبی بر روی رودخانه‌ای بزرگ و خروشان]\n\nو سبب آن این است که آن‌ها دنیا را پلی دیدند که از چوب بر روی رودخانه‌ای بزرگ نصب شده است و آن‌ها از آن عبور می‌کنند و از آن کوچ می‌کنند. آیا دیده‌اید کسی خانه‌ای بر روی پل چوبی بسازد؟ نه به خدا سوگند! به ویژه وقتی دانسته شود که باران‌ها می‌بارند و رودخانه با سیل‌هایی که می‌آیند بزرگ می‌شود و پل‌ها قطع می‌شوند. پس هر کس بر روی پل بسازد، خود را در معرض تلف قرار می‌دهد. اگر خداوند پرده از بصیرت آبادکنندگان دنیا برمی‌داشت تا آن را پلی ببینند و رودخانه‌ای را که بر آن بنا شده، خطری قوی ببینند، قصرهای باشکوهی را که ساخته‌اند، بنا نمی‌کردند. آن‌ها چشمانی نداشتند که با آن ببینند که دنیا پل چوبی بر روی رودخانه‌ای بزرگ و خروشان است، و گوشی نداشتند که با آن قول رسولی را بشنوند که به آنچه خدا به او وحی کرده، عالم است که دنیا پل است. پس نه به ایمان عمل کردند و نه به رؤیت و کشف (الکشف) دست یافتند. آن‌ها همان‌طور هستند که خداوند در موردشان فرمود: «و گمان کردند که فتنه‌ای نخواهد بود، پس کور و کر شدند (وحَسِبُوا أَلَّا تَكُونَ فِتْنَةٌ فَعَمُوا وصَمُّوا)». سپس «خداوند توبه آن‌ها را پذیرفت (ثُمَّ تابَ الله عَلَيْهِمْ)» در حالی که از رسول (صلی الله علیه و سلم) می‌شنیدند، هنگامی که به آن‌ها گفت: دنیا پل است.\n\nو مانند این‌ها. پس نفوس خود را به آبادانی آن مشغول نکنید و برخیزید. هنوز سخن او (صلی الله علیه و سلم) تمام نشده بود که بسیاری از آن‌ها به کوری و کری خود بازگشتند، با وجود اینکه مسلمان و مؤمن بودند. پس خداوند متعال پیامبرش را با این قول آگاه ساخت: «سپس بسیاری از آن‌ها کور و کر شدند (ثُمَّ عَمُوا وصَمُّوا كَثِيرٌ مِنْهُمْ)» پس از توبه. می‌گوید: ای ولی، اگر فرض کنیم دنیا باقی بماند، آیا کوچ کردن ما از آن، نسلی پس از نسل، را نمی‌بینیم؟\n\n### [مراعات قلب‌ها و مقتضیات «محبوب»]\n\nاز احوال این طایفه، مراعات قلب‌هایشان است و اسرارشان از حیث معرفت نفوسشان به خدا تعلق دارد. و در روز با غافلان اجتماع نمی‌کنند، بلکه حرکتشان شبانه است و نظرشان در غیب است. مقام حزن بر آن‌ها غالب است؛ زیرا اگر حزن از قلب زائل شود، قلب ویران می‌شود. عارف شیرینی و عسل می‌خورد، اما محقق کبیر حنظل (هندوانه ابوجهل) می‌خورد. پس او بسیار تلخ‌کام است و هرگز از نعمتی لذت نمی‌برد، مادامی که در این دنیاست، به دلیل اشتغالش به شکر آن نعمت که خداوند او را به آن مکلف کرده است. من از این مردان در دینسر، عمر الفرقوی و در شهر فاس، عبدالله السماد را ملاقات کردم. عارفان در مقایسه با این‌ها مانند کودکانی هستند که عقل ندارند و به جغجغه شاد می‌شوند و لذت می‌برند. پس گمانت به مریدان چیست؟ و گمانت به عوام چیست؟ آن‌ها قدمی راسخ در توحید دارند و در فهوانیت (فهم) مشافهه دارند. نفی را بر اثبات مقدم می‌دارند، زیرا تنزیه شأن آن‌هاست، مانند لفظ «لا إله إلا الله» که بهترین کلمه‌ای است که رسولان و انبیا آورده‌اند. توحید آن‌ها، توحید کونی عقلی است. آن‌ها در لهو و لعب نیستند. حضور تام و دائمی در تمام افعال دارند. به علم حیات و احیا اختصاص یافته‌اند. دست بیضا (ید بیضاء) دارند و از حیوانات چیزی می‌دانند که غیر آن‌ها نمی‌داند، به ویژه از هر حیوانی که بر شکم خود راه می‌رود، به دلیل نزدیکی‌اش به اصل خود که از آن تکوین یافته است؛ زیرا هر حیوانی که از اصل خود دور شود، به اندازه دوری‌اش از معرفت به اصل خود کاسته می‌شود. آیا نمی‌بینی بیمار را که به دلیل ضعفش قادر به ایستادن و نشستن نیست و بر زمین افتاده است؟ این بازگشت او به اصلش است. او را می‌بینی که به پروردگارش فقیر است، مسکین است، ضعف و نیاز آشکار دارد، با زبان حال و قال. و این به دلیل آن است که اصلش بر او حکم کرده است، هنگامی که به آن نزدیک شده است. خداوند می‌فرماید: «شما را از ضعف آفرید (خَلَقَكُمْ من ضَعْفٍ)» و فرمود: «انسان ضعیف آفریده شده است (خُلِقَ الْإِنْسانُ ضَعِيفاً)». هنگامی که راست می‌ایستد و از اصل خود دور می‌شود، فرعون‌صفت و متکبر می‌شود و ادعای قدرت می‌کند و می‌گوید: «من». پس مرد کسی است که در حال ایستادن و سلامتی‌اش با خدا باشد، همانند حالش در افتادگی از بیماری و ضعف، و این عزیز است. آن‌ها در نظر به افعال خود و افعال دیگران با خود، به دلیل نیت‌هایی که با آن متوجه می‌شوند و به آن منسوب می‌گردند، بحث شدیدی دارند، به دلیل شدت جستجوی آن‌ها برای نیت، تا اعمال برایشان خالص شود و آن‌ها را از غیر خود خالص سازند. و به همین دلیل به آن‌ها نیت‌گرایان (النیاتيون) گفته شده است، همان‌طور که به دلیل احوال خاصی که بر آن هستند، ملامتیه (الملامية) و صوفیه (الصوفية) گفته شده است. آن‌ها معرفت هاجس (الهاجس)، همت (الهمة)، عزم (العزم)، اراده (الإرادة) و قصد (القصد) را دارند. و این‌ها همگی احوالی هستند که مقدم بر نیت‌اند. و نیت همان است که هنگام مباشرت افعال از او صادر می‌شود و در شرع الهی معتبر است. پس در آن بحث می‌کنند و آن متعلق اخلاص است. عالم ما، امام سهل بن عبدالله، در این شأن دقت می‌کرد و او بود که بر «نقر الخاطر» (تأثیرگذاری خاطر) تنبه داد و می‌گفت: نیت همان هاجس است و آن سبب اول در حدوث هم، عزم، اراده و قصد است. پس بر آن اعتماد می‌کرد و این نزد ما صحیح است. «و خداوند حق را می‌گوید و او راه را هدایت می‌کند (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)»."
  },
  "page_count": 5
}