{
  "id": 535,
  "title": {
    "ar": "الباب الخامس والثلاثون وخمسمائة في معرفة حال قطب كان منزله قوله جل ثناؤه وتقدست أسماؤه الَّذِينَ يَذْكُرُونَ الله قِياماً وقُعُوداً وعَلى‏ جُنُوبِهِمْ",
    "en": "Chapter Five Hundred and Thirty-Five: Concerning the knowledge of the state (حال) of a Pole (قطب) whose station was the saying of Him, exalted be His praise and sanctified be His Names: <<الَّذِينَ يَذْكُرُونَ الله قِياماً وقُعُوداً وعَلى‏ جُنُوبِهِمْ>> (Those who remember Allah standing, sitting, and lying on their sides).",
    "ur": "باب پانچ سو پینتیس: ایک قطب (Qutb) کے حال کی معرفت (Ma'rifa) کے بیان میں جس کا روحانی مقام اللہ تعالیٰ کا یہ فرمان تھا: الَّذِينَ يَذْكُرُونَ الله قِياماً وقُعُوداً وعَلى‏ جُنُوبِهِمْ (وہ لوگ جو اللہ کو کھڑے، بیٹھے اور اپنے پہلوؤں پر لیٹے ہوئے یاد کرتے ہیں۔)",
    "fa": "باب پانصد و سی و پنجم: در معرفت (معرفة) حال قطبی (قطب) که منزل او این قول خداوند جل ثناؤه و تقدست أسماؤه بود: «الَّذِينَ يَذْكُرُونَ الله قِياماً وقُعُوداً وعَلى‏ جُنُوبِهِمْ» (آنان که خدا را ایستاده و نشسته و بر پهلوهای خود یاد می‌کنند.)"
  },
  "content": {
    "ar": "## «الباب الخامس والثلاثون وخمسمائة في معرفة حال قطب كان منزله قوله جل ثناؤه وتقدست أسماؤه الَّذِينَ يَذْكُرُونَ الله قِياماً وقُعُوداً وعَلى‏ جُنُوبِهِمْ»\n\n\n> الذاكرون بكل حال ربهم *** هم أهل كل فضيلة في العالم‏\n\n\n> لا يشهدون سواه في أعيانهم *** فهم الملوك على الوجود الدائم‏\n\n\n> قاموا بحق الله لا بحقوقهم *** في راقد أو قاعد أو قائم‏\n\n\n> حازوا الكمال فلم يكن لسواهم *** هذا المقام من الآلة الحاكم‏\n\n\n> لهم التفكر في تعلق وصفه *** بوجودهم ووجود كل العالم‏\n\n\n### [التخلق بالقيومية]\n\n\nاعلم أيدنا الله وإياك بِرُوحٍ مِنْهُ أن الأصل في الخلق حالة الرقاد حتى يكون الحق يقيمه إما لجلوس فينال نصيبا من الرحمة قال تعالى وكُنْتُمْ أَمْواتاً فَأَحْياكُمْ وإما لقيام فينال نصيبا من آية قوله تعالى أَ فَمَنْ هُوَ قائِمٌ عَلى‏ كُلِّ نَفْسٍ بِما كَسَبَتْ يقول الله تعالى الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ وقال الله لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ واختلف العلماء من أصحابنا في التخلق بالقيومية هل يصح أو لا فعندنا إنه يصح التخلق بها مثل جميع الأسماء وقال الله الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ بِما فَضَّلَ الله ولقيت أبا عبد الله بن جنيد لما جاء إلى زيارتنا بإشبيلية فسألته في ذلك فقال يجوز التخلق بها يعني بالاسم القيوم ثم منع من ذلك وما أدري ما سبب منعه يقول الله تعالى الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ بِما فَضَّلَ الله بَعْضَهُمْ عَلى‏ بَعْضٍ وكان هذا أعني أبا عبد الله بن جنيد القبر فيقي ضيعة من أعمال رندة ببلاد الأندلس فلم أزل به ألاطفه في أصحابه وأتباعه بقريته لكونه كان معتزلي المذهب حتى انكشف له الأمر فرجع عن مذهب الاعتزال القائلين بإنفاذ الوعيد وبخلق الأفعال وعرف محل ذلك فأنزله في موضعه ولم يتعد به رتبته وشكرني على ذلك ورجع لرجوعه جميع أصحابه وأتباعه وحينئذ فارقته فهذا ذكر الأحوال لا يقف عند ذكر خاص وإنما هو بحسب الحال ومن حاز هذه الأحوال الثلاثة فقد حاز الوجود فالآية التي تعم جميع الأحوال في الذكر قوله وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ هذا هو الذكر العام الذي يعم جميع الأحوال وبقي ذكر التخصيص فذكر القائم الرَّحْمنُ عَلَى الْعَرْشِ وذكر القاعد أَ أَمِنْتُمْ من في السَّماءِ وذكر الجنب وفي الْأَرْضِ إِلهٌ وهذا كله فيه خلاف أعني في تأويله بين العلماء فاجمع همك على أمر واحد حتى يزول عنك التبديد فإن شئت راقبت الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ وإن شئت راقبت أَ أَمِنْتُمْ من في السَّماءِ وكونه‏\n\n\nفي السماء يقول هل من تائب هل من مستغفر هل من داع‏\n\n\nوإن شئت راقبت وهُوَ الله في السَّماواتِ وفي الْأَرْضِ يَعْلَمُ سِرَّكُمْ وجَهْرَكُمْ وإن كان طعامك ثريدا فراقب وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ وكينونتنا تعم حسا ومعنى فبالحس حيث نحن من الأرض وحيث نحن فيه من الشغل بالجوارح ومعنى حيث كتابا لهم والمقاصد والخواطر فنشهده في الشغل فاعلا وفي القصد قاصدا أيضا فنعكس الأمر فنكون بحيث هو فإنا بحيث ما نحن عليه وليس إلا هو\n\n\n> فكن في أحسن إلهيات تسعد *** وكن في أكمل الحالات ترشد\n\n\n> وكن بالحال لا بالقول فيه *** تكن في حكم من يقضي فيقصد\n\n\nوهذا القدر من الإيماء نصيحة إلهية لِمَنْ كانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Five Hundred and Thirty-Five: Concerning the Knowledge of the State of a Pole (*Qutb*) whose Station was the Saying of Him, Glorified be His Praise and Sanctified be His Names: <<الَّذِينَ يَذْكُرُونَ الله قِياماً وقُعُوداً وعَلى‏ جُنُوبِهِمْ>> (Those who remember Allah standing, sitting, and on their sides).\n\nThose who remember their Lord in every state,\nThey are the people of every virtue in the World (*al-Alam*).\n\nThey witness none other than Him in their essences (*a'yan*);\nThus, they are the kings over Eternal Existence (*al-Wujud al-Da'im*).\n\nThey stand by the Right of Allah (The Real), not by their own rights,\nWhether lying down, or sitting, or standing.\n\nThey have attained Perfection, and this station\nOf the Ruling Divinity (*al-Ilah al-Hakim*) does not belong to anyone else.\n\nFor them is contemplation (*tafakkur*) regarding the connection of His Attribute\nTo their existence and the existence of the entire World.\n\n### [Assuming the Character of the Self-Subsisting (al-Qayyumiyya)]\n\nKnow—may Allah support us and you with a Spirit from Him—that the origin of creation (*al-khalq*) is the state of lying down (repose), until The Real (*al-Haqq*) raises it, either to sitting, whereby it attains a share of Mercy. Allah Almighty says: <<وكُنْتُمْ أَمْواتاً فَأَحْياكُمْ>> (And you were dead, and He gave you life). Or to standing, whereby it attains a share of the verse where He Almighty says: <<أَ فَمَنْ هُوَ قائِمٌ عَلى‏ كُلِّ نَفْسٍ بِما كَسَبَتْ>> (Is He then Who stands over every soul by what it has earned?). Allah Almighty says: <<الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏>> (The All-Merciful established Himself upon the Throne). And Allah said: <<لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ>> (There is no god but He, the Living, the Self-Subsisting [al-Qayyum]).\n\nOur scholars have differed regarding whether assuming the character of the Self-Subsisting (*al-Qayyumiyya*) is valid or not. In our view, it is valid to assume its character, just like all the [Divine] Names (*al-Asma'*). And Allah said: <<الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ بِما فَضَّلَ الله>> (Men are maintainers [qawwamun] of women by what Allah has favored [some of them over others]).\n\nI met Abu Abd Allah ibn Junayd when he came to visit us in Seville (Ishbiliyya), and I asked him about this. He said that it is permissible to assume its character—meaning the Name *al-Qayyum*—but then he later forbade it, and I do not know the reason for his prohibition. Allah Almighty says: <<الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ بِما فَضَّلَ الله بَعْضَهُمْ عَلى‏ بَعْضٍ>> (Men are maintainers [qawwamun] of women by what Allah has favored some of them over others).\n\nThis man, meaning Abu Abd Allah ibn Junayd, was the grave-keeper (*al-qabr fiqi*) of an estate in the district of Ronda (Runda) in the lands of al-Andalus. I continued to treat him kindly regarding his companions and followers in his village, because he adhered to the Mu'tazilite school of thought—those who affirm the execution of the threat (*infadh al-wa'id*) and the creation of acts (*khalq al-af'al*)—until the matter was unveiled to him (*inkashaf*). He then retracted the Mu'tazilite doctrine, recognized the proper place for that [doctrine], placed it in its correct station, and did not transgress its degree. He thanked me for this, and upon his return, all his companions and followers also returned [from the doctrine]. It was then that I parted from him.\n\nThis remembrance of the states (*al-ahwal*) does not stop at a specific remembrance (*dhikr khass*); rather, it is according to the state. Whoever attains these three states has attained Existence (*al-Wujud*). The verse that encompasses all states in remembrance is His saying: <<وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ>> (And He is with you wherever you are). This is the general remembrance (*al-dhikr al-amm*) that covers all states.\n\nThere remains the specific remembrance (*dhikr al-takhsis*): the remembrance of the standing person is <<الرَّحْمنُ عَلَى الْعَرْشِ>> (The All-Merciful upon the Throne); the remembrance of the sitting person is <<أَ أَمِنْتُمْ من في السَّماءِ>> (Do you feel secure from Him Who is in the heaven?); and the remembrance of the person on his side is <<وفي الْأَرْضِ إِلهٌ>> (And He is God in the earth).\n\nAll of this—meaning its interpretation (*ta'wil*)—is subject to scholarly disagreement. Therefore, gather your resolve upon a single matter so that dispersion (*al-tabdid*) departs from you. If you wish, observe <<الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏>> (The All-Merciful established Himself upon the Throne). And if you wish, observe <<أَ أَمِنْتُمْ من في السَّماءِ>> (Do you feel secure from Him Who is in the heaven?), and His being in the heaven means He says: \"Is there any penitent? Is there any seeker of forgiveness? Is there any supplicant?\" And if you wish, observe <<وهُوَ الله في السَّماواتِ وفي الْأَرْضِ يَعْلَمُ سِرَّكُمْ وجَهْرَكُمْ>> (And He is Allah in the heavens and in the earth; He knows your secret and your manifest). And even if your food is *tharid* (a simple broth), observe <<وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ>> (And He is with you wherever you are).\n\nOur being (*kaynunatuna*) encompasses both the sensory and the spiritual meaning. Sensibly, [it is] where we are on the earth and where we are engaged in activity with our limbs. Spiritually, [it is] where there is a writing for them, and [where there are] intentions (*al-maqasid*) and passing thoughts (*al-khawatir*). Thus, we witness Him as the Doer in the activity, and also as the Intender in the intention. We then reverse the matter, so that we are where He is, for we are where we are, and there is none but Him.\n\nSo be in the most beautiful Divine states (*ilahiyyat*) that you may be happy,\nAnd be in the most perfect states (*al-halat*) that you may be guided.\n\nAnd be by the state (*al-hal*), not by the saying concerning it,\nSo that you may be under the rule of one who decrees and intends.\n\nThis measure of indication (*al-ima'*) is a Divine counsel for <<لِمَنْ كانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ>> (whoever has a heart or lends an ear while he is a witness). And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر ۵۳۵: اس قطب کے حال کی معرفت میں جس کا مقام اللہ تعالیٰ کے اس فرمان میں تھا: \"وہ لوگ جو اللہ کو کھڑے، بیٹھے اور اپنے پہلوؤں پر یاد کرتے ہیں۔\" (الَّذِينَ يَذْكُرُونَ الله قِياماً وقُعُوداً وعَلى‏ جُنُوبِهِمْ)\n\nجو ہر حال میں اپنے رب کا ذکر کرتے ہیں،\nوہی دنیا میں ہر فضیلت کے اہل ہیں۔\n\nوہ اپنی حقیقتوں (اعیان) میں اس کے سوا کسی کا شہود (الشہود) نہیں کرتے،\nپس وہی دائمی ہستی (الوجود) پر بادشاہ ہیں۔\n\nوہ اللہ کے حق کے ساتھ قائم ہوئے، نہ کہ اپنے حقوق کے ساتھ،\nخواہ وہ لیٹا ہو، بیٹھا ہو یا کھڑا ہو۔\n\nانہوں نے کمال حاصل کر لیا، پس حاکم الٰہی کی طرف سے\nیہ مقام ان کے سوا کسی اور کے لیے نہ تھا۔\n\nان کے لیے اس کی صفت کے تعلق میں غور و فکر ہے،\nان کی ہستی (الوجود) کے ساتھ اور تمام عالم کی ہستی (الوجود) کے ساتھ۔\n\n### [قیومیت سے متصف ہونا]\n\nجان لو، اللہ ہمیں اور تمہیں اپنی طرف سے روح کے ذریعے تائید بخشے، کہ مخلوق میں اصل حالت نیند (الرقاد) کی ہے، یہاں تک کہ الحق (الحق) اسے کھڑا کر دیتا ہے۔ یا تو بیٹھنے کے لیے، تو وہ رحمت کا ایک حصہ پاتا ہے، اللہ تعالیٰ نے فرمایا: \"اور تم مردہ تھے تو اس نے تمہیں زندہ کیا۔\" (وَكُنْتُمْ أَمْواتاً فَأَحْياكُمْ) اور یا کھڑے ہونے کے لیے، تو وہ اللہ تعالیٰ کے اس فرمان کی آیت کا ایک حصہ پاتا ہے: \"کیا وہ جو ہر جان پر اس کے کیے ہوئے کے ساتھ قائم ہے؟\" (أَ فَمَنْ هُوَ قائِمٌ عَلى‏ كُلِّ نَفْسٍ بِما كَسَبَتْ) اللہ تعالیٰ فرماتا ہے: \"رحمن عرش پر مستوی ہوا۔\" (الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏) اور اللہ نے فرمایا: \"اس کے سوا کوئی معبود نہیں، وہ زندہ، قائم رکھنے والا ہے۔\" (لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ)\n\nہمارے اصحاب میں سے علماء نے قیومیت (القیومیۃ) سے متصف ہونے (التخلق) کے بارے میں اختلاف کیا ہے کہ آیا یہ درست ہے یا نہیں؟ ہمارے نزدیک یہ تمام اسماء کی طرح درست ہے کہ اس سے متصف ہوا جائے۔ اور اللہ نے فرمایا: \"مرد عورتوں پر نگہبان ہیں، اس فضیلت کی بنا پر جو اللہ نے دی ہے۔\" (الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ بِما فَضَّلَ الله) میں ابو عبداللہ بن جنید سے ملا جب وہ اشبیلیہ میں ہماری زیارت کے لیے آئے، تو میں نے ان سے اس بارے میں پوچھا، تو انہوں نے کہا کہ اس سے متصف ہونا جائز ہے، یعنی اسم قیوم (القیوم) سے۔ پھر انہوں نے اس سے منع کر دیا، اور مجھے نہیں معلوم کہ ان کے منع کرنے کا سبب کیا تھا۔ اللہ تعالیٰ فرماتا ہے: \"مرد عورتوں پر نگہبان ہیں، اس فضیلت کی بنا پر جو اللہ نے ان میں سے بعض کو بعض پر دی ہے۔\" (الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ بِما فَضَّلَ الله بَعْضَهُمْ عَلى‏ بَعْضٍ)\n\nاور یہ، یعنی ابو عبداللہ بن جنید، اندلس کے علاقے رندہ کے مضافات میں القبر فیقی نامی ایک جاگیر کے مالک تھے۔ میں ان کے گاؤں میں ان کے ساتھیوں اور پیروکاروں کے بارے میں ان سے نرمی سے بات کرتا رہا، کیونکہ وہ معتزلی مذہب کے پیروکار تھے، یہاں تک کہ ان پر معاملہ منکشف ہو گیا، اور انہوں نے اعتزال کے اس مذہب سے رجوع کر لیا جو وعید کے نفاذ اور افعال کی تخلیق کا قائل تھا۔ انہوں نے اس کا مقام پہچانا اور اسے اس کی جگہ پر اتارا اور اس کے مرتبے سے تجاوز نہیں کیا۔ انہوں نے اس پر میرا شکریہ ادا کیا اور ان کے رجوع کرنے پر ان کے تمام ساتھیوں اور پیروکاروں نے بھی رجوع کر لیا۔ اور اسی وقت میں نے ان سے علیحدگی اختیار کی۔\n\nپس یہ احوال کا ذکر کسی خاص ذکر پر نہیں رکتا، بلکہ یہ حال کے مطابق ہوتا ہے۔ اور جس نے یہ تینوں احوال حاصل کر لیے، اس نے ہستی (الوجود) کو حاصل کر لیا۔ پس وہ آیت جو ذکر کے تمام احوال کو شامل ہے، وہ اس کا فرمان ہے: \"اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو۔\" (وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ) یہ وہ عام ذکر (الذکر العام) ہے جو تمام احوال کو شامل ہے۔ اور خاص ذکر (ذکر التخصیص) باقی رہا: کھڑے ہونے والے کا ذکر ہے: \"رحمن عرش پر مستوی ہوا۔\" (الرَّحْمنُ عَلَى الْعَرْشِ) اور بیٹھے ہوئے کا ذکر ہے: \"کیا تم اس سے بے خوف ہو جو آسمان میں ہے؟\" (أَ أَمِنْتُمْ من في السَّماءِ) اور پہلو کے بل لیٹے ہوئے کا ذکر ہے: \"اور زمین میں بھی معبود ہے۔\" (وَفِي الْأَرْضِ إِلهٌ) اور اس سب میں، یعنی اس کی تاویل میں، علماء کے درمیان اختلاف ہے۔\n\nپس اپنی توجہ کو ایک ہی امر پر مرکوز کر لو تاکہ تم سے پراگندگی دور ہو جائے۔ اگر تم چاہو تو \"رحمن عرش پر مستوی ہوا\" (الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏) کی مراقبت کرو، اور اگر تم چاہو تو \"کیا تم اس سے بے خوف ہو جو آسمان میں ہے؟\" (أَ أَمِنْتُمْ من في السَّماءِ) کی مراقبت کرو۔ اور اس کا آسمان میں ہونا یہ ہے کہ وہ فرماتا ہے: \"کیا کوئی توبہ کرنے والا ہے؟ کیا کوئی مغفرت چاہنے والا ہے؟ کیا کوئی دعا کرنے والا ہے؟\"\n\nاور اگر تم چاہو تو \"اور وہی اللہ آسمانوں میں اور زمین میں ہے، وہ تمہارے راز اور تمہارے ظاہر کو جانتا ہے۔\" (وَهُوَ الله في السَّماواتِ وفي الْأَرْضِ يَعْلَمُ سِرَّكُمْ وجَهْرَكُمْ) کی مراقبت کرو۔ اور اگر تمہارا کھانا ثرید (شوربے میں بھیگی روٹی) ہو تو \"اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو۔\" (وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ) کی مراقبت کرو۔ اور ہماری کینونیت (ہونا) حسی اور معنوی دونوں کو شامل ہے۔ حسی طور پر جہاں ہم زمین میں ہیں اور جہاں ہم اعضاء کے ساتھ مشغولیت میں ہیں، اور معنوی طور پر جہاں ان کے لیے کتابت، مقاصد اور خواطر (خیالات) ہیں۔ پس ہم اسے مشغولیت میں فاعل کے طور پر دیکھتے ہیں اور قصد میں بھی قاصد کے طور پر دیکھتے ہیں۔ پس ہم معاملے کو الٹ دیتے ہیں، تو ہم اس جگہ ہوتے ہیں جہاں وہ ہے، کیونکہ ہم اس جگہ ہیں جس پر ہم ہیں، اور اس کے سوا کوئی نہیں ہے۔\n\nپس بہترین الٰہیات میں رہو تاکہ تم سعادت مند ہو جاؤ،\nاور کامل ترین احوال میں رہو تاکہ تم ہدایت پا جاؤ۔\n\nاور اس میں قول کے بجائے حال کے ساتھ رہو،\nتاکہ تم اس کے حکم میں ہو جاؤ جو فیصلہ کرتا ہے اور ارادہ کرتا ہے۔\n\nاور اشارے کی یہ مقدار ایک الٰہی نصیحت ہے \"اس کے لیے جس کے پاس دل ہو یا جو کان لگائے اور وہ حاضر ہو۔\" (لِمَنْ كانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ) اور \"اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔\" (وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)",
    "fa": "باب پانصد و سی و پنجم در معرفت حال قطبی که منزل او این قول خداوند جل ثناؤه و تقدست اسماؤه بود: «آنان که خدا را ایستاده و نشسته و بر پهلوهایشان یاد می‌کنند.» (الَّذِينَ يَذْكُرُونَ الله قِياماً وقُعُوداً وعَلى‏ جُنُوبِهِمْ)\n\nآنان که پروردگارشان را در هر حالی ذاکرند، *** ایشان اهل هر فضیلتی در عالم هستند.\nجز او را در عین‌هایشان (اعیان) شهود (الشهود) نمی‌کنند، *** پس ایشان پادشاهان بر هستی (الوجود) پایدارند.\nبه حق خداوند قیام کردند نه به حقوق خودشان، *** چه در حال خفته، چه نشسته و چه ایستاده.\nکمال را به دست آوردند، پس این مقام *** از ابزار حاکم برای غیر ایشان نیست.\nبرای ایشان است تفکر در تعلق وصف او *** به هستی (الوجود) خودشان و هستی (الوجود) تمام عالم.\n\n### [تخلق به قیومیت]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که اصل در خلقت، حالت خواب (رقاد) است تا آنکه حق (الحق) او را برپا دارد؛ یا برای نشستن که نصیبی از رحمت ببرد، چنانکه فرمود: «و مرده بودید، پس شما را زنده کرد.» (وكُنْتُمْ أَمْواتاً فَأَحْياكُمْ) و یا برای ایستادن که نصیبی از آیه این قول او تعالی ببرد: «آیا کسی که بر هر نفسی به آنچه کسب کرده، قائم است [مانند کسی است که قائم نیست]؟» (أَ فَمَنْ هُوَ قائِمٌ عَلى‏ كُلِّ نَفْسٍ بِما كَسَبَتْ) خداوند تعالی می‌فرماید: «رحمان بر عرش استیلا یافت.» (الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏) و خداوند فرمود: «هیچ معبودی جز او نیست، زنده و پاینده (الْحَيُّ الْقَيُّومُ).» (لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ) و علمای اصحاب ما در مورد تخلق به قیومیت (التخلق بالقيومية) اختلاف نظر دارند که آیا صحیح است یا خیر. نزد ما، تخلق به آن مانند همه اسماء (الهی) صحیح است. و خداوند فرمود: «مردان بر زنان سرپرست و نگهبانند به سبب آنچه خداوند [برخی] را بر [برخی] دیگر برتری داده است.» (الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ بِما فَضَّلَ الله) ابوعبدالله بن جنید را هنگامی که برای زیارت ما به اشبیلیه آمد، ملاقات کردم و در این باره از او پرسیدم. او گفت: تخلق به آن، یعنی به اسم قیوم، جایز است. سپس از آن منع کرد و من نمی‌دانم سبب منع او چه بود. خداوند تعالی می‌فرماید: «مردان بر زنان سرپرست و نگهبانند به سبب آنچه خداوند برخی از آنان را بر برخی دیگر برتری داده است.» (الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ بِما فَضَّلَ الله بَعْضَهُمْ عَلى‏ بَعْضٍ) و این شخص، یعنی ابوعبدالله بن جنید، در قبرستان ضیعه‌ای از توابع رُنده در سرزمین اندلس بود. من پیوسته با او مدارا می‌کردم و با یاران و پیروانش در روستایش مهربانی می‌نمودم، زیرا او معتزلی مذهب بود، تا اینکه امر بر او کشف (الکشف) شد. پس از مذهب اعتزال که قائل به اجرای وعید و خلق افعال هستند، بازگشت و جایگاه آن را شناخت و آن را در موضع خود قرار داد و از مرتبه‌اش تجاوز نکرد. او مرا به خاطر این امر سپاس گفت و با بازگشت او، همه یاران و پیروانش نیز بازگشتند و در آن هنگام از او جدا شدم.\n\nپس این ذکر احوال، محدود به ذکر خاصی نیست، بلکه بر حسب حال است. و هر کس این احوال سه‌گانه را به دست آورد، هستی (الوجود) را به دست آورده است. پس آیه‌ای که همه احوال در ذکر را در بر می‌گیرد، این قول است: «و او با شماست هر کجا که باشید.» (وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ) این همان ذکر عام است که همه احوال را شامل می‌شود. و ذکر تخصیص باقی می‌ماند: ذکر قائم (ایستاده) «رحمان بر عرش استیلا یافت.» (الرَّحْمنُ عَلَى الْعَرْشِ) و ذکر قاعد (نشسته) «آیا از کسی که در آسمان است ایمن هستید؟» (أَ أَمِنْتُمْ من في السَّماءِ) و ذکر بر پهلو (جنب) «و او در زمین نیز معبود است.» (وفي الْأَرْضِ إِلهٌ) و این همه، یعنی در تأویل آن، میان علما اختلاف است. پس همت خود را بر یک امر واحد جمع کن تا پراکندگی از تو زائل شود. اگر خواستی، «رحمان بر عرش استیلا یافت.» (الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى) را مراقبه کن، و اگر خواستی، «آیا از کسی که در آسمان است ایمن هستید؟» (أَ أَمِنْتُمْ من في السَّماءِ) را مراقبه کن. و بودن او در آسمان [به این معناست که] می‌گوید: آیا توبه‌کننده‌ای هست؟ آیا آمرزش‌خواهی هست؟ آیا دعاکننده‌ای هست؟ و اگر خواستی، «و اوست خدا در آسمان‌ها و در زمین، پنهان و آشکار شما را می‌داند.» (وهُوَ الله في السَّماواتِ وفي الْأَرْضِ يَعْلَمُ سِرَّكُمْ وجَهْرَكُمْ) را مراقبه کن. و اگر غذای تو ترید (آبگوشت با نان) بود، «و او با شماست هر کجا که باشید.» (وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ) را مراقبه کن. و کینونت (بودن) ما شامل حس و معنی است. از نظر حس، آنجا که ما از زمین هستیم و آنجا که با جوارح مشغول کار هستیم؛ و از نظر معنی، آنجا که کتابت و مقاصد و خواطر برای ایشان است. پس او را در کار، فاعل و و در قصد، قاصد نیز شهود (الشهود) می‌کنیم. پس امر را معکوس می‌کنیم و در جایی می‌شویم که او هست، زیرا ما در جایی هستیم که بر آن هستیم و جز او نیست.\n\nپس در نیکوترین الهیات باش تا سعادتمند شوی، *** و در کامل‌ترین حالات باش تا هدایت یابی.\nو در آن (حق) به حال باش نه به قول، *** تا در حکم کسی باشی که حکم می‌کند و قصد می‌نماید.\n\nو این مقدار از اشاره، نصیحتی الهی است برای «کسی که دلی دارد یا گوش فرا دهد در حالی که شاهد است.» (لِمَنْ كانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ) و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند. (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 1
}