{
  "id": 274,
  "title": {
    "ar": "الباب الرابع والسبعون ومائتان في معرفة منزل الأجل المسمى من العالم الموسوي",
    "en": "Chapter Two Hundred and Seventy-Four: Concerning the Knowledge of the Station of the Appointed Term (الأجل المسمى) of the Mosaic World.",
    "ur": "باب دو سو چوہترواں: موسوی عالم (العالم الموسوي) سے مقررہ مدت (الأجل المسمى) کے مقام کی معرفت میں۔",
    "fa": "باب دویست و هفتاد و چهارم در معرفت منزل اجل مسمی (الأجل المسمى) از عالم موسوی."
  },
  "content": {
    "ar": "## (الباب الرابع والسبعون ومائتان في معرفة منزل الأجل المسمى من العالم الموسوي)\n> أتتك فتوح الكون بالبلد القفر *** مؤيدة بالعز والقسر والنصر\n\n\n> وبالليلة الغراء جاءت ركائب *** من العالم العلوي في كنف الغفر\n\n\n> فراجع إذا راجعت ربك وحده *** بتنزيه إيمان تولد عن ذكر\n\n\n> يراجعك من عرش وإن شاء من عمي *** بغير هواء حار في كونه فكري‏\n\n\nقال تعالى ثُمَّ قَضى‏ أَجَلًا وهو نهاية عمر كل حي يقبل الموت وأَجَلٌ مُسَمًّى عِنْدَهُ وهو ميقات حياة كل من كان قبل الموت في حياته الأولى وهو المعبر عنه بالبعث ولذلك قال تعالى ثُمَّ أَنْتُمْ تَمْتَرُونَ يعني فيه فإن الموت لا يمترون فيه فإنه مشهود لهم في كل حيوان مع الأنفاس وإنما وقعت المرية في البعث وهو الأجل المسمى المذكور وإنما لم يجعل أجل الموت مسمى لأن الله يقول ونُفِخَ في الصُّورِ فَصَعِقَ من في السَّماواتِ ومن في الْأَرْضِ إِلَّا من شاءَ الله فاستثني طائفة لا يصعقون فلا يموتون فأما أن يكونوا\n\n\nلكونهم على حقائق لا تقبل الموت فيكون استثناء منقطعا وإما أن يكونوا على مزاج يقبل الموت لكن لم يسمعوا النفخ فلم يدركهم فلم يصعقوا فيكون استثناء متصلا\n\n\n### [إن أهل الله إذا جذبهم الحق إليه سبحانه من مريد ومراد جعل في قلوبهم داعية إلى طلب سعادتهم‏]\n\n\nفاعلم أيها السامع أن أهل الله إذا جذبهم الحق إليه سبحانه من مريد ومراد جعل في قلوبهم داعية إلى طلب سعادتهم فبحثوا عليها وفحصوا عنها ووجدوا في قلوبهم رقة وخشوعا وطلبا للسلامة مما الناس عليه من التكالب والتحاسد والتدابر والتنافر فإذا وفوا مكارم الأخلاق أو قاربوا ذلك وجدوا في أنفسهم داعية إلى الخلوات والانفراد عن الناس فمنهم من أخذ في السياحة ولازم الجبال والفلوات ومنهم من كانت سياحته في البلاد كل ما أنس به أهل بلدة أو عرف فيها رحل عنها إلى غيرها ومنهم من عزل في مسكنه بيتا وانفرد به واحتجب عن الناس كل ذلك ليقع له التفرد بالحق الذي دعاه إليه والأنس به لا ليعلم ولا ليجد كونا من الأكوان من خرق عادة في ظاهر الحس أو في سره فلا يزال على كل ما ذكرناه إلى أن ينقدح له في نفسه لبعضهم أو في خياله لبعضهم أو من خارج لبعضهم من جانب الحق ما يحول بينه وبين نفسه ويستوحش من ذلك الوارد عليه ويطلب الأنس بالمخلوق في تلك الساعة فإذا سكت حكم الوارد عنه وعاد إلى حسه اشتاق إليه اشتياقا شديدا واستفرغ في محبة ذلك الوارد استفراغا عظيما ووجد حلاوته عند فقده وسرت اللذة في حسه وروحه ويأتيه في ذلك الوارد خطاب وتعريف بحاله أو بما يدعى إليه كإبراهيم بن أدهم حين نودي من قربوس سرجه ليس لهذا خلقت ولا بهذا أمرت وآخر قيل له إن كنت تطلبني فقد فقدتني في أول قدم وآخر قيل له أنت عبدي فإن كان صاحب هذا الانقطاع من أصحاب الجبال والقفار جعل له الأنس في الحيوان وإن كان سائحا في البلدان جعل له الأنس في الحركة ما بين المدينتين وإن كان ممن لزم بيته جعل له الأنس في الروحانيات وكل هذا ابتلاء إلا أن يجعل الله له الأنس في الأرواح النورية الملكية فهذا يرجى فلاحه بل يتحقق وهي بشرى من الله سارعت إليه عناية منه به وما عدا هذا فهو على خطر عظيم فليعمل في قطعه ثم إنه منهم من يظلم عليه الجو عند الوارد فيجد لذلك غما وضيق صدر وعصرا في قلبه فليصبر فإنه يعقبه اتساع وانشراح ثم لا تزال الأرواح تلزمه في عالم خياله في أكثر حالاته وتظهر له في الحس في أوقات فلا يرمي بذلك ولا يزهد فيه ويتعمل في إزالة التعلق به ويقف مع الفائدة التي يأتيه بها فذلك المطلوب فإن سمع خطابا من وراء حجاب نفسه فليلق السمع وهو شهيد ويع ما يسمع فإن اقتضى الكلام جوابا على قدر فهمك فلتجب بقدر فهمك فإن رزقت العلم بذلك فهي العناية الكبرى وإن لم يقتض جوابا فلتحصل ما قيل لك في خزانة حفظك فإن له موطنا يحتاج إليه فيه ولا بد فيكون عندك بحكم الاستعداد لذلك الوقت فإن الله سبحانه يقول أعددت فإذا كان الحق مع نفوذ قدرته في الآن قد أعد أمور الأوقات ظهور أحكامها فالمخلوق أولى بهذا وقال وإِنْ من شَيْ‏ءٍ إِلَّا عِنْدَنا خَزائِنُهُ وإن هنا بمعنى ما فعم بها وبشي‏ء وجعله مخزونا في خزائن غيبه عنا ولهذا قلنا إن الكون صادر من وجود وهو ما تحويه هذه الخزائن إلى وجود وهو ظهورها من هذه الخزائن لأنفسها بالنور الذي تكشف به نفسها فإنها في ظلمة الخزائن محجوبة عن رؤية ذاتها فهي في حال عدمها وقال وما نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ فما يتميز عنده إلا ما هو موجود له ولا يجري القدر إلا في عين مميزة عن غيرها وليس هذا صفة المعدوم من كل وجه فدل ذلك كله على وجود الأعيان لله‏\nتعالى في حال اتصافها بالعدم لذاتها وهذا هو الوجود الأصلي الإضافي والعدم الإضافي فثبتت الأحوال للعالم ولكل ما سوى الله وأن الوجود ليس عين الموجود إلا في حق الحق سبحانه حتى لا يكون معلولا لوجوده فإنه لو كان معلولا لوجوده لكان حالا له تعالى الله عن ذلك علوا كبيرا فإذا خلص الإنسان بعد خروجه من ظلمة طبعه وهواه إلى نور عقله وهداه أربعين صباحا ظهر عنه مثل ما ظهر له وأخذ عنه مثل ما أخذ وتلك أول درجة الدينار الثالث وأول قيراط منه ولا يزال فيه حتى يجب عليه أن يطلب على من يأخذ عنه فإذا وجب عليه ذلك وجوبا شرعيا كفروض الأعيان كلها كان ذلك أول قيراط من الدينار الرابع وسمي رجلا عند ذلك وإن لم يحصل له هذا الوجوب فليس برجل فكمال الرجولية فيما ذكرناه وسواء كان ذكرا أو أنثى وأما الكمال الذاتي وهو غير كمال الرجولية فهو أن لا يتخلل عبوديته في نفسه ربانية بوجه من الوجوه فيكون وجودا في عين عدم وثبوتا في عين نفي ولذلك أوجده الحق فكمال الرجولية عارض وكمال العبودة ذاتي فبين المقامين ما بين الكمالين وأما درجات منازل هذين الكمالين فمعلومة عندنا حيث هي فدرجة الكمال الذاتي في نفس الحق ودرجات الكمال العرضي في الجنان فلهؤلاء النور ولهؤلاء الأجور قال تعالى لَهُمْ أَجْرُهُمْ يعني من كمالهم العرضي وما يستحق الأجر من كل أمر عرضي ولهم نُورُهُمْ من كمالهم الذاتي الله نُورُ السَّماواتِ والْأَرْضِ وتقول الرسل قاطبة وهم الكمل بلا خلاف إِنْ أَجْرِيَ إِلَّا عَلَى الله فإن ذلك المقام يعطي الأجر ولا بد فيقع التفاضل في الكمال العرضي ولا يقع في الكمال الذاتي قال تعالى تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ وقال هُمْ دَرَجاتٌ عِنْدَ الله ولم يقل لهم درجات عند الله فجعلهم أعيان الدرجات لأنهم عين الكمال الذاتي وبالكمال العرضي لهم الدرجات الجنانية فاعلم ذلك جعلنا الله ممن جمع بين الكمالين فإن حرمنا الجمع فالله يجعلنا من أهل الكمال الذاتي بمنه وكرمه وأنا أرجو من الله إني قد حصلته تحصيلا لا يحال بي دونه بحسن ظني بربي فما أعلاه من مشهد فإذا حصل للعبد هذا الكمال العرضي ورأى الإجابة الكونية لندائه من غير طلب دليل ولا برهان علم قطعا إن الحق قد تجلى لقلوب عباده وأنه سبحانه قد رفع الوساطة في أمره بينه وبين قلوب عباده فإن أمره سبحانه برفع الوسائط لا يتصور أن يعصى لأنه بكن إذ كن لا تقال إلا لمن هو موصوف بلم يكن وما هو موصوف بلم يكن ما يتصور منه إباية وإذا كان الأمر الإلهي بالوساطة فلا يكون بكن فإنها من خصائص الأمر العدمي الذي لا يكون بواسطة وإنما يكون الأمر بما يدل على الفعل فيؤمر بإقامة الصلاة وإيتاء الزكاة فيقال له أقم الصلاة وآت الزكاة فاشتق له من اسم الفعل اسم الأمر فيطيعه من شاء منهم ويعصيه من شاء منهم فإذا أطاعوه كما قد ذكرنا بهذا التجلي الإلهي لقلوب عباده الذي لا يحتاج فيه المأمور إلى دليل ولا برهان لوجود الإجابة من نفسه ضرورة لأن الضرورة إنما تصورت هنا لكون الإنسان لا يقدر على دفع ما تكون في نفسه فإن كن إنما تعلقت بما تكون في نفس الإنسان فكان الحكم لما تكون فيمن تكون فآمن ولا بد أو صلى ولا بد أو صام ولا بد على حسب ما تعطيه حقيقة الأمر الذي تعلق به كن وقد يرد أمر الواسطة ولا يرد الأمر الإلهي فلا يجد المخاطب آلة يفعل بها فيظهر كأنه عاص وإنما هو عاجز فاقد في الحقيقة لأنه ما تكون فيه ما أمر به أن يتكون عنه والله الغني الحميد\n\n\n### [إن من نتيجة الرجولة النصر على الأعداء]\n\n\nواعلم أن الفتوح الإلهي الذي يتعلق بالكون مثل النصر على الأعداء والقهر لهم والرحمة بالأولياء والعطف عليهم إنما هو من نتائج الرجولة لا من غيرها فإذا حصل هذا المقام وأكمل نشأته ناداه الحق في سره من كماله سبحانه لكمال العبد الذاتي فنزه ذات موجدة عن الكمال العرضي وهو الكمال الإلهي فإن الكمال الإلهي بالفعل فهو في نفوذ الاقتدار في المقدورات ونفوذ الإرادة في المرادات وظهور أحكام الأسماء الإلهية والكمال الذاتي للذات الغني المطلق عن هذا كله فيكون العبد في هذا المقام لا يشهد ذات موجدة من كونها موصوفة بالألوهة وإنما مشهده غناها عما تستحقه الألوهة من الآثار الكونية فيفتقر إليها افتقارا ذاتيا فهو في عبادته تلك صاحب عبادة ذاتية من غير اقتران أمر بها لأن الأمر إنما متعلقة الأمور العارضة لا الذاتية فلا يقال للعبد كن عبدا فإنه عبد لذاته وإنما يقال له اعمل كذا أيها العبد وعمله أمر عرضي والعمل متعلق الأمر من العبد وقد يعمل وقد لا يعمل وهذا المنزل يعطي جميع ما ذكرناه ويكون تنزيهه لذات موجدة بما يستحقه من الثناء الذي يليق بالكمال الذاتي‏\nثم إنه بما فيه من الكمال العرضي الذي هو كمال الرجولة قد يصدر عنه الثناء بما يستحقه الإله عارضا بعارض ولكن لا بطريق التنزيه فإن طريق التنزيه إنما هو للذات كما قال لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ للكمال الذاتي وهُوَ السَّمِيعُ الْبَصِيرُ للكمال الإلهي لطلب المسموع والمبصر وكل طالب يستدعي مطلوبا والمستدعي فاقد لما استدعاه من أحوال هذا العبد والله غني حميد فلسان الأدب أن يقال طلبك لك لا له وفي هذا ينبغي أن يقال ما قيل‏\n\n\n> كتاب فيه ما فيه *** بديع في معانيه‏\n\n\n> إذا عاينت ما فيه *** رأيت الدر يحويه‏\n\n\nوهو هذا المنزل وهذا الكلام الذي سردناه والكتاب الذي سطرناه ففيه ما فيه لسان الحقيقة يدل على إن الأمر فوق ما ذكر وسطر وليس في قوة الترجمة عنه والعبارة أكثر مما ظهر والله أكبر من ذلك ثم ستر هذا اللسان الحقيقي بقوله بديع في معانيه فكأنه يقول في قوله ما فيه على طريق التعجب به والفرح ولهذا نبه على ذلك بما ذكره في البيت الثاني ثم إن الثناء على الله في هذا المنزل خاصة إنما هو بما تستحقه الربوبية لما خصصتك به من الفضل على أبناء جنسك لا بما تستحقه بما فضلت به على غيرك وما أنعمت به على سواك فإن هذا المنزل لا يتضمن مثل هذا الثناء فيستعين العبد في هذا المنزل على تنزيه الحق بثناء الربوبية على نفسها من جهة ما خصتك به ثم إن العبد بعد استفراغ طاقته في الثناء على ربه بربه من جهة نعمته عليه لاح له علم إلهي في فلاة نفسه عن يمين طريقه فعرف أنه قد زل عن طريق ينبغي أن يسلك أيضا عليها وهنا مسألة دقيقة وهي تختص بهذا المنزل وذلك أنه لما قيد ثناءه على ربه بما خصه به ربه هل ذلك نقص في المعرفة أو في معرفته أو ليس في الوسع إلا ما وقع وإذا لم يكن في الوسع فقد أتى بكمال ما في الوسع وذلك أنه إذا أثنى على ربه بما كان منه سبحانه لغير هذا العبد المثنى فلا يخلو إما أن يثني عليه بما تحققه علما في نفسه ولا يكون إلا كذلك فقد صار هو منعوتا بذلك العلم وإن لم تقم به تلك الأوصاف التي وقع بها الثناء على الغير فوصفه بالعلم بذلك ثناء منه على ربه بما خصه به من العلم بذلك وهو صفة إلهية فإن الحق سبحانه يثني على عبده بما ليس هو الحق عليه ولا هي صفته فالثناء على الله من ذلك وصفه سبحانه بالعلم بذلك والخلق له فيثني على\n\n\nالعبد بالطاعة وليست من صفات الحق كذلك هذا العبد إذا أثنى على ربه بما أعطى لغيره فثناؤه على ربه بما أعطاه في نفسه هو ما حصل له من ربه من العلم بذلك فاذن فما أثنى على ربه إلا بما خصه به سواء أثنى على ربه بما أعطاه سبحانه لغيره أو لم يذكر الغير ولا تعرض له فتحقق هذه المسألة فإنها من الحقائق والحقائق لا تقبل التبديل وهذا المنزل من حصل فيه يعطيه ما ذكرناه فإذا لاح له ذلك العلم الذي ذكرناه ستره نظره إليه عما هو عليه وعرف أن ذلك العلم يدل على أمر غيبي ينبغي له أن يبقيه في غيبه ولا يظهره ويرجع من حال الخطاب بالمواجهة والحضور إلى الخطاب بالغيبة فإنه أنزه لأن الحقائق تعطي أنك ما حضرت إلا معك فإن الأمر إذا أعطى للحاضر في حضوره مع من حضر أنه لا يتمكن أن يحضر معه الأعلى حد ما تعطيه مرتبتك فمعك حضرت لا معه فإنه ما تجلى لك منه إلا قدر ما تعطيه مرتبتك فافهم ذلك تنتفع به ولا يغب هذا عنك في رجوعك إليه مما رجعت عنه لئلا تتخيل إنك رجعت إلى أعلى منك فإنك ما رجعت منك إلا إليك والحق سبحانه لا يرجع إليك إلا بك لا به لأنه ليس في الوسع أن يطيقه مخلوق ولهذا تتنوع رجعاته وتختلف تجلياته وتكثر مظاهره ولا نتكرر وهو في نفسه منزه عن التكثر والتغير لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فيما ينسب إلى ذاته قال تعالى ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا فرجوع العباد إليه نتيجة رجوعه إليهم بإعطاء ما رجعوا به إليه فإذا رجعوا إليه ضاعف لهم الرجوع الإلهي الذي ينتجه رجوعهم إليه الذي هو في نفسه ينتجه رجوعه الأول إليهم فالرجوع الإلهي الأول رجوع عناية وتفضل والرجوع الثاني الذي أنتجه رجوعهم إليه‏\n\n\nسبحانه في‏\n\n\nقوله من تقرب إلى شبرا تقربت منه ذراعا\n\n\nفمقدار الشبر من الذراع في الرجوع رجوع استحقاق يستحقه رجوعهم إليه والشبر الثاني الذي به كمال الذراع من الرجوع رجوع منه لترجيح الوزن والوصف بالفضل والترغيب والتحضيض على معاملة الكريم فالرجوع الإلهي الثاني يتضمن أمرين رجوع الاستحقاق منه بمنزلة الجسد ورجوع المنة منه بمنزلة الروح للجسد الذي به حياته فإنه وإن كان الاستحقاق بما أوجبه الحق على نفسه فإن الحقيقة تعطي أن لا يستحق العبد شيئا على سيده فمن منته سبحانه على عبد إن أوجب له‏\nعلى نفسه ليأنس العبد بما أوجبه الحق عليه من طاعته ليسارع بأداء ما وجب عليه فإذا حصل العبد في هذا المقام فليس وراءه مرمى لرام ويعلم أن الله قد أراد أن ينقله من عالم شهادته إلى عالم غيبه ليكون له غيبه شهادة في موطن آخر غير هذا الموطن له حكم آخر وهو الموطن الذي تكون فيه المظاهر الإلهية وهو أوسع المواطن فلهذا عبر عن هذا المنزل بالأجل المسمى لأنه أجل البعث إليه من عالم الشهادة المقيد بالصورة التي لا تقبل التحول في الصور لكن تقبل التغيير وهو زوال عينها بغيرها لذلك الغيب الذي كانت به فيدبر الروح الغيبي صورة ذلك الغير فلهذا قلنا يقبل التغيير ولا يقبل التحويل فإن الحقائق لا تتبدل فانتقاله إلى موطن التحول في الصور يسمى أجلا مسمى أي معلوم النهاية وكان من المقام الموسوي دون غيره لأنه لم يرد في الخبر أنه عليه السلام رأى في إسرائه من جمع بين صورتين سوى موسى عليه السلام فرآه في السماء وكان بينهما ما كان وهو في قبره يصلي والنبي يراه صلى الله عليه وسلم عليهما في الحالتين معا ولا يقال في مثل هذا الكشف إن الآن لا يتسع لأمرين متعارضين في الشخص الواحد فصحيح ما يقول ولكن أين الآن هنا إنما ذلك لمن تقيد بالزمان وتعين بالمكان فإذا كان الموجود لا يتقيد بالزمان ولا بالمكان فلا يستحيل هذا الوصف عليه وإذا فهمت ما أشرنا إليه لم بعارض ما ذهبنا إليه وذكرناه كون الإسراء وقع بالليل وهو الزمان وكون موسى عليه السلام في القبر والسماء وهما المكان فإنك أنت تسلم من مذهبك إن الجسم لا يكون في مكانين وأنت تؤمن بهذا الحديث فإن كنت مؤمنا فقلد وإن كنت عالما فلا تعترض فإن العلم يمنعك وليس لك الاختيار فإنه لا يختبر إلا الله ولا تتأول أن الذي في الأرض غير الذي في السماء فإن النبي عليه السلام ما قال رأيت روح موسى ولا جسد موسى وإنما قال رأيت موسى في السماء ومعلوم أنه مدفون في الأرض وكذلك سائر من رآه من الأنبياء عليهم السلام فالمسمى موسى إن لم يكن عينه فالإخبار عنه كذب إنه موسى هذا وأنت القائل رأيتك البارحة في النوم وأنت تقول كذا وكذا والمرئي معلوم أنه كان في منزله على حالة غير الحال التي رآه عليها أو عليها ولكن في موطن آخر ولا تقول له رأيت غيرك ثم تنكر علينا مثل هذا وإنما تختلف الحضرات والمواطن وتختلف الأحوال والعين واحدة فهذا قد ذكرنا بعض ما يحوي عليه هذا المنزل وسكتنا عن بيوته وخزائنه فما من منزل إلا وله بيوت وخزائن وأقفال ومفاتيح ولكن يطول ذكرها في كل منزل وربما إذا بيناها يدعيها الكاذب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ وفي هذا المنزل علم إتيان المعاني في الصور وعلم الفتوح وله باب قد تقدم وعلم الوافدين على الحق وعلم التنزيه وعلم الستر والتجلي وعلم الرجوع الإلهي على من يرجع هل يرجع على عباده أو على أسمائه‏\n\n",
    "en": "## The Two Hundred and Seventy-Fourth Chapter concerning the Knowledge of the Station of the Appointed Term from the Mosaic World (العالم الموسوي)\n\n> The cosmic unveilings (فتوح الكون) came to you in the desolate land,\n> Supported by Glory, Compulsion, and Victory.\n\n> And with the bright night came riders,\n> From the higher World (العالم العلوي), under the wing of Forgiveness.\n\n> So return, when you return to your Lord alone,\n> With the transcendence (تنزيه) of faith born from remembrance (ذكر).\n\n> He returns to you from the Throne, or if He wills, from the Cloud ('Amā),\n> Without hot air existing in my thought.\n\nThe Exalted said: <<ثُمَّ قَضى‏ أَجَلًا>> (Then He decreed a term). This is the end of the life of every living being that accepts death. And <<أَجَلٌ مُسَمًّى عِنْدَهُ>> (an appointed term is with Him). This is the fixed time for the life of everyone who was alive before death in their first life, which is expressed as the Resurrection (البعث). For this reason, the Exalted said: <<ثُمَّ أَنْتُمْ تَمْتَرُونَ>> (Then you doubt), meaning concerning it [the appointed term/Resurrection]. For they do not doubt death, as it is witnessed by them in every living creature with every breath. Doubt only occurred regarding the Resurrection, which is the aforementioned Appointed Term (الأجل المسمى).\n\nThe term of death was not made 'appointed' because Allah says: <<وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَنْ فِي السَّماواتِ وَمَنْ فِي الْأَرْضِ إِلَّا مَنْ شاءَ الله>> (And the Horn will be blown, and whoever is in the heavens and whoever is on the earth will fall dead, except whom Allah wills). Thus, a group is exempted who will not fall dead and will not die. Either they are [exempted] because their realities (حقائق) do not accept death, in which case the exception (استثناء) is discontinuous (منقطع). Or they possess a constitution (مزاج) that accepts death, but they did not hear the blast, so it did not reach them, and they did not fall dead, in which case the exception is continuous (متصل).\n\n### [Indeed, when the Real (الحق) draws the People of Allah (أهل الله) to Himself, whether they are seekers (مريد) or sought (مراد), He places in their hearts an impulse to seek their felicity]\n\nKnow, O listener, that when the Real (الحق) draws the People of Allah (أهل الله) to Himself, whether they are seekers (مريد) or sought (مراد), He places in their hearts an impulse to seek their felicity. They search for it and investigate it, finding in their hearts tenderness, humility, and a desire for safety from the strife, envy, turning away, and aversion that people are engaged in. When they fulfill noble character traits (مكارم الأخلاق) or approach that state, they find within themselves an impulse toward seclusion (الخلوات) and separation from people.\n\nSome of them take to wandering (السياحة) and adhere to mountains and deserts. Some make their wandering through cities, and whenever they become familiar with the people of a town or become known there, they depart for another. Some isolate a room in their dwelling and seclude themselves in it, withdrawing from people. All of this is so that they may attain singularity with the Real (التفرد بالحق) who called them, and intimacy (الأنس) with Him, not to gain knowledge or to find any cosmic event (كون) involving the breaking of custom (خرق عادة), whether in outward sense or in their secret self.\n\nThey remain in this state until something from the side of the Real (جانب الحق) flashes forth within their self (for some), or in their imagination (for others), or from outside (for yet others), which intervenes between them and their own self. They feel alienated (يستوحش) by this Divine Influx (الوارد) and seek intimacy with creation at that moment. When the ruling of the Influx ceases and they return to their senses, they long for it intensely and pour out great devotion in love for that Influx. They find its sweetness upon its loss, and the pleasure spreads through their senses and spirit.\n\nIn that Influx, a discourse (خطاب) comes to them, defining their state or what they are called to, such as when Ibrahim ibn Adham was called from the pommel of his saddle: \"You were not created for this, nor were you commanded with this.\" And another was told: \"If you seek Me, you have lost Me at the first step.\" And another was told: \"You are My servant.\"\n\nIf the person in this state of isolation is among the people of the mountains and deserts, intimacy is granted to him in animals. If he is a wanderer in the lands, intimacy is granted to him in movement between cities. If he is one who adheres to his house, intimacy is granted to him in spiritual beings (الروحانيات). All of this is a trial (ابتلاء), unless Allah grants him intimacy in the luminous, angelic spirits (الأرواح النورية الملكية). This person's success is hoped for, indeed, it is realized, and it is a glad tiding from Allah, hastened to him by His care (عناية). Anything other than this is in great danger, and he must strive to cut it off.\n\nFurthermore, for some of them, the atmosphere darkens during the Influx, causing grief, constriction of the chest, and pressure in the heart. He must be patient, for this is followed by expansion and relief. Then, spirits (الأرواح) will cling to him in the world of his Imagination (عالم خياله) in most of his states, and appear to him physically at times. He should not reject this or treat it with disdain, but should strive to remove attachment to it, and focus on the benefit (الفائدة) it brings him, for that is the goal.\n\nIf he hears a discourse from behind the veil of his self, he must listen attentively (فليلق السمع وهو شهيد) and comprehend what he hears. If the speech requires an answer according to your understanding, then answer according to your understanding. If you are granted Knowledge (العلم) of the matter, that is the greatest Divine Care (العناية الكبرى). If it does not require an answer, then store what was said to you in the treasury of your memory, for there is a location where it will be needed, and it must be available to you by virtue of preparation (الاستعداد) for that time.\n\nFor Allah the Exalted says: \"I have prepared\" (أعددت). If the Real, with His penetrating power, has prepared matters for the manifestation of their rulings (أحكامها) in the present moment, then the creature is even more deserving of this. He also said: <<وَإِنْ مِنْ شَيْءٍ إِلَّا عِنْدَنا خَزائِنُهُ>> (And there is nothing except that with Us are its treasuries). The word *In* (إن) here means *not* (ما), encompassing everything, and making it stored in the treasuries of His Unseen (غيبه) from us.\n\nFor this reason, we said that the Cosmos (الكون) emanates from an existence (وجود)—what these treasuries contain—to an existence (وجود)—their manifestation from these treasuries to themselves by the Light (النور) that unveils them. For in the darkness of the treasuries, they are veiled from seeing their own essences (ذاتها), being in a state of non-existence (عدمها). He said: <<وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ>> (And We do not send it down except by a known measure). Only that which is existent for Him is distinguished, and the measure (القدر) only flows in an entity (عين) distinguished from others. This is not the description of the absolutely non-existent.\n\nAll of this indicates the existence of the entities (الأعيان) for Allah the Exalted, even while they are characterized by non-existence (العدم) in themselves. This is the original relative existence (الوجود الأصلي الإضافي) and relative non-existence (العدم الإضافي). Thus, states (الأحوال) are established for the world (العالم) and for everything other than Allah, and Existence (الوجود) is not the essence (عين) of the existent (الموجود), except in the case of the Real (الحق) Himself, so that He is not caused by His own existence. For if He were caused by His existence, He would be a locus (حال) for it—highly exalted is Allah above that!\n\nWhen a person is purified, after emerging from the darkness of his nature (طبعه) and passion (هواه) into the light of his intellect (عقله) and guidance (هداه) for forty mornings, what manifests from him is like what manifested to him, and he takes from it like what he took. That is the first degree of the Third Dinar (الدينار الثالث) and its first carat. He remains in this state until it becomes obligatory for him to seek someone from whom he takes. When this becomes a legal obligation (وجوبا شرعيا), like all individual duties (فروض الأعيان), that is the first carat of the Fourth Dinar (الدينار الرابع), and he is then called a Man (رجل). If this obligation is not attained, he is not a Man. The perfection of Manhood (كمال الرجولية) lies in what we mentioned, regardless of whether the person is male or female.\n\nAs for Essential Perfection (الكمال الذاتي), which is different from the perfection of Manhood, it is that his servitude (عبوديته) is not interspersed with Lordship (ربانية) in any way within his self. Thus, he is existence (وجود) in the essence of non-existence (عين عدم) and subsistence (ثبوت) in the essence of negation (عين نفي). For this reason, the Real brought him into existence. The perfection of Manhood is accidental (عارض), while the perfection of Servitude (العبودة) is essential (ذاتي). The difference between the two stations is the difference between the two perfections.\n\nAs for the degrees of these two perfections, they are known to us where they are: the degree of Essential Perfection is in the Essence of the Real (نفس الحق), and the degrees of Accidental Perfection (الكمال العرضي) are in the Gardens (Jannāt). For the latter, there are rewards (الأجور), and for the former, there is Light (النور). The Exalted said: <<لَهُمْ أَجْرُهُمْ>> (For them is their reward)—meaning from their accidental perfection, for reward is only deserved for accidental matters. And <<وَلَهُمْ نُورُهُمْ>> (And for them is their Light)—from their essential perfection. <<اللهُ نُورُ السَّماواتِ وَالْأَرْضِ>> (Allah is the Light of the heavens and the earth).\n\nThe Messengers (الرسل) unanimously, and they are the perfect ones without dispute, say: <<إِنْ أَجْرِيَ إِلَّا عَلَى اللهِ>> (My reward is only upon Allah). That station necessarily grants reward, leading to differentiation in accidental perfection, but not in essential perfection. The Exalted said: <<تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ>> (Those Messengers—We favored some of them over others). And He said: <<هُمْ دَرَجاتٌ عِنْدَ اللهِ>> (They are degrees with Allah). He did not say, \"For them are degrees with Allah,\" but made them the very essence of the degrees (أعيان الدرجات) because they are the essence of Essential Perfection. By Accidental Perfection, they possess the degrees of the Gardens. Know this. May Allah make us among those who combine both perfections. If we are deprived of combining them, may Allah make us among the people of Essential Perfection by His grace and generosity. I hope from Allah that I have attained it—an attainment that will not be prevented from me—due to my good expectation of my Lord. What a sublime witnessing (مشهد) that is!\n\nWhen the servant attains this Accidental Perfection and sees the cosmic response (الإجابة الكونية) to his call without seeking proof or evidence, he knows with certainty that the Real has disclosed Himself (تجلى) to the hearts of His servants and that He has removed the mediation (الوساطة) in His command (أمره) between Himself and the hearts of His servants. For His command to remove mediators cannot be conceived of as being disobeyed, because *Kun* (كن - Be!) is only addressed to that which is characterized by 'it was not' (لم يكن). And that which is characterized by 'it was not' cannot refuse.\n\nIf the Divine Command involves mediation, it is not by *Kun*, for *Kun* is specific to the command related to non-existence (الأمر العدمي) which occurs without mediation. Rather, the command is given using a derivative of the verb of action, so one is commanded to establish the prayer and give the Zakat, being told: \"Establish the prayer and give the Zakat.\" Some obey Him, and some disobey Him.\n\nWhen they obey Him, as we have mentioned, through this Divine Self-disclosure to the hearts of His servants, the commanded person needs no proof or evidence, because the response arises necessarily from within himself. Necessity is conceived here because the person cannot repel what is formed within his self. *Kun* relates to what is formed within the self of the person, so the ruling belongs to what is formed in the one in whom it is formed. He must believe, or pray, or fast, according to the reality of the command to which *Kun* was attached.\n\nSometimes the mediated command comes, but the Divine Command does not, and the addressed person finds no tool (آلة) to act with. He appears disobedient, but in reality, he is incapable and lacking, because what he was commanded to form within himself was not formed. And Allah is the Self-Sufficient, the Praiseworthy.\n\n### [Indeed, one result of Manhood (الرجولة) is victory over enemies]\n\nKnow that the Divine Unveiling (الفتوح الإلهي) related to the cosmos (الكون), such as victory over enemies (النصر على الأعداء), compulsion over them, and mercy toward the saints (الأولياء) and kindness toward them, is a result of Manhood (الرجولة), not anything else.\n\nWhen this station is attained and his formation (نشأته) is perfected, the Real calls him in his secret self from His own perfection (كمال سبحانه) for the servant's Essential Perfection (الكمال الذاتي). He must transcend (نزه) the Essence (الذات) of his Originator from Accidental Perfection (الكمال العرضي), which is the Divine Perfection (الكمال الإلهي). For Divine Perfection is active (بالفعل): it is the penetration of power (الاقتدار) into the decreed things (المقدورات), the penetration of will (الإرادة) into the willed things (المرادات), and the manifestation of the rulings of the Divine Names (الأسماء الإلهية).\n\nEssential Perfection belongs to the Absolutely Rich Essence (الذات الغني المطلق), independent of all this. In this station, the servant does not witness the Essence of his Originator as being described by Divinity (الألوهة). Rather, his witnessing (مشهده) is His independence (غناها) from the cosmic effects (الآثار الكونية) required by Divinity. He is in a state of essential need (افتقارا ذاتيا) for Him. His worship is essential worship (عبادة ذاتية), unconnected to a command, because the command relates to accidental matters, not essential ones. One is not told, \"Be a servant,\" for he is a servant by his very essence. Rather, he is told, \"Do such-and-such, O servant,\" and his action is an accidental matter, and action is the object of the command from the servant, which may or may not be performed.\n\nThis station grants all that we have mentioned. His transcendence of the Essence of his Originator is done with the praise (الثناء) that befits Essential Perfection.\n\nFurthermore, due to the Accidental Perfection that he possesses, which is the perfection of Manhood, praise befitting the Divine may issue from him accidentally, but not through the path of Transcendence. For the path of Transcendence is only for the Essence, as in <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him) for Essential Perfection. And <<وَهُوَ السَّمِيعُ الْبَصِيرُ>> (And He is the All-Hearing, the All-Seeing) for Divine Perfection, which requires the heard and the seen. Every seeker calls for a sought object, and the caller is lacking what he calls for regarding the states of this servant. And Allah is Self-Sufficient, Praiseworthy. The language of propriety (لسان الأدب) is to say: \"Your seeking is for you, not for Him.\" In this context, what was said should be said:\n\n> A book containing what it contains,\n> Wondrous in its meanings.\n\n> If you witness what is in it,\n> You will see the pearls it holds.\n\nThis refers to this station and this discourse that we have narrated, and the book that we have written. The phrase \"containing what it contains\" (فيه ما فيه) is the language of Reality (لسان الحقيقة), indicating that the matter is beyond what has been mentioned and written, and the power of translation and expression cannot capture more than what has appeared. And Allah is greater than that. Then this Real language is veiled by saying, \"Wondrous in its meanings,\" as if expressing astonishment and joy at the phrase \"what it contains.\" For this reason, he drew attention to this in the second verse.\n\nFurthermore, praise of Allah in this station specifically is only what is due to Lordship (الربوبية) based on the favor (الفضل) He has specifically granted you over others of your kind, not based on what He has favored others with or bestowed upon others. This station does not encompass such praise. Thus, the servant seeks help in this station for the transcendence (تنزيه) of the Real by praising Lordship for what it has specifically granted him.\n\nThen, after the servant has exhausted his capacity in praising his Lord through his Lord based on the favor granted to him, a Divine Knowledge (علم إلهي) appears to him in the wilderness of his self (فلاة نفسه), to the right of his path. He realizes he has deviated from a path that should also be traversed.\n\nHere is a subtle issue (مسألة دقيقة) specific to this station: When he restricted his praise of his Lord to what his Lord specifically granted him, was that a deficiency in gnosis (المعرفة) or in his knowledge? Or was it simply the limit of his capacity (الوسع)? If it was the limit of his capacity, then he has achieved the perfection of what is possible.\n\nThis is because if he praises his Lord for what came from Him to someone other than this praising servant, he must praise Him based on what he realizes through knowledge in his self—and it can only be so. He has thus become characterized by that knowledge. Even if he does not possess the attributes by which the praise of the other occurred, his description by the knowledge of that is praise from him to his Lord for the knowledge He specifically granted him concerning it, and that is a Divine Attribute (صفة إلهية). For the Real praises His servant with something that is not an attribute of the Real, nor is it His description—such as praising the servant with obedience. Likewise, when this servant praises his Lord for what He gave to others, his praise of his Lord for what He gave him in himself is the knowledge of that which he received from his Lord. Therefore, he only praises his Lord for what He specifically granted him, whether he praises his Lord for what He granted to others or does not mention the other at all. Realize this issue, for it is one of the realities (الحقائق), and realities do not accept change.\n\nThis station grants what we have mentioned to whoever attains it. When that knowledge appears to him, his gaze upon it veils him from his current state. He realizes that knowledge points to an unseen matter (أمر غيبي) that he should keep hidden and not manifest. He must return from the state of direct address (الخطاب بالمواجهة والحضور) and presence to the address of absence (الخطاب بالغيبة), for the latter is more transcendent (أنزه).\n\nThis is because realities dictate that you only attended with yourself (إلا معك). If the command given to the present person in his presence with the one present dictates that he cannot attend beyond the limit of his own level (مرتبتك), then you attended *with* yourself, not *with* Him, for He only disclosed Himself to you according to the capacity of your level. Understand this, and you will benefit. Do not let this escape you in your return to Him from what you returned from, lest you imagine that you returned to something higher than yourself, for you only returned from yourself *to* yourself. The Real only returns to you *by* you, not *by* Him, because no creature can endure Him. For this reason, His returns vary, His theophanies (تجلياته) differ, and His manifestations (مظاهره) multiply, yet He does not repeat Himself, and in Himself, He is transcendent (منزه) from multiplicity and change: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him) regarding what is attributed to His Essence (ذاته).\n\nThe Exalted said: <<ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا>> (Then He turned to them that they might repent). The return of the servants to Him is the result of His return to them, granting them the means by which they return. When they return to Him, He doubles the Divine Return (الرجوع الإلهي) that their return produces, which itself is produced by His first return to them. The first Divine Return is a return of care (عناية) and favor (تفضل). The second return, produced by their return to Him, is in His saying: \"If he draws near to Me by a span, I draw near to him by a cubit.\"\n\nThe measure of the span (شبر) in the return is a return of desert (استحقاق) earned by their return to Him. The second span, which completes the cubit (ذراع) of return, is a return of favor (منة) from Him, intended to outweigh the balance, describe Him with grace, and encourage dealing with the Generous One. The second Divine Return includes two matters: the return of desert from Him, which is like the body, and the return of favor from Him, which is like the spirit (الروح) for that body, by which it lives. For even though desert is based on what the Real has obligated upon Himself, the reality dictates that the servant deserves nothing from his Master. It is from His favor upon the servant that He obligated something upon Himself, so that the servant may find intimacy in what the Real obligated upon him of obedience, and hasten to perform his duty.\n\nWhen the servant reaches this station, there is no further goal for the seeker. He knows that Allah intends to transfer him from the world of his witnessing (عالم شهادته) to the world of His Unseen (عالم غيبه), so that his Unseen becomes witnessing (شهادة) in another location (موطن) with a different ruling—the location where the Divine Manifestations (المظاهر الإلهية) occur, which is the most expansive of locations.\n\nThis station is therefore expressed as the Appointed Term (الأجل المسمى), because it is the term of resurrection (البعث) to that location from the world of witnessing, which is restricted by a form (صورة) that does not accept transformation (التحول) into other forms, but accepts change (التغيير)—the disappearance of its essence (عينها) by another essence, which the unseen spirit (الروح الغيبي) governs. Thus, we said it accepts change but not transformation, for realities (الحقائق) do not change.\n\nHis transition to the location of transformation in forms is called the Appointed Term, meaning a known end. It belongs to the Mosaic Station (المقام الموسوي) specifically, because the Hadith of the Ascension (الإسراء) only mentions Moses (Musa) as the one seen combining two forms: he saw him in the heaven, and there was interaction between them, while Moses was praying in his grave. The Prophet (peace and blessings be upon them both) saw him in both states simultaneously.\n\nOne should not object in the case of such an Unveiling (كشف) that the present moment (الآن) cannot accommodate two contradictory states in one person. What he says is correct, but where is the present moment here? That is only for one restricted by time (الزمان) and determined by place (المكان). When the existent (الموجود) is not restricted by time or place, this description is not impossible for him.\n\nIf you understand what we have indicated, the fact that the Ascension occurred at night (time) and Moses was in the grave and the heaven (place) will not contradict our view. You yourself accept that a body cannot be in two places, yet you believe this Hadith. If you are a believer, follow tradition; if you are a knower, do not object, for knowledge prevents you from doing so, and you have no choice, for only Allah is tested.\n\nDo not interpret that the one on earth is different from the one in heaven. The Prophet did not say, \"I saw the spirit of Moses\" or \"the body of Moses,\" but \"I saw Moses in the heaven,\" knowing he was buried on earth. The same applies to the other prophets he saw. If the one named Moses was not his very essence (عينه), then the report that he was Moses would be a lie. You yourself say, \"I saw you last night in a dream, and you were saying such-and-such,\" knowing the person seen was in his house in a state different from the one seen, or in another location, yet you do not say, \"I saw someone other than you.\" The Presences (الحضرات) and locations (المواطن) differ, and the states (الأحوال) differ, but the entity (العين) is one.\n\nWe have mentioned some of what this station contains, and we have remained silent about its houses and treasuries. For every station has houses, treasuries, locks, and keys, but mentioning them for every station would be lengthy. Moreover, if we explained them, the liar might claim them. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).\n\nThis station contains the knowledge of the arrival of meanings in forms (إتيان المعاني في الصور), the knowledge of Unveiling (الفتوح), the knowledge of those who arrive at the Real (الوافدين على الحق), the knowledge of Transcendence (التنزيه), the knowledge of Veiling and Self-disclosure (الستر والتجلي), and the knowledge of the Divine Return (الرجوع الإلهي)—whether He returns to His servants or to His Names (أسمائه).",
    "ur": "(باب نمبر دو سو چوہتر: عالم موسوی سے منزلِ اجل مسمیٰ کی معرفت میں)\n\nتجھ پر کائنات کی فتوحات ویران شہر میں آئیں،\nجن کی تائید عزت، قہر اور نصرت سے کی گئی ہے۔\n\nاور روشن رات میں سواریاں آئیں،\nعالم علوی سے مغفرت کی پناہ میں۔\n\nپس جب تو اپنے رب واحد کی طرف رجوع کرے،\nتو ایسے ایمان کے تنزیہہ کے ساتھ رجوع کر جو ذکر سے پیدا ہوا ہو۔\n\nوہ تجھ سے عرش سے رجوع کرے گا، اور اگر چاہے تو عماء (غیب مطلق) سے،\nبغیر کسی گرم ہوا کے جس میں میرا فکری وجود ہو۔\n\nاللہ تعالیٰ نے فرمایا: \"ثُمَّ قَضى‏ أَجَلًا\" (پھر ایک مدت مقرر کی) اور یہ ہر اس جاندار کی عمر کی انتہا ہے جو موت کو قبول کرتا ہے۔ اور \"وَأَجَلٌ مُسَمًّى عِنْدَهُ\" (اور ایک مقررہ مدت اس کے پاس ہے) یہ ہر اس شخص کی زندگی کا وقت مقررہ ہے جو اپنی پہلی زندگی میں موت سے پہلے تھا، اور اسی کو بعث (دوبارہ اٹھائے جانے) سے تعبیر کیا جاتا ہے۔ اسی لیے اللہ تعالیٰ نے فرمایا: \"ثُمَّ أَنْتُمْ تَمْتَرُونَ\" (پھر تم شک کرتے ہو) یعنی اس (بعث) میں، کیونکہ وہ موت میں شک نہیں کرتے، اس لیے کہ وہ ہر جاندار میں سانسوں کے ساتھ ان کے لیے مشہود ہے۔ شک صرف بعث میں واقع ہوا ہے، جو کہ مذکورہ \"الأجل المسمى\" (مقررہ مدت) ہے۔ اور موت کی مدت کو مسمیٰ (مقررہ) اس لیے نہیں بنایا گیا کیونکہ اللہ فرماتا ہے: \"وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ إِلَّا مَنْ شَاءَ اللَّهُ\" (اور صور پھونکا جائے گا تو آسمانوں اور زمین میں جو بھی ہیں سب بے ہوش ہو کر گر پڑیں گے، سوائے ان کے جنہیں اللہ چاہے)۔ پس ایک گروہ کو مستثنیٰ کیا گیا جو بے ہوش نہیں ہوں گے، لہٰذا وہ نہیں مریں گے۔ تو یا تو وہ اس لیے ہوں گے کہ وہ ایسی حقائق (حقائق) پر ہیں جو موت کو قبول نہیں کرتیں، تو یہ استثناء منقطع (غیر متعلق) ہوگا، اور یا وہ ایسے مزاج پر ہوں گے جو موت کو قبول کرتا ہے لیکن انہوں نے نفخ (صور پھونکا جانا) نہیں سنا، لہٰذا وہ ان تک نہیں پہنچا اور وہ بے ہوش نہیں ہوئے، تو یہ استثناء متصل (متعلق) ہوگا۔\n\n### [بے شک اہل اللہ کو جب الحق (ذات حق) اپنی طرف کھینچتا ہے، خواہ وہ مرید ہوں یا مراد، تو وہ ان کے دلوں میں ان کی سعادت کے طلب کی داعیہ پیدا کر دیتا ہے]\n\nاے سننے والے! جان لے کہ اہل اللہ کو جب الحق (ذات حق) سبحانہ اپنی طرف کھینچتا ہے، خواہ وہ مرید (ارادہ کرنے والے) ہوں یا مراد (جس کا ارادہ کیا گیا ہو)، تو وہ ان کے دلوں میں ان کی سعادت کے طلب کی داعیہ پیدا کر دیتا ہے۔ پس وہ اس کی تلاش کرتے ہیں اور اس کی چھان بین کرتے ہیں، اور اپنے دلوں میں نرمی، خشوع، اور اس چیز سے سلامتی کی طلب پاتے ہیں جس پر لوگ باہم لپکنے، حسد کرنے، پیٹھ پھیرنے اور نفرت کرنے میں مبتلا ہیں۔ جب وہ اخلاق حسنہ کو پورا کر لیتے ہیں یا اس کے قریب پہنچ جاتے ہیں، تو وہ اپنے اندر خلوتوں اور لوگوں سے تنہائی کی طرف ایک داعیہ پاتے ہیں۔ ان میں سے بعض نے سیاحت اختیار کی اور پہاڑوں اور بیابانوں کو لازم پکڑا، اور بعض کی سیاحت شہروں میں تھی، جب بھی وہ کسی شہر کے لوگوں سے مانوس ہوتے یا وہاں پہچانے جاتے تو اسے چھوڑ کر دوسرے شہر چلے جاتے۔ اور بعض نے اپنے گھر میں ایک کمرہ الگ کر لیا اور اس میں تنہا ہو گئے اور لوگوں سے پردہ کر لیا۔ یہ سب اس لیے ہوتا ہے تاکہ اسے اس الحق (ذات حق) کے ساتھ انفرادیت حاصل ہو جائے جس نے اسے بلایا ہے، اور اس سے انس حاصل ہو، نہ اس لیے کہ وہ علم حاصل کرے یا ظاہری حس یا اس کے باطن میں خرق عادت کے طور پر کوئی کونی وجود پائے۔\n\nوہ ان تمام مذکورہ حالات پر قائم رہتا ہے یہاں تک کہ ان میں سے بعض کے لیے اس کے نفس میں، اور بعض کے لیے اس کے خیال میں، اور بعض کے لیے باہر سے جانب الحق (ذات حق) سے کوئی ایسی چیز ظاہر ہوتی ہے جو اس کے اور اس کے نفس کے درمیان حائل ہو جاتی ہے۔ اور وہ اس وارد (آنے والی چیز) سے وحشت محسوس کرتا ہے اور اس وقت مخلوق سے انس طلب کرتا ہے۔ پھر جب اس وارد کا حکم خاموش ہو جاتا ہے اور وہ اپنے حواس کی طرف لوٹتا ہے تو اس کی طرف شدید اشتیاق محسوس کرتا ہے اور اس وارد کی محبت میں عظیم استغراق کرتا ہے، اور اس کے کھو جانے پر اس کی مٹھاس پاتا ہے، اور لذت اس کے حواس اور روح میں سرایت کر جاتی ہے۔ اور اس وارد میں اسے خطاب اور اس کے حال یا جس کی طرف اسے بلایا گیا ہے اس کی تعریف ملتی ہے، جیسے ابراہیم بن ادھم کو ان کی زین کے اگلے حصے سے آواز دی گئی: \"تم اس کے لیے پیدا نہیں کیے گئے اور نہ ہی اس کا تمہیں حکم دیا گیا ہے۔\" اور دوسرے سے کہا گیا: \"اگر تم مجھے طلب کرتے ہو تو تم نے مجھے پہلے ہی قدم پر کھو دیا،\" اور ایک اور سے کہا گیا: \"تم میرے بندے ہو۔\"\n\nپس اگر یہ انقطاع (دنیا سے کٹ جانے) والا شخص پہاڑوں اور بیابانوں والوں میں سے ہو تو اس کے لیے حیوانات میں انس پیدا کر دیا جاتا ہے، اور اگر وہ شہروں میں سیاحت کرنے والا ہو تو اس کے لیے دو شہروں کے درمیان حرکت میں انس پیدا کر دیا جاتا ہے، اور اگر وہ گھر کو لازم پکڑنے والوں میں سے ہو تو اس کے لیے روحانیات میں انس پیدا کر دیا جاتا ہے۔ اور یہ سب آزمائش ہے، سوائے اس کے کہ اللہ اس کے لیے نوری ملکی ارواح میں انس پیدا کر دے، تو اس کی فلاح کی امید کی جاتی ہے، بلکہ وہ متحقق ہو جاتی ہے، اور یہ اللہ کی طرف سے ایک بشارت ہے جو اس کی عنایت کی وجہ سے اس کی طرف تیزی سے آئی ہے۔ اور اس کے علاوہ جو کچھ ہے وہ بڑے خطرے میں ہے، پس اسے چاہیے کہ وہ اسے ختم کرنے کی کوشش کرے۔\n\nپھر ان میں سے بعض ایسے ہیں کہ وارد (تجلی) کے وقت ان پر ماحول تاریک ہو جاتا ہے، اور وہ اس کی وجہ سے غم، سینے کی تنگی اور دل میں گھٹن محسوس کرتے ہیں، تو اسے صبر کرنا چاہیے، کیونکہ اس کے بعد کشادگی اور انشراح (دل کا کھلنا) آتا ہے۔ پھر ارواح اکثر حالات میں اس کے عالم خیال میں اس کے ساتھ لازم رہتی ہیں اور بعض اوقات حواس میں بھی ظاہر ہوتی ہیں، تو وہ اسے رد نہ کرے اور نہ ہی اس سے بے رغبتی کرے، بلکہ اس سے تعلق کو ختم کرنے کی کوشش کرے اور اس فائدے کے ساتھ ٹھہر جائے جو وہ اس کے لیے لاتی ہیں، یہی مطلوب ہے۔ پس اگر وہ اپنے نفس کے پردے کے پیچھے سے کوئی خطاب سنے تو اسے چاہیے کہ وہ کان لگائے اور وہ شاہد (شہود) ہو، اور جو کچھ سنتا ہے اسے سمجھے۔ اگر کلام تمہاری سمجھ کے مطابق جواب کا تقاضا کرے تو تمہیں اپنی سمجھ کے مطابق جواب دینا چاہیے، اگر تمہیں اس کا علم عطا ہو جائے تو یہ سب سے بڑی عنایت ہے۔ اور اگر وہ جواب کا تقاضا نہ کرے تو جو کچھ تمہیں کہا گیا ہے اسے اپنے حفظ کے خزانے میں محفوظ کر لو، کیونکہ اس کے لیے ایک ایسا مقام ہے جہاں اس کی ضرورت پڑے گی، اور یہ تمہارے پاس اس وقت کے لیے تیاری کے حکم میں ہوگا۔\n\nکیونکہ اللہ سبحانہ فرماتا ہے: \"میں نے تیار کر رکھا ہے\" (حدیث قدسی کا اشارہ)۔ پس جب الحق (ذات حق) اپنی قدرت کے نفاذ کے ساتھ اس آن میں اوقات کے امور اور ان کے احکام کے ظہور کو تیار کر چکا ہے، تو مخلوق اس کی زیادہ حقدار ہے۔ اور فرمایا: \"وَإِنْ مِنْ شَيْءٍ إِلَّا عِنْدَنَا خَزَائِنُهُ\" (اور کوئی چیز نہیں مگر اس کے خزانے ہمارے پاس ہیں)۔ یہاں \"إن\" نفی کے معنی میں ہے (یعنی ما)، پس اس نے اس کے ذریعے عموم پیدا کیا اور ہر چیز کو اپنے غیب کے خزانوں میں ہم سے پوشیدہ رکھا۔ اسی لیے ہم نے کہا کہ کائنات ایک وجود (الوجود) سے صادر ہوئی ہے، اور وہ وہ ہے جو یہ خزانے اپنے اندر رکھتے ہیں، دوسرے وجود (الوجود) کی طرف، اور وہ ان خزانوں سے اپنے لیے اس نور کے ذریعے ظاہر ہونا ہے جس سے وہ خود کو منکشف کرتی ہیں، کیونکہ وہ خزانوں کی تاریکی میں اپنی ذات کے دیدار سے محجوب ہیں، پس وہ اپنی عدم (عدم) کی حالت میں ہیں۔ اور فرمایا: \"وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ\" (اور ہم اسے ایک معلوم اندازے کے مطابق ہی نازل کرتے ہیں)۔ پس اس کے نزدیک وہی ممتاز ہوتا ہے جو اس کے لیے موجود ہو، اور تقدیر صرف اس عین (حقیقت) میں جاری ہوتی ہے جو دوسروں سے ممتاز ہو، اور یہ ہر لحاظ سے معدوم (عدم) کی صفت نہیں ہے۔ پس یہ سب اس بات پر دلالت کرتا ہے کہ اعیان (حقائق) اللہ تعالیٰ کے لیے اس حال میں موجود ہیں جب وہ اپنی ذات کے اعتبار سے عدم (عدم) کے ساتھ متصف ہیں۔\n\nاور یہی الوجود الأصلی الإضافی (اضافی اصلی ہستی) اور العدم الإضافی (اضافی عدم) ہے۔ پس عالم اور اللہ کے سوا ہر چیز کے لیے احوال ثابت ہو گئے، اور یہ کہ الوجود (ہستی) عین موجود نہیں ہے، سوائے الحق (ذات حق) سبحانہ کے حق میں، تاکہ وہ اپنے وجود کا معلول نہ ہو، کیونکہ اگر وہ اپنے وجود کا معلول ہوتا تو وہ اس کے لیے حال (حلول کرنے والا) ہوتا۔ اللہ اس سے بہت بلند و برتر ہے۔ پس جب انسان اپنے طبع اور خواہش کی تاریکی سے نکل کر اپنے عقل اور ہدایت کے نور کی طرف چالیس صبحوں تک خالص ہو جاتا ہے، تو اس سے وہی ظاہر ہوتا ہے جو اس کے لیے ظاہر ہوا، اور وہ اس سے وہی لیتا ہے جو اس نے لیا۔ اور یہ دینار ثالث کا پہلا درجہ اور اس کا پہلا قیراط ہے۔ اور وہ اس میں رہتا ہے یہاں تک کہ اس پر واجب ہو جاتا ہے کہ وہ اس شخص پر طلب کرے جس سے وہ لیتا ہے (یعنی دوسروں کو سکھائے)۔ پس جب یہ اس پر شرعی وجوب کے طور پر لازم ہو جائے، جیسے تمام فروضِ اعیان، تو یہ دینار رابع کا پہلا قیراط ہوتا ہے، اور اس وقت اسے \"رجل\" (مرد/کامل) کہا جاتا ہے۔ اور اگر اسے یہ وجوب حاصل نہ ہو تو وہ رجل نہیں ہے۔ پس کمال الرجولية (مردانگی کا کمال) اسی میں ہے جو ہم نے ذکر کیا، خواہ وہ مرد ہو یا عورت۔\n\nاور جہاں تک الكمال الذاتی (ذاتی کمال) کا تعلق ہے، جو کمال الرجولية سے مختلف ہے، تو وہ یہ ہے کہ اس کی عبودیت میں کسی بھی طرح سے ربانیت داخل نہ ہو، پس وہ عین عدم (عدم) میں وجود (الوجود) ہو اور عین نفی میں ثبوت ہو۔ اور اسی لیے الحق (ذات حق) نے اسے موجود کیا۔ پس کمال الرجولية (مردانگی کا کمال) عارضی ہے اور کمال العبودۃ (عبودیت کا کمال) ذاتی ہے۔ لہٰذا ان دونوں مقامات کے درمیان وہی فرق ہے جو ان دونوں کمالوں کے درمیان ہے۔ اور جہاں تک ان دونوں کمالوں کی منازل کے درجات کا تعلق ہے، تو وہ ہمارے نزدیک معلوم ہیں جہاں وہ ہیں۔ پس الكمال الذاتی (ذاتی کمال) کا درجہ نفس الحق (ذات حق) میں ہے، اور الكمال العرضی (عارضی کمال) کے درجات جنتوں میں ہیں۔ پس ان (ذاتی کمال والوں) کے لیے نور ہے اور ان (عارضی کمال والوں) کے لیے اجر ہے۔ اللہ تعالیٰ نے فرمایا: \"لَهُمْ أَجْرُهُمْ\" (ان کے لیے ان کا اجر ہے) یعنی ان کے عارضی کمال کی وجہ سے، اور اجر ہر عارضی امر سے مستحق ہوتا ہے۔ اور \"وَلَهُمْ نُورُهُمْ\" (اور ان کے لیے ان کا نور ہے) ان کے ذاتی کمال کی وجہ سے، \"اللَّهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ\" (اللہ آسمانوں اور زمین کا نور ہے)۔ اور تمام رسول بالاتفاق، جو کہ کاملین ہیں، کہتے ہیں: \"إِنْ أَجْرِيَ إِلَّا عَلَى اللَّهِ\" (میرا اجر صرف اللہ پر ہے)۔ کیونکہ وہ مقام لازمی طور پر اجر دیتا ہے۔ پس تفاضل (فضیلت میں فرق) الكمال العرضی (عارضی کمال) میں واقع ہوتا ہے، اور الكمال الذاتی (ذاتی کمال) میں واقع نہیں ہوتا۔ اللہ تعالیٰ نے فرمایا: \"تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَى بَعْضٍ\" (یہ وہ رسول ہیں جن میں سے ہم نے بعض کو بعض پر فضیلت دی)۔ اور فرمایا: \"هُمْ دَرَجَاتٌ عِنْدَ اللَّهِ\" (وہ اللہ کے ہاں درجات ہیں)۔ اور یہ نہیں فرمایا کہ \"ان کے لیے اللہ کے ہاں درجات ہیں\"۔ پس اس نے انہیں درجات کا عین بنا دیا، کیونکہ وہ عین الكمال الذاتی (ذاتی کمال) ہیں، اور الكمال العرضی (عارضی کمال) کی وجہ سے ان کے لیے جنتی درجات ہیں۔ پس یہ جان لو۔ اللہ ہمیں ان لوگوں میں شامل کرے جو دونوں کمالوں کو جمع کرتے ہیں، اور اگر ہمیں جمع کرنے سے محروم رکھا جائے تو اللہ ہمیں اپنے فضل و کرم سے اہل الكمال الذاتی (ذاتی کمال) میں شامل کرے۔ اور میں اللہ سے امید رکھتا ہوں کہ میں نے اسے اس طرح حاصل کر لیا ہے کہ میرے اور اس کے درمیان کوئی رکاوٹ نہیں ہوگی، اپنے رب پر میرے حسن ظن کی وجہ سے۔ یہ کتنا بلند مشاہدہ ہے۔\n\nپس جب بندے کو یہ الكمال العرضی (عارضی کمال) حاصل ہو جاتا ہے اور وہ اپنی پکار پر کونی اجابت کو بغیر کسی دلیل یا برہان کے طلب کے دیکھتا ہے، تو وہ یقیناً جان لیتا ہے کہ الحق (ذات حق) نے اپنے بندوں کے دلوں پر التجلی (ظہور الٰہی) فرمایا ہے، اور یہ کہ اس نے اپنے اور اپنے بندوں کے دلوں کے درمیان اپنے امر میں وساطت (واسطے) کو اٹھا دیا ہے۔ کیونکہ وساطتوں کو اٹھانے کا اس کا حکم ایسا نہیں ہے کہ اس کی نافرمانی کا تصور کیا جا سکے، کیونکہ وہ \"کن\" (ہو جا) سے ہوتا ہے، اور \"کن\" صرف اسی سے کہا جاتا ہے جو \"لم یکن\" (نہیں تھا) کی صفت سے متصف ہو، اور جو \"لم یکن\" کی صفت سے متصف ہو اس سے انکار کا تصور نہیں کیا جا سکتا۔ اور جب امر الٰہی وساطت کے ساتھ ہو تو وہ \"کن\" سے نہیں ہوتا، کیونکہ \"کن\" امْرِ عدمی (عدم سے وجود میں لانے والے حکم) کی خصوصیات میں سے ہے جو واسطے کے بغیر ہوتا ہے۔ بلکہ حکم اس چیز سے ہوتا ہے جو فعل پر دلالت کرے، پس نماز قائم کرنے اور زکوٰۃ ادا کرنے کا حکم دیا جاتا ہے، تو اسے کہا جاتا ہے: \"أقم الصلاة\" (نماز قائم کر) اور \"آت الزکاۃ\" (زکوٰۃ ادا کر)۔ پس فعل کے اسم سے اس کے لیے اسم امر مشتق کیا جاتا ہے، تو ان میں سے جو چاہتا ہے اس کی اطاعت کرتا ہے اور جو چاہتا ہے اس کی نافرمانی کرتا ہے۔ پس جب وہ اس التجلی (ظہور الٰہی) کے ذریعے اپنے بندوں کے دلوں کی اطاعت کرتے ہیں، جیسا کہ ہم نے ذکر کیا ہے، جس میں مامور کو کسی دلیل یا برہان کی ضرورت نہیں ہوتی، کیونکہ اس کے نفس سے اجابت کا وجود بالضرورت ہوتا ہے، اس لیے کہ یہاں ضرورت کا تصور اس لیے کیا گیا ہے کہ انسان اس چیز کو دفع کرنے پر قادر نہیں ہوتا جو اس کے نفس میں وجود پذیر ہوتی ہے۔ کیونکہ \"کن\" کا تعلق صرف اس چیز سے ہوتا ہے جو انسان کے نفس میں وجود پذیر ہو، پس حکم اس کے لیے ہوتا ہے جو اس شخص میں وجود پذیر ہو جس میں وہ وجود پذیر ہوتا ہے۔ پس وہ لازمی طور پر ایمان لاتا ہے، یا لازمی طور پر نماز پڑھتا ہے، یا لازمی طور پر روزہ رکھتا ہے، اس حقیقت کے مطابق جس سے \"کن\" کا تعلق ہوا ہے۔ اور کبھی واسطے کا حکم آتا ہے لیکن امر الٰہی (کن) نہیں آتا، تو مخاطب کو وہ آلہ نہیں ملتا جس سے وہ فعل کرے، پس وہ بظاہر نافرمان نظر آتا ہے، حالانکہ حقیقت میں وہ عاجز اور فاقد ہوتا ہے، کیونکہ اس میں وہ چیز وجود پذیر نہیں ہوئی جس کے وجود پذیر ہونے کا اسے حکم دیا گیا تھا۔ اور اللہ غنی (بے نیاز) اور حمید (قابل تعریف) ہے۔\n\n### [بے شک رجولیت (مردانگی) کے نتائج میں سے ایک دشمنوں پر نصرت (فتح) ہے]\n\nاور جان لو کہ الفتوح الإلهی (الٰہی فتوح) جو کائنات سے متعلق ہے، جیسے دشمنوں پر نصرت (فتح) اور ان پر قہر، اور اولیاء پر رحمت اور ان پر شفقت، یہ سب رجولیت (کمالِ مردانگی) کے نتائج میں سے ہیں، نہ کہ کسی اور چیز کے۔ پس جب یہ مقام حاصل ہو جاتا ہے اور اس کی نشوونما مکمل ہو جاتی ہے، تو الحق (ذات حق) اس کے باطن میں اپنے کمال سبحانہ کی طرف سے بندے کے الكمال الذاتی (ذاتی کمال) کے لیے ندا دیتا ہے۔ پس وہ اپنے موجد (وجود بخشنے والے) کی ذات کو الكمال العرضی (عارضی کمال) سے منزہ کرتا ہے، اور وہ الكمال الإلهی (الٰہی کمال) ہے۔ کیونکہ الكمال الإلهی بالفعل ہے، پس وہ مقدورات میں اقتدار کے نفاذ، مرادات میں ارادے کے نفاذ، اور اسماء الٰہیہ کے احکام کے ظہور میں ہے۔ اور الكمال الذاتی (ذاتی کمال) اس ذات غنی مطلق کے لیے ہے جو ان سب سے بے نیاز ہے۔ پس بندہ اس مقام پر اپنے موجد کی ذات کا مشاہدہ اس حیثیت سے نہیں کرتا کہ وہ الوہیت کے ساتھ موصوف ہے، بلکہ اس کا مشاہدہ اس کی بے نیازی کا ہوتا ہے ان کونی آثار سے جو الوہیت کا تقاضا کرتے ہیں۔ پس وہ اس کی طرف ذاتی افتقار (محتاجی) کرتا ہے۔ لہٰذا وہ اپنی اس عبادت میں ذاتی عبادت کا مالک ہوتا ہے، بغیر اس کے کہ اس کے ساتھ کوئی حکم وابستہ ہو۔ کیونکہ امر کا تعلق صرف عارضی امور سے ہوتا ہے نہ کہ ذاتی امور سے۔ پس بندے سے یہ نہیں کہا جاتا کہ \"کن عبداً\" (بندہ ہو جا)، کیونکہ وہ اپنی ذات کے اعتبار سے بندہ ہے۔ بلکہ اسے کہا جاتا ہے: \"اے بندے! یہ کام کر\"، اور اس کا عمل ایک عارضی امر ہے، اور عمل بندے کی طرف سے امر کا متعلق ہے، وہ عمل کر بھی سکتا ہے اور نہیں بھی کر سکتا۔\n\nاور یہ منزل وہ سب کچھ عطا کرتی ہے جو ہم نے ذکر کیا، اور اس کا اپنے موجد کی ذات کو منزہ کرنا اس ثناء کے ساتھ ہوتا ہے جو الكمال الذاتی (ذاتی کمال) کے لائق ہے۔ پھر یہ کہ اس میں جو الكمال العرضی (عارضی کمال) ہے، جو کہ کمال الرجولية ہے، اس کی وجہ سے اس سے وہ ثناء صادر ہو سکتی ہے جو الٰہ (معبود) عارضی طور پر کسی عارض کی وجہ سے مستحق ہوتا ہے، لیکن تنزیہہ کے طریقے پر نہیں۔ کیونکہ تنزیہہ کا طریقہ صرف ذات کے لیے ہے، جیسا کہ اس نے الكمال الذاتی (ذاتی کمال) کے لیے فرمایا: \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" (اس کی مثل کوئی چیز نہیں)۔ اور الكمال الإلهی (الٰہی کمال) کے لیے فرمایا: \"وَهُوَ السَّمِيعُ الْبَصِيرُ\" (اور وہ سننے والا، دیکھنے والا ہے)، جو مسموع (سنی جانے والی چیز) اور مبصر (دیکھی جانے والی چیز) کے طلب کے لیے ہے۔ اور ہر طالب مطلوب کو طلب کرتا ہے، اور طلب کرنے والا اس چیز سے محروم ہوتا ہے جسے اس نے طلب کیا ہے۔ یہ اس بندے کے احوال میں سے ہے، اور اللہ غنی (بے نیاز) اور حمید (قابل تعریف) ہے۔ پس ادب کی زبان یہ ہے کہ کہا جائے: تمہارا طلب کرنا تمہارے لیے ہے، نہ کہ اس کے لیے۔ اور اس بارے میں وہی کہا جانا چاہیے جو کہا گیا ہے:\n\nیہ کتاب ہے جس میں وہ کچھ ہے جو اس میں ہے،\nاپنے معانی میں عجیب و غریب ہے۔\n\nجب تو اس میں موجود چیزوں کا مشاہدہ کرے گا،\nتو دیکھے گا کہ وہ موتیوں کو اپنے اندر سموئے ہوئے ہے۔\n\nاور یہ یہی منزل ہے، اور یہ وہی کلام ہے جو ہم نے بیان کیا، اور وہ کتاب ہے جو ہم نے لکھی۔ پس اس میں \"ما فیہ\" (جو کچھ اس میں ہے) حقیقت کی زبان ہے جو اس بات پر دلالت کرتی ہے کہ معاملہ اس سے کہیں بڑھ کر ہے جو ذکر کیا گیا اور لکھا گیا، اور ترجمہ اور عبارت کی طاقت میں اس سے زیادہ نہیں ہے جو ظاہر ہوا، اور اللہ اس سے بہت بڑا ہے۔ پھر اس نے اس لسانِ حقیقی کو اپنے قول \"بدیع فی معانیہ\" (اپنے معانی میں عجیب و غریب) سے چھپا دیا، گویا وہ اپنے قول \"ما فیہ\" میں تعجب اور خوشی کے انداز میں کہہ رہا ہے، اور اسی لیے اس نے دوسرے شعر میں جو کچھ ذکر کیا اس سے اس پر تنبیہ کی۔\n\nپھر یہ کہ اس منزل میں خاص طور پر اللہ کی ثناء صرف اس چیز کے ساتھ ہوتی ہے جس کی ربوبیت مستحق ہے، اس فضیلت کی وجہ سے جو اس نے تمہیں تمہاری جنس کے لوگوں پر خاص طور پر عطا کی ہے، نہ کہ اس چیز کے ساتھ جس کی وہ مستحق ہے اس فضیلت کی وجہ سے جو اس نے دوسروں پر کی اور انعام جو اس نے تمہارے سوا دوسروں پر کیا۔ کیونکہ یہ منزل ایسی ثناء کو شامل نہیں کرتی۔ پس بندہ اس منزل میں الحق (ذات حق) کی تنزیہہ پر ربوبیت کی اس ثناء کے ذریعے مدد حاصل کرتا ہے جو اس نے خود پر کی ہے، اس لحاظ سے کہ اس نے تمہیں خاص کیا۔\n\nپھر یہ کہ بندہ اپنی تمام تر طاقت اپنے رب کی ثناء میں، اپنے رب کے ذریعے، اس پر کی گئی نعمت کے لحاظ سے صرف کرنے کے بعد، اسے اپنے نفس کے بیابان میں اپنے راستے کے دائیں جانب ایک علم الٰہی (علم إلهي) ظاہر ہوتا ہے، تو وہ جانتا ہے کہ وہ اس راستے سے ہٹ گیا ہے جس پر اسے بھی چلنا چاہیے تھا۔ اور یہاں ایک دقیق مسئلہ ہے جو اس منزل کے ساتھ خاص ہے، اور وہ یہ ہے کہ جب اس نے اپنے رب کی ثناء کو اس چیز کے ساتھ مقید کیا جو اس کے رب نے اسے خاص طور پر عطا کی، تو کیا یہ معرفت میں یا اس کی معرفت میں کوئی کمی ہے؟ یا اس کی وسعت میں اس کے سوا کچھ نہیں تھا جو واقع ہوا؟ اور جب وسعت میں نہیں تھا تو اس نے وسعت میں موجود کمال کو پورا کر دیا۔ اور وہ یہ ہے کہ جب وہ اپنے رب کی ثناء اس چیز کے ساتھ کرتا ہے جو اس بندے کے علاوہ کسی اور کے لیے سبحانہ کی طرف سے تھی، تو یہ خالی نہیں ہوگا کہ یا تو وہ اس کی ثناء اس چیز کے ساتھ کرے گا جسے وہ اپنے نفس میں علم کے طور پر متحقق کرتا ہے، اور ایسا ہی ہوتا ہے۔ پس وہ خود اس علم کے ساتھ موصوف ہو گیا، اگرچہ وہ اوصاف اس میں قائم نہ ہوں جن کے ذریعے دوسرے پر ثناء کی گئی تھی۔ پس اس کا اس علم کے ساتھ موصوف ہونا اس کی طرف سے اپنے رب کی ثناء ہے اس علم کے ذریعے جو اس نے اسے خاص طور پر عطا کیا، اور یہ ایک صفت الٰہیہ ہے۔ کیونکہ الحق (ذات حق) سبحانہ اپنے بندے کی ثناء اس چیز کے ساتھ کرتا ہے جو نہ تو الحق (ذات حق) پر ہے اور نہ ہی اس کی صفت ہے۔ پس اللہ کی ثناء اس میں سے یہ ہے کہ وہ سبحانہ کو اس علم کے ساتھ موصوف کرے اور اس کے لیے خلق (پیدائش) کرے۔ پس وہ بندے کی ثناء اطاعت کے ساتھ کرتا ہے، حالانکہ اطاعت الحق (ذات حق) کی صفات میں سے نہیں ہے۔ اسی طرح یہ بندہ جب اپنے رب کی ثناء اس چیز کے ساتھ کرتا ہے جو اس نے کسی اور کو عطا کی، تو اس کی اپنے رب کی ثناء اس چیز کے ساتھ جو اس نے خود کو عطا کی، وہ ہے جو اسے اپنے رب کی طرف سے اس علم کے ذریعے حاصل ہوا ہے۔ پس اس نے اپنے رب کی ثناء صرف اسی چیز کے ساتھ کی جو اسے خاص طور پر عطا کی گئی، خواہ اس نے اپنے رب کی ثناء اس چیز کے ساتھ کی جو سبحانہ نے کسی اور کو عطا کی یا اس نے غیر کا ذکر نہیں کیا اور نہ ہی اس کا تعرض کیا۔ پس اس مسئلے کو متحقق کر لو، کیونکہ یہ حقائق (حقائق) میں سے ہے، اور حقائق تبدیلی کو قبول نہیں کرتیں۔ اور جو اس منزل میں حاصل ہوتا ہے، یہ اسے وہی عطا کرتی ہے جو ہم نے ذکر کیا۔\n\nپس جب اسے وہ علم ظاہر ہوتا ہے جس کا ہم نے ذکر کیا، تو اس کا اس کی طرف دیکھنا اسے اس حال سے چھپا دیتا ہے جس پر وہ ہے، اور وہ جانتا ہے کہ وہ علم ایک غیبی امر پر دلالت کرتا ہے جسے اسے اپنے غیب میں باقی رکھنا چاہیے اور ظاہر نہیں کرنا چاہیے، اور وہ مواجہہ (روبرو) اور حضور کے خطاب کی حالت سے غیبت (غیر حاضری) کے خطاب کی طرف لوٹتا ہے، کیونکہ یہ زیادہ منزہ ہے۔ کیونکہ حقائق (حقائق) یہ بتاتی ہیں کہ تم صرف اپنے ساتھ حاضر ہوئے ہو، اس لیے کہ جب حاضر کو اس کی حاضری میں اس کے ساتھ جو حاضر ہوا ہے، امر عطا کیا جاتا ہے، تو وہ اس کے ساتھ حاضر نہیں ہو سکتا مگر اس حد تک جو تمہارا مرتبہ عطا کرتا ہے۔ پس تم اپنے ساتھ حاضر ہوئے ہو، نہ کہ اس کے ساتھ۔ کیونکہ اس کی طرف سے تم پر التجلی (ظہور الٰہی) صرف اسی قدر ہوا ہے جو تمہارا مرتبہ عطا کرتا ہے۔ پس اسے سمجھ لو، تم اس سے فائدہ اٹھاؤ گے۔ اور جب تم اس چیز سے رجوع کرو جس سے تم رجوع کر چکے ہو، تو یہ بات تم سے غائب نہ ہو، تاکہ تم یہ خیال نہ کرو کہ تم اپنے سے اعلیٰ کی طرف رجوع کر رہے ہو، کیونکہ تم نے اپنے سے رجوع نہیں کیا مگر اپنی ہی طرف۔ اور الحق (ذات حق) سبحانہ تمہاری طرف رجوع نہیں کرتا مگر تمہارے ذریعے، نہ کہ اپنے ذریعے، کیونکہ مخلوق کی وسعت میں نہیں ہے کہ وہ اسے برداشت کر سکے۔ اور اسی لیے اس کے رجوعات متنوع ہوتے ہیں، اس کے تجلیات (ظہور الٰہی) مختلف ہوتے ہیں، اور اس کے مظاہر کثرت سے ہوتے ہیں، لیکن وہ خود مکرر نہیں ہوتا، اور وہ اپنی ذات میں کثرت اور تغیر سے منزہ ہے۔ \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" (اس کی مثل کوئی چیز نہیں) اس چیز میں جو اس کی ذات کی طرف منسوب کی جاتی ہے۔\n\nاللہ تعالیٰ نے فرمایا: \"ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا\" (پھر اس نے ان پر توجہ فرمائی تاکہ وہ توبہ کریں)۔ پس بندوں کا اس کی طرف رجوع اس کے ان کی طرف رجوع کا نتیجہ ہے، اس چیز کے عطا کرنے کے ذریعے جس کے ساتھ انہوں نے اس کی طرف رجوع کیا۔ پس جب وہ اس کی طرف رجوع کرتے ہیں تو وہ ان کے لیے اس الٰہی رجوع کو دوگنا کر دیتا ہے جو ان کے اس کی طرف رجوع کا نتیجہ ہے، اور جو بذات خود اس کے ان کی طرف پہلے رجوع کا نتیجہ ہے۔ پس پہلا الرجوع الإلهی (الٰہی رجوع) عنایت اور فضل کا رجوع ہے، اور دوسرا رجوع جو ان کے اس کی طرف رجوع کا نتیجہ ہے، سبحانہ کے اس قول میں ہے: \"جو میری طرف ایک بالشت قریب ہوتا ہے، میں اس کی طرف ایک ہاتھ قریب ہوتا ہوں\" (حدیث قدسی کا مفہوم)۔ پس رجوع میں ذراع (ہاتھ) میں سے بالشت کی مقدار استحقاق کا رجوع ہے، جس کے وہ اس کی طرف رجوع کرنے سے مستحق ہوتے ہیں، اور دوسرا بالشت جس سے ذراع کا کمال ہوتا ہے، وہ اس کی طرف سے رجوع ہے وزن کو ترجیح دینے، فضل کے ساتھ وصف کرنے، اور کریم کے ساتھ معاملہ کرنے کی ترغیب اور تحریض کے لیے۔ پس دوسرا الرجوع الإلهی (الٰہی رجوع) دو امور کو شامل ہے: اس کی طرف سے رجوع الاستحقاق (استحقاق کا رجوع) جسم کے مقام پر، اور اس کی طرف سے رجوع المنة (احسان کا رجوع) روح کے مقام پر، جو اس جسم کی زندگی ہے۔ کیونکہ اگرچہ استحقاق اس چیز کی وجہ سے ہے جو الحق (ذات حق) نے خود پر واجب کر لیا ہے، لیکن حقیقت یہ بتاتی ہے کہ بندہ اپنے آقا پر کسی چیز کا مستحق نہیں ہوتا۔ پس یہ اس کے سبحانہ کا اپنے بندے پر احسان ہے کہ اس نے اپنے اوپر اس کے لیے واجب کر لیا، تاکہ بندہ اس چیز سے مانوس ہو جائے جو الحق (ذات حق) نے اس پر اپنی اطاعت میں واجب کی ہے، تاکہ وہ اس چیز کو ادا کرنے میں جلدی کرے جو اس پر واجب ہوئی ہے۔\n\nپس جب بندہ اس مقام پر حاصل ہو جاتا ہے، تو تیر انداز کے لیے اس سے آگے کوئی نشانہ نہیں ہوتا، اور وہ جانتا ہے کہ اللہ نے ارادہ کیا ہے کہ اسے اس کے عالم شہود (عالم شہود) سے اس کے عالم غیب (عالم غیب) کی طرف منتقل کر دے، تاکہ اس کے لیے اس کا غیب ایک دوسرے مقام پر شہود بن جائے، جو اس مقام سے مختلف ہے اور اس کا حکم دوسرا ہے۔ اور وہ وہ مقام ہے جہاں مظاہر الٰہیہ (الٰہی مظاہر) ہوتے ہیں، اور یہ سب سے وسیع مقامات میں سے ہے۔ اسی لیے اس منزل کو \"الأجل المسمى\" (مقررہ مدت) سے تعبیر کیا گیا، کیونکہ یہ عالم شہود (عالم شہود) سے اس کی طرف بعث (دوبارہ اٹھائے جانے) کی مدت ہے، جو اس صورت کے ساتھ مقید ہے جو صورتوں میں تحول (تبدیلی) کو قبول نہیں کرتی، لیکن تغیر (بدلاؤ) کو قبول کرتی ہے، اور وہ اس عین کا کسی اور کے ذریعے زائل ہو جانا ہے، اس غیب کی وجہ سے جس کے ساتھ وہ تھی، پس غیبی روح اس دوسرے کی صورت کو تدبیر کرتی ہے۔ اسی لیے ہم نے کہا کہ وہ تغیر کو قبول کرتا ہے اور تحویل (مکمل تبدیلی) کو قبول نہیں کرتا، کیونکہ حقائق (حقائق) تبدیل نہیں ہوتیں۔\n\nپس اس کا صورتوں میں تحول کے مقام کی طرف منتقل ہونا \"أجلاً مسمى\" (مقررہ مدت) کہلاتا ہے، یعنی معلوم انتہا والا۔ اور یہ مقام موسوی (موسوی) میں سے تھا نہ کہ کسی اور میں سے، کیونکہ خبر میں یہ نہیں آیا کہ نبی علیہ السلام نے اپنے معراج میں کسی ایسے شخص کو دیکھا جس نے دو صورتوں کو جمع کیا ہو سوائے موسیٰ علیہ السلام کے۔ پس آپ نے انہیں آسمان میں دیکھا اور ان کے درمیان جو کچھ ہوا وہ ہوا، اور وہ اپنی قبر میں نماز پڑھ رہے تھے، اور نبی صلی اللہ علیہ وسلم نے انہیں دونوں حالتوں میں ایک ساتھ دیکھا۔ اور ایسے کشف (کشف) میں یہ نہیں کہا جائے گا کہ \"آن\" (وقت) ایک ہی شخص میں دو متضاد امور کے لیے گنجائش نہیں رکھتا۔ پس جو وہ کہتا ہے وہ صحیح ہے، لیکن یہاں \"آن\" کہاں ہے؟ یہ تو صرف اس کے لیے ہے جو زمان (وقت) کے ساتھ مقید ہو اور مکان (جگہ) کے ساتھ متعین ہو۔ پس جب موجود زمان اور مکان کے ساتھ مقید نہیں ہوتا، تو یہ وصف اس پر محال نہیں ہوتا۔ اور جب تم اس بات کو سمجھ لو گے جس کی طرف ہم نے اشارہ کیا ہے، تو اس بات سے کوئی تعارض نہیں ہوگا جو ہم نے بیان کیا ہے کہ معراج رات میں ہوا جو کہ زمان ہے، اور موسیٰ علیہ السلام کا قبر اور آسمان میں ہونا جو کہ مکان ہیں۔ کیونکہ تم اپنے مذہب سے یہ تسلیم کرتے ہو کہ جسم دو جگہوں پر نہیں ہو سکتا، اور تم اس حدیث پر ایمان رکھتے ہو۔ پس اگر تم مومن ہو تو تقلید کرو، اور اگر تم عالم ہو تو اعتراض نہ کرو، کیونکہ علم تمہیں روکے گا، اور تمہیں اختیار نہیں ہے، کیونکہ صرف اللہ ہی اختیار کرتا ہے۔ اور یہ تاویل نہ کرو کہ جو زمین میں ہے وہ آسمان والے سے مختلف ہے، کیونکہ نبی علیہ السلام نے یہ نہیں فرمایا کہ میں نے موسیٰ کی روح دیکھی یا موسیٰ کا جسم، بلکہ فرمایا: \"میں نے موسیٰ کو آسمان میں دیکھا\"، اور یہ معلوم ہے کہ وہ زمین میں مدفون ہیں۔ اور اسی طرح باقی انبیاء علیہم السلام جنہیں آپ نے دیکھا۔ پس اگر مسمیٰ (نام والا) موسیٰ عین وہی نہ ہو تو اس کے بارے میں یہ خبر دینا کہ یہ موسیٰ ہے، جھوٹ ہوگا۔ اور تم ہی ہو جو کہتے ہو: \"میں نے تمہیں کل رات خواب میں دیکھا اور تم یہ یہ کہہ رہے تھے،\" حالانکہ مرئی (جسے دیکھا گیا) معلوم ہے کہ وہ اپنے گھر میں اس حالت کے علاوہ کسی اور حالت پر تھا جس پر اسے دیکھا گیا، یا اسی حالت پر تھا لیکن کسی دوسرے مقام پر، اور تم اسے یہ نہیں کہتے کہ میں نے تمہارے غیر کو دیکھا۔ پھر تم ہم پر اس طرح کی چیز کا انکار کرتے ہو۔ بلکہ حضرات (حضوریاں) اور مقامات مختلف ہوتے ہیں، اور احوال مختلف ہوتے ہیں، لیکن عین (حقیقت) ایک ہی ہوتی ہے۔\n\nپس یہ وہ کچھ ہے جو ہم نے اس منزل کے بعض مندرجات کے بارے میں ذکر کیا، اور ہم نے اس کے گھروں اور خزانوں کے بارے میں خاموشی اختیار کی ہے۔ کیونکہ کوئی منزل ایسی نہیں جس کے گھر، خزانے، تالے اور چابیاں نہ ہوں، لیکن ہر منزل میں ان کا ذکر طویل ہو جائے گا۔ اور شاید جب ہم انہیں بیان کریں تو جھوٹا شخص ان کا دعویٰ کرے۔ اور \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔ اور اس منزل میں معانی کا صورتوں میں آنے کا علم ہے، اور فتوح (فتوحات) کا علم ہے، اور اس کا ایک باب پہلے گزر چکا ہے، اور الحق (ذات حق) پر وارد ہونے والوں کا علم ہے، اور تنزیہہ کا علم ہے، اور ستر (پوشیدگی) اور التجلی (ظہور الٰہی) کا علم ہے، اور الرجوع الإلهی (الٰہی رجوع) کا علم ہے کہ وہ کس پر رجوع کرتا ہے، کیا اپنے بندوں پر یا اپنے اسماء پر۔",
    "fa": "باب دویست و هفتاد و چهارم در معرفت منزل اجل مسمی (الأجل المسمى) از عالم موسوی.\n\nفتوحات هستی در سرزمین بایر به سوی تو آمد،\nبا عزت و قهر و نصرت تأیید شده.\n\nو در شب درخشان، کاروان‌هایی آمدند\nاز عالم علوی در پناه آمرزش (الغفر).\n\nپس بازگرد، آنگاه که به پروردگار یگانه خود بازگشتی،\nبا تنزیه ایمانی که از ذکر متولد شده است.\n\nاو از عرش یا اگر بخواهد از عمای (عمي) به سوی تو بازمی‌گردد،\nبدون هوای گرمی که اندیشه من در هستی او دارد.\n\nخداوند متعال می‌فرماید: «ثُمَّ قَضى‏ أَجَلًا» (سپس مدتی را مقرر داشت) و آن پایان عمر هر زنده‌ای است که مرگ را می‌پذیرد، و «وَأَجَلٌ مُسَمًّى عِنْدَهُ» (و مدتی معین نزد اوست) و آن میقات زندگی هر کسی است که پیش از مرگ در زندگی اول خود بوده است، و این همان چیزی است که به بعث (برانگیختن) تعبیر می‌شود. به همین دلیل خداوند متعال فرمود: «ثُمَّ أَنْتُمْ تَمْتَرُونَ» (سپس شما شک می‌کنید) یعنی در آن (بعث) شک می‌کنید، زیرا در مرگ شک نمی‌کنند، چرا که مرگ برای آنان در هر حیوانی همراه با نفس‌ها مشهود است. شک تنها در بعث واقع شده است که همان اجل مسمای (الأجل المسمى) مذکور است. و اجل مرگ مسمی (معین) قرار داده نشد، زیرا خداوند می‌فرماید: «وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَن فِي السَّمَاوَاتِ وَمَن فِي الْأَرْضِ إِلَّا مَن شَاءَ اللَّهُ» (و در صور دمیده می‌شود، پس هر که در آسمان‌ها و هر که در زمین است بیهوش می‌شود، مگر کسی که خدا بخواهد). پس گروهی استثنا شده‌اند که بیهوش نمی‌شوند و نمی‌میرند. یا به این دلیل است که آنان بر حقایقی (حقائق) هستند که مرگ را نمی‌پذیرند، در این صورت استثنا منقطع است؛ و یا بر مزاجی هستند که مرگ را می‌پذیرد، اما نفخ صور را نشنیده‌اند و به آنان نرسیده است، پس بیهوش نشده‌اند، در این صورت استثنا متصل است.\n\n### [اهل الله هنگامی که حق سبحانه آنان را به سوی خود جذب می‌کند، چه مرید باشند و چه مراد، در دل‌هایشان انگیزه‌ای برای طلب سعادتشان قرار می‌دهد.]\n\nای شنونده، بدان که اهل الله (أهل الله) هنگامی که حق (الحق) سبحانه آنان را به سوی خود جذب می‌کند، چه مرید باشند و چه مراد، در دل‌هایشان انگیزه‌ای برای طلب سعادتشان قرار می‌دهد. پس به جستجوی آن می‌پردازند و در مورد آن تحقیق می‌کنند و در دل‌های خود رقت و خشوع و طلب سلامتی از آنچه مردم بر آن هستند، از حرص و حسادت و پشت کردن و دوری جستن، می‌یابند. پس هنگامی که به مکارم اخلاق وفا کردند یا به آن نزدیک شدند، در وجود خود انگیزه‌ای برای خلوت‌ها و انزوا از مردم می‌یابند. برخی از آنان به سیاحت می‌پردازند و کوه‌ها و بیابان‌ها را لازم می‌گیرند، و برخی دیگر سیاحتشان در شهرهاست؛ هرگاه که اهل شهری با او انس گرفتند یا در آن شناخته شد، از آنجا به جای دیگری کوچ می‌کند. و برخی دیگر در محل سکونت خود اتاقی را جدا کرده و در آن منفرد می‌شود و از مردم پنهان می‌گردد. همه اینها برای آن است که به تفرد با حق (الحق) که او را به سوی خود خوانده است، دست یابد و با او انس گیرد، نه برای اینکه دانسته شود یا کونی (کون) از اکوان (الأکوان) را از طریق خرق عادت در ظاهر حس یا در باطن خود بیابد. پس او پیوسته بر آنچه ذکر کردیم باقی می‌ماند تا اینکه از جانب حق (الحق)، برای برخی در نفسش، برای برخی در خیالش، یا برای برخی از خارج، چیزی بر او وارد شود که میان او و نفسش حائل گردد و از آن وارد بر خود وحشت کند و در آن ساعت طلب انس با مخلوق نماید. پس هنگامی که حکم آن وارد ساکت شد و به حس خود بازگشت، اشتیاقی شدید به آن پیدا می‌کند و در محبت آن وارد، نهایت تلاش را به کار می‌برد و شیرینی آن را هنگام فقدانش می‌یابد و لذت در حس و روحش جاری می‌شود. و در آن وارد، خطاب و تعریفی از حالش یا آنچه به آن فراخوانده می‌شود، به او می‌رسد؛ مانند ابراهیم بن ادهم هنگامی که از زین اسبش ندا داده شد که: «تو برای این خلق نشده‌ای و به این امر نشده‌ای.» و به دیگری گفته شد: «اگر مرا می‌طلبی، در اولین قدم مرا گم کرده‌ای.» و به دیگری گفته شد: «تو بنده من هستی.» اگر صاحب این انقطاع از اصحاب کوه‌ها و بیابان‌ها باشد، انس او در حیوانات قرار داده می‌شود؛ و اگر سیاح در شهرها باشد، انس او در حرکت میان دو شهر قرار داده می‌شود؛ و اگر از کسانی باشد که خانه‌اش را لازم گرفته، انس او در روحانیات قرار داده می‌شود. همه اینها ابتلا و آزمایش است، مگر اینکه خداوند انس او را در ارواح نوری ملکی قرار دهد؛ در این صورت رستگاری او امید می‌رود، بلکه محقق می‌شود، و این بشارتی از جانب خداست که عنایتی از او به سوی او شتافته است. و غیر از این، بر خطر بزرگی است، پس باید در قطع آن بکوشد. سپس، از میان آنان کسی است که هنگام وارد، فضا بر او تاریک می‌شود و از این بابت غم و تنگی سینه و فشار در قلب می‌یابد. پس باید صبر کند، زیرا به دنبال آن گشایش و انشراح می‌آید. سپس ارواح پیوسته در عالم خیالش در بیشتر حالات، او را همراهی می‌کنند و در اوقاتی در حس او ظاهر می‌شوند. پس نباید آن را دور اندازد و از آن روی گرداند، بلکه باید در از بین بردن تعلق به آن تلاش کند و با فایده‌ای که از آن به او می‌رسد، توقف کند، زیرا آن همان مطلوب است. اگر خطابی از پشت حجاب نفس خود شنید، باید گوش فرا دهد در حالی که شاهد (شهید) است و آنچه را می‌شنود درک کند. اگر کلام مقتضی پاسخی به اندازه فهم تو بود، پس به اندازه فهمت پاسخ ده؛ اگر علم به آن روزی تو شد، این همان عنایت کبری (العناية الكبرى) است. و اگر مقتضی پاسخ نبود، آنچه به تو گفته شده را در خزانه حفظت جمع کن، زیرا برای آن موطنی است که در آن به آن نیاز پیدا می‌شود و ناگزیر است، پس باید به حکم آمادگی برای آن وقت نزد تو باشد. زیرا خداوند سبحانه می‌فرماید: «أَعْدَدْتُ» (آماده کرده‌ام). پس اگر حق (الحق) با نفوذ قدرتش در حال حاضر، امور اوقات را برای ظهور احکامشان آماده کرده است، مخلوق به این کار سزاوارتر است. و فرمود: «وَإِن مِّن شَيْءٍ إِلَّا عِندَنَا خَزَائِنُهُ» (و هیچ چیزی نیست مگر آنکه خزانه‌های آن نزد ماست). و «إن» در اینجا به معنای «ما» (نیست) است، پس آن را شامل همه چیز قرار داد و آن را در خزانه‌های غیب خود نزد ما مخزون ساخت. به همین دلیل گفتیم که کون (الکون) از وجودی (وجود) صادر می‌شود که همان چیزی است که این خزانه‌ها در بر دارند، به سوی وجودی (وجود) که همان ظهور آنها از این خزانه‌ها برای خودشان است، با نوری که خود را با آن آشکار می‌کنند؛ زیرا آنها در تاریکی خزانه‌ها از دیدن ذات خود محجوب هستند، پس در حال عدم خود می‌باشند. و فرمود: «وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَّعْلُومٍ» (و ما آن را نازل نمی‌کنیم مگر به اندازه‌ای معلوم). پس نزد او متمایز نمی‌شود مگر آنچه برای او موجود است، و قدر جاری نمی‌شود مگر در عینی که از غیر خود متمایز باشد، و این صفت معدوم از هر جهت نیست. پس همه اینها دلالت بر وجود اعیان برای خداوند متعال در حال متصف بودنشان به عدم ذاتی دارد. و این همان وجود اصلی اضافی و عدم اضافی است. پس احوال برای عالم و برای هر آنچه غیر خداست ثابت شد، و اینکه وجود عین موجود نیست مگر در حق حق (الحق) سبحانه، تا معلول وجود خود نباشد؛ زیرا اگر معلول وجود خود بود، حالّ (حلول کننده) در او می‌بود، خداوند از این بسیار برتر است.\n\nپس هنگامی که انسان پس از خروج از تاریکی طبع و هوای خود، به نور عقل و هدایتش در چهل بامداد خالص شد، از او همانند آنچه بر او ظاهر شده، ظاهر می‌شود و از او همانند آنچه گرفته، می‌گیرد. و این اولین درجه دینار سوم و اولین قیراط از آن است. و پیوسته در آن باقی می‌ماند تا اینکه بر او واجب شود که بر کسی که از او می‌گیرد، طلب کند. پس هنگامی که این وجوب شرعی، مانند همه واجبات عینی، بر او واجب شد، آن اولین قیراط از دینار چهارم است و در آن هنگام «رجل» (مرد) نامیده می‌شود. و اگر این وجوب برای او حاصل نشود، پس او رجل نیست. بنابراین، کمال رجولیت (مردانگی) در همان چیزی است که ذکر کردیم، خواه مذکر باشد یا مؤنث. اما کمال ذاتی (الکمال الذاتی) که غیر از کمال رجولیت است، آن است که در عبودیت (بندگی) او، ربوبیت (ربانیت) به هیچ وجهی دخالت نکند، پس وجودی در عین عدم و ثبوتی در عین نفی باشد. و حق (الحق) او را به همین دلیل ایجاد کرده است. پس کمال رجولیت عارضی است و کمال عبودیت ذاتی. پس میان این دو مقام، همان فاصله است که میان این دو کمال است. اما درجات منازل این دو کمال، نزد ما معلوم است که کجا هستند. درجه کمال ذاتی (الکمال الذاتی) در نفس حق (الحق) است و درجات کمال عرضی در بهشت‌ها (جنان). پس برای اینان نور است و برای آنان پاداش. خداوند متعال می‌فرماید: «لَهُمْ أَجْرُهُمْ» (برای آنان پاداششان است) یعنی از کمال عرضی‌شان، و پاداش برای هر امر عرضی استحقاق می‌یابد. و «وَلَهُمْ نُورُهُمْ» (و برای آنان نورشان است) از کمال ذاتی‌شان. «اللَّهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ» (خداوند نور آسمان‌ها و زمین است). و پیامبران همگی می‌گویند، و آنان کاملان (الکمل) هستند بدون هیچ اختلافی: «إِنْ أَجْرِيَ إِلَّا عَلَى اللَّهِ» (پاداش من جز بر عهده خدا نیست). زیرا آن مقام، پاداش را ناگزیر می‌دهد. پس تفاضل (برتری) در کمال عرضی رخ می‌دهد و در کمال ذاتی رخ نمی‌دهد. خداوند متعال می‌فرماید: «تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَى بَعْضٍ» (آن پیامبرانند که برخی از آنان را بر برخی دیگر برتری دادیم). و فرمود: «هُمْ دَرَجَاتٌ عِندَ اللَّهِ» (آنان درجات نزد خدا هستند) و نگفت «لهم درجات عند الله» (برای آنان درجات نزد خداست). پس آنان را عین درجات قرار داد، زیرا آنان عین کمال ذاتی هستند، و با کمال عرضی، درجات بهشتی (جنانية) برای آنان است. این را بدان، خداوند ما را از کسانی قرار دهد که هر دو کمال را جمع کرده‌اند. و اگر از جمع محروم شدیم، خداوند ما را به فضل و کرم خود از اهل کمال ذاتی قرار دهد. و من از خداوند امید دارم که آن را به دست آورده‌ام، به گونه‌ای که به سبب حسن ظن به پروردگارم، از آن بازگردانده نمی‌شوم. چه مشهد والایی! پس هنگامی که این کمال عرضی برای بنده حاصل شد و پاسخ کونی (الکونیة) به ندای خود را بدون طلب دلیل و برهان دید، قطعاً می‌داند که حق (الحق) بر دل‌های بندگانش تجلی (تجلی) کرده است و او سبحانه واسطه را در امر خود میان خود و دل‌های بندگانش برداشته است. زیرا امر او سبحانه به رفع واسطه‌ها قابل تصور نیست که نافرمانی شود، چون امر «کن» (باش) گفته نمی‌شود مگر به کسی که به «لم یکن» (نبود) موصوف است، و کسی که به «لم یکن» موصوف است، سرپیچی از او تصور نمی‌شود. و هنگامی که امر الهی با واسطه باشد، با «کن» نخواهد بود، زیرا «کن» از ویژگی‌های امر عدمی است که با واسطه نیست، بلکه امر به چیزی است که دلالت بر فعل می‌کند، پس به اقامه نماز و دادن زکات امر می‌شود و به او گفته می‌شود: «أَقِمِ الصَّلَاةَ وَآتِ الزَّكَاةَ» (نماز را برپا دار و زکات را بده). پس اسم امر از اسم فعل برای او مشتق می‌شود. پس هر کس از آنان که بخواهد، اطاعت می‌کند و هر کس که بخواهد، نافرمانی می‌کند. اما هنگامی که با این تجلی الهی (التجلی الإلهی) بر دل‌های بندگانش، که در آن مأمور به دلیل و برهان نیازی ندارد، از روی ضرورت اطاعت کنند، زیرا ضرورت در اینجا تصور شده است به این دلیل که انسان نمی‌تواند آنچه را که در نفسش تکوّن یافته است، دفع کند. زیرا «کن» تنها به آنچه در نفس انسان تکوّن می‌یابد، تعلق گرفته است. پس حکم برای آنچه در کسی که تکوّن می‌یابد، بود. پس ناگزیر ایمان می‌آورد یا ناگزیر نماز می‌خواند یا ناگزیر روزه می‌گیرد، بر حسب آنچه حقیقت امری که «کن» به آن تعلق گرفته، اقتضا می‌کند. و گاهی امر واسطه می‌آید، اما امر الهی نمی‌آید، پس مخاطب ابزاری برای انجام فعل نمی‌یابد، و به نظر می‌رسد که نافرمان است، در حالی که در حقیقت عاجز و فاقد است، زیرا آنچه به آن امر شده بود که از او تکوّن یابد، در او تکوّن نیافته است. و خداوند بی‌نیاز و ستوده است.\n\n### [از نتایج رجولیت (مردانگی)، پیروزی بر دشمنان است.]\n\nو بدان که فتوح الهی (الفتوح الإلهی) که به کون (الکون) تعلق دارد، مانند پیروزی بر دشمنان و قهر بر آنان و رحمت بر اولیا و مهربانی نسبت به آنان، تنها از نتایج رجولیت (الرجولة) است نه از غیر آن. پس هنگامی که این مقام حاصل شد و نشأت او کامل گشت، حق (الحق) در سرّ او از کمال سبحانی خود، به خاطر کمال ذاتی (الکمال الذاتی) بنده، او را ندا می‌دهد. پس ذات ایجادکننده خود را از کمال عرضی که همان کمال الهی است، تنزیه می‌کند. زیرا کمال الهی بالفعل است و در نفوذ اقتدار در مقدورات و نفوذ اراده در مرادات و ظهور احکام اسماء الهی است. و کمال ذاتی (الکمال الذاتی) برای ذات غنی مطلق است که از همه اینها بی‌نیاز است. پس بنده در این مقام، ذات ایجادکننده خود را به وصف الوهیت شهود نمی‌کند، بلکه مشهود او بی‌نیازی آن ذات از آثاری است که الوهیت از آثار کونی (الکونیة) مستحق آن است. پس او به فقر ذاتی (افتقار ذاتی) به آن نیازمند است. بنابراین، او در آن عبادت، صاحب عبادت ذاتی است بدون اینکه امری به آن پیوسته باشد، زیرا امر تنها متعلق به امور عارضی است نه ذاتی. پس به بنده گفته نمی‌شود: «بنده باش»، زیرا او ذاتاً بنده است، بلکه به او گفته می‌شود: «ای بنده، فلان کار را انجام ده»، و عمل او امری عارضی است و عمل متعلق امر از جانب بنده است و ممکن است انجام دهد و ممکن است انجام ندهد. و این منزل همه آنچه را که ذکر کردیم، می‌دهد و تنزیه او برای ذات ایجادکننده خود، به ثنایی است که شایسته کمال ذاتی (الکمال الذاتی) است.\nسپس، به واسطه کمال عرضی که در اوست و همان کمال رجولیت است، ممکن است ثنایی از او صادر شود که شایسته اله است، به صورت عارضی و به واسطه عارضی، اما نه از طریق تنزیه. زیرا طریق تنزیه تنها برای ذات است، چنانکه فرمود: «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست) برای کمال ذاتی، و «وَهُوَ السَّمِيعُ الْبَصِيرُ» (و او شنوای بیناست) برای کمال الهی، به دلیل طلب شنیده شده و دیده شده. و هر طالب، مطلوب را فرامی‌خواند، و فرامی‌خواننده فاقد چیزی است که فرامی‌خواند، از احوال این بنده. و خداوند غنی و ستوده است. پس زبان ادب این است که گفته شود: طلب تو برای خود توست نه برای او. و در این باره شایسته است که گفته شود آنچه گفته شده است:\n\nکتابی که در آن هر چه هست، هست\nدر معانی خود بدیع است\n\nاگر آنچه در آن است را مشاهده کنی\nخواهی دید که درّ را در بر دارد\n\nو آن همین منزل و این کلامی است که برشمردیم و کتابی است که نگاشتیم. پس «فیه ما فیه» (در آن هر چه هست، هست) زبان حقیقت است که دلالت می‌کند بر اینکه امر فراتر از آن است که ذکر و نگاشته شد و در توان ترجمه و عبارت‌پردازی بیش از آنچه ظاهر شده، نیست. و خداوند بزرگ‌تر از آن است. سپس این زبان حقیقی را با قول خود «بدیع فی معانیه» (در معانی خود بدیع است) پوشاند. گویا در قول خود «ما فیه» (آنچه در آن است) از روی تعجب و شادی به آن می‌گوید. و به همین دلیل با آنچه در بیت دوم ذکر کرد، بر آن تنبیه کرد.\nسپس، ثنا بر خدا در این منزل به طور خاص، تنها به چیزی است که ربوبیت (الربوبية) مستحق آن است، به خاطر فضلی که تو را بر ابناء جنس خود اختصاص داده است، نه به آنچه که او مستحق آن است به واسطه فضلی که بر غیر تو داده و نعمتی که بر جز تو ارزانی داشته است. زیرا این منزل چنین ثنایی را در بر نمی‌گیرد. پس بنده در این منزل برای تنزیه حق (الحق)، از ثنای ربوبیت بر خودش، از جهت آنچه تو را به آن اختصاص داده است، یاری می‌جوید. سپس بنده پس از به کار بردن نهایت توان خود در ثنا بر پروردگارش به واسطه پروردگارش، از جهت نعمت او بر او، علمی الهی در بیابان نفس خود در سمت راست راهش بر او آشکار می‌شود. پس می‌فهمد که از راهی که باید بر آن نیز سلوک کند، لغزیده است. و در اینجا مسئله‌ای دقیق وجود دارد که مختص این منزل است، و آن این است که وقتی ثنای خود بر پروردگارش را به آنچه پروردگارش او را به آن اختصاص داده، مقید کرد، آیا این نقص در معرفت (المعرفة) یا در معرفت اوست، یا در وسع او جز آنچه واقع شده، نبوده است؟ و اگر در وسع نبوده، پس کمال آنچه در وسع بوده را آورده است. و آن این است که اگر بر پروردگارش به آنچه از جانب او سبحانه برای غیر این بنده ثناکننده بوده، ثنا کند، خالی از این نیست که یا بر او به آنچه در نفس خود به علم تحقق یافته، ثنا می‌کند، و جز این هم نمی‌تواند باشد. پس او به آن علم منعوت شده است، اگرچه آن اوصافی که ثنا بر غیر به واسطه آنها واقع شده، در او قائم نباشد. پس وصف او به علم به آن، ثنایی از او بر پروردگارش است به واسطه علمی که او را به آن اختصاص داده است، و آن صفتی الهی است. زیرا حق (الحق) سبحانه بر بنده خود به چیزی ثنا می‌کند که حق بر آن نیست و صفت او نیست. پس ثنا بر خدا از این جهت، وصف او سبحانه به علم به آن و خلق آن است. پس بر بنده به طاعت ثنا می‌کند، در حالی که طاعت از صفات حق نیست. همچنین این بنده هنگامی که بر پروردگارش به آنچه به غیر او داده است، ثنا می‌کند، ثنای او بر پروردگارش به آنچه در نفس خود به او داده است، همان علمی است که از پروردگارش به آن دست یافته است. پس در این صورت، او بر پروردگارش ثنا نکرده است مگر به آنچه او را به آن اختصاص داده است، خواه بر پروردگارش به آنچه سبحانه به غیر او داده است، ثنا کرده باشد یا غیر را ذکر نکرده و متعرض آن نشده باشد. پس این مسئله را دریاب، زیرا از حقایق (الحقائق) است و حقایق دگرگونی نمی‌پذیرند. و این منزل به کسی که در آن قرار گیرد، آنچه را ذکر کردیم، می‌دهد. پس هنگامی که آن علم که ذکر کردیم بر او آشکار شد، نظر او به آن، او را از آنچه بر آن است، می‌پوشاند و می‌فهمد که آن علم دلالت بر امری غیبی دارد که شایسته است آن را در غیب خود نگه دارد و آشکار نکند و از حال خطاب به مواجهه و حضور، به خطاب به غیبت بازگردد، زیرا این منزه‌تر است. چون حقایق (الحقائق) اقتضا می‌کنند که تو حاضر نشده‌ای مگر با خودت. زیرا اگر امر به حاضر در حضورش با کسی که حاضر شده است، داده شود که نمی‌تواند حاضر شود مگر تا حدی که مرتبه‌اش اقتضا می‌کند، پس با خودت حاضر شدی نه با او. زیرا از او بر تو تجلی (التجلی) نکرده است مگر به اندازه‌ای که مرتبه تو اقتضا می‌کند. پس این را بفهم تا از آن بهره‌مند شوی و این نکته را در بازگشتت به سوی او از آنچه بازگشتی، از یاد مبر تا خیال نکنی که به سوی مقامی بالاتر از خود بازگشته‌ای. زیرا تو از خودت بازنگشته‌ای مگر به سوی خودت. و حق (الحق) سبحانه به سوی تو بازنمی‌گردد مگر به واسطه تو، نه به واسطه خودش، زیرا در وسع مخلوق نیست که او را تاب آورد. و به همین دلیل بازگشت‌های او متنوع و تجلیات (تجلیات) او متفاوت و مظاهر او کثیر است و تکرار نمی‌شود، در حالی که او در ذات خود از تکثر و تغییر منزه است: «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست) در آنچه به ذات او نسبت داده می‌شود. خداوند متعال می‌فرماید: «ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا» (سپس توبه آنان را پذیرفت تا توبه کنند). پس بازگشت بندگان به سوی او، نتیجه بازگشت او به سوی آنان است، با اعطای آنچه که با آن به سوی او بازگشته‌اند. پس هنگامی که به سوی او بازگشتند، بازگشت الهی را که نتیجه بازگشت آنان به سوی اوست، مضاعف می‌کند، که آن بازگشت نیز خود نتیجه بازگشت اول او به سوی آنان است. پس بازگشت الهی اول، بازگشت عنایت و تفضل است، و بازگشت دوم که نتیجه بازگشت آنان به سوی اوست، در قول او سبحانه: «مَن تَقَرَّبَ إِلَيَّ شِبْرًا تَقَرَّبْتُ مِنْهُ ذِرَاعًا» (هر کس یک وجب به من نزدیک شود، من یک ذراع به او نزدیک می‌شوم). پس مقدار یک وجب از ذراع در بازگشت، بازگشت استحقاقی است که بازگشت آنان به سوی او مستحق آن است. و وجب دوم که کمال ذراع از بازگشت به آن حاصل می‌شود، بازگشتی از جانب او برای ترجیح وزن و وصف به فضل و ترغیب و تشویق بر معامله با کریم است. پس بازگشت الهی دوم شامل دو امر است: بازگشت استحقاق از جانب او به منزله جسد، و بازگشت منت از جانب او به منزله روح برای جسد که حیات او به آن است. زیرا اگرچه استحقاق به واسطه چیزی است که حق (الحق) بر خود واجب کرده است، اما حقیقت (الحقیقة) اقتضا می‌کند که بنده چیزی بر مولای خود مستحق نباشد. پس از منت‌های سبحانه بر بنده این است که برای او بر خود واجب کرده است تا بنده با آنچه حق بر او واجب کرده است، از طاعتش انس گیرد و برای انجام آنچه بر او واجب شده است، بشتابد.\n\nپس هنگامی که بنده در این مقام قرار گرفت، دیگر هدفی برای تیرانداز باقی نمی‌ماند و می‌داند که خداوند اراده کرده است او را از عالم شهادت (عالم شهادة) به عالم غیب (عالم غیب) منتقل کند تا غیب او در موطنی دیگر غیر از این موطن، برایش شهادت (شهادة) باشد که حکم دیگری دارد. و آن موطنی است که مظاهر الهی در آن قرار می‌گیرند و وسیع‌ترین موطن‌هاست. به همین دلیل این منزل را به اجل مسمی (الأجل المسمى) تعبیر کرد، زیرا آن اجل بعث (برانگیختن) به سوی او از عالم شهادت است که مقید به صورتی است که تحول در صور را نمی‌پذیرد، اما تغییر را می‌پذیرد، و آن زوال عین آن به غیر آن است به خاطر آن غیبی که با آن بوده است، پس روح غیبی صورت آن غیر را تدبیر می‌کند. به همین دلیل گفتیم که تغییر را می‌پذیرد و تحویل (دگرگونی کامل) را نمی‌پذیرد، زیرا حقایق (الحقائق) دگرگونی نمی‌پذیرند. پس انتقال او به موطن تحول در صور، اجل مسمی (الأجل المسمى) نامیده می‌شود، یعنی معلوم النهاية. و این منزل از مقام موسوی (المقام الموسوی) است نه غیر آن، زیرا در خبر نیامده است که پیامبر (صلی الله علیه و سلم) در معراج خود کسی را دیده باشد که دو صورت را جمع کرده باشد، جز موسی (علیه السلام). پس او را در آسمان دید و آنچه میان آن دو بود، رخ داد، در حالی که او در قبر خود نماز می‌خواند و پیامبر (صلی الله علیه و سلم) او را در هر دو حالت با هم می‌دید. و در چنین کشفی (الکشف) گفته نمی‌شود که «آن» (الآن) گنجایش دو امر متضاد در یک شخص را ندارد. آنچه می‌گوید صحیح است، اما «آن» (الآن) در اینجا کجاست؟ این تنها برای کسی است که مقید به زمان و معین به مکان باشد. پس هنگامی که موجود مقید به زمان و مکان نباشد، این وصف بر او محال نیست. و اگر آنچه را که اشاره کردیم فهمیدی، با آنچه ما به آن معتقدیم و ذکر کردیم، یعنی وقوع معراج در شب که زمان است، و بودن موسی (علیه السلام) در قبر و آسمان که مکان هستند، تعارضی نخواهد داشت. زیرا تو خود از مذهب خویش می‌پذیری که جسم در دو مکان نیست، در حالی که به این حدیث ایمان داری. پس اگر مؤمن هستی، تقلید کن، و اگر عالم هستی، اعتراض نکن، زیرا علم تو را باز می‌دارد و اختیار نداری، چرا که جز خداوند کسی آزمایش نمی‌کند. و تأویل نکن که آنکه در زمین است غیر از آنکه در آسمان است، زیرا پیامبر (علیه السلام) نگفت که روح موسی را دیدم یا جسد موسی را، بلکه فرمود: «موسی را در آسمان دیدم»، در حالی که معلوم است او در زمین دفن شده است. و همچنین سایر پیامبرانی که آنان را دید. پس اگر مسمای موسی (موسی نامیده شده) عین او نباشد، خبر دادن از او که این موسی است، دروغ است. و تو خود می‌گویی: «دیشب تو را در خواب دیدم و تو چنین و چنان می‌گفتی»، در حالی که معلوم است آن شخص دیده شده در منزل خود در حالتی غیر از حالتی بود که او را بر آن دیده است، یا در موطنی دیگر. و به او نمی‌گویی که «غیر تو را دیدم». سپس چنین چیزی را بر ما انکار می‌کنی؟ بلکه حضرات (الحضرات) و موطن‌ها متفاوت می‌شوند و احوال مختلف می‌گردند، در حالی که عین (ذات) یکی است. اینها برخی از مطالبی بود که این منزل در بر دارد، و ما از خانه‌ها و خزانه‌ها و قفل‌ها و کلیدهای آن سکوت کردیم. زیرا هیچ منزلی نیست مگر اینکه خانه‌ها و خزانه‌ها و قفل‌ها و کلیدهایی دارد، اما ذکر آنها در هر منزل طولانی می‌شود و شاید اگر آنها را بیان کنیم، دروغگو ادعای آن را کند. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند). و در این منزل، علم آمدن معانی در صور، و علم فتوح (الفتوح)، و بابی که پیشتر آمده است، و علم واردشوندگان بر حق (الحق)، و علم تنزیه، و علم ستر و تجلی (التجلی)، و علم رجوع الهی بر کسی که بازمی‌گردد، وجود دارد؛ آیا بر بندگانش بازمی‌گردد یا بر اسماء خود؟"
  },
  "page_count": 5
}