{
  "id": 547,
  "title": {
    "ar": "الباب السابع والأربعون وخمسمائة في معرفة حال قطب كان منزله فَاصْدَعْ بِما تُؤْمَرُ",
    "en": "The Five Hundred and Forty-Seventh Chapter: Concerning the Knowledge of the State of a Pole (قطب) Whose Station Was: <<فَاصْدَعْ بِما تُؤْمَرُ>> (Therefore proclaim what you are commanded).",
    "ur": "باب پانچ سو سینتالیس: اس قطب (قطب) کے حال کی معرفت (معرفۃ) میں جس کا روحانی مقام یہ تھا: \"پس آپ اس چیز کا برملا اعلان کر دیں جس کا آپ کو حکم دیا جاتا ہے\" (فَاصْدَعْ بِما تُؤْمَرُ)۔",
    "fa": "باب پانصد و چهل و هفتم در معرفت حال قطبی که منزل او «فَاصْدَعْ بِما تُؤْمَرُ» (پس آنچه را که بدان مأموری آشکار کن) بود."
  },
  "content": {
    "ar": "## «الباب السابع والأربعون وخمسمائة في معرفة حال قطب كان منزله فَاصْدَعْ بِما تُؤْمَرُ»\n\n\n> اصدع بربك أو بأمر منه تكن *** ممن يكلمه الرحمن تكليما\n\n\n> سلم إليه الذي جاءت أوامره *** به من الحكم في الأعيان تسليما\n\n\n> يعطيك نورا يريك العين في عدم *** وفي وجود وأحكاما وتحكيما\n> وينزلنك عند الحق منزلة *** ما نالها أحد قدوا وتعظيما\n\n\n> ويمنحنك علما لست تعرفه *** به وترزق آدابا وتعليما\n\n\n### [إن العبد إذا اتصف بصفة الجبروت والكبرياء]\n\n\nاعلم أيدنا الله وإياك بِرُوحٍ مِنْهُ أن الحق لا يقاوم إلا بالحق فيكون هو الذي يقاوم نفسه وهو معنى‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم وأعوذ بك منك‏\n\n\nفإذا اتصف العبد بصفة الجبروت والكبرياء قصمه الحق فإنه تعالى لا يقهر إلا المنازع ولهذا العارف لا يتجلى له الحق في الاسم القاهر أبدا لأنه غير منازع فالعارف يتجلى بالاسم القاهر ولا يتجلى له الحق فيه وهذه الصفة في المخلوقين لا تكون قط عن حقيقة بل يعلمون عجزهم وقصورهم وإنما ذلك صورة ظاهرة كبرق الخلب فعلى قدر ما يظهر من هذه الصفة يتوجه القهر الإلهي والبطش الشديد ولما اختلف المحل على الصفة لذلك ظهر الأقوى على الأضعف فما وقع التفاضل إلا في المحل لا في الصفة فإذا صدع بأمر الله فالقهر بأمر الله لا له فنفذ في المصدوع لأنه ما قال له اصدع إلا ولا بد أن يكون ذلك قابلا للنفوذ فيه حتى يسمى مصدوعا فلو كان لا يقبل النفوذ لكان هذا الأمر عبثا إلا ترى إلى قوله تعالى وأَعْرِضْ عَنِ الْمُشْرِكِينَ فإنه لا ينفذ في المشرك إذ لو نفذ لوحد فقال له وأعرض لأنهم ليسوا بمحل فيأمر الرسول المشرك من غير صدع والذي علم منه أنه يجيب ويقبل الأمر ولو على كره هو الذي يصدع بالأمر فإذا تحقق العبد بهذا الذكر ولم ينكشف له من يقبل أمر ربه ممن لا يقبله فما هو في بعض الوجوه ممن دعا إلى الله على بصيرة فإن الداعي على بصيرة لا بد أن يكون آمرا في حق طائفة وصادعا بالأمر في حق طائفة فيعلم من يتأثر لأمره ممن لا يتأثر ففائدة هذا الذكر تنوير البصائر وكمال الدعوة إلى الله وهي مدرجة الرسل عليه السلام والكمل من الورثة في الدعاء فتجد كلامهم كأنه القرآن جديدا لا يبلى فيفتح للمؤمن به المعاني دائما والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 547: Concerning the Knowledge of the State of a Pole Whose Station Was: \"Therefore Proclaim Openly That Which You Are Commanded\"\n\nProclaim openly by your Lord or by an order from Him,\nYou will be among those whom the All-Merciful addresses directly.\n\nSubmit to Him completely that which His commands\nBrought forth of judgment concerning the Fixed Entities (الأعيان الثابتة).\n\nHe grants you a light that shows you the reality (العين) in non-existence\nAnd in existence, and judgments and the power to rule.\nAnd He places you with The Real (الحق) in a station\nThat no one has attained in measure or veneration.\n\nAnd He grants you a knowledge that you do not know by it,\nAnd you are provided with manners and instruction.\n\n### [If the servant is characterized by the attribute of Omnipotence and Majesty]\n\nKnow—may Allah support us and you with a Spirit from Him—that The Real (الحق) is not resisted except by The Real, so He is the one who resists Himself. This is the meaning of his saying, peace and blessings be upon him: \"And I seek refuge in You from You.\"\n\nIf the servant is characterized by the attribute of Omnipotence (الجبروت) and Majesty (الكبرياء), The Real crushes him, for He, the Exalted, only subjugates the contender. For this reason, The Real (الحق) never manifests (يتجلى) to the Gnostic (العارف) through the Name The Subduer (القاهر), because he is not a contender. Thus, the Gnostic manifests by the Name The Subduer, but The Real does not manifest to him through it.\n\nAnd this attribute, when found in creatures, is never based on reality; rather, they know their incapacity and deficiency. That is merely an apparent image, like a deceptive flash of lightning. Thus, according to the measure that this attribute appears, the Divine Subjugation (القهر الإلهي) and severe grip are directed. And since the locus (المحل) differed concerning the attribute, the stronger appeared over the weaker. Thus, the differentiation occurred only in the locus, not in the attribute.\n\nSo, when he proclaims openly by the command of Allah, the subjugation is by Allah's command, not for his own sake, and thus it penetrates the one being proclaimed to (المصدوع). This is because He did not say to him, \"Proclaim openly,\" unless that recipient must be capable of being penetrated by it, so that he is called 'the one proclaimed to.' If he were not capable of accepting penetration, this command would be futile. Do you not see His saying, the Exalted: <<وَأَعْرِضْ عَنِ الْمُشْرِكِينَ>> (And turn away from the polytheists)? For it does not penetrate the polytheist, since if it penetrated, he would become a monotheist. So He said to him, \"Turn away,\" because they are not a locus (محل).\n\nThus, the Messenger commands the polytheist without 'proclaiming openly' (صدع). But the one from whom it is known that he will respond and accept the command, even reluctantly, is the one who is proclaimed to openly with the command.\n\nSo, if the servant realizes this remembrance (الذكر) but it is not unveiled to him who accepts the command of his Lord and who does not, then in some respects, he is not among those who call to Allah upon clear insight (بصيرة). For the caller upon clear insight must be a commander regarding one group and one who proclaims openly with the command regarding another group, so he knows who is affected by his command and who is not.\n\nThus, the benefit of this remembrance is the illumination of insights (البصائر) and the perfection of the call to Allah, and this is the path of the Messengers, peace be upon them, and the perfect ones among the inheritors in calling. So you find their speech, like the Quran, ever new and never worn out, and it always opens up meanings for the believer in it. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah says the truth, and He guides to the way).",
    "ur": "باب نمبر ۵۴۷: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"پس جو حکم دیا جاتا ہے اسے کھول کر بیان کر\" (فَاصْدَعْ بِما تُؤْمَرُ)۔\n\nاپنے رب کے ذریعے یا اس کے حکم کے ذریعے کھول کر بیان کر، تو ان میں سے ہو جائے گا جن سے رحمن کلام کرتا ہے، کلام کرنا (تکلیما)۔\n\nاس کے سپرد کر دے وہ حکم جو اعیان (موجودات) میں اس کے احکام کے ذریعے آیا ہے، مکمل سپردگی (تسلیما) کے ساتھ۔\n\nوہ تجھے ایک نور عطا کرے گا جو تجھے عدم (نیستی) اور وجود (ہستی) میں حقیقت دکھائے گا، اور احکام اور فیصلہ کرنے کی قوت (تحکیما) بھی۔\n\nاور وہ تجھے ذات حق (الحق) کے ہاں ایک ایسا مقام عطا کرے گا جسے قدر و تعظیم کے لحاظ سے کسی نے حاصل نہیں کیا۔\n\nاور وہ تجھے ایک ایسا علم بخشے گا جسے تو اس کے بغیر نہیں جانتا، اور تجھے آداب اور تعلیم سے نوازا جائے گا۔\n\n***\n\n[جب بندہ جبروت اور کبریائی کی صفت سے متصف ہوتا ہے]\n\nجان لو، اللہ ہمیں اور تمہیں اپنی روح (رُوحٍ مِنْهُ) سے تائید بخشے، کہ ذات حق (الحق) کا مقابلہ صرف ذات حق (الحق) ہی سے کیا جا سکتا ہے۔ پس وہ (ذات حق) ہی ہے جو اپنا مقابلہ خود کرتا ہے۔ اور یہی نبی اکرم صلی اللہ علیہ وسلم کے اس قول کا مفہوم ہے: \"اور میں تیری پناہ چاہتا ہوں تجھ سے\" (وأعوذ بك منك)۔\n\nپس جب بندہ جبروت اور کبریائی کی صفت سے متصف ہوتا ہے تو ذات حق (الحق) اسے توڑ ڈالتا ہے، کیونکہ وہ (اللہ تعالیٰ) صرف مقابلہ کرنے والے کو ہی مغلوب کرتا ہے۔ اسی لیے عارف (معرفت رکھنے والے) کے لیے ذات حق (الحق) کا ظہور (التجلی) کبھی بھی اسم القاہر (غالب) میں نہیں ہوتا، کیونکہ وہ مقابلہ کرنے والا نہیں ہوتا۔ پس عارف (معرفت رکھنے والا) اسم القاہر کے ذریعے ظہور (التجلی) کرتا ہے، لیکن ذات حق (الحق) اس میں اس کے لیے ظہور (التجلی) نہیں کرتا۔ اور مخلوقات میں یہ صفت کبھی بھی حقیقت سے نہیں ہوتی، بلکہ وہ اپنی عاجزی اور کوتاہی کو جانتے ہیں، اور یہ صرف ایک ظاہری صورت ہوتی ہے، جیسے جھوٹی بجلی کی چمک۔\n\nپس جس قدر یہ صفت ظاہر ہوتی ہے، اسی قدر قہر الٰہی اور شدید گرفت متوجہ ہوتی ہے۔ اور چونکہ محل (جگہ) صفت سے مختلف تھا، اس لیے قوی نے ضعیف پر غلبہ پایا۔ پس فضیلت صرف محل میں واقع ہوئی، صفت میں نہیں۔ پس جب وہ اللہ کے حکم کے ساتھ کھول کر بیان کرتا ہے (صدع)، تو قہر اللہ کے حکم سے ہوتا ہے، نہ کہ اس کے لیے۔ پس وہ (حکم) اس میں نافذ ہو جاتا ہے جسے کھول کر بیان کیا گیا ہے، کیونکہ اسے \"کھول کر بیان کر\" (اصدع) کا حکم صرف اسی صورت میں دیا گیا جب یہ ضروری تھا کہ وہ (محل) اس میں نفوذ قبول کرنے والا ہو، تاکہ اسے مصدوع (جس میں نفوذ ہو چکا ہو) کہا جائے۔ اور اگر وہ نفوذ قبول نہ کرتا تو یہ حکم بے کار ہوتا۔\n\nکیا تم اللہ تعالیٰ کے اس قول کو نہیں دیکھتے: \"اور مشرکوں سے اعراض کرو\" (وَأَعْرِضْ عَنِ الْمُشْرِكِينَ)۔ پس یہ (حکم) مشرک میں نافذ نہیں ہوتا، کیونکہ اگر وہ نافذ ہو جاتا تو وہ موحد (توحید پرست) بن جاتا۔ پس اللہ نے اسے فرمایا: \"اور اعراض کر\" (وَأَعْرِضْ)، کیونکہ وہ محل (قبولیت کی جگہ) نہیں ہیں۔ پس رسول (صلی اللہ علیہ وسلم) مشرک کو بغیر کھول کر بیان کرنے (صدع) کے حکم دیتے ہیں۔ اور جس کے بارے میں یہ معلوم ہو کہ وہ جواب دے گا اور حکم کو قبول کرے گا، اگرچہ ناگواری کے ساتھ ہی سہی، وہی ہے جسے حکم کھول کر بیان کیا جاتا ہے (یصدع بالأمر)۔\n\nپس جب بندہ اس ذکر (مقام) سے متحقق ہو جاتا ہے اور اس پر یہ کشف (الکشف) نہ ہو کہ کون اس کے رب کا حکم قبول کرے گا اور کون نہیں کرے گا، تو وہ بعض پہلوؤں سے ان لوگوں میں سے نہیں ہے جنہوں نے بصیرت کے ساتھ اللہ کی طرف دعوت دی۔ کیونکہ بصیرت کے ساتھ دعوت دینے والے کے لیے ضروری ہے کہ وہ ایک گروہ کے حق میں صرف حکم دینے والا ہو، اور دوسرے گروہ کے حق میں حکم کو کھول کر بیان کرنے والا (صادعا بالأمر) ہو۔ پس وہ جانتا ہے کہ کون اس کے حکم سے متاثر ہوگا اور کون متاثر نہیں ہوگا۔ پس اس ذکر کا فائدہ بصیرتوں کو منور کرنا اور اللہ کی طرف دعوت کی تکمیل ہے۔ اور یہ انبیاء علیہم السلام اور دعوت میں کامل ورثاء کا راستہ ہے۔ پس تم ان کی بات کو ایسا پاؤ گے جیسے وہ نیا قرآن ہو جو پرانا نہیں ہوتا، پس وہ اس پر ایمان لانے والے کے لیے ہمیشہ نئے معانی کھولتا ہے۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و چهل و هفتم در شناخت حال قطبی که منزلگاهش [آیه] «پس آنچه را بدان مأمور شده‌ای آشکار کن (فَاصْدَعْ بِما تُؤْمَرُ)» بود.\n\nپروردگارت یا به امر او آشکار کن (اصدع)، تا از کسانی باشی *** که رحمان با او سخن می‌گوید، سخن گفتنی (تکلیماً).\nآنچه اوامرش در مورد احکام در اعیان (حقایق موجودات) آورده است، *** با تسلیم کامل به او واگذار.\nنوری به تو می‌بخشد که چشم را در نیستی (عدم) *** و در هستی (وجود)، و احکام و داوری‌ها را به تو می‌نمایاند.\nو تو را نزد الحق (خداوند) به منزلتی می‌رساند *** که هیچ کس از نظر قدر و عظمت به آن نرسیده است.\nو علمی را به تو عطا می‌کند که آن را نمی‌شناسی، *** و به واسطه آن، ادب‌ها و تعلیمات روزی تو می‌شود.\n\n### [درباره اینکه بنده هرگاه به صفت جبروت و کبریا متصف شود]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که الحق (خداوند) جز با الحق مقاومت نمی‌شود. پس اوست که با نفس خود مقاومت می‌کند، و این معنای سخن پیامبر (صلی الله علیه و سلم) است که فرمود: «و از تو به تو پناه می‌برم (وأعوذ بك منك)».\n\nپس هرگاه بنده به صفت جبروت و کبریا متصف شود، الحق او را درهم می‌شکند. زیرا خداوند متعال جز کسی را که منازعه می‌کند، مقهور نمی‌سازد. به همین دلیل، الحق (خداوند) هرگز در اسم القاهر بر عارف تجلی (التجلی) نمی‌کند، زیرا عارف منازعه‌کننده نیست. پس عارف با اسم القاهر تجلی می‌کند، اما الحق در آن اسم بر او تجلی نمی‌کند. و این صفت در مخلوقات هرگز از روی حقیقت نیست، بلکه آنان به عجز و قصور خود آگاهند. این تنها صورتی ظاهری است، مانند برق دروغین (برق الخلب).\n\nپس به اندازه‌ای که از این صفت ظاهر شود، قهر الهی و بطش شدید متوجه آن می‌گردد. و چون محل (مخلوق) با صفت (الهی) متفاوت است، از این رو قوی‌تر بر ضعیف‌تر غلبه می‌کند. پس برتری (التفاضل) تنها در محل واقع می‌شود نه در صفت.\n\nپس هرگاه به امر خدا آشکار کند (صدع)، قهر به امر خداست نه برای او. پس در آن که آشکار شده (المصدوع) نفوذ می‌کند، زیرا به او گفته نشده است «آشکار کن (اصدع)» مگر اینکه آن [محل] لزوماً قابلیت نفوذ در آن را داشته باشد تا «آشکار شده» نامیده شود. اگر قابلیت نفوذ نداشت، این امر بیهوده می‌بود.\n\nآیا به این سخن خداوند متعال نمی‌نگری: «و از مشرکان روی بگردان (وَأَعْرِضْ عَنِ الْمُشْرِكِينَ)»؟ زیرا [امر] در مشرک نفوذ نمی‌کند، چرا که اگر نفوذ می‌کرد، موحد می‌شد. پس به او فرمود: «روی بگردان»، زیرا آنان محل (قابلیت) نیستند. بنابراین، پیامبر (ص) را به امر کردن مشرک بدون آشکار کردن (صدع) فرمان می‌دهد.\n\nو کسی که دانسته شود پاسخ می‌دهد و امر را می‌پذیرد، حتی اگر با اکراه باشد، اوست که امر را آشکار می‌کند (یصدع بالأمر). پس اگر بنده به این ذکر (آشکار کردن) متحقق شود و برایش آشکار (کشف) نگردد که چه کسی امر پروردگارش را می‌پذیرد و چه کسی نمی‌پذیرد، در برخی وجوه از کسانی نیست که با بصیرت به سوی خدا دعوت می‌کنند.\n\nزیرا دعوت‌کننده بر بصیرت (معرفت) ناگزیر است که در حق گروهی امرکننده باشد و در حق گروهی دیگر آشکارکننده امر (صادع بالأمر). پس می‌داند چه کسی از امر او تأثیر می‌پذیرد و چه کسی تأثیر نمی‌پذیرد.\n\nپس فایده این ذکر، تنویر بصیرت‌ها و کمال دعوت به سوی خداست. و این راه و روش پیامبران (علیهم السلام) و وارثان کامل آنان در دعوت است. پس سخن آنان را می‌یابی که گویی قرآن است، نو و کهنه ناشدنی، که همواره معانی را برای مؤمن به آن می‌گشاید. و خداوند حق را می‌گوید و او راه را هدایت می‌کند (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}