{
  "id": 61,
  "title": {
    "ar": "الباب الحادي والستون في معرفة جهنم وأعظم المخلوقات فيها عذابا ومعرفة بعض العالم العلوي",
    "en": "Chapter Sixty-One: Concerning the Knowledge of Hell (Jahannam), the Creatures Suffering the Greatest Torment Therein, and the Knowledge of a Part of the Celestial World (al-ʿĀlam al-ʿUlwī).",
    "ur": "باب اکسٹھواں: جہنم کی معرفت (المعرفۃ)، اور اس میں عذاب کے لحاظ سے عظیم ترین مخلوقات، اور عالم علوی (العالم العلوي) کے بعض حصے کی معرفت (المعرفۃ) کا بیان",
    "fa": "باب شصت و یکم در معرفت جهنم و بزرگترین مخلوقات در آن از حیث عذاب و معرفت بخشی از عالم علوی"
  },
  "content": {
    "ar": "## (الباب الحادي والستون في معرفة جهنم وأعظم المخلوقات فيها عذابا ومعرفة بعض العالم العلوي)\n\n\n> إن السماء تعود رتقا مثل ما *** كانت وأنجمها يزول ضياؤها\n\n\n> هذا لينصفك المقيم بأرضها *** وعليه قام عمادها وبناؤها\n\n\n> فأشد خلق الله آلاما بها *** من كان منها خلقه فسماؤها\n\n\n> تكسوه حلة ناره من نورها *** فلذاك يعظم في النفوس بلاؤها\n\n\n### [جهنم سجن المعطلة وحصير الكفرة]\n\n\nاعلم عصمنا الله وإياك أن جهنم من أعظم المخلوقات وهي سجن الله في الآخرة يسجن فيه المعطلة والمشركون وهي لهاتين الطائفتين دار مقامة والكافرون والمنافقون وأهل الكبائر من المؤمنين قال تعالى وجَعَلْنا جَهَنَّمَ لِلْكافِرِينَ حَصِيراً ثم يخرج بالشفاعة ممن ذكرنا وبالامتنان الإلهي من جاء النص الإلهي فيه وسميت جهنم جهنم لبعد قعرها يقال بئر جهنام إذا كانت بعيدة القعر وهي تحوي على حرور وزمهرير ففيها البرد على أقصى درجاته والحرور على أقصى درجاته وبين أعلاها وقعرها خمس وسبعون مائة من السنين‏\n\n\n### [هل خلقت جهنم أم لم تخلق بعد]\n\n\nواختلف الناس في خلقها هل خلقت بعد أم لم تخلق والخلاف مشهور فيها وكل واحد من الطائفتين يحتج فيما ذهب إليه بما يراه حجة عنده وكذلك اختلفوا في الجنة وأما عندنا وعند أصحابنا أهل الكشف والتعريف فهما مخلوقتان غير مخلوقتين فأما قولنا مخلوقة فكرجل أراد أن يبني دارا فأقام حيطانها كلها الحاوية عليها خاصة فيقال قد بنى دارا فإذا دخلها لم ير إلا سورا دائرا على فضاء وساحة ثم بعد ذلك ينشئ بيوتها على أغراض الساكنين فيها من بيوت وغرف وسراديب ومهالك ومخازن وما ينبغي أن يكون فيها مما يريده الساكن أن يجعل فيها من الآلات التي تستعمل في عذاب الداخل فيها\n\n\n### [حرور جهنم ووقودها]\n\n\nوهي دار حرورها هواء محترق لا جمر لها سوى بنى آدم والأحجار المتخذة آلهة والجن لهبها قال تعالى وَقُودُهَا النَّاسُ والْحِجارَةُ وقال إِنَّكُمْ وما تَعْبُدُونَ من دُونِ الله حَصَبُ جَهَنَّمَ وقال تعالى فَكُبْكِبُوا فِيها هُمْ والْغاوُونَ وجُنُودُ إِبْلِيسَ أَجْمَعُونَ وتحدث فيها الآلات بحدوث أعمال الجن والإنس الذين يدخلونها\n\n\n### [جهنم أوجدها الله بطالع الثور]\n\n\nوأوجدها الله بطالع الثور ولذلك كان خلقها في الصورة صورة الجاموس سواء هذا الذي يعول عليه عندنا وبهذه الصورة رآها أبو الحكم بن برجان في كشفه وقد تمثل لبعض الناس من أهل الكشف في صورة حية فيتخيل إن تلك الصورة هي التي خلقها الله عليها كأبي القاسم بن قسي وأمثاله ولما خلقها الله تعالى كان زحل في الثور وكانت الشمس والأحمر في القوس وكان سائر الدراري في الجدي وخلقها الله تعالى من تجلى‏\n\n\nقوله في حديث مسلم جعت فلم تطعمني وظمئت فلم تسقني ومرضت فلم تعدني‏\n\n\nوهذا أعظم نزول نزله الحق إلى عباده في اللطف بهم فمن هذه الحقيقة خلقت جهنم أعاذنا الله وإياكم منها فلذلك تجبرت على الجبابرة وقصمت المتكبرين‏\n\n\n### [آلام جهنم من صفة الغضب الإلهي النازل بأهلها]\n\n\nوجميع ما يخلق فيها من الآلام التي يجدها الداخلون فيها فمن صفة الغضب الإلهي ولا يكون ذلك إلا عند دخول الخلق فيها من الجن والإنس متى دخلوها وأما إذا لم يكن فيها أحد من أهلها فلا ألم فيها في نفسها ولا في نفس ملائكتها بل هي ومن فيها من زبانيتها في رحمة الله منغمسون ملتذون يسبحون لا يَفْتُرُونَ يقول تعالى ولا تَطْغَوْا فِيهِ فَيَحِلَّ عَلَيْكُمْ غَضَبِي ومن يَحْلِلْ عَلَيْهِ غَضَبِي فَقَدْ هَوى‏ أي ينزل بكم غضبي فأضاف الغضب إليه وإذا نزل بهم كانوا محلا له وجهنم إنما هي مكان لهم وهم النازلون فيها وهم محل الغضب وهو النازل بهم فإن الغضب هنا هو عين الألم فمن لا معرفة له ممن يدعي طريقتنا ويريد أن يأخذ الأمر بالتمثيل والقوة والمناسبة في الصفات فيقول إن جهنم مخلوقة من القهر الإلهي وإن الاسم القاهر هو ربها والمتحلي لها ولو كان الأمر كما قاله لشغلها ذلك بنفسها عما وجدت له من التسلط على الجبابرة ولم يتمكن لها أن تقول‏\nهَلْ من مَزِيدٍ ولا إن تقول أكل بعضي بعضا فنزول الحق برحمته إليها التي وَسِعَتْ كُلَّ شَيْ‏ءٍ وحنانه وسع لها المجال في الدعوى والتسلط على من تجبر على من أحسن إليها هذا الإحسان وجميع ما تفعله بالكفار من باب شكر المنعم حيث أنعم عليها فما تعرف منه سبحانه إلا لنعمة المطلقة التي لا يشوبها ما يقابلها فالناس غالطون في شأن خلقها\n\n\n### [المنافقون في الدرك الأسفل من جهنم‏]\n\n\nومن أعجب ما روينا عن رسول الله صلى الله عليه وسلم‏\n\n\nأن رسول الله صلى الله عليه وسلم كان قاعدا مع أصحابه في المسجد فسمعوا هدة عظيمة فارتاعوا فقال رسول الله صلى الله عليه وسلم أ تعرفون ما هذه الهدة قالوا الله ورسوله اعلم قال حجر ألقى من أعلى جهنم منذ سبعين سنة الآن وصل إلى قعرها\n\n\nفكان وصوله إلى قعرها وسقوطه فيها هذه الهدة فما فرغ من كلامه صلى الله عليه وسلم إلا والصراخ في دار منافق من المنافقين قد مات وكان عمره سبعين سنة\n\n\nفقال رسول الله صلى الله عليه وسلم الله أكبر فعلم علماء الصحابة أن هذا الحجر هو ذاك المنافق وأنه منذ خلقه الله يهوى في نار جهنم وبلغ عمره سبعين سنة فلما مات حصل في قعرها\n\n\nقال تعالى إِنَّ الْمُنافِقِينَ في الدَّرْكِ الْأَسْفَلِ من النَّارِ فكان سماعهم تلك الهدة التي أسمعهم الله ليعتبروا فانظر ما أعجب كلام النبوة وما ألطف تعريفه وما أحسن إشارته وما أعذب كلامه صلى الله عليه وسلم‏\n\n\n### [تخاصم أهل النار في النار]\n\n\nولقد سألت الله أن يمثل لي من شأنها ما شاء فمثل لي حالة خصامهم فيها وهو قوله تعالى إِنَّ ذلِكَ لَحَقٌّ تَخاصُمُ أَهْلِ النَّارِ وقوله تعالى قالُوا وهُمْ فِيها يَخْتَصِمُونَ تَاللَّهِ إِنْ كُنَّا لَفِي ضَلالٍ مُبِينٍ لضلالهم وآلهتهم إِذْ نُسَوِّيكُمْ بِرَبِّ الْعالَمِينَ وما أَضَلَّنا إِلَّا الْمُجْرِمُونَ وهم أهل النار الذين هم أهلها الذين يقول الله فيهم وامْتازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ يريد بالمجرمين أهل النار الذين يعمرونها ولا يخرجون منها يمتازون عن الذين يخرجون منها بشفاعة الشافعين وسابق العناية الإلهية في الموحدين‏\n\n\n### [الرحمة التامة في التلقي من النبوة والوقوف عند الكتاب والسنة]\n\n\nفهذا مثل لي في وقت منها فما شبهت خصامهم فيها إلا كخصام أصحاب الخلاف في مناظرتهم إذا استدل أحدهم فإذا رأيت ذلك تذكرت الحالة التي أطلعني الله عليها ورأيت الرحمة كلها في التسليم والتلقي من النبوة والوقوف عند الكتاب والسنة ولقد عمي الناس عن‏\n\n\nقوله صلى الله عليه وسلم عند نبي لا ينبغي تنازع‏\n\n\nوحضور حديثه صلى الله عليه وسلم كحضوره لا ينبغي أن يكون عند إيراده تنازع ولا يرفع السامع صوته عند سرد الحديث النبوي فإن الله يقول لا تَرْفَعُوا أَصْواتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ ولا فرق عند أهل الله بين صوت النبي أو حكاية قوله فما لنا إلا التهيؤ لقبول ما يرد به المحدث من كلام النبوة من غير جدال سواء كان ذلك الحديث جوابا عن سؤال أو ابتداء كلام فالوقوف عند كلامه في المسألة أو في النازلة واجب فمتى ما قيل قال الله أو قال رسول الله صلى الله عليه وسلم ينبغي أن يقبل ويتأدب السامع ولا يرفع صوته على صوت المحدث إذا قال ما قال الله أو سرد الحديث عن رسول الله صلى الله عليه وسلم يقول الله تعالى فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله وما تلاه إلا رسول الله صلى الله عليه وسلم وما سمعه السامع إلا منه ثم إذا شاركه السامع في حال كلامه فهو ليس بسامع فإنه من الآداب التي أدب الله نبيه صلى الله عليه وسلم قوله ولا تَعْجَلْ بِالْقُرْآنِ من قَبْلِ أَنْ يُقْضى‏ إِلَيْكَ وَحْيُهُ والله يقول لا تَرْفَعُوا أَصْواتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ ولا تَجْهَرُوا لَهُ بِالْقَوْلِ كَجَهْرِ بَعْضِكُمْ لِبَعْضٍ وتوعد على ذلك بحبط العمل من حيث لا يشعر الإنسان فإنه يتخيل في رده وخصامه أنه يذب عن دين الله وهذا من مكر الله الذي قال فيه سَنَسْتَدْرِجُهُمْ من حَيْثُ لا يَعْلَمُونَ وقال ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ فالعاقل المؤمن الناصح نفسه إذا سمع من يقول قال الله تعالى أو قال رسول الله صلى الله عليه وسلم فلينصت ويصغ ويتأدب ويتفهم ما قال الله أو ما قال رسوله صلى الله عليه وسلم يقول الله وإِذا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوا لَهُ وأَنْصِتُوا لَعَلَّكُمْ تُرْحَمُونَ فأوقع الترجي مع هذه الصفة وما قطع بالرحمة فكيف حال من خاصم ورفع صوته وداخل التالي وسأرد الحديث النبوي في الكلام وأرجو أن يكون الترجي الإلهي واجبا كما يراه العلماء\n\n\n### [رؤي غيبة واكتشافات علمية]\n\n\nولما عاينت هذا المحل رأيت عجبا وفي هذه الرؤية رأيت اعتماد الماء على الهواء وهو من أعجب الأشياء في عمارة الأحياز وإن جوهرين لا يكونان في حيز واحد وإن الحيز لن شغله وفي هذه الرؤية علمت إبطال التوالد وأن المحرك للأشياء هو الله تعالى وأن السبب لا أثر له في الفعل جملة واحدة وفي هذه الرؤية علمت إن الألطف أقوى من الأكثف فإن الهواء ألطف من الماء بلا شك وقد منعه ولم يقاومه الماء في القوة ومنعه من النزول فإني رأيت نفسي في الهواء والماء فوقي ويمنعه الهواء من النزول إلى الأرض وفي هذه الرؤية علمت علوما جمة كثيرة\nوفي هذه الرؤية رأيت من دركات أهل النار من كونها جهنم لا من كونها نارا ما شاء الله أن يطلعني منها ورأيت فيها موضعا يسمى المظلمة نزلت في درجة نحو خمسة أدراج ورأيت مهالكها ثم زج بي في الماء علوا فاخترقته وقد رأيت عجبا وعلمت في أحوال مخاصمتهم حيث يختصمون في الجحيم وأن ذلك الخصام هو نفس عذابهم في تلك الحال وأن عذابهم في جهنم ما هو من جهنم وإنما جهنم دار سكناهم وسجنهم والله يخلق الآلام فيهم متى شاء فعذابهم من الله وهم محل له‏\n\n\n### [أبواب جهنم السبع وحرسها]\n\n\nوخلق الله لجهنم سبعة أبواب لكل باب جزء من العالم ومن العذاب مقسوم وهذه الأبواب السبعة مفتحة وفيها باب ثامن مغلق لا يفتح وهو باب الحجاب عن رؤية الله تعالى وعلى كل باب ملك من الملائكة ملائكة السموات السبع عرفت أسماءهم هنالك وذهبت عن حفظي إلا إسماعيل فهو بقي على ذكري‏\n\n\n### [الكواكب في جهنم مظلمة الأجرام‏]\n\n\nوأما الكواكب كلها فهي في جهنم مظلمة الأجرام عظيمة الخلق وكذلك الشمس والقمر والطلوع والغروب لهما في جهنم دائما فشمسها شارقة لا مشرقة والتكوينات عن سيرها بحسب ما يليق بتلك الدار من الكائنات وما تغير فيها من الصور في التبديل والانتثار ولهذا قال تعالى النَّارُ يُعْرَضُونَ عَلَيْها غُدُوًّا وعَشِيًّا والحالة مستمرة ففي البرزخ يكون العرض وفي الدار الآخرة يكون الدخول فذوات الكواكب فيها صورتها صورة الكسوف عندنا سواء غير أن وزن تلك الحركات في تلك الدار خلاف ميزانها اليوم فإن كسوفها ما ينجلي وهو كسوف في ذاتها لا في أعيننا والهواء فيها فيه تطفيف فيحول بين الأبصار وبين إدراك الأنوار كلها فتبصر الأعين الكواكب المنتثرة غير نيرة الأجرام كما يعلم قطعا إن الشمس هنا في ذاتها نيرة وأن الحجاب القمري هو الذي منع البصر أن يدركها أو يدرك نور القمر أو ما كان مكسوفا ولهذا في زمان كسوف شي‏ء منها في موضع يكون في موضع آخر أكثر من ذلك وفي موضع آخر لا يكون منه شي‏ء فلما اختلفت الأبصار في إدراك ذلك لاختلاف الأماكن علمنا قطعا إن ثم أمرا عارضا عرض في الطريق حال بين البصر وبينها أو بين نورها كالقمر يحول بينك وبين إدراك جرم الشمس وظل الأرض يحول بينك وبين نور القمر لا بينك وبين جرمه مثل ما حال القمر بينك وبين جرم الشمس وذلك بحسب ما يكون منك ويكون منه وهكذا سائر الكواكب ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ كما إن أَكْثَرَ النَّاسِ لا يُؤْمِنُونَ فإن ذلك الكسوف كله على اختلاف أنواعه خشوع من المكسوف عن تجل إلهي حصل له‏\n\n\n### [حدود جهنم بعد الحساب والدخول في الجنة]\n\n\nوحد جهنم بعد الفراغ من الحساب ودخول أهل الجنة الجنة من مقعر فلك الكواكب الثابتة إلى أسفل سافلين فهذا كله يزيد في جهنم مما هو الآن ليس مخلوقا فيها ولكن ذلك معد حتى يظهر إلا الأماكن التي قد عينها الله من الأرض فإنها ترجع إلى الجنة يوم القيامة مثل الروضة التي بين منبر رسول الله صلى الله عليه وسلم وبين قبره صلى الله عليه وسلم وكل مكان عينه الشارع وكل نهر فإن ذلك كله بصير إلى الجنة وما بقي فيعود نارا كله وهو من جهنم ولهذا كان يقول عبد الله بن عمر إذا رأى البحر يقول يا بحر متى تعود نارا وقال تعالى وإِذَا الْبِحارُ سُجِّرَتْ أي أججت نارا من سجرت التنور إذا أوقدته وكان ابن عمر يكره الوضوء بماء البحر ويقول التيمم أعجب إلي منه‏\n\n\n### [الرؤية الحقيقية للأشياء والحكم الصحيح عليها]\n\n\nولو كشف الله عن أبصار الخلق اليوم لرأوه يتأجج نارا ولكن الله يظهر ما يشاء ويخفى ما يشاء ليعلم أَنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ وأَنَّ الله قَدْ أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً وأكثر ما يجري هذا الأهل الورع فيرى الطعام الحرام صاحب الورع المحفوظ خنزيرا أو عذرة والشراب خمرا لا يشك فيما يراه ويراه جليسه قرصة خبز طيبة ويرى الشراب ماء عذبا فيا ليت شعري من هو صاحب الحس الصحيح من صاحب الخيال هل الذي أدرك الحكم الشرعي صورة أو هل الذي أدرك المحسوس في العادة على حاله‏\n\n\n### [مذهب المعتزلة في الحسن والقبح‏]\n\n\nوهذا مما يقوي مذهب المعتزلة في أن القبيح قبيح لنفسه والحسن حسن لنفسه وأن الإدراك الصحيح إنما هو لمن أدرك الشراب الحرام خمرا فلو لا أنه قبيح لنفسه ما صح هذا الكشف لصاحبه ولو كان فعله عين تعلق الخطاب بالحرمة والقبح ما ظهر ذلك الطعام خنزيرا فإن الفعل ما وقع من المكلف فإن الله أظهر له صورته وأنه قبيح حتى لا يقدم على أكله وهذا بعينه يتصور فيمن يدركه طعاما على حاله في العادة ولكن هذا أحق في الشرع فعلم قطعا إن الذي يراه طعاما على عادته قد حيل بينه وبين حقيقة حكم الشرع فيه بالقبح ولو كان الشي‏ء قبيحا بالقبح الوضعي لم يصدق قول الشارع في الإخبار عنه إنه قبيح أو حسن فإنه خبر بالشي‏ء على خلاف ما هو عليه فإن الأحكام‏\nأخبار بلا شك عند كل عاقل عارف بالكلام فإن الله أخبرنا أن هذا حرام وهذا حلال ولذا قال تعالى في ذم من قال عن الله ما لم يقل ولا تَقُولُوا لِما تَصِفُ أَلْسِنَتُكُمُ الْكَذِبَ هذا حَلالٌ وهذا حَرامٌ لِتَفْتَرُوا عَلَى الله الْكَذِبَ فإنه ألحق الحكم بالخبر لأنه خبر بلا شك إلا أنه ليس في قوة البشر في أكثر الأشياء إدراك قبح الأشياء ولا حسنها فإذا عرفنا الحق بها عرفناها ومنها ما يدرك قبحه عقلا في عرفنا مثل كالكذب وكفر المنعم وحسنه عقلا مثل الصدق وشكر المنعم وكون الإثم يتعلق ببعض أنواع الصدق والأجر يتعلق ببعض أنواع الكذب فذلك لله يعطي الأجر على ما شاءه من قبح وحسن ولا يدل ذلك على حسن الشي‏ء ولا قبحه كالكذب في نجاة مؤمن من هلاك يؤجر عليه الإنسان وإن كان الكذب قبيحا في ذاته والصدق كالغيبة يأثم بها الإنسان وإن كان الصدق حسنا في ذاته فذاك أمر شرعي يعطي فضله من شاء ويمنعه من شاء كما قال يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ والله ذُو الْفَضْلِ الْعَظِيمِ‏\n\n\n### [مرتبة النفس والتنفس وارتباط الموت بالحياة]\n\n\nواعلم أن أشد الخلق عذابا في النار إبليس الذي سن الشرك وكل مخالفة وسبب ذلك أنه مخلوق من النار فعذابه بما خلق منه أ لا ترى النفس به تكون حياة الجسم الحساس فإذا منع بالشنق أو الخنق خروج ذلك النفس انعكس راجعا إلى القلب فأحرقه من ساعته فهلك لحينه فبالنفس كانت حياته وبه كان هلاكه وهلاكه على الحقيقة بالنفس من كونه متنفسا لا من كونه ذا نفس ولا من كونه متنفسا فقط بل من كونه يجذب بالقوة الجاذبة نفس الهواء البارد إلى قلبه ويخرج بالقوة الدافعة النفس الحار المحرق آمن قلبه فسبب هذه الأحوال بها تكون حياته‏\n\n\n### [أشد الناس عذابا في النار]\n\n\nفإن الذي يرمى في النار هو متنفس ولكن لا يخلو من أحد الوجهين إما إنه لا يتنفس في النار فتكون حالته حالة المشنوق الذي يخنق بالحبل فيقتله نفسه وإما أن يتنفس فيجذب بالقوة الجاذبة هواء ناريا محرقا إذا وصل إلى قلبه أحرقه فلهذا قلنا في سبب الحياة هذه الأمور كلها فعذاب إبليس في جهنم بما فيها من الزمهرير فإنه يقابل النار الذي هو أصل نشأة إبليس فيكون عذابه بالزمهرير وبما هو نار مركبة فيه من ركن الهواء والماء والتراب فلا بد أن يتعذب بالنار على قدر مخصوص وعامة عذابه بما يناقض ما هو الغالب عليه في أصل خلقه والنار ناران نار حسية وهي المسلطة على إحساسه وحيوانيته وظاهر جسمه وباطنه ونار معنوية وهي التي تطلع على الأفئدة وبها يتعذب روحه المدبر لهيكله الذي أمر فعصى فمخالفته عذبته وهي عين جهله بمن استكبر عليه‏\n\n\n### [يوم التغابن: يوم عذاب النفوس‏]\n\n\nفلا عذاب على الأرواح أشد من الجهل فإنه غبن كله ولهذا سمي يَوْمُ التَّغابُنِ يريد يوم عذاب النفوس فيقول يا ويلتا عَلى‏ ما فَرَّطْتُ وهو يَوْمَ الْحَسْرَةِ يقول يوم الكشف من حسرت عن الشي‏ء إذا كشفت عنه فكأنه يقول يا ليتني حسرت عن هذا الأمر في الدنيا فأكون على بصيرة من أمري فيغتبن في نفسه والتغابن يدرك في ذلك اليوم الكل الطائع والعاصي فالطائع يقول يا ليتني بذلت جهدي ووفيت حق استطاعتي وتدبرت كلام ربي فعملت بمقتضاه مع كونه سعيدا والمخالف يقول يا ليتني لم أخالف ربي فيما أمرني به ونهاني ف ذلِكَ يَوْمُ التَّغابُنِ وسيأتي هذا في باب يوم القيامة إن شاء الله‏\n\n\n### [جهنم: آلام أهلها صفة الغضب الإلهي ووجودها محل التنزل الرحماني‏]\n\n\nولما أعلمناك بمرتبة النفس والتنفس إنما جئنا به لتعلم إن جهنم لما اختص بآلام أهلها صفة الغضب الإلهي واختص بوجودها التنزل الرحماني الإلهي وجاء في الخبر الصحيح نفس الرحمن مشعرا بصفة الغضب‏\n\n\nفكان التنفس ملحقا صفة الغضب بمن حل به ولهذا لما أتى نفس الرحمن من قبل اليمن حل الغضب الإلهي بالكفار بالقتل والسيف الذي وقعت بهم الأنصار فنفس الله بذلك عن دينه ونبيه صلى الله عليه وسلم فإن ذا الغضب إذا وجد على من يرسل غضبه نفس عنه ما يجده من أ لم الغضب وأكمل الصورة في محمد صلى الله عليه وسلم فقام به على الكفار لأجل ردهم كلمة الله صفة الغضب فنفس الرحمن عنه بما أمره به من السيف ونفس عنه بأصحابه وأنصاره فوجد الراحة فإنه وجد حيث يرسل غضبه فافهم من هذا آلام أهل النار والصورة الحجابية المحمدية على الغضب الإلهي على أعداء الله وإن الآلام أرسلت على الأعداء فقامت بهم ونفس الله عن دينه وهو أمره وكلامه وهو عين علمه في خلقه وعلمه ذاته جل وتعالى وقد بينا لك أمر جهنم من حيث ما هي دار فلنبين إن شاء الله في الباب الذي يلي هذا الباب مراتب أهل النار\n\n\n### [دركات جهنم المائة وزبانيتها]\n\n\nثم اعلم أن الله قد جعل فيها مائة درك في مقابلة درج الجنة ولكل درك قوم مخصوصون لهم من الغضب الإلهي الحال بهم آلام مخصوصة وأن المتولي عذابهم من الولاة الذين ذكرناهم في الباب قبل هذا من هذا الكتاب القائم والإقليد والحامد\nوالنائب والسادن والجابر فهؤلاء الأملاك من الولاة هم الذين يرسلون عليهم العذاب بإذن الله تعالى ومالك هو الخازن وأما بقية الولاة مع هؤلاء الذين ذكرناهم وهم الحائر والسائق والماتح والعادل والدائم والحافظ فإن جميعهم يكونون مع أهل الجنان وخازن الجنان رضوان وإمدادهم إلى أهل النار مثل إمدادهم إلى أهل الجنة فإنهم يمدونهم بحقائقهم وحقائقهم لا تختلف فيقبل كل طائفة من أهل الدارين منهم بحسب ما تعطيهم نشأتهم فيقع العذاب بما به يقع النعيم من أجل المحل كما قلنا في المبرود إنه يتنعم بحر الشمس والمحرور يتعذب بحر الشمس فنفس ما وقع به النعيم به عينه وقع به الألم عند الآخر فالله ينشئنا نشأة النعماء كما قال تعالى في حق الأبرار تَعْرِفُ في وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ أي هم في خلقهم على هذه الصفة ونشأة أهل النار تخالف نشأة أهل الجنان فإن نشأة الجنة إنما هو من الحق سبحانه على أيدي الولاة خاصة ونشأة أهل النار على أيدي الولاة والحجاب والنقباء والسدية على كثرتهم فإنه لا يحصي عددهم إلا الله ولكل ملك منهم في هذه النشأة الدنياوية ونشأة النار ونشأة أهلها حكم سخره الله في ذلك فهم كالفعلة في المملكة وإنشاء الدار المبنية وسيأتي إن شاء الله ذكر الجنة وما فيها والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Sixty-One: Concerning the Knowledge of Hell, the Most Severely Tormented of Created Beings Within It, and the Knowledge of a Portion of the Higher World\n\n> Indeed, the heaven returns to being a closed mass (رتقًا) just as it was,\n> And its stars lose their light.\n> This is so that the Resident upon its earth may render justice to you,\n> Upon whom its pillar and structure are established.\n> The most intensely afflicted of God’s creation therein are those\n> Whose creation was from it, and thus its heaven [is their affliction].\n> It clothes him in the garment of its fire, derived from its light,\n> For that reason, his affliction is magnified in the souls.\n\n### [Jahannam: The Prison of the Negators and the Mat of the Disbelievers]\n\nKnow—may Allah protect us and you—that Hell [جهنم] is one of the greatest created things. It is the prison of Allah in the Hereafter, wherein the Negators [المعطلة] and the polytheists are imprisoned. For these two groups, it is a permanent abode, as well as for the disbelievers, the hypocrites, and those believers guilty of major sins. The Exalted said: <<And We have made Hell [جهنم] a mat [حَصِيراً] for the disbelievers.>> Then, those whom we mentioned are brought forth by intercession, and by Divine favor [الامتنان الإلهي] for those concerning whom the Divine text has come.\n\nHell [جهنم] was named *Jahannam* due to the depth of its bottom; a well is called *Jahnam* if it is deep-bottomed. It contains both intense heat (*harūr*) and extreme cold (*zamharīr*). Thus, it holds coldness at its utmost degree and heat at its utmost degree. Between its top and its bottom is one hundred and seventy-five years [of travel].\n\n### [Has Hell been created or not yet?]\n\nPeople have differed concerning its creation: whether it has been created yet or not. The dispute regarding it is well-known, and each of the two parties argues for its position with what it considers proof. Likewise, they have differed concerning Paradise.\n\nAs for us and our companions, the People of Unveiling [الكشف] and Direct Knowledge [التعريف], both [Hell and Heaven] are created yet uncreated. As for our statement that it is created, it is like a man who intends to build a house and erects all its encompassing walls first. It is then said that he has built a house. But when one enters it, he sees only a surrounding wall enclosing an open space and a courtyard. Only after that does he construct its rooms according to the needs of its inhabitants—rooms, chambers, cellars, abysses, stores, and whatever else the inhabitant wishes to place therein of the instruments used for the torment of those who enter it.\n\n### [The Heat and Fuel of Hell]\n\nIt is an abode whose heat is burning air. It has no embers except the children of Adam and the stones taken as deities, and the Jinn are its flame. The Exalted said: <<Whose fuel is men and stones.>> And He said: <<Indeed, you and what you worship other than Allah are the fuel [حَصَبُ] of Hell [جهنم].>> And the Exalted said: <<So they will be hurled into it headlong, they and the deviators [الْغاوُونَ], and the armies of Iblis, all together.>> The instruments [of torment] are created therein corresponding to the creation of the deeds of the Jinn and humans who enter it.\n\n### [Allah Created Hell under the Ascendant of Taurus]\n\nAllah brought it into existence under the ascendant of Taurus. For this reason, its creation, in form, is exactly the form of a buffalo. This is what we rely upon. In this form, Abu al-Hakam ibn Barrajān saw it in his unveiling [كشفه]. It has appeared to some of the People of Unveiling [أهل الكشف] in the form of a serpent, leading them to imagine that this is the form in which Allah created it, such as Abu al-Qasim ibn Qasī and his likes.\n\nWhen Allah the Exalted created it, Saturn was in Taurus, and the Sun and Mars [الأحمر] were in Sagittarius, and the rest of the planets [الدراري] were in Capricorn.\n\nAllah the Exalted created it from the Theophany [تجلي] of His saying in the Hadith Qudsi reported by Muslim: \"I was hungry, and you did not feed Me; I was thirsty, and you did not give Me drink; I was sick, and you did not visit Me.\"\n\nThis is the greatest descent [نزول] The Real [الحق] made toward His servants in kindness to them. From this Reality [حقيقة] Hell [جهنم] was created—may Allah grant us and you refuge from it. For this reason, it dominates the tyrants and crushes the arrogant.\n\n### [The Pains of Hell are from the Divine Attribute of Wrath Descending upon its Inhabitants]\n\nAll the pains created therein, which those who enter it experience, are from the Attribute of Divine Wrath [الغضب الإلهي]. This only occurs when the creatures—Jinn and humans—enter it. But if none of its inhabitants are present, there is no pain in Hell itself, nor in its angels. Rather, it and its guardians [زبانيتها] are immersed in the Mercy of Allah, enjoying themselves, glorifying Him, <<without slackening.>>\n\nThe Exalted says: <<And do not transgress therein, lest My Wrath descend upon you. And upon whomever My Wrath descends, he has certainly fallen [هَوى].>> Meaning, My Wrath descends upon you. Thus, He attributed the Wrath to Himself, and when it descends upon them, they become its locus. Hell [جهنم] is merely a place for them, and they are the ones who descend into it, and they are the locus of the Wrath, which descends upon them. For Wrath here is the very essence of pain.\n\nWhoever lacks gnosis [معرفة] among those who claim our path, and seeks to understand the matter through analogy, force, and correspondence in the Attributes, says that Hell [جهنم] is created from Divine Compulsion (*Qahr*) and that the Name The Compeller (*al-Qāhir*) is its Lord and the One who manifests in it. If the matter were as he stated, that would preoccupy it with itself, distracting it from the purpose for which it was created: dominating the tyrants. It would not be able to say: <<Is there any more?>> nor would it be able to say: \"Some of me has consumed others.\"\n\nThe descent of The Real [الحق] upon it with His Mercy, <<which encompasses all things,>> and His tenderness, expanded its capacity for claiming and dominating those who tyrannized against the One who bestowed this kindness upon it. All that it does to the disbelievers is an act of gratitude toward the Benefactor, since He bestowed favor upon it. It knows nothing of Him, the Glorified, except His Absolute Grace, which is not tainted by its opposite. Thus, people are mistaken concerning its creation.\n\n### [The Hypocrites are in the Lowest Depth of Hell]\n\nOne of the most wondrous things we have narrated from the Messenger of Allah (may Allah bless him and grant him peace) is that he was sitting with his companions in the mosque when they heard a tremendous crash. They were startled. The Messenger of Allah (may Allah bless him and grant him peace) asked: \"Do you know what this crash is?\" They replied: \"Allah and His Messenger know best.\" He said: \"A stone was thrown from the top of Hell [جهنم] seventy years ago, and it has just now reached its bottom.\"\n\nThe crash was the sound of its arrival at the bottom and its fall therein. No sooner had he finished speaking (may Allah bless him and grant him peace) than a cry arose from the house of a hypocrite who had just died, and his age was seventy years.\n\nThe Messenger of Allah (may Allah bless him and grant him peace) said: \"Allah is Greater [Allahu Akbar].\" The scholars among the Companions knew that this stone was that hypocrite, and that since Allah created him, he had been falling into the Fire of Hell [جهنم], and when he reached the age of seventy, he arrived at its bottom.\n\nThe Exalted said: <<Indeed, the hypocrites are in the lowest depth [الدرك الْأَسْفَلِ] of the Fire.>> Their hearing of that crash was something Allah made them hear so they might reflect. Look at how wondrous the speech of Prophethood is, how subtle its instruction, how beautiful its indication, and how sweet his speech was (may Allah bless him and grant him peace).\n\n### [The Dispute of the People of the Fire in the Fire]\n\nI asked Allah to manifest to me whatever He willed concerning its affair, and He manifested to me the state of their disputation, which is His saying: <<Indeed, that is the truth—the disputation of the people of the Fire.>> And His saying: <<They will say while they dispute therein, \"By Allah, we were certainly in manifest error [ضَلالٍ مُبِينٍ]—when we equated you with the Lord of the worlds. And none misled us except the criminals [الْمُجْرِمُونَ].\">> These criminals are the people of the Fire who are its permanent inhabitants, concerning whom Allah says: <<And stand apart today, O criminals [الْمُجْرِمُونَ]!>> By \"criminals,\" He means the people of the Fire who inhabit it and will not leave it. They are distinguished from those who will leave it through the intercession of intercessors and the prior Divine Providence [العناية الإلهية] granted to the monotheists.\n\n### [Perfect Mercy in Receiving from Prophethood and Adhering to the Book and the Sunnah]\n\nThis was manifested to me at one time concerning it. I likened their disputation therein only to the disputation of the people of disagreement in their debates when one of them presents his evidence. When I saw that, I remembered the state upon which Allah informed me, and I saw that all Mercy lies in submission, receiving from Prophethood, and adhering strictly to the Book and the Sunnah.\n\nPeople have been blind to his saying (may Allah bless him and grant him peace): \"There should be no dispute in the presence of a Prophet.\"\n\nThe presence of his Hadith (may Allah bless him and grant him peace) is like his physical presence. When it is cited, there should be no dispute, nor should the listener raise his voice when narrating the Prophetic Hadith, for Allah says: <<Do not raise your voices above the voice of the Prophet.>> For the People of Allah [أهل الله], there is no difference between the Prophet's voice and the narration of his saying. We must only prepare ourselves to accept what the narrator brings forth of the Prophetic speech without argument, whether that Hadith is an answer to a question or an initiation of speech. Adhering to his words concerning an issue or a calamity is obligatory.\n\nWhenever it is said, \"Allah said,\" or \"The Messenger of Allah (may Allah bless him and grant him peace) said,\" it must be accepted, and the listener must show reverence and not raise his voice above the voice of the narrator when he quotes Allah or narrates the Hadith from the Messenger of Allah (may Allah bless him and grant him peace). Allah the Exalted says: <<Grant him protection until he hears the Word of Allah.>> And none recited it except the Messenger of Allah (may Allah bless him and grant him peace), and the listener heard it only from him. Furthermore, if the listener interrupts him while he is speaking, he is not truly listening. For among the manners with which Allah disciplined His Prophet (may Allah bless him and grant him peace) is His saying: <<And do not hasten with the Qur'an before its revelation is concluded to you.>>\n\nAnd Allah says: <<Do not raise your voices above the voice of the Prophet, nor speak loudly to him as you speak loudly to one another,>> and He warned against this by the nullification of deeds without the person realizing it. For he imagines, in his rebuttal and argument, that he is defending the religion of Allah. This is part of the subtle planning (*Makr*) of Allah, concerning which He said: <<We will progressively lead them [to destruction] from where they do not know,>> and He said: <<And We planned a plan, while they perceived not.>>\n\nThe wise believer who advises himself, when he hears someone say, \"Allah the Exalted said,\" or \"The Messenger of Allah (may Allah bless him and grant him peace) said,\" should listen attentively, pay heed, show reverence, and seek to understand what Allah said or what His Messenger (may Allah bless him and grant him peace) said. Allah says: <<And when the Qur'an is recited, listen to it and pay attention [أَنْصِتُوا], that you may receive mercy.>> He placed hope (*tarajjī*) alongside this description and did not guarantee Mercy absolutely. What, then, is the state of one who argues, raises his voice, and interrupts the reciter? I will cite the Prophetic Hadith in the discussion, hoping that the Divine hope (*tarajjī*) becomes obligatory, as scholars view it.\n\n### [Unseen Visions and Scientific Discoveries]\n\nWhen I witnessed this place, I saw wonders. In this vision, I saw water resting upon air, which is one of the most wondrous things concerning the filling of spaces [الأحياز]: that two substances [جوهرين] cannot occupy one space [حيز], and that space is certainly occupied.\n\nIn this vision, I learned the invalidity of spontaneous generation [التوالد], that the Mover of all things is Allah the Exalted, and that the cause has absolutely no effect on the action.\n\nIn this vision, I learned that the subtler is stronger than the denser. Air is undoubtedly subtler than water, and it prevented the water, which did not resist it in strength, from descending. I saw myself in the air with water above me, and the air prevented it from descending to the earth.\n\nIn this vision, I learned many abundant sciences.\n\nIn this vision, I saw, concerning the depths [دركات] of the people of the Fire—in its capacity as Hell [جهنم], not merely as fire—what Allah willed to reveal to me. I saw a place therein called *al-Maẓlima* (The Place of Wrongdoing). I descended about five degrees [أدراج] into it and saw its abysses. Then I was thrust upward into the water and passed through it. I saw wonders and learned about the states of their disputation while they argue in the Blazing Fire (*al-Jaḥīm*): that the disputation itself is their torment in that state, and that their torment in Hell [جهنم] is not *from* Hell. Rather, Hell is their dwelling place and their prison, and Allah creates the pains within them whenever He wills. Thus, their torment is from Allah, and they are its locus.\n\n### [The Seven Gates of Hell and its Guards]\n\nAllah created seven gates for Hell [جهنم]. For each gate, a portion of the world and a portion of the torment are allotted. These seven gates are open. There is an eighth gate, which is closed and will not be opened: the Gate of the Veil [الحجاب] from the Vision of Allah the Exalted.\n\nOver each gate is an angel from the angels of the seven heavens. I knew their names there, but they have escaped my memory, except for Ismāʿīl, who remains in my recollection.\n\n### [The Planets in Hell are Dark in Substance]\n\nAs for all the planets [الكواكب], they are in Hell [جهنم], dark in substance [مظلمة الأجرام] and mighty in creation, as are the Sun and the Moon. Their rising and setting are perpetual in Hell. Its sun is *shāriqa* (rising) but not *mushriqa* (illuminating).\n\nThe formations resulting from their movement correspond to the beings appropriate for that abode and the changes in forms through transformation and scattering. For this reason, the Exalted said: <<The Fire, they are exposed to it morning and evening.>> This state is continuous. The exposure occurs in the Isthmus [البرزخ], and the entry occurs in the Hereafter.\n\nThe essences of the planets therein have the exact form of an eclipse as we know it, except that the measure of those movements in that abode differs from their measure today. Their eclipse is one that does not clear up; it is an eclipse in their very essence, not merely in our eyes.\n\nThe air therein contains a deficiency (*taṭfīf*), which intervenes between the eyes and the perception of all lights. Thus, the eyes perceive the scattered planets as bodies that are not luminous, just as it is known with certainty that the Sun here is luminous in its essence, and that the lunar veil [الحجاب القمري] is what prevents sight from perceiving it, or from perceiving the light of the Moon, or whatever is eclipsed. For this reason, when something is eclipsed in one place, it may be more eclipsed in another place, and in yet another place, there may be no eclipse at all. Since perceptions of this phenomenon differ due to the difference in locations, we know with certainty that there is an accidental matter that occurs along the path, intervening between the sight and the body, or between the sight and its light. For example, the Moon intervenes between you and the perception of the Sun's body, and the Earth's shadow intervenes between you and the Moon's light, but not between you and its body, just as the Moon intervened between you and the Sun's body. This occurs according to what proceeds from you and what proceeds from it. The same applies to the rest of the planets, <<but most people do not know,>> just as <<most people do not believe.>> For all those eclipses, despite their different types, are an act of humility (*khushūʿ*) on the part of the eclipsed body due to a Divine Theophany [تجلي إلهي] that has occurred to it.\n\n### [The Boundaries of Hell after the Reckoning and Entry into Paradise]\n\nThe boundary of Hell [جهنم], after the completion of the Reckoning and the entry of the people of Paradise into Paradise, extends from the concave surface of the sphere of the fixed stars down to the lowest of the low [أسفل سافلين]. All of this adds to Hell what is not yet created within it now, but it is prepared until it manifests. This excludes the places on Earth that Allah has designated, for they will return to Paradise on the Day of Resurrection, such as the Garden (*Rawḍa*) between the pulpit of the Messenger of Allah (may Allah bless him and grant him peace) and his grave (may Allah bless him and grant him peace), and every place designated by the Lawgiver, and every river. All of that will become Paradise, and what remains will entirely revert to Fire, and it is part of Hell.\n\nFor this reason, ʿAbd Allāh ibn ʿUmar, when he saw the sea, would say: \"O sea, when will you return to Fire?\" And the Exalted said: <<And when the seas are set ablaze [سُجِّرَتْ].>> Meaning, they are kindled into fire, derived from *sajjartu al-tannūr* (I kindled the oven). Ibn ʿUmar disliked performing ablution with seawater and would say: \"Dry ablution (*tayammum*) is more pleasing to me than it.\"\n\n### [The True Vision of Things and the Correct Judgment upon Them]\n\nIf Allah were to unveil the sight of creation today, they would see it blazing with fire. But Allah manifests what He wills and conceals what He wills, so that it may be known <<that Allah is over all things competent>> and <<that Allah has encompassed all things in knowledge [علماً].>>\n\nThis mostly occurs to the People of Piety (*Ahl al-Waraʿ*). The protected pious person sees unlawful food as pork or excrement, and unlawful drink as wine. He does not doubt what he sees, while his companion sees it as a good loaf of bread and the drink as fresh water. I wish I knew: who possesses the sound sense, and who possesses the imagination [الخيال]? Is it the one who perceived the legal ruling in the form [of the object], or the one who perceived the sensible object in its customary state?\n\n### [The Doctrine of the Mu'tazila concerning Goodness and Ugliness]\n\nThis strengthens the doctrine of the Mu'tazila that the ugly is ugly in itself, and the good is good in itself, and that the correct perception belongs only to the one who perceived the unlawful drink as wine. If it were not ugly in itself, this unveiling [كشف] would not have been valid for its possessor.\n\nIf its action were merely the attachment of the legal address to prohibition and ugliness, that food would not have appeared as pork. For the action did not originate from the legally responsible person; rather, Allah revealed its form to him and that it is ugly, so that he would not proceed to eat it.\n\nThis same thing is conceivable for the one who perceives it as food in its customary state, but the former perception is more truthful according to the Law. Thus, it is known with certainty that the one who sees it as food in its customary state has been veiled from the reality of the legal ruling concerning its ugliness.\n\nIf a thing were ugly merely by conventional ugliness (*al-qubḥ al-waḍʿī*), the statement of the Lawgiver informing us that it is ugly or good would not be truthful, for it would be an announcement about the thing contrary to its reality. For legal rulings are undoubtedly announcements, according to every rational person knowledgeable in theology.\n\nFor Allah informed us that this is forbidden and this is lawful. Therefore, the Exalted said, in condemnation of those who spoke about Allah what He did not say: <<And do not say, concerning that which your tongues describe falsely, 'This is lawful and this is forbidden,' in order to forge a lie against Allah.>>\n\nHe attached the ruling to the announcement because it is undoubtedly an announcement. However, it is not within the power of humans to perceive the ugliness or goodness of most things. When we know The Real [الحق] through them, we know them. Among them are things whose ugliness is rationally perceived in our custom, such as lying and ingratitude toward the Benefactor, and whose goodness is rationally perceived, such as truthfulness and gratitude toward the Benefactor. The fact that sin is attached to some types of truthfulness and reward is attached to some types of lying—that belongs to Allah. He grants reward for whatever ugliness or goodness He wills. This does not indicate the inherent goodness or ugliness of the thing itself. For instance, lying to save a believer from destruction earns a person reward, even though lying is ugly in itself. And truthfulness, such as backbiting (*ghība*), earns a person sin, even though truthfulness is good in itself. That is a legal matter [أمر شرعي]; He grants His favor to whom He wills and withholds it from whom He wills, as He said: <<He selects for His Mercy whom He wills. And Allah is the Possessor of great bounty.>>\n\n### [The Level of the Breath, Respiration, and the Connection of Death to Life]\n\nKnow that the most intensely tormented of creation in the Fire is Iblis, who instituted polytheism and every disobedience. The reason for this is that he is created from Fire, so his torment is by that from which he was created. Do you not see that the life of the sentient body is by the breath [النفس]? If the exit of that breath is prevented by hanging or strangulation, it reverses back to the heart and burns it instantly, causing immediate destruction. Thus, his life was by the breath, and his destruction was by it. His destruction, in reality, is by the breath [النفس] due to his being a breather (*mutanaffis*), not merely due to his possessing a soul (*dhā nafs*), nor merely due to his being a breather. Rather, it is because he draws the breath [نفس] of cool air into his heart by the attractive force and expels the hot, burning breath by the repulsive force, thereby securing his heart. The cause of his life is these states.\n\n### [The Most Severely Tormented People in the Fire]\n\nIndeed, the one who is thrown into the Fire is a breather, but he is subject to one of two possibilities: either he does not breathe in the Fire, in which case his state is that of the hanged person who is strangled by the rope, and his own breath kills him; or he does breathe, and by the attractive force, he draws in burning, fiery air, which, upon reaching his heart, burns it. For this reason, we mentioned all these matters concerning the cause of life.\n\nThe torment of Iblis in Hell [جهنم] includes the extreme cold (*zamharīr*) found therein, for it opposes the Fire which is the origin of Iblis's creation. Thus, his torment will be by the extreme cold, and also by the fire compounded within him from the elements of air, water, and earth. He must necessarily be tormented by fire to a specific degree, but his general torment is by that which contradicts what predominates in his original creation.\n\nThe Fire is two fires: a sensory fire, which dominates his senses, his animality, and the exterior and interior of his body; and a spiritual fire, which <<ascends to the hearts>> [تطلع على الأفئدة]. By this, his spirit, which governs his structure, is tormented—the spirit that was commanded and disobeyed. His disobedience tormented him, and it is the very essence of his ignorance concerning the One against whom he showed arrogance.\n\n### [The Day of Mutual Loss: The Day of the Torment of Souls]\n\nThere is no torment upon the spirits more severe than ignorance, for it is entirely loss (*ghabn*). For this reason, it is called <<The Day of Mutual Loss [يَوْمُ التَّغابُنِ]>>—meaning the day of the torment of the souls—where one says: <<Woe to me for what I neglected!>> It is also <<The Day of Regret [يَوْمَ الْحَسْرَةِ]>>. He means the day of unveiling, derived from *ḥasartu ʿan al-shayʾ* (I unveiled the thing) when you uncovered it. It is as if he says: \"I wish I had unveiled this matter in the world, so that I would have been clear about my affair.\" Thus, he suffers loss in himself.\n\nMutual loss [التغابن] is experienced by everyone on that Day, the obedient and the disobedient. The obedient one says: \"I wish I had exerted my utmost effort, fulfilled the right of my capacity, and contemplated the speech of my Lord, so that I might have acted according to its requirement,\" despite his being happy. The transgressor says: \"I wish I had not disobeyed my Lord in what He commanded and forbade me.\" That is <<The Day of Mutual Loss [يَوْمُ التَّغابُنِ].>> This will come in the chapter on the Day of Resurrection, if Allah wills.\n\n### [Hell: The Pains of its People are the Attribute of Divine Wrath, and its Existence is the Locus of the Merciful Descent]\n\nWhen we informed you of the level of the breath [النفس] and respiration [التنفس], we did so only so that you might know that Hell [جهنم] is characterized by the pains of its people being the Attribute of Divine Wrath [الغضب الإلهي], while its existence is characterized by the Divine Merciful Descent [التنزل الرحماني الإلهي]. And it came in the sound Hadith that the Breath of the Merciful [نفس الرحمن] indicates the Attribute of Wrath.\n\nThus, respiration [التنفس] attaches the Attribute of Wrath to the one upon whom it descends. For this reason, when the Breath of the Merciful [نفس الرحمن] came from the direction of Yemen, Divine Wrath descended upon the disbelievers through the killing and the sword wielded against them by the Ansar (Helpers). By this, Allah relieved His religion and His Prophet (may Allah bless him and grant him peace).\n\nFor the one who is angry, when he finds someone upon whom to unleash his wrath, he is relieved of the pain of that anger. The image was perfected in Muhammad (may Allah bless him and grant him peace), and he stood against the disbelievers because they rejected the Word of Allah—the Attribute of Wrath. So, the Merciful relieved him by commanding him with the sword and relieved him through his companions and helpers, and he found comfort because he found a place to unleash his wrath. Understand from this the pains of the people of the Fire and the Muhammadan Veiling Form [الصورة الحجابية المحمدية] over the Divine Wrath toward the enemies of Allah. The pains were sent upon the enemies and established themselves in them, and Allah relieved His religion—which is His command and His speech, and which is the very essence of His Knowledge in His creation, and His Knowledge is His Essence, Glorified and Exalted is He. We have explained to you the matter of Hell [جهنم] insofar as it is an abode. If Allah wills, we shall explain in the chapter following this one the levels [مراتب] of the people of the Fire.\n\n### [The Hundred Depths of Hell and its Guardians]\n\nThen know that Allah has placed within it one hundred depths [درك] corresponding to the degrees (*daraj*) of Paradise. For every depth, there are specific people upon whom specific pains descend from the Divine Wrath that settles upon them.\n\nAnd those responsible for their torment are the Governors (*al-Wulāt*) whom we mentioned in the chapter preceding this one in this book: The Established (*al-Qāʾim*), The Key (*al-Iqlīd*), The Praiser (*al-Ḥāmid*), The Deputy (*al-Nāʾib*), The Custodian (*al-Sādin*), and The Restorer (*al-Jābir*). These angels, who are Governors, are the ones who send the torment upon them by the permission of Allah the Exalted.\n\nAnd Mālik is the Treasurer. As for the rest of the Governors, along with those we mentioned—The Perplexed (*al-Ḥāʾir*), The Driver (*al-Sāʾiq*), The Drawer (*al-Mātiḥ*), The Just (*al-ʿĀdil*), The Perpetual (*al-Dāʾim*), and The Preserver (*al-Ḥāfiẓ*)—all of them will be with the people of the Gardens, and the Treasurer of the Gardens is Riḍwān.\n\nTheir spiritual support (*imdād*) to the people of the Fire is the same as their support to the people of Paradise, for they support them with their Realities [حقائقهم], and their Realities do not differ. Each group among the inhabitants of the two abodes receives from them according to what their nature (*nashʾa*) grants them. Thus, the torment occurs by the very thing through which bliss occurs, due to the locus.\n\nJust as we said concerning the one suffering from cold: he finds bliss in the heat of the sun, while the one suffering from heat is tormented by the heat of the sun. The very thing by which bliss occurred is the exact thing by which pain occurred for the other.\n\nSo, Allah creates us in the nature of bliss, as the Exalted said concerning the righteous: <<You will recognize in their faces the radiance of bliss [نَضْرَةَ النَّعِيمِ].>> Meaning, they are upon this attribute in their creation.\n\nThe nature of the people of the Fire differs from the nature of the people of the Gardens. The nature of Paradise is solely from The Real [الحق], the Glorified, through the hands of the Governors [الولاة]. The nature of the people of the Fire is through the hands of the Governors, the Veils (*al-Ḥujjāb*), the Chiefs (*al-Nuqabāʾ*), and the Custodians (*al-Sadana*), despite their great number—only Allah can count them. Every angel among them has a ruling in this worldly nature, the nature of the Fire, and the nature of its people, for which Allah has subjugated him. They are like the workers in the kingdom and the construction of the built abode. The mention of Paradise and what is in it will come, if Allah wills. <<And Allah speaks the Truth, and He guides to the way.>>",
    "ur": "باب اکسٹھواں: جہنم کی معرفت، اس میں سب سے زیادہ عذاب پانے والی مخلوقات کی معرفت، اور عالم علوی کے بعض حصوں کی معرفت کے بیان میں۔\n\nبے شک آسمان پھر سے بند ہو جائے گا جیسا کہ وہ پہلے تھا، اور اس کے ستاروں کی روشنی زائل ہو جائے گی۔\nیہ اس لیے ہوگا تاکہ وہ جو اس (زمین) پر مقیم ہے، تمہارے ساتھ انصاف کرے، اور اسی پر اس (زمین) کی بنیاد اور عمارت قائم ہے۔\nپس اللہ کی مخلوق میں سب سے زیادہ تکلیف میں وہ ہوگا جس کی تخلیق اس (آسمان) سے ہوئی، تو وہ اس کا آسمان ہے۔\nاس کا آسمان اسے اپنی آگ کا لباس پہنائے گا، اسی لیے نفوس میں اس کی آزمائش عظیم ہوگی۔\n\n### [جہنم معطلہ کا قید خانہ اور کافروں کا بستر]\n\nجان لو، اللہ ہمیں اور تمہیں محفوظ رکھے، کہ جہنم عظیم ترین مخلوقات میں سے ہے اور آخرت میں اللہ کا قید خانہ ہے۔ اس میں معطلہ (المعطلة) اور مشرکوں کو قید کیا جائے گا۔ یہ ان دونوں گروہوں کے لیے مستقل ٹھکانہ ہے، نیز کافروں، منافقوں اور مومنوں میں سے کبیرہ گناہوں کے مرتکب افراد کے لیے بھی۔ اللہ تعالیٰ فرماتا ہے: وَجَعَلْنَا جَهَنَّمَ لِلْكَافِرِينَ حَصِيرًا (اور ہم نے جہنم کو کافروں کے لیے قید خانہ بنا دیا ہے)۔ پھر ان لوگوں کو شفاعت (الشفاعة) کے ذریعے یا عنایت الٰہی (الامتنان الإلهي) سے نکالا جائے گا جن کے بارے میں الٰہی نص آئی ہے۔ جہنم کو جہنم اس لیے کہا گیا کہ اس کی گہرائی بہت زیادہ ہے۔ کہا جاتا ہے: \"بئر جہنام\" جب کنواں گہرا ہو۔ یہ حرارت (حرور) اور شدید سردی (زمہریر) دونوں پر مشتمل ہے۔ پس اس میں سردی اپنی انتہا پر اور حرارت اپنی انتہا پر ہوگی۔ اس کے بالائی حصے اور اس کی تہہ کے درمیان ایک سو پچھتر (۱۷۵) سال کی مسافت ہے۔\n\n### [کیا جہنم پیدا ہو چکی ہے یا ابھی نہیں؟]\n\nلوگوں نے اس کی تخلیق کے بارے میں اختلاف کیا ہے کہ آیا یہ پیدا ہو چکی ہے یا ابھی نہیں۔ یہ اختلاف مشہور ہے۔ دونوں گروہوں میں سے ہر ایک اپنے موقف کی تائید میں وہ دلیل پیش کرتا ہے جسے وہ اپنے نزدیک حجت سمجھتا ہے۔ اسی طرح انہوں نے جنت کے بارے میں بھی اختلاف کیا ہے۔ لیکن ہمارے نزدیک اور ہمارے اصحاب، اہل کشف و تعریف (أهل الكشف والتعريف) کے نزدیک، یہ دونوں مخلوق بھی ہیں اور غیر مخلوق بھی (مخلوقتان غير مخلوقتين)۔ جہاں تک ہمارے اس قول کا تعلق ہے کہ یہ مخلوق ہے، تو یہ اس شخص کی طرح ہے جو گھر بنانا چاہتا ہو، اور وہ اس کی تمام بیرونی دیواریں کھڑی کر دے۔ تو کہا جاتا ہے کہ اس نے گھر بنا لیا۔ لیکن جب کوئی اس میں داخل ہوتا ہے تو اسے ایک کھلی فضا اور صحن کے گرد ایک دیوار کے سوا کچھ نظر نہیں آتا۔ پھر اس کے بعد وہ اس میں رہنے والوں کی ضروریات کے مطابق کمرے، غرفے، تہہ خانے، ہلاکت خانے اور گودام بناتا ہے، اور وہ تمام آلات جو اس میں داخل ہونے والوں کو عذاب دینے کے لیے استعمال ہونے چاہئیں، جنہیں رہنے والا اس میں رکھنا چاہتا ہے۔\n\n### [جہنم کی حرارت اور اس کا ایندھن]\n\nیہ ایک ایسا گھر ہے جس کی حرارت جلتی ہوئی ہوا ہے، اس میں انسانوں، معبود بنائے گئے پتھروں اور جنوں کے سوا کوئی انگارہ نہیں ہے۔ اس کا شعلہ (لہب) بھی یہی ہیں۔ اللہ تعالیٰ فرماتا ہے: وَقُودُهَا النَّاسُ وَالْحِجَارَةُ (جس کا ایندھن انسان اور پتھر ہیں)۔ اور فرمایا: إِنَّكُمْ وَمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ حَصَبُ جَهَنَّمَ (بے شک تم اور وہ جن کی تم اللہ کے سوا عبادت کرتے ہو، جہنم کا ایندھن ہو)۔ اور اللہ تعالیٰ نے فرمایا: فَكُبْكِبُوا فِيهَا هُمْ وَالْغَاوُونَ * وَجُنُودُ إِبْلِيسَ أَجْمَعُونَ (پس وہ اور گمراہ لوگ اس میں اوندھے ڈال دیے جائیں گے، اور ابلیس کے تمام لشکر بھی)۔ اس میں آلات، جنوں اور انسانوں کے اعمال کے پیدا ہونے کے ساتھ ہی پیدا ہوتے ہیں جو اس میں داخل ہوتے ہیں۔\n\n### [اللہ نے جہنم کو برج ثور کے طالع میں پیدا کیا]\n\nاور اللہ نے اسے برج ثور (طالع الثور) کے طالع میں پیدا کیا، اسی لیے اس کی تخلیق کی صورت بھینس (جاموس) کی صورت جیسی ہے۔ ہمارے نزدیک اسی پر انحصار کیا جاتا ہے۔ ابو الحکم بن برجان نے اپنے کشف (الکشف) میں اسے اسی صورت میں دیکھا تھا۔ اور اہل کشف (أهل الكشف) میں سے بعض لوگوں کے لیے یہ سانپ کی صورت میں بھی متمثل ہوئی، تو وہ گمان کرتے ہیں کہ اللہ نے اسے اسی صورت پر پیدا کیا ہے، جیسے ابو القاسم بن قسی اور ان جیسے دیگر لوگ۔ جب اللہ تعالیٰ نے اسے پیدا کیا تو زحل برج ثور میں تھا، اور سورج اور مریخ (الأحمر) برج قوس میں تھے، اور باقی سیارے برج جدی میں تھے۔ اللہ تعالیٰ نے اسے اپنے اس ظہور الٰہی (التجلی) سے پیدا کیا جو اس کے اس قول میں ہے جو حدیث مسلم میں ہے: جعت فلم تطعمني وظمئت فلم تسقني ومرضت فلم تعدني (میں بھوکا تھا تو تم نے مجھے کھانا نہیں کھلایا، میں پیاسا تھا تو تم نے مجھے پانی نہیں پلایا، اور میں بیمار تھا تو تم نے میری عیادت نہیں کی)۔\n\nیہ سب سے عظیم نزول ہے جو ذات حق (الحق) نے اپنے بندوں پر ان پر لطف و کرم کے لیے فرمایا۔ اسی حقیقت سے جہنم کو پیدا کیا گیا، اللہ ہمیں اور تمہیں اس سے پناہ دے۔ اسی لیے اس نے جباروں پر جبر کیا اور متکبروں کو توڑا۔\n\n### [جہنم کے آلام اس کے باسیوں پر نازل ہونے والی صفت غضب الٰہی سے ہیں]\n\nاور اس میں جو بھی آلام پیدا کیے جاتے ہیں جنہیں اس میں داخل ہونے والے محسوس کرتے ہیں، وہ صفت غضب الٰہی (صفة الغضب الإلهي) سے ہیں۔ اور یہ صرف جنوں اور انسانوں کے اس میں داخل ہونے پر ہی ہوتا ہے۔ جب تک اس میں کوئی نہیں ہوتا، اس میں بذات خود کوئی تکلیف نہیں ہوتی، نہ ہی اس کے فرشتوں میں۔ بلکہ یہ اور اس میں موجود اس کے زبانیے (زبانيتها) اللہ کی رحمت میں ڈوبے ہوئے، لذت حاصل کرتے ہوئے تسبیح کرتے ہیں، لَا يَفْتُرُونَ (وہ تھکتے نہیں)۔ اللہ تعالیٰ فرماتا ہے: وَلَا تَطْغَوْا فِيهِ فَيَحِلَّ عَلَيْكُمْ غَضَبِي وَمَنْ يَحْلِلْ عَلَيْهِ غَضَبِي فَقَدْ هَوَى (اور اس میں سرکشی نہ کرو، ورنہ تم پر میرا غضب نازل ہو جائے گا، اور جس پر میرا غضب نازل ہوا وہ یقیناً ہلاک ہو گیا)۔ یعنی تم پر میرا غضب نازل ہو گا۔ پس اس نے غضب کو اپنی طرف منسوب کیا، اور جب وہ ان پر نازل ہوتا ہے تو وہ اس کا محل بن جاتے ہیں۔ جہنم تو صرف ان کے لیے ایک جگہ ہے، اور وہ اس میں اترنے والے ہیں۔ وہ غضب کا محل ہیں اور غضب ان پر نازل ہوتا ہے، کیونکہ یہاں غضب ہی عین تکلیف ہے۔\nجس شخص کو معرفت (المعرفۃ) نہیں ہے اور وہ ہمارے طریقے کا دعویٰ کرتا ہے اور صفات میں تمثیل، قوت اور مناسبت کے ذریعے معاملہ کو سمجھنا چاہتا ہے، وہ کہتا ہے کہ جہنم قہر الٰہی (القهر الإلهي) سے پیدا کی گئی ہے اور اسم القاہر (الاسم القاهر) اس کا رب اور اس پر متجلی ہونے والا ہے۔ اگر معاملہ ایسا ہوتا جیسا کہ اس نے کہا، تو وہ جباروں پر تسلط کے لیے پیدا کیے جانے کے بجائے اپنے آپ میں مشغول ہو جاتی، اور نہ ہی وہ یہ کہہ پاتی: هَلْ مِنْ مَزِيدٍ (کیا مزید ہے؟)، اور نہ ہی یہ کہتی کہ میرے بعض نے بعض کو کھا لیا۔\nپس ذات حق (الحق) کا اپنی رحمت کے ساتھ اس پر نزول، جو وَسِعَتْ كُلَّ شَيْءٍ (ہر چیز کو گھیرے ہوئے ہے)، اور اس کی شفقت نے اسے اس دعوے اور اس پر جبر کرنے والوں پر تسلط کے لیے میدان فراہم کیا جس نے اس پر یہ احسان کیا۔ اور جو کچھ وہ کفار کے ساتھ کرتی ہے وہ منعم کا شکر ادا کرنے کے باب سے ہے، کیونکہ اس نے اس پر انعام کیا۔ وہ سبحانہ و تعالیٰ کی طرف سے صرف مطلق نعمت کو جانتی ہے جس میں کوئی متضاد چیز شامل نہیں ہوتی۔ پس لوگ اس کی تخلیق کے معاملے میں غلطی پر ہیں۔\n\n### [منافقین جہنم کے سب سے نچلے طبقے میں]\n\nاور سب سے عجیب بات جو ہم نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ہے:\nرسول اللہ صلی اللہ علیہ وسلم مسجد میں اپنے صحابہ کے ساتھ بیٹھے تھے کہ انہوں نے ایک عظیم دھماکے (هدة عظيمة) کی آواز سنی، تو وہ گھبرا گئے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کیا تم جانتے ہو یہ کیسی آواز ہے؟ انہوں نے عرض کیا: اللہ اور اس کا رسول بہتر جانتے ہیں۔ آپ نے فرمایا: یہ ایک پتھر ہے جو ستر سال پہلے جہنم کے سب سے اوپر سے پھینکا گیا تھا، اور اب وہ اس کی تہہ تک پہنچا ہے۔\nپس اس کا تہہ تک پہنچنا اور اس میں گرنا ہی یہ دھماکہ تھا۔ آپ صلی اللہ علیہ وسلم کی بات ختم نہ ہوئی تھی کہ منافقین میں سے ایک منافق کے گھر سے چیخ و پکار کی آواز آئی جو ستر سال کی عمر میں مر گیا تھا۔\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ اکبر۔ پس صحابہ کے علماء نے جان لیا کہ یہ پتھر وہی منافق تھا، اور جب سے اللہ نے اسے پیدا کیا تھا وہ جہنم کی آگ میں گر رہا تھا، اور جب اس کی عمر ستر سال ہوئی اور وہ مرا تو وہ اس کی تہہ میں پہنچ گیا۔\nاللہ تعالیٰ فرماتا ہے: إِنَّ الْمُنَافِقِينَ فِي الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ (بے شک منافقین آگ کے سب سے نچلے طبقے میں ہوں گے)۔ پس ان کا اس دھماکے کو سننا، جو اللہ نے انہیں عبرت کے لیے سنایا، نبوت کے کلام کی عظمت، اس کی تعریف کی لطافت، اس کے اشارے کی خوبصورتی اور آپ صلی اللہ علیہ وسلم کے کلام کی شیرینی کو دیکھو۔\n\n### [اہل نار کا آگ میں جھگڑنا]\n\nاور میں نے اللہ سے دعا کی کہ وہ مجھے اس کے معاملے میں جو چاہے متمثل کر کے دکھائے، تو اس نے مجھے ان کے جھگڑے کی حالت متمثل کر کے دکھائی، جو اللہ تعالیٰ کا یہ قول ہے: إِنَّ ذَلِكَ لَحَقٌّ تَخَاصُمُ أَهْلِ النَّارِ (بے شک یہ حق ہے، اہل نار کا جھگڑا)۔ اور اللہ تعالیٰ کا یہ قول: قَالُوا وَهُمْ فِيهَا يَخْتَصِمُونَ * تَاللَّهِ إِنْ كُنَّا لَفِي ضَلَالٍ مُبِينٍ (وہ اس میں جھگڑتے ہوئے کہیں گے: اللہ کی قسم! ہم تو کھلی گمراہی میں تھے)۔ یہ ان کی گمراہی اور ان کے معبودوں کی وجہ سے ہے: إِذْ نُسَوِّيكُمْ بِرَبِّ الْعَالَمِينَ (جب ہم تمہیں رب العالمین کے برابر ٹھہراتے تھے)۔ وَمَا أَضَلَّنَا إِلَّا الْمُجْرِمُونَ (اور ہمیں مجرموں کے سوا کسی نے گمراہ نہیں کیا)۔ مجرموں (الْمُجْرِمُونَ) سے مراد اہل نار ہیں جو اس میں آباد رہیں گے اور شفاعت کرنے والوں کی شفاعت اور موحدین میں سابق عنایت الٰہی کے سبب اس سے نکلنے والوں سے الگ ہو جائیں گے۔ اللہ تعالیٰ ان کے بارے میں فرماتا ہے: وَامْتَازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ (اور اے مجرمو! آج الگ ہو جاؤ)۔\n\n### [نبوت سے اخذ کرنے اور کتاب و سنت پر ٹھہر جانے میں کامل رحمت]\n\nیہ حالت مجھے ایک وقت میں متمثل کر کے دکھائی گئی، تو میں نے ان کے جھگڑے کو صرف اہل اختلاف کے مناظرے کے جھگڑے سے تشبیہ دی جب ان میں سے کوئی دلیل پیش کرتا ہے۔ جب میں نے یہ دیکھا تو مجھے وہ حالت یاد آئی جس پر اللہ نے مجھے مطلع کیا تھا، اور میں نے پوری رحمت کو تسلیم کرنے، نبوت سے اخذ کرنے اور کتاب و سنت پر ٹھہر جانے میں دیکھا۔\nلوگ اس حدیث سے غافل ہو گئے ہیں: \"نبی کے پاس جھگڑا (تنازع) نہیں ہونا چاہیے\"۔\nاور آپ صلی اللہ علیہ وسلم کی حدیث کی موجودگی آپ کی موجودگی کی طرح ہے، اس لیے اس کے بیان کے وقت جھگڑا نہیں ہونا چاہیے، اور سننے والا حدیث نبوی بیان کرتے وقت اپنی آواز بلند نہ کرے۔ کیونکہ اللہ فرماتا ہے: لَا تَرْفَعُوا أَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ (اپنی آوازیں نبی کی آواز سے بلند نہ کرو)۔ اور اہل اللہ کے نزدیک نبی کی آواز یا ان کے قول کی حکایت میں کوئی فرق نہیں ہے۔\nپس ہمارے لیے صرف یہ ضروری ہے کہ ہم محدث کی طرف سے آنے والے کلام نبوت کو بغیر کسی بحث و تکرار کے قبول کرنے کے لیے تیار رہیں۔ خواہ وہ حدیث کسی سوال کا جواب ہو یا ابتدائی کلام۔ کسی مسئلے یا واقعے میں آپ صلی اللہ علیہ وسلم کے کلام پر ٹھہر جانا واجب ہے۔ جب بھی کہا جائے کہ اللہ نے فرمایا یا رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، تو اسے قبول کرنا چاہیے اور سننے والے کو باادب رہنا چاہیے اور محدث کی آواز پر اپنی آواز بلند نہیں کرنی چاہیے جب وہ اللہ کا قول بیان کرے یا رسول اللہ صلی اللہ علیہ وسلم کی حدیث بیان کرے۔\nاللہ تعالیٰ فرماتا ہے: فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ (پس اسے پناہ دو تاکہ وہ اللہ کا کلام سن لے)۔ اور اسے رسول اللہ صلی اللہ علیہ وسلم کے سوا کسی نے تلاوت نہیں کیا، اور سننے والے نے اسے صرف آپ ہی سے سنا۔ پھر اگر سننے والا اس کے کلام کی حالت میں اس کے ساتھ شریک ہو جائے تو وہ سننے والا نہیں ہے۔ کیونکہ یہ ان آداب میں سے ہے جو اللہ نے اپنے نبی صلی اللہ علیہ وسلم کو سکھائے، جیسا کہ اس کا قول ہے: وَلَا تَعْجَلْ بِالْقُرْآنِ مِنْ قَبْلِ أَنْ يُقْضَى إِلَيْكَ وَحْيُهُ (اور قرآن کو جلدی نہ پڑھو اس سے پہلے کہ تمہاری طرف اس کی وحی پوری کی جائے)۔ اور اللہ فرماتا ہے: لَا تَرْفَعُوا أَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَلَا تَجْهَرُوا لَهُ بِالْقَوْلِ كَجَهْرِ بَعْضِكُمْ لِبَعْضٍ (اپنی آوازیں نبی کی آواز سے بلند نہ کرو اور ان سے بات کرتے ہوئے اس طرح بلند آواز سے بات نہ کرو جیسے تم آپس میں ایک دوسرے سے کرتے ہو)۔ اور اس پر عمل کے ضائع (حبط العمل) ہونے کی وعید سنائی ہے، جہاں انسان کو شعور بھی نہیں ہوتا۔ کیونکہ وہ اپنے رد اور جھگڑے میں یہ گمان کرتا ہے کہ وہ دین الٰہی کا دفاع کر رہا ہے۔ اور یہ اللہ کی خفیہ تدبیر (مكر الله) میں سے ہے جس کے بارے میں اس نے فرمایا: سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ (ہم انہیں آہستہ آہستہ پکڑیں گے جہاں سے انہیں علم بھی نہ ہوگا)۔ اور فرمایا: وَمَكَرْنَا مَكْرًا وَهُمْ لَا يَشْعُرُونَ (اور ہم نے خفیہ تدبیر کی اور انہیں شعور بھی نہ ہوا)۔\nپس عقلمند، مومن اور اپنی ذات کا خیر خواہ شخص جب کسی کو یہ کہتے سنے کہ اللہ تعالیٰ نے فرمایا یا رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، تو اسے خاموش رہنا چاہیے، کان لگانا چاہیے، ادب اختیار کرنا چاہیے اور سمجھنا چاہیے کہ اللہ نے کیا فرمایا یا رسول اللہ صلی اللہ علیہ وسلم نے کیا فرمایا۔ اللہ فرماتا ہے: وَإِذَا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوا لَهُ وَأَنْصِتُوا لَعَلَّكُمْ تُرْحَمُونَ (اور جب قرآن پڑھا جائے تو اسے غور سے سنو اور خاموش رہو تاکہ تم پر رحم کیا جائے)۔ اس نے اس صفت کے ساتھ امید (ترجی) کو وابستہ کیا، اور رحمت کا قطعی فیصلہ نہیں کیا، تو اس شخص کا کیا حال ہوگا جو جھگڑا کرے، اپنی آواز بلند کرے اور تلاوت کرنے والے کے کلام میں مداخلت کرے؟ میں کلام میں حدیث نبوی کو شامل کروں گا اور امید کرتا ہوں کہ الٰہی امید (الترجي الإلهي) واجب ہوگی جیسا کہ علماء اسے دیکھتے ہیں۔\n\n### [غیبی مشاہدات اور علمی انکشافات]\n\nاور جب میں نے اس مقام کا مشاہدہ کیا تو میں نے ایک عجیب چیز دیکھی۔ اس مشاہدے میں میں نے ہوا پر پانی کا انحصار دیکھا، جو کہ حیزوں (الأحياز) کی آبادی میں سب سے عجیب چیزوں میں سے ہے۔ اور یہ کہ دو جوہر ایک حیز (جگہ) میں نہیں ہو سکتے، اور حیز اس کے لیے مشغول ہے۔ اس مشاہدے میں مجھے تولید (التوالد) کے باطل ہونے کا علم ہوا، اور یہ کہ چیزوں کو حرکت دینے والا صرف اللہ تعالیٰ ہے، اور سبب کا فعل میں کوئی اثر نہیں ہے۔ اس مشاہدے میں مجھے یہ بھی معلوم ہوا کہ زیادہ لطیف (الألطف) زیادہ کثیف (الأكثف) سے زیادہ قوی ہوتا ہے۔ کیونکہ ہوا بلاشبہ پانی سے زیادہ لطیف ہے، لیکن اس نے پانی کو روکا اور پانی قوت میں اس کا مقابلہ نہ کر سکا اور اسے نیچے اترنے سے روکا۔ میں نے خود کو ہوا میں دیکھا اور پانی میرے اوپر تھا اور ہوا اسے زمین پر گرنے سے روک رہی تھی۔ اس مشاہدے میں مجھے بہت سے علوم کا علم ہوا۔\nاور اس مشاہدے میں میں نے اہل نار کے درکات (درجات) کو دیکھا، اس حیثیت سے کہ وہ جہنم ہے نہ کہ آگ، جتنا اللہ نے مجھے مطلع کرنا چاہا۔ اور میں نے اس میں ایک جگہ دیکھی جسے المظلمة (مظلمہ) کہا جاتا ہے، میں تقریباً پانچ درجے نیچے اترا اور اس کی ہلاکت خیز جگہیں دیکھیں۔ پھر مجھے اوپر کی طرف پانی میں دھکیل دیا گیا، اور میں اس میں سے گزر گیا، اور میں نے عجیب چیزیں دیکھیں۔ اور مجھے ان کے جھگڑے کے حالات کا علم ہوا جہاں وہ دوزخ میں جھگڑتے ہیں، اور یہ کہ وہ جھگڑا ہی اس حالت میں ان کا عذاب ہے۔ اور جہنم میں ان کا عذاب جہنم کی طرف سے نہیں ہے، بلکہ جہنم تو ان کے رہنے کی جگہ اور ان کا قید خانہ ہے۔ اور اللہ جب چاہتا ہے ان میں آلام پیدا کرتا ہے۔ پس ان کا عذاب اللہ کی طرف سے ہے اور وہ اس کا محل ہیں۔\n\n### [جہنم کے سات دروازے اور ان کے محافظ]\n\nاور اللہ نے جہنم کے لیے سات دروازے بنائے ہیں، ہر دروازے کے لیے عالم کا ایک حصہ اور عذاب کا ایک حصہ مقرر ہے۔ یہ سات دروازے کھلے ہوئے ہیں۔ اور اس میں ایک آٹھواں دروازہ ہے جو بند ہے اور کبھی نہیں کھلے گا، اور وہ اللہ کے دیدار (رؤیۃ اللہ) سے حجاب (الحجاب) کا دروازہ ہے۔ اور ہر دروازے پر ساتوں آسمانوں کے فرشتوں میں سے ایک فرشتہ مقرر ہے۔ میں نے وہاں ان کے نام جان لیے تھے، لیکن مجھے یاد نہیں رہے، سوائے اسماعیل کے، جو مجھے یاد رہا۔\n\n### [جہنم میں سیارے تاریک اجسام ہیں]\n\nجہاں تک تمام سیاروں (الكواكب) کا تعلق ہے، وہ جہنم میں تاریک اجسام (مظلمة الأجرام) اور عظیم الخلقت ہوں گے۔ اسی طرح سورج اور چاند بھی۔ اور ان کا طلوع و غروب جہنم میں ہمیشہ جاری رہے گا۔ اس کا سورج طلوع ہونے والا (شارقة) ہوگا مگر روشن (مشرقة) نہیں ہوگا۔ اور اس کی گردش سے تکوينات (تخلیقات) اس گھر کے مناسب مخلوقات کے مطابق ہوں گی، اور جو صورتیں تبدل اور بکھرنے میں بدل جائیں گی۔ اسی لیے اللہ تعالیٰ نے فرمایا: النَّارُ يُعْرَضُونَ عَلَيْهَا غُدُوًّا وَعَشِيًّا (آگ ہے جس پر وہ صبح و شام پیش کیے جاتے ہیں)۔ اور یہ حالت مسلسل جاری رہے گی۔ برزخ میں پیشی ہوگی اور دار آخرت میں داخلہ ہوگا۔\nاس میں سیاروں کی ذات کی صورت بالکل ہمارے ہاں کے گرہن (الکسوف) کی صورت جیسی ہوگی، سوائے اس کے کہ اس گھر میں ان حرکات کا وزن آج کے وزن سے مختلف ہوگا۔ ان کا گرہن ایسا ہوگا جو ختم نہیں ہوگا، اور یہ ان کی ذات میں گرہن ہوگا نہ کہ ہماری آنکھوں میں۔ اور وہاں کی ہوا میں کمی ہوگی، جو آنکھوں اور تمام انوار کے ادراک کے درمیان حائل ہو جائے گی۔ پس آنکھیں بکھرے ہوئے سیاروں کو دیکھیں گی جن کے اجسام روشن نہیں ہوں گے، جیسا کہ ہمیں قطعی طور پر معلوم ہے کہ یہاں سورج اپنی ذات میں روشن ہے، اور قمری حجاب ہی ہے جو آنکھ کو اس کے ادراک سے یا چاند کے نور کے ادراک سے یا جو گرہن زدہ ہے اس کے ادراک سے روکتا ہے۔ اسی لیے جب کسی جگہ ان میں سے کسی چیز کا گرہن ہوتا ہے تو دوسری جگہ اس سے زیادہ ہوتا ہے، اور کسی اور جگہ بالکل نہیں ہوتا۔ جب مقامات کے اختلاف کی وجہ سے آنکھوں کا ادراک مختلف ہوا تو ہمیں قطعی طور پر معلوم ہوا کہ راستے میں کوئی عارضی چیز حائل ہوئی ہے جو آنکھ اور اس کے درمیان یا اس کے نور کے درمیان حائل ہو گئی ہے، جیسے چاند تمہارے اور سورج کے جرم کے ادراک کے درمیان حائل ہوتا ہے، اور زمین کا سایہ تمہارے اور چاند کے نور کے درمیان حائل ہوتا ہے، نہ کہ اس کے جرم کے درمیان، جیسا کہ چاند تمہارے اور سورج کے جرم کے درمیان حائل ہوتا ہے۔ اور یہ تمہاری اور اس کی حالت کے مطابق ہوتا ہے۔ اور اسی طرح باقی سیارے بھی۔ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ (لیکن اکثر لوگ نہیں جانتے)، جیسا کہ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ (اکثر لوگ ایمان نہیں لاتے)۔ کیونکہ یہ تمام گرہن، اپنی مختلف اقسام کے ساتھ، اس الٰہی ظہور (تجلی الٰہی) کی وجہ سے مکسوف (گرہن زدہ) کا خشوع (خشوع) ہے۔\n\n### [حساب اور جنت میں داخلے کے بعد جہنم کی حدود]\n\nحساب سے فارغ ہونے اور اہل جنت کے جنت میں داخل ہونے کے بعد جہنم کی حد ثابت ستاروں کے فلک (فلك الكواكب الثابتة) کے گہرے حصے سے لے کر اسفل سافلین (سب سے نچلا طبقہ) تک ہے۔ یہ سب کچھ جہنم میں اضافہ کرے گا جو ابھی مخلوق نہیں ہے، لیکن وہ تیار ہے تاکہ ظاہر ہو، سوائے ان جگہوں کے جنہیں اللہ نے زمین میں مقرر کر دیا ہے، کیونکہ وہ قیامت کے دن جنت کی طرف لوٹ جائیں گی، جیسے وہ روضہ (الروضة) جو رسول اللہ صلی اللہ علیہ وسلم کے منبر اور آپ صلی اللہ علیہ وسلم کی قبر کے درمیان ہے۔ اور ہر وہ جگہ جسے شارع نے مقرر کیا ہے، اور ہر دریا، یہ سب جنت کی طرف جائیں گے۔ اور جو باقی بچے گا وہ سب آگ بن جائے گا اور وہ جہنم کا حصہ ہوگا۔ اسی لیے عبداللہ بن عمر رضی اللہ عنہما جب سمندر دیکھتے تو کہتے: اے سمندر! تو کب آگ بنے گا؟ اور اللہ تعالیٰ فرماتا ہے: وَإِذَا الْبِحَارُ سُجِّرَتْ (اور جب سمندر بھڑکا دیے جائیں گے)۔ یعنی آگ سے بھڑکا دیے جائیں گے، جیسے \"سجرت التنور\" جب تم تنور کو جلاتے ہو۔ اور ابن عمر سمندر کے پانی سے وضو کرنا ناپسند کرتے تھے اور کہتے تھے کہ میرے نزدیک تیمم اس سے زیادہ پسندیدہ ہے۔\n\n### [اشیاء کا حقیقی مشاہدہ اور ان پر صحیح حکم]\n\nاگر اللہ آج مخلوق کی آنکھوں سے پردہ ہٹا دے تو وہ اسے آگ کی طرح بھڑکتا ہوا دیکھیں گے، لیکن اللہ جو چاہتا ہے ظاہر کرتا ہے اور جو چاہتا ہے چھپاتا ہے تاکہ یہ معلوم ہو جائے کہ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (بے شک اللہ ہر چیز پر قادر ہے) اور أَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا (اور بے شک اللہ نے ہر چیز کو علم سے گھیر رکھا ہے)۔\nیہ اکثر اہل ورع (پرہیزگاری) کے ساتھ ہوتا ہے، تو محفوظ پرہیزگار شخص حرام کھانے کو خنزیر یا گندگی (خنزيرا أو عذرة) کے طور پر دیکھتا ہے، اور حرام مشروب کو شراب کے طور پر دیکھتا ہے، اور اسے اپنے دیکھے ہوئے میں کوئی شک نہیں ہوتا، جبکہ اس کا ہم نشین اسے روٹی کا ایک اچھا ٹکڑا دیکھتا ہے اور مشروب کو میٹھا پانی دیکھتا ہے۔ کاش میں جانتا کہ صحیح حس (الحس الصحيح) کا مالک کون ہے اور خیال (الخيال) کا مالک کون ہے؟ کیا وہ جس نے شرعی حکم کو صورت میں پایا، یا وہ جس نے محسوس کی جانے والی چیز کو معمول کے مطابق اس کی حالت پر پایا؟\n\n### [حسن و قبح میں معتزلہ کا مذہب]\n\nیہ وہ چیز ہے جو معتزلہ کے اس مذہب کو تقویت دیتی ہے کہ قبیح اپنی ذات میں قبیح ہے (القبيح قبيح لنفسه) اور حسن اپنی ذات میں حسن ہے (الحسن حسن لنفسه)، اور یہ کہ صحیح ادراک اسی شخص کا ہے جس نے حرام مشروب کو شراب کے طور پر دیکھا۔ اگر وہ اپنی ذات میں قبیح نہ ہوتا تو اس کے لیے یہ کشف (الکشف) صحیح نہ ہوتا۔ اور اگر اس کا فعل صرف حرمت اور قبح کے خطاب کے تعلق کا عین ہوتا تو وہ کھانا خنزیر کے طور پر ظاہر نہ ہوتا، کیونکہ مکلف کی طرف سے فعل واقع نہیں ہوا، بلکہ اللہ نے اسے اس کی صورت ظاہر کر دی اور یہ کہ وہ قبیح ہے تاکہ وہ اسے کھانے کی جسارت نہ کرے۔ اور یہی بات اس شخص کے بارے میں بھی تصور کی جاتی ہے جو اسے معمول کے مطابق کھانا دیکھتا ہے، لیکن یہ شرع میں زیادہ حقدار ہے۔ پس قطعی طور پر معلوم ہوا کہ جو شخص اسے معمول کے مطابق کھانا دیکھتا ہے، اس کے اور شرعی حکم کی حقیقت کے درمیان قبح کے لحاظ سے پردہ حائل کر دیا گیا ہے۔\nاور اگر کوئی چیز وضعي قبح (القبح الوضعي) کی وجہ سے قبیح ہوتی تو شارع کا اس کے بارے میں یہ خبر دینا کہ وہ قبیح ہے یا حسن ہے، سچ نہ ہوتا۔ کیونکہ یہ کسی چیز کے بارے میں اس کے خلاف خبر دینا ہے جو وہ ہے۔ کیونکہ احکام ہر عقلمند اور کلام سے واقف شخص کے نزدیک بلاشبہ خبریں ہیں۔ اللہ نے ہمیں خبر دی ہے کہ یہ حرام ہے اور یہ حلال ہے۔ اسی لیے اللہ تعالیٰ نے ان لوگوں کی مذمت میں فرمایا جو اللہ کے بارے میں وہ کہتے ہیں جو اس نے نہیں کہا: وَلَا تَقُولُوا لِمَا تَصِفُ أَلْسِنَتُكُمُ الْكَذِبَ هَذَا حَلَالٌ وَهَذَا حَرَامٌ لِتَفْتَرُوا عَلَى اللَّهِ الْكَذِبَ (اور تم اپنی زبانوں سے جھوٹ بیان کرتے ہوئے یہ نہ کہو کہ یہ حلال ہے اور یہ حرام ہے تاکہ تم اللہ پر جھوٹ باندھو)۔ پس اس نے حکم کو خبر کے ساتھ ملایا کیونکہ یہ بلاشبہ خبر ہے۔\nالبتہ، اکثر چیزوں میں انسانوں کی طاقت میں نہیں ہے کہ وہ اشیاء کے قبح یا حسن کا ادراک کر سکیں۔ پس جب ہم ذات حق (الحق) کے ذریعے انہیں جان لیتے ہیں تو ہم انہیں جان لیتے ہیں۔ اور ان میں سے کچھ ایسی ہیں جن کا قبح ہمارے عرف میں عقلی طور پر معلوم ہوتا ہے، جیسے جھوٹ اور منعم کی ناشکری، اور ان کا حسن عقلی طور پر معلوم ہوتا ہے، جیسے سچ اور منعم کا شکر۔ اور بعض قسم کے سچ کے ساتھ گناہ کا تعلق ہونا اور بعض قسم کے جھوٹ کے ساتھ اجر کا تعلق ہونا، یہ اللہ کے لیے ہے، وہ جس قبح اور حسن پر چاہتا ہے اجر دیتا ہے، اور یہ اس چیز کے حسن یا قبح پر دلالت نہیں کرتا۔ جیسے کسی مومن کو ہلاکت سے بچانے کے لیے جھوٹ بولنا، جس پر انسان کو اجر ملتا ہے، اگرچہ جھوٹ اپنی ذات میں قبیح ہے۔ اور سچ، جیسے غیبت، جس سے انسان گناہگار ہوتا ہے، اگرچہ سچ اپنی ذات میں حسن ہے۔ پس یہ ایک شرعی معاملہ ہے، وہ جسے چاہتا ہے اپنا فضل دیتا ہے اور جسے چاہتا ہے روک لیتا ہے، جیسا کہ فرمایا: يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشَاءُ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ (وہ جسے چاہتا ہے اپنی رحمت کے لیے خاص کر لیتا ہے، اور اللہ بڑے فضل والا ہے)۔\n\n### [نفس اور تنفس کا مرتبہ اور موت کا زندگی سے تعلق]\n\nجان لو کہ آگ میں سب سے زیادہ عذاب پانے والی مخلوق ابلیس ہے جس نے شرک اور ہر مخالفت کی بنیاد ڈالی۔ اس کی وجہ یہ ہے کہ وہ آگ سے پیدا ہوا ہے، لہٰذا اس کا عذاب اسی چیز سے ہوگا جس سے وہ پیدا ہوا ہے۔ کیا تم نہیں دیکھتے کہ نفس (النفس) کے ذریعے حساس جسم کی زندگی قائم ہوتی ہے؟ پس جب پھانسی یا گلا گھونٹنے سے اس نفس کا نکلنا روک دیا جاتا ہے تو وہ پلٹ کر دل کی طرف لوٹتا ہے اور اسے فوراً جلا دیتا ہے، اور وہ اسی وقت ہلاک ہو جاتا ہے۔ پس نفس کے ذریعے ہی اس کی زندگی تھی اور اسی کے ذریعے اس کی ہلاکت ہوئی۔ اور حقیقت میں اس کی ہلاکت تنفس (التنفس) کی وجہ سے ہوتی ہے، نہ کہ صرف نفس والا ہونے کی وجہ سے، اور نہ ہی صرف سانس لینے والا ہونے کی وجہ سے، بلکہ اس وجہ سے کہ وہ جاذبہ قوت (القوة الجاذبة) کے ذریعے ٹھنڈی ہوا کا نفس اپنے دل کی طرف کھینچتا ہے اور دافعہ قوت (القوة الدافعة) کے ذریعے گرم، جلانے والے نفس کو باہر نکالتا ہے، جس سے اس کا دل محفوظ رہتا ہے۔ پس ان تمام حالات کے سبب ہی اس کی زندگی قائم ہوتی ہے۔\n\n### [آگ میں سب سے زیادہ عذاب پانے والے لوگ]\n\nپس جو شخص آگ میں پھینکا جاتا ہے وہ سانس لینے والا (متنفس) ہوتا ہے، لیکن وہ دو حالتوں میں سے کسی ایک سے خالی نہیں ہوتا: یا تو وہ آگ میں سانس نہیں لے گا، تو اس کی حالت اس پھانسی دیے گئے شخص کی طرح ہوگی جسے رسی سے گلا گھونٹا جاتا ہے اور اس کا اپنا نفس اسے مار ڈالتا ہے۔ یا وہ سانس لے گا اور جاذبہ قوت (القوة الجاذبة) کے ذریعے جلانے والی ناری ہوا کو کھینچے گا، جو جب اس کے دل تک پہنچے گی تو اسے جلا دے گی۔ اسی لیے ہم نے زندگی کے سبب میں ان تمام امور کا ذکر کیا۔\nپس ابلیس کا عذاب جہنم میں موجود زمہریر (شدید سردی) سے ہوگا، کیونکہ یہ اس آگ کے مقابل ہے جو ابلیس کی اصل پیدائش ہے۔ لہٰذا اس کا عذاب زمہریر سے ہوگا، اور اس آگ سے بھی جو اس میں ہوا، پانی اور مٹی کے رکن سے مرکب ہے۔ پس اسے ایک مخصوص مقدار میں آگ سے عذاب دیا جانا ضروری ہے۔ اور اس کا عام عذاب اس چیز سے ہوگا جو اس کی اصل تخلیق میں غالب چیز کے متضاد ہے۔\nاور آگ دو طرح کی ہے: ایک حسی آگ (نار حسية)، جو اس کے احساس، حیوانیت، اور اس کے ظاہری و باطنی جسم پر مسلط ہوگی۔ اور دوسری معنوی آگ (نار معنوية)، جو دلوں پر جھانکتی ہے (تطلع على الأفئدة)، اور اس سے اس کی روح کو عذاب دیا جائے گا جو اس کے ڈھانچے کو چلا رہی تھی، جس نے حکم دیا گیا تو نافرمانی کی۔ پس اس کی مخالفت نے اسے عذاب دیا، اور یہ اس کی جہالت کا عین ہے اس ذات کے بارے میں جس پر اس نے تکبر کیا۔\n\n### [یوم التغابن: نفوس کے عذاب کا دن]\n\nپس روحوں پر جہالت سے بڑھ کر کوئی عذاب نہیں، کیونکہ یہ سراسر گھاٹا (غبن) ہے۔ اسی لیے اسے يَوْمُ التَّغَابُنِ (یوم التغابن - ہار جیت کا دن) کہا گیا، یعنی نفوس کے عذاب کا دن۔ وہ کہے گا: يَا وَيْلَتَا عَلَى مَا فَرَّطْتُ (ہائے افسوس! اس پر جو میں نے کوتاہی کی)۔ اور یہ يَوْمَ الْحَسْرَةِ (یوم الحسرة - حسرت کا دن) ہے، یعنی کشف (الکشف) کا دن، کیونکہ \"حسرت عن الشيء\" کا مطلب ہے جب تم کسی چیز سے پردہ ہٹاؤ۔ گویا وہ کہتا ہے: کاش میں نے دنیا میں اس معاملے سے پردہ ہٹا دیا ہوتا، تاکہ میں اپنے معاملے میں بصیرت پر ہوتا۔ پس وہ اپنے نفس میں گھاٹا اٹھائے گا۔\nاور تغابن (ہار جیت) کا ادراک اس دن ہر کوئی کرے گا، نیکوکار بھی اور نافرمان بھی۔ نیکوکار کہے گا: کاش میں نے اپنی پوری کوشش کی ہوتی اور اپنی استطاعت کا حق ادا کیا ہوتا اور اپنے رب کے کلام پر غور کیا ہوتا اور اس کے تقاضے کے مطابق عمل کیا ہوتا، باوجود اس کے کہ وہ سعادت مند ہے۔ اور نافرمان کہے گا: کاش میں نے اپنے رب کی نافرمانی نہ کی ہوتی جس کا اس نے مجھے حکم دیا اور جس سے منع کیا۔ پس ذَلِكَ يَوْمُ التَّغَابُنِ (یہ ہار جیت کا دن ہے)۔ اور یہ انشاء اللہ باب یوم القیامہ میں آئے گا۔\n\n### [جہنم: اس کے باسیوں کے آلام صفت غضب الٰہی ہیں اور اس کا وجود محل تنزل رحمانی ہے]\n\nاور ہم نے تمہیں نفس (النفس) اور تنفس (التنفس) کے مرتبے کے بارے میں جو کچھ بتایا، وہ اس لیے لائے تاکہ تم جان لو کہ جہنم کو جب اس کے باسیوں کے آلام کے لیے صفت غضب الٰہی (صفة الغضب الإلهي) کے ساتھ خاص کیا گیا، اور اس کے وجود کو الٰہی رحمانی نزول (التنزل الرحماني الإلهي) کے ساتھ خاص کیا گیا، اور صحیح حدیث میں نفس رحمان (نفس الرحمن) کا ذکر صفت غضب کے ساتھ مشعر ہے۔\nپس تنفس (التنفس) نے صفت غضب کو اس شخص کے ساتھ ملحق کر دیا جس پر وہ نازل ہوا۔ اسی لیے جب نفس رحمان یمن کی طرف سے آیا تو کفار پر قتل اور تلوار کی صورت میں غضب الٰہی نازل ہوا جو انصار نے ان پر چلائی۔ پس اللہ نے اس کے ذریعے اپنے دین اور اپنے نبی صلی اللہ علیہ وسلم کی طرف سے سانس لیا (نفس لیا)۔ کیونکہ غضب والا جب کسی پر غضب پاتا ہے جس پر وہ اپنا غضب بھیجتا ہے، تو اس غضب کی تکلیف سے اسے راحت ملتی ہے جو وہ محسوس کرتا ہے۔ اور اس صورت کو محمد صلی اللہ علیہ وسلم میں مکمل کیا گیا، پس آپ صلی اللہ علیہ وسلم کفار کے مقابلے میں اللہ کے کلمے کو رد کرنے کی وجہ سے صفت غضب کے ساتھ کھڑے ہوئے۔ پس نفس رحمان نے آپ صلی اللہ علیہ وسلم کی طرف سے تلوار کا حکم دے کر اور آپ کے اصحاب اور انصار کے ذریعے سانس لیا، تو آپ نے راحت محسوس کی، کیونکہ آپ نے وہ جگہ پائی جہاں آپ اپنا غضب بھیجتے ہیں۔ پس اس سے اہل نار کے آلام اور اللہ کے دشمنوں پر غضب الٰہی کے حوالے سے محمدی حجابی صورت کو سمجھو۔ اور یہ کہ آلام دشمنوں پر بھیجے گئے، پس وہ ان کے ساتھ قائم ہو گئے، اور اللہ نے اپنے دین کی طرف سے سانس لیا، جو اس کا حکم اور اس کا کلام ہے، اور وہ اس کی مخلوق میں اس کے علم کا عین ہے، اور اس کا علم اس کی ذات ہے، وہ جلیل و برتر ہے۔\nہم نے تمہارے لیے جہنم کے معاملے کو اس حیثیت سے بیان کر دیا کہ وہ ایک گھر ہے۔ پس انشاء اللہ ہم اس باب کے بعد والے باب میں اہل نار کے مراتب بیان کریں گے۔\n\n### [جہنم کے سو درکات اور اس کے زبانیے]\n\nپھر جان لو کہ اللہ نے اس میں سو درک (درجات) بنائے ہیں، جو جنت کے درجوں (درج الجنة) کے مقابل ہیں۔ اور ہر درک کے لیے مخصوص لوگ ہیں جن پر نازل ہونے والے غضب الٰہی سے مخصوص آلام ہیں۔ اور ان کے عذاب پر مقرر کیے گئے والی (الولاة) جن کا ذکر ہم نے اس کتاب کے اس باب سے پہلے والے باب میں کیا ہے، وہ القائم، الإقليد، الحامد، النائب، السادن، اور الجابر ہیں۔ پس یہ والی فرشتے ہی ہیں جو اللہ کے حکم سے ان پر عذاب بھیجتے ہیں۔ اور مالک (مالك) اس کا خازن (الخازن) ہے۔\nجہاں تک باقی والیوں کا تعلق ہے، ان کے ساتھ جن کا ہم نے ذکر کیا، وہ الحائر، السائق، الماتح، العادل، الدائم، اور الحافظ ہیں، یہ سب اہل جنت کے ساتھ ہوں گے۔ اور جنت کا خازن رضوان (رضوان) ہے۔\nان کا اہل نار کو امداد دینا اہل جنت کو امداد دینے جیسا ہی ہے، کیونکہ وہ انہیں اپنی حقائق (حقائق) سے امداد دیتے ہیں، اور ان کی حقائق میں کوئی اختلاف نہیں ہوتا۔ پس دونوں گھروں کے ہر گروہ ان سے اپنی نشأت کے مطابق قبول کرتا ہے۔ پس عذاب اسی چیز سے واقع ہوتا ہے جس سے نعمت واقع ہوتی ہے، محل کی وجہ سے۔ جیسا کہ ہم نے ٹھنڈے شخص کے بارے میں کہا کہ وہ سورج کی گرمی سے لذت حاصل کرتا ہے، اور گرم شخص سورج کی گرمی سے عذاب پاتا ہے۔ پس جس چیز سے نعمت واقع ہوئی، وہی چیز دوسرے کے لیے عین تکلیف کا سبب بنی۔\nپس اللہ ہمیں نعمتوں کی نشأت پر پیدا کرے، جیسا کہ اس نے نیک لوگوں کے حق میں فرمایا: تَعْرِفُ فِي وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ (تم ان کے چہروں پر نعمت کی تازگی پہچانو گے)۔ یعنی وہ اپنی تخلیق میں اسی صفت پر ہیں۔\nاور اہل نار کی نشأت اہل جنت کی نشأت سے مختلف ہے۔ کیونکہ جنت کی نشأت صرف ذات حق (الحق) سبحانہ کی طرف سے خاص طور پر والیوں کے ہاتھوں پر ہوتی ہے۔ اور اہل نار کی نشأت والیوں، حجابوں، نقیبوں اور سدّیوں کے ہاتھوں پر ہوتی ہے، جو کثرت میں ہیں، جن کی تعداد اللہ کے سوا کوئی نہیں جانتا۔ اور ان میں سے ہر فرشتے کا اس دنیاوی نشأت، نار کی نشأت اور اس کے باسیوں کی نشأت میں ایک حکم ہے جسے اللہ نے اس میں مسخر کر رکھا ہے۔ پس وہ سلطنت میں اور تعمیر شدہ گھر کی تخلیق میں مزدوروں کی طرح ہیں۔ اور انشاء اللہ جنت اور اس میں موجود چیزوں کا ذکر آئے گا۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب شصت و یکم: در شناخت جهنم و بزرگترین مخلوقات از نظر عذاب در آن، و شناخت بخشی از عالم علوی\n\nهمانا آسمان دوباره به هم می‌پیوندد (رتق می‌شود) همچون آنچه *** بود، و نور ستارگانش زایل می‌گردد.\n\nاین برای آن است که ساکن زمینش تو را انصاف دهد *** و ستون و بنای آن بر او استوار گشته است.\n\nپس شدیدترین خلق خدا از نظر درد و رنج در آن *** کسی است که خلقتش از آن بوده، پس آسمانش\n\nجامه آتش خود را از نورش بر او می‌پوشاند *** از این رو بلای او در جان‌ها بزرگ می‌نماید.\n\n### [جهنم، زندان معطله و بستر کافران]\n\nبدان، خداوند ما و تو را حفظ کند، که جهنم از بزرگترین مخلوقات است و زندان خداوند در آخرت است. در آن، معطله (کسانی که صفات الهی را انکار می‌کنند) و مشرکان زندانی می‌شوند، و برای این دو گروه، سرای اقامت است؛ همچنین کافران، منافقان و مرتکبان گناهان کبیره از مؤمنان. خداوند متعال می‌فرماید: وَجَعَلْنَا جَهَنَّمَ لِلْكَافِرِينَ حَصِيرًا (و جهنم را برای کافران بستر و زندانی قرار دادیم). سپس کسانی که ذکر کردیم، به شفاعت و به منت الهی، و کسانی که نص الهی درباره‌شان آمده است، از آن خارج می‌شوند. جهنم را جهنم نامیدند به دلیل دوری قعرش؛ گفته می‌شود: چاه جَهنام است، اگر قعرش دور باشد. و آن شامل حرارت و زمهریر (سرمای شدید) است؛ پس در آن، سرما در نهایت درجاتش و حرارت در نهایت درجاتش وجود دارد. و فاصله میان بالاترین نقطه و قعر آن، صد و هفتاد و پنج سال است.\n\n### [آیا جهنم خلق شده یا هنوز خلق نشده است؟]\n\nمردم در مورد خلقت آن اختلاف نظر دارند که آیا خلق شده یا هنوز خلق نشده است، و این اختلاف مشهور است. هر یک از دو گروه برای اثبات نظر خود به آنچه نزدشان حجت است، استدلال می‌کنند. همچنین در مورد بهشت نیز اختلاف کرده‌اند. اما نزد ما و اصحاب ما، اهل کشف (کشف) و تعریف (شناخت)، جهنم و بهشت هم مخلوق هستند و هم نامخلوق. اما اینکه می‌گوییم مخلوق است، مانند مردی است که می‌خواهد خانه‌ای بسازد، پس تمام دیوارهای احاطه‌کننده آن را برپا می‌کند، و گفته می‌شود: خانه‌ای ساخته است. اما وقتی وارد آن می‌شود، جز دیواری که دور یک فضای باز و صحن کشیده شده، چیزی نمی‌بیند. سپس پس از آن، خانه‌ها را بر اساس نیازهای ساکنانش از اتاق‌ها، غرفه‌ها، سرداب‌ها، مهالک، انبارها و هر آنچه که باید در آن باشد و ساکن می‌خواهد از ابزارهایی که برای عذاب واردشوندگان به کار می‌رود، در آن قرار دهد، ایجاد می‌کند.\n\n### [حرارت و سوخت جهنم]\n\nو آن سرایی است که حرارتش هوای سوخته است و جز بنی‌آدم، سنگ‌هایی که به عنوان معبود گرفته شده‌اند و جنیان، هیچ اخگری ندارد. شعله‌اش (از این‌هاست). خداوند متعال می‌فرماید: وَقُودُهَا النَّاسُ وَالْحِجَارَةُ (سوخت آن مردم و سنگ‌ها هستند). و می‌فرماید: إِنَّكُمْ وَمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ حَصَبُ جَهَنَّمَ (همانا شما و آنچه به جای خدا می‌پرستید، هیزم جهنم هستید). و خداوند متعال می‌فرماید: فَكُبْكِبُوا فِيهَا هُمْ وَالْغَاوُونَ وَجُنُودُ إِبْلِيسَ أَجْمَعُونَ (پس در آن سرنگون شدند، آنان و گمراهان و همه لشکریان ابلیس). و ابزارها در آن با حدوث اعمال جن و انس که وارد آن می‌شوند، پدید می‌آیند.\n\n### [خداوند جهنم را با طالع ثور ایجاد کرد]\n\nو خداوند آن را با طالع ثور (برج گاو) ایجاد کرد، و به همین دلیل خلقت آن در صورت، دقیقاً به شکل گاومیش است. این همان چیزی است که نزد ما بر آن تکیه می‌شود و ابوالحکم بن برجان آن را در کشف (کشف) خود به این صورت دیده است. و برای برخی از اهل کشف (کشف) به صورت ماری مجسم شده است، پس گمان می‌کنند که آن صورت، همان صورتی است که خداوند آن را بر آن خلق کرده است، مانند ابوالقاسم بن قسی و امثال او. و هنگامی که خداوند متعال آن را خلق کرد، زحل در ثور بود و خورشید و مریخ در قوس بودند و سایر سیارات در جدی بودند. و خداوند آن را از تجلی (التجلی)\nسخن او در حدیث مسلم خلق کرد: «گرسنه شدم، پس مرا طعام ندادی؛ تشنه شدم، پس مرا سیراب نکردی؛ و بیمار شدم، پس مرا عیادت نکردی».\nاین بزرگترین نزولی است که حق (الحق) برای لطف به بندگانش فرود آمده است. پس جهنم از این حقیقت خلق شده است، خداوند ما و شما را از آن پناه دهد. به همین دلیل بر جباران سرکشی کرد و متکبران را درهم شکست.\n\n### [دردهای جهنم از صفت غضب الهی است که بر اهل آن نازل می‌شود]\n\nو تمام دردهایی که در آن خلق می‌شود و واردشوندگان به آن (از جن و انس) احساس می‌کنند، از صفت غضب الهی است. و این تنها هنگام ورود خلق به آن رخ می‌دهد. اما اگر کسی از اهل آن در آن نباشد، نه در خود جهنم و نه در فرشتگانش دردی وجود ندارد، بلکه جهنم و زبانیه‌های (مأموران عذاب) آن در رحمت خداوند غوطه‌ورند، لذت می‌برند و تسبیح می‌گویند: لَا يَفْتُرُونَ (سست نمی‌شوند). خداوند متعال می‌فرماید: وَلَا تَطْغَوْا فِيهِ فَيَحِلَّ عَلَيْكُمْ غَضَبِي وَمَنْ يَحْلِلْ عَلَيْهِ غَضَبِي فَقَدْ هَوَى (و در آن طغیان نکنید، که غضب من بر شما فرود آید، و هر که غضب من بر او فرود آید، قطعاً سقوط کرده است). یعنی غضب من بر شما نازل می‌شود. پس غضب را به خود نسبت داد. و هنگامی که غضب بر آنان نازل شود، آنان محل آن خواهند بود. و جهنم تنها مکانی برای آنان است و آنان واردشوندگان در آن هستند و محل غضب می‌باشند و غضب بر آنان نازل می‌شود. زیرا غضب در اینجا عین درد و رنج است. پس کسی که معرفت (المعرفة) ندارد و ادعای طریقت ما را می‌کند و می‌خواهد امر را با تمثیل، قدرت و تناسب در صفات بگیرد، می‌گوید: جهنم از قهر الهی خلق شده است و اسم «القاهر» (قاهر) پروردگار آن و متجلی بر آن است. اگر امر همان‌طور بود که او می‌گوید، جهنم به خود مشغول می‌شد و نمی‌توانست بر جباران تسلط یابد، که برای آن ایجاد شده است، و نمی‌توانست بگوید: هَلْ مِنْ مَزِيدٍ (آیا بیشتر هست؟) و نمی‌توانست بگوید: بعضی از من بعضی دیگر را خورد. پس نزول حق (الحق) با رحمتش به سوی آن، که وَسِعَتْ كُلَّ شَيْءٍ (همه چیز را فرا گرفته است)، و مهربانی‌اش، مجال را برای ادعا و تسلط بر کسی که بر کسی که این احسان را به آن کرده، سرکشی کرده است، گسترش داد. و تمام آنچه جهنم با کافران انجام می‌دهد، از باب شکر منعم است، زیرا بر آن نعمت داده است. پس جهنم از او سبحانه جز نعمت مطلق را نمی‌شناسد که با آنچه در مقابل آن است، آمیخته نیست. پس مردم در مورد خلقت آن در اشتباهند.\n\n### [منافقان در پست‌ترین طبقه جهنم]\n\nو از شگفت‌انگیزترین چیزهایی که از رسول خدا (صلی الله علیه و سلم) روایت کرده‌ایم:\nاین است که رسول خدا (صلی الله علیه و سلم) با اصحابش در مسجد نشسته بود، پس صدای مهیب عظیمی شنیدند و ترسیدند. رسول خدا (صلی الله علیه و سلم) فرمود: «آیا می‌دانید این صدای مهیب چیست؟» گفتند: خدا و رسولش داناترند. فرمود: «سنگی بود که هفتاد سال پیش از بالای جهنم پرتاب شد و اکنون به قعر آن رسید.»\nرسیدن آن به قعر و سقوطش در آن، همین صدای مهیب بود. سخن پیامبر (صلی الله علیه و سلم) تمام نشده بود که صدای شیون از خانه یکی از منافقان بلند شد که مرده بود و هفتاد سال عمر داشت.\nرسول خدا (صلی الله علیه و سلم) فرمود: «الله اکبر». پس علمای صحابه دانستند که این سنگ همان منافق است و از زمانی که خداوند او را خلق کرده، در آتش جهنم سقوط می‌کرده و عمرش به هفتاد سال رسید، پس وقتی مرد، در قعر آن قرار گرفت.\nخداوند متعال می‌فرماید: إِنَّ الْمُنَافِقِينَ فِي الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ (همانا منافقان در پست‌ترین طبقه از آتش هستند). پس شنیدن آن صدای مهیب که خداوند به آنان شناند تا عبرت گیرند، به همین دلیل بود. پس بنگر که کلام نبوت چقدر شگفت‌انگیز است و تعریف (شناخت) آن چقدر لطیف است و اشاره‌اش چقدر نیکو و کلامش (صلی الله علیه و سلم) چقدر شیرین است.\n\n### [جدال اهل آتش در آتش]\n\nو از خداوند خواستم که حالتی از شأن جهنم را برایم مجسم سازد، پس حالت جدال آنان در آن را برایم مجسم ساخت، که همان سخن خداوند متعال است: إِنَّ ذَلِكَ لَحَقٌّ تَخَاصُمُ أَهْلِ النَّارِ (همانا این حق است، جدال اهل آتش). و سخن خداوند متعال: قَالُوا وَهُمْ فِيهَا يَخْتَصِمُونَ تَاللَّهِ إِنْ كُنَّا لَفِي ضَلَالٍ مُبِينٍ (گفتند در حالی که در آن با هم جدال می‌کنند: به خدا سوگند، ما در گمراهی آشکاری بودیم) به دلیل گمراهی خود و معبودانشان، إِذْ نُسَوِّيكُمْ بِرَبِّ الْعَالَمِينَ (آنگاه که شما را با پروردگار جهانیان برابر می‌شمردیم). وَمَا أَضَلَّنَا إِلَّا الْمُجْرِمُونَ (و ما را گمراه نکردند مگر مجرمان). و مجرمان همان اهل آتش هستند که ساکنان آنند و از آن خارج نمی‌شوند. آنان از کسانی که به شفاعت شفاعت‌کنندگان و عنایت ازلی الهی در موحدان از آن خارج می‌شوند، جدا می‌گردند.\n\n### [رحمت کامل در دریافت از نبوت و توقف در مرز کتاب و سنت]\n\nپس این حالت در یک زمان برای من مجسم شد. جدال آنان در آنجا را جز به جدال اصحاب اختلاف در مناظراتشان تشبیه نکردم، هنگامی که یکی از آنان استدلال می‌کند. پس وقتی آن را دیدم، حالتی را که خداوند مرا بر آن مطلع ساخت، به یاد آوردم و تمام رحمت را در تسلیم و دریافت از نبوت و توقف در مرز کتاب و سنت دیدم. و مردم از\nسخن پیامبر (صلی الله علیه و سلم) غافل شدند: «نزد پیامبر، سزاوار نیست که نزاعی باشد».\nو حضور حدیث او (صلی الله علیه و سلم) مانند حضور خود اوست؛ سزاوار نیست که هنگام ایراد آن نزاعی باشد و شنونده صدایش را هنگام نقل حدیث نبوی بالا ببرد، زیرا خداوند می‌فرماید: لَا تَرْفَعُوا أَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ (صدای خود را بالاتر از صدای پیامبر نبرید). و نزد اهل الله، فرقی بین صدای پیامبر یا حکایت قول او نیست. پس ما را چاره‌ای نیست جز آماده شدن برای پذیرش آنچه محدث از کلام نبوت می‌آورد، بدون جدال؛ چه آن حدیث پاسخ به سؤالی باشد یا آغاز کلامی. پس توقف در مرز کلام او در مسئله یا واقعه‌ای واجب است. هرگاه گفته شد: «خداوند فرمود» یا «رسول خدا (صلی الله علیه و سلم) فرمود»، باید پذیرفته شود و شنونده ادب کند و صدایش را بر صدای محدث بالا نبرد، هنگامی که آنچه را خداوند فرموده می‌گوید یا حدیث را از رسول خدا (صلی الله علیه و سلم) نقل می‌کند. خداوند متعال می‌فرماید: فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ (پس او را پناه ده تا کلام خدا را بشنود). و جز رسول خدا (صلی الله علیه و سلم) آن را تلاوت نکرده است و شنونده جز از او نشنیده است. سپس اگر شنونده در حال سخن گفتن با او مشارکت کند، شنونده نیست. زیرا از آدابی که خداوند پیامبرش (صلی الله علیه و سلم) را با آن ادب کرد، این سخن اوست: وَلَا تَعْجَلْ بِالْقُرْآنِ مِنْ قَبْلِ أَنْ يُقْضَى إِلَيْكَ وَحْيُهُ (و در [خواندن] قرآن پیش از آنکه وحی آن بر تو تمام شود، شتاب مکن). و خداوند می‌فرماید: لَا تَرْفَعُوا أَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَلَا تَجْهَرُوا لَهُ بِالْقَوْلِ كَجَهْرِ بَعْضِكُمْ لِبَعْضٍ (صدای خود را بالاتر از صدای پیامبر نبرید و با او بلند سخن نگویید، همانند بلند سخن گفتن برخی از شما با برخی دیگر). و بر این کار به حبط عمل (باطل شدن عمل) تهدید کرده است، از جایی که انسان متوجه نمی‌شود. زیرا او در رد و جدال خود گمان می‌کند که از دین خدا دفاع می‌کند، و این از مکر خداست که در مورد آن فرمود: سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ (به تدریج آنان را از جایی که نمی‌دانند، به سوی عذاب می‌کشانیم). و فرمود: وَمَكَرْنَا مَكْرًا وَهُمْ لَا يَشْعُرُونَ (و مکر کردیم، در حالی که آنان درک نمی‌کردند). پس مؤمن عاقل و خیرخواه نفس خود، هرگاه شنید کسی می‌گوید: «خداوند متعال فرمود» یا «رسول خدا (صلی الله علیه و سلم) فرمود»، باید سکوت کند، گوش فرا دهد، ادب کند و آنچه را خداوند یا رسولش (صلی الله علیه و سلم) فرموده، بفهمد. خداوند می‌فرماید: وَإِذَا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوا لَهُ وَأَنْصِتُوا لَعَلَّكُمْ تُرْحَمُونَ (و چون قرآن خوانده شود، به آن گوش فرا دهید و خاموش باشید، باشد که مورد رحمت قرار گیرید). پس امید (ترجی) را با این صفت همراه کرد و به رحمت قطعیت نداد. پس حال کسی که جدال می‌کند و صدایش را بالا می‌برد و با تلاوت‌کننده در کلامش مداخله می‌کند و حدیث نبوی را رد می‌کند، چگونه است؟ و امیدوارم که این امید الهی، همان‌طور که علما می‌بینند، واجب باشد.\n\n### [رؤیاهای غیبی و اکتشافات علمی]\n\nو هنگامی که این محل را مشاهده کردم، شگفتی دیدم. و در این رؤیا، دیدم که آب بر هوا تکیه دارد، و این از شگفت‌انگیزترین چیزها در آبادانی حیزها (فضاها) است، و اینکه دو جوهر در یک حیز (فضا) قرار نمی‌گیرند و حیز (فضا) را تنها یک جوهر اشغال می‌کند. و در این رؤیا، ابطال توالد (تولید مثل) را دانستم و اینکه محرک اشیاء، خداوند متعال است و سبب، به طور کلی هیچ اثری در فعل ندارد. و در این رؤیا دانستم که لطیف‌تر از غلیظ‌تر قوی‌تر است؛ زیرا هوا بدون شک لطیف‌تر از آب است، و آن را منع کرد و آب در قدرت با آن مقاومت نکرد و هوا مانع نزول آب شد. زیرا خود را در هوا دیدم و آب بالای سرم بود و هوا مانع نزول آن به زمین می‌شد. و در این رؤیا، علوم بسیار زیادی را دانستم.\nو در این رؤیا، درکاتی (طبقاتی) از اهل آتش را دیدم، از جهت اینکه جهنم است نه از جهت اینکه آتش است، به مقداری که خداوند خواست مرا بر آن مطلع سازد. و در آن موضعی به نام «المظلمة» (تاریک‌خانه) دیدم که به اندازه پنج درجه پایین رفتم و مهالک آن را دیدم. سپس به بالا در آب پرتاب شدم و از آن عبور کردم و شگفتی دیدم. و از احوال جدالشان دانستم، آنجا که در جحیم (آتش سوزان) با هم جدال می‌کنند، و اینکه آن جدال، عین عذابشان در آن حال است. و عذابشان در جهنم از خود جهنم نیست، بلکه جهنم سرای سکونت و زندان آنان است و خداوند هرگاه بخواهد، دردها را در آنان خلق می‌کند. پس عذابشان از جانب خداست و آنان محل آن هستند.\n\n### [هفت در جهنم و نگهبانان آن]\n\nو خداوند برای جهنم هفت در خلق کرده است. برای هر در، بخشی از عالم و بخشی از عذاب تقسیم شده است. و این هفت در باز هستند. و در هشتمی در آن است که بسته است و باز نمی‌شود، و آن باب حجاب از رؤیت حق (الحق) متعال است. و بر هر در، فرشته‌ای از فرشتگان آسمان‌های هفت‌گانه گمارده شده است. من نام‌های آنان را در آنجا شناختم، اما از حفظ من رفت، جز اسماعیل که در یادم باقی ماند.\n\n### [ستارگان در جهنم، اجرام تاریک]\n\nو اما ستارگان، همه در جهنم اجرام تاریک و عظیم‌الخلق هستند. همچنین خورشید و ماه. و طلوع و غروب برای آن‌ها در جهنم دائمی است. پس خورشید آنجا «شارقه» (طلوع‌کننده) است نه «مشرقه» (نوردهنده). و تکوینات (پدیده‌ها) از سیر آن بر حسب آنچه شایسته آن سرا از کائنات است و آنچه از صورت‌ها در تبدیل و پراکندگی در آن تغییر یافته، صورت می‌گیرد. و به همین دلیل خداوند متعال فرمود: النَّارُ يُعْرَضُونَ عَلَيْهَا غُدُوًّا وَعَشِيًّا (آتش است که هر صبح و شام بر آن عرضه می‌شوند). و این حالت مستمر است. پس در برزخ، عرضه شدن است و در سرای آخرت، دخول است. پس ذات ستارگان در آنجا، صورتشان دقیقاً مانند کسوف (گرفتگی) نزد ماست، جز اینکه وزن آن حرکات در آن سرا، خلاف میزان امروز آن‌هاست. زیرا کسوف آن‌ها زایل نمی‌شود و آن گرفتگی در ذات خودشان است نه در چشمان ما. و هوا در آنجا دارای تطفيف (کاستی) است، پس بین دیدگان و درک تمام نورها حائل می‌شود. پس چشم‌ها ستارگان پراکنده را می‌بینند که اجرامشان نورانی نیست، همان‌طور که قطعاً می‌دانیم خورشید در اینجا در ذات خود نورانی است و این حجاب قمری است که مانع می‌شود چشم آن را یا نور ماه یا آنچه گرفته شده است را درک کند. و به همین دلیل، در زمان کسوف چیزی از آن‌ها در یک موضع، در موضع دیگر بیشتر از آن است و در موضع دیگر اصلاً چیزی نیست. پس چون دیدگان در درک آن به دلیل اختلاف مکان‌ها متفاوت شدند، قطعاً دانستیم که امری عارضی در راه رخ داده که بین چشم و آن یا بین نور آن حائل شده است، مانند ماه که بین تو و درک جرم خورشید حائل می‌شود، و سایه زمین که بین تو و نور ماه حائل می‌شود، نه بین تو و جرم آن، همان‌طور که ماه بین تو و جرم خورشید حائل شد. و این بر حسب آنچه از تو و از آن باشد. و همچنین سایر ستارگان. وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ (ولی بیشتر مردم نمی‌دانند)، همان‌طور که إِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ (همانا بیشتر مردم ایمان نمی‌آورند). زیرا آن کسوف، با تمام انواع مختلفش، خشوعی است از سوی آن جرم گرفته شده در برابر تجلی (التجلی) الهی که برایش حاصل شده است.\n\n### [مرزهای جهنم پس از حساب و ورود به بهشت]\n\nو مرز جهنم پس از فراغت از حساب و ورود اهل بهشت به بهشت، از مقعر فلک ستارگان ثابت تا اسفل سافلین (پست‌ترین طبقات) است. پس تمام این‌ها به جهنم اضافه می‌شود، از آنچه اکنون در آن خلق نشده است، اما مهیا شده تا ظاهر شود. مگر مکان‌هایی که خداوند از زمین مشخص کرده است، زیرا آن‌ها در روز قیامت به بهشت باز می‌گردند، مانند روضه‌ای که بین منبر رسول خدا (صلی الله علیه و سلم) و قبر او (صلی الله علیه و سلم) است، و هر مکانی که شارع (قانون‌گذار) مشخص کرده است، و هر رودخانه‌ای، زیرا تمام این‌ها به سوی بهشت می‌روند. و آنچه باقی می‌ماند، تماماً آتش می‌شود و از جهنم است. و به همین دلیل بود که عبدالله بن عمر هرگاه دریا را می‌دید، می‌گفت: «ای دریا، کی آتش می‌شوی؟» و خداوند متعال می‌فرماید: وَإِذَا الْبِحَارُ سُجِّرَتْ (و هنگامی که دریاها برافروخته شوند)، یعنی برافروخته شوند و آتش گیرند، از «سجرت التنور» (تنور را برافروختم). و ابن عمر وضو گرفتن با آب دریا را ناپسند می‌دانست و می‌گفت: «تیمم نزد من محبوب‌تر از آن است.»\n\n### [دیدن حقیقی اشیاء و حکم صحیح بر آن‌ها]\n\nو اگر خداوند امروز از دیدگان خلق پرده برمی‌داشت، آن را می‌دیدند که آتش می‌گیرد. اما خداوند آنچه را می‌خواهد، آشکار می‌کند و آنچه را می‌خواهد، پنهان می‌سازد تا دانسته شود: أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (که همانا خداوند بر هر چیزی تواناست) و أَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا (و همانا خداوند بر هر چیزی احاطه علمی دارد). و بیشتر این امر برای اهل ورع (پرهیزکاری) رخ می‌دهد، پس صاحب ورع محفوظ، طعام حرام را به صورت خوک یا نجاست می‌بیند و نوشیدنی را به صورت شراب، و در آنچه می‌بیند شک نمی‌کند، در حالی که همنشین او آن را قرص نان خوب و نوشیدنی را آب گوارا می‌بیند. پس ای کاش می‌دانستم که صاحب حس صحیح کیست؟ آیا کسی که حکم شرعی را به صورت (ظاهری) درک کرده یا کسی که محسوس را طبق عادت در حال خود درک کرده است؟\n\n### [مذهب معتزله در حسن و قبح]\n\nو این امر، مذهب معتزله را تقویت می‌کند که قبیح به ذات خود قبیح است و حسن به ذات خود حسن است، و ادراک صحیح تنها برای کسی است که نوشیدنی حرام را شراب درک کرده است. اگر قبیح به ذات خود قبیح نبود، این کشف (کشف) برای صاحبش صحیح نمی‌بود. و اگر قبح آن تنها عین تعلق خطاب به حرمت و قبح بود، آن طعام به صورت خوک ظاهر نمی‌شد، زیرا فعل از مکلف سر نزده است، بلکه خداوند صورت آن را برای او آشکار کرده و نشان داده که قبیح است تا بر خوردن آن اقدام نکند. و این دقیقاً در مورد کسی که آن را به صورت طعام بر حالت عادی‌اش درک می‌کند، قابل تصور است، اما آن (دیدن به صورت خوک) در شرع سزاوارتر است. پس قطعاً دانسته می‌شود که کسی که آن را به صورت طعام بر عادتش می‌بیند، بین او و حقیقت حکم شرع در قبح آن حائل شده است. و اگر شیء به قبح وضعی (قراردادی) قبیح بود، سخن شارع در خبر دادن از آن که قبیح یا حسن است، صادق نمی‌بود. زیرا آن خبر دادن از شیء بر خلاف آنچه هست، می‌بود. زیرا احکام\nاخبار هستند، بدون شک نزد هر عاقل آگاه به کلام. زیرا خداوند به ما خبر داده که این حرام است و این حلال. و به همین دلیل خداوند متعال در مذمت کسانی که چیزی را به خدا نسبت دادند که نگفته است، می‌فرماید: وَلَا تَقُولُوا لِمَا تَصِفُ أَلْسِنَتُكُمُ الْكَذِبَ هَذَا حَلَالٌ وَهَذَا حَرَامٌ لِتَفْتَرُوا عَلَى اللَّهِ الْكَذِبَ (و به دروغ‌هایی که بر زبان شما جاری می‌شود، نگویید این حلال است و این حرام، تا بر خدا دروغ ببندید). پس حکم را به خبر ملحق کرد، زیرا بدون شک خبر است. جز اینکه در قدرت بشر نیست که در بیشتر اشیاء، قبح یا حسن آن‌ها را درک کند. پس هرگاه حق (الحق) را به واسطه آن‌ها شناختیم، آن‌ها را می‌شناسیم. و برخی از آن‌ها قبحشان عقلاً در عرف ما درک می‌شود، مانند دروغ و کفران نعمت، و حسنشان عقلاً درک می‌شود، مانند راستگویی و شکر منعم. و اینکه گناه به برخی از انواع راستگویی تعلق می‌گیرد و پاداش به برخی از انواع دروغ، این امر برای خداست که بر هر قبح و حسنی که بخواهد، پاداش می‌دهد. و این دلالت بر حسن یا قبح شیء نمی‌کند، مانند دروغ گفتن برای نجات مؤمنی از هلاکت که انسان بر آن پاداش می‌گیرد، اگرچه دروغ در ذات خود قبیح است. و راستگویی مانند غیبت است که انسان به واسطه آن گناهکار می‌شود، اگرچه راستگویی در ذات خود حسن است. پس آن امری شرعی است که فضل خود را به هر که بخواهد می‌دهد و از هر که بخواهد منع می‌کند، چنانکه فرمود: يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشَاءُ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ (رحمت خود را به هر که بخواهد اختصاص می‌دهد، و خداوند صاحب فضل بزرگ است).\n\n### [مرتبه نفس و تنفس و ارتباط مرگ با زندگی]\n\nو بدان که شدیدترین خلق از نظر عذاب در آتش، ابلیس است که شرک و هرگونه مخالفت را سنت نهاد. و سبب آن این است که او از آتش خلق شده است، پس عذاب او به واسطه چیزی است که از آن خلق شده است. آیا نمی‌بینی که حیات جسم حساس به واسطه نفس (دم) است؟ پس اگر با حلق‌آویز کردن یا خفگی، خروج آن نفس منع شود، به قلب باز می‌گردد و در همان لحظه آن را می‌سوزاند، پس فوراً هلاک می‌شود. پس حیاتش به واسطه نفس بود و هلاکتش نیز به واسطه آن بود. و هلاکت او در حقیقت به واسطه نفس از جهت متنفّس (نفس‌کشنده) بودن است، نه از جهت صاحب نفس بودن، و نه فقط از جهت متنفّس بودن، بلکه از جهت اینکه با نیروی جاذبه، نفس هوای سرد را به قلب خود می‌کشد و با نیروی دافعه، نفس گرم و سوزان را خارج می‌کند، قلبش ایمن می‌ماند. پس سبب این احوال، حیات او به واسطه آن‌هاست.\n\n### [شدیدترین مردم از نظر عذاب در آتش]\n\nپس کسی که در آتش افکنده می‌شود، متنفّس (نفس‌کشنده) است، اما از یکی از دو حالت خارج نیست: یا در آتش نفس نمی‌کشد، پس حالتش مانند حال حلق‌آویز شده‌ای است که با طناب خفه می‌شود و نفسش او را می‌کشد. و یا نفس می‌کشد، پس با نیروی جاذبه، هوای آتشین سوزان را می‌کشد که وقتی به قلبش می‌رسد، آن را می‌سوزاند. به همین دلیل گفتیم که سبب حیات، تمام این امور است. پس عذاب ابلیس در جهنم به واسطه زمهریر (سرمای شدید) است، زیرا زمهریر در مقابل آتشی قرار می‌گیرد که اصل نشأت ابلیس است. پس عذاب او به واسطه زمهریر و به واسطه آتشی است که در او از رکن هوا، آب و خاک ترکیب شده است. پس ناگزیر است که به مقدار مخصوصی با آتش عذاب شود. و عمده عذاب او به واسطه چیزی است که با آنچه در اصل خلقتش غالب است، متناقض است. و آتش دو نوع است: آتش حسی، که بر احساس، حیوانیت، ظاهر و باطن جسم او مسلط است؛ و آتش معنوی، که بر دل‌ها آگاه می‌شود (تطلع على الأفئدة) و روح او که مدبر کالبدش است و امر شد و نافرمانی کرد، به واسطه آن عذاب می‌بیند. پس مخالفت او، او را عذاب داد و آن عین جهل او به کسی است که بر او تکبر ورزید.\n\n### [روز تغابن: روز عذاب جان‌ها]\n\nپس هیچ عذابی بر ارواح شدیدتر از جهل نیست، زیرا تماماً غبن (زیان) است. و به همین دلیل نامیده شده است: يَوْمُ التَّغَابُنِ (روز تغابن). یعنی روز عذاب جان‌ها، که می‌گوید: يَا وَيْلَتَا عَلَى مَا فَرَّطْتُ (ای وای بر من به خاطر کوتاهی‌هایی که کردم). و آن يَوْمَ الْحَسْرَةِ (روز حسرت) است. می‌گوید: روز کشف، از «حسرت عن الشیء» (از چیزی پرده برداشتم). پس گویی می‌گوید: ای کاش در دنیا از این امر پرده برمی‌داشتم تا بر کار خود بصیرت می‌داشتم. پس در نفس خود زیان می‌بیند. و تغابن در آن روز شامل همه، مطیع و عاصی، می‌شود. مطیع می‌گوید: ای کاش تمام تلاشم را می‌کردم و حق استطاعتم را ادا می‌نمودم و در کلام پروردگارم تدبر می‌کردم و به مقتضای آن عمل می‌کردم، با وجود اینکه سعادتمند است. و مخالف می‌گوید: ای کاش در آنچه پروردگارم به من امر و نهی کرد، مخالفت نمی‌کردم. پس ذَلِكَ يَوْمُ التَّغَابُنِ (آن روز تغابن است). و این در باب روز قیامت خواهد آمد، ان شاء الله.\n\n### [جهنم: دردهای اهل آن صفت غضب الهی و وجود آن محل تنزل رحمانی است]\n\nو اینکه مرتبه نفس و تنفس را به تو اعلام کردیم، تنها برای این بود که بدانی جهنم از آن جهت که دردهای اهلش صفت غضب الهی را به خود اختصاص داده است و وجودش تنزل رحمانی الهی را به خود اختصاص داده است، و در خبر صحیح آمده است: «نفس الرحمن» (دم رحمان) که مشعر به صفت غضب است.\nپس تنفس، صفت غضب را به کسی که بر او نازل شده، ملحق می‌کند. و به همین دلیل، هنگامی که «نفس الرحمن» از سوی یمن آمد، غضب الهی بر کافران با قتل و شمشیری که انصار بر آنان وارد کردند، نازل شد. پس خداوند با آن، از دین و پیامبرش (صلی الله علیه و سلم) نفس کشید (آسودگی داد). زیرا صاحب غضب، هنگامی که بر کسی که غضبش را بر او می‌فرستد، غلبه یابد، آنچه از درد غضب می‌یابد، از او نفس می‌کشد (آسوده می‌شود). و این صورت در محمد (صلی الله علیه و سلم) کامل شد، پس او به خاطر رد کلمه الله، صفت غضب را بر کافران اقامه کرد. پس «نفس الرحمن» با شمشیری که به او امر کرد و با اصحاب و انصارش، از او نفس کشید (آسودگی داد). پس او آسودگی یافت، زیرا جایی را یافت که غضبش را بر آن بفرستد. پس از این، دردهای اهل آتش و صورت حجابی محمدی بر غضب الهی بر دشمنان خدا را بفهم. و اینکه دردها بر دشمنان فرستاده شد و بر آنان اقامه گشت، و خداوند از دین خود که امر و کلام اوست و عین علم او در خلقش است و علم او ذات اوست، نفس کشید (آسودگی داد). و ما امر جهنم را از حیث اینکه سرای است، برای تو بیان کردیم. پس ان شاء الله در باب بعدی، مراتب اهل آتش را بیان خواهیم کرد.\n\n### [صد طبقه جهنم و زبانیه‌های آن]\n\nسپس بدان که خداوند در جهنم صد درک (طبقه زیرین) قرار داده است، در مقابل درجات بهشت. و برای هر درک، گروهی مخصوص هستند که دردهای مخصوصی از غضب الهی که بر آنان نازل شده، دارند. و متولی عذاب آنان از والیانی که در باب قبل از این کتاب ذکر کردیم، عبارتند از: القائم، الإقلید، الحامد، النائب، السادن و الجابر. پس این فرشتگان از والیان، کسانی هستند که عذاب را به اذن خداوند متعال بر آنان می‌فرستند. و مالک، خزانه‌دار است. اما بقیه والیان به همراه این‌هایی که ذکر کردیم، یعنی الحائر، السائق، الماتح، العادل، الدائم و الحافظ، همگی با اهل بهشت خواهند بود. و خزانه‌دار بهشت، رضوان است. و امدادرسانی آنان به اهل آتش، مانند امدادرسانی‌شان به اهل بهشت است، زیرا آنان را با حقایق خود امداد می‌کنند و حقایق آنان تفاوتی ندارد. پس هر گروه از اهل دو سرا، بر حسب آنچه نشأتشان به آنان می‌دهد، از آنان می‌پذیرند. پس عذاب به واسطه همان چیزی رخ می‌دهد که نعمت به واسطه آن رخ می‌دهد، به دلیل محل (دریافت‌کننده)، همان‌طور که در مورد فرد سردمزاج گفتیم که از گرمای خورشید متنعم می‌شود و فرد گرم‌مزاج از گرمای خورشید عذاب می‌بیند. پس عین همان چیزی که نعمت به واسطه آن رخ داد، عین درد به واسطه آن برای دیگری رخ داد. پس خداوند ما را نشأت نعماء بخشد، چنانکه در حق نیکوکاران فرمود: تَعْرِفُ فِي وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ (در چهره‌هایشان شادابی نعمت را می‌شناسی). یعنی آنان در خلقت خود بر این صفت هستند. و نشأت اهل آتش با نشأت اهل بهشت متفاوت است. زیرا نشأت بهشت تنها از حق (الحق) سبحانه و به دست والیان خاص است. و نشأت اهل آتش به دست والیان، حجاب، نقیبان و سدنه (خدمتگزاران) است، با وجود کثرتشان، که تعدادشان را جز خدا نمی‌داند. و برای هر فرشته‌ای از آنان در این نشأت دنیوی، نشأت آتش و نشأت اهل آن، حکمی است که خداوند او را در آن مسخر کرده است. پس آنان مانند کارگران در پادشاهی و ایجاد سرای بنا شده هستند. و ان شاء الله ذکر بهشت و آنچه در آن است، خواهد آمد. وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}