{
  "id": 402,
  "title": {
    "ar": "الباب الثاني وأربعمائة في معرفة منازلة من غالبني غلبته ومن غالبته غلبني فالجنوح إلى السلم أولى",
    "en": "Chapter Four Hundred and Two: Concerning the Knowledge of the Spiritual Engagement (منازلة) with that which, if it overcomes me, I overcome it, and if I overcome it, it overcomes me; therefore, the inclination toward peace (السلم) is more appropriate.",
    "ur": "باب چار سو دو: اس روحانی مجادلے (منازلة) کی معرفت میں کہ جس نے مجھ پر غلبہ پایا، میں نے اس پر غلبہ پایا، اور جس پر میں نے غلبہ پایا، اس نے مجھ پر غلبہ پایا، لہٰذا صلح کی طرف مائل ہونا اولیٰ ہے۔",
    "fa": "باب چهارصد و دوم در معرفت (المعرفة) منازلت (منازلة) کسی که بر من چیره شود، بر او چیره می‌شوم، و کسی که بر او چیره شوم، بر من چیره می‌شود؛ پس گرایش به صلح (السلم) سزاوارتر است."
  },
  "content": {
    "ar": "## «الباب الثاني وأربعمائة في معرفة منازلة من غالبني غلبته ومن غالبته غلبني فالجنوح إلى السلم أولى»\n\n\n> من غالب الحق ما ينفك ذا نصب *** ولا يزال مع الأنفاس في تعب‏\n\n\n> فاجنح إلى السلم لا تجنح إلى الحرب *** وإن تحارب فخيل الله في الطلب‏\n\n\n> أني نصحتك فاسمع ما أفوه به *** إن الهلاكين مقرونان بالحرب‏\n> فاحذر فديتك أفلاكا تدور بما *** لا ترتضيه وخف مصارع النوب‏\n\n\n> لو جاءك الملأ العلوي مبتليا *** بالحرب سلم له وجد في الهرب‏\n\n\n> وانزع إليه وقل يا منتهى أملي *** أ لست تعلم أن العز في الحجب‏\n\n\nقال الله عز وجل وإِنْ جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَها وتَوَكَّلْ عَلَى الله‏\n\n\n### [إن للعبد التخلق بأوصاف الله‏]\n\n\nاعلم أنه قد تقرر عند أصحاب الأفكار أن لله صفات وأسماء لها مراتب وللعبد التخلق والتحلي بها على حد مخصوص ونعت منصوص عليه وحال معين إذا تعدى ذلك العبد كان للحق منازعا واستحق الإقصاء والطرد عن القرب السعادي كما ورد في‏\n\n\nقوله تعالى الكبرياء ردائي والعظمة إزاري من نازعني واحدا منهما قصمته‏\n\n\nوللعبد صفات وأسماء تليق به وقد داخله الحق في الاتصاف بها مما تحيله العقول ولكن وردت به الشرائع ووجب الايمان بها فلا يقال كيف مع إطلاقها عليه قربة وإيمانا من لم يقل بها وأنكرها فقد كفر ومرق من الإسلام ومن تأولها كان على قدم الغرور فلا نعلم نسبتها إلى الله إلا بإعلام الله وكذلك كل اسم تحلينا به من أسمائه أيضا مجهول النسبة إليه عندنا إلا أن بعلمنا الله فنعلم ذلك بإعلامه فالكل على السواء ما لنا وما له فلما عين ما عين له وتحلينا به سمي ذلك مغالبة منا للحق ولما عين ما عين لنا واتصف به سمي ذلك بغالبة من الحق وموضع الجنوح إلى السلم من هذا الأمر هو أن ترد الكل إليه فما أعطانا من ذلك ولو أعطانا الكل قبلناه على جهة الإنعام‏\n\n\n### [أن سبب المنازعة والمغالبة أمران الاستخلاف والخلق على الصورة]\n\n\nواعلم أن سبب المنازعة والمغالبة أمران الاستخلاف الذي هو الإمامة والخلق على الصورة فلا بد للخليفة أن يظهر بكل صورة يظهر بها من استخلفه فلا بد من إحاطة الخليفة بجميع الأسماء والصفات الإلهية التي يطلبها العالم الذي ولاة عليه الحق سبحانه ولما اقتضى الأمر ذلك أنزل أمرا منه إليه سماه شرعا بين فيه مصارف هذه الأسماء والصفات الإلهية التي لا بد للخليفة من الظهور بها وعهد إليه بها فكل نائب في العالم فله الظهور بجميع الأسماء ومن النواب من أخذ المرتبة بنفسه من غير عهد إلهي إليه بها وقام بالعدل في الرعايا واستند إلى الحق في ذلك كملوك زماننا اليوم مع الخليفة فمنهم السمع والطاعة فيما يوافق أغراضهم وما لا يوافق فهم فيه كما هم في أصل توليتهم ابتداء ومنهم من لا يعمل بمكارم الأخلاق ولا يمشي بالعدل في رعيته فذلك هو المنازع لحدود مكارم الأخلاق والمغالب لجناب الحق في مغالبته رسل الله كفرعون صاحب موسى عليه السلام وأمثاله والحق له الاقتدار التام لكن من نعوته الإمهال والحلم والتراخي بالمؤاخذة لا الإهمال فإذا أخذ لم يفلت وزمان عمر الحياة الدنيا زمان الصلح واستدراك الفائت والجبر بمن قام بمصالح الأمور المرضية عند الله تعالى المسماة خيرا الموافقة لما نزلت بها الشرائع غير أن هذا الإمام لم يتصف بها من حيث ما شرعت ولا من حيث ما أوصى الحق بها ولكن اتصف بها لكونها مكارم أخلاق عرفية عرف الحق قدرها وأثنى على من اتصف بها كما قال صَلَّى اللهُ عَليهِ وسَلَّم في تاريخ ميلاده عن كسرى وهو من جملة النواب الملوك‏\n\n\nقال ولدت في زمان الملك العادل‏\n\n\nفسماه ملكا ووصفه بالعدل وإن كان فيه على غير شرع منزل فهو صفة مرعية عند الله وسماهم ملوكا وإن كان الحق ما استخلفهم بالخطاب الإلهي على الكشف لكنهم نوابه من وراء الحجاب فإذا ظهروا بصفات ما ينبغي للملك أن يظهر بها ولم يوافق بها المصارف الإلهية التي شرعها الحق بالسنة الرسل نعت ذلك بالمنازع والمغالب فهما ظهر كانت الغلبة له ومهما ظهر عليه كانت الغلبة للحق فكان الحرب سجالا له وعليه وصورة السلم موافقة الحق في المصارف من غير اتباع وهذا كله فيمن قام في الملك بنفسه وأما ولاة الحق من الرسل فليس إلا العدل المحض ولا نتصور منازعة من أولئك صلوات الله عليهم وأما الأئمة الذين استنابهم الله واستخلفهم بتقديم الرسل إياهم على القيام بما شرع في عباده من الأحكام فهم على قسمين قسم يعدلون بصورة حق ولا يتعدون ما شرع لهم والقسم الآخر قائلون بما شرع لهم غير أنهم لم يرجعوا ما دعوا إليه في المصارف التي دعاهم الحق إليها وجاروا عن الحق في ذلك وعلموا أنهم جائرون قاسطون فهم من حيث الصورة الظاهرة مغالبون ومنازعون فيمهلهم الله لعلهم يرجعون ففي زمان ذلك الإمهال تظهر الغلبة لهم على الحق المشروع الذي يرضى من استخلفهم وفي وقت تكون الغلبة للحق عليهم بإقامة منازع في مقابلته يدعو إِلَى الْحَقِّ وإِلى‏ طَرِيقٍ مُسْتَقِيمٍ وإذا\nظهر هذا فقد أوجب الحق على عباده القتال معه والقيام في حقه ونصرته والأخذ على يد الجائر ولا يزال الأمر على ما قلناه حتى يأتي أمر الله وتنفذ الكلمة الحق ويتوحد الأمر وتعم الرحمة ويرجع الأمر كله إليه كما كان أول مرة ويرتفع بعض النسب ويبقى بعضها بحسب المحل والدار والنشأة التي تصير فيها وإليها فإن للزمان حكما وللمكان حكما وللحال حكما والله يقضي الحق وهُوَ خَيْرُ الْفاصِلِينَ فتزول المغالبة والمنازعة ويبقى الصلح والسلم في دار السلام إلى أبد لا ينقضي أمده بأزل لا يعينه أبده والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\n> إن الخليفة من كانت إمامته *** من صورة الحق والأسماء تعضده‏\n\n\n> ليس الخليفة من قامت أدلته *** من الهوى وهوى الأهواء يقصده‏\n\n\n> له التقدم بالمعنى وليس له *** توقيع حق ولا شرع يؤيده‏\n\n\n> فيدعي الحق والأسياف تعضده *** وهو الكذوب ونجم الحق يرصده‏\n\n",
    "en": "Chapter 402: Concerning the Knowledge of the Contest: He who contends with me, I overcome him; and he whom I contend with, overcomes me. Thus, inclining toward peace (السلم) is more fitting.\n\nHe who contends with The Real (الحق) will never cease to be in distress,\nNor will he ever cease to be in weariness with every breath.\n\nSo incline toward peace, do not incline toward war,\nFor if you fight, the cavalry of Allah is in pursuit.\n\nIndeed, I have advised you, so listen to what I utter,\nFor the two destructions are coupled with war.\nBeware, may I be your ransom, of spheres revolving with that\nWhich you do not approve, and fear the pitfalls of calamities.\n\nIf the Celestial Assembly comes to you testing you\nWith war, submit to it and strive in flight.\n\nAnd turn to Him and say, \"O ultimate goal of my hope,\nDo you not know that glory lies in veiling (الحجب)?\"\n\nAllah, the Mighty and Majestic, said: <<And if they incline to peace (السلم), then incline to it [also] and rely upon Allah>> (Quran 8:61).\n\n### [The Servant’s Assumption of the Character of Allah’s Attributes]\n\nKnow that it is established among the people of reflection (أصحاب الأفكار) that Allah has Attributes (صفات) and Names (أسماء) which possess Levels (المراتب). The servant (العبد) is meant to assume the character (التخلق) and adorn himself (التحلي) with them according to a specific limit, a stipulated description, and a defined state. If the servant exceeds this, he becomes a contender (منازعا) against The Real (الحق) and deserves exclusion and expulsion (الإقصاء والطرد) from the proximity of felicity (القرب السعادي), as mentioned in His saying:\n\nThe Mighty and Majestic says: \"Pride (الكبرياء) is My cloak (ردائي) and Grandeur (العظمة) is My wrapper (إزاري). Whoever contends with Me regarding one of them, I shall shatter him.\"\n\nThe servant also has attributes and names appropriate to him. The Real has entered into his description by these attributes in a way that intellects deem impossible, yet the revealed laws (الشرائع) have brought it, and belief in it is obligatory. Therefore, one should not ask \"how\" when these attributes are applied to him as an act of proximity (قربة) and faith (إيمانا). Whoever denies them and rejects them has committed disbelief and apostatized from Islam. And whoever interprets them stands upon the footing of delusion (الغرور). We only know the attribution of these qualities to Allah through Allah’s informing us (إعلام الله). Likewise, every Name with which we adorn ourselves from His Names is also unknown in its attribution to Him by us, unless Allah informs us, in which case we know it through His instruction. Thus, all are equal, what is ours and what is His. When He designated what was designated for Him, and we adorned ourselves with it, this was called our competition (مغالبة) with The Real. And when He designated what was designated for us, and He described Himself with it, this was called the competition from The Real. The point of inclining toward peace (الجنوح إلى السلم) in this matter is to refer everything back to Him. Whatever He grants us of that—even if He grants us the entirety—we accept it as a form of bestowal (إنعام).\n\n### [That the Cause of Contention and Competition is Twofold: Vicegerency and Creation upon the Form]\n\nKnow that the cause of contention (المنازعة) and competition (المغالبة) is twofold: Vicegerency (الاستخلاف), which is the Imamate (الإمامة), and creation upon the Form (الخلق على الصورة). The Vicegerent (الخليفة) must necessarily manifest in every form in which the One who appointed him manifests. Therefore, the Vicegerent must encompass all the Divine Names (الأسماء الإلهية) and Attributes (الصفات) that are required by the world (العالم) over which The Real, the Glorified, has appointed him. Since the matter necessitated this, He sent down an order from Himself to him, which He called the Law (شرعا). In it, He clarified the proper uses (مصارف) of these Divine Names and Attributes, with which the Vicegerent must necessarily manifest, and He entrusted them to him. Every deputy (نائب) in the world must manifest with all the Names.\n\nAmong the deputies are those who seized the rank (المرتبة) by themselves without a Divine covenant (عهد إلهي) and established justice (العدل) among the subjects, relying upon The Real in this, like the kings of our time today in relation to the Caliph. Some of them offer hearing and obedience in what aligns with their purposes, but in what does not align, they remain as they were at the beginning of their appointment. Others do not act according to noble character (مكارم الأخلاق) nor walk with justice among their subjects. That one is the contender against the limits of noble character and the competitor against the Divine Presence (جناب الحق) in his competition with the Messengers of Allah, like Pharaoh, the companion of Moses (peace be upon him), and his likes.\n\nThe Real possesses complete power (الاقتدار التام), but among His descriptions is granting respite (الإمهال), forbearance (الحلم), and delaying accountability (التراخي بالمؤاخذة), not negligence (الإهمال). When He seizes, He does not let go. The time span of the life of this world is the time of truce (الصلح), of recovering what was missed, and of restoration by those who uphold the affairs pleasing to Allah, which are called \"good\" and which conform to what the revealed laws brought. However, this Imam did not describe himself with these qualities from the perspective of their being legislated, nor from the perspective of The Real having commanded them, but rather he described himself with them because they are customary noble characters whose value The Real recognized and praised those who possessed them.\n\nAs the Prophet (peace and blessings of Allah be upon him) said regarding the date of his birth concerning Khosrau, who was one of the deputy kings: He said, \"I was born in the time of the just king.\" He named him a king and described him with justice, even though he was upon a law other than a revealed one. This is an attribute regarded by Allah. He called them kings, even though The Real did not appoint them as Vicegerents through direct Divine address (الخطاب الإلهي) via Unveiling (الكشف), but they are His deputies from behind the veil (الحجاب). If they manifest the attributes that a king ought to manifest, but do not align with the Divine uses that The Real legislated through the tongues of the Messengers, this is described as contention and competition. Whenever he prevails, the victory is his; and whenever he is prevailed upon, the victory belongs to The Real. Thus, the war is a fluctuating struggle for him and against him. The form of peace is conforming to The Real in the uses without following [the Law]. This is all concerning those who established themselves in kingship independently.\n\nAs for the appointees of The Real among the Messengers (الرسل), there is nothing but pure justice (العدل المحض), and we cannot conceive of contention from those (peace and blessings of Allah be upon them). As for the Imams (الأئمة) whom Allah appointed as Vicegerents by the Messengers’ presentation of them to uphold the judgments (الأحكام) legislated for His servants, they are of two types: One type acts justly according to the form of The Real and does not transgress what was legislated for them. The second type affirms what was legislated for them, yet they did not refer what they called to back to the proper uses to which The Real called them, and they deviated from The Real in that, knowing that they were deviating and unjust.\n\nThus, from the perspective of the outward form, they are competitors and contenders. Allah grants them respite so that perhaps they may return. During the time of this respite, victory appears to be theirs over the legislated Truth (الحق المشروع) that pleases the One who appointed them. At times, the victory belongs to The Real over them by establishing a contender in opposition who calls <<to the Truth (الحق) and to a straight path>> (Quran 46:30). When this appears, The Real has made it obligatory upon His servants to fight alongside him, to stand up for His right and His support, and to restrain the unjust one. The matter will continue as we have stated until the command of Allah comes, the word of Truth is executed, the affair becomes unified, mercy becomes universal, and the entire matter returns to Him as it was the first time. Some relationships will be lifted, and others will remain, according to the locus, the abode, and the existence (النشأة) into which and toward which one proceeds. For time has a ruling, place has a ruling, and state has a ruling. Allah decrees the Truth, and <<He is the best of deciders>> (Quran 6:57). Thus, competition (المغالبة) and contention (المنازعة) cease, and reconciliation and peace (السلم) remain in the Abode of Peace (دار السلام) forever, an eternity whose duration is not limited by an antecedent eternity. <<And Allah speaks the Truth, and He guides the way>> (Quran 33:4).\n\nIndeed, the Vicegerent (الخليفة) is he whose Imamate\nIs from the Form of The Real (صورة الحق), and the Names support him.\n\nThe Vicegerent is not he whose proofs are established\nBy caprice, and the inclination of desires seeks him.\n\nHe has precedence by meaning, but he does not have\nA signature of The Real nor a Law that confirms him.\n\nSo he claims The Real while swords support him,\nYet he is the liar, and the star of The Real watches him.",
    "ur": "باب چار سو دو (۴۰۲) اس شخص کے مقام کی معرفت میں جسے میں نے مغلوب کیا تو وہ غالب آیا، اور جسے میں نے مغلوب کیا تو میں غالب آیا، لہٰذا صلح کی طرف مائل ہونا زیادہ بہتر ہے۔\n\nجو ذات حق (الحق) سے مقابلہ کرتا ہے، وہ مشقت سے کبھی جدا نہیں ہوتا،\nاور ہر سانس کے ساتھ تھکاوٹ میں رہتا ہے۔\n\nپس صلح کی طرف مائل ہو، جنگ کی طرف مائل نہ ہو،\nاور اگر تم جنگ کرو گے تو اللہ کے گھوڑے تعاقب میں ہیں۔\n\nمیں نے تمہیں نصیحت کی ہے، پس سنو جو میں کہتا ہوں،\nبے شک ہلاکتیں جنگ کے ساتھ جڑی ہوئی ہیں۔\nپس بچو، میں تم پر قربان، ان گردش کرتے افلاک سے جو وہ لاتے ہیں\nجسے تم پسند نہیں کرتے، اور مصیبتوں کے میدانوں سے ڈرو۔\n\nاگر تمہارے پاس عالم بالا کی جماعت آزمائش کے لیے جنگ کے ساتھ آئے،\nتو اس کے سامنے ہتھیار ڈال دو اور فرار میں کوشش کرو۔\n\nاور اس کی طرف رجوع کرو اور کہو: اے میری آرزو کی انتہا،\nکیا تو نہیں جانتا کہ عزت پردوں میں ہے؟\n\nاللہ عزوجل نے فرمایا:\n**وَإِنْ جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَها وتَوَكَّلْ عَلَى الله‏**\n\"اور اگر وہ صلح کی طرف مائل ہوں تو تم بھی اس کی طرف مائل ہو جاؤ اور اللہ پر بھروسہ کرو۔\" (سورۃ الانفال، ۸:۶۱)\n\n### [بندے کے لیے اللہ کی صفات سے تخلق]\n\nجان لو کہ اہل فکر کے نزدیک یہ بات طے شدہ ہے کہ اللہ تعالیٰ کے لیے صفات اور اسماء ہیں جن کے مراتب ہیں، اور بندے کے لیے ان کے ساتھ ایک مخصوص حد، بیان کردہ صفت، اور متعین حال کے مطابق تخلق (تخلق) اور تحلی (آراستہ ہونا) ہے۔ جب بندہ اس حد سے تجاوز کرتا ہے تو وہ ذات حق (الحق) سے مقابلہ کرنے والا بن جاتا ہے اور سعادت مند قرب سے دوری اور دھتکار کا مستحق ٹھہرتا ہے، جیسا کہ اللہ تعالیٰ کے اس فرمان میں وارد ہوا ہے:\n\n**الْكِبْرِيَاءُ رِدَائِي وَالْعَظَمَةُ إِزَارِي مَنْ نَازَعَنِي وَاحِدًا مِنْهُمَا قَصَمْتُهُ**\n\"کبریاء میری چادر ہے اور عظمت میرا تہبند ہے، جس نے ان میں سے کسی ایک میں بھی مجھ سے مقابلہ کیا، میں نے اسے توڑ ڈالا۔\" (حدیث قدسی)\n\nاور بندے کے لیے ایسی صفات اور اسماء ہیں جو اس کے لائق ہیں، اور ذات حق (الحق) نے ان کے ساتھ متصف ہونے میں اس میں مداخلت کی ہے، جو عقلوں کے لیے محال ہے، لیکن وہ شرائع میں وارد ہوئی ہیں اور ان پر ایمان لانا واجب ہے۔ لہٰذا یہ نہیں کہا جا سکتا کہ یہ کیسے ممکن ہے، جبکہ ان کا اطلاق بندے پر قربت اور ایمان کے طور پر ہوتا ہے۔ جس نے ان کا اقرار نہ کیا اور انکار کیا، اس نے کفر کیا اور اسلام سے خارج ہو گیا۔ اور جس نے ان کی تاویل کی، وہ غرور کے قدم پر ہے۔ ہم اللہ کی طرف ان کی نسبت نہیں جانتے مگر اللہ کے بتانے سے۔ اسی طرح، ہر وہ اسم جس سے ہم اس کے اسماء میں سے آراستہ ہوئے ہیں، ہمارے نزدیک اس کی نسبت بھی مجہول ہے، مگر یہ کہ اللہ ہمیں علم دے، تو ہم اس کے بتانے سے اسے جان لیتے ہیں۔ پس سب برابر ہیں، جو ہمارا ہے اور جو اس کا ہے۔ جب وہ چیز متعین ہوئی جو اس کے لیے متعین تھی اور ہم نے اس سے تحلی اختیار کی، تو اسے ہماری طرف سے ذات حق (الحق) سے مغالبہ (مقابلہ) کہا گیا۔ اور جب وہ چیز متعین ہوئی جو ہمارے لیے متعین تھی اور اس نے اس سے اتصاف کیا، تو اسے ذات حق (الحق) کی طرف سے مغالبہ کہا گیا۔ اس معاملے میں صلح کی طرف مائل ہونے کی جگہ یہ ہے کہ تم سب کچھ اسی کی طرف لوٹا دو۔ پس جو کچھ بھی وہ ہمیں اس میں سے عطا کرے، اگرچہ وہ سب کچھ عطا کر دے، ہم اسے انعام کے طور پر قبول کریں۔\n\n### [منازعت اور مغالبہ کا سبب دو چیزیں ہیں: استخلاف اور صورت پر تخلیق]\n\nاور جان لو کہ منازعت (مقابلے) اور مغالبہ (غلبہ پانے) کے دو سبب ہیں: استخلاف (خلافت) جو کہ امامت ہے، اور صورت پر تخلیق (الخلق على الصورة)۔ پس خلیفہ کے لیے ضروری ہے کہ وہ ہر اس صورت میں ظاہر ہو جس میں اسے خلیفہ بنانے والا ظاہر ہوتا ہے۔ لہٰذا خلیفہ کے لیے ان تمام اسماء اور صفات الٰہیہ کا احاطہ کرنا ضروری ہے جن کا تقاضا وہ عالم کرتا ہے جس پر ذات حق (الحق) سبحانہ نے اسے والی بنایا ہے۔ اور جب اس امر نے یہ تقاضا کیا، تو اس نے اپنی طرف سے ایک حکم اس کی طرف نازل کیا جسے شریعت (شرع) کا نام دیا، جس میں ان اسماء اور صفات الٰہیہ کے مصارف (استعمال کی جگہوں) کو بیان کیا جن کے ساتھ خلیفہ کا ظاہر ہونا ضروری ہے، اور اس کا عہد اس سے لیا۔\n\nپس عالم میں ہر نائب کے لیے تمام اسماء کے ساتھ ظاہر ہونا ممکن ہے۔ اور نائبین میں سے کچھ ایسے ہیں جنہوں نے بغیر کسی الٰہی عہد کے خود ہی یہ مرتبہ حاصل کر لیا اور رعایا میں عدل قائم کیا اور اس میں ذات حق (الحق) پر بھروسہ کیا، جیسے آج کل کے بادشاہ خلیفہ کے ساتھ ہیں۔ ان میں سے کچھ ایسے ہیں جو ان چیزوں میں سنتے اور اطاعت کرتے ہیں جو ان کے مقاصد کے موافق ہوں، اور جو موافق نہ ہوں، تو وہ اس میں ویسے ہی ہیں جیسے وہ اپنی ابتدائی ولایت میں تھے۔\n\nاور ان میں سے کچھ ایسے ہیں جو مکارم اخلاق پر عمل نہیں کرتے اور اپنی رعیت میں عدل کے ساتھ نہیں چلتے۔ پس وہی مکارم اخلاق کی حدود سے مقابلہ کرنے والا اور ذات حق (الحق) کی جناب سے مغالبہ کرنے والا ہے، جیسا کہ اللہ کے رسولوں سے مقابلہ کرنے والے فرعون، موسیٰ علیہ السلام کا ساتھی، اور اس کے امثال۔ اور ذات حق (الحق) کو کامل قدرت حاصل ہے، لیکن اس کی صفات میں سے مہلت دینا، بردباری، اور مؤاخذے میں تاخیر کرنا ہے، نہ کہ غفلت برتنا۔ پس جب وہ پکڑتا ہے تو چھوڑتا نہیں۔\n\nاور دنیاوی زندگی کی عمر کا زمانہ صلح کا زمانہ ہے، اور فوت شدہ کی تلافی کا، اور ان لوگوں کے ذریعے جبر کا جو اللہ تعالیٰ کے نزدیک پسندیدہ امور کی مصلحتوں کو قائم کرتے ہیں، جنہیں خیر کہا جاتا ہے اور جو ان چیزوں کے موافق ہیں جن کے ساتھ شرائع نازل ہوئیں۔ مگر یہ کہ یہ امام ان صفات سے اس حیثیت سے متصف نہیں ہوا کہ وہ شریعت میں مقرر کی گئی ہیں، اور نہ اس حیثیت سے کہ ذات حق (الحق) نے ان کی وصیت کی ہے، بلکہ وہ ان سے اس لیے متصف ہوا کہ وہ عرفی مکارم اخلاق ہیں جن کی قدر ذات حق (الحق) نے پہچانی اور ان سے متصف ہونے والے کی تعریف کی۔ جیسا کہ نبی اکرم صلی اللہ علیہ وسلم نے اپنی ولادت کی تاریخ کے بارے میں کسریٰ کے متعلق فرمایا، جو کہ نائبین بادشاہوں میں سے تھا:\n\n**وُلِدْتُ فِي زَمَانِ الْمَلِكِ الْعَادِلِ**\n\"میں عادل بادشاہ کے زمانے میں پیدا ہوا۔\" (حدیث)\n\nپس آپ صلی اللہ علیہ وسلم نے اسے بادشاہ کہا اور عدل کے ساتھ متصف کیا، اگرچہ وہ کسی نازل شدہ شریعت پر نہیں تھا، پھر بھی وہ اللہ کے نزدیک ایک مرعی (قابل لحاظ) صفت ہے۔ اور آپ صلی اللہ علیہ وسلم نے انہیں بادشاہ کہا، اگرچہ ذات حق (الحق) نے انہیں کشف (الکشف) کے ذریعے الٰہی خطاب سے خلیفہ نہیں بنایا، لیکن وہ پردے کے پیچھے سے اس کے نائبین ہیں۔ پس جب وہ ان صفات کے ساتھ ظاہر ہوئے جن کے ساتھ بادشاہ کو ظاہر ہونا چاہیے، لیکن انہوں نے ان الٰہی مصارف کی موافقت نہ کی جنہیں ذات حق (الحق) نے رسولوں کی زبانوں سے مشروع کیا، تو اسے منازع (مقابلہ کرنے والا) اور مغالب (غلبہ پانے والا) قرار دیا گیا۔ پس جب بھی وہ ظاہر ہوا، غلبہ اسی کا تھا، اور جب بھی اس پر غلبہ ہوا، تو غلبہ ذات حق (الحق) کا تھا۔ پس جنگ اس کے لیے اور اس کے خلاف باری باری رہی۔ اور صلح کی صورت یہ ہے کہ بغیر اتباع کے مصارف میں ذات حق (الحق) کی موافقت کی جائے۔ اور یہ سب کچھ اس شخص کے بارے میں ہے جو خود ہی بادشاہت میں کھڑا ہوا۔\n\nلیکن جہاں تک رسولوں میں سے ذات حق (الحق) کے والیوں کا تعلق ہے، تو وہ صرف عدل محض ہیں، اور ہم ان کی طرف سے کسی منازعت کا تصور نہیں کر سکتے، ان سب پر اللہ کی رحمتیں ہوں۔ اور جہاں تک ان ائمہ کا تعلق ہے جنہیں اللہ نے نائب بنایا اور رسولوں کے ذریعے انہیں ان احکام کو قائم کرنے کے لیے خلیفہ بنایا جو اس نے اپنے بندوں میں مشروع کیے، تو وہ دو قسموں پر ہیں۔ ایک قسم وہ ہے جو حق کی صورت میں عدل کرتے ہیں اور جو ان کے لیے مشروع کیا گیا ہے اس سے تجاوز نہیں کرتے۔ اور دوسری قسم وہ ہے جو اس کے قائل ہیں جو ان کے لیے مشروع کیا گیا، مگر انہوں نے ان مصارف میں رجوع نہیں کیا جن کی طرف ذات حق (الحق) نے انہیں بلایا تھا، اور انہوں نے اس میں حق سے انحراف کیا اور وہ جانتے ہیں کہ وہ ظالم اور جائر (انصاف سے ہٹنے والے) ہیں۔ پس وہ ظاہری صورت کے لحاظ سے مغالبہ کرنے والے اور منازعت کرنے والے ہیں، تو اللہ انہیں مہلت دیتا ہے تاکہ شاید وہ رجوع کر لیں۔ پس اس مہلت کے زمانے میں ان کے لیے اس مشروع حق پر غلبہ ظاہر ہوتا ہے جسے ان کے خلیفہ بنانے والا راضی ہے۔ اور ایک وقت ایسا ہوتا ہے جب ذات حق (الحق) کا غلبہ ان پر ہوتا ہے، اس کے مقابلے میں ایک منازع کو کھڑا کرنے کے ذریعے جو **إِلَى الْحَقِّ وإِلى‏ طَرِيقٍ مُسْتَقِيمٍ** \"حق کی طرف اور سیدھے راستے کی طرف\" بلاتا ہے۔\n\nاور جب یہ (منازع) ظاہر ہو جائے، تو ذات حق (الحق) نے اپنے بندوں پر اس کے ساتھ قتال کرنا، اس کے حق میں کھڑا ہونا، اس کی نصرت کرنا، اور ظالم کا ہاتھ پکڑنا واجب کر دیا ہے۔ اور معاملہ اسی طرح رہے گا جیسا کہ ہم نے کہا، یہاں تک کہ اللہ کا حکم آ جائے، اور کلمہ حق نافذ ہو جائے، اور امر یکجا ہو جائے، اور رحمت عام ہو جائے، اور سارا معاملہ اسی کی طرف لوٹ جائے جیسا کہ پہلی بار تھا۔ اور بعض نسبتیں اٹھ جائیں گی اور بعض باقی رہیں گی، اس محل، دار، اور نشأۃ (وجود کی حالت) کے مطابق جس میں وہ ہوتی ہیں اور جس کی طرف وہ جاتی ہیں۔ کیونکہ زمانے کا ایک حکم ہے، مکان کا ایک حکم ہے، اور حال کا ایک حکم ہے۔ اور اللہ حق کا فیصلہ کرتا ہے، **وَهُوَ خَيْرُ الْفَاصِلِينَ** \"اور وہ بہترین فیصلہ کرنے والا ہے\"۔ پس مغالبہ اور منازعت ختم ہو جائے گی، اور دارالسلام میں صلح اور سلامتی باقی رہے گی، ایک ایسی ابد تک جس کی مدت ختم نہ ہو، ایک ایسے ازل کے ساتھ جس کی ابدیت اسے متعین نہ کرے۔ اور **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ‏** \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\"۔\n\nبے شک خلیفہ وہ ہے جس کی امامت\nذات حق (الحق) کی صورت سے ہو، اور اسماء اس کی مدد کریں۔\n\nخلیفہ وہ نہیں جس کی دلیلیں خواہش نفس (الہویٰ) سے قائم ہوں،\nاور خواہشات کا میلان اس کا مقصد ہو۔\n\nاسے معنی کے لحاظ سے تقدم حاصل ہے، لیکن اس کے پاس نہ تو\nذات حق (الحق) کی توثیق ہے اور نہ کوئی شریعت جو اس کی تائید کرے۔\n\nپس وہ حق کا دعویٰ کرتا ہے جبکہ تلواریں اس کی مدد کرتی ہیں،\nاور وہ جھوٹا ہے جبکہ حق کا ستارہ اس کی نگرانی کر رہا ہے۔",
    "fa": "باب چهارصد و دوم: در معرفت جایگاه کسی که بر من غلبه کند، بر او غلبه می‌کنم، و کسی که بر او غلبه کنم، بر من غلبه می‌کند؛ پس تمایل به صلح (السلم) سزاوارتر است.\n\nهر که بر حق (الحق) غلبه کند، از رنج و سختی رها نمی‌شود\nو پیوسته با هر نفس در تعب است.\n\nپس به صلح (السلم) متمایل شو، نه به جنگ\nو اگر بجنگی، لشکریان خدا در پی تو هستند.\n\nمن تو را نصیحت کردم، پس بشنو آنچه را می‌گویم\nهمانا هلاکت‌ها با جنگ همراهند.\nپس بر حذر باش، فدایت شوم، از افلاکی که می‌گردند با آنچه تو نمی‌پسندی\nو از مصیبت‌های زمانه بترس.\n\nاگر فرشتگان بالا (الملأ العلوي) برای آزمودن تو به جنگ آیند\nتسلیم شو و در فرار بکوش.\n\nو به سوی او روی آور و بگو: ای نهایت آرزوی من\nآیا نمی‌دانی که عزت در حجاب‌هاست؟\n\nخداوند عز و جل می‌فرماید: «و اگر به صلح (السلم) تمایل نشان دادند، تو نیز به آن تمایل نشان ده و بر خدا توکل کن» (وإِنْ جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَها وتَوَكَّلْ عَلَى الله).\n\n### [همانا بنده را تخلق (التخلق) به اوصاف الهی است]\n\nبدان که نزد صاحبان اندیشه مقرر شده است که خداوند را صفات و اسمایی است که دارای مراتب هستند، و بنده را تخلق (التخلق) و آراسته شدن به آن‌ها بر حدّی مخصوص، وصفی تصریح شده و حالی معین است. اگر بنده از آن حد تجاوز کند، با حق (الحق) به منازعه برخاسته و مستحق دور شدن و طرد شدن از قرب سعادت‌بخش می‌گردد، چنانکه در این کلام آمده است:\n\nقول خداوند متعال: «کبریا ردای من است و عظمت ازار من؛ هر که در یکی از این دو با من منازعه کند، او را در هم می‌شکنم» (الکبریاء ردائی والعظمة إزاری من نازعنی واحدا منهما قصمته).\n\nو بنده را صفات و اسمایی است که شایسته اوست، و حق (الحق) در اتصاف به آن‌ها با بنده شریک شده است؛ امری که عقول آن را محال می‌دانند، اما شرایع به آن وارد شده و ایمان به آن واجب است. پس نباید پرسید «چگونه؟»؛ زیرا اطلاق این صفات بر بنده از باب تقرب و ایمان است. کسی که به آن‌ها قائل نشود و انکارشان کند، کافر شده و از اسلام خارج گشته است، و کسی که آن‌ها را تأویل کند، بر پایه غرور است. ما نسبت این صفات را به خداوند نمی‌دانیم مگر به آگاه ساختن او. همچنین، هر اسمی از اسمای الهی که ما به آن آراسته شده‌ایم، نزد ما مجهول‌النسبه به اوست، مگر اینکه خداوند ما را آگاه سازد و ما به آگاه ساختن او آن را بدانیم. پس همه چیز یکسان است، آنچه از ماست و آنچه از اوست. پس هنگامی که آنچه برای او معین شده بود، معین شد و ما به آن آراسته شدیم، این کار مغالبه (مغالبة) از جانب ما با حق (الحق) نامیده شد؛ و هنگامی که آنچه برای ما معین شده بود، معین شد و او به آن متصف گشت، این کار مغالبه (مغالبة) از جانب حق (الحق) نامیده شد. و جایگاه تمایل به صلح (السلم) در این امر آن است که همه چیز را به او بازگردانی؛ پس آنچه را که از آن به ما عطا کرد، حتی اگر همه را به ما عطا می‌کرد، ما آن را از باب انعام می‌پذیرفتیم.\n\n### [همانا سبب منازعه (المنازعة) و مغالبه (المغالبة) دو چیز است: خلافت (الاستخلاف) و آفرینش بر صورت الهی]\n\nو بدان که سبب منازعه (المنازعة) و مغالبه (المغالبة) دو چیز است: خلافت (الاستخلاف) که همان امامت است، و آفرینش بر صورت الهی. پس خلیفه (الخليفة) ناگزیر است که به هر صورتی که مستخلف او (خداوند) ظاهر می‌شود، ظاهر گردد. از این رو، خلیفه باید بر تمامی اسماء و صفات الهی که عالَم تحت ولایت او آن‌ها را می‌طلبد، احاطه داشته باشد. و چون امر چنین اقتضا کرد، خداوند امری از جانب خود بر او نازل کرد که آن را شریعت نامید و در آن، مصارف این اسماء و صفات الهی را که خلیفه ناگزیر از ظهور به آن‌هاست، بیان نمود و آن را به او سپرد. پس هر نایبی در عالم، می‌تواند به تمامی اسماء ظاهر شود. و برخی از نایبان کسانی هستند که این مرتبه را خودشان بدون عهد الهی به دست آورده‌اند و در میان رعایا به عدل قیام کرده و در این کار به حق (الحق) استناد جسته‌اند، مانند پادشاهان زمان ما نسبت به خلیفه. برخی از آنان در آنچه موافق اغراضشان است، گوش به فرمان و مطیع‌اند، و در آنچه موافق نیست، همانند وضعیت اولیه خود در اصل ولایتشان هستند. و برخی از آنان به مکارم اخلاق عمل نمی‌کنند و در میان رعیت خود به عدل رفتار نمی‌کنند؛ این شخص همان منازع با حدود مکارم اخلاق و مغالب با جناب حق (الحق) است، در مغالبتش با رسولان خدا، مانند فرعون، صاحب موسی علیه السلام، و امثال او. حق (الحق) دارای اقتدار کامل است، اما از اوصاف او مهلت دادن (الإمهال)، بردباری (الحلم) و تأخیر در مؤاخذه است، نه اهمال. پس هرگاه مؤاخذه کند، رها نمی‌سازد. و زمان عمر حیات دنیا، زمان صلح و جبران امور از دست رفته و اصلاح توسط کسی است که به مصالح امور مورد رضایت خداوند متعال که خیر نامیده می‌شوند و موافق با آنچه شرایع نازل کرده‌اند، قیام کند. با این حال، این امام (پادشاه) به این صفات متصف نشده است از آن جهت که تشریع شده‌اند، و نه از آن جهت که حق (الحق) به آن‌ها توصیه کرده است، بلکه به آن‌ها متصف شده است از آن رو که مکارم اخلاق عرفی هستند که حق (الحق) قدر آن‌ها را شناخته و کسی را که به آن‌ها متصف شده، ستوده است، چنانکه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در تاریخ میلاد خود درباره کسری، که از جمله نایبان پادشاهان بود، فرمود:\n\nفرمود: «من در زمان پادشاه عادل متولد شدم» (ولدت في زمان الملك العادل).\n\nپس او را پادشاه نامید و به عدل وصف کرد، و اگرچه او بر غیر شریعت نازل شده بود، اما این صفتی است که نزد خداوند مورد توجه است. و آنان را پادشاه نامید، اگرچه حق (الحق) آنان را با خطاب الهی بر اساس کشف (الکشف) به خلافت نگماشته بود، اما آنان نایبان او از پس حجاب هستند. پس هرگاه به صفاتی که شایسته ظهور پادشاه به آن‌هاست، ظاهر شوند، اما با مصارف الهی که حق (الحق) به واسطه سنت رسولان تشریع کرده است، موافقت نکنند، این امر منازع (المنازع) و مغالب (المغالب) نامیده می‌شود. هرگاه او (پادشاه) غالب شود، غلبه از آن اوست، و هرگاه بر او غلبه شود، غلبه از آن حق (الحق) است. پس جنگ میان او و حق، نوبتی است. و صورت صلح (السلم)، موافقت با حق (الحق) در مصارف است بدون پیروی. و این همه در مورد کسی است که به خودی خود به پادشاهی قیام کرده است. اما والیان حق (الحق) از میان رسولان، جز عدل محض نیستند و ما منازعه‌ای را از جانب آنان (صلوات الله علیهم) تصور نمی‌کنیم. و اما امامانی که خداوند آنان را به نیابت گماشته و به واسطه مقدم داشتن رسولان، آنان را بر اجرای احکامی که در میان بندگانش تشریع کرده، خلیفه ساخته است، بر دو دسته‌اند: دسته‌ای که به صورت حق (الحق) عدالت می‌ورزند و از آنچه برایشان تشریع شده تجاوز نمی‌کنند؛ و دسته دیگر کسانی هستند که به آنچه برایشان تشریع شده قائل‌اند، غیر از اینکه در مصارفی که حق (الحق) آنان را به سوی آن خوانده، به آن بازنگشته‌اند و در این امر از حق (الحق) منحرف شده‌اند و می‌دانند که ستمکار و منحرف هستند. پس آنان از حیث صورت ظاهری، مغالب (مغالبون) و منازع (منازعون) هستند. خداوند به آنان مهلت می‌دهد، شاید بازگردند. در زمان این مهلت، غلبه برای آنان بر حق (الحق) مشروعی که خلیفه کننده آنان از آن راضی است، ظاهر می‌شود. و در زمانی دیگر، غلبه برای حق (الحق) بر آنان خواهد بود، به واسطه برپایی منازعی در مقابلشان که دعوت «به سوی حق (الحق) و به سوی راهی مستقیم» (إِلَى الْحَقِّ وإِلى‏ طَرِيقٍ مُسْتَقِيمٍ) می‌کند. و هرگاه این (منازع) ظاهر شود، حق (الحق) بر بندگانش واجب کرده است که با او بجنگند و در راه حق (الحق) و یاری او قیام کنند و دست ستمکار را بگیرند. و این امر همچنان بر همین منوال که گفتیم باقی می‌ماند تا امر خدا فرا رسد و کلمه حق (الحق) نافذ شود و امر واحد گردد و رحمت فراگیر شود و همه امور به سوی او بازگردد، چنانکه در آغاز بود. و برخی از نسبت‌ها مرتفع می‌شود و برخی دیگر باقی می‌ماند، بسته به محل، سرا و نشئه‌ای که در آن و به سوی آن می‌روند؛ زیرا زمان حکمی دارد، مکان حکمی دارد و حال حکمی دارد. و خداوند حق (الحق) را حکم می‌کند و «او بهترین داوران است» (هُوَ خَيْرُ الْفاصِلِينَ). پس مغالبه (المغالبة) و منازعه (المنازعة) از بین می‌رود و صلح و سلم (السلم) در دارالسلام (سرای صلح) باقی می‌ماند تا ابدی که مدت آن به ازلی که ابدش آن را معین نمی‌کند، پایان نمی‌پذیرد. و «خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ).\n\nهمانا خلیفه (الخليفة) کسی است که امامتش\nاز صورت حق (الحق) باشد و اسماء او را یاری کنند.\n\nخلیفه کسی نیست که دلایلش\nاز هوس برخیزد و میل هواها او را قصد کند.\n\nاو به لحاظ معنا پیشی دارد، اما برای او\nامضای حق (الحق) و شریعتی که او را تأیید کند، نیست.\n\nپس ادعای حق (الحق) می‌کند در حالی که شمشیرها او را یاری می‌دهند\nو او دروغگوست و ستاره حق (الحق) او را زیر نظر دارد."
  },
  "page_count": 3
}