{
  "id": 314,
  "title": {
    "ar": "الباب الرابع عشر وثلاثمائة في معرفة منزل الفرق بين مدارج الملائكة والنبيين والأولياء من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Fourteen: Concerning the Gnosis of the Station of Distinction between the Levels of the Angels, the Prophets, and the Saints, derived from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب نمبر تین سو چودہ: الحضرت محمدیہ (الحضرة المحمدية) سے ملائکہ، نبیوں اور اولیاء کے مدارج کے درمیان فرق کی منزل کی معرفت (المعرفۃ) میں۔",
    "fa": "باب سیصد و چهاردهم در معرفت منزلگاه فرق میان مدارج فرشتگان، پیامبران و اولیا از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب الرابع عشر وثلاثمائة في معرفة منزل الفرق بين مدارج الملائكة والنبيين والأولياء من الحضرة المحمدية»\n\n\n> تتنزل الأملاك من ملكوته *** في قالب الأنوار بالأسرار\n> حتى إذا ألقت إلى علومها *** بدقائق الأدوار والأكوار\n\n\n> من كل علم ما له متعلق *** إلا بنعت الواحد القهار\n\n\n> عادت إلى أفلاكها أملاكها *** بألوكة من حضرة الأبرار\n\n\n> قد زانها حسن التلقي فانثنت *** بالصورتين حميدة الآثار\n\n\n> وتيقنت أن المعارف إنما *** وهبت لأهل العلم بالأسرار\n\n\n> وقد اشتهت طول المقام بساحتي *** لخروجها فيها عن الأطوار\n\n\n### [أن الله تعالى لما خلق الخلق قدرهم منازل لا يتعدونها]\n\n\nاعلم أيدك الله أيها الولي الحميم أن الله تعالى لما خلق الخلق قدرهم منازل لا يتعدونها فخلق الملائكة ملائكة حين خلقهم وخلق الرسل رسلا والأنبياء أنبياء والأولياء أولياء والمؤمنين مؤمنين والمنافقين والكافرين كافرين كل ذلك مميز عنده سبحانه معين معلوم لا يزاد فيهم ولا ينقص منهم ولا يبدل أحد بأحد فليس لمخلوق كسب ولا تعمل في تحصيل مقام لم يخلق عليه بل قد وقع الفراغ من ذلك وذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ\n\n\nفمنازل كل موجود وكل صنف لا يتعداها ولا يجري أحد في غير مجراه قال تعالى في شأن الكواكب كُلٌّ في فَلَكٍ يَسْبَحُونَ وهكذا كل موجود له طريق تخصه لا يسلك عليها أحد غيره روحا وطبعا فلا يجتمع اثنان في مزاج واحد أبدا ولا يجتمع اثنان في منزلة واحدة أبدا فلا يكون الإنسان ملكا أبدا ولا الملك إنسانا ولا الرسول غيره أبدا ولكل مدرجة عن الله تعالى لكل صنف بل لأشخاص كل نوع خواص تخصها لا ينالها إلا السالك عليها ولو جاز أن يسلك غيره على تلك المدرجة لنال ما فيها وإن جمع الجنس منزل واحد والنوع منزل واحد وهكذا كل نوع من الأنواع التي تحت كل جنس من الأجناس وكذلك كل جنس من الأجناس إلى جنس الأجناس كذلك إلى النوع الأخير كما تجمع الرسالة الرسل ويفضل بعضهم بعضا والأنبياء النبوة ويفضل بعضهم بعضا هذا وإن كانت الكواكب تقطع في فلك واحد وهو فلك البروج فلكل واحد منها فلك يخصه يسبح فيه لا يشاركه فيه غيره فهكذا الأمر في الجميع أعني في المخلوقات وإن جمعهم مقام فإنه يفرقهم مقام فالفلك الكبير الذي يجمع العالم كله فلك الأسماء الإلهية فيه يقطع كل شخص في العالم فهي منازله المقدرة لا يخرج عنها بوجه من الوجوه ولكن يسبح فيه بفلكه الخاص به الذي أوجده الحق فلا يذوق غيره ذوقه من فلك الأسماء ولو ذاقه لكان هو ولا يكون هو أبدا فلا يجتمع اثنين منزل أبد الاتساع فلك الأسماء الإلهية فكل من ادعى من أهل الطريق أنه خرج عن الأسماء الإلهية فما عنده علم بما هي الأسماء ولا يعلم ما معنى الأسماء وكيف يخرج عن إنسانيته الإنسان أو عن ملكيته الملك ولو صح هذا انقلبت الحقائق وخرج الإله عن كونه إلها وصار الحق خلقا والخلق حقا وما وثق أحد بعلم وصار الواجب ممكنا ومحالا والمحال واجبا وانفسد النظام فلا سبيل إلى قلب الحقائق وإنما يرى الناظر الأمور العرضية تعرض للشخص الواحد وتنتقل عليه الحالات ويتقلب فيها فيتخيل أنه قد خرج عنها وكيف يخرج عنها وهي تصرفه وكل حال ما هو عين الآخر فطرأ التلبيس من جهله بالصفة المميزة لكل حال عن صاحبه تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ وإن سبح الكل في فلك الرسالة فأين قطع الهلال من قطع النسر وذلك أن في الأمور اتساعا وضيقا ونشرا وطيا الحس حقيقة واحدة يقطع في فلكها الحواس فأين اللمس من البصر اللمس لا يدرك الملموس كونه خشنا أو لينا إلا بغاية من القرب فإذا لمسه عرفه والبصر عند ما تفتح عينك وترسله في المبصرات علوا كان زمان فتحه زمان إدراكه فلك البروج فأين مسافة ما يقطعه البصر من مسافة ما يقطعه اللمس لو أرادت حاسة اللمس تدرك ملوسة فلك البروج أو خشونته لو كان خشنا متى كانت تصل إلى ذلك ومع هذا فقد جمعهما الحس وكذلك السمع والشم والطعم فانظر ما بين هذه الحقائق من التباين وطبقاتها من التفاضل وأين اتساع أفلاكها من اتساع أفلاك القوي الروحانية في الإنسان ذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ وإذا علمت هذا\n\n\n### [أن النبوة اختصاص إلهي‏]\n\n\nعلمت أن النبوة اختصاص إلهي وأن الرسالة كذلك والولاية والايمان والكفر وجميع الأحوال وأن الكسب اختصاص فإن الملائكة ما لها كسب بل هي مخلوقة في مقاماتها لا تتعداها فلا تكتسب مقاما وإن زادت علوما ولكن ليس عن فكر واستدلال لأن نشأتهم لا تعطي ذلك مثل ما تعطيه نشأة الإنسان والقوي‏\nالتي هم عليها الملائكة المعبر عنها بالأجنحة كما قال عز وجل جاعِلِ الْمَلائِكَةِ رُسُلًا أُولِي أَجْنِحَةٍ مَثْنى‏ وثُلاثَ ورُباعَ وقد صح في الخبر أن جبريل له ستمائة جناح‏\n\n\nفهذه القوة الروحانية ليس لها في كل ملك تصرف فيما فوق مقام صاحبها مثل الطائر عندنا الذي يهوى سفلا ويصعد علوا وأجنحة الملائكة إنما تنزل بها إلى من هو دونها وليس لها قوة تصعد بها فوق مقامها فإذا نزلت بها من مقامها إلى ما هو دونه رجعت علوا من ذلك الذي نزلت إليه إلى مقامها لا تتعداه فما أعطيت الأجنحة إلا من أجل النزول كما إن الطائر ما أعطى الجناح إلا من أجل الصعود فإذا نزل نزل بطبعه وإذا علا علا بجناحه والملك على خلاف ذلك إذا نزل نزل بجناحه وإذا علا علا بطبعه وأجنحة الملائكة للنزول إلى ما دون مقامها والطائر جناحه للعلو إلى ما فوق مقامه وذلك ليعرف كل موجود عجزه وإنه لا يتمكن له أن يتصرف بأكثر من طاقته التي أعطاه الله إياها فالكل تحت ذل الحصر والتقييد والعجز لينفرد جلال الله بالكمال في الإطلاق لا إله إلا هو العلي الكبير فإذا تقرر هذا\n\n\n### [إن للملائكة مدارج ومعارج يعرجون عليها]\n\n\nفاعلم إن للملائكة مدارج ومعارج يعرجون عليها ولا يعرج من الملائكة إلا من نزل فيكون عروجه رجوعا إلا أن يشاء الحق تعالى فلا تحجير عليه وإنما كلامنا في الوقع في الوجود وإنما سمي النزول من الملائكة إلينا عروجا والعروج إنما هو لطالب العلو لأن لله في كل موجود تجليا ووجها خاصا به يحفظه ولا سيما وقد ذكر أنه سبحانه وسعه قلب عبده المؤمن ولما كان للحق سبحانه صفة العلو على الإطلاق سواء تجلى في السفل أو في العلو فالعلو له والملائكة أعطاهم الله من العلم بجلاله بحيث إذا توجهوا من مقامهم لا يتوجهون إلا لله لا لغيره فلهم نظر إلى الحق في كل شي‏ء ينزلون إليه فمن حيث نظرهم إلى ما ينزلون إليه يقال تَنَزَّلُ الْمَلائِكَةُ ومن حيث إنهم ينظرون إلى الحق سبحانه عند ذلك الأمر الذي إليه وله سبحانه مرتبة العلو يقال تَعْرُجُ الْمَلائِكَةُ فهم في نزولهم أصحاب عروج فنزولهم إلى الخلق عروج إلى الحق وإذا رجعوا منا إلى مقاماتهم يقال إنهم عرجوا بالنسبة إلينا وإلى كونهم يرجعون إلى الحق لغرض ما بأيديهم مما نزلوا إليه فكل نظر إلى الكون ممن كان فهو نزول وكل نظر إلى الحق ممن كان فهو عروج فافهم‏\n\n\n### [إن الله عين للرسل معارج يعرجون عليها]\n\n\nثم إن الله عين للرسل معارج يعرجون عليها ما هي معارج الملائكة وعين للاتباع أتباع الرسل معارج يعرجون عليها وهم أتباع الأتباع فإن الرسول تابع للملك والولي تابع للرسول ولهذا قيل للرسول ولا تَعْجَلْ بِالْقُرْآنِ من قَبْلِ أَنْ يُقْضى‏ إِلَيْكَ وَحْيُهُ فهو مصغ تابع للملك ونحن مع الرسول بهذه المثابة فإذا نزل الملك بالوحي على الرسول وتلقا منه ألقاه الرسول على التابع وهو الصاحب فتلقاه منه فإذا عرج الملك عرج بذاته لأنه رجوع إلى أصله وإذا عرج الرسول ركب البراق فعرج به البراق بذاته وعرج الرسول لعروج البراق بحكم التبعية والحركة القسرية فكان محمولا في عروجه حمله من عروجه ذاتي فتميز عروج الرسول من عروج الملك ثم إنه لما وصل إلى المقام الذي لا يتعداه البراق وليس في قوته إن يتعداه تدلى إلى الرسول الرفرف فنزل عن البراق واستوى على الرفرف وصعد به الرفرف وفارقه جبريل فسأله الصحبة فقال إنه لا يطيق ذلك وقال له وما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ فلو أراد الحق صعوده فوق ذلك المقام لكان محمولا مثل ما حمل الرسول صَلَّى اللهُ عَليهِ وسَلَّم ولما وصل المعراج الرفرفي بالرسول صَلَّى اللهُ عَليهِ وسَلَّم إلى مقامه الذي لا يتعداه الرفرف زج به في النور زجة غمرة النور من جميع نواحيه وأخذه الحال فصار يتمايل فيه تمايل السراج إذا هب عليه نسيم رقيق يميله ولا يطفئه ولم ير معه أحدا يأنس به ولا يركن إليه وقد أعطته المعرفة أنه لا يصح الأنس إلا بالمناسب ولا مناسبة بين الله وعبده وإذا أضيفت المؤانسة فإنما ذلك على وجه خاص يرجع إلى الكون فأعطته صَلَّى اللهُ عَليهِ وسَلَّم هذه المعرفة الوحشة لانفراده بنفسه وهذا مما يدلك أن الإسراء كان بجسمه صَلَّى اللهُ عَليهِ وسَلَّم لأن الأرواح لا تتصف بالوحشة ولا الاستيحاش فلما علم الله منه ذلك وكيف لا يعلمه وهو الذي خلقه في نفسه وطلب عليه السلام الدنو بقوة المقام الذي هو فيه فنودي بصوت يشبه صوت أبي بكر تأنيسا له به إذ كان أنيسه في المعهود فحن لذلك وأنس به وتعجب من ذلك اللسان في ذلك الموطن وكيف جاءه من العلو وقد تركه بالأرض وقيل له في ذلك النداء يا محمد قف إن ربك يصلي فأخذه لهذا الخطاب انزعاج وتعجب كيف تنسب الصلاة إلى الله تعالى فتلا عليه في ذلك المقام هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ ومَلائِكَتُهُ لِيُخْرِجَكُمْ من الظُّلُماتِ إِلَى النُّورِ فعلم ما المراد بنسبة الصلاة إلى الله فسكن روعة مع كونه سبحانه لا يشغله‏\nشأن عن شأن ولكن قد وصف نفسه بأنه لا يفعل أمرا حتى يفرغ من أمر آخر فقال سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ فمن هذه الحقيقة قيل له قف إن ربك يصلي أي لا يجمع بين شغلين يريد بذلك العناية بمحمد صَلَّى اللهُ عَليهِ وسَلَّم حيث يقيمه في مقام التفرغ له فهو تنبيه على العناية به والله أجل وأعلى في نفوس العارفين به من ذلك فإن الذي ينال الإنسان من المتفرغ إليه أعظم وأمكن من الذي يناله ممن ليس له حال التفرغ إليه لأن تلك الأمور تجذبه عنه فهذا في حال النبي عليه السلام وتشريفه فكان معه في هذا المقام بمنزلة ملك استدعى بعض عبيده ليقربه ويشرفه فلما دخل حضرته وقعد في منزلته طلب أن ينظر إلى الملك في الأمر الذي وجه إليه فيه فقيل له تربص قليلا فإن الملك في خلوته يعزل لك خلعة تشريف يخلعها عليك فما كان شغله عنه إلا به ولذلك فسر له صلاة الله بقوله تعالى هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ فشرف بأن قيل له إنما غاب عنك من أجلك وفي حقك فلما أدناه تدلى إليه فَأَوْحى‏ إِلى‏ عَبْدِهِ ما أَوْحى‏ ما كَذَبَ الْفُؤادُ ما رَأى‏ العين أي تجلى له في صورة علمه به فلذلك أنس بمشاهدة من علمه فكان شهود تأنيس في ذلك المقام فقد علمت مما أبنته لك معارج الرسل من معارج الملائكة صلوات الله على الجميع فلهذا المعراج خطاب خاص تعطيه خاصية هذا المعراج لا يكون إلا للرسل فلو عرج عليه الولي لأعطاه هذا المعراج بخاصيته ما عنده وخاصيته ما تنفرد به الرسالة فكان الولي إذا عرج به فيه يكون رسولا وقد أخبر رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أن باب الرسالة والنبوة قد أغلق فتبين لك أن هذا المعراج لا سبيل للولي إليه البتة أ لا ترى النبي صَلَّى اللهُ عَليهِ وسَلَّم في هذا المعراج قد فرضت عليه وعلى أمته خمسون صلاة فهو معراج تشريع وليس للولي ذلك‏\n\n\nفلما رجع إلى موسى عليه السلام قال له راجع ربك يخفف عن أمتك الحديث‏\n\n\nإلى أن صارت خمسة بالفعل وبقيت خمسين في الأجر والمنزلة عند الله والحديث صحيح في ذلك وفيه طول‏\n\n\n### [أن معارج الأولياء بالهمم‏]\n\n\nواعلم أن معارج الأولياء بالهمم وشاركهم الأنبياء في هذا المعراج من كونهم أولياء لا من كونهم أنبياء ولا رسلا فيعرج الولي بهمته وبصيرته على براق عمله ورفرف صدقه معراجا معنويا يناله فيه ما يعطيه خواص الهمم من مراتب الولاية والتشريف فهي ثلاثة معارج متجاورة مختلفة والمعراج الرابع معراج توجهات الأسماء عليهم فتفيض الأسماء الإلهية أنوارها على معارج الملائكة ولكن من أنوار التكاليف والشرائع التي هي الأعمال المقربة إلى السعادة خاصة هذا الذي أريده في هذا الموضع للفرقان بين المعارج فتسطع معارج الملك بذلك النور فينصبغ به الملك كما تنصبغ الحرباء بالمحل الذي تكون فيه ثم يفيض الملك على الرسول أي على معراجه فينصبغ به الرسول في باطنه من حيث روحانيته وهوقوله عليه السلام فاعى ما يقول‏\n\n\nثم يفيضه الرسول على أتباعه متنوعا خلاف ما أعطاه الملك فإن الملك إنما يخاطب واحدا والرسول يخاطب الأمة والأمة تختلف أحوالها فلا بد للرسول أن يقسم ذلك الوحي على قدر اختلاف الأمة فإنه رزق مقسوم فيتعين لكل ولي قسطه من ذلك الوحي لنفسه ثم يأخذ منه مما لا يقتضيه حاله ليوصله إلى التابع بعده الذي لم يحضر ذلك المجلس وهكذا إلى يوم القيامة وهم الورثة في التبليغ فيعمل على حاله خاصة ويبلغ ما لا يقتضيه حاله فقد تقتضي حاله تحليل ما حرمه على غيره فيكون مضطرا إلى الغذاء في وقت تحريم أكل الميتة على غير المضطر وهو في تلك الحال من التبليغ يأكل الميتة على شهود من المبلغ إليه فيقول له كيف تحرم على تناول ما تناولته أنت فيقول له لأن الحال مختلف فإن حالة\n\n\nالاضطرار لم تحرم عليها الميتة وحالة غير الاضطرار حرمت عليها الميتة فيبلغ ما لا يقتضيه حاله ولا يعمل إلا بما يقتضيه حاله ثم لتعلم إذا رقيت الأولياء في معارج الهمم فغاية وصولها إلى الأسماء الإلهية فإن الأسماء الإلهية تطلبها فإذا وصلت إليها في معارجها أفاضت عليها من العلوم وأنوارها على قدر الاستعداد الذي جاءت به فلا تقبل منها إلا على قدر استعدادها ولا تفتقر في ذلك إلى ملك ولا رسول فإنها ليست علوم تشريع وإنما هي أنوار فهوم فيما أتى به هذا الرسول في وحيه أو في الكتاب الذي نزل عليه أو الصحيفة لا غير وسواء علم ذلك الكتاب أو لم يعلمه ولا سمع بما فيه من التفاصيل ولكن لا يخرج علم هذا الولي عن الذي جاء ذلك الرسول به من الوحي عن الله وكتابه وصحيفته لا بد من ذلك لكل ولي صديق برسوله إلا هذه الأمة فإن لهم من حيث صديقيتهم بكل رسول ونبي العلم والفتح والفيض الإلهي بكل ما يقتضيه وحي كل نبي وصفته وكتابه وصحيفته وبهذا فضلت على كل أمة من الأولياء\nفلا يتعدى كشف الولي في العلوم الإلهية فوق ما يعطيه كتاب نبيه ووحيه قال الجنيد في هذا المقام علمنا هذا مقيد بالكتاب والسنة وقال الآخر كل فتح لا يشهد له الكتاب والسنة فليس بشي‏ء فلا يفتح لولي قط إلا في الفهم في الكتاب العزيز فلهذا قال ما فَرَّطْنا في الْكِتابِ من شَيْ‏ءٍ وقال في ألواح موسى وكَتَبْنا لَهُ في الْأَلْواحِ من كُلِّ شَيْ‏ءٍ مَوْعِظَةً وتَفْصِيلًا لِكُلِّ شَيْ‏ءٍ فلا يخرج علم الولي جملة واحدة عن الكتاب والسنة فإن خرج أحد عن ذلك فليس بعلم ولا علم ولاية معا بل إذا حققته وجدته جهلا والجهل عدم والعلم وجود محقق فالولي لا يأمر أبدا بعلم فيه تشريع ناسخ لشرعه ولكن قد يلهم لترتيب صورة لا عين لها في الشرع من حيث مجموعها ولكن من حيث تفصيل كل جزء منها وجدته أمرا مشروعا فهو تركيب أمور مشروعة أضاف بعضها إلى بعض هذا الولي أو أضيفت له بطريق الإلقاء أو اللقاء أو الكتابة فظهر بصورة لم تظهر في الشرع بجمعيتها فهذا القدر له من التشريع وما خرج بهذا الفعل من الشرع المكلف به فإن الشارع قد شرع له إنه يشرع مثل هذا فما شرع إلا عن أمر الشارع فما خرج عن أمره فمثل هذا قد يؤمر به الولي من هناك وأما خلاف هذا فلا فإن قلت وأين جعل الله للولي العالم ذلك بلسان الشرع قلنا\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم من سن سنة حسنة كان له أجرها وأجر من عمل بها إلى يوم القيامة لا ينقص ذلك من أجورهم شيئا\n\n\nفقد سن له أن يسن ولكن مما لا يخالف فيه شرعا مشروعا ليحل به ما حرم أو يحرم به ما حلل فهذا حظ الولي من النبوة إذا سن من هنالك وهو جزء من أجزاء النبوة كما هي المبشرات من أجزاء النبوة وكثير من الأشياء على ذلك فالأسماء الإلهية لها على كل معراج ظهور ولهذا تخبر كل طائفة ممن ذكرنا عن ربها في أوقات بغير واسطة وهو قوله عليه السلام لي وقت لا يسعني فيه غير ربي وهذا المقام لكل شخص من الخلق أ لم يقل إن كل مصل يناجي ربه فأين الوسائط في هذا المقام وكذلك في الدار الآخرة في الموقف‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم ما منكم من أحد إلا سيكلمه الله كفاحا ليس بينه وبينه ترجمان‏\n\n\nوكذا هو الآن غير أن في القيامة يعرف كل أحد أن ربه يكلمه وفي الدنيا لا يعرف ذلك إلا العلماء بالله أصحاب العلامات فيعرفون كلام الله إياهم فسبحان من خلقنا أطوارا وجعل لنا على علم الغيب والشهادة دليلا ليلا ونهارا فمحا آية الليل لدلالتها على الغيب وجعل آية النهار مبصرة لدلالتها على عالم الشهادة فمنا من كلم ربه غيبا وهو التجلي المشبه بالقمر ليلة البدر فذلك الإبدار صفتك أي إذا كملت حينئذ كلمك الحق في تجلى القمر بدرا لأنه بذاته مع كل موجود ومنا من كلمه ربه شهادة وهو التجلي المشبه بالشمس ليس دونها سحاب قال العارف‏\n\n\n> يا مؤنسي بالليل إذ هجع الورى *** ومحدثي من بينهم بنهار\n\n\nوبعد أن بانت لك المعارج والمدارج وظهرت لك المراتب ومن لها من العالم وامتازت كل طائفة من غيرها بمعراجها فقد نجز بعض الغرض من هذا الباب فلنذكر أمهات ما يحوي عليه من العلوم فإنه منزل شريف وهو يحوي على نحو من سبعين علما أو يزيد على ذلك فلنذكر منها الأمهات التي لا بد منها وفي ضمنها يندرج ما بقي فمنها علم السؤال فإنه ما كل أحد يعلم كيف يسأل فقد يكون للسائل في نفسه أمر ما ولا يحسن يسأل عنه فإذا سأل أفسده بسؤاله ووقع له الجواب على غير ما في نفسه ويتخيل أن المجيب ما فهم عنه والعيب إنما كان من السائل حيث لم يفهم المسئول صورة ما في نفسه ويتصور هذا كثير في الدعاوي عند الحكام وتحريرها\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم إنكم تختصمون إلي ولعل أحدكم يكون ألحن بحجته من الآخر\n\n\nومعناه أكثر إصابة ومطابقة لما في نفسه عند دعواه ممن لا يحسن ذلك فهو علم مستقل في كل ما يسأل عنه أو يدعى فيه وله شروط معلومة مذكورة وفيه علم القدر القضاء والحكم وفيه علم مقامات الأملاك عمار الأفلاك منهم وغير عمارها وعلم المقادير وعلم الزمان وعلم أحوال الناس في القيامة وعلم النور وعلم الجسر الذي يكون عليه الناس إذا تبدل الأرض وهو دون الظلمة وعلم الظلمة وعلم طبقات جهنم وتفاصيلها وأحوال الخلق فيها وعلم الإنسان وما جبل عليه وهل ينتقل عما جبل عليه أم يستحيل ذلك وعلم الديمومية وعلم محادثة الحق وعلم أداء الحقوق وعلم المحاضرة وعلم الخوف وعلم الحفظ الإلهي وعلم مجاوزة الحدود وما يتجاوز منها وما لا يتجاوز وهل لكل حد مطلع أم لا وعلم مراعاة الأمور إذا تعرضت للإنسان في طريق سلوكه إلى ربه وعلم‏\nذي الجلال والإكرام وعلم التفرقة وعلم الخلق والاختراع ولما ذا يرجع وعلم الجهات وعلم الأسرار وعلم الكمون والظهور وعلم الاقتدار الإلهي وعلم المسابقة بين الحق والخلق وعلم الإمهال والإهمال وما حكمته وهل الحليم يمهل أو يهمل وعلم البعث فهذا قد أبنت لك ما ذكرت أن أبينه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Fourteen: Concerning the Knowledge of the Station of Differentiation between the Spiritual Paths (مدارج) of the Angels, the Prophets, and the Saints, derived from the Muhammadan Presence (الحضرة المحمدية)\n\nThe Angels descend from His Dominion (Malakūt)\nIn the mold of Lights, bearing the Secrets (al-Asrār).\nUntil they deliver to their knowledges\nThe subtleties of the Cycles (al-Adwār) and the Epochs (al-Akwār).\nFrom every knowledge that has no connection\nExcept to the description of the One, the Subduer (al-Qahhār).\nTheir Angels return to their spheres (Aflāk)\nWith a message (alūka) from the Presence of the Righteous (al-Abrār).\nAdorned by the beauty of reception, they turned back\nWith the two forms, their effects praiseworthy.\nAnd they became certain that the Gnosis (al-Ma‘ārif)\nIs only bestowed upon the People of Knowledge of the Secrets.\nThey desired a long stay in my courtyard\nBecause in it, they departed from the stages (al-Aṭwār).\n\n### That when God Almighty created creation, He ordained for them stations they cannot transgress\n\nKnow—may God support you, O intimate Saint (al-Walī al-Ḥamīm)—that when God Almighty created creation (al-Khalq), He ordained for them stations (manāzil) they cannot transgress. He created the Angels as Angels when He created them, and the Messengers (al-Rusul) as Messengers, the Prophets (al-Anbiyā’) as Prophets, the Saints (al-Awliyā’) as Saints, the believers as believers, and the hypocrites and disbelievers as disbelievers. All of this is distinguished, specified, and known by Him, glory be to Him. None are added to them, none are subtracted from them, and none are exchanged for another. Thus, no creature has acquisition (kasb) or effort (ta‘ammul) in attaining a station upon which he was not created. Rather, the determination of that has already been completed. <<وَذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ>> (And that is the determination of the Almighty, the All-Knowing).\n\nThe stations of every existent thing and every category cannot be transgressed, and no one runs in a course other than his own. The Almighty said concerning the stars: <<كُلٌّ فِي فَلَكٍ يَسْبَحُونَ>> (All swim in an orbit/sphere). Likewise, every existent thing has a path specific to it, which no one else travels, neither spiritually nor naturally. Thus, no two individuals will ever share the same temperament (mizāj), nor will any two individuals ever share the same station. Therefore, the human being can never be an Angel, nor the Angel a human being, nor the Messenger ever anything else. For every category, indeed, for the individuals of every species, there are specific characteristics (khawāṣṣ) ordained by God Almighty, which are attained only by the one who travels upon that path (madraja). If it were permissible for another to travel upon that path, he would attain what is in it, even though the genus gathers one station and the species gathers one station, and likewise every species under every genus, and every genus up to the genus of genera, and down to the final species. Just as Messengership (al-Risāla) gathers the Messengers, yet some are favored over others, and Prophethood (al-Nubuwwa) gathers the Prophets, yet some are favored over others.\n\nEven though the stars traverse one sphere, which is the sphere of the Zodiac (Falak al-Burūj), each one has its own specific sphere in which it swims, and no other shares it. This is the case for all creatures: even if a station gathers them, another station differentiates them. The great sphere that encompasses the entire cosmos (al-ʿĀlam) is the sphere of the Divine Names (al-Asmā’ al-Ilāhiyya). Within it, every individual in the cosmos traverses his path; these are his predetermined stations, from which he cannot depart in any way. However, he swims within it by his own specific sphere, which the Real (al-Ḥaqq) brought into existence. Thus, no one else tastes his taste (dhawq) from the sphere of the Names. If he were to taste it, he would be that person, and he can never be that person. Therefore, no two individuals ever share a station within the eternally vast sphere of the Divine Names.\n\nAnyone among the People of the Path (Ahl al-Ṭarīq) who claims to have departed from the Divine Names has no knowledge of what the Names are, nor does he know the meaning of the Names. How can a human being depart from his humanity, or an Angel from his angelhood? If this were true, the Realities (al-Ḥaqā’iq) would be inverted, the God would cease to be God, the Real would become creation (al-Khalq), and creation would become the Real. No one would trust any knowledge, the Necessary (al-Wājib) would become possible and impossible, and the impossible would become necessary, and the entire order (al-Niẓām) would be corrupted. There is no way to invert the Realities.\n\nThe observer only sees accidental matters (al-umūr al-ʿaraḍiyya) occurring to a single person, and states (al-ḥālāt) transferring upon him, and him turning within them, so he imagines that he has departed from them. But how can he depart from them when they are governing him? Since no state is identical to another, the confusion (al-talbīs) arises from his ignorance of the distinguishing characteristic (al-ṣifa al-mumayyiza) of each state from its counterpart. <<تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَى بَعْضٍ>> (Those Messengers—We favored some of them over others). Even though all swim in the sphere of Messengership, how does the path traversed by the Crescent Moon compare to the path traversed by the Eagle (constellation)?\n\nThis is because matters involve expansion and contraction, spreading and folding. Sensation (al-Ḥiss) is one Reality (ḥaqīqa), and the senses traverse its sphere. But how does touch (al-Lams) compare to sight (al-Baṣar)? Touch does not perceive whether the object touched is rough or soft except through extreme proximity; when it touches it, it knows it. Sight, however, when you open your eye and send it forth into the visible objects above, the time of its opening is the time of its perception of the sphere of the Zodiac. How does the distance traversed by sight compare to the distance traversed by touch? If the sense of touch wished to perceive the object of the sphere of the Zodiac, or its roughness if it were rough, when would it ever reach it? Yet, Sensation encompasses both. The same applies to hearing, smell, and taste. Look at the disparity between these Realities and the degrees of their superiority. And how does the vastness of their spheres compare to the vastness of the spheres of the spiritual faculties (al-Quwā al-Rūḥāniyya) in the human being? <<ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ>> (That is the determination of the Almighty, the All-Knowing). If you have understood this, then:\n\n### That Prophethood is a Divine specialization\n\nYou know that Prophethood (al-Nubuwwa) is a Divine specialization (ikhtiṣāṣ), and Messengership (al-Risāla) is likewise, as are Sainthood (al-Wilāya), faith, disbelief, and all states. And that acquisition (al-Kasb) is a specialization. The Angels have no acquisition; rather, they are created in their stations and do not transgress them. They do not acquire a station, even if they increase in knowledge, but this increase is not through thought and inference (istidlāl), because their nature (nash’a) does not grant that, unlike the nature of the human being and the faculties upon which the Angels exist, which are expressed by wings, as the Mighty and Majestic said: <<جَاعِلِ الْمَلَائِكَةِ رُسُلًا أُولِي أَجْنِحَةٍ مَثْنَى وَثُلَاثَ وَرُبَاعَ>> (Who made the Angels messengers having wings, two, three, and four). It is confirmed in the tradition (al-khabar) that Gabriel has six hundred wings.\n\nThis spiritual power (al-Quwwa al-Rūḥāniyya) does not allow any Angel to act above the station of its possessor, unlike the bird we know, which descends low and ascends high. The wings of the Angels only descend with them to those below them, and they do not possess the power to ascend above their station. When they descend with them from their station to what is below it, they return upward from that to which they descended, back to their station, which they do not transgress. The wings were only given for the sake of descent, just as the bird was only given wings for the sake of ascent. When the bird descends, it descends by its nature; when it ascends, it ascends by its wings. The Angel is the opposite: when it descends, it descends by its wings; when it ascends, it ascends by its nature. The wings of the Angels are for descending to what is below their station, while the bird's wing is for ascending to what is above its station. This is so that every existent thing may know its incapacity (ʿajz) and that it cannot act beyond the capacity (ṭāqa) God has given it. All are under the humiliation of restriction, limitation, and incapacity, so that the Majesty (Jalāl) of God may be unique in absolute perfection. There is no god but He, the Exalted, the Great. If this is established, then:\n\n### That the Angels have paths and ascensions upon which they ascend\n\nKnow that the Angels have paths (madārij) and ascensions (maʿārij) upon which they ascend. No Angel ascends except one who has descended, so his ascent is a return, unless the Real (al-Ḥaqq) Almighty wills otherwise, for there is no restriction upon Him. Our discussion, however, concerns what occurs in existence (al-Wujūd).\n\nThe descent of the Angels to us is only called an ascent (ʿurūj) because ascent is for the seeker of highness (al-ʿulū). This is because God has a Self-disclosure (tajallī) and a specific Face (wajh) in every existent thing that preserves it, especially since it has been mentioned that He, glory be to Him, is contained by the heart of His believing servant. Since the Real, glory be to Him, possesses the Attribute of Absolute Highness (al-ʿulū), whether He discloses Himself in the lower or the higher realm, the Highness belongs to Him. God has granted the Angels such knowledge of His Majesty (Jalāl) that when they turn from their station, they turn only toward God, not to anything else. They have a vision of the Real in everything to which they descend.\n\nFrom the perspective of their gaze upon what they descend to, it is said: <<تَنَزَّلُ الْمَلَائِكَةُ>> (The Angels descend). But from the perspective that they gaze upon the Real, glory be to Him, during that matter to which they descend, and since He, glory be to Him, possesses the degree of Highness, it is said: <<تَعْرُجُ الْمَلَائِكَةُ>> (The Angels ascend). Thus, in their descent, they are possessors of ascent. Their descent to creation is an ascent to the Real. When they return from us to their stations, it is said that they have ascended, relative to us and relative to their return to the Real for the purpose of what they hold from that to which they descended. Therefore, every gaze toward the cosmos (al-Kawn), from whomever it may be, is a descent, and every gaze toward the Real, from whomever it may be, is an ascent. Understand this.\n\n### That God designated ascensions upon which the Messengers ascend\n\nFurthermore, God designated ascensions (maʿārij) upon which the Messengers ascend, which are not the ascensions of the Angels. And He designated ascensions upon which the followers of the Messengers ascend, and they are the followers of the followers. For the Messenger is a follower of the Angel, and the Saint is a follower of the Messenger. For this reason, it was said to the Messenger: <<وَلَا تَعْجَلْ بِالْقُرْآنِ مِنْ قَبْلِ أَنْ يُقْضَى إِلَيْكَ وَحْيُهُ>> (And do not hasten with the Qur’an before its revelation is concluded to you). Thus, he is listening, following the Angel. And we stand in this position relative to the Messenger.\n\nWhen the Angel descends with the revelation (al-Waḥy) upon the Messenger and the Messenger receives it from him, the Messenger delivers it to the follower, who is the Companion, and he receives it from him. When the Angel ascends, he ascends by his own essence (bi-dhātihi) because it is a return to his origin. When the Messenger ascends, he mounts the Burāq, and the Burāq ascends by its own essence, and the Messenger ascends due to the Burāq’s ascent, by virtue of dependence and compulsory motion. Thus, he was carried in his ascent, his carrying being distinct from the Angel’s self-ascent (ʿurūj dhātī). This differentiates the ascent of the Messenger from the ascent of the Angel.\n\nThen, when he reached the station (al-Maqām) that the Burāq could not transgress, and which was not within its power to exceed, the Rafraf (a celestial conveyance) descended to the Messenger. He dismounted the Burāq and settled upon the Rafraf, and the Rafraf ascended with him. Gabriel separated from him, and the Prophet asked him for companionship. Gabriel replied that he could not bear it, saying to him: <<وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ>> (And there is none of us but has a known station). If the Real had willed his ascent above that station, he would have been carried, just as the Messenger (peace and blessings of God be upon him) was carried.\n\nWhen the Rafraf-ascent reached the Messenger (PBUH) to the station that the Rafraf could not transgress, he was plunged into the Light (al-Nūr), immersed in Light from all sides. The state (al-Ḥāl) seized him, and he began to sway within it, like a lamp swaying when a gentle breeze blows upon it, tilting it but not extinguishing it. He saw no one with him to feel intimacy (uns) with or rely upon. Gnosis (al-Ma‘rifa) had granted him the understanding that intimacy is only valid with what is suitable, and there is no suitability between God and His servant. If companionship (mu’ānasa) is attributed, it is only in a specific manner that relates back to the cosmos (al-Kawn).\n\nThis Gnosis caused him (PBUH) to feel loneliness (waḥsha) due to his solitude. This indicates to you that the Night Journey (al-Isrā’) was with his physical body (jism), because spirits (al-Arwāḥ) are not characterized by loneliness or feeling estranged. When God knew this from him—and how could He not know, since He created him in his very self—and the Prophet (peace be upon him) sought nearness (al-Dunuww) by the power of the station he was in, he was called by a voice resembling the voice of Abū Bakr, to reassure him, as Abū Bakr was his familiar companion in the known world. He yearned for it and felt intimate, and he wondered at that voice in that place, and how it reached him from above when he had left Abū Bakr on Earth.\n\nIn that call, it was said to him: \"O Muhammad, stop, for your Lord is praying (yuṣallī).\" This address caused him agitation and wonder: how could prayer be attributed to God Almighty? So, in that station, He recited to him: <<هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ وَمَلَائِكَتُهُ لِيُخْرِجَكُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ>> (It is He who confers blessing upon you, and His Angels, that He may bring you out from the darknesses into the light). Thus, he understood what was meant by attributing prayer (al-ṣalāt) to God, and his fear subsided.\n\nAlthough He, glory be to Him, is not distracted by one affair from another, He described Himself as not doing one thing until He finishes another, saying: <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ>> (We shall attend to you, O you two heavy ones [jinn and mankind]). Based on this Reality (ḥaqīqa), it was said to him, \"Stop, for your Lord is praying,\" meaning He does not combine two occupations. By this, He intended to show special care (al-ʿināya) for Muhammad (PBUH) by establishing him in the station of being attended to exclusively. This was an alert to the special care shown to him. God is more majestic and exalted in the souls of those who know Him than that [literal interpretation]. For what a person attains from one who is exclusively devoted to him is greater and more firmly established than what he attains from one who is not in a state of exclusive devotion to him, because other matters draw him away.\n\nThis is the situation of the Prophet (peace be upon him) and his honoring. In this station, he was like a king who summoned one of his servants to bring him near and honor him. When the servant entered his presence and sat in his station, he requested to look upon the king concerning the matter for which he was summoned. He was told, \"Wait a little, for the king is in seclusion, setting aside a robe of honor (khil‘a) to bestow upon you.\" Thus, the king's occupation away from him was only for his sake. For this reason, God’s prayer (ṣalāt) was explained to him by the Almighty’s saying: <<هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ>> (It is He who confers blessing upon you). He was honored by being told that the King was only absent from him for his sake and concerning his right.\n\nWhen He brought him near, He drew close to him: <<فَأَوْحَى إِلَى عَبْدِهِ مَا أَوْحَى>> (And He revealed to His servant what He revealed). <<مَا كَذَبَ الْفُؤَادُ مَا رَأَى>> (The heart did not lie about what it saw). That is, He disclosed Himself to him in the form of His Knowledge (ʿilm) of him. Therefore, he felt intimate (uns) through the witnessing (shuhūd) of what he knew, and it was a witnessing of reassurance in that station.\n\nYou have now learned, from what I have clarified for you, the ascensions of the Messengers compared to the ascensions of the Angels, may God’s blessings be upon them all. This ascent has a specific address (khiṭāb) granted by the unique characteristic (khāṣṣiyya) of this ascent, which belongs only to the Messengers. If a Saint were to ascend upon it, this ascent would grant him, by its characteristic, what it possesses, and its characteristic is what Messengership (al-Risāla) is unique in possessing. Thus, the Saint, if he were to ascend upon it, would become a Messenger. Since the Messenger of God (PBUH) informed us that the door of Messengership and Prophethood is closed, it becomes clear to you that the Saint has absolutely no access to this ascent. Do you not see that during this ascent, fifty prayers were mandated upon the Prophet (PBUH) and his community? Thus, it is an ascent of legislation (tashrīʿ), and the Saint does not possess that.\n\nWhen he returned to Moses (peace be upon him), Moses said to him, \"Go back to your Lord and ask Him to lighten the burden for your community,\" and so on, until they became five in practice, while remaining fifty in reward and station with God. The Hadith concerning this is authentic, and it is lengthy.\n\n### That the ascensions of the Saints are by means of spiritual resolve\n\nKnow that the ascensions of the Saints (al-Awliyā’) are by means of spiritual resolve (al-Himam). The Prophets share in this ascent by virtue of their being Saints, not by virtue of their being Prophets or Messengers. Thus, the Saint ascends with his resolve (himma) and insight (baṣīra) upon the Burāq of his action and the Rafraf of his sincerity—a spiritual ascent (mi‘rāj ma‘nawī) in which he attains what the characteristics of resolve grant him from the degrees of Sainthood and honor. These are three adjacent but distinct ascensions.\n\nThe fourth ascent is the ascent of the orientations of the Names (al-Asmā’) upon them. The Divine Names pour their lights (anwār) upon the ascensions of the Angels, but these are lights of obligations (al-takālīf) and laws (al-sharā’i‘), which are the specific actions that bring one near to felicity. This is what I intend in this place for the differentiation between the ascensions. The ascensions of the Angel shine with that Light, and the Angel is dyed by it, just as the chameleon is dyed by the place it inhabits. Then the Angel pours forth upon the Messenger—that is, upon his ascent—and the Messenger is dyed by it in his inner being (bāṭin) from the perspective of his spirituality. This is his saying (PBUH), \"I am aware of what he says.\"\n\nThen the Messenger pours it forth upon his followers, diversified, unlike what the Angel granted. For the Angel addresses only one person, while the Messenger addresses the community (al-Umma), and the states of the community differ. Therefore, the Messenger must divide that revelation according to the differences within the community, for it is a divided provision (rizq maqsūm). Each Saint is assigned his portion of that revelation for himself. Then he takes from it what his state does not necessitate, in order to convey it to the follower after him who was not present at that gathering, and so on until the Day of Resurrection. They are the inheritors (al-Waratha) in conveyance (al-tablīgh). He acts according to his own specific state and conveys what his state does not necessitate.\n\nHis state may necessitate making lawful what is forbidden to others, such as being compelled to eat sustenance at a time when eating carrion (al-mayta) is forbidden to the non-compelled. While in that state of conveyance, he eats carrion in the witnessing of the one to whom he conveys the message. The follower asks him, \"How can you forbid me from consuming what you yourself consumed?\" He replies, \"Because the state is different. The state of compulsion does not forbid carrion, while the state of non-compulsion forbids it.\" Thus, he conveys what his state does not necessitate, and he only acts according to what his state necessitates.\n\nThen know that when the Saints ascend in the ascensions of resolve (al-Himam), the limit of their arrival is the Divine Names (al-Asmā’ al-Ilāhiyya), for the Divine Names seek them. When they reach the Names in their ascensions, the Names pour forth upon them from their knowledges and lights (anwār) according to the readiness (isti‘dād) with which they arrived. They accept from the Names only according to their readiness, and in this, they are not dependent upon an Angel or a Messenger. This is because these are not sciences of legislation (tashrīʿ); rather, they are lights of understanding (anwār fuhūm) concerning what this Messenger brought in his revelation, or in the Book (al-Kitāb) that descended upon him, or the Scroll (al-Ṣaḥīfa)—nothing else. It is irrelevant whether he knows that Book or not, or whether he has heard its details. However, the knowledge of this Saint cannot depart from what that Messenger brought from God in revelation, His Book, and His Scroll. This is necessary for every Saint who is truthful (ṣiddīq) to his Messenger.\n\nExcept for this Community (al-Umma), for by virtue of their truthfulness (ṣiddīqiyya) to every Messenger and Prophet, they possess the knowledge, the opening (al-Fatḥ), and the Divine emanation (al-Fayḍ al-Ilāhī) of everything necessitated by the revelation, description, Book, and Scroll of every Prophet. By this, they are favored over the Saints of every other community.\n\nTherefore, the unveiling (kashf) of the Saint in the Divine Sciences (al-ʿUlūm al-Ilāhiyya) does not exceed what the Book and revelation of his Prophet grant. Al-Junayd said concerning this station: \"This knowledge of ours is bound by the Book and the Sunna.\" Another said: \"Every opening (fatḥ) that is not witnessed by the Book and the Sunna is nothing.\" No opening is ever granted to a Saint except in the understanding (fahm) of the Glorious Book. For this reason, He said: <<مَا فَرَّطْنَا فِي الْكِتَابِ مِنْ شَيْءٍ>> (We have not neglected anything in the Book). And concerning the Tablets of Moses, He said: <<وَكَتَبْنَا لَهُ فِي الْأَلْوَاحِ مِنْ كُلِّ شَيْءٍ مَوْعِظَةً وَتَفْصِيلًا لِكُلِّ شَيْءٍ>> (And We wrote for him upon the tablets [instruction] of all things, a sermon and a detailed explanation of all things). Thus, the knowledge of the Saint does not depart entirely from the Book and the Sunna.\n\nIf anyone departs from that, it is neither knowledge nor the knowledge of Sainthood (ʿilm wilāya); rather, if you verify it, you will find it to be ignorance (jahl), and ignorance is non-existence, while knowledge is verified existence. Therefore, the Saint never commands a knowledge that contains legislation abrogating his law (sharʿ). However, he may be inspired to arrange a form (ṣūra) that has no specific counterpart in the Law (al-Sharʿ) in terms of its totality, but in terms of the detail of each part of it, you find it to be a legislated matter. It is a composition of legislated matters, which this Saint added one to another, or which were added to him through inspiration (ilqā’), encounter (liqā’), or writing. Thus, it appeared in a form that had not appeared in the Law in its entirety. This is the extent of his legislation (tashrīʿ). By this action, he has not departed from the Law with which he is obligated, for the Lawgiver (al-Shāri‘) has legislated for him that he may legislate such a thing. He only legislates by the command of the Lawgiver, so he has not departed from His command. Such a thing may be commanded to the Saint from that realm. Anything contrary to this is not permissible. If you ask, \"Where did God establish this for the knowing Saint in the language of the Law?\" We say:\n\nThe Prophet (PBUH) said: \"Whoever establishes a good practice (sunna ḥasana) will have its reward and the reward of whoever acts upon it until the Day of Resurrection, without diminishing anything from their rewards.\"\n\nThus, it has been legislated for him to legislate, but only in matters that do not contradict an established law, so that he does not make lawful what is forbidden, or forbid what is lawful. This is the Saint’s share of Prophethood (al-Nubuwwa) when he legislates from that realm, and it is a part of the parts of Prophethood, just as the glad tidings (al-Mubashshirāt) are parts of Prophethood, and many things are similar to this.\n\nThe Divine Names have a manifestation (ẓuhūr) upon every ascent. For this reason, every group we have mentioned informs about its Lord at certain times without an intermediary. This is his saying (PBUH): \"I have a time when none but my Lord encompasses me.\" This station belongs to every person among creation. Did He not say that every person praying is intimately conversing with his Lord? Where, then, are the intermediaries in this station? The same applies in the Hereafter, at the Standing (al-Mawqif).\n\nThe Prophet (PBUH) said: \"There is none among you but his Lord will speak to him directly, without an interpreter between them.\"\n\nAnd this is also the case now, except that on the Day of Resurrection, everyone will know that his Lord is speaking to him, whereas in this world, only the knowers of God (al-ʿUlamā’ bi-Allāh), the possessors of signs (al-ʿAlāmāt), know this, recognizing God’s speech to them. Glory be to Him who created us in stages (aṭwār) and appointed for us a guide to the knowledge of the Unseen (al-Ghayb) and the Witnessed (al-Shahāda), night and day. He erased the sign of the night because it indicates the Unseen, and made the sign of the day visible because it indicates the World of Witnessing (ʿĀlam al-Shahāda).\n\nAmong us are those to whom their Lord speaks in the Unseen, which is the Self-disclosure (al-Tajallī) likened to the moon on the night of the full moon (al-Badr). That fullness is your attribute; that is, when you are perfected, the Real speaks to you in the Self-disclosure of the moon as a full moon, because He is, by His Essence (bi-Dhātihi), with every existent thing. And among us are those to whom their Lord speaks in the Witnessed, which is the Self-disclosure likened to the sun without a cloud beneath it. The Gnostic (al-ʿĀrif) said:\n\n> O my intimate companion in the night when creatures sleep,\n> And my converser among them during the day.\n\nNow that the ascensions (al-Maʿārij) and paths (al-Madārij) have become clear to you, and the Levels (al-Marātib) and those in the cosmos who possess them have been revealed, and every group has been distinguished from others by its ascent, part of the purpose of this chapter has been accomplished. Let us mention the fundamental sciences (ummahāt al-ʿulūm) contained within it, for it is a noble station (manzil). It encompasses around seventy sciences or more. Let us mention the fundamentals that are indispensable, and within them, the rest are subsumed.\n\nAmong them is the Science of Questioning (ʿIlm al-Su’āl). Not everyone knows how to ask. The questioner may have a certain matter in mind but does not know how to ask about it properly. When he asks, he corrupts the matter by his question, and the answer he receives is contrary to what he intended, and he imagines that the respondent did not understand him. The fault lies only with the questioner, as he failed to convey the image of what was in his mind to the respondent. This frequently occurs in legal claims before judges and in their drafting.\n\nThe Prophet (PBUH) said: \"You bring your disputes to me, and perhaps one of you is more eloquent (alḥan) in his argument than the other.\"\n\nIts meaning is: more accurate and corresponding to what is in his mind when making his claim than one who is not skilled in that. It is an independent science concerning everything that is questioned or claimed, and it has known, mentioned conditions. In this chapter is the Science of Divine Decree (ʿIlm al-Qadar), Predetermination (al-Qaḍā’), and Judgment (al-Ḥukm); the Science of the Stations of the Angels (al-Amlāk), those who inhabit the spheres (al-Aflāk) and those who do not; the Science of Measures (al-Maqādīr); the Science of Time (al-Zamān); the Science of the States of People on the Day of Resurrection; the Science of Light (al-Nūr); the Science of the Bridge (al-Jisr) upon which people will stand when the Earth is changed, which is below the Darkness (al-Ẓulma); the Science of Darkness; the Science of the Layers of Hell (Jahannam) and their details and the states of creatures within them; the Science of the Human Being and what he is naturally disposed to (mā jubila ʿalayhi), and whether he can transfer from what he was disposed to, or if that is impossible; the Science of Perpetuity (al-Daymūmiyya); the Science of Conversation with the Real (Muḥādathat al-Ḥaqq); the Science of Rendering Rights (Adā’ al-Ḥuqūq); the Science of Presence (al-Muḥāḍara); the Science of Fear (al-Khawf); the Science of Divine Preservation (al-Ḥifẓ al-Ilāhī); the Science of Transgressing Limits (Mujāwazat al-Ḥudūd), what is transgressed and what is not, and whether every limit has a point of ascent or not; the Science of Observing Matters (Murāʿāt al-Umūr) when they confront a person on his path of spiritual journeying (sulūk) to his Lord; the Science of the Possessor of Majesty and Honor (Dhū al-Jalāl wa al-Ikrām); the Science of Differentiation (al-Tafriqa); the Science of Creation (al-Khalq) and Origination (al-Ikhtirāʿ) and why it returns; the Science of Directions (al-Jihāt); the Science of Secrets (al-Asrār); the Science of Latency (al-Kumūn) and Manifestation (al-Ẓuhūr); the Science of Divine Power (al-Iqtidār al-Ilāhī); the Science of Competition (al-Musābaqa) between the Real and Creation; the Science of Granting Respite (al-Imhāl) and Neglect (al-Ihmāl) and its wisdom, and whether the Forbearing One (al-Ḥalīm) grants respite or neglects; and the Science of Resurrection (al-Baʿth). I have now clarified for you what I intended to clarify. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And God speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تین سو چودہ: حضرت محمدیہ سے ملائکہ، نبیوں اور اولیاء کے مدارج کے درمیان فرق کی منزل کی معرفت میں۔\n\nملائکہ اس کی بادشاہت سے نازل ہوتے ہیں\nانوار کے قالب میں رازوں کے ساتھ\nیہاں تک کہ جب وہ اپنے علوم کو پہنچا دیتے ہیں\nادوار اور اکوار (زمانوں اور کائناتوں) کی باریکیوں تک\n\nہر اس علم سے جس کا تعلق نہیں ہے\nمگر واحد و قہار (الواحد القهار) کی صفت کے ساتھ\n\nان کے ملائکہ اپنے افلاک کی طرف لوٹ جاتے ہیں\nنیکوکاروں کی بارگاہ (حضرة الأبرار) سے پیغام لے کر\n\nحسنِ وصول نے انہیں مزین کیا، پس وہ لوٹے\nدونوں صورتوں کے ساتھ، جن کے آثار قابل تعریف تھے\n\nاور انہیں یقین ہو گیا کہ معرفتیں (المعارف) صرف عطا کی گئی ہیں\nان لوگوں کو جو رازوں کا علم رکھتے ہیں\n\nاور انہوں نے میری بارگاہ میں طویل قیام کی خواہش کی\nکیونکہ اس میں ان کا اطوار (حالتوں) سے نکلنا تھا\n\n***\n\n### [اللہ تعالیٰ نے جب مخلوق کو پیدا کیا تو ان کے لیے ایسی منازل مقرر کیں جن سے وہ تجاوز نہیں کر سکتے]\n\nاے میرے دلی دوست ولی! اللہ تجھے تائید بخشے، جان لے کہ جب اللہ تعالیٰ نے مخلوق کو پیدا کیا تو ان کے لیے ایسی منازل مقرر کیں جن سے وہ تجاوز نہیں کر سکتے۔ اس نے ملائکہ کو جب پیدا کیا تو ملائکہ ہی پیدا کیا، رسولوں کو رسول، نبیوں کو نبی، اولیاء کو ولی، مومنوں کو مومن، اور منافقوں اور کافروں کو کافر پیدا کیا۔ یہ سب اس کے ہاں ممتاز، متعین اور معلوم ہیں، نہ ان میں اضافہ ہوتا ہے اور نہ کمی، اور نہ ہی کوئی ایک دوسرے سے بدلا جاتا ہے۔ کسی مخلوق کے لیے کوئی کسب یا عمل نہیں ہے کہ وہ ایسا مقام حاصل کر لے جس پر وہ پیدا نہیں ہوا، بلکہ اس سے فراغت ہو چکی ہے، اور **ذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ** (یہ غالب، سب کچھ جاننے والے کا مقرر کردہ اندازہ ہے) [الأنعام: 96].\n\nہر موجود اور ہر صنف کی منازل ایسی ہیں کہ وہ ان سے تجاوز نہیں کر سکتا، اور کوئی بھی اپنے مقررہ راستے کے علاوہ کسی اور راستے پر نہیں چل سکتا۔ اللہ تعالیٰ نے ستاروں کے بارے میں فرمایا: **كُلٌّ في فَلَكٍ يَسْبَحُونَ** (اور سب ایک فلک میں تیر رہے ہیں) [یس: 40]. اسی طرح ہر موجود کا ایک خاص راستہ ہے جس پر اس کے سوا کوئی دوسرا نہیں چلتا، خواہ وہ روح ہو یا طبع۔ چنانچہ دو افراد کبھی ایک مزاج میں جمع نہیں ہو سکتے، اور نہ ہی دو افراد کبھی ایک منزل میں جمع ہو سکتے ہیں۔ انسان کبھی فرشتہ نہیں ہو سکتا، نہ فرشتہ انسان، اور نہ رسول کبھی کوئی اور ہو سکتا ہے۔ ہر صنف کے لیے، بلکہ ہر نوع کے افراد کے لیے، اللہ تعالیٰ کی طرف سے ایک خاص مدرجہ (زینہ) ہے، جس کی خصوصیات صرف اسی کو حاصل ہوتی ہیں جو اس پر چلتا ہے۔ اگر کسی دوسرے کے لیے اس مدرجہ پر چلنا جائز ہوتا تو وہ بھی وہ سب کچھ حاصل کر لیتا جو اس میں ہے۔ اگرچہ جنس ایک منزل کو جمع کرتی ہے اور نوع ایک منزل کو، اور اسی طرح ہر نوع جو ہر جنس کے تحت ہے، اور اسی طرح ہر جنس، یہاں تک کہ جنسِ اجناس تک، اور پھر آخری نوع تک۔ جیسے رسالت رسولوں کو جمع کرتی ہے، لیکن ان میں سے بعض کو بعض پر فضیلت حاصل ہے، اور نبوت انبیاء کو جمع کرتی ہے، لیکن ان میں سے بعض کو بعض پر فضیلت حاصل ہے۔ اگرچہ ستارے ایک ہی فلک میں گردش کرتے ہیں، جو کہ فلکِ بروج ہے، لیکن ان میں سے ہر ایک کا اپنا ایک خاص فلک ہے جس میں وہ تیرتا ہے اور کوئی دوسرا اس میں شریک نہیں ہوتا۔ تمام مخلوقات میں بھی یہی معاملہ ہے، یعنی اگرچہ انہیں کوئی ایک مقام جمع کرتا ہے، لیکن ایک مقام انہیں جدا بھی کر دیتا ہے۔ وہ بڑا فلک جو پوری کائنات کو جمع کرتا ہے، وہ اسماء الٰہیہ (الأسماء الإلهية) کا فلک ہے۔ اس میں کائنات کا ہر شخص اپنی مقررہ منازل میں گردش کرتا ہے اور کسی بھی صورت میں ان سے باہر نہیں نکلتا، لیکن وہ اس میں اپنے خاص فلک کے ساتھ تیرتا ہے جسے ذات حق (الحق) نے وجود بخشا ہے۔ چنانچہ کوئی دوسرا اس کے ذوق کو اسماء کے فلک سے نہیں چکھ سکتا، اور اگر وہ اسے چکھ لے تو وہ وہی ہو جائے گا، اور وہ کبھی وہ نہیں ہو سکتا۔ پس دو افراد کبھی بھی ابدی وسعت کے فلکِ اسماء الٰہیہ میں جمع نہیں ہو سکتے۔ لہٰذا، اہل طریق میں سے جو بھی یہ دعویٰ کرے کہ وہ اسماء الٰہیہ سے باہر نکل گیا ہے، تو اسے نہ تو اسماء کا علم ہے اور نہ ہی وہ اسماء کے معنی کو جانتا ہے۔ اور انسان اپنی انسانیت سے یا فرشتہ اپنی ملکیت سے کیسے باہر نکل سکتا ہے؟ اگر یہ درست ہو جائے تو حقائق (الحقائق) الٹ جائیں گے، اور معبود اپنے معبود ہونے سے باہر نکل جائے گا، اور حق (الحق) خلق بن جائے گا اور خلق (الخلق) حق بن جائے گا، اور کوئی بھی علم پر بھروسہ نہیں کرے گا، اور واجب ممکن اور محال ہو جائے گا، اور محال واجب ہو جائے گا، اور نظام بگڑ جائے گا۔ لہٰذا حقائق کو الٹنے کا کوئی راستہ نہیں ہے۔ دیکھنے والا صرف عارضی امور کو دیکھتا ہے جو ایک شخص پر عارض ہوتے ہیں اور حالتیں اس پر منتقل ہوتی ہیں اور وہ ان میں پلٹتا رہتا ہے، تو وہ خیال کرتا ہے کہ وہ ان سے باہر نکل گیا ہے۔ حالانکہ وہ ان سے کیسے باہر نکل سکتا ہے جبکہ وہ اسے چلا رہی ہیں؟ اور ہر حال دوسرے حال کا عین نہیں ہے۔ پس یہ التباس اس کے ہر حال کی امتیازی صفت سے ناواقفیت کی وجہ سے پیدا ہوا ہے۔ **تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ** (یہ وہ رسول ہیں جن میں سے ہم نے بعض کو بعض پر فضیلت دی) [البقرۃ: 253]. اگرچہ سب رسالت کے فلک میں تیرتے ہیں، لیکن ہلال کا راستہ نسر (عقاب) کے راستے سے کتنا مختلف ہے؟ یہ اس لیے ہے کہ امور میں وسعت اور تنگی، اور نشر (پھیلاؤ) اور طے (سمیٹنا) ہوتا ہے۔ حس ایک حقیقت ہے جو اپنے فلک میں حواس کو کاٹتی ہے۔ لمس (چھونے) کا بصر (دیکھنے) سے کیا مقابلہ؟ لمس کسی چھوئی ہوئی چیز کو اس وقت تک نہیں جان سکتا کہ وہ کھردری ہے یا نرم، جب تک کہ وہ انتہائی قریب نہ ہو، جب وہ اسے چھوتا ہے تو جان لیتا ہے۔ جبکہ بصر، جب تم اپنی آنکھ کھولتے ہو اور اسے بلندی پر موجود مبصرات میں بھیجتے ہو، تو اس کے کھلنے کا وقت ہی اس کے ادراک کا وقت ہوتا ہے۔ یہ فلکِ بروج ہے۔ اگر حاسہِ لمس فلکِ بروج کو یا اس کی کھردری پن کو محسوس کرنا چاہے تو وہ کب وہاں پہنچ پائے گا؟ اس کے باوجود حس نے ان دونوں کو جمع کر رکھا ہے۔ اور اسی طرح سمع (سننا)، شم (سونگھنا) اور طعم (چکھنا) ہے۔ پس ان حقائق کے درمیان تفاوت اور ان کے طبقات میں فضیلت کو دیکھو، اور انسان میں روحانی قوتوں کے افلاک کی وسعت کا ان افلاک کی وسعت سے کیا مقابلہ؟ **ذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ** (یہ غالب، سب کچھ جاننے والے کا مقرر کردہ اندازہ ہے) [الأنعام: 96]. جب تم یہ جان چکے۔\n\n***\n\n### [نبوت ایک الٰہی اختصاص ہے]\n\nتو تم نے جان لیا کہ نبوت ایک الٰہی اختصاص ہے، اور اسی طرح رسالت، ولایت، ایمان اور کفر اور تمام احوال بھی۔ اور یہ کہ کسب بھی ایک اختصاص ہے۔ کیونکہ ملائکہ کے لیے کوئی کسب نہیں ہے، بلکہ وہ اپنے مقامات پر پیدا کیے گئے ہیں اور ان سے تجاوز نہیں کرتے۔ وہ کوئی مقام حاصل نہیں کرتے، اگرچہ ان کے علوم میں اضافہ ہوتا ہے، لیکن یہ فکر اور استدلال کے ذریعے نہیں ہوتا، کیونکہ ان کی نشأت اس کی اجازت نہیں دیتی، جیسا کہ انسان کی نشأت اور وہ قوتیں جو ان کے پاس ہیں، جنہیں ملائکہ کے پروں سے تعبیر کیا گیا ہے، جیسا کہ اللہ عزوجل نے فرمایا: **جاعِلِ الْمَلائِكَةِ رُسُلًا أُولِي أَجْنِحَةٍ مَثْنى‏ وثُلاثَ ورُباعَ** (فرشتوں کو قاصد بنانے والا، جن کے دو دو، تین تین اور چار چار پر ہیں) [فاطر: 1]. اور یہ خبر صحیح ہے کہ جبرائیل کے چھ سو پر ہیں۔\n\nیہ روحانی قوت ہر فرشتے میں اپنے صاحب کے مقام سے اوپر تصرف نہیں کر سکتی، جیسے ہمارے ہاں پرندہ جو نیچے اترتا ہے اور اوپر چڑھتا ہے۔ ملائکہ کے پر صرف انہیں ان سے نیچے والوں کی طرف نازل کرتے ہیں، اور ان میں اپنے مقام سے اوپر چڑھنے کی طاقت نہیں ہوتی۔ جب وہ ان پروں کے ذریعے اپنے مقام سے نیچے کی طرف نازل ہوتے ہیں، تو وہ اس جگہ سے جہاں وہ نازل ہوئے تھے، اپنے مقام کی طرف بلندی پر لوٹ جاتے ہیں اور اس سے تجاوز نہیں کرتے۔ انہیں پر صرف نزول کے لیے دیے گئے ہیں، جیسے پرندے کو پر صرف اوپر چڑھنے کے لیے دیے گئے ہیں۔ جب وہ نیچے اترتا ہے تو اپنی طبع سے اترتا ہے، اور جب اوپر چڑھتا ہے تو اپنے پروں سے چڑھتا ہے۔ اور فرشتہ اس کے برعکس ہے: جب وہ نازل ہوتا ہے تو اپنے پروں سے نازل ہوتا ہے، اور جب اوپر چڑھتا ہے تو اپنی طبع سے چڑھتا ہے۔ اور ملائکہ کے پر ان کے مقام سے نیچے کی طرف نزول کے لیے ہیں، جبکہ پرندے کا پر اس کے مقام سے اوپر کی طرف بلندی کے لیے ہے۔ یہ اس لیے ہے تاکہ ہر موجود اپنی عاجزی کو پہچان لے اور یہ جان لے کہ وہ اس طاقت سے زیادہ تصرف نہیں کر سکتا جو اللہ نے اسے عطا کی ہے۔ پس سب کے سب حصر، تقیید اور عجز کی ذلت کے تحت ہیں، تاکہ اللہ کا جلال اطلاق میں کمال کے ساتھ منفرد ہو جائے، اس کے سوا کوئی معبود نہیں، وہ بلند، بہت بڑا ہے۔ جب یہ بات ثابت ہو گئی۔\n\n***\n\n### [ملائکہ کے لیے مدارج اور معارج ہیں جن پر وہ عروج کرتے ہیں]\n\nتو جان لو کہ ملائکہ کے لیے مدارج (زینے) اور معارج (عروج کی جگہیں) ہیں جن پر وہ عروج کرتے ہیں، اور ملائکہ میں سے صرف وہی عروج کرتا ہے جو نازل ہوا ہو، چنانچہ اس کا عروج درحقیقت رجوع ہوتا ہے، مگر یہ کہ ذات حق (الحق) چاہے، کیونکہ اس پر کوئی پابندی نہیں۔ ہماری گفتگو صرف وجود میں واقع ہونے والے امور کے بارے میں ہے۔ ملائکہ کے ہمارے پاس نزول کو عروج اس لیے کہا جاتا ہے کہ عروج بلندی کے طالب کے لیے ہوتا ہے۔ کیونکہ اللہ کے لیے ہر موجود میں ایک ظہور الٰہی (تجلی) اور ایک خاص وجہ ہے جو اسے محفوظ رکھتی ہے، خاص طور پر جب یہ ذکر کیا گیا ہے کہ اس کا قلب اپنے مومن بندے کو سمو لیتا ہے۔ اور چونکہ ذات حق (الحق) کے لیے مطلقاً علو (بلندی) کی صفت ہے، خواہ وہ نیچے میں ظہور کرے یا اوپر میں، علو اسی کے لیے ہے۔ اور اللہ نے ملائکہ کو اپنے جلال کا اتنا علم عطا کیا ہے کہ جب وہ اپنے مقام سے متوجہ ہوتے ہیں تو صرف اللہ کی طرف متوجہ ہوتے ہیں، کسی اور کی طرف نہیں۔ پس وہ ہر اس چیز میں حق کو دیکھتے ہیں جس کی طرف وہ نازل ہوتے ہیں۔ جس لحاظ سے وہ اس چیز کو دیکھتے ہیں جس کی طرف وہ نازل ہوتے ہیں، کہا جاتا ہے: **تَنَزَّلُ الْمَلائِكَةُ** (ملائکہ نازل ہوتے ہیں) [القدر: 4]. اور جس لحاظ سے وہ اس امر کے وقت ذات حق (الحق) کو دیکھتے ہیں، اور اس کے لیے علو کا مرتبہ ہے، کہا جاتا ہے: **تَعْرُجُ الْمَلائِكَةُ** (ملائکہ عروج کرتے ہیں) [المعارج: 4]. پس وہ اپنے نزول میں عروج والے ہوتے ہیں۔ ان کا مخلوق کی طرف نزول، حق کی طرف عروج ہوتا ہے۔ اور جب وہ ہم سے اپنے مقامات کی طرف لوٹتے ہیں، تو ہمارے اعتبار سے اور اس اعتبار سے کہ وہ اپنے ساتھ لائے ہوئے مقصد کے لیے حق کی طرف لوٹ رہے ہیں، کہا جاتا ہے کہ انہوں نے عروج کیا۔ پس مخلوق کی طرف ہر نظر، خواہ وہ کسی کی طرف سے ہو، نزول ہے، اور حق کی طرف ہر نظر، خواہ وہ کسی کی طرف سے ہو، عروج ہے۔ پس سمجھ لو۔\n\n***\n\n### [اللہ نے رسولوں کے لیے معارج مقرر کیے جن پر وہ عروج کرتے ہیں]\n\nپھر اللہ نے رسولوں کے لیے معارج مقرر کیے جن پر وہ عروج کرتے ہیں، جو ملائکہ کے معارج نہیں ہیں۔ اور اس نے رسولوں کے پیروکاروں کے لیے بھی معارج مقرر کیے جن پر وہ عروج کرتے ہیں، اور وہ پیروکاروں کے پیروکار ہیں۔ کیونکہ رسول فرشتے کا پیروکار ہے، اور ولی رسول کا پیروکار ہے۔ اسی لیے رسول سے کہا گیا: **وَلا تَعْجَلْ بِالْقُرْآنِ من قَبْلِ أَنْ يُقْضى‏ إِلَيْكَ وَحْيُهُ** (اور قرآن کو جلدی نہ پڑھا کرو، اس سے پہلے کہ تمہاری طرف اس کی وحی پوری کی جائے) [طٰہٰ: 114]. پس وہ کان لگا کر سننے والا، فرشتے کا پیروکار ہے۔ اور ہم رسول کے ساتھ اسی مقام پر ہیں۔ جب فرشتہ وحی لے کر رسول پر نازل ہوتا ہے اور رسول اس سے وحی وصول کرتا ہے، تو رسول اسے اپنے پیروکار یعنی صحابی پر ڈالتا ہے، اور وہ اسے رسول سے وصول کرتا ہے۔ جب فرشتہ عروج کرتا ہے تو اپنی ذات کے ساتھ عروج کرتا ہے، کیونکہ یہ اس کی اصل کی طرف رجوع ہے۔ اور جب رسول عروج کرتے ہیں تو وہ براق پر سوار ہوتے ہیں، اور براق اپنی ذات کے ساتھ عروج کرتا ہے، اور رسول براق کے عروج کی وجہ سے تبعیت اور جبری حرکت کے حکم سے عروج کرتے ہیں۔ پس وہ اپنے عروج میں محمول تھے، ان کا عروج ذاتی عروج نہیں تھا۔ چنانچہ رسول کا عروج فرشتے کے عروج سے ممتاز ہو گیا۔ پھر جب وہ اس مقام پر پہنچے جہاں سے براق تجاوز نہیں کر سکتا تھا اور اس کی طاقت میں نہیں تھا کہ وہ اس سے آگے بڑھے، تو رفرف رسول کی طرف لٹکایا گیا، چنانچہ آپ براق سے اترے اور رفرف پر سوار ہوئے، اور رفرف آپ کو اوپر لے گیا، اور جبرائیل آپ سے جدا ہو گئے۔ آپ نے ان سے ساتھ رہنے کو کہا تو انہوں نے فرمایا کہ وہ اس کی طاقت نہیں رکھتے، اور کہا: **وَما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ** (اور ہم میں سے کوئی نہیں مگر اس کا ایک مقام معلوم ہے) [الصافات: 164]. اگر ذات حق (الحق) ان کا اس مقام سے اوپر چڑھنا چاہتا تو وہ بھی محمول ہوتے جیسے رسول صلی اللہ علیہ وسلم کو اٹھایا گیا۔ اور جب رفرفی معراج رسول صلی اللہ علیہ وسلم کو اس مقام تک لے گیا جہاں سے رفرف تجاوز نہیں کر سکتا تھا، تو آپ کو نور میں ایک جھٹکا دیا گیا، نور نے آپ کو ہر طرف سے گھیر لیا، اور آپ پر ایک حال طاری ہوا، چنانچہ آپ اس میں اس طرح جھومنے لگے جیسے چراغ پر ہلکی سی ہوا چلتی ہے جو اسے جھکاتی ہے لیکن بجھاتی نہیں۔ آپ نے اپنے ساتھ کسی کو نہیں دیکھا جس سے آپ انس حاصل کرتے یا جس پر بھروسہ کرتے۔ اور معرفت (المعرفۃ) نے آپ کو یہ عطا کیا کہ انس صرف مناسبت سے ہی صحیح ہوتا ہے، اور اللہ اور اس کے بندے کے درمیان کوئی مناسبت نہیں۔ اور اگر مؤانست کا اضافہ کیا جاتا ہے تو وہ ایک خاص طریقے پر ہوتا ہے جو کائنات کی طرف لوٹتا ہے۔ چنانچہ اس معرفت نے آپ صلی اللہ علیہ وسلم کو اپنے اکیلے پن کی وجہ سے وحشت عطا کی۔ اور یہ اس بات کی دلیل ہے کہ معراج جسم کے ساتھ تھا، کیونکہ ارواح وحشت یا استیحاش سے متصف نہیں ہوتیں۔ جب اللہ نے آپ کی یہ حالت جان لی، اور وہ کیسے نہ جانتا جبکہ اسی نے آپ کو پیدا کیا، اور آپ علیہ السلام نے اس مقام کی قوت سے قربت طلب کی جس میں آپ تھے، تو آپ کو ایک آواز سے پکارا گیا جو ابوبکر کی آواز سے مشابہ تھی، تاکہ آپ کو ان سے انس ہو جائے، کیونکہ وہ آپ کے مانوس ساتھی تھے۔ آپ اس آواز کی طرف مائل ہوئے اور اس سے انس حاصل کیا، اور آپ کو اس مقام پر اس زبان پر تعجب ہوا، اور یہ کہ وہ بلندی سے کیسے آئی جبکہ آپ انہیں زمین پر چھوڑ آئے تھے۔ اس پکار میں آپ سے کہا گیا: \"اے محمد! ٹھہر جاؤ، تمہارا رب نماز پڑھ رہا ہے۔\" اس خطاب پر آپ کو گھبراہٹ ہوئی اور تعجب ہوا کہ نماز کی نسبت اللہ تعالیٰ کی طرف کیسے کی جا سکتی ہے؟ تو اسی مقام پر آپ پر یہ آیت تلاوت کی گئی: **هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ ومَلائِكَتُهُ لِيُخْرِجَكُمْ من الظُّلُماتِ إِلَى النُّورِ** (وہی ہے جو تم پر رحمت بھیجتا ہے اور اس کے فرشتے بھی، تاکہ تمہیں تاریکیوں سے نکال کر نور کی طرف لے جائے) [الأحزاب: 43]. چنانچہ آپ نے جان لیا کہ اللہ کی طرف نماز کی نسبت سے کیا مراد ہے۔ آپ کی گھبراہٹ دور ہو گئی، باوجود اس کے کہ وہ سبحانہ ایک کام سے دوسرے کام میں مشغول نہیں ہوتا، لیکن اس نے خود کو اس طرح بیان کیا ہے کہ وہ ایک کام سے فارغ ہوئے بغیر دوسرا کام نہیں کرتا، چنانچہ فرمایا: **سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ** (اے جن و انس! ہم عنقریب تمہاری طرف متوجہ ہوں گے) [الرحمن: 31]. اسی حقیقت کی بنا پر آپ سے کہا گیا: \"ٹھہر جاؤ، تمہارا رب نماز پڑھ رہا ہے،\" یعنی وہ دو کاموں کو جمع نہیں کرتا۔ اس سے مراد محمد صلی اللہ علیہ وسلم کی خصوصی توجہ تھی، جہاں وہ آپ کو اپنے لیے فارغ ہونے کے مقام پر کھڑا کرتا ہے۔ یہ آپ کی خصوصی توجہ پر تنبیہ تھی، اور اللہ عارفین کے نفوس میں اس سے کہیں زیادہ جلیل اور بلند ہے۔ کیونکہ جو چیز انسان کو اس سے حاصل ہوتی ہے جو اس کے لیے فارغ ہو، وہ اس سے زیادہ عظیم اور پائیدار ہوتی ہے جو اسے اس سے حاصل ہوتی ہے جو اس کے لیے فارغ نہ ہو، کیونکہ وہ امور اسے اس سے کھینچ لیتے ہیں۔ یہ نبی علیہ السلام کی حالت اور ان کی تشریف آوری کا بیان ہے۔ اس مقام پر آپ کی مثال اس بادشاہ کی سی تھی جس نے اپنے کسی غلام کو بلایا تاکہ اسے قریب کرے اور عزت بخشے۔ جب وہ اس کی بارگاہ میں داخل ہوا اور اپنی منزل پر بیٹھا، تو اس نے بادشاہ کو اس کام میں دیکھنے کی درخواست کی جس کے لیے اسے بھیجا گیا تھا۔ تو اس سے کہا گیا: \"تھوڑا انتظار کرو، بادشاہ اپنی خلوت میں تمہارے لیے ایک خلعتِ تشریف تیار کر رہا ہے جو تمہیں پہنائے گا۔\" پس اس کا آپ سے مشغول ہونا صرف آپ ہی کی خاطر تھا۔ اسی لیے اللہ کی نماز کی تفسیر اس کے اس قول سے کی گئی: **هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ** (وہی ہے جو تم پر رحمت بھیجتا ہے) [الأحزاب: 43]. چنانچہ آپ کو یہ کہہ کر شرف بخشا گیا کہ وہ آپ سے صرف آپ کی خاطر اور آپ کے حق میں غائب تھا۔ جب اس نے آپ کو قریب کیا تو وہ آپ کی طرف جھکا: **فَأَوْحى‏ إِلى‏ عَبْدِهِ ما أَوْحى‏ ما كَذَبَ الْفُؤادُ ما رَأى‏** (پس اس نے اپنے بندے پر وحی کی جو وحی کی، دل نے جھوٹ نہیں کہا جو دیکھا) [النجم: 10-11]. یعنی اس نے آپ پر اس علم کی صورت میں ظہور کیا جو آپ کو اس کے بارے میں تھا۔ اسی لیے آپ کو اپنے علم کے مشاہدے سے انس حاصل ہوا، چنانچہ وہ اس مقام پر انس بخشنے والا شہود (الشہود) تھا۔ پس جو کچھ میں نے تمہارے لیے بیان کیا، اس سے تم نے رسولوں کے معارج کو ملائکہ کے معارج سے جان لیا، اللہ کی رحمتیں سب پر ہوں۔ اس معراج کا ایک خاص خطاب ہے جو اس معراج کی خاصیت عطا کرتی ہے، اور یہ صرف رسولوں کے لیے ہوتا ہے۔ اگر ولی اس پر عروج کرتا تو یہ معراج اسے اپنی خاصیت کے ساتھ وہ چیز عطا کرتا جو اس کے پاس نہیں ہے، اور اس کی خاصیت وہ ہے جو رسالت کے ساتھ منفرد ہے۔ چنانچہ اگر ولی اس میں عروج کرتا تو وہ رسول بن جاتا۔ اور رسول اللہ صلی اللہ علیہ وسلم نے خبر دی ہے کہ رسالت اور نبوت کا دروازہ بند ہو چکا ہے۔ پس تمہارے لیے واضح ہو گیا کہ ولی کے لیے اس معراج تک پہنچنے کا کوئی راستہ نہیں۔ کیا تم نہیں دیکھتے کہ نبی صلی اللہ علیہ وسلم پر اس معراج میں اور ان کی امت پر پچاس نمازیں فرض کی گئیں؟ پس یہ تشریعی معراج ہے، اور ولی کے لیے یہ نہیں ہے۔\n\nجب آپ موسیٰ علیہ السلام کے پاس واپس آئے تو انہوں نے کہا: \"اپنے رب کے پاس واپس جاؤ اور اپنی امت کے لیے تخفیف کراؤ۔\" (حدیث)\n\nیہاں تک کہ وہ بالفعل پانچ ہو گئیں، اور اجر اور اللہ کے ہاں مرتبے میں پچاس ہی رہیں۔ اس بارے میں حدیث صحیح ہے اور وہ طویل ہے۔\n\n***\n\n### [اولیاء کے معارج ہمتوں کے ذریعے ہیں]\n\nاور جان لو کہ اولیاء کے معارج ہمتوں (الہمم) کے ذریعے ہیں، اور انبیاء نے اس معراج میں ان کے ساتھ شرکت کی، اس لحاظ سے کہ وہ اولیاء ہیں، نہ کہ اس لحاظ سے کہ وہ انبیاء یا رسول ہیں۔ چنانچہ ولی اپنی ہمت اور بصیرت کے ساتھ اپنے عمل کے براق اور اپنے صدق کے رفرف پر ایک معنوی معراج کرتا ہے، جس میں اسے وہ کچھ حاصل ہوتا ہے جو ہمتوں کی خصوصیات ولایت اور تشریف کے مراتب سے عطا کرتی ہیں۔ پس یہ تین معارج ہیں جو ایک دوسرے کے قریب ہیں لیکن مختلف ہیں۔ اور چوتھا معراج اسماء کے ان پر توجہات کا معراج ہے۔ اسماء الٰہیہ (الأسماء الإلهية) اپنی انوار کو ملائکہ کے معارج پر فیض کرتی ہیں، لیکن یہ انوار صرف ان تکالیف اور شرائع کی ہوتی ہیں جو خاص طور پر سعادت کی طرف لے جانے والے اعمال ہیں۔ یہی وہ چیز ہے جو میں اس مقام پر معارج کے درمیان فرق کرنے کے لیے چاہتا ہوں۔ چنانچہ فرشتے کے معارج اس نور سے چمک اٹھتے ہیں، اور فرشتہ اس سے رنگین ہو جاتا ہے، جیسے گرگٹ اس جگہ کے رنگ میں رنگ جاتا ہے جہاں وہ ہوتا ہے۔ پھر فرشتہ رسول پر، یعنی اس کے معراج پر، فیض کرتا ہے، چنانچہ رسول اپنے باطن میں اپنی روحانیت کے لحاظ سے اس سے رنگین ہو جاتا ہے، اور یہی ان کا قول ہے: \"میں جو کچھ کہتا ہوں اسے سمجھتا ہوں۔\"\n\nپھر رسول اسے اپنے پیروکاروں پر فیض کرتے ہیں، جو اس سے مختلف ہوتا ہے جو فرشتے نے عطا کیا تھا، کیونکہ فرشتہ صرف ایک کو مخاطب کرتا ہے، جبکہ رسول امت کو مخاطب کرتا ہے، اور امت کے احوال مختلف ہوتے ہیں۔ لہٰذا رسول کے لیے ضروری ہے کہ وہ اس وحی کو امت کے اختلاف کے مطابق تقسیم کرے، کیونکہ یہ ایک تقسیم شدہ رزق ہے۔ چنانچہ ہر ولی کے لیے اس وحی میں سے اپنا حصہ متعین ہوتا ہے، پھر وہ اس میں سے وہ حصہ لیتا ہے جو اس کے حال کا تقاضا نہیں ہوتا تاکہ وہ اسے اپنے بعد والے پیروکار تک پہنچا دے جو اس مجلس میں حاضر نہیں تھا۔ اور اسی طرح قیامت تک، اور وہ تبلیغ میں وارث ہیں۔ پس وہ صرف اپنے حال کے مطابق عمل کرتا ہے اور وہ تبلیغ کرتا ہے جو اس کے حال کا تقاضا نہیں ہوتا۔ ہو سکتا ہے کہ اس کا حال اس چیز کو حلال قرار دے جسے اس نے دوسروں پر حرام کیا ہو، چنانچہ وہ اس وقت غذا لینے پر مجبور ہو جب دوسروں پر مردار کھانا حرام ہو، اور وہ تبلیغ کی اس حالت میں مردار کھا رہا ہو، اور جسے وہ تبلیغ کر رہا ہے وہ اسے دیکھ رہا ہو۔ تو وہ اس سے کہتا ہے: \"تم مجھ پر اس چیز کا استعمال کیسے حرام کرتے ہو جسے تم نے خود استعمال کیا ہے؟\" تو وہ اسے جواب دیتا ہے: \"کیونکہ حالت مختلف ہے۔ اضطرار کی حالت میں مردار حرام نہیں ہے، اور غیر اضطرار کی حالت میں مردار حرام ہے۔\" پس وہ وہ تبلیغ کرتا ہے جو اس کے حال کا تقاضا نہیں ہوتا، اور صرف اس پر عمل کرتا ہے جو اس کے حال کا تقاضا ہوتا ہے۔ پھر تمہیں یہ جان لینا چاہیے کہ جب اولیاء کو ہمتوں کے معارج میں بلند کیا جاتا ہے، تو ان کے پہنچنے کی انتہا اسماء الٰہیہ (الأسماء الإلهية) تک ہوتی ہے۔ کیونکہ اسماء الٰہیہ انہیں طلب کرتی ہیں۔ جب وہ اپنے معارج میں ان تک پہنچ جاتے ہیں، تو وہ ان پر اپنے علوم اور انوار کا فیض کرتے ہیں، اس استعداد کے مطابق جو وہ لے کر آئے ہیں۔ چنانچہ وہ ان سے صرف اپنی استعداد کے مطابق قبول کرتے ہیں، اور اس میں انہیں کسی فرشتے یا رسول کی ضرورت نہیں ہوتی۔ کیونکہ یہ تشریعی علوم نہیں ہیں، بلکہ یہ فہم کے انوار ہیں جو اس رسول کی وحی میں یا اس کتاب میں جو اس پر نازل ہوئی یا صحیفے میں آئے ہیں، بس۔ خواہ وہ اس کتاب کو جانتا ہو یا نہ جانتا ہو، اور خواہ اس نے اس کی تفصیلات کے بارے میں نہ سنا ہو۔ لیکن اس ولی کا علم اس وحی سے باہر نہیں نکلتا جو وہ رسول اللہ کی طرف سے لایا ہے، اور اس کی کتاب اور صحیفے سے باہر نہیں نکلتا۔ ہر ولی کے لیے جو اپنے رسول کا سچا پیروکار ہے، یہ ضروری ہے۔ سوائے اس امت کے، کیونکہ انہیں اپنی صدیقیت کے لحاظ سے ہر رسول اور نبی کے ساتھ، ہر اس چیز کا علم، فتح اور الٰہی فیض حاصل ہے جو ہر نبی کی وحی، صفت، کتاب اور صحیفے کا تقاضا کرتی ہے۔ اور اسی وجہ سے اسے اولیاء کی ہر امت پر فضیلت دی گئی ہے۔\n\nولی کا کشف (الکشف) الٰہی علوم میں کبھی بھی اس سے تجاوز نہیں کرتا جو اس کے نبی کی کتاب اور وحی عطا کرتی ہے۔ جنید نے اس مقام پر فرمایا: \"ہمارا یہ علم کتاب و سنت سے مقید ہے۔\" اور دوسرے نے کہا: \"ہر وہ فتح جس کی گواہی کتاب و سنت نہ دیں، وہ کچھ بھی نہیں۔\" چنانچہ کسی ولی پر کبھی بھی فتح نہیں ہوتی مگر قرآن مجید کے فہم میں۔ اسی لیے اللہ نے فرمایا: **ما فَرَّطْنا في الْكِتابِ من شَيْ‏ءٍ** (ہم نے کتاب میں کوئی چیز نہیں چھوڑی) [الأنعام: 38]. اور موسیٰ کی تختیوں کے بارے میں فرمایا: **وكَتَبْنا لَهُ في الْأَلْواحِ من كُلِّ شَيْ‏ءٍ مَوْعِظَةً وتَفْصِيلًا لِكُلِّ شَيْ‏ءٍ** (اور ہم نے اس کے لیے تختیوں میں ہر چیز کی نصیحت اور ہر چیز کی تفصیل لکھ دی) [الأعراف: 145]. پس ولی کا علم مجموعی طور پر کتاب و سنت سے باہر نہیں نکلتا۔ اگر کوئی اس سے باہر نکلے تو وہ نہ علم ہے اور نہ ہی علمِ ولایت (ولایۃ)۔ بلکہ اگر تم اس کی تحقیق کرو تو اسے جہالت پاؤ گے، اور جہالت عدم ہے، اور علم ایک محقق وجود ہے۔ پس ولی کبھی بھی ایسے علم کا حکم نہیں دیتا جس میں اس کی شریعت کو منسوخ کرنے والی کوئی تشریع ہو۔ لیکن اسے کسی ایسی صورت کی ترتیب کا الہام ہو سکتا ہے جس کا مجموعی طور پر شریعت میں کوئی وجود نہ ہو، لیکن اس کے ہر جز کی تفصیل کے لحاظ سے تم اسے ایک مشروع امر پاؤ گے۔ پس یہ مشروع امور کا ایک مرکب ہے جسے اس ولی نے ایک دوسرے کے ساتھ جوڑا ہے، یا اسے القاء، ملاقات یا کتابت کے ذریعے جوڑا گیا ہے، چنانچہ وہ ایک ایسی صورت میں ظاہر ہوا جو شریعت میں مجموعی طور پر ظاہر نہیں ہوئی تھی۔ یہ حد اسے تشریع کی حاصل ہے۔ اور اس فعل سے وہ اس شریعت سے باہر نہیں نکلا جس کا وہ مکلف ہے، کیونکہ شارع نے اس کے لیے یہ مشروع کیا ہے کہ وہ اس طرح کی تشریع کرے۔ پس اس نے شارع کے حکم سے ہی تشریع کی، چنانچہ وہ اس کے حکم سے باہر نہیں نکلا۔ ولی کو وہاں سے ایسے امر کا حکم دیا جا سکتا ہے، لیکن اس کے خلاف کا نہیں۔ اگر تم کہو کہ اللہ نے ولی عالم کے لیے یہ بات شرعی زبان میں کہاں رکھی ہے؟ ہم کہیں گے:\n\nنبی صلی اللہ علیہ وسلم نے فرمایا: **من سن سنة حسنة كان له أجرها وأجر من عمل بها إلى يوم القيامة لا ينقص ذلك من أجورهم شيئا** (جس نے کوئی اچھا طریقہ جاری کیا، اسے اس کا اجر ملے گا اور ان لوگوں کا اجر بھی جو قیامت تک اس پر عمل کریں گے، اور ان کے اجر میں کوئی کمی نہیں ہوگی) [صحیح مسلم].\n\nپس اسے سنت جاری کرنے کی اجازت دی گئی ہے، لیکن ایسی چیز میں جو مشروع شریعت کے خلاف نہ ہو، تاکہ وہ اس سے کسی حلال کو حرام نہ کر دے یا کسی حرام کو حلال نہ کر دے۔ یہ ولی کا نبوت سے حصہ ہے جب وہ وہاں سے کوئی سنت جاری کرتا ہے، اور یہ نبوت کے اجزاء میں سے ایک جز ہے، جیسے مبشرات نبوت کے اجزاء میں سے ہیں۔ اور بہت سی چیزیں اسی طرح ہیں۔ اسماء الٰہیہ کا ہر معراج پر ظہور ہوتا ہے۔ اسی لیے مذکورہ بالا ہر گروہ اپنے رب کے بارے میں بعض اوقات بغیر واسطے کے خبر دیتا ہے، اور یہی ان کا قول ہے: \"میرے لیے ایک ایسا وقت ہوتا ہے جس میں میرے رب کے سوا کوئی مجھے نہیں سماتا۔\" اور یہ مقام مخلوق کے ہر شخص کے لیے ہے۔ کیا یہ نہیں کہا گیا کہ ہر نمازی اپنے رب سے سرگوشی کرتا ہے؟ پس اس مقام پر واسطے کہاں ہیں؟ اور اسی طرح آخرت میں میدانِ محشر میں:\n\nنبی صلی اللہ علیہ وسلم نے فرمایا: **ما منكم من أحد إلا سيكلمه الله كفاحا ليس بينه وبينه ترجمان** (تم میں سے کوئی ایسا نہیں ہوگا جس سے اللہ براہ راست بات نہ کرے گا، اس کے اور اس کے درمیان کوئی ترجمان نہیں ہوگا) [صحیح بخاری].\n\nاور دنیا میں بھی ایسا ہی ہے، مگر یہ کہ قیامت میں ہر کوئی جان لے گا کہ اس کا رب اس سے بات کر رہا ہے، اور دنیا میں یہ صرف اللہ کے عالم، علامات والے لوگ ہی جانتے ہیں، چنانچہ وہ اللہ کے ان سے کلام کو پہچانتے ہیں۔ پاک ہے وہ ذات جس نے ہمیں مختلف اطوار میں پیدا کیا اور ہمارے لیے علمِ غیب اور علمِ شہادت پر دن اور رات کو دلیل بنایا۔ پس اس نے رات کی نشانی کو مٹا دیا کیونکہ وہ غیب پر دلالت کرتی ہے، اور دن کی نشانی کو روشن بنایا کیونکہ وہ عالمِ شہادت پر دلالت کرتی ہے۔ ہم میں سے بعض وہ ہیں جن سے ان کے رب نے غیب میں کلام کیا، اور یہ وہ ظہور الٰہی (تجلی) ہے جو چودھویں رات کے چاند سے مشابہ ہے۔ پس وہ بدر (چودھویں کا چاند) تمہاری صفت ہے، یعنی جب تم کامل ہو جاتے ہو، تو اس وقت حق تم سے چاند کے بدر کی صورت میں ظہور میں کلام کرتا ہے، کیونکہ وہ اپنی ذات کے ساتھ ہر موجود کے ساتھ ہے۔ اور ہم میں سے بعض وہ ہیں جن سے ان کے رب نے شہادت میں کلام کیا، اور یہ وہ ظہور الٰہی ہے جو سورج سے مشابہ ہے جس کے نیچے کوئی بادل نہ ہو۔ عارف نے کہا:\n\n**یا مؤنسي باللیل إذ هجع الورى *** ومحدثي من بينهم بنهار**\n(اے رات میں میرے مونس جب مخلوق سو جاتی ہے، اور دن میں ان کے درمیان مجھ سے بات کرنے والے!)\n\nاور جب تمہارے لیے معارج اور مدارج واضح ہو گئے اور مراتب اور ان کے اہل ظاہر ہو گئے، اور ہر گروہ اپنے معراج کے ذریعے دوسرے سے ممتاز ہو گیا، تو اس باب کا کچھ مقصد پورا ہو گیا۔ اب ہم ان علوم کی امہات (بنیادی باتوں) کا ذکر کرتے ہیں جو یہ باب اپنے اندر رکھتا ہے، کیونکہ یہ ایک شریف منزل ہے اور یہ تقریباً ستر یا اس سے زیادہ علوم پر مشتمل ہے۔ ہم ان میں سے صرف ان امہات کا ذکر کریں گے جو ضروری ہیں، اور ان کے ضمن میں باقی سب شامل ہو جائیں گے۔ ان میں سے ایک علمِ سوال ہے۔ کیونکہ ہر کوئی نہیں جانتا کہ سوال کیسے کیا جائے۔ ہو سکتا ہے کہ سائل کے دل میں کوئی بات ہو، لیکن وہ اس کے بارے میں صحیح طریقے سے سوال نہ کر سکے، چنانچہ جب وہ سوال کرتا ہے تو اپنے سوال سے اسے خراب کر دیتا ہے، اور اسے جواب اس کے دل کی بات کے خلاف ملتا ہے، اور وہ خیال کرتا ہے کہ جواب دینے والے نے اسے نہیں سمجھا، حالانکہ عیب سائل میں تھا کہ اس نے مسئول کو اپنے دل کی بات کی صورت نہیں سمجھائی۔ یہ بات حکام کے پاس دعووں اور ان کی تحریر میں بہت زیادہ پیش آتی ہے۔\n\nنبی صلی اللہ علیہ وسلم نے فرمایا: **إنكم تختصمون إلي ولعل أحدكم يكون ألحن بحجته من الآخر** (تم میرے پاس جھگڑے لے کر آتے ہو، اور ہو سکتا ہے کہ تم میں سے کوئی اپنی دلیل میں دوسرے سے زیادہ فصیح ہو) [صحیح بخاری].\n\nاور اس کا مطلب ہے کہ وہ اپنی دلیل کے ساتھ اپنے دل کی بات کو زیادہ درست اور مطابق بیان کرنے والا ہو، اس شخص کے مقابلے میں جو یہ مہارت نہیں رکھتا۔ پس یہ ہر اس چیز میں ایک مستقل علم ہے جس کے بارے میں سوال کیا جائے یا دعویٰ کیا جائے، اور اس کی معلوم اور مذکورہ شرائط ہیں۔ اس میں علمِ قدر، قضاء اور حکم ہے۔ اس میں ملائکہ کے مقامات کا علم ہے، ان میں سے جو افلاک کے آباد کرنے والے ہیں اور جو آباد کرنے والے نہیں ہیں۔ اور علمِ مقادیر (اندازوں) کا علم، اور علمِ زمان (وقت) کا علم، اور قیامت میں لوگوں کے احوال کا علم، اور علمِ نور کا علم، اور اس پل کا علم جو لوگوں کے لیے ہو گا جب زمین بدل دی جائے گی، اور وہ تاریکی سے نیچے ہو گا۔ اور علمِ ظلمت (تاریکی) کا علم، اور جہنم کے طبقات اور ان کی تفصیلات اور ان میں مخلوق کے احوال کا علم، اور انسان کا علم اور وہ جس پر جبلت کیا گیا ہے، اور کیا وہ اس سے منتقل ہو سکتا ہے یا یہ محال ہے؟ اور علمِ دیمومیت (دوام) کا علم، اور حق سے ہم کلامی کا علم، اور حقوق کی ادائیگی کا علم، اور علمِ محاضرہ (حاضری) کا علم، اور علمِ خوف کا علم، اور علمِ حفظِ الٰہی کا علم، اور حدود سے تجاوز کرنے کا علم، اور یہ کہ کن چیزوں سے تجاوز کیا جا سکتا ہے اور کن سے نہیں، اور کیا ہر حد کا کوئی مطلع ہے یا نہیں؟ اور امور کی رعایت کا علم جب وہ انسان کو اس کے رب کی طرف سلوک کے راستے میں پیش آئیں۔ اور ذوالجلال والاکرام (ذی الجلال والإکرام) کا علم، اور علمِ تفرقہ (فرق) کا علم، اور علمِ خلق اور اختراع کا علم، اور یہ کہ وہ کیوں لوٹتا ہے؟ اور علمِ جہات (سمتوں) کا علم، اور علمِ اسرار (رازوں) کا علم، اور علمِ کمون (پوشیدگی) اور ظہور (نموداری) کا علم، اور علمِ اقتدارِ الٰہی کا علم، اور حق اور خلق کے درمیان مسابقت (سبقت لے جانے) کا علم، اور علمِ امہال (مہلت دینا) اور اہمال (نظر انداز کرنا) کا علم، اور اس کی حکمت کیا ہے، اور کیا حلیم مہلت دیتا ہے یا نظر انداز کرتا ہے؟ اور علمِ بعث (دوبارہ اٹھانا) کا علم۔ پس میں نے تمہارے لیے وہ سب بیان کر دیا جو میں نے بیان کرنے کا ارادہ کیا تھا، اور **وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے) [الأحزاب: 4].",
    "fa": "باب سیصد و چهاردهم: در معرفت منزلگاه فرق میان مدارج فرشتگان، پیامبران و اولیا از حضرت محمدیه (الحضرة المحمدية)\n\nفرشتگان از ملکوت او (خداوند) فرود می‌آیند،\nدر قالب انوار (أنوار) با اسرار (أسرار).\nتا آنگاه که علوم خود را القا کنند،\nبه دقائق ادوار و اکوار (دوره‌ها و زمان‌ها).\nاز هر دانشی که تعلق ندارد،\nمگر به وصف خداوند یگانه قهار.\nفرشتگانش با رسالتی از حضرت ابرار،\nبه افلاک خود باز می‌گردند.\nحسن دریافت، آن‌ها را آراسته است، پس با دو صورت (ظاهر و باطن)\nو آثار ستوده بازگشتند.\nو یقین یافتند که معارف (المعارف) تنها\nبه اهل علم به اسرار (أسرار) بخشیده شده است.\nو آرزوی اقامت طولانی در ساحت من (حق) را داشتند،\nزیرا در آن از اطوار (حالات) خارج می‌شوند.\n\n### [اینکه خداوند متعال چون خلق را آفرید، برایشان منازلی مقدر فرمود که از آن‌ها تجاوز نمی‌کنند]\n\nبدان، خداوند تو را تأیید کند، ای ولی صمیمی، که چون خداوند متعال خلق را آفرید، برایشان منازلی (منازل) مقدر فرمود که از آن‌ها تجاوز نمی‌کنند. پس فرشتگان را در همان هنگام که آفرید، فرشته آفرید؛ و رسولان را رسول، و انبیا را نبی، و اولیا را ولی، و مؤمنان را مؤمن، و منافقان و کافران را کافر آفرید. همه این‌ها نزد او سبحانه متمایز، معین و معلوم است؛ نه بر آن‌ها افزوده می‌شود و نه از آن‌ها کاسته می‌گردد، و نه کسی جایگزین دیگری می‌شود. پس مخلوق را کسب و تلاشی در به دست آوردن مقامی که بر آن خلق نشده است، نیست. بلکه از این کار فراغت حاصل شده است، و **ذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ** (این تقدیر (تقدیر) خداوند عزیز و داناست).\n\nپس منازل (منازل) هر موجود و هر صنف، منازلی است که از آن تجاوز نمی‌کند و هیچ کس در مسیری جز مسیر خود جاری نمی‌شود. خداوند متعال در شأن ستارگان می‌فرماید: **كُلٌّ في فَلَكٍ يَسْبَحُونَ** (هر یک در مداری شناورند). و همین‌گونه است هر موجودی که راهی مخصوص به خود دارد که هیچ کس جز او بر آن راه سلوک نمی‌کند، چه از نظر روح و چه از نظر طبع. پس هرگز دو نفر در یک مزاج جمع نمی‌شوند و هرگز دو نفر در یک منزلت جمع نمی‌شوند. پس انسان هرگز فرشته نمی‌شود و فرشته هرگز انسان نمی‌شود و رسول هرگز غیر خود نمی‌شود. برای هر صنف، بلکه برای اشخاص هر نوع، مدارجی (مدارج) از جانب خداوند متعال وجود دارد که خواص مخصوص به خود را دارند و جز سالک بر آن مدارج، کسی به آن‌ها دست نمی‌یابد. و اگر جایز بود که غیر او بر آن مدارج سلوک کند، به آنچه در آن است دست می‌یافت، هرچند که جنس، منزلتی واحد و نوع، منزلتی واحد را جمع کند. و همین‌گونه است هر نوعی از انواع که تحت هر جنسی از اجناس قرار دارد، و همچنین هر جنسی از اجناس تا جنس اجناس، تا نوع اخیر. همان‌گونه که رسالت، رسولان را جمع می‌کند و برخی از آن‌ها بر برخی دیگر برتری دارند، و نبوت، انبیا را جمع می‌کند و برخی از آن‌ها بر برخی دیگر برتری دارند. این در حالی است که ستارگان در یک فلک (فلك) واحد، یعنی فلک بروج، حرکت می‌کنند، اما هر یک از آن‌ها فلکی مخصوص به خود دارد که در آن شناور است و دیگری در آن شریک نیست. پس امر در مورد همه مخلوقات نیز چنین است؛ یعنی اگر مقامی آن‌ها را جمع کند، مقامی دیگر آن‌ها را از هم جدا می‌سازد. فلک بزرگ که تمام عالم را در بر می‌گیرد، فلک اسماء الهیه (الأسماء الإلهية) است. در آن، هر شخص در عالم مسیر خود را طی می‌کند. این‌ها منازل مقدر اوست که به هیچ وجه از آن خارج نمی‌شود، اما در آن با فلک خاص خود که حق (الحق) آن را ایجاد کرده است، شناور است. پس هیچ کس جز او طعم (ذوق) فلک اسماء را نمی‌چشد، و اگر می‌چشید، همان او می‌شد، و هرگز او نمی‌شود. پس هرگز دو نفر در یک منزلت جمع نمی‌شوند. فلک اسماء الهیه (الأسماء الإلهية) ابدی و گسترده است. پس هر کس از اهل طریقت ادعا کند که از اسماء الهیه خارج شده است، علمی به ماهیت اسماء ندارد و نمی‌داند معنای اسماء چیست. چگونه انسان از انسانیت خود یا فرشته از ملکیت خود خارج می‌شود؟ اگر این صحیح بود، حقایق (الحقائق) دگرگون می‌شد و خداوند از الوهیت خود خارج می‌شد و حق (الحق) خلق می‌شد و خلق (الخلق) حق (الحق) می‌شد و هیچ کس به علمی اعتماد نمی‌کرد و واجب ممکن و محال می‌شد و محال واجب می‌شد و نظام فاسد می‌گشت. پس راهی برای دگرگونی حقایق (الحقائق) نیست. بلکه ناظر، امور عرضی را می‌بیند که بر شخص واحد عارض می‌شوند و حالات بر او منتقل می‌گردند و در آن‌ها دگرگون می‌شود، پس خیال می‌کند که از آن‌ها خارج شده است. چگونه از آن‌ها خارج می‌شود در حالی که آن‌ها او را به کار می‌گیرند؟ و هر حالی عین حال دیگر نیست. پس این اشتباه از جهل او به صفت ممیز هر حال از حال دیگر ناشی شده است: **تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ** (این رسولانند که برخی از آنان را بر برخی دیگر برتری دادیم). هرچند که همه در فلک رسالت شناورند، اما کجا سیر هلال با سیر نسر (عقاب) یکی است؟ این بدان سبب است که در امور، گشادگی و تنگی، و نشر و طی (بسط و قبض) وجود دارد. حس (الحس) یک حقیقت واحد است که حواس در فلک آن سیر می‌کنند. کجا لمس با بصر یکی است؟ لمس، ملموس را درک نمی‌کند که زبر است یا نرم، مگر با نهایت نزدیکی. وقتی آن را لمس کرد، می‌شناسد. اما بصر، هنگامی که چشمت را باز می‌کنی و آن را در مبصرات می‌فرستی، زمان باز شدن آن، زمان ادراک آن است. فلک بروج. کجا مسافتی که بصر طی می‌کند با مسافتی که لمس طی می‌کند، یکی است؟ اگر حاسه لمس می‌خواست ملموس فلک بروج یا زبری آن را درک کند، چه زمانی به آن می‌رسید؟ با این حال، حس هر دوی آن‌ها را جمع کرده است. و همچنین سمع و شم و طعم. پس بنگر که میان این حقایق (الحقائق) چه تباین و میان طبقات آن‌ها چه تفاضلی وجود دارد، و کجا گستردگی افلاک آن‌ها با گستردگی افلاک قوای روحانی در انسان یکی است؟ **ذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ** (این تقدیر (تقدیر) خداوند عزیز و داناست). و چون این را دانستی...\n\n### [اینکه نبوت اختصاص الهی است]\n\nدانستی که نبوت (النبوة) اختصاص الهی (اختصاص إلهي) است و رسالت (الرسالة) نیز چنین است، و ولایت (الولاية) و ایمان و کفر و جمیع احوال. و اینکه کسب (کسب) نیز اختصاص است. زیرا فرشتگان کسبی ندارند، بلکه در مقامات خود آفریده شده‌اند و از آن‌ها تجاوز نمی‌کنند. پس مقامی را کسب نمی‌کنند، هرچند علومشان افزایش یابد، اما این افزایش از روی فکر و استدلال نیست، زیرا نشأت آن‌ها چنین اقتضایی ندارد، برخلاف نشأت انسان و قوایی که بر آن هستند. فرشتگان با بال‌هایی توصیف شده‌اند، چنانکه خداوند عزوجل می‌فرماید: **جاعِلِ الْمَلائِكَةِ رُسُلًا أُولِي أَجْنِحَةٍ مَثْنى‏ وثُلاثَ ورُباعَ** (فرشتگان را رسولانی قرار داد که دارای بال‌هایی دوگانه و سه‌گانه و چهارگانه هستند). و در خبر صحیح آمده است که جبرئیل ششصد بال دارد.\n\nاین نیروی روحانی در هر فرشته، تصرفی در مافوق مقام صاحبش ندارد، مانند پرنده‌ای که نزد ما به پایین می‌آید و به بالا می‌رود. بال‌های فرشتگان تنها برای نزول به سوی کسی است که پایین‌تر از آن‌هاست و نیرویی برای صعود به بالاتر از مقام خود ندارند. پس هنگامی که با بال‌های خود از مقامشان به پایین‌تر فرود می‌آیند، از آنجا که فرود آمده‌اند، به مقام خود باز می‌گردند و از آن تجاوز نمی‌کنند. پس بال‌ها تنها برای نزول به آن‌ها داده شده است، همان‌گونه که به پرنده بال داده شده است تا صعود کند. پرنده وقتی پایین می‌آید، با طبع خود پایین می‌آید و وقتی بالا می‌رود، با بال خود بالا می‌رود. اما فرشته بر خلاف آن است؛ وقتی پایین می‌آید، با بال خود پایین می‌آید و وقتی بالا می‌رود، با طبع خود بالا می‌رود. بال‌های فرشتگان برای نزول به ما دون مقامشان است و بال پرنده برای علو به ما فوق مقامش. این بدان سبب است که هر موجودی عجز خود را بشناسد و بداند که نمی‌تواند بیش از توانایی که خداوند به او داده است، تصرف کند. پس همه تحت ذلت حصر و تقیید و عجز هستند تا جلال خداوند در اطلاق به کمال منحصر شود. **لا إله إلا هو العلي الكبير** (هیچ معبودی جز او نیست، بلندمرتبه بزرگ). پس چون این مقرر شد...\n\n### [اینکه فرشتگان را مدارج و معارفی است که بر آن‌ها عروج می‌کنند]\n\nبدان که فرشتگان را مدارج (مدارج) و معارفی (معارج) است که بر آن‌ها عروج می‌کنند، اما از فرشتگان تنها کسی عروج می‌کند که نزول کرده باشد، پس عروج او بازگشت است، مگر آنکه حق (الحق) تعالی بخواهد، که بر او هیچ محدودیتی نیست. سخن ما در مورد آنچه در وجود واقع می‌شود، است. نزول فرشتگان به سوی ما، عروج نامیده شده است، و عروج تنها برای طالب علو است. زیرا خداوند را در هر موجودی تجلی (تجلي) و وجهی خاص است که آن را حفظ می‌کند، به ویژه آنکه ذکر شده است که قلب بنده مؤمنش او را وسعت داده است. و چون حق (الحق) سبحانه صفت علو را به طور مطلق دارد، چه در سفل تجلی کند و چه در علو، علو از آن اوست. و خداوند به فرشتگان از علم جلال خود چنان بخشیده است که وقتی از مقام خود توجه می‌کنند، تنها به سوی خدا توجه می‌کنند، نه به سوی غیر او. پس آن‌ها در هر چیزی که به سوی آن نزول می‌کنند، نظری به حق (الحق) دارند. از جهت نظرشان به آنچه نزول می‌کنند، گفته می‌شود: **تَنَزَّلُ الْمَلائِكَةُ** (فرشتگان فرود می‌آیند). و از جهت اینکه در آن امر که به سوی آن و برای اوست، به حق (الحق) سبحانه نظر می‌کنند و مرتبه علو از آن اوست، گفته می‌شود: **تَعْرُجُ الْمَلائِكَةُ** (فرشتگان عروج می‌کنند). پس آن‌ها در نزول خود، صاحبان عروج هستند. نزولشان به سوی خلق، عروج به سوی حق (الحق) است. و هنگامی که از نزد ما به مقامات خود باز می‌گردند، گفته می‌شود که نسبت به ما و نسبت به بازگشتشان به سوی حق (الحق) برای غرضی که در دست دارند و به خاطر آن نزول کرده‌اند، عروج کرده‌اند. پس هر نظری به سوی کون (الكون) از جانب هر کس که باشد، نزول است، و هر نظری به سوی حق (الحق) از جانب هر کس که باشد، عروج است. پس بفهم.\n\n### [اینکه خداوند برای رسولان معارفی تعیین کرده است که بر آن‌ها عروج می‌کنند]\n\nسپس خداوند برای رسولان معارفی (معارج) تعیین کرده است که بر آن‌ها عروج می‌کنند و این‌ها معارج فرشتگان نیست. و برای اتباع رسولان نیز معارفی تعیین کرده است که بر آن‌ها عروج می‌کنند، و آن‌ها اتباعِ اتباع هستند. زیرا رسول تابع فرشته است و ولی تابع رسول. به همین دلیل به رسول گفته شد: **وَلا تَعْجَلْ بِالْقُرْآنِ مِنْ قَبْلِ أَنْ يُقْضى‏ إِلَيْكَ وَحْيُهُ** (و در [تلاوت] قرآن پیش از آنکه وحی آن به تو پایان یابد، شتاب مکن). پس او گوش فرا دهنده و تابع فرشته است. و ما نسبت به رسول در همین مرتبه هستیم. هنگامی که فرشته وحی را بر رسول نازل می‌کند و او آن را دریافت می‌کند، رسول آن را بر تابع، یعنی صحابی، القا می‌کند و او آن را دریافت می‌نماید. هنگامی که فرشته عروج می‌کند، با ذات خود عروج می‌کند، زیرا بازگشت به اصل خویش است. و هنگامی که رسول عروج می‌کند، بر براق سوار می‌شود و براق او را با ذات خود عروج می‌دهد و رسول به حکم تبعیت و حرکت قسری عروج می‌کند. پس او در عروج خود حمل شده است و حمل او از عروج ذاتی اوست. پس عروج رسول از عروج فرشته متمایز شد. سپس هنگامی که به مقامی رسید که براق از آن تجاوز نمی‌کند و در توانش نیست که از آن بگذرد، رفرف به سوی رسول فرود آمد. پس از براق پایین آمد و بر رفرف قرار گرفت و رفرف او را بالا برد و جبرئیل از او جدا شد. رسول از او همراهی خواست، جبرئیل گفت که توان آن را ندارد و به او گفت: **وَما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ** (و هیچ یک از ما نیست مگر آنکه برای او مقامی معلوم است). اگر حق (الحق) می‌خواست که او بالاتر از آن مقام صعود کند، حمل می‌شد، همان‌گونه که رسول (صلی الله علیه و سلم) حمل شد. و هنگامی که معراج رفرفی، رسول (صلی الله علیه و سلم) را به مقامش که رفرف از آن تجاوز نمی‌کند، رساند، او را در نور فرو برد. غمره نور از همه جوانب او را فرا گرفت و حال او را در بر گرفت، پس شروع به تمايل کرد، مانند تمايل چراغی که نسیمی لطیف بر آن بوزد، آن را متمایل کند اما خاموش نسازد. و هیچ کس را با خود ندید که به او انس گیرد یا به او تکیه کند. و معرفت (المعرفة) به او عطا شد که انس تنها با مناسبت صحیح است و میان خدا و بنده او مناسبتی نیست. و اگر مؤانست (انس گرفتن) اضافه شود، تنها بر وجهی خاص است که به کون (الكون) باز می‌گردد. پس این معرفت (المعرفة) به او (صلی الله علیه و سلم) وحشت داد، به دلیل انفرادش. و این دلیلی است بر اینکه اسراء با جسم او (صلی الله علیه و سلم) بوده است، زیرا ارواح به وحشت و استیحاش متصف نمی‌شوند. هنگامی که خداوند این را از او دانست – و چگونه نداند در حالی که اوست که او را در نفسش آفریده است – و پیامبر (علیه السلام) به نیروی مقامی که در آن بود، طلب نزدیکی کرد، با صدایی شبیه صدای ابوبکر ندا داده شد، تا به او انس دهد، زیرا او مونس معهودش بود. پس پیامبر به آن متمایل شد و انس گرفت و از آن زبان در آن موطن تعجب کرد و اینکه چگونه از علو به او رسیده است در حالی که او را در زمین ترک کرده بود. و در آن ندا به او گفته شد: ای محمد، بایست، پروردگارت نماز می‌خواند. از این خطاب، پریشانی و تعجب او را فرا گرفت که چگونه نماز به خداوند متعال نسبت داده می‌شود. پس در آن مقام بر او تلاوت شد: **هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ ومَلائِكَتُهُ لِيُخْرِجَكُمْ مِنَ الظُّلُماتِ إِلَى النُّورِ** (اوست که بر شما و فرشتگانش درود می‌فرستند تا شما را از تاریکی‌ها به سوی نور بیرون آورد). پس دانست که مراد از نسبت نماز به خداوند چیست. ترس او آرام گرفت، با وجود اینکه سبحانه شأنی او را از شأن دیگر باز نمی‌دارد، اما خود را چنین وصف کرده است که کاری را انجام نمی‌دهد تا از کار دیگر فارغ شود، پس فرمود: **سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ** (به زودی به [حساب] شما می‌پردازیم، ای جن و انس). از این حقیقت به او گفته شد: بایست، پروردگارت نماز می‌خواند؛ یعنی دو کار را با هم جمع نمی‌کند. منظور از این، عنایت به محمد (صلی الله علیه و سلم) است، زیرا او را در مقام تفرغ برای خود قرار می‌دهد. پس این تنبیهی است بر عنایت به او. و خداوند در نفوس عارفان به او، والاتر و بالاتر از این است. زیرا آنچه انسان از کسی که برای او تفرغ یافته است، به دست می‌آورد، عظیم‌تر و محکم‌تر از آن است که از کسی که حال تفرغ برای او ندارد، به دست می‌آورد، زیرا آن امور او را از او دور می‌سازند. این در حال پیامبر (علیه السلام) و تشریف اوست. او در این مقام به منزله پادشاهی بود که برخی از بندگان خود را فرا خواند تا او را مقرب و مشرف سازد. هنگامی که وارد حضرت او شد و در منزلت خود نشست، خواست که به پادشاه در امری که برای آن فرستاده شده بود، بنگرد. به او گفته شد: اندکی صبر کن، پادشاه در خلوت خود است و خلعت تشریفی برای تو آماده می‌کند تا بر تو بپوشاند. پس مشغولیت او از او، تنها به خاطر او و در حق او بود. به همین دلیل، نماز خداوند برای او با این قول تفسیر شد: **هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ** (اوست که بر شما درود می‌فرستد). پس با این سخن مشرف شد که غیبت او از تو، تنها به خاطر تو و در حق تو بوده است. هنگامی که او را نزدیک کرد، به سوی او تدلی (نزدیک شدن) کرد: **فَأَوْحى‏ إِلى‏ عَبْدِهِ ما أَوْحى‏** (پس به بنده خود وحی کرد آنچه وحی کرد). **ما كَذَبَ الْفُؤادُ ما رَأى‏** (دل آنچه را دید، دروغ نگفت). یعنی در صورت علم خود به او تجلی (تجلي) کرد. به همین دلیل، با مشاهده آنچه می‌دانست، انس گرفت. پس آن شهود (الشهود)، شهود تأنیث در آن مقام بود. پس از آنچه برایت بیان کردم، معارج (معارج) رسولان را از معارج فرشتگان دانستی، درود خدا بر همگی آن‌ها باد. پس این معراج، خطاب خاصی دارد که خاصیت این معراج آن را عطا می‌کند و تنها برای رسولان است. اگر ولی بر آن عروج می‌کرد، این معراج با خاصیت خود، آنچه را که نزد اوست، به او عطا می‌کرد، و خاصیت آن چیزی است که رسالت (الرسالة) به آن منحصر است. پس اگر ولی بر آن عروج می‌کرد، رسول می‌شد. و رسول خدا (صلی الله علیه و سلم) خبر داده است که باب رسالت و نبوت بسته شده است. پس برای تو روشن شد که این معراج به هیچ وجه راهی برای ولی به سوی آن نیست. آیا نمی‌بینی که در این معراج، پنجاه نماز بر پیامبر (صلی الله علیه و سلم) و امتش فرض شد؟ پس این معراج تشریع است و ولی چنین چیزی ندارد.\n\nهنگامی که به سوی موسی (علیه السلام) بازگشت، موسی به او گفت: «به سوی پروردگارت بازگرد تا بر امتت تخفیف دهد.» (حدیث)\n\nتا آنکه در عمل پنج نماز شد و در اجر و منزلت نزد خدا پنجاه باقی ماند. و حدیث در این باره صحیح است و طولانی است.\n\n### [اینکه معارج اولیا با همت‌ها است]\n\nو بدان که معارج (معارج) اولیا با همت‌ها (همم) است. و انبیا در این معراج با آن‌ها شریک هستند، از حیث اینکه ولی هستند، نه از حیث اینکه نبی یا رسول هستند. پس ولی با همت (همت) و بصیرت خود بر براق عملش و رفرف صدقش عروج معنوی می‌کند. در این عروج، به آنچه خواص همت‌ها (همم) از مراتب ولایت و تشریف به او عطا می‌کنند، دست می‌یابد. پس سه معراج (معارج) متجاور و متفاوت وجود دارد. و معراج چهارم، معراج توجهات اسماء (الأسماء) بر آن‌هاست. پس اسماء الهیه (الأسماء الإلهية) انوار خود را بر معارج فرشتگان می‌ریزند، اما از انوار تکالیف و شرایعی که همان اعمال مقرب به سعادت هستند، به طور خاص. این همان چیزی است که در این موضع برای فرق گذاشتن میان معارج (معارج) می‌خواهم. پس معارج فرشته با آن نور می‌درخشد و فرشته با آن رنگ می‌گیرد، همان‌گونه که آفتاب‌پرست با محلی که در آن قرار دارد، رنگ می‌گیرد. سپس فرشته آن را بر رسول، یعنی بر معراج او، افاضه می‌کند. پس رسول در باطن خود از حیث روحانیت خود با آن رنگ می‌گیرد، و این همان قول پیامبر (علیه السلام) است: «آنچه را می‌گوید، درک می‌کنم».\n\nسپس رسول آن را بر پیروان خود افاضه می‌کند، به صورتی متنوع، برخلاف آنچه فرشته به او داده است. زیرا فرشته تنها یک نفر را مخاطب قرار می‌دهد، اما رسول امت را مخاطب قرار می‌دهد و احوال امت متفاوت است. پس رسول باید آن وحی را به اندازه اختلاف امت تقسیم کند، زیرا آن رزقی تقسیم شده است. پس سهم هر ولی برای خودش از آن وحی معین می‌شود. سپس از آن، آنچه را که حالش اقتضا نمی‌کند، برمی‌دارد تا به تابع بعد از خود که در آن مجلس حاضر نبوده است، برساند. و همین‌گونه تا روز قیامت. و آن‌ها وارثان در تبلیغ هستند. پس بر حال خاص خود عمل می‌کند و آنچه را که حالش اقتضا نمی‌کند، تبلیغ می‌نماید. چه بسا حالش اقتضا کند که چیزی را که بر غیر او حرام شده است، حلال کند. پس در وقت تحریم خوردن مردار بر غیر مضطر، او مضطر به غذا باشد. و او در آن حال تبلیغ، مردار می‌خورد در حالی که مبلغٌ إلیه (کسی که به او تبلیغ می‌شود) شاهد است. پس به او می‌گوید: چگونه تناول چیزی را که خودت تناول کردی، بر من حرام می‌کنی؟ او می‌گوید: زیرا حال متفاوت است. حال اضطرار، مردار بر آن حرام نشده است و حال غیر اضطرار، مردار بر آن حرام شده است. پس او آنچه را که حالش اقتضا نمی‌کند، تبلیغ می‌کند و تنها به آنچه حالش اقتضا می‌کند، عمل می‌نماید. سپس باید بدانی که وقتی اولیا در معارج (معارج) همت‌ها (همم) بالا می‌روند، نهایت وصول آن‌ها به اسماء الهیه (الأسماء الإلهية) است. زیرا اسماء الهیه آن‌ها را می‌طلبند. هنگامی که در معارج خود به آن‌ها می‌رسند، از علوم و انوار خود به اندازه استعدادی که با خود آورده‌اند، بر آن‌ها افاضه می‌کنند. و آن‌ها جز به اندازه استعداد خود از آن نمی‌پذیرند. و در این امر نیازی به فرشته یا رسول ندارند، زیرا این‌ها علوم تشریع نیستند، بلکه انوار فهم (فهوم) در آنچه این رسول در وحی خود یا در کتابی که بر او نازل شده یا صحیفه‌ای که دارد، آورده است، و نه غیر آن. و فرقی نمی‌کند که آن کتاب را بداند یا نداند، یا از جزئیات آن نشنیده باشد. اما علم این ولی از آنچه آن رسول از وحی از جانب خدا و کتاب و صحیفه‌اش آورده است، خارج نمی‌شود. این برای هر ولی که صدیق (صدیق) رسول خود است، ضروری است. مگر این امت، که برای آن‌ها از حیث صدیقیتشان به هر رسول و نبی، علم و فتح و فیض الهی (الفيض الإلهي) به هر آنچه وحی هر نبی و صفت و کتاب و صحیفه‌اش اقتضا می‌کند، وجود دارد. و به همین سبب بر هر امتی از اولیا برتری یافته‌اند.\n\nپس کشف (الکشف) ولی در علوم الهیه (العلوم الإلهية) از آنچه کتاب نبی‌اش و وحی او عطا می‌کند، فراتر نمی‌رود. جنید در این مقام گفته است: «علم ما مقید به کتاب و سنت است.» و دیگری گفته است: «هر فتحی که کتاب و سنت بر آن شهادت ندهد، چیزی نیست.» پس برای هیچ ولی‌ای فتحی حاصل نمی‌شود مگر در فهم کتاب عزیز. به همین دلیل فرمود: **ما فَرَّطْنا فِي الْكِتابِ مِنْ شَيْ‏ءٍ** (ما در کتاب هیچ چیز را فروگذار نکردیم). و در مورد الواح موسی فرمود: **وَكَتَبْنا لَهُ فِي الْأَلْواحِ مِنْ كُلِّ شَيْ‏ءٍ مَوْعِظَةً وَتَفْصِيلًا لِكُلِّ شَيْ‏ءٍ** (و برای او در الواح از هر چیزی موعظه و تفصیل هر چیزی را نوشتیم). پس علم ولی به طور کلی از کتاب و سنت خارج نمی‌شود. اگر کسی از آن خارج شود، نه علم است و نه علم ولایت (الولاية). بلکه اگر آن را تحقیق کنی، جهل خواهی یافت. و جهل عدم است و علم وجود محقق. پس ولی هرگز به علمی که در آن تشریعی ناسخ شرع او باشد، امر نمی‌کند. اما ممکن است به ترتیب صورتی الهام شود که عین آن در شرع از حیث مجموعش وجود ندارد، اما از حیث تفصیل هر جزء از آن، آن را امری مشروع می‌یابی. پس آن ترکیب امور مشروعی است که این ولی برخی از آن‌ها را به برخی دیگر اضافه کرده است، یا از طریق القاء یا لقاء یا کتابت به او اضافه شده است. پس به صورتی ظاهر شده است که در شرع به صورت جمعی ظاهر نشده بود. این مقدار از تشریع برای اوست. و او با این فعل از شرع مکلف به آن خارج نشده است، زیرا شارع برای او تشریع کرده است که می‌تواند چنین چیزی را تشریع کند. پس او جز به امر شارع تشریع نکرده است و از امر او خارج نشده است. چنین چیزی ممکن است از آنجا به ولی امر شود، اما خلاف این خیر. اگر بگویی: خداوند کجا برای ولی عالم این را به زبان شرع قرار داده است؟ می‌گوییم:\n\nپیامبر (صلی الله علیه و سلم) فرمود: **من سن سنة حسنة كان له أجرها وأجر من عمل بها إلى يوم القيامة لا ينقص ذلك من أجورهم شيئا** (هر کس سنت حسنه‌ای بگذارد، اجر آن و اجر هر کس که تا روز قیامت به آن عمل کند، برای او خواهد بود، بدون اینکه از اجر آن‌ها چیزی کاسته شود).\n\nپس برای او سنت گذاشته شده است که سنت بگذارد، اما در چیزی که با شرع مشروع مخالفت نکند تا چیزی را که حرام شده، حلال کند یا چیزی را که حلال شده، حرام نماید. این بهره ولی از نبوت است، هنگامی که از آنجا سنت می‌گذارد. و این جزئی از اجزای نبوت است، همان‌گونه که مبشرات (بشارت‌ها) جزئی از اجزای نبوت هستند و بسیاری از چیزها بر این منوال است. پس اسماء الهیه (الأسماء الإلهية) بر هر معراجی ظهوری دارند. به همین دلیل، هر طایفه‌ای از کسانی که ذکر کردیم، در اوقاتی بدون واسطه از پروردگار خود خبر می‌دهند. و این همان قول پیامبر (علیه السلام) است: «مرا وقتی است که در آن جز پروردگارم کسی مرا در بر نمی‌گیرد.» و این مقام برای هر شخص از خلق است. آیا نگفته است که هر نمازگزاری با پروردگار خود مناجات می‌کند؟ پس واسطه‌ها در این مقام کجا هستند؟ و همچنین در آخرت در موقف (موقف حساب).\n\nپیامبر (صلی الله علیه و سلم) فرمود: **ما منكم من أحد إلا سيكلمه الله كفاحا ليس بينه وبينه ترجمان** (هیچ یک از شما نیست مگر آنکه خداوند با او رو در رو سخن خواهد گفت و میان او و خداوند ترجمانی نیست).\n\nو اکنون نیز چنین است، جز اینکه در قیامت هر کس می‌داند که پروردگارش با او سخن می‌گوید، اما در دنیا تنها علمای بالله، صاحبان علامات، این را می‌دانند و کلام خدا با خود را می‌شناسند. پس منزه است کسی که ما را اطوار (حالات) آفرید و برای علم غیب و شهادت، شب و روز دلیلی قرار داد. پس نشانه شب را محو کرد تا دلالت بر غیب کند و نشانه روز را بینا قرار داد تا دلالت بر عالم شهادت کند. پس برخی از ما کسانی هستند که پروردگارشان با آن‌ها غیباً سخن گفته است، و آن تجلی (التجلي) است که به ماه شب چهارده تشبیه می‌شود. پس آن بدر (کامل شدن ماه) صفت توست؛ یعنی هنگامی که کامل شدی، حق (الحق) در تجلی (التجلي) ماه کامل با تو سخن گفت، زیرا او به ذات خود با هر موجودی است. و برخی از ما کسانی هستند که پروردگارشان با آن‌ها شهادتاً سخن گفته است، و آن تجلی (التجلي) است که به خورشید بدون ابر تشبیه می‌شود. عارف می‌گوید:\n\n> ای مونس من در شب، آنگاه که خلایق خفته‌اند\n> و ای سخنگوی من در میان آن‌ها در روز.\n\nو پس از آنکه معارج (معارج) و مدارج (مدارج) برای تو آشکار شد و مراتب و کسانی که از عالم به آن‌ها تعلق دارند، روشن گشت و هر طایفه‌ای با معراج خود از دیگری متمایز شد، بخشی از غرض این باب به انجام رسید. پس بگذار تا مادران علومی را که این باب در بر دارد، ذکر کنیم. زیرا این منزلتی شریف است و حدود هفتاد علم یا بیشتر را در بر می‌گیرد. پس از میان آن‌ها، مادران (اصول) ضروری را ذکر می‌کنیم که مابقی در ضمن آن‌ها مندرج می‌شوند. از جمله آن‌ها، علم سؤال است. زیرا هر کس نمی‌داند چگونه سؤال کند. چه بسا سائل در نفس خود امری داشته باشد و نتواند به خوبی درباره آن سؤال کند. پس اگر سؤال کند، با سؤال خود آن را فاسد می‌کند و جواب بر خلاف آنچه در نفس اوست، به او داده می‌شود و خیال می‌کند که پاسخ‌دهنده او را نفهمیده است، در حالی که عیب از سائل بوده است که صورت آنچه در نفس اوست را برای مسئول (پاسخ‌دهنده) روشن نکرده است. و این در دعاوی نزد حاکمان و تحریر آن‌ها بسیار اتفاق می‌افتد.\n\nپیامبر (صلی الله علیه و سلم) فرمود: **إنكم تختصمون إلي ولعل أحدكم يكون ألحن بحجته من الآخر** (شما نزد من برای خصومت می‌آیید و شاید یکی از شما در بیان حجت خود از دیگری فصیح‌تر باشد).\n\nو معنای آن این است که در هنگام ادعای خود، بیشتر به آنچه در نفس اوست، اصابت و مطابقت دارد تا کسی که این را خوب نمی‌داند. پس این علمی مستقل در هر چیزی است که درباره آن سؤال می‌شود یا ادعا می‌شود، و شروط معلومی دارد که ذکر شده است. و در آن علم قدر (القدر)، قضا و حکم وجود دارد. و در آن علم مقامات فرشتگان، یعنی فرشتگان آبادکننده افلاک و غیر آن‌ها، و علم مقادیر، و علم زمان، و علم احوال مردم در قیامت، و علم نور، و علم پلی که مردم هنگام تبدیل زمین بر آن قرار می‌گیرند و زیر آن ظلمت است، و علم ظلمت، و علم طبقات جهنم و جزئیات آن و احوال خلق در آن، و علم انسان و آنچه بر آن سرشته شده است و آیا از آنچه بر آن سرشته شده است، منتقل می‌شود یا این محال است، و علم دیمومیت (جاودانگی)، و علم محادثه حق (الحق)، و علم ادای حقوق، و علم محاضره (حضور)، و علم خوف، و علم حفظ الهی، و علم مجاوزت حدود و آنچه از آن تجاوز می‌شود و آنچه تجاوز نمی‌شود و آیا هر حدی مطلعی دارد یا خیر، و علم مراعات امور هنگامی که در طریق سلوک به سوی پروردگار برای انسان عارض می‌شوند، و علم ذی الجلال و الاکرام، و علم تفرقه، و علم خلق و اختراع و اینکه چرا باز می‌گردد، و علم جهات، و علم اسرار (أسرار)، و علم کمون و ظهور، و علم اقتدار الهی، و علم مسابقه میان حق (الحق) و خلق (الخلق)، و علم مهلت دادن و اهمال کردن و حکمت آن چیست و آیا حلیم مهلت می‌دهد یا اهمال می‌کند، و علم بعث. این‌ها را برایت بیان کردم، آنچه را که قصد بیانش را داشتم. و **والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 6
}