{
  "id": 445,
  "title": {
    "ar": "الباب الخامس والأربعون وأربعمائة في معرفة منازلة هل عرفت أوليائي الذين أدبتهم بآدابي",
    "en": "Chapter Four Hundred and Forty-Five, Concerning the Gnosis of the Divine Conversation: \"Have you known My Intimates (Awliyā') whom I disciplined with My Disciplines (Ādāb)?\"",
    "ur": "باب چار سو پینتالیس: اس مقام (منازلة) کی معرفت کے بیان میں کہ کیا تم نے میرے ان اولیاء کو پہچانا جنہیں میں نے اپنے آداب سے مؤدب کیا؟",
    "fa": "باب چهارصد و چهل و پنجم در معرفت منازل کسانی که آیا اولیای مرا که با آداب خود تأدیبشان کردم، شناختی؟"
  },
  "content": {
    "ar": "## «الباب الخامس والأربعون وأربعمائة في معرفة منازلة هل عرفت أوليائي الذين أدبتهم بآدابي»\n\n\n> أنبياء الله ما أدبهم *** غيره فاعتصموا بالأدب‏\n\n\n> فهم السادة لا يخذلهم *** هكذا عينهم في الكتب‏\n\n\n> فالذي يمشي على آثارهم *** هو معدود بذا في النجب‏\n\n\n> فإذا كان كذا ثم كذا *** لم يزل لذاك خلف الحجب‏\n\n\n> أسعد الناس بهم تابعهم *** فتراه مثلهم في النصب‏\n\n\n> لزموا المحراب حتى ورمت *** منهم أقدامهم في قرب‏\n\n\n### [المحب ذليل والمحبوب ذو دلال‏]\n\n\nقال الله تعالى قُلْ إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله ومن أحب الله ذل ومن أحبه الله دل فالمحب ذليل والمحبوب ذو دلال ودلال وقال صَلَّى اللهُ عَليهِ وسَلَّم إن الله أدبني فأحسن أدبي‏\n\n\n### [الشرائع آداب الله لعباده‏]\n\n\nواعلم أنه لتعريف الله بمنازل الخلق عنده من ولي وغيره طريقين الطريق الواحدة الكشف فيرى منازل الخلق عند الله فيعامل كل طائفة بمنزلها من الله والطريق الأخرى ملازمة الأدب الإلهي والأدب الإلهي هو ما شرعه لعباده في رسله وعلى ألسنتهم فالشرائع آداب الله التي نصبها لعباده فمن وفى بحق شرعه فقد تأدب بأدب الحق وعرف أولياء الحق فإذا رأيت من جمع الخير بيديه وملأهما به فتعلم أنه قد أخذ بأدب الله‏\n\n\nفإن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يقول لربه وهو الصادق العالم بربه والخير كله بيديك‏\n\n\nفالخير إذا أردت أن تعرفه فاعلم أنه جماع مكارم الأخلاق وهي معروفة عرفا وشرعا وكل ما تراه من إقامة الحدود على من لو لم يأمرك الحق بذلك لكنت تعفو عنه فذلك لا يقدح في مكارم الأخلاق مع هذا الشخص فإنك ما فعلت به ما فعلت لنفسك وإنما الله فعل بعبده ما شاء على يدك وكلاكما عبد لسيد واحد وإنما كلامنا فيما يرجع إليك لا لأمر سيدك فإنه من مكارم الأخلاق في العبيد امتثال أوامر سيدهم في عباده والوقوف عند حدوده ومراسمه فيهم لا تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ أَوْ أَبْناءَهُمْ أَوْ إِخْوانَهُمْ أَوْ عَشِيرَتَهُمْ‏\nفكونهم حادوا الله ورسوله هو الذي عاد عليهم فهم جنوا على أنفسهم ما جنى عليهم صاحب مكارم الأخلاق فمن تعرض لأمر فقد أحب أن يتعرض إليه فيه فما فعلت معه في عدم ودك فيه إلا ما أحب ولا تكون مكارم الأخلاق إلا أن تفعل مع الشخص ما يحبه منك فإنه قد بغضك أولا لإيمانك بالله واليوم الآخر وأتخذك عدوا فمن مكارم خلقك معه أن تتلطف به في إيمانه فإن لم ينفع فلتقابله بالقهر فإن لم يفعل ولج فقدرت على قتله فاقتله بمكارم خلق منك حتى لا يبقى في الحياة الدنيا فيزيد كفرا وطغيانا فيزيده الله عذابا كما فعل من شهد الله له بأنه رحيم وهو خضر اقتلع رأس الغلام وقال إنه طبع كافرا فلو عاش أرهق أبويه طغيانا وكفرا وانتظم الغلام في سلك الكفار فقتله الخضر رحمة به وبابويه أما الصبي حيث أخرجه من الدنيا على الفطرة فسعد الغلام والله أعلم وسعد أبواه وهذا من أعظم مكارم الأخلاق كان بعض الصالحين يسأل الله الغزاة فلا يسهل الله له أسبابها ويحول بينه وبين الجهاد في سبيل الله وكان من الأولياء الأكابر عند الله ممن له حديث مع الله فبقي حائرا في تأخره وتعذر الأسباب عليه مع ما قد حصل في نفسه من حب الجهاد لما فيه من مرضاة الله ولما للشهداء عند الله فلما علم الله أنه قد ضاق صدره لذلك أعلمه الله بالطريقة التي كان يأخذ العلم عن الله بها فقال له لا يضيق صدرك من أجل تعذر أسباب الجهاد عليك فإني قضيت عليك لو غزوت لأسرت ولو أسرت لتنصرت ومت نصرانيا وإن لم تغز بقيت سالما في بيتك ومت عبدا صالحا على الإسلام فشكر الله على ذلك وعلم إن الله تعالى قد اختار له ما هو الأسعد في حقه فسكن خاطره وعلم إن الله قد اختار له ما له فيه الخيرة عنده أيضا من آداب الله الذي ينبغي للعبد أن يتأدب بها مع الله فإذا رأيت من سلم واستسلم وقامت به آداب الحق وقام بها في نفسه وفي عباده وتأدب مع الصفة لا مع الأشخاص ويتخيل صاحب الصفة أنه تأدب معه وما عنده خبر بحال هذا الأديب فإنه ينظر العالم بعين الحق وعين الحق تنظر إليهم بما أعطاها علم الله بهم وعلم الله بهم ما هم عليه من الأحوال فإن الذوات التي تقوم بها الأحوال لا يحكم عليهم من حيث ذواتهم سعادة ولا شقاء وإنما ذلك بما يقوم بالذوات من الصفات فالصفات لا تتصف بالشقاء لذاتها ولا بالسعادة والذوات الحاملة للصفات لا تتصف أيضا لنفسها وعينها بسعادة ولا شقاء فإذا قامت الصفات بالذوات وظهرت أحكامها فيها اتصفت الذوات بحسب ما حصل من الامتزاج الذي لم يكن ولا لواحد منهما على الانفراد فقيل عند ذلك في الشخص سعيد أو شقي فانظر ما أعجب حديث السعادة والشقاء حيث لم يظهر واحد منهما إلا بحسب الامتزاج كما لم يظهر سواد المداد إلا بامتزاج العفص والزاج كما لم يظهر بياض الشقة إلا بين الشقة والقصارة فالخوف كله من التركيب والآفات كلها إنما تطرأ على الشخص من كونه مركبا والخروج عن التركيب يعقل وليس بواقع في العالم أصلا المركب ولهذا قال أبو يزيد إنه لا صفة له فإنه أقيم في معقولية بساطته فلم ير تركيبا فقال لا صفة لي فصدق ولكنه غير واقع في الوجود الحسي العيني فما ثم إلا مركب يقبل السعادة أو بالشقاء بحسب ما تقتضيه مزجته فقد فرغ ربك وما كان فراغه عن مانع شغل وإنما أراد بذلك التنزيه أي أن الأمور لا تقع إلا على ما هي عليه في نفسها ومن عصمه الله من الزلل الذي يقتضيه هذا المشهد فقد اعتنى الله به الاعتناء الأعظم ومن هنا زلت الاقدام كما جاء في الشريعة نظيره‏\n\n\nلما ذكر النبي صَلَّى اللهُ عَليهِ وسَلَّم من سبق الكتاب على العبد بالسعادة أو بالشقاء فقالت الصحابة يا رسول الله ففيم العمل فقال لهم رسول الله صَلَّى اللهُ عَليهِ وسَلَّم اعملوا فكل ميسر لما يسر له‏\n\n\nوقد بين الحق بإرساله عليهم أسباب الخير وطرقه وأسباب الشقاء والشر وطرقه وجعل السلوك في طرق الخير بشرى فانظرها في نفسك فإن وجدت الأمر عندك إذا كنت في الخير مثلا واجدا باطنك وظاهرك فيه على السواء غير مرتاب فتلك البشرى فافرح بها في السعادة فإن الله ما يبدلك وإن رأيت الخير في ظاهرك وتجد في باطنك نكتة من شك أو اضطراب فيما أنت فيه من عبادة ويقع لك خاطر يقدح في أصلها بما يخالف ظاهر الفعل‏\n\n\n### [إن الله لم يعطك إيمانا ولا نور قلبك بنوره‏]\n\n\nفاعلم إن الله لم يعطك إيمانا ولا نور قلبك بنوره فابك على نفسك أو أضحك فما لك في الآخرة من خلاق هذا ميزانك في نفسك وأنت أعرف بنفسك وما يخطر لك فيها ولهذا\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الصحيح إن الرجل ليعمل بعمل أهل الجنة فيما يبدو للناس فإنه يبدو لله منه هذا الخاطر الذي يقدح في‏\nالايمان من الشك القائم به إن الأمر الذي هو فيه من الشرع ما هو على ما يعطيه الظاهر هذا هو البلاء المبين وإن الرجل ليعمل بعمل أهل النار فيما يبدو للناس يعني من المخالفات والذي يبدو لله من باطنه خلاف هذا من نور الايمان والصدق مع الله في إن هذا الحال التي هو عليها مخالف لأمر الله فيبكي باطنا ويخالف ظاهرا فيبدو لله منه ما لا يبدو للناس‏\n\n\nفقد أبان صَلَّى اللهُ عَليهِ وسَلَّم في هذا الخبر ما الناس عليه في أنفسهم ثم لتعلم إن في ترجمة هذه المنازلة من الحق إشارة لطيفة المعنى في استفهامه عز وجل عما هو به عالم مثل‏\n\n\nقوله لملائكته كيف تركتم عبادي‏\n\n\nوالملائكة تعلم أنه تعالى أعلم بعباده منهم أَ لا يَعْلَمُ من خَلَقَ وجميع ما هم فيه خلقه تعالى وهُوَ اللَّطِيفُ بسؤاله الْخَبِيرُ بما سأل عنه لأنه واقع فكل علم عنده عن وقوع فهو به خبير وتعلقه به قبل وقوعه هو به عليم فمن أدب الملائكة لعلمهم بما قصد الحق منهم‏\n\n\nأجابوه تعالى فقالوا تركناهم وهم يصلون وأتيناهم وهم يصلون لأن عروج الملائكة عنهم ونزولهم عليهم كان عند صلاة العصر وصلاة الصبح كذا ورد الخبر\n\n\nفأقول مجيبا للحق عرفتهم لما عرفت آدابك فنسبتهم إليك فقلت هؤلاء أولياء الله وعلامتهم إذا رأوا ذكر الله لتحققهم بالله وليس إلا العبودة المحضة الخالصة التي لا تشوبها ربوبية بوجه من الوجوه فهذه آدابك وكل نعت يرى فيهم فيه رائحة ربوبية فهو أدب الخلافة لا أدب الولاية فالولي ينصر ولا ينتصر والخليفة ينتصر وينتصر والزمان لا يخلو من منازع والولي لا يسامح فإن سامح فليس بولي ولا يؤثر على جناب الحق شيئا فهو كله لله والخليفة هو لله في وقت وللعالم في وقت فوقتا يرحج جناب الحق غيرة ووقتا يرجح جناب العالم فيستغفر لهم مع ما وقع منهم مما يغار له الولي وهؤلاء هم المفردون الذين تولى الله آدابهم بنفسه يقول الخليفة لأزيدن على السبعين في وقت ويدعو على رعل وذكوان وعصية في وقت وأين الحال من الحال فالخليفة تختلف عليه الأحوال والولي لا تختلف عليه الحال فالولي لا يتهم أصلا والخليفة قد يتهم لاختلاف الحال عليه فما يدعي دعوى إلا وعجزه يكذبه مع صدقه حال آخر يبدو منه فآداب الأولياء آداب الأرواح الملكية أ لا ترى إلى جبريل عليه السلام يأخذ حال البحر فيلقمه في فم فرعون حتى لا يتلفظ بالتوحيد ويسابقه مسابقة غيرة على جناب الحق مع علمه بأنه قد علم أنه لا إله إلا الله وغلبه فرعون فإنه قال كلمة التوحيد بلسانه كما أخبر الله تعالى عنه في الكتاب العزيز والخليفة يقول لعمه قلها في أذني أشهد لك بها عند الله وهو يأبى وأين هذا الحال من حال قول الخليفة الآخر رَبِّ لا تَذَرْ عَلَى الْأَرْضِ من الْكافِرِينَ دَيَّاراً ولعلهم لو طال عليهم‏\n\n\nالأمد لرجعوا أو في أصلابهم من يؤمن بالله فتقر به أعين المؤمنين فآداب الأولياء غضب في الْمَغْضُوبِ عَلَيْهِمْ لا رجوع فيه ورضاء في المرضي عنهم لا رجوع فيه فإن ذلك أدب الحق والحق الواقع الواجب وقوعه وآداب الخلفاء الرضاء في المرضي عنهم والعفو وقتا والغضب وقتا في الْمَغْضُوبِ عَلَيْهِمْ ولهذا خص الأولياء دون غيرهم في‏\n\n\nقوله هل عرفت أوليائي والكل أولياء\n\n\nولكن أولياء الأسماء الإلهية وهؤلاء أولياء الإضافة فهم أولياء إنية لا أولياء أسماء وسأعرفك بالفرق بين أسماء الكنايات والأسماء الظاهرة إن شاء الله في باب الأسماء من آخر هذا الكتاب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 445: Concerning the Knowledge of the Station: \"Have you known My Friends whom I disciplined with My Disciplines?\"\n\nThe Prophets of Allah, none disciplined them\nBut Him, so they clung to discipline (adab).\n\nThey are the Masters; He does not abandon them;\nThus is their essence (عينهم) in the Scriptures.\n\nSo, whoever walks in their footsteps\nIs counted among the noble ones (al-nujabā') thereby.\n\nAnd if it is thus and thus,\nHe remains behind the veils (al-ḥujub) for that reason.\n\nThe happiest of people is their follower,\nAnd you see him like them in hardship (al-naṣab).\n\nThey clung to the prayer niche (al-miḥrāb) until\nTheir feet swelled from their proximity (qurb).\n\n### [The Lover is Abased and the Beloved is Possessed of Coyness]\n\nAllah the Exalted said: <<قُلْ إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله>> (Say: 'If you love Allah, then follow me, [and] Allah will love you'). Whoever loves Allah is abased (dhalla), and whoever Allah loves is possessed of grace (dalla). Thus, the lover is abased (dhālīl), and the Beloved is possessed of grace and coyness (dhū dalāl). And the Prophet, peace and blessings be upon him, said: \"Indeed, Allah disciplined me (addabanī) and perfected my discipline (adabī).\"\n\n### [The Divine Laws are Allah's Disciplines for His Servants]\n\nKnow that for Allah to make known the stations (manāzil) of creation (al-khalq) with Him—whether a Friend (walī) or otherwise—there are two paths. The first path is Unveiling (الكشف), whereby one sees the stations of creation with Allah and treats every group according to its station with Allah. The other path is adherence to the Divine Discipline (الأدب الإلهي). The Divine Discipline is that which He legislated (shara'ahu) for His servants through His messengers and upon their tongues.\n\nThus, the Divine Laws (al-sharā'i') are the disciplines of Allah which He established for His servants. Whoever fulfills the right of His Law has been disciplined by the discipline of The Real (أدب الحق) and has known the Friends of The Real (أولياء الحق). If you see someone who gathers goodness (al-khayr) with both hands and fills them with it, know that he has adopted the discipline of Allah.\n\nFor the Messenger of Allah, peace and blessings be upon him—who is the truthful one, knowing his Lord—says to his Lord: \"And all goodness is in Your hands.\"\n\nIf you wish to know goodness, know that it is the sum total of noble character traits (makārim al-akhlāq), which are known both customarily ('urfan) and legally (shar'an). And everything you see regarding the establishment of legal punishments (al-ḥudūd) upon someone—even if The Real had not commanded you to do so, you would have pardoned him—that does not detract from noble character traits concerning this person. For you did not do what you did to him for your own sake; rather, Allah did what He willed to His servant through your hand. And both of you are servants of one Master.\n\nOur discussion is only concerning what pertains to you, not concerning the command of your Master. For it is among the noble character traits of servants to obey the commands of their Master regarding His servants, and to stand at the limits (ḥudūd) and ordinances (marāsim) He set for them. <<لا تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ أَوْ أَبْناءَهُمْ أَوْ إِخْوانَهُمْ أَوْ عَشِيرَتَهُمْ>> (You will not find a people who believe in Allah and the Last Day loving those who oppose Allah and His Messenger, even if they were their fathers or their sons or their brothers or their kindred).\n\nTheir opposition (ḥādū) to Allah and His Messenger is what rebounded upon them. They committed the offense against themselves, not the possessor of noble character traits against them. Whoever exposes himself to a matter has desired that he be exposed to it. Thus, in withholding your affection from him, you have done nothing but what he desired. Noble character traits are only realized when you do with a person what he loves from you. For he first hated you because of your belief in Allah and the Last Day, and he took you as an enemy. Thus, part of your noble character towards him is to treat him gently regarding his faith. If that does not benefit, then confront him with subjugation (al-qahr). If he does not comply and persists, and you are able to kill him, then kill him out of noble character from you, so that he does not remain in the life of this world, increasing in disbelief (kufr) and transgression (ṭughyān), thereby increasing Allah's punishment upon him.\n\nThis is as was done by the one whom Allah testified was merciful—namely, Khidr—who tore off the head of the boy, saying that he was created as a disbeliever. Had he lived, he would have burdened his parents with transgression and disbelief. The boy was enrolled among the ranks of the disbelievers, so Khidr killed him out of mercy for him and for his parents. As for the child, since he was taken out of the world upon the primordial nature (al-fiṭra), the boy was made happy (sa'ida), and Allah knows best, and his parents were made happy. This is one of the greatest noble character traits.\n\nOne of the righteous used to ask Allah for military expeditions (al-ghazwāt), but Allah did not facilitate the means for him and placed a barrier between him and striving (jihād) in the way of Allah. He was one of the great Friends (al-Awliyā' al-akābir) with Allah, one who had discourse with Allah. He remained perplexed by the delay and the difficulty of the means, despite the love of striving that had arisen in his soul, due to the pleasure of Allah found therein and the status of the martyrs with Allah. When Allah knew that his breast was constrained by this, He informed him through the method by which he used to receive Knowledge ('ilm) from Allah, saying to him: \"Do not let your breast be constrained because of the difficulty of the means of striving for you. For I have decreed upon you that if you were to go on an expedition, you would be captured. If you were captured, you would become Christian and die a Christian. But if you do not go on an expedition, you will remain safe in your house and die a righteous servant upon Islam.\" So he thanked Allah for that and knew that Allah the Exalted had chosen for him what was most felicitous (al-as'ad) for him. His mind was set at ease, and he knew that Allah had chosen for him what was best (al-khīra) in His sight.\n\nThis is also among the disciplines of Allah (ādāb Allāh) with which the servant ought to discipline himself towards Allah. Thus, if you see someone who submits (sallama) and surrenders (istaslama), and the disciplines of The Real (ādāb al-Ḥaqq) are established in him, and he establishes them in himself and among His servants, and he disciplines himself with the Attribute (al-Ṣifa) and not with the persons (al-ashkhāṣ)—the possessor of the Attribute imagines that [the disciplined one] has disciplined himself towards him, yet he has no knowledge of the state of this disciplined person. For he looks upon the world ('ālam) with the Eye of The Real ('ayn al-Ḥaqq), and the Eye of The Real looks upon them according to what the Knowledge of Allah has given it concerning them, and the Knowledge of Allah concerning them is what states they are in.\n\nFor the Essences (al-dhawāt) in which the states (al-aḥwāl) subsist are not judged as happy (sa'āda) or wretched (shaqā') merely by virtue of their Essences. Rather, that judgment is based on the Attributes (al-Ṣifāt) that subsist in the Essences. The Attributes are not characterized by wretchedness or happiness by themselves, nor are the Essences that bear the Attributes characterized by happiness or wretchedness merely by themselves or their own essence ('ayn). But when the Attributes subsist in the Essences and their rulings (aḥkāmuhā) appear within them, the Essences are characterized according to the resulting mixture (al-imtezāj), which did not belong to either one of them individually. It is then said of the person that he is happy or wretched. Look how wondrous is the discourse of happiness and wretchedness, since neither of them appears except according to the mixture, just as the blackness of ink does not appear except through the mixture of gallnuts ('afṣ) and vitriol (zāj), and just as the whiteness of the cloth (al-shuqqa) does not appear except between the cloth and the bleaching (al-qiṣāra).\n\nAll fear stems from composition (al-tarkīb), and all afflictions (al-āfāt) only befall a person because he is composite. Departure from composition is conceivable, but it is not actually realized in the composite world ('ālam) at all. For this reason, Abū Yazīd said that he had no attribute (ṣifa), for he was established in the intelligibility (ma'qūliyya) of his simplicity (basāṭatihi) and did not perceive composition. So he said, \"I have no attribute,\" and he spoke truly. However, this is not realized in sensory, concrete Existence (al-wujūd al-ḥissī al-'aynī). Therefore, there is nothing there except a composite entity (murakkab) that accepts happiness or wretchedness according to what its mixture (muzjatahu) necessitates.\n\nYour Lord has finished (faragha), and His finishing was not due to an impediment of occupation. Rather, by this He intended Transcendance (al-tanzīh), meaning that matters only occur according to what they are in themselves. Whoever Allah protects from the slip (al-zalal) necessitated by this witnessing (mashhad), Allah has shown him the greatest care. It is from this point that feet slip, just as its parallel came in the Divine Law (al-Sharī'a).\n\nWhen the Prophet, peace and blessings be upon him, mentioned the precedence of the Decree (al-kitāb) upon the servant, whether for happiness or wretchedness, the Companions said, \"O Messenger of Allah, then why should we work?\" The Messenger of Allah, peace and blessings be upon him, said to them: \"Work, for everyone is facilitated for that which he has been made easy for.\"\n\nThe Real (al-Ḥaqq) has clarified, by sending [messengers] to them, the means and paths of goodness (al-khayr) and the means and paths of wretchedness and evil (al-sharr). He made the traversing of the paths of goodness a glad tiding (bushrā). Look for it within yourself. If you find that when you are engaged in goodness, for example, your inner (bāṭin) and outer (ẓāhir) states are equally present in it, without doubt, then that is the glad tiding. Rejoice in it in happiness, for Allah will not change you. But if you see goodness in your outer state, yet find in your inner state a point (nukta) of doubt or agitation concerning the worship you are engaged in, and a thought (khāṭir) occurs to you that undermines its foundation by contradicting the apparent action—\n\n### [Indeed, Allah has not given you faith nor illuminated your heart with His Light]\n\n—know that Allah has not given you faith (īmān) nor illuminated your heart with His Light. Weep for yourself or laugh, for you will have no share (khalāq) in the Hereafter. This is your balance (mīzān) within yourself, and you know best about yourself and what occurs to you within it. For this reason, the Messenger of Allah, peace and blessings be upon him, said in the Authentic Collection (al-Ṣaḥīḥ): \"Indeed, a man performs the deeds of the people of Paradise in what appears to people, but there appears to Allah from him this thought which undermines faith due to the doubt subsisting in him that the matter he is engaged in from the Divine Law (al-Shar') is not as the apparent state suggests. This is the manifest affliction (al-balā' al-mubīn).\" \"And indeed, a man performs the deeds of the people of the Fire in what appears to people\"—meaning, acts of disobedience—\"but what appears to Allah from his inner state (bāṭinihi) is contrary to this, due to the light of faith and sincerity (al-ṣidq) with Allah, [knowing] that this state he is upon contradicts the command of Allah. So he weeps inwardly and disobeys outwardly, and there appears to Allah from him what does not appear to people.\"\n\nThus, the Prophet, peace and blessings be upon him, clarified in this report what people are upon in their souls.\n\nFurthermore, know that in the title of this station (munāzala) from The Real, there is a subtle indication in meaning regarding His questioning, exalted is He, about that which He already knows, such as His saying to His angels: \"How did you leave My servants?\" The angels know that He the Exalted is more knowledgeable of His servants than they are. <<أَ لا يَعْلَمُ من خَلَقَ>> (Does He who created not know?), and all that they are engaged in is His creation, the Exalted. He is the Subtle (اللَّطِيفُ) in His questioning, the All-Aware (الْخَبِيرُ) of what He asks about, because it is actualized (wāqi'). Every knowledge ('ilm) He possesses concerning an occurrence (wuqū') makes Him All-Aware (khabīr) of it, and His relation to it before its occurrence makes Him All-Knowing ('alīm) of it.\n\nThus, out of the discipline (adab) of the angels, due to their knowledge of what The Real intended from them, they answered Him the Exalted, saying: \"We left them while they were praying, and we came to them while they were praying.\" This is because the ascent of the angels from them and their descent upon them occurred at the time of the 'Aṣr prayer and the Fajr prayer, as the report states.\n\nSo I say, answering The Real: I knew them when I knew Your disciplines (ādābuka), so I attributed them to You and said: \"These are the Friends of Allah (أولياء الله).\" Their sign is that when they are seen, Allah is mentioned, due to their realization (taḥaqquq) of Allah. And there is nothing but pure, unadulterated servanthood (العبودة المحضة الخالصة) that is not tainted by Lordship (rubūbiyya) in any respect whatsoever. These are Your disciplines. Every description (na't) seen in them that carries a scent of Lordship is the discipline of Vicegerency (أدب الخلافة), not the discipline of Sainthood/Friendship (أدب الولاية).\n\nThe Friend (al-walī) gives victory but does not seek victory for himself. The Vicegerent (al-khalīfa) seeks victory and is given victory. And time is never devoid of a contender (munāzi'). The Friend does not pardon (yusāmiḥ). If he pardons, he is not a Friend. He does not prefer anything over the Divine Presence of The Real (janāb al-Ḥaqq); he is entirely for Allah. The Vicegerent is for Allah at one time and for the world ('ālam) at another. So, at one time, he gives preference to the Divine Presence of The Real out of zeal (ghayra), and at another time, he gives preference to the world, seeking forgiveness for them despite what they have committed, which would provoke the zeal of the Friend.\n\nThese are the Solitaries (al-mufradūn) whose discipline Allah undertook Himself. The Vicegerent says at one time, \"I will increase [forgiveness] beyond seventy,\" and at another time, he prays against Ri'l, Dhakwān, and 'Uṣayya. How different is one state from the other! The states (al-aḥwāl) vary for the Vicegerent, but the state does not vary for the Friend. The Friend is never accused, but the Vicegerent may be accused due to the variation of his state. He makes no claim without his incapacity contradicting him, even with his sincerity, due to another state that appears from him.\n\nThe disciplines of the Friends are the disciplines of the angelic spirits (الأرواح الملكية). Do you not see Gabriel, peace be upon him, taking the mud of the sea and stuffing it into Pharaoh's mouth so that he could not utter the declaration of Unity (al-tawḥīd)? He raced him out of zeal (ghayra) for the Divine Presence of The Real, despite knowing that [Pharaoh] had already known that there is no god but Allah. Yet Pharaoh overcame him, for he spoke the word of Unity with his tongue, as Allah the Exalted informed us in the Glorious Book. The Vicegerent [Muhammad] says to his uncle [Abu Talib], \"Say it in my ear so I may testify for you before Allah,\" but he refuses. And how different is this state from the state of the other Vicegerent [Noah] who said: <<رَبِّ لا تَذَرْ عَلَى الْأَرْضِ من الْكافِرِينَ دَيَّاراً>> (My Lord, leave not upon the earth any dweller from among the disbelievers). Perhaps if their time had been prolonged, they would have returned, or there would have been in their loins those who would believe in Allah, by whom the eyes of the believers would be comforted.\n\nThe disciplines of the Friends are wrath towards those who have incurred wrath (al-maghḍūb 'alayhim) with no turning back, and contentment towards those who are content (al-marḍī 'anhum) with no turning back. For that is the discipline of The Real (أدب الحق) and the actual Reality (al-Ḥaqq al-wāqi') whose occurrence is necessary. The disciplines of the Vicegerents are contentment towards those who are content, and sometimes pardon, and sometimes wrath towards those who have incurred wrath. For this reason, He singled out the Friends (al-Awliyā') above others in His saying: \"Have you known My Friends (أوليائي)?\"—even though all are Friends (awliyā'). But [the others] are the friends of the Divine Names (الأسماء الإلهية), whereas these [the disciplined ones] are the friends of Attribution (al-iḍāfa). They are the friends of 'I-ness' (awliyā' inniyya), not the friends of the Names.\n\nI shall inform you of the difference between the Names of Allusions (asmā' al-kināyāt) and the Manifest Names (الأسماء الظاهرة), if Allah wills, in the Chapter on the Names at the end of this book. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر چار سو پینتالیس: اس معرفت کے بیان میں کہ کیا تم نے میرے ان اولیاء کو پہچانا جنہیں میں نے اپنے آداب سے مؤدب کیا؟\n\nانبیاء اللہ کو کسی اور نے مؤدب نہیں کیا،\nپس انہوں نے ادب کو مضبوطی سے تھام لیا۔\n\nوہ سردار ہیں، انہیں کوئی رسوا نہیں کرتا،\nکتب میں ان کی یہی پہچان ہے۔\n\nجو ان کے نقش قدم پر چلتا ہے،\nوہ اسی وجہ سے نجیبوں (شریفوں) میں شمار ہوتا ہے۔\n\nجب معاملہ ایسا ہو اور پھر ایسا ہو،\nتو وہ اس کے لیے پردوں کے پیچھے سے کبھی نہیں ہٹتا۔\n\nلوگوں میں سب سے زیادہ خوش نصیب وہ ہے جو ان کی پیروی کرتا ہے،\nتو تم اسے مشقت میں ان جیسا ہی پاؤ گے۔\n\nانہوں نے محراب کو لازم پکڑا یہاں تک کہ قرب (قربت) میں\nان کے پاؤں سوج گئے۔\n\n### [محبت کرنے والا ذلیل اور محبوب ناز و ادا والا ہوتا ہے]\n\nاللہ تعالیٰ نے فرمایا:\nقُلْ إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله\n(کہہ دیجیے: اگر تم اللہ سے محبت رکھتے ہو تو میری پیروی کرو، اللہ تم سے محبت کرے گا)۔\nاور جس نے اللہ سے محبت کی وہ ذلیل ہوا، اور جس سے اللہ نے محبت کی وہ ناز و ادا والا ہوا۔ پس محب (محبت کرنے والا) ذلیل ہوتا ہے اور محبوب ناز و ادا (دلال) والا ہوتا ہے۔\nاور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا:\n\"إن الله أدبني فأحسن أدبي\"\n(بیشک اللہ نے مجھے مؤدب کیا اور میرے ادب کو بہترین بنا دیا)۔\n\n### [شرائع اللہ کے بندوں کے لیے آداب ہیں]\n\nجان لو کہ اللہ کے نزدیک مخلوق کے مراتب (ولی یا غیر ولی) کو جاننے کے دو طریقے ہیں۔ ایک طریقہ الکشف (کشف) ہے، جس میں سالک اللہ کے نزدیک مخلوق کے مراتب کو دیکھتا ہے، پھر ہر گروہ کے ساتھ اللہ کے ہاں ان کے مرتبے کے مطابق معاملہ کرتا ہے۔ دوسرا طریقہ ادب الٰہی (الأدب الإلهي) کو لازم پکڑنا ہے۔ اور ادب الٰہی (الأدب الإلهي) وہ ہے جو اللہ نے اپنے رسولوں کے ذریعے اور ان کی زبانوں پر اپنے بندوں کے لیے مشروع کیا ہے۔ پس شرائع اللہ کے وہ آداب ہیں جو اس نے اپنے بندوں کے لیے مقرر کیے ہیں۔ لہٰذا جس نے اپنی شریعت کا حق پورا کیا، اس نے ذات حق (الحق) کے ادب کو اپنایا اور اولیاء حق (أولياء الحق) کو پہچان لیا۔ پس جب تم کسی ایسے شخص کو دیکھو جس نے خیر کو اپنے دونوں ہاتھوں میں جمع کر لیا اور انہیں اس سے بھر لیا، تو جان لو کہ اس نے اللہ کے ادب کو اپنا لیا ہے۔\n\nکیونکہ رسول اللہ صلی اللہ علیہ وسلم اپنے رب سے فرماتے ہیں، اور وہ اپنے رب کے بارے میں سچے اور جاننے والے ہیں: \"اور خیر (بھلائی) سب تیرے ہی ہاتھوں میں ہے\"۔\n\nپس اگر تم خیر کو جاننا چاہو تو جان لو کہ یہ مکارم اخلاق (اخلاق حسنہ) کا مجموعہ ہے، اور یہ عرفاً اور شرعاً معروف ہیں۔ اور جو کچھ تم حدود قائم کرنے میں دیکھتے ہو، اس شخص پر جس سے تم ذات حق (الحق) کے حکم کے بغیر درگزر کر جاتے، تو یہ اس شخص کے ساتھ مکارم اخلاق میں نقص پیدا نہیں کرتا۔ کیونکہ تم نے جو کچھ اس کے ساتھ کیا وہ اپنے لیے نہیں کیا، بلکہ اللہ نے اپنے بندے کے ساتھ جو چاہا تمہارے ہاتھ پر کیا۔ اور تم دونوں ایک ہی آقا کے بندے ہو۔ اور ہماری گفتگو اس بارے میں ہے جو تمہاری طرف لوٹتا ہے، نہ کہ تمہارے آقا کے حکم کے بارے میں۔ کیونکہ بندوں کے لیے مکارم اخلاق میں سے یہ ہے کہ وہ اپنے آقا کے احکامات کی تعمیل اس کے بندوں کے معاملے میں کریں اور ان کے بارے میں اس کی حدود اور رسموں پر قائم رہیں۔\nلا تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ أَوْ أَبْناءَهُمْ أَوْ إِخْوانَهُمْ أَوْ عَشِيرَتَهُمْ\n(تم کسی ایسی قوم کو نہیں پاؤ گے جو اللہ اور یوم آخرت پر ایمان رکھتی ہو کہ وہ ان لوگوں سے دوستی رکھیں جنہوں نے اللہ اور اس کے رسول کی مخالفت کی، خواہ وہ ان کے باپ ہوں یا ان کے بیٹے یا ان کے بھائی یا ان کا قبیلہ)۔\n\nپس ان کا اللہ اور اس کے رسول کی مخالفت کرنا ہی ان پر لوٹا ہے۔ انہوں نے خود اپنے اوپر ظلم کیا، نہ کہ صاحب مکارم اخلاق نے ان پر ظلم کیا۔ پس جس نے کسی معاملے کا سامنا کیا، اس نے پسند کیا کہ اس معاملے میں اس کا سامنا کیا جائے۔ لہٰذا تم نے اس کے ساتھ اپنی عدم محبت میں وہی کیا جو اس نے پسند کیا۔ اور مکارم اخلاق صرف یہ ہے کہ تم کسی شخص کے ساتھ وہ کرو جو وہ تم سے پسند کرتا ہے۔ کیونکہ اس نے تمہارے ساتھ تمہارے اللہ اور یوم آخرت پر ایمان کی وجہ سے پہلے ہی بغض رکھا اور تمہیں دشمن بنا لیا۔ پس تمہارے مکارم اخلاق میں سے یہ ہے کہ تم اس کے ایمان کے معاملے میں اس کے ساتھ نرمی برتو۔ اگر یہ فائدہ نہ دے تو تم قہر (غلبہ) سے اس کا مقابلہ کرو۔ اگر وہ باز نہ آئے اور ہٹ دھرمی کرے اور تم اسے قتل کرنے پر قادر ہو جاؤ تو اسے اپنے مکارم اخلاق کی بنا پر قتل کر دو، تاکہ وہ دنیا کی زندگی میں باقی نہ رہے اور کفر و سرکشی میں اضافہ نہ کرے، جس سے اللہ اس کے عذاب میں اضافہ کرے۔ جیسا کہ اس شخص نے کیا جس کے بارے میں اللہ نے گواہی دی کہ وہ رحیم ہے، یعنی خضر علیہ السلام، جنہوں نے لڑکے کا سر اڑا دیا اور کہا کہ وہ کافر پیدا ہوا تھا۔ اگر وہ زندہ رہتا تو اپنے والدین کو سرکشی اور کفر میں مبتلا کر دیتا۔ اور وہ لڑکا کفار کے زمرے میں شامل ہو گیا تھا، پس خضر نے اسے اور اس کے والدین پر رحمت کرتے ہوئے اسے قتل کر دیا۔ جہاں تک بچے کا تعلق ہے، چونکہ اسے فطرت پر دنیا سے نکال دیا گیا، تو لڑکا کامیاب ہو گیا، اور اللہ بہتر جانتا ہے، اور اس کے والدین بھی کامیاب ہو گئے۔ اور یہ مکارم اخلاق میں سے سب سے عظیم ہے۔\nبعض صالحین اللہ سے جہاد کی درخواست کرتے تھے، لیکن اللہ ان کے لیے اس کے اسباب آسان نہیں کرتا تھا اور ان کے اور جہاد فی سبیل اللہ کے درمیان رکاوٹ ڈال دیتا تھا۔ وہ اللہ کے نزدیک اکابر اولیاء (الأولياء الأكابر) میں سے تھے جن کی اللہ سے گفتگو ہوتی تھی۔ وہ اس تاخیر اور اسباب کی عدم دستیابی پر حیران رہے، باوجود اس کے کہ ان کے دل میں جہاد کی محبت تھی، کیونکہ اس میں اللہ کی رضا تھی اور شہداء کے لیے اللہ کے ہاں جو کچھ ہے۔ جب اللہ نے جان لیا کہ ان کا سینہ اس وجہ سے تنگ ہو گیا ہے، تو اللہ نے انہیں اس طریقے سے آگاہ کیا جس سے وہ اللہ سے علم حاصل کرتے تھے، پس اللہ نے ان سے فرمایا: \"جہاد کے اسباب کی عدم دستیابی کی وجہ سے تمہارا سینہ تنگ نہ ہو، کیونکہ میں نے تم پر یہ فیصلہ کر دیا تھا کہ اگر تم جہاد کرتے تو قید ہو جاتے، اور اگر قید ہوتے تو نصرانی بن جاتے اور نصرانی حالت میں مرتے۔ اور اگر تم جہاد نہ کرو تو اپنے گھر میں سلامت رہو گے اور اسلام پر ایک صالح بندے کی حیثیت سے مرو گے۔\" پس انہوں نے اللہ کا شکر ادا کیا اور جان لیا کہ اللہ تعالیٰ نے ان کے حق میں وہ چیز منتخب کی ہے جو زیادہ سعادت مند ہے۔ پس ان کا دل مطمئن ہو گیا اور انہوں نے جان لیا کہ اللہ نے ان کے لیے وہ چیز منتخب کی ہے جس میں اس کے نزدیک بھی ان کے لیے بہتری ہے۔ یہ بھی اللہ کے آداب میں سے ہے کہ بندے کو چاہیے کہ وہ اللہ کے ساتھ ان آداب کو اپنائے۔\n\nپس جب تم کسی ایسے شخص کو دیکھو جو سلامتی میں رہا اور اس نے سر تسلیم خم کیا، اور ذات حق (الحق) کے آداب اس میں قائم ہو گئے اور اس نے انہیں اپنے نفس میں اور اس کے بندوں میں قائم کیا، اور وہ صفت کے ساتھ ادب کرتا ہے نہ کہ اشخاص کے ساتھ، اور صاحب صفت یہ گمان کرتا ہے کہ اس نے اس کے ساتھ ادب کیا ہے، حالانکہ اسے اس مؤدب شخص کے حال کی خبر نہیں ہوتی۔ کیونکہ وہ عالم کو ذات حق (الحق) کی آنکھ سے دیکھتا ہے، اور ذات حق (الحق) کی آنکھ انہیں اس علم کے مطابق دیکھتی ہے جو اللہ نے انہیں ان کے بارے میں دیا ہے، اور اللہ کا علم ان کے احوال کے بارے میں وہی ہے جس پر وہ قائم ہیں۔ کیونکہ وہ ذوات جن میں احوال قائم ہوتے ہیں، ان پر ان کی ذوات کے اعتبار سے سعادت یا شقاوت کا حکم نہیں لگایا جاتا، بلکہ یہ ان صفات کی وجہ سے ہوتا ہے جو ذوات میں قائم ہوتی ہیں۔ پس صفات اپنی ذات کے اعتبار سے نہ شقاوت سے متصف ہوتی ہیں اور نہ سعادت سے، اور صفات کو اٹھانے والی ذوات بھی اپنی ذات اور عین کے اعتبار سے نہ سعادت سے متصف ہوتی ہیں اور نہ شقاوت سے۔ پس جب صفات ذوات میں قائم ہوئیں اور ان کے احکام ان میں ظاہر ہوئے، تو ذوات اس امتزاج کے مطابق متصف ہو گئیں جو ان میں سے کسی ایک کے لیے بھی انفرادی طور پر نہیں تھا۔ تب اس شخص کے بارے میں کہا گیا کہ وہ سعید (خوش بخت) ہے یا شقی (بد بخت)۔\nپس دیکھو سعادت اور شقاوت کا معاملہ کتنا عجیب ہے، کہ ان میں سے کوئی بھی ظاہر نہیں ہوا مگر امتزاج کے مطابق، جیسا کہ سیاہی کا سیاہ رنگ ظاہر نہیں ہوتا مگر مازو (عفص) اور زاج (کیمیکل) کے امتزاج سے، جیسا کہ کپڑے کی سفیدی ظاہر نہیں ہوتی مگر کپڑے اور دھوبی کے درمیان۔ پس سارا خوف ترکیب (الترکیب) سے ہے، اور تمام آفات شخص پر اس کے مرکب ہونے کی وجہ سے ہی آتی ہیں۔ اور ترکیب سے نکلنا عقلی طور پر ممکن ہے لیکن یہ عالم مرکب میں اصلاً واقع نہیں ہے۔ اسی لیے ابو یزید (بسطامی) نے کہا کہ ان کی کوئی صفت نہیں ہے، کیونکہ انہیں ان کی بساطت (سادگی) کی معقولیت میں قائم کیا گیا، پس انہوں نے ترکیب کو نہیں دیکھا، تو انہوں نے کہا: \"میری کوئی صفت نہیں ہے\"، اور انہوں نے سچ کہا۔ لیکن یہ وجود حسی عینی (الوجود الحسي العيني) میں واقع نہیں ہے۔ پس وہاں صرف مرکب ہی ہے جو اپنی آمیزش کے تقاضے کے مطابق سعادت یا شقاوت کو قبول کرتا ہے۔\nپس تمہارا رب فارغ ہو چکا ہے، اور اس کا فارغ ہونا کسی مشغولیت کے مانع ہونے کی وجہ سے نہیں تھا، بلکہ اس سے مراد تنزیہ (التنزیہ) ہے، یعنی امور صرف اسی طرح واقع ہوتے ہیں جس طرح وہ اپنی ذات میں ہیں۔ اور جسے اللہ نے اس مشہد کے تقاضے سے پیدا ہونے والی لغزش (الزلل) سے محفوظ رکھا، تو اللہ نے اس پر سب سے زیادہ توجہ دی۔ اور یہیں سے قدم ڈگمگائے ہیں، جیسا کہ شریعت میں اس کی نظیر آئی ہے۔\n\nجب نبی اکرم صلی اللہ علیہ وسلم نے اس بات کا ذکر کیا کہ کتاب (تقدیر) بندے پر سعادت یا شقاوت کے ساتھ سبقت لے چکی ہے، تو صحابہ نے عرض کیا: یا رسول اللہ! پھر عمل کس لیے؟ تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: \"عمل کرو، کیونکہ ہر ایک کو اس کے لیے آسان کر دیا گیا ہے جس کے لیے وہ پیدا کیا گیا ہے۔\"\n\nاور ذات حق (الحق) نے ان پر خیر کے اسباب اور اس کے راستے، اور شقاوت اور شر کے اسباب اور اس کے راستے بھیج کر واضح کر دیا ہے۔ اور خیر کے راستوں پر چلنے کو بشارت قرار دیا ہے۔ پس اسے اپنے نفس میں دیکھو۔ اگر تم اپنے اندر یہ پاؤ کہ جب تم خیر میں ہو، مثلاً، تو تمہارا باطن اور ظاہر اس میں یکساں ہے اور تم شک کرنے والے نہیں ہو، تو یہ بشارت ہے، پس اس سعادت پر خوش ہو جاؤ، کیونکہ اللہ تمہیں نہیں بدلے گا۔ اور اگر تم خیر کو اپنے ظاہر میں دیکھو لیکن اپنے باطن میں شک یا اضطراب کا کوئی نقطہ پاؤ اس عبادت کے بارے میں جس میں تم ہو، اور تمہارے دل میں کوئی ایسا خیال آئے جو اس کی اصل میں نقص پیدا کرے اور ظاہر فعل کے خلاف ہو،\n\n### [بیشک اللہ نے تمہیں ایمان نہیں دیا اور نہ ہی تمہارے دل کو اپنے نور سے منور کیا]\n\nتو جان لو کہ اللہ نے تمہیں ایمان نہیں دیا اور نہ ہی تمہارے دل کو اپنے نور سے منور کیا ہے۔ پس تم اپنے اوپر روؤ یا ہنسو، آخرت میں تمہارا کوئی حصہ نہیں ہے۔ یہ تمہارے نفس میں تمہارا میزان ہے، اور تم اپنے نفس اور اس میں آنے والے خیالات کو سب سے زیادہ جانتے ہو۔ اور اسی لیے\n\nرسول اللہ صلی اللہ علیہ وسلم نے صحیح حدیث میں فرمایا: \"بیشک ایک شخص اہل جنت کے عمل کرتا ہے، جیسا کہ لوگوں کو دکھائی دیتا ہے، لیکن اللہ کے لیے اس سے وہ خیال ظاہر ہوتا ہے جو ایمان میں شک کی وجہ سے نقص پیدا کرتا ہے جو اس میں قائم ہے کہ وہ شرعی معاملہ جس میں وہ ہے، وہ اس طرح نہیں ہے جیسا کہ ظاہر دیتا ہے۔ یہی واضح آزمائش ہے۔ اور بیشک ایک شخص اہل جہنم کے عمل کرتا ہے، جیسا کہ لوگوں کو دکھائی دیتا ہے (یعنی خلاف ورزیاں)، اور جو کچھ اللہ کے لیے اس کے باطن سے ظاہر ہوتا ہے وہ اس کے برعکس ہوتا ہے، یعنی نورِ ایمان اور اللہ کے ساتھ سچائی کہ یہ حال جس پر وہ ہے، اللہ کے حکم کے خلاف ہے۔ پس وہ باطنی طور پر روتا ہے اور ظاہری طور پر مخالفت کرتا ہے، تو اللہ کے لیے اس سے وہ ظاہر ہوتا ہے جو لوگوں کے لیے ظاہر نہیں ہوتا۔\"\n\nپس نبی اکرم صلی اللہ علیہ وسلم نے اس خبر میں واضح کر دیا کہ لوگ اپنے نفوس میں کس حال پر ہیں۔ پھر تمہیں جان لینا چاہیے کہ ذات حق (الحق) کی طرف سے اس مرتبے کے عنوان میں ایک لطیف معنی کی طرف اشارہ ہے، جو اس کے اس چیز کے بارے میں سوال کرنے میں ہے جسے وہ جانتا ہے، جیسے اس کا فرشتوں سے یہ کہنا: \"تم نے میرے بندوں کو کس حال میں چھوڑا؟\"\n\nحالانکہ فرشتے جانتے ہیں کہ اللہ تعالیٰ ان سے زیادہ اپنے بندوں کو جانتا ہے۔\nأَ لا يَعْلَمُ من خَلَقَ\n(کیا وہ نہیں جانتا جس نے پیدا کیا؟)\nاور وہ سب کچھ جس میں وہ ہیں، اللہ تعالیٰ کی تخلیق ہے۔ اور وہ اپنے سوال میں اللطیف (لطیف) ہے، اور جس چیز کے بارے میں اس نے سوال کیا اس کا الخبیر (خبر رکھنے والا) ہے، کیونکہ وہ واقع ہو چکا ہے۔ پس ہر وہ علم جو اس کے پاس وقوع کے بعد ہوتا ہے، وہ اس کے بارے میں خبیر ہوتا ہے، اور وقوع سے پہلے اس کا تعلق اس سے علیم (جاننے والا) ہوتا ہے۔ پس فرشتوں کے ادب میں سے یہ تھا کہ وہ جانتے تھے کہ ذات حق (الحق) کا ان سے کیا مقصد ہے۔\n\nانہوں نے اللہ تعالیٰ کو جواب دیا اور کہا: \"ہم نے انہیں چھوڑا جب وہ نماز پڑھ رہے تھے اور ہم ان کے پاس آئے جب وہ نماز پڑھ رہے تھے،\" کیونکہ فرشتوں کا ان سے اوپر جانا اور ان پر نازل ہونا نماز عصر اور نماز فجر کے وقت ہوتا ہے، جیسا کہ حدیث میں آیا ہے۔\n\nپس میں ذات حق (الحق) کو جواب دیتے ہوئے کہتا ہوں: میں نے انہیں پہچانا جب میں نے آپ کے آداب کو پہچانا، پس میں نے انہیں آپ کی طرف منسوب کیا اور کہا: یہ اللہ کے اولیاء ہیں۔ اور ان کی علامت یہ ہے کہ جب وہ اللہ کا ذکر دیکھتے ہیں تو اللہ کے ساتھ اپنے تحقق (تحققهم بالله) کی وجہ سے (اسے قبول کرتے ہیں)۔ اور یہ صرف خالص اور پاکیزہ عبودیت (بندگی) ہے جس میں کسی بھی صورت میں ربوبیت کی آمیزش نہیں ہے۔ پس یہ آپ کے آداب ہیں۔ اور ہر وہ صفت جو ان میں دیکھی جائے جس میں ربوبیت کی بو ہو، تو وہ خلافت کا ادب ہے نہ کہ ولایت کا ادب۔\nپس ولی (الولي) مدد کرتا ہے اور خود مدد نہیں چاہتا، جبکہ خلیفہ (الخليفة) مدد کرتا بھی ہے اور مدد چاہتا بھی ہے۔ اور زمانہ کسی جھگڑالو سے خالی نہیں ہوتا، اور ولی (الولي) درگزر نہیں کرتا۔ اگر وہ درگزر کرے تو وہ ولی نہیں ہے۔ اور وہ ذات حق (الحق) کی جناب پر کسی چیز کو ترجیح نہیں دیتا، پس وہ سب کچھ اللہ کے لیے ہے۔ جبکہ خلیفہ ایک وقت میں اللہ کے لیے ہوتا ہے اور ایک وقت میں عالم کے لیے۔ پس ایک وقت میں وہ غیرت کی وجہ سے ذات حق (الحق) کی جناب کو ترجیح دیتا ہے، اور ایک وقت میں عالم کی جناب کو ترجیح دیتا ہے، پس وہ ان کے لیے استغفار کرتا ہے باوجود اس کے کہ ان سے وہ کام سرزد ہوئے جن پر ولی غیرت کھاتا ہے۔\nاور یہ وہ مفردون (المفردون) ہیں جن کے آداب کی ذمہ داری اللہ نے خود لی ہے۔ خلیفہ ایک وقت میں کہتا ہے کہ میں ستر سے زیادہ پر اضافہ کروں گا، اور ایک وقت میں رعل، ذکوان اور عُصیہ پر بددعا کرتا ہے۔ اور کہاں ایک حال اور کہاں دوسرا حال! پس خلیفہ پر احوال مختلف ہوتے ہیں، جبکہ ولی پر حال مختلف نہیں ہوتا۔ پس ولی پر اصلاً کوئی الزام نہیں لگایا جاتا، جبکہ خلیفہ پر احوال کے اختلاف کی وجہ سے الزام لگایا جا سکتا ہے۔ وہ کوئی دعویٰ نہیں کرتا مگر اس کی عاجزی اسے جھٹلا دیتی ہے، باوجود اس کے کہ اس سے ایک اور حال ظاہر ہوتا ہے جو اس کی سچائی پر دلالت کرتا ہے۔\nپس اولیاء (الأولياء) کے آداب ملکی (فرشتوں والی) ارواح کے آداب ہیں۔ کیا تم جبرائیل علیہ السلام کو نہیں دیکھتے کہ وہ سمندر کی مٹی لے کر فرعون کے منہ میں ڈالتے ہیں تاکہ وہ توحید کا کلمہ نہ کہہ سکے، اور وہ ذات حق (الحق) کی جناب پر غیرت کی وجہ سے اس سے مقابلہ کرتے ہیں، باوجود اس کے کہ وہ جانتے تھے کہ فرعون جان چکا ہے کہ اللہ کے سوا کوئی معبود نہیں، لیکن فرعون نے انہیں مغلوب کر دیا، کیونکہ اس نے اپنی زبان سے کلمہ توحید کہا، جیسا کہ اللہ تعالیٰ نے قرآن مجید میں اس کے بارے میں خبر دی ہے۔\nاور خلیفہ اپنے چچا سے کہتا ہے: \"میرے کان میں کہہ دو، میں اللہ کے ہاں تمہارے لیے گواہی دوں گا،\" اور وہ انکار کرتا ہے۔ اور اس حال کا دوسرے خلیفہ کے اس حال سے کیا مقابلہ ہے جب وہ کہتا ہے:\nرَبِّ لا تَذَرْ عَلَى الْأَرْضِ من الْكافِرِينَ دَيَّاراً\n(اے میرے رب! زمین پر کافروں میں سے کسی بسنے والے کو باقی نہ چھوڑ)۔\nحالانکہ شاید اگر انہیں لمبی مدت ملتی تو وہ لوٹ آتے، یا ان کی صلبوں میں کوئی ایسا ہوتا جو اللہ پر ایمان لاتا، جس سے مؤمنوں کی آنکھیں ٹھنڈی ہوتیں۔\nپس اولیاء (الأولياء) کے آداب مغضوب علیہم (جن پر غضب کیا گیا) کے معاملے میں ایسا غضب ہے جس سے رجوع نہیں ہوتا، اور مرضی عنہم (جن سے راضی ہوا گیا) کے معاملے میں ایسی رضا ہے جس سے رجوع نہیں ہوتا، کیونکہ یہ ذات حق (الحق) کا ادب ہے، اور ذات حق (الحق) وہ ہے جس کا واقع ہونا واجب ہے۔\nاور خلفاء (الخلفاء) کے آداب مرضی عنہم کے معاملے میں رضا ہے، اور ایک وقت میں عفو ہے، اور ایک وقت میں مغضوب علیہم کے معاملے میں غضب ہے۔ اور اسی لیے اولیاء کو دوسروں کے مقابلے میں خاص کیا گیا\n\nاس کے اس قول میں: \"کیا تم نے میرے اولیاء کو پہچانا؟\" حالانکہ سب اولیاء ہیں۔\n\nلیکن وہ (باقی سب) اسماء الٰہیہ (الأسماء الإلهية) کے اولیاء ہیں، اور یہ (جن کا ذکر ہو رہا ہے) اضافت کے اولیاء ہیں۔ پس وہ انیت (ہونے) کے اولیاء ہیں، نہ کہ اسماء کے اولیاء۔ اور میں تمہیں اسماء کنایات (کنایہ والے ناموں) اور اسماء ظاہرہ (ظاہر ناموں) کے درمیان فرق سے آگاہ کروں گا، ان شاء اللہ، اس کتاب کے آخر میں اسماء کے باب میں۔\nوالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ\n(اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و چهل و پنجم در معرفت منزلت «آیا اولیای مرا که به آداب خود مؤدبشان ساختم، شناختی؟»\n\n> پیامبران خدا را جز او مؤدب نساخت، پس به ادب چنگ زدند.\n> آنان سرورانی هستند که تنها گذاشته نمی‌شوند؛ این‌گونه در کتب مشخص شده‌اند.\n> پس کسی که بر آثار آنان گام بردارد، بدین سبب در زمره نجیبان شمرده می‌شود.\n> و اگر چنین و چنان باشد، پیوسته به همین دلیل پشت حجاب‌ها باقی می‌ماند.\n> سعادتمندترین مردم کسی است که از آنان پیروی کند، پس او را مانند ایشان در رنج و کوشش می‌بینی.\n> محراب را چنان لازم گرفتند که پاهایشان در راه قرب متورم شد.\n\n### [محب خوار است و محبوب نازکننده]\n\nخداوند متعال می‌فرماید: «قُلْ إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله» (بگو: اگر خدا را دوست می‌دارید، از من پیروی کنید تا خدا شما را دوست بدارد). و هر کس خدا را دوست بدارد، خوار (ذلیل) می‌شود؛ و هر کس خدا او را دوست بدارد، ناز می‌کند (دل). پس محب خوار است و محبوب نازکننده و صاحب ناز (دلال). و پیامبر (صلی الله علیه و سلم) فرمود: «همانا خداوند مرا تأدیب کرد و ادب مرا نیکو گردانید.»\n\n### [شرایع، آداب الهی برای بندگانش هستند]\n\nو بدان که برای شناساندن منازل خلق نزد خداوند، اعم از ولی و غیر ولی، دو راه وجود دارد. راه اول، کشف (الکشف) است؛ که در آن منازل خلق را نزد خداوند می‌بیند و با هر طایفه‌ای بر اساس منزلتشان نزد خداوند رفتار می‌کند. و راه دیگر، ملازمت ادب الهی است. و ادب الهی همان چیزی است که خداوند برای بندگانش در میان رسولان و بر زبان آنان تشریع کرده است. پس شرایع، آداب الهی هستند که برای بندگانش مقرر نموده است. پس هر کس به حق شریعت او وفا کند، به ادب حق (الحق) مؤدب شده و اولیای حق (الحق) را شناخته است. اگر کسی را دیدی که خیر را با دو دست خود جمع کرده و آن دو را از آن پر ساخته است، بدان که او ادب الهی را فرا گرفته است.\n\nزیرا رسول خدا (صلی الله علیه و سلم) در حالی که صادق و عالم به پروردگارش بود، به پروردگارش می‌گوید: «و خیر تماماً در دستان توست.»\n\nپس اگر می‌خواهی خیر را بشناسی، بدان که آن مجموعه مکارم اخلاق است و این مکارم هم از نظر عرف و هم از نظر شرع شناخته شده‌اند. و هر آنچه از اجرای حدود بر کسی که اگر حق (الحق) تو را به آن امر نکرده بود، از او درمی‌گذشتی، می‌بینی؛ این عمل در مکارم اخلاق نسبت به آن شخص خدشه‌ای وارد نمی‌کند. زیرا تو آنچه را که انجام دادی برای خودت انجام ندادی، بلکه خداوند آنچه را که خواست، به دست تو بر بنده خود انجام داد، و هر دوی شما بنده یک سرور هستید. و سخن ما در مورد چیزی است که به خود تو بازمی‌گردد، نه به امر سرورت؛ زیرا از مکارم اخلاق بندگان این است که اوامر سرور خود را در مورد بندگانش اطاعت کنند و در حدود و رسوم او در مورد آنان توقف نمایند. «لا تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ أَوْ أَبْناءَهُمْ أَوْ إِخْوانَهُمْ أَوْ عَشِيرَتَهُمْ» (قومی را که به خدا و روز بازپسین ایمان دارند، نمی‌یابی که با کسانی که با خدا و رسولش دشمنی کرده‌اند، دوستی کنند، هر چند پدران یا پسران یا برادران یا خویشاوندانشان باشند).\n\nاینکه آنان با خدا و رسولش دشمنی کردند، همان چیزی است که به خودشان بازگشت؛ پس آنان بر خودشان جنایت کردند، نه اینکه صاحب مکارم اخلاق بر آنان جنایتی کرده باشد. پس هر کس خود را در معرض امری قرار دهد، دوست داشته است که در آن امر با او برخورد شود. بنابراین، تو در عدم دوستی با او، کاری جز آنچه او دوست داشته، انجام نداده‌ای. و مکارم اخلاق جز این نیست که با شخص کاری کنی که او از تو دوست دارد. زیرا او ابتدا به دلیل ایمان تو به خدا و روز بازپسین، تو را دشمن داشته و تو را دشمن خود گرفته است. پس از مکارم اخلاق تو با او این است که در ایمان آوردنش با او مدارا کنی. اگر سودی نبخشید، با قهر با او مقابله کن. و اگر (ایمان) نیاورد و لجاجت کرد و تو توانستی او را بکشی، او را با مکارم اخلاق خود بکش تا در زندگی دنیا باقی نماند و بر کفر و طغیان خود نیفزاید و خداوند نیز عذاب او را زیاد نکند. همان‌گونه که کسی که خداوند برای او شهادت به رحیم بودن داده است، یعنی خضر، انجام داد؛ او سر آن نوجوان را از تن جدا کرد و گفت: «او کافر آفریده شده بود و اگر زنده می‌ماند، پدر و مادرش را به طغیان و کفر می‌کشاند.» و آن نوجوان در زمره کافران قرار گرفت. پس خضر او را از روی رحمت به او و پدر و مادرش کشت. اما آن کودک، چون او را بر فطرت از دنیا خارج ساخت، آن نوجوان سعادتمند شد، و خداوند داناتر است، و پدر و مادرش نیز سعادتمند شدند. و این از بزرگ‌ترین مکارم اخلاق است.\n\nبرخی از صالحان از خداوند جهاد می‌خواستند، اما خداوند اسباب آن را برایشان آسان نمی‌ساخت و میان او و جهاد در راه خدا حائل می‌شد. او از اولیای اکابر نزد خداوند بود و با حق (الحق) سخنانی داشت. او در مورد تأخیر و دشواری اسباب جهاد برای خود، با وجود محبتی که به جهاد در دل داشت به خاطر رضای خدا و مقام شهدا نزد او، متحیر ماند. هنگامی که خداوند دانست که سینه‌اش از این بابت تنگ شده است، از راهی که علم را از خدا می‌گرفت، به او خبر داد و فرمود: «به خاطر دشواری اسباب جهاد بر تو، دلتنگ مباش. زیرا من بر تو حکم کردم که اگر به جنگ می‌رفتی، اسیر می‌شدی و اگر اسیر می‌شدی، نصرانی می‌شدی و نصرانی می‌مردی. اما اگر به جنگ نروی، در خانه‌ات سالم می‌مانی و به عنوان بنده‌ای صالح بر دین اسلام می‌میری.» پس او خدا را بر این امر شکر کرد و دانست که خداوند متعال آنچه را که برای او سعادتمندتر است، برگزیده است. پس خاطرش آرام گرفت و دانست که خداوند آنچه را که خیر او در آن است، برایش انتخاب کرده است. این نیز از آداب الهی است که بنده باید با خداوند بدان مؤدب شود.\n\nپس اگر کسی را دیدی که تسلیم شد و گردن نهاد و آداب حق (الحق) در او برقرار شد و او نیز آن آداب را در خود و در مورد بندگان خدا به پا داشت، و با صفت مؤدب شد نه با اشخاص، و صاحب صفت گمان می‌کند که او با وی مؤدب شده است، در حالی که از حال این مؤدب خبر ندارد؛ زیرا او به جهان با چشم حق (الحق) می‌نگرد، و چشم حق نیز به آنان می‌نگرد بر اساس آنچه علم الهی در مورد احوال آنان به آن چشم داده است. زیرا بر ذات‌هایی که احوال در آن‌ها قائم می‌شوند، از حیث ذاتشان حکم سعادت یا شقاء (شقاء) نمی‌شود، بلکه این حکم به واسطه صفاتی است که در آن ذات‌ها قائم می‌شوند. پس صفات به خودی خود متصف به شقاء و سعادت نمی‌شوند، و ذات‌های حامل صفات نیز به خودی خود و عیناً متصف به سعادت یا شقاء نمی‌شوند. هنگامی که صفات در ذات‌ها قائم شوند و احکامشان در آن‌ها ظاهر گردد، ذات‌ها بر اساس امتزاجی که حاصل شده است، متصف می‌شوند؛ امتزاجی که به تنهایی برای هیچ یک از آن دو (ذات یا صفت) وجود نداشت. در این هنگام است که در مورد شخص گفته می‌شود: سعید (سعادتمند) یا شقی (شقاوتمند). پس بنگر که داستان سعادت و شقاء چقدر شگفت‌انگیز است، زیرا هیچ یک از آن دو جز بر اساس امتزاج ظاهر نمی‌شود. همان‌گونه که سیاهی مرکب جز با امتزاج مازو و زاج ظاهر نمی‌شود، و همان‌گونه که سفیدی پارچه جز میان پارچه و سفیدگری ظاهر نمی‌شود. پس تمام ترس از ترکیب است، و همه آفات تنها به دلیل مرکب بودن شخص بر او عارض می‌شوند. خروج از ترکیب قابل تعقل است، اما در عالم مرکب اصلاً واقع نمی‌شود. و به همین دلیل ابویزید گفت که او صفتی ندارد؛ زیرا او در معقولیت بساطت خود اقامه شد و ترکیبی ندید، پس گفت: «من صفتی ندارم.» و راست گفت، اما این در وجود حسی عینی واقع نیست. پس در آنجا جز مرکبی نیست که سعادت یا شقاء را بر اساس آنچه آمیختگی‌اش اقتضا می‌کند، می‌پذیرد. پروردگار تو فارغ شده است، و فراغت او از روی مانعی که او را مشغول کرده باشد، نبوده است، بلکه با این کار تنزیه را اراده کرده است؛ یعنی امور جز بر آنچه در نفس خود هستند، واقع نمی‌شوند. و هر کس را که خداوند از لغزشی که این مشهد (شهود) اقتضا می‌کند، حفظ کند، خداوند به او بزرگ‌ترین عنایت را کرده است. و از همین‌جاست که قدم‌ها لغزیده‌اند، چنانکه نظیر آن در شریعت آمده است.\n\nهنگامی که پیامبر (صلی الله علیه و سلم) از سبقت کتاب (تقدیر) بر بنده به سعادت یا شقاء سخن گفت، صحابه عرض کردند: ای رسول خدا، پس عمل برای چیست؟ رسول خدا (صلی الله علیه و سلم) به آنان فرمود: «عمل کنید، زیرا هر کس برای آنچه برایش آسان شده، آسان گردانیده شده است.»\n\nو حق (الحق) با فرستادن رسولان، اسباب و راه‌های خیر و اسباب و راه‌های شقاء و شر را برای آنان بیان کرده است و سلوک در راه‌های خیر را بشارت قرار داده است. پس آن را در نفس خود بنگر. اگر دیدی که وقتی در خیر هستی، باطن و ظاهرت در آن یکسان است و شک نداری، این همان بشارت است. پس به آن در سعادت شاد باش، زیرا خداوند تو را تغییر نمی‌دهد. و اگر خیر را در ظاهر خود دیدی، اما در باطنت نقطه‌ای از شک یا اضطراب در عبادتی که در آن هستی، یا خاطری که در اصل آن با آنچه ظاهر فعل است، منافات دارد، برایت پیش آمد،\n\n### [همانا خداوند به تو ایمان نداده و قلبت را با نور خود روشن نساخته است]\n\nپس بدان که خداوند به تو ایمان نداده و قلبت را با نور خود روشن نساخته است. پس بر خود گریه کن یا بخند، که در آخرت بهره‌ای نداری. این ترازوی تو در نفس توست و تو به خود و آنچه در آن خطور می‌کند، داناتری. و به همین دلیل، رسول خدا (صلی الله علیه و سلم) در صحیح فرمود: «همانا مردی به عمل اهل بهشت عمل می‌کند، در آنچه برای مردم آشکار می‌شود، اما برای خداوند از او این خاطر آشکار می‌شود که در ایمان او خدشه وارد می‌کند، از شکی که در او قائم است که امری که در آن از شریعت است، بر آنچه ظاهرش نشان می‌دهد، نیست.» این همان بلای آشکار است. و همانا مردی به عمل اهل آتش عمل می‌کند، در آنچه برای مردم آشکار می‌شود (یعنی از مخالفت‌ها)، اما آنچه برای خداوند از باطن او آشکار می‌شود، خلاف این است؛ از نور ایمان و صدق با خدا در اینکه این حالی که بر آن است، مخالف امر خداست. پس در باطن می‌گرید و در ظاهر مخالفت می‌کند، و از او برای خداوند چیزی آشکار می‌شود که برای مردم آشکار نمی‌شود.\n\nپیامبر (صلی الله علیه و سلم) در این خبر آنچه را که مردم در نفس خود بر آن هستند، بیان فرمود. سپس بدان که در عنوان این منزلت از حق (الحق)، اشاره‌ای لطیف‌المعنا در استفهام خداوند عز و جل از چیزی که خود به آن عالم است، وجود دارد؛ مانند سخن او به فرشتگانش: «چگونه بندگان مرا ترک کردید؟» در حالی که فرشتگان می‌دانند که خداوند متعال به بندگانش از آنان داناتر است. «أَ لا يَعْلَمُ من خَلَقَ» (آیا کسی که آفریده است، نمی‌داند؟) و تمام آنچه در آن هستند، آفریده اوست. و او با سؤالش لطیف (اللطیف) است و به آنچه سؤال کرده، خبیر (الخبیر) است، زیرا آن امر واقع شده است. پس هر علمی که نزد او از وقوع باشد، او به آن خبیر است، و تعلق آن به او قبل از وقوع، او به آن علیم است. پس از ادب فرشتگان، به دلیل علمشان به آنچه حق (الحق) از آنان قصد کرده بود، به خداوند پاسخ دادند و گفتند: «آنان را در حالی ترک کردیم که نماز می‌خواندند و نزد آنان آمدیم در حالی که نماز می‌خواندند.» زیرا عروج فرشتگان از نزد آنان و نزولشان بر آنان هنگام نماز عصر و نماز صبح بود، چنانکه در خبر آمده است.\n\nپس من در پاسخ به حق (الحق) می‌گویم: آنان را شناختم، زیرا آداب تو را شناختم. پس آنان را به تو نسبت دادم و گفتم: اینان اولیای خدا هستند. و نشانه آنان این است که وقتی دیده می‌شوند، ذکر خدا می‌شوند، به دلیل تحققشان به خداوند. و این نیست مگر عبودیت محض و خالصی که از هیچ وجهی با ربوبیت آمیخته نشده است. پس این‌ها آداب تو هستند. و هر صفتی که در آنان دیده شود و بوی ربوبیت داشته باشد، آن ادب خلافت است، نه ادب ولایت (الولایة). پس ولی (الولی) یاری می‌کند و یاری نمی‌شود، اما خلیفه (الخلیفة) یاری می‌کند و یاری می‌شود. و زمان از منازعه‌کننده خالی نیست. و ولی (الولی) گذشت نمی‌کند؛ اگر گذشت کند، ولی نیست. و هیچ چیز را بر ساحت حق (الحق) ترجیح نمی‌دهد، پس او تماماً برای خداست. و خلیفه (الخلیفة) در یک زمان برای خداست و در زمانی دیگر برای عالم. پس گاهی از روی غیرت، ساحت حق (الحق) را ترجیح می‌دهد و گاهی ساحت عالم را ترجیح می‌دهد و برای آنان استغفار می‌کند، با وجود آنچه از ایشان سر زده که ولی (الولی) به خاطر آن غیرت می‌ورزد. و اینان همان مفردون (منفردان) هستند که خداوند خود شخصاً آدابشان را بر عهده گرفته است. خلیفه در یک زمان می‌گوید: «بیش از هفتاد بار استغفار خواهم کرد» و در زمانی دیگر بر رعل و ذکوان و عُصَیّه نفرین می‌کند. و کجا این حال با آن حال برابر است؟ پس احوال بر خلیفه مختلف می‌شود، اما حال بر ولی مختلف نمی‌شود. ولی اصلاً متهم نمی‌شود، اما خلیفه ممکن است به دلیل اختلاف حال بر او متهم شود. او هیچ ادعایی نمی‌کند مگر اینکه عجز او آن را تکذیب می‌کند، با وجود صدقش، حال دیگری از او آشکار می‌شود.\n\nپس آداب اولیاء، آداب ارواح ملکی است. آیا نمی‌بینی که جبرئیل (علیه السلام) حال دریا را می‌گیرد و آن را در دهان فرعون می‌اندازد تا نتواند کلمه توحید را بر زبان آورد، و از روی غیرت بر ساحت حق (الحق) با او مسابقه می‌دهد، با وجود علمش به اینکه فرعون دانسته است که «لا اله الا الله» است؟ و فرعون بر او غلبه کرد، زیرا کلمه توحید را بر زبان آورد، چنانکه خداوند متعال در کتاب عزیز از او خبر داده است. و خلیفه به عمویش می‌گوید: «آن را در گوش من بگو تا نزد خدا برایت شهادت دهم»، در حالی که او امتناع می‌ورزد. و کجا این حال با حال سخن خلیفه دیگر برابر است که گفت: «رَبِّ لا تَذَرْ عَلَى الْأَرْضِ من الْكافِرِينَ دَيَّاراً» (پروردگارا، هیچ یک از کافران را بر روی زمین باقی مگذار). در حالی که شاید اگر عمرشان طولانی می‌شد، بازمی‌گشتند، یا در صلب‌هایشان کسانی بودند که به خدا ایمان می‌آوردند و چشمان مؤمنان به آنان روشن می‌شد. پس آداب اولیاء، غضب در مورد «مغضوب علیهم» است که بازگشتی در آن نیست، و رضایت در مورد «مرضی عنهم» است که بازگشتی در آن نیست؛ زیرا آن ادب حق (الحق) و حق واقع و واجب‌الوقوع است. و آداب خلفاء، رضایت در مورد «مرضی عنهم» و گاهی عفو و گاهی غضب در مورد «مغضوب علیهم» است. و به همین دلیل، اولیاء را به تنهایی در سخن خود «آیا اولیای مرا شناختی؟» اختصاص داد، در حالی که همه اولیاء هستند. اما (دیگران) اولیای اسماء الهی هستند، و اینان (مفردون) اولیای اضافه هستند. پس آنان اولیای «اِنّیة» (من بودن) هستند، نه اولیای اسماء. و ان‌شاءالله در باب اسماء در آخر این کتاب، تو را به فرق میان اسماء کنایات و اسماء ظاهره آگاه خواهم ساخت. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 3
}