{
  "id": 48,
  "title": {
    "ar": "الباب الثامن والأربعون في معرفة إنما كان كذا لكذا وهو إثبات العلة والسبب",
    "en": "Chapter Forty-Eight: Concerning the understanding that one thing exists for the sake of another, which constitutes the affirmation of the Cause (العلة) and the Reason (السبب)",
    "ur": "باب اڑتالیسواں: اس معرفت کے بارے میں کہ کوئی چیز صرف کسی دوسری چیز کے لیے تھی، اور یہ علت (العلة) اور سبب (السبب) کا اثبات ہے۔",
    "fa": "باب چهل و هشتم در معرفت اینکه چرا چیزی برای چیز دیگری چنین بوده است، و آن اثبات علت و سبب است."
  },
  "content": {
    "ar": "## (الباب الثامن والأربعون في معرفة إنما كان كذا لكذا وهو إثبات العلة والسبب)\n\n\n> إنما كان هكذا لكذا *** علم من حاز رتبة الحكم‏\n\n\n> لا تعلل وجود خالقنا *** فيكن سيركم إلى العدم‏\n\n\n> وهو الأول الذي ما له *** أول في الحدوث والقدم‏\n\n\n### [السبب الموجب لوجود العالم‏]\n\n\nأول مسألة من هذا الباب ما السبب الموجب لوجود العالم حتى يقال فيه إنما وجد العالم لكذا وذلك الأمر المتوقف عليه صحة وجوده إما أن تكون علة فتطلب معلولها لذاتها وإذا كان هذا فهل يصح أن يكون للمعلول علتان فما زاد أو لا يصح وذلك في النظر العقلي لا في الوضعيات وإذا تعددت العلل فهل تعددها يرجع إلى أعيان وجودية أو هل هي نسب لأمر واحد وثم أمور يتوقف صحة وجودها على شرط يتقدمها أو شروط ويجمع ذلك كله اسم السبب وللشرط حكم وللعلة حكم فهل العالم في افتقاره إلى السبب الموجب لوجوده افتقار المعلول إلى العلة أو افتقار المشروط إلى الشرط وأيهما كان لم يكن الآخر فإن العلة تطلب المعلول لذاتها والشرط لا يطلب المشروط لذاته فالعلم مشروط بالحياة ولا يلزم من وجود الحياة وجود العلم وليس كون العالم عالما كذلك فإن العلم علة في كون العالم عالما فلو ارتفع العلم ارتفع كونه عالما فهو من هذا الوجه يشبه الشرط إذ لو ارتفعت الحياة ارتفع العلم ولو ارتفع كونه عالما ارتفع العلم فتميز عن الشرط إذ لو ارتفع العلم لم يلزم ارتفاع الحياة فهاتان مرتبتان معقولتان قد تميزتا تسمى الواحدة علة وتسمى الأخرى شرطا\n\n\n### [نسبة العالم في وجوده إلى الحق‏]\n\n\nفهل نسبة العالم في وجوده إلى الحق نسبة المعلول أو نسبة المشروط محال أن تكون نسبة المشروط على المذهبين فإنا لا نقول في المشروط يكون ولا بد وإنما نقول إذا كان فلا بد من وجود شرطه المصحح لوجوده ونقول في العالم على مذهب المتكلم الأشعري إنه لا بد من كونه لأن العلم سبق بكونه ومحال وقوع خلاف المعلوم وهذا لا يقال في المشروط وعلى مذهب المخالف وهم الحكماء فلا بد من كونه لأن الله اقتضى وجود العالم لذاته فلا بد من كونه ما دام موصوفا بذاته بخلاف الشرط فلا فرق إذن بين المتكلم الأشعري والحكيم في وجوب وجود العالم بالغير فلنسم تعلق العلم بكون العالم أزلا علة كما يسمى الحكيم الذات علة ولا فرق ولا يلزم مساوقة المعلول علته في جميع المراتب فالعلة متقدمة على معلولها بالمرتبة بلا شك سواء كان ذلك سبق العلم أو ذات الحق ولا يعقل بين الواجب الوجود لنفسه وبين الممكن بون زماني ولا تقدير زماني لأن كلامنا في أول موجود ممكن والزمان من جملة الممكنات فإن كان أمرا وجوديا فالحكم فيه كسائر\nالحكم في الممكنات وإن لم يكن أمرا وجوديا وكان نسبة فحدثت النسبة بحدوث الموجود المعلول حدوثا عقليا لا حدوثا وجوديا وإذا لم يعقل بين الحق والخلق بون زماني فلم يبق إلا الرتبة فلا يصح أن يكون أبدا الخلق في رتبة الحق كما لا يصح أن يكون المعلول في رتبة العلة من حيث ما هو معلول عنها فالذي هرب منه المتكلم في زعمه وشنع به على الحكيم القائل بالعلة يلزمه في سبق العلم بكون المعلوم لأن سبق العلم يطلب كون المعلوم لذاته ولا بد ولا يعقل بينهما بون مقدر فهذا قد نبهناك على بعض ما ينبغي في هذه المسألة\n\n\n### [العالم أبدا، ممكن: والحق، أبدا، واجب‏]\n\n\nفالعالم لم يبرح في رتبة إمكانه سواء كان معدوما أو موجودا والحق تعالى لم يبرح في مرتبة وجوب وجوده لنفسه سواء كان العالم أو لم يكن فلو دخل العالم في الوجوب النفسي لزم قدم العالم ومساوقته في هذه الرتبة لواجب الوجود لنفسه وهو الله ولم يدخل بل بقي على إمكانه وافتقاره إلى موجدة وسببه وهو الله تعالى فلم يبق معقول البينية بين الحق والخلق إلا التمييز بالصفة النفسية فبهذا نفرق بين الحق والخلق فافهم‏\n\n\n### [نفي تعدد العلة التامة للمعلولات العقلية]\n\n\nوأما قولنا هل يكون في العقل للأمر المعلول علتان فلا يصح أن يكون للمعلول العقلي علتان بل إن كان معلولا فعن علة واحدة لأنه لا فائدة للعلة إلا أن يكون لها أثر في المعلول وأما إن اتفق أن يكون من شرط المعلول أن يكون على صفة بها يقبل أن يكون معلولا لهذه العلة ولا يمكن أن يكون هذا علة لذلك المعلول نفسه إلا أن يكون ذلك المعلول بتلك الصفة النفسية فلا بد منها ولا يلزم من هذا أن تكون تلك الصفة النفسية علة له فإنها صفة نفسية والشي‏ء لا يكون علة لنفسه فإنه يؤدي إلى أن تكون العلة عين المعلول فيكون الشي‏ء متقدما على نفسه بالرتبة وهذا محال فكون الشي‏ء علة لنفسه محال فإن العالم لو لم يكن في نفسه على صفة يقبل الاتصاف بالوجود والعدم على السواء لم يصح أن يكون معلولا لعلته المرجحة له أحد الجائزين بالنظر إلى نفسه فإن المحال لا يقبل صفة الإيجاد فلا يكون الحق علة له فبطل أن يكون كونه ممكنا علة له وبطل أن يكون للشي‏ء علتان فإن الأثر للعلة في المعلول إنما كان وجوده فما حكم العلة الأخرى فيه إن كان وجوده فقد حصل من إحداهما فلم يبق للآخر أثر فإن قيل باجتماعهما كان المعلول عن ذلك الاجتماع فكان عنهما قلنا فكل واحد منهما إذا انفرد لا يكون علة ولا يصح عليه اسم العلية وقد صح فبطل أن يكون كونه علة متوقفا على أمر آخر فإن قال وما المانع أن تكون العلة بالاجتماع قلنا إنما يكون الشي‏ء علة لنفسه لهذا المعلول عنه لا لغيره فيكون معلولا لذلك الغير لأن ذلك الغير كسبه العلية وكل مكتسب لا يكون صفة نفسية ولو قلنا باجتماعهما كان علة فلا يخلو ذلك الاجتماع أن يكون أمرا زائدا على نفس كل واحد منهما أو هو عينهما لا جائز أن يكون عينهما فإنا نعقل عين كل واحد منهما ولا اجتماع فلا بد أن يكون زائدا فذلك الزائد لا بد أن يكون وجودا أو عدما أو لا وجودا ولا عدما أو وجودا وعدما معا فهذا القسم الرابع محال بالبديهة ومحال أن يكون وجودا للتسلسل اللازم له بما يلزمه من ملزومه أو الدور فيكون علة لمن هو معلول له وهذا محال ومحال أن يكون عدما لأن العدم نفي محض ولا يتصف النفي المحض بالأثر ومحال أن يكون لا وجود ولا عدم كالنسب إذ لا حقيقة للنسب في الوجود فإنها أمور إضافية تحدث ولا يكون ما يحدث علة لما هو عنه حادث فبطل إن يكون للشي‏ء علتان في العقل‏\n\n\n### [جواز تعدد العلة في المعلولات الوضعية]\n\n\nوأما في الوضعيات فقد يعتبر الشرع أمورا تكون بالمجموع سببا في ترتيب الحكم هذا لا يمنع فإذ قد علمت هذا فهو أدل دليل على توحيد الله تعالى كونه علة في وجود العالم غير أن إطلاق هذا اللفظ عليه لم يرد به الشرع فلا نطلقه عليه ولا ندعوه به فهذا توحيد ذاتي ينتفي معه الشريك بلا شك قال الله عز وجل لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا ومعنى هذا لم يوجدا يعني العالم العلوي وهو السماء والسفلي وهو الأرض فحقق هذه المسألة في ذهنك فإنها نافعة في نفي الشريك ونفي التحديد عن الله تعالى فلا حد لذاته ولا شريك له في ملكه لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ‏\n\n\n### [العالم معلول علم الله لا معلول عين الله‏]\n\n\n> إنما عللوا الذي *** عللوه لكونه‏\n\n\n> هو معلول علمه *** ليس معلول عينه‏\n\n\n> فانظروا ما نصصته *** فهو من سر بينه‏\n\n\n> فصل الأمر نفسه *** عن سواه ببينة\n\n\n> في سر محقق *** إنني سر عونه‏\n> فلبست الرداء من *** طلبي عين صوته‏\n\n\n(مسألة أخرى)\n\n\n### [الرابطة الوجودية بين الحق والخلق‏]\n\n\nإنما كان كذا لكذا إنما انقسم العالم إلى شقي وسعيد للأسماء الإلهية فإن الرتبة الإلهية تطلب لذاتها إن يكون في العالم بلاء وعافية ولا يلزم من ذلك دوام شي‏ء من ذلك إلا أن يشاء الله فقد كان ولا عالم وهو مسمى بهذه الأسماء فالأمر في هذا مثل الشرط والمشروط ما هو مثل العلة والمعلول فلا يصح المشروط ما لم يصح وجود الشرط وقد يكون الشرط وإن لم يقع المشروط فلما رأينا البلاء والعافية قلنا لا بد لهما من شرط وهو كون الحق إلها يسمى بالمبلي والمعذب والمنعم وكما إن كل ممكن قابل لأحد الحكمين أعني الضدين هو قابل أيضا لانتفاء أحد الضدين فالعالم كله ممكن فجائز أن ينتفي عنه أحد الحكمين فلا يلزم الخلود في الدار الآخرة في العذاب ولا في النعيم بل ذلك كله ممكن‏\n\n\n### [الخلود، في الدار الآخرة، في العذاب وفي النعيم‏]\n\n\nفإن ورد الخبر الإلهي الذي يفيد العلم بالنص الذي لا يحتمل التأويل بخلود العالم في أحد الحكمين أو بوقوع كل حكم في جزء من العالم معين وخلود ذلك الجزء فيه إلى ما لا يتناهى قبلناه وقلنا به وما ورد من الشارع أن العالم الذي هو في جهنم الذين هم أهلها ولا يخرجون منها أن بقاءهم فيها لوجود العذاب فكما ارتفع حكم العذاب عن ممكن ما وهم أهل الجنة كذلك يجوز أن يرتفع عن أهل النار وجود العذاب مع كونهم في النار لقوله وما هُمْ بِخارِجِينَ من النَّارِ وقال سبقت رحمتي غضبي‏\n\n\nولا يلزم من وجود الشرط وجود المشروط فيكون الله إلها بجميع أسمائه ولا عذاب في العالم ولا ألم لأنه ليس ارتفاعه عن ممكن ما بأولى من ارتفاعه عن جميع الممكنات فلم يبق بأيدينا من طريق العقل دليل على وجود العذاب دائما ولا غيره فليس إلا النصوص المتواترة أو الكشف الذي لا يدخله شبهة فليس للعقل رده إذا ورد من الصادق النص الصريح أو الكشف الواضح‏\n\n\n### (مسألة أخرى من هذا الباب) [خلق آدم على الصورة وباليدين‏]\n\n\nإنما صحت الصورة لآدم لخلقه باليدين فاجتمع فيه حقائق العالم بأسره والعالم يطلب الأسماء الإلهية فقد اجتمع فيه الأسماء الإلهية ولهذا خص آدم عليه السلام بعلم الأسماء كلها التي لها توجه إلى العالم ولم يكن ذلك العلم أعطاه الله للملائكة وهم العالم الأعلى الأشرف قال الله عز وجل وعَلَّمَ آدَمَ الْأَسْماءَ كُلَّها ولم يقل بعضها وقال عَرَضَهُمْ ولم يقل عرضها فدل على أنه عرض المسمين لا الأسماء وقال رسول الله صلى الله عليه وسلم اللهم إني أسألك بكل اسم سميت به نفسك أو علمته أحدا من خلقك أو استأثرت به في علم غيبك‏\n\n\nفإن كان هذا الدعاء دعا به قبل نزول سورة البقرة عليه فلا معارضة بين الخبر والآية عند من يقول بأن الأسماء هنا هي الأسماء الإلهية فإنه صلى الله عليه وسلم لم يكن له علم بما خص الله به آدم على الملائكة كما قال صلى الله عليه وسلم ما أَدْرِي ما يُفْعَلُ بِي ولا بِكُمْ إِنْ أَتَّبِعُ إِلَّا ما يُوحى‏ به إِلَيَّ وإن كان دعا به بعد نزول سورة البقرة فيكون يريد قوله كلها الأسماء الإلهية التي تطلب الآثار في العالم وما تعبد به من أسماء التنزيه والتقديس وكذلك‏\n\n\nقوله صلى الله عليه وسلم في حديث الشفاعة فأحمد ربي بمحامد يعلمنيها الله لا أعلمها الآن‏\n\n\nقوله في حديث الضربة فعلمت علم الأولين والآخرين‏\n\n\nومن علم الأولين علم الأسماء التي علمها الله آدم وربما يكون من علم الآخرين علم هذه المحامد التي يحمد بها ربه يوم القيامة\n\n\n(مسألة أخرى من هذا الباب)\n\n\n### [الخلافة الإلهية]\n\n\nإنما كانت الخلافة لآدم عليه السلام دون غيره من أجناس العالم لكون الله تعالى خلقه على صورته فالخليفة لا بد أن يظهر فيما استخلف عليه بصورة مستخلفه وإلا فليس بخليفة له فيهم فأعطاه الأمر والنهي وسماه بالخليفة وجعل البيعة له بالسمع والطاعة في المنشط والمكره والعسر واليسر وأمر الله سبحانه عباده بالطاعة لله ولرسوله والطاعة لأولي الأمر منهم فجمع رسول الله صلى الله عليه وسلم بين الرسالة والخلافة كداود عليه السلام فإن الله نص على خلافته عن الله بقوله تعالى فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ وأجمل خلافة آدم عليه السلام‏\n\n\n### [الفرقان بين الرسول والخليفة]\n\n\nوما كل رسول خليفة فمن أمر ونهى وعاقب وعفا وأمر الله بطاعته وجمعت له هذه الصفات كان خليفة ومن بلغ أمر الله ونهيه ولم يكن له من نفسه إذن من الله تعالى أن يأمر وينهى فهو رسول يبلغ رسالات ربه وبهذا بان لك الفرقان بين الرسول والخليفة\n\n\n### [طاعة الله وطاعة الرسول وأولى الأمر]\n\n\nولهذا جاء بالألف واللام في‏\nقوله تعالى من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله وقال عز وجل يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا الله أي فيما أمركم به على لسان رسوله صلى الله عليه وسلم مما قال فيه صلى الله عليه وسلم إِنَّ الله يَأْمُرُكُمْ وهو كل أمر جاء في كتاب الله تعالى ثم قال وأَطِيعُوا الرَّسُولَ ففصل أمر طاعة الله من طاعة رسوله صلى الله عليه وسلم فلو كان يعني بذلك ما بلغ إلينا من أمر الله تعالى لم تكن ثم فائدة زائدة فلا بد أن يوليه رتبة الأمر والنهي فيأمر وينهى فنحن مأمورون بطاعة رسول الله صلى الله عليه وسلم عن الله بأمره وقال تعالى من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله وطاعتنا له فيما أمر به صلى الله عليه وسلم ونهى عنه مما لم يقل هو من عند الله فيكون قرآنا قال الله عز وجل وما آتاكُمُ الرَّسُولُ فَخُذُوهُ وما نَهاكُمْ عَنْهُ فَانْتَهُوا فأضاف النهي إليه صلى الله عليه وسلم فأتى بالألف واللام في الرسول يريد بهما التعريف والعهد أي الرسول الذي استخلفناه عنا فجعلنا له أن يأمر وينهى زائدا على تبليغ أمرنا ونهينا إلى عبادنا ثم قال تعالى في الآية عينها وأُولِي الْأَمْرِ مِنْكُمْ أي إذا ولي عليكم خليفة عن رسولي أو وليتموه من عندكم كما شرع لكم فاسمعوا له وأطيعوا ولو كان عبدا حبشيا مجدع الأطراف فإن في طاعتكم إياه طاعة رسول الله صلى الله عليه وسلم ولهذا لم يستأنف في أولي الأمر أطيعوا واكتفى بقوله أَطِيعُوا الرَّسُولَ ولم يكتف بقوله أَطِيعُوا الله عن قوله أَطِيعُوا الرَّسُولَ ففصل لكونه تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ واستأنف القول بقوله وأَطِيعُوا الرَّسُولَ‏\n\n\n### [ليس لأولى الأمر تشريع الشرائع: إنما ذلك لرسل الله‏]\n\n\nفهذا دليل على أنه تعالى قد شرع له صلى الله عليه وسلم أن يأمر وينهى وليس لأولي الأمر أن يشرعوا شريعة إنما لهم الأمر والنهي فيما هو مباح لهم ولنا فإذا أمرونا بمباح أو نهونا عن مباح وأطعناهم في ذلك أجرنا في ذلك أجر من أطاع الله فيما أوجبه عليه من أمر ونهي وهذا من كرم الله بنا ولا يشعر بذلك أهل الغفلة منا\n\n\n(مسألة أخرى من هذا الباب)\n\n\n### [الحق لم يقيده الفوق عن التحت ولا التحت عن الفوق‏]\n\n\nإنما أمرت الملائكة والخلق أجمعون بالسجود وجعل معه القربة فقال واسْجُدْ واقْتَرِبْ وقال صلى الله عليه وسلم أقرب ما يكون العبد من الله في سجوده‏\n\n\nليعلموا أن الحق في نسبة الفوق إليه من قوله وهُوَ الْقاهِرُ فَوْقَ عِبادِهِ ويَخافُونَ رَبَّهُمْ من فَوْقِهِمْ كنسبة التحت إليه فإن السجود طلب السفل بوجهه كما إن القيام يطلب الفوق إذا رفع وجهه بالدعاء ويديه وقد جعل الله السجود حالة القرب من الله فلم يقيده سبحانه الفوق عن التحت ولا التحت عن الفوق فإنه خالق الفوق والتحت كما لم يقيده الاستواء على العرش عن النزول إلى السماء الدنيا ولم يقيده النزول إلى السماء الدنيا عن الاستواء على العرش كما لم يقيده سبحانه الاستواء والنزول عن أن يكون معنا أينما كنا كما قال تعالى وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ بالمعنى الذي يليق به وعلى الوجه الذي أراده كما\n\n\nقال أيضا ما وسعني أرضي ولا سمائي ووسعني قلب عبدي‏\n\n\nكما قال عنه هود عليه السلام ما من دَابَّةٍ إِلَّا هُوَ آخِذٌ بِناصِيَتِها وقال تعالى أيضا في حق الميت ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ فنسب القرب إليه من الميت وقال أيضا عز وجل ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ يعني الإنسان مع قوله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهُوَ السَّمِيعُ الْبَصِيرُ\n(مسألة دورية من هذا الباب وهذه صورتها)\n\n\nإنما قلنا اختلفت الشرائع لاختلاف النسب الإلهية لأنه لو كانت النسبة الإلهية لتحليل أمر ما في الشرع كالنسبة لتحريم ذلك الأمر عينه في الشرع لما صح تغيير الحكم وقد ثبت تغيير الحكم ولما صح أيضا قوله تعالى لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً وقد صح أن لكل أمة شرعة ومنهاجا جاءها بذلك نبيها ورسولها فنسخ وأثبت فعلمنا بالقطع أن نسبته تعالى فيما شرعه إلى محمد صلى الله عليه وسلم خلاف نسبته إلى نبي آخر وإلا لو كانت النسبة واحدة من كل وجه وهي الموجبة للتشريع الخاص لكان الشرع واحدا من كل وجه‏\n\n\n### [إنما اختلفت النسب الإلهية لاختلاف الأحوال‏]\n\n\nفإن قيل فلم اختلفت النسب الإلهية قلنا لاختلاف الأحوال فمن حاله المرض يدعو يا معافي ويا شافي ومن حاله الجوع يقول يا رزاق ومن حاله الغرق يقول يا مغيث فاختلفت النسب لاختلاف الأحوال وهو قوله كُلَّ يَوْمٍ هُوَ في شَأْنٍ وسَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ وقوله صلى الله عليه وسلم لما وصف ربه تعالى بيده الميزان يخفض ويرفع‏\n\n\nفلحالة الوزن قيل فيه الخافض الرافع فظهرت هذه النسب فهكذا في اختلاف أحوال الخلق‏\n\n\n### [إنما اختلفت الأحوال لاختلاف الزمان‏]\n\n\nوقولنا إنما اختلفت الأحوال لاختلاف الأزمان فإن اختلاف أحوال الخلق سببها اختلاف الأزمان عليها فحالها في زمان الربيع يخالف حالها في زمان الصيف وحالها في زمان الصيف يخالف حالها في زمان الخريف وحالها في زمان الخريف يخالف حالها في زمان الشتاء وحالها في زمان الشتاء يخالف حالها في زمان الربيع يقول بعض العلماء بما تفعله الأزمان في الأجسام الطبيعية تعرضوا لهواء زمان الربيع فإنه يفعل في أبدانكم ما يفعل في أشجاركم وتحفظوا من هواء زمان الخريف فإنه يفعل في أبدانكم كما يفعل في أشجاركم وقد نص الله تعالى على إننا من جملة نبات الأرض فقال والله أَنْبَتَكُمْ من الْأَرْضِ نَباتاً أراد فنبتم نباتا لأن مصدر أنبتكم إنما هو إنباتا كما قال في نسبة التكوين إلى نفس المأمور به فقال تعالى إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ فجعل التكوين إليه كذلك نسب ظهور النبات إلى النبات فافهم فلذلك قلنا إنما اختلفت الأحوال لاختلاف الأزمان‏\n\n\n### [إنما اختلفت الأزمان لاختلاف الحركات‏]\n\n\nوأما قولنا إنما اختلفت الأزمان لاختلاف الحركات فأعني بالحركات الحركات الفلكية فإنه باختلاف الحركات الفلكية حدث زمان الليل والنهار وتعينت السنون والشهور والفصول وهذه المعبر عنها بالأزمان وقولنا اختلفت الحركات لاختلاف التوجهات أريد بذلك توجه الحق عليها بالإيجاد لقوله تعالى إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ فلو كان التوجه‏\nواحدا عليها لما اختلفت الحركات وهي مختلفة فدل إن التوجه الذي حرك القمر في فلكه ما هو التوجه الذي حرك الشمس ولا غيرها من الكواكب والأفلاك ولو لم يكن الأمر كذلك لكانت السرعة أو الإبطاء في الكل على السواء قال تعالى كُلٌّ في فَلَكٍ يَسْبَحُونَ فلكل حركة توجه إلهي أي تعلق خاص من كونه مريدا\n\n\n### [إنما اختلفت التوجهات لاختلاف المقاصد]\n\n\nوقولنا إنما اختلفت التوجهات لاختلاف المقاصد فلو كان قصد الحركة القمرية بذلك التوجه عين قصد الحركة الشمسية بذلك التوجه لم يتميز أثر عن أثر والآثار بلا شك مختلفة فالتوجهات مختلفة لاختلاف المقاصد فتوجهه بالرضى عن زيد غير توجهه بالغضب على عمرو فإنه قصد تعذيب عمرو وقصد تنعيم زيد فاختلفت المقاصد\n\n\n### [إنما اختلفت المقاصد لاختلاف التجليات‏]\n\n\nوقولنا إنما اختلفت المقاصد لاختلاف التجليات فإن التجليات لو كانت في صورة واحدة من جميع الوجوه لم يصح أن يكون لها سوى قصد واحد وقد ثبت اختلاف القصد فلا بد أن يكون لكل قصد خاص تجل خاص ما هو عين التجلي للآخر فإن الاتساع الإلهي يعطي أن لا يتكرر شي‏ء في الوجود وهو الذي عولت عليه الطائفة والناس في لبس من خلق جديد يقول الشيخ أبو طالب المكي صاحب قوت القلوب وغيره من رجال الله عز وجل إن الله سبحانه ما تجلى قط في صورة واحدة لشخصين ولا في صورة واحدة مرتين ولهذا اختلفت الآثار في العالم وكني عنها بالرضى والغضب‏\n\n\n### [إنما اختلفت التجليات لاختلاف الشرائع‏]\n\n\nوقولنا إنما اختلفت التجليات لاختلاف الشرائع فإن كل شريعة طريق موصلة إليه سبحانه وهي مختلفة فلا بد أن تختلف التجليات كما تختلف العطايا أ لا تراه عز وجل إذا تجلى لهذه الأمة في القيامة وفيها منافقوها وقد اختلف نظرهم في الشريعة فصار كل مجتهد على شرع خاص هو طريقه إلى الله ولهذا اختلفت المذاهب وكل شرع في شريعة واحدة والله قد قرر ذلك على لسان رسوله صلى الله عليه وسلم عندنا فاختلفت التجليات بلا شك فإن كل طائفة قد اعتقدت في الله أمرا ما إن تجلى لها في خلافه أنكرته فإذا تحول لها في العلامة التي قد قررتها تلك الطائفة مع الله في نفسها أقرت به فإذا تجلى للأشعري في صورة اعتقاد من يخالفه في عقده في الله وتجلى للمخالف في صورة اعتقاد الأشعري مثلا أنكره كل واحد من الطائفتين كما ورد وهكذا في جميع الطوائف فإذا تجلى لكل طائفة في صورة اعتقادها فيه تعالى وهي العلامة التي ذكرها مسلم في صحيحه عن رسول الله صلى الله عليه وسلم أقروا له بأنه ربهم وهو هو لم يكن غيره فاختلفت التجليات لاختلاف الشرائع‏\n\n\n### [إنما اختلفت الشرائع لاختلاف النسب الإلهية]\n\n\nوقولنا إنما اختلفت الشرائع لاختلاف النسب الإلهية قد تقدم ودار الدور فكل شي‏ء أخذته من هذه المسائل صلح أن يكون أولا وآخرا ووسطا وهكذا كل أمر دوري يقبل كل جزء منه بالفرض الأولية والآخرية وما بينهما وقد ذكرنا مثل هذا الشكل الدوري في التدبيرات الإلهية مضاهيا لقول المتقدم إذ قال العالم بستان سياجه الدولة الدولة سلطان تحجبه السنة السنة سياسة يسوسها الملك الملك راع يعضده الجيش الجيش أعوان يكفلهم المال المال رزق يجمعه الرعية الرعية عبيد تعبدهم العدل العدل مألوف فيه صلاح العالم العالم بستان ودار الدور ويكفي هذا القدر من الإيماء إلى العلل والأسباب مخافة التطويل فإن هذا الباب واسع جدا إذ كان العالم كله مرتبطا بعضه ببعض أسباب ومسببات وعلل ومعلولات والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء الخامس والعشرون‏\n\n",
    "en": "## Chapter Forty-Eight: Concerning the Knowledge that \"Such-and-Such Was for the Sake of Such-and-Such,\" which is the Affirmation of Cause and Reason\n\n> Such-and-such was thus for the sake of such-and-such,\n> Is the knowledge of him who attained the rank of Judgment.\n\n> Do not assign a cause to the Existence of our Creator,\n> Lest your journey lead to non-existence.\n\n> He is the First (الأول) who has no\n> First, neither in origination (الحدوث) nor in eternity (القدم).\n\n### [The Necessary Reason for the Existence of the World]\n\nThe first question in this chapter is: What is the necessary reason (السبب الموجب) for the existence of the world (العالم), such that one may say concerning it, \"The world only came into existence for the sake of such-and-such\"?\n\nThat matter upon which the validity of its existence depends must either be a cause (علة), which demands its effect (معلول) by its very Essence (لذاتها), or not. If this is the case, is it intellectually sound for an effect to have two or more causes, or is it not? This is considered in intellectual scrutiny, not in conventional matters (الوضعيات). If causes multiply, does their multiplicity refer back to existent entities (أعيان وجودية), or are they merely relations (نسب) of a single matter?\n\nFurthermore, there are matters whose valid existence depends upon a preceding condition (شرط) or conditions. The name Reason (السبب) encompasses all of this. The condition has a ruling, and the cause has a ruling.\n\nIs the world, in its need for the necessary reason for its existence, in the need of an effect for its cause, or in the need of a conditioned thing (المشروط) for its condition? Whichever it is, it cannot be the other, for the cause demands the effect by its Essence, while the condition does not demand the conditioned thing by its Essence.\n\nKnowledge (العلم) is conditioned by Life (الحياة), yet the existence of Life does not necessitate the existence of Knowledge. However, the world's being-a-world (كون العالم عالما) is not like that, for Knowledge is the cause (علة) of the world's being-a-world. If Knowledge were removed, its being-a-world would be removed. In this respect, it resembles the condition, since if Life were removed, Knowledge would be removed. Yet, it is distinguished from the condition, since if Knowledge were removed, the removal of Life would not be necessitated. These are two intelligible levels (مرتبتان معقولتان) that are distinct: one is called Cause (علة) and the other is called Condition (شرط).\n\n### [The Relation of the World in its Existence to The Real]\n\nIs the relation of the world in its existence to The Real (الحق) the relation of the effect or the relation of the conditioned thing?\n\nIt is impossible for it to be the relation of the conditioned thing according to both schools of thought. For concerning the conditioned thing, we do not say that it *must* exist; rather, we say that *if* it exists, then the existence of its validating condition is necessary.\n\nBut concerning the world, according to the Ash'ari theologian (المتكلم الأشعري), we say that its existence is necessary because Knowledge (العلم) preceded its existence, and it is impossible for the known thing (المعلوم) to contradict the Knowledge. This is not said concerning the conditioned thing.\n\nAnd according to the opposing school, the philosophers (الحكماء), its existence is necessary because Allah necessitated the world’s existence by His Essence (لذاته). Therefore, its existence is necessary as long as He is described by His Essence, unlike the condition.\n\nThus, there is no difference between the Ash'ari theologian and the philosopher regarding the necessity of the world's existence by another (بالغير). Let us then call the pre-eternal connection (تعلق) of Knowledge to the world's existence a Cause (علة), just as the philosopher calls the Essence (الذات) a Cause. There is no difference.\n\nIt is not necessary for the effect to be co-existent with its cause in all Levels (المراتب). The cause undoubtedly precedes its effect in Rank (بالمرتبة), whether that precedence is the precedence of Knowledge or the Essence of The Real.\n\nNo temporal gap (بون زماني) or temporal estimation can be conceived between the Necessary Existent by Himself (الواجب الوجود لنفسه) and the contingent existent (الممكن), because our discussion concerns the first possible existent, and Time (الزمان) is itself among the contingent things. If Time is an existent matter (أمرا وجوديا), the ruling concerning it is the same as the ruling concerning all other contingent things. If it is not an existent matter but a relation (نسبة), then the relation arose with the arising of the existent effect (المعلول), an intellectual arising, not an existential arising.\n\nSince no temporal gap can be conceived between The Real (الحق) and the Creation (الخلق), only Rank (الرتبة) remains. Thus, it is never valid for the Creation to be in the Rank of The Real, just as it is not valid for the effect to be in the rank of the cause, insofar as it is an effect proceeding from it.\n\nTherefore, that which the theologian sought to avoid in his claim, and for which he criticized the philosopher who affirmed the Cause, is necessarily incumbent upon him in the precedence of Knowledge concerning the existence of the known thing, because the precedence of Knowledge demands the existence of the known thing by its Essence, necessarily, and no estimated gap can be conceived between them. We have thus alerted you to some of what is necessary in this matter.\n\n### [The World is Eternally Contingent: And The Real is Eternally Necessary]\n\nThe world has never departed from the rank of its contingency (إمكانه), whether it was non-existent or existent. The Exalted Real has never departed from the rank of the necessity of His existence by Himself (وجوب وجوده لنفسه), whether the world existed or not.\n\nIf the world were to enter into Essential Necessity (الوجوب النفسي), it would necessitate the pre-eternity (قدم) of the world and its co-existence in this rank with the Necessary Existent by Himself, who is Allah. But it has not entered; rather, it remains upon its contingency and its need for its Originator and Reason, who is Allah the Exalted.\n\nTherefore, the only intelligible distinction (البينية) remaining between The Real and the Creation is differentiation by the Essential Attribute (الصفة النفسية). By this, we distinguish between The Real and the Creation, so understand.\n\n### [Negating the Multiplicity of the Complete Cause for Intellectual Effects]\n\nAs for our statement: Is it possible in intellect for the effected matter (الأمر المعلول) to have two causes? It is not valid for the intellectual effect to have two causes. Rather, if it is an effect, it proceeds from a single cause, because the only benefit of the cause is that it has an effect (أثر) on the effect.\n\nHowever, if it happens that a condition of the effect is that it must possess an attribute by which it accepts being the effect of that cause, and that attribute cannot be the cause of that effect itself—unless that effect possesses that Essential Attribute (الصفة النفسية)—then that attribute is necessary. Yet, this does not necessitate that this Essential Attribute is its cause, for it is an Essential Attribute, and a thing cannot be the cause of itself. This would lead to the cause being the very Essence of the effect, meaning the thing would precede itself in Rank, which is impossible.\n\nThe fact that a thing is the cause of itself is impossible. If the world did not possess an attribute in itself that accepts being described by existence and non-existence equally, it would not be valid for it to be the effect of its cause, which gives preference to one of the two possibilities (existence or non-existence) when considering the world in itself. For the impossible does not accept the attribute of origination, so The Real cannot be its cause.\n\nThus, the possibility of its contingency (كونه ممكنا) being its cause is nullified, and the possibility of a thing having two causes is nullified. For the effect of the cause upon the effect is only its existence. What would be the ruling of the other cause concerning it? If its existence has already been achieved by one of them, the other has no effect remaining.\n\nIf it is said that the effect results from their conjunction (اجتماعهما), then the effect proceeds from both of them. We reply: In that case, neither one of them, when isolated, would be a cause, and the name of causality would not be valid for it, yet it has been validated. Thus, the idea that its being a cause depends on another matter is nullified.\n\nIf one asks, \"What prevents the cause from being the conjunction?\" We reply: A thing is only a cause for the effect proceeding from it, not for anything else. If it were an effect of that other thing, it would be because that other thing bestowed causality upon it, and anything acquired (مكتسب) cannot be an Essential Attribute.\n\nIf we affirm that their conjunction is the cause, that conjunction must either be a matter added (أمرا زائدا) to the essence of each one of them, or it must be their very essence. It is not permissible for it to be their very essence, for we can conceive the essence of each one of them without the conjunction. Therefore, it must be an added matter.\n\nThat added matter must be either existence, non-existence, neither existence nor non-existence, or both existence and non-existence simultaneously. The fourth division is impossible by intuition. It is impossible for it to be existence, due to the necessary infinite regress (التسلسل) it entails, or circularity (الدور), whereby it would be the cause of that which is an effect of it, which is impossible. It is impossible for it to be non-existence, because non-existence is pure negation (نفي محض) and pure negation cannot be described by having an effect. It is impossible for it to be neither existence nor non-existence, like relations (النسب), since relations have no reality in Existence; they are merely additive matters (أمور إضافية) that arise, and that which arises cannot be the cause of that from which it arose. Thus, the possibility of a thing having two causes in the intellect is nullified.\n\n### [The Permissibility of Multiple Causes in Conventional Effects]\n\nAs for conventional matters (الوضعيات), the Sacred Law (الشرع) may consider matters which, in their totality, become the reason (سببا) for establishing a ruling. This is not prevented.\n\nSince you have learned this, it is the clearest proof of the Unity of Allah the Exalted: His being the Cause (علة) of the world's existence. However, the Law did not use this term for Him, so we do not apply it to Him or call Him by it. This is an Essential Unity (توحيد ذاتي) that undoubtedly negates any partner. Allah the Almighty said: <<لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا>> (Had there been in them [heaven and earth] gods besides Allah, they would surely have been ruined). The meaning of this is that they would not have come into existence—that is, the upper world (السماء) and the lower world (الأرض).\n\nEstablish this matter firmly in your mind, for it is beneficial in negating partnership and negating limitation (التحديد) from Allah the Exalted. There is no limit to His Essence, and no partner in His dominion. <<لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ>> (There is no god but He, the All-Mighty, the All-Wise).\n\n### [The World is the Effect of Allah's Knowledge, Not the Effect of Allah's Essence]\n\n> They only assigned a cause to that\n> To which they assigned a cause, because of its being.\n\n> It is the effect of His Knowledge (علمه),\n> Not the effect of His Essence (عينه).\n\n> Look closely at what I have stipulated,\n> For it is from a secret He made manifest.\n\n> Separate the matter itself\n> From all else by clear proof,\n\n> In a verified secret:\n> \"I am the secret of His aid.\"\n\n> So I wore the cloak from\n> My seeking the essence of His voice.\n\n(Another Question)\n\n### [The Existential Link between The Real and the Creation]\n\n\"Such-and-such was for the sake of such-and-such.\" The world was divided into wretched and felicitous for the sake of the Divine Names (الأسماء الإلهية). The Divine Rank (الرتبة الإلهية) demands by its Essence that there be affliction (بلاء) and well-being (عافية) in the world. However, this does not necessitate the permanence of either, unless Allah wills it. He existed, and there was no world, yet He was named by these Names.\n\nThe matter here is like the relation of Condition and Conditioned (الشرط والمشروط), not like Cause and Effect. The conditioned thing is not valid unless the existence of the condition is valid. Yet, the condition may exist even if the conditioned thing does not occur.\n\nSince we observe affliction and well-being, we say that they must have a condition, which is The Real being a God (إلها) named the Afflicter (المبلي), the Punisher (المعذب), and the Bestower of Grace (المنعم).\n\nJust as every contingent thing (ممكن) is capable of accepting one of the two rulings (the opposites), it is also capable of accepting the negation of one of the opposites. The entire world is contingent, so it is permissible for one of the two rulings to be negated from it. Thus, permanence (الخلود) in the Hereafter, neither in punishment nor in bliss, is necessary; rather, all of that is contingent.\n\n### [Eternity in the Hereafter, in Punishment and in Bliss]\n\nIf the Divine Revelation (الخبر الإلهي) comes with a text that conveys certain knowledge and does not admit interpretation, affirming the eternity (خلود) of the world in one of the two rulings, or affirming the occurrence of each ruling in a specific part of the world and the permanence of that part therein eternally, we accept it and affirm it.\n\nAs for what has been transmitted from the Lawgiver (الشارع) that the world which is in Hell—those who are its people and shall not exit from it—their permanence therein is due to the existence of the punishment. Just as the ruling of punishment was lifted from some contingent beings (the people of Paradise), it is likewise permissible for the existence of punishment to be lifted from the people of the Fire, even while they remain in the Fire, based on His saying: <<وَمَا هُمْ بِخَارِجِينَ مِنَ النَّارِ>> (And they will not exit from the Fire), and His saying: \"My Mercy preceded My Wrath.\"\n\nThe existence of the condition does not necessitate the existence of the conditioned thing. Thus, Allah may be God (إلها) with all His Names, yet there is no punishment or pain in the world, because the lifting of punishment from some contingent beings is no more likely than its lifting from all contingent beings.\n\nTherefore, we have no intellectual proof (دليل) remaining in our hands for the perpetual existence of punishment or anything else. We rely only on the consecutively transmitted texts (النصوص المتواترة) or Unveiling (الكشف) that admits no doubt. The intellect has no right to reject it when a clear text comes from the truthful one, or a manifest Unveiling occurs.\n\n### (Another Question in this Chapter) [The Creation of Adam upon the Form and with the Two Hands]\n\nThe Form (الصورة) was perfected for Adam only because he was created with the Two Hands (باليدين). Thus, the realities of the entire cosmos (حقائق العالم بأسره) were gathered within him. The world demands the Divine Names, and thus the Divine Names were gathered within him.\n\nFor this reason, Adam, peace be upon him, was singled out with the knowledge of all the Names (علم الأسماء كلها) that relate to the world, a knowledge which Allah did not grant to the angels, who are the higher, nobler world. Allah the Almighty said: <<وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا>> (And He taught Adam all the Names), and He did not say \"some of them.\" And He said: <<عَرَضَهُمْ>> (He presented them), and did not say \"He presented them [feminine/non-human],\" indicating that He presented the named entities (المسمين), not the Names themselves.\n\nThe Messenger of Allah, peace and blessings be upon him, said: \"O Allah, I ask You by every Name You have named Yourself with, or taught to any of Your creation, or kept exclusively in the knowledge of the Unseen with You.\"\n\nIf he made this supplication before the revelation of *Surat al-Baqarah* to him, there is no contradiction between the Hadith and the verse for those who say that the Names here are the Divine Names, for the Prophet, peace and blessings be upon him, did not have knowledge of what Allah had specifically granted Adam over the angels, just as he said: <<مَا أَدْرِي مَا يُفْعَلُ بِي وَلَا بِكُمْ إِنْ أَتَّبِعُ إِلَّا مَا يُوحَى بِهِ إِلَيَّ>> (I do not know what will be done with me or with you; I only follow what is revealed to me).\n\nIf he made the supplication after the revelation of *Surat al-Baqarah*, then his saying \"all of them\" (كلها) refers to the Divine Names that demand effects in the world, and the Names of transcendence and sanctification by which He is worshipped.\n\nLikewise, his saying in the Hadith of Intercession: \"I praise my Lord with praises that Allah will teach me, which I do not know now.\"\n\nAnd his saying in the Hadith of the Blow: \"I knew the knowledge of the first and the last.\"\n\nThe knowledge of the first includes the knowledge of the Names that Allah taught Adam. And perhaps the knowledge of the last includes the knowledge of those praises with which he will praise his Lord on the Day of Resurrection.\n\n(Another Question in this Chapter)\n\n### [The Divine Vicegerency]\n\nThe Vicegerency (الخلافة) was granted to Adam, peace be upon him, and not to other species of the world, only because Allah created him upon His Form (على صورته). The vicegerent must manifest the form of the one who appointed him in that over which he is appointed, otherwise, he is not his vicegerent among them.\n\nSo, He granted him command and prohibition (الأمر والنهي) and named him the Vicegerent (الخليفة), and made the pledge of allegiance to him one of hearing and obedience in ease and hardship, difficulty and comfort. Allah commanded His servants to obey Allah, His Messenger, and those in authority among them.\n\nThe Messenger of Allah, peace and blessings be upon him, combined Messengership and Vicegerency, like David, peace be upon him, for Allah explicitly stated his vicegerency from Allah by His saying: <<فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ>> (So judge between the people with truth). The vicegerency of Adam, peace be upon him, was stated generally.\n\n### [The Distinction between the Messenger and the Vicegerent]\n\nNot every Messenger is a Vicegerent. Whoever commands and prohibits, punishes and pardons, and whose obedience Allah commands, and who combines these attributes, is a Vicegerent. Whoever merely conveys the command and prohibition of Allah, and does not have permission from Allah Himself to command and prohibit, is a Messenger who conveys the messages of his Lord. By this, the distinction between the Messenger and the Vicegerent becomes clear to you.\n\n### [Obedience to Allah, the Messenger, and Those in Authority]\n\nFor this reason, the definite article (ال) was used in His saying: <<مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ الله>> (Whoever obeys the Messenger has obeyed Allah). And He the Almighty said: <<يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا الله>> (O you who believe, obey Allah)—meaning, in what He commanded you through the tongue of His Messenger, peace and blessings be upon him, concerning which he said: \"Indeed, Allah commands you,\" which is every command found in the Book of Allah the Exalted.\n\nThen He said: <<وَأَطِيعُوا الرَّسُولَ>> (And obey the Messenger). He separated the command to obey Allah from the command to obey His Messenger. If He had meant by this only what reached us of Allah's command, there would be no added benefit. Therefore, He must have granted him the rank of command and prohibition, so that he commands and prohibits. We are commanded by Allah to obey the Messenger of Allah, peace and blessings be upon him, by His command.\n\nAllah the Exalted said: <<مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ الله>> (Whoever obeys the Messenger has obeyed Allah). Our obedience to him is in what he commanded and prohibited, concerning which he did not say that it was from Allah, making it Quran. Allah the Almighty said: <<وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا>> (And whatever the Messenger gives you, take it; and whatever he forbids you from, abstain). He attributed the prohibition to the Prophet, peace and blessings be upon him.\n\nHe used the definite article (ال) with \"the Messenger\" (الرسول) intending definition and covenant—that is, the Messenger whom We appointed as Our Vicegerent, and to whom We granted the right to command and prohibit, in addition to conveying Our command and prohibition to Our servants.\n\nThen He the Exalted said in the same verse: <<وَأُولِي الْأَمْرِ مِنْكُمْ>> (And those in authority among you)—meaning, if a vicegerent from My Messenger is appointed over you, or if you appoint him yourselves as prescribed for you, then listen to him and obey him, even if he is an Abyssinian slave whose limbs are mutilated. For in your obedience to him is obedience to the Messenger of Allah, peace and blessings be upon him. For this reason, He did not repeat \"obey\" (أطيعوا) for those in authority, but sufficed with His saying: <<أَطِيعُوا الرَّسُولَ>> (Obey the Messenger). Yet, He did not suffice with His saying: <<أَطِيعُوا الله>> (Obey Allah) instead of saying: <<أَطِيعُوا الرَّسُولَ>> (Obey the Messenger). He separated them because He the Exalted is <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), and He initiated the statement by saying: <<وَأَطِيعُوا الرَّسُولَ>> (And obey the Messenger).\n\n### [Those in Authority Do Not Legislate Sacred Laws: That is Only for Allah's Messengers]\n\nThis is proof that He the Exalted has legislated for the Prophet, peace and blessings be upon him, the right to command and prohibit. Those in authority (أولي الأمر) do not have the right to legislate Sacred Law (شريعة); rather, they have command and prohibition concerning what is permissible (مباح) for them and for us. If they command us concerning a permissible matter or prohibit us from a permissible matter, and we obey them in that, we are rewarded with the reward of one who obeyed Allah in what He made obligatory upon him of command and prohibition. This is from Allah's generosity toward us, though the heedless among us do not perceive it.\n\n(Another Question in this Chapter)\n\n### [The Real is Not Restricted by the Above from the Below, Nor the Below from the Above]\n\nThe angels and all creation were commanded to prostrate (السجود), and proximity (القربة) was associated with it, for He said: <<وَاسْجُدْ وَاقْتَرِبْ>> (Prostrate and draw near). And the Prophet, peace and blessings be upon him, said: \"The closest a servant is to Allah is when he is in prostration.\"\n\nThis is so that they may know that The Real's relation to the Above (الفوق)—from His saying: <<وَهُوَ الْقَاهِرُ فَوْقَ عِبَادِهِ>> (And He is the Subduer, above His servants) and <<يَخَافُونَ رَبَّهُمْ مِنْ فَوْقِهِمْ>> (They fear their Lord from above them)—is the same as His relation to the Below (التحت). For prostration seeks the lower direction (السفل) with the face, just as standing seeks the upper direction (الفوق) when raising the face and hands in supplication.\n\nAllah made prostration the state of proximity to Him. Thus, the Exalted is not restricted by the Above from the Below, nor the Below from the Above, for He is the Creator of the Above and the Below.\n\nJust as He is not restricted by His settling upon the Throne (الاستواء على العرش) from descending to the lowest heaven (النزول إلى السماء الدنيا), nor is He restricted by the descent to the lowest heaven from settling upon the Throne, likewise, He is not restricted by settling and descending from being with us wherever we are, as He the Exalted said: <<وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ>> (And He is with you wherever you are), in the meaning that befits Him and in the manner that He intended.\n\nAs He also said: \"My earth and My heaven did not contain Me, but the heart of My believing servant contained Me.\"\n\nAs Hud, peace be upon him, said concerning Him: <<مَا مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا>> (There is no creature but that He holds it by its forelock). And the Exalted also said concerning the deceased: <<وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ وَلَكِنْ لَا تُبْصِرُونَ>> (And We are nearer to him than you, but you do not see), attributing proximity to Himself regarding the deceased. And He the Almighty also said: <<وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ>> (And We are nearer to him than the jugular vein)—meaning man—along with His saying: <<لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ>> (There is nothing like unto Him, and He is the All-Hearing, the All-Seeing).\n\n### (A Cyclical Question in this Chapter, the form of which is as follows)\n\nWe said that the Sacred Laws (الشرائع) differed because of the difference in the Divine Relations (النسب الإلهية). If the Divine Relation for permitting a matter in the Law were the same as the Relation for prohibiting that very matter in the Law, the change in the ruling would not be valid. Yet, the change in the ruling is established.\n\nLikewise, His saying: <<لِكُلٍّ جَعَلْنَا مِنْكُمْ شِرْعَةً وَمِنْهَاجًا>> (For each of you We have appointed a Law and a Way) would not be valid. Yet, it is established that every nation has a Law and a Way brought to it by its Prophet and Messenger, who abrogated and affirmed.\n\nThus, we know with certainty that His Relation concerning what He legislated to Muhammad, peace and blessings be upon him, is different from His Relation to another Prophet. Otherwise, if the Relation were one in every respect—and it is the Relation that necessitates the specific legislation—the Law would be one in every respect.\n\n### [The Divine Relations Differed Only Due to the Difference in Circumstances]\n\nIf it is asked, \"Why did the Divine Relations differ?\" We reply: Due to the difference in circumstances (الأحوال). He whose circumstance is sickness calls, \"O Healer, O Curer.\" He whose circumstance is hunger says, \"O Sustainer.\" He whose circumstance is drowning says, \"O Rescuer.\" Thus, the Relations differed due to the difference in circumstances. This is His saying: <<كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (Every day He is in [some] affair), and <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ>> (We will attend to you, O two weighty beings). And the saying of the Prophet, peace and blessings be upon him, when describing his Lord: \"In His Hand is the Balance; He lowers and raises.\"\n\nDue to the state of weighing, He is called the Lowerer (الخافض) and the Raiser (الرافع). Thus, these Relations appeared. This is how it is in the difference of the circumstances of creation.\n\n### [The Circumstances Differed Only Due to the Difference in Times]\n\nOur statement that the circumstances differed only due to the difference in times (الأزمان) is because the difference in the circumstances of creation is caused by the difference in the times acting upon them. Their state in spring differs from their state in summer, and their state in summer differs from their state in autumn, and so on, cyclically.\n\nSome scholars, concerning what the times do to natural bodies, said: \"Expose yourselves to the air of spring, for it does to your bodies what it does to your trees, and guard yourselves against the air of autumn, for it does to your bodies what it does to your trees.\"\n\nAllah the Exalted explicitly stated that we are part of the earth's vegetation when He said: <<وَالله أَنْبَتَكُمْ مِنَ الْأَرْضِ نَبَاتًا>> (And Allah caused you to grow from the earth as a growth). He meant: \"So you grew a growth,\" because the verbal noun of *anbatakum* (He caused you to grow) is *inbatan* (a causing to grow). Similarly, He attributed creation to the thing commanded itself when He the Exalted said: <<إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ>> (Our word to a thing, when We intend it, is only that We say to it, \"Be,\" and it is). He attributed the being (التكوين) to it. Likewise, He attributed the manifestation of growth to the growth itself. Understand this. That is why we said that the circumstances differed only due to the difference in times.\n\n### [The Times Differed Only Due to the Difference in Movements]\n\nAs for our statement that the times differed only due to the difference in movements (الحركات), I mean by movements the celestial movements (الحركات الفلكية). For it is by the difference in celestial movements that the time of night and day arose, and the years, months, and seasons—which are expressed as times—were determined.\n\nOur statement that the movements differed due to the difference in orientations (التوجهات) means the orientation of The Real upon them by way of origination, based on His saying: <<إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ>> (Our word to a thing, when We intend it). If the orientation upon them were one, the movements would not differ, yet they are different. This indicates that the orientation that moved the moon in its orbit is not the orientation that moved the sun, nor any other stars or spheres. If it were not so, the speed or slowness would be the same for all. He the Exalted said: <<كُلٌّ فِي فَلَكٍ يَسْبَحُونَ>> (All are swimming in an orbit). Thus, every movement has a Divine Orientation—that is, a specific connection of His being the Willer (مريدا).\n\n### [The Orientations Differed Only Due to the Difference in Purposes]\n\nOur statement that the orientations differed only due to the difference in purposes (المقاصد) means that if the purpose of the lunar movement in that orientation were the very purpose of the solar movement in that orientation, no effect would be distinguished from another. Since the effects are undoubtedly different, the orientations are different due to the difference in purposes. His orientation with satisfaction toward Zayd is different from His orientation with wrath toward 'Amr, for He intended to punish 'Amr and intended to grant bliss to Zayd. Thus, the purposes differed.\n\n### [The Purposes Differed Only Due to the Difference in Theophanies]\n\nOur statement that the purposes differed only due to the difference in Theophanies (التجليات) means that if the Theophanies were in one form in all respects, they could only have one purpose. Since the difference in purpose is established, there must be a specific Theophany for every specific purpose, which is not the very Theophany of the other.\n\nThe Divine Vastness (الاتساع الإلهي) dictates that nothing is repeated in Existence. This is what the Sufi community relies upon, while people are in confusion regarding the new creation. Shaykh Abu Talib al-Makki, the author of *Qut al-Qulub*, and other men of Allah the Almighty, say that Allah the Exalted has never disclosed Himself (تجلى) in one form to two persons, nor in one form twice. For this reason, the effects in the world differed, and they are metaphorically referred to as Satisfaction (الرضى) and Wrath (الغضب).\n\n### [The Theophanies Differed Only Due to the Difference in Sacred Laws]\n\nOur statement that the Theophanies differed only due to the difference in Sacred Laws (الشرائع) means that every Law is a path leading to Him the Exalted, and these paths are different. Therefore, the Theophanies must differ, just as the gifts differ. Do you not see that when He the Almighty discloses Himself to this nation on the Day of Resurrection—and among them are their hypocrites—their view of the Law has differed, so every jurist (مجتهد) follows a specific Law which is his path to Allah? For this reason, the schools of jurisprudence (المذاهب) differed, and every Law is within a single Sacred Law. Allah has confirmed this through the tongue of His Messenger, peace and blessings be upon him, according to us.\n\nThus, the Theophanies undoubtedly differed. For every group has believed a certain thing about Allah, and if He were to disclose Himself to them in a form contrary to their belief, they would deny it. But if He transforms Himself for them into the sign that that group has established with Allah in their souls, they acknowledge Him. Thus, if He discloses Himself to the Ash'ari in the form of the belief of one who opposes him in his creed concerning Allah, and discloses Himself to the opponent in the form of the Ash'ari's belief, for example, each of the two groups would deny Him, as has been reported. This is the case with all groups. When He discloses Himself to each group in the form of their belief in Him the Exalted—which is the sign mentioned by Muslim in his *Sahih* from the Messenger of Allah, peace and blessings be upon him—they acknowledge Him as their Lord, and He is He; He was not other than Himself. Thus, the Theophanies differed due to the difference in the Sacred Laws.\n\n### [The Sacred Laws Differed Only Due to the Difference in Divine Relations]\n\nOur statement that the Sacred Laws differed only due to the difference in the Divine Relations (النسب الإلهية) has already preceded, and the cycle (الدور) has completed.\n\nEvery matter you take from these questions is fit to be the beginning, the end, and the middle. Likewise, every cyclical matter accepts, by hypothesis, the primacy and the finality of every part, and what lies between them. We have mentioned a similar cyclical figure in the Divine Administrations (التدبيرات الإلهية), paralleling the saying of the ancient sage: \"The world is a garden whose fence is the state. The state is a sultan protected by the Law. The Law is a policy governed by the king. The king is a shepherd supported by the army. The army is helpers sustained by wealth. Wealth is provision gathered by the subjects. The subjects are servants enslaved by justice. Justice is a familiar thing in which is the welfare of the world. The world is a garden.\" And the cycle is complete.\n\nThis much suffices as an allusion to the causes and reasons, for fear of undue length, as this chapter is very vast, since the entire world is interconnected, part to part, as reasons and results, and causes and effects. <<وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).\n\n[End of Volume Twenty-Five]",
    "ur": "## (باب اڑتالیسواں اس معرفت کے بارے میں کہ کوئی چیز کیوں ہے، اور یہ علت اور سبب کا اثبات ہے)\n\nکوئی چیز اس لیے ہے کہ وہ ایسی ہے،\nیہ اس شخص کا علم ہے جس نے حکم کا مرتبہ حاصل کیا۔\nہمارے خالق کے وجود کی کوئی علت نہ بیان کرو،\nورنہ تمہارا سفر عدم کی طرف ہو جائے گا۔\nاور وہ (الحق) ہی اول ہے جس کے لیے\nحدوث (پیدائش) اور قدم (ازلیت) میں کوئی اول نہیں۔\n\n### [عالم کے وجود کا موجب سبب]\n\nاس باب کا پہلا مسئلہ یہ ہے کہ عالم کے وجود کا موجب سبب (السبب الموجب) کیا ہے؟ تاکہ اس کے بارے میں کہا جا سکے کہ عالم اس لیے وجود میں آیا۔ اور وہ امر جس پر اس کے وجود کی صحت موقوف ہے، یا تو وہ علت (العلة) ہو گا جو اپنے معلول (المعلول) کو اپنی ذات کے لیے طلب کرتی ہے، اور اگر ایسا ہے تو کیا معلول کے لیے دو یا اس سے زیادہ علتیں ہو سکتی ہیں یا نہیں؟ اور یہ عقلی نظر میں ہے، نہ کہ وضعی (من گھڑت) امور میں۔ اور اگر علتیں متعدد ہوں تو کیا ان کا تعدد وجودی اعیان کی طرف لوٹتا ہے یا وہ کسی ایک امر کے نسب (اضافے) ہیں؟ اور پھر کچھ ایسے امور ہیں جن کے وجود کی صحت کسی سابق شرط (الشرط) یا شرائط پر موقوف ہوتی ہے، اور ان سب کو سبب (السبب) کا نام جمع کرتا ہے۔ شرط کا حکم الگ ہے اور علت کا حکم الگ۔ تو کیا عالم اپنے وجود کے موجب سبب کا محتاج ہونے میں معلول کی علت کا محتاج ہونے جیسا ہے یا مشروط (المشروط) کا شرط کا محتاج ہونے جیسا؟ اور ان دونوں میں سے جو بھی ہو، دوسرا نہیں ہو سکتا۔ کیونکہ علت اپنے معلول کو اپنی ذات کے لیے طلب کرتی ہے، جبکہ شرط مشروط کو اپنی ذات کے لیے طلب نہیں کرتی۔ چنانچہ علم (العلم) حیات (الحیاۃ) کے ساتھ مشروط ہے، لیکن حیات کے وجود سے علم کا وجود لازم نہیں آتا۔ اور عالم کا عالم ہونا ایسا نہیں ہے۔ کیونکہ علم عالم کے عالم ہونے میں علت (العلة) ہے۔ پس اگر علم اٹھ جائے تو اس کا عالم ہونا بھی اٹھ جائے گا۔ اس لحاظ سے یہ شرط سے مشابہت رکھتا ہے، کیونکہ اگر حیات اٹھ جائے تو علم اٹھ جائے گا، اور اگر اس کا عالم ہونا اٹھ جائے تو علم اٹھ جائے گا۔ لیکن یہ شرط سے ممتاز ہے، کیونکہ اگر علم اٹھ جائے تو حیات کا اٹھ جانا لازم نہیں آتا۔ پس یہ دو معقول مرتبے ہیں جو ممتاز ہو چکے ہیں، ایک کو علت (العلة) اور دوسرے کو شرط (الشرط) کہا جاتا ہے۔\n\n### [وجود میں عالم کی ذات حق (الحق) سے نسبت]\n\nتو کیا عالم کی اپنے وجود میں ذات حق (الحق) سے نسبت معلول (المعلول) کی نسبت ہے یا مشروط (المشروط) کی نسبت؟ دونوں مذاہب کے مطابق مشروط کی نسبت ہونا محال ہے۔ کیونکہ ہم مشروط کے بارے میں یہ نہیں کہتے کہ وہ ہو کر رہے گا، بلکہ ہم یہ کہتے ہیں کہ اگر وہ ہو تو اس کے وجود کو صحیح کرنے والی شرط کا ہونا ضروری ہے۔ اور ہم عالم کے بارے میں متکلم اشعری کے مذہب پر کہتے ہیں کہ اس کا ہونا ضروری ہے، کیونکہ اس کے ہونے کا علم پہلے سے موجود تھا، اور معلوم کے خلاف کا واقع ہونا محال ہے۔ اور یہ بات مشروط کے بارے میں نہیں کہی جاتی۔ اور مخالف (حکماء) کے مذہب پر، اس کا ہونا ضروری ہے، کیونکہ اللہ نے عالم کے وجود کا تقاضا اپنی ذات کے لیے کیا، لہٰذا جب تک وہ اپنی ذات کے ساتھ موصوف ہے، اس کا ہونا ضروری ہے، برخلاف شرط کے۔ لہٰذا، عالم کے غیر کے ذریعے واجب الوجود ہونے کے معاملے میں متکلم اشعری اور حکیم کے درمیان کوئی فرق نہیں ہے۔ پس ہم عالم کے ازل سے ہونے کے ساتھ علم کے تعلق کو علت (العلة) کا نام دیتے ہیں، جیسا کہ حکیم ذات (الذات) کو علت کہتا ہے، اور کوئی فرق نہیں۔ اور یہ ضروری نہیں کہ معلول تمام مراتب میں اپنی علت کے ساتھ مساوی ہو۔ علت بلا شک اپنے معلول پر مرتبے میں مقدم ہوتی ہے، خواہ وہ علم کا سبقت کرنا ہو یا ذات حق (الحق) کا۔ اور واجب الوجود لنفسہ (اپنی ذات کے لیے واجب الوجود) اور ممکن (الممکن) کے درمیان زمانی فاصلہ یا زمانی اندازہ معقول نہیں ہے، کیونکہ ہماری گفتگو پہلے ممکن موجود کے بارے میں ہے، اور زمان (الزمان) ممکنات میں سے ہے۔ اگر وہ کوئی وجودی امر ہے تو اس کا حکم باقی ممکنات جیسا ہے، اور اگر وہ وجودی امر نہیں ہے بلکہ ایک نسبت (النسبۃ) ہے، تو وہ نسبت معلول کے حدوث کے ساتھ حادث ہوئی ہے، عقلی حدوث کے ساتھ نہ کہ وجودی حدوث کے ساتھ۔ اور جب حق (الحق) اور خلق (الخلق) کے درمیان زمانی فاصلہ معقول نہیں ہے، تو صرف مرتبہ (الرتبۃ) باقی رہ جاتا ہے۔ لہٰذا یہ کبھی بھی صحیح نہیں ہو سکتا کہ خلق حق کے مرتبے میں ہو، جیسا کہ یہ صحیح نہیں ہو سکتا کہ معلول علت کے مرتبے میں ہو، اس لحاظ سے کہ وہ اس سے معلول ہے۔ پس جس چیز سے متکلم اپنے گمان میں بھاگا اور علت کے قائل حکیم پر طعنہ زنی کی، وہ اسے معلوم کے ہونے میں علم کے سبقت کرنے کی وجہ سے لازم آتی ہے، کیونکہ علم کا سبقت کرنا معلوم کے ہونے کو اپنی ذات کے لیے طلب کرتا ہے، اور یہ ضروری ہے، اور ان دونوں کے درمیان کوئی مقدر فاصلہ معقول نہیں ہے۔ پس ہم نے تمہیں اس مسئلے میں بعض ضروری باتوں پر متنبہ کر دیا ہے۔\n\n### [عالم ہمیشہ ممکن ہے: اور حق (الحق) ہمیشہ واجب ہے]\n\nپس عالم ہمیشہ اپنے امکان (الإمکان) کے مرتبے میں رہا، خواہ وہ معدوم ہو یا موجود۔ اور حق تعالیٰ ہمیشہ اپنے لیے واجب الوجود (واجب الوجود لنفسہ) ہونے کے مرتبے میں رہا، خواہ عالم ہو یا نہ ہو۔ اگر عالم وجوب نفسی (الوجود النفسی) میں داخل ہو جاتا تو عالم کا قدم (ازلیت) اور اس مرتبے میں واجب الوجود لنفسہ یعنی اللہ کے ساتھ مساوی ہونا لازم آتا۔ لیکن وہ داخل نہیں ہوا، بلکہ اپنے امکان (الإمکان) اور اپنے موجد اور سبب یعنی اللہ تعالیٰ کا محتاج رہا۔ لہٰذا حق (الحق) اور خلق (الخلق) کے درمیان معقول فاصلہ صرف صفات نفسیہ (الصفۃ النفسیۃ) کے ذریعے تمیز کرنا باقی رہا۔ پس ہم اسی سے حق اور خلق کے درمیان فرق کرتے ہیں، پس سمجھ لو۔\n\n### [عقلی معلولات کے لیے علت تامہ کے تعدد کی نفی]\n\nاور جہاں تک ہمارے اس قول کا تعلق ہے کہ کیا عقل میں معلول امر کے لیے دو علتیں ہو سکتی ہیں؟ تو عقلی معلول (المعلول العقلی) کے لیے دو علتیں ہونا صحیح نہیں ہے، بلکہ اگر وہ معلول ہے تو ایک ہی علت سے ہو گا، کیونکہ علت کا فائدہ صرف یہ ہے کہ اس کا معلول میں کوئی اثر ہو۔ لیکن اگر یہ اتفاق ہو کہ معلول کی شرط یہ ہو کہ وہ ایک ایسی صفت پر ہو جس کے ذریعے وہ اس علت کا معلول ہونا قبول کرے، اور یہ صفت اس معلول کے لیے خود علت نہیں ہو سکتی، مگر یہ کہ وہ معلول اس صفت نفسیہ (الصفۃ النفسیۃ) کے ساتھ ہو، لہٰذا یہ ضروری ہے۔ اور اس سے یہ لازم نہیں آتا کہ وہ صفت نفسیہ اس کی علت ہو، کیونکہ وہ صفت نفسیہ ہے، اور کوئی چیز اپنی ذات کی علت نہیں ہو سکتی۔ کیونکہ یہ اس بات کی طرف لے جائے گا کہ علت عین معلول ہو، تو چیز مرتبے میں خود پر مقدم ہو جائے، اور یہ محال ہے۔ پس کسی چیز کا اپنی ذات کی علت ہونا محال ہے۔ کیونکہ اگر عالم اپنی ذات میں ایسی صفت پر نہ ہوتا جو وجود اور عدم کو یکساں طور پر قبول کرے، تو اس کے لیے یہ صحیح نہ ہوتا کہ وہ اپنی علت کا معلول ہو جو اس کے لیے جائز دو امور میں سے ایک کو ترجیح دیتی ہے، اس کی اپنی ذات کے لحاظ سے۔ کیونکہ محال (المحال) ایجاد کی صفت کو قبول نہیں کرتا، لہٰذا حق (الحق) اس کی علت نہیں ہو سکتا۔ پس اس کا ممکن ہونا اس کی علت ہو، یہ باطل ہوا۔ اور یہ بھی باطل ہوا کہ کسی چیز کی دو علتیں ہوں۔ کیونکہ علت کا معلول میں اثر صرف اس کا وجود ہوتا ہے، تو دوسری علت کا اس میں کیا حکم ہے؟ اگر وہ وجود ہے، تو وہ ایک سے حاصل ہو چکا، لہٰذا دوسرے کا کوئی اثر باقی نہیں رہا۔ اگر کہا جائے کہ ان دونوں کے اجتماع سے معلول پیدا ہوا، تو وہ ان دونوں سے ہوا، تو ہم کہیں گے کہ ان میں سے ہر ایک جب اکیلا ہو تو علت نہیں ہو گا، اور اس پر علیت (العلّیۃ) کا نام صحیح نہیں ہو گا، حالانکہ وہ صحیح ہے۔ پس یہ باطل ہوا کہ اس کا علت ہونا کسی دوسرے امر پر موقوف ہو۔ اگر وہ کہے کہ اجتماع سے علت ہونے میں کیا رکاوٹ ہے؟ ہم کہیں گے کہ کوئی چیز اس معلول کے لیے خود علت ہوتی ہے، نہ کہ کسی دوسرے کے لیے، تو وہ اس دوسرے کا معلول ہو گا، کیونکہ اس دوسرے نے اسے علیت کسب کرائی ہے، اور ہر کسب کیا ہوا امر صفت نفسیہ نہیں ہوتا۔ اور اگر ہم کہیں کہ ان دونوں کے اجتماع سے علت ہو گا، تو وہ اجتماع ان دونوں میں سے ہر ایک کی ذات سے زائد امر ہو گا یا عین ان دونوں کا ہو گا؟ ان کا عین ہونا جائز نہیں، کیونکہ ہم ان میں سے ہر ایک کی ذات کو سمجھتے ہیں اور اجتماع کو نہیں، لہٰذا اسے زائد ہونا ضروری ہے۔ تو وہ زائد یا تو وجود ہو گا یا عدم، یا نہ وجود نہ عدم، یا وجود اور عدم دونوں۔ یہ چوتھا حصہ بدیہی طور پر محال ہے۔ اور وجود ہونا محال ہے، کیونکہ اس سے لازم آنے والے تسلسل (التسلسل) یا دور (الدور) کی وجہ سے، تو وہ اس کا علت ہو گا جس کا وہ معلول ہے، اور یہ محال ہے۔ اور عدم ہونا محال ہے، کیونکہ عدم محض نفی ہے، اور محض نفی اثر کے ساتھ متصف نہیں ہوتی۔ اور نہ وجود نہ عدم ہونا محال ہے، جیسے نسب (النسب)، کیونکہ نسب کا وجود میں کوئی حقیقت نہیں، وہ اضافی امور ہیں جو حادث ہوتے ہیں، اور جو حادث ہوتا ہے وہ اس کی علت نہیں ہو سکتا جس سے وہ حادث ہوا ہے۔ پس عقل میں کسی چیز کی دو علتیں ہونا باطل ہوا۔\n\n### [وضعی معلولات میں علت کے تعدد کا جواز]\n\nاور جہاں تک وضعی (شرعی) امور کا تعلق ہے، تو شریعت ایسے امور کو معتبر قرار دے سکتی ہے جو مجموعی طور پر حکم کے مرتب ہونے کا سبب بنتے ہیں۔ اس سے کوئی رکاوٹ نہیں۔ پس جب تم یہ جان چکے ہو، تو یہ اللہ تعالیٰ کی توحید پر سب سے بڑی دلیل ہے کہ وہ عالم کے وجود میں علت ہے۔ مگر یہ کہ شریعت نے اس لفظ کا اطلاق اس پر نہیں کیا، لہٰذا ہم اسے اس پر اطلاق نہیں کریں گے اور نہ ہی اسے اس نام سے پکاریں گے۔ پس یہ ایک ذاتی توحید ہے جس کے ساتھ شریک کی نفی بلا شک ہوتی ہے۔ اللہ عزوجل نے فرمایا:\n**لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا**\n(اگر آسمانوں اور زمین میں اللہ کے سوا اور معبود ہوتے تو وہ دونوں بگڑ جاتیں)۔\nاور اس کا مطلب یہ ہے کہ وہ وجود میں نہ آتیں، یعنی عالم علوی (آسمان) اور سفلی (زمین)۔ پس اس مسئلے کو اپنے ذہن میں پختہ کر لو، کیونکہ یہ شریک کی نفی اور اللہ تعالیٰ سے تحدید (حد بندی) کی نفی میں مفید ہے۔ پس اس کی ذات کی کوئی حد نہیں اور اس کی بادشاہی میں کوئی شریک نہیں:\n**لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ‏**\n(اس کے سوا کوئی معبود نہیں، وہ غالب، حکمت والا ہے)۔\n\n### [عالم اللہ کے علم کا معلول ہے نہ کہ اللہ کی ذات کا معلول]\n\nانہوں نے جس چیز کی علت بیان کی،\nاس کی علت صرف اس لیے بیان کی کہ\nوہ اس کے علم کا معلول ہے،\nاس کی ذات (عین) کا معلول نہیں۔\nپس دیکھو جو میں نے بیان کیا ہے،\nوہ اس کے رازوں میں سے ہے۔\nاس امر کو اس کے سوا سے دلیل کے ساتھ جدا کر،\nایک محقق راز میں کہ میں اس کی مدد کا راز ہوں۔\nپس میں نے اس کی آواز کی عین طلب میں\nچادر اوڑھ لی۔\n\n(ایک اور مسئلہ)\n\n### [حق (الحق) اور خلق (الخلق) کے درمیان وجودی رابطہ]\n\nکوئی چیز اس لیے ہے کہ وہ ایسی ہے (إنما كان كذا لكذا)۔ عالم کا شقی (بدبخت) اور سعید (خوش بخت) میں تقسیم ہونا اسماء الٰہیہ (الأسماء الإلٰہیۃ) کی وجہ سے ہے۔ کیونکہ رتبہ الٰہیہ (الرتبۃ الإلٰہیۃ) اپنی ذات کے لیے یہ تقاضا کرتا ہے کہ عالم میں بلاء (آزمائش) اور عافیت دونوں ہوں۔ اور اس سے ان میں سے کسی چیز کا دوام لازم نہیں آتا، مگر یہ کہ اللہ چاہے۔ وہ تھا اور عالم نہیں تھا، اور وہ ان اسماء سے موسوم تھا۔ پس یہ معاملہ شرط اور مشروط جیسا ہے، نہ کہ علت اور معلول جیسا۔ مشروط اس وقت تک صحیح نہیں ہوتا جب تک شرط کا وجود صحیح نہ ہو۔ اور شرط ہو سکتی ہے اگرچہ مشروط واقع نہ ہو۔ پس جب ہم نے بلاء اور عافیت کو دیکھا، تو ہم نے کہا کہ ان کے لیے شرط کا ہونا ضروری ہے، اور وہ یہ ہے کہ حق (الحق) ایک ایسا الٰہ ہو جو \"المبلی\" (آزمائش دینے والا)، \"المعذب\" (عذاب دینے والا) اور \"المنعم\" (نعمت دینے والا) کہلاتا ہو۔ اور جس طرح ہر ممکن (الممکن) دو حکموں یعنی متضادوں میں سے ایک کو قبول کرنے والا ہے، اسی طرح وہ دونوں متضادوں میں سے ایک کی نفی کو بھی قبول کرنے والا ہے۔ پس سارا عالم ممکن ہے، لہٰذا جائز ہے کہ اس سے دونوں حکموں میں سے ایک کی نفی ہو جائے۔ پس آخرت میں عذاب میں یا نعمت میں خلود (ہمیشگی) لازم نہیں آتا، بلکہ یہ سب ممکن ہے۔\n\n### [آخرت میں عذاب اور نعمت میں خلود (ہمیشگی)]\n\nپس اگر کوئی خبر الٰہی وارد ہو جو ایسے نص کے ساتھ علم کا فائدہ دے جو تاویل کا احتمال نہ رکھتا ہو، کہ عالم دونوں حکموں میں سے کسی ایک میں ہمیشہ رہے گا، یا عالم کے کسی معین حصے میں ہر حکم واقع ہو گا اور وہ حصہ اس میں لامتناہی طور پر ہمیشہ رہے گا، تو ہم اسے قبول کریں گے اور اس کے قائل ہوں گے۔ اور جو شارع کی طرف سے وارد ہوا ہے کہ وہ عالم جو جہنم میں ہے، جو اس کے اہل ہیں اور اس سے نہیں نکلیں گے، ان کا اس میں باقی رہنا عذاب کے وجود کی وجہ سے ہے۔ پس جس طرح کسی ممکن سے عذاب کا حکم اٹھ گیا، اور وہ اہل جنت ہیں، اسی طرح اہل نار سے بھی عذاب کا وجود اٹھ جانا جائز ہے، باوجود اس کے کہ وہ آگ میں ہوں، اس کے قول کی وجہ سے:\n**وَما هُمْ بِخارِجِينَ مِنَ النَّارِ**\n(اور وہ آگ سے نکلنے والے نہیں ہوں گے)۔\nاور فرمایا: \"میری رحمت میرے غضب پر سبقت لے گئی\"۔\n\nاور شرط کے وجود سے مشروط کا وجود لازم نہیں آتا۔ پس اللہ اپنے تمام اسماء کے ساتھ الٰہ ہو گا، اور عالم میں کوئی عذاب یا تکلیف نہیں ہو گی، کیونکہ کسی ممکن سے اس کا اٹھ جانا تمام ممکنات سے اس کے اٹھ جانے سے زیادہ اولیٰ نہیں ہے۔ پس ہمارے پاس عقلی دلیل کے ذریعے ہمیشہ عذاب یا کسی اور چیز کے وجود پر کوئی دلیل باقی نہیں رہتی۔ پس صرف متواتر نصوص یا ایسا کشف (الکشف) ہے جس میں کوئی شبہ نہ ہو، تو جب صادق کی طرف سے صریح نص یا واضح کشف وارد ہو تو عقل کے لیے اسے رد کرنا جائز نہیں۔\n\n### (اس باب کا ایک اور مسئلہ) [آدم کا صورت پر اور دو ہاتھوں سے پیدا کیا جانا]\n\nآدم (علیہ السلام) کے لیے صورت (الصورة) کا صحیح ہونا صرف اس لیے تھا کہ اسے دو ہاتھوں سے پیدا کیا گیا، پس اس میں پورے عالم کی حقائق جمع ہو گئیں۔ اور عالم اسماء الٰہیہ (الأسماء الإلٰہیۃ) کا تقاضا کرتا ہے۔ پس اس میں اسماء الٰہیہ جمع ہو گئے، اور اسی لیے آدم علیہ السلام کو ان تمام اسماء کے علم کے ساتھ خاص کیا گیا جن کا عالم کی طرف توجہ ہے۔ اور یہ علم اللہ نے فرشتوں کو نہیں دیا، حالانکہ وہ اعلیٰ اور اشرف عالم ہیں۔ اللہ عزوجل نے فرمایا:\n**وَعَلَّمَ آدَمَ الْأَسْماءَ كُلَّها**\n(اور اس نے آدم کو تمام نام سکھا دیے)۔\nاور یہ نہیں فرمایا کہ بعض نام۔ اور فرمایا:\n**عَرَضَهُمْ**\n(اس نے ان کو پیش کیا)۔\nاور یہ نہیں فرمایا کہ ان کو (مؤنث کے لیے) پیش کیا۔ پس یہ اس بات پر دلالت کرتا ہے کہ اس نے مسمیات (ناموں والی چیزوں) کو پیش کیا نہ کہ صرف ناموں کو۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n\"اے اللہ، میں تجھ سے تیرے ہر اس نام کے ذریعے سوال کرتا ہوں جو تو نے خود کو دیا، یا اپنی مخلوق میں سے کسی کو سکھایا، یا اپنے غیب کے علم میں اپنے پاس محفوظ رکھا۔\"\n\nپس اگر یہ دعا آپ صلی اللہ علیہ وسلم نے سورۃ البقرہ کے نزول سے پہلے مانگی تھی، تو ان لوگوں کے نزدیک خبر اور آیت میں کوئی تعارض نہیں جو کہتے ہیں کہ یہاں اسماء سے مراد اسماء الٰہیہ ہیں۔ کیونکہ آپ صلی اللہ علیہ وسلم کو اس چیز کا علم نہیں تھا جس کے ساتھ اللہ نے آدم کو فرشتوں پر خاص کیا تھا، جیسا کہ آپ صلی اللہ علیہ وسلم نے فرمایا:\n**ما أَدْرِي ما يُفْعَلُ بِي ولا بِكُمْ إِنْ أَتَّبِعُ إِلَّا ما يُوحى‏ بِهِ إِلَيَّ**\n(میں نہیں جانتا کہ میرے ساتھ کیا کیا جائے گا اور نہ تمہارے ساتھ، میں تو صرف اس وحی کی پیروی کرتا ہوں جو میری طرف کی جاتی ہے)۔\nاور اگر آپ صلی اللہ علیہ وسلم نے یہ دعا سورۃ البقرہ کے نزول کے بعد مانگی تھی، تو آپ کا قول \"کلہا\" (تمام) سے مراد وہ اسماء الٰہیہ ہوں گے جو عالم میں آثار کا تقاضا کرتے ہیں، اور وہ اسماء تنزیہ اور تقدیس جن کے ذریعے عبادت کی جاتی ہے۔ اور اسی طرح\n\nآپ صلی اللہ علیہ وسلم کا شفاعت کی حدیث میں یہ قول کہ: \"میں اپنے رب کی ایسی تعریفوں کے ساتھ تعریف کروں گا جو اللہ مجھے سکھائے گا، جنہیں میں ابھی نہیں جانتا۔\"\n\nاور آپ کا ضربہ (سجدہ) کی حدیث میں یہ قول کہ: \"پس میں نے اولین و آخرین کا علم جان لیا۔\"\n\nاور اولین کا علم جاننے میں وہ اسماء بھی شامل ہیں جو اللہ نے آدم کو سکھائے تھے۔ اور شاید آخرین کا علم جاننے میں وہ تعریفیں بھی شامل ہوں جن کے ساتھ وہ قیامت کے دن اپنے رب کی تعریف کریں گے۔\n\n(اس باب کا ایک اور مسئلہ)\n\n### [خلافت الٰہیہ]\n\nآدم علیہ السلام کے لیے خلافت (الخلافۃ) عالم کی دیگر انواع کے بجائے صرف اس لیے تھی کہ اللہ تعالیٰ نے انہیں اپنی صورت (صورتہ) پر پیدا کیا۔ پس خلیفہ کے لیے ضروری ہے کہ وہ جس پر خلیفہ بنایا گیا ہے، اس میں اپنے مستخلف (جس نے خلیفہ بنایا) کی صورت میں ظاہر ہو، ورنہ وہ ان میں اس کا خلیفہ نہیں ہے۔ پس اللہ نے اسے امر (حکم) اور نہی (منع) عطا کیا اور اسے خلیفہ (الخلیفۃ) کا نام دیا، اور اس کے لیے بیعت کو سننے اور اطاعت کرنے کے ساتھ لازم کیا، خواہ خوشی میں ہو یا ناخوشی میں، تنگی میں ہو یا آسانی میں۔ اور اللہ سبحانہ نے اپنے بندوں کو اللہ کی، اس کے رسول کی، اور ان میں سے اولی الامر (حکمرانوں) کی اطاعت کا حکم دیا۔ پس رسول اللہ صلی اللہ علیہ وسلم نے رسالت اور خلافت کو جمع کیا، جیسے داؤد علیہ السلام نے، کیونکہ اللہ نے ان کی خلافت کو اللہ کی طرف سے نص کے ساتھ بیان کیا، اپنے اس قول میں:\n**فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ**\n(پس لوگوں کے درمیان حق کے ساتھ فیصلہ کرو)۔\nاور آدم علیہ السلام کی خلافت کو مجمل رکھا۔\n\n### [رسول اور خلیفہ کے درمیان فرق]\n\nاور ہر رسول خلیفہ نہیں ہوتا۔ پس جس نے حکم دیا اور منع کیا، سزا دی اور معاف کیا، اور اللہ نے اس کی اطاعت کا حکم دیا، اور یہ صفات اس کے لیے جمع ہو گئیں، وہ خلیفہ تھا۔ اور جس نے اللہ کے حکم اور منع کو پہنچایا اور اسے اپنی طرف سے اللہ کی طرف سے حکم دینے اور منع کرنے کی اجازت نہ تھی، تو وہ رسول ہے جو اپنے رب کے پیغامات پہنچاتا ہے۔ اور اسی سے تمہارے لیے رسول اور خلیفہ کے درمیان فرق واضح ہو گیا۔\n\n### [اللہ کی اطاعت، رسول کی اطاعت اور اولی الامر کی اطاعت]\n\nاور اسی لیے اللہ تعالیٰ کے اس قول میں الف لام (ال) آیا:\n**مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله**\n(جس نے رسول کی اطاعت کی، اس نے درحقیقت اللہ کی اطاعت کی)۔\nاور فرمایا:\n**يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا الله**\n(اے ایمان والو! اللہ کی اطاعت کرو)۔\nیعنی اس میں جو اس نے اپنے رسول صلی اللہ علیہ وسلم کی زبان پر تمہیں حکم دیا، جس کے بارے میں آپ صلی اللہ علیہ وسلم نے فرمایا: \"بے شک اللہ تمہیں حکم دیتا ہے\"، اور یہ ہر وہ حکم ہے جو اللہ کی کتاب میں آیا ہے۔ پھر فرمایا:\n**وَأَطِيعُوا الرَّسُولَ**\n(اور رسول کی اطاعت کرو)۔\nپس اس نے اللہ کی اطاعت کے حکم کو رسول صلی اللہ علیہ وسلم کی اطاعت سے جدا کیا۔ اگر اس سے مراد صرف وہ ہوتا جو اللہ کے حکم سے ہم تک پہنچا، تو اس میں کوئی اضافی فائدہ نہ ہوتا۔ لہٰذا ضروری ہے کہ وہ اسے امر اور نہی کا مرتبہ عطا کرے، تاکہ وہ حکم دے اور منع کرے۔ پس ہمیں اللہ کے حکم سے رسول اللہ صلی اللہ علیہ وسلم کی اطاعت کا حکم دیا گیا ہے۔ اور اللہ تعالیٰ نے فرمایا:\n**مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله**\n(جس نے رسول کی اطاعت کی، اس نے درحقیقت اللہ کی اطاعت کی)۔\nاور ہماری اطاعت آپ صلی اللہ علیہ وسلم کے اس حکم اور منع میں ہے جس کے بارے میں آپ نے یہ نہیں فرمایا کہ یہ اللہ کی طرف سے ہے اور قرآن ہے۔ اللہ عزوجل نے فرمایا:\n**وَما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَما نَهاكُمْ عَنْهُ فَانْتَهُوا**\n(اور جو کچھ رسول تمہیں دیں وہ لے لو اور جس سے منع کریں اس سے رک جاؤ)۔\nپس اس نے نہی (منع) کو آپ صلی اللہ علیہ وسلم کی طرف منسوب کیا۔ پس اس نے رسول (الرسول) میں الف لام (ال) لایا، جس سے مراد تعریف اور عہد ہے، یعنی وہ رسول جسے ہم نے اپنا خلیفہ بنایا، پس ہم نے اسے یہ حق دیا کہ وہ ہمارے حکم اور منع کو اپنے بندوں تک پہنچانے کے علاوہ بھی حکم دے اور منع کرے۔ پھر اسی آیت میں فرمایا:\n**وَأُولِي الْأَمْرِ مِنْكُمْ**\n(اور تم میں سے اولی الامر کی)۔\nیعنی جب تمہارا کوئی خلیفہ میرے رسول کی طرف سے تم پر حاکم ہو، یا تم اسے اپنی طرف سے مقرر کرو جیسا کہ تمہارے لیے مشروع کیا گیا ہے، تو اس کی سنو اور اطاعت کرو، خواہ وہ حبشی غلام ہی کیوں نہ ہو جس کے اعضاء کٹے ہوئے ہوں۔ کیونکہ تمہاری اس کی اطاعت میں رسول اللہ صلی اللہ علیہ وسلم کی اطاعت ہے۔ اور اسی لیے اولی الامر میں \"اطیعوا\" (اطاعت کرو) کا اعادہ نہیں کیا، اور \"أَطِيعُوا الرَّسُولَ\" پر اکتفا کیا، اور \"أَطِيعُوا الله\" پر \"أَطِيعُوا الرَّسُولَ\" سے اکتفا نہیں کیا، پس اس نے جدا کیا کیونکہ وہ تعالیٰ:\n**لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ**\n(اس جیسی کوئی چیز نہیں اور وہ سننے والا، دیکھنے والا ہے)۔\nاور اس نے \"وَأَطِيعُوا الرَّسُولَ\" کہہ کر بات کو دوبارہ شروع کیا۔\n\n### [اولی الامر کے لیے شرائع کو مشروع کرنا نہیں ہے: یہ صرف اللہ کے رسولوں کے لیے ہے]\n\nپس یہ اس بات کی دلیل ہے کہ اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کے لیے حکم دینے اور منع کرنے کو مشروع کیا ہے، اور اولی الامر کے لیے شرائع کو مشروع کرنا نہیں ہے۔ انہیں صرف ان امور میں امر اور نہی کا حق ہے جو ان کے اور ہمارے لیے مباح ہیں۔ پس جب وہ ہمیں کسی مباح کا حکم دیں یا کسی مباح سے منع کریں اور ہم ان کی اطاعت کریں، تو ہمیں اس میں اس شخص کا اجر ملے گا جس نے اللہ کی اطاعت کی اس میں جو اس نے اس پر واجب کیا امر اور نہی سے۔ اور یہ اللہ کا ہم پر کرم ہے، اور ہمارے غافل لوگ اس سے واقف نہیں ہیں۔\n\n(اس باب کا ایک اور مسئلہ)\n\n### [حق (الحق) کو نہ اوپر نے نیچے سے مقید کیا اور نہ نیچے نے اوپر سے]\n\nفرشتوں اور تمام مخلوق کو سجدہ کرنے کا حکم صرف اس لیے دیا گیا اور اس کے ساتھ قربت کو شامل کیا گیا، فرمایا:\n**وَاسْجُدْ وَاقْتَرِبْ**\n(اور سجدہ کرو اور قریب ہو جاؤ)۔\nاور نبی صلی اللہ علیہ وسلم نے فرمایا: \"بندہ اپنے رب سے سب سے زیادہ قریب سجدے کی حالت میں ہوتا ہے۔\"\n\nتاکہ وہ جان لیں کہ حق (الحق) کی نسبت اوپر کی طرف، اس کے قول:\n**وَهُوَ الْقاهِرُ فَوْقَ عِبادِهِ**\n(اور وہ اپنے بندوں پر غالب ہے)۔\nاور:\n**يَخافُونَ رَبَّهُمْ مِنْ فَوْقِهِمْ**\n(وہ اپنے رب سے ڈرتے ہیں جو ان کے اوپر ہے)۔\nجیسی ہے، ویسی ہی نسبت نیچے کی طرف بھی ہے۔ کیونکہ سجدہ اپنے چہرے کے ساتھ نیچے کی طلب ہے، جیسا کہ قیام اوپر کی طلب ہے جب وہ دعا کے ساتھ اپنا چہرہ اور ہاتھ اٹھاتا ہے۔ اور اللہ نے سجدے کو اللہ سے قربت کی حالت بنا دیا۔ پس اس نے سبحانہ کو نہ اوپر نے نیچے سے مقید کیا اور نہ نیچے نے اوپر سے، کیونکہ وہ اوپر اور نیچے کا خالق ہے۔ جیسا کہ اس نے اسے عرش پر استواء (مستوی ہونے) سے آسمان دنیا پر نزول (اترنے) سے مقید نہیں کیا، اور نہ ہی نزول سے عرش پر استواء سے مقید کیا۔ جیسا کہ اس نے سبحانہ کو استواء اور نزول سے مقید نہیں کیا کہ وہ ہمارے ساتھ نہ ہو جہاں کہیں بھی ہم ہوں، جیسا کہ فرمایا:\n**وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ**\n(اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)۔\nاس معنی کے ساتھ جو اس کے لائق ہے اور اس طریقے پر جو اس نے ارادہ کیا، جیسا کہ\n\nاس نے یہ بھی فرمایا: \"میری زمین اور میرا آسمان میری وسعت میں نہیں آئے، لیکن میرے مومن بندے کا دل میری وسعت میں آ گیا۔\"\n\nجیسا کہ ہود علیہ السلام نے اس کے بارے میں فرمایا:\n**ما مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِناصِيَتِها**\n(کوئی جاندار نہیں مگر وہ اس کی پیشانی کو پکڑے ہوئے ہے)۔\nاور اللہ تعالیٰ نے میت کے حق میں بھی فرمایا:\n**وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ وَلكِنْ لا تُبْصِرُونَ**\n(اور ہم تم سے زیادہ اس کے قریب ہیں لیکن تم دیکھتے نہیں ہو)۔\nپس اس نے قربت کو میت کی طرف منسوب کیا۔ اور یہ بھی فرمایا:\n**وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ**\n(اور ہم اس (انسان) کی شہ رگ سے بھی زیادہ قریب ہیں)۔\nاس کے اس قول کے ساتھ کہ:\n**لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ**\n(اس جیسی کوئی چیز نہیں اور وہ سننے والا، دیکھنے والا ہے)۔\n\n(اس باب کا ایک دوری مسئلہ اور اس کی صورت یہ ہے)\n\nہم نے یہ صرف اس لیے کہا کہ شرائع (شریعتیں) مختلف ہوئیں کیونکہ نسب الٰہیہ (النسب الإلٰہیۃ) مختلف ہیں۔ کیونکہ اگر کسی شرع میں کسی چیز کو حلال کرنے کی نسبت الٰہیہ وہی ہوتی جو اسی چیز کو شرع میں حرام کرنے کی نسبت ہوتی، تو حکم کا بدلنا صحیح نہ ہوتا، حالانکہ حکم کا بدلنا ثابت ہے۔ اور یہ قول بھی صحیح نہ ہوتا:\n**لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً وَمِنْهاجاً**\n(تم میں سے ہر ایک کے لیے ہم نے ایک شریعت اور ایک طریقہ مقرر کیا)۔\nاور یہ ثابت ہے کہ ہر امت کے لیے ایک شریعت اور ایک طریقہ تھا جو اس کا نبی اور رسول لایا، پس اس نے منسوخ کیا اور ثابت کیا۔ پس ہمیں قطعی طور پر معلوم ہوا کہ اللہ تعالیٰ کی اس چیز میں نسبت جو اس نے محمد صلی اللہ علیہ وسلم کے لیے مشروع کی، وہ کسی دوسرے نبی کی طرف اس کی نسبت سے مختلف ہے، ورنہ اگر نسبت ہر لحاظ سے ایک ہوتی، اور وہی خاص تشریع کا موجب ہوتی، تو شرع بھی ہر لحاظ سے ایک ہوتی۔\n\n### [نسب الٰہیہ صرف احوال کے اختلاف کی وجہ سے مختلف ہوئیں]\n\nاگر کہا جائے کہ نسب الٰہیہ کیوں مختلف ہوئیں؟ ہم کہیں گے: احوال کے اختلاف کی وجہ سے۔ پس جس کی حالت بیماری کی ہو، وہ پکارتا ہے: \"یا معافی (اے عافیت دینے والے) اور یا شافی (اے شفا دینے والے)\"۔ اور جس کی حالت بھوک کی ہو، وہ کہتا ہے: \"یا رزاق (اے رزق دینے والے)\"۔ اور جس کی حالت ڈوبنے کی ہو، وہ کہتا ہے: \"یا مغیث (اے مدد کرنے والے)\"۔ پس احوال کے اختلاف کی وجہ سے نسب مختلف ہوئیں۔ اور یہی اس کا قول ہے:\n**كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ**\n(وہ ہر دن ایک نئی شان میں ہے)۔\nاور:\n**سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ**\n(عنقریب ہم تمہاری طرف متوجہ ہوں گے، اے دونوں بوجھو!)۔\nاور نبی صلی اللہ علیہ وسلم کا قول جب انہوں نے اپنے رب کی صفت بیان کی کہ: \"اس کے ہاتھ میں میزان ہے، وہ جھکاتا ہے اور اٹھاتا ہے۔\"\n\nپس وزن کی حالت کی وجہ سے اس میں \"الخافض\" (جھکانے والا) اور \"الرافع\" (اٹھانے والا) کہا گیا۔ پس یہ نسب ظاہر ہوئیں۔ پس مخلوق کے احوال کے اختلاف میں بھی یہی ہے۔\n\n### [احوال صرف زمان (وقت) کے اختلاف کی وجہ سے مختلف ہوئے]\n\nاور ہمارا قول کہ احوال صرف زمان (الزمان) کے اختلاف کی وجہ سے مختلف ہوئے، کیونکہ مخلوق کے احوال کے اختلاف کا سبب ان پر زمانوں کا اختلاف ہے۔ پس ان کی حالت موسم بہار میں ان کی حالت سے مختلف ہوتی ہے جو موسم گرما میں ہوتی ہے، اور موسم گرما میں ان کی حالت موسم خزاں میں ان کی حالت سے مختلف ہوتی ہے، اور موسم خزاں میں ان کی حالت موسم سرما میں ان کی حالت سے مختلف ہوتی ہے، اور موسم سرما میں ان کی حالت موسم بہار میں ان کی حالت سے مختلف ہوتی ہے۔ بعض علماء اس بارے میں جو زمان اجسام طبیعیہ میں کرتے ہیں، کہتے ہیں: موسم بہار کی ہوا کے سامنے آؤ، کیونکہ وہ تمہارے جسموں میں وہی کرتی ہے جو تمہارے درختوں میں کرتی ہے، اور موسم خزاں کی ہوا سے بچو، کیونکہ وہ تمہارے جسموں میں وہی کرتی ہے جو تمہارے درختوں میں کرتی ہے۔ اور اللہ تعالیٰ نے اس بات پر نص بیان کی ہے کہ ہم زمین کی نباتات میں سے ہیں، فرمایا:\n**وَالله أَنْبَتَكُمْ مِنَ الْأَرْضِ نَباتاً**\n(اور اللہ نے تمہیں زمین سے ایک خاص اگانا اگایا)۔\nاس نے ارادہ کیا کہ تم نبات کی طرح اگے، کیونکہ \"أنبتکم\" (اس نے تمہیں اگایا) کا مصدر \"إنباتا\" (اگانا) ہی ہے۔ جیسا کہ اس نے تکوین (پیدا کرنے) کی نسبت خود مامور بہ کی طرف کی، فرمایا:\n**إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ**\n(ہم جب کسی چیز کا ارادہ کرتے ہیں تو ہمارا کہنا صرف یہ ہوتا ہے کہ ہم اسے کہتے ہیں: ہو جا، تو وہ ہو جاتی ہے)۔\nپس اس نے تکوین کو اس کی طرف منسوب کیا۔ اسی طرح اس نے نبات کے ظہور کی نسبت نبات کی طرف کی۔ پس سمجھ لو۔ اسی لیے ہم نے کہا کہ احوال صرف زمانوں کے اختلاف کی وجہ سے مختلف ہوئے۔\n\n### [زمان صرف حرکات کے اختلاف کی وجہ سے مختلف ہوئے]\n\nاور جہاں تک ہمارے اس قول کا تعلق ہے کہ زمان صرف حرکات (الحرکات) کے اختلاف کی وجہ سے مختلف ہوئے، تو میری مراد حرکات سے فلکی حرکات (الحرکات الفلکیۃ) ہیں۔ کیونکہ فلکی حرکات کے اختلاف سے ہی رات اور دن کا زمان پیدا ہوا، اور سال، مہینے اور موسم متعین ہوئے، جنہیں زمان (الأزمان) سے تعبیر کیا جاتا ہے۔ اور ہمارا قول کہ حرکات توجہات (التوجہات) کے اختلاف کی وجہ سے مختلف ہوئیں، اس سے میری مراد ان پر حق (الحق) کا ایجاد کے ساتھ توجہ کرنا ہے، اس کے قول کی وجہ سے:\n**إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ**\n(ہم جب کسی چیز کا ارادہ کرتے ہیں تو ہمارا کہنا صرف یہ ہوتا ہے)۔\nاگر ان پر توجہ ایک ہوتی تو حرکات مختلف نہ ہوتیں، حالانکہ وہ مختلف ہیں۔ پس یہ اس بات پر دلالت کرتا ہے کہ وہ توجہ جس نے چاند کو اس کے فلک میں حرکت دی، وہ وہ توجہ نہیں ہے جس نے سورج کو یا دیگر کواکب اور افلاک کو حرکت دی۔ اور اگر ایسا نہ ہوتا تو سب میں تیزی یا سستی یکساں ہوتی۔ اللہ تعالیٰ نے فرمایا:\n**كُلٌّ فِي فَلَكٍ يَسْبَحُونَ**\n(ہر ایک اپنے اپنے مدار میں تیر رہا ہے)۔\nپس ہر حرکت کے لیے ایک الٰہی توجہ ہے، یعنی اس کے مرید (ارادہ کرنے والا) ہونے کا ایک خاص تعلق ہے۔\n\n### [توجہات صرف مقاصد کے اختلاف کی وجہ سے مختلف ہوئیں]\n\nاور ہمارا قول کہ توجہات صرف مقاصد (المقاصد) کے اختلاف کی وجہ سے مختلف ہوئیں، پس اگر قمری حرکت کا مقصد اس توجہ کے ساتھ وہی ہوتا جو شمسی حرکت کا مقصد اس توجہ کے ساتھ ہوتا، تو ایک اثر دوسرے اثر سے ممتاز نہ ہوتا، اور آثار بلا شک مختلف ہیں۔ پس مقاصد کے اختلاف کی وجہ سے توجہات مختلف ہیں۔ پس زید سے رضا مندی کے ساتھ اس کی توجہ، عمرو پر غضب کے ساتھ اس کی توجہ سے مختلف ہے۔ کیونکہ اس نے عمرو کو عذاب دینے کا قصد کیا اور زید کو نعمت دینے کا قصد کیا، پس مقاصد مختلف ہوئے۔\n\n### [مقاصد صرف تجلیات (ظہور الٰہی) کے اختلاف کی وجہ سے مختلف ہوئے]\n\nاور ہمارا قول کہ مقاصد صرف تجلیات (التجلیات) کے اختلاف کی وجہ سے مختلف ہوئے، کیونکہ اگر تجلیات تمام وجوہ سے ایک ہی صورت میں ہوتیں، تو ان کے لیے ایک ہی قصد کے سوا کوئی اور قصد صحیح نہ ہوتا، حالانکہ قصد کا اختلاف ثابت ہے۔ پس ہر خاص قصد کے لیے ایک خاص تجلی (التجلی) کا ہونا ضروری ہے جو دوسرے کی عین تجلی نہ ہو۔ کیونکہ وسعت الٰہیہ (الإتساع الإلٰہی) یہ عطا کرتی ہے کہ وجود میں کوئی چیز مکرر نہ ہو۔ اور یہی وہ بات ہے جس پر طائفہ (صوفیاء) نے اعتماد کیا ہے، اور لوگ نئے خلق (خلق جدید) کے لباس میں ہیں۔ شیخ ابو طالب مکی، صاحب قوت القلوب، اور اللہ عزوجل کے دیگر رجال کہتے ہیں کہ اللہ سبحانہ نے کبھی بھی ایک ہی صورت میں دو اشخاص پر تجلی نہیں کی، اور نہ ہی ایک ہی صورت میں دو بار۔ اور اسی لیے عالم میں آثار مختلف ہوئے، اور انہیں رضا اور غضب سے کنایہ کیا گیا۔\n\n### [تجلیات صرف شرائع کے اختلاف کی وجہ سے مختلف ہوئیں]\n\nاور ہمارا قول کہ تجلیات صرف شرائع (الشرائع) کے اختلاف کی وجہ سے مختلف ہوئیں، کیونکہ ہر شریعت اس سبحانہ تک پہنچنے کا ایک راستہ ہے، اور وہ مختلف ہیں۔ پس تجلیات کا مختلف ہونا ضروری ہے، جیسا کہ عطیات مختلف ہوتے ہیں۔ کیا تم نہیں دیکھتے کہ جب وہ عزوجل قیامت کے دن اس امت پر تجلی کرے گا، اور اس میں اس کے منافق بھی ہوں گے، اور شریعت میں ان کی نظر مختلف ہو چکی ہو گی، پس ہر مجتہد ایک خاص شرع پر ہو گا جو اللہ تک پہنچنے کا اس کا راستہ ہے۔ اور اسی لیے مذاہب مختلف ہوئے، اور ہر شرع ایک ہی شریعت میں ہے۔ اور اللہ نے ہمارے نزدیک رسول اللہ صلی اللہ علیہ وسلم کی زبان پر اس کی تصدیق کی ہے۔ پس تجلیات بلا شک مختلف ہوئیں۔ کیونکہ ہر طائفہ نے اللہ کے بارے میں ایک ایسا امر اعتقاد کیا ہے کہ اگر وہ اس کے خلاف میں ان پر تجلی کرے تو وہ اس کا انکار کر دیں گے۔ پس جب وہ اس علامت میں ان کے لیے تبدیل ہو کر آئے گا جو اس طائفہ نے اپنے نفس میں اللہ کے ساتھ مقرر کر رکھی ہے، تو وہ اس کا اقرار کریں گے۔ پس جب وہ اشعری پر اس کے مخالف کے عقد (عقیدہ) کی صورت میں تجلی کرے گا، اور مخالف پر اشعری کے اعتقاد کی صورت میں، تو دونوں میں سے ہر ایک اس کا انکار کر دے گا، جیسا کہ وارد ہوا ہے۔ اور تمام طوائف میں بھی یہی ہے۔ پس جب وہ ہر طائفہ پر اس کے اعتقاد کی صورت میں تجلی کرے گا، اور یہی وہ علامت ہے جسے مسلم نے اپنی صحیح میں رسول اللہ صلی اللہ علیہ وسلم سے ذکر کیا ہے، تو وہ اس کا اقرار کریں گے کہ وہ ان کا رب ہے، اور وہ وہی ہے، کوئی اور نہیں تھا۔ پس شرائع کے اختلاف کی وجہ سے تجلیات مختلف ہوئیں۔\n\n### [شرائع صرف نسب الٰہیہ کے اختلاف کی وجہ سے مختلف ہوئیں]\n\nاور ہمارا قول کہ شرائع صرف نسب الٰہیہ (النسب الإلٰہیۃ) کے اختلاف کی وجہ سے مختلف ہوئیں، یہ پہلے گزر چکا ہے اور دور (الدور) مکمل ہو گیا۔ پس ان مسائل میں سے تم جو بھی چیز لو، وہ اول، آخر اور وسط ہونے کے لیے موزوں ہے۔ اور اسی طرح ہر دوری امر کا ہر جزو فرض کے طور پر اولیت اور آخریت اور ان کے درمیان کو قبول کرتا ہے۔ اور ہم نے اس دوری شکل کی مثال تدبیرات الٰہیہ (التدبیرات الإلٰہیۃ) میں ذکر کی ہے، جو متقدم کے اس قول سے مشابہت رکھتی ہے جب اس نے کہا: عالم ایک باغ ہے جس کی باڑ سلطنت ہے، سلطنت ایک بادشاہ ہے جسے سنت (قانون) پردہ کرتی ہے، سنت ایک سیاست ہے جسے بادشاہ چلاتا ہے، بادشاہ ایک چرواہا ہے جسے فوج مدد دیتی ہے، فوج مددگار ہیں جنہیں مال کفالت کرتا ہے، مال ایک رزق ہے جسے رعایا جمع کرتی ہے، رعایا غلام ہیں جنہیں عدل عبادت کراتا ہے، عدل ایک مانوس چیز ہے جس میں عالم کی اصلاح ہے، عالم ایک باغ ہے۔ اور دور مکمل ہو گیا۔ اور علتوں اور اسباب کی طرف اشارہ کرنے کے لیے یہ مقدار کافی ہے، طوالت کے خوف سے، کیونکہ یہ باب بہت وسیع ہے، چونکہ سارا عالم اسباب اور مسببات، اور علتوں اور معلولات کے ذریعے ایک دوسرے سے جڑا ہوا ہے۔\n**وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ**\n(اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔\nپچیسواں حصہ ختم ہوا۔",
    "fa": "(باب چهل و هشتم در معرفت اینکه چرا چیزی چنین است به خاطر چیز دیگر، و آن اثبات علت و سبب است)\n\nاینکه چیزی چنین است به خاطر چیز دیگر، دانشی است که صاحب مرتبه حکم (حکمت) آن را به دست آورده است.\nوجود خالق ما را تعلیل (علت‌یابی) مکن، که در این صورت سیر شما به سوی نیستی (عدم) خواهد بود.\nو اوست اولی که در حدوث و قدم، آغازی برای او نیست.\n\n### [سبب ایجاب‌کننده وجود عالم]\n\nنخستین مسئله این باب این است که سبب ایجاب‌کننده وجود عالم چیست تا گفته شود عالم به خاطر فلان چیز موجود شد. و آن امری که صحت وجود عالم بر آن متوقف است، یا باید علت باشد که معلول خود را به ذات خود طلب می‌کند، و اگر چنین است، آیا صحیح است که معلول دو علت یا بیشتر داشته باشد یا صحیح نیست؟ این بحث در نظر عقلی است نه در امور وضعی (قراردادی). و اگر علل متعدد باشند، آیا تعدد آن‌ها به اعیان وجودی بازمی‌گردد یا نسبت‌هایی برای یک امر واحد هستند؟ و اموری هستند که صحت وجودشان بر شرط یا شروطی که مقدم بر آن‌هاست، متوقف است. و همه این‌ها را نام سبب در بر می‌گیرد. شرط حکمی دارد و علت حکمی. آیا عالم در نیازمندی خود به سبب ایجاب‌کننده وجودش، نیازمندی معلول به علت است یا نیازمندی مشروط به شرط؟ و هر کدام که باشد، دیگری نخواهد بود؛ زیرا علت، معلول را به ذات خود طلب می‌کند، در حالی که شرط، مشروط را به ذات خود طلب نمی‌کند. پس علم مشروط به حیات است، اما از وجود حیات، وجود علم لازم نمی‌آید. و عالم بودن عالم نیز چنین نیست؛ زیرا علم، علت در عالم بودن عالم است. پس اگر علم برداشته شود، عالم بودن او نیز برداشته می‌شود. از این جهت، شبیه شرط است؛ زیرا اگر حیات برداشته شود، علم برداشته می‌شود، و اگر عالم بودن او برداشته شود، علم برداشته می‌شود. پس از شرط متمایز می‌شود، زیرا اگر علم برداشته شود، برداشته شدن حیات لازم نمی‌آید. پس این دو مرتبه معقول (قابل درک عقلی) هستند که از هم متمایز شده‌اند؛ یکی علت نامیده می‌شود و دیگری شرط.\n\n### [نسبت عالم در وجودش به حق]\n\nپس آیا نسبت عالم در وجودش به حق (الحق) نسبت معلول است یا نسبت مشروط؟ محال است که نسبت مشروط باشد، بر اساس هر دو مذهب؛ زیرا ما در مورد مشروط نمی‌گوییم که حتماً باید باشد، بلکه می‌گوییم اگر باشد، وجود شرط تصحیح‌کننده وجودش ضروری است. و در مورد عالم، بر مذهب متکلم اشعری، می‌گوییم که وجودش ضروری است، زیرا علم (الهی) به وجود آن سبقت گرفته است و وقوع خلاف معلوم محال است، و این در مورد مشروط گفته نمی‌شود. و بر مذهب مخالفان که حکما هستند، وجودش ضروری است، زیرا خداوند وجود عالم را به ذات خود اقتضا کرده است، پس تا زمانی که به ذات خود موصوف است، وجود عالم ضروری است، برخلاف شرط. بنابراین، تفاوتی بین متکلم اشعری و حکیم در وجوب وجود عالم به واسطه غیر (خداوند) نیست. پس بگذارید تعلق علم (الهی) به وجود عالم در ازل را علت بنامیم، همان‌طور که حکیم، ذات (الذات) را علت می‌نامد، و تفاوتی نیست. و لازم نیست که معلول در تمام مراتب، ملازم علت خود باشد. علت بدون شک بر معلول خود به مرتبه مقدم است، خواه آن سبقت، سبقت علم باشد یا ذات حق (الحق). و بین واجب الوجود لنفسه و ممکن، فاصله زمانی یا تقدیر زمانی قابل تصور نیست؛ زیرا سخن ما درباره اولین موجود ممکن است و زمان از جمله ممکنات است. اگر زمان امری وجودی باشد، حکم آن مانند سایر احکام ممکنات است. و اگر امری وجودی نباشد و نسبتی باشد، آن نسبت با حدوث موجود معلول، حدوثی عقلی می‌یابد نه حدوثی وجودی. و چون بین حق (الحق) و خلق، فاصله زمانی قابل تصور نیست، جز مرتبه (رتبه) باقی نمی‌ماند. پس هرگز صحیح نیست که خلق در مرتبه حق باشد، همان‌طور که صحیح نیست معلول از آن جهت که معلول از علت است، در مرتبه علت باشد. پس آنچه متکلم در گمان خود از آن گریخته و حکیم قائل به علت را به خاطر آن سرزنش کرده است، در سبقت علم (الهی) به وجود معلوم، بر او لازم می‌آید؛ زیرا سبقت علم، وجود معلوم را به ذات خود و به ناچار طلب می‌کند و فاصله مقدری بین آن دو قابل تصور نیست. این نکته‌ای بود که شما را بر برخی از آنچه در این مسئله ضروری است، آگاه ساختیم.\n\n### [عالم همیشه ممکن است و حق همیشه واجب]\n\nپس عالم هرگز از مرتبه امکان خود خارج نشده است، چه معدوم باشد و چه موجود. و حق تعالی هرگز از مرتبه وجوب وجود لنفسه (وجوب ذاتی) خود خارج نشده است، چه عالم باشد و چه نباشد. اگر عالم وارد وجوب ذاتی می‌شد، قدمت عالم و ملازمه آن در این مرتبه با واجب الوجود لنفسه که خداوند است، لازم می‌آمد. اما عالم وارد نشده، بلکه بر امکان و نیازمندی خود به موجِد و سبب خود که خداوند تعالی است، باقی مانده است. پس فاصله معقولی بین حق (الحق) و خلق باقی نمی‌ماند، مگر تمایز به صفت ذاتی (نفسية). پس با این تمایز، بین حق و خلق فرق می‌گذاریم؛ پس بفهم.\n\n### [نفی تعدد علت تامه برای معلولات عقلی]\n\nو اما در مورد سخن ما که آیا در عقل برای امر معلول دو علت وجود دارد؟ صحیح نیست که معلول عقلی دو علت داشته باشد، بلکه اگر معلول باشد، از یک علت واحد است؛ زیرا فایده علت جز این نیست که در معلول اثری داشته باشد. اما اگر اتفاق افتد که از شرط‌های معلول این باشد که بر صفتی باشد که به واسطه آن قبول کند معلول این علت باشد، و ممکن نیست که این (صفت) علت برای خود آن معلول باشد، مگر اینکه آن معلول به واسطه آن صفت ذاتی (نفسية) باشد، پس وجود آن صفت ضروری است. و از این امر لازم نمی‌آید که آن صفت ذاتی، علت برای آن باشد؛ زیرا آن صفت، صفت ذاتی است و شیء نمی‌تواند علت برای خودش باشد، چرا که منجر به این می‌شود که علت، عین معلول باشد و در نتیجه شیء به مرتبه بر خودش مقدم شود، و این محال است. پس علت بودن شیء برای خودش محال است. اگر عالم در ذات خود بر صفتی نبود که قبول اتصاف به وجود و عدم را به طور مساوی داشته باشد، صحیح نبود که معلول علت خود باشد که یکی از دو امر جایز را (وجود یا عدم) با توجه به ذاتش، ترجیح می‌دهد؛ زیرا محال، صفت ایجاد را نمی‌پذیرد، پس حق (الحق) علت آن نخواهد بود. پس باطل است که ممکن بودن آن، علت برای آن باشد. و باطل است که شیء دو علت داشته باشد؛ زیرا اثر علت در معلول، همان وجود آن است. پس حکم علت دیگر در آن چیست؟ اگر وجود آن باشد، که از یکی از آن دو حاصل شده است، پس برای دیگری اثری باقی نمی‌ماند. اگر گفته شود که معلول از اجتماع آن دو حاصل شده است، پس از هر دوی آن‌ها بوده است. می‌گوییم: پس هر یک از آن دو اگر به تنهایی باشد، علت نخواهد بود و نام علیت بر آن صحیح نیست، در حالی که صحیح است. پس باطل است که علت بودن آن متوقف بر امر دیگری باشد. اگر بگوید: چه مانعی دارد که علت به واسطه اجتماع باشد؟ می‌گوییم: شیء تنها برای این معلول از آن، علت برای خودش است نه برای غیر، پس معلول آن غیر خواهد بود، زیرا آن غیر، علیت را به آن بخشیده است، و هر امر اکتسابی، صفت ذاتی (نفسية) نیست. و اگر بگوییم اجتماع آن دو علت است، آن اجتماع خالی از این نیست که امری زائد بر نفس هر یک از آن دو باشد یا عین خود آن دو باشد. جایز نیست که عین آن دو باشد، زیرا ما عین هر یک از آن دو را درک می‌کنیم، اما اجتماع را درک نمی‌کنیم. پس ناگزیر باید زائد باشد. و آن امر زائد یا باید وجود باشد یا عدم، یا نه وجود باشد و نه عدم، یا وجود و عدم با هم. این قسم چهارم به بداهت محال است. و محال است که وجود باشد، به دلیل تسلسل لازم که از ملزوم آن لازم می‌آید، یا دور، که در این صورت علت برای کسی خواهد بود که خود معلول اوست، و این محال است. و محال است که عدم باشد، زیرا عدم نفی محض است و نفی محض به اثر متصف نمی‌شود. و محال است که نه وجود باشد و نه عدم، مانند نسبت‌ها، زیرا نسبت‌ها در هستی (الوجود) حقیقتی ندارند، بلکه امور اضافی هستند که حادث می‌شوند، و آنچه حادث می‌شود، علت برای چیزی که از آن حادث شده است، نخواهد بود. پس باطل است که شیء در عقل دو علت داشته باشد.\n\n### [جواز تعدد علت در معلولات وضعی (قراردادی)]\n\nاما در امور وضعی (قراردادی)، شرع ممکن است اموری را در نظر بگیرد که مجموعاً سبب در ترتیب حکم باشند، و این ممنوع نیست. پس چون این را دانستی، این قوی‌ترین دلیل بر توحید خداوند تعالی است که او علت در وجود عالم است، جز اینکه اطلاق این لفظ (علت) بر او در شرع وارد نشده است، پس ما آن را بر او اطلاق نمی‌کنیم و او را به آن نمی‌خوانیم. این توحید ذاتی است که با آن، شریک بدون شک منتفی می‌شود. خداوند عز و جل می‌فرماید: لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا (اگر در آسمان و زمین خدایانی جز الله وجود داشت، قطعاً تباه می‌شدند). و معنای این آیه این است که موجود نمی‌شدند، یعنی عالم علوی که آسمان است و عالم سفلی که زمین است. پس این مسئله را در ذهن خود محقق ساز، زیرا در نفی شریک و نفی تحدید (محدودیت) از خداوند تعالی سودمند است. پس ذات او حدی ندارد و در مُلک او شریکی نیست. لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ (هیچ معبودی جز او نیست، که عزیز و حکیم است).\n\n### [عالم معلول علم خداوند است نه معلول عین ذات خداوند]\n\nآنچه را که تعلیل کردند، تنها به خاطر این بود که\nآن معلول علم اوست، نه معلول عین ذات او.\nپس به آنچه تصریح کردم بنگرید، که آن از راز آشکار اوست.\nامر خود را با دلیل از غیر خود جدا کن.\nدر راز محققی که من راز یاری او هستم.\nپس ردای (جامه) طلب عین صدای او را پوشیدم.\n\n(مسئله‌ای دیگر)\n\n### [رابطه وجودی بین حق و خلق]\n\nاینکه چیزی چنین است به خاطر چیز دیگر، اینکه عالم به شقی (بدبخت) و سعید (خوشبخت) تقسیم شد، به خاطر اسماء الهی است؛ زیرا مرتبه الوهیت به ذات خود اقتضا می‌کند که در عالم بلا و عافیت باشد. و دوام هیچ یک از این‌ها لازم نمی‌آید، مگر اینکه خداوند بخواهد. خداوند بود و عالمی نبود، در حالی که به این اسماء نامیده می‌شد. پس امر در این مورد مانند شرط و مشروط است، نه مانند علت و معلول. مشروط صحیح نمی‌شود مگر اینکه وجود شرط صحیح باشد. و ممکن است شرط وجود داشته باشد، هرچند مشروط واقع نشود. پس چون بلا و عافیت را دیدیم، گفتیم که این دو ناگزیر شرطی دارند، و آن شرط، الوهیت حق (الحق) است که به نام‌های مبتلاکننده (المبلي)، عذاب‌دهنده (المعذب) و نعمت‌بخش (المنعم) نامیده می‌شود. و همان‌طور که هر ممکن، پذیرای یکی از دو حکم (یعنی دو ضد) است، پذیرای انتفای یکی از دو ضد نیز هست. پس عالم تماماً ممکن است، و جایز است که یکی از دو حکم از آن منتفی شود. پس خلود در سرای آخرت، نه در عذاب و نه در نعمت، لازم نمی‌آید، بلکه همه آن ممکن است.\n\n### [خلود در سرای آخرت، در عذاب و در نعمت]\n\nپس اگر خبر الهی که مفید علم است، با نصّی که تأویل نمی‌پذیرد، مبنی بر خلود عالم در یکی از دو حکم (عذاب یا نعمت) یا وقوع هر حکم در جزء معینی از عالم و خلود آن جزء در آن تا بی‌نهایت وارد شود، آن را می‌پذیریم و به آن قائل می‌شویم. و آنچه از شارع وارد شده است که عالمانی که در جهنم هستند و اهل آنند و از آن خارج نمی‌شوند، بقایشان در آن به دلیل وجود عذاب است. پس همان‌طور که حکم عذاب از ممکن خاصی که اهل بهشت هستند برداشته شد، همچنین جایز است که وجود عذاب از اهل آتش برداشته شود، با وجود اینکه در آتش هستند، به دلیل قول خداوند: وما هُمْ بِخارِجِينَ من النَّارِ (و آنان از آتش خارج‌شدنی نیستند). و فرمود: «سبقت رحمتي غضبي» (رحمت من بر غضبم پیشی گرفته است).\nو از وجود شرط، وجود مشروط لازم نمی‌آید. پس خداوند با تمام اسماء خود، اله است، در حالی که ممکن است در عالم عذاب و دردی نباشد؛ زیرا برداشته شدن آن از ممکن خاصی، اولی‌تر از برداشته شدن آن از همه ممکنات نیست. پس از طریق عقل، دلیلی بر وجود دائمی عذاب یا غیر آن در دست ما باقی نمی‌ماند. پس چاره‌ای جز نصوص متواتر یا کشف (الکشف) که شبهه‌ای در آن راه ندارد، نیست. اگر نص صریح یا کشف واضح از صادق (پیامبر) وارد شود، عقل را یارای رد آن نیست.\n\n(مسئله‌ای دیگر از این باب)\n\n### [خلق آدم بر صورت و با دو دست]\n\nصورت (الصورة) برای آدم صحیح شد، به دلیل خلق او با دو دست (بالیدین). پس حقایق تمام عالم در او جمع شد. و عالم، اسماء الهی را طلب می‌کند، پس اسماء الهی در او جمع شد. و به همین دلیل، آدم (علیه السلام) به علم تمام اسماء که توجه به عالم دارند، اختصاص یافت. و خداوند آن علم را به فرشتگان که عالم اعلی و شریف‌تر هستند، نداده بود. خداوند عز و جل می‌فرماید: وعَلَّمَ آدَمَ الْأَسْماءَ كُلَّها (و خداوند همه اسماء را به آدم آموخت) و نگفت بعضی از آن‌ها را. و فرمود: عَرَضَهُمْ (آن‌ها را عرضه کرد) و نگفت عرضها (آن‌ها را عرضه کرد)، پس دلالت بر این دارد که مسمّیان (صاحبان نام‌ها) را عرضه کرد نه خود نام‌ها را. و رسول خدا (صلی الله علیه و سلم) فرمود: «اللهم إنی أسألك بكل اسم سميت به نفسك أو علمته أحدا من خلقك أو استأثرت به في علم غيبك» (بار خدایا، من از تو می‌خواهم به حق هر نامی که خود را بدان نامیدی، یا آن را به یکی از مخلوقاتت آموختی، یا آن را در علم غیب خود مخصوص خویش ساختی).\nاگر این دعا را قبل از نزول سوره بقره خوانده باشد، نزد کسانی که می‌گویند اسماء در اینجا همان اسماء الهی هستند، تعارضی بین خبر و آیه نیست؛ زیرا پیامبر (صلی الله علیه و سلم) به آنچه خداوند آدم را بر فرشتگان به آن اختصاص داده بود، علم نداشت، چنانکه فرمود: ما أَدْرِي ما يُفْعَلُ بِي ولا بِكُمْ إِنْ أَتَّبِعُ إِلَّا ما يُوحى‏ به إِلَيَّ (نمی‌دانم با من و شما چه خواهد شد، من جز آنچه به من وحی می‌شود، پیروی نمی‌کنم). و اگر این دعا را بعد از نزول سوره بقره خوانده باشد، منظور او از «همه آن‌ها» اسماء الهی است که آثار را در عالم طلب می‌کنند و آنچه که به واسطه آن از اسماء تنزیه و تقدیس عبادت می‌شود. و همچنین\nقول پیامبر (صلی الله علیه و سلم) در حدیث شفاعت: «فأحمد ربي بمحامد يعلمنيها الله لا أعلمها الآن» (پس پروردگارم را با ستایش‌هایی ستایش می‌کنم که خداوند آن‌ها را به من می‌آموزد و اکنون آن‌ها را نمی‌دانم).\nو قول او در حدیث ضربه: «فعلمت علم الأولين والآخرين» (پس علم اولین و آخرین را دانستم).\nو از علم اولین، علم به اسمائی است که خداوند به آدم آموخت، و شاید از علم آخرین، علم به این ستایش‌هایی باشد که در روز قیامت پروردگارش را با آن‌ها ستایش می‌کند.\n\n(مسئله‌ای دیگر از این باب)\n\n### [خلافت الهی]\n\nخلافت برای آدم (علیه السلام) بود نه برای سایر اجناس عالم، به دلیل اینکه خداوند تعالی او را بر صورت (الصورة) خود آفرید. پس خلیفه ناگزیر باید در آنچه بر آن خلیفه شده است، به صورت مستخلف (کسی که او را خلیفه کرده) ظاهر شود، وگرنه خلیفه او در میان آن‌ها نیست. پس امر و نهی را به او داد و او را خلیفه نامید و بیعت را برای او به شنیدن و اطاعت در خوشی و ناخوشی، سختی و آسانی قرار داد. و خداوند سبحان بندگانش را به اطاعت از خدا و رسولش و اطاعت از اولی الامرشان امر کرد. پس رسول خدا (صلی الله علیه و سلم) رسالت و خلافت را جمع کرد، مانند داوود (علیه السلام)؛ زیرا خداوند بر خلافت او از جانب خود تصریح کرد به قول تعالی: فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ (پس میان مردم به حق حکم کن). و خلافت آدم (علیه السلام) را به صورت مجمل بیان کرد.\n\n### [فرق بین رسول و خلیفه]\n\nو هر رسولی خلیفه نیست. پس کسی که امر و نهی کرد و مجازات نمود و عفو کرد و خداوند به اطاعت از او امر کرد و این صفات برای او جمع شد، خلیفه بود. و کسی که امر و نهی خداوند را ابلاغ کرد و از جانب خود اجازه امر و نهی از خداوند تعالی نداشت، او رسولی است که رسالات پروردگارش را ابلاغ می‌کند. و با این بیان، فرق بین رسول و خلیفه برای تو آشکار شد.\n\n### [اطاعت از خدا، اطاعت از رسول و اولی الامر]\n\nو به همین دلیل، در قول خداوند تعالی، الف و لام (ال) آمده است: من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله (هر کس از رسول اطاعت کند، قطعاً از خدا اطاعت کرده است). و خداوند عز و جل فرمود: يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا الله (ای کسانی که ایمان آورده‌اید، از خدا اطاعت کنید)، یعنی در آنچه به زبان رسولش (صلی الله علیه و سلم) به شما امر کرده است، از جمله آنچه پیامبر (صلی الله علیه و سلم) در مورد آن فرمود: «إِنَّ الله يَأْمُرُكُمْ» (همانا خداوند شما را امر می‌کند)، و آن هر امری است که در کتاب خدا آمده است. سپس فرمود: وأَطِيعُوا الرَّسُولَ (و از رسول اطاعت کنید). پس امر اطاعت از خدا را از اطاعت از رسولش (صلی الله علیه و سلم) جدا کرد. اگر منظور از آن، تنها ابلاغ امر خدا به ما بود، فایده زائدی در کار نبود. پس ناگزیر باید مرتبه امر و نهی را به او واگذار کرده باشد تا امر و نهی کند. پس ما به امر خداوند، مأمور به اطاعت از رسول خدا (صلی الله علیه و سلم) هستیم. و خداوند تعالی فرمود: من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله (هر کس از رسول اطاعت کند، قطعاً از خدا اطاعت کرده است). و اطاعت ما از او در آن چیزی است که پیامبر (صلی الله علیه و سلم) به آن امر و نهی کرده است و نگفته که آن از جانب خداست تا قرآن باشد. خداوند عز و جل فرمود: وما آتاكُمُ الرَّسُولُ فَخُذُوهُ وما نَهاكُمْ عَنْهُ فَانْتَهُوا (و آنچه را رسول به شما داد، بگیرید و از آنچه شما را نهی کرد، بازایستید). پس نهی را به پیامبر (صلی الله علیه و سلم) نسبت داد. و الف و لام (ال) را در «الرسول» آورد و منظور از آن، تعریف و عهد است، یعنی رسولی که ما او را خلیفه خود قرار دادیم، پس برای او قرار دادیم که علاوه بر ابلاغ امر و نهی ما به بندگانمان، امر و نهی کند. سپس در همان آیه فرمود: وأُولِي الْأَمْرِ مِنْكُمْ (و صاحبان امر از خودتان)، یعنی اگر خلیفه‌ای از جانب رسول من بر شما ولایت یافت یا شما خودتان او را طبق آنچه برایتان تشریع شده است، ولی امر قرار دادید، پس بشنوید و اطاعت کنید، حتی اگر برده‌ای حبشی با اعضای قطع شده باشد؛ زیرا در اطاعت شما از او، اطاعت از رسول خدا (صلی الله علیه و سلم) است. و به همین دلیل، در مورد اولی الامر، «أطیعوا» را تکرار نکرد و به قول خود «أَطِيعُوا الرَّسُولَ» اکتفا کرد، اما به قول خود «أَطِيعُوا الله» از «أَطِيعُوا الرَّسُولَ» اکتفا نکرد. پس به دلیل اینکه خداوند تعالی لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (چیزی مانند او نیست)، تفکیک کرد و سخن را با «وأَطِيعُوا الرَّسُولَ» از سر گرفت.\n\n### [اولی الامر حق تشریع شرایع را ندارند؛ این تنها برای رسولان خداست]\n\nپس این دلیل بر آن است که خداوند تعالی برای پیامبر (صلی الله علیه و سلم) تشریع کرده است که امر و نهی کند، و اولی الامر حق تشریع شریعت را ندارند، بلکه امر و نهی آن‌ها در مورد چیزی است که برای آن‌ها و ما مباح است. پس اگر ما را به مباحی امر کردند یا از مباحی نهی کردند و ما در آن از آن‌ها اطاعت کردیم، در آن پاداش کسی را می‌بریم که از خداوند در آنچه بر او واجب کرده است، از امر و نهی، اطاعت کرده است. و این از کرم خداوند نسبت به ماست و اهل غفلت از ما این را درک نمی‌کنند.\n\n(مسئله‌ای دیگر از این باب)\n\n### [حق (الحق) را نه بالا از پایین محدود کرد و نه پایین از بالا]\n\nملائکه و همه خلق به سجده امر شدند و قرب (القربة) همراه آن قرار داده شد، پس فرمود: واسْجُدْ واقْتَرِبْ (و سجده کن و نزدیک شو). و پیامبر (صلی الله علیه و سلم) فرمود: «أقرب ما يكون العبد من الله في سجوده» (نزدیک‌ترین حالتی که بنده به خداوند دارد، در سجده اوست).\nتا بدانند که حق (الحق) در نسبت بالا (فوق) به او، از قولش: وهُوَ الْقاهِرُ فَوْقَ عِبادِهِ (و اوست چیره بر بندگانش) و يَخافُونَ رَبَّهُمْ من فَوْقِهِمْ (و از پروردگارشان که بالای سر آن‌هاست می‌ترسند)، مانند نسبت پایین (تحت) به اوست؛ زیرا سجده طلب پستی با صورت است، همان‌طور که قیام طلب بلندی است، هنگامی که صورت و دستانش را به دعا بلند می‌کند. و خداوند سجده را حالت قرب به خود قرار داد. پس سبحانه، بالا را از پایین و پایین را از بالا محدود نکرد؛ زیرا او خالق بالا و پایین است. همان‌طور که استواء بر عرش، او را از نزول به آسمان دنیا محدود نکرد، و نزول به آسمان دنیا، او را از استواء بر عرش محدود نکرد. همان‌طور که سبحانه، استواء و نزول را از اینکه با ما باشد، هر کجا که باشیم، محدود نکرد، چنانکه تعالی فرمود: وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ (و او با شماست هر کجا که باشید)، به معنایی که شایسته اوست و بر وجهی که اراده کرده است.\nهمچنین فرمود: «ما وسعني أرضي ولا سمائي ووسعني قلب عبدي» (زمین و آسمانم مرا در بر نگرفت، اما قلب بنده مؤمنم مرا در بر گرفت).\nهمان‌طور که هود (علیه السلام) درباره او فرمود: ما من دَابَّةٍ إِلَّا هُوَ آخِذٌ بِناصِيَتِها (هیچ جنبنده‌ای نیست مگر اینکه او گیرنده مهار آن است). و خداوند تعالی در حق میت نیز فرمود: ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ (و ما به او از شما نزدیک‌تریم، ولی شما نمی‌بینید). پس قرب را به میت نسبت داد. و همچنین عز و جل فرمود: ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ (و ما به او از رگ گردن نزدیک‌تریم)، یعنی انسان، با وجود قولش: لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهُوَ السَّمِيعُ الْبَصِيرُ (چیزی مانند او نیست و او شنوای بیناست).\n\n(مسئله‌ای دورانی از این باب و صورت آن این است)\n\n### [اینکه گفتیم شرایع مختلف شدند، به دلیل اختلاف نسبت‌های الهی است]\n\nاینکه گفتیم شرایع مختلف شدند، به دلیل اختلاف نسبت‌های الهی است؛ زیرا اگر نسبت الهی برای حلال کردن امری در شرع، مانند نسبت برای حرام کردن همان امر در شرع بود، تغییر حکم صحیح نبود، در حالی که تغییر حکم ثابت شده است. و همچنین قول خداوند تعالی صحیح نبود: لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً (برای هر یک از شما شریعت و راهی قرار دادیم). و ثابت شده است که برای هر امتی شریعت و راهی است که پیامبر و رسولش آن را برایشان آورده است، پس نسخ کرد و اثبات نمود. پس به یقین دانستیم که نسبت خداوند تعالی در آنچه برای محمد (صلی الله علیه و سلم) تشریع کرده است، خلاف نسبت او به پیامبر دیگری است. وگرنه اگر نسبت از هر جهت واحد بود و همان نسبت، موجب تشریع خاص بود، شریعت از هر جهت واحد می‌بود.\n\n### [اینکه نسبت‌های الهی مختلف شدند، به دلیل اختلاف احوال است]\n\nاگر گفته شود: پس چرا نسبت‌های الهی مختلف شدند؟ می‌گوییم: به دلیل اختلاف احوال. کسی که حالش بیماری است، می‌خواند: ای عافیت‌بخش و ای شفا دهنده. و کسی که حالش گرسنگی است، می‌گوید: ای روزی‌دهنده (یا رزاق). و کسی که حالش غرق شدن است، می‌گوید: ای فریادرس (یا مغیث). پس نسبت‌ها به دلیل اختلاف احوال مختلف شدند. و این همان قول خداوند است: كُلَّ يَوْمٍ هُوَ في شَأْنٍ (او هر روز در کاری است) و سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ (به زودی به حساب شما می‌پردازیم، ای جن و انس). و قول پیامبر (صلی الله علیه و سلم) هنگامی که پروردگارش را وصف کرد: «بیده المیزان يخفض ويرفع» (ترازو در دست اوست، پایین می‌آورد و بالا می‌برد).\nپس به خاطر حالت وزن، در مورد او خافض (پایین‌آورنده) و رافع (بالابرنده) گفته شد. پس این نسبت‌ها ظاهر شدند. و همین‌طور است در اختلاف احوال خلق.\n\n### [اینکه احوال مختلف شدند، به دلیل اختلاف زمان است]\n\nو قول ما که احوال مختلف شدند، به دلیل اختلاف زمان‌هاست؛ زیرا سبب اختلاف احوال خلق، اختلاف زمان‌ها بر آن‌هاست. پس حال آن‌ها در زمان بهار با حالشان در زمان تابستان متفاوت است، و حالشان در زمان تابستان با حالشان در زمان پاییز متفاوت است، و حالشان در زمان پاییز با حالشان در زمان زمستان متفاوت است، و حالشان در زمان زمستان با حالشان در زمان بهار متفاوت است. برخی از علما در مورد آنچه زمان‌ها در اجسام طبیعی انجام می‌دهند، می‌گویند: خود را در معرض هوای زمان بهار قرار دهید، زیرا در بدن‌های شما همان کاری را می‌کند که در درختان شما می‌کند، و از هوای زمان پاییز دوری کنید، زیرا در بدن‌های شما همان کاری را می‌کند که در درختان شما می‌کند. و خداوند تعالی تصریح کرده است که ما از جمله گیاهان زمین هستیم، پس فرمود: والله أَنْبَتَكُمْ من الْأَرْضِ نَباتاً (و خداوند شما را از زمین به صورت گیاهی رویاند). منظور این است که شما روییدنی روییدید، زیرا مصدر «أنبتکم» همانا «إنباتاً» است. همان‌طور که در نسبت تکوین به خود مأمور به (شیء) فرمود: إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ (همانا سخن ما برای چیزی که اراده‌اش کنیم، این است که به آن بگوییم: باش، پس می‌شود). پس تکوین را به آن نسبت داد. همچنین ظهور نبات را به نبات نسبت داد؛ پس بفهم. به همین دلیل گفتیم که احوال مختلف شدند، به دلیل اختلاف زمان‌ها.\n\n### [اینکه زمان‌ها مختلف شدند، به دلیل اختلاف حرکات است]\n\nو اما قول ما که زمان‌ها مختلف شدند، به دلیل اختلاف حرکات است، منظورم از حرکات، حرکات فلکی است؛ زیرا با اختلاف حرکات فلکی، زمان شب و روز پدید آمد و سال‌ها و ماه‌ها و فصل‌ها مشخص شدند، و این‌ها همان‌هایی هستند که به زمان‌ها تعبیر می‌شوند. و قول ما که حرکات مختلف شدند، به دلیل اختلاف توجهات است، منظورم از آن، توجه حق (الحق) بر آن‌ها به واسطه ایجاد است، به دلیل قول خداوند تعالی: إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ (همانا سخن ما برای چیزی که اراده‌اش کنیم). پس اگر توجه بر آن‌ها واحد بود، حرکات مختلف نمی‌شدند، در حالی که آن‌ها مختلف هستند. پس دلالت می‌کند که توجهی که ماه را در فلک خود حرکت داد، همان توجهی نیست که خورشید یا سایر کواکب و افلاک را حرکت داد. و اگر امر چنین نبود، سرعت یا کندی در همه به طور مساوی بود. خداوند تعالی می‌فرماید: كُلٌّ في فَلَكٍ يَسْبَحُونَ (هر یک در مداری شناورند). پس برای هر حرکتی، توجهی الهی وجود دارد، یعنی تعلقی خاص از جهت مريد بودن او.\n\n### [اینکه توجهات مختلف شدند، به دلیل اختلاف مقاصد است]\n\nو قول ما که توجهات مختلف شدند، به دلیل اختلاف مقاصد است؛ زیرا اگر قصد حرکت قمری با آن توجه، عین قصد حرکت شمسی با آن توجه بود، اثری از اثر دیگر متمایز نمی‌شد، در حالی که آثار بدون شک مختلف هستند. پس توجهات به دلیل اختلاف مقاصد مختلف هستند. توجه او به رضایت از زید، غیر از توجه او به غضب بر عمرو است؛ زیرا قصد عذاب دادن عمرو و قصد نعمت دادن به زید را داشته است. پس مقاصد مختلف شدند.\n\n### [اینکه مقاصد مختلف شدند، به دلیل اختلاف تجلیات (التجلی) است]\n\nو قول ما که مقاصد مختلف شدند، به دلیل اختلاف تجلیات (التجلیات) است؛ زیرا اگر تجلیات از همه جهات در یک صورت بودند، صحیح نبود که قصدی جز یک قصد واحد داشته باشند، در حالی که اختلاف قصد ثابت شده است. پس ناگزیر باید برای هر قصد خاصی، تجلی خاصی باشد که عین تجلی دیگری نیست؛ زیرا وسعت الهی اقتضا می‌کند که هیچ چیزی در هستی (الوجود) تکرار نشود. و این همان چیزی است که طایفه (صوفیه) بر آن تکیه کرده‌اند، در حالی که مردم در مورد خلق جدید در اشتباه هستند. شیخ ابوطالب مکی، صاحب کتاب قوت القلوب، و دیگر مردان خدا (عز و جل) می‌گویند: خداوند سبحان هرگز در یک صورت برای دو شخص و هرگز در یک صورت دو بار تجلی نکرده است. و به همین دلیل، آثار در عالم مختلف شدند و از آن‌ها به رضایت و غضب تعبیر شده است.\n\n### [اینکه تجلیات مختلف شدند، به دلیل اختلاف شرایع است]\n\nو قول ما که تجلیات (التجلیات) مختلف شدند، به دلیل اختلاف شرایع است؛ زیرا هر شریعتی راهی است که به سوی او سبحانه می‌رساند و این راه‌ها مختلف هستند. پس ناگزیر باید تجلیات مختلف شوند، همان‌طور که عطایا مختلف می‌شوند. آیا نمی‌بینی که خداوند عز و جل هنگامی که در قیامت بر این امت تجلی می‌کند، در حالی که منافقانشان نیز در میان آن‌ها هستند، و نظر آن‌ها در شریعت مختلف شده است، پس هر مجتهدی بر شرع خاصی است که راه او به سوی خداست. و به همین دلیل مذاهب مختلف شدند، در حالی که هر شرعی در یک شریعت واحد است. و خداوند این را بر زبان رسولش (صلی الله علیه و سلم) نزد ما مقرر کرده است. پس تجلیات بدون شک مختلف شدند؛ زیرا هر طایفه‌ای در مورد خداوند امری را اعتقاد کرده است که اگر خداوند در خلاف آن بر آن‌ها تجلی کند، آن را انکار می‌کنند. پس هنگامی که خداوند در علامتی که آن طایفه با خدا در نفس خود مقرر کرده است، برای آن‌ها متحول شود، به آن اقرار می‌کنند. مثلاً اگر خداوند بر اشعری در صورت اعتقاد کسی که در عقیده به خدا با او مخالف است، تجلی کند، و بر مخالف در صورت اعتقاد اشعری تجلی کند، هر یک از دو طایفه آن را انکار می‌کنند، همان‌طور که وارد شده است. و همین‌طور در مورد همه طوایف. پس هنگامی که خداوند بر هر طایفه‌ای در صورت اعتقادشان به او تعالی تجلی کند، و آن همان علامتی است که مسلم در صحیح خود از رسول خدا (صلی الله علیه و سلم) ذکر کرده است، به او اقرار می‌کنند که پروردگارشان است و او همان است و غیر او نبوده است. پس تجلیات به دلیل اختلاف شرایع مختلف شدند.\n\n### [اینکه شرایع مختلف شدند، به دلیل اختلاف نسبت‌های الهی است]\n\nو قول ما که شرایع مختلف شدند، به دلیل اختلاف نسبت‌های الهی است، پیشتر بیان شد و دور (دوری) کامل شد. پس هر چیزی را که از این مسائل بگیری، صلاحیت دارد که اول، آخر و وسط باشد. و همین‌طور هر امر دورانی، هر جزء آن به فرض، اولیت و آخریت و آنچه بین آن دو است را می‌پذیرد. و ما نظیر این شکل دورانی را در تدبیرات الهی ذکر کردیم که مشابه قول پیشینیان است که گفتند: عالم بوستانی است که حصار آن دولت است. دولت سلطانی است که سنت (السنة) آن را حفظ می‌کند. سنت سیاستی است که پادشاه آن را اداره می‌کند. پادشاه شبانی است که سپاه (الجيش) او را یاری می‌کند. سپاه یارانی هستند که مال (المال) کفیل آن‌هاست. مال روزی‌ای است که رعیت آن را جمع می‌کند. رعیت بندگانی هستند که عدل (العدل) آن‌ها را به بندگی می‌گیرد. عدل امری مأنوس است که صلاح عالم در آن است. عالم بوستانی است. و دور کامل شد. و همین مقدار اشاره به علل و اسباب کافی است، از ترس طولانی شدن، زیرا این باب بسیار گسترده است، چرا که تمام عالم، بعضی به بعضی دیگر مرتبط هستند، به صورت اسباب و مسببات و علل و معلولات. والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را نشان می‌دهد). جزء بیست و پنجم به پایان رسید."
  },
  "page_count": 6
}