{
  "id": 115,
  "title": {
    "ar": "الباب الخامس عشر ومائة في معرفة الغيبة ومحمودها ومذمومها",
    "en": "Chapter 115: Concerning the Gnosis of Absence (الغيبة), its Praiseworthy and Blameworthy Forms.",
    "ur": "باب ایک سو پندرہواں: غیبت (الغيبة) کی معرفت، اور اس کی ستودہ اور مذموم صورتوں کے بیان میں۔",
    "fa": "باب صد و پانزدهم در معرفت غیبت و ستوده و نکوهیده آن"
  },
  "content": {
    "ar": "## (الباب الخامس عشر ومائة في معرفة الغيبة ومحمودها ومذمومها)\n\n\n> إذا نزل الحق من عزه *** إلى منزل الجوع والمرحمة\n\n\n> فخذه على حد ما قاله *** فإن به تحصل المكرمة\n\n\n> ولا تلقينه على جاهل *** فتحصل في موقف المندمه‏\n\n\n> فغيبك الحق في ذكره *** بما لم يقل وهي المشأمة\n\n\n> وإن كان حقا ولكنه *** إذا قاله قائل قال مه‏\n\n\n### [الغيبة ذكر الغائب بما لو سمعه ساءه‏]\n\n\nاعلم فهمك الله ما أسمعك أن الغيبة ذكر الغائب بما لو سمعه ساءه وهي حرام على المؤمنين فالحق لا يغتاب لأنه السميع البصير في نفس الأمر وعند العلماء به وقد أبان لعباده ما يكرهه منهم وما يحمده فَمِنْهُمْ من آمَنَ ومِنْهُمْ من كَفَرَ فلا يغتاب أيضا اسم فاعل واسم مفعول‏\n\n\n### [المواطن المخصوصة التي تكون فيها الغيبة واجبة]\n\n\nفالغيبة حرام على المكلفين فيما بينهم ويجتنبها أهل المروءات من غير المؤمنين نزاهة وشرف نفس لأن اجتنابها يدل على كرم الأصول إلا في مواطن مخصوصة فإنها واجبة وقربة إلى الله وأهل الورع من المؤمنين يعرضون بها ولا يصرحون فمن ذلك في طريق الجرح الذي يعرفه المحدثون في رواة الأحكام المشروعة روينا عن بعض العلماء بالله أنه كان يقول في ذلك لصاحبه تعال نغتب في الله ومنها عند المشورة في النكاح فإنه مؤتمن والنصيحة واجبة ومنها الغيبة المرسلة وهو أن يغتاب أهل زمانه من غير تعيين شخص بعينه ومنها غيبة المشايخ المريدين في حال التربية إذا كان فيها صلاح المريد إذا وصل ذلك إليه ومع كون الغيبة محمودة في هذه المواطن فعدم التعيين فيها أولى من التعيين‏\n\n\nفإن النبي صَلَّى اللهُ عَليهِ وسَلَّم يقول لا غيبة في فاسق‏\n\n\nنهيا لا نفيا على هذا أخذ أهل الورع هذا الخبر وطريق التعريض هين المأخذ وما عدا أمثال هذه المواطن فهي مذمومة يجب اجتنابها\n\n\n### [العدم هو الشر والشر عدم‏]\n\n\nومن هذا الباب تجريح الشهود إذا عرف المشهود عليه أنهم شهدوا بالزور فوجب عليه نصرة الحق وأهله وخذلان الباطل وأهله ومن هنا يتبين لك أن العدم هو الشر فإن شهداء\nالزور مالوا إلى جانب العدم ورجحوه على الوجود ووصفوا بالكون ما ليس بكائن وجعله الله على لسان رسوله من الكبائر لأنه ما مدلول قولهم إلا العدم ومع هذا كله إن استطاع من هو من أهل طريق الله التعريض لا التصريح حتى يفهم عنه ما يريد إذا علم إن في ذلك منفعة دينية فليفعل فهو أولى ويحصل الغرض ويكون اللسان قد وفى ما تعين عليه من غير فحش في المنطق وهذا كله ما دام يسمى مؤمنا وأما إن كان هذا الشخص في مقام من كان الحق سمعه وبصره ولسانه فحاله غير حال المؤمن مع أنه من أهل الايمان‏\n\n\n### [الدواء العامي والدواء الملكي‏]\n\n\nواعلم أن الله تعالى ما خلق داء إلا وخلق له دواء والأدوية على نوعين دواء العامة وهو الذي يقدر عليه كل أحد والدواء الآخر دواء ملكي وهو الذي لا يقدر عليه إلا الملوك والأغنياء لنفاسته وغلو ثمنه فلا يقدر عليه إلا المتمكن من المال والسلطان وهكذا قسم الأدوية أهل الطب وصادفوا الحق في ذلك فأما الدواء العام النافع الداخل تحت قدرة كل أحد من غني وفقير وسوقة وملوك من داء جميع الذنوب والمعاصي فهو التوبة وإرضاء الخصوم من شروطها مما يقدر عليه من ذلك وعينه عليه الشارع إذا كان ذلك الداء مما ينبغي أن يرضى فيه الخصوم وإذا كان مما لا ينبغي فيتوب ولا يرضى خصمه فإنه إن أرضاه قد يقع في محظور أشد مما كان قد تاب عنه فلا يغفل عنه‏\n\n\n### [الدواء الملكي لا يستعمله إلا العارفون‏]\n\n\nوأما الدواء الملكي فلا يستعمله إلا العارفون السادة من رجال الله وهم الذين يكون الحق سمعهم وبصرهم ولسانهم وهو قوله عقيب قوله ولا يَغْتَبْ بَعْضُكُمْ بَعْضاً أَ يُحِبُّ أَحَدُكُمْ أَنْ يَأْكُلَ لَحْمَ أَخِيهِ مَيْتاً فَكَرِهْتُمُوهُ هذا خطاب عام ثم قال واتَّقُوا الله هذا هو الدواء ومعناه اتخذوه وقاية بينكم وبين هذه الأمور المذمومة التي الغيبة منها فإذا اتخذتموه جنة تعاورت هذه الجنة سهام هذه الأفعال وهي قوية لا تنفذها هذه السهام فيكون المتقي بها في حمايتها ولا يكون الحق وقاية للعبد حتى يتلبس به العبد كما يتلبس المتوقى بالجنن من الدرع الحصينة وغيرها وصورة تلبسه أن يكون الحق سمعه ولسانه وجميع قواه وجوارحه في حال تصرفها فيما هي له فيكون نورا كله‏\n\n\n### [التنبيه في القرآن على الدواء الملكي السلطاني‏]\n\n\nفنبه الله في كتابه على هذه الأدواء الملكية السلطانية مثل قوله تعالى فَأَلْهَمَها فُجُورَها والغيبة من الفجور وتَقْواها أي الذي يتخذه وقاية من هذا الفجور ولم يجعل الفجور من أوصافها وإنما جعله مجعولا فيها من الملهم لها كما أيد هذا بقوله أَ فَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَناً فما جعل التزيين له بل قال زَيَّنَّا لَهُمْ أَعْمالَهُمْ وقال زَيَّنَ لَهُمُ الشَّيْطانُ أَعْمالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ ولما أضاف التزيين إليه سبحانه قال فَهُمْ يَعْمَهُونَ أي يحارون والحيرة من صفات الأكابر وصفة الحيرة في مثل هذا أنه الأمر في إيجاده للملهم المزين والمجعول فيه الملهم والمزين له مأمور باجتنابه وهو الاتصاف بما ألهم له وما زين من قبل أن يظهر بالفعل فهو مذموم غير مؤاخذ به حتى يتلبس به في الظاهر ثم قال في أمور من هذا الباب إنه رِجْسٌ من عَمَلِ الشَّيْطانِ فَاجْتَنِبُوهُ وهو البعيد من الرحمة فَاجْتَنِبُوهُ أي وكونوا مع الاسم القريب من الرحمة ومن أسمائه سبحانه البعيد فمن اتخذ الحمق جنة ووقاية كما أمر لم تضره هذه الأشياء فإن الله تعالى ما نبهه على استعمال هذه الأدواء إلا لإقامة العذر منه إذا سئل عن مثل هذا والمؤمن غيب خلف جنته فهو في حمى فلا يخرج عن حماه والفاسق الذي لا غيبة فيه ليس بغائب خلف جنته بل هو خارج عنها لأن الفسوق الخروج‏\n\n\nفقال لا غيبة في فاسق‏\n\n\n### [من أخرج غيبا إلى شهادة فقد أخطأ]\n\n\nفمن أخرج غيبا يستحق أن يكون غيبا إلى شهادة فقد أخطأ ولهذا أضاف الغيبة إلينا فقال ولا يَغْتَبْ بَعْضُكُمْ بَعْضاً فجعلنا نشأة واحدة ذات أبعاض فإن الجزء والتفصيل إنما يرد على الكل فما خرجنا عنا ولا وقعنا إلا فينا فشدد الأمر علينا في ذلك فإن القاتل نفسه حرمت عليه الجنة وهي الساترة فإن الشي‏ء لا يستتر عن نفسه وكل من ذكر غائبا فقد صيره شهادة وغربه عن موطنه وموت الغريب شهادة\n\n\n### [المغتاب فاعل خير في حق من اغتابه وان كره ذلك منه‏]\n\n\nفالمغتاب فاعل خير في حق من اغتابه وإن كان يكره ذلك ففيه منفعة كشارب الدواء الكرة وعَسى‏ أَنْ تَكْرَهُوا شَيْئاً وهُوَ خَيْرٌ لَكُمْ وإذا كان فاعل خير من غير قصد فهو ممن أجرى الله الخير لزيد على يديه فيكون جزاؤه جزاء من وفق لعمل خير من غير قصد في حق من اغتابه لكن ذلك مقصود لمن ألهمه إياه وسماه فجورا في حقه فيصلح الله يوم القيامة بين عباده لما يراه المظلوم من الخير الواصل إليه على يدي أخيه فيشكره على ذلك فيسعدان جميعا وفي الخبر الصحيح فَاتَّقُوا الله وأَصْلِحُوا ذاتَ بَيْنِكُمْ فإن الله يصلح بين عباده يوم القيامة فالغيبة وإن كانت مذمومة فهي من ذلك الوجه محمودة في حق من اغتيب فمال ذلك إلى الخير إذ كانت الجنة والوقاية الحائلة بينهما\nالحق والحق والغيبة وجود ما هي عدم فوقع التناسب بين الموجودين فاندرج الأضعف في الأقوى فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter One Hundred and Fifteen: On the Knowledge of Backbiting (الغيبة), its Praiseworthy and Blameworthy Aspects\n\n> If The Real (الحق) descends from His Might,\n> To the station of hunger and mercy,\n> Then take it according to what He said,\n> For through it, the honor is attained.\n> And do not cast it upon the ignorant,\n> Lest you find yourself in the position of regret.\n> For The Real concealed you in His remembrance,\n> With what was not said, and that is the misfortune.\n> And even if it is true, yet,\n> If someone says it, one says, 'Stop!'\n\n### [Backbiting is mentioning the absent person with something that, if he heard it, would displease him]\n\nKnow—may Allah grant you understanding of what He makes you hear—that backbiting (الغيبة) is mentioning the absent person with something that, if he heard it, would displease him, and it is forbidden (حرام) for the believers. Thus, The Real (الحق) does not backbite, because He is the All-Hearing (السميع), the All-Seeing (البصير) in the matter itself, and according to those who possess Knowledge (العلم) of Him. He has already made clear to His servants what He dislikes from them and what He praises. <<فَمِنْهُمْ من آمَنَ ومِنْهُمْ من كَفَرَ>> (So among them are those who believed, and among them are those who disbelieved). Therefore, neither the active subject nor the passive object backbites.\n\n### [Specific situations in which backbiting is obligatory]\n\nBackbiting is forbidden (حرام) among those held accountable (المكلفين). People of noble character (أهل المروءات), even non-believers, avoid it out of integrity and nobility of soul, because avoiding it indicates noble origins. This is except in specific situations (مواطن مخصوصة), where it becomes obligatory (واجبة) and an act of proximity (قربة) to Allah. The people of piety (أهل الورع) among the believers allude to it (يعرضون) rather than stating it explicitly (يصرحون).\n\nOne such situation is in the method of disqualification (الجرح) known to the traditionists (المحدثون) concerning the narrators of prescribed legal rulings (الأحكام المشروعة). We have narrated from some Gnostics of Allah (العلماء بالله) that one would say to his companion regarding this, \"Come, let us backbite for the sake of Allah.\"\n\nAnother is when consulted regarding marriage, for the consultant is entrusted, and sincere advice (النصيحة) is obligatory.\n\nAnother is general backbiting (الغيبة المرسلة), which is backbiting the people of one's time without specifying a particular person.\n\nAnother is the backbiting of the Shaykhs (المشايخ) concerning their disciples (المريدين) during the process of spiritual training (التربية), provided it leads to the disciple's rectification, even if the information reaches him.\n\nEven though backbiting is praiseworthy in these situations, non-specification is preferable to specification. For the Prophet, peace and blessings be upon him, said: \"There is no backbiting concerning a transgressor (فاسق).\" This is understood as a prohibition, not a negation. The people of piety (أهل الورع) took this report in this manner, and the method of allusion (التعريض) is easy to adopt. Anything other than these examples of situations is blameworthy and must be avoided.\n\n### [Non-Existence is Evil, and Evil is Non-Existence]\n\nRelated to this chapter is the disqualification of witnesses (تجريح الشهود) if the person testified against knows that they bore false witness. It is then obligatory upon him to support The Real (الحق) and its people, and to abandon falsehood (الباطل) and its people.\n\nFrom this, it becomes clear to you that Non-Existence (العدم) is Evil (الشر), for the false witnesses inclined toward the side of Non-Existence and preferred it over Existence (الوجود). They described as existent that which is not existent. Allah made this one of the major sins (الكبائر) through the tongue of His Messenger, because the implication of their statement is nothing but Non-Existence.\n\nDespite all this, if someone who belongs to the path of Allah (طريق الله) is able to use allusion (التعريض) rather than explicit statement (التصريح) until his meaning is understood—provided he knows there is a religious benefit (منفعة دينية) in doing so—then he should do it, for it is preferable. The objective is achieved, and the tongue has fulfilled what was incumbent upon it without vulgarity in speech.\n\nAll this applies as long as the person is called a believer (مؤمنا). But if this person is in the station (مقام) where The Real (الحق) is his hearing, sight, and tongue, then his state is different from the state of the ordinary believer, even though he is still among the people of faith.\n\n### [The Common Medicine and the Regal Medicine]\n\nKnow that Allah the Exalted did not create a disease (داء) except that He created a cure (دواء) for it. Medicines are of two types: the medicine of the common people (دواء العامة), which everyone can afford, and the other medicine, the regal medicine (دواء ملكي), which only kings and the wealthy can afford due to its preciousness and high price. Only those established in wealth and authority can afford it. Thus did the physicians divide medicines, and they found the truth in that.\n\nAs for the general beneficial medicine, which is within the capacity of everyone—rich, poor, commoner, and king—for the disease of all sins and transgressions, it is repentance (التوبة). And among its conditions is satisfying the adversaries (إرضاء الخصوم) concerning what one is capable of, and what the Lawgiver (الشارع) specified, provided that the disease is one where adversaries should be satisfied. But if it is something where they should not be satisfied, then he repents but does not satisfy his adversary, for if he satisfies him, he might fall into a prohibition (محظور) more severe than the one he repented from. So, one must not be heedless of this.\n\n### [The Regal Medicine is used only by the Gnostics]\n\nAs for the regal medicine (الدواء الملكي), only the Gnostics (العارفون), the masters among the men of Allah (رجال الله), use it. They are those whose hearing, sight, and tongue are The Real (الحق). This is His saying immediately following His statement: <<ولا يَغْتَبْ بَعْضُكُمْ بَعْضاً أَ يُحِبُّ أَحَدُكُمْ أَنْ يَأْكُلَ لَحْمَ أَخِيهِ مَيْتاً فَكَرِهْتُمُوهُ>> (And do not backbite one another. Would one of you like to eat the flesh of his brother when dead? You would detest it.)\n\nThis is a general address. Then He said: <<واتَّقُوا الله>> (And fear Allah). This is the medicine. Its meaning is: take Him as a shield (وقاية) between yourselves and these blameworthy matters, of which backbiting is one. If you take Him as a shield (جنة), the arrows of these actions will strike this shield, and since it is strong, these arrows cannot penetrate it. Thus, the one who fears Allah (المتقي) is in its protection.\n\nThe Real (الحق) does not become a shield for the servant until the servant clothes himself with Him, just as the protected person clothes himself with shields (الجنن) such as strong armor and the like. The form of this clothing is that The Real becomes his hearing, his tongue, and all his powers and limbs while they are engaged in their proper functions, so that he becomes entirely Light (نورا).\n\n### [The Allusion in the Quran to the Regal, Sovereign Medicine]\n\nAllah drew attention in His Book to these regal, sovereign medicines (الأدواء الملكية السلطانية), such as His saying, the Exalted: <<فَأَلْهَمَها فُجُورَها>> (Then He inspired it [the soul] with its transgression [فجور])—and backbiting is a form of transgression—<<وتَقْواها>> (and its piety [تقواها]). Meaning, the piety that one takes as a shield (وقاية) against this transgression. He did not make transgression one of its inherent attributes, but rather something placed within it by the One Who inspires it (الملهم لها).\n\nThis is supported by His saying: <<أَ فَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَناً>> (Is he, then, to whom the evil of his deed is made fair-seeming, so he deems it good?). He did not attribute the beautification (التزيين) to the person himself, but rather He said: <<زَيَّنَّا لَهُمْ أَعْمالَهُمْ>> (We made their deeds fair-seeming to them), and He said: <<زَيَّنَ لَهُمُ الشَّيْطانُ أَعْمالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ>> (Satan made their deeds fair-seeming to them and averted them from the path).\n\nWhen He attributed the beautification to Himself, the Glorified, He said: <<فَهُمْ يَعْمَهُونَ>> (So they wander blindly), meaning they are bewildered. Bewilderment (الحيرة) is one of the attributes of the great ones (الأكابر). The nature of bewilderment in such a case is that the matter of its creation belongs to the Inspirer and Beautifier, while the one in whom the inspiration and beautification are placed is commanded to avoid it. This avoidance is the quality inspired and beautified before it manifests in action. It is blameworthy but not punishable until one clothes oneself with it outwardly.\n\nThen, concerning matters of this kind, He said: <<إنه رِجْسٌ من عَمَلِ الشَّيْطانِ فَاجْتَنِبُوهُ>> (Indeed, it is an abomination [رجس] of Satan’s handiwork, so avoid it). And Satan is the Far from Mercy (البعيد من الرحمة). <<فَاجْتَنِبُوهُ>> (So avoid it) means: be with the Name that is Near to Mercy. Yet, among His Names, the Glorified, is also the Far (البعيد).\n\nWhoever takes folly (الحمق) as a shield (جنة) and protection (وقاية) as commanded, these things will not harm him. For Allah the Exalted only drew attention to the use of these medicines in order to establish an excuse for him if he is questioned about such matters.\n\nThe believer (المؤمن) is absent (غيب) behind his shield (جنته), so he is in protection and does not leave his sanctuary. But the transgressor (الفاسق), concerning whom there is no backbiting, is not absent behind his shield; rather, he is outside of it, because transgression (الفسوق) means going out. Thus, He said: \"There is no backbiting concerning a transgressor (فاسق).\"\n\n### [Whoever brings forth an absent thing into manifestation has erred]\n\nWhoever brings forth an absent thing (غيب) that deserves to remain absent into manifestation (شهادة) has erred. For this reason, He attributed backbiting to us, saying: <<ولا يَغْتَبْ بَعْضُكُمْ بَعْضاً>> (And do not backbite one another). Thus, He made us a single creation (نشأة واحدة) possessing parts (أبعاض). For the part and the detail only apply to the whole. We have not gone outside of ourselves, nor have we fallen except into ourselves. Therefore, the matter was made severe for us. For the one who kills himself is forbidden the Garden (الجنة), which is the concealer (الساترة). A thing cannot conceal itself from itself. And everyone who mentions an absent person has made him manifest (شهادة) and alienated him from his homeland. And the death of the stranger is a martyrdom (شهادة).\n\n### [The backbiter is a doer of good toward the one he backbites, even if he dislikes it]\n\nThe backbiter (المغتاب) is a doer of good (فاعل خير) toward the one he backbites, even if he dislikes it, for it contains benefit, like one who drinks a bitter medicine. <<وعَسى‏ أَنْ تَكْرَهُوا شَيْئاً وهُوَ خَيْرٌ لَكُمْ>> (But perhaps you hate a thing and it is good for you).\n\nIf he is a doer of good without intention, then he is one through whose hands Allah caused good to flow for another person. His reward will be the reward of one who was guided to perform a good deed unintentionally toward the one he backbit. However, that good is intended by the One Who inspired it in him and named it transgression (فجورا) in his regard.\n\nThus, Allah will reconcile His servants on the Day of Resurrection when the wronged person sees the good that reached him through the hands of his brother, and he will thank him for it, and both will be happy. And in the authentic report: <<فَاتَّقُوا الله وأَصْلِحُوا ذاتَ بَيْنِكُمْ>> (So fear Allah and amend that which is between you), for Allah will reconcile His servants on the Day of Resurrection.\n\nTherefore, backbiting (الغيبة), although blameworthy, is praiseworthy from that perspective concerning the one who was backbitten, for the matter inclined toward good, since the shield (الجنة) and the protection (الوقاية) separating them is The Real (الحق) and The Real. And backbiting is an existence, not a non-existence (عدم). Thus, a correspondence occurred between the two existent things, and the weaker was subsumed into the stronger. Know this. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (speaks the Truth, and He guides to the way).",
    "ur": "## (باب نمبر ایک سو پندرہ: غیبت کی معرفت، اس کے محمود اور مذموم ہونے کے بیان میں)\n\n> جب ذات حق (الحق) اپنے جلال سے *** بھوک اور رحمت کے مقام پر نزول فرمائے\n\n> تو اسے اسی حد پر لے لو جو اس نے کہی ہے *** کیونکہ اسی سے بزرگی (المکرمۃ) حاصل ہوتی ہے\n\n> اور اسے کسی جاہل کے سامنے پیش نہ کرو *** ورنہ تم ندامت کے مقام پر کھڑے ہو جاؤ گے\n\n> پس حق (الحق) نے تمہیں اپنے ذکر میں غائب کر دیا *** اس چیز کے ساتھ جو اس نے نہیں کہی، اور یہی نحوست ہے\n\n> اگرچہ وہ حق ہو، لیکن *** جب کوئی کہنے والا اسے کہے تو کہا جائے: \"بس کرو!\"\n\n### [غیبت: غائب کا ذکر ایسی بات سے کرنا جو اگر وہ سنے تو اسے ناگوار گزرے]\n\nجان لو، اللہ تمہیں وہ سمجھ عطا فرمائے جو میں تمہیں سنا رہا ہوں، کہ غیبت (الغیبۃ) غائب کا ذکر ایسی بات سے کرنا ہے جو اگر وہ سنے تو اسے ناگوار گزرے، اور یہ مومنوں پر حرام ہے۔ پس ذات حق (الحق) کی غیبت نہیں کی جا سکتی کیونکہ وہ نفس الامر میں اور اپنے عارف علماء کے نزدیک سمیع (سننے والا) اور بصیر (دیکھنے والا) ہے۔ اور اس نے اپنے بندوں کے لیے واضح کر دیا ہے کہ وہ ان سے کیا ناپسند کرتا ہے اور کس کی تعریف کرتا ہے۔ پس ان میں سے بعض ایمان لائے اور بعض نے کفر کیا (فَمِنْهُمْ مَنْ آمَنَ وَمِنْهُمْ مَنْ كَفَرَ)۔ لہٰذا اسم فاعل اور اسم مفعول کی بھی غیبت نہیں کی جا سکتی۔\n\n### [وہ مخصوص مقامات جہاں غیبت واجب ہوتی ہے]\n\nپس غیبت مکلفین کے درمیان حرام ہے، اور غیر مومنوں میں سے بھی اہل مروت اسے نفس کی نزاہت اور شرف کی وجہ سے ترک کرتے ہیں، کیونکہ اس سے اجتناب اصول کی کرم دلی پر دلالت کرتا ہے۔ مگر چند مخصوص مقامات ہیں جہاں یہ واجب اور اللہ کے لیے قربت کا ذریعہ ہوتی ہے۔ اور اہل ورع (پرہیزگار) مومن ان مقامات پر بھی صراحت کے بجائے تعریض (اشارے) سے کام لیتے ہیں۔ ان میں سے ایک جرح کا طریقہ ہے جسے محدثین مشروع احکام کے راویوں کے بارے میں جانتے ہیں۔ ہم نے بعض علماء باللہ سے روایت کیا ہے کہ وہ اس بارے میں اپنے ساتھی سے کہا کرتے تھے: \"آؤ، ہم اللہ کی خاطر غیبت کریں\"۔ اور ان میں سے ایک نکاح کے مشورے کے وقت ہے، کیونکہ مشورہ دینے والا امین ہوتا ہے اور نصیحت واجب ہے۔ اور ان میں سے ایک مرسلہ غیبت ہے، یعنی کسی خاص شخص کی تعیین کیے بغیر اپنے زمانے کے لوگوں کی غیبت کرنا۔ اور ان میں سے ایک تربیت کے دوران مریدوں کے مشائخ کی غیبت ہے، بشرطیکہ اس میں مرید کی اصلاح ہو اور یہ بات اس تک پہنچ جائے۔ اور ان مقامات پر غیبت کے محمود ہونے کے باوجود، تعیین سے گریز کرنا تعیین کرنے سے بہتر ہے۔\n\nکیونکہ نبی اکرم صلی اللہ علیہ وسلم فرماتے ہیں: \"فاسق کی کوئی غیبت نہیں\" (لا غيبة في فاسق)۔\n\nاہل ورع نے اس خبر کو نفی کے بجائے نہی (منع) پر محمول کیا ہے۔ اور تعریض کا طریقہ اختیار کرنا آسان ہے۔ اور ان جیسے مقامات کے علاوہ باقی سب مذموم ہیں جن سے بچنا واجب ہے۔\n\n### [عدم (نیستی) ہی شر ہے اور شر عدم ہے]\n\nاور اسی باب سے گواہوں کو مجروح کرنا بھی ہے، جب مشہود علیہ (جس کے خلاف گواہی دی گئی) کو معلوم ہو جائے کہ انہوں نے جھوٹی گواہی دی ہے۔ پس اس پر حق اور اس کے اہل کی نصرت کرنا اور باطل اور اس کے اہل کو رسوا کرنا واجب ہے۔ اور یہیں سے تمہیں واضح ہو جائے گا کہ عدم (العدم) ہی شر (الشر) ہے۔ کیونکہ جھوٹے گواہ عدم کی طرف مائل ہوئے اور اسے وجود (الوجود) پر ترجیح دی، اور انہوں نے اس چیز کو موجود قرار دیا جو موجود نہیں تھی۔ اور اللہ نے اسے اپنے رسول کی زبان سے کبیرہ گناہوں میں شمار کیا، کیونکہ ان کے قول کا مدلول عدم کے سوا کچھ نہیں۔ اس سب کے باوجود، اگر اہل طریق اللہ میں سے کوئی شخص صراحت کے بجائے تعریض (اشارے) سے کام لے سکتا ہو، یہاں تک کہ سننے والا اس کی مراد سمجھ جائے، جب وہ جانتا ہو کہ اس میں دینی فائدہ ہے، تو اسے ایسا کرنا چاہیے، کیونکہ یہ بہتر ہے اور مقصد بھی حاصل ہو جائے گا، اور زبان نے بھی اپنی ذمہ داری پوری کر دی ہوگی بغیر کسی بدکلامی کے۔ اور یہ سب اس وقت تک ہے جب تک وہ مومن کہلاتا ہے۔ لیکن اگر یہ شخص اس مقام پر ہو جہاں ذات حق (الحق) اس کی سماعت، بصارت اور زبان ہو، تو اس کا حال مومن کے حال سے مختلف ہے، اگرچہ وہ اہل ایمان میں سے ہے۔\n\n### [عام دوا اور شاہی دوا]\n\nاور جان لو کہ اللہ تعالیٰ نے کوئی بیماری پیدا نہیں کی مگر اس کے لیے دوا بھی پیدا کی ہے۔ اور دوائیں دو قسم کی ہیں: ایک عام لوگوں کی دوا، جو ہر کوئی حاصل کر سکتا ہے۔ اور دوسری شاہی دوا (دواء ملکی)، جو صرف بادشاہ اور مالدار ہی حاصل کر سکتے ہیں، کیونکہ وہ قیمتی اور مہنگی ہوتی ہے۔ پس اسے صرف وہی حاصل کر سکتا ہے جو مال اور سلطنت میں متمکن ہو۔ اہل طب نے بھی دواؤں کو اسی طرح تقسیم کیا ہے اور اس میں حق کو پایا ہے۔ جہاں تک عام دوا کا تعلق ہے جو ہر کسی کی قدرت میں ہے، خواہ وہ امیر ہو یا غریب، عام آدمی ہو یا بادشاہ، اور جو تمام گناہوں اور نافرمانیوں کی بیماری کے لیے مفید ہے، وہ توبہ ہے، اور اس کی شرائط میں سے ایک یہ ہے کہ خصوم (مخالفین) کو راضی کیا جائے، ان چیزوں میں جن پر وہ قادر ہو اور شارع نے اس پر لازم کیا ہو، اگر وہ بیماری ایسی ہو جس میں خصوم کو راضی کرنا ضروری ہو۔ اور اگر وہ ایسی ہو جس میں راضی کرنا ضروری نہ ہو، تو وہ توبہ کرے اور اپنے خصم کو راضی نہ کرے، کیونکہ اگر وہ اسے راضی کرے گا تو ہو سکتا ہے کہ وہ اس سے بھی زیادہ سخت ممنوع کام میں پڑ جائے جس سے اس نے توبہ کی تھی۔ پس اسے اس سے غافل نہیں ہونا چاہیے۔\n\n### [شاہی دوا صرف عارفین استعمال کرتے ہیں]\n\nاور جہاں تک شاہی دوا (الدواء الملکی) کا تعلق ہے، تو اسے صرف عارفین، اللہ کے سردار لوگ ہی استعمال کرتے ہیں، اور وہ وہ ہیں جن کی سماعت، بصارت اور زبان ذات حق (الحق) ہوتی ہے۔ اور یہ اس کے اس قول کے بعد ہے: \"اور تم میں سے کوئی کسی کی غیبت نہ کرے، کیا تم میں سے کوئی یہ پسند کرے گا کہ وہ اپنے مردہ بھائی کا گوشت کھائے؟ پس تم اسے ناپسند کرتے ہو\" (وَلَا يَغْتَبْ بَعْضُكُمْ بَعْضًا أَيُحِبُّ أَحَدُكُمْ أَنْ يَأْكُلَ لَحْمَ أَخِيهِ مَيْتًا فَكَرِهْتُمُوهُ)۔ یہ ایک عام خطاب ہے۔ پھر فرمایا: \"اور اللہ سے ڈرو\" (وَاتَّقُوا اللَّهَ)۔ یہی وہ دوا ہے۔ اور اس کا مطلب ہے کہ اسے اپنے اور ان مذموم امور کے درمیان ڈھال بنا لو جن میں سے غیبت بھی ہے۔ پس جب تم اسے ڈھال بنا لو گے، تو یہ ڈھال ان افعال کے تیروں کا مقابلہ کرے گی، اور یہ ڈھال مضبوط ہے، یہ تیر اس میں گھس نہیں سکتے۔ پس متقی اس کے تحفظ میں رہے گا۔ اور ذات حق (الحق) بندے کے لیے اس وقت تک ڈھال نہیں بنتا جب تک بندہ اس سے اس طرح متلبس نہ ہو جائے جس طرح بچنے والا مضبوط زرہ یا دیگر ڈھالوں سے متلبس ہوتا ہے۔ اور اس کے متلبس ہونے کی صورت یہ ہے کہ ذات حق (الحق) اس کی سماعت، زبان اور اس کی تمام قوتیں اور اعضاء بن جائے، جب وہ ان کاموں میں مصروف ہوں جن کے لیے وہ ہیں، تو وہ سارا کا سارا نور بن جائے۔\n\n### [قرآن میں شاہی سلطانی دوا پر تنبیہ]\n\nپس اللہ نے اپنی کتاب میں ان شاہی سلطانی دواؤں پر تنبیہ فرمائی ہے، جیسے اس کا یہ فرمان: \"پس اس (نفس) کو اس کی فجور (برائی) اور اس کی تقویٰ (پرہیزگاری) کا الہام کیا\" (فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا)۔ اور غیبت فجور میں سے ہے۔ اور تقویٰ (تَقْوَاهَا) یعنی وہ چیز جسے وہ اس فجور سے بچنے کے لیے ڈھال بناتا ہے۔ اور اس نے فجور کو نفس کی صفات میں سے نہیں بنایا، بلکہ اسے اس میں مجعول (بنایا ہوا) قرار دیا ہے، اس ذات کی طرف سے جس نے اسے الہام کیا۔ جیسا کہ اس کی تائید اس قول سے ہوتی ہے: \"کیا وہ شخص جس کے لیے اس کا برا عمل مزین کر دیا گیا، پس وہ اسے اچھا دیکھتا ہے؟\" (أَفَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَنًا)۔ پس اس نے تزیین کو اس کی طرف منسوب نہیں کیا، بلکہ فرمایا: \"ہم نے ان کے اعمال کو ان کے لیے مزین کر دیا\" (زَيَّنَّا لَهُمْ أَعْمَالَهُمْ)۔ اور فرمایا: \"شیطان نے ان کے اعمال کو ان کے لیے مزین کر دیا، پس انہیں راستے سے روک دیا\" (زَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ)۔ اور جب اس نے تزیین کو اپنی طرف منسوب کیا تو فرمایا: \"پس وہ بھٹکتے پھرتے ہیں\" (فَهُمْ يَعْمَهُونَ)۔ اور حیرت (الحیرۃ) اکابر کی صفات میں سے ہے۔ اور اس طرح کے معاملے میں حیرت کی صفت یہ ہے کہ اس کا معاملہ اس ذات کے لیے ہے جس نے اسے ایجاد کیا، الہام کیا اور مزین کیا، اور جس میں الہام کیا گیا اور جس کے لیے مزین کیا گیا، اسے اس سے بچنے کا حکم دیا گیا ہے۔ اور وہ یہ ہے کہ وہ اس چیز سے متصف ہو جائے جس کا اسے الہام کیا گیا اور جو مزین کیا گیا، اس سے پہلے کہ وہ بالفعل ظاہر ہو۔ پس وہ مذموم ہے، لیکن اس پر مواخذہ نہیں ہوتا جب تک کہ وہ ظاہر میں اس سے متلبس نہ ہو جائے۔ پھر اس نے اس باب کے امور کے بارے میں فرمایا کہ یہ \"شیطان کے عمل سے گندگی ہے، پس اس سے بچو\" (إِنَّهُ رِجْسٌ مِنْ عَمَلِ الشَّيْطَانِ فَاجْتَنِبُوهُ)۔ اور وہ (شیطان) رحمت سے دور ہے۔ \"پس اس سے بچو\" (فَاجْتَنِبُوهُ) یعنی اور اس اسم کے ساتھ ہو جاؤ جو رحمت سے قریب ہے۔ اور اس کے اسماء میں سے البعید (دور) بھی ہے۔ پس جس نے حکم کے مطابق تقویٰ کو ڈھال اور وقایہ بنا لیا، یہ چیزیں اسے نقصان نہیں پہنچائیں گی۔ کیونکہ اللہ تعالیٰ نے اسے ان دواؤں کے استعمال پر تنبیہ صرف اس لیے کی ہے تاکہ جب اس سے اس طرح کے بارے میں پوچھا جائے تو اس کی طرف سے عذر قائم ہو۔ اور مومن اپنی ڈھال کے پیچھے غائب ہوتا ہے، پس وہ پناہ میں ہے، لہٰذا وہ اپنی پناہ سے باہر نہ نکلے۔ اور وہ فاسق جس کی غیبت نہیں، وہ اپنی ڈھال کے پیچھے غائب نہیں ہے، بلکہ وہ اس سے باہر ہے، کیونکہ فسوق کا مطلب ہی خروج (باہر نکلنا) ہے۔\n\nپس فرمایا: \"فاسق کی کوئی غیبت نہیں\" (لا غيبة في فاسق)۔\n\n### [جس نے غائب کو شہادت میں نکالا، اس نے غلطی کی]\n\nپس جس نے کسی غائب کو، جو غائب رہنے کا مستحق تھا، شہادت (حاضری) میں نکالا، اس نے غلطی کی۔ اسی لیے اس نے غیبت کو ہماری طرف منسوب کیا اور فرمایا: \"اور تم میں سے کوئی کسی کی غیبت نہ کرے\" (وَلَا يَغْتَبْ بَعْضُكُمْ بَعْضًا)۔ پس اس نے ہمیں ایک ہی نشأۃ (پیدائش) قرار دیا جو اجزاء والی ہے۔ کیونکہ جزء اور تفصیل کل پر ہی وارد ہوتی ہے۔ پس ہم اپنے آپ سے باہر نہیں نکلے اور نہ ہی ہم گرے مگر اپنے اندر۔ پس اس نے اس معاملے کو ہم پر سخت کر دیا۔ کیونکہ خود کو قتل کرنے والے پر جنت حرام کر دی گئی ہے، اور جنت ہی پردہ ڈالنے والی ہے۔ کیونکہ کوئی چیز اپنے آپ سے پردہ نہیں کر سکتی۔ اور جس نے بھی کسی غائب کا ذکر کیا، اس نے اسے شہادت بنا دیا اور اسے اس کے وطن سے غریب کر دیا، اور غریب کی موت شہادت ہے۔\n\n### [غیبت کرنے والا اس شخص کے حق میں بھلائی کرنے والا ہے جس کی اس نے غیبت کی، اگرچہ وہ اسے ناپسند کرے]\n\nپس غیبت کرنے والا اس شخص کے حق میں بھلائی کرنے والا ہے جس کی اس نے غیبت کی، اگرچہ وہ اسے ناپسند کرے۔ پس اس میں فائدہ ہے، جیسے کڑوی دوا پینے میں۔ \"اور ہو سکتا ہے کہ تم کسی چیز کو ناپسند کرو اور وہ تمہارے لیے بہتر ہو\" (وَعَسَى أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ)۔ اور جب وہ بغیر ارادے کے بھلائی کرنے والا ہے، تو وہ ان لوگوں میں سے ہے جن کے ہاتھوں اللہ نے زید کے لیے بھلائی جاری کی۔ پس اس کا بدلہ اس شخص کا بدلہ ہوگا جسے بغیر ارادے کے کسی کے حق میں نیک عمل کی توفیق ملی، جس کی اس نے غیبت کی۔ لیکن یہ اس ذات کا مقصود تھا جس نے اسے اس کا الہام کیا اور اس کے حق میں اسے فجور کا نام دیا۔ پس اللہ قیامت کے دن اپنے بندوں کے درمیان صلح کرائے گا، جب مظلوم اس بھلائی کو دیکھے گا جو اس کے بھائی کے ہاتھوں اس تک پہنچی، تو وہ اس پر اس کا شکریہ ادا کرے گا، پس وہ دونوں کامیاب ہو جائیں گے۔ اور صحیح حدیث میں ہے: \"پس اللہ سے ڈرو اور اپنے باہمی تعلقات کو درست کرو\" (فَاتَّقُوا اللَّهَ وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ)۔ کیونکہ اللہ قیامت کے دن اپنے بندوں کے درمیان صلح کرائے گا۔ پس غیبت اگرچہ مذموم ہے، لیکن اس پہلو سے جس کی غیبت کی گئی اس کے حق میں محمود ہے۔ پس اس کا انجام خیر کی طرف مائل ہوا، کیونکہ ان دونوں کے درمیان حائل ڈھال اور وقایہ ذات حق (الحق) اور ذات حق (الحق) ہے۔ اور غیبت وجود ہے، نہ کہ عدم۔ پس موجودین کے درمیان تناسب واقع ہوا، اور کمزور قوی میں شامل ہو گیا۔ پس یہ جان لو۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "(باب صد و پانزدهم در معرفت غیبت و ستوده و نکوهیده آن)\n\nچون حق (الحق) از عزت خویش فرود آید *** به منزل گرسنگی و رحمت\nپس آن را بر همان حد که گفته است بگیر *** که به واسطه آن کرامت حاصل شود\nو آن را به جاهل مده *** که در جایگاه پشیمانی قرار گیری\nحق (الحق) تو را در ذکر خویش پنهان کرد *** به آنچه نگفته است و آن شومی است\nو اگرچه حق است، اما *** اگر گوینده‌ای آن را بگوید، گوید: بس کن!\n\n[غیبت، ذکر غایب است به گونه‌ای که اگر بشنود، ناخوشایندش آید]\n\nبدان، خداوند آنچه را که به تو می‌شنواند، بفهماند، که غیبت (الغيبة) ذکر غایب است به گونه‌ای که اگر بشنود، ناخوشایندش آید، و این بر مؤمنان حرام است. پس حق (الحق) غیبت نمی‌کند، زیرا او در نفس‌الامر و نزد دانایان به او، شنوا و بینا (السمیع البصیر) است. و او آنچه را که از بندگانش ناخوش می‌دارد و آنچه را که می‌ستاید، برای آنان آشکار کرده است. پس برخی از آنان ایمان آوردند و برخی کافر شدند. بنابراین، نه اسم فاعل و نه اسم مفعول نیز غیبت نمی‌کند.\n\n[مواطن مخصوصی که در آنها غیبت واجب است]\n\nغیبت بر مکلفین در میان خودشان حرام است، و اهل مروت (أهل المروءات) از غیر مؤمنان نیز به دلیل نزاهت و شرافت نفس از آن دوری می‌کنند، زیرا دوری از آن نشان‌دهنده کرامت اصول است. مگر در مواطن مخصوصی که در آنها واجب و موجب تقرب به خداوند است. و اهل ورع از مؤمنان به آن تعریض می‌کنند و تصریح نمی‌نمایند. از جمله این موارد، در طریق جرح (الجرح) است که محدثان در مورد راویان احکام مشروع آن را می‌شناسند. از برخی علمای بالله روایت کرده‌ایم که در این باره به دوستش می‌گفت: «بیا تا در راه خدا غیبت کنیم.» و از جمله آنها، هنگام مشورت در ازدواج (المشورة فی النکاح) است، زیرا مشاور امین شمرده می‌شود و نصیحت واجب است. و از جمله آنها، غیبت مرسله (الغيبة المرسلة) است، و آن این است که اهل زمان خود را غیبت کند بدون تعیین شخص خاصی. و از جمله آنها، غیبت مشایخ از مریدان در حال تربیت است، اگر در آن صلاح مرید باشد و این امر به او برسد. و با وجود ستوده بودن غیبت در این مواطن، عدم تعیین در آنها بهتر از تعیین است.\n\nزیرا پیامبر (صلی الله علیه و سلم) می‌فرماید: «غیبتی در مورد فاسق نیست.» (لا غيبة في فاسق)\n\nاین نهی است نه نفی. اهل ورع این خبر را بر این اساس گرفته‌اند. و طریق تعریض آسان‌تر است. و غیر از این مواطن، غیبت نکوهیده است و باید از آن دوری کرد.\n\n[عدم همان شر است و شر همان عدم]\n\nو از این باب است جرح شهود، هنگامی که مشهودعلیه بداند که آنان به دروغ شهادت داده‌اند. پس بر او واجب است که حق (الحق) و اهل آن را یاری کند و باطل و اهل آن را خوار سازد. و از اینجا برای تو روشن می‌شود که عدم (العدم) همان شر است، زیرا شاهدان دروغ به جانب عدم متمایل شده و آن را بر وجود (الوجود) ترجیح داده‌اند و آنچه را که موجود نیست، به هستی توصیف کرده‌اند. و خداوند آن را بر زبان رسولش از گناهان کبیره (الکبائر) قرار داده است، زیرا مدلول سخن آنان چیزی جز عدم نیست. با این همه، اگر کسی که از اهل طریق خداست، بتواند تعریض کند نه تصریح، تا منظور او فهمیده شود، در صورتی که بداند در آن منفعت دینی وجود دارد، پس باید چنین کند، که این اولی‌تر است و مقصود حاصل می‌شود و زبان به آنچه بر او واجب شده است، بدون فحش در گفتار، وفا کرده است. و این همه تا زمانی است که مؤمن نامیده می‌شود. اما اگر این شخص در مقامی باشد که حق (الحق) گوش و چشم و زبان اوست، حال او غیر از حال مؤمن است، با اینکه او از اهل ایمان است.\n\n[داروی عامی و داروی مَلَکی]\n\nو بدان که خداوند متعال هیچ دردی را نیافرید مگر اینکه برای آن درمانی آفرید. و داروها بر دو نوع‌اند: داروی عامه (دواء العامة) که هر کسی می‌تواند آن را تهیه کند، و داروی دیگر، داروی مَلَکی (دواء الملکی) است که به دلیل نفیس بودن و گرانی قیمت، تنها پادشاهان و ثروتمندان می‌توانند آن را تهیه کنند. پس تنها کسی که تمکن مالی و سلطه دارد، می‌تواند آن را به دست آورد. اهل طب نیز داروها را اینگونه تقسیم کرده‌اند و در این امر به حق رسیده‌اند. اما داروی عام سودمند که در توان هر کسی از غنی و فقیر و عامی و پادشاهان است، برای درمان همه گناهان و معاصی، همان توبه (التوبة) است و از شروط آن، راضی کردن خصوم است، در مواردی که می‌تواند آن را انجام دهد و شارع آن را بر او معین کرده است، اگر آن درد از مواردی باشد که باید خصوم در آن راضی شوند. و اگر از مواردی باشد که نباید، پس توبه کند و خصم خود را راضی نکند، زیرا اگر او را راضی کند، ممکن است در محظوری شدیدتر از آنچه توبه کرده بود، واقع شود. پس نباید از این غافل شود.\n\n[داروی مَلَکی را جز عارفان به کار نمی‌برند]\n\nاما داروی مَلَکی (الدواء الملکی) را جز عارفان (العارفون) و سادات از مردان خدا (رجال الله) به کار نمی‌برند، و آنان کسانی هستند که حق (الحق) گوش و چشم و زبانشان است. و این همان سخن اوست پس از فرموده: «و بعضی از شما غیبت بعضی دیگر را نکند، آیا کسی از شما دوست دارد که گوشت برادر مرده‌اش را بخورد؟ پس آن را ناخوش داشتید.» (و لا يَغْتَبْ بَعْضُكُمْ بَعْضاً أَ يُحِبُّ أَحَدُكُمْ أَنْ يَأْكُلَ لَحْمَ أَخِيهِ مَيْتاً فَكَرِهْتُمُوهُ) این خطاب عام است. سپس فرمود: «و از خدا پروا کنید.» (واتَّقُوا الله) این همان داروست و معنای آن این است که آن را سپری (وقایة) قرار دهید میان خود و این امور نکوهیده که غیبت از جمله آنهاست. پس هنگامی که آن را سپر قرار دادید، تیرهای این افعال به این سپر برخورد می‌کنند، و این سپر قوی است و این تیرها در آن نفوذ نمی‌کنند. پس پرهیزکار در پناه آن خواهد بود. و حق (الحق) برای بنده وقایه نخواهد بود مگر اینکه بنده به آن متلبس شود، همان‌گونه که کسی که خود را حفظ می‌کند، به سپرهای زره محکم و غیره متلبس می‌شود. و صورت تلبس او این است که حق (الحق) گوش و زبان و همه قوای او و جوارحش در حال تصرف در آنچه برای آن هستند، باشد، پس او تماماً نور باشد.\n\n[تذکر در قرآن بر داروی مَلَکی سلطانی]\n\nپس خداوند در کتاب خود بر این دردهای مَلَکی سلطانی (أدواء الملکیة السلطانیة) تذکر داده است، مانند فرموده او: «پس فجور و تقوای آن را به او الهام کرد.» (فَأَلْهَمَها فُجُورَها وتَقْواها) و غیبت از فجور است، و «تقوای آن» (وتَقْواها) یعنی آنچه را که سپر و وقایه از این فجور قرار می‌دهد. و فجور را از اوصاف نفس قرار نداد، بلکه آن را مجعول در نفس از جانب الهام‌کننده قرار داد، همان‌گونه که این امر را با فرموده خود تأیید کرد: «آیا کسی که بدی عملش برای او آراسته شده و آن را نیکو می‌بیند [مانند کسی است که هدایت یافته]؟» (أَ فَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَناً) پس آراستن را به او نسبت نداد، بلکه فرمود: «ما اعمالشان را برایشان آراستیم.» (زَيَّنَّا لَهُمْ أَعْمالَهُمْ) و فرمود: «شیطان اعمالشان را برایشان آراسته و آنان را از راه بازداشت.» (زَيَّنَ لَهُمُ الشَّيْطانُ أَعْمالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ) و هنگامی که آراستن را به خود سبحانه نسبت داد، فرمود: «پس آنان سرگردانند.» (فَهُمْ يَعْمَهُونَ) و حیرت از صفات اکابر است. و صفت حیرت در چنین موردی این است که امر در ایجاد آن برای الهام‌کننده و آراینده است، و کسی که در او الهام و آراستگی قرار داده شده، مأمور به دوری از آن است، و آن متصف شدن به چیزی است که به او الهام شده و آراسته گشته، پیش از آنکه بالفعل ظاهر شود. پس نکوهیده است اما مورد مؤاخذه قرار نمی‌گیرد تا زمانی که در ظاهر به آن متلبس شود. سپس در اموری از این باب فرمود: «پلیدی و از عمل شیطان است، پس از آن دوری کنید.» (إِنَّهُ رِجْسٌ مِنْ عَمَلِ الشَّيْطانِ فَاجْتَنِبُوهُ) و شیطان همان دور از رحمت است. «پس از آن دوری کنید.» (فَاجْتَنِبُوهُ) یعنی با اسم نزدیک به رحمت باشید. و از اسماء سبحانه، البعید (دور) است. پس هر کس تقوا را سپر و وقایه قرار دهد، همان‌گونه که امر شده است، این چیزها به او ضرر نمی‌رساند. زیرا خداوند متعال او را به استفاده از این داروها متذکر نساخت مگر برای اقامه عذر از جانب او، اگر در مورد چنین چیزی مورد سؤال قرار گیرد. و مؤمن پشت سپر خود غایب است، پس در پناه است و از پناه خود خارج نمی‌شود. و فاسقی که غیبتی در مورد او نیست، پشت سپر خود غایب نیست، بلکه از آن خارج است، زیرا فسوق به معنای خروج است.\n\nپس فرمود: «غیبتی در مورد فاسق نیست.» (لا غيبة في فاسق)\n\n[هر کس غایبی را که شایسته غایب بودن است، به شهادت آورد، خطا کرده است]\n\nپس هر کس غایبی را که شایسته غایب بودن است، به شهادت (شهادة) آورد، خطا کرده است. و به همین دلیل غیبت را به ما نسبت داد و فرمود: «و بعضی از شما غیبت بعضی دیگر را نکند.» (ولا يَغْتَبْ بَعْضُكُمْ بَعْضاً) پس ما را نشأتی واحد دارای اجزاء (نشأة واحدة ذات أبعاض) قرار داد، زیرا جزء و تفصیل تنها بر کل وارد می‌شود. پس ما از خود خارج نشدیم و جز در خود واقع نشدیم. از این رو، امر را بر ما در این باره سخت گرفت. زیرا کسی که خود را می‌کشد، بهشت بر او حرام می‌شود، و بهشت همان پوشاننده است، زیرا شیء از خودش پوشیده نمی‌ماند. و هر کس غایبی را ذکر کند، او را به شهادت (حضور) تبدیل کرده و او را از موطن خود غریب ساخته است، و مرگ غریب شهادت است.\n\n[غیبت‌کننده فاعل خیر در حق کسی است که غیبت او را کرده، اگرچه آن را ناخوش دارد]\n\nپس غیبت‌کننده در حق کسی که غیبت او را کرده، فاعل خیر است، اگرچه او آن را ناخوش دارد. پس در آن منفعتی است، مانند نوشیدن داروی ناگوار. «و بسا چیزی را ناخوش دارید و آن برای شما خیر است.» (وعَسى‏ أَنْ تَكْرَهُوا شَيْئاً وهُوَ خَيْرٌ لَكُمْ) و اگر فاعل خیر بدون قصد باشد، او از کسانی است که خداوند خیر را برای زید به دست او جاری ساخته است. پس جزای او جزای کسی است که برای انجام کار خیری بدون قصد در حق کسی که غیبت او را کرده، توفیق یافته است. اما آن کار برای کسی که آن را به او الهام کرده و در حق او فجور نامیده، مقصود بوده است. پس خداوند در روز قیامت میان بندگانش صلح برقرار می‌سازد، زیرا مظلوم خیری را که به دست برادرش به او رسیده، می‌بیند، پس او را بر آن شکر می‌کند و هر دو سعادتمند می‌شوند. و در خبر صحیح آمده است: «پس از خدا پروا کنید و میان خود صلح برقرار سازید.» (فَاتَّقُوا الله وأَصْلِحُوا ذاتَ بَيْنِكُمْ) زیرا خداوند در روز قیامت میان بندگانش صلح برقرار می‌سازد. پس غیبت اگرچه نکوهیده است، اما از آن جهت در حق کسی که غیبت او شده، ستوده است. پس عاقبت آن به خیر می‌انجامد، زیرا سپر و وقایه حائل میان آن دو، حق (الحق) است و حق (الحق) است، و غیبت وجودی است که عدم نیست. پس تناسب (التناسب) میان دو موجود واقع شد و ضعیف‌تر در قوی‌تر مندرج گشت. پس این را بدان. «و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند.» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 3
}