{
  "id": 284,
  "title": {
    "ar": "الباب الرابع والثمانون ومائتان في معرفة منزل المجاراة الشريفة وأسرارها من الحضرة المحمدية",
    "en": "Chapter Two Hundred and Eighty-Four: Concerning the Knowledge of the Station of Noble Concurrence (منزل المجاراة الشريفة) and its Secrets derived from the Muhammadan Presence (الحضرة المحمدية)",
    "ur": "باب دو سو چوراسی (۲۸۴): شریف مجارات (al-Mujārāh ash-Sharīfah) کی منزل اور الحضرة المحمدية (al-Ḥaḍrah al-Muḥammadiyyah) سے اس کے اسرار کی معرفت کے بیان میں",
    "fa": "باب دویست و هشتاد و چهارم در معرفت منزل مجارات (المجاراة) شریف و اسرار آن از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب الرابع والثمانون ومائتان في معرفة منزل المجاراة الشريفة وأسرارها من الحضرة المحمدية»\n\n\n> تجارت جياد الفكر في حلبة الفهم *** تحصل في ذاك التجاري من العلم‏\n\n\n> بأسرار ذوق لا تنال براحة *** تعالت عن الحال المكيف والكم‏\n\n\n> أغار على جيش الظلام صباحها *** فأسفر عن شمسي وأعلن عن كتمي‏\n\n\n> وأورى زناد الفكر نارا تولدت *** من الضرب بالروح المولد عن جسم‏\n> فقمت على ساق الثناء ممجدا *** فجاءت بشارات المعارف بالختم‏\n\n\n> فسبحان من أحيا الفؤاد بنوره *** وخصصني بالأخذ عنه وبالفهم‏\n\n\nمن هذا الباب قوله تعالى أُولئِكَ يُسارِعُونَ في الْخَيْراتِ وهُمْ لَها سابِقُونَ والناطق الذي يقوم للذاكرين في قلوبهم وما هو بحكمهم من دوام الذكر الذي يكونون عليه من غير إن يتخلله فترة فيسمعون ناطقا في قلوبهم يذكر الله فيهم وهم سكوت أو في حديث من أحاديث النفوس وما يعرفون من ينطق فيهم فذلك الناطق هو القائل لموسى صلى الله عليه وسلم إني أنا الله لا إله إلا أنا ويسمى هذا النطق نطق القلب وهو الناطق عندهم وطائفة تقول إنه ملك خلقه الله من ذكره الذي كان عليه وأسكنه فيه ينوب عن هذا العبد في ذكره في أوقات غفلاته المتخللة بالذكر فإن استمرت غفلاته وترك الذكر فقد هذا الناطق ومن الناس من يرى فيه إن الحق أسمعه نطق قلبه الذي في صدره الذي هو عليه دائما خرق عادة كرامة لهذا الشخص من الله حيث أسمعه نطق قلبه ليزيد إيمانا بنطق جوارحه كما قال لِيَزْدادُوا إِيماناً مَعَ إِيمانِهِمْ بما جاء من نطق جوارحهم في آخر الزمان وفي الدار الآخرة\n\n\nقال رسول الله صلى الله عليه وسلم لا تقوم الساعة حتى يكلم الرجل فخذه‏\n\n\nبما فعل أهله وحتى يكلم الرجل عذبة سوطه وقال الله تعالى وتُكَلِّمُنا أَيْدِيهِمْ وتَشْهَدُ أَرْجُلُهُمْ بِما كانُوا يَكْسِبُونَ وقال وما كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ ولا أَبْصارُكُمْ ولا جُلُودُكُمْ ولكِنْ ظَنَنْتُمْ أَنَّ الله لا يَعْلَمُ كَثِيراً مِمَّا تَعْمَلُونَ وقال هؤلاء يوم القيامة لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنا فقالت الجلود أَنْطَقَنَا الله الَّذِي أَنْطَقَ كُلَّ شَيْ‏ءٍ ومن زاد على مرتبة هذا الذاكر الذي سمع نطق قلبه بسمعه أسمعه الله نطق جسده كله بل نطق جميع الجمادات والنباتات والحيوانات فأما الحيوانات فقد يسمع نطقها ويفهم ما تقول بغير طريق الذكر بل بخاصية لحم حيوان أو مرقة لحمه يطلع آكله أو شارب مرقته على غيوب ما يحدث الله في العالم من الحوادث الجزئية والعامة ويسمع ويفهم ما تنطق به جميع الحيوانات وقد رأيت من رأى من أكل من لحم هذا الحيوان وشرب من مرقته فكانت له هذه الحالة فكان من رآها منه يتعجب ويكون هذا الحيوان في البرية التي بين مكة والعراق لكن خارجا عن طريق الركب بأيام في غيضة عظيمة وشكل هذا الحيوان شكل امرأة تتكلم باللسان العربي يخرج إليها عرب تلك البرية وهم قبيلة معروفة في كل سنة يوما معلوما يأتون إلى تلك الغيضة بأيديهم الرماح فيقفون على أفواه سكك تلك الغيضة وتدخل طائفة منهم في الغيضة يتفرقون فيها بالصياح ويلحون في الطلب على هذا الحيوان لينفروه فيخرج هذا الحيوان عند ذلك هاربا شاردا أما على بعض تلك الأفواه فإن تمكن منه الواقف على تلك السكة طعنة بالرمح فقتله وإن فاته وتوغل في البرية رجعوا إلى مثل ذلك اليوم من السنة المستقبلة هكذا في كل عام فإذا ظفروا به قطعوه وقسموا لحمه على الحي كله وطبخ كل واحد منهم قطعته وأكلها وشرب مرقتها وأطعم منها من شاء من أهله وبيته وإن كان عندهم غريب ممن قد انقطع من الركب وتاه وحصل عندهم وصادف ذلك اليوم منعوه من أكل لحمها أو شرب مرقتها إلا أن يتناوله بسرقة من غير علم منهم فإن علموا به استفرغوه جبرا بالقي‏ء المفرط فينقص فعل ذلك اللحم منه ولا يذهب بالكلية ويبقى عليه بقية من علم الغيوب فسبحان من أخفى علم ما أودعه في مخلوقاته عن بعض مخلوقاته لا إله إلا هو العليم الحكيم وكل ما ذكره من ذكره في معنى هذا الناطق وحقيقته فصحيح فإنه قد يكون هذا الناطق عين قلبه وقد يكون ملكا يخلق من ذكره وقد يكون روحا يستلزمه وقد يكون ما أومأنا إليه والفرقان بين ما أومأنا إليه وبين ما قاله غيرنا في تعيينه أنه يحادثه ويخاطبه بما شاء من التعريفات الإلهية والكونية أي بما يتعلق بمعرفة الله وبما يتعلق بالمخلوقين إذا استمر على ذكره ودام على طاعة ربه وهو الذي قال لصاحب المواقف ما حكاه عنه في مواقفه من القول إن لم يكن هو رحمه الله قد نبه على مراتب علوم فقال لي وقلت له فإن بعض العارفين قد يفعل هذا إذ لم يروا قائلا في الوجود غير الله حالا ولفظا وكله علم محقق غير أنه إذا كان تعبيرا عن مراتب علوم فيتوهم السامع منه إذا قال صاحب هذا المقام قال لي وقلت له إن الحق يكلمه فإن سأله السامع عرفه بالأمر فإنهم أهل صدق إذا كان السائل مؤمنا بما يقوله أهل طريق الله فإن كان مترددا في إيمانه بذلك فإنه يسكت عنه في ذلك إن كان ممن لا تلزمه طاعته شرعا فإن كان ممن تلزمه طاعته شرعا وليست عنده أهلية لذلك قال له‏\nإنما هي عبارات أحوال ونطق حال لا نطق مقال كما تقول الأرض للوتد لم تشقني فيقول لها الوتد سل من يدقني يعني الدقاق الذي يدق به الوتد وهذا لسان حال معلوم يضرب مثلا معروفا بين الناس ثم لتعلم بعد أن بينت لك هذا أن المسارع إلى الخيرات السابق لها إن كان يريد المشاهد الإلهية والعلوم الربانية فليكثر سهر الليل وليكثر فيه الجمعية دائما فإن لاحت له أنوار متفرقة يتخللها ظلمة ما بين كل نور ونور ولا يكون لتلك الأنوار بقاء تكون سريعة الذهاب فتلك أول علامات القبول والفتح فلا يزال تظهر له تلك الأنوار الشريفة بالمجاهدات والمسارعة فيها وإليها إلى أن يطلع له نور أعظم فإنه يكشف به الموانع التي تمنع الناس من نيل هذه العلوم ويكشف أسرارا في مقاماتها ليس فيه منها شي‏ء ولا هو موصوف بها فيكشف له عن أعماله التي كان عليها من أذكاره ورياضاته ومجاهداته قد أنشأها الله خلقا روحانيا فتسابق إلى أخذ تلك الأسرار كما يسبق هو بها فيأخذها وتكسو عاملها بها جزاء وفاقا له حيث كان سببا لوجود أعيان ذلك الخلق الذين هم عين أفعاله البدنية من نطق وحركة وكان الحضور أرواح تلك الصور العملية فيتصف العامل عند ذلك بالعلم بتلك العلوم والأسرار هكذا يشاهدها إذا أشهدها وقد يجد تلك العلوم من خلف حجاب الغيب ولا يطلع على الأمر كيف كان وهو كما ذكرنا قال القائل‏\n\n\n> جيش إذا عطس الصباح على العدي *** كانت إغارة خيله تشميتا\n\n\nويشاهد موافقات بين صورتك العلوم وبين صور هذه الأعمال من أجل انتظار الأذن الإلهي في ذلك فإن كان العامل ممن قد أراد الله أن يفتح له في الدنيا في حصول هذه الأسرار ورد الأذن الإلهي بذلك ففتح على هذا العامل في باطنه بعلوم شتى فيقال فلان قد فتح عليه وإن كان الله يريد أن يخبأ له ذلك إلى الدار الآخرة لمصلحة يراه له في منع ذلك لم تمكن صور الأعمال من خلع تلك العلوم على العامل لكن تلبسها الأعمال إلى أن ينقلب العامل إلى الدار الآخرة فيجدها مخبوءة له في أعماله فيلبسها خلعا إلهية فيقال في هذا العامل في الدنيا إنه ما فتح له مع كثرة عمله ويتعجب المتعجبون من ذلك لأنهم يتخيلون أن الفتح أمر لازم وكذلك هو أمر لازم تطلبه الأعمال وتناله ولكن متى يكون ذلك صفة للعامل هل في الدنيا أو في الآخرة ذلك إلى الله فإذا رأيت عامل صدق أو عرفت ذلك من نفسك ولم تر يفتح لك في باطنك مثل ما فتح لمن تراه على صورتك من العمل فلا تتهم فإنه مدخر لك واطرح عن نفسك التهمة في ذلك فلا تتهم ولا تجعل نفسك من أهل التهم وقل كما قلت في ذلك‏\n\n\n> ما أنا من أهل التهم *** ولا أنا ممن اتهم‏\n\n\n> وإنني إن قلت لا *** أقول من بعد نعم‏\n\n\n> ولا أقول عكس ذا *** فإنني بحر خضم‏\n\n\n> وإنني ابن حاتم *** بيت السماح والكرم‏\n\n\n> فكم لنا مآثر *** منصوبة مثل العلم‏\n\n\n> ليهتدي بضوئها *** في عرب وفي عجم‏\n\n\n> معلومة مشهورة *** مذكورة بكل فم‏\n\n\n> محبوبة مشكورة *** سارية وكم وكم‏\n\n\nوما أحسن قول القائل في مثل ما قلت‏\n\n\n> وإني إذا أوعدته أو وعدته *** لمخلف إيعادى ومنجز موعدي‏\n\n\nوهذا من الكرم الإلهي أنه جعل مانعا في مقابلة الوعيد وإنفاذه وهو العفو والتجاوز ولم يجعل للوعد بالخير مانعا من اسم إلهي وإذا كانت حالة العبد من الكرم بهذه المثابة فالجناب الإلهي أحق بهذه الصفة وإنما نبهت على إنني ابن حاتم من أجل الكرم الذي جبلت عليه ولي فيه الأصل المؤثل مثل ما قيل‏\n\n\nإن الجياد على أعراقها تجري‏\n\n\nوالأعراق هي الأصول جمع عرق وهو الأصل في لسان العرب و\n\n\n### [أن العارفين يعاملون المواطن بحسب ما تقتضيه‏]\n\n\nاعلم أن العارفين يعاملون المواطن بحسب ما تقتضيه وغير العارفين ليس كذلك فالعارف إن أظهر للناس ما منحه به ربه من المعارف والأسرار لا يظهر ذلك إلا من أجل ربه لا على طريق الفخر على أبناء جنسه فحاشاه من ذلك كما\n\n\nقال صلى الله عليه وسلم حين أمر أن يعرف الناس بمنزلته أنا سيد ولد آدم هذا الذي قيل له قل ثم قال من نفسه ولا فخر\n\n\nيقول إني ما قصدت بهذا الكلام الفخر ولكن عرفتكم بالمقام الإلهي عن الأذن وأما إذا كان تعريف العارف منزلته للناس عن غير أمر إلهي ولا إذن رباني فإنه هوى نفس بتأويل ظهر له‏\nوهي زلة وقعت منه ينبغي له أن يتعوذ بالله من شرها فإن الموطن الدنياوي لا يقتضي الفتح ولا التعريف بالمقام إلا للأنبياء خاصة إذا أرسلوا وأما الأولياء فحصرتهم العبودية المحضة فهم في ستر مقامهم وحالهم لربهم لا لأنفسهم أي من أجل ربهم وإنهم حاضرون في ذلك مع ربهم وإن كان العارف من حيث إنسانيته ونفسه محبا في الثناء عليه بمنزلته من سيده ليظهر بذلك الشفوف على أبناء جنسه وهو معذور فأي فخر أعظم من الفخر بالله ولكن العبد الخالص له الدين الخالص والدين الخالص هو ما يجازيه به ربه من ثنائه عليه بلسان الحق وكلامه لا بلسان المخلوقين فهو يحب الثناء من الله ليعلم بإعلام الله إياه أنه ما أخل بشي‏ء مما يقتضيه مقام العبودية أو يستحقه مقام الربوبية ليكون من نفسه على بصيرة فقد أحب ما تقتضيه إنسانيته ونفسه من حب الثناء ولكن من الله لا من المخلوق ولا من نفسه على نفسه عند المخلوقين فإنه على غير بصيرة فيه ولا إذن من ربه في ذلك كما أنه يحب المال لما يستلزمه من الغني عن الافتقار إلى المخلوقين فمن كان غناه بربه فهو ماله إذ المال ليس محبوبا لنفسه ولا لادخاره من غير توهم رفع الحاجة بوجوده فاعلم ذلك فجميع النفوس محبة للمال في الظاهر وهو الغني في المعنى فبأي شي‏ء وقع الغني في نفس العبد فهو المال المحبوب عنده بل لكل نفس وفي ذلك قلت‏\n\n\n> بالمال ينقاد كل صعب *** من عالم الأرض والسماء\n\n\n> فحبسه عالم حجاب *** لم يعرفوا لذة العطاء\n\n\nومنها أعني من هذه القصيدة\n\n\n> لا تحسب المال ما تراه *** من عسجد مشرق لرائي‏\n\n\n> بل هو ما كنت يا بنى *** به غنيا عن السواء\n\n\n> فكن برب العلي غنيا *** وعامل الحق بالوفاء\n\n\nومن هذا المنزل تعلم يا بنى ما أكنته القلوب من الأمور وما يجري فيها من الخواطر وما تحدث به نفوسها على طريق الإحصاء لها فيما مضى حتى إن المتحقق بهذا المنزل يعرف من الشخص جميع ما تضمنه قلبه وما تعلقت به إرادته من حين ولادته وحركته لطلب الثدي إلى حين جلوسه بين يديه مما لا يعرفه ذلك الشخص من نفسه لصغره ولما طرأ عليه من النسيان وعدم الالتفات لكل ما يطرأ في قلبه وما تحدثه به نفسه لقدم الزمان فيعرفه صاحب هذا المنزل منه معرفة صحيحة لا يشك ولا يرتاب فيها لا من نفسه ولا من كل من هو بين يديه أو حاضر في خاطره وهو حال يطرأ على العبد وهذا المنزل قد سمعنا من أحوال أبي السعود بن الشبل أنه كان له حدثنا صاحبنا أبو البدر رحمه الله أن الشيخ عبد القادر ذكر بين يدي أبي السعود وأطنب في ذكره والثناء عليه وكان القائل قصد به تعريف الشيخ أبي السعود والحاضرين بمنزلة عبد القادر وأفرط فقال له الشيخ أبو السعود كم تقول أنت تحب أن تعرفنا بمنزلة عبد القادر كالمنتهر له والله إني لا عرف حال عبد القادر كيف كان مع أهله وكيف هو الآن في قبره وهذا لا يعلم إلا من هذا المنزل ولكن لا يحصل له هذا التحصيل الكامل إلا في الرجوع من الحق إلى رؤية المخلوقين بعين الله وتأييده لا بعينه وقوته ومن هذا المنزل أيضا يعلم كم حشر يحشر فيه الإنسان فاعلم إن الروح الإنساني أوجده الله حين أوجده مدبرا لصورة طبيعية حسية له سواء كان في الدنيا أو في البرزخ أو في الدار الآخرة أو حيث كان فأول صورة لبستها الصورة التي أخذ عليه فيها الميثاق بالإقرار بربوبية الحق عليه ثم إنه حشر من تلك الصورة إلى هذه الصورة الجسمية الدنياوية وحبس بها في رابع شهر من تكوين صورة جسده في بطن أمه إلى ساعة موته فإذا مات حشر إلى صورة أخرى من حين موته إلى وقت سؤاله فإذا جاء وقت سؤاله حشر من تلك الصورة إلى جسده الموصوف بالموت فيحيا به ويؤخذ بأسماع الناس وأبصارهم عن حياته بذلك الروح إلا من خصه الله تعالى بالكشف على ذلك من نبي أو ولي من الثقلين وأما سائر الحيوان فإنهم يشاهدون حياته وما هو فيه عينا ثم يحشر بعد السؤال إلى صورة أخرى في البرزخ يمسك فيها بل تلك الصورة هي عين البرزخ والنوم والموت في ذلك على السواء إلى نفخة البعث فيبعث من تلك الصورة ويحشر إلى الصورة التي‏\n\n\nكان فارقها في الدنيا إن كان بقي عليه سؤال فإن لم يكن من أهل ذلك الصنف حشر إلى الصورة التي يدخل بها الجنة والمسئول يوم القيامة إذا فرغ من سؤاله حشر في الصورة التي‏\nيدخل بها الجنة أو النار وأهل النار كلهم مسئولون فإذا دخلوا الجنة واستقروا فيها ثم دعوا إلى الرؤية وبادروا حشروا في صورة لا تصلح إلا للرؤية فإذا عادوا حشروا في صورة تصلح للجنة وفي كل صورة ينسى صورته التي كان عليها ويرجع حكمه لي حكم الصورة التي انتقل إليها وحشر فيها فإذا دخل سوق الجنة ورأى ما فيه من الصور فآية صورة رآها واستحسنها حشر فيها فلا يزال في الجنة دائما يحشر من صورة إلى صورة إلى ما لا نهاية له ليعلم بذلك الاتساع الإلهي فكما لا يتكرر عليه صور التجلي كذلك يحتاج هذا المتجلي له أن يقابل كل صورة تتجلى له بصورة أخرى تنار إليه في تجليه فلا يزال يحشر في الصور دائما يأخذها من سوق الجنة ولا يقبل من تلك الصور التي في السوق ولا يستحسن منها إلا ما يناسب صورة التجلي الذي يكون له في المستقبل لأن تلك الصورة هي كالاستعداد الخاص لذلك التجلي فاعلم هذا فإنه من لباب المعرفة الإلهية ولو تفطنت لعرفت أنك الآن كذلك تحشر في كل نفس في صورة الحال التي أنت عليها ولكن يحجبك عن ذلك رؤيتك المعهودة وإن كنت تحس بانتقالك في أحوالك التي عليها تتصرف في ظاهرك وباطنك ولكن لا تعلم أنها صور لروحك تدخل فيها في كل آن وتحشر فيها ويبصرها العارفون صورا صحيحة ثابتة ظاهرة العين وهذا المنزل منزل الخبرة والمهيمن عليه الاسم الرب وهذه الصور إنما تطلبها الخبرة لإقامة الحجة عليها في موطن التكليف فالعارف يقدم قيامته في موطن التكليف التي يؤول إليها جميع الناس فيزن على نفسه أعماله ويحاسب نفسه هنا قبل الانتقال وقد حرض الشرع على ذلك‏\n\n\nفقال حاسبوا أنفسكم قبل إن تحاسبوا\n\n\nولنا فيه مشهد عظيم عايناه وانتفعنا بهذه المحاسبة فيه فلم تعد علينا في الموطن الذي يحاسب الناس فيه وما أخذت هذا المقام إلا من شيخنا أبي عبد الله بن المجاهد وأبي عبد الله بن قسوم بإشبيلية فإنه كان حالهما وزدت على ابن قسوم في ذلك بمحاسبة نفسي بالخواطر وكان الشيخ لا يحاسب نفسه إلا على الأفعال والأقوال لا غير وهذا القدر كاف في التعريف بما يتضمنه هذا المنزل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ قيل لي قل في آخر كل منزل سبحانك اللهم وبحمدك لا إله إلا أنت أستغفرك وأتوب إليك‏\n\n",
    "en": "The Two Hundred and Eighty-Fourth Chapter: Concerning the Gnosis (معرفة) of the Station (منزل) of Noble Emulation (المجاراة الشريفة) and its Secrets from the Muhammadan Presence (الحضرة المحمدية).\n\nThe steeds of thought raced in the arena of understanding,\nIn that contest, knowledge was attained.\n\nWith secrets of tasting (ذوق) not achieved by ease,\nElevated above the conditioned state (الحال المكيف) and quantity (الكم).\n\nIts morning raided the army of darkness,\nRevealing my sun and declaring my concealment.\n\nThe flint of thought struck a fire that was born\nFrom the striking by the spirit generated from a body.\n\nSo I stood upon the leg of praise, glorifying,\nAnd the glad tidings of gnosis (المعارف) came with the seal.\n\nGlory be to Him who revived the heart with His Light,\nAnd singled me out for receiving from Him and for understanding.\n\nThis chapter is based on the saying of the Real (الحق), exalted is He: <<أُولئِكَ يُسارِعُونَ في الْخَيْراتِ وهُمْ لَها سابِقُونَ>> (Those hasten to the good deeds, and they are the foremost in them).\n\nAnd the Speaker (الناطق) who arises for the rememberers (الذاكرين) in their hearts—which is not due to their own effort in the continuous remembrance (الذكر) they maintain without interruption—they hear a speaker in their hearts mentioning Allah while they are silent, or while they are engaged in some inner discourse (أحاديث النفوس), and they do not know who speaks within them. That Speaker is the one who said to Moses (peace be upon him): <<إني أنا الله لا إله إلا أنا>> (Indeed, I am Allah; there is no deity except Me). This utterance is called the utterance of the heart (نطق القلب).\n\nA group [of Sufis] says that it is an angel created by Allah from the remembrance (ذكره) that the servant maintained, and He placed it within him. It acts on behalf of this servant in his remembrance during the times of his heedlessness (غفلاته) that interrupt his remembrance. If his heedlessness continues and he abandons remembrance, he loses this Speaker.\n\nAmong people are those who believe that the Real (الحق) makes them hear the utterance of their own heart, which is constantly in their chest. This is a breaking of habit (خرق عادة), a divine favor (كرامة) granted by Allah to this person, by making him hear the utterance of his heart, so that his faith may increase through the utterance of his limbs, just as He said: <<لِيَزْدادُوا إِيماناً مَعَ إِيمانِهِمْ>> (that they may increase in faith along with their faith), based on what comes from the utterance of their limbs in the End Times and in the Hereafter.\n\nThe Messenger of Allah (peace and blessings be upon him) said: \"The Hour will not be established until a man's thigh speaks to him about what his family did, and until a man's whip-end speaks to him.\" And Allah, exalted is He, said: <<وتُكَلِّمُنا أَيْدِيهِمْ وتَشْهَدُ أَرْجُلُهُمْ بِما كانُوا يَكْسِبُونَ>> (And their hands will speak to Us, and their feet will bear witness to what they used to earn). And He said: <<وما كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ ولا أَبْصارُكُمْ ولا جُلُودُكُمْ ولكِنْ ظَنَنْتُمْ أَنَّ الله لا يَعْلَمُ كَثِيراً مِمَّا تَعْمَلُونَ>> (And you were not concealing yourselves, lest your hearing, your sight, or your skins testify against you; but you thought that Allah does not know much of what you do). And He said that these [people] will say to their skins on the Day of Resurrection: <<لِمَ شَهِدْتُمْ عَلَيْنا>> (Why did you testify against us?), and the skins will reply: <<أَنْطَقَنَا الله الَّذِي أَنْطَقَ كُلَّ شَيْ‏ءٍ>> (Allah, who makes everything speak, has made us speak).\n\nWhoever surpasses the level of this rememberer who hears the utterance of his heart with his own hearing, Allah makes him hear the utterance of his entire body, and even the utterance of all inanimate objects (الجمادات), plants (النباتات), and animals (الحيوانات). As for animals, one may hear their speech and understand what they say, not through the path of remembrance (الذكر), but through a property in the flesh of a certain animal or the broth of its flesh. The one who eats it or drinks its broth gains knowledge of the unseen matters (غيوب) that Allah brings forth in the world, both specific and general events. He hears and understands what all animals utter. I have seen someone who saw a person who ate the flesh of this animal and drank its broth, and this state came upon him. Those who witnessed it were astonished. This animal is found in the wilderness between Mecca and Iraq, but several days' journey off the main caravan route, in a vast thicket (غيضة عظيمة). The form of this animal is that of a woman who speaks the Arabic language. The Arabs of that wilderness, a well-known tribe, go out to her on a specific day each year. They come to that thicket carrying spears. They stand at the entrances of the paths leading into the thicket, and a group of them enters the thicket, dispersing and shouting, pressing the search for this animal to flush it out. The animal then flees, running wildly, sometimes toward one of those entrances. If the person standing at that entrance manages to reach it, he spears it and kills it. If it escapes and penetrates deeper into the wilderness, they return on the same day the following year. This happens every year. When they capture it, they cut it up and divide its flesh among the entire tribe. Each person cooks his piece, eats it, drinks its broth, and feeds some of it to whomever he wishes among his family and household. If they have a stranger with them—someone who has been separated from the caravan, got lost, and happened to be with them on that day—they prevent him from eating its flesh or drinking its broth, unless he manages to consume it secretly without their knowledge. If they find out, they forcibly make him vomit excessively (بالقيء المفرط). This diminishes the effect of the flesh but does not remove it entirely, and a remnant of the knowledge of the unseen (علم الغيوب) remains with him. Glory be to Him who concealed the knowledge of what He deposited in His creatures from some of His creatures. There is no deity except Him, the All-Knowing (العليم), the Wise (الحكيم).\n\nEverything mentioned by those who discussed the meaning and reality (حقيقته) of this Speaker (الناطق) is correct. For this Speaker may be the heart itself (عين قلبه), or it may be an angel created from his remembrance, or it may be a spirit (روح) that accompanies him, or it may be what we have alluded to. The distinction between what we have alluded to and what others have said in defining it is that [in our case] it converses with him and addresses him with whatever divine and cosmic definitions (التعريفات الإلهية والكونية) it wills—that is, concerning the gnosis of Allah and concerning creatures—if he persists in his remembrance and continues in obedience to his Lord.\n\nThis is the one who spoke to the Master of Stations (صاحب المواقف) what he related from him in his *Mawāqif* (Stations) concerning the saying, unless he (may Allah have mercy on him) was pointing out the levels of knowledge (مراتب علوم) when he said, \"He said to me, and I said to him.\" Some Gnostics (العارفين) do this because they see no speaker in existence (الوجود) other than Allah, whether in state (حالا) or in word (لفظا). All of this is verified knowledge (علم محقق). However, if it is an expression of the levels of knowledge, the listener might assume, when the master of this station says, \"He said to me, and I said to him,\" that the Real (الحق) is speaking to him. If the listener asks him, he clarifies the matter, for they are people of truthfulness, provided the questioner is a believer in what the people of Allah's path say. If the questioner is hesitant in his belief regarding this, the Gnostic remains silent about it, provided the questioner is not someone whose obedience is legally binding upon him. If he is someone whose obedience is legally binding upon him, but he lacks the capacity for this [deep understanding], the Gnostic says to him: \"These are merely expressions of states (عبارات أحوال) and the utterance of a state (نطق حال), not the utterance of speech (نطق مقال), just as the earth says to the peg, 'Why do you pierce me?' and the peg replies, 'Ask the one who drives me,' meaning the hammer (الدقاق) used to drive the peg.\" This is a known language of state (لسان حال معلوم) used as a common proverb among people.\n\nThen, know—after I have clarified this for you—that the one who hastens to good deeds and is foremost in them (المسارع إلى الخيرات السابق لها), if he desires divine witnessing (المشاهد الإلهية) and Lordly sciences (العلوم الربانية), must increase his night vigil and constantly increase his concentration (الجمعية) during it. If scattered lights (أنوار متفرقة) appear to him, interspersed with darkness between each light, and these lights are fleeting and quickly vanish, then these are the first signs of acceptance and opening (الفتح). He must continue to strive (بالمجاهدات) and hasten in and toward these noble lights until a greater light dawns upon him. This light unveils the obstacles (الموانع) that prevent people from attaining these sciences. It unveils secrets in their stations (مقاماتها) of which he himself possesses nothing, nor is he described by them. It unveils to him his own deeds (أعماله) that he performed—his remembrances, spiritual disciplines (رياضاته), and strivings (مجاهداته)—which Allah has brought into existence as spiritual creations (خلقا روحانيا). These creations race to seize those secrets, just as he races with them, and they seize them and clothe their doer with them as a fitting reward (جزاء وفاقا) for having been the cause of the existence of the essences (أعيان) of those creations, which are the very essence of his physical acts, such as speech and movement. The presence (الحضور) is the spirits of those operational forms. The doer is then characterized by the knowledge of those sciences and secrets. This is how he witnesses them if they are made manifest to him. He may also find those sciences from behind the veil of the unseen (حجاب الغيب) without realizing how the matter occurred, which is as we have mentioned.\n\nThe poet said:\nAn army, when the morning sneezes upon the enemy,\nThe raid of its cavalry is a declaration of doom.\n\nHe witnesses correspondences between the forms of the sciences and the forms of these deeds, due to waiting for the divine permission (الإذن الإلهي) in that matter. If the doer is one whom Allah wills to grant the opening (الفتح) in this world by attaining these secrets, the divine permission is issued, and an opening occurs in the doer's inner being (باطنه) with various sciences. It is then said, \"So-and-so has been granted the opening.\" If Allah wills to reserve that for him until the Hereafter, due to a benefit He sees for him in withholding it, the forms of the deeds are not enabled to bestow those sciences upon the doer. Instead, the deeds wear them until the doer transitions to the Hereafter, where he finds them reserved for him within his deeds. He is then clothed in them as divine robes of honor (خلعا إلهية). In this world, it is said of this doer that he was not granted the opening despite his abundant work. Those who are astonished wonder why, because they imagine that the opening (الفتح) is a necessary consequence. And indeed, it is a necessary consequence sought by the deeds and attained by them. But when does this become a characteristic of the doer? Is it in this world or the Hereafter? That is up to Allah. If you see a sincere worker, or if you know this about yourself, and you do not see an opening granted in your inner being (باطنك) like that granted to someone whose work resembles yours, do not accuse yourself [of failure], for it is being stored up for you. Cast off self-reproach in this matter. Do not accuse yourself, and do not count yourself among the people of accusation. Say as I have said concerning this:\n\nI am not among the people of accusation,\nNor am I one who is accused.\n\nAnd if I say 'No,'\nI do not say 'Yes' afterward.\n\nNor do I say the opposite of that,\nFor I am a vast ocean.\n\nAnd indeed, I am the son of Hatim,\nThe house of generosity and nobility.\n\nHow many glorious deeds we have,\nErected like banners,\n\nSo that both Arabs and non-Arabs\nMay be guided by their light.\n\nKnown, famous,\nMentioned by every mouth.\n\nLoved, appreciated,\nFlowing, and how much!\n\nHow excellent is the saying of the poet regarding what I have said:\nAnd indeed, if I threaten him or promise him,\nI break my threat and fulfill my promise.\n\nThis is part of the divine generosity (الكرم الإلهي): that He established an obstacle against the threat and its execution, which is pardon and forgiveness, but He established no obstacle from a divine Name (اسم إلهي) against the promise of good. If the servant's state of generosity is of this magnitude, the Divine Presence (الجناب الإلهي) is more deserving of this attribute. I only mentioned that I am the son of Hatim because of the generosity (الكرم) upon which I was naturally disposed, and I have a deep-rooted origin in it, just as it is said: *Indeed, noble steeds run according to their lineage.* The lineage (الأعراق) refers to the origins (الأصول), the plural of *‘irq* (root/origin) in the Arabic language.\n\n### That the Gnostics (العارفين) Deal with the Stations (المواطن) According to What They Require\n\nKnow that the Gnostics deal with the stations according to what they require, but the non-Gnostics are not like that. If the Gnostic reveals to people the gnosis (المعارف) and secrets granted to him by his Lord, he only reveals it for the sake of his Lord, not out of pride (الفخر) over his fellow humans. Far be it from him to do so. Just as the Prophet (peace and blessings be upon him) said, when commanded to inform people of his rank: \"I am the Master of the Children of Adam.\" This is what he was told to say. Then he added on his own: \"And no boast (ولا فخر).\" He means: I did not intend pride with this statement, but I informed you of the divine station (المقام الإلهي) based on permission (الأذن).\n\nHowever, if the Gnostic informs people of his station without a divine command (أمر إلهي) or Lordly permission (إذن رباني), it is a passion of the soul (هوى نفس) based on an interpretation that appeared to him. This is a slip (زلة) that occurred from him, and he should seek refuge in Allah from its evil. For the worldly station (الموطن الدنياوي) does not necessitate the opening (الفتح) or the disclosure of the station (التعريف بالمقام), except specifically for the Prophets when they are sent. As for the Friends of Allah (الأولياء), pure servitude (العبودية المحضة) confines them. They remain veiled in their station and state for their Lord, not for themselves—that is, for the sake of their Lord—and they are present in that with their Lord.\n\nEven if the Gnostic, from the perspective of his humanity and soul (إنسانيته ونفسه), loves to be praised for his rank by his Master, so that he may appear superior (الشفوف) to his fellow humans, he is excused. For what pride is greater than pride in Allah? However, the pure servant is due pure religion (الدين الخالص), and pure religion is what his Lord rewards him with: His praise of him through the tongue of the Real (لسان الحق) and His speech, not through the tongue of creatures. He loves praise from Allah so that, by Allah's informing him, he may know that he has not failed in anything required by the station of servitude (مقام العبودية) or deserved by the station of Lordship (مقام الربوبية), so that he may be fully aware of himself (على بصيرة). Thus, he has loved what his humanity and soul require—the love of praise—but from Allah, not from creatures, nor from his own self before creatures, for in that he lacks insight (بصيرة) and permission from his Lord.\n\nSimilarly, he loves wealth (المال) for what it entails: freedom from needing creatures (الغني عن الافتقار إلى المخلوقين). So, whoever's wealth is through his Lord, that is his true wealth, since wealth is not loved for its own sake, nor for hoarding it without the expectation of removing need through its existence. Know this. All souls outwardly love wealth, which is richness (الغني) in meaning. Whatever brings richness to the servant's soul is the beloved wealth to him, indeed, to every soul. Concerning this, I said:\n\nBy wealth, every difficulty is subdued,\nFrom the world of the earth and the heaven.\n\nBut hoarding it is the world of the veil,\nThey have not known the pleasure of giving.\n\nAnd from it—I mean, from this poem:\n\nDo not reckon wealth to be what you see\nOf shining gold to the beholder.\n\nRather, it is that by which, O my son,\nYou are rich beyond all else.\n\nSo be rich through the Lord of the High,\nAnd deal with the Real (الحق) with faithfulness.\n\nFrom this station (المنزل), O my son, you learn what hearts conceal of matters, what thoughts (الخواطر) pass through them, and what their souls speak of, by way of comprehensive enumeration (الإحصاء) of what has passed. The one who is realized in this station knows everything contained in a person's heart and everything his will (إرادته) was attached to, from the moment of his birth and his movement to seek the breast, until the moment he sits before him. This includes things that the person himself does not know about himself due to his youth, or due to the forgetfulness (النسيان) that has overcome him, and his lack of attention to everything that occurs in his heart and what his soul speaks of due to the passage of time. The master of this station knows this about him with certain knowledge (معرفة صحيحة), without doubt or suspicion, neither from himself nor from anyone who is before him or present in his mind. This is a state (حال) that comes upon the servant.\n\nWe have heard about the states of Abu al-Su'ud ibn al-Shibl concerning this station. Our companion Abu al-Badr (may Allah have mercy on him) narrated to us that Shaykh Abd al-Qadir was mentioned in the presence of Abu al-Su'ud, and the speaker elaborated on his mention and praise. The speaker intended to inform Shaykh Abu al-Su'ud and those present of Abd al-Qadir's rank and exaggerated in his praise. Shaykh Abu al-Su'ud said to him, as if rebuking him: \"How much do you speak? You wish to inform us of Abd al-Qadir's rank? By Allah, I know the state of Abd al-Qadir, how he was with his family, and how he is now in his grave.\" This knowledge is only attained from this station, but this complete attainment is only achieved upon returning from the Real (الحق) to viewing creatures with the eye of Allah and His support, not with one's own eye and strength.\n\nAlso, from this station, one learns how many gatherings (حشر) a human is gathered into. Know that when Allah brought the human spirit (الروح الإنساني) into existence, He made it the governor of a natural, sensory form (صورة طبيعية حسية) for it, whether in this world, in the Isthmus (البرزخ), in the Hereafter, or wherever it may be. The first form it wore was the form in which the Covenant (الميثاق) was taken from it, affirming the Lordship of the Real (الحق) over it. Then it was gathered (حشر) from that form to this worldly physical form (الصورة الجسمية الدنياوية), and it was confined within it in the fourth month of the formation of its body in its mother's womb until the hour of its death. When it dies, it is gathered to another form from the moment of its death until the time of questioning (سؤاله). When the time of questioning comes, it is gathered from that form to its body described by death, and it is revived by that spirit. People's hearing and sight are veiled from its life by that spirit, except for those whom Allah, exalted is He, singles out for unveiling (الكشف) regarding this, such as a Prophet or a Friend of Allah (ولي) from among the two weighty ones (mankind and jinn). As for the rest of the animals, they witness its life and its state directly. Then, after the questioning, it is gathered to another form in the Isthmus (البرزخ), where it is held. Rather, that form is the very essence of the Isthmus. Sleep and death are equal in that state until the Trumpet of Resurrection (نفخة البعث). It is resurrected from that form and gathered into the form it separated from in the world, if there remains questioning for it. If it is not among that category, it is gathered into the form by which it enters Paradise. The one questioned on the Day of Resurrection, when he is finished with his questioning, is gathered into the form by which he enters Paradise or the Fire. All the people of the Fire are questioned. When they enter Paradise and settle therein, and are then called to the Vision (الرؤية) and hasten to it, they are gathered into a form suitable only for the Vision. When they return, they are gathered into a form suitable for Paradise. In every form, he forgets the form he was previously in, and his ruling reverts to the ruling of the form he transitioned into and was gathered in. When he enters the Market of Paradise (سوق الجنة) and sees the forms within it, whichever form he sees and finds pleasing, he is gathered into it. He will continuously be gathered from form to form in Paradise eternally, without end, so that he may know the divine vastness (الاتساع الإلهي) through this. Just as the forms of Theophany (التجلي) are never repeated for Him, so too does the one to whom the Theophany occurs need to correspond to every form that manifests to him with another form that is illuminated for him in that Theophany. He will thus continuously be gathered into forms, taking them from the Market of Paradise. He will not accept or find pleasing any of those forms in the Market except what is suitable for the form of the Theophany that will occur to him in the future, because that form is like the specific preparedness (الاستعداد الخاص) for that Theophany. Know this, for it is the core of divine gnosis (لباب المعرفة الإلهية). If you were attentive, you would know that you are currently like this: you are gathered in every breath (نفس) into the form of the state (الحال) you are upon, but your habitual vision (رؤيتك المعهودة) veils you from this. Although you sense your transition through the states upon which you operate outwardly and inwardly, you do not know that they are forms for your spirit (روحك) that it enters and is gathered into at every instant. The Gnostics (العارفون) perceive them as true, fixed, manifest forms (صورا صحيحة ثابتة ظاهرة العين).\n\nThis station is the station of Expertise (الخبرة), and the Name that dominates it is the Lord (الرب). These forms are sought by Expertise (الخبرة) to establish the proof (الحجة) against them in the station of obligation (موطن التكليف). The Gnostic brings forward his Resurrection (قيامته) into the station of obligation, which is where all people ultimately arrive. He weighs his deeds upon himself and holds himself accountable here before the transition. The Law (الشرع) has encouraged this, saying: \"Hold yourselves accountable before you are held accountable.\"\n\nWe have a great witnessing (مشهد عظيم) in this, which we experienced and benefited from this self-accountability, so it did not return to us in the station where people are held accountable. I did not take this station except from our Shaykh Abu Abd Allah ibn al-Mujahid and Abu Abd Allah ibn Qasum in Seville. This was their state, and I added to Ibn Qasum's practice by holding myself accountable for inner thoughts (الخواطر), whereas the Shaykh only held himself accountable for actions and words, nothing else. This much is sufficient for defining what this station encompasses. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way). I was told to say at the end of every station: *Glory be to You, O Allah, and with Your praise. There is no deity except You. I seek Your forgiveness and repent to You.*",
    "ur": "باب نمبر دو سو چوراسی: مجاراۃ شریفہ (المجاراة الشريفة) کے مقام اور حضرت محمدیہ (الحضرة المحمدية) سے اس کے اسرار کی معرفت کے بیان میں۔\n\n> فکر کے گھوڑے فہم کے میدان میں دوڑتے ہیں\n> اس دوڑ میں علم حاصل ہوتا ہے\n> ذوق کے ان اسرار کا جو آسانی سے نہیں ملتے\n> جو کیفیت اور کمیت (الكم) والے حال سے بلند ہیں\n> اس کی صبح نے تاریکی کے لشکر پر حملہ کیا\n> تو میری شمس کو روشن کیا اور میرے راز کو ظاہر کیا\n> اور فکر کی چقماق نے آگ روشن کی جو پیدا ہوئی\n> جسم سے پیدا ہونے والی روح کے ٹکرانے سے\n> پس میں ثنا کی ساق پر کھڑا ہوا، بزرگی بیان کرتے ہوئے\n> تو معرفتوں (المعرفة) کی بشارتیں مہر کے ساتھ آئیں\n> پس پاک ہے وہ ذات جس نے دل کو اپنے نور سے زندہ کیا\n> اور مجھے اس سے اخذ کرنے اور فہم کے ساتھ خاص کیا۔\n\nاس باب سے متعلق ذات حق (الحق) کا یہ فرمان ہے: {أُولئِكَ يُسارِعُونَ في الْخَيْراتِ وهُمْ لَها سابِقُونَ} (یہی لوگ نیکیوں میں جلدی کرتے ہیں اور وہ ان میں سبقت لے جانے والے ہیں)۔ اور وہ ناطق (بولنے والا) جو ذاکرین کے دلوں میں قیام کرتا ہے، اور جو ان کے حکم میں نہیں ہوتا، یہ اس ذکر کی ہمیشگی سے ہوتا ہے جس پر وہ قائم رہتے ہیں بغیر کسی وقفے کے۔ پس وہ اپنے دلوں میں ایک ناطق کو سنتے ہیں جو ان کے اندر اللہ کا ذکر کرتا ہے، جبکہ وہ خاموش ہوتے ہیں یا نفوس کی کسی بات چیت میں مشغول ہوتے ہیں، اور وہ نہیں جانتے کہ ان کے اندر کون بول رہا ہے۔ پس وہ ناطق وہی ہے جس نے موسیٰ علیہ السلام سے کہا تھا: {إني أنا الله لا إله إلا أنا} (بے شک میں ہی اللہ ہوں، میرے سوا کوئی معبود نہیں)۔ اس نطق کو نطق القلب (دل کا بولنا) کہا جاتا ہے، اور یہی ان کے نزدیک ناطق ہے۔ ایک گروہ کہتا ہے کہ یہ ایک فرشتہ ہے جسے اللہ نے اس ذکر سے پیدا کیا جو بندہ کر رہا تھا، اور اسے اس میں بسا دیا تاکہ وہ غفلت کے اوقات میں، جو ذکر کے درمیان آتے ہیں، اس بندے کی طرف سے ذکر میں نیابت کرے۔ اگر اس کی غفلتیں جاری رہیں اور اس نے ذکر ترک کر دیا تو یہ ناطق ختم ہو جاتا ہے۔ اور بعض لوگ یہ رائے رکھتے ہیں کہ ذات حق (الحق) نے اسے اس کے سینے میں موجود اس کے دل کا نطق سنایا ہے، جو ہمیشہ اس پر قائم رہتا ہے، یہ اللہ کی طرف سے اس شخص کے لیے کرامت کے طور پر ایک خرق عادت (عادت کو توڑنا) ہے، تاکہ وہ اپنے جوارح کے نطق کے ذریعے اپنے ایمان میں اضافہ کرے۔ جیسا کہ ذات حق نے فرمایا: {لِيَزْدادُوا إِيماناً مَعَ إِيمَانِهِمْ} (تاکہ وہ اپنے ایمان کے ساتھ مزید ایمان میں اضافہ کریں)۔ یہ آخری زمانے میں اور دار آخرت میں ان کے جوارح کے نطق سے آنے والی چیزوں کے ذریعے ہوگا۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"قیامت قائم نہیں ہوگی یہاں تک کہ آدمی کی ران اس سے بات کرے گی کہ اس کے گھر والوں نے کیا کیا، اور یہاں تک کہ آدمی کا کوڑے کا سرا اس سے بات کرے گا۔\" اور اللہ تعالیٰ نے فرمایا: {وتُكَلِّمُنا أَيْدِيهِمْ وتَشْهَدُ أَرْجُلُهُمْ بِما كانُوا يَكْسِبُونَ} (اور ان کے ہاتھ ہم سے کلام کریں گے اور ان کے پاؤں گواہی دیں گے جو کچھ وہ کماتے تھے)۔ اور فرمایا: {وما كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ ولا أَبْصارُكُمْ ولا جُلُودُكُمْ ولكِنْ ظَنَنْتُمْ أَنَّ الله لا يَعْلَمُ كَثِيراً مِمَّا تَعْمَلُونَ} (اور تم اس بات سے چھپتے نہ تھے کہ تمہارے کان، تمہاری آنکھیں اور تمہاری کھالیں تمہارے خلاف گواہی دیں گی، لیکن تم نے گمان کیا کہ اللہ تمہارے بہت سے اعمال کو نہیں جانتا)۔ اور قیامت کے دن یہ لوگ اپنی کھالوں سے کہیں گے: {لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنا} (تم نے ہمارے خلاف کیوں گواہی دی؟) تو کھالیں جواب دیں گی: {أَنْطَقَنَا الله الَّذِي أَنْطَقَ كُلَّ شَيْ‏ءٍ} (ہمیں اس اللہ نے گویائی دی جس نے ہر چیز کو گویائی دی)۔\n\nاور جو شخص اس ذاکر کے مرتبے سے بڑھ جاتا ہے جس نے اپنے کان سے اپنے دل کا نطق سنا، تو اللہ اسے اس کے پورے جسم کا نطق بلکہ تمام جمادات، نباتات اور حیوانات کا نطق بھی سناتا ہے۔ جہاں تک حیوانات کا تعلق ہے، تو ان کا نطق سنا جا سکتا ہے اور ان کی بات کو سمجھا جا سکتا ہے، لیکن یہ ذکر کے طریقے سے نہیں ہوتا، بلکہ کسی خاص حیوان کے گوشت یا اس کے شوربے کی خاصیت سے ہوتا ہے، جسے کھانے یا پینے والا دنیا میں اللہ کی طرف سے ہونے والے جزوی اور عمومی حوادث کے غیوب پر مطلع ہو جاتا ہے، اور وہ تمام حیوانات کے نطق کو سنتا اور سمجھتا ہے۔ میں نے ایسے شخص کو دیکھا ہے جس نے اس حیوان کا گوشت کھایا اور اس کا شوربہ پیا، تو اسے یہ حالت حاصل ہو گئی، اور جو اسے دیکھتا وہ تعجب کرتا تھا۔ یہ حیوان مکہ اور عراق کے درمیان واقع بیابان میں پایا جاتا ہے، لیکن قافلے کے راستے سے کئی دن کی مسافت پر ایک بڑے جنگل میں ہوتا ہے۔ اس حیوان کی شکل ایک عورت جیسی ہے جو عربی زبان میں بات کرتی ہے۔ اس بیابان کے عرب، جو ایک معروف قبیلہ ہے، ہر سال ایک مقررہ دن اس کے پاس جاتے ہیں۔ وہ نیزے لے کر اس جنگل کے راستوں کے دہانوں پر کھڑے ہو جاتے ہیں، اور ان میں سے ایک گروہ جنگل میں داخل ہو کر شور مچاتا ہے اور اس حیوان کو بھگانے کے لیے سختی سے تلاش کرتا ہے۔ جب یہ حیوان بھاگتا ہوا ان راستوں میں سے کسی ایک پر نکلتا ہے، تو اگر اس راستے پر کھڑا شخص اسے قابو کر لے تو نیزے سے مار کر اسے قتل کر دیتا ہے۔ اور اگر وہ بچ نکلے اور بیابان میں گہرا چلا جائے، تو وہ اگلے سال اسی دن واپس آتے ہیں۔ یہ ہر سال اسی طرح ہوتا ہے۔ جب وہ اسے پکڑ لیتے ہیں، تو اسے کاٹ کر اس کا گوشت پورے قبیلے میں تقسیم کر دیتے ہیں۔ ہر شخص اپنا حصہ پکاتا ہے، اسے کھاتا ہے اور اس کا شوربہ پیتا ہے، اور اپنے گھر والوں اور اہل خانہ میں سے جسے چاہے کھلاتا ہے۔ اگر ان کے پاس کوئی اجنبی ہو جو قافلے سے بچھڑ گیا ہو اور بھٹک کر ان کے پاس آ گیا ہو اور وہ دن آ جائے، تو وہ اسے اس کا گوشت کھانے یا شوربہ پینے سے منع کرتے ہیں، الا یہ کہ وہ ان کی لاعلمی میں چوری سے اسے کھا لے۔ اگر انہیں علم ہو جائے تو وہ اسے زبردستی قے کروا کر نکال دیتے ہیں، جس سے اس گوشت کا اثر کم ہو جاتا ہے لیکن مکمل طور پر ختم نہیں ہوتا، اور غیوب کے علم کا کچھ حصہ اس پر باقی رہ جاتا ہے۔ پس پاک ہے وہ ذات جس نے اپنی مخلوقات میں ودیعت کردہ علم کو اپنی بعض مخلوقات سے چھپا رکھا ہے۔ اس کے سوا کوئی معبود نہیں، وہ علیم و حکیم ہے۔\n\nاور جس نے بھی اس ناطق کے معنی اور حقیقت کے بارے میں جو کچھ ذکر کیا ہے، وہ سب صحیح ہے، کیونکہ یہ ناطق عین اس کا دل بھی ہو سکتا ہے، اور یہ ایک فرشتہ بھی ہو سکتا ہے جو اس کے ذکر سے پیدا کیا گیا ہو، اور یہ ایک روح بھی ہو سکتی ہے جو اس کے لیے لازم ہو، اور یہ وہ بھی ہو سکتا ہے جس کی طرف ہم نے اشارہ کیا ہے۔ ہمارے اشارے اور دوسروں کے اس کی تعیین کے بارے میں کہے گئے قول کے درمیان فرق یہ ہے کہ وہ (ناطق) اس سے الٰہی اور کونی (مخلوقات سے متعلق) تعریفات میں سے جو چاہے بات چیت اور خطاب کرتا ہے، بشرطیکہ وہ اپنے ذکر پر قائم رہے اور اپنے رب کی اطاعت پر ہمیشگی اختیار کرے۔ اور یہی وہ ہے جس نے صاحب المواقف سے وہ بات کہی جو انہوں نے اپنی مواقف میں نقل کی ہے، اگرچہ انہوں نے (صاحب المواقف نے) خود علوم کے مراتب پر تنبیہ نہ کی ہو، اور کہا ہو کہ \"اس نے مجھ سے کہا اور میں نے اس سے کہا۔\" کیونکہ بعض عارفین (العارفين) ایسا کرتے ہیں، جب وہ حال اور لفظ کے اعتبار سے وجود میں اللہ کے سوا کسی کہنے والے کو نہیں دیکھتے۔ یہ سب محقق (تحقیق شدہ) علم ہے، لیکن جب یہ علوم کے مراتب کا اظہار ہو، تو سننے والا جب اس مقام کا صاحب کہتا ہے کہ \"اس نے مجھ سے کہا اور میں نے اس سے کہا،\" تو وہ گمان کرتا ہے کہ ذات حق (الحق) اس سے کلام کر رہی ہے۔ اگر سننے والا اس سے سوال کرے تو وہ اسے حقیقت سے آگاہ کر دیتا ہے، کیونکہ وہ سچے لوگ ہیں، بشرطیکہ سائل اہل طریق اللہ کی باتوں پر ایمان رکھنے والا ہو۔ لیکن اگر وہ اس پر ایمان لانے میں متردد ہو، تو وہ اس بارے میں خاموش رہتا ہے، اگر وہ ان لوگوں میں سے نہ ہو جن پر شرعاً اس کی اطاعت لازم ہو۔ اور اگر وہ ان لوگوں میں سے ہو جن پر شرعاً اس کی اطاعت لازم ہو لیکن اس میں اس کی اہلیت نہ ہو، تو وہ اس سے کہتا ہے: \"یہ صرف احوال کی تعبیرات ہیں اور حال کا نطق ہے، نہ کہ مقال (گفتار) کا نطق۔\" جیسا کہ تم کہتے ہو کہ زمین نے میخ سے کہا: \"تو نے مجھے کیوں چیرا؟\" تو میخ نے اس سے کہا: \"اس سے پوچھ جو مجھے ٹھوک رہا ہے،\" یعنی وہ ٹھوکنے والا جو میخ کو ٹھوکتا ہے۔ اور یہ ایک معلوم لسان حال (حالت کی زبان) ہے جو لوگوں کے درمیان ایک معروف مثال کے طور پر بیان کیا جاتا ہے۔\n\nپھر یہ جان لو کہ یہ سب بیان کرنے کے بعد، جو شخص نیکیوں میں جلدی کرنے والا اور ان میں سبقت لے جانے والا ہے، اگر وہ الٰہی مشاہدات اور ربانی علوم کا ارادہ رکھتا ہے، تو اسے رات کا جاگنا زیادہ کرنا چاہیے اور اس میں ہمیشہ جمعیت (توجہ کی یکسوئی) کو زیادہ کرنا چاہیے۔ اگر اسے متفرق انوار (روشنیوں) کا ظہور ہو جن کے درمیان ہر نور اور دوسرے نور کے درمیان تاریکی حائل ہو، اور وہ انوار باقی نہ رہیں بلکہ تیزی سے زائل ہو جائیں، تو یہ قبولیت اور فتح کی پہلی علامتیں ہیں۔ پس وہ ان مجاہدات اور ان میں اور ان کی طرف جلدی کرنے کے ذریعے ان شریف انوار کا ظہور دیکھتا رہے گا، یہاں تک کہ اس پر ایک عظیم نور طلوع ہو جائے۔ اس نور کے ذریعے وہ ان رکاوٹوں کو کشف (الکشف) کرتا ہے جو لوگوں کو ان علوم کے حصول سے روکتی ہیں، اور وہ ان مقامات کے اسرار کو کشف کرتا ہے جن میں سے کوئی چیز اس میں نہیں ہوتی اور نہ ہی وہ ان سے متصف ہوتا ہے۔ پس اس کے لیے اس کے اعمال کا کشف ہوتا ہے جن پر وہ قائم تھا، جیسے اس کے اذکار، ریاضات اور مجاہدات، جنہیں اللہ نے روحانی مخلوق کے طور پر پیدا کر دیا ہے۔ پس وہ (روحانی مخلوق) ان اسرار کو لینے کے لیے سبقت کرتی ہے، جیسا کہ وہ (سالک) ان کے ساتھ سبقت کرتا ہے۔ پس وہ انہیں لے لیتی ہے اور ان کے عامل کو ان کا بدلہ دیتی ہے، کیونکہ وہ ان مخلوقات کے وجود کا سبب بنا جو اس کے بدنی افعال (جیسے نطق اور حرکت) کا عین ہیں۔ اور یہ عملی صورتوں کی ارواح کی حاضری تھی۔ پس اس وقت عامل ان علوم اور اسرار کے علم سے متصف ہو جاتا ہے۔ وہ انہیں اسی طرح دیکھتا ہے جب اسے ان کا شہود (الشهود) کرایا جاتا ہے۔ اور کبھی وہ ان علوم کو غیب کے پردے کے پیچھے سے پاتا ہے اور اس امر پر مطلع نہیں ہوتا کہ یہ کیسے ہوا۔ اور یہ ویسا ہی ہے جیسا کہ ہم نے ذکر کیا ہے۔\n\nکہنے والے نے کہا:\n> ایک لشکر جب صبح دشمنوں پر چھینکتی ہے\n> تو اس کے گھوڑوں کا حملہ تشمیت (رحمت) ہوتا ہے\n\nاور وہ ان علوم کی صورتوں اور ان اعمال کی صورتوں کے درمیان موافقت (ہم آہنگی) کا مشاہدہ کرتا ہے، یہ سب اس میں الٰہی اذن (اجازت) کے انتظار کی وجہ سے ہوتا ہے۔ پس اگر عامل ان لوگوں میں سے ہو جن کے لیے اللہ نے دنیا میں ان اسرار کے حصول میں فتح (کھولنا) کا ارادہ کیا ہے، اور اس کا الٰہی اذن آ گیا، تو اس عامل کے باطن میں مختلف علوم کے ساتھ فتح ہو جاتی ہے، اور کہا جاتا ہے کہ فلاں شخص پر فتح ہو گئی ہے۔ اور اگر اللہ نے اس کے لیے مصلحت کی بنا پر اسے روک کر دار آخرت کے لیے چھپا کر رکھنے کا ارادہ کیا ہو، تو اعمال کی صورتیں ان علوم کو عامل پر پہنانے کے قابل نہیں ہوتیں، بلکہ اعمال انہیں اس وقت تک پہنے رکھتی ہیں جب تک کہ عامل دار آخرت کی طرف منتقل نہ ہو جائے۔ وہاں وہ انہیں اپنے اعمال میں چھپا ہوا پاتا ہے، اور وہ انہیں الٰہی خلعتوں کے طور پر پہنتا ہے۔ اس عامل کے بارے میں دنیا میں کہا جاتا ہے کہ اس کے کثرت عمل کے باوجود اس پر فتح نہیں ہوئی، اور تعجب کرنے والے اس پر تعجب کرتے ہیں، کیونکہ وہ یہ خیال کرتے ہیں کہ فتح ایک لازمی امر ہے۔ اور یہ واقعی ایک لازمی امر ہے جسے اعمال طلب کرتے ہیں اور حاصل کرتے ہیں، لیکن یہ عامل کی صفت کب بنے گا؟ کیا دنیا میں یا آخرت میں؟ یہ اللہ کے سپرد ہے۔ پس اگر تم کسی سچے عامل کو دیکھو، یا اپنے آپ میں یہ بات جانو، اور تم یہ نہ دیکھو کہ تمہارے باطن میں اسی طرح فتح ہوئی ہے جیسا کہ تم اپنے عمل کی صورت میں کسی دوسرے کو دیکھتے ہو، تو خود پر الزام نہ لگاؤ، کیونکہ یہ تمہارے لیے ذخیرہ کیا گیا ہے۔ اور اپنے نفس سے اس الزام کو دور کر دو۔ پس نہ خود پر الزام لگاؤ اور نہ ہی اپنے آپ کو اہل الزام میں سے بناؤ۔ اور کہو جیسا کہ میں نے اس بارے میں کہا ہے:\n\n> میں اہل الزام میں سے نہیں ہوں\n> اور نہ ہی میں ان میں سے ہوں جن پر الزام لگایا گیا\n> اور اگر میں نے \"نہیں\" کہا\n> تو اس کے بعد \"ہاں\" نہیں کہوں گا\n> اور نہ ہی میں اس کے برعکس کہوں گا\n> کیونکہ میں ایک گہرا سمندر ہوں\n> اور میں حاتم کا بیٹا ہوں\n> سخاوت اور کرم کا گھر\n> پس ہمارے کتنے ہی کارنامے ہیں\n> جو جھنڈوں کی طرح نصب ہیں\n> تاکہ عرب اور عجم میں لوگ\n> ان کی روشنی سے ہدایت پائیں\n> وہ معلوم، مشہور ہیں\n> ہر زبان پر مذکور ہیں\n> محبوب، شکر گزار ہیں\n> جاری ہیں اور کتنی ہی ہیں\n\nاور اس کہنے والے کا قول کتنا اچھا ہے جس نے میری طرح کہا:\n> اور جب میں کسی کو دھمکی دوں یا وعدہ کروں\n> تو میں اپنی دھمکی کو توڑنے والا اور اپنے وعدے کو پورا کرنے والا ہوتا ہوں\n\nاور یہ الٰہی کرم (سخاوت) میں سے ہے کہ اس نے وعید (دھمکی) کے مقابلے میں اور اسے نافذ کرنے کے لیے ایک مانع (رکاوٹ) رکھا ہے، جو کہ عفو اور درگزر ہے۔ لیکن وعدہ خیر کے لیے کسی الٰہی اسم کی طرف سے کوئی مانع نہیں رکھا۔ اور جب بندے کی حالت کرم میں اس مرتبے پر ہے، تو الٰہی جناب اس صفت کی زیادہ حقدار ہے۔ اور میں نے یہ تنبیہ کہ میں حاتم کا بیٹا ہوں، صرف اس کرم کی وجہ سے کی ہے جس پر میری فطرت بنی ہے اور جس میں میری مضبوط بنیاد ہے، جیسا کہ کہا گیا ہے:\n\n> بے شک اچھے گھوڑے اپنی نسلوں پر دوڑتے ہیں\n\nاور \"اعراق\" (نسلیں) اصول (بنیادیں) کی جمع ہے، جو عربی زبان میں اصل کو کہتے ہیں۔\n\n### [عارفین (العارفين) مقامات کے تقاضوں کے مطابق معاملہ کرتے ہیں]\n\nجان لو کہ عارفین (العارفين) مقامات کے تقاضوں کے مطابق معاملہ کرتے ہیں، اور غیر عارفین ایسا نہیں کرتے۔ عارف اگر لوگوں پر وہ معرفتیں (المعرفة) اور اسرار ظاہر کرتا ہے جو اس کے رب نے اسے عطا کیے ہیں، تو وہ صرف اپنے رب کی خاطر ظاہر کرتا ہے، نہ کہ اپنے ہم جنسوں پر فخر کرنے کے طریقے پر۔ وہ اس سے پاک ہے۔ جیسا کہ نبی صلی اللہ علیہ وسلم نے فرمایا جب انہیں حکم دیا گیا کہ وہ لوگوں کو اپنے مرتبے سے آگاہ کریں: \"میں اولاد آدم کا سردار ہوں،\" یہ وہ بات ہے جو انہیں کہنے کا حکم دیا گیا، پھر آپ نے اپنی طرف سے فرمایا: \"اور کوئی فخر نہیں۔\" آپ کا مطلب یہ تھا کہ میں نے اس کلام سے فخر کا ارادہ نہیں کیا، بلکہ میں نے تمہیں الٰہی مقام سے اذن (اجازت) کے ذریعے آگاہ کیا ہے۔ لیکن اگر عارف کا لوگوں کو اپنے مرتبے سے آگاہ کرنا کسی الٰہی حکم یا ربانی اذن کے بغیر ہو، تو یہ نفس کی خواہش ہے جو اسے کسی تاویل کے ذریعے ظاہر ہوئی ہے۔ اور یہ اس سے ہونے والی ایک لغزش ہے، اسے چاہیے کہ وہ اس کے شر سے اللہ کی پناہ مانگے۔ کیونکہ دنیاوی مقام فتح (کھولنے) یا مقام کی تعریف کا تقاضا نہیں کرتا، سوائے خاص طور پر انبیاء کے جب انہیں بھیجا جاتا ہے۔ جہاں تک اولیاء کا تعلق ہے، تو انہیں محض عبودیت نے محدود کر رکھا ہے، پس وہ اپنے رب کے لیے اپنے مقام اور حال کے پردے میں رہتے ہیں، نہ کہ اپنے نفس کے لیے۔ یعنی اپنے رب کی خاطر، اور وہ اس میں اپنے رب کے ساتھ حاضر ہوتے ہیں۔ اگرچہ عارف اپنی انسانیت اور نفس کے لحاظ سے اپنے آقا کے ہاں اپنے مرتبے کی تعریف کو پسند کرتا ہے تاکہ اس کے ذریعے اپنے ہم جنسوں پر برتری ظاہر کرے، اور وہ معذور ہے، کیونکہ اللہ پر فخر کرنے سے بڑا فخر کیا ہو سکتا ہے؟ لیکن خالص بندے کے لیے دین خالص ہے، اور دین خالص وہ ہے جس کا بدلہ اس کا رب اسے حق کی زبان اور اپنے کلام سے اس کی تعریف کر کے دیتا ہے، نہ کہ مخلوق کی زبان سے۔ پس وہ اللہ کی طرف سے تعریف کو پسند کرتا ہے تاکہ اللہ کے اسے مطلع کرنے سے وہ جان لے کہ اس نے عبودیت کے مقام کے تقاضوں یا ربوبیت کے مقام کے استحقاق میں کوئی کمی نہیں چھوڑی، تاکہ وہ اپنے نفس کے بارے میں بصیرت پر ہو۔ پس اس نے وہ پسند کیا جو اس کی انسانیت اور نفس تعریف کی محبت سے تقاضا کرتے ہیں، لیکن اللہ کی طرف سے، نہ کہ مخلوق کی طرف سے، اور نہ ہی مخلوق کے سامنے اپنے نفس کی طرف سے۔ کیونکہ اس میں وہ بصیرت پر نہیں ہوتا اور نہ ہی اس کے رب کی طرف سے اس کی اجازت ہوتی ہے۔ جیسا کہ وہ مال کو اس لیے پسند کرتا ہے کہ یہ مخلوق کے سامنے محتاج ہونے سے بے نیازی کو لازم کرتا ہے۔ پس جس کی بے نیازی اس کے رب کے ذریعے ہو، وہی اس کا مال ہے، کیونکہ مال بذات خود محبوب نہیں ہے، اور نہ ہی اسے ذخیرہ کرنا محبوب ہے، جب تک کہ اس کے وجود سے حاجت کے رفع ہونے کا وہم نہ ہو۔ پس یہ جان لو کہ تمام نفوس ظاہری طور پر مال کو پسند کرتی ہیں، اور معنی میں یہ بے نیازی (الغنی) ہے۔ پس جس چیز سے بھی بندے کے نفس میں بے نیازی واقع ہو، وہی اس کے نزدیک محبوب مال ہے۔ بلکہ ہر نفس کے لیے یہی ہے۔ اور اسی بارے میں میں نے کہا:\n\n> مال سے زمین اور آسمان کے عالم کی ہر مشکل چیز مطیع ہو جاتی ہے\n> پس اسے روکنے والا حجاب کا عالم ہے\n> جنہوں نے عطا کی لذت کو نہیں جانا\n\nاور اسی قصیدے میں سے ہے:\n\n> مال کو وہ نہ سمجھو جو تم دیکھتے ہو\n> دیکھنے والے کے لیے چمکتے ہوئے سونے کی طرح\n> بلکہ اے میرے بیٹے! وہ وہ ہے جس کے ذریعے تو\n> غیر سے بے نیاز ہو جائے\n> پس تو بلند رب کے ذریعے بے نیاز ہو جا\n> اور ذات حق (الحق) کے ساتھ وفاداری سے معاملہ کر\n\nاور اے میرے بیٹے! اس مقام سے تم ان امور کو جان سکتے ہو جو دلوں میں چھپے ہوتے ہیں، اور وہ خواطر (خیالات) جو ان میں گزرتے ہیں، اور وہ باتیں جو ان کے نفوس کرتے ہیں، یہ سب ماضی میں ان کا احصاء (شمار) کرنے کے طریقے پر ہوتا ہے۔ یہاں تک کہ اس مقام سے متحقق شخص کسی بھی فرد کے دل میں موجود تمام چیزوں کو جان لیتا ہے، اور اس کی ارادے کی ہر اس چیز کو جان لیتا ہے جو اس کی پیدائش کے وقت سے لے کر، اور دودھ پینے کے لیے حرکت کرنے سے لے کر، اس کے سامنے بیٹھنے کے وقت تک اس سے متعلق رہی ہے، جسے وہ شخص خود بھی اپنی کم عمری اور بھول جانے کی وجہ سے، اور ہر اس چیز پر توجہ نہ دینے کی وجہ سے نہیں جانتا جو اس کے دل میں آتی ہے اور اس کا نفس اس سے بات کرتا ہے، کیونکہ زمانہ گزر چکا ہوتا ہے۔ پس اس مقام کا صاحب اسے صحیح معرفت (المعرفة) کے ساتھ جانتا ہے، جس میں اسے نہ اپنے بارے میں کوئی شک ہوتا ہے اور نہ ہی ہر اس شخص کے بارے میں جو اس کے سامنے ہو یا اس کے خیال میں حاضر ہو۔ اور یہ ایک حال ہے جو بندے پر طاری ہوتا ہے۔ ہم نے اس مقام کے بارے میں ابو السعود بن الشبل کے احوال سنے ہیں، ہمارے ساتھی ابو البدر رحمہ اللہ نے ہمیں بتایا کہ شیخ عبدالقادر کا ذکر ابو السعود کے سامنے کیا گیا اور ان کی تعریف میں مبالغہ کیا گیا، اور کہنے والے کا مقصد شیخ ابو السعود اور حاضرین کو عبدالقادر کے مرتبے سے آگاہ کرنا تھا، اور اس نے حد سے تجاوز کیا۔ تو شیخ ابو السعود نے اسے ڈانٹتے ہوئے کہا: \"تم کتنا کہتے ہو! تم ہمیں عبدالقادر کے مرتبے سے آگاہ کرنا چاہتے ہو؟ اللہ کی قسم! میں عبدالقادر کا حال جانتا ہوں کہ وہ اپنے گھر والوں کے ساتھ کیسے تھے اور اب اپنی قبر میں کیسے ہیں۔\" اور یہ صرف اسی مقام سے معلوم ہو سکتا ہے۔ لیکن یہ کامل تحصیص صرف ذات حق (الحق) سے مخلوق کو دیکھنے کی طرف لوٹنے پر حاصل ہوتی ہے، اللہ کی آنکھ اور اس کی تائید سے، نہ کہ اپنی آنکھ اور اپنی قوت سے۔\n\nاور اسی مقام سے یہ بھی معلوم ہوتا ہے کہ انسان کو کتنی بار حشر (جمع) کیا جاتا ہے۔ پس جان لو کہ جب اللہ نے انسانی روح کو پیدا کیا، تو اسے اس کی ایک حسی، طبعی صورت کا مدبر بنا کر پیدا کیا، خواہ وہ دنیا میں ہو، یا برزخ میں، یا دار آخرت میں، یا جہاں بھی ہو۔ پہلی صورت جو اس نے پہنی وہ وہ صورت تھی جس پر اس سے ذات حق (الحق) کی ربوبیت کا اقرار کرنے کا میثاق لیا گیا تھا۔ پھر اسے اس صورت سے اس دنیاوی جسمانی صورت کی طرف حشر کیا گیا، اور اسے اس میں اس کے جسم کی صورت بننے کے چوتھے مہینے سے لے کر اس کی موت کے وقت تک اس کی ماں کے پیٹ میں قید رکھا گیا۔ جب وہ مر جاتا ہے، تو اسے اس کی موت کے وقت سے لے کر سوال کے وقت تک ایک دوسری صورت کی طرف حشر کیا جاتا ہے۔ جب اس کے سوال کا وقت آتا ہے، تو اسے اس صورت سے اس جسم کی طرف حشر کیا جاتا ہے جو موت سے موصوف تھا، پس وہ اس روح کے ذریعے زندہ ہو جاتا ہے، اور لوگوں کی سماعتوں اور بصارتوں کو اس روح کے ذریعے اس کی زندگی سے روک دیا جاتا ہے، سوائے اس کے جسے اللہ تعالیٰ نے اس پر کشف (الکشف) کے ساتھ خاص کر دیا ہو، خواہ وہ نبی ہو یا جن و انس میں سے کوئی ولی۔ جہاں تک باقی حیوانات کا تعلق ہے، تو وہ اس کی زندگی اور اس کے حال کا مشاہدہ عیناً کرتے ہیں۔ پھر سوال کے بعد اسے برزخ میں ایک دوسری صورت کی طرف حشر کیا جاتا ہے، جس میں اسے روکا جاتا ہے، بلکہ وہ صورت ہی عین برزخ ہے۔ اور اس میں نیند اور موت برابر ہیں۔ یہاں تک کہ نفخہ بعث (صور پھونکا جانا) ہوتا ہے، تو اسے اس صورت سے اٹھایا جاتا ہے اور اس صورت کی طرف حشر کیا جاتا ہے جسے اس نے دنیا میں چھوڑا تھا، اگر اس پر کوئی سوال باقی ہو۔ اور اگر وہ اس صنف میں سے نہ ہو، تو اسے اس صورت کی طرف حشر کیا جاتا ہے جس کے ذریعے وہ جنت میں داخل ہوگا۔ اور قیامت کے دن جس سے سوال کیا جائے گا، جب وہ اپنے سوال سے فارغ ہو جائے گا، تو اسے اس صورت میں حشر کیا جائے گا جس کے ذریعے وہ جنت یا دوزخ میں داخل ہوگا۔ اور دوزخ والے سب سے سوال کیا جائے گا۔ جب وہ جنت میں داخل ہو جائیں گے اور اس میں ٹھہر جائیں گے، پھر انہیں رؤیت (دیدار) کے لیے بلایا جائے گا اور وہ جلدی کریں گے، تو انہیں ایک ایسی صورت میں حشر کیا جائے گا جو صرف رؤیت کے لیے موزوں ہو۔ جب وہ واپس آئیں گے، تو انہیں ایک ایسی صورت میں حشر کیا جائے گا جو جنت کے لیے موزوں ہو۔ اور ہر صورت میں وہ اپنی اس صورت کو بھول جاتا ہے جس پر وہ تھا، اور اس کا حکم اس صورت کا حکم بن جاتا ہے جس کی طرف وہ منتقل ہوا اور جس میں اسے حشر کیا گیا۔ جب وہ جنت کے بازار میں داخل ہوگا اور اس میں موجود صورتوں کو دیکھے گا، تو جو بھی صورت اسے نظر آئے گی اور وہ اسے پسند کرے گا، اسے اس میں حشر کیا جائے گا۔ پس وہ جنت میں ہمیشہ ایک صورت سے دوسری صورت میں حشر ہوتا رہے گا، لامتناہی طور پر، تاکہ اس کے ذریعے الٰہی وسعت کا علم ہو جائے۔ جس طرح اس پر ظہور الٰہی (التجلی) کی صورتیں دہرائی نہیں جاتیں، اسی طرح اس متجلی لہ (جس پر ظہور ہو رہا ہے) کو بھی ضرورت ہوتی ہے کہ وہ ہر اس صورت کا مقابلہ ایک دوسری صورت سے کرے جو اس کے ظہور میں اس کی طرف روشن ہوتی ہے۔ پس وہ ہمیشہ صورتوں میں حشر ہوتا رہے گا، انہیں جنت کے بازار سے لیتا رہے گا۔ اور وہ بازار کی ان صورتوں میں سے صرف وہی قبول کرے گا اور پسند کرے گا جو مستقبل میں ہونے والے ظہور الٰہی (التجلی) کی صورت کے مناسب ہو، کیونکہ وہ صورت اس ظہور کے لیے خاص استعداد کی مانند ہے۔ پس یہ جان لو، کیونکہ یہ الٰہی معرفت (المعرفة) کا مغز ہے۔ اگر تم غور کرتے تو جان لیتے کہ تم ابھی بھی اسی طرح ہو، ہر سانس میں اس حال کی صورت میں حشر کیے جاتے ہو جس پر تم ہو۔ لیکن تمہاری مانوس رؤیت تمہیں اس سے پردہ میں رکھتی ہے، اگرچہ تم اپنے احوال میں اپنے انتقال کو محسوس کرتے ہو جن پر تم اپنے ظاہر و باطن میں تصرف کرتے ہو، لیکن تم نہیں جانتے کہ وہ تمہاری روح کی صورتیں ہیں جن میں تم ہر آن داخل ہوتے ہو اور حشر کیے جاتے ہو، اور عارفین (العارفين) انہیں صحیح، ثابت اور ظاہری صورتوں کے طور پر دیکھتے ہیں۔\n\nاور یہ مقام خبرہ (تجربہ) کا مقام ہے، اور اس پر اسم \"الرب\" (رب) غالب ہے۔ اور یہ صورتیں خبرہ صرف اس لیے طلب کرتا ہے تاکہ موطن تکلیف (دنیا) میں ان پر حجت قائم کر سکے، جہاں تمام لوگ لوٹ کر جائیں گے۔ پس عارف (العارف) موطن تکلیف میں ہی اپنی قیامت کو مقدم کر لیتا ہے، اور لوگوں کے منتقل ہونے سے پہلے ہی اپنے اعمال کا وزن کرتا ہے اور اپنا محاسبہ کرتا ہے۔ اور شریعت نے اس پر ابھارا ہے۔\n\nپس فرمایا: \"اپنا محاسبہ کرو قبل اس کے کہ تمہارا محاسبہ کیا جائے۔\"\n\nاور ہمارے لیے اس میں ایک عظیم مشہد ہے جسے ہم نے دیکھا اور اس محاسبے سے فائدہ اٹھایا، پس اس مقام پر جہاں لوگوں کا محاسبہ کیا جاتا ہے، یہ ہم پر دوبارہ نہیں لوٹا۔ اور میں نے یہ مقام اپنے شیخ ابو عبداللہ بن المجاہد اور ابو عبداللہ بن قسوم سے اشبیلیہ میں حاصل کیا، کیونکہ یہ ان کا حال تھا۔ اور میں نے ابن قسوم سے اس میں اضافہ کیا کہ میں نے اپنے نفس کا محاسبہ خواطر (خیالات) پر بھی کیا، جبکہ شیخ صرف افعال اور اقوال پر ہی اپنا محاسبہ کرتے تھے۔ اور یہ مقدار اس مقام کے مضمرات کی تعریف کے لیے کافی ہے۔ {والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ} (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔ مجھ سے کہا گیا کہ ہر مقام کے آخر میں کہو: سبحانك اللهم وبحمدك لا إله إلا أنت أستغفرك وأتوب إليك۔",
    "fa": "باب دویست و هشتاد و چهارم در معرفت منزل همگامی شریف (المجاراة الشريفة) و اسرار آن از حضرت محمدیه (الحضرة المحمدية).\n\nاسبان تیزرو اندیشه در میدان فهم به تجارت می‌پردازند\nو از آن تجارت، علمی حاصل می‌شود\n\nبه اسرار ذوقی که با آسودگی به دست نمی‌آید\nو از حال کیفی و کمی فراتر است\n\nصبح آن بر سپاه تاریکی یورش برد\nپس از خورشید من پرده برداشت و از پنهانی من خبر داد\n\nو آتش‌زنه اندیشه، آتشی را برافروخت که متولد شد\nاز ضربه زدن به روحی که از جسم پدید آمده است\n\nپس بر پای ستایش ایستادم در حالی که تمجید می‌کردم\nو بشارت‌های معارف (المعارف) با مهر (ختم) آمد\n\nپس منزه است کسی که دل را با نور خود زنده کرد\nو مرا به اخذ (گرفتن) از او و فهم (الفهم) اختصاص داد.\n\nاز این باب است سخن خداوند متعال: **«آنان در کارهای نیک شتاب می‌ورزند و در آن پیشی‌گیرنده‌اند.»** (أُولئِكَ يُسارِعُونَ في الْخَيْراتِ وهُمْ لَها سابِقُونَ). و ناطقی که در دل‌های ذاکرین (ذکرکنندگان) برمی‌خیزد و تحت حکم آنان نیست، از دوام ذکری است که بر آن هستند بدون اینکه فترتی (وقفه) در آن رخنه کند. پس ناطقی را در دل‌های خود می‌شنوند که خدا را در وجودشان ذکر می‌کند، در حالی که آنان ساکت هستند یا در حال گفتگویی از گفتارهای نفسانی‌اند، و نمی‌دانند چه کسی در آن‌ها سخن می‌گوید. آن ناطق همان است که به موسی (صلی الله علیه و سلم) گفت: **«همانا من الله هستم، معبودی جز من نیست.»** (إني أنا الله لا إله إلا أنا). این سخن، نطق قلب (نطق القلب) نامیده می‌شود و نزد آنان همان ناطق است.\n\nو گروهی می‌گویند که آن فرشته‌ای است که خداوند او را از ذکر بنده که بر آن مداومت داشته، خلق کرده و در او ساکن نموده است تا در اوقات غفلت‌هایش که در میان ذکرها رخنه می‌کند، به نیابت از این بنده ذکر گوید. اما اگر غفلت‌هایش ادامه یابد و ذکر را ترک کند، این ناطق را از دست می‌دهد. و برخی از مردم بر این باورند که حق (الحق) نطق قلب او را که همیشه در سینه‌اش جاری است، به او می‌شنواند. این خرق عادتی است که کرامتی از جانب خداوند برای این شخص است، زیرا نطق قلبش را به او می‌شنواند تا ایمانش به واسطه نطق جوارحش (اعضای بدنش) افزایش یابد، چنانکه فرمود: **«تا ایمانی بر ایمانشان بیفزایند.»** (لِيَزْدادُوا إِيماناً مَعَ إِيمَانِهِمْ)؛ به واسطه آنچه از نطق جوارحشان در آخرالزمان و در سرای آخرت می‌آید.\n\nرسول خدا (صلی الله علیه و سلم) فرمود: **«قیامت برپا نمی‌شود تا اینکه مرد با ران خود سخن بگوید، درباره آنچه خانواده‌اش انجام داده‌اند، و تا اینکه مرد با نوک تازیانه‌اش سخن بگوید.»** (لا تقوم الساعة حتى يكلم الرجل فخذه‏ بما فعل أهله وحتى يكلم الرجل عذبة سوطه). و خداوند متعال فرمود: **«و دست‌هایشان با ما سخن می‌گویند و پاهایشان به آنچه کسب می‌کردند شهادت می‌دهند.»** (وتُكَلِّمُنا أَيْدِيهِمْ وتَشْهَدُ أَرْجُلُهُمْ بِما كانُوا يَكْسِبُونَ). و فرمود: **«و شما خود را پنهان نمی‌کردید از اینکه گوش‌هایتان و چشم‌هایتان و پوست‌هایتان بر شما شهادت دهند، بلکه گمان می‌کردید که خداوند بسیاری از آنچه را انجام می‌دهید نمی‌داند.»** (وما كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ ولا أَبْصارُكُمْ ولا جُلُودُكُمْ ولكِنْ ظَنَنْتُمْ أَنَّ الله لا يَعْلَمُ كَثِيراً مِمَّا تَعْمَلُونَ). و اینان در روز قیامت به پوست‌های خود می‌گویند: **«چرا بر ما شهادت دادید؟»** پس پوست‌ها می‌گویند: **«خداوندی که هر چیزی را به سخن درآورد، ما را به سخن درآورد.»** (أَنْطَقَنَا الله الَّذِي أَنْطَقَ كُلَّ شَيْ‏ءٍ).\n\nو کسی که از مرتبه این ذاکر که نطق قلبش را با گوش خود شنید، فراتر رود، خداوند نطق تمام جسدش، بلکه نطق همه جمادات، نباتات و حیوانات را به او می‌شنواند. اما حیوانات، ممکن است نطق آن‌ها را بشنود و آنچه را می‌گویند بفهمد، نه از طریق ذکر، بلکه به واسطه خاصیت گوشت حیوانی یا آبگوشت آن. خورنده یا نوشنده آبگوشت آن بر غیب‌هایی که خداوند در عالم از حوادث جزئی و عمومی پدید می‌آورد، آگاه می‌شود و می‌شنود و می‌فهمد آنچه را که همه حیوانات به آن نطق می‌کنند.\n\nو من کسی را دیده‌ام که دیده بود فردی از گوشت این حیوان خورده و از آبگوشت آن نوشیده و این حالت برایش پیش آمده بود. هر کس او را می‌دید، تعجب می‌کرد. این حیوان در بیابانی میان مکه و عراق یافت می‌شود، اما چند روز دورتر از مسیر کاروان‌ها، در بیشه‌ای بزرگ. شکل این حیوان شبیه زنی است که به زبان عربی سخن می‌گوید. اعراب آن بیابان که قبیله‌ای شناخته‌شده هستند، هر سال در روزی معین به سوی آن بیشه می‌آیند، در حالی که نیزه‌ها در دست دارند. بر دهانه راه‌های آن بیشه می‌ایستند و گروهی از آن‌ها وارد بیشه می‌شوند و با فریاد زدن پراکنده می‌شوند و در طلب این حیوان اصرار می‌ورزند تا او را فراری دهند. در این هنگام، حیوان فراری و رمیده از یکی از آن دهانه‌ها خارج می‌شود. اگر کسی که بر آن راه ایستاده، بتواند او را با نیزه بزند، او را می‌کشد. و اگر از دستش بگریزد و در بیابان دور شود، تا همان روز از سال آینده بازمی‌گردند. این کار هر سال تکرار می‌شود. وقتی بر او ظفر یابند، او را قطعه‌قطعه کرده و گوشتش را بر تمام قبیله تقسیم می‌کنند. هر یک از آن‌ها سهم خود را می‌پزد و می‌خورد و آبگوشتش را می‌نوشد و به هر کس از خانواده و اهل بیتش که بخواهد، می‌خوراند. و اگر غریبه‌ای نزد آن‌ها باشد که از کاروان جدا شده و گم گشته و نزد آن‌ها مانده باشد و آن روز را مصادف شود، او را از خوردن گوشت یا نوشیدن آبگوشت آن منع می‌کنند، مگر اینکه آن را پنهانی و بدون اطلاع آن‌ها بخورد. اگر مطلع شوند، او را به زور با استفراغ شدید وادار به قی می‌کنند. در نتیجه، تأثیر آن گوشت از او کاسته می‌شود، اما به کلی از بین نمی‌رود و مقداری از علم غیوب برایش باقی می‌ماند. پس منزه است کسی که علم آنچه را در مخلوقاتش به ودیعه نهاده، از برخی مخلوقاتش پنهان داشته است. معبودی جز او نیست، دانای حکیم (العليم الحكيم).\n\nو هر آنچه که هر کس در معنا و حقیقت این ناطق ذکر کرده، صحیح است؛ زیرا این ناطق ممکن است عین قلب او باشد، یا فرشته‌ای باشد که از ذکر او خلق شده، یا روحی باشد که او را لازم می‌گیرد، یا همان چیزی باشد که ما به آن اشاره کردیم. و فرق میان آنچه ما به آن اشاره کردیم و آنچه دیگران در تعیین آن گفته‌اند، این است که (در حالت ما) ناطق با او گفتگو می‌کند و او را به هر آنچه از تعریفات الهی و کونی (مربوط به هستی) بخواهد، مخاطب قرار می‌دهد؛ یعنی آنچه مربوط به معرفت (المعرفة) خداوند و آنچه مربوط به مخلوقات است، در صورتی که بر ذکر خود استمرار ورزد و بر طاعت پروردگارش مداومت کند.\n\nو او همان کسی است که به صاحب «المواقف» آنچه را که او در مواقفش از قولش حکایت کرده، گفته است، مگر اینکه او (رحمه الله) خود بر مراتب علوم تنبیه کرده باشد و گفته باشد: «به من گفت و من به او گفتم.» زیرا برخی از عارفان (العارفين) این کار را می‌کنند، چرا که در هستی (الوجود) گوینده‌ای جز حق (الحق) نمی‌بینند، چه در حال و چه در لفظ. و همه این‌ها علم محقق است. با این حال، اگر این تعبیری از مراتب علوم باشد، شنونده از صاحب این مقام توهم می‌کند که وقتی می‌گوید: «به من گفت و من به او گفتم»، حق (الحق) با او سخن می‌گوید. اگر شنونده از او بپرسد، او را به حقیقت امر آگاه می‌سازد، زیرا آنان اهل صدق هستند، به شرطی که سائل به آنچه اهل طریق خدا می‌گویند، مؤمن باشد. اما اگر در ایمان به آن متردد باشد، در این باره سکوت می‌کند، اگر از کسانی باشد که طاعتش شرعاً بر او لازم نیست. و اگر از کسانی باشد که طاعتش شرعاً بر او لازم است و اهلیت آن را ندارد، به او می‌گوید: «این‌ها صرفاً عبارات احوال و نطق حال است، نه نطق مقال (سخن گفتن)؛ همان‌طور که زمین به میخ می‌گوید: چرا مرا شکافتی؟ و میخ به او می‌گوید: از کسی بپرس که مرا می‌کوبد؛ یعنی کوبنده‌ای که با آن میخ کوبیده می‌شود.» و این لسان حالی معلوم است که مثلی شناخته‌شده میان مردم است.\n\nسپس بدان، پس از آنکه این را برایت بیان کردم، کسی که به سوی خیرات شتاب می‌ورزد و در آن پیشی می‌گیرد، اگر مشاهدات الهی و علوم ربانی را می‌خواهد، باید شب‌زنده‌داری را زیاد کند و همیشه در آن جمعیّت (تمرکز کامل) داشته باشد. اگر انواری پراکنده بر او آشکار شد که میان هر نور و نور دیگر تاریکی‌ای رخنه می‌کند و آن انوار بقایی ندارند و سریع از بین می‌روند، این اولین نشانه‌های قبول و فتح (گشایش) است. پس پیوسته آن انوار شریف با مجاهدات و شتاب ورزیدن در آن‌ها و به سوی آن‌ها بر او ظاهر می‌شود تا اینکه نور بزرگ‌تری بر او طلوع کند. با آن نور، موانعی که مردم را از رسیدن به این علوم باز می‌دارد، کشف می‌شود و اسراری در مقامات آن‌ها کشف می‌گردد که خود او چیزی از آن ندارد و به آن موصوف نیست. پس اعمال او که بر آن‌ها مداومت داشته، از اذکار و ریاضات و مجاهدات، بر او کشف می‌شود که خداوند آن‌ها را به صورت خلقی روحانی (خلقاً روحانياً) ایجاد کرده است. پس این خلق روحانی برای گرفتن آن اسرار مسابقه می‌دهند، همان‌طور که او (سالک) با آن‌ها مسابقه می‌دهد. پس آن‌ها را می‌گیرد و به عامل خود می‌پوشاند، به عنوان جزایی موافق، زیرا او سبب وجود اعیان آن خلق بوده است که عین افعال بدنی او از نطق و حرکت هستند و حضور، ارواح آن صورت‌های عملی بوده است. در این هنگام، عامل به علم آن علوم و اسرار متصف می‌شود. این‌گونه آن‌ها را مشاهده می‌کند، اگر به شهود او درآیند. و گاهی این علوم را از پشت حجاب غیب می‌یابد و بر چگونگی امر آگاه نمی‌شود، و این همان است که ذکر کردیم.\n\nگوینده گفت:\nسپاهی که چون صبح بر دشمنان عطسه کند\nیورش اسبانش، شماتت (سرزنش) است\n\nو موافقاتی میان صورت علوم و صورت این اعمال مشاهده می‌کند، به دلیل انتظار اذن الهی در این باره. پس اگر عامل از کسانی باشد که خداوند خواسته است در دنیا در کسب این اسرار بر او گشایش (فتح) دهد و اذن الهی در این باره صادر شود، بر باطن این عامل با علوم گوناگون گشایش حاصل می‌شود و گفته می‌شود: «فلان بر او فتح شده است.» و اگر خداوند بخواهد آن را برای مصلحتی که در منع آن می‌بیند، تا سرای آخرت برای او پنهان سازد، صورت‌های اعمال نمی‌توانند آن علوم را بر عامل بپوشانند، بلکه اعمال آن علوم را می‌پوشند تا زمانی که عامل به سرای آخرت منتقل شود. در آنجا آن‌ها را در اعمالش پنهان‌شده می‌یابد و آن‌ها را به صورت خلعت‌های الهی می‌پوشد. در این صورت، در دنیا درباره این عامل گفته می‌شود که با وجود کثرت عملش، بر او فتح نشده است. و تعجب‌کنندگان از این امر شگفت‌زده می‌شوند، زیرا تصور می‌کنند که فتح امری لازم است. و همین‌طور هم هست، فتح امری لازم است که اعمال آن را می‌طلبند و به آن می‌رسند، اما اینکه چه زمانی این صفت برای عامل حاصل می‌شود، آیا در دنیا یا در آخرت، این به دست خداست. پس اگر عامل صدقی را دیدی یا این را در خودت شناختی و ندیدی که در باطنت گشایشی حاصل شود، مانند آنچه برای کسی که او را بر صورت عمل خود می‌بینی حاصل شده، پس خود را متهم مکن، زیرا آن برای تو ذخیره شده است. و تهمت را از خود دور کن، پس متهم مشو و خود را از اهل تهمت قرار مده و بگو، چنانکه من در این باره گفتم:\n\nمن از اهل تهمت نیستم\nو نه از کسانی که متهم شده‌اند\n\nو من اگر «نه» بگویم\nپس از آن «آری» نمی‌گویم\n\nو عکس این را نمی‌گویم\nزیرا من دریایی پهناورم\n\nو من فرزند حاتم هستم\nخانه بخشش و کرم\n\nپس چه بسیار آثار بزرگی که برای ماست\nبرافراشته مانند پرچم\n\nتا به نور آن هدایت شوند\nدر میان عرب و عجم\n\nمعلوم و مشهور\nکه در هر دهانی ذکر می‌شود\n\nمحبوب و مورد سپاس\nجاری و چه بسیار و چه بسیار\n\nو چه نیکوست سخن گوینده در مثل آنچه گفتم:\n**«و من اگر کسی را تهدید کنم یا وعده دهم\nتهدیدم را زیر پا می‌گذارم و وعده‌ام را وفا می‌کنم.»** (وإني إذا أوعدته أو وعدته لمخلف إيعادى ومنجز موعدي).\n\nو این از کرم الهی (الكرم الإلهي) است که در مقابل وعید (تهدید) و اجرای آن، مانعی قرار داده است که همان عفو و گذشت است، اما برای وعده خیر، مانعی از اسم الهی قرار نداده است. و هنگامی که حال بنده از کرم به این مرتبه باشد، ساحت الهی به این صفت سزاوارتر است. و من تنها به این دلیل متذکر شدم که فرزند حاتم هستم، به خاطر کرمی که بر آن سرشته شده‌ام و در آن ریشه استواری دارم، چنانکه گفته شده است: **«اسبان اصیل بر اساس ریشه‌های خود می‌دوند.»** (إن الجياد على أعراقها تجري). و «اعراق» جمع «عرق» به معنای ریشه‌هاست که در زبان عرب به معنای اصل و نسب است.\n\n### [اینکه عارفان (العارفين) با مواطن (مکان‌ها/مقامات) بر حسب اقتضای آن‌ها رفتار می‌کنند]\n\nبدان که عارفان (العارفين) با مواطن (مقامات) بر حسب اقتضای آن‌ها رفتار می‌کنند، و غیر عارفان چنین نیستند. پس عارف اگر آنچه را پروردگارش از معارف (المعارف) و اسرار به او بخشیده، برای مردم آشکار کند، این کار را تنها به خاطر پروردگارش انجام می‌دهد، نه از باب فخر فروشی بر همنوعانش؛ حاشا که چنین کند. چنانکه پیامبر (صلی الله علیه و سلم) هنگامی که مأمور شد مردم را به منزلت خود آگاه سازد، فرمود: **«من سرور فرزندان آدم هستم.»** (أنا سيد ولد آدم). این همان چیزی است که به او گفته شد بگو، سپس خود از جانب خویش فرمود: **«و فخری نیست.»** (ولا فخر). یعنی: من از این سخن قصد فخر نداشتم، بلکه شما را به مقام الهی (المقام الإلهي) از روی اذن آگاه ساختم. اما اگر عارف منزلت خود را بدون امر الهی و اذن ربانی برای مردم تعریف کند، این هوای نفس است با تأویلی که برایش ظاهر شده است. این لغزشی است که از او سر زده و شایسته است که از شر آن به خدا پناه ببرد؛ زیرا موطن دنیوی اقتضای فتح (گشایش) و تعریف مقام را ندارد، مگر برای انبیا به طور خاص، هنگامی که فرستاده می‌شوند. اما اولیا را عبودیت محض محدود کرده است، پس آنان در پرده مقام و حال خود برای پروردگارشان هستند، نه برای خودشان؛ یعنی به خاطر پروردگارشان. و آنان در این امر با پروردگارشان حاضرند. اگرچه عارف از حیث انسانیت و نفس خود، دوستدار ستایش شدن به واسطه منزلتش نزد مولایش باشد تا بدین وسیله بر همنوعانش برتری یابد، و او معذور است؛ زیرا چه فخری بزرگ‌تر از فخر به خداست؟ اما بنده مخلص، دین خالص دارد. و دین خالص آن است که پروردگارش او را با ثنای خود به زبان حق (الحق) و کلام او پاداش دهد، نه به زبان مخلوقات. پس او ستایش از جانب خدا را دوست دارد تا با آگاه ساختن خدا، بداند که در هیچ یک از مقتضیات مقام عبودیت (مقام العبودية) یا مستحقات مقام ربوبیت (مقام الربوبية) کوتاهی نکرده است تا از جانب خود بر بصیرت باشد. پس او آنچه را که انسانیت و نفسش از حب ثنا اقتضا می‌کند، دوست داشته است، اما از جانب خدا، نه از مخلوق و نه از نفس خود نزد مخلوقین؛ زیرا در این کار بر بصیرت نیست و اذن پروردگارش را ندارد. همان‌طور که مال را دوست دارد به دلیل آنچه از بی‌نیازی از احتیاج به مخلوقین در پی دارد. پس کسی که بی‌نیازی‌اش به پروردگارش باشد، همان مال اوست؛ زیرا مال به خاطر خودش یا به خاطر ذخیره کردنش محبوب نیست، مگر با توهم رفع نیاز به واسطه وجود آن. پس این را بدان. همه نفوس در ظاهر دوستدار مال هستند، در حالی که مال در معنا همان غنا (بی‌نیازی) است. پس هر چیزی که بی‌نیازی در نفس بنده به واسطه آن حاصل شود، همان مال محبوب نزد اوست، بلکه نزد هر نفسی. و در این باره گفتم:\n\nبا مال هر امر دشواری رام می‌شود\nاز عالم زمین و آسمان\n\nپس کسی که آن را حبس کند، عالم حجاب است\nکه لذت بخشش را نشناخته‌اند\n\nو از آن (قصیده) است، منظورم از این قصیده:\nمال را آنچه می‌بینی مپندار\nاز طلای درخشان برای بیننده\n\nبلکه ای فرزندم، آن چیزی است که تو با آن\nاز غیر خدا بی‌نیاز باشی\n\nپس به پروردگار بلندمرتبه بی‌نیاز باش\nو با حق (الحق) با وفاداری معامله کن\n\nو از این منزل (مقام) است که ای فرزندم، آنچه را که دل‌ها از امور پنهان کرده‌اند و آنچه از خواطر (خطورات ذهنی) در آن‌ها می‌گذرد و آنچه نفوسشان در گذشته به آن سخن گفته‌اند، به طریق احصاء (شمارش) می‌آموزی. تا جایی که کسی که به این منزل متحقق شده است، تمام آنچه را که قلب شخص در بر داشته و آنچه اراده‌اش به آن تعلق گرفته، از زمان تولدش و حرکتش برای طلب پستان تا زمان نشستنش در مقابل او، می‌شناسد؛ اموری که آن شخص به دلیل کوچکی و نسیانی که بر او عارض شده و عدم توجه به هر آنچه در قلبش خطور می‌کند و نفسش به آن سخن می‌گوید، به دلیل گذشت زمان، از خود نمی‌داند. پس صاحب این منزل آن را از او با معرفتی صحیح می‌شناسد که در آن شک و تردیدی نیست، نه از جانب خودش و نه از جانب هر کس که در مقابل اوست یا در خاطرش حاضر است. و این حالی است که بر بنده عارض می‌شود. و ما شنیده‌ایم که این منزل از احوال ابوالسعود بن الشبل بوده است. صاحب ما ابوالبدر (رحمه الله) برای ما نقل کرد که شیخ عبدالقادر در حضور ابوالسعود ذکر شد و در ذکر و ستایش او زیاده‌روی شد. و گوینده قصد داشت شیخ ابوالسعود و حاضران را به منزلت عبدالقادر آگاه سازد و افراط کرد. پس شیخ ابوالسعود به او گفت: «چقدر می‌گویی؟ تو دوست داری ما را به منزلت عبدالقادر آگاه سازی؟» گویی او را سرزنش می‌کرد. «به خدا سوگند، من حال عبدالقادر را می‌دانم که با خانواده‌اش چگونه بود و اکنون در قبرش چگونه است.» و این جز از این منزل دانسته نمی‌شود، اما این تحصیل کامل برای او حاصل نمی‌شود مگر در بازگشت از حق (الحق) به دیدن مخلوقات با چشم خدا و تأیید او، نه با چشم و نیروی خودش.\n\nو از این منزل نیز دانسته می‌شود که انسان چند بار محشور می‌شود. پس بدان که روح انسانی (الروح الإنساني) را خداوند هنگامی که او را ایجاد کرد، مدبر صورت طبیعی حسی او قرار داد، چه در دنیا باشد، چه در برزخ، چه در سرای آخرت، یا هر جای دیگر. اولین صورتی که روح آن را پوشید، صورتی بود که در آن میثاق اقرار به ربوبیت حق (الحق) بر او گرفته شد. سپس از آن صورت به این صورت جسمانی دنیوی محشور شد و در ماه چهارم از تشکیل صورت جسدش در شکم مادر تا لحظه مرگ، در آن محبوس بود. پس هنگامی که می‌میرد، از لحظه مرگ تا زمان سؤال (قبر)، به صورت دیگری محشور می‌شود. و هنگامی که زمان سؤالش فرا می‌رسد، از آن صورت به جسدش که به مرگ موصوف است، محشور می‌شود و با آن روح زنده می‌گردد. و گوش‌ها و چشم‌های مردم از حیات او با آن روح گرفته می‌شود (یعنی نمی‌بینند)، مگر کسی که خداوند متعال او را به کشف (الکشف) بر این امر اختصاص داده باشد، از پیامبر یا ولی از جن و انس. اما سایر حیوانات، حیات او و آنچه در آن است را به عینه مشاهده می‌کنند. سپس بعد از سؤال، به صورت دیگری در برزخ محشور می‌شود و در آن نگاه داشته می‌شود. بلکه آن صورت، عین برزخ است و خواب و مرگ در آن یکسان است، تا نفخه بعث. پس از آن صورت برانگیخته می‌شود و به صورتی که در دنیا از آن جدا شده بود، محشور می‌گردد، اگر سؤالی بر او باقی مانده باشد. و اگر از اهل آن صنف نباشد، به صورتی محشور می‌شود که با آن وارد بهشت می‌گردد. و کسی که در روز قیامت مورد سؤال قرار می‌گیرد، هنگامی که از سؤالش فارغ شود، در صورتی محشور می‌شود که با آن وارد بهشت یا دوزخ می‌گردد. و اهل دوزخ همگی مورد سؤال قرار می‌گیرند. پس هنگامی که وارد بهشت شدند و در آن مستقر گشتند، سپس به رؤیت (دیدار حق) فراخوانده شدند و شتاب ورزیدند، در صورتی محشور می‌شوند که تنها برای رؤیت مناسب است. و هنگامی که بازگشتند، در صورتی محشور می‌شوند که برای بهشت مناسب است. و در هر صورت، صورت قبلی خود را فراموش می‌کند و حکم او به حکم صورتی که به آن منتقل شده و در آن محشور گشته، باز می‌گردد. پس هنگامی که وارد بازار بهشت شود و آنچه از صورت‌ها در آن است ببیند، هر صورتی را که دید و نیکو شمرد، در آن محشور می‌شود. پس پیوسته در بهشت دائماً از صورتی به صورتی دیگر محشور می‌شود تا بی‌نهایت، تا بدین وسیله وسعت الهی (الاتساع الإلهي) را بداند. همان‌طور که صورت‌های تجلی (التجلی) بر او تکرار نمی‌شود، این کسی که تجلی بر او می‌شود نیز نیاز دارد که هر صورتی را که بر او تجلی می‌کند، با صورت دیگری که در تجلی به سوی او نور می‌افکند، مقابله کند. پس پیوسته دائماً در صورت‌ها محشور می‌شود و آن‌ها را از بازار بهشت می‌گیرد. و از آن صورت‌هایی که در بازار است، نمی‌پذیرد و نیکو نمی‌شمارد، مگر آنچه را که مناسب صورت تجلی‌ای باشد که در آینده برای او خواهد بود؛ زیرا آن صورت، به منزله استعداد خاص برای آن تجلی است. پس این را بدان، زیرا این از مغز معرفت الهی (المعرفة الإلهية) است. و اگر متوجه شوی، خواهی دانست که تو اکنون نیز چنین هستی؛ در هر نفس در صورت حالی که بر آن هستی، محشور می‌شوی، اما رؤیت معهود تو، تو را از آن محجوب می‌سازد. اگرچه انتقال خود را در احوالت که در ظاهر و باطنت بر آن تصرف می‌کنی، احساس می‌کنی، اما نمی‌دانی که آن‌ها صورت‌هایی برای روح تو هستند که در هر آن وارد آن‌ها می‌شوی و در آن‌ها محشور می‌گردی. و عارفان (العارفون) آن‌ها را به صورت‌هایی صحیح، ثابت و آشکار می‌بینند. و این منزل، منزل خبره است و اسم «رب» بر آن مهیمن است. و این صورت‌ها را خبره تنها برای اقامه حجت بر آن‌ها در موطن تکلیف می‌طلبد. پس عارف، قیامت خود را در موطن تکلیف که همه مردم به آن باز می‌گردند، پیش می‌اندازد و اعمال خود را بر خود می‌سنجد و نفس خود را در اینجا قبل از انتقال محاسبه می‌کند. و شریعت بر این امر ترغیب کرده است.\n\nپس فرمود: **«پیش از آنکه مورد محاسبه قرار گیرید، خود را محاسبه کنید.»** (حاسبوا أنفسكم قبل إن تحاسبوا).\n\nو ما در این باره مشهدی عظیم داریم که آن را مشاهده کرده‌ایم و از این محاسبه در آن بهره برده‌ایم، پس در موطنی که مردم در آن محاسبه می‌شوند، بر ما بازنگشت. و من این مقام را جز از شیخمان ابوعبدالله بن مجاهد و ابوعبدالله بن قسوم در اشبیلیه نگرفتم، زیرا این حال آن دو بود. و من بر ابن قسوم در این باره افزودم، با محاسبه نفس خود بر خواطر (خطورات ذهنی)، در حالی که شیخ نفس خود را تنها بر افعال و اقوال محاسبه می‌کرد و نه چیز دیگر. و این مقدار برای تعریف آنچه این منزل در بر دارد، کافی است. و خداوند **«حق (الحق) را می‌گوید و او راه را هدایت می‌کند.»** (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ). به من گفته شد که در پایان هر منزل بگو: **«منزهی تو ای خدا و به ستایش تو، معبودی جز تو نیست، از تو آمرزش می‌طلبم و به سوی تو توبه می‌کنم.»** (سبحانك اللهم وبحمدك لا إله إلا أنت أستغفرك وأتوب إليك)."
  },
  "page_count": 5
}