{
  "id": 261,
  "title": {
    "ar": "الباب الأحد والستون ومائتان في معرفة البعد",
    "en": "The Two Hundred and Sixty-First Chapter: Concerning the Knowledge of Distance.",
    "ur": "۲۶۱ واں باب، بعد (البعد) کی معرفت میں",
    "fa": "باب دویست و شصت و یکم در معرفت بُعد (فاصله)"
  },
  "content": {
    "ar": "## «الباب الأحد والستون ومائتان في معرفة البعد»\n\n\n### [أن البعد هو الإقامة على المخالفة الله تعالى‏]\n\n\nاعلم أن البعد هو الإقامة على المخالفة ويطلق أيضا على البعد منك‏\n> البعد منك دنو *** وتر وشفع وتو\n\n\n> لما رأيت إماما *** يقول للقوم سووا\n\n\n> صفوفكم في صلاة *** لها العلا والدنو\n\n\n> علمت إن وجودي *** له البقاء والسموواعلم أن البعد يختلف باختلاف الأحوال فيدل على ما يراد به قرائن الأحوال وأن الأحوال وجميع ما ذكرناه فيما يكون قربا إذا لم يكن صفة للعبد فعدمه عين البعد هذا هو الجامع لهذا الباب الذي أشار إليه القوم‏\n\n\n### [حكم البعد عند ابن العربي‏]\n\n\nوأما حكم البعد عندنا فقد يكون على خلاف ما قرروه بعدا مع تقريرنا ما قرروه بعدا أنه بعدا بلا شك إلا إنا زدنا فيه أمورا أغفلتها الجماعة لا أنهم جهلوا ما نذكره إلا أنهم ما ذكروه في معرفة البعد وأدخلوه في باب القرب وذلك أن القرب اجتماع والبعد افتراق وما يقع به الاجتماع غير ما يقع به الافتراق فالبعد غير القرب فإذا اجتمع أمران في شي‏ء ما فذلك غاية القرب لأن عين كل واحد منهما عين الآخر فيما وقع فيه الاجتماع فإذا تميز كل واحد من العينين عن صاحبه بنعت لا يكون عليه الآخر فقد تميز عنه وإذا تميز عنه فذلك البعد لأنه ليس عينه من حيث ما هو عليه مما وقع له به الافتراق ويظهر ذلك في حدود الأشياء وإذا وقع البعد اختلف الحكم وقد يكون البعد بنعت عرضي كالمكان والزمان والحد والمقدار والأكوان والألوان في حق من تطلب ذاته هذه النعوت فإذا عقل أمران لا اجتماع بين واحد منهما مع الآخر وافترقا من جميع الوجوه كلها فذلك غاية البعد فلا أبعد من العالم من الله لأنه ما ثم من حيث ذاته شي‏ء يجمع بينهما وهذا موجود في قوله تعالى فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ وكان الله ولا شي‏ء معه ثم ننزل في درجة البعد دون هذا فنقول العبد لا يكون سيدا لمن هو عبد له فلا شي‏ء أبعد من العبد من سيده فالعبودية ليست بحال قربة وإنما يقرب العبد من سيده بعلمه أنه عبد له وعلمه بأنه عبد له ما هو عين عبوديته فعبوديته تقتضي البعد عن السيد وعلمه بها يقضي بالقرب من السيد قال الله لأبي يزيد البسطامي لما حار في القرب وما عرف بما ذا يتقرب إليه فقال له الحق في سره يا أبا يزيد تقرب إلي بما ليس لي الذلة والافتقار فنفى سبحانه عن نفسه هاتين الصفتين الذلة والافتقار وما نفاه عنه فإنه صفة بعد منه فمن قامت به تلك الصفة التي تقتضي البعد فهو بحيث هي وهي تقتضي البعد وقال أبو يزيد لربه في وقت آخر بم أتقرب إليك فقال له الحق اترك نفسك وتعال وإذا ترك نفسه فقد ترك حكم عبوديته لما كانت العبودية عين البعد من السيادة فالعبد بعيد من السيد فطلب منه في الذلة والافتقار القرب بالعبودية وطلب منه في ترك النفس القرب بالتخلق بأخلاق الله وهو ما يكون به الاجتماع فالتجلي في غير مادة تجلى البعد وفي المواد تجلى القرب وأما البعد من الأسماء الإلهية فكل اسم لا بكون العبد تحت حكمه في الوقت‏\n\n\n### [ظهور الأسماء الإلهية من العبد]\n\n\nواعلم أن الأسماء الإلهية إذا ظهر بها العبد عن الأمر الإلهي فهو في قرب النيابة عن الله لا في قرب الحقيقة وإذا ظهر ببعضها عن غير أمر إلهي فهو في عين البعد المستعاذ منه في‏\n\n\nقوله صلى الله عليه وسلم وأعوذ بك منك‏\n\n\nلأن حقيقة المخلوق لا تتمكن في حال شهوده لمخلوقيته أن يكون خالقا والكبرياء والجبروت صفة للحق فإذا قامت بالعبد فقد قام به الحق فاستعاذ منه وما ثم أعظم منه يستعاذ به فاستعاذ به فأين كبرياء الحق وجبروته من صفته بأنه يفرح بتوبة عبده ويصف نفسه بجوع عبده وعطشه ومرضه فبمثل هذا استعاذ ومن مثل ذلك الآخر استعاذ والمنعوت بهما واحد العين وهو الله فاستعاذ به منه‏\n\n\nفقال وأعوذ بك منك‏\n\n\nوهذا غاية ما يصل إليه تعظيم المحدث إذا عظم جناب الله وأما بعد المخالفة فهو بعد العبد عن سعادته وعن الأسماء الإلهية التي تقتضي الموافقة في القرب بالطاعات وإن كان في المخالفة قريبا من الأسماء الإلهية التي تطلب الأكوان من حيث التكليف فإنها محصورة في عفو ومؤاخذة فهو قريب بالمؤاخذة منه فالمخالفة تطلب الرحمة وتتعرض للعقوبة وهو سبحانه على مشيئته في ذلك فلم يبق في بعد المخالفة إلا البعد عن سعادته إما بنقصان حظ عن غيره أو مؤاخذة بالجريمة وأما البعد منك الذي ذكرته الطائفة فهو قوله لأبي يزيد اترك نفسك وتعال ومن ترك نفسه بعد عنها وقد بينا لك في هذا الباب معنى هذا القول والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Sixty-One: Concerning the Knowledge of Distance (البعد)\n\n[That Distance (البعد) is Persistence in Opposition (المخالفة) to God the Exalted]\n\nKnow that Distance (البعد) is persistence in opposition (المخالفة). It is also applied to the distance *from you*.\n\n> The distance from you is nearness (دنو), *** oddness (وتر), evenness (شفع), and turning (تو).\n> When I saw an Imam *** saying to the people, \"Straighten\n> your rows in a prayer *** that possesses loftiness and nearness (دنو),\"\n> I knew that my existence (وجودي) *** possesses subsistence (البقاء) and elevation (السمو).\n\nKnow also that Distance (البعد) varies according to the variation of states (الأحوال), and the context of the states indicates what is intended by it. Furthermore, the states and everything we have mentioned concerning what constitutes nearness (قرب) — if it is not an attribute of the servant (العبد) — then its absence is the very essence of Distance (البعد). This is the comprehensive principle for this chapter to which the people [i.e., the Sufis] have alluded.\n\n[The Ruling on Distance (البعد) according to Ibn Arabi]\n\nAs for the ruling on Distance (البعد) according to us, it may be contrary to what they [other Sufis] have established as distance, even while we affirm that what they established as distance is undoubtedly distance. However, we have added matters that the group overlooked—not that they were ignorant of what we mention, but they did not mention it in the knowledge of Distance (البعد) and instead included it under the chapter of Nearness (القرب). This is because Nearness (القرب) is conjunction (اجتماع) and Distance (البعد) is separation (افتراق). That by which conjunction occurs is different from that by which separation occurs; thus, Distance is other than Nearness.\n\nIf two matters are conjoined (اجتمع) in something, that is the utmost Nearness (القرب), because the essence (عين) of each one is the essence of the other in that wherein the conjunction occurred. If, however, each of the two essences is distinguished from its companion by an attribute (نعت) that the other does not possess, then it is distinguished from it. When it is distinguished from it, that is Distance (البعد), because it is not its essence (عين) in respect to that state by which separation (افتراق) occurred. This becomes apparent in the definitions (حدود) of things. When Distance occurs, the ruling changes. Distance may occur through an accidental attribute (نعت عرضي), such as place, time, definition (حد), measure, existents (الأكوان), and colors, in the case of one whose Essence (ذاته) demands these attributes. If two matters are conceived such that there is no conjunction between them whatsoever, and they are separated in all respects, then that is the utmost Distance. Thus, nothing is more distant from the World (العالم) than Allah, because there is nothing there, in terms of His Essence (ذاته), that conjoins them. This is found in His saying, the Exalted: <<فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ>> (Indeed, Allah is free from need of the worlds). Allah was, and there was nothing with Him.\n\nThen we descend to a degree of Distance (البعد) below this and say: The servant (العبد) cannot be the master of the one to whom he is a servant. Thus, nothing is more distant from the servant than his Master (سيده). Servanthood (العبودية) is not a state of nearness (قربة). Rather, the servant approaches his Master through his knowledge that he is His servant, and his knowledge that he is His servant is not the essence of his servanthood. His servanthood necessitates Distance from the Master, while his knowledge of it necessitates Nearness to the Master. Allah said to Abu Yazid al-Bistami when he was perplexed about Nearness (القرب) and did not know by what means he should approach Him. The Real (الحق) said to him in his secret heart: \"O Abu Yazid, approach Me by that which is not Mine: lowliness (الذلة) and destitution (الافتقار).\" The Glorified thus negated these two attributes—lowliness and destitution—from Himself. Whatever He negates from Himself is an attribute of Distance (بعد) from Him. Therefore, whoever possesses that attribute which necessitates Distance is where that attribute is, and that attribute necessitates Distance. Abu Yazid said to his Lord at another time, \"By what means shall I approach You?\" The Real said to him, \"Leave your self (نفسك) and come.\" When he leaves his self, he has left the ruling of his servanthood (عبوديته), since servanthood is the very essence of Distance from Lordship (السيادة). The servant is distant from the Master. Thus, in lowliness and destitution, He sought Nearness through servanthood, and in leaving the self, He sought Nearness through assuming the character of the Divine Attributes (التخلق بأخلاق الله), which is that by which conjunction (الاجتماع) occurs. The Theophany (التجلي) in non-matter is the Theophany of Distance (البعد), and in matters, it is the Theophany of Nearness (القرب). As for Distance (البعد) from the Divine Names (الأسماء الإلهية), it is every Name whose ruling the servant is not under at that time.\n\n[The Manifestation of the Divine Names (الأسماء الإلهية) by the Servant]\n\nKnow that when the servant manifests the Divine Names (الأسماء الإلهية) by Divine Command (الأمر الإلهي), he is in the nearness of vicegerency (قرب النيابة) on behalf of Allah, not in the nearness of Reality (قرب الحقيقة). If he manifests some of them without Divine Command, he is in the very essence of the Distance (البعد) from which refuge is sought in the saying of the Prophet, peace and blessings be upon him: \"And I seek refuge in You from You.\"\n\nThis is because the reality of the created being (المخلوق), while witnessing its createdness, cannot possibly be the Creator. Majesty (الكبرياء) and Omnipotence (الجبروت) are attributes of The Real (الحق). If they subsist in the servant, then The Real has subsisted in him, and he sought refuge from it. Since there is nothing greater than Him by which refuge can be sought, he sought refuge in Him. Where is the Majesty and Omnipotence of The Real compared to His attribute that He rejoices in the repentance of His servant, and describes Himself by the hunger, thirst, and sickness of His servant? It is from the former that refuge was sought, and from the latter that refuge was sought. Yet, the Entity (العين) described by both is one, which is Allah. Thus, he sought refuge in Him from Him.\n\nSo he said: \"And I seek refuge in You from You.\"\n\nThis is the utmost degree of veneration that the contingent being (المحدث) can reach when he venerates the Divine Presence (جناب الله). As for the Distance of Opposition (بعد المخالفة), it is the servant’s distance from his felicity and from the Divine Names (الأسماء الإلهية) that necessitate conformity in Nearness (القرب) through acts of obedience. Even though, in opposition, he is near to the Divine Names that demand the existents (الأكوان) in terms of religious obligation (التكليف)—for these Names are confined to forgiveness and retribution (مؤاخذة)—he is near to Him through retribution. Opposition (المخالفة) seeks Mercy and exposes one to punishment. He, the Glorified, acts according to His Will in this matter. Therefore, nothing remains in the Distance of Opposition except distance from one's felicity, either by a reduction of one's portion compared to others or by retribution for the transgression. As for the distance *from you* (البعد منك) mentioned by the group [of Sufis], it is His saying to Abu Yazid: \"Leave your self and come.\" Whoever leaves his self has become distant from it. We have explained to you in this chapter the meaning of this saying. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).",
    "ur": "باب دو سو اکسٹھ: بعد (دوری) کی معرفت میں\n\n[کہ بعد (دوری) اللہ تعالیٰ کی مخالفت پر قائم رہنا ہے]\n\nجان لو کہ بعد (دوری) مخالفت پر قائم رہنے کا نام ہے، اور یہ اطلاق تم سے دوری پر بھی ہوتا ہے۔\n\n> تم سے دوری قربت ہے *** طاق، جفت اور لپیٹ ہے\n> جب میں نے ایک امام کو دیکھا *** جو قوم سے کہتا ہے کہ سیدھے ہو جاؤ\n> اپنی صفیں اس نماز میں *** جس کے لیے بلندی اور نزدیکی ہے\n> میں نے جان لیا کہ میری ہستی (الوجود) *** بقا (البقاء) اور رفعت رکھتی ہے\n\nاور جان لو کہ بعد (البعد) احوال کے اختلاف سے مختلف ہوتا ہے، اور جو مراد ہوتی ہے اس پر احوال کے قرائن دلالت کرتے ہیں۔ اور یہ کہ احوال اور وہ سب کچھ جو ہم نے ذکر کیا ہے، جو قربت (القرب) ہوتا ہے، اگر وہ بندے کی صفت نہ ہو تو اس کا عدم ہی عین بعد (البعد) ہے۔ یہ وہ جامع نکتہ ہے جس کی طرف قوم نے اشارہ کیا ہے۔\n\n[ابن عربی کے نزدیک بعد (دوری) کا حکم]\n\nاور ہمارے نزدیک بعد (البعد) کا حکم اس کے خلاف بھی ہو سکتا ہے جسے انہوں نے بعد قرار دیا ہے، اگرچہ ہم بھی اسے بعد ہی قرار دیتے ہیں کہ وہ بلاشبہ بعد ہے۔ مگر ہم نے اس میں کچھ ایسے امور کا اضافہ کیا ہے جنہیں جماعت نے نظرانداز کر دیا ہے۔ یہ نہیں کہ وہ ان باتوں سے ناواقف تھے جو ہم ذکر کر رہے ہیں، بلکہ انہوں نے انہیں بعد (البعد) کی معرفت (المعرفۃ) میں ذکر نہیں کیا، بلکہ قربت (القرب) کے باب میں شامل کر دیا۔ اور وہ یہ ہے کہ قربت (القرب) اجتماع ہے اور بعد (البعد) افتراق (جدائی) ہے۔ اور جس چیز سے اجتماع واقع ہوتا ہے وہ اس سے مختلف ہے جس سے افتراق واقع ہوتا ہے۔ لہٰذا بعد، قربت سے مختلف ہے۔ پس جب دو چیزیں کسی ایک شے میں جمع ہو جائیں تو یہ قربت کی انتہا ہے، کیونکہ ان میں سے ہر ایک کا عین (حقیقت) دوسرے کا عین ہے اس چیز میں جس میں اجتماع واقع ہوا۔ اور جب دونوں عینوں میں سے ہر ایک اپنے ساتھی سے ایسی صفت کے ذریعے ممتاز ہو جائے جو دوسرے میں نہ ہو، تو وہ اس سے ممتاز ہو گیا، اور جب وہ اس سے ممتاز ہو گیا تو یہی بعد (البعد) ہے، کیونکہ وہ اس کا عین نہیں ہے اس حیثیت سے کہ وہ اس پر ہے جس سے اس کے لیے افتراق واقع ہوا۔ اور یہ چیز اشیاء کی حدود میں ظاہر ہوتی ہے۔ اور جب بعد واقع ہوتا ہے تو حکم مختلف ہو جاتا ہے۔ اور بعد کسی عرضی صفت کے ذریعے بھی ہو سکتا ہے، جیسے مکان، زمان، حد، مقدار، اکوان (کائناتیں) اور الوان (رنگ) اس شخص کے حق میں جس کی ذات ان صفات کا تقاضا کرتی ہے۔ پس جب دو امور ایسے سمجھے جائیں جن میں سے ایک کا دوسرے کے ساتھ کوئی اجتماع نہ ہو اور وہ تمام وجوہ سے جدا ہوں، تو یہ بعد کی انتہا ہے۔ پس ذات حق (الحق) سے زیادہ کوئی چیز عالم (کائنات) سے دور نہیں، کیونکہ ذات حق (الحق) کی حیثیت سے وہاں کوئی ایسی شے نہیں جو ان دونوں کو جمع کرے۔ اور یہ اللہ تعالیٰ کے اس فرمان میں موجود ہے:\n**فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ** (تو بے شک اللہ تمام جہانوں سے بے نیاز ہے)۔\nاللہ تھا اور اس کے ساتھ کوئی شے نہ تھی۔\nپھر ہم اس سے کم درجے کے بعد (البعد) میں اترتے ہیں اور کہتے ہیں کہ بندہ (العبد) اپنے آقا (السيد) کا مالک نہیں ہو سکتا جس کا وہ بندہ ہے۔ پس بندے سے زیادہ کوئی شے اپنے آقا سے دور نہیں۔ لہٰذا بندگی (العبودیۃ) قربت (القرب) کی حالت نہیں ہے۔ بندہ اپنے آقا سے صرف اس علم کے ذریعے قریب ہوتا ہے کہ وہ اس کا بندہ ہے، اور اس کا یہ علم کہ وہ اس کا بندہ ہے، اس کی بندگی کا عین نہیں ہے۔ پس اس کی بندگی آقا سے دوری کا تقاضا کرتی ہے، اور اس کا علم اس بندگی کے ذریعے آقا سے قربت کا فیصلہ کرتا ہے۔\nاللہ تعالیٰ نے ابو یزید بسطامی سے فرمایا جب وہ قربت (القرب) میں حیران ہوئے اور نہ جان سکے کہ وہ کس چیز کے ذریعے اس کا قرب حاصل کریں، تو ذات حق (الحق) نے ان کے راز میں فرمایا: \"اے ابو یزید! میرے قریب اس چیز کے ذریعے آؤ جو میری نہیں ہے، یعنی ذلت (الذلة) اور محتاجی (الافتقار)۔\"\nپس اللہ سبحانہ نے اپنے آپ سے ان دو صفات، ذلت اور محتاجی، کی نفی کی۔ اور جس چیز کی اس نے اپنے آپ سے نفی کی، وہ اس سے بعد (دوری) کی صفت ہے۔ پس جس میں وہ صفت قائم ہو جو بعد کا تقاضا کرتی ہے، وہ اسی جگہ ہے جہاں وہ صفت ہے، اور وہ بعد کا تقاضا کرتی ہے۔\nاور ابو یزید نے ایک دوسرے وقت اپنے رب سے عرض کیا: \"میں کس چیز کے ذریعے آپ کا قرب حاصل کروں؟\" تو ذات حق (الحق) نے فرمایا: \"اپنے نفس کو چھوڑ دے اور آ جا۔\"\nاور جب اس نے اپنے نفس کو چھوڑ دیا تو اس نے اپنی بندگی کے حکم کو چھوڑ دیا، کیونکہ بندگی سیادت (آقائی) سے عین بعد (البعد) ہے۔ پس بندہ آقا سے دور ہے۔ لہٰذا ذلت اور محتاجی میں اس سے بندگی کے ذریعے قربت کا مطالبہ کیا گیا، اور نفس کو چھوڑنے میں اس سے اللہ کے اخلاق سے متخلق ہونے کے ذریعے قربت کا مطالبہ کیا گیا، اور یہی وہ چیز ہے جس سے اجتماع واقع ہوتا ہے۔\nپس غیر مادی میں تجلی (التجلی) بعد (البعد) کی تجلی ہے، اور مواد میں تجلی قربت (القرب) کی تجلی ہے۔\nاور اسماء الٰہیہ سے بعد (البعد) یہ ہے کہ ہر وہ اسم جس کے حکم کے تحت بندہ اس وقت نہ ہو۔\n\n[بندے سے اسماء الٰہیہ کا ظہور]\n\nاور جان لو کہ جب بندہ اسماء الٰہیہ (الأسماء الإلهية) کے ذریعے امر الٰہی سے ظاہر ہوتا ہے، تو وہ اللہ کی نیابت کی قربت (القرب) میں ہوتا ہے، نہ کہ حقیقت کی قربت میں۔ اور جب وہ ان میں سے بعض کے ذریعے غیر امر الٰہی سے ظاہر ہوتا ہے، تو وہ عین اس بعد (البعد) میں ہوتا ہے جس سے پناہ مانگی گئی ہے، جیسا کہ نبی اکرم صلی اللہ علیہ وسلم کے اس فرمان میں ہے:\n**وأعوذ بك منك** (اور میں تیری پناہ مانگتا ہوں تجھ سے)۔\nکیونکہ مخلوق کی حقیقت اپنی مخلوقیت کے شہود (الشہود) کی حالت میں خالق ہونے کی طاقت نہیں رکھتی۔ اور کبریاء اور جبروت ذات حق (الحق) کی صفت ہے۔ پس جب یہ بندے میں قائم ہو جائے تو ذات حق (الحق) اس کے ذریعے قائم ہو گیا، لہٰذا اس سے پناہ مانگی گئی۔ اور وہاں اس سے عظیم کوئی شے نہیں جس سے پناہ مانگی جائے، لہٰذا اس نے اسی سے پناہ مانگی۔\nپس ذات حق (الحق) کی کبریاء اور جبروت کہاں، اور اس کی اس صفت سے کہاں نسبت کہ وہ اپنے بندے کی توبہ پر خوش ہوتا ہے، اور اپنے آپ کو اپنے بندے کی بھوک، پیاس اور بیماری سے متصف کرتا ہے؟\nپس اسی طرح کی چیز سے پناہ مانگی گئی، اور اس دوسری طرح کی چیز سے بھی پناہ مانگی گئی۔ اور ان دونوں سے متصف ہونے والا عین (حقیقت) ایک ہی ہے، اور وہ اللہ ہے۔ پس اس نے اسی سے اس کی پناہ مانگی۔\n**فقال وأعوذ بك منك** (پس فرمایا: اور میں تیری پناہ مانگتا ہوں تجھ سے)۔\nاور یہ وہ انتہا ہے جہاں تک محدث (مخلوق) کی تعظیم پہنچتی ہے جب وہ اللہ کی جناب کی تعظیم کرتا ہے۔\nاور جہاں تک مخالفت کا بعد (البعد) ہے، تو وہ بندے کا اپنی سعادت سے اور ان اسماء الٰہیہ سے بعد ہے جو طاعات کے ذریعے قربت (القرب) میں موافقت کا تقاضا کرتے ہیں۔ اگرچہ مخالفت میں وہ ان اسماء الٰہیہ کے قریب ہوتا ہے جو تکلیف (شرعی ذمہ داری) کی حیثیت سے اکوان (کائناتوں) کا تقاضا کرتے ہیں، کیونکہ وہ عفو اور مؤاخذہ (پکڑ) میں محصور ہیں۔ پس وہ مؤاخذہ کے ذریعے اس کے قریب ہے۔ لہٰذا مخالفت رحمت کا تقاضا کرتی ہے اور عقوبت (سزا) کے سامنے آتی ہے، اور وہ سبحانہ اس میں اپنی مشیئت پر ہے۔\nپس مخالفت کے بعد (البعد) میں صرف اپنی سعادت سے دوری باقی رہتی ہے، یا تو دوسروں کے مقابلے میں حصہ کی کمی کی صورت میں، یا جرم پر مؤاخذہ کی صورت میں۔\nاور جہاں تک \"تم سے دوری\" (البعد منك) کا تعلق ہے جس کا ذکر طائفہ نے کیا ہے، تو وہ ابو یزید سے اللہ کا یہ فرمان ہے: \"اپنے نفس کو چھوڑ دے اور آ جا۔\" اور جس نے اپنے نفس کو چھوڑ دیا، اس نے اس سے دوری اختیار کر لی۔ اور ہم نے اس باب میں اس قول کا معنی تمہارے لیے بیان کر دیا ہے۔\n**وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب دویست و شصت و یکم در معرفت بُعد (دوری)\n\n[اینکه بُعد (دوری) عبارت است از پافشاری بر مخالفت با خداوند متعال]\n\nبدان که بُعد (دوری) عبارت است از پافشاری بر مخالفت، و همچنین بر دوری از تو نیز اطلاق می‌شود.\n\n> دوری از تو، نزدیکی است *** و فرد و زوج و تویی\n> چون امامی را دیدم *** که به قوم می‌گوید: راست کنید\n> صف‌هایتان را در نمازی *** که برای آن بلندی و نزدیکی است\n> دانستم که هستی (الوجود) من *** بقا (البقاء) و والایی دارد.\n\nو بدان که بُعد (دوری) با اختلاف احوال، متفاوت می‌شود و قرائن احوال بر آنچه از آن اراده شده دلالت می‌کند. و احوال و هر آنچه ذکر کردیم، در صورتی که صفت عبد نباشد، عدم آن عین بُعد (دوری) است. این است جامع این بابی که قوم (صوفیان) به آن اشاره کرده‌اند.\n\n[حکم بُعد (دوری) نزد ابن عربی]\n\nاما حکم بُعد (دوری) نزد ما، ممکن است بر خلاف آنچه آنان (صوفیان پیشین) بُعد (دوری) مقرر کرده‌اند باشد، با وجود اینکه ما نیز آنچه را آنان بُعد (دوری) مقرر کرده‌اند، بدون شک بُعد (دوری) می‌دانیم. جز اینکه ما اموری را به آن افزوده‌ایم که جماعت (صوفیان) از آن غفلت کرده‌اند؛ نه اینکه آنچه ما ذکر می‌کنیم را ندانسته‌اند، بلکه آن را در معرفت بُعد (دوری) ذکر نکرده و در باب قرب (نزدیکی) وارد ساخته‌اند. و آن این است که قرب (نزدیکی) اجتماع است و بُعد (دوری) افتراق (جدایی). و آنچه اجتماع با آن واقع می‌شود، غیر از چیزی است که افتراق با آن واقع می‌شود؛ پس بُعد (دوری) غیر از قرب (نزدیکی) است. هرگاه دو امر در چیزی جمع شوند، آن نهایت قرب (نزدیکی) است، زیرا عین هر یک از آن دو، عین دیگری است در آنچه اجتماع در آن واقع شده است. اما هرگاه هر یک از این دو عین، با صفتی که دیگری بر آن نیست، از صاحب خود متمایز شود، پس از او تمایز یافته است. و چون تمایز یابد، آن بُعد (دوری) است، زیرا از حیث آنچه بر آن است و افتراق به واسطه آن برایش واقع شده، عین دیگری نیست. و این امر در حدود اشیاء آشکار می‌شود و هرگاه بُعد (دوری) واقع شود، حکم متفاوت می‌گردد.\n\nو گاهی بُعد (دوری) به صفتی عرضی است، مانند مکان، زمان، حد، مقدار، اکوان (هستی‌ها) و الوان (رنگ‌ها)، در حق کسی که ذاتش این صفات را می‌طلبد. پس هرگاه دو امر درک شوند که هیچ یک از آن‌ها با دیگری اجتماع ندارد و از تمام جهات از یکدیگر جدا شده‌اند، آن نهایت بُعد (دوری) است. پس هیچ چیز از عالم (جهان) دورتر از حق (الحق) نیست، زیرا از حیث ذات (الذات) چیزی وجود ندارد که آن دو را جمع کند. و این در قول خداوند متعال موجود است: «فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ» (پس همانا خداوند از جهانیان بی‌نیاز است). و خداوند بود و هیچ چیز با او نبود.\n\nسپس در درجه‌ای پایین‌تر از این درجات بُعد (دوری) فرود می‌آییم و می‌گوییم: بنده نمی‌تواند سید (آقا) کسی باشد که بنده اوست. پس هیچ چیز از بنده دورتر از سیدش نیست. بنابراین، عبودیت (بندگی) به خودی خود حال قرب (نزدیکی) نیست، بلکه بنده با علمش به اینکه بنده اوست، به سیدش نزدیک می‌شود. و علم او به اینکه بنده اوست، عین عبودیتش نیست. پس عبودیتش مقتضی بُعد (دوری) از سید است، و علمش به آن، حکم به قرب (نزدیکی) به سید می‌دهد.\n\nخداوند به ابویزید بسطامی فرمود، هنگامی که در قرب (نزدیکی) حیران شد و ندانست با چه چیزی به او تقرب جوید، حق (الحق) در سرّ او فرمود: ای ابویزید، به من با چیزی تقرب جوی که برای من نیست: خواری (الذلة) و نیازمندی (الافتقار). پس سبحانه این دو صفت، یعنی خواری و نیازمندی، را از خود نفی کرد. و آنچه را از خود نفی کرده، صفت بُعد (دوری) از اوست. پس هر کس آن صفتی را که مقتضی بُعد (دوری) است دارا باشد، در همان جایی است که آن صفت قرار دارد، و آن صفت مقتضی بُعد (دوری) است.\n\nو ابویزید در وقتی دیگر به پروردگارش گفت: با چه چیزی به تو تقرب جویم؟ حق (الحق) به او فرمود: نفست را رها کن و بیا. و هرگاه نفسش را رها کند، حکم عبودیتش را رها کرده است، زیرا عبودیت عین بُعد (دوری) از سیادت (سروری) است. پس بنده از سید دور است. بنابراین، در خواری و نیازمندی، قرب (نزدیکی) را به واسطه عبودیت از او خواست، و در ترک نفس، قرب (نزدیکی) را به واسطه تخلق به اخلاق حق (الحق) از او خواست، و این همان چیزی است که اجتماع با آن حاصل می‌شود. پس تجلی (التجلی) در غیر ماده، تجلی (التجلی) بُعد (دوری) است، و در مواد، تجلی (التجلی) قرب (نزدیکی) است.\n\nو اما بُعد (دوری) از اسماء الهی، عبارت است از هر اسمی که بنده در آن وقت تحت حکم آن نباشد.\n\n[ظهور اسماء الهی از بنده]\n\nو بدان که هرگاه بنده به واسطه اسماء الهی و به امر الهی ظهور یابد، در قرب (نزدیکی) نیابت از حق (الحق) است، نه در قرب (نزدیکی) حقیقت (الحقیقة). و هرگاه به واسطه برخی از آن‌ها بدون امر الهی ظهور یابد، در عین بُعد (دوری) است که از آن استعاذه شده است در قول پیامبر (ص): «وأعوذ بك منك» (و پناه می‌برم به تو از تو).\n\nزیرا حقیقت مخلوق در حال شهود (الشهود) مخلوقیت خود، نمی‌تواند خالق باشد. و کبریا و جبروت صفت حق (الحق) است. پس هرگاه این صفات در بنده قائم شوند، حق (الحق) در او قائم شده است، پس از آن استعاذه کرد. و چیزی بزرگتر از او نیست که به آن استعاذه شود، پس به او استعاذه کرد. کبریا و جبروت حق (الحق) کجا و صفت او که به توبه بنده‌اش شاد می‌شود و خود را به گرسنگی، تشنگی و بیماری بنده‌اش وصف می‌کند کجا؟ پس از مانند این (صفات جلال) استعاذه کرد و از مانند آن دیگری (صفات جمال) استعاذه کرد، در حالی که موصوف به هر دو یکی است و آن حق (الحق) است. پس به او از خودش استعاذه کرد و فرمود: «وأعوذ بك منك» (و پناه می‌برم به تو از تو).\n\nو این نهایت چیزی است که تعظیم مُحدَث (مخلوق) به آن می‌رسد، هنگامی که جناب حق (الحق) را تعظیم کند. و اما بُعد (دوری) مخالفت، عبارت است از دوری بنده از سعادتش و از اسماء الهی که مقتضی موافقت در قرب (نزدیکی) به واسطه طاعات هستند. اگرچه در مخالفت، به اسماء الهی که اکوان (هستی‌ها) را از حیث تکلیف می‌طلبند، نزدیک است؛ زیرا این اسماء در عفو و مؤاخذه (بازخواست) محصورند، پس او به واسطه مؤاخذه به آن نزدیک است.\n\nپس مخالفت، رحمت را می‌طلبد و در معرض عقوبت قرار می‌گیرد، و او سبحانه در این امر بر مشیت (خواست) خویش است. بنابراین، در بُعد (دوری) مخالفت، چیزی باقی نمی‌ماند جز دوری از سعادتش، یا به واسطه نقصان بهره‌ای نسبت به دیگری، یا مؤاخذه به سبب جرم. و اما «البعد منك» (دوری از تو) که طایفه (صوفیان) ذکر کرده‌اند، همان قول حق (الحق) به ابویزید است که: نفست را رها کن و بیا. و هر کس نفسش را رها کند، از آن دور شده است. و ما در این باب معنای این قول را برای تو بیان کردیم. «وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}