{
  "id": 41,
  "title": {
    "ar": "الباب الحادي والأربعون في معرفة أهل الليل واختلاف طبقاتهم وتباينهم في مراتبهم وأسرار أقطابهم",
    "en": "Chapter Forty-One: Concerning the Gnosis of the People of the Night (أهل الليل), the Variation of their Ranks, their Distinction in their Levels (مراتب), and the Secrets of their Poles (أقطاب)",
    "ur": "اکتالیسواں باب: اہل شب (أهل الليل) کی معرفت (المعرفۃ) کے بیان میں، اور ان کے طبقات کے اختلاف، اور ان کے مراتب میں ان کے تفاوت، اور ان کے اقطاب (أقطاب) کے اسرار کے بیان میں۔",
    "fa": "باب چهل و یکم در معرفت اهل شب و اختلاف طبقاتشان و تفاوتشان در مراتب و اسرار اقطابشان."
  },
  "content": {
    "ar": "## (الباب الحادي والأربعون في معرفة أهل الليل واختلاف طبقاتهم وتباينهم في مراتبهم وأسرار أقطابهم)\n\n\n(بسم الله الرحمن الرحيم)\n\n\n> ألا إن أهل الليل أهل تنزل *** وأهل معاريج وأهل تنقل‏\n\n\n> فمن صاعد نحو المقام بهمة *** ومن نازل يبغي اللحوق بأسفل‏\n\n\n> بحكم التداني والتدلي هما وعن *** وجود الترقي والتلقي بمعزل‏\n\n\n> فإن قلت فيهم إنهم خير عصبة *** صدقت فقد حلوا بأكرم منزل‏\n\n\n> وإن قلت فيهم إنهم شر فتية *** صدقت فليسوا بالنبي ولا الولي‏\n\n\n> فهم لا همو ليسوا بهم وبغيرهم *** ولكنهم في معقل متزلزل‏\n\n\n> عزيز الحمى بين المشاهد والنهي *** وبين جنوب في الهبوب وشمال‏\n\n\n> فما منهمو إلا إمام مسود *** إذا أصبحوا نالوا المنى بالتأمل‏\n\n\n> لهم نظرة لا يعرف الغير حكمها *** لهم سطوة في كل تاج مكلل‏\n\n\n### [الليل والغيب‏]\n\n\nاعلم أيدك الله بروح منه أن الله جعل الليل لأهله مثل الغيب لنفسه فكما لا يشهد أحد فعل الله في خلقه لحجاب الغيب الذي أرسله دونهم كذلك لا يشهد أحد فعل أهل الليل مع الله في عبادتهم لحجاب ظلمة الليل التي أرسلها الله دونهم فهم خير عصبة في حق الله وهم شر فتية في حق أنفسهم ليسوا بأنبياء تشريع لما ورد من غلق باب النبوة ولا يقال في واحد منهم عندهم إنه ولي لما فيه من المشاركة مع اسم الله فيقال فيهم أولياء ولا يقولون ذلك عن أنفسهم وإن بشروا فجعل الليل لباسا لأهله يلبسونه فيسترهم هذا اللباس عن أعين الأغيار يتمتعون في خلواتهم الليلية بحبيبهم فيناجونه من غير رقيب لأنه جعل النوم في أعين الرقباء سباتا أي راحة لأهل الليل إلهية كما هو راحة للناس طبيعية فإذا نام الناس استراح هؤلاء مع ربهم وخلوا به حسا ومعنى فيما يسألونه من قبول توبة وإجابة دعوة ومغفرة حوبة وغير ذلك فنوم الناس راحة لهم وإن الله تعالى ينزل إليهم بالليل إلى السماء الدنيا فلا يبقى بينه وبينهم حجاب فلكي ونزوله إليهم رحمة بهم ويتجلى من سماء الدنيا عليهم كما\n\n\nورد في الخبر فيقول كذب من ادعى محبتي فإذا جنه الليل نام عني أ ليس كل محب يطلب الخلوة بحبيبه هو أنا ذا قد تجليت لعبادي هل من داع فاستجيب له هل من تائب فأتوب عليه هل من مستغفر فاغفر له حتى ينصدع‏\n### [مسامرة أهل الليل في محاريبهم‏]\n\n\nفأهل الليل هم الفائزون بهذه الحظوة في هذه الخلوة وهذه المسامرة في محاريبهم فهم قائمون يتلون كلامه ويفتحون أسماعهم لما يقول لهم في كلامه إذا قال يا أَيُّهَا النَّاسُ يصفون ويقولون نحن الناس ما تريد منا يا ربنا في ندائك هذا فيقول لهم عز وجل على لسانهم بتلاوتهم كلامه الذي أنزله اتَّقُوا رَبَّكُمْ إِنَّ زَلْزَلَةَ السَّاعَةِ شَيْ‏ءٌ عَظِيمٌ يا أَيُّهَا النَّاسُ يقولون لبيك ربنا يقول لهم اتقوا ربكم الَّذِي جَعَلَ لَكُمُ الْأَرْضَ فِراشاً والسَّماءَ بِناءً وأَنْزَلَ من السَّماءِ ماءً فَأَخْرَجَ به من الثَّمَراتِ رِزْقاً لَكُمْ فَلا تَجْعَلُوا لِلَّهِ أَنْداداً وأَنْتُمْ تَعْلَمُونَ فيقولون يا ربنا خاطبتنا فسمعنا وفهمتنا ففهمنا فيا ربنا وفقنا واستعملنا فيما طلبته منا من عبادتك وتقواك إذ لا حول لنا ولا قوة إلا بك ومن نحن حتى تنزل إلينا من علو جلالك وتنادينا وتسألنا وتطلب منا يا أَيُّهَا النَّاسُ يقولون لبيك إِنَّ وَعْدَ الله حَقٌّ فَلا تَغُرَّنَّكُمُ الْحَياةُ الدُّنْيا فيقولون يا ربنا أسمعتنا فسمعنا وأعلمتنا فعلمنا فأعصمنا وتعطف علينا فالمنصور من نصرته والمؤيد من أيدته والمخذول من خذلته يا أَيُّهَا الْإِنْسانُ فيقول الإنسان منهم لبيك يا رب ما غَرَّكَ بِرَبِّكَ الْكَرِيمِ فيقول كرمك يا رب فيقول صدقت يا أَيُّهَا الَّذِينَ آمَنُوا فيقولون لبيك ربنا اتَّقُوا الله حَقَّ تُقاتِهِ اتَّقُوا الله وقُولُوا قَوْلًا سَدِيداً يقولون وأي قول لنا إلا ما تقولنا وهل لمخلوق حول أو قوة إلا بك فاجعل نطقنا ذكرك وقولنا تلاوة كتابك يا أَيُّهَا الَّذِينَ آمَنُوا فيقولون لبيك ربنا فيقول تعالى عَلَيْكُمْ أَنْفُسَكُمْ لا يَضُرُّكُمْ من ضَلَّ إِذَا اهْتَدَيْتُمْ فيقولون ربنا أغريتنا بأنفسنا لما جعلتها محلا لإيمانك فقلت وفي أَنْفُسِكُمْ أَ فَلا تُبْصِرُونَ وقلت سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ والآيات ليست مطلوبة إلا لما تدل عليه وأنت مدلولها فكأنك تقول في قولك عَلَيْكُمْ أَنْفُسَكُمْ أي ألزمونا وثابروا علينا وألظوا بنا ثم قلت لا يَضُرُّكُمْ من ضَلَّ أي حار وتلف حين طلبنا بفكره فأراد أن يدخلنا تحت حكم نظره وعقله إِذَا اهْتَدَيْتُمْ بما عرفتكم به مني في كتابي وعلى لسان رسولي فعرفتموني بما وصفت لكم به نفسي فما عرفتموني إلا بي فلم تضلوا فكانت لكم هدايتي وتقريبي نورا تمشون به على صراطنا المستقيم فلا يزال دأب أهل الليل هكذا مع الله في كل آية يقرءونها في صلاتهم وفي كل ذكر يذكرونه به حتى ينصدع الفجر\n\n\n### [الليل لله والنهار للإنسان‏]\n\n\nقال محمد بن عبد الجبار النفري وكان من أهل الليل أوقفني الحق في موقف العلم وذكر رضي الله عنه ما قال له الحق في موقفه ذلك فكان من جملة ما قال له في ذلك الموقف يا عبدي الليل لي لا للقرآن يتلى الليل لي لا للمحمدة والثناء يقول الله تعالى إِنَّ لَكَ في النَّهارِ سَبْحاً طَوِيلًا فاجعل الليل لي كما هو لي فإن في الليل نزولي فلا أراك في النهار في معاشك فإذا جاء الليل وطلبتك ونزلت إليك وجدتك نائما في راحتك وفي عالم حياتك وما ثم إلا ليل ونهار فلا في النهار وجدتك وقد جعلته لك ولم أنزل فيه إليك وسلمته لك وجعلت الليل لي فنزلت إليك فيه لأناجيك وأسامرك وأقضي حوائجك فوجدتك قد نمت عني وأسأت الأدب معي مع دعواك محبتي وإيثار جنابي فقم بين يدي وسلني حتى أعطيك مسألتك وما طلبتك لتتلو القرآن فتقف مع معانيه فإن معانيه تفرقك عني فآية تمشي بك في جنتي وما أعددت لأوليائي فيها فأين أنا إذا كنت أنت في جنتي مع الحور المقصورات في الخيام كأنهن الياقوت والمرجان متكئا عَلى‏ فُرُشٍ بَطائِنُها من إِسْتَبْرَقٍ وجَنَى الْجَنَّتَيْنِ دانٍ تسقى من رَحِيقٍ مَخْتُومٍ مِزاجُهُ من تَسْنِيمٍ وآية توقفك مع ملائكتي وهم يدخلون عليك من كُلِّ بابٍ سَلامٌ عَلَيْكُمْ بِما صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ وآية تستشرف بك على جهنم فتعاين ما أعددت فيها لمن عصاني وأشرك بي من سَمُومٍ وحَمِيمٍ وظِلٍّ من يَحْمُومٍ لا بارِدٍ ولا كَرِيمٍ وترى الحطمة وما أَدْراكَ ما الْحُطَمَةُ نارُ الله الْمُوقَدَةُ الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ إِنَّها عَلَيْهِمْ مُؤْصَدَةٌ أي مسلطة في عَمَدٍ مُمَدَّدَةٍ أين أنا يا عبدي إذا تلوت هذه الآية وأنت بخاطرك وهمتك في الجنة تارة وفي جهنم تارة ثم تتلو آية فتمشي بك في القارعة وما أَدْراكَ ما الْقارِعَةُ يَوْمَ يَكُونُ النَّاسُ كَالْفَراشِ الْمَبْثُوثِ وتَكُونُ الْجِبالُ كَالْعِهْنِ الْمَنْفُوشِ يوم تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّا أَرْضَعَتْ وتَضَعُ كُلُّ ذاتِ حَمْلٍ حَمْلَها وتَرَى النَّاسَ سُكارى‏ وما هُمْ بِسُكارى‏ ولكِنَّ عَذابَ الله شَدِيدٌ وترى في ذلك اليوم من هذه الآية يَفِرُّ الْمَرْءُ من أَخِيهِ وأُمِّهِ وأَبِيهِ وصاحِبَتِهِ وبَنِيهِ لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ وترى العرش في ذلك اليوم تحمله ثمانية أملاك وفي ذلك اليوم تُعْرَضُونَ فأين أنا والليل لي فها أنت يا عبدي في النهار في معاشك وفي الليل فيما تعطيه تلاوتك من جنة ونار وعرض فأنت بين آخرة\nودنيا وبرزخ فما تركت لي وقتا تخلو بي فيه إلا جعلته لنفسك والليل لي يا عبدي لا للمحمدة والثناء ثم تتلو آية فَأُولئِكَ (مَعَ) الَّذِينَ أَنْعَمَ الله عَلَيْهِمْ من النَّبِيِّينَ والصِّدِّيقِينَ والشُّهَداءِ والصَّالِحِينَ فتشاهدهم في تلاوتك وتفكر في مقاماتهم وأحوالهم وما أعطيت الْمُؤْمِنِينَ والْمُؤْمِناتِ والْقانِتِينَ والْقانِتاتِ والصَّادِقِينَ والصَّادِقاتِ والصَّابِرِينَ والصَّابِراتِ والْخاشِعِينَ والْخاشِعاتِ والْمُتَصَدِّقِينَ والْمُتَصَدِّقاتِ والصَّائِمِينَ والصَّائِماتِ فوقفت بالثناء والمحمدة مع كل طائفة أثنيت عليهم في كتابي فأين أنا وأين خلوتك بي‏\n\n\n### [تلاوة العارف المحقق‏]\n\n\nما عرفني ولا عرف مقدار قولي الليل لي وما عرف لما ذا نزلت إليك بالليل إلا العارف المحقق الذي لقيه بعض إخوانه فقال له يا أخي اذكرني في خلوتك بربك فأجابه ذلك العبد فقال إذا ذكرتك فلست معه في خلوة فمثل ذلك عرف قدر نزولي إلى السماء الدنيا بالليل ولما ذا نزلت ولمن طلبت فأنا أتلو كتابي عليه بلسانه وهو يسمع فتلك مسامرتي وذلك العبد هو الملتذ بكلامي فإذا وقف مع معانيه فقد خرج عني بفكره وتأمله فالذي ينبغي له أن يصغي إلي ويخلي سمعه لكلامي حتى أكون أنا في تلك التلاوة كما تلوت عليه وأسمعته أكون أنا الذي أشرح له كلامي وأترجم له عن معناه فتلك مسامرتي معه فيأخذ العلم مني لا من فكره واعتباره فلا يبالي بذكر جنة ولا نار ولا حساب ولا عرض ولا دنيا ولا آخرة فإنه ما نظرها بعقله ولا بحث عن الآية بفكره وإنما ألقى السمع لما أقوله له وهو شهيد حاضر معي أتولي تعليمه بنفسي فأقول له يا عبدي أردت بهذه الآية كذا وكذا وبهذه الآية الأخرى كذا وكذا هكذا إلى أن ينصدع الفجر فيحصل من العلوم على يقين ما لم يكن عنده فإنه مني سمع القرآن ومني سمع شرحه وتفسير معانيه وما أردت بذلك الكلام وبتلك الآية والسورة فيكون حسن الأدب معي في استماعه وإصاخته فإن طالبته بالمسامرة في ذلك فيجيبني بحضور ومشاهدة يعرض على جميع ما كلمته به وعلمته إياه فإن كان أخذه على الاستيفاء وإلا فنجبر له ما نقصه من ذلك فيكون لي لا له ولا لمخلوق فمثل هذا العبد هو لي والليل بيني وبينه فإذا انصدع الفجر استويت على عرشي أدبر الأمر أفصل الآيات ويمشي عبدي إلى معاشه وإلى محادثة إخوانه وقد فتحت بيني وبينه بابا في خلقي ينظر إلي منه وانظر إليه منه والخلق لا يشعرون فأحدثه على ألسنتهم وهم لا يعرفون ويأخذ مني على بصيرة وهم لا يعلمون فيحسبون أنه يكلمهم وما يكلم سواى ويظنون أنه يجيبهم وما يجيب إلا إياي كما قال بعض أصحاب هذه الصفة\n\n\n> يا مؤنسي بالليل إن هجع الورى *** ومحدثي من بينهم بنهاري‏\n\n\n### [طبقات أهل الليل مع الله‏]\n\n\nوإذ قد أبنت لك عن أهل الليل كيف ينبغي أن يكونوا في ليلهم فإن كنت منهم فقد علمتك الأدب الخاص بأهل الله وكيف ينبغي لهم أن يكونوا مع الله واعلم أنه تختلف طبقاتهم في ذلك فالزاهد حاله مع الله في ليله من مقام زهده والمتوكل حاله مع الله من مقام توكله وكذلك صاحب كل مقام ولكل مقام لسان هو الترجمان الإلهي فهم متباينون في المراتب بحسب الأحوال والمقامات وأقطاب أهل الليل هم أصحاب المعاني المجردة عن المواد المحسوسة والخيالية فهم واقفون مع الحق بالحق على الحق من غير حد ولا نهاية ووجود ضد\n\n\n### [معارج أهل الليل ومعارفهم‏]\n\n\nومن أهل الليل من يكون صاحب عروج وارتقاء ودنو فيتلقاه الحق في الطريق وهو نازل إلى السماء الدنيا فيتدلى إليه فيضع كنفه عليه وكل همة من كل صاحب معراج يتلقاها الحق في ذلك النزول حيث وجدها فمن الهمم من يلقاها الحق في السماء الدنيا ومنها من يلقاها في الثانية وفيما بينهما وفي الثالثة وفيما بينهما وفي الرابعة وفيما بينهما وفي الخامسة وفيما بينهما وفي السادسة وفيما بينهما وفي السابعة وفيما بينهما وفي الكرسي وفيما بينهما وفي العرش في أول النزول وفيما بينهما وهو مستوي الرحمن فيعطي لتلك الهمة من المعاني والمعارف والأسرار بحسب المنزل الذي لقيته فيه ثم تنزل معه إلى السماء الدنيا فتقف الهمم بين يديه ويستشرف الحق على من بقي من الهمم من أهل الليل في محاريبهم وما عرجت فيلقي إليهم الحق تعالى بحسب ما يسألونه في صلاتهم ودعائهم وهم في بيوتهم وفي محاريبهم فتسمع تلك الهمم التي لقيته في طريقها ما يكون منه جل جلاله إلى أولئك العبيد فيستفيدون علوما لم تكن عندهم فإنه قد يخطر لهؤلائك الذين ما صعدت هممهم من السؤال للحق في المعارف والأسرار ما لم يكن في قوة هذه الهمم أن تسألها لقصورها عنها فإذا سمعوا الجواب من الحق الذي يجيب به أولئك القوم الذين في محاريبهم وما اخترقت هممهم سماء ولا فلكا فيحصل لهم من العلم بالله بقدر ما سأل عنه أولئك الأقوام وثم همم أخر ارتقت فوق العرش إلى مرتبة\nالنفس فقد تجد الحق هناك وجود تنزيه ما هو وجودها له مثل وجودها له في عالم المساحة والمقدار فيشاهدون مقاما أنزه ومنزلا أقدس وبينية لا يحدها التقدير ولا يأخذها التصوير فبينيتها بينية تمييز علوم ومراتب فهوم ومن الهمم من يلقاه في العقل الأول ومن الهمم ما تلقاه في المقربين من الأرواح المهيمة ومن الهمم ما تلقاه في العماء ومن الهمم من تلقاه في الأرض المخلوقة من بقية طينة آدم عليه السلام فإذا لقيته هذه الهمم في هذه المراتب أعطاها على قدر تعطشها من المقام الذي بعثها على الترقي إلى هذه المراتب وينزلون معه إلى السماء الدنيا وعلى الحقيقة هو ينزلهم إلى السماء الدنيا وينزل معهم فيستفيدون من العلوم التي يهبها الحق لتلك الهمم التي ما تعدت العرش هكذا كل ليلة ثم تنزل هذه الهمم وقد عرفت ما أكرمها به الحق فاجتمعت بالهمم التي ما برحت من مكانها فوجدتها على طبقات فمنهم من وجد عندهم من العلوم التي لم تتقيد بترق وكان الحق أقرب إليها من حَبْلِ الْوَرِيدِ حين كان مع أولئك في العماء وفي السماء الدنيا وما بينهما قال تعالى وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ فهو مع كل همة حيث كانت ويجدون همما أرضية قد تقدست عن الأينية وعن مراتب العقول فلم تتقيد بحضرة فتنال من العلوم التي تليق بهذه الصفة التي وهبهم الحق منها ما حصلوا عليه من المعارف ما يبهت أولئك الهمم وهي من علوم الإطلاق الخارجة عن الحصر الأيني الفلكي وعن الحصر الروحاني العقلي فهم مع كونهم في ظلمة الطبيعة على نور أضاءت به تلك الظلمة لوجود المشاهدة\n\n\n### [الرؤية البصرية للأشياء المرئية]\n\n\nوهؤلاء هم الذين يعرفون أن إدراك الأشياء المرئية إنما هو من اجتماع نور البصر مع نور الجسم المستنير شمسا كان أو سراجا أو ما كان فتظهر المبصرات فلو فقد الجسم المستنير ما ظهر شي‏ء ولو فقد البصر ما أضاء شي‏ء مما يدركه البصر مع النور الخارج أصلا أ لا ترى صاحب الكشف إذا أظلم الليل وانغلق عليه باب بيته ويكون معه في تلك الظلمة شخص آخر وقد تساويا في عدم الكشف للمبصرات فيكون أحدهم ممن يكشف له في أوقات فيتجلى له نور يجتمع ذلك النور مع نور البصر فيدرك ما في ذلك البيت المظلم مما أراد الله أن يكشف له منه كله أو بعضه يراه مثل ما يراه بالنهار أو بالسراج ورفيقه الذي هو معه لا يرى إلا الظلمة غير ذلك لا يراه فإن ذلك النور ما تجلى له حتى يجتمع بنور بصره فينفر حجاب الظلمة فلو لم يكن الأمر كما ذكرناه لكان صاحب هذا الكشف مثل صاحبه لا يدرك شيئا أو يكون رفيقه مثله يدرك الأشياء فيكون إما من أهل الكشف مثله أو يدركه بنور العلم فإن المكاشف يدركه بنور الخيال كما يدركه النائم ورفيقه إلى جانبه مستيقظ لا يرى شيئا كذلك صاحب الكشف ولو سألت صاحب الكشف هل ترى ظلمة في حال كشفك لقال لا بل يقول أنارت البقعة حتى قلت إن الشمس ما غابت فأدركت المبصرات كما أدركها نهارا\n\n\n### [الكون ظلمة: لا يرى إلا بنورين‏]\n\n\nوهذه المسألة ما رأيت أحدا نبه عليها إلا أن كان وما وصل إلي فالكون كله في أصله مظلم فلا يرى إلا بالنورين فإنه يحدث هذا الأمر ونظيره الذي يؤيده إيجاد العالم فإنه من حيث ذاته عدم ولا يكتسب الوجود إلا من كونه قابلا وذلك لإمكانه واقتدار الحق المخصص المرجح وجوده على عدمه فلو زال القبول من الممكن لكان كالمحال لا يقبل الإيجاد وقد اشترك المحال والممكن قبل الترجيح بالوجود في العدم كما أنه مع قبوله لو لم يكن اقتدار الحق ما وجد عين هذا المعدوم الذي هو الممكن فلم تظهر الأعيان المعدومة للوجود إلا بكونها قابلة وهو مثل نور البصر وكون الحق قادرا وهو مثل نور الجسم النير فظهرت الأعيان كما ظهرت المبصرات بالنورين فكما إن الممكن لا يزال قابلا والحق مقتدرا ومريدا فينحفظ على الممكن إبقاء الوجود إذ له من ذاته العدم كذلك الباصر لا يزال نور بصره في بصره والشمس متجلية في نورها فتحفظ الأبصار المتعلق بالمبصرات وهي من ذاتها أعني المبصرات غير منورة بل هي مظلمة فاعقل إن كنت تعقل فهذا الأمر أصل ضلال العقلاء وهم لا يشعرون لما لم يعقلوه وهو سر من أسرار الله تعالى جهله أهل النظر ومن هذه المسألة يتبين لك قدم الحق وحدوث الخلق لكن على غير الوجه الذي يعقله أهل الكلام وعلى غير الوجه الذي تعقله الحكماء باللقب لا بالحقيقة فإن الحكماء على الحقيقة هم أهل الله الرسل والأنبياء والأولياء إلا أن الحكماء باللقب أقرب إلى العلم من غيرهم حيث لم يعقلوا الله إلا إلها وأهل الكلام من النظار ليس كذلك‏\n\n\n### [الليل في حق أقطاب أهل الليل‏]\n\n\nفأقطاب أهل الليل من يكون الليل في حقهم كالنهار كشفا وشغلا قال تعالى وإِنَّكُمْ لَتَمُرُّونَ عَلَيْهِمْ مُصْبِحِينَ وبِاللَّيْلِ أَ فَلا تَعْقِلُونَ أي تعلمون منهم في الصباح ما تعلمون منهم في الليل إذ كان ليلا عند غيرهم ممن ليس له مقام‏\nالكشف بالليل كما لصاحب النور فالليل والصباح عنده سواء فهذا معنى قوله أَ فَلا تَعْقِلُونَ فإن ادعت لك نفسك أنك من أهل الليل فانظر هل لها قدم وكشف فيما ذكرت لك فهو المحك والمعيار ولكل ليل في القرآن أمور وعلوم لا يعرفها إلا أهل الليل خاصة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Forty-One: Concerning the Gnosis of the People of the Night, the Variation of their Classes, the Differences in their Levels, and the Secrets of their Poles (أقطاب)\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful\n\nBehold, the People of the Night are the people of descent,\nAnd the people of ascensions (معاريج), and the people of movement.\n\nSo some ascend toward the Station (مقام) with spiritual aspiration (همة),\nAnd some descend, seeking to join the lower realm.\n\nBy the rule of drawing near (تداني) and letting down (تدلي), they are both,\nYet far removed from the existence of ascent (ترقي) and reception (تلقي).\n\nIf you say of them that they are the best company,\nYou speak truly, for they have settled in the noblest abode.\n\nAnd if you say of them that they are the worst youths,\nYou speak truly, for they are neither Prophet (نبي) nor Saint (ولي).\n\nThey are neither themselves, nor are they others,\nBut they are in a wavering stronghold.\n\nA sanctuary difficult to approach, between the witnessed realms (مشاهد) and the prohibitions (نهي),\nAnd between the South wind in its blowing and the North.\n\nThere is none among them but a sovereign leader,\nWho, when morning comes, attains desires through contemplation.\n\nThey possess a gaze whose ruling none other knows,\nThey possess dominion over every crowned head.\n\n### The Night and the Unseen (الغيب)\n\nKnow—may Allah strengthen you with a spirit from Him—that Allah made the night for its people like the Unseen (الغيب) for Himself. Just as no one witnesses the Act of Allah in His creation due to the veil of the Unseen that He has cast before them, so too does no one witness the act of the People of the Night with Allah in their worship, due to the veil of the night’s darkness that Allah has cast before them. They are the best company (خير عصبة) in relation to The Real (الحق), and they are the worst youths (شر فتية) in relation to their own selves. They are not Prophets (أنبياء) of legislation, since the door of Prophethood has been closed. Nor is any one of them called a Saint (ولي) among themselves, because that term implies partnership with the Name of Allah, so they are called *awliyā’* (saints/friends of God). They do not claim this for themselves, even if they are given glad tidings.\n\nThus, the night is made a garment (لباس) for its people; they wear it, and this garment conceals them from the eyes of others (الأغيار). They enjoy their nightly solitude (خلواتهم) with their Beloved, communing with Him without a watcher, because He made sleep in the eyes of the watchers a repose (سبات)—that is, a divine rest for the People of the Night, just as it is a natural rest for people. When people sleep, these individuals rest with their Lord and are alone with Him, physically and spiritually, regarding what they ask of Him: the acceptance of repentance, the answering of supplication, the forgiveness of sin, and other matters. Thus, the sleep of others is a rest for them.\n\nIndeed, Allah Almighty descends to them during the night to the lowest heaven (السماء الدنيا). No celestial veil remains between Him and them. His descent to them is a mercy upon them, and He manifests Himself (يتجلى) to them from the lowest heaven, as is mentioned in the tradition. He says: \"He who claims My love is a liar if, when night falls, he sleeps away from Me. Does not every lover seek solitude with his beloved? Here I am, I have manifested Myself (تجليت) to My servants. Is there any supplicant that I may answer him? Is there any repentant one that I may turn to him? Is there any seeker of forgiveness that I may forgive him?\" until the break of dawn.\n\n### The Nightly Conversation of the People of the Night in their Prayer Niches\n\nThe People of the Night are the ones who attain this privilege (حظوة) in this solitude (خلوة) and this nightly conversation (مسامرة) in their prayer niches (محاريبهم). They stand reciting His Word and open their ears to what He says to them in His Word. When He says: <<يَا أَيُّهَا النَّاسُ>> (O humankind), they describe themselves and say: \"We are the humankind. What do You desire of us, our Lord, in this call?\" The Almighty replies to them, through their own tongue as they recite His revealed Word: <<اتَّقُوا رَبَّكُمْ إِنَّ زَلْزَلَةَ السَّاعَةِ شَيْءٌ عَظِيمٌ>> (Fear your Lord! Indeed, the earthquake of the Hour is a tremendous thing). <<يَا أَيُّهَا النَّاسُ>> (O humankind), they say: \"At Your service, our Lord.\" He says to them: \"Fear your Lord, <<الَّذِي جَعَلَ لَكُمُ الْأَرْضَ فِرَاشًا وَالسَّمَاءَ بِنَاءً وَأَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ رِزْقًا لَكُمْ فَلَا تَجْعَلُوا لِلَّهِ أَنْدَادًا وَأَنْتُمْ تَعْلَمُونَ>> (Who made the earth a resting place for you and the sky a canopy, and sent down water from the sky and brought forth thereby fruits as provision for you. So do not attribute equals to Allah while you know).\" They say: \"Our Lord, You addressed us, and we heard; You made us understand, and we understood. So, our Lord, grant us success and employ us in what You have requested of us—Your worship and Your fear—for we have no power (حول) or strength (قوة) except through You. And who are we that You should descend to us from the height of Your Majesty, call upon us, ask us, and seek from us? <<يَا أَيُّهَا النَّاسُ>> (O humankind), they say: \"At Your service. <<إِنَّ وَعْدَ اللَّهِ حَقٌّ فَلَا تَغُرَّنَّكُمُ الْحَيَاةُ الدُّنْيَا>> (Indeed, the promise of Allah is true, so let not the worldly life deceive you).\" They say: \"Our Lord, You made us hear, and we heard; You informed us, and we knew. So protect us and show us compassion. The victorious one is he whom You help, the supported one is he whom You aid, and the abandoned one is he whom You forsake.\" <<يَا أَيُّهَا الْإِنْسَانُ>> (O human being), the human among them says: \"At Your service, my Lord. <<مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ>> (What has deceived you concerning your Generous Lord)?\" He replies: \"Your Generosity, my Lord.\" He says: \"You have spoken truly.\" <<يَا أَيُّهَا الَّذِينَ آمَنُوا>> (O you who have believed), they say: \"At Your service, our Lord. <<اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ>> (Fear Allah with the fear due to Him). <<اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا>> (Fear Allah and speak a sound word).\" They say: \"And what word do we have except what You make us speak? Does any creature possess power or strength except through You? So make our utterance Your remembrance (ذكر) and our word the recitation of Your Book.\" <<يَا أَيُّهَا الَّذِينَ آمَنُوا>> (O you who have believed), they say: \"At Your service, our Lord.\" The Almighty says: <<عَلَيْكُمْ أَنْفُسَكُمْ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ>> (Upon you is [the responsibility for] yourselves. Those who have gone astray will not harm you when you have been guided). They say: \"Our Lord, You have made us desirous of our selves (أنفسنا) when You made them the locus of Your faith, saying: <<وَفِي أَنْفُسِكُمْ أَفَلَا تُبْصِرُونَ>> (And in yourselves? Do you not see?) and You said: <<سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ>> (We will show them Our signs in the horizons and within themselves until it becomes clear to them that it is The Real). And the signs are not sought except for what they indicate, and You are their indicated reality. It is as if You are saying in Your statement, 'Upon you is [the responsibility for] yourselves,' meaning: 'Cling to Us, persevere in Us, and adhere closely to Us.' Then You said: 'Those who have gone astray will not harm you,' meaning: those who were confused and perished when they sought Us through their intellect (فكر) and wished to subject Us to the rule of their contemplation and reason, 'when you have been guided' by what I have made known to you of Myself in My Book and upon the tongue of My Messenger. Thus, you knew Me by what I described Myself to you, and you only knew Me through Me, so you did not go astray. Thus, My guidance and My drawing near became a light for you by which you walk upon Our Straight Path.\" The custom (دأب) of the People of the Night remains thus with Allah in every verse they recite in their prayer and in every remembrance (ذكر) by which they remember Him, until the break of dawn.\n\n### The Night is for Allah and the Day is for the Human\n\nMuhammad ibn Abd al-Jabbar al-Niffari, who was one of the People of the Night, said: The Real (الحق) stationed me in the Station of Knowledge (موقف العلم). He mentioned—may Allah be pleased with him—what The Real said to him in that station. Among the things He said to him in that station was: \"O My servant, the night is Mine, not for the Quran to be recited. The night is Mine, not for praise and glorification. Allah Almighty says: <<إِنَّ لَكَ فِي النَّهَارِ سَبْحًا طَوِيلًا>> (Indeed, for you by day is prolonged occupation). So make the night Mine, just as it belongs to Me. For in the night is My descent. I do not see you during the day in your livelihood. But when the night comes, and I seek you and descend to you, I find you asleep in your rest, in the world of your life. And there is nothing but night and day. I did not find you in the day, which I made for you and in which I did not descend to you, and which I entrusted to you. I made the night Mine, and I descended to you in it to converse with you (أناجيك) and keep you company (أسامرك) and fulfill your needs. Yet I found you sleeping away from Me, behaving improperly toward Me, despite your claim of loving Me and preferring My presence. Stand before Me and ask Me, so that I may grant you your request. I did not seek you out so that you might recite the Quran and dwell upon its meanings, for its meanings distract you from Me. One verse carries you through My Paradise and what I have prepared therein for My saints (أوليائي). Where am I, then, if you are in My Paradise with the wide-eyed maidens (الحور) confined in pavilions, as if they were rubies and coral, reclining <<عَلَى فُرُشٍ بَطَائِنُهَا مِنْ إِسْتَبْرَقٍ وَجَنَى الْجَنَّتَيْنِ دَانٍ>> (on couches whose linings are of silk brocade, and the fruit of the two gardens is hanging low)? You are being served <<مِنْ رَحِيقٍ مَخْتُومٍ مِزَاجُهُ مِنْ تَسْنِيمٍ>> (from a sealed nectar, whose mixture is of Tasnim). Another verse makes you stand with My angels as they enter upon you <<مِنْ كُلِّ بَابٍ سَلَامٌ عَلَيْكُمْ بِمَا صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ>> (from every gate, 'Peace be upon you for what you patiently endured. And excellent is the final home!'). Another verse makes you look out upon Hell, so you witness what I have prepared therein for those who disobeyed Me and associated partners with Me: <<سَمُومٍ وَحَمِيمٍ وَظِلٍّ مِنْ يَحْمُومٍ لَا بَارِدٍ وَلَا كَرِيمٍ>> (scorching wind and scalding water and a shade of black smoke, neither cool nor beneficial). You see the Crusher (الحطمة): <<وَمَا أَدْرَاكَ مَا الْحُطَمَةُ نَارُ اللَّهِ الْمُوقَدَةُ الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ>> (And what can make you know what the Crusher is? It is the fire of Allah, kindled, which mounts up to the hearts. Indeed, it will be closed upon them), meaning, dominant, <<فِي عَمَدٍ مُمَدَّدَةٍ>> (in extended columns). Where am I, O My servant, when you recite this verse, and your thought (خاطر) and spiritual aspiration (همة) are sometimes in Paradise and sometimes in Hell? Then you recite a verse that carries you through the Striking Calamity (القارعة): <<وَمَا أَدْرَاكَ مَا الْقَارِعَةُ يَوْمَ يَكُونُ النَّاسُ كَالْفَرَاشِ الْمَبْثُوثِ وَتَكُونُ الْجِبَالُ كَالْعِهْنِ الْمَنْفُوشِ>> (And what can make you know what the Striking Calamity is? It is the Day when mankind will be like scattered moths, and and the mountains will be like carded wool). The Day when <<تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّا أَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَى النَّاسَ سُكَارَى وَمَا هُمْ بِسُكَارَى وَلَكِنَّ عَذَابَ اللَّهِ شَدِيدٌ>> (every nursing mother will be distracted from that which she nursed, and every pregnant woman will abort her load, and you will see the people intoxicated, but they will not be intoxicated; rather, the punishment of Allah is severe). And you see on that Day, from this verse: <<يَفِرُّ الْمَرْءُ مِنْ أَخِيهِ وَأُمِّهِ وَأَبِيهِ وَصَاحِبَتِهِ وَبَنِيهِ لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ>> (A man will flee from his brother and his mother and his father and his wife and his children. For every man, that Day, will be a matter occupying him). And you see the Throne (العرش) on that Day, borne by eight angels. And on that Day, <<تُعْرَضُونَ>> (you will be exposed). Where am I, when the night is Mine? Here you are, O My servant, in the day in your livelihood, and in the night in what your recitation grants you: Paradise, Hell, and the Exposure. Thus, you are between the Hereafter, the world (دنيا), and the Isthmus (برزخ). You have not left Me a time to be alone with Me, but you have made it for yourself. The night is Mine, O My servant, not for praise and glorification. Then you recite the verse: <<فَأُولَئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ>> (And those are with the ones upon whom Allah has bestowed favor—of the prophets, the steadfast affirmers of truth, the martyrs, and the righteous). So you witness them in your recitation and contemplate their stations (مقامات) and states (أحوال), and what I have granted <<الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَالْقَانِتِينَ وَالْقَانِتَاتِ وَالصَّادِقِينَ وَالصَّادِقَاتِ وَالصَّابِرِينَ وَالصَّابِرَاتِ وَالْخَاشِعِينَ وَالْخَاشِعَاتِ وَالْمُتَصَدِّقِينَ وَالْمُتَصَدِّقَاتِ وَالصَّائِمِينَ وَالصَّائِمَاتِ>> (the believing men and believing women, the obedient men and obedient women, the truthful men and truthful women, the patient men and patient women, the humble men and humble women, the charitable men and charitable women, and the fasting men and fasting women). You pause with praise and glorification alongside every group I have praised in My Book. Where am I, then, and where is your solitude with Me?\"\n\n### The Recitation of the Realized Gnostic\n\nNo one has known Me, nor known the measure of My saying, \"The night is Mine,\" nor known why I descend to you at night, except the Realized Gnostic (العارف المحقق). One of his brethren met him and said: \"O my brother, remember me in your solitude with your Lord.\" That servant replied: \"If I remember you, I am not in solitude with Him.\" Such a person knows the measure of My descent to the lowest heaven (السماء الدنيا) at night, why I descend, and whom I seek. I recite My Book to him through his tongue, and he listens. That is My nightly conversation (مسامرة). That servant is the one who takes pleasure in My Word. If he pauses to reflect on its meanings, he has departed from Me through his thought (فكر) and contemplation. What is proper for him is to listen intently to Me and clear his hearing for My Word, so that I, in that recitation, am the one who explains My Word to him and interprets its meaning for him, just as I recited it to him and made him hear it. That is My nightly conversation with him. Thus, he takes Knowledge (العلم) from Me, not from his thought or consideration. He maintains good manners (حسن الأدب) with Me in his listening and attentiveness.\n\nHe does not care about the mention of Paradise, or Hell, or the Reckoning, or the Exposure, or the world, or the Hereafter. For he does not perceive them with his intellect (عقل), nor does he investigate the verse with his thought. Rather, he lends his ear to what I say to him, and he is a present witness (شهيد حاضر) with Me. I take charge of teaching him Myself, saying to him: \"O My servant, by this verse I intended such-and-such, and by this other verse, such-and-such,\" and so on until the break of dawn. Thus, he obtains certain knowledge (يقين) that he did not possess before, for he heard the Quran from Me and heard its explanation and the interpretation of its meanings from Me, and what I intended by that speech, that verse, and that chapter (سورة).\n\nIf I ask him for conversation (مسامرة) regarding that, he responds to Me with presence (حضور) and witnessing (مشاهدة), presenting all that I spoke to him and taught him. If he has grasped it fully, well and good; otherwise, We compensate him for what he missed. Thus, he belongs to Me, not to himself or to any creature. Such a servant belongs to Me, and the night is between Me and him. When the dawn breaks, I settle upon My Throne (عرش), directing the affair and detailing the signs (آيات). My servant goes about his livelihood and conversing with his brethren, and I have opened a door between him and Me in My creation, through which he looks at Me and I look at him, and the creation is unaware. I speak to him upon their tongues, and they do not know. He receives from Me with insight (بصيرة), and they are ignorant. They assume he is speaking to them, but he speaks to none but Me. They think he is answering them, but he answers none but Me. As one of the possessors of this description said:\n\nO My intimate companion by night when mankind sleeps,\nAnd My conversationalist among them by day.\n\n### The Classes of the People of the Night with Allah\n\nNow that I have clarified for you how the People of the Night ought to be in their night, if you are one of them, I have taught you the specific manners (الأدب الخاص) of the People of Allah and how they should be with Allah. Know that their classes (طبقاتهم) vary in this regard. The ascetic (الزاهد) has his state (حال) with Allah in his night derived from his station of asceticism (مقام زهده). The one who relies on God (المتوكل) has his state with Allah derived from his station of reliance (مقام توكله). Likewise, the possessor of every station. And for every station, there is a tongue which is the Divine Interpreter (الترجمان الإلهي). They differ in their Levels (مراتب) according to their states (أحوال) and stations (مقامات). The Poles (أقطاب) of the People of the Night are the possessors of meanings (معاني) abstracted from sensible and imaginative (خيالية) materials. They stand with The Real (الحق), by The Real, upon The Real, without limit or end, and without the existence of an opposite (ضد).\n\n### The Ascensions and Gnosis of the People of the Night\n\nAmong the People of the Night are those who possess ascension (عروج), elevation (ارتقاء), and drawing near (دنو). The Real (الحق) meets him on the path as He descends to the lowest heaven (السماء الدنيا), and He draws near to him and spreads His wing over him. Every spiritual aspiration (همة) of every ascending person is met by The Real during that descent, wherever He finds it. Some aspirations are met by The Real in the lowest heaven, some in the second, and in between them, and in the third, and in between them, and in the fourth, and in between them, and in the fifth, and in between them, and in the sixth, and in between them, and in the seventh, and in between them, and in the Footstool (الكرسي), and in between them, and in the Throne (العرش) at the beginning of the descent, and in between them—He being the Settled (مستوي) Merciful. He grants that aspiration meanings (معاني), gnosis (معارف), and secrets (أسرار) according to the abode where He met it.\n\nThen it descends with Him to the lowest heaven. The aspirations stand before Him, and The Real looks out upon those People of the Night who remained in their prayer niches (محاريبهم) and did not ascend. The Almighty casts upon them according to what they ask in their prayers and supplications while they are in their houses and prayer niches. Those aspirations that met Him on their way hear what proceeds from Him, Glorified is His Majesty, to those servants, and they gain knowledge (علوم) they did not possess before. For it may occur to those whose aspirations did not ascend to ask The Real for gnosis and secrets that those ascending aspirations were not capable of asking due to their deficiency. When they hear the answer from The Real, which He gives to those people in their prayer niches whose aspirations did not pierce a heaven or a sphere, they obtain knowledge of Allah commensurate with what those people asked.\n\nThen there are other aspirations that ascend above the Throne (العرش) to the Level (مرتبة) of the Soul (النفس). They may find The Real there in an existence of transcendence (وجود تنزيه) that is not the same as His existence for them in the world of measure and quantity. They witness a station (مقام) more transcendent and an abode (منزل) more holy, and an intermediacy (بينية) that is not limited by estimation (تقدير) nor captured by conceptualization (تصوير). Its intermediacy is an intermediacy that distinguishes sciences (علوم) and levels of understanding (فهوم). Among the aspirations are those that meet Him in the First Intellect (العقل الأول), and among them are those that meet Him in the nearest of the bewildered spirits (الأرواح المهيمة), and among them are those that meet Him in the Cloud ('Amā'), and among them are those that meet Him in the Earth created from the remainder of the clay of Adam, peace be upon him.\n\nWhen these aspirations meet Him in these Levels (مراتب), He grants them according to their thirst, derived from the station that motivated them to ascend to these levels. They descend with Him to the lowest heaven—and in reality, He causes them to descend to the lowest heaven and descends with them. They benefit from the sciences that The Real bestows upon those aspirations that did not pass beyond the Throne. This happens every night.\n\nThen these aspirations descend, having known the honor The Real bestowed upon them, and they gather with the aspirations that did not leave their place. They find them in various classes. Among them, they find sciences that were not restricted by ascension, and The Real was closer to them than <<حَبْلِ الْوَرِيدِ>> (the jugular vein) when He was with those others in the Cloud ('Amā'), and in the lowest heaven, and in between them. The Almighty said: <<وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ>> (And He is with you wherever you are). Thus, He is with every aspiration wherever it may be. They also find earthly aspirations that have been sanctified beyond spatiality (الأينية) and beyond the levels of the intellects, so they are not restricted by any Presence (حضرة). They attain knowledge (علوم) appropriate to this description, which The Real granted them, such that the gnosis they acquired astonishes those ascending aspirations. This knowledge is from the sciences of the Absolute (الإطلاق), outside the limitation of celestial spatiality (الحصر الأيني الفلكي) and outside the limitation of the spiritual intellect (الحصر الروحاني العقلي). Despite their being in the darkness of nature (ظلمة الطبيعة), they are upon a light by which that darkness is illuminated due to the existence of witnessing (المشاهدة).\n\n### Visual Perception of Visible Things\n\nThese are the ones who know that the perception of visible things (الأشياء المرئية) is only through the conjunction of the light of the sight (نور البصر) with the light of the illuminated body, whether it be the sun, a lamp, or whatever it may be. Then the visible objects appear. If the illuminated body were absent, nothing would appear. If the sight were absent, nothing that sight perceives with the external light would be illuminated at all.\n\nDo you not see the possessor of Unveiling (صاحب الكشف)? When the night darkens and the door of his house is closed upon him, and there is another person with him in that darkness—both being equal in the absence of perception of visible objects—one of them is someone to whom Unveiling (كشف) occurs at times. A light manifests (يتجلى) to him, and that light combines with the light of his sight, so he perceives what is in that dark house—all or part of what Allah willed to unveil to him—seeing it just as he sees it by day or by lamp light. His companion, who is with him, sees nothing but darkness. That light did not manifest to him so that it might combine with the light of his sight and dispel the veil of darkness. If the matter were not as we described, the possessor of this Unveiling would be like his companion, perceiving nothing, or his companion would be like him, perceiving things. In the latter case, the companion would either be one of the People of Unveiling like him, or he would perceive it by the light of Knowledge (نور العلم). However, the one who experiences Unveiling perceives it by the light of Imagination (نور الخيال), just as the sleeper perceives things, while his companion next to him is awake and sees nothing. Likewise is the possessor of Unveiling. If you were to ask the possessor of Unveiling, \"Do you see darkness during your state of Unveiling?\" he would say, \"No. Rather,\" he would say, \"the place became illuminated until I thought the sun had not set.\" Thus, he perceives the visible objects just as he perceives them by day.\n\n### The Cosmos is Darkness: It is Only Seen by Two Lights\n\nI have not seen anyone draw attention to this issue, unless they did so and it did not reach me. The entire Cosmos (الكون) is dark in its origin; it is only seen by two lights. This matter occurs, and its parallel that supports it is the creation of the world (العالم). The world, in terms of its Essence (ذات), is non-existence ('adam), and it only acquires Existence (الوجود) by being receptive (قابلا), which is due to its possibility (إمكانه) and the power (اقتدار) of The Real (الحق) Who specializes and prefers its existence over its non-existence. If receptivity were removed from the possible (الممكن), it would be like the impossible (المحال), incapable of receiving creation. The impossible and the possible, before the preference for existence, shared in non-existence. Likewise, even with its receptivity, if the power of The Real were absent, the very entity of this non-existent thing, which is the possible, would not have come into existence.\n\nThus, the non-existent Fixed Entities (الأعيان المعدومة) only appeared in Existence by virtue of their being receptive—which is like the light of the sight (نور البصر)—and by The Real being Powerful (قادرا)—which is like the light of the illuminating body (نور الجسم النير). Thus, the Fixed Entities (الأعيان) appeared just as visible objects appear by the two lights. Just as the possible remains receptive, and The Real remains Powerful and Willing, the continuation of Existence is preserved for the possible, since non-existence is inherent to its essence. Likewise, the perceiver always has the light of his sight in his eye, and the sun is manifesting in its light, thus preserving the perceptions related to visible objects, which are in themselves—meaning the visible objects—not illuminated, but dark. Understand, if you are capable of understanding. This matter is the root of the error of the rationalists (العقلاء), and they are unaware because they have not grasped it. It is a secret among the secrets of Allah Almighty, unknown to the People of Speculative Inquiry (أهل النظر). From this issue, the pre-eternity (قدم) of The Real and the createdness (حدوث) of creation become clear to you, but not according to the way the People of Scholastic Theology (أهل الكلام) understand it, nor according to the way the philosophers (الحكماء) understand it by title, not by reality. For the true philosophers (الحكماء على الحقيقة) are the People of Allah: the Messengers, the Prophets, and the Saints (الأولياء). However, the philosophers by title are closer to Knowledge (العلم) than others, since they only understood Allah as God (إلها). The People of Scholastic Theology among the speculative thinkers are not like that.\n\n### The Night in Relation to the Poles of the People of the Night\n\nThe Poles (أقطاب) of the People of the Night are those for whom the night is like the day in terms of Unveiling (كشف) and spiritual occupation (شغل). The Almighty said: <<وَإِنَّكُمْ لَتَمُرُّونَ عَلَيْهِمْ مُصْبِحِينَ وَبِاللَّيْلِ أَفَلَا تَعْقِلُونَ>> (And indeed, you pass over them in the morning, and by night. Will you not then use reason?). That is, you know of them in the morning what you know of them in the night, since it was night for others who do not possess the station of Unveiling (كشف) during the night, as the possessor of light does. Thus, night and morning are the same to him. This is the meaning of His saying: <<أَفَلَا تَعْقِلُونَ>> (Will you not then use reason?). If your soul claims that you are one of the People of the Night, then look: does it possess a footing and Unveiling (كشف) in what I have mentioned to you? That is the touchstone and the standard. Every mention of night in the Quran contains matters and sciences that only the People of the Night specifically know. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).",
    "ur": "(باب اکتالیس: اہل اللیل کی معرفت، ان کے طبقات کا اختلاف، ان کے مراتب میں تفاوت اور ان کے اقطاب کے اسرار کا بیان)\n\n(شروع اللہ کے نام سے جو نہایت مہربان، رحم کرنے والا ہے)\n\n> خبردار! اہل اللیل (أهل الليل) نزول (التنزل) کے اہل ہیں\n> اور عروج (المعاريج) و نقل مکانی کے اہل ہیں۔\n>\n> پس کوئی ہمت (الہمۃ) کے ساتھ مقام کی طرف چڑھنے والا ہے\n> اور کوئی نیچے والوں سے ملنے کی خواہش میں اترنے والا ہے۔\n>\n> یہ تدانی (قربت) اور تدلی (جھکاؤ) کے حکم سے ہے،\n> اور ترقی (الترقي) اور تلقّی (ملاقات) کے وجود سے بے نیاز ہیں۔\n>\n> اگر تم ان کے بارے میں کہو کہ وہ بہترین گروہ ہیں،\n> تو تم نے سچ کہا، کیونکہ وہ سب سے معزز ٹھکانے پر اترے ہیں۔\n>\n> اور اگر تم ان کے بارے میں کہو کہ وہ بدترین نوجوان ہیں،\n> تو تم نے سچ کہا، کیونکہ وہ نہ نبی ہیں اور نہ ولی۔\n>\n> پس وہ نہ وہ ہیں اور نہ ان کے علاوہ کوئی اور،\n> لیکن وہ ایک متزلزل قلعے میں ہیں۔\n>\n> وہ قلعہ جس کی چراگاہ عزیز ہے، مشاہدات اور ممانعتوں کے درمیان،\n> اور چلنے والی جنوبی اور شمالی ہواؤں کے درمیان ہے۔\n>\n> ان میں سے ہر ایک سردار امام ہے،\n> جب وہ صبح کرتے ہیں تو غور و فکر (التأمل) سے اپنی مراد پاتے ہیں۔\n>\n> ان کی ایک ایسی نظر ہے جس کا حکم کوئی دوسرا نہیں جانتا،\n> ہر تاج پوش پر ان کی ایک دھاک ہے۔\n\n### [رات اور غیب‏]\n\nجان لو، اللہ تمہیں اپنی روح سے تائید بخشے، کہ اللہ نے اہل اللیل (أهل الليل) کے لیے رات کو ایسا ہی بنا دیا ہے جیسا کہ اس نے اپنے لیے غیب (الغيب) کو بنایا ہے۔ پس جس طرح کوئی شخص اللہ کے افعال کو اس کی مخلوق میں نہیں دیکھ سکتا، اس حجابِ غیب (حجاب الغيب) کی وجہ سے جو اس نے ان کے سامنے ڈال رکھا ہے، اسی طرح کوئی شخص اہل اللیل (أهل الليل) کے افعال کو اللہ کے ساتھ ان کی عبادت میں نہیں دیکھ سکتا، اس رات کی تاریکی کے حجاب (الحجاب) کی وجہ سے جو اللہ نے ان کے سامنے ڈال رکھا ہے۔ پس وہ اللہ کے حق میں بہترین گروہ ہیں، اور اپنے نفسوں کے حق میں بدترین نوجوان ہیں۔ وہ تشریعی نبی نہیں ہیں، کیونکہ نبوت کا دروازہ بند ہو چکا ہے، اور ان میں سے کسی ایک کو بھی ان کے نزدیک ولی (الولي) نہیں کہا جاتا، کیونکہ اس میں اللہ کے نام کے ساتھ شرکت پائی جاتی ہے، لہٰذا ان کے بارے میں اولیاء کہا جاتا ہے، لیکن وہ خود اپنے بارے میں یہ نہیں کہتے، اگرچہ انہیں بشارت دی جائے۔\n\nپس رات کو اہل اللیل (أهل الليل) کے لیے لباس بنا دیا گیا ہے جسے وہ پہنتے ہیں، اور یہ لباس انہیں اغیار کی نظروں سے چھپا دیتا ہے۔ وہ اپنی رات کی خلوتوں میں اپنے محبوب کے ساتھ لطف اندوز ہوتے ہیں اور بغیر کسی نگران کے اس سے سرگوشی کرتے ہیں، کیونکہ اس نے نگرانوں کی آنکھوں میں نیند کو سبات (یعنی راحت) بنا دیا ہے، جو اہل اللیل (أهل الليل) کے لیے ایک الٰہی راحت ہے، جیسا کہ لوگوں کے لیے ایک طبعی راحت ہے۔ پس جب لوگ سو جاتے ہیں، تو یہ لوگ اپنے رب کے ساتھ راحت پاتے ہیں اور حسی اور معنوی طور پر اس کے ساتھ تنہا ہوتے ہیں، ان چیزوں کے بارے میں جو وہ اس سے طلب کرتے ہیں، جیسے توبہ کا قبول ہونا، دعا کا قبول ہونا، اور گناہوں کی مغفرت وغیرہ۔ پس لوگوں کی نیند ان کے لیے راحت ہے۔\n\nاور اللہ تعالیٰ رات کے وقت آسمان دنیا کی طرف نزول (النزول) فرماتا ہے، تو اس کے اور ان کے درمیان کوئی فلکی حجاب (الحجاب الفلکی) باقی نہیں رہتا، اور اس کا ان کی طرف نزول (النزول) ان پر رحمت ہے۔ اور وہ آسمان دنیا سے ان پر التجلی (التجلی) فرماتا ہے، جیسا کہ خبر میں آیا ہے:\n\n> \"جھوٹا ہے وہ جو میری محبت کا دعویٰ کرے، پھر جب رات اسے ڈھانپ لے تو وہ مجھ سے غافل ہو کر سو جائے۔ کیا ہر محب اپنے محبوب کے ساتھ خلوت نہیں چاہتا؟ میں یہ رہا، میں نے اپنے بندوں پر التجلی (التجلی) کی ہے۔ کیا کوئی دعا کرنے والا ہے کہ میں اس کی دعا قبول کروں؟ کیا کوئی توبہ کرنے والا ہے کہ میں اس کی توبہ قبول کروں؟ کیا کوئی مغفرت چاہنے والا ہے کہ میں اسے بخش دوں؟\" یہاں تک کہ فجر پھٹ جائے۔\n\n### [اہل اللیل کی اپنی محرابوں میں مسامرت‏]\n\nپس اہل اللیل (أهل الليل) ہی اس خلوت اور اپنی محرابوں میں اس مسامرت (المسامرة) کے ذریعے اس خوش نصیبی کو پانے والے ہیں۔ وہ کھڑے ہوتے ہیں، اس کے کلام کی تلاوت کرتے ہیں، اور اپنے کان کھولتے ہیں اس بات کے لیے جو وہ اپنے کلام میں ان سے کہتا ہے۔ جب وہ کہتا ہے: **\"يَا أَيُّهَا النَّاسُ\"** (اے لوگو!)، تو وہ صف بندی کرتے ہیں اور کہتے ہیں: \"ہم ہی وہ لوگ ہیں، اے ہمارے رب! تو اس ندا میں ہم سے کیا چاہتا ہے؟\" تو اللہ عزوجل ان کی زبان پر، ان کے اس کلام کی تلاوت کے ذریعے جو اس نے نازل کیا ہے، ان سے فرماتا ہے: **\"اتَّقُوا رَبَّكُمْ إِنَّ زَلْزَلَةَ السَّاعَةِ شَيْءٌ عَظِيمٌ\"** (اپنے رب سے ڈرو، بے شک قیامت کا زلزلہ بہت بڑی چیز ہے۔) **\"يَا أَيُّهَا النَّاسُ\"** (اے لوگو!) وہ کہتے ہیں: \"لبیک، ہمارے رب!\" وہ ان سے فرماتا ہے: **\"اتَّقُوا رَبَّكُمُ الَّذِي جَعَلَ لَكُمُ الْأَرْضَ فِرَاشًا وَالسَّمَاءَ بِنَاءً وَأَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ رِزْقًا لَكُمْ فَلَا تَجْعَلُوا لِلَّهِ أَنْدَادًا وَأَنْتُمْ تَعْلَمُونَ\"** (اپنے رب سے ڈرو، جس نے تمہارے لیے زمین کو بچھونا اور آسمان کو چھت بنایا، اور آسمان سے پانی نازل کیا، پھر اس کے ذریعے تمہارے لیے پھلوں سے رزق نکالا، پس تم جانتے بوجھتے اللہ کے شریک نہ ٹھہراؤ۔) وہ کہتے ہیں: \"اے ہمارے رب! تو نے ہم سے خطاب کیا تو ہم نے سنا، اور تو نے ہمیں سمجھایا تو ہم نے سمجھا۔ پس اے ہمارے رب! ہمیں توفیق دے اور ہمیں اس کام میں لگا دے جو تو نے ہم سے اپنی عبادت اور تقویٰ کے ذریعے طلب کیا ہے، کیونکہ تیرے بغیر ہمارے پاس کوئی طاقت اور قوت نہیں ہے۔ اور ہم کون ہیں کہ تو اپنے جلال کی بلندی سے ہماری طرف نزول (النزول) فرمائے، اور ہمیں پکارے، ہم سے سوال کرے اور ہم سے طلب کرے؟\" **\"يَا أَيُّهَا النَّاسُ\"** (اے لوگو!) وہ کہتے ہیں: \"لبیک! **إِنَّ وَعْدَ اللَّهِ حَقٌّ فَلَا تَغُرَّنَّكُمُ الْحَيَاةُ الدُّنْيَا**\" (بے شک اللہ کا وعدہ سچا ہے، پس دنیا کی زندگی تمہیں دھوکے میں نہ ڈالے۔) وہ کہتے ہیں: \"اے ہمارے رب! تو نے ہمیں سنایا تو ہم نے سنا اور تو نے ہمیں بتایا تو ہم نے جانا، پس ہمیں بچا اور ہم پر مہربانی فرما۔ پس جسے تو نے مدد دی وہی منصور ہے، اور جسے تو نے تائید بخشی وہی مؤید ہے، اور جسے تو نے چھوڑ دیا وہی خوار ہے۔\" **\"يَا أَيُّهَا الْإِنْسَانُ\"** (اے انسان!) ان میں سے انسان کہتا ہے: \"لبیک، اے رب!\" **\"مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ\"** (تجھے تیرے رب کریم سے کس چیز نے دھوکے میں ڈالا؟) وہ کہتا ہے: \"تیری کریمی نے، اے رب!\" وہ فرماتا ہے: \"تو نے سچ کہا۔\" **\"يَا أَيُّهَا الَّذِينَ آمَنُوا\"** (اے ایمان والو!) وہ کہتے ہیں: \"لبیک، ہمارے رب!\" **\"اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ\"** (اللہ سے ڈرو جیسا کہ اس سے ڈرنے کا حق ہے۔) **\"اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا\"** (اللہ سے ڈرو اور سیدھی بات کہو۔) وہ کہتے ہیں: \"اور ہماری کون سی بات ہے سوائے اس کے جو تو ہمیں کہلوائے؟ اور کیا مخلوق کے لیے تیرے بغیر کوئی طاقت یا قوت ہے؟ پس ہماری گفتگو کو اپنا ذکر بنا دے اور ہماری بات کو اپنی کتاب کی تلاوت بنا دے۔\" **\"يَا أَيُّهَا الَّذِينَ آمَنُوا\"** (اے ایمان والو!) وہ کہتے ہیں: \"لبیک، ہمارے رب!\" تو اللہ تعالیٰ فرماتا ہے: **\"عَلَيْكُمْ أَنْفُسَكُمْ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ\"** (تم پر تمہاری جانیں لازم ہیں، تمہیں کوئی نقصان نہیں پہنچائے گا جو گمراہ ہوا، جب تم ہدایت پا گئے۔) وہ کہتے ہیں: \"اے ہمارے رب! تو نے ہمیں ہمارے نفسوں سے آزمایا جب تو نے انہیں اپنے ایمان کا محل بنایا، پس تو نے فرمایا: **وَفِي أَنْفُسِكُمْ أَفَلَا تُبْصِرُونَ** (اور تمہارے اپنے نفسوں میں، کیا تم نہیں دیکھتے؟) اور تو نے فرمایا: **سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ** (ہم انہیں اپنی نشانیاں آفاق میں اور ان کے اپنے نفسوں میں دکھائیں گے، یہاں تک کہ ان پر واضح ہو جائے کہ وہ (اللہ) ہی الحق (الحق) ہے۔) اور آیات صرف اس چیز کے لیے مطلوب ہیں جس پر وہ دلالت کرتی ہیں، اور تو ہی ان کا مدلول ہے۔ پس گویا تو اپنے قول **\"عَلَيْكُمْ أَنْفُسَكُمْ\"** (تم پر تمہاری جانیں لازم ہیں) میں فرماتا ہے: یعنی ہم سے وابستہ رہو، ہم پر ثابت قدم رہو، اور ہم سے چمٹے رہو۔ پھر تو نے فرمایا: **\"لَا يَضُرُّكُمْ مَنْ ضَلَّ\"** (تمہیں کوئی نقصان نہیں پہنچائے گا جو گمراہ ہوا) یعنی جو حیران ہوا اور ہلاک ہو گیا جب اس نے ہمیں اپنی فکر سے طلب کیا اور چاہا کہ ہمیں اپنے غور و فکر اور عقل کے حکم کے تحت لے آئے، **\"إِذَا اهْتَدَيْتُمْ\"** (جب تم ہدایت پا گئے) اس چیز کے ذریعے جو میں نے تمہیں اپنی کتاب میں اور اپنے رسول کی زبان پر اپنی معرفت (المعرفۃ) کرائی۔ پس تم نے مجھے صرف میرے ذریعے ہی پہچانا، لہٰذا تم گمراہ نہیں ہوئے، اور میری ہدایت اور میرا قرب تمہارے لیے ایک نور بن گیا جس کے ذریعے تم ہمارے صراط مستقیم پر چلتے ہو۔ اہل اللیل (أهل الليل) کا یہی طریقہ اللہ کے ساتھ ہر اس آیت میں جاری رہتا ہے جس کی وہ اپنی نماز میں تلاوت کرتے ہیں، اور ہر اس ذکر میں جو وہ اس کے ذریعے کرتے ہیں، یہاں تک کہ فجر پھٹ جائے۔\n\n### [رات اللہ کے لیے اور دن انسان کے لیے‏]\n\nمحمد بن عبدالجبار النفری (جو اہل اللیل (أهل الليل) میں سے تھے) نے کہا: الحق (الحق) نے مجھے علم کے ایک مقام پر کھڑا کیا، اور انہوں نے (رضی اللہ عنہ) اس بات کا ذکر کیا جو الحق (الحق) نے انہیں اس مقام پر فرمایا تھا۔ اس گفتگو میں سے یہ بھی تھا: \"اے میرے بندے! رات میرے لیے ہے، قرآن کی تلاوت کے لیے نہیں ہے۔ رات میرے لیے ہے، تعریف اور ثناء کے لیے نہیں ہے۔\" اللہ تعالیٰ فرماتا ہے: **\"إِنَّ لَكَ فِي النَّهَارِ سَبْحًا طَوِيلًا\"** (بے شک تمہارے لیے دن میں لمبی مشغولیت ہے۔) پس رات کو میرے لیے بنا دے جیسا کہ وہ میرے لیے ہے۔ کیونکہ رات میں میرا نزول (النزول) ہوتا ہے۔ میں تمہیں دن میں تمہاری معاش میں نہیں دیکھتا۔ پس جب رات آتی ہے اور میں تمہیں طلب کرتا ہوں اور تمہاری طرف نزول (النزول) کرتا ہوں، تو میں تمہیں تمہاری راحت میں اور تمہاری دنیاوی زندگی کے عالم میں سویا ہوا پاتا ہوں۔ اور وہاں صرف رات اور دن ہے۔ پس نہ تو میں نے تمہیں دن میں پایا، حالانکہ میں نے اسے تمہارے لیے بنایا تھا اور اس میں تمہاری طرف نزول (النزول) نہیں کیا تھا اور اسے تمہارے سپرد کر دیا تھا، اور نہ ہی میں نے رات کو اپنے لیے بنایا اور اس میں تمہاری طرف نزول (النزول) کیا تاکہ میں تم سے سرگوشی کروں، تم سے مسامرت (المسامرة) کروں اور تمہاری حاجتیں پوری کروں، اور میں نے تمہیں مجھ سے غافل سویا ہوا پایا، اور تم نے میری محبت کا دعویٰ کرنے اور میری جناب کو ترجیح دینے کے باوجود میرے ساتھ بدتمیزی کی۔ پس میرے سامنے کھڑا ہو جا اور مجھ سے سوال کر تاکہ میں تجھے تیرا سوال عطا کروں۔ میں نے تجھے قرآن کی تلاوت کے لیے طلب نہیں کیا کہ تو اس کے معانی پر ٹھہر جائے، کیونکہ اس کے معانی تجھے مجھ سے جدا کر دیتے ہیں۔ ایک آیت تجھے میری جنت میں لے جاتی ہے اور اس میں جو کچھ میں نے اپنے اولیاء کے لیے تیار کیا ہے، تو میں کہاں ہوں جب تو اپنی جنت میں حوروں کے ساتھ ہے جو خیموں میں محدود ہیں، گویا وہ یاقوت اور مرجان ہیں، **مُتَّكِئًا عَلَى فُرُشٍ بَطَائِنُهَا مِنْ إِسْتَبْرَقٍ** (ایسے بستروں پر تکیہ لگائے ہوئے جن کے استر دبیز ریشم کے ہیں) اور **وَجَنَى الْجَنَّتَيْنِ دَانٍ** (اور دونوں باغوں کے پھل جھکے ہوئے ہیں) اور تجھے **مِنْ رَحِيقٍ مَخْتُومٍ مِزَاجُهُ مِنْ تَسْنِيمٍ** (مہر بند خالص شراب پلائی جائے گی جس میں تسنیم کی آمیزش ہوگی)۔ اور ایک آیت تجھے میرے فرشتوں کے ساتھ کھڑا کر دیتی ہے، اور وہ **مِنْ كُلِّ بَابٍ سَلَامٌ عَلَيْكُمْ بِمَا صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ** (ہر دروازے سے تم پر سلامتی ہو، تمہارے صبر کے بدلے، پس آخرت کا گھر کیا ہی خوب ہے) کہتے ہوئے تمہارے پاس داخل ہوتے ہیں۔ اور ایک آیت تجھے جہنم پر جھانکنے پر مجبور کرتی ہے، تو تو دیکھتا ہے جو کچھ میں نے اس میں ان لوگوں کے لیے تیار کیا ہے جنہوں نے میری نافرمانی کی اور میرے ساتھ شرک کیا، **مِنْ سَمُومٍ وَحَمِيمٍ وَظِلٍّ مِنْ يَحْمُومٍ لَا بَارِدٍ وَلَا كَرِيمٍ** (زہریلی ہوا، کھولتا ہوا پانی، اور سیاہ دھوئیں کا سایہ، نہ ٹھنڈا اور نہ خوشگوار)۔ اور تو حطمہ کو دیکھتا ہے، **وَمَا أَدْرَاكَ مَا الْحُطَمَةُ نَارُ اللَّهِ الْمُوقَدَةُ الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ** (اور تمہیں کیا معلوم کہ حطمہ کیا ہے؟ وہ اللہ کی بھڑکائی ہوئی آگ ہے جو دلوں پر چڑھ جاتی ہے، بے شک وہ ان پر مسلط کی ہوئی ہے) یعنی **فِي عَمَدٍ مُمَدَّدَةٍ** (لمبے ستونوں میں)۔ اے میرے بندے! میں کہاں ہوں جب تو اس آیت کی تلاوت کرتا ہے اور تیرا دل اور تیری ہمت (الہمۃ) کبھی جنت میں ہوتی ہے اور کبھی جہنم میں؟ پھر تو ایک آیت کی تلاوت کرتا ہے جو تجھے قارعہ میں لے جاتی ہے، **وَمَا أَدْرَاكَ مَا الْقَارِعَةُ يَوْمَ يَكُونُ النَّاسُ كَالْفَرَاشِ الْمَبْثُوثِ وَتَكُونُ الْجِبَالُ كَالْعِهْنِ الْمَنْفُوشِ** (اور تمہیں کیا معلوم کہ قارعہ کیا ہے؟ جس دن لوگ بکھرے ہوئے پتنگوں کی طرح ہوں گے، اور پہاڑ دھنکی ہوئی رنگین اون کی طرح ہو جائیں گے)۔ جس دن **تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّا أَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَى النَّاسَ سُكَارَى وَمَا هُمْ بِسُكَارَى وَلَكِنَّ عَذَابَ اللَّهِ شَدِيدٌ** (ہر دودھ پلانے والی اپنے دودھ پیتے بچے کو بھول جائے گی، اور ہر حاملہ اپنا حمل گرا دے گی، اور تم لوگوں کو نشے میں دیکھو گے حالانکہ وہ نشے میں نہیں ہوں گے، لیکن اللہ کا عذاب سخت ہے)۔ اور تو اس دن اس آیت میں دیکھتا ہے: **يَفِرُّ الْمَرْءُ مِنْ أَخِيهِ وَأُمِّهِ وَأَبِيهِ وَصَاحِبَتِهِ وَبَنِيهِ لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ** (آدمی اپنے بھائی سے، اپنی ماں اور اپنے باپ سے، اپنی بیوی اور اپنے بیٹوں سے بھاگے گا، ان میں سے ہر ایک کو اس دن ایک ایسی فکر ہوگی جو اسے کافی ہوگی)۔ اور تو اس دن عرش کو دیکھتا ہے جسے آٹھ فرشتے اٹھائے ہوئے ہوں گے، اور اس دن **تُعْرَضُونَ** (تم پیش کیے جاؤ گے)۔ میں کہاں ہوں، حالانکہ رات میرے لیے ہے؟ پس اے میرے بندے! تو دن میں اپنی معاش میں ہے، اور رات میں اس چیز میں ہے جو تیری تلاوت تجھے جنت، جہنم اور پیشی سے عطا کرتی ہے۔ پس تو آخرت، دنیا اور برزخ کے درمیان ہے۔ تو نے میرے لیے کوئی وقت نہیں چھوڑا کہ تو مجھ سے خلوت کرے، بلکہ تو نے اسے اپنے لیے بنا لیا، حالانکہ رات میرے لیے ہے، اے میرے بندے! تعریف اور ثناء کے لیے نہیں ہے۔ پھر تو ایک آیت کی تلاوت کرتا ہے: **فَأُولَئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ** (پس وہ ان لوگوں کے ساتھ ہوں گے جن پر اللہ نے انعام کیا، یعنی نبیوں، صدیقوں، شہیدوں اور صالحین میں سے)۔ تو تو اپنی تلاوت میں ان کا مشاہدہ کرتا ہے اور ان کے مقامات اور احوال میں غور کرتا ہے، اور جو کچھ میں نے **الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَالْقَانِتِينَ وَالْقَانِتَاتِ وَالصَّادِقِينَ وَالصَّادِقَاتِ وَالصَّابِرِينَ وَالصَّابِرَاتِ وَالْخَاشِعِينَ وَالْخَاشِعَاتِ وَالْمُتَصَدِّقِينَ وَالْمُتَصَدِّقَاتِ وَالصَّائِمِينَ وَالصَّائِمَاتِ** (ایمان والے مردوں اور عورتوں، فرمانبردار مردوں اور عورتوں، سچے مردوں اور عورتوں، صبر کرنے والے مردوں اور عورتوں، عاجزی کرنے والے مردوں اور عورتوں، صدقہ دینے والے مردوں اور عورتوں، اور روزہ رکھنے والے مردوں اور عورتوں) کو عطا کیا ہے۔ تو تو ہر اس گروہ کی تعریف اور ثناء پر ٹھہر گیا جس کی میں نے اپنی کتاب میں تعریف کی ہے۔ تو میں کہاں ہوں اور تیری مجھ سے خلوت کہاں ہے؟\n\n### [عارف محقق کی تلاوت‏]\n\nمجھے کسی نے نہیں پہچانا اور نہ ہی میرے اس قول کی قدر کو جانا کہ رات میرے لیے ہے، اور نہ ہی یہ جانا کہ میں رات کو تمہاری طرف کیوں نزول (النزول) کرتا ہوں، سوائے عارف محقق (العارف المحقق) کے۔ جس سے اس کے بعض بھائیوں نے ملاقات کی اور کہا: \"اے میرے بھائی! اپنی خلوت میں مجھے اپنے رب کے پاس یاد کرنا۔\" تو اس بندے نے جواب دیا: \"اگر میں نے تمہیں یاد کیا تو میں اس کے ساتھ خلوت میں نہیں ہوں گا۔\" اسی طرح کے شخص نے رات کو آسمان دنیا کی طرف میرے نزول (النزول) کی قدر کو جانا، اور یہ بھی جانا کہ میں کیوں نزول (النزول) کرتا ہوں اور کسے طلب کرتا ہوں۔ پس میں اس کی زبان پر اپنی کتاب کی تلاوت کرتا ہوں اور وہ سنتا ہے، تو یہ میری مسامرت (المسامرة) ہے۔ اور وہ بندہ میرے کلام سے لذت پانے والا ہے۔ پس جب وہ اس کے معانی پر ٹھہرتا ہے، تو وہ اپنی فکر اور غور و فکر کے ذریعے مجھ سے باہر نکل جاتا ہے۔ پس اس کے لیے ضروری ہے کہ وہ میری طرف کان لگائے اور اپنے کان میرے کلام کے لیے خالی کر دے، تاکہ میں ہی اس تلاوت میں وہ ہوں جیسا کہ میں نے اس پر تلاوت کی اور اسے سنایا۔ میں ہی وہ ہوں جو اس کے لیے اپنے کلام کی شرح کرتا ہوں اور اس کے معنی کی ترجمانی کرتا ہوں۔ پس یہ میری اس کے ساتھ مسامرت (المسامرة) ہے۔ تو وہ علم مجھ سے حاصل کرتا ہے، نہ کہ اپنی فکر اور غور و فکر سے۔ پس وہ نہ جنت کے ذکر کی پرواہ کرتا ہے، نہ جہنم کی، نہ حساب کی، نہ پیشی کی، نہ دنیا کی اور نہ آخرت کی۔ کیونکہ اس نے انہیں اپنی عقل سے نہیں دیکھا اور نہ ہی اپنی فکر سے آیت کی تحقیق کی۔ بلکہ اس نے اس بات پر کان لگائے جو میں اسے کہتا ہوں، اور وہ میرے ساتھ حاضر و شاہد ہے۔ میں خود اس کی تعلیم کا ذمہ لیتا ہوں، پس میں اس سے کہتا ہوں: \"اے میرے بندے! اس آیت سے میرا ارادہ یہ اور یہ تھا، اور اس دوسری آیت سے میرا ارادہ یہ اور یہ تھا۔\" اسی طرح یہاں تک کہ فجر پھٹ جائے۔ پس وہ ایسے یقینی علوم حاصل کرتا ہے جو اس کے پاس نہیں تھے، کیونکہ اس نے قرآن مجھ سے سنا اور اس کی شرح اور اس کے معانی کی تفسیر اور اس کلام اور اس آیت اور سورت سے میرا ارادہ کیا تھا، وہ بھی مجھ سے سنا۔ پس وہ میرے ساتھ سننے اور کان لگانے میں حسن ادب کا مظاہرہ کرتا ہے۔ پھر اگر میں اس سے اس بارے میں مسامرت (المسامرة) کا مطالبہ کروں، تو وہ حضور اور مشاہدہ (المشاہدۃ) کے ساتھ مجھے جواب دیتا ہے، اور وہ سب کچھ پیش کرتا ہے جو میں نے اس سے کلام کیا اور اسے سکھایا۔ اگر اس نے اسے مکمل طور پر حاصل کر لیا، تو ٹھیک، ورنہ ہم اس کی کمی کو پورا کر دیتے ہیں۔ پس وہ میرے لیے ہوتا ہے، نہ اپنے لیے اور نہ کسی مخلوق کے لیے۔ ایسا بندہ میرے لیے ہے، اور رات میرے اور اس کے درمیان ہے۔ پس جب فجر پھٹتی ہے، تو میں اپنے عرش پر استواء (الاستواء) فرماتا ہوں، میں امر کی تدبیر کرتا ہوں، آیات کو کھول کر بیان کرتا ہوں، اور میرا بندہ اپنی معاش کی طرف اور اپنے بھائیوں سے بات چیت کی طرف چلتا ہے۔ اور میں نے اپنے اور اس کے درمیان اپنی مخلوق میں ایک دروازہ کھول دیا ہے، وہ اس سے میری طرف دیکھتا ہے اور میں اس سے اس کی طرف دیکھتا ہوں، اور مخلوق کو اس کا شعور نہیں ہوتا۔ پس میں ان کی زبانوں پر اس سے بات کرتا ہوں اور وہ نہیں جانتے، اور وہ مجھ سے بصیرت کے ساتھ حاصل کرتا ہے اور وہ نہیں جانتے۔ وہ سمجھتے ہیں کہ وہ ان سے بات کر رہا ہے، حالانکہ وہ میرے سوا کسی سے بات نہیں کر رہا، اور وہ سمجھتے ہیں کہ وہ انہیں جواب دے رہا ہے، حالانکہ وہ میرے سوا کسی کو جواب نہیں دے رہا، جیسا کہ اس صفت کے حامل بعض اصحاب نے کہا:\n\n> **يا مؤنسي بالليل إن هجع الورى *** ومحدثي من بينهم بنهاري‏**\n> (اے رات میں میرے مونس جب مخلوق سو جاتی ہے، اور دن میں ان کے درمیان مجھ سے بات کرنے والے!)\n\n### [اللہ کے ساتھ اہل اللیل کے طبقات‏]\n\nاور چونکہ میں نے تمہیں اہل اللیل (أهل الليل) کے بارے میں واضح کر دیا ہے کہ انہیں اپنی رات میں کیسا ہونا چاہیے، پس اگر تم ان میں سے ہو تو میں نے تمہیں اہل اللہ کا خاص ادب سکھا دیا ہے اور یہ کہ انہیں اللہ کے ساتھ کیسا ہونا چاہیے۔ اور جان لو کہ اس میں ان کے طبقات مختلف ہوتے ہیں۔ زاہد کا حال اللہ کے ساتھ اس کی رات میں اس کے زہد کے مقام سے ہوتا ہے، اور متوکل کا حال اللہ کے ساتھ اس کے توکل کے مقام سے ہوتا ہے، اور اسی طرح ہر مقام (المقام) کا مالک۔ اور ہر مقام (المقام) کی ایک زبان ہوتی ہے جو الٰہی ترجمان ہے۔ پس وہ احوال اور مقامات (المقامات) کے لحاظ سے مراتب میں مختلف ہوتے ہیں۔ اور اہل اللیل (أهل الليل) کے اقطاب (الأقطاب) وہ ہیں جو محسوس اور خیالی مواد سے مجرد معانی کے مالک ہوتے ہیں۔ پس وہ الحق (الحق) کے ساتھ، الحق (الحق) پر، الحق (الحق) کے لیے کھڑے ہوتے ہیں، بغیر کسی حد اور انتہا کے اور بغیر کسی ضد کے وجود (الوجود) کے۔\n\n### [اہل اللیل کے عروج اور ان کی معرفتیں‏]\n\nاور اہل اللیل (أهل الليل) میں سے کچھ وہ ہوتے ہیں جو عروج (العروج)، ارتقاء اور قرب کے مالک ہوتے ہیں، تو الحق (الحق) انہیں راستے میں ملتا ہے جب وہ آسمان دنیا کی طرف نزول (النزول) فرما رہا ہوتا ہے، تو وہ ان کی طرف تدلی (جھکاؤ) فرماتا ہے اور اپنا کنف (سایہ/پناہ) ان پر ڈال دیتا ہے۔ اور ہر صاحبِ معراج کی ہر ہمت (الہمۃ) کو الحق (الحق) اس نزول (النزول) میں جہاں وہ اسے پاتا ہے، ملتا ہے۔ پس بعض ہمتیں (الہمم) ایسی ہوتی ہیں جنہیں الحق (الحق) آسمان دنیا میں ملتا ہے، اور بعض کو دوسری میں اور ان کے درمیان، اور تیسری میں اور ان کے درمیان، اور چوتھی میں اور ان کے درمیان، اور پانچویں میں اور ان کے درمیان، اور چھٹی میں اور ان کے درمیان، اور ساتویں میں اور ان کے درمیان، اور کرسی میں اور ان کے درمیان، اور عرش میں نزول (النزول) کے آغاز میں اور ان کے درمیان، اور وہ رحمن کا مستوی (استواء) ہے۔ پس وہ اس ہمت (الہمۃ) کو اس منزل کے مطابق معانی، معارف (المعارف) اور اسرار عطا کرتا ہے جہاں وہ اسے ملا تھا۔ پھر وہ اس کے ساتھ آسمان دنیا کی طرف نزول (النزول) کرتی ہے، تو ہمتیں (الہمم) اس کے سامنے کھڑی ہو جاتی ہیں۔ اور الحق (الحق) اہل اللیل (أهل الليل) میں سے ان ہمتوں (الہمم) پر جھانکتا ہے جو اپنی محرابوں میں باقی رہ گئی ہیں اور عروج (العروج) نہیں کر سکیں، تو الحق (الحق) تعالیٰ انہیں ان کے سوالات کے مطابق عطا کرتا ہے جو وہ اپنی نمازوں اور دعاؤں میں کرتے ہیں، جبکہ وہ اپنے گھروں اور اپنی محرابوں میں ہوتے ہیں۔ پس وہ ہمتیں (الہمم) جو اسے راستے میں ملی تھیں، وہ سنتی ہیں جو کچھ اس کی طرف سے ان بندوں کو ہوتا ہے، تو وہ ایسے علوم حاصل کرتے ہیں جو ان کے پاس نہیں تھے۔ کیونکہ ان لوگوں کو جن کی ہمتیں (الہمم) اوپر نہیں چڑھیں، الحق (الحق) سے معارف (المعارف) اور اسرار کے بارے میں ایسے سوالات کرنے کا خیال آ سکتا ہے جو ان ہمتوں (الہمم) کی طاقت میں نہیں تھا کہ وہ ان سے سوال کرتیں، کیونکہ وہ ان سے قاصر تھیں۔ پس جب وہ الحق (الحق) کی طرف سے وہ جواب سنتے ہیں جو وہ ان لوگوں کو دیتا ہے جو اپنی محرابوں میں ہیں اور جن کی ہمتیں (الہمم) کسی آسمان یا فلک کو پار نہیں کر سکیں، تو انہیں اللہ کے بارے میں اتنا علم حاصل ہوتا ہے جتنا ان لوگوں نے سوال کیا تھا۔\n\nاور پھر کچھ دوسری ہمتیں (الہمم) ہیں جو عرش سے بھی اوپر نفس (النفس) کے مرتبے تک ترقی کر گئیں، تو وہ الحق (الحق) کو وہاں وجود تنزیہ (وجود تنزیہ) کے طور پر پاتی ہیں، جو ان کے لیے اس کا وہ وجود (الوجود) نہیں ہوتا جو عالمِ مساحت اور مقدار میں ہوتا ہے۔ پس وہ ایک ایسے مقام (المقام) کا مشاہدہ (الشہود) کرتے ہیں جو زیادہ پاکیزہ ہے، اور ایک ایسی منزل جو زیادہ مقدس ہے، اور ایک ایسی بینیت (باطنی حالت) جس کی حد بندی اندازہ نہیں کر سکتا اور نہ ہی اسے تصویر میں لایا جا سکتا ہے۔ پس ان کی بینیت (باطنی حالت) علوم کی تمیز اور فہم کے مراتب کی بینیت ہے۔ اور بعض ہمتیں (الہمم) ایسی ہوتی ہیں جو اسے عقل اول (العقل الأول) میں پاتی ہیں، اور بعض ہمتیں (الہمم) ایسی ہوتی ہیں جو اسے ارواح ہائمہ (الأرواح الہائمۃ) میں سے مقربین میں پاتی ہیں، اور بعض ہمتیں (الہمم) ایسی ہوتی ہیں جو اسے عماء (الغیب مطلق) میں پاتی ہیں، اور بعض ہمتیں (الہمم) ایسی ہوتی ہیں جو اسے آدم علیہ السلام کی مٹی کے باقی ماندہ حصے سے پیدا کی گئی زمین میں پاتی ہیں۔ پس جب یہ ہمتیں (الہمم) اسے ان مراتب میں پاتی ہیں، تو وہ انہیں ان کی پیاس کے مطابق اس مقام (المقام) سے عطا کرتا ہے جس نے انہیں ان مراتب کی طرف ترقی (الترقی) کے لیے بھیجا تھا۔ اور وہ اس کے ساتھ آسمان دنیا کی طرف نزول (النزول) کرتے ہیں، اور حقیقت میں وہ انہیں آسمان دنیا کی طرف نزول (النزول) کراتا ہے اور ان کے ساتھ نزول (النزول) کرتا ہے۔ پس وہ ان علوم سے فائدہ اٹھاتے ہیں جو الحق (الحق) ان ہمتوں (الہمم) کو عطا کرتا ہے جو عرش سے آگے نہیں بڑھیں۔ ہر رات اسی طرح ہوتا ہے۔ پھر یہ ہمتیں (الہمم) نزول (النزول) کرتی ہیں، اور وہ جان چکی ہوتی ہیں کہ الحق (الحق) نے انہیں کس طرح عزت بخشی، تو وہ ان ہمتوں (الہمم) سے ملتی ہیں جو اپنی جگہ سے نہیں ہٹی تھیں، اور انہیں مختلف طبقات پر پاتی ہیں۔ پس ان میں سے بعض کے پاس ایسے علوم ہوتے ہیں جو ترقی (الترقی) سے مقید نہیں تھے، اور الحق (الحق) ان کے **مِنْ حَبْلِ الْوَرِيدِ** (شہ رگ سے بھی زیادہ قریب) تھا، جب وہ ان لوگوں کے ساتھ عماء (الغیب مطلق) میں اور آسمان دنیا میں اور ان کے درمیان تھا۔ اللہ تعالیٰ فرماتا ہے: **وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ** (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو۔) پس وہ ہر ہمت (الہمۃ) کے ساتھ ہے جہاں وہ ہو۔ اور وہ زمینی ہمتوں (الہمم) کو پاتے ہیں جو اینیت (کون و مکان) اور عقول کے مراتب سے پاک ہو چکی ہیں، پس وہ کسی بھی حضرۃ سے مقید نہیں ہوتیں، تو وہ ایسے علوم حاصل کرتی ہیں جو اس صفت کے لائق ہیں جو الحق (الحق) نے انہیں عطا کی ہے، ان معارف (المعارف) میں سے جو انہوں نے حاصل کیے ہیں، جو ان (عروج کرنے والی) ہمتوں (الہمم) کو حیران کر دیتے ہیں۔ اور یہ علوم اطلاق (الإطلاق) کے علوم میں سے ہیں جو فلکی اینیت (کون و مکان) کی قید اور روحانی عقلی قید سے باہر ہیں۔ پس وہ طبیعت کی تاریکی میں ہونے کے باوجود ایک ایسے نور پر ہیں جس سے وہ تاریکی روشن ہو گئی ہے، مشاہدہ (المشاہدۃ) کے وجود (الوجود) کی وجہ سے۔\n\n### [دیکھی جانے والی چیزوں کا بصری ادراک‏]\n\nاور یہ وہ لوگ ہیں جو جانتے ہیں کہ دیکھی جانے والی چیزوں کا ادراک صرف نورِ بصر (آنکھ کا نور) کے ساتھ مستنیر جسم کے نور (خواہ وہ سورج ہو یا چراغ یا کوئی اور چیز) کے ملنے سے ہوتا ہے، تو مبصرات ظاہر ہوتے ہیں۔ پس اگر مستنیر جسم کا فقدان ہو جائے تو کوئی چیز ظاہر نہیں ہوگی، اور اگر بصر کا فقدان ہو جائے تو باہر کے نور کے ساتھ مل کر بصر جس چیز کا ادراک کرتا ہے، وہ بالکل روشن نہیں ہوگی۔ کیا تم صاحب الکشف (صاحب الکشف) کو نہیں دیکھتے کہ جب رات تاریک ہو جاتی ہے اور اس کے گھر کا دروازہ بند ہو جاتا ہے، اور اس تاریکی میں اس کے ساتھ کوئی دوسرا شخص ہوتا ہے، اور وہ دونوں مبصرات کے کشف (الکشف) نہ ہونے میں برابر ہوتے ہیں، تو ان میں سے ایک وہ ہوتا ہے جسے بعض اوقات کشف (الکشف) ہوتا ہے، تو اس پر ایک نور کا التجلی (التجلی) ہوتا ہے، وہ نور نورِ بصر (آنکھ کے نور) کے ساتھ مل جاتا ہے، تو وہ اس تاریک گھر میں موجود چیزوں کا ادراک کر لیتا ہے، جس کا اللہ نے اس پر کشف (الکشف) کرنا چاہا، خواہ وہ سب ہو یا کچھ حصہ۔ وہ اسے ویسے ہی دیکھتا ہے جیسے دن میں یا چراغ سے دیکھتا ہے، اور اس کا ساتھی جو اس کے ساتھ ہے، وہ صرف تاریکی دیکھتا ہے، اس کے علاوہ کچھ نہیں دیکھتا۔ کیونکہ وہ نور اس پر التجلی (التجلی) نہیں ہوا کہ وہ اس کے نورِ بصر سے مل کر تاریکی کے حجاب (الحجاب) کو دور کرے۔ اگر معاملہ ایسا نہ ہوتا جیسا کہ ہم نے ذکر کیا، تو صاحب الکشف (صاحب الکشف) اپنے ساتھی کی طرح ہوتا اور کسی چیز کا ادراک نہ کرتا، یا اس کا ساتھی اس کی طرح ہوتا اور چیزوں کا ادراک کرتا، تو یا تو وہ اس کی طرح اہل الکشف (أهل الكشف) میں سے ہوتا یا وہ اسے نورِ علم سے ادراک کرتا۔ کیونکہ مکاشف اسے نورِ خیال سے ادراک کرتا ہے، جیسا کہ سونے والا ادراک کرتا ہے، اور اس کا ساتھی اس کے پہلو میں بیدار ہوتا ہے اور کچھ نہیں دیکھتا۔ اسی طرح صاحب الکشف (صاحب الکشف) بھی ہے۔ اور اگر تم صاحب الکشف (صاحب الکشف) سے پوچھو کہ کیا تم اپنے کشف (الکشف) کی حالت میں تاریکی دیکھتے ہو؟ تو وہ کہے گا: \"نہیں، بلکہ وہ کہے گا کہ جگہ روشن ہو گئی یہاں تک کہ میں نے کہا کہ سورج غروب نہیں ہوا ہے۔\" پس میں نے مبصرات کا ادراک کیا جیسا کہ دن میں ادراک کرتا ہوں۔\n\n### [کون تاریکی ہے: صرف دو نوروں سے دیکھا جاتا ہے‏]\n\nاور یہ وہ مسئلہ ہے جس پر میں نے کسی کو تنبیہ کرتے ہوئے نہیں دیکھا، مگر یہ کہ اگر کسی نے کی ہو اور مجھ تک نہ پہنچی ہو۔ پس پورا کون (الکون) اپنی اصل میں تاریک ہے، اور اسے صرف دو نوروں سے دیکھا جاتا ہے۔ کیونکہ یہ معاملہ اور اس کا نظیر جو اس کی تائید کرتا ہے، عالم کا وجود (الوجود) میں لانا ہے۔ کیونکہ عالم اپنی ذات کے لحاظ سے عدم (العدم) ہے، اور وہ وجود (الوجود) صرف قابل ہونے کی وجہ سے حاصل کرتا ہے، اور یہ اس کے امکان کی وجہ سے ہے، اور الحق (الحق) کی قدرت کی وجہ سے جو اس کے وجود (الوجود) کو اس کے عدم (العدم) پر ترجیح دیتا ہے۔ پس اگر ممکن سے قبولیت زائل ہو جائے، تو وہ محال کی طرح ہو جائے گا جو وجود (الوجود) میں آنے کو قبول نہیں کرتا۔ اور محال اور ممکن، وجود (الوجود) کی ترجیح سے پہلے، عدم (العدم) میں شریک تھے۔ جیسا کہ اس کے قبول کرنے کے باوجود اگر الحق (الحق) کی قدرت نہ ہوتی، تو اس معدوم (المعدوم) کا وجود (الوجود) نہ ہوتا جو کہ ممکن ہے۔ پس معدوم اعیان (الأعیان المعدومۃ) وجود (الوجود) کے لیے صرف اس وجہ سے ظاہر ہوئیں کہ وہ قابل تھیں، اور یہ نورِ بصر (آنکھ کے نور) کی طرح ہے، اور الحق (الحق) کا قادر ہونا، اور یہ روشن جسم کے نور کی طرح ہے۔ پس اعیان (الأعیان) ظاہر ہوئیں جیسا کہ مبصرات دو نوروں سے ظاہر ہوئیں۔ پس جس طرح ممکن ہمیشہ قابل رہتا ہے اور الحق (الحق) قادر اور ارادہ کرنے والا ہے، تو ممکن پر وجود (الوجود) کا بقاء محفوظ رہتا ہے، کیونکہ اس کی ذات سے عدم (العدم) ہے، اسی طرح دیکھنے والے کی آنکھ کا نور اس کی آنکھ میں ہمیشہ رہتا ہے اور سورج اپنے نور میں التجلی (التجلی) کرتا ہے، تو مبصرات سے متعلق بصارتیں محفوظ رہتی ہیں، حالانکہ وہ (یعنی مبصرات) اپنی ذات سے منور نہیں ہیں بلکہ تاریک ہیں۔ پس اگر تم عقل رکھتے ہو تو عقل کرو۔ یہ معاملہ عقلمندوں کی گمراہی کی اصل ہے اور انہیں شعور نہیں ہوتا کیونکہ انہوں نے اسے نہیں سمجھا۔ اور یہ اللہ تعالیٰ کے اسرار میں سے ایک راز ہے جسے اہل نظر نے نہیں جانا۔ اور اس مسئلے سے تمہارے لیے الحق (الحق) کی قدامت اور خلق کی حدوث واضح ہو جاتی ہے، لیکن اس طریقے پر نہیں جو اہل کلام سمجھتے ہیں، اور نہ ہی اس طریقے پر جو حکماء (لقب کے لحاظ سے، نہ کہ حقیقت کے لحاظ سے) سمجھتے ہیں۔ کیونکہ حقیقت میں حکماء (الحکماء) اہل اللہ، رسول، انبیاء اور اولیاء ہیں۔ البتہ لقب کے لحاظ سے حکماء (الحکماء) دوسروں کے مقابلے میں علم کے زیادہ قریب ہیں، کیونکہ انہوں نے اللہ کو صرف الٰہ کے طور پر سمجھا، اور اہل کلام میں سے اہل نظر ایسا نہیں ہیں۔\n\n### [اہل اللیل کے اقطاب کے حق میں رات‏]\n\nپس اہل اللیل (أهل الليل) کے اقطاب (الأقطاب) وہ ہیں جن کے حق میں رات کشف (الکشف) اور مشغولیت کے لحاظ سے دن کی طرح ہوتی ہے۔ اللہ تعالیٰ فرماتا ہے: **وَإِنَّكُمْ لَتَمُرُّونَ عَلَيْهِمْ مُصْبِحِينَ وَبِاللَّيْلِ أَفَلَا تَعْقِلُونَ** (اور تم صبح کے وقت ان پر سے گزرتے ہو، اور رات کو بھی، تو کیا تم عقل نہیں کرتے؟) یعنی تم ان کے بارے میں صبح کے وقت وہی جانتے ہو جو تم ان کے بارے میں رات کو جانتے ہو، کیونکہ یہ رات ان کے علاوہ ان لوگوں کے نزدیک رات تھی جنہیں رات میں نور والے کی طرح کشف (الکشف) کا مقام حاصل نہیں ہے۔ پس رات اور صبح اس کے نزدیک برابر ہیں۔ یہی اس کے قول **\"أَفَلَا تَعْقِلُونَ\"** (کیا تم عقل نہیں کرتے؟) کا معنی ہے۔ پس اگر تمہارا نفس یہ دعویٰ کرے کہ تم اہل اللیل (أهل الليل) میں سے ہو، تو دیکھو کہ کیا اس کے لیے اس میں کوئی قدم اور کشف (الکشف) ہے جو میں نے تمہارے لیے ذکر کیا ہے؟ پس یہی کسوٹی اور معیار ہے۔ اور قرآن میں ہر رات کے لیے ایسے امور اور علوم ہیں جنہیں صرف اہل اللیل (أهل الليل) ہی خاص طور پر جانتے ہیں۔ اور **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ الحق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے۔)",
    "fa": "(باب چهل و یکم در معرفت اهل شب و اختلاف طبقات و تفاوت مراتب و اسرار اقطاب ایشان)\n\n(به نام خداوند بخشنده مهربان)\n\nآگاه باشید که اهل شب، اهل فرود آمدن‌اند\nو اهل معراج‌ها و اهل جابه‌جایی.\nپس برخی با همت (الهمة) به سوی مقام بالا می‌روند\nو برخی فرود می‌آیند تا به پایین‌تر ملحق شوند.\nبه حکم نزدیکی (تدانی) و فرود آمدن (تدلی) هر دو، و از\nوجود ترقی و ملاقات (تلقّی) به دورند.\nاگر درباره ایشان بگویی که بهترین گروهند،\nراست گفته‌ای، زیرا در گرامی‌ترین منزل جای گرفته‌اند.\nو اگر درباره ایشان بگویی که بدترین جوانانند،\nراست گفته‌ای، زیرا نه پیامبرند و نه ولی.\nپس نه خودشان هستند و نه غیرشان،\nبلکه در پناهگاهی لرزان (متزلزل) قرار دارند.\nحریمشان عزیز است، میان مشاهدات و نهی‌ها،\nو میان بادهای جنوبی و شمالی در وزش.\nهیچ‌یک از ایشان نیست مگر پیشوایی که سرور شده است،\nکه چون صبح کنند، آرزوها را با تأمل به دست می‌آورند.\nایشان را نظری است که غیر، حکم آن را نمی‌داند،\nایشان را سطوتی است بر هر تاج آراسته.\n\n### [شب و غیب]\n\nبدان، خداوند تو را با روحی از جانب خود تأیید کند، که خداوند شب را برای اهلش همچون غیب (الغيْب) برای ذات خود قرار داده است. همان‌طور که هیچ‌کس فعل خداوند را در خلقش به دلیل حجاب غیبی که میان او و خلقش فرستاده است، مشاهده نمی‌کند؛ همچنین هیچ‌کس فعل اهل شب را در عبادتشان با حق (الحق) مشاهده نمی‌کند، به دلیل حجاب تاریکی شب که خداوند آن را میان ایشان فرستاده است. پس آنان در حق خداوند بهترین گروهند و در حق خودشان بدترین جوانان. ایشان پیامبران تشریعی نیستند، زیرا باب نبوت بسته شده است، و نزد خودشان به هیچ‌یک از آنان ولی گفته نمی‌شود، زیرا در آن (ولایت) مشارکتی با اسم خداوند وجود دارد، پس به ایشان اولیاء گفته می‌شود، و خودشان نیز این را درباره خویش نمی‌گویند، هرچند بشارت داده شوند. پس شب برای اهلش لباسی قرار داده شده که آن را می‌پوشند و این لباس ایشان را از دید اغیار می‌پوشاند. آنان در خلوت‌های شبانه خود از حبیبشان بهره می‌برند و بدون هیچ نگهبانی با او مناجات می‌کنند، زیرا خداوند خواب را در چشمان نگهبانان، «سبات» (آرامش) قرار داده است؛ یعنی آرامشی الهی برای اهل شب، همان‌طور که برای مردم آرامشی طبیعی است. پس هنگامی که مردم می‌خوابند، اینان با پروردگارشان آسوده می‌شوند و با او خلوت می‌کنند، چه از نظر حسی و چه معنوی، در آنچه از او می‌خواهند، از قبیل پذیرش توبه، اجابت دعا، آمرزش گناه و غیره. پس خواب مردم برای ایشان آرامش است. و خداوند متعال شب‌ها به آسمان دنیا فرود می‌آید، پس هیچ حجاب فلکی میان او و ایشان باقی نمی‌ماند. و نزول او به سوی ایشان رحمتی است بر آنان، و از آسمان دنیا بر ایشان تجلی (التجلی) می‌کند، چنانکه در خبر آمده است که می‌فرماید: «دروغ گفته است کسی که ادعای محبت مرا کند و چون شب او را بپوشاند، از من بخوابد. آیا هر محبی خلوت با حبیبش را نمی‌طلبد؟ اینک منم که بر بندگانم تجلی کرده‌ام. آیا دعاکننده‌ای هست تا اجابتش کنم؟ آیا توبه‌کننده‌ای هست تا توبه‌اش را بپذیرم؟ آیا آمرزش‌خواهی هست تا او را بیامرزم؟» تا آنکه فجر بشکافد.\n\n### [هم‌سخنی اهل شب در محراب‌هایشان]\n\nپس اهل شب کسانی هستند که به این بهره‌مندی در این خلوت و این هم‌سخنی در محراب‌هایشان فائز می‌شوند. آنان ایستاده‌اند و کلام او را تلاوت می‌کنند و گوش‌های خود را برای آنچه او در کلامش به ایشان می‌گوید، باز می‌کنند. هنگامی که می‌گوید: «يا أَيُّهَا النَّاسُ» (ای مردم)، آنان صف می‌کشند و می‌گویند: «ما مردم هستیم، ای پروردگار ما، در این ندای خود از ما چه می‌خواهی؟» پس خداوند عزوجل بر زبان ایشان، با تلاوت کلام نازل‌شده‌اش، به آنان می‌گوید: «اتَّقُوا رَبَّكُمْ إِنَّ زَلْزَلَةَ السَّاعَةِ شَيْ‏ءٌ عَظِيمٌ» (از پروردگارتان پروا کنید، زیرا زلزله قیامت امری بسیار بزرگ است). «يا أَيُّهَا النَّاسُ» (ای مردم)، می‌گویند: «لبیک پروردگار ما.» به آنان می‌گوید: «اتَّقُوا رَبَّكُمُ الَّذِي جَعَلَ لَكُمُ الْأَرْضَ فِراشاً والسَّماءَ بِناءً وأَنْزَلَ من السَّماءِ ماءً فَأَخْرَجَ به من الثَّمَراتِ رِزْقاً لَكُمْ فَلا تَجْعَلُوا لِلَّهِ أَنْداداً وأَنْتُمْ تَعْلَمُونَ» (از پروردگارتان پروا کنید، همان که زمین را برای شما فرشی و آسمان را بنایی قرار داد و از آسمان آبی فرو فرستاد و با آن از میوه‌ها رزقی برای شما بیرون آورد، پس برای خداوند شریکانی قرار ندهید در حالی که می‌دانید). پس می‌گویند: «ای پروردگار ما، ما را خطاب کردی و شنیدیم، و ما را فهماندی و فهمیدیم. پس ای پروردگار ما، ما را توفیق ده و در آنچه از ما خواسته‌ای، یعنی عبادت و تقوای تو، به کار گیر، زیرا هیچ حول و قوه‌ای جز به تو نداریم. و ما کیستیم که از علوّ جلالت به سوی ما فرود می‌آیی و ما را ندا می‌دهی و از ما می‌پرسی و می‌خواهی؟» «يا أَيُّهَا النَّاسُ» (ای مردم)، می‌گویند: «لبیک، إِنَّ وَعْدَ الله حَقٌّ فَلا تَغُرَّنَّكُمُ الْحَياةُ الدُّنْيا» (همانا وعده خداوند حق است، پس زندگی دنیا شما را نفریبد). پس می‌گویند: «ای پروردگار ما، ما را شنوا ساختی و شنیدیم، و ما را آگاه ساختی و دانستیم. پس ما را حفظ کن و بر ما مهربانی فرما، زیرا پیروز کسی است که تو یاری‌اش کنی و تأییدشده کسی است که تو تأییدش کنی و خوارشده کسی است که تو خوارش سازی.» «يا أَيُّهَا الْإِنْسانُ» (ای انسان)، انسان از میان آنان می‌گوید: «لبیک ای پروردگارم.» «ما غَرَّكَ بِرَبِّكَ الْكَرِيمِ» (چه چیز تو را به پروردگار کریمت مغرور ساخت؟) می‌گوید: «کرم تو ای پروردگار.» می‌فرماید: «راست گفتی.» «يا أَيُّهَا الَّذِينَ آمَنُوا» (ای کسانی که ایمان آورده‌اید)، می‌گویند: «لبیک پروردگار ما.» می‌فرماید: «اتَّقُوا الله حَقَّ تُقاتِهِ» (از خداوند پروا کنید، آن‌گونه که شایسته پروا کردن از اوست)، «اتَّقُوا الله وقُولُوا قَوْلًا سَدِيداً» (از خداوند پروا کنید و سخنی استوار بگویید). می‌گویند: «و ما را چه سخنی است جز آنچه تو به ما می‌گویی؟ و آیا مخلوقی را حول یا قوه‌ای جز به تو هست؟ پس گفتار ما را ذکر خود و سخن ما را تلاوت کتاب خود قرار ده.» «يا أَيُّهَا الَّذِينَ آمَنُوا» (ای کسانی که ایمان آورده‌اید)، می‌گویند: «لبیک پروردگار ما.» پس خداوند متعال می‌فرماید: «عَلَيْكُمْ أَنْفُسَكُمْ لا يَضُرُّكُمْ من ضَلَّ إِذَا اهْتَدَيْتُمْ» (بر شما باد خودتان، هر کس گمراه شود، چون شما هدایت یابید، به شما زیانی نمی‌رساند). پس می‌گویند: «پروردگارا، ما را به خودمان ترغیب کردی، زیرا آن را محل ایمان خود قرار دادی و گفتی: «وفي أَنْفُسِكُمْ أَ فَلا تُبْصِرُونَ» (و در خودتان، آیا نمی‌بینید؟) و گفتی: «سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ» (به زودی آیات خود را در آفاق و در خودشان به ایشان نشان خواهیم داد تا برایشان روشن شود که او حق است). و آیات جز برای آنچه بر آن دلالت می‌کنند، مطلوب نیستند و تو مدلول آن‌ها هستی. پس گویی در قول خود: «عَلَيْكُمْ أَنْفُسَكُمْ» (بر شما باد خودتان)، می‌گویی: «ما را لازم بگیرید و بر ما مداومت کنید و به ما بچسبید.» سپس گفتی: «لا يَضُرُّكُمْ من ضَلَّ» (هر کس گمراه شود به شما زیانی نمی‌رساند)، یعنی سرگردان شد و تباه گشت، هنگامی که ما را با فکرش طلبید و خواست ما را تحت حکم نظر و عقل خود درآورد، «إِذَا اهْتَدَيْتُمْ» (چون هدایت یابید)، به واسطه آنچه من در کتابم و بر زبان رسولم شما را به آن شناساندم، پس مرا به آنچه خود را با آن برای شما وصف کردم، شناختید. پس مرا جز به واسطه خودم نشناختید و گمراه نشدید. پس هدایت و تقرب من برای شما نوری بود که با آن بر صراط مستقیم ما راه می‌روید. پس روش اهل شب همواره چنین است با خداوند در هر آیه‌ای که در نمازشان می‌خوانند و در هر ذکری که او را با آن یاد می‌کنند، تا آنکه فجر بشکافد.\n\n### [شب از آنِ حق و روز از آنِ انسان]\n\nمحمد بن عبدالجبار نفری که از اهل شب بود، گفت: حق (الحق) مرا در موقف علم متوقف ساخت. و او (رضی الله عنه) آنچه را که حق در آن موقف به او گفت، ذکر کرد. از جمله آنچه در آن موقف به او فرمود این بود: «ای بنده من، شب از آنِ من است، نه برای قرآنی که تلاوت شود. شب از آنِ من است، نه برای ستایش و ثنا. خداوند متعال می‌فرماید: «إِنَّ لَكَ في النَّهارِ سَبْحاً طَوِيلًا» (همانا تو را در روز، تلاشی طولانی است). پس شب را برای من قرار ده، همان‌گونه که از آنِ من است؛ زیرا نزول من در شب است. من تو را در روز در معاشت نمی‌بینم. پس چون شب فرا رسد و تو را بطلبم و به سویت فرود آیم، تو را در آسایش خود و در عالم حیاتت خفته می‌یابم. و در آنجا جز شب و روز نیست. پس نه در روز تو را یافتم، در حالی که آن را برای تو قرار دادم و در آن به سویت فرود نیامدم و آن را به تو سپردم؛ و شب را برای خود قرار دادم و در آن به سویت فرود آمدم تا با تو مناجات و هم‌سخنی کنم و حوائجت را برآورم، اما تو را یافتم که از من خوابیده‌ای و با ادعای محبت من و ترجیح جانب من، با من بدرفتاری کرده‌ای. پس در برابر من بایست و از من بخواه تا خواسته‌ات را به تو عطا کنم. من تو را نطلبیدم تا قرآن تلاوت کنی و با معانی آن بایستی، زیرا معانی آن تو را از من دور می‌سازد. آیه‌ای تو را در بهشت من و آنچه برای اولیایم آماده کرده‌ام، به گردش می‌برد. پس من کجا هستم، در حالی که تو در بهشت من با حوریان پرده‌نشین در خیمه‌ها هستی، «كأنهن الياقوت والمرجان» (گویی آنان یاقوت و مرجان‌اند)، تکیه داده بر «فُرُشٍ بَطائِنُها من إِسْتَبْرَقٍ» (بسترهایی که آسترهایشان از دیباج ضخیم است) و «جَنَى الْجَنَّتَيْنِ دانٍ» (میوه چیدنی دو بهشت نزدیک است)، و از «رَحِيقٍ مَخْتُومٍ مِزاجُهُ من تَسْنِيمٍ» (شراب خالصی که مُهر شده و آمیزه‌اش از تسنیم است) نوشانده می‌شوی. و آیه‌ای تو را نزد فرشتگانم متوقف می‌سازد، در حالی که از «كُلِّ بابٍ سَلامٌ عَلَيْكُمْ بِما صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ» (هر دری بر شما وارد می‌شوند [و می‌گویند:] سلام بر شما به سبب صبری که کردید، پس چه نیکو است سرانجام آن سرا). و آیه‌ای تو را مشرف بر جهنم می‌سازد، پس آنچه را که در آن برای کسی که مرا نافرمانی کرده و به من شرک ورزیده، آماده کرده‌ام، مشاهده می‌کنی: از «سَمُومٍ وحَمِيمٍ وظِلٍّ من يَحْمُومٍ لا بارِدٍ ولا كَرِيمٍ» (باد سوزان و آب جوشان و سایه‌ای از دود سیاه، نه خنک و نه خوشایند). و حطمه را می‌بینی: «وما أَدْراكَ ما الْحُطَمَةُ نارُ الله الْمُوقَدَةُ الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ إِنَّها عَلَيْهِمْ مُؤْصَدَةٌ» (و تو چه می‌دانی حطمه چیست؟ آتش افروخته خداوند است که بر دل‌ها چیره می‌شود، همانا آن بر ایشان مسلط است) یعنی مسلط شده «في عَمَدٍ مُمَدَّدَةٍ» (در ستون‌های کشیده). ای بنده من، من کجا هستم، هنگامی که تو این آیه را تلاوت می‌کنی و با خاطر و همت خود گاهی در بهشت و گاهی در جهنم هستی؟ سپس آیه‌ای تلاوت می‌کنی که تو را در قارعه به گردش می‌برد: «وما أَدْراكَ ما الْقارِعَةُ يَوْمَ يَكُونُ النَّاسُ كَالْفَراشِ الْمَبْثُوثِ وتَكُونُ الْجِبالُ كَالْعِهْنِ الْمَنْفُوشِ» (و تو چه می‌دانی قارعه چیست؟ روزی که مردم مانند پروانه‌های پراکنده باشند و کوه‌ها مانند پشم حلاجی‌شده گردند). روزی که «تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّا أَرْضَعَتْ وتَضَعُ كُلُّ ذاتِ حَمْلٍ حَمْلَها وتَرَى النَّاسَ سُكارى‏ وما هُمْ بِسُكارى‏ ولكِنَّ عَذابَ الله شَدِيدٌ» (هر شیردهنده‌ای از آنچه شیر می‌دهد غافل شود و هر آبستنی بار خود را فرو نهد و مردم را مست بینی، در حالی که مست نیستند، بلکه عذاب خداوند شدید است). و در آن روز از این آیه می‌بینی: «يَفِرُّ الْمَرْءُ من أَخِيهِ وأُمِّهِ وأَبِيهِ وصاحِبَتِهِ وبَنِيهِ لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ» (مرد از برادر و مادر و پدر و همسر و پسرانش می‌گریزد، در آن روز هر کس را کاری است که او را مشغول می‌سازد). و در آن روز عرش را می‌بینی که هشت فرشته آن را حمل می‌کنند، و در آن روز «تُعْرَضُونَ» (عرضه می‌شوید). پس من کجا هستم، در حالی که شب از آنِ من است؟ اینک تو ای بنده من، در روز در معاش خود هستی و در شب در آنچه تلاوتت از بهشت و آتش و عرضه شدن به تو می‌دهد. پس تو میان آخرت و دنیا و برزخ هستی. پس هیچ وقتی را برای خلوت با من باقی نگذاشتی، مگر آنکه آن را برای خودت قرار دادی. و ای بنده من، شب از آنِ من است، نه برای ستایش و ثنا. سپس آیه‌ای تلاوت می‌کنی: «فَأُولئِكَ (مَعَ) الَّذِينَ أَنْعَمَ الله عَلَيْهِمْ من النَّبِيِّينَ والصِّدِّيقِينَ والشُّهَداءِ والصَّالِحِينَ» (پس آنان با کسانی هستند که خداوند بر ایشان نعمت داده است، از پیامبران و صدیقان و شهیدان و صالحان). پس در تلاوتت آنان را مشاهده می‌کنی و در مقامات و احوالشان و آنچه به «الْمُؤْمِنِينَ والْمُؤْمِناتِ والْقانِتِينَ والْقانِتاتِ والصَّادِقِينَ والصَّادِقاتِ والصَّابِرِينَ والصَّابِراتِ والْخاشِعِينَ والْخاشِعاتِ والْمُتَصَدِّقِينَ والْمُتَصَدِّقاتِ والصَّائِمِينَ والصَّائِماتِ» (مردان و زنان مؤمن، مردان و زنان فرمانبردار، مردان و زنان راستگو، مردان و زنان شکیبا، مردان و زنان فروتن، مردان و زنان صدقه‌دهنده، و مردان و زنان روزه‌دار) عطا کرده‌ام، تفکر می‌کنی. پس با ستایش و ثنا نزد هر گروهی که در کتابم ستوده‌ام، توقف کرده‌ای. پس من کجا هستم و خلوت تو با من کجاست؟»\n\n### [تلاوت عارف محقق]\n\nمرا نشناخت و مقدار سخن مرا که «شب از آنِ من است» ندانست و نفهمید که چرا شب‌ها به سوی تو فرود می‌آیم، مگر عارف محقق (العارف المحقق) که یکی از برادرانش او را ملاقات کرد و گفت: «ای برادر، مرا در خلوتت با پروردگارت یاد کن.» آن بنده پاسخ داد: «اگر تو را یاد کنم، در خلوت با او نیستم.» چنین کسی قدر نزول مرا به آسمان دنیا در شب و اینکه چرا فرود آمدم و چه کسی را طلب کردم، دانست. پس من کتابم را با زبان او بر او تلاوت می‌کنم و او می‌شنود، و این هم‌سخنی من است. و آن بنده کسی است که از کلام من لذت می‌برد. پس اگر با معانی آن توقف کند، با فکر و تأمل خود از من خارج شده است. پس شایسته اوست که به من گوش فرا دهد و گوش خود را برای کلام من خالی کند تا من در آن تلاوت، همان‌گونه که بر او تلاوت کردم و به او شنوا ساختم، باشم. من کسی باشم که کلام خود را برای او شرح دهم و معنای آن را برایش ترجمه کنم. این هم‌سخنی من با اوست. پس او علم را از من می‌گیرد، نه از فکر و اعتبار خود. پس به یاد بهشت و آتش و حساب و عرضه شدن و دنیا و آخرت توجهی نمی‌کند، زیرا با عقل خود به آن‌ها ننگریسته و با فکر خود در آیه جستجو نکرده است، بلکه گوش خود را به آنچه من به او می‌گویم، سپرده است، در حالی که او شاهد و حاضر با من است. من خود تعلیم او را بر عهده می‌گیرم و به او می‌گویم: «ای بنده من، منظورم از این آیه چنین و چنان بود، و از آن آیه دیگر چنین و چنان.» و این‌گونه ادامه می‌یابد تا فجر بشکافد. پس از علوم به یقینی دست می‌یابد که پیش از آن نداشته است، زیرا قرآن را از من شنیده و شرح و تفسیر معانی آن و آنچه را که از آن کلام و آن آیه و سوره اراده کرده‌ام، از من شنیده است. پس او در شنیدن و گوش سپردن، ادب نیکو را با من رعایت می‌کند. اگر او را به هم‌سخنی در آن دعوت کنم، با حضور و مشاهده (المشاهدة) به من پاسخ می‌دهد و هر آنچه را که با او سخن گفته و به او آموخته‌ام، بر من عرضه می‌کند. اگر آن را به طور کامل فرا گرفته باشد که هیچ، وگرنه آنچه را که در آن نقص داشته، برایش جبران می‌کنیم. پس او از آنِ من است، نه از آنِ خودش و نه از آنِ مخلوقی. چنین بنده‌ای از آنِ من است و شب میان من و اوست. چون فجر بشکافد، بر عرش خود استوا می‌یابم، امر را تدبیر می‌کنم و آیات را تفصیل می‌دهم، و بنده من به سوی معاش خود و گفت‌وگو با برادرانش می‌رود، در حالی که من دری میان خود و او در خلقم گشوده‌ام که او از آن به من می‌نگرد و من از آن به او می‌نگرم، و خلق آگاه نیستند. پس من با زبان‌های آنان با او سخن می‌گویم، در حالی که آنان نمی‌دانند، و او با بصیرت از من می‌گیرد، در حالی که آنان نمی‌دانند. پس گمان می‌کنند که او با ایشان سخن می‌گوید، در حالی که با کسی جز من سخن نمی‌گوید، و می‌پندارند که او به ایشان پاسخ می‌دهد، در حالی که جز مرا پاسخ نمی‌دهد. چنانکه یکی از صاحبان این صفت گفته است:\n\n> يا مؤنسي بالليل إن هجع الورى *** ومحدثي من بينهم بنهاري‏\n*ترجمه:*\nای مونس من در شب، هنگامی که مردمان خفتند\nو ای هم‌سخن من در روز، از میان ایشان.\n\n### [طبقات اهل شب با خداوند]\n\nو چون برای تو بیان کردم که اهل شب چگونه باید در شب خود باشند، اگر تو از آنان باشی، ادب خاص اهل الله و اینکه چگونه باید با خداوند باشند را به تو آموختم. و بدان که طبقات ایشان در این امر متفاوت است. پس زاهد، حالش با خداوند در شبش از مقام زهد اوست، و متوکل، حالش با خداوند از مقام توکل اوست. و همچنین صاحب هر مقام (المقام). و هر مقامی را زبانی است که ترجمان الهی است. پس آنان در مراتب، بر حسب احوال و مقامات، با یکدیگر تفاوت دارند. و اقطاب اهل شب، صاحبان معانی مجرد از مواد محسوس و خیالی هستند. پس آنان با حق (الحق)، به واسطه حق، بر حق ایستاده‌اند، بدون حد و نهایت و بدون وجود ضد.\n\n### [معراج‌ها و معارف اهل شب]\n\nو از اهل شب کسانی هستند که صاحب عروج و ارتقاء و نزدیکی (دنو) می‌باشند، پس حق (الحق) در راه او را ملاقات می‌کند، در حالی که او (حق) به آسمان دنیا فرود می‌آید، و به سوی او تدلی (نزدیک شدن) می‌کند و سایه خود را بر او می‌افکند. و هر همتی (الهمة) از هر صاحب معراجی را حق در آن نزول، هر جا که او را بیابد، ملاقات می‌کند. پس برخی از همت‌ها را حق در آسمان دنیا ملاقات می‌کند، و برخی را در آسمان دوم و میان آن دو، و در سوم و میان آن دو، و در چهارم و میان آن دو، و در پنجم و میان آن دو، و در ششم و میان آن دو، و در هفتم و میان آن دو، و در کرسی و میان آن دو، و در عرش در ابتدای نزول و میان آن دو، در حالی که او مستوی بر رحمان است. پس به آن همت از معانی و معارف و اسرار، به اندازه منزلی که او را در آن ملاقات کرده، عطا می‌کند. سپس با او به آسمان دنیا فرود می‌آید. پس همت‌ها در برابر او می‌ایستند و حق بر کسانی از اهل شب که در محراب‌هایشان باقی مانده‌اند و عروج نکرده‌اند، مشرف می‌شود. پس خداوند متعال بر حسب آنچه در نماز و دعایشان می‌خواهند، در حالی که در خانه‌ها و محراب‌هایشان هستند، به ایشان القا می‌کند. پس آن همت‌هایی که او را در راه ملاقات کرده‌اند، آنچه را که از جانب او (جل جلاله) به آن بندگان می‌رسد، می‌شنوند و علومی را کسب می‌کنند که نزدشان نبوده است؛ زیرا ممکن است برای کسانی که همت‌هایشان صعود نکرده است، سؤالاتی از حق در معارف و اسرار خطور کند که در توان این همت‌ها نبوده است که آن‌ها را بپرسند، به دلیل قصورشان از آن. پس هنگامی که پاسخ را از حق می‌شنوند که به آن اقوامی که در محراب‌هایشان هستند و همت‌هایشان هیچ آسمان و فلکی را نشکافته است، پاسخ می‌دهد، به اندازه آنچه آن اقوام سؤال کرده‌اند، علم به خداوند برایشان حاصل می‌شود. و همت‌های دیگری نیز هستند که بالاتر از عرش تا مرتبه نفس ارتقاء یافته‌اند. پس ممکن است حق را در آنجا وجود تنزیهی بیابند که وجود او برای ایشان مانند وجود او برای ایشان در عالم مساحت و مقدار نیست. پس مقامی منزه‌تر و منزلی مقدس‌تر و بینشی را مشاهده می‌کنند که تقدیر آن را محدود نمی‌سازد و تصویر آن را در بر نمی‌گیرد. پس بینش آنان، بینش تمییز علوم و مراتب فهم‌هاست. و از همت‌ها کسانی هستند که او را در عقل اول ملاقات می‌کنند، و از همت‌ها کسانی هستند که او را در مقربین از ارواح حیران (المهیمة) ملاقات می‌کنند، و از همت‌ها کسانی هستند که او را در عماء (غیب مطلق) ملاقات می‌کنند، و از همت‌ها کسانی هستند که او را در زمینی که از باقیمانده گِل آدم (علیه السلام) خلق شده، ملاقات می‌کنند. پس هنگامی که این همت‌ها او را در این مراتب ملاقات می‌کنند، به اندازه تشنگی‌شان از مقامی که آنان را به ترقی به این مراتب برانگیخته است، به ایشان عطا می‌کند. و با او به آسمان دنیا فرود می‌آیند، و در حقیقت اوست که آنان را به آسمان دنیا فرود می‌آورد و با ایشان فرود می‌آید. پس از علومی که حق به آن همت‌هایی که از عرش فراتر نرفته‌اند، می‌بخشد، بهره‌مند می‌شوند. این‌گونه هر شب. سپس این همت‌ها فرود می‌آیند، در حالی که می‌دانند حق چه کرامتی به ایشان بخشیده است. پس با همت‌هایی که از جای خود حرکت نکرده‌اند، جمع می‌شوند و آنان را بر طبقاتی می‌یابند. از جمله کسانی را می‌یابند که نزدشان علومی است که مقید به ترقی نبوده و حق به ایشان نزدیک‌تر از «حَبْلِ الْوَرِيدِ» (رگ گردن) بوده است، هنگامی که با آنان در عماء و در آسمان دنیا و میان آن دو بود. خداوند متعال می‌فرماید: «وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ» (و او با شماست هر جا که باشید). پس او با هر همتی است، هر جا که باشد. و همت‌های زمینی را می‌یابند که از «أینیت» (کجا بودن) و از مراتب عقول تقدس یافته‌اند، پس مقید به هیچ حضرتی نشده‌اند. پس از علومی که شایسته این صفتی است که حق به ایشان بخشیده، به معارفی دست می‌یابند که آن همت‌ها را مبهوت می‌سازد. و این علوم از علوم اطلاق است که خارج از حصر أینی فلکی و حصر روحانی عقلی است. پس آنان با وجود اینکه در تاریکی طبیعت هستند، بر نوری قرار دارند که آن تاریکی به واسطه وجود مشاهده (المشاهدة) روشن شده است.\n\n### [دیدن بصری اشیاء دیدنی]\n\nو اینان کسانی هستند که می‌دانند ادراک اشیاء دیدنی تنها از اجتماع نور بصر با نور جسم نورانی، خواه خورشید باشد یا چراغ یا هر چیز دیگر، حاصل می‌شود. پس دیدنی‌ها آشکار می‌گردند. اگر جسم نورانی از بین برود، چیزی ظاهر نمی‌شود، و اگر بصر از بین برود، چیزی از آنچه بصر با نور خارجی ادراک می‌کند، اصلاً روشن نمی‌شود. آیا نمی‌بینی که صاحب کشف (الکشف)، هنگامی که شب تاریک می‌شود و درِ خانه‌اش بسته می‌گردد، و شخص دیگری نیز با او در آن تاریکی است و هر دو در عدم کشف دیدنی‌ها برابرند، یکی از آنان کسی است که در اوقاتی برایش کشف می‌شود؟ پس نوری بر او تجلی (التجلی) می‌کند و آن نور با نور بصرش جمع می‌شود، و آنچه در آن خانه تاریک است و خداوند خواسته است که تمام یا بخشی از آن را برایش آشکار سازد، ادراک می‌کند. او آن را مانند آنچه در روز یا با چراغ می‌بیند، مشاهده می‌کند، در حالی که رفیقش که با اوست، جز تاریکی نمی‌بیند و چیز دیگری را مشاهده نمی‌کند؛ زیرا آن نور بر او تجلی نکرده است تا با نور بصرش جمع شود و حجاب تاریکی را بزداید. اگر امر چنان نبود که ذکر کردیم، یا صاحب این کشف مانند رفیقش چیزی را ادراک نمی‌کرد، یا رفیقش مانند او اشیاء را ادراک می‌کرد، پس یا باید او نیز از اهل کشف باشد یا آن را با نور علم ادراک کند. زیرا مکاشف آن را با نور خیال ادراک می‌کند، همان‌گونه که شخص خوابیده ادراک می‌کند، در حالی که رفیقش در کنار او بیدار است و چیزی نمی‌بیند. صاحب کشف نیز چنین است. و اگر از صاحب کشف بپرسی که آیا در حال کشفت تاریکی می‌بینی؟ می‌گوید: «نه.» بلکه می‌گوید: «آن مکان چنان روشن شد که گفتم خورشید غروب نکرده است.» پس دیدنی‌ها را همان‌گونه که در روز ادراک می‌کرد، ادراک نمودم.\n\n### [هستی تاریکی است: جز با دو نور دیده نمی‌شود]\n\nو این مسئله‌ای است که ندیدم کسی به آن توجه داده باشد، مگر اینکه بوده و به من نرسیده باشد. پس هستی (الوجود) در اصل خود تماماً تاریک است و جز با دو نور دیده نمی‌شود. زیرا این امر و نظیر آن که آن را تأیید می‌کند، ایجاد عالم است. عالم از حیث ذات خود عدم است و وجود را کسب نمی‌کند مگر به دلیل قابل بودن خود، و این به خاطر امکان آن و اقتدار حق (الحق) است که وجود آن را بر عدمش ترجیح می‌دهد. اگر قابلیت از ممکن زائل شود، مانند محال خواهد بود و ایجاد را نمی‌پذیرد. محال و ممکن قبل از ترجیح به وجود، در عدم مشترک بودند. همچنین، با وجود قابلیت ممکن، اگر اقتدار حق نبود، عین این معدوم که ممکن است، موجود نمی‌شد. پس اعیان معدوم برای وجود ظاهر نشدند مگر به دلیل قابل بودنشان، و این مانند نور بصر است؛ و قادر بودن حق، مانند نور جسم نورانی است. پس اعیان ظاهر شدند، همان‌گونه که دیدنی‌ها با دو نور ظاهر شدند. همان‌طور که ممکن همواره قابل است و حق مقتدر و مرید، پس بقای وجود برای ممکن حفظ می‌شود، زیرا از ذات خود عدم دارد؛ همچنین بیننده همواره نور بصرش در بصرش هست و خورشید در نور خود تجلی می‌کند، پس دیدن‌هایی که به دیدنی‌ها تعلق می‌گیرد، حفظ می‌شود، در حالی که دیدنی‌ها از ذات خودشان نورانی نیستند، بلکه تاریک‌اند. پس اگر تعقل می‌کنی، تعقل کن. این امر، ریشه گمراهی عاقلان است و خودشان نمی‌دانند، زیرا آن را تعقل نکرده‌اند. و این سری از اسرار خداوند متعال است که اهل نظر از آن بی‌خبرند. و از این مسئله، قِدَم حق و حدوث خلق برای تو روشن می‌شود، اما نه بر وجهی که متکلمان تعقل می‌کنند و نه بر وجهی که حکما (به لقب، نه به حقیقت) تعقل می‌کنند. زیرا حکما در حقیقت، اهل الله، رسولان، پیامبران و اولیاء هستند. اما حکما به لقب، به علم نزدیک‌تر از دیگرانند، زیرا خداوند را جز به عنوان معبود تعقل نکرده‌اند، و اهل کلام از نظریه‌پردازان چنین نیستند.\n\n### [شب در حق اقطاب اهل شب]\n\nپس اقطاب اهل شب کسانی هستند که شب در حق ایشان، از نظر کشف (الکشف) و مشغولیت، مانند روز است. خداوند متعال می‌فرماید: «وإِنَّكُمْ لَتَمُرُّونَ عَلَيْهِمْ مُصْبِحِينَ وبِاللَّيْلِ أَ فَلا تَعْقِلُونَ» (و شما صبحگاهان بر آنان می‌گذرید و شبانگاهان، آیا تعقل نمی‌کنید؟). یعنی آنچه را که در صبح از آنان می‌دانید، در شب نیز می‌دانید، زیرا شب نزد دیگرانی که مقام کشف در شب را ندارند، تاریک است، اما برای صاحب نور، شب و صبح یکسان است. پس این معنای قول اوست: «أَ فَلا تَعْقِلُونَ» (آیا تعقل نمی‌کنید؟). اگر نفس تو ادعا کرد که از اهل شب هستی، پس بنگر که آیا در آنچه برایت ذکر کردم، قدم و کشفی دارد؟ پس آن محک و معیار است. و برای هر شبی در قرآن، اموری و علومی است که جز اهل شب به طور خاص آن را نمی‌دانند. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}