{
  "id": 386,
  "title": {
    "ar": "الباب السادس والثمانون وثلاثمائة في معرفة منازلة حبل الوريد وأينية المعية",
    "en": "Chapter Three Hundred and Eighty-Six: Concerning the Gnosis (المعرفة) of the Stations (منازلة) of the Jugular Vein (حبل الوريد) and the Modality of Whereness (أينية) of the Divine Concomitance (المعية).",
    "ur": "باب تین سو چھیاسی: رگِ جاں (حبل الوريد) کے منازل کی معرفت اور معیت (المعية) کی کیفیت کے بیان میں",
    "fa": "باب سیصد و هشتاد و ششم در معرفت منازل رگ گردن (حبل الوريد) و چگونگی معیت (همراهی الهی)"
  },
  "content": {
    "ar": "## «الباب السادس والثمانون وثلاثمائة في معرفة منازلة حبل الوريد وأينية المعية»\n\n\n> أنا مع العبد حيث كانا *** مستقبلا ماضيا وأنا\n> مقيدا مطلقا نزيها *** مقدسا عامرا مكانا\n\n\n> من قال شوقا تريد عيني *** بأن ترانا فقد جفانا\n\n\n> أين أنا منك يا جفونا *** لم تلحظ الفعل والزمانا\n\n\n> كيف لها أن ترى جلالي *** وقد رأى الصعق من رآنا\n\n\nقال الله عز وجل ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ وقال وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ فكان بهويته معنا وبأسمائه أقرب إلينا منا فإن الحق إذا جمع نفسه مع أحديته فلأسمائه من حيث ما تدل عليه من الحقائق المختلفة وما مدلولها سواه فإنها ومدلولاتها عينه وأسماؤه فلا بد أن تكون الكناية عن ذلك في عالم الألفاظ والكلمات بلفظ الجمع مثل نحن وإنا بكسر الهمزة وتشديد النون مثل قوله إنا كل شي‏ء خلقناه بقدر وإنا نحن نزلنا الذكر وإنا له لحافظون وقد تفرد إذا أراد هويته لا أسماءه مثل قوله إِنَّنِي أَنَا الله لا إِلهَ إِلَّا أَنَا فوحد وأين نحن ما أنا ولا معنى لمن قال إن ذلك كناية عن العظمة لا بل هي عن الكثرة وما ثم كثرة إلا ما تدل عليه منه أسماؤه الحسنى أو تكون عينه أعيان الموجودات وتختلف الصور لاختلاف حقائق الممكنات المركبات إذ قد قال عن هويته إنها جميع قوى الصور أي إذا أحب الشخص من عباده كشف له عنه به فعلم أنه هو فرآه به مع ثبوت عين الممكن وإضافة القوة التي هي عينه تعالى إلى العبد\n\n\nفقال كنت سمعه‏\n\n\nفالضمير في قوله كنت سمعه عين العبد والسمع عين الحق ولا يكون العبد عبدا إلا بسمعه وإلا فمن يقول إذا نودي سَمِعْنا وأَطَعْنا إلا المأمور عند تكوينه وفي تصرفاته فلو لا أنه سميع ما قيل له كن ولا يكون لو لا طاعته لربه في أمره إياه والحق سمعه ليس غيره في كل حال فكشف له سبحانه عن ذلك وإذا كان الأمر على ما ذكره عن نفسه وأعطاه الشهود والكشف صح الجمع في لفظة إنا ونحن وإذا لم يكن عين القوي والموجودات إلا هو صح الإفراد في إِنَّنِي أَنَا الله والهو والأنت وضمير المفرد بالخطاب بالكاف في إِيَّاكَ نَعْبُدُ وأمثال ذلك فأفرد نفسه في جمعيتنا فقال وهُوَ مَعَكُمْ وجمع نفسه في أحديتنا في قوله ونَحْنُ أَقْرَبُ إِلَيْهِ فأفرد الضمير العائد على الإنسان فلم يكن الجمع إلا بنا ولا الواحد العين إلا به فأينما كان الخلق فالحق يصحبه من حيث اسمه الرحمن لأن الرحم شجنة منه وجميع الناس رحم فإنهم أبناء أب واحد وأم واحدة فإنه خلقنا من نَفْسٍ واحِدَةٍ وهو آدم وبث من آدم وحواء رِجالًا كَثِيراً ونِساءً فنحن أرحام من حيث إن الرحم شجنة من الرحمن فصحت القرابة وقد أمر بصلة الأرحام فقال تعالى وأُولُوا الْأَرْحامِ بَعْضُهُمْ أَوْلى‏ بِبَعْضٍ في كِتابِ الله وأمر بأن نوصل الأرحام وهو أولى بهذا الوصف منا فلا بد أن يكون للرحم وصولا فإنها شجنة من الرحمن وقد لعن الله واللعنة البعد من انتسب إلى غير أبيه أو انتمى إلى غير مواليه أي لا ينتسب إلى غير رحمه فنحن من حيث الرحم قرابة قربى ومن حيث الرتبة عبيد فلا ننتسب إلا إليه ولا ننتمي لسواه وقد\n\n\nقال تعالى في الصحيح عنه اليوم أضع نسبكم‏\n\n\nلأنه عارض عرض لنا ما هو أصل لأنا نفترق ولا نجتمع وقد لا يعرف بعضنا بعضا فنسبنا الذي بيننا ما هو أصل إذ لو كان أصلا ما قبل العوارض ولا صح النكران‏\n\n\nثم قال وأرفع نسبي‏\n\n\nفإنا ما زلنا عنه قط ولا افترقنا منه ولا فارقنا ولا زال عنا وكيف نزول عمن نحن في قبضته ومن هو معنا أينما كنا وعلى أي حالة وصفنا من وجود وعدم ثم قال أين المتقون فقمنا إليه بأجمعنا لأنه ما منا إلا من اتخذه وقاية في دفع الشدائد عن نفسه وهو قوله وإِذا مَسَّكُمُ الضُّرُّ في الْبَحْرِ ضَلَّ من تَدْعُونَ إِلَّا إِيَّاهُ وما منا إلا من كان الحق له وقاية في دفع ما يقال\n\n\nعنه فيه إنه سوء فيكون كالمجن له تتعاور علينا سهام إلا سواء فيضاف كل مكروه إلينا فداء له فصح أن الناس كلهم متقون لكن ثم تقوى خصوص وتقوى عموم ميزتها الشرائع ونبهت عليها فمن علم ما قلناه حمل التقوى حملا عاما على جميع الخلق ومن وقف مع النقوي المعلومة عند الناس خصص وما نبهنا على هذا الأمر إلا مراعاة للشرع فإن الشرع راعى ذلك ونبه عليه حتى إذا علمه الإنسان وتحقق به ظهر له الفضل على غيره فإن الله يقول هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ والَّذِينَ لا يَعْلَمُونَ وقد أمر بصلة الأرحام والرحمن لنا رحم نرجع إليه فلا بد للمطيع أمره أن يصل رحمه وليس إلا وصلته بربه فإن الله بلا شك قد وصلنا من حيث إنه رحم لنا ف هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ المنعم على أي حالة كنا من طاعة أمره أو معصية وموافقة أو مخالفة فإنه لا يقطع صلة الرحم من جانبه وإن انقطعت عنه من جانبنا لجهلنا ثم إنه ما أمر بصلة\nالأرحام القريبة إلا ليسعدوا بذلك وما من شخص إلا وله رحم يصلها ولو بالسلام كما\n\n\nقال صلوا أرحامكم ولو بالسلام‏\n\n\nفإذا وصلنا رحمنا لم نصل على الحقيقة إلا هو وإن حملناه في عين رحمنا فهو يعرف نفسه كما إن الصدقة تقع بيد الرحمن قبل إن تقع بيد السائل وقال لَنْ يَنالَ الله لُحُومُها ولا دِماؤُها ولكِنْ يَنالُهُ التَّقْوى‏ مِنْكُمْ وفي نفس الأمر قد قلنا إنا وقاية له من كل سوء فلا بد لكل أحد أن يكون له صديق من الناس على أي دين كان ولا بد له من مراعاة صديقه وهو في النسب رحمه بلا شك لأنه أخوه لأمه وأبيه فكل بر طهر من أحد إلى أحد فهو صلة رحم لذا يقبلها الله من كل أحد فضلا من الله ونعمة غير أنهم بينهم مفاضلة في القرب قال علي بن أبي طالب القيرواني في ذلك‏\n\n\n> الناس في جهة التمثيل أكفاء *** أبوهم آدم والأم حواء\n\n\n> فإن يكن لهم من أصلهم نسب *** يفاخرون به فالطين والماء\n\n\n> ما الفضل إلا لأهل العلم أنهم *** على الهدى لمن استهدى أدلاء\n\n\n> وقدر كل امرئ ما كان يحسنه *** والجاهلون لأهل العلم أعداء\n\n\n### [القرابة قرابتان قرابة الدين وقرابة الطين‏]\n\n\nوالقرابة قرابتان قرابة الدين وقرابة الطين فمن جمع بين القرابتين فهو أولى بالصلة وإن انفرد أحدهما بالدين والآخر بالطين فتقدم قرابة الدين على قرابة الطين كما فعل الحق تعالى في الميراث فورث قرابة الدم ولم يورث قرابة الطين إذا اختلفا في الدين فكان الواحد مؤمنا بالله وحده والأخ الآخر كافر بأحدية الله ومات أحد الأخوين لم يجعل له نصيبا في ميراثه فقال لا يتوارث أهل ملتين وقد ذهب عقيل دون علي بن أبي طالب بمال أبيه لما مات أبو طالب عم رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وكل من قطع رحمه في حق شخص وهو قد وصلها في حق شخص آخر فالذي يرعى الله من ذلك جانب الوصلة لا جانب القطع فإنه القائل على لسان رسوله صَلَّى اللهُ عَليهِ وسَلَّم أتبع السيئة مثل قطع تلك الرحم الحسنة مثل وصلة الرحم تحمها فوصل رحمه في زيد يمحو قطع رحمه في عمرو وهذا أخوه وهذا أخوه لأن الله يصل الرحم ولا يقطعها فالحق يعضده في صلة من وصلها ويقطع من قطعها لأنه عين ذلك الذي قطعها ففي الوصل كلمة عناية إلهية بالواصل وفي القطع كلمة تحقيق أي أن الأمر كذلك فما في العالم إلا من هو وصول رحمه الأقوى الأقرب فإن أفضل الصلات في الأرحام صلة الأقرب فالأقرب وقد جاء في الصدقة أن أفضلها اللقمة يجعلها الإنسان في فمه لأنه لا أحد أقرب إليه من نفسه والله أقرب إلى العبد من نفسه منه فإنه القائل نَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ فإذا وصله العبد فقد وصل الأقرب بلا شك فقد أتى ما هو الأولى بالوصل في الأقربين فإن النص فيه ولهذا عم كل الأشياء اتساع رحمته فمن حجر رحمة الله فما حجرها إلا على نفسه ولو لا أن الأمر على خلاف ذلك لم ينل رحمة الله من حجرها وقصرها ولكن والله ما يستوي حكم رحمة الله فيمن حجرها بمن لم يحجرها وأطلقها من عين المنة كما أطلقها الله في كتابه في قوله ورَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ فما من شي‏ء إلا وهو طامع في رحمة الله فمنهم من تناله بحكم الوجوب ومنهم من تناله بحكم المنة كنت قاعدا يوما بإشبيلية بين يدي شيخنا في الطريق أبي العباس العريني من أهل العليا بمغرب الأندلس فدخل عليه رجل فوقع ذكر المعروف والصدقة فقال الرجل الله يقول الأقربون أولى بالمعروف فقال الشيخ على الفور إلى الله فما أبردها على الكبد وكذلك هو الأمر في نفسه ولا أقرب من الله فهو القريب سبحانه الذي لا يبعد إلا بعد تنزيه وتنقطع الأرحام بالموت ولا ينقطع الرحم المنسوبة إلى الحق فإنه معنا حيثما كنا ونحن ما بيننا نتصل في وقت وننقطع في وقت بموت أو بفقد وارتحال وكم من حال قد أغنى عن سؤال ومن جهل نفسه فهو بغيره أجهل ومن علم غيره فهو بنفسه أعلم‏\n\n\nمن عرف نفسه عرف ربه‏\n\n\n> ليس الذي يخبر عن غيره *** مثل الذي يخبر عن نفسه‏\n\n\n> لأنه يخبر عن فوقه *** في غيبه كان وفي حسه‏\n\n\n> وكل من أخبر عن نفسه *** فإنما أخبر عن جنسه‏\n\n\n> والحق إن قيدته إنه *** لا يحجب المحبوس في حبسه‏\n> من قيد الحق بإطلاقه *** فما أقام الميت من رمسه‏\n\n\n> هيهات لا يعرف أسراره *** إلا الذي حج إلى قدسه‏\n\n\n> من أسه الحق فذاك الذي *** يطرحه الضارب من أسه‏\n\n\n### [سر انبعاث الله تعالى موسى وهارون إلى فرعون‏]\n\n\nسر إلهي لا يعرفه كثير من الناس بعث الله تعالى موسى وهارون إلى فرعون وأوصاهما أن يقولا لَهُ قَوْلًا لَيِّناً لَعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشى‏ والترجي من الله واقع عند جميع العلماء كما قال عَسَى الله أَنْ يَتُوبَ عَلَيْهِمْ فقال العلماء عسى من الله واجبة ولعل وعسى أختان فعلم الله أنه يتذكر ولا يكون التذكر إلا عن علم سابق منسي ثم قال لهما لما رأى خوفهما من أنه لا يجيب إلى ما يدعوانه إليه لا تَخافا إِنَّنِي مَعَكُما أَسْمَعُ وأَرى‏ أي أسمع من فرعون إذا بلغتما إليه رسالة ربكما وأرى ما يكون منكما في حقه مما أوصيتكما به من اللين والتنزل في الخطاب فلم يجد فرعون على من يتكبر لأن التكبر من المتكبر إنما يقع لمن يظهر له بصفة الكبرياء فلما رأى ما عندهما من اللين في الخطاب رق لهما وسرت الرحمة الإلهية بالعناية الربانية في باطنه فعلم إن الذي أرسلا به هو الحق فكان المتكلم من موسى وهارون الحق وكان السمع الذي تلقى من فرعون كلام موسى الحق فحصل القبول في نفسه وستر ذلك عن قومه فإنه شأن الحق أ لا ترى إليه تعالى في القيامة يتجلى في صورة ينكر فيها فهذا من ستره ولما علم فرعون إن الحق سمع خلقه وبصره ولسانه وجميع قواه لذلك قال بلسان الحق أَنَا رَبُّكُمُ الْأَعْلى‏ إذ علم إن الله هو الذي قال على لسان عبده أَنَا رَبُّكُمُ الْأَعْلى‏ فأخبر الله تعالى أنه أخذه نَكالَ الْآخِرَةِ والْأُولى‏ والنكل القيد فقيده الله بعبوديته مع ربه في الأولى بعلمه أنه عبد الله وفي الآخرة إذا بعثه الله يبعثه على ما مات عليه من الايمان به علما وقولا وليس بعد شهادة الله شهادة وقد شهد له أنه قيده في الأولى والآخرة إِنَّ في ذلِكَ أي في هذا الأخذ لعبرة أي تعجبا وتجاوزا مما يسبق منه إلى فهم العامة إلى ما فيه مما يفهمه الخاصة من عباد الله وهم العلماء ولذلك قال لَعِبْرَةً لِمَنْ يَخْشى‏ وقد عرفنا أنه إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ وقد قال لَعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشى‏ ولا يخشى حتى يعلم بالتذكر ما كان نسيه من العلم بالله ومن قيده الحق فلا يتمكن له الإطلاق والسراح من ذلك القيد وقولهما إِنَّنا نَخافُ أَنْ يَفْرُطَ عَلَيْنا أي يتقدم علينا بالحجة بما يرجع إليه من التوحيد أَوْ أَنْ يَطْغى‏ أي يرتفع كلامه لكونه يقصد إلى عين الحقيقة فنتعب معه فلهذا قال لهما لا تَخافا إِنَّنِي مَعَكُما أَسْمَعُ وأَرى‏ وأوصاهما أن يلينا له في القول فلما قالا له صَلَّى اللهُ عَليهِ وسَلَّم ما قالاه على الوجه الذي عهد إليهما الله أن يقولاه قال لهما فرعون فَمَنْ رَبُّكُما يا مُوسى‏ كما يقول فتانا القبر للميت لا لجهله بما يقوله وإنما يريد أن يتنبه الحاضرون لما يقولانه مما يكون دليلا على وجود الله ليعلموا صدقهما لأن العاقل إذا علم أنهما إذا قالا مثل ذلك ربما إن الخواطر تتنبه ويدعوهم قولهما إلى النظر فيه لنصبهما في قولهما مواضع الدلالة على الله فإنه لا يسأل خصمه فدل سؤاله أنه يريد هداية من يفهم من قومه ما جاء به فقالا رَبُّنَا الَّذِي أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ ثُمَّ هَدى‏ فانصفا فرعون في هذا الخطاب وهذا من القول اللين فإنه دخل تحت قولهما كل شي‏ء ادعاه فرعون فأعطاه الله خلقه فكان في كلامهما جواب فرعون لهما إذ كان ما جاء به فرعون خلق لله ثم زادهما في السؤال ليزيدا في الدلالة قالَ فَما بالُ الْقُرُونِ الْأُولى‏ فقالا عِلْمُها عِنْدَ رَبِّي في كِتابٍ لا يَضِلُّ رَبِّي ولا يَنْسى‏ مثل ما نسيت أنت حتى ذكرناك فتذكرت فلو كنت إلهاما نسيت لأن الله قال لَعَلَّهُ يَتَذَكَّرُ ثم زادا في الدلالة بما قالا بعد ذلك إلى تمام الآية فما زال ذلك مضمرا في نفس فرعون لم يعطه حب الرئاسة أن يكذب نفسه عند قومه فيما استخفهم به حتى أطاعوه ف كانُوا قَوْماً فاسِقِينَ فما شركه معهم في ضمير أنهم فلما رأى البأس قالَ آمَنْتُ فتلفظ باعتقاده الذي ما زال معه فقال له الله تعالى آلْآنَ قلت ذلك فأثبت الله بقوله آلْآنَ إنه آمن عن علم محقق والله أعلم وإن كان الأمر فيه احتمال وحقت الكلمة من الله وجرت سنته في عباده إن الايمان في ذلك الوقت لا يدفع عن المؤمن العذاب الذي أنزله بهم في ذلك الوقت إِلَّا قَوْمَ يُونُسَ كما لا ينفع السارق توبته عند الحاكم فيرفع عنه‏\n\n\nحد القطع ولا الزاني مع توبته عند الحاكم مع علمنا بأنه تاب بقبول التوبة عند الله وحديث ماعز في ذلك صحيح إنه تاب توبة لو قسمت على أهل مدينة لوسعتهم ومع هذا لم تدفع عنه الحد بل أمر صَلَّى اللهُ عَليهِ وسَلَّم برجمه‏\n\n\nكذلك كل من آمن بالله عنده رؤية\nالبأس من الكفار إن الايمان لا يرفع نزول البأس بهم مع قبول الله إيمانهم في الدار الآخرة فيلقونه ولا ذنب لهم فإنهم ربما لو عاشوا بعد ذلك اكتسبوا أوزارا\n\n\n> أيها الخلق المسوي *** كم تنادي كم تلوي‏\n\n\n> فلتبادر قبل يوم *** ود فيه لو تسوي‏\n\n\n> بهم الأرض رجال *** كغثاء كان أحوى‏\n\n\n> خلق الرحمن خلقا *** مثل ما قال فسوى‏\n\n\n> ثم أعطاه اقتدارا *** فسطا فكان أقوى‏\n\n\n> قال كن لكل شي‏ء *** لم يكن وكان بلوى‏\n\n\nوإذا كان الحق يقول عن نفسه إنه خَلَقَ فَسَوَّى وقَدَّرَ فَهَدى‏ فما لك لا تسبح اسْمَ رَبِّكَ الْأَعْلَى جعلنا الله ممن قيده الحق به ورزقه الوقوف عند حدوده ومراسمه في الآخرة والأولى فانظر يا أخي ما أعطت عناية هذه المعية الإلهية في قوله وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ فهو معنا بهويته وهو معنا بأسمائه فهل ترى عين العارف كونا من الأكوان وعينا من الأعيان لا يكون الحق معه فالله يغفر للجميع بالواحد فكيف لا يغفر للواحد بالجميع فما من إنسان إلا وجميع أجزائه مسبحة بحمد الله ولا قوة من قواه إلا وهي ناطقة بالثناء على الله حتى النفس الناطقة المكلفة من حيث خلقها وعينها كسائر جسدها الذي هو ملكها مسبحة أيضا لله فما عصى وخالف الأمر واحد من هذه الجملة المعبر عنها بالإنسان أ فترى الله لا يقبل طاعة هذه الجملة في معصية ذلك الواحد هيهات وأين الكرم إلا هنا يا أَيُّهَا الْإِنْسانُ ما غَرَّكَ بِرَبِّكَ الْكَرِيمِ فيقول كرمك فهذا تنبيه من الله لعبده أن يقول كرمك كما يفعله الحاكم المؤمن العالم إذ يقول للسارق والزاني قل لا زنيت أو قل لا سرقت أو قل لا لعلمه أنه إذا اعترف أقام عليه حدا فربما يكون الزاني يدهش بين يدي الحاكم فينبهه ليقول بهذه المقالة لا فيدرأ عنه الحد بذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 386: Concerning the Knowledge of the Station of the Jugular Vein and the 'Where-ness' of the Divine Companionship\n\nI am with the servant wherever he may be,\nWhether future or past, and I am [there].\nBound, absolute, transcendent,\nSanctified, filling every place.\n\nWhoever says, out of longing, \"My eye wishes\nTo see Us,\" has abandoned Us.\n\nWhere am I from you, O eyelids,\nThat have not perceived the Act nor the Time?\n\nHow can they see My Majesty,\nWhen whoever saw Us was struck senseless?\n\nAllah, the Mighty and Majestic, said: <<وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ>> (And We are nearer to him than the jugular vein). And He said: <<وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ>> (And He is with you wherever you are). Thus, by His Identity (*Huwiyya*), He is with us, and by His Names (*Asmā’*), He is nearer to us than we are to ourselves. For when the Real (الحق) unites Himself with His Oneness (*Aḥadiyya*), it is due to His Names, insofar as they indicate the various Realities (*Ḥaqā’iq*)—and their referent is none other than Him. For they and their referents are His very Essence (*‘Ayn*) and His Names. Therefore, the allusion to this in the world of utterances and words must necessarily be in the plural form, such as *Naḥnu* (We) and *Innā* (Indeed We), such as His saying: <<إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ>> (Indeed, We have created all things with measure), and <<إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ>> (Indeed, We, We have sent down the Remembrance), and <<وَإِنَّا لَهُ لَحَافِظُونَ>> (And indeed, We are its guardians). And He uses the singular when He intends His Identity, not His Names, such as His saying: <<إِنَّنِي أَنَا اللَّهُ لَا إِلَهَ إِلَّا أَنَا>> (Indeed, I, I am Allah; there is no deity except Me)—thus He affirmed Unity. And where is the \"We\" that is not \"I\"? There is no meaning for those who say that this [plural] is an allusion to Majesty. Rather, it is an allusion to Multiplicity (*Kathra*). And there is no Multiplicity except that which His Beautiful Names (*al-Asmā’ al-Ḥusnā*) indicate concerning Him, or that His Essence is the Fixed Entities (*al-A‘yān*) of existing things. The forms differ due to the difference in the realities of the composite contingent things (*al-Mumkināt*), since He has said concerning His Identity that it is the totality of the powers of the forms. That is, when He loves a person among His servants, He unveils Himself to that person through Him, so the person knows that He is the Real, and sees Him through Him, while the essence of the contingent thing remains established, and the power—which is His very Essence (*‘Ayn*)—is attributed to the servant.\n\nSo He said: \"I was his hearing.\" The pronoun in His saying \"I was his hearing\" refers to the essence of the servant, while the hearing is the essence of the Real (الحق). The servant is not a servant except through his hearing. Otherwise, who would say, when called, <<سَمِعْنَا وَأَطَعْنَا>> (We hear and we obey), except the one commanded at the moment of his creation and in his actions? Were he not hearing, \"Be!\" would not have been said to him, and he would not come into existence were it not for his obedience to his Lord in His command to him. The Real (الحق) is his hearing, and nothing else, in every state. Thus, the Glorified One unveiled this to him. If the matter is as He mentioned concerning Himself, and He granted him Witnessing (*Shuhūd*) and Unveiling (*Kashf*), then the plural form in the words *Innā* and *Naḥnu* is valid. And if the Essence of the Powerful One and of all existing things is none other than Him, then the singular form is valid in <<إِنَّنِي أَنَا اللَّهُ>> (Indeed, I, I am Allah), and in *Huwa* (He), and *Anta* (You), and the singular pronoun of address (the *kāf*) in <<إِيَّاكَ نَعْبُدُ>> (You alone we worship), and similar instances. Thus, He used the singular for Himself in our multiplicity, saying: <<وَهُوَ مَعَكُمْ>> (And He is with you). And He used the plural for Himself in our oneness, in His saying: <<وَنَحْنُ أَقْرَبُ إِلَيْهِ>> (And We are nearer to him). He used the singular pronoun referring back to the human being. Thus, the plural exists only through us, and the Single Essence (*al-Wāḥid al-‘Ayn*) exists only through Him.\n\nWherever creation (*al-Khalq*) may be, the Real (الحق) accompanies it by virtue of His Name *al-Raḥmān* (The All-Merciful), because the womb (*al-Raḥim*) is a branch (*shujna*) of Him. And all people are kin (*raḥim*), for they are the children of one father and one mother, since He created us from <<نَفْسٍ وَاحِدَةٍ>> (a single soul), which is Adam, and spread forth from Adam and Eve <<رِجَالًا كَثِيرًا وَنِسَاءً>> (many men and women). Thus, we are kin insofar as the *raḥim* (kinship) is a branch of *al-Raḥmān* (The All-Merciful), establishing the validity of kinship (*Qarāba*). He commanded the maintenance of kinship ties (*ṣilat al-arḥām*), and the Exalted said: <<وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ فِي كِتَابِ اللَّهِ>> (And those of [blood] relationship are more entitled to [inheritance from] one another in the Book of Allah). He commanded us to maintain kinship ties, and He is more entitled to this description than we are. Therefore, the *raḥim* must have a connection, for it is a branch of *al-Raḥmān*. Allah has cursed—and the curse is distance—whoever attributes himself to other than his father or affiliates himself with other than his patrons; meaning, he should not attribute himself to other than his kin. Thus, from the perspective of kinship, we are close relatives, and from the perspective of rank, we are servants. Therefore, we attribute ourselves only to Him and affiliate ourselves with none other than Him.\n\nThe Exalted said, in the authentic Hadith concerning Him: \"Today I abolish your lineage.\" This is because it is an accidental quality (*‘āriḍ*) that occurs to us, which is not the origin (*aṣl*), for we separate and do not gather, and sometimes we do not recognize one another. Thus, the lineage between us is not the origin, for if it were the origin, it would not accept accidental qualities, nor would denial be valid. Then He said: \"And I elevate My lineage.\" For we have never ceased to be from Him, nor have we separated from Him, nor have we departed, nor has He ceased to be with us. And how could we cease to be from the One in Whose grasp we are, and Who is with us wherever we are, and in whatever state we are described, whether Being (*Wujūd*) or non-existence (*‘Adam*)? Then He said: \"Where are the God-fearing (*al-Muttaqūn*)?\" So we all rose up to Him. This is because there is none among us who has not taken Him as a shield (*wiqāya*) to ward off hardships from himself, which is His saying: <<وَإِذَا مَسَّكُمُ الضُّرُّ فِي الْبَحْرِ ضَلَّ مَنْ تَدْعُونَ إِلَّا إِيَّاهُ>> (And when adversity touches you at sea, lost are [all] those you invoke except Him). And there is none among us for whom the Real (الحق) was not a shield in warding off what is said about Him that is evil. Thus, He is like a shield for us, while the arrows of evil strike us indiscriminately, and every disliked thing is attributed to us as a ransom for Him. Thus, it is established that all people are God-fearing, but there is a specific piety (*taqwā khuṣūṣ*) and a general piety (*taqwā ‘umūm*), which the Divine Laws (*Sharā’i‘*) have distinguished and drawn attention to. Whoever knows what we have said applies piety generally to all creation (*al-Khalq*). Whoever stops at the piety known among people makes it specific. We have only drawn attention to this matter out of consideration for the Divine Law, for the Law has observed this and pointed it out, so that when a person knows it and realizes it, his superiority over others becomes apparent. For Allah says: <<هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ>> (Are those who know equal to those who do not know?). He commanded the maintenance of kinship ties, and *al-Raḥmān* (The All-Merciful) is the Kinship (*Raḥim*) to whom we return. Therefore, the one who obeys His command must maintain his kinship ties, and this is none other than his connection to his Lord. For Allah has undoubtedly connected with us, insofar as He is Kinship to us. Thus, He is <<هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ>> (He is the Provider, Possessor of Strength, the Firm), the Benefactor, regardless of our state, whether in obedience to His command or disobedience, agreement or opposition. For He does not sever the tie of kinship from His side, even if it is severed from our side due to our ignorance. Furthermore, He only commanded the maintenance of close kinship ties so that they might be blessed thereby. There is no person who does not have kin to whom he maintains ties, even if only by greeting, as He said: \"Maintain your kinship ties, even if only by greeting (*salām*).\" Therefore, when we maintain ties with our kin, we are in reality maintaining ties with none other than Him, even if we bear Him in the essence (*‘Ayn*) of our kin. He knows Himself, just as charity (*ṣadaqa*) falls into the hand of *al-Raḥmān* before it falls into the hand of the beggar. And He said: <<لَنْ يَنَالَ اللَّهَ لُحُومُهَا وَلَا دِمَاؤُهَا وَلَكِنْ يَنَالُهُ التَّقْوَى مِنْكُمْ>> (Their meat will not reach Allah, nor will their blood, but what reaches Him is piety from you). In reality, we have said that we are a shield for Him against all evil. Therefore, everyone must have a friend among people, regardless of their religion. And he must observe the rights of his friend, who is undoubtedly his kin by lineage, because he is his brother by his mother and father. Thus, every act of righteousness (*birr*) that appears from one person to another is the maintenance of kinship ties. Therefore, Allah accepts it from everyone, out of His grace and favor, although there is a gradation among them in terms of proximity.\n\n‘Alī ibn Abī Ṭālib al-Qayrawānī said concerning this:\n\nMankind, in terms of representation, are equals;\nTheir father is Adam, and their mother is Eve.\n\nIf they have a lineage from their origin\nBy which they boast, it is but clay and water.\n\nExcellence belongs only to the people of Knowledge (*‘Ilm*), for they\nAre guides to guidance for whoever seeks it.\n\nThe worth of every man is what he masters,\nAnd the ignorant are enemies to the people of Knowledge.\n\n[Kinship is of Two Kinds: Kinship of Religion and Kinship of Clay]\n\nKinship (*al-Qarāba*) is of two kinds: the kinship of religion (*Dīn*) and the kinship of clay (*Ṭīn*). Whoever combines both kinships is more entitled to the maintenance of ties. If one is distinguished by religion and the other by clay, the kinship of religion takes precedence over the kinship of clay. This is as the Exalted Real (الحق) did in inheritance, where He allowed the inheritance of blood kinship but not the inheritance of clay kinship if they differed in religion. For example, if one brother was a believer in the Oneness of Allah and the other brother was a disbeliever in the Oneness of Allah, and one of the brothers died, the other was not given a share in his inheritance, as He said: \"The people of two different religions do not inherit from one another.\" And ‘Aqīl took the wealth of his father, Abū Ṭālib (the uncle of the Messenger of Allah, peace and blessings be upon him), without ‘Alī ibn Abī Ṭālib [sharing it], when Abū Ṭālib died. Whoever severs kinship ties with one person while maintaining them with another, Allah regards the side of connection, not the side of severance. For He is the One Who said, through the tongue of His Messenger (peace and blessings be upon him): \"Follow up an evil deed—such as severing that kinship tie—with a good deed—such as maintaining a kinship tie—it will erase it.\" Thus, maintaining kinship with Zayd erases severing kinship with ‘Amr, and this one is his brother, and that one is his brother, because Allah maintains kinship ties and does not sever them. The Real (الحق) supports him in maintaining ties with those he connects with, and severs him from those he severs ties with, because He is the very essence (*‘Ayn*) of the one who severed them. In the connection there is a word of Divine Providence (*‘ināya ilāhiyya*) for the connector, and in the severance there is a word of verification, meaning that the matter is indeed so. There is no one in the world (*‘ālam*) except the one who maintains his strongest and nearest kinship ties. For the best maintenance of kinship ties is connecting with the nearest, then the next nearest. It has been reported concerning charity that the best of it is the morsel a person places in his own mouth, because no one is nearer to him than himself. And Allah is nearer to the servant than the servant is to himself, for He is the One Who said: <<وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ>> (And We are nearer to him than the jugular vein). Therefore, if the servant connects with Him, he has undoubtedly connected with the nearest, and has thus performed what is most worthy of connection among the nearest, for the text confirms this. For this reason, the vastness of His Mercy (*Raḥma*) encompasses all things. Whoever restricts the Mercy of Allah has only restricted it upon himself. Were the matter otherwise, the Mercy of Allah would not reach the one who restricts and limits it. But, by Allah, the ruling of Allah's Mercy is not equal for the one who restricts it and the one who does not restrict it but releases it from the essence of favor (*minna*), just as Allah released it in His Book in His saying: <<وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ>> (And My Mercy encompasses all things). There is nothing that does not aspire to Allah's Mercy. Some receive it by the ruling of necessity (*wujūb*), and some receive it by the ruling of favor. I was sitting one day in Seville before our Shaykh in the Path, Abū al-‘Abbās al-‘Uraynī, one of the people of the high lands of Western Andalusia. A man entered, and the topic of good deeds (*ma‘rūf*) and charity arose. The man said, \"Allah says: 'The nearest are most entitled to good deeds.'\" The Shaykh immediately replied, \"To Allah!\" How cooling that was upon the liver! And that is the matter in itself. There is none nearer than Allah. He is the Near One, the Glorified, Who is only distant by way of transcendence (*tanzīh*). Kinship ties are severed by death, but the Kinship attributed to the Real (الحق) is not severed, for He is with us wherever we are. As for us among ourselves, we connect at one time and sever at another, due to death, loss, or travel. How many a state has rendered questioning unnecessary! Whoever is ignorant of himself is more ignorant of others. And whoever knows others is more knowledgeable of himself.\n\n\"Whoever knows himself knows his Lord.\"\n\nHe who speaks about another\nIs not like him who speaks about himself,\n\nBecause he speaks about what is above him,\nWhether in his unseen (*ghayb*) or in his sensory perception (*ḥiss*).\n\nAnd everyone who speaks about himself\nOnly speaks about his own kind.\n\nAnd the Real (الحق), if you restrict Him,\nDoes not veil the confined one in his confinement.\n\nWhoever restricts the Real (الحق) by His absoluteness (*iṭlāq*),\nHas not raised the dead from his grave.\n\nFar be it! No one knows His secrets\nExcept the one who has made pilgrimage to His sanctity.\n\nHe whose foundation (*ass*) is the Real (الحق) is the one\nWhom the striker casts down from his foundation.\n\n[The Secret of Allah’s Sending Moses and Aaron to Pharaoh]\n\nA Divine secret (*sirr ilāhī*) that many people do not know: Allah the Exalted sent Moses and Aaron to Pharaoh and instructed them to speak to him <<قَوْلًا لَيِّنًا لَعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشَى>> (a gentle word, that perhaps he may remember or fear). The hope (*tarajjī*) expressed by Allah is considered certain by all scholars, just as He said: <<عَسَى اللَّهُ أَنْ يَتُوبَ عَلَيْهِمْ>> (Perhaps Allah will turn to them in forgiveness). The scholars said that *‘asā* (perhaps) from Allah is obligatory, and *la‘alla* (that perhaps) and *‘asā* are sisters. Thus, Allah knew that he would remember, and remembrance (*tadhakkur*) only occurs concerning prior knowledge that was forgotten. Then, when He saw their fear that he would not respond to what they invited him to, He said to them: <<لَا تَخَافَا إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَى>> (Fear not. Indeed, I am with you both; I hear and I see). Meaning: I hear from Pharaoh when you convey the message of your Lord to him, and I see what proceeds from you concerning him, regarding the gentleness and humility in address that I instructed you with. Pharaoh thus found no one upon whom to act arrogantly, because arrogance from the arrogant person only occurs toward one who appears to him with the attribute of pride. When he saw the gentleness in their address, he softened toward them, and the Divine Mercy (*al-Raḥma al-Ilāhiyya*) with the Lordly Providence (*al-‘Ināya al-Rabbāniyya*) flowed into his inner being, so he knew that what they were sent with was the Real (الحق). Thus, the speaker from Moses and Aaron was the Real (الحق), and the hearing that received Moses’ speech from Pharaoh was the Real (الحق). Acceptance occurred within his soul, but he concealed that from his people. This is the way of the Real (الحق). Do you not see that the Exalted will manifest Himself (*yatajallā*) on the Day of Resurrection in a form that is denied? This is part of His concealment (*satr*). And when Pharaoh knew that the Real (الحق) was the hearing, sight, tongue, and all the powers of His creation, he therefore spoke with the tongue of the Real: <<أَنَا رَبُّكُمُ الْأَعْلَى>> (I am your Lord, the Most High). Since he knew that it was Allah Who spoke through the tongue of His servant: \"I am your Lord, the Most High.\" Allah the Exalted then informed us that He seized him with <<نَكَالَ الْآخِرَةِ وَالْأُولَى>> (the punishment/fetter of the Hereafter and the former life). The *nakal* (fetter) is the shackle. So Allah shackled him with his servitude (*‘ubūdiyya*) to his Lord in the former life, by his knowledge that he was a servant of Allah, and in the Hereafter, when Allah resurrects him, He will resurrect him upon the faith in Him, both in knowledge and utterance, upon which he died. There is no testimony after the testimony of Allah, and He testified for him that He shackled him in the former life and the Hereafter. <<إِنَّ فِي ذَلِكَ>> (Indeed, in that)—meaning, in this seizure—<<لَعِبْرَةً>> (is a lesson/admonition), meaning astonishment and a transcendence from what first occurs to the understanding of the common people to what is contained within it, understood by the elite among Allah’s servants, who are the scholars (*‘ulamā’*). Therefore, He said: <<لَعِبْرَةً لِمَنْ يَخْشَى>> (a lesson for whoever fears). And we know that <<إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ>> (Only those fear Allah, from among His servants, who have knowledge). And He said: <<لَعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشَى>> (that perhaps he may remember or fear). And one does not fear until he knows, through remembrance, the knowledge of Allah that he had forgotten. And whoever is shackled by the Real (الحق) cannot attain release or freedom from that shackle. And their saying: <<إِنَّنَا نَخَافُ أَنْ يَفْرُطَ عَلَيْنَا>> (Indeed, we fear that he may hasten against us)—meaning, that he may precede us with an argument concerning the Unity (*Tawḥīd*) that reverts back to Him—<<أَوْ أَنْ يَطْغَى>> (or that he may transgress)—meaning, that his speech may rise high because he aims at the very Essence of Reality (*‘Ayn al-Ḥaqīqa*), causing us difficulty with him. For this reason, He said to them: <<لَا تَخَافَا إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَى>> (Fear not. Indeed, I am with you both; I hear and I see), and He instructed them to be gentle with him in speech. When they spoke to him (peace and blessings be upon him) what Allah had entrusted them to say, Pharaoh said to them: <<فَمَنْ رَبُّكُمَا يَا مُوسَى>> (So who is your Lord, O Moses?). This is like the two angels of the grave asking the deceased, not out of ignorance of what he says, but rather wanting those present to be alerted to what they are saying, which serves as proof of Allah's existence, so that they may know the truthfulness of the two messengers. Because the intelligent person, knowing that when they speak thus, thoughts might be awakened, and their speech might invite them to reflect upon it, since they established points of evidence for Allah in their statement. Thus, his question indicated that he desired the guidance of those among his people who understood what they brought. So they said: <<رَبُّنَا الَّذِي أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ ثُمَّ هَدَى>> (Our Lord is He who gave each thing its [distinctive] form and nature, then guided [it]). They were fair to Pharaoh in this address, and this was part of the gentle word, for everything Pharaoh claimed fell under their statement, \"gave each thing its form,\" which Allah gave it. Then he increased his questioning so that they might increase the evidence. He said: <<فَمَا بَالُ الْقُرُونِ الْأُولَى>> (Then what is the state of the former generations?). They replied: <<عِلْمُهَا عِنْدَ رَبِّي فِي كِتَابٍ لَا يَضِلُّ رَبِّي وَلَا يَنْسَى>> (The knowledge thereof is with my Lord in a record. My Lord neither errs nor forgets)—unlike you, who forgot until we reminded you, and you remembered. Had you been a god, you would have not forgotten, because Allah said: <<لَعَلَّهُ يَتَذَكَّرُ>> (that perhaps he may remember). Then they increased the evidence with what they said after that until the end of the verse. That [knowledge] remained hidden within Pharaoh's soul. The love of leadership prevented him from contradicting himself before his people, whom he had misled until they obeyed him, <<فَكَانُوا قَوْمًا فَاسِقِينَ>> (and they were a defiantly disobedient people). He did not share with them the inner conviction that they were disobedient. When he saw the distress (*ba’s*), he said: <<آمَنْتُ>> (I believe). Thus, he uttered the belief that had always been with him. Allah the Exalted said to him: <<آلْآنَ>> (Now?) Did you say that? By His saying <<آلْآنَ>>, Allah established that he believed based on verified knowledge. And Allah knows best, even if the matter holds possibility. The Word (*Kalima*) from Allah was realized, and His practice (*sunna*) among His servants was established: that faith at that moment does not avert the punishment that He sent down upon the believer at that time, <<إِلَّا قَوْمَ يُونُسَ>> (except the people of Jonah). Just as the thief's repentance does not benefit him before the judge to lift the penalty of cutting, nor the adulterer, despite his repentance before the judge, even though we know that his repentance is accepted by Allah. The Hadith of Mā‘iz concerning this is authentic: he repented a repentance that, if divided among the people of a city, would suffice them. Yet, this did not avert the legal penalty from him; rather, the Prophet (peace and blessings be upon him) commanded that he be stoned. Likewise, for every disbeliever who believes in Allah upon seeing the distress, faith does not lift the descent of the distress upon them, even though Allah accepts their faith in the Hereafter, where they will meet Him without sin, for perhaps had they lived after that, they would have acquired burdens [of sin].\n\nO balanced creation (*al-Khalq al-Musawwī*),\nHow much you call out, how much you twist!\n\nSo hasten before a Day\nWhen one would wish to be made equal [to the dust].\n\nMen whose earth [bodies]\nWere like the scum of the torrent, which was more fitting.\n\nThe All-Merciful (*al-Raḥmān*) created a creation\nJust as He said, and balanced it.\n\nThen He gave it power (*iqtidār*),\nSo it struck and became stronger.\n\nHe said \"Be!\" to everything\nThat was not, and it became a trial (*balwā*).\n\nIf the Real (الحق) says concerning Himself that He <<خَلَقَ فَسَوَّى>> (created and proportioned) and <<وَقَدَّرَ فَهَدَى>> (decreed and guided), then why do you not glorify <<اسْمَ رَبِّكَ الْأَعْلَى>> (the Name of your Lord, the Most High)? May Allah make us among those whom the Real (الحق) has shackled to Himself, and granted the standing at His limits and ordinances in the Hereafter and the former life. Look, O my brother, at what the providence (*‘ināya*) of this Divine Companionship (*al-Ma‘iyya al-Ilāhiyya*) grants in His saying: <<وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ>> (And He is with you wherever you are). He is with us by His Identity (*Huwiyya*), and He is with us by His Names (*Asmā’*). Does the eye of the Gnostic (*‘Ārif*) see any cosmos (*kawn*) among the cosmoses, or any entity (*‘ayn*) among the entities, with which the Real (الحق) is not present? Allah forgives the multitude through the single one, so how could He not forgive the single one through the multitude? There is no human being whose every part does not glorify Allah with praise, and no power among his powers that does not speak in praise of Allah. Even the rational soul (*an-nafs an-nāṭiqa*) that is charged with responsibility, in terms of its creation and its essence, like the rest of its body which is its dominion, also glorifies Allah. Do you think that Allah would not accept the obedience of this totality in the face of the disobedience of that single part? Far be it! Where is generosity (*karam*) except here? <<يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ>> (O mankind, what has deceived you concerning your Generous Lord?). So he replies: \"Your generosity.\" This is an alert from Allah to His servant to say, \"Your generosity,\" just as the believing, knowledgeable judge does when he says to the thief or the adulterer, \"Say, 'I did not commit adultery,' or 'Say, 'I did not steal,' or 'Say, 'No,''\" knowing that if he confesses, he must impose a legal penalty (*ḥadd*) upon him. The adulterer might be bewildered before the judge, so the judge alerts him to utter this statement of denial, thereby averting the penalty from him. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the truth, and He guides to the way).",
    "ur": "باب تین سو چھیاسی: حبل الورید (شہ رگ) کے مقام اور معیت (Ma'iyyah) کی کیفیت کی معرفت میں۔\n\nمیں بندے کے ساتھ ہوں جہاں بھی وہ ہو،\nمستقبل میں، ماضی میں، اور میں ہی ہوں۔\nمقید (محدود)، مطلق (آزاد)، منزہ (پاک)،\nمقدس (پاکیزہ)، ہر جگہ کو آباد کرنے والا ہوں۔\nجس نے شوق سے کہا کہ میری آنکھیں\nتجھے دیکھنا چاہتی ہیں، اس نے ہم سے بے وفائی کی۔\nاے پلکوں، میں تم سے کہاں ہوں؟\nتم نے فعل اور زمانے کو نہیں دیکھا۔\nوہ میرے جلال کو کیسے دیکھ سکتی ہیں؟\nجبکہ جس نے ہمیں دیکھا، وہ بیہوش ہو گیا۔\n\nاللہ عزوجل نے فرمایا: \"اور ہم اس کی شہ رگ (حبل الورید) سے بھی زیادہ قریب ہیں\" (ق: ۱۶) اور فرمایا: \"اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو\" (الحدید: ۴)۔ پس وہ اپنی ہویت (Huwiyyah) کے ساتھ ہمارے ساتھ ہے اور اپنے اسماء کے ساتھ ہم سے بھی زیادہ قریب ہے۔ جب ذات حق (الحق) اپنی ذات کو اپنی احدیت (Aḥadiyyah) کے ساتھ جمع کرتا ہے، تو یہ اس کے اسماء کے لیے ہوتا ہے، اس لحاظ سے کہ وہ مختلف حقائق پر دلالت کرتے ہیں، اور ان کا مدلول اس کے سوا کچھ نہیں، کیونکہ وہ اسماء اور ان کے مدلولات اس کی ذات اور اس کے اسماء ہیں۔ لہٰذا، عالمِ الفاظ و کلمات میں اس سے کنایہ جمع کے صیغے سے ہونا ضروری ہے، جیسے \"نحن\" (ہم) اور \"إنا\" (بے شک ہم)، جیسا کہ اس کا فرمان ہے: \"بے شک ہم نے ہر چیز کو ایک اندازے سے پیدا کیا\" (القمر: ۴۹)، اور \"اور بے شک ہم ہی نے اس ذکر (قرآن) کو نازل کیا ہے اور بے شک ہم ہی اس کے محافظ ہیں\" (الحجر: ۹)۔ اور جب وہ اپنی ہویت کا ارادہ کرتا ہے، نہ کہ اپنے اسماء کا، تو وہ واحد کا صیغہ استعمال کرتا ہے، جیسا کہ اس کا فرمان ہے: \"بے شک میں ہی اللہ ہوں، میرے سوا کوئی معبود نہیں\" (طٰہٰ: ۱۴)۔ پس اس نے توحید بیان کی۔ اور \"نحن\" (ہم) \"أنا\" (میں) نہیں ہے۔ اور اس شخص کی بات کا کوئی معنی نہیں جو کہتا ہے کہ یہ عظمت سے کنایہ ہے، بلکہ یہ کثرت سے کنایہ ہے، اور وہاں کوئی کثرت نہیں مگر وہ جس پر اس کے اسماء حسنیٰ دلالت کرتے ہیں، یا یہ کہ وہ موجودات کی اعیان (ذوات) کی عین (حقیقت) ہے، اور مرکب ممکنات کے حقائق کے اختلاف کی وجہ سے صورتیں مختلف ہوتی ہیں۔ کیونکہ اس نے اپنی ہویت کے بارے میں فرمایا ہے کہ وہ تمام صورتوں کی قوتیں ہے، یعنی جب وہ اپنے بندوں میں سے کسی سے محبت کرتا ہے تو اس کے ذریعے اس پر کشف (Kashf) کرتا ہے، پس وہ جان لیتا ہے کہ وہ (حق) ہی ہے، اور اسے اس کے ذریعے دیکھتا ہے، جبکہ ممکن کی عین (ذات) ثابت رہتی ہے اور وہ قوت جو عینِ حق تعالیٰ ہے، بندے کی طرف منسوب ہو جاتی ہے۔\n\nپس فرمایا: \"میں اس کا کان بن جاتا ہوں\" (صحیح حدیث قدسی)۔ پس اس فرمان میں ضمیر (ضمیر) \"کنت\" (میں تھا) بندے کی عین (ذات) ہے اور \"سمع\" (سننا) عینِ حق ہے۔ اور بندہ اپنے سننے کی قوت کے بغیر بندہ نہیں ہو سکتا، ورنہ جب اسے پکارا جاتا ہے تو \"ہم نے سنا اور اطاعت کی\" (البقرہ: ۲۸۵) کون کہتا ہے؟ سوائے اس کے جسے اس کی تخلیق کے وقت اور اس کے تصرفات میں حکم دیا گیا ہو۔ اگر وہ سمیع (سننے والا) نہ ہوتا تو اسے \"کن\" (ہو جا) نہ کہا جاتا، اور وہ نہ ہوتا اگر وہ اپنے رب کے حکم کی اطاعت نہ کرتا۔ اور حق ہر حال میں اس کا سمع ہے، کوئی اور نہیں۔ پس اللہ سبحانہ و تعالیٰ نے اس پر یہ کشف (Kashf) فرمایا۔ اور جب معاملہ وہی ہے جو اس نے اپنے بارے میں ذکر کیا اور اسے شہود (Shuhūd) اور کشف (Kashf) عطا کیا، تو \"إنا\" اور \"نحن\" کے لفظ میں جمع کا صیغہ صحیح ہوا۔ اور جب قوی اور موجودات کی عین (حقیقت) اس کے سوا کوئی نہیں، تو \"إِنَّنِي أَنَا الله\" (بے شک میں ہی اللہ ہوں)، \"ھو\" (وہ)، \"أنت\" (تو)، اور \"إِيَّاكَ نَعْبُدُ\" (ہم تیری ہی عبادت کرتے ہیں) میں خطاب کے ساتھ واحد کی ضمیر کا استعمال صحیح ہوا۔ پس اس نے ہماری جمعیت (Collectivity) میں اپنی ذات کو واحد بیان کیا، جب فرمایا: \"اور وہ تمہارے ساتھ ہے\" (الحدید: ۴)، اور اس نے ہماری احدیت (Aḥadiyyah) میں اپنی ذات کو جمع بیان کیا، جب فرمایا: \"اور ہم اس کی شہ رگ سے بھی زیادہ قریب ہیں\" (ق: ۱۶)۔ پس اس نے انسان کی طرف لوٹنے والی ضمیر کو واحد بیان کیا۔ پس جمع صرف ہمارے ذریعے ہے اور واحد عین (ذات) صرف اس کے ذریعے ہے۔ پس جہاں کہیں بھی مخلوق ہو، حق اس کے ساتھ اپنے نام \"الرحمن\" (الرحمن) کے لحاظ سے ہوتا ہے، کیونکہ رحم (الرحم) اس سے ایک شاخ ہے۔ اور تمام لوگ رحم (رشتہ دار) ہیں، کیونکہ وہ ایک ہی باپ اور ایک ہی ماں کی اولاد ہیں، کیونکہ اس نے ہمیں \"ایک جان\" (نَفْسٍ واحِدَةٍ) سے پیدا کیا، اور وہ آدم ہیں، اور آدم اور حوا سے \"بہت سے مرد اور عورتیں پھیلا دیے\" (النساء: ۱)۔ پس ہم رحم (رشتہ دار) ہیں، اس لحاظ سے کہ رحم (Kinship) رحمن (الرحمن) سے ایک شاخ ہے۔ پس قرابت صحیح ہوئی۔ اور اس نے صلہ رحمی کا حکم دیا، پس اللہ تعالیٰ نے فرمایا: \"اور رشتہ دار (أُولُوا الْأَرْحامِ) اللہ کی کتاب میں ایک دوسرے کے زیادہ حقدار ہیں\" (الأنفال: ۷۵)۔ اور اس نے حکم دیا کہ ہم ارحام (رشتہ داروں) کو جوڑیں، اور وہ اس وصف کا ہم سے زیادہ حقدار ہے۔ لہٰذا رحم (Kinship) کے لیے وصل (جوڑ) ہونا ضروری ہے، کیونکہ یہ رحمن (الرحمن) سے ایک شاخ ہے۔ اور اللہ نے لعنت کی ہے، اور لعنت دوری ہے، اس شخص پر جو اپنے باپ کے علاوہ کسی اور کی طرف نسبت کرے یا اپنے موالی (آقاؤں) کے علاوہ کسی اور کی طرف منسوب ہو، یعنی وہ اپنے رحم (رشتہ) کے علاوہ کسی اور کی طرف نسبت نہ کرے۔ پس ہم رحم کے لحاظ سے قریبی رشتہ دار ہیں، اور رتبے کے لحاظ سے بندے ہیں، لہٰذا ہم صرف اسی کی طرف نسبت کرتے ہیں اور اس کے سوا کسی اور کی طرف منسوب نہیں ہوتے۔\n\nاللہ تعالیٰ نے صحیح حدیث قدسی میں اپنے بارے میں فرمایا: \"آج میں تمہارا نسب ختم کرتا ہوں\"۔ کیونکہ یہ ایک عارضی چیز ہے جو ہمیں لاحق ہوئی ہے، جو اصل نہیں ہے، کیونکہ ہم جدا ہوتے ہیں اور جمع نہیں ہوتے، اور بعض اوقات ہم ایک دوسرے کو نہیں پہچانتے۔ پس ہمارا وہ نسب جو ہمارے درمیان ہے، وہ اصل نہیں ہے، کیونکہ اگر وہ اصل ہوتا تو عوارض کو قبول نہ کرتا اور نہ ہی انکار صحیح ہوتا۔ پھر فرمایا: \"اور میں اپنا نسب بلند کرتا ہوں\"۔ کیونکہ ہم کبھی بھی اس سے جدا نہیں ہوئے، نہ ہم اس سے الگ ہوئے، نہ ہم نے اسے چھوڑا، اور نہ وہ ہم سے دور ہوا۔ اور ہم اس سے کیسے دور ہو سکتے ہیں جس کی گرفت میں ہم ہیں، اور جو ہمارے ساتھ ہے جہاں کہیں بھی ہم ہوں، اور وجود و عدم کی جس حالت سے بھی ہم متصف ہوں۔ پھر فرمایا: \"کہاں ہیں متقی لوگ؟\" تو ہم سب اس کی طرف کھڑے ہو گئے، کیونکہ ہم میں سے کوئی ایسا نہیں جس نے سختیوں کو اپنے آپ سے دور کرنے کے لیے اسے ڈھال نہ بنایا ہو، اور یہی اس کا فرمان ہے: \"اور جب تمہیں سمندر میں کوئی تکلیف پہنچتی ہے تو تم جنہیں پکارتے ہو وہ سب گم ہو جاتے ہیں سوائے اس کے\" (الإسراء: ۶۷)۔ اور ہم میں سے کوئی ایسا نہیں جس کے لیے حق اس چیز کو دور کرنے میں ڈھال نہ ہو جسے اس کے بارے میں برا کہا جاتا ہے، پس وہ اس کے لیے ڈھال کی مانند ہوتا ہے، ہم پر تیر آتے ہیں مگر وہ برابر نہیں ہوتے، پس ہر ناپسندیدہ چیز ہماری طرف منسوب کر دی جاتی ہے، تاکہ وہ اس کا فدیہ بن جائے۔ پس یہ بات صحیح ہوئی کہ تمام لوگ متقی ہیں، لیکن پھر تقویٰ خاص اور تقویٰ عام ہے، جسے شریعتوں نے ممتاز کیا اور اس پر متنبہ کیا۔ پس جس نے ہماری کہی ہوئی بات کو جانا، اس نے تقویٰ کو تمام مخلوق پر عام معنی میں لیا، اور جو لوگوں میں معلوم تقویٰ پر ٹھہرا رہا، اس نے تخصیص کی۔ اور ہم نے اس امر پر تنبیہ صرف شریعت کی رعایت کی وجہ سے کی ہے، کیونکہ شریعت نے اس کا لحاظ رکھا اور اس پر متنبہ کیا، یہاں تک کہ جب انسان اسے جان لیتا ہے اور اس میں متحقق ہو جاتا ہے تو اسے دوسروں پر فضیلت حاصل ہوتی ہے، کیونکہ اللہ فرماتا ہے: \"کیا وہ لوگ جو جانتے ہیں اور وہ لوگ جو نہیں جانتے برابر ہو سکتے ہیں؟\" (الزمر: ۹)۔ اور اس نے صلہ رحمی کا حکم دیا ہے، اور رحمن (الرحمن) ہمارے لیے رحم (رشتہ) ہے جس کی طرف ہم لوٹتے ہیں۔ پس اس کے حکم کی اطاعت کرنے والے کے لیے ضروری ہے کہ وہ اپنے رحم کو جوڑے، اور یہ صرف اپنے رب کے ساتھ اس کا وصل ہے۔ کیونکہ اللہ نے بلا شبہ ہمیں جوڑا ہے، اس لحاظ سے کہ وہ ہمارے لیے رحم ہے، پس \"وہ ہی رزق دینے والا، قوت والا، مضبوط ہے\" (الذاریات: ۵۸)، وہ ہر حال میں انعام کرنے والا ہے، خواہ ہم اس کے حکم کی اطاعت میں ہوں یا نافرمانی میں، موافقت میں ہوں یا مخالفت میں، کیونکہ وہ اپنی طرف سے صلہ رحمی کو نہیں کاٹتا، اگرچہ ہماری طرف سے ہماری جہالت کی وجہ سے وہ کٹ جائے۔ پھر اس نے قریبی رشتہ داروں سے صلہ رحمی کا حکم صرف اس لیے دیا تاکہ وہ اس سے سعادت حاصل کریں۔ اور کوئی شخص ایسا نہیں جس کا کوئی رحم (رشتہ دار) نہ ہو جسے وہ جوڑے، خواہ سلام کے ذریعے ہی کیوں نہ ہو، جیسا کہ فرمایا: \"اپنے رشتہ داروں سے صلہ رحمی کرو خواہ سلام کے ذریعے ہی ہو\" (حدیث)۔ پس جب ہم اپنے رحم کو جوڑتے ہیں تو حقیقت میں ہم صرف اسی کو جوڑتے ہیں، اگرچہ ہم اسے اپنے رحم کی عین (ذات) میں اٹھاتے ہیں، تو وہ خود کو پہچانتا ہے، جیسا کہ صدقہ سائل کے ہاتھ میں پڑنے سے پہلے رحمن (الرحمن) کے ہاتھ میں پڑتا ہے۔ اور فرمایا: \"اللہ کو نہ ان کا گوشت پہنچتا ہے اور نہ ان کا خون، لیکن اسے تمہاری طرف سے تقویٰ پہنچتا ہے\" (الحج: ۳۷)۔ اور نفس الامر میں، ہم نے کہا ہے کہ ہم ہر برائی سے اس کے لیے ڈھال ہیں، لہٰذا ہر شخص کے لیے ضروری ہے کہ لوگوں میں سے اس کا کوئی دوست ہو، خواہ وہ کسی بھی دین پر ہو، اور اس کے لیے ضروری ہے کہ وہ اپنے دوست کا خیال رکھے، اور وہ نسب کے لحاظ سے بلا شبہ اس کا رحم (رشتہ دار) ہے، کیونکہ وہ اس کا ماں باپ کی طرف سے بھائی ہے۔ پس ہر نیکی جو ایک شخص سے دوسرے کی طرف ظاہر ہوتی ہے، وہ صلہ رحمی ہے، اسی لیے اللہ اسے ہر ایک سے قبول کرتا ہے، یہ اللہ کا فضل اور انعام ہے۔ البتہ ان کے درمیان قرب میں فضیلت ہے۔ علی بن ابی طالب القیروانی نے اس بارے میں کہا:\n\nتمثیل کی جہت سے لوگ برابر ہیں،\nان کے باپ آدم ہیں اور ماں حوا۔\nاگر ان کے لیے ان کی اصل سے کوئی نسب ہے\nجس پر وہ فخر کریں، تو وہ مٹی اور پانی ہے۔\nفضیلت صرف اہل علم کے لیے ہے، کیونکہ وہ\nہدایت طلب کرنے والوں کے لیے ہدایت کے رہنما ہیں۔\nاور ہر شخص کی قدر وہی ہے جو وہ اچھی طرح جانتا ہے،\nاور جاہل لوگ اہل علم کے دشمن ہیں۔\n\n### [قرابتیں دو ہیں: دین کی قرابت اور مٹی کی قرابت]\n\nاور قرابتیں دو ہیں: دین کی قرابت اور مٹی کی قرابت۔ پس جس نے دونوں قرابتوں کو جمع کیا، وہ صلہ رحمی کا زیادہ حقدار ہے، اور اگر ان میں سے ایک دین میں منفرد ہو اور دوسرا مٹی میں، تو دین کی قرابت کو مٹی کی قرابت پر مقدم کیا جاتا ہے، جیسا کہ حق تعالیٰ نے میراث میں کیا، پس اس نے خون کی قرابت کو وارث بنایا اور مٹی کی قرابت کو وارث نہیں بنایا جب وہ دین میں مختلف ہوں، پس اگر ایک بھائی اللہ وحدہ پر ایمان لانے والا ہو اور دوسرا بھائی اللہ کی احدیت (Aḥadiyyah) کا کافر ہو، اور ان میں سے ایک بھائی مر جائے، تو دوسرے کو اس کی میراث میں حصہ نہیں دیا جاتا، پس فرمایا: \"دو ملتوں والے ایک دوسرے کے وارث نہیں ہوتے\" (حدیث)۔ اور عقیل نے علی بن ابی طالب کے مقابلے میں اپنے والد کا مال لے لیا جب رسول اللہ صلی اللہ علیہ وسلم کے چچا ابو طالب فوت ہوئے (کیونکہ عقیل نے اسلام قبول نہیں کیا تھا)۔ اور جس شخص نے کسی ایک شخص کے حق میں صلہ رحمی کو کاٹا اور دوسرے شخص کے حق میں اسے جوڑا، تو اللہ اس میں وصل (جوڑنے) کے پہلو کا لحاظ رکھتا ہے نہ کہ قطع (کاٹنے) کے پہلو کا، کیونکہ وہ ہی ہے جس نے اپنے رسول صلی اللہ علیہ وسلم کی زبان سے فرمایا: \"نیکی کو برائی کے پیچھے لاؤ جو اسے مٹا دے\" (حدیث)۔ جیسے اس رحم کو کاٹنا ایک برائی ہے، اور صلہ رحمی جیسی نیکی اسے مٹا دیتی ہے۔ پس زید کے حق میں صلہ رحمی کرنا عمرو کے حق میں صلہ رحمی کاٹنے کو مٹا دیتا ہے، اور یہ بھی اس کا بھائی ہے اور وہ بھی اس کا بھائی ہے، کیونکہ اللہ رحم کو جوڑتا ہے اور اسے کاٹتا نہیں ہے۔ پس حق اس شخص کی مدد کرتا ہے جو اسے جوڑتا ہے، اور اس شخص کو کاٹتا ہے جو اسے کاٹتا ہے، کیونکہ وہ اس شخص کی عین (ذات) ہے جس نے اسے کاٹا۔ پس وصل (جوڑنے) میں واصل کے لیے ایک کلمہ عنایتِ الٰہیہ ہے، اور قطع (کاٹنے) میں ایک کلمہ تحقیق ہے، یعنی معاملہ ایسا ہی ہے۔ پس عالم میں کوئی ایسا نہیں جو اپنے سب سے قوی اور سب سے قریبی رحم کو جوڑنے والا نہ ہو۔ کیونکہ ارحام میں سب سے افضل صلہ رحمی اقرب فالاقرب (قریب تر کو قریب تر) سے صلہ رحمی ہے۔ اور صدقہ کے بارے میں آیا ہے کہ سب سے افضل وہ لقمہ ہے جو انسان اپنے منہ میں ڈالتا ہے، کیونکہ اس سے زیادہ قریب کوئی نہیں، اور اللہ بندے سے اس کی اپنی جان سے بھی زیادہ قریب ہے، کیونکہ وہ ہی فرماتا ہے: \"اور ہم اس کی شہ رگ (حبل الورید) سے بھی زیادہ قریب ہیں\" (ق: ۱۶)۔ پس جب بندہ اس سے وصل کرتا ہے تو بلا شبہ اس نے سب سے قریب سے وصل کیا، پس اس نے وہ کام کیا جو اقربین میں وصل کے لیے سب سے زیادہ اولیٰ ہے۔ کیونکہ نص اسی میں ہے۔ اور اسی وجہ سے اس کی رحمت کی وسعت نے ہر چیز کو عام کر دیا ہے۔ پس جس نے اللہ کی رحمت کو محدود کیا، اس نے اسے صرف اپنے اوپر محدود کیا، اور اگر معاملہ اس کے برعکس نہ ہوتا تو جس نے اسے محدود کیا اور قید کیا، وہ اللہ کی رحمت کو نہ پاتا۔ لیکن اللہ کی قسم! اللہ کی رحمت کا حکم اس شخص کے لیے برابر نہیں ہو سکتا جس نے اسے محدود کیا، اور اس شخص کے لیے جس نے اسے محدود نہیں کیا اور اسے عینِ منت سے آزاد کر دیا، جیسا کہ اللہ نے اسے اپنی کتاب میں آزاد کیا، اپنے فرمان میں: \"اور میری رحمت ہر چیز پر وسیع ہے\" (الأعراف: ۱۵۶)۔ پس کوئی چیز ایسی نہیں جو اللہ کی رحمت کی طمع نہ رکھتی ہو۔ پس ان میں سے بعض کو وہ حکمِ وجوب کے تحت پہنچتی ہے اور بعض کو حکمِ منت کے تحت۔ میں ایک دن اشبیلیہ میں اپنے شیخ، طریق کے ابو العباس العرینی، جو مغربِ اندلس کے علیا کے رہنے والے تھے، کے سامنے بیٹھا تھا، تو ایک شخص ان کے پاس آیا اور معروف اور صدقہ کا ذکر ہوا۔ تو اس شخص نے کہا: اللہ فرماتا ہے: \"الأقربون أولى بالمعروف\" (قریبی لوگ نیکی کے زیادہ حقدار ہیں)۔ تو شیخ نے فوراً کہا: \"إلی اللہ\" (اللہ کی طرف)۔ پس یہ بات دل کو کتنی ٹھنڈک دینے والی تھی۔ اور معاملہ فی نفسہ ایسا ہی ہے، اور اللہ سے زیادہ قریب کوئی نہیں، پس وہ سبحانہ و تعالیٰ قریب ہے، جو صرف تنزیہ (پاکیزگی) کی دوری سے دور ہوتا ہے۔ اور ارحام (رشتہ داریاں) موت سے منقطع ہو جاتی ہیں، لیکن حق سے منسوب رحم (رشتہ) منقطع نہیں ہوتا، کیونکہ وہ ہمارے ساتھ ہے جہاں کہیں بھی ہم ہوں، اور ہم آپس میں ایک وقت میں جڑتے ہیں اور دوسرے وقت میں موت یا گمشدگی اور کوچ سے منقطع ہو جاتے ہیں۔ اور کتنی ہی حالتیں ہیں جو سوال سے بے نیاز کر دیتی ہیں۔ اور جس نے اپنی ذات کو نہ جانا، وہ دوسروں سے زیادہ جاہل ہے، اور جس نے دوسروں کو جانا، وہ اپنی ذات سے زیادہ عالم ہے۔\n\n\"جس نے اپنی ذات کو پہچانا، اس نے اپنے رب کو پہچانا\" (حدیث)۔\n\nوہ جو دوسروں کے بارے میں خبر دیتا ہے،\nاس جیسا نہیں جو اپنی ذات کے بارے میں خبر دیتا ہے۔\nکیونکہ وہ اپنے اوپر والے کے بارے میں خبر دیتا ہے،\nخواہ وہ اس کے غیب میں ہو یا اس کے حس (ظاہر) میں۔\nاور ہر وہ شخص جو اپنی ذات کے بارے میں خبر دیتا ہے،\nتو وہ درحقیقت اپنی جنس کے بارے میں خبر دیتا ہے۔\nاور حق یہ ہے کہ اگر تو اسے مقید کرے، تو وہ\nقید خانے میں قید شخص کو نہیں چھپاتا۔\nجس نے حق کو اس کے اطلاق (آزادی) سے مقید کیا،\nاس نے مردے کو اس کی قبر سے نہیں اٹھایا۔\nہائے افسوس! اس کے بھیدوں کو کوئی نہیں جانتا،\nسوائے اس کے جس نے اس کی پاکیزگی کی طرف حج کیا۔\nجس کی بنیاد حق ہو، تو وہ وہی ہے\nجسے مارنے والا اس کی بنیاد سے گرا دیتا ہے۔\n\n### [اللہ تعالیٰ کا موسیٰ اور ہارون کو فرعون کی طرف بھیجنے کا راز]\n\nیہ ایک الٰہی راز ہے جسے بہت سے لوگ نہیں جانتے۔ اللہ تعالیٰ نے موسیٰ اور ہارون کو فرعون کی طرف بھیجا اور انہیں وصیت کی کہ وہ اس سے \"نرم بات (قَوْلًا لَيِّنًا) کہیں، شاید کہ وہ نصیحت پکڑے یا ڈر جائے\" (طٰہٰ: ۴۴)۔ اور اللہ کی طرف سے ترجی (امید) تمام علماء کے نزدیک واقع ہونے والی ہے، جیسا کہ اس نے فرمایا: \"شاید کہ اللہ ان پر توبہ قبول کر لے\" (التوبہ: ۱۰۲)۔ تو علماء نے کہا کہ اللہ کی طرف سے \"عسیٰ\" (شاید) واجب ہوتی ہے، اور \"لعل\" اور \"عسیٰ\" دونوں بہنیں ہیں۔ پس اللہ جانتا تھا کہ وہ نصیحت پکڑے گا، اور نصیحت پکڑنا صرف پہلے سے بھولے ہوئے علم سے ہی ہوتا ہے۔ پھر جب اللہ نے ان کا خوف دیکھا کہ وہ اس بات کا جواب نہیں دے گا جس کی طرف وہ اسے بلا رہے ہیں، تو ان سے فرمایا: \"ڈرومت، بے شک میں تمہارے ساتھ ہوں، سنتا اور دیکھتا ہوں\" (طٰہٰ: ۴۶)۔ یعنی جب تم اپنے رب کا پیغام اسے پہنچاؤ گے تو میں فرعون کی بات سنوں گا، اور میں وہ دیکھوں گا جو تم اس کے حق میں کرو گے، جس کی میں نے تمہیں نرمی اور خطاب میں تنزل کی وصیت کی ہے۔ پس فرعون کو کوئی ایسا شخص نہ ملا جس پر وہ تکبر کرتا، کیونکہ متکبر کا تکبر صرف اس شخص پر ہوتا ہے جو اس کے سامنے کبریائی کی صفت کے ساتھ ظاہر ہو۔ پس جب اس نے ان دونوں میں خطاب کی نرمی دیکھی تو وہ ان کے لیے نرم پڑ گیا، اور ربانی عنایت کے ساتھ الٰہی رحمت اس کے باطن میں سرایت کر گئی، پس اس نے جان لیا کہ جس کے ساتھ وہ بھیجے گئے ہیں وہ حق ہے۔ پس موسیٰ اور ہارون کی طرف سے متکلم حق تھا، اور وہ سمع (سننے کی قوت) جس نے فرعون کی طرف سے موسیٰ کی بات کو سنا وہ حق تھا۔ پس اس کے نفس میں قبولیت پیدا ہوئی، اور اس نے اسے اپنی قوم سے چھپایا، کیونکہ یہ حق کی شان ہے۔ کیا تم نہیں دیکھتے کہ وہ قیامت کے دن ایک ایسی صورت میں تجلی (Tajalli) فرمائے گا جسے لوگ پہچاننے سے انکار کر دیں گے؟ پس یہ اس کے چھپانے میں سے ہے۔ اور جب فرعون نے جان لیا کہ حق ہی اس کی مخلوق کا سمع، بصر، زبان اور تمام قوتیں ہے، اسی لیے اس نے زبانِ حق سے کہا: \"میں تمہارا سب سے بڑا رب ہوں\" (النازعات: ۲۴)، کیونکہ وہ جانتا تھا کہ اللہ ہی ہے جس نے اپنے بندے کی زبان سے \"میں تمہارا سب سے بڑا رب ہوں\" کہا۔ پس اللہ تعالیٰ نے خبر دی کہ اس نے اسے \"آخرت اور دنیا کی عبرتناک سزا\" (نَكالَ الْآخِرَةِ والْأُولىٰ) میں پکڑا (النازعات: ۲۵)۔ اور \"نکل\" (النکل) قید کو کہتے ہیں۔ پس اللہ نے اسے دنیا میں اس کے رب کے ساتھ اس کی بندگی کی قید میں جکڑ دیا، اس علم کے ساتھ کہ وہ اللہ کا بندہ ہے، اور آخرت میں جب اللہ اسے اٹھائے گا تو اسے اسی ایمان پر اٹھائے گا جس پر وہ مرا، علم اور قول کے لحاظ سے۔ اور اللہ کی گواہی کے بعد کوئی گواہی نہیں، اور اس نے اس کے لیے گواہی دی کہ اس نے اسے دنیا اور آخرت میں قید کیا۔ \"بے شک اس میں\" یعنی اس پکڑ میں \"ضرور عبرت ہے\"، یعنی تعجب اور تجاوز ہے اس چیز سے جو عوام کی سمجھ میں آتی ہے، اس چیز کی طرف جو اللہ کے خاص بندے یعنی علماء سمجھتے ہیں۔ اور اسی لیے فرمایا: \"اس کے لیے عبرت ہے جو ڈرتا ہے\" (النازعات: ۲۶)۔ اور ہم جانتے ہیں کہ \"اللہ سے اس کے بندوں میں سے صرف علماء ہی ڈرتے ہیں\" (فاطر: ۲۸)۔ اور اس نے فرمایا: \"شاید کہ وہ نصیحت پکڑے یا ڈر جائے\" (طٰہٰ: ۴۴)۔ اور وہ نہیں ڈرتا جب تک کہ وہ نصیحت پکڑنے کے ذریعے اس علم کو نہ جان لے جسے وہ اللہ کے بارے میں بھول چکا تھا۔ اور جسے حق نے قید کر دیا، اس کے لیے اس قید سے آزادی اور رہائی ممکن نہیں۔ اور ان دونوں کا یہ کہنا: \"بے شک ہم ڈرتے ہیں کہ وہ ہم پر زیادتی کرے\" (طٰہٰ: ۴۵)، یعنی وہ توحید سے متعلق حجت کے ساتھ ہم پر سبقت لے جائے، \"یا سرکشی کرے\"، یعنی اس کی بات بلند ہو جائے کیونکہ وہ عینِ حقیقت کا قصد کرتا ہے، تو ہم اس کے ساتھ تھک جائیں گے۔ اسی لیے اس نے ان سے فرمایا: \"ڈرومت، بے شک میں تمہارے ساتھ ہوں، سنتا اور دیکھتا ہوں\" (طٰہٰ: ۴۶)۔ اور انہیں وصیت کی کہ وہ اس سے نرم بات کہیں۔ پس جب انہوں نے اس سے وہ بات کہی جس کا اللہ نے انہیں حکم دیا تھا، تو فرعون نے ان دونوں سے کہا: \"پس اے موسیٰ! تمہارا رب کون ہے؟\" (طٰہٰ: ۴۹)۔ جیسا کہ قبر کے دو فرشتے میت سے کہتے ہیں، نہ اس لیے کہ وہ نہیں جانتے کہ وہ کیا کہہ رہا ہے، بلکہ وہ چاہتے ہیں کہ حاضرین اس بات پر متنبہ ہوں جو وہ دونوں کہہ رہے ہیں، جو اللہ کے وجود پر دلیل ہو، تاکہ وہ ان کی سچائی کو جانیں۔ کیونکہ عاقل جب جانتا ہے کہ جب وہ دونوں ایسی بات کہیں گے تو شاید دل متنبہ ہوں گے اور ان کا قول انہیں اس میں غور کرنے کی دعوت دے گا، کیونکہ انہوں نے اپنے قول میں اللہ پر دلالت کے مقامات کو نصب کیا ہے۔ پس وہ اپنے دشمن سے سوال نہیں کرتا، لہٰذا اس کا سوال اس بات پر دلالت کرتا ہے کہ وہ اپنی قوم میں سے ان لوگوں کی ہدایت چاہتا ہے جو اس کی لائی ہوئی بات کو سمجھتے ہیں۔ پس ان دونوں نے کہا: \"ہمارا رب وہ ہے جس نے ہر چیز کو اس کی خلقت عطا کی، پھر ہدایت دی\" (طٰہٰ: ۵۰)۔ پس انہوں نے اس خطاب میں فرعون کے ساتھ انصاف کیا، اور یہ نرم بات (القول اللین) میں سے ہے۔ کیونکہ فرعون نے جس چیز کا بھی دعویٰ کیا، وہ ان دونوں کے قول \"ہر چیز\" کے تحت داخل ہو گئی، پس اللہ نے اسے اس کی خلقت عطا کی۔ پس ان کی بات میں فرعون کے لیے ان کا جواب تھا، کیونکہ جو کچھ فرعون لایا تھا وہ اللہ کی مخلوق تھا۔ پھر اس نے سوال میں اضافہ کیا تاکہ وہ دلیل میں اضافہ کریں، اس نے کہا: \"تو پہلی قوموں کا کیا حال ہوا؟\" (طٰہٰ: ۵۱)۔ تو ان دونوں نے کہا: \"ان کا علم میرے رب کے پاس ایک کتاب میں ہے، میرا رب نہ بھولتا ہے اور نہ چوکتا ہے\" (طٰہٰ: ۵۲)۔ جیسا کہ تم بھول گئے تھے یہاں تک کہ ہم نے تمہیں یاد دلایا تو تم نے یاد کیا، اور اگر تم الٰہ ہوتے تو نہ بھولتے، کیونکہ اللہ نے فرمایا: \"شاید کہ وہ نصیحت پکڑے\" (طٰہٰ: ۴۴)۔ پھر انہوں نے اس کے بعد آیت کے اختتام تک مزید دلائل دیے۔ پس یہ بات فرعون کے نفس میں پوشیدہ رہی، لیکن حبِ ریاست نے اسے اجازت نہ دی کہ وہ اپنی قوم کے سامنے اپنی تکذیب کرے، جنہیں اس نے ہلکا سمجھا تھا یہاں تک کہ انہوں نے اس کی اطاعت کی، پس \"وہ فاسق لوگ تھے\" (الذاریات: ۵۳)۔ پس اس نے اپنے ضمیر میں ان کے ساتھ شرکت نہیں کی۔ پس جب اس نے عذاب دیکھا تو کہا: \"میں ایمان لایا\" (یونس: ۹۰)۔ پس اس نے اپنے اس اعتقاد کو زبان سے ادا کیا جو ہمیشہ اس کے ساتھ تھا۔ تو اللہ تعالیٰ نے اس سے فرمایا: \"کیا اب؟\" (یونس: ۹۱)۔ پس اللہ نے اپنے قول \"آلْآنَ\" سے ثابت کر دیا کہ وہ محقق علم کے ساتھ ایمان لایا، واللہ اعلم، اگرچہ اس معاملے میں احتمال ہے۔ اور اللہ کی طرف سے کلمہ حق ثابت ہو چکا تھا اور اس کی سنت اپنے بندوں میں جاری ہو چکی تھی کہ اس وقت کا ایمان اس عذاب کو دور نہیں کرتا جو ان پر نازل ہوا تھا، \"سوائے یونس کی قوم کے\" (یونس: ۹۸)۔ جیسا کہ سارق کی توبہ حاکم کے پاس اس کے ہاتھ کاٹنے کی حد کو دور نہیں کرتی، اور نہ ہی زانی کی توبہ حاکم کے پاس، باوجود اس کے کہ ہم جانتے ہیں کہ اللہ کے ہاں توبہ قبول ہو چکی ہے، اور ماعز کا واقعہ اس بارے میں صحیح ہے کہ اس نے ایسی توبہ کی کہ اگر اسے ایک شہر کے لوگوں پر تقسیم کیا جائے تو وہ ان سب کے لیے کافی ہو جائے، اس کے باوجود اس سے حد دور نہیں ہوئی، بلکہ نبی صلی اللہ علیہ وسلم نے اسے رجم کرنے کا حکم دیا۔ اسی طرح ہر وہ شخص جو کفار کی طرف سے عذاب کو دیکھتے ہوئے اللہ پر ایمان لاتا ہے، تو ایمان ان پر عذاب کے نزول کو ختم نہیں کرتا، اگرچہ اللہ آخرت میں ان کے ایمان کو قبول کر لے، تو وہ اس سے ملیں گے اور ان پر کوئی گناہ نہیں ہو گا، کیونکہ شاید اگر وہ اس کے بعد زندہ رہتے تو مزید گناہ کماتے۔\n\nاے درست کیے گئے مخلوق!\nتو کتنا پکارتا ہے، کتنا مڑتا ہے۔\nپس اس دن سے پہلے جلدی کر،\nجس میں وہ چاہے گا کہ کاش وہ برابر ہو جاتا۔\nزمین نے ان مردوں کو نگل لیا،\nجیسے کوڑا کرکٹ، جو زیادہ مناسب تھا۔\nرحمن نے مخلوق کو پیدا کیا،\nجیسا کہ اس نے کہا، پس اسے درست کیا۔\nپھر اسے قدرت عطا کی،\nپس وہ غالب آیا اور سب سے زیادہ قوی ہوا۔\nاس نے ہر چیز سے کہا \"ہو جا\"،\nجو نہیں تھی، اور وہ ایک آزمائش تھی۔\n\nاور جب ذات حق (الحق) اپنے بارے میں فرماتا ہے کہ اس نے \"پیدا کیا، پھر درست کیا\" (الأعلیٰ: ۲)، اور \"اندازہ مقرر کیا، پھر ہدایت دی\" (الأعلیٰ: ۳)، تو تجھے کیا ہوا کہ تو \"اپنے رب اعلیٰ کے نام کی تسبیح\" (الأعلیٰ: ۱) نہیں کرتا؟ اللہ ہمیں ان لوگوں میں شامل کرے جنہیں حق نے اپنے ساتھ مقید کیا اور انہیں دنیا و آخرت میں اپنی حدود اور مراسم پر قائم رہنے کی توفیق دی۔ پس اے میرے بھائی! دیکھو کہ اس الٰہی معیت (Ma'iyyah) کی عنایت نے کیا عطا کیا، اس کے فرمان میں: \"اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو\" (الحدید: ۴)۔ پس وہ اپنی ہویت (Huwiyyah) کے ساتھ ہمارے ساتھ ہے اور اپنے اسماء کے ساتھ ہمارے ساتھ ہے۔ تو کیا عارف کی آنکھ کوئی ایسا کون (عالم) یا کوئی ایسی عین (ذات) دیکھتی ہے جس کے ساتھ حق نہ ہو؟ پس اللہ ایک کے ذریعے سب کو بخش دیتا ہے، تو وہ سب کے ذریعے ایک کو کیوں نہیں بخشے گا؟ کوئی انسان ایسا نہیں جس کے تمام اجزاء اللہ کی حمد کے ساتھ تسبیح نہ کر رہے ہوں، اور اس کی کوئی قوت ایسی نہیں جو اللہ کی ثناء بیان نہ کر رہی ہو، یہاں تک کہ نفسِ ناطقہ (بولنے والی جان) جو مکلف ہے، اپنی خلقت اور اپنی عین (ذات) کے لحاظ سے، اپنے باقی جسم کی طرح جو اس کی ملکیت ہے، وہ بھی اللہ کی تسبیح کر رہی ہے۔ پس اس مجموعے میں سے، جسے انسان سے تعبیر کیا جاتا ہے، کسی ایک نے بھی نافرمانی نہیں کی اور حکم کی مخالفت نہیں کی۔ تو کیا تم سمجھتے ہو کہ اللہ اس ایک کی نافرمانی کے مقابلے میں اس مجموعے کی اطاعت کو قبول نہیں کرے گا؟ ہائے افسوس! اور کرم یہاں کے سوا کہاں ہے؟ \"اے انسان! تجھے تیرے رب کریم نے کس چیز سے دھوکے میں ڈالا؟\" (الإنفطار: ۶)۔ تو وہ کہتا ہے: \"تیرے کرم نے\"۔ پس یہ اللہ کی طرف سے اپنے بندے کو تنبیہ ہے کہ وہ کہے: \"تیرے کرم نے\"، جیسا کہ عالم اور مومن حاکم کرتا ہے جب وہ سارق اور زانی سے کہتا ہے: \"کہو کہ تم نے زنا نہیں کیا\" یا \"کہو کہ تم نے چوری نہیں کی\" یا \"کہو کہ نہیں\"، کیونکہ وہ جانتا ہے کہ اگر وہ اعتراف کرے گا تو وہ اس پر حد قائم کرے گا، اور بسا اوقات زانی حاکم کے سامنے گھبرا جاتا ہے، تو وہ اسے متنبہ کرتا ہے کہ وہ اس قول \"نہیں\" کو کہے، تاکہ اس سے حد ٹل جائے۔ اور \"اللہ حق فرماتا ہے اور وہی سیدھا راستہ دکھاتا ہے\" (الأحزاب: ۴)۔",
    "fa": "باب سیصد و هشتاد و ششم: در معرفت جایگاه رگ گردن (حبل الورید) و چگونگی معیت (همراهی الهی)\n\nمن با بنده هستم هر کجا که باشد *** در آینده و گذشته، و من هستم\nمقید و مطلق، منزه و پاک *** مقدس و آبادکننده مکان‌ها.\n\nآن کس که از سر شوق گوید چشمانم می‌خواهند *** ما را ببینند، به تحقیق بر ما جفا کرده است.\nای پلک‌ها، من از شما کجا هستم؟ *** که فعل و زمان را درک نکرده‌اید.\nچگونه می‌تواند جلال مرا ببیند؟ *** در حالی که هر کس ما را دید، صاعقه (صعق) را مشاهده کرد.\n\nخداوند عز و جل فرمود: «و ما از رگ گردن (حبل الورید) به او نزدیک‌تریم» (وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ) و فرمود: «و او با شماست هر کجا که باشید» (وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ). پس حق (الحق) با هویت (هويته) خود با ماست و با اسمای خود از ما به خودمان نزدیک‌تر است. زیرا حق (الحق) هنگامی که خود را با احدیت (أحديته) خویش جمع می‌بندد، این به دلیل اسمای اوست از آن جهت که بر حقایق (الحقائق) مختلف دلالت می‌کنند، و مدلول آن‌ها چیزی جز او نیست. زیرا آن‌ها و مدلولاتشان عین او و اسمای او هستند. بنابراین، ناگزیر است که کنایه از این امر در عالم الفاظ و کلمات با لفظ جمع باشد، مانند «نحن» (ما) و «إنا» (ما) با کسره همزه و تشدید نون، مانند این فرموده: «ما هر چیزی را به اندازه آفریدیم» (إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ) و «همانا ما خود ذکر (قرآن) را نازل کردیم و خود نگهبان آنیم» (إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ). و اگر هویت خود را بخواهد نه اسمای خود را، مفرد می‌آید، مانند این فرموده: «همانا من الله هستم، هیچ معبودی جز من نیست» (إِنَّنِي أَنَا اللَّهُ لَا إِلَهَ إِلَّا أَنَا). پس یگانگی را بیان کرد. و معنایی ندارد برای کسی که بگوید این کنایه از عظمت است؛ بلکه کنایه از کثرت است، و کثرتی در آنجا نیست مگر آنچه اسمای حسنای او بر آن دلالت می‌کنند، یا اینکه عین اعیان موجودات باشد و صورت‌ها به دلیل اختلاف حقایق ممکنات مرکب، متفاوت باشند. زیرا او درباره هویت خود فرموده است که آن جمیع قوای صورت‌هاست؛ یعنی اگر یکی از بندگانش را دوست بدارد، از طریق او برایش کشف (الکشف) می‌کند، پس می‌داند که او (حق) است و او را به واسطه او می‌بیند، با وجود ثبوت عین ممکن و اضافه شدن قوه‌ای که عین حق تعالی است به بنده.\n\nپس فرمود: «گوش او بودم» (كنت سمعه).\n\nضمیر در این فرموده که «گوش او بودم» عین بنده است و گوش عین حق (الحق) است. و بنده، بنده نمی‌شود مگر به واسطه گوشش. وگرنه چه کسی می‌گوید: «شنیدیم و اطاعت کردیم» (سَمِعْنَا وَأَطَعْنَا) جز مأمور هنگام تکوینش و در تصرفاتش؟ اگر او شنوا نبود، به او گفته نمی‌شد «باش» (کن)، و اگر اطاعت او از پروردگارش در امر او نبود، وجود نمی‌یافت. و حق (الحق) در هر حال گوش اوست و نه غیر او. پس حق سبحانه از این امر برای او کشف (الکشف) کرد. و چون امر بر آن است که حق از خود ذکر کرده و شهود (الشهود) و کشف (الکشف) را به او عطا کرده است، جمع بستن در لفظ «إنا» و «نحن» صحیح است. و چون عین قوی و موجودات جز او نیست، مفرد آوردن در «همانا من الله هستم» (إِنَّنِي أَنَا اللَّهُ) و «هو» و «أنت» و ضمیر مفرد با خطاب «کاف» در «تنها تو را می‌پرستیم» (إِيَّاكَ نَعْبُدُ) و امثال آن صحیح است. پس او در جمع بودن ما، خود را مفرد آورد و فرمود: «و او با شماست» (وَهُوَ مَعَكُمْ)، و در احدیت ما، خود را جمع آورد در این فرموده: «و ما از رگ گردن به او نزدیک‌تریم» (وَنَحْنُ أَقْرَبُ إِلَيْهِ). پس ضمیر بازگشت‌کننده به انسان را مفرد آورد. پس جمع جز به واسطه ما نبود و واحدِ عین جز به واسطه او نبود. پس هر کجا که خلق باشند، حق (الحق) به واسطه اسم رحمان (الرحمن) با آن‌ها همراه است، زیرا رحم شاخه‌ای از اوست، و همه مردم رحم هستند، زیرا آن‌ها فرزندان یک پدر و یک مادرند. زیرا او ما را از «یک نفس واحد» (نَفْسٍ وَاحِدَةٍ) آفرید که همان آدم است، و از آدم و حوا «مردان بسیار و زنان» (رِجَالًا كَثِيرًا وَنِسَاءً) پراکند. پس ما از حیث رحم، خویشاوندیم، زیرا رحم شاخه‌ای از رحمان (الرحمن) است، پس قرابت صحیح است. و به صله ارحام امر فرمود و حق تعالی فرمود: «و خویشاوندان (أُولُو الْأَرْحَامِ) در کتاب خدا به یکدیگر سزاوارترند» (وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ فِي كِتَابِ اللَّهِ). و امر فرمود که ما صله ارحام کنیم، و او به این وصف از ما سزاوارتر است. پس ناگزیر است که برای رحم وصولی باشد، زیرا آن شاخه‌ای از رحمان است. و خداوند لعنت کرد – و لعنت همان دوری است – کسی را که خود را به غیر پدرش نسبت دهد یا به غیر موالی خود منسوب کند؛ یعنی به غیر رحم خود نسبت ندهد. پس ما از حیث رحم، خویشاوند نزدیک هستیم و از حیث رتبه، بنده هستیم. پس جز به او نسبت نمی‌دهیم و جز به او منسوب نمی‌شویم.\n\nو حق تعالی در حدیث صحیح از او فرمود: «امروز نسب شما را فرو می‌نهم» (اليوم أضع نسبكم).\n\nزیرا آن عارضی است که برای ما پیش آمده و اصل نیست، چرا که ما از هم جدا می‌شویم و جمع نمی‌شویم و گاهی یکدیگر را نمی‌شناسیم. پس نسب ما که بین ماست، اصل نیست، زیرا اگر اصل بود، عوارض را نمی‌پذیرفت و انکار صحیح نبود.\n\nسپس فرمود: «و نسب خود را بالا می‌برم» (وأرفع نسبي).\n\nزیرا ما هرگز از او دور نشده‌ایم و از او جدا نگشته‌ایم و او ما را ترک نکرده و از ما دور نشده است. و چگونه از کسی دور شویم که ما در قبضه او هستیم و او با ماست هر کجا که باشیم و در هر حالتی که وصف شویم، از وجود و عدم؟ سپس فرمود: «پرهیزگاران کجایند؟» پس همه ما به سوی او برخاستیم، زیرا هیچ یک از ما نیست مگر آنکه او را در دفع سختی‌ها از خود، سپر قرار داده است، و این همان فرموده اوست: «و چون در دریا به شما زیانی رسد، جز او هر که را می‌خوانید گم می‌شود» (وَإِذَا مَسَّكُمُ الضُّرُّ فِي الْبَحْرِ ضَلَّ مَنْ تَدْعُونَ إِلَّا إِيَّاهُ). و هیچ یک از ما نیست مگر آنکه حق (الحق) برای او سپری بوده است در دفع آنچه درباره او گفته می‌شود که بدی است، پس مانند سپر برای اوست که تیرها به سوی ما می‌آیند، اما نه به طور مساوی، پس هر ناخوشایندی به ما اضافه می‌شود تا فدای او شویم. پس صحیح است که همه مردم پرهیزگارند، اما تقوای خاص و تقوای عام وجود دارد که شرایع آن را متمایز کرده و بر آن هشدار داده‌اند. پس کسی که آنچه را گفتیم بداند، تقوا را به صورت عام بر همه خلق حمل می‌کند، و کسی که بر تقوای شناخته شده نزد مردم توقف کند، آن را خاص می‌گرداند. و ما بر این امر هشدار ندادیم مگر به خاطر رعایت شرع، زیرا شرع این را رعایت کرده و بر آن هشدار داده است تا هنگامی که انسان آن را بداند و به آن تحقق یابد، برتری او بر دیگران آشکار شود. زیرا خداوند می‌فرماید: «آیا کسانی که می‌دانند و کسانی که نمی‌دانند برابرند؟» (هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ). و به صله ارحام امر فرموده است، و رحمان (الرحمن) برای ما رحمی است که به سوی او باز می‌گردیم. پس برای مطیع امر او ناگزیر است که صله رحم کند، و آن جز وصله او به پروردگارش نیست. زیرا خداوند بدون شک ما را وصل کرده است از آن جهت که برای ما رحم است، پس او «روزی‌دهنده، صاحب قوت و استوار» (هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ) است، که در هر حالتی که باشیم، از اطاعت امر او یا معصیت، و موافقت یا مخالفت، نعمت می‌بخشد. زیرا او صله رحم را از جانب خود قطع نمی‌کند، حتی اگر از جانب ما به دلیل جهل ما قطع شود. سپس او به صله ارحام نزدیک امر نکرده است مگر برای اینکه به واسطه آن سعادتمند شوند. و هیچ کس نیست مگر آنکه رحمی دارد که باید آن را وصل کند، حتی با سلام، چنانکه فرمود:\n\n«صله رحم کنید، حتی با سلام» (صلوا أرحامكم ولو بالسلام).\n\nپس هنگامی که رحم خود را وصل کنیم، در حقیقت جز او را وصل نکرده‌ایم، و اگر آن را در عین رحم خود حمل کنیم، او خود را می‌شناسد، همان‌طور که صدقه قبل از اینکه به دست سائل برسد، به دست رحمان (الرحمن) می‌افتد. و فرمود: «هرگز گوشت‌ها و خون‌های آن‌ها به خدا نمی‌رسد، بلکه تقوای شما به او می‌رسد» (لَنْ يَنَالَ اللَّهَ لُحُومُهَا وَلَا دِمَاؤُهَا وَلَكِنْ يَنَالُهُ التَّقْوَى مِنْكُمْ). و در نفس الامر گفتیم که ما برای او سپری در برابر هر بدی هستیم. پس ناگزیر است که هر کس دوستی از مردم داشته باشد، بر هر دینی که باشد، و ناگزیر است که دوست خود را رعایت کند، و او در نسب بدون شک رحم اوست، زیرا برادر او از مادر و پدر است. پس هر نیکی خالصی که از کسی به دیگری برسد، صله رحم است، به همین دلیل خداوند آن را از هر کسی می‌پذیرد، به فضل و نعمت الهی. غیر از اینکه بین آن‌ها در نزدیکی، برتری وجود دارد. علی بن ابی طالب قیروانی در این باره فرموده است:\n\nمردم از جهت تمثیل برابرند *** پدرشان آدم و مادرشان حواست.\nو اگر برایشان از اصلشان نسبی باشد *** که به آن فخر کنند، پس آن گِل و آب است.\nبرتری نیست مگر برای اهل علم، زیرا آنان *** برای کسی که هدایت جوید، راهنمایان بر هدایتند.\nو ارزش هر کس به اندازه چیزی است که نیکو می‌داند *** و جاهلان دشمنان اهل علمند.\n\n### [خویشاوندی دو نوع است: خویشاوندی دین و خویشاوندی گِل]\n\nخویشاوندی دو نوع است: خویشاوندی دین و خویشاوندی گِل. پس کسی که هر دو خویشاوندی را جمع کند، به صله سزاوارتر است. و اگر یکی به دین و دیگری به گِل منفرد باشد، خویشاوندی دین بر خویشاوندی گِل مقدم است، همان‌طور که حق تعالی در میراث عمل کرد، پس خویشاوندان خونی را وارث قرار داد و خویشاوندان گِلی را وارث قرار نداد، هنگامی که در دین اختلاف داشته باشند. پس اگر یکی مؤمن به خدای یگانه باشد و برادر دیگر کافر به احدیت (أحديته) خدا باشد و یکی از دو برادر بمیرد، برای او نصیبی در میراث قرار داده نشد و فرمود: «اهل دو ملت از یکدیگر ارث نمی‌برند». و عقیل بدون علی بن ابی طالب، مال پدرش را برد هنگامی که ابوطالب، عموی رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) درگذشت. و هر کس که رحم خود را در حق شخصی قطع کند، در حالی که آن را در حق شخص دیگری وصل کرده باشد، آنچه خداوند از آن رعایت می‌کند، جانب وصله است نه جانب قطع. زیرا اوست که بر زبان رسولش (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «بدی را با نیکی دنبال کن»، مانند قطع آن رحم، و نیکی مانند وصله رحم که آن را محو می‌کند. پس وصله رحم او در زید، قطع رحم او در عمرو را محو می‌کند، و این برادر اوست و آن برادر اوست، زیرا خداوند رحم را وصل می‌کند و قطع نمی‌کند. پس حق (الحق) او را در صله کسی که وصل کرده است، تأیید می‌کند و کسی را که قطع کرده است، قطع می‌کند، زیرا او عین همان کسی است که قطع کرده است. پس در وصل، کلمه عنایت الهی به واصل است، و در قطع، کلمه تحقیق است، یعنی امر چنین است. پس در عالم نیست مگر کسی که وصل‌کننده رحم قوی‌تر و نزدیک‌تر خود باشد. زیرا بهترین صله‌ها در ارحام، صله نزدیک‌تر و نزدیک‌تر است. و در صدقه آمده است که بهترین آن، لقمه‌ای است که انسان در دهان خود می‌گذارد، زیرا هیچ کس به او نزدیک‌تر از خودش نیست. و خداوند از خود انسان به او نزدیک‌تر است، زیرا اوست که می‌فرماید: «و ما از رگ گردن به او نزدیک‌تریم» (وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ). پس اگر بنده او را وصل کند، بدون شک نزدیک‌ترین را وصل کرده است. پس آنچه را که در میان نزدیکان به وصل سزاوارتر است، انجام داده است، زیرا نص در آن است. و به همین دلیل، رحمت او همه چیز را فرا گرفته است. پس کسی که رحمت خدا را محدود کند، آن را جز بر خود محدود نکرده است. و اگر امر بر خلاف این بود، کسی که رحمت خدا را محدود و کوتاه کرده بود، به آن نمی‌رسید. اما به خدا سوگند، حکم رحمت خدا در مورد کسی که آن را محدود کرده است، با کسی که آن را محدود نکرده و از سر منت (المنة) آن را رها کرده است، برابر نیست، همان‌طور که خداوند آن را در کتاب خود رها کرده است در این فرموده: «و رحمت من همه چیز را فرا گرفته است» (وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ). پس هیچ چیز نیست مگر آنکه طمع در رحمت خدا دارد. پس برخی از آن‌ها به حکم وجوب به آن می‌رسند و برخی به حکم منت. روزی در اشبیلیه نزد شیخ ما در طریقت، ابوالعباس عرینی از اهل علیا در مغرب اندلس نشسته بودم. مردی بر او وارد شد و سخن از نیکی و صدقه به میان آمد. مرد گفت: خداوند می‌فرماید: «نزدیکان به نیکی سزاوارترند» (الْأَقْرَبُونَ أَوْلَى بِالْمَعْرُوفِ). شیخ فوراً گفت: «به سوی خدا». و این چه خنکایی بر جگر بود! و امر در نفس خود نیز چنین است. و هیچ کس نزدیک‌تر از خدا نیست. پس اوست قریب سبحانه که جز به دوری تنزیه (تنزیه) دور نمی‌شود. و ارحام با مرگ قطع می‌شوند، اما رحم منسوب به حق (الحق) قطع نمی‌شود، زیرا او با ماست هر کجا که باشیم. و ما بین خود در زمانی وصل می‌شویم و در زمانی به واسطه مرگ یا فقدان و کوچ، قطع می‌شویم. و چه بسا حالی که از سؤال بی‌نیاز کرده است. و کسی که خود را نشناسد، به غیر خود جاهل‌تر است، و کسی که غیر خود را بشناسد، به خود داناتر است.\n\n«هر کس خود را شناخت، پروردگارش را شناخت» (من عرف نفسه عرف ربه).\n\nآن کس که از غیر خود خبر می‌دهد *** مانند کسی نیست که از خود خبر می‌دهد.\nزیرا او از مافوق خود خبر می‌دهد *** در غیب خود بود و در حس خود.\nو هر کس که از خود خبر دهد *** همانا از جنس خود خبر داده است.\nو حق (الحق) اگر او را مقید کنی، همانا *** محبوس را در حبسش محجوب نمی‌کند.\nکسی که حق (الحق) را با اطلاقش مقید کند *** مرده را از قبرش برنخیزانده است.\nهیهات! اسرار او را نمی‌شناسد *** مگر کسی که به سوی قدس او حج کرده باشد.\nکسی که حق (الحق) او را اساس نهاده باشد، او همان کسی است *** که زننده او را از اساسش برمی‌اندازد.\n\n### [راز فرستادن خداوند متعال موسی و هارون به سوی فرعون]\n\nرازی الهی است که بسیاری از مردم آن را نمی‌دانند. خداوند متعال موسی و هارون را به سوی فرعون فرستاد و به آن دو سفارش کرد که «به او سخنی نرم (قَوْلًا لَيِّنًا) بگویند، شاید پند گیرد یا بترسد» (لَعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشَى). و ترجی (امیدواری) از جانب خدا نزد همه علما واقع می‌شود، چنانکه فرمود: «شاید خداوند توبه آنان را بپذیرد» (عَسَى اللَّهُ أَنْ يَتُوبَ عَلَيْهِمْ). و علما گفته‌اند: «عسی» (شاید) از جانب خدا واجب است، و «لعل» و «عسی» خواهر یکدیگرند. پس خداوند می‌دانست که او پند می‌گیرد، و تذکر جز از علم سابق فراموش شده حاصل نمی‌شود. سپس هنگامی که ترس آن دو را دید که مبادا به آنچه دعوتشان می‌کنند پاسخ ندهد، به آن دو فرمود: «نترسید، همانا من با شما هستم، می‌شنوم و می‌بینم» (لَا تَخَافَا إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَى). یعنی می‌شنوم از فرعون هنگامی که رسالت پروردگارتان را به او می‌رسانید، و می‌بینم آنچه را که شما در حق او انجام می‌دهید، از نرمی و فروتنی در خطاب که به شما سفارش کردم. پس فرعون کسی را نیافت که بر او تکبر کند، زیرا تکبر متکبر تنها بر کسی واقع می‌شود که با صفت کبریا برای او ظاهر شود. پس هنگامی که نرمی در خطاب را نزد آن دو دید، دلش برایشان نرم شد و رحمت الهی با عنایت ربانی در باطن او جاری شد، پس دانست که آنچه آن دو به آن فرستاده شده‌اند، حق (الحق) است. پس متکلم از موسی و هارون، حق (الحق) بود، و گوشی که کلام موسی را از فرعون دریافت کرد، حق (الحق) بود. پس پذیرش در نفس او حاصل شد و آن را از قومش پنهان کرد. زیرا این شأن حق (الحق) است. آیا نمی‌بینی که او تعالی در قیامت در صورتی تجلی (التجلی) می‌کند که در آن انکار می‌شود؟ این از پنهان‌کاری اوست. و چون فرعون دانست که حق (الحق) گوش و چشم و زبان و همه قوای خلق اوست، به همین دلیل با زبان حق (الحق) گفت: «من پروردگار برتر شما هستم» (أَنَا رَبُّكُمُ الْأَعْلَى). زیرا می‌دانست که خداست که بر زبان بنده خود گفت: «من پروردگار برتر شما هستم». پس خداوند تعالی خبر داد که او را به «عذاب آخرت و دنیا» (نَكَالَ الْآخِرَةِ وَالْأُولَى) گرفتار کرد. و «نَکَل» همان قید است. پس خداوند او را در دنیا به بندگی‌اش با پروردگارش مقید کرد، به علمش که بنده خداست، و در آخرت هنگامی که خداوند او را برمی‌انگیزد، او را بر همان ایمانی که بر آن مرده است، از نظر علم و قول، برمی‌انگیزد. و پس از شهادت خدا، شهادتی نیست. و او شهادت داده است که او را در دنیا و آخرت مقید کرده است. «همانا در آن» (إِنَّ فِي ذَلِكَ) یعنی در این گرفتار کردن، «عبرتی» (لَعِبْرَةً) است، یعنی شگفتی و گذر از آنچه از آن به فهم عموم می‌رسد، به آنچه در آن است و خواص بندگان خدا که همان علما هستند، آن را می‌فهمند. و به همین دلیل فرمود: «عبرتی است برای کسی که می‌ترسد» (لَعِبْرَةً لِمَنْ يَخْشَى). و ما دانستیم که «همانا از میان بندگان خدا، تنها دانایان (الْعُلَمَاءُ) از او می‌ترسند» (إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ). و فرمود: «شاید پند گیرد یا بترسد» (لَعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشَى). و نمی‌ترسد مگر آنکه با تذکر، آنچه را از علم به خدا فراموش کرده بود، بداند. و کسی که حق (الحق) او را مقید کند، رهایی و آزادی از آن قید برایش ممکن نیست. و این فرموده آن دو که «ما می‌ترسیم که بر ما پیشی گیرد» (إِنَّنَا نَخَافُ أَنْ يَفْرُطَ عَلَيْنَا)، یعنی با حجتی که به توحید باز می‌گردد، بر ما پیشی گیرد، «یا طغیان کند» (أَوْ أَنْ يَطْغَى)، یعنی کلامش بالا رود، به دلیل اینکه قصد عین حقیقت (الحقیقة) را دارد، پس با او به زحمت بیفتیم. به همین دلیل به آن دو فرمود: «نترسید، همانا من با شما هستم، می‌شنوم و می‌بینم» (لَا تَخَافَا إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَى). و به آن دو سفارش کرد که با او نرم سخن بگویند. پس هنگامی که آن دو به او (صَلَّى اللهُ عَليهِ وسَلَّم) آنچه را که خداوند به آن دو عهد کرده بود، گفتند، فرعون به آن دو گفت: «پروردگار شما کیست ای موسی؟» (فَمَنْ رَبُّكُمَا يَا مُوسَى)، همان‌طور که دو فرشته قبر به مرده می‌گویند، نه به دلیل جهلشان به آنچه می‌گوید، بلکه می‌خواهند حاضران به آنچه آن دو می‌گویند و دلیلی بر وجود خداست، توجه کنند تا صدق آن دو را بدانند. زیرا عاقل می‌داند که اگر آن دو چنین بگویند، شاید خواطر بیدار شوند و سخن آن دو، آن‌ها را به نظر در آن دعوت کند، زیرا آن دو در سخن خود مواضع دلالت بر خدا را نصب کردند. زیرا او از خصم خود سؤال نمی‌کند. پس سؤال او دلالت می‌کند بر اینکه او هدایت کسانی از قومش را می‌خواهد که آنچه را او آورده است، می‌فهمند. پس گفتند: «پروردگار ما کسی است که به هر چیزی آفرینش (خلق) آن را عطا کرد، سپس هدایت نمود» (رَبُّنَا الَّذِي أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ ثُمَّ هَدَى). پس در این خطاب با فرعون انصاف ورزیدند، و این از سخن نرم است. زیرا هر آنچه فرعون ادعا می‌کرد، تحت این فرموده آن دو داخل شد که خداوند آفرینش (خلق) آن را به او عطا کرد. پس در کلام آن دو، پاسخ فرعون به آن دو بود. سپس فرعون در سؤال افزود تا آن دو در دلالت بیفزایند. گفت: «پس حال قرون اولیه چیست؟» (فَمَا بَالُ الْقُرُونِ الْأُولَى). گفتند: «علم آن نزد پروردگار من در کتابی است که پروردگارم نه گمراه می‌شود و نه فراموش می‌کند» (عِلْمُهَا عِنْدَ رَبِّي فِي كِتَابٍ لَا يَضِلُّ رَبِّي وَلَا يَنْسَى)، مانند آنچه تو فراموش کردی تا ما تو را یادآوری کردیم و متذکر شدی. پس اگر تو خدا بودی، فراموش نمی‌کردی، زیرا خداوند فرمود: «شاید پند گیرد» (لَعَلَّهُ يَتَذَكَّرُ). سپس با آنچه پس از آن تا پایان آیه گفتند، بر دلالت افزودند. پس این امر در نفس فرعون پنهان ماند و حب ریاست به او اجازه نداد که خود را نزد قومش در آنچه آن‌ها را به آن سبک شمرده بود، تکذیب کند، تا اینکه از او اطاعت کردند و «قومی فاسق بودند» (كَانُوا قَوْمًا فَاسِقِينَ). پس او در ضمیر اینکه آن‌ها فاسق بودند، با آن‌ها شریک نشد. پس هنگامی که سختی را دید، «گفت: ایمان آوردم» (قَالَ آمَنْتُ). پس اعتقاد خود را که همواره با او بود، به زبان آورد. پس خداوند تعالی با فرموده خود «آیا اکنون؟» (آلْآنَ) ثابت کرد که او از روی علم محقق ایمان آورده است، و خدا داناتر است، اگرچه امر در آن احتمال دارد. و کلمه از جانب خدا محقق شد و سنت او در بندگانش جاری گشت که ایمان در آن زمان، عذابی را که در آن وقت بر آن‌ها نازل شده است، از مؤمن دفع نمی‌کند، «مگر قوم یونس» (إِلَّا قَوْمَ يُونُسَ). همان‌طور که توبه سارق نزد حاکم، حد قطع را از او برنمی‌دارد، و نه زانی با توبه‌اش نزد حاکم، با علم ما به اینکه توبه او نزد خدا پذیرفته شده است. و حدیث ماعز در این باره صحیح است که او توبه‌ای کرد که اگر بر اهل شهری تقسیم می‌شد، کفایتشان می‌کرد، با این حال حد از او دفع نشد، بلکه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) به سنگسار او امر فرمود.\n\nهمچنین هر کس که هنگام دیدن سختی از سوی کفار به خدا ایمان آورد، ایمان، نزول سختی بر آن‌ها را دفع نمی‌کند، با وجود پذیرش ایمانشان در سرای آخرت، پس آن‌ها را ملاقات می‌کنند و گناهی ندارند، زیرا شاید اگر پس از آن زنده می‌ماندند، گناهانی کسب می‌کردند.\n\nای خلقی که سامان داده شده‌ای *** چقدر ندا می‌دهی، چقدر می‌پیچی؟\nپس پیشی بگیر قبل از روزی *** که در آن آرزو کند که کاش برابر می‌شد.\nمردانی که زمین آن‌ها را در خود فرو می‌برد *** مانند خاشاکی که سزاوارتر بود.\nرحمان (الرحمن) خلقی را آفرید *** همان‌طور که گفت، پس سامان داد.\nسپس به او اقتدار بخشید *** پس حمله کرد و قوی‌تر بود.\nبه هر چیزی که نبود گفت «باش» (کن) *** و آن بلا بود.\n\nو چون حق (الحق) درباره خود می‌فرماید که «آفرید و سامان داد» (خَلَقَ فَسَوَّى) و «اندازه نهاد و هدایت کرد» (قَدَّرَ فَهَدَى)، پس تو را چه شده که «نام پروردگار برترت را تسبیح نمی‌گویی؟» (سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى). خداوند ما را از کسانی قرار دهد که حق (الحق) آن‌ها را به خود مقید کرده و توفیق ایستادن بر حدود و رسوم او را در آخرت و دنیا روزی‌شان کرده است. پس ای برادر من، بنگر که عنایت این معیت (المعية) الهی در این فرموده: «و او با شماست هر کجا که باشید» (وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ)، چه چیزی عطا کرده است. پس او با هویت (هويته) خود با ماست و با اسمای خود با ماست. آیا چشم عارف، کونی از اکوان و عینی از اعیان را می‌بیند که حق (الحق) با او نباشد؟ پس خداوند همه را به واسطه یک نفر می‌آمرزد، پس چگونه یک نفر را به واسطه همه نمی‌آمرزد؟ هیچ انسانی نیست مگر آنکه همه اجزای او به حمد خدا تسبیح می‌گویند، و هیچ قوه‌ای از قوای او نیست مگر آنکه به ثنای خدا گویاست، حتی نفس ناطقه مکلف، از حیث خلقت و عینش، مانند سایر جسدش که ملک اوست، نیز تسبیح‌گوی خداست. آیا می‌بینی که خداوند اطاعت این مجموعه را در برابر معصیت آن یک نفر نمی‌پذیرد؟ هیهات! و کرم جز در اینجا کجاست؟ «ای انسان، چه چیز تو را به پروردگار کریمت مغرور کرده است؟» (يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ). پس می‌گوید: کرم تو. این تنبیهی است از جانب خدا به بنده خود که بگوید: کرم تو، همان‌طور که حاکم مؤمن عالم انجام می‌دهد، هنگامی که به سارق و زانی می‌گوید: بگو دزدی نکردم یا بگو زنا نکردم یا بگو نه، زیرا می‌داند که اگر اعتراف کند، بر او حد جاری می‌کند. پس شاید زانی در برابر حاکم مبهوت شود، پس او را تنبیه می‌کند تا با این گفتار «نه» بگوید، و بدین وسیله حد از او دفع شود. و خداوند «حق (الحق) را می‌گوید و او راه را هدایت می‌کند» (يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 5
}