{
  "id": 105,
  "title": {
    "ar": "الباب الخامس ومائة في ترك الحزن",
    "en": "Chapter One Hundred and Five: On Abandoning Sorrow",
    "ur": "باب ایک سو پانچ: غم کو ترک کرنے کے بیان میں",
    "fa": "باب صد و پنجم در ترک اندوه (حزن)"
  },
  "content": {
    "ar": "## (الباب الخامس ومائة في ترك الحزن)\n\n\n> الحق أعطى كل شي‏ء *** خلقه ثم هدى‏\n\n\n> فما ترى من فائت *** قد فات فالحزن سدى‏\n\n\n> الحزن حكم واقع *** لفائت وما عدا\n\n\n> هذا فلا تحفل به *** فإنه حكم البدا\n\n\n### [لا يخرج عن مقام الحزن إلا من أقيم في مقام سلب الأوصاف‏]\n\n\nهو حال وليس بمقام وهو مؤد إلى خراب القلوب وفي طيه مكر إلهي إلا للعارف فإنه لا يخرج عن مقام الحزن إلا من أقيم في مقام سلب الأوصاف عنه قيل لأبي يزيد كيف أصبحت قال لا صباح لي ولا مساء إنما هي لمن تقيد بالصفة وأنا لا صفة لي وذلك لما سأله بكيف وهي للحال وهو من أمهات المطالب الأربعة وله من النسب الإلهية سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ على قراءة الكسائي وكُلَّ يَوْمٍ هُوَ في شَأْنٍ ويخفض القسط ويرفعه فهذا مقام الكيف في الإلهيات‏\n\n\n### [الصباح والمساء لله وهو تعالى المقيد بالصفة]\n\n\nوأما أبو يزيد فما قصد التمدح بهذا القول وإنما قصد التعريف بحاله فإن الصباح والمساء لله لا له وهو المقيد تعالى بالصفة والعبد العنصري مقيد بالصباح والمساء غير مقيد بالصفة ولهذا نفى الصفة فقال لا صفة لي لهم رزقهم فيها بكرة وعشيا فالصباح والمساء يملكه ولا ملك لأبي يزيد عليهما لأنهما بالصفة يملكان وأبو يزيد لا صفة له فمن لا علم له بالمقام يتخيل أن أبا يزيد تأله في هذا القول ولم يقصد ذلك رضي الله عنه بل هو أجل من أن يعزي إليه مثل هذا التأويل في قوله هذا فإن قال من يتأول عليه خلاف ما قلناه من أنه تأله في قوله بقوله ضحكت زمانا وبكيت زمانا وأنا اليوم لا أضحك ولا أبكي فاعلم أنه ثم تجلى يضحك وما رأيت أحدا في هذا الطريق من أهل الضحك إلا واحدا يقال له علي السلاوي سحت معه وصحبته سفرا وحضرا بالأندلس لا يفتر عن الضحك شبه الموله وما رأيته جرى عليه قط لسان ذنب وأما البكاءون فما رأيت منهم إلا واحدا يوسف المغاور الجلاء سنة ست وثمانين وخمسمائة بإشبيلية وكان يلازمنا ويعرض أحواله علينا كثير الجزع لا تفتر له دمعة صحبته في الزمان الذي صحبت الضحاك‏\n\n\n### [انتقال أبى يزيد عن مقامى الضحك والبكاء]\n\n\nوأما كون أبي يزيد انتقل عن هذين المقامين إلى المقام الذي بينهما فإنهما من الأمور المتقابلة التي ما يكون بينهما واسطة كالنفي والإثبات لا كالوجود والعدم والحار والبارد فإن بينهما واسطة تأخذ من كل طرف بنسبة تميزه عن الطرفين وكذلك إذا لم يكن الشخص في موجب ضحك ولا موجب بكاء كحالة البهت لأهل الله فهو لا ضاحك ولا باك فوصفه البهت والتعري عن الموجبين فأراد التعريف ما أراد التمدح‏\n\n",
    "en": "## (Chapter 105: On Abandoning Sorrow)\n\nThe Real gave everything its creation, then guided it.\nSo whatever you see of what is lost, has passed, and sorrow is in vain.\nSorrow is a judgment that occurs for what is lost and what is past.\nTherefore, do not concern yourself with this, for it is the ruling of the beginning.\n\n### [None departs from the station of Sorrow except one who is established in the station of the Stripping of Attributes]\n\nIt [Sorrow] is a state (حال) and not a station (مقام), and it leads to the ruin of hearts, containing within it a Divine subtle device (مكر إلهي), except for the Gnostic (العارف). For none departs from the station of Sorrow (مقام الحزن) except one who is established in the station of the Stripping of Attributes (مقام سلب الأوصاف) from him.\n\nIt was said to Abu Yazid [al-Bistami], \"How have you woken?\" He replied, \"I have neither morning nor evening. They belong only to one who is bound by an attribute (الصفة), and I have no attribute.\" This was because the questioner asked him using \"how\" (كيف), which pertains to the state (الحال), and the state is one of the four fundamental demands [of the seeker]. Related to this are the Divine relations: <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ>> (We shall attend to you, O you two heavy burdens [jinn and mankind]) according to the reading of Al-Kisa'i, and <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>> (Every day He is engaged in [some] affair), and [He] lowers and raises the balance (القسط). This, then, is the station of \"how\" (الكيف) in Divine matters (الإلهيات).\n\n### [Morning and Evening belong to Allah, and He, the Exalted, is Bound by the Attribute]\n\nAs for Abu Yazid, he did not intend self-praise by this statement, but rather intended to define his state. For morning and evening belong to Allah, not to him, and He, the Exalted, is bound by the Attribute (الصفة), whereas the elemental servant (العبد العنصري) is bound by morning and evening, but not bound by the Attribute. For this reason, he negated the attribute, saying, \"I have no attribute.\" [Referring to the dwellers of Paradise:] <<لَهُمْ رِزْقُهُمْ فِيهَا بُكْرَةً وَعَشِيًّا>> (They will have their provision therein, morning and evening). Thus, morning and evening are owned by Him, and Abu Yazid has no ownership over them, because they are owned through the Attribute, and Abu Yazid has no attribute.\n\nTherefore, whoever lacks knowledge of the station (المقام) imagines that Abu Yazid claimed divinity (تأله) in this statement, but he did not intend that, may Allah be pleased with him. Rather, he is too sublime for such an interpretation to be attributed to this saying of his.\n\nIf someone who interprets his words contrary to what we have stated—that he claimed divinity in his saying—cites his statement: \"I laughed for a time, and I wept for a time, and today I neither laugh nor weep,\" then know that there is a Theophany (تجلى) that laughs. I have not seen anyone on this Path (الطريق) among the people of laughter except one man called Ali al-Salawi. I traveled with him and accompanied him on journeys and in residence in Al-Andalus. He never ceased laughing, like one utterly devoted (الموله). I never saw the tongue of sin run over him at all.\n\nAs for the people of weeping (البكاءون), I have not seen among them except one man, Yusuf al-Maghawir al-Jalla', in the year 586 AH in Seville. He used to stay with us and present his states (أحواله) to us. He was extremely anxious (كثير الجزع), and his tears never ceased. I accompanied him during the same time I accompanied the laugher.\n\n### [Abu Yazid’s Transition from the Stations of Laughter and Weeping]\n\nAs for Abu Yazid’s transition from these two stations (المقامين) to the station between them, [this is possible] because they are among the contrasting matters (الأمور المتقابلة) that do not have an intermediary (واسطة), such as negation and affirmation, unlike Existence (الوجود) and Non-existence (العدم), or hot and cold, for these have an intermediary that takes a proportion from each extreme, distinguishing it from both extremes.\n\nSimilarly, when the person is neither in a cause for laughter nor a cause for weeping, such as the state of stupefaction (البهت) experienced by the People of Allah (أهل الله), then he is neither laughing nor weeping. His attribute, therefore, is stupefaction and the stripping away (التعري) of the two causes. Thus, he intended definition, not self-praise.",
    "ur": "(باب ایک سو پانچ: غم کو ترک کرنے کے بیان میں)\n\nذات حق نے ہر چیز کو اس کی خلقت عطا کی، پھر ہدایت دی\nپس جو چیز تم دیکھتے ہو کہ فوت ہو گئی، تو غم بے کار ہے\nغم ایک ایسا حکم ہے جو فوت شدہ چیز پر واقع ہوتا ہے\nاس کے علاوہ کسی چیز کی پرواہ نہ کرو، کیونکہ یہ ابتدائی حکم ہے\n\n### [مقام حزن سے صرف وہی نکلتا ہے جسے سلب اوصاف کے مقام پر فائز کیا گیا ہو]\n\nغم ایک حال ہے، مقام نہیں، اور یہ دلوں کی تباہی کا باعث بنتا ہے، اور اس میں ایک الٰہی مکر پوشیدہ ہے، سوائے عارف (العارف) کے۔ کیونکہ مقام حزن سے صرف وہی نکلتا ہے جسے سلب اوصاف (سلب الأوصاف) کے مقام پر فائز کیا گیا ہو۔ ابو یزید (بسطامی) سے پوچھا گیا: \"آپ نے صبح کیسے کی؟\" انہوں نے فرمایا: \"نہ میری کوئی صبح ہے اور نہ کوئی شام۔ یہ تو اس کے لیے ہے جو صفت سے مقید ہو، اور میری کوئی صفت نہیں۔\" یہ اس لیے کہ پوچھنے والے نے \"کیسے\" (کیف) کے ذریعے سوال کیا، جو حال کے لیے استعمال ہوتا ہے۔ اور یہ چار بنیادی مطالبات میں سے ایک ہے۔ اس کا الٰہی نسبتوں سے تعلق ہے، جیسا کہ کسائی کی قراءت کے مطابق:\n**سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ** (عنقریب ہم تمہاری طرف متوجہ ہوں گے، اے دونوں بوجھ والو!) [الرحمن: 31]\nاور:\n**كُلَّ يَوْمٍ هُوَ في شَأْنٍ** (وہ ہر دن ایک نئی شان میں ہوتا ہے) [الرحمن: 29]\nاور وہ (اللہ) انصاف کو کم کرتا ہے اور اسے بلند کرتا ہے۔ پس یہ الٰہیات میں \"کیف\" (کیسے) کا مقام ہے۔\n\n### [صبح اور شام اللہ کے لیے ہیں اور وہ (اللہ) ہی صفت سے مقید ہے]\n\nجہاں تک ابو یزید کا تعلق ہے، انہوں نے اس قول سے اپنی تعریف کا ارادہ نہیں کیا، بلکہ اپنے حال کی تعریف کا ارادہ کیا۔ کیونکہ صبح اور شام اللہ کے لیے ہیں، ان کے لیے نہیں۔ اور وہ (اللہ) ہی صفت سے مقید ہے، جبکہ عنصری بندہ صبح و شام سے مقید ہے، صفت سے مقید نہیں۔ اسی لیے انہوں نے صفت کی نفی کی اور کہا: \"میری کوئی صفت نہیں۔\"\n**لَهُمْ رِزْقُهُمْ فِيهَا بُكْرَةً وَعَشِيًّا** (ان کے لیے اس میں صبح و شام ان کا رزق ہے) [مریم: 62]\nپس صبح اور شام کا مالک وہ (اللہ) ہے، اور ابو یزید کو ان پر کوئی ملکیت حاصل نہیں، کیونکہ وہ دونوں صفت کے ذریعے ملکیت رکھتے ہیں، اور ابو یزید کی کوئی صفت نہیں۔\nپس جسے مقام (مقام) کا علم نہیں، وہ یہ گمان کرتا ہے کہ ابو یزید نے اس قول میں الوہیت کا دعویٰ کیا، حالانکہ انہوں نے ایسا ارادہ نہیں کیا تھا، اللہ ان سے راضی ہو۔ بلکہ وہ اس سے کہیں زیادہ بلند ہیں کہ ان کے اس قول کی ایسی تاویل کی جائے (کہ انہوں نے الوہیت کا دعویٰ کیا)۔\nاگر کوئی شخص ان پر اس کے برعکس تاویل کرے جو ہم نے بیان کی ہے، یہ کہہ کر کہ انہوں نے اپنے اس قول میں الوہیت کا دعویٰ کیا ہے کہ: \"میں ایک زمانے تک ہنسا اور ایک زمانے تک رویا، اور آج میں نہ ہنستا ہوں اور نہ روتا ہوں،\" تو جان لو کہ وہاں ایک ظہور الٰہی (التجلی) ہے جو ہنستا ہے۔\nمیں نے اس طریق (تصوف) میں اہل ضحک (ہنسنے والوں) میں سے صرف ایک شخص کو دیکھا ہے جسے علی السلاوی کہا جاتا تھا۔ میں نے اس کے ساتھ سفر اور حضر میں اندلس میں صحبت رکھی۔ وہ دیوانے کی طرح ہنسنے سے کبھی نہیں تھکتا تھا۔ میں نے کبھی نہیں دیکھا کہ اس کی زبان سے کوئی گناہ سرزد ہوا ہو۔\nاور جہاں تک بکاؤون (رونے والوں) کا تعلق ہے، تو میں نے ان میں سے صرف ایک کو دیکھا، یوسف المغاور الجلاء، ۵۸۶ھ میں اشبیلیہ میں۔ وہ ہمارے ساتھ لازم رہتا تھا اور اپنے احوال ہم پر پیش کرتا تھا۔ وہ بہت زیادہ جزع کرنے والا تھا، اس کا آنسو کبھی نہیں رکتا تھا۔ میں نے اس کی صحبت اسی زمانے میں رکھی جب میں نے ضحاک (علی السلاوی) کی صحبت رکھی تھی۔\n\n### [ابو یزید کا ہنسنے اور رونے کے مقامات سے انتقال]\n\nاور جہاں تک ابو یزید کا ان دونوں مقامات سے ان کے درمیانی مقام کی طرف منتقل ہونے کا تعلق ہے، تو یہ دونوں (ہنسنا اور رونا) ان متقابل امور میں سے ہیں جن کے درمیان کوئی واسطہ نہیں ہوتا، جیسے نفی اور اثبات۔ یہ وجود (الوجود) اور عدم، یا گرم اور سرد کی طرح نہیں ہیں، کیونکہ ان کے درمیان ایک واسطہ ہوتا ہے جو ہر طرف سے ایک نسبت کے ساتھ حصہ لیتا ہے جو اسے دونوں اطراف سے ممتاز کرتا ہے۔ اسی طرح، جب کوئی شخص نہ ہنسنے کے موجب میں ہو اور نہ رونے کے موجب میں، جیسے اہل اللہ کی حالتِ بہوت (حیرت)، تو وہ نہ ہنسنے والا ہوتا ہے اور نہ رونے والا۔ پس اس کی صفت بہوت (حیرت) اور دونوں موجبوں سے عاری ہونا ہے۔ لہٰذا انہوں نے تعریف کا ارادہ کیا، اپنی تعریف کا نہیں۔",
    "fa": "باب صد و پنجم در ترک اندوه\n\nحق (الحق) هر چیزی را آفرینش (خلق) آن داد، سپس هدایت کرد.\nپس آنچه را که از دست رفته می‌بینی، اندوه بر آن بیهوده است.\nاندوه حکمی است که بر امر از دست رفته واقع می‌شود، و نه بر آنچه غیر از آن است.\nپس به این (اندوه) توجه مکن، زیرا آن حکم آغاز (حکم البدا) است.\n\n### [از مقام اندوه خارج نمی‌شود مگر کسی که در مقام سلب اوصاف مستقر شده باشد]\n\nآن (اندوه) یک حال است نه یک مقام (مقام)، و به ویرانی دل‌ها می‌انجامد و در درون خود مکر الهی دارد، مگر برای عارف (العارف). زیرا از مقام اندوه خارج نمی‌شود مگر کسی که در مقام سلب اوصاف (سلب الأوصاف) از او مستقر شده باشد. به ابویزید گفته شد: چگونه صبح کردی؟ گفت: مرا نه صباحی است و نه مسائی. این‌ها تنها برای کسی است که مقید به صفت باشد، و من صفتی ندارم. و این بدان سبب بود که از او با «چگونه» پرسیدند، و «چگونه» برای حال است، و حال یکی از امهات مطالب چهارگانه است. و از نسبت‌های الهی برای آن (حال) این آیه است: سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ (به زودی به حساب شما می‌پردازیم، ای جن و انس) بر اساس قرائت کسائی، و آیه: كُلَّ يَوْمٍ هُوَ في شَأْنٍ (هر روز او در کاری است). و قسط را پایین می‌آورد و بالا می‌برد. پس این مقام «چگونگی» (الکیف) در الهیات است.\n\n### [صباح و مساء از آنِ خداست و اوست که مقید به صفت است]\n\nاما ابویزید قصد تفاخر با این سخن نداشت، بلکه قصد معرفی حال خود را داشت. زیرا صباح و مساء از آنِ خداست نه از آنِ او، و اوست (خداوند) که مقید به صفت است. و بنده عنصری مقید به صباح و مساء است، اما مقید به صفت نیست. به همین دلیل صفت را نفی کرد و گفت: «من صفتی ندارم.» (اشاره به آیه قرآنی): لَهُمْ رِزْقُهُمْ فِيهَا بُكْرَةً وَعَشِيًّا (روزی‌شان در آنجا صبح و شام برایشان مهیاست). پس صباح و مساء مالک آن (رزق) است، و ابویزید مالکیتی بر آن دو ندارد، زیرا آن دو (صباح و مساء) به واسطه صفت مالک می‌شوند و ابویزید صفتی ندارد. پس کسی که به مقام (المقام) آگاهی ندارد، گمان می‌کند که ابویزید در این سخن ادعای الوهیت کرده است، در حالی که او چنین قصدی نداشت، رضی الله عنه. بلکه او والاتر از آن است که چنین تأویلی در مورد این سخنش به او نسبت داده شود. اگر کسی که بر او تأویل می‌کند، خلاف آنچه ما گفتیم بگوید که او با این سخن خود ادعای الوهیت کرده است، با استناد به قولش: «زمانی خندیدم و زمانی گریستم، و امروز نه می‌خندم و نه می‌گریم.» پس بدان که در آنجا تجلی‌ای (التجلی) است که می‌خندد. و من در این طریق، از اهل خنده جز یک نفر ندیدم که به او علی سلاوی می‌گفتند. با او سفر کردم و در سفر و حضر در اندلس مصاحبت داشتم. او شبیه شیفتگان (الموله) بود و از خنده باز نمی‌ایستاد، و هرگز ندیدم که زبان گناهی بر او جاری شود. و اما گریه‌کنندگان، از آنان جز یک نفر ندیدم: یوسف مغاور الجلاء، در سال پانصد و هشتاد و شش در اشبیلیه. او ملازم ما بود و احوال خود را بر ما عرضه می‌کرد. بسیار بی‌تاب بود و اشک او قطع نمی‌شد. در همان زمانی که با آن خندان مصاحبت داشتم، با او نیز مصاحبت کردم.\n\n### [انتقال ابویزید از دو مقام خنده و گریه]\n\nو اما اینکه ابویزید از این دو مقام به مقامی که میان آن دو است منتقل شد، این بدان سبب است که آن دو (خنده و گریه) از امور متقابلی هستند که واسطه‌ای میانشان نیست، مانند نفی و اثبات؛ نه مانند وجود و عدم یا گرم و سرد، زیرا میان این‌ها واسطه‌ای هست که از هر دو طرف به نسبتی می‌گیرد که آن را از دو طرف متمایز می‌سازد. و همچنین است زمانی که شخص نه در موجِب خنده باشد و نه در موجِب گریه، مانند حالت بهت (البهت) برای اهل الله. پس او نه خندان است و نه گریان. وصف او بهت و عاری بودن از هر دو موجِب است. پس او قصد معرفی (حال خود) را داشت، نه قصد تفاخر."
  },
  "page_count": 1
}