{
  "id": 461,
  "title": {
    "ar": "الباب الأحد والستون وأربعمائة في معرفة منازلة من أسدلت عليه حجاب كنفي فهو من ضنائني لا يعرف ولا يعرف",
    "en": "Chapter Four Hundred and Sixty-One: Concerning the Gnosis of the spiritual station (منازلة) of him upon whom the veil of My Negation (كنفي) has been lowered; for he is one of My hidden treasures (ضنائني), neither known nor knowing.",
    "ur": "باب چار سو اکسٹھ (۴۶۱): اس شخص کے مقام کی معرفت میں جس پر میرے امر 'کن' کا پردہ ڈال دیا گیا ہے، پس وہ میرے پوشیدہ خزانوں میں سے ہے؛ نہ وہ پہچانا جاتا ہے اور نہ وہ پہچانتا ہے۔",
    "fa": "باب چهارصد و شصت و یکم: در معرفت منزلت کسی که حجاب کنف الهی بر او افکنده شده است؛ پس او از ضنائن (گنجینه‌های پنهان) من است، نه شناخته می‌شود و نه شناخته شده است."
  },
  "content": {
    "ar": "## «الباب الأحد والستون وأربعمائة في معرفة منازلة من أسدلت عليه حجاب كنفي فهو من ضنائني لا يعرف ولا يعرف»\n\n\n> أن الضنائن عند الله في ستر *** مخدرون فلا تدري ولا تدري‏\n\n\n> يغار منهم عليهم مثل ما حجبت *** بين الليالي صونا ليلة القدر\n\n\n> فلا يراها سوى من لا يقيده *** نعت يجرده من عالم الأمر\n\n\n> تبدو لناظره من خلف زافره *** من أول الليل حتى مطلع الفجر\n\n\n### [العارفون هم المجهولون في العالم‏]\n\n\nقال الله تعالى حُورٌ مَقْصُوراتٌ في الْخِيامِ وهم العارفون إشارة لا تفسيرا المجهولون في العالم فلا يظهر منهم ولا عليهم ما يعرفون به وهم لا يشهدون في الكون إلا الله لا يعرفون ما العالم لأنهم لا يشهدونه عالما\n\n\n> فالحق سار ولكن ليس يدريه *** إلا الذي قال فيه إنه فيه‏\n\n\nلكل مليك حرم وحرم وهؤلاء العارفون العلماء به حرمه وحرمه الذي هم فيه العوائد العامة فما سترهم إلا بما هو مشهود للعام والخاص فالعالم يشهد الحق اعتقادا وعينا ويشهد العالم حسا وهؤلاء يشهدون الحق عينا ويشهدون العالم إيمانا لكون الحق أخبرهم أن ثم عالما فيؤمنون به ولا يرونه كما أن العالم يؤمنون بالله ولا يرونه فهم شهداء حق بحق وهم في مَقْعَدِ صِدْقٍ فيما تحققوا به فإن قيل لهم فقولكم بالشاهد والمشهود فرق فيقولون عند ذلك أ ليس تشهد ذاتك بذاتك فأنت غيرك وكلامهم في هذا كله مع الحق شهودا ومع الايمان بأن ثم عالما أدبا وإيمانا ف هُمُ الْمُؤْمِنُونَ حَقًّا والعلماء صدقا وهذا بعض ما وقفنا عليه من منازلات الحق فإنها أكثر من أن يحصرها عد أو يضبطها حد والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ وها نحن بحمد الله ومعونته والهامة نشرع في الأقطاب والهجيرات التي كانوا عليها أبتغي بذلك الإعلام بأنه من عمل على ذلك وجد ما وجدوا وشهد ما شهدوا إذ بنيت كتابي هذا بل بناه الله لا أنا على إفادة الخلق فكله فتح من الله تعالى وسلكت فيه طريق الاختصار أيضا عن سؤال من العبد ربه في ذلك لأنه لا يقتضي حالنا إلا إبلاغ ما أمر الحق بإبلاغه ويَفْعَلُ الله ما يَشاءُ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى السفر التاسع والعشرون بانتهاء الباب الأحد والستين وأربعمائة من هذا الكتاب‏\n\n\nبسم الله الرحمن الرحيم «الفصل السادس في هجيرات الأقطاب ومقاماتهم المحمدية»\n\n",
    "en": "The Four Hundred and Sixty-First Chapter: Concerning the Knowledge of the Station of Those Upon Whom the Veil of My Negation Has Been Drawn, for They Are Among My Hidden Treasures (ضنائني), Neither Known Nor Knowing.\n\nIndeed, the hidden treasures (الضنائن) are in a veil with Allah,\nSecluded, so you do not know, nor do you know.\n\nHe is jealous over them, just as He veiled\nThe Night of Power (ليلة القدر) among the nights, protecting it.\n\nNone sees it save him whom no description binds,\nA description that strips him from the world of Command (عالم الأمر).\n\nIt appears to his observer from behind his sigh\nFrom the beginning of the night until the break of dawn.\n\n### [The Gnostics are the Unknown Ones in the World]\n\nAllah the Exalted said: <<Houri, confined within pavilions>> (حُورٌ مَقْصُوراتٌ في الْخِيامِ). They are the Gnostics (العارفون)—this is an allusion, not an exegesis. They are the unknown ones in the world (العالم); nothing appears from them or upon them by which they might be known. And they witness nothing in the cosmos (الكون) except Allah. They do not know what the world is, because they do not witness it as a world.\n\nThe Real (الحق) travels, but none perceives Him\nExcept the one who said concerning Him that He is in it.\n\nEvery sovereign has a sanctuary (حرم) and a sacred precinct (حرم). And these Gnostics, the knowers of Him, are His sanctuary and His sacred precinct. The general customs (العوائد العامة) are what they are in. Thus, nothing veils them except that which is witnessed by both the common people and the elite. The ordinary person witnesses the Real (الحق) through belief (اعتقادا) and sensory perception (عينا), and he witnesses the world (العالم) through the senses (حسا). But these [Gnostics] witness the Real through direct vision (عينا), and they witness the world through faith (إيمانا), because the Real informed them that there is a world. So they believe in it, but they do not see it, just as the ordinary people believe in Allah but do not see Him. Thus, they are witnesses of the Real by the Real, and they are in <<a seat of truth>> (مَقْعَدِ صِدْقٍ) concerning that which they have realized. If it is said to them, \"Does your statement regarding the witness (الشاهد) and the witnessed (المشهود) imply a distinction?\" They reply then, \"Do you not witness your own essence (ذاتك) by your own essence? Are you then other than yourself?\" All their discourse in this matter is with the Real through witnessing (شهودا), and with the belief that there is a world through propriety (أدبا) and faith (إيمانا). Thus, they are <<the believers in truth>> (هُمُ الْمُؤْمِنُونَ حَقًّا) and the knowers in sincerity. This is but a portion of the stations (منازلات) of the Real upon which we have paused, for they are too numerous to be encompassed by counting or defined by limitation. And Allah <<speaks the Truth, and He guides to the Way>> (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ).\n\nAnd now, by the praise of Allah, His assistance, and His inspiration (الهامة), we shall commence with the Poles (الأقطاب) and the migrations (الهجيرات) upon which they were. I seek thereby to inform that whoever acts upon that path will find what they found and witness what they witnessed, since I built this book—or rather, Allah built it, not I—upon the benefit of creation (الخلق). For all of it is an unveiling (فتح) from Allah the Exalted. I have also followed the path of brevity therein, based on the servant's request to his Lord concerning this matter, because our state necessitates nothing other than conveying what the Real commanded to be conveyed. <<And Allah does what He wills>> (وَيَفْعَلُ اللَّهُ مَا يَشَاءُ). <<And Allah speaks the Truth, and He guides to the Way>> (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ).\n\nThe Twenty-Ninth Journey (Safar) concludes with the completion of the Four Hundred and Sixty-First Chapter of this Book.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.\n\nThe Sixth Section: Concerning the Migrations (هجيرات) of the Poles (الأقطاب) and their Muhammadan Stations (مقاماتهم المحمدية).",
    "ur": "باب نمبر چار سو اکسٹھ: اس شخص کے مقام کی معرفت میں جس پر میرے (اللہ کے) کنفی (کن فیکون) کے حجاب ڈال دیے گئے ہیں، پس وہ میرے خاص رازوں میں سے ہے، نہ وہ جانتا ہے اور نہ جانا جاتا ہے۔\n\nبے شک اللہ کے نزدیک خاص راز پردے میں ہیں (ضنائن)\nوہ پردہ نشین ہیں، پس نہ تو جانتا ہے اور نہ ہی تو جانتی ہے۔\n\nان پر ان کی وجہ سے غیرت کی جاتی ہے، جیسے شبِ قدر کو\nحفاظت کے لیے راتوں کے درمیان چھپا دیا گیا ہے۔\n\nاسے (شبِ قدر کو) صرف وہی دیکھتا ہے جسے کوئی وصف قید نہیں کرتا،\nجو اسے عالمِ امر (عالم الأمر) سے آزاد کر دیتا ہے۔\n\nوہ اس کے دیکھنے والے کے لیے اس کے سانسوں کے پیچھے سے ظاہر ہوتی ہے،\nرات کے آغاز سے لے کر فجر کے طلوع ہونے تک۔\n\n### [عارفین (العارفون) دنیا میں نامعلوم لوگ ہیں]\n\nاللہ تعالیٰ نے فرمایا: \"حُورٌ مَقْصُورَاتٌ فِي الْخِيَامِ\" (خیموں میں پردہ نشین حوریں)۔ یہ عارفین (العارفون) کی طرف اشارہ ہے، نہ کہ تفسیر۔ یہ دنیا میں نامعلوم لوگ ہیں، پس ان سے یا ان پر کوئی ایسی چیز ظاہر نہیں ہوتی جس سے انہیں پہچانا جا سکے، اور وہ کائنات میں اللہ کے سوا کسی کا شہود (الشہود) نہیں کرتے۔ وہ نہیں جانتے کہ عالم کیا ہے، کیونکہ وہ اسے عالم کے طور پر نہیں دیکھتے۔\n\nپس الحق (الحق) تو جاری و ساری ہے، لیکن اسے صرف وہی نہیں جانتا\nجس نے اس کے بارے میں کہا کہ وہ اس میں ہے۔\n\nہر بادشاہ کا ایک حرم (مقدس علاقہ) اور ایک حرم (ممنوعہ علاقہ) ہوتا ہے۔ اور یہ عارفین (العارفون) جو اس (اللہ) کے عالم ہیں، اس کا حرم اور حرم ہیں، جس میں وہ عام عادات کے ساتھ رہتے ہیں۔ پس انہیں کسی چیز نے نہیں چھپایا سوائے اس کے جو عام اور خاص سب کے لیے مشہود ہے۔ عام آدمی الحق (الحق) کا شہود (الشہود) اعتقاد اور عین (آنکھ) سے کرتا ہے، اور عالم کا شہود حس سے کرتا ہے۔ اور یہ (عارفین) الحق (الحق) کا شہود عین سے کرتے ہیں، اور عالم کا شہود ایمان سے کرتے ہیں، کیونکہ الحق (الحق) نے انہیں خبر دی ہے کہ ایک عالم موجود ہے، پس وہ اس پر ایمان لاتے ہیں اور اسے دیکھتے نہیں، جیسا کہ عام لوگ اللہ پر ایمان لاتے ہیں اور اسے دیکھتے نہیں۔ پس وہ حق کے ساتھ حق کے گواہ ہیں، اور وہ \"مَقْعَدِ صِدْقٍ\" (سچائی کی جگہ) میں ہیں اس چیز میں جس کی انہوں نے تحقیق کی۔\n\nپس اگر ان سے کہا جائے کہ تمہارا قول شاہد (دیکھنے والا) اور مشہود (دیکھی جانے والی چیز) میں فرق کرتا ہے، تو وہ اس وقت کہتے ہیں: کیا تم اپنی ذات کا شہود (الشہود) اپنی ذات کے ذریعے نہیں کرتے؟ پس تم غیر ہو۔ اور ان کی یہ ساری گفتگو الحق (الحق) کے ساتھ شہوداً (شہود کی حالت میں) ہے، اور اس ایمان کے ساتھ کہ ایک عالم موجود ہے، ادب اور ایمان کے طور پر۔ پس وہ \"هُمُ الْمُؤْمِنُونَ حَقًّا\" (حقیقی مومن) ہیں اور سچے علماء ہیں۔ اور یہ ان مقاماتِ حق (منازلات الحق) میں سے کچھ ہے جن پر ہم مطلع ہوئے ہیں، کیونکہ وہ اس سے کہیں زیادہ ہیں کہ انہیں کوئی گنتی محدود کر سکے یا کوئی حد ضبط کر سکے۔ اور \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔ اور اب ہم اللہ کی حمد، اس کی مدد اور اس کے الہام سے اقطاب (الأقطاب) اور ان ہجرتوں (روحانی سفر) کے بیان میں شروع ہوتے ہیں جن پر وہ قائم تھے۔ میں اس سے یہ آگاہی چاہتا ہوں کہ جو شخص اس پر عمل کرے گا، وہ وہی پائے گا جو انہوں نے پایا، اور وہی شہود کرے گا جو انہوں نے شہود کیا۔ کیونکہ میں نے اپنی یہ کتاب مخلوق کو فائدہ پہنچانے کے لیے بنائی ہے، بلکہ اسے اللہ نے بنایا ہے، میں نے نہیں۔ پس یہ سب اللہ تعالیٰ کی طرف سے فتح (فتح) ہے۔ اور میں نے اس میں اختصار کا طریقہ بھی اختیار کیا ہے، بندے کی طرف سے اپنے رب سے اس بارے میں سوال کرنے کی وجہ سے، کیونکہ ہمارا حال صرف اس چیز کو پہنچانا چاہتا ہے جس کے پہنچانے کا الحق (الحق) نے حکم دیا ہے۔ \"وَيَفْعَلُ اللَّهُ مَا يَشَاءُ\" (اور اللہ جو چاہتا ہے کرتا ہے)۔ \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔ اس کتاب کا انتیسواں سفر باب نمبر چار سو اکسٹھ کے اختتام پر مکمل ہوا۔\n\nبسم اللہ الرحمن الرحیم۔ \"چھٹا فصل: اقطاب (الأقطاب) کی ہجرتوں اور ان کے مقاماتِ محمدیہ (المقامات المحمدیۃ) کے بیان میں\"",
    "fa": "باب چهارصد و شصت و یکم در معرفت منزلتی که حجاب «کنفی» (كنفي) بر او افکنده شده است، پس او از گنجینه‌های پنهان من است که نه شناخته می‌شود و نه می‌شناسد.\n\nهمانا گنجینه‌های پنهان نزد حق (الله) در پرده‌اند\nدر خلوت‌گاه‌اند، پس نه تو می‌دانی و نه او می‌داند\n\nبر آنان از خودشان غیرت می‌ورزد، همان‌گونه که\nبرای حفظ شب قدر، آن را میان شب‌ها پنهان داشت\n\nپس آن را نمی‌بیند مگر کسی که او را قیدی نباشد\nوصفی که او را از عالم امر (عالم الأمر) مجرد سازد\n\nاز پسِ زفیرش (نفس کشیدن) بر بیننده‌اش آشکار می‌شود\nاز آغاز شب تا طلوع فجر\n\n[عارفان، ناشناختگان در عالم هستند]\n\nخداوند متعال می‌فرماید: «حُورٌ مَقْصُورَاتٌ فِي الْخِيَامِ» (حوریانی که در خیمه‌ها مستورند). این اشاره به عارفان است، نه تفسیر آن. آنان ناشناختگان در عالم هستند، پس نه از ایشان و نه بر ایشان چیزی که با آن شناخته شوند، آشکار نمی‌شود. و آنان در هستی (الکون) جز حق (الله) را شهود نمی‌کنند؛ عالم را نمی‌شناسند، زیرا آن را به عنوان عالم شهود نمی‌کنند.\n\nپس حق (الحق) در جریان است، اما آن را درک نمی‌کند\nمگر کسی که درباره‌اش گفت: «او در آن است.»\n\nهر پادشاهی حریم و حرمتی دارد، و این عارفانِ دانای به حق، حریم و حرمت او هستند. آنچه آنان را پوشانده، همان عادات عمومی است که برای عام و خاص مشهود است. پس عالم (فرد عادی) حق را از روی اعتقاد و عین (مشاهده) شهود می‌کند و عالم را با حس شهود می‌کند. اما این عارفان، حق را عیاناً شهود می‌کنند و عالم را از روی ایمان شهود می‌کنند، زیرا حق به آنان خبر داده است که عالمی وجود دارد؛ پس به آن ایمان می‌آورند و آن را نمی‌بینند، همان‌گونه که عالمیان (مردم عادی) به حق (الله) ایمان می‌آورند و او را نمی‌بینند. پس آنان شاهدان حق به واسطه حق هستند و در «مَقْعَدِ صِدْقٍ» (جایگاه صدق) قرار دارند، در آنچه به آن تحقق یافته‌اند. اگر به آنان گفته شود که پس سخن شما درباره شاهد و مشهود (الشاهد والمشهود) تفاوتی ایجاد می‌کند، در پاسخ می‌گویند: آیا ذات خود را به واسطه ذات خود شهود نمی‌کنی؟ پس تو غیر از خودت هستی؟ و سخن آنان در این باره، تماماً با حق از طریق شهود (الشهود) است و با ایمان به وجود عالم، از روی ادب و ایمان است. پس آنان «هُمُ الْمُؤْمِنُونَ حَقًّا» (آنان مؤمنان حقیقی هستند) و دانایان راستین.\n\nو این بخشی از منازلات حق (منازلات الحق) است که ما بر آن وقوف یافتیم، زیرا این منازلات بیش از آن است که شماری آن را در بر گیرد یا حدی آن را محدود سازد. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را می‌نمایاند). و اکنون ما به یاری و الهام خداوند، به اقطاب (الأقطاب) و هجیرات (الهجيرات) که بر آن بوده‌اند، می‌پردازیم. قصد من از این کار، آگاه ساختن است که هر کس بر این اساس عمل کند، آنچه را آنان یافتند، خواهد یافت و آنچه را آنان شهود کردند، شهود خواهد کرد. زیرا من این کتابم را بنا نهادم، بلکه خداوند آن را بنا نهاد نه من، بر اساس فایده رساندن به خلق. پس تمام آن فتحی (فتح) از جانب خداوند متعال است. و در آن، راه اختصار را نیز به دلیل درخواست بنده از پروردگارش در این باره، پیمودم؛ زیرا حال ما اقتضا نمی‌کند مگر ابلاغ آنچه حق به ابلاغش امر فرموده است. و «يَفْعَلُ اللَّهُ مَا يَشَاءُ» (خداوند آنچه را بخواهد انجام می‌دهد) و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند). سفر بیست و نهم با پایان یافتن باب چهارصد و شصت و یکم از این کتاب به اتمام رسید.\n\nبه نام خداوند بخشنده مهربان. «فصل ششم در هجیرات اقطاب (الأقطاب) و مقامات محمدیه (المقامات المحمدیة) آنان»"
  },
  "page_count": 1
}