{
  "id": 487,
  "title": {
    "ar": "الباب السابع والثمانون وأربعمائة في معرفة حال قطب كان منزله ومن يعمل من الصالحات (من عَمِلَ صالِحاً من ذَكَرٍ أَوْ أُنْثى‏ وهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَياةً طَيِّبَةً",
    "en": "Chapter Four Hundred and Eighty-Seven: Concerning the Knowledge of the State of a Pole (*Qutb*), whose station (منزله) is that of those who perform righteous deeds, and concerning the meaning of the verse: <<Whoever performs righteous deeds, whether male or female, while being a believer, We shall surely grant him a good life (حياة طيبة)>>.",
    "ur": "باب چار سو ستاسی (۴۸۷)\n\nایک ایسے قطب (Qutb) کے حال کی معرفت (Ma'rifah) کے بیان میں جس کا منزل (Manzil) اور عمل صالح کرنے والوں کا حال یہ ہے: **\"مردوں یا عورتوں میں سے جو کوئی بھی ایمان کی حالت میں نیک عمل کرے گا، تو ہم اسے ضرور بالضرور پاکیزہ زندگی عطا کریں گے۔\"** (من عَمِلَ صالِحاً من ذَكَرٍ أَوْ أُنْثى‏ وهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَياةً طَيِّبَةً)",
    "fa": "باب چهارصد و هشتاد و هفتم در معرفت حال قطبی که منزلگاه او بود و کسانی که اعمال صالح انجام می‌دهند: «هر کس از مرد یا زن کار شایسته‌ای انجام دهد و مؤمن باشد، قطعاً او را به زندگی پاکیزه‌ای زنده خواهیم گرداند» (مَنْ عَمِلَ صالِحاً من ذَكَرٍ أَوْ أُنْثى‏ وهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَياةً طَيِّبَةً)."
  },
  "content": {
    "ar": "## «الباب السابع والثمانون وأربعمائة في معرفة حال قطب كان منزله ومن يعمل من الصالحات (من عَمِلَ صالِحاً) من ذَكَرٍ أَوْ أُنْثى‏ وهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَياةً طَيِّبَةً»\n\n\n> لكل شي‏ء من الأشياء ميزان *** فكل شي‏ء له نقص ورجحان‏\n\n\n> فالصالحون لهم وزن يخصهم *** والطالحون لهم في الحق ميزان‏\n\n\n> فمن يقوم بوزن في تقلبه *** يسعد وإن جاءه في ذاك برهان‏\n\n\n> لأن ميزانه وفي حقيقته *** ولو يساعده في ذاك شيطان‏\n\n\n> لذاك قال لمن وفي طريقته *** من خلقه ما له عليه سلطان‏\n\n\n### [إن الله يبدل السيئات بالحسنات‏]\n\n\nقال الله تعالى الطَّيِّباتُ لِلطَّيِّبِينَ والطَّيِّبُونَ لِلطَّيِّباتِ وإِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ والْعَمَلُ الصَّالِحُ فالعمل الصالح له الحياة الطيبة وهي تعجيل البشرى في الحياة الدنيا كما قال تعالى لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا فيحيا في باقي عمره حياة طيبة لما حصل له من العلم بما سبق له من سعادته في علم الله مما يؤول إليه في أبده فتهون عليه هذه البشرى ما يلقاه من المشقات والعوارض المؤلمة ف إِنَّ وَعْدَ الله حَقٌّ وكلامه صدق وقد خوطب بالقول الذي لا يبدل لديه وكذلك أيضا للعمل الصالح التبديل فيبدل الله سيئاته حسنات حتى يود لو أنه أتى جميع الكبائر الواقعة في العالم من العالم كله على شهود منه عين التبديل في ذلك ولقد لقيت من هو بهذه الحال بمكة من أهل توزر من أرض الحرير ولقيت أيضا بإشبيلية أبا العباس العريبي شيخنا من أهل العليا بغرب الأندلس ما لقيت في عمري إلا هذين من أهل هذا الذوق وكذلك للعمل الصالح شكر الحق لأنه الغفور الشكور فسعيه مقبول وكلامه مسموع ولو لم يكن في العمل الصالح إلا إلحاق عامله بالصالحين وإطلاق هذا الاسم عليه لكان كافيا فإنه مطلب الأنبياء عليه السلام وهم أرفع الطوائف من عباد الله والصلاح أرفع صفة لهم فإن الله أخبرنا عنهم أنهم مع كونهم رسلا وأنبياء سألوا الله أن يدخلهم الله برحمته في عباده الصالحين وذكر في أولي العزم من رسله أنهم من الصالحين في معرض الثناء عليهم فالصلاح يكون أخص وصف للرسل والأنبياء عليه السلام وهم بلا خلاف أرفع الناس منزلة وإن فضل بعضهم بعضا ومن نال الصلاح من عباد الله فقد نال ما دونه فله منازل الرسل والأنبياء عليه السلام وليس برسول ولا نبي لكن يغبطه الرسول والنبي لما يناله الرسول والنبي من مشقة الرسالة والنبوة لأنها تكليف وبها حصلت لهم المنزلة الزلفى ونالها صاحب العمل الصالح المغبوط من غير ذوق هذه المشقات ومن هنا تعرف ما مسمى الرسول والنبي وتعرف معنى‏\n\n\nقول الرسول صَلَّى اللهُ عَليهِ وسَلَّم في قوم تنصب لهم منابر يوم القيامة في الموقف يخاف الناس ولا يخافون ويحزن الناس ولا يحزنون‏\n\n\nلا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ ليسوا بأنبياء يغبطهم النبيون حيث رأوا تحصيلهم هذه المنازل مع هذه الحال فهم غير مسئولين من بين الخلائق لم يدخلهم في عملهم خلل من زمان توبتهم فإن دخلهم خلل فليسوا بصالحين فمن شرط الصلاح استصحاب العصمة في الحال والقول والعمل ولا يكون هذا إلا لأهل الشهود الدائم والعارفين بالمواطن والمقامات والآداب والحكم فيحكمون نفوسهم فيمشون بها مشى ربهم‏\nمن حيث هُوَ عَلى‏ صِراطٍ مُسْتَقِيمٍ فمن حياتهم الطيبة في الدنيا أنهم وإن دعوا الخلق إلى الله فإنهم يدعونهم بلسان غيرهم ويشهدون من سمع دعوتهم من المدعون ومن برد الدعوة منهم فلا يألمون لذلك الرد بل يتنعمون بالقبول نعيمهم بالرد لا يختلف عليهم الحال وسبب ذلك أن مشهودهم من الحق الأسماء الإلهية وشهودهم إياها نعيم لهم فمن دعا ما دعا إلا باسم إلهي فالاسم هو الداعي ومن رد أو قبل فما رد وما قبل إلا باسم إلهي فالاسم هو القابل والراد وهذا الشخص في حياة طيبة بهذا الشهود دائما ومن غيبه الله عن شهود هذا المقام فإنه يألم طبعا ويلذ طبعا وهو أكبر نعيم أهل الله وألمهم ولا تكون هذه الحياة الطيبة إلا أن تكون مستصحبة وما ينالها إلا الصالحون من عباد الله وإن ظهر منهم ما توجبه الأمور المؤلمة في العادة وظهر عليهم آثار الآلام فالنفوس منهم في الحياة الطيبة لأن النفوس محلها العقل ليس الحس محلها فألمهم حسية لا نفسية فالذي يراهم يحملهم في ذلك على حاله الذي يجده من نفسه لو قام به ذلك البلاء وهو في نفسه غير ذلك فالصورة صورة بلاء والمعنى معنى عافية وإنعام وما يَعْقِلُها إِلَّا الْعالِمُونَ فهؤلاء هم الذين قال الله فيهم الَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ طُوبى‏ لَهُمْ في الدنيا وحُسْنُ مَآبٍ في الآخرة وهذا التنبيه على تحصيل هذا المقام كاف فإنه مكتسب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 487: Concerning the Knowledge of the State of a Pole whose Station is Defined by the Verse: \"Whoever performs righteous deeds, whether male or female, while being a believer, We shall surely grant him a good life.\"\n\nFor every single thing among things there is a balance (ميزان)\nSo everything has deficiency and preponderance.\n\nThe righteous (الصالحون) have a weight specific to them\nAnd the unrighteous also have a balance in relation to The Real (الحق).\n\nSo whoever maintains a weight in his transformation\nHe is made happy, even if a proof comes to him concerning that.\n\nBecause his balance is faithful to his reality (حقيقته)\nEven if a devil assists him in that.\n\nTherefore, He said concerning those who are faithful in His path\nThat the devil has no authority (سلطان) over His creation.\n\n[Indeed, Allah Replaces Evil Deeds with Good Deeds]\n\nAllah the Exalted said: <<The good things are for the good people, and the good people are for the good things>> and <<To Him ascends the good word and the righteous deed>>. The righteous deed (العمل الصالح) leads to the good life (الحياة الطيبة), which is the hastening of the glad tidings (البشرى) in the life of this world (الحياة الدنيا), as He the Exalted said: <<For them are glad tidings in the life of this world>>. Thus, he lives the remainder of his life a good life because of the knowledge (العلم) he has attained regarding his prior happiness (سعادته) in Allah’s Knowledge, which determines his ultimate destiny in eternity (أبده). This glad tidings makes light the hardships and painful afflictions he encounters, for <<Indeed, the promise of Allah is true>> (إِنَّ وَعْدَ الله حَقٌّ) and His word is truthful. He has been addressed with the word that is not changed by Him.\n\nLikewise, the righteous deed also entails replacement (التبديل). Allah replaces his evil deeds (سيئاته) with good deeds (حسنات), to the extent that he wishes he had committed all the major sins (الكبائر) that occurred in the world, from all of creation, so that he might witness the very essence of that replacement (عين التبديل). I met someone in this state in Mecca, from the people of Tozeur in the land of silk (أرض الحرير), and I also met in Seville our Shaykh, Abu al-Abbas al-Uraybi, from the people of Al-Ulya in the west of Al-Andalus. I have met only these two in my lifetime who possess this spiritual taste (الذوق).\n\nLikewise, the righteous deed is met with the gratitude (شكر) of The Real (الحق), for He is the Forgiving, the Thankful (الشكور). His striving is accepted and his word is heard. If the righteous deed yielded nothing more than attaching its doer to the righteous (الصالحين) and having this name applied to him, it would be sufficient. For this is the goal sought by the Prophets (الأنبياء) (peace be upon them), and they are the highest groups among the servants of Allah. Righteousness (الصلاح) is their highest attribute. Allah informed us that despite being Messengers (رسلا) and Prophets, they asked Allah to admit them by His Mercy among His righteous servants. He mentioned those of firm resolve (أولي العزم) among His Messengers as being among the righteous (الصالحين) in the context of praising them. Thus, righteousness is the most specific description for the Messengers and Prophets (peace be upon them), and they are, without dispute, the highest in rank among people, even if some of them are favored over others.\n\nWhoever attains righteousness (الصلاح) among the servants of Allah has attained what is below it, and he possesses the stations (منازل) of the Messengers and Prophets (peace be upon them), though he is neither a Messenger nor a Prophet. However, the Messenger and the Prophet envy (يغبطه) him because of the hardship (مشقة) of the Messengership and Prophethood that they endure, as these are divine impositions (تكليف). It is through these impositions that they attained the high station (المنزلة الزلفى), yet the envied person of righteous deeds attains it without tasting these hardships.\n\nFrom this, you understand the definition of the Messenger and the Prophet, and you understand the meaning of the saying of the Messenger (peace and blessings of Allah be upon him) concerning a group for whom pulpits are erected on the Day of Resurrection in the Standing Place (الموقف). People fear, but they do not fear; people grieve, but they do not grieve. <<The Great Terror (الْفَزَعُ الْأَكْبَرُ) shall not grieve them.>> They are not Prophets, yet the Prophets envy them when they see their attainment of these stations (منازل) while in this state. They are not held accountable among creation because no flaw entered their deeds since the time of their repentance. If a flaw entered them, they are not righteous. Thus, a condition of righteousness is the continuous accompaniment of infallibility (العصمة) in state (الحال), word, and deed. This is only achieved by the people of permanent witnessing (الشهود الدائم) and the Gnostics (العارفين) of the spiritual stations (المواطن), the spiritual degrees (المقامات), the proper manners (الآداب), and the wisdom (الحكم). They govern their souls and walk with them the walk of their Lord, in that <<He is upon a straight path>> (هُوَ عَلى‏ صِراطٍ مُسْتَقِيمٍ).\n\nPart of their good life (الحياة الطيبة) in this world is that even when they call creation (الخلق) to Allah, they call them with the tongue of another, and they witness (يشهدون) those who hear their call among the invited and those who reject the call among them. They do not suffer pain (يألمون) from that rejection; rather, they are blessed by the acceptance, and their bliss in rejection does not differ from their bliss in acceptance. The reason for this is that what they witness of The Real (الحق) are the Divine Names (الأسماء الإلهية), and their witnessing of them is bliss (نعيم) for them. Whoever calls, calls only by a Divine Name, so the Name is the Caller. And whoever rejects or accepts, rejects or accepts only by a Divine Name, so the Name is the Acceptor and the Rejecter. This person is perpetually in a good life through this witnessing (الشهود).\n\nAs for the one whom Allah veils from witnessing this station (المقام), he suffers naturally and finds pleasure naturally. This witnessing is the greatest bliss and pain of the People of Allah (أهل الله). This good life must be continuously maintained, and only the righteous among the servants of Allah attain it. Even if things that usually cause pain appear from them, and the signs of suffering appear upon them, their souls (النفوس) remain in the good life, because the locus of the soul is the intellect (العقل), not the senses (الحس). Thus, their pain is sensory (حسية), not psychic (نفسية). Therefore, whoever observes them judges them based on his own state—what he would feel if that affliction befell him—but their inner reality is otherwise. The form is the form of affliction, but the meaning is the meaning of well-being and grace. <<But none grasps their meaning except the knowledgeable>> (وَمَا يَعْقِلُهَا إِلَّا الْعَالِمُونَ). These are the ones concerning whom Allah said: <<Those who believe and perform righteous deeds—bliss (طُوبى‏) is for them and a good return (حُسْنُ مَآبٍ)>> in the Hereafter. This reminder concerning the attainment of this station is sufficient, for it is acquired. <<And Allah speaks the Truth, and He guides to the Way>> (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ).",
    "ur": "باب نمبر چار سو ستاسی (۴۸۷) اس قطب (قطب) کے حال کی معرفت میں جس کا مقام یہ ہے: \"اور جو کوئی بھی نیک عمل (من عَمِلَ صالِحاً) کرے، خواہ مرد ہو یا عورت، بشرطیکہ وہ مومن ہو، تو ہم اسے ضرور ایک پاکیزہ زندگی (فَلَنُحْيِيَنَّهُ حَياةً طَيِّبَةً) عطا کریں گے۔\"\n\nہر شے کے لیے ایک میزان (ميزان) ہے\nپس ہر شے میں کمی اور زیادتی (رجحان) ہے\n\nصالحین (الصالحون) کے لیے ایک خاص وزن ہے\nاور طالحین (برے لوگوں) کے لیے بھی حق (الحق) میں میزان ہے\n\nجو شخص اپنی تبدیلیوں (تقلبه) میں وزن قائم رکھتا ہے\nوہ کامیاب ہوتا ہے، اگرچہ اس میں کوئی دلیل (برهان) بھی آ جائے\n\nکیونکہ اس کی میزان (ميزانه) اس کی حقیقت (حقيقته) میں وفادار ہے\nاگرچہ اس میں شیطان بھی اس کی مدد کرے\n\nاسی لیے اس نے اپنی مخلوق میں سے اس شخص سے کہا جو اس کے طریقے پر قائم ہے\nکہ اس پر شیطان کا کوئی تسلط (سلطان) نہیں ہے۔\n\n### [بے شک اللہ برائیوں کو نیکیوں سے بدل دیتا ہے]\n\nاللہ تعالیٰ نے فرمایا: \"پاکیزہ چیزیں پاکیزہ لوگوں کے لیے ہیں اور پاکیزہ لوگ پاکیزہ چیزوں کے لیے ہیں (الطَّيِّباتُ لِلطَّيِّبِينَ والطَّيِّبُونَ لِلطَّيِّباتِ)\" اور \"اسی کی طرف پاکیزہ کلمات چڑھتے ہیں اور نیک عمل (إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ والْعَمَلُ الصَّالِحُ)\"۔ پس نیک عمل (الْعَمَلُ الصَّالِحُ) کے لیے پاکیزہ زندگی (الْحَياةُ الطَّيِّبَةُ) ہے، اور یہ دنیا کی زندگی میں بشارت (البشرى) کی تعجیل ہے، جیسا کہ اللہ تعالیٰ نے فرمایا: \"ان کے لیے دنیا کی زندگی میں بشارت ہے (لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا)\"۔ چنانچہ وہ اپنی باقی عمر پاکیزہ زندگی گزارتا ہے، اس علم کی وجہ سے جو اسے اللہ کے علم میں اپنی سابقہ سعادت (سعادت) کے بارے میں حاصل ہوا کہ وہ ابد (أبده) میں کس انجام کو پہنچے گا۔ پس یہ بشارت اس پر ان مشقتوں اور تکلیف دہ عوارض کو آسان کر دیتی ہے جن کا وہ سامنا کرتا ہے، کیونکہ \"بے شک اللہ کا وعدہ سچا ہے (إِنَّ وَعْدُ الله حَقٌّ)\" اور اس کا کلام سچ ہے۔ اور اسے اس قول سے مخاطب کیا گیا ہے جو اس کے ہاں بدلا نہیں جاتا۔\n\nاسی طرح نیک عمل (الْعَمَلُ الصَّالِحُ) کے لیے تبدیلی (التبديل) بھی ہے، چنانچہ اللہ اس کی برائیوں کو نیکیوں سے بدل دیتا ہے، یہاں تک کہ وہ یہ تمنا کرتا ہے کہ کاش اس نے دنیا میں ہونے والے تمام کبیرہ گناہوں کا ارتکاب کیا ہوتا تاکہ وہ اس تبدیلی (التبديل) کا مشاہدہ (شہود) کر سکے۔ میں مکہ میں توزر (توزر) کے رہنے والوں میں سے ایک شخص سے ملا جو ارض حریر (ارض الحرير) سے تھا، اور میں اشبیلیہ (إشبيلية) میں بھی اپنے شیخ ابو العباس العریبی (أبا العباس العريبي) سے ملا جو مغربی اندلس (غرب الأندلس) کے علاقے علیا (العليا) سے تھے۔ میں نے اپنی عمر میں اس ذوق (الذوق) کے حامل صرف ان دو افراد کو پایا۔\n\nاسی طرح نیک عمل (الْعَمَلُ الصَّالِحُ) کے لیے حق (الحق) کا شکر (شکر) بھی ہے، کیونکہ وہ الغفور الشکور (بخشنے والا، قدردان) ہے۔ پس اس کی کوشش مقبول ہے اور اس کا کلام سنا جاتا ہے۔ اگر نیک عمل میں صرف اس کے عامل کو صالحین (الصالحين) میں شامل کرنا اور اس نام کا اطلاق کرنا ہی ہوتا تو یہ کافی ہوتا، کیونکہ یہ انبیاء علیہم السلام کا مطلوب ہے، اور وہ اللہ کے بندوں میں سب سے بلند گروہ ہیں۔ اور صلاح (الصلاح) ان کی سب سے بلند صفت ہے۔ بے شک اللہ نے ہمیں ان کے بارے میں خبر دی ہے کہ رسول اور نبی ہونے کے باوجود انہوں نے اللہ سے دعا کی کہ وہ انہیں اپنی رحمت سے اپنے نیک بندوں میں داخل کر دے۔ اور اس نے اپنے اولو العزم رسولوں کا ذکر ان کی تعریف کے ضمن میں کیا کہ وہ صالحین (الصالحين) میں سے تھے۔ پس صلاح (الصلاح) رسولوں اور انبیاء علیہم السلام کی سب سے خاص صفت ہے۔ اور وہ بلا اختلاف لوگوں میں سب سے بلند مرتبہ ہیں، اگرچہ ان میں سے بعض کو بعض پر فضیلت حاصل ہے۔ اور اللہ کے بندوں میں سے جس نے صلاح (الصلاح) حاصل کر لی، اس نے اس سے کم تر چیزیں بھی حاصل کر لیں۔ پس اسے رسولوں اور انبیاء علیہم السلام کے منازل (منازل) حاصل ہیں، اگرچہ وہ رسول یا نبی نہیں ہے۔ لیکن رسول اور نبی اس پر رشک (یغبطه) کرتے ہیں، کیونکہ رسول اور نبی رسالت اور نبوت کی مشقت اٹھاتے ہیں، کیونکہ یہ ایک ذمہ داری (تکلیف) ہے، اور اسی کے ذریعے انہیں قربت (الزلفى) کا مقام حاصل ہوا۔ اور صاحب عمل صالح (صاحب العمل الصالح) نے یہ مقام بغیر ان مشقتوں کا ذوق (ذوق) چکھے حاصل کر لیا، جس پر رشک کیا جاتا ہے۔\n\nاور یہیں سے تم رسول (الرسول) اور نبی (النبي) کے مسمیٰ کو پہچانتے ہو، اور تم رسول صلی اللہ علیہ وسلم کے اس قول کا معنی جانتے ہو: \"ایک قوم کے لیے قیامت کے دن میدان حشر میں منبر نصب کیے جائیں گے، لوگ خوفزدہ ہوں گے مگر وہ خوفزدہ نہیں ہوں گے، لوگ غمگین ہوں گے مگر وہ غمگین نہیں ہوں گے (لا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ)\"۔ وہ انبیاء نہیں ہیں، مگر انبیاء ان پر رشک (یغبطهم) کرتے ہیں جب وہ دیکھتے ہیں کہ انہوں نے اس حال کے ساتھ یہ منازل (منازل) حاصل کر لیں۔ پس وہ مخلوقات میں سے جوابدہ نہیں ہیں، کیونکہ ان کی توبہ کے وقت سے ان کے عمل میں کوئی خلل نہیں آیا۔ اگر ان میں کوئی خلل آ جائے تو وہ صالحین (الصالحين) میں سے نہیں ہیں۔ پس صلاح (الصلاح) کی شرط یہ ہے کہ حال، قول اور عمل میں عصمت (العصمة) کو برقرار رکھا جائے۔ اور یہ صرف اہل شہود دائم (الشهود الدائم) اور مقامات (المقامات) و آداب (الآداب) و حکمتوں (الحکم) کے عارفین (العارفين) کو ہی حاصل ہوتا ہے۔ پس وہ اپنے نفوس پر حکومت کرتے ہیں اور ان کے ذریعے اپنے رب کے چلنے کے مطابق چلتے ہیں۔\n\nاس لحاظ سے کہ \"وہ سیدھے راستے پر ہے (هُوَ عَلى‏ صِراطٍ مُسْتَقِيمٍ)\"۔ پس ان کی دنیا میں پاکیزہ زندگی (الْحَياةُ الطَّيِّبَةُ) یہ ہے کہ اگرچہ وہ مخلوق کو اللہ کی طرف بلاتے ہیں، لیکن وہ انہیں کسی دوسرے کی زبان سے بلاتے ہیں، اور وہ ان لوگوں کا مشاہدہ (شہود) کرتے ہیں جنہوں نے ان کی دعوت سنی اور ان کا بھی جنہوں نے دعوت کو رد کیا۔ پس وہ اس رد پر تکلیف محسوس نہیں کرتے، بلکہ قبولیت سے لطف اندوز ہوتے ہیں، اور رد سے ان کی نعمت (نعیم) میں کوئی فرق نہیں آتا۔ اس کی وجہ یہ ہے کہ ان کا مشہود (مشهودهم) حق (الحق) کی طرف سے اسماء الٰہیہ (الأسماء الإلهية) ہیں، اور ان کا ان کا مشاہدہ (شہود) کرنا ان کے لیے نعمت ہے۔ پس جس نے بھی دعوت دی، اس نے صرف ایک اسم الٰہی (اسم إلهي) کے ذریعے دعوت دی، پس اسم ہی داعی ہے۔ اور جس نے رد کیا یا قبول کیا، اس نے صرف ایک اسم الٰہی کے ذریعے رد کیا یا قبول کیا، پس اسم ہی قبول کرنے والا اور رد کرنے والا ہے۔ اور یہ شخص اس شہود (الشهود) کے ساتھ ہمیشہ پاکیزہ زندگی (حياة طيبة) میں رہتا ہے۔ اور جسے اللہ اس مقام کے شہود (شہود) سے غائب کر دیتا ہے، وہ طبعاً تکلیف محسوس کرتا ہے اور طبعاً لذت محسوس کرتا ہے، حالانکہ یہ اہل اللہ کی سب سے بڑی نعمت اور ان کی تکلیف ہے۔\n\nاور یہ پاکیزہ زندگی (الْحَياةُ الطَّيِّبَةُ) تب ہی ہوتی ہے جب یہ مستقل طور پر برقرار رہے، اور اسے صرف اللہ کے نیک بندے (الصالحون) ہی حاصل کرتے ہیں، اگرچہ ان سے وہ چیزیں ظاہر ہوں جو عادتاً تکلیف دہ ہوتی ہیں، اور ان پر درد کے آثار ظاہر ہوں۔ لیکن ان کے نفوس (النفوس) پاکیزہ زندگی میں ہوتے ہیں، کیونکہ نفوس کا محل عقل (العقل) ہے، نہ کہ حس (الحس)۔ پس ان کا درد حسی (حسية) ہوتا ہے، نفسیاتی (نفسية) نہیں۔ پس جو انہیں دیکھتا ہے، وہ انہیں اس حال پر محمول کرتا ہے جو وہ خود اپنے اندر پاتا اگر اسے وہ بلا لاحق ہوتی، حالانکہ وہ شخص خود اس کے برعکس ہوتا ہے۔ پس صورت تو بلا کی صورت ہے، لیکن معنی عافیت اور انعام کا معنی ہے۔ \"اور اسے صرف علم والے ہی سمجھتے ہیں (ما يَعْقِلُها إِلَّا الْعالِمُونَ)\"۔ پس یہی وہ لوگ ہیں جن کے بارے میں اللہ نے فرمایا: \"جو لوگ ایمان لائے اور نیک عمل کیے، ان کے لیے خوشحالی (طُوبى‏ لَهُمْ) ہے دنیا میں اور بہترین ٹھکانہ (حُسْنُ مَآبٍ) ہے آخرت میں\"۔ اور اس مقام کے حصول پر یہ تنبیہ کافی ہے، کیونکہ یہ اکتسابی (مکتسب) ہے۔ اور \"اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)\"۔",
    "fa": "باب چهارصد و هشتاد و هفتم در معرفت حال قطبی که منزل او و کسانی که اعمال صالح انجام می‌دهند (مَنْ عَمِلَ صَالِحًا) از مرد یا زن در حالی که مؤمن باشد، پس او را به حیات طیبه زنده خواهیم کرد (فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً).\n\nهر چیزی از اشیاء را میزانی است\nپس هر چیزی را نقص و رجحانی است\n\nپس صالحان را وزنی مخصوص به خود است\nو طالحان (بدکاران) را نیز در حق (الحق) میزانی است\n\nپس هر کس که در دگرگونی‌هایش به وزن (اعمال) قیام کند\nسعادتمند می‌شود، هرچند در آن برهانی به او برسد\n\nزیرا میزان او در حقیقت (حقيقة) اوست\nحتی اگر شیطانی در آن یاری‌اش کند\n\nاز این رو به کسی که در طریقت (طریقة) او وفادار است، فرمود\nاز خلقش، شیطان بر او سلطه‌ای ندارد\n\n[همانا خداوند بدی‌ها را به نیکی‌ها تبدیل می‌کند]\n\nخداوند متعال فرمود: «زنان پاک برای مردان پاک و مردان پاک برای زنان پاک هستند» (الطَّيِّبَاتُ لِلطَّيِّبِينَ وَالطَّيِّبُونَ لِلطَّيِّبَاتِ) و «سخنان پاکیزه به سوی او بالا می‌رود و عمل صالح» (وَإِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ). پس عمل صالح حیات طیبه را به همراه دارد و آن تعجیل بشارت در زندگی دنیاست، چنانکه فرمود: «برای آنان بشارت در زندگی دنیاست» (لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا). پس او در باقی عمرش به حیات طیبه زندگی می‌کند، به سبب علمی که از سعادت ازلی خود در علم خداوند به دست آورده است، که در ابدیت به آن منتهی می‌شود. این بشارت، سختی‌ها و عوارض دردناکی را که با آن مواجه می‌شود، بر او آسان می‌سازد، زیرا «همانا وعده خداوند حق است» (إِنَّ وَعْدَ اللَّهِ حَقٌّ) و کلام او راست است و با قولی مورد خطاب قرار گرفته که نزد او تبدیل نمی‌شود. همچنین برای عمل صالح نیز تبدیل وجود دارد؛ پس خداوند بدی‌های او را به نیکی‌ها تبدیل می‌کند، تا جایی که آرزو می‌کند ای کاش تمام گناهان کبیره‌ای را که در جهان از سوی تمام جهانیان رخ داده است، انجام می‌داد، در حالی که عین تبدیل را در آن مشاهده (شهود) می‌کرد. من کسی را که در مکه دارای این حال بود، از اهالی توزر از سرزمین حریر ملاقات کردم، و همچنین در اشبیلیه، ابوالعباس العریبی، شیخ ما از اهالی علیا در غرب اندلس را ملاقات کردم. در عمرم جز این دو نفر را از اهل این ذوق (ذوق) ندیدم. همچنین برای عمل صالح، شکر حق (الحق) وجود دارد، زیرا او غفور و شکور است. پس تلاش او پذیرفته و کلام او شنیده می‌شود. اگر در عمل صالح جز ملحق شدن عامل آن به صالحان و اطلاق این نام بر او نبود، کافی بود؛ زیرا این مطلوب انبیا (علیهم السلام) است و آنان والاترین طوایف از بندگان خدا هستند و صلاح والاترین صفت برای ایشان است. خداوند به ما خبر داده است که آنان با وجود اینکه رسول و نبی بودند، از خداوند خواستند که آنان را به رحمت خود در زمره بندگان صالحش درآورد، و در مورد پیامبران اولوالعزم خود ذکر کرد که آنان از صالحان هستند در معرض ستایش بر آنان. پس صلاح، خاص‌ترین وصف برای رسولان و انبیا (علیهم السلام) است و آنان بدون اختلاف، والاترین مردم از نظر منزلت هستند، هرچند برخی از آنان بر برخی دیگر برتری دارند. و هر کس از بندگان خدا به صلاح دست یابد، به آنچه پایین‌تر از آن است نیز دست یافته است، پس منازل رسولان و انبیا (علیهم السلام) برای اوست، در حالی که نه رسول است و نه نبی. اما رسول و نبی بر او غبطه می‌خورند، به دلیل مشقت رسالت و نبوت که رسول و نبی متحمل می‌شوند، زیرا رسالت تکلیف است و به واسطه آن، منزلت قرب (منزلة الزلفى) برایشان حاصل شده است، و صاحب عمل صالح مغبوط، این منزلت را بدون چشیدن این مشقت‌ها به دست آورده است. از اینجا می‌توانی مسمای رسول و نبی را بشناسی و معنای\n\nسخن رسول (صَلَّى اللهُ عَليهِ وسَلَّم) را در مورد قومی که در روز قیامت در موقف برایشان منبرهایی برپا می‌شود، در حالی که مردم می‌ترسند و آنان نمی‌ترسند، و مردم اندوهگین می‌شوند و آنان اندوهگین نمی‌شوند، بشناسی. «فزع اکبر آنان را اندوهگین نمی‌سازد» (لَا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ). آنان پیامبر نیستند، اما پیامبران بر آنان غبطه می‌خورند، زیرا می‌بینند که آنان این منازل را با این حال به دست آورده‌اند. آنان در میان خلایق مورد بازخواست قرار نمی‌گیرند، زیرا از زمان توبه، هیچ خللی در عملشان وارد نشده است. اگر خللی در آنان وارد شود، صالح نیستند. پس از شرط‌های صلاح، همراه داشتن عصمت در حال، گفتار و کردار است، و این جز برای اهل شهود (الشهود) دائم و عارفان به مواطن، مقامات، آداب و حکمت‌ها حاصل نمی‌شود. پس آنان بر نفوس خود حکم می‌رانند و با آن به روش پروردگارشان گام برمی‌دارند،\n\nاز آن جهت که «او بر صراط مستقیم است» (هُوَ عَلَى صِرَاطٍ مُسْتَقِيمٍ). از جمله حیات طیبه آنان در دنیا این است که اگرچه خلق را به سوی خدا دعوت می‌کنند، اما آنان را با زبان غیر خود دعوت می‌نمایند و شاهد (شهود) کسانی هستند که دعوتشان را می‌شنوند و کسانی که دعوت را رد می‌کنند. پس از آن رد، دردمند نمی‌شوند، بلکه با پذیرش دعوت متنعم می‌گردند. تنعم آنان با رد دعوت تفاوتی در حالشان ایجاد نمی‌کند. و سبب آن این است که مشهود (مشهود) آنان از حق (الحق)، اسماء الهی است و شهود (الشهود) این اسماء برایشان نعمت است. پس هر کس که دعوت می‌کند، جز به واسطه یک اسم الهی دعوت نکرده است، و آن اسم، خود داعی است. و هر کس که رد یا قبول می‌کند، جز به واسطه یک اسم الهی رد یا قبول نکرده است، و آن اسم، خود پذیرنده و ردکننده است. و این شخص به واسطه این شهود (الشهود) همواره در حیات طیبه است. و هر کس که خداوند او را از شهود (الشهود) این مقام غایب سازد، طبعاً درد می‌کشد و طبعاً لذت می‌برد. و این بزرگترین نعمت و درد اهل الله است. و این حیات طیبه حاصل نمی‌شود مگر اینکه همواره همراه باشد، و جز صالحون از بندگان خدا به آن دست نمی‌یابند. اگرچه از آنان آنچه امور دردناک به طور معمول اقتضا می‌کند، ظاهر شود و آثار آلام بر آنان نمایان گردد، اما نفوس آنان در حیات طیبه هستند، زیرا محل نفوس، عقل است نه حس. پس درد آنان حسی است نه نفسی. کسی که آنان را می‌بیند، حال آنان را بر اساس حال خود حمل می‌کند که اگر آن بلا بر او وارد می‌شد، چه می‌یافت، در حالی که حال آنان در واقع غیر از آن است. پس صورت، صورت بلاست و معنا، معنای عافیت و انعام است. «و آن را جز دانایان درک نمی‌کنند» (وَمَا يَعْقِلُهَا إِلَّا الْعَالِمُونَ). اینان همان کسانی هستند که خداوند درباره‌شان فرمود: «آنان که ایمان آوردند و کارهای شایسته انجام دادند، خوشا به حالشان (طُوبَى لَهُمْ) در دنیا و نیکو بازگشتی (حُسْنُ مَآبٍ) در آخرت دارند». و این تنبیه بر تحصیل این مقام کافی است، زیرا این مقام اکتسابی است. و «خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}