{
  "id": 232,
  "title": {
    "ar": "الباب الثاني والثلاثون ومائتان في مقام الاصطلام",
    "en": "Chapter Two Hundred and Thirty-Two, Concerning the Station of Rapture (مقام الاصطلام)",
    "ur": "باب دو سو بتیس (۲۳۲) مقامِ استغراق (مقام الاصطلام) کے بیان میں",
    "fa": "باب دویست و سی و دوم در مقام اصطلام (الاصطلام)"
  },
  "content": {
    "ar": "## «الباب الثاني والثلاثون ومائتان في مقام الاصطلام»\n\n\n> للاصطلام على القلوب تحكم *** وله على كل النعوت تقدم‏\n\n\n> يعطي التحير في العقول وجوده *** وهو السبيل من الإله الأقوم‏\n\n\n> من قال زدني فيك تحيرا *** ذاك المؤمل والنبي الأعلم‏\n\n\n> لولاه ما عرف الإله ولا درت *** الباب أهل الله أين هم هم‏\n\n\n### [أن العبد إذا تجلى له الحق في سره في صورة الجمال أثر في نفسه هيبة]\n\n\nالاصطلام في اصطلاح القوم وله يرد على القلب سلطانه قوي فيسكن من قام به تحته وهو أن العبد إذا تجلى له الحق في‏\nسره في صورة الجمال أثر في نفسه هيبة فإن الجمال نعت الحق تعالى والهيبة نعت العبد والجمال نعت الحق والأنس نعت العبد فإذا اتصف العبد بالهيبة لتجلى الجمال فإن الجمال مهوب أبدا كان عن الهيبة أثر في القلب وخدر في الجوارح حكم ذلك الأثر اشتعال نار الهيبة فيخاف لذلك سطوته فيسكن وعلا منه فيه في الظاهر خدر الجوارح وموتها فإن تحرك من هذه صفته فحركته دورية حتى لا يزول عن موضعه فإنه بخيل إليه إن تلك النار محيطة به من جميع الجهات فلا يجد منفذا فيدور في موضعه كأنه يريد الفرار منه إلى أن يخف ذلك عنه بنعت آخر يقوم به وهو حال ليس هو مقام ولما كان هذا الاصطلام نعت الشبلي كان يدور لضعفه وخوفه غير إن الله كانت له عناية منه فكان يرده إلى إحساسه في أوقات الصلوات فإذا أدى صلاة الوقت غلب عليه حال الاصطلام بسلطانه فقيل للجنيد عنه فقال أ محفوظ عليه أوقات الصلوات فقيل نعم فقال الجنيد الحمد لله الذي لم يجر عليه لسان ذنب فما أحسن قول الجنيد لسان ذنب فإنه أخيذ وقته فليس بصاحب ذنب والغريب يشهده تاركا للصلاة ومن أعجب حكم الاصطلام الجمع بين الضدين فإن الخدر ينفي الحركة فهو مخدور الجوارح بل هو محرك يدار به وهو صاحب خدر هكذا يحسه من نفسه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيل‏\n\n",
    "en": "## Chapter Two Hundred and Thirty-Two: Concerning the Station of Rapture\n\n> Rapture holds dominion over the hearts,\n> And it takes precedence over all attributes.\n> Its existence grants bewilderment to the intellects,\n> And it is the most upright path from the Divine.\n> He who said, \"Increase my bewilderment in You,\"\n> That is the one hoped for, and the most knowing Prophet.\n> Were it not for it, the Divine would not be known, nor would they perceive,\n> The door, where the People of Allah truly reside.\n\n### [That when the Real discloses Himself to the servant in his secret heart in the form of Beauty, it affects his soul with awe]\n\nRapture (*al-Istilām*), in the terminology of the People, is when its powerful dominion descends upon the heart, causing the one who experiences it to become still beneath its sway. It occurs when the Real (*al-Haqq*) discloses Himself (*al-Tajalli*) to the servant in his secret heart (*sirr*) in the form of Beauty (*al-Jamāl*), affecting his soul with awe (*hayba*). For Beauty is an Attribute (*na‘t*) of the exalted Real, while awe is an attribute of the servant. And Beauty is an attribute of the Real, while intimacy (*uns*) is an attribute of the servant.\n\nThus, when the servant is characterized by awe due to the disclosure of Beauty—for Beauty is perpetually awe-inspiring—an effect of awe is produced in the heart, accompanied by numbness (*khadar*) in the limbs. The consequence of this effect is the kindling of the fire of awe, causing him to fear its overwhelming power, thus making him still. What manifests outwardly from this state is the numbness and apparent death of the limbs.\n\nIf a person in this state moves, his movement is circular, ensuring he does not depart from his spot. This is because he imagines that the fire [of awe] surrounds him from all directions, finding no outlet, so he circles in his place as if attempting to flee from it, until this condition is alleviated by another attribute that arises in him, which is a passing spiritual state (*hāl*) and not a permanent station (*maqām*).\n\nSince this rapture (*al-Istilām*) was the characteristic state of al-Shibli, he would circle due to his weakness and fear. However, Allah had a special providence for him, returning him to his awareness during the times of the prescribed prayers (*salawāt*). Once he had performed the prayer for that time, the state of rapture would again overcome him with its dominion.\n\nThis was mentioned to al-Junayd, who asked, \"Are the times of the prayers preserved for him?\" When told yes, al-Junayd said, \"Praise be to Allah, Who did not allow the tongue of sin (*dhanb*) to run against him.\" How excellent is al-Junayd’s phrase, \"the tongue of sin,\" for [Shibli] is seized by his state (*waqt*), and thus is not the master of sin. Yet, the strange thing is that one witnesses [others in this state] abandoning the prayer.\n\nAnd among the most wondrous rulings of Rapture (*al-Istilām*) is the combination of two opposites (*al-ḍiddayn*). For numbness (*khadar*) negates movement, yet while his limbs are numb, he is nevertheless moved and circled. He is the subject of numbness—this is how he perceives it in himself.\n\n<<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah says the Truth, and He guides the way).",
    "ur": "باب نمبر دو سو بتیس: مقام الاصطلام (الاصطلام) کے بیان میں\n\nاصطلام (الاصطلام) کو دلوں پر مکمل تسلط حاصل ہے،\nاور تمام صفات پر اسے تقدم حاصل ہے۔\n\nاس کا وجود عقلوں میں حیرت (التحير) پیدا کرتا ہے،\nاور یہ اللہ کی طرف سے سب سے سیدھا راستہ (السبیل الأقوم) ہے۔\n\nجس نے کہا: \"مجھے تجھ میں مزید حیرت (تحیراً) عطا فرما،\"\nوہ ہی آرزو مند اور سب سے زیادہ جاننے والے نبی (الأعلم) ہیں۔\n\nاگر یہ (اصطلام) نہ ہوتا تو نہ ذات حق (الإله) کی معرفت (المعرفۃ) ہوتی،\nاور نہ ہی اہل اللہ (أهل الله) دروازے پر جان پاتے کہ وہ کہاں ہیں۔\n\n### [جب بندے کے باطن میں ذات حق (الحق) کا ظہور (التجلی) جمال کی صورت میں ہوتا ہے تو اس کے نفس میں ہیبت پیدا ہوتی ہے]\n\nاصطلام (الاصطلام) صوفیاء کی اصطلاح میں وہ حال ہے جس کا قوی تسلط دل پر وارد ہوتا ہے، اور جس شخص میں یہ حال قائم ہو وہ اس کے زیر اثر ساکن ہو جاتا ہے۔ یہ اس طرح ہوتا ہے کہ جب بندے کے باطن (سرہ) میں ذات حق (الحق) کا ظہور (التجلی) جمال کی صورت میں ہوتا ہے تو اس کے نفس میں ہیبت (هيبة) پیدا ہوتی ہے۔ کیونکہ جمال (الجمال) حق تعالیٰ کی صفت (نعت) ہے، اور ہیبت بندے کی صفت ہے۔ (اسی طرح) جمال ذات حق (الحق) کی صفت ہے اور انس (الانس) بندے کی صفت ہے۔ پس جب بندہ جمال کے ظہور (تجلی الجمال) کی وجہ سے ہیبت سے متصف ہوتا ہے—کیونکہ جمال ہمیشہ ہیبت انگیز ہوتا ہے—تو اس ہیبت کا اثر دل میں اور اعضاء میں سستی (خدر) کی صورت میں ظاہر ہوتا ہے۔ اس اثر کا حکم ہیبت کی آگ (نار الهيبة) کا بھڑک اٹھنا ہے۔ چنانچہ بندہ اس کی گرفت سے خوفزدہ ہو کر ساکن ہو جاتا ہے، اور اس پر ظاہری طور پر اعضاء کی سستی اور ان کا مردہ ہو جانا غالب آ جاتا ہے۔ اگر اس صفت کا حامل شخص حرکت کرتا ہے تو اس کی حرکت دائرہ نما (دوریۃ) ہوتی ہے تاکہ وہ اپنی جگہ سے نہ ہٹے۔ کیونکہ اسے یہ خیال ہوتا ہے کہ وہ آگ اسے ہر طرف سے گھیرے ہوئے ہے، لہٰذا وہ کوئی راستہ نہیں پاتا اور اپنی جگہ پر گھومتا رہتا ہے، گویا وہ اس سے فرار چاہتا ہے۔ یہ کیفیت اس وقت تک رہتی ہے جب تک کہ کوئی دوسری صفت اس پر غالب نہ آ جائے، جو کہ ایک حال (حال) ہے، مقام (مقام) نہیں۔\n\nچونکہ یہ اصطلام (الاصطلام) شبلی (الشبلي) کی صفت تھی، وہ اپنی کمزوری اور خوف کی وجہ سے گھومتے رہتے تھے۔ لیکن اللہ کی طرف سے ان پر خاص عنایت تھی، چنانچہ وہ نمازوں کے اوقات میں انہیں ان کے احساس کی طرف لوٹا دیتا تھا۔ جب وہ وقت کی نماز ادا کر لیتے تو اصطلام (الاصطلام) کا حال اپنے تسلط کے ساتھ ان پر غالب آ جاتا۔ جب جنید (الجنيد) سے ان کے بارے میں پوچھا گیا تو انہوں نے فرمایا: \"کیا ان پر نمازوں کے اوقات محفوظ رہتے ہیں؟\" کہا گیا: \"ہاں۔\" تو جنید نے فرمایا: \"الحمد للہ (اللہ کا شکر ہے) جس نے ان پر گناہ کی زبان جاری نہیں کی۔\" جنید کا یہ قول کتنا عمدہ ہے: \"گناہ کی زبان (لسان ذنب)\"، کیونکہ وہ اپنے وقت کا اسیر ہے، لہٰذا وہ گناہ کا مرتکب نہیں ہے۔ جبکہ اجنبی (الغريب) اسے نماز چھوڑتے ہوئے دیکھتا ہے۔\n\nاور اصطلام (الاصطلام) کے عجیب احکام میں سے ایک دو متضاد چیزوں کو جمع کرنا ہے۔ کیونکہ سستی (الخدر) حرکت کی نفی کرتی ہے، لہٰذا وہ اعضاء میں سست ہے، بلکہ وہ ایک متحرک شخص ہے جسے گھمایا جاتا ہے، اور وہ سستی کا مالک بھی ہے۔ وہ اپنے نفس میں اسی طرح محسوس کرتا ہے۔\n\nوَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\nاور اللہ حق فرماتا ہے اور وہی سیدھا راستہ دکھاتا ہے۔",
    "fa": "باب دویست و سی و دوم در مقام جذب (الاصطلام)\n\nجذب (الاصطلام) بر قلب‌ها حکمرانی دارد *** و بر تمامی صفات پیشی گرفته است.\nوجودش حیرت را در عقل‌ها می‌بخشد *** و آن راه راست از سوی خداوند است.\nآن کس که گفت: «حیرتم را در تو افزون کن»، *** او همان آرزومند و پیامبر داناتر است.\nاگر جذب نبود، خداوند شناخته نمی‌شد *** و اهل الله (أهل الله) نمی‌دانستند که در کجای این درگاه قرار دارند.\n\n### [اینکه بنده هرگاه حق (الحق) در سرّ او در صورت جمال تجلی کند، در نفس او هیبت (الهيبة) اثر می‌گذارد]\n\nجذب (الاصطلام) در اصطلاح این طایفه (صوفیه) حالتی است که سلطنت قوی آن بر قلب وارد می‌شود و کسی که تحت آن قرار گیرد، آرام می‌گیرد. این حالت زمانی است که بنده هرگاه حق (الحق) در سرّ او در صورت جمال تجلی کند، در نفس او هیبت (الهيبة) اثر می‌گذارد. زیرا جمال صفت حق تعالی است و هیبت صفت بنده؛ و جمال صفت حق است و انس (الأنس) صفت بنده.\n\nپس هرگاه بنده به واسطه تجلی جمال، متصف به هیبت شود – زیرا جمال همواره مهیب است – از این هیبت اثری در قلب و بی‌حسی (خدر) در جوارح (اعضا) پدید می‌آید. حکم آن اثر، شعله‌ور شدن آتش هیبت است؛ پس بنده از سطوت آن می‌ترسد و آرام می‌گیرد. و در ظاهر، بی‌حسی و مرگ جوارح بر او غلبه می‌کند. اگر کسی که این صفت اوست، حرکتی کند، حرکتش دَوَرانی است تا از جای خود دور نشود. زیرا به او الهام می‌شود که آن آتش از همه جهات او را احاطه کرده است و راه فراری نمی‌یابد؛ پس در جای خود می‌چرخد، گویی می‌خواهد از آن فرار کند، تا زمانی که این حالت با صفت دیگری که بر او غالب می‌شود، تخفیف یابد؛ و آن یک حال است نه مقام.\n\nو چون این جذب (الاصطلام) صفت شبلی بود، او به دلیل ضعف و ترسش می‌چرخید. با این حال، خداوند عنایتی به او داشت که او را در اوقات نماز به هوش می‌آورد. پس هنگامی که نماز وقت را ادا می‌کرد، دوباره حال جذب (الاصطلام) با سلطنت خود بر او غلبه می‌کرد. از جنید درباره او پرسیدند، جنید گفت: «آیا اوقات نماز بر او محفوظ است؟» گفته شد: «بله.» جنید گفت: «الحمدلله که زبان گناه بر او جاری نشد.» چه نیکو است سخن جنید که گفت: «زبان گناه»، زیرا او اسیر وقت خود است و صاحب گناه نیست. و عجیب است که غریب (سالک مبتدی) این حالت را در حالی که نماز را ترک کرده، شهود می‌کند.\n\nو از شگفت‌انگیزترین احکام جذب (الاصطلام)، جمع شدن میان دو ضد است؛ زیرا بی‌حسی (خدر) حرکت را نفی می‌کند، پس او کسی است که جوارحش بی‌حس شده است، بلکه او متحرکی است که گردانده می‌شود و در عین حال صاحب بی‌حسی است. او این را از نفس خود چنین احساس می‌کند. و خداوند حق (الحق) را می‌گوید و اوست که به راه هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيل)"
  },
  "page_count": 2
}