{
  "id": 54,
  "title": {
    "ar": "الباب الرابع والخمسون في معرفة الإشارات",
    "en": "Chapter Fifty-Four: Concerning the Knowledge of the Allusions (الإشارات)",
    "ur": "باب چوونواں (۵۴) اشارات کی معرفت میں",
    "fa": "باب پنجاه و چهارم در معرفت اشارات"
  },
  "content": {
    "ar": "## (الباب الرابع والخمسون في معرفة الإشارات)\n\n\n(بسم الله الرحمن الرحيم)\n\n\n> علم الإشارة تقريب وإبعاد *** وسيرها فيك تأويب وإسئاد\n\n\n> فابحث عليه فإن الله صيره *** لمن يقوم به إفك وإلحاد\n> تنبيه عصمة من قال الإله له *** كن فاستوى كائنا والقوم إشهاد\n\n\n### [الغيبة عن رؤية وجه الحق في الأشياء، عين المرض‏]\n\n\nاعلم أيدنا الله وإياك بروح منه أن الإشارة عند أهل طريق الله تؤذن بالبعد أو حضور الغير قال بعض الشيوخ في محاسن المجالس الإشارة نداء على رأس البعد وبوح بعين العلة يريد أن ذلك تصريح بحصول المرض فإن العلة مرض وهو قولنا أو حضور الغير ولا يريد بالعلة هنا السبب ولا العلة التي اصطلح عليها العقلاء من أهل النظر وصورة لمرض فيها إن المشير غاب عنه وجه الحق في ذلك الغير ومن غاب عنه وجه الحق في الأشياء تمكنت منه الدعوى والدعوى عين المرض وقد ثبت عند المحققين أنه ما في الوجود إلا الله ونحن وإن كنا موجودين فإنما كان وجودنا به ومن كان وجوده بغيره فهو في حكم العدم والإشارة قد ثبتت وظهر حكمها فلا بد من بيان ما هو المراد بها\n\n\n### [علماء الرسوم والصوفية: العلم الظاهر والعلم الباطن‏]\n\n\nفاعلم إن الله عز وجل لما خلق الخلق خلق الإنسان أطوارا فمنا العالم والجاهل ومنا المنصف والمعاند ومنا القاهر ومنا المقهور ومنا الحاكم ومنا المحكوم ومنا المتحكم ومنا المتحكم فيه ومنا الرئيس والرءوس ومنا الأمير والمأمور ومنا الملك والسوقة ومنا الحاسد والمحسود وما خلق الله أشق ولا أشد من علماء الرسوم على أهل الله المختصين بخدمته العارفين به من طريق الوهب الإلهي الذين منحهم أسراره في خلقه وفهمهم معاني كتابه وإشارات خطابه فهم لهذه الطائفة مثل الفراعنة للرسل عليهم السلام ولما كان الأمر في الوجود الواقع على ما سبق به العلم القديم كما ذكرناه عدل أصحابنا إلى الإشارات كما عدلت مريم عليها السلام من أجل أهل الإفك والإلحاد إلى الإشارة فكلامهم رضي الله عنهم في شرح كتابه العزيز الذي لا يَأْتِيهِ الْباطِلُ من بَيْنِ يَدَيْهِ ولا من خَلْفِهِ إشارات وإن كان ذلك حقيقة وتفسيرا لمعانيه النافعة ورد ذلك كله إلى نفوسهم مع تقريرهم إياه في العموم وفيما نزل فيه كما يعلمه أهل اللسان الذين نزل ذلك الكتاب بلسانهم فعم به سبحانه عندهم الوجهين كما قال تعالى سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ يعني الآيات المنزلة في الآفاق وفي أنفسهم‏\n\n\n### [التفسير بالاشارة، رواية عما يراه الصوفي في نفسه‏]\n\n\nفكل آية منزلة لها وجهان وجه يرونه في نفوسهم ووجه آخر يرونه فيما خرج عنهم فيسمون ما يرونه في نفوسهم إشارة ليأنس الفقيه صاحب الرسوم إلى ذلك ولا يقولون في ذلك إنه تفسير وقاية لشرهم وتشنيعهم في ذلك بالكفر عليه وذلك لجهلهم بمواقع خطاب الحق واقتدوا في ذلك بسنن الهدى فإن الله كان قادرا على تنصيص ما تأوله أهل الله في كتابه ومع ذلك فما فعل بل أدرج في تلك الكلمات الإلهية التي نزلت بلسان العامة علوم معاني الاختصاص التي فهمها عباده حين فتح لهم فيها بعين الفهم الذي رزقهم ولو كان علماء الرسوم ينصفون لاعتبروا في نفوسهم إذا نظروا في الآية بالعين الظاهرة التي يسلمونها فيما بينهم فيرون أنهم يتفاضلون في ذلك ويعلو بعضهم على بعض في الكلام في معنى تلك الآية ويقر القاصر بفضل غير القاصر فيها وكلهم في مجرى واحد ومع هذا الفضل المشهود لهم فيما بينهم في ذلك ينكرون على أهل الله إذا جاءوا بشي‏ء مما يغمض عن إدراكهم وذلك لأنهم يعتقدون فيهم أنهم ليسوا بعلماء وأن العلم لا يحصل إلا بالقلم المعتاد في العرف وصدقوا فإن أصحابنا ما حصل لهم ذلك العلم إلا بالتعلم وهو الإعلام الرحماني الرباني قال تعالى اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ خَلَقَ الْإِنْسانَ من عَلَقٍ اقْرَأْ ورَبُّكَ الْأَكْرَمُ الَّذِي عَلَّمَ بِالْقَلَمِ عَلَّمَ الْإِنْسانَ ما لَمْ يَعْلَمْ فإنه القائل أَخْرَجَكُمْ من بُطُونِ أُمَّهاتِكُمْ لا تَعْلَمُونَ وقال تعالى خَلَقَ الْإِنْسانَ عَلَّمَهُ الْبَيانَ فهو سبحانه معلم الإنسان‏\n\n\n### [أهل الله هم ورثة الأنبياء في العلم والهدى والحكمة]\n\n\nفلا نشك أن أهل الله هم ورثة الرسل عليهم السلام والله يقول في حق الرسول وعَلَّمَكَ ما لَمْ تَكُنْ تَعْلَمُ وقال في حق عيسى ويُعَلِّمُهُ الْكِتابَ والْحِكْمَةَ والتَّوْراةَ والْإِنْجِيلَ وقال في حق خضر صاحب موسى عليه السلام وعَلَّمْناهُ من لَدُنَّا عِلْماً فصدق علماء الرسوم عندنا فيما قالوا إن العلم لا يكون إلا بالتعلم وأخطئوا في اعتقادهم إن الله لا يعلم من ليس بنبي ولا رسول يقول الله يُؤْتِي الْحِكْمَةَ من يَشاءُ وهي العلم وجاء بمن وهي نكرة ولكن علماء الرسوم لما آثروا الدنيا على الآخرة وآثروا جانب الخلق على جانب الحق وتعودوا أخذ العلم من الكتب ومن أفواه الرجال الذين من جنسهم ورأوا في زعمهم أنهم من أهل الله بما علموا وامتازوا به عن العامة حجبهم ذلك عن إن يعلموا أن لله عبادا تولى الله تعليمهم في سرائرهم بما أنزله في كتبه وعلى ألسنة رسله وهو العلم الصحيح عن العالم المعلم الذي لا يشك مؤمن في كمال علمه ولا غير مؤمن فإن الذين قالوا إن الله لا يعلم الجزئيات ما أرادوا نفي العلم عنه بها وإنما قصدوا بذلك أنه تعالى لا يتجدد له علم بشي‏ء بل علمها مندرجة في علمه‏\nبالكليات فأثبتوا له العلم سبحانه مع كونهم غير مؤمنين وقصدوا تنزيهه سبحانه في ذلك وإن أخطئوا في التعبير عن ذلك فتولى الله بعنايته لبعض عباده تعليمهم بنفسه بإلهامه وإفهامه إياهم فألهمها فجورها وتقواها في أثر قوله ونَفْسٍ وما سَوَّاها فبين لها الفجور من التقوى إلهاما من الله لها لتجتنب الفجور وتعمل بالتقوى‏\n\n\n### [تنزيل الكتاب على الأنبياء وتنزيل الفهم على قلوب الأولياء]\n\n\nكما كان أصل تنزيل الكتاب من الله على أنبيائه كان تنزيل الفهم من الله على قلوب بعض المؤمنين به فالأنبياء عليهم السلام ما قالت على الله ما لم يقل لها ولا أخرجت ذلك من نفوسها ولا من أفكارها ولا تعملت فيه بل جاءت به من عند الله كما قال تعالى تَنْزِيلٌ من حَكِيمٍ حَمِيدٍ وقال فيه إنه لا يَأْتِيهِ الْباطِلُ من بَيْنِ يَدَيْهِ ولا من خَلْفِهِ وإذا كان الأصل المتكلم فيه من عند الله لا من فكر الإنسان ورويته وعلماء الرسوم يعلمون ذلك فينبغي إن يكون أهل الله العاملون به أحق بشرحه وبيان ما أنزل الله فيه من علماء الرسوم فيكون شرحه أيضا تنزيلا من عند الله على قلوب أهل الله كما كان الأصل وكذا\n\n\nقال علي بن أبي طالب رضي الله عنه في هذا الباب ما هو الا فهم يؤتيه الله من شاء من عباده في هذا القرآن‏\n\n\nفجعل ذلك عطاء من الله يعبر عن ذلك العطاء بالفهم عن الله فأهل الله أولى به من غيرهم‏\n\n\n### [الدولة في الحياة الدنيا لأهل الظاهر من علماء الرسوم‏]\n\n\nفلما رأى أهل الله أن الله قد جعل الدولة في الحياة الدنيا لأهل الظاهر من علماء الرسوم وأعطاهم التحكم في الخلق بما يفتون به وألحقهم بالذين يَعْلَمُونَ ظاهِراً من الْحَياةِ الدُّنْيا وهُمْ عَنِ الْآخِرَةِ هُمْ غافِلُونَ وهُمْ في إنكارهم على أهل الله يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعاً سلم أهل الله لهم أحوالهم لأنهم علموا من أين تكلموا وصانوا عنهم أنفسهم بتسميتهم الحقائق إشارات فإن علماء الرسوم لا ينكرون الإشارات فإذا كان في غد يوم القيامة يكون الأمر في الكل كما قال القائل‏\n\n\n> سوف ترى إذا انجلى الغبار *** أ فرس تحتك أم حمار\n\n\nكما يتميز المحقق من أهل الله من المدعي في الأهلية غدا يوم القيامة قال بعضهم‏\n\n\n> إذا اشتبكت دموع في خدود *** تبين من بكى ممن تباكى‏\n\n\nأين عالم الرسوم من‏\n\n\nقول علي بن أبي طالب رضي الله عنه حين أخبر عن نفسه أنه لو تكلم في الفاتحة من القرآن لحمل منها سبعين وقرا\n\n\nهل هذا إلا من الفهم الذي أعطاه الله في القرآن فاسم الفقيه أولى بهذه الطائفة من صاحب علم الرسوم فإن الله يقول فيهم لِيَتَفَقَّهُوا في الدِّينِ ولِيُنْذِرُوا قَوْمَهُمْ إِذا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ فأقامهم مقام الرسول في التفقه في الدين والإنذار وهو الذي يدعو إِلَى الله عَلى‏ بَصِيرَةٍ كما يدعو رسول الله صلى الله عليه وسلم على بصيرة لا على غلبة ظن كما يحكم عالم الرسوم فشتان بين من هو فيما يفتي به ويقوله على بصيرة منه في دعائه إلى الله وهو عَلى‏ بَيِّنَةٍ من رَبِّهِ وبين من يفتي في دين الله بغلبة ظنه‏\n\n\n### [العلم المأخوذ عن الميت والعلم المأخوذ عن الحي الذي لا يموت‏]\n\n\nثم إن من شأن عالم الرسوم في الذب عن نفسه إنه يجهل من يقول فهمني ربي ويرى أنه أفضل منه وأنه صاحب العلم إذ يقول من هو من أهل الله إن الله ألقى في سرى مراده بهذا الحكم في هذه الآية أو يقول رأيت رسول الله صلى الله عليه وسلم في واقعتي فأعلمني بصحة هذا الخبر المروي عنه وبحكمه عنده قال أبو يزيد البسطامي رضي الله عنه في هذا المقام وصحته يخاطب علماء الرسوم أخذتم علمكم ميتا عن ميت وأخذنا علمنا عن الحي الذي لا يموت يقول أمثالنا حدثني قلبي عن ربي وأنتم تقولون حدثني فلان وأين هو قالوا مات عن فلان وأين هو قالوا مات وكان الشيخ أبو مدين رحمه الله إذا قيل له قال فلان عن فلان عن فلان يقول ما نريد نأكل قديدا هاتوا ائتوني بلحم طري يرفع همم أصحابه هذا قول فلان أي شي‏ء قلت أنت ما خصك الله به من عطاياه من علمه اللدني أي حدثوا عن ربكم واتركوا فلانا وفلانا فإن أولئك أكلوه لحما طريا والواهب لم يمت وهو أقرب إليكم من حَبْلِ الْوَرِيدِ\n\n\n### [الفيض الإلهي دائم والمبشرات جزء من أجزاء النبوة]\n\n\nوالفيض الإلهي والمبشرات ما سد بابها وهي من أجزاء النبوة والطريق واضحة والباب مفتوح والعمل مشروع والله يهرول لتلقى من أتى إليه يسعى وما يَكُونُ من نَجْوى‏ ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ وهُوَ مَعَهُمْ أَيْنَ ما كانُوا فمن كان معك بهذه المثابة من القرب مع دعواك العلم بذلك والايمان به لم تترك الأخذ عنه والحديث معه وتأخذ عن غيره ولا تأخذ عنه فتكون حديث عهد بربك يكون المطر فوق رتبتك‏\n\n\nحيث برز إليه رسول الله صلى الله عليه وسلم بنفسه حين نزل وحسر عن رأسه حتى أصابه الماء فقيل له في ذلك فقال إنه حديث عهد بربه‏\n\n\nتعليما لنا وتنبيها\n\n\n### [إشارات الصوفية في شرح كتاب الله‏]\n\n\nثم لتعلم إن أصحابنا ما اصطلحوا على ما جاءوا به في شرح كتاب الله‏\nبالإشارة دون غيرها من الألفاظ إلا بتعليم إلهي جهله علماء الرسوم وذلك أن الإشارة لا تكون إلا بقصد المشير بذلك أنه يشير لا من جهة المشار إليه وإذا سألتهم عن شرح مرادهم بالإشارة أجروها عند السائل من علماء الرسوم مجرى الغالب مثال ذلك الإنسان يكون في أمر ضاق به صدره وهو مفكر فيه فينادي رجل رجلا آخر اسمه فرج فيقول يا فرج فيسمعه هذا الشخص الذي ضاق صدره فيستبشر ويقول جاء فرج الله إن شاء الله يعني من هذا الضيق الذي هو فيه وينشرح صدره كما\n\n\nفعل رسول الله صلى الله عليه وسلم في مصالحة المشركين لما صدوه عن البيت فجاء رجل من المشركين اسمه سهيل فقال رسول الله صلى الله عليه وسلم سهل الأمر أخذه فالا فكان كما تفاءل به رسول الله صلى الله عليه وسلم فانتظم الأمر على يد سهيل‏\n\n\nوما كان أبوه قصد ذلك حين سماه به وإنما جعله له اسما علما يعرف به من غيره وإن كان ما قصد أبوه تحسين اسم ابنه إلا لخير\n\n\n### [اصطلاح أهل الله على ألفاظ گ يعرفها سواهم إلا منهم‏]\n\n\nولما رأى أهل الله أنه قد اعتبر الإشارة استعملوها فيما بينهم ولكنهم بينوا معناها ومحلها ووقتها فلا يستعملونها فيما بينهم ولا في أنفسهم إلا عند مجالسة من ليس من جنسهم أو لأمر يقوم في نفوسهم واصطلح أهل الله على ألفاظ لا يعرفها سواهم إلا منهم وسلكوا طريقة فيها لا يعرفها غيرهم كما سلكت العرب في كلامها من التشبيهات والاستعارات ليفهم بعضهم عن بعض فإذا خلوا بأبناء جنسهم تكلموا بما هو الأمر عليه بالنص الصريح وإذا حضر معهم من ليس منهم تكلموا بينهم بالألفاظ التي اصطلحوا عليها فلا يعرف الجليس الأجنبي ما هم فيه ولا ما يقولون ومن أعجب الأشياء في هذه الطريقة ولا يوجد إلا فيها إنه ما من طائفة تحمل علما من المنطقيين والنجاة وأهل الهندسة والحساب والتعليم والمتكلمين والفلاسفة إلا ولهم اصطلاح لا يعلمه الدخيل فيهم إلا بتوقيف من الشيخ أو من أهله لا بد من ذلك إلا أهل هذه الطريقة خاصة إذا دخلها المريد الصادق وبهذا يعرف صدقه عندهم وما عنده خبر بما اصطلحوا عليه فإذا فتح الله له عين فهمه وأخذ عن ربه في أول ذوقه وما يكون عنده خبر بما اصطلحوا عليه ولم يعلم أن قوما من أهل الله اصطلحوا على ألفاظ مخصوصة فإذا قعد معهم وتكلموا باصطلاحهم على تلك الألفاظ التي لا يعرفها سواهم أو من أخذها عنهم فهم هذا المريد الصادق جميع ما يتكلمون به حتى كأنه الواضع لذلك الاصطلاح ويشاركهم في الكلام بها معهم ولا يستغرب ذلك من نفسه بل يجد علم ذلك ضروريا لا يقدر على دفعه وكأنه ما زال يعلمه ولا يدري كيف حصل له والدخيل من غير هذه الطائفة لا يجد ذلك إلا بموقف فهذا معنى الإشارة عند القوم ولا يتكلمون بها إلا عند حضور الغير أو في تأليفهم ومصنفاتهم لا غير والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Fifty-Four: Concerning the Knowledge of Allusions (الإشارات)\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful\n\nThe science of Allusion (الإشارة) is drawing near and distancing,\nAnd its journey within you is returning and traveling by night.\n\nSo search for it, for Allah has made it,\nFor him who undertakes it, a lie and deviation.\nA warning of the infallibility of him to whom the Deity said,\n\"Be!\" and he became existent, while the people are witnesses.\n\n### Absence from seeing the Face of the Real in things is the essence of illness\n\nKnow—may Allah support us and you with a Spirit from Him—that the Allusion (الإشارة), according to the People of Allah's Path (أهل طريق الله), signifies distance or the presence of the Other (الغير). Some Shaykhs said in *Mahasin al-Majalis*: \"The Allusion is a call at the peak of distance and a disclosure of the essence of the ailment (العلة).\"\n\nHe means that this is an explicit declaration of the occurrence of illness, for the ailment (العلة) is an illness, which is our statement: \"or the presence of the Other.\" He does not mean by *al-`illa* here the cause (السبب), nor the cause upon which the rationalists (العقلاء) among the people of speculative thought (أهل النظر) have agreed. The form of the illness in this context is that the one making the allusion (المشير) is absent from seeing the Face of the Real (وجه الحق) in that Other. And whoever is absent from seeing the Face of the Real in things, the claim (الدعوى) takes hold of him, and the claim is the essence of the illness.\n\nIt has been established among the Verifiers (المحققين) that there is nothing in Existence (الوجود) except Allah. And although we are existent, our existence (وجودنا) is only through Him. And whoever's existence is through other than Him is in the category of non-existence (العدم). Since the Allusion (الإشارة) has been established and its ruling has appeared, it is necessary to explain what is intended by it.\n\n### Scholars of Outward Forms and the Sufis: Exoteric Knowledge and Esoteric Knowledge\n\nKnow that when Allah, the Mighty and Majestic, created Creation (الخلق), He created humanity in stages (أطوارا). Among us is the knowledgeable and the ignorant, the fair-minded and the obstinate, the dominant and the dominated, the ruler and the ruled, the controller and the controlled, the chief and the subordinate, the commander and the commanded, the king and the commoner, the envious and the envied.\n\nAllah has created nothing more difficult or severe upon the People of Allah (أهل الله)—those specialized in His service, who possess Gnosis (العارفين) of Him through the path of Divine Gift (الوهب الإلهي)—than the scholars of outward forms (علماء الرسوم). These are the ones whom He granted His secrets (أسراره) in His creation and gave understanding of the meanings of His Book and the allusions of His discourse. Thus, they (the scholars of outward forms) are to this group (the People of Allah) like the Pharaohs were to the Messengers, peace be upon them.\n\nSince the matter in actual Existence (الوجود الواقع) proceeded according to what the Pre-Eternal Knowledge (العلم القديم) decreed, as we mentioned, our companions resorted to Allusions (الإشارات), just as Mary, peace be upon her, resorted to Allusion because of the people of falsehood (الإفك) and deviation (الإلحاد). Therefore, their discourse, may Allah be pleased with them, in explaining His Glorious Book—<<لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ>> (Falsehood does not approach it from before it or from behind it)—consists of Allusions. Even though this is a reality and an exegesis (تفسيرا) of its beneficial meanings, they refer all of that back to their own souls (نفوسهم), while also affirming it in general terms and in the context in which it was revealed, as is known by the people of the language in whose tongue that Book was revealed. Thus, He, the Glorified, encompassed both aspects for them, as He, the Most High, said: <<سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ>> (We will show them Our signs in the horizons and within themselves)—meaning the signs revealed concerning the horizons and concerning their own souls.\n\n### Exegesis by Allusion, a narration of what the Sufi sees within himself\n\nEvery revealed verse has two aspects: an aspect they see within their own souls (نفوسهم), and another aspect they see in what is external to them. They call what they see within their souls an Allusion (إشارة) so that the jurist (الفقيه), the master of outward forms (صاحب الرسوم), may be reconciled to it. They do not say that it is an exegesis (تفسير) in order to protect themselves from the evil of the jurists and their denunciation of them with accusations of disbelief (الكفر) concerning it. This is due to the jurists' ignorance of the points of application of the Real's (الحق) discourse. In doing this, the Sufis follow the ways of guidance (سنن الهدى).\n\nFor Allah was capable of explicitly stating what the People of Allah (أهل الله) interpret in His Book, yet He did not do so. Rather, He embedded within those Divine words, which were revealed in the language of the common people, the sciences of specialized meanings (علوم معاني الاختصاص) that His servants understood when He opened for them the eye of understanding (عين الفهم) with which He provided them.\n\nIf the scholars of outward forms were fair-minded, they would reflect upon themselves when they look at a verse with the apparent eye (العين الظاهرة) that they accept among themselves. They would see that they differ in merit regarding it, and some surpass others in discussing the meaning of that verse. The less capable one acknowledges the superiority of the more capable one in that matter, even though all of them are in the same stream. Yet, despite this acknowledged superiority among themselves, they deny the People of Allah (أهل الله) when they bring something that is obscure to their comprehension. This is because they believe that the Sufis are not scholars and that knowledge (العلم) is only acquired through the pen customary in common practice. And they spoke the truth (in part), for our companions did not acquire that knowledge except through learning (التعلم), which is the Merciful, Lordly imparting of knowledge (الإعلام الرحماني الرباني).\n\nHe, the Most High, said: <<اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ * خَلَقَ الْإِنْسَانَ مِنْ عَلَقٍ * اقْرَأْ وَرَبُّكَ الْأَكْرَمُ * الَّذِي عَلَّمَ بِالْقَلَمِ * عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ>> (Recite in the Name of your Lord who created; created man from a clinging substance. Recite, and your Lord is the Most Generous, Who taught by the pen, taught man what he did not know). For He is the One who said: <<وَاللَّهُ أَخْرَجَكُمْ مِنْ بُطُونِ أُمَّهَاتِكُمْ لَا تَعْلَمُونَ شَيْئًا>> (And Allah brought you out from the wombs of your mothers while you knew nothing). And He, the Most High, said: <<خَلَقَ الْإِنْسَانَ * عَلَّمَهُ الْبَيَانَ>> (He created man, He taught him the clear expression). Thus, He, the Glorified, is the Teacher of humanity.\n\n### The People of Allah are the inheritors of the Prophets in Knowledge, Guidance, and Wisdom\n\nTherefore, we do not doubt that the People of Allah (أهل الله) are the inheritors of the Messengers, peace be upon them. And Allah says concerning the Messenger: <<وَعَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ>> (And He taught you what you did not know). And He said concerning Jesus: <<وَيُعَلِّمُهُ الْكِتَابَ وَالْحِكْمَةَ وَالتَّوْرَاةَ وَالْإِنْجِيلَ>> (And He will teach him the Book and the Wisdom and the Torah and the Gospel). And He said concerning Khidr, the companion of Moses, peace be upon him: <<وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْمًا>> (And We taught him knowledge from Our Presence [min ladunna `ilman]).\n\nThus, the scholars of outward forms (علماء الرسوم) spoke the truth in our view when they said that knowledge (العلم) is only acquired through learning (التعلم), but they erred in their belief that Allah does not teach anyone who is neither a Prophet nor a Messenger. Allah says: <<يُؤْتِي الْحِكْمَةَ مَنْ يَشَاءُ>> (He gives Wisdom [الحكمة] to whom He wills), and Wisdom is Knowledge (العلم). And He used the word *man* (whom), which is indefinite.\n\nBut when the scholars of outward forms preferred the world (الدنيا) over the Hereafter (الآخرة) and preferred the side of Creation (الخلق) over the side of the Real (الحق), and they became accustomed to taking knowledge from books and from the mouths of men of their own kind, and they believed, in their presumption, that they were among the People of Allah (أهل الله) due to the knowledge they possessed and the distinction they held over the common folk—this veiled them from knowing that Allah has servants whose teaching Allah undertook in their innermost beings (سرائرهم) through what He revealed in His Books and upon the tongues of His Messengers. This is the sound knowledge (العلم الصحيح) from the All-Knowing Teacher, whose perfect knowledge no believer doubts, nor even a non-believer.\n\nFor those who said that Allah does not know particulars (الجزئيات) did not intend to negate knowledge of them from Him. Rather, they meant that no knowledge of anything is renewed for Him; instead, the knowledge of particulars is encompassed within His knowledge of universals (الكليات). Thus, they affirmed knowledge for Him, the Glorified, despite being non-believers, and they intended thereby to declare His transcendence (تنزيهه), even if they erred in expressing it.\n\nSo Allah, through His providence (`inaya), undertook the teaching of some of His servants Himself, by inspiring them (إلهامه) and giving them understanding (إفهامه). <<فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا>> (Then inspired it [the soul] with its wickedness and its righteousness) following His saying: <<وَنَفْسٍ وَمَا سَوَّاهَا>> (By the soul and He who proportioned it). Thus, He made clear to it wickedness from righteousness, by way of Divine inspiration (إلهاما), so that it might avoid wickedness and act with righteousness.\n\n### The Revelation of the Book upon the Prophets and the Revelation of Understanding upon the hearts of the Saints\n\nJust as the origin of the revelation (تنزيل) of the Book was from Allah upon His Prophets, so too is the revelation of understanding (تنزيل الفهم) from Allah upon the hearts of some of the believers in Him. The Prophets, peace be upon them, did not say anything about Allah that He did not say to them, nor did they bring it forth from their own souls (نفوسها) or their thoughts, nor did they fabricate it. Rather, they brought it from Allah, as He, the Most High, said: <<تَنْزِيلٌ مِنْ حَكِيمٍ حَمِيدٍ>> (A revelation from One Wise and Praiseworthy). And He said concerning it: <<لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ>> (Falsehood does not approach it from before it or from behind it).\n\nSince the source being discussed is from Allah, not from human thought or deliberation, and the scholars of outward forms (علماء الرسوم) know this, then the People of Allah (أهل الله) who act upon it ought to be more entitled to explain it and clarify what Allah revealed within it than the scholars of outward forms. Thus, their explanation is also a revelation (تنزيلا) from Allah upon the hearts of the People of Allah, just as the source was.\n\nLikewise, Ali ibn Abi Talib, may Allah be pleased with him, said concerning this matter: \"It is nothing but an understanding (فهم) that Allah grants to whomever He wills among His servants regarding this Quran.\" He made that a gift from Allah, expressing that gift as understanding from Allah. Therefore, the People of Allah (أهل الله) are more deserving of it than others.\n\n### The Dominion in the Worldly Life belongs to the People of the Outward among the Scholars of Outward Forms\n\nWhen the People of Allah (أهل الله) saw that Allah had granted the dominion (الدولة) in the worldly life (الحياة الدنيا) to the people of the outward (أهل الظاهر) among the scholars of outward forms (علماء الرسوم), and gave them control over Creation (الخلق) through the legal rulings (فتاوى) they issue, and joined them with those who <<يَعْلَمُونَ ظَاهِرًا مِنَ الْحَيَاةِ الدُّنْيَا وَهُمْ عَنِ الْآخِرَةِ هُمْ غَافِلُونَ>> (know only the outward appearance of the worldly life, and they are heedless of the Hereafter), and who, in their denial of the People of Allah, <<يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا>> (think that they are doing good work)—the People of Allah conceded their states to them because they knew from where they spoke, and they protected themselves from them by naming the Realities (الحقائق) as Allusions (إشارات). For the scholars of outward forms do not deny Allusions.\n\nWhen tomorrow, the Day of Resurrection (يوم القيامة), arrives, the matter will be for everyone as the poet said:\n\nYou will soon see, when the dust settles,\nwhether a horse or a donkey is beneath you.\n\nJust as the Verifier (المحقق) among the People of Allah will be distinguished from the pretender (المدعي) in spiritual competence tomorrow on the Day of Resurrection. Some said:\n\nWhen tears mingle on cheeks,\nit becomes clear who wept and who pretended to weep.\n\nWhere is the scholar of outward forms compared to the saying of Ali ibn Abi Talib, may Allah be pleased with him, when he informed about himself that if he were to speak concerning the Opening Chapter (Al-Fatiha) of the Quran, he would load seventy camel-loads from it? Is this not from the understanding (الفهم) that Allah granted him concerning the Quran? Thus, the title of Jurist (الفقيه) is more appropriate for this group (the People of Allah) than for the master of the science of outward forms. For Allah says concerning them: <<لِيَتَفَقَّهُوا فِي الدِّينِ وَلِيُنْذِرُوا قَوْمَهُمْ إِذَا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ>> (That they may gain deep understanding [yatafaqqahu] in the religion and warn their people when they return to them, that they may beware). So He established them in the position of the Messenger in gaining deep understanding (التفقه) in the religion and in warning, which is calling <<إِلَى اللَّهِ عَلَى بَصِيرَةٍ>> (to Allah upon clear insight [basira]). Just as the Messenger of Allah, may Allah bless him and grant him peace, calls upon clear insight, not upon predominant conjecture (غلبة ظن), as the scholar of outward forms judges. How vast is the difference between one who, in what he rules and says, is upon clear insight (بصيرة) in his call to Allah, being <<عَلَى بَيِّنَةٍ مِنْ رَبِّهِ>> (upon clear evidence from his Lord), and one who issues rulings in the religion of Allah based on his predominant conjecture.\n\n### Knowledge taken from the dead and Knowledge taken from the Living who does not die\n\nFurthermore, it is characteristic of the scholar of outward forms, in defending himself, that he considers ignorant the one who says, \"My Lord gave me understanding,\" and he sees himself as superior to him and as the true possessor of knowledge. [He does this] when one of the People of Allah says that Allah cast into his innermost being (سري) the meaning intended by this ruling in this verse, or when he says, \"I saw the Messenger of Allah, may Allah bless him and grant him peace, in my spiritual vision (واقعتي), and he informed me of the soundness of this narrated report concerning him and its ruling according to him.\"\n\nAbu Yazid al-Bistami, may Allah be pleased with him, said concerning this station and its validity, addressing the scholars of outward forms: \"You took your knowledge (علمكم) dead from dead, while we took our knowledge from the Living who does not die.\" Those like us say, \"My heart narrated to me from my Lord,\" while you say, \"So-and-so narrated to me.\" And where is he? They say, \"He died.\" \"From so-and-so.\" And where is he? They say, \"He died.\"\n\nShaykh Abu Madyan, may Allah have mercy on him, when it was said to him, \"So-and-so said, from so-and-so, from so-and-so,\" would say, \"We do not want to eat dried meat (قديدا). Bring me fresh meat!\" He would raise the aspirations of his companions [by saying]: \"This is the saying of so-and-so. What have *you* said? What has Allah singled you out with from His gifts of His Knowledge from His Presence (علم اللدني)? Narrate from your Lord, and leave aside so-and-so and so-and-so, for those people ate it as fresh meat, and the Giver has not died, and He is closer to you than <<حَبْلِ الْوَرِيدِ>> (the jugular vein).\n\n### The Divine Emanation is Perpetual and Glad Tidings are a Part of Prophethood\n\nThe door to the Divine Emanation (الفيض الإلهي) and glad tidings (المبشرات) has not been closed, and they are parts of Prophethood (النبوة). The path is clear, the door is open, and the action is legitimate. And Allah hastens to meet the one who comes to Him walking. <<مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ وَلَا أَدْنَى مِنْ ذَلِكَ وَلَا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُوا>> (There is no secret consultation of three but that He is the fourth of them, nor of five but that He is the sixth of them, nor of fewer than that or more, but that He is with them wherever they are).\n\nIf He is with you in this degree of proximity, along with your claim of knowledge of that and faith in it, why would you abandon taking from Him and speaking with Him, and instead take from others and not from Him? You would be \"newly acquainted with your Lord,\" and the rain would be above your station. [This refers to the incident] where the Messenger of Allah, may Allah bless him and grant him peace, went out to it himself when it fell, and uncovered his head until the water touched him. When he was asked about that, he said, \"It is newly acquainted with its Lord.\" This is a teaching and an admonition for us.\n\n### The Allusions of the Sufis in explaining the Book of Allah\n\nThen know that our companions did not agree upon what they brought forth in explaining the Book of Allah by using the term Allusion (الإشارة) rather than other expressions, except through a Divine teaching (تعليم إلهي) that the scholars of outward forms (علماء الرسوم) are ignorant of. This is because the Allusion (الإشارة) only occurs by the intention of the one making the allusion (المشير) that he is alluding, not from the perspective of the thing alluded to (المشار إليه).\n\nAnd if you ask them for an explanation of what they intend by the Allusion, they treat it, for the questioner who is one of the scholars of outward forms, as being in the category of the predominant (الغالب). For example, a person whose breast is constricted by a matter and who is contemplating it. Then a man calls another man whose name is Faraj (Relief), saying, \"O Faraj!\" The person whose breast is constricted hears this and rejoices, saying, \"The relief (faraj) of Allah has come, if Allah wills,\" meaning relief from the distress he is in, and his breast expands.\n\nJust as the Messenger of Allah, may Allah bless him and grant him peace, did when making peace with the polytheists when they barred him from the House (Kaaba). A man from the polytheists named Suhayl (Easy) came, and the Messenger of Allah, may Allah bless him and grant him peace, said, \"The matter has become easy (sahula al-amr).\" He took this as an omen, and it was as the Messenger of Allah, may Allah bless him and grant him peace, took the omen, and the matter was settled by Suhayl. His father did not intend that meaning when he named him with it; rather, he made it a proper name for him by which he is known from others, even though the father only intended good by beautifying his son's name.\n\n### The People of Allah's technical terms that none know except through them\n\nWhen the People of Allah (أهل الله) saw that the Allusion (الإشارة) was accepted, they used it among themselves, but they clarified its meaning, its place, and its time. They do not use it among themselves or in their own souls except when sitting with someone who is not of their kind, or for a matter that arises in their souls.\n\nThe People of Allah (أهل الله) agreed upon technical terms (اصطلحوا على ألفاظ) that none know besides them, except through them, and they followed a method in it that others do not know, just as the Arabs followed in their speech the use of similes (التشبيهات) and metaphors (الاستعارات) so that they might understand one another. When they are alone with those of their own kind, they speak according to the matter as it is, using explicit textual declaration (بالنص الصريح). But if someone who is not of them is present, they speak among themselves using the terms they have agreed upon, so the foreign companion does not know what they are engaged in or what they are saying.\n\nOne of the most astonishing things about this Path (الطريقة)—and it is found only here—is that there is no group possessing knowledge, whether logicians, grammarians, engineers, mathematicians, educators, theologians, or philosophers, but that they have technical terms (اصطلاح) that an outsider cannot learn except by instruction from the Shaykh or one of its people; this is necessary. Except for the People of this Path (الطريقة) specifically. When the sincere seeker (المريد الصادق) enters it—and by this his sincerity is known to them—he has no prior knowledge of their technical terms. When Allah opens the eye of his understanding (عين فهمه) for him, and he takes from his Lord in his first taste (ذوقه), and he has no knowledge of their technical terms, nor does he know that a group of the People of Allah have agreed upon specific terms. Then, when he sits with them and they speak using their technical terms—those expressions that none know besides them or those who took them from them—this sincere seeker understands everything they are saying, as if he were the one who established that terminology. He participates with them in speaking with those terms and does not find it strange in himself. Rather, he finds the knowledge of it to be necessary (ضروريا), which he cannot repel, as if he had always known it, yet he does not know how he acquired it. The outsider from outside this group does not find this except through instruction. This, then, is the meaning of the Allusion (الإشارة) according to the People (القوم). They only speak with it in the presence of the Other (الغير) or in their writings and compositions, and nothing else. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "## باب چوونواں: اشارات (Al-Ishārāt) کی معرفت میں\n\n(بسم اللہ الرحمن الرحیم)\n\n> علمِ اشارہ قربت بھی ہے اور دوری بھی\n> اور اس کا سفر تجھ میں دن رات کی مسافت ہے\n\n> پس اس کی تحقیق کر، کیونکہ اللہ نے اسے بنایا ہے\n> اس شخص کے لیے جو اس کے ساتھ کفر اور الحاد (Ilḥād) کا رویہ رکھتا ہے\n\n> یہ اس شخص کی عصمت کی تنبیہ ہے جسے الٰہ نے کہا:\n> \"ہو جا\" (Kun)، تو وہ ہو گیا، اور لوگ گواہ ہیں\n\n### [اشیاء میں وجہِ حق (Wajh al-Ḥaqq) کے دیدار سے غیبت، عین بیماری ہے]\n\nجان لو، اللہ ہمیں اور تمہیں اپنی روح سے تائید بخشے، کہ اہلِ طریقِ حق (Ahl Ṭarīq Allāh) کے نزدیک اشارہ دوری یا غیر کی موجودگی کی خبر دیتا ہے۔ بعض شیوخ نے \"محاسن المجالس\" میں کہا ہے کہ اشارہ دوری کے سرے پر ایک پکار ہے اور علت (Al-ʿIlla) کے عین کا اظہار ہے۔ ان کا مطلب ہے کہ یہ بیماری کے واقع ہونے کا واضح اعلان ہے، کیونکہ علت (Al-ʿIlla) ایک بیماری ہے، اور یہی ہمارا قول ہے، یا غیر کی موجودگی۔ یہاں علت (Al-ʿIlla) سے مراد نہ تو سبب ہے اور نہ ہی وہ علت جس پر اہلِ نظر عقلاء نے اصطلاح قائم کی ہے۔ اس میں بیماری کی صورت یہ ہے کہ اشارہ کرنے والے سے اس غیر میں وجہِ حق (Wajh al-Ḥaqq) غائب ہو گیا ہے۔ اور جس سے اشیاء میں وجہِ حق (Wajh al-Ḥaqq) غائب ہو جائے، اس پر دعویٰ غالب آ جاتا ہے، اور دعویٰ ہی عین بیماری ہے۔\n\nاور محققین کے نزدیک یہ ثابت ہے کہ ہستی (Al-Wujūd) میں اللہ کے سوا کچھ نہیں ہے، اور اگرچہ ہم موجود ہیں، لیکن ہمارا وجود اسی کے ذریعے ہے، اور جس کا وجود اس کے غیر کے ذریعے ہو، وہ عدم کے حکم میں ہے۔ اور اشارہ ثابت ہو چکا ہے اور اس کا حکم ظاہر ہو چکا ہے، لہٰذا اس سے مراد کیا ہے، اس کا بیان ضروری ہے۔\n\n### [علماءِ رسوم (ʿUlamā’ ar-Rusūm) اور صوفیہ: علمِ ظاہر اور علمِ باطن]\n\nپس جان لو کہ جب اللہ عزوجل نے مخلوق کو پیدا کیا تو انسان کو مختلف اطوار میں پیدا کیا؛ ہم میں سے عالم بھی ہے اور جاہل بھی، منصف بھی ہے اور عناد رکھنے والا بھی، قاہر بھی ہے اور مقہور بھی، حاکم بھی ہے اور محکوم بھی، متحکم بھی ہے اور متحکم فیہ بھی، رئیس بھی ہے اور مرئوس بھی، امیر بھی ہے اور مامور بھی، بادشاہ بھی ہے اور عام رعایا بھی، حاسد بھی ہے اور محسود بھی۔ اور اللہ نے علماءِ رسوم (ʿUlamā’ ar-Rusūm) سے زیادہ سخت اور دشوار کسی کو اہلِ اللہ (Ahl Allāh) پر پیدا نہیں کیا، جو اس کی خدمت کے لیے مخصوص ہیں، اور جو وہبِ الٰہی (Al-Wahb al-Ilāhī) کے ذریعے اس کی معرفت (Al-Maʿrifa) رکھتے ہیں، جنہیں اس نے اپنی مخلوق میں اپنے اسرار عطا کیے اور اپنی کتاب کے معانی اور اپنے خطاب کے اشارات سمجھائے۔ پس یہ گروہ (علماءِ رسوم) اس طائفہ (اہلِ اللہ) کے لیے ایسے ہی ہیں جیسے رسولوں علیہم السلام کے لیے فرعون تھے۔ اور چونکہ موجودہ ہستی (Al-Wujūd) میں معاملہ اسی طرح ہے جیسا کہ علمِ قدیم میں گزر چکا ہے، ہمارے اصحاب نے اشارات کی طرف رجوع کیا، جیسا کہ مریم علیہا السلام نے اہلِ بہتان اور الحاد (Ilḥād) کی وجہ سے اشارے کی طرف رجوع کیا تھا۔\n\nپس ان (اہلِ اللہ) کا کلام، اللہ ان سے راضی ہو، اس کی عزیز کتاب کی شرح میں، جس پر:\n**\"باطل نہ اس کے آگے سے آ سکتا ہے اور نہ اس کے پیچھے سے\"** (لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ)\nاشارات ہیں، اگرچہ وہ حقیقت اور اس کے نفع بخش معانی کی تفسیر ہے۔ وہ اس سب کو اپنی جانوں کی طرف لوٹاتے ہیں، اس کے باوجود کہ وہ اسے عموم میں اور جس چیز میں وہ نازل ہوا ہے، اس میں بھی برقرار رکھتے ہیں، جیسا کہ اہلِ زبان جانتے ہیں جن کی زبان میں یہ کتاب نازل ہوئی ہے۔ پس اللہ سبحانہ نے ان کے نزدیک دونوں پہلوؤں کو عام کر دیا، جیسا کہ اس نے فرمایا:\n**\"ہم انہیں اپنی نشانیاں آفاق میں بھی دکھائیں گے اور ان کی اپنی جانوں میں بھی\"** (سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ)\nیعنی وہ نشانیاں جو آفاق میں اور ان کی جانوں میں نازل کی گئی ہیں۔\n\n### [اشارہ کے ذریعے تفسیر، صوفی کے اپنے باطن میں دیکھی ہوئی چیز کا بیان]\n\nپس ہر نازل شدہ آیت کے دو پہلو ہیں: ایک وہ پہلو جو وہ اپنی جانوں میں دیکھتے ہیں، اور دوسرا وہ پہلو جو وہ اس چیز میں دیکھتے ہیں جو ان سے باہر ہے۔ پس وہ اس چیز کو جو اپنی جانوں میں دیکھتے ہیں، اشارہ (Al-Ishāra) کا نام دیتے ہیں تاکہ فقیہ، جو صاحبِ رسوم ہے، اس سے مانوس ہو جائے، اور وہ اسے تفسیر نہیں کہتے، تاکہ ان کے شر اور کفر کے ساتھ ان کی بدنامی سے بچا جا سکے۔ اور یہ اس لیے ہے کہ وہ خطابِ حق کے مقامات سے ناواقف ہیں، اور انہوں نے اس میں سنتِ ہدایت کی پیروی کی ہے۔ کیونکہ اللہ قادر تھا کہ وہ ان چیزوں کو واضح طور پر بیان کر دیتا جن کی اہلِ اللہ (Ahl Allāh) نے اپنی کتاب میں تاویل کی ہے، لیکن اس نے ایسا نہیں کیا، بلکہ ان الٰہی کلمات میں، جو عام لوگوں کی زبان میں نازل ہوئے، اختصاصی معانی کے علوم کو شامل کر دیا، جنہیں اس کے بندوں نے اس وقت سمجھا جب اس نے انہیں وہ فہم (Al-Fahm) کی آنکھ عطا کی جو انہیں رزق میں ملی تھی۔\n\nاور اگر علماءِ رسوم (ʿUlamā’ ar-Rusūm) انصاف کرتے تو وہ اپنے آپ میں غور کرتے جب وہ آیت کو ظاہری آنکھ سے دیکھتے ہیں جسے وہ آپس میں تسلیم کرتے ہیں، تو وہ دیکھتے ہیں کہ وہ اس میں ایک دوسرے سے افضل ہیں اور اس آیت کے معنی پر کلام کرنے میں بعض دوسرے پر سبقت لے جاتے ہیں۔ اور وہ سب ایک ہی دھارے میں ہیں، اور اس فضیلت کے باوجود جو ان کے درمیان اس معاملے میں مشہود ہے، وہ اہلِ اللہ (Ahl Allāh) پر انکار کرتے ہیں جب وہ کوئی ایسی چیز لاتے ہیں جو ان کی ادراک سے پوشیدہ ہوتی ہے۔ اور یہ اس لیے ہے کہ وہ ان کے بارے میں یہ عقیدہ رکھتے ہیں کہ وہ عالم نہیں ہیں اور یہ کہ علم صرف اس قلم کے ذریعے حاصل ہوتا ہے جو عرف میں رائج ہے۔ اور انہوں نے سچ کہا، کیونکہ ہمارے اصحاب کو بھی یہ علم صرف تعلیم کے ذریعے ہی حاصل ہوا ہے، اور وہ تعلیم رحمانی ربانی ہے۔\n\nاللہ تعالیٰ نے فرمایا:\n**\"پڑھ اپنے رب کے نام سے جس نے پیدا کیا، انسان کو جمے ہوئے خون سے پیدا کیا، پڑھ اور تیرا رب سب سے زیادہ کرم والا ہے، جس نے قلم کے ذریعے سکھایا، انسان کو وہ سکھایا جو وہ نہیں جانتا تھا\"** (اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ * خَلَقَ الْإِنْسَانَ مِنْ عَلَقٍ * اقْرَأْ وَرَبُّكَ الْأَكْرَمُ * الَّذِي عَلَّمَ بِالْقَلَمِ * عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ)\nاور وہی فرمانے والا ہے:\n**\"اور اس نے تمہیں تمہاری ماؤں کے پیٹوں سے نکالا اس حال میں کہ تم کچھ نہیں جانتے تھے\"** (أَخْرَجَكُمْ مِنْ بُطُونِ أُمَّهَاتِكُمْ لَا تَعْلَمُونَ)\nاور اللہ تعالیٰ نے فرمایا:\n**\"اس نے انسان کو پیدا کیا، اسے بیان سکھایا\"** (خَلَقَ الْإِنْسَانَ عَلَّمَهُ الْبَيَانَ)\nپس وہ سبحانہ ہی انسان کو سکھانے والا ہے۔\n\n### [اہلِ اللہ (Ahl Allāh) علم، ہدایت اور حکمت میں انبیاء کے وارث ہیں]\n\nپس ہمیں کوئی شک نہیں کہ اہلِ اللہ (Ahl Allāh) رسولوں علیہم السلام کے وارث ہیں۔ اور اللہ رسول کے حق میں فرماتا ہے:\n**\"اور اس نے تمہیں وہ سکھایا جو تم نہیں جانتے تھے\"** (وَعَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ)\nاور عیسیٰ علیہ السلام کے حق میں فرمایا:\n**\"اور وہ اسے کتاب اور حکمت اور تورات اور انجیل سکھائے گا\"** (وَيُعَلِّمُهُ الْكِتَابَ وَالْحِكْمَةَ وَالتَّوْرَاةَ وَالْإِنْجِيلَ)\nاور موسیٰ علیہ السلام کے ساتھی خضر علیہ السلام کے حق میں فرمایا:\n**\"اور ہم نے اسے اپنے پاس سے علم سکھایا تھا\"** (وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْمًا)\nپس علماءِ رسوم (ʿUlamā’ ar-Rusūm) نے ہمارے نزدیک اس بات میں سچ کہا کہ علم صرف تعلیم سے ہی ہوتا ہے، لیکن وہ اس عقیدے میں غلطی کر گئے کہ اللہ اسے نہیں سکھاتا جو نبی یا رسول نہیں ہے۔ اللہ فرماتا ہے:\n**\"وہ جسے چاہتا ہے حکمت عطا کرتا ہے\"** (يُؤْتِي الْحِكْمَةَ مَنْ يَشَاءُ)\nاور حکمت سے مراد علم ہے، اور \"من\" (جسے) نکرہ (عام) آیا ہے۔ لیکن علماءِ رسوم (ʿUlamā’ ar-Rusūm) نے جب دنیا کو آخرت پر ترجیح دی اور خلق کے پہلو کو حق کے پہلو پر ترجیح دی، اور کتابوں سے اور اپنی جنس کے لوگوں کے منہ سے علم لینے کے عادی ہو گئے، اور اپنے گمان میں یہ سمجھا کہ وہ اپنے علم کی وجہ سے اور عام لوگوں سے ممتاز ہونے کی وجہ سے اہلِ اللہ (Ahl Allāh) میں سے ہیں، تو اس چیز نے انہیں اس بات کے جاننے سے روک دیا کہ اللہ کے ایسے بندے بھی ہیں جن کی تعلیم کا ذمہ اللہ نے خود ان کے باطن میں لیا ہے، اس چیز کے ذریعے جو اس نے اپنی کتابوں میں اور اپنے رسولوں کی زبانوں پر نازل کیا، اور یہی صحیح علم ہے جو اس عالم و معلم کی طرف سے ہے جس کے علم کی کاملیت میں نہ کوئی مومن شک کرتا ہے اور نہ کوئی غیر مومن۔\n\nکیونکہ جن لوگوں نے کہا کہ اللہ جزئیات کو نہیں جانتا، ان کا مقصد اس سے علم کی نفی کرنا نہیں تھا، بلکہ ان کا مقصد یہ تھا کہ اللہ تعالیٰ کے لیے کسی چیز کا علم نیا نہیں ہوتا، بلکہ ان کا علم اس کے کلیات کے علم میں شامل ہے۔ پس انہوں نے اللہ سبحانہ کے لیے علم ثابت کیا، باوجود اس کے کہ وہ مومن نہیں تھے، اور ان کا مقصد اس میں اللہ سبحانہ کی تنزیہ تھا، اگرچہ وہ اس کے اظہار میں غلطی کر گئے۔ پس اللہ نے اپنی عنایت سے اپنے بعض بندوں کی تعلیم کا ذمہ خود لیا، انہیں الہام (Ilhām) اور فہم (Al-Fahm) کے ذریعے سمجھایا۔ پس اس نے اسے اس کی بدکاری اور پرہیزگاری کا الہام کیا، اس کے اس قول کے بعد:\n**\"اور جان کی قسم اور اس کی جس نے اسے درست کیا، پھر اسے اس کی بدکاری اور پرہیزگاری کا الہام کیا\"** (وَنَفْسٍ وَمَا سَوَّاهَا * فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا)\nپس اللہ نے اسے فجور (بدکاری) اور تقویٰ (پرہیزگاری) میں فرق الہاماً بتا دیا تاکہ وہ فجور سے بچے اور تقویٰ پر عمل کرے۔\n\n### [انبیاء پر کتاب کا نزول اور اولیاء کے دلوں پر فہم (Al-Fahm) کا نزول]\n\nجیسا کہ کتاب کا اصل نزول اللہ کی طرف سے اس کے انبیاء پر تھا، اسی طرح فہم (Al-Fahm) کا نزول اللہ کی طرف سے اس کے بعض مومن بندوں کے دلوں پر ہے۔ پس انبیاء علیہم السلام نے اللہ پر وہ بات نہیں کہی جو اس نے انہیں نہیں کہی، اور نہ ہی انہوں نے اسے اپنی جانوں یا اپنے افکار سے نکالا، اور نہ ہی اس میں تکلف کیا، بلکہ وہ اسے اللہ کی طرف سے لائے، جیسا کہ اللہ تعالیٰ نے فرمایا:\n**\"یہ ایک حکیم و حمید کی طرف سے نازل کیا گیا ہے\"** (تَنْزِيلٌ مِنْ حَكِيمٍ حَمِيدٍ)\nاور اس کے بارے میں فرمایا کہ:\n**\"باطل نہ اس کے آگے سے آ سکتا ہے اور نہ اس کے پیچھے سے\"** (لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ)\nاور جب اصل کلام جس کے بارے میں بات کی جا رہی ہے، وہ اللہ کی طرف سے ہے، نہ کہ انسان کے فکر اور غور و خوض سے، اور علماءِ رسوم (ʿUlamā’ ar-Rusūm) یہ جانتے ہیں، تو اہلِ اللہ (Ahl Allāh) جو اس پر عمل کرتے ہیں، وہ علماءِ رسوم کے مقابلے میں اس کی شرح اور اس میں جو کچھ اللہ نے نازل کیا ہے، اس کے بیان کے زیادہ حقدار ہیں۔ پس اس کی شرح بھی اللہ کی طرف سے اہلِ اللہ (Ahl Allāh) کے دلوں پر نزول ہو گی، جیسا کہ اصل تھا۔ اور اسی طرح علی بن ابی طالب رضی اللہ عنہ نے اس باب میں فرمایا: \"یہ کچھ نہیں ہے مگر ایک فہم (Al-Fahm) ہے جو اللہ اپنے بندوں میں سے جسے چاہتا ہے اس قرآن میں عطا کرتا ہے۔\"\n\nپس انہوں نے اسے اللہ کی طرف سے ایک عطا قرار دیا، اور اس عطا کو اللہ کی طرف سے فہم (Al-Fahm) سے تعبیر کیا۔ لہٰذا اہلِ اللہ (Ahl Allāh) اس کے دوسروں سے زیادہ حقدار ہیں۔\n\n### [دنیاوی زندگی میں غلبہ علماءِ رسوم (ʿUlamā’ ar-Rusūm) کے اہلِ ظاہر کے لیے ہے]\n\nجب اہلِ اللہ (Ahl Allāh) نے دیکھا کہ اللہ نے دنیاوی زندگی میں غلبہ علماءِ رسوم (ʿUlamā’ ar-Rusūm) کے اہلِ ظاہر کو دیا ہے، اور انہیں اپنے فتووں کے ذریعے مخلوق پر اختیار دیا ہے، اور انہیں ان لوگوں کے ساتھ شامل کر دیا ہے جو:\n**\"دنیاوی زندگی کا صرف ظاہری پہلو جانتے ہیں، اور وہ آخرت سے غافل ہیں\"** (يَعْلَمُونَ ظَاهِرًا مِنَ الْحَيَاةِ الدُّنْيَا وَهُمْ عَنِ الْآخِرَةِ هُمْ غَافِلُونَ)\nاور وہ اہلِ اللہ (Ahl Allāh) پر اپنے انکار میں:\n**\"یہ گمان کرتے ہیں کہ وہ اچھا کام کر رہے ہیں\"** (يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا)،\nتو اہلِ اللہ نے ان کے احوال کو ان کے حوالے کر دیا، کیونکہ وہ جانتے تھے کہ وہ کہاں سے بات کر رہے ہیں۔ اور انہوں نے حقائق کو اشارات (Al-Ishārāt) کا نام دے کر اپنے آپ کو ان سے محفوظ رکھا۔ کیونکہ علماءِ رسوم (ʿUlamā’ ar-Rusūm) اشارات (Al-Ishārāt) کا انکار نہیں کرتے۔ پس جب کل قیامت کا دن ہو گا تو سب کا معاملہ ایسا ہو گا جیسا کہ کہنے والے نے کہا:\n\n> جلد ہی تم دیکھو گے جب غبار چھٹے گا\n> کہ تمہارے نیچے گھوڑا ہے یا گدھا\n\nجیسا کہ کل قیامت کے دن اہلِ اللہ (Ahl Allāh) میں سے محقق، اہلیت کے دعویدار سے ممتاز ہو جائے گا۔ بعض نے کہا ہے:\n\n> جب رخساروں پر آنسو گڈمڈ ہو جائیں گے\n> تو معلوم ہو جائے گا کہ کون رویا اور کون رونے کی نقل کر رہا تھا\n\nعلی بن ابی طالب رضی اللہ عنہ کے اس قول کے مقابلے میں عالمِ رسوم (ʿUlamā’ ar-Rusūm) کہاں کھڑا ہے، جب انہوں نے اپنے بارے میں خبر دی کہ اگر وہ قرآن کی سورۃ الفاتحہ پر کلام کریں تو اس سے ستر اونٹوں کا بوجھ لاد دیا جائے؟ کیا یہ اس فہم (Al-Fahm) کے سوا کچھ اور ہے جو اللہ نے انہیں قرآن میں عطا کیا؟ پس فقیہ کا نام اس طائفہ (اہلِ اللہ) کے لیے صاحبِ علمِ رسوم (ʿUlamā’ ar-Rusūm) سے زیادہ موزوں ہے۔ کیونکہ اللہ ان کے بارے میں فرماتا ہے:\n**\"تاکہ وہ دین میں گہری سمجھ حاصل کریں اور جب وہ اپنی قوم کی طرف لوٹیں تو انہیں ڈرائیں، تاکہ وہ بچیں\"** (لِيَتَفَقَّهُوا فِي الدِّينِ وَلِيُنْذِرُوا قَوْمَهُمْ إِذَا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ)\nپس اللہ نے انہیں دین میں گہری سمجھ (تفقه) اور ڈرانے کے معاملے میں رسول کے مقام پر کھڑا کیا، اور وہ (اہلِ اللہ) وہ ہیں جو: **\"اللہ کی طرف بصیرت (Al-Baṣīra) کے ساتھ بلاتے ہیں\"** (يَدْعُو إِلَى اللَّهِ عَلَى بَصِيرَةٍ)، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم بصیرت (Al-Baṣīra) کے ساتھ بلاتے ہیں، نہ کہ غلبہِ ظن پر، جیسا کہ عالمِ رسوم (ʿUlamā’ ar-Rusūm) حکم لگاتا ہے۔ پس اس شخص میں کتنا فرق ہے جو اپنے فتوے اور قول میں اللہ کی طرف بلانے میں بصیرت (Al-Baṣīra) پر ہے، اور وہ: **\"اپنے رب کی طرف سے واضح دلیل پر ہے\"** (عَلَى بَيِّنَةٍ مِنْ رَبِّهِ)، اور اس شخص میں جو دینِ خدا میں اپنے غلبہِ ظن سے فتویٰ دیتا ہے۔\n\n### [مردہ سے لیا گیا علم اور اس زندہ سے لیا گیا علم جو کبھی نہیں مرتا]\n\nپھر عالمِ رسوم (ʿUlamā’ ar-Rusūm) کی عادت یہ ہے کہ وہ اپنے دفاع میں اس شخص کو جاہل قرار دیتا ہے جو کہتا ہے کہ میرے رب نے مجھے سمجھایا، اور وہ خود کو اس سے افضل اور صاحبِ علم سمجھتا ہے، جب کہ اہلِ اللہ (Ahl Allāh) میں سے کوئی کہتا ہے کہ اللہ نے میرے باطن میں اس آیت کے اس حکم کے بارے میں اپنی مراد ڈالی، یا وہ کہتا ہے کہ میں نے اپنے واقعہ (خواب یا کشف) میں رسول اللہ صلی اللہ علیہ وسلم کو دیکھا، تو انہوں نے مجھے اس مروی خبر کی صحت اور اس کے حکم سے آگاہ کیا۔\n\nابو یزید بسطامی رضی اللہ عنہ نے اس مقام اور اس کی صحت کے بارے میں علماءِ رسوم (ʿUlamā’ ar-Rusūm) کو مخاطب کرتے ہوئے فرمایا: \"تم نے اپنا علم مردہ سے مردہ کے واسطے سے لیا، اور ہم نے اپنا علم اس زندہ سے لیا جو کبھی نہیں مرتا۔\" ہمارے جیسے لوگ کہتے ہیں: \"میرے دل نے میرے رب سے بیان کیا،\" اور تم کہتے ہو: \"مجھے فلاں نے بیان کیا، اور وہ کہاں ہے؟\" وہ کہتے ہیں: \"وہ فلاں سے روایت کر کے مر گیا، اور وہ کہاں ہے؟\" وہ کہتے ہیں: \"وہ مر گیا۔\"\n\nاور شیخ ابو مدین رحمہ اللہ جب ان سے کہا جاتا کہ فلاں نے فلاں سے فلاں کے واسطے سے کہا، تو وہ فرماتے: \"ہم سوکھا گوشت نہیں کھانا چاہتے، تازہ گوشت لاؤ۔\" وہ اپنے اصحاب کے حوصلے بلند کرتے ہوئے کہتے: \"یہ فلاں کا قول ہے، تم نے کیا کہا؟ اللہ نے تمہیں اپنے لدنی علم (Al-ʿIlm al-Ladunnī) کی عطا سے کیا خاص کیا ہے؟ یعنی اپنے رب سے بیان کرو اور فلاں اور فلاں کو چھوڑ دو، کیونکہ ان لوگوں نے اسے تازہ گوشت کی طرح کھایا تھا، اور عطا کرنے والا مرا نہیں ہے، اور وہ تمہاری: **\"شہ رگ سے بھی زیادہ قریب ہے\"** (حَبْلِ الْوَرِيدِ)۔\n\n### [فیضِ الٰہی (Al-Fayḍ al-Ilāhī) دائمی ہے اور مبشرات نبوت کے اجزاء میں سے ہیں]\n\nاور فیضِ الٰہی (Al-Fayḍ al-Ilāhī) اور مبشرات (خوشخبریاں) کا دروازہ بند نہیں ہوا، اور یہ نبوت کے اجزاء میں سے ہیں۔ اور راستہ واضح ہے، اور دروازہ کھلا ہے، اور عمل مشروع ہے۔ اور اللہ اس شخص سے ملنے کے لیے دوڑتا ہے جو اس کی طرف چل کر آتا ہے۔ اور:\n**\"تین آدمیوں کی کوئی سرگوشی نہیں ہوتی مگر وہ ان کا چوتھا ہوتا ہے، اور وہ ان کے ساتھ ہوتا ہے جہاں کہیں بھی وہ ہوں\"** (مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَهُوَ مَعَهُمْ أَيْنَ مَا كَانُوا)\nپس جو تمہارے ساتھ قربت کے اس مقام پر ہو، اور تم اس کے علم اور ایمان کا دعویٰ بھی کرتے ہو، تو تم اس سے علم لینا اور اس سے بات کرنا کیوں چھوڑ دیتے ہو، اور اس کے غیر سے لیتے ہو اور اس سے نہیں لیتے؟ تم اپنے رب کے ساتھ نئے عہد والے ہو جاؤ، بارش تمہارے مرتبے سے اوپر ہو گی۔\n\nجہاں رسول اللہ صلی اللہ علیہ وسلم خود اس کی طرف نکلے جب وہ نازل ہوئی اور اپنے سر سے کپڑا ہٹا دیا یہاں تک کہ پانی آپ کو لگا۔ جب آپ سے اس بارے میں پوچھا گیا تو آپ نے فرمایا: **\"یہ اپنے رب کے ساتھ نئے عہد والی ہے\"** (یعنی تازہ نازل ہوئی ہے)۔\n\nیہ ہمیں تعلیم دینے اور متنبہ کرنے کے لیے ہے۔\n\n### [کتاب اللہ کی شرح میں صوفیہ کے اشارات (Al-Ishārāt)]\n\nپھر تمہیں معلوم ہونا چاہیے کہ ہمارے اصحاب نے کتاب اللہ کی شرح میں جو کچھ لائے ہیں، اسے دوسرے الفاظ کے بجائے اشارہ (Al-Ishāra) پر صرف ایک الٰہی تعلیم کے ذریعے اصطلاحاً استعمال کیا ہے، جسے علماءِ رسوم (ʿUlamā’ ar-Rusūm) نہیں جانتے۔ اور یہ اس لیے کہ اشارہ صرف اشارہ کرنے والے کے اس ارادے سے ہوتا ہے کہ وہ اشارہ کر رہا ہے، نہ کہ مشار الیہ (جس کی طرف اشارہ کیا گیا) کی طرف سے۔ اور جب تم ان سے اشارے سے ان کی مراد کی شرح پوچھو گے، تو وہ اسے علماءِ رسوم (ʿUlamā’ ar-Rusūm) میں سے سائل کے نزدیک غالب (عام) معنی پر جاری کر دیں گے۔\n\nاس کی مثال یہ ہے کہ ایک شخص کسی ایسے معاملے میں ہو جس سے اس کا سینہ تنگ ہو، اور وہ اس کے بارے میں سوچ رہا ہو۔ پھر ایک آدمی دوسرے آدمی کو پکارتا ہے جس کا نام فرج (کشائش) ہے، اور کہتا ہے: \"یا فرج!\" تو یہ شخص جس کا سینہ تنگ ہے، اسے سنتا ہے اور خوش ہوتا ہے اور کہتا ہے: \"ان شاء اللہ اللہ کی طرف سے فرج (کشائش) آ گئی،\" یعنی اس تنگی سے جو اسے لاحق ہے۔ اور اس کا سینہ کھل جاتا ہے۔\n\nجیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے مشرکین سے صلح کے وقت کیا جب انہوں نے آپ کو بیت اللہ سے روکا۔ ایک مشرک آیا جس کا نام سہیل (آسان) تھا۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"معاملہ آسان ہو گیا\" (سہل الأمر)۔ آپ نے اسے فال کے طور پر لیا، اور ایسا ہی ہوا جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فال لی تھی، اور سہیل کے ہاتھ پر معاملہ منظم ہو گیا۔\n\nاور اس کے باپ کا یہ ارادہ نہیں تھا جب اس نے اس کا نام رکھا، بلکہ اس نے اسے ایک ایسا نام دیا جس سے وہ دوسروں سے پہچانا جائے۔ اگرچہ اس کے باپ کا مقصد اپنے بیٹے کا نام اچھا رکھنے کے سوا کچھ نہیں تھا۔\n\n### [اہلِ اللہ (Ahl Allāh) کی ان الفاظ پر اصطلاح جنہیں ان کے سوا کوئی نہیں جانتا مگر ان کے ذریعے]\n\nاور جب اہلِ اللہ (Ahl Allāh) نے دیکھا کہ اشارہ (Al-Ishāra) کو معتبر سمجھا گیا ہے، تو انہوں نے اسے آپس میں استعمال کیا، لیکن انہوں نے اس کا معنی، اس کا مقام اور اس کا وقت بیان کر دیا۔ پس وہ اسے آپس میں یا اپنی جانوں میں استعمال نہیں کرتے مگر جب ان کے ساتھ کوئی ایسا شخص بیٹھا ہو جو ان کی جنس سے نہ ہو، یا کسی ایسے معاملے کے لیے جو ان کے دلوں میں ہو۔\n\nاور اہلِ اللہ (Ahl Allāh) نے ایسے الفاظ پر اصطلاح قائم کی جنہیں ان کے سوا کوئی نہیں جانتا مگر ان کے ذریعے، اور انہوں نے اس میں ایک ایسا طریقہ اختیار کیا جسے ان کے علاوہ کوئی نہیں جانتا، جیسا کہ عربوں نے اپنے کلام میں تشبیہات اور استعارات کا طریقہ اختیار کیا تاکہ وہ ایک دوسرے کو سمجھ سکیں۔ پس جب وہ اپنی جنس کے لوگوں کے ساتھ تنہا ہوتے ہیں تو صریح نص کے ساتھ اس بات پر کلام کرتے ہیں جو حقیقت میں ہے۔ اور جب ان کے ساتھ کوئی ایسا شخص موجود ہوتا ہے جو ان میں سے نہیں ہوتا، تو وہ آپس میں ان الفاظ کے ساتھ بات کرتے ہیں جن پر انہوں نے اصطلاح قائم کی ہے، تو اجنبی ہم نشین نہیں جانتا کہ وہ کس حال میں ہیں اور کیا کہہ رہے ہیں۔\n\nاور اس طریق (طریقت) کی سب سے عجیب چیزوں میں سے، جو صرف اسی میں پائی جاتی ہے، یہ ہے کہ منطقیوں، نحویوں، اہلِ ہندسہ، حساب، تعلیم، متکلمین اور فلاسفہ میں سے کوئی بھی ایسا گروہ نہیں جو علم رکھتا ہو مگر ان کی ایک اصطلاح ہوتی ہے جسے ان میں داخل ہونے والا شخص شیخ یا اس کے اہلِ خانہ کی رہنمائی کے بغیر نہیں جان سکتا، یہ ضروری ہے۔ سوائے اس طریق (طریقت) کے اہلِ خانہ کے۔ جب کوئی سچا مرید (Murīd) اس میں داخل ہوتا ہے، اور اسی سے ان کے نزدیک اس کی سچائی معلوم ہوتی ہے، اور اسے ان اصطلاحات کی کوئی خبر نہیں ہوتی جن پر انہوں نے اتفاق کیا ہے۔ پس جب اللہ اس کے لیے فہم (Al-Fahm) کی آنکھ کھول دیتا ہے اور وہ اپنے پہلے ذوق (Dhawq) میں اپنے رب سے علم لیتا ہے، اور اسے ان اصطلاحات کی کوئی خبر نہیں ہوتی، اور نہ ہی اسے معلوم ہوتا ہے کہ اہلِ اللہ (Ahl Allāh) کے ایک گروہ نے مخصوص الفاظ پر اصطلاح قائم کی ہے۔ پس جب وہ ان کے ساتھ بیٹھتا ہے اور وہ ان الفاظ پر اپنی اصطلاح کے ساتھ بات کرتے ہیں جنہیں ان کے سوا کوئی نہیں جانتا یا جس نے ان سے لیا ہے، تو یہ سچا مرید (Murīd) ان تمام باتوں کو سمجھ جاتا ہے جو وہ کرتے ہیں، یہاں تک کہ گویا وہ خود اس اصطلاح کو وضع کرنے والا ہے۔ اور وہ ان کے ساتھ ان الفاظ میں بات کرنے میں شریک ہوتا ہے، اور اسے اپنے آپ پر کوئی تعجب نہیں ہوتا، بلکہ وہ اس علم کو ضروری پاتا ہے جسے وہ دفع نہیں کر سکتا، اور گویا وہ اسے ہمیشہ سے جانتا تھا، اور اسے معلوم نہیں ہوتا کہ یہ اسے کیسے حاصل ہوا۔ اور اس طائفہ سے باہر کا داخل ہونے والا شخص اسے صرف رہنمائی کے ذریعے ہی پاتا ہے۔ پس اہلِ اللہ (Ahl Allāh) کے نزدیک اشارہ (Al-Ishāra) کا یہی معنی ہے، اور وہ اس کے ساتھ بات نہیں کرتے مگر غیر کی موجودگی میں یا اپنی تالیفات اور تصنیفات میں، بس۔ اور اللہ:\n**\"حق فرماتا ہے اور وہی راستہ دکھاتا ہے\"** (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)",
    "fa": "باب پنجاه و چهارم در معرفت اشارات\n\nبه نام خداوند بخشنده مهربان\n\nعلم اشاره، نزدیک کردن و دور ساختن است؛ و سیر آن در تو، بازگشت و شب‌روی است.\n\nپس در پی آن باش، زیرا خداوند آن را برای کسی که به آن قیام کند، دروغ و کفر (إفك وإلحاد) قرار داده است.\nاین تنبیهی است برای عصمت کسی که خداوند به او گفت: «باش»، پس او موجود شد، در حالی که قوم شاهد بودند.\n\n### [غیبت از رؤیت وجه حق در اشیاء، عین بیماری است]\n\nبدان، خداوند ما و تو را به روحی از جانب خود تأیید کند، که اشاره نزد اهل طریق حق (أهل طريق الله) خبر از دوری یا حضور غیر می‌دهد. برخی از شیوخ در «محاسن المجالس» گفته‌اند: «اشاره، ندایی است بر سرِ دوری و افشای عینِ علت.» منظور او این است که این تصریح به وقوع بیماری است، زیرا علت همان بیماری است، و آن همان قول ماست: «حضور غیر». و منظور او از علت در اینجا نه سبب است و نه علتی که عقلا از اهل نظر بر آن اصطلاح کرده‌اند. و صورت بیماری در آن این است که مُشیر (اشاره‌کننده) از دیدن وجه حق (وجه الحق) در آن غیر غایب شده است. و کسی که وجه حق در اشیاء از او غایب شود، دعوی در او جای می‌گیرد، و دعوی عین بیماری است. و نزد محققان ثابت شده است که در هستی (الوجود) جز حق (الحق) نیست. و ما اگرچه موجودیم، وجود ما تنها به واسطه اوست. و کسی که وجودش به غیر او باشد، در حکم عدم است. و اشاره ثابت شده و حکم آن ظاهر گشته است، پس ناگزیر باید آنچه مراد از آن است بیان شود.\n\n### [علمای رسوم و صوفیه: علم ظاهر و علم باطن]\n\nپس بدان که چون خداوند عز و جل خلق را آفرید، انسان را در اطوار مختلف آفرید: از ماست عالم و جاهل، منصف و معاند، قاهر و مقهور، حاکم و محکوم، متحکم و متحکم‌فیه، رئیس و مرئوس، امیر و مأمور، ملک و رعیت، و حاسد و محسود. و خداوند هیچ کس را سخت‌تر و دشوارتر از علمای رسوم (علماء الرسوم) بر اهل الله که به خدمت او اختصاص یافته‌اند و از طریق موهبت الهی (الوهب الإلهي) او را شناخته‌اند، نیافریده است؛ کسانی که خداوند اسرار خود را در خلقش به آنان بخشیده و معانی کتاب و اشارات خطابش را به ایشان فهمانده است. این طایفه (علمای رسوم) برای اهل الله مانند فرعون‌ها برای رسولان علیهم السلام هستند. و چون امر در هستی (الوجود) واقع بر اساس علم قدیم الهی بود، همان‌طور که ذکر کردیم، اصحاب ما به اشارات روی آوردند، همان‌طور که مریم علیها السلام به خاطر اهل دروغ و کفر (أهل الإفك والإلحاد) به اشاره روی آورد. پس کلام ایشان (رضی الله عنهم) در شرح کتاب عزیز خداوند که: «باطل از پیش رو و از پشت سر به آن راه نمی‌یابد» (لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ)، اشارات است، اگرچه آن حقیقت و تفسیری برای معانی سودمند آن است. و ایشان همه آن را به نفوس خود باز می‌گردانند، در عین حال که آن را در عموم و در مورد نزولش نیز تأیید می‌کنند، همان‌طور که اهل زبان که کتاب به زبان ایشان نازل شده است، می‌دانند. پس خداوند سبحان نزد ایشان هر دو وجه را شامل کرده است، چنانکه می‌فرماید: «به زودی آیات خود را در آفاق و در نفوسشان به ایشان نشان خواهیم داد» (سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ)؛ یعنی آیاتی که در آفاق و در نفوسشان نازل شده است.\n\n### [تفسیر به اشاره، روایتی از آنچه صوفی در نفس خود می‌بیند]\n\nپس هر آیه نازل شده‌ای دو وجه دارد: وجهی که آن را در نفوس خود می‌بینند و وجه دیگری که آن را در آنچه خارج از ایشان است می‌بینند. آنچه را که در نفوس خود می‌بینند، اشاره می‌نامند تا فقیه صاحب رسوم (صاحب الرسوم) با آن مأنوس شود و در این باره نمی‌گویند که این تفسیر است، تا از شرّ و تکفیر ایشان در امان باشند. و این به دلیل جهل آنان به مواضع خطاب حق است. و ایشان در این کار از سنت‌های هدایت پیروی کرده‌اند، زیرا خداوند قادر بود که آنچه را اهل الله تأویل کرده‌اند، در کتابش به صراحت بیان کند، با این حال چنین نکرد، بلکه در آن کلمات الهی که به زبان عامه نازل شد، علوم معانی اختصاصی را گنجاند که بندگانش هنگام گشودن چشم فهمی که به ایشان روزی داده بود، آن را درک کردند. و اگر علمای رسوم (علماء الرسوم) انصاف داشتند، در نفوس خود تأمل می‌کردند؛ هنگامی که به آیه با چشم ظاهری که در میان خود می‌پذیرند، می‌نگرند، می‌بینند که در آن بر یکدیگر برتری می‌یابند و برخی در سخن گفتن درباره معنای آن آیه بر دیگری فائق می‌آیند، و فرد قاصر به فضل غیر قاصر در آن اقرار می‌کند، در حالی که همه در یک مسیر هستند. با وجود این فضل مشهود در میان خودشان، بر اهل الله خرده می‌گیرند، هنگامی که ایشان چیزی می‌آورند که از درک آنان پنهان است. و این بدان سبب است که آنان معتقدند که اهل الله عالم نیستند و علم جز با قلمی که در عرف معمول است، حاصل نمی‌شود. و راست گفته‌اند، زیرا اصحاب ما آن علم را جز با تعلم (آموختن) به دست نیاورده‌اند، و آن همان آگاهی‌بخشی رحمانی ربانی است. خداوند متعال می‌فرماید: «بخوان به نام پروردگارت که آفرید، انسان را از علق آفرید. بخوان و پروردگار تو کریم‌ترین است، کسی که با قلم آموخت، به انسان آنچه را نمی‌دانست، آموخت» (اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ * خَلَقَ الْإِنْسَانَ مِنْ عَلَقٍ * اقْرَأْ وَرَبُّكَ الْأَكْرَمُ * الَّذِي عَلَّمَ بِالْقَلَمِ * عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ). و اوست که می‌فرماید: «شما را از شکم مادرانتان بیرون آورد در حالی که چیزی نمی‌دانستید» (أَخْرَجَكُمْ مِنْ بُطُونِ أُمَّهَاتِكُمْ لَا تَعْلَمُونَ). و می‌فرماید: «انسان را آفرید، بیان را به او آموخت» (خَلَقَ الْإِنْسَانَ * عَلَّمَهُ الْبَيَانَ). پس او سبحانه معلم انسان است.\n\n### [اهل الله وارثان انبیاء در علم و هدایت و حکمت هستند]\n\nپس ما شک نداریم که اهل الله وارثان رسولان علیهم السلام هستند. و خداوند در حق رسول می‌فرماید: «و آنچه را نمی‌دانستی به تو آموخت» (وَعَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ). و در حق عیسی می‌فرماید: «و به او کتاب و حکمت و تورات و انجیل را می‌آموزد» (وَيُعَلِّمُهُ الْكِتَابَ وَالْحِكْمَةَ وَالتَّوْرَاةَ وَالْإِنْجِيلَ). و در حق خضر، مصاحب موسی علیه السلام، می‌فرماید: «و از نزد خود به او علمی آموختیم» (وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْمًا). پس علمای رسوم (علماء الرسوم) در این قولشان که علم جز با تعلم (آموختن) حاصل نمی‌شود، نزد ما راست گفته‌اند، اما در اعتقادشان مبنی بر اینکه خداوند به کسی که نبی یا رسول نیست، علم نمی‌آموزد، خطا کرده‌اند. خداوند می‌فرماید: «حکمت را به هر که بخواهد می‌دهد» (يُؤْتِي الْحِكْمَةَ مَنْ يَشَاءُ) و حکمت همان علم است، و با کلمه «مَن» (هر که) آمده که نکره است (عمومیت دارد). اما علمای رسوم چون دنیا را بر آخرت ترجیح دادند و جانب خلق را بر جانب حق مقدم شمردند و به گرفتن علم از کتاب‌ها و از دهان مردانی از جنس خود عادت کردند و به گمان خود دیدند که به واسطه علمی که دارند و به آن از عوام متمایز شده‌اند، از اهل الله هستند، این امر آنان را از دانستن این حقیقت محجوب ساخت که خداوند بندگانی دارد که خود تعلیم آنان را در سرّشان بر عهده گرفته است، با آنچه در کتاب‌هایش و بر زبان رسولانش نازل کرده است. و این همان علم صحیح است از جانب عالمِ معلمی که هیچ مؤمنی در کمال علم او شک ندارد، و حتی غیر مؤمن نیز شک ندارد. زیرا کسانی که گفتند خداوند جزئیات را نمی‌داند، قصدشان نفی علم از او نسبت به جزئیات نبود، بلکه منظورشان این بود که برای او علم جدیدی نسبت به چیزی حاصل نمی‌شود، بلکه علم به جزئیات در علم او به کلیات مندرج است. پس آنان برای خداوند سبحان علم را اثبات کردند، با وجود اینکه مؤمن نبودند، و قصدشان تنزیه خداوند سبحان در این باره بود، اگرچه در بیان آن خطا کردند. پس خداوند با عنایت خود، تعلیم برخی از بندگانش را شخصاً بر عهده گرفت، با الهام و تفهیم به ایشان. پس «فجور و تقوای آن را به او الهام کرد» (فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا) در پی این قول که: «و قسم به نفس و آنکه آن را سامان داد» (وَنَفْسٍ وَمَا سَوَّاهَا). پس فجور را از تقوا برای نفس بیان کرد، به صورت الهامی از جانب خداوند برای آن، تا از فجور دوری کند و به تقوا عمل نماید.\n\n### [نزول کتاب بر انبیاء و نزول فهم بر قلوب اولیاء]\n\nهمان‌طور که اصل نزول کتاب از جانب خداوند بر پیامبرانش بود، نزول فهم نیز از جانب خداوند بر قلب‌های برخی از مؤمنان به اوست. پیامبران علیهم السلام چیزی را که خداوند به ایشان نگفته بود، بر او نگفتند و آن را از نفوس یا افکار خود بیرون نیاوردند و در آن تکلف نکردند، بلکه آن را از نزد خداوند آوردند، چنانکه می‌فرماید: «نازل شده از جانب حکیم ستوده» (تَنْزِيلٌ مِنْ حَكِيمٍ حَمِيدٍ). و درباره آن می‌فرماید: «باطل از پیش رو و از پشت سر به آن راه نمی‌یابد» (إِنَّهُ لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ). و چون اصلِ مورد بحث از نزد خداوند است، نه از فکر و اندیشه انسان، و علمای رسوم (علماء الرسوم) این را می‌دانند، پس اهل الله که به آن عمل می‌کنند، سزاوارترند به شرح آن و بیان آنچه خداوند در آن نازل کرده است، تا علمای رسوم. پس شرح آن نیز باید تنزیلی از نزد خداوند بر قلب‌های اهل الله باشد، همان‌طور که اصل آن چنین بود. و همچنین است قول علی بن ابی طالب (رضی الله عنه) در این باب: «این چیزی نیست جز فهمی که خداوند به هر که از بندگانش بخواهد، در این قرآن عطا می‌کند.» پس او این را عطایی از جانب خداوند قرار داد که با «فهم از جانب خدا» از آن عطیه تعبیر می‌شود. پس اهل الله سزاوارتر به آن هستند تا دیگران.\n\n### [دولت در زندگی دنیا از آن اهل ظاهر از علمای رسوم است]\n\nچون اهل الله دیدند که خداوند در زندگی دنیا، دولت را برای اهل ظاهر از علمای رسوم (علماء الرسوم) قرار داده و به آنان تسلط بر خلق را از طریق فتواهایشان بخشیده و آنان را به کسانی ملحق کرده است که: «ظاهری از زندگی دنیا را می‌دانند و آنان از آخرت غافلند» (يَعْلَمُونَ ظَاهِرًا مِنَ الْحَيَاةِ الدُّنْيَا وَهُمْ عَنِ الْآخِرَةِ هُمْ غَافِلُونَ)، و آنان در انکارشان بر اهل الله: «گمان می‌کنند که کار نیکو انجام می‌دهند» (يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا)، اهل الله احوال خود را به آنان واگذار کردند، زیرا می‌دانستند که آنان از کجا سخن می‌گویند، و با نامیدن حقایق به «اشارات»، خود را از آنان حفظ کردند، زیرا علمای رسوم (علماء الرسوم) اشارات را انکار نمی‌کنند. پس چون فردا روز قیامت شود، امر برای همگان چنان خواهد بود که گوینده گفته است:\n\n> به زودی خواهی دید، هنگامی که غبار فرو نشیند *** آیا اسبی زیر توست یا خری.\n\nهمان‌طور که محقق از اهل الله از مدعی در اهلیت، فردا روز قیامت متمایز می‌شود. برخی گفته‌اند:\n\n> هنگامی که اشک‌ها بر گونه‌ها درآمیزند *** مشخص می‌شود چه کسی گریست و چه کسی خود را به گریه زد.\n\nکجاست عالم رسوم از قول علی بن ابی طالب (رضی الله عنه) هنگامی که از خود خبر داد که اگر درباره سوره فاتحه قرآن سخن بگوید، هفتاد بار شتر از آن حمل خواهد شد؟ آیا این جز از فهمی است که خداوند در قرآن به او عطا کرده است؟ پس نام «فقیه» سزاوارتر به این طایفه است تا صاحب علم رسوم، زیرا خداوند درباره آنان می‌فرماید: «تا در دین تفقه کنند و قوم خود را هنگامی که به سوی آنان بازگشتند، انذار دهند، باشد که بترسند» (لِيَتَفَقَّهُوا فِي الدِّينِ وَلِيُنْذِرُوا قَوْمَهُمْ إِذَا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ). پس خداوند آنان را در مقام رسول در تفقه در دین و انذار قرار داد، و او کسی است که: «بر بصیرت به سوی خدا دعوت می‌کند» (يَدْعُو إِلَى اللَّهِ عَلَى بَصِيرَةٍ)، همان‌طور که رسول خدا (صلی الله علیه وسلم) بر بصیرت دعوت می‌کند، نه بر غلبه گمان، چنانکه عالم رسوم حکم می‌کند. پس تفاوت بسیار است میان کسی که در آنچه فتوا می‌دهد و می‌گوید، بر بصیرت از جانب خود در دعوت به سوی خداست و: «بر دلیل روشنی از پروردگارش است» (عَلَى بَيِّنَةٍ مِنْ رَبِّهِ)، و میان کسی که در دین خدا با غلبه گمان خود فتوا می‌دهد.\n\n### [علم مأخوذ از مرده و علم مأخوذ از حیّی که نمی‌میرد]\n\nسپس از شأن عالم رسوم در دفاع از خود این است که کسی را که می‌گوید: «پروردگارم مرا فهماند»، جاهل می‌شمارد و خود را برتر از او و صاحب علم می‌داند، در حالی که یکی از اهل الله می‌گوید: «خداوند در سرّ من مراد خود را از این حکم در این آیه افکند» یا می‌گوید: «رسول خدا (صلی الله علیه وسلم) را در واقعه خود دیدم و او مرا از صحت این خبر روایت شده از او و حکم آن نزد او آگاه ساخت.» ابویزید بسطامی (رضی الله عنه) در این مقام و صحت آن، علمای رسوم (علماء الرسوم) را خطاب قرار داده و می‌گوید: «شما علم خود را مرده از مرده گرفتید، و ما علم خود را از حیّی که نمی‌میرد (الحي الذي لا يموت) گرفتیم.» امثال ما می‌گویند: «قلبم از پروردگارم برایم حدیث گفت»، و شما می‌گویید: «فلانی برایم حدیث گفت.» و او کجاست؟ می‌گویند: «مرد.» از فلانی، و او کجاست؟ می‌گویند: «مرد.» و شیخ ابومدین (رحمه الله) هرگاه به او گفته می‌شد: «فلانی از فلانی از فلانی گفت»، می‌فرمود: «ما نمی‌خواهیم قَدید (گوشت خشک) بخوریم، گوشت تازه بیاورید.» او همت اصحاب خود را بالا می‌برد و می‌گفت: «این قول فلانی است، تو چه گفتی؟ خداوند چه عطایایی از علم لدنی (العلم اللدني) خود را به تو اختصاص داده است؟ از پروردگارتان حدیث بگویید و فلانی و فلانی را رها کنید، زیرا آنان آن را گوشت تازه خوردند، و بخشنده نمرده است و او از رگ گردن (حَبْلِ الْوَرِيدِ) به شما نزدیک‌تر است.»\n\n### [فیض الهی دائم است و مبشرات جزئی از اجزاء نبوت]\n\nو باب فیض الهی (الفيض الإلهي) و مبشرات (المبشرات) بسته نشده است، و آنها جزئی از اجزای نبوت هستند. و راه روشن است و در باز است و عمل مشروع است. و خداوند برای استقبال از کسی که با سعی به سوی او آید، هروله می‌کند. و «هیچ گفتگوی پنهانی سه نفر نیست مگر اینکه او چهارمین آنهاست، و هر کجا باشند او با آنهاست» (مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَهُوَ مَعَهُمْ أَيْنَ مَا كَانُوا). پس کسی که با این مرتبه از قرب با تو باشد، با وجود ادعای علم به آن و ایمان به آن، چگونه اخذ از او و حدیث گفتن با او را ترک می‌کنی و از غیر او می‌گیری و از او نمی‌گیری؟ پس تو «تازه عهد با پروردگارت» خواهی بود.\n\nجایی که رسول خدا (صلی الله علیه وسلم) شخصاً به سوی آن (باران) بیرون آمد و سر خود را برهنه کرد تا آب به او برسد. و چون در این باره از او پرسیدند، فرمود: «این تازه عهد با پروردگارش است.»\n\nاین برای تعلیم و تنبیه ماست.\n\n### [اشارات صوفیه در شرح کتاب خدا]\n\nسپس باید بدانی که اصحاب ما بر آنچه در شرح کتاب خدا آورده‌اند، جز با تعلیم الهی که علمای رسوم (علماء الرسوم) از آن جاهلند، بر لفظ «اشاره» اصطلاح نکرده‌اند. و این بدان سبب است که اشاره تنها با قصد مُشیر (اشاره‌کننده) به آن صورت می‌گیرد، نه از جهت مُشارٌ إلیه (آنچه به آن اشاره می‌شود). و اگر از ایشان درباره شرح مرادشان از اشاره بپرسی، آن را نزد سائل از علمای رسوم (علماء الرسوم) در مجرای غالب جاری می‌سازند. مثال آن: انسانی که سینه‌اش از امری تنگ شده و در آن می‌اندیشد، پس مردی، مرد دیگری را که نامش «فرج» است، ندا می‌دهد و می‌گوید: «یا فرج!» این شخص که سینه‌اش تنگ شده، آن را می‌شنود و شادمان می‌شود و می‌گوید: «فرج خدا آمد، ان شاء الله.» یعنی از این تنگی که در آن است، و سینه‌اش گشاده می‌شود.\n\nهمان‌طور که رسول خدا (صلی الله علیه وسلم) در صلح با مشرکان، هنگامی که او را از بیت بازداشتند، انجام داد. مردی از مشرکان به نام «سهیل» آمد. رسول خدا (صلی الله علیه وسلم) فرمود: «کار سهل شد.» و آن را به فال نیک گرفت، و همان‌طور شد که رسول خدا (صلی الله علیه وسلم) به فال نیک گرفته بود، و کار به دست سهیل سامان یافت.\n\nو پدر سهیل قصد این را نداشت که نام او را به این نیت بگذارد، بلکه آن را نامی عَلَم برای او قرار داد تا از دیگران شناخته شود، اگرچه پدرش قصد نیکی در نام‌گذاری پسرش داشت.\n\n### [اصطلاح اهل الله بر الفاظی که جز ایشان کسی نمی‌داند مگر از طریق ایشان]\n\nو چون اهل الله دیدند که اشاره معتبر شمرده شده است، آن را در میان خود به کار بردند، اما معنا و محل و وقت آن را بیان کردند. پس آن را در میان خود و در نفوس خود به کار نمی‌برند، مگر هنگام همنشینی با کسی که از جنس ایشان نیست، یا برای امری که در نفوسشان پدید می‌آید. و اهل الله بر الفاظی اصطلاح کرده‌اند که جز ایشان یا کسی که از ایشان گرفته باشد، آن را نمی‌داند. و روشی را در پیش گرفتند که غیر ایشان آن را نمی‌شناسد، همان‌طور که عرب در کلام خود از تشبیهات و استعارات استفاده کرد تا برخی از برخی دیگر بفهمند. پس هنگامی که با هم‌جنسان خود خلوت می‌کنند، با نص صریح سخن می‌گویند، و هنگامی که کسی که از ایشان نیست، حاضر باشد، در میان خود با الفاظی که بر آن اصطلاح کرده‌اند، سخن می‌گویند. پس همنشین بیگانه نمی‌داند که آنان در چه حالند و چه می‌گویند. و از شگفت‌انگیزترین چیزها در این طریقت، که جز در آن یافت نمی‌شود، این است که هیچ طایفه‌ای از منطقیون، نحویان، اهل هندسه، حساب، تعلیم، متکلمین و فلاسفه که علمی را حمل می‌کنند، نیست، مگر اینکه اصطلاحی دارند که تازه‌وارد به آن جز با توقیف (آموزش) از شیخ یا اهل آن، آن را نمی‌داند، و این ضروری است. مگر اهل این طریقت به خصوص. هنگامی که مرید صادق (المريد الصادق) وارد آن می‌شود، و صدق او نزد ایشان با این شناخته می‌شود که او از اصطلاح آنان خبری ندارد، پس چون خداوند چشم فهم او را بگشاید و در اولین ذوق خود از پروردگارش اخذ کند، و از اصطلاح آنان خبری نداشته باشد و نداند که قومی از اهل الله بر الفاظ مخصوصی اصطلاح کرده‌اند، هنگامی که با آنان بنشیند و آنان با اصطلاح خود بر آن الفاظی که جز ایشان یا کسی که از ایشان گرفته باشد، نمی‌داند، سخن بگویند، این مرید صادق همه آنچه را که می‌گویند، می‌فهمد، تا جایی که گویی خود واضع آن اصطلاح بوده است. و در سخن گفتن با آن اصطلاحات با آنان مشارکت می‌کند و این را از خود عجیب نمی‌شمارد، بلکه علم به آن را ضروری می‌یابد و قادر به دفع آن نیست، و گویی همیشه آن را می‌دانسته است و نمی‌داند چگونه برایش حاصل شده است. در حالی که تازه‌وارد از غیر این طایفه، آن را جز با توقیف (آموزش) نمی‌یابد. پس این است معنای اشاره نزد این قوم، و آنان با آن سخن نمی‌گویند مگر در حضور غیر یا در تألیفات و مصنفات خود، و نه غیر آن. و خداوند حق را می‌گوید و او راه را هدایت می‌کند (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 4
}