{
  "id": 394,
  "title": {
    "ar": "الباب الرابع والتسعون وثلاثمائة في معرفة منازلة من تأدب وصل ومن وصل لم يرجع ولو كان غير أديب",
    "en": "Chapter Three Hundred and Ninety-Four: Concerning the knowledge of the spiritual station of him who attained through proper conduct, and that he who attains does not return, even if he lacked proper conduct.",
    "ur": "باب تین سو چورانوے: اس شخص کے مرتبے (منازلة) کی معرفت میں جو ادب اختیار کر کے واصل ہوا، اور جو واصل ہوا وہ واپس نہیں لوٹتا، اگرچہ وہ غیر مؤدب ہو۔",
    "fa": "باب سیصد و نود و چهارم در معرفت منازل کسی که ادب ورزید و رسید، و کسی که رسید باز نمی‌گردد، اگرچه بی‌ادب باشد."
  },
  "content": {
    "ar": "## «الباب الرابع والتسعون وثلاثمائة في معرفة منازلة من تأدب وصل ومن وصل لم يرجع ولو كان غير أديب»\n\n\n> لو لا الشهود وما فيه من النعم *** ما كان لي أمل في الكون في العدم‏\n\n\n> كناية فيه حتى قال كن فبدت *** أعياننا لسماع الكون في الكلم‏\n\n\n> فلو فتحنا عيونا ما بها رمد *** كنا حيارى كمثل العمي في الظلم‏\n\n\n> ولم نكن فوجود النار أظهرنا *** نورا فنحن بكون غير منقسم‏\n> والنور أعياننا والنور خالقنا *** وفيه نسعى برجل أو بلا قدم‏\n\n\n### [الوجود المطلق هو الخير المحض‏]\n\n\nاعلم أيدنا الله وإياك أن الوجود المطلق هو الخير المحض كما إن العدم المطلق هو الشر المحض والممكنات بينهما فيما تقبل الوجود لها نصيب في الخيرية وبما تقبل العدم لها نصيب في الشر وليس الأدب الإجماع الخير كله ولهذا سميت المأدبة مأدبة الاجتماع الناس فيها على الطعام ولا شك أن الخير ظهر في العالم متفرقا فلا يخلو ممكن عن خيرية وما والممكن الكامل المخلوق على الصورة الإلهية المخصوص بالسورة الإمامية لا بد وإن يكون جامعا لجميع الخير كله ولهذا استحق الإمامة والنيابة في العالم ولهذا قال في آدم عليه السلام وعَلَّمَ آدَمَ الْأَسْماءَ كُلَّها وما ثم إلا اسم ومسمى وقد حصل علم الأسماء محمد صَلَّى اللهُ عَليهِ وسَلَّم حين‏\n\n\nقال علمت علم الأولين والآخرين‏\n\n\nفعلمنا أنه قد حصل عنده علم الأسماء فإنه من العلم الأول ولأن آدم له الأولية فهو من الأولين في الوجود الحسي وقال عن نفسه فيما خص به على غيره إنه أوتي جوامع الكلم‏\n\n\nوالكلم جمع كلمة والكلم أعيان المسميات قال تعالى وكَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ وليست غير عيسى فأعيان الموجودات كلها كلمات الحق وهي لا تنفد فقد حصل له الأسماء والمسميات فقد جمع الخير كله فاستحق السيادة على جميع الناس وهوقوله أنا سيد الناس يوم القيامة\n\n\nوهناك تظهر سيادته لكون الآخرة محل تجلى الحق العالم فلا يتمكن لتجليه دعوى من أحد فيما ينبغي أن يكون لله أو يكون من الله لمن شاء من عباده فقوله وصل يعني إلى تحصيل الخير المحض وهوقوله تعالى كنت سمعه وبصره‏\n\n\nوأمثال هذا وهذا هو الوصول إلى السعادة الدائمة وهو الوصول المطلوب ولا شك أنه من وصل لم يرجع فإنه من المحال الرجوع بعد كشف الغطاء إلى محل صفة الحجاب فإن المعلوم لا يجهله العالم به بعد تعلق العلم به فرجال الله المكملون كشف الله الغطية عن بصائرهم وأبصارهم بما حصلوه من الصفات الإلهية ووقفوا عليه من الصفات الكونية وكلها كما تقدم إلهية وهؤلاء هم الأدباء الذين صلحوا البساط الحق جلساء الله وأهله وهم أهل الذكر والقرآن الذي هو الجمع وبه سمي قرآنا وأما العامة فلا بد لهم من كشف الغطاء عن أبصارهم عند الموت فيرون الأمور على ما هي عليه وإن لم يكونوا من السعداء فيرون السعداء والسعادة ويرون الأشقياء والشقاوة فلا يجهلون بعد هذا العلم وإن شقوا فهذا معنى قوله ومن وصل لم يرجع ولو كان غير أديب أي غير جامع للخير وإنما سمي جامعا للخير والخير أمر واحد لكون هذا الأمر الواحد ظهر في صور كثيرة مختلفة جمعها هذا الأديب فظهر في خيريته بكل صورة خير فسمي أديبا أي جامعا لهذه الصورة الخيرية والخير في نفسه حقيقة واحدة ظاهرة في العالم في صور مختلفة\n\n\n> وما على الله بمستنكر *** أن يجمع العالم في واحد\n\n\nفالأديب ظاهر بصورة حق في العالم يفصل إجماله بصورة ويجمل تفصيله بذاته ومتى لم تكن هذه الصفة والقوة في رجل فليس بأديب وهؤلاء هم الذين إذا رأوا ذكر الله وإذا ذكر الله فقد ضمن ذكره جميع العالم فمن ذكر الله بهذا اللسان فقد ذكر العالم لأن العالم صورة الحق وهو الاسم الظاهر الذي وقع فيه التفصيل ومدلوله أيضا الحق لأنه عين الدليل على نفسه فكان له من أجل هذا الاسم الباطن الذي وقع به الإجمال فالعلم واحد وهو في الباطن وتعلقاته متعددة بتعدد صور المعلومات فالعالم يكشف المعلومات ببصيرته على جهة الإحاطة بحقائقها أنها لا تتناهى معلوماته ولا مقدوراته وما بقي في عين الممكن في قبوله الوجود نصيب للعدم ولا حكم إلا معقولية الإمكان وإن لم ينعدم بعد ولا يصح عدمه لأن خلاف المعلوم محال الوقوع ولا يكون عن الوجود عدم أصلا لأنه ليس في حقيقته صدور العدم عنه فما انعدم من الأمور التي يعطي الدليل عدمها إنما انعدم لنفسه أو لعدم الشرط في بقائه في الوجود وبهذا القدر انفصل وجود الممكن من وجود الحق فإن الإمكان لا يزول حكمه عقلا في الموجود المحدث لنفسه الممكن والإمكان لا نصيب لوجود الحق فيه أصلا وإن كان وجود أعيان الممكنات لا ينعدم أصلا بعد وجودها ولكن كما قررناه وأما الأعراض التي قلنا إنها تنعدم لنفسها في الزمان الثاني من زمان وجودها فحقيقتها أنها أسباب عدمية لها أحكام معقولة مقولة لا يمكن جحدها ولا الحكم بها فلو كانت الأعراض أعيانا وجودية لاستحال عدمها مع حكم الإمكان فيها كما استحال في كل قائم بنفسه من الممكنات ثم إنك إذا أخذت تفصل بالحدود أعيان الموجودات وجدتها بالتفصيل نسبا وبالمجموع أمرا وجوديا لا يمكن لمخلوق‏\nأن يعلم صورة الأمر فيها فلا علم لمخلوق مما سوى الله ولا للعقل الأول أن يعقل كيفية اجتماع نسب يكون عن اجتماعها عين وجودية مستقلة في الظهور غير مستقلة في الغني مفتقرة بالإمكان المحكوم عليها به وهذا علم لا يعلمه إلا الله تعالى وليس في الإمكان أن يعلمه غير الله تعالى ولا يقبل التعليم أعني أن يعلمه الله من شاء من عباده فأشبه العلم به العلم بذات الحق والعلم بذات الحق محال حصوله لغير الله فمن المحال حصول العلم بالعالم أو بالإنسان نفسه أو بنفس كل شي‏ء لنفسه لغير الله فتفهم هذه المسألة فإني ما سمعت ولا علمت إن أحدا نبه عليها وإن كان يعلمها فإنها صعبة التصور مع أن فحول العلماء يقولون بها ولا يعلمون أنها هي كبلقيس تقول كَأَنَّهُ هُوَ وهو هو وكذلك من تكلم في الحق في حال ظهوره في صورة خاصة مع الحق فهو يشهده ولا يعلم أنه هو وهذا إسار حكمه في العالم لمن نظر واستبصر فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ لظهوره بنفسه فلا دليل عليه سواه له إذ ما ثم إلا الله تعالى والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Ninety-Fourth: Concerning the Knowledge of the Station of Him Who Attained Through Discipline, and That He Who Attained Does Not Return, Even If He Lacked Discipline.\n\nWere it not for the Witnessing (الشهود) and the blessings contained within it,\nI would have no hope in existence (الكون) or in non-existence (العدم).\n\nAn allusion within it until He said, \"Be!\" (Kun), and our essences (أعياننا) appeared\nupon hearing the existence in the Word (الكلم).\n\nHad we opened eyes free of ophthalmia,\nWe would have been bewildered, like the blind in the darkness.\n\nAnd we were not, but the existence of the Fire made us manifest\nas Light (نور), so we are in an existence that is not divided.\nAnd the Light is our essences, and the Light is our Creator,\nAnd in it we strive, whether with a foot or without a foot.\n\n### [Absolute Existence is Pure Goodness]\n\nKnow—may Allah support us and you—that Absolute Existence (الوجود المطلق) is Pure Goodness (الخير المحض), just as Absolute Non-Existence (العدم المطلق) is Pure Evil (الشر المحض). The Possibles (الممكنات) lie between the two. Insofar as they accept Existence (الوجود), they have a share in goodness, and insofar as they accept Non-Existence (العدم), they have a share in evil.\n\nDiscipline (الأدب) is nothing but the comprehensive gathering of all goodness. This is why a banquet (al-ma'duba) is named thus: because people gather there for food. There is no doubt that goodness appeared in the World (العالم) in a dispersed manner, so no possible thing is devoid of some goodness. But the Perfect Possible (الممكن الكامل), created upon the Divine Form (الصورة الإلهية) and specifically designated by the Form of Leadership (السورة الإمامية), must necessarily be the comprehensive gatherer of all goodness. For this reason, he deserved the Imāmate (Leadership) and Vicegerency (النيابة) in the World.\n\nFor this reason, He said concerning Adam (peace be upon him): <<وَعَلَّمَ آدَمَ الْأَسْماءَ كُلَّها>> (And He taught Adam all the Names). And there is nothing there except a Name (اسم) and a Named (مسمى). The knowledge of the Names (الأسماء) was attained by Muhammad (may Allah bless him and grant him peace) when he said: \"I have been taught the knowledge of the first and the last.\" Thus, we know that he attained the knowledge of the Names, for it is part of the first knowledge. And because Adam has priority, he is among the first in sensory existence (الوجود الحسي). He said concerning himself, regarding what distinguished him above others, that he was given the Comprehensive Words (جوامع الكلم). *Al-Kalim* is the plural of *Kalima* (Word), and the Words (الكلم) are the essences (أعيان) of the Named things. Allah the Exalted said: <<وَكَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ>> (And His Word which He cast unto Maryam), and that is none other than Jesus. Thus, the essences of all existing things are the Words of the Real (كلمات الحق), and they are inexhaustible. Therefore, he attained the Names and the Named things, thereby gathering all goodness, and thus deserved mastery over all people. This is confirmed by his saying: \"I am the master of mankind on the Day of Resurrection.\"\n\nThere, his mastery will become manifest, because the Hereafter (الآخرة) is the locus of the Theophany (التجلي) of the Knowing Real (الحق العالم). Due to this Theophany, no one can make a claim regarding what belongs to Allah or what comes from Allah to whomever He wills among His servants. His saying, \"he attained\" (وصل), means the attainment of Pure Goodness (الخير المحض), which is referenced in the Divine saying: \"I was his hearing and his sight.\" And similar statements. This is the attainment of Perpetual Felicity (السعادة الدائمة), which is the desired attainment (الوصول المطلوب).\n\nThere is no doubt that he who attained does not return, for it is impossible to return to the state of the veil (الحجاب) after the removal of the covering (كشف الغطاء). For the known thing is not unknown to the one who knows it, once Knowledge (العلم) has attached to it. Thus, the perfected Men of Allah (رجال الله المكملون)—Allah removed the covering from their inner sights (بصائرهم) and outer sights (أبصارهم) through what they attained of the Divine Attributes (الصفات الإلهية) and what they apprehended of the Cosmic Attributes (الصفات الكونية), all of which, as previously established, are Divine. These are the disciplined ones (الأدباء) who are fit for the carpet of the Real (بساط الحق), the companions of Allah and His people. They are the People of Remembrance (أهل الذكر) and the Quran, which is the Gathering (الجمع), and by which it was named *Quran*.\n\nAs for the general public (العامة), the covering must necessarily be removed from their sights at the time of death, so they see things as they truly are. Even if they are not among the felicitous (السعداء), they will see the felicitous and Felicity (السعادة), and they will see the wretched (الأشقياء) and Wretchedness (الشقاوة). They will not be ignorant after this Knowledge, even if they are wretched. This is the meaning of his saying, \"and he who attained does not return, even if he was not disciplined (غير أديب),\" meaning, even if he was not the comprehensive gatherer of goodness. He is only called the gatherer of goodness—though goodness is a single matter—because this single matter appeared in many different forms, which this disciplined one (الأديب) gathered. Thus, he manifested his goodness in every form of goodness, and was therefore called *adib* (disciplined), meaning the gatherer of these forms of goodness. Goodness in itself is a single Reality (حقيقة واحدة) manifesting in the World in different forms.\n\nAnd it is not to be deemed strange for Allah\nThat He should gather the World in a single one.\n\nThe disciplined one (الأديب) thus appears in the World in the form of the Real (حق), detailing its totality through the form and totalizing its detail through his Essence (ذات). Whenever this Attribute (صفة) and power are not present in a man, he is not disciplined. These are the ones who, when they are seen, Allah is remembered. And when Allah is remembered, His remembrance necessarily includes the remembrance of the entire World, because the World is the Form of the Real (صورة الحق) and is the Manifest Name (الاسم الظاهر) in which the detailing occurred. Its referent is also the Real, because it is the very proof of Itself. Thus, for the sake of this, He possesses the Inner Name (الاسم الباطن) by which the totalizing occurred.\n\nKnowledge (العلم) is one, and it resides in the Inner (الباطن), but its connections are multiple due to the multiplicity of the forms of the known things (المعلومات). The Knower (العالم) unveils the known things through his inner sight (بصيرة) by way of encompassing their realities (حقائقها), [knowing] that His known things and His capabilities are inexhaustible.\n\nNothing remains in the essence (عين) of the possible thing, in its acceptance of Existence, that has a share in Non-Existence (العدم) or a ruling, except the intelligibility of Possibility (الإمكان), even if it has not yet ceased to exist, and its non-existence is not valid, because the opposite of what is known is impossible to occur. Non-Existence does not proceed from Existence (الوجود) at all, because it is not in the Reality (حقيقة) of Existence that Non-Existence issues forth from It. Therefore, whatever ceases to exist among the things whose non-existence is indicated by the proof, only ceases to exist by itself, or due to the absence of the condition necessary for its subsistence in Existence.\n\nBy this measure, the existence of the Possible (الممكن) is separated from the Existence of the Real (وجود الحق), for the ruling of Possibility does not cease rationally in the originated existent (الموجود المحدث) which is possible in itself. And Possibility has absolutely no share in the Existence of the Real, even though the existence of the Fixed Entities (أعيان الممكنات) does not cease to exist at all after their existence, but rather as we have established. As for the Accidents (الأعراض) which we said cease to exist by themselves in the second moment of their existence, their reality is that they are non-existent causes (أسباب عدمية) that have intelligible, spoken rulings which cannot be denied or judged. If the Accidents were existent entities (أعيانا وجودية), their non-existence would be impossible, despite the ruling of Possibility applied to them, just as it is impossible for every self-subsistent possible thing.\n\nFurthermore, if you begin to detail the essences of existing things (أعيان الموجودات) by means of definitions (الحدود), you will find them, in detail, to be relations (نسب), and in totality, an existent matter (أمر وجودي) whose form no creature can know. Thus, no creature, nor even the First Intellect (العقل الأول), has knowledge of anything other than Allah, or can rationally grasp the manner in which relations combine, such that their combination results in an existent entity (عين وجودية) that is independent in manifestation but not independent in richness, being dependent due to the Possibility (الإمكان) decreed upon it.\n\nThis is a knowledge that only Allah the Exalted knows. It is not possible for anyone other than Allah the Exalted to know it, nor does it accept instruction—meaning, that Allah should teach it to whomever He wills among His servants. Therefore, the knowledge of it resembles the Knowledge of the Essence of the Real (ذات الحق), and the Knowledge of the Essence of the Real is impossible for anyone other than Allah to attain. Thus, it is impossible for anyone other than Allah to attain the Knowledge of the World, or of man himself, or of the self of every thing in itself.\n\nSo, understand this matter, for I have neither heard nor known of anyone who has drawn attention to it, even if they know it. It is difficult to conceive, even though the masters of scholars affirm it without knowing that *it is it*. Like Bilqis, who said: <<كَأَنَّهُ هُوَ>> (It seems to be it), while it was indeed it. Likewise, he who speaks of the Real (الحق) while It is manifesting in a specific form alongside the Real—he witnesses It but does not know that *It is It*. This is the secret of His ruling in the World for him who looks and gains insight: <<فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ>> (Indeed, Allah is free from need of the worlds), because He manifests by Himself, so there is no proof for Him other than Himself, since there is nothing there except Allah the Exalted. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تین سو چورانوے: اس شخص کے مراتب کی معرفت میں جو باادب ہوا وہ پہنچ گیا، اور جو پہنچ گیا وہ واپس نہیں لوٹے گا، خواہ وہ باادب نہ بھی ہو\n\nاگر (ذات حق کا) شہود (الشہود) اور اس میں موجود نعمتیں نہ ہوتیں،\nتو مجھے وجود میں یا عدم میں کوئی امید نہ ہوتی۔\n\nاس میں کنایہ تھا یہاں تک کہ (حق نے) 'کن' (ہو جا) کہا، تو\nکلمات میں 'کن' کی آواز سننے کے لیے ہماری اعیان (حقائق) ظاہر ہو گئیں۔\n\nپس اگر ہم ایسی آنکھیں کھولتے جن میں کوئی بیماری نہ ہوتی،\nتو ہم اندھیروں میں اندھوں کی طرح حیران رہتے۔\n\nاور ہم موجود نہ تھے، تو وجودِ نور نے ہمیں نور کے طور پر ظاہر کیا،\nپس ہم ایک ایسے وجود کے ساتھ ہیں جو غیر منقسم ہے۔\nاور نور ہی ہماری اعیان (حقائق) ہے، اور نور ہی ہمارا خالق ہے،\nاور اسی میں ہم قدم کے ساتھ یا قدم کے بغیر سعی کرتے ہیں۔\n\n**الوجود المطلق (ہستی مطلق) ہی خیر محض ہے**\n\nجان لو، اللہ ہمیں اور تمہیں تائید بخشے، کہ الوجود المطلق (ہستی مطلق) ہی خیر محض ہے، جیسا کہ العدم المطلق (عدم مطلق) ہی شر محض ہے۔ اور ممکنات (ممکن چیزیں) ان دونوں کے درمیان ہیں؛ جس حد تک وہ الوجود (ہستی) کو قبول کرتی ہیں، ان کا خیر میں حصہ ہوتا ہے، اور جس حد تک وہ العدم (عدم) کو قبول کرتی ہیں، ان کا شر میں حصہ ہوتا ہے۔ اور ادب (الأدب) تمام خیر کو جمع کرنے کا نام ہے۔ اسی لیے اس دعوت کو مأدبة (دستَرخوان) کہا جاتا ہے جہاں لوگ کھانے پر جمع ہوتے ہیں۔\n\nاور اس میں کوئی شک نہیں کہ خیر عالم میں متفرق طور پر ظاہر ہوا ہے، چنانچہ کوئی ممکن خیر سے خالی نہیں ہے۔ اور وہ کامل ممکن جو صورتِ الٰہیہ پر پیدا کیا گیا ہے اور جسے صورتِ امامیہ کے ساتھ خاص کیا گیا ہے، لازمی طور پر تمام خیر کو جمع کرنے والا ہوتا ہے۔ اسی لیے وہ عالم میں امامت اور نیابت کا مستحق ہوا۔ اسی لیے آدم علیہ السلام کے بارے میں فرمایا: **\"اور اللہ نے آدم کو تمام نام سکھا دیے\" (وَعَلَّمَ آدَمَ الْأَسْماءَ كُلَّها)**۔ اور وہاں نام اور مسمیٰ کے سوا کچھ نہیں تھا۔\n\nاور محمد صلی اللہ علیہ وسلم کو علم الاسماء (ناموں کا علم) اس وقت حاصل ہوا جب آپ نے فرمایا: \"میں نے اولین و آخرین کا علم جان لیا۔\" پس ہم نے جان لیا کہ آپ کے پاس علم الاسماء حاصل ہو چکا تھا، کیونکہ یہ علمِ اول میں سے ہے۔ اور چونکہ آدم کو اولیت حاصل ہے، لہٰذا وہ حسی الوجود (حسی ہستی) میں اولین میں سے ہیں۔ اور آپ نے اپنے بارے میں، جس چیز کے ساتھ آپ کو دوسروں پر فضیلت دی گئی، فرمایا کہ آپ کو جوامع الکلم (جامع کلمات) عطا کیے گئے۔\n\nاور الکلم (کلمات) کلمہ کی جمع ہے، اور الکلم مسمیات کی اعیان (حقیقتیں) ہیں۔ اللہ تعالیٰ نے فرمایا: **\"اور اس کا کلمہ جو اس نے مریم کی طرف ڈالا\" (وَكَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ)**، اور وہ عیسیٰ کے سوا کوئی نہیں ہے۔ پس تمام موجودات کی اعیان (حقیقتیں) حق کے کلمات ہیں، اور وہ ختم ہونے والے نہیں ہیں۔ پس آپ کو اسماء اور مسمیات حاصل ہو گئے، چنانچہ آپ نے تمام خیر کو جمع کر لیا، اور اسی لیے آپ تمام لوگوں پر سیادت کے مستحق ہوئے، اور یہی آپ کا یہ قول ہے: \"میں قیامت کے دن لوگوں کا سردار ہوں گا۔\"\n\nاور وہاں آپ کی سیادت ظاہر ہو گی، کیونکہ آخرت الحق العالم (عالم حق) کے التجلی (ظہور الٰہی) کا مقام ہے۔ پس اس کے التجلی (ظہور) کے سامنے کسی کے لیے یہ دعویٰ کرنا ممکن نہیں ہو گا کہ جو کچھ اللہ کے لیے ہونا چاہیے یا اللہ کی طرف سے اس کے بندوں میں سے جسے وہ چاہے، اس کے لیے ہو۔ پس آپ کا قول \"وصل\" (پہنچ گیا) سے مراد خیر محض کا حصول ہے، اور یہی اللہ تعالیٰ کا یہ قول ہے: \"میں اس کی سماعت اور اس کی بصارت بن جاتا ہوں۔\"\n\nاور اس جیسی مثالیں، اور یہی سعادتِ دائمی تک پہنچنا ہے، اور یہی مطلوبہ وصول ہے۔ اور اس میں کوئی شک نہیں کہ جو پہنچ گیا وہ واپس نہیں لوٹے گا، کیونکہ غطاء (پردہ) ہٹ جانے کے بعد حجاب کی صفت کے مقام کی طرف لوٹنا محال ہے۔ کیونکہ معلوم کو جاننے والا شخص علم کے اس سے متعلق ہونے کے بعد اسے دوبارہ نہیں بھولتا۔ پس اللہ کے کامل مردوں کی بصیرتوں اور آنکھوں سے اللہ نے پردہ ہٹا دیا ہے، ان صفاتِ الٰہیہ کی بنا پر جو انہوں نے حاصل کیں، اور ان صفاتِ کونیہ کی بنا پر جن پر وہ مطلع ہوئے، اور یہ سب جیسا کہ پہلے بیان ہوا، الٰہی ہیں۔\n\nاور یہی وہ أدباء (باادب لوگ) ہیں جو بساطِ حق کے لائق ہوئے، اللہ کے ہم نشین اور اس کے اہل ہیں۔ اور یہی اہل الذکر اور قرآن کے اہل ہیں، جو کہ جمع (جمعیت) ہے، اور اسی وجہ سے اسے قرآن کہا گیا۔ لیکن عام لوگوں کے لیے موت کے وقت ان کی آنکھوں سے پردہ ہٹنا ضروری ہے، تو وہ چیزوں کو اسی طرح دیکھتے ہیں جیسے وہ ہیں۔ اگرچہ وہ سعادت مندوں میں سے نہ ہوں، وہ سعادت مندوں اور سعادت کو دیکھتے ہیں، اور بدبختوں اور بدبختی کو دیکھتے ہیں۔ پس وہ اس علم کے بعد جاہل نہیں رہتے، اگرچہ وہ بدبخت ہوں۔ پس یہ اس قول کا معنی ہے: \"اور جو پہنچ گیا وہ واپس نہیں لوٹے گا، خواہ وہ غیر أديب (باادب نہ) بھی ہو،\" یعنی خیر کو جمع کرنے والا نہ ہو۔\n\nاور اسے خیر کو جمع کرنے والا اس لیے کہا گیا، حالانکہ خیر ایک ہی امر ہے، کیونکہ یہ ایک امر بہت سی مختلف صورتوں میں ظاہر ہوا، جنہیں اس أديب (باادب شخص) نے جمع کیا۔ پس وہ اپنی خیریت میں ہر خیر کی صورت میں ظاہر ہوا، لہٰذا اسے أديب کہا گیا، یعنی ان خیر کی صورتوں کو جمع کرنے والا۔ اور خیر بذاتِ خود ایک ہی حقیقت ہے جو عالم میں مختلف صورتوں میں ظاہر ہوتی ہے۔\n\nاور اللہ پر یہ کوئی انوکھی بات نہیں ہے\nکہ وہ عالم کو ایک میں جمع کر دے۔\n\nپس أديب (باادب شخص) عالم میں حق کی صورت میں ظاہر ہوتا ہے، جو اپنے اجمال کو صورت کے ذریعے تفصیل دیتا ہے اور اپنی ذات کے ذریعے تفصیل کو مجمل کرتا ہے۔ اور جب کسی شخص میں یہ صفت اور قوت نہ ہو تو وہ أديب نہیں ہے۔ اور یہی وہ لوگ ہیں کہ جب انہیں دیکھا جائے تو اللہ کا ذکر کیا جاتا ہے، اور جب اللہ کا ذکر کیا جاتا ہے تو اس کے ذکر میں تمام عالم شامل ہو جاتا ہے۔ پس جس نے اس زبان سے اللہ کا ذکر کیا، اس نے عالم کا ذکر کیا، کیونکہ عالم حق کی صورت ہے، اور وہ الاسم الظاہر (ظاہر نام) ہے جس میں تفصیل واقع ہوئی، اور اس کا مدلول بھی الحق (ذات حق) ہے، کیونکہ وہ اپنی ذات پر دلیل کی عین ہے۔ پس اسی وجہ سے اس کے لیے الاسم الباطن (باطن نام) بھی ہے جس کے ذریعے اجمال واقع ہوا۔\n\nپس علم ایک ہے اور وہ باطن میں ہے، اور اس کے تعلقات معلومات کی صورتوں کے تعدد سے متعدد ہیں۔ پس عالم اپنی بصیرت سے معلومات کو ان کی حقائق کے احاطے کے طریقے پر کشف (الکشف) کرتا ہے، کہ اس کی معلومات اور اس کی مقدورات (قدرتیں) ختم نہیں ہوتیں۔ اور ممکن کی عین (حقیقت) میں الوجود (ہستی) کو قبول کرنے میں عدم کا کوئی حصہ باقی نہیں رہا، اور نہ ہی کوئی حکم باقی رہا سوائے امکان کی معقولیت کے، اگرچہ وہ ابھی معدوم نہیں ہوا، اور نہ ہی اس کا معدوم ہونا درست ہے، کیونکہ معلوم کے خلاف کا وقوع محال ہے۔ اور الوجود (ہستی) سے عدم کا صدور اصلاً نہیں ہوتا، کیونکہ اس کی حقیقت میں عدم کا اس سے صادر ہونا نہیں ہے۔\n\nپس جو چیزیں معدوم ہوئیں جن کا عدم دلیل سے ثابت ہوتا ہے، وہ صرف اپنی ذات کی وجہ سے یا الوجود (ہستی) میں باقی رہنے کی شرط کے نہ ہونے کی وجہ سے معدوم ہوئیں۔ اور اسی قدر سے ممکن کا وجود، وجود الحق (ذات حق کی ہستی) سے جدا ہو جاتا ہے، کیونکہ امکان کا حکم عقلی طور پر اس ممکن موجودِ محدث کے لیے زائل نہیں ہوتا، اور امکان کا وجود الحق (ذات حق کی ہستی) میں اصلاً کوئی حصہ نہیں ہے۔ اگرچہ ممکنات کی اعیان (حقیقتیں) اپنے وجود کے بعد اصلاً معدوم نہیں ہوتیں، لیکن جیسا کہ ہم نے طے کیا ہے۔ اور جہاں تک اعراض (عارضی صفات) کا تعلق ہے، جن کے بارے میں ہم نے کہا کہ وہ اپنے وجود کے دوسرے لمحے میں خود ہی معدوم ہو جاتے ہیں، تو ان کی حقیقت یہ ہے کہ وہ عدمی اسباب ہیں جن کے لیے معقول اور قابلِ بیان احکام ہیں، جن کا انکار کرنا یا ان کے ذریعے حکم لگانا ممکن نہیں ہے۔ پس اگر اعراض وجودی اعیان (حقیقتیں) ہوتے، تو ان کا معدوم ہونا محال ہوتا، باوجود اس کے کہ ان میں امکان کا حکم موجود ہے، جیسا کہ ہر قائم بالذات ممکنات میں محال ہے۔\n\nپھر جب تم حدود کے ذریعے موجودات کی اعیان (حقیقتوں) کی تفصیل کرنا شروع کرو گے، تو تم انہیں تفصیل میں نسبتیں پاؤ گے، اور مجموعی طور پر ایک وجودی امر پاؤ گے، جس میں مخلوق کے لیے امر کی صورت کو جاننا ممکن نہیں ہے۔ پس اللہ کے سوا کسی مخلوق کے لیے کوئی علم نہیں ہے، اور نہ ہی عقلِ اول کے لیے یہ سمجھنا ممکن ہے کہ نسبتوں کا اجتماع کس طرح ہوتا ہے جس کے اجتماع سے ایک وجودی عین (حقیقت) بنتی ہے جو ظہور میں تو مستقل ہے لیکن غنی میں مستقل نہیں، اور اس امکان کی وجہ سے محتاج ہے جس کا حکم اس پر لگایا گیا ہے۔\n\nاور یہ وہ علم ہے جسے اللہ تعالیٰ کے سوا کوئی نہیں جانتا، اور یہ ممکن نہیں کہ اللہ تعالیٰ کے سوا کوئی اسے جان سکے، اور نہ ہی یہ تعلیم کو قبول کرتا ہے، یعنی یہ کہ اللہ اسے اپنے بندوں میں سے جسے چاہے سکھا دے۔ پس اس کا علم، ذات الحق (ذات حق) کے علم سے مشابہ ہو گیا، اور ذات الحق (ذات حق) کا علم اللہ کے سوا کسی کے لیے حاصل ہونا محال ہے۔ پس اللہ کے سوا کسی اور کے لیے عالم کا علم، یا خود انسان کا علم، یا ہر چیز کی اپنی ذات کا علم حاصل ہونا محال ہے۔ لہٰذا اس مسئلے کو سمجھو، کیونکہ میں نے نہ سنا اور نہ جانا کہ کسی نے اس پر تنبیہ کی ہو، اگرچہ وہ اسے جانتے ہیں۔ کیونکہ یہ تصور میں مشکل ہے، حالانکہ بڑے بڑے علماء اس کے قائل ہیں اور وہ نہیں جانتے کہ یہ وہی ہے، جیسے بلقیس نے کہا تھا: **\"گویا کہ یہ وہی ہے\" (كَأَنَّهُ هُوَ)**، حالانکہ وہ وہی تھا۔\n\nاور اسی طرح جو شخص حق کے بارے میں اس کے کسی خاص صورت میں ظاہر ہونے کی حالت میں بات کرتا ہے، وہ اس کا شہود (الشہود) کرتا ہے لیکن نہیں جانتا کہ وہ وہی ہے۔ اور یہ اس کے حکم کی قید ہے عالم میں اس شخص کے لیے جو غور و فکر کرے اور بصیرت حاصل کرے۔ **\"بے شک اللہ تمام جہانوں سے بے نیاز ہے\" (فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ)**، کیونکہ وہ خود ہی ظاہر ہوتا ہے، لہٰذا اس کے سوا اس پر کوئی دلیل نہیں ہے، کیونکہ اللہ تعالیٰ کے سوا وہاں کچھ نہیں ہے۔ **\"اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)**۔",
    "fa": "باب سیصد و نود و چهارم در معرفت جایگاه کسی که ادب ورزید، رسید؛ و کسی که رسید، بازنگشت، حتی اگر غیر ادیب (فاقد ادب جامع) باشد.\n\nاگر شهود (الشهود) و نعمت‌های آن نبود،\nمرا در هستی (الکون) و نیستی (العدم) امیدی نبود.\n\nدر آن کنایه‌ای بود تا آنکه [حق] گفت: «باش»؛\nپس اعیان ما برای شنیدن «باش» در کلمات پدیدار شد.\n\nاگر چشمانی را می‌گشودیم که در آن رمد (بیماری چشم) نبود،\nهمچون کوران در تاریکی، حیران می‌شدیم.\n\nو ما نبودیم، پس وجود آتش ما را به صورت نوری آشکار ساخت؛\nپس ما به هستی (کون) غیر منقسم هستیم.\nو نور، اعیان ماست و نور، خالق ماست؛\nو در آن با پا یا بدون پا می‌کوشیم (سعی می‌کنیم).\n\n### [هستی مطلق، خیر محض است]\n\nبدان، خداوند ما و تو را تأیید کند، که هستی مطلق (الوجود المطلق)، خیر محض است؛ همان‌طور که نیستی مطلق (العدم المطلق)، شر محض است. و ممکنات (الممکنات) در میان این دو قرار دارند؛ از آن جهت که وجود را می‌پذیرند، بهره‌ای از خیریت دارند، و از آن جهت که نیستی را می‌پذیرند، بهره‌ای از شر دارند. و ادب، گردآوری تمام خیر است. به همین دلیل، سفره غذا را «مأدبه» نامیده‌اند، زیرا مردم برای خوردن غذا بر آن گرد می‌آیند. شکی نیست که خیر در عالم به صورت پراکنده ظاهر شده است، و هیچ ممکنی از خیریت خالی نیست. اما ممکن کامل که بر صورت الهی آفریده شده و به سوره امامیه اختصاص یافته است، ناگزیر باید جامع تمام خیر باشد. به همین دلیل، شایسته امامت و نیابت در عالم گردیده است. و به همین دلیل درباره آدم (علیه السلام) فرمود: **«وَعَلَّمَ آدَمَ الْأَسْماءَ كُلَّها»** (و همه نام‌ها را به آدم آموخت). و در آنجا جز اسم و مسمی نیست. و علم اسماء برای محمد (صلی الله علیه و سلم) حاصل شد، آنگاه که فرمود:\n\n«علم اولین و آخرین را دانستم.»\n\nپس دانستیم که علم اسماء نزد او حاصل شده است، زیرا این علم از علم اول است. و چون آدم اولویت دارد، او در وجود حسی از اولین است. و [پیامبر] درباره خود در آنچه که به آن بر دیگران اختصاص یافته، فرمود که به او جوامع الکلم (جوامع کلمات) داده شده است.\n\nو «کلم» جمع «کلمه» است، و کلمات، اعیان مسمیات هستند. خداوند متعال می‌فرماید: **«وَكَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ»** (و کلمه‌اش را به مریم القا کرد) و آن کلمه جز عیسی نیست. پس اعیان موجودات همگی کلمات حق (الحق) هستند و این کلمات پایان نمی‌پذیرند. پس [پیامبر] اسماء و مسمیات را به دست آورد و تمام خیر را جمع کرد، از این رو شایسته سیادت بر همه مردم شد. و این همان سخن اوست که: «من در روز قیامت سرور مردم هستم.»\n\nو در آنجا سیادت او آشکار می‌شود، زیرا آخرت محل تجلی حق (الحق) عالم است. پس به دلیل این تجلی (التجلی)، هیچ کس نمی‌تواند ادعایی در مورد آنچه که شایسته خداست یا از جانب خدا برای هر یک از بندگانش که بخواهد، باشد، مطرح کند. پس سخن او که «وصل» (رسید)، یعنی رسیدن به تحصیل خیر محض. و این همان قول خداوند متعال است که: «گوش و چشم او بودم.»\n\nو امثال اینها. و این همان رسیدن به سعادت دائمی است و همان وصول مطلوب است. شکی نیست کسی که رسید، باز نمی‌گردد؛ زیرا محال است پس از کشف الغطاء (برداشتن پرده) به محل صفت حجاب بازگشت. زیرا معلوم، پس از تعلق علم به آن، برای عالم به آن مجهول نمی‌شود. پس مردان کامل خدا، خداوند پرده را از بصیرت‌ها و دیدگانشان کنار زده است، به واسطه صفات الهی که کسب کرده‌اند و صفات کونی که بر آن واقف شده‌اند، و همه آنها، همان‌طور که پیشتر گفته شد، الهی هستند. و اینان همان ادیبانی هستند که شایسته بساط حق (الحق) و همنشینان خدا و اهل او شدند. و آنان اهل ذکر و قرآن هستند که جامع است و به همین دلیل قرآن نامیده شده است. اما عوام، ناگزیرند که هنگام مرگ پرده از دیدگانشان کنار رود، پس امور را آن‌گونه که هستند می‌بینند، حتی اگر از سعادتمندان نباشند. پس سعادتمندان و سعادت را می‌بینند و شقاوتمندان و شقاوت را می‌بینند. پس از این علم، دیگر جاهل نمی‌شوند، حتی اگر شقی باشند. این معنای سخن اوست که: «و کسی که رسید، بازنگشت، حتی اگر غیر ادیب باشد»، یعنی جامع خیر نباشد. و خیر، امر واحدی است که به دلیل ظهور این امر واحد در صور گوناگون و مختلف، این ادیب آن صور را جمع کرده است، پس در خیریت خود به هر صورت خیری ظاهر شده است، از این رو ادیب نامیده شده، یعنی جامع این صورت خیریه. و خیر در ذات خود، حقیقتی واحد است که در عالم در صور مختلف ظاهر شده است.\n\nو بر خداوند ناپسند نیست\nکه عالم را در یک فرد جمع کند.\n\nپس ادیب به صورت حق (الحق) در عالم ظاهر می‌شود، اجمال آن را به صورت تفصیل می‌دهد و تفصیل آن را به ذات خود اجمال می‌بخشد. و هرگاه این صفت و قوت در مردی نباشد، او ادیب نیست. و اینان کسانی هستند که هرگاه دیده شوند، خدا یاد می‌شود؛ و چون خدا یاد شود، ذکر او تمام عالم را در بر می‌گیرد. پس هر کس خدا را با این زبان یاد کند، عالم را یاد کرده است، زیرا عالم صورت حق (الحق) و اسم ظاهر است که تفصیل در آن واقع شده است. و مدلول آن نیز حق (الحق) است، زیرا عین دلیل بر خود است. پس به خاطر این اسم باطن (الاسم الباطن) که اجمال به آن واقع شده، [علم] برای او حاصل شد. پس علم یکی است و در باطن قرار دارد، و تعلقات آن به تعداد صور معلومات متعدد است. پس عالم، معلومات را با بصیرت خود به گونه‌ای کشف می‌کند که حقایق آنها را احاطه کند، به طوری که معلومات و مقدورات او پایان نمی‌پذیرد. و در عین ممکن (العین الممکن) در پذیرش وجود، بهره‌ای برای نیستی (العدم) باقی نمانده است و حکمی جز معقولیت امکان (الإمکان) ندارد، هرچند هنوز معدوم نشده و عدم آن نیز صحیح نیست؛ زیرا خلاف معلوم، محال الوقوع است. و از وجود، نیستی (العدم) اصلاً صادر نمی‌شود، زیرا در حقیقت آن، صدور نیستی از آن نیست. پس آنچه از اموری که دلیل، عدم آنها را ایجاب می‌کند، معدوم شده است، تنها به خاطر ذات خود یا به دلیل نبود شرط بقای آن در وجود، معدوم شده است. و به همین اندازه، وجود ممکن از وجود حق (الحق) جدا می‌شود؛ زیرا حکم امکان (الإمکان) عقلاً در موجود حادث که برای خود ممکن است، زائل نمی‌شود. و امکان اصلاً بهره‌ای در وجود حق (الحق) ندارد، هرچند وجود اعیان ممکنات پس از وجودشان اصلاً معدوم نمی‌شود، بلکه همان‌طور که مقرر کردیم [باقی می‌ماند]. اما اعراض (الأعراض) که گفتیم در زمان دوم از زمان وجودشان به خودی خود معدوم می‌شوند، حقیقت آنها این است که اسباب عدمی هستند که احکام معقول و گفتنی دارند که نه می‌توان آنها را انکار کرد و نه می‌توان به آنها حکم کرد. پس اگر اعراض، اعیان وجودی بودند، عدم آنها با حکم امکان در آنها محال بود، همان‌طور که در هر قائم به ذات خود از ممکنات محال است. سپس، اگر بخواهی اعیان موجودات را با حدود تفصیل دهی، آنها را در تفصیل، نسبت‌ها و در مجموع، امری وجودی می‌یابی که برای هیچ مخلوقی ممکن نیست که صورت امر را در آن بداند. پس هیچ مخلوقی جز خدا و نه عقل اول (العقل الأول) علمی ندارد که کیفیت اجتماع نسبت‌هایی را درک کند که از اجتماع آنها، عین وجودی مستقلی در ظهور پدید آید که در بی‌نیازی مستقل نیست، بلکه به واسطه امکان (الإمکان) که بر آن حکم شده، نیازمند است. و این علمی است که جز خداوند متعال نمی‌داند و در امکان نیست که غیر خدا آن را بداند و تعلیم را نمی‌پذیرد؛ منظورم این است که خداوند آن را به هر یک از بندگانش که بخواهد، تعلیم دهد. پس علم به آن شبیه علم به ذات حق (ذات الحق) است. و حصول علم به ذات حق (ذات الحق) برای غیر خدا محال است. پس حصول علم به عالم یا به خود انسان یا به نفس هر شیء برای غیر خدا محال است. پس این مسئله را بفهم، زیرا من نشنیده‌ام و نمی‌دانم که کسی به آن توجه داده باشد، هرچند آن را می‌داند. زیرا تصور آن دشوار است، با اینکه بزرگان علما به آن قائل هستند و نمی‌دانند که آن همان است، مانند بلقیس که می‌گوید: **«كَأَنَّهُ هُوَ»** (گویی اوست)، در حالی که او همان است. و همچنین کسی که درباره حق (الحق) در حال ظهورش در صورتی خاص سخن می‌گوید، او را شهود (الشهود) می‌کند، اما نمی‌داند که او همان است. و این، اسارت حکم او در عالم است برای کسی که نظر کند و بصیرت یابد. **«فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ»** (همانا خداوند از جهانیان بی‌نیاز است) به دلیل ظهورش به ذات خود. پس دلیلی بر او جز خودش نیست، زیرا در آنجا جز خداوند متعال نیست. **«وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ»** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}