{
  "id": 12,
  "title": {
    "ar": "الباب الثاني عشر في معرفة دورة فلك سيدنا محمد صلى الله عليه وسلم‏",
    "en": "Chapter Twelve: On the Knowledge of the Cycle of the Sphere (فلك) of Our Master Muhammad (peace be upon him).",
    "ur": "باب نمبر بارہ: ہمارے آقا محمد صلی اللہ علیہ وسلم کے فلک کی گردش کی معرفت میں",
    "fa": "باب دوازدهم در معرفت دور فلک (دورة فلك) سرور ما محمد صلی الله علیه و سلم."
  },
  "content": {
    "ar": "## «الباب الثاني عشر» في معرفة دورة فلك سيدنا محمد صلى الله عليه وسلم‏\n\n\n(بسم الله الرحمن الرحيم) وهي دورة السيادة وأن الزمان قد استدار كهيئته يوم خلقه الله تعالى‏\n\n\n> إلا بأبي من كان ملكا وسيدا *** وآدم بين الماء والطين واقف‏\n\n\n> فذاك الرسول الأبطحي محمد *** له في العلى مجد تليد وطارف‏\n\n\n> أتى بزمان السعد في آخر المدى *** وكانت له في كل عصر مواقف‏\n\n\n> أتى لانكسار الدهر يجبر صدعه *** فأثنت عليه ألسن وعوارف‏\n\n\n> إذا رام أمرا لا يكون خلافه *** وليس لذاك الأمر في الكون صارف‏\n\n\n### [وجود روح محمد في عالم الغيب‏]\n\n\nاعلم أيدك الله أنه لما خلق الله الأرواح المحصورة المدبرة للأجسام بالزمان عند وجود حركة الفلك لتعيين المدة المعلومة عند الله وكان عند أول خلق الزمان بحركته خلق الروح المدبرة روح محمد صلى الله عليه وسلم ثم صدرت الأرواح عند الحركات فكان لها وجود في عالم الغيب دون عالم الشهادة وأعلمه الله بنبوته وبشره بها وآدم لم يكن إلا كما قال بين الماء والطين وانتهى الزمان بالاسم الباطن في حق محمد صلى الله عليه وسلم إلى وجود جسمه وارتباط الروح به انتقل حكم الزمان في جريانه إلى الاسم الظاهر فظهر محمد صلى الله عليه وسلم بذاته جسما وروحا فكان الحكم له باطنا أولا في جميع ما ظهر من الشرائع على أيدي الأنبياء والرسل سلام الله عليهم أجمعين ثم صار الحكم له ظاهرا فنسخ كل شرع أبرزه الاسم الباطن بحكم الاسم الظاهر لبيان اختلاف حكم الاسمين وإن كان المشرع واحدا وهو صاحب الشرع فإنه قال كنت نبيا وما قال كنت إنسانا ولا كنت موجودا وليست النبوة إلا بالشرع المقرر عليه من عند الله فأخبر أنه صاحب‏\nالنبوة قبل وجود الأنبياء الذين هم نوابه في هذه الدنيا كما قررناه فيما تقدم من أبواب هذا الكتاب‏\n\n\n### [استدارة الزمان‏]\n\n\nفكانت استدارته انتهاء دورته بالاسم الباطن وابتداء دورة أخرى بالاسم الظاهر فقال استدار كهيئته يوم خلقه الله في نسبة الحكم لنا ظاهرا كما كان في الدورة الأولى منسوبا إلينا باطنا أي إلى محمد وفي الظاهر منسوبا إلى من نسب إليه من شرع إبراهيم وموسى وعيسى وجميع الأنبياء والرسل‏\n\n\n### [الأنبياء الحرم والأشهر الحرم‏]\n\n\nوفي الأنبياء من الزمان أربعة حرم هود وصالح وشعيب سلام الله عليهم ومحمد صلى الله عليه وسلم وعينها من الزمان ذو القعدة وذو الحجة والمحرم ورجب مضر ولما كانت العرب تنسأ في الشهور فترد المحرم منها حلالا والحلال منها حراما وجاء محمد صلى الله عليه وسلم فرد الزمان إلى أصله الذي حكم الله به عند خلقه فعين الحرم من الشهور على حد ما خلقها الله عليه فلهذا قال في اللسان الظاهر إن الزمان قد استدار كهيئته يوم خلقه الله كذلك استدار الزمان فأظهر محمدا صلى الله عليه وسلم كما ذكرناه جسما وروحا بالاسم الظاهر حسا فنسخ من شرعه المتقدم ما أراد الله أن ينسخ منه وأبقى ما أراد الله أن يبقى منه وذلك من الأحكام خاصة لا من الأصول‏\n\n\n### [ظهور محمد في دورة الميزان‏]\n\n\nولما كان ظهوره بالميزان وهو العدل في الكون وهو معتدل لأن طبعه الحرارة والرطوبة كان من حكم الآخرة فإن حركة الميزان متصلة بالآخرة إلى دخول الجنة والنار ولهذا كان العلم في هذه الأمة أكثر مما كان في الأوائل وأعطى محمد صلى الله عليه وسلم علم الأولين والآخرين لأن حقيقة الميزان تعطي ذلك وكان الكشف أسرع في هذه الأمة مما كان في غيرها لغلبة البرد واليبس على سائر الأمم قبلنا وإن كانوا أذكياء وعلماء فآحاد منهم معينون بخلاف ما هم الناس اليوم عليه ألا ترى هذه الأمة قد ترجمت جميع علوم الأمم ولو لم يكن المترجم عالما بالمعنى الذي دل عليه لفظ المتكلم به لما صح أن يكون هذا مترجما ولا كان ينطلق على ذلك اسم الترجمة فقد علمت هذه الأمة علم من تقدم واختصت بعلوم لم تكن للمتقدمين ولهذا\n\n\nأشار صلى الله عليه وسلم بقوله فعلمت علم الأولين وهم الذين تقدموه ثم قال والآخرين‏\n\n\nوهو علم ما لم يكن عند المتقدمين وهو ما تعلمه أمته من بعده إلى يوم القيامة فقد أخبر أن عندنا علوما لم تكن قبل فهذه شهادة من النبي صلى الله عليه وسلم لنا وهو الصادق بذلك‏\n\n\n### [السيادة المحمدية في العلم والحكم‏]\n\n\nفقد ثبتت له صلى الله عليه وسلم السيادة في العلم في الدنيا وثبتت له أيضا السيادة في الحكم حيث‏\n\n\nقال لو كان موسى حيا ما وسعه إلا إن يتبعني‏\n\n\nويبين ذلك عند نزول عيسى عليه السلام وحكمه فينا بالقرآن فصحت له السيادة في الدنيا بكل وجه ومعنى ثم أثبت السيادة له على سائر الناس يوم القيامة بفتحه باب الشفاعة ولا يكون ذلك لنبي يوم القيامة إلا له صلى الله عليه وسلم فقد شفع صلى الله عليه وسلم في الرسل والأنبياء أن تشفع نعم وفي الملائكة فاذن الله تعالى عند شفاعته في ذلك لجميع من له شفاعة من ملك ورسول ونبي ومؤمن أن يشفع فهو صلى الله عليه وسلم أول شافع بإذن الله وارحم الراحمين آخر شافع يوم القيامة فيشفع الرحيم عند المنتقم أن يخرج من النار من لم يعمل خيرا قط فيخرجهم المنعم المتفضل وأي شرف أعظم من دائرة تدار يكون آخرها أرحم الراحمين وآخر الدائرة متصل بأولها فأي شرف أعظم من شرف محمد صلى الله عليه وسلم حيث كان ابتداء هذه الدائرة حيث اتصل بها آخرها لكما لها فبه سبحانه ابتدأت الأشياء وبه كملت وما أعظم شرف المؤمن حيث تلت شفاعته بشفاعة أرحم الراحمين فالمؤمن بين الله وبين الأنبياء فإن العلم في حق المخلوق وإن كان له الشرف التام الذي لا تجهل مكانته ولكن لا يعطي السعادة في القرب الإلهي إلا بالإيمان فنور الايمان في المخلوق أشرف من نور العلم الذي لا إيمان معه فإذا كان الايمان يحصل عنه العلم فنور ذلك العلم المولد من نور الايمان أعلى وبه يمتاز على المؤمن الذي ليس بعالم فيرفع الله الذين أوتوا العلم من المؤمنين درجات على المؤمنين الذين لم يؤتوا العلم ويزيد العلم بالله‏\n\n\nفإن رسول الله صلى الله عليه وسلم يقول لأصحابه أنتم أعلم بمصالح دنياكم‏\n\n\n### [الامتيازات المحمدية من وحي أمر السماوات السبع‏]\n\n\nفلا فلك أوسع من فلك محمد صلى الله عليه وسلم فإن له الإحاطة وهي لمن خصه الله بها من أمته بحكم التبعية فلنا الإحاطة بسائر الأمم ولذلك كنا شهداء على الناس فأعطاه الله من وحي أمر السموات ما لم يعط غيره في طالع مولده فمن الأمر المخصوص بالسماء الأولى من هناك لم يبدل حرف من القرآن ولا كلمة ولو ألقى الشيطان في تلاوته ما ليس منها بنقص أو زيادة لنسخ الله ذلك وهذا عصمة ومن ذلك الثبات ما نسخت شريعته بغيرها بل ثبتت محفوظة واستقرت بكل عين ملحوظة ولذلك تستشهد بها كل طائفة ومن الأمر المخصوص بالسماء الثانية من هناك أيضا خص‏\nبعلم الأولين والآخرين والتؤدة والرحمة والرفق وكانَ بِالْمُؤْمِنِينَ رَحِيماً وما أظهر في وقت غلظة على أحد إلا عن أمر إلهي حين قيل له جاهِدِ الْكُفَّارَ والْمُنافِقِينَ واغْلُظْ عَلَيْهِمْ فأمر به لما لم يقتض طبعه ذلك وإن كان بشرا يغضب لنفسه ويرضى لنفسه فقد قدم لذلك دواءنا فما يكون في ذلك الغضب رحمة من حيث لا يشعر بها في حال الغضب فكان يدل بغضبه مثل دالته برضاه وذلك لأسرار عرفناها ويعرفها أهل الله منا فصحت له السيادة على العالم من هذا الباب فإن غير أمته قيل فيهم يُحَرِّفُونَهُ من بَعْدِ ما عَقَلُوهُ وهُمْ يَعْلَمُونَ فأضلهم الله على علم وتولى الله فينا حفظ ذكره فقال إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وإِنَّا لَهُ لَحافِظُونَ لأنه سمع العبد وبصره ولسانه ويده واستحفظ كتابه غير هذه الأمة فحرفوه ومن الأمر المخصوص من وحي السماء الثالثة من هناك أيضا السيف الذي بعثه به والخلافة واختص بقتال الملائكة معه منها أيضا فإن ملائكة هذه السماء قاتلت معه يوم بدر ومن هذه السماء أيضا بعث من قوم ليس لهم همة إلا في قرى الأضياف ونحر الجزر والحروب الدائمة وسفك الدماء وبهذا يتمدحون ويمدحون قيل في بعضهم‏\n\n\n> ضروب بنصل السيف سوق سمانها *** إذا عدموا زادا فإنك عاقر\n\n\n### «و قال الآخر منهم يمدح قومه»\n\n\n> لا يبعدن قومي الذين همو *** سم العداة وآفة الجزر\n\n\n> النازلون بكل معترك *** والطيبون معاقد الأزر\n\n\nفمدحهم بالكرم والشجاعة والعفة يقول عنترة بن شداد في حفظ الجار في أهله‏\n\n\n> وأغض طرفي ما بدت لي جارتي *** حتى يواري جارتي مأواها\n\n\nولا خفاء عند كل أحد بفضل العرب على العجم بالكرم والحماسة والوفاء وإن كان في العجم كرماء وشجعان ولكن آحاد كما إن في العرب جبناء وبخلاء ولكن أحاد وإنما الكلام في الغالب لا في النادر وهذا ما لا ينكره أحد فهذا مما أوحى الله في هذه السماء فهذا كله من الأمر الذي يتنزل بين السماء والأرض لمن فهم ولو ذكرنا على التفصيل ما في كل سماء من الأمر الذي أوحى الله سبحانه فيها لأبرزنا من ذلك عجائب ربما كان ينكرها بعض من ينظر في ذلك العلم من طريق الرصد والتسيير من أهل التعاليم ويحار المنصف منهم فيه إذا سمعه ومن الوحي المأمور به في السماء الرابعة نسخه بشريعته جميع الشرائع وظهور دينه على جميع الأديان عند كل رسول ممن تقدمه وفي كل كتاب منزل فلم يبق لدين من الأديان حكم عند الله إلا ما قرر منه فبتقريره ثبت فهو من شرعه وعموم رسالته وإن كان بقي من ذلك حكم فليس هو من حكم الله إلا في أهل الجزية خاصة وإنما قلنا ليس هو حكم الله لأنه سماه باطلا فهو على من اتبعه لا له فهذا أعني بظهور دينه على جميع الأديان كما قال النابغة في مدحه‏\n\n\n> أ لم تر أن الله أعطاك سورة *** ترى كل ملك دونها يتذبذب‏\n\n\n> بأنك شمس والملوك كواكب *** إذا طلعت لم يبد منهن كوكب‏\n\n\nوهذه منزلة محمد صلى الله عليه وسلم ومنزلة ما جاء به من الشرع من الأنبياء وشرائعهم سلام الله عليهم أجمعين فإن أنوار الكواكب اندرجت في نور الشمس فالنهار لنا والليل وحده لأهل الكتب إذا أعطوا الْجِزْيَةَ عَنْ يَدٍ وهُمْ صاغِرُونَ وقد بسطنا في التنزلات الموصلية من أمر كل سماء ما إذا وقفت عليه عرفت بعض ما في ذلك ومن الوحي المأمور به في السماء الخامسة من هناك المختص بمحمد صلى الله عليه وسلم أنه ما ورد قط عن نبي من الأنبياء أنه حبب إليه النساء إلا محمد صلى الله عليه وسلم وإن كانوا قد رزقوا منهن كثيرا كسليمان عليه السلام وغيره ولكن كلامنا في كونه حبب إليه وذلك أنه صلى الله عليه وسلم كان نبيا وآدم بين الماء والطين كما قررناه وعلى الوجه الذي شرحناه فكان منقطعا إلى ربه لا ينظر معه إلى كون من الأكوان لشغله بالله عنه فإن النبي مشغول بالتلقي من الله ومراعاة الأدب فلا يتفرغ إلى شي‏ء دونه فحبب الله إليه النساء فأحبهن عناية من الله بهن فكان صلى الله عليه وسلم بحبهن بكون الله حببهن إليه خرج مسلم في صحيحه في أبواب الايمان أن رجلا قال لرسول الله صلى الله عليه وسلم‏\n\n\nإني أحب أن يكون نعلي حسنا وثوبي‏\nفقال رسول الله صلى الله عليه وسلم إن الله جميل يحب الجمال‏\n\n\nومن هذه السماء حب الطيب وكان من سنته النكاح لا التبتل وجعل النكاح عبادة للسر الإلهي الذي أودع فيه وليس إلا في النساء وذلك ظهور الأعيان للثلاثة الأحكام التي تقدم ذكرها في الإنتاج عن المقدمتين والرابط الذي جعله علة الإنتاج فهذا الفضل وما شاكله مما اختص به محمد صلى الله عليه وسلم وزاد فيه بنكاح الهبة كما جعل في أمته فيما يبين لها من النكاح لمن لا شي‏ء له من الأعواض بما يحفظه من القرآن خاصة لا أنه يعلمها وهذا وإن لم يقو قوة الهبة ففيه اتساع للامة وليس في الوسع استيفاء ما أوحى الله من الأمر في كل سماء ومن الأمر الموحى في السماء السادسة إعجاز القرآن والذي أعطيه صلى الله عليه وسلم من جوامع الكلم من هذه السماء تنزل إليه ولم يعط ذلك نبي قبله وقد قال أعطيت ستا لم يعطهن نبي قبلي وكل ذلك أوحي في السموات من قوله وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها فجعل في كل سماء ما يصلح تنفيذه في الأرض في هذا الخلق فكان من ذلك أن بعث وحده إلى الناس كافة فعمت رسالته وهذا مما أوحى الله به في السماء الرابعة ونصر بالرعب وهو مما أوحى الله به في السماء الثالثة من هناك ومنها ما حلل الله له من الغنائم وجعلت له الأرض مسجدا وطهورا من السماء الثانية من هناك أوتيت جوامع الكلم من أمر وحي السماء السادسة ومن أمر هذه السماء ما خصه الله به من إعطائه إياه مفاتيح خزائن الأرض ومن الوحي المأمور به في السماء السابعة من هناك وهي السماء الدنيا التي تلينا كون الله خصه بصورة الكمال فكملت به الشرائع وكان خاتم النبيين ولم يكن ذلك لغيره صلى الله عليه وسلم فبهذا وأمثاله انفرد بالسيادة الجامعة للسيادات كلها والشرف المحيط الأعم صلى الله عليه وسلم فهذا قد نبهنا على ما حصل له في مولده من بعض ما أوحى الله به في كل سماء من أمره‏\n\n\n### [الميزان والزمان‏]\n\n\nوقوله الزمان ولم يقل الدهر ولا غيره ينبه على وجود الميزان فإنه ما خرج عن الحروف التي في الميزان بذكر الزمان وجعل ياء الميزان مما يلي الزاي وخفف الزاي وعددها في الزمان إشعارا بأن في هذه الزاي حرفا مدغما فكان أول وجود الزمان في الميزان للعدل الروحاني وفي الاسم الباطن لمحمد صلى الله عليه وسلم بقوله كنت نبيا وآدم بين الماء والطين ثم استدار بعد انقضاء دورة الزمان التي هي ثمانية وسبعون ألف سنة ثم ابتدأت دورة أخرى من الزمان بالاسم الظاهر فظهر فيها جسم محمد صلى الله عليه وسلم وظهرت شريعته على التعيين والتصريح لا بالكناية واتصل الحكم بالآخرة فقال تعالى ونَضَعُ الْمَوازِينَ الْقِسْطَ لِيَوْمِ الْقِيامَةِ وقيل لنا وأَقِيمُوا الْوَزْنَ بِالْقِسْطِ ولا تُخْسِرُوا الْمِيزانَ وقال تعالى والسَّماءَ رَفَعَها ووَضَعَ الْمِيزانَ فبالميزان أَوْحى‏ في كُلِّ سَماءٍ أَمْرَها وبه قدر في الأرض أقواتها ونصبه الحق في العالم في كل شي‏ء فميزان معنوي وميزان حسي لا يخطئ أبدا فدخل الميزان في الكلام وفي جميع الصنائع المحسوسة وكذلك في المعاني إذ كان أصل وجود الأجسام والأجرام وما تحمله من المعاني عند حكم الميزان وكان وجود الميزان وما فوق الزمان عن الوزن الإلهي الذي يطلبه الاسم الحكيم ويظهره الحكم العدل لا إله إلا هو وعن الميزان ظهر العقرب وما أوحى الله فيه من الأمر الإلهي والقوس والجدي والدلو والحوت والحمل والثور والجوزاء والسرطان والأسد والسنبلة\n\n\n### [انتهاء الدورة الزمانية إلى الميزان‏]\n\n\nوانتهت الدورة الزمانية إلى الميزان لتكرار الدور فظهر محمد صلى الله عليه وسلم وكان له في كل جزء من أجزاء الزمان حكم اجتمع فيه بظهوره صلى الله عليه وسلم وهذه الأسماء أسماء ملائكة خلقهم الله وهم الاثنا عشر ملكا وجعل لهم الله مراتب في الفلك المحيط وجعل بيد كل ملك ما شاء أن يجعله مما يبرزه فيمن هو دونهم إلى الأرض حكمة فكانت روحانية محمد صلى الله عليه وسلم تكتسب عند كل حركة من الزمان أخلاقا بحسب ما أودع الله في تلك الحركات من الأمور الإلهية فما زالت تكتسب هذه الصفات الروحانية قبل وجود تركيبها إلى أن ظهرت صورة جسمه في عالم الدنيا بما جبله الله عليه من الأخلاق المحمودة فقيل فيه وإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ فكان ذا خلق لم يكن ذا تخلق ولما كانت الأخلاق تختلف أحكامها باختلاف المحل الذي ينبغي أن يقابل بها احتاج صاحب الخلق إلى علم يكون عليه حتى يصرف في ذلك المحل الخلق الذي يليق به عن أمر الله فيكون قربة إلى الله فلذلك تنزلت الشرائع لتبين للناس محال أحكام الأخلاق التي جبل الإنسان عليها فقال الله في مثل ذلك ولا تقل لهما أف لوجود التأفيف في خلقه فأبان عن المحل الذي لا ينبغي أن يظهر فيه حكم هذا الخلق ثم بين المحل الذي ينبغي أن يظهر فيه هذا الخلق فقال أُفٍّ لَكُمْ ولِما تَعْبُدُونَ من دُونِ الله‏\nوقال تعالى فَلا تَخافُوهُمْ فأبان عن المحل الذي ينبغي أن لا يظهر فيه خلق الخوف ثم قال لهم خافُونِ فأبان لهم حيث ينبغي أن يظهر حكم هذه الصفة وكذلك الحسد والحرص وجميع ما في هذه النشأة الطبيعية الظاهر حكم روحانيتها فيها قد أبان الله لنا حيث نظهرها وحيث نمنعها فإنه من المحال إزالتها عن هذه النشأة إلا بزوالها لأنها عينها والشي‏ء لا يفارق نفسه‏\n\n\nقال صلى الله عليه وسلم لا حسد إلا في اثنتين وقال زادك الله حرصا ولا تعد\n\n\nوإنما قلنا الظاهر حكم روحانيتها فيها تحرزنا بذلك من أجل أهل الكشف والعلماء الراسخين في العلم من المحققين العالمين فإن المسمى بالجماد والنبات عندنا لهم أرواح بطنت عن إدراك غير أهل الكشف إياها في العادة لا يحس بها مثل ما يحسها من الحيوان فالكل عند أهل الكشف حيوان ناطق بل حي ناطق غير إن هذا المزاج الخاص يسمى إنسانا لا غير بالصورة ووقع التفاضل بين الخلائق في المزاج فإنه لا بد في كل ممتزج من مزاج خاص لا يكون إلا له به يتميز عن غيره كما يجتمع مع غيره في أمر فلا يكون عين ما يقع به الافتراق والتميز عين ما يقع به الاشتراك وعدم التميز فاعلم ذلك وتحققه‏\n\n\n### [العالم كله حي عالم ناطق‏]\n\n\nقال تعالى وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وشي‏ء نكرة ولا يسبح إلا حي عاقل عالم بمسبحه وقد ورد أن المؤذن يشهد له مدى صوته من رطب ويابس والشرائع والنبوات من هذا القبيل مشحونة ونحن زدنا مع الايمان بالأخبار الكشف فقد سمعنا الأحجار تذكر الله رؤية عين بلسان نطق تسمعه آذاننا منها وتخاطبنا مخاطبة العارفين بجلال الله مما ليس يدركه كل إنسان فكل جنس من خلق الله أمة من الأمم فطرهم الله على عبادة تخصهم أوحى بها إليهم في نفوسهم فرسولهم من ذواتهم إعلام من الله بإلهام خاص جبلهم عليه كعلم بعض الحيوانات بأشياء يقصر عن إدراكها المهندس النحر يرو علمهم على الإطلاق بمنافعهم فيما يتناولونه من الحشائش والمأكل وتجنب ما يضرهم من ذلك كل ذلك في فطرتهم كذلك المسمى جمادا ونباتا أخذ الله بأبصارنا وأسماعنا عماهم عليه من النطق ولا تقوم الساعة حتى تكلم الرجل فخذه بما فعله أهله جعل الجهلاء من الحكماء هذا إذا صح إيمانهم به من باب العلم بالاختلاج يريدون به علم الزجر وإن كان علم الزجر علما صحيحا في نفس الأمر وأنه من أسرار الله ولكن ليس هو مقصود الشارع في هذا الكلام فكان له صلى الله عليه وسلم الكشف الأتم فيرى ما لا نرى ولقد نبه عليه السلام على أمر عمل عليه أهل الله فوجدوه صحيحا\n\n\nقوله لو لا تزييد في حديثكم وتمريج في قلوبكم لرأيتم ما أرى ولسمعتم ما أسمع‏\n\n\nفخص برتبة الكمال في جميع أموره ومنها الكمال في العبودية فكان عبدا صرفا لم يقم بذاته ربانية على أحد وهي التي أوجبت له السيادة وهي الدليل على شرفه على الدوام وقد قالت عائشة كان رسول الله صلى الله عليه وسلم يذكر الله على كل أحيانه‏\n\n\nولنا منه ميراث وافر وهو أمر يختص بباطن الإنسان وقوله وقد يظهر خلاف ذلك بأفعاله مع تحققه بالمقام فيلتبس على من لا معرفة له بالأحوال فقد بينا في هذا الباب ما مست الحاجة إليه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Twelve: Concerning the Knowledge of the Cycle of the Sphere of our Master Muhammad (may Allah bless him and grant him peace).\n\n(In the Name of Allah, the Most Compassionate, the Most Merciful.) This is the Cycle of Sovereignty (دورة السيادة), and that Time (الزمان) has returned to the form it held on the Day Allah created it.\n\nExcept for my father, who was a King and a Master,\nWhile Adam stood between water and clay.\nThat is the Messenger, the Abṭaḥī, Muḥammad,\nHe possesses in the Heights glory both ancient and new.\nHe came with the time of felicity at the end of the span,\nAnd he had stations (مواقف) in every age.\nHe came to mend the fracture of Eternity (الدهر), repairing its crack,\nSo tongues and gnostics (عوارف) praised him.\nIf he intends a matter, there is no opposing it,\nAnd there is no turning away that matter in the Cosmos.\n\n### [The Existence of the Spirit of Muhammad in the World of the Unseen]\n\nKnow, may Allah support you, that when Allah created the delimited Spirits (الأرواح المحصورة) that govern bodies through Time (الزمان) upon the existence of the movement of the Sphere (الفلك)—in order to define the duration known to Allah—at the very beginning of the creation of Time through its movement, He created the governing Spirit (الروح المدبرة), the Spirit of Muhammad (may Allah bless him and grant him peace). Then the other spirits issued forth upon the movements. Thus, his Spirit had existence (وجود) in the World of the Unseen (عالم الغيب) but not in the World of Witnessing (عالم الشهادة). Allah informed him of his prophethood and gave him glad tidings of it while Adam was, as he said, \"between water and clay.\"\n\nTime (الزمان), under the governance of the Inner Name (الاسم الباطن) concerning Muhammad (may Allah bless him and grant him peace), reached the existence of his body and the attachment of the Spirit to it. The ruling of Time in its flow then transferred to the Outer Name (الاسم الظاهر). Thus, Muhammad (may Allah bless him and grant him peace) appeared in his essence, body, and spirit. The ruling belonged to him inwardly (باطنا) first, in all the Divine Laws (الشرائع) that appeared through the hands of the Prophets and Messengers (peace be upon them all). Then the ruling became outwardly (ظاهرا) his, so he abrogated every Law brought forth by the Inner Name (الاسم الباطن) by the ruling of the Outer Name (الاسم الظاهر), demonstrating the difference in the ruling of the two Names, even though the Lawgiver is one, and He is the Master of the Law (صاحب الشرع). For he said, \"I was a Prophet,\" and he did not say, \"I was a human,\" nor \"I was existent.\" Prophethood is nothing but the Law established upon him from Allah. Thus, he informed us that he was the possessor of Prophethood before the existence of the Prophets who are his deputies in this world, as we established in the preceding chapters of this book.\n\n### [The Return of Time]\n\nHis return (استدارته) was the conclusion of his cycle under the Inner Name (الاسم الباطن) and the beginning of another cycle under the Outer Name (الاسم الظاهر). Thus, he said, \"It has returned to the form it held on the Day Allah created it,\" in the sense that the ruling is attributed to us outwardly (ظاهرا), just as it was attributed to us inwardly (باطنا)—meaning to Muhammad—in the first cycle. Outwardly, it was attributed to those to whom it was ascribed, such as the Law of Abraham, Moses, Jesus, and all the Prophets and Messengers.\n\n### [The Sacred Prophets and the Sacred Months]\n\nAmong the Prophets of Time (الزمان) there are four sacred ones (حرم): Hud, Salih, Shu'ayb (peace be upon them), and Muhammad (may Allah bless him and grant him peace). Their corresponding sacred months (الأشهر الحرم) in Time are Dhu al-Qa'dah, Dhu al-Hijjah, Muharram, and Rajab Muḍar. Since the Arabs used to postpone (نسأ) the months, making the sacred months permissible and the permissible months sacred, Muhammad (may Allah bless him and grant him peace) came and restored Time to its origin, which Allah decreed upon its creation. He designated the sacred months according to the way Allah created them. For this reason, he said in the outward expression (اللسان الظاهر) that Time has returned to the form it held on the Day Allah created it. Likewise, Time revolved and manifested Muhammad (may Allah bless him and grant him peace), as we mentioned, body and spirit, perceptibly (حسا) through the Outer Name (الاسم الظاهر). Thus, he abrogated from the preceding Law what Allah willed to abrogate and preserved what Allah willed to preserve, and this pertains specifically to the rulings (الأحكام), not the fundamental principles (الأصول).\n\n### [The Manifestation of Muhammad in the Cycle of the Balance]\n\nSince his manifestation occurred under the Balance (الميزان)—which is Justice (العدل) in the Cosmos—and since it is temperate (معتدل) because its nature is heat and moisture, it was subject to the ruling of the Hereafter (الآخرة). The movement of the Balance is connected to the Hereafter until the entry into Paradise and the Fire. For this reason, Knowledge (العلم) in this Community (الأمة) is greater than it was among the ancients. Muhammad (may Allah bless him and grant him peace) was granted the knowledge of the ancients and the moderns (علم الأولين والآخرين) because the Reality of the Balance (حقيقة الميزان) necessitates this. Unveiling (الكشف) was also swifter in this Community than in others, due to the dominance of coldness and dryness over the rest of the communities before us. Although they were intelligent and knowledgeable, only specific individuals among them were designated, unlike the general state of people today. Do you not see that this Community has translated all the sciences of previous communities? Had the translator not possessed knowledge of the meaning indicated by the speaker's word, it would not be correct to call him a translator, nor would the term \"translation\" apply to that act. Thus, this Community has known the knowledge of those who preceded it and has been distinguished by sciences that the ancients did not possess. This is what he (may Allah bless him and grant him peace) alluded to when he said, \"I was taught the knowledge of the ancients\"—meaning those who preceded him—and then he said, \"and the moderns (الآخرين),\" which is the knowledge that the ancients did not possess, namely, what his Community learns after him until the Day of Resurrection. Thus, he informed us that we possess knowledge that did not exist before. This is a testimony from the Prophet (may Allah bless him and grant him peace) in our favor, and he is truthful in that.\n\n### [The Muhammadan Sovereignty in Knowledge and Ruling]\n\nSovereignty (السيادة) in Knowledge (العلم) has thus been established for him (may Allah bless him and grant him peace) in this world, and Sovereignty in Ruling (الحكم) has also been established for him, as he said, \"Had Moses been alive, he would have had no choice but to follow me.\" This is further demonstrated by the descent of Jesus (peace be upon him) and his ruling among us according to the Quran. Thus, Sovereignty is confirmed for him in this world in every aspect and meaning. Furthermore, Sovereignty over all people on the Day of Resurrection is established for him by his opening the door of Intercession (الشفاعة). This will not be granted to any Prophet on that Day except him (may Allah bless him and grant him peace). He intercedes for the Messengers and Prophets to intercede, and indeed, for the Angels. When he intercedes in this matter, Allah grants permission to everyone who has the right to intercede—be they Angel, Messenger, Prophet, or believer—to do so. He (may Allah bless him and grant him peace) is the first intercessor by Allah's permission, and the Most Merciful of the Merciful (أرحم الراحمين) is the last intercessor on the Day of Resurrection. The Merciful intercedes with the Avenger (المنتقم) to bring out of the Fire those who never did any good deed, and the Benefactor, the Gracious One (المنعم المتفضل), brings them out. What honor is greater than a revolving circle whose end is the Most Merciful of the Merciful, and whose end is connected to its beginning? What honor is greater than the honor of Muhammad (may Allah bless him and grant him peace), since he was the beginning of this circle, and its end connected to him due to his perfection? By Him (Glorified is He) things began, and by Him they were perfected. How great is the honor of the believer, whose intercession follows the intercession of the Most Merciful of the Merciful! The believer stands between Allah and the Prophets. Although Knowledge (العلم), concerning the created being (المخلوق), possesses complete honor whose status is undeniable, it does not grant felicity in the Divine Proximity (القرب الإلهي) except through Faith (الإيمان). Thus, the light of Faith in the created being is more honorable than the light of Knowledge that is devoid of Faith. If Knowledge results from Faith, then the light of that Knowledge, generated from the light of Faith, is superior. By this, the knowledgeable believer is distinguished above the believer who is not knowledgeable. Allah raises those among the believers who have been given Knowledge (الذين أوتوا العلم) in degrees above the believers who have not been given Knowledge. And Knowledge of Allah increases. For the Messenger of Allah (may Allah bless him and grant him peace) said to his Companions, \"You are more knowledgeable concerning the affairs of your world.\"\n\n### [The Muhammadan Distinctions from the Revelation of the Seven Heavens]\n\nThere is no Sphere (فلك) wider than the Sphere of Muhammad (may Allah bless him and grant him peace), for he possesses the Comprehensiveness (الإحاطة), which is also granted to those of his Community whom Allah has singled out, by virtue of their following him. Thus, we possess comprehensiveness over all other communities, and for this reason, we are witnesses over mankind. Allah granted him, at the time of his birth (طالع مولده), revelations concerning the command (أمر) of the Heavens that He did not grant to anyone else.\n\nFrom the command specific to the First Heaven: Not a single letter or word of the Quran has been altered. Even if Satan were to cast into his recitation something that was not part of it, by way of omission or addition, Allah would abrogate that. This is infallibility (عصمة). And from this stability (الثبات) is that his Law (شريعته) was not abrogated by any other; rather, it remained preserved and established, observed by every eye. For this reason, every faction uses it as evidence.\n\nFrom the command specific to the Second Heaven: He was also singled out there with the knowledge of the ancients and the moderns (علم الأولين والآخرين), deliberation (التؤدة), mercy (الرحمة), and gentleness. <<كَانَ بِالْمُؤْمِنِينَ رَحِيماً>> (He was to the believers Merciful). He never displayed harshness toward anyone except by Divine Command, such as when he was told: <<جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ>> (Strive against the disbelievers and the hypocrites, and be harsh upon them). He was commanded to do this because his nature did not necessitate it. Although he was a human who would become angry for himself and pleased for himself, we have been given a remedy for this: that in that anger there is mercy, even if it is not perceived during the state of anger. Thus, his anger indicated the same as his pleasure. This is due to secrets known to us and known to the People of Allah (أهل الله) among us. Sovereignty (السيادة) over the world is confirmed for him through this door. For concerning communities other than his, it was said: <<يُحَرِّفُونَهُ مِنْ بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ>> (They alter it after they have understood it, while they know). Thus, Allah led them astray despite their knowledge. But Allah took charge of preserving His Remembrance (ذكره) concerning us, saying: <<إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ>> (Indeed, it is We who sent down the Remembrance, and indeed, We will be its Guardian). This is because He entrusted His Book to the hearing, sight, tongue, and hand of the servant, and He entrusted it to communities other than this one, so they altered it.\n\nFrom the command specific to the revelation of the Third Heaven: Also from there is the sword (السيف) with which he was sent, and the Caliphate (الخلافة). He was also singled out with the fighting of the Angels alongside him from this Heaven, for the Angels of this Heaven fought with him on the Day of Badr. Also from this Heaven is that he was sent from a people whose only concern was hosting guests (قرى الأضياف), slaughtering camels (نحر الجزر), constant warfare, and shedding blood. They boast and are praised for these things. One of them said:\n\nStriking with the sword's blade the shanks of their fat camels,\nIf they lack provisions, then you are barren.\n\nAnd another of them said, praising his people:\n\nMay my people not perish, who are\nThe poison of enemies and the bane of camels,\nThose who descend into every battlefield,\nAnd those who are pure in the tying of their waist wraps [i.e., chaste].\n\nThey were praised for generosity, bravery, and chastity. Antarah ibn Shaddad said concerning the protection of his neighbor's family:\n\nI lower my gaze whenever my neighbor appears,\nUntil my neighbor is concealed in her dwelling.\n\nIt is not hidden from anyone the superiority of the Arabs over the non-Arabs (العجم) in generosity, courage, and loyalty, even though there are generous and brave individuals among the non-Arabs, but they are few, just as there are cowards and misers among the Arabs, but they are few. The discussion concerns the general rule, not the exception, and this is something no one denies. This is part of what Allah revealed in this Heaven. All of this is part of the command that descends between the Heaven and the Earth for those who understand. If we were to mention in detail the command that Allah (Glorified is He) revealed in every Heaven, we would bring forth wonders that might be denied by some who study that science through observation (الرصد) and celestial movement (التسيير) among the scholars of the teachings, and the fair-minded among them would be perplexed upon hearing it.\n\nFrom the command revealed in the Fourth Heaven: The abrogation of all previous Divine Laws (الشرائع) by his Law, and the manifestation of his religion over all religions, superseding every Messenger who preceded him and every revealed Book. No religion remains with a ruling before Allah except what was confirmed by his confirmation; thus, it is established and belongs to his Law and the universality of his message. If any ruling remains from those previous laws, it is not a ruling of Allah except specifically for the People of the Covenant (أهل الجزية). We say it is not a ruling of Allah because He called it falsehood (باطلا); thus, it is against those who follow it, not for them. This is what I mean by the manifestation of his religion over all religions, as Al-Nabigha said in his praise:\n\nDo you not see that Allah has given you a stature\nBeneath which every king trembles?\nThat you are the sun and the kings are stars,\nWhen you rise, no star is visible.\n\nThis is the station (منزلة) of Muhammad (may Allah bless him and grant him peace) and the station of the Law he brought, relative to the Prophets and their Laws (peace be upon them all). The lights of the stars are subsumed within the light of the sun. The day belongs to us, and the night belongs solely to the People of the Book when they pay <<الْجِزْيَةَ عَنْ يَدٍ وَهُمْ صَاغِرُونَ>> (the Jizya [tribute] willingly while they are humbled). We have elaborated in *Al-Tanazzulat al-Mawsiliyya* concerning the command of every Heaven, such that if you examine it, you will know some of what is contained therein.\n\nFrom the command revealed in the Fifth Heaven, specific to Muhammad (may Allah bless him and grant him peace): It was never reported that any Prophet had women made beloved to him except Muhammad (may Allah bless him and grant him peace), even though many of them were granted women, such as Solomon (peace be upon him) and others. But our discussion is about the fact that they were made beloved to him. This is because he (may Allah bless him and grant him peace) was a Prophet while Adam was between water and clay, as we established and explained. He was devoted solely to his Lord, not looking toward any cosmic entity (كون من الأكوان) because he was preoccupied with Allah, away from creation. The Prophet is busy receiving from Allah and observing proper conduct (الأدب), so he does not have leisure for anything less than that. Thus, Allah made women beloved to him, and he loved them as a Divine favor toward them. His love for them was due to Allah making them beloved to him. Muslim recorded in his *Sahih*, in the chapters on Faith, that a man said to the Messenger of Allah (may Allah bless him and grant him peace), \"I love that my sandals be beautiful and my clothes [be beautiful].\" The Messenger of Allah (may Allah bless him and grant him peace) replied, \"Indeed, Allah is Beautiful and loves beauty.\"\n\nAlso from this Heaven is the love of perfume (الطيب). It was part of his Sunnah to marry, not to practice celibacy (التبتل). He made marriage an act of worship due to the Divine Secret (السر الإلهي) deposited within it, and this is found only in women. That is the manifestation of the Entities (الأعيان) for the three rulings mentioned previously concerning the production from the two premises and the link that was made the cause of the production. This favor and similar ones are specific to Muhammad (may Allah bless him and grant him peace). He was further distinguished by the marriage of donation (نكاح الهبة), just as it was established in his Community concerning marriage for those who have no compensation, by means of what the man memorizes of the Quran specifically, not that he teaches it. Although this does not possess the strength of the donation, it provides latitude for the Community. It is not possible to fully enumerate what Allah revealed of the command in every Heaven.\n\nFrom the command revealed in the Sixth Heaven: The inimitability of the Quran (إعجاز القرآن) and the comprehensive words (جوامع الكلم) granted to him (may Allah bless him and grant him peace) descended to him from this Heaven, and no Prophet before him was given this. He said, \"I have been given six things that no Prophet before me was given.\" All of this was revealed in the Heavens, based on His saying: <<وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (And He revealed in every heaven its command). Thus, He placed in every Heaven what is suitable for execution on Earth concerning this Creation (الخلق). Among these was that he alone was sent to all mankind, so his message was universal. This was revealed by Allah in the Fourth Heaven. He was granted victory through awe (نصر بالرعب), which was revealed by Allah in the Third Heaven. Also from there is what Allah made lawful for him concerning war spoils (الغنائم), and that the Earth was made a place of prayer and purification for him, which came from the Second Heaven. The comprehensive words (جوامع الكلم) were granted from the command revealed in the Sixth Heaven. And from the command of this Heaven is that Allah singled him out by granting him the keys to the treasures of the Earth.\n\nFrom the command revealed in the Seventh Heaven, which is the nearest Heaven (السماء الدنيا) to us: That Allah singled him out with the form of Perfection (صورة الكمال). Through him, the Divine Laws were perfected, and he was the Seal of the Prophets (خاتم النبيين). This was not granted to anyone else (may Allah bless him and grant him peace). By this and similar distinctions, he was uniquely endowed with the Sovereignty that encompasses all sovereignties, and the most comprehensive and general honor (الشرف المحيط الأعم). Thus, we have drawn attention to some of what he attained at his birth from the command that Allah revealed in every Heaven.\n\n### [The Balance and Time]\n\nHis saying \"Time\" (الزمان) and not \"Eternity\" (الدهر) or anything else, draws attention to the existence of the Balance (الميزان). For he did not depart from the letters found in *al-Mīzān* (م ي ز ا ن) when mentioning *al-Zamān* (ز م ا ن). He placed the *yā’* of *al-Mīzān* near the *zāy*, and he lightened the *zāy* and its number in *al-Zamān*, indicating that there is an assimilated letter (حرف مدغم) in this *zāy*. Thus, the first existence of Time (الزمان) was in the Balance (الميزان) for spiritual justice (العدل الروحاني) and under the Inner Name (الاسم الباطن) for Muhammad (may Allah bless him and grant him peace), as indicated by his saying, \"I was a Prophet while Adam was between water and clay.\" Then it revolved after the conclusion of the cycle of Time, which is seventy-eight thousand years. Then another cycle of Time began under the Outer Name (الاسم الظاهر), in which the body of Muhammad (may Allah bless him and grant him peace) appeared, and his Law appeared with specific designation and explicit declaration, not by allusion. The ruling connected to the Hereafter. Thus, Allah the Exalted said: <<وَنَضَعُ الْمَوَازِينَ الْقِسْطَ لِيَوْمِ الْقِيَامَةِ>> (And We will set up the scales of justice [al-Mawāzīn al-Qisṭ] for the Day of Resurrection). And it was said to us: <<وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ وَلَا تُخْسِرُوا الْمِيزَانَ>> (And establish the weight with justice and do not make deficient the Balance [al-Mīzān]). And Allah the Exalted said: <<وَالسَّمَاءَ رَفَعَهَا وَوَضَعَ الْمِيزَانَ>> (And the heaven He raised and set up the Balance [al-Mīzān]). It is by the Balance that He <<أَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (revealed in every heaven its command), and by it He determined the sustenance (أقواتها) on Earth. The Real (الحق) established it in the Cosmos in everything. There is a spiritual Balance (ميزان معنوي) and a sensible Balance (ميزان حسي) that never errs. Thus, the Balance entered into speech and into all sensible crafts, as well as into meanings, since the origin of the existence of bodies (الأجسام) and celestial bodies (الأجرام) and the meanings they carry is subject to the ruling of the Balance. The existence of the Balance, and what is above Time (الزمان), originated from the Divine Weighing (الوزن الإلهي) sought by the Name the Wise (الاسم الحكيم) and manifested by the Ruling the Just (الحكم العدل)—there is no god but He. From the Balance appeared Scorpio (العقرب) and what Allah revealed therein of the Divine Command, and Sagittarius (القوس), Capricorn (الجدي), Aquarius (الدلو), Pisces (الحوت), Aries (الحمل), Taurus (الثور), Gemini (الجوزاء), Cancer (السرطان), Leo (الأسد), and Virgo (السنبلة).\n\n### [The Conclusion of the Temporal Cycle at the Balance]\n\nThe cycle of Time (الدورة الزمانية) concluded at the Balance (الميزان) due to the repetition of the cycles. Thus, Muhammad (may Allah bless him and grant him peace) appeared, and in every part of Time, he possessed a ruling that was gathered in him upon his manifestation (ظهوره). These names [of the constellations] are the names of Angels whom Allah created, the twelve Angels. Allah assigned them stations (مراتب) in the encompassing Sphere (الفلك المحيط), and He placed in the hand of each Angel whatever He willed to place, which they manifest in those below them down to the Earth, as a matter of wisdom.\n\nThe spirituality (روحانية) of Muhammad (may Allah bless him and grant him peace) acquired characteristics (أخلاقا) with every movement of Time, according to the Divine matters (الأمور الإلهية) that Allah deposited in those movements. It continued to acquire these spiritual attributes (الصفات الروحانية) before the existence of its composition, until the form of his body appeared in the world of this life (عالم الدنيا) with the praiseworthy characteristics (الأخلاق المحمودة) upon which Allah molded him. Thus, it was said concerning him: <<وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ>> (And indeed, you are upon a tremendous character). Thus, he was the possessor of character (ذا خلق), not merely one who acquired character (ذا تخلق).\n\nSince the rulings of characteristics (الأخلاق) differ according to the context (المحل) in which they should be applied, the possessor of character needs knowledge (علم) upon which he relies, so that he may apply the appropriate characteristic in that context by the command of Allah, thereby becoming an act of proximity (قربة) to Allah. For this reason, the Divine Laws (الشرائع) were revealed, to clarify for people the contexts for the rulings of the characteristics upon which man was created.\n\nAllah said concerning an example of this: <<وَلَا تَقُلْ لَهُمَا أُفٍّ>> (And do not say to them [your parents] 'Uff'), due to the existence of 'uff' ( التأفيف - expressing annoyance) in his creation. He thus clarified the context in which the ruling of this characteristic should not appear. Then He clarified the context in which this characteristic should appear, saying: <<أُفٍّ لَكُمْ وَلِمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ>> ('Uff' to you and to what you worship instead of Allah). And the Exalted said: <<فَلَا تَخَافُوهُمْ>> (So do not fear them), clarifying the context in which the characteristic of fear should not appear. Then He said to them: <<خَافُونِ>> (Fear Me), clarifying where the ruling of this attribute should appear.\n\nThe same applies to envy (الحسد), greed (الحرص), and everything in this natural existence (النشأة الطبيعية) whose spiritual ruling is manifest within it. Allah has clarified for us where we should manifest them and where we should restrain them. It is impossible to remove them from this existence except by the removal of the existence itself, because they are its very essence, and a thing does not separate from itself.\n\nHe (may Allah bless him and grant him peace) said: \"There is no envy except in two [cases].\" And he said: \"May Allah increase your eagerness (حرصا), and do not transgress.\"\n\nWe said that the spiritual ruling is manifest within them, taking precaution for the sake of the People of Unveiling (أهل الكشف) and the scholars firmly rooted in Knowledge (العلماء الراسخين في العلم) among the verifying gnostics (المحققين العالمين). For what is called inanimate (الجماد) and plant (النبات) possess spirits (أرواح) according to us, which are hidden from the perception of those other than the People of Unveiling in the ordinary sense, and they are not perceived in the same way that animals are perceived. Thus, everything, according to the People of Unveiling, is a speaking animal (حيوان ناطق), or rather, a living speaker (حي ناطق), except that this specific temperament (المزاج الخاص) is called 'human' and nothing else, due to the form. The differentiation among creatures occurs in the temperament, for every compound must have a specific temperament unique to it, by which it is distinguished from others, just as it shares something with others. Thus, the very thing by which separation and distinction occur is not the same thing by which sharing and lack of distinction occur. Know this and verify it.\n\n### [The Entire Cosmos is Living, Knowing, and Speaking]\n\nAllah the Exalted said: <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (And there is not a thing except that it glorifies [Allah] with His praise). The word \"thing\" (شيء) is indefinite, and nothing glorifies except that which is living, intelligent, and knowledgeable of the One it glorifies. It has been reported that the caller to prayer (المؤذن) is witnessed for by everything, wet or dry, within the range of his voice. The Divine Laws (الشرائع) and Prophecies (النبوات) are replete with this kind of information. We, in addition to believing in the reports, have the Unveiling (الكشف). We have heard stones remembering Allah (ذِكْر الله) with our own eyes, with a speaking tongue that our ears hear from them, and they address us with the address of those who know the Majesty of Allah (جلال الله)—something not every human perceives.\n\nEvery genus of Allah's creation is a community (أمة) among the communities. Allah created them upon a specific worship (عبادة) that He revealed to them within their souls. Their messenger is from their own essence, an announcement from Allah through a specific inspiration (إلهام خاص) upon which He molded them, such as the knowledge some animals possess of things that the most skilled engineer fails to grasp, or their absolute knowledge of what benefits them in the herbs and food they consume, and their avoidance of what harms them. All of this is in their innate nature (فطرتهم). Likewise, concerning what is called inanimate and plant, Allah has veiled our eyes and ears from the speech they possess. The Hour will not be established until a man's thigh speaks to him about what his family did. The ignorant among the philosophers (الحكماء) consider this, if their faith in it is sound, to be from the category of knowledge through twitching (علم الاختلاج), meaning the science of augury (علم الزجر). Although the science of augury is a true science in itself and is one of Allah's secrets, it is not the intent of the Lawgiver in this statement.\n\nThus, he (may Allah bless him and grant him peace) possessed the Most Complete Unveiling (الكشف الأتم), seeing what we do not see. He (peace be upon him) drew attention to a matter upon which the People of Allah (أهل الله) acted and found it to be true, namely his saying: \"Were it not for the increase in your talk and the disorder in your hearts, you would see what I see and hear what I hear.\"\n\nHe was singled out with the rank of Perfection (رتبة الكمال) in all his affairs, including the Perfection in Servitude (العبودية). He was a pure servant (عبدا صرفا) who did not establish Divinity (ربانية) over anyone by his essence. This is what necessitated his Sovereignty (السيادة) and is the proof of his perpetual honor. Aisha said: \"The Messenger of Allah (may Allah bless him and grant him peace) used to remember Allah at all times.\"\n\nWe have a plentiful inheritance from him, which is a matter specific to the inner being (باطن) of man. His saying [about the disorder in hearts] implies that sometimes the opposite of this may appear in his actions, despite his realization of the spiritual station (المقام), leading to confusion for those who lack Gnosis (المعرفة) of the spiritual states (الأحوال). We have clarified in this chapter what was necessary. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "## \"باب بارہواں\" ہمارے آقا محمد صلی اللہ علیہ وسلم کے فلک (گردش) کی دورہ (دائرے) کی معرفت میں\n\n(بسم الله الرحمن الرحيم) اور یہ سیادت (سرداری) کا دورہ ہے، اور یہ کہ زمان (Az-Zamān) اپنی اسی ہیئت پر لوٹ آیا ہے جس پر اللہ تعالیٰ نے اسے پیدا کیا تھا۔\n\n> میرے ماں باپ قربان اس پر جو بادشاہ اور سردار تھا،\n> جبکہ آدم ابھی پانی اور مٹی کے درمیان کھڑے تھے۔\n>\n> وہ رسول ابطحی محمد ہیں،\n> جن کے لیے بلندیوں میں قدیم اور نیا دونوں طرح کا شرف ہے۔\n>\n> وہ آخری دور میں سعادت کا زمان (Az-Zamān) لے کر آئے،\n> اور ہر زمانے میں ان کے لیے (خاص) مقامات تھے۔\n>\n> وہ زمانے کی شکستگی کو جوڑنے آئے، اس کی دراڑ کو بھرنے،\n> تو زبانوں اور عارفوں نے ان کی تعریف کی۔\n>\n> جب وہ کسی امر کا ارادہ کرتے ہیں تو اس کی مخالفت نہیں ہوتی،\n> اور اس امر کو کائنات میں کوئی ٹالنے والا نہیں۔\n\n### [وجود روح محمد در عالم غیب]\n\nجان لو، اللہ تمہاری مدد کرے، کہ جب اللہ نے اجسام کی تدبیر کرنے والی محدود ارواح کو زمان (Az-Zamān) کے ساتھ پیدا کیا، فلک (گردش) کی حرکت کے وجود کے وقت تاکہ اللہ کے ہاں معلوم مدت کا تعین ہو سکے، اور جب زمان (Az-Zamān) کی حرکت کا آغاز ہوا، تو اللہ نے روح مدبرہ (انتظام کرنے والی روح) یعنی روح محمد صلی اللہ علیہ وسلم کو پیدا فرمایا۔ پھر حرکات کے ساتھ دیگر ارواح صادر ہوئیں، تو ان کا وجود عالم غیب (ʿĀlam al-Ghayb) میں تھا نہ کہ عالم شہادت (ʿĀlam ash-Shahādah) میں۔ اور اللہ نے آپ کو آپ کی نبوت سے آگاہ کیا اور اس کی بشارت دی، جبکہ آدم علیہ السلام ابھی پانی اور مٹی کے درمیان ہی تھے جیسا کہ آپ نے فرمایا۔\n\nاور محمد صلی اللہ علیہ وسلم کے حق میں زمان (Az-Zamān) اسم باطن (Al-Ism al-Bāṭin) کے ساتھ آپ کے جسم کے وجود اور روح کے اس سے منسلک ہونے پر ختم ہوا، تو زمان (Az-Zamān) کا حکم اپنی روانی میں اسم ظاہر (Al-Ism aẓ-Ẓāhir) کی طرف منتقل ہو گیا۔ پس محمد صلی اللہ علیہ وسلم اپنی ذات میں جسم اور روح کے ساتھ ظاہر ہوئے۔ چنانچہ تمام شرائع جو انبیاء و رسل (علیہم السلام) کے ہاتھوں ظاہر ہوئیں، ان میں حکم پہلے باطنی طور پر آپ ہی کا تھا۔ پھر حکم آپ کے لیے ظاہری ہو گیا، تو اسم ظاہر (Al-Ism aẓ-Ẓāhir) کے حکم سے ہر اس شریعت کو منسوخ کر دیا جسے اسم باطن (Al-Ism al-Bāṭin) نے ظاہر کیا تھا، تاکہ دونوں اسموں کے حکم کا فرق واضح ہو جائے، اگرچہ شریعت دینے والا ایک ہی ہے اور وہی صاحب شرع ہے۔ کیونکہ آپ نے فرمایا: \"میں نبی تھا\" اور یہ نہیں فرمایا کہ \"میں انسان تھا\" یا \"میں موجود تھا\"۔ اور نبوت اللہ کی طرف سے مقرر کردہ شریعت کے بغیر نہیں ہوتی۔ پس آپ نے خبر دی کہ آپ ان انبیاء کے وجود سے پہلے ہی صاحب نبوت تھے جو اس دنیا میں آپ کے نائب ہیں، جیسا کہ ہم نے اس کتاب کے پچھلے ابواب میں بیان کیا ہے۔\n\n### [استدارة الزمان]\n\nپس زمان (Az-Zamān) کا لوٹ آنا اسم باطن (Al-Ism al-Bāṭin) کے ساتھ اس کے دورے کا اختتام تھا اور اسم ظاہر (Al-Ism aẓ-Ẓāhir) کے ساتھ ایک دوسرے دورے کا آغاز۔ چنانچہ آپ نے فرمایا: \"وہ اپنی اسی ہیئت پر لوٹ آیا ہے جس پر اللہ نے اسے پیدا کیا\"۔ یہ حکم کی نسبت ہمارے لیے ظاہری طور پر ہے، جیسا کہ پہلے دورے میں باطنی طور پر ہماری طرف یعنی محمد کی طرف منسوب تھا، اور ظاہری طور پر ان کی طرف منسوب تھا جن کی طرف ابراہیم، موسیٰ، عیسیٰ اور تمام انبیاء و رسل کی شریعتیں منسوب کی گئیں۔\n\n### [الأنبياء الحرم والأشهر الحرم]\n\nاور انبیاء میں زمان (Az-Zamān) کے چار حرم (محترم) ہیں: ہود، صالح، شعیب (علیہم السلام) اور محمد صلی اللہ علیہ وسلم۔ اور زمان (Az-Zamān) میں ان کے متعین مہینے ذوالقعدہ، ذوالحجہ، محرم اور رجب مضر ہیں۔ اور چونکہ عرب مہینوں میں نسی (آگے پیچھے کرنا) کرتے تھے، تو ان میں سے محرم کو حلال اور حلال کو حرام کر دیتے تھے، اور جب محمد صلی اللہ علیہ وسلم تشریف لائے تو آپ نے زمان (Az-Zamān) کو اس کی اصل کی طرف لوٹا دیا جس کا حکم اللہ نے اس کی تخلیق کے وقت دیا تھا۔ چنانچہ آپ نے حرمت والے مہینوں کو اسی حد پر متعین کیا جس پر اللہ نے انہیں پیدا کیا تھا۔ اسی لیے آپ نے ظاہری زبان میں فرمایا کہ زمان (Az-Zamān) اپنی اسی ہیئت پر لوٹ آیا ہے جس پر اللہ نے اسے پیدا کیا تھا۔ اسی طرح زمان (Az-Zamān) لوٹ آیا، تو اس نے محمد صلی اللہ علیہ وسلم کو جیسا کہ ہم نے ذکر کیا، اسم ظاہر (Al-Ism aẓ-Ẓāhir) کے ساتھ حسی طور پر جسم اور روح کے ساتھ ظاہر کیا۔ پس آپ نے اپنی سابقہ شریعت میں سے جو کچھ اللہ نے منسوخ کرنا چاہا اسے منسوخ کر دیا اور جو کچھ اللہ نے باقی رکھنا چاہا اسے باقی رکھا، اور یہ خاص طور پر احکام میں سے ہے نہ کہ اصول میں سے۔\n\n### [ظہور محمد در دورہ میزان]\n\nاور چونکہ آپ کا ظہور میزان (توازن) کے ساتھ ہوا، اور وہ کائنات میں عدل ہے، اور وہ معتدل ہے کیونکہ اس کی طبیعت حرارت اور رطوبت ہے، اس لیے یہ آخرت کے حکم میں سے تھا۔ کیونکہ میزان کی حرکت آخرت سے لے کر جنت اور دوزخ میں داخلے تک متصل ہے۔ اسی وجہ سے اس امت میں علم پہلے کی امتوں سے زیادہ ہے۔ اور محمد صلی اللہ علیہ وسلم کو اولین اور آخرین کا علم عطا کیا گیا، کیونکہ حقیقت میزان (توازن) اسی کا تقاضا کرتی ہے۔ اور اس امت میں کشف (Al-Kashf) دوسری امتوں کے مقابلے میں زیادہ تیز تھا، کیونکہ ہم سے پہلے کی تمام امتوں پر سردی اور خشکی غالب تھی، اگرچہ وہ ذہین اور عالم تھے، لیکن ان میں سے مخصوص افراد ہی ایسے تھے، برخلاف اس کے جو آج لوگوں کا حال ہے۔ کیا تم نہیں دیکھتے کہ اس امت نے تمام امتوں کے علوم کا ترجمہ کیا ہے؟ اور اگر ترجمہ کرنے والا اس معنی کو نہ جانتا ہوتا جس پر متکلم کا لفظ دلالت کرتا ہے، تو اس کا مترجم ہونا درست نہ ہوتا اور نہ ہی اس پر ترجمہ کا نام لاگو ہوتا۔ پس اس امت نے ان لوگوں کا علم جان لیا جو پہلے گزر چکے، اور ایسے علوم کے ساتھ خاص ہوئی جو متقدمین کے پاس نہیں تھے۔ اور اسی کی طرف آپ صلی اللہ علیہ وسلم نے اپنے اس قول سے اشارہ فرمایا: \"پس میں نے اولین کا علم جان لیا\" اور وہ وہ لوگ ہیں جو آپ سے پہلے گزرے، پھر فرمایا: \"اور آخرین کا\" اور یہ وہ علم ہے جو متقدمین کے پاس نہیں تھا، اور وہ وہ علم ہے جو آپ کی امت آپ کے بعد قیامت تک سیکھے گی۔ پس آپ نے خبر دی کہ ہمارے پاس ایسے علوم ہیں جو پہلے نہیں تھے۔ یہ نبی صلی اللہ علیہ وسلم کی طرف سے ہمارے لیے گواہی ہے، اور آپ اس میں سچے ہیں۔\n\n### [السیادۃ المحمدیۃ فی العلم والحکم]\n\nپس آپ صلی اللہ علیہ وسلم کے لیے دنیا میں علم میں سیادت (سرداری) ثابت ہوئی، اور آپ کے لیے حکم میں بھی سیادت ثابت ہوئی، جہاں آپ نے فرمایا:\n**\"لو كان موسى حيا ما وسعه إلا إن يتبعني\"** (اگر موسیٰ زندہ ہوتے تو ان کے لیے میری پیروی کے سوا کوئی چارہ نہ ہوتا)۔\nاور یہ بات عیسیٰ علیہ السلام کے نزول اور ان کے ہمارے درمیان قرآن کے مطابق فیصلہ کرنے سے واضح ہو جاتی ہے۔ پس آپ کے لیے دنیا میں ہر لحاظ سے اور ہر معنی میں سیادت ثابت ہوئی۔ پھر قیامت کے دن شفاعت کا دروازہ کھولنے کے ذریعے آپ کے لیے تمام لوگوں پر سیادت ثابت ہوئی، اور قیامت کے دن یہ کسی نبی کے لیے نہیں ہو گا سوائے آپ صلی اللہ علیہ وسلم کے۔ آپ صلی اللہ علیہ وسلم نے رسولوں اور نبیوں کے حق میں شفاعت کی کہ وہ شفاعت کریں، اور ہاں، فرشتوں کے حق میں بھی۔ پس اللہ تعالیٰ نے آپ کی شفاعت کے وقت ہر اس شخص کو اجازت دی جس کے لیے شفاعت ہے، خواہ وہ فرشتہ ہو، رسول ہو، نبی ہو یا مومن، کہ وہ شفاعت کرے۔ پس آپ صلی اللہ علیہ وسلم اللہ کے اذن سے پہلے شفاعت کرنے والے ہیں، اور ارحم الراحمین (سب سے زیادہ رحم کرنے والا) قیامت کے دن آخری شفاعت کرنے والا ہو گا۔ پس رحیم (رحم کرنے والا) منتقم (انتقام لینے والے) سے شفاعت کرے گا کہ وہ ان لوگوں کو آگ سے نکال دے جنہوں نے کبھی کوئی نیکی نہیں کی، تو انہیں انعام دینے والا، فضل کرنے والا نکال دے گا۔ اور اس دائرے سے بڑھ کر کیا شرف ہو گا جو گھمایا جائے اور اس کا آخر ارحم الراحمین ہو، اور دائرے کا آخر اس کے اول سے متصل ہو۔ پس محمد صلی اللہ علیہ وسلم کے شرف سے بڑھ کر کیا شرف ہو گا، جہاں اس دائرے کا آغاز تھا، جہاں اس کا آخر اس کی کاملیت کے لیے اس سے متصل ہوا۔ پس اسی (ذات حق - Al-Ḥaqq) سے چیزوں کا آغاز ہوا اور اسی سے وہ مکمل ہوئیں۔ اور مومن کا شرف کتنا عظیم ہے کہ اس کی شفاعت ارحم الراحمین کی شفاعت کے بعد آتی ہے۔ پس مومن اللہ اور انبیاء کے درمیان ہے۔ کیونکہ مخلوق کے حق میں علم اگرچہ کامل شرف رکھتا ہے جس کی قدر و منزلت سے انکار نہیں کیا جا سکتا، لیکن وہ قرب الٰہی میں سعادت صرف ایمان کے ذریعے ہی دیتا ہے۔ پس مخلوق میں ایمان کا نور اس علم کے نور سے زیادہ شرف والا ہے جس کے ساتھ ایمان نہ ہو۔ پس جب ایمان سے علم حاصل ہو، تو ایمان کے نور سے پیدا ہونے والے اس علم کا نور اعلیٰ ہوتا ہے، اور اسی سے وہ اس مومن پر ممتاز ہوتا ہے جو عالم نہیں ہے۔ پس اللہ ان مومنوں میں سے جنہیں علم دیا گیا ہے، ان مومنوں پر درجات بلند کرتا ہے جنہیں علم نہیں دیا گیا، اور علم اللہ کے ذریعے بڑھتا ہے۔ کیونکہ رسول اللہ صلی اللہ علیہ وسلم اپنے صحابہ سے فرماتے ہیں:\n**\"أنتم أعلم بمصالح دنياكم\"** (تم اپنی دنیا کے معاملات کو زیادہ جانتے ہو)۔\n\n### [الامتیازات المحمدیۃ من وحی أمر السماوات السبع]\n\nپس محمد صلی اللہ علیہ وسلم کے فلک (گردش) سے زیادہ وسیع کوئی فلک نہیں، کیونکہ آپ کے لیے احاطہ ہے، اور یہ آپ کی امت میں سے ان لوگوں کے لیے بھی ہے جنہیں اللہ نے تبعیت کے حکم سے اس کے ساتھ خاص کیا ہے۔ پس ہمیں تمام امتوں پر احاطہ حاصل ہے، اور اسی لیے ہم لوگوں پر گواہ ہیں۔ پس اللہ نے آپ کو آپ کی پیدائش کے وقت سات آسمانوں کے امر (حکم) کی ایسی وحی عطا کی جو کسی اور کو نہیں دی گئی۔\n\nپہلے آسمان کے ساتھ مخصوص امر میں سے یہ ہے کہ قرآن کا کوئی حرف یا کلمہ تبدیل نہیں کیا گیا، اور اگر شیطان اس کی تلاوت میں کوئی ایسی چیز ڈالتا جو اس میں سے نہیں تھی، کمی یا زیادتی کے ساتھ، تو اللہ اسے منسوخ کر دیتا۔ اور یہ عصمت ہے۔ اور اسی ثبات میں سے یہ ہے کہ آپ کی شریعت کسی دوسری شریعت سے منسوخ نہیں ہوئی، بلکہ محفوظ رہی اور ہر دیکھنے والی آنکھ کے لیے مستقر ہو گئی، اور اسی لیے ہر گروہ اس سے استدلال کرتا ہے۔\n\nدوسرے آسمان کے ساتھ مخصوص امر میں سے یہ ہے کہ آپ کو اولین اور آخرین کا علم، بردباری، رحمت اور نرمی کے ساتھ خاص کیا گیا، اور **\"وَكَانَ بِالْمُؤْمِنِينَ رَحِيماً\"** (اور وہ مومنوں پر بہت مہربان تھے)۔ اور آپ نے کسی وقت بھی کسی پر سختی کا اظہار نہیں کیا مگر اللہ کے حکم سے، جب آپ سے کہا گیا: **\"جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ\"** (کافروں اور منافقوں سے جہاد کرو اور ان پر سختی کرو)۔ پس آپ کو اس کا حکم دیا گیا کیونکہ آپ کی طبیعت اس کا تقاضا نہیں کرتی تھی، اگرچہ آپ بشر تھے جو اپنی ذات کے لیے غصہ کرتے اور اپنی ذات کے لیے راضی ہوتے تھے۔ پس آپ نے اس کے لیے ہماری دوا پیش کی، تو اس غصے میں ایسی رحمت ہوتی تھی جس کا غصے کی حالت میں شعور نہیں ہوتا تھا۔ پس آپ اپنے غصے سے بھی اسی طرح رہنمائی کرتے تھے جیسے اپنی رضا سے، اور یہ ان اسرار کی وجہ سے ہے جنہیں ہم نے جانا اور ہمارے اہل اللہ جانتے ہیں۔ پس اس باب سے آپ کے لیے عالم پر سیادت ثابت ہوئی۔ کیونکہ آپ کی امت کے علاوہ دوسروں کے بارے میں کہا گیا: **\"يُحَرِّفُونَهُ مِنْ بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ\"** (وہ اسے سمجھنے کے بعد جان بوجھ کر بدل دیتے ہیں)۔ پس اللہ نے انہیں علم کے باوجود گمراہ کر دیا۔ اور اللہ نے ہمارے درمیان اپنے ذکر کی حفاظت کا ذمہ لیا، چنانچہ فرمایا: **\"إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ\"** (بیشک ہم نے ہی یہ ذکر (قرآن) نازل کیا ہے اور ہم ہی اس کے محافظ ہیں)۔ کیونکہ اللہ نے بندے کی سماعت، بصارت، زبان اور ہاتھ کو سنا اور اس امت کے علاوہ دوسروں کو اپنی کتاب کی حفاظت کا ذمہ دیا تو انہوں نے اسے بدل دیا۔\n\nتیسرے آسمان کی وحی کے ساتھ مخصوص امر میں سے یہ بھی ہے کہ وہ تلوار جس کے ساتھ آپ کو مبعوث کیا گیا، اور خلافت۔ اور اسی میں سے آپ کو فرشتوں کے ساتھ جنگ کے لیے بھی خاص کیا گیا، کیونکہ اس آسمان کے فرشتوں نے جنگ بدر میں آپ کے ساتھ جنگ کی۔ اور اسی آسمان سے آپ کو ایسی قوم میں مبعوث کیا گیا جن کی ہمت مہمانوں کی ضیافت، اونٹوں کو ذبح کرنے، دائمی جنگوں اور خون بہانے کے سوا کسی اور چیز میں نہیں تھی، اور وہ اسی سے اپنی تعریف کرتے اور کروایا کرتے تھے۔ ان میں سے کسی نے کہا:\n\n> **ضروب بنصل السيف سوق سمانها *** إذا عدموا زادا فإنك عاقر**\n> (وہ تلوار کی دھار سے اپنے موٹے اونٹوں کی پنڈلیوں پر مارتے ہیں، جب ان کے پاس زادِ راہ نہ ہو، تو تم (اے اونٹنی) بانجھ ہو جاؤ)۔\n\n**\"و قال الآخر منهم يمدح قومه\"** (اور ان میں سے دوسرے نے اپنی قوم کی تعریف کرتے ہوئے کہا:)\n\n> **لا يبعدن قومي الذين همو *** سم العداة وآفة الجزر**\n>\n> **النازلون بكل معترك *** والطيبون معاقد الأزر**\n> (میری قوم دور نہ ہو، جو دشمنوں کے لیے زہر اور اونٹوں کے لیے آفت ہیں، جو ہر میدان جنگ میں اترتے ہیں، اور تہبند باندھنے میں پاکیزہ ہیں (یعنی عفت والے ہیں))۔\n\nپس اس نے ان کی تعریف سخاوت، شجاعت اور عفت سے کی۔ عنترہ بن شداد اپنے پڑوسی کی اس کے اہل و عیال میں حفاظت کے بارے میں کہتا ہے:\n\n> **وأغض طرفي ما بدت لي جارتي *** حتى يواري جارتي مأواها**\n> (اور میں اپنی نگاہ جھکا لیتا ہوں جب میری پڑوسن ظاہر ہوتی ہے، یہاں تک کہ میری پڑوسن اپنے ٹھکانے میں چھپ جائے)۔\n\nاور کسی پر بھی عرب کی فضیلت عجم پر سخاوت، بہادری اور وفاداری میں پوشیدہ نہیں ہے، اگرچہ عجم میں بھی سخی اور بہادر ہیں، لیکن وہ افراد ہیں، جیسا کہ عرب میں بھی بزدل اور بخیل ہیں، لیکن وہ افراد ہیں۔ اور بات غالب پر ہوتی ہے نہ کہ نادر پر۔ اور یہ وہ چیز ہے جس کا کوئی انکار نہیں کرتا۔ پس یہ سب اس امر میں سے ہے جو آسمان اور زمین کے درمیان نازل ہوتا ہے، اس کے لیے جو سمجھتا ہے۔ اور اگر ہم ہر آسمان میں اس امر کی تفصیل بیان کرتے جو اللہ سبحانہ نے اس میں وحی کیا ہے، تو ہم اس میں سے ایسے عجائبات ظاہر کرتے جن کا شاید بعض لوگ انکار کر دیتے جو اس علم کو رصد اور تسییر (فلکیات) کے طریقے سے دیکھتے ہیں، اور ان میں سے منصف اسے سن کر حیران رہ جاتا۔\n\nچوتھے آسمان میں مامور وحی میں سے یہ ہے کہ آپ کی شریعت نے تمام شرائع کو منسوخ کر دیا، اور آپ کے دین کا تمام ادیان پر غلبہ، ہر اس رسول کے نزدیک جو آپ سے پہلے گزرا اور ہر نازل شدہ کتاب میں۔ پس اللہ کے نزدیک کسی بھی دین کا کوئی حکم باقی نہیں رہا سوائے اس کے جو آپ نے مقرر کیا، پس آپ کے مقرر کرنے سے وہ ثابت ہوا، تو وہ آپ کی شریعت اور آپ کی رسالت کی عمومیت میں سے ہے۔ اور اگر اس میں سے کوئی حکم باقی رہا بھی ہے تو وہ اللہ کا حکم نہیں ہے، سوائے اہل جزیہ کے حق میں خاص طور پر۔ اور ہم نے یہ اس لیے کہا کہ وہ اللہ کا حکم نہیں ہے کیونکہ اللہ نے اسے باطل قرار دیا ہے، پس وہ اس کی پیروی کرنے والے کے خلاف ہے نہ کہ اس کے حق میں۔ یہ میرا مطلب آپ کے دین کے تمام ادیان پر غالب آنے سے ہے، جیسا کہ نابغہ نے آپ کی تعریف میں کہا:\n\n> **أ لم تر أن الله أعطاك سورة *** ترى كل ملك دونها يتذبذب**\n>\n> **بأنك شمس والملوك كواكب *** إذا طلعت لم يبد منهن كوكب**\n> (کیا تم نے نہیں دیکھا کہ اللہ نے تمہیں ایک ایسا مقام عطا کیا ہے، جس کے نیچے تم ہر بادشاہ کو لرزتا ہوا دیکھتے ہو؟ تم سورج ہو اور بادشاہ ستارے ہیں، جب تم طلوع ہوتے ہو تو ان میں سے کوئی ستارہ نظر نہیں آتا)۔\n\nاور یہ محمد صلی اللہ علیہ وسلم کا مقام ہے اور اس شریعت کا مقام ہے جو آپ انبیاء اور ان کی شرائع (علیہم السلام) سے لے کر آئے۔ کیونکہ ستاروں کے انوار سورج کے نور میں شامل ہو گئے ہیں۔ پس دن ہمارے لیے ہے، اور رات صرف اہل کتاب کے لیے ہے جب وہ **\"الْجِزْيَةَ عَنْ يَدٍ وَهُمْ صَاغِرُونَ\"** (جزیہ دیں اپنے ہاتھ سے اور وہ ذلیل ہوں)۔ اور ہم نے تنزلات موصلیہ میں ہر آسمان کے امر کے بارے میں تفصیل سے بیان کیا ہے، جسے اگر تم دیکھو تو اس میں سے کچھ جان لو گے۔\n\nپانچویں آسمان میں مامور وحی میں سے جو محمد صلی اللہ علیہ وسلم کے ساتھ خاص ہے، یہ ہے کہ کسی بھی نبی سے یہ روایت نہیں ہوئی کہ اسے عورتیں محبوب بنائی گئیں سوائے محمد صلی اللہ علیہ وسلم کے، اگرچہ انہیں ان میں سے بہت سی عطا کی گئیں، جیسے سلیمان علیہ السلام اور دیگر، لیکن ہماری بات اس بارے میں ہے کہ انہیں محبوب بنایا گیا۔ اور یہ اس لیے کہ آپ صلی اللہ علیہ وسلم نبی تھے جبکہ آدم پانی اور مٹی کے درمیان تھے، جیسا کہ ہم نے مقرر کیا اور جس طرح ہم نے شرح کی، تو آپ اپنے رب کی طرف منقطع تھے، آپ اللہ کے ساتھ مشغولیت کی وجہ سے کسی بھی کائنات کی طرف نہیں دیکھتے تھے۔ کیونکہ نبی اللہ سے وصول کرنے اور ادب کی رعایت میں مشغول ہوتا ہے، تو وہ اس کے علاوہ کسی چیز کے لیے فارغ نہیں ہوتا۔ پس اللہ نے عورتوں کو آپ کے لیے محبوب بنا دیا، تو آپ نے انہیں اللہ کی طرف سے ان پر عنایت کی وجہ سے محبوب رکھا۔ پس آپ صلی اللہ علیہ وسلم کا ان سے محبت کرنا اس وجہ سے تھا کہ اللہ نے انہیں آپ کے لیے محبوب بنایا۔ مسلم نے اپنی صحیح میں ایمان کے ابواب میں روایت کیا ہے کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے کہا:\n**\"إني أحب أن يكون نعلي حسنا وثوبي\"** (میں پسند کرتا ہوں کہ میری جوتی اچھی ہو اور میرا کپڑا بھی)۔\nتو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: **\"إن الله جميل يحب الجمال\"** (بیشک اللہ جمیل ہے اور جمال کو پسند کرتا ہے)۔\n\nاور اسی آسمان سے خوشبو کی محبت تھی، اور آپ کی سنت نکاح تھی نہ کہ رہبانیت (تبتل)، اور آپ نے نکاح کو اس سر الٰہی کے لیے عبادت بنا دیا جو اس میں ودیعت کیا گیا ہے، اور یہ صرف عورتوں میں ہے۔ اور یہ تین احکام کے لیے اعیان کا ظہور ہے جن کا ذکر دو مقدموں سے نتیجہ اخذ کرنے میں پہلے گزر چکا ہے، اور وہ رابطہ جسے نتیجہ اخذ کرنے کی علت بنایا گیا ہے۔ پس یہ فضیلت اور اس جیسی دیگر چیزیں محمد صلی اللہ علیہ وسلم کے ساتھ خاص ہیں، اور آپ نے اس میں ہبہ کے نکاح سے اضافہ کیا، جیسا کہ آپ کی امت میں بھی اس شخص کے لیے نکاح میں وسعت دی گئی جس کے پاس عوض کے لیے کچھ نہ ہو، صرف اس قرآن کے بدلے جو وہ یاد کرائے، نہ کہ اسے سکھائے۔ اور اگرچہ یہ ہبہ کی قوت تک نہیں پہنچتا، لیکن اس میں امت کے لیے وسعت ہے۔ اور یہ ممکن نہیں کہ ہر آسمان میں اللہ کی وحی کردہ امر کو مکمل طور پر بیان کیا جائے۔\n\nچھٹے آسمان میں وحی کیے گئے امر میں سے قرآن کا اعجاز ہے، اور جو جوامع الکلم (جامع کلمات) آپ صلی اللہ علیہ وسلم کو عطا کیے گئے، وہ اسی آسمان سے آپ پر نازل ہوئے، اور یہ کسی نبی کو آپ سے پہلے نہیں دیا گیا۔ اور آپ نے فرمایا: \"مجھے چھ چیزیں دی گئیں جو مجھ سے پہلے کسی نبی کو نہیں دی گئیں\"۔ اور یہ سب آسمانوں میں وحی کیا گیا، جیسا کہ اللہ کے قول میں ہے: **\"وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا\"** (اور اس نے ہر آسمان میں اس کا امر (حکم) وحی کیا)۔ پس اللہ نے ہر آسمان میں وہ چیز رکھی جو اس مخلوق میں زمین پر نافذ ہونے کے لیے مناسب تھی۔ پس ان میں سے یہ تھا کہ آپ کو اکیلے تمام لوگوں کی طرف مبعوث کیا گیا، تو آپ کی رسالت عام ہو گئی، اور یہ ان امور میں سے ہے جو اللہ نے چوتھے آسمان میں وحی کیے۔ اور آپ کی مدد رعب سے کی گئی، اور یہ ان امور میں سے ہے جو اللہ نے تیسرے آسمان میں وحی کیے۔ اور ان میں سے وہ بھی ہے جو اللہ نے آپ کے لیے غنیمتوں کو حلال کیا، اور آپ کے لیے زمین کو مسجد اور پاک کرنے والی بنا دیا گیا، یہ دوسرے آسمان سے ہے۔ اور جوامع الکلم چھٹے آسمان کی وحی کے امر سے عطا کیے گئے۔ اور اس آسمان کے امر میں سے وہ بھی ہے جس کے ساتھ اللہ نے آپ کو زمین کے خزانوں کی چابیاں عطا کر کے خاص کیا۔\n\nساتویں آسمان میں مامور وحی میں سے، جو ہمارے قریب ترین دنیا کا آسمان ہے، یہ ہے کہ اللہ نے آپ کو صورت کمال کے ساتھ خاص کیا، پس آپ کے ذریعے شرائع مکمل ہوئیں اور آپ خاتم النبیین تھے، اور یہ آپ صلی اللہ علیہ وسلم کے علاوہ کسی اور کے لیے نہیں تھا۔ پس اس اور اس جیسی چیزوں کے ذریعے آپ نے تمام سیادتوں کو جمع کرنے والی سیادت اور سب سے بڑے محیط شرف کے ساتھ انفراد حاصل کیا۔ پس یہ ہم نے آپ کی پیدائش کے وقت ہر آسمان میں اللہ کی وحی کردہ بعض امور پر تنبیہ کی ہے۔\n\n### [الميزان والزمان]\n\nاور آپ کا قول \"الزمان\" (زمان) اور \"الدهر\" (دہر) یا کوئی اور لفظ استعمال نہ کرنا، میزان (توازن) کے وجود پر متنبہ کرتا ہے۔ کیونکہ زمان (Az-Zamān) کا ذکر کرنے میں یہ میزان کے حروف سے باہر نہیں نکلا، اور میزان کی یاء کو زاء کے قریب رکھا گیا، اور زاء کو زمان میں ہلکا کیا گیا، یہ اس بات کا اشارہ ہے کہ اس زاء میں ایک مدغم حرف ہے۔ پس زمان (Az-Zamān) کا پہلا وجود روحانی عدل کے لیے میزان میں تھا، اور محمد صلی اللہ علیہ وسلم کے لیے اسم باطن (Al-Ism al-Bāṭin) میں تھا، آپ کے اس قول کے ذریعے کہ \"میں نبی تھا جبکہ آدم پانی اور مٹی کے درمیان تھے\"۔ پھر زمان (Az-Zamān) کا دورہ جو اٹھتر ہزار سال کا ہے، ختم ہونے کے بعد وہ لوٹ آیا۔ پھر زمان (Az-Zamān) کا ایک دوسرا دورہ اسم ظاہر (Al-Ism aẓ-Ẓāhir) کے ساتھ شروع ہوا، جس میں محمد صلی اللہ علیہ وسلم کا جسم ظاہر ہوا اور آپ کی شریعت تعین اور صراحت کے ساتھ ظاہر ہوئی نہ کہ کنایہ کے ساتھ۔ اور حکم آخرت سے متصل ہو گیا، چنانچہ اللہ تعالیٰ نے فرمایا: **\"وَنَضَعُ الْمَوَازِينَ الْقِسْطَ لِيَوْمِ الْقِيَامَةِ\"** (اور ہم قیامت کے دن عدل کے ترازو رکھیں گے)۔ اور ہمیں کہا گیا: **\"وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ وَلَا تُخْسِرُوا الْمِيزَانَ\"** (اور وزن کو انصاف کے ساتھ قائم کرو اور میزان میں کمی نہ کرو)۔ اور اللہ تعالیٰ نے فرمایا: **\"وَالسَّمَاءَ رَفَعَهَا وَوَضَعَ الْمِيزَانَ\"** (اور آسمان کو اس نے بلند کیا اور میزان (توازن) قائم کیا)۔ پس میزان (توازن) کے ذریعے ہی **\"أَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا\"** (اس نے ہر آسمان میں اس کا امر وحی کیا)۔ اور اسی کے ذریعے زمین میں اس کی خوراکیں مقرر کیں، اور ذات حق (Al-Ḥaqq) نے اسے عالم میں ہر چیز میں نصب کیا ہے۔ پس ایک میزان معنوی ہے اور ایک میزان حسی ہے جو کبھی خطا نہیں کرتا۔ پس میزان کلام میں اور تمام محسوس صنعتوں میں داخل ہوا، اور اسی طرح معانی میں بھی، کیونکہ اجسام اور اجرام کا وجود اور وہ معانی جو وہ اٹھاتے ہیں، میزان کے حکم کے تحت ہی تھے۔ اور میزان کا وجود اور جو زمان (Az-Zamān) سے اوپر ہے، وہ اس وزن الٰہی سے ہے جسے اسم حکیم طلب کرتا ہے اور حکم عدل ظاہر کرتا ہے، اس کے سوا کوئی معبود نہیں۔ اور میزان سے عقرب (بچھو) ظاہر ہوا اور وہ امر الٰہی جو اللہ نے اس میں وحی کیا، اور قوس (کمان)، جدی (بکری)، دلو (ڈول)، حوت (مچھلی)، حمل (مینڈھا)، ثور (بیل)، جوزاء (جڑواں)، سرطان (کیکڑا)، اسد (شیر) اور سنبلہ (خوشہ)۔\n\n### [انتهاء الدورة الزمانية إلى الميزان]\n\nاور دورہ زمانی میزان (توازن) پر ختم ہوا تاکہ دوروں کا تکرار ہو، پس محمد صلی اللہ علیہ وسلم ظاہر ہوئے، اور زمان (Az-Zamān) کے ہر جز میں آپ کے لیے ایک حکم تھا جو آپ کے ظہور صلی اللہ علیہ وسلم کے ساتھ اس میں جمع ہوا۔ اور یہ نام ان فرشتوں کے نام ہیں جنہیں اللہ نے پیدا کیا، اور وہ بارہ فرشتے ہیں، اور اللہ نے انہیں فلک محیط (گھیرنے والے فلک) میں مراتب عطا کیے، اور ہر فرشتے کے ہاتھ میں وہ کچھ رکھا جو وہ حکمت کے طور پر ان سے نیچے والوں میں زمین تک ظاہر کرنا چاہتا ہے۔ پس محمد صلی اللہ علیہ وسلم کی روحانیہ زمان (Az-Zamān) کی ہر حرکت پر اخلاق حاصل کرتی رہی، ان الٰہی امور کے مطابق جو اللہ نے ان حرکات میں ودیعت کیے تھے۔ پس وہ اپنے ترکیب کے وجود سے پہلے ان روحانی صفات کو حاصل کرتی رہی، یہاں تک کہ دنیا کے عالم میں آپ کے جسم کی صورت ان اخلاق محمودہ کے ساتھ ظاہر ہوئی جن پر اللہ نے آپ کو جبلت دی تھی، چنانچہ آپ کے بارے میں کہا گیا: **\"وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ\"** (اور بیشک آپ اخلاق عظیم پر ہیں)۔ پس آپ صاحب خلق تھے، متخلق نہیں تھے۔ اور چونکہ اخلاق کے احکام اس محل کے اختلاف سے مختلف ہوتے ہیں جس کے ساتھ ان کا مقابلہ کیا جانا چاہیے، اس لیے صاحب خلق کو ایک ایسے علم کی ضرورت ہوتی ہے جس پر وہ قائم ہو، تاکہ وہ اللہ کے حکم سے اس محل میں مناسب خلق کو صرف کرے، اور یہ اللہ کے لیے قربت بن جائے۔ اسی لیے شرائع نازل ہوئیں تاکہ لوگوں کو ان اخلاق کے احکام کے مقامات بتائیں جن پر انسان کو جبلت دی گئی ہے۔ پس اللہ نے اس کی مثال میں فرمایا: **\"وَلَا تَقُل لَّهُمَا أُفٍّ\"** (اور ان دونوں کو اُف تک نہ کہو)، کیونکہ اس کی تخلیق میں اُف کہنے کا وجود ہے۔ پس اللہ نے اس محل کو واضح کیا جہاں اس خلق کا حکم ظاہر نہیں ہونا چاہیے، پھر اس محل کو بیان کیا جہاں یہ خلق ظاہر ہونا چاہیے، چنانچہ فرمایا: **\"أُفٍّ لَّكُمْ وَلِمَا تَعْبُدُونَ مِن دُونِ اللَّهِ\"** (تم پر اور ان پر جن کی تم اللہ کے سوا عبادت کرتے ہو، اُف ہے)۔ اور اللہ تعالیٰ نے فرمایا: **\"فَلَا تَخَافُوهُمْ\"** (پس ان سے نہ ڈرو)، تو اس محل کو واضح کیا جہاں خوف کا خلق ظاہر نہیں ہونا چاہیے، پھر ان سے فرمایا: **\"خَافُونِ\"** (مجھ سے ڈرو)، تو انہیں وہ جگہ واضح کی جہاں اس صفت کا حکم ظاہر ہونا چاہیے۔ اور اسی طرح حسد اور حرص اور وہ سب کچھ جو اس نشأۃ طبعیہ میں ہے جس میں اس کی روحانیہ کا حکم ظاہر ہے، اللہ نے ہمیں واضح کر دیا ہے کہ ہم انہیں کہاں ظاہر کریں اور کہاں روکیں۔ کیونکہ اس نشأۃ سے انہیں زائل کرنا محال ہے، مگر اس کے زوال سے، کیونکہ وہ اس کی عین ہے اور چیز اپنے آپ سے جدا نہیں ہوتی۔\n\nآپ صلی اللہ علیہ وسلم نے فرمایا: **\"لا حسد إلا في اثنتين\"** (حسد صرف دو چیزوں میں ہے)۔ اور فرمایا: **\"زادك الله حرصا ولا تعد\"** (اللہ تمہاری حرص میں اضافہ کرے اور حد سے تجاوز نہ کرو)۔\n\nاور ہم نے جو کہا کہ اس میں اس کی روحانیہ کا حکم ظاہر ہے، اس سے ہم نے اہل کشف (Al-Kashf) اور محققین علماء راسخین فی العلم کی خاطر احتیاط برتی ہے۔ کیونکہ جسے ہمارے نزدیک جمادات اور نباتات کہا جاتا ہے، ان کی بھی ارواح ہیں جو اہل کشف کے علاوہ دوسروں کی ادراک سے عام طور پر پوشیدہ ہیں، اور وہ انہیں اس طرح محسوس نہیں کرتے جیسے حیوان محسوس کرتے ہیں۔ پس اہل کشف کے نزدیک سب کچھ حیوان ناطق ہے، بلکہ حی ناطق (زندہ بولنے والا) ہے۔ صرف یہ خاص مزاج ہی صورت کے لحاظ سے انسان کہلاتا ہے، اور بس۔ اور مخلوقات کے درمیان مزاج میں تفاضل (فرق) واقع ہوا ہے، کیونکہ ہر مرکب میں ایک خاص مزاج کا ہونا ضروری ہے جو صرف اسی کے لیے ہو، جس سے وہ دوسروں سے ممتاز ہوتا ہے، جیسا کہ وہ کسی امر میں دوسروں کے ساتھ جمع بھی ہوتا ہے۔ پس جس چیز سے افتراق اور امتیاز واقع ہوتا ہے، وہ بعینہٖ وہ چیز نہیں ہو سکتی جس سے اشتراک اور عدم امتیاز واقع ہو۔ پس یہ جان لو اور اس کی تحقیق کرو۔\n\n### [العالم كله حي عالم ناطق]\n\nاللہ تعالیٰ نے فرمایا: **\"وَإِن مِّن شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ\"** (اور کوئی چیز نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے)۔ اور \"شیء\" (چیز) نکرہ ہے، اور تسبیح صرف زندہ، عاقل، اور اپنے مسبح (جس کی تسبیح کی جا رہی ہے) کو جاننے والا ہی کرتا ہے۔ اور یہ وارد ہوا ہے کہ موذن کے لیے اس کی آواز کی حد تک تر اور خشک چیزیں گواہی دیتی ہیں۔ اور شرائع اور نبوتیں اس قبیل سے بھری پڑی ہیں۔ اور ہم نے اخبار پر ایمان کے ساتھ کشف (Al-Kashf) کا اضافہ کیا ہے، پس ہم نے پتھروں کو اپنی آنکھوں سے اللہ کا ذکر کرتے ہوئے سنا ہے، ایک ایسی نطق کی زبان سے جسے ہمارے کان سنتے ہیں، اور وہ ہم سے عارفین بجلال اللہ کی طرح مخاطب ہوتے ہیں، جسے ہر انسان ادراک نہیں کر سکتا۔ پس اللہ کی مخلوق کی ہر جنس امتوں میں سے ایک امت ہے، اللہ نے انہیں ایک خاص عبادت پر پیدا کیا ہے جس کی وحی ان کے نفوس میں کی گئی ہے، پس ان کا رسول ان کی اپنی ذات میں سے ہے، جو اللہ کی طرف سے ایک خاص الہام کے ذریعے آگاہی ہے جس پر انہیں جبلت دی گئی ہے، جیسے بعض حیوانات کا ان چیزوں کا علم جن کے ادراک سے ماہر انجینئر بھی قاصر رہتا ہے، یا ان کا مطلق علم ان کے لیے فائدہ مند گھاس اور خوراک کے بارے میں اور ان میں سے نقصان دہ چیزوں سے بچنے کے بارے میں۔ یہ سب ان کی فطرت میں ہے۔ اسی طرح جسے جماد اور نبات کہا جاتا ہے، اللہ نے ہماری آنکھوں اور کانوں کو اس نطق سے روک رکھا ہے جس پر وہ ہیں۔ اور قیامت قائم نہیں ہو گی یہاں تک کہ آدمی کی ران اس سے بات کرے گی جو اس کے اہل نے کیا ہے۔ جاہل حکماء نے اسے، اگر ان کا اس پر ایمان صحیح ہو، علم بالاختلاج (پھڑکنے کے علم) کے باب سے قرار دیا ہے، اور اس سے علم الزجر (بدشگونی کا علم) مراد لیتے ہیں، اگرچہ علم الزجر فی نفسہٖ ایک صحیح علم ہے اور اللہ کے اسرار میں سے ہے، لیکن یہ اس کلام میں شارع کا مقصود نہیں ہے۔ پس آپ صلی اللہ علیہ وسلم کے لیے کشف اتم (کامل ترین کشف) تھا، تو آپ وہ دیکھتے تھے جو ہم نہیں دیکھتے۔ اور آپ علیہ السلام نے ایک ایسے امر پر تنبیہ فرمائی جس پر اہل اللہ نے عمل کیا اور اسے صحیح پایا، آپ کا قول ہے:\n**\"لو لا تزييد في حديثكم وتمريج في قلوبكم لرأيتم ما أرى ولسمعتم ما أسمع\"** (اگر تمہاری باتوں میں زیادتی اور تمہارے دلوں میں گڑبڑ نہ ہوتی تو تم وہ دیکھتے جو میں دیکھتا ہوں اور وہ سنتے جو میں سنتا ہوں)۔\n\nپس آپ کو اپنے تمام امور میں کمال کے مرتبے کے ساتھ خاص کیا گیا، اور ان میں سے عبودیت میں کمال ہے، پس آپ خالص عبد تھے، آپ کی ذات نے کسی پر ربوبیت قائم نہیں کی، اور یہی وہ چیز ہے جس نے آپ کے لیے سیادت کو واجب کیا، اور یہ آپ کے شرف پر ہمیشہ کے لیے دلیل ہے۔ اور عائشہ رضی اللہ عنہا نے فرمایا: **\"كان رسول الله صلى الله عليه وسلم يذكر الله على كل أحيانه\"** (رسول اللہ صلی اللہ علیہ وسلم ہر حال میں اللہ کا ذکر کرتے تھے)۔\n\nاور ہمیں آپ سے ایک وافر میراث ملی ہے، اور یہ ایک ایسا امر ہے جو انسان کے باطن کے ساتھ خاص ہے۔ اور آپ کا قول کہ بسا اوقات آپ کے افعال سے اس کے خلاف ظاہر ہوتا ہے، جبکہ آپ مقام کے ساتھ متحقق ہوتے ہیں، تو یہ ان لوگوں پر مشتبہ ہو جاتا ہے جنہیں احوال کی معرفت نہیں ہے۔ پس ہم نے اس باب میں وہ بیان کر دیا ہے جس کی ضرورت تھی، اور **\"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\"** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب دوازدهم» در معرفت دورۀ فلک سرورمان محمد (صلی الله علیه و سلم)\n\n(بسم الله الرحمن الرحيم) این دورۀ سیادت (السيادة) است و اینکه زمان به همان هیئتی که خداوند آن را آفرید، چرخیده است.\n\n> فدای آن کس که پادشاه و سرور بود *** در حالی که آدم میان آب و گِل ایستاده بود\n>\n> او همان رسول ابطحی، محمد است *** که در علو، مجد دیرینه و تازه‌ای دارد\n>\n> در پایان مسیر، با زمان سعادت آمد *** و در هر عصر، جایگاه‌هایی داشت\n>\n> برای شکستگی روزگار آمد تا شکافش را ترمیم کند *** پس زبان‌ها و عارفان او را ستودند\n>\n> اگر امری را اراده کند، مخالفی برای آن نیست *** و در هستی (الکون)، بازدارنده‌ای از آن امر وجود ندارد.\n\n### [وجود روح محمد در عالم غیب]\n\nبدان، خداوند تو را یاری کند، هنگامی که خداوند ارواح محصور و مدبر اجسام را در زمان، هنگام وجود حرکت فلک، برای تعیین مدت معلوم نزد خداوند آفرید؛ و در آغاز آفرینش زمان با حرکتش، روح مدبر، یعنی روح محمد (صلی الله علیه و سلم) را آفرید. سپس ارواح دیگر در پی این حرکات صادر شدند. پس روح او در عالم غیب وجود داشت، نه در عالم شهادت. و خداوند او را به نبوتش آگاه ساخت و به آن بشارت داد، در حالی که آدم جز آن نبود که گفته شد: میان آب و گِل. و زمان با اسم باطن (الاسم الباطن) در حق محمد (صلی الله علیه و سلم) به وجود جسم او و پیوند روح با آن پایان یافت. با این پیوند، حکم زمان در جریان خود به اسم ظاهر (الاسم الظاهر) منتقل شد. پس محمد (صلی الله علیه و سلم) با ذات خود، جسم و روحاً، ظاهر گشت. بنابراین، حکم در ابتدا برای او باطناً در تمام آنچه از شرایع بر دست انبیا و رسولان (سلام الله علیهم اجمعین) ظاهر شد، بود. سپس حکم برای او ظاهراً شد، پس هر شریعتی را که اسم باطن (الاسم الباطن) آشکار کرده بود، به حکم اسم ظاهر (الاسم الظاهر) نسخ کرد تا تفاوت حکم دو اسم بیان شود، هرچند که شارع یکی است و او صاحب شریعت است. زیرا او فرمود: «من پیامبر بودم» و نگفت «من انسان بودم» یا «من موجود بودم». و نبوت جز با شریعت مقرر شده از جانب خداوند نیست. پس او خبر داد که صاحب نبوت است پیش از وجود پیامبرانی که نائبان او در این دنیا هستند، همان‌طور که در ابواب پیشین این کتاب مقرر کردیم.\n\n### [استدارۀ زمان]\n\nپس چرخیدن زمان، پایان دورۀ آن با اسم باطن (الاسم الباطن) و آغاز دورۀ دیگری با اسم ظاهر (الاسم الظاهر) بود. پس فرمود: «به همان هیئتی که خداوند آن را آفرید، چرخیده است»؛ یعنی در نسبت حکم برای ما ظاهراً، همان‌طور که در دورۀ اول باطناً به ما (یعنی به محمد) منسوب بود، و در ظاهر به کسانی که شریعت ابراهیم و موسی و عیسی و همۀ انبیا و رسولان به آن‌ها منسوب شد.\n\n### [پیامبران حرم و ماه‌های حرام]\n\nو در میان انبیا، چهار تن از زمان، حرم (محترم) هستند: هود، صالح، شعیب (سلام الله علیهم) و محمد (صلی الله علیه و سلم). و معادل آن‌ها از زمان، ذوالقعده، ذوالحجه، محرم و رجب مُضَر است. و چون عرب‌ها در ماه‌ها نسیء (تغییر) می‌کردند، ماه حرام را حلال و ماه حلال را حرام می‌شمردند، محمد (صلی الله علیه و سلم) آمد و زمان را به اصل خود بازگرداند که خداوند هنگام آفرینش بر آن حکم کرده بود. پس ماه‌های حرام را بر همان حدی که خداوند آفریده بود، تعیین کرد. به همین دلیل در زبان ظاهر فرمود: «زمان به همان هیئتی که خداوند آن را آفرید، چرخیده است.» همچنین زمان چرخید و محمد (صلی الله علیه و سلم) را همان‌طور که ذکر کردیم، جسماً و روحاً، با اسم ظاهر (الاسم الظاهر) به صورت حسی آشکار ساخت. پس از شریعت پیشین او، آنچه را که خداوند خواست نسخ کند، نسخ کرد و آنچه را که خواست باقی بماند، باقی گذاشت؛ و این مخصوص احکام است، نه اصول.\n\n### [ظهور محمد در دورۀ میزان]\n\nو چون ظهور او با میزان (الميزان) بود، که همان عدل در هستی (الکون) است و معتدل است، زیرا طبع آن حرارت و رطوبت است، از حکم آخرت بود. زیرا حرکت میزان (الميزان) تا ورود به بهشت و دوزخ به آخرت متصل است. به همین دلیل، علم در این امت بیشتر از امت‌های پیشین بود. و به محمد (صلی الله علیه و سلم) علم اولین و آخرین عطا شد، زیرا حقیقت میزان (الميزان) این را اقتضا می‌کند. و کشف (الکشف) در این امت سریع‌تر از امت‌های دیگر بود، به دلیل غلبۀ سردی و خشکی بر سایر امت‌های پیش از ما، هرچند که آن‌ها نیز باهوش و عالم بودند، اما افراد معینی از آن‌ها چنین بودند، برخلاف وضع امروز مردم. آیا نمی‌بینی که این امت تمام علوم امت‌ها را ترجمه کرده است؟ و اگر مترجم به معنایی که لفظ متکلم بر آن دلالت دارد، عالم نبود، صحیح نبود که مترجم باشد و نام ترجمه بر آن اطلاق نمی‌شد. پس این امت علم پیشینیان را دانست و به علومی اختصاص یافت که برای پیشینیان نبود. به همین دلیل،\nاو (صلی الله علیه و سلم) با این سخن اشاره کرد: «پس علم اولین را دانستم» که همان کسانی هستند که پیش از او بودند، سپس فرمود: «و آخرین»\nکه علم آنچه نزد پیشینیان نبود، می‌باشد؛ یعنی آنچه امت او پس از او تا روز قیامت می‌آموزند. پس او خبر داد که ما علومی داریم که پیش از این نبوده است. این گواهی پیامبر (صلی الله علیه و سلم) برای ماست و او در این باره صادق است.\n\n### [سیادت محمدی در علم و حکم]\n\nپس سیادت (السيادة) در علم در دنیا برای او (صلی الله علیه و سلم) ثابت شد و همچنین سیادت در حکم، آنجا که\nفرمود: «اگر موسی زنده بود، چاره‌ای جز پیروی از من نداشت.»\nو این امر هنگام نزول عیسی (علیه السلام) و حکم او در میان ما با قرآن، روشن می‌شود. پس سیادت (السيادة) در دنیا از هر جهت و معنایی برای او صحیح شد. سپس سیادت او بر سایر مردم در روز قیامت با گشودن باب شفاعت ثابت شد. و این امر در روز قیامت جز برای او (صلی الله علیه و سلم) برای هیچ پیامبری نخواهد بود. او (صلی الله علیه و سلم) برای رسولان و انبیا شفاعت کرد که شفاعت کنند، بله، و برای فرشتگان نیز. پس خداوند متعال هنگام شفاعت او در این باره، به همۀ کسانی که حق شفاعت دارند، از فرشته و رسول و نبی و مؤمن، اجازه داد که شفاعت کنند. پس او (صلی الله علیه و سلم) اولین شفاعت‌کننده به اذن خداوند است و ارحم الراحمین (مهربان‌ترین مهربانان) آخرین شفاعت‌کننده در روز قیامت است. پس رحیم نزد منتقم شفاعت می‌کند که هر کس هیچ کار خیری انجام نداده است، از آتش خارج شود. پس منعم و متفضل آن‌ها را خارج می‌سازد. و چه شرافتی بزرگ‌تر از دایره‌ای که می‌چرخد و آخر آن ارحم الراحمین باشد و آخر دایره به اول آن متصل شود؟ پس چه شرافتی بزرگ‌تر از شرافت محمد (صلی الله علیه و سلم) که آغاز این دایره بود و آخر آن به دلیل کمالش به آن متصل شد؟ پس اشیا به واسطۀ او (سبحانه) آغاز شدند و به واسطۀ او کامل گشتند. و چه شرافتی بزرگ‌تر از شرافت مؤمن که شفاعت او به شفاعت ارحم الراحمین پیوست؟ پس مؤمن میان خداوند و انبیا قرار دارد. زیرا علم در حق مخلوق، هرچند که شرافت کاملی دارد که جایگاهش نادیده گرفته نمی‌شود، اما سعادت در قرب الهی را جز با ایمان نمی‌دهد. پس نور ایمان در مخلوق شریف‌تر از نور علمی است که ایمان همراه آن نیست. پس اگر علم از ایمان حاصل شود، نور آن علم که از نور ایمان متولد شده، بالاتر است و به واسطۀ آن بر مؤمنی که عالم نیست، برتری می‌یابد. و خداوند کسانی از مؤمنان را که علم یافته‌اند، بر مؤمنانی که علم نیافته‌اند، درجات بالا می‌برد و علم به خداوند را می‌افزاید.\nزیرا رسول خدا (صلی الله علیه و سلم) به اصحابش می‌فرماید: «شما به مصالح دنیای خود داناترید.»\n\n### [امتیازات محمدی از وحی امر آسمان‌های هفت‌گانه]\n\nپس هیچ فلکی وسیع‌تر از فلک محمد (صلی الله علیه و سلم) نیست، زیرا احاطه برای اوست و برای کسانی از امت اوست که خداوند به حکم تبعیت، این احاطه را به آن‌ها اختصاص داده است. پس ما بر سایر امت‌ها احاطه داریم و به همین دلیل شاهد بر مردم هستیم. پس خداوند از وحی امر آسمان‌ها به او چیزی عطا کرد که به دیگری نداد، در طالع مولد او.\n**از امر مخصوص به آسمان اول:** از آنجا هیچ حرفی از قرآن و هیچ کلمه‌ای تبدیل نشد. و اگر شیطان در تلاوت آن چیزی را که از آن نیست، با نقص یا زیاده القا می‌کرد، خداوند آن را نسخ می‌کرد. و این عصمت است. و از آن ثبات این است که شریعت او با شریعت دیگری نسخ نشد، بلکه ثابت و محفوظ ماند و با هر چشمی که به آن نگریسته می‌شود، استقرار یافت. به همین دلیل هر طایفه‌ای به آن استشهاد می‌کند.\n**و از امر مخصوص به آسمان دوم:** از آنجا نیز به علم اولین و آخرین و وقار و رحمت و مدارا اختصاص یافت. و «کَانَ بِالْمُؤْمِنِینَ رَحِیمًا» (نسبت به مؤمنان مهربان بود). و هرگز در هیچ زمانی بر کسی خشونت نشان نداد، مگر به امر الهی، آنگاه که به او گفته شد: «جَاهِدِ الْکُفَّارَ وَالْمُنَافِقِینَ وَاغْلُظْ عَلَیْهِمْ» (با کافران و منافقان جهاد کن و بر آنان سخت بگیر). پس به این امر شد، زیرا طبع او آن را اقتضا نمی‌کرد. و اگرچه او بشری بود که برای خود خشمگین می‌شد و برای خود راضی می‌گشت، اما پیشاپیش برای این امر داروی ما را فراهم کرد. پس در آن خشم، رحمتی وجود دارد که در حال خشم آن را احساس نمی‌کند. پس دلالت او با خشمش مانند دلالت او با رضایتش بود. و این به دلیل اسراری است که ما و اهل الله از ما آن را می‌دانیم. پس سیادت (السيادة) او بر عالم از این باب صحیح شد. زیرا دربارۀ غیر امت او گفته شد: «یُحَرِّفُونَهُ مِنْ بَعْدِ مَا عَقَلُوهُ وَهُمْ یَعْلَمُونَ» (آن را پس از آنکه فهمیدند، تحریف می‌کنند، در حالی که می‌دانند). پس خداوند آن‌ها را با وجود علمشان گمراه کرد. و خداوند حفظ ذکر خود را دربارۀ ما بر عهده گرفت و فرمود: «إِنَّا نَحْنُ نَزَّلْنَا الذِّکْرَ وَإِنَّا لَهُ لَحَافِظُونَ» (ما خود ذکر [قرآن] را نازل کردیم و خود نگهبان آن هستیم). زیرا خداوند گوش و چشم و زبان و دست بنده را شنید و کتابش را به غیر این امت سپرد، پس آن را تحریف کردند.\n**و از امر مخصوص از وحی آسمان سوم:** از آنجا نیز شمشیری که با آن مبعوث شد و خلافت، و اختصاص به جنگیدن فرشتگان با او از همین آسمان است. زیرا فرشتگان این آسمان در روز بدر با او جنگیدند. و از این آسمان نیز از قومی مبعوث شد که همتی جز در مهمان‌نوازی و قربانی کردن شتران و جنگ‌های دائمی و ریختن خون نداشتند. و به این امور فخر می‌کردند و ستایش می‌شدند. دربارۀ برخی از آن‌ها گفته شده است:\n\n> با تیغ شمشیر، ساق شتران فربه را می‌زند *** اگر زاد و توشه‌ای نیابند، تو (ای شتر) عقیم هستی\n\n**و دیگری از آن‌ها در ستایش قومش گفت:**\n\n> دور مبادند قوم من که آنان *** زهر دشمنان و آفت شتران فربه هستند\n>\n> آنان که در هر میدان نبرد فرود می‌آیند *** و پاکیزه‌کنندگان بندهای ازار (عفیفان) هستند\n\nپس آن‌ها را به کرم و شجاعت و عفت ستود. عنترة بن شداد در حفظ همسایه در میان خانواده‌اش می‌گوید:\n\n> و چشم خود را فرو می‌بندم تا زمانی که همسایه‌ام بر من ظاهر شود *** تا اینکه همسایه‌ام به پناهگاه خود رود.\n\nو برتری عرب بر عجم در کرم و دلاوری و وفاداری بر هیچ کس پوشیده نیست، هرچند که در عجم نیز کریمان و شجاعانی هستند، اما به صورت افراد معدود، همان‌طور که در عرب نیز ترسوها و بخیلانی هستند، اما به صورت افراد معدود. و سخن دربارۀ غالب است، نه نادر. و این چیزی است که هیچ کس آن را انکار نمی‌کند. پس این از اموری است که خداوند در این آسمان وحی کرد. این همه از امری است که میان آسمان و زمین نازل می‌شود، برای کسی که بفهمد. و اگر آنچه را که خداوند سبحان در هر آسمان وحی کرده است، به تفصیل ذکر می‌کردیم، عجایبی را آشکار می‌ساختیم که شاید برخی از کسانی که از طریق رصد و تسییر (علم نجوم) به آن علم می‌نگرند، آن را انکار کنند و منصفان آن‌ها در شنیدن آن متحیر شوند.\n**و از وحی مأمور به در آسمان چهارم:** نسخ کردن تمام شرایع با شریعت او و غلبۀ دین او بر تمام ادیان نزد هر رسولی که پیش از او بود و در هر کتاب نازل شده. پس برای هیچ دینی از ادیان نزد خداوند حکمی باقی نماند، مگر آنچه که او مقرر کرد. پس با تقریر او ثابت شد و از شریعت اوست و رسالت او عمومی است. و اگر حکمی از آن باقی مانده باشد، جز در مورد اهل جزیه، حکم خداوند نیست. و ما گفتیم حکم خداوند نیست، زیرا خداوند آن را باطل نامیده است. پس آن بر کسی است که از آن پیروی کند، نه به نفع او. و منظورم از غلبۀ دین او بر تمام ادیان، همان‌طور که نابغه در مدح او گفت، این است:\n\n> آیا ندیدی که خداوند به تو منزلتی عطا کرد *** که هر پادشاهی را فروتر از آن می‌بینی که می‌لرزد؟\n>\n> تو خورشیدی و پادشاهان ستارگانند *** هنگامی که طلوع کنی، هیچ ستاره‌ای از آن‌ها دیده نمی‌شود.\n\nو این منزلت محمد (صلی الله علیه و سلم) و منزلت شریعتی است که او آورده است، نسبت به انبیا و شرایع آن‌ها (سلام الله علیهم اجمعین). زیرا انوار ستارگان در نور خورشید مستتر شدند. پس روز برای ماست و شب تنها برای اهل کتاب است، هنگامی که «الْجِزْیَةَ عَنْ یَدٍ وَهُمْ صَاغِرُونَ» (جزیه را با دست خود و در حال خواری) بپردازند. و ما در تنزلات موصلیه، امر هر آسمان را بسط داده‌ایم که اگر بر آن وقوف یابی، برخی از آنچه در آن است را خواهی شناخت.\n**و از وحی مأمور به در آسمان پنجم:** از آنجا مخصوص محمد (صلی الله علیه و سلم) است که هرگز از هیچ پیامبری نقل نشده است که زنان برای او محبوب شده باشند، مگر محمد (صلی الله علیه و سلم). هرچند که بسیاری از آن‌ها نصیبشان شد، مانند سلیمان (علیه السلام) و دیگران، اما سخن ما دربارۀ محبوب شدن زنان برای اوست. و این بدان سبب است که او (صلی الله علیه و سلم) پیامبر بود در حالی که آدم میان آب و گِل بود، همان‌طور که مقرر کردیم و به شکلی که شرح دادیم. پس او منقطع به پروردگارش بود و به هیچ یک از اکوان (هستی‌ها) نمی‌نگریست، به دلیل اشتغالش به خداوند. زیرا پیامبر مشغول دریافت از خداوند و مراعات ادب است و به چیزی جز او فارغ نمی‌شود. پس خداوند زنان را برای او محبوب ساخت و او آن‌ها را دوست داشت، به عنوان عنایتی از جانب خداوند به زنان. پس او (صلی الله علیه و سلم) به دلیل محبتی که خداوند زنان را برای او محبوب ساخت، آن‌ها را دوست داشت. مسلم در صحیح خود در ابواب ایمان آورده است که مردی به رسول خدا (صلی الله علیه و سلم) گفت:\n«من دوست دارم که کفشم زیبا باشد و لباسم.»\nرسول خدا (صلی الله علیه و سلم) فرمود: «إِنَّ اللَّهَ جَمِیلٌ یُحِبُّ الْجَمَالَ» (همانا خداوند زیباست و زیبایی را دوست دارد).\nو از این آسمان، محبت بوی خوش بود. و از سنت او ازدواج بود، نه رهبانیت. و ازدواج را عبادتی قرار داد به خاطر سرّ الهی که در آن نهفته است و جز در زنان نیست. و آن ظهور اعیان برای سه حکمی است که پیشتر ذکر شد در تولید از دو مقدمه و رابطی که علت تولید قرار داده شد. پس این فضیلت و مانند آن، از اموری است که محمد (صلی الله علیه و سلم) به آن اختصاص یافت و با نکاح هبه (بخشیدن) بر آن افزود، همان‌طور که در امت او در مورد نکاح برای کسی که عوضی ندارد، به آنچه از قرآن حفظ کرده است، توسعه داده شد، نه اینکه به او تعلیم دهد. و این اگرچه به قوت هبه نیست، اما در آن برای امت گشایشی است. و در وسع نیست که آنچه را خداوند از امر در هر آسمان وحی کرده است، به طور کامل بیان کنیم.\n**و از امر وحی شده در آسمان ششم:** اعجاز قرآن و آنچه از جوامع الکلم (سخنان جامع) به او (صلی الله علیه و سلم) عطا شد، از این آسمان بر او نازل شد و به هیچ پیامبری پیش از او داده نشد. و فرمود: «شش چیز به من داده شده که به هیچ پیامبری پیش از من داده نشده است.» و همۀ این‌ها در آسمان‌ها وحی شده است، از قول او: «وَأَوْحَىٰ فِی کُلِّ سَمَاءٍ أَمْرَهَا» (و در هر آسمانی امر آن را وحی کرد). پس در هر آسمانی آنچه را که اجرای آن در زمین در این خلق شایسته است، قرار داد. پس از آن جمله این بود که او به تنهایی برای همۀ مردم مبعوث شد، پس رسالت او عمومیت یافت. و این از اموری است که خداوند در آسمان چهارم وحی کرد. و با رعب یاری شد، و این از اموری است که خداوند در آسمان سوم از آنجا وحی کرد. و از آن جمله، حلال شدن غنائم برای او و قرار دادن زمین برای او مسجد و پاک‌کننده (طهور) است، که از آسمان دوم از آنجا بود. و جوامع الکلم از امر وحی آسمان ششم به من داده شد. و از امر این آسمان، اختصاص خداوند به او در اعطای کلیدهای خزانه‌های زمین به اوست.\n**و از وحی مأمور به در آسمان هفتم:** که همان آسمان دنیاست که به ما نزدیک است، اختصاص خداوند به او با صورت کمال است. پس شرایع به واسطۀ او کامل شد و او خاتم پیامبران بود. و این برای غیر او (صلی الله علیه و سلم) نبود. پس به واسطۀ این و امثال آن، به سیادت (السيادة) جامعی که همۀ سیادت‌ها را در بر می‌گیرد و شرافت محیط و عام، منحصر شد (صلی الله علیه و سلم). پس ما تو را بر آنچه در مولد او از برخی اموری که خداوند در هر آسمان وحی کرده است، آگاه ساختیم.\n\n### [میزان و زمان]\n\nو سخن او «الزمان» (زمان) و نه «الدهر» (روزگار) یا غیر آن، بر وجود میزان (الميزان) آگاه می‌سازد. زیرا از حروفی که در میزان (الميزان) است، با ذکر زمان خارج نشده است. و یای میزان را در کنار زای قرار داد و زای را تخفیف داد و عدد آن را در زمان قرار داد، تا اشاره کند که در این زای، حرفی ادغام شده است. پس اولین وجود زمان در میزان (الميزان) برای عدل روحانی و در اسم باطن (الاسم الباطن) برای محمد (صلی الله علیه و سلم) بود، با قول او: «من پیامبر بودم در حالی که آدم میان آب و گِل بود.» سپس پس از انقضای دورۀ زمان که هفتاد و هشت هزار سال است، چرخید. سپس دورۀ دیگری از زمان با اسم ظاهر (الاسم الظاهر) آغاز شد. پس جسم محمد (صلی الله علیه و سلم) در آن ظاهر شد و شریعت او به صورت تعیین و تصریح، نه کنایه، ظاهر گشت. و حکم به آخرت متصل شد. پس خداوند متعال فرمود: «وَنَضَعُ الْمَوَازِینَ الْقِسْطَ لِیَوْمِ الْقِیَامَةِ» (و ترازوهای عدل را برای روز قیامت می‌نهیم). و به ما گفته شد: «وَأَقِیمُوا الْوَزْنَ بِالْقِسْطِ وَلَا تُخْسِرُوا الْمِیزَانَ» (و وزن را به عدل برپا دارید و در میزان (ترازو) کم نگذارید). و خداوند متعال فرمود: «وَالسَّمَاءَ رَفَعَهَا وَوَضَعَ الْمِیزَانَ» (و آسمان را برافراشت و میزان (ترازو) را نهاد). پس به واسطۀ میزان (الميزان) بود که «أَوْحَىٰ فِی کُلِّ سَمَاءٍ أَمْرَهَا» (در هر آسمانی امر آن را وحی کرد). و به واسطۀ آن، روزی‌های زمین را تقدیر کرد. و حق (الحق) آن را در عالم در هر چیزی نصب کرد. پس میزان معنوی و میزان حسی وجود دارد که هرگز خطا نمی‌کند. پس میزان در کلام و در تمام صنایع محسوس و همچنین در معانی وارد شد، زیرا اصل وجود اجسام و اجرام و معانی‌ای که حمل می‌کنند، نزد حکم میزان بود. و وجود میزان و آنچه فوق زمان است، از وزن الهی است که اسم حکیم (الاسم الحکیم) آن را می‌طلبد و حکم عدل (الحکم العدل) آن را آشکار می‌سازد، لا إله إلا هو. و از میزان، عقرب و آنچه خداوند در آن از امر الهی وحی کرد، و قوس و جدی و دلو و حوت و حمل و ثور و جوزا و سرطان و اسد و سنبله ظاهر شد.\n\n### [انتهای دورۀ زمانی به میزان]\n\nو دورۀ زمانی به میزان (الميزان) پایان یافت تا دوره‌ها تکرار شوند. پس محمد (صلی الله علیه و سلم) ظاهر شد و برای او در هر جزئی از اجزای زمان، حکمی بود که با ظهور او (صلی الله علیه و سلم) در آن جمع شد. و این اسامی، اسامی فرشتگانی هستند که خداوند آن‌ها را آفرید و آن‌ها دوازده فرشته هستند. و خداوند برای آن‌ها مراتبی در فلک محیط قرار داد و در دست هر فرشته آنچه را که خواست قرار داد تا آن را در کسانی که فروتر از آن‌ها هستند تا زمین، به حکمت آشکار سازد. پس روحانیت محمد (صلی الله علیه و سلم) در هر حرکت از زمان، اخلاقی را کسب می‌کرد، بر حسب اموری الهی که خداوند در آن حرکات به ودیعه نهاده بود. پس پیوسته این صفات روحانی را پیش از وجود ترکیب جسمش کسب می‌کرد تا اینکه صورت جسم او در عالم دنیا با اخلاق ستوده‌ای که خداوند او را بر آن سرشت، ظاهر شد. پس دربارۀ او گفته شد: «وَإِنَّکَ لَعَلَىٰ خُلُقٍ عَظِیمٍ» (و تو بر اخلاق بزرگی هستی). پس او صاحب خلق بود، نه اینکه متخلق باشد (یعنی خلق در او ذاتی بود). و چون احکام اخلاق با اختلاف محلی که باید با آن مواجه شود، متفاوت است، صاحب خلق نیازمند علمی است که بر اساس آن، خلقی را که شایستۀ آن محل است، به امر خداوند در آن محل به کار برد، تا موجب قربت به خداوند شود. به همین دلیل شرایع نازل شدند تا محل‌های احکام اخلاقی را که انسان بر آن سرشته شده است، برای مردم بیان کنند. پس خداوند در مثلی فرمود: «وَلَا تَقُلْ لَهُمَا أُفٍّ» (و به آن دو [پدر و مادر] اُف مگو)، به دلیل وجود تأفف (ابراز نارضایتی) در خلقت او. پس محلی را که نباید حکم این خلق در آن ظاهر شود، بیان کرد. سپس محلی را که باید این خلق در آن ظاهر شود، بیان کرد و فرمود: «أُفٍّ لَکُمْ وَلِمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ» (اُف بر شما و بر آنچه جز خدا می‌پرستید).\nو خداوند متعال فرمود: «فَلَا تَخَافُوهُمْ» (پس از آنان نترسید)، و محلی را که نباید خلق ترس در آن ظاهر شود، بیان کرد. سپس به آن‌ها فرمود: «خَافُونِ» (از من بترسید)، و محلی را که باید حکم این صفت در آن ظاهر شود، بیان کرد. و همچنین حسد و حرص و تمام آنچه در این نشأت طبیعی است که حکم روحانیت آن در آن ظاهر است، خداوند برای ما بیان کرده است که کجا آن‌ها را آشکار سازیم و کجا از آن‌ها جلوگیری کنیم. زیرا از محالات است که آن‌ها را از این نشأت زایل کنیم، مگر با زوال خود نشأت، چون آن‌ها عین آن هستند و شیء از نفس خود جدا نمی‌شود.\nاو (صلی الله علیه و سلم) فرمود: «لا حسد إلا في اثنتين» (حسد روا نیست مگر در دو مورد). و فرمود: «زادك الله حرصا ولا تعد» (خداوند حرص تو را زیاد کند و تجاوز مکن).\nو ما گفتیم «حکم روحانیت آن در آن ظاهر است» تا از این طریق از اهل کشف (الکشف) و علمای راسخ در علم از محققان آگاه، احتراز کنیم. زیرا آنچه جماد و نبات نامیده می‌شود، نزد ما ارواحی دارند که از ادراک غیر اهل کشف در حالت عادی پنهان است و مانند آنچه حیوان آن را حس می‌کند، حس نمی‌شود. پس نزد اهل کشف، همه حیوان ناطق، بلکه حیّ ناطق هستند، جز اینکه این مزاج خاص، تنها به واسطۀ صورت، انسان نامیده می‌شود. و تفاوت میان خلایق در مزاج رخ داده است، زیرا در هر ممزوجی، مزاج خاصی لازم است که جز برای او نباشد و به واسطۀ آن از غیر خود متمایز شود، همان‌طور که با غیر خود در امری مشترک است. پس آنچه موجب افتراق و تمایز می‌شود، عین آنچه موجب اشتراک و عدم تمایز می‌شود، نیست. پس این را بدان و به آن یقین پیدا کن.\n\n### [عالم همه زنده، دانا و ناطق است]\n\nخداوند متعال فرمود: «وَإِنْ مِنْ شَیْءٍ إِلَّا یُسَبِّحُ بِحَمْدِهِ» (و هیچ چیزی نیست مگر اینکه با ستایش او تسبیح می‌گوید). و «شیء» نکره است و تسبیح نمی‌گوید مگر موجود زنده، عاقل و عالم به مسبوح خود. و وارد شده است که مؤذن را تا جایی که صدایش می‌رسد، از تر و خشک گواهی می‌دهد. و شرایع و نبوات از این قبیل مملو هستند. و ما علاوه بر ایمان به اخبار، کشف (الکشف) را نیز افزوده‌ایم. پس ما سنگ‌ها را دیده‌ایم که خداوند را ذکر می‌کنند، با دیدۀ چشم، با زبان نطقی که گوش‌های ما آن را می‌شنود و با ما مانند عارفان به جلال خداوند سخن می‌گویند، که هر انسانی آن را درک نمی‌کند. پس هر جنسی از خلق خداوند، امتی از امت‌ها هستند که خداوند آن‌ها را بر عبادتی خاص سرشته است که آن را در نفوسشان به آن‌ها وحی کرده است. پس رسول آن‌ها از خودشان است، به عنوان اعلامی از جانب خداوند با الهامی خاص که آن‌ها را بر آن سرشته است، مانند علم برخی حیوانات به چیزهایی که مهندس ماهر از درک آن‌ها قاصر است، یا علم مطلق آن‌ها به منافعشان در آنچه از گیاهان و خوراکی‌ها می‌خورند و پرهیز از آنچه به آن‌ها ضرر می‌رساند. همۀ این‌ها در فطرت آن‌هاست. همچنین آنچه جماد و نبات نامیده می‌شود، خداوند چشم‌ها و گوش‌های ما را از نطق آن‌ها گرفته است. و قیامت برپا نمی‌شود تا اینکه ران مرد با او سخن بگوید دربارۀ آنچه خانواده‌اش انجام داده‌اند. جاهلان از حکما، اگر ایمانشان به این صحیح باشد، این را از باب علم به اختلاج (جنبش اعضا) قرار داده‌اند و منظورشان علم زجر (فال‌گیری) است. هرچند که علم زجر در نفس الامر علمی صحیح و از اسرار خداوند است، اما مقصود شارع در این کلام نیست. پس برای او (صلی الله علیه و سلم) کشف (الکشف) کامل بود. پس آنچه را که ما نمی‌بینیم، می‌دید و آنچه را که ما نمی‌شنویم، می‌شنید. و او (علیه السلام) بر امری آگاه ساخت که اهل الله بر آن عمل کردند و آن را صحیح یافتند:\nقول او: «اگر در سخن شما زیاده‌روی و در قلب‌های شما آلودگی نبود، آنچه را که من می‌بینم، می‌دیدید و آنچه را که من می‌شنوم، می‌شنیدید.»\nپس او به رتبۀ کمال در تمام امورش اختصاص یافت، و از جمله کمال در عبودیت. پس او بنده‌ای محض بود که ربوبیتی بر کسی به ذات او قائم نشد. و این همان چیزی است که سیادت (السيادة) را برای او واجب ساخت و دلیل بر شرافت دائمی اوست. و عایشه گفت: «رسول خدا (صلی الله علیه و سلم) در تمام اوقاتش خداوند را ذکر می‌کرد.»\nو ما از او میراث وافری داریم و آن امری است که به باطن انسان اختصاص دارد. و سخن او (ابن عربی) این است که گاهی خلاف آن با افعال او ظاهر می‌شود، با وجود تحقق او به مقام، و این بر کسی که معرفت (المعرفة) به احوال ندارد، مشتبه می‌شود. پس ما در این باب آنچه را که نیاز بود، بیان کردیم. و «وَاللَّهُ یَقُولُ الْحَقَّ وَهُوَ یَهْدِی السَّبِیلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}