{
  "id": 164,
  "title": {
    "ar": "الباب الرابع والستون ومائة في معرفة مقام التصوف",
    "en": "Chapter One Hundred and Sixty-Four: Concerning the Gnosis of the Station of Sufism (مقام التصوف)",
    "ur": "ایک سو چونسٹھواں باب: مقامِ تصوف (التصوف) کی معرفت میں۔",
    "fa": "باب صد و شصت و چهارم در معرفت مقام تصوف"
  },
  "content": {
    "ar": "## (الباب الرابع والستون ومائة في معرفة مقام التصوف)\n\n\n> فاعلم إن التصوف تشبيه بخالقنا *** لأنه خلق فانظر ترى عجبا\n\n\n> كيف التخلق والمكر الخفي له *** في خلقه وبهذا القدر قد حجبا\n\n\n> وذمه في صفات الخلق فاعتبروا *** فيه فذا مثل للعقل قد ضربا\n\n\n> إن الحديد إذا ما الصنع يدخله *** في غير منزلة يرده ذهبا\n\n\n> كذلك الخلق المذموم يرجع *** محمودا إذا هو للرحمن قد نسبا\n\n\n> أن التوصف أخلاق مطهرة *** مع الإله فلا تعدل به نسبا\n\n\n### [خلق رسول الله ص‏]\n\n\nقال أهل طريق الله التصوف خلق فمن زاد عليك في الخلق زاد عليك في التصوف‏\n\n\nوسألت عائشة أم المؤمنين عن خلق رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فقالت كان خلقه القرآن‏\n\n\nوإن الله أثنى عليه بما أعطاه من ذلك فقال وإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ‏\n\n\n### [من شرط المنعوت بالتصوف أن يكون حكيما]\n\n\nومن شرط المنعوت بالتصوف أن يكون حكيما ذا حكمة وإن لم يكن فلا حظ له في هذا اللقب فإنه حكمة كله فإنه أخلاق وهي تحتاج إلى معرفة تامة وعقل راجح وحضور وتمكن قوي من نفسه حتى لا تحكم عليه الأغراض النفسية وليجعل القرآن أمامه صاحب هذا المقام فينظر إلى ما وصف الحق به نفسه وفي أي حالة وصف نفسه بذلك الذي وصف نفسه ومع من صرف ذلك الوصف الذي وصف به نفسه فليقم الصوفي بهذا الوصف بتلك الحال مع ذلك الصنف فأمر التصوف أمر سهل لمن أخذه بهذا الطريق ولا يستنبط لنفسه أحكاما ويخرج عن ميزان الحق في ذلك فإنه من فعل ذلك لحق بِالْأَخْسَرِينَ أَعْمالًا الَّذِينَ ضَلَّ سَعْيُهُمْ في الْحَياةِ الدُّنْيا وهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعاً فإن الله لا يقيم له يَوْمَ الْقِيامَةِ وَزْناً كما أنهم لم يقيموا للحق هنا وزنا فعادت عليهم صفتهم فما عذبهم بغيرهم‏\n\n\n### [ان الله تعالى لم يذكر في القرآن صفة قهر وشدة إلا وإلى جانبها صفة لطف ولين‏]\n\n\nفتأمل قوله تعالى في كتابه فإنه ما ذكر صفة قهر وشدة إلا وإلى جانبها صفة لطف ولين حيثما كان من كتاب الله ثم إن أفرد صفة منها ولم يذكر إلى جانبها ما يقابلها أطلبها تجد مقابلها في موضع آخر مفردا أيضا فذلك المفرد المقابل هو لهذا المفرد المقابل والغالب الجمعية قال تعالى نَبِّئْ عِبادِي أَنِّي أَنَا الْغَفُورُ الرَّحِيمُ ثم أردف بالمقابل فقال تعالى وأَنَّ عَذابِي هُوَ الْعَذابُ الْأَلِيمُ وقال إِنَّ رَبَّكَ لَسَرِيعُ الْعِقابِ ثم أردف بالمقابل فقال وإِنَّهُ لَغَفُورٌ رَحِيمٌ وقال وإِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ لِلنَّاسِ عَلى‏ ظُلْمِهِمْ ثم أردف فقال وإِنَّ رَبَّكَ لَشَدِيدُ الْعِقابِ وتتبع هذا تجده كما ذكرناه لك‏\n\n\n### [ان الله لم يذكر في القرآن نعتا من نعوت أهل السعادة إلا وذكر إلى جانبه نعتا من نعوت أهل الشقاء]\n\n\nثم إنه ما ذكر نعتا من نعوت أهل السعادة إلا وذكر إلى جانبه نعتا من نعوت أهل الشقاء إما بتقديم أو تأخير قال تعالى وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ ضاحِكَةٌ مُسْتَبْشِرَةٌ في أهل السعادة ثم عطف فقال ووُجُوهٌ يَوْمَئِذٍ عَلَيْها غَبَرَةٌ تَرْهَقُها قَتَرَةٌ أُولئِكَ هُمُ الْكَفَرَةُ الْفَجَرَةُ وقال تعالى في حال أهل السعادة وُجُوهٌ يَوْمَئِذٍ ناضِرَةٌ إِلى‏ رَبِّها ناظِرَةٌ ثم عطف فقال في أهل الشقاء ووُجُوهٌ يَوْمَئِذٍ باسِرَةٌ تَظُنُّ أَنْ يُفْعَلَ بِها فاقِرَةٌ والوجوه هنا عبارة عن النفوس الإنسانية لأن وجه الشي‏ء حقيقته وذاته وعينه لا الوجوه المقيدة بالأبصار فإنها لا تتصف بالظنون ومساق الآية يعطي أن الوجوه هنا هي ذوات المذكورين وقال في الأشقياء وُجُوهٌ يَوْمَئِذٍ خاشِعَةٌ عامِلَةٌ ناصِبَةٌ تَصْلى‏ ناراً حامِيَةً ثم عطف بالسعداء فقال وُجُوهٌ يَوْمَئِذٍ ناعِمَةٌ لِسَعْيِها راضِيَةٌ في جَنَّةٍ عالِيَةٍ وقال في أحوال السعداء فَأَمَّا من أُوتِيَ كِتابَهُ بِيَمِينِهِ فذكر خيرا ثم عطف وقال وأَمَّا من أُوتِيَ كِتابَهُ بِشِمالِهِ فذكر شرا وكذلك قوله من كانَ يُرِيدُ الْعاجِلَةَ عَجَّلْنا لَهُ فِيها ما نَشاءُ لِمَنْ نُرِيدُ ثُمَّ جَعَلْنا لَهُ جَهَنَّمَ يَصْلاها ثم عطف وقال ومن أَرادَ الْآخِرَةَ وسَعى‏ لَها سَعْيَها وقال في العناية فَأَلْهَمَها فُجُورَها ثم عطف فقال وتَقْواها وقال قَدْ أَفْلَحَ من زَكَّاها ثم عطف وقَدْ خابَ من دَسَّاها وقال فَأَمَّا من أَعْطى‏ واتَّقى‏ وصَدَّقَ بِالْحُسْنى‏ فَسَنُيَسِّرُهُ لِلْيُسْرى‏ ثم عطف‏\nوقال وأَمَّا من بَخِلَ واسْتَغْنى‏ وكَذَّبَ بِالْحُسْنى‏ فَسَنُيَسِّرُهُ لِلْعُسْرى‏ فالصوفي من قام في نفسه وفي خلقه قيام الحق في كتابه وفي كتبه ف ما أَصابَكَ من حَسَنَةٍ فَمِنَ الله وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ فقد رميت بك على الطريق وليس التصوف بشي‏ء زائد عند القوم سوى ما ذكرته لك وبينته ولكن الله أنزل الميزان والعلم بالمواطن وبالأحوال فلا تخرج شيئا عن مقتضى ما تطلبه الحكمة ونُنَزِّلُ من الْقُرْآنِ ما هُوَ شِفاءٌ ورَحْمَةٌ لِلْمُؤْمِنِينَ فالتخلق به والوقوف عنده يزيل المرض النفسي لا بد من ذلك ولكن للمؤمنين ولا يَزِيدُ الظَّالِمِينَ إِلَّا خَساراً لأنهم يعدلون به عن موطنه ويُحَرِّفُونَ الْكَلِمَ عَنْ مَواضِعِهِ فيعممون الخاص ويخصصون العام فسموا ظالمين قاسطين والحكماء هم\n\n\nالمقسطون ومن أوتي الحكمة فَقَدْ أُوتِيَ خَيْراً كَثِيراً وما وصفه الله بالكثرة فإن القلة لا تدخله وسبب وصفه بالكثرة لأن الحكمة سارية في الموجودات لأن الموجودات وضع الله ثم خلق الإنسان وحمله الأمانة بأن جعل له النظر في الموجودات والتصرف فيها بالأمانة ليؤدي إلى كل ذي حق حقه كما إن الله أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ فجعل الإنسان خليفة في الأرض دون غيره من المخلوقين فهو أمين على خلق الله فلا يعدل بهم عن سنة الله فالموجودات بيد الإنسان أمانة عرضت عليه فحملها فإن أداها فهو الصوفي وإن لم يؤدها فهو الظلوم الجهول والحكمة تناقض الجهل والظلم فالتخلق بأخلاق الله هو التصوف وقد بين العلماء التخلق بأسماء الله الحسنى وبينوا مواضعها وكيف تنسب إلى الخلق ولا تحصى كثرة وأحسن ما تصرف فيه مع الله خاصة فمن تفطن وصرفها مع الله أحاط علما بتصريفها مع الموجودات فذلك المعصوم الذي لا يخطئ أبدا والمحفوظ من أن يتحرك أو يسكن سدى جعلنا الله من الصوفية القائمين بحقوق الله والمؤثرين جناب الله‏\n\n",
    "en": "Chapter One Hundred and Sixty-Four: Concerning the Knowledge of the Station of Sufism (مقام التصوف)\n\nKnow that Sufism is the imitation of our Creator,\nFor He created; look, and you shall see a wonder.\nHow the ethical character and the subtle, hidden planning (المكر الخفي)\nBelong to Him in His creation, and by this measure, He is veiled.\nAnd His condemnation of the attributes of creation (صفات الخلق)—so reflect upon it—\nFor this is a parable struck for the intellect.\nIndeed, if craftsmanship enters iron,\nIn a different station, it turns it into gold.\nLikewise, the blameworthy character (الخلق المذموم) becomes praiseworthy\nIf it is attributed to the All-Merciful (الرحمن).\nThat being described [by these qualities] is purified ethics (أخلاق مطهرة)\nWith the Divine, so do not equate any lineage (نسبا) with it.\n\n### The Character of the Messenger of Allah\n\nThe people of the Divine Path (أهل طريق الله) said: Sufism is character (خلق); whoever surpasses you in character surpasses you in Sufism.\n\nAisha, the Mother of the Believers, was asked about the character of the Messenger of Allah (peace and blessings be upon him), and she replied: \"His character was the Quran.\"\n\nIndeed, Allah praised him for what He granted him of this, saying: <<وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ>> (And indeed, you are upon a magnificent character).\n\n### A Condition for One Described by Sufism is that He Be Wise\n\nA condition for one described by Sufism (المنعوت بالتصوف) is that he must be wise (حكيما), possessing wisdom (حكمة). If he is not, he has no share in this title, for Sufism is entirely wisdom. It is ethics (أخلاق), and ethics require complete knowledge (معرفة تامة), a sound intellect (عقل راجح), presence (حضور), and strong self-mastery (تمكن قوي من نفسه) so that selfish desires (الأغراض النفسية) do not rule him.\n\nThe possessor of this station (صاحب هذا المقام) should place the Quran before him, looking at how the Real (الحق) described Himself, in what state He described Himself with that description, and with whom He directed that description with which He described Himself. The Sufi must uphold this description (الوصف) in that state (الحال) with that category of people (الصنف).\n\nThe matter of Sufism is easy for the one who takes it by this path and does not invent rulings for himself, thereby departing from the scale of the Real (ميزان الحق) in that matter. For whoever does this joins <<الْأَخْسَرِينَ أَعْمَالًا الَّذِينَ ضَلَّ سَعْيُهُمْ فِي الْحَيَاةِ الدُّنْيَا وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا>> (those whose deeds are the greatest losers, those whose effort is lost in the life of this world, while they think that they are doing good work). Indeed, Allah will not establish for them <<يَوْمَ الْقِيَامَةِ وَزْنًا>> (any weight on the Day of Resurrection), just as they did not establish any weight for the Real (الحق) here. Thus, their own attribute returned upon them, and He did not punish them by means of others.\n\n### Indeed, Allah Almighty Did Not Mention an Attribute of Compulsion and Severity in the Quran Except that Beside It Was an Attribute of Gentleness and Softness\n\nReflect upon His saying, the Almighty, in His Book: He never mentioned an attribute of domination and severity (صفة قهر وشدة) except that beside it was an attribute of gentleness and softness (صفة لطف ولين), wherever it may be in the Book of Allah. Furthermore, if He singles out one attribute and does not mention its counterpart beside it, seek it out, and you will find its counterpart also singled out in another place. That singular counterpart is for this singular attribute. The prevailing characteristic, however, is the combination (الجمعية).\n\nThe Almighty said: <<نَبِّئْ عِبَادِي أَنِّي أَنَا الْغَفُورُ الرَّحِيمُ>> (Inform My servants that I am the Forgiving, the Merciful), then He followed it immediately with the counterpart, saying, the Almighty: <<وَأَنَّ عَذَابِي هُوَ الْعَذَابُ الْأَلِيمُ>> (And that My punishment is the painful punishment).\n\nAnd He said: <<إِنَّ رَبَّكَ لَسَرِيعُ الْعِقَابِ>> (Indeed, your Lord is swift in punishment), then He followed it immediately with the counterpart, saying: <<وَإِنَّهُ لَغَفُورٌ رَحِيمٌ>> (And indeed, He is Forgiving, Merciful).\n\nAnd He said: <<وَإِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ لِلنَّاسِ عَلَى ظُلْمِهِمْ>> (And indeed, your Lord is the possessor of forgiveness for mankind despite their wrongdoing), then He followed it immediately, saying: <<وَإِنَّ رَبَّكَ لَشَدِيدُ الْعِقَابِ>> (And indeed, your Lord is severe in penalty). Follow this pattern, and you will find it exactly as we have described it to you.\n\n### Indeed, Allah Did Not Mention in the Quran an Attribute of the People of Felicity Except that Beside It He Mentioned an Attribute of the People of Misery\n\nFurthermore, He never mentioned an attribute (نعت) of the people of felicity (أهل السعادة) except that beside it He mentioned an attribute of the people of misery (أهل الشقاء), either by preceding or following.\n\nThe Almighty said concerning the people of felicity: <<وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ ضَاحِكَةٌ مُسْتَبْشِرَةٌ>> (Faces, that Day, will be bright, laughing, rejoicing), then He coupled it, saying: <<وَوُجُوهٌ يَوْمَئِذٍ عَلَيْهَا غَبَرَةٌ تَرْهَقُهَا قَتَرَةٌ أُولَئِكَ هُمُ الْكَفَرَةُ الْفَجَرَةُ>> (And [other] faces, that Day, will have dust upon them, darkness covering them. Those are the disbelievers, the wicked).\n\nAnd the Almighty said concerning the state of the people of felicity: <<وُجُوهٌ يَوْمَئِذٍ نَاضِرَةٌ إِلَى رَبِّهَا نَاظِرَةٌ>> (Faces, that Day, will be radiant, looking at their Lord), then He coupled it, saying concerning the people of misery: <<وَوُجُوهٌ يَوْمَئِذٍ بَاسِرَةٌ تَظُنُّ أَنْ يُفْعَلَ بِهَا فَاقِرَةٌ>> (And [other] faces, that Day, will be frowning, certain that a back-breaking calamity will be dealt with them). The \"faces\" (الوجوه) here are an expression for the human souls (النفوس الإنسانية), because the face (وجه) of a thing is its reality (حقيقته), its essence (ذاته), and its immutable entity (عينه), not the faces restricted by eyesight, for they are not characterized by assumptions (الظنون). The context of the verse implies that the faces here are the essences (ذوات) of those mentioned.\n\nAnd He said concerning the wretched: <<وُجُوهٌ يَوْمَئِذٍ خَاشِعَةٌ عَامِلَةٌ نَاصِبَةٌ تَصْلَى نَارًا حَامِيَةً>> (Faces, that Day, will be humbled, laboring, weary, entering a scorching fire), then He coupled it with the felicitous, saying: <<وُجُوهٌ يَوْمَئِذٍ نَاعِمَةٌ لِسَعْيِهَا رَاضِيَةٌ فِي جَنَّةٍ عَالِيَةٍ>> (Faces, that Day, will be joyful, satisfied with their effort, in an elevated Garden).\n\nAnd He said concerning the states of the felicitous: <<فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ>> (Then as for he who is given his record in his right hand), mentioning good, then He coupled it, saying: <<وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِشِمَالِهِ>> (But as for he who is given his record in his left hand), mentioning evil.\n\nLikewise, His saying: <<مَنْ كَانَ يُرِيدُ الْعَاجِلَةَ عَجَّلْنَا لَهُ فِيهَا مَا نَشَاءُ لِمَنْ نُرِيدُ ثُمَّ جَعَلْنَا لَهُ جَهَنَّمَ يَصْلَاهَا>> (Whoever desires the immediate [world], We hasten for him therein whatever We will for whomever We intend; then We have appointed for him Hell, which he will burn in), then He coupled it, saying: <<وَمَنْ أَرَادَ الْآخِرَةَ وَسَعَى لَهَا سَعْيَهَا>> (But whoever desires the Hereafter and exerts the effort due to it).\n\nAnd He said concerning Divine Providence (العناية): <<فَأَلْهَمَهَا فُجُورَهَا>> (And inspired it [the soul] with its wickedness), then He coupled it, saying: <<وَتَقْوَاهَا>> (And its righteousness).\n\nAnd He said: <<قَدْ أَفْلَحَ مَنْ زَكَّاهَا>> (He has succeeded who purifies it), then He coupled it: <<وَقَدْ خَابَ مَنْ دَسَّاهَا>> (And he has failed who corrupts it).\n\nAnd He said: <<فَأَمَّا مَنْ أَعْطَى وَاتَّقَى وَصَدَّقَ بِالْحُسْنَى فَسَنُيَسِّرُهُ لِلْيُسْرَى>> (As for he who gives and fears God and believes in the best [reward], We will ease him toward ease), then He coupled it, saying: <<وَأَمَّا مَنْ بَخِلَ وَاسْتَغْنَى وَكَذَّبَ بِالْحُسْنَى فَسَنُيَسِّرُهُ لِلْعُسْرَى>> (But as for he who is stingy and considers himself self-sufficient and denies the best [reward], We will ease him toward difficulty).\n\nThe Sufi (الصوفي) is the one who establishes himself in his soul and in his character (خلقه) according to the establishment of the Real (الحق) in His Book and in His scriptures. <<مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ>> (Whatever good befalls you is from Allah, and whatever evil befalls you is from yourself). I have thus cast you onto the Path.\n\nSufism is nothing more, according to the people [of the Path], than what I have mentioned and clarified for you. However, Allah sent down the Scale (الميزان) and the knowledge of the stations (المواطن) and the states (الأحوال). Therefore, do not remove anything from the requirement of what wisdom (الحكمة) demands.\n\n<<وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِلْمُؤْمِنِينَ>> (And We send down of the Quran that which is a healing and a mercy for the believers). Adopting its ethics (التخلق به) and abiding by its limits necessarily removes spiritual sickness (المرض النفسي), but only for the believers. <<وَلَا يَزِيدُ الظَّالِمِينَ إِلَّا خَسَارًا>> (But it does not increase the wrongdoers except in loss), because they deviate with it from its proper station (موطنه) and <<يُحَرِّفُونَ الْكَلِمَ عَنْ مَوَاضِعِهِ>> (distort the words from their [proper] places). They generalize the specific and specify the general, so they are called wrongdoers (ظالمين) and unjust (قاسطين).\n\nThe wise (الحكماء) are the just ones (المقسطون). Whoever is granted wisdom (الحكمة) <<فَقَدْ أُوتِيَ خَيْرًا كَثِيرًا>> (has certainly been given much good). What Allah describes as \"much\" (كثرة), scarcity cannot enter it. The reason for describing it as \"much\" is that wisdom permeates all existing things (الموجودات), because existing things are the placement of God.\n\nThen He created the human being and entrusted him with the Trust (الأمانة) by granting him the ability to observe existing things and manage them with trustworthiness, so that he may render to every possessor of a right his due right, just as Allah <<أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ>> (gave every thing its creation). He made the human being a vicegerent (خليفة) on Earth, unlike other creatures. He is a trustee (أمين) over Allah’s creation, so he must not deviate from Allah’s way (سنة الله) concerning them. Existing things are a trust (أمانة) in the hands of the human being, offered to him, and he bore it. If he fulfills it, he is the Sufi (الصوفي). If he does not fulfill it, he is the wrongdoer and the ignorant (الظلوم الجهول).\n\nWisdom (الحكمة) contradicts ignorance (الجهل) and wrongdoing (الظلم). Adopting the ethics of God (التخلق بأخلاق الله) is Sufism. Scholars have clarified the adoption of the Beautiful Names of Allah (أسماء الله الحسنى) and explained their stations and how they are attributed to creation, and they are countless in number. The best way to apply them is specifically with God. Whoever understands this and applies them with God will encompass the knowledge of applying them with all existing things (الموجودات). That person is the protected one (المعصوم) who never errs, and the preserved one (المحفوظ) from moving or resting in vain. May Allah make us among the Sufis who uphold the rights of God and prioritize the Divine Presence (جناب الله).",
    "ur": "ایک سو چونسٹھواں باب: مقامِ تصوف کی معرفت میں\n\nجان لو کہ تصوف ہمارے خالق سے مشابہت اختیار کرنا ہے،\nکیونکہ اس نے خلق کیا، پس دیکھو تو تمہیں عجب نظر آئے گا۔\nاس کے خلق میں اور اس کی پوشیدہ تدبیر میں کیسا تخلق (اخلاق اپنانا) ہے،\nاور اسی قدر سے وہ پردہ میں رہا۔\nاور اس نے مخلوق کی صفات میں اس کی مذمت کی، پس تم اس میں غور کرو،\nکیونکہ یہ عقل کے لیے ایک مثال بیان کی گئی ہے۔\nجب لوہا صنعت میں داخل ہوتا ہے،\nتو وہ اسے غیر منزلہ میں سونا بنا دیتا ہے۔\nاسی طرح مذموم خلق بھی محمود ہو جاتا ہے،\nجب اسے رحمن کی طرف منسوب کیا جائے۔\nبے شک تصوف پاکیزہ اخلاق ہیں،\nجو اللہ کے ساتھ ہوں، پس تم اس کے برابر کسی نسب کو نہ ٹھہراؤ۔\n\n### [رسول اللہ صلی اللہ علیہ وسلم کا خلق]\n\nاہل طریقِ ذات حق (الحق) نے فرمایا کہ تصوف خلق ہے، پس جو تم سے خلق میں بڑھ گیا، وہ تم سے تصوف میں بڑھ گیا۔\n\nاور ام المؤمنین عائشہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کے خلق کے بارے میں پوچھا گیا تو انہوں نے فرمایا: \"آپ کا خلق قرآن تھا۔\"\n\nاور بے شک اللہ تعالیٰ نے آپ کی اس چیز پر تعریف فرمائی جو آپ کو عطا کی، پس فرمایا: \"اور بے شک آپ عظیم اخلاق پر ہیں۔\" (وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِيمٍ)\n\n### [صوفی کہلانے والے کی شرط یہ ہے کہ وہ حکیم ہو]\n\nاور صوفی کہلانے والے کی شرط یہ ہے کہ وہ حکیم (حکمت والا) ہو، اور اگر وہ حکیم نہ ہو تو اس لقب میں اس کا کوئی حصہ نہیں، کیونکہ تصوف سراسر حکمت ہے۔ یہ اخلاق ہیں اور انہیں کامل معرفت (المعرفۃ)، راجح عقل، اور نفس پر قوی تمکن (قابو) کی ضرورت ہوتی ہے تاکہ نفسانی اغراض (الأغراض النفسية) اس پر حکم نہ چلائیں۔ اور اس مقام کے حامل کو چاہیے کہ وہ قرآن کو اپنے سامنے رکھے، پس وہ دیکھے کہ ذات حق (الحق) نے اپنے آپ کو کس چیز سے موصوف کیا ہے، اور کس حالت میں اپنے آپ کو اس چیز سے موصوف کیا جس سے موصوف کیا، اور کس کے ساتھ اس وصف کو صرف کیا جس سے اپنے آپ کو موصوف کیا، پس صوفی کو چاہیے کہ وہ اس وصف کے ساتھ، اس حال کے ساتھ، اس صنف کے ساتھ قائم ہو۔\n\nپس تصوف کا معاملہ اس شخص کے لیے آسان ہے جو اسے اس طریقے سے اختیار کرے اور اپنے لیے احکام نہ نکالے اور اس میں میزانِ حق (الحق) سے باہر نہ نکلے۔ کیونکہ جو شخص ایسا کرے گا وہ ان لوگوں میں شامل ہو جائے گا جو \"اعمال میں سب سے زیادہ خسارہ پانے والے ہیں، جن کی کوشش دنیا کی زندگی میں گم ہو گئی اور وہ سمجھتے رہے کہ وہ اچھا کام کر رہے ہیں۔\" (الْأَخْسَرِينَ أَعْمَالًا الَّذِينَ ضَلَّ سَعْيُهُمْ فِي الْحَيَاةِ الدُّنْيَا وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا) پس اللہ تعالیٰ قیامت کے دن ان کے لیے کوئی وزن (وَزْنًا) قائم نہیں کرے گا، جیسا کہ انہوں نے یہاں ذات حق (الحق) کے لیے کوئی وزن قائم نہیں کیا، پس ان کی صفت ان پر لوٹ آئی، اور اللہ نے انہیں کسی اور کے ذریعے عذاب نہیں دیا۔\n\n### [بے شک اللہ تعالیٰ نے قرآن میں قہر اور شدت کی کوئی صفت ذکر نہیں کی مگر اس کے پہلو میں لطف اور نرمی کی صفت بھی ذکر کی]\n\nپس تم اللہ تعالیٰ کے کلام میں غور کرو، کیونکہ اس نے قہر اور شدت کی کوئی صفت ذکر نہیں کی مگر اس کے پہلو میں لطف اور نرمی کی صفت بھی ذکر کی، جہاں کہیں بھی اللہ کی کتاب میں ہو۔ پھر اگر اس نے ان میں سے کسی ایک صفت کو اکیلا ذکر کیا اور اس کے پہلو میں اس کے مقابل کو ذکر نہ کیا تو تم اسے تلاش کرو، تمہیں اس کا مقابل بھی کسی دوسرے مقام پر اکیلا ہی ملے گا۔ پس وہ اکیلا مقابل اس اکیلے مقابل کے لیے ہے، اور غالب صورت جمع کی ہے۔\n\nاللہ تعالیٰ نے فرمایا: \"میرے بندوں کو خبر دو کہ بے شک میں ہی بہت بخشنے والا، نہایت رحم کرنے والا ہوں۔\" (نَبِّئْ عِبَادِي أَنِّي أَنَا الْغَفُورُ الرَّحِيمُ) پھر اس کے مقابل کو ساتھ ملایا، پس اللہ تعالیٰ نے فرمایا: \"اور یہ کہ میرا عذاب ہی دردناک عذاب ہے۔\" (وَأَنَّ عَذَابِي هُوَ الْعَذَابُ الْأَلِيمُ) اور فرمایا: \"بے شک تمہارا رب جلد سزا دینے والا ہے۔\" (إِنَّ رَبَّكَ لَسَرِيعُ الْعِقَابِ) پھر اس کے مقابل کو ساتھ ملایا، پس فرمایا: \"اور بے شک وہ بہت بخشنے والا، نہایت رحم کرنے والا ہے۔\" (وَإِنَّهُ لَغَفُورٌ رَحِيمٌ) اور فرمایا: \"اور بے شک تمہارا رب لوگوں کے ظلم کے باوجود مغفرت والا ہے۔\" (وَإِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ لِلنَّاسِ عَلَىٰ ظُلْمِهِمْ) پھر ساتھ ملایا، پس فرمایا: \"اور بے شک تمہارا رب سخت سزا دینے والا ہے۔\" (وَإِنَّ رَبَّكَ لَشَدِيدُ الْعِقَابِ) اور تم اس کی پیروی کرو، تو تمہیں یہ ویسا ہی ملے گا جیسا ہم نے تمہارے لیے ذکر کیا۔\n\n### [بے شک اللہ نے قرآن میں اہل سعادت کی کوئی صفت ذکر نہیں کی مگر اس کے پہلو میں اہل شقاوت کی صفت بھی ذکر کی]\n\nپھر یہ کہ اس نے اہل سعادت کی کوئی صفت ذکر نہیں کی مگر اس کے پہلو میں اہل شقاوت کی صفت بھی ذکر کی، خواہ تقدیم کے ساتھ ہو یا تاخیر کے ساتھ۔ اللہ تعالیٰ نے اہل سعادت کے بارے میں فرمایا: \"کئی چہرے اس دن روشن ہوں گے، ہنستے ہوئے، خوشخبری پانے والے ہوں گے۔\" (وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ ضَاحِكَةٌ مُسْتَبْشِرَةٌ) پھر عطف کیا اور فرمایا: \"اور کئی چہروں پر اس دن گرد و غبار ہو گا، انہیں سیاہی ڈھانپ رہی ہو گی۔ یہی وہ کافر اور فاجر لوگ ہیں۔\" (وَوُجُوهٌ يَوْمَئِذٍ عَلَيْهَا غَبَرَةٌ تَرْهَقُهَا قَتَرَةٌ أُولَئِكَ هُمُ الْكَفَرَةُ الْفَجَرَةُ)\n\nاور اللہ تعالیٰ نے اہل سعادت کے حال میں فرمایا: \"کئی چہرے اس دن تروتازہ ہوں گے، اپنے رب کی طرف دیکھنے والے ہوں گے۔\" (وُجُوهٌ يَوْمَئِذٍ نَاضِرَةٌ إِلَىٰ رَبِّهَا نَاظِرَةٌ) پھر عطف کیا اور اہل شقاوت کے بارے میں فرمایا: \"اور کئی چہرے اس دن بگڑے ہوئے ہوں گے، وہ گمان کریں گے کہ ان کے ساتھ کمر توڑ دینے والا معاملہ کیا جائے گا۔\" (وَوُجُوهٌ يَوْمَئِذٍ بَاسِرَةٌ تَظُنُّ أَنْ يُفْعَلَ بِهَا فَاقِرَةٌ) اور یہاں \"وجوہ\" (چہرے) سے مراد انسانی نفوس ہیں، کیونکہ کسی شے کا چہرہ اس کی حقیقت، اس کی ذات اور اس کا عین ہوتا ہے، نہ کہ وہ چہرے جو آنکھوں سے مقید ہیں۔ کیونکہ وہ ظن (گمان) سے متصف نہیں ہوتے، اور آیت کا سیاق یہ بتاتا ہے کہ یہاں وجوہ سے مراد مذکورہ لوگوں کی ذوات ہیں۔\n\nاور اشقیاء کے بارے میں فرمایا: \"کئی چہرے اس دن جھکے ہوئے ہوں گے، محنت کرنے والے، تھک جانے والے ہوں گے، جو دہکتی ہوئی آگ میں داخل ہوں گے۔\" (وُجُوهٌ يَوْمَئِذٍ خَاشِعَةٌ عَامِلَةٌ نَاصِبَةٌ تَصْلَىٰ نَارًا حَامِيَةً) پھر سعداء (خوش بختوں) کے ساتھ عطف کیا، پس فرمایا: \"کئی چہرے اس دن نعمتوں والے ہوں گے، اپنی کوشش پر راضی ہوں گے، بلند جنت میں۔\" (وُجُوهٌ يَوْمَئِذٍ نَاعِمَةٌ لِسَعْيِهَا رَاضِيَةٌ فِي جَنَّةٍ عَالِيَةٍ)\n\nاور سعداء کے احوال میں فرمایا: \"پس جس کو اس کا نامہ اعمال اس کے دائیں ہاتھ میں دیا گیا\" (فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ) تو خیر کا ذکر کیا، پھر عطف کیا اور فرمایا: \"اور جس کو اس کا نامہ اعمال اس کے بائیں ہاتھ میں دیا گیا\" (وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِشِمَالِهِ) تو شر کا ذکر کیا۔ اور اسی طرح اس کا قول: \"جو کوئی جلدی والی (دنیا) چاہتا ہے، ہم اسے اس میں سے جو چاہتے ہیں، جس کے لیے چاہتے ہیں، جلدی دے دیتے ہیں، پھر ہم اس کے لیے جہنم مقرر کر دیتے ہیں، جس میں وہ داخل ہو گا۔\" (مَنْ كَانَ يُرِيدُ الْعَاجِلَةَ عَجَّلْنَا لَهُ فِيهَا مَا نَشَاءُ لِمَنْ نُرِيدُ ثُمَّ جَعَلْنَا لَهُ جَهَنَّمَ يَصْلَاهَا) پھر عطف کیا اور فرمایا: \"اور جو آخرت کا ارادہ کرے اور اس کے لیے ویسی کوشش کرے جیسی اس کی کوشش کا حق ہے۔\" (وَمَنْ أَرَادَ الْآخِرَةَ وَسَعَىٰ لَهَا سَعْيَهَا)\n\nاور عنایت کے بارے میں فرمایا: \"پس اسے اس کی بدکاری\" (فَأَلْهَمَهَا فُجُورَهَا) پھر عطف کیا اور فرمایا: \"اور اس کی پرہیزگاری سکھا دی۔\" (وَتَقْوَاهَا) اور فرمایا: \"بے شک وہ کامیاب ہوا جس نے اسے پاک کیا۔\" (قَدْ أَفْلَحَ مَنْ زَكَّاهَا) پھر عطف کیا: \"اور وہ ناکام ہوا جس نے اسے دبا دیا۔\" (وَقَدْ خَابَ مَنْ دَسَّاهَا) اور فرمایا: \"پس جس نے دیا اور پرہیزگاری اختیار کی، اور اچھی بات کی تصدیق کی، تو ہم اسے آسانی کے لیے سہولت دیں گے۔\" (فَأَمَّا مَنْ أَعْطَىٰ وَاتَّقَىٰ وَصَدَّقَ بِالْحُسْنَىٰ فَسَنُيَسِّرُهُ لِلْيُسْرَىٰ) پھر عطف کیا اور فرمایا: \"اور جس نے بخل کیا اور بے پرواہی برتی، اور اچھی بات کو جھٹلایا، تو ہم اسے تنگی کے لیے سہولت دیں گے۔\" (وَأَمَّا مَنْ بَخِلَ وَاسْتَغْنَىٰ وَكَذَّبَ بِالْحُسْنَىٰ فَسَنُيَسِّرُهُ لِلْعُسْرَىٰ)\n\nپس صوفی وہ ہے جو اپنے نفس میں اور اپنے خلق میں اس طرح قائم ہو جس طرح ذات حق (الحق) اپنی کتاب میں اور اپنی کتابوں میں قائم ہے۔ پس \"جو بھلائی تمہیں پہنچتی ہے وہ اللہ کی طرف سے ہے، اور جو برائی تمہیں پہنچتی ہے وہ تمہارے نفس کی طرف سے ہے۔\" (مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ) پس تمہیں راستے پر ڈال دیا گیا ہے۔ اور قوم (صوفیاء) کے نزدیک تصوف اس کے علاوہ کوئی زائد چیز نہیں ہے جو میں نے تمہارے لیے ذکر کیا اور بیان کیا۔ لیکن اللہ نے میزان (توازن) اور مقامات و احوال کا علم نازل کیا ہے، پس تم کسی چیز کو اس تقاضے سے باہر نہ نکالو جو حکمت (الحکمۃ) طلب کرتی ہے۔\n\n\"اور ہم قرآن میں سے وہ چیز نازل کرتے ہیں جو مومنوں کے لیے شفا اور رحمت ہے۔\" (وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِلْمُؤْمِنِينَ) پس اس کے ساتھ تخلق (اخلاق اپنانا) اور اس پر قائم رہنا نفسانی بیماری کو دور کرتا ہے، یہ ضروری ہے، لیکن صرف مومنوں کے لیے۔ اور \"یہ ظالموں کے لیے خسارے کے سوا کچھ نہیں بڑھاتا\" (وَلَا يَزِيدُ الظَّالِمِينَ إِلَّا خَسَارًا) کیونکہ وہ اسے اس کے مقام سے ہٹا دیتے ہیں اور \"کلمات کو ان کے مقامات سے پھیر دیتے ہیں\" (يُحَرِّفُونَ الْكَلِمَ عَنْ مَوَاضِعِهِ)، پس وہ خاص کو عام کر دیتے ہیں اور عام کو خاص کر دیتے ہیں۔ اسی لیے وہ ظالم اور قاسطین (ناانصافی کرنے والے) کہلائے، جبکہ حکماء (حکمت والے) ہی انصاف کرنے والے (المقسطون) ہیں۔\n\nاور جسے حکمت (الحکمۃ) دی گئی، \"تو اسے بہت زیادہ بھلائی دی گئی۔\" (فَقَدْ أُوتِيَ خَيْرًا كَثِيرًا) اور جس چیز کو اللہ نے کثرت سے موصوف کیا، تو قلت اس میں داخل نہیں ہو سکتی۔ اور اسے کثرت سے موصوف کرنے کی وجہ یہ ہے کہ حکمت (الحکمۃ) تمام موجودات (الوجود) میں جاری و ساری ہے، کیونکہ موجودات اللہ کا وضع کردہ ہیں۔ پھر اس نے انسان کو پیدا کیا اور اسے امانت کا بوجھ دیا، اس طرح کہ اس کے لیے موجودات میں نظر کرنا اور امانت کے ساتھ ان میں تصرف کرنا مقرر کیا تاکہ وہ ہر حقدار کو اس کا حق ادا کرے، جیسا کہ اللہ نے \"ہر چیز کو اس کی خلقت عطا کی۔\" (أَعْطَىٰ كُلَّ شَيْءٍ خَلْقَهُ) پس اس نے انسان کو زمین میں خلیفہ بنایا، مخلوقات میں سے کسی اور کو نہیں۔ پس وہ اللہ کی مخلوق پر امین ہے، لہٰذا وہ انہیں اللہ کی سنت سے نہ ہٹائے۔ پس موجودات انسان کے ہاتھ میں امانت ہیں جو اس پر پیش کی گئیں، اور اس نے انہیں اٹھا لیا۔ پس اگر وہ اسے ادا کرے تو وہ صوفی ہے، اور اگر ادا نہ کرے تو وہ ظلوم (بڑا ظالم) اور جہول (بڑا جاہل) ہے۔ اور حکمت (الحکمۃ) جہل اور ظلم کی ضد ہے۔ پس اللہ کے اخلاق سے تخلق (اخلاق اپنانا) ہی تصوف ہے۔ اور علماء نے اللہ کے اسماء حسنیٰ سے تخلق کو بیان کیا ہے اور ان کے مقامات کو بیان کیا ہے، اور یہ بھی کہ وہ کس طرح مخلوق کی طرف منسوب ہوتے ہیں، اور ان کی کثرت کا احاطہ نہیں کیا جا سکتا۔ اور سب سے بہتر یہ ہے کہ ان میں صرف اللہ کے ساتھ تصرف کیا جائے، پس جو شخص اس پر متوجہ ہوا اور ان کا تصرف صرف اللہ کے ساتھ کیا، تو اس نے موجودات کے ساتھ ان کے تصرف کا علم حاصل کر لیا۔ پس وہی معصوم ہے جو کبھی خطا نہیں کرتا، اور وہ محفوظ ہے اس سے کہ وہ بے فائدہ حرکت کرے یا ساکن ہو۔ اللہ ہمیں ان صوفیاء میں سے بنائے جو اللہ کے حقوق کے ساتھ قائم ہیں اور اللہ کی جناب کو ترجیح دینے والے ہیں۔",
    "fa": "باب صد و شصت و چهارم در معرفت مقام تصوف (التصوف)\n\nپس بدان که تصوف (التصوف) تشبه به خالق ماست،\n**(فاعلم إن التصوف تشبيه بخالقنا *** لأنه خلق فانظر ترى عجبا)**\nزیرا او خلق کرد، پس بنگر تا شگفتی ببینی.\nچگونه تخلق و مکر پنهان برای اوست\n**(كيف التخلق والمكر الخفي له *** في خلقه وبهذا القدر قد حجبا)**\nدر خلقش، و به همین اندازه محجوب گشته است.\nو او (حق) آن را در صفات خلق نکوهش کرد، پس در آن تأمل کنید،\n**(وذمه في صفات الخلق فاعتبروا *** فيه فذا مثل للعقل قد ضربا)**\nزیرا این مثلی است که برای عقل زده شده است.\nاگر صنعت (کیمیاگری) وارد آهن شود،\n**(إن الحديد إذا ما الصنع يدخله *** في غير منزلة يرده ذهبا)**\nآن را در غیر جایگاهش به طلا تبدیل می‌کند.\nهمچنین، خُلق نکوهیده باز می‌گردد\n**(كذلك الخلق المذموم يرجع *** محمودا إذا هو للرحمن قد نسبا)**\nبه ستایش، اگر به رحمان نسبت داده شود.\nهمانا توصیف شدن (به این صفات) اخلاق پاکیزه‌ای است\n**(أن التوصف أخلاق مطهرة *** مع الإله فلا تعدل به نسبا)**\nهمراه با خداوند، پس هیچ نسبی را با آن برابر مکن.\n\n### [خُلق رسول الله (ص)]\n\nاهل طریق الله گفتند: تصوف (التصوف) خُلق است؛ پس هر کس در خُلق بر تو فزونی یابد، در تصوف بر تو فزونی یافته است.\n\nو از عایشه، ام‌المؤمنین، درباره خُلق رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) پرسیده شد، پس گفت: خُلق او قرآن بود.\n\nو خداوند او را به سبب آنچه از آن (خُلق) به او عطا کرده بود، ستود و فرمود: «و همانا تو بر خُلق عظیمی هستی.» (وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ)\n\n### [از شرط‌های کسی که به تصوف وصف می‌شود این است که حکیم باشد]\n\nو از شروط کسی که به تصوف (التصوف) وصف می‌شود این است که حکیم و صاحب حکمت باشد، و اگر چنین نباشد، بهره‌ای در این لقب ندارد؛ زیرا تصوف تماماً حکمت است. تصوف اخلاق است و اخلاق نیازمند معرفت (المعرفة) کامل، عقل برتر، حضور و تسلط قوی بر نفس خویش است تا اغراض نفسانی بر او حکم نرانند.\n\nو صاحب این مقام باید قرآن را پیش روی خود قرار دهد و بنگرد که حق (الحق) خویشتن را به چه وصف کرده است، و در چه حالی خویشتن را به آن وصف نموده، و با چه کسی آن وصفی را که خویشتن را بدان وصف کرده، به کار برده است. پس صوفی باید با آن وصف، در آن حال، و با آن صنف (از مردم) قیام کند.\n\nپس امر تصوف (التصوف) برای کسی که آن را از این طریق بگیرد، امری آسان است، و نباید برای خود احکامی استنباط کند و از میزان حق (الحق) در این باره خارج شود. زیرا هر کس چنین کند، به «آنان که در کارها زیانکارترین‌اند، کسانی که تلاششان در زندگی دنیا به هدر رفته، در حالی که می‌پندارند کار نیکو انجام می‌دهند» (الْأَخْسَرِينَ أَعْمالًا الَّذِينَ ضَلَّ سَعْيُهُمْ فِي الْحَياةِ الدُّنْيا وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعاً) ملحق می‌شود. همانا خداوند در روز قیامت برای او وزنی (اعتباری) قائل نمی‌شود (لَا نُقِيمُ لَهُمْ يَوْمَ الْقِيامَةِ وَزْناً)، همان‌گونه که آنان در اینجا برای حق (الحق) وزنی قائل نشدند. پس صفت خودشان به خودشان بازگشت و خداوند آنان را به غیر خودشان عذاب نکرد.\n\n### [خداوند متعال در قرآن هیچ صفت قهر و شدتی را ذکر نکرده مگر آنکه در کنارش صفت لطف و نرمی باشد]\n\nپس در کلام خدای تعالی در کتابش تأمل کن؛ زیرا او هیچ صفت قهر و شدتی را ذکر نکرده مگر آنکه در کنارش صفت لطف و نرمی آمده است، در هر جای کتاب خدا که باشد. سپس اگر صفتی را به تنهایی ذکر کرد و در کنارش مقابل آن را نیاورد، آن را جستجو کن؛ مقابلش را در موضعی دیگر نیز به تنهایی خواهی یافت. پس آن صفت مفرد مقابل، برای این صفت مفرد مقابل است، و غلبه با جامعیت است. خدای تعالی فرمود: «بندگانم را آگاه کن که منم آمرزنده مهربان.» (نَبِّئْ عِبادِي أَنِّي أَنَا الْغَفُورُ الرَّحِيمُ) سپس با مقابل آن پیگیری کرد و فرمود: «و اینکه عذاب من همان عذاب دردناک است.» (وَأَنَّ عَذابِي هُوَ الْعَذابُ الْأَلِيمُ) و فرمود: «همانا پروردگار تو زود کیفر است.» (إِنَّ رَبَّكَ لَسَرِيعُ الْعِقابِ) سپس با مقابل آن پیگیری کرد و فرمود: «و همانا او آمرزنده مهربان است.» (وَإِنَّهُ لَغَفُورٌ رَحِيمٌ) و فرمود: «و همانا پروردگار تو نسبت به مردم، با وجود ستمشان، صاحب مغفرت است.» (وَإِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ لِلنَّاسِ عَلَى ظُلْمِهِمْ) سپس پیگیری کرد و فرمود: «و همانا پروردگار تو سخت کیفر است.» (وَإِنَّ رَبَّكَ لَشَدِيدُ الْعِقابِ) و این را دنبال کن، آن را همان‌گونه که برایت ذکر کردیم خواهی یافت.\n\n### [خداوند در قرآن هیچ نعتی از نعت‌های اهل سعادت را ذکر نکرده مگر آنکه در کنارش نعتی از نعت‌های اهل شقاوت را آورده است]\n\nسپس او هیچ نعت (وصفی) از نعت‌های اهل سعادت را ذکر نکرده مگر آنکه در کنارش نعتی از نعت‌های اهل شقاوت را آورده است، چه با تقدیم و چه با تأخیر. خدای تعالی در مورد اهل سعادت فرمود: «در آن روز چهره‌هایی درخشان، خندان و شادمان‌اند.» (وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ ضاحِكَةٌ مُسْتَبْشِرَةٌ) سپس عطف کرد و فرمود: «و در آن روز چهره‌هایی است که بر آن‌ها غبار نشسته، تیرگی آن‌ها را پوشانده است. آنان همان کافران فاجرند.» (وَوُجُوهٌ يَوْمَئِذٍ عَلَيْها غَبَرَةٌ تَرْهَقُها قَتَرَةٌ أُولئِكَ هُمُ الْكَفَرَةُ الْفَجَرَةُ)\n\nو خدای تعالی در حال اهل سعادت فرمود: «در آن روز چهره‌هایی شاداب‌اند، که به پروردگارشان می‌نگرند.» (وُجُوهٌ يَوْمَئِذٍ ناضِرَةٌ إِلَى رَبِّها ناظِرَةٌ) سپس عطف کرد و در مورد اهل شقاوت فرمود: «و چهره‌هایی در آن روز ترشرو و عبوس‌اند، که می‌دانند بلایی کمرشکن بر آن‌ها فرود می‌آید.» (وَوُجُوهٌ يَوْمَئِذٍ باسِرَةٌ تَظُنُّ أَنْ يُفْعَلَ بِها فاقِرَةٌ) و «وجوه» (چهره‌ها) در اینجا عبارت از نفوس انسانی است، زیرا وجه هر شیء، حقیقت (الحقیقة)، ذات و عین آن است، نه چهره‌هایی که مقید به چشم‌ها هستند؛ چرا که آن‌ها به ظنون (گمان‌ها) متصف نمی‌شوند، و سیاق آیه نشان می‌دهد که وجوه در اینجا همان ذوات (هویت‌های) مذکورین است.\n\nو در مورد اشقیا فرمود: «در آن روز چهره‌هایی خاشع، کوشنده و رنج‌برنده‌اند، که در آتشی سوزان درآیند.» (وُجُوهٌ يَوْمَئِذٍ خاشِعَةٌ عامِلَةٌ ناصِبَةٌ تَصْلى‏ ناراً حامِيَةً) سپس با سعدا عطف کرد و فرمود: «در آن روز چهره‌هایی شاداب و متنعم‌اند، که از تلاش خود راضی‌اند، در بهشتی برین.» (وَوُجُوهٌ يَوْمَئِذٍ ناعِمَةٌ لِسَعْيِها راضِيَةٌ فِي جَنَّةٍ عالِيَةٍ)\n\nو در احوال سعدا فرمود: «اما کسی که نامه‌اش به دست راستش داده شود» (فَأَمَّا مَنْ أُوتِيَ كِتابَهُ بِيَمِينِهِ)، پس خیری را ذکر کرد، سپس عطف کرد و فرمود: «و اما کسی که نامه‌اش به دست چپش داده شود» (وَأَمَّا مَنْ أُوتِيَ كِتابَهُ بِشِمالِهِ)، پس شری را ذکر کرد. و همچنین قول او: «هر کس زندگی زودگذر (دنیا) را بخواهد، آنچه را بخواهیم و برای هر کس بخواهیم، در آن برایش شتابان فراهم می‌کنیم، سپس جهنم را برای او قرار می‌دهیم که در آن بسوزد.» (مَنْ كانَ يُرِيدُ الْعاجِلَةَ عَجَّلْنا لَهُ فِيها ما نَشاءُ لِمَنْ نُرِيدُ ثُمَّ جَعَلْنا لَهُ جَهَنَّمَ يَصْلاها) سپس عطف کرد و فرمود: «و هر کس آخرت را بخواهد و برای آن تلاش کند، تلاشی که شایسته آن است.» (وَمَنْ أَرادَ الْآخِرَةَ وَسَعى‏ لَها سَعْيَها) و در مورد عنایت فرمود: «پس فجور (بدی) و تقوای آن را به او الهام کرد.» (فَأَلْهَمَها فُجُورَها وَتَقْواها) و فرمود: «به تحقیق رستگار شد کسی که آن را تزکیه کرد.» (قَدْ أَفْلَحَ مَنْ زَكَّاها) سپس عطف کرد: «و به تحقیق زیانکار شد کسی که آن را فرو پوشاند.» (وَقَدْ خابَ مَنْ دَسَّاها) و فرمود: «اما کسی که بخشید و پرهیزگاری کرد و نیکویی را تصدیق نمود، پس او را برای آسانی آماده می‌کنیم.» (فَأَمَّا مَنْ أَعْطى‏ وَاتَّقى‏ وَصَدَّقَ بِالْحُسْنى‏ فَسَنُيَسِّرُهُ لِلْيُسْرى‏) سپس عطف کرد و فرمود: «و اما کسی که بخل ورزید و بی‌نیازی جست و نیکویی را تکذیب کرد، پس او را برای دشواری آماده می‌کنیم.» (وَأَمَّا مَنْ بَخِلَ وَاسْتَغْنى‏ وَكَذَّبَ بِالْحُسْنى‏ فَسَنُيَسِّرُهُ لِلْعُسْرى‏)\n\nپس صوفی کسی است که در نفس خود و در خُلق خود، همانند قیام حق (الحق) در کتابش و در کتبش، قیام کند. «هر نیکی که به تو رسد، از جانب خداست؛ و هر بدی که به تو رسد، از جانب خود توست.» (مَا أَصابَكَ مِنْ حَسَنَةٍ فَمِنَ اللهِ وَمَا أَصابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ) بدین ترتیب تو را بر سر راه انداختم.\n\nو تصوف (التصوف) نزد این قوم چیزی افزون بر آنچه برایت ذکر و بیان کردم نیست. اما خداوند میزان و علم به مواطن و احوال را نازل کرده است، پس هیچ چیز را از مقتضای آنچه حکمت می‌طلبد، خارج مکن. «و ما از قرآن آنچه را که شفا و رحمت برای مؤمنان است، نازل می‌کنیم.» (وَنُنَزِّلُ مِنَ الْقُرْآنِ ما هُوَ شِفاءٌ وَرَحْمَةٌ لِلْمُؤْمِنِينَ) پس تخلق به آن و توقف در حدود آن، بیماری نفسانی را از بین می‌برد، و این امر ضروری است، اما فقط برای مؤمنان. «و ستمکاران را جز زیان نمی‌افزاید.» (وَلَا يَزِيدُ الظَّالِمِينَ إِلَّا خَساراً) زیرا آنان آن را از جایگاهش منحرف می‌سازند و «کلمات را از مواضع خود تحریف می‌کنند» (يُحَرِّفُونَ الْكَلِمَ عَنْ مَواضِعِهِ)؛ خاص را تعمیم می‌دهند و عام را تخصیص می‌زنند. از این رو ظالم و ستمگر (قاسطین) نامیده شدند، در حالی که حکما همان دادگران (مقسطون) هستند.\n\nو کسی که به او حکمت داده شود، «به تحقیق خیر کثیری به او داده شده است.» (فَقَدْ أُوتِيَ خَيْراً كَثِيراً) و آنچه خداوند آن را به کثرت وصف کرده، قطعاً قلت در آن راه ندارد. و سبب وصف آن به کثرت این است که حکمت در موجودات (الموجودات) جاری است، زیرا موجودات وضع (قرارگاه) خداوند هستند. سپس انسان را آفرید و امانت را بر دوش او نهاد، به این صورت که به او اجازه داد در موجودات نظر کند و با امانت در آن‌ها تصرف نماید تا حق هر صاحب حقی را ادا کند، همان‌گونه که خداوند «به هر چیزی خلقتش را عطا کرد.» (أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ)\n\nپس انسان را خلیفه در زمین قرار داد، نه دیگر مخلوقات را. او امین بر خلق خداست، پس نباید آن‌ها را از سنت خدا منحرف سازد. موجودات در دست انسان امانتی است که بر او عرضه شد و او آن را حمل کرد. اگر آن را ادا کند، صوفی است، و اگر ادا نکند، ستمکار نادان (الظلوم الجهول) است. و حکمت با جهل و ظلم در تناقض است. پس تخلق به اخلاق الله همان تصوف (التصوف) است. و علما تخلق به اسماء الله الحسنی را بیان کرده‌اند و مواضع آن‌ها و چگونگی نسبت دادن آن‌ها به خلق را روشن ساخته‌اند، که کثرت آن‌ها قابل شمارش نیست. و بهترین تصرف در آن، با خداوند به طور خاص است. پس هر کس متوجه شود و آن را با خداوند به کار برد، علم به تصرف آن با موجودات (الموجودات) را احاطه می‌کند. او همان معصومی است که هرگز خطا نمی‌کند و از اینکه بیهوده حرکت یا سکون کند، محفوظ است. خداوند ما را از صوفیانی قرار دهد که به حقوق خدا قیام می‌کنند و جناب خدا را برمی‌گزینند."
  },
  "page_count": 2
}