{
  "id": 256,
  "title": {
    "ar": "الباب السادس والخمسون ومائتان في معرفة الإبدار وأسراره",
    "en": "Chapter Two Hundred and Fifty-Six: Concerning the Gnosis of the Full Manifestation (الإبدار) and its Mysteries.",
    "ur": "باب دو سو چھپن: ابدار (الإبدار) اور اس کے اسرار کی معرفت میں۔",
    "fa": "باب دویست و پنجاه و ششم در معرفت ابدار (الإبدار) و اسرار آن"
  },
  "content": {
    "ar": "## «الباب السادس والخمسون ومائتان في معرفة الإبدار وأسراره»\n\n\n> بدر الرجوع إلى بدر السلوك عمى *** فانظر بهل وبلم وثم كيف وما\n\n\n> فإن تعالى وجود عن مطالبها *** لا فرق بين استوى فيه وبين عما\n\n\n> من لا يؤثر في توحيده نسب *** ذاك الذي حار في توحيده القدماء\n\n\n> وما رأينا لعقل في تقلبه *** في حضرة الذات في توحيده قدما\n\n\n### [الابدار الذي نصبه الله مثالا في العالم فهو الخليفة الإلهي‏]\n\n\nاعلم أنه لا يقال في مذكور هل هو موجود أم لا حتى يكون خفي الوجود ومن كان وجوده ظاهرا لكل عين فإنه يرتفع عنه طلب هل فإنه استفهام والاستفهام لا يكون إلا عن جهالة بحال ما استفهم عنه وكذلك لا يقال لم إلا في معلول‏\nولا يقال ما إلا في محدود ولا يقال كيف إلا في قابل للأحوال والحق منزه عن هذه الأمور المعقولة من هذه المطالب فهو منزه الذات عن هذه المطالب بل لا يجوز عليه لا في حق من يرى أن الوجود هو الله ولا في حق من لا يراه فإن الذي يرى أن الوجود هو الله فيرى أن حكم ما ظهر به الحق إنما هو أحكام أعيان الممكنات فما وقعت هذه المطالب إلا على مستحقها فإنه ما طلبت عين الحق إلا من حيث ظهورها بحكم عين الممكن فعين الممكن هو المطلوب والتبس على الطالب وأما من لا يرى أن عين الوجود هو الحق فلا تجوز عليه المطالب ثم نرجع فنقول أما الإبدار الذي نصبه الله مثالا في العالم لتجليه بالحكم فيه فهو الخليفة الإلهي الذي ظهر في العالم بأسماء الله وأحكامه والرحمة والقهر والانتقام والعفو كما ظهر الشمس في ذات القمر فأناره كله فسمي بدرا فرأى الشمس نفسه في مرآة ذات البدر فكساه نورا سماه به بدرا كما رأى الحق في ذات من استخلفه فهو يحكم بحكم الله في العالم والحق يشهده شهود من يفيده نور العلم قال تعالى إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً وعلمه جميع الأسماء واسجد له الملائكة لأنه علم أنهم إليه يسجدون فإن الخليفة معلوم أنه لا يظهر إلا بصفة من استخلفه فالحكم لمن استخلفه قال الحق لأبي يزيد في بعض مكاناته مع الحق اخرج إلى الخلق بصفتي فمن رآك رآني ومن عظمك عظمني فتعظيم العبيد لتعظيم سيدهم لا لنفوسهم فهذا سر الإبدار فنصب الله صورة البدر مع الشمس مثلا للخلافة الإلهية وأن الحق يرى نفسه في ذات من استخلفه على كمال الخلقة فإنه لا يظهر له إلا في صورته وعلى قدره ومن يرى أن الحق مرآة العالم وأن العالم يرى نفسه فيه جعل العالم كالشمس والحق كالبدر وكلا المثلين صحيح واقع‏\n\n\n### [إن الله ينبه بضرب الأمثال على أنه هو]\n\n\nواعلم أن الله قصد ضرب الأمثال للناس فقال كَذلِكَ يَضْرِبُ الله الْأَمْثالَ لِلَّذِينَ اسْتَجابُوا لِرَبِّهِمُ الآية فالعالم كله بما فيه ضرب مثل ليعلم منه أنه هو فجعله دليلا عليه وأمرنا بالنظر فيه فمما ضرب الله في العالم من المثل صورة القمر مع الشمس فلا يزال الحق ظاهرا في العالم دائما على الكمال فالعالم كله كامل وجعل الله للعالم وجهين ظاهرا وباطنا فما نقص في الظاهر من إدراك تجليه أخذه الباطن وظهر فيه فلا يزال العالم بعين الحق محفوظا أبدا ولا ينبغي أن يكون إلا هكذا وأحوال العالم مع الله على ثلاث مراتب مرتبة يظهر فيها تعالى بالاسم الظاهر فلا يبطن عن العالم شي‏ء من الأمر وذلك في موطن مخصوص وهو في العموم موطن القيامة ومرتبطة يظهر فيها الحق في العالم في الباطن فتشهده القلوب دون الأبصار ولهذا يرجع الأمر إليه ويجد كل موجود في فطرته الاستناد إليه والإقرار به من غير علم به ولا نظر في دليل فهذا من حكم تجليه سبحانه في الباطن ومرتبطة ثالثة له فيها تجل في الظاهر والباطن فيدرك منه في الظاهر قدر ما تجلى به ويدرك منه في الباطن قدر ما تجلى به فله تعالى التجلي الدائم العام في العالم على الدوام وتختلف مراتب العالم فيه لاختلاف مراتب العالم في نفسها فهو يتجلى بحسب استعدادهم فمن فهم هذا علم أن الإبدار لا يزال فافهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 256 concerning the Knowledge of the Full Moon (الإبدار) and its Secrets\n\n> The Full Moon of Return is blind to the Full Moon of the Spiritual Path,\n> So look with 'Is it?', and 'Why?', and then 'How?' and 'What?'\n> For Being (الوجود) is exalted above these demands,\n> There is no difference therein between 'He established Himself' and 'He was veiled.'\n> He whose Oneness (توحيده) is not affected by any attribution,\n> That is the one in whose Oneness the ancients were bewildered.\n> And we have not seen for the intellect, in its fluctuations,\n> In the Presence of the Essence (حضرة الذات) regarding His Oneness, a firm foothold.\n\n### [The Full Moon (الإبدار) which Allah established as a paradigm in the World, which is the Divine Vicegerent]\n\nKnow that 'Is it?' (هل) is not asked concerning anything mentioned unless its existence is hidden. For that whose existence is manifest to every eye, the demand for 'Is it?' is lifted from it, as it is an inquiry, and inquiry only arises from ignorance concerning the state of that which is inquired about. Likewise, 'Why?' (لم) is only asked concerning that which is caused. 'What?' (ما) is only asked concerning that which is limited. 'How?' (كيف) is only asked concerning that which is susceptible to states.\n\nThe Real (الحق) is exalted above these intelligible matters derived from these demands. Thus, the Essence (الذات) is exalted above these demands. Indeed, these demands are not permissible concerning Him, neither according to those who hold that Being (الوجود) is Allah, nor according to those who do not. For he who holds that Being is Allah sees that the ruling of that by which the Real manifests are merely the rulings of the Fixed Entities (الأعيان الثابتة) of the possible things. Thus, these demands only fall upon that which deserves them. For the Essence of the Real (عين الحق) is only sought from the perspective of its manifestation through the ruling of the essence of the possible thing. Thus, the essence of the possible thing is the object sought, but it became confused for the seeker. As for he who does not hold that the essence of Being is the Real, these demands are not permissible concerning Him either.\n\nThen we return and say: As for the Full Moon (الإبدار) which Allah established as a paradigm in the World (العالم) for His Self-disclosure (تجلي) through ruling therein, it is the Divine Vicegerent (الخليفة الإلهي). He appeared in the World through the Names (الأسماء) and rulings of Allah, through Mercy, Wrath, Vengeance, and Forgiveness—just as the sun appeared in the essence of the moon and illuminated it entirely, so it was called a full moon (بدراً). The sun saw itself in the mirror of the essence of the full moon and clothed it with a light by which it named it a full moon. Similarly, the Real (الحق) saw Himself in the essence of the one He appointed as Vicegerent. This Vicegerent rules by the ruling of Allah in the World, and the Real witnesses him with the witnessing of one who benefits him with the light of Knowledge (العلم). Allah the Exalted said: <<إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً>> (Indeed, I am going to place upon the earth a vicegerent). He taught him all the Names and commanded the angels to prostrate to him, because He knew that they would prostrate to Him through him. It is known that the Vicegerent does not manifest except with the Attribute (صفة) of the one who appointed him. Thus, the ruling belongs to the one who appointed him. The Real said to Abu Yazid [al-Bistami] in one of his stations with the Real: \"Go out to the Creation (الخلق) with My Attribute, for whoever sees you sees Me, and whoever honors you honors Me.\" Thus, the honoring of the servants is for the honoring of their Lord, not for their own selves.\n\nThis is the secret of the Full Moon (الإبدار). Allah established the image of the full moon with the sun as a paradigm for the Divine Vicegerency (الخلافة الإلهية), and that the Real sees Himself in the essence of the one He appointed as Vicegerent upon the perfection of creation (كمال الخلقة). For He does not manifest to him except in His own form and according to His measure. And whoever holds that the Real is the mirror of the World and that the World sees itself in Him, makes the World like the sun and the Real like the full moon. Both paradigms are correct and actual.\n\n### [Indeed, Allah alerts through the striking of parables that He is He]\n\nKnow that Allah intended the striking of parables for mankind, saying: <<كَذلِكَ يَضْرِبُ الله الْأَمْثالَ لِلَّذِينَ اسْتَجابُوا لِرَبِّهِمُ الآية>> (Thus does Allah strike parables for those who respond to their Lord...). The entire World, including everything within it, is a struck parable, so that it may be known from it that He is He. He made it a sign pointing to Himself and commanded us to contemplate it.\n\nAmong the parables Allah struck in the World is the image of the moon with the sun. The Real remains perpetually manifest in the World, always upon perfection. Thus, the entire World is perfect. Allah made two faces for the World: an outer and an inner. Whatever is lacking in the outer aspect regarding the perception of His Self-disclosure (تجلي) is taken up by the inner aspect and manifests therein. Thus, the World remains eternally preserved by the Essence of the Real (عين الحق), and it ought not to be otherwise.\n\nThe states of the World with Allah are upon three Levels (مراتب):\n\n1.  A Level in which He manifests (تعالى) through the Name the Manifest (الظاهر). Thus, nothing of the matter is hidden from the World. This occurs in a specific station, which, in general, is the station of the Resurrection (القيامة).\n2.  A Level in which the Real manifests in the World in the Inner (الباطن). Hearts witness Him, but not eyes. For this reason, the matter returns to Him, and every existent being finds in its innate disposition (فطرته) reliance upon Him and affirmation of Him, without Knowledge (علم) of Him or contemplation of a proof. This is due to the ruling of His Self-disclosure in the Inner.\n3.  A third Level in which He has a Self-disclosure in the Outer and the Inner. One perceives from Him in the Outer according to the measure by which He disclosed Himself, and one perceives from Him in the Inner according to the measure by which He disclosed Himself.\n\nThus, He has the perpetual, universal Self-disclosure (التجلي الدائم العام) in the World continuously. The Levels of the World differ therein due to the difference in the Levels of the World itself. He discloses Himself according to their preparedness. Whoever understands this knows that the Full Moon (الإبدار) is perpetual. So understand. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب دو سو چھپن: ابدار (کمالِ بدر) اور اس کے اسرار کی معرفت میں\n\nسلوک کے بدر کی طرف رجوع کا بدر اندھا پن ہے، پس تم 'کیا وہ ہے؟'، 'کیوں؟'، اور پھر 'کیسے؟' اور 'کیا؟' کے ذریعے دیکھو۔\nکیونکہ الوجود (ہستی) ان مطالبات سے بلند ہے، اس میں 'اس نے استواء کیا' اور 'وہ عما (غیبوبت) میں تھا' کے درمیان کوئی فرق نہیں۔\nوہ جس کی توحید میں کوئی نسبت اثر انداز نہیں ہوتی، وہی ہے جس کی توحید میں قدماء حیران رہے۔\nاور ہم نے عقل کے لیے، اس کے پلٹنے میں، حضرۃ الذات (ذات کی حضوری) میں اس کی توحید کے بارے میں کوئی قدم نہیں دیکھا۔\n\n### [ابدار جسے اللہ نے عالم میں مثال کے طور پر قائم کیا ہے، وہ خلیفہ الٰہی ہے]\n\nجان لو کہ کسی مذکور کے بارے میں یہ نہیں کہا جاتا کہ آیا وہ موجود ہے یا نہیں، جب تک کہ وہ وجود میں مخفی نہ ہو۔ اور جس کا وجود ہر آنکھ کے لیے ظاہر ہو، اس سے 'کیا وہ ہے؟' کا مطالبہ ختم ہو جاتا ہے، کیونکہ یہ استفہام (سوال) ہے، اور استفہام صرف اس چیز کی جہالت کی بنا پر ہوتا ہے جس کے بارے میں سوال کیا جا رہا ہو۔ اسی طرح 'کیوں؟' صرف معلول (جس کا کوئی سبب ہو) کے بارے میں کہا جاتا ہے۔\nاور 'کیا؟' صرف محدود کے بارے میں کہا جاتا ہے، اور 'کیسے؟' صرف احوال کو قبول کرنے والے کے بارے میں کہا جاتا ہے۔ اور الحق (ذات حق) ان معقول امور سے، جو ان مطالبات سے پیدا ہوتے ہیں، منزہ ہے۔ پس وہ الذات (ذات) کے اعتبار سے ان مطالبات سے منزہ ہے۔ بلکہ یہ مطالبات اس کے حق میں جائز ہی نہیں، نہ تو اس شخص کے حق میں جو یہ دیکھتا ہے کہ الوجود (ہستی) ہی اللہ ہے، اور نہ ہی اس شخص کے حق میں جو اسے نہیں دیکھتا۔ کیونکہ جو یہ دیکھتا ہے کہ الوجود (ہستی) ہی اللہ ہے، وہ یہ دیکھتا ہے کہ جس حکم کے ساتھ الحق (ذات حق) ظاہر ہوا ہے، وہ درحقیقت اعیان ممکنات (ممکن ہستیوں) کے احکام ہیں۔ پس یہ مطالبات صرف اپنے مستحق پر واقع ہوئے ہیں، کیونکہ الحق (ذات حق) کی عینیت کا مطالبہ صرف اس کے ظہور کے اعتبار سے کیا گیا ہے جو عین ممکن کے حکم کے ساتھ ظاہر ہوا ہے۔ پس عین ممکن ہی مطلوب ہے، اور طالب پر التباس ہو گیا۔ اور جو یہ نہیں دیکھتا کہ عین الوجود (ہستی کی حقیقت) ہی الحق (ذات حق) ہے، تو اس پر بھی یہ مطالبات جائز نہیں۔\n\nپھر ہم رجوع کرتے ہیں اور کہتے ہیں کہ ابدار (کمالِ بدر) جسے اللہ نے عالم میں اپنے حکم کے ساتھ التجلی (ظہور الٰہی) کے لیے مثال کے طور پر قائم کیا ہے، وہ خلیفہ الٰہی ہے جو عالم میں اللہ کے اسماء و احکام، رحمت، قہر، انتقام اور عفو کے ساتھ ظاہر ہوا ہے۔ جیسا کہ سورج چاند کی ذات میں ظاہر ہوا اور اسے مکمل طور پر روشن کر دیا، پس وہ بدر (چودھویں کا چاند) کہلایا۔ سورج نے اپنی ذات کو بدر کی ذات کے آئینے میں دیکھا، پس اسے ایک نور عطا کیا جسے اس نے بدر کا نام دیا۔ اسی طرح الحق (ذات حق) نے اپنی ذات کو اس شخص کی ذات میں دیکھا جسے اس نے خلیفہ بنایا، پس وہ عالم میں اللہ کے حکم سے حکومت کرتا ہے، اور الحق (ذات حق) اسے ایسے شخص کا الشہود (مشاہدہ) کراتا ہے جو اسے علم کا نور عطا کرتا ہے۔ اللہ تعالیٰ نے فرمایا: \"میں زمین میں ایک خلیفہ بنانے والا ہوں\" (إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً)۔ اور اسے تمام اسماء کا علم سکھایا، اور فرشتوں نے اسے سجدہ کیا، کیونکہ وہ جانتا تھا کہ وہ اسی کو سجدہ کریں گے۔ کیونکہ خلیفہ معلوم ہے کہ وہ صرف اسی کی صفت کے ساتھ ظاہر ہوتا ہے جس نے اسے خلیفہ بنایا ہو۔ پس حکم اسی کا ہے جس نے اسے خلیفہ بنایا۔ الحق (ذات حق) نے ابو یزید سے اپنے بعض مقامات میں فرمایا: \"میری صفت کے ساتھ خلق کی طرف جاؤ، پس جس نے تمہیں دیکھا اس نے مجھے دیکھا، اور جس نے تمہاری تعظیم کی اس نے میری تعظیم کی\"۔ پس بندوں کی تعظیم ان کے آقا کی تعظیم کے لیے ہے، نہ کہ ان کی اپنی ذات کے لیے۔ پس یہ ابدار کا راز ہے۔ اللہ نے بدر کی صورت کو سورج کے ساتھ خلافت الٰہیہ کے لیے مثال کے طور پر قائم کیا ہے، اور یہ کہ الحق (ذات حق) اپنی ذات کو اس شخص کی ذات میں دیکھتا ہے جسے اس نے کامل خلقت پر خلیفہ بنایا ہے، کیونکہ وہ اس کے لیے صرف اس کی صورت میں اور اس کے قدر کے مطابق ہی ظاہر ہوتا ہے۔ اور جو یہ دیکھتا ہے کہ الحق (ذات حق) عالم کا آئینہ ہے اور عالم اپنی ذات کو اس میں دیکھتا ہے، تو اس نے عالم کو سورج کی طرح اور الحق (ذات حق) کو بدر کی طرح قرار دیا، اور دونوں مثالیں صحیح اور واقع ہیں۔\n\n### [اللہ مثالیں بیان کر کے اس بات پر متنبہ کرتا ہے کہ وہ خود ہی ہے]\n\nاور جان لو کہ اللہ نے لوگوں کے لیے مثالیں بیان کرنے کا ارادہ کیا اور فرمایا: \"اسی طرح اللہ ان لوگوں کے لیے مثالیں بیان کرتا ہے جنہوں نے اپنے رب کی پکار کو قبول کیا\" (كَذلِكَ يَضْرِبُ الله الْأَمْثالَ لِلَّذِينَ اسْتَجابُوا لِرَبِّهِمُ الآية)۔ پس پورا عالم، جو کچھ اس میں ہے، ایک مثال کے طور پر بیان کیا گیا ہے تاکہ اس سے یہ معلوم ہو کہ وہ (الحق) ہی ہے، اور اسے اپنی ذات پر دلیل بنایا ہے۔ اور ہمیں اس میں غور کرنے کا حکم دیا۔ پس ان مثالوں میں سے جو اللہ نے عالم میں بیان کی ہیں، چاند کی صورت سورج کے ساتھ ہے۔ پس الحق (ذات حق) ہمیشہ عالم میں کمال کے ساتھ ظاہر رہتا ہے۔ پس پورا عالم کامل ہے۔ اور اللہ نے عالم کے لیے دو رُخ بنائے ہیں: ظاہر اور باطن۔ پس جو کچھ ظاہر میں اس کے التجلی (ظہور الٰہی) کے ادراک میں کم ہوتا ہے، اسے باطن لے لیتا ہے اور اس میں ظاہر ہوتا ہے۔ پس عالم ہمیشہ عین الحق (ذات حق کی حقیقت) کے ساتھ محفوظ رہتا ہے، اور ایسا ہی ہونا چاہیے۔ اور اللہ کے ساتھ عالم کے احوال تین مراتب پر ہیں:\n\n۱. ایک مرتبہ جس میں وہ اسم الظاہر کے ساتھ ظاہر ہوتا ہے، پس کوئی بھی امر عالم سے مخفی نہیں رہتا، اور یہ ایک مخصوص مقام میں ہے، اور عموماً یہ قیامت کا مقام ہے۔\n۲. اور ایک مرتبہ جس میں الحق (ذات حق) عالم میں باطن میں ظاہر ہوتا ہے، پس اسے دل الشہود (مشاہدہ) کرتے ہیں نہ کہ آنکھیں۔ اسی لیے امر اسی کی طرف لوٹتا ہے، اور ہر موجود اپنی فطرت میں اس کی طرف استناد اور اس کا اقرار پاتا ہے، بغیر اس کے علم کے اور بغیر کسی دلیل میں غور کیے، پس یہ اس کے باطن میں التجلی (ظہور الٰہی) کے حکم سے ہے۔\n۳. اور ایک تیسری مرتبہ جس میں اس کے لیے ظاہر اور باطن میں التجلی (ظہور الٰہی) ہوتا ہے، پس ظاہر میں اتنا ادراک کیا جاتا ہے جتنا اس نے التجلی کیا، اور باطن میں اتنا ادراک کیا جاتا ہے جتنا اس نے التجلی کیا۔\n\nپس اس (الحق) کے لیے عالم میں ہمیشہ دائمی اور عام التجلی (ظہور الٰہی) ہے۔ اور عالم کے مراتب اس میں مختلف ہوتے ہیں، کیونکہ عالم کے مراتب خود مختلف ہیں۔ پس وہ ان کی استعداد کے مطابق التجلی کرتا ہے۔ پس جس نے یہ سمجھ لیا، اس نے جان لیا کہ ابدار (کمالِ بدر) ہمیشہ باقی رہتا ہے۔ پس سمجھو۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب دویست و پنجاه و ششم در معرفت کمال ماه (الإبدار) و اسرار آن\n\nکمال ماه (بدر) رجوع به کمال ماه (بدر) سلوک، کوری است؛ پس بنگر به «آیا» و «چرا» و سپس «چگونه» و «چه».\n\nزیرا هستی (وجود) از این مطالبات برتر است؛ در آن فرقی نیست میان «استوا» (برقرار شدن) و «عما» (پنهان بودن).\n\nآن کس که در توحیدش نسبی تأثیر نمی‌گذارد، همان است که قدما در توحیدش حیران شدند.\n\nو ما برای عقل در تقلبش (دگرگونی‌اش) در حضرت ذات، در توحیدش، قدمی ندیدیم.\n\n### [کمال ماه (الإبدار) که خداوند آن را مثالی در عالم قرار داده، همان خلیفه الهی است]\n\nبدان که درباره هیچ موجودی گفته نمی‌شود که آیا هست یا نه، مگر آنکه هستی‌اش (الوجود) پنهان باشد. و آن کس که هستی‌اش برای هر چشمی آشکار است، طلب «آیا» از او برداشته می‌شود، زیرا «آیا» استفهام است و استفهام جز از روی جهل به حال آنچه مورد پرسش قرار گرفته، نیست. همچنین «چرا» (لم) گفته نمی‌شود مگر در مورد معلول؛ و «چه» (ما) گفته نمی‌شود مگر در مورد محدود؛ و «چگونه» (کیف) گفته نمی‌شود مگر در مورد پذیرنده احوال. و حق (الحق) از این امور معقول که از این مطالبات ناشی می‌شوند، منزه است. پس ذات او از این مطالبات منزه است. بلکه این مطالبات بر او روا نیست، نه در حق کسی که هستی (الوجود) را عین خدا می‌داند و نه در حق کسی که آن را نمی‌داند.\n\nزیرا کسی که هستی (الوجود) را عین خدا می‌داند، می‌بیند که حکم آنچه حق (الحق) به واسطه آن ظاهر شده، تنها احکام اعیان ممکنات است. پس این مطالبات جز بر مستحق خود واقع نشده‌اند، زیرا عین حق (الحق) طلب نشده مگر از حیث ظهورش به حکم عین ممکن. پس عین ممکن مطلوب است و بر طالب مشتبه شده است. و اما کسی که عین هستی (الوجود) را حق (الحق) نمی‌داند، این مطالبات بر او روا نیست.\n\nسپس باز می‌گردیم و می‌گوییم: اما کمال ماه (الإبدار) که خداوند آن را در عالم مثالی برای تجلی (التجلی) خود به واسطه حکم در آن قرار داده است، همان خلیفه الهی (الخليفة الإلهي) است که در عالم با اسماء و احکام الهی، و رحمت و قهر و انتقام و عفو ظاهر شده است. همان‌گونه که خورشید در ذات ماه ظاهر شد و تمام آن را روشن ساخت و آن را بدر (ماه کامل) نامیدند. پس خورشید خود را در آینه ذات بدر دید و نوری بر آن پوشاند که به واسطه آن، آن را بدر نامید؛ همان‌گونه که حق (الحق) خود را در ذات کسی که او را خلیفه ساخته، دیده است. پس او به حکم خدا در عالم حکم می‌کند و حق (الحق) او را شهود می‌کند، شهود کسی که نور علم را به او افاضه می‌کند. خداوند متعال می‌فرماید: **إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً** (من در زمین جانشینی قرار خواهم داد). و همه اسماء را به او آموخت و فرشتگان بر او سجده کردند، زیرا دانست که آنان به سوی او سجده می‌کنند.\n\nزیرا معلوم است که خلیفه جز به صفت کسی که او را خلیفه کرده، ظاهر نمی‌شود. پس حکم از آنِ کسی است که او را خلیفه کرده است. حق (الحق) در برخی از مقامات ابویزید با حق (الحق) به او فرمود: «به صفت من نزد خلق برو، پس هر کس تو را ببیند، مرا دیده و هر کس تو را تعظیم کند، مرا تعظیم کرده است.» پس تعظیم بندگان برای تعظیم سیدشان است، نه برای نفس‌های خودشان. این است سر کمال ماه (الإبدار). پس خداوند صورت بدر (ماه کامل) را با خورشید، مثالی برای خلافت الهی قرار داد و اینکه حق (الحق) خود را در ذات کسی که او را خلیفه ساخته، بر کمال خلقت می‌بیند، زیرا حق (الحق) جز در صورت او و به اندازه او برایش ظاهر نمی‌شود. و کسی که حق (الحق) را آینه عالم می‌داند و عالم خود را در آن می‌بیند، عالم را مانند خورشید و حق (الحق) را مانند بدر (ماه کامل) قرار داده است. و هر دو مثال صحیح و واقع هستند.\n\n### [خداوند با زدن مَثَل‌ها بر اینکه اوست، آگاه می‌سازد]\n\nو بدان که خداوند قصد کرده است که برای مردم مَثَل‌ها بزند و فرموده است: **كَذلِكَ يَضْرِبُ الله الْأَمْثالَ لِلَّذِينَ اسْتَجابُوا لِرَبِّهِمُ** (این‌گونه خداوند برای کسانی که پروردگارشان را اجابت کردند، مَثَل‌ها می‌زند) [آیه]. پس تمام عالم با آنچه در آن است، مَثَلی است که از آن دانسته شود که او (حق) است. پس آن را دلیلی بر خود قرار داد و ما را به نظر کردن در آن امر فرمود. و از جمله مَثَل‌هایی که خداوند در عالم زده است، صورت ماه با خورشید است. پس حق (الحق) پیوسته و همیشه در عالم بر کمال ظاهر است، بنابراین تمام عالم کامل است.\n\nو خداوند برای عالم دو وجه قرار داد: ظاهر و باطن. پس آنچه در ظاهر از ادراک تجلی (التجلی) او ناقص شد، باطن آن را گرفت و در آن ظاهر شد. پس عالم پیوسته به عین حق (الحق) محفوظ است و هرگز جز این نباید باشد. و احوال عالم با خدا بر سه مرتبه است: مرتبه‌ای که حق تعالی در آن با اسم الظاهر (آشکار) تجلی می‌کند، پس هیچ امری از عالم پنهان نمی‌ماند، و این در موطنی مخصوص است که به طور عموم موطن قیامت است. و مرتبه‌ای که حق (الحق) در عالم در باطن ظاهر می‌شود، پس قلب‌ها او را شهود می‌کنند نه چشم‌ها. و به همین دلیل امر به سوی او باز می‌گردد و هر موجودی در فطرت خود تکیه بر او و اقرار به او را می‌یابد، بدون آنکه علمی به او داشته باشد یا در دلیلی نظر کند. پس این از حکم تجلی (التجلی) سبحان او در باطن است. و مرتبه سومی که در آن برای او تجلی (التجلی) در ظاهر و باطن است، پس از او در ظاهر به اندازه‌ای که تجلی کرده، ادراک می‌شود و در باطن نیز به اندازه‌ای که تجلی کرده، ادراک می‌شود. پس برای حق تعالی تجلی (التجلی) دائم و عام در عالم همواره وجود دارد و مراتب عالم در آن متفاوت است به دلیل اختلاف مراتب عالم در خودشان. پس او بر حسب استعدادشان تجلی می‌کند. کسی که این را فهمید، دانست که کمال ماه (الإبدار) پیوسته باقی است. پس بفهم. و خداوند **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}