{
  "id": 286,
  "title": {
    "ar": "الباب السادس والثمانون ومائتان في معرفة منزل من قيل له كن فأبى فلم يكن من الحضرة المحمدية",
    "en": "Chapter Two Hundred and Eighty-Six: Concerning the Gnosis (معرفة) of the Station (منزل) of him who was commanded, \"Be!\" (كن), yet refused, and therefore did not come into existence, within the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب دو سو چھیاسی: اس شخص کے مقام کی معرفت میں جسے \"کن\" (ہو جا) کہا گیا، مگر اس نے انکار کر دیا اور وہ وجود میں نہ آیا، جو کہ الحضرة المحمدية (الحضرة المحمدية) سے ہے۔",
    "fa": "باب دویست و هشتاد و ششم در معرفت منزل کسی که به او گفته شد «باش» (کن) پس امتناع ورزید و نبود، از حضرت محمدیه (الحضرة المحمدية)."
  },
  "content": {
    "ar": "## (الباب السادس والثمانون ومائتان في معرفة منزل من قيل له كن فأبى فلم يكن من الحضرة المحمدية)\n\n\n> شمس الفناء بدت في كاف تكويني *** لعلمها أنها بالنور تفنيني‏\n\n\n> وقد أشارت ولم أعلم إشارتها *** بأن في ذلك الإيماء تعنيني‏\n\n\n> فكنت واو العين العلم ظاهرة *** خفية العين بين الكاف والنون‏\n\n\n> فصلت في اللوح أسرارا متوجة *** قد كان أجملها الرحمن في النون‏\n\n\n### [الفناء في المشاهدة]\n\n\nمن هذا المنزل قيدت جزءا سميته الفناء في المشاهدة فلنذكر الآن ما يتضمنه هذا المنزل على ما يحوي عليه من الأصول فإن البسط فيه يطول فاعلم أن مظهر هذا المنزل اسمه النور ولكن الأنوار على قسمين نور ما له شعاع ونور شعشعاني فالنور الشعشعاني إن وقع فيه التجلي ذهب بالأبصار وهو الذي أشار إليه رسول الله صلى الله عليه وسلم حين قيل له يا رسول الله هل رأيت ربك فقال صلى الله عليه وسلم نوراني أراه‏\n\n\nيقول نور كيف أراه يريد النور الشعشعاني فإن تلك الأشعة تذهب بالأبصار وتمنع من إدراك من تنشق منه تلك الأشعة وهو أيضا الذي أشار إليه صلى الله عليه وسلم‏\n\n\nبقوله إن لله سبعين حجابا من نور وظلمة لو كشفها لأحرقت سبحات وجهه ما أدركه بصره من خلقه‏\n\n\nوالسبحات هنا هي أنوار حقيقته فإن وجه الشي‏ء حقيقته وأما النور الذي لا شعاع له فهو النور الذي يكون فيه التجلي ولا شعاع له ولا يتعدى ضوؤه نفسه ويدركه المبصر في غاية الجلاء والوضوح بلا شك وتبقي الحضرة التي يكون فيها هذا الذي كشفت له في غاية\nمن الوضوح لا يغيب عنه منها شي‏ء في غاية الصفاء وفي هذا التجلي‏\n\n\nيقول النبي صلى الله عليه وسلم ترون ربكم كما ترون القمر ليلة البدر\n\n\nفمن بعض ما يريد بهذا التشبيه الذي وقع بالرؤية إدراك ذات القمر لضعف أشعة القمر أن يمنع البصر من إدراك ذاته والصحيح في ذلك أنه يريد به إذا كسف ليلة بدره فإنه عند ذلك يدرك البصر ذات القمر التي لا تقبل الزيادة ولا النقصان فهو إدراك محقق لذات القمر ثم قال في نفس الحديث أو كما ترون الشمس بالظهيرة ليس دونها سحاب وفي ذلك الوقت يكون نورها أقوى فتظهر الأشياء كلها بها فيدرك البصر كلما وقع عليه من الأشياء إدراكه حين كشفت له هذه الشمس وإذا أراد أن يحقق النظر إلى ذات الشمس في هذه الحالة لا يقدر فأوقع التشبيه أن هذا التجلي ليس يمنع أن يرى الناس بعضهم بعضا أي لا يفنى فلهذا أوقع التشبيه برؤية القمر ليلة البدر وبرؤية الشمس وما اقتصر على واحد منهما وأكد البقاء في هذا المشهد بقوله لا تضارون ولا تضامون من الضيم والضم الذي هو المزاحمة ومن الضير والإضرار ولما دخلت هذا المنزل وقع لي فيه التجلي في النور الذي لا شعاع له فرأيته علما ورأيت نفسي به ورأيت جميع الأشياء بنفسي وبما تحمله الأشياء في ذواتها من الأنوار التي تعطيها حقائقهم لا من نور زائد على ذلك فرأيت مشهدا عظيما حسيا لا عقليا وصورة حقية لا معنى ظهر في هذا التجلي اتساع الصغير لدخول الكبير فيه مع بقاء الصغير على صغره والكبير على كبره كالجمل يلج في سَمِّ الْخِياطِ يشاهد ذلك حسا لا خيالا وقد وسعه ولا تدري كيف ولا تنكر ما تراه فسبحان من تعالى عن إدراك ما تكيفه العقول وفضل إدراك البصر عليها لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ فأظهر عجز العقول بهذا التجلي الذي أظهر به قوة الأبصار وفضلها على العقول وأظهر في تجليه في النور الشعشعاني عجز الأبصار وقوة العقول وفضلها على الأبصار ليتصف الكل\n\n\nبالعجز وينفرد الحق بالكمال الذاتي فمن عاين هذا المنزل يرى من العجائب والآيات ما لا يمكن أن يحويه غيره وأول هذا المنزل عند دخولك فيه ترى نفسك مظهرا للحق فإذا رأيته تتحقق من نفسك أنه ليس هو وهو آخر هذا المنزل فيتضمن أوله هو مشاهدة ويخاطبك في هذا التجلي بأنه ليس هو فإنه من التجليات التي لا تفني عين المشاهدة فتجمع بين الرؤية والخطاب وآخر هذا المنزل يتضمن الهو وهو في الغيب من غير رؤية وهو متعلق نظر العقل فأول هذا المنزل بصري وآخره عقلي وما بينهما وهذا منزل يتضمن أيضا ما نذكره‏\n\n\n### [الأسرار التي منحه الله على العبد]\n\n\nفاعلم إن الأسرار التي يمنحها الحق عبده من أهل هذه الطريقة على قسمين منها أسرار تعطيك بذاتها إن تظهرها في الأكوان من غير حرج في ذلك عليك ولا تحتاج في إظهارها للغير إلى إذن إلهي وأسرار لا تعطيك بذاتها هذا الحكم وهي على قسمين قسم منها تحتاج في إظهاره إلى إذن إلهي فإن أظهرته عن غير إذن قوبلت ووقع الحرج والجناح عليك في إظهاره وقد وقع لي مثل هذا ولكن بحمد الله قوبلت بالعتاب لا بالعقاب رحمة من الله بي وعناية وأسرار أخر لا يعطيها الحق لأحد بواسطة فلو طلبت الأذن فيها إذا أطلعك الحق عليها أن توصلها ما أذن لك فإنها أذواق لا تعرفها من غيرك بمجرد العبارة عنها فإنها مما ينفرد الحق بإيصالها من الحق إلى العبد كما يفعل بالأحوال فلو رام أحد أن يعبر عن الشوق الذي يجده إلى من اشتاق إليه ما أطاق ذلك ولا وصل إلى فهم الآخر منه شي‏ء إلا أن يقوم الشوق به مثل ما قام بصاحبه فيعرف عند ذلك حقيقة مسمى هذا اللفظ وكذلك ما في معناه وكلذة الجماع التي حرمها العنين لا يتمكن لمن قامت به أن يوصلها بالتعريف إلى العنين وكذلك كل علم يتعلق بالحواس لا يمكن للعقل أن يصل إلى معرفته بنفسه ولا بالعبارة عنه إلا أن يحس به الآخر فالذي يختص بهذا المنزل معرفة الأسرار التي يتوقف إظهارها ممن قامت به وأعطيته على الأذن الإلهي ومعرفة الأسرار الإلهية المستورة خلف حجاب الصور التي لا تظهر إلا لمن كان على بينة من ربه في ذلك فإذا شهدت البينة لها عند العبد قبلها فلا يحتاج إلى شاهد مثل ما يحتاج في غيرها فإذا حصل العبد في هذا المقام ووهبه الحق من هذه الأسرار وهب تجل واطلع على أمور غامضة من العلم بالله سترها في نفسه وكتمها عن غيره وفاء بحق الأمانة وحفظها ومعرفة بقدرها ومنزلتها ويطلع على هذه الأسرار معنا من ينسب بعض الأفعال إلى غير الله من المعتزلة والفلاسفة وأهل الشرك الذين عبدوا غير الله مع عبادة الله فقد ينفردون في أوقات مع الله دون الشريك وذلك في أوقات الضرورات المهلكة التي يقطعون فيها إن آلهتهم لا تغني‏\nعنهم فيها شيئا فيلجئون إلى الله في رفعها فمن تلك الحقيقة المستورة فيهم في حال لا يكون فيه تحت اضطرار حسي من ذلك الوجه ينالون هذه الأسرار وإن كانوا أشقياء فإن نيلهم إياها مما يزيد في شقاوتهم حيث عرفوا من بيده الاقتدار وعدلوا عنه وعملوا لغيره مما نصبوه بأيديهم وأيدي من هو من جنسهم إلها وظهر لهم عجزه وتمادوا على غيهم كما قال تعالى في طُغْيانِهِمْ يَعْمَهُونَ‏\n\n\n### [أن بينة الله في عباده على قسمين‏]\n\n\nواعلم أن بينة الله في عباده على قسمين القسم الواحد هو البينة الحقيقية وهو قوله تعالى أَ فَمَنْ كانَ عَلى‏ بَيِّنَةٍ من رَبِّهِ يعني في نفسه وأما من تقام له البينة في غيره فقد يمكن أن يقبلها ويمكن أن لا يقبلها والذي يقبلها إن قبلها تقليد أ لم تكن في حقه آية بينة ولا تنفعه وإنما يكون التقليد فيما يجي‏ء به الرسول من الأحكام لا من البينات والشواهد على صدقه وإن لم يقبلها تقليدا فما قبلها إلا أن يكون هو عَلى‏ بَيِّنَةٍ من رَبِّهِ في إن تلك آية بينة على صدق دعوى من ظهرت على يديه فيما ادعاه فعلمت من هذا أن الشي‏ء لا ينفعك إلا إذا كان فيك ولا يضرك إلا إذا كان فيك ولهذا نقول في كثير من كلامنا إن حقيقة العذاب هو وجود الألم فيك لا أسبابه سواء وقعت الأسباب فيك أو في غيرك فلا نقول في الأشياء إلا أن تقوم لك منك وأقلها أن يقوم بك التصديق بما يتحقق به أهل طريق لله بأنه حق وإن لم تذقه ولا تخالفهم فتكون على بينة من ربك ولا بد في كونهم صادقين وبتلك البينة التي أنت عليها توافقهم في ذلك فأنت منهم في مشرب من مشاربهم فإنهم أيضا ممن يوافق بعضهم بعضا فيما يتحققون به في الوقت وإن كان لا يدرك هذا ذوقا ما أدركه صاحبه فيقر له به ويسلمه له ولا ينكره لارتفاع التهمة ومجالسة هؤلاء الأقوام لغير المؤمن بهم خطر عظيم وخسران مبين كما قال بعض السادة وأظنه رويما من قعد معهم وخالفهم في شي‏ء مما يتحققون به في سرائرهم نزع الله نور الايمان من قلبه فلا يزال الإنسان على الحالة التي هو عليها حتى يقوم له الشاهد بالخروج عنها فمن كان في حالة الكتم كتم ومن كان في حالة الإظهار أظهر وأفشى قُلْ كُلٌّ يَعْمَلُ عَلى‏ شاكِلَتِهِ فَرَبُّكُمْ أَعْلَمُ بِمَنْ هُوَ أَهْدى‏ سَبِيلًا من هؤلاء الفرق فالله يجعلنا وإياكم ممن هو عَلى‏ بَيِّنَةٍ من رَبِّهِ فإن تلاه شاهد فحسن ومزيد طمأنينة وتقوية للنفس فيما هي بسبيله وإن لم يكن ذلك ففي كونه على بينة من ربه كفاية فإن الشاهد إن لم يكن فيه المشهود له على بينة أنه صادق فيما يشهد له به وإلا فلا يقبله في باطنه كالشاهد مع صاحب الدعوى إذا كان في دعواه محقا فهو على بينة في نفسه من ربه إنه صادق ولكن الحاكم يطالبه بالشاهد فإذا شهد الشاهد له علم المشهود له أنه صادق في شهادته ببينته التي هو عليها إنه على حق في دعواه وإن كان المدعي ليس بصادق في دعواه فهو على بينة من نفسه ومن ربه إنه غير صادق فبما ادعاه فإذا طلبه الحاكم بالشاهد فأتى بشاهد زور فشهد له أنه صادق في دعواه فالمدعي على بينة من نفسه ومن ربه إن ذلك الشاهد الذي شهد له زور وشهد بالباطل ولا يقبله في نفسه وإن قبله الحاكم فأول ما يتجرح شاهد الزور عند من شهد له بما يعلم المشهود له أن الأمر على خلاف ما شهد له به فلهذا قلنا إن الشاهد لا نلتزمه إذ كنا لا نقبله ولا نتحقق صدقه ولا كذبه إلا حتى يكون في ذلك على بينة من الله فاعلم ذلك‏\n\n\n### [البينة هو سفير من الله إلى قلبك‏]\n\n\nواعلم بعد أن تقرر هذا أن الأمر الذي كنى عنه الحق بأنه بينة لك من عنده هو سفير من الله إلى قلبك من خفي غيوبه مختص بك من حضرة الخطاب الإلهي والتعريف من الله أنه من عنده فخذ به وانظر ما يقبله فاقبله وما يدل عليه فاعتمد عليه وما ينفيه فانفه كما يفعل صاحب الفكر في دليله غير إن صاحب الفكر قد يتخذ دليلا ما ليس بدليل في نفس الأمر وقد يتخذ دليلا ما هو دليل في نفس الأمر ولكن بالنظر إلى قوة العقل فقد أعطى ما في قوته فلا يكون أبدا من حيث هو عقل إلا إن ذلك دليل وهو دليل وصاحب البينة من ربه على نور من الله وصراط مستقيم لا يعلم الأشياء بها إلا على ما تكون عليه الأشياء لا يقبل الشبه إلا شبها ذوقا من صورته لا يتمكن له أن يلبس فيها عليه بخلاف أصحاب الأفكار والذي يعطيه هذا السفير منه ما يعطيه ما هو مختص به ومنه ما يعطيه ما هو مطلوب له ولغيره ومنه ما هو مطلوب لغيره ولا يعطيه ما ليس له ولا لغيره ومما يعطيه ما هو له مقيم وما ليس له بمقيم فالمقيم كالمقامات وغير المقيم كالأحوال ثم إن أصحاب هذا المقام يتفرقون فيه ويتنوعون على نوعين منهم من يعصم من تأثير هواه ومنهم من لا يعصم من تأثير هواه فيه مع أن كل واحد من الطائفتين على علم محقق فبينتهم التي هم عليها أنه معصوم وأن هواه ليس له عليه سبيل وأنه غير معصوم وأن هواه قد أثر فيه لما سبق في علم الله فيه وهل ينفعه هذا العلم عند الله في سعادته‏\nأم لا فعندنا إنه نافع وعند غيرنا إنه غير نافع وإنما وقع الخلاف في مثل هذه المسألة بوجود الكشف عند الواجد وعدم الكشف عند المخالف مع الاستناد إلى أمر معارض إما عقلي وإما سمعي ثم إن الله تعالى أمر عباده بالإقامة على ما خلقهم له من الذلة والافتقار إليه ببواطنهم عامة وبظواهرهم على طريقة مخصوصة بينها لهم الشارع وهي جميع الأفعال المقربة إلى الله سواء اقترنت بها في الصورة الظاهرة عزة أو ذلة وربوبية أو عبودية بخلاف الباطن فإن الباطن يجري على الأمر المحقق الذي هو في نفسه عليه والظاهر يجري على ما تقتضيه المصلحة في الوقت بك أو بغيرك فإن ظهر ربوبية وعزة في ظاهر العبد العارف كما ذكرناه لمصلحته فإن الميل في الباطن إلى الذلة والعبودية موجود عنده وهو المعتمد عليه وذلك عارض ولا سيما في موطن التكليف ومن هذا المنزل ينشئ العبد الأعمال صورا قائمة يكون فيها خلاقا بالفعل ولكن مما يقع له به السعادة عند الله فلا يزال ينشئ تلك الصورة حتى يراها قائمة بين يديه حسا ينظر إليها ويفرح بها وجميع ما يظهر من تلك الصورة مما تقتضيه السعادة فإنما هو لمنشئ هذه الصورة وهو هذا العبد فهي له كرأس المال وما يكون عنها كالأرباح والأرباح إنما تعود منفعتها على رب المال لا على نفس المال ومن هذا المنزل أيضا يظهر الجود الذاتي الذي لا يمكن دفعه لا اختيار للعبد فيه فيعطي من نفسه لربه ما سأله فيه إن يعطيه مما لو لم يسأله فيه لأعطاه إياه وهذا من كرم الله حيث علم أنه لا بد أن يعطيه ذلك لأنه أمر تقتضيه ذاتك فسألك في ذلك أن يجازيك على امتثال أمره في ذلك كما سألك فيما يمكن أن تعطيه وفيما يمكن أن تأباه فأجرى هذا مجرى هذا جودا منه وليقوم جزاء ما أعطيته عن أمره مما هو عطاء ذاتي في مقابلة ما منعته وخالفت فيه أمره مما ليس هو عطاء ذاتيا بل إمكانيا وهي جميع الأعمال المشروعة فلهذا أمرك بما لا يمكنك الانفكاك عنه كما لا يمكن للسراج أن يمنع ضوءه ولكن يتصور أن يقال له أعط الأبصار ضوءك ليدركوا به الأشياء فتجازي من حيث ذلك وذلك أن تعلم أن حضرة كن تتضمن روحا وجسما وقد يرتبطان وقد لا يرتبطان فإذا ارتبطا كان هذا الجسم حيا على هذه الصورة من الكاف والواو والنون وإذا كان حيا انفعل عنه ما يتوجه عليه لارتباط الروح به وهو الأذن الإلهي كالنفخ من عيسى عليه السلام في الطائر مقارنا للاذن الإلهي الذي هو النفخ الإلهي فاندرج النفخ الإذني الإلهي الذي به حيي الطائر وارتبط روحه في النفخ الجسماني القائم بعيسى فإذا وجد جسم كن من غير ارتباط الروح به لم يكن عنه شي‏ء أصلا إذ الميت لا يضاف إليه فعل أصلا ولا يقوم لعقل فيه شبهة بخلاف الحي والصورة الجسمية فيهما واحدة وإذا انفرد روح كن دون جسميته انفعلت عنه الأشياء ومن جملة الأشياء جسمية كن الذي هو في عالم الحروف فإذا علمت ما أوضحناه لك في هذا الكلام وقفت على أمر عظيم من قوله تعالى إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ ذلك الأمر ولا بد ويقول الحق سبحانه لعباده في كلامه العزيز أَقِيمُوا الصَّلاةَ واصْبِرُوا وصابِرُوا ورابِطُوا وجاهِدُوا ولا يقع شي‏ء من ذلك\n\n\nلأنه قال لهم اخلقوا وليس من شأنهم أن يخلقوا فتعلق بهم جسم كن لا روحها فكانت ميتة يحرم عليهم استعمالها فإذا تعلق الأذن الإلهي الذي هو كن الحية بإيجاد عين الجهاد أو الرباط أو الصلاة أو أي شي‏ء كان من أفعال العباد تكون في حين التوجه علينا وليس من شأن الأفعال أن تقوم بنفسها فكانت الصلاة تظهر في غير مصل والصيام في غير صائم والجهاد في غير مجاهد وهو لا يصح فلا بد من ظهورها في المجاهد والمصلي وغير ذلك فإذا ظهرت فيه نسب الله الفعل إليه وجازاه عليه منة منه وفضلا لأنه ما ظهر عين الصلاة إلا في المصلي فلو لم ينسب الفعل إليه لكان قد حافى الخطاب والتكليف ومباهتة للحس وكان لا يوثق بالحس في شي‏ء فحسم الله هذا الأمر بما نسب من هذه الأفعال لمن أظهرها فيه وأضافها إليه وأمرهم بها وليس خلقها لهم وإنما ذلك إلى الله تعالى فانظر ما أعجب هذا الأمر مع ما يتضمنه من التناقض المحقق والايمان بالطريقتين المتناقضتين فيه واجب والاطلاع عليه من باب الكشف مع وجود الايمان به تأييد عظيم وقوة لمن أعطى ذلك فإن في هذا الموطن زل كثير من أهل الكشف وهو قوله وأضله الله على علم والعلم كان لا ينبغي أن يصاحبه الضلال ولا يستلزمه وهنا قد وجد فيه ذلك فلا يخلو إما أن ضل بعلم أو لا بعلم والأمر فيه إشكال ثم إن هذا المنزل يتضمن الجزاء على الأعمال يعني جزاء من ذكرناه في هذا المنزل من الكاتمين لأسرار الحق الذين أمنهم الله عليها مما لا يظهرونها إلا عن إذن إلهي ومن ذكرناه‏\nمن الطوائف معهم فجزاؤهم الجلال والعظمة والهيبة وفي الدنيا الخوف والقبص والوحشة وفي الأحوال الاصطلام وفي المحبة الغليل والاشتياق والشوق والكمد والخشية والتحقق بذلك في كل موطن بحسب ذلك الموطن من الدوام وعدم الدوام إلا أنه في ظهور كونه لا يتخلله غفلة ولا فترة أصلا فإذا زال المقام زال الحال لزواله هذا جزاء من حفظ الأمانة ولم يظهرها إلا بأمر الله وجزاء من أظهرها بإذن الله الإقامة في جوار الله من اسمه الرب لا غيره من الأسماء ومعرفة العلوم التي تتعلق بمن هو تحت حيطته ودون منزلته لا بمن هو فوقه وإن هذه الحالة لهم دائمة والمقام لهم دائم في الدنيا والآخرة ولهم الجمال والأنس ومن الأحوال الرضاء ومن المحبة الوصلة والتعانق والالتذاذ بثم المحبوب وضمه ومن خصائص هذا المنزل إن صاحبه لا يبذل المجهود من نفسه في أعماله بل أعماله دون قوته وطاقته ويقبل الله منه ذلك فإنه ممن اتقى الله حَقَّ تُقاتِهِ ما هو ممن اتقى الله استطاعته وصاحب هذا المقام لا يتصور منه أن يطلب من الحق ما لم يعطه مما هو جائز أن يحصل له ويمنعه من ذلك الحياء من الله حيث لم يبذل المجهود من نفسه فيما كلفه من الأعمال على جهة الندب فهو قانع بما أعطاه ربه ولا يجد حسرة فوت لما فإنه مع علمه بما فاته لأن حاله الالتذاذ في ذلك الوقت بما هو فيه من النعيم وقد بينا أصول هذا المنزل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Eighty-Six: Concerning the Knowledge of the Station of the one to whom it was said, \"Be!\" (Kun), but he refused and thus was not, from the Muhammadan Presence (الحضرة المحمدية)\n\nThe Sun of Annihilation (الفناء) appeared in the *Kāf* of my creation,\nKnowing that by the Light (النور) it would annihilate me.\n\nIt signaled, though I did not know its signal,\nThat by that gesture it intended me.\n\nSo I was the *Wāw* of the Eye of Knowledge (العلم), manifest,\nThe hidden Eye between the *Kāf* and the *Nūn*.\n\nI detailed upon the Tablet (اللوح) crowned secrets,\nWhich the All-Merciful (الرحمن) had made beautiful in the *Nūn*.\n\n### [Annihilation in Witnessing (الفناء في المشاهدة)]\n\nFrom this Station (المنزل), I recorded a section which I named Annihilation in Witnessing (الفناء في المشاهدة). Let us now mention what this Station encompasses regarding the fundamental principles (الأصول) it contains, for elaboration upon it would be lengthy.\n\nKnow that the manifestation (مظهر) of this Station is named the Light (النور), but Lights are of two kinds: a light that has radiance (شعاع) and a scintillating light (نور شعشعاني). If the Theophany (التجلي) occurs within the scintillating light, it takes away the sight (الأبصار). This is what the Messenger of Allah (peace and blessings be upon him) referred to when he was asked, \"O Messenger of Allah, did you see your Lord?\" He replied, \"A Light! How could I see Him?\"\n\nHe says, \"A Light! How could I see Him?\" meaning the scintillating light, for those rays (الأشعة) take away the sight and prevent the perception of the One from whom those rays burst forth. This is also what he (peace and blessings be upon him) referred to when he said: \"Indeed, Allah has seventy veils of Light and Darkness. If He were to remove them, the Sublimities (سبحات) of His Face would burn everything perceived by His sight from His creation.\" The Sublimities here are the Lights of His Reality (حقيقته), for the face of a thing is its reality.\n\nAs for the Light that has no radiance, it is the Light in which the Theophany occurs, yet it has no radiance, and its illumination does not extend beyond itself. The observer perceives it with utmost clarity and distinctness, without doubt. The Presence (الحضرة) in which this is unveiled remains in a state of utmost clarity for the one to whom it is revealed; nothing is hidden from him in perfect purity.\n\nConcerning this Theophany, the Prophet (peace and blessings be upon him) said: \"You will see your Lord just as you see the moon on the night of the full moon.\" Part of what he intends by this simile concerning the vision is the perception of the moon's essence (ذات القمر) due to the weakness of the moon's rays, which prevents the sight from being hindered in perceiving its essence. The correct interpretation is that he means when it is eclipsed on the night of its fullness, for at that time, the sight perceives the essence of the moon, which accepts neither increase nor decrease. This is a verified perception of the moon's essence. Then he said in the same hadith, \"Or just as you see the sun at midday when there is no cloud beneath it.\" At that time, its light is strongest, and all things appear by it, so the sight perceives everything upon which it falls, a perception that occurs when this sun is unveiled to him. If he wished to verify the gaze upon the essence of the sun in this state, he would be unable. Thus, he made the simile to show that this Theophany does not prevent people from seeing one another—meaning, there is no annihilation (فناء). For this reason, he made the simile with the vision of the moon on the night of the full moon and the vision of the sun, and did not restrict it to one of them. He confirmed Subsistence (البقاء) in this Witnessing (المشهد) by his saying: \"You will not be harmed (لا تضارون) nor oppressed (ولا تضامون),\" referring to the oppression and crowding which is jostling, and from harm and injury.\n\nWhen I entered this Station, the Theophany occurred for me in the Light that has no radiance. I saw Him as Knowledge (علماً), and I saw myself by Him, and I saw all things by myself and by the lights (الأنوار) that things carry within their essences (ذواتها), which their realities grant them, not from any light added to that. I saw a great witnessing, sensory, not intellectual, and a true form (صورة حقية), not a mere meaning. In this Theophany, the expansion of the small to allow the entry of the large appeared, while the small remained small and the large remained large, like the camel entering the eye of the needle (سَمِّ الْخِياطِ). This is witnessed sensually, not imaginatively (خيالا). It encompassed it, and you do not know how, nor do you deny what you see. Glory be to Him Who is exalted above the perception of what minds (العقول) can qualify, and Who favors the perception of sight over them. <<لَا إِلَٰهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ>> (There is no god but He, the All-Mighty, the All-Wise). Thus, He demonstrated the incapacity of the minds through this Theophany by which He showed the strength of the sights (الأبصار) and their superiority over the minds. And He demonstrated in His Theophany in the scintillating light the incapacity of the sights and the strength of the minds and their superiority over the sights, so that all may be characterized by incapacity, and The Real (الحق) alone is distinguished by Intrinsic Perfection (الكمال الذاتي).\n\nWhoever witnesses this Station sees wonders and signs (الآيات) that no other station can contain. The beginning of this Station, upon entering it, is that you see yourself as a manifestation (مظهراً) of The Real. When you see Him, you verify within yourself that He is not you. This is the end of the Station. Thus, its beginning involves Witnessing (مشاهدة), and in this Theophany, He addresses you, saying that He is not you, for this is one of the Theophanies that does not annihilate the essence of the Witnesser (عين المشاهدة), combining both vision and address. The end of this Station involves the *Huwa* (He/The Absolute), which is in the Unseen (الغيب) without vision, and this is related to the gaze of the intellect (نظر العقل). So the beginning of this Station is visual, and its end is intellectual, and what lies between them. This Station also encompasses what we shall mention.\n\n### [The Secrets Granted by God to the Servant]\n\nKnow that the secrets (الأسرار) that The Real (الحق) grants His servant among the people of this Path (الطريقة) are of two kinds. Among them are secrets that intrinsically allow you to manifest them in the cosmos (الأكوان) without any restriction upon you, and you do not need a Divine permission (إذن إلهي) to reveal them to others. And secrets that intrinsically do not grant you this permission. These are of two sub-types: one type requires Divine permission for its manifestation. If you manifest it without permission, you will be met with reproach, and restriction and sin will fall upon you for revealing it. I experienced something like this, but praise be to God, I was met with admonishment (العتاب) and not punishment (العقاب), out of God's mercy and care for me. Other secrets The Real does not grant to anyone through mediation. If you sought permission, after The Real informed you of them, to convey them, He would not grant you permission. These are tastes (أذواق) that cannot be known by others merely through expression, for The Real is unique in conveying them directly from The Real to the servant, just as He does with spiritual states (الأحوال). If someone attempted to express the longing (الشوق) he feels for the one he longs for, he would be unable, and the other person would not grasp anything of it unless longing arose within him just as it arose in the speaker. Only then would he know the reality of what this word signifies. Likewise, the pleasure of intercourse, which is forbidden to the impotent man (*al-ʿinnīn*); it is impossible for the one who experiences it to convey it through definition to the impotent man. Similarly, any knowledge related to the senses (الحواس) cannot be reached by the intellect (العقل) on its own, nor by expressing it, unless the other person senses it.\n\nWhat is specific to this Station is the knowledge of the secrets whose manifestation by the one who possesses them and has been granted them depends upon Divine permission. It is also the knowledge of the Divine secrets (الأسرار الإلهية) veiled behind the screen of forms (الصور), which are only revealed to the one who has a clear proof (بينة) from his Lord concerning them. If the proof witnesses for them in the presence of the servant, he accepts it, and thus does not need a witness, unlike in other matters.\n\nWhen the servant attains this station and The Real grants him these secrets, he is granted a Theophany and becomes aware of obscure matters concerning the Knowledge of God (العلم بالله) which he conceals within himself and keeps secret from others, fulfilling the right of the trust (الأمانة) and preserving it, knowing its worth and rank.\n\nThose who attribute some acts to other than God—such as the Mu'tazila, the philosophers, and the polytheists (أهل الشرك) who worshiped others alongside God—also become aware of these secrets with us. They may, at times, be alone with God without their partner, specifically during times of destructive necessity (الضرورات المهلكة) when they realize that their deities cannot avail them anything, so they turn to God for relief. It is from that hidden reality (الحقيقة المستورة) within them, even when they are not under sensory duress from that aspect, that they attain these secrets, even if they are wretched (أشقياء). Their attainment of these secrets only increases their wretchedness, since they knew the One who holds the power (الاقتدار) yet turned away from Him and worked for others whom they and those of their kind set up as gods, and whose incapacity became manifest to them, yet they persisted in their error, as He Almighty said: <<فِي طُغْيَانِهِمْ يَعْمَهُونَ>> (In their transgression, they wander blindly).\n\n### [That God's Proof in His Servants is of Two Kinds]\n\nKnow that God's proof (بينة) in His servants is of two kinds. The first kind is the true proof (البينة الحقيقية), which is His saying, the Almighty: <<أَفَمَنْ كَانَ عَلَى بَيِّنَةٍ مِنْ رَبِّهِ>> (Is he then who is upon a clear proof from his Lord?)—meaning, within himself. As for the one for whom the proof is established in another, he may accept it or he may not. If the one who accepts it does so by imitation (تقليد), it is not a clear sign (آية بينة) for him, and it does not benefit him. Imitation is only valid concerning the rulings (الأحكام) brought by the Messenger, not concerning the proofs and evidences (الشواهد) of his truthfulness. If he does not accept it by imitation, he only accepts it because he himself is <<عَلَى بَيِّنَةٍ مِنْ رَبِّهِ>> (upon a clear proof from his Lord) that this is a clear sign of the truthfulness of the claim of the one through whom it appeared.\n\nFrom this, you know that a thing only benefits you if it is *in* you, and only harms you if it is *in* you. For this reason, we say in much of our discourse that the reality of punishment (العذاب) is the existence of pain *in* you, not its causes, whether the causes occurred in you or in another. We only speak of things that arise for you *from* you. The minimum of this is that you possess the verification (التصديق) that what the people of the path of God verify is true, even if you have not tasted it, and that you do not oppose them. Thus, you are upon a proof from your Lord (بينة من ربك) concerning the necessity of their truthfulness, and by that proof you agree with them. You are thus among them in one of their spiritual drinks (مشرب). For they, too, agree with one another concerning what they verify at the time, even if one has not tasted what his companion has tasted. He acknowledges it and submits to him concerning it, and does not deny it, due to the removal of suspicion.\n\nSitting with these people while opposing them in anything they verify in their innermost beings (سرائرهم) is a great danger and a manifest loss. As one of the masters said—I believe it was Ruwaym—\"Whoever sits with them and opposes them in anything they verify in their innermost beings, God removes the light of faith (نور الايمان) from his heart.\" A person remains in the state he is in until the witness (الشاهد) arises for him to depart from it. Whoever is in a state of concealment (الكتم) conceals, and whoever is in a state of manifestation (الإظهار) manifests and reveals. <<قُلْ كُلٌّ يَعْمَلُ عَلَى شَاكِلَتِهِ فَرَبُّكُمْ أَعْلَمُ بِمَنْ هُوَ أَهْدَى سَبِيلًا>> (Say: Everyone acts according to his own disposition, and your Lord knows best who is rightly guided in the way) among these groups. May God make us and you among those who are <<عَلَى بَيِّنَةٍ مِنْ رَبِّهِ>> (upon a clear proof from his Lord). If a witness follows it, that is good, and an increase in tranquility and strengthening for the soul in its path. If not, being upon a clear proof from his Lord is sufficient.\n\nFor if the one for whom the witness testifies is not upon a clear proof that the witness is truthful in what he testifies to, he will not accept it inwardly. This is like the witness with the claimant: if the claimant is truthful in his claim, he is upon a clear proof within himself from his Lord that he is truthful. But the judge demands a witness. When the witness testifies for him, the one for whom the testimony is given knows that the witness is truthful in his testimony by the proof he possesses that he is upon the truth in his claim. If the claimant is not truthful in his claim, he is upon a clear proof from himself and his Lord that he is not truthful in what he claimed. If the judge demands a witness, and he brings a false witness who testifies that he is truthful in his claim, the claimant is upon a clear proof from himself and his Lord that the witness who testified for him is false and testified to falsehood. He does not accept it inwardly, even if the judge accepts it. The false witness is first discredited by the one for whom he testified, who knows that the matter is contrary to what was testified. For this reason, we said that we do not commit ourselves to the witness, since we do not accept it or verify its truthfulness or falsehood unless we are upon a clear proof from God concerning it. Know this.\n\n### [The Proof is an Ambassador from God to Your Heart]\n\nKnow, after this has been established, that the matter which The Real (الحق) alluded to as being a proof (بينة) for you from Him is an ambassador (سفير) from God to your heart, from His hidden Unseen (خفي غيوبه), specific to you, from the Presence of Divine Address (حضرة الخطاب الإلهي) and the definition from God that it is from Him. Take hold of it, and look at what it accepts, and accept it. Rely upon what it indicates, and negate what it negates. This is what the thinker (صاحب الفكر) does with his evidence (دليله). However, the thinker may take as evidence what is not evidence in reality, or he may take as evidence what is evidence in reality, but due to the limitation of the intellect's power, he is only granted what is within his capacity, so it is never anything other than evidence from the perspective of the intellect.\n\nThe possessor of the proof from his Lord (صاحب البينة من ربه) is upon a light from God and a straight path. He only knows things as they truly are. He only accepts ambiguities (الشبه) as ambiguities of taste (شبها ذوقا) from their form, and it is impossible for him to be confused by them, unlike the people of thoughts (أصحاب الأفكار). What this ambassador grants him includes what is specific to him, what is sought by him and others, and what is sought by others but not granted to him. It does not grant him what is neither for him nor for others. What it grants includes what is permanent (مقيم), like the Stations (المقامات), and what is not permanent (غير مقيم), like the States (الأحوال).\n\nThe people of this Station (المقام) are divided into two types: those who are protected (معصوم) from the influence of their caprice (هواه), and those who are not protected from the influence of their caprice, even though both groups possess verified knowledge (علم محقق). Their proof (بينتهم) informs them that one is protected and his caprice has no sway over him, and that the other is not protected and his caprice has influenced him, due to what preceded in God's knowledge concerning him. Does this knowledge benefit him with God in his happiness (سعادته) or not? In our view, it is beneficial. In the view of others, it is not beneficial. The disagreement in such a matter arises from the existence of Unveiling (الكشف) for the one who finds it, and the absence of Unveiling for the opponent, coupled with reliance on a conflicting matter, whether intellectual or transmitted.\n\nGod Almighty commanded His servants to abide by what He created them for: humility (الذلة) and neediness (الافتقار) toward Him in their inner beings (بواطنهم) generally, and in their outer beings (ظواهرهم) according to a specific method clarified by the Lawgiver. This includes all acts that bring one closer to God, whether they are outwardly accompanied by might (عزة) or humility, Lordship (ربوبية) or servitude (عبودية). This is unlike the inner being, which proceeds according to the verified reality (الأمر المحقق) upon which it intrinsically stands. The outer being proceeds according to what the immediate expediency (المصلحة) requires, whether through you or through another. If Lordship and might appear in the outer being of the Gnostic servant (العبد العارف), as we mentioned, it is for his benefit, for the inclination toward humility and servitude is present in his inner being, and that is what he relies upon. The outward appearance is accidental, especially in the context of obligation (التكليف).\n\nFrom this Station, the servant originates acts as standing forms (صورا قائمة), becoming a creator (خلاقاً) in action, but only of what brings him happiness (السعادة) with God. He continues to originate that form until he sees it standing before him sensually, gazing upon it and rejoicing in it. Everything that appears from that form which necessitates happiness belongs only to the originator of the form, who is this servant. It is like the capital (رأس المال) for him, and what results from it is like the profits (الأرباح). The profits benefit the owner of the capital, not the capital itself.\n\nFrom this Station also appears the Intrinsic Generosity (الجود الذاتي) which cannot be repelled, and in which the servant has no choice. He gives of himself to his Lord what He asked him to give, which He would have given him even if He had not asked for it. This is from God's generosity, for He knew that He must give him that, because it is a matter necessitated by your essence (ذاتك). Yet He asked you for it so that He might reward you for complying with His command in that, just as He asked you concerning what you *can* give and what you *can* refuse. He treated this (intrinsic giving) the same as that (optional giving) out of His generosity, so that the reward for what you gave by His command—which is an intrinsic gift—might stand in opposition to what you withheld and disobeyed His command in—which is not an intrinsic gift but a possible one (إمكانياً), namely all prescribed acts (الأعمال المشروعة).\n\nFor this reason, He commanded you with what you cannot separate yourself from, just as a lamp cannot withhold its light. However, it is conceivable to say to it, \"Give your light to the sights so they may perceive things by it,\" and you are rewarded from that perspective. This is because the Presence of \"Be!\" (حضرة كن) encompasses a spirit (روحاً) and a body (جسماً). They may be connected or not. If they are connected, this body is alive in the form of the *Kāf*, the *Wāw*, and the *Nūn*. If it is alive, what is directed toward it is effected by it, due to the spirit being connected to it, which is the Divine permission (الإذن الإلهي). This is like the breathing of Jesus (peace be upon him) into the bird, accompanied by the Divine permission, which is the Divine breath (النفخ الإلهي). The permissive Divine breath, by which the bird became alive and its spirit connected, was integrated into the physical breath (النفخ الجسماني) residing in Jesus. If the body of *Kun* exists without the spirit connected to it, nothing is effected by it at all, since no action is attributed to the dead, and no ambiguity arises in the mind concerning it, unlike the living. Yet the physical form is the same in both. If the spirit of *Kun* is isolated without its body, things are effected by it, and among those things is the physicality of *Kun*, which is in the world of letters (عالم الحروف).\n\nIf you know what we have clarified for you in this discourse, you will grasp a great matter concerning His saying, the Almighty: <<إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ>> (Indeed, Our word to a thing, when We intend it, is only that We say to it, \"Be!\" and it is). That matter must necessarily come into existence.\n\nThe Real (الحق), glory be to Him, says to His servants in His Glorious Book: <<أَقِيمُوا الصَّلَاةَ وَاصْبِرُوا وَصَابِرُوا وَرَابِطُوا وَجَاهِدُوا>> (Establish the prayer, and be patient, and endure, and stand guard, and strive). Yet none of this occurs [by their own power]. This is because He said to them, \"Create!\" (اخلقوا), and it is not their nature to create. Thus, the body of *Kun* attached itself to them, but not its spirit, so it was dead, and its use was forbidden to them. When the Divine permission (الإذن الإلهي), which is the living *Kun*, attaches itself to the creation of the essence of striving (عين الجهاد), or standing guard (الرباط), or prayer (الصلاة), or anything else from the acts of the servants, it comes into being at the moment it is directed toward us. It is not the nature of acts to subsist by themselves. Thus, prayer would appear without a worshipper, fasting without a faster, and striving without a striver, which is invalid. It must necessarily appear in the striver, the worshipper, and so forth. When it appears in him, God attributes the act to him and rewards him for it, as a favor and grace from Him, because the essence of the prayer only appeared in the worshipper. If He did not attribute the act to him, He would have violated the Address (الخطاب) and the obligation (التكليف) and contradicted the senses (الحس). God resolved this matter by attributing these acts to the one who manifested them in himself and adding them to him, and commanding them with them. Yet the creation of these acts is not theirs, but belongs to God Almighty. Look at how wondrous this matter is, despite the verified contradiction (التناقض المحقق) it contains. Faith in both contradictory methods is obligatory. Awareness of this through Unveiling (الكشف), coupled with faith in it, is a great confirmation and strength for the one who is granted it. For in this domain, many people of Unveiling have stumbled, which is referred to in His saying: <<وَأَضَلَّهُ اللَّهُ عَلَى عِلْمٍ>> (And God led him astray despite his knowledge). Knowledge (العلم) should not be accompanied by error (الضلال) or necessitate it, yet here it is found with it. Thus, he either erred with knowledge or without knowledge, and the matter is problematic.\n\nFurthermore, this Station encompasses the reward for deeds—meaning the reward for those we mentioned in this Station: those who conceal the secrets of The Real (أسرار الحق) whom God entrusted with them, such that they do not reveal them except by Divine permission, and the groups we mentioned alongside them. Their reward is Majesty (الجلال), Grandeur (العظمة), and Awe (الهيبة). In this world, it is Fear (الخوف), Contraction (القبص), and Loneliness (الوحشة). In the States (الأحوال), it is Rapture (الاصطلام). In Love (المحبة), it is Burning Thirst (الغليل), Longing (الاشتياق), Yearning (الشوق), Grief (الكمد), and Reverence (الخشية). This verification occurs in every domain according to that domain, whether permanent or not, except that in its manifestation, it is never interrupted by heedlessness (غفلة) or cessation (فترة) at all. If the Station ceases, the State ceases due to its cessation.\n\nThis is the reward of the one who preserved the trust and did not reveal it except by God's command. The reward of the one who revealed it with God's permission is abiding in the proximity of God (جوار الله) through His Name *al-Rabb* (The Lord) and none other of the Names. It is the knowledge of the sciences related to those under his protection and below his rank, not those above him. This state and station are permanent for them in this world and the Hereafter. They possess Beauty (الجمال) and Intimacy (الأنس). Among the States is Contentment (الرضاء). Among Love is Union (الوصلة), Embracing (التعانق), and delighting in the mouth of the Beloved and holding Him close.\n\nOne of the characteristics of this Station is that its possessor does not exert maximum effort (المجهود) in his deeds; rather, his deeds are below his strength and capacity, and God accepts this from him. For he is among those who fear God <<حَقَّ تُقَاتِهِ>> (with the fear due to Him), not among those who fear God according to their capacity (استطاعته). The possessor of this Station cannot conceive of asking The Real for what He has not given him, even if it is permissible for him to obtain it. Shame (الحياء) before God prevents him from doing so, since he did not exert maximum effort in the supererogatory acts (الندب) with which he was charged. He is content with what his Lord has given him and feels no regret for what he missed, even though he knows what he missed, because his state at that time is delight in the bliss he is currently experiencing. We have explained the fundamentals (أصول) of this Station. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And God speaks the Truth, and He guides to the Way).",
    "ur": "(باب نمبر دو سو چھیاسی: اس منزل کی معرفت میں جسے \"کُن\" کہا گیا تو اس نے انکار کر دیا اور وہ نہ ہوا، یہ منزل حضور محمدیہ (الحضرة المحمدیۃ) سے متعلق ہے)\n\nفنا کا سورج میرے تکوینی \"کاف\" میں طلوع ہوا،\nکیونکہ وہ جانتا تھا کہ وہ مجھے نور کے ذریعے فنا کر دے گا۔\nاور اس نے اشارہ کیا، مگر میں اس کے اشارے کو نہ جان سکا،\nکہ اس اشارے میں وہ مجھے ہی مراد لے رہا ہے۔\nپس میں علم کی عین (ع) کا واؤ تھا، ظاہر،\nاور کاف (ک) اور نون (ن) کے درمیان عین (ع) کا پوشیدہ تھا۔\nمیں نے لوح میں مزین اسرار کو تفصیل سے بیان کیا،\nجنہیں رحمن نے نون (ن) میں خوبصورت بنا دیا تھا۔\n\n### [فنا فی المشاہدہ (الفناء في المشاهدة)]\n\nاسی منزل سے میں نے ایک حصہ مقید کیا جسے میں نے فنا فی المشاہدہ (الفناء في المشاهدة) کا نام دیا۔ اب ہم ان اصولوں کا ذکر کرتے ہیں جو یہ منزل اپنے اندر سموئے ہوئے ہے، کیونکہ اس میں تفصیل طویل ہو جائے گی۔ پس جان لو کہ اس منزل کے مظہر کا نام نور ہے، لیکن انوار دو قسم کے ہیں: ایک وہ نور جس میں شعاع (روشنی کی کرنیں) ہوتی ہے اور دوسرا وہ نور جو شعشعانی (چمکدار، تیز شعاعوں والا) ہوتا ہے۔ شعشعانی نور اگر اس میں ظہور الٰہی (التجلی) واقع ہو تو وہ نگاہوں کو زائل کر دیتا ہے۔ یہی وہ نور ہے جس کی طرف رسول اللہ صلی اللہ علیہ وسلم نے اشارہ فرمایا جب آپ سے پوچھا گیا: \"یا رسول اللہ! کیا آپ نے اپنے رب کو دیکھا؟\" تو آپ صلی اللہ علیہ وسلم نے فرمایا:\n**\"نورانی أراه\"** (وہ نور ہے، میں اسے کیسے دیکھوں؟)\nآپ کا یہ کہنا کہ \"نور ہے، میں اسے کیسے دیکھوں؟\" سے مراد شعشعانی نور ہے، کیونکہ وہ شعاعیں نگاہوں کو زائل کر دیتی ہیں اور اس ذات کے ادراک سے روکتی ہیں جس سے وہ شعاعیں پھوٹتی ہیں۔ یہ وہی ہے جس کی طرف آپ صلی اللہ علیہ وسلم نے اپنے اس قول میں بھی اشارہ فرمایا:\n**\"إن لله سبعين حجابا من نور وظلمة لو كشفها لأحرقت سبحات وجهه ما أدركه بصره من خلقه\"** (بے شک اللہ کے ستر پردے نور اور ظلمت کے ہیں، اگر وہ انہیں کھول دے تو اس کے چہرے کی سبحات (نورانیت) اس کی مخلوق میں سے ہر اس چیز کو جلا ڈالے گی جہاں تک اس کی نگاہ پہنچے گی۔)\nیہاں \"سبحات\" سے مراد اس کی حقیقت کے انوار ہیں۔ کیونکہ کسی شے کا \"وجہ\" (چہرہ) اس کی حقیقت ہوتی ہے۔\n\nاور وہ نور جس میں شعاع نہیں ہوتی، وہ ایسا نور ہے جس میں ظہور الٰہی (التجلی) ہوتا ہے مگر اس میں شعاع نہیں ہوتی اور اس کی روشنی خود سے آگے نہیں بڑھتی۔ دیکھنے والا اسے انتہائی صفائی اور وضاحت کے ساتھ بلا شک ادراک کر لیتا ہے، اور وہ حضور (الحضرة) جس میں یہ کشف (الکشف) پانے والا ہوتا ہے، وہ انتہائی وضاحت میں باقی رہتی ہے، اس سے کوئی چیز پوشیدہ نہیں رہتی، انتہائی صفائی کے ساتھ۔ اور اسی ظہور الٰہی (التجلی) کے بارے میں نبی صلی اللہ علیہ وسلم فرماتے ہیں:\n**\"ترون ربكم كما ترون القمر ليلة البدر\"** (تم اپنے رب کو اسی طرح دیکھو گے جیسے تم چودھویں رات کا چاند دیکھتے ہو۔)\n\nاس تشبیہ سے، جو رؤیت کے ساتھ واقع ہوئی، آپ صلی اللہ علیہ وسلم کی مراد جزوی طور پر چاند کی ذات کا ادراک ہے، کیونکہ چاند کی شعاعیں اتنی کمزور ہوتی ہیں کہ وہ نگاہ کو اس کی ذات کے ادراک سے نہیں روکتیں۔ اور اس بارے میں صحیح بات یہ ہے کہ آپ صلی اللہ علیہ وسلم کی مراد یہ ہے کہ جب چاند چودھویں رات کو گہنا جائے، کیونکہ اس وقت نگاہ چاند کی اس ذات کا ادراک کرتی ہے جو کمی بیشی قبول نہیں کرتی۔ پس یہ چاند کی ذات کا محقق ادراک ہے۔ پھر آپ صلی اللہ علیہ وسلم نے اسی حدیث میں فرمایا:\n**\"أو كما ترون الشمس بالظهيرة ليس دونها سحاب\"** (یا جیسے تم دوپہر کے وقت سورج کو دیکھتے ہو جب اس کے نیچے کوئی بادل نہ ہو۔)\nاس وقت اس کا نور سب سے زیادہ قوی ہوتا ہے، پس تمام اشیاء اس کے ذریعے ظاہر ہوتی ہیں، اور نگاہ ہر اس شے کا ادراک کرتی ہے جو اس پر پڑتی ہے، جب یہ سورج اس کے لیے منکشف ہوتا ہے۔ لیکن اگر وہ اس حالت میں سورج کی ذات کو براہ راست دیکھنے کا ارادہ کرے تو وہ قادر نہیں ہوتا۔ پس آپ صلی اللہ علیہ وسلم نے یہ تشبیہ اس لیے دی کہ یہ ظہور الٰہی (التجلی) لوگوں کو ایک دوسرے کو دیکھنے سے نہیں روکتا، یعنی فنا (الفناء) واقع نہیں ہوتی۔ اسی لیے آپ صلی اللہ علیہ وسلم نے چودھویں رات کے چاند کو دیکھنے اور سورج کو دیکھنے کی تشبیہ دی اور صرف ایک پر اکتفا نہیں کیا، اور اس مشاہدے میں بقا (البقاء) کی تاکید اپنے اس قول سے کی: **\"لا تضارون ولا تضامون\"** (تمہیں نہ کوئی ضرر پہنچے گا اور نہ ہی تم دھکے کھاؤ گے۔)\n\nجب میں اس منزل میں داخل ہوا تو مجھ پر اس نور میں ظہور الٰہی (التجلی) واقع ہوا جس میں شعاع نہیں ہوتی۔ میں نے اسے علم کے طور پر دیکھا، اور میں نے اپنے آپ کو اس کے ذریعے دیکھا، اور میں نے تمام اشیاء کو اپنے آپ سے اور ان انوار سے دیکھا جو اشیاء اپنی ذات میں رکھتی ہیں اور جو انہیں ان کی حقائق (حقائق) عطا کرتے ہیں، نہ کہ کسی زائد نور سے۔ میں نے ایک عظیم مشاہدہ (مشہدا عظیما) دیکھا جو حسی تھا نہ کہ عقلی، اور ایک حقیقی صورت تھی نہ کہ محض معنی۔ اس ظہور الٰہی (التجلی) میں یہ ظاہر ہوا کہ چھوٹی چیز بڑی چیز کے داخل ہونے کے لیے کشادہ ہو جاتی ہے، جبکہ چھوٹی چیز اپنی چھوٹائی پر اور بڑی چیز اپنی بڑائی پر باقی رہتی ہے، جیسے اونٹ سوئی کے ناکے میں داخل ہو جائے۔ **\"كالجمل يلج في سَمِّ الْخِياطِ\"** (جیسے اونٹ سوئی کے ناکے میں داخل ہو جائے)۔ یہ مشاہدہ حسی طور پر ہوتا ہے نہ کہ خیالی طور پر، اور اس نے اسے اپنے اندر سمو لیا ہے، اور تم نہیں جانتے کہ کیسے، اور تم اس کا انکار نہیں کرتے جو تم دیکھتے ہو۔ پس پاک ہے وہ ذات جو ان ادراکات سے بلند ہے جنہیں عقلیں کیفیت دیتی ہیں، اور جس نے نگاہ کے ادراک کو عقلوں کے ادراک پر فضیلت دی۔ **\"لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ\"** (کوئی معبود نہیں سوائے اس کے، وہ غالب ہے، حکمت والا ہے)۔ پس اس نے اس ظہور الٰہی (التجلی) کے ذریعے عقلوں کی عاجزی کو ظاہر کیا، جس کے ذریعے اس نے نگاہوں کی قوت اور عقلوں پر ان کی فضیلت کو ظاہر کیا۔ اور اپنے شعشعانی نور میں ظہور الٰہی (التجلی) کے ذریعے اس نے نگاہوں کی عاجزی اور عقلوں کی قوت اور ان کی نگاہوں پر فضیلت کو ظاہر کیا، تاکہ سب عاجزی سے متصف ہوں اور ذات حق (الحق) کمال ذاتی کے ساتھ منفرد ہو۔ جو شخص اس منزل کا مشاہدہ (عاین) کرتا ہے، وہ ایسی عجائبات اور آیات دیکھتا ہے جو کوئی دوسرا احاطہ نہیں کر سکتا۔ اس منزل کا آغاز یہ ہے کہ جب تم اس میں داخل ہوتے ہو تو اپنے آپ کو ذات حق (الحق) کا مظہر دیکھتے ہو، اور جب تم اسے دیکھتے ہو تو اپنے آپ سے یہ تحقیق کرتے ہو کہ وہ تم نہیں ہو، اور یہی اس منزل کا اختتام ہے۔ پس اس کا آغاز مشاہدہ (مشاہدۃ) کو شامل ہے، اور اس ظہور الٰہی (التجلی) میں وہ تم سے مخاطب ہوتا ہے کہ وہ تم نہیں ہو، کیونکہ یہ ان ظہورات الٰہیہ (التجلیات) میں سے ہے جو مشاہدہ (المشاھدۃ) کی عینیت کو فنا (الفناء) نہیں کرتیں، پس یہ رؤیت اور خطاب کو جمع کرتی ہے۔ اور اس منزل کا اختتام \"ھو\" (وہ) کو شامل ہے، اور وہ غیب میں ہوتا ہے بغیر رؤیت کے، اور یہ عقل کی نظر سے متعلق ہے۔ پس اس منزل کا آغاز بصری ہے اور اس کا اختتام عقلی ہے، اور جو کچھ ان کے درمیان ہے، یہ منزل اسے بھی شامل کرتی ہے جس کا ہم ذکر کریں گے۔\n\n### [وہ اسرار جو اللہ بندے کو عطا کرتا ہے]\n\nجان لو کہ وہ اسرار جو ذات حق (الحق) اس طریقے کے اہل اپنے بندے کو عطا کرتا ہے، وہ دو قسم کے ہیں: ان میں سے کچھ اسرار ایسے ہیں جو اپنی ذات کے اعتبار سے تمہیں یہ اجازت دیتے ہیں کہ تم انہیں کائنات میں ظاہر کر دو، اور اس میں تم پر کوئی حرج نہیں ہوتا، اور تمہیں انہیں دوسروں کے لیے ظاہر کرنے کے لیے کسی الٰہی اذن کی ضرورت نہیں ہوتی۔ اور کچھ اسرار ایسے ہیں جو اپنی ذات کے اعتبار سے تمہیں یہ حکم نہیں دیتے۔ اور یہ بھی دو قسم کے ہیں: ایک قسم وہ ہے جس کے اظہار کے لیے تمہیں الٰہی اذن کی ضرورت ہوتی ہے، پس اگر تم نے بغیر اذن کے اسے ظاہر کیا تو تمہارا محاسبہ کیا جائے گا اور تم پر اس کے اظہار میں حرج اور گناہ واقع ہو گا۔ میرے ساتھ بھی ایسا ہی ہوا، لیکن اللہ کے فضل سے میرا محاسبہ عتاب (سرزنش) کی صورت میں ہوا نہ کہ عقاب (سزا) کی صورت میں، یہ مجھ پر اللہ کی رحمت اور عنایت تھی۔ اور دوسرے اسرار وہ ہیں جو ذات حق (الحق) کسی کو واسطے کے ذریعے عطا نہیں کرتا۔ پس اگر تم نے ان کے بارے میں اذن طلب کیا، جب ذات حق (الحق) تمہیں ان پر مطلع کر دے، کہ تم انہیں دوسروں تک پہنچاؤ، تو تمہیں اذن نہیں دیا جائے گا، کیونکہ یہ ایسے اذواق ہیں جنہیں تم محض عبارت کے ذریعے کسی دوسرے کو نہیں سمجھا سکتے۔ یہ ان چیزوں میں سے ہیں جنہیں ذات حق (الحق) براہ راست حق سے بندے تک پہنچانے میں منفرد ہے، جیسا کہ وہ احوال (الأحوال) کے ساتھ کرتا ہے۔ اگر کوئی شخص اس شوق کو بیان کرنا چاہے جو وہ اپنے مشتاق کے لیے محسوس کرتا ہے، تو وہ اس کی طاقت نہیں رکھتا اور نہ ہی دوسرا اس میں سے کچھ سمجھ سکتا ہے، مگر یہ کہ شوق اس کے ساتھ بھی اسی طرح قائم ہو جائے جیسا کہ اس کے ساتھی کے ساتھ قائم ہوا ہے، تب وہ اس لفظ کے مسمیٰ کی حقیقت کو جانتا ہے۔ اور اسی طرح وہ چیزیں جو اس کے معنی میں ہیں، جیسے جماع کی لذت، جو نامرد پر حرام ہے، وہ شخص جس کے ساتھ یہ قائم ہو، وہ اسے تعریف کے ذریعے نامرد تک نہیں پہنچا سکتا۔ اور اسی طرح ہر وہ علم جو حواس سے متعلق ہو، عقل کے لیے ممکن نہیں کہ وہ اسے خود سے یا اس کی عبارت کے ذریعے جان سکے، مگر یہ کہ دوسرا شخص اسے محسوس کرے۔ پس اس منزل کی خصوصیت ان اسرار کی معرفت ہے جن کا اظہار اس شخص کے لیے، جس کے ساتھ وہ قائم ہوئے ہیں اور جسے وہ عطا کیے گئے ہیں، الٰہی اذن پر موقوف ہے۔ اور ان الٰہی اسرار کی معرفت جو صورتوں کے پردے کے پیچھے پوشیدہ ہیں، جو صرف اس شخص پر ظاہر ہوتے ہیں جو اپنے رب کی طرف سے اس بارے میں واضح دلیل (بینۃ) پر ہو۔ پس جب بندہ اس دلیل (البینۃ) کا مشاہدہ کرتا ہے تو وہ اسے قبول کر لیتا ہے، اور اسے کسی گواہ کی ضرورت نہیں ہوتی جیسا کہ دوسروں میں ہوتی ہے۔ جب بندہ اس مقام پر فائز ہو جاتا ہے اور ذات حق (الحق) اسے یہ اسرار عطا کرتا ہے، تو وہ ظہور الٰہی (التجلی) عطا کرتا ہے اور وہ اللہ کے علم کے ان پوشیدہ امور پر مطلع ہوتا ہے جنہیں اس نے اپنی ذات میں چھپا رکھا ہے اور دوسروں سے پوشیدہ رکھا ہے، امانت کے حق کو پورا کرتے ہوئے اور اس کی حفاظت کرتے ہوئے اور اس کے قدر و منزلت کو جانتے ہوئے۔\n\nہمارے ساتھ ان اسرار پر وہ لوگ بھی مطلع ہوتے ہیں جو بعض افعال کو اللہ کے علاوہ دوسروں کی طرف منسوب کرتے ہیں، جیسے معتزلہ، فلاسفہ، اور اہل شرک جنہوں نے اللہ کی عبادت کے ساتھ دوسروں کی بھی عبادت کی۔ یہ لوگ بعض اوقات اپنے شریک کو چھوڑ کر اللہ کے ساتھ تنہا ہوتے ہیں، اور یہ مہلک ضرورتوں کے اوقات ہوتے ہیں جن میں وہ یقین کر لیتے ہیں کہ ان کے معبود ان کے لیے کچھ نہیں کر سکتے، پس وہ انہیں دور کرنے کے لیے اللہ کی طرف رجوع کرتے ہیں۔ پس ان میں پوشیدہ اس حقیقت کی بنا پر، اس حالت میں جب وہ اس پہلو سے حسی اضطرار کے تحت نہیں ہوتے، وہ یہ اسرار حاصل کر لیتے ہیں، اگرچہ وہ بدبخت ہی کیوں نہ ہوں۔ ان کا ان اسرار کو حاصل کرنا ان کی بدبختی میں اضافہ کرتا ہے، کیونکہ انہوں نے اس ذات کو پہچان لیا جس کے ہاتھ میں قدرت ہے، پھر بھی اس سے منہ موڑ لیا اور اس کے علاوہ دوسروں کے لیے عمل کیا جنہیں انہوں نے اپنے ہاتھوں سے یا اپنی جنس کے لوگوں کے ہاتھوں سے معبود بنا رکھا تھا، اور ان کی عاجزی ان پر ظاہر ہو چکی تھی، پھر بھی وہ اپنی گمراہی پر ڈٹے رہے، جیسا کہ اللہ تعالیٰ نے فرمایا:\n**\"فِي طُغْيَانِهِمْ يَعْمَهُونَ\"** (وہ اپنی سرکشی میں بھٹکتے پھرتے ہیں۔)\n\n### [کہ اللہ کی دلیل (بینۃ) اس کے بندوں میں دو قسم کی ہے]\n\nاور جان لو کہ اللہ کی دلیل (بینۃ) اس کے بندوں میں دو قسم کی ہے۔ پہلی قسم حقیقی دلیل (البینۃ الحقیقیۃ) ہے، اور وہ اللہ تعالیٰ کا یہ قول ہے:\n**\"أَ فَمَنْ كانَ عَلى‏ بَيِّنَةٍ من رَبِّهِ\"** (کیا پس وہ شخص جو اپنے رب کی طرف سے ایک واضح دلیل پر ہو) یعنی اپنی ذات میں۔\nاور وہ شخص جس کے لیے دلیل (البینۃ) کسی دوسرے میں قائم کی جائے، تو ممکن ہے کہ وہ اسے قبول کرے اور ممکن ہے کہ وہ اسے قبول نہ کرے۔ اور جو شخص اسے قبول کرتا ہے، اگر وہ اسے تقلیداً قبول کرتا ہے، تو وہ اس کے حق میں واضح آیت (آیۃ بینۃ) نہیں ہوتی اور اسے کوئی فائدہ نہیں دیتی۔ تقلید صرف ان احکام میں ہوتی ہے جو رسول لاتے ہیں، نہ کہ ان دلائل اور شواہد میں جو ان کی سچائی پر ہوتے ہیں۔ اور اگر وہ اسے تقلیداً قبول نہیں کرتا، تو اس نے اسے صرف اس لیے قبول کیا ہے کہ وہ خود اپنے رب کی طرف سے ایک واضح دلیل (بَیِّنَةٍ من رَبِّهِ) پر ہے کہ یہ اس دعوے کی سچائی پر ایک واضح آیت ہے جو اس شخص کے ہاتھ پر ظاہر ہوئی جس نے دعویٰ کیا تھا۔ پس تم نے اس سے جان لیا کہ کوئی چیز تمہیں فائدہ نہیں دے گی جب تک وہ تم میں نہ ہو، اور نہ ہی تمہیں نقصان پہنچائے گی جب تک وہ تم میں نہ ہو۔ اسی لیے ہم اپنی بہت سی باتوں میں کہتے ہیں کہ عذاب کی حقیقت تم میں درد کا پایا جانا ہے، نہ کہ اس کے اسباب، خواہ وہ اسباب تم میں واقع ہوں یا کسی اور میں۔ پس ہم اشیاء کے بارے میں صرف یہی کہتے ہیں کہ وہ تمہارے لیے تم سے قائم ہوں، اور کم از کم یہ کہ تمہارے اندر اس بات کی تصدیق قائم ہو جائے جس کی تحقیق اہل طریق اللہ کے لیے کرتے ہیں کہ وہ حق ہے، اگرچہ تم نے اس کا ذوق نہ چکھا ہو، اور تم ان کی مخالفت نہ کرو۔ پس تم اپنے رب کی طرف سے ایک دلیل (بینۃ) پر ہو گے، اور ان کے صادق ہونے میں کوئی شک نہیں، اور اس دلیل (البینۃ) کے ذریعے جو تم پر ہے، تم اس میں ان سے موافقت کرتے ہو۔ پس تم ان کے مشارب (پینے کی جگہوں) میں سے کسی ایک مشرب میں ان کے ساتھ ہو۔ کیونکہ وہ بھی ان لوگوں میں سے ہیں جو اس چیز میں ایک دوسرے سے موافقت کرتے ہیں جس کی وہ وقت میں تحقیق کرتے ہیں، اگرچہ وہ اسے ذوقاً ادراک نہ کرے جو اس کے ساتھی نے ادراک کیا ہے، تو وہ اس کے لیے اس کا اقرار کرتا ہے اور اسے تسلیم کرتا ہے، اور اس کا انکار نہیں کرتا، کیونکہ تہمت کا احتمال ختم ہو جاتا ہے۔\n\nاور ان اقوام کی صحبت میں بیٹھنا جو ان پر ایمان نہیں رکھتے، ایک بہت بڑا خطرہ اور کھلا نقصان ہے، جیسا کہ بعض سادات نے کہا ہے، اور میرا خیال ہے کہ وہ رویم (Ruwaim) تھے، کہ جو شخص ان کے ساتھ بیٹھا اور ان چیزوں میں سے کسی ایک کی بھی مخالفت کی جن کی وہ اپنے باطن میں تحقیق کرتے ہیں، تو اللہ اس کے دل سے ایمان کا نور نکال لیتا ہے۔ انسان اسی حالت پر رہتا ہے جس پر وہ ہے، یہاں تک کہ اس کے لیے اس سے نکلنے کا گواہ قائم ہو جائے۔ پس جو کتمان (چھپانے) کی حالت میں ہو وہ چھپائے، اور جو اظہار کی حالت میں ہو وہ ظاہر کرے اور افشا کرے۔\n**\"قُلْ كُلٌّ يَعْمَلُ عَلى‏ شاكِلَتِهِ فَرَبُّكُمْ أَعْلَمُ بِمَنْ هُوَ أَهْدى‏ سَبِيلًا\"** (کہہ دو کہ ہر کوئی اپنی ساخت کے مطابق عمل کرتا ہے، پس تمہارا رب اس شخص کو زیادہ جانتا ہے جو زیادہ ہدایت یافتہ راستے پر ہے۔)\nاللہ ہمیں اور آپ کو ان لوگوں میں شامل کرے جو اپنے رب کی طرف سے دلیل (بَیِّنَةٍ من رَبِّهِ) پر ہیں۔ اگر اس کے بعد کوئی گواہ بھی آ جائے تو یہ اچھا ہے اور نفس کے لیے مزید اطمینان اور تقویت کا باعث ہے اس راستے میں جس پر وہ ہے۔ اور اگر ایسا نہ ہو تو اس کا اپنے رب کی طرف سے دلیل (بینۃ) پر ہونا ہی کافی ہے۔ کیونکہ اگر گواہ میں وہ شخص جس کے لیے گواہی دی جا رہی ہے، اس بات پر دلیل (بینۃ) نہ رکھتا ہو کہ وہ اپنی گواہی میں سچا ہے، تو وہ اسے اپنے باطن میں قبول نہیں کرتا۔ جیسے دعویٰ کرنے والے کے ساتھ گواہ کا معاملہ ہوتا ہے، اگر وہ اپنے دعوے میں حق پر ہے، تو وہ اپنے رب کی طرف سے اپنے نفس میں دلیل (بینۃ) پر ہے کہ وہ سچا ہے، لیکن حاکم اس سے گواہ کا مطالبہ کرتا ہے۔ پس جب گواہ اس کے حق میں گواہی دیتا ہے، تو جس کے لیے گواہی دی گئی ہے، وہ اپنی اس دلیل (بینۃ) سے جان لیتا ہے جو اس پر ہے کہ گواہ اپنی گواہی میں سچا ہے کہ وہ اپنے دعوے میں حق پر ہے۔ اور اگر مدعی اپنے دعوے میں سچا نہیں ہے، تو وہ اپنے نفس اور اپنے رب کی طرف سے دلیل (بینۃ) پر ہے کہ وہ اپنے دعوے میں سچا نہیں ہے۔ پس جب حاکم اس سے گواہ کا مطالبہ کرتا ہے اور وہ جھوٹا گواہ لاتا ہے جو اس کے حق میں گواہی دیتا ہے کہ وہ اپنے دعوے میں سچا ہے، تو مدعی اپنے نفس اور اپنے رب کی طرف سے دلیل (بینۃ) پر ہے کہ اس کے حق میں گواہی دینے والا گواہ جھوٹا ہے اور اس نے باطل کی گواہی دی ہے، اور وہ اسے اپنے نفس میں قبول نہیں کرتا، اگرچہ حاکم اسے قبول کر لے۔ پس جھوٹے گواہ کو سب سے پہلے وہ شخص مجروح کرتا ہے جس کے حق میں اس نے گواہی دی ہے، کیونکہ جس کے حق میں گواہی دی گئی ہے وہ جانتا ہے کہ معاملہ اس کے خلاف ہے جس کی گواہی دی گئی ہے۔ اسی لیے ہم نے کہا کہ ہم گواہ کو لازم نہیں سمجھتے، کیونکہ ہم اسے قبول نہیں کرتے اور نہ ہی اس کی سچائی یا جھوٹ کی تحقیق کرتے ہیں، مگر یہ کہ اس معاملے میں اللہ کی طرف سے دلیل (بینۃ) ہو۔ پس یہ جان لو۔\n\n### [دلیل (بینۃ) اللہ کی طرف سے تمہارے دل کا سفیر ہے]\n\nاور یہ بات طے ہو جانے کے بعد جان لو کہ وہ امر جس کے بارے میں ذات حق (الحق) نے کنایہ کیا ہے کہ وہ تمہارے لیے اس کی طرف سے دلیل (بینۃ) ہے، وہ اللہ کی طرف سے تمہارے دل کی طرف ایک سفیر ہے، جو اس کے پوشیدہ غیبوں سے خاص طور پر تمہارے لیے ہے، جو الٰہی خطاب (الخطاب الإلهي) کے حضور سے ہے اور اللہ کی طرف سے یہ تعریف ہے کہ یہ اس کی طرف سے ہے۔ پس اسے لے لو اور دیکھو کہ وہ کس چیز کو قبول کرتا ہے تو اسے قبول کرو، اور جس چیز کی طرف وہ رہنمائی کرتا ہے اس پر بھروسہ کرو، اور جس کی وہ نفی کرتا ہے اس کی نفی کرو، جیسا کہ صاحب فکر اپنی دلیل میں کرتا ہے۔ فرق صرف یہ ہے کہ صاحب فکر کبھی ایسی چیز کو دلیل بنا لیتا ہے جو حقیقت میں دلیل نہیں ہوتی، اور کبھی ایسی چیز کو دلیل بنا لیتا ہے جو حقیقت میں دلیل ہوتی ہے، لیکن عقل کی قوت کے لحاظ سے، اسے وہی دیا گیا ہے جو اس کی قوت میں ہے۔ پس وہ کبھی بھی عقل ہونے کے ناطے یہ نہیں جانتا کہ وہ دلیل ہے یا نہیں۔ اور وہ شخص جو اپنے رب کی طرف سے دلیل (بینۃ) پر ہوتا ہے، وہ اللہ کے نور اور صراط مستقیم پر ہوتا ہے، وہ اشیاء کو صرف اسی طرح جانتا ہے جس طرح وہ اشیاء ہوتی ہیں۔ وہ شبہات کو قبول نہیں کرتا، مگر ذوقی شبہات کو ان کی صورت سے، جن میں وہ اس پر التباس نہیں ڈال سکتے، برخلاف اصحاب افکار کے۔ اور یہ سفیر اسے جو کچھ عطا کرتا ہے، اس میں سے کچھ وہ ہوتا ہے جو اس کے ساتھ خاص ہوتا ہے، اور کچھ وہ ہوتا ہے جو اس کے اور دوسروں کے لیے مطلوب ہوتا ہے، اور کچھ وہ ہوتا ہے جو دوسروں کے لیے مطلوب ہوتا ہے اور اسے عطا نہیں کیا جاتا جو نہ اس کے لیے ہے اور نہ دوسروں کے لیے۔ اور جو کچھ وہ اسے عطا کرتا ہے، اس میں سے کچھ اس کے لیے مقیم (دائمی) ہوتا ہے اور کچھ غیر مقیم (عارضی) ہوتا ہے۔ پس مقیم مقامات (المقامات) کی طرح ہے اور غیر مقیم احوال (الأحوال) کی طرح ہے۔\n\nپھر اس مقام کے حاملین اس میں تقسیم ہو جاتے ہیں اور دو قسموں میں بٹ جاتے ہیں: ان میں سے کچھ وہ ہیں جنہیں ان کی خواہش نفس (ہوا) کے اثر سے بچا لیا جاتا ہے، اور کچھ وہ ہیں جنہیں ان کی خواہش نفس کے اثر سے نہیں بچایا جاتا، حالانکہ دونوں گروہوں میں سے ہر ایک محقق علم پر ہوتا ہے۔ ان کی دلیل (بینۃ) جو ان پر ہے، وہ یہ ہے کہ وہ معصوم ہے اور اس کی خواہش نفس کا اس پر کوئی راستہ نہیں، اور یہ کہ وہ معصوم نہیں ہے اور اس کی خواہش نفس نے اس پر اثر ڈالا ہے، اس علم الٰہی کی بنا پر جو اس کے بارے میں پہلے سے موجود تھا۔ اور کیا یہ علم اللہ کے ہاں اس کی سعادت میں اسے فائدہ دے گا یا نہیں؟ ہمارے نزدیک یہ فائدہ مند ہے، اور ہمارے علاوہ دوسروں کے نزدیک یہ فائدہ مند نہیں ہے۔ اور اس طرح کے مسئلے میں اختلاف اس لیے واقع ہوا کہ پانے والے کے پاس کشف (الکشف) موجود ہے اور مخالف کے پاس کشف موجود نہیں، جبکہ وہ کسی معارض امر پر بھروسہ کرتا ہے، خواہ وہ عقلی ہو یا سمعی۔\n\nپھر اللہ تعالیٰ نے اپنے بندوں کو اس چیز پر قائم رہنے کا حکم دیا جس کے لیے اس نے انہیں پیدا کیا ہے، یعنی ان کے باطن میں عمومی طور پر اس کے لیے ذلت اور محتاجی، اور ان کے ظاہر میں ایک مخصوص طریقے پر جس کی وضاحت شارع نے ان کے لیے کی ہے، اور وہ تمام افعال ہیں جو اللہ کا قرب دلاتے ہیں، خواہ وہ ظاہری صورت میں عزت یا ذلت، اور ربوبیت یا عبودیت کے ساتھ منسلک ہوں، برخلاف باطن کے۔ کیونکہ باطن اس محقق امر پر چلتا ہے جس پر وہ اپنی ذات میں ہے، اور ظاہر اس چیز پر چلتا ہے جو وقت کی مصلحت کا تقاضا ہو، خواہ تمہارے ساتھ ہو یا تمہارے علاوہ کسی اور کے ساتھ۔ پس اگر عارف بندے کے ظاہر میں ربوبیت اور عزت ظاہر ہو، جیسا کہ ہم نے ذکر کیا، تو یہ اس کی مصلحت کے لیے ہے، کیونکہ باطن میں ذلت اور عبودیت کی طرف میلان اس کے ہاں موجود ہے اور اسی پر بھروسہ کیا جاتا ہے، اور یہ ایک عارضی امر ہے، خاص طور پر تکلیف (شرعی ذمہ داری) کے مقام پر۔ اور اسی منزل سے بندہ اعمال کو قائم صورتوں میں پیدا کرتا ہے، جس میں وہ بالفعل خالق ہوتا ہے، لیکن یہ وہ چیز ہے جس سے اسے اللہ کے ہاں سعادت حاصل ہوتی ہے۔ پس وہ اس صورت کو پیدا کرتا رہتا ہے یہاں تک کہ وہ اسے اپنے سامنے حسی طور پر قائم دیکھتا ہے، وہ اسے دیکھتا ہے اور اس سے خوش ہوتا ہے۔ اور اس صورت سے جو کچھ بھی ظاہر ہوتا ہے جو سعادت کا تقاضا کرتا ہے، وہ صرف اس صورت کو پیدا کرنے والے کے لیے ہوتا ہے، اور وہ یہی بندہ ہے۔ پس یہ اس کے لیے اصل سرمایہ کی طرح ہے، اور جو کچھ اس سے حاصل ہوتا ہے وہ منافع کی طرح ہے، اور منافع کا فائدہ صرف مال کے مالک کو ہوتا ہے نہ کہ خود مال کو۔\n\nاور اسی منزل سے وہ جود ذاتی (الجود الذاتی - اندرونی سخاوت) بھی ظاہر ہوتا ہے جسے دفع کرنا ممکن نہیں، اس میں بندے کا کوئی اختیار نہیں ہوتا۔ پس وہ اپنے رب کو اپنی ذات سے وہ چیز عطا کرتا ہے جس کے بارے میں اس نے اسے عطا کرنے کا سوال کیا تھا، حالانکہ اگر وہ سوال نہ بھی کرتا تو وہ اسے عطا کر دیتا۔ اور یہ اللہ کے کرم میں سے ہے، کیونکہ وہ جانتا تھا کہ وہ اسے ضرور عطا کرے گا، کیونکہ یہ ایک ایسا امر ہے جو تمہاری ذات کا تقاضا ہے۔ پس اس نے تم سے اس بارے میں سوال کیا تاکہ تمہیں اس کے حکم کی تعمیل پر جزا دے، جیسا کہ اس نے تم سے ان چیزوں کے بارے میں سوال کیا جو تم دے سکتے ہو اور جن سے تم انکار کر سکتے ہو۔ پس اس نے اس کو اس کے برابر کر دیا، یہ اس کی طرف سے سخاوت ہے۔ اور تاکہ اس چیز کی جزا قائم ہو جائے جو تم نے اس کے حکم پر عطا کی، جو کہ عطائے ذاتی ہے، اس چیز کے مقابلے میں جس سے تم نے منع کیا اور اس کے حکم کی مخالفت کی، جو کہ عطائے ذاتی نہیں بلکہ امکانی ہے، اور وہ تمام شرعی اعمال ہیں۔ اسی لیے اس نے تمہیں اس چیز کا حکم دیا جس سے تم الگ نہیں ہو سکتے، جیسا کہ چراغ کے لیے ممکن نہیں کہ وہ اپنی روشنی کو روکے، لیکن یہ تصور کیا جا سکتا ہے کہ اسے کہا جائے کہ اپنی روشنی نگاہوں کو دے تاکہ وہ اس کے ذریعے اشیاء کا ادراک کریں، پس تمہیں اس لحاظ سے جزا دی جائے۔\n\nاور وہ یہ ہے کہ تم جان لو کہ حضور \"کُن\" (حضرة كن) ایک روح اور ایک جسم کو شامل ہے، اور کبھی وہ دونوں جڑے ہوتے ہیں اور کبھی نہیں جڑتے۔ جب وہ جڑے ہوتے ہیں تو یہ جسم \"کاف\"، \"واؤ\" اور \"نون\" کی اس صورت پر زندہ ہوتا ہے۔ اور جب وہ زندہ ہوتا ہے تو اس سے وہ چیزیں صادر ہوتی ہیں جو اس پر متوجہ کی جاتی ہیں، اس میں روح کے جڑے ہونے کی وجہ سے، اور وہ الٰہی اذن (الأذن الإلهي) ہے۔ جیسے عیسیٰ علیہ السلام کا پرندے میں پھونکنا، جو الٰہی اذن کے ساتھ تھا جو کہ نفخ الٰہی ہے۔ پس وہ الٰہی اذنی نفخ، جس سے پرندہ زندہ ہوا اور اس کی روح جڑ گئی، عیسیٰ علیہ السلام کے جسمانی نفخ میں شامل ہو گیا۔ اور جب \"کُن\" کا جسم روح کے جڑے بغیر پایا جائے تو اس سے کوئی چیز صادر نہیں ہوتی، کیونکہ مردہ سے کوئی فعل منسوب نہیں کیا جاتا، اور عقل کے لیے اس میں کوئی شبہ نہیں ہوتا، برخلاف زندہ کے، حالانکہ جسمانی صورت دونوں میں ایک ہی ہوتی ہے۔ اور جب \"کُن\" کی روح اس کے جسم کے بغیر منفرد ہو، تو اس سے اشیاء صادر ہوتی ہیں، اور ان اشیاء میں سے \"کُن\" کا جسم بھی ہے جو عالم حروف میں ہے۔\n\nپس جب تم نے وہ جان لیا جو ہم نے تمہیں اس کلام میں واضح کیا، تو تم اللہ تعالیٰ کے اس قول کے ایک عظیم امر پر واقف ہو گئے:\n**\"إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ\"** (ہم جب کسی چیز کا ارادہ کرتے ہیں تو ہمارا کہنا صرف یہ ہوتا ہے کہ ہم اسے کہتے ہیں: \"ہو جا\"، پس وہ ہو جاتی ہے۔)\nاور ذات حق (الحق) اپنے بندوں سے اپنے کلام عزیز میں فرماتا ہے:\n**\"أَقِيمُوا الصَّلاةَ واصْبِرُوا وصابِرُوا ورابِطُوا وجاهِدُوا\"** (نماز قائم کرو، اور صبر کرو، اور صبر میں ثابت قدم رہو، اور سرحدوں پر پہرہ دو، اور جہاد کرو۔)\nاور ان میں سے کوئی چیز واقع نہیں ہوتی، کیونکہ اس نے انہیں کہا کہ \"خلق کرو\"، اور خلق کرنا ان کا کام نہیں ہے۔ پس ان کے ساتھ \"کُن\" کا جسم جڑ گیا، نہ کہ اس کی روح، پس وہ مردہ تھی اور ان پر اس کا استعمال حرام تھا۔ پس جب الٰہی اذن، جو کہ زندہ \"کُن\" ہے، جہاد یا رباط یا نماز یا بندوں کے افعال میں سے کسی بھی چیز کی عینیت کو وجود میں لانے کے ساتھ جڑتا ہے، تو وہ ہم پر متوجہ ہونے کے وقت وجود میں آتی ہے۔ اور افعال کا یہ کام نہیں کہ وہ خود سے قائم ہو جائیں۔ پس نماز غیر نمازی میں ظاہر ہوتی، اور روزہ غیر روزہ دار میں، اور جہاد غیر مجاہد میں، اور یہ صحیح نہیں ہے۔ پس ضروری ہے کہ وہ مجاہد اور نمازی وغیرہ میں ظاہر ہو۔ پس جب وہ اس میں ظاہر ہوتی ہے، تو اللہ اس فعل کو اس کی طرف منسوب کرتا ہے اور اس پر اسے جزا دیتا ہے، یہ اس کی طرف سے احسان اور فضل ہے۔ کیونکہ نماز کی عینیت نمازی کے علاوہ کسی میں ظاہر نہیں ہوئی۔ پس اگر وہ فعل کو اس کی طرف منسوب نہ کرتا، تو یہ خطاب اور تکلیف کے ساتھ بے انصافی ہوتی اور حس کے ساتھ دھوکہ ہوتا، اور حس پر کسی چیز میں بھروسہ نہ کیا جاتا۔ پس اللہ نے اس امر کو اس طرح ختم کیا کہ ان افعال کو اس شخص کی طرف منسوب کیا جس میں وہ ظاہر ہوئے اور انہیں اس کی طرف منسوب کیا اور ان کا حکم دیا، حالانکہ ان کا خلق کرنا ان کا کام نہیں ہے، بلکہ یہ اللہ تعالیٰ کا کام ہے۔ پس دیکھو یہ کتنا عجیب امر ہے، باوجود اس کے کہ یہ محقق تضاد کو شامل ہے، اور اس میں دونوں متضاد طریقوں پر ایمان لانا واجب ہے۔ اور کشف (الکشف) کے ذریعے اس پر مطلع ہونا، اس پر ایمان کے ساتھ، اس شخص کے لیے عظیم تائید اور قوت ہے جسے یہ عطا کیا گیا ہے۔ کیونکہ اس مقام پر اہل کشف (الکشف) میں سے بہت سے لوگ پھسل گئے ہیں، اور وہ اللہ کا یہ قول ہے: **\"وَأَضَلَّهُ اللَّهُ عَلَى عِلْمٍ\"** (اور اللہ نے اسے علم کے باوجود گمراہ کر دیا)۔ اور علم کو گمراہی کا ساتھی نہیں ہونا چاہیے اور نہ ہی اسے لازم کرنا چاہیے، اور یہاں اس میں یہ پایا گیا ہے۔ پس یہ خالی نہیں کہ یا تو وہ علم کے ساتھ گمراہ ہوا یا بغیر علم کے، اور یہ معاملہ مشکل ہے۔\n\nپھر یہ منزل اعمال کی جزا کو بھی شامل کرتی ہے، یعنی ان لوگوں کی جزا جن کا ہم نے اس منزل میں ذکر کیا، جو ذات حق (الحق) کے اسرار کو چھپانے والے ہیں جن پر اللہ نے انہیں امین بنایا ہے اور جو انہیں صرف الٰہی اذن کے بغیر ظاہر نہیں کرتے، اور ان گروہوں کی جزا جن کا ہم نے ان کے ساتھ ذکر کیا۔ پس ان کی جزا جلال، عظمت اور ہیبت ہے، اور دنیا میں خوف، قبض (تنگی)، اور وحشت ہے، اور احوال (الأحوال) میں اصطلام (مغلوبیت)، اور محبت میں سوزش، اشتیاق، شوق، غم اور خشیت ہے، اور ہر مقام پر اس کی تحقیق اس مقام کے دوام یا عدم دوام کے مطابق ہوتی ہے، مگر یہ کہ اس کے ظہور میں غفلت یا فتور بالکل شامل نہیں ہوتا۔ پس جب مقام زائل ہوتا ہے تو حال بھی زائل ہو جاتا ہے، اس کے زائل ہونے کی وجہ سے۔ یہ اس شخص کی جزا ہے جس نے امانت کی حفاظت کی اور اسے صرف اللہ کے حکم سے ظاہر کیا۔\n\nاور اس شخص کی جزا جس نے اللہ کے اذن سے اسے ظاہر کیا، وہ اللہ کے جوار میں اس کے نام \"الرب\" (رب) کے تحت قیام ہے، نہ کہ دوسرے اسماء کے تحت، اور ان علوم کی معرفت جو اس سے متعلق ہیں جو اس کی حفاظت میں اور اس کی منزل سے نیچے ہیں، نہ کہ اس سے جو اس سے اوپر ہے۔ اور یہ حالت ان کے لیے دائمی ہے اور یہ مقام ان کے لیے دنیا اور آخرت میں دائمی ہے۔ اور ان کے لیے جمال اور انس (محبت) ہے، اور احوال (الأحوال) میں رضا ہے، اور محبت میں وصل، معانقہ (گلے ملنا)، اور محبوب کے منہ سے لذت حاصل کرنا اور اسے گلے لگانا ہے۔\n\nاور اس منزل کی خصوصیات میں سے یہ ہے کہ اس کا صاحب اپنے اعمال میں اپنی طرف سے پوری کوشش نہیں کرتا، بلکہ اس کے اعمال اس کی قوت اور طاقت سے کم ہوتے ہیں، اور اللہ اسے قبول کرتا ہے۔ کیونکہ وہ ان لوگوں میں سے ہے جنہوں نے اللہ سے **\"حَقَّ تُقَاتِهِ\"** (جیسا کہ اس سے ڈرنے کا حق ہے) ڈرا، نہ کہ ان میں سے جنہوں نے اپنی استطاعت کے مطابق اللہ سے ڈرا۔ اور اس مقام کے حامل سے یہ تصور نہیں کیا جا سکتا کہ وہ ذات حق (الحق) سے وہ چیز طلب کرے جو اس نے اسے عطا نہیں کی، حالانکہ اس کا حاصل ہونا جائز ہے۔ اور اسے اس سے اللہ سے حیا روکتی ہے، کیونکہ اس نے ان اعمال میں اپنی طرف سے پوری کوشش نہیں کی جن کا اسے نفلی طور پر مکلف بنایا گیا تھا۔ پس وہ اس پر قناعت کرتا ہے جو اس کے رب نے اسے عطا کیا ہے، اور اسے کسی چیز کے فوت ہونے کا افسوس نہیں ہوتا، حالانکہ وہ جانتا ہے کہ کیا فوت ہوا ہے، کیونکہ اس کا حال اس وقت اس نعمت سے لذت حاصل کرنا ہوتا ہے جس میں وہ ہے۔ اور ہم نے اس منزل کے اصول بیان کر دیے ہیں۔\n**\"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\"** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔)",
    "fa": "باب دویست و هشتاد و ششم در معرفت منزل کسی که به او گفته شد «باش» (کن) پس سر باز زد و نبود، از حضرت محمدیه (الحضرة المحمدية).\n\nخورشید فنا (الفناء) در کاف تکوین من آشکار شد\nزیرا می‌دانست که مرا با نور فانی می‌سازد\n\nو اشاره کرد و من اشارتش را ندانستم\nکه در آن ایما مرا قصد می‌کند\n\nپس من واوِ عینِ علم بودم، آشکار\nو عینِ پنهان میان کاف و نون\n\nدر لوح، اسراری تاج‌دار تفصیل یافت\nکه رحمان زیباترین آن‌ها را در نون قرار داده بود.\n\n### [فنا در شهود]\n\nاز این منزل، بخشی را مقید ساختم که آن را فنا در شهود (الفناء في المشاهدة) نامیدم. اکنون آنچه را که این منزل در بر دارد، بر اساس اصول آن ذکر می‌کنیم، زیرا تفصیل در آن به درازا می‌کشد. پس بدان که مظهر این منزل، نامش نور است. اما انوار بر دو قسم‌اند: نوری که شعاع دارد و نور شعشعانی (بسیار درخشان). نور شعشعانی اگر تجلی (التجلی) در آن واقع شود، دیده‌ها را از بین می‌برد. و این همان است که رسول خدا (صلی الله علیه و سلم) به آن اشاره کرد، هنگامی که به او گفته شد: «ای رسول خدا، آیا پروردگارت را دیدی؟» فرمود: «نورانی است، چگونه او را ببینم؟» (نوراني أراه).\n\nمی‌گوید: «نور است، چگونه او را ببینم؟» منظورش نور شعشعانی است، زیرا آن اشعه دیده‌ها را زایل می‌کند و مانع از ادراک کسی می‌شود که آن اشعه از او منشق شده است. و این همان است که پیامبر (صلی الله علیه و سلم) با این سخن به آن اشاره کرد: «همانا خداوند هفتاد حجاب از نور و ظلمت دارد که اگر آن‌ها را بردارد، درخشش‌های (سبحات) وجه او هر آنچه را که دیده‌اش از خلقش درک کند، خواهد سوزاند.» (إن لله سبعين حجابا من نور وظلمة لو كشفها لأحرقت سبحات وجهه ما أدركه بصره من خلقه).\n\nو سبحات در اینجا انوار حقیقت (حقيقة) اوست، زیرا وجه هر شیء، حقیقت آن است. اما نوری که شعاع ندارد، نوری است که تجلی (التجلی) در آن واقع می‌شود و شعاعی ندارد و نورش از خودش فراتر نمی‌رود. بیننده آن را در نهایت وضوح و آشکاری بدون شک درک می‌کند و آن حضرت (الحضرة) که این شخص در آن برایش کشف (الکشف) شده است، در نهایت وضوح باقی می‌ماند، به طوری که هیچ چیز از آن در نهایت صفا از او پنهان نمی‌شود. و در این تجلی (التجلی)،\n\nپیامبر (صلی الله علیه و سلم) می‌فرماید: «پروردگارتان را می‌بینید، همان‌گونه که ماه شب چهارده را می‌بینید.» (ترون ربكم كما ترون القمر ليلة البدر). از جمله مقصود او از این تشبیه که با رؤیت واقع شده، ادراک ذات ماه است، زیرا ضعف اشعه ماه مانع از ادراک ذات آن توسط چشم نمی‌شود. و صحیح در این باره آن است که منظور او زمانی است که ماه شب چهارده در خسوف باشد، زیرا در آن هنگام چشم ذات ماه را که نه افزایش می‌پذیرد و نه نقصان، درک می‌کند. پس این ادراکی محقق از ذات ماه است. سپس در همان حدیث فرمود: «یا همان‌گونه که خورشید را هنگام ظهر می‌بینید که ابری در برابرش نیست.» در آن زمان نور خورشید قوی‌تر است، پس همه اشیاء به واسطه آن آشکار می‌شوند و چشم هر آنچه را که بر آن واقع شود، درک می‌کند، هنگامی که این خورشید برایش کشف شده است. و اگر بخواهد در این حالت به ذات خورشید نگاه کند، نمی‌تواند. پس تشبیه را به این صورت بیان کرد که این تجلی (التجلی) مانع از آن نمی‌شود که مردم یکدیگر را ببینند، یعنی فنا (الفناء) رخ نمی‌دهد. به همین دلیل تشبیه را به رؤیت ماه شب چهارده و رؤیت خورشید بیان کرد و به یکی از آن‌ها اکتفا نکرد و بقا (البقاء) را در این مشهد با این سخن تأکید کرد: «نه زیان می‌بینید و نه به زحمت می‌افتید» (لا تضارون ولا تضامون) که از ضیم و ضم به معنای مزاحمت و از ضیر و اضرار (زیان رساندن) است. و هنگامی که وارد این منزل شدم، تجلی (التجلی) در نور بی‌شعاع برایم واقع شد. پس آن را علم دیدم و خود را به واسطه آن دیدم و همه اشیاء را به واسطه خودم و به واسطه انواری که اشیاء در ذات خود حمل می‌کنند و حقایقشان به آن‌ها می‌دهد، دیدم، نه از نوری زائد بر آن. پس مشهدی عظیم دیدم، حسی نه عقلی، و صورتی حقیقی نه معنا. در این تجلی (التجلی) گشادگی کوچک برای ورود بزرگ در آن آشکار شد، با وجود بقای کوچک بر کوچکی‌اش و بزرگ بر بزرگی‌اش، مانند شتری که در سوراخ سوزن (سَمِّ الْخِياطِ) داخل می‌شود. این را حساً مشاهده می‌کند نه خیالی، و آن سوراخ او را در خود جای داده است و نمی‌دانی چگونه، و آنچه را می‌بینی انکار نمی‌کنی. پس منزه است کسی که از ادراک آنچه عقول کیفیت می‌بخشند، برتر است و ادراک بصر را بر آن‌ها برتری داده است. «هیچ معبودی جز او نیست، عزیز و حکیم است.» (لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ). پس عجز عقول را با این تجلی (التجلی) که در آن قدرت دیده‌ها و برتری آن‌ها بر عقول را آشکار ساخت، نمایان کرد. و در تجلی‌اش در نور شعشعانی، عجز دیده‌ها و قدرت عقول و برتری آن‌ها بر دیده‌ها را آشکار ساخت تا همه به عجز متصف شوند و حق (الحق) به کمال ذاتی منفرد گردد. کسی که این منزل را معاینه کند، از عجایب و آیات چیزی می‌بیند که غیر آن نمی‌تواند در بر گیرد. آغاز این منزل هنگام ورودت به آن، این است که خود را مظهر حق (الحق) می‌بینی. و هنگامی که او را دیدی، به خودت یقین پیدا می‌کنی که او نیست. و این پایان این منزل است. پس آغاز آن، شهود (مشاهدة) است و در این تجلی (التجلی) با تو خطاب می‌کند که او نیست، زیرا این از تجلیاتی است که عین مشاهده را فانی نمی‌سازد، پس رؤیت و خطاب را جمع می‌کنی. و پایان این منزل، «هو» (او) را در بر دارد و آن در غیب است بدون رؤیت، و متعلق نظر عقل است. پس آغاز این منزل بصری و پایان آن عقلی است و آنچه میان آن دو است. و این منزلی است که آنچه را ذکر می‌کنیم نیز در بر دارد.\n\n### [اسراری که خداوند به بنده می‌بخشد]\n\nپس بدان که اسراری که حق (الحق) به بنده خود از اهل این طریقت می‌بخشد، بر دو قسم است: برخی اسرار که ذاتاً به تو اجازه می‌دهند آن‌ها را در اکوان (جهان‌ها) آشکار کنی، بدون هیچ حرجی بر تو در این کار، و نیازی به اذن الهی برای آشکار ساختن آن‌ها برای دیگران نداری. و اسراری که ذاتاً این حکم را به تو نمی‌دهند، و آن‌ها نیز بر دو قسم‌اند: قسمی از آن‌ها که برای آشکار ساختنشان نیاز به اذن الهی داری، و اگر بدون اذن آشکار کنی، مورد مؤاخذه قرار می‌گیری و حرج و گناه بر تو در آشکار ساختن آن واقع می‌شود. و برای من چنین چیزی رخ داد، اما به حمدالله با عتاب مواجه شدم نه با عقاب، که این از رحمت و عنایت خداوند به من بود. و اسرار دیگری که حق (الحق) آن‌ها را به واسطه به کسی نمی‌دهد. اگر اذن بخواهی که آن‌ها را پس از آگاهی حق (الحق) به تو، به دیگران برسانی، به تو اذن داده نمی‌شود. زیرا آن‌ها ذوق‌هایی هستند که با صرف عبارت‌پردازی، از غیر خودت شناخته نمی‌شوند، چرا که از اموری هستند که حق (الحق) در رساندن آن‌ها از حق به بنده، منفرد است، همان‌گونه که در احوال چنین می‌کند. اگر کسی بخواهد شوقی را که نسبت به مشتاق خود می‌یابد، بیان کند، قادر به آن نیست و هیچ چیز از آن به فهم دیگری نمی‌رسد، مگر اینکه شوقی مانند آنچه در صاحبش بوده، در او نیز پدید آید، تا در آن هنگام حقیقت مسمای این لفظ را بشناسد. و همچنین آنچه در معنای آن است. و مانند لذت جماع که عنین (ناتوان جنسی) از آن محروم است؛ کسی که آن لذت را یافته، نمی‌تواند آن را با تعریف به عنین برساند. و همچنین هر علمی که به حواس مربوط است، عقل نمی‌تواند به تنهایی یا با عبارت‌پردازی به معرفت (المعرفة) آن برسد، مگر اینکه دیگری آن را حس کند. پس آنچه مختص این منزل است، معرفت (المعرفة) اسراری است که آشکار ساختن آن‌ها توسط کسی که آن را یافته و به او داده شده، متوقف بر اذن الهی است؛ و معرفت (المعرفة) اسرار الهی پنهان شده در پس حجاب صور که آشکار نمی‌شوند مگر برای کسی که در آن باره بر بینه‌ای از پروردگارش باشد. پس اگر بینه برای آن نزد بنده شهادت دهد، آن را می‌پذیرد و نیازی به شاهد ندارد، برخلاف آنچه در غیر آن نیاز است. پس هنگامی که بنده در این مقام قرار گیرد و حق (الحق) از این اسرار به او ببخشد، موهبت تجلی (التجلی) به او داده می‌شود و بر امور پنهانی از علم به خدا آگاه می‌شود که آن‌ها را در خود پنهان می‌دارد و از غیر خود کتمان می‌کند، به جهت وفای به حق امانت و حفظ آن و معرفت (المعرفة) به قدر و منزلت آن. و کسانی که برخی افعال را به غیر خدا نسبت می‌دهند، مانند معتزله و فلاسفه و اهل شرک که غیر خدا را همراه با عبادت خدا پرستیده‌اند، نیز با ما بر این اسرار آگاه می‌شوند. اینان در اوقاتی بدون شریک، با خدا منفرد می‌شوند، و آن در اوقات ضرورت‌های هلاک‌کننده است که در آن یقین می‌کنند که خدایانشان هیچ سودی برایشان ندارند، پس برای رفع آن به خدا پناه می‌برند. پس از آن حقیقت پنهان شده در آن‌ها، در حالی که تحت اضطرار حسی از آن وجه نیستند، به این اسرار دست می‌یابند، اگرچه شقی باشند. زیرا دست یافتن آن‌ها به این اسرار، بر شقاوتشان می‌افزاید، چرا که کسی را که اقتدار به دست اوست شناختند و از او روی گرداندند و برای غیر او عمل کردند، همان غیر که با دست‌های خود و دست‌های هم‌جنسان خود به عنوان خدا نصب کردند و عجز آن برایشان آشکار شد، اما بر گمراهی خود پافشاری کردند، چنانکه خداوند متعال فرمود: «در طغیانشان سرگردانند.» (فِي طُغْيانِهِمْ يَعْمَهُونَ).\n\n### [بینه خداوند در بندگانش بر دو قسم است]\n\nو بدان که بینه (دلیل/برهان) خداوند در بندگانش بر دو قسم است: قسم اول، بینه حقیقی است و آن قول خداوند متعال است: «آیا کسی که بر بینه‌ای از پروردگارش است [مانند کسی است که چنین نیست]؟» (أَ فَمَنْ كانَ عَلى‏ بَيِّنَةٍ من رَبِّهِ) یعنی در نفس خود. اما کسی که بینه برای او در غیر خودش اقامه می‌شود، ممکن است آن را بپذیرد و ممکن است نپذیرد. و کسی که آن را می‌پذیرد، اگر از روی تقلید بپذیرد، آن بینه در حق او آیه روشنی نبوده و سودی به او نمی‌رساند. و تقلید تنها در احکامی است که رسول می‌آورد، نه در بینات و شواهد بر صدق او. و اگر آن را از روی تقلید نپذیرد، پس آن را نپذیرفته مگر اینکه خودش بر بینه‌ای از پروردگارش باشد که آن آیه، بینه‌ای بر صدق ادعای کسی است که آن آیه به دست او ظاهر شده است. پس از این دانستی که شیء به تو سودی نمی‌رساند مگر اینکه در تو باشد و به تو ضرری نمی‌رساند مگر اینکه در تو باشد. و به همین دلیل در بسیاری از سخنانمان می‌گوییم که حقیقت عذاب، وجود درد در توست، نه اسباب آن، خواه آن اسباب در تو واقع شوند یا در غیر تو. پس در مورد اشیاء نمی‌گوییم مگر اینکه از تو برای تو برخیزد. و کمترین آن این است که تصدیق به آنچه اهل طریقت برای خدا به آن متحقق شده‌اند، در تو برخیزد که آن حق است، اگرچه آن را نچشیده باشی و با آن‌ها مخالفت نکنی، پس بر بینه‌ای از پروردگارت خواهی بود و در صادق بودن آن‌ها شکی نیست. و با آن بینه‌ای که بر آن هستی، با آن‌ها در آن موافقت می‌کنی، پس تو از آن‌ها در مشربی از مشرب‌هایشان هستی. زیرا آن‌ها نیز کسانی هستند که در آنچه در آن وقت به آن متحقق می‌شوند، با یکدیگر موافقت می‌کنند، و اگرچه کسی این را ذوقاً درک نکند، آنچه را که صاحبش درک کرده، برای او اقرار می‌کند و تسلیم او می‌شود و آن را انکار نمی‌کند، به دلیل رفع تهمت. و همنشینی این اقوام برای کسی که به آن‌ها ایمان ندارد، خطری عظیم و زیانی آشکار است، چنانکه برخی از سادات گفتند و گمان می‌کنم رُوَیم (رویما) باشد: «هر کس با آن‌ها بنشیند و در چیزی از آنچه در سرائرشان به آن متحقق می‌شوند، با آن‌ها مخالفت کند، خداوند نور ایمان را از قلبش برمی‌کَنَد.» انسان پیوسته بر حالتی که بر آن است باقی می‌ماند تا شاهدی برای خروج از آن برایش اقامه شود. پس کسی که در حالت کتمان است، کتمان می‌کند و کسی که در حالت اظهار است، اظهار و افشا می‌کند. «بگو: هر کس بر اساس ساختار (شاکله) خود عمل می‌کند، و پروردگار شما به کسی که راهش هدایت‌یافته‌تر است، داناتر است.» (قُلْ كُلٌّ يَعْمَلُ عَلى‏ شاكِلَتِهِ فَرَبُّكُمْ أَعْلَمُ بِمَنْ هُوَ أَهْدى‏ سَبِيلًا). پس خداوند ما و شما را از کسانی قرار دهد که بر بینه‌ای از پروردگارشان هستند. اگر شاهدی به دنبال آن بیاید، نیکو و مایه افزایش اطمینان و تقویت نفس در راهی است که در آن است. و اگر چنین نباشد، در بودن بر بینه‌ای از پروردگارش کفایت است. زیرا اگر مشهودٌله (کسی که به نفع او شهادت داده می‌شود) بر بینه‌ای نباشد که شاهد در آنچه برای او شهادت می‌دهد صادق است، در باطن خود آن را نمی‌پذیرد. مانند شاهد با صاحب دعوا؛ اگر در ادعای خود بر حق باشد، در نفس خود بر بینه‌ای از پروردگارش است که صادق است، اما حاکم از او شاهد می‌طلبد. پس اگر شاهد برای او شهادت دهد، مشهودٌله می‌داند که شاهد در شهادتش صادق است، به واسطه بینه‌ای که بر آن است که او در ادعای خود بر حق است. و اگر مدعی در ادعای خود صادق نباشد، او بر بینه‌ای از نفس خود و پروردگارش است که در آنچه ادعا کرده صادق نیست. پس هنگامی که حاکم از او شاهد بخواهد و او شاهد دروغ بیاورد و شهادت دهد که او در ادعایش صادق است، مدعی بر بینه‌ای از نفس خود و پروردگارش است که آن شاهد که برای او شهادت داده، دروغگوست و به باطل شهادت داده است و در نفس خود آن را نمی‌پذیرد، اگرچه حاکم آن را بپذیرد. پس اولین جایی که شاهد دروغگو جرح می‌شود، نزد کسی است که برای او شهادت داده، زیرا مشهودٌله می‌داند که امر بر خلاف آنچه او شهادت داده است. به همین دلیل گفتیم که ما شاهد را لازم نمی‌دانیم، زیرا آن را نمی‌پذیریم و صدق و کذب آن را محقق نمی‌کنیم، مگر اینکه در آن بر بینه‌ای از خدا باشیم. پس این را بدان.\n\n### [بینه، سفیری از جانب خدا به سوی قلب توست]\n\nو بدان پس از آنکه این مقرر شد، امری که حق (الحق) از آن به عنوان بینه‌ای از جانب خود برای تو کنایه آورده، سفیری است از جانب خدا به سوی قلب تو، از غیب‌های پنهان او، که مختص توست از حضرت خطاب الهی و تعریف از جانب خدا که آن از نزد اوست. پس آن را بگیر و ببین چه چیزی را می‌پذیرد، پس بپذیر و به چه چیزی دلالت می‌کند، پس بر آن اعتماد کن و چه چیزی را نفی می‌کند، پس نفی کن، همان‌گونه که صاحب فکر در دلیل خود عمل می‌کند. جز اینکه صاحب فکر ممکن است دلیلی را بگیرد که در نفس امر دلیل نیست، و ممکن است دلیلی را بگیرد که در نفس امر دلیل است، اما با توجه به قوت عقل، آنچه در توان اوست به او داده شده است. پس هرگز از آن حیث که عقل است، نمی‌تواند نباشد مگر اینکه آن دلیل است و آن دلیل است. و صاحب بینه از پروردگارش بر نوری از خدا و صراط مستقیم است که اشیاء را به واسطه آن نمی‌داند مگر بر همان صورتی که اشیاء بر آن هستند. شبهه را نمی‌پذیرد مگر به صورت شبهه ذوقی از صورت آن، که نمی‌تواند در آن بر او مشتبه شود، برخلاف اصحاب افکار. و آنچه این سفیر به او می‌دهد، برخی از آن مختص به اوست و برخی از آن مطلوب او و غیر اوست، و برخی از آن مطلوب غیر اوست و آنچه نه برای او و نه برای غیر اوست، به او نمی‌دهد. و از جمله آنچه به او می‌دهد، آنچه برای او مقیم است و آنچه برای او مقیم نیست. پس مقیم مانند مقامات است و غیر مقیم مانند احوال. سپس اصحاب این مقام در آن متفرق می‌شوند و بر دو نوع تقسیم می‌گردند: برخی از آن‌ها از تأثیر هوای نفسشان معصوم‌اند و برخی از تأثیر هوای نفسشان در آن معصوم نیستند، با وجود اینکه هر یک از دو طایفه بر علم محقق هستند. پس بینه‌ای که بر آن هستند این است که او معصوم است و هوای نفس بر او راهی ندارد، و اینکه او معصوم نیست و هوای نفس در او تأثیر گذاشته است، به دلیل آنچه در علم خدا درباره او سبقت گرفته است. و آیا این علم نزد خدا در سعادت او نفعی دارد یا خیر؟ نزد ما نافع است و نزد غیر ما نافع نیست. و اختلاف در چنین مسئله‌ای به دلیل وجود کشف (الکشف) نزد واجد و عدم کشف نزد مخالف، همراه با استناد به امری معارض، یا عقلی و یا سمعی، واقع شده است. سپس خداوند متعال بندگانش را امر کرده است که بر آنچه آن‌ها را برای آن آفریده، یعنی ذلت و فقر به سوی او، به طور عام در باطنشان و به طریقی مخصوص در ظاهرشان که شارع برایشان بیان کرده، اقامت کنند. و آن، همه افعالی است که به خدا نزدیک می‌کند، خواه در صورت ظاهری با عزت یا ذلت، و ربوبیت یا عبودیت همراه باشد. برخلاف باطن، زیرا باطن بر امر محققی جاری است که در نفس خود بر آن است، و ظاهر بر آنچه مصلحت در آن وقت اقتضا می‌کند، توسط تو یا غیر تو، جاری می‌شود. اگر ربوبیت و عزت در ظاهر بنده عارف آشکار شود، همان‌گونه که ذکر کردیم، به خاطر مصلحت اوست، زیرا میل در باطن به ذلت و عبودیت نزد او موجود است و بر آن اعتماد می‌شود، و آن عارضی است، به ویژه در موطن تکلیف. و از این منزل است که بنده اعمال را به صورت‌های قائمه ایجاد می‌کند که در آن خالق بالفعل است، اما از اموری که سعادت او نزد خدا به واسطه آن واقع می‌شود. پس پیوسته آن صورت را ایجاد می‌کند تا آن را حساً در برابر خود قائم ببیند و به آن نگاه کند و شاد شود. و همه آنچه از آن صورت آشکار می‌شود و مقتضای سعادت است، تنها برای ایجادکننده این صورت است و او همین بنده است. پس آن صورت برای او مانند سرمایه است و آنچه از آن حاصل می‌شود مانند سودهاست، و سودها منفعتشان به صاحب مال بازمی‌گردد نه به خود مال. و از این منزل نیز جود ذاتی آشکار می‌شود که دفع آن ممکن نیست و بنده در آن اختیاری ندارد. پس از نفس خود به پروردگارش چیزی را می‌دهد که او از او خواسته است که بدهد، در حالی که اگر از او نخواسته بود نیز آن را به او می‌داد. و این از کرم خداست، زیرا می‌دانست که ناگزیر آن را می‌دهد، چون امری است که ذات تو اقتضا می‌کند. پس در آن از تو خواست تا تو را بر امتثال امرش در آن پاداش دهد، همان‌گونه که در آنچه می‌توانستی بدهی و آنچه می‌توانستی سر باز زنی، از تو خواست. پس این را مانند آن قرار داد، از روی جود خود، تا پاداش آنچه را که به امر او دادی و عطای ذاتی است، در مقابل آنچه از آن منع کردی و در آن با امر او مخالفت نمودی و عطای ذاتی نیست بلکه امکانی است (که همان همه اعمال مشروع است)، قرار گیرد. به همین دلیل تو را به چیزی امر کرد که نمی‌توانی از آن جدا شوی، همان‌گونه که چراغ نمی‌تواند نور خود را منع کند، اما تصور می‌شود که به او گفته شود: نور خود را به دیده‌ها بده تا اشیاء را به واسطه آن درک کنند، پس از آن حیث پاداش داده می‌شوی. و آن این است که بدانی حضرت «کن» (باش) شامل روح و جسم است که گاهی به هم مرتبط می‌شوند و گاهی مرتبط نمی‌شوند. پس اگر مرتبط شوند، این جسم بر این صورت از کاف و واو و نون زنده است. و هنگامی که زنده باشد، آنچه بر او متوجه می‌شود، به دلیل ارتباط روح به آن، از او منفعل می‌گردد، و آن اذن الهی است، مانند دمیدن عیسی (علیه السلام) در پرنده، همراه با اذن الهی که همان نفخ الهی است. پس نفخ اذنی الهی که پرنده به واسطه آن زنده شد و روحش مرتبط گشت، در نفخ جسمانی قائم به عیسی (علیه السلام) مندرج شد. و اگر جسم «کن» بدون ارتباط روح به آن یافت شود، هیچ چیزی از آن حاصل نمی‌شود، زیرا فعل اصلاً به مرده نسبت داده نمی‌شود و هیچ شبهه‌ای برای عقل در آن باقی نمی‌ماند، برخلاف زنده، در حالی که صورت جسمی در هر دو یکی است. و اگر روح «کن» بدون جسمیتش منفرد شود، اشیاء از آن منفعل می‌شوند، و از جمله اشیاء، جسمیت «کن» است که در عالم حروف است. پس هنگامی که آنچه را برای تو در این کلام توضیح دادیم دانستی، بر امر عظیمی از قول خداوند متعال آگاه می‌شوی: «همانا سخن ما برای چیزی، هنگامی که اراده‌اش کنیم، این است که به آن بگوییم: باش، پس می‌شود.» (إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ) و آن امر ناگزیر واقع می‌شود. و حق (الحق) سبحانه در کلام عزیز خود به بندگانش می‌گوید: «نماز را برپا دارید و صبر کنید و پایداری ورزید و مرزبانی کنید و جهاد کنید.» (أَقِيمُوا الصَّلاةَ واصْبِرُوا وصابِرُوا ورابِطُوا وجاهِدُوا) و هیچ یک از این‌ها واقع نمی‌شود، زیرا به آن‌ها گفته است: «خلق کنید»، در حالی که خلق کردن شأن آن‌ها نیست. پس جسم «کن» به آن‌ها تعلق گرفت نه روح آن، پس مرده بود و استعمال آن بر آن‌ها حرام بود. پس هنگامی که اذن الهی که همان «کن» زنده است، به ایجاد عین جهاد یا مرزبانی یا نماز یا هر چیز دیگری از افعال بندگان تعلق گیرد، در هنگام توجه بر ما، موجود می‌شود. و شأن افعال این نیست که به خودی خود قائم شوند. پس نماز در غیر نمازگزار و روزه در غیر روزه‌دار و جهاد در غیر مجاهد ظاهر می‌شد، و این صحیح نیست. پس ناگزیر باید در مجاهد و نمازگزار و غیر آن ظاهر شود. پس هنگامی که در او ظاهر شد، خداوند فعل را به او نسبت داد و او را بر آن پاداش داد، از روی منت و فضل خود، زیرا عین نماز جز در نمازگزار ظاهر نشد. اگر فعل را به او نسبت نمی‌داد، خطاب و تکلیف را نادیده گرفته بود و با حس مغایرت داشت و به حس در هیچ چیز اعتماد نمی‌شد. پس خداوند این امر را با نسبت دادن این افعال به کسی که آن‌ها را در خود ظاهر کرده و به او اضافه نموده و به آن‌ها امر کرده، فیصله داد. و خلق آن‌ها برای ایشان نیست، بلکه آن به خداوند متعال بازمی‌گردد. پس بنگر که این امر چقدر شگفت‌انگیز است، با وجود تناقض محققی که در بر دارد، و ایمان به هر دو طریق متناقض در آن واجب است. و آگاهی بر آن از باب کشف (الکشف)، همراه با وجود ایمان به آن، تأیید و قوّتی عظیم است برای کسی که این به او داده شده است. زیرا در این موطن بسیاری از اهل کشف (الکشف) لغزیده‌اند، و آن قول خداوند است: «و او را با وجود علم گمراه کرد.» (وَأَضَلَّهُ اللَّهُ عَلَى عِلْمٍ). و علم شایسته نبود که ضلالت با آن همراه شود و آن را مستلزم باشد، اما در اینجا این امر در آن یافت شده است. پس یا با علم گمراه شده یا بدون علم، و امر در آن اشکال دارد. سپس این منزل شامل جزای اعمال است، یعنی جزای کسانی که در این منزل ذکر کردیم، از کتمان‌کنندگان اسرار حق (الحق) که خداوند آن‌ها را بر آن امین دانسته و آن‌ها را جز با اذن الهی آشکار نمی‌کنند، و کسانی که از طوایف همراه آن‌ها ذکر کردیم. پس جزای آن‌ها جلال و عظمت و هیبت است، و در دنیا ترس و قبض و وحشت، و در احوال، اصطلام (مغلوب شدن)، و در محبت، سوز و اشتیاق و شوق و اندوه و خشیت، و تحقق به آن در هر موطنی بر حسب آن موطن، از دوام و عدم دوام، جز اینکه در ظهور آن، غفلت و فترتی اصلاً در آن راه نمی‌یابد. پس اگر مقام زایل شود، حال نیز به دلیل زوال آن زایل می‌شود. این جزای کسی است که امانت را حفظ کرد و آن را جز به امر خدا آشکار نساخت. و جزای کسی که آن را با اذن خدا آشکار ساخت، اقامت در جوار خدا از اسم «رب» است نه غیر آن از اسماء، و معرفت (المعرفة) علومی است که به کسی که تحت حمایت او و پایین‌تر از منزلت اوست، تعلق دارد، نه به کسی که بالاتر از اوست. و این حالت برای آن‌ها دائمی است و مقام برای آن‌ها در دنیا و آخرت دائم است. و برای آن‌ها جمال و انس است، و از احوال، رضایت، و از محبت، وصل و در آغوش گرفتن و لذت بردن از دهان محبوب و به خود فشردن اوست. و از ویژگی‌های این منزل این است که صاحب آن در اعمالش از خود مجهودی (تلاش مضاعف) نمی‌کند، بلکه اعمالش کمتر از قوت و طاقت اوست، و خداوند آن را از او می‌پذیرد، زیرا او از کسانی است که «حق تقوای خدا را به جا آورده‌اند» (حَقَّ تُقاتِهِ)، نه از کسانی که به اندازه استطاعت خود تقوای خدا را پیشه کرده‌اند. و صاحب این مقام تصور نمی‌شود که از حق (الحق) چیزی را که به او نداده و جایز است به او برسد، طلب کند. و حیا از خدا او را از این کار بازمی‌دارد، زیرا در اعمالی که به عنوان مستحب بر او تکلیف شده، از خود مجهودی نکرده است. پس به آنچه پروردگارش به او داده قانع است و حسرت از دست دادن آنچه را که از دست داده، نمی‌یابد، زیرا با وجود علم به آنچه از دست داده، حال او در آن وقت، التذاذ به نعمتی است که در آن است. و ما اصول این منزل را بیان کردیم و «خداوند حق را می‌گوید و او راه را هدایت می‌کند.» (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 5
}