{
  "id": 425,
  "title": {
    "ar": "الباب الخامس والعشرون وأربعمائة في معرفة منازلة من طلب العلم صرفت بصره عني",
    "en": "Chapter Four Hundred and Twenty-Five: Concerning the Gnosis of the Station of him who sought Knowledge, yet whose Gaze was Turned Away from Me.",
    "ur": "باب چار سو پچیس: ان لوگوں کے منازل کی معرفت کے بارے میں جنہوں نے علم طلب کیا اور اپنی بصارت مجھ سے پھیر لی۔",
    "fa": "باب چهارصد و بیست و پنجم در معرفت منازل کسی که علم را طلب کرد و دیده‌اش را از من برگرداند"
  },
  "content": {
    "ar": "## «الباب الخامس والعشرون وأربعمائة في معرفة منازلة من طلب العلم صرفت بصره عني»\n\n\n> طالب العلم ليس يدرك ذاتي *** بدليل لكون ذاك محالا\n\n\n> فتراه يراني في كل عين *** وتراني أبدية حالا فحالا\n\n\n> فيرى نفسه وليس سوائي *** والهدى لا يكون قط ضلالا\n\n\n> قد رفعنا أبصارنا لشموس *** أحرقت أوجها فكانت ظلالا\n\n\n> فإذا ما يقول ربك فاعلم *** إنني واحد عليك أحالا\n### [الدليلي البرهاني يقضي برفع المناسبة بين العالم وبين هوية الحق‏]\n\n\nقال الله تعالى لا تُدْرِكُهُ الْأَبْصارُ التقدير فإذا ما يقول ربك إنني واحد فاعلم أنه عليك أحال اعلم أن العلم الدليلي البرهاني يقضي برفع المناسبة بين العالم وبين هوية الحق وأن ولا رؤية من راء إلا بمناسبة بينه وبين المرئي فالحق لا يراه غير نفسه من حيث هويته فصاحب هذا العلم في حال شهوده ورؤيته ربه يحكم أنه ما رآه وحكمه صحيح ورؤيته صحيحة فلهذا قال صرفت بصره عني فإذا صرف بصره عنه كان الحق بهويته بصر لهذا العبد فإذا رآه بهذه الحال يكون ممن رأى الحق بالحق والرائي عبد والمرئي حق والمرئي به حق وهذه أكمل رؤية تكون حيث كانت وقد ورد في الصحيح أن العبد يحصل له هذا المقام في الحياة الدنيا وفي هذه النشأة التي تفارقها النفس المطمئنة الناطقة بالموت فقال تعالى لا تُدْرِكُهُ الْأَبْصارُ فكثر وجمع فإنها أبصار الكون ولم يقل لا يدركه البصر وإن كان جمع قلة ولكن على كل حال هو أكثر من بصر قال الشاعر في جمع القلة\n\n\n> بأفعل وبأفعال وأفعلة *** وفعلة يجمع الأدنى من العدد\n\n\nفافعل مثل أكلب وأفعال مثل أبصار وأفعلة مثل أكسية وفعله مثل فتية ولما كانت هويته أحدية الوصف لم يكن فيها كثرة وهي بصره في كل مبصر فهو وإن تعددت ذوات المبصرين فالبصر واحد من الجميع إذ كان البصر هوية الحق فيصح إن البصر عند ذلك يدركه لأنه ليس غيره فهو الرائي والمرئي به والمرئي فإن الحقيقة المنفية في هذه الآية في قوله لا تُدْرِكُهُ الْأَبْصارُ إن الأبصار هنا معان يدرك بها المبصرات ما هي تدرك المبصرات بخلاف ما هنا فإنه إذا كان عين الحق عين بصرك فيصح أن يقال في مثل هذا يدركه البصر فينسب الإدراك إليه مع صحة كونه بصرا للعبد فتفطن لهذه المسألة فإنها نافعة جدا\n\n\n### [إن لله عبادا بحسب رتبتهم‏]\n\n\nوتعلم من ذلك أن لله عبادا عجل لهم رؤيته في الدنيا قبل الآخرة ولله عبادا أخر لهم ذلك ولله عبادا لا يرونه إلا بأبصارهم في الآخرة وينزلون عن رتبة هؤلاء في الرؤية ولله عبادا يرونه في الدنيا بأبصار إيمانهم وفي الآخرة البرزخية بأعين خيالهم يقظة ونوما وموتا ومن هنا قال من قال من أهل الله أن العلم حجاب يريدون علم النظر الفكري أي العلم الذي استفاده العاقل من نظره في الله فهذا معنى‏\n\n\nقوله صرفت بصره عني فما رآني من رآني إلا بي ومن رآني ببصره فما رأى إلا نفسه فإنني بصورته تجليت له‏\n\n\nفرجال الله علموا الله بإعلام الله تعالى فكان هو علمهم كما كان بصرهم فمثل هؤلاء لو تصور منهم نظر فكري لكان الحق عين فكرهم كما كان عين علمهم وعين بصرهم وسمعهم لكن لا يتصور من يكون مشهده هذا وذوقه أن يكون له فكر البتة في شي‏ء إنما هو مع ما يوحى إليه على اختلاف ضروب الوحي وإنه من ضروب الوحي الفهم عن الله ابتداء من غير تفكر فإن أعطى الفهم عن تفكر فما هو ذلك الرجل فإن الفهم عن الفكر يصيب وقتا ويخطئ وقتا والفهم لا عن فكر وحي صحيح صريح من الله لعبده وذوق الأنبياء عليه السلام في هذا الوحي يزيد على ذوق الأولياء فإن قابل الأخص في الأعم محصل للأعم وليس قابل الأعم الذي لا يتعين فيه الأخص يحصل له فيه ذوق الأخص وإن كان مندرجا فيه فلا حكم له في الذوق وإن كان له حكم في الكل إلا أنه لا يقدر على الفصل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 425: Concerning the Knowledge of the Station of One Who Sought Knowledge, [of Whom God Said]: \"I Diverted His Gaze from Me.\"\n\nThe seeker of Knowledge does not grasp My Essence (ذاتي)\nBy means of a proof, for that is impossible.\n\nSo you see him seeing Me in every eye,\nAnd seeing Me eternally, state after state.\n\nHe sees himself, and there is none other than Me (سواي),\nAnd guidance (الهدى) is never error.\n\nWe have raised our gazes to Suns\nThat burned faces, so they became shadows.\n\nSo when your Lord says, know:\n\"Indeed, I am One,\" He has referred it back to you.\n\n### [Demonstrative Proof (الدليلي البرهاني) Necessitates the Removal of Correspondence between the World and the Identity of the Real (هوية الحق)]\n\nAllah the Exalted said: <<لَا تُدْرِكُهُ الْأَبْصَارُ>> (Vision comprehends Him not). The interpretation is: So when your Lord says, \"Indeed, I am One,\" know that He has referred it back to you.\n\nKnow that demonstrative, rational Knowledge (العلم الدليلي البرهاني) necessitates the removal of correspondence (مناسبة) between the world (العالم) and the Identity of the Real (هوية الحق). And there is no vision (رؤية) for any seer except through a correspondence between him and the object seen (المرئي). Thus, the Real (الحق) is not seen by other than Himself, in terms of His Identity. The possessor of this Knowledge, in the state of witnessing (شهوده) and seeing his Lord, judges that he has not seen Him, and his judgment is correct, yet his vision is also correct.\n\nFor this reason, [God] said: \"I diverted his gaze from Me.\" When his gaze is diverted from Him, the Real, by His Identity, becomes the sight (بصر) for this servant. When he sees Him in this state, he is among those who saw the Real *by* the Real (رأى الحق بالحق). The seer is the servant, the object seen is the Real, and that by which the seeing occurs is the Real. This is the most complete vision that can exist.\n\nIt has been reported in the *Sahih* collections that the servant attains this station (المقام) in the life of this world, and in this existence (النشأة) which the tranquil, speaking soul (النفس المطمئنة الناطقة) departs at death.\n\nThus, the Exalted said: <<لَا تُدْرِكُهُ الْأَبْصَارُ>> (Vision comprehends Him not), using the plural (الأبصار) to denote multiplicity, for these are the visions/sights of the cosmos (أبصار الكون). He did not say, \"The sight (البصر) comprehends Him not,\" even though the plural used (أبصار) is a plural of paucity (جمع قلة). Nevertheless, in any case, it is more than a single sight. The poet said concerning the plural of paucity:\n\n\"By *af‘ul*, *af‘āl*, and *af‘ilah*\nAnd *fi‘lah*, the lowest numbers are gathered.\"\n\n*Af‘ul* is like *aklub* (dogs), *af‘āl* is like *abṣār* (sights), *af‘ilah* is like *aksiyah* (garments), and *fi‘lah* is like *fityah* (youths).\n\nSince His Identity is singular in description (أحدية الوصف), there is no multiplicity (كثرة) within it. And this Identity is His sight in every object seen (مبصر). Therefore, even if the essences (ذوات) of the seers multiply, the sight is one for all, since the sight is the Identity of the Real. It is therefore correct that the sight comprehends Him, because it is none other than Him. He is the Seer, that by which the seeing occurs, and the Object Seen.\n\nThe reality negated in this verse, <<لَا تُدْرِكُهُ الْأَبْصَارُ>> (Vision comprehends Him not), is that the *abṣār* (sights) here are meanings by which the objects seen are comprehended—they comprehend the objects seen—which is contrary to the case here [with the Divine]. For if the very Essence of the Real (عين الحق) is the very essence of your sight (عين بصرك), then it is correct to say in such a case that \"the sight comprehends Him,\" and the comprehension is attributed to it, while simultaneously being the sight of the servant. Pay close attention to this issue, for it is extremely beneficial.\n\n### [Indeed, Allah has Servants according to their Levels (رتبتهم)]\n\nAnd learn from this that Allah has servants for whom He hastened His vision (رؤيته) in this world before the Hereafter. And Allah has servants for whom He delayed that. And Allah has servants who will not see Him except with their [physical] sights in the Hereafter, and they fall below the rank of the former in vision. And Allah has servants who see Him in this world with the sights of their faith (أبصار إيمانهم), and in the intermediate Hereafter (الآخرة البرزخية) with the eyes of their Imagination (خيالهم), whether awake, asleep, or in death.\n\nIt is from this perspective that some of the People of Allah (أهل الله) said that Knowledge (العلم) is a veil (حجاب). They mean the knowledge derived from intellectual speculation (علم النظر الفكري)—that is, the knowledge gained by the rational person (العاقل) through his contemplation of Allah. This is the meaning of His saying: \"I diverted his gaze from Me.\" Thus, no one who saw Me saw Me except *by* Me. And whoever saw Me with his [own] sight saw nothing but himself, for I disclosed Myself (تجليت) to him in his own form.\n\nThe Men of Allah (رجال الله) knew Allah through the informing of Allah the Exalted (بإعلام الله), so He was their Knowledge, just as He was their sight. If intellectual speculation were conceivable for such people, the Real would be the very essence of their thought, just as He is the essence of their Knowledge, their sight, and their hearing.\n\nHowever, it is inconceivable that one whose witnessing (مشهده) and spiritual taste (ذوقه) is of this nature would ever engage in thought (فكر) concerning anything. Rather, he is with what is revealed to him (يوحى إليه), according to the various types of revelation (ضروب الوحي). And among the types of revelation is understanding directly from Allah (الفهم عن الله ابتداء) without speculation (تفكر). If understanding is granted through speculation, then that person is not of this rank. For understanding derived from thought is sometimes correct and sometimes mistaken. But understanding not derived from thought is a sound, explicit revelation (وحي صحيح صريح) from Allah to His servant.\n\nThe spiritual taste of the Prophets (عليه السلام) in this revelation surpasses the taste of the Friends of God (الأولياء). For the recipient of the specific (الأخص) within the general (الأعم) attains the general, but the recipient of the general, in which the specific is not determined, does not attain the taste of the specific within it. Even if the specific is encompassed within the general, it holds no ruling (حكم) in the spiritual taste. Although the general has a ruling in the totality, the recipient is unable to distinguish. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر ۴۲۵: اس شخص کے مقام کی معرفت میں جس نے علم طلب کیا اور میں نے اس کی بصارت کو مجھ سے پھیر دیا (صرفت بصره عني)۔\n\nطالب علم میری ذات (ذاتي) کو نہیں پا سکتا\nکسی دلیل سے، کیونکہ یہ ناممکن (محالا) ہے۔\n\nتو اسے دیکھے گا کہ وہ مجھے ہر آنکھ میں دیکھتا ہے\nاور مجھے ہمیشہ، حال در حال دیکھتا ہے۔\n\nپس وہ خود کو دیکھتا ہے اور میرے سوا کوئی نہیں\nاور ہدایت (الهدى) کبھی بھی گمراہی (ضلالا) نہیں ہوتی۔\n\nہم نے اپنی نگاہیں ان سورجوں کی طرف اٹھائیں\nجنہوں نے چہروں کو جلا دیا، پس وہ سائے بن گئے۔\n\nپس جب تیرا رب کہے، تو جان لے\nکہ میں واحد (واحد) ہوں، اس نے تیری طرف اشارہ (أحالا) کیا ہے۔\n\n### [دلیلی برہانی علم، عالم اور ہویت حق (هوية الحق) کے درمیان مناسبت کے خاتمے کا تقاضا کرتا ہے]\n\nاللہ تعالیٰ نے فرمایا: لَا تُدْرِكُهُ الْأَبْصَارُ (نگاہیں اسے نہیں پا سکتیں)۔ (اس کا) اندازہ یہ ہے کہ جب تیرا رب کہے کہ میں واحد (واحد) ہوں، تو جان لے کہ اس نے تیری طرف اشارہ (أحال) کیا ہے۔ جان لو کہ دلیلی برہانی علم (العلم الدليلي البرهاني) عالم اور ہویت حق (هوية الحق) کے درمیان مناسبت (مناسبة) کے خاتمے کا تقاضا کرتا ہے، اور یہ کہ دیکھنے والے کی کوئی رؤیت (رؤية) نہیں ہوتی مگر اس کے اور مرئی کے درمیان مناسبت کے ذریعے۔ پس حق (الحق) اپنی ہویت (هويته) کے لحاظ سے اپنے سوا کسی کو نظر نہیں آتا۔ لہٰذا اس علم کا حامل شخص اپنے رب کے شہود (الشهود) اور رؤیت (الرؤية) کی حالت میں یہ حکم لگاتا ہے کہ اس نے اسے نہیں دیکھا، اور اس کا حکم بھی صحیح ہے اور اس کی رؤیت بھی صحیح ہے۔ اسی لیے اس نے کہا: \"میں نے اس کی بصارت کو مجھ سے پھیر دیا (صرفت بصره عني)\"۔ پس جب اس کی بصارت اس سے پھیر دی گئی، تو حق (الحق) اپنی ہویت (هويته) کے ساتھ اس بندے کی بصارت بن گیا۔ پس جب وہ اسے اس حال میں دیکھتا ہے، تو وہ ان لوگوں میں سے ہوتا ہے جنہوں نے حق (الحق) کو حق (الحق) کے ذریعے دیکھا، اور دیکھنے والا بندہ ہے، مرئی حق (الحق) ہے، اور جس کے ذریعے دیکھا گیا وہ بھی حق (الحق) ہے۔ اور یہ کامل ترین رؤیت (رؤية) ہے جو ہو سکتی ہے۔ اور صحیح (حدیث) میں وارد ہوا ہے کہ بندے کو یہ مقام دنیا کی زندگی میں اور اس نشأت (النشأة) میں حاصل ہوتا ہے جسے مطمئنہ نفس (النفس المطمئنة) موت کے وقت چھوڑتا ہے۔ پس اللہ تعالیٰ نے فرمایا: لَا تُدْرِكُهُ الْأَبْصَارُ (نگاہیں اسے نہیں پا سکتیں)، اور جمع کا صیغہ استعمال کیا، کیونکہ یہ کونی بصارتیں (أبصار الكون) ہیں۔ اور یہ نہیں فرمایا کہ \"بصر (بصارت) اسے نہیں پاتی\"، اگرچہ یہ جمع قلت (جمع قلة) ہے۔ لیکن بہرحال یہ ایک بصارت سے زیادہ ہے۔ شاعر نے جمع قلت (جمع القلة) کے بارے میں کہا:\n\n\"افعل\" اور \"افعال\" اور \"افعلۃ\" کے ساتھ\nاور \"فعلۃ\" کے ساتھ کم تعداد کو جمع کیا جاتا ہے۔\n\nپس \"افعل\" جیسے \"أكلب\" (کتے)، اور \"افعال\" جیسے \"أبصار\" (بصارتیں)، اور \"افعلۃ\" جیسے \"أكسية\" (لباس)، اور \"فعلۃ\" جیسے \"فتية\" (جوان)۔ اور چونکہ اس کی ہویت (هويته) وصف میں احدی (أحدية) ہے، اس لیے اس میں کثرت نہیں ہے۔ اور وہ ہر مبصر میں اس کی بصارت ہے۔ پس اگرچہ مبصرین کی ذاتیں متعدد ہیں، لیکن بصارت سب میں ایک ہی ہے، کیونکہ بصارت ہویت حق (هوية الحق) ہے۔ لہٰذا یہ درست ہے کہ اس وقت بصارت اسے پا لیتی ہے، کیونکہ وہ اس کے سوا کچھ نہیں ہے۔ پس وہی دیکھنے والا (الرائي)، جس کے ذریعے دیکھا گیا (المرئي به)، اور مرئی (المرئي) ہے۔ کیونکہ اس آیت میں لَا تُدْرِكُهُ الْأَبْصَارُ (نگاہیں اسے نہیں پا سکتیں) کے قول میں جس حقیقت کی نفی کی گئی ہے، وہ یہ ہے کہ یہاں أبصار (نگاہیں) وہ معانی ہیں جن کے ذریعے مبصرات کو پایا جاتا ہے، نہ کہ وہ خود مبصرات کو پاتی ہیں۔ اس کے برعکس جو یہاں بیان ہوا ہے، کیونکہ جب عین حق (عين الحق) تمہاری بصارت کی عین (عين) ہو، تو ایسے موقع پر یہ کہنا درست ہے کہ بصارت اسے پا لیتی ہے، اور ادراک (الإدراك) کی نسبت اس کی طرف کی جاتی ہے، باوجود اس کے کہ وہ بندے کی بصارت ہے۔ پس اس مسئلے پر غور کرو، کیونکہ یہ بہت زیادہ نفع بخش ہے۔\n\n### [بے شک اللہ کے بندے ان کے مراتب کے مطابق ہیں]\n\nاور اس سے تم یہ جان لو کہ اللہ کے کچھ بندے ایسے ہیں جن کے لیے اس کی رؤیت (رؤيته) کو دنیا میں آخرت سے پہلے جلدی عطا کر دیا گیا، اور اللہ کے کچھ بندے ایسے ہیں جن کے لیے اسے مؤخر کر دیا گیا، اور اللہ کے کچھ بندے ایسے ہیں جو اسے صرف آخرت میں اپنی بصارتوں کے ذریعے دیکھیں گے اور وہ رؤیت (الرؤية) میں ان (پہلے) لوگوں کے مرتبے سے کم ہیں۔ اور اللہ کے کچھ بندے ایسے ہیں جو اسے دنیا میں اپنے ایمان کی بصارتوں (أبصار إيمانهم) سے دیکھتے ہیں، اور برزخی آخرت (الآخرة البرزخية) میں اپنے خیال کی آنکھوں (أعين خيالهم) سے بیداری، نیند اور موت میں دیکھتے ہیں۔ اور اسی وجہ سے اہل اللہ (أهل الله) میں سے جس نے کہا کہ علم حجاب (حجاب) ہے، تو ان کی مراد فکری نظر کا علم (علم النظر الفكري) ہے، یعنی وہ علم جو عاقل نے اللہ میں غور و فکر سے حاصل کیا۔ پس یہی اس کے قول کا معنی ہے: \"میں نے اس کی بصارت کو مجھ سے پھیر دیا (صرفت بصره عني)\"۔ پس جس نے مجھے دیکھا، اس نے مجھے میرے ذریعے ہی دیکھا، اور جس نے مجھے اپنی بصارت سے دیکھا، تو اس نے صرف خود کو دیکھا، کیونکہ میں نے اس کے لیے اس کی صورت میں تجلی (التجلی) کی۔ پس رجال اللہ (رجال الله) نے اللہ کو اللہ تعالیٰ کے اطلاع دینے سے جانا، پس وہی ان کا علم (علم) تھا جیسا کہ وہ ان کی بصارت (بصر) تھا۔ پس اگر ایسے لوگوں سے فکری نظر (نظر فكري) کا تصور کیا جائے، تو حق (الحق) ان کے فکر کی عین (عين) ہوتا، جیسا کہ وہ ان کے علم (علم)، ان کی بصارت (بصر) اور ان کی سماعت (سمع) کی عین ہے۔ لیکن جس کا مشہد (مشهد) اور ذوق (ذوق) یہ ہو، اس کے لیے کسی بھی چیز میں مطلقاً فکر (فکر) کا ہونا متصور نہیں ہے۔ بلکہ وہ اس کے ساتھ ہوتا ہے جو اس کی طرف وحی (الوحي) کیا جاتا ہے، وحی کی مختلف اقسام کے مطابق۔ اور وحی (الوحي) کی اقسام میں سے یہ بھی ہے کہ اللہ کی طرف سے ابتداءً بغیر تفکر کے سمجھ (فہم) حاصل ہو جائے۔ پس اگر اسے تفکر کے ذریعے سمجھ عطا کی گئی، تو وہ یہ شخص نہیں ہے۔ کیونکہ فکر کے ذریعے حاصل ہونے والی سمجھ کبھی درست ہوتی ہے اور کبھی غلط، جبکہ بغیر فکر کے حاصل ہونے والی سمجھ اللہ کی طرف سے اس کے بندے کے لیے صحیح اور صریح وحی (وحي صحيح صريح) ہوتی ہے۔ اور اس وحی (الوحي) میں انبیاء علیہم السلام کا ذوق (ذوق) اولیاء (الأولياء) کے ذوق سے زیادہ ہوتا ہے۔ کیونکہ جو شخص اعم (عام) میں اخص (خاص) کو قبول کرتا ہے، وہ اعم کو حاصل کر لیتا ہے، لیکن جو شخص اعم کو قبول کرتا ہے جس میں اخص متعین نہیں ہوتا، اسے اس میں اخص کا ذوق حاصل نہیں ہوتا، اگرچہ وہ اس میں شامل ہی کیوں نہ ہو۔ پس ذوق میں اس کا کوئی حکم نہیں، اگرچہ کل میں اس کا حکم ہے، لیکن وہ فصل (تفریق) پر قادر نہیں ہوتا۔ اور وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و بیست و پنجم در معرفت منزلت کسی که علم را طلب کرد و من دیده‌اش را از خود بازداشتم\n\nطالب علم ذات مرا درک نمی‌کند *** به واسطه دلیل، زیرا این امر محال است.\n\nپس او مرا در هر چشمی می‌بیند *** و مرا ابدی، حال به حال، مشاهده می‌کند.\n\nاو خود را می‌بیند و جز من نیست *** و هدایت هرگز گمراهی نخواهد بود.\n\nما دیدگان خود را به سوی خورشیدهایی بالا بردیم *** که چهره‌ها را سوزاندند و سایه شدند.\n\nپس چون پروردگارت می‌گوید، بدان *** که من یگانه‌ای هستم که تو را به خود حواله داده‌ام.\n\n### [دلیل برهانی حکم می‌کند که مناسبت میان عالَم و هویت حق (الحق) برداشته شود]\n\nخداوند متعال فرمود: چشم‌ها او را درک نمی‌کنند (لا تُدْرِكُهُ الْأَبْصارُ). تقدیر این است که چون پروردگارت می‌گوید: «من یگانه‌ام»، پس بدان که او تو را به خود حواله داده است.\n\nبدان که علم دلیلی و برهانی حکم می‌کند که مناسبت میان عالَم و هویت حق (الحق) برداشته شود، و هیچ رؤیتی برای بیننده نیست مگر به واسطه مناسبتی میان او و مرئی (آنچه دیده می‌شود). پس حق (الحق) از حیث هویتش، جز خود را نمی‌بیند. بنابراین، صاحب این علم در حال شهود (الشهود) و رؤیت پروردگارش حکم می‌کند که او را ندیده است، و حکم او صحیح است و رؤیت او نیز صحیح است.\n\nبه همین دلیل گفت: «دیده‌اش را از من بازداشتم». پس هنگامی که دیده‌اش را از او بازداشت، حق (الحق) با هویتش، بصر (دیده) این بنده شد. پس اگر او را در این حال ببیند، از کسانی خواهد بود که حق (الحق) را به واسطه حق (الحق) دیده است؛ در حالی که بیننده بنده است و مرئی (آنچه دیده می‌شود) حق (الحق) است و مرئی به واسطه آن نیز حق (الحق) است. و این کامل‌ترین رؤیتی است که می‌تواند وجود داشته باشد.\n\nو در حدیث صحیح وارد شده است که این مقام در زندگی دنیا و در همین نشأه (عالم) که نفس مطمئنه با مرگ از آن جدا می‌شود، برای بنده حاصل می‌گردد. پس خداوند متعال فرمود: چشم‌ها او را درک نمی‌کنند (لا تُدْرِكُهُ الْأَبْصارُ). پس جمع و کثرت آورد، زیرا اینها دیدگان عالَم کون هستند، و نگفت: «بصر (دیده) او را درک نمی‌کند»، اگرچه جمعِ قِلّه (کم) است، اما در هر حال از یک بصر بیشتر است. شاعر در جمع قِلّه می‌گوید:\n\nبا «أفعل» و «أفعال» و «أفعلة» *** و «فعلة» جمع می‌شود کمترینِ عدد.\n\nپس «أفعل» مانند «أکلب» (سگ‌ها)، و «أفعال» مانند «أبصار» (دیدگان)، و «أفعلة» مانند «أکسیة» (جامه‌ها)، و «فعلة» مانند «فتیة» (جوانان) است. و چون هویت حق (الحق) در وصف، احدی (یگانه) است، کثرتی در آن نیست، و آن هویت، بصر (دیده) او در هر مبصری (آنچه دیده می‌شود) است. پس اگرچه ذوات مبصرین متعدد باشند، بصر (دیده) از همه یکی است، زیرا بصر، هویت حق (الحق) است. در این صورت صحیح است که بصر او را درک کند، زیرا بصر غیر او نیست؛ پس اوست بیننده، و مرئی به واسطه او، و مرئی (آنچه دیده می‌شود).\n\nزیرا حقیقتی که در این آیه نفی شده است، در قول او: چشم‌ها او را درک نمی‌کنند (لا تُدْرِكُهُ الْأَبْصارُ)، این است که «أبصار» در اینجا معانی‌ای هستند که مبصرات را درک می‌کنند، نه اینکه خودِ مبصرات را درک کنند. برخلاف آنچه در اینجا (در مقام شهود) است؛ زیرا اگر عین حق (الحق) عین بصر تو باشد، صحیح است که در چنین حالتی گفته شود: بصر او را درک می‌کند، و ادراک به آن نسبت داده شود، در حالی که بصر بودن آن برای بنده نیز صحیح است. پس به این مسئله بسیار سودمند توجه کن.\n\n### [همانا برای خداوند بندگانی است بر حسب رتبه ایشان]\n\nو از این مطلب بیاموز که برای خداوند بندگانی است که رؤیت خود را در دنیا پیش از آخرت برایشان تعجیل کرده است، و بندگانی است که آن را برایشان به تأخیر انداخته است، و بندگانی است که او را جز با دیدگانشان در آخرت نمی‌بینند و از رتبه این گروه در رؤیت پایین‌ترند. و برای خداوند بندگانی است که او را در دنیا با دیدگان ایمانشان می‌بینند و در آخرت برزخی با چشمان خیالشان، در بیداری و خواب و مرگ. و از اینجاست که برخی از اهل الله (اهل حق) گفتند: «علم حجاب است»، منظورشان علم نظر فکری است؛ یعنی علمی که عاقل از نظر کردن در خدا به دست آورده است.\n\nاین معنای قول اوست: «دیده‌اش را از من بازداشتم». پس هر کس مرا دید، مرا ندید مگر به واسطه من؛ و هر کس مرا با دیده‌اش دید، جز خود را ندید، زیرا من در صورت او برایش تجلی (التجلی) کردم.\n\nپس مردان خدا، خدا را به واسطه آگاه ساختن خداوند متعال شناختند، و او (حق) علم ایشان بود، همان‌گونه که بصر (دیده) ایشان بود. اگر برای چنین کسانی نظر فکری تصور شود، حق (الحق) عین فکر ایشان خواهد بود، همان‌گونه که عین علم و عین بصر و سمع ایشان بود. اما برای کسی که مشهد (محل شهود) و ذوقش این باشد، تصور نمی‌شود که هرگز در چیزی فکری داشته باشد. بلکه او همراه با چیزی است که به او وحی می‌شود، بر اساس اختلاف انواع وحی. و یکی از انواع وحی، فهمیدن از جانب خداوند به صورت ابتدایی و بدون تفکر است.\n\nپس اگر فهم از طریق تفکر به او داده شود، او آن مرد (کامل) نیست؛ زیرا فهمی که از تفکر حاصل می‌شود، گاهی درست است و گاهی خطا. اما فهمی که بدون تفکر است، وحی صحیح و صریح از جانب خداوند به بنده اوست. و ذوق انبیاء (علیهم السلام) در این وحی، بر ذوق اولیاء فزونی دارد. زیرا پذیرنده اخص (خاص‌تر) در اعم (عام‌تر)، محصّل اعم است؛ اما پذیرنده اعم که اخص در آن مشخص نیست، ذوق اخص در آن برایش حاصل نمی‌شود، اگرچه اخص در آن مندرج باشد. پس در ذوق حکمی برای او نیست، اگرچه در کل حکم داشته باشد، اما قادر به تفکیک نیست. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}