{
  "id": 206,
  "title": {
    "ar": "الباب السادس ومائتان في حال التجلي بالجيم",
    "en": "Chapter Two Hundred and Six: Concerning the State of the Theophany (التجلي) associated with the letter Jīm.",
    "ur": "باب دو سو چھ: ظہور الٰہی (التجلی) کی حالت میں، جو حرف جیم سے متعلق ہے۔",
    "fa": "باب دویست و ششم در حال التجلی (التجلي) با حرف جیم."
  },
  "content": {
    "ar": "## «الباب السادس ومائتان في حال التجلي بالجيم»\n\n\n> للغيب نور على البصائر *** يظهر ما كان في السرائر\n\n\n> لكل قلب من كل شخص *** أحضره الحق في المحاضر\n\n\n> فشاهد الأمر كيف يجري *** وعاين الحكم في المقادر\n\n\n> فعنده أول وظاهر *** وعندنا باطن وآخر\n\n\n> قسمه كالصلاة فينا *** عينا لعين فاشكر وبادر\n\n\n> ما بين عبد حبيس عجز *** وبين رب عليه قادر\n\n\n> بفضله قد سرى إلينا *** ما يحمد الله في الضمائر\n\n\n### [التجلي ما ينكشف للقلوب من أنوار الغيوب‏]\n\n\nاعلم أن التجلي عند القوم ما ينكشف للقلوب من أنوار الغيوب وهو على مقامات مختلفة فمنها ما يتعلق بأنوار المعاني المجردة عن المواد من المعارف والأسرار ومنها ما يتعلق بأنوار الأنوار ومنها ما يتعلق بأنوار الأرواح وهم الملائكة ومنها ما يتعلق بأنوار الرياح ومنها ما يتعلق بأنوار الطبيعة ومنها ما يتعلق بأنوار الأسماء ومنها ما يتعلق بأنوار المولدات والأمهات والعلل والأسباب على مراتبها فكل نور من هذه الأنوار إذا طلع من أفق ووافق عين البصيرة سالما من العمي والغشي والصدع والرمد وآفات الأعين كشف بكل نور ما انبسط عليه فعاين ذوات المعاني على ما هي عليه في أنفسها وعاين ارتباطها بصور الألفاظ والكلمات الدالة عليها وأعطته بمشاهدته إياها ما هي عليه من الحقائق في نفس الأمر من غير تخيل ولا تلبيس فمنها أنوار نسعى بها ومنها أنوار نسعى إليها ومنها أنوار نسعى منها ومنها أنوار تسعى بين أيدينا ومنها أنوار تكون خلفنا يسعى بها من يقتدي بنا ومنها أنوار تكون عن إيماننا تؤيدنا ومنها أنوار تكون عن شمائلنا تقينا ومنها أنوار تكون فوقنا تنزل علينا لتفيدنا ومنها أنوار تكون تحتنا نملكها بالتصرف فيها ومنها أنوار نكونها هي أبشارنا وفي أبشارنا وأشعارنا وفي أشعارنا وهي غاية الأمر فأما أنوار المعاني المجردة عن المواد فكل علم لا يتعلق بجسم ولا جسماني ولا متخيل ولا بصورة ولا نعلمه من حيث تصوره بل نعقله على ما هو عليه ولكن بما نحن عليه ولا يكون ذلك إلا حتى أكون نورا فما لم أكن بهذه المثابة فلا أدرك من هذا العلم شيئا وهو قوله‏\n\n\nفي دعائه صلى الله عليه وسلم واجعلني نورا\n\n\nوالله يقول الله نُورُ السَّماواتِ والْأَرْضِ فما أنارت إلا به كما قال وأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّها يعني أرض المحشر يقول ما ثم شمس وعدم النور ظلمة ولا بد من الشهود فلا بد من النور وهو يوم يأتي فيه الله للفصل والقضاء فلا يأتي إلا في اسمه النور فتشرق الأرض بنور ربها وتعلم كل نفس بذلك النور ما قَدَّمَتْ وأَخَّرَتْ لا بها تجده محضرا يكشفه لها\nذلك النور ولو لا ما هي النفوس عليه من الأنوار ما صحت المشاهدة إذ لا يكون الشهود إلا باجتماع النورين ومن كان له حظ في النور كيف يشقى شقاء الأبد والنور ليس من عالم الشقاء وما من نفس إلا ولها نور تكشف به ما عملت فما كان من خير سرت به وما كان من سوء تَوَدُّ لَوْ أَنَّ بَيْنَها وبَيْنَهُ أَمَداً بَعِيداً ولهذا ختم الآية بقوله والله رَؤُفٌ بِالْعِبادِ حيث جعل لهم أنوارا يدركون بها\n\n\n### [أن للنور حظ في السعادة]\n\n\nوقد علموا أن النور لا حظ له في الشقاء فلا بد أن يكون المال إلى الملائم وحصول الغرض وذلك هو المعبر عنه بالسعادة لأنه قال كل نفس فعم وما خص نفسا من نفس وذكر الخير والشر فالوجود نور والعدم ظلمة فالشر عدم ونحن في الوجود فنحن في الخير وإن مرضنا فإنا نصح فإن الأصل جابر وهو النور وهكذا صفة كل نور إنما جاء ليظهر ما طلع عليه فلا تدرك الأشياء إلا بك وبه فلهذا لا يصح نتيجة أي لا تكون إلا بين اثنين أصلها الاقتدار الإلهي وقبول الممكن للانفعال لو نقص واحد من هاتين الحقيقتين لما ظهر للعالم عين فقد أعطيناك أمرا كليا في هذه الأنوار فلا نتكلف بسطها مخافة التطويل والأحوال لا تحتمل الإسهاب فلنذكر مبهمات الأنوار فأما النور الذي نسعى به فهو ما تقدم ذكره من أنوار المعلومات التي اكتفينا بذكر واحد منها ليكون تنبيها وأنموذجا لما سكتنا عنه وأما النور الذي بين أيدينا فهو نور الوقت والوقت ما أنت به فنوره ما أنت به فانظر فيه كيفما كان فهو مشهودك الحاكم عليك والقائم بك وهو عين الاسم الإلهي الذي أنت به قائم في الحال لا حكم له في ماض ولا مستأنف وأما النور الذي عن يمينك فهو المؤيد لك والمعين على ما يطلبه منك النور الذي بين يديك وهو الذي طلبت من الله في حال صلاتك في قولك وإِيَّاكَ نَسْتَعِينُ والصلاة نور وهي النور الذي بين يديك فهو وقتك الذي أنت به فلما قلت وإِيَّاكَ نَسْتَعِينُ أيدك بالنور من عن يمينك فإن اليمين القوة يقول الشاعر\n\n\n> إذا ما راية رفعت لمجد *** تلقاها عرابة باليمين‏\n\n\nوأما النور الذي عن يسارك فهو نور الوقاية والجنة من الشبه المضلة المؤثرة في النفوس الجهالات والالتباس والتشكيك الذي يخطر للناظر الباحث في الاعتقاد في الله وفيما أخبر به عن نفسه وهو على نوعين نور إيمان ونور دليل ونور الدليل على نوعين نور نظر فكري ونور نظر كشفي فيعلم الأمر على ما هو عليه في نفسه فهذا فائدة النور الذي يأتي عن الشمال وأما النور الذي خلفنا فهو النور الذي يَسْعى‏ بين يدي من يقتدي بنا ويتبعنا على مدرجتنا فهو لهم من بين أيديهم وهو لنا من خلفنا فيتبعنا على بصيرة من أجل ذلك النور الذي يخرجهم عن التقليد قال أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي فهو بالنور الذي بين يديه يدعو على بصيرة والداعي المتبع له يدعو بالنور الذي خلفه ليكون هذا المتبع أيضا على بصيرة فيما يدعو إليه مثل من اتبعه وبذلك النور يرى من خلفه مثل ما يرى من بين يديه وهذا مقام نلته سنة ثلاث وتسعين وخمسمائة بمدينة فاس في صلاة العصر وأنا أصلي بجماعة بالمسجد الأزهر بجانب عين الجبل فرأيته نورا يكاد يكون أكشف من الذي بين يدي غير أني لما رأيته زال عني حكم الخلف وما رأيت لي ظهرا ولا قفا ولم أفرق في تلك الرؤية بين جهاتي بل كنت مثل الأكرة لا أعقل لنفسي جهة إلا بالفرض لا بالوجود وكان الأمر كما شاهدته مع أنه كان قد تقدم لي قبل ذلك كشف الأشياء في عرض حائط قبلتي وهذا كشف لا يشبه هذا الكشف وأما النور الذي من فوقي فهو تنزل نور إلهي قدسي بعلم غريب لم يتقدمه خبر ولا يعطيه نظر وهذا النور هو الذي يعطي من العلم بالله ما ترده الأدلة العقلية إذا لم يكن لها إيمان فإن كان لها إيمان نوراني قبلته بتأويل لتجمع بين الأمرين وأما النور الذي من تحتنا فهو النور الذي يكون تحت حكمنا وتصريفنا لا يقترن معه فينا أمر إلهي نقف عنده فلا نصرفه إلا فيه وأما الأنوار التي نسعى بها فهي أنوار المعية من جانب الحق في قوله وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ لذلك قلنا من جانب الحق فإنه لا يختص بهذه المعية شي‏ء من خلق الله دون غيره ولها الاسم الحفيظ والمحيط فإن لله مع بعض عباده معية اختصاص مثل معيته مع موسى وهارون في قوله إِنَّنِي مَعَكُما أَسْمَعُ وأَرى‏ فهذه بشرى لهما حتى لا يخافا فإنهما قالا إِنَّنا نَخافُ أَنْ يَفْرُطَ عَلَيْنا أَوْ أَنْ يَطْغى‏ أي يتقدم ويرتفع بالحجة إذ له الملك والسلطان فآمنهما الله مما خافا منه ومن هنا\n\n\nتعرف مرتبة محمد صلى الله عليه وسلم وعلوها على رتبة غيره من الرسل فإن الله أخبر عن محمد صلى الله عليه‏\nوسلم في حال خوف الصديق عليه وعلى نفسه فقال لصاحبه يؤمنه ويفرحه إِذْ هُما في الْغارِ وهو كنف الحق عليهما لا تَحْزَنْ إِنَّ الله مَعَنا فقام النبي صلى الله عليه وسلم في هذا الإخبار مقام الحق في معيته لموسى وهارون وناب منابه هكذا تكون العناية الإلهية فهذا هو النور الذي يسعى به وهو لا يزال ساعيا فلا يزال الحق معه حافظا وناصرا لا خاذلا ولهذا وقع الإخبار لنا من الله على لسان رسوله صلى الله عليه وسلم أنا إذا أتينا بنوافل الخيرات لا بفرائضها أحبنا الحق فكان سمعنا الذي نسمع به ورجلنا التي نسعى بها إلى جميع قوانا وأعضائنا فهذا ما أعطت النوافل فينا من الحق فأين أنت مما تعطيه الفرائض فكم بين عبودية الاضطرار وعبودية الاختيار تقع المشاركة مع الحق في عبودة الاختيار في أحاديث نزوله في الخطاب إلى عبده مثل الشوق والجوع والعطش والمرض وأشباه ذلك وعبودة الاضطرار لا تقع فيها مشاركة فهي مخلصة للعبد فمن أقيم فيها فلا مقام فوقها يقول الله لأبي يزيد تقرب إلي بما ليس لي الذلة والافتقار فعين القربة هنا هو عين البعد من المقام فافهم وأما النور الذي نسعى منه فهو نور الحقيقة سواء علمها أو لم يعلمها فيكشفها بهذا النور ويكشف أنه سعى منه ثم ينكشف له النور الذي يسعى إليه وهو الشريعة فصاحب هذا المقام هو المعصوم المحفوظ المعتنى به العالم الذي لا يجهل لاتصافه بالعلم الذي لا جهل فيه فإن ثم عبيدا يسعون من نور الشريعة إلى نور الحقيقة ويخاف عليهم وهؤلاء الذين يسعون على كشف من نور الحقيقة إلى نور الشريعة آمنون من هذا المكر الإلهي فهم على بصيرة من أمرهم وهؤلائك تحت خطر عظيم يمكن أن يعصموا فيه ويمكن أن يخذلوا فاعلم ذلك وأما أنوار المولدات فهي أنوار تعطيه بذاتها علما صحيحا من العلم بالله يكشف بها نسبة الحق وصورته في صور أعيان المعادن والنبات والحيوان وهم لا يعلمون وما زاد الإنسان على هؤلاء إلا بكشفه ذلك فالمولدات في هذا المقام بمنزلة قوله وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ والإنسان فيه بمنزلة لا تَحْزَنْ إِنَّ الله مَعَنا وإِنَّنِي مَعَكُما أَسْمَعُ وأَرى‏ فإنه صورة كل شي‏ء في نفس الأمر فمن علمه وكشفه بهذا النور كان من أهل الاختصاص فهو يرى الأشياء أعيانا بصورة حقية وأخبرني من أثق بنقله في هذه المسألة إن شخصا كان بدمشق له هذا المقام لا يزال رأسه بين ركبتيه فإذا نظر إلى الأشياء في رفع رأسه لا يزال يقول أمسكوه أمسكوه والناس لا يعلمون ما يقول فيرمونه بالتوله وأما أنا فذقته لله الحمد على ذلك‏\n\n\n### [أنوار الأسماء التي يتعلق بالذات والصفات‏]\n\n\nوأما أنوار الأسماء فهي التي تظهر مسمياتها حقا وخلقا مما يتعلق بالذات والصفات والأفعال في الإلهيات منها ما يتعلق بأجناس الممكنات وأشخاصها منها من الأسماء التي وضعها الحق لها وبلغتها الرسل لا ما وقع عليه الاصطلاح وهذه الأنوار التي كانت لآدم عليه السلام حين علم جميع الأسماء بالوضع الإلهي لا بالاصطلاح وفي ذلك تكون الفضيلة والاختصاص فإن لله أسماء أوجد بها الملائكة وجميع العالم ولله أسماء أوجد بها جامع حقائق الحضرة الإلهية وهو الإنسان الكامل ظهر ذلك بالنص في آدم وخفي في غيره فقال للملائكة في فضل آدم وفي فضل هذا المقام وقد أحضر للملائكة المسميات أعني أعيانهم أَنْبِئُونِي بِأَسْماءِ هؤُلاءِ إِنْ كُنْتُمْ صادِقِينَ أي بالأسماء الإلهية التي صدروا عنها فلم يعلموا ذلك ذوقا فإن علوم الأكابر ذوقا فإنه عن تجل إلهي فقال الله يا آدَمُ أَنْبِئْهُمْ بِأَسْمائِهِمْ فأنبأهم آدم بأسمائهم الإلهية التي أوجدتهم وأسندوا إليها في إيجاد أعيانهم لا أسماء الاصطلاح الوضعي الكوني فإنه لا فائدة فيه إلا بوجه بعيد أضربنا عن ذكره حين علمنا أنه لم يكن المقصود فإنا ما نتكلم ولا نترجم إلا عما وقع من الأمر لا عما يمكن فيه عقلا وهذا الفرق بين أهل الكشف فيما يخبرون به وهم أهل البصائر وبين أهل النظر العقلي والفائدة إنما هي فيما وقع لا فيما يمكن فإن ذلك علم لا علم وما وقع فهو علم محقق‏\n\n\n### [الأنوار الطبيعة]\n\n\nوأما أنوار الطبيعة فهي أنوار يكشف بها صاحبها ما تعطيه الطبيعة من الصور في الهباء وما تعطيه من الصور في الصورة العامة التي هي صورة الجسم الكل وهذه الأنوار إذا حصلت على الكمال تعلق علم صاحبها بما لا يتناهى وهو عزيز الوقوع عندنا وأما عند غيرنا فهو ممنوع الوقوع عقلا حتى إن ذلك في الإله مختلف فيه عندهم وما رأينا أحدا حصل له على الكمال ولا سمعنا عنه ولا حصل لنا وإن ادعاها إنسان فهي دعوى لا يقوم عليها دليل أصلا مع إمكان حصول ذلك وأنوار الطبيعة مندرجة في كل ما سوى الحق وهي نفس الرحمن الذي نفس الله به عن الأسماء الإلهية وأدرجها الله في الأفلاك والأركان وما يتولد من الأشخاص إلى ما لا يتناهى‏\n\n\n### [أنوار الرياح‏]\n\n\nوأما أنوار الرياح فهي أنوار عنصرية أخفاها شدة ظهورها فغشيت الأبصار عن إدراكها وما شاهدتها\nإلا في الحضرة البرزخية وإن كان الله قد أتحفنا برؤيتها حسا بمدينة قرطبة يوما واحدا اختصاصا إلهيا وورثا نبويا محمديا وهذه الأنوار الرياحية لها سلطان وقوة على جميع بنى آدم إلا أهل الله فإن هذه الأنوار تندرج في أنوارهم اندراج أنوار الكواكب في نور الشمس وذلك لضعف نور البصر وإذا غشيت هذه الأنوار من شاء الله من العامة لا تغشاه إلا كالسحاب المظلم وإذا غشيت أهل الله لا تغشاهم إلا وهي أنوار على هيأتها\n\n\n### [أنوار الأرواح‏]\n\n\nوأما أنوار الأرواح فمنا من يجعلها أنوار العقول ومنا من يجعلها أنوار الرسل ولها القوة والسلطان والنفوذ في الكون لا يقف لها شي‏ء غير أن لها حدودا تقف عندها لا تتعداها إذا شاهدها العبد يكشف بها ما غاب من العلوم المضنون بها على غير أهلها وهي أنوار سبوحية\n\n\nقدوسية تنزل من الحق المخلوق به إلى سدرة المنتهى وتطرح شعاعاتها على قلوب العارفين أهل الشهود التام فقلوبهم مطارح شعاعات هذه الأنوار وليس في هذا الصنف الإنساني أكمل منهم في العلم فإن هذه الأنوار لا يقف لها حجاب إلا المشيئة الإلهية خاصة وقليل من عباد الله من تطرح على قلبه هذه الأنوار شعاعاتها على الكشف وهي مجالي الصادقين من عباد الله تعالى‏\n\n\n### [أنوار الأنوار]\n\n\nوأما أنوار الأنوار فهي السبحات التي لو كشف الحق الحجاب الذي يسترها عنا لاحترقنا هي أشعة ذاتية إذا انبسطت ظهرت أعيان الممكنات فالممكنات هي الحجاب بيننا وبينها وهذا هو النور العظيم لا الأعظم إليه الإشارة بقوله تعالى في حق أهل الكتب الإلهية المنزلة بالأعمال المشروعة بقوله ولَوْ أَنَّهُمْ أَقامُوا التَّوْراةَ وهم الموسويون والْإِنْجِيلَ وهم العيسويون وما أُنْزِلَ إِلَيْهِمْ من رَبِّهِمْ وهم أصحاب الصحف وما بقي من الكتب لَأَكَلُوا من فَوْقِهِمْ وهي علوم خارجة عن الكسب ومن تَحْتِ أَرْجُلِهِمْ وهي علوم دخلت تحت الكسب فهي من علوم التحت والفوق وإنه إذا كان النور بهذه الصفة لم يكن من تحتنا بل يكون هو الذي يصرفنا وأما النور الذي يكون من تحتنا فهو الذي نحكم عليه وهو المعبر عنه بالأكل من تحت الأرجل وأما النور الذي هو عين ذاتنا فهو كما\n\n\nدعا فيه صلى الله عليه وسلم واجعلني نورا\n\n\nفهو عين ذاته ورواية واجعل لي نورا\n\n\nهو جميع ما ذكرنا من الأنوار وأما قوله اجعلني نورا فهو مشاهدة نور ذاته إذ لا يشهد إلا به فإن ذاته ما قبلت هذه الأنوار من هذه الجهات الست إلا لعدم إدراكها نور نفسها الذي‏\n\n\nقال في ذلك رسول الله صلى الله عليه وسلم من عرف نفسه عرف ربه‏\n\n\nوالله نُورُ السَّماواتِ والْأَرْضِ ومثله بما مثله وهو أنت عين ذلك الممثل والمثل فتشاهد الأنوار منفهقة منك يتنور بذاتك عالم سماواتك وأرضك فما تحتاج إلى نور غريب تستضي‏ء به فأنت المصباح والفتيلة والمشكاة والزجاجة وإذا عرفت هذا عرفت الزيت وهو الإمداد الإلهي وعرفت الشجرة وإذا كانت الزجاجة كالكوكب الدري وهو الشمس هنا فما ظنك بالمصباح الذي هو عين ذاتك فلا يكن يا أخي دعاؤك أبدا إلا أن يجعلك الله نورا وهنا سر عجيب أنبهك عليه من غير شرح لأنه لا يحتمل الشرح وهو أن الله يضرب الأمثال لنفسه ولا تضرب له الأمثال فيشبه الأشياء ولا تشبهه الأشياء فيقال مثل الله في خلقه مثل الملك في ملكه ولا يقال مثل الملك في ملكه مثل الله في خلقه فإنه عين ما ظهر وليس ما ظهر هو عينه فإنه الباطن كما هو الظاهر في حال ظهوره فلهذا قلنا هو مثل الأشياء وليست الأشياء مثله إذ كان عينها وليست عينه وهذا من العلم الغريب الذي تغرب عن وطنه وحيل بينه وبين سكنه فأنكرته العقول لأنها معقولة غير مسرحة وهذا انموذج من تجلى أنوار الأنوار\n\n\n### [أنوار المعاني المجردة عن المواد]\n\n\nوأما أنوار المعاني المجردة عن المواد فلا تنقال فإنه لو انقالت لدخلت في المواد لأن العبارات من المواد وقد قلنا إنها مجردة لذاتها عن المواد لا إنها تجردت لأنها لو تجردت لكسوناها المواد إذا شئنا ولم تمتنع لأنها قد كانت فيها فهي تعلم خاصة ولا تقال ولا تحكي ولا تقبل التشبيه ولا التمثيل‏\n\n\n### [أنوار الأرواح‏]\n\n\nوأما أنوار الأرواح فهي أنوار روح القدس الجامع فمن أرسل من هذه الأرواح كان ملكا ومن لم يرسل بقي عليه اسم الروح مع الاسم الخاص به العلم في الطائفتين المرسلين وغير المرسلين فهو روح خالص لم يشبه ما يخرجه عن نفسه وهو روح ذو روح في روحيته وليس إلا الأرواح المهيمة وأرواح الأفراد منا تشبهها بعض شبه فلا يقع التجلي في أنوار أرواح إلا للافراد ولهذا قال الخضر لموسى ما لَمْ تُحِطْ به خُبْراً لأنه من الأفراد وإن الأنبياء يقع لهم التجلي في أنوار الأرواح الملائكة وليس للافراد هذا التجلي بل هو مخصوص بالأنبياء والرسل وهو قول خضر أنت على علم علمكه الله لا أعلمه أنا لأنه ليس له هذا التجلي‏\nالملكي ثم نبهه على أنه ما فعل الذي فعل عن أمره فإنه ليس له أمر وما هو من أهل الأمر وهو مقام غريب في المقامات لو أن الله تعالى يبيح لنا كشفه للخلق لظهر علم لا يقوم له كون هذا قد ظهر من أثره ثلاث مسائل من شخص قد شهد الله عند نبيه بعدالته وزكاه وصار تبعا له وبين له ما قد سمعت وأدخل نفسه في أتباعه تحت شرطه وهو مثل موسى كليم الله ونجيه وأين كلامه مع ربه من كلامه مع الخضر فاختلف التجلي في الكلام ومع هذا لم يصبر لأنه قدم الاستثناء ولم يقدمه لما أنكر عليه فإنه من شأن النبي أن يكون متبعا كما هو متبع سواء وكذلك قال إِنْ أَتَّبِعُ إِلَّا ما يُوحى‏ إِلَيَّ ما قال أن أفعل أو أقول إلا ما أشهد ما قال هكذا فكل مقام له مقال ولسان‏\n\n\n### [أنوار الرياح‏]\n\n\nوأما أنوار الرياح فهي تجليات الاسم البعيد وهي تجليات لا ينبغي أن يذكر اسمها ولا تكون إلا لأهل الإلهام وللتجلي في أنوار الملائكة في هذا مدخل ولكن في الباطن لا في الظاهر خاصة وهم ملائكة اللمات والإلهام خاصة والإلقاء في هذا التجلي على النفوس ومن هذا التجلي تكون الخواطر وهي رياحية كلها لأن الرياح تمر ولا تثبت فإن قال أحد بثبوتها فليست ريحا ولذلك توصف بالمرور وتسمى بالخواطر وهي من راح يروح والرائح ما هو مقيم وأما التجلي في الأنوار الطبيعية فهو التجلي الصوري المركب فيعطي من المعارف بحسب ما ظهر فيه من الصور وهو يعم من الفلك إلى أدنى الحشرات وهو السماء والعالم فهو تجل في السماء والعالم ومن هذا التجلي تعرف المعاني واللغات وصلاة كل صورة وتسبيحها وهو كشف جليل نافع مؤيد فيه يرى المكاشف موافقة العالم وأنه ما ثم مخالفة ومن هنا يرى كل شي‏ء يُسَبِّحُ بِحَمْدِهِ وصاحب هذا المقام يرى على الشهود صور أعماله تكون حية مسبحة لله ذات روح ينفخ فيها صاحب هذا المقام وإن كانت في ظاهر الكون مخالفة ومعصية فإنها مخالفة صحيحة إلا أنها حية ناطقة تستغفر لصاحبها لأنه سوى نشأتها مخلقة وقد تمدح الله بأنه خلق فسوى ومن تسوية نشأتها مخلقة إنه لم يخرجها عن كونها معصية فلو أخرجها عن كونها معصية كانت غير مخلقة وشقي صاحبها وكان تسبيحها لعنة صاحبها فإنه أباح ما حرم الله فخرج عن الايمان بذلك فلا حظ له في الإسلام إلا أن يجدد إسلامه ويتوب وهذا تنبيه لم يزل أصحابه يكتمونه غيرة منهم وضعفا والتنبيه عليه أولى لأنها نصيحة لله ولرسوله ولأئمة المسلمين وعامتهم فلا توجد أبدا معصية مخلقة إلا من مؤمن ومن أعطى الشي‏ء خلقه فقد جرى على السنن الإلهي فإن الله أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ فأعطى المعصية خلقها والطاعة خلقها فهكذا تكون صفة المؤمن‏\n\n\n### [أنوار الأسماء]\n\n\nوأما أنوار الأسماء فإنها تعين أسماء المعلومات فهو نور ينبسط على المعدومات والموجودات فلا يتناهى امتداد انبساطها وتمشي العين مع انبساطها فينبسط نور عين صاحب هذا المقام فيعلم ما لا يتناهى كما لا يجهل ما لا يتناهى بتضاعف الأعداد وهذا علامة من يكون الحق بصره فالأسماء كلها موجودة والمسميات منها ما هي معدومة العين لذاتها ومنها ما هي متقدمة العدم لذاتها وهي التي تقبل الوجود والأحوال لا تقبل الوجود مع إطلاق الاسم على كل ذلك فللأسماء الإحاطة والإحاطة لله لا لغيره فمرتبة الأسماء الإلهية وما فضل آدم الملائكة إلا بإحاطته بعلم الأسماء فإنه لو لا الأسماء ما ذكر الله شيئا ولا ذكر الله شي‏ء فلا يذكر إلا بها ولا يذكر ويحمد إلا بها فما زاحم صفة العلم في الإحاطة إلا القول والقول كله أسماء ليس القول غير الأسماء والأسماء علامات ودلائل على ما تحتها من المعاني فمن ظهر له نور الأسماء فقد ظهر له ما لا يمكن ذكره لا أقول غير ذلك ولو لا أن الحق أطلق لفظة الكل على الأسماء في صفة علم آدم لقلنا من المحال أن يظهر انبساط نور الأسماء على المسميات لعين ولكن من فهم قول الله تعالى ثُمَّ عَرَضَهُمْ عَلَى الْمَلائِكَةِ فَقالَ أَنْبِئُونِي بِأَسْماءِ هؤُلاءِ وأشار علم ما التزمناه من الأدب وما أراد الله بلفظة كل في هذا التشريف‏\n\n\n### [أنوار المولدات والأمهات والعلل والأسباب‏]\n\n\nوأما أنوار المولدات والأمهات والعلل والأسباب فهو تجل إلهي من كونه مؤثرا ومن كونه مجيبا إذا سئل وغافرا إذا استغفر ومعطيا إذا سئل وبهذا التجلي وهذه الأنوار تعلم قوله إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ الله وقوله أيضا عز وجل من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله وقوله تبارك وتعالى إن الصدقة تقع بيد الرحمن‏\n\n\nوقوله وأَقْرِضُوا الله قَرْضاً حَسَناً وقوله عليه السلام إن الله يفرح بتوبة عبده‏\n( «بسم الله الرحمن الرحيم»)\n\n",
    "en": "Chapter 206: Concerning the State of Theophany (التجلي)\n\nA light of the Unseen (الغيب) shines upon the inner visions (البصائر),\nRevealing what was hidden in the secrets (السرائر).\n\nFor every heart of every person,\nWhom The Real (الحق) has brought into the Presences (المحاضر).\n\nSo he witnesses how the affair proceeds,\nAnd observes the decree within the destinies (المقادر).\n\nFor Him, there is the First and the Manifest,\nAnd for us, the Inner and the Last.\n\nHe divided it among us like the Prayer (الصلاة),\nEssence to essence (عين لعين), so be thankful and hasten.\n\n[This division exists] between a servant imprisoned by incapacity,\nAnd a Lord who is powerful over him.\n\nBy His grace, that which praises Allah in the innermost consciousness (الضمائر)\nHas flowed to us.\n\n### [Theophany (التجلي) is what is unveiled to the hearts from the lights of the Unseen (الغيوب)]\n\nKnow that Theophany (التجلي), according to the People [Sufis], is what is unveiled to the hearts from the lights of the Unseen (الغيوب). It occurs at different levels (مقامات). Some of it relates to the lights of meanings abstracted from matter, consisting of gnosis (المعارف) and secrets (الأسرار). Some relates to the lights of lights (أنوار الأنوار). Some relates to the lights of the Spirits (الأرواح), which are the angels. Some relates to the lights of the Winds (الرياح). Some relates to the lights of Nature (الطبيعة). Some relates to the lights of the Names (الأسماء). And some relates to the lights of the Generated Things (المولدات), the Mothers (الأمهات), the Causes (العلل), and the Reasons (الأسباب), according to their levels (مراتب).\n\nEvery light among these lights, when it rises from a horizon and meets the eye of the inner vision (البصيرة)—being safe from blindness, dimness, splitting, ophthalmia, and the afflictions of the eyes—unveils, by means of that light, whatever is spread out upon it. Thus, the observer perceives the essences of the meanings (ذوات المعاني) as they are in themselves, and observes their connection to the forms of the words and phrases that indicate them. His witnessing of them grants him the realities (الحقائق) they possess in the matter itself, without imagination (تخيل) or confusion.\n\nAmong these are lights by which we strive, lights toward which we strive, lights from which we strive, lights that strive before us, lights that are behind us by which those who follow us strive, lights that are on our right supporting us, lights that are on our left protecting us, lights that are above us descending upon us to benefit us, lights that are beneath us which we possess through our disposal of them, and lights that we ourselves are—they are our skins, within our skins, our hairs, and within our hairs—and this is the ultimate goal.\n\nAs for the lights of meanings abstracted from matter, they constitute every knowledge that does not relate to a body, nor to anything corporeal, nor to anything imagined, nor to a form; nor do we know it through its conceptualization, but rather we comprehend it as it is. This cannot occur unless I myself become a light. Unless I am in this state, I cannot grasp anything of this knowledge. This is reflected in his prayer, peace and blessings be upon him: \"And make me a light.\"\n\nAnd Allah says: <<اللهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ>> (Allah is the Light of the heavens and the earth). They were only illuminated by Him, just as He said: <<وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّهَا>> (And the earth will shine with the light of its Lord)—meaning the land of the Gathering (al-Maḥshar). He means there is no sun there, and the absence of light is darkness; and witnessing (الشهود) is necessary, so light is necessary. It is the Day when Allah comes for the separation and judgment, and He only comes in His Name, The Light (al-Nūr). So the earth shines with the light of its Lord, and every soul knows by means of that light <<مَا قَدَّمَتْ وَأَخَّرَتْ>> (what it has sent forth and held back). It does not find it by itself, but present, unveiled for it by that light. Were it not for the lights that the souls possess, the witnessing (المشاهدة) would not be valid, since witnessing only occurs through the convergence of the two lights. And whoever has a portion of the light, how can he suffer eternal wretchedness, when light is not of the realm of wretchedness? There is no soul except that it has a light by which it unveils what it has done. Whatever was good, it rejoices in it; and whatever was evil, <<تَوَدُّ لَوْ أَنَّ بَيْنَهَا وَبَيْنَهُ أَمَدًا بَعِيدًا>> (it wishes that between itself and it were a great distance). For this reason, He concluded the verse by saying: <<وَاللَّهُ رَءُوفٌ بِالْعِبَادِ>> (And Allah is Kind to the servants), since He granted them lights by which they perceive.\n\n### [That Light has a share in Felicity (السعادة)]\n\nThey have known that light has no share in wretchedness, so the outcome must necessarily be conformity and the attainment of the purpose, which is what is expressed as felicity (السعادة). This is because He said \"every soul,\" generalizing and not specifying one soul over another, and mentioned good and evil. Existence (الوجود) is light, and non-existence (العدم) is darkness. Evil is non-existence, and since we are in Existence, we are in good. Even if we fall ill, we will recover, for the origin is restorative, and that is the Light.\n\nThis is the characteristic of every light: it only comes to manifest what it shines upon. Things are not perceived except by you and by it. For this reason, a result is not valid—meaning it only occurs between two things: its origin is the Divine Power (الاقدار الإلهي) and the receptivity of the contingent (الممكن) to being acted upon. If one of these two realities were missing, no entity (عين) would appear to the cosmos.\n\nWe have given you a universal principle concerning these lights, and we will not elaborate on them for fear of prolixity, as the spiritual states (الأحوال) do not tolerate excessive detail. So let us mention the general categories of the lights.\n\nAs for the light by which we strive, it is what was previously mentioned concerning the lights of the known things (المعلومات), of which we sufficed by mentioning one, so that it may serve as an indication and a model for what we have omitted.\n\nAs for the light that is before us, it is the light of the Moment (الوقت), and the Moment is that by which you exist. Its light is that by which you exist, so look into it however it may be, for it is your witnessed reality (مشهودك), which rules over you and sustains you. It is the very essence of the Divine Name (الاسم الإلهي) by which you are sustained in the present state (الحال); it has no ruling power over the past or the future.\n\nAs for the light on your right, it is that which supports you and assists you in fulfilling what the light before you demands of you. It is that which you sought from Allah during your prayer when you said: <<وَإِيَّاكَ نَسْتَعِينُ>> (And You alone we ask for help). And the Prayer (الصلاة) is a light, and it is the light before you—it is your Moment by which you exist. So when you said, \"And You alone we ask for help,\" He supported you with the light from your right, for the right side (اليمين) signifies strength. The poet says:\n\nWhen a banner is raised for glory,\n‘Urābah receives it with the right hand.\n\nAs for the light on your left, it is the light of protection (الوقاية) and the shield against misleading ambiguities (الشبه المضلة), the ignorance, confusion, and doubt that affect the souls and occur to the observer searching for belief in Allah and in what He has revealed about Himself. This is of two types: the light of faith and the light of proof. The light of proof is also of two types: the light of intellectual contemplation and the light of unveiling observation (كشف), whereby one knows the matter as it is in itself. This is the benefit of the light that comes from the left.\n\nAs for the light behind us, it is the light that strives before those who follow us and pursue our path. It is before them, but it is behind us. They follow us with inner vision (بصيرة) because of that light which removes them from blind imitation (التقليد). He said: <<أَدْعُوا إِلَى اللهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي>> (I call unto Allah upon clear insight—I and those who follow me). So he calls upon clear insight by means of the light before him, and the caller who follows him calls by means of the light behind him, so that this follower is also upon clear insight in what he calls to, just like the one he followed. And by means of that light, he sees what is behind him just as he sees what is before him.\n\nThis is a station (مقام) I attained in the year 593 AH in the city of Fez, during the afternoon prayer, while I was praying with a congregation in the Azhar Mosque beside the Mountain Spring. I saw it as a light that was almost clearer than the one before me, except that when I saw it, the ruling of the back vanished from me, and I saw neither a back nor a nape for myself. In that vision, I did not distinguish between my directions; rather, I was like a sphere (الأكرة), not comprehending a direction for myself except by assumption, not by existence. The matter was as I witnessed it, even though I had previously experienced the unveiling (كشف) of things across the wall of my *qibla*. But this unveiling does not resemble that unveiling.\n\nAs for the light from above me, it is the descent of a holy Divine Light (نور إلهي قدسي) bearing an extraordinary knowledge (علم غريب) that was not preceded by information and is not granted by contemplation. This light is what grants knowledge of Allah that intellectual proofs (الأدلة العقلية) reject if they lack faith. But if they possess luminous faith, they accept it through interpretation (تأويل) in order to reconcile the two matters.\n\nAs for the light beneath us, it is the light that is under our rule and disposal; no Divine Command (أمر إلهي) is associated with it in us that would make us stop short, so we only dispose of it within itself.\n\nAs for the lights by which we strive, they are the lights of accompaniment (المعية) from the side of The Real (الحق) in His saying: <<وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ>> (And He is with you wherever you are). For this reason, we said \"from the side of The Real,\" because nothing among Allah’s creation is singled out for this accompaniment over another. And it possesses the Names The Preserver (الحفيظ) and The All-Encompassing (المحيط). For Allah has a special accompaniment (معية اختصاص) with some of His servants, like His accompaniment with Moses and Aaron in His saying: <<إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَى>> (Indeed, I am with you both; I hear and I see). This was good news for them so that they would not fear, for they had said: <<إِنَّنَا نَخَافُ أَنْ يَفْرُطَ عَلَيْنَا أَوْ أَنْ يَطْغَى>> (Indeed, we fear that he may hasten [in punishment] against us or that he may transgress)—meaning, he may precede [us] or rise up with proof, since he possesses the kingdom and authority. So Allah secured them from what they feared.\n\nFrom this, you know the rank (مرتبة) of Muhammad, peace and blessings be upon him, and its superiority over the rank of other Messengers. For Allah informed about Muhammad, peace and blessings be upon him, during the fear of al-Ṣiddīq [Abu Bakr] for him and for himself, when he said to his companion, reassuring and gladdening him, while they were in the cave—which is the protection of The Real over them—<<لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا>> (Do not grieve; indeed, Allah is with us). Thus, the Prophet, peace and blessings be upon him, stood in this declaration in the place of The Real in His accompaniment of Moses and Aaron, and acted as His deputy. This is how the Divine Providence (العناية الإلهية) operates.\n\nThis is the light by which he strives, and he is constantly striving, so The Real is constantly with him, preserving and supporting, never abandoning. For this reason, the information came to us from Allah upon the tongue of His Messenger, peace and blessings be upon him, that if we perform supererogatory good deeds (نوافل)—not obligatory ones (فرائض)—The Real loves us, and He becomes our hearing by which we hear, and our foot by which we strive, extending to all our faculties and limbs. This is what the supererogatory acts grant us from The Real. Where are you compared to what the obligatory acts grant? How vast is the difference between the servitude of necessity (عبودية الاضطرار) and the servitude of choice (عبودية الاختيار)!\n\nPartnership with The Real occurs in the servitude of choice, in the narrations of His descent in addressing His servant, such as longing, hunger, thirst, sickness, and their likes. But the servitude of necessity admits no partnership; it is purely for the servant. Whoever is established in it, there is no station above it. Allah says to Abū Yazīd: \"Draw near to Me by that which is not Mine: lowliness (الذلة) and destitution (الافتقار).\" Thus, the essence of nearness here is the essence of distance from the station [of partnership], so understand.\n\nAs for the light from which we strive, it is the light of the Reality (الحقيقة), whether one knows it or not. He unveils it by this light and unveils that he strove from it. Then the light toward which he strives is unveiled to him, and that is the Law (الشريعة). The possessor of this station is the protected, preserved, and cared-for knower who is never ignorant, due to his being characterized by knowledge in which there is no ignorance. For there are servants who strive from the light of the Law toward the light of the Reality, and they are feared for. But those who strive upon an unveiling (كشف) from the light of the Reality toward the light of the Law are safe from this Divine Cunning (مكر إلهي); they are upon clear insight concerning their affair. Whereas those [the first group] are under a great danger; they may be protected in it, or they may be abandoned, so know that.\n\nAs for the lights of the Generated Things (المولدات), they are lights that grant, by their very essence, a sound knowledge of Allah, by which one unveils the relation of The Real and His form in the forms of the entities (أعيان) of minerals, plants, and animals—though they themselves do not know. And humanity has not surpassed these except by its unveiling of that. Thus, the Generated Things in this station are in the position of His saying: <<وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ>> (And He is with you wherever you are). And humanity in it is in the position of [the sayings]: <<لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا>> (Do not grieve; indeed, Allah is with us) and <<إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَى>> (Indeed, I am with you both; I hear and I see). For humanity is the form of everything in the matter itself. Whoever knows it and unveils it by this light is among the People of Specialization (أهل الاختصاص); he sees things as entities in a true form. Someone whose narration I trust informed me concerning this matter that a person in Damascus who possessed this station kept his head constantly between his knees. When he looked at things upon raising his head, he would constantly say, \"Hold him! Hold him!\" And the people did not know what he was saying, so they accused him of madness. As for me, I have tasted it, and praise be to Allah for that.\n\n### [The Lights of the Names (الأسماء) that relate to the Essence (الذات) and the Attributes (الصفات)]\n\nAs for the lights of the Names (الأسماء), they are those by which their named things appear, both as The Real (الحق) and as creation (الخلق), relating to the Essence (الذات), the Attributes (الصفات), and the Acts (الأفعال) in the Divine Matters. Some of them relate to the genera and individuals of contingent things (الممكنات), derived from the Names that The Real established for them and which the Messengers conveyed, not those established by convention (اصطلاح). These are the lights that Adam, peace be upon him, possessed when he was taught all the Names by Divine establishment, not by convention. And in that lies the merit and the specialization.\n\nFor Allah has Names by which He brought the angels and the entire cosmos into existence. And Allah has Names by which He brought into existence the comprehensive reality of the Divine Presence (الحضرة الإلهية), which is the Perfect Human (الإنسان الكامل). This was explicitly manifested in Adam by textual evidence and hidden in others. So He said to the angels concerning the merit of Adam and the merit of this station—after He had presented the named things to the angels, meaning their entities (أعيان): <<أَنْبِئُونِي بِأَسْمَاءِ هَؤُلَاءِ إِنْ كُنْتُمْ صَادِقِينَ>> (Inform Me of the names of these, if you are truthful)—meaning, by the Divine Names from which they originated. They did not know this by tasting (ذوقًا), for the knowledge of the great ones is by tasting, as it comes from a Divine Theophany. So Allah said: <<يَا آدَمُ أَنْبِئْهُمْ بِأَسْمَائِهِمْ>> (O Adam, inform them of their names). So Adam informed them of their Divine Names that brought them into existence and to which they were attributed in the creation of their entities, not the names of conventional, cosmic usage. For there is no benefit in the latter except in a remote sense, which we have disregarded since we know it was not the intended meaning. For we only speak and translate concerning what has actually occurred in the matter, not concerning what is intellectually possible. This is the difference between the People of Unveiling (أهل الكشف), who are the People of Inner Vision (أهل البصائر), in what they report, and the People of Intellectual Contemplation. The benefit lies only in what has occurred, not in what is possible, for the latter is knowledge that is not [true] knowledge, whereas what has occurred is verified knowledge.\n\n### [The Lights of Nature (الطبيعة)]\n\nAs for the lights of Nature (الطبيعة), they are lights by which their possessor unveils what Nature grants of forms in the Prime Matter (الهباء) and what it grants of forms in the universal form, which is the form of the Total Body (الجسم الكل). When these lights are attained perfectly, the knowledge of their possessor relates to what is infinite, though this is rare among us. But among others [rationalists], its occurrence is intellectually prohibited, to the extent that even concerning the Divine, it is disputed among them. We have not seen anyone attain it perfectly, nor have we heard of it, nor have we attained it ourselves. If anyone claims it, it is a claim for which there is absolutely no proof, despite the possibility of its attainment. The lights of Nature are encompassed within everything other than The Real; they are the Breath of the All-Merciful (نفس الرحمن) by which Allah relieved the Divine Names, and which Allah incorporated into the spheres (الأفلاك), the elements (الأركان), and what is generated from individuals, extending to the infinite.\n\n### [The Lights of the Winds (الرياح)]\n\nAs for the lights of the Winds (الرياح), they are elemental lights whose extreme manifestation conceals them, thus blinding the sights from perceiving them. I have only witnessed them in the Isthmus Presence (الحضرة البرزخية), although Allah favored us with seeing them physically in the city of Córdoba for one day, as a Divine specialization and a Muhammadan prophetic inheritance. These wind-lights have authority and power over all the children of Adam, except the People of Allah (أهل الله). For these lights are encompassed within their lights, just as the lights of the stars are encompassed within the light of the sun, due to the weakness of the light of [ordinary] sight. When these lights overwhelm whomever Allah wills among the common people, they only overwhelm him like a dark cloud. But when they overwhelm the People of Allah, they only overwhelm them as lights in their true form.\n\n### [The Lights of the Spirits (الأرواح)]\n\nAs for the lights of the Spirits (الأرواح), some of us consider them the lights of the Intellects (العقول), and some consider them the lights of the Messengers. They possess power, authority, and penetration in the cosmos; nothing stands against them, except that they have limits at which they stop and do not transgress. When the servant witnesses them, he unveils by their means the hidden sciences that are guarded from those who are not worthy of them. They are sanctifying (سبوحية) and holy (قدوسية) lights that descend from The Real, by Whom creation occurs, down to the Lote Tree of the Utmost Boundary (سدرة المنتهى), casting their rays upon the hearts of the Gnostics (العارفين), the People of Perfect Witnessing (الشهود التام). Thus, their hearts are the landing places for the rays of these lights. And there is none more perfect in knowledge in this human category than them. For nothing acts as a veil for these lights except the Divine Will (المشيئة الإلهية) specifically. Few are the servants of Allah upon whose heart these lights cast their rays through unveiling (كشف); they are the manifestation sites (مجالي) of the truthful servants of Allah, the Exalted.\n\n### [The Lights of Lights (أنوار الأنوار)]\n\nAs for the Lights of Lights (أنوار الأنوار), they are the Sublimities (السبحات) which, if The Real were to lift the veil that conceals them from us, we would be consumed by fire. They are essential rays (أشعة ذاتية); when they spread out, the entities of the contingent things (أعيان الممكنات) appear. Thus, the contingent things are the veil between us and them. This is the Great Light, not the Greatest. To it is the reference in His saying, the Exalted, concerning the People of the Divine Books revealed with prescribed deeds: <<وَلَوْ أَنَّهُمْ أَقَامُوا التَّوْرَاةَ>> (And if they had upheld the Torah)—who are the followers of Moses—<<وَالْإِنْجِيلَ>> (and the Gospel)—who are the followers of Jesus—<<وَمَا أُنْزِلَ إِلَيْهِمْ مِنْ رَبِّهِمْ>> (and what was sent down to them from their Lord)—who are the People of the Scrolls and the remaining Books—<<لَأَكَلُوا مِنْ فَوْقِهِمْ>> (they would have eaten from above them)—which are sciences outside of acquisition—<<وَمِنْ تَحْتِ أَرْجُلِهِمْ>> (and from beneath their feet)—which are sciences that fall under acquisition. Thus, they are sciences of the above and the below. If the light were of this description [the Great Light], it would not be beneath us; rather, it would be that which disposes of us. As for the light that is beneath us, it is that over which we rule, and it is what is expressed as eating from beneath the feet.\n\nAs for the light that is the very essence of our Essence (ذات), it is as he prayed, peace and blessings be upon him: \"And make me a light.\" This is the essence of his Essence. The narration \"And grant me light\" refers to all the lights we have mentioned. As for his saying, \"And make me a light,\" it is the witnessing of the light of his Essence, since he witnesses only by it. For his Essence only accepted these lights from these six directions because of its failure to perceive the light of its own self, concerning which the Messenger of Allah, peace and blessings be upon him, said: \"Whoever knows his self knows his Lord.\"\n\nAnd <<اللَّهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ>> (Allah is the Light of the heavens and the earth), and He is likened by what He likens Himself to, and you are the very essence of that which is likened and the likeness. So you witness the lights bursting forth from you, illuminating the world of your heavens and your earth by your Essence. Thus, you do not need an external light to be illuminated by, for you are the lamp, the wick, the niche, and the glass. And if you know this, you know the oil, which is the Divine Sustenance (الإمداد الإلهي), and you know the tree. And if the glass is like the brilliant star—which is the sun here—what do you think of the lamp, which is the very essence of your Essence? Therefore, O my brother, let your prayer always be only that Allah makes you a light.\n\nHere is a wondrous secret I alert you to without explanation, because it does not tolerate explanation. It is that Allah sets forth similitudes for Himself, but similitudes are not set forth for Him. So He resembles things, but things do not resemble Him. Thus, it is said: \"The likeness of Allah in His creation is like the king in his kingdom,\" but it is not said: \"The likeness of the king in his kingdom is like Allah in His creation.\" For He is the essence of what appeared, but what appeared is not His essence. For He is the Inner (الباطن) just as He is the Manifest (الظاهر) in the state of His manifestation. For this reason, we said He is like things, but things are not like Him, since He is their essence, but they are not His essence. This is part of the extraordinary knowledge (العلم الغريب) that has become a stranger to its homeland and has been prevented from its dwelling, so the intellects reject it because they are rationalized but not permitted [to grasp it]. And this is a model of the theophany of the Lights of Lights.\n\n### [The Lights of Meanings Abstracted from Matter]\n\nAs for the lights of meanings abstracted from matter, they cannot be spoken. For if they were spoken, they would enter into matter, because expressions (العبارات) are from matter. We have already said that they are abstracted from matter by their Essence (ذات), not that they became abstracted. For if they had become abstracted, we could clothe them in matter whenever we wished, and they would not refuse, since they had previously been in it. Thus, they are known specifically, but they are not spoken, nor narrated, nor do they accept comparison (تشبيه) or similitude (تمثيل).\n\n### [The Lights of the Spirits (الأرواح)]\n\nAs for the lights of the Spirits (الأرواح), they are the lights of the Comprehensive Holy Spirit (روح القدس الجامع). Whoever is sent from these Spirits is an angel, and whoever is not sent retains the name of the Spirit along with the specific name of knowledge in both groups: the sent and the unsent. It is a pure Spirit that does not resemble what would remove it from its self. It is a Spirit possessing a spirit in its spirituality, and these are only the Spirits of Bewilderment (الأرواح المهيمة). The spirits of the Solitaries (الأفراد) among us resemble them somewhat. Theophany in the lights of the Spirits only occurs for the Solitaries. For this reason, al-Khiḍr said to Moses: <<مَا لَمْ تُحِطْ بِهِ خُبْرًا>> (that which you have not encompassed in knowledge), because he [al-Khiḍr] was one of the Solitaries. Indeed, the Prophets experience Theophany in the lights of the angelic Spirits, but the Solitaries do not have this Theophany; rather, it is specific to the Prophets and Messengers. This is the meaning of al-Khiḍr’s statement: \"You are upon a knowledge that Allah taught you, which I do not know,\" because he did not possess this angelic Theophany. Then he alerted him that he did not do what he did by his own command, for he has no command and is not one of the People of Command (أهل الأمر). It is a strange station among the stations. If Allah, the Exalted, permitted us to unveil it to creation, a knowledge would appear for which the cosmos could not stand. The effect of this has appeared in three matters from a person [al-Khiḍr] whom Allah testified to his righteousness before His Prophet [Moses], purified him, and made him a follower [of the Divine Will], explaining to him what you have heard, and entering himself among his followers under his condition. And he is like Moses, the one spoken to by Allah and His intimate, yet how different is his speech with his Lord from his speech with al-Khiḍr! Thus, the Theophany differed in the speech. Despite this, he [Moses] did not remain patient, because he presented the exception [in his promise] but did not present it when he objected to him [al-Khiḍr]. For it is the nature of the Prophet to be a follower just as he is followed equally. And likewise, he said: <<إِنْ أَتَّبِعُ إِلَّا مَا يُوحَى إِلَيَّ>> (I only follow what is revealed to me). He did not say, \"I only act or speak based on what I witness.\" He did not say this. Thus, every station (مقام) has its corresponding utterance and tongue.\n\n### [The Lights of the Winds (الرياح)]\n\nAs for the lights of the Winds (الرياح), they are the theophanies of the Name The Distant (البعيد). They are theophanies whose name should not be mentioned, and they only occur for the People of Inspiration (أهل الإلهام). And Theophany in the lights of the angels has an entry point here, but specifically in the inner dimension (الباطن), not the outer (الظاهر). These are specifically the angels of sudden thoughts (ملائكة اللمات) and inspiration (الإلهام). The casting [of knowledge] in this Theophany is upon the souls. And from this Theophany come the passing thoughts (الخواطر), and they are entirely wind-like, because the winds pass and do not remain fixed. If someone claims their permanence, then they are not wind. For this reason, they are described by passing and are called *khawāṭir* (passing thoughts), derived from *rāḥa yarūḥ* (to go and come), and that which goes and comes is not stationary.\n\nAs for Theophany in the natural lights, it is the composite formal Theophany (التجلي الصوري المركب), which grants gnosis (المعارف) according to the forms that appear within it. It encompasses everything from the celestial sphere down to the lowest insects, and it is the heaven and the cosmos. Thus, it is a Theophany in the heaven and the cosmos. From this Theophany, the meanings, the languages, the prayer of every form, and its glorification (تسبيح) are known. It is a magnificent, beneficial, and supported unveiling (كشف) in which the one unveiled to sees the conformity of the cosmos and that there is no opposition. From here, he sees that <<كُلُّ شَيْءٍ يُسَبِّحُ بِحَمْدِهِ>> (everything glorifies Him with praise). The possessor of this station sees, through witnessing (الشهود), the forms of his deeds as living, glorifying Allah, possessing a spirit breathed into them by the possessor of this station. Even if, in the outer cosmos, they are opposition and disobedience (معصية), they are a correct opposition, yet they are living and speaking, seeking forgiveness for their doer, because he perfected their created nature (نشأتها مخلقة). And Allah praised Himself by saying that He created and perfected. Part of perfecting its created nature is that He did not remove it from being an act of disobedience. For if He had removed it from being an act of disobedience, it would have been unperfected, and its doer would have been wretched. And its glorification would have been a curse upon its doer, for he would have permitted what Allah forbade, thereby exiting faith. He would have no share in Islam unless he renewed his submission and repented. This is an alert that its possessors have always concealed out of protective jealousy and weakness. But alerting to it is more appropriate, because it is sincere advice to Allah, His Messenger, the leaders of the Muslims, and their common folk. Therefore, a perfected act of disobedience is never found except from a believer. And whoever grants a thing its creation has followed the Divine Way. For Allah <<أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ>> (gave everything its creation). So He gave disobedience its creation and obedience its creation. This is the characteristic of the believer.\n\n### [The Lights of the Names (الأسماء)]\n\nAs for the lights of the Names (الأسماء), they specify the names of the known things (المعلومات). It is a light that spreads over non-existent things (المعدومات) and existent things (الموجودات), and the extent of its spreading is infinite. And the entity (العين) proceeds with its spreading, so the light of the entity of the possessor of this station spreads, and he knows what is infinite, just as he is not ignorant of what is infinite, through the multiplication of numbers. This is the sign of one whose sight The Real becomes. All the Names are existent, but the named things (مسميات) include those whose entity is non-existent by its essence, and those whose non-existence is prior by its essence, which are those that accept Existence (الوجود). And the states (الأحوال) do not accept Existence, despite the Name being applied to all of that. Thus, the Names possess encompassment (الإحاطة), and encompassment belongs to Allah alone, not to others. This is the rank of the Divine Names. Adam was only favored over the angels by his encompassment of the knowledge of the Names. For were it not for the Names, Allah would not have mentioned anything, nor would anything have mentioned Allah. He is only mentioned by them, and He is only mentioned and praised by them. Nothing competes with the Attribute of Knowledge (العلم) in encompassment except Speech (القول), and all Speech is Names; Speech is nothing other than the Names. And the Names are signs and indications of the meanings beneath them. Whoever has the light of the Names manifested to him, that which cannot be mentioned has been manifested to him—I say nothing else. Were it not that The Real applied the term \"all\" to the Names in the description of Adam’s knowledge, we would have said it is impossible for the spreading of the light of the Names to appear over the named things for any entity. But whoever understands the saying of Allah, the Exalted: <<ثُمَّ عَرَضَهُمْ عَلَى الْمَلَائِكَةِ فَقَالَ أَنْبِئُونِي بِأَسْمَاءِ هَؤُلَاءِ>> (Then He presented them to the angels and said, \"Inform Me of the names of these\")—and He pointed—knows the reverence we have maintained and what Allah intended by the word \"all\" in this honor.\n\n### [The Lights of the Generated Things (المولدات), the Mothers (الأمهات), the Causes (العلل), and the Reasons (الأسباب)]\n\nAs for the lights of the Generated Things, the Mothers, the Causes, and the Reasons, this is a Divine Theophany (تجلي إلهي) stemming from His being the Effector, and from His being the Answerer when asked, the Forgiver when sought for forgiveness, and the Giver when requested. By means of this Theophany and these lights, one understands His saying: <<إِنَّ الَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ اللَّهَ>> (Indeed, those who pledge allegiance to you are only pledging allegiance to Allah). And His saying, mighty and majestic: <<مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ>> (Whoever obeys the Messenger has obeyed Allah). And His saying, blessed and exalted: \"Indeed, charity falls into the Hand of the All-Merciful.\" And His saying: <<وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا>> (And lend to Allah a goodly loan). And his saying, peace be upon him: \"Indeed, Allah rejoices at the repentance of His servant.\"\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "باب نمبر دو سو چھ: حرف جیم کے ساتھ ظہور الٰہی (التجلی) کا حال\n\nغیب کا ایک نور ہے بصیرتوں پر\nجو ظاہر کرتا ہے جو کچھ پوشیدہ رازوں میں تھا\n\nہر شخص کے ہر دل کے لیے\nجسے ذات حق (الحق) نے حاضر کیا ہے مشاہدے کی جگہوں پر\n\nپس اس نے دیکھا کہ امر کیسے جاری ہوتا ہے\nاور مقدرات میں حکم کا مشاہدہ کیا\n\nپس اس کے نزدیک وہ اول اور ظاہر ہے\nاور ہمارے نزدیک وہ باطن اور آخر ہے\n\nاس کی تقسیم ہم میں نماز کی طرح ہے\nعین کے لیے عین، پس شکر کر اور جلدی کر\n\nعاجزی میں قید بندے کے درمیان\nاور اس رب کے درمیان جو اس پر قادر ہے\n\nاس کے فضل سے ہم تک وہ چیز سرایت کر گئی ہے\nجس کی دلوں میں اللہ کی حمد کی جاتی ہے\n\n[ظہور الٰہی (التجلی) وہ ہے جو دلوں پر غیب کے انوار سے منکشف ہوتا ہے]\n\nجان لو کہ قوم (صوفیاء) کے نزدیک ظہور الٰہی (التجلی) وہ ہے جو دلوں پر غیب کے انوار سے منکشف ہوتا ہے۔ اور یہ مختلف مقامات پر ہوتا ہے۔ پس ان میں سے کچھ کا تعلق معرفت (المعرفۃ) اور اسرار کے انوار سے ہے جو مادی چیزوں سے مجرد ہیں۔ اور ان میں سے کچھ کا تعلق انوار الانوار سے ہے۔ اور ان میں سے کچھ کا تعلق ارواح کے انوار سے ہے، اور وہ فرشتے ہیں۔ اور ان میں سے کچھ کا تعلق ہواؤں (الریاح) کے انوار سے ہے۔ اور ان میں سے کچھ کا تعلق طبیعت (الطبیعۃ) کے انوار سے ہے۔ اور ان میں سے کچھ کا تعلق اسماء کے انوار سے ہے۔ اور ان میں سے کچھ کا تعلق مولدات (پیدا شدہ چیزوں)، امہات (اصول)، علل (وجوہات) اور اسباب کے انوار سے ہے، ان کے مراتب کے مطابق۔ پس ان انوار میں سے ہر نور جب کسی افق سے طلوع ہوتا ہے اور بصیرت کی آنکھ سے ملتا ہے، اس حال میں کہ وہ اندھے پن، غشی، پھٹنے، آشوب چشم اور آنکھوں کی دیگر آفات سے محفوظ ہو، تو وہ ہر نور کے ذریعے اس چیز کو منکشف کرتا ہے جس پر وہ پھیلا ہے۔ پس وہ معانی کی ذاتوں کا مشاہدہ کرتا ہے جیسا کہ وہ اپنی حقیقت میں ہیں، اور ان کے ان الفاظ اور کلمات کی صورتوں کے ساتھ تعلق کا مشاہدہ کرتا ہے جو ان پر دلالت کرتے ہیں۔ اور اس کے مشاہدے کے ذریعے وہ اسے وہ حقائق عطا کرتا ہے جو وہ نفس الامر میں ہیں، بغیر کسی تخیل یا التباس کے۔ پس ان میں سے کچھ انوار ایسے ہیں جن کے ذریعے ہم سعی کرتے ہیں، اور کچھ انوار ایسے ہیں جن کی طرف ہم سعی کرتے ہیں، اور کچھ انوار ایسے ہیں جن سے ہم سعی کرتے ہیں، اور کچھ انوار ایسے ہیں جو ہمارے سامنے سعی کرتے ہیں، اور کچھ انوار ایسے ہیں جو ہمارے پیچھے ہوتے ہیں، جن کے ذریعے وہ شخص سعی کرتا ہے جو ہماری پیروی کرتا ہے، اور کچھ انوار ایسے ہیں جو ہماری دائیں جانب ہوتے ہیں جو ہماری تائید کرتے ہیں، اور کچھ انوار ایسے ہیں جو ہماری بائیں جانب ہوتے ہیں جو ہماری حفاظت کرتے ہیں، اور کچھ انوار ایسے ہیں جو ہمارے اوپر ہوتے ہیں جو ہم پر نازل ہوتے ہیں تاکہ ہمیں فائدہ پہنچائیں، اور کچھ انوار ایسے ہیں جو ہمارے نیچے ہوتے ہیں جن پر ہم تصرف کے ذریعے ملکیت رکھتے ہیں، اور کچھ انوار ایسے ہیں جو ہم خود ہوتے ہیں، وہ ہماری کھالیں ہیں اور ہماری کھالوں میں ہیں، اور ہمارے بال ہیں اور ہمارے بالوں میں ہیں، اور یہی امر کی انتہا ہے۔\n\nبہرحال وہ انوار جو مادی چیزوں سے مجرد معانی کے ہیں، تو وہ ہر وہ علم ہے جس کا تعلق نہ کسی جسم سے ہو، نہ جسمانی چیز سے، نہ متخیل سے، نہ کسی صورت سے، اور نہ ہم اسے اس کی صورت گری کے لحاظ سے جانتے ہیں، بلکہ ہم اسے اس کی حقیقت پر عقل سے سمجھتے ہیں، لیکن اس حالت کے ذریعے جس پر ہم ہیں۔ اور یہ تب تک نہیں ہو سکتا جب تک کہ میں خود نور نہ بن جاؤں۔ پس جب تک میں اس مقام پر نہ ہوں، میں اس علم میں سے کچھ بھی ادراک نہیں کر سکتا۔ اور یہی وہ بات ہے جو آپ صلی اللہ علیہ وسلم نے اپنی دعا میں فرمائی: \"اور مجھے نور بنا دے۔\"\n\nاور اللہ تعالیٰ فرماتا ہے: **اللَّهُ نُورُ السَّماواتِ وَالْأَرْضِ** (اللہ آسمانوں اور زمین کا نور ہے)۔ پس وہ (آسمان و زمین) صرف اسی کے ذریعے روشن ہوئے، جیسا کہ فرمایا: **وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّها** (اور زمین اپنے رب کے نور سے چمک اٹھے گی)۔ یعنی محشر کی زمین۔ وہ فرماتا ہے کہ وہاں کوئی سورج نہیں ہوگا اور نور کا نہ ہونا ظلمت ہے۔ اور شہود (الشہود) ضروری ہے، لہٰذا نور ضروری ہے۔ اور یہ وہ دن ہے جب اللہ تعالیٰ فیصلے اور قضا کے لیے آئے گا، پس وہ صرف اپنے اسم النور میں ہی آئے گا۔ پس زمین اپنے رب کے نور سے چمک اٹھے گی اور ہر نفس اس نور کے ذریعے جان لے گا کہ اس نے کیا **قَدَّمَتْ وَأَخَّرَتْ** (آگے بھیجا اور پیچھے چھوڑا)۔ وہ اسے اپنے پاس حاضر پائے گا، وہ نور اسے منکشف کر دے گا۔ اور اگر نفوس میں وہ انوار نہ ہوتے جن پر وہ ہیں، تو مشاہدہ درست نہ ہوتا، کیونکہ شہود (الشہود) صرف دو نوروں کے اجتماع سے ہوتا ہے۔ اور جسے نور میں حصہ ملا، وہ ابدی شقاوت میں کیسے مبتلا ہو سکتا ہے؟ حالانکہ نور شقاوت کی دنیا سے نہیں ہے۔ اور کوئی نفس ایسا نہیں مگر اس کے لیے ایک نور ہے جس سے وہ اپنے کیے ہوئے عمل کو منکشف کرتا ہے۔ پس جو نیکی ہوگی اس سے وہ خوش ہوگا، اور جو برائی ہوگی تو وہ **تَوَدُّ لَوْ أَنَّ بَيْنَها وَبَيْنَهُ أَمَداً بَعِيداً** (چاہے گا کہ کاش اس کے اور اس کے درمیان بہت لمبا فاصلہ ہوتا)۔ اور اسی لیے اللہ تعالیٰ نے آیت کا اختتام اس قول پر کیا: **وَاللَّهُ رَؤُفٌ بِالْعِبادِ** (اور اللہ بندوں پر بہت مہربان ہے)، جہاں اس نے ان کے لیے ایسے انوار بنائے جن سے وہ ادراک کرتے ہیں۔\n\n[کہ نور کا سعادت میں حصہ ہے]\n\nاور انہوں نے جان لیا ہے کہ نور کا شقاوت میں کوئی حصہ نہیں ہے، لہٰذا انجام موافقت اور مقصد کے حصول کی طرف ہونا ضروری ہے، اور اسی کو سعادت سے تعبیر کیا جاتا ہے۔ کیونکہ اس نے فرمایا: \"ہر نفس\"، پس اس نے عمومیت اختیار کی اور کسی نفس کو خاص نہیں کیا، اور خیر اور شر کا ذکر کیا۔ پس ہستی (الوجود) نور ہے اور عدم ظلمت ہے۔ پس شر عدم ہے، اور ہم ہستی (الوجود) میں ہیں، لہٰذا ہم خیر میں ہیں، اور اگر ہم بیمار ہوتے ہیں تو ہم صحت یاب ہوتے ہیں، کیونکہ اصل جابر ہے، اور وہ نور ہے۔ اور ہر نور کی یہی صفت ہے کہ وہ صرف اس چیز کو ظاہر کرنے کے لیے آیا ہے جس پر وہ طلوع ہوا ہے۔ پس اشیاء کا ادراک صرف تیرے ذریعے اور تجھ سے ہوتا ہے۔ اسی لیے نتیجہ درست نہیں ہوتا، یعنی وہ صرف دو چیزوں کے درمیان ہی ہوتا ہے: اس کی اصل الٰہی قدرت ہے اور ممکن کا انفعال قبول کرنا ہے۔ اگر ان دو حقائق میں سے ایک بھی کم ہو جائے تو عالم کی کوئی عین ظاہر نہیں ہو سکتی۔ ہم نے تمہیں ان انوار کے بارے میں ایک کلی امر عطا کر دیا ہے، لہٰذا ہم طوالت کے خوف سے ان کی تفصیل بیان کرنے کی زحمت نہیں کرتے۔ اور احوال تفصیل کے متحمل نہیں ہوتے۔ پس ہم انوار کے مبہمات کا ذکر کرتے ہیں۔\n\nبہرحال وہ نور جس کے ذریعے ہم سعی کرتے ہیں، وہ معلومات کے انوار ہیں جن کا ذکر پہلے ہو چکا ہے، جن میں سے ہم نے صرف ایک کا ذکر کافی سمجھا تاکہ وہ ان چیزوں کے لیے تنبیہ اور نمونہ بن جائے جن کے بارے میں ہم خاموش رہے۔ اور وہ نور جو ہمارے سامنے ہے، وہ وقت کا نور ہے۔ اور وقت وہ ہے جس کے ساتھ تو ہے۔ پس اس کا نور وہ ہے جس کے ساتھ تو ہے۔ پس اس میں دیکھ، خواہ وہ کیسا بھی ہو، وہ تیرا مشہود ہے جو تجھ پر حاکم ہے اور تیرے ساتھ قائم ہے۔ اور وہ عین اسم الٰہی ہے جس کے ذریعے تو حال میں قائم ہے، اس کا ماضی یا مستقبل میں کوئی حکم نہیں ہے۔\n\nاور وہ نور جو تیری دائیں جانب ہے، وہ تیرا مؤید ہے اور اس چیز پر مددگار ہے جو تجھ سے وہ نور طلب کرتا ہے جو تیرے سامنے ہے۔ اور یہی وہ چیز ہے جو تو نے اپنی نماز کی حالت میں اللہ سے طلب کی تھی جب تو کہتا ہے: **وَإِيَّاكَ نَسْتَعِينُ** (اور ہم تجھ ہی سے مدد مانگتے ہیں)۔ اور نماز نور ہے، اور وہ نور ہے جو تیرے سامنے ہے۔ پس جب تو نے کہا: **وَإِيَّاكَ نَسْتَعِينُ**، تو اس نے تیری دائیں جانب سے نور کے ذریعے تیری تائید کی، کیونکہ دایاں قوت ہے۔ شاعر کہتا ہے:\n\n> إذا ما راية رفعت لمجد *** تلقاها عرابة باليمين‏\n> (جب بھی کوئی پرچم عظمت کے لیے بلند کیا جاتا ہے، تو عرابہ اسے دائیں ہاتھ سے تھامتا ہے۔)\n\nاور وہ نور جو تیری بائیں جانب ہے، وہ حفاظت اور ڈھال کا نور ہے گمراہ کن شبہات سے جو جہالتوں اور التباس کے ذریعے نفوس پر اثر انداز ہوتے ہیں، اور وہ شک و شبہ جو اللہ کے بارے میں اور اس چیز کے بارے میں جو اس نے اپنے بارے میں خبر دی ہے، غور و فکر کرنے والے محقق کے دل میں آتا ہے۔ اور یہ دو قسم کا ہے: نور ایمان اور نور دلیل۔ اور نور دلیل بھی دو قسم کا ہے: فکری نظر کا نور اور کشفی نظر کا نور (الکشف)، جس سے امر کو اس کی حقیقت پر جانا جاتا ہے۔ پس یہ اس نور کا فائدہ ہے جو بائیں جانب سے آتا ہے۔\n\nاور وہ نور جو ہمارے پیچھے ہے، وہ وہ نور ہے جو اس شخص کے سامنے سعی کرتا ہے جو ہماری پیروی کرتا ہے اور ہمارے راستے پر چلتا ہے۔ پس وہ ان کے لیے ان کے سامنے سے ہے، اور ہمارے لیے ہمارے پیچھے سے ہے۔ پس وہ اس نور کی وجہ سے بصیرت پر ہماری پیروی کرتا ہے جو انہیں تقلید سے نکالتا ہے۔ اللہ تعالیٰ نے فرمایا: **أَدْعُوا إِلَى اللَّهِ عَلى‏ بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي** (میں اللہ کی طرف بصیرت پر بلاتا ہوں، میں بھی اور وہ بھی جس نے میری پیروی کی)۔ پس وہ اپنے سامنے والے نور کے ذریعے بصیرت پر بلاتا ہے، اور اس کی پیروی کرنے والا داعی اس نور کے ذریعے بلاتا ہے جو اس کے پیچھے ہے، تاکہ یہ متبع بھی اس چیز میں بصیرت پر ہو جس کی طرف وہ بلاتا ہے، جیسا کہ اس کا متبوع ہے۔ اور اس نور کے ذریعے وہ اپنے پیچھے سے وہی دیکھتا ہے جو اپنے سامنے سے دیکھتا ہے۔ اور یہ ایک مقام ہے جو مجھے ۵۹۳ھ میں فاس شہر میں عصر کی نماز کے دوران حاصل ہوا، جب میں عین الجبل کے قریب مسجد ازہر میں جماعت کے ساتھ نماز پڑھا رہا تھا۔ پس میں نے اسے ایک ایسا نور دیکھا جو تقریباً اس نور سے زیادہ منکشف تھا جو میرے سامنے تھا۔ لیکن جب میں نے اسے دیکھا تو مجھ سے پیچھے کا حکم زائل ہو گیا، اور میں نے اپنی کوئی پشت یا قفا نہیں دیکھی، اور میں نے اس رؤیت میں اپنی جہتوں میں کوئی فرق نہیں کیا، بلکہ میں گیند کی طرح تھا، میں اپنے لیے کسی جہت کو نہیں سمجھتا تھا مگر فرض کے طور پر، نہ کہ ہستی (الوجود) کے طور پر۔ اور امر ویسا ہی تھا جیسا کہ میں نے مشاہدہ کیا، حالانکہ اس سے پہلے مجھے اپنی قبلہ کی دیوار کے عرض میں اشیاء کا کشف (الکشف) ہو چکا تھا، لیکن یہ کشف اس کشف سے مشابہ نہیں ہے۔\n\nاور وہ نور جو میرے اوپر سے ہے، وہ ایک الٰہی قدسی نور کا نزول ہے جو ایک غریب علم کے ساتھ ہے، جس سے پہلے نہ کوئی خبر تھی اور نہ کوئی نظر اسے عطا کرتی ہے۔ اور یہ وہ نور ہے جو اللہ کے بارے میں وہ علم عطا کرتا ہے جسے عقلی دلائل رد کر دیتے ہیں اگر ان کے پاس ایمان نہ ہو۔ اور اگر ان کے پاس نورانی ایمان ہو تو وہ اسے تاویل کے ساتھ قبول کر لیتے ہیں تاکہ دونوں امور کو جمع کر سکیں۔\n\nاور وہ نور جو ہمارے نیچے سے ہے، وہ وہ نور ہے جو ہمارے حکم اور ہمارے تصرف کے تحت ہوتا ہے، اس کے ساتھ ہم میں کوئی الٰہی امر شامل نہیں ہوتا جس پر ہم رک جائیں، پس ہم اسے صرف اسی میں تصرف کرتے ہیں۔\n\nاور وہ انوار جن کے ذریعے ہم سعی کرتے ہیں، وہ ذات حق (الحق) کی جانب سے معیت کے انوار ہیں، اس کے قول میں: **وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ** (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)۔ اسی لیے ہم نے کہا کہ ذات حق (الحق) کی جانب سے، کیونکہ اللہ کی مخلوق میں سے کوئی چیز اس معیت میں کسی دوسری چیز سے خاص نہیں ہے۔ اور اس کے لیے اسم الحفیظ (حفاظت کرنے والا) اور المحیط (احاطہ کرنے والا) ہے۔ البتہ اللہ کی اپنے بعض بندوں کے ساتھ معیت اختصاص کی ہوتی ہے، جیسے موسیٰ اور ہارون کے ساتھ اس کی معیت، اس کے قول میں: **إِنَّنِي مَعَكُما أَسْمَعُ وَأَرى‏** (بے شک میں تمہارے ساتھ ہوں، سنتا اور دیکھتا ہوں)۔ پس یہ ان دونوں کے لیے بشارت تھی تاکہ وہ خوف نہ کھائیں۔ کیونکہ انہوں نے کہا تھا: **إِنَّنا نَخافُ أَنْ يَفْرُطَ عَلَيْنا أَوْ أَنْ يَطْغى‏** (بے شک ہم ڈرتے ہیں کہ وہ ہم پر زیادتی کرے گا یا سرکشی کرے گا)، یعنی دلیل کے ساتھ آگے بڑھے گا اور غالب آ جائے گا، کیونکہ بادشاہت اور سلطنت اسی کی ہے۔ پس اللہ نے انہیں اس چیز سے امان دی جس سے وہ ڈرتے تھے۔\n\nاور یہاں سے تم محمد صلی اللہ علیہ وسلم کے مرتبے کو اور اس کی بلندی کو دوسرے رسولوں کے مرتبے پر جان سکتے ہو۔ کیونکہ اللہ نے محمد صلی اللہ علیہ وسلم کے بارے میں صدیق (ابوبکر) کے خوف کی حالت میں خبر دی، جب وہ ان پر اور اپنی جان پر خوف کھا رہے تھے، تو آپ نے اپنے ساتھی سے فرمایا، انہیں امان دیتے ہوئے اور خوش کرتے ہوئے، جب وہ دونوں غار میں تھے، اور وہ ان دونوں پر ذات حق (الحق) کی پناہ تھی: **لا تَحْزَنْ إِنَّ اللَّهَ مَعَنا** (غم نہ کر، بے شک اللہ ہمارے ساتھ ہے)۔ پس نبی صلی اللہ علیہ وسلم نے اس خبر میں موسیٰ اور ہارون کے ساتھ اللہ کی معیت کے مقام پر قیام فرمایا اور اس کی نیابت کی۔ الٰہی عنایت اسی طرح ہوتی ہے۔\n\nپس یہی وہ نور ہے جس کے ذریعے سعی کی جاتی ہے، اور وہ ہمیشہ سعی کرتا رہتا ہے۔ پس ذات حق (الحق) ہمیشہ اس کے ساتھ رہتا ہے، حفاظت کرنے والا اور مددگار، نہ کہ چھوڑنے والا۔ اور اسی لیے اللہ کی طرف سے اس کے رسول صلی اللہ علیہ وسلم کی زبان پر ہمیں یہ خبر دی گئی کہ جب ہم فرائض کے بجائے نوافل خیرات کے ساتھ آتے ہیں، تو ذات حق (الحق) ہم سے محبت کرتا ہے، پس وہ ہمارا کان بن جاتا ہے جس سے ہم سنتے ہیں، اور ہمارا پاؤں بن جاتا ہے جس سے ہم سعی کرتے ہیں، ہماری تمام قوتوں اور اعضاء تک۔ پس یہ وہ چیز ہے جو نوافل نے ہم میں ذات حق (الحق) کی طرف سے عطا کی۔ پس تم اس چیز سے کہاں ہو جو فرائض عطا کرتے ہیں؟\n\nپس عبودیت اضطرار اور عبودیت اختیار کے درمیان کتنا فرق ہے! عبودیت اختیار میں ذات حق (الحق) کے ساتھ شرکت واقع ہوتی ہے، اس کے بندے سے خطاب میں اس کے نزول کی احادیث میں، جیسے شوق، بھوک، پیاس، بیماری اور اس جیسی چیزیں۔ اور عبودیت اضطرار میں شرکت واقع نہیں ہوتی، پس وہ بندے کے لیے خالص ہے۔ پس جو اس میں قائم کیا گیا، اس سے اوپر کوئی مقام نہیں۔ اللہ تعالیٰ ابو یزید سے فرماتا ہے: \"میری طرف اس چیز سے تقرب حاصل کر جو میرے لیے نہیں ہے: ذلت اور فقر۔\" پس یہاں قربت کی عینیت مقام سے دوری کی عینیت ہے۔ پس سمجھو۔\n\nاور وہ نور جس سے ہم سعی کرتے ہیں، وہ حقیقت کا نور ہے، خواہ وہ اسے جانتا ہو یا نہ جانتا ہو۔ پس وہ اس نور کے ذریعے اسے منکشف کرتا ہے اور منکشف کرتا ہے کہ اس نے اس سے سعی کی۔ پھر اس پر وہ نور منکشف ہوتا ہے جس کی طرف وہ سعی کرتا ہے، اور وہ شریعت ہے۔ پس اس مقام کا مالک وہ معصوم، محفوظ، اور عنایت یافتہ عالم ہے جو جاہل نہیں ہوتا، کیونکہ وہ ایسے علم سے متصف ہے جس میں جہالت نہیں ہے۔ البتہ کچھ بندے ایسے ہیں جو شریعت کے نور سے حقیقت کے نور کی طرف سعی کرتے ہیں، اور ان پر خوف ہوتا ہے۔ اور وہ لوگ جو حقیقت کے نور سے شریعت کے نور کی طرف کشف (الکشف) پر سعی کرتے ہیں، وہ اس الٰہی مکر سے محفوظ ہیں۔ پس وہ اپنے امر میں بصیرت پر ہیں۔ اور وہ لوگ ایک عظیم خطرے کے تحت ہیں، ممکن ہے کہ انہیں اس میں عصمت دی جائے اور ممکن ہے کہ انہیں چھوڑ دیا جائے۔ پس یہ جان لو۔\n\nاور مولدات (پیدا شدہ چیزوں) کے انوار، وہ انوار ہیں جو اپنی ذات سے اللہ کے بارے میں صحیح علم عطا کرتے ہیں، جن کے ذریعے ذات حق (الحق) کی نسبت اور اس کی صورت کو معدنیات، نباتات اور حیوانات کی اعیان کی صورتوں میں منکشف کیا جاتا ہے، حالانکہ وہ نہیں جانتے۔ اور انسان ان پر صرف اس کشف (الکشف) کی وجہ سے بڑھا ہے۔ پس مولدات اس مقام میں اس کے قول کے بمنزلہ ہیں: **وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ** (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)۔ اور انسان اس میں اس کے بمنزلہ ہے: **لا تَحْزَنْ إِنَّ اللَّهَ مَعَنا** (غم نہ کر، بے شک اللہ ہمارے ساتھ ہے) اور **إِنَّنِي مَعَكُما أَسْمَعُ وَأَرى‏** (بے شک میں تمہارے ساتھ ہوں، سنتا اور دیکھتا ہوں)۔ کیونکہ وہ نفس الامر میں ہر چیز کی صورت ہے۔ پس جس نے اسے جانا اور اس نور کے ذریعے اس کا کشف (الکشف) کیا، وہ اہل اختصاص میں سے تھا۔ پس وہ اشیاء کو حقیقی صورت میں اعیان کے طور پر دیکھتا ہے۔ اور مجھے ایک ایسے شخص نے خبر دی جس کی نقل پر میں اس مسئلے میں بھروسہ کرتا ہوں کہ دمشق میں ایک شخص تھا جسے یہ مقام حاصل تھا، وہ ہمیشہ اپنا سر اپنے گھٹنوں کے درمیان رکھتا تھا۔ اور جب وہ اپنا سر اٹھا کر اشیاء کو دیکھتا تو ہمیشہ کہتا: \"اسے پکڑو، اسے پکڑو۔\" اور لوگ نہیں جانتے تھے کہ وہ کیا کہہ رہا ہے، پس وہ اسے دیوانگی سے منسوب کرتے تھے۔ لیکن میں نے اس کا ذائقہ چکھا ہے، اللہ کا شکر ہے اس پر۔\n\n[اسماء کے انوار جن کا تعلق ذات اور صفات سے ہے]\n\nاور اسماء کے انوار وہ ہیں جو اپنے مسمیات کو حق اور خلق کے طور پر ظاہر کرتے ہیں، جن کا تعلق الٰہیات میں ذات، صفات اور افعال سے ہے۔ ان میں سے کچھ کا تعلق ممکنات کی اجناس اور ان کے اشخاص سے ہے، ان اسماء میں سے جو ذات حق (الحق) نے ان کے لیے وضع کیے اور رسولوں نے پہنچائے، نہ کہ وہ جو اصطلاح کے ذریعے واقع ہوئے۔ اور یہ وہ انوار تھے جو آدم علیہ السلام کے لیے تھے جب انہوں نے تمام اسماء کو الٰہی وضع کے ذریعے جانا، نہ کہ اصطلاح کے ذریعے۔ اور اسی میں فضیلت اور اختصاص ہے۔ کیونکہ اللہ کے کچھ اسماء ایسے ہیں جن سے اس نے فرشتوں اور تمام عالم کو ہستی (الوجود) بخشی، اور اللہ کے کچھ اسماء ایسے ہیں جن سے اس نے الٰہی حضور (الحضرۃ الإلٰہیۃ) کے حقائق کے جامع کو ہستی (الوجود) بخشی، اور وہ انسان کامل (الإنسان الکامل) ہے۔ یہ آدم میں نص کے ذریعے ظاہر ہوا اور دوسروں میں پوشیدہ رہا۔ پس اس نے فرشتوں سے آدم کی فضیلت میں اور اس مقام کی فضیلت میں فرمایا، جبکہ اس نے فرشتوں کے سامنے مسمیات یعنی ان کی اعیان کو حاضر کیا: **أَنْبِئُونِي بِأَسْماءِ هؤُلاءِ إِنْ كُنْتُمْ صادِقِينَ** (مجھے ان کے نام بتاؤ اگر تم سچے ہو)۔ یعنی وہ الٰہی اسماء جن سے وہ صادر ہوئے تھے۔ پس انہوں نے اسے ذوقاً نہیں جانا، کیونکہ اکابر کے علوم ذوقاً ہوتے ہیں، کیونکہ وہ ظہور الٰہی (التجلی) سے ہوتے ہیں۔ پس اللہ نے فرمایا: **يا آدَمُ أَنْبِئْهُمْ بِأَسْمائِهِمْ** (اے آدم! انہیں ان کے نام بتاؤ)۔ پس آدم نے انہیں ان کے الٰہی اسماء سے خبر دی جنہوں نے انہیں ہستی (الوجود) بخشی اور جن کی طرف ان کی اعیان کی ہستی (الوجود) میں اسناد کی گئی، نہ کہ وضعی کونی اصطلاح کے اسماء، کیونکہ اس میں کوئی فائدہ نہیں مگر ایک دور کے پہلو سے، جسے ہم نے ذکر کرنے سے گریز کیا جب ہم نے جان لیا کہ وہ مقصود نہیں تھا۔ کیونکہ ہم صرف اسی چیز کے بارے میں بات کرتے ہیں اور ترجمہ کرتے ہیں جو امر میں واقع ہوا ہے، نہ کہ اس کے بارے میں جو عقلی طور پر ممکن ہے۔ اور یہی فرق ہے اہل کشف (الکشف) کے درمیان، جو بصیرت (البصائر) والے ہیں، اور اہل نظر عقلی کے درمیان، جو وہ خبر دیتے ہیں۔ اور فائدہ صرف اس چیز میں ہے جو واقع ہوا ہے، نہ کہ اس میں جو ممکن ہے، کیونکہ وہ علم نہیں ہے، اور جو واقع ہوا ہے وہ محقق علم ہے۔\n\n[طبیعت (الطبیعۃ) کے انوار]\n\nاور طبیعت (الطبیعۃ) کے انوار وہ انوار ہیں جن کے ذریعے ان کا مالک اس چیز کو منکشف کرتا ہے جو طبیعت ہیولا (ہباء) میں صورتوں سے عطا کرتی ہے، اور وہ صورتیں جو عام صورت میں عطا کرتی ہے جو جسم کل کی صورت ہے۔ اور جب یہ انوار کمال کے ساتھ حاصل ہو جاتے ہیں، تو ان کے مالک کا علم اس چیز سے متعلق ہو جاتا ہے جو لامتناہی ہے، اور یہ ہمارے نزدیک کم ہی واقع ہوتا ہے۔ اور ہمارے علاوہ دوسروں کے نزدیک یہ عقلی طور پر ممنوع الوقوع ہے۔ یہاں تک کہ یہ ان کے نزدیک الٰہ کے بارے میں بھی اختلافی ہے۔ اور ہم نے کسی کو نہیں دیکھا جسے یہ کمال کے ساتھ حاصل ہوا ہو، اور نہ ہم نے اس کے بارے میں سنا ہے، اور نہ ہمیں حاصل ہوا ہے۔ اور اگر کوئی انسان اس کا دعویٰ کرے تو یہ ایسا دعویٰ ہے جس پر کوئی دلیل قائم نہیں ہوتی، حالانکہ اس کا حصول ممکن ہے۔ اور طبیعت (الطبیعۃ) کے انوار ذات حق (الحق) کے سوا ہر چیز میں شامل ہیں، اور وہ نفس الرحمن ہے جس کے ذریعے اللہ نے الٰہی اسماء سے سانس لیا، اور اللہ نے انہیں افلاک اور ارکان میں اور ان اشخاص میں شامل کر دیا جو لامتناہی تک پیدا ہوتے ہیں۔\n\n[ہواؤں (الریاح) کے انوار]\n\nاور ہواؤں (الریاح) کے انوار عنصری انوار ہیں جنہیں ان کے شدید ظہور نے چھپا دیا، پس انہوں نے آنکھوں کو ان کے ادراک سے ڈھانپ دیا۔ اور میں نے ان کا مشاہدہ صرف برزخی حضور (الحضرۃ البرزخیۃ) میں کیا، اگرچہ اللہ نے ہمیں قرطبہ شہر میں ایک دن کے لیے حسی طور پر ان کے دیدار سے نوازا، جو ایک الٰہی اختصاص اور محمدی نبوی وراثت تھی۔ اور ان ہواؤں (الریاح) کے انوار کو تمام بنی آدم پر غلبہ اور قوت حاصل ہے، سوائے اہل اللہ کے۔ کیونکہ یہ انوار ان کے انوار میں اس طرح شامل ہو جاتے ہیں جیسے ستاروں کے انوار سورج کے نور میں شامل ہو جاتے ہیں۔ اور یہ بصارت کے نور کی کمزوری کی وجہ سے ہے۔ اور جب یہ انوار عام لوگوں میں سے کسی کو ڈھانپ لیتے ہیں جسے اللہ چاہتا ہے، تو وہ اسے صرف تاریک بادل کی طرح ڈھانپتے ہیں۔ اور جب وہ اہل اللہ کو ڈھانپتے ہیں، تو وہ انہیں صرف ان کی اصلی حالت میں انوار کے طور پر ہی ڈھانپتے ہیں۔\n\n[ارواح کے انوار]\n\nاور ارواح کے انوار، ہم میں سے کچھ انہیں عقول کے انوار بناتے ہیں، اور کچھ انہیں رسولوں کے انوار بناتے ہیں۔ اور انہیں کون میں قوت، غلبہ اور نفوذ حاصل ہے، کوئی چیز ان کے سامنے نہیں ٹھہرتی، سوائے اس کے کہ ان کی حدود ہیں جہاں وہ ٹھہر جاتے ہیں اور ان سے تجاوز نہیں کرتے۔ جب بندہ ان کا مشاہدہ کرتا ہے، تو وہ ان کے ذریعے ان علوم کو منکشف کرتا ہے جو ان کے اہل کے علاوہ دوسروں سے چھپائے گئے ہیں۔ اور یہ سبوحی قدوسی انوار ہیں جو ذات حق (الحق) سے، جس کے ذریعے مخلوق کو پیدا کیا گیا، سدرۃ المنتہیٰ تک نازل ہوتے ہیں، اور اپنے شعاعوں کو عارفین کے دلوں پر ڈالتے ہیں جو کامل شہود (الشہود) والے ہیں۔ پس ان کے دل ان انوار کے شعاعوں کے گرنے کی جگہیں ہیں۔ اور اس انسانی صنف میں علم میں ان سے زیادہ کامل کوئی نہیں ہے، کیونکہ ان انوار کے سامنے کوئی حجاب نہیں ٹھہرتا سوائے خاص الٰہی مشیئت کے۔ اور اللہ کے بندوں میں سے بہت کم ہیں جن کے دل پر یہ انوار کشف (الکشف) پر اپنے شعاعیں ڈالتے ہیں۔ اور یہ اللہ تعالیٰ کے صادق بندوں کے مظاہر ہیں۔\n\n[انوار الانوار]\n\nاور انوار الانوار وہ سبحات (جلال کی چمکیں) ہیں کہ اگر ذات حق (الحق) اس حجاب کو ہٹا دے جو انہیں ہم سے چھپاتا ہے تو ہم جل جائیں گے۔ یہ ذاتی شعاعیں ہیں، جب وہ پھیلتی ہیں تو ممکنات کی اعیان ظاہر ہوتی ہیں۔ پس ممکنات ہی ہمارے اور ان کے درمیان حجاب ہیں۔ اور یہی نور عظیم ہے، نہ کہ اعظم۔ اس کی طرف اللہ تعالیٰ کے اس قول میں اشارہ ہے جو نازل شدہ الٰہی کتابوں کے اہل کے حق میں مشروع اعمال کے ساتھ ہے، اس کے قول میں: **وَلَوْ أَنَّهُمْ أَقامُوا التَّوْراةَ** (اور اگر وہ تورات کو قائم کرتے)، اور وہ موسوی ہیں، **وَالْإِنْجِيلَ** (اور انجیل کو)، اور وہ عیسوی ہیں، **وَما أُنْزِلَ إِلَيْهِمْ مِنْ رَبِّهِمْ** (اور جو کچھ ان پر ان کے رب کی طرف سے نازل کیا گیا)، اور وہ صحیفوں والے اور باقی کتابوں والے ہیں، **لَأَكَلُوا مِنْ فَوْقِهِمْ** (تو وہ اپنے اوپر سے کھاتے)، اور یہ وہ علوم ہیں جو کسب سے باہر ہیں، **وَمِنْ تَحْتِ أَرْجُلِهِمْ** (اور اپنے پاؤں کے نیچے سے)، اور یہ وہ علوم ہیں جو کسب کے تحت داخل ہوئے، پس وہ تحت اور فوق کے علوم میں سے ہیں۔ اور جب نور اس صفت کا ہو، تو وہ ہمارے نیچے سے نہیں ہوتا، بلکہ وہ وہی ہوتا ہے جو ہم پر تصرف کرتا ہے۔ اور وہ نور جو ہمارے نیچے سے ہوتا ہے، وہ وہ ہے جس پر ہم حکم کرتے ہیں، اور اسی کو \"پاؤں کے نیچے سے کھانا\" سے تعبیر کیا گیا ہے۔\n\nاور وہ نور جو ہماری ذات کی عینیت ہے، وہ ویسا ہی ہے جیسا کہ نبی صلی اللہ علیہ وسلم نے دعا میں فرمایا: \"اور مجھے نور بنا دے۔\" پس وہ اس کی ذات کی عینیت ہے۔ اور روایت \"اور میرے لیے نور بنا دے\" وہ تمام انوار ہیں جن کا ہم نے ذکر کیا۔ اور آپ کا قول \"مجھے نور بنا دے\" اپنی ذات کے نور کا مشاہدہ ہے، کیونکہ اس کے ذریعے ہی مشاہدہ کیا جاتا ہے۔ کیونکہ اس کی ذات نے ان انوار کو ان چھ جہتوں سے صرف اس لیے قبول کیا کہ وہ اپنے نفس کے نور کا ادراک نہیں کر سکی، جس کے بارے میں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"جس نے اپنے نفس کو پہچانا اس نے اپنے رب کو پہچانا۔\"\n\nاور اللہ **نُورُ السَّماواتِ وَالْأَرْضِ** (آسمانوں اور زمین کا نور ہے)، اور اس نے اس کی مثال اس چیز سے دی جس سے اس نے مثال دی، اور وہ تم ہو، عین وہ جس کی مثال دی گئی اور مثال۔ پس تم انوار کو اپنے سے پھوٹتے ہوئے دیکھتے ہو، تمہارے آسمانوں اور زمین کا عالم تمہاری ذات سے منور ہوتا ہے۔ پس تمہیں کسی اجنبی نور کی ضرورت نہیں جس سے تم روشنی حاصل کرو۔ پس تم ہی چراغ ہو، اور بتی ہو، اور طاق ہو، اور شیشہ ہو۔ اور جب تم یہ جان لو گے تو تم تیل کو جان لو گے، اور وہ الٰہی امداد ہے، اور تم درخت کو جان لو گے۔ اور جب شیشہ چمکتے ہوئے ستارے کی طرح ہو، اور یہاں وہ سورج ہے، تو تم اس چراغ کے بارے میں کیا گمان کرتے ہو جو تمہاری ذات کی عینیت ہے؟\n\nپس اے میرے بھائی! تمہاری دعا کبھی بھی یہ نہ ہو کہ اللہ تمہیں نور بنا دے۔ اور یہاں ایک عجیب راز ہے جس پر میں تمہیں بغیر شرح کے متنبہ کرتا ہوں، کیونکہ وہ شرح کا متحمل نہیں ہے۔ اور وہ یہ ہے کہ اللہ اپنے لیے مثالیں بیان کرتا ہے، اور اس کے لیے مثالیں بیان نہیں کی جاتیں۔ وہ اشیاء سے مشابہت رکھتا ہے، اور اشیاء اس سے مشابہت نہیں رکھتیں۔ پس کہا جاتا ہے کہ اللہ کی مثال اس کی مخلوق میں ایسی ہے جیسے بادشاہ کی اس کی بادشاہت میں، اور یہ نہیں کہا جاتا کہ بادشاہ کی اس کی بادشاہت میں مثال ایسی ہے جیسے اللہ کی اس کی مخلوق میں۔ کیونکہ وہ اس چیز کی عینیت ہے جو ظاہر ہوئی، اور جو ظاہر ہوا وہ اس کی عینیت نہیں ہے۔ کیونکہ وہ باطن ہے جیسا کہ وہ ظاہر ہے اپنی ظہور کی حالت میں۔ اسی لیے ہم نے کہا کہ وہ اشیاء کی مثال ہے اور اشیاء اس کی مثال نہیں ہیں، کیونکہ وہ ان کی عینیت تھا اور وہ اس کی عینیت نہیں ہے۔ اور یہ غریب علم میں سے ہے جو اپنے وطن سے اجنبی ہو گیا اور اس کے اور اس کے ٹھکانے کے درمیان رکاوٹ ڈال دی گئی، پس عقلوں نے اسے تسلیم نہیں کیا کیونکہ وہ معقول ہیں، انہیں آزادی نہیں دی گئی۔ اور یہ انوار الانوار کے ظہور الٰہی (التجلی) کا ایک نمونہ ہے۔\n\n[مادی چیزوں سے مجرد معانی کے انوار]\n\nاور مادی چیزوں سے مجرد معانی کے انوار بیان نہیں کیے جا سکتے، کیونکہ اگر وہ بیان کیے جاتے تو وہ مادی چیزوں میں داخل ہو جاتے، کیونکہ عبارات مادی چیزوں میں سے ہیں۔ اور ہم نے کہا ہے کہ وہ اپنی ذات کے لیے مادی چیزوں سے مجرد ہیں، نہ کہ وہ مجرد ہوئے ہیں۔ کیونکہ اگر وہ مجرد ہوئے ہوتے تو ہم جب چاہتے انہیں مادی چیزوں کا لباس پہنا دیتے، اور وہ انکار نہ کرتے، کیونکہ وہ پہلے ان میں تھے۔ پس وہ خاص طور پر معلوم ہوتے ہیں، اور نہ بیان کیے جاتے ہیں، نہ حکایت کیے جاتے ہیں، اور نہ تشبیہ اور تمثیل کو قبول کرتے ہیں۔\n\n[ارواح کے انوار]\n\nاور ارواح کے انوار، وہ روح القدس الجامع کے انوار ہیں۔ پس جو ان ارواح میں سے بھیجا گیا وہ فرشتہ تھا، اور جو نہیں بھیجا گیا اس پر روح کا نام اس کے خاص نام کے ساتھ باقی رہا۔ علم دونوں گروہوں میں ہے، بھیجے گئے اور نہ بھیجے گئے، پس وہ خالص روح ہے جسے کسی ایسی چیز نے مشابہت نہیں دی جو اسے اس کی ذات سے خارج کر دے۔ اور وہ اپنی روحانیت میں روح والی روح ہے، اور وہ صرف ارواح ہائمہ (حیران رہنے والی ارواح) ہیں۔ اور ہم میں سے افراد کی ارواح کسی حد تک ان سے مشابہت رکھتی ہیں۔ پس ارواح کے انوار میں ظہور الٰہی (التجلی) صرف افراد کے لیے واقع ہوتا ہے۔ اور اسی لیے خضر نے موسیٰ سے کہا: **ما لَمْ تُحِطْ بِهِ خُبْراً** (جس کا تم نے احاطہ نہیں کیا ہے)، کیونکہ وہ افراد میں سے تھے۔ اور انبیاء کے لیے فرشتوں کی ارواح کے انوار میں ظہور الٰہی (التجلی) واقع ہوتا ہے، اور افراد کے لیے یہ ظہور الٰہی (التجلی) نہیں ہوتا، بلکہ یہ انبیاء اور رسولوں کے لیے مخصوص ہے۔ اور یہی خضر کا قول ہے: \"تم ایک ایسے علم پر ہو جو اللہ نے تمہیں سکھایا ہے جو میں نہیں جانتا،\" کیونکہ انہیں یہ ملکی ظہور الٰہی (التجلی) حاصل نہیں تھا۔\n\nپھر انہوں نے انہیں متنبہ کیا کہ انہوں نے جو کچھ کیا وہ اپنے حکم سے نہیں کیا، کیونکہ ان کے لیے کوئی حکم نہیں تھا، اور وہ اہل امر میں سے نہیں تھے۔ اور یہ مقامات میں ایک عجیب مقام ہے۔ اگر اللہ تعالیٰ ہمیں اسے مخلوق کے سامنے منکشف کرنے کی اجازت دیتا تو ایک ایسا علم ظاہر ہوتا جس کے سامنے کون قائم نہ رہ سکتا۔ اس کا اثر تین مسائل میں ایک ایسے شخص سے ظاہر ہوا جس کی شہادت اللہ نے اپنے نبی کے پاس اس کی عدالت کے ساتھ دی اور اسے پاکیزہ قرار دیا اور وہ اس کا پیروکار بن گیا اور اسے وہ کچھ بیان کیا جو تم نے سنا، اور اس نے خود کو اس کی شرط کے تحت اس کے پیروکاروں میں داخل کر لیا، اور وہ موسیٰ کلیم اللہ اور اس کا نجی (رازدار) ہے۔ اور اس کی اپنے رب کے ساتھ گفتگو کہاں اور اس کی خضر کے ساتھ گفتگو کہاں! پس گفتگو میں ظہور الٰہی (التجلی) مختلف ہوا۔ اس کے باوجود وہ صبر نہ کر سکے، کیونکہ انہوں نے استثناء کو مقدم کیا تھا، اور جب ان پر انکار کیا گیا تو انہوں نے اسے مقدم نہیں کیا۔ کیونکہ نبی کی شان یہ ہے کہ وہ متبوع بھی ہو جیسا کہ وہ متبع ہے۔ اور اسی طرح انہوں نے فرمایا: **إِنْ أَتَّبِعُ إِلَّا ما يُوحى‏ إِلَيَّ** (میں صرف اسی کی پیروی کرتا ہوں جو میری طرف وحی کی جاتی ہے)۔ انہوں نے یہ نہیں کہا کہ میں صرف وہی کرتا یا کہتا ہوں جس کا میں مشاہدہ کرتا ہوں۔ انہوں نے ایسا نہیں کہا۔ پس ہر مقام کے لیے ایک قول اور ایک زبان ہے۔\n\n[ہواؤں (الریاح) کے انوار]\n\nاور ہواؤں (الریاح) کے انوار، وہ اسم البعید (دور کرنے والا) کے ظہور الٰہی (التجلی) ہیں، اور یہ ایسے ظہور الٰہی (التجلی) ہیں جن کا نام لینا مناسب نہیں، اور یہ صرف اہل الہام کے لیے ہوتے ہیں۔ اور فرشتوں کے انوار میں ظہور الٰہی (التجلی) کا اس میں دخل ہے، لیکن خاص طور پر باطن میں، نہ کہ ظاہر میں۔ اور وہ خاص طور پر لمات (دل میں آنے والے خیالات) اور الہام کے فرشتے ہیں۔ اور اس ظہور الٰہی (التجلی) میں نفوس پر القاء ہوتا ہے۔ اور اس ظہور الٰہی (التجلی) سے خواطر (خیالات) پیدا ہوتے ہیں، اور وہ سب ریحانی (ہوائی) ہوتے ہیں، کیونکہ ہوائیں گزر جاتی ہیں اور ٹھہرتی نہیں ہیں۔ پس اگر کوئی ان کے ٹھہرنے کا دعویٰ کرے تو وہ ہوا نہیں ہے۔ اور اسی لیے انہیں گزرنے سے موصوف کیا جاتا ہے اور خواطر (خیالات) کہا جاتا ہے، اور یہ \"راح یروح\" (گزر گیا، گزرتا ہے) سے ہے، اور الرائح (گزرنے والا) وہ نہیں جو مقیم ہو۔\n\nاور طبعی انوار میں ظہور الٰہی (التجلی) صوری مرکب ظہور الٰہی (التجلی) ہے، پس وہ ان صورتوں کے مطابق معرفتیں عطا کرتا ہے جو اس میں ظاہر ہوئیں۔ اور یہ فلک سے لے کر ادنیٰ حشرات تک، اور وہ آسمان اور عالم ہے، سب کو شامل ہے۔ پس یہ آسمان اور عالم میں ظہور الٰہی (التجلی) ہے۔ اور اس ظہور الٰہی (التجلی) سے معانی اور لغات اور ہر صورت کی نماز اور اس کی تسبیح معلوم ہوتی ہے۔ اور یہ ایک عظیم، نفع بخش، مؤید کشف (الکشف) ہے، جس میں مکاشف عالم کی موافقت دیکھتا ہے اور یہ کہ وہاں کوئی مخالفت نہیں ہے۔ اور یہاں سے وہ ہر چیز کو **يُسَبِّحُ بِحَمْدِهِ** (اس کی حمد کے ساتھ تسبیح کرتی ہے) دیکھتا ہے۔\n\nاور اس مقام کا مالک شہود (الشہود) پر اپنے اعمال کی صورتوں کو دیکھتا ہے جو زندہ ہوتی ہیں، اللہ کی تسبیح کرتی ہیں، اور ان میں روح ہوتی ہے جسے اس مقام کا مالک پھونکتا ہے۔ اور اگرچہ وہ ظاہر کون میں مخالفت اور معصیت ہوں، لیکن وہ صحیح مخالفت ہوتی ہیں، مگر وہ زندہ اور گویا ہوتی ہیں، اپنے مالک کے لیے استغفار کرتی ہیں، کیونکہ اس نے ان کی نشأت کو مکمل طور پر بنایا ہے۔ اور اللہ نے اپنی تعریف کی ہے کہ اس نے پیدا کیا اور پھر درست کیا۔ اور ان کی نشأت کو مکمل طور پر بنانے میں یہ ہے کہ اس نے انہیں معصیت ہونے سے خارج نہیں کیا۔ پس اگر وہ انہیں معصیت ہونے سے خارج کر دیتا تو وہ نامکمل ہوتیں، اور ان کا مالک بدبخت ہو جاتا، اور ان کی تسبیح ان کے مالک کے لیے لعنت ہوتی۔ کیونکہ اس نے اس چیز کو جائز قرار دیا جسے اللہ نے حرام کیا، پس وہ اس سے ایمان سے خارج ہو گیا، اور اسلام میں اس کا کوئی حصہ نہیں مگر یہ کہ وہ اپنا اسلام تجدید کرے اور توبہ کرے۔ اور یہ ایک تنبیہ ہے جسے اس کے اہل غیرت اور کمزوری کی وجہ سے ہمیشہ چھپاتے رہے ہیں۔ اور اس پر تنبیہ کرنا زیادہ اولیٰ ہے، کیونکہ یہ اللہ، اس کے رسول، اور مسلمانوں کے ائمہ اور عام لوگوں کے لیے نصیحت ہے۔ پس کوئی معصیت کبھی بھی مکمل طور پر بنی ہوئی نہیں پائی جاتی مگر کسی مؤمن سے۔ اور جس نے کسی چیز کو اس کی خلقت عطا کی، تو وہ الٰہی سنت پر چلا، کیونکہ اللہ نے **أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ** (ہر چیز کو اس کی خلقت عطا کی)۔ پس اس نے معصیت کو اس کی خلقت عطا کی اور طاعت کو اس کی خلقت عطا کی۔ پس مؤمن کی صفت ایسی ہی ہوتی ہے۔\n\n[اسماء کے انوار]\n\nاور اسماء کے انوار، وہ معلومات کے اسماء کی اعیان ہیں۔ پس وہ ایک نور ہے جو معدومات اور موجودات پر پھیلتا ہے، اور اس کے پھیلاؤ کی وسعت لامتناہی نہیں ہوتی۔ اور عین اس کے پھیلاؤ کے ساتھ چلتی ہے، پس اس مقام کے مالک کی عین کا نور پھیلتا ہے، اور وہ لامتناہی کو جانتا ہے، جیسا کہ وہ اعداد کے تضاعف سے لامتناہی کو نہیں جانتا۔ اور یہ اس شخص کی علامت ہے جس کی بصارت ذات حق (الحق) ہو۔\n\nپس تمام اسماء موجود ہیں، اور مسمیات میں سے کچھ ایسے ہیں جو اپنی ذات کے لیے معدوم العین ہیں، اور کچھ ایسے ہیں جو اپنی ذات کے لیے عدم میں مقدم ہیں، اور وہ وہ ہیں جو ہستی (الوجود) کو قبول کرتے ہیں۔ اور احوال ہستی (الوجود) کو قبول نہیں کرتے، اس سب پر اسم کے اطلاق کے باوجود۔ پس اسماء کے لیے احاطہ ہے، اور احاطہ اللہ کے لیے ہے، نہ کہ کسی اور کے لیے۔ پس یہ الٰہی اسماء کا مرتبہ ہے۔ اور آدم نے فرشتوں پر صرف اسماء کے علم کے احاطے سے فضیلت حاصل کی۔ کیونکہ اگر اسماء نہ ہوتے تو اللہ کسی چیز کا ذکر نہ کرتا، اور نہ کوئی چیز اللہ کا ذکر کرتی۔ پس ذکر صرف ان کے ذریعے ہوتا ہے، اور ذکر اور حمد صرف ان کے ذریعے کی جاتی ہے۔ پس علم کی صفت کو احاطے میں صرف قول نے ہی ٹکر دی ہے، اور قول سب کا سب اسماء ہے، قول اسماء کے علاوہ کچھ نہیں ہے۔ اور اسماء اپنے نیچے موجود معانی پر علامات اور دلائل ہیں۔ پس جس پر اسماء کا نور ظاہر ہوا، اس پر وہ ظاہر ہوا جس کا ذکر کرنا ممکن نہیں ہے۔ میں اس کے علاوہ کچھ نہیں کہتا۔ اور اگر ذات حق (الحق) نے آدم کے علم کی صفت میں اسماء پر لفظ \"کل\" (سب) کا اطلاق نہ کیا ہوتا، تو ہم کہتے کہ اسماء کے نور کا مسمیات پر عین کے لیے پھیلنا محال ہے۔ لیکن جس نے اللہ تعالیٰ کے اس قول کو سمجھا: **ثُمَّ عَرَضَهُمْ عَلَى الْمَلائِكَةِ فَقالَ أَنْبِئُونِي بِأَسْماءِ هؤُلاءِ** (پھر اس نے انہیں فرشتوں پر پیش کیا اور فرمایا: مجھے ان کے نام بتاؤ)، اور اشارہ کیا، تو اس نے جان لیا کہ ہم نے ادب کے طور پر کیا التزام کیا ہے اور اللہ نے اس تشریف میں لفظ \"کل\" سے کیا مراد لیا ہے۔\n\n[مولدات، امہات، علل اور اسباب کے انوار]\n\nاور مولدات، امہات، علل اور اسباب کے انوار، وہ ایک الٰہی ظہور الٰہی (التجلی) ہے اس حیثیت سے کہ وہ مؤثر ہے، اور اس حیثیت سے کہ وہ جواب دینے والا ہے جب اس سے سوال کیا جائے، اور بخشنے والا ہے جب استغفار کیا جائے، اور عطا کرنے والا ہے جب سوال کیا جائے۔ اور اس ظہور الٰہی (التجلی) اور ان انوار کے ذریعے تم اس کے قول کو جانتے ہو: **إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ اللَّهَ** (بے شک جو لوگ آپ سے بیعت کرتے ہیں، وہ درحقیقت اللہ سے بیعت کرتے ہیں)، اور اس کے قول کو بھی، عز و جل: **مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ اللَّهَ** (جس نے رسول کی اطاعت کی، اس نے درحقیقت اللہ کی اطاعت کی)، اور اس کے قول کو، تبارک و تعالیٰ: \"بے شک صدقہ رحمن کے ہاتھ میں پڑتا ہے،\" اور اس کے قول کو: **وَأَقْرِضُوا اللَّهَ قَرْضاً حَسَناً** (اور اللہ کو اچھا قرض دو)، اور اس کے قول کو، علیہ السلام: \"بے شک اللہ اپنے بندے کی توبہ پر خوش ہوتا ہے۔\"",
    "fa": "«باب دویست و ششم در بیان حال تجلی (al-Tajallī) با حرف جیم»\n\nغیب را نوری است بر بصیرت‌ها *** که آنچه در نهان‌هاست آشکار می‌سازد\n\nبرای هر قلبی از هر شخصی *** که حق (al-Ḥaqq) او را در محضرها حاضر گردانیده است\n\nپس امر را مشاهده کرد که چگونه جاری می‌شود *** و حکم را در تقدیرها به چشم دید\n\nپس نزد او (حق) اول و ظاهر است *** و نزد ما باطن و آخر\n\nقسمت او مانند نماز در میان ماست *** عین برای عین، پس شکر کن و بشتاب\n\nمیان بنده‌ای که اسیر عجز است *** و پروردگاری که بر او تواناست\n\nبه فضل اوست که به سوی ما جاری شد *** آنچه خدا را در نهادها ستایش می‌کند\n\n### [تجلی (al-Tajallī) آن است که از انوار غیوب (al-Ghuyūb) بر دل‌ها آشکار می‌شود]\n\nبدان که تجلی (al-Tajallī) نزد اهل طریقت (al-Qawm) آن است که از انوار غیوب (al-Ghuyūb) بر دل‌ها آشکار می‌شود، و این بر مقامات مختلفی است. پس برخی از آن مربوط به انوار معانی مجرد از مواد است، مانند معارف و اسرار؛ و برخی مربوط به انوار انوار؛ و برخی مربوط به انوار ارواح که همان فرشتگان هستند؛ و برخی مربوط به انوار بادها (الریاح)؛ و برخی مربوط به انوار طبیعت؛ و برخی مربوط به انوار اسماء؛ و برخی مربوط به انوار مولدات (موجودات متولد شده)، مادران، علل و اسباب، بر حسب مراتبشان.\n\nپس هر نوری از این انوار، هنگامی که از افقی طلوع کند و با چشم بصیرت موافق افتد، در حالی که از کوری، پرده، شکاف، رمد و آفات چشم‌ها سالم باشد، با هر نوری آنچه بر آن گسترده شده است را کشف می‌کند. پس ذوات معانی را آن‌گونه که در نفس خود هستند به چشم می‌بیند، و ارتباط آن‌ها را با صورت‌های الفاظ و کلماتی که بر آن‌ها دلالت دارند مشاهده می‌کند، و با شهود (al-Shuhūd) آن‌ها، حقایقی را که در نفس‌الامر دارند، بدون تخیل و تدلیس، به او عطا می‌کند.\n\nپس برخی از آن‌ها انواری هستند که با آن‌ها حرکت می‌کنیم، و برخی انواری هستند که به سوی آن‌ها حرکت می‌کنیم، و برخی انواری هستند که از آن‌ها حرکت می‌کنیم، و برخی انواری هستند که پیش روی ما حرکت می‌کنند، و برخی انواری هستند که پشت سر ما قرار دارند و کسانی که از ما پیروی می‌کنند با آن‌ها حرکت می‌کنند، و برخی انواری هستند که در سمت راست ما قرار دارند و ما را تأیید می‌کنند، و برخی انواری هستند که در سمت چپ ما قرار دارند و ما را حفظ می‌کنند، و برخی انواری هستند که بالای سر ما قرار دارند و بر ما نازل می‌شوند تا به ما فایده رسانند، و برخی انواری هستند که زیر پای ما قرار دارند و ما با تصرف در آن‌ها مالکشان می‌شویم، و برخی انواری هستند که ما خود آن‌ها هستیم، یعنی پوست و موی ما، و این نهایت امر است.\n\nاما انوار معانی مجرد از مواد، هر علمی است که نه به جسم و نه به جسمانی، نه به متخیل و نه به صورت تعلق دارد، و ما آن را از حیث تصورش نمی‌دانیم، بلکه آن را آن‌گونه که هست تعقل می‌کنیم، اما به واسطه آنچه ما بر آن هستیم. و این محقق نمی‌شود مگر آنکه من خود نور باشم. پس تا زمانی که در این مرتبه نباشم، چیزی از این علم را درک نمی‌کنم. و این همان فرموده پیامبر (صلی الله علیه و سلم) است:\n\nدر دعای خود (صلی الله علیه و سلم): «و مرا نور قرار ده.»\n\nو خداوند می‌فرماید: «اللَّهُ نُورُ السَّماواتِ وَالْأَرْضِ» (خداوند نور آسمان‌ها و زمین است). پس آسمان‌ها و زمین جز به واسطه او روشن نشدند، چنانکه فرمود: «وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّها» (و زمین به نور پروردگارش روشن شد)، یعنی زمین محشر. می‌فرماید: در آنجا خورشیدی نیست و نبود نور، ظلمت است، و شهود (al-Shuhūd) ضروری است، پس نور ضروری است. و آن روزی است که خداوند برای فصل و قضاوت می‌آید، و جز در اسم نور خود نمی‌آید. پس زمین به نور پروردگارش روشن می‌شود و هر نفسی به واسطه آن نور می‌داند که «ما قَدَّمَتْ وَأَخَّرَتْ» (چه پیش فرستاده و چه به تأخیر انداخته است). نه به واسطه خود نفس، بلکه آن را حاضر می‌یابد و آن نور برایش کشف می‌کند. و اگر نبود آنچه نفوس بر آن هستند از انوار، مشاهده (al-Mushāhadah) صحیح نمی‌شد، زیرا شهود (al-Shuhūd) جز با اجتماع دو نور حاصل نمی‌شود. و کسی که بهره‌ای از نور داشته باشد، چگونه به شقاوت ابدی دچار می‌شود، در حالی که نور از عالم شقاوت نیست؟ و هیچ نفسی نیست مگر اینکه نوری دارد که با آن، آنچه را عمل کرده است کشف می‌کند. پس آنچه خیر باشد، با آن شاد می‌شود، و آنچه بدی باشد، «تَوَدُّ لَوْ أَنَّ بَيْنَها وَبَيْنَهُ أَمَداً بَعِيداً» (دوست دارد که میان او و آن بدی فاصله‌ای دور باشد). و به همین دلیل آیه را با این کلام ختم کرد: «وَاللَّهُ رَؤُفٌ بِالْعِبادِ» (و خداوند نسبت به بندگان بسیار مهربان است)، زیرا برای آن‌ها انواری قرار داد که با آن‌ها درک می‌کنند.\n\n### [اینکه نور بهره‌ای در سعادت دارد]\n\nو دانسته‌اند که نور بهره‌ای در شقاوت ندارد، پس ناگزیر سرانجام به سوی سازگاری و حصول مقصود است، و این همان چیزی است که از آن به سعادت تعبیر می‌شود. زیرا فرمود: «کل نفس» (هر نفسی)، و عمومیت داد و نفسی را از نفسی استثنا نکرد، و خیر و شر را ذکر کرد. پس هستی (al-Wujūd) نور است و نیستی ظلمت. پس شر، نیستی است و ما در هستی هستیم، پس ما در خیر هستیم. و اگر بیمار شویم، بهبود می‌یابیم، زیرا اصل، جبران‌کننده است و آن نور است. و صفت هر نوری چنین است که تنها آمده تا آنچه بر آن طلوع کرده است را آشکار سازد. پس اشیاء جز به واسطه تو و به واسطه آن درک نمی‌شوند. به همین دلیل، نتیجه‌ای صحیح نیست، یعنی جز میان دو چیز حاصل نمی‌شود: اصل آن اقتدار الهی و قبول ممکن برای انفعال. اگر یکی از این دو حقیقت کم بود، عین عالم ظاهر نمی‌شد.\n\nما در مورد این انوار، امری کلی به تو دادیم و از بسط آن به دلیل ترس از طولانی شدن خودداری می‌کنیم، زیرا احوال، تفصیل را برنمی‌تابد. پس به ذکر انوار مبهم می‌پردازیم:\n\nاما نوری که با آن حرکت می‌کنیم، همان است که پیش‌تر ذکر شد از انوار معلومات، که به ذکر یکی از آن‌ها اکتفا کردیم تا هشداری و نمونه‌ای برای آنچه مسکوت گذاشتیم باشد.\n\nو اما نوری که پیش روی ماست، نور وقت است. و وقت همان چیزی است که تو با آن هستی، پس نور آن همان چیزی است که تو با آن هستی. پس در آن بنگر، هرگونه که باشد، آن مشهود توست که بر تو حاکم است و به واسطه تو قائم است. و آن عین اسم الهی است که تو در حال (وقت) به واسطه آن قائمی، و در گذشته و آینده حکمی ندارد.\n\nو اما نوری که در سمت راست توست، آن است که تو را تأیید می‌کند و بر آنچه نور پیش رویت از تو می‌طلبد، یاری‌دهنده است. و این همان چیزی است که در حال نماز در قول خود از خدا خواستی: «وَإِيَّاكَ نَسْتَعِينُ» (و تنها از تو یاری می‌جوییم). و نماز نور است و آن همان نوری است که پیش روی توست، یعنی وقت تو که با آن هستی. پس هنگامی که گفتی: «وَإِيَّاكَ نَسْتَعِينُ»، تو را با نوری از سمت راستت تأیید کرد، زیرا یمین (راست) همان قوت است. شاعر می‌گوید:\n\nهرگاه پرچمی برای مجد برافراشته شود *** عرابه آن را با دست راست می‌گیرد.\n\nو اما نوری که در سمت چپ توست، نور وقایه و سپر در برابر شبهات گمراه‌کننده است که جهالت‌ها، التباس و تشکیک را در نفوس ناظر و جستجوگر در اعتقاد به خدا و آنچه او از خود خبر داده است، تأثیر می‌گذارد. و این بر دو نوع است: نور ایمان و نور دلیل. و نور دلیل نیز بر دو نوع است: نور نظر فکری و نور نظر کشفی (al-Kashfī). پس امر را آن‌گونه که در نفس خود هست می‌داند. این فایده نوری است که از سمت چپ می‌آید.\n\nو اما نوری که پشت سر ماست، نوری است که پیش روی کسی حرکت می‌کند که از ما پیروی می‌کند و در مسیر ما گام برمی‌دارد. پس برای آن‌ها از پیش رویشان است و برای ما از پشت سرمان. او به واسطه آن نور که آن‌ها را از تقلید خارج می‌سازد، با بصیرت از ما پیروی می‌کند. خداوند فرمود: «أَدْعُوا إِلَى اللَّهِ عَلى‏ بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي» (من و هر که از من پیروی کند، با بصیرت به سوی خدا دعوت می‌کنیم). پس او با نوری که پیش رویش است، با بصیرت دعوت می‌کند، و دعوت‌کننده پیرو او با نوری که پشت سرش است دعوت می‌کند تا این پیرو نیز در آنچه به آن دعوت می‌کند، مانند کسی که از او پیروی کرده است، بر بصیرت باشد. و به واسطه آن نور، آنچه را پشت سر خود می‌بیند، مانند آنچه پیش روی خود می‌بیند. و این مقامی است که در سال پانصد و نود و سه در شهر فاس، هنگام نماز عصر، در حالی که با جماعتی در مسجد ازهر در کنار چشمه کوه نماز می‌خواندم، به آن دست یافتم. آن را نوری دیدم که تقریباً از نوری که پیش رویم بود آشکارتر بود، جز اینکه وقتی آن را دیدم، حکم پشت سر بودن از من زائل شد و پشت یا قفایی برای خود ندیدم. و در آن رؤیت، بین جهات خود تفاوتی قائل نشدم، بلکه مانند یک گوی بودم که برای خود جهتی را جز به فرض، نه به وجود، تعقل نمی‌کردم. و امر همان‌گونه بود که مشاهده کردم، با اینکه پیش از آن کشف (al-Kashf) اشیاء در عرض دیوار قبله‌ام برایم حاصل شده بود، اما این کشف شبیه آن کشف نیست.\n\nو اما نوری که از بالای سر من است، تنزل نور الهی قدسی است با علمی غریب که خبری از آن پیشی نگرفته و نظر (فکری) آن را نمی‌دهد. و این نور است که از علم به خدا چیزی را عطا می‌کند که ادله عقلی آن را رد می‌کنند، اگر ایمان نداشته باشند. اما اگر ایمان نورانی داشته باشند، آن را با تأویل می‌پذیرند تا بین دو امر جمع کنند.\n\nو اما نوری که از زیر پای ماست، نوری است که تحت حکم و تصرف ما قرار دارد. امر الهی با آن در ما قرین نمی‌شود که نزد آن توقف کنیم و جز در آن تصرف نکنیم.\n\nو اما انواری که با آن‌ها حرکت می‌کنیم، انوار معیت (همراهی) از جانب حق (al-Ḥaqq) است در قول او: «وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ» (و او با شماست هر کجا که باشید). به همین دلیل گفتیم از جانب حق، زیرا هیچ یک از خلق خدا در این معیت با دیگری اختصاص ندارد. و این معیت دارای اسم حفیظ (نگهدارنده) و محیط (فراگیر) است. زیرا خداوند با برخی از بندگان خود معیت اختصاصی دارد، مانند معیت او با موسی و هارون در قولش: «إِنَّنِي مَعَكُما أَسْمَعُ وَأَرى‏» (من با شما هستم، می‌شنوم و می‌بینم). این بشارتی برای آن دو بود تا نترسند، زیرا گفته بودند: «إِنَّنا نَخافُ أَنْ يَفْرُطَ عَلَيْنا أَوْ أَنْ يَطْغى‏» (ما می‌ترسیم که او بر ما پیشی گیرد یا طغیان کند)، یعنی با حجت پیشی گیرد و برتری یابد، زیرا ملک و سلطنت از آن اوست. پس خداوند آن‌ها را از آنچه می‌ترسیدند ایمن ساخت.\n\nو از اینجا مرتبه محمد (صلی الله علیه و سلم) و برتری آن بر رتبه سایر رسولان را می‌شناسی. زیرا خداوند در مورد محمد (صلی الله علیه و سلم) در حال ترس صدیق (ابوبکر) بر او و بر خودش خبر داد و به صاحبش فرمود تا او را ایمن سازد و شاد گرداند، «إِذْ هُما فِي الْغارِ» (هنگامی که آن دو در غار بودند)، و آن پناه حق (al-Ḥaqq) بر آن دو بود: «لا تَحْزَنْ إِنَّ اللَّهَ مَعَنا» (غمگین مباش، همانا خداوند با ماست). پس پیامبر (صلی الله علیه و سلم) در این خبر، در مقام حق (al-Ḥaqq) در معیت با موسی و هارون ایستاد و جانشین او شد. عنایت الهی این‌گونه است.\n\nپس این همان نوری است که با آن حرکت می‌شود، و او پیوسته در حرکت است، و حق (al-Ḥaqq) پیوسته با اوست، حافظ و یاور، نه رهاکننده. و به همین دلیل، از جانب خداوند بر زبان رسولش (صلی الله علیه و سلم) به ما خبر داده شد که اگر ما با نوافل (اعمال مستحب) خیرات بیاییم، نه با فرائض (واجبات)، حق (al-Ḥaqq) ما را دوست می‌دارد، پس او گوش ما می‌شود که با آن می‌شنویم، و پای ما که با آن به سوی تمام قوای ما و اعضای ما حرکت می‌کنیم. این چیزی است که نوافل در ما از حق (al-Ḥaqq) عطا کرده است. پس تو کجایی از آنچه فرائض عطا می‌کنند؟ چقدر فاصله است میان عبودیت اضطرار و عبودیت اختیار! مشارکت با حق (al-Ḥaqq) در عبودیت اختیار در احادیث نزول او در خطاب به بنده‌اش رخ می‌دهد، مانند اشتیاق، گرسنگی، تشنگی، بیماری و امثال آن. اما عبودیت اضطرار، مشارکتی در آن رخ نمی‌دهد، و آن برای بنده خالص است. پس کسی که در آن اقامه شود، مقامی بالاتر از آن نیست. خداوند به ابویزید (بسطامی) می‌فرماید: «با چیزی به من تقرب جوی که برای من نیست: خواری و فقر.» پس عین قربت در اینجا، عین دوری از مقام است، پس بفهم.\n\nو اما نوری که از آن حرکت می‌کنیم، نور حقیقت (al-Ḥaqīqah) است، چه آن را بداند و چه نداند. پس با این نور آن را کشف می‌کند و کشف می‌کند که از آن حرکت کرده است. سپس نوری که به سوی آن حرکت می‌کند، یعنی شریعت، بر او آشکار می‌شود. پس صاحب این مقام، معصوم، محفوظ، مورد عنایت و دانایی است که جاهل نمی‌شود، زیرا متصف به علمی است که جهل در آن نیست. زیرا بندگانی هستند که از نور شریعت به سوی نور حقیقت (al-Ḥaqīqah) حرکت می‌کنند و بر آن‌ها بیم است. اما کسانی که بر کشف (al-Kashf) از نور حقیقت به سوی نور شریعت حرکت می‌کنند، از این مکر الهی در امان هستند. آن‌ها بر بصیرت از امر خود هستند، در حالی که آن گروه زیر خطر عظیمی هستند که ممکن است در آن معصوم شوند یا رها گردند. پس این را بدان.\n\nو اما انوار مولدات (موجودات متولد شده)، انواری هستند که به ذات خود، علمی صحیح از علم به خدا به او می‌دهند که با آن، نسبت حق (al-Ḥaqq) و صورت او را در صورت‌های اعیان معادن، نباتات و حیوانات کشف می‌کند، در حالی که آن‌ها (مولدات) نمی‌دانند. و انسان بر این‌ها برتری نیافته مگر به واسطه کشف او از این امر. پس مولدات در این مقام به منزله قول او هستند: «وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ»، و انسان در آن به منزله: «لا تَحْزَنْ إِنَّ اللَّهَ مَعَنا» و «إِنَّنِي مَعَكُما أَسْمَعُ وَأَرى‏». زیرا او (انسان) صورت هر چیزی در نفس‌الامر است. پس کسی که این را بداند و با این نور کشف کند، از اهل اختصاص است. او اشیاء را به صورت حقیقی و عینی می‌بیند. و کسی که به نقل او در این مسئله اعتماد دارم، به من خبر داد که شخصی در دمشق بود که این مقام را داشت و سرش پیوسته میان دو زانویش بود. هنگامی که سرش را بالا می‌آورد و به اشیاء نگاه می‌کرد، پیوسته می‌گفت: «بگیریدش، بگیریدش.» و مردم نمی‌دانستند چه می‌گوید، پس او را به جنون متهم می‌کردند. اما من آن را چشیده‌ام، و حمد از آن خداست بر این امر.\n\n### [انوار اسماء که به ذات و صفات تعلق دارند]\n\nو اما انوار اسماء، آن‌هایی هستند که مسمیات خود را به حق (al-Ḥaqq) و خلق آشکار می‌سازند، از آنچه مربوط به ذات، صفات و افعال در الهیات است. برخی از آن‌ها مربوط به اجناس ممکنات و اشخاص آن‌هاست، از جمله اسم‌هایی که حق (al-Ḥaqq) برای آن‌ها وضع کرده و رسولان آن را ابلاغ کرده‌اند، نه آنچه بر آن اصطلاح شده است. و این‌ها همان انواری هستند که برای آدم (علیه السلام) بودند، هنگامی که تمام اسماء را به وضع الهی، نه به اصطلاح، دانست. و فضیلت و اختصاص در این است. زیرا خداوند اسم‌هایی دارد که با آن‌ها فرشتگان و تمام عالم را ایجاد کرد، و اسم‌هایی دارد که با آن‌ها جامع حقایق حضرت الهیه، یعنی انسان کامل (al-Insān al-Kāmil)، را ایجاد کرد. این امر در آدم به نص ظاهر شد و در غیر او پنهان ماند. پس در فضیلت آدم و فضیلت این مقام، به فرشتگان فرمود، در حالی که مسمیات، یعنی اعیان آن‌ها، را برای فرشتگان حاضر کرده بود: «أَنْبِئُونِي بِأَسْماءِ هؤُلاءِ إِنْ كُنْتُمْ صادِقِينَ» (اگر راست می‌گویید، مرا از نام‌های این‌ها خبر دهید)، یعنی با اسم‌های الهی که از آن‌ها صادر شده‌اند. آن‌ها این را به ذوق (تجربه عرفانی) نمی‌دانستند، زیرا علوم بزرگان به ذوق است، چرا که از تجلی الهی (al-Tajallī al-Ilāhī) حاصل می‌شود. پس خداوند فرمود: «يا آدَمُ أَنْبِئْهُمْ بِأَسْمائِهِمْ» (ای آدم، آن‌ها را از نام‌هایشان خبر ده). پس آدم آن‌ها را از اسم‌های الهی‌شان که آن‌ها را ایجاد کرده و در ایجاد اعیانشان به آن‌ها استناد شده بود، خبر داد، نه اسم‌های اصطلاحی وضعی کونی. زیرا در آن فایده‌ای نیست، مگر به وجهی دور که از ذکر آن صرف نظر کردیم، چون دانستیم که مقصود نبوده است. زیرا ما سخن نمی‌گوییم و ترجمه نمی‌کنیم مگر از آنچه واقع شده است، نه از آنچه عقلاً ممکن است. و این تفاوت میان اهل کشف (al-Kashf) در آنچه خبر می‌دهند، که همان اهل بصیرت هستند، و میان اهل نظر عقلی است. و فایده تنها در چیزی است که واقع شده، نه در چیزی که ممکن است، زیرا آن علم نیست، و آنچه واقع شده، علم محقق است.\n\n### [انوار طبیعت]\n\nو اما انوار طبیعت، انواری هستند که صاحب آن با آن‌ها کشف می‌کند که طبیعت چه صورت‌هایی را در هباء (ماده اولیه) و چه صورت‌هایی را در صورت عامه که همان صورت جسم کلی است، عطا می‌کند. و این انوار، اگر به کمال حاصل شوند، علم صاحب آن به آنچه نامتناهی است تعلق می‌گیرد. و این نزد ما وقوعش نادر است، اما نزد دیگران وقوعش عقلاً ممنوع است، تا جایی که این امر در مورد اله (خداوند) نیز نزد آن‌ها مورد اختلاف است. و ما ندیده‌ایم کسی آن را به کمال حاصل کرده باشد و نشنیده‌ایم، و برای ما نیز حاصل نشده است. و اگر کسی ادعای آن کند، ادعایی است که دلیلی بر آن نیست، با وجود امکان حصول آن. و انوار طبیعت در هر آنچه غیر حق (al-Ḥaqq) است مندرج است، و آن همان نَفَس رحمان است که خداوند با آن از اسماء الهی تنفس کرد و آن را در افلاک و ارکان و آنچه از اشخاص متولد می‌شود تا بی‌نهایت، درج کرد.\n\n### [انوار بادها (الریاح)]\n\nو اما انوار بادها (الریاح)، انوار عنصری هستند که شدت ظهورشان آن‌ها را پنهان کرده، پس دیده‌ها از درک آن‌ها پوشیده شده‌اند. و من آن‌ها را جز در حضرت برزخیه مشاهده نکردم، اگرچه خداوند ما را به رؤیت حسی آن‌ها در شهر قرطبه، به مدت یک روز، به اختصاص الهی و وراثت نبوی محمدی، مشرف ساخت. و این انوار ریاحی (بادی) بر تمام بنی آدم سلطنت و قدرت دارند، مگر اهل الله. زیرا این انوار در انوار آن‌ها مندرج می‌شوند، مانند اندراج انوار ستارگان در نور خورشید. و این به دلیل ضعف نور بصر است. و هنگامی که این انوار کسانی از عوام را که خدا بخواهد بپوشاند، نمی‌پوشاند مگر مانند ابر تاریک. و هنگامی که اهل الله را می‌پوشاند، نمی‌پوشاند مگر در حالی که آن‌ها بر هیئت خود نور هستند.\n\n### [انوار ارواح]\n\nو اما انوار ارواح، برخی از ما آن‌ها را انوار عقول می‌دانند و برخی انوار رسولان. و آن‌ها دارای قوت، سلطنت و نفوذ در کون هستند و چیزی در برابر آن‌ها نمی‌ایستد، جز اینکه حدودی دارند که نزد آن‌ها توقف می‌کنند و از آن‌ها تجاوز نمی‌کنند. هنگامی که بنده آن‌ها را مشاهده کند، با آن‌ها آنچه از علوم پنهان که بر غیر اهلش مضایقه شده است را کشف می‌کند. و آن‌ها انوار سبوحی و قدوسی هستند که از حق (al-Ḥaqq) مخلوق به سوی سدرة المنتهی نازل می‌شوند و شعاع‌های خود را بر قلب‌های عارفان، اهل شهود (al-Shuhūd) تام، می‌افکنند. پس قلب‌های آن‌ها محل فرود شعاع‌های این انوار است. و در این صنف انسانی، کسی در علم کامل‌تر از آن‌ها نیست، زیرا هیچ حجابی در برابر این انوار نمی‌ایستد مگر مشیت الهی به طور خاص. و اندکی از بندگان خدا هستند که این انوار شعاع‌های خود را بر قلب آن‌ها بر کشف (al-Kashf) می‌افکنند. و آن‌ها مجالی (محل ظهور) صادقان از بندگان خدای تعالی هستند.\n\n### [انوار انوار]\n\nو اما انوار انوار، همان سبحات (جلال) هستند که اگر حق (al-Ḥaqq) حجابی را که آن‌ها را از ما می‌پوشاند بردارد، ما خواهیم سوخت. آن‌ها اشعه ذاتی هستند که اگر گسترده شوند، اعیان ممکنات ظاهر می‌شوند. پس ممکنات، حجاب میان ما و آن‌ها هستند. و این همان نور عظیم است، نه اعظم. اشاره به آن در قول خدای تعالی در حق اهل کتاب‌های الهی نازل شده با اعمال مشروع است، آنجا که می‌فرماید: «وَلَوْ أَنَّهُمْ أَقامُوا التَّوْراةَ» (و اگر آن‌ها تورات را برپا می‌داشتند)، که همان موسویان هستند، «وَالْإِنْجِيلَ» (و انجیل را)، که همان عیسویان هستند، «وَما أُنْزِلَ إِلَيْهِمْ مِنْ رَبِّهِمْ» (و آنچه از پروردگارشان بر آن‌ها نازل شده است)، که همان اصحاب صحیفه‌ها و سایر کتب هستند، «لَأَكَلُوا مِنْ فَوْقِهِمْ» (هر آینه از بالای سر خود می‌خوردند)، که همان علوم خارج از کسب است، «وَمِنْ تَحْتِ أَرْجُلِهِمْ» (و از زیر پاهای خود)، که همان علومی است که تحت کسب درآمده است. پس این علوم از زیر و بالا هستند. و اگر نور با این صفت باشد، از زیر پای ما نخواهد بود، بلکه اوست که ما را تصرف می‌کند. اما نوری که از زیر پای ماست، نوری است که ما بر آن حکم می‌رانیم، و از آن به «الأکل من تحت الأرجل» (خوردن از زیر پاها) تعبیر شده است.\n\nو اما نوری که عین ذات ماست، همان است که پیامبر (صلی الله علیه و سلم) در آن دعا کرد: «و مرا نور قرار ده.» پس آن عین ذات اوست. و روایت «و برای من نوری قرار ده»، شامل تمام انواری است که ذکر کردیم. و اما قول او: «مرا نور قرار ده»، مشاهده نور ذات خود است، زیرا جز به واسطه آن شهود (al-Shuhūd) نمی‌کند. زیرا ذات او این انوار را از این شش جهت نپذیرفت، مگر به دلیل عدم درک نور نفس خود، که در مورد آن رسول خدا (صلی الله علیه و سلم) فرمود:\n\n«هر کس خود را شناخت، پروردگارش را شناخت.»\n\nو خداوند «نُورُ السَّماواتِ وَالْأَرْضِ» (نور آسمان‌ها و زمین) است و او را به آنچه مثل زده، مثل زده است، و تو عین آن مَثَل‌زده و مَثَل هستی. پس انوار را می‌بینی که از تو گشوده می‌شوند و عالم آسمان‌ها و زمین تو به واسطه ذات تو روشن می‌شود. پس نیازی به نور غریبه نداری که با آن روشن شوی. تو خود چراغ، فتیله، چراغدان و شیشه هستی. و اگر این را دانستی، روغن را که همان امداد الهی است، و درخت را شناختی. و اگر شیشه مانند ستاره درخشان باشد، که در اینجا خورشید است، پس گمانت به چراغی که عین ذات توست چیست؟ پس ای برادر، دعای تو هرگز نباید جز این باشد که خداوند تو را نور قرار دهد. و در اینجا رازی شگفت‌انگیز است که تو را بر آن آگاه می‌سازم بدون شرح، زیرا شرح را برنمی‌تابد. و آن این است که خداوند برای خود مَثَل می‌زند، اما برای او مَثَل زده نمی‌شود. او شبیه اشیاء است، اما اشیاء شبیه او نیستند. پس گفته می‌شود: مَثَل خدا در خلقش مانند مَثَل پادشاه در مُلک اوست، اما گفته نمی‌شود: مَثَل پادشاه در مُلک او مانند مَثَل خدا در خلقش است. زیرا او عین چیزی است که ظاهر شده، و آنچه ظاهر شده عین او نیست. زیرا او باطن است، همان‌گونه که در حال ظهور، ظاهر است. به همین دلیل گفتیم او مَثَل اشیاء است و اشیاء مَثَل او نیستند، زیرا او عین آن‌هاست و آن‌ها عین او نیستند. و این از علم غریبی است که از وطن خود دور افتاده و میان او و سکونتش حائل شده‌اند. پس عقول آن را انکار کردند، زیرا آن‌ها معقول هستند و رها نشده‌اند. و این نمونه‌ای از تجلی (al-Tajallī) انوار انوار است.\n\n### [انوار معانی مجرد از مواد]\n\nو اما انوار معانی مجرد از مواد، قابل بیان نیستند. زیرا اگر قابل بیان بودند، وارد مواد می‌شدند، چون عبارات از مواد هستند. و ما گفتیم که آن‌ها به ذات خود از مواد مجرد هستند، نه اینکه تجرد یافته باشند. زیرا اگر تجرد یافته بودند، هرگاه می‌خواستیم، آن‌ها را با مواد می‌پوشاندیم و امتناع نمی‌کردند، چون قبلاً در آن‌ها بوده‌اند. پس آن‌ها به طور خاص دانسته می‌شوند و گفته نمی‌شوند، حکایت نمی‌شوند و تشبیه و تمثیل را نمی‌پذیرند.\n\n### [انوار ارواح]\n\nو اما انوار ارواح، انوار روح القدس جامع هستند. پس کسی که از این ارواح فرستاده شود، فرشته است، و کسی که فرستاده نشود، اسم روح با اسم خاص خود بر او باقی می‌ماند. علم در هر دو گروه، فرستاده‌شدگان و غیر فرستاده‌شدگان، وجود دارد. پس او روحی خالص است که چیزی که او را از نفس خود خارج سازد، شبیه او نیست. و او روحی است که در روحانیت خود دارای روح است. و این‌ها جز ارواح هائمه (سرگردان در جلال الهی) و ارواح افراد (al-Afrād) از ما نیستند که تا حدی شبیه آن‌ها هستند. پس تجلی (al-Tajallī) در انوار ارواح جز برای افراد (al-Afrād) رخ نمی‌دهد. و به همین دلیل خضر به موسی گفت: «ما لَمْ تُحِطْ بِهِ خُبْراً» (آنچه را که به آن احاطه علمی نداری)، زیرا او از افراد بود. و برای انبیاء تجلی (al-Tajallī) در انوار ارواح فرشتگان رخ می‌دهد، اما این تجلی مخصوص افراد نیست، بلکه مخصوص انبیاء و رسولان است. و این همان قول خضر است: «تو بر علمی هستی که خدا به تو آموخته و من آن را نمی‌دانم»، زیرا او این تجلی (al-Tajallī) ملکی (فرشته‌ای) را ندارد. سپس او را آگاه ساخت که آنچه انجام داد، به امر او نبوده است، زیرا او صاحب امر نیست و از اهل امر نمی‌باشد. و این مقامی غریب در میان مقامات است. اگر خداوند تعالی به ما اجازه می‌داد که آن را برای خلق کشف کنیم، علمی ظاهر می‌شد که کون در برابر آن تاب نمی‌آورد. اثر این مقام، سه مسئله از شخصی است که خداوند نزد پیامبرش به عدالت او شهادت داد و او را تزکیه کرد و او تابع پیامبر شد و آنچه شنیدی را برای او بیان کرد و خود را تحت شرط او در زمره پیروانش درآورد. و او مانند موسی، کلیم الله و نجیّ اوست. و کلام او با پروردگارش کجا و کلام او با خضر کجا؟ پس تجلی (al-Tajallī) در کلام متفاوت بود. با این حال، موسی صبر نکرد، زیرا استثناء را مقدم داشت و هنگامی که خضر بر او انکار کرد، آن را مقدم نداشت. زیرا شأن پیامبر این است که هم پیرو باشد و هم مورد پیروی، به طور یکسان. و همچنین فرمود: «إِنْ أَتَّبِعُ إِلَّا ما يُوحى‏ إِلَيَّ» (من پیروی نمی‌کنم مگر از آنچه به من وحی می‌شود). نگفت: «انجام نمی‌دهم یا نمی‌گویم مگر آنچه شهود می‌کنم.» این‌گونه نگفت. پس هر مقامی را گفتار و زبانی است.\n\n### [انوار بادها (الریاح)]\n\nو اما انوار بادها (الریاح)، تجلیات (al-Tajallīyāt) اسم بعید هستند. و آن‌ها تجلیاتی هستند که شایسته نیست نامشان ذکر شود و جز برای اهل الهام رخ نمی‌دهند. و تجلی (al-Tajallī) در انوار فرشتگان در این مورد مدخلی دارد، اما به طور خاص در باطن، نه در ظاهر. و آن‌ها فرشتگان لَمّات (الهامات) و الهام به طور خاص هستند. و القاء در این تجلی (al-Tajallī) بر نفوس است. و خواطر (خطورات ذهنی) از این تجلی حاصل می‌شوند و همگی بادی (ریاحی) هستند، زیرا بادها می‌گذرند و ثابت نمی‌مانند. اگر کسی به ثبات آن‌ها قائل شود، دیگر باد نیستند. و به همین دلیل به مرور توصیف می‌شوند و خواطر نامیده می‌شوند، که از «راح یَرُوح» (رفت و آمد کرد) گرفته شده است، و رائح (رونده) کسی نیست که مقیم باشد.\n\nو اما تجلی (al-Tajallī) در انوار طبیعی، همان تجلی صوری مرکب است. پس از معارف به اندازه‌ای که از صورت‌ها در آن ظاهر شده است، عطا می‌کند. و این تجلی شامل همه چیز از فلک تا پست‌ترین حشرات است، و آن آسمان و عالم است. پس تجلی در آسمان و عالم است. و از این تجلی (al-Tajallī)، معانی و لغات و نماز و تسبیح هر صورتی شناخته می‌شود. و این کشفی (al-Kashf) بزرگ، نافع و مؤید است. در آن، مکاشف موافقت عالم را می‌بیند و اینکه هیچ مخالفتی در آن نیست. و از اینجا می‌بیند که هر چیزی «يُسَبِّحُ بِحَمْدِهِ» (به ستایش او تسبیح می‌گوید). و صاحب این مقام بر شهود (al-Shuhūd) می‌بیند که صورت اعمالش زنده و تسبیح‌گوی خداست و دارای روحی است که صاحب این مقام در آن می‌دمد، حتی اگر در ظاهر کون، مخالفت و معصیت باشد. زیرا آن مخالفت، مخالفت صحیحی است، اما زنده و گویاست و برای صاحبش استغفار می‌کند، زیرا او نشأت آن را به صورت مخلق (آفریده شده) تسویه کرده است. و خداوند خود را ستوده است که «خلق فسوی» (آفرید و تسویه کرد). و از تسویه نشأت آن به صورت مخلق این است که آن را از معصیت بودن خارج نکرده است. اگر آن را از معصیت بودن خارج می‌کرد، غیر مخلق بود و صاحبش شقی می‌شد، و تسبیح آن، لعنت صاحبش می‌شد. زیرا او آنچه را خدا حرام کرده بود، حلال شمرده بود، پس با این کار از ایمان خارج شده بود و بهره‌ای در اسلام نداشت، مگر اینکه اسلام خود را تجدید کند و توبه نماید. و این هشداری است که اصحاب آن پیوسته از روی غیرت و ضعف آن را کتمان می‌کردند، در حالی که آگاه ساختن بر آن اولی‌تر است، زیرا نصیحتی برای خدا، رسولش، پیشوایان مسلمانان و عموم آن‌هاست. پس هرگز معصیت مخلق (آفریده شده) یافت نمی‌شود مگر از مؤمن. و کسی که به شیء خلقش را عطا کند، بر سنت الهی جاری شده است، زیرا خداوند «أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ» (به هر چیزی خلقش را عطا کرد). پس به معصیت خلقش را عطا کرد و به طاعت خلقش را. صفت مؤمن این‌گونه است.\n\n### [انوار اسماء]\n\nو اما انوار اسماء، آن‌ها عین اسم‌های معلومات هستند. پس نوری است که بر معدومات و موجودات گسترده می‌شود و امتداد گسترش آن پایان نمی‌پذیرد. و عین (بصیرت) با گسترش آن حرکت می‌کند. پس نور عین صاحب این مقام گسترده می‌شود و آنچه نامتناهی است را می‌داند، همان‌گونه که آنچه نامتناهی است را به واسطه تضاعف اعداد جاهل نمی‌شود. و این نشانه کسی است که حق (al-Ḥaqq) بصر اوست. پس تمام اسماء موجود هستند، و مسمیات (نامیده‌شدگان) برخی از آن‌ها به ذات خود معدوم‌العین هستند، و برخی از آن‌ها عدمشان به ذات خود مقدم است، و آن‌ها همان‌هایی هستند که وجود را می‌پذیرند. و احوال، وجود را نمی‌پذیرند، با اینکه اسم بر همه این‌ها اطلاق می‌شود. پس احاطه از آن اسماء است، و احاطه از آن خداست، نه غیر او. پس این مرتبه اسماء الهی است. و آدم بر فرشتگان برتری نیافت مگر به واسطه احاطه‌اش به علم اسماء. زیرا اگر اسماء نبودند، خداوند چیزی را ذکر نمی‌کرد و چیزی خدا را ذکر نمی‌کرد. پس جز به واسطه آن‌ها ذکر نمی‌شود و جز به واسطه آن‌ها ذکر و ستایش نمی‌شود. پس هیچ صفتی در احاطه با صفت علم رقابت نکرد مگر قول، و تمام قول اسماء است. قول غیر از اسماء نیست. و اسماء، علامات و دلایلی بر معانی زیر خود هستند. پس کسی که نور اسماء بر او ظاهر شود، آنچه ذکرش ممکن نیست بر او ظاهر شده است. جز این نمی‌گویم. و اگر حق (al-Ḥaqq) لفظ «الکل» (همه) را در صفت علم آدم بر اسماء اطلاق نکرده بود، می‌گفتیم محال است که گسترش نور اسماء بر مسمیات برای عین (بصیرت) ظاهر شود. اما کسی که قول خدای تعالی را بفهمد: «ثُمَّ عَرَضَهُمْ عَلَى الْمَلائِكَةِ فَقالَ أَنْبِئُونِي بِأَسْماءِ هؤُلاءِ» (سپس آن‌ها را بر فرشتگان عرضه کرد و فرمود: مرا از نام‌های این‌ها خبر دهید)، می‌داند که ما چه ادبی را ملتزم شده‌ایم و خداوند از لفظ «کل» در این تشریف چه اراده کرده است.\n\n### [انوار مولدات، مادران، علل و اسباب]\n\nو اما انوار مولدات، مادران، علل و اسباب، تجلی (al-Tajallī) الهی است از جهت اینکه او مؤثر است، و از جهت اینکه او اجابت‌کننده است هنگامی که از او سؤال شود، و آمرزنده است هنگامی که استغفار شود، و عطا کننده است هنگامی که درخواست شود. و با این تجلی (al-Tajallī) و این انوار، قول او را می‌دانی: «إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ اللَّهَ» (همانا کسانی که با تو بیعت می‌کنند، جز این نیست که با خدا بیعت می‌کنند)، و نیز قول عز و جل: «مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ اللَّهَ» (هر کس از رسول اطاعت کند، قطعاً از خدا اطاعت کرده است)، و قول تبارک و تعالی: «إن الصدقة تقع بيد الرحمن» (همانا صدقه در دست رحمان قرار می‌گیرد)، و قول او: «وَأَقْرِضُوا اللَّهَ قَرْضاً حَسَناً» (و به خدا قرض نیکو دهید)، و قول پیامبر (علیه السلام): «إن الله يفرح بتوبة عبده» (همانا خداوند از توبه بنده‌اش شاد می‌شود)."
  },
  "page_count": 6
}