{
  "id": 347,
  "title": {
    "ar": "الباب السابع والأربعون وثلاثمائة في معرفة منزل العندية الإلهية والصف الأول عند الله تعالى",
    "en": "Chapter Three Hundred and Forty-Seven: Concerning the Gnosis of the Station of Divine Proximity (العندية الإلهية) and the First Rank before God Most High",
    "ur": "باب تین سو سینتالیس (۳۴۷) الٰہی قرب کی منزل (العندية الإلهية) اور اللہ تعالیٰ کے حضور صفِ اول (الصف الأول) کی معرفت کے بیان میں۔",
    "fa": "باب سیصد و چهل و هفتم در معرفت منزل «عِندِیَّت» الهی و صف اول نزد خداوند متعال"
  },
  "content": {
    "ar": "## (الباب السابع والأربعون وثلاثمائة في معرفة منزل العندية الإلهية والصف الأول عند الله تعالى)\n\n\n> كم بين من يعلم ما كان له *** وبين من زاد على علمه‏\n\n\n> هذا الذي في علمه يرتقي *** وذاك ما يبرح من حكمه‏\n\n\n> فالحال للأول من كيفه *** والعلم للآخر من كمه‏\n\n\n> كمه لا ينتهي حكمه *** فعلمه يربي على فهمه‏\n\n\n> لو لا وجود الحرف ما كان لي *** فهم وقد يدرك من وهمه‏\n\n\n> فالعلم والفهم لعيني معا *** وليس للحق سوى علمه‏\n\n\n### [إن الله جعل عنديته ظرفا لخزائن الأشياء]\n\n\nوقال تعالى وما عِنْدَ الله باقٍ وقال آتَيْناهُ رَحْمَةً من عِنْدِنا وعَلَّمْناهُ من لَدُنَّا عِلْماً وقال وعِنْدَهُ مَفاتِحُ الْغَيْبِ وقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم كما تصف الملائكة عند ربها\n\n\nوقال تعالى إِنَّ الله عِنْدَهُ عِلْمُ السَّاعَةِ وقال تعالى وإِنْ من شَيْ‏ءٍ إِلَّا عِنْدَنا خَزائِنُهُ فاختلفت إضافات هذه العندية باختلاف ما أضيفت إليه من اسم وضمير وكناية وهي ظرف ثالث وما رأيت من أهل الله من تنبه له حتى يعرف ما هو فإنه ليس بظرف زمان ولا ظرف مكان مخلص بل ما هو ظرف مكانة جملة واحدة على‏\nالإطلاق وكذلك هو في قوله تعالى ما عِنْدَكُمْ يَنْفَدُ فجعل لنا عندية وما هي ظرف مكان في حقنا فعجبت من العلماء كيف غفلوا عن تحقيق هذه العندية التي اتصف بها الحق والإنسان ثم إن الله جعل عنديته ظرفا لخزائن الأشياء ومعلوم أنه يخلق الأشياء ويخرجها من العدم إلى الوجود وهذه الإضافة تقضي بأنه يخرجها من الخزائن التي عنده فهو يخرجها من وجود لم تدركه إلى وجود ندركه فما خلصت الأشياء إلى العدم الصرف بل ظاهر الأمر إن عدمها من العدم الإضافي فإن الأشياء في حال عدمها مشهودة له يميزها بأعيانها مفصلة بعضها عن بعض ما عنده فيها إجمال فخزائنها أعني خزائن الأشياء التي هي أوعيتها المخزونة فيها إنما هي إمكانات الأشياء ليس غير ذلك لأن الأشياء لا وجود لها في أعيانها بل لها الثبوت والذي استفادته من الحق الوجود العيني فتفصلت للناظرين ولا نفسها بوجود أعيانها ولم تزل مفصلة عند الله تفصيلا ثبوتيا ثم لما ظهرت في أعيانها وأنزلها الحق من عنده أنزلها في خزائنها فإن الإمكان ما فارقها حكمه فلو لا ما هي في خزائنها ما حكمت عليها الخزائن فلما كان الإمكان لا يفارقها طرفة عين ولا يصح خروجها منه لم يزل المرجح معها لأنه لا بد أن تتصف بأحد الممكنين من وجود وعدم فما زالت هي والخزائن عند الله إذا المرجح لا يفارق ترجيح أحد الممكنين على هذه الأشياء فما لها خروج من خزائن إمكانها وإنما الحق سبحانه فتح أبواب هذه الخزائن حتى نظرنا إليها ونظرت إلينا ونحن فيها وخارجون عنها كما كان آدم خارجا عن قبضة الحق وهو فيه قبضة الحق يرى نفسه في الموطنين فمن رأى الأشياء ولم ير الخزائن ولا رأى الله الذي عنده هذه الخزائن فما رأى الأشياء قط فإن الأشياء لم تفارق خزائنها وخزائنها لم تفارق عندية الله والضمائر والعندية الإلهية لم تفارق ذاته فمن شهد واحدا من هذه الأمور فقد شهد المجموع‏\n\n\n> عندية الحق عين ذاته *** فيها لأشيائه خزائن‏\n\n\n> ينزل منها الذي يراه *** فهي لما يحتويه صائن‏\n\n\n> إنزاله لم يزله عنها *** لأنه أعين الكوائن‏\n\n\n> عندية ظرفها نزيه *** ما هي عندية الأماكن‏\n\n\n> ودهرها الله لا زمان *** والدهر ظرف لكل ساكن‏\n\n\n> يملكه بالسكون فيه *** مسكنه أشرف المساكن‏\n\n\n> ليس لها نقلة بلا هو *** فهي كملزومه تعاين‏\n\n\n> ما صفته من دقيق معنى *** وما أنا للغريم ضامن‏\n\n\nفما في الكون إن كنت عالما أحدية إلا أحدية المجموع لأنه لم يزل إلها ولا يزال إلها وما تجدد عليه حكم لم يكن عليه ولا حدث اسم لم يكن تسمى به فإنه المسمى نفهس ولا قام به نعت لم يكن قبل ذلك منعوتا به بل له الأمر من قبل ومن بعد فهو ذو الأسماء الحسنى والصفات العليا والإله الذي لم يزل في العماء والرحمن الذي وصف نفسه بالاستواء والرب الذي ينزل كل ليلة في الثلث الباقي من الليل إلى السماء وهو معنا أينما كنا وما يكون من نجوى عدد معين إلا وهو مشفع ذلك العدد أو موتره فهو رابع الثلاثة وسادس الخمسة وأكثر من ذلك وأدنى فهل رأيت أو هل جاءك من الحق في وحيه إلا أحدية المجموع لأنه ما جاء إِلَّا إِلهٌ واحِدٌ ولا إِلهَ إِلَّا هُوَ عالِمُ الْغَيْبِ والشَّهادَةِ هُوَ الرَّحْمنُ الرَّحِيمُ هُوَ الله الَّذِي لا إِلهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ... الْخالِقُ الْبارِئُ الْمُصَوِّرُ\n\n\n### [إن الأسماء الإلهية وإن ترادفت على مسمى واحد لكن تدل على معان مختلفة]\n\n\nوأنت تعلم أن كنت من أهل الفهم عن الله أن هذه الأسماء وإن ترادفت على مسمى واحد من حيث ذاته فإنا نعلم أنها تدل على معان مختلفة قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏ فما ندعو إلا إلها واحدا له هذه الأسماء المختلفة الحقائق والمدلولات ولم تزل له هذه الأسماء أزلا وهذه هي الخزائن الإلهية التي فيها خزائن الإمكانات المخزونة فيها الأشياء فقابل الجمع بالجمع والكثرة بالكثرة والعدد بالعدد مع أحدية العين فذلك أحدية الجمع وكل مصل يناجي ربه في خلوته معه وإن الله واضع كنفه عليه فهو المطلق المقيد العام في الخصوص الخاص في العموم‏\n\n\n### [أن الله جعل لنا موطنين في التصفيف‏]\n\n\nواعلم أن الله جعل لنا موطنين في التصفيف لم يجعل ذلك لغيرنا من المخلوقين صف في موطن الصلاة وصف في موطن الجهاد فقال إِنَّ الله يُحِبُّ الَّذِينَ يُقاتِلُونَ في سَبِيلِهِ صَفًّا كَأَنَّهُمْ بُنْيانٌ مَرْصُوصٌ‏\nوأمرنا بالتراص في الصف في الصلاة وذكر أن الملائكة يتراص في الصف عند ربها وجعل صفوفنا كصفوف الملائكة وليس ذلك لغيرنا من الأمم وجاءَ رَبُّكَ والْمَلَكُ صَفًّا صَفًّا يَوْمَ يَقُومُ الرُّوحُ وهو الإمام والْمَلائِكَةُ صَفًّا فالإمام صف وحده لأنه مجموع وأحديته أحدية المجموع ولذلك كان صفا وحده وتجلى الحق لأهل الصفوف في مجموع الأحدية لا في أحدية المجموع لأن كل شخص من أشخاص الصفوف يناجي من الحق ما يعطيه حضوره وما يناسب قصده وما هو عليه من العلم بربه ولهذا تجلى لهم في مجموع الأحدية فسبق لهم المجموع وأضافه إلى الأحدية حتى لا يشركوا مع الله أحدا في عبادتهم مع اختلاف مقاصدهم وعقائدهم وأحوالهم وأمزجتهم ومناسباتهم ولهذا تختلف سؤالاتهم وتكثر فلو تجلى لهم في أحدية المجموع لم يتمكن لهم النظر إلى المجموع مع وجود تقدم الأحدية ولو كان ذلك لكانت مقاصدهم مقصدا واحدا وسؤالهم سؤالا واحدا وحالاتهم في الحضور حالا واحدة وعلمهم بالله علم واحد والواقع ليس كذلك فدل على إن التجلي كان في مجموع الأحدية وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فرجع المجموع إلى الواحد وأضيف إليه لئلا يتخيلوا أن المجموع وجود أعيان وهو وجود أحكام وأن الله ما شرع الإمام في الصلاة إلا ليقابل به الأحدية التي أضاف المجموع إليها ويقابل بالجماعة مجموع الأحدية فالإمام يناجي الأحدية خاصة ولهذا اعتقد من اعتقد عصمة الإمام في الصلاة حتى يسلم وهم أصحاب الإمام المعصوم لأن الواحد لا يسهو عن أحديته إلا المعلم بالفعل فإنه يقوم به السهو ليعلم كيف يكون حكم الساهي من الجماعة وليس إلا الأنبياء خاصة وما عدا الرسل فهو متبع واحد من أهل الصف فإذا تقدم هو وليس برسول فهو معصوم لأنه ليس بمعلم هذا الذي جعل أصحاب الإمام المعصوم الذين هم الإمامية يقولون بعصمة الإمام والواقع خلاف ذلك فإنه ما من إمام إلا ويسهو في صلاته وإن لم يسه عن صلاته والجماعة تناجي مجموع الأحدية كل شخص مأموم يناجي ما يقابله من مجموع الأحدية فأي مصل صلى ولم يشاهد ما ذكرناه من إمام ومأموم فما صلى الصلاة المشروعة بالكمال وإن أتمها فما أكملها لأن تمام الصلاة إقامة نشأتها واستيفاء أركانها من فرائضها وسننها من قيام وتكبير وقراءة وركوع وخفض ورفع وهيأة وسلام إذا أتى بهذا كله فقد أتمها وإذا شاهد ما ذكرناه فقد أكملها لأن الغاية هي المرتبة وما وضعت الصلاة إلا لغايتها وهو المعبر عنه في العموم بالحضور في الصلاة أي استصحاب النية في أجزائها من أول الدخول فيها والتلبس بها إلى الخروج منها فانظر يا أخي هل صليت مثل هذه الصلاة إماما كنت أو مأموما وهل فرقت بينك وبين إمامك في الشهود أو ميزته عنك بالتقدم المكاني وبتقدم المكانة في الحكم فلا تكبر حتى يكبر ولا تركع حتى يركع ولا ترفع حتى يرفع ولا تفعل شيئا من أفعال الصلاة حتى يفعل فإن رتبتك الاتباع فالإمام متقدم على المأموم مكانا إن كان في جماعة ومكانة إن لم يكن معه إلا واحد فهو إمام بالمكانة يقابل الأحدية ويقابل مجموع الأحدية بانضمام الآخر إليه حتى كأنه الصف فالإمام إذا تقدم بالمكان والجماعة خلفه لم يشهد سوى الأحدية وإن كان في الصف مع المأموم لوحدانية المأموم شهد الإمام مجموع الأحدية وأحدية المجموع أو شهد المأموم مجموع الأحدية لا غير فميزته عنه المكانة لاتباعه إياه واقتدائه به فإن خالفه فإن ناصية المأموم بيد شيطان والشيطنة البعد والصلاة قرب فهذا قرب في عين بعد وبعد في عين قرب فلم يشهد هذا المأموم مجموع الأحدية لأنه ليس بمأموم لا مكانا ولا مكانة وإذا كان بهذه المثابة فإن الإمام في حال مخالفة المأموم له ما يشاهد إلا الأحدية لأنه ليس في صف لفقد المأموم لما زال عن مأموميته فالإمام في هذه الحال كالمصلي وحده بالنظر إلى حال هذا المأموم وهو إمام بالنظر إلى من يصلي خلفه من الملائكة والملائكة لا تصف إلا خلفه والملائكة تصف عند ربها وهي في هذه الحال عند الإمام المصلي بها وهي لم تزل عند ربها فالإمام خليفة فسجد له الملائكة والإمام يسجد لله فالله قبلة الإمام والإمام قبلة الملائكة وما أم جبريل عليه السلام بالنبي صَلَّى اللهُ عَليهِ وسَلَّم إلا ليعلمه الصلاة\n\n\nبالفعل فصلى به مكانة لا مكانا فإنه صلى به وحده ولم يتقدم عليه فعلمه عدد الصلوات في أوقاتها وهيأتها على أتم الوجوه ثم أمره إذا كان في جماعة أن يتقدمهم بالمكان ومن رأى أنه تقدم بالمكان جبريل أيضا فلم يكن ذلك إلا حتى كشف الله الغطاء عن بصر النبي صَلَّى اللهُ عَليهِ وسَلَّم فرأى الملائكة فرأى الجماعة فصف معهم خلف جبريل وأما على الستر فلا ولهذا\n\n\nصلى النبي صَلَّى اللهُ عَليهِ وسَلَّم بالرجل وحده وجعله على يمينه‏\nفي صف واحد\n\n\nلأن ذلك الشخص لم يشاهد الملائكة فراعى الإمام حكم المأموم وما كنت بجانب الطور إذ نادى الله موسى ولا بالجانب الغربي إذ قضى إِلى‏ مُوسَى الْأَمْرَ وما كُنْتَ من الشَّاهِدِينَ كذلك ما كنت مع رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إذ أم به جبريل في الصلوات الخمس وما كُنْتَ من الشَّاهِدِينَ وما شَهِدْنا إِلَّا بِما عَلِمْنا وما كُنَّا لِلْغَيْبِ حافِظِينَ وليس حكم من شاهد الأمور حكم من لم يشاهدها إلا بالأعلام فللعيان حال لا يمكن أن يعرفه إلا صاحب العيان كما إن للعلم حالا لا يعرفه إلا أولو العلم ليس لغيرهم فيه ذوق رَبِّ أَرِنِي كَيْفَ تُحْيِ الْمَوْتى‏ رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ‏\n\n\n> ولكن للعيان لطيف معنى *** لذا سأل المعاينة الكليم‏\n\n\nوما زال سجود الملائكة لبني آدم في كل صلاة كما سجدوا لأبيهم آدم فما زالت الخلافة في بنى آدم ما بقي فيهم مصل يقول الله الله فإن الأمر الإلهي والشأن إذا وقع في الدنيا لم يرتفع حكمه إلى يوم القيامة وقد وقع السجود لآدم من الملائكة فبقي سجودهم لذريته خلف كل من يصلي إلى يوم القيامة كما نسي آدم فنسيت ذريته كما جحد آدم فجحدت ذريته كما قتل قابيل هابيل ظلما فما زال القتل ظلما في بنى آدم إلى يوم القيامة وعلى الأول كفل من ذلك كما للأول في الخير نصيب من كل من فعله‏\n\n\nفمن سن سنة حسنة فله أجرها وأجر من عمل بها إلى يوم القيامة ومن سن سنة سيئة فعليه وزرها ووزر من عمل بها إلى يوم القيامة\n\n\nوهم الذين يحملون أَثْقالَهُمْ وأَثْقالًا مَعَ أَثْقالِهِمْ فكل مصل إمام للملائكة والملائكة خلفه تسجد له إلا إن الفرق بين الأصل والفرع أعني آدم وذريته إن الملائكة تسجد لسجود بنى آدم في القراءة والصلاة وآدم سجدوا له سجود المتعلم للمعلم فاجتمعا في السجود واختلفا في السبب وإنما المقصود الذي أردناه أن نبين أن السجود من الملائكة خلف بنى آدم ما ارتفع وأن الإمامة ما ارتفعت من آدم إلى آخر مصل والملائكة تبع لهذا الإمام كما قررناه فنحن عند الله في حال إمامتنا والملائكة في هذه الحال عندنا بالاقتداء فهي عند ربها لأن الإمام عنده فالملائكة عنده لأنها عند الإمام وكل صف إمام لمن خلفه بالغا ما بلغ وقولي‏\n\n\n> فعندية الرب معقولة *** وعندية الهو لا تعقل‏\n\n\n> وعندية الله مجهولة *** وعندية الخلق لا تجهل‏\n\n\n> وليس هما عند ظرفية *** وليس لها غيرها محمل‏\n\n\nالضمير في لها يعود على الظرفية وفي هما يعود على عندية الحق والخلق‏\n\n\n### [أن العندية نسبة ما هي أمر وجودي‏]\n\n\nواعلم أن العندية نسبة ما هي أمر وجودي لأن النسب أمور عدمية ثابتة الحكم معدومة العين وسيأتي الكلام إن شاء الله في أحوال الأقطاب فيمن كان هجيره ما عِنْدَكُمْ يَنْفَدُ وما عِنْدَ الله باقٍ من هذا الكتاب وإنما قلنا إن عندية الله مجهولة لأن الله بما هو الله لا يتعين فيه اسم من الأسماء الإلهية دون اسم فإنه عين مجموع الأسماء وما تخصصه إلا الأحوال فإنه من قال يا الله افعل لي كذا فحاله تخصص أي اسم أراد مما يتضمنه هذا الاسم الله من الأسماء فلهذا يقال فيه إنه مقيد في إطلاق أي تقيده الأحوال بما تطلبه من الأسماء المندرجة فيه ومطلق من حيث انتفاء الأحوال فهو الاسم القابل لكل اسم كما أن الهيولى الكل قابلة لكل صورة وعندية الرب قريبة من هذا إلا إن الفرق بينهما إن الرب ما أتى قط إلا مضافا فمن كان عنده فهو عند من أضيف إليه ولا يضاف إلا إلى كون من الأكوان وعندية الخلق معلومة فعندية الرب معقولة وأما عندية الهو فإن الهو ضمير غائب والغائب لا يحكم عليه ما كانت حالته الغيبة لأنه لا يدري على أي حالة هو حتى يشهد فإذا شهد فليس هو لأن الغيبة زالت عنه إلا ترى الساكت لا ينسب إليه أمر حتى يتكلم ولا مذهب ولهذا لا يدخل في الإجماع بسكوته وهذه مسألة خلاف والصحيح ما قلناه كما إن ترك النكير ليس بحجة إلا في بقاء ذلك الأمر على الأصل المنطوق به في قوله تعالى خَلَقَ لَكُمْ ما في الْأَرْضِ جَمِيعاً وكلام بنى آدم مما خلق في الأرض وجميع أفعالهم فإذا رأينا أمرا قد قيل أو فعل بمحضر رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ولم ينكره فلا نقول إن حكمه الإباحة فإنه لم يحكم فيه بشي‏ء إذ يحتمل أنه لم ينزل فيه شي‏ء عليه وهو لا يحكم إلا بما أوحى الله فيه إليه فيبقى ذلك على الأصل وهو التصرف الطبيعي الذي تطلبه هذه النشأة من غير تعيين حكم عليه بأحد الأحكام الخمسة وهو الأصل الأول أو نرده إلى الأصل الثاني وهو قوله تعالى خَلَقَ لَكُمْ ما في الْأَرْضِ جَمِيعا\nوليس بنص في الإباحة وإنما هو ظاهر لأن حكم المحظور خلق أي حكم به من أجلنا أي نزل حكمه من أجلنا ابتلاء من الله هل نمتنع منه أم لا كما نزل الوجوب والندب والكراهة والإباحة فالأصل إن لا حكم وهو الأصل الأول الذي يقتضيه النظر الصحيح ويتضمن هذا المنزل من العلوم علم حمد السواء وتفاصيله فإنه عم الطرفين والواسطة وأضافه إلى العالمين لم يخص عالما من عالم فقال في الطرف الواحد في أول فاتحة الكتاب الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ وجعل هذا التحميد بين الرحمة المركبة فإنه تقدمه الرَّحْمنِ الرَّحِيمِ وتأخر بعده الرَّحْمنِ الرَّحِيمِ فصار العالم بين رحمتين فأوله مرحوم ومآله إلى الرحمة وجاء في وسط سورة يونس في صفة أهل الجنة إن آخر دعائهم أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ وجاء في سورة والصافات والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ بعد قوله وسَلامٌ عَلَى الْمُرْسَلِينَ وهم المرحومون السالمون فحمد الله رب العالمين عقيب نصره وظفره بخيبر فهو حمد نعمة فظهر حمد النعمة في أول السورة وفي وسطها وفي آخرها فعم الطرفين والواسطة فهل هذا الحمد في هذه المراتب على السواء من كونه حمد سواء أو هو مختلف المراتب لاختلاف الطرفين والوسط وأي المراتب أعلى فيه هل أحد الطرفين أو الوسط ولمن هو الحمد الأول من العالمين والوسط والآخر كل ذلك علم يعطيه الله العلماء بالله الذين يَخْشَوْنَهُ ولا يَخْشَوْنَ أَحَداً إِلَّا الله وفيه علم المراتب الملكية والبشرية وهل مراتبها على السواء أو أي المراتب أعلى هل مراتب البشر أو مراتب الملائكة أو لكل صنف منهما مراتب تعلو على مراتب الآخر وفيه علم جلب المنافع وهل المضار في طيها منافع أم لا وتعيين المنافع وفيه علم الاتباع في الإلهيات هل يتبع التابع فيها الذكر أو الفكر وفيه علم توحيد الإضافة لا توحيد الإطلاق وهل التوحيد توحيدان أم لا أعني توحيد الذات وتوحيد الإله في الألوهة وبما ذا يدرك كل واحد من هذا التوحيد وفيه علم نسبة الله إلى الأشياء هل هي عين نسبة الأشياء إلى الله أو تختلف وفيه علم هل للشي‏ء الواحد وجوه متعددة أو ليس للشي‏ء الواحد سوى وجه واحد وما يصدر عنه إذا كان بهذه المثابة وفيه علم الفرق بين الرمي الإلهي والكوني وفيه علم الديمومة وفيه علم الاختلاس وما حكمه في المختلس بكسر اللام والمختلس بفتح اللام اسم فاعل واسم مفعول وإن الالتفات في الصلاة اختلاس يختلسه الشيطان من صلاة العبد وفيه علم ما للعالم من الخلق وفيه علم اجتماع خالقين على مخلوق واحد هل أعطى كل واحد منهما ما أعطى الآخر أم أحكامهما في خلقه مختلفة وفيما اختلفوا فيه من خلقه وفيما اجتمعوا وفيه علم الرفق بالجاهل في الحال وإمهاله ليرجع عن جهله وفيه علم النطق من الجاهل هل حكمه حكم نطق العالم في الإصابة وإن لم يعلم الجاهل المقام الذي منه نطق أم لا وأصابته التي يراها العالم خطأ فساوى العالم الجاهل في جهل المقام الذي منه نطق الجاهل والفرق بين من يدري ذلك ممن لا يدريه من العلماء وما حكم العالم الذي يعلم ذلك وفيه علم تأثير الواحد في الكثيرين من أين أثر مع أحديته وفيه علم الفصل والوصل وفيه علم جمع الصفة للمختلفين بأي حقيقة تجمعهم وفيه علم الهداية إلى الضلال وفيه علم المواقف والقول وهل للرضى مواقف كما للقهر أم لا وكم مواقف القيامة وهل تنحصر مواقف أهل الله كمواقف النفري أم لا تنحصر أو تنحصر من وجه ولا تنحصر من وجه ولما ذا كان الوقوف وهل هو وقوف سكون أم لا يزال منتقلا في وقوفه وفيه علم الفرق بين أهل الإسلام وأهل الاستسلام وفيه علم طلب العلم من الكون وفيه علم ما يعطيه الاعتراف بالحق في أي موطن كان وهل هو نافع صاحبه بكل وجه أم لا وما ينبغي أن يعترف به مما لا ينبغي أن يعترف به وفيه علم العلم النافع وفيه علم أدوات المعاني ما كان منها مركبا وغير مركب وفيه علم ما ينعم الإنسان وما يعذبه وأنه ليس شي‏ء من الله في أحد وفيه علم الخطوط والحدود الإلهية وأنها موسومة لا\n\n\nتختلط وهي أعلم بمحالها من محالها بها فإن محالها معلومة لها وليس هي معلومة المكان لمحالها وفيه علم النعم التي ترفع الآلام والفرق بينها وبين النعم التي لا ترفع ألما وفيه علم الأنس بالمثل وهل يقع الأنس بالله لمن خلق على الصورة أو من حقيقة كونه على الصورة أنه لا يأنس بالله كما لا يأنس الله به وهل للعالم بجملته هذا الحكم أم لا وهل الإنسان الذي هو كالظل للحق حكمه حكم الإنسان الكامل الخليفة الذي هو جزء من ذلك الإنسان المشبه بالظل أم لا وفيه علم الالتذاذ بالنغم الواقعة بالأغيار هل هو من كمال الالتذاذ المطلوب أو هل هو نقص في المستلذ له وفيه علم النفس في قوله استفت قلبك وإن أفتاك المفتون فإن هنا لطفا\nإلهيا في الإعلام أجراه الله على لسان رسوله صَلَّى اللهُ عَليهِ وسَلَّم أنباء أنه ما يلقي الله في القلب إلا ما هو حق فيه سعادة الإنسان فإن رجع في ذلك إلى نفسه فقد أفلح وهذا معنى قول بعض العارفين بهذا المقام حيث قال ما رأيت أسهل علي من الورع كلما حاك له شي‏ء في نفسي تركته وفيه علم تعظيم ما يعظم من الأحوال في القرائن وفيه علم ما ينبغي أن يثابر عليه وفيه علم المفاضلة في الأحوال من غير نظر إلى أصحابها القائمة بهم وفيه العلم بالماهيات وفيه علم تشابه الصورتين واختلاف الحكم وفيه علم حكمة إيجاد الأئمة في العالم المضلين منهم وغير المضلين وفيه علم النداء عند البلاء ولما ذا اختص به دون النعم وفيه علم إجابة الداعين والسائلين هل يزيد المجيب على مطابقة ما وقع فيه السؤال أو لا يزيد فإن زاد فهل هو إجابة سؤال حال فإن النطق لم يكن ثم وفيه علم ارتباط العالم العلوي بالسفلي ليفيد وارتباط السفلي بالعلوي ليستفيد والمفيد هو الأعلى أبدا والمستفيد هو السفلي أبدا ولا حكم للمساحة وعلو المكان وفيه علم تأثير المحجوب في المكشوف له من أي وجه أثر فيه مع علو مرتبته وأن الحق يعضده وما عقوبة ذلك المؤثر وفيه علم الأسفار وفيه علم من وصف بالحلم مع عدم القدرة والحليم لا يكون إلا قادرا على من يحلم عليه وفيه علم أثر الخيال في الحس وأين يبلغ حكمه وفيه علم حكم المراتب على أصحابها بما يكرهون وفيه علم قيمة الأشياء ولها حضرة خاصة وأنه ما من شي‏ء إلا وله قيمة إلا الإنسان الكامل فإن قيمته ربه وفيه علم ما ينتجه الصدق ومراتب الصادقين وإن يسألوا عن صدقهم وفيه علم حضرات البركات الإلهية وفيه علم مراتب الظلم وما يحمد منه وما يذم وفيه علم الاشتراك في الأمر هل حكم ذلك الأمر في كل واحد من الشركاء على السواء أم يختلف الحكم مع الاشتراك في الأمر لاختلاف أحوال الشركاء واستعداداتهم وفيه علم صورة حضرة اجتماع الخصوم بين يدي الحاكم وفيه علم إلحاق الإناث بالذكور وفيه علم القرعة وأين يحكم بها وقول النبي صَلَّى اللهُ عَليهِ وسَلَّم لو يعلم الناس ما في النداء والصف الأول ثم لم يجدوا إلا أن يستهموا عليه لاستهموا عليه ولو يعلمون ما في التهجير لاستبقوا إليه ولو يعلمون ما في العتمة والصبح لأتوهما ولو حبوا\n\n\nوفيه علم الظلمات ولما ذا ترجع حقيقة الظلمة هل لأمر وجودي أو عدمي وفيه علم فضل التنزيه على غيره من المحامد وفيه علم الشفقة على الجنين إذا خرج والرفق به ورحمته وقول النبي صَلَّى اللهُ عَليهِ وسَلَّم ليس منا من لم يرحم صغيرنا\n\n\nوفيه علم اليقين والشك وهل يتصف صاحب اليقين بالشك فيما هو على يقين فيه أم لا وفيه علم انفراد الحق بعلم الحق وفيه علم ما ينبغي أن ينسب إلى الله وفيه علم من في طبعه أمر ما لا يزول عن حكم طبعه وإن عرض له عارض يزيله فليس بدائم الزوال والطبع أغلب وفيه علم تغير الأحوال على الملائكة من أين حصل لهم ذلك وفيه علم العناية وطبقات العالم فيه وفيه علم الأناة والعجلة وفيه علم عموم البشارة وخصوص الإنذار إلى غير ذلك من العلوم التي يطول ذكرها فقصدنا إلى ذكر المهم منها والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 347: Concerning the Knowledge of the Station of Divine Nearness (العندية الإلهية) and the First Rank (الصف الأول) with Allah, the Exalted.\n\nHow great the difference between him who knows what was his lot,\nAnd him who adds to his knowledge.\nThis one ascends in his knowledge,\nWhile that one never departs from its ruling.\nThe state (*al-hal*) for the first is from its quality (*kayf*),\nAnd the knowledge (*al-'ilm*) for the second is from its quantity (*kamm*).\nHis quantity (*kamm*)—its ruling does not end,\nSo his knowledge surpasses his understanding.\nWere it not for the existence of the letter, I would have no understanding,\nYet it may be grasped from his illusion (*wahm*).\nKnowledge (*al-'ilm*) and understanding (*al-fahm*) are for my two eyes together,\nBut for the Real (*al-Haqq*), there is only His Knowledge.\n\n[Indeed, Allah has made His Nearness (عندية) a receptacle for the Treasuries of Things]\n\nThe Exalted said: <<وَمَا عِنْدَ اللهِ بَاقٍ>> (And what is with Allah [عِنْدَ الله] remains). And He said: <<آتَيْنَاهُ رَحْمَةً مِنْ عِنْدِنَا وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْمًا>> (We gave him mercy from Our Presence [عِنْدِنَا] and taught him knowledge from Our Own [لَدُنَّا]). And He said: <<وَعِنْدَهُ مَفَاتِحُ الْغَيْبِ>> (And with Him [عِنْدَهُ] are the keys of the Unseen). And the Messenger of Allah (peace and blessings be upon him) said: \"As the angels describe their ranks with their Lord.\"\n\nAnd the Exalted said: <<إِنَّ اللهَ عِنْدَهُ عِلْمُ السَّاعَةِ>> (Indeed, Allah—with Him [عِنْدَهُ] is the knowledge of the Hour). And the Exalted said: <<وَإِنْ مِنْ شَيْءٍ إِلَّا عِنْدَنَا خَزَائِنُهُ>> (And there is not a thing but that its treasuries are with Us [عِنْدَنَا]).\n\nThe attributions of this Nearness (*al-'Indiyya*) have varied according to the name, pronoun, or allusion to which it is attributed. It is a third kind of receptacle (*dharf*). I have not seen any of the People of Allah (*Ahl Allah*) who have paid attention to it so as to know what it is, for it is neither a receptacle of time (*dharf zaman*) nor a pure receptacle of place (*dharf makan*). Rather, it is not a receptacle of station (*dharf makana*) absolutely, all at once.\n\nSimilarly, in His saying, the Exalted: <<مَا عِنْدَكُمْ يَنْفَدُ>> (What is with you [عِنْدَكُمْ] vanishes), He established a Nearness for us, yet it is not a receptacle of place in our regard. I wonder how the scholars neglected the realization of this Nearness which characterizes both the Real and the human being.\n\nFurthermore, Allah made His Nearness a receptacle for the treasuries of things. It is known that He creates things and brings them forth from non-existence (*al-'adam*) into existence (*al-wujud*). This attribution necessitates that He brings them forth from the treasuries that are with Him. Thus, He brings them forth from an existence that we do not perceive into an existence that we do perceive.\n\nTherefore, things have not been purified into sheer non-existence (*al-'adam al-sarf*). Rather, the apparent matter is that their non-existence is relative non-existence (*al-'adam al-idhafi*). For things, in their state of non-existence, are witnessed by Him; He distinguishes them by their Immutable Essences (*a'yanihim*) detailed one from another. There is no generality concerning them with Him.\n\nTheir treasuries—meaning the treasuries of things, which are the vessels in which they are stored—are nothing other than the Possibilities (*Imkanat*) of things, and nothing else. This is because things do not have existence (*wujud*) in their essences (*a'yan*); rather, they have fixedness (*thubut*). What they acquired from the Real is actual existence (*al-wujud al-'ayni*), so they became detailed for the observers. They did not become detailed for themselves by the existence of their essences. They have always been detailed with Allah in a fixed, immutable detailing (*tafsilan thubutiyyan*).\n\nThen, when they appeared in their essences and the Real sent them down from His Presence, He sent them down into their treasuries. For the ruling of Possibility (*al-Imkan*) has not departed from them. Were they not in their treasuries, the treasuries would not rule over them. Since Possibility does not leave them for the blink of an eye, and their emergence from it is not valid, the Determiner (*al-Murajjih*) has never ceased to be with them, because they must be characterized by one of the two possibilities: existence or non-existence.\n\nThus, they and the treasuries have never ceased to be with Allah, since the Determiner never ceases to prefer one of the two possibilities for these things. They have no exit from the treasuries of their Possibility. Rather, the Real, the Glorified, opened the doors of these treasuries so that we looked upon them and they looked upon us, while we are within them and yet outside of them—just as Adam was outside the grasp of the Real while he was within it. The grasp of the Real sees itself in both locations.\n\nWhoever sees things but does not see the treasuries, nor sees Allah with Whom these treasuries reside, has not seen things at all. For things have not departed from their treasuries, and their treasuries have not departed from the Nearness of Allah, and the pronouns and the Divine Nearness have not departed from His Essence (*Dhat*). Thus, whoever witnesses one of these matters has witnessed the totality.\n\nThe Nearness of the Real is the very Essence (*'ayn Dhat*) of Him,\nIn it are treasuries for His things.\nHe sends down from them what He wills to see,\nSo it is a preserver of what it contains.\nHis sending down did not remove it from them,\nBecause they are the very essences of the existents (*al-kawa'in*).\nNearness is a pure receptacle (*dharf*),\nIt is not the Nearness of places (*al-amakin*).\nIts time is Allah, not temporal time (*zaman*),\nAnd time (*al-dahr*) is a receptacle for every dweller.\nHe possesses it by the stillness within it,\nIts dwelling place is the noblest of dwellings.\nIt has no movement without Him,\nSo it is witnessed like its necessary concomitant.\nWhat is its description of subtle meaning?\nI am not a guarantor for the claimant.\n\nIf you are knowledgeable, there is no Oneness (*Ahadīyya*) in the cosmos except the Oneness of the Synthesis (*Ahadīyyat al-Majmū'*), because He has never ceased to be God (*Ilah*) and will never cease to be God. No ruling has been renewed upon Him that was not upon Him, nor has a Name arisen by which He was not already named, for He is the One Who names Himself. Nor has an attribute arisen in Him by which He was not previously described. Rather, the command belongs to Him from before and after.\n\nHe is the Possessor of the Most Beautiful Names (*al-Asma' al-Husna*) and the Sublime Attributes (*al-Sifat al-'Ulya*), and the God Who has never ceased to be in the Cloud (*al-'Ama'*) and the All-Merciful (*al-Rahman*) Who described Himself with settling upon the Throne (*al-Istiwā'*), and the Lord Who descends every night in the last third of the night to the heaven, and He is with us wherever we are. There is no secret counsel of a specific number except that He is the one who makes that number even or odd. He is the fourth of three, the sixth of five, and more than that, and less. Have you seen, or has anything come to you from the Real in His revelation, except the Oneness of the Synthesis? For there came <<إِلَّا إِلَهٌ وَاحِدٌ>> (except one God), and <<لَا إِلَهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ هُوَ الرَّحْمَنُ الرَّحِيمُ>> (There is no god but He, Knower of the Unseen and the Seen. He is the All-Merciful, the Compassionate). <<هُوَ اللهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ... الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ>> (He is Allah, besides Whom there is no god, the Sovereign, the Holy, the Source of Peace, the Giver of Security, the Guardian, the Almighty, the Compeller, the Supremely Great... the Creator, the Maker, the Fashioner).\n\n[Indeed, the Divine Names, even if they refer to a single Named Entity, indicate different meanings]\n\nYou know, if you are among those who understand from Allah, that these Names, even though they refer to a single Named Entity in terms of His Essence (*Dhat*), we know that they indicate different meanings. <<قُلِ ادْعُوا اللهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَى>> (Say: \"Call upon Allah or call upon the All-Merciful. Whichever you call upon—to Him belong the Most Beautiful Names\"). We call upon nothing but one God, Who possesses these Names of varying realities and significations. These Names have belonged to Him eternally. These are the Divine Treasuries (*al-Khaza'in al-Ilahiyya*) which contain the treasuries of Possibilities (*al-Imkanat*) in which things are stored.\n\nTherefore, oppose the synthesis with the synthesis, the multiplicity (*al-kathra*) with the multiplicity, and the number with the number, along with the Oneness of the Essence (*Ahadīyyat al-'Ayn*). That is the Oneness of the Synthesis (*Ahadīyyat al-Jam'*). Every worshipper who prays secretly communes with his Lord in his solitude with Him, and Allah places His protection (*kanaf*) over him. Thus, He is the Absolute (*al-Mutlaq*) Who is restricted (*al-Muqayyad*), the General in the particular, and the Particular in the general.\n\n[That Allah has established two locations for us in the arrangement of ranks]\n\nKnow that Allah has established two locations for us in the arrangement of ranks (*al-tasfif*) that He did not establish for any other creatures: a rank in the location of prayer and a rank in the location of struggle (*Jihad*). He said: <<إِنَّ اللهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُمْ بُنْيَانٌ مَرْصُوصٌ>> (Indeed, Allah loves those who fight in His cause in a rank [صَفًّا] as though they were a solid structure).\n\nHe commanded us to stand shoulder-to-shoulder (*al-tarass*) in the rank during prayer, and He mentioned that the angels stand shoulder-to-shoulder in the rank with their Lord. He made our ranks like the ranks of the angels, and this is not granted to other nations.\n\n<<وَجَاءَ رَبُّكَ وَالْمَلَكُ صَفًّا صَفًّا>> (And your Lord comes, and the angels, rank upon rank). On the Day when the Spirit (*al-Ruh*) stands—and He is the Imam—<<وَالْمَلَائِكَةُ صَفًّا>> (and the angels in rank). The Imam is a rank by himself because he is a synthesis (*majmū'*) and his Oneness is the Oneness of the Synthesis (*Ahadīyyat al-Majmū'*). For this reason, he was a rank by himself.\n\nThe Real manifests Himself to the People of the Ranks in the Synthesis of Oneness (*Majmū' al-Ahadīyya*), not in the Oneness of the Synthesis (*Ahadīyyat al-Majmū'*). This is because every individual in the ranks secretly communes with the Real according to what his presence grants him, what suits his intention, and what knowledge he possesses of his Lord. For this reason, He manifests to them in the Synthesis of Oneness, so the Synthesis precedes for them, and He attributes it to the Oneness, so that they do not associate anyone with Allah in their worship, despite the variation in their intentions, beliefs, states, temperaments, and affinities.\n\nThis is why their requests differ and multiply. If He were to manifest to them in the Oneness of the Synthesis, they would not be able to perceive the Synthesis while the precedence of Oneness exists. If that were the case, their intentions would be a single intention, their request a single request, their states of presence a single state, and their knowledge of Allah a single knowledge. The reality is contrary to this. This indicates that the Theophany (*al-Tajalli*) occurred in the Synthesis of Oneness.\n\n<<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him all matters are returned). Thus, the Synthesis returned to the One and was attributed to Him, lest they imagine that the Synthesis is the existence of essences (*wujud a'yan*), whereas it is the existence of rulings (*wujud ahkam*).\n\nAllah only legislated the Imam in prayer to correspond to the Oneness (*al-Ahadīyya*) to which He attributed the Synthesis, and to correspond to the congregation (*al-Jama'a*) with the Synthesis of Oneness. The Imam secretly communes with the Oneness specifically. For this reason, those who believe in the infallibility (*'isma*) of the Imam in prayer—who are the followers of the infallible Imam—hold this belief, so that the prayer may be sound. This is because the One does not forget His Oneness, except the one who teaches by action (*al-mu'allim bi'l-fi'l*), for forgetfulness occurs in him so that he may teach how the ruling of the forgetful person from the congregation should be. This applies only to the Prophets specifically. Anyone other than the Messengers is a follower of one of the People of the Rank. If he leads, and he is not a Messenger, he is infallible because he is not a teacher. This is what caused the followers of the infallible Imam, who are the Imamiyya, to assert the infallibility of the Imam. The reality is contrary to this, for there is no Imam who does not forget in his prayer, even if he does not forget his prayer entirely.\n\nThe congregation secretly communes with the Synthesis of Oneness. Every follower (*ma'mum*) secretly communes with what corresponds to him from the Synthesis of Oneness. Any worshipper who prays and does not witness what we have mentioned concerning the Imam and the follower has not prayed the legislated prayer in perfection (*al-kamal*), even if he completed it (*atammaha*). He has not perfected it. This is because the completion of the prayer is the establishment of its form (*nash'atiha*) and the fulfillment of its pillars, including its obligations (*fara'id*) and its recommended acts (*sunan*), such as standing, saying the *takbir*, recitation, bowing, lowering, rising, posture, and the salutation. If he performs all of this, he has completed it. If he witnesses what we have mentioned, he has perfected it, because the goal (*al-ghaya*) is the rank (*al-martaba*).\n\nPrayer was only instituted for its goal, which is generally expressed as presence in the prayer (*al-hudur fi al-salat*), meaning maintaining the intention throughout its parts, from the beginning of entering into it and engaging in it until exiting from it. Look, O my brother, have you prayed such a prayer, whether as an Imam or a follower? Have you distinguished between yourself and your Imam in witnessing, or have you distinguished him from you by precedence in place (*al-taqaddum al-makani*) and precedence in station (*al-makana*) in the ruling? You do not say the *takbir* until he says the *takbir*, nor bow until he bows, nor rise until he rises, nor perform any of the actions of the prayer until he performs them. Your rank is that of following (*al-ittiba'*).\n\nThe Imam precedes the follower in place if they are in a congregation, and in station if there is only one person with him. He is an Imam by station, corresponding to Oneness, and corresponding to the Synthesis of Oneness by the joining of the other person to him, so that it is as if he is the Rank.\n\nIf the Imam precedes in place and the congregation is behind him, he witnesses nothing but Oneness (*al-Ahadīyya*). If he is in the rank with the follower, due to the singularity of the follower, the Imam witnesses the Synthesis of Oneness and the Oneness of the Synthesis, or the follower witnesses the Synthesis of Oneness and nothing else. The station distinguishes him from the Imam due to his following and emulation of him. If he opposes him, then the forelock of the follower is in the hand of a devil (*shaytan*), and devilry (*shaytana*) is distance, while prayer is nearness. This is nearness in the very essence of distance, and distance in the very essence of nearness. This follower has not witnessed the Synthesis of Oneness because he is not a follower, neither in place nor in station.\n\nWhen he is in this state, the Imam, while the follower opposes him, witnesses only the Oneness, because he is not in a rank due to the loss of the follower from his state of following. The Imam in this state is like one praying alone, considering the state of this follower, yet he is an Imam considering those angels who pray behind him. The angels only form ranks behind him. The angels form ranks with their Lord, and in this state, they are with the Imam who leads them, and they have never ceased to be with their Lord.\n\nThe Imam is a Caliph (*Khalifa*), so the angels prostrated to him, and the Imam prostrates to Allah. Allah is the *Qibla* (direction) of the Imam, and the Imam is the *Qibla* of the angels.\n\nGabriel (peace be upon him) only led the Prophet (peace and blessings be upon him) in prayer to teach him the prayer by action. So he prayed with him by station, not by place, for he prayed with him alone and did not precede him. He taught him the number of prayers at their times and their form in the most complete manner. Then, when he was in a congregation, he commanded him to precede them in place. As for the view that Gabriel also preceded him in place, that only occurred when Allah removed the veil from the sight of the Prophet (peace and blessings be upon him), so he saw the angels and saw the congregation, and he stood in rank with them behind Gabriel. But in the state of concealment, no.\n\nFor this reason, the Prophet (peace and blessings be upon him) prayed with a single man and placed him on his right in a single rank, because that person did not witness the angels, so the Imam observed the ruling of the follower.\n\n<<وَمَا كُنْتَ بِجَانِبِ الطُّورِ إِذْ نَادَى اللهُ مُوسَى>> (And you were not on the side of the Mount when Allah called Moses), nor on the western side when He decreed <<إِلَى مُوسَى الْأَمْرَ>> (the command to Moses), <<وَمَا كُنْتَ مِنَ الشَّاهِدِينَ>> (and you were not among the witnesses). Likewise, you were not with the Messenger of Allah (peace and blessings be upon him) when Gabriel led him in the five prayers, <<وَمَا كُنْتَ مِنَ الشَّاهِدِينَ>> (and you were not among the witnesses). <<وَمَا شَهِدْنَا إِلَّا بِمَا عَلِمْنَا وَمَا كُنَّا لِلْغَيْبِ حَافِظِينَ>> (And we did not witness except what we knew, and we were not guardians of the Unseen).\n\nThe ruling of one who witnesses things is not the same as the ruling of one who does not witness them, except through information. For direct witnessing (*al-'iyan*) has a state that only the possessor of witnessing can know, just as knowledge (*al-'ilm*) has a state that only the people of knowledge know; others have no taste of it. <<رَبِّ أَرِنِي كَيْفَ تُحْيِ الْمَوْتَى>> (My Lord, show me how You give life to the dead). <<رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ>> (My Lord, show me, that I may look upon You).\n\nBut for direct witnessing (*al-'iyan*) there is a subtle meaning,\nThus, the one spoken to (Moses, *al-Kalim*) asked for the witnessing.\n\nThe prostration of the angels to the children of Adam continues in every prayer, just as they prostrated to their father Adam. The Caliphate (*al-Khilafa*) remains among the children of Adam as long as there is a worshipper among them who says \"Allah, Allah.\" For when a Divine Command or Affair occurs in this world, its ruling is not lifted until the Day of Resurrection. The prostration to Adam by the angels occurred, so their prostration to his progeny behind every person who prays remains until the Day of Resurrection.\n\nJust as Adam forgot, his progeny forgot. Just as Adam denied, his progeny denied. Just as Cain unjustly killed Abel, unjust killing remains among the children of Adam until the Day of Resurrection. And the first bears a portion of that, just as the first in goodness has a share from everyone who performs it.\n\n\"Whoever establishes a good practice (*sunna hasana*) will have its reward and the reward of whoever acts upon it until the Day of Resurrection. And whoever establishes a bad practice (*sunna sayyi'a*) will bear its burden and the burden of whoever acts upon it until the Day of Resurrection.\"\n\nThey are those who carry <<أَثْقَالَهُمْ وَأَثْقَالًا مَعَ أَثْقَالِهِمْ>> (their burdens and other burdens along with their burdens).\n\nEvery worshipper is an Imam for the angels, and the angels behind him prostrate to him. The only difference between the origin and the branch—meaning Adam and his progeny—is that the angels prostrate to the prostration of the children of Adam in recitation and prayer, whereas they prostrated to Adam in the prostration of the student to the teacher. Thus, they agree in the prostration but differ in the reason.\n\nThe intended point we wished to clarify is that the prostration of the angels behind the children of Adam has not been lifted, and the Imamate has not been lifted from Adam until the last worshipper. The angels are followers of this Imam, as we have established.\n\nWe are with Allah in our state of Imamate, and the angels are with us in this state by following. Thus, they are with their Lord because the Imam is with Him, so the angels are with Him because they are with the Imam. Every rank is an Imam for the rank behind it, no matter how far it extends.\n\nThe Nearness of the Lord (*'Indiyyat al-Rabb*) is intelligible,\nBut the Nearness of the He (*'Indiyyat al-Huwa*) is unintelligible.\nThe Nearness of Allah (*'Indiyyat Allah*) is unknown,\nBut the Nearness of Creation (*'Indiyyat al-Khalq*) is not unknown.\nNeither of them is a Nearness of receptivity (*dharfiyya*),\nNor is there any other interpretation for it.\n\n[That Nearness (العندية) is merely a relation, not an existent matter]\n\nKnow that Nearness (*al-'Indiyya*) is merely a relation (*nisba*), not an existent matter (*amr wujudi*), because relations are non-existent matters (*umur 'adamiyya*) whose ruling is fixed but whose essence is non-existent. We will discuss, God willing, in the section on the states of the Poles (*al-Aqtab*) in this book, concerning those whose constant refrain is <<مَا عِنْدَكُمْ يَنْفَدُ وَمَا عِنْدَ اللهِ بَاقٍ>> (What is with you vanishes, and what is with Allah remains).\n\nWe said that the Nearness of Allah is unknown because Allah, *qua* Allah, is not specified by one Divine Name over another, for He is the very Essence of the Synthesis of Names (*'ayn majmu' al-Asma'*). Only states (*al-ahwal*) specify Him. If someone says, \"O Allah, do such-and-such for me,\" his state specifies whichever Name he intends from those contained within the Name Allah. Therefore, it is said that He is restricted in His absoluteness—meaning that the states restrict Him by what they seek from the Names included within it—and He is absolute in the absence of states. He is the Name that accepts every Name, just as the Universal Hyle (*al-Hayula al-Kull*) accepts every form.\n\nThe Nearness of the Lord (*'Indiyyat al-Rabb*) is close to this, except that the difference between them is that the Lord is never mentioned except as attributed (e.g., Lord of the Worlds). Thus, whoever is with Him is with the one to whom He is attributed, and He is only attributed to one of the existents (*al-akwan*).\n\nThe Nearness of Creation is known, so the Nearness of the Lord is intelligible. As for the Nearness of the He (*'Indiyyat al-Huwa*), *Huwa* is a pronoun for the absent (*gha'ib*). The absent cannot be ruled upon while his state is absence, because one does not know what state he is in until he is witnessed. If he is witnessed, then he is not *Huwa* (the absent), because the absence has left him. Do you not see that silence is not attributed to a person until he speaks, nor is a school of thought attributed to him? For this reason, silence does not constitute consensus (*ijma'*). This is a disputed issue, but the correct view is what we have stated, just as the abandonment of censure is not proof, except in the persistence of that matter upon the original explicit text, as in His saying, the Exalted: <<خَلَقَ لَكُمْ مَا فِي الْأَرْضِ جَمِيعًا>> (He created for you all that is on the earth). The speech of the children of Adam is among what is created on the earth, as are all their actions.\n\nIf we see an action that was said or done in the presence of the Messenger of Allah (peace and blessings be upon him) and he did not censure it, we do not say that its ruling is permissibility (*al-ibaha*), for he did not rule upon it with anything. It is possible that nothing concerning it was revealed to him, and he only rules by what Allah has revealed to him. Thus, that matter remains upon the origin, which is the natural disposition (*al-tasarruf al-tabi'i*) required by this existence, without specifying a ruling upon it from the five rulings. This is the First Origin (*al-Asl al-Awwal*). Alternatively, we refer it to the Second Origin, which is His saying, the Exalted: <<خَلَقَ لَكُمْ مَا فِي الْأَرْضِ جَمِيعًا>> (He created for you all that is on the earth). This is not an explicit text (*nass*) regarding permissibility, but it is apparent, because the ruling of prohibition (*al-mahzur*) is created—meaning it was ruled upon for our sake, i.e., its ruling was sent down for our sake, as a trial from Allah: will we abstain from it or not? Just as obligation (*al-wujub*), recommendation (*al-nadb*), dislike (*al-karaha*), and permissibility (*al-ibaha*) were sent down. The Origin is that there is no ruling, and this is the First Origin required by sound contemplation.\n\nThis station includes the knowledge of the Praise of Equality (*hamd al-sawa'*) and its details, for it encompasses the two extremes and the middle, and He attributed it to the worlds (*al-'alamin*), not specifying one world over another. He said in the first extreme, at the beginning of the opening chapter of the Book: <<الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ>> (All praise is due to Allah, Lord of the Worlds). He placed this praise between the compounded Mercy, for it was preceded by <<الرَّحْمَنِ الرَّحِيمِ>> (The All-Merciful, the Compassionate) and followed by <<الرَّحْمَنِ الرَّحِيمِ>> (The All-Merciful, the Compassionate). Thus, the world is between two Mercies: its beginning is subject to mercy, and its end is toward Mercy.\n\nIn the middle of Surah Yunus, concerning the description of the People of Paradise, it is stated that the end of their supplication is <<أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ>> (That all praise is due to Allah, Lord of the Worlds). And in Surah Al-Saffat, <<وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ>> (And all praise is due to Allah, Lord of the Worlds) comes after His saying <<وَسَلَامٌ عَلَى الْمُرْسَلِينَ>> (And peace be upon the Messengers), who are the recipients of mercy and safety. Allah praised the Lord of the Worlds following His victory and triumph at Khaybar, so it is the praise of grace (*hamd ni'ma*). The praise of grace appeared at the beginning of the Surah, in its middle, and at its end, encompassing the two extremes and the middle.\n\nIs this praise in these levels equal, being the Praise of Equality, or does it differ in levels due to the difference between the two extremes and the middle? Which of the levels is highest in it: one of the extremes or the middle? And to whom does the first, middle, and last praise belong among the worlds? All of this is knowledge that Allah grants to the scholars of Allah who <<يَخْشَوْنَهُ وَلَا يَخْشَوْنَ أَحَدًا إِلَّا اللهَ>> (fear Him and fear no one except Allah).\n\nIn it is the knowledge of the angelic and human levels (*al-maratib al-malakiyya wa al-bashariyya*). Are their levels equal, or which of the levels is higher: the levels of humans or the levels of angels, or does each category have levels that surpass the levels of the other?\n\nIn it is the knowledge of attracting benefits, and whether harms contain benefits or not, and the specification of benefits.\n\nIn it is the knowledge of following in Divine matters: does the follower follow the remembrance (*al-dhikr*) or the contemplation (*al-fikr*)?\n\nIn it is the knowledge of the Unification of Attribution (*tawhid al-idhafa*), not the Unification of Absoluteness (*tawhid al-itlaq*). Is Unification two kinds or not? Meaning, the Unification of the Essence (*tawhid al-Dhat*) and the Unification of the God (*al-Ilah*) in Divinity (*al-Uluha*). And by what means is each of these unifications perceived?\n\nIn it is the knowledge of the relation of Allah to things: is it the same as the relation of things to Allah, or does it differ?\n\nIn it is the knowledge of whether a single thing has multiple aspects, or if a single thing has only one aspect. And what issues from it if it is in this state?\n\nIn it is the knowledge of the difference between Divine and cosmic casting (*al-ramy al-ilahi wa al-kawni*).\n\nIn it is the knowledge of perpetuity (*al-daymuma*).\n\nIn it is the knowledge of snatching (*al-ikhtilas*) and its ruling concerning the snatcher (active participle) and the snatched (passive participle). And that turning aside in prayer is a snatching that the devil snatches from the servant's prayer.\n\nIn it is the knowledge of what the world has of creation.\n\nIn it is the knowledge of the convergence of two creators upon one created thing: did each of them grant what the other granted, or are their rulings in its creation different? And in what they differed in its creation, and in what they agreed.\n\nIn it is the knowledge of gentleness toward the ignorant person in the present moment and granting him respite so that he may return from his ignorance.\n\nIn it is the knowledge of the speech of the ignorant person: is its ruling the same as the speech of the knowledgeable person in correctness, even if the ignorant person does not know the station from which he spoke? Or is his correctness, which the knowledgeable person sees as error, equal to the knowledgeable person's ignorance of the station from which the ignorant person spoke? And the difference between the scholars who know this and those who do not, and the ruling of the scholar who knows this.\n\nIn it is the knowledge of the effect of the One upon the many: from where does He affect them, despite His Oneness?\n\nIn it is the knowledge of separation (*al-fasl*) and connection (*al-wasl*).\n\nIn it is the knowledge of synthesizing the attribute for disparate things: by what reality does He synthesize them?\n\nIn it is the knowledge of guidance toward misguidance.\n\nIn it is the knowledge of the stations (*al-mawaqif*) and the saying. Does contentment (*al-rida*) have stations, just as subjugation (*al-qahr*) does, or not? And how many are the stations of the Resurrection? Are the stations of the People of Allah limited, like the stations of Al-Niffari, or are they unlimited, or limited from one aspect and unlimited from another? And why is the standing (*al-wuquf*) necessary? Is it a standing of stillness, or does one remain in transition during his standing?\n\nIn it is the knowledge of the difference between the People of Islam and the People of Submission (*Ahl al-Istislam*).\n\nIn it is the knowledge of seeking knowledge from the cosmos (*al-kawn*).\n\nIn it is the knowledge of what acknowledging the Real grants, in whatever location it occurs. Is it beneficial to its possessor in every respect or not? And what should be acknowledged and what should not be acknowledged.\n\nIn it is the knowledge of beneficial knowledge (*al-'ilm al-nafi'*).\n\nIn it is the knowledge of the tools of meanings (*adawat al-ma'ani*), both compounded and uncompounded.\n\nIn it is the knowledge of what blesses the human being and what torments him, and that nothing from Allah is in anyone.\n\nIn it is the knowledge of the Divine lines and boundaries (*al-khutut wa al-hudud al-Ilahiyya*), and that they are marked and do not mix. They are more knowledgeable of their locations than their locations are of them, for their locations are known to them, but they are not known by place to their locations.\n\nIn it is the knowledge of the graces (*al-ni'am*) that remove pains, and the difference between them and the graces that do not remove pain.\n\nIn it is the knowledge of intimacy with the like (*al-uns bi'l-mithl*). Does intimacy with Allah occur for the one created upon the Form (*al-sura*), or does the reality of his being upon the Form mean that he does not feel intimate with Allah, just as Allah does not feel intimate with him? Does the world in its entirety have this ruling or not? And does the human being who is like the shadow of the Real have the same ruling as the Perfect Human (*al-Insan al-Kamil*), the Caliph, who is a part of that human being likened to the shadow, or not?\n\nIn it is the knowledge of deriving pleasure from melodies that occur through others (*al-aghyar*): is this part of the perfection of the desired pleasure, or is it a deficiency in the one who derives pleasure from it?\n\nIn it is the knowledge of the soul (*al-nafs*) in the saying: \"Consult your heart, even if the jurists give you a ruling.\" For here there is a Divine subtlety in the information that Allah conveyed through the tongue of His Messenger (peace and blessings be upon him), informing that Allah only casts into the heart what is true and contains the happiness of the human being. If he refers back to his soul in this, he has succeeded. This is the meaning of the saying of some Gnostics (*al-'Arifin*) concerning this station: \"I have not seen anything easier for me than scrupulousness (*al-wara'*). Whenever something troubled my soul, I abandoned it.\"\n\nIn it is the knowledge of magnifying what is magnified of the states in the conjunctions (*al-qara'in*).\n\nIn it is the knowledge of what should be persevered in.\n\nIn it is the knowledge of preference in states, without regard to the individuals in whom they subsist.\n\nIn it is the knowledge of the quiddities (*al-mahiyyat*).\n\nIn it is the knowledge of the similarity of two forms and the difference in the ruling.\n\nIn it is the knowledge of the wisdom of creating Imams in the world, both the misleading ones and the non-misleading ones.\n\nIn it is the knowledge of calling out during affliction (*al-bala'*), and why it is specific to affliction rather than grace.\n\nIn it is the knowledge of answering those who call and those who ask: does the answerer add to the correspondence of what was asked, or does he not add? If he adds, is it an answer to a question of state, even if the speech was not present?\n\nIn it is the knowledge of the connection of the upper world to the lower world so that it may benefit, and the connection of the lower world to the upper world so that it may receive benefit. The benefactor is always the higher, and the recipient of benefit is always the lower, and the ruling of space and height of place is irrelevant.\n\nIn it is the knowledge of the effect of the veiled (*al-mahjub*) upon the one to whom it is unveiled: from what aspect did it affect him, despite the highness of his rank, and that the Real supports him? And what is the punishment for that effector?\n\nIn it is the knowledge of the spiritual journeys (*al-asfar*).\n\nIn it is the knowledge of one who is described by forbearance (*al-hilm*) without power, whereas the forbearing one must be capable over the one toward whom he shows forbearance.\n\nIn it is the knowledge of the effect of Imagination (*al-Khayal*) upon the senses, and where its ruling reaches.\n\nIn it is the knowledge of the ruling of the levels upon their possessors with what they dislike.\n\nIn it is the knowledge of the value of things, and that they have a specific Presence (*hadra*), and that there is nothing that does not have a value except the Perfect Human (*al-Insan al-Kamil*), for his value is his Lord.\n\nIn it is the knowledge of what truthfulness (*al-sidq*) produces and the levels of the truthful ones, and that they will be questioned about their truthfulness.\n\nIn it is the knowledge of the Presences of Divine Blessings (*hadarat al-Barakat al-Ilahiyya*).\n\nIn it is the knowledge of the levels of injustice (*al-zulm*), what is praised of it and what is blamed.\n\nIn it is the knowledge of partnership in a matter: is the ruling of that matter equal for every partner, or does the ruling differ despite the partnership in the matter, due to the difference in the states and preparedness of the partners?\n\nIn it is the knowledge of the form of the Presence of the gathering of adversaries before the Judge.\n\nIn it is the knowledge of joining females to males.\n\nIn it is the knowledge of drawing lots (*al-qur'a*) and where it is ruled upon. And the saying of the Prophet (peace and blessings be upon him): \"If people knew what is in the call to prayer and the First Rank, and found no way to attain it except by drawing lots, they would draw lots for it. And if they knew what is in the early afternoon prayer (*al-tahjir*), they would race to it. And if they knew what is in the evening and morning prayers (*al-'atama wa al-subh*), they would come to them even if crawling.\"\n\nIn it is the knowledge of darkness (*al-zulumat*), and why the reality of darkness returns: is it due to an existent matter or a non-existent matter?\n\nIn it is the knowledge of the superiority of Transcendence (*al-tanzih*) over other forms of praise.\n\nIn it is the knowledge of compassion for the fetus when it emerges, and gentleness and mercy toward it. And the saying of the Prophet (peace and blessings be upon him): \"He is not one of us who does not show mercy to our young.\"\n\nIn it is the knowledge of certainty (*al-yaqin*) and doubt (*al-shakk*): does the possessor of certainty become characterized by doubt concerning what he is certain of, or not?\n\nIn it is the knowledge of the Real's singularity in the knowledge of the Real.\n\nIn it is the knowledge of what should be attributed to Allah.\n\nIn it is the knowledge of one who has a certain disposition that does not depart from the ruling of his nature, even if an accidental factor removes it, for the removal is not permanent, and the nature is dominant.\n\nIn it is the knowledge of the change of states upon the angels: from where did that occur to them?\n\nIn it is the knowledge of Divine Concern (*al-'Inaya*) and the classes of the world within it.\n\nIn it is the knowledge of deliberation (*al-ana'a*) and haste (*al-ajala*).\n\nIn it is the knowledge of the generality of good tidings (*al-bishara*) and the specificity of warning (*al-indhar*).\n\nAnd other sciences whose mention would be lengthy. We intended to mention the important ones among them. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تین سو سینتالیس: معرفتِ منزلِ عندیہ الٰہیہ (العندية الإلهية) اور اللہ تعالیٰ کے ہاں صفِ اول کے بیان میں۔\n\nکتنا فرق ہے اس شخص میں جو جانتا ہے کہ اس کے لیے کیا تھا،\nاور اس شخص میں جو اپنے علم سے بڑھ گیا۔\n\nیہ وہ ہے جو اپنے علم میں ترقی کرتا ہے،\nاور وہ (دوسرا) اپنے حکم سے کبھی نہیں ہٹتا۔\n\nپس پہلے شخص کا حال اس کی کیفیت (کیف) سے ہے،\nاور دوسرے کا علم اس کی کمیت (کم) سے ہے۔\n\nاس کی کمیت (کم) کا حکم ختم نہیں ہوتا،\nپس اس کا علم اس کی فہم سے بڑھ جاتا ہے۔\n\nاگر حرف کا وجود نہ ہوتا تو مجھے فہم حاصل نہ ہوتا،\nاور کبھی وہم سے بھی ادراک ہو جاتا ہے۔\n\nپس علم اور فہم میری آنکھ کے لیے ایک ساتھ ہیں،\nاور ذات حق (الحق) کے لیے اس کے علم کے سوا کچھ نہیں۔\n\n### [بے شک اللہ نے اپنی عندیت (عندية) کو اشیاء کے خزانوں کے لیے ظرف (ظرف) بنا دیا ہے]\n\nاور اللہ تعالیٰ نے فرمایا: \"اور جو کچھ اللہ کے پاس ہے وہ باقی رہنے والا ہے\" (وَمَا عِنْدَ اللَّهِ بَاقٍ)۔ اور فرمایا: \"ہم نے اسے اپنی طرف سے رحمت عطا کی اور اسے اپنے پاس سے علم سکھایا\" (آتَيْنَاهُ رَحْمَةً مِنْ عِنْدِنَا وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْمًا)۔ اور فرمایا: \"اور اسی کے پاس غیب کی کنجیاں ہیں\" (وَعِنْدَهُ مَفَاتِحُ الْغَيْبِ)۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"جیسا کہ فرشتے اپنے رب کے پاس اپنی صف بندی بیان کرتے ہیں\" (كَمَا تَصِفُ الْمَلَائِكَةُ عِنْدَ رَبِّهَا)۔\n\nاور اللہ تعالیٰ نے فرمایا: \"بے شک اللہ ہی کے پاس قیامت کا علم ہے\" (إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ)۔ اور اللہ تعالیٰ نے فرمایا: \"اور کوئی چیز ایسی نہیں جس کے خزانے ہمارے پاس نہ ہوں\" (وَإِنْ مِنْ شَيْءٍ إِلَّا عِنْدَنَا خَزَائِنُهُ)۔\n\nپس اس عندیت (عندية) کی اضافتیں، اس اسم، ضمیر، اور کنایہ کے اختلاف سے مختلف ہو گئیں جس کی طرف یہ مضاف کی گئی ہے۔ اور یہ تیسرا ظرف (ظرف) ہے۔ میں نے اہل اللہ میں سے کسی کو نہیں دیکھا جس نے اس کی طرف توجہ کی ہو تاکہ وہ جان سکے کہ یہ کیا ہے، کیونکہ یہ نہ تو خالص ظرفِ زمان ہے اور نہ ہی ظرفِ مکان، بلکہ یہ مطلقاً ایک ہی جملے میں ظرفِ مکانت ہے۔\n\nاور اسی طرح یہ اللہ تعالیٰ کے اس قول میں ہے: \"جو کچھ تمہارے پاس ہے وہ ختم ہو جائے گا\" (مَا عِنْدَكُمْ يَنْفَدُ)۔ پس اس نے ہمارے لیے بھی ایک عندیت (عندية) مقرر کی، اور یہ ہمارے حق میں ظرفِ مکان نہیں ہے۔ پس مجھے علماء پر تعجب ہوا کہ وہ اس عندیت (عندية) کی تحقیق سے کیسے غافل رہے جس کے ساتھ ذات حق (الحق) اور انسان متصف ہیں۔\n\nپھر اللہ نے اپنی عندیت (عندية) کو اشیاء کے خزانوں کے لیے ظرف (ظرف) بنا دیا۔ اور یہ معلوم ہے کہ وہ اشیاء کو عدم سے ہستی (الوجود) کی طرف نکال کر پیدا کرتا ہے۔ اور یہ اضافت اس بات کا تقاضا کرتی ہے کہ وہ انہیں ان خزانوں سے نکالتا ہے جو اس کے پاس ہیں۔ پس وہ انہیں ایک ایسے وجود سے نکالتا ہے جسے ہم نہیں جانتے، ایک ایسے وجود کی طرف جسے ہم جانتے ہیں۔ پس اشیاء خالص عدم (العدم الصرف) تک نہیں پہنچیں، بلکہ ظاہر امر یہ ہے کہ ان کا عدم، عدمِ اضافی ہے۔ کیونکہ اشیاء اپنے عدم کی حالت میں بھی اس کے لیے مشہود ہیں، وہ انہیں ان کی اعیان (ذوات) کے ساتھ ایک دوسرے سے مفصل طور پر ممتاز کرتا ہے، اس کے پاس ان میں کوئی اجمال نہیں۔\n\nپس ان کے خزانے، یعنی اشیاء کے وہ خزانے جو ان کے مخزون اوعیہ ہیں، وہ صرف اشیاء کے امکانات (إمكانات) ہیں، اس کے علاوہ کچھ نہیں۔ کیونکہ اشیاء کا اپنی اعیان میں کوئی وجود (وجود) نہیں ہے، بلکہ ان کے لیے ثبوت (ثبوت) ہے۔ اور جو کچھ انہوں نے ذات حق (الحق) سے حاصل کیا وہ وجودِ عینی ہے، پس وہ دیکھنے والوں کے لیے مفصل ہو گئیں، اور ان کی اعیان کے وجود کے لیے نہیں۔ اور وہ ہمیشہ سے اللہ کے پاس ثبوتی تفصیل کے ساتھ مفصل رہی ہیں۔\n\nپھر جب وہ اپنی اعیان میں ظاہر ہوئیں اور ذات حق (الحق) نے انہیں اپنے پاس سے نازل کیا، تو انہیں ان کے خزانوں میں نازل کیا، کیونکہ امکان (الإمكان) کا حکم ان سے جدا نہیں ہوا۔ اگر وہ اپنے خزانوں میں نہ ہوتیں تو خزانے ان پر حکم نہ لگاتے۔ چونکہ امکان (الإمكان) ایک پلک جھپکنے کے لیے بھی ان سے جدا نہیں ہوتا اور نہ ہی ان کا اس سے نکلنا صحیح ہے، اس لیے مرجح (ترجیح دینے والا) ہمیشہ ان کے ساتھ رہا، کیونکہ ممکنات میں سے کسی ایک (وجود یا عدم) کے ساتھ متصف ہونا ضروری ہے۔\n\nپس وہ اور خزانے ہمیشہ اللہ کے پاس رہے، جب کہ مرجح (ترجیح دینے والا) ان اشیاء پر دونوں ممکنات میں سے کسی ایک کو ترجیح دینے سے جدا نہیں ہوتا۔ پس ان کے لیے اپنے امکان (إمكان) کے خزانوں سے نکلنا ممکن نہیں۔ اور ذات حق (الحق) سبحانہ نے ان خزانوں کے دروازے کھول دیے تاکہ ہم انہیں دیکھیں اور وہ ہمیں دیکھیں، اور ہم ان میں بھی ہیں اور ان سے خارج بھی، جیسا کہ آدم (علیہ السلام) ذات حق (الحق) کی مٹھی سے خارج تھے اور وہ اس میں تھے، وہ خود کو دونوں مقامات پر دیکھتے تھے۔\n\nپس جس نے اشیاء کو دیکھا اور خزانوں کو نہیں دیکھا، اور نہ ہی اس اللہ کو دیکھا جس کے پاس یہ خزانے ہیں، تو اس نے اشیاء کو بالکل نہیں دیکھا۔ کیونکہ اشیاء اپنے خزانوں سے جدا نہیں ہوئیں، اور ان کے خزانے اللہ کی عندیت (عندية) سے جدا نہیں ہوئے، اور ضمائر اور عندیتِ الٰہیہ (العندية الإلهية) اس کی ذات سے جدا نہیں ہوئیں۔ پس جس نے ان امور میں سے کسی ایک کا شہود (الشهود) کیا، اس نے مجموع کا شہود کیا۔\n\nذات حق (الحق) کی عندیت (عندية) اس کی ذات کا عین ہے،\nاس میں اس کی اشیاء کے لیے خزانے ہیں۔\n\nوہ اس میں سے نازل کرتا ہے جسے وہ دیکھتا ہے،\nپس وہ اس چیز کی حفاظت کرنے والی ہے جسے وہ اپنے اندر رکھتی ہے۔\n\nاس کا نازل کرنا اسے اس سے زائل نہیں کرتا،\nکیونکہ وہ کائنات کی اعیان (ذوات) ہے۔\n\nعندیت (عندية) کا ظرف (ظرف) پاکیزہ ہے،\nیہ مقامات کی عندیت نہیں۔\n\nاور اس کا دہر (زمانہ) اللہ ہے نہ کہ وقت (زمان)،\nاور دہر ہر ساکن کے لیے ظرف (ظرف) ہے۔\n\nوہ اس میں سکون کے ذریعے اس کا مالک بنتا ہے،\nاس کا مسکن اشرف ترین مسکن ہے۔\n\nاس کے لیے اس کے بغیر کوئی نقل و حرکت نہیں،\nپس وہ اپنے ملزوم کی طرح مشاہدہ کرتی ہے۔\n\nاس کی صفت دقیق معنی سے کیا ہے؟\nاور میں قرض خواہ کا ضامن نہیں۔\n\nپس اگر تم عالم ہو تو کائنات میں احدیت (أحدية) کے سوا کچھ نہیں، مگر مجموع کی احدیت (أحدية المجموع)۔ کیونکہ وہ ہمیشہ سے الٰہ ہے اور ہمیشہ الٰہ رہے گا۔ اس پر کوئی ایسا حکم نیا نہیں ہوا جو پہلے نہ تھا، اور نہ ہی کوئی ایسا نام حادث ہوا جس سے وہ پہلے موسوم نہ تھا۔ کیونکہ وہ خود کو نام دینے والا ہے، اور نہ ہی اس کے ساتھ کوئی ایسی صفت قائم ہوئی جس سے وہ پہلے متصف نہ تھا۔ بلکہ امر اسی کا ہے پہلے بھی اور بعد میں بھی۔ پس وہ اسماء حسنیٰ اور صفات علیا کا مالک ہے۔ اور وہ الٰہ ہے جو ہمیشہ عماء (غیب) میں تھا، اور وہ رحمن ہے جس نے خود کو استواء (استواء) سے متصف کیا، اور وہ رب ہے جو ہر رات کے آخری تہائی حصے میں آسمان دنیا پر نازل ہوتا ہے، اور وہ ہمارے ساتھ ہے جہاں کہیں بھی ہم ہوں۔ اور کسی معین تعداد کی کوئی سرگوشی نہیں ہوتی مگر وہ اس تعداد کو جفت یا طاق کرنے والا ہوتا ہے۔ پس وہ تین کا چوتھا، پانچ کا چھٹا، اور اس سے زیادہ اور کم بھی ہے۔\n\nپس کیا تم نے دیکھا یا کیا تمہارے پاس ذات حق (الحق) کی طرف سے اس کی وحی میں مجموع کی احدیت (أحدية المجموع) کے سوا کچھ آیا؟ کیونکہ نہیں آیا مگر \"ایک ہی معبود\" (إِلَّا إِلَهٌ وَاحِدٌ)۔ اور \"اس کے سوا کوئی معبود نہیں، وہ غیب اور شہادت کا جاننے والا ہے، وہ رحمن و رحیم ہے\" (لَا إِلَهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ هُوَ الرَّحْمَنُ الرَّحِيمُ)۔ \"وہ اللہ ہے جس کے سوا کوئی معبود نہیں، بادشاہ، نہایت پاک، سلامتی والا، امن دینے والا، نگہبان، غالب، زبردست، بڑائی والا\" (هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ)... \"پیدا کرنے والا، وجود بخشنے والا، صورت بنانے والا\" (الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ)۔\n\n### [بے شک اسماء الٰہیہ اگرچہ ایک ہی مسمیٰ پر مترادف ہیں، لیکن مختلف معانی پر دلالت کرتے ہیں]\n\nاور اگر تم اللہ کی طرف سے فہم رکھنے والوں میں سے ہو تو تم جانتے ہو کہ یہ اسماء اگرچہ اپنی ذات کے لحاظ سے ایک ہی مسمیٰ پر مترادف ہیں، لیکن ہم جانتے ہیں کہ وہ مختلف معانی پر دلالت کرتے ہیں۔ \"کہو: اللہ کو پکارو یا رحمن کو پکارو، تم جس نام سے بھی پکارو، اسی کے لیے سب اچھے نام ہیں\" (قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَىٰ)۔ پس ہم ایک ہی الٰہ کو پکارتے ہیں جس کے لیے یہ مختلف حقائق اور مدلولات والے اسماء ہیں۔ اور یہ اسماء ازل سے اسی کے لیے ہیں۔ اور یہی وہ الٰہی خزانے ہیں جن میں امکانات (إمكانات) کے خزانے ہیں جن میں اشیاء مخزون ہیں۔ پس جمع کا مقابلہ جمع سے، کثرت کا کثرت سے، اور عدد کا عدد سے کرو، عین کی احدیت (أحدية العين) کے ساتھ۔ پس یہی جمع کی احدیت (أحدية الجمع) ہے۔ اور ہر نمازی اپنی خلوت میں اپنے رب سے مناجات کرتا ہے، اور اللہ اس پر اپنا پردہ ڈالے ہوئے ہے۔ پس وہ مطلق بھی ہے اور مقید بھی، عموم میں عام اور خصوص میں خاص۔\n\n### [بے شک اللہ نے ہمارے لیے صف بندی (تصفیف) میں دو مقامات مقرر کیے ہیں]\n\nاور جان لو کہ اللہ نے ہمارے لیے صف بندی (تصفیف) میں دو مقامات مقرر کیے ہیں جو اس نے دیگر مخلوقات کے لیے مقرر نہیں کیے۔ ایک صف نماز کے مقام میں اور ایک صف جہاد کے مقام میں۔ پس فرمایا: \"بے شک اللہ ان لوگوں سے محبت کرتا ہے جو اس کی راہ میں صف باندھ کر لڑتے ہیں گویا کہ وہ سیسہ پلائی ہوئی دیوار ہیں\" (إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُمْ بُنْيَانٌ مَرْصُوصٌ)۔\n\nاور ہمیں نماز میں صف میں مل کر کھڑے ہونے کا حکم دیا، اور ذکر کیا کہ فرشتے اپنے رب کے پاس صف میں مل کر کھڑے ہوتے ہیں۔ اور اس نے ہماری صفوں کو فرشتوں کی صفوں جیسا بنایا، اور یہ دوسری امتوں کے لیے نہیں۔ اور \"تمہارا رب آئے گا اور فرشتہ صف در صف ہوں گے\" (وَجَاءَ رَبُّكَ وَالْمَلَكُ صَفًّا صَفًّا)۔ جس دن روح (الروح) کھڑا ہوگا، اور وہ امام ہے، \"اور فرشتے صف باندھے ہوئے ہوں گے\" (وَالْمَلَائِكَةُ صَفًّا)۔\n\nپس امام اکیلا ایک صف ہے کیونکہ وہ مجموع ہے، اور اس کی احدیت (أحدية) مجموع کی احدیت (أحدية المجموع) ہے۔ اسی لیے وہ اکیلا ایک صف تھا۔ اور ذات حق (الحق) نے صفوں والوں پر مجموع کی احدیت (أحدية المجموع) میں نہیں بلکہ احدیت کے مجموع (مجموع الأحدية) میں ظہور الٰہی (التجلی) فرمایا۔ کیونکہ صفوں کے اشخاص میں سے ہر شخص ذات حق (الحق) سے اس چیز کی مناجات کرتا ہے جو اس کی حاضری اسے دیتی ہے، اور جو اس کے مقصد کے مناسب ہو، اور جو وہ اپنے رب کے علم کے بارے میں رکھتا ہے۔\n\nاسی لیے اس نے ان پر احدیت کے مجموع (مجموع الأحدية) میں ظہور الٰہی (التجلی) فرمایا۔ پس ان کے لیے مجموع سبقت لے گیا اور اسے احدیت (أحدية) کی طرف مضاف کیا تاکہ وہ اپنی عبادت میں اللہ کے ساتھ کسی کو شریک نہ کریں، باوجود اس کے کہ ان کے مقاصد، عقائد، احوال اور مزاج مختلف ہیں اور ان کی مناسبتیں مختلف ہیں۔ اسی لیے ان کے سوالات مختلف ہوتے ہیں اور کثرت سے ہوتے ہیں۔\n\nاگر وہ ان پر مجموع کی احدیت (أحدية المجموع) میں ظہور الٰہی (التجلی) فرماتا تو احدیت (أحدية) کی تقدم کے باوجود ان کے لیے مجموع کو دیکھنا ممکن نہ ہوتا۔ اور اگر ایسا ہوتا تو ان کے مقاصد ایک ہی مقصد ہوتے، اور ان کا سوال ایک ہی سوال ہوتا، اور حاضری کی حالت میں ان کے احوال ایک ہی حال ہوتے، اور اللہ کا علم ان کے لیے ایک ہی علم ہوتا۔ اور حقیقت اس کے برعکس ہے۔\n\nپس یہ اس بات کی دلیل ہے کہ ظہور الٰہی (التجلی) احدیت کے مجموع (مجموع الأحدية) میں تھا۔ اور \"اسی کی طرف تمام امور لوٹائے جاتے ہیں\" (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ)۔ پس مجموع واحد کی طرف لوٹ گیا اور اس کی طرف مضاف کیا گیا تاکہ وہ یہ گمان نہ کریں کہ مجموع اعیان کا وجود ہے، حالانکہ وہ احکام کا وجود ہے۔\n\nاور اللہ نے نماز میں امام کو صرف اس لیے مشروع کیا تاکہ وہ اس احدیت (أحدية) کا مقابلہ کرے جس کی طرف مجموع کو مضاف کیا گیا ہے، اور جماعت کے ذریعے احدیت کے مجموع (مجموع الأحدية) کا مقابلہ کرے۔ پس امام خاص طور پر احدیت (أحدية) سے مناجات کرتا ہے۔ اسی لیے جس نے امام کی نماز میں عصمت کا عقیدہ رکھا، یہاں تک کہ وہ سلام پھیرے، وہ امام معصوم کے اصحاب ہیں۔ کیونکہ واحد اپنی احدیت (أحدية) سے نہیں بھولتا مگر وہ جو بالفعل معلم ہو۔ کیونکہ اس کے ساتھ سہو اس لیے ہوتا ہے تاکہ وہ جان لے کہ جماعت میں ساہی کا حکم کیسا ہوتا ہے۔ اور یہ صرف انبیاء کے لیے خاص ہے۔\n\nاور رسولوں کے علاوہ جو بھی ہے، وہ صف والوں میں سے کسی ایک کا متبع ہے۔ پس اگر وہ آگے بڑھا اور وہ رسول نہیں ہے، تو وہ معصوم ہے کیونکہ وہ معلم نہیں ہے۔ یہی وہ بات ہے جس کی وجہ سے امام معصوم کے اصحاب، جو کہ امامیہ ہیں، امام کی عصمت کے قائل ہیں۔ حالانکہ حقیقت اس کے خلاف ہے، کیونکہ کوئی امام ایسا نہیں جو اپنی نماز میں سہو نہ کرے، اگرچہ وہ اپنی نماز سے سہو نہ کرے۔\n\nاور جماعت احدیت کے مجموع (مجموع الأحدية) سے مناجات کرتی ہے۔ ہر مقتدی شخص احدیت کے مجموع (مجموع الأحدية) میں سے اس چیز سے مناجات کرتا ہے جو اس کے مقابل ہے۔ پس جس نمازی نے نماز پڑھی اور امام اور مقتدی کے بارے میں جو کچھ ہم نے ذکر کیا اس کا شہود (الشهود) نہیں کیا، تو اس نے کمال کے ساتھ مشروع نماز نہیں پڑھی، اگرچہ اس نے اسے مکمل کر لیا۔ کیونکہ اس نے اسے مکمل نہیں کیا، کیونکہ نماز کا تمام کرنا اس کی نشأت کو قائم کرنا اور اس کے ارکان کو اس کے فرائض اور سنن سے پورا کرنا ہے، جیسے قیام، تکبیر، قراءت، رکوع، جھکنا، اٹھنا، ہیئت اور سلام۔ اگر اس نے یہ سب کچھ کیا تو اس نے اسے تمام کر لیا۔ اور اگر اس نے اس کا شہود (الشهود) کیا جو ہم نے ذکر کیا، تو اس نے اسے مکمل کر لیا، کیونکہ غایت ہی مرتبہ ہے۔ اور نماز صرف اپنی غایت کے لیے مقرر کی گئی ہے، جسے عموم میں نماز میں حضور (حضور) سے تعبیر کیا جاتا ہے، یعنی اس کے اجزاء میں نیت کو برقرار رکھنا، شروع میں داخل ہونے اور اس سے وابستہ ہونے سے لے کر اس سے باہر نکلنے تک۔\n\nپس اے میرے بھائی! دیکھو، کیا تم نے ایسی نماز پڑھی ہے، خواہ تم امام ہو یا مقتدی؟ اور کیا تم نے شہود (الشهود) میں اپنے اور اپنے امام کے درمیان فرق کیا ہے، یا اسے مکانی تقدم اور حکم میں مکانت کے تقدم سے ممتاز کیا ہے؟ پس تم تکبیر نہ کہو جب تک وہ تکبیر نہ کہے، اور رکوع نہ کرو جب تک وہ رکوع نہ کرے، اور نہ اٹھو جب تک وہ نہ اٹھے، اور نماز کے افعال میں سے کوئی کام نہ کرو جب تک وہ نہ کرے۔ کیونکہ تمہارا مرتبہ اتباع ہے۔\n\nپس امام مقتدی پر مکان میں مقدم ہے اگر وہ جماعت میں ہو، اور مکانت میں مقدم ہے اگر اس کے ساتھ صرف ایک شخص ہو۔ پس وہ مکانت کے لحاظ سے امام ہے، احدیت (أحدية) کا مقابلہ کرتا ہے، اور دوسرے کے شامل ہونے سے احدیت کے مجموع (مجموع الأحدية) کا مقابلہ کرتا ہے، یہاں تک کہ گویا وہ صف ہے۔\n\nپس جب امام مکان میں آگے بڑھا اور جماعت اس کے پیچھے ہے، تو اس نے احدیت (أحدية) کے سوا کسی کا شہود (الشهود) نہیں کیا، اور اگر وہ مقتدی کی وحدانیت کی وجہ سے مقتدی کے ساتھ صف میں ہو، تو امام نے احدیت کے مجموع (مجموع الأحدية) اور مجموع کی احدیت (أحدية المجموع) کا شہود کیا، یا مقتدی نے صرف احدیت کے مجموع (مجموع الأحدية) کا شہود کیا۔ پس اس کی مکانت نے اسے اس سے ممتاز کیا، کیونکہ وہ اس کی اتباع کرتا ہے اور اس کی اقتداء کرتا ہے۔ اگر وہ اس کی مخالفت کرے تو مقتدی کی پیشانی شیطان کے ہاتھ میں ہے، اور شیطنت دوری ہے اور نماز قربت ہے۔ پس یہ قربت عین دوری میں ہے اور دوری عین قربت میں ہے۔ پس اس مقتدی نے احدیت کے مجموع (مجموع الأحدية) کا شہود (الشهود) نہیں کیا، کیونکہ وہ نہ تو مکان کے لحاظ سے مقتدی ہے اور نہ ہی مکانت کے لحاظ سے۔\n\nاور جب وہ اس حالت میں ہو، تو امام مقتدی کی مخالفت کی حالت میں صرف احدیت (أحدية) کا مشاہدہ کرتا ہے، کیونکہ مقتدی کے مقتدی ہونے سے زائل ہونے کی وجہ سے کوئی صف نہیں ہے۔ پس امام اس حالت میں اکیلے نماز پڑھنے والے کی طرح ہے، اس مقتدی کی حالت کے لحاظ سے۔ اور وہ ان فرشتوں کے لحاظ سے امام ہے جو اس کے پیچھے نماز پڑھتے ہیں، اور فرشتے صرف اس کے پیچھے صف بناتے ہیں۔ اور فرشتے اپنے رب کے پاس صف بناتے ہیں، اور وہ اس حالت میں اس امام کے پاس ہیں جو انہیں نماز پڑھاتا ہے، اور وہ ہمیشہ اپنے رب کے پاس ہیں۔\n\nپس امام خلیفہ ہے، لہٰذا فرشتوں نے اسے سجدہ کیا، اور امام اللہ کو سجدہ کرتا ہے۔ پس اللہ امام کا قبلہ ہے، اور امام فرشتوں کا قبلہ ہے۔ اور جبرائیل علیہ السلام نے نبی صلی اللہ علیہ وسلم کی امامت صرف اس لیے نہیں کی تاکہ انہیں نماز کو بالفعل سکھا دیں۔\n\nپس انہوں نے آپ کو مکانت کے لحاظ سے نماز پڑھائی نہ کہ مکان کے لحاظ سے، کیونکہ انہوں نے آپ کو اکیلے نماز پڑھائی اور آپ سے آگے نہیں بڑھے۔ پس انہوں نے آپ کو پانچ نمازوں کی تعداد، ان کے اوقات اور ان کی ہیئت کو مکمل ترین طریقے سے سکھایا۔ پھر جب آپ جماعت میں ہوں تو آپ کو مکان کے لحاظ سے ان سے آگے بڑھنے کا حکم دیا۔ اور جس نے یہ دیکھا کہ جبرائیل بھی مکان کے لحاظ سے آگے بڑھے، تو یہ صرف اس لیے ہوا کہ اللہ نے نبی صلی اللہ علیہ وسلم کی آنکھوں سے پردہ ہٹا دیا، پس آپ نے فرشتوں کو دیکھا، اور آپ نے جماعت کو دیکھا، پس آپ جبرائیل کے پیچھے ان کے ساتھ صف میں کھڑے ہوئے۔ لیکن پردے کی حالت میں نہیں۔\n\nاور اسی لیے نبی صلی اللہ علیہ وسلم نے ایک شخص کے ساتھ نماز پڑھی اور اسے اپنے دائیں طرف ایک ہی صف میں کھڑا کیا۔\n\nکیونکہ اس شخص نے فرشتوں کا مشاہدہ (الشهود) نہیں کیا، پس امام نے مقتدی کے حکم کا خیال رکھا۔ \"اور تم طور کے کنارے پر نہیں تھے جب اللہ نے موسیٰ کو پکارا، اور نہ ہی مغربی جانب تھے جب ہم نے موسیٰ کو حکم دیا، اور تم دیکھنے والوں میں سے نہیں تھے\" (وَمَا كُنْتَ بِجَانِبِ الطُّورِ إِذْ نَادَيْنَا مُوسَىٰ وَمَا كُنْتَ بِالْجَانِبِ الْغَرْبِيِّ إِذْ قَضَيْنَا إِلَىٰ مُوسَى الْأَمْرَ وَمَا كُنْتَ مِنَ الشَّاهِدِينَ)۔ اسی طرح تم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نہیں تھے جب جبرائیل نے انہیں پانچ نمازوں میں امامت کرائی، \"اور تم دیکھنے والوں میں سے نہیں تھے\" (وَمَا كُنْتَ مِنَ الشَّاهِدِينَ)۔ اور \"ہم نے صرف اسی بات کی گواہی دی جو ہم جانتے تھے، اور ہم غیب کے محافظ نہیں تھے\" (وَمَا شَهِدْنَا إِلَّا بِمَا عَلِمْنَا وَمَا كُنَّا لِلْغَيْبِ حَافِظِينَ)۔\n\nاور جس نے امور کا مشاہدہ (الشهود) کیا، اس کا حکم اس شخص کا حکم نہیں جس نے صرف خبروں کے ذریعے مشاہدہ نہیں کیا۔ پس عیان (مشاہدہ) کا ایک ایسا حال ہے جسے صرف صاحبِ عیان ہی جان سکتا ہے، جیسا کہ علم کا ایک حال ہے جسے صرف اہل علم ہی جانتے ہیں، دوسروں کے لیے اس میں کوئی ذوق نہیں۔ \"اے میرے رب! مجھے دکھا کہ تو مردوں کو کیسے زندہ کرتا ہے\" (رَبِّ أَرِنِي كَيْفَ تُحْيِ الْمَوْتَىٰ)۔ \"اے میرے رب! مجھے دکھا کہ میں تجھے دیکھوں\" (رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ)۔\n\nلیکن عیان (مشاہدہ) کا ایک لطیف معنی ہے،\nاسی لیے کلیم (موسیٰ علیہ السلام) نے معاینہ (دیکھنے) کا سوال کیا۔\n\nاور فرشتوں کا بنی آدم کو سجدہ ہر نماز میں جاری ہے، جیسا کہ انہوں نے ان کے باپ آدم کو سجدہ کیا تھا۔ پس جب تک بنی آدم میں کوئی نمازی ہے جو \"اللہ، اللہ\" کہتا ہے، خلافت بنی آدم میں باقی ہے۔ کیونکہ جب کوئی الٰہی امر اور شان دنیا میں واقع ہو جاتی ہے تو قیامت تک اس کا حکم ختم نہیں ہوتا۔ اور فرشتوں کا آدم کو سجدہ واقع ہو چکا ہے، پس ان کا سجدہ ان کی ذریت کے لیے ہر اس شخص کے پیچھے جو نماز پڑھتا ہے، قیامت تک باقی ہے۔ جیسا کہ آدم بھول گئے، تو ان کی ذریت بھول گئی، جیسا کہ آدم نے انکار کیا، تو ان کی ذریت نے انکار کیا، جیسا کہ قابیل نے ہابیل کو ظلم سے قتل کیا، تو بنی آدم میں ظلم سے قتل قیامت تک جاری ہے۔ اور پہلے شخص پر اس کا بوجھ ہے، جیسا کہ پہلے شخص کے لیے ہر اس خیر میں حصہ ہے جو کوئی بھی کرتا ہے۔\n\n\"پس جس نے کوئی اچھا طریقہ جاری کیا تو اسے اس کا اجر ملے گا اور ان لوگوں کا اجر بھی جو قیامت تک اس پر عمل کریں گے، اور جس نے کوئی برا طریقہ جاری کیا تو اس پر اس کا بوجھ ہوگا اور ان لوگوں کا بوجھ بھی جو قیامت تک اس پر عمل کریں گے\" (حدیث کا مفہوم)۔\n\nاور وہی ہیں جو \"اپنے بوجھ اور اپنے بوجھوں کے ساتھ دوسرے بوجھ بھی اٹھائیں گے\" (أَثْقَالَهُمْ وَأَثْقَالًا مَعَ أَثْقَالِهِمْ)۔ پس ہر نمازی فرشتوں کا امام ہے اور فرشتے اس کے پیچھے اسے سجدہ کرتے ہیں۔ مگر اصل اور فرع، یعنی آدم اور ان کی ذریت کے درمیان فرق یہ ہے کہ فرشتے بنی آدم کے سجدے کے لیے قراءت اور نماز میں سجدہ کرتے ہیں، اور آدم کو انہوں نے معلم کے لیے متعلم کے سجدے کی طرح سجدہ کیا۔ پس وہ سجدے میں جمع ہوئے اور سبب میں مختلف ہوئے۔\n\nاور مقصود جو ہم چاہتے تھے وہ یہ بیان کرنا تھا کہ فرشتوں کا بنی آدم کے پیچھے سجدہ ختم نہیں ہوا، اور امامت آدم سے لے کر آخری نمازی تک ختم نہیں ہوئی، اور فرشتے اس امام کے تابع ہیں جیسا کہ ہم نے مقرر کیا۔ پس ہم اللہ کے پاس ہیں اپنی امامت کی حالت میں، اور فرشتے اس حالت میں اقتداء کی وجہ سے ہمارے پاس ہیں۔ پس وہ اپنے رب کے پاس ہیں کیونکہ امام اس کے پاس ہے، پس فرشتے اس کے پاس ہیں کیونکہ وہ امام کے پاس ہیں۔ اور ہر صف اپنے پیچھے والوں کے لیے امام ہے، خواہ وہ کتنی ہی دور تک پہنچ جائے۔\n\nاور میرا قول:\n\nپس رب کی عندیت (عندية) معقول ہے،\nاور \"ھو\" (غائب) کی عندیت (عندية) غیر معقول ہے۔\n\nاور اللہ کی عندیت (عندية) مجہول ہے،\nاور مخلوق کی عندیت (عندية) مجہول نہیں۔\n\nاور وہ دونوں (عندیتیں) ظرفیت (ظرفية) کے پاس نہیں ہیں،\nاور اس (ظرفیت) کے لیے اس کے سوا کوئی محمل نہیں۔\n\n(یہاں \"لها\" میں ضمیر ظرفیت (ظرفية) کی طرف لوٹتی ہے، اور \"هما\" میں ضمیر ذات حق (الحق) اور مخلوق کی عندیت (عندية) کی طرف لوٹتی ہے۔)\n\n### [بے شک عندیت (عندية) ایک نسبت ہے، نہ کہ کوئی وجودی امر]\n\nاور جان لو کہ عندیت (عندية) ایک نسبت ہے، نہ کہ کوئی وجودی امر، کیونکہ نسبتیں عدمی امور ہیں جن کا حکم ثابت ہے مگر ان کا عین معدوم ہے۔ اور ان شاء اللہ اس کتاب میں اقطاب کے احوال کے بیان میں اس شخص کا ذکر آئے گا جس کا ورد \"جو کچھ تمہارے پاس ہے وہ ختم ہو جائے گا\" (مَا عِنْدَكُمْ يَنْفَدُ) اور \"اور جو کچھ اللہ کے پاس ہے وہ باقی رہنے والا ہے\" (وَمَا عِنْدَ اللَّهِ بَاقٍ) ہے۔\n\nاور ہم نے یہ اس لیے کہا کہ اللہ کی عندیت (عندية) مجہول ہے کیونکہ اللہ بما ہو اللہ میں کوئی ایک اسمِ الٰہی دوسرے اسم کے بغیر متعین نہیں ہوتا۔ کیونکہ وہ اسماء کے مجموع کا عین ہے۔ اور اسے صرف احوال ہی خاص کرتے ہیں۔ پس جس نے کہا: \"یا اللہ! میرے لیے ایسا کر دے\"، تو اس کا حال اس اسم کو خاص کرتا ہے جو اسمِ اللہ میں شامل اسماء میں سے مطلوب ہے۔ اسی لیے اس کے بارے میں کہا جاتا ہے کہ وہ اطلاق میں مقید ہے، یعنی احوال اسے ان اسماء کے ذریعے مقید کرتے ہیں جو اس میں شامل ہیں، اور احوال کے نہ ہونے کی صورت میں وہ مطلق ہے۔ پس وہ ہر اسم کو قبول کرنے والا اسم ہے، جیسا کہ ہیولیٰ (مادہ) ہر صورت کو قبول کرنے والا ہے۔\n\nاور رب کی عندیت (عندية) اس کے قریب ہے، مگر ان دونوں میں فرق یہ ہے کہ رب کبھی بھی مضاف ہوئے بغیر نہیں آیا۔ پس جو اس کے پاس ہے، وہ اس کے پاس ہے جس کی طرف وہ مضاف کیا گیا ہے، اور وہ صرف کسی کون (کائنات) کی طرف ہی مضاف ہوتا ہے۔ اور مخلوق کی عندیت (عندية) معلوم ہے۔ پس رب کی عندیت (عندية) معقول ہے۔ لیکن \"ھو\" (غائب) کی عندیت (عندية) غیر معقول ہے، کیونکہ \"ھو\" ضمیرِ غائب ہے، اور غائب پر اس کی حالتِ غیبت میں حکم نہیں لگایا جاتا، کیونکہ یہ معلوم نہیں ہوتا کہ وہ کس حالت پر ہے یہاں تک کہ اس کا شہود (الشهود) ہو جائے۔ اور جب اس کا شہود ہو جائے تو وہ \"ھو\" نہیں رہتا، کیونکہ غیبت اس سے زائل ہو گئی۔\n\nکیا تم نہیں دیکھتے کہ خاموش شخص کی طرف کوئی امر منسوب نہیں کیا جاتا جب تک کہ وہ بات نہ کرے، اور نہ ہی کوئی مذہب۔ اسی لیے وہ اپنی خاموشی سے اجماع میں داخل نہیں ہوتا۔ اور یہ ایک اختلافی مسئلہ ہے، اور صحیح وہی ہے جو ہم نے کہا، جیسا کہ انکار کا ترک کرنا حجت نہیں ہے، مگر اس امر کے اصل پر باقی رہنے میں جو اللہ تعالیٰ کے اس قول میں بیان ہوا ہے: \"اس نے تمہارے لیے وہ سب کچھ پیدا کیا جو زمین میں ہے\" (خَلَقَ لَكُمْ مَا فِي الْأَرْضِ جَمِيعًا)۔\n\nاور بنی آدم کا کلام ان چیزوں میں سے ہے جو زمین میں پیدا کی گئیں، اور ان کے تمام افعال بھی۔ پس جب ہم کوئی ایسا امر دیکھیں جو رسول اللہ صلی اللہ علیہ وسلم کی موجودگی میں کہا گیا یا کیا گیا اور آپ نے اس کا انکار نہیں کیا، تو ہم یہ نہیں کہتے کہ اس کا حکم اباحت (جائز ہونا) ہے، کیونکہ آپ نے اس میں کوئی حکم نہیں دیا، کیونکہ یہ ممکن ہے کہ آپ پر اس بارے میں کوئی چیز نازل نہ ہوئی ہو، اور آپ صرف اسی چیز کا حکم دیتے ہیں جو اللہ نے آپ پر وحی کی ہو۔ پس وہ امر اصل پر باقی رہتا ہے، اور وہ طبعی تصرف ہے جس کا یہ نشأہ تقاضا کرتا ہے، اس پر پانچ احکام میں سے کسی ایک حکم کو متعین کیے بغیر۔ اور یہی اصلِ اول ہے جو صحیح نظر کا تقاضا کرتا ہے۔\n\nاور یہ منزل علوم میں سے حمدِ سواء (برابر حمد) اور اس کی تفصیلات کے علم کو شامل ہے۔ کیونکہ اس نے دونوں اطراف اور واسطے کو عام کیا، اور اسے عالمین کی طرف مضاف کیا، کسی ایک عالم کو خاص نہیں کیا۔ پس اس نے کتاب کی پہلی فاتحہ میں ایک طرف فرمایا: \"تمام تعریف اللہ کے لیے ہے جو تمام جہانوں کا رب ہے\" (الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ)۔ اور اس حمد کو رحمتِ مرکبہ کے درمیان رکھا، کیونکہ اس سے پہلے \"الرحمن الرحیم\" (الرَّحْمَنِ الرَّحِيمِ) آیا، اور اس کے بعد \"الرحمن الرحیم\" (الرَّحْمَنِ الرَّحِيمِ) آیا۔ پس عالم دو رحمتوں کے درمیان ہو گیا، پس اس کا اول مرحوم ہے اور اس کا انجام رحمت کی طرف ہے۔\n\nاور سورۃ یونس کے وسط میں اہل جنت کی صفت میں آیا ہے کہ ان کی آخری دعا یہ ہوگی: \"اور ان کی آخری دعا یہ ہوگی کہ تمام تعریف اللہ کے لیے ہے جو تمام جہانوں کا رب ہے\" (أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ)۔ اور سورۃ الصافات میں آیا ہے: \"اور تمام تعریف اللہ کے لیے ہے جو تمام جہانوں کا رب ہے\" (وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ) اس کے قول \"اور رسولوں پر سلام ہو\" (وَسَلَامٌ عَلَى الْمُرْسَلِينَ) کے بعد، اور وہ مرحوم اور سالم ہیں۔ پس اللہ نے خیبر میں اپنی نصرت اور فتح کے بعد رب العالمین کی حمد کی۔ پس یہ حمدِ نعمت ہے۔ پس حمدِ نعمت سورت کے شروع میں، وسط میں اور آخر میں ظاہر ہوئی۔ پس اس نے دونوں اطراف اور واسطے کو عام کیا۔\n\nپس کیا یہ حمد ان مراتب میں برابر ہے، اس لحاظ سے کہ یہ حمدِ سواء ہے، یا دونوں اطراف اور وسط کے اختلاف کی وجہ سے اس کے مراتب مختلف ہیں؟ اور ان میں سے کون سا مرتبہ اعلیٰ ہے؟ کیا دونوں اطراف یا وسط؟ اور پہلا حمد عالمین میں سے کس کے لیے ہے، اور وسط اور آخر کس کے لیے؟ یہ سب وہ علم ہے جو اللہ ان علماء باللہ کو عطا کرتا ہے جو \"اس سے ڈرتے ہیں اور اللہ کے سوا کسی سے نہیں ڈرتے\" (يَخْشَوْنَهُ وَلَا يَخْشَوْنَ أَحَدًا إِلَّا اللَّهَ)۔\n\nاور اس میں ملکی اور بشری مراتب کا علم ہے، اور کیا ان کے مراتب برابر ہیں یا ان میں سے کون سے مراتب اعلیٰ ہیں؟ کیا بشر کے مراتب یا فرشتوں کے مراتب؟ یا ان میں سے ہر صنف کے لیے ایسے مراتب ہیں جو دوسرے کے مراتب سے بلند ہیں؟\n\nاور اس میں منافع کو حاصل کرنے کا علم ہے، اور کیا نقصانات کے تہہ میں منافع ہیں یا نہیں؟ اور منافع کا تعین۔\n\nاور اس میں الٰہیات میں اتباع کا علم ہے، کیا متبع اس میں ذکر کی پیروی کرتا ہے یا فکر کی؟\n\nاور اس میں اضافت کی توحید کا علم ہے، نہ کہ اطلاق کی توحید کا۔ اور کیا توحید دو ہیں یا نہیں؟ یعنی توحیدِ ذات اور الوہیت میں الٰہ کی توحید، اور ان دونوں توحیدوں میں سے ہر ایک کا ادراک کس چیز سے ہوتا ہے؟\n\nاور اس میں اشیاء کی طرف اللہ کی نسبت کا علم ہے، کیا یہ اشیاء کی اللہ کی طرف نسبت کا عین ہے یا مختلف ہے؟\n\nاور اس میں علم ہے کہ کیا ایک ہی چیز کے متعدد وجوہ ہیں یا ایک ہی چیز کا صرف ایک ہی وجہ ہے؟ اور جب وہ اس حالت میں ہو تو اس سے کیا صادر ہوتا ہے؟\n\nاور اس میں الٰہی اور کونی رمی (پھینکنے) کے درمیان فرق کا علم ہے۔\n\nاور اس میں دوام (دیمومة) کا علم ہے۔\n\nاور اس میں اختلاس (اچک لینے) کا علم ہے، اور مختلَس (جسے اچک لیا گیا) اور مختلِس (اچکنے والا) کا حکم کیا ہے؟ (اسم فاعل اور اسم مفعول)۔ اور یہ کہ نماز میں اِدھر اُدھر دیکھنا ایک اختلاس ہے جسے شیطان بندے کی نماز سے اچک لیتا ہے۔\n\nاور اس میں عالم کے لیے خلق کا علم ہے۔\n\nاور اس میں ایک ہی مخلوق پر دو خالقوں کے جمع ہونے کا علم ہے، کیا ان میں سے ہر ایک نے وہی دیا جو دوسرے نے دیا، یا ان کی تخلیق میں ان کے احکام مختلف ہیں؟ اور وہ کن چیزوں میں مختلف ہوئے اور کن میں جمع ہوئے؟\n\nاور اس میں حال میں جاہل کے ساتھ نرمی کا علم ہے، اور اسے مہلت دینا تاکہ وہ اپنی جہالت سے رجوع کرے۔\n\nاور اس میں جاہل کے نطق کا علم ہے، کیا اس کا حکم عالم کے نطق کے حکم جیسا ہے درست ہونے میں، اگرچہ جاہل اس مقام کو نہ جانتا ہو جہاں سے اس نے نطق کیا؟ یا عالم اس کی اس درستی کو غلطی سمجھتا ہے؟ پس عالم اس مقام کی جہالت میں جاہل کے برابر ہو گیا جہاں سے جاہل نے نطق کیا، اور علماء میں سے جو اسے جانتا ہے اور جو نہیں جانتا ان کے درمیان فرق، اور اس عالم کا حکم جو یہ جانتا۔\n\nاور اس میں واحد کے کثیر میں تاثیر کا علم ہے، اس نے اپنی احدیت (أحدية) کے باوجود کہاں سے تاثیر کی؟\n\nاور اس میں فصل (جدائی) اور وصل (ملاپ) کا علم ہے۔\n\nاور اس میں مختلف لوگوں کے لیے صفت کو جمع کرنے کا علم ہے، کون سی حقیقت انہیں جمع کرتی ہے؟\n\nاور اس میں گمراہی کی طرف ہدایت کا علم ہے۔\n\nاور اس میں مواقف (ٹھہرنے کی جگہوں) اور قول کا علم ہے، اور کیا رضا کے لیے بھی مواقف ہیں جیسا کہ قہر کے لیے ہیں یا نہیں؟ اور قیامت کے کتنے مواقف ہیں؟ اور کیا اہل اللہ کے مواقف نفری کے مواقف کی طرح محدود ہیں یا محدود نہیں ہیں؟ یا ایک لحاظ سے محدود ہیں اور ایک لحاظ سے محدود نہیں ہیں؟ اور وقوف کیوں ہے؟ اور کیا یہ سکون کا وقوف ہے یا وہ اپنے وقوف میں منتقل ہوتا رہتا ہے؟\n\nاور اس میں اہل اسلام اور اہل استسلام کے درمیان فرق کا علم ہے۔\n\nاور اس میں کون (کائنات) سے علم طلب کرنے کا علم ہے۔\n\nاور اس میں اس چیز کا علم ہے جو کسی بھی مقام پر حق کا اعتراف عطا کرتا ہے، اور کیا یہ اپنے صاحب کے لیے ہر لحاظ سے نفع بخش ہے یا نہیں؟ اور کس چیز کا اعتراف کرنا چاہیے اور کس کا نہیں کرنا چاہیے؟\n\nاور اس میں علمِ نافع کا علم ہے۔\n\nاور اس میں معانی کے آلات کا علم ہے، ان میں سے جو مرکب ہیں اور جو غیر مرکب ہیں۔\n\nاور اس میں اس چیز کا علم ہے جو انسان کو نعمت دیتا ہے اور جو اسے عذاب دیتا ہے، اور یہ کہ اللہ کی طرف سے کسی میں کوئی چیز نہیں ہے۔\n\nاور اس میں الٰہی خطوط اور حدود کا علم ہے، اور یہ کہ وہ نشان زدہ ہیں اور آپس میں نہیں ملتے، اور وہ اپنے محال (مقامات) کو اپنے محال کے مقابلے میں زیادہ جانتے ہیں، کیونکہ ان کے محال ان کے لیے معلوم ہیں، لیکن وہ اپنے محال کے لیے معلومِ مکان نہیں ہیں۔\n\nاور اس میں ان نعمتوں کا علم ہے جو تکالیف کو دور کرتی ہیں، اور ان نعمتوں کے درمیان فرق جو کسی تکلیف کو دور نہیں کرتیں۔\n\nاور اس میں مثل کے ساتھ انس کا علم ہے، اور کیا اللہ کے ساتھ انس اس شخص کو حاصل ہوتا ہے جو صورت پر پیدا کیا گیا ہے، یا اس کی صورت پر ہونے کی حقیقت یہ ہے کہ وہ اللہ سے انس نہیں کرتا جیسا کہ اللہ اس سے انس نہیں کرتا؟ اور کیا پورے عالم کے لیے یہی حکم ہے یا نہیں؟ اور کیا وہ انسان جو ذات حق (الحق) کے لیے سائے کی طرح ہے، اس کا حکم اس انسان کامل (الإنسان الکامل) خلیفہ کے حکم جیسا ہے جو اس سائے سے مشابہ انسان کا ایک جزو ہے یا نہیں؟\n\nاور اس میں اغیار (دوسروں) کے ذریعے واقع ہونے والی نغموں سے لذت حاصل کرنے کا علم ہے، کیا یہ مطلوبہ لذت کے کمال میں سے ہے یا لذت حاصل کرنے والے کے لیے نقص ہے؟\n\nاور اس میں نفس کا علم ہے، اس قول میں: \"اپنے دل سے فتویٰ لے لو، اگرچہ مفتی تمہیں فتویٰ دے دیں\" (استفت قلبك وإن أفتاك المفتون)۔ کیونکہ یہاں اطلاع دینے میں ایک الٰہی لطف ہے جسے اللہ نے اپنے رسول صلی اللہ علیہ وسلم کی زبان پر جاری کیا، یہ خبر دیتے ہوئے کہ اللہ دل میں صرف وہی ڈالتا ہے جو حق ہو اور جس میں انسان کی سعادت ہو۔ پس اگر اس نے اس بارے میں اپنے نفس کی طرف رجوع کیا تو وہ کامیاب ہو گیا۔ اور یہی اس مقام کے بعض عارفین کے قول کا معنی ہے جہاں انہوں نے کہا: \"میں نے اپنے لیے ورع (پرہیزگاری) سے زیادہ آسان کوئی چیز نہیں دیکھی، جب بھی میرے دل میں کوئی چیز کھٹکتی ہے تو میں اسے چھوڑ دیتا ہوں\"۔\n\nاور اس میں قرائن میں احوال کی تعظیم کا علم ہے جو تعظیم کے لائق ہیں۔\n\nاور اس میں اس چیز کا علم ہے جس پر ثابت قدم رہنا چاہیے۔\n\nاور اس میں احوال میں فضیلت کا علم ہے، ان اصحاب کو دیکھے بغیر جن کے ساتھ وہ قائم ہیں۔\n\nاور اس میں ماہیتوں (الماهيات) کا علم ہے۔\n\nاور اس میں دو صورتوں کے تشابہ اور حکم کے اختلاف کا علم ہے۔\n\nاور اس میں عالم میں ائمہ کے وجود کی حکمت کا علم ہے، ان میں سے جو گمراہ کرنے والے ہیں اور جو گمراہ کرنے والے نہیں ہیں۔\n\nاور اس میں بلا کے وقت پکارنے کا علم ہے، اور کیوں اسے نعمتوں کے بجائے اسی کے ساتھ خاص کیا گیا؟\n\nاور اس میں دعا کرنے والوں اور سوال کرنے والوں کی اجابت کا علم ہے، کیا جواب دینے والا اس سوال کی مطابقت سے زیادہ دیتا ہے جو واقع ہوا؟ یا زیادہ نہیں دیتا؟ اگر وہ زیادہ دیتا ہے تو کیا وہ حال کے سوال کا جواب ہے، کیونکہ وہاں نطق نہیں تھا؟\n\nاور اس میں عالمِ علوی کے عالمِ سفلی سے مربوط ہونے کا علم ہے تاکہ وہ فائدہ دے، اور عالمِ سفلی کے عالمِ علوی سے مربوط ہونے کا علم ہے تاکہ وہ فائدہ حاصل کرے، اور فائدہ دینے والا ہمیشہ اعلیٰ ہوتا ہے، اور فائدہ حاصل کرنے والا ہمیشہ سفلی ہوتا ہے، اور مساحت اور مکان کی بلندی کا کوئی حکم نہیں۔\n\nاور اس میں محجوب (پردہ نشین) کا مکشوف (جس پر پردہ اٹھا) پر تاثیر کا علم ہے، کس لحاظ سے اس نے اس پر تاثیر کی باوجود اس کے کہ اس کا مرتبہ بلند ہے، اور یہ کہ ذات حق (الحق) اس کی مدد کرتا ہے، اور اس مؤثر کی سزا کیا ہے؟\n\nاور اس میں اسفار (سفروں) کا علم ہے۔\n\nاور اس میں اس شخص کا علم ہے جسے قدرت نہ ہونے کے باوجود حلم (بردباری) سے متصف کیا گیا، حالانکہ حلیم صرف وہی ہوتا ہے جو اس پر قادر ہو جس پر وہ حلم کرتا ہے۔\n\nاور اس میں خیال کا حس پر اثر کا علم ہے، اور اس کا حکم کہاں تک پہنچتا ہے؟\n\nاور اس میں مراتب کا اپنے اصحاب پر ان چیزوں کے ساتھ حکم کا علم ہے جنہیں وہ ناپسند کرتے ہیں۔\n\nاور اس میں اشیاء کی قیمت کا علم ہے، اور ان کے لیے ایک خاص حضور (حضرة) ہے، اور یہ کہ کوئی چیز ایسی نہیں جس کی کوئی قیمت نہ ہو، سوائے انسان کامل (الإنسان الکامل) کے، کیونکہ اس کی قیمت اس کا رب ہے۔\n\nاور اس میں صدق (سچائی) کے نتائج کا علم ہے، اور صادقین کے مراتب، اور یہ کہ ان سے ان کی سچائی کے بارے میں سوال کیا جائے گا۔\n\nاور اس میں الٰہی برکات کے حضور (حضرات) کا علم ہے۔\n\nاور اس میں ظلم کے مراتب کا علم ہے، اور ان میں سے جو قابلِ تعریف ہے اور جو قابلِ مذمت ہے۔\n\nاور اس میں امر میں شراکت کا علم ہے، کیا اس امر کا حکم ہر شریک میں برابر ہے، یا شرکاء کے احوال اور استعدادات کے اختلاف کی وجہ سے امر میں شراکت کے باوجود حکم مختلف ہوتا ہے؟\n\nاور اس میں حاکم کے سامنے فریقین کے جمع ہونے کے حضور (حضرة) کی صورت کا علم ہے۔\n\nاور اس میں مؤنث کو مذکر کے ساتھ ملانے کا علم ہے۔\n\nاور اس میں قرعہ اندازی کا علم ہے، اور اس کا حکم کہاں لگایا جاتا ہے؟\n\nاور نبی صلی اللہ علیہ وسلم کا قول: \"اگر لوگوں کو معلوم ہو جائے کہ اذان دینے اور صفِ اول میں کیا ہے، پھر وہ اس کے لیے قرعہ اندازی کے سوا کوئی چارہ نہ پائیں تو وہ ضرور قرعہ اندازی کریں گے۔ اور اگر وہ جان لیں کہ تہجیر (جلدی جانے) میں کیا ہے تو وہ اس کی طرف دوڑیں گے۔ اور اگر وہ جان لیں کہ عشاء اور فجر میں کیا ہے تو وہ ان کے لیے آئیں گے خواہ گھٹنوں کے بل چل کر آنا پڑے\" (حدیث کا مفہوم)۔\n\nاور اس میں تاریکیوں کا علم ہے، اور تاریکی کی حقیقت کس چیز کی طرف لوٹتی ہے؟ کیا کسی وجودی امر کی طرف یا عدمی امر کی طرف؟\n\nاور اس میں تنزیہ (پاکیزگی بیان کرنے) کی فضیلت کا علم ہے، دیگر تعریفوں کے مقابلے میں۔\n\nاور اس میں جنین (بچے) کے باہر نکلنے پر شفقت کا علم ہے، اور اس کے ساتھ نرمی اور اس پر رحم کرنا، اور نبی صلی اللہ علیہ وسلم کا قول: \"وہ ہم میں سے نہیں جو ہمارے چھوٹوں پر رحم نہ کرے\" (لَيْسَ مِنَّا مَنْ لَمْ يَرْحَمْ صَغِيرَنَا)۔\n\nاور اس میں یقین اور شک کا علم ہے، اور کیا صاحبِ یقین اس چیز میں شک سے متصف ہوتا ہے جس پر وہ یقین رکھتا ہے یا نہیں؟\n\nاور اس میں حق کے علم کے ساتھ ذات حق (الحق) کے انفراد کا علم ہے۔\n\nاور اس میں اس چیز کا علم ہے جسے اللہ کی طرف منسوب کرنا چاہیے۔\n\nاور اس میں اس شخص کا علم ہے جس کی طبیعت میں کوئی امر ہو جو اس کے طبعی حکم سے زائل نہ ہو، اگرچہ اسے کوئی عارضہ لاحق ہو جو اسے زائل کر دے، تو وہ زوال دائمی نہیں ہوتا، اور طبیعت غالب رہتی ہے۔\n\nاور اس میں فرشتوں پر احوال کے بدلنے کا علم ہے، یہ انہیں کہاں سے حاصل ہوا؟\n\nاور اس میں عنایت (توجہ) کا علم ہے، اور اس میں عالم کے طبقات۔\n\nاور اس میں آہستگی (أناة) اور جلد بازی (عجلة) کا علم ہے۔\n\nاور اس میں بشارت کے عموم اور انذار (ڈرانے) کے خصوص کا علم ہے، اور اس کے علاوہ دیگر علوم جن کا ذکر طویل ہو جائے گا۔ پس ہم نے ان میں سے اہم کا ذکر کرنے کا ارادہ کیا ہے۔ \"اور اللہ حق کہتا ہے اور وہی راہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب سیصد و چهل و هفتم: در معرفت منزل \"عِندیت\" الهی و صف اول نزد خداوند متعال\n\nچقدر فاصله است میان کسی که می‌داند چه چیزی برای او بوده است،\nو میان کسی که بر علم خود افزوده است.\n\nاین [دومی] کسی است که در علم خود ارتقا می‌یابد،\nو آن [اولی] از حکم خود خارج نمی‌شود.\n\nپس حال برای اولی از \"چگونگی\" (کیف) اوست،\nو علم برای دومی از \"چندینگی\" (کم) اوست.\n\nچندینگی او حکمش پایان نمی‌پذیرد،\nپس علم او بر فهمش فزونی می‌گیرد.\n\nاگر وجود حرف نبود، برای من فهمی حاصل نمی‌شد،\nو گاهی [فهم] از وهم او درک می‌شود.\n\nپس علم و فهم برای عین من با هم هستند،\nو برای حق (الحق) جز علم او نیست.\n\n### خداوند عِندیت خود را ظرفی برای خزانه‌های اشیاء قرار داده است\n\nو خداوند متعال فرمود: وَمَا عِنْدَ اللَّهِ بَاقٍ (و آنچه نزد خداست باقی است). و فرمود: آتَيْنَاهُ رَحْمَةً مِنْ عِنْدِنَا وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْمًا (و از نزد خود رحمتی به او دادیم و از جانب خویش دانشی به او آموختیم). و فرمود: وَعِنْدَهُ مَفَاتِحُ الْغَيْبِ (و کلیدهای غیب نزد اوست). و رسول خدا (ص) فرمود: «همان‌گونه که فرشتگان نزد پروردگارشان صف می‌کشند.»\n\nو خداوند متعال فرمود: إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ (همانا علم ساعت (قیامت) نزد خداست). و فرمود: وَإِنْ مِنْ شَيْءٍ إِلَّا عِنْدَنَا خَزَائِنُهُ (و هیچ چیزی نیست مگر آنکه خزانه‌های آن نزد ماست). پس اضافات این عِندیت (عندية) به دلیل اختلاف آنچه به آن اضافه شده است، از اسم و ضمیر و کنایه، متفاوت گشته است. و این [عِندیت] ظرف سومی است. من کسی از اهل الله را ندیدم که به آن توجه کرده باشد تا بداند چیست؛ زیرا نه ظرف زمان است و نه ظرف مکان محض، بلکه به طور مطلق و یکجا ظرف \"مکانت\" (جایگاه) است. همچنین در این فرموده خداوند متعال: مَا عِنْدَكُمْ يَنْفَدُ (آنچه نزد شماست تمام می‌شود)، برای ما نیز عِندیت قرار داده است، در حالی که در حق ما ظرف مکان نیست. پس تعجب کردم از علما که چگونه از تحقیق این عِندیت که حق (الحق) و انسان به آن متصف شده‌اند، غافل مانده‌اند.\n\nسپس خداوند عِندیت (عندية) خود را ظرفی برای خزانه‌های اشیاء قرار داد. و معلوم است که او اشیاء را می‌آفریند و از عدم به هستی (الوجود) خارج می‌سازد. این اضافه اقتضا می‌کند که او اشیاء را از خزانه‌هایی که نزد اوست خارج می‌کند. پس او آن‌ها را از وجودی که ما درکش نمی‌کنیم به وجودی که درکش می‌کنیم خارج می‌سازد. بنابراین، اشیاء به عدم محض نرسیده‌اند، بلکه ظاهر امر این است که عدم آن‌ها از \"عدم اضافی\" است. زیرا اشیاء در حال عدمشان برای او مشهودند و آن‌ها را با اعیانشان از یکدیگر متمایز می‌سازد، در حالی که نزد او هیچ اجمالی در آن‌ها نیست. پس خزانه‌های آن‌ها، یعنی خزانه‌های اشیاء که ظرف‌های ذخیره‌شده‌ی آن‌ها هستند، چیزی جز \"امکانات اشیاء\" نیستند. زیرا اشیاء در اعیان خود وجودی ندارند، بلکه دارای \"ثبوت\" هستند، و آنچه از حق (الحق) کسب کرده‌اند، \"وجود عینی\" است. پس برای ناظران تفصیل یافتند و خودشان به وجود اعیانشان تفصیل نیافتند. و پیوسته نزد خدا تفصیلی ثبوتی داشته‌اند. سپس هنگامی که در اعیان خود ظاهر شدند و حق (الحق) آن‌ها را از نزد خود نازل کرد، آن‌ها را در خزانه‌هایشان نازل نمود؛ زیرا حکم امکان از آن‌ها جدا نشده است. اگر آن‌ها در خزانه‌هایشان نبودند، خزانه‌ها بر آن‌ها حکم نمی‌کردند. و چون امکان حتی یک چشم بر هم زدن از آن‌ها جدا نمی‌شود و خروج آن‌ها از آن صحیح نیست، مرجِّح (ترجیح‌دهنده) پیوسته همراه آن‌هاست؛ زیرا ناگزیر باید به یکی از دو امر ممکن، یعنی وجود و عدم، متصف شوند. پس آن‌ها و خزانه‌ها پیوسته نزد خدا هستند، زیرا مرجِّح از ترجیح یکی از دو امر ممکن بر این اشیاء جدا نمی‌شود. بنابراین، آن‌ها خروجی از خزانه‌های امکان خود ندارند. و حق سبحانه تنها درهای این خزانه‌ها را گشود تا ما به آن‌ها نظر کنیم و آن‌ها به ما نظر کنند، در حالی که ما در آن‌ها هستیم و از آن‌ها خارجیم، همان‌گونه که آدم خارج از قبضه حق (الحق) بود و در عین حال در قبضه حق بود و خود را در هر دو موطن می‌دید. پس هر کس اشیاء را ببیند و خزانه‌ها را نبیند و خدایی را که این خزانه‌ها نزد اوست نبیند، هرگز اشیاء را ندیده است؛ زیرا اشیاء از خزانه‌های خود جدا نشده‌اند و خزانه‌هایشان از عِندیت (عندية) خدا جدا نشده‌اند و ضمائر و عِندیت الهی از ذات او جدا نشده‌اند. پس هر کس یکی از این امور را شهود کند، مجموع را شهود کرده است.\n\nعِندیت حق (الحق) عین ذات اوست،\nدر آن برای اشیاء او خزانه‌هاست.\n\nآنچه را که می‌بیند از آن نازل می‌کند،\nپس آن [عِندیت] نگهدارنده چیزی است که در بر می‌گیرد.\n\nنزول او آن را از آن [عِندیت] زایل نکرده است،\nزیرا او اعیان کائنات است.\n\nعِندیت، ظرفی پاک و منزه است،\nعِندیت مکان‌ها نیست.\n\nو دهر آن، خداست نه زمان،\nو دهر ظرفی برای هر ساکن است.\n\nاو با سکون در آن مالک آن می‌شود،\nمسکن او شریف‌ترین مسکن‌هاست.\n\nبرای آن [عِندیت] بدون او انتقالی نیست،\nپس مانند ملزوم خود مشاهده می‌شود.\n\nصفت آن از معنای دقیق چیست؟\nو من ضامن بدهکار نیستم.\n\nپس اگر دانا باشی، در هستی (الکون) هیچ احدیتی نیست مگر \"احدیت مجموع\" (أحدية المجموع)؛ زیرا او پیوسته خدا (إله) بوده و پیوسته خدا خواهد بود. و حکمی بر او تجدید نشده که قبلاً بر او نبوده باشد، و اسمی حادث نشده که قبلاً به آن نامیده نشده باشد؛ زیرا او خود نام‌گذار خویش است. و صفتی بر او قائم نشده که پیش از آن به آن موصوف نبوده باشد، بلکه امر از آنِ اوست، از پیش و پس. پس او صاحب اسماء حسنی و صفات علیاست، و خدایی است که پیوسته در \"عماء\" (غیب محض) بوده، و رحمانی است که خود را به استواء وصف کرده، و پروردگاری است که هر شب در ثلث باقی‌مانده از شب به آسمان [دنیا] نازل می‌شود، و هر کجا که باشیم با ماست. و هیچ رازگویی از عددی معین نیست مگر آنکه او جفت‌کننده آن عدد یا فردکننده آن است. پس او چهارمینِ سه نفر و ششمینِ پنج نفر و بیشتر و کمتر از آن است. آیا دیده‌ای یا از حق (الحق) در وحی او به تو رسیده است جز احدیت مجموع؟ زیرا نیامده است مگر إِلَّا إِلَهٌ وَاحِدٌ (جز خدای یگانه) و لَا إِلَهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ هُوَ الرَّحْمَنُ الرَّحِيمُ (هیچ معبودی جز او نیست، دانای غیب و شهود، اوست رحمان و رحیم) هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ... الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ (اوست خدایی که هیچ معبودی جز او نیست، فرمانروا، قدوس، سلام، مؤمن، مهیمن، عزیز، جبار، متکبر... آفریننده، پدیدآورنده، صورت‌بخش).\n\n### اسماء الهی اگرچه بر یک مسمای واحد مترادف هستند، اما بر معانی مختلف دلالت می‌کنند\n\nو تو می‌دانی، اگر از اهل فهم از جانب خدا باشی، که این اسماء اگرچه از حیث ذات بر یک مسمای واحد مترادف هستند، اما ما می‌دانیم که بر معانی مختلف دلالت می‌کنند. قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَى (بگو: «الله» را بخوانید یا «رحمن» را بخوانید، هر کدام را بخوانید، پس نیکوترین نام‌ها از آن اوست). پس ما جز خدای واحدی را نمی‌خوانیم که این اسماء با حقایق و مدلولات مختلف از آن اوست. و این اسماء از ازل پیوسته از آن او بوده‌اند. و این‌ها همان خزانه‌های الهی هستند که خزانه‌های امکانات در آن‌هاست و اشیاء در آن‌ها ذخیره شده‌اند. پس جمع را با جمع، کثرت را با کثرت، و عدد را با عدد، همراه با احدیت عین، مقابله کن. پس این همان احدیت جمع است. و هر نمازگزاری در خلوت خود با پروردگارش مناجات می‌کند، در حالی که خداوند پرده‌ی حمایت خود را بر او افکنده است. پس او مطلقِ مقید، عام در خصوص، و خاص در عموم است.\n\n### خداوند برای ما دو موطن در صف‌آرایی قرار داده است\n\nو بدان که خداوند برای ما دو موطن در صف‌آرایی قرار داده که برای هیچ‌یک از مخلوقات دیگر قرار نداده است: صفی در موطن نماز و صفی در موطن جهاد. پس فرمود: إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُمْ بُنْيَانٌ مَرْصُوصٌ (همانا خداوند کسانی را دوست دارد که در راه او صف‌آرایی کرده و می‌جنگند، گویی بنایی محکم و به هم پیوسته‌اند). و ما را به تراص (به هم پیوستن) در صف نماز امر فرمود و ذکر کرد که فرشتگان نزد پروردگارشان صف می‌کشند. و صفوف ما را مانند صفوف فرشتگان قرار داد و این برای امت‌های دیگر نیست. و جَاءَ رَبُّكَ وَالْمَلَكُ صَفًّا صَفًّا (و پروردگارت و فرشته صف در صف می‌آیند). روزی که روح (الروح) که همان امام است و الْمَلَائِكَةُ صَفًّا (و فرشتگان صف در صف می‌ایستند). پس امام خود یک صف است، زیرا او مجموع است و احدیت او \"احدیت مجموع\" (أحدية المجموع) است، و به همین دلیل به تنهایی یک صف بود. و حق (الحق) بر اهل صفوف در \"مجموع احدیت\" (مجموع الأحدية) تجلی کرد، نه در احدیت مجموع؛ زیرا هر شخص از اشخاص صفوف، با آن مقدار از حق (الحق) مناجات می‌کند که حضورش به او می‌دهد و مناسب قصد اوست و علمی که به پروردگارش دارد. و به همین دلیل در مجموع احدیت بر آن‌ها تجلی کرد. پس مجموع برای آن‌ها مقدم شد و آن را به احدیت اضافه کرد تا با وجود اختلاف مقاصد، عقاید، احوال، مزاج‌ها و مناسباتشان، کسی را در عبادت خود با خدا شریک نکنند. و به همین دلیل سؤالاتشان متفاوت و زیاد است. اگر بر آن‌ها در احدیت مجموع تجلی می‌کرد، با وجود تقدم احدیت، امکان نظر به مجموع برایشان فراهم نمی‌شد. و اگر چنین بود، مقاصدشان یک مقصد، سؤالشان یک سؤال، حالاتشان در حضور یک حال، و علمشان به خدا یک علم می‌بود، در حالی که واقعیت چنین نیست. پس این دلالت می‌کند که تجلی در مجموع احدیت بوده است. و إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ (و همه امور به سوی او بازگردانده می‌شود). پس مجموع به سوی واحد بازگشت و به او اضافه شد تا خیال نکنند که مجموع، وجود اعیان است، در حالی که وجود احکام است. و خداوند امام را در نماز تشریع نکرد مگر برای اینکه او را در مقابل احدیتی قرار دهد که مجموع را به آن اضافه کرده است، و جماعت را در مقابل مجموع احدیت قرار دهد. پس امام به طور خاص با احدیت مناجات می‌کند. و به همین دلیل است که کسانی که به عصمت امام در نماز معتقدند تا [نمازشان] سالم بماند، همان اصحاب امام معصوم هستند؛ زیرا واحد از احدیت خود سهو نمی‌کند، مگر معلم بالفعل، که سهو بر او عارض می‌شود تا تعلیم دهد که حکم سهوکننده از جماعت چگونه است، و این مخصوص انبیاست. و غیر از رسولان، هر کس متبّع یکی از اهل صف باشد، اگر پیشوای جماعت شود و رسول نباشد، معصوم است، زیرا معلم نیست. این همان چیزی است که باعث شده اصحاب امام معصوم که همان امامیه هستند، به عصمت امام قائل شوند، در حالی که واقعیت خلاف آن است؛ زیرا هیچ امامی نیست مگر آنکه در نمازش سهو می‌کند، هرچند از اصل نمازش سهو نکند. و جماعت با مجموع احدیت مناجات می‌کنند، هر شخص مأموم با آنچه در مقابل او از مجموع احدیت است مناجات می‌کند. پس هر نمازگزاری که نماز بخواند و آنچه را که ذکر کردیم از امام و مأموم مشاهده نکند، نماز مشروع را به کمال نخوانده است، هرچند آن را به اتمام رسانده باشد، زیرا آن را کامل نکرده است. چون تمام بودن نماز، برپایی نشأت آن و استیفای ارکان آن از فرایض و سنن، از قیام، تکبیر، قرائت، رکوع، خفض، رفع، هیئت و سلام است. اگر همه این‌ها را انجام دهد، آن را به اتمام رسانده است. و اگر آنچه را ذکر کردیم مشاهده کند، آن را کامل کرده است؛ زیرا غایت همان مرتبه است و نماز جز برای غایت خود وضع نشده است، که در عموم از آن به \"حضور در نماز\" تعبیر می‌شود، یعنی همراه داشتن نیت در اجزای آن از ابتدای ورود و شروع به آن تا خروج از آن. پس ای برادر من، بنگر آیا چنین نمازی خوانده‌ای، چه امام باشی و چه مأموم؟ و آیا در شهود میان خود و امامت فرق گذاشته‌ای، یا او را به تقدم مکانی و تقدم مکانتی در حکم از خود متمایز کرده‌ای؟ پس تکبیر نمی‌گویی تا او تکبیر بگوید، و رکوع نمی‌کنی تا او رکوع کند، و سر بر نمی‌داری تا او سر بردارد، و هیچ‌یک از افعال نماز را انجام نمی‌دهی تا او انجام دهد؛ زیرا رتبه تو \"اتباع\" است. پس امام بر مأموم مقدم است، از نظر مکان اگر در جماعت باشد، و از نظر مکانت اگر تنها یک نفر با او باشد. پس او امام به مکانت است که با احدیت مقابله می‌کند و با پیوستن دیگری به او، با مجموع احدیت مقابله می‌کند، تا جایی که گویی او صف است. پس اگر امام از نظر مکان جلوتر بایستد و جماعت پشت سر او باشند، جز احدیت را شهود نمی‌کند. و اگر در صف با مأموم باشد، به دلیل وحدانیت مأموم، امام مجموع احدیت و احدیت مجموع را شهود می‌کند، یا مأموم فقط مجموع احدیت را شهود می‌کند. پس مکانت او را از تو متمایز کرده است، به دلیل تبعیت تو از او و اقتدای تو به او. اگر با او مخالفت کند، پس ناصیه (پیشانی) مأموم در دست شیطان است، و شیطنت همان دوری است و نماز نزدیکی است. پس این نزدیکی در عین دوری و دوری در عین نزدیکی است. پس این مأموم مجموع احدیت را شهود نکرده است، زیرا نه از نظر مکان و نه از نظر مکانت مأموم نیست. و اگر چنین باشد، امام در حال مخالفت مأموم با او، جز احدیت را مشاهده نمی‌کند، زیرا به دلیل از بین رفتن مأمومیت، در صفی قرار ندارد. پس امام در این حال، با توجه به حال این مأموم، مانند کسی است که تنها نماز می‌خواند، و با توجه به کسانی از فرشتگان که پشت سر او نماز می‌خوانند، امام است. و فرشتگان جز پشت سر او صف نمی‌کشند. و فرشتگان نزد پروردگارشان صف می‌کشند، و در این حال نزد امامی هستند که با او نماز می‌خوانند، در حالی که پیوسته نزد پروردگارشان بوده‌اند. پس امام خلیفه است و فرشتگان بر او سجده کردند، و امام برای خدا سجده می‌کند. پس خدا قبله امام است و امام قبله فرشتگان. و جبرئیل (ع) پیامبر (ص) را امامت نکرد مگر برای اینکه نماز را عملاً به او بیاموزد. پس او را از نظر مکانت امامت کرد نه مکان؛ زیرا تنها با او نماز خواند و از او جلوتر نایستاد. پس تعداد نمازها در اوقاتشان و هیئت آن‌ها را به کامل‌ترین وجه به او آموخت. سپس به او امر کرد که اگر در جماعت بود، از نظر مکان از آن‌ها جلوتر بایستد. و هر کس گمان کند که جبرئیل نیز از نظر مکان جلوتر ایستاد، این تنها به این دلیل بود که خداوند پرده را از دید پیامبر (ص) برداشت و او فرشتگان را دید و جماعت را مشاهده کرد، پس پشت سر جبرئیل با آن‌ها صف بست. اما در حالت پوشیدگی، چنین نبود. و به همین دلیل پیامبر (ص) با یک مرد تنها نماز خواند و او را در یک صف در سمت راست خود قرار داد، زیرا آن شخص فرشتگان را مشاهده نمی‌کرد. پس امام حکم مأموم را رعایت کرد. و تو در کنار طور نبودی آنگاه که خدا موسی را ندا داد، و نه در جانب غربی آنگاه که امر را به موسی قضا کرد، و مَا كُنْتَ مِنَ الشَّاهِدِينَ (و تو از شاهدان نبودی). همچنین تو با رسول خدا (ص) نبودی آنگاه که جبرئیل او را در نمازهای پنج‌گانه امامت کرد، و مَا كُنْتَ مِنَ الشَّاهِدِينَ (و تو از شاهدان نبودی). و مَا شَهِدْنَا إِلَّا بِمَا عَلِمْنَا وَمَا كُنَّا لِلْغَيْبِ حَافِظِينَ (و ما جز به آنچه دانسته‌ایم شهادت نداده‌ایم و ما نگهبان غیب نبوده‌ایم). و حکم کسی که امور را مشاهده کرده، مانند حکم کسی نیست که آن‌ها را جز از طریق اعلام مشاهده نکرده است. پس برای \"عیان\" (مشاهده) حالی است که جز صاحب عیان نمی‌تواند آن را بشناسد، همان‌گونه که برای علم حالی است که جز صاحبان علم آن را نمی‌شناسند و برای غیر آن‌ها در آن ذوقی نیست. رَبِّ أَرِنِي كَيْفَ تُحْيِ الْمَوْتَى (پروردگارا، به من نشان ده چگونه مردگان را زنده می‌کنی)؛ رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ (پروردگارا، به من نشان ده تا به تو بنگرم).\n\nاما برای عیان (مشاهده) معنایی لطیف است،\nاز این رو کلیم [موسی] درخواست معاینه کرد.\n\nو سجده فرشتگان برای بنی‌آدم در هر نماز همچنان باقی است، همان‌گونه که برای پدرشان آدم سجده کردند. پس تا زمانی که نمازگزاری در میان بنی‌آدم باشد که «الله، الله» بگوید، خلافت در بنی‌آدم باقی است؛ زیرا امر و شأن الهی هنگامی که در دنیا واقع شود، حکمش تا روز قیامت برداشته نمی‌شود. و سجده فرشتگان برای آدم واقع شد، پس سجده آن‌ها برای ذریه او پشت سر هر نمازگزاری تا روز قیامت باقی ماند. همان‌گونه که آدم فراموش کرد، ذریه‌اش فراموش کردند؛ همان‌گونه که آدم انکار کرد، ذریه‌اش انکار کردند؛ همان‌گونه که قابیل، هابیل را به ظلم کشت، قتل ظالمانه در بنی‌آدم تا روز قیامت باقی ماند، و بر [قاتل] اول سهمی از آن است، همان‌گونه که برای اولی در خیر نیز نصیبی از هر کس که آن را انجام دهد هست. فَمَنْ سَنَّ سُنَّةً حَسَنَةً فَلَهُ أَجْرُهَا وَأَجْرُ مَنْ عَمِلَ بِهَا إِلَى يَوْمِ الْقِيَامَةِ وَمَنْ سَنَّ سُنَّةً سَيِّئَةً فَعَلَيْهِ وِزْرُهَا وَوِزْرُ مَنْ عَمِلَ بِهَا إِلَى يَوْمِ الْقِيَامَةِ (هر کس سنت نیکویی را بنا نهد، پاداش آن و پاداش هر کس که تا روز قیامت به آن عمل کند برای اوست، و هر کس سنت بدی را بنا نهد، گناه آن و گناه هر کس که تا روز قیامت به آن عمل کند بر عهده اوست). و آن‌ها کسانی هستند که أَثْقَالَهُمْ وَأَثْقَالًا مَعَ أَثْقَالِهِمْ (بارهای خود و بارهایی همراه با بارهای خود) را حمل می‌کنند. پس هر نمازگزاری امام فرشتگان است و فرشتگان پشت سر او برایش سجده می‌کنند. جز اینکه فرق میان اصل و فرع، یعنی آدم و ذریه‌اش، این است که فرشتگان برای سجده بنی‌آدم در قرائت و نماز سجده می‌کنند، اما برای آدم سجده متعلم برای معلم بود. پس در سجده مشترک بودند و در سبب اختلاف داشتند. و مقصود ما این بود که بیان کنیم که سجده فرشتگان پشت سر بنی‌آدم برداشته نشده است و امامت از آدم تا آخرین نمازگزار برداشته نشده است، و فرشتگان تابع این امام هستند، همان‌گونه که مقرر کردیم. پس ما در حال امامت خود نزد خدا هستیم، و فرشتگان در این حال به واسطه اقتدا نزد ما هستند، پس آن‌ها نزد پروردگارشان هستند، زیرا امام نزد اوست، پس فرشتگان نزد او هستند چون نزد امام هستند. و هر صفی امام کسی است که پشت سر اوست، هر چقدر که باشد. و این گفته من:\n\nعِندیت (عندية) رب معقول است،\nو عِندیت \"هو\" (الهو) تعقل نمی‌شود.\n\nو عِندیت الله مجهول است،\nو عِندیت خلق مجهول نیست.\n\nو آن دو [عِندیت حق و خلق] ظرفیت نیستند،\nو برای آن [ظرفیت] جز این محمل دیگری نیست.\n\n[توضیح: ضمیر «لها» به ظرفیت بازمی‌گردد و ضمیر «هما» به عِندیت حق و خلق.]\n\n### عِندیت (عندية) نسبتی است که امری وجودی نیست\n\nو بدان که عِندیت (عندية) نسبتی است که امری وجودی نیست؛ زیرا نسبت‌ها امور عدمی هستند که حکمشان ثابت و عینشان معدوم است. و ان‌شاءالله در احوال اقطاب، در مورد کسی که ورد زبانش مَا عِنْدَكُمْ يَنْفَدُ (آنچه نزد شماست تمام می‌شود) و وَمَا عِنْدَ اللَّهِ بَاقٍ (و آنچه نزد خداست باقی است) باشد، در همین کتاب سخن خواهد آمد. و اینکه گفتیم عِندیت الله مجهول است، به این دلیل است که خداوند، بما هو الله (به اعتبار اینکه او خداست)، هیچ اسمی از اسماء الهی در او بدون اسم دیگر تعین نمی‌یابد، زیرا او عین مجموع اسماء است و جز احوال، او را تخصیص نمی‌دهد. پس هر کس بگوید: «یا الله، برای من چنین کن»، حال او تخصیص می‌دهد که کدام اسم را از میان اسمایی که در اسم «الله» مندرج است، اراده کرده است. به همین دلیل درباره او گفته می‌شود که او در عین اطلاق، مقید است؛ یعنی احوال او را به آنچه از اسماء مندرج در آن می‌طلبد، مقید می‌سازد، و از حیث انتفای احوال، مطلق است. پس او اسمی است که پذیرای هر اسمی است، همان‌گونه که هیولای کل پذیرای هر صورتی است. و عِندیت رب (الرب) نزدیک به این است، جز اینکه فرق میان آن دو این است که رب هرگز نیامده مگر به صورت مضاف. پس هر کس نزد او باشد، نزد کسی است که رب به او اضافه شده است، و رب جز به کونی از اکوان اضافه نمی‌شود. و عِندیت خلق معلوم است، پس عِندیت رب معقول است. اما عِندیت \"هو\" (الهو)، زیرا \"هو\" ضمیر غایب است و بر غایب تا زمانی که در حالت غیبت است، حکمی جاری نمی‌شود؛ زیرا دانسته نمی‌شود که در چه حالی است تا شهود شود. و اگر شهود شود، دیگر \"هو\" نیست، زیرا غیبت از او زائل شده است. آیا نمی‌بینی که به ساکت تا زمانی که سخن نگوید، امری یا مذهبی نسبت داده نمی‌شود؟ و به همین دلیل با سکوتش وارد اجماع نمی‌شود. این مسئله اختلافی است و صحیح همان است که گفتیم، همان‌گونه که ترک انکار، حجت نیست مگر در بقای آن امر بر اصلی که در فرموده خداوند متعال به آن تصریح شده است: خَلَقَ لَكُمْ مَا فِي الْأَرْضِ جَمِيعًا (آنچه در زمین است، همه را برای شما آفرید). و کلام بنی‌آدم از جمله چیزهایی است که در زمین آفریده شده و همه افعال آن‌ها نیز چنین است. پس اگر امری را ببینیم که در حضور رسول خدا (ص) گفته یا انجام شده و ایشان آن را انکار نکرده‌اند، نمی‌گوییم که حکم آن اباحه است؛ زیرا ایشان در مورد آن حکمی نداده‌اند، چرا که محتمل است چیزی در مورد آن بر ایشان نازل نشده باشد، و ایشان جز به آنچه خدا به ایشان وحی کرده حکم نمی‌کنند. پس آن امر بر اصل خود باقی می‌ماند، که همان تصرف طبیعی است که این نشأت آن را می‌طلبد، بدون تعیین حکمی از احکام پنج‌گانه بر آن، و این همان اصل اول است. یا آن را به اصل دوم باز می‌گردانیم که فرموده خداوند متعال است: خَلَقَ لَكُمْ مَا فِي الْأَرْضِ جَمِيعًا (آنچه در زمین است، همه را برای شما آفرید). و این نص صریح در اباحه نیست، بلکه ظاهر است؛ زیرا حکم محظور (حرام) آفریده شده است، یعنی حکم آن به خاطر ما نازل شده است، به عنوان آزمایشی از جانب خدا که آیا از آن پرهیز می‌کنیم یا نه، همان‌گونه که وجوب، ندب (استحباب)، کراهت و اباحه نازل شده است. پس اصل این است که حکمی نیست، و این همان اصل اول است که نظر صحیح اقتضا می‌کند. و این منزل از علوم، شامل علم \"حمد السواء\" (ستایش برابری) و تفصیلات آن است؛ زیرا هر دو طرف و واسطه را در بر گرفته و آن را به عالمیان اضافه کرده و عالمی را از عالم دیگر تخصیص نداده است. پس در یک طرف در ابتدای فاتحة الکتاب فرمود: الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (ستایش از آن خداست که پروردگار جهانیان است). و این تحمید را میان رحمت مرکب قرار داد، زیرا الرَّحْمَنِ الرَّحِيمِ (بخشنده مهربان) بر آن مقدم شد و الرَّحْمَنِ الرَّحِيمِ بعد از آن آمد. پس عالم میان دو رحمت قرار گرفت، آغازش مورد رحمت است و سرانجامش به رحمت می‌انجامد. و در وسط سوره یونس در وصف اهل بهشت آمده است که آخرین دعایشان أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (که ستایش از آن خداست که پروردگار جهانیان است) می‌باشد. و در سوره صافات، وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (و ستایش از آن خداست که پروردگار جهانیان است) بعد از فرموده وَسَلَامٌ عَلَى الْمُرْسَلِينَ (و سلام بر فرستادگان) آمده است، که آن‌ها مورد رحمت و سلامت هستند. و ستایش خدا، پروردگار عالمیان، پس از نصرت و پیروزی او در خیبر، حمد نعمت است. پس حمد نعمت در اول سوره، وسط آن و آخر آن ظاهر شد و هر دو طرف و واسطه را در بر گرفت. آیا این حمد در این مراتب، از حیث اینکه حمد مساوات است، یکسان است، یا به دلیل اختلاف دو طرف و وسط، مراتب آن متفاوت است؟ و کدام مرتبه در آن بالاتر است، یکی از دو طرف یا وسط؟ و حمد اول از عالمیان، وسط و آخر برای کیست؟ همه این‌ها علمی است که خداوند به علمای بالله می‌دهد، کسانی که يَخْشَوْنَهُ وَلَا يَخْشَوْنَ أَحَدًا إِلَّا اللَّهَ (از او می‌ترسند و از هیچ‌کس جز خدا نمی‌ترسند). و در آن علم مراتب ملکی و بشری است، و آیا مراتب آن‌ها یکسان است یا کدام مراتب بالاتر است، مراتب بشر یا مراتب فرشتگان، یا برای هر صنفی از آن‌ها مراتبی است که بر مراتب دیگری برتری دارد؟ و در آن علم جلب منافع است، و آیا ضررها در دل خود منافعی دارند یا نه، و تعیین منافع. و در آن علم اتباع در الهیات است، آیا تابع در آن از ذکر پیروی می‌کند یا از فکر؟ و در آن علم \"توحید اضافه\" است نه \"توحید اطلاق\"، و آیا توحید دو نوع است یا نه؟ یعنی توحید ذات و توحید اله در الوهیت، و هر یک از این توحیدها با چه چیزی درک می‌شود؟ و در آن علم نسبت خدا به اشیاء است، آیا عین نسبت اشیاء به خداست یا متفاوت است؟ و در آن علم این است که آیا شیء واحد وجوه متعددی دارد یا شیء واحد جز یک وجه ندارد، و اگر چنین باشد، چه چیزی از آن صادر می‌شود؟ و در آن علم فرق میان \"رمی الهی\" و \"رمی کونی\" است. و در آن علم \"دیمومت\" (پیوستگی) است. و در آن علم \"اختلاس\" (ربودن) است و حکم آن در \"مختلَس\" (ربوده‌شده) و \"مختلِس\" (رباینده) چیست؟ و اینکه التفات در نماز، اختلاسی است که شیطان از نماز بنده می‌رباید. و در آن علم آنچه عالم از خلق دارد. و در آن علم اجتماع دو خالق بر یک مخلوق است، آیا هر یک از آن‌ها همان چیزی را داده که دیگری داده است یا احکام آن‌ها در خلق آن متفاوت است، و در چه چیزی اختلاف کرده‌اند و در چه چیزی اجتماع؟ و در آن علم مدارا با جاهل در حال و مهلت دادن به او برای بازگشت از جهلش است. و در آن علم نطق جاهل است، آیا حکم آن در اصابت، مانند حکم نطق عالم است، هرچند جاهل مقامی را که از آن نطق کرده نداند یا نه؟ و اصابت او که عالم آن را خطا می‌بیند، پس عالم با جاهل در جهل به مقامی که جاهل از آن نطق کرده برابر می‌شود. و فرق میان کسی که این را می‌داند و کسی که از علما نمی‌داند چیست؟ و حکم عالمی که این را می‌داند چیست؟ و در آن علم تأثیر واحد در کثیرین است، با وجود احدیتش از کجا تأثیر کرده است؟ و در آن علم \"فصل\" و \"وصل\" است. و در آن علم جمع صفت برای مختلفین است، با چه حقیقتی آن‌ها را جمع می‌کند؟ و در آن علم هدایت به سوی ضلالت است. و در آن علم \"مواقف\" و \"قول\" است، و آیا برای رضایت مواقفی هست، همان‌گونه که برای قهر هست یا نه؟ و مواقف قیامت چند تاست؟ و آیا مواقف اهل الله مانند مواقف نفری (عارف مشهور) محدود است یا محدود نیست، یا از یک جهت محدود و از جهتی محدود نیست؟ و چرا وقوف وجود دارد، و آیا وقوف سکون است یا پیوسته در وقوف خود در حال انتقال است؟ و در آن علم فرق میان اهل اسلام و اهل استسلام (تسلیم محض) است. و در آن علم طلب علم از هستی (الکون) است. و در آن علم آنچه اعتراف به حق (الحق) در هر موطنی می‌دهد، و آیا برای صاحبش از هر جهت نافع است یا نه؟ و آنچه شایسته اعتراف است و آنچه شایسته اعتراف نیست. و در آن علم \"علم نافع\" است. و در آن علم ابزارهای معانی است، آنچه مرکب است و آنچه غیر مرکب. و در آن علم آنچه انسان را متنعم می‌سازد و آنچه او را عذاب می‌دهد، و اینکه هیچ چیزی از خدا در کسی نیست. و در آن علم \"خطوط\" و \"حدود الهی\" است، و اینکه آن‌ها نشان‌دار هستند و با هم مخلوط نمی‌شوند، و آن‌ها به محل‌های خود داناترند تا محل‌هایشان به آن‌ها؛ زیرا محل‌های آن‌ها برای خودشان معلوم است، اما آن‌ها برای محل‌های خود معلوم‌المکان نیستند. و در آن علم نعمت‌هایی است که آلام را برطرف می‌کنند و فرق میان آن‌ها و نعمت‌هایی که دردی را برطرف نمی‌کنند. و در آن علم \"اُنس به مِثل\" است، و آیا اُنس به خدا برای کسی که بر صورت آفریده شده واقع می‌شود، یا از حقیقت کون او بر صورت این است که به خدا اُنس نمی‌گیرد، همان‌گونه که خدا به او اُنس نمی‌گیرد؟ و آیا عالم به طور کلی این حکم را دارد یا نه؟ و آیا انسانی که مانند سایه برای حق (الحق) است، حکمش مانند حکم انسان کامل (الإنسان الکامل) خلیفه است که جزئی از آن انسان شبیه به سایه است یا نه؟ و در آن علم التذاذ به نغمه‌هایی است که بر اغیار واقع می‌شود، آیا این از کمال التذاذ مطلوب است یا نقصانی در کسی است که از آن لذت می‌برد؟ و در آن علم \"نفس\" در این فرموده است: «از قلبت فتوا بخواه، هرچند مفتیان به تو فتوا دهند.» زیرا در اینجا لطفی الهی در اعلام وجود دارد که خداوند آن را بر زبان رسولش (ص) جاری ساخت، و خبر داد که خداوند در قلب جز آنچه حق است و سعادت انسان در آن است، نمی‌افکند. پس اگر در این مورد به نفس خود رجوع کند، رستگار شده است. و این معنای سخن برخی از عارفان این مقام است که گفت: «چیزی برای من آسان‌تر از ورع ندیدم؛ هرگاه چیزی در نفسم خلجان می‌کرد، آن را ترک می‌کردم.» و در آن علم تعظیم آنچه از احوال در قرائن تعظیم می‌شود. و در آن علم آنچه شایسته است بر آن مداومت شود. و در آن علم \"مفاضله\" (برتری دادن) در احوال است، بدون نظر به صاحبان آن احوال که آن احوال به آن‌ها قائم است. و در آن علم به \"ماهیات\" است. و در آن علم تشابه دو صورت و اختلاف حکم است. و در آن علم حکمت ایجاد امامان در عالم است، چه گمراه‌کنندگان و چه غیر گمراه‌کنندگان. و در آن علم \"ندا\" هنگام بلاست، و چرا به آن اختصاص یافته و نه به نعمت‌ها؟ و در آن علم اجابت دعا کنندگان و سائلان است، آیا اجابت‌کننده بر مطابقت با آنچه سؤال در آن واقع شده می‌افزاید یا نه؟ و اگر بیفزاید، آیا آن اجابت سؤال حال است، زیرا در آنجا نطقی نبوده است؟ و در آن علم ارتباط عالم علوی با سفلی برای افاده و ارتباط سفلی با علوی برای استفاده است، و افاده‌کننده همیشه بالاتر است و استفاده‌کننده همیشه پایین‌تر، و برای مساحت و بلندی مکان حکمی نیست. و در آن علم تأثیر محجوب در کسی است که برای او مکشوف شده، از چه جهتی در او تأثیر کرده است با وجود علو مرتبه‌اش، و اینکه حق (الحق) او را یاری می‌دهد، و عقوبت آن تأثیرکننده چیست؟ و در آن علم \"اسفار\" (سفرها) است. و در آن علم کسی است که با عدم قدرت به حلم وصف شده، در حالی که حلیم جز کسی که بر کسی که بر او حلم می‌ورزد قادر باشد، نیست. و در آن علم اثر خیال در حس است و حکم آن تا کجا می‌رسد؟ و در آن علم حکم مراتب بر صاحبان آن‌ها به آنچه ناخوش دارند. و در آن علم \"قیمت اشیاء\" است، و برای آن‌ها حضرتی خاص است، و اینکه هیچ چیزی نیست مگر آنکه قیمتی دارد، جز انسان کامل (الإنسان الکامل) که قیمتش پروردگار اوست. و در آن علم آنچه صدق به بار می‌آورد و مراتب صادقین است، و اینکه از صدقشان سؤال می‌شوند. و در آن علم حضرات برکات الهی است. و در آن علم مراتب ظلم است، و آنچه از آن ستوده و آنچه نکوهیده است. و در آن علم اشتراک در امر است، آیا حکم آن امر در هر یک از شرکا یکسان است یا حکم با وجود اشتراک در امر، به دلیل اختلاف احوال و استعدادهای شرکا متفاوت است؟ و در آن علم صورت \"حضرة اجتماع خصوم\" در برابر حاکم است. و در آن علم ملحق کردن اناث به ذکور است. و در آن علم \"قرعه\" است و در کجا به آن حکم می‌شود. و فرموده پیامبر (ص): «اگر مردم می‌دانستند که در اذان و صف اول چه [فضیلتی] است، و راهی جز قرعه کشیدن برای آن نمی‌یافتند، حتماً قرعه می‌کشیدند. و اگر می‌دانستند که در تهجیر (شتاب به نماز ظهر) چیست، به سوی آن سبقت می‌گرفتند. و اگر می‌دانستند که در نماز عشاء و صبح چیست، حتماً به سوی آن دو می‌آمدند، هرچند با سینه خیز رفتن باشد.» و در آن علم \"ظلمات\" است، و اینکه حقیقت ظلمت به چه چیزی باز می‌گردد، آیا به امری وجودی یا عدمی؟ و در آن علم فضیلت تنزیه بر سایر محامد است. و در آن علم شفقت بر جنین هنگام خروج و مدارا و رحمت به اوست. و فرموده پیامبر (ص): «از ما نیست کسی که به کوچک ما رحم نکند.» و در آن علم \"یقین\" و \"شک\" است، و آیا صاحب یقین به شک در آنچه بر آن یقین دارد متصف می‌شود یا نه؟ و در آن علم انفراد حق (الحق) به علم حق است. و در آن علم آنچه شایسته است به خدا نسبت داده شود. و در آن علم کسی است که در طبع او امری است که از حکم طبعش زائل نمی‌شود، و اگر عارضی برای زوال آن پیش آید، زوالش دائمی نیست و طبع غالب است. و در آن علم تغییر احوال بر فرشتگان است، این امر از کجا برای آن‌ها حاصل شده است؟ و در آن علم \"عنایت\" و طبقات عالم در آن است. و در آن علم \"أناة\" (آهستگی) و \"عجله\" (شتاب) است. و در آن علم عموم بشارت و خصوص انذار است. و غیر از این‌ها از علومی که ذکر آن‌ها به درازا می‌کشد. پس ما قصد کردیم که مهم‌ترین آن‌ها را ذکر کنیم. وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را می‌نمایاند)."
  },
  "page_count": 6
}