{
  "id": 333,
  "title": {
    "ar": "الباب الثالث والثلاثون وثلاثمائة في معرفة منزل خلقت الأشياء من أجلك وخلقتك من أجلي فلا تهتك ما خلقت من أجلي فيما خلقت من أجلك وهو من الحضرة الموسوية",
    "en": "Chapter 333: Concerning the Gnosis (معرفة) of the Station (منزل): 'I created things for your sake, and I created you for My sake. Therefore, do not violate that which I created for My sake by means of that which I created for your sake.' And it is from the Mosaic Presence (الحضرة الموسوية).",
    "ur": "باب تین سو تینتیس: اس منزل کی معرفت (المعرفۃ) کے بیان میں کہ میں نے اشیاء کو تیرے لیے پیدا کیا اور تجھے اپنے لیے پیدا کیا، پس تو اس چیز کی بے حرمتی نہ کر جسے میں نے اپنے لیے پیدا کیا ہے، اس چیز میں جسے میں نے تیرے لیے پیدا کیا ہے۔ اور یہ (منزل) الحضرة الموسوية (الحضرة الموسوية) سے ہے۔",
    "fa": "باب سیصد و سی و سوم در معرفت منزلتی که اشیاء برای تو خلق شدند و تو برای من خلق شدی، پس آنچه را که برای من خلق کردم در آنچه برای تو خلق کردم، هتک مکن؛ و این منزلت از حضرت موسوی است."
  },
  "content": {
    "ar": "## «الباب الثالث والثلاثون وثلاثمائة في معرفة منزل خلقت الأشياء من أجلك وخلقتك من أجلي فلا تهتك ما خلقت من أجلي فيما خلقت من أجلك وهو من الحضرة الموسوية»\n\n\n> إن النفوس لتجزى بالذي كسبت *** من كل خير ولا تجزى بما اكتسبت‏\n\n\n> ما الاكتساب بكسب إن علمت به *** جنيت من خير يوم الدين ما غرست‏\n\n\n### [أن الله تعالى خلق جميع من خلق في مقام الذلة والافتقار]\n\n\nاعلم أيدك الله أن الله تعالى خلق جميع من خلق في مقام الذلة والافتقار وفي مقامه المعين له فلم يكن لأحد من خلق الله من هؤلاء ترق عن مقامه الذي خلق فيه إلا الثقلين فإن الله خلقهم في مقام العزة وفي غير مقامهم الذي ينتهون إليه عند انقطاع أنفاسهم التي لهم في الحياة الدنيا فلهم الترقي إلى مقاماتهم التي تورثهم الشهود والنزول إلى مقاماتهم التي تورثهم الوقوف خلف الحجاب فهم في برزخ النجدين إِمَّا شاكِراً فيعلو وإِمَّا كَفُوراً فيسفل قال تعالى وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ ما قال إلا في العبادة فلما جعل العبادة بأيديهم وجعلها المقصود منه بخلقهم فمنهم من قام بما قصد له فكان طائعا مطيعا لأمر الله الوارد عليه بالأعمال والعبادة فإنه قال لهم اعبدون كما أخبر إِنَّنِي أَنَا الله لا إِلهَ إِلَّا أَنَا فَاعْبُدْنِي هذا أمر بعبادة وأَقِمِ الصَّلاةَ لِذِكْرِي هذا أمر بعمل والعمل ما هو عبادة فالعمل صورة والعبادة روحها فالعبادة مقبولة عند الله على كل حال اقترنت بعمل أو لم تقترن والعمل لغير عبادة لا يقبل على كل حال من حيث القاصد لوقوعه الذي هو النفس المكلفة لكن من حيث إن العمل صدر من الجوارح أو من جارحة مخصوصة فإنها تجزى به تلك الجارحة فيقبل العمل لمن ظهر منه ولا يعود منه على النفس الآمرة به للجوارح شي‏ء إذا كان العمل خيرا بالصورة كصلاة المرائي والمنافق وجميع ما يظهر على جوارحه من أفعال الخير الذي لم تقصد به النفس عبادة وأما أعمال الشر المنهي عنها فإن النفس تجزى بها للقصد والجوارح لا تجزى بها لأنه ليس في قوتها الامتناع عما تريد النفوس بها من الحركات فإنها مجبورة على السمع والطاعة لها فإن جارت النفوس فعليها وللجوارح رفع الحرج بل لهم الخير الأتم وإن عدلت النفوس فلها وللجوارح فإن النفوس ولاة الحق على هذه الجوارح والجوارح مأمورة مجبورة غير مختارة فيما تصرف فيه فهي مطيعة بكل وجه والنفوس ليست كذلك ومن النفوس من لم يقم بما قصد له فكان عاصيا مخالفا أمر الله حين أمره بالأعمال والعبادة فالطائع يقع منه العبادة في حالة الاضطرار والاختيار وإن لم يكن مطيعا من حيث الأمر بالعمل فإن كان مطيعا طائعا فقد فاز بوقوع ما قصد له في الخلق والأمر فإن لله الْخَلْقُ والْأَمْرُ تَبارَكَ الله رَبُّ الْعالَمِينَ وأما العاصي فلا تقع منه العبادة إلا في حال الاضطرار لا في حال الاختيار ويقع منه صورة العمل لا العمل المشروع له فهو مخالف‏\nلأمر الله فلم يقم بما قصد له من الخلق والأمر ولما خلق الله الثقلين في هذا المقام الذي قصده بخلقهم وهو أجلية الحق فرغهم لذلك حتى لا يقوم لهم حجة بالاشتغال بما به قوامهم فخلق الأشياء التي بها قوامهم خاصة من أجلهم ليتفرغوا لما قصد بهم فقامت عليهم حجة الله إذا لم يقوموا بما خلقوا له ثم إنه علم من بعضهم أنه يقوم له شبهة في السعي فيما خلق من أجله في حق الغير لما بلغه‏\n\n\nإن الله يقول جعت فلم تطعمني وقال لما قال له العبد يا رب وكيف تطعم وأنت رب العالمين فقال الله له أ لم تعلم أنه استطعمك فلان فلم تطعمه أ ما أنك لو أطعمته وجدت ذلك عندي‏\n\n\nفأنزل الحق نفسه منزلة ذلك الجائع فلما لاحت له هذه الشبهة قال نسعى في حق الغير وننتفع بما نسعى به بحكم التبع فقال الله له ما فهمت عني ما أُرِيدُ مِنْهُمْ من رِزْقٍ وما أُرِيدُ أَنْ يُطْعِمُونِ إِنَّ الله هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ لا أنتم فما بقيت لهم حجة بتمام الآية وأما اعتمادهم على ذلك الخبر فلا يقوم لهم به حجة عند الله فإنه لما خلق الأشياء من أجلك التي بها قوامك أعطاك إياها وأوصلها إليك ليكون بها قوامك ثم أفضل لبعضهم من ذلك ما يزيد على قوامهم ليوصله إلى غيره ليكون به قوام ذلك الغير ويحصل لهذا أجر أداء الأمانة التي أمنه الله عليها فذلك هو الذي عتبة الحق حيث استطعمه فلان وكان عنده ما يفضل عن قوامه فلم يعطه إياه فلم يلزم من هذا الخبر أن يسعى في حق الغير وهو المراد في تمام الآية في قوله ما أُرِيدُ مِنْهُمْ من رِزْقٍ وما أُرِيدُ أَنْ يُطْعِمُونِ ولما خلق الله الإنسان وأعطاه الجدل قال بعضهم لما استطعمني فلان وعندي ما يفضل عن قوامي فلو كان لهذا المستطعم أمانة عندي ما استطعت إمساكها فلذلك لم نطعمه فقيل له ما قيل لإبليس متى علمت أنه ليس له أبعد ما منعته أو قبل ذلك أعطاك الله علم الكشف أنه ليس لهذا أو عين لك صاحبه أو ما علمت أنه ليس له إلا بعد حصول المنع منك وانصرافه عنك فلا\n\n\nبد أن يقول بعد المنع علمت ذلك فيقال له بذلك أخذت فإن إبليس قال للحق أمرتني بما لم ترد أن يقع مني فلو أردت مني السجود لآدم لسجدت فقال الله له متى علمت أني لم أرد منك السجود بعد وقوع الإباية منك وذهاب زمان الأمر أو قبل ذلك فقال له بعد ما وقعت الإباية علمت أنك لو أردت السجود مني لسجدت فقال الله له بذلك أخذتك ولم يؤاخذ أحد إلا بالجهل فإن أهل العلم الذين طالعهم الله بما يحدثه من الكوائن في خلقه قبل وقوعها لا يؤاخذون على ما لم يقع منهم مما أمروا به بالواسطة أن يقع منهم فإنهم في عين القربة بالاطلاع وليس المراد بامتثال الأمر إلا القربة ومحل القربة ليس بمحل تكليف فإذا وقع من المقربين أعمال الطاعات فبشهود فإنهم على بينة من ربهم فهم عاملون من حيث شهودهم الأمر الإلهي من غير الواسطة التي جاءت به فهم بالصورة في الظاهر اتباع الأمر بالواسطة وفي الباطن أصحاب عين لا أتباع فالحاصل من هذا أنه من لم يغب عن عبوديته لله في كل حال فقد أدى ما خلق له وكان طائعا وسواء كان مطيعا أو مخالفا فإن العبد الآبق لا يخرجه إباقه عن الرق وإنما يخرجه عن لوازم العبودية من الوقوف بين يدي سيده لامتثال أوامره ومراسمه أ لا ترى اسم العبودية ينسحب عليه سواء كان مطيعا أو مخالفا كما يبقى اسم البنوة على الابن سواء كان بارا أو عاقا فالعبد الذي وفى ما خلق له لا يخلو أمره في نفسه من حالتين إما أن يكون مشهوده قيمته فهو يقوم في مقام قيمته فيصحبه الانكسار والتسليم والخضوع وإما أن يقام في حال الاعتزاز بسيده فيظهر عليه العجب بذلك والنخوة كعتبة الغلام لما زهى فقيل له في ذلك فقال وكيف لا أزهو وقد أصبح لي مولى وأصبحت له عبدا كما هو الأمر في نفسه ولكن الفضل في أن يكون ذلك الأمر مشهودا له فهاتان حالتان محمودتان تشهد كل واحدة منهما للعبد بأنه وفى بما خلق له وبقي أي الجالتين أولى بالعبد هل شهود القيمة أو الاعتزاز بالسيد فمن قائل بهذا ومن قائل بهذا والصحيح عندي عدم الترجيح في ذلك لما نذكره وذلك أن المقامات والمواطن تختلف فالموطن الذي يطلب ظهور الاعتزاز بالله لا ينبغي أن يظهر فيه العبد إلا بالاعتزاز بالله والموطن الذي يقتضي ويطلب بذاته شهود العبد قيمته لا ينبغي أن يظهر فيه هذا العبد إلا بشهود قيمته وقد احتج بعضهم في الاعتزاز بقوله تعالى فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ وبأمره تعالى فَفِرُّوا إِلَى الله وهذه حجة للفريقين فإنه قد يفر إلى الله لطلب الاعتزاز بالله وقد يفر إلى الله لتكون ذلته إلى الله وحاجته لا إلى غيره إذ هو مفطور على الحاجة والافتقار ولهذا قال بعد الأمر بالفرار إلى الله تعالى ولا تَجْعَلُوا مَعَ الله إِلهاً آخَرَ تفتقرون إليه بل فروا\nإلى الله في طلب حوائجكم منه التي فطرتم عليها وأما فرار موسى عليه السلام الذي علله بالخوف من فرعون وقومه فما كان خوفه إلا من الله أن يسلطهم عليه إذ له ذلك ولا يدري ما في علم الله فكان فراره إلى ربه ليعتز به فوهبه ربه حكما وعلما وجعله من المرسلين إلى من خاف منهم بالاعتزاز بالله وأيده بالآيات البينات ليشد منه ما ضعف مما يطلبه حكم الطبيعة في هذه النشأة فإن لها خورا عظيما لكونها ليس بينها وبين الأرواح التي لها القوة والسلطان عليها واسطة ولا حجاب فلازمها الخوف ملازمة الظل للشخص فلا يتقوى صاحب الطبيعة إلا إذا كان مؤيدا بالروح فلا يؤثر فيه خور الطبيعة فإن الأكثر فيه إجراء الطبيعة وروحانيته التي هي نفسه المدبرة له موجودة أيضا عن الطبيعة فهي أمها وإن كان أبوها روحا فللأم أثر في الابن فإنه في رحمها تكون وبما عندها تغذى فلا تتقوى النفس بأبيها إلا إذا أيدها الله بروح قدسي ينظر إليها فحينئذ تقوى على حكم الطبيعة فلا تؤثر فيها التأثير الكلي وإن بقي فيه أثر فإنه لا يمكن زواله بالكلية\n\n\n### [أن الطبيعة ولود لا عقم فيها]\n\n\nواعلم أن الطبيعة ولود لا عقم فيها ودود متحببة لزوجها طلبا للولادة فإنها تحب الأبناء ولها الحنو العظيم على أولادها وبذلك الحنو تستجلبهم إليها فإن لها التربية فيهم فلا يعرفون سواها ولهذا لا نرى أكثر الأبناء إلا عبيدا للطبيعة لا يبرحون من المحسوسات والملذوذات الطبيعية إلا القليل فإنهم ناظرون إلى أبيهم وهم المترحنون وليس علامتهم وعدم التنوع في الصور فإن التنوع في الصور كما هو لهم هو للطبيعية أيضا وإنما علامة المتروحنين على أنهم أبناء أبيهم تنزههم عن الشهوات الطبيعية وأخذهم منها ما يقيمون به نشأتهم كما\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم حسب ابن آدم لقيمات يقمن صلبه‏\n\n\nفهمتهم اللحوق بأبيهم الذي هو الروح الإلهي اليائي لا الامري وإنما قلنا اليائي لقوله ونَفَخْتُ فِيهِ من رُوحِي بياء الإضافة إليه لأنه فرق بين روح الأمر وبين روح ياء الإضافة فجعل روح الأمر لما يكون به التأييد وجعل روح الياء لوجود عين الروح الذي هو كلمة الحق المنفوخ في الطبيعة فحن حنين الولد إلى أبيه ليتأيد به على ما يطلبه من شهود الحق الخارج عن الروح والطبيعة من حيث ما هو غني عنهما لا من حيث ما هو متجل للأبناء منهما أو بهما أو فيهما كل ذلك له وهذا مطلب عزيز فإذا ناله وتقوى به أتى الشهوات بحكم الامتنان عليها نزولا منه إليها فهو يحكم بها على المشتهيات ما تحكم عليه شهوة في المشتهيات فهو مشتهي الشهوة وغيره تحت حكم الشهوة فصاحب هذا المقام يحدث عين الشهوة في نفسه قضاء وإجابة لسؤالات من يشتهي من عالمه الخاص به فينالون بتلك الشهوة ما يشتهون فيتنعم الروح الحيواني وهي ناظرة إلى ربها غير محجوبة قد تجلى لها في اسمه الخلاق وخلع عليها هذا الاسم ليتكون عنها ما تريد لا ما تشتهي فهذه هي النفوس الفاضلة الشريفة المتشبهة بمن هي له فتنظر إلى الطبيعة نظر الولد البار لأمه مع استغنائه عنها وفاء لحقها وإن الناس انقسموا في هذا الحكم أقساما فمنهم من عبد الله وفاء لحق العبودية فأقام نشأتها على الكمال فأعطاها خلقها ومنهم من عبد الله وفاء لحق الربوبية الذي تستحقه على هذا العبد فأقام نشأة سيادة خالقه عليه فأعطاها خلقها من غير نظر إلى نفسه كما كان الأول من غير نظر إلى سيادة سيده بما هو ظاهر كل نشأة لا بما هي في نفس الأمر لأن العبد لا تعمل له فيما تقتضيه الأمور لأنفسها ومنهم من عبده لإقامة النشأتين فأعطاهما خلقهما فأقام نشأة عبوديته ونشأة سيادة سيده وذلك في وجوده وعينه إذ هو محل لظهور هذه النشأة ومنهم من عبد الله لكونه مأمورا بالعبادة وما عنده خبر بإقامة هذه النشآت فعبده بلازم العبودية فعبادته عن أمر إلهي ما هي ذاتية ومنهم من أقامه الله في العبادة الذاتية فلم يحضر أمره إلا في العمل لا في العبادة ومنهم في عبده بهذه الوجوه كلها وهو أقوى القوم في العبادة والنشأة القائمة من مثل هذا العبد أتم النشآت خلقا فإن إقامة النشأة لا بد منها فإن كانت مقصودة للعبد أضيفت إليه وحمد عليها وإن لم تكن مقصودة للعبد العابد أقامها الحق تعالى وأضيفت إلى الله وحمد عليها مع ظهورها من العابد والقصد إلى إيجادها أولى من الغفلة عنها أو الجهل بها فمن الناس من يشهد ما ينشئ ومن الناس من لا يشهد ما ينشئ لأنه لا يعلم أنه ينشئ فيتولى الله إنشاءه على غير علم منه حتى تقوم صورة النشأة فيشهدها العابد حينئذ صادرة عنه فيحمد الله حيث ظهر منه مثل هذا فهم على طبقات في هذا الباب أعني باب العبادة وهكذا الحكم فيما ينشئ عنهم من صور الأعمال الظاهرة والباطنة هم فيها على طبقات مختلفة فمنهم الجامع للكل ومنهم النازل عن درجة الجمع‏\nثم اعلم أن الأحد لا يكون عنه شي‏ء البتة وإن أول الأعداد إنما هو الاثنان ولا يكون عن الاثنين شي‏ء أصلا ما لم يكن ثالث يزوجهما ويربط بعضهما ببعض ويكون هو الجامع لهما فحينئذ يتكون عنهما ما يتكون بحسب ما يكون هذان الاثنان عليه إما أن يكونا من الأسماء الإلهية وإما من الأكوان المعنوية أو المحسوسة أي شي‏ء كان فلا بد أن يكون الأمر على ما ذكرناه وهذا هو حكم الاسم الفرد فالثلاثة أول الأفراد وعن هذا الاسم ظهر ما ظهر من أعيان الممكنات فما وجد ممكن من واحد وإنما وجد من جمع وأقل الجمع ثلاثة وهو الفرد فافتقر كل ممكن إلى الاسم الفرد ثم إنه لما كان الاسم الفرد مثلث الحكم أعطى في الممكن الذي يوجده ثلاثة أمور لا بد أن يعتبرها وحينئذ يوجده ولما كان الغاية في المجموع الثلاثة التي هي أول الأفراد وهو أقل الجمع وحصل بها المقصود والغني عن إضافة رابع إليها كان غاية قوة المشرك الثلاثة فقال إن الله ثالث ثلاثة ولم يزد على ذلك وما حكى عن مشرك بالله أنه قال فيه غير ثالث ثلاثة ما جاء رابع أربعة ولا ثامن ثمانية وهكذا ظهرت في البسملة ثلاثة أسماء لما كان من أعطى التكوين يقول بِسْمِ الله الرَّحْمنِ الرَّحِيمِ والتكوين الإلهي عن قول كُنْ وهو ثلاثة أحرف كاف وواو ونون الواو بين الكاف والنون لا ظهور لها لأمر عارض أعطاه سكون النون وسكون الواو إلا أنه للنون سكون أمر فانظر سريان الفردية الأولية كيف ظهر في بروز الأعيان واعتبر فيما يتكون عنه ثلاثة أمورا جعلها حقوقا فمن أحضر من العابدين المنشئين صور أعمالهم وعباداتهم هذه الحقوق عند إرادتهم إنشاءها وأعطى كل ذي حق حقه في هذه النشآت كان أتم وأعلى درجة عند الله ممن لم يقصد ما قصده والصورة المنشأة فيها ثلاثة حقوق يقصدها الموجد الفرد الحق الواحد لله وهو ما يستحقه منها من التنزيه أو التسبيح بحمده وحق النفس الصورة من الاسم الفرد وهو إيجادها بعد أن لم تكن لتتميز في حضرة الوجود وتنصبغ به وتلحق بما هو صفة لخالقها وموجدها وهو الله وهذه الدرجة الأولى من درجات التشبه به للظهور في الوجود والانصباغ به والحق الثالث ما للغير في وجودها من المصلحة فتعطيه تلك النشأة حق ذلك الغير منها وهو مقصود لموجدها وذلك الغير صنفان الصنف الواحد الأسماء الإلهية فتظهر آثارها المتوقف ظهور تلك الآثار على وجود هذه العين والصنف الآخر ما فيها من حقوق الممكنات التي لا تكون لها إلا بوجود هذه الصورة المنشأة فيقصد المنشئ لها في حين الإنشاء هذه الأمور كلها فيكون الثناء الإلهي على هذا العابد بحسب ما أحضر من ذلك وما قصد فمنهم من يجمع هذا كله في صورة عبادته وصورة عمله فيسري التثليث في جميع الأمور لوجوده في الأصل ولهذا قال فيمن قال بالتثليث إنه كافر فقال لَقَدْ كَفَرَ الَّذِينَ قالُوا إِنَّ الله ثالِثُ ثَلاثَةٍ وما سماه مشركا فإنه ستر ما كان ينبغي له إذ قال به أن يبين صورته ولو أبان صورته لقال هذا الذي قلناه وتبين للسامع الحق في ذلك‏\n\n\nفلما ستر هذا البيان سماه كافرا لأنه ما من إِلهٍ إِلَّا إِلهٌ واحِدٌ وإن كانت له أحكام مختلفة ولا بد منها فلو لم يستر هذا الكافر وأبان لقال ما هو الأمر عليه وأما من يدعي أن الآلهة ثلاثة فذلك مشرك جاهل ونعوذ بالله أن يكون عاقل من المشركين فالعدد أحكام الواحد وقد جاء العدد في الأسماء الحسنى وجاء قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا من حيث دلالته على عين المسمى فَلَهُ أي لذلك المسمى الْأَسْماءُ الْحُسْنى‏ التي الله والرحمن منها من حيث ما هي أسماء لكن الأفهام قاصرة عن إدراك ما يريده الله في خطابه بأي لسان كان فهذا بعض ما في هذا المنزل قد ذكرناه فلنذكر ما يحوي عليه من العلوم النافعة على طريق الذكرى فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ فنقول والله يَقُولُ الْحَقَّ ويَهْدِي من يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ فمن ذلك علم أسماء التكوين وعلم حروف التكوين وعلم الأرواح المفرقة لا الجامعة وعلم الأمور الحاملة للأشياء ما يقصد بحملها ولمن تنتهي بالحمل إليه وعلم السعايات ما نهايتها وما المقصود بها من السعاة هل لنيل ما ليس‏\n\n\nعندهم أو لإيصال ما عندهم لمن يطلبه إما بذاته الذي هو الطلب الذاتي وإما بسؤال منه في ذلك فيعطيه هذا الساعي بتيسير وبريحة من سعيه إليه وكده ومشقته وعلم تفاصيل الأمور ولما ذا ترجع تفاصيلها وتقسيمها هل إلى الأصل وهو الأسماء الإلهية أو للقوابل وهي أعيان الممكنات أو للمجموع أي أمر كان من الأمور التي يطلبها التفصيل والتقسيم وعلم الجزاء وصدق الوعد دون الوعيد وعلم مدارج الملائكة والأرواح المفارقة المحمولة في الصور الجسدية وعلم الخلاف من علم الاتفاق وفيما ذا\nينبغي الاتفاق وفيما ذا ينبغي الاختلاف وهل للاختلاف وجه إلى الموافقة أم لا وعلم السبب الذي منه تنبأ من ليس بنبي وهو المتنبئ وعلم سبب السهو في العالم وعلم الفتن والملاحم وعلم صورة الأخذ من الله كيف يكون على الكشف وما أنتجه في الآخذين من أعمالهم في زمان التكليف وعلم المسامرة بعد إعطاء الحقوق وعلم الستر والتجلي في بعض المواطن وعلم أداء الحقوق ومن يؤدي بعد طلب صاحب الحق حقه ومن يبادر به وعلم علامات اليقين وعلم أينيات الأشياء ويتميز كل أين بتميز الشيئية التي تطلبه وعلم التشبيه بين الأشياء للروابط التي تجمعها والوجوه وإن فرقتها أمور أخر فحكم الجامع لا يزول كما إن حكم الفارق لا يزول فإنه الحكم المقوم لذات الشي‏ء وعلم حقوق الزائرين وعلم سبب تقديم السلام على تقديم الطعام للضيف النازل وتقديم الطعام قبل الكلام وعلم ما يتعين على الضيف أن يقوله ويعرف به صاحب المنزل وما لا يتعين عليه وعلم الرسالة وظهور الملك في صورة البشر عند أداء الرسالة ما سببه في بعض الأحوال دون بعض وعلم الرسالة البشرية وعلم الأخذات الإلهية وعلم تأثير القوة هل يؤثر في قوى أو ضعيف مطلق أو ضعيف إضافي وعلم التمهيد والسياسات والنواميس والشرائع وعلم النتاج والإنتاج بين الزوجين وعلم ما طلب الحق من عباده على الإطلاق والعموم وعلى التقييد\n\n",
    "en": "Chapter 333: Concerning the Knowledge of the Station: 'I created things for your sake, and I created you for My sake, so do not violate that which I created for My sake by means of that which I created for your sake.' And it belongs to the Mosaic Presence (الحضرة الموسوية).\n\nIndeed, souls are rewarded for what they earned (كسبت)\nOf all good, but they are not rewarded for what they acquired (اكتسبت).\n\nAcquisition (الاكتساب) is not earning (كسب), if you know this,\nYou will reap on the Day of Judgment the good that you planted.\n\n### [That Allah Almighty created all those He created in the station (مقام) of lowliness (الذلة) and need (الافتقار)]\n\nKnow, may Allah strengthen you, that Allah Almighty created all those He created in the station of lowliness (الذلة) and need (الافتقار), and in the station specifically appointed for them. None of Allah’s creatures among these had any ascent (ترق) from the station in which they were created, except for the two weights (الثقلين)—Jinn and Mankind. Allah created them in the station of might (العزة) and in a station other than the one they will reach when their breaths cease in the life of this world. Thus, they have the potential to ascend to stations that grant them Witnessing (الشهود), or to descend to stations that cause them to stand behind the Veil (الحجاب). They are in the Isthmus (البرزخ) of the two paths: <<إِمَّا شاكِراً فيعلو وإِمَّا كَفُوراً فيسفل>> (Either grateful, so he ascends, or ungrateful, so he descends). Allah Almighty said: <<وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except that they should worship Me). He only mentioned worship (العبادة). Since He placed worship in their hands and made it the purpose of their creation, some of them fulfilled what was intended for them, becoming obedient (طائعا) and submissive (مطيعا) to the command of Allah that came to them concerning actions (الأعمال) and worship. For He said to them, \"Worship Me,\" as He informed: <<إِنَّنِي أَنَا الله لا إِلهَ إِلَّا أَنَا فَاعْبُدْنِي>> (Indeed, I am Allah. There is no deity except Me, so worship Me)—this is a command for worship—and <<أَقِمِ الصَّلاةَ لِذِكْرِي>> (Establish prayer for My remembrance)—this is a command for action. Action (العمل) is not worship. Action is the form (صورة), and worship is its spirit (روحها). Worship is accepted by Allah in every state, whether it is accompanied by action or not. Action without worship is not accepted in every state, from the perspective of the one intending its occurrence, which is the responsible soul (النفس المكلفة). However, from the perspective that the action originated from the limbs (الجوارح) or a specific limb, that limb is rewarded for it, and the action is accepted for the one from whom it appeared. But nothing returns from it to the soul that commanded the limbs, if the action was good only in form, such as the prayer of the hypocrite (المنافق) or the one who shows off (المرائي), and all good deeds that appear on his limbs but were not intended by the soul as worship. As for evil actions (أعمال الشر) that are forbidden, the soul is rewarded for them due to the intention (القصد), but the limbs are not rewarded for them, because it is not in their power to abstain from the movements the souls desire from them, for they are compelled (مجبورة) to hear and obey the soul. If the souls transgress, the consequence is upon them, and the limbs are relieved of blame; rather, they receive the most complete good. If the souls act justly, the reward is for them and for the limbs. The souls are the governors (ولاة الحق) over these limbs, and the limbs are commanded, compelled, and not given choice in what they are used for; thus, they are obedient in every respect. The souls are not like that. Among the souls are those who did not fulfill what was intended for them, becoming disobedient (عاصيا) and opposing the command of Allah when He commanded them with actions and worship. The obedient one performs worship in the state of necessity (الاضطرار) and choice (الاختيار), even if he is not submissive from the perspective of the command for action. If he is both submissive and obedient, he has succeeded in fulfilling what was intended for him in creation and command, for <<لِلَّهِ الْخَلْقُ والْأَمْرُ تَبارَكَ الله رَبُّ الْعالَمِينَ>> (Indeed, to Allah belongs the creation and the command. Blessed is Allah, Lord of the worlds). As for the disobedient one, worship does not occur from him except in the state of necessity, not in the state of choice. And the *form* of the action occurs from him, but not the action prescribed for him. Thus, he opposes the command of Allah and has not fulfilled what was intended for him in creation and command.\n\nSince Allah created the two weights in this station which He intended by their creation—which is the manifestation of The Real (أجلية الحق)—He freed them for that purpose, so that they would have no excuse in being preoccupied with what sustains them. He created the things that sustain them specifically for their sake, so that they might devote themselves to what was intended for them. Thus, Allah’s proof (حجة) is established against them if they do not fulfill what they were created for. Then, He knew that some of them would encounter a doubt (شبهة) regarding striving for the sake of others (في حق الغير) in what was created for their own sake, due to the report that reached them:\n\nThat Allah says, \"I was hungry, and you did not feed Me.\" And when the servant said to Him, \"O Lord, how could I feed You when You are the Lord of the worlds?\" Allah said to him, \"Did you not know that so-and-so asked you for food, and you did not feed him? Know that if you had fed him, you would have found that with Me.\"\n\nThe Real (الحق) thus lowered Himself to the station of that hungry person. When this doubt appeared to the servant, he said, \"We will strive for the sake of others and benefit from what we strive for by way of consequence.\" Allah said to him, \"You did not understand from Me: <<ما أُرِيدُ مِنْهُمْ من رِزْقٍ وما أُرِيدُ أَنْ يُطْعِمُونِ إِنَّ الله هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ>> (I do not desire from them any provision, nor do I desire that they should feed Me. Indeed, Allah is the Provider, the Possessor of Strength, the Firm)—not you.\" Thus, no argument remained for them due to the completion of the verse. As for their reliance on that report, it does not establish a proof for them before Allah. For when He created things for your sake, which are the means of your sustenance, He gave them to you and delivered them to you so that they might sustain you. Then, He bestowed upon some of them a surplus beyond their sustenance so that they might deliver it to others, thereby sustaining those others, and the giver would receive the reward for fulfilling the trust (الأمانة) that Allah entrusted to him. That is why The Real reproached him when so-and-so asked him for food, and he had a surplus beyond his sustenance, but he did not give it to him. This report does not necessitate striving for the sake of others, which is the meaning intended in the completion of the verse where He says: <<ما أُرِيدُ مِنْهُمْ من رِزْقٍ وما أُرِيدُ أَنْ يُطْعِمُونِ>> (I do not desire from them any provision, nor do I desire that they should feed Me).\n\nWhen Allah created man and gave him the capacity for sophistry (الجدل), some of them said, \"When so-and-so asked me for food, and I had a surplus beyond my sustenance, if this beggar had a trust with me, I would not have been able to withhold it. Therefore, we did not feed him.\" It was said to him what was said to Iblis: \"When did you know that he did not have it? Was it after you withheld it, or before that? Did Allah give you the knowledge of Unveiling (الكشف) that this person did not have it, or did He specify his owner to you? Or did you only know that he did not have it after you withheld it and he turned away from you?\"\n\nHe must inevitably say, \"I knew that after withholding it.\" It will be said to him, \"By that, you were seized.\" Iblis said to The Real, \"You commanded me to do something that You did not want to occur from me. If You had wanted me to prostrate to Adam, I would have prostrated.\" Allah said to him, \"When did you know that I did not want you to prostrate? Was it after your refusal occurred and the time of the command had passed, or before that?\" He replied, \"After the refusal occurred, I knew that if You had wanted the prostration from me, I would have prostrated.\" Allah said to him, \"By that, I seized you.\" No one is taken to task except through ignorance (الجهل). As for the People of Knowledge (أهل العلم) whom Allah informs of the events (الكوائن) He creates in His creation before they occur, they are not taken to task for what did not occur from them of what they were commanded through an intermediary (الواسطة) to occur. For they are in the very essence of Proximity (عين القربة) through this knowledge, and the place of Proximity is not a place of obligation (تكليف). If acts of obedience occur from the proximate ones (المقربين), it is through Witnessing (شهود), for they are upon clear evidence from their Lord. They act from the perspective of their Witnessing of the Divine Command without the intermediary that brought it. Outwardly, they are followers of the command through the intermediary, but inwardly, they are possessors of direct vision (أصحاب عين), not followers. The conclusion of this is that whoever is not absent from his servitude (عبوديته) to Allah in every state has fulfilled what he was created for and was obedient, whether he was submissive or disobedient. For the runaway servant (العبد الآبق) is not removed from slavery by his running away; rather, it removes him from the necessary requirements of servitude, such as standing before his Master to fulfill His commands and ordinances. Do you not see that the name of servitude applies to him whether he is obedient or disobedient, just as the name of sonship remains upon the son whether he is dutiful or undutiful?\n\nThe servant who fulfills what he was created for has two states in himself: either his Witnessing (مشهوده) is his own worth (قيمته), so he stands in the station of his worth, and brokenness (الانكسار), submission (التسليم), and humility (الخضوع) accompany him; or he is established in the state of might (الاعتزاز) through his Master, so wonder (العجب) and pride (النخوة) appear upon him because of that, like the reproach of the youth when he became haughty, and when asked about it, he said, \"How can I not be haughty when I have acquired a Master, and I have become His servant?\"—as is the reality of the matter. But the excellence lies in that reality being witnessed by him. These are two praiseworthy states, each of which testifies that the servant has fulfilled what he was created for.\n\nThe question remains: which of the two states is more appropriate for the servant—Witnessing his worth or taking pride in his Master? Some hold one view, and some hold the other. The correct view, in my opinion, is the absence of preference (عدم الترجيح) in this matter, for the following reason: the stations (المقامات) and situations (المواطن) differ. The situation that demands the manifestation of might through Allah (الاعتزاز بالله) should only see the servant manifest might through Allah. And the situation that intrinsically requires and demands the servant to witness his worth should only see this servant manifest the witnessing of his worth. Some have argued for might by citing His saying: <<فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ>> (So I fled from you when I feared you), and His command: <<فَفِرُّوا إِلَى الله>> (So flee to Allah). This is an argument for both parties, for one may flee to Allah seeking might through Allah, or one may flee to Allah so that his lowliness and need (حاجته) are directed only to Him, not to others, since he is naturally disposed to need and poverty. This is why, after commanding flight to Allah Almighty, He said: <<ولا تَجْعَلُوا مَعَ الله إِلهاً آخَرَ>> (And do not set up with Allah another deity) to whom you turn in need. Rather, flee to Allah in seeking your needs from Him, upon which you were created. As for the flight of Moses (peace be upon him), which he explained by fearing Pharaoh and his people, his fear was only of Allah allowing them to prevail over him, since Allah has the power to do so, and Moses did not know what was in Allah’s knowledge. Thus, his flight was to his Lord to gain might through Him. His Lord granted him judgment (حكما) and knowledge (علما) and made him one of the Messengers to those he feared, with might through Allah. He supported him with clear signs (الآيات البينات) to strengthen what was weakened by the ruling of nature (الطبيعة) in this existence, for nature has a great weakness (خورا عظيما) because there is no intermediary or veil between it and the Spirits (الأرواح) which have power and dominion over it. Thus, fear clings to it like a shadow clings to a person. The possessor of nature is only strengthened when he is supported by the Spirit (الروح). Then the weakness of nature does not affect him, for the dominant factor in him is the operation of nature, and his spirituality, which is his governing soul (نفسه المدبرة), is also present from nature—it is its mother, even if its father is a Spirit. The mother has an effect on the son, for he is in her womb and is nourished by what she possesses. The soul is only strengthened by its Father when Allah supports it with a Holy Spirit (روح قدسي) that looks upon it. At that point, it gains strength over the ruling of nature, and nature does not affect it completely, although some effect remains, for its complete removal is impossible.\n\n### [That Nature is fertile, having no barrenness]\n\nKnow that Nature (الطبيعة) is fertile (ولود), having no barrenness (عقم). It is loving (ودود), seeking union with its spouse in pursuit of procreation, for it loves children (الأبناء) and has great affection (الحنو العظيم) for them. By this affection, it draws them to itself, for it is responsible for their upbringing (التربية). Thus, they know no other. This is why we see most children as slaves to Nature, never departing from the sensible things (المحسوسات) and natural pleasures (الملذوذات الطبيعية), except for a few who look to their Father—these are the spiritualized ones (المتروحنون). Their sign is not the absence of variety in forms, for variety in forms belongs to them just as it belongs to Nature. Rather, the sign of the spiritualized ones, that they are the children of their Father, is their transcendence of natural desires (الشهوات الطبيعية) and their taking from them only what sustains their existence, as the Prophet (peace and blessings be upon him) said: \"Sufficient for the son of Adam are a few morsels that keep his back straight.\"\n\nTheir concern is to join their Father, who is the Divine Spirit (الروح الإلهي), the Spirit of *Ya'* (اليائي), not the Spirit of Command (الأمري). We say the Spirit of *Ya'* because of His saying: <<ونَفَخْتُ فِيهِ من رُوحِي>> (And I breathed into him of My Spirit), with the possessive *Ya'* (ياء الإضافة) referring to Him. He differentiated between the Spirit of Command and the Spirit of the possessive *Ya'*. He made the Spirit of Command for that by which support is granted, and He made the Spirit of *Ya'* for the existence of the very essence of the Spirit (عين الروح), which is the Word of The Real (كلمة الحق) breathed into Nature. So, the soul yearns (حن حنين) like a child for its Father, to be supported by Him in what it seeks: the Witnessing of The Real (الحق) who is external to the Spirit and Nature, from the perspective that He is independent of both, not from the perspective that He manifests Himself to the children from them, or by them, or in them—all of that belongs to Him. This is a precious goal.\n\nWhen the servant attains this and is strengthened by it, he approaches desires (الشهوات) by way of granting favor (الامتنان عليها), descending to them. Thus, he rules over the desired things by means of the desire, rather than desire ruling over him in the desired things. He is the one who desires the desire, while others are under the rule of desire. The possessor of this station brings the very essence of desire into existence within himself, fulfilling and answering the requests of those who desire from his own specific world. They attain what they desire through that desire, and the animal spirit (الروح الحيواني) is delighted. The soul is looking toward its Lord, unveiled, for He has manifested Himself to it in His Name, The Creator (الخلاق), and has bestowed this Name upon it so that what it *wills* (تريد) may come into existence through it, not what it *desires* (تشتهي). These are the virtuous and noble souls (النفوس الفاضلة الشريفة) that resemble the One to whom they belong. They look upon Nature with the gaze of a dutiful child toward his mother, while being independent of her, in fulfillment of her right.\n\nMankind is divided into sections regarding this ruling: Some worship Allah in fulfillment of the right of Servitude (حق العبودية), thus perfecting their own existence (نشأتها) and giving it its creation. Some worship Allah in fulfillment of the right of Lordship (حق الربوبية) which He deserves over this servant, thus establishing the existence of their Creator’s Lordship over them, giving it its creation without regard for themselves, just as the first type acted without regard for the Lordship of their Master, based on what is apparent in each existence, not what is in the reality of the matter, because the servant does not act for himself in what matters require for themselves. Some worship Him to establish both existences (النشأتين), giving both their creation, thus establishing the existence of his servitude and the existence of his Master’s Lordship, and that is in his own existence and essence, since he is the locus for the manifestation of this existence. Some worship Allah because they are commanded to worship, having no knowledge of establishing these existences. They worship Him by the necessary requirement of servitude, so their worship is based on a Divine Command (أمر إلهي), not intrinsic (ذاتية). And among them are those whom Allah established in intrinsic worship, so His command only appears in the action, not in the worship. And among them are those who worship Him through all these aspects, and he is the strongest of people in worship, and the existence established by such a servant is the most complete of existences in creation. For the establishment of existence is necessary. If it is intended by the servant, it is attributed to him and he is praised for it. If it is not intended by the worshipping servant, The Real Almighty establishes it, and it is attributed to Allah and He is praised for it, even though it appears from the worshiper. Intending its creation is better than being heedless of it or ignorant of it. Some people witness what they bring into existence, and some do not witness what they bring into existence because they do not know that they are creating. So, Allah takes charge of its creation without their knowledge until the form of the existence is established, and the worshiper then witnesses it originating from him, and he praises Allah for such a manifestation appearing from him. They are in different ranks in this chapter, meaning the chapter of worship. The same ruling applies to the forms of outward and inward actions that originate from them; they are in different ranks concerning them. Among them is the one who encompasses all, and among them is the one who falls short of the degree of comprehensive inclusion (الجمع).\n\nThen know that the One (الأحد) does not produce anything whatsoever. The first of the numbers is the Two (الاثنان). Nothing originates from the Two at all unless there is a Third (ثالث) that pairs them (يزوجهما) and connects them to one another, and is the comprehensive element (الجامع) for them. At that point, what is formed from them is formed, according to what these two are—whether they are Divine Names (الأسماء الإلهية), or conceptual or sensible existents (الأكوان المعنوية أو المحسوسة)—whatever it may be, the matter must be as we have mentioned. This is the ruling of the Individual Name (الاسم الفرد). The Three (الثلاثة) is the first of the individuals (الأفراد), and from this Name, what appeared of the essences of the contingent beings (أعيان الممكنات) appeared. No contingent being was found from a single thing; rather, it was found from a collection, and the minimum collection is three, which is the Individual. Thus, every contingent being is in need of the Individual Name.\n\nSince the Individual Name has the ruling of threeness (مثلث الحكم), it grants three necessary considerations to the contingent being it brings into existence, and only then does it bring it into existence. Since the maximum of the collection is the Three, which is the first of the individuals and the minimum of the plural, and the intended purpose is achieved by it, making it independent of adding a fourth to it, the maximum strength of the polytheist (المشرك) was the Three. Thus, he said, \"Indeed, Allah is the third of three\" (إن الله ثالث ثلاثة), and he did not exceed that. No report has come down about a polytheist who said anything other than \"the third of three,\" such as \"the fourth of four\" or \"the eighth of eight,\" and so on.\n\nSimilarly, three Names appeared in the *Basmala* (بسم الله الرحمن الرحيم) when the one who grants formation says: *In the Name of Allah, the Most Compassionate, the Most Merciful*. And the Divine Formation (التكوين الإلهي) is through the saying *Kun* (كُنْ - Be!), which has three letters: Kāf, Wāw, and Nūn. The Wāw is between the Kāf and the Nūn, having no manifestation due to an accidental matter granted by the quiescence of the Nūn and the quiescence of the Wāw, except that the Nūn has the quiescence of command.\n\nObserve how the primary individuality (الفردية الأولية) permeates and appears in the emergence of the essences. Consider that three matters are formed from it, which He made into rights (حقوق). Whoever among the worshipers who create the forms of their actions and worship attends to these rights when intending their creation, and gives every possessor of a right his due in these existences, is more complete and higher in degree before Allah than one who did not intend what he intended.\n\nThe created form contains three rights intended by the Singular, Individual, True Creator (الموجد الفرد الحق الواحد لله):\n1.  The right of Allah: What He deserves from it, such as transcendence (التنزيه) or glorification with His praise (التسبيح بحمده).\n2.  The right of the Form/Soul (حق النفس الصورة) from the Individual Name: Which is its creation after it was not, so that it may be distinguished in the Presence of Being (حضرة الوجود) and be colored by it (تنصبغ به), thus joining what is an Attribute of its Creator and Originator, who is Allah. This is the first degree of resemblance to Him (التشبه به) for the sake of manifestation in Being and being colored by it.\n3.  The right of the Other (حق الغير) in its existence: The benefit others derive from its existence. The created existence gives the right of that Other from it, and this is intended by its Creator. This \"Other\" is of two types:\n    a.  The Divine Names (الأسماء الإلهية): Whose effects depend on the existence of this entity for their manifestation.\n    b.  The contingent beings (الممكنات): Whose rights are only fulfilled by the existence of this created form.\n\nThe Divine praise (الثناء الإلهي) upon this worshiper is according to what he attended to and intended of this. Among them is the one who combines all of this in the form of his worship and the form of his action, so the threeness (التثليث) permeates all matters due to its existence in the origin.\n\nThis is why He said concerning those who affirmed the Trinity (التثليث) that they are disbelievers (كافر), saying: <<لَقَدْ كَفَرَ الَّذِينَ قالُوا إِنَّ الله ثالِثُ ثَلاثَةٍ>> (They have certainly disbelieved who say that Allah is the third of three). He did not call him a polytheist (مشركا), for he concealed what he ought to have clarified when he said it. If he had clarified its form, he would have stated what we have said, and the truth of the matter would have become clear to the listener. Since he concealed this clarification, He called him a disbeliever (كافرا), because <<ما مِنْ إِلهٍ إِلَّا إِلهٌ واحِدٌ>> (There is no deity except one God), even though He has different rulings, which are necessary. If this disbeliever had not concealed and had clarified, he would have stated the reality of the matter. As for the one who claims that the gods are three, that one is an ignorant polytheist, and we seek refuge in Allah from a rational person being among the polytheists.\n\nNumber is merely the ruling of the One. Number has appeared in the Beautiful Names (الأسماء الحسنى), and it has come: <<قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا>> (Say, \"Call upon Allah or call upon the Most Compassionate—whichever you call\"), from the perspective of its indication of the essence of the Named One, <<فَلَهُ>> (to Him)—meaning to that Named One—<<الْأَسْماءُ الْحُسْنى>> (belong the Beautiful Names), of which Allah and the Most Compassionate are two, from the perspective that they are Names. However, human understandings are limited in grasping what Allah intends in His address, in whatever language it may be.\n\nThis is some of what is contained in this station (منزل) that we have mentioned. Let us now mention the beneficial sciences it encompasses, by way of reminder, for <<فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ>> (Indeed, the reminder benefits the believers). We say—and Allah speaks the Truth and guides whom He wills to a straight path—among these are:\n\nThe science of the Names of Formation (أسماء التكوين).\nThe science of the letters of Formation (حروف التكوين).\nThe science of the dispersed Spirits (الأرواح المفرقة), not the collected ones.\nThe science of the matters that carry things (الأمور الحاملة للأشياء): what is intended by their carrying, and to whom they ultimately deliver what they carry.\nThe science of strivings (السعايات): what their end is, and what is intended by them on the part of the strivers—is it to attain what they do not possess, or to deliver what they possess to one who seeks it, either by his intrinsic seeking (الطلب الذاتي) or by a request from him, which the striver then grants through ease and relief from his striving, toil, and hardship?\nThe science of the details of matters: and why their details and divisions return—is it to the origin, which is the Divine Names, or to the recipients (القوابل), which are the Fixed Entities (أعيان الممكنات), or to the combination of both, whatever the matter may be that requires detailing and division?\nThe science of recompense (الجزاء) and the truthfulness of the Promise (الوعد) without the Threat (الوعيد).\nThe science of the ascents (مدارج) of the Angels and the separated Spirits (الأرواح المفارقة) carried in bodily forms.\nThe science of disagreement (الخلاف) derived from the science of agreement (الاتفاق): in what matters agreement is appropriate, and in what matters disagreement is appropriate, and whether disagreement has any aspect of conformity or not.\nThe science of the reason from which one who is not a prophet prophesies (المتنبئ).\nThe science of the reason for forgetfulness (السهو) in the cosmos.\nThe science of trials (الفتن) and great battles (الملاحم).\nThe science of the form of receiving from Allah (الأخذ من الله): how it occurs through Unveiling (الكشف), and what it produces in the actions of those who receive during the time of obligation (التكليف).\nThe science of intimate conversation (المسامرة) after granting rights.\nThe science of concealment (الستر) and Theophany (التجلي) in certain situations.\nThe science of fulfilling rights: who fulfills them after the owner of the right requests it, and who anticipates the request.\nThe science of the signs of certainty (اليقين).\nThe science of the 'where-ness' (أينيات) of things: and how every 'where' is distinguished by the distinction of the thing-ness (الشيئية) that seeks it.\nThe science of resemblance (التشبيه) between things due to the bonds that unite them and the aspects that gather them, even if other matters separate them, for the ruling of the comprehensive element does not vanish, just as the ruling of the separating element does not vanish, for it is the ruling that establishes the essence of the thing.\nThe science of the rights of visitors (الزائرين).\nThe science of the reason for offering the greeting of peace (السلام) before offering food to the visiting guest, and offering food before speech.\nThe science of what the guest must say to identify himself to the host, and what is not incumbent upon him.\nThe science of the message (الرسالة) and the reason for the appearance of the Angel in the form of a human when delivering the message in some circumstances but not others.\nThe science of human messengership (الرسالة البشرية).\nThe science of Divine Seizures (الأخذات الإلهية).\nThe science of the effect of strength: whether it affects the strong, the absolutely weak, or the relatively weak.\nThe science of preparation (التمهيد), governance (السياسات), laws (النواميس), and revealed laws (الشرائع).\nThe science of procreation (النتاج) and production (الإنتاج) between spouses.\nThe science of what The Real demanded from His servants absolutely and generally, and what He demanded restrictively.",
    "ur": "باب نمبر تین سو تینتیس: اس منزل کی معرفت میں کہ اشیاء کو تمہارے لیے پیدا کیا گیا اور تمہیں میرے لیے پیدا کیا گیا، لہٰذا جو چیز میرے لیے پیدا کی گئی ہے اسے اس چیز میں ضائع نہ کرو جو تمہارے لیے پیدا کی گئی ہے، اور یہ (باب) حضرت موسیٰ (علیہ السلام) کی حضوری سے متعلق ہے۔\n\nنفوس (النفوس) کو ہر اس خیر کا بدلہ دیا جاتا ہے جو انہوں نے کمایا (کسبت)، اور اس کا بدلہ نہیں دیا جاتا جو انہوں نے حاصل کیا (اكتسبت)۔\n\nاگر تم جان لو تو اکتساب (الاكتساب) کسب (کسب) نہیں ہے، تم روزِ جزا اس خیر کو کاٹو گے جو تم نے بویا۔\n\n### [بے شک اللہ تعالیٰ نے تمام مخلوقات کو ذلت اور افتقار کے مقام میں پیدا کیا]\n\nجان لو، اللہ تمہاری تائید کرے، کہ اللہ تعالیٰ نے تمام مخلوقات کو ذلت اور افتقار (الذلة والافتقار) کے مقام (المقام) میں پیدا کیا، اور ان کے لیے مقرر کردہ مقام میں۔ اللہ کی مخلوق میں سے کسی کے لیے بھی اپنے اس مقام سے ترقی نہیں ہے جس میں وہ پیدا کیے گئے، سوائے جن و انس (الثقلين) کے۔ کیونکہ اللہ نے انہیں عزت (العزة) کے مقام میں پیدا کیا، اور اس مقام کے علاوہ جس کی طرف وہ دنیاوی زندگی میں اپنی سانسوں کے منقطع ہونے پر پہنچتے ہیں۔ لہٰذا، ان کے لیے ان مقامات کی طرف ترقی ہے جو انہیں شہود (الشہود) وراثت میں دیتے ہیں، اور ان مقامات کی طرف نزول ہے جو انہیں پردے (الحجاب) کے پیچھے ٹھہرنا وراثت میں دیتے ہیں۔ پس وہ دونوں راستوں (النجدين) کے برزخ میں ہیں: یا تو شکر گزار (شاكِراً) ہو کر بلند ہوتے ہیں، یا کفر کرنے والے (كَفُوراً) ہو کر پست ہوتے ہیں۔ اللہ تعالیٰ نے فرمایا: وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ (اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا ہے)۔ اس نے صرف عبادت (العبادة) کے لیے کہا۔ جب اس نے عبادت کو ان کے ہاتھوں میں دے دیا اور اسے ان کی تخلیق کا مقصود بنا دیا، تو ان میں سے کچھ وہ ہیں جو اس مقصد کو پورا کرتے ہیں، پس وہ فرمانبردار اور مطیع ہوتے ہیں اللہ کے حکم کے جو ان پر اعمال (الأعمال) اور عبادت (العبادة) کے ذریعے وارد ہوتا ہے۔ کیونکہ اس نے ان سے کہا: میری عبادت کرو، جیسا کہ اس نے خبر دی: إِنَّنِي أَنَا اللَّهُ لَا إِلَهَ إِلَّا أَنَا فَاعْبُدْنِي (بے شک میں ہی اللہ ہوں، میرے سوا کوئی معبود نہیں، پس میری عبادت کرو)۔ یہ عبادت کا حکم ہے۔ اور أَقِمِ الصَّلَاةَ لِذِكْرِي (اور میری یاد کے لیے نماز قائم کرو)۔ یہ عمل (العمل) کا حکم ہے، اور عمل وہ نہیں جو عبادت ہو۔ پس عمل صورت ہے اور عبادت اس کی روح ہے۔ عبادت ہر حال میں اللہ کے ہاں مقبول ہے، خواہ وہ عمل کے ساتھ جڑی ہو یا نہ جڑی ہو۔ اور وہ عمل جو عبادت کے لیے نہ ہو، وہ ہر حال میں قبول نہیں ہوتا، اس کے واقع ہونے کے ارادہ کرنے والے (جو کہ مکلف نفس ہے) کے اعتبار سے۔ لیکن اس اعتبار سے کہ عمل جوارح (الجوارح) یا کسی مخصوص جارحہ سے صادر ہوا ہے، تو اس جارحہ کو اس کا بدلہ دیا جاتا ہے، اور عمل اس شخص کے لیے قبول ہوتا ہے جس سے وہ ظاہر ہوا، لیکن اس نفس کو اس سے کچھ حاصل نہیں ہوتا جس نے جوارح کو اس کا حکم دیا تھا، اگر وہ عمل صورت کے لحاظ سے خیر ہو، جیسے ریاکار اور منافق کی نماز، اور وہ تمام نیک افعال جو اس کے جوارح پر ظاہر ہوتے ہیں جن کا نفس نے عبادت کا ارادہ نہیں کیا تھا۔ اور جہاں تک ممنوعہ برے اعمال کا تعلق ہے، تو نفس کو ارادے کی وجہ سے ان کا بدلہ دیا جاتا ہے، اور جوارح کو ان کا بدلہ نہیں دیا جاتا، کیونکہ ان میں وہ طاقت نہیں کہ وہ ان حرکات سے باز رہ سکیں جو نفوس ان سے کروانا چاہتے ہیں۔ کیونکہ وہ ان کی سماعت اور اطاعت پر مجبور ہیں۔ پس اگر نفوس ظلم کریں تو ان پر ہے، اور جوارح کے لیے حرج اٹھا لیا گیا ہے، بلکہ ان کے لیے مکمل خیر ہے۔ اور اگر نفوس عدل کریں تو ان کے لیے اور جوارح کے لیے بھی ہے۔ کیونکہ نفوس ان جوارح پر ذات حق (الحق) کے والی ہیں، اور جوارح مامور، مجبور اور غیر مختار ہیں اس میں جو وہ صرف کرتی ہیں۔ پس وہ ہر لحاظ سے مطیع ہیں، اور نفوس ایسی نہیں ہیں۔ اور نفوس میں سے کچھ وہ ہیں جو اس مقصد کو پورا نہیں کرتے جس کے لیے وہ پیدا کیے گئے، پس وہ نافرمان ہوتے ہیں اور اللہ کے حکم کی مخالفت کرتے ہیں جب اس نے انہیں اعمال اور عبادت کا حکم دیا۔ پس فرمانبردار (الطائع) سے عبادت اضطرار اور اختیار دونوں حالتوں میں واقع ہوتی ہے، اگرچہ وہ عمل کے حکم کے لحاظ سے مطیع نہ ہو۔ پس اگر وہ مطیع اور فرمانبردار ہو، تو وہ تخلیق اور امر میں مقصود کے واقع ہونے سے کامیاب ہو گیا۔ کیونکہ اللہ ہی کے لیے الْخَلْقُ وَالْأَمْرُ (تخلیق اور امر) ہے، تَبَارَكَ اللَّهُ رَبُّ الْعَالَمِينَ (بڑی برکت والا ہے اللہ جو تمام جہانوں کا رب ہے)۔ اور جہاں تک نافرمان (العاصي) کا تعلق ہے، تو اس سے عبادت صرف اضطرار کی حالت میں واقع ہوتی ہے، اختیار کی حالت میں نہیں۔ اور اس سے عمل کی صورت واقع ہوتی ہے، نہ کہ وہ عمل جو اس کے لیے مشروع کیا گیا ہے۔ پس وہ اللہ کے حکم کا مخالف ہے، لہٰذا اس نے تخلیق اور امر میں مقصود کو پورا نہیں کیا۔\n\nاور جب اللہ نے جن و انس (الثقلين) کو اس مقام میں پیدا کیا جس کا اس نے ان کی تخلیق سے ارادہ کیا تھا، جو کہ ذات حق (الحق) کی اجلّیت ہے، تو اس نے انہیں اس کے لیے فارغ کر دیا تاکہ ان کے پاس اس چیز میں مشغول ہونے کی کوئی حجت نہ رہے جس سے ان کا قیام ہے۔ پس اس نے وہ اشیاء جن سے ان کا قیام ہے، خاص طور پر ان کے لیے پیدا کیں تاکہ وہ اس چیز کے لیے فارغ ہو جائیں جس کا ان سے ارادہ کیا گیا تھا۔ پس اللہ کی حجت ان پر قائم ہو گئی جب انہوں نے وہ کام نہیں کیا جس کے لیے وہ پیدا کیے گئے تھے۔ پھر اس نے ان میں سے بعض کے بارے میں جان لیا کہ وہ اس چیز میں کوشش کرنے کے بارے میں شبہہ میں پڑ جائیں گے جو ان کے لیے پیدا کی گئی ہے، غیر کے حق میں، جب انہیں یہ بات پہنچی:\n\nإِنَّ اللَّهَ يَقُولُ جُعْتُ فَلَمْ تُطْعِمْنِي (بے شک اللہ فرماتا ہے: میں بھوکا ہوا تو تم نے مجھے کھانا نہیں کھلایا)۔ اور جب بندے نے کہا: یا رب، آپ کیسے کھانا کھائیں گے جبکہ آپ رب العالمین ہیں؟ تو اللہ نے اس سے فرمایا: أَلَمْ تَعْلَمْ أَنَّهُ اسْتَطْعَمَكَ فُلَانٌ فَلَمْ تُطْعِمْهُ أَمَا أَنَّكَ لَوْ أَطْعَمْتَهُ وَجَدْتَ ذَلِكَ عِنْدِي (کیا تمہیں معلوم نہیں کہ فلاں نے تم سے کھانا مانگا تھا اور تم نے اسے نہیں کھلایا؟ اگر تم اسے کھانا کھلاتے تو تم اسے میرے پاس پاتے)۔\n\nپس ذات حق (الحق) نے اپنے آپ کو اس بھوکے کے مقام پر اتارا۔ جب یہ شبہہ ان پر ظاہر ہوا تو انہوں نے کہا: ہم غیر کے حق میں کوشش کریں گے اور اس کوشش سے جو ہم کرتے ہیں، تبعی حکم کے تحت فائدہ اٹھائیں گے۔ تو اللہ نے ان سے فرمایا: تم نے مجھ سے وہ نہیں سمجھا جو میں چاہتا ہوں: مَا أُرِيدُ مِنْهُمْ مِنْ رِزْقٍ وَمَا أُرِيدُ أَنْ يُطْعِمُونِ إِنَّ اللَّهَ هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ (میں ان سے کوئی رزق نہیں چاہتا اور نہ میں چاہتا ہوں کہ وہ مجھے کھلائیں، بے شک اللہ ہی رزق دینے والا، قوت والا، مضبوط ہے)۔ تم نہیں ہو۔ پس پوری آیت کی وجہ سے ان کے پاس کوئی حجت باقی نہیں رہی۔ اور جہاں تک ان کا اس خبر پر بھروسہ کرنے کا تعلق ہے، تو اللہ کے ہاں ان کے لیے اس سے کوئی حجت قائم نہیں ہوتی۔ کیونکہ جب اس نے تمہارے لیے وہ اشیاء پیدا کیں جن سے تمہارا قیام ہے، تو اس نے وہ تمہیں عطا کیں اور تم تک پہنچائیں تاکہ ان سے تمہارا قیام ہو۔ پھر اس نے ان میں سے بعض کو اس سے زیادہ عطا کیا جو ان کے قیام کے لیے کافی تھا تاکہ وہ اسے دوسرے تک پہنچائے، تاکہ اس دوسرے کا قیام اس سے ہو، اور اس شخص کو اس امانت کی ادائیگی کا اجر ملے جو اللہ نے اسے سونپی تھی۔ پس یہی وہ ہے جس پر ذات حق (الحق) نے عتاب کیا، جہاں فلاں نے اس سے کھانا مانگا اور اس کے پاس اس کے قیام سے زیادہ موجود تھا، مگر اس نے اسے نہیں دیا۔ پس اس خبر سے یہ لازم نہیں آتا کہ وہ غیر کے حق میں کوشش کرے، اور یہی مراد ہے آیت کے اختتام میں، اس کے قول میں: مَا أُرِيدُ مِنْهُمْ مِنْ رِزْقٍ وَمَا أُرِيدُ أَنْ يُطْعِمُونِ (میں ان سے کوئی رزق نہیں چاہتا اور نہ میں چاہتا ہوں کہ وہ مجھے کھلائیں)۔\n\nاور جب اللہ نے انسان کو پیدا کیا اور اسے جدل (الجدل) عطا کیا، تو ان میں سے بعض نے کہا: جب فلاں نے مجھ سے کھانا مانگا اور میرے پاس میرے قیام سے زیادہ موجود تھا، تو اگر اس مانگنے والے کی کوئی امانت میرے پاس ہوتی تو میں اسے روک نہیں سکتا تھا۔ اسی لیے ہم نے اسے کھانا نہیں کھلایا۔ تو اس سے کہا گیا جو ابلیس سے کہا گیا تھا: تمہیں کب معلوم ہوا کہ اس کے لیے نہیں ہے؟ کیا اسے منع کرنے کے بعد، یا اس سے پہلے؟ کیا اللہ نے تمہیں کشف (الکشف) کا علم عطا کیا تھا کہ یہ اس کے لیے نہیں ہے، یا اس نے تمہیں اس کا مالک متعین کر دیا تھا؟ یا تمہیں یہ معلوم نہیں ہوا مگر تمہارے منع کرنے اور اس کے تمہارے پاس سے چلے جانے کے بعد؟\n\nاسے لازمی طور پر کہنا پڑے گا کہ منع کرنے کے بعد مجھے یہ معلوم ہوا۔ تو اس سے کہا جائے گا: اسی وجہ سے تم پکڑے گئے۔ کیونکہ ابلیس نے ذات حق (الحق) سے کہا: آپ نے مجھے اس چیز کا حکم دیا جو آپ نہیں چاہتے تھے کہ مجھ سے واقع ہو۔ اگر آپ مجھ سے آدم کو سجدہ کروانا چاہتے تو میں سجدہ کر دیتا۔ تو اللہ نے اس سے فرمایا: تمہیں کب معلوم ہوا کہ میں تم سے سجدہ کروانا نہیں چاہتا تھا؟ کیا تمہاری انکار کے واقع ہونے اور حکم کا وقت گزر جانے کے بعد، یا اس سے پہلے؟ تو اس نے کہا: انکار کے واقع ہونے کے بعد مجھے معلوم ہوا کہ اگر آپ مجھ سے سجدہ کروانا چاہتے تو میں سجدہ کر دیتا۔ تو اللہ نے اس سے فرمایا: اسی وجہ سے میں نے تمہیں پکڑا۔ اور کسی کو بھی جہالت (الجہل) کے سوا کسی چیز پر نہیں پکڑا جاتا۔ کیونکہ اہل علم جنہیں اللہ نے اپنی مخلوق میں ہونے والے واقعات سے پہلے ہی مطلع کر دیا ہے، انہیں اس چیز پر نہیں پکڑا جاتا جو ان سے واقع نہیں ہوئی، جس کا انہیں واسطے کے ذریعے حکم دیا گیا تھا کہ وہ ان سے واقع ہو۔ کیونکہ وہ اطلاع کی وجہ سے قربت (القربة) کی عین حالت میں ہیں۔ اور امر کی تعمیل سے مراد صرف قربت ہے، اور قربت کا مقام تکلیف کا مقام نہیں ہے۔ پس جب مقربین سے طاعات کے اعمال واقع ہوتے ہیں، تو وہ شہود (الشہود) کے ذریعے ہوتے ہیں۔ کیونکہ وہ اپنے رب کی طرف سے بینہ پر ہیں، پس وہ الٰہی امر کے شہود کے لحاظ سے عمل کرنے والے ہیں، اس واسطے کے بغیر جو اسے لایا ہے۔ پس وہ ظاہر میں صورت کے لحاظ سے واسطے کے ذریعے امر کی پیروی کرنے والے ہیں، اور باطن میں وہ عین والے ہیں، نہ کہ پیروکار۔ پس اس کا حاصل یہ ہے کہ جو شخص ہر حال میں اللہ کے لیے اپنی عبودیت (عبودیتہ) سے غافل نہیں ہوا، اس نے وہ ادا کر دیا جس کے لیے وہ پیدا کیا گیا تھا، اور وہ فرمانبردار تھا، خواہ وہ مطیع ہو یا مخالف۔ کیونکہ بھاگا ہوا غلام اپنے بھاگنے سے غلامی سے باہر نہیں نکلتا، بلکہ وہ اسے عبودیت کے لوازم سے باہر نکالتا ہے، جیسے اپنے آقا کے سامنے کھڑا ہونا تاکہ اس کے احکام اور رسم و رواج کی تعمیل کرے۔ کیا تم نہیں دیکھتے کہ عبودیت کا نام اس پر لاگو ہوتا ہے، خواہ وہ مطیع ہو یا مخالف، جیسا کہ بیٹے پر بنوت کا نام باقی رہتا ہے، خواہ وہ نیک ہو یا نافرمان۔ پس وہ بندہ جس نے وہ پورا کیا جس کے لیے وہ پیدا کیا گیا تھا، اس کا معاملہ اپنے نفس میں دو حالتوں سے خالی نہیں ہوتا: یا تو اس کا مشہود اس کی قیمت (قیمتہ) ہے، پس وہ اپنی قیمت کے مقام میں کھڑا ہوتا ہے، تو اس کے ساتھ انکسار، تسلیم اور عاجزی ہوتی ہے۔ یا اسے اپنے آقا کی وجہ سے عزت (الاعتزاز) کی حالت میں کھڑا کیا جاتا ہے، تو اس پر اس کی وجہ سے عجب اور نخوت ظاہر ہوتی ہے، جیسے غلام عتبہ کی نخوت، جب اس سے اس بارے میں پوچھا گیا تو اس نے کہا: میں کیوں نہ نخوت کروں جبکہ میرا ایک آقا بن گیا ہے اور میں اس کا غلام بن گیا ہوں، جیسا کہ معاملہ اپنے نفس میں ہے۔ لیکن فضیلت اس میں ہے کہ وہ معاملہ اس کے لیے مشہود ہو۔ پس یہ دو حالتیں قابل تعریف ہیں، جن میں سے ہر ایک بندے کے لیے گواہی دیتی ہے کہ اس نے وہ پورا کیا جس کے لیے وہ پیدا کیا گیا تھا۔ اور یہ باقی رہا کہ ان دونوں حالتوں میں سے کون سی بندے کے لیے زیادہ بہتر ہے؟ کیا قیمت کا شہود یا آقا کی وجہ سے عزت؟ پس کچھ لوگ اس کے قائل ہیں اور کچھ اس کے قائل ہیں۔ اور میرے نزدیک صحیح یہ ہے کہ اس میں ترجیح نہ دی جائے، اس وجہ سے جو ہم ذکر کریں گے۔ اور وہ یہ ہے کہ مقامات (المقامات) اور مواطن مختلف ہوتے ہیں۔ پس وہ موطن جہاں اللہ کی وجہ سے عزت کا ظہور مطلوب ہو، وہاں بندے کو صرف اللہ کی وجہ سے عزت کے ساتھ ہی ظاہر ہونا چاہیے۔ اور وہ موطن جو اپنے آپ میں بندے کے اپنی قیمت کے شہود کا تقاضا کرتا ہے اور اسے طلب کرتا ہے، وہاں اس بندے کو صرف اپنی قیمت کے شہود کے ساتھ ہی ظاہر ہونا چاہیے۔ اور بعض نے عزت کے لیے اللہ تعالیٰ کے اس قول سے دلیل پکڑی: فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ (پس میں تم سے بھاگا جب مجھے تم سے خوف محسوس ہوا)۔ اور اللہ کے اس حکم سے: فَفِرُّوا إِلَى اللَّهِ (پس اللہ کی طرف بھاگو)۔ اور یہ دونوں فریقوں کے لیے حجت ہے۔ کیونکہ وہ اللہ کی طرف اللہ کی وجہ سے عزت طلب کرنے کے لیے بھاگ سکتا ہے، اور وہ اللہ کی طرف بھاگ سکتا ہے تاکہ اس کی ذلت اور اس کی حاجت صرف اللہ کی طرف ہو، نہ کہ کسی اور کی طرف، کیونکہ وہ حاجت اور افتقار (الافتقار) پر فطرت کیا گیا ہے۔ اور اسی لیے اس نے اللہ کی طرف بھاگنے کے حکم کے بعد فرمایا: وَلَا تَجْعَلُوا مَعَ اللَّهِ إِلَهًا آخَرَ (اور اللہ کے ساتھ کوئی دوسرا معبود نہ ٹھہراؤ) جس کی طرف تم محتاج ہو جاؤ، بلکہ اپنی حاجتوں کے حصول کے لیے اللہ کی طرف بھاگو جن پر تم فطرت کیے گئے ہیں۔ اور جہاں تک موسیٰ علیہ السلام کے بھاگنے کا تعلق ہے، جس کی وجہ انہوں نے فرعون اور اس کی قوم کا خوف بتائی، تو ان کا خوف صرف اللہ سے تھا کہ وہ انہیں ان پر مسلط نہ کر دے، کیونکہ وہ اس پر قادر ہے، اور وہ نہیں جانتے تھے کہ اللہ کے علم میں کیا ہے۔ پس ان کا بھاگنا اپنے رب کی طرف تھا تاکہ وہ اس سے عزت حاصل کریں۔ پس ان کے رب نے انہیں حکم اور علم عطا کیا اور انہیں ان لوگوں کی طرف رسولوں میں سے بنا دیا جن سے وہ اللہ کی وجہ سے عزت کے ساتھ ڈرتے تھے۔ اور اس نے انہیں واضح آیات سے تائید دی تاکہ وہ اس کمزوری کو مضبوط کر دے جو اس نشأت میں طبیعت (الطبیعۃ) کے حکم کا تقاضا کرتی ہے۔ کیونکہ اس میں بہت بڑی کمزوری ہے، اس وجہ سے کہ اس کے اور ان ارواح کے درمیان کوئی واسطہ یا پردہ نہیں ہے جن کے لیے قوت اور تسلط ہے۔ پس خوف اس کے ساتھ ایسے ہی لازم ہے جیسے سایہ شخص کے ساتھ لازم ہوتا ہے۔ پس صاحب طبیعت صرف اسی صورت میں قوی ہوتا ہے جب اسے روح سے تائید حاصل ہو، تو طبیعت کی کمزوری اس پر اثر انداز نہیں ہوتی۔ کیونکہ اس میں طبیعت کا عمل زیادہ ہوتا ہے، اور اس کی روحانیت جو اس کا مدبر نفس ہے، وہ بھی طبیعت سے موجود ہے، پس وہ اس کی ماں ہے، اگرچہ اس کا باپ روح ہے۔ پس ماں کا بیٹے پر اثر ہوتا ہے، کیونکہ وہ اس کے رحم میں ہوتا ہے اور اس کے پاس موجود چیز سے غذا حاصل کرتا ہے۔ پس نفس اپنے باپ سے صرف اسی صورت میں قوی ہوتا ہے جب اللہ اسے روح قدسی سے تائید دے جو اس کی طرف دیکھتی ہے۔ تب وہ طبیعت کے حکم پر قوی ہو جاتا ہے، پس وہ اس پر مکمل طور پر اثر انداز نہیں ہوتی، اگرچہ اس میں کچھ اثر باقی رہتا ہے، کیونکہ اس کا مکمل طور پر زائل ہونا ممکن نہیں ہے۔\n\n### [بے شک طبیعت (الطبیعۃ) ولود ہے، اس میں بانجھ پن نہیں]\n\nاور جان لو کہ طبیعت ولود ہے، اس میں بانجھ پن نہیں، اور وہ اپنے شوہر سے محبت کرنے والی ہے، ولادت کی طلب میں۔ کیونکہ وہ اولاد سے محبت کرتی ہے اور اپنی اولاد پر اسے بہت زیادہ شفقت ہوتی ہے۔ اور اسی شفقت کے ذریعے وہ انہیں اپنی طرف کھینچتی ہے۔ کیونکہ ان کی تربیت اسی کے پاس ہے، پس وہ اس کے سوا کسی کو نہیں جانتے۔ اور اسی وجہ سے ہم اکثر اولاد کو طبیعت کا غلام ہی دیکھتے ہیں، وہ محسوسات اور طبعی لذتوں سے دور نہیں ہوتے، سوائے تھوڑے سے۔ کیونکہ وہ اپنے باپ کی طرف دیکھنے والے ہیں، اور وہ روحانیت والے (المتروحنون) ہیں۔ اور ان کی علامت صورتوں میں تنوع کا نہ ہونا نہیں ہے، کیونکہ صورتوں میں تنوع جیسا کہ ان کے لیے ہے، طبیعت کے لیے بھی ہے۔ بلکہ روحانیت والوں کی علامت کہ وہ اپنے باپ کی اولاد ہیں، یہ ہے کہ وہ طبعی شہوات سے پاک ہوتے ہیں اور ان سے صرف وہی لیتے ہیں جو ان کی نشأت کو قائم رکھے۔ جیسا کہ\n\nقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَسْبُ ابْنِ آدَمَ لُقَيْمَاتٌ يُقِمْنَ صُلْبَهُ (نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ابن آدم کے لیے چند لقمے کافی ہیں جو اس کی کمر کو سیدھا رکھیں)۔\n\nپس ان کی ہمت اپنے باپ سے ملحق ہونا ہے، جو کہ روح الٰہی یائی (الروح الإلهي اليائي) ہے نہ کہ امری (الامری)۔ اور ہم نے اسے یائی اس لیے کہا کہ اللہ کا قول ہے: وَنَفَخْتُ فِيهِ مِنْ رُوحِي (اور میں نے اس میں اپنی روح میں سے پھونکا)۔ یاءِ اضافت کے ساتھ اس کی طرف نسبت کرتے ہوئے، کیونکہ روح امر (روح الأمر) اور یاءِ اضافت والی روح (روح ياء الإضافة) میں فرق ہے۔ پس اس نے روح امر کو اس چیز کے لیے بنایا جس سے تائید ہوتی ہے، اور یاء والی روح کو روح کی عین (عین الروح) کے وجود کے لیے بنایا جو کہ ذات حق (الحق) کا کلمہ ہے جو طبیعت میں پھونکا گیا ہے۔ پس وہ بچے کی طرح اپنے باپ کی طرف روتا ہے تاکہ اس سے اس چیز پر تائید حاصل کرے جو وہ ذات حق (الحق) کے شہود سے طلب کرتا ہے جو روح اور طبیعت سے خارج ہے، اس لحاظ سے کہ وہ ان دونوں سے بے نیاز ہے، نہ کہ اس لحاظ سے کہ وہ ان دونوں سے، یا ان دونوں کے ذریعے، یا ان دونوں میں اولاد کے لیے ظہور الٰہی (التجلی) ہے۔ یہ سب کچھ اس کے لیے ہے۔ اور یہ ایک عزیز طلب ہے۔ پس جب وہ اسے حاصل کر لیتا ہے اور اس سے قوی ہو جاتا ہے، تو وہ شہوات کی طرف ان پر احسان کرتے ہوئے نزول کی صورت میں آتا ہے۔ پس وہ ان کے ذریعے مشتہیات پر حکم لگاتا ہے، نہ کہ شہوت اس پر مشتہیات میں حکم لگائے۔ پس اس مقام کا مالک اپنے نفس میں شہوت کی عین کو پیدا کرتا ہے، اپنے خاص عالم میں سے مشتہیات کے سوالات کی قضا اور اجابت کے طور پر۔ پس وہ اس شہوت کے ذریعے وہ حاصل کرتے ہیں جو وہ چاہتے ہیں، تو حیوانی روح (الروح الحيواني) نعمت حاصل کرتی ہے، اور وہ اپنے رب کی طرف دیکھ رہی ہوتی ہے، غیر محجوب، اس نے اس کے لیے اپنے نام الخلاق (پیدا کرنے والا) میں ظہور الٰہی کیا ہے، اور اسے یہ نام عطا کیا ہے تاکہ اس سے وہ چیز وجود میں آئے جو وہ چاہتی ہے، نہ کہ جو وہ شہوت کرتی ہے۔ پس یہ وہ فاضل اور شریف نفوس ہیں جو اس سے مشابہت اختیار کرتے ہیں جس کے لیے وہ ہیں۔ پس وہ طبیعت کی طرف اپنے باپ کی فرمانبردار اولاد کی نظر سے دیکھتے ہیں، اس سے بے نیاز ہوتے ہوئے بھی، اس کے حق کی وفا کے لیے۔ اور لوگ اس حکم میں کئی حصوں میں تقسیم ہو گئے ہیں۔ پس ان میں سے کچھ وہ ہیں جنہوں نے عبودیت (العبودیة) کے حق کی وفا کے لیے اللہ کی عبادت کی، پس انہوں نے اپنی نشأت کو کمال پر قائم کیا، پس اسے اس کی تخلیق عطا کی۔ اور ان میں سے کچھ وہ ہیں جنہوں نے ربوبیت (الربوبية) کے حق کی وفا کے لیے اللہ کی عبادت کی، جو اس بندے پر واجب ہے، پس انہوں نے اپنے خالق کی سیادت کی نشأت کو قائم کیا، پس اسے اس کی تخلیق عطا کی، اپنے نفس کی طرف دیکھے بغیر، جیسا کہ پہلے نے اپنے آقا کی سیادت کی طرف دیکھے بغیر کیا تھا، اس لحاظ سے جو ہر نشأت کا ظاہر ہے، نہ کہ اس لحاظ سے جو وہ نفس الامر میں ہے۔ کیونکہ بندہ ان امور میں عمل نہیں کرتا جو اپنے نفوس کے لیے تقاضا کرتے ہیں۔ اور ان میں سے کچھ وہ ہیں جنہوں نے دونوں نشأتوں کو قائم کرنے کے لیے اس کی عبادت کی، پس انہیں ان کی تخلیق عطا کی، پس انہوں نے اپنی عبودیت کی نشأت اور اپنے آقا کی سیادت کی نشأت کو قائم کیا، اور یہ ان کے وجود اور عین میں ہے، کیونکہ وہ اس نشأت کے ظہور کا محل ہے۔ اور ان میں سے کچھ وہ ہیں جنہوں نے اللہ کی عبادت اس لیے کی کہ انہیں عبادت کا حکم دیا گیا تھا، اور انہیں ان نشأتوں کے قائم کرنے کی کوئی خبر نہیں تھی، پس انہوں نے عبودیت کے لازمے کے ساتھ اس کی عبادت کی، پس ان کی عبادت الٰہی امر کی وجہ سے ہے، ذاتی نہیں۔ اور ان میں سے کچھ وہ ہیں جنہیں اللہ نے ذاتی عبادت میں قائم کیا، پس ان کا امر صرف عمل میں حاضر ہوا، نہ کہ عبادت میں۔ اور ان میں سے کچھ وہ ہیں جنہوں نے ان تمام وجوہ سے اس کی عبادت کی، اور وہ عبادت میں قوم میں سب سے زیادہ قوی ہیں۔ اور اس بندے سے قائم ہونے والی نشأت تخلیق کے لحاظ سے مکمل ترین نشأت ہے۔ کیونکہ نشأت کا قائم ہونا ضروری ہے۔ پس اگر وہ بندے کے لیے مقصود ہو تو اس کی طرف منسوب کی جاتی ہے اور اس پر اس کی تعریف کی جاتی ہے۔ اور اگر وہ عابد بندے کے لیے مقصود نہ ہو، تو ذات حق (الحق) اسے قائم کرتا ہے اور وہ اللہ کی طرف منسوب کی جاتی ہے اور اس پر اس کی تعریف کی جاتی ہے، باوجود اس کے کہ وہ عابد سے ظاہر ہوتی ہے۔ اور اس کے وجود کا ارادہ کرنا اس سے غفلت یا اس سے جہالت سے بہتر ہے۔ پس لوگوں میں سے کچھ وہ ہیں جو اس کا شہود کرتے ہیں جو وہ پیدا کرتے ہیں، اور لوگوں میں سے کچھ وہ ہیں جو اس کا شہود نہیں کرتے جو وہ پیدا کرتے ہیں، کیونکہ وہ نہیں جانتے کہ وہ پیدا کر رہے ہیں، پس اللہ ان کی تخلیق کی ذمہ داری لے لیتا ہے، ان کے علم کے بغیر، یہاں تک کہ نشأت کی صورت قائم ہو جاتی ہے، تب عابد اس کا شہود کرتا ہے کہ وہ اس سے صادر ہوئی ہے، پس وہ اللہ کی تعریف کرتا ہے کہ اس سے ایسا ظاہر ہوا۔ پس وہ اس باب میں طبقات پر ہیں، یعنی عبادت کے باب میں۔ اور اسی طرح کا حکم ان سے ظاہر ہونے والے ظاہری اور باطنی اعمال کی صورتوں میں بھی ہے، وہ ان میں مختلف طبقات پر ہیں۔ پس ان میں سے کچھ وہ ہیں جو سب کو جمع کرنے والے ہیں، اور ان میں سے کچھ وہ ہیں جو جمع کے درجے سے نیچے ہیں۔\n\nپھر جان لو کہ احد (الأحد) سے کوئی چیز بالکل نہیں ہوتی، اور اعداد میں سب سے پہلا دو (الاثنان) ہے۔ اور دو سے کوئی چیز بالکل نہیں ہوتی جب تک کہ کوئی تیسرا نہ ہو جو ان دونوں کو جوڑے اور ان میں سے بعض کو بعض سے باندھے، اور وہ ان دونوں کا جامع ہو۔ تب ان دونوں سے وہ چیز وجود میں آتی ہے جو وجود میں آتی ہے، اس کے مطابق جو یہ دونوں ہوں، خواہ وہ اسماء الٰہیہ (الأسماء الإلهية) میں سے ہوں، یا معنوی یا محسوس اکوان میں سے۔ جو بھی چیز ہو، معاملہ اسی طرح ہونا چاہیے جیسا کہ ہم نے ذکر کیا۔ اور یہی اسم فرد (الاسم الفرد) کا حکم ہے۔ پس تین (الثلاثة) افراد میں سب سے پہلا ہے، اور کم از کم جمع بھی یہی ہے، اور اسی اسم سے ممکنات کی اعیان (أعيان الممكنات) ظاہر ہوئیں۔ پس کوئی ممکن ایک سے وجود میں نہیں آیا، بلکہ وہ جمع سے وجود میں آیا، اور کم از کم جمع تین ہے، اور وہ فرد ہے۔ پس ہر ممکن اسم فرد کا محتاج ہوا۔ پھر جب اسم فرد مثلث الحکم تھا، تو اس نے اس ممکن میں جسے وہ وجود دیتا ہے، تین امور عطا کیے جن کا لحاظ کرنا ضروری ہے، اور تب وہ اسے وجود دیتا ہے۔ اور جب مجموعہ میں غایت تین تھی، جو کہ افراد میں سب سے پہلا ہے اور کم از کم جمع ہے، اور اس سے مقصود حاصل ہو گیا اور اس میں چوتھے کے اضافے سے بے نیازی ہو گئی، تو مشرک کی قوت کی انتہا تین تھی، پس اس نے کہا: إِنَّ اللَّهَ ثَالِثُ ثَلَاثَةٍ (بے شک اللہ تین میں سے تیسرا ہے)۔ اور اس نے اس سے زیادہ نہیں کہا۔ اور اللہ کے ساتھ شرک کرنے والے کے بارے میں یہ روایت نہیں کی گئی کہ اس نے تین میں سے تیسرے کے علاوہ کچھ کہا ہو۔ چوتھا چار میں سے، یا آٹھواں آٹھ میں سے، ایسا نہیں آیا۔ اور اسی طرح بسم اللہ میں تین اسماء ظاہر ہوئے، جب تکوین عطا کرنے والا کہتا ہے: بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ (اللہ کے نام سے جو نہایت مہربان، رحم کرنے والا ہے)۔ اور الٰہی تکوین قول کُنْ (ہو جا) سے ہے، اور یہ تین حروف ہیں: کاف، واؤ، اور نون۔ واؤ کاف اور نون کے درمیان ہے، اس کا کوئی ظہور نہیں ہے ایک عارضی امر کی وجہ سے جس نے نون اور واؤ کو سکون عطا کیا، مگر نون کے لیے امر کا سکون ہے۔ پس دیکھو کہ پہلی فردیت (الفردية الأولية) کا نفوذ اعیان کے ظہور میں کیسے ظاہر ہوا۔ اور اس چیز میں غور کرو جو اس سے وجود میں آتی ہے، تین امور جنہیں اس نے حقوق بنایا۔ پس عابدین میں سے جو اپنی اعمال اور عبادات کی صورتوں کو پیدا کرنے والے ہیں، جس نے ان حقوق کو ان کے پیدا کرنے کے ارادے کے وقت حاضر کیا اور ان نشأتوں میں ہر حقدار کو اس کا حق دیا، وہ اللہ کے ہاں اس سے زیادہ کامل اور اعلیٰ درجے کا تھا جس نے وہ ارادہ نہیں کیا جو اس نے ارادہ کیا۔ اور پیدا کی گئی صورت میں تین حقوق ہیں جن کا ارادہ کرنے والا فرد حق واحد (الفرد الحق الواحد) اللہ کرتا ہے۔ اور وہ یہ ہے کہ وہ اس سے کیا مستحق ہے، تنزیہ (التنزیہ) یا اس کی حمد کے ساتھ تسبیح (التسبیح)۔ اور اسم فرد سے صورت نفس کا حق، اور وہ یہ ہے کہ اسے وجود میں لایا جائے بعد اس کے کہ وہ نہیں تھی، تاکہ وہ ہستی (الوجود) کی حضوری میں ممتاز ہو جائے اور اس سے رنگین ہو جائے اور اس چیز سے ملحق ہو جائے جو اس کے خالق اور موجد کی صفت ہے، اور وہ اللہ ہے۔ اور یہ اس سے مشابہت اختیار کرنے کے درجات میں سے پہلا درجہ ہے تاکہ وہ ہستی میں ظاہر ہو اور اس سے رنگین ہو جائے۔ اور تیسرا حق وہ ہے جو اس کے وجود میں غیر کا مصلحت کا حق ہے۔ پس وہ نشأت اس غیر کو اس کا حق عطا کرتی ہے، اور یہ اس کے موجد کا مقصود ہے۔ اور وہ غیر دو قسم کا ہے۔ پہلی قسم اسماء الٰہیہ ہیں، پس ان کے آثار ظاہر ہوتے ہیں جن کا ظہور اس عین کے وجود پر موقوف ہے۔ اور دوسری قسم ممکنات کے حقوق ہیں جو انہیں اس پیدا کی گئی صورت کے وجود کے بغیر حاصل نہیں ہو سکتے۔ پس اسے پیدا کرنے والا تخلیق کے وقت ان تمام امور کا ارادہ کرتا ہے۔ پس اللہ کی طرف سے اس عابد کی تعریف اس کے حاضر کیے گئے اور ارادہ کیے گئے کے مطابق ہوتی ہے۔ پس ان میں سے کچھ وہ ہیں جو اپنی عبادت کی صورت اور اپنے عمل کی صورت میں ان سب کو جمع کرتے ہیں۔ پس تثلیث (التثلیث) تمام امور میں سرایت کر جاتی ہے، اس کے اصل میں موجود ہونے کی وجہ سے۔ اور اسی لیے اس نے تثلیث کے قائل کے بارے میں کہا کہ وہ کافر ہے، پس فرمایا: لَقَدْ كَفَرَ الَّذِينَ قَالُوا إِنَّ اللَّهَ ثَالِثُ ثَلَاثَةٍ (بے شک وہ لوگ کافر ہو گئے جنہوں نے کہا کہ اللہ تین میں سے تیسرا ہے)۔ اور اس نے اسے مشرک نہیں کہا، کیونکہ اس نے اس چیز کو چھپا دیا جو اسے کہنا چاہیے تھا جب اس نے یہ کہا کہ وہ اس کی صورت کو واضح کرے۔ اور اگر وہ اس کی صورت کو واضح کرتا تو وہ وہی کہتا جو ہم نے کہا، اور سننے والے کے لیے اس میں حق واضح ہو جاتا۔\n\nپس جب اس نے اس بیان کو چھپا دیا تو اس نے اسے کافر کہا، کیونکہ لَا إِلَهَ إِلَّا إِلَهٌ وَاحِدٌ (کوئی معبود نہیں سوائے ایک معبود کے)، اگرچہ اس کے مختلف احکام ہیں اور وہ ضروری ہیں۔ پس اگر یہ کافر نہ چھپاتا اور واضح کرتا تو وہ وہی کہتا جو معاملہ ہے۔ اور جہاں تک اس کا تعلق ہے جو یہ دعویٰ کرتا ہے کہ معبود تین ہیں، تو وہ مشرک جاہل ہے، اور ہم اللہ کی پناہ مانگتے ہیں کہ کوئی عاقل مشرکوں میں سے ہو۔ پس عدد واحد کے احکام ہیں۔ اور اسماء حسنیٰ میں عدد آیا ہے، اور یہ آیا ہے: قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَا تَدْعُوا (کہو: اللہ کو پکارو یا رحمن کو پکارو، جس نام سے بھی تم پکارو)۔ اس لحاظ سے کہ وہ مسمیٰ کی عین پر دلالت کرتا ہے، فَلَهُ (پس اسی کے لیے) یعنی اس مسمیٰ کے لیے الْأَسْمَاءُ الْحُسْنَى (بہترین نام) ہیں، جن میں سے اللہ اور رحمن ہیں، اس لحاظ سے کہ وہ اسماء ہیں۔ لیکن عقلیں اس چیز کو سمجھنے سے قاصر ہیں جو اللہ اپنے خطاب میں چاہتا ہے، خواہ وہ کسی بھی زبان میں ہو۔ پس یہ اس منزل میں موجود کچھ چیزیں ہیں جو ہم نے ذکر کیں۔ پس ہم ان نافع علوم کو ذکر کریں جو اس میں شامل ہیں، تذکرہ کے طریقے پر، فَإِنَّ الذِّكْرَى تَنْفَعُ الْمُؤْمِنِينَ (پس بے شک تذکرہ مومنوں کو فائدہ دیتا ہے)۔\n\nپس ہم کہتے ہیں، اور اللہ يَقُولُ الْحَقَّ وَيَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ (حق فرماتا ہے اور جسے چاہتا ہے سیدھے راستے کی طرف ہدایت دیتا ہے)۔ پس ان میں سے تکوین (التکوین) کے اسماء کا علم، اور تکوین کے حروف کا علم، اور متفرق ارواح کا علم نہ کہ جامع ارواح کا، اور اشیاء کو اٹھانے والے امور کا علم، کہ انہیں اٹھانے کا کیا مقصد ہے اور وہ اٹھانے کے ذریعے کس تک پہنچتے ہیں، اور کوششوں (السعايات) کا علم، کہ ان کی انتہا کیا ہے اور کوشش کرنے والوں سے ان کا کیا مقصد ہے؟ کیا ان چیزوں کو حاصل کرنا جو ان کے پاس نہیں ہیں، یا جو ان کے پاس ہے اسے اس تک پہنچانا جو اسے طلب کرتا ہے، خواہ وہ اس کی ذات کے ذریعے ہو جو کہ ذاتی طلب ہے، یا اس کی طرف سے اس بارے میں سوال کے ذریعے ہو، تو یہ کوشش کرنے والا اسے اپنی کوشش، محنت اور مشقت سے آسانی اور راحت کے ساتھ عطا کرتا ہے۔ اور امور کی تفصیلات کا علم، اور ان کی تفصیلات اور تقسیم کس چیز کی طرف لوٹتی ہے؟ کیا اصل کی طرف جو کہ اسماء الٰہیہ ہیں، یا قابلوں کی طرف جو کہ ممکنات کی اعیان ہیں، یا مجموعہ کی طرف؟ جو بھی امر ہو جس میں تفصیل اور تقسیم مطلوب ہو۔ اور جزا کا علم، اور وعدے کی سچائی نہ کہ وعید کی، اور فرشتوں اور مفارقت اختیار کرنے والی ارواح کا علم جو جسمانی صورتوں میں اٹھائی گئی ہیں، اور اتفاق کے علم سے اختلاف کا علم، اور کس چیز میں اتفاق ہونا چاہیے اور کس چیز میں اختلاف ہونا چاہیے، اور کیا اختلاف کے لیے موافقت کی طرف کوئی راستہ ہے یا نہیں؟ اور اس سبب کا علم جس سے وہ شخص نبوت کا دعویٰ کرتا ہے جو نبی نہیں ہے، اور وہ متنبئ (جھوٹا نبی) ہے۔ اور عالم میں بھول (السهو) کے سبب کا علم، اور فتنوں اور جنگوں (الملاحم) کا علم، اور اللہ سے کشف (الکشف) پر لینے کی صورت کا علم کہ وہ کیسی ہوتی ہے، اور اس نے لینے والوں میں ان کے اعمال سے تکلیف کے زمانے میں کیا نتیجہ پیدا کیا، اور حقوق عطا کرنے کے بعد مسامرت (راز و نیاز) کا علم، اور بعض مواطن میں پردہ پوشی (الستر) اور ظہور الٰہی (التجلی) کا علم، اور حقوق کی ادائیگی کا علم، اور کون حقدار کے حق طلب کرنے کے بعد ادا کرتا ہے اور کون اس میں پہل کرتا ہے، اور یقین (الیقین) کی علامتوں کا علم، اور اشیاء کی \"کہاں\" (أینيات) کا علم، اور ہر \"کہاں\" اس شیئیت کے امتیاز سے ممتاز ہوتا ہے جو اسے طلب کرتی ہے۔ اور اشیاء کے درمیان تشبیہ کا علم، ان روابط کی وجہ سے جو انہیں جمع کرتے ہیں اور ان وجوہ کی وجہ سے، اگرچہ دیگر امور انہیں جدا کرتے ہیں، تو جامع کا حکم زائل نہیں ہوتا، جیسا کہ جدا کرنے والے کا حکم زائل نہیں ہوتا، کیونکہ وہ چیز کی ذات کو قائم کرنے والا حکم ہے۔ اور زائرین کے حقوق کا علم، اور مہمان کے لیے کھانے سے پہلے سلام کو مقدم کرنے کے سبب کا علم، اور کلام سے پہلے کھانے کو مقدم کرنے کا علم، اور وہ چیز جو مہمان پر لازم ہے کہ وہ کہے اور جس سے وہ صاحب خانہ کو پہچانے، اور وہ جو اس پر لازم نہیں ہے۔ اور رسالت کا علم، اور رسالت کی ادائیگی کے وقت بعض حالات میں فرشتہ کا انسانی صورت میں ظاہر ہونے کا سبب کیا ہے، اور بشری رسالت کا علم، اور الٰہی گرفتوں (الأخذات الإلهية) کا علم، اور قوت کے اثر کا علم، کیا وہ قوی میں اثر کرتا ہے یا مطلق ضعیف میں یا اضافی ضعیف میں؟ اور تمہید، سیاستوں، قوانین (النوامیس) اور شریعتوں کا علم، اور میاں بیوی کے درمیان پیداوار اور نتیجہ خیزی کا علم، اور وہ چیز جو ذات حق (الحق) نے اپنے بندوں سے مطلق اور عمومی طور پر اور مقید طور پر طلب کی ہے۔",
    "fa": "«باب سیصد و سی و سوم: در معرفت منزلتی که اشیاء را برای تو آفریدم و تو را برای خود آفریدم؛ پس آنچه را که برای من آفریده‌ام، در آنچه برای تو آفریده‌ام، هتک مکن. و این منزلت از حضرت (حضور) موسوی است.»\n\n> إن النفوس لتجزى بالذي كسبت *** من كل خير ولا تجزى بما اكتسبت‏\n> ما الاكتساب بكسب إن علمت به *** جنيت من خير يوم الدين ما غرست‏\n\nنفوس به آنچه کسب کرده‌اند، پاداش داده می‌شوند *** از هر خیری، و به آنچه اکتساب کرده‌اند، پاداش داده نمی‌شوند.\nاکتساب، کسب نیست اگر به آن علم یابی *** در روز دین، از خیر آنچه کاشتی، درو خواهی کرد.\n\n### [اینکه خداوند متعال همه مخلوقات را در مقام خواری و نیازمندی آفرید]\n\nبدان، خداوند تو را تأیید کند، که خداوند متعال همه مخلوقات را در مقام خواری و نیازمندی (الذلة والافتقار) و در منزلت معین خودشان آفرید. پس هیچ یک از این مخلوقات خدا را یارای ترقی از مقامی که در آن آفریده شده‌اند نیست، مگر ثقلین (جن و انس)؛ زیرا خداوند آنان را در مقام عزت آفرید و در غیر مقامی که در هنگام قطع شدن نفس‌هایشان در زندگی دنیا به آن منتهی می‌شوند. پس آنان را ترقی به سوی مقاماتی است که شهود (الشهود) را برایشان به ارث می‌آورد، و نزول به سوی مقاماتی که ایستادن پشت حجاب را برایشان به ارث می‌آورد. پس آنان در برزخ دو راهی هستند: «إِمَّا شَاكِراً فَيَعْلُو وَإِمَّا كَفُوراً فَيَسْفُلُ» (یا شکرگزار است و بالا می‌رود، یا ناسپاس است و فرو می‌افتد).\n\nخداوند متعال می‌فرماید: «وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ» (و جن و انس را نیافریدم مگر برای آنکه مرا عبادت کنند). جز در مورد عبادت سخنی نگفت. پس چون عبادت را در اختیار آنان قرار داد و آن را مقصود خود از آفرینششان ساخت، برخی از آنان به آنچه برایش قصد شده بودند قیام کردند و فرمانبردار و مطیع امر الهی بودند که با اعمال و عبادت بر آنان وارد شده بود. زیرا به آنان فرمود: مرا عبادت کنید، چنانکه خبر داد: «إِنَّنِي أَنَا اللَّهُ لَا إِلَهَ إِلَّا أَنَا فَاعْبُدْنِي» (همانا من الله هستم، هیچ معبودی جز من نیست، پس مرا عبادت کنید). این امر به عبادت است. و «وَأَقِمِ الصَّلَاةَ لِذِكْرِي» (و نماز را برای یاد من برپا دار). این امر به عمل است. و عمل، عبادت نیست؛ بلکه عمل صورت است و عبادت روح آن. پس عبادت در هر حال نزد خدا پذیرفته است، چه با عمل همراه باشد و چه نباشد. اما عمل بدون عبادت، در هر حال پذیرفته نیست، از حیث قصدکننده‌ی وقوع آن که نفس مکلف است. اما از حیث اینکه عمل از جوارح (اعضای بدن) یا از یک جارحه‌ی مخصوص صادر شده باشد، آن جارحه به واسطه‌ی آن پاداش داده می‌شود و عمل برای کسی که از او ظاهر شده پذیرفته می‌شود، ولی چیزی از آن به نفس (النفس) امرکننده به جوارح باز نمی‌گردد، اگر عمل از نظر صورت خیر باشد، مانند نماز ریاکار و منافق و هر آنچه از افعال خیر بر جوارح او ظاهر می‌شود که نفس با آن قصد عبادت نکرده است. اما اعمال شرّی که از آن‌ها نهی شده، نفس به دلیل قصد، پاداش (مجازات) داده می‌شود و جوارح پاداش داده نمی‌شوند؛ زیرا در توان آن‌ها نیست که از آنچه نفوس از آن‌ها از حرکات می‌خواهند، امتناع ورزند. آن‌ها مجبور به شنیدن و اطاعت از نفوس هستند. پس اگر نفوس ستم کنند، بر عهده‌ی خودشان است و از جوارح حرج برداشته شده است، بلکه برای آن‌ها خیر کامل است. و اگر نفوس عدالت ورزند، برای خودشان و برای جوارح است. زیرا نفوس، والیان حق (الحق) بر این جوارح هستند و جوارح مأمور، مجبور و غیرمختار در آنچه به کار می‌روند، می‌باشند. پس آن‌ها از هر جهت مطیع هستند، در حالی که نفوس چنین نیستند.\n\nو برخی از نفوس به آنچه برایش قصد شده بودند قیام نکردند، پس عاصی و مخالف امر خدا بودند، هنگامی که او را به اعمال و عبادت امر کرد. پس از شخص فرمانبردار (الطائع)، عبادت در حالت اضطرار و اختیار واقع می‌شود، حتی اگر از حیث امر به عمل، مطیع نباشد. اما اگر مطیع و فرمانبردار باشد، به وقوع آنچه در خلق و امر برایش قصد شده بود، رستگار شده است. زیرا «أَلَا لَهُ الْخَلْقُ وَالْأَمْرُ تَبَارَكَ اللَّهُ رَبُّ الْعَالَمِينَ» (آگاه باشید که آفرینش و فرمان از آن اوست، پربرکت است خداوند، پروردگار جهانیان). اما عاصی، عبادت از او واقع نمی‌شود مگر در حال اضطرار، نه در حال اختیار. و از او صورت عمل واقع می‌شود، نه عمل مشروع برای او. پس او مخالف امر خداست و به آنچه از خلق و امر برایش قصد شده بود، قیام نکرده است.\n\nو چون خداوند ثقلین (جن و انس) را در این مقامی که با آفرینششان قصد کرده بود، یعنی تجلی حق (أجلية الحق)، آفرید، آنان را برای آن فارغ ساخت تا به واسطه‌ی مشغول شدن به آنچه قوامشان به آن است، حجتی بر ایشان نباشد. پس اشیائی را که قوامشان به آن‌هاست، به طور خاص برای آنان آفرید تا برای آنچه به خاطر آن قصد شده‌اند، فارغ شوند. پس اگر به آنچه برایش آفریده شده‌اند قیام نکنند، حجت خدا بر آنان تمام است. سپس خداوند دانست که برای برخی از آنان شبهه‌ای در تلاش برای آنچه به خاطرش آفریده شده‌اند، در حق دیگری پیش می‌آید، به دلیل آنچه به او رسیده است:\n[حدیث قدسی:] «إن الله يقول جعت فلم تطعمني وقال لما قال له العبد يا رب وكيف تطعم وأنت رب العالمين فقال الله له أ لم تعلم أنه استطعمك فلان فلم تطعمه أ ما أنك لو أطعمته وجدت ذلك عندي» (خداوند می‌فرماید: گرسنه شدم و مرا طعام ندادی. و هنگامی که بنده به او گفت: پروردگارا، چگونه طعام دهی در حالی که تو پروردگار جهانیانی؟ خداوند به او فرمود: آیا ندانستی که فلان شخص از تو طعام خواست و تو او را طعام ندادی؟ بدان که اگر او را طعام می‌دادی، آن را نزد من می‌یافتی).\nپس حق (الحق) خود را در منزلت آن گرسنه قرار داد. هنگامی که این شبهه برای آن شخص آشکار شد، گفت: در حق دیگری تلاش می‌کنیم و به حکم تبعیت از آنچه تلاش می‌کنیم، بهره می‌بریم. خداوند به او فرمود: آنچه را که از شما می‌خواهم، نفهمیدی: «مَا أُرِيدُ مِنْهُم مِّن رِّزْقٍ وَمَا أُرِيدُ أَن يُطْعِمُونِ * إِنَّ اللَّهَ هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ» (از آنان روزی نمی‌خواهم و نمی‌خواهم که مرا طعام دهند. همانا خداوند است روزی‌دهنده، صاحب قوت و استوار)، نه شما. پس با تمام شدن آیه، دیگر حجتی برای آنان باقی نماند.\n\nاما اعتمادشان بر آن خبر (حدیث قدسی)، حجتی نزد خدا برایشان نمی‌آورد. زیرا هنگامی که اشیاء را که قوام تو به آن‌هاست، برای تو آفرید، آن‌ها را به تو بخشید و به تو رساند تا قوام تو به آن‌ها باشد. سپس به برخی از آنان بیش از قوامشان فضل داد تا آن را به دیگری برساند و قوام آن دیگری به آن باشد، و برای این شخص پاداش ادای امانتی که خدا او را بر آن امین ساخته، حاصل شود. پس آن (شخصی که در حدیث مورد عتاب قرار گرفت) کسی است که حق (الحق) او را عتاب کرد، زیرا فلان شخص از او طعام خواست و او چیزی داشت که از قوامش زیادتر بود، اما به او نداد. پس از این خبر لازم نمی‌آید که شخص در حق دیگری تلاش کند، و این همان مراد در تمامیت آیه است که می‌فرماید: «مَا أُرِيدُ مِنْهُم مِّن رِّزْقٍ وَمَا أُرِيدُ أَن يُطْعِمُونِ» (از آنان روزی نمی‌خواهم و نمی‌خواهم که مرا طعام دهند).\n\nو چون خداوند انسان را آفرید و به او جدل (مناقشه) بخشید، برخی از آنان گفتند: هنگامی که فلان شخص از من طعام خواست و من چیزی داشتم که از قوامم زیادتر بود، اگر برای این طعام‌خواه امانتی نزد من بود، نمی‌توانستم آن را نگه دارم، به همین دلیل او را طعام ندادیم. به او گفته می‌شود، همان که به ابلیس گفته شد: چه زمانی دانستی که این (امانت) برای او نیست؟ آیا بعد از آنکه او را منع کردی، یا قبل از آن؟ آیا خداوند علم کشف (الکشف) به تو داد که این برای او نیست، یا صاحبش را برای تو معین کرد؟ یا اینکه ندانستی که برای او نیست مگر بعد از منع کردن تو و روی برگرداندن او از تو؟\nناگزیر باید بگوید: بعد از منع کردن دانستم. پس به او گفته می‌شود: به همین دلیل مؤاخذه شدی. زیرا ابلیس به حق (الحق) گفت: مرا به چیزی امر کردی که نمی‌خواستی از من واقع شود. اگر سجده برای آدم را از من می‌خواستی، سجده می‌کردم. خداوند به او فرمود: چه زمانی دانستی که سجده را از تو نخواستم؟ آیا بعد از وقوع امتناع تو و گذشت زمان امر، یا قبل از آن؟ ابلیس گفت: بعد از وقوع امتناع دانستم که اگر سجده را از من می‌خواستی، سجده می‌کردم. خداوند به او فرمود: به همین دلیل تو را مؤاخذه کردم. و هیچ کس مؤاخذه نمی‌شود مگر به واسطه‌ی جهل. زیرا اهل علمی که خداوند آنان را بر آنچه از حوادث در خلقش پیش از وقوع آن‌ها رخ می‌دهد، مطلع ساخته است، بر آنچه از آنان واقع نشده و به واسطه‌ی امر شده‌اند که واقع شود، مؤاخذه نمی‌شوند. زیرا آنان در عین قربت (القربة) به واسطه‌ی اطلاع هستند، و مراد از امتثال امر جز قربت نیست، و جایگاه قربت، جایگاه تکلیف نیست. پس اگر از مقربان اعمال طاعات واقع شود، به شهود (الشهود) است. زیرا آنان بر بینه‌ای از پروردگارشان هستند، پس از حیث شهود امر الهی، بدون واسطه‌ای که آن را آورده، عمل می‌کنند. پس در ظاهر، از نظر صورت، پیرو امر با واسطه هستند، و در باطن، صاحبان عین (حقیقت) هستند نه پیرو.\n\nپس حاصل این است که هر کس در هیچ حالی از عبودیت خود نسبت به خدا غایب نشود، آنچه را که برایش آفریده شده، ادا کرده و فرمانبردار بوده است، چه مطیع باشد و چه مخالف. زیرا بنده فراری، فرارش او را از بردگی خارج نمی‌کند، بلکه او را از لوازم عبودیت، یعنی ایستادن در برابر مولایش برای امتثال اوامر و رسومش، خارج می‌سازد. آیا نمی‌بینی که نام عبودیت بر او جاری است، چه مطیع باشد و چه مخالف، همان‌گونه که نام فرزندی بر پسر باقی می‌ماند، چه نیکوکار باشد و چه عاق؟ پس بنده‌ای که به آنچه برایش آفریده شده وفا کرده است، حال او در نفس خود از دو حالت خارج نیست: یا مشهود او، ارزش (قیمت) خودش است، پس در مقام ارزش خود قیام می‌کند و فروتنی، تسلیم و خضوع با او همراه می‌شود؛ یا در حال اعتزاز (سرافرازی) به مولایش قرار داده می‌شود، پس عجب و نخوت به واسطه‌ی آن بر او ظاهر می‌شود، مانند عتبه غلام، هنگامی که فخر فروخت و در این باره به او گفته شد، گفت: چگونه فخر نورزم در حالی که مولایی برای من شده و من بنده‌ی او شده‌ام؟ همان‌گونه که امر در نفس خود چنین است، اما فضل در این است که آن امر برای او مشهود باشد. پس این دو حالت، هر دو ستوده هستند و هر یک از آن‌ها گواهی می‌دهد که بنده به آنچه برایش آفریده شده وفا کرده است. و باقی می‌ماند که کدام یک از این دو حالت برای بنده سزاوارتر است: آیا شهود ارزش (القيمة) یا اعتزاز به مولا؟ برخی قائل به این هستند و برخی قائل به آن، و صحیح نزد من عدم ترجیح در این باره است، به دلیل آنچه ذکر خواهیم کرد.\n\nو این بدان سبب است که مقامات و مواطن (جایگاه‌ها) متفاوتند. پس در موطنی که ظهور اعتزاز (سرافرازی) به خدا را می‌طلبد، شایسته نیست که بنده جز با اعتزاز به خدا ظاهر شود. و موطنی که ذاتاً اقتضا می‌کند و شهود ارزش بنده را می‌طلبد، شایسته نیست که این بنده جز با شهود ارزش خود ظاهر شود. برخی در مورد اعتزاز به این سخن خداوند متعال استدلال کرده‌اند: «فَفَرَرْتُ مِنكُمْ لَمَّا خِفْتُكُمْ» (پس چون از شما ترسیدم، از شما گریختم) و به امر خداوند متعال: «فَفِرُّوا إِلَى اللَّهِ» (پس به سوی خدا بگریزید). و این حجت برای هر دو گروه است؛ زیرا ممکن است به سوی خدا بگریزد تا اعتزاز به خدا را طلب کند، و ممکن است به سوی خدا بگریزد تا خواری و نیازش تنها به سوی خدا باشد نه به سوی دیگری، زیرا او بر نیاز و افتقار (الافتقار) سرشته شده است. به همین دلیل، پس از امر به فرار به سوی خداوند متعال، فرمود: «وَلَا تَجْعَلُوا مَعَ اللَّهِ إِلَهًا آخَرَ» (و با خدا معبود دیگری قرار ندهید) که به او نیازمند شوید، بلکه برای طلب حوائجتان که بر آن سرشته شده‌اید، به سوی خدا بَرّید.\n\nو اما فرار موسی علیه السلام که علت آن را ترس از فرعون و قومش بیان کرد، ترس او جز از خدا نبود که مبادا آنان را بر او مسلط سازد، زیرا این امر برای خدا ممکن است و او نمی‌دانست در علم خدا چیست. پس فرار او به سوی پروردگارش بود تا به او اعتزاز یابد. پس پروردگارش به او حکمت و علم بخشید و او را از زمره‌ی رسولان قرار داد تا با اعتزاز به خدا، به سوی کسانی که از آن‌ها می‌ترسید، فرستاده شود. و او را با آیات روشن تأیید کرد تا آنچه را که حکم طبیعت در این نشأت (آفرینش) می‌طلبد و ضعیف شده بود، تقویت کند. زیرا طبیعت ضعفی عظیم دارد، به این دلیل که بین آن و ارواحی که بر آن قدرت و سلطه دارند، واسطه و حجابی نیست. پس ترس، مانند سایه، ملازم شخص است. صاحب طبیعت قوی نمی‌شود مگر زمانی که به واسطه‌ی روح تأیید شود. پس ضعف طبیعت در او تأثیر نمی‌گذارد. زیرا بیشترِ وجود او جریان طبیعت است، و روحانیت او که نفس مدبر اوست، نیز از طبیعت موجود شده است، پس طبیعت مادر اوست، اگرچه پدرش روح باشد. و مادر در فرزند اثر دارد، زیرا او در رحم مادر شکل می‌گیرد و از آنچه نزد مادر است تغذیه می‌شود. پس نفس به واسطه‌ی پدرش قوی نمی‌شود مگر زمانی که خداوند آن را با روح قدسی تأیید کند که به آن نظر دارد. در آن هنگام بر حکم طبیعت قوی می‌شود و تأثیر کلی در آن نمی‌گذارد، اگرچه اثری از آن باقی بماند، زیرا زوال کلی آن ممکن نیست.\n\n### [اینکه طبیعت زاینده است و عقیمی در آن نیست]\n\nو بدان که طبیعت زاینده است و عقیمی در آن نیست، و بسیار دوستدار و متمایل به همسر خود است به طلب ولادت، زیرا فرزندان را دوست دارد و نسبت به اولاد خود مهری عظیم دارد و با آن مهر آنان را به سوی خود می‌کشاند، زیرا تربیت آنان در دست اوست و جز او را نمی‌شناسند. به همین دلیل، بیشتر فرزندان را نمی‌بینیم مگر بردگان طبیعت که از محسوسات و لذات طبیعی جدا نمی‌شوند، مگر اندکی از آنان که به پدر خود نظر دارند و آنان «متروحنین» (روحانی‌شدگان) هستند. و نشانه‌ی آنان عدم تنوع در صور نیست، زیرا تنوع در صور همان‌گونه که برای آنان هست، برای طبیعت نیز هست. بلکه نشانه‌ی روحانی‌شدگان بر اینکه فرزندان پدرشان هستند، تنزه آنان از شهوات طبیعی و گرفتن از آن به اندازه‌ای است که نشأتشان را با آن برپا دارند، چنانکه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «حسب ابن آدم لقيمات يقمن صلبه» (برای فرزند آدم چند لقمه که پشت او را راست نگه دارد، کافی است).\nهمت آنان پیوستن به پدرشان است که همان روح الهی «یائی» است نه «امری». و ما آن را «یائی» گفتیم به دلیل سخن خداوند: «وَنَفَخْتُ فِيهِ مِن رُّوحِي» (و از روح خود در او دمیدم)، با یای اضافه به سوی خود. زیرا بین روح امر و روح یای اضافه فرق گذاشت. روح امر را برای آنچه تأیید به آن حاصل می‌شود قرار داد، و روح یاء را برای وجود عین روح که همان کلمه‌ی حق (كلمة الحق) دمیده شده در طبیعت است، قرار داد. پس او مانند حنین (ناله‌ی) فرزند به سوی پدرش ناله می‌کند تا به واسطه‌ی او بر آنچه از شهود حق (شهود الحق) می‌طلبد، تأیید شود؛ حقی که خارج از روح و طبیعت است، از حیث اینکه از آن دو بی‌نیاز است، نه از حیث اینکه برای فرزندان از آن دو یا به واسطه‌ی آن دو یا در آن دو تجلی (التجلی) می‌کند. همه‌ی این‌ها برای اوست. و این مطلبی عزیز است. پس هنگامی که به آن دست یابد و به واسطه‌ی آن قوی شود، به شهوات می‌آید به حکم منت‌گذاری بر آن‌ها، از روی نزول از جانب خود به سوی آن‌ها. پس او با شهوات بر مشتهیات حکم می‌کند، نه اینکه شهوتی بر او در مشتهیات حکم کند. پس او مشتهیِ شهوت است و دیگری تحت حکم شهوت. صاحب این مقام، عین شهوت را در نفس خود ایجاد می‌کند، از روی قضا و اجابت به سؤالات کسانی از عالم خاص او که مشتهی هستند. پس آنان به واسطه‌ی آن شهوت به آنچه می‌خواهند می‌رسند و روح حیوانی متنعم می‌شود، در حالی که او (نفس) به پروردگارش ناظر است و محجوب نیست، و حق (الحق) در اسم «الخلاق» برای او تجلی کرده و این اسم را بر او پوشانده است تا آنچه را که می‌خواهد از او تکوّن یابد، نه آنچه را که می‌پسندد. پس این‌ها نفوس فاضله و شریفی هستند که به کسی که از آن اوست، تشبه می‌جویند.\n\nپس به طبیعت، مانند نگاه فرزند نیکوکار به مادرش می‌نگرد، با وجود بی‌نیازی از او، برای وفای به حق او. و مردم در این حکم به اقسامی تقسیم شده‌اند: برخی خدا را به وفای حق عبودیت (العبودية) عبادت کردند، پس نشأت (آفرینش) آن را به کمال برپا داشتند و خلق آن را به آن دادند. و برخی خدا را به وفای حق ربوبیت که بر این بنده سزاوار است، عبادت کردند، پس نشأت سیادت خالق خود را بر خود برپا داشتند و خلق آن را به آن دادند، بدون نظر به نفس خود، همان‌گونه که اولی بدون نظر به سیادت مولایش بود، به آنچه ظاهر هر نشأت است، نه به آنچه در نفس‌الامر است؛ زیرا بنده در آنچه امور برای خود اقتضا می‌کنند، عملی ندارد. و برخی او را برای برپایی هر دو نشأت عبادت کردند، پس خلق هر دو را به آن‌ها دادند و نشأت عبودیت خود و نشأت سیادت مولای خود را برپا داشتند، و این در وجود و عین اوست، زیرا او محل ظهور این نشأت است. و برخی خدا را به دلیل اینکه مأمور به عبادت است، عبادت کردند و خبری از برپایی این نشأت‌ها نداشتند، پس او را به لازمه‌ی عبودیت عبادت کردند. پس عبادتشان از امر الهی است و ذاتی نیست. و برخی را خداوند در عبادت ذاتی برپا داشت، پس امر او جز در عمل حاضر نشد، نه در عبادت. و برخی او را به همه‌ی این وجوه عبادت کردند و او قوی‌ترین قوم در عبادت است، و نشأتی که از چنین بنده‌ای برپا می‌شود، کامل‌ترین نشأت‌ها از نظر خلقت است. زیرا برپایی نشأت ضروری است؛ اگر مقصود بنده باشد، به او نسبت داده می‌شود و بر آن ستوده می‌شود، و اگر مقصود بنده عابد نباشد، حق تعالی آن را برپا می‌دارد و به خدا نسبت داده می‌شود و بر آن ستوده می‌شود، با وجود ظهور آن از عابد. و قصد به ایجاد آن، بهتر از غفلت از آن یا جهل به آن است. پس برخی از مردم آنچه را که ایجاد می‌کنند، شهود می‌کنند، و برخی آنچه را که ایجاد می‌کنند، شهود نمی‌کنند، زیرا نمی‌دانند که ایجاد می‌کنند. پس خداوند ایجاد آن را بدون علم او بر عهده می‌گیرد تا صورت نشأت برپا شود، و در آن هنگام عابد آن را صادر شده از خود شهود می‌کند و خدا را می‌ستاید که چنین چیزی از او ظاهر شده است. پس آنان در این باب، یعنی باب عبادت، بر طبقاتی هستند. و همچنین حکم در مورد صور اعمال ظاهری و باطنی که از آنان ایجاد می‌شود، آنان در آن بر طبقات مختلفی هستند؛ برخی جامع همه هستند و برخی پایین‌تر از درجه‌ی جمع.\n\nسپس بدان که احد (الأحد) هرگز چیزی از او صادر نمی‌شود، و اولین عدد، دو است، و از دو نیز هیچ چیز صادر نمی‌شود، مگر اینکه سومی باشد که آن دو را به هم پیوند دهد و برخی را به برخی دیگر مرتبط سازد و جامع آن دو باشد. در آن هنگام، آنچه تکوّن می‌یابد، بر حسب حالتی است که آن دو بر آن هستند، خواه از اسماء الهی باشند یا از اکوان معنوی یا محسوس، هر چه که باشند. ناگزیر امر باید بر آنچه ذکر کردیم باشد. و این حکم اسم فرد (الفرد) است. پس سه، اولین افراد است، و از این اسم است که آنچه از اعیان ممکنات ظاهر شده، پدید آمده است. هیچ ممکنی از واحد (یک) به وجود نیامده، بلکه از جمع به وجود آمده است، و کمترین جمع، سه است که همان فرد است. پس هر ممکنی به اسم فرد نیازمند شد. سپس چون اسم فرد، مثلث‌الحکم بود، در ممکنی که ایجاد می‌کند، سه امر را قرار داد که ناگزیر باید آن‌ها را در نظر بگیرد و در آن هنگام آن را ایجاد کند. و چون نهایت در مجموع سه است که اولین افراد و کمترین جمع است و مقصود با آن حاصل می‌شود و از افزودن چهارمی بی‌نیاز است، نهایت قوت مشرک، سه بود. پس گفت: «إِنَّ اللَّهَ ثَالِثُ ثَلَاثَةٍ» (همانا خدا سومین از سه است) و بر آن نیفزود. و از هیچ مشرکی به خدا حکایت نشده که غیر از «ثالث ثلاثه» گفته باشد؛ نه «رابع اربعه» آمده و نه «ثامن ثمانیه» و مانند آن. و به همین ترتیب، در بسمله سه اسم ظاهر شد، زیرا کسی که تکوین را به او داده‌اند، می‌گوید: «بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ» (به نام خداوند بخشنده‌ی مهربان). و تکوین الهی از قول «كُنْ» (باش) است که سه حرف است: کاف، واو و نون. واو بین کاف و نون ظهوری ندارد به دلیل امری عارضی که سکون نون و سکون واو به آن داده است، جز اینکه برای نون سکون امر است. پس بنگر که سریان فردیت اولیه چگونه در بروز اعیان ظاهر شده است. و در آنچه تکوّن می‌یابد، سه امر را در نظر بگیر که آن‌ها را حقوق قرار داده است. پس هر کس از عابدان ایجادکننده‌ی صور اعمال و عباداتشان، این حقوق را هنگام اراده‌ی ایجاد آن‌ها حاضر کند و حق هر صاحب حقی را در این نشأت‌ها بدهد، نزد خدا کامل‌تر و بالاتر از کسی است که آنچه را او قصد کرده، قصد نکرده است.\n\nو صورت ایجاد شده سه حق دارد که ایجادکننده‌ی فرد، حق واحد (الحق الواحد) برای خدا، آن‌ها را قصد می‌کند: یکی آنچه که از تنزیه یا تسبیح به حمدش، از آن (صورت) سزاوار است. و حق نفسِ صورت از اسم فرد (الفرد)، که همان ایجاد آن پس از نیستی است تا در حضرت هستی (حضرة الوجود) متمایز شود و به آن رنگ پذیرد و به آنچه صفت خالق و ایجادکننده‌ی آن است، یعنی الله، ملحق شود. و این درجه‌ی اول از درجات تشبه به او برای ظهور در هستی (الوجود) و رنگ‌پذیری به آن است. و حق سوم، مصلحتی است که غیر در وجود آن دارد. پس آن نشأت، حق آن غیر را از خود به او می‌دهد، و این مقصود ایجادکننده‌ی آن است. و آن غیر دو صنف است: صنف اول، اسماء الهی (الأسماء الإلهية) هستند که آثارشان ظاهر می‌شود، و ظهور آن آثار متوقف بر وجود این عین است. و صنف دیگر، حقوق ممکناتی است که جز با وجود این صورت ایجاد شده، برای آن‌ها حاصل نمی‌شود. پس ایجادکننده در هنگام ایجاد، همه‌ی این امور را قصد می‌کند. در نتیجه، ثنای الهی بر این عابد، بر حسب آنچه از آن حاضر کرده و قصد نموده، خواهد بود. پس برخی از آنان همه‌ی این‌ها را در صورت عبادت و صورت عمل خود جمع می‌کنند، و تثلیث (سه گانگی) به دلیل وجودش در اصل، در همه‌ی امور جاری می‌شود.\n\nو به همین دلیل، در مورد کسی که قائل به تثلیث (سه گانگی) است، فرمود که او کافر است و گفت: «لَّقَدْ كَفَرَ الَّذِينَ قَالُوا إِنَّ اللَّهَ ثَالِثُ ثَلَاثَةٍ» (به تحقیق کافر شدند کسانی که گفتند خدا سومین از سه است). و او را مشرک ننامید، زیرا او آنچه را که شایسته بود هنگام قائل شدن به آن بیان کند، پوشاند. اگر صورت آن را آشکار می‌کرد، همین را که ما گفتیم، می‌گفت و حق برای شنونده در آن روشن می‌شد. پس چون این بیان را پوشاند، او را کافر نامید، زیرا «وَمَا مِنْ إِلَهٍ إِلَّا إِلَهٌ وَاحِدٌ» (و هیچ معبودی جز خدای یگانه نیست)، اگرچه احکام مختلفی دارد که ناگزیر از آن‌هاست. پس اگر این کافر پرده‌پوشی نمی‌کرد و آشکار می‌ساخت، آنچه را که امر بر آن است، می‌گفت. اما کسی که ادعا می‌کند آلهه سه تا هستند، او مشرکی جاهل است، و پناه می‌بریم به خدا از اینکه عاقلی از مشرکان باشد. پس عدد، احکام واحد است. و عدد در اسماء الحسنی آمده است، و آمده است: «قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَّا تَدْعُوا» (بگو: الله را بخوانید یا رحمان را بخوانید، هر کدام را که بخوانید)، از حیث دلالتش بر عین مسمی، «فَلَهُ الْأَسْمَاءُ الْحُسْنَى» (پس برای اوست نام‌های نیکو) که الله و رحمان از جمله‌ی آن‌ها هستند، از حیث اینکه اسم هستند. اما فهم‌ها از درک آنچه خداوند در خطاب خود، به هر زبانی که باشد، اراده می‌کند، قاصر است. این بخشی از مطالبی است که در این منزلت ذکر کردیم. پس بگذارید آنچه را که از علوم نافع در بر دارد، به طریق تذکر (الذکرى) بیان کنیم، زیرا «فَإِنَّ الذِّكْرَى تَنفَعُ الْمُؤْمِنِينَ» (همانا تذکر مؤمنان را سود می‌بخشد). پس می‌گوییم: «وَاللَّهُ يَقُولُ الْحَقَّ وَيَهْدِي مَن يَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيمٍ» (و خداوند حق را می‌گوید و هر که را بخواهد به راه راست هدایت می‌کند).\n\nاز جمله آن علوم، علم اسماء تکوین، علم حروف تکوین، علم ارواح متفرقه نه جامعه، علم امور حامل اشیاء، اینکه مقصود از حمل آن‌ها چیست و حمل به سوی چه کسی منتهی می‌شود، علم تلاش‌ها (السعایات)، اینکه نهایت آن‌ها چیست و مقصود از آن‌ها برای تلاش‌کنندگان چیست؟ آیا برای رسیدن به چیزی است که نزدشان نیست، یا برای رساندن آنچه نزدشان هست به کسی که آن را می‌طلبد، خواه به ذات خود که همان طلب ذاتی است، و خواه به واسطه‌ی سؤال از او در آن باره، که این تلاش‌کننده با آسانی و راحتی از تلاش و کوشش و مشقت خود به او می‌دهد. و علم جزئیات امور و اینکه جزئیات و تقسیم آن‌ها به چه چیزی باز می‌گردد؟ آیا به اصل که همان اسماء الهی (الأسماء الإلهية) است، یا به قوابل که همان اعیان ممکنات هستند، یا به مجموع؟ هر امری که از اموری باشد که تفصیل و تقسیم را می‌طلبد. و علم جزا و صدق وعده نه وعید. و علم مدارج ملائکه و ارواح مفارقی که در صور جسمانی حمل می‌شوند. و علم خلاف از علم اتفاق، و اینکه در چه چیزی شایسته است اتفاق باشد و در چه چیزی شایسته است اختلاف باشد، و آیا اختلاف وجهی به سوی موافقت دارد یا خیر. و علم سببی که از آن کسی که پیامبر نیست، ادعای نبوت می‌کند که همان متنبّی (مدعی نبوت) است. و علم سبب سهو در عالم. و علم فتنه‌ها و ملاحم (جنگ‌های بزرگ). و علم صورت گرفتن (الأخذ) از خدا چگونه بر کشف (الکشف) واقع می‌شود و چه چیزی در گیرندگان از اعمالشان در زمان تکلیف ایجاد کرده است. و علم مسامره (هم‌صحبتی) پس از ادای حقوق. و علم ستر (پوشاندن) و تجلی (التجلی) در برخی مواطن. و علم ادای حقوق، و اینکه چه کسی پس از طلب صاحب حق، حق او را ادا می‌کند و چه کسی به آن مبادرت می‌ورزد. و علم علامات یقین. و علم «أینیت» (کجایی) اشیاء، و هر أین به تمایز شیئیت که آن را می‌طلبد، متمایز می‌شود. و علم تشبیه بین اشیاء به دلیل روابط و وجوهی که آن‌ها را جمع می‌کند، اگرچه امور دیگری آن‌ها را جدا سازند، پس حکم جامع از بین نمی‌رود، همان‌گونه که حکم فارق از بین نمی‌رود، زیرا آن حکم، قوام‌دهنده‌ی ذات شیء است. و علم حقوق زائران. و علم سبب مقدم داشتن سلام بر طعام دادن به مهمان وارد شده، و مقدم داشتن طعام قبل از کلام. و علم آنچه بر مهمان واجب است بگوید و صاحب منزل را با آن بشناساند و آنچه بر او واجب نیست. و علم رسالت و ظهور ملک در صورت بشر هنگام ادای رسالت، که سبب آن در برخی احوال دون برخی دیگر چیست. و علم رسالت بشری. و علم اخذات الهی. و علم تأثیر قوت، آیا در قوی تأثیر می‌گذارد یا در ضعیف مطلق یا ضعیف اضافی. و علم تمهید و سیاست‌ها و نوامیس و شرایع. و علم نتاج و انتاج بین زوجین. و علم آنچه حق (الحق) از بندگان خود به طور مطلق و عمومی و به طور مقید طلب کرده است."
  },
  "page_count": 5
}