{
  "id": 523,
  "title": {
    "ar": "الباب الثالث والعشرون وخمسمائة في معرفة حال قطب كان منزله وأَمَّا من خافَ مَقامَ رَبِّهِ",
    "en": "Chapter Five Hundred and Twenty-Three: Concerning the Knowledge of the State of a Spiritual Pole (*Qutb*), whose Station (منزله) was [derived from the verse]: <<وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ>> (And as for him who feared the Station of his Lord).",
    "ur": "باب پانچ سو تئیس (۵۲۳): اس قطب (قطب) کے حال کی معرفت (معرفت) میں جس کا منزل (منزل) اس آیت سے تھا: \"اور جو اپنے رب کے مقام سے ڈرا...\" (وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ)",
    "fa": "باب پانصد و بیست و سوم در معرفت حال قطبی که منزل او «و اما کسی که از مقام پروردگارش ترسید» بود."
  },
  "content": {
    "ar": "## «الباب الثالث والعشرون وخمسمائة في معرفة حال قطب كان منزله وأَمَّا من خافَ مَقامَ رَبِّهِ»\n\n\n> مقام الرب ليس له أمان *** يدل عليه ما يعطي العيان‏\n\n\n> فخفه لأنه خطر وفيه *** إذا ما خفته حالا امان‏\n\n\n> ونفسك فانهها عن كل أمر *** يضيق لهو له منك الجنان‏\n\n\n> فلا تعتب زمانا أنت فيه *** فأنت هو المعاتب والزمان‏\n\n\n> ولا تعمر مكانا لست فيه *** فرب الدار ليس له مكان‏\n\n\n> فأنت كهو فأنت له جليس *** ومؤنسك التعطف والحنان‏\n\n\n> وفيها الخلد والحور الحسان *** لذاك يقال منزلنا الجنان‏\n\n\nاعلم أيدنا الله وإياك أن المقام الإلهي الرباني ما وصف به نفسه ولما علمه صَلَّى اللهُ عَليهِ وسَلَّم حين أعلمه لذلك استعاذ به منه فقال وأعوذ بك منك‏\n\n\n### [أن لله التجلي في صور الاعتقادات‏]\n\n\nاعلم أن كل مقام سيد عند كل عبد ذي اعتقاد إنما هو بحسب ما ينشئه في اعتقاده في نفسه ولهذا قال الله مَقامَ رَبِّهِ فأضافه إليه وما أطلقه وما تجد قط هذا الاسم الرب إلا مضافا مقيد إلا يكون مطلقا في كتاب الله فإنه رب بالوضع والرب من حيث دلالته أعني هذا الاسم هو الذي يعطي في أصل وضعه أن يسع كل اعتقاد يعتقد فيه ويظهر بصورته في نفسه معتقده فإذا كان العارف عارفا حقيقة لم يتقيد بمعتقد دون معتقد ولا انتقد اعتقاد أحد في ربه دون أحد لوقوفه مع العين الجامعة للاعتقادات ثم إنه إذا وقف مع العين الجامعة\nللاعتقادات كلها فيه فيخاف إن يكون هذا القدر الذي اعتقده واحد مثل كل ذي اعتقاد في الرب فيتخيل أنه مع الرب وهو مع ربه لا مع الرب مع كونه بهذه المثابة في تسريحه وعدم تقييده وقوله به في كل صورة اعتقاد وإيمانه بذلك فلا يزال خائفا حتى يأتيه الْبُشْرى‏ في الْحَياةِ الدُّنْيا بأن الأمر كما قال فهذا حد إطلاق العبد في الاعتقاد ولو لم يكن الحق له هذا السريان في الاعتقادات لكان بمعزل ولصدق القائلون بكثرة الأرباب وقد قَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ في كل معتقد إذ هو عين كل معتقد ثم نصب الله لهذا العارف دليلا من نفسه بتحوله في نفسه في كل صورة وقبوله في ذاته عند إنشاء كل صورة ينشئها هذا المعتقد في قوله تعالى في أَيِّ صُورَةٍ ما شاءَ رَكَّبَكَ نظر إشارة لا تفسير فلو لا قبولك عند تسويتك وتعديلك لكل صورة ما ثبت قوله في أَيِّ صُورَةٍ ما شاءَ رَكَّبَكَ وقد صح وثبت هذا القول فعلمنا إن له التجلي في صور الاعتقادات فلا ينكر فكل من لم يعرف الله بهذه المعرفة فإنه يعبد ربا مقيدا منعزلا عن أرباب كثيرة إذا اتصف نفسه لم يدر أي رب هو الرب الحقيقي في نفس الأمر من هؤلاء الأرباب الذي في نفس كل معتقد ونَهَى النَّفْسَ في هذا الذكر عَنِ الْهَوى‏ هو النهي عن تقييده بمعتقد خاص عن معتقد فإنه عابد هوى ثم تمم الذكر في حق العارف الذي خافَ مَقامَ رَبِّهِ كما قلنا ونَهَى النَّفْسَ عَنِ الْهَوى‏ كما شرحنا فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوى‏ يقول مقامه ستر هذا العلم بالله الذي حصل له فإنه مهما ظهر عليه كل صاحب اعتقاد مقيد أنكره عليه وجهله إن كان ذا نظر وربما كفره إن كان ذا إيمان فلا يعرف من خافَ مَقامَ رَبِّهِ إلا من خافَ مَقامَ رَبِّهِ غيره فلا يعرفه‏\n\n\n> فكن في أمان أن يقول بقولكم *** شخيص له في ربه الحصر والقيد\n\n\n> فمن يعتقد في الله ما قد شرحته *** فذاك هو المكر الإلهي والكيد\n\n\n> وكيف يرى التقييد من هو مطلق *** له البدء فيما شاءه الحق والعود\n\n\nفإطلاق العبد قبوله لكل صورة يشاء الحق أن يظهره فيها فما ظنك بخالقه الذي له المشيئة فيه وهو سبحانه في تحوله في الصور لذاته غير مشي‏ء لذلك فإن المشيئة متعلقها العدم وهو الوجود فلا يكون مشاء لمشيئته بل لم يزل في نفسه كما تجلى لعبده فمشيئته إنما تعلقت بعبده أن يراه في تلك الصورة التي شاء الحق أن يراه فيها فإذا رآها العبد التبس بها وركبه الحق فيها وهو قوله من باب الإشارة في أَيِّ صُورَةٍ من صور التجلي ما شاءَ رَكَّبَكَ هذا في باب المعارف والاعتقادات وفي باب الخلق في أي صورة من صور الأكوان ما شاء ركبك‏\n\n\n> فخف مقام الرب إن أضفته *** ولا تخف منه إذا عرفته‏\n\n\n> فلا يخاف الرب غير مقيد *** أطلقته إن شئت أو أضفته‏\n\n\n> فإنه عين الذي تشهده *** فكن به الموصوف إن وصفته‏\n\n\n> لا نقتصر على الذي أشهدته *** ولا تزد في الكشف إن كشفته‏\n\n\n> فكن به ولا تكن أيضا به *** فذا هو الإنصاف إن أنصفته‏\n\n\nوالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 523: Concerning the Knowledge of the State of a Pole Whose Station Was: \"But as for him who feared the station of his Lord...\"\n\nThe Station of the Lord (مقام الرب) holds no security,\nWhat direct witnessing (العيان) grants points to this fact.\nSo fear it, for it is a danger, yet within it\nIf you fear it, there is immediate security.\nAnd forbid your soul from every matter\nWhose frivolity constricts the heart (الجنان) within you.\nDo not blame the time (زمان) in which you exist,\nFor you are the blamer, and you are the time.\nAnd do not inhabit a place where you are absent,\nFor the Lord of the House has no place.\nYou are like Him, so you are His companion (جليس),\nAnd your solace is compassion and tenderness.\nAnd in it are eternity (الخلد) and beautiful maidens (الحور الحسان),\nThus it is said, \"Our dwelling is the Gardens (الجنان).\"\n\nKnow—may Allah support us and you—that the Divine Lordly Station (المقام الإلهي الرباني) is that by which He described Himself. When the Prophet (peace and blessings be upon him) knew this, having been informed of it, he sought refuge in Him from Him, saying: \"And I seek refuge in You from You.\"\n\n### [That Allah has Theophany (التجلي) in the Forms of Beliefs (الاعتقادات)]\n\nKnow that every Lordly Station (مقام سيد) held by any servant possessing a belief (اعتقاد) is only according to what that servant establishes in his own belief concerning Him. This is why Allah said, \"the station of *his* Lord\" (مَقامَ رَبِّهِ), attributing it to the servant and not leaving it absolute. You will never find this Name, the Lord (الرب), except as attributed and qualified, unless it is absolute in the Book of Allah. For He is the Lord by designation (بالوضع), and the Lord, in terms of the meaning of this Name, is that which, in its original designation, encompasses every belief held concerning Him and manifests in the form of that belief within the believer's own soul.\n\nTherefore, if the Gnostic (العارف) is truly a Gnostic, he is not restricted by one belief over another, nor does he criticize the belief of anyone concerning his Lord over another, because he stands with the Comprehensive Essence (العين الجامعة) of all beliefs. Yet, when he stands with the Comprehensive Essence of all beliefs within Him, he fears that the measure he has believed in might be merely one belief, like every other possessor of belief concerning the Lord. He might imagine that he is with *The* Lord (الرب), when in fact he is only with *his* Lord (ربه)—despite his being in a state of release (تسريحه) and non-restriction, affirming Him in every form of belief and having faith in that. He remains fearful until the glad tidings (الْبُشْرى) come to him in the life of this world (الْحَياةِ الدُّنْيا) that the matter is indeed as he stated. This is the limit of the servant's release (إطلاق) in belief. If the Real (الحق) did not possess this pervasive flow (السريان) throughout all beliefs, He would be isolated, and those who assert the multiplicity of lords would be truthful. But \"Your Lord has decreed that you worship none but Him\" (قَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ) applies to every object of belief, for He is the very Essence (عين) of every object of belief.\n\nThen Allah established a proof for this Gnostic from Himself, through His transformation within Himself into every form, and His acceptance within His Essence (ذاته) when every form is originated by the believer. This is found in His saying, <<فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ>> (In whatever form He willed, He assembled you)—this is a glance of allusion (إشارة), not an exegesis (تفسير). Were it not for your acceptance when you equalize and adjust every form, His saying, <<فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ>> would not be established. Since this saying is sound and established, we know that He has Theophany (التجلي) in the forms of beliefs (الاعتقادات), and this cannot be denied.\n\nThus, whoever does not know Allah through this Gnosis (المعرفة) worships a restricted Lord (رباً مقيداً), isolated from many other lords. If he describes himself, he does not know which Lord is the Real Lord (الرب الحقيقي) in reality among these lords existing within the soul of every believer. The forbidding of the soul from caprice (عَنِ الْهَوَى) mentioned in this verse is the prohibition against restricting Him to one specific belief over another, for such a person is a worshipper of caprice (هوى). Then the verse is completed concerning the Gnostic who \"feared the station of his Lord\" (خَافَ مَقَامَ رَبِّهِ), as we stated, and \"forbade the soul from caprice\" (وَنَهَى النَّفْسَ عَنِ الْهَوَى), as we explained, <<فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَى>> (Then indeed, Paradise will be the refuge). This means that his station (مقامه) is the concealment of this knowledge of Allah that he has attained. For whenever he reveals it, every possessor of a restricted belief will deny it and deem him ignorant if they are thoughtful, and perhaps even declare him an unbeliever if they are faithful. Therefore, no one knows him who \"feared the station of his Lord\" except another who \"feared the station of his Lord\"; no one else knows him.\n\nSo be in security that no person will say your statement\nImplies restriction and limitation (القيد) concerning his Lord.\nFor whoever believes concerning Allah what I have explained,\nThat is the Divine Cunning (المكر الإلهي) and the Stratagem (الكيد).\nAnd how can restriction (التقييد) be seen by one who is absolute (مطلق)?\nFor him is the beginning and the return in whatever the Real (الحق) wills.\n\nThe servant's release (إطلاق) is his acceptance of every form in which the Real (الحق) wills to manifest Him. What then do you think of his Creator, who possesses the Will (المشيئة) concerning him? He (Exalted is He), in His transformation into forms for the sake of His Essence (لذاته), does not will that transformation, because the object of Will (المشيئة) is non-existence (العدم), and He is Existence (الوجود). Thus, He is not willed by His own Will. Rather, He has always been in Himself as He disclosed Himself (تجلى) to His servant. His Will is only related to His servant, that the servant should see Him in that form which the Real willed the servant to see Him in. When the servant sees it, he becomes attached to it, and the Real assembles him within it. This is His saying, by way of allusion (إشارة): <<فِي أَيِّ صُورَةٍ>> (In whatever form) of the forms of Theophany (التجلي) <<مَّا شَاءَ رَكَّبَكَ>> (He willed, He assembled you). This applies to the domain of Gnosis (المعارف) and beliefs (الاعتقادات). In the domain of Creation (الخلق), it means: In whatever form of the forms of the cosmos (الأكوان) He willed, He assembled you.\n\nSo fear the Station of the Lord (مقام الرب) if you restrict it,\nBut do not fear Him if you know Him (عرفته).\nThe Lord is not feared except by the restricted one (مقيد),\nWhether you release Him or restrict Him if you wish.\nFor He is the very Essence (عين) of what you witness (تشهده),\nSo be the one described by Him if you describe Him.\nDo not limit yourself to what He has made you witness,\nNor add to the Unveiling (الكشف) if you unveil Him.\nSo be by Him, yet also do not be by Him,\nFor that is fairness (الإنصاف) if you treat Him fairly.\n\nAnd Allah speaks the Truth (الحق), and He guides to the Way.",
    "ur": "باب نمبر ۵۲۳: اس قطب کے حال کی معرفت میں جس کا مقام تھا: \"اور جس نے اپنے رب کے مقام سے خوف کھایا۔\"\n\nرب کا مقام (مقام الرب) امان سے خالی ہے\nجس پر وہ چیز دلالت کرتی ہے جو عیاں (شہود) عطا کرتا ہے۔\n\nپس اس سے خوف کھا، کیونکہ وہ خطرناک ہے، اور اس میں\nجب تو اس سے خوف کھاتا ہے تو ایک حال (حالت) میں امان ہے۔\n\nاور اپنے نفس کو ہر اس امر سے روک\nجس کے لیے تیرا دل (جنان) تنگ ہو جاتا ہے۔\n\nاس زمانے کو ملامت نہ کر جس میں تو ہے\nکیونکہ تو ہی ملامت کرنے والا ہے اور تو ہی زمانہ ہے۔\n\nاور اس جگہ کو آباد نہ کر جہاں تو نہیں ہے\nکیونکہ رب الدار (گھر کے رب) کے لیے کوئی جگہ (مکان) نہیں ہے۔\n\nپس تو اسی کی مانند ہے، تو اس کا ہم نشین (جلیس) ہے\nاور تیرا مونس (انس دینے والا) تعطف (مہربانی) اور حنان (رحمت) ہے۔\n\nاور اس میں خلد (ہمیشگی) اور خوبصورت حوریں ہیں\nاسی لیے کہا جاتا ہے کہ ہمارا ٹھکانہ جنت (الجنان) ہے۔\n\nجان لو، اللہ ہمیں اور تمہیں قوت دے، کہ مقام الٰہی الربانی وہی ہے جس کے ساتھ اس نے اپنی ذات کو موصوف کیا۔ اور جب نبی اکرم (صَلَّى اللهُ عَليهِ وسَلَّم) نے اسے جانا، جب اللہ نے آپ کو اس کی خبر دی، تو آپ نے اس سے اس کی پناہ مانگی اور فرمایا: \"اور میں تیری پناہ چاہتا ہوں تجھ سے۔\"\n\n### [کہ اللہ کے لیے اعتقادات (عقائد) کی صورتوں میں التجلی (ظہور الٰہی) ہے]\n\nجان لو کہ ہر صاحبِ اعتقاد بندے کے نزدیک ہر سید (بزرگ) مقام درحقیقت اسی کے مطابق ہوتا ہے جو وہ اپنے اعتقاد میں قائم کرتا ہے۔ اور اسی لیے اللہ تعالیٰ نے فرمایا: \"اپنے رب کا مقام\" (مَقامَ رَبِّهِ)، پس اس نے اسے اس کی طرف مضاف کیا اور اسے مطلق نہیں چھوڑا۔ اور تم یہ اسم \"الرب\" (رب) کبھی بھی مضاف اور مقید کے بغیر نہیں پاؤ گے، سوائے اس کے کہ وہ کتاب اللہ میں مطلق ہو۔ کیونکہ وہ وضع (تسمیہ) کے اعتبار سے رب ہے، اور رب، اپنی دلالت کے لحاظ سے—میرا مطلب ہے یہ اسم—وہ ہے جو اپنی اصل وضع میں یہ عطا کرتا ہے کہ وہ ہر اس اعتقاد کو سمو لے جو اس کے بارے میں رکھا جاتا ہے، اور وہ اپنے معتقد کے نفس میں اس کی صورت کے ساتھ ظاہر ہو جائے۔\n\nپس جب عارف (العارف) حقیقت میں عارف ہوتا ہے، تو وہ ایک اعتقاد کے مقابلے میں دوسرے اعتقاد سے مقید نہیں ہوتا، اور نہ ہی وہ کسی کے رب کے بارے میں کسی دوسرے کے اعتقاد پر تنقید کرتا ہے، کیونکہ وہ اعتقادات کی جامع عین (العین الجامعہ للاعتقادات) کے ساتھ قائم ہوتا ہے۔ پھر جب وہ اس میں تمام اعتقادات کی جامع عین کے ساتھ کھڑا ہوتا ہے، تو وہ خوف کھاتا ہے کہ کہیں یہ مقدار جس کا اس نے اعتقاد کیا ہے، رب کے بارے میں ہر صاحبِ اعتقاد کی طرح نہ ہو، تو وہ یہ خیال کرتا ہے کہ وہ \"الرب\" (ذات حق) کے ساتھ ہے، حالانکہ وہ اپنے رب (ربہ) کے ساتھ ہے، نہ کہ \"الرب\" کے ساتھ، باوجود اس کے کہ وہ اس مقام پر ہے کہ وہ مطلق ہے، مقید نہیں ہے، اور ہر اعتقاد کی صورت میں اس کا قائل ہے اور اس پر ایمان رکھتا ہے۔ پس وہ مسلسل خوف زدہ رہتا ہے یہاں تک کہ اسے دنیاوی زندگی (الْحَياةِ الدُّنْيا) میں یہ بشارت (الْبُشْرى) مل جائے کہ معاملہ ویسا ہی ہے جیسا اس نے کہا۔ پس یہ اعتقاد میں بندے کے اطلاق کی حد ہے۔\n\nاور اگر الحق (ذات حق) کے لیے اعتقادات میں یہ سرایت (سریان) نہ ہوتی، تو وہ الگ تھلگ ہوتا، اور کثرتِ ارباب (ربوں کی کثرت) کے قائل سچے ہوتے۔ حالانکہ آپ کے رب نے فیصلہ کر دیا ہے کہ تم اس کے سوا کسی کی عبادت نہ کرو (وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ) ہر معتقد (جس کا اعتقاد کیا گیا) میں، کیونکہ وہ ہر معتقد کی عین (جوہر) ہے۔\n\nپھر اللہ نے اس عارف کے لیے اس کی اپنی ذات سے ایک دلیل قائم کی، جو اس کے ہر صورت میں اپنی ذات میں بدلنے اور اس کی ذات میں قبول کرنے سے ظاہر ہوتی ہے جب یہ معتقد کوئی صورت قائم کرتا ہے، جیسا کہ اللہ تعالیٰ کے اس قول میں ہے: \"جس صورت میں چاہا تجھے جوڑ دیا\" (فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ) – یہ اشارہ کے طور پر ہے، نہ کہ تفسیر کے طور پر۔ اگر ہر صورت کو برابر کرنے اور معتدل کرنے کے وقت تیرا قبول کرنا نہ ہوتا، تو اس کا قول \"جس صورت میں چاہا تجھے جوڑ دیا\" (فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ) ثابت نہ ہوتا۔ اور یہ قول صحیح اور ثابت ہے، لہٰذا ہم نے جان لیا کہ اس کے لیے اعتقادات (الاعتقادات) کی صورتوں میں التجلی (ظہور الٰہی) ہے، پس اس کا انکار نہیں کیا جا سکتا۔\n\nپس جس نے بھی اللہ کو اس معرفت (المعرفۃ) کے ساتھ نہیں پہچانا، وہ ایک مقید رب کی عبادت کرتا ہے جو بہت سے ربوں سے الگ تھلگ ہے، اگر وہ اپنی ذات کو موصوف کرے تو وہ نہیں جانتا کہ ان ربوں میں سے کون سا رب حقیقی رب ہے جو ہر معتقد کے نفس میں ہے۔ اور اس ذکر میں نفس کو خواہش (الْهَوَىٰ) سے روکنا (وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ) دراصل اسے ایک خاص اعتقاد کے ساتھ دوسرے اعتقاد سے مقید کرنے سے روکنا ہے، کیونکہ تب وہ خواہش (ہویٰ) کا پجاری ہے۔\n\nپھر اس عارف کے حق میں ذکر مکمل کیا گیا جس نے اپنے رب کے مقام سے خوف کھایا (خافَ مَقامَ رَبِّهِ) جیسا کہ ہم نے کہا، اور نفس کو خواہش سے روکا (وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ) جیسا کہ ہم نے شرح کی، تو بے شک جنت ہی ٹھکانہ ہے (فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ)۔ وہ کہتا ہے: اس کا مقام اللہ کے اس علم کو چھپانا ہے جو اسے حاصل ہوا ہے۔ کیونکہ جب بھی وہ اس علم کو ظاہر کرتا ہے، تو ہر مقید اعتقاد کا حامل اس کا انکار کرتا ہے اور اسے جاہل سمجھتا ہے اگر وہ صاحبِ نظر ہو، اور بسا اوقات اسے کافر قرار دیتا ہے اگر وہ صاحبِ ایمان ہو۔ پس جس نے اپنے رب کے مقام سے خوف کھایا (خافَ مَقامَ رَبِّهِ) اسے کوئی نہیں پہچانتا سوائے اس کے جس نے اپنے رب کے مقام سے خوف کھایا؛ دوسرا اسے نہیں پہچانتا۔\n\nپس اس بات سے امان میں رہو کہ تمہارے قول کو کوئی ایسا شخص کہے\nجس کے لیے اس کے رب میں حصر (محدودیت) اور قید (پابندی) ہو۔\n\nپس جو اللہ کے بارے میں وہ اعتقاد رکھے جو میں نے بیان کیا ہے\nتو یہی مکر الٰہی (الہی مکر) اور کید (چال) ہے۔\n\nاور وہ کیسے تقیید (پابندی) دیکھ سکتا ہے جو مطلق ہے\nجس کے لیے الحق (ذات حق) کی مشیت میں ابتدا اور عود (واپسی) ہے۔\n\nپس بندے کا اطلاق (مطلق ہونا) ہر اس صورت کو قبول کرنا ہے جس میں الحق (ذات حق) اسے ظاہر کرنا چاہتا ہے۔ تو تم اس کے خالق کے بارے میں کیا گمان کرتے ہو جس کے لیے اس میں مشیت (المشیئۃ) ہے، حالانکہ وہ سبحانہ و تعالیٰ اپنی ذات کے لیے صورتوں میں بدلنے میں اس کا مشیئہ (مشاء) نہیں ہے۔ کیونکہ مشیت (المشیئۃ) کا تعلق عدم سے ہے، اور وہ الوجود (ہستی) ہے، لہٰذا وہ اپنی مشیت کے لیے مشاء (جس کا ارادہ کیا گیا) نہیں ہو سکتا، بلکہ وہ ہمیشہ سے اپنی ذات میں ویسا ہی ہے جیسا کہ اس نے اپنے بندے پر تجلی (التجلی) کی۔ پس اس کی مشیت (المشیئۃ) کا تعلق صرف اس کے بندے سے تھا کہ وہ اسے اس صورت میں دیکھے جس میں الحق (ذات حق) نے اسے دیکھنا چاہا۔ پس جب بندہ اسے دیکھتا ہے تو وہ اس سے ملتبس ہو جاتا ہے، اور الحق (ذات حق) اسے اس میں جوڑ دیتا ہے، اور یہ اس کا قول ہے بابِ اشارہ سے: \"تجلی (التجلی) کی صورتوں میں سے جس صورت میں چاہا تجھے جوڑ دیا\" (فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ)۔ یہ معارف (المعارف) اور اعتقادات (الاعتقادات) کے باب میں ہے، اور خلق کے باب میں: \"اکوان (کائناتوں) کی صورتوں میں سے جس صورت میں چاہا تجھے جوڑ دیا\" (فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ)۔\n\nپس رب کے مقام سے خوف کھا اگر تو اسے مضاف کرے\nاور اس سے خوف نہ کھا اگر تو نے اسے پہچان لیا۔\n\nرب سے صرف وہی خوف نہیں کھاتا جو مقید نہ ہو\nتو اسے مطلق کر دے اگر تو چاہے یا اسے مضاف کر دے۔\n\nکیونکہ وہ اس کی عین (جوہر) ہے جس کا تو شہود (الشہود) کرتا ہے\nپس تو اس کے ساتھ موصوف ہو جا اگر تو اس کی صفت بیان کرے۔\n\nاس پر اکتفا نہ کر جس کا تو نے شہود کرایا\nاور کشف (الکشف) میں اضافہ نہ کر اگر تو نے اس کا کشف کیا۔\n\nپس تو اس کے ساتھ ہو، اور اس کے ساتھ نہ بھی ہو\nتو یہی انصاف (الإنصاف) ہے اگر تو نے اس کے ساتھ انصاف کیا۔\n\nاور اللہ حق کہتا ہے اور وہی راہ دکھاتا ہے۔ (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)",
    "fa": "باب پانصد و بیست و سوم در معرفت حال قطبی که منزل او «و اما کسی که از مقام پروردگارش ترسید» بود.\n\nمقام رب را امانی نیست\nآنچه شهود (العیان) می‌دهد، بر آن دلالت می‌کند.\n\nپس از آن بترس، زیرا خطر است و در آن\nاگر از آن بترسی، فوراً امان است.\n\nو نفس خود را از هر امری بازدار\nکه به خاطر آن، بهشت‌ها (الجنان) بر تو تنگ شود.\n\nپس زمانی را که در آن هستی سرزنش مکن\nزیرا تو خود سرزنش‌شونده و زمان هستی.\n\nو مکانی را که در آن نیستی آباد مکن\nزیرا پروردگار خانه را مکانی نیست.\n\nپس تو مانند اویی، و تو همنشین اویی\nو مونس تو مهربانی و عطوفت است.\n\nو در آن (مقام) جاودانگی و حوریان زیباست\nاز این رو گفته می‌شود منزل ما بهشت‌ها (الجنان) است.\n\nبدان، خداوند ما و تو را تأیید کند، که مقام الهی ربانی همان است که حق (الحق) خود را بدان وصف کرده است. و چون پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) آن را دانست، هنگامی که حق او را آگاه ساخت، از آن به حق پناه برد و فرمود: «و أعوذ بک منک» (و از تو به خودت پناه می‌برم).\n\n### [در اینکه حق (الحق) در صورت‌های اعتقادات تجلی (التجلی) می‌کند]\n\nبدان که هر مقام سروری نزد هر بنده‌ای که صاحب اعتقادی است، تنها بر اساس چیزی است که در اعتقاد خود در نفس خویش ایجاد می‌کند. به همین دلیل خداوند فرمود: «مَقامَ رَبِّهِ» (مقام پروردگارش)، پس آن را به او اضافه کرد و مطلق نگذاشت. و هرگز این اسم «رب» را در کتاب خدا مطلق نمی‌یابی، مگر اینکه مضاف و مقید باشد. زیرا «رب» به لحاظ وضع (لغوی) و از حیث دلالت، یعنی این اسم، در اصل وضع خود این معنا را می‌دهد که هر اعتقادی را که در آن باور شود، در بر می‌گیرد و به صورت آن اعتقاد در نفس معتقدش ظاهر می‌شود.\n\nپس اگر عارف، حقیقتاً عارف باشد، به اعتقادی خاص مقید نمی‌شود و اعتقاد هیچ کس را در مورد پروردگارش نقد نمی‌کند، زیرا او با عین جامع اعتقادات وقوف یافته است. سپس، هنگامی که با عین جامع همه اعتقادات در خود وقوف می‌یابد، می‌ترسد که مبادا این مقداری که او اعتقاد کرده است، مانند هر صاحب اعتقاد دیگری در مورد رب باشد. پس خیال می‌کند که با «الرب» (رب مطلق) است، در حالی که با «ربه» (رب مقید به اعتقاد خودش) است، نه با «الرب» (رب مطلق). با وجود اینکه او در این مقام، در رهاسازی و عدم تقیید و پذیرش حق (الحق) در هر صورت اعتقادی و ایمان به آن است، پیوسته ترسان می‌ماند تا اینکه «الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا» (بشارت در زندگی دنیا) به او برسد که امر همان‌گونه است که او گفته است. این حد اطلاق بنده در اعتقاد است. و اگر حق (الحق) این سریان (جریان) را در اعتقادات نداشت، در انزوا می‌ماند و کسانی که به کثرت ارباب قائل بودند، راست می‌گفتند. در حالی که «وَقَضَى رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ» (و پروردگارت حکم کرده است که جز او را نپرستید) در هر معتقدی صادق است، زیرا او عین هر معتقدی است.\n\nسپس خداوند برای این عارف، دلیلی از نفس خودش قرار داد، به واسطه تحول حق (الحق) در نفس او در هر صورت، و پذیرش حق در ذات خود هنگام ایجاد هر صورتی که این معتقد ایجاد می‌کند، در این سخن تعالی: «فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ» (در هر صورتی که خواست تو را ترکیب کرد) – این نگاه، نگاه اشاره است نه تفسیر. اگر پذیرش تو هنگام تسویه و تعدیل هر صورت نبود، سخن او «فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ» ثابت نمی‌شد. و این سخن صحیح و ثابت شده است، پس دانستیم که حق (الحق) در صورت‌های اعتقادات تجلی (التجلی) دارد و نباید انکار شود. پس هر کس که خدا را با این معرفت (المعرفة) نشناسد، ربی مقید را می‌پرستد که از ارباب کثیر دیگر منزوی است. اگر او نفس خود را وصف کند، نمی‌داند کدام رب، رب حقیقی در واقع امر است از میان این اربابی که در نفس هر معتقدی وجود دارد.\n\nو «وَنَهَى النَّفْسَ عَنِ الْهَوَى» (و نفس را از هوی بازداشت) در این ذکر، نهی از مقید کردن حق (الحق) به اعتقادی خاص به جای اعتقادی دیگر است، زیرا در این صورت او پرستنده هوی است. سپس ذکر را در حق عارفی که «خَافَ مَقامَ رَبِّهِ» (از مقام پروردگارش ترسید) – همان‌طور که گفتیم – و «وَنَهَى النَّفْسَ عَنِ الْهَوَى» (و نفس را از هوی بازداشت) – همان‌طور که شرح دادیم – با این سخن کامل کرد: «فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَى» (پس بهشت جایگاه اوست). می‌گوید: مقام او پوشاندن این علم به خداست که برایش حاصل شده است. زیرا هرگاه این علم بر هر صاحب اعتقاد مقیدی آشکار شود، اگر اهل نظر باشد آن را انکار می‌کند و جاهل می‌شمارد، و اگر اهل ایمان باشد، چه بسا او را تکفیر کند. پس کسی که «خَافَ مَقامَ رَبِّهِ» را نشناخته است، جز کسی که «خَافَ مَقامَ رَبِّهِ» باشد، او را نمی‌شناسد.\n\nپس در امان باش از اینکه کسی که در ربش حصر و قید دارد\nسخن تو را بگوید.\n\nپس هر کس در مورد خدا آنچه را شرح دادم اعتقاد کند\nاین همان مکر و کید الهی است.\n\nو چگونه کسی که مطلق است، تقیید را می‌بیند؟\nبرای اوست آغاز و بازگشت در آنچه حق (الحق) خواسته است.\n\nپس اطلاق بنده، پذیرش او برای هر صورتی است که حق (الحق) بخواهد او را در آن ظاهر سازد. حال گمانت نسبت به خالقش چیست که مشیئت در اوست؟ و او سبحانه در تحولش در صور، برای ذات خود مشیئت ندارد؛ زیرا متعلق مشیئت، عدم است و او وجود است. پس او مشاء مشیئت خود نیست، بلکه پیوسته در نفس خود همان‌گونه است که بر بنده‌اش تجلی (التجلی) کرده است. مشیئت او تنها به بنده‌اش تعلق گرفته است که او را در آن صورتی ببیند که حق (الحق) خواسته است او را در آن ببیند. پس هنگامی که بنده آن را می‌بیند، حق (الحق) به او ملتبس می‌شود و او را در آن ترکیب می‌کند. و این همان سخن اوست از باب اشاره: «فِي أَيِّ صُورَةٍ» (در هر صورتی) از صور تجلی (التجلی) «مَّا شَاءَ رَكَّبَكَ» (که خواست تو را ترکیب کرد). این در باب معارف (المعرفة) و اعتقادات است، و در باب خلق: «فِي أَيِّ صُورَةٍ» (در هر صورتی) از صور اکوان (هستی‌ها) «مَّا شَاءَ رَكَّبَكَ» (که خواست تو را ترکیب کرد).\n\nپس از مقام رب بترس اگر آن را اضافه (مقید) کردی\nو از آن مترس اگر آن را شناختی (معرفت یافتی).\n\nرب را جز مقید نمی‌ترسد\nچه آن را مطلق کنی و چه آن را اضافه (مقید) سازی.\n\nزیرا او عین چیزی است که شهود (الشهود) می‌کنی\nپس اگر او را وصف کردی، تو خود موصوف به او باش.\n\nبر آنچه او به شهودت (الشهود) رسانده اکتفا مکن\nو در کشف (الکشف) زیاده‌روی مکن اگر آن را کشف کردی.\n\nپس به او باش و همچنین به او مباش\nاین همان انصاف است اگر انصاف ورزیدی.\n\nو خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}