{
  "id": 505,
  "title": {
    "ar": "الباب الخامس وخمسمائة في معرفة حال قطب كان منزله واصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنا كان عليه من أصحابنا محمد المراكشي بمراكش",
    "en": "Chapter Five Hundred and Five: Concerning the Knowledge of the State of a Pole (قطب) Whose Spiritual Station (منزل) Was [the verse]: <<And be patient for the decision of your Lord, for indeed you are in Our eyes>> (واصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنا), who was among our companions, Muhammad al-Marrakushi in Marrakesh.",
    "ur": "باب پانچ سو پانچ: قطب (قطب) کے حال کی معرفت (المعرفۃ) کے بیان میں، جس کا روحانی مقام (منزل) یہ تھا: \"اور اپنے رب کے حکم پر صبر کرو، کیونکہ تم ہماری آنکھوں کے سامنے ہو\" (سورۃ الطور ۵۲:۴۸)، اور جو ہمارے اصحاب میں سے محمد المراکشی مراکش میں اس مقام پر فائز تھے۔",
    "fa": "باب پانصد و پنجم: در شناخت حال قطبی که منزل او «وَاصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنا» (و برای حکم پروردگارت صبر کن، زیرا تو در دیدگان ما هستی) بود، و او از اصحاب ما، محمد المراكشي در مراكش بود."
  },
  "content": {
    "ar": "## (الباب الخامس وخمسمائة في معرفة حال قطب كان منزله واصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنا كان عليه من أصحابنا محمد المراكشي بمراكش)\n\n\n> ليس قلب الوجود غير وجودي *** وكذا في الشهود عين شهودي‏\n\n\n> فأنا القلب والمهيمن قلبي *** وهو مني مكان حبل الوريد\n\n\n> لا تحدوه للذي قد سمعتم *** إنه جل عن قيود الحدود\n\n\n> من رآني فقد رآه ومن لم *** يرني لم يقل بفرض السجود\n\n\n> إنما يفرض السجود على من *** قال في الحق إنه من وجودي‏\n\n\n### [لقاء ابن العربي مع محمد المراكشي‏]\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم من عرف نفسه عرف ربه‏\n\n\nرأيت محمد المراكشي بمراكش وكان يكاثرني ليلا ونهارا وكان هذا هجيره دائما فما رأيته ضاق صدره من شي‏ء قط وكانت الشدائد تمر عليه فلا يتلقاها إلا بالفرح والضحك فتفرج عنه في نظرنا وهو ينتقل من فرح إلى فرح ومن سرور إلى سرور فكنت أقول له هل تصبر على حلول هذه النوازل المكروهة طبعا فيقول لما صبرت أو لا فانتج لي ذلك الصبر على الحكم الإلهي مشاهدة العين فشغلتني عن كل حكم فما أتلقاه إلا به فهو مجني فإياه أسأل فإن النوازل به تنزل في رؤيتى وأنتم ترون حكم النازلة في صورتي وكل عند نظره ثم كان هذا الشخص من أحفظ الناس على أوقات عباداته والله ما رأيت مثله بعده في هذا المقام وما تحسر أحد من إخواني على فراقي حين فارقته إلى هذه البلاد مثل تحسره على فراقي وكان يقول لي والله لو لا مشاهدة العين التي حجبتني عن نفوذ الحكم الرباني في لسافرت معك فو الله ما يغيب عني منك إلا تحول صورة الحق إلى صورة أخرى فأشهده غيبا ومحضرا وهذا ذوق عجيب كان كثير الأدب كثير الكلام يكاد لا يصمت أبدا عن دلالة الناس على الله عز وجل فإذا قيل له في ذلك يقول أنا أؤدي فريضتي في كلامي وأنت بالخيار في مجالستي والإصغاء إلى ما نورده أنا أتكلم مع من يسمع ما أتكلم مع من لا يسمع‏\n\n\n### [حبس النفس عن الشكوى‏]\n\n\nاعلم أن هذا الذكر يعطي الثبوت مع الحكم الرباني لما فيه من المصلحة وإن لم يشعر به العبد وجهله فهو في نفس الأمر مصلحة كان الحكم ما كان وهذا هو مقام الإحسان الأول الذي هو فوق الايمان فله الشهود الدائم في اختلاف الأحكام ولا بد من اختلافها لأنه تعالى كل يوم في شأن فإن كنت صاحب غرض وتحس بمرض وألم فاحبس نفسك عن الشكوى لغير من آلمك بحكمه عليك كما فعل أيوب عليه السلام وهو الأدب الإلهي الذي علمه أنبياءه ورسله فإنه ما آلمك وحكم عليك بخلاف غرضك وغرضك من جعل حكمه فيك إلا لتسأله في رفع ذلك عنك بما جعل فيك من العرض الذي بسببه تألمت فمن لم يشك إلى الله مع الإحساس بالبلاء وعدم موافقة الغرض فقد قاوم القهر الإلهي جاع أبو يزيد البسطامي فبكى فقيل له في ذلك فقال إنما جوعني لأبكي فالأدب كل الأدب في الشكوى إلى الله في رفعه لا إلى غيره ويبقى عليه اسم الصبر كما قال تعالى في رسوله أيوب عليه السلام إِنَّا وَجَدْناهُ صابِراً في وقت الاضطراب والركون إلى الأسباب فلم يضطرب ولا ركن إلى شي‏ء غير الله إلا إلينا لا إلى سبب من الأسباب فإنه لا بد طبعا عند الإحساس من الاضطراب وتغير المزاج ولذلك لطخ الحلاج وجهه بالدم حين قطعت أطرافه لئلا يظهر إلى عين العامة تغير مزاجه غيرة منه على المقام لمعرفته بهذا كله وهو القائل في وقت هذه الحال‏\n> ما قد لي عضو ولا مفصل *** إلا وفيه لكم ذكر\n\n\nبخلاف الآلام النفسية إذا وردت الأمور التي من شأنها أن تتألم النفوس عند ورودها فقد يتلقاها بعض عباد الله ولا أثر لها فيه على ظاهره والأمور المؤلمة حسا إذا أحس بها نحرك لها طبعا إلا أن شغله عنها أمر يزيل إحساسه بها وإنما كلامنا في ذلك مع الإحساس كأيوب وذي النون سلام الله عليهما وأما إلى من ليس بيده من الأمر شي‏ء كالمعتاد في العموم وتلك حالة أكثر العالم عباد الأسباب وبها يتستر الأكابر من عباد الله عن أن يشار إليهم واصْبِرْ لِحُكْمِ رَبِّكَ المأمور به فذلك هو الثبوت مع الله عند نفوذ الحكم الإلهي فيه أي حكم كان من بلاء أو عافية فإن الفرح بنيل الغرض يزيل صاحبه عن الثبوت أكثر من زوال صاحب البلاء فإن حركة الفرح تدهش وتكثر اضطراب صاحبه إلا أن يكون له قوة حال أكثر من وارد الفرح وأما الهم والغم فإنه أقرب إلى الثبوت والسكون لمن حكم عليه به من فرح الواصل إلى غرضه فهو ذكر يعم الخير والشر معا وهما حالان والأحوال هي الحاكمة أبدا والمحكوم عليه لا بد أن يكون تحت قهر الحاكم لنفوذ حكمه فيه وهو الذي جعله يضطرب لأن مطلوب الإنسان بالطبع الخروج من الضيق إلى الانفساح والسعة والضياء المشرق لما يراه من ظلمة الطبع وضيقه فلا يصبر فقيل له اثبت للحكم فإنك لا تخلو عن نفوذ حكم فيك إما بما يسوءك أو بما يسرك فإن ساءك فتحرك إلينا في رفعه عنك وإن سرك فتحرك إلينا في إبقائه عليك والشكر على ذلك فنزيدك ما يتضاعف به سرورك ولا يضعف فأنت رابح على كل حال وما أمرناك بالصبر إلا ليكون الصبر عبادة واجبة فتجازي جزاء من أدى الواجب فتكون عبدا مضطرا مثنيا عليك بالصبر والرضاء ولو تركناك على التخيير وصبرت لكنت عبدا مختارا أي ذا اختيار ولم تذق طعما لسيادتنا عليك فإن المختار يولينا على نفسه إذا شاء ويعزلنا إذا شاء ويخجلنا إذا شاء ولا يخجلنا إذا شاء فنحن في الاختيار بحكمه وفي الاضطرار حاكمون عليه فانظر إلى رحمة الله بك حيث أمرك بالصبر لحكم ربك ثم زاد فَإِنَّكَ بِأَعْيُنِنا أحق ما حكمنا عليك إلا بما هو الأصلح لك عندنا سواء سرك أم ساءك هذا قصده بقوله فَإِنَّكَ بِأَعْيُنِنا أي ما أنت بحيث تجهله أو ننساه فكن أي عبد شئت بعد هذا فأنت لما قصدت والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 505: Concerning the Knowledge of the State of a Pole (قطب) Whose Station Was <<And be patient for the judgment of your Lord, for indeed, you are in Our eyes>> (Quran 52:48), Held by Our Companion Muhammad al-Marrakushi in Marrakesh\n\nThe heart of Being (الوجود) is none other than my own existence,\nAnd likewise, in the Witnessing (الشهود), it is the very essence of my witnessing.\n\nSo I am the heart, and the Sovereign (المهيمن) is my heart,\nAnd He is closer to me than the jugular vein (حبل الوريد).\n\nDo not confine Him based on what you have heard,\nFor indeed, He is exalted above the restraints of limits (الحدود).\n\nWhoever sees me has surely seen Him, and whoever does not\nsee me will not affirm the obligation of prostration (السجود).\n\nProstration is only made obligatory upon him\nwho affirms concerning the Real (الحق) that He is from my existence.\n\n### [Ibn Arabi's Meeting with Muhammad al-Marrakushi]\n\nThe saying of the Prophet, peace and blessings be upon him: \"Whoever knows his self knows his Lord.\"\n\nI met Muhammad al-Marrakushi in Marrakesh. He used to engage me in conversation day and night, and this was his constant habit. I never saw him distressed by anything whatsoever. Hardships would pass over him, and he would receive them only with joy and laughter, so they would dissipate in our sight, and he would move from one joy to another, and from one delight to another.\n\nI used to ask him, \"Do you endure the descent of these calamities, which are naturally disliked?\"\n\nHe would reply, \"When I first practiced patience (الصبر), that patience regarding the Divine Decree (الحكم الإلهي) produced for me the witnessing of the Eye (مشاهدة العين). This witnessing distracted me from every decree, so I receive nothing except through Him. He is my refuge, and Him alone I ask, for in my vision, the calamities descend through Him. You, however, see the effect of the calamity upon my outward form, and everyone judges according to his own perspective.\"\n\nFurthermore, this person was among the most meticulous people in preserving the times of his acts of worship (عباداته). By God, I have not seen anyone like him in this station (المقام) since. None of my brethren grieved over my departure when I left him for these lands as much as he grieved over my separation from him.\n\nHe used to say to me, \"By God, were it not for the witnessing of the Eye (مشاهدة العين) which veiled me from the execution of the Lordly Decree (الحكم الرباني) concerning me, I would have traveled with you. For by God, nothing of you is absent from me except the transformation of the form of the Real (الحق) into another form, so I witness Him both in absence (غيبا) and in presence (محضرا).\"\n\nThis was an astonishing spiritual taste (ذوق). He possessed great courtesy (الأدب) and spoke much, almost never remaining silent concerning guiding people to Allah, the Mighty and Majestic. When he was questioned about this, he would say, \"I am fulfilling my obligation (فريضة) through my speech, and you have the choice regarding sitting with me and listening to what I convey. I speak with those who hear; I do not speak with those who do not hear.\"\n\n### [Restraining the Self from Complaint]\n\nKnow that this remembrance (الذكر) grants steadfastness (الثبوت) alongside the Lordly Decree (الحكم الرباني), due to the benefit (المصلحة) contained within it. Even if the servant is unaware of it and ignorant of it, it is, in reality (في نفس الأمر), a benefit, whatever the decree may be.\n\nThis is the first station of Spiritual Excellence (مقام الإحسان), which is above Faith (الإيمان). The possessor of this station has perpetual witnessing (الشهود الدائم) amidst the variation of decrees, and their variation is necessary, for He, the Exalted, is \"every day in [some] affair.\"\n\nIf you have a desire (غرض) and feel sickness and pain, restrain your self (النفس) from complaining to anyone other than the One who afflicted you by His decree upon you, just as Job (Ayyub), peace be upon him, did. This is the Divine Courtesy (الأدب الإلهي) that He taught His prophets and messengers. He only afflicted you and decreed against your desire—and your desire is part of what made His decree effective in you—so that you might ask Him to remove that affliction from you, using the very desire He placed in you, which is the cause of your pain.\n\nThus, whoever does not complain to Allah, despite feeling the tribulation (البلاء) and the lack of fulfillment of his desire, has resisted the Divine Compulsion (القهر الإلهي).\n\nAbu Yazid al-Bistami became hungry and wept. When asked about this, he said, \"He only made me hungry so that I would weep.\" Therefore, the highest courtesy lies in complaining to Allah for its removal, not to anyone else. And the name of patience (الصبر) remains upon him, as the Exalted said concerning His Messenger Job, peace be upon him: <<Indeed, We found him patient>> (Quran 38:44), even during the time of agitation (الاضطراب) and reliance upon means (الأسباب).\n\nHe did not become agitated, nor did he rely upon anything other than Allah—except upon Us—not upon any means whatsoever. For naturally, upon feeling pain, agitation and a change in temperament (تغير المزاج) are inevitable. That is why al-Hallaj smeared his face with blood when his limbs were cut off, so that the change in his temperament would not be apparent to the eyes of the common people, out of zeal (غيرة) for the station (المقام), due to his knowledge of all this. He is the one who said at that time:\n\nNo limb or joint of mine has been severed\nExcept that in it there is remembrance (ذكر) of You.\n\nThis is in contrast to psychological pains (الآلام النفسية): when matters occur that naturally cause souls (النفوس) to suffer upon their occurrence, some servants of Allah may receive them without any apparent effect upon their exterior. As for matters that are physically painful (المؤلمة حسا), when they are felt, we are naturally moved by them, unless something distracts the person from them, removing his sensation of them. Our discussion here concerns the sensation of pain, like that experienced by Job and Dhul-Nun, peace of Allah be upon them both.\n\nAs for complaining to one who holds no power over the matter, as is common among the general populace—that is the state of most of the world, who are servants of means (عباد الأسباب). Through this, the great ones (الأكابر) among Allah’s servants conceal themselves from being pointed out.\n\nThe command <<And be patient for the judgment of your Lord>> (Quran 52:48) refers to that steadfastness (الثبوت) with Allah when the Divine Decree (الحكم الإلهي) takes effect upon the servant, whatever that decree may be, whether tribulation (بلاء) or well-being (عافية). For the joy of attaining a desire removes its possessor from steadfastness more than the removal experienced by the one afflicted by tribulation. The movement of joy causes astonishment and increases the agitation of its possessor, unless he possesses a strength of spiritual state (قوة حال) greater than the incoming joy. As for worry (الهم) and grief (الغم), they are closer to steadfastness and stillness for the one upon whom they are decreed than the joy of the one who attains his desire.\n\nThus, it is a remembrance (ذكر) that encompasses both good and evil, and both are spiritual states (حالان). The states are always the rulers, and the one ruled must necessarily be under the compulsion (قهر) of the ruler for the decree to take effect upon him. It is this compulsion that causes him to become agitated, because man naturally seeks to move from constraint (الضيق) to expansion (الانفساح), spaciousness, and radiant light, due to the darkness and narrowness he perceives in his nature (الطبع). Thus, he does not endure.\n\nSo it was said to him: \"Be steadfast (اثبت) before the decree, for you are never free from a decree taking effect upon you, whether it displeases you or pleases you. If it displeases you, then turn to Us for its removal from you. And if it pleases you, then turn to Us for the preservation of it upon you, and give thanks for that, so We may increase you with that by which your joy is multiplied and not diminished. Thus, you are profitable in every state. We only commanded you to patience (الصبر) so that patience might be an obligatory act of worship (عبادة واجبة), and you would be rewarded with the recompense of one who fulfilled an obligation, thereby becoming a compelled servant (عبدا مضطرا) praised for patience and contentment (الرضاء).\"\n\n\"Had We left you to choice (التخيير) and you had been patient, you would have been a servant of choice (عبدا مختارا)—meaning, possessing choice—and you would not have tasted the flavor of Our Lordship (سيادتنا) over you. For the one who chooses appoints Us over himself when he wills, and dismisses Us when he wills, and shames Us when he wills, and does not shame Us when he wills. Thus, in the state of choice (الاختيار), We are subject to his decree, but in the state of compulsion (الاضطرار), We are the Rulers over him.\"\n\nLook, then, at the Mercy of Allah upon you, where He commanded you to patience for the judgment of your Lord, and then added: <<for indeed, you are in Our eyes>> (Quran 52:48). We only decreed upon you that which is most beneficial for you in Our sight, whether it pleased you or displeased you. This is the intent of His saying <<for indeed, you are in Our eyes>>: meaning, you are not in a state where We are ignorant of you or forget you. Be whatever servant you wish after this, for you are what you intended. And Allah <<says the Truth, and He guides to the way>> (Quran 33:4).",
    "ur": "## (باب نمبر ۵۰۵: ایک قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور اپنے رب کے حکم پر صبر کرو، کیونکہ تم ہماری آنکھوں کے سامنے ہو\"۔ یہ ہمارے اصحاب میں سے محمد مراکشی مراکش میں تھے)\n\nمیرا وجود ہی وجودِ الوجود (الوجود) ہے\nاور اسی طرح شہود (الشہود) میں میری آنکھ ہی عینِ شہود ہے۔\n\nپس میں ہی قلب ہوں اور مہیمن میرا قلب ہے\nاور وہ مجھ سے شہ رگ (حبل الورید) کی جگہ ہے۔\n\nاسے اس چیز سے محدود نہ کرو جو تم نے سنی ہے\nبے شک وہ حدود کی قیدوں سے بلند ہے۔\n\nجس نے مجھے دیکھا اس نے اسے دیکھا، اور جس نے\nمجھے نہیں دیکھا، وہ سجدے کی فرضیت کا قائل نہیں ہوا۔\n\nسجدہ تو صرف اس پر فرض ہوتا ہے\nجو حق (الحق) کے بارے میں کہے کہ وہ میرے وجود (الوجود) سے ہے۔\n\n### [ابن عربی کی محمد مراکشی سے ملاقات]\n\nنبی اکرم صلی اللہ علیہ وسلم کا فرمان ہے: \"جس نے اپنے نفس کو پہچانا اس نے اپنے رب کو پہچانا\"۔\n\nمیں محمد مراکشی سے مراکش میں ملا۔ وہ رات دن مجھ سے کثرت سے ملتے تھے۔ یہ ان کا ہمیشہ کا معمول تھا۔ میں نے انہیں کبھی کسی چیز سے دل تنگ ہوتے نہیں دیکھا۔ ان پر سختیاں گزرتی تھیں لیکن وہ انہیں خوشی اور ہنسی کے ساتھ ہی قبول کرتے تھے، چنانچہ ہماری نظروں میں وہ دور ہو جاتی تھیں۔ وہ ایک خوشی سے دوسری خوشی اور ایک سرور سے دوسرے سرور کی طرف منتقل ہوتے رہتے تھے۔ میں ان سے کہتا تھا: کیا آپ ان ناپسندیدہ (طبعی طور پر) مصیبتوں کے نازل ہونے پر صبر کرتے ہیں؟ تو وہ کہتے: میں نے پہلے کیوں صبر نہیں کیا؟ اس صبر نے میرے لیے حکمِ الٰہی پر عینِ مشاہدہ (الشہود) پیدا کر دیا، جس نے مجھے ہر حکم سے مشغول کر دیا۔ پس میں اسے صرف اسی (مشاہدے) کے ساتھ قبول کرتا ہوں، وہی میری پناہ گاہ ہے۔ میں اسی سے سوال کرتا ہوں، کیونکہ میری رؤیت میں مصیبتیں اسی کے ذریعے نازل ہوتی ہیں، اور تم لوگ نازل ہونے والی مصیبت کا حکم میری صورت میں دیکھتے ہو۔ اور ہر ایک اپنے نقطہ نظر کے مطابق دیکھتا ہے۔ پھر یہ شخص اپنی عبادات کے اوقات کا سب سے زیادہ خیال رکھنے والا تھا۔ خدا کی قسم! میں نے اس مقام پر ان کے بعد ان جیسا کوئی نہیں دیکھا۔ جب میں ان سے جدا ہو کر ان علاقوں کی طرف آیا تو میرے بھائیوں میں سے کسی کو بھی میری جدائی کا اتنا غم نہیں ہوا جتنا انہیں ہوا۔ وہ مجھ سے کہتے تھے: خدا کی قسم! اگر عینِ مشاہدہ (الشہود) نہ ہوتا جس نے مجھے ربانی حکم کے نفاذ سے حجاب میں رکھا ہوا ہے، تو میں آپ کے ساتھ سفر کرتا۔ خدا کی قسم! مجھ سے آپ کی کوئی چیز غائب نہیں ہوتی، سوائے اس کے کہ حق (الحق) کی صورت ایک دوسری صورت میں تبدیل ہو جاتی ہے، پس میں اس کا مشاہدہ غائب اور حاضر دونوں حالتوں میں کرتا ہوں۔ یہ ایک عجیب ذوق تھا۔ وہ بہت باادب، بہت زیادہ گفتگو کرنے والے تھے، تقریباً کبھی بھی اللہ عزوجل کی طرف لوگوں کی رہنمائی سے خاموش نہیں ہوتے تھے۔ جب ان سے اس بارے میں کہا جاتا تو وہ کہتے: میں اپنی گفتگو میں اپنی فرض ادا کر رہا ہوں، اور آپ کو میری مجلس میں بیٹھنے اور جو کچھ میں بیان کرتا ہوں اسے سننے کا اختیار ہے۔ میں اس سے بات کرتا ہوں جو سنتا ہے، میں اس سے بات نہیں کرتا جو نہیں سنتا۔\n\n### [نفس کو شکایت سے روکنا]\n\nجان لو کہ یہ ذکر حکمِ ربانی کے ساتھ ثبوت (استقامت) عطا کرتا ہے، کیونکہ اس میں مصلحت ہے، اگرچہ بندہ اسے محسوس نہ کرے اور اس سے ناواقف ہو۔ پس نفسِ امر میں وہ مصلحت ہی ہے، حکم جو بھی ہو۔ اور یہی پہلا مقامِ احسان ہے جو ایمان سے بالاتر ہے۔ پس اسے احکام کے اختلاف میں دائمی شہود (الشہود) حاصل ہوتا ہے، اور ان کا مختلف ہونا ضروری ہے کیونکہ اللہ تعالیٰ ہر دن ایک نئی شان میں ہے۔ اگر تم صاحبِ غرض ہو اور کسی بیماری یا درد کو محسوس کرتے ہو، تو اپنے نفس کو اس کے علاوہ کسی اور سے شکایت کرنے سے روکو جس نے اپنے حکم سے تمہیں تکلیف دی ہے، جیسا کہ ایوب علیہ السلام نے کیا۔ اور یہی وہ ادبِ الٰہی ہے جو اس نے اپنے انبیاء اور رسولوں کو سکھایا۔ کیونکہ اس نے تمہیں تکلیف نہیں دی اور تمہاری غرض کے خلاف تم پر حکم نہیں لگایا، اور تمہاری غرض یہ تھی کہ وہ تم میں اپنا حکم نافذ کرے، مگر اس لیے کہ تم اس سے اس تکلیف کو دور کرنے کا سوال کرو، اس غرض کے ذریعے جو اس نے تم میں رکھی ہے جس کی وجہ سے تم نے تکلیف محسوس کی۔ پس جو شخص بلاء کو محسوس کرنے اور غرض کے موافق نہ ہونے کے باوجود اللہ سے شکایت نہیں کرتا، تو اس نے قہرِ الٰہی کا مقابلہ کیا۔ ابو یزید بسطامی کو بھوک لگی تو وہ رو پڑے۔ ان سے اس بارے میں پوچھا گیا تو انہوں نے کہا: اس نے مجھے بھوکا ہی اس لیے کیا ہے کہ میں روؤں۔ پس سارا ادب یہ ہے کہ اسے دور کرنے کے لیے اللہ سے شکایت کی جائے نہ کہ کسی اور سے۔ اور اس پر صبر کا نام باقی رہتا ہے، جیسا کہ اللہ تعالیٰ نے اپنے رسول ایوب علیہ السلام کے بارے میں فرمایا: **إِنَّا وَجَدْناهُ صابِراً** (بے شک ہم نے اسے صابر پایا)۔ یہ اضطراب اور اسباب پر بھروسہ کرنے کے وقت کی بات ہے۔ پس نہ تو وہ مضطرب ہوئے اور نہ ہی اللہ کے علاوہ کسی چیز پر بھروسہ کیا، مگر ہم پر، نہ کہ کسی سبب پر۔ کیونکہ طبعی طور پر احساس ہونے پر اضطراب اور مزاج کا بدلنا ضروری ہے۔ اسی لیے حلاج نے جب ان کے اعضاء کاٹے گئے تو اپنے چہرے پر خون مل لیا تاکہ عام لوگوں کی نظروں میں ان کے مزاج کی تبدیلی ظاہر نہ ہو، یہ مقام پر غیرت کی وجہ سے تھا، کیونکہ وہ یہ سب جانتے تھے۔ اور وہ اس حال میں یہ کہنے والے تھے:\n\n> میرا کوئی عضو اور نہ کوئی جوڑ\n> ایسا ہے مگر اس میں تمہارے لیے ذکر ہے۔\n\nیہ نفسیاتی تکالیف کے برعکس ہے، جب ایسے امور پیش آتے ہیں جن کی وجہ سے نفوس کو تکلیف پہنچنا ان کا خاصہ ہے، تو اللہ کے بعض بندے انہیں قبول کرتے ہیں اور ان پر ظاہری طور پر کوئی اثر نہیں ہوتا۔ اور حسی طور پر تکلیف دہ امور جب محسوس ہوتے ہیں تو طبعی طور پر ہمیں ان کے لیے حرکت ہوتی ہے، مگر یہ کہ کوئی چیز انہیں اس سے مشغول کر دے جو ان کے احساس کو زائل کر دے۔ ہماری گفتگو اس بارے میں احساس کے ساتھ ہے، جیسے ایوب اور ذوالنون سلام اللہ علیہما۔ اور جہاں تک اس شخص کی بات ہے جس کے ہاتھ میں کوئی اختیار نہیں، جیسا کہ عام لوگوں میں رواج ہے، تو یہ اکثر دنیا والوں کا حال ہے جو اسباب کے بندے ہیں۔ اور اسی کے ذریعے اللہ کے بڑے بندے اس بات سے پردہ پوشی کرتے ہیں کہ ان کی طرف اشارہ کیا جائے۔ اور **وَاصْبِرْ لِحُكْمِ رَبِّكَ** (اور اپنے رب کے حکم پر صبر کرو) جس کا حکم دیا گیا ہے، یہی اللہ کے ساتھ ثبوت (استقامت) ہے جب اس میں حکمِ الٰہی نافذ ہو، خواہ وہ کوئی بھی حکم ہو، بلاء ہو یا عافیت۔ کیونکہ غرض کے حصول پر خوشی، بلاء والے کے زوال سے زیادہ اپنے صاحب کو ثبوت سے ہٹا دیتی ہے۔ کیونکہ خوشی کی حرکت حیران کر دیتی ہے اور اس کے صاحب کا اضطراب بڑھ جاتا ہے، مگر یہ کہ اس کے پاس خوشی کے وارد سے زیادہ قوی حال ہو۔ اور جہاں تک غم اور پریشانی کا تعلق ہے، تو وہ اس شخص کے لیے ثبوت اور سکون کے زیادہ قریب ہے جس پر اس کا حکم لگایا گیا ہے، بہ نسبت اس شخص کی خوشی کے جو اپنی غرض کو پا لیتا ہے۔ پس یہ ایک ذکر ہے جو خیر اور شر دونوں کو شامل ہے، اور یہ دونوں حال ہیں۔ اور احوال ہمیشہ حاکم ہوتے ہیں، اور جس پر حکم لگایا گیا ہے وہ حاکم کے قہر کے تحت ہونا ضروری ہے تاکہ اس میں اس کا حکم نافذ ہو۔ اور یہی وہ چیز ہے جس نے اسے مضطرب کیا، کیونکہ انسان کی طبعی خواہش تنگی سے نکل کر کشادگی، وسعت اور روشن روشنی کی طرف جانا ہے، کیونکہ وہ طبع کی تاریکی اور تنگی کو دیکھتا ہے، پس وہ صبر نہیں کرتا۔ اس لیے اسے کہا گیا: حکم پر ثابت قدم رہو، کیونکہ تم پر حکم کے نفاذ سے خالی نہیں ہو گے، خواہ وہ تمہیں برا لگے یا تمہیں خوش کرے۔ اگر تمہیں برا لگے تو اسے دور کرنے کے لیے ہماری طرف حرکت کرو، اور اگر تمہیں خوش کرے تو اسے باقی رکھنے کے لیے ہماری طرف حرکت کرو اور اس پر شکر ادا کرو، تاکہ ہم تمہاری خوشی کو بڑھا دیں اور وہ کم نہ ہو۔ پس تم ہر حال میں نفع میں ہو۔ اور ہم نے تمہیں صبر کا حکم صرف اس لیے دیا تاکہ صبر ایک واجب عبادت بن جائے، پس تمہیں واجب ادا کرنے والے کا بدلہ دیا جائے، اور تم ایک مضطر بندے بنو جس کی تعریف صبر اور رضا کے ساتھ کی جائے۔ اور اگر ہم تمہیں اختیار پر چھوڑ دیتے اور تم صبر کرتے، تو تم ایک مختار بندے ہوتے، یعنی اختیار والے، اور تم ہماری سیادت کا ذائقہ نہ چکھتے۔ کیونکہ مختار جب چاہے ہمیں اپنے اوپر والی بنا لیتا ہے اور جب چاہے معزول کر دیتا ہے، اور جب چاہے ہمیں شرمندہ کر دیتا ہے اور جب چاہے شرمندہ نہیں کرتا۔ پس ہم اختیار میں اس کے حکم کے تحت ہیں اور اضطرار میں ہم اس پر حاکم ہیں۔ پس اللہ کی رحمت کو دیکھو کہ اس نے تمہیں اپنے رب کے حکم پر صبر کرنے کا حکم دیا، پھر مزید فرمایا: **فَإِنَّكَ بِأَعْيُنِنا** (کیونکہ تم ہماری آنکھوں کے سامنے ہو)۔ ہم نے تم پر جو بھی حکم لگایا وہ ہمارے نزدیک تمہارے لیے سب سے زیادہ مصلحت والا ہے، خواہ وہ تمہیں خوش کرے یا برا لگے۔ اس کا مقصد اس فرمان سے یہی ہے: **فَإِنَّكَ بِأَعْيُنِنا** (کیونکہ تم ہماری آنکھوں کے سامنے ہو)، یعنی تم اس حال میں نہیں ہو کہ ہم تمہیں بھول جائیں یا نظر انداز کر دیں۔ پس اس کے بعد تم جو بھی بندے بننا چاہو، تم اسی کے لیے ہو جس کا تم نے ارادہ کیا، اور اللہ حق (الحق) فرماتا ہے اور وہی سیدھے راستے کی رہنمائی کرتا ہے۔",
    "fa": "باب پانصد و پنجم در شناخت حال قطبی که منزلش «و برای حکم پروردگارت صبر کن، زیرا تو در دیدگان مایی» (وَاصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنا) بود، و او از یاران ما محمد مراکشی در مراکش بود.\n\n> قلب هستی (الوجود) جز وجود من نیست *** و همچنین در شهود (الشهود)، عین شهود من است.\n> پس من قلب هستم و مهیمن قلب من است *** و او نسبت به من در جایگاه رگ گردن است.\n> او را به آنچه شنیده‌اید محدود نکنید *** زیرا او از قید حدود برتر است.\n> هر کس مرا دید، او را دیده است، و هر کس مرا ندید *** به فرض سجده قائل نشد.\n> سجده تنها بر کسی واجب می‌شود *** که درباره حق (الحق) بگوید: او از وجود من است.\n\nسخن پیامبر (صلی الله علیه و سلم): «هر کس خود را شناخت، پروردگارش را شناخت.» (من عرف نفسه عرف ربه)\n\nمحمد مراکشی را در مراکش دیدم. او شب و روز با من بسیار سخن می‌گفت و این عادت همیشگی او بود. هرگز ندیدم که سینه‌اش از چیزی تنگ شود. سختی‌ها بر او می‌گذشتند و او آن‌ها را جز با شادی و خنده استقبال نمی‌کرد، و در نظر ما گشایش می‌یافت. او از شادی به شادی و از سرور به سرور دیگر منتقل می‌شد. به او می‌گفتم: آیا بر فرود آمدن این مصیبت‌هایی که طبعاً ناخوشایندند، صبر می‌کنی؟ می‌گفت: چرا صبر نکنم؟ آن صبر بر حکم الهی، برای من مشاهده عین (شهود) را به بار آورد که مرا از هر حکمی باز داشت. پس من آن را جز به واسطه او (حق) دریافت نمی‌کنم، و او پناهگاه من است. از او می‌خواهم، زیرا در رؤیت من، مصیبت‌ها به واسطه او نازل می‌شوند، در حالی که شما حکم مصیبت را در صورت من می‌بینید؛ و هر کس بر اساس نظر خود می‌بیند. سپس این شخص از کسانی بود که بیشترین محافظت را بر اوقات عبادات خود داشت. به خدا سوگند، پس از او کسی را در این مقام ندیدم. هیچ یک از برادرانم هنگام جدایی من از او به سوی این سرزمین‌ها، به اندازه او بر فراق من حسرت نخورد. او به من می‌گفت: به خدا سوگند، اگر مشاهده عین (شهود) که مرا از نفوذ حکم ربانی در خودم باز داشته، نبود، با تو سفر می‌کردم. به خدا سوگند، از تو چیزی از من پنهان نمی‌شود مگر تبدیل صورت حق (الحق) به صورتی دیگر، و من او را در غیاب و حضور شهود می‌کنم. این یک ذوق (تجربه عرفانی) شگفت‌انگیز بود. او بسیار مؤدب و پرحرف بود، و تقریباً هرگز از راهنمایی مردم به سوی خداوند عز و جل سکوت نمی‌کرد. وقتی در این باره به او گفته می‌شد، می‌گفت: من فریضه خود را در کلامم ادا می‌کنم، و تو در همنشینی با من و گوش دادن به آنچه بیان می‌کنم، مختاری. من با کسی سخن می‌گویم که می‌شنود، نه با کسی که نمی‌شنود.\n\nبدان که این ذکر (یادآوری) ثبوت (پایداری) را همراه با حکم ربانی به ارمغان می‌آورد، زیرا در آن مصلحتی نهفته است، حتی اگر بنده آن را درک نکند و جاهل باشد. پس در نفس‌الامر، آن حکم هر چه باشد، مصلحت است. و این همان مقام احسان اول است که بالاتر از ایمان قرار دارد. پس صاحب این مقام، شهود (الشهود) دائمی در اختلاف احکام دارد، و اختلاف احکام ضروری است، زیرا خداوند متعال «هر روز در کاری است» (كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ). اگر صاحب غرضی هستی و احساس بیماری و درد می‌کنی، نفس خود را از شکایت به غیر از کسی که تو را با حکم خود آزرده است، بازدار؛ همان‌گونه که ایوب (علیه السلام) انجام داد. این همان ادب الهی است که خداوند به پیامبران و رسولانش آموخت. زیرا او تو را نیازرده و بر خلاف غرضت حکم نرانده است، و غرض او از جاری کردن حکمش بر تو، جز این نیست که از او بخواهی آن را از تو برطرف سازد، به واسطه آن عَرَضی که در تو قرار داده و به سبب آن درد کشیدی. پس کسی که با وجود احساس بلا و عدم موافقت غرض، به خدا شکایت نکند، در واقع در برابر قهر الهی مقاومت کرده است. ابویزید بسطامی گرسنه شد و گریست. از او در این باره پرسیدند، گفت: او مرا گرسنه کرد تا گریه کنم. پس نهایت ادب در شکایت به سوی خدا برای رفع آن است، نه به سوی دیگری. و نام صبر بر او باقی می‌ماند، چنانکه خداوند متعال درباره رسولش ایوب (علیه السلام) فرمود: «ما او را صابر یافتیم» (إِنَّا وَجَدْناهُ صابِراً). این در زمان اضطراب و تکیه بر اسباب بود، اما او مضطرب نشد و به چیزی جز خدا تکیه نکرد، مگر به سوی ما، نه به سببی از اسباب. زیرا طبعاً هنگام احساس، اضطراب و تغییر مزاج ناگزیر است. به همین دلیل، حلاج هنگام قطع شدن اعضایش، صورت خود را به خون آغشت تا تغییر مزاجش در چشم عوام ظاهر نشود، از روی غیرت بر مقام، به دلیل معرفتش به همه این امور. و اوست که در آن حال می‌گفت:\n\n> هیچ عضو و مفصلی برای من بریده نشد *** مگر آنکه در آن برای شما ذکری (یادآوری) بود.\n\nبر خلاف دردهای روانی، هنگامی که اموری وارد می‌شوند که شأن آن‌ها آزرده ساختن نفوس است، برخی از بندگان خدا آن‌ها را دریافت می‌کنند و در ظاهرشان اثری از آن نیست. اما امور دردناک حسی، اگر احساس شوند، طبعاً ما را به حرکت درمی‌آورند، مگر اینکه امری او را مشغول سازد که احساسش را نسبت به آن درد از بین ببرد. سخن ما در این باره با وجود احساس است، مانند ایوب و ذوالنون (سلام الله علیهما). اما شکایت به سوی کسی که هیچ امری در دست او نیست، همانند عادت عموم مردم است، و این حال بیشتر جهانیان است که بندگان اسباب هستند. بزرگان از بندگان خدا با این روش (عدم شکایت به غیر) خود را از مورد اشاره قرار گرفتن پنهان می‌سازند. «و برای حکم پروردگارت صبر کن» (وَاصْبِرْ لِحُكْمِ رَبِّكَ) که به آن امر شده است، همان ثبوت (پایداری) با خدا هنگام نفوذ حکم الهی در بنده است، هر حکمی که باشد، چه بلا باشد و چه عافیت. زیرا شادی به دست آوردن غرض، صاحبش را بیشتر از زوال صاحب بلا از ثبوت دور می‌سازد. چرا که حرکت شادی باعث دهشت و افزایش اضطراب صاحبش می‌شود، مگر اینکه نیروی حال او بیشتر از واردات شادی باشد. اما همّ و غم، برای کسی که حکم بر او جاری شده، به ثبوت و سکون نزدیک‌تر است تا شادی کسی که به غرض خود رسیده است. پس این (صبر) ذکری است که خیر و شر را با هم در بر می‌گیرد، و این دو حال هستند. احوال همیشه حاکم‌اند، و محکوم علیه ناگزیر باید تحت قهر حاکم باشد تا حکم او در او نفوذ کند. و این همان چیزی است که او را مضطرب می‌سازد، زیرا مطلوب انسان به طور طبیعی، خروج از تنگی به سوی گشایش و وسعت و نور درخشان است، به دلیل ظلمت و تنگی طبعی که می‌بیند، پس صبر نمی‌کند. از این رو به او گفته شد: بر حکم ثابت بمان، زیرا تو از نفوذ حکمی در خود خالی نیستی، یا آنچه تو را ناخوش آید یا آنچه تو را شاد سازد. اگر ناخوشایند بود، برای رفع آن به سوی ما حرکت کن، و اگر شادمان ساخت، برای باقی ماندن آن و شکرگزاری بر آن به سوی ما حرکت کن، تا ما بر سرور تو بیفزاییم و آن را مضاعف سازیم و ضعیف نشود. پس تو در هر حال سود می‌بری. و ما تو را به صبر امر نکردیم مگر برای اینکه صبر عبادتی واجب باشد، تا پاداش کسی را بگیری که واجب را ادا کرده است، و بنده مضطری باشی که به صبر و رضایت ستوده می‌شوی. و اگر تو را بر اختیار وا می‌گذاشتیم و صبر می‌کردی، بنده مختاری بودی (یعنی صاحب اختیار)، و طعم سیادت ما را بر خود نمی‌چشیدی. زیرا مختار هرگاه بخواهد ما را بر خود ولایت می‌دهد و هرگاه بخواهد ما را عزل می‌کند، و هرگاه بخواهد ما را خجل می‌سازد و هرگاه نخواهد خجل نمی‌سازد. پس ما در اختیار، تابع حکم او هستیم، و در اضطرار، حاکم بر او. پس به رحمت خدا بر خود بنگر، آنجا که تو را به صبر بر حکم پروردگارت امر کرد، سپس افزود: «زیرا تو در دیدگان مایی» (فَإِنَّكَ بِأَعْيُنِنا). ما بر تو حکم نکردیم مگر به آنچه نزد ما برای تو اصلح است، چه تو را شاد سازد و چه ناخوش آید. مقصود او از این سخن «زیرا تو در دیدگان مایی» (فَإِنَّكَ بِأَعْيُنِنا) این است که تو در جایگاهی نیستی که ما تو را نادیده بگیریم یا فراموش کنیم. پس بعد از این هر بنده‌ای که می‌خواهی باش، تو همان هستی که قصد کرده‌ای. و خداوند «حق را می‌گوید و راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}