{
  "id": 24,
  "title": {
    "ar": "الباب الرابع والعشرون في معرفة جاءت عن العلوم الكونية",
    "en": "Chapter Twenty-Four: On the Gnosis Derived from the Cosmological Sciences (العلوم الكونية)",
    "ur": "چوبیسواں باب: علوم کونیہ سے حاصل ہونے والی معرفت کے بیان میں",
    "fa": "باب بیست و چهارم در معرفتی که از علوم کیهانی (العلوم الكونية) حاصل شده است"
  },
  "content": {
    "ar": "## (الباب الرابع والعشرون) في معرفة جاءت عن العلوم الكونية\n\n\nوما تتضمنه من العجائب ومن حصلها من العالم ومراتب أقطابهم وأسرار الاشتراك بين شريعتين والقلوب المتعشقة بعالم الأنفاس وبالأنفاس وأصلها وإلى كم تنتهي منازلها\n\n\n> تعجبت من ملك يعود بنا ملكا *** ومن مالك أضحى لمملوكه ملكا\n\n\n> فذلك ملك الملك إن كنت ناظما *** من اللؤلؤ المنثور من علمنا سلكا\n\n\n> فخذ عن وجود الحق علما مقدسا *** ليأخذ ذاك العلم من شاءه عنكا\n\n\n> فإن كنت مثلي في العلوم فقد ترى *** بأن الذي في كونه نسخة منكا\n\n\n> فهل في العلى شي‏ء يقاوم أمركم *** وقد فتكت أسيافكم في الورى فتكا\n\n\n> فلو كنت تدري يا حبيبي وجوده *** ومن أنت كنت السيد العلم الملكا\n\n\n> وكان إله الخلق يأتيك ضعف ما *** أتيت إليه إن تحققته ملكا\n\n\n### [ملك الملك: والرابطة الوجودية بين الحق والخلق‏]\n\n\nاعلم أيدك الله أن الله يقول ادْعُونِي أَسْتَجِبْ لَكُمْ فإذا علمت هذا علمت إن الله رب كل شي‏ء ومليكه فكل ما سوى الله تعالى مربوب لهذا الرب وملك لهذا الملك الحق سبحانه ولا معنى لكون العالم ملك الله تعالى إلا تصرفه فيه على ما يشاء من غير تحجير وأنه محل تأثير الملك سيده جل علاه فتنوع الحالات التي هو العالم عليها هو تصرف الحق فيه على حكم ما يريده ثم إنه لما رأينا الله تعالى يقول كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ فأشرك نفسه مع عبده في الوجوب عليه وإن كان هو الذي أوجب على نفسه ما أوجب فكلامه صدق ووعده حق كما يوجب الإنسان بالنذر على نفسه ابتداء ما لم يوجبه الحق عليه فأوجب الله عليه الوفاء بنذره الذي أوجبه على نفسه فأمره بالوفاء بنذره ثم رأيناه تعالى لا يستجيب إلا بعد دعاء العبد إياه كما شرع كما إن العبد لا يكون مجيبا للحق حتى يدعوه الحق إلى ما يدعوه إليه قال‏\nتعالى فَلْيَسْتَجِيبُوا لِي فصار للعبد والعالم الذي هو ملك لله سبحانه تصرف إلهي في الجانب الأحمى بما تقتضيه حقيقة العالم بالطلب الذاتي وتصريف آخر بما يقتضيه وضع الشريعة\n\n\n### [الوجوب على الله‏]\n\n\nفلما كان الأمر على ما ذكرناه من كون الحق يجيب أمر العبد إذا دعاه وسأله كما إن العبد يجيب أمر الله إذا أمره وهو قوله وأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ فشرك في القضية ولما كان الحق يقتضي بذاته أن يتذلل له سواء شرع لعباده أعمالا أو لم يشرع كذلك يقتضي ببقاء وجود عينه حفظ الحق إياه سواء شرع الحق ما شرعه أو لم يشرع ثم لما شرع للعبد أعمالا إذا عملها شرع لنفسه أن يجازي هذا العبد على فعل ما كلفه به فصار الجناب العالي ملكا لهذا الملك الذي هو العالم بما ظهر من أثر العبد فيه من العطاء عند السؤال فانطلق عليه صفة يعبر عنها ملك الملك فهو سبحانه مالك وملك بما يأمر به عباده وهو سبحانه ملك بما يأمره به العبد فيقول رَبِّ اغْفِرْ لِي كما قال له الحق أَقِمِ الصَّلاةَ لِذِكْرِي فيسمى ما كان من جانب الحق للعبد أمرا ويسمى ما كان من جانب العبد للحق دعاء أدبا إلهيا وإنما هو على الحقيقة أمر فإن الحد يشمل الأمرين معا وأول من اصطلح على هذا الاسم في علمي محمد بن علي الترمذي الحكيم وما سمعنا هذا اللفظ عن أحد سواه وربما تقدمه غيره بهذا الاصطلاح وما وصل إلينا إلا أن الأمر صحيح ومسألة الوجوب على الله عقلا مسألة خلاف بين أهل النظر من المتكلمين فمن قائل بذلك وغير قائل بها وأما الوجوب الشرعي فلا ينكره إلا من ليس بمؤمن بما جاء من عند الله‏\n\n\n### [الإضافة والمتضايفان‏]\n\n\nواعلم أن المتضايفين لا بد أن يحدث لكل أحد من المتضايفين اسم تعطيه الإضافة فإذا قلت زيد فهو إنسان بلا شك لا يعقل منه غير هذا فإذا قلت عمرو فهو إنسان لا يعقل منه غير هذا فإذا قلت زيد بن عمرو أو زيد عبد عمرو فلا شك أنه قد حدث لزيد البنوة إذ كان ابن عمرو وحدث لعمرو اسم الأبوة إذ كان أبا لزيد فبنوة زيد أعطت الأبوة لعمرو والأبوة لعمرو أعطت البنوة لزيد فكل واحد من المتضايفين أحدث لصاحبه معنى لم يكن يوصف به قبل الإضافة وكذلك زيد عبد عمرو فأعطت العبودة أن يكون زيد مملوكا وعمرو مالكا فقد أحدثت مملوكية زيد اسم المالك لعمرو وأحدث ملك عمرو لزيد مملوكية زيد فقيل فيه مملوك وقيل في عمرو مالك ولم يكن لكل واحد منهما معقولية هذين الاسمين قبل أن توجد الإضافة فالحق حق والإنسان إنسان فإذا قلت الإنسان أو الناس عبيد الله قلت إن الله ملك الناس لا بد من ذلك فلو قدرت ارتفاع وجود العالم من الذهن جملة واحدة من كونه ملكا لم يرتفع وجود الحق لارتفاع العالم وارتفع وجود معنى الملك عن الحق ضرورة ولما كان وجود العالم مرتبطا بوجود الحق فعلا وصلاحية لهذا كان اسم الملك لله تعالى أزلا وإن كان عين العالم معدوما في العين لكن معقوليته موجودة مرتبطة باسم المالك فهو مملوك لله تعالى وجودا وتقديرا قوة وفعلا فإن فهمت وإلا فافهم‏\n\n\n### [المعية والأينية الإلهيتان‏]\n\n\nوليس بين الحق والعالم بون يعقل أصلا إلا التمييز بالحقائق فالله ولا شي‏ء معه سبحانه ولم يزل كذلك ولا يزال كذلك لا شي‏ء معه فمعيته معنا كما يستحق جلاله وكما ينبغي لجلاله ولو لا ما نسب لنفسه إنه معنا لم يقتض العقل أن يطلق عليه معنى المعية كما لا يفهم منها العقل السليم حين أطلقها الحق على نفسه ما يفهم من معية العالم بعضه مع بعض لأنه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ قال تعالى وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ وقال تعالى إِنَّنِي مَعَكُما أَسْمَعُ وأَرى‏ لموسى وهارون فنقول إن الحق معنا على حد ما قاله وبالمعنى الذي أراده ولا نقول إنا مع الحق فإنه ما ورد والعقل لا يعطيه فما لنا وجه عقلي ولا شرعي يطلق به إننا مع الحق وأما من نفي عنه إطلاق الأينية من أهل الإسلام فهو ناقص الايمان فإن العقل ينفي عنه معقولية الأينية والشرع الثابت في السنة لا في الكتاب قد أثبت إطلاق لفظ الأينية على الله فلا تتعدى ولا يقاس عليها وتطلق في الموضع الذي أطلقها الشارع‏\n\n\nقال رسول الله صلى الله عليه وسلم للسوداء التي ضربها سيدها أين الله فأشارت إلى السماء فقبل إشارتها وقال أعتقها فإنها مؤمنة\n\n\nفالسائل بالأينية أعلم الناس بالله تعالى وهو رسول الله صلى الله عليه وسلم وتأول بعض علماء الرسوم إشارتها إلى السماء وقبول النبي صلى الله عليه وسلم ذلك منها لما كانت الآلهة التي تعبد في الأرض وهذا تأويل جاهل بالأمر غير عالم وقد علمنا أن العرب كانت تعبد كوكبا في السماء يسمى الشعرى سنه لهم أبو كبشة وتعتقد فيها أنها رب الأرباب هكذا وقفت على مناجاتهم إياها ولذلك قال تعالى وأَنَّهُ هُوَ رَبُّ الشِّعْرى‏ فلو لم يعبد كوكب في السماء لساغ هذا التأويل لهذا المتأول وهذا أبو كبشة الذي كان شرع عبادة الشعرى هو من‏\nأجداد رسول الله صلى الله عليه وسلم لأمه ولذلك كانت العرب تنسب رسول الله صلى الله عليه وسلم إليه فتقول ما فعل ابن أبي كبشة حيث أحدث عبادة إله واحد كما أحدث جده عبادة الشعرى‏\n\n\n### [أقطاب مقام ملك الملك‏]\n\n\nومن أقطاب هذا المقام ممن كان قبلنا محمد ابن علي الترمذي الحكيم ومن شيوخنا أبو مدين رحمه الله وكان يعرف في العالم العلوي بأبي النجا وبه يسمونه الروحانيون وكان يقول رضي الله عنه سورتي من القرآن تبارك الذي بيده الملك ومن أجل هذا كنا نقول فيه إنه أحد الإمامين لأن هذا هو مقام الإمام ثم نقول ولما كان الحق تعالى مجيبا لعبده المضطر فيما يدعوه به ويسأله منه صار كالمتصرف فلهذا كان يشير أبو مدين بقوله فكان يقول فيه ملك الملك وأما صحة هذه الإضافة لتحقق العبد في كل نفس إنه ملك لله تعالى من غير أن يتخلل هذا الحال دعوى تناقضه فإذا كان بهذه المثابة حينئذ يصدق عليه أنه ملك عنده فإن شابته رائحة من الدعوى وذلك بأن يدعي لنفسه ملكا عريا عن حضوره في تمليك الله إياه ذلك الأمر الذي سماه ملكا له وملكا لم يكن في هذا المقام ولا صح له أن يقول في الحق إنه ملك الملك وإن كان كذلك في نفس الأمر فقد أخرج هذا نفسه بدعواه بجهله أنه ملك لله وغفلته في أمر ما فيحتاج صاحب هذا المقام إلى ميزان عظيم لا يبرح بيده ونصب عينه‏\n\n\n(وصل) وأما أسرار الاشتراك بين الشريعتين‏\n\n\nفمثل قوله تعالى أَقِمِ الصَّلاةَ لِذِكْرِي وهذا مقام ختم الأولياء ومن رجاله اليوم خضر والياس وهو تقرير الثاني ما أثبته الأول من الوجه الذي أثبته مع مغايرة الزمان ليصح المتقدم والمتأخر وقد لا يتغير المكان ولا الحال فيقع الخطاب بالتكليف للثاني من عين ما وقع للأول ولما كان الوجه الذي جمعهما لا يتقيد بالزمان والأخذ منه أيضا لا يتقيد بالزمان جاز الاشتراك في الشريعة من شخصين إلا أن العبارة يختلف زمانها ولسانها إلا أن ينطقا في آن واحد بلسان واحد كموسى وهارون لما قيل لهما اذْهَبا إِلى‏ فِرْعَوْنَ إِنَّهُ طَغى‏ ومع هذا كله فقد قيل لهما فَقُولا لَهُ قَوْلًا لَيِّناً فأتى بالنكرة في قوله قولا ولا سيما وموسى يقول هُوَ أَفْصَحُ مِنِّي لِساناً يعني هارون فقد يمكن أن يختلفا في العبارة في مجلس واحد فقد جمعهما مقام واحد وهو البعث في زمان واحد إلى شخص واحد برسالة واحدة\n\n\n### [التوسع الإلهي: أو فكرة الخلق الجديد]\n\n\nوإن كان قد منع وجود مثل هذا جماعة من أصحابنا وشيوخنا كأبي طالب المكي ومن قال بقوله وإليه نذهب وبه أقول وهو الصحيح عندنا فإن الله تعالى لا يكرر تجليا على شخص واحد ولا يشرك فيه بين شخصين للتوسع الإلهي وإنما الأمثال والأشباه توهم الرائي والسامع للتشابه الذي يعسر فصله إلا على أهل الكشف والقائلين من المتكلمين إن العرض لا يبقى زمانين ومن الاتساع الإلهي أن الله أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ وميز كل شي‏ء في العالم بأمر ذلك الأمر هو الذي ميزه عن غيره وهو أحدية كل شي‏ء فما اجتمع اثنان في مزاج واحد قال أبو العتاهية\n\n\n> وفي كل شي‏ء له آية *** تدل على أنه واحد\n\n\nوليست سوى أحدية كل شي‏ء فما اجتمع قط اثنان فيما يقع به الامتياز ولو وقع الاشتراك فيه ما امتازت وقد امتازت عقلا وكشفا ومن هذا المنزل في هذا الباب تعرف إيراد الكبير على الصغير والواسع على الضيق من غير أن يضيق الواسع ويوسع الضيق أي لا يغير شي‏ء عن حاله لكن لا على الوجه الذي يذهب إليه أهل النظر من المتكلمين والحكماء في ذلك فإنهم يذهبون إلى اجتماعهما في الحد والحقيقة لا في الجرمية فإن كبر الشي‏ء وصغره لا يؤثر في الحقيقة الجامعة لهما ومن هذا الباب أيضا قال أبو سعيد الخراز ما عرف الله إلا بجمعه بين الضدين ثم تلا هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ يريد من وجه واحد لا من نسب مختلفة كما يراه أهل النظر من علماء الرسوم‏\n\n\n### [عيسى خاتم الولاية العامة]\n\n\nواعلم أنه لا بد من نزول عيسى عليه السلام ولا بد من حكمه فينا بشريعة محمد صلى الله عليه وسلم يوحي الله بها إليه من كونه نبيا فإن النبي لا يأخذ الشرع من غير مرسله فيأتيه الملك مخبرا بشرع محمد الذي جاء به صلى الله عليه وسلم وقد يلهمه إلهاما فلا يحكم في الأشياء بتحليل وتحريم إلا بما كان يحكم به رسول الله صلى الله عليه وسلم لو كان حاضرا ويرتفع اجتهاد المجتهدين بنزوله عليه السلام ولا يحكم فينا بشرعه الذي كان عليه في أوان رسالته ودولته فيما هو عالم بها من حيث الوحي الإلهي إليه بها هو رسول ونبي وبما هو الشرع الذي كان عليه محمد صلى الله عليه وسلم هو تابع له فيه وقد يكون له من الاطلاع على روح محمد صلى الله عليه وسلم كشفا بحيث أن يأخذ عنه ما شرع الله له أن يحكم به في أمته صلى الله عليه وسلم فيكون عيسى ع‏\nصاحبا ونابعا من هذا الوجه وهو عليه السلام من هذا الوجه خاتم الأولياء فكان من شرف النبي صلى الله عليه وسلم إن ختم الأولياء في أمته نبي رسول مكرم هو عيسى عليه السلام وهو أفضل هذه الأمة المحمدية وقد نبه عليه الترمذي الحكيم في كتاب ختم الأولياء له وشهد له بالفضيلة على أبي بكر الصديق وغيره فإنه وإن كان وليا في هذه الأمة والملة المحمدية فهو نبي ورسول في نفس الأمر فله يوم القيامة حشران يحشر في جماعة الأنبياء والرسل بلواء النبوة والرسالة وأصحابه تابعون له فيكون متبوعا كسائر الرسل ويحشر أيضا معنا وليا في جماعة أولياء هذه الأمة تحت لواء محمد صلى الله عليه وسلم تابعا له مقدما على جميع الأولياء من عهد آدم إلى آخر ولي يكون في العالم فجمع الله له بين الولاية والنبوة ظاهرا وما في الرسل يوم القيامة من يتبعه رسول إلا محمد صلى الله عليه وسلم فإنه يحشر يوم القيامة في أتباعه عيسى والياس عليهما السلام وإن كان كل من في الموقف من آدم فمن دونه تحت لوائه صلى الله عليه وسلم فذلك لواؤه العام وكلامنا في اللواء الخاص بأمته صلى الله عليه وسلم‏\n\n\n### [ختم الولاية المحمدية الخاصة]\n\n\nوللولاية المحمدية المخصوصة بهذا الشرع المنزل على محمد صلى الله عليه وسلم ختم خاص هو في الرتبة دون عيسى عليه السلام لكونه رسولا وقد ولد في زماننا ورأيته أيضا واجتمعت به ورأيت العلامة الختمية التي فيه فلا ولي بعده إلا وهو راجع إليه كما أنه لا نبي بعد محمد صلى الله عليه وسلم إلا وهو راجع إليه كعيسى إذا نزل فنسبة كل ولي يكون بعد هذا الختم إلى يوم القيامة نسبة كل نبي يكون بعد محمد صلى الله عليه وسلم في النبوة كإلياس وعيسى والخضر في هذه الأمة وبعد أن بينت لك مقام عيسى عليه السلام إذا نزل فقل ما شئت إن شئت قلت شريعتين لعين واحدة وإن شئت قلت شريعة واحدة\n\n\n### (وصل) [القلوب المتعشقة بالأنفاس الرحمانية]\n\n\nوأما القلوب المتعشقة بالأنفاس فإنه لما كانت خزائن الأرواح الحيوانية تعشقت بالأنفاس الرحمانية للمناسبة قال رسول الله صلى الله عليه وسلم إن نفس الرحمن يأتيني من قبل اليمن ألا وإن الروح الحيواني نفس وإن أصل هذه الأنفاس عند القلوب المتعشق بها النفس الرحماني الذي من قبل اليمن لمن أخرج عن وطنه وحيل بينه وبين مسكنه وسكنه ففيها تفريج الكرب ودفع النوب وقال صلى الله عليه وسلم إن لله نفحات فتعرضوا لنفحات ربكم‏\n\n\nوتنتهي منازل هذه الأنفاس في العدد إلى ثلاثمائة نفس وثلاثين نفسا في كل منزل من منازلها التي جملتها الخارج من ضرب ثلاثمائة وثلاثين في ثلاثمائة وثلاثين فما خرج فهو عدد الأنفاس التي تكون من الحق من اسمه الرحمن في العالم البشري والذي أ تحققه أن لها منازل تزيد على هذا المقدار مائتين منزلا في حضرة الفهوانية خاصة فإذا ضربت ثلاثمائة وثلاثين في خمسمائة وثلاثين فما خرج لك بعد الضرب فهو عدد الأنفاس الرحمانية في العالم الإنساني كل نفس منها علم إلهي مستقل عن تجل إلهي خاص لهذه المنازل لا يكون لغيرها فمن شم من هذه الأنفاس رائحة عرف مقدارها وما رأيت من أهلها من هو معروف عند الناس وأكثر ما يكونون من بلاد الأندلس واجتمعت بواحد منهم بالبيت المقدس وبمكة فسألته يوما في مسألة فقال لي هل تشم شيئا فعلمت أنه من أهل ذلك المقام وخدمني مدة وكان لي عم أخو والدي شقيقة اسمه عبد الله بن محمد بن العربي كان له هذا المقام حسا ومعنى شاهدنا ذلك منه قبل رجوعنا لهذا الطريق في زمان جاهليتي والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## (Chapter Twenty-Four) Concerning the Gnosis derived from Cosmological Sciences (العلوم الكونية)\n\nAnd the wonders they contain, and those among the people who attain them, the levels (مراتب) of their spiritual poles (أقطاب), the secrets of the shared aspects between two Divine Laws (شريعتين), and the hearts enamored with the world of Breaths (الأنفاس) and with the Breaths themselves, their origin, and the extent of their stations (منازلها).\n\n> I marvel at a sovereign who returns to us as sovereignty,\n> And at a possessor who becomes a possession for his owned.\n\n> That is the Sovereign of Sovereignty (ملك الملك), if you string\n> A thread from the scattered pearls of our knowledge.\n\n> Take from the Existence (وجود) of The Real (الحق) a sacred knowledge,\n> So that whoever desires that knowledge may take it from you.\n\n> If you are like me in the sciences, you will see\n> That what is in His cosmos is a copy of you.\n\n> Is there anything in the heights that resists your command,\n> When your swords have wrought havoc among mankind?\n\n> If you knew, O my beloved, His Existence (وجوده)\n> And who you are, you would be the Master, the Sign, the Sovereign.\n\n> And the God of Creation would come to you twice what\n> You came to Him, if you realized Him as a sovereign.\n\n### [The Sovereign of Sovereignty (ملك الملك): And the Existential Link (الرابطة الوجودية) between The Real (الحق) and Creation (الخلق)]\n\nKnow, may Allah support you, that Allah says: <<ادْعُونِي أَسْتَجِبْ لَكُمْ>> (Call upon Me; I will respond to you). When you know this, you know that Allah is the Lord of all things and their Possessor (مليكه). Everything other than Allah the Exalted is lorded over by this Lord and possessed by this Sovereign (الملك), The Real (الحق), glory be to Him. The meaning of the world being the possession (ملك) of Allah the Exalted is nothing other than His disposal of it as He wills, without restriction, and that it is the locus of the influence of the Sovereign, its Master, exalted is His glory. Thus, the variety of states upon which the world exists is the disposal of The Real (الحق) within it, according to the ruling of what He desires.\n\nThen, when we see Allah the Exalted saying: <<كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ>> (Your Lord has prescribed mercy upon Himself), He associated Himself with His servant in the obligation (الوجوب) upon Him, even though He is the one who obligated upon Himself what He obligated. His speech is truth and His promise is real, just as a human being initially obligates upon himself by a vow (نذر) something that The Real (الحق) had not obligated upon him, and then Allah obligates upon him the fulfillment of his vow which he obligated upon himself. Thus, He commanded him to fulfill his vow.\n\nThen we see that He the Exalted does not respond except after the servant calls upon Him, as prescribed by the Divine Law (شرع). Similarly, the servant does not respond to The Real (الحق) until The Real calls him to what He calls him to. He the Exalted said: <<فَلْيَسْتَجِيبُوا لِي>> (So let them respond to Me).\n\nThus, the servant and the world, which is the possession (ملك) of Allah the Glorious, acquire a Divine disposal (تصرف إلهي) in the most protected aspect (الجانب الأحمى), according to what the reality (حقيقة) of the world necessitates through intrinsic demand (الطلب الذاتي), and another disposal according to what the establishment of the Divine Law (الشريعة) necessitates.\n\n### [Obligation (الوجوب) upon Allah]\n\nSince the matter is as we have mentioned—that The Real (الحق) responds to the command of the servant when he calls upon Him and asks Him, just as the servant responds to the command of Allah when He commands him, which is His saying: <<وأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ>> (Fulfill My covenant, and I will fulfill your covenant)—He shared in the matter.\n\nAnd since The Real (الحق) intrinsically necessitates that one humble oneself before Him, whether He legislated acts for His servants or not, likewise, the persistence of the existence of the essence (عين) necessitates that The Real preserve it, whether The Real legislated what He legislated or not.\n\nThen, when He legislated acts for the servant, if the servant performs them, He legislated for Himself that He reward this servant for performing what He obligated upon him. Thus, the Exalted Presence became a possession (ملك) for this sovereign (ملك), which is the world, through the effect of the servant's action therein—namely, the granting [of the request] upon asking. Hence, the attribute expressed as the Sovereign of Sovereignty (ملك الملك) was applied to Him.\n\nHe, glory be to Him, is Possessor (مالك) and Sovereign (ملك) by what He commands His servants, and He, glory be to Him, is Sovereign (ملك) by what the servant commands Him, saying: \"My Lord, forgive me,\" just as The Real said to him: <<أَقِمِ الصَّلاةَ لِذِكْرِي>> (Establish the prayer for My remembrance). What comes from the side of The Real to the servant is called a command (أمر), and what comes from the side of the servant to The Real is called an invocation (دعاء), out of Divine courtesy (أدبا إلهيا), though in reality, it is also a command, for the definition encompasses both matters.\n\nThe first person known in my knowledge to coin this term was Muhammad ibn Ali al-Tirmidhi al-Hakim, and we have not heard this phrase from anyone else, although others may have preceded him with this terminology. However, the matter itself is sound. The issue of the rational obligation (الوجوب عقلا) upon Allah is a matter of dispute among the speculative theologians (المتكلمين), some affirming it and others denying it. As for the legal obligation (الوجوب الشرعي), no one denies it except one who does not believe in what came from Allah.\n\n### [The Relation (الإضافة) and Correlatives (المتضايفان)]\n\nKnow that for every pair of correlatives (المتضايفين), a name must arise for each one, conferred by the relation (الإضافة). If you say Zayd, he is undoubtedly a human being, and nothing else is conceived of him. If you say Amr, he is a human being, and nothing else is conceived of him. But if you say Zayd is the son of Amr, or Zayd is the servant of Amr, there is no doubt that the name 'sonship' (البنوة) has arisen for Zayd because he is the son of Amr, and the name 'fatherhood' (الأبوة) has arisen for Amr because he is the father of Zayd. Zayd’s sonship conferred fatherhood upon Amr, and Amr’s fatherhood conferred sonship upon Zayd. Thus, each of the correlatives brought forth a meaning in the other that was not described before the relation.\n\nLikewise, Zayd is the servant of Amr. Servitude (العبودة) conferred upon Zayd the status of being owned (مملوكا) and upon Amr the status of being the owner (مالكا). Zayd’s status of being owned brought forth the name 'Owner' (المالك) for Amr, and Amr’s ownership of Zayd brought forth Zayd’s status of being owned. So, Zayd was called 'owned' (مملوك) and Amr was called 'Owner' (مالك), and neither of them possessed the conceptual reality (معقولية) of these two names before the relation existed.\n\nThe Real (الحق) is The Real, and the human is human. If you say that the human or people are the servants of Allah, you must say that Allah is the Sovereign (ملك) of the people. If you were to suppose the complete removal of the world’s existence from the mind, the Existence (وجود) of The Real would not be removed by the removal of the world, but the existence of the meaning of 'Sovereign' (الملك) would necessarily be removed from The Real.\n\nSince the existence of the world is linked to the Existence (وجود) of The Real, both actually and potentially, the Name 'Sovereign' (الملك) belonged to Allah eternally (أزلا), even if the essence (عين) of the world was non-existent in reality, because its conceptual reality (معقوليته) is existent and linked to the Name 'Possessor' (المالك). Thus, it is possessed by Allah the Exalted, both in existence and in estimation, potentially and actually. If you have understood, then understand.\n\n### [The Divine Togetherness (المعية) and Whereness (الأينية)]\n\nThere is no conceivable distance (بون) between The Real (الحق) and the World (العالم) at all, except for the distinction based on their realities (الحقائق). Allah was, and there was nothing with Him, glory be to Him. He has ever been so, and He shall remain so—nothing is with Him. His togetherness (معيته) with us is as befits His Majesty (جلاله) and as is proper for His Majesty. Were it not that He attributed to Himself that He is with us, sound reason (العقل) would not permit the application of the meaning of togetherness (المعية) to Him, just as sound reason does not understand from His application of it to Himself what it understands from the togetherness of one part of the world with another, because <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him).\n\nHe the Exalted said: <<وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ>> (And He is with you wherever you are). And He the Exalted said to Moses and Aaron: <<إِنَّنِي مَعَكُما أَسْمَعُ وأَرى‏>> (Indeed, I am with you both; I hear and I see).\n\nSo, we say that The Real is with us according to the limit He stated and in the meaning He intended. But we do not say that we are with The Real, for that has not been transmitted, and reason does not grant it. We have no rational or legal basis upon which to assert that we are with The Real.\n\nAs for those among the people of Islam who deny the application of 'whereness' (الأينية) to Him, their faith is deficient. Although reason (العقل) negates the conceptual reality of 'whereness' from Him, the Divine Law (الشرع) established in the Sunna—though not in the Book [Quran]—has affirmed the application of the word 'whereness' (الأينية) to Allah. Therefore, one should not exceed this, nor make analogies based upon it, but apply it only in the place where the Lawgiver (الشارع) applied it.\n\nThe Messenger of Allah (peace and blessings be upon him) asked the black slave girl whom her master had struck, \"Where is Allah?\" (أين الله). She pointed to the sky. He accepted her gesture and said, \"Emancipate her, for she is a believer.\"\n\nThe one who asked using 'whereness' (الأينية) was the most knowledgeable person concerning Allah the Exalted, namely the Messenger of Allah (peace and blessings be upon him). Some scholars of external forms (علماء الرسوم) interpreted her pointing to the sky and the Prophet’s acceptance of it as being due to the idols worshipped on earth. This is the interpretation of an ignorant person who is unaware of the matter. We know that the Arabs used to worship a star in the sky called Sirius (الشعرى), which Abu Kabsha established for them, believing it to be the Lord of Lords. I came across their supplications to it in this manner. That is why He the Exalted said: <<وأَنَّهُ هُوَ رَبُّ الشِّعْرى‏>> (And that He is the Lord of Sirius). If a star in the sky had not been worshipped, this interpretation by that interpreter would have been permissible. This Abu Kabsha, who established the worship of Sirius, was one of the maternal ancestors of the Messenger of Allah (peace and blessings be upon him). That is why the Arabs used to attribute the Messenger of Allah (peace and blessings be upon him) to him, saying: \"What has the son of Abu Kabsha done, introducing the worship of one God, just as his grandfather introduced the worship of Sirius?\"\n\n### [The Spiritual Poles (أقطاب) of the Station of the Sovereign of Sovereignty (ملك الملك)]\n\nAmong the spiritual poles (أقطاب) of this station (مقام) who preceded us was Muhammad ibn Ali al-Tirmidhi al-Hakim. And among our Shaykhs was Abu Madyan (may Allah have mercy on him), who was known in the celestial world as Abu al-Naja, and the spiritual beings (الروحانيون) called him by this name. He used to say (may Allah be pleased with him), \"My chapter (سورتي) of the Quran is *Tabaraka alladhi bi-yadihi al-mulk* (Blessed is He in whose Hand is the Sovereignty).\" Because of this, we used to say that he was one of the two Imams (الإمامين), for this is the station of the Imam.\n\nThen we say: Since Allah the Exalted responds to His distressed servant in what he invokes and asks of Him, He becomes like the one who is disposed of (كالمتصرف). For this reason, Abu Madyan used to refer to this by saying that He is the Sovereign of Sovereignty (ملك الملك).\n\nThe validity of this attribution depends on the servant realizing (تحقق) in every breath (نفس) that he is a possession (ملك) of Allah, without this state being interrupted by a claim (دعوى) that contradicts it. If he is in this state, then it is true to say that He is a sovereign (ملك) in His presence. But if he is tainted by a trace of claim—that is, if he claims for himself a sovereignty (ملك) devoid of his awareness of Allah’s ownership of that very thing he calls his sovereignty and possession—then he is not in this station, nor is it valid for him to say that The Real is the Sovereign of Sovereignty (ملك الملك), even if He is so in reality. The person in this station requires a mighty balance (ميزان عظيم) that never leaves his hand or his sight.\n\n(Section Break) Concerning the secrets of sharing between two Divine Laws (الشريعتين):\n\nThis is exemplified by His saying: <<أَقِمِ الصَّلاةَ لِذِكْرِي>> (Establish the prayer for My remembrance). This is the station of the Seal of the Saints (ختم الأولياء), and among its men today are Khidr and Elias. It is the confirmation by the second of what the first established, in the manner in which he established it, despite the difference in time, so that the precedence and subsequence are valid. The place and the state may not change, so the address of obligation (التكليف) falls upon the second exactly as it fell upon the first. Since the aspect that unites them is not restricted by time, and the taking of knowledge from it is also not restricted by time, it is permissible for two persons to share the Divine Law (الشريعة), except that their expression (العبارة) differs in time and language, unless they speak simultaneously in one language, like Moses and Aaron, when it was said to them: <<اذْهَبا إِلى‏ فِرْعَوْنَ إِنَّهُ طَغى‏>> (Go to Pharaoh; indeed, he has transgressed). Yet, despite all this, it was said to them: <<فَقُولا لَهُ قَوْلًا لَيِّناً>> (And speak to him a gentle word), using the indefinite form (*qawlan*). Especially since Moses said: <<هُوَ أَفْصَحُ مِنِّي لِساناً>> (He [Aaron] is more eloquent than I in speech), they might differ in expression even in a single session. However, a single station (مقام) united them: being sent at the same time to the same person with a single message.\n\n### [Divine Expansion (التوسع الإلهي): Or the Idea of New Creation]\n\nAlthough a group of our companions and Shaykhs, such as Abu Talib al-Makki and those who agree with him, prohibited the existence of such a likeness, we adhere to the view that it is correct. For Allah the Exalted does not repeat a Theophany (تجليا) for a single person, nor does He share it between two persons, due to Divine Expansion (التوسع الإلهي). Rather, the likenesses and similarities (الأمثال والأشباه) only deceive the observer and the listener due to the resemblance, which is difficult to distinguish except for the People of Unveiling (أهل الكشف) and those speculative theologians (المتكلمين) who hold that the accident (العرض) does not persist for two moments.\n\nPart of Divine Expansion is that Allah <<أَعْطى‏ كُلَّ شَيْءٍ خَلْقَهُ>> (gave every thing its creation) and distinguished every thing in the world by a matter that distinguishes it from others, which is the absolute uniqueness (أحدية) of every thing. No two things have ever combined in a single temperament (مزاج واحد). Abu al-Atahiyya said:\n\n> And in everything there is a sign\n> That points to the fact that He is One.\n\nThis sign is nothing other than the absolute uniqueness (أحدية) of every thing. No two things have ever combined in that by which distinction occurs. If they shared in it, they would not be distinct, yet they are distinct rationally and through Unveiling (كشفا).\n\nFrom this station (منزل) in this chapter, you understand the entry of the large into the small, and the vast into the narrow, without the vast becoming narrow or the narrow becoming vast—that is, nothing changes its state. However, this is not according to the view held by the speculative theologians and philosophers (الحكماء), who believe that they meet in definition and reality (الحد والحقيقة), but not in corporeality (الجرمية), for the largeness and smallness of a thing do not affect the reality that unites them.\n\nIt is also from this chapter that Abu Sa'id al-Kharraz said: \"No one knows Allah except by His combination of opposites (الجمع بين الضدين).\" Then he recited: <<هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ>> (He is the First and the Last, the Manifest and the Hidden), meaning from a single perspective, not from different relations, as the scholars of external forms (علماء الرسوم) view it.\n\n### [Jesus (عيسى), the Seal of General Sainthood (الولاية العامة)]\n\nKnow that the descent of Jesus (عليه السلام) is inevitable, and his ruling among us by the Divine Law (شريعة) of Muhammad (صلى الله عليه وسلم) is inevitable. Allah will reveal this Law to him by virtue of his being a Prophet (نبي), for a Prophet does not take the Law from anyone other than his Sender. Thus, the Angel will come to him informing him of the Law of Muhammad (صلى الله عليه وسلم), or He may inspire him with it (إلهاما). He will not rule on matters of permissibility and prohibition except by what the Messenger of Allah (صلى الله عليه وسلم) would have ruled had he been present. The independent reasoning (اجتهاد) of the jurists will cease upon his descent (عليه السلام).\n\nHe will not rule among us by his own Law that he followed during his period of messengership and dominion. In matters of Divine Revelation (الوحي الإلهي), he is a Messenger and a Prophet, but in matters of the Law of Muhammad (صلى الله عليه وسلم), he is a follower (تابع) of it. He may gain insight into the spirit of Muhammad (صلى الله عليه وسلم) through Unveiling (كشفا) such that he takes from him what Allah has legislated for him to rule by among his community (صلى الله عليه وسلم).\n\nIn this respect, Jesus (عليه السلام) is a companion and a follower. From this perspective, he is the Seal of the Saints (خاتم الأولياء). It was part of the honor of the Prophet (صلى الله عليه وسلم) that the Seal of the Saints in his community is an honored Prophet and Messenger, namely Jesus (عليه السلام). He is the most excellent member of this Muhammadan Community (الأمة المحمدية). Al-Tirmidhi al-Hakim drew attention to this in his book *The Seal of the Saints* and testified to his superiority over Abu Bakr al-Siddiq and others. For even though he is a saint (ولي) in this Muhammadan Community and religion, he is a Prophet and Messenger in essence (في نفس الأمر).\n\nOn the Day of Resurrection, he will have two gatherings (حشران): he will be gathered with the company of Prophets and Messengers under the banner of Prophethood and Messengership, and his companions will follow him, so he will be followed like the rest of the Messengers. He will also be gathered with us as a saint (ولي) in the company of the saints of this community under the banner of Muhammad (صلى الله عليه وسلم), following him, and placed ahead of all saints from the time of Adam until the last saint in the world. Thus, Allah combined for him sainthood (الولاية) and prophethood (النبوة) outwardly.\n\nThere is no Messenger among the Messengers on the Day of Resurrection who is followed by another Messenger except Muhammad (صلى الله عليه وسلم), for Jesus and Elias (عليهما السلام) will be gathered among his followers on the Day of Resurrection. Although everyone in the gathering, from Adam downwards, is under his banner (صلى الله عليه وسلم)—that is his general banner—our discussion here concerns the banner specific to his community (صلى الله عليه وسلم).\n\n### [The Seal of Specific Muhammadan Sainthood (الولاية المحمدية الخاصة)]\n\nThe Muhammadan Sainthood (الولاية المحمدية) specific to this Divine Law revealed to Muhammad (صلى الله عليه وسلم) has a specific Seal (ختم خاص) who is lower in rank than Jesus (عليه السلام) because Jesus is a Messenger. This Seal was born in our time, and I saw him and met with him, and I saw the sign of the Seal (العلامة الختمية) upon him. There is no saint (ولي) after him except that he refers back to him, just as there is no Prophet after Muhammad (صلى الله عليه وسلم) except that he refers back to him, such as Jesus, Elias, and Khidr in this community, when they descend.\n\nAfter I have clarified for you the station of Jesus (عليه السلام) when he descends, say what you wish. If you wish, say that there are two Divine Laws (شريعتين) for a single essence, and if you wish, say that there is a single Divine Law.\n\n### (Section Break) [The Hearts Enamored with the Breaths of the All-Merciful (الأنفاس الرحمانية)]\n\nAs for the hearts enamored with the Breaths (الأنفاس), since the treasuries of animal spirits (الأرواح الحيوانية) are enamored with the Breaths of the All-Merciful (الأنفاس الرحمانية) due to suitability, the Messenger of Allah (صلى الله عليه وسلم) said: \"Indeed, the Breath (نفس) of the All-Merciful (الرحمن) comes to me from the direction of Yemen.\" Know that the animal spirit (الروح الحيواني) is a breath (نفس).\n\nThe origin of these Breaths, for the hearts enamored with them, is the Breath of the All-Merciful (النفس الرحماني) that comes from the direction of Yemen for those who have been exiled from their homeland and separated from their dwelling and residence. In these Breaths is the relief of distress (تفريج الكرب) and the repulsion of calamities. The Prophet (صلى الله عليه وسلم) also said: \"Indeed, Allah has Breaths (نفحات), so expose yourselves to the Breaths of your Lord.\"\n\nThe stations (منازل) of these Breaths terminate in number at three hundred and thirty Breaths (نفسا) in each of their stations. The total number is the product of multiplying three hundred and thirty by three hundred and thirty. The result is the number of Breaths that come from The Real (الحق) through His Name, the All-Merciful (الرحمن), in the human world (العالم البشري).\n\nWhat I realize is that they have stations exceeding this amount by two hundred stations, specifically in the Presence of Comprehension (حضرة الفهوانية). Thus, if you multiply three hundred and thirty by five hundred and thirty, the result is the number of the Breaths of the All-Merciful (الأنفاس الرحمانية) in the human world. Each Breath (نفس) among them is an independent Divine Knowledge (علم إلهي) stemming from a specific Divine Theophany (تجلي إلهي) unique to these stations, which is not granted to others.\n\nWhoever smells the fragrance of these Breaths knows their measure. I have not seen any of their people who are well-known among the general populace. They are mostly found in the lands of Andalusia. I met one of them in Jerusalem and in Mecca. I asked him a question one day, and he said to me, \"Do you smell anything?\" I knew then that he was one of the people of that station. He served me for a period.\n\nI had an uncle, my father’s full brother, named Abdullah ibn Muhammad ibn al-Arabi, who possessed this station, both sensually and spiritually. We witnessed this from him before we returned to this Path, during the time of my ignorance. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the truth, and He guides to the way).",
    "ur": "(باب چوبیسواں) کونیاتی علوم (Al-Ulum al-Kawniyyah) سے حاصل ہونے والی معرفت کے بیان میں۔\n\nاور ان عجائبات کے بیان میں جو یہ علوم اپنے اندر رکھتے ہیں، اور ان لوگوں کے بیان میں جنہوں نے انہیں عالم سے حاصل کیا، اور ان کے اقطاب کے مراتب، اور دو شریعتوں کے درمیان اشتراک کے اسرار، اور وہ قلوب جو عالمِ انفاس اور انفاس سے عشق رکھتے ہیں، اور ان کی اصل، اور ان کی منازل کہاں تک منتہی ہوتی ہیں۔\n\n> میں نے اس بادشاہ پر تعجب کیا جو ہمارے ذریعے بادشاہت (ملک) کی طرف لوٹتا ہے،\n>\n> اور اس مالک پر جو اپنے مملوک کے لیے بادشاہ (ملک) بن گیا۔\n>\n> پس اگر تم ہمارے علم کے بکھرے ہوئے موتیوں سے ایک لڑی پرو رہے ہو،\n>\n> تو یہی ملک الملک (Malik al-Mulk) ہے۔\n>\n> پس ذات حق (Al-Haqq) کی ہستی (Al-Wujud) سے ایک مقدس علم حاصل کرو،\n>\n> تاکہ جو کوئی تم سے یہ علم چاہے وہ اسے لے لے۔\n>\n> اگر تم علوم میں میری طرح ہو، تو تم دیکھو گے\n>\n> کہ جو کچھ کائنات میں ہے وہ تمہاری ہی ایک نقل (نسخہ) ہے۔\n>\n> کیا عالمِ بالا میں کوئی چیز تمہارے حکم کا مقابلہ کر سکتی ہے؟\n>\n> جبکہ تمہاری تلواروں نے مخلوق میں تباہی مچا رکھی ہے۔\n>\n> اے میرے حبیب! اگر تم اس کی ہستی (Wujud) کو اور یہ کہ تم کون ہو، جان لیتے،\n>\n> تو تم ہی سردار، نشان اور بادشاہ (ملک) ہوتے۔\n>\n> اور خالقِ مخلوق تمہاری طرف اس سے دوگنا آتا،\n>\n> جتنا تم اس کی طرف آئے، اگر تم نے اسے بادشاہ (ملک) کے طور پر پہچان لیا ہوتا۔\n\n### [ملک الملک (Malik al-Mulk): اور حق (Al-Haqq) و خلق کے درمیان ہستی (Al-Wujud) کا ربط]\n\nاللہ تمہیں قوت دے، جان لو کہ اللہ تعالیٰ فرماتا ہے: \"مجھ سے دعا کرو، میں تمہاری دعا قبول کروں گا\" (ادْعُونِي أَسْتَجِبْ لَكُمْ)۔ جب تم یہ جان لو گے تو تم جان لو گے کہ اللہ ہر چیز کا رب اور اس کا مالک ہے۔ پس اللہ تعالیٰ کے سوا ہر چیز اس رب کی مربوب اور اس ملکِ حق (Al-Haqq) کی مملوک ہے۔ اور عالم کے اللہ تعالیٰ کی ملکیت ہونے کا کوئی معنی نہیں سوائے اس کے کہ وہ اس میں اپنی مرضی کے مطابق بغیر کسی رکاوٹ کے تصرف کرتا ہے، اور یہ کہ عالم اپنے آقا، جلال و عظمت والے بادشاہ کے اثر کا محل ہے۔ پس وہ مختلف حالتیں جن پر عالم قائم ہے، وہ اس میں ذات حق (Al-Haqq) کا تصرف ہے، جو اس کے ارادے کے حکم کے مطابق ہے۔\n\nپھر جب ہم نے دیکھا کہ اللہ تعالیٰ فرماتا ہے: \"تمہارے رب نے اپنے اوپر رحمت لازم کر لی ہے\" (كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ)، تو اس نے اپنے بندے کے ساتھ اپنے اوپر وجوب (لازم ہونے) میں خود کو شریک کر لیا، اگرچہ یہ وہی ہے جس نے اپنے اوپر جو کچھ لازم کیا، وہ خود ہی لازم کیا۔ پس اس کا کلام سچا ہے اور اس کا وعدہ حق ہے، جیسا کہ انسان نذر کے ذریعے خود پر ابتداءً وہ چیز لازم کر لیتا ہے جو ذات حق (Al-Haqq) نے اس پر لازم نہیں کی تھی، پھر اللہ اس پر اس نذر کو پورا کرنا واجب کر دیتا ہے جو اس نے خود پر لازم کی تھی۔ پس اس نے اسے اپنی نذر پوری کرنے کا حکم دیا۔ پھر ہم نے دیکھا کہ وہ تعالیٰ بندے کی دعا کے بعد ہی قبول کرتا ہے، جیسا کہ اس نے شریعت میں مقرر کیا، بالکل اسی طرح جیسے بندہ ذات حق (Al-Haqq) کا جواب دینے والا نہیں ہوتا جب تک کہ ذات حق (Al-Haqq) اسے اس چیز کی طرف نہ بلائے جس کی طرف وہ اسے بلا رہا ہے۔ اللہ تعالیٰ نے فرمایا: \"پس انہیں چاہیے کہ وہ میری پکار پر لبیک کہیں\" (فَلْيَسْتَجِيبُوا لِي)۔ پس بندے اور عالم کے لیے، جو اللہ سبحانہ کی ملکیت ہے، ایک الٰہی تصرف (تصریف) حاصل ہو گیا، جو کہ عالم کی حقیقت کے تقاضے کے مطابق ذاتی طلب کے ذریعے ہوتا ہے، اور ایک دوسرا تصرف جو شریعت کے وضع کرنے کے تقاضے کے مطابق ہوتا ہے۔\n\n### [اللہ پر وجوب (لازم ہونا)]\n\nجب معاملہ اس طرح ہے جیسا کہ ہم نے ذکر کیا کہ ذات حق (Al-Haqq) بندے کے حکم کا جواب دیتا ہے جب وہ اسے پکارتا ہے اور سوال کرتا ہے، جیسا کہ بندہ اللہ کے حکم کا جواب دیتا ہے جب وہ اسے حکم دیتا ہے، اور یہ اس کا قول ہے: \"اور میرے عہد کو پورا کرو، میں تمہارے عہد کو پورا کروں گا\" (وأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ)، پس اس نے اس معاملے میں شرکت کی۔ اور چونکہ ذات حق (Al-Haqq) اپنی ذات سے یہ تقاضا کرتا ہے کہ اس کے سامنے عاجزی کی جائے، خواہ اس نے اپنے بندوں کے لیے اعمال مشروع کیے ہوں یا نہ کیے ہوں، اسی طرح عالم کی ہستی (Al-Wujud) کا بقا اس بات کا تقاضا کرتا ہے کہ ذات حق (Al-Haqq) اس کی حفاظت کرے، خواہ ذات حق (Al-Haqq) نے جو کچھ مشروع کیا وہ کیا ہو یا نہ کیا ہو۔\n\nپھر جب اس نے بندے کے لیے اعمال مشروع کیے، تو جب بندہ انہیں کرتا ہے، تو اس نے اپنے لیے یہ مشروع کیا کہ وہ اس بندے کو اس کام پر جزا دے جس کا اسے مکلف بنایا گیا تھا۔ پس وہ عالی جناب اس بادشاہ (ملک) کا بادشاہ (ملک) بن گیا جو کہ عالم ہے، اس اثر کے ذریعے جو بندے کی طرف سے سوال کے وقت عطا کی صورت میں اس میں ظاہر ہوا۔ پس اس پر ایک صفت کا اطلاق ہوا جسے ملک الملک (Malik al-Mulk) سے تعبیر کیا جاتا ہے۔ پس وہ سبحانہ مالک بھی ہے اور بادشاہ (ملک) بھی ہے اس چیز کے ذریعے جس کا وہ اپنے بندوں کو حکم دیتا ہے، اور وہ سبحانہ بادشاہ (ملک) بھی ہے اس چیز کے ذریعے جس کا بندہ اسے حکم دیتا ہے، جب وہ کہتا ہے: \"اے میرے رب! مجھے بخش دے\" (رَبِّ اغْفِرْ لِي)، جیسا کہ ذات حق (Al-Haqq) نے اسے کہا: \"میری یاد کے لیے نماز قائم کر\" (أَقِمِ الصَّلاةَ لِذِكْرِي)۔ پس جو کچھ ذات حق (Al-Haqq) کی طرف سے بندے کے لیے ہو اسے حکم کہا جاتا ہے، اور جو کچھ بندے کی طرف سے ذات حق (Al-Haqq) کے لیے ہو اسے الٰہی ادب کے طور پر دعا کہا جاتا ہے، حالانکہ حقیقت میں وہ بھی حکم ہی ہے، کیونکہ حد دونوں امور کو شامل ہے۔\n\nاور میرے علم میں سب سے پہلے جس نے اس نام کو اصطلاح کے طور پر استعمال کیا وہ محمد بن علی ترمذی الحکیم ہیں، اور ہم نے یہ لفظ ان کے سوا کسی اور سے نہیں سنا، اگرچہ ممکن ہے کہ ان سے پہلے کسی اور نے یہ اصطلاح استعمال کی ہو، لیکن ہم تک نہیں پہنچی۔ تاہم، یہ معاملہ صحیح ہے۔ اور اللہ پر عقلی وجوب کا مسئلہ متکلمین (اہلِ نظر) کے درمیان اختلافی مسئلہ ہے، کچھ اس کے قائل ہیں اور کچھ نہیں۔ لیکن شرعی وجوب کا انکار وہی کرتا ہے جو اللہ کی طرف سے آئی ہوئی چیزوں پر ایمان نہیں رکھتا۔\n\n### [اضافت اور متضائفین (باہمی نسبت رکھنے والے)]\n\nجان لو کہ متضائفین میں سے ہر ایک کے لیے ایک ایسا نام پیدا ہونا ضروری ہے جو اسے اضافت (نسبت) سے حاصل ہو۔ پس جب تم زید کہتے ہو، تو وہ بلاشبہ انسان ہے، اس کے سوا کچھ اور سمجھ میں نہیں آتا۔ اور جب تم عمرو کہتے ہو، تو وہ انسان ہے، اس کے سوا کچھ اور سمجھ میں نہیں آتا۔ لیکن جب تم کہتے ہو: \"زید بن عمرو\" یا \"زید عمرو کا غلام ہے\"، تو بلاشبہ زید کے لیے بنوت (بیٹا ہونا) پیدا ہو گئی کیونکہ وہ عمرو کا بیٹا ہے، اور عمرو کے لیے ابوت (باپ ہونا) کا نام پیدا ہو گیا کیونکہ وہ زید کا باپ ہے۔ پس زید کی بنوت نے عمرو کو ابوت دی، اور عمرو کی ابوت نے زید کو بنوت دی۔ پس متضائفین میں سے ہر ایک نے اپنے ساتھی کے لیے ایک ایسا معنی پیدا کیا جس سے وہ اضافت سے پہلے متصف نہیں تھا۔\n\nاسی طرح \"زید عمرو کا غلام ہے\"۔ پس عبودیت نے یہ معنی دیا کہ زید مملوک ہے اور عمرو مالک ہے۔ پس زید کی مملوکیت نے عمرو کے لیے مالک کا نام پیدا کیا، اور عمرو کی زید پر ملکیت نے زید کے لیے مملوکیت پیدا کی۔ پس زید کے بارے میں مملوک کہا گیا اور عمرو کے بارے میں مالک کہا گیا۔ اور اضافت کے وجود میں آنے سے پہلے ان دونوں میں سے کسی کے لیے بھی ان دونوں ناموں کی معقولیت نہیں تھی۔ پس ذات حق (Al-Haqq) حق ہے اور انسان انسان ہے۔ پس جب تم کہتے ہو کہ انسان یا لوگ اللہ کے بندے ہیں، تو تم لازماً یہ بھی کہتے ہو کہ اللہ لوگوں کا بادشاہ (ملک) ہے۔ اگر تم عالم کی ہستی (Al-Wujud) کو اس کی ملکیت ہونے کے اعتبار سے ذہن سے یکسر ختم کر دو، تو عالم کے ختم ہونے سے ذات حق (Al-Haqq) کی ہستی (Al-Wujud) ختم نہیں ہو گی، لیکن ملک (بادشاہ) ہونے کے معنی کا وجود ذات حق (Al-Haqq) سے لازماً ختم ہو جائے گا۔\n\nاور چونکہ عالم کی ہستی (Al-Wujud) ذات حق (Al-Haqq) کی ہستی (Al-Wujud) سے بالفعل اور بالقوہ مربوط ہے، اس لیے اللہ تعالیٰ کے لیے ملک کا نام ازل سے تھا، اگرچہ عالم کا عین (حقیقت) خارج میں معدوم تھا، لیکن اس کی معقولیت موجود تھی جو مالک کے نام سے مربوط تھی۔ پس وہ (عالم) اللہ تعالیٰ کا مملوک ہے، وجوداً اور تقدیراً، قوت اور فعلیت کے اعتبار سے۔ اگر تم سمجھ گئے ہو تو ٹھیک، ورنہ سمجھنے کی کوشش کرو۔\n\n### [الٰہی معیت (ساتھ ہونا) اور اینیت (کہاں ہونا)]\n\nذات حق (Al-Haqq) اور عالم کے درمیان کوئی قابلِ فہم فاصلہ نہیں ہے، سوائے حقائق کے ذریعے تمیز کے۔ اللہ سبحانہ ہے اور اس کے ساتھ کوئی چیز نہیں تھی، اور وہ ہمیشہ سے ایسا ہی رہا ہے اور ہمیشہ ایسا ہی رہے گا کہ اس کے ساتھ کوئی چیز نہیں ہے۔ پس اس کی معیت (ساتھ ہونا) ہمارے ساتھ ویسا ہی ہے جیسا اس کے جلال کا حق ہے اور جیسا اس کے جلال کے لائق ہے۔ اور اگر وہ خود اپنی ذات کی طرف یہ نسبت نہ کرتا کہ وہ ہمارے ساتھ ہے، تو عقل یہ تقاضا نہ کرتی کہ اس پر معیت کا معنی مطلقاً استعمال کیا جائے۔ جیسا کہ جب ذات حق (Al-Haqq) نے اسے اپنی ذات پر مطلقاً استعمال کیا، تو سلیم عقل اس سے وہ معنی نہیں سمجھتی جو عالم کے ایک دوسرے کے ساتھ ہونے سے سمجھا جاتا ہے، کیونکہ \"اس کی مثال کوئی چیز نہیں ہے\" (لَيْسَ كَمِثْلِهِ شَيْءٌ)۔\n\nاللہ تعالیٰ نے فرمایا: \"اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو\" (وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ)۔ اور اللہ تعالیٰ نے موسیٰ اور ہارون سے فرمایا: \"میں تمہارے ساتھ ہوں، سنتا اور دیکھتا ہوں\" (إِنَّنِي مَعَكُما أَسْمَعُ وأَرى‏)۔ پس ہم کہتے ہیں کہ ذات حق (Al-Haqq) ہمارے ساتھ ہے، اسی حد پر جو اس نے کہی اور اسی معنی میں جو اس نے ارادہ کیا، اور ہم یہ نہیں کہتے کہ ہم ذات حق (Al-Haqq) کے ساتھ ہیں، کیونکہ یہ وارد نہیں ہوا اور عقل بھی اس کی اجازت نہیں دیتی۔ پس ہمارے پاس کوئی عقلی یا شرعی وجہ نہیں ہے جس سے یہ کہا جا سکے کہ ہم ذات حق (Al-Haqq) کے ساتھ ہیں۔\n\nاور جہاں تک ان مسلمانوں کا تعلق ہے جو اس پر اینیت (کہاں ہونا) کے اطلاق کی نفی کرتے ہیں، تو وہ ناقص الایمان ہیں۔ کیونکہ عقل اس سے اینیت کی معقولیت کی نفی کرتی ہے، لیکن سنت میں ثابت شدہ شریعت (نہ کہ کتاب میں) نے اللہ پر لفظِ اینیت کے اطلاق کو ثابت کیا ہے۔ لہٰذا اس سے تجاوز نہیں کیا جائے گا اور نہ ہی اس پر قیاس کیا جائے گا، بلکہ اسے صرف اسی جگہ استعمال کیا جائے گا جہاں شارع نے اسے استعمال کیا ہے۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے اس سیاہ فام لونڈی سے، جسے اس کے آقا نے مارا تھا، پوچھا: \"اللہ کہاں ہے؟\" (أين الله) تو اس نے آسمان کی طرف اشارہ کیا، تو آپ صلی اللہ علیہ وسلم نے اس کے اشارے کو قبول کیا اور فرمایا: \"اسے آزاد کر دو، کیونکہ یہ مومنہ ہے۔\"\n\nپس اینیت کے ذریعے سوال کرنے والے لوگوں میں اللہ تعالیٰ کو سب سے زیادہ جاننے والے رسول اللہ صلی اللہ علیہ وسلم ہیں۔ اور بعض علماء الرسوم (ظاہری علوم کے علماء) نے اس کے آسمان کی طرف اشارے اور نبی صلی اللہ علیہ وسلم کے اس کے قبول کرنے کی تاویل یہ کی کہ زمین پر جو معبود پوجے جاتے تھے (ان کے مقابلے میں یہ اشارہ تھا)، اور یہ تاویل کرنے والا معاملے سے جاہل اور ناواقف ہے۔ اور ہم جانتے ہیں کہ عرب آسمان میں ایک ستارے کی پوجا کرتے تھے جسے شعریٰ کہا جاتا تھا، جسے ان کے لیے ابو کبشہ نے رائج کیا تھا، اور وہ اس کے بارے میں یہ عقیدہ رکھتے تھے کہ وہ رب الارباب ہے۔ میں ان کی اس سے مناجات پر اسی طرح مطلع ہوا ہوں۔ اسی لیے اللہ تعالیٰ نے فرمایا: \"اور یہ کہ وہی شعریٰ کا رب ہے\" (وأَنَّهُ هُوَ رَبُّ الشِّعْرى‏)۔ اگر آسمان میں کسی ستارے کی عبادت نہ کی جاتی تو اس تاویل کرنے والے کے لیے یہ تاویل جائز ہو سکتی تھی۔ اور یہ ابو کبشہ، جس نے شعریٰ کی عبادت کو رائج کیا تھا، رسول اللہ صلی اللہ علیہ وسلم کے والدہ کی طرف سے اجداد میں سے تھا۔ اسی لیے عرب رسول اللہ صلی اللہ علیہ وسلم کو اس کی طرف منسوب کرتے تھے اور کہتے تھے: \"ابن ابی کبشہ نے کیا کیا، جہاں اس نے ایک معبود کی عبادت کو رائج کیا، جیسا کہ اس کے دادا نے شعریٰ کی عبادت کو رائج کیا تھا؟\"\n\n### [مقام ملک الملک (Malik al-Mulk) کے اقطاب]\n\nاس مقام کے اقطاب میں سے، جو ہم سے پہلے تھے، محمد بن علی ترمذی الحکیم ہیں، اور ہمارے شیوخ میں سے ابو مدین رحمۃ اللہ علیہ ہیں۔ وہ عالمِ علوی میں ابو النجا کے نام سے جانے جاتے تھے، اور روحانیون انہیں اسی نام سے پکارتے تھے۔ وہ رضی اللہ عنہ کہا کرتے تھے کہ قرآن میں میری سورت \"تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ\" ہے۔ اور اسی وجہ سے ہم ان کے بارے میں کہتے تھے کہ وہ دو اماموں میں سے ایک ہیں، کیونکہ یہ امام کا مقام ہے۔\n\nپھر ہم کہتے ہیں کہ چونکہ ذات حق (Al-Haqq) اپنے مضطر بندے کو اس چیز میں جواب دیتا ہے جس کے ذریعے وہ اسے پکارتا ہے اور اس سے سوال کرتا ہے، اس لیے وہ متصرف کی مانند ہو گیا۔ اسی لیے ابو مدین اپنے قول میں اشارہ کرتے تھے اور اس میں ملک الملک (Malik al-Mulk) کہتے تھے۔ اور اس اضافت کی صحت اس لیے ہے کہ بندہ ہر سانس میں اس بات کا تحقق (حصول) کرے کہ وہ اللہ تعالیٰ کا مملوک ہے، بغیر اس کے کہ اس حال میں کوئی متضاد دعویٰ شامل ہو۔ پس جب وہ اس مرتبے پر ہو، تب ہی اس پر یہ صادق آتا ہے کہ وہ اس کے نزدیک بادشاہ (ملک) ہے۔ لیکن اگر اس میں دعوے کی کوئی بو بھی شامل ہو جائے، یعنی وہ اپنے لیے ایسی بادشاہت (ملک) کا دعویٰ کرے جو اس امر میں اللہ کے اسے مالک بنانے کی موجودگی سے خالی ہو جسے اس نے اپنا بادشاہ (ملک) نام دیا ہے، تو وہ اس مقام پر نہیں ہو گا اور نہ ہی اس کے لیے یہ کہنا صحیح ہو گا کہ ذات حق (Al-Haqq) ملک الملک (Malik al-Mulk) ہے۔ اگرچہ وہ نفس الامر میں ایسا ہی ہے، لیکن اس نے اپنے جہل کے دعوے سے خود کو اس سے خارج کر دیا کہ وہ اللہ کا مملوک ہے اور کسی معاملے میں اس کی غفلت ہے۔ پس اس مقام کے صاحب کو ایک عظیم میزان کی ضرورت ہے جو اس کے ہاتھ اور اس کی آنکھوں کے سامنے سے کبھی دور نہ ہو۔\n\n(فصل) اور دو شریعتوں کے درمیان اشتراک کے اسرار کے بیان میں۔\n\nجیسے اللہ تعالیٰ کا فرمان: \"میری یاد کے لیے نماز قائم کر\" (أَقِمِ الصَّلاةَ لِذِكْرِي)۔ اور یہ ختم الاولیاء کا مقام ہے، اور آج کل اس کے رجال میں خضر اور الیاس ہیں۔ اور یہ اس بات کی تصدیق ہے کہ دوسرا شخص اسی پہلو سے اس چیز کو ثابت کرتا ہے جسے پہلے نے ثابت کیا تھا، اگرچہ زمانہ مختلف ہو، تاکہ متقدم اور متاخر کا صحیح ہونا ثابت ہو سکے۔ اور کبھی جگہ اور حال بھی تبدیل نہیں ہوتا، تو دوسرے کے لیے تکلیف کا خطاب بعینہٖ وہی ہوتا ہے جو پہلے کے لیے ہوا تھا۔\n\nاور چونکہ وہ پہلو جو ان دونوں کو جمع کرتا ہے، زمانے سے مقید نہیں ہے، اور اس سے اخذ کرنا بھی زمانے سے مقید نہیں ہے، اس لیے دو اشخاص کے لیے شریعت میں اشتراک جائز ہے، سوائے اس کے کہ عبارت کا زمانہ اور زبان مختلف ہو، الا یہ کہ وہ ایک ہی وقت میں ایک ہی زبان میں بات کریں، جیسے موسیٰ اور ہارون، جب ان دونوں سے کہا گیا: \"فرعون کے پاس جاؤ، بے شک وہ سرکش ہو گیا ہے\" (اذْهَبا إِلى‏ فِرْعَوْنَ إِنَّهُ طَغى‏)۔ اس سب کے باوجود، ان دونوں سے کہا گیا: \"پس تم دونوں اس سے نرم بات کہنا\" (فَقُولا لَهُ قَوْلًا لَيِّناً)۔ اور اس نے \"قولاً\" میں نکرہ (غیر معین) کا استعمال کیا۔ خاص طور پر جب موسیٰ کہتے ہیں کہ ہارون \"مجھ سے زیادہ فصیح زبان والا ہے\" (هُوَ أَفْصَحُ مِنِّي لِساناً)۔ پس ممکن ہے کہ وہ ایک ہی مجلس میں عبارت میں اختلاف کریں، لیکن ان دونوں کو ایک ہی مقام نے جمع کیا، اور وہ ایک ہی زمانے میں، ایک ہی شخص کی طرف، ایک ہی رسالت کے ساتھ بھیجا جانا ہے۔\n\n### [الٰہی وسعت (Al-Tawassu' al-Ilahi): یا خلقِ جدید کا تصور]\n\nاگرچہ ہمارے اصحاب اور شیوخ کی ایک جماعت نے، جیسے ابو طالب مکی اور ان کے ہم خیال لوگوں نے، اس طرح کے وجود کو منع کیا ہے، لیکن ہم اسی طرف جاتے ہیں اور میں اسی کا قائل ہوں، اور ہمارے نزدیک یہی صحیح ہے، کیونکہ اللہ تعالیٰ الٰہی وسعت (Al-Tawassu' al-Ilahi) کی وجہ سے ایک ہی شخص پر ظہور الٰہی (Al-Tajalli) کو نہیں دہراتا اور نہ ہی اس میں دو اشخاص کو شریک کرتا ہے۔ بلکہ مثالیں اور مشابہتیں دیکھنے والے اور سننے والے کو وہم میں ڈالتی ہیں، اس مشابہت کی وجہ سے جس کو الگ کرنا مشکل ہوتا ہے، سوائے اہل کشف (Al-Kashf) کے اور متکلمین میں سے ان لوگوں کے جو کہتے ہیں کہ عرض (صفت) دو زمانوں تک باقی نہیں رہتی۔\n\nاور الٰہی وسعت (Al-Tawassu' al-Ilahi) میں سے یہ ہے کہ اللہ نے \"ہر چیز کو اس کی خلقت عطا کی\" (أَعْطى‏ كُلَّ شَيْءٍ خَلْقَهُ) اور عالم میں ہر چیز کو ایک ایسے امر سے ممتاز کیا جو اسے دوسروں سے ممتاز کرتا ہے، اور وہ ہر چیز کی احدیت ہے۔ پس دو چیزیں ایک ہی مزاج میں جمع نہیں ہوئیں۔ ابو العتاہیہ نے کہا:\n\n> اور ہر چیز میں اس کی ایک نشانی ہے،\n>\n> جو اس بات پر دلالت کرتی ہے کہ وہ ایک ہے۔\n\nاور یہ ہر چیز کی احدیت کے سوا کچھ نہیں ہے۔ پس دو چیزیں کبھی بھی اس چیز میں جمع نہیں ہوئیں جس سے امتیاز واقع ہوتا ہے، اور اگر ان میں اشتراک واقع ہوتا تو وہ ممتاز نہ ہوتیں، حالانکہ وہ عقلی اور کشفی (Al-Kashf) طور پر ممتاز ہیں۔ اور اسی منزل سے اس باب میں تم بڑے کا چھوٹے پر اور وسیع کا تنگ پر وارد ہونا جانتے ہو، بغیر اس کے کہ وسیع تنگ ہو جائے اور تنگ وسیع ہو جائے، یعنی کوئی چیز اپنی حالت سے تبدیل نہیں ہوتی۔ لیکن اس طریقے پر نہیں جس کی طرف متکلمین اور حکماء میں سے اہل نظر جاتے ہیں، کیونکہ وہ ان دونوں کے حد اور حقیقت میں جمع ہونے کے قائل ہیں، نہ کہ جسمانیت میں۔ کیونکہ کسی چیز کا بڑا ہونا یا چھوٹا ہونا ان دونوں کو جمع کرنے والی حقیقت پر اثر انداز نہیں ہوتا۔\n\nاور اسی باب سے ابو سعید الخراز نے بھی کہا: \"اللہ کو نہیں پہچانا گیا مگر اس کے دو متضاد چیزوں کو جمع کرنے سے۔\" پھر انہوں نے یہ آیت تلاوت کی: \"وہی اول ہے اور آخر ہے، اور ظاہر ہے اور باطن ہے\" (هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ)۔ وہ ایک ہی پہلو سے مراد لیتے ہیں، نہ کہ مختلف نسبتوں سے، جیسا کہ علماء الرسوم (ظاہری علوم کے علماء) میں سے اہل نظر دیکھتے ہیں۔\n\n### [عیسیٰ (علیہ السلام) ولایتِ عامہ کے خاتم]\n\nجان لو کہ عیسیٰ علیہ السلام کا نزول ضروری ہے، اور یہ بھی ضروری ہے کہ وہ ہم میں شریعتِ محمدیہ صلی اللہ علیہ وسلم کے مطابق حکم کریں گے، جس کی وحی اللہ ان کی طرف نبی ہونے کی حیثیت سے کرے گا۔ کیونکہ نبی اپنے بھیجنے والے کے علاوہ کسی اور سے شریعت نہیں لیتا۔ پس فرشتہ ان کے پاس محمد صلی اللہ علیہ وسلم کی لائی ہوئی شریعت کی خبر لے کر آئے گا، اور کبھی اللہ انہیں الہام بھی کرے گا۔ پس وہ چیزوں میں تحلیل و تحریم کا حکم صرف اسی چیز سے کریں گے جس کا حکم رسول اللہ صلی اللہ علیہ وسلم اگر موجود ہوتے تو کرتے۔\n\nاور ان کے نزول سے مجتہدین کا اجتہاد ختم ہو جائے گا۔ اور وہ ہم میں اپنی اس شریعت کے مطابق حکم نہیں کریں گے جو ان کی رسالت اور حکومت کے زمانے میں تھی، اگرچہ وہ اسے الٰہی وحی کے ذریعے جانتے ہیں کہ وہ رسول اور نبی ہیں۔ اور جہاں تک شریعتِ محمدیہ صلی اللہ علیہ وسلم کا تعلق ہے، وہ اس میں آپ کے تابع ہیں۔ اور ممکن ہے کہ انہیں روحِ محمد صلی اللہ علیہ وسلم پر کشف (Al-Kashf) کے ذریعے ایسا اطلاع حاصل ہو کہ وہ آپ سے وہ چیزیں اخذ کریں جن کے ذریعے اللہ نے انہیں آپ کی امت میں حکم کرنے کا حکم دیا ہے۔ پس عیسیٰ علیہ السلام اس پہلو سے صاحب اور منبع ہوں گے، اور وہ علیہ السلام اس پہلو سے خاتم الاولیاء ہیں۔ پس نبی صلی اللہ علیہ وسلم کے شرف میں سے یہ تھا کہ ان کی امت میں اولیاء کا اختتام ایک مکرم نبی و رسول، یعنی عیسیٰ علیہ السلام پر ہوا۔\n\nاور وہ اس امتِ محمدیہ میں سب سے افضل ہیں۔ اور ترمذی الحکیم نے اپنی کتاب \"ختم الاولیاء\" میں اس پر تنبیہ کی ہے اور ان کے لیے ابوبکر صدیق اور دیگر پر فضیلت کی گواہی دی ہے۔ کیونکہ اگرچہ وہ اس امت اور ملتِ محمدیہ میں ولی ہیں، لیکن وہ نفس الامر میں نبی اور رسول ہیں۔ پس قیامت کے دن ان کے دو حشر ہوں گے: ایک حشر انبیاء اور رسولوں کی جماعت میں نبوت اور رسالت کے جھنڈے تلے ہو گا، اور ان کے اصحاب ان کے تابع ہوں گے، پس وہ دیگر رسولوں کی طرح متبوع (جس کی پیروی کی جائے) ہوں گے۔ اور وہ ہمارے ساتھ بھی حشر کیے جائیں گے، اس امت کے اولیاء کی جماعت میں محمد صلی اللہ علیہ وسلم کے جھنڈے تلے، آپ کے تابع ہوں گے، اور آدم کے زمانے سے لے کر عالم میں ہونے والے آخری ولی تک تمام اولیاء پر مقدم ہوں گے۔ پس اللہ نے ان کے لیے ولایت اور نبوت کو ظاہراً جمع کر دیا۔ اور قیامت کے دن رسولوں میں سے کوئی ایسا نہیں ہو گا جس کی پیروی کوئی رسول کرے، سوائے محمد صلی اللہ علیہ وسلم کے، کیونکہ قیامت کے دن ان کے پیروکاروں میں عیسیٰ اور الیاس علیہما السلام حشر کیے جائیں گے۔ اگرچہ میدانِ حشر میں آدم سے لے کر ان کے بعد تک ہر کوئی آپ صلی اللہ علیہ وسلم کے جھنڈے تلے ہو گا، لیکن وہ آپ کا عام جھنڈا ہے۔ اور ہماری گفتگو آپ صلی اللہ علیہ وسلم کی امت کے خاص جھنڈے کے بارے میں ہے۔\n\n### [ولایتِ محمدیہ خاصہ کا خاتم]\n\nاور ولایتِ محمدیہ (Al-Wilayah al-Muhammadiyyah) کے لیے، جو محمد صلی اللہ علیہ وسلم پر نازل ہونے والی اس شریعت کے ساتھ مخصوص ہے، ایک خاص خاتم ہے، جو مرتبے میں عیسیٰ علیہ السلام سے کم ہے کیونکہ وہ رسول ہیں۔ اور وہ ہمارے زمانے میں پیدا ہوئے، اور میں نے انہیں دیکھا بھی ہے اور ان سے ملاقات بھی کی ہے، اور میں نے ان میں ختمیت کی علامت دیکھی ہے۔ پس ان کے بعد کوئی ولی نہیں ہو گا مگر وہ ان کی طرف رجوع کرنے والا ہو گا۔ جیسا کہ محمد صلی اللہ علیہ وسلم کے بعد کوئی نبی نہیں ہے مگر وہ آپ کی طرف رجوع کرنے والا ہے، جیسے عیسیٰ جب نازل ہوں گے۔ پس اس خاتم کے بعد قیامت تک ہونے والے ہر ولی کی نسبت وہی ہے جو محمد صلی اللہ علیہ وسلم کے بعد نبوت میں ہر نبی کی نسبت ہے، جیسے اس امت میں الیاس، عیسیٰ اور خضر۔ اور جب میں نے تمہیں عیسیٰ علیہ السلام کے نزول کے وقت کے مقام کو واضح کر دیا ہے، تو جو چاہو کہو۔ اگر چاہو تو کہو کہ ایک ہی عین (حقیقت) کے لیے دو شریعتیں ہیں، اور اگر چاہو تو کہو کہ ایک ہی شریعت ہے۔\n\n### (فصل) [رحمانی انفاس (Al-Anfas al-Rahmaniyyah) سے عشق رکھنے والے قلوب]\n\nاور جہاں تک انفاس (سانسوں) سے عشق رکھنے والے قلوب کا تعلق ہے، تو چونکہ حیوانی ارواح کے خزانوں نے مناسبت کی وجہ سے رحمانی انفاس (Al-Anfas al-Rahmaniyyah) سے عشق کیا، اس لیے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"بے شک رحمن کی سانس (نفس الرحمن) مجھے یمن کی طرف سے آتی ہے۔\" خبردار! حیوانی روح ایک سانس (نفس) ہے، اور ان انفاس کی اصل ان قلوب کے نزدیک ہے جو رحمانی سانس (نفس الرحمن) سے عشق رکھتے ہیں، جو یمن کی طرف سے آتی ہے، اس شخص کے لیے جسے اس کے وطن سے نکال دیا گیا ہو اور اس کے اور اس کے ٹھکانے اور سکون کے درمیان رکاوٹ ڈال دی گئی ہو۔ پس ان میں غموں کا ازالہ اور مصیبتوں کا دفعیہ ہے۔ اور آپ صلی اللہ علیہ وسلم نے فرمایا: \"بے شک اللہ کی طرف سے نفحات (لطیف جھونکے) آتے ہیں، پس اپنے رب کے نفحات کی طرف متوجہ ہو جاؤ۔\"\n\nاور ان انفاس کی منازل تعداد میں تین سو تیس (330) سانسوں تک منتہی ہوتی ہیں، ان کی ہر منزل میں، جن کا مجموعہ تین سو تیس کو تین سو تیس سے ضرب دینے سے حاصل ہوتا ہے۔ پس جو حاصل ہو، وہ ان انفاس کی تعداد ہے جو ذات حق (Al-Haqq) کی طرف سے اس کے نام الرحمن سے عالمِ بشری میں ہوتی ہیں۔ اور جس کا میں تحقق (حصول) کرتا ہوں وہ یہ ہے کہ ان کی منازل اس مقدار سے دو سو (200) منزلیں زیادہ ہیں، خاص طور پر حضرۃ الفہوانیہ میں۔ پس جب تم تین سو تیس کو پانچ سو تیس سے ضرب دو گے، تو ضرب کے بعد جو حاصل ہو گا، وہ عالمِ انسانی میں رحمانی انفاس (Al-Anfas al-Rahmaniyyah) کی تعداد ہے۔ ان میں سے ہر سانس ایک مستقل الٰہی علم ہے جو ان منازل کے لیے ایک خاص ظہور الٰہی (Al-Tajalli) سے حاصل ہوتا ہے جو کسی اور کے لیے نہیں ہوتا۔ پس جس نے ان انفاس کی خوشبو سونگھی، اس نے ان کی مقدار جان لی۔\n\nاور میں نے ان اہل میں سے کسی کو نہیں دیکھا جو لوگوں میں معروف ہو، اور وہ زیادہ تر اندلس کے علاقوں سے ہوتے ہیں۔ اور میں ان میں سے ایک سے بیت المقدس اور مکہ میں ملا۔ ایک دن میں نے ان سے ایک مسئلہ پوچھا تو انہوں نے مجھ سے کہا: \"کیا تم کچھ سونگھتے ہو؟\" تو میں جان گیا کہ وہ اس مقام کے اہل میں سے ہیں، اور انہوں نے ایک مدت تک میری خدمت کی۔ اور میرے والد کے سگے بھائی، میرے چچا تھے، جن کا نام عبداللہ بن محمد بن العربی تھا، انہیں یہ مقام حسی اور معنوی طور پر حاصل تھا۔ ہم نے اس کا مشاہدہ ان سے اس طریق (تصوف) کی طرف رجوع کرنے سے پہلے، اپنی جاہلیت کے زمانے میں کیا تھا۔ اور \"اللہ حق کہتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے\" (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب بیست و چهارم: در معرفتی که از علوم کونی (جهانی) حاصل شده است\n\nو آنچه از عجایب در بر دارد، و کسانی از عالَم که آن را کسب کرده‌اند، و مراتب اقطاب (قطب‌ها)ی ایشان، و اسرار اشتراک میان دو شریعت، و قلب‌هایی که عاشق عالم انفاس (نفس‌ها) و خود انفاس هستند، و اصل آن، و اینکه منازل آن به کجا ختم می‌شود.\n\n> شگفتم از پادشاهی که به واسطه ما پادشاه می‌شود *** و از مالکی که برای مملوک خود پادشاه گشته است.\n\n> پس اوست ملک الملک (پادشاه پادشاهی)، اگر از مرواریدهای پراکنده علم ما رشته‌ای ببافی.\n\n> پس از هستی (الوجود) حق (الحق) علمی مقدس بگیر *** تا هر که آن علم را بخواهد، از تو بگیرد.\n\n> اگر در علوم مانند من باشی، خواهی دید *** که آنچه در هستی اوست، نسخه‌ای از توست.\n\n> آیا در عوالم بالا چیزی هست که در برابر امر شما مقاومت کند؟ *** در حالی که شمشیرهای شما در میان خلق، کشتار کرده است.\n\n> ای حبیب من، اگر هستی (وجود) او و اینکه تو کیستی را می‌دانستی *** تو خود سرور، نشانه و پادشاه بودی.\n\n> و خدای خلق دو برابر آنچه تو به سوی او آمدی، به سوی تو می‌آمد *** اگر او را به عنوان پادشاه (ملک) محقق می‌ساختی.\n\n### پادشاه پادشاهی (ملک الملک): و پیوند هستی‌شناختی (الوجودية) میان حق (الحق) و خلق\n\nبدان، خداوند تو را تأیید کند، که خداوند می‌فرماید: ادْعُونِي أَسْتَجِبْ لَكُمْ (مرا بخوانید تا شما را اجابت کنم). وقتی این را دانستی، دانستی که خداوند پروردگار و مالک هر چیزی است. پس هر آنچه غیر از خدای تعالی است، پرورده این رب و مملوک این ملک (پادشاه) است، یعنی حق (الحق) سبحانه. و معنای اینکه عالم ملک خدای تعالی است، جز تصرف او در آن بر اساس آنچه می‌خواهد، بدون هیچ محدودیتی، نیست؛ و اینکه عالم محل تأثیرگذاری ملک (پادشاه) و سرور خود جلّ علاه است. پس تنوع حالاتی که عالم بر آن است، تصرف حق (الحق) در آن بر اساس حکمی است که اراده می‌کند.\n\nسپس، چون دیدیم خدای تعالی می‌فرماید: كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ (پروردگارتان رحمت را بر خود واجب کرده است)، خود را با بنده در وجوب بر خویش شریک ساخت، هرچند او خود کسی است که آنچه را واجب کرده، بر خود واجب نموده است. پس کلام او صدق و وعده‌اش حق است، همان‌گونه که انسان با نذر، چیزی را بر خود واجب می‌کند که حق (الحق) آن را بر او واجب نکرده بود، پس خداوند وفای به نذر را که بر خود واجب کرده، بر او واجب می‌سازد. پس او را به وفای به نذرش امر می‌کند.\n\nسپس دیدیم که خدای تعالی اجابت نمی‌کند مگر پس از دعای بنده، همان‌گونه که تشریع کرده است. همان‌گونه که بنده نیز اجابت‌کننده حق (الحق) نیست مگر آنکه حق او را به آنچه می‌خواند، دعوت کند. خدای تعالی فرمود: فَلْيَسْتَجِيبُوا لِي (پس باید مرا اجابت کنند). پس برای بنده و عالمی که ملک خدای سبحان است، تصرفی الهی در جانب احمی (محفوظ) حاصل می‌شود، به مقتضای حقیقت عالم از طریق طلب ذاتی، و تصرفی دیگر به مقتضای وضع شریعت.\n\n### وجوب بر خداوند\n\nچون امر بر همان‌گونه بود که ذکر کردیم، مبنی بر اینکه حق (الحق) امر بنده را اجابت می‌کند اگر او دعا کند و بخواهد، همان‌گونه که بنده امر خدا را اجابت می‌کند اگر او امر کند، و این همان قول اوست: وأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ (به عهد من وفا کنید تا به عهد شما وفا کنم). پس در این قضیه شراکت ایجاد شد.\n\nو چون حق (الحق) به ذات خود اقتضا می‌کند که برای او تذلل شود، چه برای بندگانش اعمالی را تشریع کند یا نکند؛ همچنین بقای هستی (الوجود) عین او اقتضا می‌کند که حق (الحق) او را حفظ کند، چه حق (الحق) آنچه را تشریع کرده، تشریع کند یا نکند.\n\nسپس، چون برای بنده اعمالی را تشریع کرد که اگر آن‌ها را انجام دهد، برای خود تشریع کرد که این بنده را بر انجام آنچه مکلف شده، جزا دهد. پس جناب عالی (خداوند) ملک (پادشاه) این ملک (مملوک) شد که همان عالم است، به واسطه اثری که از بنده در آن ظاهر شد، یعنی عطا هنگام سؤال. پس صفت «ملک الملک (پادشاه پادشاهی)» بر او اطلاق شد.\n\nپس او سبحانه هم مالک است و هم ملک (پادشاه)، به واسطه آنچه به بندگانش امر می‌کند؛ و هم سبحانه ملک (پادشاه) است به واسطه آنچه بنده به او امر می‌کند، آنجا که می‌گوید: رَبِّ اغْفِرْ لِي (پروردگارا مرا ببخش)، همان‌گونه که حق (الحق) به او فرمود: أَقِمِ الصَّلاةَ لِذِكْرِي (نماز را برای یاد من برپا دار).\n\nآنچه از جانب حق (الحق) برای بنده است، از روی ادب الهی «امر» نامیده می‌شود، و آنچه از جانب بنده برای حق (الحق) است، «دعا» نامیده می‌شود، در حالی که در حقیقت، هر دو امر هستند؛ زیرا حد (تعریف) شامل هر دو امر می‌شود. اولین کسی که این نام را در علم من اصطلاح کرد، محمد بن علی ترمذی حکیم بود، و ما این لفظ را از هیچ‌کس جز او نشنیده‌ایم، هرچند شاید دیگری پیش از او این اصطلاح را به کار برده باشد، اما به ما نرسیده است.\n\nاما این امر صحیح است. مسئله وجوب بر خداوند از نظر عقلی، مسئله‌ای اختلافی میان اهل نظر از متکلمین است؛ برخی قائل به آن هستند و برخی نیستند. اما وجوب شرعی را انکار نمی‌کند مگر کسی که به آنچه از نزد خدا آمده، ایمان ندارد.\n\n### اضافه و متضایفان (دو امر متقابل)\n\nبدان که برای هر یک از متضایفان (دو امر متقابل)، ناگزیر نامی حادث می‌شود که اضافه (نسبت) آن را اقتضا می‌کند. وقتی می‌گویی «زید»، او بدون شک انسان است و جز این از او فهمیده نمی‌شود. وقتی می‌گویی «عمرو»، او انسان است و جز این از او فهمیده نمی‌شود.\n\nاما وقتی می‌گویی «زید پسر عمرو» یا «زید بنده عمرو»، بدون شک برای زید نام «فرزندی» حادث شده است، چون پسر عمرو است؛ و برای عمرو نام «پدری» حادث شده است، چون پدر زید است. پس فرزندی زید، پدری را به عمرو داده است، و پدری عمرو، فرزندی را به زید داده است. پس هر یک از متضایفان، برای دیگری معنایی را ایجاد کرده که پیش از این اضافه، به آن وصف نمی‌شد.\n\nهمچنین «زید بنده عمرو»؛ بندگی باعث شده که زید مملوک باشد و عمرو مالک. پس مملوکیت زید، نام «مالک» را برای عمرو ایجاد کرده است، و مالکیت عمرو برای زید، مملوکیت زید را ایجاد کرده است. پس در مورد زید گفته شد «مملوک» و در مورد عمرو گفته شد «مالک»، در حالی که هیچ‌کدام از این دو، پیش از وجود اضافه، معقولیت این دو اسم را نداشتند.\n\nحق (الحق) حق است و انسان انسان است. اگر بگویی «انسان» یا «مردم» بندگان خدا هستند، ناگزیر می‌گویی که خداوند مالک مردم است. اگر فرض کنی که وجود عالم به طور کلی از ذهن برداشته شود، از آن جهت که مملوک است، وجود حق (الحق) به دلیل برداشته شدن عالم، برداشته نمی‌شود، اما وجود معنای «ملک» (مالکیت) از حق (الحق) ضرورتاً برداشته می‌شود.\n\nو چون وجود عالم به وجود حق (الحق) مرتبط است، هم بالفعل و هم بالقوه، از این رو نام «ملک» (مالک) برای خدای تعالی از ازل بوده است، هرچند عین عالم در خارج معدوم بوده است، اما معقولیت آن موجود و مرتبط با اسم «مالک» است. پس عالم مملوک خدای تعالی است، هم وجوداً و هم تقدیراً، هم بالقوه و هم بالفعل. اگر فهمیدی، چه بهتر، وگرنه سعی کن بفهمی.\n\n### معیت (همراهی) و أینیت (کجایی) الهی\n\nمیان حق (الحق) و عالم هیچ فاصله‌ای که عقلاً قابل درک باشد، وجود ندارد، مگر تمایز به حقایق. خداوند بود و هیچ چیز با او نبود، سبحانه، و پیوسته چنین بوده و پیوسته چنین خواهد بود که هیچ چیز با او نیست. معیت (همراهی) او با ما، آن‌گونه است که شایسته جلال اوست و آن‌گونه که سزاوار جلال اوست. اگر او خود را به «معیت» با ما نسبت نمی‌داد، عقل اقتضا نمی‌کرد که معنای معیت بر او اطلاق شود.\n\nهمان‌گونه که عقل سلیم، هنگامی که حق (الحق) آن را بر خود اطلاق کرد، از آن چیزی را نمی‌فهمد که از معیت عالم با یکدیگر می‌فهمد؛ زیرا لَيْسَ كَمِثْلِهِ شَيْءٌ (هیچ چیز مانند او نیست). خدای تعالی فرمود: وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ (و او با شماست هر کجا که باشید) و فرمود: إِنَّنِي مَعَكُما أَسْمَعُ وأَرى‏ (من با شما هستم، می‌شنوم و می‌بینم) خطاب به موسی و هارون.\n\nپس می‌گوییم: حق (الحق) با ماست، بر همان حدی که فرموده و به همان معنایی که اراده کرده است. اما نمی‌گوییم «ما با حق هستیم»، زیرا این وارد نشده و عقل نیز آن را اقتضا نمی‌کند. پس ما هیچ وجه عقلی یا شرعی نداریم که بتوانیم بر اساس آن اطلاق کنیم که «ما با حق هستیم».\n\nاما کسی از اهل اسلام که اطلاق «أینیت» (کجایی) را از او نفی کند، ایمانش ناقص است؛ زیرا عقل، معقولیت أینیت را از او نفی می‌کند، اما شرع ثابت در سنت (نه در کتاب)، اطلاق لفظ أینیت را بر خداوند اثبات کرده است. پس نباید از آن فراتر رفت و بر آن قیاس کرد، بلکه باید در همان موضعی که شارع (پیامبر) آن را اطلاق کرده، به کار برد.\n\nرسول خدا (صلی الله علیه و سلم) به کنیز سیاهی که اربابش او را زده بود، فرمود: أين الله (خدا کجاست؟) او به آسمان اشاره کرد. پیامبر اشاره او را پذیرفت و فرمود: أعتقها فإنها مؤمنة (آزادش کنید، زیرا او مؤمن است).\n\nپس سؤال‌کننده با «أینیت»، داناترین مردم به خدای تعالی است، و او رسول خدا (صلی الله علیه و سلم) است. برخی از علمای رسوم (ظاهرگرا) اشاره آن کنیز به آسمان و پذیرش پیامبر (صلی الله علیه و سلم) را تأویل کرده‌اند به اینکه چون بت‌هایی که در زمین پرستیده می‌شدند، این‌گونه بودند. این تأویل جاهلی است که به امر آگاه نیست.\n\nما می‌دانیم که عرب‌ها ستاره‌ای در آسمان به نام «شِعری» را می‌پرستیدند که ابوکبشه آن را برایشان سنت کرده بود و اعتقاد داشتند که آن ربّ الأرباب است. من بر مناجات‌های آن‌ها با آن ستاره وقوف یافته‌ام. به همین دلیل خدای تعالی فرمود: وأَنَّهُ هُوَ رَبُّ الشِّعْرى‏ (و اوست پروردگار ستاره شِعری). اگر ستاره‌ای در آسمان پرستیده نمی‌شد، این تأویل برای این تأویل‌کننده جایز بود.\n\nاین ابوکبشه که پرستش شِعری را سنت کرده بود، از اجداد مادری رسول خدا (صلی الله علیه و سلم) بود. به همین دلیل عرب‌ها رسول خدا (صلی الله علیه و سلم) را به او نسبت می‌دادند و می‌گفتند: «پسر ابوکبشه چه کرد؟» زیرا او پرستش خدای واحد را ایجاد کرد، همان‌گونه که جدش پرستش شِعری را ایجاد کرده بود.\n\n### اقطاب (قطب‌های) مقام ملک الملک (پادشاه پادشاهی)\n\nاز اقطاب (قطب‌های) این مقام در میان پیشینیان ما، محمد بن علی ترمذی حکیم است، و از شیوخ ما، ابومدین (رحمه الله) بود که در عالم علوی به «ابوالنجا» معروف بود و روحانیون او را به این نام می‌خواندند.\n\nاو (رضی الله عنه) می‌فرمود: سوره من از قرآن، تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ (پر برکت است آنکه ملک (پادشاهی) به دست اوست). به همین دلیل ما درباره او می‌گفتیم که او یکی از دو امام است، زیرا این مقام، مقام امام است.\n\nسپس می‌گوییم: و چون خدای تعالی اجابت‌کننده بنده مضطر در آنچه او را می‌خواند و از او می‌خواهد، بود، مانند متصرف شد. به همین دلیل ابومدین با قول خود به «ملک الملک (پادشاه پادشاهی)» اشاره می‌کرد.\n\nاما صحت این اضافه (نسبت) برای تحقق بنده در هر نفس (لحظه) است که او مملوک خدای تعالی است، بدون اینکه در این حال، ادعایی متناقض با آن دخالت کند. پس اگر بنده در این مرتبه باشد، در آن هنگام بر او صدق می‌کند که نزد حق (الحق) «ملک» (پادشاه) است. اما اگر بویی از ادعا در او راه یابد، به این صورت که برای خود مالکیتی را ادعا کند که عاری از حضور او در تملیک خداوند آن امر به او باشد که آن را «ملک» نامیده است، در این مقام نخواهد بود و برای او صحیح نیست که درباره حق (الحق) بگوید «ملک الملک (پادشاه پادشاهی)»، هرچند در نفس الامر (واقعیت) چنین باشد.\n\nدر این صورت، او خود را با ادعای جاهلانه خود از این مقام خارج کرده است که او مملوک خداست و در امری غفلت ورزیده است. پس صاحب این مقام نیازمند ترازوی عظیمی است که هرگز از دست و جلوی چشمش دور نشود.\n\n(فصل) و اما اسرار اشتراک میان دو شریعت:\n\nمانند قول خدای تعالی: أَقِمِ الصَّلاةَ لِذِكْرِي (نماز را برای یاد من برپا دار). این مقام، مقام ختم اولیاست و از رجال آن در امروز، خضر و الیاس هستند. این مقام، تأیید دومی است بر آنچه اولی اثبات کرده است، از همان وجهی که اثبات کرده، با وجود تفاوت زمان، تا متقدم و متأخر صحیح باشد.\n\nو گاهی مکان و حال تغییر نمی‌کند، و خطاب تکلیف برای دومی، عیناً همان است که برای اولی واقع شده است. و چون وجهی که آن دو را جمع کرده، مقید به زمان نیست، و اخذ از آن نیز مقید به زمان نیست، اشتراک در شریعت میان دو شخص جایز است، مگر اینکه عبارت و زبان آن‌ها متفاوت باشد. مگر اینکه در یک آن و با یک زبان سخن بگویند، مانند موسی و هارون، هنگامی که به آن‌ها گفته شد: اذْهَبا إِلى‏ فِرْعَوْنَ إِنَّهُ طَغى‏ (به سوی فرعون بروید که او طغیان کرده است).\n\nبا این همه، به آن‌ها گفته شد: فَقُولا لَهُ قَوْلًا لَيِّناً (پس به او سخنی نرم بگویید). در اینجا «قولاً» به صورت نکره (نامعین) آمده است. به ویژه که موسی می‌گوید: هُوَ أَفْصَحُ مِنِّي لِساناً (او [هارون] زبان‌آورتر از من است). پس ممکن است در یک مجلس در عبارت اختلاف کنند، اما یک مقام آن‌ها را جمع کرده است، و آن مبعوث شدن در یک زمان به سوی یک شخص با یک رسالت است.\n\n### توسعه الهی: یا ایده آفرینش جدید\n\nهرچند گروهی از اصحاب و شیوخ ما، مانند ابوطالب مکی و کسانی که قول او را پذیرفته‌اند، وجود چنین چیزی را منع کرده‌اند، اما ما به آن معتقدیم و آن را صحیح می‌دانیم؛ زیرا خدای تعالی تجلی (التجلی) را بر یک شخص تکرار نمی‌کند و میان دو شخص در آن شریک نمی‌سازد، به دلیل توسعه الهی.\n\nبلکه امثال و اشباه (مانندها و شبیه‌ها) بیننده و شنونده را به دلیل تشابهی که تفکیک آن دشوار است، به توهم می‌اندازد، مگر بر اهل کشف (الکشف) و متکلمینی که قائلند عَرَض دو زمان باقی نمی‌ماند.\n\nو از جمله توسعه الهی این است که خداوند أَعْطى‏ كُلَّ شَيْءٍ خَلْقَهُ (به هر چیزی آفرینش خاص خود را عطا کرد) و هر چیزی را در عالم به امری متمایز ساخت که آن امر، آن را از غیرش متمایز می‌کند، و آن «احدیت» (یگانگی) هر چیز است. پس دو چیز در یک مزاج جمع نشده‌اند. ابوالعتاهیه گفته است:\n\n> و در هر چیزی برای او نشانه‌ای است *** که دلالت می‌کند بر اینکه او واحد است.\n\nو این نشانه چیزی جز احدیت هر چیز نیست. هرگز دو چیز در آنچه موجب امتیاز می‌شود، جمع نشده‌اند. اگر اشتراک در آن واقع می‌شد، امتیاز حاصل نمی‌شد، در حالی که عقلاً و کشفاً (الکشف) متمایز شده‌اند.\n\nاز این منزل در این باب، درک ورود بزرگ بر کوچک و وسیع بر تنگ است، بدون اینکه وسیع تنگ شود و تنگ وسیع گردد؛ یعنی هیچ چیز از حال خود تغییر نمی‌کند. اما نه بر وجهی که اهل نظر از متکلمین و حکما در این باره می‌گویند؛ زیرا آن‌ها قائل به اجتماع آن دو در حد و حقیقت هستند، نه در جرمیت (جسمانیت). زیرا بزرگی و کوچکی شیء در حقیقت جامع آن دو تأثیری ندارد.\n\nو از همین باب است که ابوسعید خرّاز گفت: «خداوند شناخته نشد مگر به جمع کردن میان دو ضد.» سپس این آیه را تلاوت کرد: هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ (اوست اول و آخر و ظاهر و باطن). منظور او از یک وجه واحد است، نه از نسبت‌های مختلف، آن‌گونه که اهل نظر از علمای رسوم می‌بینند.\n\n### عیسی (علیه السلام) خاتم ولایت عامه\n\nبدان که نزول عیسی (علیه السلام) ناگزیر است و ناگزیر است که او در میان ما به شریعت محمد (صلی الله علیه و سلم) حکم کند. خداوند این شریعت را از آن جهت که او پیامبر است، به او وحی می‌کند؛ زیرا پیامبر شرع را از غیر مرسل خود نمی‌گیرد.\n\nپس فرشته (ملک) نزد او می‌آید و او را از شریعت محمد (صلی الله علیه و سلم) که آورده است، خبر می‌دهد. و گاهی نیز به او الهام می‌شود. پس او در امور، به تحلیل و تحریم حکم نمی‌کند مگر به آنچه رسول خدا (صلی الله علیه و سلم) اگر حاضر بود، حکم می‌کرد. و با نزول او (علیه السلام)، اجتهاد مجتهدین برداشته می‌شود.\n\nاو در میان ما به شریعت خود که در زمان رسالت و دولت خود بر آن بود، حکم نمی‌کند. او از حیث وحی الهی به او، رسول و نبی است، و از حیث شریعتی که محمد (صلی الله علیه و سلم) بر آن بود، تابع اوست. و ممکن است او از طریق کشف (الکشف)، بر روح محمد (صلی الله علیه و سلم) اطلاع یابد، به گونه‌ای که آنچه را خداوند برای حکم کردن در امت او (صلی الله علیه و سلم) تشریع کرده است، از او بگیرد.\n\nپس عیسی (علیه السلام) از این وجه، صاحب و تابع است. و او (علیه السلام) از این وجه، خاتم اولیاست. پس از شرف پیامبر (صلی الله علیه و سلم) این بود که ختم اولیا در امت او، پیامبری رسول و گرامی، یعنی عیسی (علیه السلام) باشد. و او افضل این امت محمدیه است.\n\nترمذی حکیم در کتاب «ختم الاولیاء» خود به این نکته توجه داده و او را بر ابوبکر صدیق و دیگران برتری داده است. زیرا او هرچند در این امت و ملت محمدیه ولی است، اما در نفس الامر (واقعیت) نبی و رسول است.\n\nپس او در روز قیامت دو حشر دارد: در گروه انبیا و رسولان، زیر پرچم نبوت و رسالت محشور می‌شود و اصحابش تابع او هستند، پس او مانند سایر رسولان متبوع است. و همچنین با ما به عنوان ولی، در گروه اولیای این امت، زیر پرچم محمد (صلی الله علیه و سلم) محشور می‌شود، در حالی که تابع اوست و بر تمام اولیا از زمان آدم تا آخرین ولی که در عالم خواهد بود، مقدم است.\n\nپس خداوند برای او ولایت و نبوت را آشکارا جمع کرده است. و در میان رسولان روز قیامت، هیچ رسولی نیست که رسول دیگری از او تبعیت کند، مگر محمد (صلی الله علیه و سلم)؛ زیرا عیسی و الیاس (علیهما السلام) در روز قیامت در میان پیروان او محشور می‌شوند. هرچند هر کس در موقف محشر است، از آدم تا پایین‌تر، زیر پرچم او (صلی الله علیه و سلم) است، اما این پرچم عام اوست، و سخن ما درباره پرچم خاص امت او (صلی الله علیه و سلم) است.\n\n### ختم ولایت خاص محمدیه\n\nو برای ولایت محمدیه مخصوص به این شریعت نازل شده بر محمد (صلی الله علیه و سلم)، ختم خاصی وجود دارد که از نظر رتبه پایین‌تر از عیسی (علیه السلام) است، به دلیل اینکه عیسی رسول است.\n\nاین ختم در زمان ما متولد شده و من نیز او را دیده‌ام و با او ملاقات کرده‌ام و علامت ختمیت را که در اوست، مشاهده کرده‌ام. پس هیچ ولی‌ای پس از او نیست مگر اینکه به او باز می‌گردد، همان‌گونه که هیچ پیامبری پس از محمد (صلی الله علیه و سلم) نیست مگر اینکه به او باز می‌گردد، مانند عیسی، الیاس و خضر در این امت، هنگامی که عیسی نازل می‌شود.\n\nپس نسبت هر ولی‌ای که پس از این ختم تا روز قیامت می‌آید، مانند نسبت هر پیامبری است که پس از محمد (صلی الله علیه و سلم) در نبوت می‌آید.\n\nو پس از آنکه مقام عیسی (علیه السلام) را هنگام نزول برایت بیان کردم، هر چه می‌خواهی بگو. اگر خواستی بگو «دو شریعت برای یک عین»، و اگر خواستی بگو «یک شریعت».\n\n(فصل) قلب‌هایی که عاشق انفاس رحمانی هستند:\n\nو اما قلب‌هایی که عاشق انفاس (نفس‌ها) هستند: چون خزانه‌های ارواح حیوانی به دلیل مناسبت، عاشق انفاس رحمانی (نفس‌های رحمانی) شدند، رسول خدا (صلی الله علیه و سلم) فرمود: إن نفس الرحمن يأتيني من قبل اليمن (نفس رحمان از سوی یمن به من می‌رسد).\n\nآگاه باش که روح حیوانی، نفس است. و اصل این انفاس نزد قلب‌هایی که عاشق آن هستند، همان نفس رحمانی است که از سوی یمن می‌آید، برای کسی که از وطنش خارج شده و میان او و مسکن و محل سکونتش حائل شده‌اند. پس در آن، گشایش اندوه و دفع سختی‌هاست.\n\nو پیامبر (صلی الله علیه و سلم) فرمود: إن لله نفحات فتعرضوا لنفحات ربكم (همانا برای خداوند نفحاتی (نسیم‌هایی) است، پس خود را در معرض نفحات پروردگارتان قرار دهید).\n\nمنازل این انفاس در عدد به سیصد و سی نفس ختم می‌شود. در هر منزلی از منازل آن، که مجموع آن حاصل ضرب سیصد و سی در سیصد و سی است. آنچه حاصل شود، عدد انفاسی است که از حق (الحق) از اسم «الرحمن» در عالم بشری صادر می‌شود.\n\nو آنچه من به آن تحقق یافته‌ام این است که این انفاس منازلی دارند که دویست منزل بر این مقدار می‌افزاید، به ویژه در حضرت «فَهوانیه». پس اگر سیصد و سی را در پانصد و سی ضرب کنی، آنچه پس از ضرب حاصل شود، عدد انفاس رحمانی در عالم انسانی است. هر نفسی از آن‌ها، علم الهی مستقلی است که از تجلی (التجلی) الهی خاصی برای این منازل حاصل می‌شود و برای غیر آن‌ها نیست.\n\nهر کس بویی از این انفاس استشمام کند، مقدار آن را می‌شناسد. من کسی از اهل این مقام را ندیده‌ام که نزد مردم معروف باشد. و بیشتر آن‌ها از سرزمین‌های اندلس هستند. من با یکی از آن‌ها در بیت المقدس و مکه ملاقات کردم. روزی در مورد مسئله‌ای از او پرسیدم، به من گفت: «آیا چیزی استشمام می‌کنی؟» دانستم که او از اهل آن مقام است و مدتی به من خدمت کرد.\n\nمن عمویی داشتم، برادر تنی پدرم، به نام عبدالله بن محمد بن العربی، که این مقام را حساً و معناً داشت. ما این را از او مشاهده کردیم، پیش از آنکه ما به این راه بازگردیم، در زمان جاهلیت من.\n\nو خداوند يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 4
}