{
  "id": 545,
  "title": {
    "ar": "الباب الخامس والأربعون وخمسمائة في معرفة حال قطب كان هجيره واسْجُدْ واقْتَرِبْ",
    "en": "Chapter Five Hundred and Forty-Five: Concerning the Gnosis of the State of a Pole (قطب) Whose Constant Practice Was [the Command]: \"Prostrate and draw near\" (واسْجُدْ واقْتَرِبْ).",
    "ur": "باب پانچ سو پینتالیس: اس قطب (Qutb) کے حال کی معرفت میں جس کا دائمی ورد یہ تھا: \"اور سجدہ کرو اور (اللہ کے) قریب ہو جاؤ\" (واسْجُدْ واقْتَرِبْ)۔",
    "fa": "باب پانصد و چهل و پنجم در معرفت حال قطبی که ورد او «سجده کن و نزدیک شو» (واسْجُدْ واقْتَرِبْ) بود."
  },
  "content": {
    "ar": "## «الباب الخامس والأربعون وخمسمائة في معرفة حال قطب كان هجيره واسْجُدْ واقْتَرِبْ»\n\n\n> لا تطع النفس التي من شأنها *** سدل الحجاب عليك واسْجُدْ واقْتَرِبْ‏\n\n\n> لا تطمعن بها فلست من أهلها *** وأجنح إلى النور المهيمن واغترب‏\n\n\n> فهو الذي أعطى الوجود بجوده *** فاعمل بما يعطي وجودك تقترب‏\n\n\n### [العبد إذا وقف على حقيقته فقد عرف نفسه وإذا عرف نفسه عرف ربه‏]\n\n\nاعلم أيدنا الله وإياك بِرُوحٍ مِنْهُ أن هذا الذكر يوقف العبد على حقيقته وإذا وقف على حقيقته فقد عرف نفسه وإذا عرف نفسه عرف ربه والعبد أبدا لا يطلب بحركته إلا ربه حتى يشهده عين كل شي‏ء ومنه صدر فقد شهد صدوره وهو معه فقد شهد معيته في تصرفه فلا بد أن يطلب شهوده فيما ينتهي إليه تصرفه فهو غاية المطلب ولما كان العلو لله‏\nعرفا وعلما والمعية علما وشرعا لا عرفا أراد أن يرى حكمه في الغاية فإن السجود في العرف بعد عما يجب لله من العلو أ لا ترى إلى ابن عطاء حين غاص رجل جمله فقال جل الله فقال الجمل جل الله وما غاص إلا ليطلب ربه فإنه سجود قرية من ذلك العضو إلى الله فلما رأى الجمل جهل ابن عطاء بالله في طلب الرجل ربه بالغوص قال الجمل جل الله إن تحصره معرفتك فلا يكون له في عقدك إلا العلو فمن يحفظ السفل وأنا رجل ما أنا رأس فلا بد أن أطلب ربي بحقيقتي وليس إلا السجود\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لو دليتم بحبل لهبط على الله‏\n\n\nوهذا عين ما قال الجمل فمن سجد اقترب من الله ضرورة فيشهده الساجد في علوه ولهذا شرع للعبد أن يقول في سجوده سبحان ربي الأعلى ينزهه عن تلك الصفة فالسجود إذا تحقق به العبد علم نزول الحق من العرش إلى السماء الدنيا وذلك سجود القلب يطلب العبد في نزوله كما يطلبه العبد في سجوده ومن لم يقف في هذا الذكر على الذي نبهت عليه وأمثاله فما هو صاحب هذا الهجير فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Five Hundred and Forty-Five: Concerning the Knowledge of the State of a Pole Whose Constant Refrain Was: \"Prostrate and Draw Near\"\n\n> Do not obey the soul whose nature it is\n> To draw the veil over you. Prostrate and draw near (واسْجُدْ واقْتَرِبْ).\n\n> Do not covet it, for you are not of its people,\n> But incline toward the Dominant Light (النور المهيمن) and become a stranger.\n\n> For He is the One who granted Existence (الوجود) through His Generosity,\n> So act according to what your existence grants you, that you may draw near.\n\n### [When the servant stands upon his Reality, he has known himself, and when he has known himself, he has known his Lord]\n\nKnow—may Allah support us and you with a Spirit (روح) from Him—that this remembrance (الذكر) causes the servant to stand upon his Reality (حقيقته). When he stands upon his Reality, he has known himself, and when he has known himself, he has known his Lord.\n\nThe servant perpetually seeks nothing by his movement except his Lord, until he witnesses Him as the very Essence (عين) of everything. And since everything originated from Him, the servant has witnessed its origination (صدوره). And since He is with the servant, the servant has witnessed His concomitance (معيته) in his actions. Therefore, he must seek the witnessing (شهود) of Him in that to which his action culminates, for He is the ultimate goal (غاية المطلب).\n\nAnd since Exaltation (العلو) belongs to Allah both conventionally (عرفا) and intellectually (علما), while Concomitance (المعية) belongs to Him intellectually and legally (شرعا), but not conventionally, He desired to see His ruling (حكمه) in the ultimate goal. For prostration (السجود), conventionally, is a distance from the Exaltation that is due to Allah.\n\nDo you not see the story of Ibn ‘Ata’ when a man’s camel sank? The man exclaimed, \"Exalted is Allah!\" The camel replied, \"Exalted is Allah!\" It only sank to seek its Lord, for that sinking is the prostration of that limb drawing near to Allah. When the camel saw Ibn ‘Ata’s ignorance concerning Allah—in the man seeking his Lord through sinking—the camel said, \"Exalted is Allah! If your gnosis (معرفتك) confines Him, so that in your belief (عقدك) He possesses only Exaltation, then who preserves the lower realm (السفل)? I am a man, not a head, so I must seek my Lord through my Reality, and there is nothing but prostration.\"\n\nThe Messenger of Allah, may Allah bless him and grant him peace, said: \"If you were to lower a rope, it would descend upon Allah.\"\n\nThis is the very Essence of what the camel said. Thus, whoever prostrates draws near (اقترب) to Allah by necessity, and the prostrator witnesses Him in His Exaltation. For this reason, it was legislated for the servant to say in his prostration: \"Glory be to my Lord, the Most High (سبحان ربي الأعلى),\" thereby declaring Him transcendent (ينزهه) beyond that attribute.\n\nWhen the servant realizes the reality of prostration, he knows the descent of the Real (الحق) from the Throne (العرش) to the lowest heaven. That is the prostration of the heart (سجود القلب), seeking the servant in His descent, just as the servant seeks Him in his prostration.\n\nWhoever does not stand upon the understanding of this remembrance concerning what I have alerted you to, and similar matters, is not the master of this constant refrain (هجير). Know this. And Allah says the Truth (الحق), and He guides to the Way (السبيل).",
    "ur": "باب نمبر پانچ سو پینتالیس: اس قطب کے حال کی معرفت میں جس کا ورد (ہجیر) \"سجدہ کر اور قریب ہو جا\" تھا (واسْجُدْ واقْتَرِبْ)۔\n\nاس نفس کی اطاعت نہ کر جس کا کام تجھ پر پردہ ڈالنا ہے، اور سجدہ کر اور قریب ہو جا (واسْجُدْ واقْتَرِبْ)۔\n\nاس (نفس) میں طمع نہ کر، تو اس کے اہل میں سے نہیں ہے، اور نورِ غالب کی طرف مائل ہو جا اور اجنبی بن جا (اغترب)۔\n\nپس وہی ہے جس نے اپنے جود و کرم سے ہستی (الوجود) عطا کی، لہٰذا اس چیز پر عمل کر جو تیری ہستی (وجودک) عطا کرتی ہے تاکہ تو قریب ہو جائے۔\n\n[جب بندہ اپنی حقیقت پر قائم ہو جاتا ہے تو وہ اپنے نفس کو پہچان لیتا ہے، اور جب وہ اپنے نفس کو پہچان لیتا ہے تو وہ اپنے رب کو پہچان لیتا ہے]\n\nجان لو کہ یہ ذکر بندے کو اس کی حقیقت پر قائم کر دیتا ہے، اور جب وہ اپنی حقیقت پر قائم ہو جاتا ہے تو وہ اپنے نفس کو پہچان لیتا ہے، اور جب وہ اپنے نفس کو پہچان لیتا ہے تو وہ اپنے رب کو پہچان لیتا ہے۔ اور بندہ ہمیشہ اپنی حرکت سے اپنے رب کے سوا کسی کو نہیں ڈھونڈتا، یہاں تک کہ وہ اسے ہر شے کی عین (حقیقت) کے طور پر دیکھ لے (یشہده عین کل شیء)۔ اور چونکہ وہ اسی سے صادر ہوا ہے، لہٰذا اس نے اپنے صدور (ظہور) کا مشاہدہ کر لیا۔ اور چونکہ وہ اس کے ساتھ ہے، لہٰذا اس نے اپنے تصرف میں اس کی معیت (معیته) کا مشاہدہ کر لیا۔ پس لازمی ہے کہ وہ اس کے شہود (الشہود) کو اس چیز میں تلاش کرے جہاں اس کا تصرف ختم ہوتا ہے، کیونکہ وہی مطلوب کی انتہا ہے۔\n\nاور چونکہ علو (بلندی) ذات حق (الحق) کے لیے عرفاً اور علماً ثابت ہے، اور معیت (ساتھ ہونا) علماً اور شرعاً ثابت ہے نہ کہ عرفاً، اس لیے اس (بندے) نے چاہا کہ وہ انتہا میں اس (ذات حق) کا حکم دیکھے۔ کیونکہ عرف میں سجدہ اس علو سے دوری ہے جو ذات حق (الحق) کے لیے واجب ہے۔ کیا تم ابن عطاء کی طرف نہیں دیکھتے جب ایک شخص کا اونٹ کیچڑ میں دھنس گیا، تو اس شخص نے کہا: \"اللہ بلند ہے (جل اللہ)\"۔ تو اونٹ نے کہا: \"اللہ بلند ہے (جل اللہ)\"۔ اور وہ (اونٹ) صرف اپنے رب کو تلاش کرنے کے لیے ہی نہیں دھنسا تھا، کیونکہ وہ (دھنسنا) اس عضو کی طرف سے اللہ کی قربت کا سجدہ ہے۔ جب اونٹ نے دیکھا کہ ابن عطاء نے اس شخص کے غوطہ لگانے کے ذریعے اپنے رب کو تلاش کرنے میں اللہ کے بارے میں جہالت کا مظاہرہ کیا، تو اونٹ نے کہا: \"اللہ بلند ہے (جل اللہ)، اگر تیری معرفت (المعرفۃ) اسے محدود کر دے اور تیرے عقیدے میں اس کے لیے صرف علو (بلندی) ہی ہو، تو پھر پستی (السفل) کی حفاظت کون کرے گا؟ اور میں ایک ایسا شخص ہوں جو سر نہیں ہوں، لہٰذا مجھے اپنی حقیقت کے ذریعے اپنے رب کو تلاش کرنا چاہیے، اور وہ سجدے کے سوا کچھ نہیں ہے۔\"\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"اگر تم ایک رسی لٹکاؤ تو وہ اللہ پر گرے گی (لو دليتم بحبل لهبط على الله)۔\"\n\nاور یہ بعینہٖ وہی بات ہے جو اونٹ نے کہی تھی۔ پس جو سجدہ کرتا ہے وہ لازمی طور پر اللہ سے قریب ہو جاتا ہے، چنانچہ سجدہ کرنے والا اسے اس کے علو (بلندی) میں بھی دیکھتا ہے۔ اور اسی لیے بندے کے لیے مشروع کیا گیا ہے کہ وہ اپنے سجدے میں کہے: \"سبحان ربی الأعلیٰ\" (میرا رب پاک ہے جو سب سے بلند ہے)، تاکہ وہ اسے اس صفت (صرف علو) سے پاک قرار دے۔ پس جب بندہ سجدے کی حقیقت (تحقق) کو پا لیتا ہے، تو وہ ذات حق (الحق) کے عرش سے آسمان دنیا کی طرف نزول کو جان لیتا ہے۔ اور یہ قلب کا سجدہ ہے، جو نزول میں بندے کو تلاش کرتا ہے، جیسا کہ بندہ اپنے سجدے میں اسے تلاش کرتا ہے۔ اور جو شخص اس ذکر میں ان باتوں اور ان جیسی دیگر باتوں پر قائم نہ ہو جن پر میں نے متنبہ کیا ہے، تو وہ اس ورد (ہجیر) کا صاحب نہیں ہے۔ پس یہ جان لو۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و چهل و پنجم در معرفت حال قطبی که ورد (هجیر) او «سجده کن و نزدیک شو» بود.\n\nاز نفسی که کارش افکندن پرده بر توست اطاعت مکن *** و سجده کن و نزدیک شو (واسْجُدْ واقْتَرِبْ).\n\nبه آن (نفس) طمع مبند، که تو از اهل آن نیستی *** و به سوی نور غالب (المهيمن) میل کن و غربت اختیار نما.\n\nاوست که هستی (الوجود) را با جود خود بخشید *** پس به آنچه هستی‌ات می‌بخشد عمل کن تا نزدیک شوی.\n\n### [بنده چون بر حقیقت خود وقوف یابد، نفس خود را شناخته و چون نفس خود را شناخت، پروردگارش را شناخته است.]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که این ذکر بنده را بر حقیقتش وقوف می‌دهد؛ و چون بر حقیقتش وقوف یابد، نفس خود را شناخته است؛ و چون نفس خود را شناخت، پروردگارش را شناخته است. بنده همواره با حرکت خود جز پروردگارش را نمی‌طلبد تا آنکه او را عین هر شیء شهود (الشهود) کند. و چون از او صادر شده، صدور او را شهود کرده است؛ و چون او با اوست، معیت (معیت) او را در تصرفش شهود کرده است. پس ناگزیر است که شهود او را در آنچه تصرفش به آن منتهی می‌شود، طلب کند؛ که او غایت مطلوب است.\n\nو چون علو (برتری) از نظر عرف و علم از آنِ حق (الحق) است، و معیت (همراهی) از نظر علم و شرع از آنِ اوست نه از نظر عرف، خواست که حکم او را در غایت ببیند. زیرا سجود در عرف، دوری از علوی است که برای خداوند واجب است. آیا به ابن عطاء نمی‌نگری هنگامی که مردی شترش را به آب فرو برد و گفت: «جلّ الله» (خداوند بزرگ است)؟ شتر گفت: «جلّ الله». و آن شتر فرو نرفت مگر برای طلب پروردگارش، زیرا آن سجود، نزدیکی آن عضو به سوی خداوند است. هنگامی که شتر، جهل ابن عطاء به خداوند را در طلب پروردگار توسط آن مرد از طریق فرو رفتن دید، گفت: «جلّ الله» اگر معرفت (المعرفة) تو او را محدود کند و در اعتقاد تو جز علو (برتری) برای او نباشد، پس چه کسی سفل (پایین) را حفظ می‌کند؟ و من مردی هستم که سر نیستم، پس ناگزیرم پروردگارم را با حقیقتم طلب کنم و این جز با سجود میسر نیست.\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «اگر طنابی را آویزان کنید، بر خداوند فرود می‌آید.» (لو دليتم بحبل لهبط على الله‏)\n\nو این عین همان چیزی است که شتر گفت. پس هر کس سجده کند، ضرورتاً به خداوند نزدیک می‌شود و سجده‌کننده او را در علو (برتری) خود شهود می‌کند. و به همین دلیل برای بنده تشریع شده است که در سجود خود بگوید: «سبحان ربی الأعلی» (پروردگار برتر من منزه است)، تا او را از آن صفت (محدودیت مکانی) تنزیه کند. پس سجود، هنگامی که بنده به آن تحقق یابد، نزول حق (الحق) را از عرش به آسمان دنیا می‌داند؛ و این سجود قلب است که بنده را در نزولش می‌طلبد، همان‌گونه که بنده او را در سجودش می‌طلبد. و هر کس در این ذکر بر آنچه من بر آن و امثال آن تنبیه کردم، وقوف نیابد، صاحب این ورد (هجیر) نیست. پس این را بدان. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}