{
  "id": 498,
  "title": {
    "ar": "الباب الثامن والتسعون وأربعمائة في معرفة حال قطب كان منزله ومن يَتَّقِ الله يَجْعَلْ لَهُ مَخْرَجاً ويَرْزُقْهُ من حَيْثُ لا يَحْتَسِبُ",
    "en": "Chapter Four Hundred and Ninety-Eight: Concerning the knowledge of the spiritual state of a Pole (قطب) whose station was: <<وَمَن يَتَّقِ اللَّهَ يَجْعَل لَّهُ مَخْرَجًا * وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ>> (And whosoever fears Allah, He will appoint for him a way out, and will provide for him from whence he does not expect).",
    "ur": "باب چار سو اٹھانوے: ایک قطب (قطب) کے حال کی معرفت کے بارے میں جس کا روحانی مقام یہ تھا: وَمَن يَتَّقِ اللَّهَ يَجْعَل لَّهُ مَخْرَجًا وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ (اور جو کوئی اللہ سے ڈرتا ہے، اللہ اس کے لیے نکلنے کا راستہ بنا دیتا ہے، اور اسے وہاں سے رزق دیتا ہے جہاں سے اسے گمان بھی نہیں ہوتا۔)",
    "fa": "باب چهارصد و نود و هشتم در معرفت حال قطبی (قطب) که منزلگاه او این آیه بود: «و هر کس از خدا پروا کند، خداوند برای او راه خروجی قرار می‌دهد و او را از جایی که گمان نمی‌برد روزی می‌دهد.» (وَمَن يَتَّقِ اللَّهَ يَجْعَل لَّهُ مَخْرَجًا وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ)"
  },
  "content": {
    "ar": "## (الباب الثامن والتسعون وأربعمائة في معرفة حال قطب كان منزله ومن يَتَّقِ الله يَجْعَلْ لَهُ مَخْرَجاً ويَرْزُقْهُ من حَيْثُ لا يَحْتَسِبُ)\n\n\n> من يتق الله في ضيق وفي سعة *** فرزقه يأته من حيث لا يدري‏\n\n\n> رزق المعاني ورزق الحس فارض به *** ربا إذا جاء في ليل إذا يسرى‏\n\n\n> وفي زمان وفي غير الزمان فلا *** تنظر إلى أحد في طبعه يجري‏\n\n\n> لو لا وجود ولو لا الدهر ما نظرت *** عيني إلى أحد من عالم الأمر\n\n\n### [أن الحق كل يوم من أيام الأنفاس في شأن‏]\n\n\nقال الله عز وجل إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً وهو قوله يَجْعَلْ لَهُ مَخْرَجاً فيخرج مما كان فيه فيفارقه إلى أمر آخر لأنه ما يخرج إلى عدم وإنما يخرج من وجود إلى وجود هذا حال العالم بعد وجوده لا سبيل إلى العدم بعد ذلك قال إليه تُرْجَعُ الْأُمُورُ وهو الوجود الحق ومن صدق هذه الآية الأمر الذي سرى في العالم وقال به إلا الشاذ النادر الذي لا حكم له وهو إن أحدا لا تراه راضيا بحاله في الوجود أصلا ولذلك علة أصلية وهو أن الحق كل يوم من أيام الأنفاس في شأن فتحرك العالم تلك الشئون الإلهية فيطلب الانتقال مما هو فيه كان ما كان إلى أمر آخر غير إن الشاذ القليل وإن طلب الانتقال فإنه راض بحاله في وقته وفي طلبه الانتقال فهو يطلب ليجمع وأكثر العالم لا يطلب الانتقال إلا لعدم الرضاء بحاله فما تجد أحدا من صالح ولا غير صالح يرضى بحاله هذا هو الساري في العالم ومن هذا الباب إنك ما ترى أحدا إلا وهو يذم زمانه ويحمد ما مضى وخلا من الأزمان وليس زمانه إلا حاله مذ وجدت هذه النشأة وأي زمان كان فيه بنو آدم في وقت آدم حتى ذكر أنه قال في نظم له بلسانه ترجمته‏\n\n\n> تغيرت البلاد ومن عليها *** فوجه الأرض مغبر قبيح‏\n\n\nفالإنسان يذم يومه ويمدح أمسه وهو الإنسان عينه لا غيره وقد كان أمس يذم يومه ويمدح ما قبله فلم يزل الأمر هكذا وذلك للأمر الطبيعي أعني الذم كما إن طلب الانتقال للشأن الإلهي والعارفون يطلبون الانتقال للشأن الإلهي من غير ذم أوقاتهم وغير العارفين يذمون أوقاتهم طبعا ويطلبون الانتقال للشأن الإلهي الذي يحركهم لذلك وهم لا يشعرون وله أيضا سبب غير هذا عجيب أعني طلب الانتقال والذم وذلك أن الإنسان مجبول على القلق من الضيق وطلب الانفساح والإفراج عنه ويتخيل أن كل ما هو خارج عنه فيه الانفساح من هذا الضيق الذي هو فيه وذلك أن الإنسان إذا كان في حال ما من الأحوال فإنه مقبوض عليه بذلك الحال لإحاطته به لا بد من ذلك فيجد نفسه محصورا ويرى ما خرج عن ذلك الحصر أنه انفساح وانفراج لأن الأمر الخارج عن حاله ما هو واحد بعينه فيضيق عليه الأمر فلهذا يجد السعة فيما عدا حاله الذي هو عليه فإذا خرج لم يحصل له من ذلك الاتساع المتوهم إلا حال واحدة تحتاط به فيجد أيضا فيه الضيق لإحاطتها به وحصره فيه فيطلب الإفراج عنه كما طلبه في الحال الأول فلا يزال هذا ديدنه والله يخرجه من اسم إلى اسم دائما أبدا فمن اتخذ الله وقاية أخرجه من الضيق أي أزال الضيق عنه فاتسع في مدلول الاسم الله من غير تعيين ولذلك رزقه من حيث لا يحتسب لأنه لم يقيد فلم يتقيد فكل شي‏ء أقامه الحق فيه فهو له فيرجع محيطا بما أعطاه الله فله السعة دائما أبدا فالانتقال يعم الجميع والرضاء وعدم الرضاء الموجب للضيق هو الذي يتفاضل فيه الخلق فمن اتقى الله خرج إلى سعة هذا الاسم فيتسع باتساع هذا الاسم الله اتساعا لا ضيق بعده ومن لم يتق الله لم يشهد سوى حكم اتساع واحد فيخرج من ضيق إلى ضيق ومن أراد أن يجرب نفسه ويأتي إلى الأمر من فصه ولينظر في نفسه إلى علمه برزقه ما هو فإن لم يعلم رزقه فذلك الذي خرج من الضيق إلى السعة وهو قوله تعالى ويَرْزُقْهُ من حَيْثُ لا يَحْتَسِبُ قال بعضهم في ذلك‏\n> ومن يَتَّقِ الله يَجْعَلْ لَهُ *** كما قال من أمره مَخْرَجاً\n\n\n> ويرزقه من غير حسبانه *** وإن ضاق أمر به فرجا\n\n\nلأنه ما خلقه إلا لعبادته سبحانه وتعالى وهو يرزقه من حيث شاء فلا يشغل نفسه برزقه كما لا يشغل نفسه بأجله فإن حكمهما واحد وما يختص بهما حيوان دون حيوان ومن علم رزقه لم يزل في ضيق لأنه مجبول على عدم الرضاء وإنما قلنا لم يزل في ضيق‏\n\n\nلأنه قد تعين له ما لا يمكن الزيادة فيه بالخبر الصادق النبوي‏\n\n\nفيبقى معذبا بالضيق إلى أن يموت والذي لا يعلم يعيش في السعة المتوهمة سعة الرجاء فيعيش طيب النفس فكلما جاءه من رزق من حيث لا يحتسب شغله انتظار ما لا يعلم عن حكم الحاصل في الوقت فهو في قبضه وضيق وقته في بسط وسعة من أمله فإنه الحاكم عليه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 498: Concerning the Knowledge of the State of a Pole (قطب) Whose Station Was: \"And whoever fears Allah—He will make for him a way out, and will provide for him from where he does not expect.\"\n\nWhoever fears Allah, whether in constraint or in ease,\nHis provision comes to him from where he knows not.\n\nThe provision of meanings and the provision of the senses—be content with it,\nO Lord, when it comes in the night when it travels.\n\nAnd in time, and in that which is beyond time,\nSo do not look upon anyone who runs according to his nature.\n\nWere it not for Existence (الوجود) and were it not for Time (الدهر),\nMy eye would not have looked upon anyone from the World of Command (عالم الأمر).\n\n### [That The Real (الحق) is engaged in a matter every day of the days of breaths]\n\nAllah, the Mighty and Majestic, said: <<إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً>> (If you fear Allah, He will grant you a criterion [for judgment]), which is His saying: <<يَجْعَلْ لَهُ مَخْرَجاً>> (He will make for him a way out). Thus, he exits that which he was in, separating from it to another matter, because he does not exit into non-existence (عدم), but rather exits from existence (وجود) to existence (وجود). This is the state of the World (العالم) after its existence; there is no path back to non-existence after that. He said: <<إِلَيْهِ تُرْجَعُ الْأُمُورُ>> (To Him all matters are returned), and this is the True Existence (الوجود الحق). Whoever affirms this verse affirms the matter that pervades the World (العالم), except for the rare anomaly that holds no sway.\n\nThis matter is that you do not see anyone truly content with his state in Existence (الوجود) at all. The fundamental reason for this is that The Real (الحق) is engaged in a matter (شأن) every day of the days of breaths (الأنفاس). These Divine Matters (الشئون الإلهية) move the World (العالم), causing it to seek transition from whatever state it is in to another matter. However, the rare few, even if they seek transition, are content with their state in that moment, and their seeking transition is a seeking to gather [knowledge or perfection]. But most of the World (العالم) only seeks transition due to a lack of contentment with their current state. Thus, you will not find anyone, righteous or otherwise, who is content with his state. This is what pervades the World (العالم).\n\nRelated to this is that you do not see anyone except that he blames his time and praises what has passed and vanished of times. Yet his time is nothing but his state since this phenomenal existence (النشأة) came to be. And what time were the Children of Adam in during the time of Adam, such that it is mentioned that he said in a poem, the translation of which is:\n\nThe lands and those upon them have changed,\nSo the face of the earth is dusty and ugly.\n\nThus, man blames his day and praises his yesterday, yet he is the very same man, no other. And yesterday, he was blaming his day and praising what preceded it. The matter has never ceased to be thus. This is due to a natural matter—I mean the blaming—just as the seeking of transition is due to the Divine Matter (الشأن الإلهي). The Gnostics (العارفون) seek transition due to the Divine Matter (الشأن الإلهي) without blaming their times. While the non-Gnostics naturally blame their times and seek transition due to the Divine Matter (الشأن الإلهي) that moves them toward it, though they are unaware.\n\nThere is also another strange reason for this—I mean the seeking of transition and the blaming. This is because man is naturally disposed to anxiety (القلق) arising from constraint (الضيق) and seeks expansion (الانفساح) and relief from it. He imagines that everything outside of his current state contains the expansion that will relieve the constraint he is experiencing. This is because when a person is in any state (حال), he is necessarily constrained (مقبوض عليه) by that state due to its encompassing nature, and thus he finds himself confined. He sees what is outside that confinement as expansion and relief, because the matter outside his state is not confined to one specific thing, yet the matter [of his current state] constrains him. For this reason, he finds spaciousness (السعة) in whatever is other than the state he is currently in. But when he exits, he does not achieve from that imagined spaciousness (الاتساع المتوهم) anything but a single state that encompasses him, and he again finds constraint (الضيق) within it due to its encompassing nature and its confinement of him. So he seeks relief from it, just as he sought it in the first state. This remains his constant habit.\n\nAnd Allah continually and eternally moves him from one Name (اسم) to another Name (اسم). Therefore, whoever takes Allah as a shield (وقاية), He removes him from constraint (الضيق)—meaning He removes the constraint from him—and he expands within the meaning of the Name Allah (الله) without specific designation. For this reason, his provision comes to him from where he does not expect (لا يحتسب), because he did not restrict himself, so he was not restricted. Thus, everything in which The Real (الحق) establishes him belongs to him, and he returns encompassing what Allah has given him, so he possesses spaciousness (السعة) continually and eternally.\n\nTransition (الانتقال) is universal for all, but contentment (الرضاء) and lack of contentment (عدم الرضاء)—which necessitates constraint (الضيق)—is where creatures (الخلق) differ in degree. So whoever fears Allah exits into the spaciousness (سعة) of this Name (اسم), and he expands with the expansion of this Name Allah (الله), an expansion after which there is no constraint. But whoever does not fear Allah witnesses only the ruling of a single expansion, so he exits from constraint (ضيق) to constraint (ضيق).\n\nAnd whoever wishes to test himself and approach the matter from its core (فصه), let him look within himself at his knowledge of what his provision (رزقه) is. If he does not know his provision, then he is the one who has exited from constraint (الضيق) into spaciousness (السعة), and this is the meaning of His saying, the Exalted: <<وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ>> (And will provide for him from where he does not expect). Some have said concerning this:\n\nAnd whoever fears Allah, He will make for him,\nAs He said, a way out from his affair.\n\nAnd He provides for him without his expectation,\nAnd if a matter constrains him, He grants relief.\n\nThis is because He created him only for His worship, glory be to Him, the Exalted, and He provides for him from wherever He wills. Therefore, let him not preoccupy himself with his provision (رزقه), just as he does not preoccupy himself with his appointed term (أجله), for the ruling concerning both is one and the same, and they are not specific to one creature (حيوان) over another.\n\nWhoever knows his provision remains in constraint (ضيق), because he is naturally disposed to lack contentment (عدم الرضاء). We only said he remains in constraint because that which cannot be increased has been designated for him by the truthful prophetic report. So he remains tormented by constraint (الضيق) until he dies. But the one who does not know lives in the imagined spaciousness (السعة المتوهمة)—the spaciousness of hope—and thus lives with a pleasant soul. Whenever provision comes to him from where he does not expect (لا يحتسب), the anticipation of what he does not know distracts him from the ruling of what is present in the moment. Thus, he is in contraction (قبض) and constraint (ضيق) regarding his present time, but in expansion (بسط) and spaciousness (سعة) regarding his hope, for hope is what governs him. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (says the truth, and He guides to the way).",
    "ur": "باب نمبر چار سو اٹھانوے: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور جو کوئی اللہ سے ڈرتا ہے، وہ اس کے لیے نکلنے کی راہ پیدا کر دیتا ہے، اور اسے وہاں سے رزق دیتا ہے جہاں سے اسے گمان بھی نہیں ہوتا۔\"\n\nجو تنگی اور کشادگی میں اللہ سے ڈرے،\nاس کا رزق اسے وہاں سے آتا ہے جہاں سے وہ نہیں جانتا۔\n\nمعانی کا رزق اور حسی رزق، اس پر راضی ہو جا،\nاے رب! جب وہ رات میں آئے جب وہ چل رہی ہو۔\n\nاور زمانے میں اور غیر زمانے میں، پس تو نہ دیکھ\nکسی ایسے شخص کی طرف جو اپنی طبیعت پر چل رہا ہو۔\n\nاگر ہستی (الوجود) اور اگر دہر (زمانہ) نہ ہوتا، تو میری آنکھ\nعالمِ امر (عالم الأمر) میں سے کسی کو نہ دیکھتی۔\n\n### [کہ ذات حق (الحق) ہر سانس کے دنوں میں ایک نئی شان میں ہے]\n\nاللہ عزوجل نے فرمایا: \"اگر تم اللہ سے ڈرو گے تو وہ تمہارے لیے فرقان (حق و باطل میں تمیز) پیدا کر دے گا۔\" (سورۃ الأنفال ۸:۲۹) اور یہی اس کا قول ہے: \"وہ اس کے لیے نکلنے کی راہ پیدا کر دیتا ہے۔\" (يَجْعَلْ لَهُ مَخْرَجاً) پس وہ اس چیز سے نکل جاتا ہے جس میں وہ تھا، اور اسے چھوڑ کر کسی دوسرے امر کی طرف چلا جاتا ہے، کیونکہ وہ عدم کی طرف نہیں نکلتا، بلکہ وہ ایک ہستی (الوجود) سے دوسری ہستی (الوجود) کی طرف نکلتا ہے۔ وجود میں آنے کے بعد عالم کا یہی حال ہے، اس کے بعد عدم کی طرف کوئی راستہ نہیں۔ اللہ نے فرمایا: \"اسی کی طرف تمام امور لوٹائے جاتے ہیں۔\" (سورۃ ہود ۱۱:۱۲۳) اور وہ ذات حق (الحق) کی ہستی (الوجود) ہے۔ جس نے اس آیت کی تصدیق کی، وہ امر جو عالم میں سرایت کر گیا ہے اور جس کا وہ قائل ہے، سوائے شاذ و نادر کے جس کا کوئی حکم نہیں،\n\nوہ یہ ہے کہ تم کسی کو بھی ہستی (الوجود) میں اپنے حال پر ہرگز راضی نہیں دیکھو گے۔ اور اس کی ایک بنیادی وجہ ہے، اور وہ یہ ہے کہ ذات حق (الحق) ہر سانس کے دنوں میں ایک نئی شان میں ہے۔ پس یہ الٰہی شؤون عالم کو حرکت دیتے ہیں، اور وہ جس حال میں بھی ہو، اس سے کسی دوسرے امر کی طرف منتقل ہونے کا مطالبہ کرتا ہے۔ سوائے اس قلیل شاذ کے کہ اگرچہ وہ انتقال کا طالب ہوتا ہے، لیکن وہ اپنے وقت میں اپنے حال پر راضی ہوتا ہے، اور وہ انتقال کا مطالبہ اس لیے کرتا ہے تاکہ وہ جمع ہو جائے۔ اور عالم کی اکثریت انتقال کا مطالبہ صرف اپنے حال پر عدمِ رضا کی وجہ سے کرتی ہے۔ پس تم کسی صالح یا غیر صالح شخص کو نہیں پاؤ گے جو اپنے حال پر راضی ہو۔ یہ وہ امر ہے جو عالم میں سرایت کیے ہوئے ہے۔\n\nاسی باب سے یہ بات بھی ہے کہ تم کسی کو نہیں دیکھتے مگر وہ اپنے زمانے کی مذمت کرتا ہے اور گزرے ہوئے زمانوں کی تعریف کرتا ہے۔ حالانکہ اس کا زمانہ اس کے حال کے سوا کچھ نہیں جب سے یہ نشأۃ (پیدائش) وجود میں آئی ہے۔ اور آدم کے وقت میں بنی آدم کس زمانے میں تھے؟ یہاں تک کہ ذکر کیا گیا ہے کہ آدم نے اپنی زبان میں ایک نظم میں کہا جس کا ترجمہ یہ ہے:\n\nشہر اور ان پر بسنے والے بدل گئے ہیں،\nپس زمین کا چہرہ گرد آلود اور بدصورت ہے۔\n\nپس انسان اپنے دن کی مذمت کرتا ہے اور اپنے گزرے ہوئے کل کی تعریف کرتا ہے، حالانکہ وہ خود وہی انسان ہے، کوئی اور نہیں۔ اور کل بھی وہ اپنے دن کی مذمت کرتا تھا اور اس سے پہلے کے وقت کی تعریف کرتا تھا۔ یہ معاملہ ہمیشہ سے اسی طرح رہا ہے، اور یہ امرِ طبعی (فطری امر) کی وجہ سے ہے، یعنی مذمت کرنا، جیسا کہ انتقال کا مطالبہ شانِ الٰہی کی وجہ سے ہے۔ اور عارفین (العارفون) اپنے اوقات کی مذمت کیے بغیر شانِ الٰہی کی وجہ سے انتقال کا مطالبہ کرتے ہیں۔ جبکہ غیر عارفین طبعاً اپنے اوقات کی مذمت کرتے ہیں اور شانِ الٰہی کی وجہ سے انتقال کا مطالبہ کرتے ہیں جو انہیں اس کے لیے متحرک کرتا ہے، حالانکہ وہ شعور نہیں رکھتے۔\n\nاور اس کی ایک اور عجیب وجہ بھی ہے، یعنی انتقال کا مطالبہ اور مذمت۔ اور وہ یہ ہے کہ انسان تنگی (الضيق) سے بے چینی (القلق) اور اس سے کشادگی (الانفساح) اور رہائی کے مطالبے پر جبلت کیا گیا ہے۔ اور وہ یہ خیال کرتا ہے کہ ہر وہ چیز جو اس سے باہر ہے، اس میں اس تنگی سے کشادگی ہے جس میں وہ ہے۔ یہ اس لیے ہے کہ جب انسان کسی بھی حال میں ہوتا ہے، تو وہ اس حال کے ذریعے مقبوض (گرفت میں) ہوتا ہے کیونکہ وہ حال اسے گھیرے ہوئے ہوتا ہے، یہ لازمی ہے۔ پس وہ خود کو محدود (محصور) پاتا ہے اور وہ دیکھتا ہے کہ جو چیز اس حصر سے باہر ہے وہ کشادگی اور رہائی ہے۔ چونکہ اس کے حال سے باہر کا امر کوئی ایک متعین چیز نہیں ہے، اس لیے معاملہ اس پر تنگ ہو جاتا ہے۔ اسی لیے وہ اپنے موجودہ حال کے علاوہ ہر چیز میں وسعت پاتا ہے۔ لیکن جب وہ اس سے نکلتا ہے تو اس متوہم (خیالی) وسعت سے اسے صرف ایک ہی حال حاصل ہوتا ہے جو اسے گھیر لیتا ہے۔ پس وہ اس میں بھی تنگی پاتا ہے کیونکہ وہ اسے گھیرے ہوئے ہے اور اس میں اسے محدود کر دیا ہے۔ پس وہ اس سے رہائی کا مطالبہ کرتا ہے جیسا کہ اس نے پہلے حال میں کیا تھا۔ پس یہ ہمیشہ اس کا معمول رہتا ہے۔\n\nاور اللہ اسے ہمیشہ ایک اسم سے دوسرے اسم کی طرف نکالتا رہتا ہے۔ پس جس نے اللہ کو ڈھال (وقایۃ) بنا لیا، اللہ اسے تنگی (الضيق) سے نکال دیتا ہے، یعنی اس سے تنگی کو دور کر دیتا ہے۔ پس وہ اسم اللہ کے مدلول میں بغیر کسی تعین کے وسیع ہو جاتا ہے۔ اور اسی لیے اسے وہاں سے رزق ملتا ہے جہاں سے اسے گمان بھی نہیں ہوتا، کیونکہ اس نے قید نہیں لگائی، لہٰذا وہ مقید نہیں ہوا۔ پس ہر وہ چیز جس میں ذات حق (الحق) اسے قائم کرتا ہے، وہ اس کے لیے ہوتی ہے، اور وہ اللہ کی عطا کردہ چیزوں کا احاطہ کرتے ہوئے لوٹتا ہے۔ پس اس کے لیے ہمیشہ وسعت رہتی ہے۔\n\nپس انتقال سب کو شامل ہے، اور رضا اور عدمِ رضا جو تنگی کا سبب بنتے ہیں، اسی میں مخلوق ایک دوسرے سے بڑھ جاتی ہے۔ پس جس نے اللہ سے تقویٰ (اتقی اللہ) اختیار کیا، وہ اس اسم (اللہ) کی وسعت کی طرف نکل جاتا ہے، اور وہ اس اسم اللہ کی وسعت کے ساتھ ایسی وسعت پاتا ہے جس کے بعد کوئی تنگی نہیں۔ اور جس نے اللہ سے تقویٰ اختیار نہیں کیا، وہ صرف ایک ہی وسعت کے حکم کا شہود (الشہود) کرتا ہے، پس وہ ایک تنگی سے دوسری تنگی کی طرف نکلتا ہے۔\n\nاور جو شخص اپنے آپ کو آزمانا چاہے اور معاملے کی جڑ تک پہنچنا چاہے، تو وہ اپنے اندر دیکھے کہ وہ اپنے رزق کے بارے میں کیا علم رکھتا ہے۔ پس اگر وہ اپنے رزق کو نہیں جانتا، تو وہی ہے جو تنگی سے وسعت کی طرف نکلا، اور یہی اللہ تعالیٰ کا قول ہے: \"اور اسے وہاں سے رزق دیتا ہے جہاں سے اسے گمان بھی نہیں ہوتا۔\" (وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ) بعض نے اس بارے میں کہا ہے:\n\nاور جو اللہ سے ڈرتا ہے، وہ اس کے لیے پیدا کر دیتا ہے،\nجیسا کہ اس نے اپنے امر میں فرمایا: نکلنے کی راہ (مَخْرَجاً)۔\n\nاور اسے اس کے گمان کے بغیر رزق دیتا ہے،\nاور اگر کوئی معاملہ اس پر تنگ ہو جائے تو وہ کشادگی دیتا ہے۔\n\nکیونکہ اس (اللہ) نے اسے صرف اپنی عبادت کے لیے پیدا کیا ہے، اور وہ اسے وہاں سے رزق دیتا ہے جہاں سے وہ چاہتا ہے۔ پس وہ اپنے آپ کو اپنے رزق میں مشغول نہ کرے، جیسا کہ وہ اپنی اجل (موت کے وقت) میں مشغول نہیں ہوتا، کیونکہ ان دونوں کا حکم ایک ہی ہے، اور ان دونوں میں کوئی ایک حیوان دوسرے حیوان سے مخصوص نہیں۔ اور جس نے اپنا رزق جان لیا، وہ ہمیشہ تنگی میں رہے گا، کیونکہ وہ عدمِ رضا پر جبلت کیا گیا ہے۔ اور ہم نے یہ اس لیے کہا کہ وہ ہمیشہ تنگی میں رہے گا:\n\nکیونکہ اس کے لیے وہ چیز متعین ہو چکی ہے جس میں سچی نبوی خبر کے ذریعے اضافہ ممکن نہیں۔\n\nپس وہ مرنے تک تنگی کے عذاب میں مبتلا رہتا ہے۔ اور جو نہیں جانتا، وہ رجاء (امید) کی متوہم (خیالی) وسعت میں زندگی گزارتا ہے، پس وہ خوش دلی سے جیتا ہے۔ جب بھی اسے وہاں سے رزق آتا ہے جہاں سے اسے گمان بھی نہیں ہوتا، تو جو چیز وہ نہیں جانتا اس کا انتظار اسے وقت کے حاصل شدہ حکم سے مشغول کر دیتا ہے۔ پس وہ اپنے وقت کی قبض (تنگی) اور ضیق میں ہوتا ہے، لیکن اپنی امید کی بسط (کشادگی) اور وسعت میں ہوتا ہے، کیونکہ امید ہی اس پر حاکم ہے۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے۔ (سورۃ الأحزاب ۳۳:۴)",
    "fa": "باب چهارصد و نود و هشتم در معرفت حال قطبی که منزل او آیه «وَمَن يَتَّقِ اللَّهَ يَجْعَل لَّهُ مَخْرَجًا وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ» (و هر کس از خدا پروا کند، خداوند برای او راه خروجی قرار می‌دهد و او را از جایی که گمان نمی‌برد روزی می‌دهد) بود.\n\n> هر کس که تقوای حق ورزد در تنگی و گشایش *** روزی‌اش از جایی که نداند به او می‌رسد\n> روزی معانی و روزی محسوس، پس به آن راضی باش *** پروردگاری که چون در شب آید، شب به حرکت درآید\n> و در زمان و در غیر زمان، پس به کسی منگر *** که در طبع خود جاری است\n> اگر هستی (الوجود) و اگر دهر نبود *** چشم من به هیچ کس از عالم امر نمی‌نگریست\n\n### [حق (الحق) در هر روز از روزهای دم‌ها (نفس‌ها) در شأنی است]\n\nخداوند عز و جل فرمود: «إِنْ تَتَّقُوا اللَّهَ يَجْعَل لَّكُمْ فُرْقَانًا» (اگر از خدا پروا کنید، برای شما فرقان (قدرت تشخیص حق از باطل) قرار می‌دهد). و این همان قول اوست: «يَجْعَلْ لَهُ مَخْرَجًا» (برای او راه خروجی قرار می‌دهد). پس از آنچه در آن بوده خارج می‌شود و آن را ترک کرده به امری دیگر می‌رود، زیرا خروج به سوی نیستی (عدم) نیست، بلکه خروج از هستی (وجود) به هستی دیگر است. این حال جهان پس از وجود یافتن آن است؛ پس از آن راهی به سوی نیستی نیست. فرمود: «وَإِلَيْهِ تُرْجَعُ الْأُمُورُ» (و امور به سوی او بازگردانده می‌شود)، و او همان هستی حق (الوجود الحق) است. و هر کس این آیه را تصدیق کند، امری است که در جهان ساری شده و همه به آن قائلند، مگر افراد نادر و شاذ که حکمی ندارند. و آن این است که هیچ کس را نمی‌بینی که اصلاً از حال خود در هستی (الوجود) راضی باشد. و این علتی اساسی دارد، و آن این است که حق (الحق) در هر روز از روزهای دم‌ها (نفس‌ها) در شأنی است. پس آن شئونات الهی جهان را به حرکت درمی‌آورد و جهان طلب می‌کند که از آنچه در آن است، هر چه که باشد، به امری دیگر منتقل شود. جز اینکه فرد شاذ و اندک، اگرچه طلب انتقال می‌کند، اما در همان وقت و در طلب انتقالش از حال خود راضی است؛ او طلب می‌کند تا جمع کند. اما بیشتر مردم طلب انتقال نمی‌کنند مگر به دلیل عدم رضایت از حال خود. پس هیچ کس را، نه صالح و نه غیر صالح، نمی‌یابی که از حال خود راضی باشد. این همان چیزی است که در جهان جاری است. و از همین باب است که هیچ کس را نمی‌بینی مگر اینکه زمان خود را مذمت می‌کند و زمان‌های گذشته و سپری شده را می‌ستاید. در حالی که زمان او چیزی جز حال او نیست، از زمانی که این نشئه (نشأة) وجود یافته است. و بنی آدم در زمان آدم در چه زمانی بودند؟ حتی ذکر شده که او در نظمی به زبان خود گفت که ترجمه‌اش این است:\n\n> سرزمین‌ها و هر که بر آنهاست دگرگون شدند *** پس روی زمین غبارآلود و زشت است\n\nپس انسان روز خود را مذمت می‌کند و دیروز خود را می‌ستاید، در حالی که او همان انسان است و نه دیگری. و دیروز نیز روز خود را مذمت می‌کرد و آنچه پیش از آن بود را می‌ستود. این امر همواره چنین بوده است، و این به دلیل امر طبیعی است، یعنی مذمت کردن. همان‌طور که طلب انتقال به دلیل شأن الهی است. عارفان (العارفون) طلب انتقال را به دلیل شأن الهی می‌کنند، بدون اینکه اوقات خود را مذمت کنند. اما غیر عارفان اوقات خود را به طور طبیعی مذمت می‌کنند و طلب انتقال را به دلیل شأن الهی که آنان را به آن حرکت می‌دهد، می‌کنند، در حالی که خود نمی‌دانند. و برای این امر (یعنی طلب انتقال و مذمت) سبب عجیب دیگری نیز هست، و آن این است که انسان بر بی‌قراری از تنگی و طلب گشایش و رهایی از آن سرشته شده است. و گمان می‌کند که هر آنچه خارج از اوست، در آن گشایش از این تنگی که در آن است وجود دارد. و این بدان سبب است که انسان اگر در حالی از احوال باشد، به واسطه احاطه آن حال بر او، مقبوض (گرفته) است و چاره‌ای از آن نیست. پس خود را محصور می‌یابد و آنچه را که خارج از آن حصر است، گشایش و رهایی می‌بیند، زیرا امر خارج از حال او، واحد و معین نیست. پس امر بر او تنگ می‌شود. به همین دلیل، در غیر حال خود که بر آن است، گشایش می‌یابد. اما وقتی خارج می‌شود، از آن گشایش موهوم جز یک حال واحد که او را احاطه می‌کند، نصیبش نمی‌شود. پس در آن نیز تنگی می‌یابد، به دلیل احاطه آن حال و محصور کردن او در آن. پس طلب رهایی از آن می‌کند، همان‌طور که در حال اول طلب کرد. و این همواره عادت اوست. و خداوند او را دائماً و ابداً از اسمی به اسم دیگر خارج می‌کند. پس هر کس خداوند را سپر و وقایه خود قرار دهد، او را از تنگی خارج می‌کند، یعنی تنگی را از او برمی‌دارد. پس در مدلول اسم «الله» بدون تعیین، وسعت می‌یابد. و به همین دلیل، روزی‌اش را از جایی که گمان نمی‌برد (لا یحتسب) به او می‌دهد، زیرا او خود را مقید نکرد، پس مقید نشد. پس هر چیزی که حق (الحق) او را در آن قرار دهد، برای اوست. پس بازمی‌گردد در حالی که به آنچه خداوند به او داده است، احاطه دارد. پس او دائماً و ابداً در گشایش است. بنابراین، انتقال شامل همه می‌شود، اما رضایت و عدم رضایت که موجب تنگی است، همان چیزی است که خلق در آن با هم تفاوت دارند. پس هر کس از خدا پروا کند، به گشایش این اسم (الله) خارج می‌شود و به وسعت این اسم «الله» چنان وسعتی می‌یابد که پس از آن تنگی نیست. و هر کس از خدا پروا نکند، جز حکم یک گشایش واحد را شهود نمی‌کند، پس از تنگی به تنگی دیگر خارج می‌شود. و هر کس بخواهد خود را بیازماید و به اصل امر برسد، باید در خود بنگرد که علم او به روزی‌اش چیست. اگر روزی خود را نداند، او همان کسی است که از تنگی به گشایش خارج شده است، و این همان قول خداوند متعال است: «وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ» (و او را از جایی که گمان نمی‌برد روزی می‌دهد). برخی در این باره گفته‌اند:\n\n> و هر کس از خدا پروا کند، خداوند برای او قرار می‌دهد *** چنان که فرمود، از امر خود راه خروجی\n> و او را از غیر گمانش روزی می‌دهد *** و اگر امری بر او تنگ شود، گشایش می‌یابد\n\nزیرا خداوند او را جز برای عبادت خود سبحانه و تعالی نیافریده است، و او از هر جا که بخواهد روزی‌اش می‌دهد. پس نباید خود را به روزی‌اش مشغول کند، همان‌طور که خود را به اجلش مشغول نمی‌کند، زیرا حکم این دو یکی است و هیچ حیوانی بر دیگری در این دو امر اختصاص ندارد. و هر کس روزی خود را بداند، همواره در تنگی است، زیرا بر عدم رضایت سرشته شده است. و اینکه گفتیم همواره در تنگی است، به این دلیل است که آنچه قابل افزایش نیست، به واسطه خبر صادق نبوی برای او معین شده است. پس تا زمان مرگ با تنگی معذب می‌ماند. اما کسی که نمی‌داند، در گشایش موهوم، یعنی گشایش امید، زندگی می‌کند و با روحیه‌ای خوش زندگی می‌کند. پس هر روزی‌ای که از جایی که گمان نمی‌برد به او می‌رسد، انتظار آنچه را که نمی‌داند، او را از حکم آنچه در وقت حاصل است، بازمی‌دارد. پس او در قبض و تنگی وقت خود است، اما در بسط و گشایش آرزوی خود، زیرا آرزو بر او حاکم است. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را نشان می‌دهد)."
  },
  "page_count": 2
}