{
  "id": 173,
  "title": {
    "ar": "الباب الثالث والسبعون ومائة في معرفة مقام الشرك وهو التثنية",
    "en": "Chapter One Hundred and Seventy-Three: Concerning the Gnosis of the Station of Association (*shirk*), which is Duality (التثنية).",
    "ur": "باب ایک سو تہتر (۱۷۳): شرک کے مقام کی معرفت میں، اور وہ تثنیہ (التثنية) ہے۔",
    "fa": "باب صد و هفتاد و سوم در معرفت مقام شرک که همان تثنیه است"
  },
  "content": {
    "ar": "## (الباب الثالث والسبعون ومائة في معرفة مقام الشرك وهو التثنية)\n\n\n> الشرك في الأسماء لا يجهل *** عليه أهل الكشف قد عولوا\n\n\n> قالُوا وما الرَّحْمنُ قلنا لهم *** هو الإله الحكم الأول‏\n\n\n> لا فرق بين الله في كونه *** دل على الذات وما يسأل‏\n\n\n> به من الأسماء في كل ما *** يلفظه اللافظ أو يعقل‏\n\n\n> والشرك محمود على بابه *** عند الذي يعلم أو يجهل‏\n\n\n> هو الوجود المحض لا يمتري *** فيه إمام حكمه فيصل‏\n\n\n> وإنما المذموم منه الذي *** أثبته في عقده المبطل‏\n\n\n### [إن الله تعالى من حيث ذاته فهو الواحد الأحد]\n\n\nقال الله تعالى قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏ فاعلم إن الله تعالى من حيث ذاته فهو الواحد الأحد وقال ولِلَّهِ الْأَسْماءُ الْحُسْنى‏ فَادْعُوهُ بِها فإذا دعوته عرفت من يجيبك وما يجيبك هل يجيبك من حيث ذاته أو من حيث نسبة يطلبها ذلك الاسم ما هي عين الذات ولا يجيبك تعالى مع ارتفاع وجود تلك النسبة فإذا عرفت هذا عرفت أمورا كثيرة في عين واحدة لا تعقل الذات عند الدعاء بهذه الأسماء دون هذه النسب ولا تعقل النسب دون هذه الذات فإذا قلت يا عليم علمت إن معقوله خلاف معقول يا قدير وكذلك يا مريد ويا سميع ويا بصير ويا شكور ويا حي ويا قيوم ويا غني إلى ما شئت من الأسماء الحسنى فهذه النسب وإن كثرت فالمسمى واحد والمنسوب إليه هذه النسب واحد فإذا لا تعقل الكثرة في هذا الواحد إلا هكذا فكل اسم قد شارك الاسم الآخر وغيره من الأسماء الإلهية في دلالته على الذات مع معقولية حقيقة كل اسم إنها مغايرة لمعقولية غيره من الأسماء وتميز كل واحد منها عن صاحبه واشتراكهم في ذات المسمى وليست هذه الأسماء لغير من تسمى بها فالأسماء الإلهية مترادفة من وجه متباينة من وجه مشتبهة من وجه فالمترادفة كالعالم والعلام والعليم وكالعظيم والجبار والكبير والمشتبهة كالعليم والخبير والمحصي والمتباينة كالقدير والحي والسميع والمريد والشكور وأما الضرب الآخر من الشركة في إيجاد العالم فهو باستعداد الممكن لقبول تأثير القدرة فيه إذ المحال لا يقبل ذلك فما استقلت القدرة بالإيجاد دون استعداد الممكن ولا استقل استعداد الممكن دون القدرة الإلهية بالإيجاد وهذا سار في كل ممكن ثم اشتراك آخر خصوص في بعض الممكنات وهو إذا أراد إيجاد العرض فلا بد من الاقتدار الإلهي والإرادة الإلهية لتخصيص ذلك العرض المعين ولا بد من العلم به حتى يقصده بالتخصيص ولا بد من استعداد ذلك المراد لقبول الإيجاد ولا بد من وجود المحل لصحة إيجاد ذلك العرض إذ كان من حقيقته أنه لا يقوم بنفسه فلا بد له من محل يقوم به ولا بد لذلك المحل أن يكون على استعداد يقبل وجود ذلك العرض فيه وهذا كله ضرب من الشركة في الفعل فهذا معنى الشركة والكثرة المطلوبة في الإلهيات في هذا الباب ولا يحتمل هذا الباب أكثر مما أومأنا إليه من هذه الأصول وتلخيص هذا الباب إن كل أمر يطلب القسمة فلا يصح‏\nفيه توحيد وأعمه المعلوم فنقول المعلومات تنقسم بوجه إلى ثلاثة أقسام إلى واجب وجائز ومستحيل ثم ما من شي‏ء نذكره بعد هذا من موجود ومعدوم وغير ذلك إلا ويقبل القسمة فأين التوحيد في كل مذكور أو معلوم فلم يبق إلا توحيد الكثرة في معلوم معين يسمى الله وهو الذي ينبغي أن يكون على كذا وكذا وتذكر ما لا تصح الألوهية إلا به وحينئذ يصح أن يكون الله ولا يشاركه في هذه الصفات بمجموعها واحد آخر فذلك يعني بقوله واحد بأحدية هذا المجموع مع أحدية العين والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 173: Concerning the Knowledge of the Station of Association (الشرك), which is Duality (التثنية)\n\nDuality in the Names is not unknown;\nUpon it the People of Unveiling (أهل الكشف) have relied.\n\nThey asked, \"And what is the All-Merciful?\" We replied to them:\n\"He is the God, the Judge, the First.\"\n\nThere is no distinction concerning Allah in His Being,\nWhich indicates the Essence (الذات) and is not questioned.\n\nBy Him are the Names in everything\nThat the speaker utters or comprehends.\n\nAnd Association (الشرك) is praiseworthy at its door,\nWhether for the one who knows or the one who is ignorant.\n\nIt is Pure Being (الوجود المحض), in which no leader doubts,\nWhose judgment is decisive.\n\nBut the blameworthy aspect of it is that which\nThe invalidator establishes in his creed.\n\n### [Indeed, Allah, Exalted is He, in terms of His Essence, is the One, the Unique (الواحد الأحد)]\n\nAllah, Exalted is He, said: <<قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏>> (Say: Call upon Allah or call upon the All-Merciful. Whichever you call upon—to Him belong the Most Beautiful Names). Know that Allah, Exalted is He, in terms of His Essence (الذات), is the One, the Unique (الواحد الأحد). And He said: <<ولِلَّهِ الْأَسْماءُ الْحُسْنى‏ فَادْعُوهُ بِها>> (And to Allah belong the Most Beautiful Names, so invoke Him by them).\n\nWhen you invoke Him, you know who answers you and what answers you: Does He answer you from the perspective of His Essence, or from the perspective of a relation (نسبة) that Name demands—a relation which is not the Essence itself? And He, Exalted is He, does not answer you if the existence of that relation ceases.\n\nIf you know this, you have known many matters within a single entity. The Essence (الذات) is not intelligible when invoking these Names without these relations (نسب), nor are the relations intelligible without this Essence. Thus, when you say, \"O All-Knowing (يا عليم),\" you know that its concept is different from the concept of \"O All-Powerful (يا قدير),\" and likewise for \"O Willing (يا مريد),\" \"O All-Hearing (يا سميع),\" \"O All-Seeing (يا بصير),\" \"O All-Thankful (يا شكور),\" \"O Living (يا حي),\" \"O Self-Subsisting (يا قيوم),\" \"O Self-Sufficient (يا غني),\" and whatever else you wish from the Most Beautiful Names.\n\nAlthough these relations are numerous, the Named One (المسمى) is single, and the One to whom these relations are ascribed is single. Therefore, multiplicity (الكثرة) in this One is only intelligible in this manner. Every Name shares with the other Names and the rest of the Divine Names in its indication of the Essence, while the intelligibility of the reality (حقيقة) of each Name is distinct from the intelligibility of the others, and each one is distinguished from its companion, yet they share in the Essence of the Named One. These Names do not belong to anyone other than the One who is named by them.\n\nThus, the Divine Names (الأسماء الإلهية) are synonymous from one perspective, distinct from another perspective, and analogous from yet another perspective. The synonymous ones are like the All-Knower (*al-ʿĀlim*), the Great Knower (*al-ʿAllām*), and the All-Knowing (*al-ʿAlīm*); and like the Magnificent (*al-ʿAẓīm*), the Compeller (*al-Jabbār*), and the Great (*al-Kabīr*). The analogous ones are like the All-Knowing (*al-ʿAlīm*), the All-Aware (*al-Khabīr*), and the Reckoner (*al-Muḥṣī*). The distinct ones are like the All-Powerful (*al-Qadīr*), the Living (*al-Ḥayy*), the All-Hearing (*al-Samīʿ*), the Willing (*al-Murīd*), and the All-Thankful (*al-Shakūr*).\n\nAs for the other type of association (شركة) in the creation of the World (العالم), it lies in the preparedness of the contingent (الممكن) to accept the influence of Power (القدرة) within it, since the impossible does not accept that. Thus, Power did not act independently in creation without the preparedness of the contingent, nor did the preparedness of the contingent act independently in creation without the Divine Power (القدرة الإلهية). This principle applies to every contingent thing.\n\nThen there is another specific association (اشتراك) in certain contingent things. When He wills the creation of an accident (العرض), there must be Divine Capability (الاقتدار الإلهي) and Divine Will (الإرادة الإلهية) to specify that particular accident. There must also be Knowledge (العلم) of it so that He intends it through specification. Furthermore, there must be the preparedness of that willed thing to accept creation, and the existence of the locus (المحل) is necessary for the validity of creating that accident, since it is inherent in its reality that it does not subsist by itself. Therefore, it requires a locus in which it subsists. And that locus must possess a preparedness that accepts the existence of that accident within it. All of this is a type of association (شركة) in the Act (الفعل).\n\nThis, then, is the meaning of association and the required multiplicity (الكثرة) in Divine matters (الإلهيات) discussed in this chapter. This chapter cannot bear more than what we have alluded to concerning these principles (أصول).\n\nThe summary of this chapter is that every matter that demands division, Oneness (توحيد) is not valid within it. The most general of these is the known thing (المعلوم). We say that known things are divided in one respect into three categories: the Necessary (واجب), the Contingent (جائز), and the Impossible (مستحيل). Furthermore, there is nothing we mention after this—whether existent (موجود), non-existent (معدوم), or otherwise—except that it accepts division. So, where is Oneness in everything mentioned or known?\n\nThere remains only the Oneness of Multiplicity (توحيد الكثرة) in a specific known thing called Allah—He who must be such-and-such, and you mention that without which Divinity (الألوهية) is not valid. At that point, it is valid for Him to be Allah, and no other single entity shares in these attributes in their totality. That is what is meant by His saying: \"One by the Uniqueness (أحدية) of this totality, along with the Uniqueness of the Entity (العين).\" And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (speaks the Truth, and He guides to the way).",
    "ur": "(باب ایک سو تہتر: مقامِ شرک کی معرفت میں، اور وہ تثنیہ ہے)\n\nاسماء میں شرک سے کوئی ناواقف نہیں\nاہل کشف (الکشف) نے اسی پر بھروسہ کیا ہے۔\n\nانہوں نے کہا: \"رحمٰن کیا ہے؟\" ہم نے انہیں جواب دیا:\n\"وہ الہ (ذات حق) ہے، حاکم ہے، اول ہے۔\"\n\nاللہ کے ہونے میں کوئی فرق نہیں،\nوہ ذات (الذات) پر دلالت کرتا ہے اور اس سے سوال نہیں کیا جاتا۔\n\nاس کے ذریعے اسماء میں، ہر اس چیز میں\nجسے بولنے والا بولتا ہے یا عقل میں لاتا ہے۔\n\nاور شرک اس کے دروازے پر قابل تعریف ہے،\nاس کے نزدیک جو جانتا ہے یا جو نہیں جانتا۔\n\nوہ وجود محض (الوجود) ہے، اس میں کوئی شک نہیں کرتا،\nایسا امام جس کا حکم فیصلہ کن ہو۔\n\nاور اس میں سے صرف وہ مذموم ہے\nجسے باطل شخص نے اپنے عقیدے میں ثابت کیا۔\n\n### [بے شک اللہ تعالیٰ اپنی ذات (الذات) کے اعتبار سے واحد احد ہے]\n\nاللہ تعالیٰ نے فرمایا:\n**قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏**\n(کہہ دیجیے: اللہ کو پکارو یا رحمٰن کو پکارو، جس نام سے بھی پکارو، اسی کے لیے سب اچھے نام ہیں)۔\nپس جان لو کہ اللہ تعالیٰ اپنی ذات (الذات) کے اعتبار سے واحد احد ہے۔ اور فرمایا:\n**ولِلَّهِ الْأَسْماءُ الْحُسْنى‏ فَادْعُوهُ بِها**\n(اور اللہ ہی کے لیے اچھے نام ہیں، سو تم اسے انہی ناموں سے پکارو)۔\nجب تم اسے پکارتے ہو تو تم جان لیتے ہو کہ تمہیں کون جواب دے رہا ہے اور کیا جواب دے رہا ہے۔ کیا وہ تمہیں اپنی ذات (الذات) کے اعتبار سے جواب دے رہا ہے یا اس نسبت کے اعتبار سے جسے وہ اسم طلب کرتا ہے، جو عین ذات (الذات) نہیں ہے؟ اور وہ نسبت کے وجود کے ختم ہونے کے ساتھ تمہیں جواب نہیں دیتا۔ جب تم یہ جان لیتے ہو تو تم ایک ہی عین میں بہت سے امور کو جان لیتے ہو۔ ان نسبتوں کے بغیر ان اسماء کے ذریعے پکارنے پر ذات (الذات) کا تصور نہیں کیا جا سکتا، اور نہ ہی اس ذات (الذات) کے بغیر نسبتوں کا تصور کیا جا سکتا ہے۔\n\nپس جب تم \"یا علیم\" کہتے ہو، تو تم جانتے ہو کہ اس کا مفہوم \"یا قدیر\" کے مفہوم سے مختلف ہے۔ اور اسی طرح \"یا مرید\"، \"یا سمیع\"، \"یا بصیر\"، \"یا شکور\"، \"یا حی\"، \"یا قیوم\"، \"یا غنی\" اور دیگر اسماء حسنیٰ جنہیں تم چاہو۔ یہ نسبتیں اگرچہ کثیر ہیں، لیکن مسمیٰ (جسے نام دیا گیا) ایک ہے اور جس کی طرف یہ نسبتیں منسوب ہیں وہ بھی ایک ہے۔ لہٰذا، اس واحد میں کثرت کا تصور صرف اسی طرح کیا جا سکتا ہے۔ پس ہر اسم دوسرے اسم اور دیگر اسماء الٰہیہ کے ساتھ ذات (الذات) پر دلالت کرنے میں شریک ہے، اس کے باوجود کہ ہر اسم کی حقیقت کا مفہوم دوسرے اسماء کے مفہوم سے مختلف ہے، اور ان میں سے ہر ایک اپنے ساتھی سے ممتاز ہے، جبکہ وہ مسمیٰ کی ذات (الذات) میں شریک ہیں۔ اور یہ اسماء اس کے علاوہ کسی اور کے لیے نہیں ہیں جس نے ان سے اپنا نام رکھا ہے۔ پس اسماء الٰہیہ ایک پہلو سے مترادف (ہم معنی)، ایک پہلو سے متباین (مختلف)، اور ایک پہلو سے مشتبہ (ملتے جلتے) ہیں۔\n\nپس مترادف (ہم معنی) اسماء جیسے العالم، العلام، اور العلیم ہیں، اور جیسے العظیم، الجبار، اور الکبیر ہیں۔ اور مشتبہ (ملتے جلتے) اسماء جیسے العلیم، الخبیر، اور المحصی ہیں۔ اور متباین (مختلف) اسماء جیسے القدیر، الحی، السمیع، المرید، اور الشکور ہیں۔\n\nاور عالم کی ایجاد میں شرکت (الشرکۃ) کی دوسری قسم ممکن (الممکن) کے اس استعداد سے ہے کہ وہ قدرت کے اثر کو قبول کرے۔ کیونکہ محال (ناممکن) اسے قبول نہیں کرتا۔ پس قدرت، ممکن کے استعداد کے بغیر ایجاد میں خود مختار نہیں ہوئی، اور نہ ہی ممکن کا استعداد، قدرت الٰہیہ کے بغیر ایجاد میں خود مختار ہوا۔ اور یہ ہر ممکن میں جاری ہے۔ پھر ایک اور شرکت ہے جو خاص طور پر بعض ممکنات میں پائی جاتی ہے، اور وہ یہ ہے کہ جب وہ کسی عرض (عارضی صفت) کو ایجاد کرنا چاہتا ہے، تو اس مخصوص عرض کی تخصیص کے لیے اقتدار الٰہی اور ارادہ الٰہی کا ہونا ضروری ہے۔ اور اس کا علم ہونا بھی ضروری ہے تاکہ وہ تخصیص کے ذریعے اس کا قصد کرے۔ اور اس مراد (جس کا ارادہ کیا گیا) کا ایجاد کو قبول کرنے کے لیے استعداد ہونا بھی ضروری ہے۔ اور اس عرض کی ایجاد کی صحت کے لیے محل (جگہ) کا وجود بھی ضروری ہے، کیونکہ اس کی حقیقت یہ ہے کہ وہ خود قائم نہیں رہ سکتا، لہٰذا اسے کسی محل کی ضرورت ہے جس پر وہ قائم ہو۔ اور اس محل کا بھی ایسے استعداد پر ہونا ضروری ہے جو اس عرض کے وجود کو اپنے اندر قبول کرے۔ یہ سب فعل میں شرکت (الشرکۃ) کی ایک قسم ہے۔ پس یہ اس باب میں الٰہیات میں مطلوبہ شرکت اور کثرت کا مفہوم ہے۔\n\nاور یہ باب ان اصولوں سے زیادہ کا متحمل نہیں ہے جن کی طرف ہم نے اشارہ کیا ہے۔ اور اس باب کا خلاصہ یہ ہے کہ ہر وہ امر جو تقسیم کا تقاضا کرتا ہے، اس میں توحید (التوحید) صحیح نہیں ہو سکتی، اور ان میں سب سے عام معلوم (المعلوم) ہے۔ پس ہم کہتے ہیں کہ معلومات ایک پہلو سے تین اقسام میں تقسیم ہوتی ہیں: واجب، جائز، اور مستحیل (ناممکن)۔ پھر اس کے بعد ہم جو بھی چیز ذکر کرتے ہیں، خواہ وہ موجود ہو یا معدوم یا کوئی اور، وہ تقسیم کو قبول کرتی ہے۔ تو ہر مذکور یا معلوم میں توحید کہاں ہے؟ پس صرف ایک معین معلوم میں کثرت کی توحید (التوحید) باقی رہتی ہے جسے اللہ کہا جاتا ہے، اور وہ وہی ہے جسے ایسا اور ایسا ہونا چاہیے، اور تم ان صفات کو ذکر کرتے ہو جن کے بغیر الوہیت صحیح نہیں ہو سکتی۔ اور تب ہی یہ صحیح ہوتا ہے کہ وہ اللہ ہے، اور کوئی دوسرا اس کے ساتھ ان صفات کے مجموعے میں شریک نہیں ہوتا۔ پس یہی اس کے قول کا مطلب ہے کہ وہ اس مجموعے کی احدیت کے ساتھ ساتھ عین (العین) کی احدیت کے ساتھ واحد ہے۔\n**والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏**\n(اور اللہ حق فرماتا ہے اور وہی سیدھا راستہ دکھاتا ہے)۔",
    "fa": "## (باب صد و هفتاد و سوم در معرفت مقام شرک که همان تثنیه است)\n\nشرک در اسماء مجهول نیست *** اهل کشف بر آن اعتماد کرده‌اند\n\nگفتند: «رحمن چیست؟» گفتیمشان *** اوست خدای حاکم اول\n\nدر هستی او (الحق) تفاوتی نیست *** که بر ذات دلالت کند و مورد سؤال واقع نشود\n\nبه واسطه اوست که از اسماء در هر آنچه *** گوینده بر زبان می‌آورد یا تعقل می‌کند، بهره می‌برد\n\nو شرک بر درگاهش ستوده است *** نزد کسی که می‌داند یا نمی‌داند\n\nاو وجود محض (الوجود المحض) است و در آن شک نیست *** امامی که حکمش قاطع است\n\nو مذموم از آن، تنها آن چیزی است *** که باطل‌کننده در اعتقاد خود ثابت کرده است\n\n### [همانا خداوند متعال از حیث ذات، واحد و احد است]\n\nخداوند متعال فرمود: **قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏** (بگو: «الله را بخوانید یا رحمن را بخوانید، هر کدام را بخوانید، پس نیکوترین نام‌ها از آن اوست»). پس بدان که خداوند متعال از حیث ذات، واحد احد است. و فرمود: **وَلِلَّهِ الْأَسْماءُ الْحُسْنى‏ فَادْعُوهُ بِها** (و نیکوترین نام‌ها از آن خداست، پس او را با آن‌ها بخوانید).\n\nهنگامی که او را می‌خوانی، می‌دانی چه کسی به تو پاسخ می‌دهد و چه چیزی به تو پاسخ می‌دهد؛ آیا از حیث ذاتش به تو پاسخ می‌دهد یا از حیث نسبتی که آن اسم طلب می‌کند و عین ذات نیست؟ و او تعالی با از میان رفتن وجود آن نسبت به تو پاسخ نمی‌دهد.\n\nهنگامی که این را دانستی، امور بسیاری را در یک عین واحد خواهی شناخت. ذات را هنگام خواندن با این اسماء بدون این نسبت‌ها تعقل نمی‌کنی، و نسبت‌ها را بدون این ذات تعقل نمی‌کنی. پس وقتی می‌گویی: «یا علیم (ای دانا)»، می‌دانی که معقول آن خلاف معقول «یا قدیر (ای توانا)» است، و همچنین «یا مرید (ای اراده‌کننده)»، «یا سمیع (ای شنوا)»، «یا بصیر (ای بینا)»، «یا شکور (ای سپاسگزار)»، «یا حی (ای زنده)»، «یا قیوم (ای پاینده)»، «یا غنی (ای بی‌نیاز)» و هر آنچه از اسماء حسنی که بخواهی.\n\nاین نسبت‌ها اگرچه متعددند، اما مسمّا یکی است و منسوبٌ‌الیه این نسبت‌ها یکی است. بنابراین، کثرت در این واحد جز به این صورت تعقل نمی‌شود. پس هر اسمی در دلالت بر ذات، با اسم دیگر و سایر اسماء الهی شریک است، در حالی که معقولیت حقیقت هر اسم مغایر با معقولیت غیر آن از اسماء است و هر یک از دیگری متمایز است، و در ذات مسمّا مشترک هستند. و این اسماء برای غیر کسی که به آن‌ها نامیده شده نیست.\n\nپس اسماء الهی از جهتی مترادف، از جهتی متباین و از جهتی مشتبه هستند. مترادف‌ها مانند: العالم (دانا)، العلام (بسیار دانا) و العلیم (دانا)؛ و مانند: العظیم (بزرگ)، الجبار (جبار) و الکبیر (بزرگ). مشتبه‌ها مانند: العلیم (دانا)، الخبیر (آگاه) و المحصی (شمارنده). و متباین‌ها مانند: القدیر (توانا)، الحی (زنده)، السمیع (شنوا)، المرید (اراده‌کننده) و الشکور (سپاسگزار).\n\nاما نوع دیگر از شرکت در ایجاد عالم، به واسطه استعداد ممکن برای پذیرش تأثیر قدرت در آن است، زیرا محال آن را نمی‌پذیرد. پس نه قدرت بدون استعداد ممکن به تنهایی به ایجاد استقلال یافته است و نه استعداد ممکن بدون قدرت الهی به ایجاد استقلال یافته است. و این در هر ممکنی جاری است.\n\nسپس شرکت دیگری وجود دارد که مخصوص برخی ممکنات است، و آن این است که وقتی اراده ایجاد عَرَض (کیفیت) می‌شود، ناگزیر از اقتدار الهی و اراده الهی برای تخصیص آن عَرَض معین است، و ناگزیر از علم به آن است تا آن را به تخصیص قصد کند، و ناگزیر از استعداد آن مراد برای پذیرش ایجاد است، و ناگزیر از وجود محل برای صحت ایجاد آن عَرَض است، زیرا از حقیقت آن است که به خودی خود قائم نیست، پس به محلی نیاز دارد که به آن قائم شود، و آن محل باید بر استعدادی باشد که وجود آن عَرَض را در خود بپذیرد. و همه این‌ها نوعی از شرکت در فعل است.\n\nاین معنای شرکت و کثرت مطلوب در الهیات در این باب است، و این باب بیش از آنچه به این اصول اشاره کردیم، ظرفیت ندارد.\n\nخلاصه این باب این است که هر امری که طلب قسمت کند، توحید در آن صحیح نیست. و عام‌ترین آن، معلوم است. پس می‌گوییم معلومات از جهتی به سه قسم تقسیم می‌شوند: واجب، جایز و مستحیل. سپس هیچ چیزی که پس از این ذکر می‌کنیم، از موجود و معدوم و غیر آن، نیست مگر اینکه قسمت را می‌پذیرد. پس توحید در هر مذکوری یا معلومی کجاست؟\n\nپس باقی نمی‌ماند مگر توحید کثرت در معلوم معینی که «الله» نامیده می‌شود، و او کسی است که شایسته است بر فلان و فلان باشد، و آنچه را که الوهیت جز با آن صحیح نیست، ذکر می‌کنی. و در آن هنگام صحیح است که او «الله» باشد و هیچ کس دیگری در مجموع این صفات با او شریک نباشد. این همان معنای سخن اوست که می‌گوید: واحد به احدیت این مجموع همراه با احدیت عین. **وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 2
}