{
  "id": 340,
  "title": {
    "ar": "الباب الأربعون وثلاثمائة في معرفة المنزل الذي منه خبا النبي صَلَّى اللهُ عَليهِ وسَلَّم لابن صياد سورة الدخان",
    "en": "Chapter Three Hundred and Forty: Concerning the Gnosis of the Station (المنزل) from which the Prophet (peace and blessings be upon him) concealed himself from Ibn Sayyad, [and its relation to] Surah Ad-Dukhan.",
    "ur": "باب تین سو چالیس: اس منزل کی معرفت (معرفة) میں جہاں سے نبی صلی اللہ علیہ وسلم نے ابن صیاد سے خود کو پوشیدہ کیا، سورۃ الدخان (سورة الدخان) کے ذریعے۔",
    "fa": "باب سیصد و چهلم در معرفت منزلی که پیامبر (صلی الله علیه و سلم) از آنجا برای ابن صیاد پنهان شد، سوره دخان."
  },
  "content": {
    "ar": "## «الباب الأربعون وثلاثمائة في معرفة المنزل الذي منه خبا النبي صَلَّى اللهُ عَليهِ وسَلَّم لابن صياد سورة الدخان»\n\n\n### [إن الله عصم نبيه صَلَّى اللهُ عَليهِ وسَلَّم عن القول ولم يخرجه العلم بالخبيئة عن كونه كاهنا]\n\n\nمن القرآن العزيز\n\n\nفقال له ما خبأت لك فقاله الدخ وهو لغة في الدخان لأن فيها آية يَوْمَ تَأْتِي السَّماءُ بِدُخانٍ مُبِينٍ فعلم ابن صياد اسمها الذي نواه وأضمره في نفسه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في خبئه فقال له صَلَّى اللهُ عَليهِ وسَلَّم اخسأ فلن تعدو قدرك أي علمك بهذا لا يخرجك عن قدرك الذي أهلك الله له وقد روى فلم تعد قدرك‏\n\n\nيعني بإدراكك لما خبأته لك وفي هذا القول سر يطلعك إياه هذا القول من النبي صَلَّى اللهُ عَليهِ وسَلَّم لصاف على المقام الذي أوجب على رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أن يقول مثل هذا القول له فإنه لم يختبره بما خبأ له عن وحي من الله فلو كان عن وحي ما عثر عليه ابن صائد لأن الله من وراء ما يأمر به بالتأييد بل كان هذا القول مثل قوله صَلَّى اللهُ عَليهِ وسَلَّم في إبار النخل فلما خرج خبؤه كان ذلك من الله تأديب فعل ليحفظ عليه مقام المراقبة فلا ينطق إلا عن شهود إذ بقرينة الحال يعلم أن النبي صَلَّى اللهُ عَليهِ وسَلَّم ما خبأ له ما خبا إلا ليعجزه فأبى الله ذلك‏\n\n\nفقال صَلَّى اللهُ عَليهِ وسَلَّم إن الله أدبني‏\nفأحسن تأديبي‏\n\n\nولو نطق النبي صَلَّى اللهُ عَليهِ وسَلَّم للحاضرين بقصده فيما خبا له لارتدت جماعة من الحاضرين لذلك ولكن الله عصم نبيه صَلَّى اللهُ عَليهِ وسَلَّم عن القول ولم يخرجه العلم بالخبيئة عن كونه كاهنا والحاضرون يعرفون أمر الكهنة وشأنهم ولا سيما أهل اليمن والحجاز وجزيرة العرب فلم يخرجه ذلك العلم عن قدره عند الحاضرين وفي هذه المسألة أمور عظيمة يتسع الشرح فيها إلى أمر عظيم‏\n\n\n> ترك الرضي لا يكون *** إلا لمن هو دون‏\n\n\n> فإن يكن لك حالا *** فكل صعب يهون‏\n\n\n> وإن أبيت رضاه *** فما يشاء يكون‏\n\n\nهذا المنزل منه خبا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لابن صياد سورة الدخان من القرآن وهو منزل عظيم فيه من المكر الإلهي والاستدراج ما لا تأمن مع العلم به الملائكة من مكر الله فالعاقل إذا لم يكن من أهل الاطلاع في تصرفاته فلا أقل من أنه لا يزيل الميزان المشروع له الوزن به في تصرفاته من يده بل من يمينه فيحفظه في نفس الأمر من هذا المكر ولا يخرج عن لوازم عبوديته وأحكامها طرفة عين يعطي من الزيادات في العلوم والأمور ما لا عين رأت ولا أذن سمعت ولا خطر على بال ممكن يكون العروج إليه من الأرواح المفارقة وغيرها منه تبدو العلامات على صدق الصادق وكذب الكاذب من حصل فيه حصل علم الحكمة الجامعة وتميز له الشقي من السعيد فيه تختلف أحوال الناظرين فما يراه زيد نورا يراه عمرو ظلمة ويراه جعفر نورا وظلمة معا فإنه يكشف به الأشياء فيقول هذا نور ويبصره من حيث عينه فيقول ظلمة فيه تكون المنازلات كلها يلتقي فيه الحق النازل والخلق الصاعد فيقول الحق للصاعد إلى أين فيقول إليك ويقول الخلق للنازل إلى أين فيقول إليك فيقول قد التقينا فتعال حتى يعين كل واحد منا ما السبب الذي أوجب لكل واحد منا طلب صاحبه فيقول الحق قصدت بالنزول إليك لنريحك من التعب فنعطيك ونهبك من غير مشقة ولا نصب وأنت في أهلك مستريح لم يكن لي قصد غير هذا ويقول الخلق قصدت بالعروج إليك تعظيما لك وخدمة لنقف بين يديك وأنت على سرير ملكك وقد علم الملأ الأعلى أني خليفتك وأني أعلم بك منهم لما خصصتني به فإذا رآني الملأ الأعلى بين يديك اقتدوا بي فيما أقوم به بين يديك مما ينبغي لمثلي أن يتأدب معك به فيحصل لهم بالمشاهدة من علم الأدب معك ما لم يكن عندهم لأني رأيتهم جاهلين بمنزلتك مع كونهم يسبحونك لا يفترون تقول لهم إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً فيعارضونك فيه بما حكيت لي عنهم أنهم قالوا ولم يكن ينبغي لهم إلا السمع كما لك الأمر فلما علمت إن الأدب الإلهي ما استحكم فيهم وقد أمرتني بتعليمهم ورأيت أن التعليم بالحال والفعل أتم منه بالقول والعمارة قصدت العروج إليك ليرى الملأ الأعلى بالحال والفعل ما ينبغي أن يعامل به جلالك والاستواء أشرف حال ظهرت به إلى خلقك ومع ذلك اعترضوا عليك فكيف لو نزلت إلى‏\n\n\nأدنى من حالة الاستواء من سماء وأرض فيقول الحق نعم ما قصدت مثلك من يقدر قدر الأشياء فإنه من عرف قدره وقدر الأشياء عرف قدري وو فاني حقي أ لا ترى محمدا صَلَّى اللهُ عَليهِ وسَلَّم لما فرضت عليه وعلى أمته خمسين صلاة نزل بها ولم يقل شيئا ولا اعترض ولا قال هذا كثير فلما نزل إلى موسى عليه السلام فقال له راجع ربك عسى إن يخفف عن أمتك فإني قاسيت من بنى إسرائيل في ذلك أهوالا وأمتك تعجز عن حمل مثل هذا وتسأم منه فبقي محمد صَلَّى اللهُ عَليهِ وسَلَّم متحيرا الأدب الكامل يعطيه ما فعل من عدم المعارضة والشفقة على أمته تطلبه بالتخفيف عنها حتى لا يعبد الله بضجر ولا كره ولا ملل ولا كسل فبقي حائرا فهذا ما أثرت الوسائط والجلساء فأخذ يطلب الترجيح فيما قاله موسى عليه السلام وفيما وفى هو صَلَّى اللهُ عَليهِ وسَلَّم من حق الأدب مع الله وقد كان الله تقدم إليه عند ذكر جماعة من الأنبياء عليه السلام منهم موسى عليه السلام بأن قال له أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ فتأول إن هذا الذي أشار به عليه من هداهم ولم يتفطن في الوقت إن موسى عليه السلام لما كان في حال هداه ما سأل التخفيف وذلك الهدى هو الذي أمر رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أن يقتدي به فأعطاه هذا الاجتهاد الرجوع إلى الله فسأله التخفيف فما زال يرجع بين الله تعالى وبين موسى عليه السلام إلى أن قال ما أعطاه الأدب استحييت من ربي وانتهى الأمر\nبالتخفيف إلى العشر فنزل به على أمته وشرع له أن يشرع لأمته الاجتهاد في الأحكام التي بها صلاح العالم لأنه صَلَّى اللهُ عَليهِ وسَلَّم بالاجتهاد رجع بين الله وبين موسى عليه السلام فأمضى ذلك في أمته لتأنس بما جرى منه ولا تستوحش وجبر بهذا التشريع قلب موسى في ذلك فإنه لا بد إذا رجع مع نفسه وزال عنه حكم الشفقة على العباد قام معه تعظيم الحق وما ينبغي لجلاله فلم يستكثر شيئا في حقه وعلم إن القوة بيده يقوي بها من شاء وإذا خطر له مثل هذا وأقامه الحق فيه لا بد له أن يؤثر عنده ندما على ما جرى منه فيما قاله لمحمد صَلَّى اللهُ عَليهِ وسَلَّم فجبر الله قلبه بقوله ما يُبَدَّلُ الْقَوْلُ لَدَيَّ في آخر رجعة وكان قد تقدم القول بالتكثير وبدله بالتخفيف والتقليل فاعلم موسى أن القول الإلهي منه ما يقبل التبديل ومنه ما لا يقبل التبديل وهو إذا حق القول منه فالقول الواجب لا يبدل والقول المعروض يقبل التبديل فسر موسى عليه السلام بهذا القول وإنه ما تكلم إلا في عرض القول لا في حقه وكذلك لما علم بما شرع الله لأمة محمد صَلَّى اللهُ عَليهِ وسَلَّم من الاجتهاد في نصب الأحكام من أجل اجتهاد محمد جبر الله تعالى قلب محمد صَلَّى اللهُ عَليهِ وسَلَّم فيما جرى منه وسرى ذلك في أمته صَلَّى اللهُ عَليهِ وسَلَّم كما سرى الجحد والنسيان في بنى آدم من جحد آدم ونسيانه جبر القلب آدم فإن هذه النشأة الطبيعية من حكم الطبيعة فيها الجحد والنسيان فكانت حركة آدم في جحده حركة طبيعية وفي نسيانه أثر طبيعي فلو تناسى لكان الأمر من حركة الطبيعة كالجحد من حيث إنه جحد هو أثر طبيعي ومن حيث ما هو جحد بكذا هو حكم طبيعي لا أثر فهذا الفرق بين حكم الطبيعة وبين أثرها والنسيان من أثرها والتناسي من حكمها والغفلة من أثرها والتغافل من حكمها وقليل من العلماء بالله من يفرق بين حكم الطبيعة وأثرها فاجتمع في آدم حكم الطبيعة بالجحد لأنه الأول الجامع في ظهره للجاحدين فحكموا عليه بالجحد فجحد لأن الابن له أثر في أبيه فالجحد وإن كان من حكم الطبيعة فإنه من أثر الجاحدين من أبنائه لأن آدم إنسان كامل وكذا النسيان الواقع منه هو من أثر الطبيعة وحكم الأبناء فإنه حامل في ظهره للناسين من أبنائه فحكموا عليه بالنسيان فانظر ما أعجب هذه الأمور وما يعطيه فتوح المكاشفة من العلوم وجميع ما ذكرناه من أحكام هذا المنزل وله من الحضرة الإلهية الغيب ومن أعيان العالم الطبيعة ومن عالم الشهادة الظلمة ففي الشهادة ترى الظلمة ولا يرى بها وفي الطبيعة تعلم ولا ترى ويرى أثرها ويرى بها وفي الغيب يرى ويرى به مع بقاء اسم الغيب عليه وإنما قلنا هذا لأن الأسماء تتغير بتغير الأحكام ولا سيما في الأسماء الإلهية فإن الحكم يغير الاسم للاسم الآخر الذي يطلبه ذلك الحكم والعين واحدة وفي أحكام الشرائع عكس هذا تغير الأحكام تبع لتغير الأحوال والأسماء والعين واحدة قيل لمالك بن أنس من أئمة الدين ما تقول في خنزير البحر من بعض السمك فقال هو حرام فقيل له فسمك البحر ودوابه وميتته حلال فقال أنتم سميتموه خنزيرا والله قد حرم الخنزير فتغير الحكم عند مالك لتغير الاسم فلو قالوا له ما تقول في سمك البحر أو دواب البحر لحكم بالحل وكذا تغير الأحوال يغير الأحكام فالشخص الواحد الذي لم يكن حاله الاضطرار أكل الميتة عليه حرام فإذا اضطر ذلك الشخص عينه فأكل الميتة له حلال فاختلف الحكم لاختلاف الحال والعين واحدة\n\n\n### [أن الله يقبل التجلي في الصور الطبيعية]\n\n\nواعلم أن الله من هذا المنزل يقبل التجلي في الصور الطبيعية كثيفها ولطيفها وشفافها لأهل البرازخ والقيامة برزخ وما في الوجود غير البرازخ لأنه منتظم شي‏ء بين شيئين مثل زمان الحال ويسمى الدائم والأشياء المعنوية دور والحسية أكر فما في الكون طرف لأن الدائرة لا طرف لها فكل جزء منها برزخ بين جزأين وهذا علم شريف لمن عرفه ولهذا جمع في الإنسان الكامل بين الصورتين الطبيعيتين في نشأته فخلقه بجسم مظلم كثيف وبجسم لطيف محمول في هذا الجسم الكثيف سماه روحا له به كان حيوانا وهو البخار الخارج من تجويف القلب المنتشر في أجزاء البدن المعطي فيه النمو والإحساس وخصه دون العالم كله بالقوة المفكرة التي بها يدبر الأمور ويفصلها وليس لغيره من العالم ذلك فإنه على الصورة الإلهية ومن صورتها يدبر الأمر يفصل الآيات فالإنسان الكامل من تممت له الصورة الإلهية ولا يكمل إلا بالمرتبة ومن نزل عنها فعنده من الصورة بقدر ما عنده أ لا ترى الحيوان يسمع ويبصر ويدرك الروائح والطعوم والحار والبارد ولا يقال فيه إنسان بل هو جمل وفرس وطائر وغير ذلك فلو كملت فيه الصورة قيل فيه إنسان كذلك الإنسان لا يكمل فيزول عنه الاسم العام إلى الاسم الخاص فلا يسمى‏\nخليفة إلا بكمال الصورة الإلهية فيه إذ العالم لا ينظرون إلا إليها ولهذا لما لم تر الملائكة من آدم إلا الصورة الطبيعية الجسمية المظلمة العنصرية الكثيفة قالت ما قالت فلما أعلمهم الله بكمال الصورة فيه وأمرهم بالسجود له سارعوا بالسجود له ولا سيما وقد ظهر لهم بالفعل في تعليمه الأسماء إياهم ولو لم يعلمهم وقال لهم الله إني أعطيته الصورة والشورة لأخذوها إيمانا وعاملوه بما عاملوه به لأمر الله فإذا كوشف الإنسان على الإنسان الكامل ورأى الحق في الصورة التي كساها الإنسان الكامل يبقى في حيرة بين الصورتين لا يدري لأيتهما يسجد فيخير في ذلك المقام بأن يتلى عليه فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله ففي الإنسان وجه الله من حيث صورته وفي جانب الحق وجه الله من حيث عينه فلا شي‏ء يسجد قبل سجوده فإن الله يقبل السجود للصورة كما يقبله للعين‏\n\n\nكما تحير رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في مثل هذا المقام في منزلة أخرى لما قيل له حين أسرى به وأقيم في النور وحده فاستوحش‏\n\n\nوسبب استيحاشه إنما كان حيث أسرى به بجسمه العنصري فأدركته الوحشة بخروجه عن أصله ووقوفه في غير منزله فلم يستوحش منه صَلَّى اللهُ عَليهِ وسَلَّم إلا حقيقة ما ظهر فيه من العناصر فناداه من ناداه بصوت أبي بكر إذ كان قد اعتاد الأنس به فآنس للنداء وأصغى إليه وزالت عنه تلك الوحشة بصوت أبي بكر فقيل له لما أراد الدخول من ذلك الموقف على الله قف يا محمد إن ربك يصلي فتحير في نسبة الصلاة إليه وكان محمد صَلَّى اللهُ عَليهِ وسَلَّم في مقام الصورة الإلهية الكاملة التي تستقبل بالصلاة والسجود لها فلما دنا استقبله ربه بالصلاة له ولا علم له بذلك فناداه الاسم العليم المنسوب إليه الكلام بصوت أبي بكر ليعرفه بمرتبة أبي بكر ويؤنسه به قف إن ربك يصلي والوقوف ثبات وهو قبلة للمصلي فوقف وأفزعه ذلك الخطاب لأن حاله في ذلك الوقت التسبيح الذي روحه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فهذا الذي أفزعه فلما تلي عليه عند ذلك هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ ومَلائِكَتُهُ لِيُخْرِجَكُمْ من الظُّلُماتِ إِلَى النُّورِ تذكر ما أنزله الله عليه في القرآن فزال عنه رعب نسبة الصلاة إلى الله بما ذكره به وكان من أمر الإسراء ما كان وله موضع غير هذا نذكره فيه إن شاء الله فمن أقامه الله بين الصورتين لا يبالي لأيتهما سجد فإن رأى هذا الذي كوشف بالصورتين تصافح الصورتين دون سجود إحداهما للأخرى فهي علامة له على كمال الصورة في حق ذلك الإنسان الخاص وإن رأى السجود من الصورة الإنسانية للصورة الأخرى الإلهية فيعلم عند ذلك أن الصورة الإنسانية الكاملة في مقام مشاهدة العين لا مشاهدة الصورة فيوافقها في السجود لها فإن رأى السجود من الصورة الإلهية للصورة الإنسانية هنالك من قوله هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ لم يوافقها في السجود فإن وافقها هلك بل من حصل في ذلك المقام يعرف الأمور على ما هي عليه فإنه يعلم أن الصلاة من الله على العبد الكامل لا للعبد الكامل والصلاة من العبد الكامل لله لا على الله ومن حصل له هذا الفرقان فقد جمع بين القرآن والفرقان وهذا مشهد عزيز ما رأيت له ذائقا وهو من أتم المعارف ولما نزل القرآن نزل على قلب محمد صَلَّى اللهُ عَليهِ وسَلَّم وعلى قلوب التالين له دائما التي في صدورهم في داخل أجسامهم لا أعني اللطيفة الإنسانية التي لا تتحيز ولا تقبل الاتصاف بالدخول والخروج فيقوم للنفس الناطقة القلب الذي في الصدر ليصير لها مقام المصحف المكتوب للبصر فمن هناك تتلقاه النفس الناطقة وسبب ذلك أنه لما قام لها التفوق والفضل على الجسم المركب الكثيف بما أعطيته من تدبيره والتصرف فيه ورأته دونها في المرتبة لجهلها بما هو الأمر عليه وما علمت أنه من الأمور المتممة لكمالها فجعل الله القلب الذي في داخل الجسم في صدره مصحفا وكتابا مرقوما تنظر فيه النفس الناطقة فتتصف بالعلم وتتحلى به بحسب الآية التي تنظر فيها فتفتقر إلى هذا المحل لما تستفيده بسببه لكون الحق اتخذه محلا لكلامه ورقمه فيه فنزلت بهذا عن ذلك التفوق الذي كان قد أعجبت به وعرفت قدرها ورأت أن ذلك القلب مهبط الملائكة بالروح الذي هو كلام الله وما رأت تلك الملائكة النازلة تنظر إليها ولا تكلمها إنما ترقم في القلب ما تنزل به والنفس تقرأ ما نزل فيه مرقوما فتعلم في فهمها عن الله أن مراد الله بذلك تعليمها وتأديبها لما طرأ عليها من خلل العجب بنفسها فأقرت واعترفت بأن نسبة الله إلى كل شي‏ء نسبة واحدة من غير تفاضل فلم تر لها تفوقا على شي‏ء من المخلوقات من ملأ أعلى أو أدنى ولا تفضيل ولا ترجيح في العالم ولكن من حيث الدلالة ونسبة الحق لا من حيث هو العالم فإنه من حيث هو العالم يكون ترجيح‏\nبعضهم على بعض ويظهر فيه التفاوت فاعلم إن النفس الناطقة من الإنسان إذا أراد الله بها خيرا كشف لها عن نطق جميع أجزاء بدنها كلها بالتسبيح والثناء على الله بحمده لا بحمد من عندها ولا ترى فيهم فتورا ولا غفلة ولا اشتغالا ورأت ذاتها غافلة عما يجب لله تعالى عليها من الذكر مفرطة مشتغلة عن الله بأغراضها متوجهة نحو الأمور التي تحجبها عن الله والوقوف عند حدوده فيعظم العالم عندها وتعلم أنه شعائر الله التي يجب عليها تعظيمها وحرمات الله وتصغر عندها نفسها وتعلم أن لو تميزت عن جسمها ولم يكن جسمها من المتمات لها في نشأتها لعلمت أن الجسم ذلك المدبر لها أشرف منها فلما علمت إن ذلك الجسم أشرف منها علمت إن شرفه بما هو عليه من هذه الصفات هو عين شرفها وإنها ما أمرت بتدبيره واستخدمت في حقه وصيرت كالخديم له وتوجهت عليها حقوق له من عينه وسمعه وغير ذلك إلا لشغله بالله وتسبيح خالقه فعلمت نفسها أنها مسخرة له فلو كانت هي من الاشتغال بالله في مثل هذا الاشتغال كان لها حكم جسمها ولو وكل الجسم لتدبير ذاته اشتغل عن التسبيح كما اشتغلت النفس الإنسانية وإذا علمت أنها مسخرة في حق جسمها عرفت قدرها وأنها في معرض المطالبة والمؤاخذة والسؤال والحساب فتعين عليها في دار التكليف أداء الحقوق الواجبة عليها لله وللعالم الخارج عنها ولنفسها بما يطلبه منها جسمها ولم تتفرغ مع هذا الاشتغال إلى رؤية الأفضلية ولا تشوفت لمعرفة المراتب وهذه المرتبة أعني مرتبة أداء الحقوق أشرف المراتب في حق الإنسان والخاسر من اشتغل عنها كما إن الرابح من اشتغل بها\n\n\n### [أن الله تعالى إذا ذكر شيئا بضمير الغائب فما هو غائب عنه‏]\n\n\nواعلم أن الله تعالى إذا ذكر لك شيئا بضمير الغائب فما هو غائب عنه وإنما راعى المخاطب وهو أنت والمذكور غائب عنك فإذا ذكره بضمير الحضور من إشارة إليه وغيرها فإنما راعاك ومراعاة شهوده لا بد منها في كل حال ولكن يفرق بين ما يحكيه الله من أقوال القائلين وبين الكلام الذي يقوله من عند نفسه فإذا كان الحق سمع العبد وبصره زالت الغيبة في حق العبد فما هو عند ذلك مخاطب بما فيه ضمير غائب وقد وجد الخطاب لمن هذه صفته بضمير الغائب فكيف الأمر قلنا لما كان العبد المنزل عليه القرآن مأمورا بتبليغه إلى المكلفين وتبيينه للناس ما نزل إليهم ومن الأشياء ما هي مشهودة لهم وغائبة عنهم ولم يؤمر أن يحرف الكلم عن مواضعه بل يحكي عن الله كما حكى الله له قول القائلين وقولهم يتضمن الغيبة والحضور فما زاد على ما قالوه في حكايته عنهم وقيل له بَلِّغْ ما أُنْزِلَ إِلَيْكَ فلم يعدل عن صورة ما أنزل إليه فقال ما قيل له فإنه ما نزلت المعاني على قلبه من غير تركيب هذه الحروف وترتيب هذه الكلمات ونظم هذه الآيات وإنشاء هذه السور المسمى هذا كله قرآنا فلما أقام الله نشأة القرآن صورة في نفسها أظهرها كما شاهدها فأبصرتها الأبصار في المصاحف وسمعتها الآذان من التالين وليس غير كلام الله هذا المسموع والمبصر وألحق الذم بمن حرفه بعد ما عقله وهو يعلم أنه كلام الله فأبقى صورته كما أنزلت عليه فلو بدل من ذلك شيئا وغير النشأة لبلغ إلينا صورة فهمه لا صورة ما أنزل عليه فإنه لكل عين من الناس المنزل إليهم هذا القرآن نظر فيه فلو نقله إلينا على معنى ما فهم لما كان قرآنا أعني القرآن الذي أنزل عليه فإن فرضنا أنه قد علم جميع معانيه بحيث إنه لم يشذ عنه شي‏ء من معانيه قلنا فإن علم ذلك وهذه الكلمات التي تدل على جميع تلك المعاني فلأي شي‏ء يعدل وإن عدل إلى كلمات تساويها في جميع تلك المعاني فلا بد لتلك الكلمات التي يعدل إليها من حيث ما هي أعيان وجودية أعيان غير هذه الأعيان التي عدل عنها التي أنزلت عليه فلا بد أن تخالفها بما تعطيه من الزيادة من حيث أعيانها على ما جمعته من المعاني التي جمعتها الكلمات المنزلة فيزيد للناظر في القرآن معاني أعيان تلك الكلمات المعدول إليها وما أنزلها الله فيكون النبي قد بلغ للناس ما نزل إليهم وما لم ينزل إليهم فيزيدون في الحكم شرعا لم يأذن به الله كما أيضا ينقص مما أنزل الله أعيان تلك الكلمات التي عدل عنها فكان الرسول قد نقص من تبليغ ما أنزل إليه أعيان تلك الكلمات وحاشاه من ذلك فلم يكن ينبغي له إلا أن يبلغ إلى الناس ما نزل إليهم صورة مكملة من حيث الظاهر حروفها اللفظية والرقمية ومن حيث الباطن معانيها ولذلك‏\n\n\nكان جبريل في كل رمضان ينزل على محمد صَلَّى اللهُ عَليهِ وسَلَّم يدارسه القرآن مرة واحدة فكانت له مع جبريل عليه السلام في كل رمضان ختمة إلى أن جاء آخر رمضان شهده رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فدارسه جبريل مرتين في ذلك الرمضان فختم ختمتين فعلم أنه يموت في السنة الداخلة\n\n\nلا في سنة ذلك الرمضان فكانت الختمة الثانية لرمضان السنة التي مات فيها حتى تكون‏\nالسنة له بعد موته فمات في ربيع الأول وكان نزول القرآن في ليلة القدر التي هي خَيْرٌ من أَلْفِ شَهْرٍ فأتى بغاية أسماء العدد البسيط الذي لا اسم بعده بسيط إلا ما يتركب كما كان القرآن آخر كتاب أنزل من الله كما كان من أنزل عليه آخر الرسل وخاتمهم ثم أضاف ذلك الاسم الذي هو ألف إلى شهر بالتنكير فيدخل الفصول فيه والشهر العربي قدر قطع منازل درجات الفلك كله لسير القمر الذي به يظهر الشهر فلو قال أزيد من ذلك لكرر ولا تكرار في الوجود بل هو خلق جديد ولو نقص بذكر الأيام أو الجمع لما استوفى قطع درجات الفلك فلم تكن تعم رسالته ولم يكن القرآن يعم جميع الكتب قبله لأنه ما ثم سير لكوكب يقطع الدرجات كلها في أصغر دورة إلا القمر الذي له الشهر العربي فلذلك نزل في ليلة هي خير من ألف شهر أي أفضل من ألف شهر والأفضل زيادة والزيادة عينها وجعل الأفضلية في القدر وهي المنزلة التي عند الله لذلك المذكور وكانت تلك الليلة المنزل فيها التي هي ليلة القدر موافقة ليلة النصف من شعبان فإنها ليلة تدور في السنة كلها وأما نحن فإنا رأيناها تدور في السنة وأنا رأيناها أيضا في شعبان ورأيناها في رمضان في كل وتر من شهر رمضان وفي ليلة الثامن عشر من شهر رمضان على حسب صيامنا في تلك السنة فأي ليلة شاء الله أن يجعلها محلا من ليالي السنة للقدر الذي به تسمى ليلة القدر جعل ذلك فإن كان ذلك من ليالي السنة ليلة لها خصوص فضل على غيرها من ليالي السنة كليلة الجمعة وليلة عرفة وليلة النصف من شعبان وغير تلك من الليالي المعروفة فينضاف خير تلك الليلة إلى فضل القدر فتكون ليلة القدر تفضل ليلة القدر في السنة التي لا ينضاف إليها فضل غيرها فاعلم ذلك ومن هذا المنزل نزل الروح الأمين على قلب محمد صَلَّى اللهُ عَليهِ وسَلَّم بسورتين سورة القدر وسورة الدخان وهما مختلفان في الحكم فسورة القدر تجمع ما تفرقة سورة الدخان وسورة الدخان تفرق ما تجمعه سورة القدر فمن لا علم له بما شاهده يتخيل أن السورتين متقابلتان ولم يتفطن للمنزل الواحد الذي جمعهما ولم يتفطن لنشأته التي قامت من جمعها للمتقابلات الطبيعية وصاحب الكشف الصحيح إذا دخل هذا المنزل وكانَ لَهُ قَلْبٌ ... وهُوَ شَهِيدٌ رأى أن سورة القدر لا تقابل بينها وبين سورة الدخان فإن سورة القدر تجمع ما تعطيه سورة الدخان لتفرقه على المراتب فتأخذه سورة الدخان فتفرقه على المراتب لأنها علمت من سورة القدر أنها ما جمعت ذلك وأعطته إياها إلا لتفرقه فسورة القدر كالجابية لسورة الدخان هكذا هو الأمر وهما سورتان لهما عينان ولسانان وشفتان تعرفان وتشهدان لمن دخل هذا المنزل بأنه من أهل المقام المحمود وإنه وارث مكمل ويتضمن هذا المنزل علم المطابقة والمناسبة والمراقبة وعلم التلويح والرمز وعلم النفوذ في الأمور من غير مشقة لأن النفوذ في الأمور بطريق الفكر من أعظم المشقات وعلم الإبانة والكشف وعلم النشآت الطبيعية هل حكمها حكم النشآت العنصرية أم لا وعلم الفرق بين الأنوار والظلم ولما ذا يرجع النور والظلمة وهما حجابان بين الله وعباده وما يلي العباد من هذه الحجب وما يلي الحق منها وهل ترفع لأحد أو لا تزال مسدلة وهل تعطي هذه الحجب تحديد المحجوب أم لا فإن أعطت التحديد للمحجوب فبأي نشأة تقيده وتحده هل بنشأة عنصرية أو طبيعية وإن لم تقيده فيما ذا تلحقه هل بما لا يقبل التحيز من العالم فلا يتصف بالدخول في الأجسام ولا بالخروج منها أو تقضي عليه بحكم يخصه خارج عن حكم ما لا يتحيز فلا يقبل المكان ولا الحلول وعلم الرحمة التي يتضمنها الإنذار ممن كان وعلم الأذواق وعلم ما يشقى من الأسماء مما يسعد وعلم تعلم اليقين وعلم التنزيه في الربوبية وهو صعب التصور وعلم مرتبة العلم من مرتبة الشك خاصة وما تعطي كل مرتبة منهما لمن حل فيها ونزل بها وعلم العذاب أ هو من علم الآلام أو هو من علم اللذات وعلم عدم قبول التوبة عند حلول البأس وقبولها من قوم يونس خاصة وعلم نفوذ قضاء السوابق هل تنفذ بالشر على من هو على بصيرة أو هل هومختص بالمحجوبين وعلم طبقات العذاب وعلم الابتلاء وطبقاته وعلم النصائح وعلم أهل العناية عند الله مع شمول الرحمة للجميع وقد ابتلوا أهل العناية في الدنيا بما به ابتلي من ليس منهم في الآخرة ولما ذا ترجع عناية الله بأهله مع الابتلاء والبلاء هل لاقتضاء الدارين أو لاقتضاء سابق العلم وعلم وجود الحق بوجوهه في كل فرد فرد من العالم كله وعلم توقيت الجمع الأخير من الجموع الثلاثة وعلم الاستثناء لما ذا يرجع وعلم أين يذهب الجهل والظن والشك والعلم بأصحابهم وعلم تقدم الموت على الحياة ومعلوم أن‏\nالموت لا يكون إلا عن حياة وعلوم هذا المنزل كثيرة فقصدنا منها إلى التعريف بالأهم من ذلك مما تتعلق السعادة بالعلم به وإن كان العلم كله عين السعادة لكن في العموم ليست السعادة إلا حصول اللذات ونيل الأغراض والفوز من الآلام والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 340: On the Knowledge of the Station from which the Prophet (PBUH) Concealed the Surah of Smoke for Ibn Sayyad\n\n### [Indeed Allah Protected His Prophet (PBUH) from the Utterance, and the Knowledge of the Hidden Thing Did Not Remove Him from Being a Soothsayer]\n\nFrom the Glorious Quran:\n\nThe Prophet (PBUH) asked him, \"What have I concealed for you?\" He replied, \"The *Dukh* (الدخ),\" which is a dialectical variation of *Dukhan* (الدخان - Smoke), because the chapter contains the verse: <<يَوْمَ تَأْتِي السَّماءُ بِدُخانٍ مُبِينٍ>> (The Day when the sky will bring forth a manifest smoke). Ibn Sayyad thus knew the name that the Messenger of Allah (PBUH) had intended and kept hidden in his heart. The Prophet (PBUH) then said to him, \"Be off! You will not exceed your measure (قدرك).\" Meaning, your knowledge of this does not remove you from the measure (قدرك) for which Allah has destined you. It has also been narrated: \"You did not exceed your measure.\"\n\nThis means by your perception of what I concealed for you. In this statement, there is a secret that this utterance from the Prophet (PBUH) reveals to the pure one (لصاف) regarding the station (المقام) that necessitated the Messenger of Allah (PBUH) to speak such a word to him. For he did not test him with what he concealed based on a revelation (وحي) from Allah. Had it been by revelation, Ibn Sayyad would not have discovered it, because Allah supports what He commands with divine aid (التأييد). Rather, this utterance was like his (PBUH) statement regarding the pollination of the date palms. When his hidden intention was revealed, that was an act of divine discipline (تأديب فعل) from Allah, so that the Prophet would maintain the station of vigilance (مقام المراقبة) and speak only from witnessing (شهود). For, by circumstantial evidence, it is known that the Prophet (PBUH) only concealed what he concealed for him in order to baffle him, but Allah refused that.\n\nThe Prophet (PBUH) said, \"Indeed, Allah disciplined me, and perfected my discipline.\"\n\nHad the Prophet (PBUH) openly declared his intention in what he concealed, a group of those present would have apostatized. But Allah protected His Prophet (PBUH) from the utterance, and the knowledge of the hidden thing did not remove [Ibn Sayyad] from being a soothsayer (كاهنا). Those present knew the nature and affair of soothsayers, especially the people of Yemen, Hijaz, and the Arabian Peninsula. Thus, that knowledge did not remove him from his measure (قدره) in the eyes of those present. This issue contains tremendous matters whose explanation would extend to a great degree.\n\n> Abandoning contentment (الرضي) does not occur\n> Except for one who is lesser (دون).\n> If it becomes your spiritual state (حالا),\n> Then every difficulty becomes easy.\n> But if you refuse His contentment,\n> Then what He wills shall be.\n\nThis station (المنزل) is the one from which the Messenger of Allah (PBUH) concealed the Surah of Smoke (سورة الدخان) from the Quran for Ibn Sayyad. It is a tremendous station (منزل عظيم) containing such divine cunning (المكر الإلهي) and gradual enticement (الاستدراج) that even the angels, despite their knowledge of it, do not feel safe from Allah’s cunning. The intelligent person, if he is not among the people of unveiling (أهل الاطلاع) in his actions, should at least not remove the prescribed scale (الميزان المشروع) by which he weighs his actions from his hand—rather, from his right hand. He thus preserves himself from this cunning in reality (في نفس الأمر) and does not depart from the necessities and rulings of his servitude (عبوديته) for a blink of an eye. He is granted increases in knowledge and matters that \"no eye has seen, nor ear heard, nor has it occurred to the heart of any possible being.\" The ascension (العروج) of the separated spirits (الأرواح المفارقة) and others can occur through it. From it appear the signs (العلامات) of the truthfulness of the truthful and the falsehood of the liar. Whoever attains this station gains the knowledge of comprehensive wisdom (الحكمة الجامعة) and distinguishes the wretched (الشقي) from the felicitous (السعيد). The states of the observers differ within it. What Zayd sees as light (نورا), Amr sees as darkness (ظلمة), and Ja'far sees as both light and darkness simultaneously. For, by it, things are unveiled (يكشف به الأشياء). One says, \"This is light,\" and observes it from the perspective of its essence (عينه) and says, \"Darkness.\" All spiritual descents (المنازلات) occur here. The descending Real (الحق النازل) and the ascending Creation (الخلق الصاعد) meet in it. The Real asks the ascending one, \"To where?\" Creation replies, \"To You.\" Creation asks the descending one, \"To where?\" The Real replies, \"To You.\" They both say, \"We have met. Come, let each of us specify the reason that necessitated each of us to seek the other.\" The Real says, \"I intended by descending to you to relieve you of fatigue, to give and grant you without hardship or toil, while you rest among your family. I had no other intention than this.\" Creation says, \"I intended by ascending to You to glorify You and serve You, to stand before You while You are upon the throne of Your sovereignty. The Highest Assembly (الملأ الأعلى) already knows that I am Your vicegerent (خليفتك) and that I know You better than they do, due to what You have specially granted me. When the Highest Assembly sees me before You, they will follow my example in how I stand before You, which is the proper conduct (الأدب) for one like me to observe with You. Thus, they will gain, through witnessing (بالمشاهدة), knowledge of the proper conduct with You that they lacked. For I saw them ignorant of Your station, despite their ceaseless glorification (تسبيح). You told them: <<إِنِّي جاعِلٌ فِي الْأَرْضِ خَلِيفَةً>> (Indeed, I am going to place a vicegerent on the earth), and they opposed You regarding it with what You recounted to me that they said. They should have only listened, as the command is Yours. Since I knew that the divine proper conduct (الأدب الإلهي) was not firmly established in them, and You commanded me to teach them, and I saw that teaching by state (بالحال) and action (بالفعل) is more complete than by word and construction, I intended to ascend to You so that the Highest Assembly might see, through state and action, how Your Majesty should be treated. The *Istiwā’* (استواء - Establishment) is the most noble state by which You appeared to Your creation, yet they objected to You. How would it be if You descended to a state lower than the *Istiwā’*, from heaven or earth?\"\n\nThe Real says, \"What a noble intention! One like you is the one who appreciates the measure of things. For whoever knows his own measure and the measure of things knows My Measure and fulfills My Right (حقي). Do you not see Muhammad (PBUH)? When I prescribed fifty prayers upon him and his community, he descended with them and said nothing, nor did he object, nor did he say, 'This is too much.' But when he descended to Moses (PBUH), Moses said to him, 'Go back to your Lord, perhaps He will lighten the burden for your community. I suffered greatly from the Children of Israel regarding this, and your community will be unable to bear such a burden and will grow weary of it.' Muhammad (PBUH) remained perplexed. Perfect proper conduct (الأدب الكامل) dictated his action of not objecting, while compassion for his community required him to seek alleviation for them, so that they would not worship Allah with vexation, reluctance, boredom, or laziness. So he remained hesitant. This is the effect of intermediaries and companions. He began seeking the preference (الترجيح) between what Moses (PBUH) said and what he (PBUH) fulfilled regarding the right of proper conduct with Allah. Allah had previously instructed him, when mentioning a group of Prophets, including Moses (PBUH), by saying: <<أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ>> (Those are the ones whom Allah has guided; so follow their guidance). He interpreted Moses' suggestion as part of that guidance, not realizing at the time that Moses (PBUH), when he was in the state of his own guidance, did not ask for alleviation, and that guidance was what the Messenger of Allah (PBUH) was commanded to follow. This independent judgment (الاجتهاد) led him to return to Allah and ask for alleviation. He continued returning between Allah the Exalted and Moses (PBUH) until he said, in accordance with the proper conduct granted to him, 'I am ashamed before my Lord,' and the matter concluded with the alleviation to ten [prayers]. He descended with this to his community and was legislated to prescribe for his community independent judgment (الاجتهاد) in rulings (الأحكام) that ensure the welfare of the world, because he (PBUH) returned between Allah and Moses (PBUH) through independent judgment. Allah ratified this for his community so they would be familiar with what happened to him and not feel alienated. By this legislation, Allah mended the heart of Moses (PBUH). For inevitably, when Moses reflected upon himself and the ruling of compassion for the servants left him, the glorification of the Real (تعظيم الحق) and what is due to His Majesty arose within him. He would not deem anything too much regarding Allah's right, knowing that power is in His Hand, and He strengthens whomever He wills. If such a thought occurred to him and the Real established him in it, he would inevitably feel regret (ندما) for what transpired in his advice to Muhammad (PBUH). Allah mended his heart by His saying: <<مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ>> (The word is not changed with Me) in the final return. The word had previously been given for the greater number [fifty] and was changed by alleviation and reduction [to ten]. Thus, Moses knew that the Divine Word (القول الإلهي) includes what accepts change and what does not accept change. The latter is when the Word is established as a certainty (إذا حق القول منه). The obligatory Word (القول الواجب) is not changed, but the presented Word (القول المعروض) accepts change. Moses (PBUH) was pleased by this statement, knowing that he had only spoken regarding the presentation of the Word, not its established certainty. Similarly, when Allah legislated independent judgment (الاجتهاد) for the community of Muhammad (PBUH) in establishing rulings, due to Muhammad's own independent judgment, Allah the Exalted mended the heart of Muhammad (PBUH) regarding what transpired from him. This spread into his community (PBUH), just as denial (الجحد) and forgetfulness (النسيان) spread into the children of Adam from Adam's denial and forgetfulness. Allah mended Adam's heart, for this natural constitution (النشأة الطبيعية) is governed by denial and forgetfulness. Adam's movement in his denial was a natural movement, and his forgetfulness was a natural effect (أثر طبيعي). If he had *pretended* to forget (تناسى), the matter would have been from the movement of nature, just as denial (الجحد) is a natural effect (أثر طبيعي) in that it is denial, but in that it is denial of *such-and-such*, it is a natural ruling (حكم طبيعي), not an effect. This is the difference between the ruling of nature (حكم الطبيعة) and its effect (أثرها). Forgetfulness (النسيان) is from its effect, and pretended forgetfulness (التناسي) is from its ruling. Heedlessness (الغفلة) is from its effect, and pretended heedlessness (التغافل) is from its ruling. Few scholars of Allah distinguish between the ruling of nature and its effect. The ruling of nature (حكم الطبيعة) converged in Adam through denial, because he is the first comprehensive being (الأول الجامع) carrying the deniers in his loins, so they ruled him with denial, and he denied. For the son has an effect on his father. Although denial is a ruling of nature, it is an effect of the deniers among his descendants. Adam is a Perfect Human (إنسان كامل). Likewise, the forgetfulness that occurred from him is an effect of nature and the ruling of the descendants, for he carries the forgetful ones among his descendants in his loins, so they ruled him with forgetfulness. Look at how wondrous these matters are, and what the unveilings (فتوح المكاشفة) grant in terms of knowledge! All that we have mentioned are rulings of this station (المنزل). It has the Unseen (الغيب) from the Divine Presence (الحضرة الإلهية), Nature (الطبيعة) from the Fixed Entities (الأعيان الثابتة), and Darkness (الظلمة) from the World of Witnessing (عالم الشهادة). In Witnessing, you see darkness, but you do not see *by* it. In Nature, you know, but you do not see; its effect is seen, and you see *by* it. In the Unseen, it is seen, and you see *by* it, while the name 'Unseen' remains upon it. We say this because names change with the change of rulings (الأحكام), especially in the Divine Names (الأسماء الإلهية). The ruling changes the name to the other name required by that ruling, while the Essence (العين) is one. In the rulings of the Sacred Law (الشرائع), the reverse is true: the change of rulings follows the change of states and names, while the Essence (العين) is one. Malik ibn Anas, one of the Imams of the religion, was asked, \"What do you say about the sea pig (خنزير البحر) among the fish?\" He said, \"It is forbidden (haram).\" He was told, \"But the fish and beasts of the sea, and their dead, are lawful (halal).\" He replied, \"You named it 'pig' (خنزير), and Allah has forbidden the pig.\" The ruling changed for Malik due to the change of the name. Had they asked him about the fish of the sea or the beasts of the sea, he would have ruled them lawful. Similarly, the change of states changes the rulings. For the same person whose state is not necessity (الاضطرار), eating carrion (الميتة) is forbidden. But if that same person is compelled (اضطر), eating carrion is lawful for him. The ruling differed due to the difference in state, while the Essence (العين) is one.\n\n### [That Allah Accepts Self-disclosure (التجلي) in Natural Forms (الصور الطبيعية)]\n\nKnow that Allah, from this station (المنزل), accepts Self-disclosure (التجلي) in natural forms (الصور الطبيعية)—both dense (كثيفها) and subtle (لطيفها) and transparent (شفافها)—for the people of the Isthmuses (البرازخ) and the Resurrection. The Resurrection is an Isthmus (برزخ), and nothing in Existence (الوجود) is other than Isthmuses, because everything is ordered as a thing between two things, like the time of the present (زمان الحال), which is called the Permanent (الدائم). Conceptual things are cycles (دور), and sensory things are spheres (أكر). There is no extremity (طرف) in the cosmos, because a circle has no extremity. Thus, every part of it is an Isthmus (برزخ) between two parts. This is noble knowledge for whoever understands it. For this reason, the Perfect Human (الإنسان الكامل) combines the two natural forms (الصورتين الطبيعيتين) in his constitution (نشأته). He was created with a dark, dense body (جسم مظلم كثيف) and a subtle body (جسم لطيف) carried within this dense body, which He called the spirit (روحا). By this spirit, he is an animal (حيوانا)—it is the vapor emanating from the cavity of the heart, spreading throughout the parts of the body, granting growth and sensation. He was singled out, above the entire cosmos, with the thinking faculty (القوة المفكرة) by which he manages and distinguishes affairs. No other part of the cosmos possesses this. For he is upon the Divine Form (الصورة الإلهية), and from its form, he manages the affair and details the signs (يفصل الآيات). The Perfect Human is he for whom the Divine Form is completed. He is only perfected by the rank (المرتبة). Whoever falls short of it possesses the Form only to the extent he possesses it. Do you not see that the animal hears, sees, perceives smells, tastes, heat, and cold, yet he is not called 'human'? Rather, he is a camel, a horse, a bird, and so on. If the Form were completed in him, he would be called 'human.' Likewise, the human is not perfected, nor does he move from the general name to the specific name, nor is he called a Vicegerent (خليفة) except by the completion of the Divine Form within him, since the cosmos looks only to it. This is why, when the angels saw nothing of Adam but the physical, dark, elemental, dense natural form (الصورة الطبيعية الجسمية المظلمة العنصرية الكثيفة), they said what they said. But when Allah informed them of the completeness of the Form within him and commanded them to prostrate to him, they hastened to prostrate to him, especially when it was demonstrated to them in action (بالفعل) through his teaching them the Names. If the human were unveiled to the Perfect Human and saw the Real (الحق) in the form with which the Perfect Human was clothed, he would remain perplexed between the two forms, not knowing to which one he should prostrate. He is then given a choice in that station by having the verse recited to him: <<فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله>> (So wherever you turn, there is the Face of Allah). The Face of Allah is in the human by virtue of his form, and the Face of Allah is in the side of the Real by virtue of His Essence (عينه). Nothing prostrates before its prostration. Indeed, Allah accepts prostration to the Form just as He accepts it to the Essence.\n\nJust as the Messenger of Allah (PBUH) was perplexed in a similar station (مقام) in another descent (منزلة أخرى) when he was taken on the Night Journey (الإسراء) and stood alone in the Light (النور), and felt alienated (استوحش). The reason for his alienation was that he was taken on the Night Journey with his elemental body (بجسمه العنصري), and the alienation overtook him due to his departure from his origin and his standing in a place that was not his station. Only the reality of the elements that appeared in him felt alienated. Then, someone called out to him with the voice of Abu Bakr, as he was accustomed to intimacy with him. He felt comforted by the call and listened to it, and that alienation left him due to Abu Bakr's voice. When he intended to enter upon Allah from that standing place, it was said to him, \"Stop, O Muhammad! Indeed, your Lord is praying (يصلي).\" He was perplexed by the attribution of prayer to Him. Muhammad (PBUH) was in the station of the complete Divine Form (الصورة الإلهية الكاملة) which is received with prayer and prostration. When he drew near, his Lord received him with prayer *for* him, though he was unaware of it. The Name, the All-Knowing (الاسم العليم), to which speech is attributed, called out to him with the voice of Abu Bakr, to inform him of Abu Bakr's rank and to comfort him: \"Stop! Indeed, your Lord is praying.\" Standing (الوقوف) is firmness, and it is the *qibla* (direction) for the one who prays. He stopped, and that address alarmed him, because his state at that time was glorification (التسبيح), the spirit of which is <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). This is what alarmed him. When the verse was recited to him at that moment: <<هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ وَمَلائِكَتُهُ لِيُخْرِجَكُمْ مِنَ الظُّلُماتِ إِلَى النُّورِ>> (It is He who confers blessing upon you, and His angels, that He may bring you out from darknesses into the light), he remembered what Allah had revealed to him in the Quran. The terror of attributing prayer to Allah vanished through this reminder. The matter of the Night Journey was as it was, and it has another place where we shall mention it, God willing. Whoever is established by Allah between the two forms does not care to which of them he prostrates. If the one who is unveiled by the two forms sees the two forms shaking hands without one prostrating to the other, it is a sign for him of the completeness of the Form in that specific human. If he sees the prostration of the human form to the other Divine Form, he knows that the Perfect Human Form is in the station of witnessing the Essence (مشاهدة العين), not witnessing the Form, so he agrees with it in prostrating to it. If he sees the prostration of the Divine Form to the human form, based on the saying <<هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ>> (It is He who confers blessing upon you), he does not agree with it in prostration. If he agrees with it, he perishes. Rather, whoever attains that station knows things as they truly are. He knows that the *salat* (blessing) from Allah is *upon* the perfect servant, not *for* the perfect servant, and the *salat* from the perfect servant is *to* Allah, not *upon* Allah. Whoever achieves this distinction (الفرقان) has combined the Quran and the Criterion (الفرقان). This is a precious witnessing (مشهد عزيز); I have not seen anyone who has tasted it, and it is among the most complete forms of gnosis (المعارف).\n\nWhen the Quran descended, it descended upon the heart of Muhammad (PBUH) and upon the hearts of those who recite it perpetually, which are inside their chests (في صدورهم)—I do not mean the subtle human essence (اللطيفة الإنسانية) which is unlocalized and does not accept the description of entering or exiting. The heart (القلب) in the chest serves the rational soul (النفس الناطقة) to become for it the station of the written *Mus'haf* (مصـحف) for the sight. From there, the rational soul receives it. The reason for this is that when the rational soul attained superiority and excellence (التفوق والفضل) over the dense composite body, due to the management and disposal granted to it, it saw the body as beneath it in rank, due to its ignorance of the true state of affairs, and it did not know that the body was among the things that completed its perfection. So, Allah made the heart inside the body in the chest a *Mus'haf* and a written book (كتابا مرقوما) in which the rational soul looks. It is thus characterized by knowledge and adorned by it according to the verse it looks into. It becomes dependent on this location (المحل) for what it gains through it, because the Real has taken it as a location for His Speech and inscribed it therein. By this, the soul descended from that superiority which had caused its self-admiration. It recognized its measure and saw that the heart is the landing place of the angels with the Spirit (الروح), which is the Word of Allah. It saw that the descending angels neither look at it nor speak to it; rather, they inscribe in the heart what they bring down, and the soul reads what is inscribed therein. It understands, in its comprehension of Allah, that Allah's intention by this is to teach and discipline it for the flaw of self-admiration that had afflicted it. It acknowledged and confessed that Allah's relation to everything is a single relation without preference (تفاضل). It saw no superiority for itself over any creature, whether of the Highest or Lowest Assembly, nor any preference or advantage in the cosmos—but only from the perspective of indication and the relation of the Real, not from the perspective of the cosmos itself. For from the perspective of the cosmos, some are preferred over others, and disparity appears therein.\n\nKnow that if Allah intends good for the rational soul of a human, He unveils to it the utterance of all parts of its body, all of them glorifying and praising Allah by His praise, not by praise originating from themselves. It sees no slackness, heedlessness, or preoccupation in them. It sees its own essence (ذاتها) heedless of the remembrance due to Allah, negligent, preoccupied with its own aims, turning toward matters that veil it from Allah and from standing at His limits. The cosmos becomes great in its eyes, and it knows that it is the sacred rites (شعائر الله) that it must glorify, and the sanctities (حرمات الله). Its own self diminishes in its eyes. It knows that if it were separated from its body, and its body were not among the things that complete its constitution, it would realize that the body, which it manages, is nobler than itself. Since it knows that the body is nobler than itself, it realizes that the body's nobility, based on these attributes, is the very essence of its own nobility. It was only commanded to manage the body, employed in its service, and made like a servant to it—with rights imposed upon it regarding the body's eye, hearing, and so on—because the body is preoccupied with Allah and the glorification of its Creator. It realizes that it is subjugated (مسخرة) to the body. If the soul were engaged with Allah in such an engagement, it would have the ruling of its body. If the body were entrusted with managing itself, it would be distracted from glorification, just as the human soul is distracted. When it knows that it is subjugated in service to its body, it recognizes its measure and that it is subject to demand, accountability, questioning, and reckoning. It becomes incumbent upon it, in the abode of responsibility (دار التكليف), to fulfill the rights due to Allah, to the external cosmos, and to its own self as demanded by its body. With this preoccupation, it does not have the leisure to see superiority or aspire to know the ranks. This rank—the rank of fulfilling rights—is the noblest of ranks for the human, and the loser is he who is distracted from it, just as the winner is he who is preoccupied with it.\n\n### [That when Allah the Exalted Mentions Something with the Pronoun of the Absent (ضمير الغائب), that Thing is Not Absent from Him]\n\nKnow that when Allah the Exalted mentions something to you with the pronoun of the absent, that thing is not absent from Him. Rather, He is considering the addressee (المخاطب)—which is you—and the mentioned thing is absent from *you*. If He mentions it with the pronoun of presence (ضمير الحضور), such as pointing to it, He is only considering you. The consideration of His witnessing (شهوده) is necessary in every state. However, a distinction must be made between what Allah recounts from the sayings of speakers and the speech He utters from Himself. If the Real becomes the servant's hearing and sight, absence (الغيبة) vanishes for the servant. At that point, he is not addressed by speech containing the absent pronoun. Yet, address containing the absent pronoun has occurred for one whose description is this. How is this so? We say: Since the servant upon whom the Quran was revealed was commanded to convey it to the responsible ones (المكلفين) and to clarify for the people what was revealed to them, and some things are witnessed by them and absent from them, he was not commanded to distort the words from their places. Rather, he recounts from Allah just as Allah recounted to him the sayings of the speakers, and their sayings include absence and presence. He did not add to what they said in his recounting of them. He was told: <<بَلِّغْ مَا أُنْزِلَ إِلَيْكَ>> (Convey what has been revealed to you). He did not deviate from the form of what was revealed to him, so he said what was said to him. For the meanings did not descend upon his heart without the composition of these letters, the arrangement of these words, the structure of these verses, and the creation of these chapters—all of which is called the Quran. When Allah established the constitution (نشأة) of the Quran as a form in itself, He manifested it as He witnessed it. Eyes saw it in the *Mus'hafs*, and ears heard it from the reciters. Nothing other than this heard and seen speech is the Word of Allah. He attached blame to whoever distorted it after understanding it, knowing it was the Word of Allah. Thus, he preserved its form as it was revealed to him. If he had changed anything or altered the constitution, what would have reached us would be the form of his *understanding*, not the form of what was revealed to him. For every eye of the people to whom this Quran was revealed has a perspective on it. If he had transmitted it to us based on the meaning he understood, it would not have been the Quran—I mean the Quran that was revealed to him. If we assume that he knew all its meanings such that none of its meanings escaped him, and these are the words that denote all those meanings, why should he deviate? Even if he deviated to words that were equivalent in all those meanings, those words he deviated to, being existential entities (أعيان وجودية), would necessarily be entities other than the entities he deviated from (which were revealed to him). They would inevitably differ from them by granting an increase, by virtue of their essences, over the meanings gathered by the revealed words. The observer of the Quran would gain meanings from the essences of those deviated words that Allah did not reveal. Thus, the Prophet would have conveyed to the people what was revealed to them and what was *not* revealed to them, thereby adding a law (شرعا) to the ruling that Allah did not authorize. Similarly, he would have diminished what Allah revealed by omitting the essences of those words he deviated from. The Messenger would thus have diminished the conveyance of what was revealed to him by omitting the essences of those words—and far be it from him! Therefore, it was incumbent upon him only to convey to the people what was revealed to them as a complete form, outwardly in its verbal and written letters, and inwardly in its meanings.\n\nFor this reason, Gabriel used to descend upon Muhammad (PBUH) every Ramadan to review the Quran with him once. He had one complete recitation (ختمة) with Gabriel every Ramadan, until the last Ramadan witnessed by the Messenger of Allah (PBUH), when Gabriel reviewed it with him twice in that Ramadan. He completed two recitations. He knew that he would die in the coming year, not the year of that Ramadan. The second recitation was for the Ramadan of the year in which he died, so that the year would continue for him after his death. He died in Rabi' al-Awwal. The Quran descended on the Night of Power (ليلة القدر), which is <<خَيْرٌ مِنْ أَلْفِ شَهْرٍ>> (better than a thousand months). He brought the ultimate name of the simple number (العدد البسيط) that has no simple name after it, except what is composite, just as the Quran was the last book revealed by Allah, and the one upon whom it was revealed was the last and Seal of the Messengers. Then He added that name (a thousand) to \"month\" (شهر) in the indefinite form (بالتنكير), which includes the seasons (الفصول). The Arabic month is the measure of the moon's journey through all the degrees of the celestial sphere, by which the month appears. Had He said more than that, He would have repeated, but there is no repetition in Existence; rather, it is a new creation. Had He reduced it by mentioning days or weeks, it would not have encompassed the cutting of all the degrees of the sphere. His message would not have been comprehensive, nor would the Quran have encompassed all previous books. This is because there is no movement of a star that cuts all the degrees in a smaller cycle except the moon, which determines the Arabic month. Therefore, it descended on a night that is better than a thousand months, meaning superior to a thousand months. Superiority (الأفضل) is an increase, and the increase is its essence (عينها). He placed the superiority in the *Qadr* (قدر - Measure/Destiny), which is the station (المنزلة) with Allah for that mentioned thing. That night of descent, which is the Night of Power, corresponds to the night of the middle of Sha'ban, for it is a night that rotates throughout the entire year. As for us, we have seen it rotate throughout the year, and we have also seen it in Sha'ban, and we have seen it in Ramadan on every odd night of Ramadan, and on the eighteenth night of Ramadan, according to our fasting in that year. Whatever night Allah wills to make a location among the nights of the year for the *Qadr* (Measure) by which it is called the Night of Power, He makes it so. If that night is one of the nights of the year that has a specific virtue over other nights of the year, such as the night of Friday, the night of Arafah, the night of the middle of Sha'ban, and other known nights, the goodness of that night is added to the virtue of the *Qadr*. Thus, the Night of Power in that year is superior to the Night of Power in the year to which no other virtue is added. Know this.\n\nFrom this station (المنزل), the Trustworthy Spirit (الروح الأمين) descended upon the heart of Muhammad (PBUH) with two Surahs: Surah al-Qadr and Surah ad-Dukhan (The Smoke). They differ in ruling. Surah al-Qadr gathers what Surah ad-Dukhan disperses, and Surah ad-Dukhan disperses what Surah al-Qadr gathers. One who lacks knowledge of what he witnesses imagines that the two Surahs are opposites, failing to realize the single station (المنزل الواحد) that unites them, and failing to realize its constitution (نشأته) which arose from its combination of natural opposites. The possessor of sound unveiling (الكشف الصحيح), when he enters this station and <<كَانَ لَهُ قَلْبٌ ... وَهُوَ شَهِيدٌ>> (has a heart... and is a witness), sees that Surah al-Qadr is not opposed to Surah ad-Dukhan. Surah al-Qadr gathers what Surah ad-Dukhan grants in order to disperse it among the Levels (المراتب). Surah ad-Dukhan takes it and disperses it among the Levels, because it knows from Surah al-Qadr that it only gathered that and gave it to her so that she might disperse it. Surah al-Qadr is like the collector (الجابية) for Surah ad-Dukhan. This is the reality of the matter. They are two Surahs that have two essences (عينان), two tongues, and two lips. They recognize and bear witness for whoever enters this station that he is among the people of the Praised Station (المقام المحمود) and that he is a perfected heir.\n\nThis station encompasses the science of correspondence (المطابقة), suitability (المناسبة), and vigilance (المراقبة); the science of allusion (التلويح) and symbolism (الرمز); the science of penetrating affairs without hardship, because penetrating affairs through the path of thought is among the greatest hardships; the science of clarification (الإبانة) and unveiling (الكشف); the science of natural constitutions (النشآت الطبيعية)—whether their ruling is the same as the elemental constitutions or not; and the science of the difference between lights (الأنوار) and darknesses (الظلم); and why light and darkness return, both being veils (حجابان) between Allah and His servants. [It includes knowing] what part of these veils faces the servants and what part faces the Real; whether they are lifted for anyone or remain perpetually drawn; and whether these veils grant a definition (تحديد) of the veiled one or not. If they grant a definition of the veiled one, by what constitution is he restricted and defined—is it by an elemental or a natural constitution? If they do not restrict him, to what is he attached—is it to that part of the cosmos which does not accept localization (التحيز), so it is not described by entering or exiting bodies, or is a specific ruling passed upon him, outside the ruling of what is unlocalized, so he accepts neither place nor inherence (الحلول)? [It includes] the science of mercy (الرحمة) contained within warning (الإنذار) from whomever it came; the science of tastes (الأذواق); the science of which Names bring wretchedness and which bring felicity; the science of certain knowledge (علم اليقين); the science of transcendence (التنزيه) in Lordship (الربوبية), which is difficult to conceive; the science of the rank of knowledge (العلم) versus the rank of doubt (الشك) specifically, and what each rank grants to the one who dwells in it; the science of punishment (العذاب)—is it from the science of pains (الآلام) or the science of pleasures (اللذات)? [It includes] the science of the non-acceptance of repentance when distress descends, and its acceptance specifically from the people of Jonah; the science of the penetration of the decree of precedents (قضاء السوابق)—does it penetrate with evil upon one who is insightful, or is it restricted to the veiled ones? [It includes] the science of the layers of punishment; the science of trial (الابتلاء) and its layers; the science of counsels (النصائح); the science of the people of divine care (أهل العناية) with Allah, despite the universality of mercy for all, and yet the people of care are tried in this world with what those who are not among them are tried with in the Hereafter; and why Allah's care returns to His people despite trial and affliction—is it due to the requirement of the two abodes (الدورين) or the requirement of prior knowledge (سابق العلم)? [It includes] the science of the existence of the Real (وجود الحق) with His Faces (بوجوهه) in every single individual of the entire cosmos; the science of timing the final gathering of the three gatherings; the science of why exception (الاستثناء) returns; and the science of where ignorance, conjecture, and doubt go, and the knowledge of their companions; and the science of the precedence of death over life, although it is known that death only occurs after life. The sciences of this station are numerous. We intended to define the most important of them, those whose knowledge relates to felicity (السعادة). Although all knowledge is the essence of felicity, generally, felicity is nothing but the attainment of pleasures, the achievement of aims, and salvation from pains. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).",
    "ur": "## باب تین سو چالیس: اس منزل کی معرفت میں جہاں سے نبی اکرم صلی اللہ علیہ وسلم نے ابن صیاد کے لیے سورۃ الدخان کو چھپایا۔\n\n### بے شک اللہ نے اپنے نبی صلی اللہ علیہ وسلم کو قول سے محفوظ رکھا، اور چھپی ہوئی چیز کا علم بھی انہیں کاہن ہونے سے خارج نہیں کرتا۔\n\nقرآن عزیز سے:\n\nپس آپ صلی اللہ علیہ وسلم نے اس سے پوچھا کہ میں نے تمہارے لیے کیا چھپایا ہے؟ تو اس نے کہا: \"الدخ\" (الدخ)، جو کہ \"الدخان\" (الدخان) کی ایک لغوی شکل ہے، کیونکہ اس میں یہ آیت ہے: يَوْمَ تَأْتِي السَّماءُ بِدُخانٍ مُبِينٍ (جس دن آسمان ایک واضح دھواں لائے گا)۔ پس ابن صیاد نے اس نام کو جان لیا جسے رسول اللہ صلی اللہ علیہ وسلم نے اپنے چھپانے میں ارادہ کیا تھا اور اپنے دل میں پوشیدہ رکھا تھا۔ تو آپ صلی اللہ علیہ وسلم نے اس سے فرمایا: \"اخسأ فلن تعدو قدرك\" (دفع ہو جا، تو اپنی حد سے آگے نہیں بڑھ سکتا)۔ یعنی تمہارا یہ علم تمہیں تمہاری اس حد سے خارج نہیں کرتا جس کے لیے اللہ نے تمہیں ہلاک کیا ہے۔ اور یہ بھی روایت کیا گیا ہے: \"فلم تعد قدرك\" (تو اپنی حد سے تجاوز نہیں کر سکا)۔\n\nیعنی تمہارے اس ادراک سے جو میں نے تمہارے لیے چھپایا تھا۔ اور اس قول میں ایک راز ہے جو نبی صلی اللہ علیہ وسلم کا یہ قول اس شخص کے لیے ظاہر کرتا ہے جو اس مقام پر خالص ہو جس نے رسول اللہ صلی اللہ علیہ وسلم پر ایسا قول کہنا واجب کر دیا۔ کیونکہ آپ صلی اللہ علیہ وسلم نے جو کچھ اس کے لیے چھپایا تھا، وہ اللہ کی وحی سے اس کا امتحان نہیں لیا تھا۔ اگر وہ وحی سے ہوتا تو ابن صیاد اس پر مطلع نہ ہو سکتا، کیونکہ اللہ تعالیٰ اپنے حکم کردہ امور کی تائید میں ہوتا ہے۔ بلکہ یہ قول آپ صلی اللہ علیہ وسلم کے اس قول کی طرح تھا جو آپ نے کھجوروں کی پیوند کاری کے بارے میں فرمایا تھا۔ پس جب اس کی چھپی ہوئی چیز ظاہر ہو گئی، تو یہ اللہ کی طرف سے ایک عملی تادیب تھی تاکہ آپ صلی اللہ علیہ وسلم پر مقامِ مراقبہ (المراقبة) محفوظ رہے، اور آپ صرف شہود (الشهود) کی بنا پر ہی بات کریں، کیونکہ قرائنِ حال سے معلوم ہوتا ہے کہ نبی صلی اللہ علیہ وسلم نے جو کچھ اس کے لیے چھپایا تھا، وہ صرف اسے عاجز کرنے کے لیے چھپایا تھا، مگر اللہ نے اس سے انکار کر دیا۔\n\nپس آپ صلی اللہ علیہ وسلم نے فرمایا:\n\"إن الله أدبني فأحسن تأديبي\"\n(بے شک اللہ نے مجھے ادب سکھایا اور بہترین ادب سکھایا)۔\n\nاور اگر نبی صلی اللہ علیہ وسلم حاضرین کے سامنے اپنے چھپانے کے مقصد کو بیان کر دیتے تو حاضرین کی ایک جماعت اس وجہ سے مرتد ہو جاتی۔ لیکن اللہ نے اپنے نبی صلی اللہ علیہ وسلم کو قول سے محفوظ رکھا، اور چھپی ہوئی چیز کا علم بھی انہیں کاہن ہونے سے خارج نہیں کرتا۔ اور حاضرین کاہنوں کے معاملے اور ان کے حال کو جانتے تھے، خاص طور پر اہل یمن، حجاز اور جزیرۃ العرب کے لوگ۔ پس یہ علم حاضرین کے نزدیک انہیں ان کی حد سے خارج نہیں کرتا تھا۔ اور اس مسئلے میں عظیم امور ہیں جن کی شرح ایک عظیم معاملے تک پھیل جاتی ہے۔\n\n> ترک الرضي لا يكون\n> إلا لمن هو دون\n> فإن يكن لك حالا\n> فكل صعب يهون\n> وإن أبيت رضاه\n> فما يشاء يكون\n\nرضا کو ترک کرنا نہیں ہوتا\nمگر اس کے لیے جو کم تر ہو\nاگر تمہارے لیے کوئی حال ہو\nتو ہر مشکل آسان ہو جاتی ہے\nاور اگر تم اس کی رضا سے انکار کرو\nتو جو وہ چاہتا ہے وہی ہوتا ہے\n\nیہ وہ منزل ہے جہاں سے رسول اللہ صلی اللہ علیہ وسلم نے ابن صیاد کے لیے قرآن کی سورۃ الدخان کو چھپایا تھا۔ اور یہ ایک عظیم منزل ہے جس میں مکرِ الٰہی (المكر الإلهي) اور استدراج (الاستدراج) کا وہ پہلو ہے کہ اس کے علم کے باوجود فرشتے بھی اللہ کے مکر سے بے خوف نہیں ہوتے۔ پس عاقل شخص، اگر وہ اپنے تصرفات میں اہل اطلاع میں سے نہیں ہے، تو کم از کم یہ ہے کہ وہ اپنے ہاتھ سے، بلکہ اپنے دائیں ہاتھ سے، اس میزانِ مشروع کو نہیں ہٹاتا جس سے وہ اپنے تصرفات کو تولتا ہے۔ پس وہ اس مکر سے نفسِ امر میں محفوظ رہتا ہے اور اپنی عبودیت (عبوديته) کے لوازم اور احکام سے پلک جھپکنے کے برابر بھی خارج نہیں ہوتا۔ اسے علوم اور امور میں وہ اضافے عطا کیے جاتے ہیں جو نہ کسی آنکھ نے دیکھے، نہ کسی کان نے سنے، اور نہ کسی ممکن کے دل میں ان کا خیال آیا۔ ارواحِ مفارقہ اور دیگر کا عروج اسی سے ہو سکتا ہے۔ اسی سے سچے کی سچائی اور جھوٹے کا جھوٹ ظاہر ہوتا ہے۔ جو اس میں داخل ہو جاتا ہے، اسے حکمتِ جامعہ کا علم حاصل ہو جاتا ہے اور اس کے لیے شقی اور سعید میں تمیز ہو جاتی ہے۔ اس میں دیکھنے والوں کے احوال مختلف ہوتے ہیں۔ پس جسے زید نور دیکھتا ہے، اسے عمرو ظلمت دیکھتا ہے، اور جعفر اسے نور اور ظلمت دونوں دیکھتا ہے۔ کیونکہ اس کے ذریعے اشیاء کا کشف (الکشف) ہوتا ہے، تو وہ کہتا ہے کہ یہ نور ہے، اور جب وہ اسے اس کی عینیت کے لحاظ سے دیکھتا ہے تو کہتا ہے کہ یہ ظلمت ہے۔ اسی میں تمام منازلات (منازلات) واقع ہوتی ہیں۔ اس میں نازل ہونے والا حق (الحق) اور صعود کرنے والی خلق (الخلق) آپس میں ملتے ہیں۔ حق صعود کرنے والے سے کہتا ہے: \"کہاں جا رہے ہو؟\" وہ کہتا ہے: \"آپ کی طرف۔\" اور خلق نازل ہونے والے سے کہتی ہے: \"کہاں جا رہے ہو؟\" وہ کہتا ہے: \"تمہاری طرف۔\" پس وہ کہتا ہے: \"ہم مل گئے، آؤ تاکہ ہم میں سے ہر ایک اس سبب کو متعین کرے جس نے ہم میں سے ہر ایک پر اپنے ساتھی کی طلب واجب کی۔\" پس حق کہتا ہے: \"میں نزول کے ذریعے تمہاری طرف اس لیے آیا تاکہ تمہیں تھکاوٹ سے راحت دوں، پس میں تمہیں بغیر کسی مشقت اور تکلیف کے عطا کروں اور بخش دوں، اور تم اپنے اہل میں آرام سے رہو۔ میرا اس کے سوا کوئی مقصد نہیں تھا۔\" اور خلق کہتی ہے: \"میں عروج کے ذریعے آپ کی طرف اس لیے آئی تاکہ آپ کی تعظیم کروں اور خدمت کروں، تاکہ میں آپ کے تختِ سلطنت کے سامنے کھڑی ہو جاؤں۔ اور ملأ اعلیٰ کو معلوم ہے کہ میں آپ کا خلیفہ ہوں اور میں آپ کو ان سے زیادہ جانتا ہوں، اس خصوصیت کی بنا پر جو آپ نے مجھے عطا فرمائی ہے۔ پس جب ملأ اعلیٰ مجھے آپ کے سامنے دیکھے گا تو وہ اس ادب میں میری پیروی کرے گا جو میرے لیے آپ کے سامنے کھڑا ہونا مناسب ہے۔ پس انہیں مشاہدہ کے ذریعے آپ کے ساتھ ادب کا وہ علم حاصل ہو گا جو ان کے پاس نہیں تھا۔ کیونکہ میں نے انہیں آپ کے مقام سے جاہل پایا، باوجود اس کے کہ وہ آپ کی تسبیح کرتے ہیں اور تھکتے نہیں۔ آپ ان سے فرماتے ہیں: إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً (میں زمین میں ایک خلیفہ بنانے والا ہوں)، تو وہ اس پر اعتراض کرتے ہیں جیسا کہ آپ نے مجھے ان کا قول سنایا، حالانکہ ان کے لیے صرف سننا ہی مناسب تھا کیونکہ حکم آپ کا ہے۔ پس جب میں نے جانا کہ ان میں ادبِ الٰہی مستحکم نہیں ہوا ہے، اور آپ نے مجھے ان کی تعلیم کا حکم دیا ہے، اور میں نے دیکھا کہ حال اور فعل کے ذریعے تعلیم قول اور عمارت کے ذریعے تعلیم سے زیادہ مکمل ہے، تو میں نے آپ کی طرف عروج کا ارادہ کیا تاکہ ملأ اعلیٰ حال اور فعل کے ذریعے وہ معاملہ دیکھے جو آپ کے جلال کے ساتھ کرنا مناسب ہے۔ اور استواء (الاستواء) اشرف ترین حال ہے جس کے ساتھ آپ اپنی مخلوق پر ظاہر ہوئے، اس کے باوجود انہوں نے آپ پر اعتراض کیا، تو اگر آپ نزول فرماتے تو...\n\n...استواء (الاستواء) کی حالت سے بھی کم تر حالت میں، آسمان یا زمین میں؟ تو حق کہتا ہے: \"تم نے بہت اچھا ارادہ کیا، تم جیسا شخص ہی چیزوں کی قدر جانتا ہے۔ کیونکہ جس نے اپنی قدر اور چیزوں کی قدر کو پہچانا، اس نے میری قدر کو پہچانا اور میرا حق پورا کیا۔ کیا تم نہیں دیکھتے کہ محمد صلی اللہ علیہ وسلم پر اور ان کی امت پر جب پچاس نمازیں فرض کی گئیں تو وہ انہیں لے کر نازل ہوئے اور کچھ نہیں کہا، نہ اعتراض کیا اور نہ کہا کہ یہ زیادہ ہیں۔ پھر جب وہ موسیٰ علیہ السلام کے پاس پہنچے تو انہوں نے کہا: 'اپنے رب کے پاس واپس جاؤ، شاید وہ تمہاری امت سے تخفیف کر دے، کیونکہ میں نے بنی اسرائیل سے اس معاملے میں بڑی سختیاں جھیلی ہیں، اور تمہاری امت اس کا بوجھ اٹھانے سے عاجز ہو جائے گی اور اکتا جائے گی۔' پس محمد صلی اللہ علیہ وسلم حیران رہ گئے۔ کامل ادب (الأدب الکامل) انہیں وہ عمل عطا کرتا ہے جو انہوں نے کیا، یعنی عدمِ اعتراض، اور اپنی امت پر شفقت انہیں تخفیف کا مطالبہ کرنے پر مجبور کرتی ہے تاکہ اللہ کی عبادت اکتاہٹ، ناپسندیدگی، تھکاوٹ یا سستی کے ساتھ نہ کی جائے۔ پس وہ حیران رہے۔ یہ وہ اثر ہے جو واسطوں اور ہم نشینوں نے ڈالا۔ پس آپ صلی اللہ علیہ وسلم موسیٰ علیہ السلام کے قول اور اپنے اس عمل میں ترجیح طلب کرنے لگے جو انہوں نے اللہ کے ساتھ ادب کا حق پورا کرتے ہوئے کیا تھا۔ حالانکہ اللہ نے پہلے ہی انہیں بعض انبیاء علیہم السلام، جن میں موسیٰ علیہ السلام بھی شامل تھے، کا ذکر کرتے ہوئے فرمایا تھا: أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ (یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی، پس تم ان کی ہدایت کی پیروی کرو)۔ پس آپ صلی اللہ علیہ وسلم نے یہ تاویل کی کہ موسیٰ علیہ السلام کا یہ اشارہ ان کی ہدایت میں سے ہے۔ اور آپ کو اس وقت یہ خیال نہ آیا کہ موسیٰ علیہ السلام جب اپنی ہدایت کی حالت میں تھے تو انہوں نے تخفیف کا سوال نہیں کیا تھا۔ اور وہی ہدایت تھی جس کی پیروی کا رسول اللہ صلی اللہ علیہ وسلم کو حکم دیا گیا تھا۔ پس اس اجتہاد (الاجتہاد) نے انہیں اللہ کی طرف رجوع کرنے کی اجازت دی، اور آپ نے تخفیف کا سوال کیا۔ پس آپ اللہ تعالیٰ اور موسیٰ علیہ السلام کے درمیان بار بار رجوع کرتے رہے، یہاں تک کہ آپ نے وہ بات کہی جو ادب نے آپ کو عطا کی: \"استحييت من ربي\" (مجھے اپنے رب سے شرم آتی ہے)۔ اور تخفیف کا معاملہ دس نمازوں پر ختم ہو گیا، پس آپ اسے اپنی امت کے لیے لے کر نازل ہوئے، اور آپ کے لیے یہ مشروع کیا گیا کہ آپ اپنی امت کے لیے ان احکام میں اجتہاد (الاجتهاد) کو مشروع کریں جن سے عالم کی اصلاح ہوتی ہے، کیونکہ آپ صلی اللہ علیہ وسلم نے اجتہاد کے ذریعے اللہ اور موسیٰ علیہ السلام کے درمیان رجوع کیا تھا۔ پس آپ نے اسے اپنی امت میں نافذ کیا تاکہ وہ اس واقعے سے مانوس ہوں اور وحشت محسوس نہ کریں۔ اور اس تشریع کے ذریعے موسیٰ علیہ السلام کے دل کو اس معاملے میں تسلی دی گئی۔ کیونکہ جب وہ اپنے نفس کی طرف رجوع کریں گے اور بندوں پر شفقت کا حکم ان سے زائل ہو جائے گا، تو ان کے ساتھ حق کی تعظیم اور اس کے جلال کے لیے جو مناسب ہے، وہ قائم ہو جائے گا۔ پس وہ اس کے حق میں کسی چیز کو زیادہ نہیں سمجھیں گے اور جان لیں گے کہ قوت اس کے ہاتھ میں ہے، وہ جسے چاہتا ہے قوت دیتا ہے۔ اور اگر ان کے دل میں ایسا خیال آئے گا اور حق انہیں اس میں قائم کرے گا، تو انہیں محمد صلی اللہ علیہ وسلم سے کہی گئی بات پر ندامت کا اثر ضرور محسوس ہو گا۔ پس اللہ نے ان کے دل کو اپنے اس قول سے تسلی دی: ما يُبَدَّلُ الْقَوْلُ لَدَيَّ (میرے ہاں بات بدلی نہیں جاتی) آخری رجوع کے وقت۔ حالانکہ پہلے کثرت کا قول ہو چکا تھا اور اسے تخفیف اور کمی سے بدل دیا گیا تھا۔ پس موسیٰ علیہ السلام نے جان لیا کہ قولِ الٰہی میں سے کچھ وہ ہے جو تبدیلی قبول کرتا ہے اور کچھ وہ ہے جو تبدیلی قبول نہیں کرتا، اور وہ تب ہے جب اس کی طرف سے قول حق ہو جائے۔ پس قولِ واجب تبدیل نہیں ہوتا اور قولِ معروض تبدیلی قبول کرتا ہے۔ پس موسیٰ علیہ السلام اس قول سے خوش ہوئے کہ انہوں نے جو بات کی تھی وہ صرف عرضِ قول میں تھی نہ کہ اس کے حق میں۔ اسی طرح جب اللہ نے محمد صلی اللہ علیہ وسلم کی امت کے لیے احکام کے نفاذ میں اجتہاد کو مشروع کیا، محمد صلی اللہ علیہ وسلم کے اجتہاد کی وجہ سے، تو اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم کے دل کو اس معاملے میں تسلی دی جو ان سے سرزد ہوا تھا۔ اور یہ چیز آپ صلی اللہ علیہ وسلم کی امت میں سرایت کر گئی، جیسا کہ آدم کے انکار اور بھولنے کی وجہ سے بنی آدم میں انکار اور نسیان سرایت کر گیا۔ آدم کے دل کی تسلی اس لیے ہوئی کہ یہ طبعی نشأت (النشأة الطبيعية) ہے، اور اس میں انکار اور نسیان طبیعت کے حکم میں سے ہے۔ پس آدم کی انکار میں حرکت ایک طبعی حرکت تھی اور ان کے نسیان میں ایک طبعی اثر تھا۔ اگر وہ تناسی (بھولنے کی کوشش) کرتے تو یہ معاملہ طبیعت کی حرکت سے ہوتا، جیسا کہ انکار، اس لحاظ سے کہ یہ انکار ہے، ایک طبعی اثر ہے، اور اس لحاظ سے کہ یہ کسی خاص چیز کا انکار ہے، یہ ایک طبعی حکم ہے نہ کہ اثر۔ پس یہ فرق ہے طبیعت کے حکم اور اس کے اثر کے درمیان۔ اور نسیان اس کے اثر میں سے ہے اور تناسی اس کے حکم میں سے ہے۔ اور غفلت اس کے اثر میں سے ہے اور تغافل اس کے حکم میں سے ہے۔ اور اللہ کے علماء میں سے بہت کم ہیں جو طبیعت کے حکم اور اس کے اثر میں فرق کرتے ہیں۔ پس آدم میں طبیعت کا حکم انکار کے ذریعے جمع ہوا، کیونکہ وہ پہلے جامع تھے جن کی پشت میں منکرین موجود تھے، پس انہوں نے ان پر انکار کا حکم لگایا، تو انہوں نے انکار کیا، کیونکہ بیٹے کا اپنے باپ میں اثر ہوتا ہے۔ پس اگرچہ انکار طبیعت کے حکم میں سے ہے، لیکن یہ ان کے بیٹوں میں سے منکرین کے اثر میں سے ہے۔ کیونکہ آدم انسان کامل (الإنسان الکامل) ہیں۔ اسی طرح ان سے واقع ہونے والا نسیان طبیعت کے اثر اور بیٹوں کے حکم میں سے ہے، کیونکہ وہ اپنی پشت میں اپنے بیٹوں میں سے بھولنے والوں کو اٹھائے ہوئے تھے۔ پس انہوں نے ان پر نسیان کا حکم لگایا۔ پس دیکھو یہ امور کتنے عجیب ہیں اور مکاشفہ (المکاشفۃ) کے فتوحات سے کیسے علوم عطا ہوتے ہیں۔ اور جو کچھ ہم نے ذکر کیا وہ سب اس منزل کے احکام میں سے ہے۔ اور اس کے لیے حضرتِ الٰہیہ (الحضرة الإلهية) سے غیب (الغیب) ہے، اور عالمِ طبیعی (العالم الطبيعي) کے اعیان سے طبیعت (الطبيعة) ہے، اور عالمِ شہادت (عالم الشهادة) سے ظلمت (الظلمة) ہے۔ پس شہادت میں تم ظلمت کو دیکھتے ہو لیکن اس کے ذریعے نہیں دیکھا جاتا۔ اور طبیعت میں تم جانتے ہو لیکن دیکھتے نہیں، اور اس کا اثر دیکھا جاتا ہے اور اس کے ذریعے دیکھا جاتا ہے۔ اور غیب (الغیب) میں دیکھا جاتا ہے اور اس کے ذریعے دیکھا جاتا ہے، باوجود اس کے کہ اس پر غیب کا نام باقی رہتا ہے۔ اور ہم نے یہ اس لیے کہا کہ نام احکام کی تبدیلی سے بدل جاتے ہیں، خاص طور پر اسماءِ الٰہیہ (الأسماء الإلهية) میں، کیونکہ حکم نام کو دوسرے نام میں بدل دیتا ہے جسے وہ حکم طلب کرتا ہے، حالانکہ عین ایک ہی ہوتی ہے۔ اور شرائع کے احکام میں اس کے برعکس ہوتا ہے: احکام کی تبدیلی احوال اور اسماء کی تبدیلی کے تابع ہوتی ہے، حالانکہ عین ایک ہی ہوتی ہے۔ امام مالک بن انس، جو ائمہ دین میں سے ہیں، سے پوچھا گیا کہ آپ سمندری خنزیر (خنزير البحر) کے بارے میں کیا کہتے ہیں جو بعض مچھلیوں میں سے ہے؟ تو انہوں نے فرمایا: \"وہ حرام ہے۔\" ان سے کہا گیا: \"تو سمندر کی مچھلی اور اس کے جانور اور اس کا مردار حلال ہے؟\" تو انہوں نے فرمایا: \"تم نے اسے خنزیر نام دیا ہے، اور اللہ نے خنزیر کو حرام کیا ہے۔\" پس نام کی تبدیلی کی وجہ سے مالک کے نزدیک حکم بدل گیا۔ اگر وہ ان سے کہتے کہ آپ سمندر کی مچھلی یا سمندر کے جانوروں کے بارے میں کیا کہتے ہیں، تو وہ حلال ہونے کا حکم دیتے۔ اسی طرح احوال کی تبدیلی احکام کو بدل دیتی ہے۔ ایک ہی شخص جس کی حالت اضطرار کی نہیں تھی، اس پر مردار کھانا حرام ہے۔ لیکن جب وہی شخص مضطر ہو جاتا ہے تو اس کے لیے مردار کھانا حلال ہو جاتا ہے۔ پس حال کے اختلاف کی وجہ سے حکم مختلف ہو گیا، حالانکہ عین ایک ہی ہے۔\n\n### بے شک اللہ تعالیٰ طبعی صورتوں میں ظہور الٰہی (التجلی) کو قبول کرتا ہے۔\n\nاور جان لو کہ اللہ تعالیٰ اس منزل سے طبعی صورتوں میں، ان کی کثیف اور لطیف اور شفاف صورتوں میں، اہل برازخ (البرازخ) اور قیامت کے لیے ظہور الٰہی (التجلی) کو قبول کرتا ہے۔ اور قیامت ایک برزخ (برزخ) ہے۔ اور وجود میں برازخ کے سوا کچھ نہیں ہے، کیونکہ یہ دو چیزوں کے درمیان ایک چیز کو منظم کرتا ہے، جیسے زمانِ حال جسے دائم (الدائم) کہا جاتا ہے۔ اور معنوی اشیاء دائرے (دور) ہیں اور حسی اشیاء کروی (أكر) ہیں۔ پس کائنات میں کوئی کنارہ (طرف) نہیں ہے، کیونکہ دائرے کا کوئی کنارہ نہیں ہوتا۔ پس اس کا ہر جز دو جزوں کے درمیان ایک برزخ ہے۔ اور یہ ایک شریف علم ہے اس کے لیے جو اسے جانتا ہے۔ اور اسی وجہ سے انسان کامل (الإنسان الکامل) میں اس کی نشأت میں دو طبعی صورتوں کو جمع کیا گیا ہے۔ پس اسے ایک تاریک، کثیف جسم کے ساتھ پیدا کیا گیا، اور ایک لطیف جسم کے ساتھ جو اس کثیف جسم میں اٹھایا گیا ہے، جسے روح (روح) کا نام دیا گیا ہے۔ اسی کے ذریعے وہ حیوان بنا، اور وہ بخار ہے جو دل کے جوف سے نکل کر بدن کے اجزاء میں پھیلتا ہے اور اس میں نشوونما اور احساس عطا کرتا ہے۔ اور اسے تمام عالم کے برعکس قوتِ مفکرہ (القوة المفكرة) کے ساتھ خاص کیا گیا ہے، جس کے ذریعے وہ امور کی تدبیر کرتا ہے اور انہیں تفصیل سے بیان کرتا ہے۔ اور عالم میں کسی اور کے لیے یہ نہیں ہے۔ کیونکہ وہ صورتِ الٰہیہ (الصورة الإلهية) پر ہے، اور اس کی صورت سے وہ امر کی تدبیر کرتا ہے اور آیات کو تفصیل سے بیان کرتا ہے۔ پس انسان کامل وہ ہے جس کے لیے صورتِ الٰہیہ مکمل کر دی گئی ہو، اور وہ صرف مرتبے کے ساتھ ہی کامل ہوتا ہے۔ اور جو اس سے نیچے اترتا ہے، اس کے پاس صورت اتنی ہی ہوتی ہے جتنی اس کے پاس ہے۔ کیا تم نہیں دیکھتے کہ حیوان سنتا ہے، دیکھتا ہے، اور بو، ذائقے، گرم اور ٹھنڈے کو محسوس کرتا ہے، لیکن اسے انسان نہیں کہا جاتا، بلکہ وہ اونٹ، گھوڑا، پرندہ یا کوئی اور چیز ہے۔ پس اگر اس میں صورت مکمل ہو جاتی تو اسے انسان کہا جاتا۔ اسی طرح انسان کامل نہیں ہوتا تو اس سے عام نام زائل ہو کر خاص نام کی طرف منتقل نہیں ہوتا۔\n\nوہ خلیفہ (خليفة) نہیں کہلاتا مگر اس میں صورتِ الٰہیہ کے کمال کے ساتھ، کیونکہ عالم صرف اسی کی طرف دیکھتے ہیں۔ اور اسی وجہ سے جب فرشتوں نے آدم میں صرف طبعی، جسمانی، تاریک، عنصری، کثیف صورت کو دیکھا تو انہوں نے وہ بات کہی جو انہوں نے کہی۔ پس جب اللہ نے انہیں اس میں صورت کے کمال کے بارے میں بتایا اور انہیں اس کے لیے سجدہ کرنے کا حکم دیا، تو انہوں نے فوراً سجدہ کیا، خاص طور پر جب اللہ نے انہیں اسماء کی تعلیم کے ذریعے عملی طور پر ظاہر کر دیا۔ اور اگر اللہ انہیں تعلیم نہ دیتا اور صرف یہ کہتا کہ میں نے اسے صورت اور شکل عطا کی ہے، تو وہ اسے ایمان کے طور پر قبول کرتے اور اللہ کے حکم کی وجہ سے اس کے ساتھ وہی معاملہ کرتے جو انہوں نے کیا تھا۔ پس جب انسان کو انسان کامل (الإنسان الکامل) پر کشف (الکشف) ہوتا ہے اور وہ حق کو اس صورت میں دیکھتا ہے جو انسان کامل کو پہنائی گئی ہے، تو وہ دونوں صورتوں کے درمیان حیرت میں رہتا ہے، اسے معلوم نہیں ہوتا کہ وہ کس کے لیے سجدہ کرے۔ پس اسے اس مقام پر اختیار دیا جاتا ہے کہ اس پر یہ آیت تلاوت کی جائے: فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله (پس تم جس طرف بھی رخ کرو گے، وہیں اللہ کا چہرہ ہے)۔ پس انسان میں اس کی صورت کے لحاظ سے اللہ کا چہرہ ہے، اور حق کے پہلو میں اس کی عینیت کے لحاظ سے اللہ کا چہرہ ہے۔ پس کوئی چیز اس کے سجدے سے پہلے سجدہ نہیں کرتی۔ بے شک اللہ صورت کے لیے سجدہ قبول کرتا ہے جیسا کہ وہ عین کے لیے قبول کرتا ہے۔\n\nجیسا کہ رسول اللہ صلی اللہ علیہ وسلم اسی طرح کے مقام پر ایک دوسری منزل میں حیران ہوئے، جب انہیں معراج کے دوران کہا گیا اور وہ اکیلے نور میں کھڑے کیے گئے، تو انہیں وحشت ہوئی۔ اور ان کی وحشت کا سبب یہ تھا کہ انہیں ان کے عنصری جسم کے ساتھ معراج کرائی گئی تھی، پس ان کے اصل سے نکلنے اور غیر منزل میں کھڑے ہونے کی وجہ سے انہیں وحشت نے آ لیا۔ پس آپ صلی اللہ علیہ وسلم کو اس سے صرف وہی حقیقت وحشت میں مبتلا کر سکی جو عناصر سے آپ میں ظاہر ہوئی تھی۔ پس جس نے انہیں پکارا، اس نے ابوبکر (أبي بكر) کی آواز میں پکارا، کیونکہ آپ صلی اللہ علیہ وسلم اس سے انس کے عادی تھے۔ پس آپ نے اس پکار سے انس محسوس کیا اور اس کی طرف کان لگایا، اور ابوبکر کی آواز سے وہ وحشت زائل ہو گئی۔ پس جب آپ اس مقام سے اللہ کے پاس داخل ہونے کا ارادہ کرنے لگے تو آپ سے کہا گیا: \"قف يا محمد إن ربك يصلي\" (اے محمد! ٹھہر جاؤ، بے شک تمہارا رب نماز پڑھ رہا ہے)۔ پس آپ کو اللہ کی طرف نماز کی نسبت پر حیرت ہوئی۔ اور محمد صلی اللہ علیہ وسلم اس وقت کامل صورتِ الٰہیہ (الصورة الإلهية الکاملة) کے مقام پر تھے جسے نماز اور سجدہ کے ذریعے استقبال کیا جاتا ہے۔ پس جب آپ قریب ہوئے تو آپ کے رب نے آپ کے لیے نماز کے ذریعے آپ کا استقبال کیا، حالانکہ آپ کو اس کا علم نہیں تھا۔ پس کلام سے منسوب اسمِ علیم (الاسم العليم) نے انہیں ابوبکر کی آواز میں پکارا تاکہ انہیں ابوبکر کے مرتبے سے آگاہ کرے اور انہیں اس سے انس دلائے: \"ٹھہر جاؤ، بے شک تمہارا رب نماز پڑھ رہا ہے۔\" اور ٹھہرنا ثبات ہے، اور وہ نماز پڑھنے والے کے لیے قبلہ ہے۔ پس آپ ٹھہر گئے، اور اس خطاب نے انہیں خوفزدہ کر دیا، کیونکہ اس وقت ان کا حال تسبیح تھا جس کی روح لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں ہے)۔ پس یہی چیز تھی جس نے انہیں خوفزدہ کیا۔ پس جب اس وقت ان پر یہ آیت تلاوت کی گئی: هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ ومَلائِكَتُهُ لِيُخْرِجَكُمْ من الظُّلُماتِ إِلَى النُّورِ (وہی ہے جو تم پر رحمت بھیجتا ہے اور اس کے فرشتے بھی تاکہ تمہیں تاریکیوں سے نکال کر نور کی طرف لائے)، تو آپ کو وہ یاد آیا جو اللہ نے آپ پر قرآن میں نازل کیا تھا۔ پس اللہ کی طرف نماز کی نسبت کا خوف زائل ہو گیا، اس یاد دہانی کی وجہ سے۔ اور معراج کا معاملہ جو کچھ تھا، وہ ہوا۔ اور اس کا ایک اور مقام ہے جسے ہم ان شاء اللہ وہاں ذکر کریں گے۔ پس جسے اللہ نے دونوں صورتوں کے درمیان کھڑا کر دیا، وہ پرواہ نہیں کرتا کہ وہ کس کے لیے سجدہ کرے۔ پس اگر وہ شخص جسے دونوں صورتوں کا کشف ہوا ہے، دونوں صورتوں کو مصافحہ کرتے ہوئے دیکھے، نہ کہ ایک کا دوسرے کو سجدہ کرنا، تو یہ اس کے لیے اس خاص انسان کے حق میں صورت کے کمال کی علامت ہے۔ اور اگر وہ انسانی صورت کا دوسری الٰہی صورت کو سجدہ کرنا دیکھے، تو وہ اس وقت جان لے کہ کامل انسانی صورت عینیت کے مشاہدے کے مقام پر ہے نہ کہ صورت کے مشاہدے کے، پس وہ اس کے لیے سجدہ کرنے میں اس کی موافقت کرتا ہے۔ اور اگر وہ الٰہی صورت کا انسانی صورت کو سجدہ کرنا دیکھے، تو یہ اس کے قول: هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ (وہی ہے جو تم پر رحمت بھیجتا ہے) میں سے ہے، تو وہ سجدہ کرنے میں اس کی موافقت نہیں کرے گا۔ اگر وہ موافقت کرے گا تو ہلاک ہو جائے گا۔ بلکہ جو اس مقام پر پہنچ جاتا ہے، وہ امور کو ان کی حقیقت کے مطابق جانتا ہے۔ کیونکہ وہ جانتا ہے کہ اللہ کی طرف سے نماز کامل بندے پر ہوتی ہے، نہ کہ کامل بندے کے لیے۔ اور کامل بندے کی طرف سے نماز اللہ کے لیے ہوتی ہے، نہ کہ اللہ پر۔ اور جسے یہ فرقان (الفرقان) حاصل ہو گیا، اس نے قرآن اور فرقان دونوں کو جمع کر لیا۔ اور یہ ایک عزیز مشہد ہے، میں نے اس کا کوئی ذائقہ چکھنے والا نہیں دیکھا، اور یہ کامل ترین معارف (المعارف) میں سے ہے۔ اور جب قرآن نازل ہوا تو وہ محمد صلی اللہ علیہ وسلم کے قلب پر نازل ہوا، اور ہمیشہ تلاوت کرنے والوں کے قلوب پر نازل ہوا جو ان کے سینوں کے اندر ان کے جسموں میں ہیں، میرا مطلب وہ لطیف انسانی روح نہیں جو متحیز نہیں ہوتی اور دخول و خروج کی صفت قبول نہیں کرتی۔ پس ناطقہ نفس (النفس الناطقة) کے لیے سینے میں موجود قلب قائم ہوتا ہے تاکہ وہ اس کے لیے اس مصحفِ مکتوب کا مقام بن جائے جو آنکھوں کے لیے ہے۔ پس وہاں سے ناطقہ نفس اسے حاصل کرتی ہے۔ اور اس کا سبب یہ ہے کہ جب اسے مرکب کثیف جسم پر برتری اور فضیلت حاصل ہوئی، اس تدبیر اور تصرف کی وجہ سے جو اسے عطا کیا گیا تھا، اور اس نے اسے مرتبے میں اپنے سے کم تر دیکھا، اس جہالت کی وجہ سے کہ معاملہ کیا ہے، اور اسے معلوم نہ تھا کہ یہ اس کے کمال کی تکمیل کرنے والے امور میں سے ہے۔ پس اللہ نے جسم کے اندر سینے میں موجود قلب کو ایک مصحف اور مرقوم کتاب بنا دیا، جس میں ناطقہ نفس دیکھتی ہے، پس وہ علم سے متصف ہوتی ہے اور اس آیت کے مطابق مزین ہوتی ہے جسے وہ دیکھتی ہے۔ پس وہ اس محل کی محتاج ہوتی ہے، اس فائدے کی وجہ سے جو اسے اس کے سبب سے حاصل ہوتا ہے، کیونکہ حق نے اسے اپنے کلام کا محل بنایا اور اس میں اسے رقم کیا۔ پس وہ اس برتری سے نیچے اتر آئی جس پر اسے ناز تھا، اور اس نے اپنی قدر کو پہچانا اور دیکھا کہ وہ قلب فرشتوں کے نزول کی جگہ ہے، اس روح کے ساتھ جو اللہ کا کلام ہے۔ اور اس نے دیکھا کہ وہ نازل ہونے والے فرشتے اسے نہیں دیکھتے اور نہ اس سے بات کرتے ہیں، بلکہ وہ صرف اس چیز کو قلب میں رقم کرتے ہیں جسے وہ نازل کرتے ہیں، اور نفس اس میں مرقوم چیز کو پڑھتا ہے۔ پس وہ اللہ سے اپنے فہم میں جانتی ہے کہ اللہ کا ارادہ اس سے اس کی تعلیم اور تادیب کرنا ہے، اس خلل کی وجہ سے جو اسے اپنے نفس پر عجب کی صورت میں لاحق ہوا تھا۔ پس اس نے اقرار کیا اور اعتراف کیا کہ اللہ کی نسبت ہر چیز سے ایک ہی ہے، بغیر کسی فضیلت کے۔ پس اس نے اپنے لیے مخلوقات میں سے کسی پر بھی کوئی برتری نہیں دیکھی، نہ ملأ اعلیٰ پر اور نہ ادنیٰ پر، اور نہ عالم میں کوئی فضیلت یا ترجیح دیکھی، لیکن یہ دلالت اور حق کی نسبت کے لحاظ سے ہے، نہ کہ اس لحاظ سے کہ وہ عالم ہے۔ کیونکہ عالم ہونے کے لحاظ سے ان میں سے بعض کی بعض پر ترجیح ہوتی ہے اور اس میں تفاوت ظاہر ہوتا ہے۔\n\nپس جان لو کہ انسان کی ناطقہ نفس (النفس الناطقة) کے ساتھ جب اللہ بھلائی کا ارادہ کرتا ہے، تو وہ اس کے لیے اس کے بدن کے تمام اجزاء کے نطق کو کھول دیتا ہے، جو سب کے سب اللہ کی تسبیح اور اس کی حمد کے ساتھ ثناء کر رہے ہوتے ہیں، نہ کہ اپنی طرف سے حمد کے ساتھ۔ اور وہ ان میں کوئی سستی، غفلت یا مشغولیت نہیں دیکھتی۔ اور وہ اپنی ذات کو اللہ کے لیے واجب ذکر سے غافل، کوتاہی کرنے والی، اپنی اغراض میں اللہ سے مشغول، اور ان امور کی طرف متوجہ دیکھتی ہے جو اسے اللہ سے اور اس کی حدود پر ٹھہرنے سے روکتے ہیں۔ پس عالم اس کے نزدیک عظیم ہو جاتا ہے، اور وہ جانتی ہے کہ یہ اللہ کے شعائر ہیں جن کی تعظیم اس پر واجب ہے، اور اللہ کی حرمتیں ہیں۔ اور اس کا اپنا نفس اس کے نزدیک چھوٹا ہو جاتا ہے، اور وہ جانتی ہے کہ اگر وہ اپنے جسم سے ممتاز ہو جاتی اور اس کا جسم اس کی نشأت میں اس کے لیے مکمل کرنے والا نہ ہوتا، تو وہ جان لیتی کہ وہ جسم جو اس کی تدبیر کرتا ہے، اس سے زیادہ اشرف ہے۔ پس جب اس نے جان لیا کہ وہ جسم اس سے زیادہ اشرف ہے، تو اس نے جان لیا کہ اس کی ان صفات پر جو شرافت ہے، وہ اس کی اپنی شرافت کی عین ہے، اور اسے اس کی تدبیر کا حکم نہیں دیا گیا اور اس کے حق میں اسے استعمال نہیں کیا گیا اور اسے اس کے لیے خادم کی طرح نہیں بنایا گیا، اور اس کے حقوق اس پر واجب نہیں کیے گئے، جیسے اس کی آنکھ اور کان وغیرہ، مگر اس لیے کہ وہ اللہ کے ساتھ مشغول ہے اور اپنے خالق کی تسبیح کر رہا ہے۔ پس اس نے اپنے نفس کو جان لیا کہ وہ اس کے لیے مسخر ہے۔ اگر وہ اللہ کے ساتھ مشغولیت میں اسی طرح مشغول ہوتی تو اسے اپنے جسم کا حکم حاصل ہوتا۔ اور اگر جسم کو اپنی ذات کی تدبیر کے لیے مقرر کر دیا جاتا تو وہ تسبیح سے مشغول ہو جاتا، جیسا کہ انسانی نفس مشغول ہو گیا ہے۔ اور جب وہ جان لیتی ہے کہ وہ اپنے جسم کے حق میں مسخر ہے، تو وہ اپنی قدر کو پہچانتی ہے اور یہ کہ وہ مطالبے، مؤاخذے، سوال اور حساب کے معرض میں ہے۔ پس دارِ تکلیف میں اس پر واجب ہو جاتا ہے کہ وہ اللہ کے لیے، اور اپنے سے باہر کے عالم کے لیے، اور اپنے نفس کے لیے ان حقوق کو ادا کرے جو اس کا جسم اس سے طلب کرتا ہے۔ اور اس مشغولیت کے ساتھ وہ فضیلت کو دیکھنے یا مراتب کی معرفت کی طرف متوجہ نہیں ہوتی۔ اور یہ مرتبہ، یعنی حقوق کی ادائیگی کا مرتبہ (مرتبة أداء الحقوق)، انسان کے حق میں اشرف ترین مراتب میں سے ہے۔ اور خسارہ پانے والا وہ ہے جو اس سے مشغول ہو جائے، جیسا کہ نفع پانے والا وہ ہے جو اس میں مشغول ہو۔\n\n### بے شک اللہ تعالیٰ جب کسی چیز کا ذکر ضمیرِ غائب کے ساتھ کرتا ہے تو وہ اس سے غائب نہیں ہوتی۔\n\nاور جان لو کہ اللہ تعالیٰ جب تمہارے لیے کسی چیز کا ذکر ضمیرِ غائب (ضمير الغائب) کے ساتھ کرتا ہے تو وہ اس سے غائب نہیں ہوتی، بلکہ اس نے مخاطب یعنی تمہارا لحاظ رکھا ہے، اور مذکورہ چیز تم سے غائب ہے۔ اور جب وہ اسے ضمیرِ حضور (ضمير الحضور) کے ساتھ ذکر کرتا ہے، اشارے وغیرہ سے، تو وہ تمہارا لحاظ رکھتا ہے۔ اور اس کے شہود (شہود) کا لحاظ ہر حال میں ضروری ہے۔ لیکن اللہ کے قول اور کہنے والوں کے اقوال جو وہ نقل کرتا ہے، ان میں فرق کیا جاتا ہے۔ پس جب حق بندے کی سماعت اور بصارت بن جاتا ہے، تو بندے کے حق میں غیبت زائل ہو جاتی ہے۔ پس وہ اس وقت اس چیز سے مخاطب نہیں ہوتا جس میں ضمیرِ غائب ہو۔ حالانکہ جس کی یہ صفت ہے، اسے ضمیرِ غائب کے ساتھ خطاب کیا گیا ہے۔ تو معاملہ کیا ہے؟ ہم کہتے ہیں: جب بندے پر قرآن نازل ہوا، تو اسے مکلفین تک پہنچانے اور لوگوں کے لیے اس کی وضاحت کرنے کا حکم دیا گیا جو ان پر نازل ہوا ہے۔ اور بعض چیزیں ان کے لیے مشہود ہیں اور ان سے غائب ہیں۔ اور اسے کلمات کو ان کی جگہوں سے ہٹانے کا حکم نہیں دیا گیا، بلکہ وہ اللہ کی طرف سے اسی طرح بیان کرے جیسا کہ اللہ نے اسے کہنے والوں کا قول سنایا، اور ان کے قول میں غیبت اور حضور دونوں شامل ہیں۔ پس اس نے ان کے قول کو نقل کرنے میں اس سے زیادہ کچھ نہیں کیا جو انہوں نے کہا تھا۔ اور اسے کہا گیا: بَلِّغْ ما أُنْزِلَ إِلَيْكَ (جو کچھ تمہاری طرف نازل کیا گیا ہے، اسے پہنچا دو)۔ پس اس نے اس صورت سے انحراف نہیں کیا جو اس پر نازل کی گئی تھی۔ پس اس نے وہی کہا جو اسے کہا گیا، کیونکہ معانی اس کے قلب پر ان حروف کی ترکیب، ان کلمات کی ترتیب، ان آیات کے نظم اور ان سورتوں کی تخلیق کے بغیر نازل نہیں ہوئے، جسے یہ سب قرآن کہا جاتا ہے۔ پس جب اللہ نے قرآن کی نشأت کو بذاتِ خود ایک صورت میں قائم کیا، تو اسے اسی طرح ظاہر کیا جیسا کہ اس نے اسے مشاہدہ کیا تھا۔ پس آنکھوں نے اسے مصاحف میں دیکھا اور کانوں نے اسے تلاوت کرنے والوں سے سنا۔ اور یہ مسموع اور مبصر کلام اللہ کے سوا کچھ نہیں ہے۔ اور اس نے اس شخص کی مذمت کی جس نے اسے سمجھنے کے بعد تحریف کی، حالانکہ وہ جانتا تھا کہ یہ اللہ کا کلام ہے۔ پس اس نے اس کی صورت کو اسی طرح باقی رکھا جیسا کہ وہ نازل ہوا تھا۔ اگر وہ اس میں سے کچھ بدل دیتا اور نشأت کو تبدیل کر دیتا، تو ہم تک اس کے فہم کی صورت پہنچتی، نہ کہ اس چیز کی صورت جو اس پر نازل ہوئی تھی۔ کیونکہ اس قرآن کے نازل ہونے والے ہر شخص کی آنکھ اس میں ایک نظر رکھتی ہے۔ اگر وہ اسے اپنے فہم کے معنی پر ہم تک منتقل کرتا تو وہ قرآن نہ ہوتا، میرا مطلب وہ قرآن جو اس پر نازل ہوا تھا۔ اگر ہم فرض کریں کہ اس نے اس کے تمام معانی کو جان لیا، یہاں تک کہ کوئی چیز اس کے معانی سے نہیں چھوٹی، تو ہم کہیں گے: اگر اس نے یہ جان لیا اور یہ وہ کلمات ہیں جو ان تمام معانی پر دلالت کرتے ہیں، تو وہ کیوں انحراف کرے؟ اور اگر وہ ایسے کلمات کی طرف انحراف کرتا ہے جو ان تمام معانی میں ان کے برابر ہوں، تو جن کلمات کی طرف وہ انحراف کرے گا، وہ وجودی اعیان ہونے کے لحاظ سے ان اعیان سے مختلف ہوں گے جن سے اس نے انحراف کیا جو اس پر نازل ہوئے تھے۔ پس وہ ان سے ضرور مختلف ہوں گے، اس اضافے کی وجہ سے جو وہ اپنی اعیان کے لحاظ سے عطا کرتے ہیں، ان معانی پر جو نازل شدہ کلمات نے جمع کیے تھے۔ پس قرآن میں دیکھنے والے کے لیے ان کلمات کے اعیان کے معانی میں اضافہ ہو جائے گا جن کی طرف انحراف کیا گیا، حالانکہ اللہ نے انہیں نازل نہیں کیا۔ پس نبی نے لوگوں کو وہ پہنچایا جو ان پر نازل ہوا تھا اور وہ بھی جو ان پر نازل نہیں ہوا تھا۔ پس وہ حکم میں ایک ایسی شریعت کا اضافہ کریں گے جس کی اللہ نے اجازت نہیں دی، جیسا کہ وہ اللہ کے نازل کردہ کلمات کے اعیان میں کمی بھی کریں گے جن سے انحراف کیا گیا تھا۔ پس رسول نے اس چیز کی تبلیغ میں کمی کی جو ان پر نازل ہوئی تھی، یعنی ان کلمات کے اعیان میں۔ اور وہ اس سے پاک ہیں۔ پس ان کے لیے یہی مناسب تھا کہ وہ لوگوں تک وہ پہنچائیں جو ان پر نازل ہوا تھا، ایک مکمل صورت میں، ظاہری لحاظ سے اس کے لفظی اور رقمی حروف، اور باطنی لحاظ سے اس کے معانی۔\n\nاور اسی وجہ سے جبرائیل (جبريل) ہر رمضان میں محمد صلی اللہ علیہ وسلم پر نازل ہوتے تھے اور ایک بار قرآن کا دور کرتے تھے۔ پس ہر رمضان میں ان کی جبرائیل علیہ السلام کے ساتھ ایک ختم ہوتی تھی، یہاں تک کہ آخری رمضان آیا جس میں رسول اللہ صلی اللہ علیہ وسلم نے شرکت کی، تو جبرائیل نے اس رمضان میں دو بار ان کے ساتھ دور کیا، پس دو ختمیں ہوئیں۔ پس آپ نے جان لیا کہ آپ آنے والے سال میں وفات پائیں گے، نہ کہ اس رمضان کے سال میں۔ پس دوسری ختم اس سال کے رمضان کے لیے تھی جس میں آپ کی وفات ہوئی، تاکہ وہ سال آپ کی وفات کے بعد بھی آپ کے لیے ہو۔ پس آپ ربیع الاول میں وفات پا گئے۔ اور قرآن کا نزول شبِ قدر (ليلة القدر) میں ہوا جو خَيْرٌ من أَلْفِ شَهْرٍ (ہزار مہینوں سے بہتر ہے)۔ پس اس نے سادہ عدد کے اسماء کی انتہا کو لایا، جس کے بعد کوئی سادہ اسم نہیں ہے مگر وہ جو مرکب ہوتا ہے، جیسا کہ قرآن اللہ کی طرف سے نازل ہونے والی آخری کتاب تھی، جیسا کہ جس پر وہ نازل ہوا وہ آخری رسول اور خاتم تھے۔ پھر اس نے اس اسم، جو کہ ہزار ہے، کو \"شہر\" (مہینے) کے ساتھ تنکیر کے ساتھ جوڑ دیا، پس اس میں فصول داخل ہو گئیں۔ اور عربی مہینہ چاند کی گردش کے لیے پورے فلک کے درجات کے منازل کو قطع کرنے کی مقدار ہے، جس سے مہینہ ظاہر ہوتا ہے۔ اگر وہ اس سے زیادہ کہتا تو تکرار ہوتی، اور وجود میں تکرار نہیں ہے، بلکہ وہ ایک نئی تخلیق ہے۔ اور اگر وہ دنوں یا ہفتوں کا ذکر کر کے کمی کرتا تو وہ فلک کے درجات کو قطع کرنے کو پورا نہ کرتا۔ پس نہ تو آپ کی رسالت عام ہوتی اور نہ ہی قرآن اپنے سے پہلے کی تمام کتابوں کو عام کرتا، کیونکہ کسی ستارے کی کوئی گردش نہیں ہے جو سب سے چھوٹے دور میں تمام درجات کو قطع کرے سوائے چاند کے جس سے عربی مہینہ بنتا ہے۔ اسی لیے یہ ایک ایسی رات میں نازل ہوا جو ہزار مہینوں سے بہتر ہے، یعنی ہزار مہینوں سے افضل ہے۔ اور افضلیت اضافہ ہے، اور اضافہ اس کی عینیت ہے۔ اور افضلیت کو قدر (القدر) میں رکھا گیا، جو کہ اللہ کے نزدیک اس مذکورہ چیز کا مرتبہ ہے۔ اور وہ رات جس میں یہ نازل ہوا، جو کہ شبِ قدر ہے، شبِ نصف شعبان کے موافق تھی۔ کیونکہ یہ ایک رات ہے جو پورے سال میں گردش کرتی ہے۔ اور جہاں تک ہمارا تعلق ہے، ہم نے اسے پورے سال میں گردش کرتے ہوئے دیکھا ہے، اور ہم نے اسے شعبان میں بھی دیکھا ہے، اور ہم نے اسے رمضان میں بھی دیکھا ہے، رمضان کے ہر طاق رات میں، اور اس سال کے ہمارے روزوں کے حساب سے رمضان کی اٹھارہویں رات کو بھی دیکھا ہے۔ پس اللہ جس رات کو چاہے، سال کی راتوں میں سے، اس قدر کا محل بنا دے جس سے وہ شبِ قدر کہلاتی ہے، وہ ایسا کر دیتا ہے۔ پس اگر وہ سال کی راتوں میں سے کوئی ایسی رات ہو جسے سال کی دوسری راتوں پر خاص فضیلت حاصل ہو، جیسے شبِ جمعہ، شبِ عرفہ، شبِ نصف شعبان، اور دیگر معروف راتیں، تو اس رات کی بھلائی قدر کی فضیلت میں شامل ہو جاتی ہے۔ پس شبِ قدر اس شبِ قدر سے افضل ہوتی ہے جس میں کوئی دوسری فضیلت شامل نہیں ہوتی۔ پس یہ جان لو۔ اور اسی منزل سے روح الامین محمد صلی اللہ علیہ وسلم کے قلب پر دو سورتیں لے کر نازل ہوئے: سورۃ القدر (سورة القدر) اور سورۃ الدخان (سورة الدخان)۔ اور یہ دونوں حکم میں مختلف ہیں۔ پس سورۃ القدر وہ جمع کرتی ہے جسے سورۃ الدخان تقسیم کرتی ہے، اور سورۃ الدخان وہ تقسیم کرتی ہے جسے سورۃ القدر جمع کرتی ہے۔ پس جسے اس کا علم نہیں جس کا اس نے مشاہدہ کیا ہے، وہ یہ گمان کرتا ہے کہ دونوں سورتیں ایک دوسرے کے متقابل ہیں، اور وہ اس ایک منزل پر غور نہیں کرتا جس نے ان دونوں کو جمع کیا، اور نہ ہی اس کی نشأت پر غور کرتا ہے جو متقابلاتِ طبعیہ (المتقابلات الطبيعية) کے جمع ہونے سے قائم ہوئی ہے۔ اور صحیح کشف (الکشف الصحیح) والا شخص جب اس منزل میں داخل ہوتا ہے اور اس کے پاس قَلْبٌ (دل) ہو اور وہ شَهِيدٌ (حاضر) ہو، تو وہ دیکھتا ہے کہ سورۃ القدر اور سورۃ الدخان کے درمیان کوئی تقابل نہیں ہے۔ کیونکہ سورۃ القدر وہ جمع کرتی ہے جو سورۃ الدخان عطا کرتی ہے تاکہ اسے مراتب پر تقسیم کرے۔ پس سورۃ الدخان اسے لے کر مراتب پر تقسیم کرتی ہے، کیونکہ اس نے سورۃ القدر سے جان لیا کہ اس نے اسے جمع کر کے اسے صرف اس لیے دیا ہے تاکہ وہ اسے تقسیم کرے۔ پس سورۃ القدر سورۃ الدخان کے لیے جمع کرنے والے کی طرح ہے۔ معاملہ اسی طرح ہے۔ اور یہ دونوں سورتیں ہیں جن کی دو آنکھیں، دو زبانیں اور دو ہونٹ ہیں، جو اس منزل میں داخل ہونے والے کے لیے پہچانتی ہیں اور گواہی دیتی ہیں کہ وہ مقامِ محمود (المقام المحمود) کے اہل میں سے ہے اور وہ ایک مکمل وارث ہے۔ اور یہ منزل علمِ مطابقت (علم المطابقة)، مناسبت (المناسبة)، مراقبہ (المراقبة)، علمِ تلویح (علم التلویح)، رمز (الرمز)، اور امور میں بغیر مشقت کے نفوذ (النفوذ) کے علم کو شامل کرتی ہے، کیونکہ فکر کے ذریعے امور میں نفوذ سب سے بڑی مشقتوں میں سے ہے۔ اور علمِ ابانت (علم الإبانة) اور کشف (الکشف)، اور علمِ طبعی نشأتوں کا کہ کیا ان کا حکم عنصری نشأتوں کا حکم ہے یا نہیں، اور انوار اور ظلمتوں کے درمیان فرق کا علم، اور یہ کہ نور اور ظلمت، جو اللہ اور اس کے بندوں کے درمیان دو حجاب ہیں، کیوں واپس آتے ہیں، اور ان حجابات میں سے کون سا بندوں کے قریب ہے اور کون سا حق کے قریب ہے، اور کیا وہ کسی کے لیے اٹھائے جاتے ہیں یا ہمیشہ لٹکے رہتے ہیں، اور کیا یہ حجابات محجوب کی تحدید (تحدید) عطا کرتے ہیں یا نہیں؟ پس اگر وہ محجوب کی تحدید عطا کرتے ہیں، تو وہ اسے کس نشأت سے مقید اور محدود کرتے ہیں؟ کیا عنصری نشأت سے یا طبعی نشأت سے؟ اور اگر وہ اسے مقید نہیں کرتے، تو وہ اسے کس چیز سے ملحق کرتے ہیں؟ کیا اس چیز سے جو عالم میں تحیز (تحیز) قبول نہیں کرتی، پس وہ اجسام میں دخول اور خروج کی صفت سے متصف نہیں ہوتی، یا اس پر ایک ایسا حکم لگاتے ہیں جو اس کے حکم سے خارج ہو جو تحیز قبول نہیں کرتا، پس وہ مکان اور حلول کو قبول نہیں کرتا؟ اور اس رحمت کا علم جو انذار میں شامل ہے، وہ کس کی طرف سے تھی؟ اور علمِ اذواق (علم الأذواق)، اور ان اسماء کا علم جو شقی ہوتے ہیں اور جو سعید ہوتے ہیں۔ اور علمِ علم الیقین (علم الیقین)، اور ربوبیت میں تنزیہ (التنزیہ) کا علم، جو تصور میں مشکل ہے۔ اور علم کے مرتبے کا شک کے مرتبے سے خاص فرق، اور ان میں سے ہر ایک مرتبہ اس شخص کو کیا عطا کرتا ہے جو اس میں حلول کرتا ہے اور اس میں اترتا ہے۔ اور عذاب کا علم، کیا وہ علمِ آلام (علم الآلام) میں سے ہے یا علمِ لذات (علم اللذات) میں سے؟ اور سختی کے نازل ہونے پر توبہ کے عدمِ قبول کا علم، اور صرف قومِ یونس کی توبہ کے قبول کا علم۔ اور سابقہ فیصلوں کے نفاذ کا علم، کیا وہ بصیرت والے پر شر کے ساتھ نافذ ہوتے ہیں یا وہ صرف محجوبین کے لیے خاص ہیں؟ اور عذاب کے طبقات کا علم، اور ابتلاء (الابتلاء) اور اس کے طبقات کا علم، اور نصائح کا علم، اور اللہ کے نزدیک اہلِ عنایت (أهل العناية) کا علم، باوجود اس کے کہ رحمت سب کو شامل ہے۔ اور اہل عنایت کو دنیا میں اسی چیز سے آزمایا گیا جس سے ان کے علاوہ کو آخرت میں آزمایا جائے گا۔ اور اللہ کی عنایت اپنے اہل کے ساتھ ابتلاء اور آزمائش کے باوجود کیوں واپس آتی ہے؟ کیا یہ دونوں جہانوں کے تقاضے کی وجہ سے ہے یا سابقہ علم کے تقاضے کی وجہ سے؟ اور پورے عالم کے ہر فرد میں حق کے وجود کا اس کے وجوہ کے ساتھ علم۔ اور تین مجموعوں میں سے آخری مجموعے کے وقت کا تعین کا علم۔ اور استثناء (الاستثناء) کا علم کہ وہ کیوں واپس آتا ہے۔ اور جہل، گمان، شک اور ان کے ساتھیوں کا علم کہ وہ کہاں جاتے ہیں۔ اور زندگی سے پہلے موت کے تقدم کا علم، حالانکہ معلوم ہے کہ موت زندگی کے بعد ہی ہوتی ہے۔ اور اس منزل کے علوم بہت زیادہ ہیں، پس ہم نے ان میں سے اہم ترین کی تعریف کا ارادہ کیا جن کے علم سے سعادت وابستہ ہے، اگرچہ سارا علم ہی عینِ سعادت ہے، لیکن عموم میں سعادت صرف لذات کا حصول، اغراض کا پانا، اور آلام سے نجات ہے۔ اور وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و چهلم در معرفت منزلی که پیامبر (صلی الله علیه و سلم) سوره دخان را از آن برای ابن صیاد پنهان کرد.\n\n### [همانا خداوند پیامبرش (صلی الله علیه و سلم) را از گفتار (نادرست) مصون داشت و علم به راز پنهان (الخبيئة) او را از کاهن بودن خارج نکرد]\n\nاز قرآن عزیز:\n\nپس به او گفت: چه چیزی برایت پنهان کرده‌ام؟ او پاسخ داد: «الدخ» که در زبان (عربی) لغتی برای «الدخان» (دود) است، زیرا در آن آیه‌ای وجود دارد: **يَوْمَ تَأْتِي السَّماءُ بِدُخانٍ مُبِينٍ** (روزی که آسمان دودی آشکار بیاورد). پس ابن صیاد نام آن را که رسول خدا (صلی الله علیه و سلم) در پنهان‌کاری خود قصد و در دل نهان کرده بود، دانست. پیامبر (صلی الله علیه و سلم) به او فرمود: «اخسأ (دور شو)، هرگز از حد خود فراتر نخواهی رفت.» یعنی: علم تو به این راز، تو را از قدری که خداوند تو را برای آن هلاک کرده است، خارج نمی‌سازد. و روایت شده است: «فلم تعد قدرك» (پس از حد خود فراتر نرفتی).\n\nیعنی با درک آنچه برایت پنهان کردم. و در این سخن رازی است که این گفتار پیامبر (صلی الله علیه و سلم) آن را برای کسی که بر مقامی صافی است که بر رسول خدا (صلی الله علیه و سلم) واجب کرد چنین سخنی را به او بگوید، آشکار می‌سازد. زیرا او ابن صیاد را با آنچه برایش پنهان کرده بود، از طریق وحی الهی آزمایش نکرد. اگر از طریق وحی بود، ابن صیاد بر آن آگاه نمی‌شد، زیرا خداوند با تأیید، پشت آنچه امر می‌کند قرار دارد. بلکه این سخن مانند سخن او (صلی الله علیه و سلم) در مورد تلقیح نخل بود. پس هنگامی که راز پنهان او آشکار شد، این از جانب خداوند تأدیبی عملی بود تا مقام مراقبه (المراقبة) را برای او حفظ کند و جز از طریق شهود (الشهود) سخن نگوید. زیرا با قرینه حال معلوم است که پیامبر (صلی الله علیه و سلم) آنچه را پنهان کرد، جز برای عاجز ساختن او پنهان نکرد، اما خداوند آن را نپذیرفت.\n\nپس پیامبر (صلی الله علیه و سلم) فرمود:\n> إن الله أدبني (همانا خداوند مرا ادب کرد)\n> فأحسن تأديبي (و نیکو ادب کردنم را)\n\nاگر پیامبر (صلی الله علیه و سلم) قصد خود را در آنچه پنهان کرده بود برای حاضران بیان می‌کرد، گروهی از حاضران به دلیل آن مرتد می‌شدند. اما خداوند پیامبرش (صلی الله علیه و سلم) را از گفتار (نادرست) مصون داشت و علم به راز پنهان (الخبيئة) او را از کاهن بودن خارج نکرد. حاضران از امر کاهنان و شأن آنان آگاه بودند، به ویژه مردم یمن، حجاز و جزیرة العرب. پس آن علم، او را از قدر و منزلتش نزد حاضران خارج نساخت. در این مسئله امور عظیمی وجود دارد که شرح آن به امری بزرگ گسترش می‌یابد.\n\n> ترک رضایت حاصل نمی‌شود *** مگر برای کسی که پایین‌تر است\n> اگر حالی برای تو باشد *** هر سختی آسان می‌شود\n> و اگر از رضایت او سر باز زنی *** آنچه او بخواهد، همان می‌شود\n\nاین منزل، همان منزلی است که رسول خدا (صلی الله علیه و سلم) سوره دخان از قرآن را برای ابن صیاد از آن پنهان کرد. این منزلی عظیم است که در آن از مکر الهی (المكر الإلهي) و استدراج (فریب تدریجی) چیزی وجود دارد که حتی فرشتگان نیز با علم به آن، از مکر خداوند ایمن نیستند. پس عاقل اگر از اهل اطلاع در تصرفات خود نباشد، دست‌کم این است که ترازوی مشروعی را که برای وزن کردن تصرفاتش به او داده شده، از دست خود، بلکه از دست راست خود، دور نمی‌کند. پس در نفس‌الامر، خود را از این مکر حفظ می‌کند و یک چشم بر هم زدن از لوازم عبودیت و احکام آن خارج نمی‌شود. به او از علوم و امور، افزون‌هایی داده می‌شود که نه چشمی دیده و نه گوشی شنیده و نه بر قلب هیچ ممکنی خطور کرده است. عروج ارواح جدا شده و غیر آن، می‌تواند به سوی این منزل باشد. از این منزل، نشانه‌هایی بر صدق راستگو و کذب دروغگو آشکار می‌شود. کسی که به این منزل دست یابد، علم حکمت جامع را کسب می‌کند و شقی از سعید برای او متمایز می‌شود. در این منزل، احوال ناظران متفاوت است؛ آنچه زید نور می‌بیند، عمرو ظلمت می‌بیند، و جعفر آن را هم نور و هم ظلمت می‌بیند. زیرا اشیاء با آن کشف می‌شوند، پس می‌گوید: این نور است، و از حیث عین آن را می‌بیند، پس می‌گوید: ظلمت است.\n\nدر این منزل، تمامی منازلات (نزول‌ها) رخ می‌دهد. در آن، حق (الحق) نازل شونده و خلق (الخلق) صعود کننده به هم می‌رسند. حق به صعود کننده می‌گوید: به کجا؟ او می‌گوید: به سوی تو. و خلق به نازل شونده می‌گوید: به کجا؟ او می‌گوید: به سوی تو. پس می‌گوید: به هم رسیدیم، بیا تا هر یک از ما سببی را که موجب طلب دیگری شده است، مشخص کنیم. حق می‌گوید: با نزول به سوی تو قصد کردم تا تو را از رنج آسوده سازم، پس به تو ببخشم و عطا کنم بدون مشقت و سختی، در حالی که تو در میان خانواده‌ات آسوده‌ای. قصدی جز این نداشتم. و خلق می‌گوید: با عروج به سوی تو قصد تعظیم و خدمت به تو را داشتم تا در پیشگاه تو بایستم، در حالی که تو بر تخت پادشاهی خود هستی. و ملأ اعلی (فرشتگان برتر) دانسته‌اند که من خلیفه تو هستم و به سبب آنچه مرا به آن اختصاص دادی، من از آنان به تو داناترم. پس اگر ملأ اعلی مرا در پیشگاه تو ببینند، از من در آنچه در پیشگاه تو انجام می‌دهم و شایسته است که چون منی با تو ادب ورزد، پیروی می‌کنند. در نتیجه، از طریق مشاهده، علمی از ادب با تو به دست می‌آورند که نزدشان نبوده است. زیرا من آنان را نسبت به منزلت تو جاهل دیدم، با اینکه بدون سستی تو را تسبیح می‌گویند. تو به آنان می‌گویی: **إِنِّي جاعِلٌ فِي الْأَرْضِ خَلِيفَةً** (من در زمین جانشینی قرار می‌دهم)، پس آنان با آنچه برایم حکایت کردی، با تو مخالفت می‌کنند و می‌گویند، در حالی که شایسته آنان جز شنیدن نبود، زیرا امر از آن توست. پس چون دانستم که ادب الهی در آنان محکم نشده است و تو مرا به تعلیم آنان امر کرده‌ای و دیدم که تعلیم با حال و فعل کامل‌تر از قول و عمارت است، قصد عروج به سوی تو کردم تا ملأ اعلی با حال و فعل ببینند که چگونه باید با جلال تو رفتار کرد. و استواء (بر عرش) شریف‌ترین حالی است که با آن بر خلق خود ظاهر شدی، با این حال بر تو اعتراض کردند، پس چگونه می‌شد اگر به حالتی پایین‌تر از استواء، از آسمان و زمین، نزول می‌کردی؟\n\nپس حق می‌گوید: چه نیکو قصدی کردی! کسی چون تو قدر اشیاء را می‌داند. زیرا هر کس قدر خود و قدر اشیاء را بشناسد، قدر مرا می‌شناسد و حق مرا ادا می‌کند. آیا نمی‌بینی محمد (صلی الله علیه و سلم) را که وقتی پنجاه نماز بر او و امتش واجب کردم، با آن نازل شد و چیزی نگفت و اعتراض نکرد و نگفت این زیاد است؟ اما وقتی نزد موسی (علیه السلام) نازل شد، موسی به او گفت: به سوی پروردگارت بازگرد، شاید بر امتت تخفیف دهد، زیرا من از بنی اسرائیل در این باره سختی‌ها کشیده‌ام و امت تو از تحمل چنین چیزی عاجز است و خسته می‌شود. پس محمد (صلی الله علیه و سلم) متحیر ماند. ادب کامل به او می‌گوید که آنچه انجام داد (عدم اعتراض) درست است، و شفقت بر امتش او را به طلب تخفیف وامی‌دارد تا خداوند با دلتنگی، کراهت، ملالت یا کسالت عبادت نشود. پس متحیر ماند. این همان چیزی است که واسطه‌ها و همنشینان تأثیر گذاشتند. پس شروع به طلب ترجیح میان آنچه موسی (علیه السلام) گفت و آنچه او (صلی الله علیه و سلم) از حق ادب با خدا وفا کرد، نمود. و خداوند پیش از این، هنگام ذکر گروهی از پیامبران (علیهم السلام) از جمله موسی (علیه السلام)، به او فرموده بود: **أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ** (آنان کسانی هستند که خداوند هدایتشان کرده، پس به هدایت آنان اقتدا کن). پس او تأویل کرد که این اشاره موسی (علیه السلام) از هدایت آنان است. و در آن لحظه متوجه نشد که موسی (علیه السلام) در حال هدایت خود، طلب تخفیف نکرد، و آن هدایت همان بود که رسول خدا (صلی الله علیه و سلم) مأمور به اقتدا به آن شد. پس این اجتهاد، بازگشت به سوی خدا را به او داد. پس طلب تخفیف کرد و پیوسته میان خداوند متعال و موسی (علیه السلام) باز می‌گشت تا اینکه آنچه ادب به او عطا کرد، گفت: «استحییت من ربی» (از پروردگارم شرم کردم) و امر با تخفیف به ده (نماز) پایان یافت.\n\nپس با آن بر امتش نازل شد و برای او تشریع شد که اجتهاد در احکامی را که صلاح عالم در آن است، برای امتش تشریع کند، زیرا او (صلی الله علیه و سلم) با اجتهاد میان خدا و موسی (علیه السلام) بازگشت. پس خداوند آن را در امت او امضا کرد تا با آنچه از او سر زد، مأنوس شوند و وحشت نکنند. و با این تشریع، دل موسی را در آن جبران کرد. زیرا ناگزیر است که وقتی به خود بازگردد و حکم شفقت بر بندگان از او زائل شود، تعظیم حق (الحق) و آنچه شایسته جلال اوست، با او قیام کند. پس هیچ چیز را در حق او زیاد نشمرد و دانست که قدرت در دست اوست و هر که را بخواهد، با آن تقویت می‌کند. و اگر چنین چیزی به ذهنش خطور کند و حق او را در آن مقام دهد، ناگزیر است که نزد او پشیمانی از آنچه در حق محمد (صلی الله علیه و سلم) گفته است، تأثیر بگذارد. پس خداوند دل او را با این قول جبران کرد: **ما يُبَدَّلُ الْقَوْلُ لَدَيَّ** (سخن نزد من تغییر نمی‌کند) در آخرین بازگشت. در حالی که پیش از آن، سخن به کثرت (پنجاه) پیش رفته بود و آن را با تخفیف و تقلیل (پنج) تبدیل کرد. پس موسی دانست که قول الهی برخی قابل تبدیل است و برخی قابل تبدیل نیست، و آن هنگامی است که قول از جانب او محقق شود. پس قول واجب تبدیل نمی‌شود و قول معروض (پیشنهادی) قابل تبدیل است. پس موسی (علیه السلام) از این سخن شاد شد که او جز در عرض قول (پیشنهاد) سخن نگفته است، نه در حق آن. همچنین، هنگامی که خداوند اجتهاد در وضع احکام را برای امت محمد (صلی الله علیه و سلم) به دلیل اجتهاد محمد تشریع کرد، دل محمد (صلی الله علیه و سلم) را در آنچه از او سر زد، جبران نمود. و این امر در امت او (صلی الله علیه و سلم) جاری شد، همان‌گونه که جحد (انکار) و نسیان (فراموشی) در بنی آدم از جحد و نسیان آدم جاری شد. جبران دل آدم. زیرا این نشأت طبیعی (النشأة الطبيعية) از حکم طبیعت است که در آن جحد و نسیان وجود دارد. پس حرکت آدم در جحد او حرکتی طبیعی بود و در نسیان او اثری طبیعی. اگر تناسی (خود را به فراموشی زدن) می‌کرد، امر از حرکت طبیعت بود، همان‌گونه که جحد از این حیث که جحد است، اثری طبیعی است، و از این حیث که جحد به فلان چیز است، حکمی طبیعی است نه اثر. این تفاوت میان حکم طبیعت و اثر آن است. نسیان از اثر آن است و تناسی از حکم آن. غفلت از اثر آن است و تغافل از حکم آن. و اندکی از دانایان به خدا هستند که میان حکم طبیعت و اثر آن فرق می‌گذارند. پس در آدم حکم طبیعت با جحد جمع شد، زیرا او اولین جامع در صلب خود برای جحدکنندگان بود، پس بر او حکم به جحد کردند و او جحد کرد، زیرا فرزند در پدر خود اثر دارد. پس جحد اگرچه از حکم طبیعت است، اما از اثر جحدکنندگان از فرزندان اوست، زیرا آدم انسان کامل (الإنسان الکامل) است. و همچنین نسیانی که از او سر زد، از اثر طبیعت و حکم فرزندان است، زیرا او در صلب خود حامل ناسین (فراموش‌کنندگان) از فرزندانش بود، پس بر او حکم به نسیان کردند. پس بنگر که این امور چقدر شگفت‌انگیز است و فتوحات مکاشفه (فتوح المكاشفة) چه علومی را عطا می‌کند.\n\nو تمامی آنچه ذکر کردیم از احکام این منزل است. و برای آن از حضرت الهی (الحضرة الإلهية)، غیب است؛ و از اعیان عالم، طبیعت است؛ و از عالم شهادت، ظلمت است. پس در شهادت، ظلمت را می‌بینی و با آن دیده نمی‌شود. و در طبیعت، دانسته می‌شود اما دیده نمی‌شود و اثر آن دیده می‌شود و با آن دیده می‌شود. و در غیب، دیده می‌شود و با آن دیده می‌شود، با وجود بقای نام غیب بر آن. و این را گفتیم زیرا اسماء با تغییر احکام تغییر می‌کنند، به ویژه در اسماء الهی، زیرا حکم، اسم را به اسم دیگری که آن حکم طلب می‌کند، تغییر می‌دهد، در حالی که عین (ذات) یکی است. و در احکام شرایع، عکس این است: تغییر احکام تابع تغییر احوال و اسماء است، در حالی که عین یکی است. به مالک بن انس، از ائمه دین، گفته شد: در مورد خوک دریایی که نوعی ماهی است، چه می‌گویی؟ او گفت: حرام است. به او گفته شد: پس ماهی دریا و جنبندگان آن و مردار آن حلال است؟ او گفت: شما آن را خوک نامیده‌اید و خداوند خوک را حرام کرده است. پس حکم نزد مالک به دلیل تغییر اسم تغییر کرد. اگر به او می‌گفتند: در مورد ماهی دریا یا جنبندگان دریا چه می‌گویی؟ حکم به حلال بودن می‌داد. همچنین، تغییر احوال، احکام را تغییر می‌دهد. برای شخص واحدی که حالش اضطرار نیست، خوردن مردار بر او حرام است. اما اگر همان شخص مضطر شود، خوردن مردار برای او حلال است. پس حکم به دلیل اختلاف حال، متفاوت شد، در حالی که عین (ذات شخص) یکی است.\n\n### [همانا خداوند تجلی (التجلي) را در صور طبیعی می‌پذیرد]\n\nو بدان که خداوند از این منزل، تجلی (التجلي) را در صور طبیعی، چه کثیف و چه لطیف و چه شفاف، برای اهل برازخ (عوالم میانی) می‌پذیرد. و قیامت برزخ است و در هستی (الوجود) جز برازخ نیست، زیرا هستی نظمی است که شیئی میان دو شیء قرار گرفته است، مانند زمان حال که دائم نامیده می‌شود. و اشیاء معنوی دور (دایره) هستند و اشیاء حسی کره. پس در کون (هستی) طرفی وجود ندارد، زیرا دایره طرفی ندارد. پس هر جزء از آن، برزخی میان دو جزء است. و این علمی شریف است برای کسی که آن را بشناسد. به همین دلیل، در انسان کامل (الإنسان الکامل) در نشأت او، دو صورت طبیعی جمع شده است: او را با جسمی تاریک و کثیف آفرید و با جسمی لطیف که در این جسم کثیف حمل می‌شود و آن را روح نامید. با این روح، او حیوان بود، و آن بخاری است که از حفره قلب خارج شده و در اجزای بدن منتشر می‌شود و در آن رشد و احساس را می‌دهد. و او را به تنهایی، بدون سایر عالم، به نیروی متفکره اختصاص داد که با آن امور را تدبیر و تفصیل می‌دهد. و برای غیر او از عالم، چنین چیزی نیست، زیرا او بر صورت الهی است و از صورت الهی، امر را تدبیر می‌کند و آیات را تفصیل می‌دهد. پس انسان کامل (الإنسان الکامل) کسی است که صورت الهی برای او کامل شده باشد و جز با مرتبه کامل نمی‌شود. و هر کس از آن پایین‌تر باشد، به اندازه آنچه دارد، از صورت بهره‌مند است.\n\nآیا نمی‌بینی که حیوان می‌شنود و می‌بیند و بوها و طعم‌ها و گرم و سرد را درک می‌کند، اما به او انسان گفته نمی‌شود، بلکه شتر، اسب، پرنده و غیره است؟ اگر صورت در او کامل می‌شد، به او انسان گفته می‌شد. همچنین انسان کامل نمی‌شود تا نام عام از او زائل شده و به نام خاص تبدیل شود. پس خلیفه نامیده نمی‌شود مگر با کمال صورت الهی در او، زیرا عالمیان جز به آن نظر نمی‌کنند. به همین دلیل، هنگامی که فرشتگان از آدم جز صورت طبیعی جسمانی، تاریک، عنصری و کثیف ندیدند، آنچه گفتند، گفتند. اما هنگامی که خداوند آنان را به کمال صورت در او آگاه ساخت و به سجده بر او امر کرد، به سرعت بر او سجده کردند، به ویژه هنگامی که در عمل، تعلیم اسماء توسط او بر آنان آشکار شد. و اگر به آنان تعلیم نمی‌داد و خداوند به آنان می‌گفت: من صورت و هیئت را به او داده‌ام، آنان آن را از روی ایمان می‌پذیرفتند و به امر خداوند با او رفتار می‌کردند.\n\nپس هنگامی که انسان بر انسان کامل (الإنسان الکامل) مکاشفه (کشف) شود و حق (الحق) را در صورتی که انسان کامل پوشیده است ببیند، در حیرت میان دو صورت باقی می‌ماند و نمی‌داند بر کدام یک سجده کند. پس در آن مقام به او اختیار داده می‌شود که این آیه بر او تلاوت شود: **فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله** (پس به هر سو رو کنید، آنجا وجه خداست). پس در انسان، وجه خدا از حیث صورت اوست، و در جانب حق، وجه خدا از حیث عین اوست. پس هیچ چیز قبل از سجده او سجده نمی‌کند. زیرا خداوند سجده بر صورت را می‌پذیرد، همان‌گونه که سجده بر عین را می‌پذیرد.\n\nهمان‌گونه که رسول خدا (صلی الله علیه و سلم) در منزلی دیگر در چنین مقامی متحیر شد، هنگامی که در معراج برده شد و در نور تنها قرار گرفت و احساس وحشت کرد. و سبب وحشت او این بود که با جسم عنصری خود به معراج برده شد، پس وحشت به دلیل خروج از اصل خود و ایستادن در غیر منزل خود، او را درک کرد. و جز حقیقت آنچه از عناصر در او ظاهر شده بود، از او (صلی الله علیه و سلم) وحشت نکرد. پس کسی که ندا می‌داد، با صدای ابوبکر او را ندا داد، زیرا او به انس با ابوبکر عادت کرده بود. پس با آن ندا مأنوس شد و به آن گوش فرا داد و آن وحشت با صدای ابوبکر از او زائل شد. پس هنگامی که خواست از آن موقف بر خدا وارد شود، به او گفته شد: «قف یا محمد، إن ربک یصلی» (بایست ای محمد، همانا پروردگارت نماز می‌خواند). پس در نسبت دادن نماز به او متحیر شد. و محمد (صلی الله علیه و سلم) در مقام صورت الهی کامل بود که با نماز و سجود به سوی آن رو می‌آورند. پس هنگامی که نزدیک شد، پروردگارش با نماز بر او از او استقبال کرد، در حالی که او از آن آگاهی نداشت. پس اسم علیم که کلام به او منسوب است، با صدای ابوبکر او را ندا داد تا او را به مرتبه ابوبکر بشناساند و با او مأنوس کند: «بایست، همانا پروردگارت نماز می‌خواند.» و ایستادن، ثبات است و قبله برای نمازگزار است. پس ایستاد و آن خطاب او را به وحشت انداخت، زیرا حال او در آن زمان تسبیحی بود که روح آن **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست) است. این همان چیزی است که او را به وحشت انداخت.\n\nپس هنگامی که در آن هنگام بر او تلاوت شد: **هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ ومَلائِكَتُهُ لِيُخْرِجَكُمْ مِنَ الظُّلُماتِ إِلَى النُّورِ** (او کسی است که بر شما و فرشتگانش درود می‌فرستند تا شما را از تاریکی‌ها به سوی نور بیرون آورند)، آنچه را خداوند در قرآن بر او نازل کرده بود، به یاد آورد. پس ترس از نسبت دادن نماز به خدا با یادآوری آن از او زائل شد. و امر معراج همان بود که بود و برای آن موضع دیگری غیر از این است که اگر خدا بخواهد در آنجا ذکر خواهیم کرد. پس کسی که خداوند او را میان دو صورت قرار دهد، باکی ندارد که بر کدام یک سجده کند. اگر ببیند که این کسی که بر او مکاشفه شده است، دو صورت با هم مصافحه می‌کنند بدون اینکه یکی بر دیگری سجده کند، این نشانه‌ای است برای او بر کمال صورت در حق آن انسان خاص. و اگر سجده را از صورت انسانی برای صورت دیگر الهی ببیند، در آن هنگام می‌داند که صورت انسانی کامل در مقام مشاهده عین است نه مشاهده صورت، پس با آن در سجده بر آن موافقت می‌کند. و اگر سجده را از صورت الهی برای صورت انسانی ببیند، در اینجا از قول اوست: **هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ** (او کسی است که بر شما درود می‌فرستد). در این حالت با آن در سجده موافقت نمی‌کند. اگر موافقت کند، هلاک می‌شود. بلکه کسی که در آن مقام قرار گیرد، امور را بر همان‌گونه که هستند می‌شناسد. زیرا می‌داند که صلاة (درود) از خدا بر بنده کامل است، نه برای بنده کامل. و صلاة از بنده کامل برای خداست، نه بر خدا. و کسی که این فرقان را به دست آورد، قرآن و فرقان را با هم جمع کرده است. و این مشهدی عزیز است که من برای آن ذائقه‌ای ندیده‌ام و از کامل‌ترین معارف است.\n\nو هنگامی که قرآن نازل شد، بر قلب محمد (صلی الله علیه و سلم) و بر قلب‌های تلاوت‌کنندگان دائمی آن که در سینه‌هایشان در داخل اجسامشان است، نازل شد. منظورم لطیفه انسانی نیست که متحیز نمی‌شود و وصف دخول و خروج را نمی‌پذیرد. پس قلب که در سینه است، برای نفس ناطقه (النفس الناطقة) قیام می‌کند تا برای آن مقام مصحف نوشته شده برای چشم شود. پس نفس ناطقه از آنجا آن را دریافت می‌کند. و سبب آن این است که چون بر جسم مرکب کثیف، برتری و فضیلت یافت به دلیل تدبیر و تصرفی که به آن داده شده بود، و آن را در مرتبه پایین‌تر از خود دید، به دلیل جهلش به آنچه امر بر آن است و نمالید که آن از امور کامل کننده کمال اوست، خداوند قلب داخل جسم در سینه او را مصحف و کتابی مرقوم قرار داد که نفس ناطقه در آن می‌نگرد. پس به علم متصف می‌شود و به حسب آیه‌ای که در آن می‌نگرد، به آن آراسته می‌شود. پس به این محل نیازمند می‌شود به دلیل آنچه به سبب آن استفاده می‌کند، زیرا حق (الحق) آن را محلی برای کلام خود قرار داده و در آن رقم زده است. پس با این امر، از آن برتری که به آن مغرور شده بود، پایین آمد و قدر خود را شناخت و دید که آن قلب، محل فرود فرشتگان با روح (وحی) است که کلام خداست. و ندید که آن فرشتگان نازل شده به او نگاه کنند یا با او سخن بگویند، بلکه فقط آنچه را با خود آورده‌اند در قلب رقم می‌زنند. و نفس آنچه را در آن رقم خورده است می‌خواند. پس در فهم خود از خدا می‌داند که مراد خدا از آن، تعلیم و تأدیب اوست به دلیل خللی که از عجب به نفس خود بر او عارض شده بود. پس اقرار و اعتراف کرد که نسبت خدا به هر چیز، نسبتی واحد است بدون برتری دادن. پس برای خود برتری بر هیچ یک از مخلوقات، چه ملأ اعلی و چه ادنی، و هیچ تفضیل و ترجیحی در عالم ندید. اما این از حیث دلالت و نسبت حق است، نه از حیث خود عالم. زیرا از حیث خود عالم، ترجیح برخی بر برخی دیگر وجود دارد و تفاوت در آن ظاهر می‌شود.\n\nو بدان که نفس ناطقه (النفس الناطقة) انسان، اگر خداوند برای او خیری بخواهد، نطق تمامی اجزای بدنش را با تسبیح و ثنای بر خدا به حمد او، نه به حمدی از جانب خود، برای او کشف می‌کند. و در آنان سستی و غفلت و اشتغالی نمی‌بیند. و ذات خود را غافل از آنچه بر او از ذکر خدا واجب است، و کوتاهی کننده، و مشغول به اغراض خود از خدا، و روی آورنده به اموری که او را از خدا و ایستادن در حدود او محجوب می‌سازد، می‌بیند. پس عالم نزد او بزرگ می‌شود و می‌داند که آن شعائر خداست که تعظیم آن بر او واجب است و حرمت‌های خداست. و نفس او نزدش کوچک می‌شود و می‌داند که اگر از جسم خود متمایز می‌شد و جسمش از کامل کننده‌های او در نشأت نبود، می‌دانست که آن جسم که مدبر اوست، شریف‌تر از اوست. پس هنگامی که دانست آن جسم شریف‌تر از اوست، دانست که شرافت آن به دلیل این صفاتی که بر آن است، عین شرافت اوست. و او مأمور به تدبیر آن شده و در حق آن به کار گرفته شده و مانند خادم برای آن قرار داده شده و حقوقی از چشم و گوش و غیره بر او واجب شده است، جز به دلیل مشغول بودن آن به خدا و تسبیح خالقش نبوده است. پس نفس خود را مسخر آن دانست. اگر او نیز در اشتغال به خدا در مثل این اشتغال بود، حکم جسم خود را داشت. و اگر جسم به تدبیر ذات خود واگذار می‌شد، از تسبیح باز می‌ماند، همان‌گونه که نفس انسانی باز ماند. و هنگامی که دانست که در حق جسم خود مسخر است، قدر خود را شناخت و دانست که در معرض مطالبه، مؤاخذه، سؤال و حساب است. پس در دار تکلیف، ادای حقوق واجبه بر او برای خدا، برای عالم خارج از او، و برای نفس خود به آنچه جسمش از او می‌طلبد، بر او واجب می‌شود. و با این اشتغال، فرصتی برای دیدن برتری و تشویق به معرفت مراتب پیدا نمی‌کند. و این مرتبه، یعنی مرتبه ادای حقوق، شریف‌ترین مراتب در حق انسان است. و زیانکار کسی است که از آن باز ماند، همان‌گونه که سودبرنده کسی است که به آن مشغول شود.\n\n### [همانا خداوند متعال هنگامی که چیزی را با ضمیر غایب ذکر می‌کند، آن چیز از او غایب نیست]\n\nو بدان که خداوند متعال هنگامی که چیزی را با ضمیر غایب برای تو ذکر می‌کند، آن چیز از او غایب نیست، بلکه مراعات مخاطب را کرده است که تو هستی، و مذکور از تو غایب است. و هنگامی که آن را با ضمیر حضور، از اشاره به آن یا غیر آن، ذکر می‌کند، فقط مراعات تو را کرده است. و مراعات شهود (الشهود) او در هر حال ضروری است. اما باید میان آنچه خداوند از اقوال گویندگان حکایت می‌کند و کلامی که از نزد خود می‌گوید، فرق گذاشت.\n\nپس اگر حق (الحق)، گوش و چشم بنده باشد، غیبت در حق بنده زائل می‌شود. پس در آن حال، با آنچه ضمیر غایب دارد، مورد خطاب قرار نمی‌گیرد. در حالی که خطاب با ضمیر غایب برای کسی که این صفت اوست، وجود داشته است. پس امر چگونه است؟ گفتیم: چون بنده که قرآن بر او نازل شده، مأمور به ابلاغ آن به مکلفین و تبیین آن برای مردم است، و برخی از اشیاء برای آنان مشهود و از آنان غایب است، و او مأمور نشده است که کلمات را از مواضع خود تحریف کند، بلکه از خدا حکایت کند، همان‌گونه که خدا برای او حکایت کرده است. و قول آنان متضمن غیبت و حضور است. پس او در حکایت خود از آنان، بر آنچه گفتند، نیفزود. و به او گفته شد: **بَلِّغْ ما أُنْزِلَ إِلَيْكَ** (آنچه بر تو نازل شده است را ابلاغ کن). پس از صورت آنچه بر او نازل شده بود، عدول نکرد و آنچه به او گفته شد، گفت. زیرا معانی بر قلب او نازل نشد بدون ترکیب این حروف و ترتیب این کلمات و نظم این آیات و انشاء این سوره‌ها که همه اینها قرآن نامیده می‌شود. پس هنگامی که خداوند نشأت قرآن را صورتی در نفس خود قرار داد، آن را همان‌گونه که مشاهده کرد، ظاهر ساخت. پس چشم‌ها آن را در مصحف‌ها دیدند و گوش‌ها آن را از تلاوت‌کنندگان شنیدند. و غیر از کلام خدا، این مسموع و مبصر نیست. و مذمت را به کسی ملحق کرد که آن را پس از تعقل تحریف کند، در حالی که می‌داند کلام خداست. پس صورت آن را همان‌گونه که بر او نازل شد، باقی گذاشت. اگر چیزی از آن را تبدیل می‌کرد و نشأت را تغییر می‌داد، صورت فهم او به ما می‌رسید، نه صورت آنچه بر او نازل شده است. زیرا برای هر چشمی از مردم که این قرآن بر آنان نازل شده است، نظری در آن وجود دارد. اگر آن را بر اساس معنایی که فهمیده بود به ما منتقل می‌کرد، قرآن نبود، یعنی قرآنی که بر او نازل شده است. اگر فرض کنیم که او تمامی معانی آن را دانسته است، به طوری که چیزی از معانی آن از او فوت نشده است، می‌گوییم: اگر این را می‌دانست و این کلماتی که بر تمامی آن معانی دلالت می‌کنند، پس چرا عدول کند؟ و اگر به کلماتی عدول کند که در تمامی آن معانی با آن برابر باشند، ناگزیر است که آن کلماتی که به آنها عدول می‌کند، از حیث اعیان وجودی، اعیانی غیر از این اعیانی باشند که از آنها عدول کرده است و بر او نازل شده‌اند. پس ناگزیر است که با آنچه از حیث اعیان خود، افزون بر معانی جمع شده توسط کلمات نازل شده، می‌دهند، با آنها مخالفت کنند. پس برای ناظر در قرآن، معانی اعیان آن کلمات عدول شده افزوده می‌شود، در حالی که خداوند آنها را نازل نکرده است. پس پیامبر چیزی را به مردم ابلاغ کرده است که بر آنان نازل شده و چیزی را که نازل نشده است. پس در حکم، شریعتی را می‌افزایند که خداوند به آن اذن نداده است. همچنین، اعیان آن کلماتی که از آنها عدول شده است، از آنچه خداوند نازل کرده است، کاسته می‌شود. پس رسول از ابلاغ آنچه بر او نازل شده است، اعیان آن کلمات را کاسته است. و حاشا که چنین کند. پس شایسته او نبود جز اینکه آنچه بر او نازل شده است را به مردم ابلاغ کند، صورتی کامل از حیث ظاهر، حروف لفظی و رقمی آن، و از حیث باطن، معانی آن.\n\nو به همین دلیل، جبرئیل در هر رمضان بر محمد (صلی الله علیه و سلم) نازل می‌شد و یک بار قرآن را با او مرور می‌کرد. پس او در هر رمضان یک ختمه با جبرئیل (علیه السلام) داشت تا اینکه آخرین رمضان که رسول خدا (صلی الله علیه و سلم) در آن حضور داشت، فرا رسید. پس جبرئیل در آن رمضان دو بار با او مرور کرد و دو ختمه انجام داد. پس دانست که در سال آینده خواهد مرد. نه در سال آن رمضان. پس ختمه دوم برای رمضان سالی بود که در آن وفات یافت تا آن سال پس از مرگ او برای او باشد. و او در ربیع الاول وفات یافت. و نزول قرآن در شب قدر بود که **خَيْرٌ مِنْ أَلْفِ شَهْرٍ** (بهتر از هزار ماه) است. پس نهایت اسماء عدد بسیط را آورد که پس از آن عدد بسیطی نیست مگر آنچه مرکب شود، همان‌گونه که قرآن آخرین کتابی بود که از جانب خدا نازل شد، همان‌گونه که کسی که بر او نازل شد، آخرین رسول و خاتم آنان بود. سپس آن اسم که هزار است را به ماه با تنکیر (نکره آوردن) اضافه کرد، پس فصول در آن داخل می‌شود. و ماه عربی، مقدار قطع منازل درجات کل فلک است برای سیر قمر که ماه با آن ظاهر می‌شود. اگر می‌گفت بیشتر از آن، تکرار می‌کرد، در حالی که در وجود (الوجود) تکراری نیست، بلکه خلقی جدید است. و اگر با ذکر روزها یا هفته‌ها کم می‌کرد، قطع درجات فلک را استیفا نمی‌کرد. پس رسالت او فراگیر نمی‌شد و قرآن تمامی کتب پیش از خود را فرا نمی‌گرفت، زیرا هیچ سیر کوکبی نیست که تمامی درجات را در کوچک‌ترین دوره قطع کند، مگر قمر که ماه عربی از آن است. به همین دلیل در شبی نازل شد که بهتر از هزار ماه است، یعنی افضل از هزار ماه. و افضلیت، زیادت است و زیادت عین آن است. و افضلیت را در قدر (منزلت) قرار داد که همان منزلتی است که نزد خدا برای آن مذکور است. و آن شبی که در آن نازل شد، یعنی شب قدر، موافق شب نیمه شعبان بود، زیرا آن شبی است که در تمام سال می‌چرخد. اما ما آن را در سال در حال چرخش دیده‌ایم و آن را در شعبان نیز دیده‌ایم و آن را در رمضان در هر شب فرد از ماه رمضان و در شب هجدهم ماه رمضان، بر حسب روزه ما در آن سال، دیده‌ایم. پس هر شبی که خداوند بخواهد آن را محلی از شب‌های سال برای قدری قرار دهد که به آن شب قدر نامیده می‌شود، آن را قرار می‌دهد. اگر آن شب از شب‌های سال، شبی باشد که فضیلت خاصی بر شب‌های دیگر سال دارد، مانند شب جمعه، شب عرفه، شب نیمه شعبان و غیر آن از شب‌های معروف، خیر آن شب به فضیلت قدر اضافه می‌شود. پس شب قدر بر شب قدری که فضیلت دیگری به آن اضافه نمی‌شود، در آن سال برتری می‌یابد. پس این را بدان.\n\nو از این منزل، روح الامین بر قلب محمد (صلی الله علیه و سلم) با دو سوره نازل شد: سوره قدر و سوره دخان. و این دو در حکم متفاوتند. سوره قدر آنچه را سوره دخان متفرق می‌کند، جمع می‌کند، و سوره دخان آنچه را سوره قدر جمع می‌کند، متفرق می‌سازد. پس کسی که به آنچه مشاهده کرده است، علم ندارد، گمان می‌کند که این دو سوره متقابلند. و متوجه منزل واحدی که آن دو را جمع کرده است، نشده است. و متوجه نشأت آن که از جمع متقابلات طبیعی قیام کرده است، نشده است. و صاحب کشف صحیح (الکشف الصحيح) اگر وارد این منزل شود و **كَانَ لَهُ قَلْبٌ ... وَهُوَ شَهِيدٌ** (قلبی داشته باشد... و شاهد باشد)، می‌بیند که سوره قدر با سوره دخان تقابل ندارد. زیرا سوره قدر آنچه را سوره دخان می‌دهد، جمع می‌کند تا آن را بر مراتب متفرق سازد. پس سوره دخان آن را می‌گیرد و بر مراتب متفرق می‌سازد، زیرا از سوره قدر دانسته است که آن را جمع نکرده و به او نداده است مگر برای تفرقه. پس سوره قدر مانند جمع کننده برای سوره دخان است. امر چنین است. و این دو سوره، دو عین و دو زبان و دو لب دارند که کسی را که وارد این منزل شود، به اهل مقام محمود بودن و وارث کامل بودن، می‌شناسند و شهادت می‌دهند.\n\nو این منزل شامل علم مطابقت و مناسبت و مراقبه (المراقبة)، و علم تلویح و رمز، و علم نفوذ در امور بدون مشقت (زیرا نفوذ در امور از طریق فکر از بزرگترین مشقت‌هاست)، و علم ابانه و کشف (الکشف)، و علم نشأت‌های طبیعی (که آیا حکم آنها حکم نشأت‌های عنصری است یا خیر)، و علم فرق میان انوار و ظلمت‌ها، و اینکه چرا نور و ظلمت که دو حجاب میان خدا و بندگانش هستند، باز می‌گردند، و چه چیزی از این حجاب‌ها به بندگان می‌رسد و چه چیزی به حق می‌رسد، و آیا برای کسی برداشته می‌شوند یا همیشه آویزان می‌مانند، و آیا این حجاب‌ها تحدید محجوب را می‌دهند یا خیر. اگر تحدید محجوب را دادند، با کدام نشأت آن را مقید و محدود می‌کنند؟ آیا با نشأت عنصری یا طبیعی؟ و اگر آن را مقید نکردند، به چه چیزی ملحقش می‌کنند؟ آیا به آنچه از عالم که تحیز (مکان گرفتن) را نمی‌پذیرد، پس به دخول در اجسام و خروج از آنها متصف نمی‌شود، یا حکمی خاص بر آن جاری می‌کنند که خارج از حکم آنچه تحیز نمی‌پذیرد باشد، پس مکان و حلول را نپذیرد؟ و علم رحمتی که انذار در بر دارد، از چه کسی بوده است؟ و علم اذواق، و علم آنچه از اسماء شقی می‌کند و آنچه سعید می‌سازد، و علم علم الیقین، و علم تنزیه در ربوبیت که تصورش دشوار است، و علم مرتبه علم از مرتبه شک به خصوص، و آنچه هر یک از این دو مرتبه به کسی که در آن حلول کند و به آن نازل شود، می‌دهد. و علم عذاب که آیا از علم آلام است یا از علم لذات، و علم عدم قبول توبه هنگام فرارسیدن عذاب، و قبول آن از قوم یونس به خصوص. و علم نفوذ قضای سوابق (تقدیرات ازلی) که آیا با شر بر کسی که بر بصیرت است نفوذ می‌کند یا مختص به محجوبین است؟ و علم طبقات عذاب، و علم ابتلاء و طبقات آن، و علم نصایح، و علم اهل عنایت نزد خدا با شمول رحمت برای همگان، در حالی که اهل عنایت در دنیا به آنچه غیر آنان در آخرت به آن مبتلا می‌شوند، مبتلا شده‌اند. و اینکه چرا عنایت خدا به اهلش با وجود ابتلاء و بلا باز می‌گردد؟ آیا به دلیل اقتضای دو دار (دنیا و آخرت) است یا به دلیل اقتضای علم سابق؟ و علم وجود حق (الحق) با وجوهش در هر فرد فرد از تمام عالم، و علم توقیت جمع اخیر از جمع‌های سه‌گانه، و علم اینکه استثناء چرا باز می‌گردد، و علم اینکه جهل و ظن و شک و علم به اصحابشان به کجا می‌روند، و علم تقدم مرگ بر حیات، در حالی که معلوم است که مرگ جز پس از حیات نیست.\n\nو علوم این منزل بسیار است. پس ما قصد کردیم که مهم‌ترین آنها را معرفی کنیم، آنچه سعادت به علم آن تعلق دارد، اگرچه تمامی علم عین سعادت است، اما در عموم، سعادت جز حصول لذات و نیل به اغراض و رهایی از آلام نیست. و **وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 7
}