{
  "id": 17,
  "title": {
    "ar": "الباب السابع عشر في معرفة انتقال العلوم الكونية ونبذ من العلوم الإلهية الممدة الأصلية",
    "en": "Chapter Seventeen: Concerning the Gnosis of the Transmission of the Cosmic Sciences and a Selection from the Original Sustaining Divine Sciences.",
    "ur": "باب سترہ: کونیاتی علوم کے انتقال اور اصل امدادی الٰہی علوم (العلوم الإلهية) کے ایک حصے کی معرفت (المعرفة) کے بیان میں۔",
    "fa": "باب هفدهم در معرفت انتقال علوم کونی و پاره‌ای از علوم الهیِ مددبخشِ اصیل."
  },
  "content": {
    "ar": "## «الباب السابع عشر في معرفة انتقال العلوم الكونية ونبذ من العلوم الإلهية الممدة الأصلية»\n\n\n> علوم الكون تنتقل انتقالا *** وعلم الوجه لا يرجو زوالا\n\n\n> فنثبتها وننفيها جميعا *** ونقطع نجدها حالا فحالا\n\n\n> إلهي كيف يعلمكم سواكم *** ومثلك من تبارك أو تعالى‏\n\n\n> إلهي كيف يعلمكم سواكم *** وهل غير يكون لكم مثالا\n\n\n> ومن طلب الطريق بلا دليل *** إلهي لقد طلب المحالا\n\n\n> إلهي كيف تهواكم قلوب *** وما ترجو التألف والوصالا\n\n\n> إلهي كيف يعرفكم سواكم *** وهل شي‏ء سواكم لا ولا لا\n\n\n> إلهي كيف تبصركم عيون *** ولست النيرات ولا الضلالا\n\n\n> إلهي لا أرى نفسي سواكم *** وكيف أرى المحال أو الضلالا\n\n\n> إلهي أنت أنت وإن إني *** ليطلب من أنايتك النوالا\n\n\n> لفقر قام عندي من وجودي *** تولد من غناك فكان حالا\n\n\n> وأطلعني ليظهرني إليه *** ولم يرني سواه فكنت آلا\n\n\n> ومن قصد السراب يريد ماء *** يرى عين الحياة به زلالا\n\n\n> أنا الكون الذي لا شي‏ء مثلي *** ومن أنا مثله قبل المثالا\n\n\n> وذا من أعجب الأشياء فانظر *** عساك ترى مماثله استحالا\n\n\n> فما في الكون غير وجود فرد *** تنزه أن يقاوم أو ينالا\n### [العالم في تغير مستمر نتيجة التوجهات الإلهية المطردة]\n\n\nاعلم أيدك الله أن كل ما في العالم منتقل من حال إلى حال فعالم الزمان في كل زمان منتقل وعالم الأنفاس في كل نفس وعالم التجلي في كل تجل والعلة في ذلك قوله تعالى كُلَّ يَوْمٍ هُوَ في شَأْنٍ وأيده بقوله تعالى سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ وكل إنسان يجد من نفسه تنوع الخواطر في قلبه في حركاته وسكناته فما من تقلب يكون في العالم الأعلى والأسفل إلا وهو عن توجه إلهي بتجل خاص لتلك العين فيكون استناده من ذلك التجلي بحسب ما تعطيه حقيقته واعلم أن المعارف الكونية منها علوم مأخوذة من الأكوان ومعلوماتها أكوان وعلوم تؤخذ من الأكوان ومعلوماتها نسب والنسب ليست بأكوان وعلوم تؤخذ من الأكوان ومعلومها ذات الحق وعلوم تؤخذ من الحق ومعلومها الأكوان وعلوم تؤخذ من النسب ومعلومها الأكوان وهذه كلها تسمى العلوم الكونية وهي تنتقل بانتقال معلوماتها في أحوالها وصورة انتقالها أيضا إن الإنسان يطلب ابتداء معرفة كون من الأكوان أو يتخذ دليلا على مطلوبه كونا من الأكوان فإذا حصل له ذلك المطلوب لاح له وجه الحق فيه ولم يكن ذلك الوجه مطلوبا له فتعلق به هذا الطالب وترك قصده الأول وانتقل العلم يطلب ما يعطيه ذلك الوجه فمنهم من يعرف ذلك ومنهم من هو حاله هذا ولا يعرف ما انتقل عنه ولا ما انتقل إليه حتى إن بعض أهل الطريق زل فقال إذا رأيتم الرجل يقيم على حال واحدة أربعين يوما فاعلموا أنه مراء يا عجبا وهل تعطي الحقائق أن يبقى أحد نفسين أو زمانين على حال واحدة فتكون الألوهية معطلة الفعل في حقه هذا ما لا يتصور إلا أن هذا العارف لم يعرف ما يراد بالانتقال بكون الانتقال كان في الأمثال فكان ينتقل مع الأنفاس من الشي‏ء إلى مثله فالتبست عليه الصورة بكونه ما تغير عليه من الشخص حاله الأول في تخبله كما يقال فلان ما زال اليوم ماشيا وما قعد ولا شك أن المشي حركات كثيرة متعددة وكل حركة ما هي عين الأخرى بل هي مثلها وعلمك ينتقل بانتقالها فيقول ما تغير عليه الحال وكم تغيرت عليه من الأحوال‏\n\n\n### «فصل» [نظرية انتقالات العلوم الإلهية]\n\n\nوأما انتقالات العلوم الإلهية فهو الاسترسال الذي ذهب إليه أبو المعالي إمام الحرمين والتعلقات التي ذهب إليها محمد بن عمر بن الخطيب الرازي وأما أهل القدم الراسخة من أهل طريقنا فلا يقولون هنا بالانتقالات فإن الأشياء عند الحق مشهودة معلومة الأعيان والأحوال على صورها التي تكون عليها ومنها إذا وجدت أعيانها إلى ما لا يتناهى فلا يحدث تعلق على مذهب ابن الخطيب ولا يكون استرسال على مذهب إمام الحرمين رضي الله عن جميعهم والدليل العقلي الصحيح يعطي ما ذهبنا إليه وهذا الذي ذكره أهل الله ووافقنا هم عليه يعطيه الكشف من المقام الذي وراء طور العقل فصدق الجميع وكل قوة أعطت بحسبها فإذا أوجد الله الأعيان فإنما أوجدها لها لا له وهي على حالاتها بأماكنها وأزمنتها على اختلاف أمكنتها وأزمنتها فيكشف لها عن أعيانها وأحوالها شيئا بعد شي‏ء إلى ما لا يتناهى على التتالي والتتابع فالأمر بالنسبة إلى الله واحد كما قال تعالى وما أَمْرُنا إِلَّا واحِدَةٌ كَلَمْحٍ بِالْبَصَرِ والكثرة في نفس المعدودات وهذا الأمر قد حصل لنا في وقت فلم يختل علينا فيه وكان الأمر في الكثرة واحدا عندنا ما غاب ولا زال وهكذا شهده كل من ذاق هذا فهم في المثال كشخص واحد له أحوال مختلفة وقد صورت له صورة في كل حال يكون عليها هكذا كل شخص وجعل بينك وبين هذه الصور حجاب فكشف لك عنها وأنت من جملة من له فيها صورة فأدركت جميع ما فيها عند رفع الحجاب بالنظرة الواحدة فالحق سبحانه ما عدل بها عن صورها في ذلك الطبق بل كشف لها عنها وألبسها حالة الوجود لها فعاينت نفسها على ما تكون عليه أبدا وليس في حق نظرة الحق زمان ماض ولا مستقبل بل الأمور كلها معلومة له في مراتبها بتعداد صورها فيها ومراتبها لا توصف بالتناهي ولا تنحصر ولا حد لها تقف عنده فهكذا هو إدراك الحق تعالى للعالم ولجميع الممكنات في حال عدمها ووجودها فعليها تنوعت الأحوال في خيالها لا في علمها فاستفادت من كشفها لذلك علما لم يكن عندها لا حالة لم تكن عليها فتحقق هذا فإنها مسألة خفية غامضة تتعلق بسر القدر القليل من أصحابنا من يعثر عليها وأما تعلق علمنا بالله تعالى فعلى قسمين معرفة بالذات الإلهية وهي موقوفة على الشهود والرؤية لكنها رؤية من غير إحاطة ومعرفة بكونه إلها وهي موقوفة على أمرين أو أحدهما وهو الوهب والأمر الآخر النظر والاستدلال وهذه هي المعرفة المكتسبة وأما العلم بكونه مختارا فإن الاختيار يعارضه‏\nأحدية المشيئة فنسبته إلى الحق إذا وصف به إنما ذلك من حيث ما هو الممكن عليه لا من حيث ما هو الحق عليه قال تعالى ولكِنْ حَقَّ الْقَوْلُ مِنِّي وقال تعالى أَ فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ وقال ما يُبَدَّلُ الْقَوْلُ لَدَيَّ وما أحسن ما تمم به هذه الآية وما أَنَا بِظَلَّامٍ لِلْعَبِيدِ وهنا نبه على سر القدر وبه كانت الحجة البالغة لله على خلقه وهذا هو الذي يليق بجناب الحق والذي يرجع إلى الكون ولَوْ شِئْنا لَآتَيْنا كُلَّ نَفْسٍ هُداها فما شئنا ولكن استدراك للتوصيل فإن الممكن قابل للهداية والضلالة من حيث حقيقته فهو موضع الانقسام وعليه يرد التقسيم وفي نفس الأمر ليس لله فيه إلا أمر واحد وهو معلوم عند الله من جهة حال الممكن‏\n\n\n### «مسألة» [معقول الاختراع‏]\n\n\nظاهر معقول الاختراع عدم المثال في الشاهد كيف يصح الاختراع في أمر لم يزل مشهودا له تعالى معلوما كما قررناه في علم الله بالأشياء في كتاب المعرفة بالله‏\n\n\n### «مسألة» [في الأسماء الإلهية]\n\n\nالأسماء الإلهية نسب وإضافات ترجع إلى عين واحدة إذ لا يصح هناك كثرة بوجود أعيان فيه كما زعم من لا علم له بالله من بعض النظار ولو كانت الصفات أعيانا زائدة وما هو إله إلا بها لكانت الألوهية معلولة بها فلا يخلو أن تكون هي عين الإله فالشي‏ء لا يكون علة لنفسه أو لا تكون فالله لا يكون معلولا لعلة ليست عينه فإن العلة متقدمة على المعلول بالرتبة فيلزم من ذلك افتقار الإله من كونه معلولا لهذه الأعيان الزائدة التي هي علة له وهو محال ثم إن الشي‏ء المعلول لا يكون له علتان وهذه كثيرة ولا يكون إلها إلا بها فبطل أن تكون الأسماء والصفات أعيانا زائدة على ذاته تعالى الله عما يقول الظالمون علوا كبيرا\n\n\n### «مسألة» [الصورة في المرآة جسد برزخي‏]\n\n\nالصورة في المرآة جسد برزخي كالصورة التي يراها النائم إذا وافقت الصورة الخارجة وكذلك الميت والمكاشف وصورة المرآة أصدق ما يعطيه البرزخ إذا كانت المرآة على شكل خاص ومقدار جرم خاص فإن لم تكن كذلك لم تصدق في كل ما تعطيه بل تصدق في البعض واعلم أن أشكال المرائي تختلف فتختلف الصور فلو كان النظر بالانعكاس إلى المرئيات كما يراه بعضهم لأدركها الرائي على ما هي عليه من كبر جرمها وصغره ونحن نبصر في الجسم الصقيل الصغير الصورة المرئية الكبيرة في نفسها صغيرة وكذلك الجسم الكبير الصقيل يكبر الصورة في عين الرائي ويخرجها عن حدها وكذلك العريض والطويل والمتموج فاذن ليست الانعكاسات تعطي ذلك فلم يتمكن أن نقول إلا أن الجسم الصقيل أحد الأمور التي تعطي صور البرزخ ولهذا لا تتعلق الرؤية فيها إلا بالمحسوسات فإن الخيال لا يمسك إلا ما له صورة محسوسة أو مركب من أجزاء محسوسة تركبها القوة المصورة فتعطي صورة لم يكن لها في الحس وجود أصلا لكن أجزاء ما تركبت منه محسوسة لهذا الرائي بلا شك‏\n\n\n### «مسألة» [في الإنسان الكامل‏]\n\n\nأكمل نشأة ظهرت في الموجودات الإنسان عند الجميع لأن الإنسان الكامل وجد على الصورة لا الإنسان الحيوان والصورة لها الكمال ولكن لا يلزم من هذا أن يكون هو الأفضل عند الله فهو أكمل بالمجموع فإن قالوا يقول الله لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ ومعلوم أنه لا يريد أكبر في الجرم ولكن يريد في المعنى قلنا له صدقت ولكن من قال إنها أكبر منه في الروحانية بل معنى السموات والأرض من حيث ما يدل عليه كل واحدة منهما من طريق المعنى المنفرد من النظم الخاص لأجرامهما أكبر في المعنى من جسم الإنسان لا من كل الإنسان ولهذا يصدر عن حركات السموات والأرض أعيان المولدات والتكوينات والإنسان من حيث جرمه من المولدات ولا يصدر من الإنسان هذا وطبيعة العناصر من ذلك فلهذا كانا أكبر من خلق الإنسان إذ هما له كالأبوين وهو من الأمر الذي يتنزل بين السماء والأرض ونحن إنما ننظر في الإنسان الكامل فنقول إنه أكمل وأما أفضل عند الله فذلك لله تعالى وحده فإن المخلوق لا يعلم ما في نفس الخالق إلا بإعلامه إياه‏\n\n\n### «مسألة» [في الصفات النفيسة]\n\n\nليس للحق صفة نفسية ثبوتية إلا واحدة لا يجوز أن يكون له اثنتان فصاعدا إذ لو كان لكانت ذاته مركبة منهما أو منهن والتركيب في حقه محال فإثبات صفة زائدة ثبوتية على واحدة محال‏\n\n\n### «مسألة» [نفي الصفات ونفي سرمدية العذاب‏]\n\n\nلما كانت الصفات نسبا وإضافات والنسب أمور عدمية وما ثم إلا ذات واحدة من جميع الوجوه لذلك جاز أن يكون العباد مرحومين في آخر الأمر ولا يسرمد عليهم عدم الرحمة إلى ما لا نهاية له إذ لا مكره له على ذلك والأسماء والصفات ليست أعيانا توجب حكما عليه في الأشياء فلا مانع من شمول الرحمة للجميع ولا سيما وقد ورد سبقها للغضب فإذا انتهى الغضب إليها كان الحكم لها فكان الأمر على ما قلناه لذلك قال تعالى ولو شاء ربك‏\n(أَنْ لَوْ يَشاءُ الله) لَهَدَى النَّاسَ جَمِيعاً فكان حكم هذه المشيئة في الدنيا بالتكليف وأما في الآخرة فالحكم لقوله يَفْعَلُ ما يُرِيدُ فمن يقدر أن يدل على أنه لم يرد إلا تسرمد العذاب على أهل النار ولا بد أو على واحد في العالم كله حتى يكون حكم الاسم المعذب والمبلى والمنتقم وأمثاله صحيحا والاسم المبلى وأمثاله نسبة وإضافة لا عين موجودة وكيف تكون الذات الموجودة تحت حكم ما ليس بموجود فكل ما ذكر من قوله لو شاء ولئن شئنا لأجل هذا الأصل فله الإطلاق وما ثم نص يرجع إليه لا يتطرق إليه احتمال في تسرمد العذاب كما لنا في تسرمد النعيم فلم يبق إلا الجواز وأنه رحمن الدنيا والآخرة فإذا فهمت ما أشرنا إليه قل تشعيبك بل زال بالكلية\n\n\n### «مسألة» [إطلاق الجواز على الله‏]\n\n\nإطلاق الجواز على الله تعالى سوء أدب مع الله ويحصل المقصود بإطلاق الجواز على الممكن وهو الأليق إذ لم يرد به شرع ولا دل عليه عقل فافهم وهذا القدر كاف فإن العلم إلهي أوسع من أن يستقصي والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Seventeen: Concerning the Knowledge of the Transference of Cosmological Sciences and a Selection from the Primordial Sustaining Divine Sciences.\n\nThe sciences of the cosmos are subject to transference,\nBut the science of the Face (Wajh) hopes for no cessation.\n\nSo we affirm them and deny them all together,\nAnd we traverse their high ground, state after state.\n\nMy God, how can any other than You know You,\nWhen Your like is He who is Blessed or Exalted?\n\nMy God, how can any other than You know You,\nAnd can any other be a likeness unto You?\n\nAnd whoever seeks the Path without a guide,\nMy God, he has surely sought the impossible.\n\nMy God, how can hearts love You,\nWhile they do not hope for intimacy and union (al-wiṣāl)?\n\nMy God, how can any other than You know You,\nAnd is there anything other than You? No, never!\n\nMy God, how can eyes perceive You,\nWhen You are neither the shining lights nor the shadows?\n\nMy God, I do not see myself as other than You,\nAnd how can I see the impossible or the delusion?\n\nMy God, You are You, and indeed my 'I-ness' (innī)\nSeeks bounty from Your 'I-ness' (anā'iyyatika).\n\nDue to a poverty that arose in me from my existence (wujūdī),\nBorn of Your richness, and thus became a state (ḥāl).\n\nAnd He brought me forth to manifest me unto Him,\nAnd He saw nothing other than Him in me, so I was a sign (āl).\n\nAnd whoever intends the mirage seeking water,\nSees the pure spring of life within it.\n\nI am the cosmos (al-kawn) for which there is nothing like me,\nAnd who is like me before the likeness?\n\nAnd this is among the most wondrous things, so look,\nPerhaps you will see that its likeness is impossible.\n\nFor there is nothing in the cosmos but a Singular Existence (wujūd fard),\nTranscendently pure above being resisted or attained.\n\n### [The World is in Continuous Change Resulting from Constant Divine Orientations]\n\nKnow, may Allah aid you, that everything in the World (al-ʿālam) is transferred from one state (ḥāl) to another. The world of time is transferred in every time, the world of breaths (anfās) in every breath, and the world of the Theophany (al-tajallī) in every theophany. The reason for this is His saying, the Exalted: <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>> (Every day He is engaged in some affair) [Q. 55:29]. This is supported by His saying, the Exalted: <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ>> (We shall attend to you, O you two heavy burdens [jinn and mankind]) [Q. 55:31].\n\nEvery human being finds within himself the variation of thoughts (khawāṭir) in his heart, in his movements and his stillness. There is no fluctuation that occurs in the higher or lower World except that it stems from a Divine orientation (tawajjuh ilāhī) through a specific Self-disclosure (tajallī) to that specific entity (ʿayn). Thus, its reliance upon that Theophany is according to what its reality (ḥaqīqah) dictates.\n\nKnow that the cosmological sciences (al-ʿulūm al-kawnīyah) include sciences taken from the existent things (al-akwān) whose objects of knowledge (maʿlūmātuhā) are existent things; and sciences taken from the existent things whose objects of knowledge are relations (nisab), and relations are not existent things; and sciences taken from the existent things whose object of knowledge is the Essence (dhāt) of the Real (al-Ḥaqq); and sciences taken from the Real whose object of knowledge are the existent things; and sciences taken from the relations whose object of knowledge are the existent things. All of these are called the cosmological sciences, and they transfer with the transference of their objects of knowledge in their states.\n\nThe form of their transference is also that the human being initially seeks the knowledge of one of the existent things, or takes an existent thing as a proof (dalīl) for his objective. When he attains that objective, the Face (Wajh) of the Real appears to him within it, even though that Face was not his objective. This seeker then attaches himself to it and abandons his initial intention, and the knowledge transfers, seeking what that Face grants. Some of them recognize this, and some are in this state but do not know what they transferred from nor what they transferred to.\n\nSo much so that some people of the Path (ahl al-ṭarīq) erred and said: \"If you see a man remaining in one state for forty days, know that he is a pretender (murā'i).\" How astonishing! Do the realities (al-ḥaqā'iq) permit anyone to remain in one state for two breaths or two moments in time? If so, the Divinity (al-ulūhiyyah) would be rendered inactive in its function concerning him. This is inconceivable. However, this gnostic (al-ʿārif) did not understand what is meant by transference, because the transference occurred in the likenesses (al-amthāl). He was transferring with the breaths from a thing to its likeness. The image became confused for him because the person's initial state did not change in his perception, just as it is said: \"So-and-so has been walking all day and has not sat down.\" There is no doubt that walking consists of many diverse movements, and every movement is not the exact same as the other, but is its likeness. Your knowledge transfers with their transference, yet he says that the state has not changed for him, while how many states have changed for him!\n\n### Section: [The Theory of the Transferences of Divine Sciences]\n\nAs for the transference of the Divine Sciences (al-ʿulūm al-ilāhīyah), this is the continuity (al-istirsāl) adopted by Abu al-Maʿali, Imam al-Haramayn, and the attachments (al-taʿalluqāt) adopted by Muhammad ibn ʿUmar ibn al-Khaṭīb al-Rāzī.\n\nHowever, the people of firm foundation (ahl al-qadam al-rāsikhah) among our people of the Path do not speak of transferences here. For things are witnessed and known by the Real (al-Ḥaqq)—their entities (al-aʿyān) and their states (al-aḥwāl)—in the forms they will take, from the moment their entities are found until infinity. Therefore, no attachment (taʿalluq) arises according to the doctrine of Ibn al-Khaṭīb, nor is there continuity (istirsāl) according to the doctrine of Imam al-Haramayn, may Allah be pleased with all of them.\n\nThe sound rational proof (al-dalīl al-ʿaqlī al-ṣaḥīḥ) supports what we have adopted. And this which the People of Allah (ahl Allāh) have mentioned, and with whom we agree, is granted by the Unveiling (al-kashf) from the station (maqām) that is beyond the sphere of the intellect (ṭawr al-ʿaql). So all are truthful, and every power has given according to its capacity.\n\nWhen Allah brings the entities (al-aʿyān) into existence, He only brings them into existence for themselves, not for Him. They are in their states, in their places and times, according to the variation of their places and times. He unveils to them their entities and their states, thing after thing, unto infinity, in succession and sequence.\n\nThe matter (al-amr), relative to Allah, is one, as He, the Exalted, said: <<وَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ كَلَمْحٍ بِالْبَصَرِ>> (And Our command is but one, like the twinkling of an eye) [Q. 54:50]. The multiplicity (al-kathrah) resides in the counted things themselves. This matter occurred to us at one time, and it did not become confused for us therein. The matter in its multiplicity was one for us; it neither vanished nor ceased.\n\nThus, everyone who has tasted this witnesses it. They are, in the example, like a single person who has different states, and an image is formed for him in every state he is in. Thus is every person. A veil (ḥijāb) is placed between you and these images, and then He unveils them to you, and you are among those who have an image within it. You perceive everything within it upon the lifting of the veil with a single glance.\n\nThe Real (al-Ḥaqq), glory be to Him, did not deviate them from their forms in that layer, but rather unveiled them to themselves and clothed them in the state of existence (wujūd) for them. Thus, they witnessed themselves as they are eternally.\n\nIn the right of the Real’s gaze, there is no past or future time. Rather, all matters are known to Him in their levels (marātib) by the enumeration of their forms therein, and their levels are not described by finitude, nor are they confined, nor do they have a limit at which they stop.\n\nThis is how the apprehension of the Real, the Exalted, is for the World (al-ʿālam) and for all possibilities (al-mumkināt) in their state of non-existence and their state of existence. Upon them, the states diversified in their imagination (khayāl), not in their knowledge (ʿilm). Thus, they benefited from the unveiling (kashf) of that, gaining a knowledge they did not possess, but not a state they were not already upon. Realize this, for it is a subtle and obscure issue related to the secret of Destiny (sirr al-qadar), and few of our companions stumble upon it.\n\nAs for the attachment of our knowledge to Allah, the Exalted, it is of two types:\n1. Knowledge (maʿrifah) of the Divine Essence (al-dhāt al-ilāhīyah), which depends on Witnessing (al-shuhūd) and Vision (al-ru’yah), but it is a vision without comprehension (iḥāṭah).\n2. Knowledge of His being a God (ilāh), which depends on two matters, or one of them: the first is Divine Gift (al-wahb), and the other is reflection and inference (al-naẓar wa al-istidlāl). This is the acquired knowledge (al-maʿrifah al-muktasabah).\n\nAs for the knowledge of His being a Chooser (mukhtār), choice (al-ikhtiyār) is countered by the Oneness (aḥadiyyah) of the Will (al-mashī’ah). Therefore, His attribution to the Real, when He is described by it, is only from the perspective of what is possible for Him, not from the perspective of what the Real is upon.\n\nHe, the Exalted, said: <<وَلَكِنْ حَقَّ الْقَوْلُ مِنِّي>> (But the word from Me has come into effect) [Q. 32:13]. And He, the Exalted, said: <<أَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذَابِ>> (Then is he upon whom the word of punishment has come into effect...) [Q. 39:19]. And He said: <<مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ>> (The word will not be changed with Me) [Q. 50:29]. And how excellent is the completion of this verse: <<وَمَا أَنَا بِظَلَّامٍ لِلْعَبِيدِ>> (And I am not unjust to the servants) [Q. 50:29]. Herein, He draws attention to the secret of Destiny (sirr al-qadar), and by this was the conclusive argument (al-ḥujjah al-bālighah) of Allah against His creation. This is what is fitting for the Divine Presence (janāb al-Ḥaqq).\n\nThat which relates to the cosmos (al-kawn) is: <<وَلَوْ شِئْنَا لَآتَيْنَا كُلَّ نَفْسٍ هُدَاهَا>> (And if We had willed, We would have given every soul its guidance) [Q. 32:13]. So, We did not will it. But this is a rectification for the sake of conveyance, for the possible (al-mumkin) is receptive to guidance and misguidance by virtue of its reality (ḥaqīqah). Thus, it is the locus of division, and the division is applied to it. In reality (fī nafs al-amr), Allah has only one command concerning it, and that is known to Allah from the perspective of the state of the possible.\n\n### Issue: [The Intelligible of Invention]\n\nThe apparent intelligible meaning of invention (al-ikhtirāʿ) is the absence of a precedent (mithāl) in the witnessed realm. How can invention be valid concerning a matter that has always been witnessed and known by Him, the Exalted, as we established in the book *Knowledge of Allah* concerning Allah’s knowledge of things?\n\n### Issue: [Concerning the Divine Names]\n\nThe Divine Names (al-asmā’ al-ilāhīyah) are relations (nisab) and attributions (iḍāfāt) that refer back to a single Entity (ʿayn wāḥidah), since multiplicity (kathrah) by the existence of entities within Him is not valid, as claimed by some speculative thinkers (al-nuẓẓār) who lack knowledge of Allah.\n\nIf the Attributes (al-ṣifāt) were superadded entities (aʿyān zā’idah), and He were not God (ilāh) except through them, then the Divinity (al-ulūhiyyah) would be caused by them. It must follow that either they are the Essence (al-ʿayn) of God—but a thing cannot be the cause of itself—or they are not. If they are not, then Allah cannot be caused by a cause that is not His Essence, for the cause precedes the effect in rank. This would necessitate the dependence of God, since He would be the effect of these superadded entities which are His cause, and this is impossible. Furthermore, a caused thing cannot have two causes, and these are many, and He would not be God except through them. Therefore, the notion that the Names and Attributes are superadded entities to His Essence (dhāt) is null and void. Exalted is Allah far above what the wrongdoers say with great exaltation.\n\n### Issue: [The Image in the Mirror is a Barzakhī Body]\n\nThe image in the mirror is a body of the Isthmus (jasad barzakhī), like the image seen by the sleeper if it corresponds to the external image, and likewise for the deceased and the one who receives Unveiling (al-mukāshif).\n\nThe image in the mirror is the most truthful thing granted by the Barzakh (Isthmus), provided the mirror is of a specific shape and a specific size of substance (jirm). If it is not so, it will not be truthful in everything it grants, but only in part.\n\nKnow that the shapes of mirrors differ, and thus the images differ. If vision were due to the reflection (al-inʿikās) of the seen objects, as some believe, the viewer would perceive them exactly as they are, in terms of the size and smallness of their substance. Yet, we see a large perceived image in itself appearing small in a small polished body. Likewise, a large polished body magnifies the image in the eye of the viewer and takes it beyond its limit, and similarly for the wide, the long, and the wavy.\n\nTherefore, reflections do not grant this. We can only conclude that the polished body is one of the things that grants the images of the Barzakh (Isthmus). For this reason, vision in it relates only to sensible things, because the Imagination (al-khayāl) only retains what has a sensible form, or what is composed of sensible parts that the formative faculty (al-quwwah al-muṣawwirah) combines, thereby granting an image that had no existence in the sense realm at all, although the parts from which it is composed are undoubtedly sensible to this viewer.\n\n### Issue: [Concerning the Perfect Human]\n\nThe most complete creation (nash’ah) that appeared in existent things, according to everyone, is the human being, because the Perfect Human (al-insān al-kāmil) was created upon the Form (al-ṣūrah), not the animal human. And the Form possesses perfection.\n\nHowever, this does not necessarily mean that he is the most favored (al-afḍal) in the sight of Allah. He is the most complete by virtue of the totality. If they argue, saying that Allah says: <<لَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ>> (The creation of the heavens and earth is greater than the creation of mankind, but most of mankind do not know) [Q. 40:57], and it is known that He does not mean greater in substance (jirm) but greater in meaning (maʿnā), we reply: You speak truly. But who said that they are greater than him in spirituality (rūḥāniyyah)? Rather, the meaning of the heavens and the earth, from the perspective of what each of them signifies through the singular meaning of the specific order of their substances, is greater in meaning than the body (jism) of the human being, but not than the entirety of the human being.\n\nFor this reason, the entities of the generated things (al-muwalladāt) and formations (al-takwīnāt) issue from the movements of the heavens and the earth, and the human being, in terms of his substance, is one of the generated things, and this does not issue from the human being, nor does the nature of the elements. Therefore, they are greater than the creation of man, since they are like the two parents to him, and he is of the matter that descends between the heaven and the earth.\n\nWe only look at the Perfect Human (al-insān al-kāmil) and say that he is the most complete (akmal). As for being the most favored (afḍal) in the sight of Allah, that belongs to Allah, the Exalted, alone, for the created being does not know what is in the mind of the Creator except by His informing him.\n\n### Issue: [Concerning the Essential Attributes]\n\nThe Real (al-Ḥaqq) has only one affirmative essential Attribute (ṣifah nafsīyah thubūtīyah). It is not permissible for Him to have two or more, for if He did, His Essence (dhāt) would be composed of them, and composition (al-tarkīb) is impossible concerning Him. Therefore, the affirmation of more than one superadded affirmative Attribute is impossible.\n\n### Issue: [The Negation of Attributes and the Negation of the Eternity of Punishment]\n\nSince the Attributes (al-ṣifāt) are relations (nisab) and attributions (iḍāfāt), and relations are non-existent matters (umūr ʿadamīyah), and there is only one Essence (dhāt wāḥidah) from all perspectives, it is therefore permissible for the servants to be shown mercy in the end, and for the absence of mercy not to be eternalized (yusarmad) upon them unto infinity, since there is no compulsion upon Him to do so.\n\nThe Names (al-asmā’) and Attributes are not entities (aʿyān) that necessitate a ruling upon Him concerning things. Thus, there is no impediment to the inclusion of mercy (al-raḥmah) for all, especially since its precedence over wrath (al-ghaḍab) has been reported. When wrath ends at mercy, the ruling belongs to mercy. Thus, the matter is as we have stated.\n\nTherefore, He, the Exalted, said: <<وَلَوْ شَاءَ رَبُّكَ لَهَدَى النَّاسَ جَمِيعًا>> (And if your Lord had willed, He would have guided mankind all together) [Q. 11:118]. The ruling of this Will (mashī’ah) in this world is through obligation (al-taklīf). As for the Hereafter, the ruling belongs to His saying: <<يَفْعَلُ مَا يُرِيدُ>> (He does what He wills) [Q. 11:107].\n\nWho can prove that He has willed nothing but the eternity of punishment (tassarmud al-ʿadhāb) upon the people of the Fire, necessarily, or upon a single person in the entire World, such that the ruling of the Name 'The Punisher' (al-Muʿadhdhib), 'The Afflicter' (al-Mublī), 'The Avenger' (al-Muntaqim), and their likes, would be valid? The Name 'The Afflicter' and its likes are a relation and an attribution, not an existent entity (ʿayn mawjūdah). How can the existent Essence (al-dhāt al-mawjūdah) be subject to the ruling of what is non-existent?\n\nEverything mentioned, such as His saying \"If He had willed\" and \"If We had willed,\" is for the sake of this principle: that He has absolute freedom (al-iṭlāq). There is no text to which one can refer that does not admit the possibility of the eternity of punishment, just as we have the possibility of the eternity of bliss. Thus, only permissibility (al-jawāz) remains, and that He is the Merciful (Raḥmān) of this world and the Hereafter. If you understand what we have alluded to, your branching out of issues will diminish, or rather, cease entirely.\n\n### Issue: [Applying Permissibility to Allah]\n\nApplying permissibility (al-jawāz) to Allah, the Exalted, is bad manners (sū’ adab) toward Allah. The objective is achieved by applying permissibility to the possible (al-mumkin), which is more fitting, since neither Sacred Law (sharʿ) nor intellect (ʿaql) has indicated otherwise. Understand this. This much is sufficient, for Divine Knowledge (al-ʿilm al-ilāhī) is too vast to be fully encompassed. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way) [Q. 33:4].",
    "ur": "باب سترہ: علومِ کونیہ کے انتقال اور علومِ الٰہیہ ممدہ اصلیہ کے کچھ حصوں کی معرفت میں۔\n\nاکوان (Kā'ināt) کے علوم منتقل ہوتے رہتے ہیں،\nاور وجہ (Wajh) کا علم زوال کا خواہاں نہیں ہوتا۔\n\nپس ہم ان سب کو ثابت بھی کرتے ہیں اور ان کی نفی بھی کرتے ہیں،\nاور ہم ان کے راستے کو حال در حال قطع کرتے ہیں۔\n\nاے میرے معبود! آپ کو آپ کے سوا کوئی کیسے جان سکتا ہے؟\nاور آپ جیسا کون ہے جو بابرکت ہو یا بلند ہو؟\n\nاے میرے معبود! آپ کو آپ کے سوا کوئی کیسے جان سکتا ہے؟\nاور کیا کوئی غیر آپ کے لیے مثال بن سکتا ہے؟\n\nاور جس نے بغیر دلیل کے راستہ طلب کیا،\nاے میرے معبود! اس نے یقیناً محال (Muhāl) کو طلب کیا۔\n\nاے میرے معبود! دل آپ سے کیسے محبت کر سکتے ہیں،\nجبکہ وہ الفت اور وصال (Wiṣāl) کی امید نہ رکھتے ہوں؟\n\nاے میرے معبود! آپ کو آپ کے سوا کوئی کیسے پہچان سکتا ہے؟\nاور کیا آپ کے سوا کوئی شے ہے؟ نہیں، ہرگز نہیں۔\n\nاے میرے معبود! آنکھیں آپ کو کیسے دیکھ سکتی ہیں،\nجبکہ آپ نہ تو روشن ستارے ہیں اور نہ ہی تاریکی؟\n\nاے میرے معبود! میں اپنے آپ کو آپ کے سوا نہیں دیکھتا،\nاور میں محال (Muhāl) یا گمراہی کو کیسے دیکھ سکتا ہوں؟\n\nاے میرے معبود! آپ، آپ ہی ہیں، اور بے شک میں\nاپنی انانیت (Anā'iyyat) سے عطا کا طالب ہوں۔\n\nیہ اس فقر (Faqr) کی وجہ سے ہے جو میرے وجود (Wujūd) سے میرے پاس قائم ہوا،\nجو آپ کی بے نیازی سے پیدا ہوا اور ایک حال (Ḥāl) بن گیا۔\n\nاور اس نے مجھے ظاہر کیا تاکہ وہ مجھے اس کی طرف ظاہر کرے،\nاور اس نے مجھے اپنے سوا نہیں دیکھا، پس میں ایک نشان بن گیا۔\n\nاور جس نے سراب کا قصد کیا، پانی چاہتے ہوئے،\nوہ اس میں آبِ حیات (Āb-e-Hayāt) کو صاف و شفاف دیکھتا ہے۔\n\nمیں وہ کون (Kawn) ہوں جس کی کوئی مثال نہیں،\nاور میں وہ ہوں جس کی مثال سے پہلے میں اس جیسا ہوں۔\n\nاور یہ عجیب ترین چیزوں میں سے ہے، پس دیکھو،\nشاید تم اس کی مماثلت کو محال (Istihāla) پاؤ۔\n\nپس کون (Kawn) میں ایک فردی وجود (Wujūd-e-Fard) کے سوا کچھ نہیں،\nجو اس سے پاک ہے کہ اس کا مقابلہ کیا جائے یا اسے حاصل کیا جائے۔\n\n### [عالم میں مسلسل تبدیلی الٰہی توجہات کا نتیجہ ہے]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ عالم (Ālam) میں ہر شے ایک حال سے دوسرے حال کی طرف منتقل ہوتی رہتی ہے۔ پس عالمِ زمان ہر لمحے منتقل ہے، عالمِ انفاس (Anfās) ہر سانس میں منتقل ہے، اور عالمِ التجلی (Tajallī) ہر ظہور الٰہی (Tajallī) میں منتقل ہے۔ اس کی علت (Illat) اللہ تعالیٰ کا یہ فرمان ہے:\nكُلَّ يَوْمٍ هُوَ في شَأْنٍ (ہر دن وہ ایک نئی شان میں ہوتا ہے) [الرحمن: 29]۔\nاور اس کی تائید اللہ تعالیٰ کے اس فرمان سے ہوتی ہے:\nسَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ (اے دونوں بوجھو! ہم عنقریب تمہاری طرف متوجہ ہوں گے) [الرحمن: 31]۔\nاور ہر انسان اپنے اندر حرکتوں اور سکون میں اپنے دل میں خواطر (Khawātir) کا تنوع پاتا ہے۔ پس عالمِ بالا اور عالمِ اسفل میں کوئی بھی تغیر نہیں ہوتا مگر وہ اس عین (Ain) کے لیے ایک خاص تجلی (Tajallī) کے ذریعے ایک الٰہی توجہ سے ہوتا ہے۔ پس اس کا استناد اس تجلی سے اس کی حقیقت (Ḥaqīqat) کے تقاضے کے مطابق ہوتا ہے۔ جان لیجیے کہ معارفِ کونیہ (Ma'ārif-e-Kawnīyah) میں سے کچھ علوم اکوان (Akwān) سے حاصل کیے جاتے ہیں اور ان کے معلومات بھی اکوان ہوتے ہیں۔ اور کچھ علوم اکوان سے حاصل کیے جاتے ہیں اور ان کے معلومات نسب (Nisab) ہوتے ہیں، اور نسب اکوان نہیں ہوتے۔ اور کچھ علوم اکوان سے حاصل کیے جاتے ہیں اور ان کا معلوم ذات الحق (Dhāt al-Ḥaqq) ہوتی ہے۔ اور کچھ علوم الحق (Al-Ḥaqq) سے حاصل کیے جاتے ہیں اور ان کا معلوم اکوان ہوتے ہیں۔ اور کچھ علوم نسب سے حاصل کیے جاتے ہیں اور ان کا معلوم اکوان ہوتے ہیں۔ یہ سب علومِ کونیہ (Ulūm-e-Kawnīyah) کہلاتے ہیں، اور یہ اپنے معلومات کے احوال میں منتقل ہونے سے منتقل ہوتے ہیں۔ ان کے انتقال کی صورت یہ بھی ہے کہ انسان ابتداءً اکوان میں سے کسی کون (Kawn) کی معرفت (Ma'rifat) طلب کرتا ہے، یا اپنے مطلوب پر اکوان میں سے کسی کون کو دلیل بناتا ہے۔ جب اسے وہ مطلوب حاصل ہو جاتا ہے تو اس میں اسے وجہ الحق (Wajh al-Ḥaqq) نظر آتا ہے، حالانکہ وہ وجہ اس کا مطلوب نہیں تھا۔ پس یہ طالب اس سے وابستہ ہو جاتا ہے اور اپنے پہلے مقصد کو چھوڑ دیتا ہے، اور علم منتقل ہو کر اس چیز کو طلب کرتا ہے جو وہ وجہ عطا کرتا ہے۔ ان میں سے کچھ ایسے ہیں جو اس بات کو جانتے ہیں، اور کچھ ایسے ہیں جن کا حال یہی ہوتا ہے لیکن وہ نہیں جانتے کہ وہ کس چیز سے منتقل ہوئے اور کس چیز کی طرف منتقل ہوئے۔ یہاں تک کہ بعض اہلِ طریق (Ahl-e-Tarīq) نے لغزش کھائی اور کہا: \"جب تم کسی شخص کو چالیس دن تک ایک ہی حال پر قائم دیکھو تو جان لو کہ وہ ریاکار ہے۔\" تعجب ہے! کیا حقائق (Ḥaqā'iq) یہ اجازت دیتے ہیں کہ کوئی شخص دو سانسوں یا دو زمانوں تک ایک ہی حال پر باقی رہے؟ اگر ایسا ہو تو اس کے حق میں الوہیت (Ulūhiyyat) کا فعل معطل ہو جائے گا۔ یہ ایک ناقابلِ تصور بات ہے۔ مگر یہ کہ اس عارف (Ārif) نے یہ نہیں جانا کہ انتقال سے کیا مراد ہے، کیونکہ انتقال امثال (Amthāl) میں ہوتا ہے۔ پس وہ انفاس (Anfās) کے ساتھ ایک شے سے اس کی مثل کی طرف منتقل ہوتا رہا، تو اس پر صورت مشتبہ ہو گئی کیونکہ اس شخص پر اس کے پہلے حال میں کوئی تبدیلی نہیں آئی، جیسا کہ کہا جاتا ہے: \"فلاں آج سارا دن چلتا رہا اور بیٹھا نہیں۔\" اور بلاشبہ چلنا بہت سی متعدد حرکتیں ہیں، اور ہر حرکت دوسری حرکت کا عین نہیں ہے بلکہ اس کی مثل ہے۔ اور آپ کا علم ان کے منتقل ہونے سے منتقل ہوتا ہے، پس وہ کہتا ہے کہ حال نہیں بدلا، حالانکہ اس پر کتنے ہی احوال بدل چکے ہیں۔\n\n### «فصل» [علومِ الٰہیہ کے انتقالات کا نظریہ]\n\nاور جہاں تک علومِ الٰہیہ (Ulūm-e-Ilāhīyah) کے انتقالات کا تعلق ہے، تو یہ وہی استرسال (Istirsāl) ہے جس کی طرف ابو المعالی امام الحرمین گئے ہیں، اور وہ تعلقات (Ta'alluqāt) ہیں جن کی طرف محمد بن عمر بن الخطیب الرازی گئے ہیں۔ لیکن ہمارے طریق (Tarīq) کے راسخ القدم (Rāsikh al-Qadam) اہلِ تصوف یہاں انتقالات (Intiqālāt) کے قائل نہیں ہیں۔ کیونکہ اشیاء الحق (Al-Ḥaqq) کے نزدیک مشہود (Mashhūd) اور معلوم ہیں، ان کے اعیان (A'yān) اور احوال ان صورتوں پر ہیں جن پر وہ ہوں گے، اور جب ان کے اعیان موجود ہوں گے تو وہ لامتناہی (Lā Yatanāhī) تک ہوں گے۔ پس ابن الخطیب کے مذہب کے مطابق کوئی نیا تعلق پیدا نہیں ہوتا، اور نہ ہی امام الحرمین کے مذہب کے مطابق استرسال ہوتا ہے، اللہ ان سب سے راضی ہو۔ اور صحیح عقلی دلیل اسی بات کی تائید کرتی ہے جس کی طرف ہم گئے ہیں۔ اور یہ وہ بات ہے جسے اہلِ اللہ نے ذکر کیا ہے اور ہم نے ان سے اتفاق کیا ہے، اور یہ وہ کشف (Kashf) ہے جو عقل کے دائرے سے ماوراء مقام سے حاصل ہوتا ہے۔ پس سب نے سچ کہا، اور ہر قوت نے اپنی حیثیت کے مطابق عطا کیا۔ پس جب اللہ اعیان (A'yān) کو وجود (Wujūd) بخشتا ہے، تو وہ انہیں ان کے لیے وجود بخشتا ہے، نہ کہ اپنے لیے۔ اور وہ اپنے مقامات اور زمانوں میں اپنی حالتوں پر ہیں، ان کے مقامات اور زمانوں کے اختلاف کے ساتھ۔ پس ان کے لیے ان کے اعیان اور احوال کو یکے بعد دیگرے لامتناہی تسلسل اور تواتر کے ساتھ منکشف کیا جاتا ہے۔ پس اللہ کے اعتبار سے امر (Amr) ایک ہی ہے، جیسا کہ اللہ تعالیٰ نے فرمایا:\nوَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ كَلَمْحٍ بِالْبَصَرِ (اور ہمارا حکم تو بس ایک ہی ہوتا ہے، جیسے آنکھ کا جھپکنا) [القمر: 50]۔\nاور کثرت (Kathrat) خود معدودات (Ma'dūdāt) میں ہے۔ اور یہ امر ہمیں ایک وقت میں حاصل ہوا، پس اس میں ہم پر کوئی خلل واقع نہیں ہوا، اور کثرت میں امر ہمارے نزدیک ایک ہی تھا، نہ وہ غائب ہوا اور نہ زائل ہوا۔ اور جس نے بھی اس کا ذائقہ چکھا، اس نے اسی طرح اس کا شہود (Shuhūd) کیا۔ پس وہ مثال میں ایک ایسے شخص کی طرح ہیں جس کے مختلف احوال ہیں، اور ہر حال میں اس کی ایک صورت بنائی گئی ہے جس پر وہ ہو گا۔ اسی طرح ہر شخص ہے۔ اور آپ کے اور ان صورتوں کے درمیان ایک حجاب (Ḥijāb) ڈال دیا گیا، پھر آپ کے لیے اسے منکشف کیا گیا، اور آپ ان لوگوں میں سے ہیں جن کی اس میں ایک صورت ہے۔ پس آپ نے حجاب اٹھائے جانے پر ایک ہی نظر میں وہ سب کچھ ادراک کر لیا جو اس میں تھا۔ پس الحق سبحانہ (Al-Ḥaqq Subḥānahu) نے اس طبق (Tabq) میں انہیں ان کی صورتوں سے نہیں بدلا، بلکہ ان کے لیے انہیں منکشف کیا اور انہیں ان کے لیے وجود (Wujūd) کی حالت پہنا دی۔ پس انہوں نے اپنے آپ کو ہمیشہ اسی حال پر دیکھا جس پر وہ ہوں گے۔ اور الحق (Al-Ḥaqq) کی نظر کے حق میں کوئی ماضی کا زمانہ ہے اور نہ مستقبل کا، بلکہ تمام امور اس کے لیے ان کے مراتب میں ان کی صورتوں کی تعداد کے ساتھ معلوم ہیں۔ اور اس کے مراتب (Marātib) تناہیت (Tanāhī) سے موصوف نہیں کیے جا سکتے، نہ وہ محدود ہیں اور نہ ان کی کوئی حد ہے جہاں وہ رکیں۔ پس اسی طرح الحق تعالیٰ (Al-Ḥaqq Ta'ālā) کا عالم اور تمام ممکنات (Mumkināt) کا ادراک ان کی عدم (Adam) اور وجود (Wujūd) کی حالت میں ہے۔ پس ان پر احوال کا تنوع ان کے خیال (Khayāl) میں ہوا ہے، نہ کہ ان کے علم (Ilm) میں۔ پس انہوں نے اس کے کشف (Kashf) سے ایسا علم حاصل کیا جو ان کے پاس نہیں تھا، نہ کہ ایسی حالت جو ان پر نہیں تھی۔ پس اس کی تحقیق کرو، کیونکہ یہ ایک پوشیدہ اور گہرا مسئلہ ہے جو سرِ قدر (Sirr al-Qadar) سے متعلق ہے، اور ہمارے اصحاب میں سے بہت کم لوگ اس پر مطلع ہوتے ہیں۔ اور جہاں تک اللہ تعالیٰ کے ساتھ ہمارے علم کے تعلق کا تعلق ہے، تو وہ دو قسموں پر ہے: ایک معرفت (Ma'rifat) ذاتِ الٰہیہ (Dhāt-e-Ilāhīyah) کی ہے، اور یہ شہود (Shuhūd) اور رؤیت (Rū'yat) پر موقوف ہے، لیکن یہ رؤیت بغیر احاطہ (Iḥāṭah) کے ہوتی ہے۔ اور دوسری معرفت اس کے الٰہ ہونے کی ہے، اور یہ دو چیزوں یا ان میں سے ایک پر موقوف ہے، اور وہ وہب (Wahb) (عطا) ہے، اور دوسرا امر نظر اور استدلال (Istidlāl) ہے۔ اور یہ وہ معرفت (Ma'rifat) ہے جو کسب کی جاتی ہے۔ اور جہاں تک اس کے مختار ہونے کے علم کا تعلق ہے، تو اختیار (Ikhtiyār) کے مقابلے میں احدیتِ مشیئت (Aḥadiyyat al-Mashī'ah) آتی ہے۔ پس جب الحق (Al-Ḥaqq) کو اس سے موصوف کیا جاتا ہے تو اس کی نسبت اس حیثیت سے ہوتی ہے جو ممکن (Mumkin) پر ہے، نہ کہ اس حیثیت سے جو الحق پر ہے۔ اللہ تعالیٰ نے فرمایا:\nوَلَكِنْ حَقَّ الْقَوْلُ مِنِّي (لیکن میری طرف سے بات ثابت ہو چکی ہے) [السجدہ: 13]۔\nاور اللہ تعالیٰ نے فرمایا:\nأَ فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ (تو کیا وہ شخص جس پر عذاب کا فیصلہ ثابت ہو چکا ہے) [الزمر: 19]۔\nاور فرمایا:\nمَا يُبَدَّلُ الْقَوْلُ لَدَيَّ (میرے ہاں بات بدلی نہیں جاتی) [ق: 29]۔\nاور کیا خوب ہے جس سے اس آیت کو مکمل کیا گیا:\nوَمَا أَنَا بِظَلَّامٍ لِلْعَبِيدِ (اور میں بندوں پر ظلم کرنے والا نہیں ہوں) [ق: 29]۔\nاور یہاں سرِ قدر (Sirr al-Qadar) پر تنبیہ کی گئی ہے، اور اسی سے اللہ کی اپنے مخلوق پر حجتِ بالغہ (Ḥujjat al-Bālighah) قائم ہوئی۔ اور یہی وہ بات ہے جو جنابِ حق (Janāb al-Ḥaqq) کے لائق ہے، اور جو کون (Kawn) کی طرف لوٹتی ہے، وہ یہ ہے:\nوَلَوْ شِئْنَا لَآتَيْنَا كُلَّ نَفْسٍ هُدَاهَا (اور اگر ہم چاہتے تو ہر جان کو اس کی ہدایت دے دیتے) [السجدہ: 13]۔\nپس ہم نے نہیں چاہا، لیکن یہ استدراک (Istidrāk) توصیل (Tawṣīl) کے لیے ہے، کیونکہ ممکن (Mumkin) اپنی حقیقت (Ḥaqīqat) کے لحاظ سے ہدایت اور گمراہی دونوں کو قبول کرنے والا ہے۔ پس وہ تقسیم کی جگہ ہے اور اسی پر تقسیم وارد ہوتی ہے۔ اور نفسِ امر (Nafs al-Amr) میں اللہ کے لیے اس میں ایک ہی امر ہے، اور وہ ممکن کے حال کی جہت سے اللہ کے نزدیک معلوم ہے۔\n\n### «مسألة» [معقولِ اختراع]\n\nمعقولِ اختراع (Ma'qūl al-Ikhtirā') کا ظاہر یہ ہے کہ شاہد (Shāhid) میں مثال کا نہ ہونا۔ یہ کیسے صحیح ہو سکتا ہے کہ کسی ایسے امر میں اختراع (Ikhtirā') ہو جو اللہ تعالیٰ کے لیے ہمیشہ سے مشہود (Mashhūd) اور معلوم رہا ہو، جیسا کہ ہم نے کتاب \"المعرفۃ باللہ\" میں اللہ کے اشیاء کے علم کے بارے میں مقرر کیا ہے؟\n\n### «مسألة» [اسماءِ الٰہیہ کے بارے میں]\n\nالاسماء الٰہیہ (Al-Asmā' al-Ilāhīyah) نسب (Nisab) اور اضافات (Iḍāfāt) ہیں جو ایک ہی عین (Ain) کی طرف لوٹتے ہیں، کیونکہ وہاں اعیان (A'yān) کے وجود سے کثرت (Kathrat) صحیح نہیں ہو سکتی، جیسا کہ بعض نظریہ سازوں نے گمان کیا جنہیں اللہ کا علم نہیں ہے۔ اور اگر صفات (Ṣifāt) زائد اعیان ہوتیں اور وہ ان کے بغیر الٰہ نہ ہوتا، تو الوہیت (Ulūhiyyat) ان کی معلول (Ma'lūl) ہوتی۔ پس یا تو وہ عینِ الٰہ ہوں گی—تو شے اپنی علت (Illat) نہیں ہو سکتی—یا وہ نہیں ہوں گی—تو اللہ ایسی علت کا معلول نہیں ہو سکتا جو اس کا عین نہ ہو، کیونکہ علت مرتبے میں معلول سے مقدم ہوتی ہے۔ پس اس سے یہ لازم آئے گا کہ الٰہ ان زائد اعیان کا معلول ہونے کی وجہ سے محتاج ہو جائے، جو اس کی علت ہیں، اور یہ محال (Muhāl) ہے۔ پھر یہ کہ معلول شے کی دو علتیں نہیں ہو سکتیں، اور یہ (صفات) تو بہت زیادہ ہیں، اور وہ ان کے بغیر الٰہ نہیں ہو سکتا۔ پس یہ باطل ہوا کہ اسماء (Asmā') اور صفات (Ṣifāt) اس کی ذات (Dhāt) پر زائد اعیان ہوں۔ اللہ ظالموں کے قول سے بہت بلند ہے۔\n\n### «مسألة» [آئینے میں صورت ایک جسدِ برزخی ہے]\n\nآئینے میں موجود صورت ایک جسدِ برزخی (Jasad-e-Barzakhī) ہے، اس صورت کی طرح جسے سونے والا دیکھتا ہے جب وہ خارجی صورت کے موافق ہو۔ اور اسی طرح میت اور مکاشف (Mukāshif) کی صورت ہوتی ہے۔ اور آئینے کی صورت برزخ (Barzakh) کی سب سے سچی عطا ہے، بشرطیکہ آئینہ ایک خاص شکل اور خاص مقدارِ جرم (Jurm) کا ہو۔ اگر وہ ایسا نہ ہو تو وہ ہر اس چیز میں سچائی نہیں دکھائے گا جو وہ عطا کرتا ہے، بلکہ بعض میں سچائی دکھائے گا۔ اور جان لیجیے کہ آئینوں کی شکلیں مختلف ہوتی ہیں، پس صورتیں بھی مختلف ہوتی ہیں۔ اگر رؤیت (Rū'yat) مرئیات (Mar'iyyāt) کی طرف انعکاس (In'ikās) کے ذریعے ہوتی، جیسا کہ بعض لوگ سمجھتے ہیں، تو دیکھنے والا انہیں اسی طرح ادراک کرتا جس طرح وہ اپنے جرم کے بڑے یا چھوٹے ہونے میں ہیں۔ جبکہ ہم چھوٹے چمکدار جسم میں اس صورت کو دیکھتے ہیں جو بذاتِ خود بڑی ہوتی ہے، لیکن وہ چھوٹی نظر آتی ہے۔ اور اسی طرح بڑا چمکدار جسم دیکھنے والے کی آنکھ میں صورت کو بڑا کر دیتا ہے اور اسے اس کی حد سے باہر نکال دیتا ہے۔ اور اسی طرح چوڑا، لمبا اور لہر دار (آئینہ) بھی کرتا ہے۔ پس معلوم ہوا کہ انعکاسات (In'ikāsāt) یہ چیزیں عطا نہیں کرتے۔ لہٰذا ہم صرف یہی کہہ سکتے ہیں کہ چمکدار جسم ان امور میں سے ایک ہے جو برزخ (Barzakh) کی صورتیں عطا کرتا ہے۔ اور اسی وجہ سے اس میں رؤیت کا تعلق صرف محسوسات (Maḥsūsāt) سے ہوتا ہے، کیونکہ خیال (Khayāl) صرف اسی چیز کو پکڑتا ہے جس کی محسوس صورت ہو، یا جو محسوس اجزاء سے مرکب ہو جنہیں قوتِ مصورہ (Qūwwat-e-Muṣawwirah) ترکیب دیتی ہے، پس وہ ایسی صورت عطا کرتی ہے جس کا حس (Ḥiss) میں اصلاً وجود نہیں تھا، لیکن جن اجزاء سے وہ مرکب ہوئی ہے وہ اس دیکھنے والے کے لیے بلاشبہ محسوس ہوتے ہیں۔\n\n### «مسألة» [انسان کامل کے بارے میں]\n\nتمام موجودات میں جو سب سے کامل نشأۃ (Nash'ah) ظاہر ہوئی ہے، وہ سب کے نزدیک انسان ہے، کیونکہ الإنسان الکامل (Insān al-Kāmil) صورت (Ṣūrah) پر پایا گیا ہے نہ کہ انسانِ حیوانی۔ اور صورت (Ṣūrah) میں کمال (Kamāl) ہے، لیکن اس سے یہ لازم نہیں آتا کہ وہ اللہ کے نزدیک افضل (Afḍal) ہو۔ پس وہ مجموعی طور پر اکمل (Akmal) ہے۔ اگر وہ کہیں کہ اللہ فرماتا ہے:\nلَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ (بیشک آسمانوں اور زمین کی تخلیق لوگوں کی تخلیق سے بڑی ہے، لیکن اکثر لوگ نہیں جانتے) [غافر: 57]۔\nاور یہ معلوم ہے کہ وہ جرم (Jurm) میں بڑا ہونا مراد نہیں لیتا بلکہ معنی میں بڑا ہونا مراد لیتا ہے۔ ہم کہیں گے: آپ نے سچ کہا، لیکن کس نے کہا کہ وہ روحانیت (Rūḥāniyyat) میں اس سے بڑے ہیں؟ بلکہ آسمانوں اور زمین کا معنی، اس حیثیت سے کہ ان میں سے ہر ایک اپنے اجرام (Ajrām) کے خاص نظم (Naẓm) سے منفرد معنی کے ذریعے جس پر دلالت کرتا ہے، انسان کے جسم سے معنی میں بڑا ہے، نہ کہ پورے انسان سے۔ اور اسی وجہ سے آسمانوں اور زمین کی حرکتوں سے مولدات (Mawallidāt) اور تکوینیات (Takwīnāt) کے اعیان (A'yān) صادر ہوتے ہیں، جبکہ انسان اپنے جرم کے لحاظ سے مولدات میں سے ہے، اور انسان سے یہ صادر نہیں ہوتا، اور عناصر کی طبیعت بھی اسی میں شامل ہے۔ اسی لیے وہ انسان کی تخلیق سے بڑے تھے، کیونکہ وہ اس کے لیے والدین کی طرح ہیں، اور وہ اس امر میں سے ہے جو آسمان اور زمین کے درمیان نازل ہوتا ہے۔ اور ہم تو صرف الإنسان الکامل (Insān al-Kāmil) کو دیکھتے ہیں، پس ہم کہتے ہیں کہ وہ اکمل (Akmal) ہے۔ اور جہاں تک اللہ کے نزدیک افضل ہونے کا تعلق ہے، تو یہ صرف اللہ تعالیٰ کے لیے ہے، کیونکہ مخلوق (Makhlūq) خالق (Khāliq) کے نفس میں موجود چیز کو نہیں جانتی مگر اس کے بتانے سے۔\n\n### «مسألة» [صفاتِ نفسیہ کے بارے میں]\n\nالحق (Al-Ḥaqq) کے لیے ایک کے سوا کوئی صفۃ نفسیۃ ثبوتیۃ (Ṣifah Nafsīyah Thubūtīyah) نہیں ہے، اور یہ جائز نہیں کہ اس کے لیے دو یا اس سے زیادہ ہوں، کیونکہ اگر ایسا ہوتا تو اس کی ذات (Dhāt) ان دونوں یا ان سب سے مرکب (Murakkab) ہوتی، اور اس کے حق میں ترکیب (Tarkīb) محال (Muhāl) ہے۔ پس ایک سے زائد ثبوتی صفت (Ṣifah Thubūtīyah) کا اثبات محال ہے۔\n\n### «مسألة» [صفات کی نفی اور عذاب کی سرمدیت کی نفی]\n\nچونکہ صفات (Ṣifāt) نسب (Nisab) اور اضافات (Iḍāfāt) ہیں، اور نسب عدمی امور ہیں، اور وہاں ہر لحاظ سے ایک ہی ذات (Dhāt) ہے، اس لیے یہ جائز ہے کہ بندے آخر کار مرحوم (Marḥūm) ہوں، اور ان پر عدمِ رحمت (Adam-e-Raḥmat) کو لامتناہی (Lā Yatanāhī) تک دائمی نہ کیا جائے، کیونکہ اس پر کوئی جبر کرنے والا نہیں ہے۔ اور اسماء (Asmā') اور صفات (Ṣifāt) ایسے اعیان (A'yān) نہیں ہیں جو اشیاء میں اس پر کوئی حکم واجب کریں۔ پس سب کے لیے رحمت (Raḥmat) کے شمول میں کوئی رکاوٹ نہیں ہے، خاص طور پر جب یہ وارد ہوا ہے کہ رحمت غضب پر سبقت لے گئی ہے۔ پس جب غضب رحمت تک پہنچ جائے گا تو حکم رحمت کا ہو گا، اور امر اسی طرح ہو گا جیسا کہ ہم نے کہا۔ اسی لیے اللہ تعالیٰ نے فرمایا:\nوَلَوْ شَاءَ رَبُّكَ لَهَدَى النَّاسَ جَمِيعًا (اور اگر آپ کا رب چاہتا تو تمام لوگوں کو ہدایت دے دیتا) [یونس: 99]۔\nپس اس مشیئت (Mashī'ah) کا حکم دنیا میں تکلیف (Taklīf) کے ذریعے تھا، اور آخرت میں حکم اس کے فرمان:\nيَفْعَلُ مَا يُرِيدُ (وہ جو چاہتا ہے کرتا ہے) [ہود: 107]،\nکے لیے ہے۔ پس کون یہ دلیل دے سکتا ہے کہ اس نے صرف اہلِ نار (Ahl-e-Nār) پر عذاب کی سرمدیت (Sarmadiyyat) کا ارادہ کیا ہے، یا عالم میں کسی ایک پر بھی، تاکہ اسم المعذب (Al-Mu'adhdhib)، المبلی (Al-Mublī)، اور المنتقم (Al-Muntaqim) اور ان جیسے اسماء کا حکم صحیح ہو؟ اور اسم المبلی (Al-Mublī) اور اس جیسے اسماء نسب (Nisab) اور اضافہ (Iḍāfah) ہیں، نہ کہ موجود عین (Ain)۔ اور موجود ذات (Dhāt) کیسے اس چیز کے حکم کے تحت ہو سکتی ہے جو موجود نہیں ہے؟ پس اس کے فرمان \"اگر وہ چاہتا\" اور \"اگر ہم چاہتے\" میں جو کچھ بھی ذکر کیا گیا ہے، وہ اسی اصل (Aṣl) کی خاطر ہے، پس اس کے لیے اطلاق (Iṭlāq) ہے۔ اور کوئی ایسی نص (Naṣṣ) نہیں ہے جس کی طرف رجوع کیا جائے اور اس میں عذاب کی سرمدیت (Sarmadiyyat) کا احتمال نہ ہو، جیسا کہ ہمارے پاس نعیم (Na'īm) کی سرمدیت میں ہے۔ پس صرف جواز (Jawāz) باقی رہا، اور یہ کہ وہ دنیا اور آخرت کا رحمن (Raḥmān) ہے۔ پس جب آپ اس بات کو سمجھ لیں گے جس کی طرف ہم نے اشارہ کیا ہے، تو آپ کی شاخیں کم ہو جائیں گی، بلکہ مکمل طور پر زائل ہو جائیں گی۔\n\n### «مسألة» [اللہ پر جواز کا اطلاق]\n\nاللہ تعالیٰ پر جواز (Jawāz) کا اطلاق کرنا اللہ کے ساتھ سوءِ ادب (Sū' al-Adab) ہے۔ اور مقصود ممکن (Mumkin) پر جواز کا اطلاق کرنے سے حاصل ہو جاتا ہے، اور یہی زیادہ لائق ہے، کیونکہ نہ تو شرع (Shar') نے اس کا ارادہ کیا ہے اور نہ عقل نے اس پر دلالت کی ہے۔ پس سمجھ لو۔ اور یہ مقدار کافی ہے، کیونکہ علمِ الٰہی (Ilm-e-Ilāhī) اس سے کہیں زیادہ وسیع ہے کہ اس کا احاطہ کیا جا سکے۔\nوَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے) [الاحزاب: 4]۔",
    "fa": "باب هفدهم: در معرفت انتقال علوم کونی و پاره‌ای از علوم الهیِ مددبخشِ اصلی.\n\nعلوم کائنات پیوسته در حال انتقال‌اند،\nاما علم وجه (وجه) [الهی] زوال نمی‌پذیرد.\n\nپس ما همه آن‌ها را اثبات و نفی می‌کنیم،\nو راه دشوارشان را حال به حال می‌پیماییم.\n\nای معبود من، چگونه غیر شما می‌تواند شما را بشناسد؟\nو کیست مانند تو که مبارک و متعالی است؟\n\nای معبود من، چگونه غیر شما می‌تواند شما را بشناسد؟\nو آیا غیر، می‌تواند برای شما مثالی باشد؟\n\nو هر که راه را بدون راهنما طلب کند،\nای معبود من، به راستی محال را طلب کرده است.\n\nای معبود من، چگونه دل‌هایی شما را دوست دارند،\nکه امید الفت و وصال (وصال) ندارند؟\n\nای معبود من، چگونه غیر شما می‌تواند شما را بشناسد؟\nو آیا چیزی جز شما هست؟ نه، هرگز نه.\n\nای معبود من، چگونه چشم‌ها شما را می‌بینند،\nدر حالی که نه نورهای درخشان هستی و نه تاریکی‌ها.\n\nای معبود من، من خود را جز شما نمی‌بینم،\nو چگونه محال یا گمراهی را ببینم؟\n\nای معبود من، تو، تو هستی، و منِ من،\nاز «منیت» (أنایت) تو بخشش می‌طلبد.\n\nبه خاطر فقری که از هستی (وجود) من در من برخاسته،\nو از بی‌نیازی تو متولد شده و حالی گشته است.\n\nو مرا آشکار ساخت تا مرا به سوی او ظاهر کند،\nو جز او مرا ندید، پس من «آل» (آل) [نشان] بودم.\n\nو هر که قصد سراب کند و آب بخواهد،\nچشمه حیات را در آن زلال می‌بیند.\n\nمن آن کائناتم که هیچ چیز مانند من نیست،\nو کیست که قبل از مثال، من مانند او باشم؟\n\nو این از شگفت‌انگیزترین چیزهاست، پس بنگر،\nشاید ببینی که مماثل آن محال است.\n\nپس در کائنات جز هستی (وجود) یگانه نیست،\nکه منزه است از اینکه با او مقابله شود یا به او دست یابند.\n\n### [عالم در تغییر مستمر نتیجه توجهات الهی پیوسته]\n\nبدان، خداوند تو را تأیید کند، که هر آنچه در عالم است از حالی به حال دیگر منتقل می‌شود. پس عالم زمان در هر زمان منتقل می‌شود، و عالم انفاس در هر نفس، و عالم تجلی (التجلی) در هر تجلی (التجلی). و علت این امر، سخن خداوند متعال است: **«هر روز او در کاری است»** (كُلَّ يَوْمٍ هُوَ في شَأْنٍ). و این را با سخن دیگرش تأیید کرده است: **«به زودی به حساب شما می‌پردازیم، ای جن و انس»** (سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ). و هر انسانی تنوع خواطر را در قلب خود، در حرکات و سکناتش می‌یابد. پس هیچ دگرگونی در عالم بالا و پایین رخ نمی‌دهد، مگر از توجه الهی با تجلی (التجلی) خاص برای آن عین (ذات). پس استناد آن [عین] از آن تجلی (التجلی) بر حسب چیزی است که حقیقتش اقتضا می‌کند.\n\nو بدان که معارف کونی (جهانی) برخی از آن‌ها علومی هستند که از کائنات گرفته شده‌اند و معلوماتشان نیز کائنات هستند. و علومی که از کائنات گرفته می‌شوند و معلوماتشان نسبت‌ها هستند، و نسبت‌ها کائنات نیستند. و علومی که از کائنات گرفته می‌شوند و معلومشان ذات حق (الحق) است، و علومی که از حق (الحق) گرفته می‌شوند و معلومشان کائنات هستند. و علومی که از نسبت‌ها گرفته می‌شوند و معلومشان کائنات هستند. همه این‌ها علوم کونی نامیده می‌شوند و با انتقال معلوماتشان در احوالشان منتقل می‌شوند.\n\nو صورت انتقال آن‌ها نیز این است که انسان در ابتدا معرفت کونی از کائنات را می‌طلبد، یا کونی از کائنات را دلیلی بر مطلوب خود قرار می‌دهد. پس هنگامی که آن مطلوب برایش حاصل شد، وجه حق (الحق) در آن برایش آشکار می‌شود، در حالی که آن وجه مطلوب او نبوده است. پس این طالب به آن وجه تعلق می‌یابد و قصد اول خود را رها می‌کند. و علم منتقل می‌شود و آنچه را که آن وجه عطا می‌کند، می‌طلبد. پس برخی از آن‌ها این را می‌دانند و برخی حالشان این است، اما نمی‌دانند از چه چیزی منتقل شده‌اند و به چه چیزی منتقل شده‌اند. تا جایی که برخی از اهل طریقت دچار لغزش شدند و گفتند: «اگر مردی را دیدید که چهل روز بر یک حال ثابت ماند، بدانید که او ریاکار است.» شگفتا! آیا حقایق (حقائق) اجازه می‌دهند که کسی دو نفس یا دو زمان بر یک حال باقی بماند، در حالی که الوهیت در حق او از فعل بازمانده باشد؟ این چیزی است که قابل تصور نیست، مگر اینکه این عارف ندانسته است که منظور از انتقال چیست، زیرا انتقال در امثال بوده است. پس او با هر نفس از چیزی به مثل آن منتقل می‌شد، و صورت بر او مشتبه شد، زیرا حال اول شخص در نظر او تغییر نکرده بود، چنانکه گفته می‌شود: «فلانی امروز پیوسته راه می‌رفت و ننشست.» و شکی نیست که راه رفتن حرکات بسیاری است و هر حرکتی عین دیگری نیست، بلکه مثل آن است. و علم تو با انتقال آن‌ها منتقل می‌شود، پس می‌گوید حال بر او تغییر نکرده است، در حالی که چه بسیار احوال بر او تغییر کرده است.\n\n### «فصل» [نظریه انتقالات علوم الهی]\n\nاما انتقالات علوم الهی، همان «استرسال» (الاسترسال) است که ابوالمعالی، امام الحرمین، به آن معتقد بود، و «تعلقات» (التعلقات) است که محمد بن عمر بن الخطیب رازی به آن قائل بود. اما اهل قدم راسخ از اهل طریقت ما، در اینجا قائل به انتقالات نیستند. زیرا اشیاء نزد حق (الحق) مشهود و معلوم هستند، اعیان و احوالشان بر همان صورتی است که خواهند بود، و از جمله هنگامی که اعیانشان تا بی‌نهایت موجود شوند. پس نه تعلقی بر مذهب ابن الخطیب حادث می‌شود و نه استرسالی بر مذهب امام الحرمین، خداوند از همه آن‌ها راضی باشد. و دلیل عقلی صحیح، آنچه را که ما به آن معتقدیم، تأیید می‌کند. و این مطلبی که اهل الله ذکر کرده‌اند و ما با آن‌ها موافقیم، کشف (الکشف) از مقامی که ورای طور عقل است، آن را عطا می‌کند. پس همه راست گفته‌اند. و هر قوه‌ای به اندازه خود عطا کرده است.\n\nپس هنگامی که خداوند اعیان را ایجاد کرد، آن‌ها را برای خودشان ایجاد کرد نه برای خودش. و آن‌ها بر حالات خود در مکان‌ها و زمان‌هایشان، با وجود اختلاف مکان‌ها و زمان‌هایشان، هستند. پس برای آن‌ها از اعیان و احوالشان، چیزی پس از چیزی، تا بی‌نهایت، به صورت پی در پی و متوالی کشف (الکشف) می‌شود. پس امر نسبت به خداوند واحد است، چنانکه فرمود: **«و فرمان ما جز یک امر نیست، مانند چشم بر هم زدنی»** (وما أَمْرُنا إِلَّا واحِدَةٌ كَلَمْحٍ بِالْبَصَرِ). و کثرت در خود معدودات است. و این امر در زمانی برای ما حاصل شد و در آن بر ما خللی وارد نشد، و امر در کثرت نزد ما واحد بود، نه غایب شد و نه زائل. و هر کس این را چشیده باشد، چنین شهود (الشهود) کرده است.\n\nپس آن‌ها در مثال مانند یک شخص واحد هستند که احوال مختلفی دارد و در هر حالی که بر آن است، صورتی برایش تصویر شده است، و هر شخصی چنین است. و میان تو و این صور حجابی قرار داده شد، پس آن را برای تو کشف (الکشف) کرد، در حالی که تو از جمله کسانی هستی که در آن صورتی دارد. پس هنگام برداشته شدن حجاب، با یک نظر همه آنچه در آن است را درک کردی. پس حق (الحق) سبحانه آن‌ها را از صورشان در آن طبقه منحرف نساخت، بلکه آن‌ها را برایشان کشف (الکشف) کرد و لباس حالت وجود را بر آن‌ها پوشاند. پس [عین] خود را بر آنچه همیشه بر آن خواهد بود، مشاهده کرد. و در حق نظر حق (الحق)، نه زمان گذشته‌ای هست و نه آینده‌ای، بلکه همه امور در مراتبشان با تعدد صورشان در آن مراتب، برای او معلوم است. و مراتب آن‌ها به تناهی وصف نمی‌شود و محصور نیست و حدی ندارد که در آن متوقف شود. پس ادراک حق (الحق) تعالی از عالم و همه ممکنات در حال عدم و وجودشان چنین است. پس احوال بر آن‌ها در خیالشان متنوع شد، نه در علمشان. پس از کشف (الکشف) آن، علمی را کسب کردند که نزدشان نبود، نه حالتی که بر آن نبودند. پس این را دریاب، زیرا مسئله‌ای پنهان و غامض است که به سرّ قدر مربوط می‌شود و اندکی از یاران ما بر آن دست می‌یابند.\n\nاما تعلق علم ما به خداوند متعال بر دو قسم است: معرفت (المعرفة) به ذات الهی، که موقوف بر شهود (الشهود) و رؤیت است، اما رؤیتی بدون احاطه. و معرفت (المعرفة) به اینکه او اله است، که موقوف بر دو امر یا یکی از آن‌هاست: یکی موهبت (الوهب) است، و امر دیگر نظر و استدلال. و این همان معرفت (المعرفة) اکتسابی است.\n\nاما علم به اینکه او مختار است، زیرا اختیار با احدیت مشیت معارضه می‌کند. پس نسبت آن به حق (الحق)، هنگامی که با آن وصف شود، تنها از جهت چیزی است که ممکن بر آن است، نه از جهت چیزی که حق (الحق) بر آن است. خداوند متعال فرمود: **«لیکن سخن من محقق شد»** (ولكِنْ حَقَّ الْقَوْلُ مِنِّي). و فرمود: **«آیا کسی که کلمه عذاب بر او محقق شده است [مانند کسی است که هدایت یافته]؟»** (أَ فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ). و فرمود: **«سخن نزد من دگرگون نمی‌شود»** (ما يُبَدَّلُ الْقَوْلُ لَدَيَّ). و چه نیکو این آیه را به پایان رسانده است: **«و من هرگز بر بندگان ستمکار نیستم»** (وما أَنَا بِظَلَّامٍ لِلْعَبِيدِ). و در اینجا به سرّ قدر تنبیه کرده است، و با آن، حجت بالغه برای خداوند بر خلقش تمام شد. و این همان چیزی است که شایسته جناب حق (الحق) است و به کائنات باز می‌گردد. **«و اگر می‌خواستیم، قطعاً به هر نفسی هدایتش را می‌دادیم»** (ولَوْ شِئْنا لَآتَيْنا كُلَّ نَفْسٍ هُداها). پس نخواستیم، اما این استدراک برای رساندن [مطلب] است، زیرا ممکن از حیث حقیقتش، قابلیت هدایت و ضلالت را دارد. پس او جایگاه تقسیم است و تقسیم بر او وارد می‌شود. و در نفس امر، برای خداوند در آن جز یک امر نیست، و آن از جهت حال ممکن نزد خداوند معلوم است.\n\n### «مسألة» [معقول اختراع]\n\nظاهر معقول اختراع (الاختراع)، نبودن مثال در شاهد است. چگونه اختراع در امری که پیوسته برای خداوند متعال مشهود و معلوم بوده است، صحیح باشد؟ چنانکه در کتاب «المعرفة بالله» در باب علم خداوند به اشیاء مقرر کردیم.\n\n### «مسألة» [در اسماء الهی]\n\nاسماء الهی نسبت‌ها و اضافاتی هستند که به یک عین واحد باز می‌گردند، زیرا در آنجا کثرت به واسطه وجود اعیان در آن صحیح نیست، چنانکه برخی از اهل نظر که علم به خداوند ندارند، گمان کرده‌اند. و اگر صفات، اعیان زائدی بودند و او جز به واسطه آن‌ها اله نبود، در این صورت الوهیت معلول آن‌ها می‌شد. پس یا باید عین اله باشند که در این صورت شیء نمی‌تواند علت خودش باشد، یا عین او نباشند که در این صورت خداوند معلول علتی که عین او نیست، نخواهد بود. زیرا علت از نظر رتبه بر معلول مقدم است، و از این امر لازم می‌آید که اله به دلیل معلول بودن برای این اعیان زائد که علت او هستند، نیازمند باشد، و این محال است. سپس، شیء معلول نمی‌تواند دو علت داشته باشد، در حالی که این [صفات] بسیارند و او جز به واسطه آن‌ها اله نیست. پس باطل است که اسماء و صفات اعیان زائدی بر ذات او باشند. خداوند از آنچه ستمکاران می‌گویند، بسیار برتر است.\n\n### «مسألة» [صورت در آینه جسد برزخی است]\n\nصورت در آینه، جسد برزخی است، مانند صورتی که شخص خوابیده می‌بیند، اگر با صورت خارجی مطابقت داشته باشد. و همچنین است [صورت] میت و مکاشف (المکاشف). و صورت آینه صادق‌ترین چیزی است که برزخ عطا می‌کند، به شرطی که آینه بر شکل خاص و مقدار جرم خاصی باشد. و اگر چنین نباشد، در همه آنچه عطا می‌کند صادق نیست، بلکه در برخی صادق است. و بدان که اشکال آینه‌ها متفاوت است، پس صور نیز متفاوت می‌شوند. پس اگر دیدن مرئیات به واسطه انعکاس بود، چنانکه برخی گمان می‌کنند، بیننده آن‌ها را بر همان صورتی که هستند، از بزرگی و کوچکی جرمشان، درک می‌کرد. در حالی که ما در جسم صیقلی کوچک، صورت مرئی را که در ذات خود بزرگ است، کوچک می‌بینیم. و همچنین جسم صیقلی بزرگ، صورت را در چشم بیننده بزرگ می‌کند و از حد خود خارج می‌سازد. و همچنین [آینه] عریض و طویل و موج‌دار. پس انعکاسات این را عطا نمی‌کنند. بنابراین نمی‌توانیم بگوییم مگر اینکه جسم صیقلی یکی از اموری است که صور برزخ را عطا می‌کند. و به همین دلیل، رؤیت در آن جز به محسوسات تعلق نمی‌گیرد، زیرا خیال جز آنچه صورت محسوس دارد یا مرکب از اجزای محسوس است که قوه مصوره آن‌ها را ترکیب می‌کند، در خود نگه نمی‌دارد. پس صورتی را عطا می‌کند که اصلاً در حس وجود نداشته است، اما اجزایی که از آن‌ها ترکیب شده، بدون شک برای این بیننده محسوس هستند.\n\n### «مسألة» [در انسان کامل]\n\nکامل‌ترین نشأتی که در موجودات ظاهر شده، نزد همگان انسان است، زیرا انسان کامل (الإنسان الکامل) بر صورت [الهی] یافت شده است، نه انسان حیوانی. و صورت دارای کمال است، اما از این امر لازم نمی‌آید که او نزد خداوند افضل باشد. پس او به واسطه مجموع [اجزاء] کامل‌تر است. اگر بگویند که خداوند می‌فرماید: **«آفرینش آسمان‌ها و زمین بزرگ‌تر از آفرینش مردم است، لیکن بیشتر مردم نمی‌دانند»** (لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ). و معلوم است که منظور [خداوند] بزرگی در جرم نیست، بلکه بزرگی در معناست. ما به او می‌گوییم: راست گفتی، اما چه کسی گفته است که آن‌ها از نظر روحانیت از انسان بزرگ‌ترند؟ بلکه معنای آسمان‌ها و زمین، از آن جهت که هر یک از آن‌ها از طریق معنای منفرد و نظم خاص اجرامشان دلالت می‌کند، در معنا از جسم انسان بزرگ‌تر است، نه از کل انسان. و به همین دلیل، از حرکات آسمان‌ها و زمین، اعیان مولدات و تکوینات صادر می‌شود، در حالی که انسان از حیث جرمش از مولدات است و این [تکوین] از انسان صادر نمی‌شود، و طبیعت عناصر نیز چنین است. به همین دلیل، آن دو [آسمان و زمین] از آفرینش انسان بزرگ‌تر بودند، زیرا آن‌ها برای او مانند پدر و مادر هستند و او از امری است که میان آسمان و زمین نازل می‌شود. و ما تنها به انسان کامل (الإنسان الکامل) می‌نگریم و می‌گوییم او کامل‌تر است. اما افضل بودن نزد خداوند، آن مخصوص خداوند متعال است، زیرا مخلوق آنچه در نفس خالق است را نمی‌داند، مگر به واسطه آگاه ساختن او.\n\n### «مسألة» [در صفات نفسی]\n\nبرای حق (الحق) صفت نفسی ثبوتی جز یکی نیست. جایز نیست که دو یا بیشتر داشته باشد، زیرا اگر چنین بود، ذات او از آن‌ها مرکب می‌شد و ترکیب در حق او محال است. پس اثبات صفت ثبوتی زائد بر یکی، محال است.\n\n### «مسألة» [نفی صفات و نفی جاودانگی عذاب]\n\nاز آنجا که صفات، نسبت‌ها و اضافات هستند و نسبت‌ها امور عدمی‌اند و از همه جهات جز یک ذات واحد نیست، به همین دلیل جایز است که بندگان در آخر کار مورد رحمت قرار گیرند. و عدم رحمت تا بی‌نهایت بر آن‌ها جاودانه نشود، زیرا هیچ اکراه‌کننده‌ای بر او در این باره نیست. و اسماء و صفات اعیانی نیستند که حکمی را بر او در اشیاء واجب سازند. پس مانعی برای شمول رحمت بر همگان نیست، به ویژه که وارد شده است رحمت بر غضب سبقت گرفته است. پس هنگامی که غضب به رحمت منتهی شود، حکم از آنِ رحمت خواهد بود. پس امر بر همان است که گفتیم. به همین دلیل خداوند متعال فرمود: **«و اگر پروردگار تو می‌خواست»** (ولو شاء ربك) **«اگر خدا می‌خواست»** (أَنْ لَوْ يَشاءُ الله) **«قطعاً همه مردم را هدایت می‌کرد»** (لَهَدَى النَّاسَ جَمِيعاً). پس حکم این مشیت در دنیا به واسطه تکلیف بود، اما در آخرت، حکم از آنِ سخن اوست: **«آنچه را می‌خواهد انجام می‌دهد»** (يَفْعَلُ ما يُرِيدُ). پس چه کسی می‌تواند دلالت کند که او جز جاودانگی عذاب بر اهل آتش، یا بر یک نفر در تمام عالم، اراده نکرده است، تا حکم اسم‌های «معذِّب»، «مُبلی» (آزمایش‌کننده) و «منتقم» و امثال آن‌ها صحیح باشد؟ و اسم «مُبلی» و امثال آن، نسبت و اضافه است، نه عین موجود. و چگونه ذات موجود می‌تواند تحت حکم چیزی باشد که موجود نیست؟ پس هر آنچه از سخن او که «اگر می‌خواست» و «اگر می‌خواستیم» ذکر شده، به خاطر همین اصل است. پس او اطلاق دارد. و هیچ نصّی وجود ندارد که بتوان به آن بازگشت و احتمال جاودانگی عذاب در آن راه نیابد، چنانکه در جاودانگی نعمت برای ما وجود دارد. پس جز جواز باقی نمی‌ماند، و اینکه او رحمان دنیا و آخرت است. اگر آنچه را که به آن اشاره کردیم فهمیدی، پراکندگی [فکر] تو کم می‌شود، بلکه به کلی زائل می‌گردد.\n\n### «مسألة» [اطلاق جواز بر خدا]\n\nاطلاق جواز بر خداوند متعال، سوء ادب با خداوند است. و مقصود با اطلاق جواز بر ممکن حاصل می‌شود، و این شایسته‌تر است، زیرا نه شرعی به آن وارد شده و نه عقلی بر آن دلالت کرده است. پس بفهم. و این مقدار کافی است، زیرا علم الهی گسترده‌تر از آن است که به طور کامل بررسی شود. **«و خداوند حق (الحق) را می‌گوید و او راه را می‌نمایاند»** (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 4
}