{
  "id": 363,
  "title": {
    "ar": "الباب الثالث والستون وثلاثمائة في معرفة منزل إحالة العارف ما لم يعرفه على من هو دونه ليعلمه ما ليس في وسعه أن يعلمه وتنزيهه الباري عن الطرب والفرح",
    "en": "Chapter Three Hundred and Sixty-Three: Concerning the knowledge of the station (منزل) of the Gnostic (العارف) referring what he has not known to those beneath him, so that he may teach them what is not within their capacity to know, and the transcendence (تنزيه) of the Creator (الباري) from ecstasy (الطرب) and joy (الفرح).",
    "ur": "باب تین سو تریسٹھواں: عارف کے اس منزل کی معرفت کے بیان میں جہاں وہ اس چیز کو جو وہ نہیں جانتا، اپنے سے کم درجے والے کی طرف منسوب کر دیتا ہے تاکہ وہ (کم درجے والا) اس چیز کو جان لے جسے جاننا اس کی وسعت میں نہیں ہے، اور باری (الباري) کو طرب اور فرح سے منزہ (تنزيه) کرنے کے بیان میں۔",
    "fa": "باب سیصد و شصت و سوم در معرفت منزل ارجاع عارف آنچه را که نمی‌داند به کسی که پایین‌تر از اوست تا او را به آنچه در توانش نیست آگاه سازد و تنزیه باری (خداوند) از طرب و فرح."
  },
  "content": {
    "ar": "## «الباب الثالث والستون وثلاثمائة في معرفة منزل إحالة العارف ما لم يعرفه على من هو دونه ليعلمه ما ليس في وسعه أن يعلمه وتنزيهه الباري عن الطرب والفرح»\n\n\n> وضع الموازين للحساب *** جاء به ناطق الكتاب‏\n\n\n> كتاب ذات بلا يراع *** ولا مداد ولا اكتساب‏\n\n\n> ولا صفات ولا نعوت *** ولا ذهاب ولا إياب‏\n\n\n> فإن يتب للذي اعتراه *** قابلة قابل المتاب‏\n\n\n> طالبه الشكر في قدور *** وفي جفان مثل الجوابي‏\n\n\n### [التوحيد العقلي اى توحيد الأفعال‏]\n\n\nهذا منزل التوحيد العقلي أعني توحيد الأفعال أي لا فاعل إلا الله وهو منزل شريف فاعلم إن العالم لم يزل في حال عدمه مشاهد الواجب الوجود لأنه لم يزل في عدم مرجح وهو ثابت العين وقد وصفه الحق في حال عدمه بالسمع والطاعة له فلم يستحل عليه إضافة المشاهدة ولهذا لم ينكره أحد من الممكنات في حال وجوده إلا أن هذا الموجود الإنساني وحده من بين العالم أشرك بعضه به ممن غلب عليه حجاب الطبع وهو ما اعتاد أن يسمع ويطيع ويعبد بالأصالة إلا لرب يشهده وقد صير ذلك المعبود حجاب الطبع غيبا له فاتخذ ما اتخذ من الموجودات التي يشهدها ويراها إما من العالم السماوي كالكواكب وإما من العالم الأسفل كالعناصر أو ما تولد عنها ربا يعبده على المشاهدة التي اعتادها وسكنت نفسه بها إليه وتوهم في نظره أن ذلك المتخذ إلها يشهد الحق وأنه أقرب إليه منه فعبد نفسه له خدمة ليقربه إلى الله عز وجل كما أخبر الله عنهم أنهم قالوا ما نَعْبُدُهُمْ يعني الآلهة الذين اتخذوها للعبادة إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏ فأكدوه بزلفى وكان هذا عن نظر واجتهاد ثم رأوا أصحاب الشرائع المنزلة الإلهية قد قيدوا الناس بالسجود ووضع الوجوه على الأرض والركوع والاستقبال على طريق القربة إلى الله في جهة معينة وتقبيل حجر قالوا لنا إنه يمين الله وجاءوا بتعظيم شعائر وأعلام محدثات أضافوها إلى الله وجعلوا تعظيمنا إياها أي لتلك الشعائر والمناسك من تقوى القلوب وقرنوا بذلك التعظيم إذا ظهر منا سعادتنا فزادهم ذلك اعتمادا على ما قرروه ونصبوه من الآلهة والشرائع ولم\n\n\nيفرقوا بين ما هو وضع لله في خلقه وبين ما وضعوه لأنفسهم من أنفسهم وكلامنا إنما هو مع الأئمة أصحاب النظر الأول الذين وضعوا هذه الأمور معبودة لهم على طريق القربة إلى الله عز وجل ثم إنهم مما اغتروا به ما رأوه وسمعوه في الشرائع الإلهية من سعادة المجتهد على الإطلاق سواء أخطأ أو أصاب فالأجر له محقق بعد استيفاء النظر في حقه والاجتهاد في زعمه على قدر ما أعطاه الله‏\nفي نفسه من الاستعداد فتخيلوا فيما ليس ببرهان أنه برهان على ما طلبوه فما اتخذوه إلها إلا عن برهان في زعمهم وهو قوله ومن يَدْعُ مَعَ الله إِلهاً آخَرَ لا بُرْهانَ لَهُ به يعني في زعمه فدل على أنه من قام له برهان في نظره إنه غير مؤاخذ وإن أخطأ فما كان الخطاء له مقصودا وإنما كان قصده إصابة الحق على ما هو عليه الأمر وأصل هذا كله أن لا يعبد غيبا لأنه بالأصالة ما تعوده ولهذا\n\n\nجاء جبريل عليه السلام ليعلم النبي صَلَّى اللهُ عَليهِ وسَلَّم وأصحابه ما هو الأمر عليه في صورة أعرابي فقال النبي صَلَّى اللهُ عَليهِ وسَلَّم أ تدرون من هذا أو قال ردوا على الرجل فالتمس فلم يجدوه فقال النبي صَلَّى اللهُ عَليهِ وسَلَّم لأصحابه لما أدبر هذا جبريل جاء ليعلم الناس دينهم وكان فيما سأله إن قال له ما الإحسان فقال له النبي صَلَّى اللهُ عَليهِ وسَلَّم في الجواب أن تعبد الله كأنك تراه لما علم إن العبادة على الغيب تصعب على النفوس ثم تمم وقال فإن لم تكن تراه فإنه يراك‏\n\n\nأي أحضر في نفسك أنه يراك وهو نوع آخر من الشهود من خلف حجاب تعلم أن معبودك يراك من حيث لا تراه ويسمعك فما أتانا الشرع في هذا كله إلا بما كان فيه لهؤلاء اغترار وإليه استناد ولذلك قال تعالى يُضِلُّ به كَثِيراً ويَهْدِي به كَثِيراً وقال يُضِلُّ من يَشاءُ ويَهْدِي من يَشاءُ وهو الذي يرزق الإصابة في النظر والذي يرزق الخطاء فخرج من مضمون هذا كله إن العبادة لا تتعلق من العابد إلا بمشهود أو كالمشهود لا سبيل إلى الغيب وهذا من رحمة الله الخفية وألطافه وما خرج عمن ذكرناه إلا المقلدة فبهم ألحق الشقاء فجعل لهم الحق في الشرع المنزل مستندا من رحمته فيهم يستندون إليه فيه فقال فَسْئَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لا تَعْلَمُونَ وأهل الذكر هم أهل القرآن فإن الله تعالى يقول إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وهو القرآن وهم أهل الاجتهاد ومنهم المصيب والمخطئ فإذا سأل المقلد من أخطأ من أهل الاجتهاد في نفس الأمر وعمل بما أفتاه فإنه مأجور لأنه مأمور بالسؤال فاستند مقلد والنظار الذين أخطئوا في نظرهم في الأصول مع توفية ما أداهم إليه استعدادهم فيما أفتوهم به من اتخاذهم الآلهة دون الله وإن لم ينظروا فإن الله ما كلف نَفْساً إِلَّا وُسْعَها وهو ما جعل فيها فعمت رحمته الأئمة والمأمومين فما في العالم إلا موحد أي مستند إلى واحد وقد علمت من هذا المساق ما الشرك وما صفة المشرك وقد أعذرهم الله من وجه فقال لهم لا تَقْنَطُوا من رَحْمَةِ الله إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً هذا إذا قصد العبد فعل الذنب معتقدا أنه ذنب فكيف حال من لم يتعمد إتيان الذنب واتخذ ذلك قربة لشبهة قامت له فهو أحق بالمغفرة وأما مؤاخذته أهل الشرك على القطع بقوله إِنَّ الله لا يَغْفِرُ أَنْ يُشْرَكَ به فهو ظاهر لقرينة الحال وأما من طريق اللسان فهو الواقع فإن الله ما ستر الشرك على أهل الشرك بل ظهروا به فهو إخبار بما وقع في الوجود من ظهور الشرك وستر ما دون ذلك لمن يشاء أن يستر فإن ثم أمورا لم تظهر لعين ولا لعقل‏\n\n\nكما جاء في وصف الجنة فيها ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n\n\nولكن قرائن الأحوال تدل على القطع بمؤاخذة المشركين ثم لم يذكر سبحانه ما هو الأمر عليه فيهم بعد المؤاخذة التي هي إقامة الحد عليهم في الآخرة يوم الدين الذي هو الجزاء فيدخلون النار مع بعض آلهتهم ليتحققوا مشاهدة أن تلك الآلهة لا تغني عنهم من الله شيئا لكونهم اتخذوها عن نظرهم لا عن وضع إلهي فانظر يا ولي في عدل الله وفضله فله الحمد على كل حال وهذا حمد نبوي صحيح فإن الثناء على كل حال من مشرك وغير مشرك فإن المشرك كما قلنا ما جعل العظمة والكبرياء إلا لله وجعل الآلهة كالسدنة والحجاب فما عبدوهم إلا من أجله وإن أخطئوا فيهم فما أخطئوا إلا في الأحدية فهم أيضا من الحامدين لله إذ كانوا أهل ثناء على الله بتوحيد عظمته وإيثاره على هؤلاء الحجبة فاجعل بالك لرحمة الله السابغة الواسعة التي بسطها الله على خلقه ترشد للحق إن شاء الله وأما اختلاف العقائد في الله في أصحاب الشرائع الإلهية وغيرهم فإن العالم لو آخذهم الله تعالى بالخطاء لآخذ كل صاحب عقيدة فيه فإنه قد قيد ربه بعقله ونظره وحصره ولا ينبغي لله إلا الإطلاق فإن بِيَدِهِ مَلَكُوتُ كُلِّ شَيْ‏ءٍ فهو يقيد ولا يتقيد ولكن عفا الله عن الجميع فمن أراد إصابة الحق وإن يوفيه حقه وفقه لعلمه بسعته واتساعه وأنه عند اعتقاد كل معتقد مشهود لا يصح أن يكون مفقودا عند اعتقاد المعتقد فإنه ربط اعتقاده به وهُوَ عَلى‏ كُلِّ شَيْ‏ءٍ شَهِيدٌ فصاحب هذا العلم يرى الحق دائما وفي كل صورة فلا ينكره إذا أنكره من قيده ومع هذا فالله قد عفا عمن قيده بتنزيه أو تشبيه من أئمة الدين ثم انظر في شهادة الله عز وجل عند نبيه صَلَّى اللهُ عَليهِ وسَلَّم في حق‏\nالمشركين ولَئِنْ سَأَلْتَهُمْ من خَلَقَهُمْ لَيَقُولُنَّ الله فهو تنبيه عجيب ولما قيل لهم اسْجُدُوا لِلرَّحْمنِ وما رأوا له عينا ولا يعلمونه إلا مسمى الله ولم يعلموا أنه عين مسمى الرحمن فتخيلوا في الرحمن أنه شريك لله فأنكروا ذلك ولم ينكروا ذلك فيمن نصبوه إلها على ما قررناه لأنهم عالمون بأسماء من نصبوهم آلهة من دون الله فعلموا بأسمائهم أنهم ليسوا في الحقيقة في الألوهة مثله فإن له تعالى عندهم توحيد العظمة والكبرياء ودلهم بالسجود للرحمن على عبادة غيب ف قالُوا وما الرَّحْمنُ أَ نَسْجُدُ لِما تَأْمُرُنا وزادَهُمْ نُفُوراً لأنهم ما علموا في الغيب إلا إلها واحدا فقال الله لنبيه صَلَّى اللهُ عَليهِ وسَلَّم ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏ فتعجبوا من ذلك غاية العجب لأنهم تخيلوا أن مسمى الرحمن ليس هو مسمى الله وإن كان لكل واحد الأسماء الحسنى وذلك لما أعمى الله بصائرهم وكثف أغطيتهم فلم يعقلوا عن الله ما أراد بما أنزله في حقهم وجعل الحق ذلك أيضا مستندا لهم حيث جاء إليهم باسم يطلب مسمى لا يعرفون هذه العلامة له حين علم ذلك أهل الله وخاصته‏\n\n\n> فالله والرب والرحمن والملك *** حقائق كلها في الذات تشترك‏\n\n\n> فالعين واحدة والحكم مشترك *** لذا بدا الجسم والأرواح والفلك‏\n\n\n> وكلها أدوات بين خالقنا *** وبيننا ولهذا يضمن الدرك‏\n\n\n> جاءت بها رسل الرحمن قاطبة *** مع الكتاب الذي قد ساقه الملك‏\n\n\n### [إن العلم بالله طريقان‏]\n\n\nواعلم أن العلم بالله له طريقان طريق يستقل العقل بإدراكه قبل ثبوت الشرع وهو يتعلق بأحديته في الوهته وأنه لا شريك له وما يجب أن يكون عليه إلا له الواجب الوجود وليس له تعرض إلى العلم بذاته تعالى ومن تعرض بعقله إلى معرفة ذات الله فقد تعرض لأمر يعجز عنه ويسي‏ء الأدب فيه وعرض نفسه لخطر عظيم وهذا الطريق هو الذي قال فيه الخليل إبراهيم عليه السلام لقومه أُفٍّ لَكُمْ ولِما تَعْبُدُونَ من دُونِ الله أَ فَلا تَعْقِلُونَ فنبههم على إن العلم بالله من كونه إلها واحدا في الوهته من مدركات العقول فما أحالهم إلا على أمر يصح منه أن ينظر فيعلم ينظره ما هو الأمر عليه والطريق الآخر طريق للشرع بعد ثبوته فأتى بما أتى به العقل من جهة دليله وهو إثبات أحدية خالقه وما يجب له عز وجل والمسلك الآخر من العلم بالله العلم بما هو عليه في ذاته فوصفه بعد أن حكم العقل بدليله بعصمته فيما ينقله عن ربه من الخبر عنه سبحانه مع لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وإن لا يضرب له مثل بل هو الذي يضرب الأمثال لأنه يعلم ونحن لا نعلم فنسب إليه تعالى أمورا لا يتمكن للعقل من حيث دليله أن ينسبها إليه ولا يتمكن له ردها على من قام الدليل العقلي عنده على عصمته فأورثه ذلك حيرة بين الطريقين وكلا الطريقين صحيحان لا يقدر على الطعن على أحدهما فمن العقلاء من تأول تأويل تنزيه وتأييد وعضد تأويله ب لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وبقوله وما قَدَرُوا الله حَقَّ قَدْرِهِ ومن العقلاء من سلم علم ذلك إلى من جاء به أو إلى الله ومن العقلاء من أهل اللسان من شبه وعذر الله كل طائفة وما طلب من عباده في حقه إلا أن يعلموا أنه إله واحد لا شريك له في الوهته لا غير وأن لِلَّهِ الْأَسْماءُ الْحُسْنى‏ بما هي عليه من المعاني في اللسان وقرن النجاة والسعادة بمن وقف عند ما جاء من عنده عز وجل في كتبه وعلى ألسنة رسله ع‏\n\n\n> إذا أبان الحق عن نفسه *** بنفسه في كتبه فاعتقد\n\n\n> فما علينا من جناح به *** وذلك العلم به فاعتقد\n\n\n> فإن حظ العقل من علمه *** به الذي ينفي وجود العدد\n\n\n> وإنه في شأنه واحد *** وإنه الله الذي لَمْ يَلِدْ\n\n\n> كذاك لَمْ يُولَدْ ولمن رامه *** بعقله عن فكره لا تزد\n\n\nوبرهان ذلك يا ولي اختلاف المقالات فيه من العقلاء النظار واتفاق المقالات فيه من كل من جاء من عنده من رسول ونبي وولي وكل مخبر عن الله ولو وقف العاقل من المؤمنين على معنى قوله في كتابه ولَمْ يُولَدْ وعلم إن ما أنتجه العقل من فكره بتركيب مقدمتيه أن تلك النتيجة للعقل عليها ولادة وإنها مولودة عنه وهو قد نفى أن يولد فأين الايمان وليس المولود إلا عينه بخلاف ما إذا أنتج العقل نسبة الأحدية له فما معقولية الأحدية للواحد عين من نسبت إليه‏\nالأحدية فللعقل على الأحدية ولادة وعلى الاستناد إليه ولادة وعلى كل لا يكون له على عينه ولادة فأما هويته وحقيقته فما لعقل عليها ولادة وقد نفى ذلك بقوله ولَمْ يُولَدْ ومن هنا تعرف أن كل عاقل له في ذات الله مقالة إنما عبد ما ولده عقله فإن كان مؤمنا كان طعنا في إيمانه وإن لم يكن مؤمنا فيكفيه إنه ليس بمؤمن ولا سيما بعد بعثة محمد صَلَّى اللهُ عَليهِ وسَلَّم العامة وبلوغها إلى جميع الآفاق وإن لله عبادا عملوا على إيمانهم وصدقوا الله في أحوالهم ففتح الله أعين بصائرهم وتجلى لهم في سرائرهم فعرفوه على الشهود وكانوا في معرفتهم تلك على بصيرة وبينة بشاهد منهم وهو الرسول المبعوث إليهم فإن الله جعل الرسل شهداء على أممهم ولأممهم فمع كون هذا المؤمن على بينة من ربه حين تجلى له تلاه في تلك الحال شاهد منه وهو الرسول فأقامه له في الشهود مرآة فقال له هذا الذي جئتك من عنده فلما أبصره ما أنكره بعد ذلك مع اختلاف صور التجلي فربما كني عنه من هذه حالته من\n\n\nالمؤمنين بما وصف نفسه في كتبه أو على ألسنة رسله أو وصفته به رسله فآمن العاقل المؤمن يذلك من كتاب الله وقول الرسول وكفر بذلك من قول صاحب هذه الحالة من المؤمنين المتبعين وأما غير المؤمنين فهم الذين يَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّ ويَقْتُلُونَ الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ من النَّاسِ وهم الورثة الذين دعوا إلى الله على بصيرة كما دعوا الرسل قال تعالى عنه صَلَّى اللهُ عَليهِ وسَلَّم أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي ومعنى البصيرة هنا ما ذكرناه أي على الكشف مثل كشف الرسل فكيف آمن بهذا المؤمن من الرسول وكفر به بعينه من التابع رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أخيه المؤمن إذا جاء به فلا أقل من أن يأخذه منه حاكيا وما رأينا ولا سمعنا عن صاحب كشف إلهي من المؤمنين خالف كشفه ما جاءت به الرسل جملة واحدة ولا تجده فقد علمت الفرق بين العقلاء في معرفة عينه وبين الرسل والأولياء وما جاءت به الكتب المنزلة في ذلك فالمؤمن عند ما أعطاه سبيله والعاقل عند ما أعطاه دليله‏\n\n\n> وأين حكم العقل من حكمه *** سبحانه جل على نفسه‏\n\n\n> هيهات لا يعرفه غيره *** إلا به إذ ليس من جنسه‏\n\n\n> والعقل قد أدخل معبوده *** بفكره القاصر في حبسه‏\n\n\n> وقال هذا ولدي صنته *** في خلدي فهو على قدسه‏\n\n\n> كلام حال فإذا حوقلوا *** قالوا تعالى الله في نفسه‏\n\n\n> فخالقي المخلوق لي فاعتبر *** في فرعه الأعلى وفي رأسه‏\n\n\nفعليك بعبادة الله التي جاء بها الشرع وورد بها السمع ولا تكفر بما أعطاك دليلك المؤدي إلى تصديقه وقصارى الأمر إن تسلم له ولأمثاله مقالته في ربه لثبوت صدقه وثبوت المؤمن على اتباعه فإذا أنصفت في الأمر وعلمت ما نطقت به الرسل عليه السلام في حق الله جوزت أن تهب من تلك المعرفة نفحة على قلوب المتبعين من المؤمنين تؤديهم إلى الموافقة في النطق وإنه حيث كان لسان الحق فتسلمه في الفرع كما سلمته في الأصل بجامع الموافقة وإياك والكفران فإنه غاية الحرمان فتكون من الَّذِينَ آمَنُوا بِالْباطِلِ وكَفَرُوا بِاللَّهِ أُولئِكَ هُمُ الْخاسِرُونَ ف اعْبُدْ رَبَّكَ المنعوت في الشرع حَتَّى يَأْتِيَكَ الْيَقِينُ فينكشف الغطاء ويحتد البصر فترى ما رأى وتسمع ما سمع فتلحق به في درجته من غير نبوة تشريع بل وراثة محققة لنفس مصدقة متبعة وهذا باب يتسع المجال فيه لاتساع الأفعال فإن توحيد الأفعال يتسع باتساعها فإن نسب الأفعال لا تنتهي بل هي في مزيد ما دام الفعل يظهر من الفاعل ومنه طلب المزيد في قوله تعالى رَبِّ زِدْنِي عِلْماً فإن له في كل فعل تجليا خاصا لا يكون إلا لعين ذلك الفعل ولهذا يتميز كل فعل عن غيره بما يخصه من التجلي‏\n\n\n> قد قلت في الحق الذي قلته *** لا ترعوي فيه ولا تأتلي‏\n\n\n> فإنه الحق الذي جاءني *** من عنده وهو العليم الولي‏\n\n\n> فكيف لي برده وهو لي *** مؤيد بكشفه كيف لي‏\n\n\nقال الله تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فأتى بكاف الصفة في نفي المماثلة عن المثل المفروض ولها عموم النفي حتى تقترن بها حال‏\nمخصصة إذ قصارى الناظر في ذلك التوقف حتى يرى ما تعطيه قرائن الأحوال فيها وهذه آية صاحب الدليل العقلي لكنه جاء هذا للنفي والإثبات للمثلية باللسان العربي والمماثلة في اللسان على غير المماثلة التي اصطلح على إطلاقها العقلاء فيحتاج العاقل أن يتكلف دليلا على إن الحق أراد المماثلة العقلية ولا دليل يطلب من صاحب اللسان فيها فإنه بلسانه نزلت وعلى اصطلاحه ومثل هذا لا يدرك بالقياس ولا بالنظر فإنه يرجع إلى قصد المتكلم ولا يعرف ما في نفس المتكلم إلا بإفصاحه عما في نفسه وقد قال تعالى وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ والعربي لا يعرف المماثلة العقلية ولا ينكرها إذا سمعها وكل لفظ ورد في وصف الله تعالى معرى عن لفظة المثل وحرف كاف الصفة فقد تعرى عن أدوات التشبيه ولحق بالألفاظ المشتركة واعلم أن كاف الصفة لا فرق بينها وبين لفظة المثل وإن كان لهذا الحرف مواطن من جملتها موطن الصفة فإذا وردت في موطن الصفة في اللسان وهو أن تقول زيد كعمرو فإن العرب لا تريد إلا الإفادة فمن المحال أن تجي‏ء بمثل هذا وتريد به أنه يماثله في الإنسانية وهي المماثلة العقلية وإنما تريد أنه كعمرو في الكرم مثلا أو في الشجاعة أو في الفصاحة أو في العلم أو في الحسن وما أشبه ذلك مما دل عليه الحال بقرينته عند السامع لتقع له الفائدة فإذا قال لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فلا بد أن يقول فيما ذا أو يدل عليه قرينة الحال في المجلس ولا سيما وقد أردف نفي المماثلة بقوله وهُوَ السَّمِيعُ الْبَصِيرُ وهاتان صفتان محققتان في المخلوق فلا بد أن تحقق ما نفى وأن يعلم هل هي كاف الصفات أو غيرها مما يطلبه اللسان منها بما وضعها له فإن كانت كاف صفة هنا فما نفى إلا مماثلة المثل أن يماثل فأثبت المثل له بالهاء التي في مثله وهي ضمير يعود على الحق ومعلوم أن المثل ليس عين مماثله ولو كان عين من هو مثل له ما كان مثلا له لا عقلا ولا شرعا فوجود المثل عين إثبات الغير بلا شك فإن عمت المماثلة فهي العقلية بلا شك ولا ينكرها اللسان وإن خصت فهي لما خصت له حقيقة لا مجازا مثل زيد كالبحر لاتساعه في العلم أو في الجود ومن العلماء من جعل الكاف في لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ زائدة فإن كانت جاءت لمعنى فما هي زائدة فإن ذلك المعنى الذي سيقت له لا يظهر ولا يحصل إلا بها في نفس المخاطب فانتفى إن تكون زائدة فإن الله ما خلق شيئا باطلا ولا عبثا والزائد لغير معنى إنما هو عبث والعرب من المحال أن تجي‏ء بزائد لغير معنى فإذا جاءت بهذا الحرف جاءت به لمعنى فهو لما جاءت به فإن المتكلم لا يجي‏ء بالكلمة فيما يقوله النحوي زائدة إلا لقصد التوكيد فإذا زالت زال التوكيد فإذا ما هي زائدة فإن الكلام المؤكد ما استقل دونها وما يقوم مقامها فإذا أكد تعالى نفي المثل فما هي زائدة فجعل تأكيد نفي المثل في مقابلة من أثبت المثل فرضا ووجودا في زعمه والصحيح في هذه الكاف أنها كاف الصفة بقرائن الأحوال أي لو فرض له مثل لم يماثل ذلك المثل فأحرى إن لا يماثل فهو أبلغ في نفي المماثلة في اللسان ثم نقول في قولنا بقرائن الأحوال لكون الحق ما وصف الإنسان الكامل إلا بما وصف به نفسه فنفى مماثلة الإنسان الكامل أن يماثله شي‏ء من العالم ويعضد هذا قوله إنه خلق آدم على صورته فهذا خبر يقع به الأنس للنفس فما في العالم زائد لغير معنى لأنه ما فيه عبث ولا باطل بل كل ما فيه مقصود لمعنى فإن قلت فأين المماثلة في الفعل قلنا بيان هذا من وجهين الوجه الواحد أن يفعل بآلة ظاهرة فإذا قمت في توحيده في الأفعال جعلنا آلة له فيفعل بنا ما ينسب في الشاهد لنا فعله فنحن له كالقدوم للنجار والإبرة للخائط مثلا هذا إذا جعلناه مثلا لنا فإذا جعلنا أنفسنا مثلا له وهو الوجه الآخر من الوجهين في الجواب وهو الفعل بالإرادة والقصد وهي آلة باطنة فإنها نسبة فهو يفعل بالإرادة فإذا كان الإنسان صاحب همة نافذة فإنه يفعل بهمته كان مثلا له ولا يوجد ذلك في كل إنسان من هذا النوع فإنما نحن به وله فيفعلنا ويفعل بنا ويفعل فينا فلا يثبت التوحيد في الأعمال إلا أن نكون آلة لا بد من ذلك والله العالم والمعلم الذي اطلع من شاء على ما شاء من علمه وفي هذا المنزل من العلوم علم ما بقي من الزمان لقيام الساعة وفيه علم الفرق بين ما ينزل من العلم على قلوب العلماء من حضرة الربوبية وحضرة الرحمانية دون غيرهما من الحضرات الإلهية وفيه علم ما ينبغي أن يكون عليه صاحب هذا العلم من الصفة وهل يصح هذا العلم لمن لا يرفع به رأسا أم لا وفيه علم الأسرار التي لا تذاع وفيه علم الرد والقبول وفيه علم الفرق بين الرؤيا والمبشرات وأن الرؤيا أعم والمبشرات أخص فإن الإنسان قد يرى ما يحدث به نفسه وما يلعب به الشيطان أو يحزنه ولو لم يكن لذلك أثر\nفيمن رويت له أو رآها لنفسه ما أثبت الشارع لذلك الخوف مزيلا وهو قوله أن يتفل صاحب الرؤيا المفزعة على يساره ثلاثا ويستعيذ بالله من شر ما رأى فإنها لا تضره وليتحول من شقه الذي كان عليه نائما حين الرؤيا إلى شقه الآخر فإنها تتحول بتحوله كما يحول صاحب الاستسقاء رداءه عند الدعاء فيحول الله حالة الجدب بالخصب ويرمي شرها عمن اتخذه معاذا فلم يؤثر فيه إذ هو ليس بمحل للأثر وإن كان قد ورد ولكن على وجه خاص فقد ورد في الشرع أن العبد يفعل فعلا يسخط به ربه ويفعل فعلا يرضي به ربه وفيه علم في أي صورة يستعمل الدليل العقلي وفي أي صورة لا يستعمل وفيه علم حقائق الأشياء التي بالعلم بها يصح أن تكون معلومات وفيه علم الحدود الإلهية الموضوعة في العالم في الدنيا والآخرة وتنتهي أوقاتها وفيه علم العلم المولد من غير المولد علم ما ظهر عن الفكر والتدبر والرؤية وفيه علم مقارعة الوجود العدم وفي أي حضرة أو ميدان يجتمعان وليس لهما ميدان مقارعة إلا الممكنات فالمرجح غالب والمرجوح مغلوب وفيه علم التوحيد الإلهي وأماكنه ستة وثلاثون وفيه علم ما يعلل وما لا يعلل وفيه علم ما ينبغي أن يتخذ عدة للشدائد من الأسباب وغيرها وما ثم غير سبب تدفع به وفيه علم الفصل والوصل ولهما بابان في هذا الكتاب وفيه علم الأصل الذي منه أو به ظهرت الأكوان وأعيان العالم وفيه علم من هو العالم ومن يحفظ عليه صورته ومن لا يحفظ عليه صورته وفيه علم نسبة الحركة إلى العالم العلوي وما يطلب بتلك الحركة وفيه علم الانتقال من حال إلى حال وما أصل ذلك وفيه علم نشأة الإنسان على الانفراد وأعني بالإنسان الإنسان الحيوان وفيه علم التثبت في الأمور وما سبب وما ينتج وفيه علم العجز والقصور ومن هو أهله وفيه علم الحافظ والحفظ والمحفوظ من حيث ما هو محفوظ والمحفوظ به وفيه علم الزيادة والنقص وأن الدنيا من حين خلقها الله ما زالت تنقص وأن الآخرة من حين شرع النقص في الدنيا ما زالت تزيد فيه في كل يوم في مزيد والدنيا في كل يوم أيضا في نقص وفيه علم من علم أنه لا يكون منه كون كذا لما طولب بكون ذلك كمن يطلب القيام من المقعد الذي لا يصح منه القيام ولما ذا يريده مع علمه بأنه لا يستطيعه وفيه علم عناية الحق بعبده في حال لا يتصف فيه العبد بالعقل ولا بالوجود كأبي يزيد وأمثاله من الأولياء وكعيسى ويحيى من الأنبياء وفيه علم إقامة الحجج وفيه علم ما يستقل العقل بإدراكه مما لا يستقل بإدراكه وفيه علم طيب الخبيث عند الخبيث وفيه علم نسبة الإصابة لكل مجتهد ومعنى نسبة الخطاء إلى المجتهد وأن ذلك الخطاء علم في نفس الأمر وحكم الله وفيه علم الصنائع العملية بالفطرة والرؤية والتعليم فهذه ثلاثة\n\n\nأحوال فهي بالفطرة في الحيوان وبالتعليم في الضعيف العقل والرؤية وبالرؤية والتدبير في القوي العقل الصحيح الفكر والنظر وفيه علم ما يتقى ومن يتقي وبما ذا يتقى وأصناف المتقين وفيه علم الفرق بين البلاء والابتلاء وفيه علم القرين الصالح هل الصلاح فيه بالجعل أو بالأصالة وفيه علم حكم الجزاء الوفاق المناسب بالاتفاق وفيه علم أحوال الندم ومتى يتعين وقته وفيه علم التبديل والتحويل في الصور مع بقاء العين وهل ينتقل الاسم بانتقال الحال أم لا وفيه علم ترتيب الكتب الإلهية مع أن الكلام واحد في نفسه وكيف ينسب للمتأخر التقدم على من هو متأخر عنه وفيه علم ما تعطيه العبادة من العلوم وفيه علم عموم رحمة المخلوق وهو من أسنى العلوم وأخفاها وفيه علم ما يمكن أن يكون فيه التساوي بين المخلوقات وبين ما لا يكون وفيه علم التنزيه ومكانة الخلق من الحق والحق من الخلق والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 363: Concerning the Gnostic's Station of Attributing What He Does Not Know to Those Below Him, So That He May Teach Them What Is Beyond Their Capacity to Know, and the Transcendence of the Creator from Ecstasy and Joy\n\nThe setting of the Scales for the Reckoning, *** The speaking Book brought it forth.\nA Book of Essence (الذات), without a pen, *** Nor ink, nor acquisition.\nNor Attributes (الصفات), nor descriptions, *** Nor going away, nor returning.\nIf he repents for what afflicted him, *** The Acceptor accepts the repentance.\nHe demands gratitude in cooking pots, *** And in bowls like cisterns.\n\n### [Intellectual Monotheism, i.e., the Monotheism of Acts (توحيد الأفعال)]\n\nThis is the station (منزل) of intellectual monotheism (التوحيد العقلي), meaning the monotheism of Acts (توحيد الأفعال)—that is, there is no doer but Allah. This is a noble station. Know that the World (العالم), even in its state of non-existence (عدم), was witnessing the Necessary Existent (الواجب الوجود), because it was perpetually in a state of non-preference (عدم مرجح) while being a Fixed Entity (ثابت العين). The Real (الحق) described it, even in its state of non-existence, with hearing and obedience to Him. Therefore, the attribution of witnessing (المشاهدة) was not impossible for it. For this reason, none of the contingent beings (الممكنات) denied Him in their state of existence.\n\nHowever, this human existent (الموجود الإنساني) alone, among the entire World, associated partners with Him—specifically those overcome by the veil of nature (حجاب الطبع). This nature is what accustomed him to hear, obey, and worship primarily only a Lord whom he witnesses (يشهده). The veil of nature rendered that Worshipped One (المعبود) a hidden reality (غيبا) for him. Thus, he took whatever existents he witnessed and saw—whether from the celestial world, like the stars, or from the lower world, like the elements or what is generated from them—as a lord to worship based on the witnessing he was accustomed to, which brought peace to his soul. He imagined, in his contemplation, that this adopted deity witnesses the Real (الحق) and is closer to Him than he is. So, he served it to draw himself closer to Allah, the Mighty and Majestic, just as Allah informed us that they said: <<مَا نَعْبُدُهُمْ>> (We do not worship them)—meaning the deities they adopted for worship—<<إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى>> (except that they may bring us nearer to Allah in proximity). They emphasized this with the term *zulfa* (proximity). This arose from contemplation and exertion (اجتهاد).\n\nThen they saw that the followers of the divinely revealed Laws (الشرائع المنزلة الإلهية) had bound people to prostration (السجود), placing their faces on the ground, bowing (الركوع), and facing a specific direction as a means of drawing near (القربة) to Allah, and kissing a stone which they were told was the Hand of Allah. They also introduced the magnification of rites (شعائر) and newly established signs (أعلام محدثات) which they attributed to Allah, making our magnification of these rites and rituals (المناسك) a sign of the piety of the hearts (تقوى القلوب). They linked our happiness (سعادتنا) to the manifestation of this magnification. This increased their reliance on the deities and laws they had established and set up.\n\nThey did not distinguish between what Allah established in His creation and what they established for themselves, from themselves. Our discussion here is only with the Imams, the masters of primary contemplation (أصحاب النظر الأول), who established these things as objects of worship as a means of drawing near to Allah, the Mighty and Majestic. Furthermore, one of the things that deceived them was what they saw and heard in the divine Laws concerning the happiness of the *mujtahid* (one who exerts effort in legal reasoning) absolutely, whether he erred or was correct. The reward is guaranteed for him after fulfilling the necessary contemplation (النظر) and exertion (الاجتهاد), according to the capacity (الاستعداد) Allah granted him within himself.\n\nThus, they imagined, concerning what was not proof (برهان), that it *was* proof for what they sought. They only adopted a deity based on a proof, in their claim, which is His saying: <<وَمَن يَدْعُ مَعَ اللَّهِ إِلَٰهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ>> (And whoever invokes another god alongside Allah, for which he has no proof). This means, in his claim. This indicates that whoever establishes a proof in his contemplation is not held accountable, even if he errs, for error was not his intention. Rather, his intention was to attain the truth as the matter truly is. The root of all this is that he does not worship a hidden reality (غيبا), because that is not what he is accustomed to fundamentally.\n\nFor this reason, Gabriel (عليه السلام) came to teach the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) and his Companions what the matter truly is, in the form of a Bedouin. The Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) said, \"Do you know who this is?\" or he said, \"Bring the man back to me.\" They searched but did not find him. The Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) said to his Companions when he departed, \"This was Gabriel, who came to teach the people their religion.\" Among the questions he asked was, \"What is *Ihsan* (Excellence)?\" The Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) replied, \"That you worship Allah as if you see Him,\" knowing that worship based on the unseen (العبادة على الغيب) is difficult for souls. Then he completed the answer, saying, \"For if you do not see Him, He surely sees you.\"\n\nThat is, bring into your soul the awareness that He sees you. This is another type of witnessing (الشهود) from behind a veil (حجاب): you know that your Worshipped One sees you from where you do not see Him, and hears you. The Law (الشرع) only came to us concerning all this with what contained deception (اغترار) and reliance (استناد) for these people. That is why the Almighty said: <<يُضِلُّ بِهِ كَثِيرًا وَيَهْدِي بِهِ كَثِيرًا>> (He misleads many thereby and guides many thereby), and He said: <<يُضِلُّ مَن يَشَاءُ وَيَهْدِي مَن يَشَاءُ>> (He misleads whom He wills and guides whom He wills). He is the One who grants correctness in contemplation and the One who grants error.\n\nThe implication of all this is that worship (العبادة) only relates to the worshipper through something witnessed (مشهود) or something *like* the witnessed (كالمشهود); there is no path to the Unseen (الغيب). This is part of Allah's hidden mercy (رحمة الله الخفية) and subtle kindness (ألطافه). The only ones excluded from those we mentioned are the imitators (المقلدة). Misery (الشقاء) is attached to them.\n\nHowever, the Real (الحق) established a reliance for them in the revealed Law (الشرع المنزل) out of His mercy for them, saying: <<فَاسْأَلُوا أَهْلَ الذِّكْرِ إِن كُنتُمْ لَا تَعْلَمُونَ>> (So ask the People of the Remembrance if you do not know). The People of the Remembrance (أهل الذكر) are the People of the Quran, for Allah the Almighty says: <<إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ>> (Indeed, it is We who sent down the Remembrance), which is the Quran. They are the people of exertion (أهل الاجتهاد), among whom are the correct and the mistaken. If the imitator asks one of the mistaken people of exertion concerning the matter itself and acts upon his legal opinion (فتوى), he is rewarded because he was commanded to ask. Thus, the imitator has a reliance.\n\nThe contemplators (النظار) who erred in their primary contemplation (في الأصول), despite fulfilling what their capacity (استعدادهم) led them to in the legal opinions they issued—such as their adoption of deities besides Allah—even if they did not contemplate, Allah only burdens a soul with what He has placed within it: <<لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا>> (Allah does not burden a soul beyond its capacity). Thus, His mercy encompasses the Imams and the followers. There is no one in the World except a monotheist (موحد), meaning one who relies on a single entity (واحد). You have learned from this discourse what *shirk* (association) is and the description of the *mushrik* (associator).\n\nAllah has excused them from one perspective, saying to them: <<لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا>> (Do not despair of the mercy of Allah. Indeed, Allah forgives all sins). This applies when the servant intends to commit a sin while believing it to be a sin. What then is the state of one who did not intend to commit a sin but adopted that act as a means of drawing near (قربة) due to a doubt (شبهة) that arose for him? He is more deserving of forgiveness. As for holding the people of *shirk* accountable definitively, based on His saying: <<إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ>> (Indeed, Allah does not forgive that association be made with Him), this is evident due to the context of the situation (قرينة الحال). From the perspective of language (اللسان), it refers to what has already occurred, for Allah did not conceal *shirk* from the people of *shirk*; rather, they manifested it. Thus, it is an announcement of what has appeared in Existence (الوجود) concerning the manifestation of *shirk*, and the concealment of what is lesser than that for whomever He wills to conceal. For there are matters that have not appeared to any eye or intellect, as came in the description of Paradise: \"wherein is what no eye has seen, nor ear has heard, nor has it occurred to the heart of man.\"\n\nHowever, the contextual indicators (قرائن الأحوال) point definitively to the accountability of the associators. Yet, the Glorified One did not mention what their state will be after the accountability, which is the establishment of the penalty (الحد) upon them in the Hereafter, on the Day of Judgment (يوم الدين), which is the recompense. They will enter the Fire along with some of their deities so that they may realize through witnessing (مشاهدة) that those deities avail them nothing against Allah, because they adopted them based on their own contemplation, not based on a divine establishment (وضع إلهي). Look, O my friend (ولي), at the justice and favor of Allah! Praise be to Him in every state (على كل حال). This is a sound prophetic praise (حمد نبوي صحيح), for the praise (الثناء) is due in every state, whether from an associator or a non-associator. For the associator, as we said, only ascribed Greatness (العظمة) and Majesty (الكبرياء) to Allah, and made the deities like attendants (السدنة) and veils (الحجاب). They only worshipped them *for His sake*, even if they erred concerning them. Their error was only concerning the Oneness (الأحدية). Thus, they too are among those who praise Allah, since they are people of praise for Allah by unifying His Greatness and preferring Him over these attendants. Direct your attention to the vast and encompassing mercy of Allah (رحمة الله السابغة الواسعة) which He has spread over His creation, and you will be guided to the Real (الحق), if Allah wills.\n\nAs for the differences in beliefs (اختلاف العقائد) concerning Allah among the followers of the divine Laws and others: if Allah the Almighty were to hold the World accountable for error, He would hold every possessor of a belief concerning Him accountable, for he has restricted his Lord by his intellect and contemplation and confined Him. But nothing befits Allah except Absolute Freedom (الإطلاق), for <<بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ>> (in His hand is the dominion of all things). He restricts, but is not restricted. However, Allah has forgiven everyone. Whoever desires to attain the Real and fulfill His due right, Allah guides him to the knowledge of His vastness and comprehensiveness, and that He is witnessed (مشهود) in the belief of every believer. It is not possible for Him to be absent in the belief of the believer, for the believer has linked his belief to Him, and <<وَهُوَ عَلَى كُلِّ شَيْءٍ شَهِيدٌ>> (He is a Witness over all things). The possessor of this knowledge (صاحب هذا العلم) sees the Real always and in every form, so he does not deny Him when the one who restricts Him denies Him. Despite this, Allah has forgiven those who restricted Him, whether by transcendence (تنزيه) or similitude (تشبيه), among the Imams of the religion.\n\nThen look at the testimony of Allah, the Mighty and Majestic, before His Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) concerning the associators: <<وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ>> (And if you ask them who created them, they will surely say, \"Allah\"). This is a marvelous notification. When they were told, <<اسْجُدُوا لِلرَّحْمَٰنِ>> (Prostrate to the All-Merciful [al-Rahman]), they had not seen Him physically and only knew Him by the name *Allah*. They did not know that He is the very Essence (عين) named *al-Rahman*. So they imagined that *al-Rahman* was a partner to *Allah*, and they denied this. Yet, they did not deny this concerning those whom they had set up as deities, as we established, because they knew the names of those they set up as deities besides Allah. They knew by their names that they were not truly like Him in divinity, for they held the monotheism of Greatness and Majesty for Him. When He directed them to worship the Unseen (عبادة غيب) by prostrating to *al-Rahman*, <<قَالُوا وَمَا الرَّحْمَٰنُ أَنَسْجُدُ لِمَا تَأْمُرُنَا وَزَادَهُمْ نُفُورًا>> (They said, \"And what is al-Rahman? Shall we prostrate to what you command us?\" And it increased them in aversion), because they only knew one God in the Unseen. So Allah said to His Prophet (صَلَّى اللهُ عَليهِ وسَلَّم): <<ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَٰنَ أَيًّا مَّا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَىٰ>> (Call upon Allah or call upon al-Rahman. Whichever you call upon—to Him belong the Most Beautiful Names [al-Asma al-Husna]). They were utterly astonished by this, because they imagined that the entity named *al-Rahman* was not the entity named *Allah*, even though the Most Beautiful Names belong to both. This was because Allah blinded their insights (بصائرهم) and thickened their coverings, so they did not grasp from Allah what He intended by what He revealed concerning them. The Real also made this a reliance for them, since He came to them with a Name that sought an entity they did not recognize by this sign, while the People of Allah and His elect knew it.\n\nSo Allah, the Lord, al-Rahman, and the King, *** Are all Realities (حقائق) that share in the Essence (الذات).\nThe Entity (العين) is one, and the ruling is shared, *** Thus appeared the body, the spirits, and the celestial sphere.\nAnd all of them are instruments between our Creator *** And us, and for this reason, attainment is guaranteed.\nThe Messengers of al-Rahman brought them all, *** Along with the Book which the Angel conveyed.\n\n### [Indeed, Knowledge of Allah is Two Paths]\n\nKnow that the Knowledge (العلم) of Allah has two paths. One path is that which the intellect (العقل) is capable of grasping independently before the establishment of the Law (الشرع). This relates to His Oneness (أحديته) in His Divinity (ألوهته), that He has no partner, and what must necessarily belong to the Necessary Existent (الواجب الوجود). It does not involve exposure to the knowledge of His Essence (ذاته تعالى). Whoever exposes his intellect to the knowledge of Allah's Essence has exposed himself to something he is incapable of, behaved improperly, and exposed himself to great danger. This is the path concerning which the Friend of Allah, Abraham (عليه السلام), said to his people: <<أُفٍّ لَّكُمْ وَلِمَا تَعْبُدُونَ مِن دُونِ اللَّهِ أَفَلَا تَعْقِلُونَ>> (Fie upon you and upon what you worship besides Allah! Do you not reason?). He alerted them that the knowledge of Allah, in terms of His being one God in His Divinity, is among the perceptions of the intellects. He only referred them to a matter that is valid for contemplation, so that the contemplator may know what the matter truly is.\n\nThe other path is the path of the Law (الشرع) after its establishment. It brought what the intellect brought through its proof (دليله)—which is the affirmation of the Oneness (أحدية) of its Creator and what is necessary for Him, the Mighty and Majestic. The other aspect of the knowledge of Allah is the knowledge of what He is in His Essence (في ذاته). The Law described Him after the intellect had ruled, through its proof, concerning the infallibility (عصمته) of what the Messenger conveys from his Lord, the Glorified One, concerning the news about Him, along with <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). The Law states that no similitude (مثل) should be struck for Him; rather, He is the One who strikes the similitudes, because He knows and we do not know. Thus, the Law attributed matters to the Almighty that the intellect, based on its proof, cannot attribute to Him, nor can it reject them from the one whose intellectual proof established his infallibility. This resulted in confusion (حيرة) between the two paths. Both paths are sound, and neither can be impugned.\n\nAmong the intellectuals (العقلاء) are those who interpreted (تأول) with an interpretation of transcendence (تنزيه) and support, reinforcing their interpretation with <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> and His saying: <<وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ>> (And they did not appraise Allah with His true appraisal). Among the intellectuals are those who submitted the knowledge of that to the one who brought it, or to Allah. And among the intellectuals, the people of language (أهل اللسان), are those who made similitudes (شبه). Allah has excused every group. He only demanded of His servants concerning Himself that they know He is one God (إله واحد) who has no partner in His Divinity, nothing else, and that <<لِلَّهِ الْأَسْمَاءُ الْحُسْنَىٰ>> (To Allah belong the Most Beautiful Names) according to the meanings they hold in the language. He linked salvation and happiness to whoever adheres to what came from Him, the Mighty and Majestic, in His Books and upon the tongues of His Messengers (ع).\n\nWhen the Real (الحق) made Himself manifest *** By Himself in His Books, then believe.\nThere is no blame upon us concerning it, *** And that is the Knowledge of Him, so believe.\nFor the intellect's share of the Knowledge *** Of Him is that which negates the existence of number.\nAnd that He is One in His affair, *** And that He is Allah, who <<لَمْ يَلِدْ>> (has not begotten).\nLikewise, <<وَلَمْ يُولَدْ>> (nor was He begotten). And for whoever seeks Him *** With his intellect, do not add anything beyond his thought.\n\nThe proof of this, O my friend (ولي), is the difference in the statements concerning Him among the contemplative intellectuals (العقلاء النظار) and the agreement in the statements concerning Him from everyone who came from Him—Messenger, Prophet, and Saint (ولي), and every informant about Allah. If the rational believer were to grasp the meaning of His saying in His Book, <<وَلَمْ يُولَدْ>> (nor was He begotten), and knew that what the intellect produces from its thought by combining its two premises—that result is a *birth* (ولادة) for the intellect, and it is *begotten* (مولودة) from it—and He has negated being begotten, then where is the faith? The begotten thing is nothing but His very entity (عينه). This is unlike when the intellect produces the attribution of Oneness (الأحدية) to Him. The conceptualization of Oneness for the One is not the very entity to which Oneness is attributed. The intellect has a birth concerning Oneness, and a birth concerning reliance upon Him, but in no case does it have a birth concerning His very Entity (عينه). As for His Ipseity (هويته) and His Reality (حقيقته), the intellect has no birth concerning them. He negated this by His saying: <<وَلَمْ يُولَدْ>> (nor was He begotten). From this, you know that every rational person who has a statement concerning the Essence (ذات) of Allah only worships what his intellect has begotten. If he is a believer, this is a flaw in his faith. If he is not a believer, it suffices that he is not a believer, especially after the general mission of Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم) and its reaching all horizons.\n\nIndeed, Allah has servants who acted upon their faith and were truthful with Allah in their spiritual states (أحوالهم). Allah opened the eyes of their insights (بصائرهم) and disclosed Himself (تجلى) to them in their innermost beings (سرائرهم), so they knew Him through witnessing (على الشهود). In that knowledge, they were upon clear insight (بصيرة) and evidence (بينة) with a witness from among themselves, who is the Messenger sent to them. For Allah made the Messengers witnesses over their nations and for their nations. Despite this believer being upon clear evidence from his Lord when He disclosed Himself to him, a witness from Him—the Messenger—followed that disclosure in that state. He established the Messenger for him as a mirror in the witnessing, saying to him, \"This is the One from whom I came to you.\" When he perceived Him, he did not deny Him thereafter, despite the variation in the forms of the Theophany (صور التجلي). Perhaps the believer whose state is this refers to Him by what He described Himself with in His Books or upon the tongues of His Messengers, or by what His Messengers described Him with. The rational believer accepts this from the Book of Allah and the saying of the Messenger, but he rejects the same thing when it comes from the saying of the possessor of this state among the following believers.\n\nAs for the non-believers, they are those who <<يَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّ وَيَقْتُلُونَ الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ مِنَ النَّاسِ>> (kill the prophets without right and kill those who enjoin justice among the people). These are the inheritors (الورثة) who call to Allah upon clear insight (على بصيرة), just as the Messengers called. The Almighty said concerning the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم): <<أَدْعُوا إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي>> (I call to Allah upon clear insight—I and those who follow me). The meaning of *basira* (insight) here is what we mentioned: that is, upon Unveiling (الكشف), like the Unveiling of the Messengers. How is it that this believer accepts this from the Messenger but rejects the very same thing when it comes from his believing brother, the follower of the Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم), when he brings it? The least he should do is accept it from him as a narration. We have neither seen nor heard of any possessor of divine Unveiling (كشف إلهي) among the believers whose Unveiling contradicted what the Messengers brought, not even in a single instance, nor will you find such a case. Thus, you have learned the difference between the intellectuals concerning the knowledge of His Entity (عينه) and the Messengers and Saints (الأولياء), and what the revealed Books brought concerning this. The believer adheres to what his path (سبيله) granted him, and the rationalist adheres to what his proof (دليله) granted him.\n\nAnd where is the ruling of the intellect compared to His ruling? *** Glorified is He, exalted above Himself.\nFar be it! None knows Him but Him, *** Except through Him, since He is not of its kind.\nAnd the intellect has confined its Worshipped One *** By its deficient thought, within its prison.\nAnd it said, \"This is my child, I protected him *** In my mind, so he is upon his sanctity.\"\nThis is the speech of a state (كلام حال). But when they say *Hawqala* (There is no power...), *** They say, \"Exalted is Allah in His Essence.\"\nSo my Creator is created for me, so reflect *** In its highest branch and in its head.\n\nYou must adhere to the worship of Allah brought by the Law (الشرع) and conveyed by the hearing (السمع). Do not reject what your proof (دليلك) granted you, which leads to affirming Him. The utmost you can do is submit to Him and those like Him concerning their statement about their Lord, due to the certainty of their truthfulness and the certainty of the believer's adherence to them. If you are fair in the matter and know what the Messengers (عليه السلام) spoke concerning Allah, you will permit that a breath (نفحة) of that Gnosis (المعرفة) be bestowed upon the hearts of the following believers, leading them to agreement in utterance. And that wherever the tongue of the Real (لسان الحق) is, you submit to it in the derivative (الفرع) just as you submitted to it in the origin (الأصل), based on the principle of agreement. Beware of ingratitude (الكفران), for it is the ultimate deprivation, lest you become one of <<الَّذِينَ آمَنُوا بِالْبَاطِلِ وَكَفَرُوا بِاللَّهِ أُولَٰئِكَ هُمُ الْخَاسِرُونَ>> (those who believe in falsehood and disbelieve in Allah—those are the losers).\n\nSo, <<اعْبُدْ رَبَّكَ>> (Worship your Lord), who is described in the Law, <<حَتَّىٰ يَأْتِيَكَ الْيَقِينُ>> (until certainty [اليقين] comes to you). Then the veil (الغطاء) will be lifted, and the sight (البصر) will sharpen, so you will see what he saw and hear what he heard. You will join him in his degree (درجته), not through the prophethood of legislation (نبوة تشريع), but through a verified inheritance (وراثة محققة) for a truthful, following soul. This chapter (باب) is vast in scope due to the vastness of the Acts (الأفعال), for the monotheism of Acts (توحيد الأفعال) expands with their expansion. The relations of the Acts (نسب الأفعال) are endless; rather, they are in perpetual increase as long as the Act appears from the Doer (الفاعل). From this comes the request for increase in His saying: <<رَبِّ زِدْنِي عِلْمًا>> (My Lord, increase me in knowledge). For in every Act, there is a specific Theophany (تجليا خاصا) that belongs only to the entity of that Act. For this reason, every Act is distinguished from others by the specific Theophany that pertains to it.\n\nI have spoken concerning the Real (الحق) what I spoke, *** Do not hesitate in it, nor swear off it.\nFor it is the Real that came to me *** From Him, and He is the All-Knowing, the Protecting Friend (الولي).\nHow can I reject it when He supports me *** With His Unveiling (كشف)? How can I?\n\nAllah the Almighty said: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). He used the *kaf* of description (كاف الصفة) in negating similitude (المماثلة) from the supposed like (المثل المفروض). This negation has a general scope unless it is accompanied by a specific context (حال مخصصة). The utmost the contemplator can do in this regard is to pause until he sees what the contextual indicators (قرائن الأحوال) yield concerning it. This is the verse for the possessor of the intellectual proof (الدليل العقلي). However, this verse came for the negation and affirmation of likeness (المثلية) in the Arabic language (اللسان العربي). Similitude (المماثلة) in the language is different from the similitude that the intellectuals have agreed upon. The intellectual needs to force a proof that the Real intended the intellectual similitude, but no proof is required from the master of the language concerning it, for the revelation descended in his language and according to his convention. Such a matter cannot be grasped by analogy (القياس) or contemplation (النظر), for it refers back to the speaker's intention (قصد المتكلم). What is in the speaker's soul is only known by his explicit declaration of what is in his soul. The Almighty said: <<وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ>> (And We did not send any messenger except with the language of his people).\n\nThe Arab does not know intellectual similitude, nor does he deny it when he hears it. Every word that came in the description of Allah the Almighty, stripped of the word *mithl* (like) and the letter *kaf* of description, is stripped of the tools of similitude (أدوات التشبيه) and belongs to the ambiguous words (الألفاظ المشتركة). Know that there is no difference between the *kaf* of description and the word *mithl*, even though this letter has positions, one of which is the position of description. When it occurs in the position of description in the language—such as when you say, \"Zayd is *ka-Amr* (like Amr)\"—the Arabs only intend to convey a benefit. It is impossible to use such a phrase and intend that he is like Amr in humanity, which is the intellectual similitude. Rather, you mean that he is like Amr in generosity, for example, or in courage, or in eloquence, or in knowledge, or in beauty, and similar things indicated by the context (الحال) for the listener, so that the benefit is achieved.\n\nWhen He said: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), it must be asked, \"In what?\" or the contextual indicator in the situation must point to it. Especially since He followed the negation of similitude with His saying: <<وَهُوَ السَّمِيعُ الْبَصِيرُ>> (And He is the All-Hearing, the All-Seeing). These are two Attributes (صفتان) verified in the created being. It is necessary to verify what He negated and to know whether it is the *kaf* of description or another meaning required by the language. If it is the *kaf* of description here, then He only negated the similitude of the *like* (مماثلة المثل) from being similar. Thus, He affirmed a *like* (مثل) for Him through the pronoun (هاء) in *mithlihi* (His like), which refers back to the Real (الحق). It is known that the *like* is not the very entity of the one it is like. If it were the very entity of the one it is like, it would not be a *like* for him, neither intellectually nor legally. The existence of the *like* is undoubtedly the affirmation of the Other (الغير). If the similitude is general, it is undoubtedly the intellectual similitude, and the language does not deny it. If it is specific, it is specific to what it was intended for, truly, not metaphorically—like [saying] \"Zayd is like the sea\" for his vastness in knowledge or generosity.\n\nSome scholars considered the *kaf* in <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> to be superfluous (زائدة). If it came for a meaning, then it is not superfluous, for that meaning for which it was introduced does not appear or occur in the soul of the addressee except through it. Thus, the idea that it is superfluous is negated, for Allah created nothing vainly (باطلا) or frivolously (عبثا). The superfluous element without meaning is frivolity. It is impossible for the Arabs to use a superfluous element without meaning. When they use this letter, they use it for a meaning, and that is the meaning for which it was brought. The speaker only uses a word that grammarians call superfluous for the purpose of emphasis (التوكيد). If it is removed, the emphasis is removed. Therefore, it is not superfluous, for the emphasized speech is not complete without it or without what takes its place. Since the Almighty emphasized the negation of the *like*, it is not superfluous. He made the emphasis of the negation of the *like* in opposition to those who affirmed the *like* hypothetically and actually, in their claim. The correct view concerning this *kaf* is that it is the *kaf* of description, based on contextual indicators, meaning: \"Even if a *like* were hypothesized for Him, that *like* would not be similar to Him.\" How much more so that He is not similar! This is the most eloquent form of negating similitude in the language.\n\nThen we say, concerning our statement \"based on contextual indicators,\" that this is because the Real only described the Perfect Human (الإنسان الكامل) with what He described Himself with. Thus, He negated the similitude of the Perfect Human from being similar to anything in the World. This is supported by His saying that He created Adam upon His form (صورته). This is news that brings familiarity (الأنس) to the soul. There is nothing in the World superfluous without meaning, because there is nothing frivolous or vain in it; rather, everything in it is intended for a meaning.\n\nIf you ask, \"Where is the similitude in the Act (الفعل)?\" We say the explanation of this is twofold. The first aspect is that He acts with a manifest instrument (آلة ظاهرة). If you establish monotheism in His Acts (توحيده في الأفعال), we are made an instrument for Him, and He acts through us what is attributed to us in the witnessed realm (الشاهد). We are to Him like the adze to the carpenter or the needle to the tailor, for example. This is if we make ourselves a *like* for Him. The other aspect of the two is the Act through Will (الإرادة) and Intention (القصد), which is an inner instrument (آلة باطنة), for it is a relation (نسبة). He acts through Will. If the human possesses penetrating spiritual resolve (همة نافذة), he acts through his resolve, being a *like* for Him. This does not exist in every human of this type. We are only *by* Him and *for* Him. He acts us, acts by us, and acts in us. Monotheism in Acts (التوحيد في الأعمال) is only established if we are instruments (آلة). This is necessary. And Allah is the Knower and the Teacher who informs whomever He wills of whatever He wills of His Knowledge.\n\nIn this station (منزل) are sciences, including the knowledge of the remaining time until the Hour (الساعة) is established. It includes the knowledge of the difference between the knowledge that descends upon the hearts of the scholars from the Presence of Lordship (حضرة الربوبية) and the Presence of the All-Merciful (حضرة الرحمانية), excluding other Divine Presences (الحضرات الإلهية). It includes the knowledge of the necessary description of the possessor of this knowledge, and whether this knowledge is valid for one who does not pay attention to it. It includes the knowledge of secrets that are not to be divulged. It includes the knowledge of rejection and acceptance. It includes the knowledge of the difference between a dream (الرؤيا) and glad tidings (المبشرات), for the dream is more general and glad tidings are more specific. For a person may see what he talks to himself about, or what Satan plays with or grieves him. If there were no effect of this upon the one to whom it was narrated or who saw it for himself, the Lawgiver would not have established a remedy for that fear, which is His saying that the person who sees a frightening dream should spit to his left three times and seek refuge in Allah from the evil of what he saw, for it will not harm him. He should also turn from the side he was sleeping on when he saw the dream to his other side, for it will change with his turning, just as the one seeking rain changes his cloak when supplicating, and Allah changes the state of drought to fertility. He casts away its evil from the one who takes refuge in Him, so it does not affect him, even though it has been reported, but in a specific way. It has been reported in the Law that the servant performs an act by which he angers his Lord, and performs an act by which he pleases his Lord.\n\nIt includes the knowledge of in what form the intellectual proof (الدليل العقلي) is used and in what form it is not used. It includes the knowledge of the realities of things (حقائق الأشياء) by which knowledge they are valid to be known entities (معلومات). It includes the knowledge of the Divine Boundaries (الحدود الإلهية) established in the World, in this life and the Hereafter, and when their times end. It includes the knowledge of generated knowledge (العلم المولد) from non-generated knowledge—the knowledge that appeared from thought, deliberation, and vision. It includes the knowledge of the clash of Existence (الوجود) with Non-existence (العدم), and in which Presence (حضرة) or arena they meet. They have no arena of clash except the contingent beings (الممكنات). The preferred (المرجح) is dominant, and the non-preferred (المرجوح) is defeated. It includes the knowledge of Divine Monotheism (التوحيد الإلهي) and its thirty-six locations. It includes the knowledge of what is caused (يعلل) and what is not caused. It includes the knowledge of what should be taken as preparation for hardships, whether causes (أسباب) or otherwise, and that there is no other cause by which hardship is repelled. It includes the knowledge of separation (الفصل) and connection (الوصل), and they have two chapters in this Book. It includes the knowledge of the Origin (الأصل) from which, or by which, the universes (الأكوان) and the Fixed Entities (أعيان العالم) appeared. It includes the knowledge of who the World (العالم) is, who preserves its form for it, and who does not preserve its form for it. It includes the knowledge of the relation of motion to the upper World (العالم العلوي) and what is sought by that motion. It includes the knowledge of transition from one state to another and its origin. It includes the knowledge of the solitary formation of man (نشأة الإنسان على الانفراد)—and by man, I mean the animal man. It includes the knowledge of verification (التثبت) in matters, its cause, and what it produces. It includes the knowledge of incapacity (العجز) and deficiency (القصور) and who is worthy of them. It includes the knowledge of the Preserver (الحافظ), the Preservation (الحفظ), and the Preserved (المحفوظ) in terms of what is preserved and that by which it is preserved. It includes the knowledge of increase and decrease, and that the World (الدنيا), since its creation by Allah, has continuously decreased, and the Hereafter (الآخرة), since the decrease began in the World, has continuously increased, being in perpetual increase every day, while the World is also in perpetual decrease every day. It includes the knowledge of one who knows that a certain existence will not come from him when he is asked for that existence—like asking a crippled person to stand, which he cannot do—and why He desires it despite knowing that he is unable. It includes the knowledge of the Real's care (عناية الحق) for His servant in a state where the servant is not characterized by intellect or existence, such as Abu Yazid and similar Saints (الأولياء), and like Jesus and John (Yahya) among the Prophets. It includes the knowledge of establishing proofs (الحجج). It includes the knowledge of what the intellect grasps independently and what it does not grasp independently. It includes the knowledge of the pleasantness of the foul thing to the foul person. It includes the knowledge of the attribution of correctness to every *mujtahid* (exerting scholar) and the meaning of attributing error to the *mujtahid*, and that this error is knowledge in the matter itself and the ruling of Allah. It includes the knowledge of the practical arts (الصنائع العملية) by innate disposition (الفطرة), vision (الرؤية), and teaching (التعليم). These are three states: by innate disposition in the animal, by teaching in the weak-minded and by vision, and by vision and deliberation in the strong-minded, sound in thought and contemplation. It includes the knowledge of what is feared, who fears, and by what means he fears, and the types of the pious (المتقين). It includes the knowledge of the difference between affliction (البلاء) and trial (الابتلاء). It includes the knowledge of the righteous companion (القرين الصالح): is his righteousness by divine making (الجعل) or by fundamental nature (الأصالة)? It includes the knowledge of the ruling of appropriate recompense (الجزاء الوفاق) by agreement. It includes the knowledge of the states of remorse (الندم) and when its time is determined. It includes the knowledge of substitution (التبديل) and transformation (التحويل) in forms while the Entity (العين) remains, and whether the Name (الاسم) transfers with the transfer of the state (الحال) or not. It includes the knowledge of the arrangement of the Divine Books, despite the fact that the Speech (الكلام) is one in itself, and how precedence is attributed to the later one over the one who is later than him. It includes the knowledge of the sciences granted by worship (العبادة). It includes the knowledge of the universality of the creature's mercy (رحمة المخلوق), which is one of the most sublime and hidden sciences. It includes the knowledge of what equality can exist between creatures and what cannot. It includes the knowledge of Transcendence (التنزيه) and the place of Creation (الخلق) in relation to the Real (الحق), and the Real in relation to Creation. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب تین سو تریسٹھ: عارف کے اس مقام کی معرفت میں جہاں وہ اس چیز کو جو وہ نہیں جانتا، اپنے سے کم درجے والے کی طرف منسوب کر دیتا ہے تاکہ وہ اسے وہ چیز سکھائے جو اس کے بس میں نہیں کہ وہ اسے سکھائے، اور باری تعالیٰ (الباري) کو طرب (خوشی) اور فرح (مسرت) سے منزہ قرار دینے کے بیان میں۔\n\nمیزانیں حساب کے لیے رکھی گئیں،\n(وضع الموازين للحساب *** جاء به ناطق الكتاب‏)\nاسے کتاب ناطق (قرآن) لے کر آئی ہے۔\n\nیہ ذات کی کتاب ہے بغیر قلم کے،\n(كتاب ذات بلا يراع *** ولا مداد ولا اكتساب‏)\nاور نہ سیاہی کے، اور نہ کسب (حصول) کے۔\n\nنہ صفات ہیں، نہ نعتیں،\n(ولا صفات ولا نعوت *** ولا ذهاب ولا إياب‏)\nنہ جانا ہے اور نہ واپس آنا ہے۔\n\nپس اگر وہ توبہ کرے اس چیز سے جو اسے لاحق ہوئی،\n(فإن يتب للذي اعتراه *** قابلة قابل المتاب‏)\nتو توبہ قبول کرنے والا اسے قبول کر لیتا ہے۔\n\nاس کا شکر طلب کرنے والا ہانڈیوں میں،\n(طالبه الشكر في قدور *** وفي جفان مثل الجوابي‏)\nاور بڑے پیالوں میں ہے جو حوضوں کی مانند ہیں۔\n\n### [عقلی توحید یعنی توحید افعال (توحيد الأفعال)]\n\nیہ عقلی توحید (التوحيد العقلي) کا مقام ہے، یعنی توحید افعال (توحيد الأفعال)، کہ اللہ کے سوا کوئی فاعل نہیں۔ یہ ایک شریف مقام ہے۔ جان لو کہ عالم اپنی عدم (عدم) کی حالت میں ہمیشہ واجب الوجود (الواجب الوجود) کا مشاہدہ کرتا رہا ہے، کیونکہ وہ ہمیشہ ترجیح دینے والے عدم (عدم مرجح) میں تھا اور اس کی عین (عين) ثابت تھی۔ ذات حق (الحق) نے اس کی عدم کی حالت میں اسے سننے اور اطاعت کرنے سے متصف کیا، لہٰذا اس پر مشاہدے کا اضافہ محال نہیں ہوا۔ اسی لیے موجود ہونے کی حالت میں ممکنات (الممكنات) میں سے کسی نے بھی اس کا انکار نہیں کیا۔ مگر یہ موجود انسانی (الموجود الإنساني) ہی ہے جو عالم میں سے اکیلا ہے جس نے اپنے بعض کو اس کے ساتھ شریک کر دیا، ان لوگوں میں سے جن پر طبع (الطبع) کا حجاب غالب آ گیا، اور وہ یہ ہے کہ وہ اصالتاً صرف اسی رب کی عبادت کرنے، سننے اور اطاعت کرنے کا عادی ہے جس کا وہ شہود (الشہود) کرتا ہے۔ اور اس معبود کو طبع (الطبع) کے حجاب نے اس کے لیے غیب بنا دیا، پس اس نے ان موجودات میں سے جن کا وہ مشاہدہ کرتا اور دیکھتا ہے، کسی کو اپنا معبود بنا لیا، خواہ وہ عالم سماوی (العالم السماوي) سے ہوں جیسے ستارے، یا عالم اسفل (العالم الأسفل) سے جیسے عناصر یا وہ چیزیں جو ان سے پیدا ہوئیں، اور انہیں رب بنا کر اس مشاہدے پر ان کی عبادت کی جس کا وہ عادی تھا اور جس سے اس کا نفس مطمئن ہو گیا تھا۔ اور اس نے اپنے گمان میں یہ خیال کیا کہ وہ معبود جسے اس نے اپنا خدا بنایا ہے، ذات حق (الحق) کا مشاہدہ کرتا ہے اور وہ اس سے زیادہ قریب ہے، پس اس نے اس کی خدمت میں اپنی ذات کو اس لیے وقف کر دیا تاکہ وہ اسے اللہ عزوجل کے قریب کر دے، جیسا کہ اللہ نے ان کے بارے میں خبر دی کہ انہوں نے کہا: \"ما نَعْبُدُهُمْ\" (ہم ان کی عبادت نہیں کرتے) یعنی ان معبودوں کی جنہیں انہوں نے عبادت کے لیے اختیار کیا تھا \"إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى\" (مگر اس لیے کہ وہ ہمیں اللہ کے قریب کر دیں، قربت کے ساتھ)۔ پس انہوں نے \"زلفی\" (قربت) کے ذریعے اس بات کی تاکید کی۔ اور یہ سب نظر اور اجتہاد (اجتہاد) کی بنا پر تھا۔ پھر انہوں نے دیکھا کہ الٰہی نازل شدہ شریعتوں کے پیروکاروں نے لوگوں کو سجدہ کرنے، چہروں کو زمین پر رکھنے، رکوع کرنے اور ایک معین سمت میں اللہ کے قرب کی راہ پر استقبال کرنے کا پابند کیا، اور ایک پتھر کو چومنے کا حکم دیا جسے انہوں نے کہا کہ یہ اللہ کا دایاں ہاتھ ہے، اور وہ ایسی شعائر اور علامات لے کر آئے جو نئی تھیں اور جنہیں انہوں نے اللہ کی طرف منسوب کیا، اور ہمارے ان شعائر اور مناسک کی تعظیم کو تقویٰ قلوب (تقوى القلوب) میں سے قرار دیا، اور جب یہ تعظیم ہم سے ظاہر ہوئی تو انہوں نے اس کے ساتھ ہماری سعادت کو جوڑ دیا، پس اس چیز نے ان کے اس اعتماد میں اضافہ کر دیا جو انہوں نے اپنے معبودوں اور شریعتوں کے بارے میں مقرر کیا اور قائم کیا۔\n\nاور انہوں نے اس میں کوئی فرق نہیں کیا جو اللہ نے اپنی مخلوق میں وضع کیا ہے اور جو انہوں نے خود اپنے لیے وضع کیا ہے۔ اور ہماری گفتگو ان ائمہ کے ساتھ ہے جو پہلی نظر (النظر الأول) کے حامل تھے جنہوں نے ان چیزوں کو اللہ عزوجل کے قرب کی راہ پر اپنا معبود بنایا۔ پھر جس چیز سے وہ دھوکہ کھا گئے وہ یہ تھا کہ انہوں نے الٰہی شریعتوں میں دیکھا اور سنا کہ مجتہد (المجتهد) کی سعادت مطلق ہے، خواہ وہ غلطی کرے یا درست ہو، تو اس کے حق میں نظر (نظر) کو پورا کرنے کے بعد اس کا اجر یقینی ہے، اور اس کے گمان میں اجتہاد (اجتہاد) اس استعداد کے مطابق ہے جو اللہ نے اسے اس کی ذات میں عطا کی ہے۔ پس انہوں نے اس چیز میں جو برہان (برهان) نہیں تھا، یہ خیال کیا کہ وہ ان کے مطلوب پر برہان ہے۔ پس انہوں نے کسی کو خدا نہیں بنایا مگر اپنے گمان میں برہان کی بنا پر، اور یہی اللہ کا قول ہے: \"ومن يَدْعُ مَعَ الله إِلهاً آخَرَ لا بُرْهانَ لَهُ به\" (اور جو اللہ کے ساتھ کسی دوسرے معبود کو پکارتا ہے، اس کے پاس اس کی کوئی دلیل نہیں ہے) یعنی ان کے گمان میں۔ پس اس سے یہ ظاہر ہوا کہ جس کے لیے اس کی نظر میں برہان قائم ہو جائے تو وہ مؤاخذہ نہیں کیا جائے گا، اگرچہ وہ غلطی کرے، کیونکہ غلطی اس کا مقصود نہیں تھی، بلکہ اس کا مقصد حق کو اس کی اصل حالت پر پانا تھا۔ اور اس سب کی اصل یہ ہے کہ وہ کسی غیب (غيب) کی عبادت نہ کرے، کیونکہ اصالتاً وہ اس کا عادی نہیں ہے۔\n\nاور اسی لیے جبرائیل علیہ السلام لائے گئے تاکہ نبی صلی اللہ علیہ وسلم اور آپ کے صحابہ کو سکھائیں کہ معاملہ کیا ہے، وہ ایک اعرابی کی صورت میں آئے۔ پس نبی صلی اللہ علیہ وسلم نے فرمایا: کیا تم جانتے ہو یہ کون ہے؟ یا فرمایا: اس شخص کو میرے پاس واپس لاؤ۔ پس تلاش کیا گیا مگر وہ نہ ملا۔ پھر جب وہ پیٹھ پھیر کر چلا گیا تو نبی صلی اللہ علیہ وسلم نے اپنے صحابہ سے فرمایا: یہ جبرائیل تھے جو لوگوں کو ان کا دین سکھانے آئے تھے۔ اور جو کچھ انہوں نے آپ سے پوچھا تھا، اس میں یہ بھی تھا کہ انہوں نے پوچھا: احسان (الإحسان) کیا ہے؟ تو نبی صلی اللہ علیہ وسلم نے جواب میں فرمایا: \"أن تعبد الله كأنك تراه\" (تم اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو)، کیونکہ آپ جانتے تھے کہ غیب (غيب) پر عبادت کرنا نفوس پر مشکل ہے۔ پھر آپ نے بات مکمل کی اور فرمایا: \"فإن لم تكن تراه فإنه يراك\" (پس اگر تم اسے نہیں دیکھتے تو وہ تمہیں دیکھتا ہے۔)\n\nیعنی اپنے نفس میں یہ حاضر رکھو کہ وہ تمہیں دیکھ رہا ہے، اور یہ شہود (الشہود) کی ایک دوسری قسم ہے جو حجاب کے پیچھے سے ہے، تم جانتے ہو کہ تمہارا معبود تمہیں دیکھتا ہے جہاں سے تم اسے نہیں دیکھتے اور تمہیں سنتا ہے۔ پس شریعت ہمارے پاس اس سب میں صرف وہی لے کر آئی جس میں ان لوگوں کے لیے دھوکہ تھا اور جس پر ان کا انحصار تھا۔ اسی لیے اللہ تعالیٰ نے فرمایا: \"يُضِلُّ به كَثِيراً ويَهْدِي به كَثِيراً\" (وہ اس کے ذریعے بہت سے لوگوں کو گمراہ کرتا ہے اور بہت سے لوگوں کو ہدایت دیتا ہے) اور فرمایا: \"يُضِلُّ من يَشاءُ ويَهْدِي من يَشاءُ\" (وہ جسے چاہتا ہے گمراہ کرتا ہے اور جسے چاہتا ہے ہدایت دیتا ہے)۔ اور وہی ہے جو نظر (نظر) میں درستگی عطا کرتا ہے اور وہی ہے جو غلطی عطا کرتا ہے۔ پس اس سب کے مضمون سے یہ نتیجہ نکلا کہ عبادت عابد سے صرف مشہود (مشهود) یا مشہود کی مانند چیز سے متعلق ہوتی ہے، غیب (غيب) کی طرف کوئی راستہ نہیں۔ اور یہ اللہ کی خفیہ رحمتوں اور اس کے لطف میں سے ہے۔ اور جو لوگ ہم نے ذکر کیے ہیں ان میں سے صرف مقلدین (المقلدة) ہی باہر نکلے ہیں، پس ان کے ساتھ شقاوت (بدبختی) کو جوڑ دیا گیا ہے۔ پس اللہ نے ان کے لیے نازل شدہ شریعت میں اپنی رحمت سے ایک سہارا بنایا جس پر وہ بھروسہ کرتے ہیں، چنانچہ فرمایا: \"فَسْئَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لا تَعْلَمُونَ\" (پس اگر تم نہیں جانتے تو اہل ذکر سے پوچھ لو)۔ اور اہل ذکر (أهل الذكر) اہل قرآن ہیں، کیونکہ اللہ تعالیٰ فرماتا ہے: \"إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ\" (بیشک ہم نے ہی ذکر یعنی قرآن نازل کیا ہے)۔ اور وہ اہل اجتہاد (أهل الاجتهاد) ہیں، اور ان میں سے کچھ درست ہوتے ہیں اور کچھ غلطی کرتے ہیں۔ پس جب مقلد (المقلد) اہل اجتہاد میں سے کسی غلطی کرنے والے سے پوچھتا ہے اور اس کے فتوے پر عمل کرتا ہے، تو وہ ماجور (اجر والا) ہوتا ہے، کیونکہ اسے سوال کرنے کا حکم دیا گیا ہے۔ پس مقلد نے بھروسہ کیا، اور وہ نظار (غور و فکر کرنے والے) جنہوں نے اصول میں اپنی نظر میں غلطی کی، باوجود اس کے کہ انہوں نے اپنی استعداد کے مطابق وہ سب کچھ پورا کیا جو انہیں ان کے معبودوں کو اللہ کے سوا اختیار کرنے کے بارے میں فتویٰ دینے پر مجبور کرتا تھا، اگرچہ انہوں نے غور و فکر نہیں کیا، تو اللہ نے کسی نفس کو اس کی وسعت (وسع) سے زیادہ مکلف نہیں کیا، اور وہ وہی ہے جو اس نے اس میں رکھا ہے۔ پس اس کی رحمت ائمہ اور مقتدیوں سب پر عام ہو گئی۔ پس عالم میں موحد (موحد) کے سوا کوئی نہیں، یعنی ایک پر بھروسہ کرنے والا۔ اور تم نے اس بیان سے جان لیا کہ شرک (الشرك) کیا ہے اور مشرک (المشرك) کی صفت کیا ہے۔ اور اللہ نے ایک پہلو سے انہیں معذور قرار دیا، چنانچہ ان سے فرمایا: \"لا تَقْنَطُوا من رَحْمَةِ الله إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً\" (اللہ کی رحمت سے مایوس نہ ہو، بیشک اللہ تمام گناہوں کو بخش دیتا ہے)۔ یہ اس وقت ہے جب بندہ گناہ کا فعل کرنے کا ارادہ کرے اور یہ اعتقاد رکھے کہ وہ گناہ ہے، تو اس شخص کا کیا حال ہو گا جس نے گناہ کرنے کا ارادہ نہیں کیا بلکہ ایک شبہ کی بنا پر اسے قربت (قربت) کا ذریعہ بنا لیا؟ پس وہ مغفرت کا زیادہ حقدار ہے۔\n\nاور جہاں تک مشرکوں کے قطعی مؤاخذے کا تعلق ہے، اللہ کے اس قول کے ذریعے: \"إِنَّ الله لا يَغْفِرُ أَنْ يُشْرَكَ به\" (بیشک اللہ اس بات کو نہیں بخشتا کہ اس کے ساتھ شرک کیا جائے)، تو یہ قرینہ حال کی وجہ سے ظاہر ہے۔ اور جہاں تک لسانی طریقہ کا تعلق ہے، تو یہ وہی ہے جو واقع ہوا ہے، کیونکہ اللہ نے اہل شرک (أهل الشرك) پر شرک کو نہیں چھپایا، بلکہ وہ اس کے ساتھ ظاہر ہوئے ہیں۔ پس یہ اس چیز کی خبر ہے جو وجود (الوجود) میں شرک کے ظہور سے واقع ہوئی، اور اس کے علاوہ کو اس کے لیے چھپانا جسے وہ چاہتا ہے کہ چھپائے، کیونکہ وہاں ایسے امور ہیں جو نہ کسی آنکھ پر ظاہر ہوئے اور نہ کسی عقل پر۔ جیسا کہ جنت کے وصف میں آیا ہے: \"فيها ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\" (اس میں وہ کچھ ہے جو نہ کسی آنکھ نے دیکھا، نہ کسی کان نے سنا، اور نہ کسی بشر کے دل پر اس کا خیال گزرا)۔ لیکن قرائن احوال مشرکوں کے قطعی مؤاخذے پر دلالت کرتے ہیں۔ پھر اللہ سبحانہ نے یہ ذکر نہیں کیا کہ آخرت میں، یوم دین (یوم الجزاء) میں، ان پر حد قائم کرنے کے بعد ان کا معاملہ کیا ہو گا، پس وہ اپنے بعض معبودوں کے ساتھ جہنم میں داخل ہوں گے تاکہ وہ مشاہدہ (مشاہدہ) کر لیں کہ وہ معبود اللہ کے مقابلے میں ان کے کسی کام نہیں آئیں گے، کیونکہ انہوں نے انہیں اپنی نظر (نظر) سے اختیار کیا تھا نہ کہ الٰہی وضع سے۔ پس اے میرے ولی (ولي)، اللہ کے عدل اور فضل پر غور کرو، پس ہر حال میں اسی کے لیے حمد ہے۔ اور یہ ایک صحیح نبوی حمد ہے، کیونکہ ہر حال میں ثناء مشرک اور غیر مشرک سب کی طرف سے ہے۔ کیونکہ مشرک نے جیسا کہ ہم نے کہا، عظمت اور کبریائی صرف اللہ کے لیے رکھی، اور معبودوں کو دربانوں اور حجابوں کی طرح بنایا، پس انہوں نے ان کی عبادت صرف اس کی خاطر کی، اگرچہ انہوں نے ان کے بارے میں غلطی کی، تو انہوں نے صرف احدیت (الأحدية) میں غلطی کی۔ پس وہ بھی اللہ کے حامدین میں سے ہیں، کیونکہ وہ اس کی عظمت کی توحید (توحيد) اور ان حجابوں پر اسے ترجیح دینے کے ذریعے اللہ کی ثناء کرنے والے تھے۔ پس اپنی توجہ اللہ کی وسیع اور عام رحمت کی طرف رکھو جو اس نے اپنی مخلوق پر پھیلا دی ہے، ان شاء اللہ تم حق کی طرف رہنمائی پاؤ گے۔\n\nاور جہاں تک الٰہی شریعتوں کے پیروکاروں اور دیگر لوگوں میں اللہ کے بارے میں عقائد کے اختلاف کا تعلق ہے، تو اگر اللہ تعالیٰ عالم کو غلطی پر مؤاخذہ کرتا، تو وہ ہر صاحب عقیدہ کا مؤاخذہ کرتا، کیونکہ اس نے اپنے رب کو اپنی عقل اور اپنی نظر سے مقید (قيد) کر دیا ہے اور اسے محدود کر دیا ہے، حالانکہ اللہ کے لیے صرف اطلاق (الإطلاق) ہی مناسب ہے۔ کیونکہ \"بِيَدِهِ مَلَكُوتُ كُلِّ شَيْ‏ءٍ\" (ہر چیز کا ملکوت اسی کے ہاتھ میں ہے)۔ پس وہ مقید کرتا ہے اور خود مقید نہیں ہوتا۔ لیکن اللہ نے سب کو معاف کر دیا ہے۔ پس جو حق کو پانا چاہتا ہے اور اسے اس کا حق پورا دینا چاہتا ہے، اللہ اسے اس کے علم کی وسعت اور کشادگی کی توفیق دیتا ہے، اور یہ کہ وہ ہر معتقد کے اعتقاد کے وقت مشہود (مشهود) ہوتا ہے، اور معتقد کے اعتقاد کے وقت اس کا مفقود ہونا صحیح نہیں ہے، کیونکہ اس نے اپنے اعتقاد کو اس کے ساتھ جوڑ دیا ہے، اور \"هُوَ عَلى‏ كُلِّ شَيْ‏ءٍ شَهِيدٌ\" (اور وہ ہر چیز پر گواہ ہے)۔ پس اس علم کا حامل ذات حق (الحق) کو ہمیشہ اور ہر صورت میں دیکھتا ہے، پس جب وہ اسے مقید کرنے والے کی طرف سے انکار کیا جاتا ہے تو وہ اس کا انکار نہیں کرتا۔ اس کے باوجود، اللہ نے دین کے ائمہ میں سے ہر اس شخص کو معاف کر دیا جس نے اسے تنزیہ (تنزيه) یا تشبیہ (تشبيه) کے ذریعے مقید کیا۔ پھر نبی صلی اللہ علیہ وسلم کے پاس مشرکوں کے حق میں اللہ عزوجل کی گواہی پر غور کرو: \"ولَئِنْ سَأَلْتَهُمْ من خَلَقَهُمْ لَيَقُولُنَّ الله\" (اور اگر تم ان سے پوچھو کہ انہیں کس نے پیدا کیا تو وہ ضرور کہیں گے: اللہ)۔ یہ ایک عجیب تنبیہ ہے۔\n\nاور جب ان سے کہا گیا: \"اسْجُدُوا لِلرَّحْمنِ\" (رحمن کو سجدہ کرو)، تو انہوں نے اس کی کوئی عین (عين) نہیں دیکھی اور وہ اسے صرف اللہ کے نام سے ہی جانتے تھے، اور انہیں یہ معلوم نہیں تھا کہ وہ رحمن (الرحمن) کے نام کا عین (عين) ہے۔ پس انہوں نے رحمن کے بارے میں یہ خیال کیا کہ وہ اللہ کا شریک ہے، چنانچہ انہوں نے اس کا انکار کر دیا، اور انہوں نے اس کا انکار ان لوگوں کے بارے میں نہیں کیا جنہیں انہوں نے معبود بنایا تھا جیسا کہ ہم نے مقرر کیا، کیونکہ وہ ان کے ناموں سے واقف تھے جنہیں انہوں نے اللہ کے سوا معبود بنایا تھا، پس وہ ان کے ناموں سے جانتے تھے کہ وہ حقیقت میں الوہیت (الألوهة) میں اس کے جیسے نہیں ہیں، کیونکہ ان کے نزدیک اس کے لیے عظمت اور کبریائی کی توحید (توحيد) ہے۔ اور رحمن کو سجدہ کرنے کے ذریعے اللہ نے انہیں غیب (غيب) کی عبادت کی طرف رہنمائی کی، پس انہوں نے کہا: \"قالُوا وما الرَّحْمنُ أَ نَسْجُدُ لِما تَأْمُرُنا وزادَهُمْ نُفُوراً\" (انہوں نے کہا: رحمن کیا ہے؟ کیا ہم اسے سجدہ کریں جس کا تم ہمیں حکم دیتے ہو؟ اور اس نے ان کی نفرت میں اضافہ کر دیا)، کیونکہ انہوں نے غیب میں صرف ایک ہی خدا کو جانا تھا۔ پس اللہ نے اپنے نبی صلی اللہ علیہ وسلم سے فرمایا: \"ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏\" (اللہ کو پکارو یا رحمن کو پکارو، تم جس نام سے بھی پکارو، اسی کے لیے سب اچھے نام ہیں)۔ پس وہ اس پر انتہائی تعجب میں پڑ گئے، کیونکہ انہوں نے یہ خیال کیا کہ رحمن کا نام اللہ کا نام نہیں ہے، اگرچہ ہر ایک کے لیے اسماء حسنیٰ (الأسماء الحسنى) ہیں۔ اور یہ اس لیے ہوا کہ اللہ نے ان کی بصیرتوں کو اندھا کر دیا اور ان کے پردوں کو گاڑھا کر دیا، پس انہوں نے اللہ کی طرف سے جو کچھ ان کے حق میں نازل کیا گیا تھا، اسے نہیں سمجھا۔ اور ذات حق (الحق) نے اس کو بھی ان کے لیے ایک سہارا بنا دیا، جب وہ ان کے پاس ایک ایسے نام کے ساتھ آیا جو ایک ایسے مسمیٰ (مسمى) کا طالب تھا جس کی یہ علامت وہ نہیں جانتے تھے، جبکہ اہل اللہ اور اس کے خاص بندے یہ جانتے تھے۔\n\nپس اللہ، رب، رحمن اور ملک (بادشاہ)،\n(فالله والرب والرحمن والملك *** حقائق كلها في الذات تشترك‏)\nیہ سب حقائق ہیں جو ذات (الذات) میں شریک ہیں۔\n\nپس عین (العين) ایک ہے اور حکم مشترک ہے،\n(فالعين واحدة والحكم مشترك *** لذا بدا الجسم والأرواح والفلك‏)\nاسی لیے جسم، ارواح اور فلک ظاہر ہوئے۔\n\nاور یہ سب ہمارے خالق اور ہمارے درمیان آلات ہیں،\n(وكلها أدوات بين خالقنا *** وبيننا ولهذا يضمن الدرك‏)\nاور اسی لیے ادراک (درک) کی ضمانت دی جاتی ہے۔\n\nرحمن کے تمام رسول انہیں لے کر آئے،\n(جاءت بها رسل الرحمن قاطبة *** مع الكتاب الذي قد ساقه الملك‏)\nاس کتاب کے ساتھ جسے فرشتہ (الملک) لے کر آیا۔\n\n### [بیشک اللہ کی معرفت کے دو راستے ہیں]\n\nاور جان لو کہ اللہ کی معرفت (العلم بالله) کے دو راستے ہیں: ایک راستہ وہ ہے جسے عقل (العقل) شریعت (الشرع) کے ثابت ہونے سے پہلے خود ادراک کر لیتی ہے، اور یہ اس کی الوہیت (الوهته) میں اس کی احدیت (أحديته) سے متعلق ہے، اور یہ کہ اس کا کوئی شریک نہیں ہے، اور یہ کہ واجب الوجود (الواجب الوجود) الٰہ کے لیے کیا ہونا ضروری ہے۔ اور اس کا تعلق اللہ تعالیٰ کی ذات (ذات) کی معرفت سے نہیں ہے۔ اور جس نے اپنی عقل کے ذریعے اللہ کی ذات کی معرفت حاصل کرنے کی کوشش کی، اس نے ایک ایسے امر کی کوشش کی جس سے وہ عاجز ہے اور اس میں سوءِ ادب کا مرتکب ہوا، اور خود کو ایک عظیم خطرے میں ڈال دیا۔ اور یہ وہی راستہ ہے جس کے بارے میں خلیل ابراہیم علیہ السلام نے اپنی قوم سے فرمایا: \"أُفٍّ لَكُمْ ولِما تَعْبُدُونَ من دُونِ الله أَ فَلا تَعْقِلُونَ\" (افسوس ہے تم پر اور ان پر جن کی تم اللہ کے سوا عبادت کرتے ہو، کیا تم عقل نہیں رکھتے؟)۔ پس انہوں نے انہیں اس بات پر متنبہ کیا کہ اللہ کی معرفت اس حیثیت سے کہ وہ اپنی الوہیت میں ایک الٰہ ہے، عقلوں کے مدرکات میں سے ہے۔ پس انہوں نے انہیں صرف ایک ایسے امر کی طرف رجوع کیا جس میں غور و فکر کرنا صحیح ہے تاکہ وہ اپنی نظر سے جان لیں کہ معاملہ کیا ہے۔ اور دوسرا راستہ شریعت (الشرع) کے ثابت ہونے کے بعد کا راستہ ہے، پس وہ وہی کچھ لے کر آئی جو عقل اپنی دلیل کی جہت سے لائی تھی، اور وہ اپنے خالق کی احدیت (أحدية) کا اثبات اور جو کچھ اس کے لیے عزوجل واجب ہے۔ اور علم باللہ کا دوسرا مسلک اس علم سے متعلق ہے کہ وہ اپنی ذات میں کیا ہے۔ پس اس نے اس کا وصف بیان کیا، بعد اس کے کہ عقل نے اپنی دلیل سے اس کی عصمت کا حکم دیا اس چیز میں جو وہ اپنے رب کی طرف سے اس کے بارے میں خبر دیتا ہے، اس کے ساتھ \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" (اس کی مثال کوئی چیز نہیں ہے) اور یہ کہ اس کے لیے کوئی مثال نہ دی جائے، بلکہ وہی مثالیں بیان کرتا ہے، کیونکہ وہ جانتا ہے اور ہم نہیں جانتے۔ پس اس نے اللہ تعالیٰ کی طرف ایسے امور منسوب کیے جنہیں عقل اپنی دلیل کی رو سے اس کی طرف منسوب نہیں کر سکتی، اور نہ ہی وہ اسے رد کر سکتی ہے جس کے پاس اس کی عصمت پر عقلی دلیل قائم ہو چکی ہے۔ پس اس نے اسے دونوں راستوں کے درمیان حیرت میں ڈال دیا۔ اور دونوں راستے صحیح ہیں، ان میں سے کسی ایک پر بھی طعن کرنا ممکن نہیں ہے۔\n\nپس عقلاء (العقلاء) میں سے کچھ نے تنزیہ (تنزيه) اور تائید کی تاویل کی، اور اپنی تاویل کو \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" اور اس کے قول \"وما قَدَرُوا الله حَقَّ قَدْرِهِ\" (اور انہوں نے اللہ کی قدر نہیں کی جیسا کہ اس کی قدر کرنے کا حق تھا) سے تقویت دی۔ اور عقلاء میں سے کچھ نے اس علم کو اس شخص کے سپرد کر دیا جو اسے لایا تھا یا اللہ کے سپرد کر دیا۔ اور اہل لسان (اہل زبان) میں سے کچھ عقلاء نے تشبیہ (تشبيه) دی، اور اللہ نے ہر گروہ کو معذور قرار دیا۔ اور اس نے اپنے بندوں سے اپنے حق میں صرف یہ طلب کیا کہ وہ جان لیں کہ وہ ایک الٰہ ہے، اپنی الوہیت (الوهته) میں اس کا کوئی شریک نہیں، اور بس۔ اور یہ کہ \"لِلَّهِ الْأَسْماءُ الْحُسْنى‏\" (اللہ کے لیے اچھے نام ہیں) ان معانی کے ساتھ جو زبان میں ان کے لیے ہیں۔ اور اس نے نجات اور سعادت کو اس شخص کے ساتھ جوڑ دیا جو اس چیز پر ٹھہر گیا جو اس کی طرف سے اس کی کتابوں میں اور اس کے رسولوں کی زبانوں پر آئی۔\n\nجب ذات حق (الحق) نے اپنی کتابوں میں خود اپنے بارے میں واضح کر دیا، تو اعتقاد رکھو۔\n(إذا أبان الحق عن نفسه *** بنفسه في كتبه فاعتقد)\n\nتو اس میں ہم پر کوئی حرج نہیں،\n(فما علينا من جناح به *** وذلك العلم به فاعتقد)\nاور اس علم پر اعتقاد رکھو۔\n\nکیونکہ اس کے علم میں عقل کا حصہ وہ ہے جو عدد کے وجود کی نفی کرتا ہے۔\n(فإن حظ العقل من علمه *** به الذي ينفي وجود العدد)\n\nاور یہ کہ وہ اپنے معاملے میں واحد ہے،\n(وإنه في شأنه واحد *** وإنه الله الذي لَمْ يَلِدْ)\nاور یہ کہ وہ اللہ ہے جس نے نہ کسی کو جنا۔\n\nاور اسی طرح \"لَمْ يُولَدْ\" (نہ وہ جنا گیا)، اور جو اپنی عقل سے اس کا ارادہ کرے، اپنے فکر سے زیادہ نہ کرے۔\n(كذاك لَمْ يُولَدْ ولمن رامه *** بعقله عن فكره لا تزد)\n\nاور اے میرے ولی (ولي)، اس کی برہان (برهان) عقلاء نظار (غور و فکر کرنے والے عقلاء) کے اس کے بارے میں مختلف اقوال اور ہر اس شخص کے اقوال کا اتفاق ہے جو اس کی طرف سے آیا، خواہ وہ رسول ہو، نبی ہو یا ولی (ولي)، اور ہر وہ شخص جو اللہ کے بارے میں خبر دیتا ہے۔ اور اگر مؤمنین میں سے عاقل اپنی کتاب میں اس کے قول \"ولَمْ يُولَدْ\" (اور نہ وہ جنا گیا) کے معنی پر ٹھہر جاتا اور جان لیتا کہ جو کچھ عقل نے اپنی دو مقدمات کو جوڑ کر اپنے فکر سے نتیجہ نکالا ہے، وہ نتیجہ عقل کے لیے ولادت ہے اور وہ اس سے مولود (جنا ہوا) ہے، اور اس نے ولادت کی نفی کی ہے، تو ایمان کہاں رہا؟ اور مولود (المولود) اس کی عین (عين) کے سوا کچھ نہیں ہوتا، برخلاف اس کے جب عقل اس کے لیے احدیت (الأحدية) کی نسبت کا نتیجہ نکالتی ہے، تو واحد کے لیے احدیت کی معقولیت اس کی عین (عين) نہیں ہے جس کی طرف احدیت منسوب کی گئی ہے۔ پس عقل کے لیے احدیت پر ولادت ہے، اور اس پر بھروسہ کرنے پر ولادت ہے، اور ہر حال میں اس کی عین (عين) پر اس کے لیے ولادت نہیں ہو گی۔ لیکن اس کی ہویت (ہویته) اور اس کی حقیقت (حقيقته) پر عقل کے لیے کوئی ولادت نہیں ہے، اور اس نے اپنے قول \"ولَمْ يُولَدْ\" کے ذریعے اس کی نفی کی ہے۔ اور یہاں سے تم جان سکتے ہو کہ ہر عاقل جس کا اللہ کی ذات کے بارے میں کوئی قول ہے، اس نے صرف اس کی عبادت کی ہے جسے اس کی عقل نے جنا ہے۔ پس اگر وہ مؤمن ہے تو یہ اس کے ایمان میں طعن ہے، اور اگر وہ مؤمن نہیں ہے تو اس کے لیے اتنا ہی کافی ہے کہ وہ مؤمن نہیں ہے، خاص طور پر محمد صلی اللہ علیہ وسلم کی عام بعثت اور اس کے تمام آفاق تک پہنچنے کے بعد۔\n\nاور بیشک اللہ کے ایسے بندے ہیں جنہوں نے اپنے ایمان پر عمل کیا اور اپنے احوال میں اللہ کی تصدیق کی، پس اللہ نے ان کی بصیرت کی آنکھیں کھول دیں اور ان کے باطن میں ان پر ظہور الٰہی (التجلی) فرمایا، پس انہوں نے شہود (الشہود) کے ذریعے اسے پہچانا، اور وہ اپنی اس معرفت (معرفت) میں بصیرت اور بینہ پر تھے، جس کی گواہی ان میں سے رسول (الرسول) نے دی جو ان کی طرف مبعوث کیے گئے تھے، کیونکہ اللہ نے رسولوں کو ان کی امتوں پر اور ان کی امتوں کے لیے گواہ بنایا ہے۔ پس اس مؤمن کے اپنے رب کی طرف سے بینہ پر ہونے کے باوجود، جب اس پر ظہور الٰہی (تجلی) ہوا، تو اس حال میں اس کے رسول نے اس کی پیروی کی، پس اس نے اسے شہود (الشہود) میں ایک آئینہ بنا کر کھڑا کر دیا اور اس سے کہا: یہ وہ ہے جس کی طرف سے میں تمہارے پاس آیا ہوں۔ پس جب اس نے اسے دیکھا تو اس کے بعد ظہور الٰہی (التجلی) کی صورتوں کے اختلاف کے باوجود اس کا انکار نہیں کیا۔ پس کبھی کبھار اس حال والے مؤمنین میں سے اس کے بارے میں کنایہ کیا جاتا ہے جس کا وصف اس نے اپنی کتابوں میں یا اپنے رسولوں کی زبانوں پر بیان کیا، یا اس کے رسولوں نے اس کا وصف بیان کیا۔ پس عاقل مؤمن نے اللہ کی کتاب اور رسول کے قول سے اس پر ایمان لایا، اور اس حال والے مؤمن متبع (پیروی کرنے والے) کے قول سے کفر کیا، جو اس کا بھائی مؤمن ہے۔\n\nاور غیر مؤمنین وہ ہیں جو \"يَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّ\" (ناحق نبیوں کو قتل کرتے ہیں) اور \"يَقْتُلُونَ الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ من النَّاسِ\" (اور ان لوگوں کو قتل کرتے ہیں جو لوگوں میں انصاف کا حکم دیتے ہیں)، اور وہ وارث (الورثة) ہیں جنہوں نے بصیرت (بصيرة) پر اللہ کی طرف دعوت دی جیسا کہ رسولوں نے دعوت دی۔ اللہ تعالیٰ نے نبی صلی اللہ علیہ وسلم کے بارے میں فرمایا: \"أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي\" (میں اللہ کی طرف بصیرت پر بلاتا ہوں، میں بھی اور وہ بھی جنہوں نے میری پیروی کی)۔ اور یہاں بصیرت (البصيرة) کا معنی وہی ہے جو ہم نے ذکر کیا، یعنی کشف (کشف) پر، جیسے رسولوں کا کشف۔ پس اس مؤمن نے رسول کی بات پر کیسے ایمان لایا اور بعینہٖ اس مؤمن بھائی کی بات کا کفر کیا جو رسول اللہ صلی اللہ علیہ وسلم کا متبع ہے جب وہ اسے لے کر آیا؟ کم از کم یہ ہے کہ وہ اسے اس سے نقل کرتے ہوئے لے لے۔ اور ہم نے کسی بھی الٰہی کشف (کشف) کے حامل مؤمن کے بارے میں نہ دیکھا اور نہ سنا کہ اس کا کشف ان چیزوں کے خلاف ہو جو رسول مکمل طور پر لائے تھے، اور تم اسے نہیں پاؤ گے۔ پس تم نے اللہ کی عین (عين) کی معرفت میں عقلاء (العقلاء) اور رسولوں اور اولیاء (الأولياء) کے درمیان اور اس بارے میں نازل شدہ کتابوں کے درمیان فرق جان لیا۔ پس مؤمن اس چیز پر ہے جو اسے اس کے راستے نے عطا کی، اور عاقل اس چیز پر ہے جو اسے اس کی دلیل نے عطا کی۔\n\nاور عقل کا حکم اس کے حکم کے مقابلے میں کہاں؟\n(وأين حكم العقل من حكمه *** سبحانه جل على نفسه‏)\nوہ پاک ہے، اپنی ذات پر بلند ہے۔\n\nہائے، اسے اس کے سوا کوئی نہیں جانتا،\n(هيهات لا يعرفه غيره *** إلا به إذ ليس من جنسه‏)\nمگر اسی کے ذریعے، کیونکہ وہ اس کی جنس سے نہیں ہے۔\n\nاور عقل نے اپنے معبود کو،\n(والعقل قد أدخل معبوده *** بفكره القاصر في حبسه‏)\nاپنی قاصر فکر کے ذریعے اپنی قید میں ڈال دیا۔\n\nاور کہا: یہ میرا بیٹا ہے، میں نے اسے اپنے دل میں محفوظ رکھا ہے،\n(وقال هذا ولدي صنته *** في خلدي فهو على قدسه‏)\nپس وہ اپنی قدسیت پر ہے۔\n\nیہ حال کی بات ہے، پس جب وہ \"لاحول\" پڑھتے ہیں،\n(كلام حال فإذا حوقلوا *** قالوا تعالى الله في نفسه‏)\nتو کہتے ہیں: اللہ اپنی ذات میں بلند ہے۔\n\nپس میرا خالق میرے لیے مخلوق ہے، پس غور کرو،\n(فخالقي المخلوق لي فاعتبر *** في فرعه الأعلى وفي رأسه‏)\nاس کی اعلیٰ شاخ میں اور اس کے سر میں۔\n\nپس تم اس عبادت الٰہی کو لازم پکڑو جو شریعت (الشرع) لے کر آئی ہے اور جو سمع (سماعت) سے وارد ہوئی ہے، اور اس چیز کا کفر نہ کرو جو تمہاری دلیل نے تمہیں دی ہے جو اس کی تصدیق کی طرف لے جاتی ہے۔ اور آخری بات یہ ہے کہ تم اس کے لیے اور اس کے جیسے لوگوں کے لیے اس کے رب کے بارے میں ان کے قول کو تسلیم کر لو، اس کی سچائی کے ثابت ہونے اور مؤمن کے اس کی پیروی پر ثابت قدم رہنے کی وجہ سے۔ پس جب تم معاملے میں انصاف کرو گے اور جان لو گے کہ رسولوں علیہم السلام نے اللہ کے حق میں کیا کہا ہے، تو تم اس معرفت (معرفت) سے ایک نفحہ (خوشبو) مؤمنین متبعین (پیروی کرنے والوں) کے دلوں پر ڈالنے کی اجازت دو گے جو انہیں نطق (بولنے) میں موافقت کی طرف لے جائے گی، اور یہ کہ جہاں حق کی زبان ہے، تو تم اسے فرع (فرع) میں بھی تسلیم کرو گے جیسا کہ تم نے اسے اصل (اصل) میں موافقت کے جامع کی وجہ سے تسلیم کیا ہے۔ اور کفران (انکار) سے بچو، کیونکہ یہ محرومی کی انتہا ہے، پس تم ان لوگوں میں سے ہو جاؤ گے \"الَّذِينَ آمَنُوا بِالْباطِلِ وكَفَرُوا بِاللَّهِ أُولئِكَ هُمُ الْخاسِرُونَ\" (جنہوں نے باطل پر ایمان لایا اور اللہ کا کفر کیا، وہی خسارہ پانے والے ہیں)۔ پس تم اپنے رب کی عبادت کرو جس کا وصف شریعت میں بیان ہوا ہے، \"حَتَّى يَأْتِيَكَ الْيَقِينُ\" (یہاں تک کہ تمہیں یقین آ جائے)، پس پردہ ہٹ جائے گا اور بصارت تیز ہو جائے گی، پس تم وہی دیکھو گے جو اس نے دیکھا اور وہی سنو گے جو اس نے سنا، پس تم تشریعی نبوت کے بغیر، بلکہ ایک سچی وراثت (وراثة محققة) کے ذریعے، جو تصدیق کرنے والے اور پیروی کرنے والے نفس کے لیے ہے، اس کے درجے میں شامل ہو جاؤ گے۔ اور یہ ایک ایسا باب ہے جس میں افعال (الأفعال) کی وسعت کی وجہ سے میدان وسیع ہو جاتا ہے، کیونکہ توحید افعال (توحيد الأفعال) ان کی وسعت کے ساتھ وسیع ہوتی ہے۔ کیونکہ افعال کی نسبتیں ختم نہیں ہوتیں، بلکہ جب تک فاعل سے فعل ظاہر ہوتا ہے، وہ بڑھتی رہتی ہیں۔ اور اسی سے اللہ تعالیٰ کے اس قول میں مزید کا طلب کرنا ہے: \"رَبِّ زِدْنِي عِلْماً\" (اے میرے رب، میرے علم میں اضافہ فرما)۔ کیونکہ اس کے لیے ہر فعل میں ایک خاص ظہور الٰہی (تجلی) ہوتا ہے جو صرف اسی فعل کی عین (عين) کے لیے ہوتا ہے، اور اسی لیے ہر فعل اپنے ظہور الٰہی (تجلی) کی خصوصیت کی وجہ سے دوسرے سے ممتاز ہوتا ہے۔\n\nمیں نے اس حق کے بارے میں کہا جو میں نے کہا،\n(قد قلت في الحق الذي قلته *** لا ترعوي فيه ولا تأتلي‏)\nاس میں نہ پیچھے ہٹو اور نہ کوتاہی کرو۔\n\nکیونکہ یہ وہی حق ہے جو میرے پاس آیا،\n(فإنه الحق الذي جاءني *** من عنده وهو العليم الولي‏)\nاس کی طرف سے، اور وہ علیم (جاننے والا) اور ولی (مددگار) ہے۔\n\nتو میں اسے کیسے رد کر سکتا ہوں جبکہ وہ میرے لیے،\n(فكيف لي برده وهو لي *** مؤيد بكشفه كيف لي‏)\nاپنے کشف (کشف) سے مؤید ہے، میں کیسے کر سکتا ہوں؟\n\nاللہ تعالیٰ نے فرمایا: \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" (اس کی مثال کوئی چیز نہیں ہے)۔ پس اس نے فرض کیے گئے مثل (المثل) سے مماثلت کی نفی میں صفت کے کاف (کاف الصفة) کو لایا، اور اس کاف میں نفی کا عموم ہے یہاں تک کہ اس کے ساتھ کوئی مخصوص حال نہ جڑ جائے۔ کیونکہ اس میں غور و فکر کرنے والے کی آخری حد توقف ہے یہاں تک کہ وہ دیکھے کہ قرائن احوال اس میں کیا عطا کرتے ہیں۔ اور یہ عقلی دلیل (الدليل العقلي) کے حامل کا نشان ہے۔ لیکن یہ نفی اور مماثلت کے اثبات کے لیے عربی زبان میں آیا ہے۔ اور مماثلت (المماثلة) زبان میں اس مماثلت کے علاوہ ہے جسے عقلاء (العقلاء) نے اطلاق پر اصطلاح بنا لیا ہے۔ پس عاقل کو یہ تکلف کرنا پڑتا ہے کہ وہ اس پر دلیل لائے کہ ذات حق (الحق) نے عقلی مماثلت کا ارادہ کیا ہے، حالانکہ اہل لسان (اہل زبان) سے اس میں کوئی دلیل طلب نہیں کی جاتی، کیونکہ قرآن ان کی زبان میں نازل ہوا اور ان کی اصطلاح پر۔ اور ایسی چیز قیاس یا نظر (غور و فکر) سے ادراک نہیں کی جا سکتی، کیونکہ یہ متکلم کے ارادے کی طرف لوٹتی ہے، اور متکلم کے نفس میں کیا ہے یہ اس کے اپنے نفس کے اظہار کے بغیر معلوم نہیں ہو سکتا۔ اور اللہ تعالیٰ نے فرمایا: \"وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ\" (اور ہم نے کوئی رسول نہیں بھیجا مگر اس کی قوم کی زبان میں)۔ اور عرب عقلی مماثلت کو نہیں جانتے اور نہ ہی وہ اس کا انکار کرتے ہیں جب وہ اسے سنتے ہیں۔ اور ہر وہ لفظ جو اللہ تعالیٰ کے وصف میں وارد ہوا ہے اور لفظ مثل (المثل) اور حرف کاف الصفة (کاف الصفة) سے خالی ہے، وہ تشبیہ (التشبيه) کے آلات سے خالی ہو گیا اور مشترک الفاظ کے ساتھ مل گیا۔ اور جان لو کہ کاف الصفة (کاف الصفة) اور لفظ مثل (المثل) میں کوئی فرق نہیں ہے، اگرچہ اس حرف کے کچھ مقامات ہیں جن میں سے ایک مقام صفت کا ہے۔ پس جب یہ زبان میں صفت کے مقام پر وارد ہوتا ہے، اور وہ یہ ہے کہ تم کہو: \"زید عمرو جیسا ہے\"، تو عرب صرف فائدہ پہنچانا چاہتے ہیں۔ پس یہ محال ہے کہ تم ایسی بات لاؤ اور اس سے یہ ارادہ کرو کہ وہ انسانیت میں اس کے مماثل ہے، جو کہ عقلی مماثلت ہے، بلکہ تم یہ ارادہ کرتے ہو کہ وہ عمرو جیسا ہے، مثلاً سخاوت میں، یا شجاعت میں، یا فصاحت میں، یا علم میں، یا حسن میں، اور اسی طرح کی چیزیں جن پر حال نے سامع کے نزدیک اپنے قرینے سے دلالت کی تاکہ اسے فائدہ حاصل ہو۔ پس جب اللہ نے فرمایا: \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" تو یہ ضروری ہے کہ وہ کہے کہ کس چیز میں؟ یا قرینہ حال مجلس میں اس پر دلالت کرے۔ خاص طور پر جب اس نے مماثلت کی نفی کے بعد فرمایا: \"وهُوَ السَّمِيعُ الْبَصِيرُ\" (اور وہ سننے والا، دیکھنے والا ہے)۔ اور یہ دونوں صفات مخلوق میں متحقق ہیں۔ پس یہ ضروری ہے کہ تم اس چیز کو متحقق کرو جس کی نفی کی گئی ہے، اور یہ جانو کہ کیا یہ کاف الصفات (کاف الصفات) ہے یا اس کے علاوہ جو زبان اس سے طلب کرتی ہے جس کے لیے اس نے اسے وضع کیا ہے۔ پس اگر یہاں یہ کاف صفت ہے، تو اس نے صرف مثل (المثل) کی مماثلت کی نفی کی ہے کہ وہ مماثل ہو، پس اس نے اس کے لیے مثل کو اس ہاء کے ذریعے ثابت کیا جو \"مثله\" میں ہے، اور یہ ضمیر ذات حق (الحق) کی طرف لوٹتی ہے۔ اور یہ معلوم ہے کہ مثل (المثل) اپنے مماثل کی عین (عين) نہیں ہوتا، اور اگر وہ اس کی عین ہوتا جس کا وہ مثل ہے تو وہ اس کا مثل نہ ہوتا، نہ عقلی طور پر اور نہ شرعی طور پر۔ پس مثل کا وجود غیر (غیر) کے اثبات کی عین ہے، بلا شک۔ پس اگر مماثلت عام ہے تو وہ بلا شک عقلی ہے، اور زبان اس کا انکار نہیں کرتی، اور اگر وہ خاص ہے تو وہ اس چیز کے لیے حقیقت ہے جس کے لیے وہ خاص کی گئی ہے، نہ کہ مجازاً، جیسے \"زید سمندر جیسا ہے\" علم میں یا سخاوت میں اس کی وسعت کی وجہ سے۔ اور بعض علماء نے \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" میں کاف کو زائد (زائدہ) قرار دیا ہے۔ اگر یہ کسی معنی کے لیے آئی ہے تو یہ زائد نہیں ہے، کیونکہ وہ معنی جس کے لیے اسے لایا گیا ہے، مخاطب کے نفس میں اس کے بغیر ظاہر نہیں ہوتا اور نہ ہی حاصل ہوتا ہے۔ پس اس کا زائد ہونا ختم ہو گیا، کیونکہ اللہ نے کوئی چیز باطل یا عبث پیدا نہیں کی، اور بغیر معنی کے زائد ہونا عبث ہے۔ اور عرب کے لیے یہ محال ہے کہ وہ بغیر معنی کے زائد چیز لائے۔ پس جب وہ یہ حرف لاتے ہیں تو وہ کسی معنی کے لیے لاتے ہیں، پس وہ اسی کے لیے ہے جس کے لیے وہ اسے لائے ہیں۔ کیونکہ متکلم اس کلمے کو، جسے نحوی زائد کہتے ہیں، صرف تاکید (التوکید) کے ارادے سے لاتا ہے۔ پس جب وہ ہٹ جائے گی تو تاکید ختم ہو جائے گی۔ پس وہ زائد نہیں ہے، کیونکہ مؤکد کلام اس کے بغیر مکمل نہیں ہوتا اور نہ ہی اس کا قائم مقام کوئی چیز ہے۔ پس جب اللہ تعالیٰ نے مثل (المثل) کی نفی کی تاکید کی، تو وہ زائد نہیں ہے۔ پس اس نے مثل کی نفی کی تاکید کو اس شخص کے مقابلے میں رکھا جس نے اپنے گمان میں مثل کو فرضاً اور وجوداً ثابت کیا۔ اور اس کاف کے بارے میں صحیح بات یہ ہے کہ یہ قرائن احوال کی وجہ سے کاف الصفة (کاف الصفة) ہے، یعنی اگر اس کے لیے کوئی مثل فرض بھی کیا جائے تو وہ مثل اس کے مماثل نہیں ہو گا، تو پھر یہ اور بھی زیادہ مناسب ہے کہ وہ مماثل نہ ہو۔ پس یہ زبان میں مماثلت کی نفی میں زیادہ بلیغ ہے۔ پھر ہم اپنے اس قول میں \"قرائن احوال کی وجہ سے\" کہتے ہیں کہ ذات حق (الحق) نے انسان کامل (الإنسان الکامل) کا وصف صرف اسی چیز سے بیان کیا جس سے اس نے خود اپنا وصف بیان کیا، پس اس نے انسان کامل کی مماثلت کی نفی کی کہ عالم میں سے کوئی چیز اس کے مماثل ہو۔ اور اس کی تائید اس کے قول سے ہوتی ہے کہ اس نے آدم کو اپنی صورت پر پیدا کیا (خلق آدم على صورته)۔ پس یہ ایک ایسی خبر ہے جس سے نفس کو انس حاصل ہوتا ہے۔ پس عالم میں کوئی چیز بغیر معنی کے زائد نہیں ہے، کیونکہ اس میں کوئی عبث اور باطل نہیں ہے، بلکہ اس میں ہر چیز کسی معنی کے لیے مقصود ہے۔ اگر تم کہو کہ فعل میں مماثلت کہاں ہے؟ ہم کہتے ہیں: اس کا بیان دو پہلوؤں سے ہے۔ پہلا پہلو یہ ہے کہ وہ ظاہر آلے (آلة ظاهرة) سے فعل کرے، پس جب تم اس کی توحید افعال (توحيد الأفعال) میں کھڑے ہو جاؤ گے تو ہم اسے ایک آلہ بنا دیں گے، پس وہ ہم سے وہ فعل کرے گا جس کی نسبت مشاہدے میں ہمارے لیے کی جاتی ہے، پس ہم اس کے لیے بڑھئی کے لیے بسولے کی طرح اور درزی کے لیے سوئی کی طرح ہیں، مثال کے طور پر۔ یہ اس وقت ہے جب ہم اسے اپنا مثل بنائیں۔ اور جب ہم خود کو اس کا مثل بنائیں، اور یہ جواب کے دو پہلوؤں میں سے دوسرا پہلو ہے، تو وہ ارادے اور قصد (الإرادة والقصد) سے فعل کرنا ہے، اور یہ ایک باطنی آلہ (آلة باطنة) ہے، کیونکہ یہ ایک نسبت ہے۔ پس وہ ارادے سے فعل کرتا ہے۔ پس جب انسان صاحب ہمت نافذہ (نافذ ہونے والی ہمت) ہو، تو وہ اپنی ہمت سے فعل کرتا ہے، وہ اس کا مثل ہو گا۔ اور یہ ہر انسان میں نہیں پایا جاتا۔ پس ہم اسی کے ذریعے اور اسی کے لیے ہیں، پس وہ ہمیں فعل کرواتا ہے، اور ہم سے فعل کرواتا ہے، اور ہم میں فعل کرتا ہے۔ پس توحید اعمال (التوحيد في الأعمال) ثابت نہیں ہوتی مگر یہ کہ ہم آلہ ہوں، یہ ضروری ہے۔ اور اللہ ہی عالم (جاننے والا) اور معلم (سکھانے والا) ہے جس نے جسے چاہا اپنے علم سے مطلع کیا۔\n\nاور اس مقام (منزل) کے علوم میں سے وہ علم ہے جو قیامت کے قیام کے لیے باقی ماندہ زمانے کے بارے میں ہے۔ اور اس میں اس علم کا فرق ہے جو علماء کے دلوں پر ربوبیت (الربوبية) اور رحمانیت (الرحمانية) کی حضرات سے نازل ہوتا ہے، نہ کہ دیگر الٰہی حضرات سے۔ اور اس میں اس علم کا علم ہے کہ اس علم کے حامل کی صفت کیا ہونی چاہیے، اور کیا یہ علم اس شخص کے لیے صحیح ہے جو اس کی طرف سر نہ اٹھائے یا نہیں؟ اور اس میں ان اسرار کا علم ہے جو افشاء نہیں کیے جاتے۔ اور اس میں رد اور قبول کا علم ہے۔ اور اس میں رؤیا (خواب) اور مبشرات (خوشخبریوں) کے درمیان فرق کا علم ہے، اور یہ کہ رؤیا عام ہے اور مبشرات خاص ہیں، کیونکہ انسان وہ دیکھ سکتا ہے جس کے بارے میں وہ خود سے بات کرتا ہے، اور وہ جس سے شیطان کھیلتا ہے یا اسے غمگین کرتا ہے، اور اگر اس کا کوئی اثر نہ ہوتا اس شخص پر جس کے لیے وہ بیان کی گئی یا جس نے خود اسے دیکھا، تو شارع (شریعت لانے والے) اس خوف کو دور کرنے کے لیے یہ چیز ثابت نہ کرتے، اور وہ یہ ہے کہ خوفناک خواب دیکھنے والا اپنے بائیں طرف تین بار تھوکے اور جو کچھ اس نے دیکھا ہے اس کے شر سے اللہ کی پناہ مانگے، تو وہ اسے نقصان نہیں دے گا، اور وہ اپنی اس کروٹ سے بدل جائے جس پر وہ خواب کے وقت سو رہا تھا، دوسری کروٹ پر، کیونکہ وہ اس کے بدلنے سے بدل جائے گا، جیسا کہ استسقاء (بارش طلب کرنے والا) دعا کے وقت اپنی چادر بدلتا ہے، تو اللہ قحط کی حالت کو خوشحالی سے بدل دیتا ہے، اور اس کے شر کو اس شخص سے دور کر دیتا ہے جس نے اسے پناہ گاہ بنایا، پس اس پر اثر نہیں ہوتا، اگرچہ وہ وارد ہوا ہے، لیکن ایک خاص طریقے پر۔ اور شریعت میں یہ وارد ہوا ہے کہ بندہ ایک ایسا فعل کرتا ہے جس سے اس کا رب ناراض ہوتا ہے، اور ایک ایسا فعل کرتا ہے جس سے اس کا رب راضی ہوتا ہے۔ اور اس میں اس علم کا علم ہے کہ عقلی دلیل (الدليل العقلي) کو کس صورت میں استعمال کیا جائے اور کس صورت میں استعمال نہ کیا جائے۔ اور اس میں اشیاء کی حقائق کا علم ہے جن کے علم سے ان کا معلومات ہونا صحیح ہوتا ہے۔ اور اس میں دنیا اور آخرت میں عالم میں مقرر کردہ الٰہی حدود کا علم ہے اور ان کے اوقات کب ختم ہوتے ہیں۔ اور اس میں غیر مولود (غیر پیدا شدہ) سے پیدا ہونے والے علم کا علم ہے، یعنی فکر، تدبر اور رؤیت (دیکھنے) سے ظاہر ہونے والے علم کا۔ اور اس میں وجود (الوجود) کا عدم (العدم) سے مقابلہ کرنے کا علم ہے، اور وہ کس حضور (حضرة) یا میدان میں جمع ہوتے ہیں، اور ان کے لیے ممکنات (الممكنات) کے سوا کوئی میدان مقابلہ نہیں ہے، پس مرجح (ترجیح دیا گیا) غالب ہوتا ہے اور مرجوح (ترجیح نہ دیا گیا) مغلوب ہوتا ہے۔ اور اس میں توحید الٰہی (التوحيد الإلهي) کا علم ہے اور اس کے چھتیس مقامات ہیں۔ اور اس میں اس علم کا علم ہے جس کی علت بیان کی جا سکتی ہے اور جس کی علت بیان نہیں کی جا سکتی۔ اور اس میں اس علم کا علم ہے کہ سختیوں کے لیے اسباب اور دیگر چیزوں میں سے کیا تیاری کرنی چاہیے، اور اس کے سوا کوئی سبب نہیں ہے جس سے اسے دفع کیا جائے۔ اور اس میں فصل (جدائی) اور وصل (ملاپ) کا علم ہے، اور اس کتاب میں ان کے لیے دو باب ہیں۔ اور اس میں اس اصل کا علم ہے جس سے یا جس کے ذریعے اکوان (کائنات) اور عالم کی اعیان (حقیقتیں) ظاہر ہوئیں۔ اور اس میں اس علم کا علم ہے کہ عالم کون ہے اور کون اس کی صورت کو محفوظ رکھتا ہے اور کون اس کی صورت کو محفوظ نہیں رکھتا۔ اور اس میں عالم علوی (العالم العلوي) کی طرف حرکت کی نسبت کا علم ہے اور اس حرکت سے کیا مطلوب ہے۔ اور اس میں ایک حال سے دوسرے حال میں منتقل ہونے کا علم ہے اور اس کی اصل کیا ہے۔ اور اس میں انسان کی نشأت کا علم ہے انفرادیت پر، اور میں انسان سے مراد حیوانی انسان لیتا ہوں۔ اور اس میں امور میں ثابت قدمی کا علم ہے اور اس کا سبب کیا ہے اور اس کا نتیجہ کیا نکلتا ہے۔ اور اس میں عجز اور قصور کا علم ہے اور کون اس کا اہل ہے۔ اور اس میں حافظ (محافظ)، حفظ (حفاظت) اور محفوظ (محفوظ چیز) کا علم ہے اس حیثیت سے کہ وہ محفوظ ہے اور جس کے ذریعے محفوظ ہے۔ اور اس میں زیادتی اور کمی کا علم ہے، اور یہ کہ دنیا جب سے اللہ نے اسے پیدا کیا ہے، کم ہوتی جا رہی ہے، اور آخرت جب سے دنیا میں کمی شروع ہوئی ہے، ہر روز اس میں اضافہ ہو رہا ہے، اور دنیا بھی ہر روز کمی میں ہے۔ اور اس میں اس شخص کے علم کا علم ہے جس نے جان لیا کہ اس سے فلاں وجود نہیں ہو سکتا جب اس سے اس وجود کا مطالبہ کیا گیا، جیسے کسی معذور سے کھڑا ہونے کا مطالبہ کیا جائے جس سے کھڑا ہونا صحیح نہیں ہے، اور وہ اسے کیوں چاہتا ہے جبکہ وہ جانتا ہے کہ وہ اس کی طاقت نہیں رکھتا۔ اور اس میں حق کی اپنے بندے کے ساتھ اس حال میں عنایت کا علم ہے جب بندہ عقل یا وجود (الوجود) سے متصف نہیں ہوتا، جیسے بایزید اور اولیاء (الأولياء) میں سے اس کے جیسے لوگ، اور انبیاء میں سے عیسیٰ اور یحییٰ۔ اور اس میں حجتیں قائم کرنے کا علم ہے۔ اور اس میں اس علم کا علم ہے جسے عقل خود ادراک کر لیتی ہے اور جسے ادراک نہیں کر سکتی۔ اور اس میں خبیث (ناپاک) کے نزدیک خبیث کا طیب (پاک) ہونے کا علم ہے۔ اور اس میں ہر مجتہد (مجتہد) کے لیے درستگی کی نسبت کا علم ہے اور مجتہد کی طرف غلطی کی نسبت کا معنی، اور یہ کہ وہ غلطی نفس الامر میں علم اور اللہ کا حکم ہے۔ اور اس میں فطرت، رؤیت اور تعلیم کے ذریعے عملی صنعتوں کا علم ہے، پس یہ تین احوال ہیں۔ پس یہ حیوان میں فطرت سے ہے، اور کمزور عقل والے میں رؤیت اور تعلیم سے ہے، اور قوی عقل والے، صحیح فکر اور نظر والے میں رؤیت اور تدبیر سے ہے۔ اور اس میں اس علم کا علم ہے کہ کس سے بچا جائے، اور کون بچتا ہے، اور کس چیز سے بچا جائے، اور متقین (پرہیزگاروں) کی اقسام۔ اور اس میں بلاء (آزمائش) اور ابتلاء (امتحان) کے درمیان فرق کا علم ہے۔ اور اس میں صالح قرین (نیک ساتھی) کا علم ہے، کیا اس میں نیکی جعل (بناوٹ) سے ہے یا اصالت سے۔ اور اس میں جزاء وفاق (مطابق بدلہ) کا حکم کا علم ہے جو اتفاق سے مناسب ہو۔ اور اس میں ندامت کے احوال کا علم ہے اور اس کا وقت کب متعین ہوتا ہے۔ اور اس میں عین (عين) کے باقی رہنے کے ساتھ صورتوں میں تبدیلی اور تحویل کا علم ہے، اور کیا نام حال کے بدلنے سے بدل جاتا ہے یا نہیں۔ اور اس میں الٰہی کتابوں کی ترتیب کا علم ہے، باوجود اس کے کہ کلام اپنی ذات میں ایک ہے، اور کس طرح مؤخر (بعد والے) کو اس پر تقدم کی نسبت دی جاتی ہے جو اس سے مؤخر ہے۔ اور اس میں عبادت سے حاصل ہونے والے علوم کا علم ہے۔ اور اس میں مخلوق کی رحمت کے عموم کا علم ہے، اور یہ اعلیٰ ترین اور پوشیدہ ترین علوم میں سے ہے۔ اور اس میں اس علم کا علم ہے کہ مخلوقات کے درمیان کن چیزوں میں مساوات ہو سکتی ہے اور کن میں نہیں ہو سکتی۔ اور اس میں تنزیہ (تنزيه) کا علم ہے، اور حق سے خلق کا اور خلق سے حق کا مقام۔ اور \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔)",
    "fa": "باب سیصد و شصت و سوم: در معرفت منزلتی که عارف آنچه را نمی‌شناسد به کسی که پایین‌تر از اوست ارجاع می‌دهد تا او را به آنچه در توانش نیست آگاه سازد، و تنزیه (منزه دانستن) باری (خداوند) از طرب و شادی.\n\nنهادن میزان‌ها برای حسابرسی\nسخنگوی کتاب (قرآن) آن را آورده است\n\nکتابی از ذات است، بی‌قلم\nو بی‌مرکب و بی‌کسب (تلاش)\n\nو بی‌صفات و بی‌نعت‌ها\nو بی‌رفتن و بی‌بازگشت\n\nپس اگر توبه کند آنکه دچارش شده\nپذیرنده، توبه را می‌پذیرد\n\nشکر را در دیگ‌ها از او می‌خواهد\nو در کاسه‌هایی چون حوض‌ها (بزرگ)\n\n[توحید عقلی، یعنی توحید افعال]\n\nاین منزلت توحید عقلی است، یعنی توحید افعال؛ به این معنا که هیچ فاعلی جز الله نیست. این منزلتی شریف است. بدان که عالم پیوسته در حال عدم خود، شاهد واجب الوجود بوده است، زیرا همواره در عدمِ مرجّح (ترجیح‌دهنده) بوده و عین او ثابت است. حق (الحق) او را در حال عدمش به شنیدن و اطاعت از خود وصف کرده است، پس نسبت دادن شهود (الشهود) بر او محال نیست. به همین دلیل، هیچ یک از ممکنات در حال وجود خود او را انکار نکرده‌اند، جز این موجود انسانی که تنها از میان عالمیان، برخی از خود را شریک او قرار دادند؛ کسانی که حجاب طبع بر آنان غلبه کرده است. این همان چیزی است که عادت کرده‌اند بشنوند و اطاعت کنند و عبادت نکنند مگر پروردگاری را که او را مشاهده کنند. آن معبودِ حجابِ طبع، برای او غیب شده است. پس آنچه را که از موجودات مشاهده‌پذیر و دیدنی، خواه از عالم سماوی مانند ستارگان، یا از عالم پایین‌تر مانند عناصر یا آنچه از آن‌ها متولد شده، به عنوان پروردگاری گرفت که او را بر اساس مشاهده‌ای که به آن عادت کرده و نفسش به آن آرام گرفته، عبادت کند. و در نظر خود توهم کرد که آن خدای اتخاذ شده، حق (الحق) را مشاهده می‌کند و به او نزدیک‌تر است تا خودش؛ پس خود را برای او خدمت کرد تا او را به سوی خداوند عز و جل نزدیک سازد، چنانکه خداوند از قول آنان خبر داده است که گفتند: «ما نَعْبُدُهُمْ (آنها را عبادت نمی‌کنیم)» یعنی خدایانی که برای عبادت گرفته‌اند «إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏ (مگر برای اینکه ما را به خداوند نزدیک سازند، نزدیکی‌ای)». پس آن را با «زلفی» تأکید کردند. و این از روی نظر و اجتهاد بود. سپس دیدند که صاحبان شرایع نازل شده الهی، مردم را به سجده و نهادن صورت‌ها بر زمین، رکوع و رو به قبله شدن به عنوان راهی برای تقرب به خداوند در جهتی معین، و بوسیدن سنگی که به ما گفتند دست راست خداست، مقید کرده‌اند. و با تعظیم شعائر و نشانه‌های نوظهوری آمدند که آن‌ها را به خداوند نسبت دادند و تعظیم ما نسبت به آن‌ها، یعنی آن شعائر و مناسک، را از تقوای قلب‌ها قرار دادند و سعادت ما را به آن تعظیم، هنگامی که از ما ظاهر می‌شد، پیوند زدند. این امر اعتماد آنان را بر آنچه از خدایان و شرایع مقرر و منصوب کرده بودند، افزود. و تفاوتی نگذاشتند میان آنچه وضع خداوند در خلق اوست و آنچه خودشان برای خودشان وضع کرده‌اند. سخن ما تنها با پیشوایانِ صاحبانِ نظر اول است که این امور را به عنوان معبودهایی برای خود، به قصد تقرب به خداوند عز و جل، قرار دادند. سپس، از جمله چیزهایی که فریبشان داد، سعادتی بود که در شرایع الهی برای مجتهد به طور مطلق دیدند و شنیدند، چه خطا کند و چه صواب. پاداش برای او محقق است، پس از آنکه حق نظر و اجتهاد را به زعم خود، به اندازه استعدادی که خداوند در وجودش به او داده، به جا آورد. پس در آنچه برهان نبود، تخیل کردند که برهانی است بر آنچه طلب کرده‌اند. آنان خدایی را نگرفتند مگر به گمان خود بر اساس برهان. و این همان قول خداوند است: «وَمَن يَدْعُ مَعَ اللَّهِ إِلَٰهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ (و هر کس با خداوند، خدای دیگری را بخواند که برهانی برای آن ندارد)» یعنی به زعم خودش. پس این دلالت می‌کند بر اینکه کسی که در نظرش برهانی برای او اقامه شده، مؤاخذه نمی‌شود، حتی اگر خطا کرده باشد؛ زیرا خطا برای او مقصود نبوده، بلکه قصدش رسیدن به حق (الحق) بر اساس آنچه امر بر آن است، بوده است. و اصل همه این‌ها این است که غیبی را عبادت نکند، زیرا او در اصل به این عادت نکرده است. به همین دلیل، جبرئیل (علیه السلام) آمد تا به پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) و اصحابش آنچه را که امر بر آن است، در صورت یک بادیه‌نشین بیاموزد. پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «آیا می‌دانید این کیست؟» یا فرمود: «مرد را برگردانید.» جستجو کردند اما او را نیافتند. پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) هنگامی که او پشت کرد، به اصحابش فرمود: «این جبرئیل بود که آمد تا دینشان را به مردم بیاموزد.» و از جمله سؤالاتی که از او پرسید این بود که: «احسان چیست؟» پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در پاسخ به او فرمود: «اینکه خدا را چنان عبادت کنی که گویی او را می‌بینی.» زیرا می‌دانست که عبادت بر اساس غیب بر نفوس دشوار است. سپس کامل کرد و فرمود: «پس اگر تو او را نمی‌بینی، او تو را می‌بیند.»\n\nیعنی در نفس خود حاضر کن که او تو را می‌بیند، و این نوع دیگری از شهود (الشهود) از پشت حجاب است؛ می‌دانی که معبودت تو را می‌بیند از آنجا که تو او را نمی‌بینی و صدایت را می‌شنود. شریعت در تمام این موارد نیامده مگر با آنچه برای این افراد مایه فریب و تکیه‌گاه بود. به همین دلیل خداوند متعال فرمود: «يُضِلُّ بِهِ كَثِيرًا وَيَهْدِي بِهِ كَثِيرًا (بسیاری را با آن گمراه می‌کند و بسیاری را با آن هدایت می‌کند)» و فرمود: «يُضِلُّ مَن يَشَاءُ وَيَهْدِي مَن يَشَاءُ (هر که را بخواهد گمراه می‌کند و هر که را بخواهد هدایت می‌کند)». و اوست که صواب در نظر را روزی می‌دهد و اوست که خطا را روزی می‌دهد. از مضمون همه این‌ها چنین برمی‌آید که عبادت از سوی عابد تنها به مشهود یا مانند مشهود تعلق می‌گیرد و راهی به سوی غیب نیست. و این از رحمت‌های پنهان و الطاف خداوند است. و از کسانی که ذکر کردیم، تنها مقلدان (پیروان کورکورانه) خارج شدند؛ پس شقاوت به آنان پیوست. پس حق (الحق) در شریعت نازل شده، تکیه‌گاهی از رحمت خود برای آنان قرار داد که به آن تکیه کنند و فرمود: «فَاسْأَلُوا أَهْلَ الذِّكْرِ إِن كُنتُمْ لَا تَعْلَمُونَ (پس اگر نمی‌دانید، از اهل ذکر بپرسید)». و اهل ذکر همان اهل قرآن هستند، زیرا خداوند متعال می‌فرماید: «إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ (همانا ما خود ذکر را نازل کردیم)» و آن قرآن است. و آنان اهل اجتهاد هستند که برخی از ایشان صواب و برخی خطا می‌کنند. پس اگر مقلد از کسی از اهل اجتهاد که در واقع خطا کرده است، سؤال کند و به فتوای او عمل نماید، مأجور است، زیرا به سؤال کردن امر شده است. پس مقلد و نیز نظریه‌پردازانی که در اصول نظرشان خطا کرده‌اند، با وجود اینکه استعدادشان را در آنچه به آن رسیده‌اند، در مورد اتخاذ خدایانی غیر از الله، به کار برده‌اند، تکیه‌گاه دارند. و حتی اگر نظر نکرده باشند، خداوند هیچ «نَفْسًا إِلَّا وُسْعَهَا (نفسی را جز به اندازه توانش)» تکلیف نکرده است، و آن همان چیزی است که در او قرار داده است. پس رحمت او شامل حال پیشوایان و پیروان شد. بنابراین، در عالم جز موحد (کسی که به واحد تکیه کرده) نیست. و از این سیاق دانستی که شرک چیست و صفت مشرک کدام است. و خداوند از یک جهت آنان را معذور دانسته و به ایشان فرموده است: «لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا (از رحمت خدا ناامید نشوید، همانا خداوند همه گناهان را می‌آمرزد)». این در صورتی است که بنده قصد انجام گناهی را داشته باشد و معتقد باشد که آن گناه است؛ پس حال کسی که عمداً مرتکب گناه نشده و آن را به دلیل شبهه‌ای که برایش پیش آمده، وسیله تقرب قرار داده، چگونه است؟ او به مغفرت سزاوارتر است. اما مؤاخذه اهل شرک به طور قطعی با قول خداوند: «إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ (همانا خداوند نمی‌آمرزد که به او شرک ورزیده شود)» به دلیل قرینه حال، آشکار است. اما از طریق زبان، این همان واقعیت است؛ زیرا خداوند شرک را بر اهل شرک نپوشانده، بلکه آنان با آن آشکار شده‌اند. پس این خبری است از آنچه در هستی (الوجود) رخ داده است، یعنی ظهور شرک و پوشاندن آنچه پایین‌تر از آن است برای هر که بخواهد بپوشاند. زیرا اموری وجود دارند که نه برای چشمی آشکار شده‌اند و نه برای عقلی، چنانکه در وصف بهشت آمده است: «در آن چیزهایی است که نه چشمی دیده و نه گوشی شنیده و نه بر قلب بشری خطور کرده است.» اما قرائن احوال دلالت بر قطعیت مؤاخذه مشرکان دارد. سپس خداوند سبحان ذکر نکرده است که امر در مورد آنان پس از مؤاخذه که همان اجرای حد بر آنان در آخرت، روز دین (جزا) است، چگونه خواهد بود. پس آنان با برخی از خدایانشان وارد آتش می‌شوند تا به مشاهده دریابند که آن خدایان هیچ چیزی از عذاب خداوند را از آنان دفع نمی‌کنند، زیرا آن‌ها را بر اساس نظر خود گرفته‌اند نه بر اساس وضع الهی. پس ای ولیّ، در عدل و فضل خداوند بنگر، که حمد در هر حال از آن اوست. و این حمد نبوی صحیح است، زیرا ثنا در هر حال، چه از مشرک و چه غیر مشرک، وجود دارد. زیرا مشرک، همانطور که گفتیم، عظمت و کبریا را جز برای خدا قرار نداده و خدایان را مانند خادمان و حجاب‌ها قرار داده است. پس آنان را عبادت نکردند مگر به خاطر او. و اگر در مورد آن‌ها خطا کردند، تنها در احدیت (توحید) خطا کرده‌اند. پس آنان نیز از حامدان خداوند هستند، زیرا اهل ثنا بر خداوند با توحید عظمت او و ترجیح او بر این حجاب‌ها بودند. پس توجه خود را به رحمت فراگیر و گسترده خداوند که بر خلقش گسترانیده، معطوف دار تا ان‌شاءالله به حق (الحق) هدایت شوی. اما اختلاف عقاید در مورد خداوند در میان صاحبان شرایع الهی و غیر ایشان، اگر خداوند متعال عالم را به خاطر خطا مؤاخذه می‌کرد، هر صاحب عقیده‌ای را در مورد او مؤاخذه می‌کرد، زیرا او پروردگارش را با عقل و نظر خود مقید و محصور کرده است، در حالی که برای خداوند جز اطلاق شایسته نیست، زیرا «بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ (ملکوت هر چیز به دست اوست)». پس او مقید می‌کند و مقید نمی‌شود. اما خداوند از همه درگذشت. پس هر کس بخواهد به حق (الحق) برسد و حق او را ادا کند، خداوند او را به دلیل علمش به وسعت و گستردگی حق، موفق می‌سازد و اینکه حق نزد اعتقاد هر معتقدی مشهود است و صحیح نیست که نزد اعتقاد معتقد مفقود باشد، زیرا او اعتقاد خود را به او گره زده است و «وَهُوَ عَلَى كُلِّ شَيْءٍ شَهِيدٌ (و او بر هر چیزی گواه است)». پس صاحب این علم، حق (الحق) را همیشه و در هر صورتی می‌بیند و آن را انکار نمی‌کند، در حالی که کسی که او را مقید کرده، انکار می‌کند. با این حال، خداوند از کسانی که او را با تنزیه یا تشبیه مقید کرده‌اند، از ائمه دین، درگذشته است. سپس در شهادت خداوند عز و جل نزد پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) در حق مشرکان بنگر: «وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ (و اگر از آنان بپرسی چه کسی ایشان را آفریده است، قطعاً می‌گویند: الله)». این تنبیهی شگفت‌انگیز است. و هنگامی که به آنان گفته شد: «اسْجُدُوا لِلرَّحْمَٰنِ (برای رحمان سجده کنید)»، آنان عینی برای او ندیده بودند و او را جز با نام «الله» نمی‌شناختند و نمی‌دانستند که او عین مسمای «الرحمن» است. پس در مورد رحمان تخیل کردند که او شریک خداست، لذا آن را انکار کردند. اما این انکار را در مورد کسانی که به عنوان خدا نصب کرده بودند، طبق آنچه مقرر کردیم، انجام ندادند، زیرا آنان به نام‌های کسانی که به جای خدا به عنوان خدا نصب کرده بودند، آگاه بودند. پس با نام‌هایشان دانستند که آن‌ها در حقیقت در الوهیت مانند او نیستند، زیرا نزد آنان توحید عظمت و کبریا برای خداوند متعال است. و سجده برای رحمان، آنان را به عبادت غیب رهنمون شد، پس گفتند: «وَمَا الرَّحْمَٰنُ أَنَسْجُدُ لِمَا تَأْمُرُنَا (رحمان چیست؟ آیا برای آنچه به ما فرمان می‌دهی سجده کنیم؟)» و این بر نفرتشان افزود، زیرا آنان در غیب جز یک خدا نمی‌شناختند. پس خداوند به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَٰنَ أَيًّا مَّا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَىٰ (الله را بخوانید یا رحمان را بخوانید، هر کدام را بخوانید، پس نیکوترین نام‌ها از آن اوست)». پس از این امر نهایت تعجب را کردند، زیرا تخیل می‌کردند که مسمای رحمان، مسمای الله نیست، اگرچه برای هر دو، نام‌های نیکو (الأسماء الحسنی) وجود دارد. و این به دلیل آن بود که خداوند بصیرت‌هایشان را کور کرده و پوشش‌هایشان را غلیظ ساخته بود، پس آنچه را که خداوند با نازل کردن آن در حقشان اراده کرده بود، درک نکردند. و حق (الحق) این را نیز تکیه‌گاهی برای آنان قرار داد، آنجا که با نامی به سوی آنان آمد که مسمایی را می‌طلبید که این نشانه را برای آن نمی‌شناختند، در حالی که اهل الله و خاصان او این را می‌دانستند.\n\nپس الله و رب و رحمان و مَلِک\nحقایقی هستند که همگی در ذات مشترکند\n\nپس عین (ذات) یکی است و حکم مشترک\nاز این رو جسم و ارواح و فلک پدیدار شدند\n\nو همه آن‌ها ابزارهایی میان خالق ما\nو میان ما هستند، و به همین دلیل درک (رسیدن) را تضمین می‌کند\n\nرسولان رحمان همگی آن‌ها را آوردند\nهمراه با کتابی که فرشته (ملک) آن را رسانده است\n\n[همانا علم به خداوند دو راه دارد]\n\nو بدان که علم به خداوند دو راه دارد: راهی که عقل پیش از ثبوت شریعت به تنهایی آن را درک می‌کند، و آن مربوط به احدیت (توحید) او در الوهیتش است و اینکه او شریکی ندارد و آنچه برای او، واجب الوجود، واجب است که باشد. و عقل را به علم به ذات خداوند متعال راهی نیست. و هر کس با عقل خود به معرفت ذات خداوند بپردازد، به امری پرداخته که از آن عاجز است و در آن سوء ادب کرده و خود را در معرض خطر بزرگی قرار داده است. این همان راهی است که خلیل، ابراهیم (علیه السلام)، به قومش فرمود: «أُفٍّ لَّكُمْ وَلِمَا تَعْبُدُونَ مِن دُونِ اللَّهِ أَفَلَا تَعْقِلُونَ (اف بر شما و بر آنچه به جای خدا می‌پرستید، آیا تعقل نمی‌کنید؟)». پس آنان را متوجه ساخت که علم به خداوند از جهت اینکه او در الوهیتش خدایی واحد است، از درک‌های عقول است. پس آنان را ارجاع نداد مگر به امری که صحیح است در آن نظر کنند و با نظر خود بدانند که امر بر چه قرار است. و راه دیگر، راه شریعت است پس از ثبوت آن. پس شریعت همان چیزی را آورد که عقل از جهت دلیل خود آورده بود، و آن اثبات احدیت (توحید) خالق و آنچه برای او عز و جل واجب است، می‌باشد. و مسلک دیگر از علم به خداوند، علم به آنچه او در ذات خود بر آن است، می‌باشد. پس او را وصف کرد، پس از آنکه عقل با دلیل خود بر عصمت او در آنچه از پروردگارش نقل می‌کند، حکم نمود؛ با وجود «لَيْسَ كَمِثْلِهِ شَيْءٌ (چیزی مانند او نیست)» و اینکه برای او مثلی زده نشود، بلکه اوست که مثل‌ها را می‌زند، زیرا او می‌داند و ما نمی‌دانیم. پس اموری را به خداوند متعال نسبت داد که عقل از جهت دلیل خود نمی‌تواند آن‌ها را به او نسبت دهد و نمی‌تواند آن‌ها را بر کسی که دلیل عقلی بر عصمت او نزدش اقامه شده، رد کند. پس این امر، او را دچار حیرت میان دو راه ساخت. و هر دو راه صحیح هستند و نمی‌توان بر هیچ یک از آن‌ها طعن زد. پس برخی از عقلا تأویل تنزیهی و تأییدی کردند و تأویل خود را با «لَيْسَ كَمِثْلِهِ شَيْءٌ» و با قول او: «وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ (و خدا را آن‌گونه که شایسته اوست نشناختند)» تقویت کردند. و برخی از عقلا علم آن را به کسی که آن را آورده یا به خداوند واگذار کردند. و برخی از عقلا از اهل زبان، تشبیه کردند. و خداوند هر گروهی را معذور دانسته است. و از بندگانش در حق خود نخواسته است مگر اینکه بدانند او خدایی واحد است و در الوهیتش شریکی ندارد و بس، و اینکه «لِلَّهِ الْأَسْمَاءُ الْحُسْنَىٰ (نیکوترین نام‌ها از آن خداست)» با معانی‌ای که در زبان بر آن است. و نجات و سعادت را به کسی پیوند زد که نزد آنچه از جانب او عز و جل در کتاب‌هایش و بر زبان رسولانش (علیهم السلام) آمده، توقف کند.\n\nچون حق (الحق) از خود آشکار کرد\nدر کتاب‌هایش، پس اعتقاد کن\n\nپس بر ما در آن گناهی نیست\nو آن علم به اوست، پس اعتقاد کن\n\nهمانا بهره عقل از علم او\nبه او، نفی وجود کثرت است\n\nو او در شأن خود واحد است\nو او الله است که «لَمْ يَلِدْ (نزاده است)»\n\nهمچنین «وَلَمْ يُولَدْ (و زاده نشده است)»؛ و برای کسی که با عقل خود او را طلب کند، از فکر خود فراتر مرو\n\nو برهان این امر، ای ولیّ، اختلاف گفتارهای عقلا و نظریه‌پردازان در مورد اوست و اتفاق گفتارهای هر کسی که از جانب او آمده است، از رسول و نبی و ولیّ و هر خبردهنده‌ای از خداوند. و اگر عاقلِ مؤمن بر معنای قول خداوند در کتابش: «وَلَمْ يُولَدْ» وقوف می‌یافت و می‌دانست که آنچه عقل از فکر خود با ترکیب دو مقدمه نتیجه می‌گیرد، آن نتیجه برای عقل ولادتی است و آن نتیجه مولود از عقل است، در حالی که او نفی کرده است که زاده شود، پس ایمان کجاست؟ و مولود جز عین او نیست. برخلاف زمانی که عقل نسبت احدیت (توحید) را برای او نتیجه می‌گیرد؛ زیرا معقولیت احدیت برای واحد، عین کسی که احدیت به او نسبت داده شده، نیست. پس عقل بر احدیت ولادتی دارد و بر استناد به او ولادتی دارد، اما به هیچ وجه بر عین او ولادتی ندارد. اما هویت و حقیقت او، عقل بر آن ولادتی ندارد، و خداوند این را با قول خود: «وَلَمْ يُولَدْ» نفی کرده است. و از اینجا می‌دانی که هر عاقلی که در ذات خداوند سخنی دارد، تنها چیزی را عبادت کرده که عقلش آن را زاده است. اگر مؤمن باشد، این طعن در ایمان اوست، و اگر مؤمن نباشد، همین کافی است که مؤمن نیست، به ویژه پس از بعثت عامه محمد (صَلَّى اللهُ عَليهِ وسَلَّم) و رسیدن آن به همه آفاق. و همانا خداوند بندگانی دارد که بر اساس ایمانشان عمل کردند و خداوند را در احوالشان تصدیق نمودند. پس خداوند چشمان بصیرتشان را گشود و در سرّهایشان بر آنان تجلی (التجلی) کرد، پس او را بر اساس شهود (الشهود) شناختند. و آنان در آن معرفت خود بر بصیرت و بینه‌ای بودند که شاهدی از خودشان، یعنی رسول مبعوث شده به سوی آنان، آن را تأیید می‌کرد؛ زیرا خداوند رسولان را گواه بر امت‌هایشان و برای امت‌هایشان قرار داده است. پس با وجود اینکه این مؤمن بر بینه‌ای از پروردگارش بود هنگامی که بر او تجلی کرد، شاهدی از او، یعنی رسول، در آن حال او را دنبال کرد و او را در شهود (الشهود) برایش آینه‌ای قرار داد و به او گفت: «این همان کسی است که من از جانب او نزد تو آمده‌ام.» پس هنگامی که او را دید، با وجود اختلاف صور تجلی (التجلی)، دیگر او را انکار نکرد. پس چه بسا کسی که حالش چنین است، از مؤمنان، با آنچه خداوند خود را در کتاب‌هایش یا بر زبان رسولانش وصف کرده یا رسولانش او را وصف کرده‌اند، از او کنایه آورد. پس عاقلِ مؤمن به آن از کتاب خدا و قول رسول ایمان آورد، اما به همان سخن صاحب این حال از مؤمنانِ پیرو، کفر ورزید. اما غیر مؤمنان، همان کسانی هستند که «يَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّ (پیامبران را به ناحق می‌کشند)» و «وَيَقْتُلُونَ الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ مِنَ النَّاسِ (و کسانی را می‌کشند که مردم را به عدالت فرمان می‌دهند)». و آنان همان وارثانی هستند که مردم را بر بصیرت به سوی خدا دعوت کردند، همانگونه که رسولان دعوت کردند. خداوند متعال از قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) می‌فرماید: «أَدْعُو إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي (من و هر کس که از من پیروی کند، بر بصیرت به سوی خدا دعوت می‌کنیم)». و معنای بصیرت در اینجا همان است که ذکر کردیم، یعنی بر اساس کشف (الکشف)، مانند کشف رسولان. پس چگونه این مؤمن به آنچه از رسول آمده ایمان آورد، اما به عین آن از برادر مؤمنش که تابع رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) است، هنگامی که آن را آورد، کفر ورزید؟ حداقل این است که آن را به صورت حکایت از او بپذیرد. و ما ندیده‌ایم و نشنیده‌ایم که صاحب کشف (الکشف) الهی از مؤمنان، کشفش به طور کلی با آنچه رسولان آورده‌اند، مخالفت کند، و چنین چیزی را نخواهی یافت. پس تفاوت میان عقلا در معرفت عین او و میان رسولان و اولیا و آنچه کتاب‌های نازل شده در این باره آورده‌اند را دانستی. پس مؤمن نزد آن چیزی است که راهش به او داده، و عاقل نزد آن چیزی است که دلیلش به او داده است.\n\nو حکم عقل کجا و حکم او کجا\nسبحان او، که بر نفس خود جلیل است\n\nهیهات، جز او کسی او را نمی‌شناسد\nمگر به واسطه او، زیرا از جنس او نیست\n\nو عقل معبود خود را وارد کرده است\nبا فکر قاصرش در زندان خود\n\nو گفت این فرزند من است، او را حفظ کردم\nدر خاطرم، پس او بر قدس خود است\n\nاین کلام حال است، پس چون «لاحول» گویند\nگویند: خداوند در نفس خود متعالی است\n\nپس خالق من، مخلوق من است، پس عبرت گیر\nدر فرع اعلای او و در رأس او\n\nپس بر تو باد به عبادت خداوندی که شریعت آن را آورده و سمع (نقل) بر آن وارد شده است. و به آنچه دلیل تو به تو داده و به تصدیق او می‌انجامد، کفر نورز. و نهایت امر این است که گفتار او و امثال او را در مورد پروردگارش بپذیری، به دلیل ثبوت صدق او و ثبوت مؤمن بر پیروی از او. پس اگر در این امر انصاف ورزی و آنچه را که رسولان (علیهم السلام) در حق خداوند به آن نطق کرده‌اند، بدانی، جایز می‌شماری که از آن معرفت، نفحه‌ای بر قلب‌های مؤمنانِ پیرو بوزد که آنان را به موافقت در نطق برساند و اینکه آنجا که زبان حق (الحق) بوده است، پس آن را در فرع بپذیری، همانگونه که در اصل پذیرفتی، به جامع موافقت. و از کفران بپرهیز، زیرا آن نهایت محرومیت است، و از کسانی خواهی بود که: «الَّذِينَ آمَنُوا بِالْبَاطِلِ وَكَفَرُوا بِاللَّهِ أُولَٰئِكَ هُمُ الْخَاسِرُونَ (کسانی که به باطل ایمان آوردند و به خدا کفر ورزیدند، آنان همان زیانکارانند)». پس «اعْبُدْ رَبَّكَ (پروردگارت را عبادت کن)» که در شریعت وصف شده است، «حَتَّى يَأْتِيَكَ الْيَقِينُ (تا یقین به تو رسد)»، پس پرده کنار رود و دید تیز شود، و آنچه را او دید، ببینی و آنچه را او شنید، بشنوی، و به او در درجه‌اش ملحق شوی، نه با نبوت تشریعی، بلکه با وراثتی محقق برای نفسی تصدیق‌کننده و پیرو. و این بابی است که میدان در آن به دلیل وسعت افعال، گسترده می‌شود، زیرا توحید افعال با وسعت آن‌ها گسترش می‌یابد. نسبت‌های افعال پایان نمی‌پذیرند، بلکه تا زمانی که فعل از فاعل ظاهر می‌شود، در فزونی هستند. و طلب فزونی در قول خداوند متعال: «رَبِّ زِدْنِي عِلْمًا (پروردگارا، علم مرا زیاد کن)» از همین روست، زیرا برای او در هر فعلی تجلی (التجلی) خاصی است که جز برای عین آن فعل نیست، و به همین دلیل هر فعلی از دیگری به واسطه تجلی (التجلی) مخصوص به خود متمایز می‌شود.\n\nدر حق (الحق) که گفتم، گفتم\nدر آن سستی مکن و کوتاهی نورز\n\nزیرا آن، حقی (الحق) است که از جانب او\nبه من آمده، و او دانای ولیّ است\n\nپس چگونه می‌توانم آن را رد کنم، در حالی که او\nبا کشف (الکشف) خود مرا تأیید کرده است، چگونه می‌توانم؟\n\nخداوند متعال فرمود: «لَيْسَ كَمِثْلِهِ شَيْءٌ (چیزی مانند او نیست)». پس کاف صفت را در نفی مماثلت از مثلِ فرض شده آورد. و این نفی، عمومیت دارد تا زمانی که حالی تخصیص‌دهنده به آن پیوندد، زیرا نهایت کار نظریه‌پرداز در این باره توقف است تا ببیند قرائن احوال در آن چه می‌دهند. و این نشانه صاحب دلیل عقلی است. اما این نفی و اثبات مثلیت با زبان عربی آمده است، و مماثلت در زبان بر غیر مماثلتی است که عقلا بر اطلاق آن اصطلاح کرده‌اند. پس عاقل نیاز دارد که دلیلی را به زحمت بیاورد بر اینکه حق (الحق) مماثلت عقلی را اراده کرده است، در حالی که از صاحب زبان در این باره دلیلی خواسته نمی‌شود، زیرا قرآن به زبان او و بر اصطلاح او نازل شده است. و مانند این امر با قیاس و نظر درک نمی‌شود، زیرا به قصد متکلم بازمی‌گردد و آنچه در نفس متکلم است، جز با آشکار ساختن او از آنچه در نفسش است، شناخته نمی‌شود. و خداوند متعال فرمود: «وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ (و هیچ رسولی را نفرستادیم مگر به زبان قومش)». و عرب مماثلت عقلی را نمی‌شناسد و اگر آن را بشنود، انکار نمی‌کند. و هر لفظی که در وصف خداوند متعال آمده و از لفظ «مثل» و حرف کاف صفت عاری باشد، از ابزارهای تشبیه عاری شده و به الفاظ مشترک پیوسته است. و بدان که کاف صفت تفاوتی با لفظ «مثل» ندارد، اگرچه این حرف جایگاه‌هایی دارد که از جمله آن‌ها جایگاه صفت است. پس هنگامی که در زبان در جایگاه صفت وارد می‌شود، مانند اینکه بگویی: «زید کعمرو (زید مانند عمرو است)»، عرب جز افاده (فایده رساندن) را نمی‌خواهد. پس محال است که چنین چیزی بیاوری و قصدت این باشد که او در انسانیت با او مماثلت دارد، که همان مماثلت عقلی است، بلکه قصدت این است که او در کرم مثلاً یا در شجاعت یا در فصاحت یا در علم یا در زیبایی و مانند آن، که حال با قرینه‌اش نزد شنونده بر آن دلالت دارد، مانند عمرو است تا فایده‌ای برای او حاصل شود. پس هنگامی که می‌گوید: «لَيْسَ كَمِثْلِهِ شَيْءٌ»، حتماً باید بگوید در چه چیزی، یا قرینه حال در مجلس بر آن دلالت کند. به ویژه که نفی مماثلت را با قول خود: «وَهُوَ السَّمِيعُ الْبَصِيرُ (و او شنوای بیناست)» دنبال کرده است. و این دو صفت در مخلوق محقق هستند. پس باید آنچه را نفی کرده، تحقیق کنی و بدانی که آیا این کاف صفت است یا غیر آن از آنچه زبان برای آن وضع کرده است. اگر در اینجا کاف صفت باشد، پس نفی نکرده مگر مماثلتِ مثل را که مماثلت کند. پس مثل را برای او با ضمیر «ه» در «مثله» که به حق (الحق) بازمی‌گردد، اثبات کرده است. و معلوم است که مثل، عین مماثل خود نیست، و اگر عین کسی بود که مثل اوست، نه عقلاً و نه شرعاً مثل او نبود. پس وجود مثل، عین اثبات غیر است، بدون شک. اگر مماثلت عمومیت داشته باشد، بدون شک مماثلت عقلی است و زبان آن را انکار نمی‌کند، و اگر تخصیص یابد، حقیقتاً برای همان چیزی است که تخصیص یافته، نه مجازاً؛ مثل زید کالبحر (زید مانند دریاست) به دلیل وسعتش در علم یا جود. و برخی از علما کاف در «لَيْسَ كَمِثْلِهِ شَيْءٌ» را زائد دانسته‌اند. اگر برای معنایی آمده باشد، زائد نیست، زیرا آن معنایی که به خاطر آن سوق داده شده، جز با آن در نفس مخاطب ظاهر و حاصل نمی‌شود. پس زائد بودن آن منتفی است، زیرا خداوند چیزی را باطل و عبث نیافریده است. و زائد بودن بدون معنا، عبث است. و محال است که عرب چیزی زائد بدون معنا بیاورد. پس اگر این حرف را آورده، برای معنایی آورده است، و آن همان چیزی است که به خاطر آن آمده است. زیرا متکلم کلمه‌ای را که نحوی آن را زائد می‌گوید، نمی‌آورد مگر به قصد تأکید. پس اگر حذف شود، تأکید از بین می‌رود. پس زائد نیست، زیرا کلام مؤکد بدون آن و بدون آنچه جایگزین آن شود، کامل نیست. پس هنگامی که خداوند نفی مثل را تأکید کرده است، زائد نیست. پس تأکید نفی مثل را در مقابل کسی قرار داده که مثل را به فرض و وجود، به زعم خود، اثبات کرده است. و صحیح در مورد این کاف آن است که با قرائن احوال، کاف صفت است؛ یعنی اگر برای او مثلی فرض شود، آن مثل با او مماثلت نمی‌کند، پس سزاوارتر است که مماثلت نکند. پس این در نفی مماثلت در زبان بلیغ‌تر است. سپس در مورد قولمان «با قرائن احوال» می‌گوییم، به دلیل اینکه حق (الحق) انسان کامل (الإنسان الکامل) را وصف نکرده مگر به آنچه خود را وصف کرده است. پس مماثلت انسان کامل (الإنسان الکامل) را نفی کرده که چیزی از عالم با او مماثلت کند. و این را قول او که «آدم را بر صورت خود آفرید» تأیید می‌کند. این خبری است که با آن انس برای نفس حاصل می‌شود. پس در عالم چیزی زائد بدون معنا نیست، زیرا در آن عبث و باطل وجود ندارد، بلکه هر آنچه در آن است، مقصود برای معنایی است. اگر بگویی پس مماثلت در فعل کجاست؟ می‌گوییم بیان این امر از دو وجه است: وجه اول اینکه با ابزاری ظاهری فعل انجام دهد. پس اگر در توحید افعال او قیام کنی، ما را ابزاری برای او قرار می‌دهی، پس او با ما کاری را انجام می‌دهد که در شاهد، فعل آن به ما نسبت داده می‌شود. پس ما برای او مانند تیشه برای نجار و سوزن برای خیاط هستیم، مثلاً. این در صورتی است که او را مثلی برای خود قرار دهیم. و اگر خودمان را مثلی برای او قرار دهیم، که وجه دیگر از دو وجه در پاسخ است، و آن فعل با اراده و قصد است، که ابزاری باطنی است، زیرا آن یک نسبت است. پس او با اراده فعل انجام می‌دهد. پس اگر انسان صاحب همتی نافذ باشد، با همت خود فعل انجام می‌دهد، که مثلی برای او بوده است. و این در هر انسانی از این نوع یافت نمی‌شود. همانا ما به واسطه او و برای او هستیم، پس او ما را به فعل وامی‌دارد و با ما فعل انجام می‌دهد و در ما فعل انجام می‌دهد. پس توحید در اعمال ثابت نمی‌شود مگر اینکه ما ابزار باشیم، و این ضروری است. و خداوند دانای آموزگار است که هر که را بخواهد بر آنچه بخواهد از علم خود آگاه می‌سازد. و در این منزلت از علوم، علم به آنچه از زمان برای برپایی قیامت باقی مانده است، وجود دارد. و در آن علم تفاوت میان آنچه از علم بر قلب‌های علما نازل می‌شود، از حضرت ربوبیت و حضرت رحمانیت، بدون دیگر حضرات الهی، وجود دارد. و در آن علم به صفتی که صاحب این علم باید بر آن باشد، وجود دارد، و اینکه آیا این علم برای کسی که به آن توجهی نمی‌کند، صحیح است یا خیر. و در آن علم اسراری که فاش نمی‌شوند، وجود دارد. و در آن علم رد و قبول وجود دارد. و در آن علم تفاوت میان رؤیا و مبشرات (بشارت‌دهنده‌ها) وجود دارد، و اینکه رؤیا اعم است و مبشرات اخص. زیرا انسان ممکن است آنچه را که با نفس خود حدیث می‌کند یا آنچه شیطان با او بازی می‌کند یا او را غمگین می‌سازد، ببیند. و اگر برای آن در کسی که برایش روایت شده یا برای خودش دیده، اثری نبود، شارع برای آن ترس، از بین برنده‌ای قرار نمی‌داد، و آن این قول است که صاحب رؤیای ترسناک سه بار به سمت چپ خود تف کند و به خدا از شر آنچه دیده پناه ببرد، که در این صورت به او ضرر نمی‌رساند. و باید از پهلویی که هنگام رؤیا بر آن خوابیده بود، به پهلوی دیگر خود برگردد، زیرا رؤیا با تغییر او تغییر می‌کند، همانگونه که صاحب استسقاء (طلب باران) هنگام دعا ردای خود را برمی‌گرداند، پس خداوند حالت خشکسالی را به فراوانی تبدیل می‌کند. و شر آن را از کسی که او را پناهگاه گرفته، دور می‌سازد، پس در او تأثیر نمی‌گذارد، زیرا او محل تأثیر نیست، اگرچه وارد شده است، اما به وجه خاص. فقد ورد در شریعت وارد شده است که بنده فعلی انجام می‌دهد که پروردگارش را به خشم می‌آورد و فعلی انجام می‌دهد که پروردگارش را خشنود می‌سازد. و در آن علم به این است که در چه صورتی دلیل عقلی به کار می‌رود و در چه صورتی به کار نمی‌رود. و در آن علم به حقایق اشیا وجود دارد که با علم به آن‌ها صحیح است که معلومات باشند. و در آن علم به حدود الهی که در دنیا و آخرت در عالم وضع شده‌اند و زمان‌هایشان به پایان می‌رسد، وجود دارد. و در آن علم به علم مولود از غیر مولود، یعنی علم آنچه از فکر و تدبر و رؤیت ظاهر شده است، وجود دارد. و در آن علم به مبارزه هستی (الوجود) با عدم و اینکه در کدام حضرت یا میدان با هم جمع می‌شوند، وجود دارد، و میدان مبارزه‌ای برای آن‌ها جز ممکنات نیست، پس مرجّح غالب است و مرجوح مغلوب. و در آن علم توحید الهی و سی و شش جایگاه آن وجود دارد. و در آن علم به آنچه تعلیل می‌شود و آنچه تعلیل نمی‌شود، وجود دارد. و در آن علم به آنچه باید به عنوان ساز و برگ برای سختی‌ها از اسباب و غیر آن اتخاذ شود، وجود دارد، و جز سببی که با آن دفع شود، نیست. و در آن علم فصل و وصل وجود دارد که دو باب در این کتاب دارند. و در آن علم به اصلی که اکوان و اعیان عالم از آن یا به واسطه آن ظاهر شده‌اند، وجود دارد. و در آن علم به اینکه عالم کیست و چه کسی صورت او را حفظ می‌کند و چه کسی صورت او را حفظ نمی‌کند، وجود دارد. و در آن علم به نسبت حرکت به عالم علوی و آنچه با آن حرکت طلب می‌شود، وجود دارد. و در آن علم به انتقال از حالی به حال و اصل آن چیست، وجود دارد. و در آن علم به نشأت انسان به تنهایی وجود دارد، و منظورم از انسان، انسان حیوانی است. و در آن علم به تثبت در امور و سبب آن و نتیجه آن چیست، وجود دارد. و در آن علم به عجز و قصور و اینکه چه کسی اهل آن است، وجود دارد. و در آن علم به حافظ و حفظ و محفوظ از حیث آنچه محفوظ است و محفوظ به آن، وجود دارد. و در آن علم به زیادت و نقصان وجود دارد، و اینکه دنیا از زمانی که خداوند آن را آفریده، پیوسته در نقصان بوده است و آخرت از زمانی که نقصان در دنیا آغاز شده، پیوسته در فزونی است و هر روز در فزونی است و دنیا نیز هر روز در نقصان است. و در آن علم به کسی که می‌داند کونی از او واقع نمی‌شود، هنگامی که به آن کون مکلف می‌شود، مانند کسی که از فرد زمین‌گیر که قیام از او صحیح نیست، طلب قیام کند، و اینکه چرا آن را می‌خواهد با علم به اینکه نمی‌تواند. و در آن علم به عنایت حق (الحق) به بنده خود در حالی که بنده در آن به عقل و هستی (الوجود) متصف نیست، مانند ابویزید و امثال او از اولیا و مانند عیسی و یحیی از انبیا، وجود دارد. و در آن علم به اقامه حجت‌ها وجود دارد. و در آن علم به آنچه عقل به تنهایی آن را درک می‌کند و آنچه به تنهایی درک نمی‌کند، وجود دارد. و در آن علم به پاک شدن خبیث نزد خبیث وجود دارد. و در آن علم به نسبت صواب به هر مجتهد و معنای نسبت خطا به مجتهد و اینکه آن خطا، علم در نفس الامر و حکم خداوند است، وجود دارد. و در آن علم به صنایع عملی با فطرت و رؤیت و تعلیم وجود دارد. پس این‌ها سه حال هستند: با فطرت در حیوان، و با تعلیم در ضعیف العقل و رؤیت، و با رؤیت و تدبیر در قوی العقلِ صحیح الفکر و نظر. و در آن علم به آنچه باید از آن پرهیز شود و چه کسی پرهیز می‌کند و با چه چیزی پرهیز می‌شود و اصناف پرهیزکاران وجود دارد. و در آن علم به تفاوت میان بلا و ابتلا وجود دارد. و در آن علم به قرین صالح وجود دارد که آیا صلاح در او با جعل (قرار دادن) است یا با اصالت. و در آن علم به حکم جزای وفاق مناسب با اتفاق وجود دارد. و در آن علم به احوال ندامت و اینکه چه زمانی وقت آن معین می‌شود، وجود دارد. و در آن علم به تبدیل و تحویل در صور با بقای عین و اینکه آیا اسم با انتقال حال منتقل می‌شود یا خیر، وجود دارد. و در آن علم به ترتیب کتاب‌های الهی با وجود اینکه کلام در ذات خود یکی است و چگونه تقدم بر کسی که متأخر از اوست، به متأخر نسبت داده می‌شود، وجود دارد. و در آن علم به آنچه عبادت از علوم می‌دهد، وجود دارد. و در آن علم به عموم رحمت مخلوق وجود دارد که از شریف‌ترین و پنهان‌ترین علوم است. و در آن علم به آنچه ممکن است در آن تساوی میان مخلوقات باشد و آنچه نمی‌تواند باشد، وجود دارد. و در آن علم به تنزیه و جایگاه خلق از حق (الحق) و حق (الحق) از خلق وجود دارد. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)»."
  },
  "page_count": 6
}