{
  "id": 120,
  "title": {
    "ar": "الباب العشرون ومائة في معرفة مقام الشكر وأسراره",
    "en": "Chapter 120: Concerning the Knowledge of the Station (مقام) of Gratitude (الشكر) and its Mysteries",
    "ur": "باب ایک سو بیس: مقام شکر (مقام الشکر) اور اس کے اسرار کی معرفت (المعرفۃ) کے بیان میں۔",
    "fa": "باب صد و بیستم در معرفت مقام شکر و اسرار آن"
  },
  "content": {
    "ar": "## (الباب العشرون ومائة في معرفة مقام الشكر وأسراره)\n\n\n> الشكر شكران شكر الفوز والرفد *** هذا من الروح والثاني من الجسد\n\n\n> فالشكر للرفد يعطيني زيادته *** والشكر للفوز مثل السلب للأحد\n\n\n> والشكر للفوز محصور بغايته *** والشكر للرفد لا يجري إلى أمد\n\n\n### [درجات الشكر في الأسرار والأنوار الإلهية]\n\n\nاعلم أن درجات الشكر في الأسرار الإلهية ألف درجة ومائتان وإحدى وخمسون درجة عند العارفين من أهل الله وعند الملامية منهم ألف ومائتان وعشرون ودرجاته في الأنوار عند العارفين خمسمائة وإحدى وخمسون درجة وعند الملامية من أهل الأنوار خمسمائة وعشرون درجة\n\n\n### [الشكر هو الثناء على الله بما يكون منه‏]\n\n\nاعلم أيدك الله أن الشكر هو الثناء على الله بما يكون منه خاصة لصفة هو عليها من حيث ما هو مشكور ومن أسمائه الشكور وشاكر وقد قال لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ فهي صفة تقتضي الزيادة من المشكور للشاكر وهي واجبة بالاتفاق عقلا عند طائفة وشرعا عند طائفة فإن شكر المنعم يجب عقلا وشرعا وما تسمى الله تعالى بشاكر لنا إلا لنزيده من العمل الذي أعطاه أن يشكرنا عليه لنزيده منه كما يزيدنا نعمة إذا شكرناه على نعمه وآلائه ولا يصح الشكر إلا على النعم‏\n\n\n### [الاسم الإلهي الشكور من خصوص أهل الله والاسم الشاكر حظ العامة]\n\n\nفتفطن لنسبة الشكر إليه تعالى ببنية المبالغة في حق من أعطاه من العمل ما تعين على جميع أعضائه وقواه الظاهرة والباطنة في كل حال بما يليق به وفي كل زمان بما يليق به فيشكره الحق على كل ذلك بالاسم الشكور وهذا من خصوص أهل الله وأما العامة فدون هذه الرتبة في أعمال الحال والزمان وجميع الكل فإذا أتوا بالعمل على هذا الحد من النقص تلقاهم الاسم الشاكر لا الشكور فهم على كل حال مشكورون ولكن قال الله تعالى وقَلِيلٌ من عِبادِيَ الشَّكُورُ فهم خاصة الله الذين يرون جميع ما يكون من الله في حقهم وفي حق عباده نعمة إلهية سواء سرهم ذلك أم ساءهم فهم يشكرون على كل حال وهذا الصنف قليل بالوجود وبتعريف الله إيانا بقلتهم وأما الشاكرون من العباد فهم الذين يشكرون الله على المسمى نعمة في العرف خاصة\n\n\n### [الشكر نعت إلهى وهو لفظى وعلمى وعملى‏]\n\n\nوالشكر نعت إلهي وهو لفظي وعلمي وعملي فاللفظي الثناء على الله بما يكون منه على حد ما تقدم والعملي قوله تعالى وجِفانٍ كَالْجَوابِ وقُدُورٍ راسِياتٍ اعْمَلُوا آلَ داوُدَ شُكْراً وقَلِيلٌ من عِبادِيَ الشَّكُورُ فهذا هو الشكر العملي وقوله وأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ فهو موجه له وجه إلى اللفظ وهو الذكر بما أنعم الله به عليه فإذا ذكر ما أنعم الله به عليه من النعم المعلومة في العرف من المال والعلم فقد عرض نفسه لنقصد في ذلك فيجود به على القاصد فيدخلك في الشكر العملي لأن من النعم ما يكون مستورا لا يعرف صاحبها أنه صاحب نعمة فلا يقصد فإذا حدث بما أعطاه الله وأنعم عليه به قصد في ذلك فلهذا أمر بالحديث بالنعم والتحدث بالنعم شكر والإعطاء منها شكر على شكر فجمع بين الذكر والعمل فيقول الحمد لله المنعم المفضل‏\n\n\n### [الشكر العلمي هو حق الشكر وهو الشكر الحق‏]\n\n\nوأما الشكر العلمي وهو حق الشكر فهو أن يرى النعمة من الله فإذا رأيتها من الله فقد شكرته حق الشكر\n\n\nخرج ابن ماجة في سننه عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أن الله أوحى إلى موسى يا موسى اشكرني حق الشكر قال موسى يا رب ومن يقدر على ذلك قال يا موسى إذا رأيت النعمة مني فقد شكرتني حق الشكر\n\n\nهذا حال من رأى النعمة ومن نعمته على عبده أن يوفقه لبذل ما عنده من نعم الله على المحتاجين من عباده فيعطيهم بيد حق لا بيده فهم ناظرون‏\nفي هذه النعمة وهي رؤيتهم ذلك التصريف من عند الله في مرضاة الله فيدخلون في حزب من شكره حق الشكر وهذا هو أعلى الشكر في الشاكرين وهو هين على العارفين المتجردين عن أوصافهم برد الأمور إلى الله‏\n\n\n### [نسبة الشكر إلى عالم البرازخ وهو الجبروت‏]\n\n\nوليس لهذا المقام نسبة إلا لعالم البرازخ وهو الجبروت ليعم الطرفين فإن البرازخ أتم المقامات علما بالأمور وهو مقام الأسماء الإلهية فإنها برزخ بيننا وبين المسمى فلها نظر إليه من كونها اسما له ولها نظر إلينا من حيث ما تعطي فينا من الآثار المنسوبة للمسمى فتعرف المسمى وتعرفنا\n\n\n### [الزيادة التي يعطيها الشكر ما هي‏]\n\n\nواختلف أصحابنا في الزيادة التي يعطيها الشكر هل هي من جنس ما وقع الشكر عليه أو لا يكون إلا من نعم أخر أو منهما فالمحققون يجعلونها من الجنس المشكور من أجله وما لم يكن من جنسه فما هو من الزيادة التي أوجبها الشكر بل تكون تلك النعم من باب المنة ابتداء لا من باب الجزاء ومنهم من قال أي نعمة وقعت بعد الشكر فهي جزاء وهي الزيادة وما لم يقع عقيب شكر من النعم فهو من عين المنة وإنما قالوا ذلك لعدم معرفتهم بالمناسبة بين الأشياء التي اختارها الحكيم سبحانه وقصد القوم القائلون بهذا تنزيه الحق عن التقييد بل يعطي مما شاء من غير تقييد فالمحققون أكبر علما منهم وهؤلاء في الظاهر أنزه وفي المعنى الكل سواء في تنزيه الحق والله الموفق انتهى الجزء التاسع والتسعون‏\n\n\n( (بسم الله الرحمن الرحيم))\n\n",
    "en": "## Chapter One Hundred and Twenty: Concerning the Knowledge of the Station of Gratitude and its Secrets\n\nGratitude is two kinds: the gratitude of Attainment (الفوز) and the gratitude of Aid (الرفد); the former is from the Spirit, and the second is from the body.\n\nGratitude for Aid grants me its increase, while gratitude for Attainment is like the stripping away before the One (الأحد).\n\nGratitude for Attainment is confined by its limit, but gratitude for Aid runs without end.\n\n### [The Degrees of Gratitude in the Divine Secrets and Lights]\n\nKnow that the degrees (درجات) of Gratitude (الشكر) concerning the Divine Secrets (الأسرار الإلهية) are one thousand two hundred and fifty-one degrees according to the Gnostics (العارفين) among the People of Allah (أهل الله). And according to the Malamiyya among them, they are one thousand two hundred and twenty. Its degrees concerning the Lights (الأنوار) are five hundred and fifty-one degrees according to the Gnostics, and five hundred and twenty degrees according to the Malamiyya among the People of Lights.\n\n### [Gratitude is the Praise of Allah for What Proceeds from Him]\n\nKnow, may Allah support you, that Gratitude (الشكر) is the praise (الثناء) of Allah for what proceeds from Him, specifically for an Attribute (صفة) He possesses, in His capacity as the One who is thanked (المشكور). Among His Names (الأسماء) are The All-Grateful (الشكور) and The Grateful (شاكر). He has said: <<لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ>> (If you are grateful, I will surely increase you). This is an Attribute that necessitates increase from the One who is thanked to the one who is grateful. This is obligatory by consensus: rationally (عقلا) according to one group, and legally (شرعا) according to another, for thanking the Benefactor is obligatory rationally and legally. Allah the Exalted did not name Himself The Grateful (شاكر) toward us except so that we might increase the action He granted us, for which He thanks us, so that we may increase it, just as He increases us in favor (نعمة) when we thank Him for His favors and blessings (آلائه). Gratitude is only valid concerning favors.\n\n### [The Divine Name Al-Shakur is Specific to the People of Allah, and the Name Al-Shakir is the Share of the General Public]\n\nPay attention to the attribution of Gratitude to the Exalted [The Real] using the intensive form (بنية المبالغة) in the case of one whom He has granted action that is incumbent upon all his limbs and his outward and inward powers, in every state (حال) in a manner befitting it, and in every time (زمان) in a manner befitting it. The Real (الحق) thanks him for all of that by the Name The All-Grateful (الشكور). This is specific to the People of Allah (أهل الله). As for the general public (العامة), they fall short of this rank (رتبة) in the actions of state, time, and the totality of all things. When they perform the action with this degree of deficiency, the Name The Grateful (الشاكر) meets them, not The All-Grateful (الشكور). They are thanked in every state, but Allah the Exalted said: <<وَقَلِيلٌ مِنْ عِبَادِيَ الشَّكُورُ>> (And few of My servants are truly grateful [All-Grateful]). These are the elite (خاصة) of Allah who see everything that proceeds from Allah concerning themselves and concerning His servants as a Divine favor (نعمة إلهية), whether it pleases them or grieves them. Thus, they are grateful in every state. This category is few in existence, and by Allah informing us of their scarcity. As for the grateful servants (الشاكرون), they are those who thank Allah specifically for what is conventionally termed a favor (نعمة).\n\n### [Gratitude is a Divine Quality, and it is Verbal, Cognitive, and Practical]\n\nGratitude (الشكر) is a Divine Quality (نعت إلهي). It is verbal (لفظي), cognitive (علمي), and practical (عملي). The verbal is the praise of Allah for what proceeds from Him, as previously mentioned. The practical (العملي) is indicated by His saying: <<وَجِفَانٍ كَالْجَوَابِ وَقُدُورٍ رَاسِيَاتٍ اعْمَلُوا آلَ دَاوُودَ شُكْرًا وَقَلِيلٌ مِنْ عِبَادِيَ الشَّكُورُ>> (And bowls like reservoirs, and stationary cauldrons. Work, O family of David, in gratitude. And few of My servants are truly grateful [All-Grateful]). This is practical gratitude. And His saying: <<وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ>> (But as for the favor of your Lord, report [it])—this is directed, on one hand, toward the verbal, which is the remembrance (الذكر) of what Allah has favored him with. If he mentions the favors Allah has bestowed upon him—the conventionally known favors of wealth and knowledge—he has exposed himself to being sought out for that, and he then bestows it generously upon the seeker. This enters you into practical gratitude, because some favors are hidden, and their possessor does not know that he possesses a favor, so he is not sought out. But if he reports what Allah has given him and favored him with, he is sought out for it. For this reason, he was commanded to report the favors. Reporting the favors is gratitude, and giving from them is gratitude upon gratitude. Thus, he combines remembrance and action, saying: \"Praise be to Allah, the Bestower, the Fulfiller of Favors.\"\n\n### [Cognitive Gratitude is the True Gratitude]\n\nAs for cognitive gratitude (الشكر العلمي), which is the true gratitude (حق الشكر), it is that one sees the favor (النعمة) as coming from Allah. If you see it as coming from Allah, you have thanked Him with the true gratitude.\n\nIbn Majah recorded in his *Sunan* from the Messenger of Allah (peace and blessings be upon him) that Allah revealed to Moses: \"O Moses, thank Me with the true gratitude.\" Moses said: \"O Lord, who is capable of that?\" He said: \"O Moses, if you see the favor as coming from Me, you have thanked Me with the true gratitude.\"\n\nThis is the state (حال) of one who sees the favor. And part of His favor upon His servant is that He grants him success in expending what he possesses of Allah’s favors upon His needy servants, so that he gives them with the hand of The Real (يد حق), not with his own hand. They are observing this favor, which is their vision of that disposition (التصريف) coming from Allah, in the pursuit of Allah’s pleasure. Thus, they enter the party of those who thank Him with the true gratitude. This is the highest form of gratitude among the grateful, and it is easy for the Gnostics (العارفين) who are stripped of their own attributes (أوصافهم) by referring all matters back to Allah.\n\n### [The Relation of Gratitude to the World of Isthmuses, which is the Jabarut]\n\nThis station (مقام) has no relation except to the World of the Isthmuses (عالم البرازخ), which is the Realm of Power (الجبروت), so that it encompasses both sides. For the Isthmuses (البرازخ) are the most complete of stations in the knowledge of affairs. It is the station of the Divine Names (الأسماء الإلهية), for they are an Isthmus (برزخ) between us and the Named One (المسمى). They look toward Him by virtue of being a Name for Him, and they look toward us by virtue of the effects (الآثار) they produce in us, which are attributed to the Named One. Thus, they make the Named One known, and they make us known.\n\n### [What is the Increase Granted by Gratitude?]\n\nOur companions (أصحابنا) differed concerning the increase (الزيادة) granted by gratitude: Is it of the same kind as that for which the gratitude was offered, or is it only from other favors, or is it from both? The Verifiers (المحققون) hold that it is of the same kind as that for which gratitude was offered. Whatever is not of that kind is not part of the increase necessitated by gratitude; rather, those favors are considered an initial gift (المنة ابتداء), not a reward (الجزاء). Others among them said that any favor that occurs after gratitude is a reward, and that is the increase; and any favor that does not occur immediately following gratitude is purely a gift (عين المنة). They only said this due to their lack of knowledge concerning the suitability (المناسبة) between the things chosen by the All-Wise (الحكيم), the Glorified. The intention of those who hold this view is to declare The Real (الحق) transcendent above restriction, arguing that He gives whatever He wills without restriction. However, the Verifiers possess greater knowledge than them. While the latter group appears more transcendent (أنزه) outwardly, in reality, all are equal in declaring The Real transcendent. And Allah is the Granter of Success.\n\nEnd of the Ninety-Ninth Part.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "(باب ایک سو بیس: مقام شکر اور اس کے اسرار کی معرفت میں)\n\nشکر دو طرح کا ہے: شکرِ فوز (کامیابی کا شکر) اور شکرِ رفد (عطا کا شکر)۔ یہ (شکرِ فوز) روح سے ہے اور دوسرا (شکرِ رفد) جسم سے ہے۔\n\nپس شکرِ رفد مجھے اس کی زیادتی عطا کرتا ہے، اور شکرِ فوز احد (ذات حق) کے لیے سلب (نفی) کی مانند ہے۔\n\nاور شکرِ فوز اپنی انتہا میں محدود ہے، جبکہ شکرِ رفد کسی مدت تک جاری نہیں رہتا۔\n\n### (اسرار اور انوار الٰہیہ میں شکر کے درجات)\n\nجان لیجیے کہ اسرار الٰہیہ (الأسرار الإلهية) میں شکر کے درجات اہلِ اللہ کے عارفین (العارفين) کے نزدیک ایک ہزار دو سو اکاون (۱،۲۵۱) درجے ہیں، اور ان میں سے ملامیہ (الملامية) کے نزدیک ایک ہزار دو سو بیس (۱،۲۲۰) ہیں۔ اور انوار (الأنوار) میں اس کے درجات عارفین کے نزدیک پانچ سو اکاون (۵۵۱) درجے ہیں، اور اہلِ انوار میں سے ملامیہ کے نزدیک پانچ سو بیس (۵۲۰) درجے ہیں۔\n\n### (شکر اللہ کی اس پر ثناء کرنا ہے جو خاص طور پر اس کی طرف سے ہوتا ہے)\n\nجان لیجیے، اللہ آپ کی تائید فرمائے، کہ شکر اللہ تعالیٰ کی اس صفت پر ثناء کرنا ہے جو خاص طور پر اس کی طرف سے ہوتی ہے، اس حیثیت سے کہ وہ مشکور (جس کا شکر کیا جائے) ہے۔ اور اس کے اسماء میں الشکور (الشكور) اور شاکر (شاكر) شامل ہیں۔ اور اس نے فرمایا: لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ (اگر تم شکر کرو گے تو میں تمہیں ضرور زیادہ دوں گا)۔ [ابراہیم: ۷] یہ ایک ایسی صفت ہے جو مشکور کی طرف سے شاکر کے لیے زیادتی کا تقاضا کرتی ہے، اور یہ بالاتفاق عقلی طور پر ایک گروہ کے نزدیک اور شرعی طور پر دوسرے گروہ کے نزدیک واجب ہے۔ کیونکہ منعم (نعمت دینے والے) کا شکر عقلی اور شرعی طور پر واجب ہے۔ اور اللہ تعالیٰ نے ہمیں شاکر (شاكر) اس لیے نہیں کہا مگر تاکہ ہم اس عمل میں اضافہ کریں جو اس نے ہمیں دیا ہے کہ ہم اس کا شکر ادا کریں، تاکہ ہم اس میں اضافہ کریں، جیسا کہ جب ہم اس کی نعمتوں اور عطا کردہ چیزوں کا شکر ادا کرتے ہیں تو وہ ہماری نعمتوں میں اضافہ کرتا ہے۔ اور شکر صرف نعمتوں پر ہی صحیح ہوتا ہے۔\n\n### (اسم الٰہی الشکور اہلِ اللہ کی خصوصیت ہے اور اسم الشاكر عام لوگوں کا حصہ ہے)\n\nپس اللہ تعالیٰ کی طرف شکر کی نسبت کو صیغہ مبالغہ (الشكور) کے ساتھ اس شخص کے حق میں سمجھیں جسے اللہ نے ایسا عمل عطا کیا جو ہر حال میں اور ہر زمانے میں اس کے تمام ظاہری اور باطنی اعضاء اور قوتوں پر اس کے لائق متعین ہو جائے۔ پس حق (الحق) اس سب پر اس کا شکر اسم الشکور (الشكور) کے ذریعے کرتا ہے۔ اور یہ اہلِ اللہ (أهل الله) کی خصوصیات میں سے ہے۔ جہاں تک عام لوگوں (العامة) کا تعلق ہے، وہ حال اور زمانے کے اعمال اور تمام امور میں اس رتبے سے کم ہیں۔ جب وہ اس حد تک نقص کے ساتھ عمل کرتے ہیں تو ان کا استقبال اسم الشاكر (الشاكر) کرتا ہے نہ کہ الشكور (الشكور)۔ وہ ہر حال میں مشکور ہیں، لیکن اللہ تعالیٰ نے فرمایا: وقَلِيلٌ من عِبادِيَ الشَّكُورُ (اور میرے بندوں میں سے بہت کم شکر گزار ہیں)۔ [سبا: ۱۳] یہ اللہ کے خاص بندے ہیں جو ہر اس چیز کو جو ان کے حق میں یا اس کے بندوں کے حق میں اللہ کی طرف سے ہوتی ہے، ایک نعمت الٰہیہ (نعمة إلهية) سمجھتے ہیں، خواہ وہ انہیں خوش کرے یا غمگین کرے۔ پس وہ ہر حال میں شکر ادا کرتے ہیں۔ اور یہ صنف وجود میں بھی کم ہے اور اللہ کے ہمیں ان کی قلت سے آگاہ کرنے سے بھی۔ اور جہاں تک بندوں میں سے شاکرون (الشاكرون) کا تعلق ہے، وہ صرف اس چیز پر اللہ کا شکر ادا کرتے ہیں جسے عرف عام میں نعمت کہا جاتا ہے۔\n\n### (شکر ایک نعت الٰہی ہے اور وہ لفظی، علمی اور عملی ہوتا ہے)\n\nاور شکر ایک نعت الٰہی (نعت إلهي) ہے، اور یہ لفظی، علمی اور عملی ہوتا ہے۔ پس لفظی شکر اللہ کی اس پر ثناء کرنا ہے جو اس کی طرف سے ہوتا ہے، جیسا کہ پہلے بیان ہوا۔ اور عملی شکر اللہ تعالیٰ کا یہ قول ہے: وجِفانٍ كَالْجَوابِ وقُدُورٍ راسِياتٍ اعْمَلُوا آلَ داوُدَ شُكْراً وقَلِيلٌ من عِبادِيَ الشَّكُورُ (اور لگن جیسے بڑے پیالے اور جمی ہوئی دیگیں (بناؤ)۔ اے آلِ داؤد! شکر کے طور پر عمل کرو۔ اور میرے بندوں میں سے بہت کم شکر گزار ہیں)۔ [سبا: ۱۳] پس یہ عملی شکر ہے۔ اور اس کا قول: وأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ (اور اپنے رب کی نعمت کا خوب چرچا کرو)۔ [الضحیٰ: ۱۱] یہ دو رُخ رکھتا ہے: ایک رُخ لفظی ہے، جو ان نعمتوں کا ذکر کرنا ہے جو اللہ نے اس پر انعام کیں۔ پس جب وہ مال یا علم جیسی عرف عام میں معلوم نعمتوں کا ذکر کرتا ہے، تو وہ خود کو اس میں قصد کرنے والوں کے لیے پیش کرتا ہے، اور وہ قصد کرنے والے پر سخاوت کرتا ہے، پس یہ اسے عملی شکر میں داخل کر دیتا ہے۔ کیونکہ بعض نعمتیں پوشیدہ ہوتی ہیں اور ان کا مالک نہیں جانتا کہ وہ نعمت کا مالک ہے، لہٰذا اس کا قصد نہیں کیا جاتا۔ پس جب وہ اس چیز کا ذکر کرتا ہے جو اللہ نے اسے عطا کی اور انعام کی، تو اس کا قصد کیا جاتا ہے۔ اسی لیے اسے نعمتوں کا چرچا کرنے کا حکم دیا گیا ہے۔ اور نعمتوں کا چرچا کرنا شکر ہے، اور ان میں سے عطا کرنا شکر پر شکر ہے۔ پس یہ ذکر اور عمل کو جمع کرتا ہے، اور وہ کہتا ہے: \"الحمد للہ المنعم المفضل\" (تمام تعریفیں اللہ کے لیے ہیں جو انعام کرنے والا اور فضل کرنے والا ہے)۔\n\n### (علمی شکر ہی حق شکر ہے اور وہی حقیقی شکر ہے)\n\nاور جہاں تک علمی شکر (الشكر العلمي) کا تعلق ہے، جو حق شکر (حق الشكر) ہے، وہ یہ ہے کہ نعمت کو اللہ کی طرف سے دیکھا جائے۔ پس جب آپ اسے اللہ کی طرف سے دیکھتے ہیں تو آپ نے اس کا حق شکر ادا کر دیا۔\n\nابن ماجہ نے اپنی سنن میں رسول اللہ صلی اللہ علیہ وسلم سے روایت کیا ہے کہ اللہ نے موسیٰ علیہ السلام کی طرف وحی کی: \"اے موسیٰ! میرا حق شکر ادا کر۔\" موسیٰ نے عرض کیا: \"اے رب! اس کی طاقت کون رکھتا ہے؟\" اللہ نے فرمایا: \"اے موسیٰ! جب تو نعمت کو میری طرف سے دیکھے تو تو نے میرا حق شکر ادا کر دیا۔\"\n\nیہ اس شخص کا حال ہے جس نے نعمت کو دیکھا۔ اور بندے پر اس کی نعمتوں میں سے یہ بھی ہے کہ وہ اسے توفیق دے کہ وہ اللہ کی نعمتوں میں سے جو کچھ اس کے پاس ہے، اسے اپنے محتاج بندوں پر خرچ کرے، پس وہ انہیں حق (الحق) کے ہاتھ سے دیتا ہے نہ کہ اپنے ہاتھ سے۔ وہ اس نعمت میں غور کرتے ہیں، اور وہ یہ ہے کہ وہ اس تصرف کو اللہ کی طرف سے اللہ کی رضا میں دیکھتے ہیں۔ پس وہ ان لوگوں کے گروہ میں شامل ہو جاتے ہیں جنہوں نے اس کا حق شکر ادا کیا۔ اور یہ شکر گزاروں میں سب سے اعلیٰ شکر ہے، اور یہ ان عارفین (العارفين) کے لیے آسان ہے جو اپنے اوصاف سے تجرد اختیار کر کے تمام امور کو اللہ کی طرف لوٹا دیتے ہیں۔\n\n### (شکر کی نسبت عالم برازخ یعنی جبروت سے ہے)\n\nاور اس مقام (مقام) کی نسبت صرف عالم البرازخ (عالم البرازخ) سے ہے، جو کہ جبروت (الجبروت) ہے، تاکہ یہ دونوں اطراف کو شامل کر لے۔ کیونکہ برازخ (البرازخ) امور کے علم میں سب سے مکمل مقامات ہیں۔ اور یہ اسماء الٰہیہ (الأسماء الإلهية) کا مقام ہے، کیونکہ وہ ہمارے اور مسمیٰ (جس کا نام لیا گیا) کے درمیان برزخ ہیں۔ ان کی نظر اس کی طرف ہوتی ہے اس حیثیت سے کہ وہ اس کا نام ہیں، اور ان کی نظر ہماری طرف ہوتی ہے اس حیثیت سے کہ وہ ہم میں وہ آثار عطا کرتے ہیں جو مسمیٰ کی طرف منسوب ہوتے ہیں۔ پس وہ مسمیٰ کو بھی جانتے ہیں اور ہمیں بھی جانتے ہیں۔\n\n### (وہ زیادتی کیا ہے جو شکر عطا کرتا ہے؟)\n\nاور ہمارے ساتھیوں نے اس زیادتی (الزيادة) کے بارے میں اختلاف کیا جو شکر عطا کرتا ہے، کہ کیا وہ اسی جنس کی ہوتی ہے جس پر شکر کیا گیا، یا وہ صرف دوسری نعمتوں میں سے ہوتی ہے، یا دونوں میں سے؟ پس محققین (المحققون) اسے اسی جنس کا قرار دیتے ہیں جس کے لیے شکر کیا گیا، اور جو اس کی جنس سے نہ ہو، وہ اس زیادتی میں سے نہیں ہے جسے شکر نے واجب کیا ہو، بلکہ وہ نعمتیں ابتداءً احسان (منة) کے باب سے ہوتی ہیں نہ کہ جزا کے باب سے۔ اور ان میں سے بعض نے کہا کہ شکر کے بعد جو بھی نعمت واقع ہو، وہ جزا ہے اور وہی زیادتی ہے۔ اور جو نعمت شکر کے فوراً بعد واقع نہ ہو، وہ عین احسان (منة) ہے۔ انہوں نے یہ بات اس لیے کہی کہ وہ ان چیزوں کے درمیان مناسبت (مناسبة) کو نہیں جانتے جنہیں حکیم (الحكيم) سبحانہ نے اختیار کیا ہے۔ اور اس بات کے قائل لوگوں کا مقصد حق (الحق) کو تقیید سے پاک کرنا تھا، بلکہ وہ جو چاہتا ہے بغیر کسی تقیید کے عطا کرتا ہے۔ پس محققین ان سے زیادہ علم والے ہیں، اور یہ لوگ ظاہری طور پر زیادہ پاکیزہ ہیں، لیکن معنی میں حق (الحق) کو پاک قرار دینے میں سب برابر ہیں۔ اور اللہ ہی توفیق دینے والا ہے۔\n\n(ننانوے واں حصہ ختم ہوا)\n\n(بسم اللہ الرحمن الرحیم)",
    "fa": "باب صد و بیستم در معرفت مقام شکر و اسرار آن\n\nشکر دو نوع است: شکر فوز (وصول) و شکر رفد (نعمت) / این (شکر فوز) از روح است و دومی (شکر رفد) از جسد.\n\nپس شکر رفد (نعمت) به من فزونی‌اش را می‌دهد / و شکر فوز (وصول) مانند سلب (نفی) برای احد است.\n\nو شکر فوز (وصول) به غایت خود محدود است / و شکر رفد (نعمت) تا ابد ادامه می‌یابد.\n\n### [درجات شکر در اسرار و انوار الهی]\n\nبدان که درجات شکر در اسرار الهی نزد عارفان از اهل الله، هزار و دویست و پنجاه و یک درجه است، و نزد ملامیه (الملامية) از ایشان هزار و دویست و بیست درجه است. و درجات آن در انوار نزد عارفان پانصد و پنجاه و یک درجه است، و نزد ملامیه (الملامية) از اهل انوار پانصد و بیست درجه است.\n\n### [شکر، ثنا گفتن بر خداوند به سبب آنچه از او صادر می‌شود]\n\nبدان، خداوند تو را تأیید کند، که شکر عبارت است از ثنا گفتن بر خداوند به سبب آنچه خاصه از او صادر می‌شود، به خاطر صفتی که او بر آن است از حیث مشکور بودن. و از اسماء او الشکور (الشکور) و شاكر (شاكر) است. و فرموده است: لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ (اگر شکر کنید، قطعاً بر شما می‌افزایم). پس شکر صفتی است که مقتضی زیادت از سوی مشکور برای شاکر است، و این به اتفاق عقلاً نزد طایفه‌ای و شرعاً نزد طایفه‌ای دیگر واجب است؛ زیرا شکر منعم عقلاً و شرعاً واجب است. و خداوند ما را به نام شاكر (شاكر) نخوانده است، مگر برای آنکه ما را از عملی که به ما عطا کرده تا او را بر آن شکر کنیم، بیفزاید، تا ما نیز بر آن عمل بیفزاییم، همان‌گونه که او نیز هرگاه ما او را بر نعمت‌ها و عطایایش شکر کنیم، بر نعمت‌هایش می‌افزاید. و شکر جز بر نعمت‌ها صحیح نیست.\n\n### [اسم الهی الشكور (الشکور) از خصوصیات اهل الله و اسم الشاكر (الشاكر) بهره‌ی عموم است]\n\nپس به نسبت شکر به حق تعالی با صیغه مبالغه در حق کسی که از عمل به او چیزی عطا کرده است که بر تمام اعضا و قوای ظاهری و باطنی او در هر حال به آنچه شایسته آن است و در هر زمان به آنچه شایسته آن است، واجب شده است، توجه کن. پس حق (الحق) او را بر تمام این‌ها با اسم الشكور (الشکور) شکر می‌کند. و این از خصوصیات اهل الله است. اما عموم مردم، در اعمال حال و زمان و تمام کل، پایین‌تر از این رتبه هستند. پس هرگاه عمل را با این حد از نقص انجام دهند، اسم الشاكر (الشاكر) نه الشكور (الشکور)، با آنان مواجه می‌شود. پس آنان در هر حال مشکورند، اما خداوند متعال فرموده است: وقَلِيلٌ من عِبادِيَ الشَّكُورُ (و اندکی از بندگان من شکرگزارند). اینان خاصان خدا هستند که هر آنچه از خدا در حق خودشان و در حق بندگانش صادر می‌شود، چه آنان را شاد کند و چه ناراحت، نعمتی الهی می‌بینند. پس آنان در هر حال شکر می‌کنند. و این صنف هم از نظر وجودی و هم به واسطه آگاه ساختن خداوند ما را از کمیِ آنان، اندک هستند. اما الشاكرون (الشاكرون) از بندگان، کسانی هستند که خداوند را فقط بر آنچه در عرف، نعمت نامیده می‌شود، شکر می‌کنند.\n\n### [شکر نعت الهی است و لفظی، علمی و عملی است]\n\nو شکر نعت (صفت) الهی است و لفظی، علمی و عملی است. شکر لفظی، ثنا گفتن بر خداوند به سبب آنچه از او صادر می‌شود، بر همان حدی است که پیش‌تر گذشت. شکر عملی، قول خداوند متعال است: وجِفانٍ كَالْجَوابِ وقُدُورٍ راسِياتٍ اعْمَلُوا آلَ داوُدَ شُكْراً وقَلِيلٌ من عِبادِيَ الشَّكُورُ (و کاسه‌هایی چون حوض‌ها و دیگ‌هایی ثابت. ای خاندان داوود، شکرگزارانه عمل کنید، و اندکی از بندگان من شکرگزارند). این همان شکر عملی است. و قول او: وأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ (و اما نعمت پروردگارت را بازگو کن)، این امر دو وجه دارد: یک وجه آن به شکر لفظی برمی‌گردد، که همان یاد کردن از نعمت‌هایی است که خداوند به او ارزانی داشته است. پس هرگاه از نعمت‌هایی که خداوند به او داده است، مانند مال و علم که در عرف معلوم است، یاد کند، خود را در معرض قصد قرار داده است تا در آن مورد به او رجوع شود، و او نیز بر قصدکننده جود کند. در این صورت، تو را وارد شکر عملی می‌کند؛ زیرا برخی از نعمت‌ها مستورند و صاحب آن‌ها نمی‌داند که صاحب نعمت است، پس مورد قصد قرار نمی‌گیرد. اما هرگاه آنچه را خداوند به او عطا کرده و انعام نموده بازگو کند، مورد قصد قرار می‌گیرد. به همین دلیل به بازگو کردن نعمت‌ها امر شده است. و بازگو کردن نعمت‌ها شکر است، و بخشیدن از آن‌ها شکر بر شکر است. پس بین ذکر و عمل جمع می‌کند و می‌گوید: الحمد لله المنعم المفضل (ستایش خدای منعم و فضل‌کننده را).\n\n### [شکر علمی همان حق الشکر (حق شکر) و شکر حقیقی است]\n\nو اما شکر علمی، که همان حق الشكر (حق شکر) است، این است که نعمت را از جانب خداوند ببینی. پس هرگاه آن را از خداوند دیدی، او را حق الشكر (حق شکر) شکر کرده‌ای.\n\nابن ماجه در سنن خود از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) روایت کرده است که خداوند به موسی وحی کرد: یا موسى اشكرني حق الشكر (ای موسی، مرا حق الشکر شکر کن). قال موسى يا رب ومن يقدر على ذلك (موسی گفت: پروردگارا، چه کسی بر این کار قادر است؟) قال يا موسى إذا رأيت النعمة مني فقد شكرتني حق الشكر (فرمود: ای موسی، هرگاه نعمت را از من دیدی، مرا حق الشکر شکر کرده‌ای).\n\nاین حال کسی است که نعمت را دیده است. و از جمله نعمت‌های او بر بنده‌اش این است که او را موفق سازد تا آنچه از نعمت‌های خدا نزد اوست، بر نیازمندان از بندگانش ببخشد، و آن را با دست حق (الحق) نه با دست خود، به آنان عطا کند. پس آنان (نیازمندان) در این نعمت نظر می‌کنند، و آن، دیدن آن تصرف از جانب خداوند در جهت رضای خداست. پس آنان وارد حزب کسانی می‌شوند که او را حق الشكر (حق شکر) شکر کرده‌اند. و این بالاترین شکر در میان شاکران است، و بر عارفانی که با بازگرداندن امور به خداوند، از اوصاف خود تجرد یافته‌اند، آسان است.\n\n### [نسبت شکر به عالم برازخ که همان جبروت است]\n\nو این مقام نسبتی ندارد مگر به عالم برازخ (البرازخ) که همان جبروت (الجبروت) است، تا هر دو طرف را در بر گیرد. زیرا برازخ (البرازخ) کامل‌ترین مقامات از نظر علم به امور است، و آن مقام اسماء الهی است؛ زیرا اسماء، برزخ (برزخ) بین ما و مسمّا هستند. پس اسماء از حیث اسم بودن برای مسمّا، نظری به او دارند، و از حیث آثاری که در ما می‌دهند و به مسمّا نسبت داده می‌شوند، نظری به ما دارند. پس مسمّا را می‌شناسند و ما را نیز می‌شناسانند.\n\n### [زیادتی که شکر عطا می‌کند چیست]\n\nو اصحاب ما در مورد زیادتی که شکر عطا می‌کند اختلاف کرده‌اند: آیا آن زیادتی از جنس همان چیزی است که شکر بر آن واقع شده است، یا فقط از نعمت‌های دیگر است، یا از هر دو؟ محققان آن را از جنس همان چیزی می‌دانند که به خاطر آن شکر شده است. و آنچه از جنس آن نباشد، از آن زیادتی نیست که شکر موجب آن شده است، بلکه آن نعمت‌ها از باب منّت ابتدایی هستند، نه از باب جزا. و برخی گفته‌اند: هر نعمتی که پس از شکر واقع شود، جزا و همان زیادتی است، و نعمتی که به دنبال شکر واقع نشود، عین منّت است. آنان این را گفتند به دلیل عدم معرفتشان به مناسبت میان اموری که حکیم سبحانه آن‌ها را برگزیده است. و قصد کسانی که این قول را دارند، تنزیه حق (الحق) از تقیید است، بلکه او از آنچه بخواهد بدون تقیید عطا می‌کند. پس محققان از نظر علمی بزرگ‌تر از آنان هستند، و این گروه (دومی) در ظاهر منزه‌ترند، اما در معنا، همه در تنزیه حق (الحق) یکسان هستند. و خداوند توفیق‌دهنده است.\n\nجزء نود و نهم به پایان رسید.\n\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 2
}