{
  "id": 175,
  "title": {
    "ar": "الباب الخامس والسبعون ومائة في مقام ترك السفر",
    "en": "Chapter One Hundred and Seventy-Five: Concerning the Station (مقام) of Abandoning the Journey (السفر).",
    "ur": "پینسٹھواں اور ایک سوواں باب سفر کو ترک کرنے کے مقام کے بیان میں",
    "fa": "باب صد و هفتاد و پنجم در مقام ترک سفر"
  },
  "content": {
    "ar": "## (الباب الخامس والسبعون ومائة في مقام ترك السفر)\n\n\n> احذر بأن تجعل الأعيان واحدة *** إذا أتتك بها الآيات والسور\n\n\n> من قوله أنت عبدي والإله أنا *** وما لنا عندكم عين ولا أثر\n\n\nقال الله تعالى الَّذِي أَحَلَّنا دارَ الْمُقامَةِ من فَضْلِهِ لا يَمَسُّنا فِيها نَصَبٌ ولا يَمَسُّنا فِيها لُغُوبٌ قال تعالى وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ فقطع المسافات زيادة تعب بل تعب خاصة فإنه ما يحركني إلا طلبه فلو لا أني جعلته مطلوبي ومقصدي بهذه السياحة والسفر ما طلبته وقد أخبرني أنه معي في حال انتقالاتي كما هو معي في حال الإقامة وله في كل شي‏ء وجهة فلما ذا أجول فالحركة لتحصيله دليل على عدم الوجدان في السكون فاطلب وجهه في موضع إقامتي فإذا عرفته فيه كنت منزلا من منازل القمر مقصودا لا قاصدا ولا نازلا تطلبني الأسماء ولا أطلبها وتقصدني الأنوار ولا أقصدها وقفت مع من لا يجوز عليه التحرك والانتقال فصاحب السفر مع‏\n\n\nقوله ينزل ربنا كل ليلة إلى السماء الدنيا\n\n\nوصاحب الإقامة مع قوله الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ والسكون أولى من الحركة فإن العبد مأمور بالسكون تحت مجاري الأقدار وما يأتي به الله إليه في الليل والنهار وقال في ذم من بادر الأقدار بادرني عبدي بنفسه حرمت عليه الجنة والمبادرة حركة ما قال الله لنا آمرا فَاتَّخِذْهُ وَكِيلًا إلا لنسكن ويكون هو سبحانه الذي يتصرف في أمر عبده حتى يوفيه ما قدر له من كل ما يصيبه حتى أنه لو كان مما يصيبه السفر والانتقال لنقله الحق بهذه الصفة التي هو عليها من السكون في محفة عناية إلهية لا يعرف الحركة المتعبة مستريحا مظللا عليه مخدوما هذا سفر تارك السفر إذا كان مقدرا له السفر وقد ذقنا الأمرين ورأينا السكون أرجح من الحركة وأقوى في المعرفة مع انتقال الأحوال عليه في كل نفس وذاك الانتقال عليه لا بد منه له فهو طريق مطرقة يسلك فيها ولا يسلك فإذا انتقل هو بذاته فلا يزيد شيئا على تلك الانتقالات عليه‏\nإلا التعب خاصة فكان المسافر يستعجل عذابا ومشقة فإن الأمور الجارية على العبد مثل الرزق والأجل إن لم تأت إليه أتى إليها لا بد من ذلك‏\n\n\n> ولا معنى لشكوى الشوق يوما *** إلى من لا يزول من العيان‏\n\n\nالسكون مع المشاهدة والحركة مع الفقد إلا الحركة المأمور بها لأنك لا تخلو إن تتحرك في طلبه فأنت فاقدا وفي غير طلبه فأنت خاسر فالسكون بكل حال أولى من الحركة التي في مقام ذلك السكون وأنت في مقام أن تتحرك بالله فالسكون بالله مع الله أولى لراحة الوقت فإنه والله إن كنت فاقدا له في السكون فأنت في الحركة المحسوسة أفقد بما لا يتقارب فَلا تَكُونَنَّ من الْجاهِلِينَ ... واصْبِرْ وما صَبْرُكَ إِلَّا بِاللَّهِ لو لم يكن من شرف السكون إلا ورود الأسماء الإلهية عليك ونزول الحق إليك لأنك إن تحركت إليه حددته وإن سكنت معه عبدته الحركة إليه عين الجهل به والسكون معه عين العلم به ما أسرى برسول الله صَلَّى اللهُ عَليهِ وسَلَّم ليراه وإنما أسرى به ليريه من آياته من قوله لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ فمن رجح ترك السفر فقد أصاب في النظر وقصد عين الخبر إذا كان جليس الذاكر فإلى أين يرحل فهذا قد أبنت لك عن السفر وتركه فكن بحسب ما يقع لك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter One Hundred and Seventy-Five: On the Station of Abandoning Travel\n\n> Beware that you make the Fixed Entities (الأعيان) one,\n> When the signs (الآيات) and chapters (السور) come to you concerning them,\n> From His saying: 'You are My servant and I am the God,'\n> And we have neither essence (عين) nor trace (أثر) with you.\n\nAllah the Exalted said: <<Who, out of His grace, has settled us in the Abode of Permanent Residence (دار المقامة); no toil shall touch us therein, nor shall any weariness touch us therein.>> He the Exalted said: <<And He is with you wherever you are.>> Therefore, traversing distances is an increase in fatigue, or rather, fatigue specifically. For nothing moves me except seeking Him. Were it not that I made Him my sought object (مطلوبي) and my goal (مقصدي) through this spiritual wandering (سياحة) and travel (سفر), I would not have sought Him. Yet He has informed me that He is with me during my transitions (انتقالات) just as He is with me during my residence (إقامة). And He has a direction (وجهة) in everything, so why should I wander? Movement to attain Him is proof of not finding Him in stillness (سكون). So, seek His Face (وجهه) in the place of my residence. If I know Him therein, I become a station (منزل) among the stations of the moon, sought after, not seeking, nor descending. The Divine Names (الأسماء) seek me, and I do not seek them; the Lights (الأنوار) intend me, and I do not intend them. I stand with Him upon Whom movement (التحرك) and transition (الانتقال) are impossible.\n\nThe companion of travel (صاحب السفر) aligns with His saying: \"Our Lord descends every night to the lowest heaven.\" And the companion of residence (صاحب الإقامة) aligns with His saying: <<The Most Merciful is established upon the Throne (العرش).>> Stillness (السكون) is more appropriate than movement (الحركة), for the servant is commanded to remain still beneath the currents of Divine Decrees (الأقدار) and [to accept] whatever Allah brings to him by night and day. He spoke in condemnation of one who anticipates the Decrees: \"My servant anticipated Me with his own self, so I forbade Paradise to him.\" And anticipation is movement. Allah did not command us, saying: <<So take Him as a Trustee (وكيلا)>>, except that we might be still, and that He, Glory be to Him, should be the One who manages the affair of His servant until He fulfills for him whatever has been decreed for him of everything that befalls him. Even if travel and transition were among the things destined to befall him, the Real (الحق) would transport him while he remains in that state of stillness, in a litter of Divine Providence (عناية إلهية), knowing nothing of tiring movement, resting, shaded, and served. This is the travel of the one who abandons travel, provided travel was decreed for him.\n\nWe have tasted both matters and found stillness to be superior to movement and stronger in Gnosis (المعرفة), despite the transition of states (الأحوال) upon him in every breath. And that transition upon him is inevitable for him; it is a beaten path (طريق مطرقة) wherein one is traveled, but does not travel. So, if he moves by his own essence (بذاته), he adds nothing to those transitions that occur upon him except fatigue specifically. Thus, the traveler is hastening punishment and hardship. For the matters that flow upon the servant, such as provision (الرزق) and appointed term (الأجل), if they do not come to him, he must inevitably go to them.\n\n> And there is no meaning to the complaint of longing, ever,\n> To Him who does not vanish from direct vision (العيان).\n\nStillness is with Witnessing (المشاهدة), and movement is with loss (الفقد), except for movement that is commanded. Because you are not free from this: if you move in seeking Him, you are losing Him; and if you move in seeking other than Him, you are a loser. Therefore, stillness is in every case more appropriate than the movement that occurs in the station of that stillness. And since you are in the station of moving *by* Allah, stillness *by* Allah and *with* Allah is more appropriate for the comfort of the moment. For, by Allah, if you are losing Him in stillness, you are losing Him in sensible movement (الحركة المحسوسة) by a degree that is incomparable. <<So be not among the ignorant...>> and <<Endure patiently, and your patience is not but through Allah.>>\n\nIf there were no honor in stillness except the descent of the Divine Names (الأسماء الإلهية) upon you and the descent of the Real (الحق) to you, [that would be enough]. Because if you move toward Him, you limit Him; and if you remain still with Him, you worship Him. Movement toward Him is the very essence of ignorance concerning Him, and stillness with Him is the very essence of Knowledge (العلم) concerning Him. The Messenger of Allah (peace and blessings be upon him) was not taken on the Night Journey (الإسراء) so that he might see Him, but rather so that He might show him of His signs (آياته), [as understood] from His saying: <<The creation of the heavens and the earth is greater than the creation of mankind.>>\n\nSo, whoever prefers the abandonment of travel has judged correctly in his contemplation (النظر) and aimed for the very essence of the report, provided he is the companion of the Rememberer (الذاكر). So, where should he journey? Thus, I have made clear to you the matter of travel and its abandonment. So, be according to what befalls you. And Allah <<speaks the Truth, and He guides to the way.>>",
    "ur": "(باب ایک سو پچھتر: ترک سفر کے مقام کے بیان میں)\n\nخبردار! اعیان (الأعيان) کو ایک نہ سمجھنا *** جب آیات اور سورتیں تمہارے پاس ان کے ساتھ آئیں\nاس کے قول سے کہ \"تو میرا بندہ ہے اور معبود میں ہوں\" *** اور تمہارے پاس ہمارا نہ کوئی عین (عين) ہے اور نہ کوئی اثر\n\nاللہ تعالیٰ نے فرمایا: الَّذِي أَحَلَّنا دارَ الْمُقامَةِ من فَضْلِهِ لا يَمَسُّنا فِيها نَصَبٌ ولا يَمَسُّنا فِيها لُغُوبٌ (جس نے ہمیں اپنے فضل سے دائمی قیام کے گھر میں اتارا، جہاں ہمیں نہ کوئی مشقت چھوئے گی اور نہ کوئی تھکاوٹ لاحق ہوگی)۔ اللہ تعالیٰ نے فرمایا: وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)۔ لہٰذا، مسافتوں کو طے کرنا محض اضافی تھکاوٹ ہے، بلکہ یہ خاص طور پر تھکاوٹ ہی ہے۔ کیونکہ مجھے اس کے سوا کوئی چیز حرکت نہیں دیتی مگر اس کا طلب۔ اگر میں نے اس سیاحت اور سفر کے ذریعے اسے اپنا مطلوب اور مقصود نہ بنایا ہوتا تو میں اسے طلب نہ کرتا۔ اور اس نے مجھے خبر دی ہے کہ وہ میری نقل و حرکت کی حالت میں بھی میرے ساتھ ہے، جیسا کہ وہ میری اقامت (الإقامة) کی حالت میں میرے ساتھ ہے۔ اور ہر شے میں اس کی ایک جہت (وجهة) ہے۔ تو پھر میں کیوں گھوموں؟ اس کے حصول کے لیے حرکت کرنا سکون (السكون) میں عدمِ وجدان (نہ پانے) کی دلیل ہے۔ پس اس کی جہت (وجهه) کو اپنی اقامت (إقامتي) کی جگہ پر تلاش کرو۔ جب تم اسے اس میں پہچان لو گے، تو تم چاند کی منازل میں سے ایک منزل بن جاؤ گے، جو مقصود ہوگا نہ کہ قاصد، اور نہ ہی تم اترنے والے ہو گے۔ اسماء (الأسماء) مجھے طلب کریں گے اور میں انہیں طلب نہیں کروں گا، اور انوار (الأنوار) میرا قصد کریں گے اور میں ان کا قصد نہیں کروں گا۔ میں اس کے ساتھ ٹھہر گیا ہوں جس پر حرکت اور انتقال جائز نہیں۔ پس صاحبِ سفر اس قول کے ساتھ ہے:\n\nينزل ربنا كل ليلة إلى السماء الدنيا (ہمارا رب ہر رات آسمان دنیا کی طرف نزول فرماتا ہے)۔\n\nاور صاحبِ اقامت (الإقامة) اس قول کے ساتھ ہے: الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ (رحمن عرش پر مستوی ہے)۔ اور سکون (السكون) حرکت (الحركة) سے زیادہ بہتر ہے۔ کیونکہ بندے کو تقدیروں کے بہاؤ کے تحت اور جو کچھ اللہ رات اور دن میں اس کے پاس لاتا ہے، اس کے تحت سکون کا حکم دیا گیا ہے۔ اور تقدیروں میں پہل کرنے والے کی مذمت میں فرمایا: \"میرے بندے نے مجھ پر اپنی جان سے پہل کی، میں نے اس پر جنت حرام کر دی\"۔ اور پہل کرنا حرکت ہے۔ اللہ نے ہمیں حکم دیتے ہوئے فَاتَّخِذْهُ وَكِيلًا (پس اسے کارساز بنا لو) صرف اس لیے نہیں کہا کہ ہم سکون اختیار کریں، بلکہ اس لیے کہ وہ سبحانہ و تعالیٰ ہی اپنے بندے کے معاملے میں تصرف کرے، یہاں تک کہ اسے ہر وہ چیز پوری طرح دے دے جو اس کے لیے مقدر کی گئی ہے۔ یہاں تک کہ اگر اس کے مقدر میں سفر اور انتقال ہو، تو ذات حق (الحق) اسے اسی صفت کے ساتھ منتقل کرے گا جس پر وہ ہے، یعنی الٰہی عنایت کی پالکی میں سکون (السكون) کی حالت میں، جو تھکا دینے والی حرکت کو نہیں جانتا، آرام دہ، سایہ دار اور خدمت گزار۔ یہ ترکِ سفر کرنے والے کا سفر ہے، اگر اس کے لیے سفر مقدر ہو۔ اور ہم نے دونوں چیزوں کا ذائقہ چکھا ہے اور ہم نے سکون کو حرکت سے زیادہ وزنی اور معرفت (المعرفۃ) میں زیادہ قوی پایا ہے، باوجود اس کے کہ ہر سانس میں اس پر احوال کا انتقال ہوتا رہتا ہے۔ اور یہ انتقال اس پر لازم ہے، کیونکہ یہ ایک ہموار راستہ ہے جس میں وہ چلتا ہے لیکن خود نہیں چلایا جاتا۔ پس جب وہ اپنی ذات سے منتقل ہوتا ہے تو ان انتقالات پر صرف خاص طور پر تھکاوٹ ہی بڑھاتا ہے۔ گویا مسافر عذاب اور مشقت میں جلدی کرتا ہے۔ کیونکہ بندے پر جاری ہونے والے امور، جیسے رزق اور اجل، اگر اس کے پاس نہ آئیں تو وہ ان کے پاس جاتا ہے، یہ ضروری ہے۔\n\nاور اس ذات کے سامنے ایک دن بھی شوق کی شکایت کا کوئی معنی نہیں *** جو شہود (العيان) سے کبھی زائل نہیں ہوتی\n\nسکون (السكون) مشاہدہ کے ساتھ ہے اور حرکت (الحركة) فقدان کے ساتھ، سوائے اس حرکت کے جس کا حکم دیا گیا ہو۔ کیونکہ تم اس سے خالی نہیں ہو سکتے کہ اگر تم اس کی طلب میں حرکت کرتے ہو تو تم فاقد ہو، اور اگر اس کی طلب کے علاوہ میں حرکت کرتے ہو تو تم خسارہ اٹھانے والے ہو۔ لہٰذا، سکون ہر حال میں اس حرکت سے بہتر ہے جو اس سکون کے مقام میں ہو۔ اور تم اس مقام پر ہو کہ تم اللہ کے ذریعے حرکت کرو، پس وقت کے آرام کے لیے اللہ کے ساتھ اللہ کے ذریعے سکون (السكون) زیادہ بہتر ہے۔ کیونکہ، اللہ کی قسم، اگر تم سکون میں اسے فاقد ہو تو تم محسوس حرکت میں اس سے اس قدر زیادہ فاقد ہو گے کہ اس کا کوئی تقابل نہیں ہو سکتا۔ فَلا تَكُونَنَّ من الْجاهِلِينَ (پس تم جاہلوں میں سے نہ ہو جانا)۔ ... واصْبِرْ وما صَبْرُكَ إِلَّا بِاللَّهِ (اور صبر کرو، اور تمہارا صبر اللہ ہی کی توفیق سے ہے)۔ اگر سکون کی فضیلت میں صرف یہی نہ ہوتا کہ تم پر اسماء الٰہیہ کا ورود ہوتا ہے اور ذات حق (الحق) تمہاری طرف نزول فرماتا ہے، (تو بھی سکون بہتر تھا)۔ کیونکہ اگر تم اس کی طرف حرکت کرتے ہو تو تم اسے محدود کرتے ہو، اور اگر تم اس کے ساتھ سکون اختیار کرتے ہو تو تم اس کی عبادت کرتے ہو۔ اس کی طرف حرکت کرنا اس سے جہالت کا عین ہے، اور اس کے ساتھ سکون اختیار کرنا اس کے علم کا عین ہے۔ رسول اللہ صلی اللہ علیہ وسلم کو اس لیے معراج نہیں کرائی گئی کہ وہ اسے دیکھیں، بلکہ اس لیے کرائی گئی کہ وہ انہیں اپنی آیات دکھائے، جیسا کہ اس کے قول میں ہے: لَخَلْقُ السَّماواتِ والْْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ (بیشک آسمانوں اور زمین کی تخلیق لوگوں کی تخلیق سے کہیں زیادہ بڑی ہے)۔ پس جس نے ترکِ سفر کو ترجیح دی، اس نے نظر میں درستگی پائی اور عین خبر کا قصد کیا، جب وہ ذاکر کا ہم نشین ہو۔ تو وہ کہاں سفر کرے گا؟ یہ میں نے تمہیں سفر اور اس کے ترک کے بارے میں واضح کر دیا ہے۔ پس تم اس کے مطابق ہو جاؤ جو تم پر واقع ہو۔ اور اللہ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب صد و هفتاد و پنجم در مقام ترک سفر\n\nبپرهیز از اینکه اعیان (حقایق ثابت) را یکی انگاری *** هنگامی که آیات و سوره‌ها آن را برایت آوردند\nاز قول او که «تو بنده منی و من معبودم» *** و ما نزد شما نه عین (ذات) داریم و نه اثری.\n\nخداوند متعال می‌فرماید: «آن کس که ما را به فضل خود در سرای اقامت (دار المقامة) جای داد، در آنجا نه رنجی به ما می‌رسد و نه خستگی» (الَّذِي أَحَلَّنا دارَ الْمُقامَةِ من فَضْلِهِ لا يَمَسُّنا فِيها نَصَبٌ ولا يَمَسُّنا فِيها لُغُوبٌ). و می‌فرماید: «و او با شماست هر کجا که باشید» (وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ). پس پیمودن مسافت‌ها تنها افزایش خستگی است، بلکه خستگی محض است. زیرا مرا جز طلب او به حرکت نمی‌آورد. اگر او را مطلوب و مقصود خود در این سیاحت و سفر قرار نمی‌دادم، او را طلب نمی‌کردم. او به من خبر داده است که در حال جابجایی‌هایم با من است، همان‌گونه که در حال اقامت با من است. و او در هر چیزی وجهه‌ای دارد، پس چرا باید در گردش باشم؟ حرکت برای به دست آوردن او، دلیلی بر عدم وجدان (یافتن) در حال سکون است. پس وجه او را در محل اقامت خود طلب کن. اگر او را در آنجا شناختی، تو منزلگاهی از منازل قمر خواهی بود؛ مقصود هستی نه قاصد، و فرودآینده نیستی. اسماء (اسماء الهی) تو را می‌طلبند و تو آن‌ها را نمی‌طلبی، و انوار (انوار الهی) قصد تو می‌کنند و تو قصد آن‌ها نمی‌کنی. من با کسی ایستاده‌ام که تحرک و انتقال بر او جایز نیست.\n\nپس صاحب سفر با قول [حدیث] «پروردگار ما هر شب به آسمان دنیا فرود می‌آید» (ينزل ربنا كل ليلة إلى السماء الدنيا) همراه است، و صاحب اقامت با قول «رحمان بر عرش استیلا یافت» (الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏) همراه است. و سکون سزاوارتر از حرکت است، زیرا بنده مأمور است که تحت جریان تقدیرات (الأقدار) و آنچه خداوند در شب و روز برایش می‌آورد، ساکن باشد. و در مذمت کسی که بر تقدیرات پیش‌دستی می‌کند، فرمود: «بنده‌ام با نفس خود بر من پیش‌دستی کرد، بهشت را بر او حرام کردم.» (بادرني عبدي بنفسه حرمت عليه الجنة). و پیش‌دستی، حرکت است. خداوند به ما امر نفرموده است که «او را وکیل بگیر» (فَاتَّخِذْهُ وَكِيلًا) مگر برای اینکه ما ساکن شویم و او سبحانه باشد که در کار بنده خود تصرف کند تا آنچه را که برایش مقدر شده است، از هر آنچه به او می‌رسد، به او برساند. حتی اگر سفر و انتقال از جمله چیزهایی باشد که به او می‌رسد، حق (الحق) او را با همین صفتی که بر آن است (سکون)، در کجاوه عنایت الهی منتقل می‌کند؛ در حالی که آسوده و سایه‌افکن شده و خدمت شده است و حرکت خسته‌کننده را نمی‌شناسد. این سفرِ ترک‌کننده سفر است، اگر سفر برایش مقدر شده باشد. ما هر دو امر را چشیده‌ایم و سکون را برتر از حرکت و قوی‌تر در معرفت (المعرفة) دیده‌ایم، با وجود انتقال احوال بر او در هر نفس. و آن انتقال بر او برایش ضروری است، زیرا آن راهی است که در آن سلوک می‌شود نه اینکه او سلوک کند. پس اگر او به ذات خود منتقل شود، چیزی بر آن انتقالاتی که بر او وارد می‌شود، جز خستگی محض نمی‌افزاید.\n\nپس مسافر در واقع عذاب و مشقت را به تعجیل می‌طلبد. زیرا امور جاری بر بنده، مانند روزی و اجل، اگر به سوی او نیایند، او ناگزیر به سوی آن‌ها خواهد رفت.\n\nو شکوه از شوق، روزی معنایی ندارد *** به سوی کسی که از شهود (العیان) زائل نمی‌شود.\n\nسکون همراه با مشاهده (المشاهدة) است و حرکت همراه با فقدان (الفقد)، مگر حرکتی که به آن امر شده باشد. زیرا تو از این دو حالت خارج نیستی: اگر در طلب او حرکت کنی، فاقد هستی؛ و اگر در غیر طلب او حرکت کنی، زیانکاری. پس سکون در هر حال سزاوارتر از حرکتی است که در مقام آن سکون قرار دارد. و تو در مقامی هستی که باید به واسطه خدا حرکت کنی، پس سکون به واسطه خدا و همراه با خدا برای آسایش وقت سزاوارتر است. به خدا سوگند، اگر در حال سکون او را فاقد باشی، در حرکت محسوس به مراتب بیشتر فاقد خواهی بود، به گونه‌ای که قابل مقایسه نیست. «پس از جاهلان مباش» (فَلا تَكُونَنَّ من الْجاهِلِينَ)... «و صبر کن، و صبر تو جز به یاری خدا نیست» (وَاصْبِرْ وما صَبْرُكَ إِلَّا بِاللَّهِ). اگر از شرافت سکون جز این نبود که اسماء الهی بر تو وارد می‌شوند و نزول حق (الحق) به سوی توست، کافی بود. زیرا اگر به سوی او حرکت کنی، او را محدود کرده‌ای، و اگر با او ساکن شوی، او را پرستیده‌ای. حرکت به سوی او عین جهل به اوست و سکون با او عین علم (العلم) به اوست. خداوند پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) را به معراج نبرد تا او را ببیند، بلکه او را به معراج برد تا از آیات خود به او نشان دهد، از جمله قول او که: «آفرینش آسمان‌ها و زمین بزرگ‌تر از آفرینش مردم است» (لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ). پس هر کس ترک سفر را ترجیح دهد، در نظر خود به صواب رسیده و قصد عین خبر را کرده است، اگر همنشین ذاکر باشد، پس به کجا سفر کند؟ اینک من سفر و ترک آن را برای تو بیان کردم، پس بر حسب آنچه برایت رخ می‌دهد باش. و خداوند «حق را می‌گوید و او راه را هدایت می‌کند» (يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}