{
  "id": 266,
  "title": {
    "ar": "الباب السادس والستون ومائتان في معرفة الشاهد",
    "en": "Chapter 266: Concerning the Gnosis (المعرفة) of the Witness (الشاهد)",
    "ur": "باب دو سو چھیاسٹھ: الشاہد (الشاهد) کی معرفت (المعرفة) کے بیان میں۔",
    "fa": "باب دویست و شصت و ششم در معرفت شاهد"
  },
  "content": {
    "ar": "## «الباب السادس والستون ومائتان في معرفة الشاهد»\n\n\nوهو بقاء صورة المشاهد في نفس المشاهد اسم فاعل فصورة المشهود في القلب هي عين الشاهد وبه يقع النعيم للمشاهد\n\n\n> مشاهدة الحق من علمنا *** تحصيل شاهدها في القلوب‏\n\n\n> فيدركها بعيون الحجى *** موفقة خلف ستر الغيوب‏\n\n\n> ويطلعه بدر تم علا *** على شمسه في مهب الجنوب‏\n\n\nولما كان الشاهد حصول صورة المشهود في النفس عند الشهود فيعطي خلاف ما تعطيه الرؤية فإن الرؤية لا يتقدمها علم بالمرئي والشهود يتقدمه علم بالمشهود وهو المسمى بالعقائد ولهذا يقع الإقرار والإنكار في الشهود ولا يكون في الرؤية إلا الإقرار ليس فيها إنكار وإنما سمي شاهدا لأنه يشهد له ما رآه بصحة ما اعتقده فكل مشاهدة رؤية وما كل رؤية مشاهدة ولكن لا يعلمون فما يرى الحق إلا الكمل من الرجال ويشهده كل أحد ولا يكون عن الرؤية شاهد وقال الله تعالى في إثبات الشاهد أَ فَمَنْ كانَ عَلى‏ بَيِّنَةٍ من رَبِّهِ ويَتْلُوهُ شاهِدٌ مِنْهُ وفي هذه الآية وجوه كلها مقصودة لله فيكون العبد على كشف من الله لما يريده به أو منه وذلك لا يكون له إلا بأخبار إلهي وإعلام بالشي‏ء قبل وقوعه وهو قول الصديق ما رأيت شيئا إلا رأيت الله قبله ثم إن ذلك الأمر لا يكون له عين إلا من اسم إلهي تكون له أثر ذلك الاسم فيقوم الاسم في قلب العبد ويحضر فيه فيشهده العبد ثم يرى ظهور ذلك الأثر ووجوده في نفسه أو في الآفاق الذي تقدم له به لإعلام الإلهي فيسمى ذلك الاسم شاهدا حيث شهده هذا العبد متعلق ذلك الأثر المعلوم عنده وهذا لا يكون إلا للكمل من الرجال فهم أصحاب شهود في كل أثر يشهدون لهم به بعد العلم به الإلهي على طريق الخبر وإنما قلنا في الوجوه إنها مقصودة لله فليس يتحكم على الله ولكنه أمر محقق عن الله وذلك أن الآية المتلفظ بها من كلام الله بأي وجه كان من قرآن أو كتاب منزل أو صحيفة أو خبر إلهي فهي آية على ما تحمله تلك اللفظة من جميع الوجوه أي علامة عليها مقصودة لمن أنزلها بتلك اللفظة الحاوية في ذلك اللسان على تلك الوجوه فإن منزلها عالم بتلك الوجوه كلها وعالم بأن عباده متفاوتون في النظر فيها وأنه ما كلفهم من خطأ به سوى ما فهموا عنه فيه فكل من فهم من الآية وجها فذلك الوجه هو مقصود بهذه الآية في حق هذا الواجد له وليس يوجد هذا في غير كلام الله وإن احتمله اللفظ فإنه قد لا يكون مقصودا للمتكلم به لعلمنا بقصور علمه عن الإحاطة بما في تلك اللفظة من الوجوه فإن كان من أهل الله الذين يقولون ما في الوجود متكلم إلا الله وهم أهل السماع المطلق منه فتكون تلك الوجوه كلها مقصودة لأن المتكلم الله والشخص المقول على لسانه تلك الكلمة مترجم كما قال على لسان عبده في الصلاة سمع الله لمن حمده فالمتكلم هنا هو الله والمترجم العبد ولهذا كان كل مفسر فسر القرآن ولم يخرج عما يحتمله اللفظ فهو مفسر ومن فسره برأيه فقد كفر كذا ورد في حديث الترمذي‏\n\n\nولا يكون برأيه إلا حتى يكون ذلك الوجه لا يعلمه أهل ذلك اللسان في تلك اللفظة ولا اصطلحوا على وضعها بإزائه وهنا إشارة نبوية في قوله فقد كفر ولم يقل أخطأ فإن الكفر الستر ومن لا يرى متكلما إلا الله من أهل الله وقد جعل هذا التفسير لهذه الآية مضافا إلى رأيه فقد ستر الله عن بعض عباده في هذا الوجه مع كونه حقا لإضافته إلى رأى المفسر لأن أهل اللسان ما اصطلحوا على وضع ذلك اللفظ بإزاء ذلك الوجه ولا استعاروه له لا بد من هذا الشرط والمتكلم الله به وبالوجه والإصابة حق إذا أضيفت إلى الحق فلذلك قال عليه السلام فقد كفر ولم يقل أخطأ ولله أن يستر ما شاء وإضافة الخطاء إليه محال فإنه لا يقبله لإحاطة علمه بكل معلوم ويكفي هذا القدر في معرفة الشاهد عند القوم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏",
    "en": "## Chapter Two Hundred and Sixty-Six: On the Knowledge of the Witness (الشاهد)\n\nIt is the subsistence of the form of the Witnessed (المشهود) in the soul (نفس) of the Witnesser (المشاهد)—the active participle. Thus, the form of the Witnessed in the heart is the very essence of the Witness (الشاهد), and through this, bliss occurs for the Witnesser.\n\n> The witnessing of the Real (الحق), from our knowledge,\n> Is the attainment of its Witness in the hearts.\n>\n> So it is perceived by the eyes of intellect,\n> Granted success behind the veil of the Unseen.\n>\n> And a full moon, high and complete, makes it rise\n> Over its sun in the southern wind’s path.\n\nSince the Witness (الشاهد) is the attainment of the form of the Witnessed in the soul during the act of witnessing (الشهود), it yields the opposite of what Vision (الرؤية) yields. For Vision is not preceded by knowledge of the Seen, whereas Witnessing is preceded by knowledge of the Witnessed, which is called beliefs (العقائد). Therefore, affirmation and denial occur in Witnessing, but in Vision, there is only affirmation; there is no denial in it.\n\nIt was only named a Witness because what he saw testifies to the soundness of what he believed. Thus, every witnessing is a vision, but not every vision is a witnessing, yet they do not know. The Real (الحق) is only seen by the Perfect among men, but everyone witnesses Him, and the Witness does not arise from Vision.\n\nAllah the Exalted said, establishing the Witness: <<Is he then who is upon a clear proof (بَيِّنَةٍ) from his Lord, and whom a witness (شاهِدٌ) from Him follows?>> In this verse, there are aspects (وجوه) all intended by Allah.\n\nThe servant is thus upon an Unveiling (كشف) from Allah regarding what He desires for him or from him, and that only occurs through Divine information and notification of the thing before its occurrence. This is the saying of the Veracious One (al-Siddīq): \"I did not see anything except that I saw Allah before it.\"\n\nFurthermore, that matter does not have an essence (عين) except from a Divine Name (اسم إلهي) which has the effect (أثر) of that Name. The Name then stands in the heart of the servant and is present therein, so the servant witnesses it. Then he sees the manifestation of that effect and its existence in himself or in the horizons (الآفاق), which was preceded by the Divine notification. That Name is thus called the Witness, since this servant witnessed it as related to that known effect.\n\nThis only occurs for the Perfect among men (الكمل من الرجال); they are the people of Witnessing (شهود) in every effect, testifying to it after the Divine knowledge of it, following the path of information.\n\nWe only said that the aspects are intended by Allah, not because one dictates to Allah, but because it is a verified matter from Allah. That is because the verse (آية) uttered from the Word of Allah, in whatever form—whether Quran, revealed book, scroll, or Divine information—is a sign (آية) of what that word carries in all its aspects, meaning a sign intended by the One who revealed it with that word, which encompasses those aspects in that language. For the Revealer knows all those aspects and knows that His servants differ in their contemplation of them, and that He has not burdened them with error concerning it, except for what they understood from Him regarding it. So whoever understands an aspect from the verse, that aspect is intended by this verse concerning the one who finds it.\n\nThis is not found in anything other than the Word of Allah, even if the wording allows it, for it may not have been intended by the speaker, due to our knowledge of the limitation of his knowledge from encompassing all the aspects contained within that word.\n\nHowever, if the speaker is one of the People of Allah (أهل الله) who say that there is no speaker in Existence (الوجود) except Allah—and they are the people of absolute hearing from Him—then all those aspects are intended, because Allah is the Speaker, and the person on whose tongue that word is spoken is merely a translator. Just as He said on the tongue of His servant in the prayer: \"Allah hears the one who praises Him.\" The Speaker here is Allah, and the translator is the servant.\n\nTherefore, every exegete who interprets the Quran without departing from what the wording allows is a true interpreter. But whoever interprets it according to his own opinion (برأيه) has committed an act of disbelief (كفر), as reported in the Hadith of Tirmidhi.\n\nIt is only considered 'by his opinion' if that aspect is unknown to the native speakers of that language regarding that word, and they have not agreed upon establishing it in relation to it. Here is a prophetic indication in his saying, 'has committed an act of disbelief,' and not 'has erred,' for *kufr* (الكفر) is concealment (الستر).\n\nAnd whoever among the People of Allah does not see any speaker but Allah, yet attributes this interpretation of the verse to his own opinion, then Allah has concealed this aspect from some of His servants, even though it is true, because of its attribution to the exegete's opinion. This is because the native speakers did not agree upon establishing that word in relation to that aspect, nor did they borrow it for that purpose. This condition is necessary.\n\nAllah is the Speaker of it and of the aspect, and correctness is true when attributed to the Real (الحق). That is why the Prophet, peace be upon him, said, 'has committed an act of disbelief,' and not 'has erred.' Allah has the right to conceal whatever He wills, and attributing error to Him is impossible, for He does not accept it due to the encompassing nature of His Knowledge (العلم) of every known thing.\n\nThis much suffices for the knowledge of the Witness (الشاهد) according to the People [of Sufism]. And Allah <<SAYS THE TRUTH AND HE GUIDES TO THE WAY>>.",
    "ur": "باب نمبر دو سو چھیاسٹھ: شاہد (الشاهد) کی معرفت میں\n\nاور یہ (شاہد) مشاہد (المشاهد) کے نفس میں مشہود (المشهود) کی صورت کا باقی رہنا ہے، جو کہ اسم فاعل ہے۔ پس قلب میں مشہود کی صورت ہی عین شاہد ہے، اور اسی کے ذریعے مشاہد کو نعمت حاصل ہوتی ہے۔\n\n> ذات حق (الحق) کا مشاہدہ ہمارے علم سے ہے،\n> اس کے شاہد کا حصول دلوں میں ہوتا ہے۔\n> پس وہ اسے عقل کی آنکھوں سے پاتا ہے،\n> جو پردہ غیوب کے پیچھے موافقت رکھتی ہے۔\n> اور اسے ایک کامل چاند طلوع کرتا ہے،\n> جو جنوب کی ہوا میں اس کے سورج پر غالب ہے۔\n\nاور چونکہ شاہد (الشاهد) شہود (الشهود) کے وقت نفس میں مشہود کی صورت کا حاصل ہونا ہے، اس لیے یہ رؤیت (الرؤية) کے برعکس نتیجہ دیتا ہے۔ کیونکہ رؤیت سے پہلے مرئی (دیکھی جانے والی چیز) کا علم نہیں ہوتا، جبکہ شہود سے پہلے مشہود کا علم ہوتا ہے، جسے عقائد (العقائد) کہا جاتا ہے۔ اسی وجہ سے شہود میں اقرار اور انکار دونوں واقع ہوتے ہیں، جبکہ رؤیت میں صرف اقرار ہوتا ہے، اس میں انکار نہیں ہوتا۔ اور اسے شاہد (گواہ) اس لیے کہا گیا کہ جو کچھ اس نے دیکھا، وہ اس کے اعتقاد کی صحت کی گواہی دیتا ہے۔ پس ہر مشاہدہ رؤیت ہے، لیکن ہر رؤیت مشاہدہ نہیں ہے، مگر لوگ یہ نہیں جانتے۔ پس ذات حق (الحق) کو کامل مردوں (الكمل من الرجال) کے سوا کوئی نہیں دیکھتا، اور اس کا شہود ہر کوئی کرتا ہے، لیکن رؤیت سے کوئی شاہد نہیں ہوتا۔\n\nاور اللہ تعالیٰ نے شاہد کے اثبات میں فرمایا: أَ فَمَنْ كانَ عَلى‏ بَيِّنَةٍ من رَبِّهِ ويَتْلُوهُ شاهِدٌ مِنْهُ (کیا وہ شخص جو اپنے رب کی طرف سے واضح دلیل پر ہو اور اس کے پیچھے اس کا ایک شاہد (گواہ) بھی ہو؟)۔ اور اس آیت میں کئی وجوہ ہیں جو سب کی سب اللہ کے لیے مقصود ہیں۔ پس بندہ اللہ کی طرف سے اس چیز پر کشف (الکشف) پر ہوتا ہے جو وہ اس کے ذریعے یا اس سے چاہتا ہے۔ اور یہ اسے صرف خبر الٰہی اور کسی چیز کے وقوع سے پہلے اس کے علم کے ذریعے ہی حاصل ہوتا ہے۔ اور یہی صدیق (ابوبکر رضی اللہ عنہ) کا قول ہے: \"میں نے کوئی چیز نہیں دیکھی مگر اس سے پہلے اللہ کو دیکھا۔\" پھر اس امر کی کوئی حقیقت نہیں ہوتی مگر کسی اسم الٰہی سے، جس کا اثر اس کے لیے ہوتا ہے۔ پس وہ اسم بندے کے قلب میں قائم ہو جاتا ہے اور اس میں حاضر ہوتا ہے، تو بندہ اس کا شہود کرتا ہے۔ پھر وہ اس اثر کا ظہور اور وجود اپنے نفس میں یا آفاق میں دیکھتا ہے، جس کا علم اسے پہلے ہی الٰہی اطلاع کے ذریعے ہو چکا ہوتا ہے۔ پس اس اسم کو شاہد کہا جاتا ہے، کیونکہ اس بندے نے اس اثر کے متعلق کا شہود کیا جو اس کے نزدیک معلوم تھا۔ اور یہ صرف کامل مردوں کو ہی حاصل ہوتا ہے۔ پس وہ ہر اثر میں شہود والے ہیں، جس کی وہ گواہی دیتے ہیں، اس کے الٰہی علم کے بعد خبر کے طریقے پر۔\n\nاور ہم نے وجوہ کے بارے میں جو کہا کہ وہ اللہ کے لیے مقصود ہیں، تو یہ اللہ پر حکم چلانا نہیں ہے، بلکہ یہ اللہ کی طرف سے ایک محقق امر ہے۔ اور وہ یہ ہے کہ اللہ کے کلام سے جو آیت بھی بولی جاتی ہے، خواہ وہ قرآن سے ہو یا کسی نازل شدہ کتاب سے، یا صحیفے سے، یا خبر الٰہی سے، وہ ان تمام وجوہ پر ایک آیت (علامت) ہے جو وہ لفظ اپنے اندر رکھتا ہے۔ یعنی وہ اس پر ایک علامت ہے جو اس شخص کے لیے مقصود ہے جس نے اسے اس لفظ کے ساتھ نازل کیا جو اس زبان میں ان وجوہ کو شامل ہے۔ کیونکہ اسے نازل کرنے والا ان تمام وجوہ کو جانتا ہے، اور یہ بھی جانتا ہے کہ اس کے بندے ان پر غور کرنے میں مختلف ہیں، اور اس نے انہیں اس میں غلطی کرنے کا مکلف نہیں کیا سوائے اس کے جو انہوں نے اس سے سمجھا۔ پس جس نے بھی آیت سے کوئی وجہ سمجھی، تو وہ وجہ اس آیت کے ذریعے اس پانے والے کے حق میں مقصود ہے۔ اور یہ بات اللہ کے کلام کے علاوہ کسی اور میں نہیں پائی جاتی، اگرچہ لفظ اس کا احتمال رکھتا ہو، کیونکہ وہ متکلم کے لیے مقصود نہیں ہو سکتا، اس لیے کہ ہم جانتے ہیں کہ اس کا علم اس لفظ میں موجود تمام وجوہ کے احاطے سے قاصر ہے۔\n\nپس اگر وہ اہل اللہ میں سے ہو جو کہتے ہیں کہ ہستی (الوجود) میں اللہ کے سوا کوئی متکلم نہیں ہے، اور وہ اس سے مطلق سماع (سننے) والے ہیں، تو وہ تمام وجوہ مقصود ہوں گی، کیونکہ متکلم اللہ ہے، اور جس شخص کی زبان پر وہ کلمہ کہا گیا، وہ صرف مترجم ہے۔ جیسا کہ اس نے نماز میں اپنے بندے کی زبان پر فرمایا: سَمِعَ اللهُ لِمَنْ حَمِدَهُ (اللہ نے سن لیا جس نے اس کی تعریف کی)۔ پس یہاں متکلم اللہ ہے اور مترجم بندہ ہے۔ اسی لیے ہر وہ مفسر جس نے قرآن کی تفسیر کی اور اس سے باہر نہیں نکلا جس کا لفظ احتمال رکھتا ہے، تو وہ مفسر ہے، اور جس نے اپنی رائے سے اس کی تفسیر کی، تو اس نے کفر کیا، جیسا کہ ترمذی کی حدیث میں وارد ہے۔\n\nاور وہ اپنی رائے سے تبھی ہو گا جب وہ وجہ اس لفظ میں اس زبان کے اہل کو معلوم نہ ہو، اور نہ ہی انہوں نے اس کے مقابلے میں اس کے وضع کرنے پر اتفاق کیا ہو۔ اور یہاں نبیوی اشارہ ہے آپ کے اس قول میں کہ \"اس نے کفر کیا\" اور یہ نہیں فرمایا کہ \"اس نے غلطی کی\"۔ کیونکہ کفر (الکفر) پردہ ڈالنا (ستر) ہے۔ اور اہل اللہ میں سے جو اللہ کے سوا کسی کو متکلم نہیں دیکھتا، اور اس نے اس آیت کی یہ تفسیر اپنی رائے کی طرف منسوب کر دی، تو اس نے اللہ کو بعض بندوں سے اس وجہ میں چھپا دیا، باوجود اس کے کہ وہ حق تھا، کیونکہ اس نے اسے مفسر کی رائے کی طرف منسوب کیا۔ اس لیے کہ اہل زبان نے اس لفظ کو اس وجہ کے مقابلے میں وضع کرنے پر اتفاق نہیں کیا، اور نہ ہی اسے اس کے لیے مستعار لیا۔ یہ شرط ضروری ہے۔ اور متکلم اللہ ہے، اس کے ساتھ بھی اور اس وجہ کے ساتھ بھی۔ اور حق کو پانا حق ہے جب اسے حق کی طرف منسوب کیا جائے۔ اسی لیے آپ صلی اللہ علیہ وسلم نے فرمایا: \"اس نے کفر کیا\" اور یہ نہیں فرمایا کہ \"اس نے غلطی کی\"۔ اور اللہ کو اختیار ہے کہ وہ جو چاہے چھپا دے۔ اور غلطی کو اس کی طرف منسوب کرنا محال ہے، کیونکہ وہ اسے قبول نہیں کرتا، اس لیے کہ اس کا علم ہر معلوم چیز کا احاطہ کیے ہوئے ہے۔ اور قوم کے نزدیک شاہد کی معرفت میں یہ مقدار کافی ہے۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "## «باب دویست و شصت و ششم در معرفت شاهد»\n\nو آن عبارت است از بقای صورت مُشاهَد (مشهود) در نفس مُشاهِد (بیننده) که اسم فاعل است. پس صورت مشهود در قلب، عین شاهد است و به واسطه آن، نعیم (لذت) برای مُشاهِد حاصل می‌شود.\n\n> مشاهده حق از علم ماست *** که شاهد آن در قلب‌ها حاصل می‌شود\n\n> پس آن را با چشمان خرد درمی‌یابد *** که در پس پرده‌های غیب توفیق یافته است\n\n> و ماه تمام بر آن طلوع می‌کند *** بر خورشیدش در مسیر جنوب\n\nو از آنجا که شاهد، حصول صورت مشهود در نفس هنگام شهود است، پس چیزی خلاف آنچه رؤیت (دیدن) می‌دهد، عطا می‌کند. زیرا رؤیت، علم قبلی به مرئی (دیده‌شده) ندارد، در حالی که شهود، علم قبلی به مشهود دارد و این همان چیزی است که عقاید نامیده می‌شود. به همین دلیل، اقرار و انکار در شهود رخ می‌دهد، در حالی که در رؤیت فقط اقرار وجود دارد و انکار در آن نیست. و شاهد نامیده شد، زیرا آنچه را دیده است، بر صحت آنچه اعتقاد داشته، شهادت می‌دهد. پس هر مشاهده‌ای رؤیت است، اما هر رؤیتی مشاهده نیست، ولی آنان نمی‌دانند. پس حق را جز کاملان از مردان نمی‌بینند، در حالی که هر کسی آن را شهود می‌کند. و از رؤیت، شاهدی حاصل نمی‌شود. و خداوند متعال در اثبات شاهد می‌فرماید: **أَ فَمَنْ كانَ عَلى‏ بَيِّنَةٍ من رَبِّهِ ويَتْلُوهُ شاهِدٌ مِنْهُ** (آیا کسی که بر حجتی روشن از پروردگارش است و شاهدی از او به دنبالش می‌آید [مانند کسی است که چنین نیست]؟). و در این آیه وجوهی است که همگی مقصود خداوند است. پس بنده بر کشف (کشف) از جانب خداوند قرار می‌گیرد نسبت به آنچه خداوند برای او یا از او می‌خواهد، و این برای او حاصل نمی‌شود مگر با اخبار الهی و آگاهی دادن به شیء قبل از وقوع آن. و این همان قول صدیق (ابوبکر) است که: «چیزی را ندیدم مگر اینکه خداوند را قبل از آن دیدم.» سپس آن امر، عینیت نمی‌یابد مگر از یک اسم الهی که اثر آن اسم برای او باشد. پس آن اسم در قلب بنده قیام می‌کند و در آن حاضر می‌شود و بنده آن را شهود می‌کند. سپس ظهور آن اثر و وجود آن را در نفس خود یا در آفاق می‌بیند که قبلاً با اعلام الهی به او رسیده بود. پس آن اسم، شاهد نامیده می‌شود، زیرا این بنده آن را شهود کرده است که متعلق به آن اثر معلوم نزد اوست. و این جز برای کاملان از مردان حاصل نمی‌شود. پس آنان صاحبان شهود (شهود) در هر اثری هستند که پس از علم الهی به آن، از طریق خبر، برایشان شهادت می‌دهند. و ما گفتیم که وجوه در آیه مقصود خداوند است، پس این تحکم بر خداوند نیست، بلکه امری محقق از جانب خداوند است. و آن این است که آیه تلفظ شده از کلام خداوند، به هر وجهی که باشد، از قرآن یا کتاب نازل شده یا صحیفه یا خبر الهی، نشانه‌ای است بر آنچه آن لفظ از تمام وجوه حمل می‌کند؛ یعنی علامتی بر آن است که مقصود کسی است که آن را با آن لفظ نازل کرده که در آن زبان، حاوی آن وجوه است. زیرا نازل‌کننده آن، به تمام آن وجوه عالم است و می‌داند که بندگانش در نظر کردن به آن متفاوتند و او جز آنچه را که از آن فهمیده‌اند، به خطا بر آنان تکلیف نکرده است. پس هر کس از آیه وجهی را فهمید، آن وجه در حق این یابنده، مقصود این آیه است. و این در غیر کلام خداوند یافت نمی‌شود، حتی اگر لفظ آن را محتمل باشد، زیرا ممکن است مقصود متکلم نباشد، به دلیل علم ما به قصور علم او از احاطه به وجوه موجود در آن لفظ. اما اگر از اهل الله باشد که می‌گویند در هستی (الوجود) متکلمی جز خداوند نیست، و آنان اهل سماع مطلق از او هستند، پس تمام آن وجوه مقصود است، زیرا متکلم، خداوند است و شخصی که آن کلمه بر زبان او جاری شده، مترجم است، چنانکه در نماز بر زبان بنده‌اش فرمود: «سمع الله لمن حمده» (خداوند سخن کسی را که او را ستایش کند، شنید). پس متکلم در اینجا خداوند است و بنده مترجم است. و به همین دلیل، هر مفسری که قرآن را تفسیر کند و از آنچه لفظ محتمل است خارج نشود، مفسر است. و هر کس آن را به رأی خود تفسیر کند، کافر شده است، چنانکه در حدیث ترمذی آمده است.\n\nو تفسیر به رأی نیست مگر آنکه آن وجه را اهل آن زبان در آن لفظ ندانند و بر وضع آن در مقابل آن توافق نکرده باشند. و در اینجا اشاره‌ای نبوی در قول او (پیامبر) است که فرمود: «کافر شده است» و نگفت «خطا کرده است». زیرا کفر به معنای پوشاندن است. و کسی که از اهل الله است و متکلمی جز خداوند نمی‌بیند، و این تفسیر را برای این آیه به رأی خود نسبت داده است، در واقع خداوند را از برخی بندگانش در این وجه پوشانده است، با وجود اینکه حق است، به دلیل نسبت دادن آن به رأی مفسر. زیرا اهل زبان بر وضع آن لفظ در مقابل آن وجه توافق نکرده‌اند و آن را برای آن به عاریت نگرفته‌اند. این شرط ضروری است. و متکلم، خداوند است، هم به آن لفظ و هم به آن وجه. و اگر به حق نسبت داده شود، اصابت (درستی) حق است. به همین دلیل، پیامبر (ص) فرمود: «کافر شده است» و نگفت «خطا کرده است». و خداوند می‌تواند آنچه را بخواهد بپوشاند. و نسبت دادن خطا به او محال است، زیرا او آن را نمی‌پذیرد، به دلیل احاطه علم او به هر معلومی. و این مقدار در معرفت شاهد نزد این قوم کافی است. و **وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 1
}