{
  "id": 227,
  "title": {
    "ar": "الباب السابع والعشرون ومائتان في معرفة حال المراد",
    "en": "Chapter Two Hundred and Twenty-Seven: Concerning the Gnosis (maʿrifa) of the State (ḥāl) of the One Desired (al-Murād).",
    "ur": "باب دو سو ستائیس: مراد (المراد) کے حال کی معرفت (المعرفۃ) کے بیان میں",
    "fa": "باب دویست و بیست و هفتم در معرفت حال مراد (کسی که مورد اراده حق است)"
  },
  "content": {
    "ar": "## «الباب السابع والعشرون ومائتان في معرفة حال المراد»\n\n\n> إن المراد هو المجذوب بالحال *** في كل حال على حل وترحال‏\n\n\n> يمشي به وهو في بيضاء في دعة *** على المقامات من حال إلى حال‏\n\n\n> عناية منه والرحمن يحرسه *** بعينه فهو في نعمى وإقبال‏\n### [المراد هو المجذوب عن إرادته مع تهيؤ الأمور له‏]\n\n\nاعلموا أن المراد في اصطلاح القوم هو المجذوب عن إرادته مع تهيؤ الأمور له فهو يجاوز الرسوم والمقامات من غير مشقة بل بالتذاذ وحلاوة وطيب تهون عليه الصعاب وشدائد الأمور وينقسم المرادون هنا إلى قسمين القسم الواحد أن يركب الأمور الصعبة وتحل به البلايا المحسوسة والنفسية ويحس بها ويكره ذلك الطبع منه غير أنه يرى ويشاهد ما له في ذلك في باطن الأمر عند الله من الخير مثل العافية في شرب الدواء الكرية فيغلب عليه مشاهدة ذلك النعيم الذي في طي هذا البلاء فيلتذ بما يطرأ عليه من مخالفة الغرض وهو العذاب النفسي ومن الآلام المحسوسة لأجل هذه المشاهدة كعمر بن الخطاب رضي الله عنه فإنه من أصحاب هذا المقام فقال في ذلك ما أصابني الله بمصيبة إلا رأيت أن لله علي فيها ثلاث نعم النعمة الواحدة حيث لم تكن تلك المصيبة في ديني والنعمة الثانية حيث لم تكن مصيبة أكبر منها إذ في الجائز أن يكون ذلك والنعمة الثالثة ما عند الله لي فيها من تكفير الخطايا ورفع الدرجات فاشكر الله تعالى عند حلول كل مصيبة وهنا فقه عجيب في طريق القوم تعطيه الحقائق لمن عرف طريق الله فإن البلاء لا يقبل الشكر والنعمة لا تقبل الصبر فإن شكر من قام به البلاء فليس مشهوده إلا النعم فيجب عليه الشكر وإن صبر من قامت به النعماء فليس مشهوده إلا البلاء وهو ما فيها من تكليف طلب الشكر عليها من الله وما كلفه من حكم التصرف فيها فمشهوده يقتضي له الصبر والحق سبحانه يردف عليه النعم وهو في شهوده ينظر ما لله عليه فيها من الحقوق فيجهد نفسه في أدائها فلا يلتذ بما يحسب الناس أنه به ملتذ فيصبر على ترادف النعماء عليه فهو صاحب بلاء فليس المعتبر إلا ما يشهده الحق في وقته فهو بحسب وقته إما صاحب شكر أو صاحب صبر فهذا حال القسم الواحد من المرادين وأما القسم الآخر فلا يحس بالشدائد المعتادة بل يجعل الله فيه من القوة ما يحمل بها تلك الشدائد التي يضعف عن حملها غيرها من القوي كالرجل الكبير ذي القوة فيكلف ما يشق على الصغير أن يحمله فما عنده خبر من ذلك بل يحمله من غير مشقة فإنه تحت قوته وقدرته ويحمله الصغير بمشقة وجهد فهذا ملتذ بحمله فارح بقوته يفتخر بها لا يجد ألما ولا يحس به كما قال أبو يزيد في بعض مناجاته‏\n\n\n> أريدك لا أريدك للثواب *** ولكني أريدك للعقاب‏\n\n\n> وكل مآربي قد نلت منها *** سوى ملذوذ وجدي بالعذاب‏\n\n\nفطلب اللذة بما جرت العادة به أن يثمر عذابا خرقا للعادة فما طلب العذاب يقول أهل الله ليس العجب من ورد في بستان وإنما العجب من ورد في قعر النيران يقول صاحب هذا الكلام ليس العجب ممن يلتذ بما جرت العادة أن يلتذ به الطبع وإنما العجب أن يلتذ بما جرت العادة أن يتألم به الطبع ذكر أن بعض المحبين جنى جناية فجلده الحاكم مائة جلدة فما أحس بتسع وتسعين منها فما استغاث فلما كان في السوط المكمل مائة استغاث فقيل له في ذلك فقال العين التي كنت أعاقب من أجلها كانت تنظر إلي فكنت أتنعم بالنظر إليها فما كنت أحس بمواقع السوط من ظهري فلما كان في السوط الموفي مائة غابت عني فأحسست بموقع السوط فاستغثت ورأيت المرأة الصالحة بمكة فاطمة بنت التاج ضربها أبوها ضربا مبرحا من غير جناية فما أحست بذلك وكانت تحس بشي‏ء يحول بين ظهرها ومواقع السياط فيقع السوط في ذلك الحائل وتسمع وقع السوط بإذنها وتتعجب حيث لا تحس به وقد جرى لنا مثل هذا في بدايتنا في حكاية طويلة فهذا المراد قد يعطيه الله اللذة دائما بكل شي‏ء يقوم به من بلاء ونعمة فإن النعيم ليس بشي‏ء زائد على عين اللذة القائمة بالشخص كما إن البلاء ليس بشي‏ء زائد على وجود عين الألم وأما الأسباب الموجبة لهما فغير معتبرة عندنا فليس صاحب البلاء إلا من قام به الألم وليس صاحب النعمة سوى من قامت به اللذة ويكون السبب ما كان معتادا أو غير معتاد وهذا القسم قد يجعل الله فيه إن يكون مرادا له في نفسه جميع ما يريد الله أن ينزله به فإذا أعطاه الله مرادة ولا بد من ذلك فإن ذلك مراد لله تعالى فإنه يتلذذ بوقوع مراده فتكون الشدائد والمكاره المضادة مرادة له فتحل به فيحملها\n\n\nبما عنده وما جعل الله فيه من القوة فقد يكون حال المراد بهذه المثابة وأهل البداية في هذا الطريق كلهم عند حصول التوبة ملتذون بكل شدة تطرأ عليهم فهي شدة عند غيرهم وهي ملذوذة هينة\nعندهم ولهذا أهل النهاية من العارفين يحنون إلى البداية لأجل هذا اللذة فإنهم لا يجدونها في النهاية فإنهم أهل تمييز متحققون بالحق فهم أهل غضب ورضي فيحنون إلى البداية لأجل ما فيها من الالتذاذ وكلما كمل الرجل أعطاه الله التمييز في الأمور وحققه بالحقائق إذ الموطن يعطي ذلك فلو كان مزاج الدنيا على مزاج الجنة لم يعط إلا نعيما مجردا أو على مزاج النار لم يعط إلا ألما فلما كان ممتزجا وقتا هكذا ووقتا هكذا كان العارفون بحسب الموطن وإذا علمت هذا فاعلم أنه يكون أيضا من أحوال المراد رفع التمني والطمع والإخلاص من نفسه مع المبالغة في الأعمال فيشاهدها من حيث ما هو محل لجريانها ويجعلها من جملة الأقدار الجارية عليه وذلك لفنائه عما ينسب إليه من الحول والقوة فليس له مقام ولا يحكم عليه حال فإنه لا يرى المقام ولا الحال لنظره إلى رب المقام والحال بعين رب المقام والحال متفرج في جريان الأقدار عليه وظهورها فيه وهو مع نفسه كأنه لا داخل فيها ولا خارج عنها\n\n\nوأما كون هذا الشخص سمي مرادا ليس معناه أنه مراد لما أريد به وإنما معناه أنه محبوب فإن المحبوب لا يكون معذبا بشي‏ء فلا بد أن يحول المحب بين ما يؤلم محبوبه وبين محبوبه وإن لم يفعل ذلك فليس بمحب ولا ذلك محبوبا وكذا وقع أن الله ما ابتلى من ابتلى من عباده المحبوبين عنده من كونهم محبوبين وإنما رزقهم من جملة ما رزقهم أن جعلهم محبين له فلما ادعوا محبته ابتلاهم من كونهم محبين لا من كونهم محبوبين فافهم فالمحبوب له الإدلال والمحب له الخضوع فالمراد هو المحبوب فلا يذوق بلاء وأما المراد الذي يكون مرادا لما أريد به فإنه لا بد أن يرزق الإرادة لما أريد به فلا يقع له إلا ما هو مراد له وقد ذكرناه وما كل مراد لما أريد به يكون له إرادة فيما أريد به فمن يكون له إرادة ذلك فهو المراد المصطلح عليه في هذا الطريق فالمراد لما أريد به هو حال يعم الخلق أجمعه ما فيه اختصاص ومن يكون له إرادة فيما أريد به فذلك خصوص وهو المطلوب بهذه اللفظة وهذا الاسم في هذا الطريق عند أهل الله فيكون مرادا مريدا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ فإن الكلام في باب الإرادة والمراد والمريد يطول‏\n\n",
    "en": "## Chapter Two Hundred and Twenty-Seven concerning the Gnosis of the State of the Desired One (المراد)\n\n> Indeed, the Desired One (المراد) is the one drawn by the state (الحال)\n> In every state, whether settling or traveling.\n> He walks by it, being in purity and ease,\n> Over the stations (المقامات), moving from state to state.\n> It is a Divine care from Him, and the All-Merciful guards him\n> With His Eye, so he is in bliss and acceptance.\n\n### The Desired One (المراد) is the one drawn away from his own will, while affairs are made ready for him.\n\nKnow that the Desired One (المراد) in the terminology of the Folk (Sufis) is the one drawn away (المجذوب) from his own will (إرادته), while affairs are made ready for him. Thus, he traverses the customs and the stations (المقامات) without hardship, but rather with delight, sweetness, and pleasantness. Difficulties and severe matters become easy for him.\n\nThe Desired Ones (المرادون) here are divided into two sections.\n\nThe first section is that he undertakes difficult matters, and perceptible and psychological afflictions (البلايا) befall him. He feels them, and his nature dislikes that. However, he sees and witnesses the good that is his in the inner reality of the matter with Allah, such as the health gained from drinking bitter medicine. So, the witnessing (مشاهدة) of that bliss (النعيم) hidden within this affliction (البلاء) overcomes him, and he finds delight in what occurs to him that contradicts his purpose—which is psychological torment—and in perceptible pains, due to this witnessing.\n\nAn example is Umar ibn al-Khattab, may Allah be pleased with him, for he is among the people of this station (مقام). He said concerning this: \"No misfortune (مصيبة) has afflicted me except that I saw that Allah had three favors (نعم) upon me within it: The first favor: that the misfortune was not in my religion. The second favor: that it was not a greater misfortune, since that was possible. The third favor: what Allah has for me in it, namely the expiation of sins and the raising of degrees.\" So, thank Allah the Exalted upon the occurrence of every misfortune.\n\nHere is a marvelous jurisprudence (فقه) in the path of the Folk, which the Realities (الحقائق) grant to whoever knows the way of Allah. For affliction does not accept gratitude (الشكر), and blessing (النعمة) does not accept patience (الصبر). If the one afflicted gives thanks, then his witnessed reality (مشهوده) is nothing but the blessings, so gratitude is incumbent upon him. And if the one blessed is patient, then his witnessed reality is nothing but the affliction, which is the burden of being commanded by Allah to seek gratitude for it, and the burden of the ruling concerning how to dispose of it. Thus, his witnessed reality necessitates patience for him. The Real (الحق)—Glory be to Him—sends blessings upon him successively, and in his witnessing (شهود), he looks at the rights of Allah incumbent upon him within those blessings, so he strives to fulfill them. Thus, he does not find delight in what people assume he is delighting in, but rather he is patient regarding the succession of blessings upon him; therefore, he is a person of affliction. What is considered is only what the Real witnesses in his time. So, according to his time, he is either a person of gratitude or a person of patience. This is the state (حال) of the first section of the Desired Ones.\n\nAs for the other section, he does not feel the customary hardships. Rather, Allah places within him a strength by which he carries those hardships that others, even the strong, are too weak to bear. This is like a strong, mature man who is tasked with carrying something difficult for a child to carry. He has no awareness of the difficulty, but carries it without hardship, for it is within his strength and capacity. The child carries it with hardship and effort. But this man delights in carrying it, joyful in his strength, boasting of it. He finds no pain and does not feel it, as Abu Yazid [al-Bistami] said in one of his intimate prayers (مناجاته):\n\n> I desire You, I do not desire You for reward,\n> But rather I desire You for punishment.\n> And all my aims I have attained from them,\n> Except the delightful ecstasy (وجد) I find in torment.\n\nSo, seeking delight in that which customarily yields torment is a breach of custom. He did not seek torment [for its own sake]. The People of Allah (أهل الله) say: \"It is not wondrous for one who enters a garden, but rather wondrous for one who enters the depths of the fires.\" The author of this statement says: \"It is not wondrous for one who delights in what nature customarily delights in, but rather wondrous for one who delights in what nature customarily suffers pain from.\"\n\nIt is mentioned that one of the lovers (المحبين) committed a transgression, and the ruler whipped him one hundred lashes. He did not feel ninety-nine of them and did not cry out for help. But when the hundredth lash was struck, he cried out. When asked about this, he said: \"The eye for whose sake I was being punished was looking at me, and I was enjoying the bliss of looking at it, so I did not feel the impact of the whip on my back. But when the hundredth lash was struck, it vanished from me, so I felt the impact of the whip and cried out.\"\n\nAnd I saw the righteous woman in Mecca, Fatima bint al-Taj. Her father beat her severely without her having committed any transgression, yet she did not feel it. She felt something interposing between her back and the impact points of the whips. The whip would strike that barrier, and she would hear the sound of the impact with her ear, yet she would be astonished that she did not feel it. Something similar happened to us in our early stages, in a long story.\n\nThis Desired One (المراد), Allah may grant him delight constantly in everything that befalls him, whether affliction or blessing. For bliss (النعيم) is nothing added to the essence of the delight (اللذة) subsisting in the person, just as affliction (البلاء) is nothing added to the existence of the essence of the pain (الألم). As for the causes necessitating them, they are not considered by us. Thus, the person of affliction is only the one in whom pain subsists, and the person of blessing is only the one in whom delight subsists, regardless of whether the cause was customary or non-customary.\n\nIn this section, Allah may make it so that everything Allah wills to descend upon him is desired by him in his very self. When Allah grants him what he desires—and this must happen, for that is what Allah the Exalted desires—he finds delight in the occurrence of what he desires. Thus, hardships and opposing detestable things become desired by him, so they befall him, and he carries them with what he possesses and the strength Allah has placed within him. The state of the Desired One may thus be of this caliber.\n\nThe people of the beginning (أهل البداية) in this path, upon achieving repentance (التوبة), all find delight in every hardship that befalls them. It is a hardship for others, but for them, it is delightful and easy. For this reason, the people of the end (أهل النهاية) among the Gnostics (العارفين) yearn for the beginning because of this delight, for they do not find it in the end. They are people of discernment (تمييز), realized in the Real (الحق), so they are people of wrath and contentment. They yearn for the beginning because of the delight found therein. The more complete a man becomes, the more Allah grants him discernment in affairs and realizes him in the Realities (الحقائق), since the locus grants that. If the temperament of the world were like the temperament of Paradise, it would yield nothing but pure bliss. If it were like the temperament of the Fire, it would yield nothing but pain. Since it is mixed—sometimes like this, sometimes like that—the Gnostics act according to the locus.\n\nIf you know this, then know that among the states (أحوال) of the Desired One (المراد) is also the removal of wishing (التمني), covetousness (الطمع), and sincerity (الإخلاص) from his self, despite his diligence in performing deeds. He witnesses them from the perspective that he is merely the locus for their occurrence, and he considers them among the decrees (الأقدار) running their course upon him. This is due to his annihilation (فنائه) from any power or strength (الحول والقوة) attributed to him. Thus, he has no station (مقام), nor does a state (حال) govern him, for he does not see the station or the state, due to his gaze upon the Lord of the Station and the State, with the Eye of the Lord of the Station and the State. He is merely an observer of the decrees running their course upon him and manifesting within him, and he is with his self as if he is neither within it nor outside of it.\n\nAs for this person being named the Desired One (مراد), it does not mean that he is desired for what is willed for him, but rather it means that he is Beloved (محبوب). For the Beloved is not tormented by anything. The Lover (المحب) must interpose between what pains his beloved and his beloved. If he does not do that, he is neither a lover nor is that person beloved. And thus it occurred that Allah did not test those of His servants who are Beloved by Him *because* they are Beloved. Rather, among the provisions He granted them was that He made them Lovers (محبين) of Him. So, when they claimed His love, He tested them *because* they were Lovers, not because they were Beloved. Understand this. The Beloved has the right to familiarity/presumption (الإدلال), and the Lover has the duty of submission (الخضوع). Thus, the Desired One (المراد) is the Beloved, so he does not taste affliction.\n\nAs for the Desired One who is desired for what is willed for him, he must be granted the will (الإرادة) for what is willed for him, so nothing occurs to him except what is desired by him, as we have mentioned. Not everyone who is desired for what is willed for him possesses a will concerning what is willed for him. So, whoever possesses the will for that is the Desired One defined technically in this path. The state of being desired for what is willed for him is a state that encompasses all creation; there is no specialization in it. But whoever possesses a will concerning what is willed for him—that is a specialization, and that is what is sought by this term and this name in this path among the People of Allah. Thus, he is a Desired One (مراد) and a Seeker (مريد). And Allah says the Truth, and He guides to the Way. Indeed, the discussion concerning the chapter of Will (الإرادة), the Desired One (المراد), and the Seeker (المريد) is lengthy.",
    "ur": "باب دو سو ستائیس: مراد (المراد) کے حال کی معرفت میں\n\nمراد وہ ہے جو حال کے ذریعے مجذوب (المجذوب) ہو،\nہر حال میں، خواہ قیام ہو یا کوچ۔\n\nوہ اس (حال) کے ذریعے چلتا ہے، جبکہ وہ آسانی اور راحت میں ہے،\nمقامات (المقامات) پر ایک حال سے دوسرے حال کی طرف۔\n\nیہ اس کی طرف سے عنایت ہے اور رحمن اپنی آنکھ سے اس کی حفاظت کرتا ہے،\nپس وہ نعمت اور اقبال میں ہے۔\n\n### مراد (المراد) وہ ہے جو اپنے ارادے سے مجذوب (المجذوب) ہو، جبکہ اس کے لیے امور تیار کر دیے گئے ہوں\n\nجان لو کہ قوم (صوفیاء) کی اصطلاح میں مراد (المراد) وہ ہے جو اپنے ارادے سے مجذوب (المجذوب) ہو، جبکہ اس کے لیے امور تیار کر دیے گئے ہوں۔ پس وہ رسوم (الرسوم) اور مقامات (المقامات) کو بغیر کسی مشقت کے، بلکہ لذت، شیرینی اور پاکیزگی کے ساتھ عبور کرتا ہے، جس سے اس پر مشکلات اور امور کی سختیاں آسان ہو جاتی ہیں۔\n\nیہاں مرادوں (المرادون) کو دو قسموں میں تقسیم کیا گیا ہے۔ پہلی قسم یہ ہے کہ وہ مشکل امور کو اختیار کرتا ہے اور اس پر محسوس اور نفسانی بلائیں (البلايا) نازل ہوتی ہیں، اور وہ انہیں محسوس کرتا ہے اور اس کی طبیعت انہیں ناپسند کرتی ہے، لیکن وہ دیکھتا اور شہود (الشهود) کرتا ہے کہ باطنی طور پر اللہ کے نزدیک اس میں اس کے لیے کیا خیر ہے، جیسے ناگوار دوا پینے میں عافیت۔ پس اس پر اس نعمت کا شہود (الشهود) غالب آ جاتا ہے جو اس بلا کی تہہ میں پوشیدہ ہے، اور وہ اس چیز سے لذت محسوس کرتا ہے جو اس کے مقصد کی مخالفت میں اس پر وارد ہوتی ہے، یعنی نفسانی عذاب اور محسوس ہونے والے درد، اس شہود (الشهود) کی وجہ سے۔ جیسے عمر بن خطاب رضی اللہ عنہ، جو اس مقام کے حاملین میں سے ہیں، انہوں نے اس بارے میں فرمایا: \"اللہ نے مجھے کوئی مصیبت نہیں پہنچائی مگر میں نے دیکھا کہ اس میں اللہ کی مجھ پر تین نعمتیں (النعم) ہیں۔ پہلی نعمت یہ کہ وہ مصیبت میرے دین میں نہیں تھی، دوسری نعمت یہ کہ وہ اس سے بڑی مصیبت نہیں تھی، کیونکہ یہ ممکن تھا، اور تیسری نعمت یہ کہ اس میں میرے لیے گناہوں کا کفارہ اور درجات کی بلندی ہے۔\"\n\nپس ہر مصیبت کے نازل ہونے پر اللہ تعالیٰ کا شکر ادا کرو۔ اور یہاں قوم (صوفیاء) کے طریق میں ایک عجیب فقہ ہے جو حقائق (الحقائق) اسے عطا کرتے ہیں جو اللہ کا راستہ جانتا ہے۔ بلا (البلاء) شکر کو قبول نہیں کرتی اور نعمت (النعمة) صبر کو قبول نہیں کرتی۔ اگر کسی پر بلا نازل ہو اور وہ شکر کرے تو اس کا مشہود (مشهود) صرف نعمتیں ہیں، لہٰذا اس پر شکر واجب ہے۔ اور اگر کسی پر نعمتیں نازل ہوں اور وہ صبر کرے تو اس کا مشہود (مشهود) صرف بلا ہے، اور وہ یہ ہے کہ اس میں اللہ کی طرف سے شکر طلب کرنے کی جو ذمہ داری ہے اور اس میں تصرف کے حکم کی جو ذمہ داری ہے، وہ اس کے لیے بلا ہے۔ پس اس کا مشہود (مشهود) اس کے لیے صبر کا تقاضا کرتا ہے۔ اور ذات حق (الحق) سبحانہ اس پر نعمتیں پے در پے نازل کرتا ہے، اور وہ اپنے شہود (شهود) میں دیکھتا ہے کہ اس میں اللہ کے اس پر کیا حقوق ہیں، پس وہ انہیں ادا کرنے میں اپنی جان کو مشقت میں ڈالتا ہے۔ لہٰذا وہ اس چیز سے لذت محسوس نہیں کرتا جسے لوگ سمجھتے ہیں کہ وہ اس سے لذت لے رہا ہے، بلکہ وہ اپنے اوپر نعمتوں کے پے در پے آنے پر صبر کرتا ہے، پس وہ صاحبِ بلا ہے۔ لہٰذا اعتبار صرف اس چیز کا ہے جس کا وہ اس وقت ذات حق (الحق) میں شہود (شهود) کرتا ہے۔ پس وہ اپنے وقت کے اعتبار سے یا تو صاحبِ شکر ہے یا صاحبِ صبر۔ یہ مرادوں (المرادين) کی پہلی قسم کا حال ہے۔\n\nاور دوسری قسم وہ ہے جو عام سختیوں کو محسوس نہیں کرتا، بلکہ اللہ اس میں ایسی قوت پیدا کر دیتا ہے جس سے وہ ان سختیوں کو اٹھا لیتا ہے جنہیں دوسرے طاقتور لوگ اٹھانے سے کمزور پڑ جاتے ہیں۔ جیسے ایک بڑا اور طاقتور آدمی، جسے وہ بوجھ اٹھانے کا حکم دیا جاتا ہے جو چھوٹے کے لیے مشکل ہوتا ہے۔ اسے اس کی کوئی خبر نہیں ہوتی، بلکہ وہ اسے بغیر کسی مشقت کے اٹھا لیتا ہے، کیونکہ وہ اس کی قوت اور قدرت کے تحت ہوتا ہے۔ جبکہ چھوٹا اسے مشقت اور کوشش سے اٹھاتا ہے۔ پس یہ (بڑا آدمی) اسے اٹھانے میں لذت محسوس کرتا ہے، اپنی قوت پر خوش ہوتا ہے اور فخر کرتا ہے، اسے کوئی درد نہیں ہوتا اور نہ ہی وہ اسے محسوس کرتا ہے، جیسا کہ ابو یزید (بسطامی) نے اپنی بعض مناجات میں فرمایا:\n\nمیں تجھے چاہتا ہوں، ثواب کے لیے نہیں چاہتا،\nبلکہ میں تجھے عذاب کے لیے چاہتا ہوں۔\n\nاور میری تمام خواہشات مجھے مل چکی ہیں،\nسوائے عذاب کے ساتھ میرے وجد کی لذت کے۔\n\nپس اس چیز میں لذت طلب کرنا جو عادتاً عذاب لاتی ہے، یہ خرقِ عادت (عادت کو توڑنا) ہے۔ اہل اللہ کہتے ہیں کہ تعجب اس پر نہیں جو باغ میں وارد ہوا، بلکہ تعجب اس پر ہے جو آگ کے گہرائی میں وارد ہوا۔ اس کلام کا قائل کہتا ہے کہ تعجب اس پر نہیں جو اس چیز سے لذت لے جس سے طبیعت عادتاً لذت لیتی ہے، بلکہ تعجب اس پر ہے جو اس چیز سے لذت لے جس سے طبیعت عادتاً تکلیف محسوس کرتی ہے۔ ذکر کیا گیا ہے کہ بعض محبین نے کوئی جرم کیا تو حاکم نے اسے سو کوڑے مارے۔ اس نے ننانوے کوڑوں کو محسوس نہیں کیا اور نہ ہی فریاد کی۔ جب سوواں کوڑا لگا تو اس نے فریاد کی۔ اس سے اس بارے میں پوچھا گیا تو اس نے کہا: \"جس آنکھ کی خاطر مجھے سزا دی جا رہی تھی، وہ میری طرف دیکھ رہی تھی، اور میں اس کے دیکھنے سے لطف اندوز ہو رہا تھا، اس لیے میں اپنی پیٹھ پر کوڑوں کے پڑنے کو محسوس نہیں کر رہا تھا۔ جب سوواں کوڑا لگا تو وہ مجھ سے غائب ہو گئی، تب میں نے کوڑے کے پڑنے کو محسوس کیا اور فریاد کی۔\"\n\nاور میں نے مکہ میں نیک خاتون فاطمہ بنت التاج کو دیکھا، ان کے والد نے انہیں بغیر کسی جرم کے شدید مارا، مگر انہوں نے اسے محسوس نہیں کیا۔ وہ محسوس کرتی تھیں کہ کوئی چیز ان کی پیٹھ اور کوڑوں کے پڑنے کی جگہوں کے درمیان حائل ہو جاتی تھی، اور کوڑا اس حائل پر پڑتا تھا۔ وہ اپنے کانوں سے کوڑے کی آواز سنتی تھیں اور تعجب کرتی تھیں کہ انہیں محسوس کیوں نہیں ہو رہا۔ ہمارے ساتھ بھی ہماری ابتدا میں ایک طویل حکایت میں ایسا ہی واقعہ پیش آیا ہے۔\n\nپس اس مراد (المراد) کو اللہ ہمیشہ ہر اس چیز سے لذت عطا کر سکتا ہے جو اس پر بلا (البلاء) یا نعمت (النعمة) کی صورت میں وارد ہو۔ کیونکہ نعمت (النعيم) کوئی ایسی چیز نہیں جو شخص میں قائم لذت (اللذة) کی حقیقت سے زائد ہو، جیسا کہ بلا (البلاء) بھی درد (الألم) کی حقیقت کے وجود سے زائد کوئی چیز نہیں۔ اور جہاں تک ان دونوں کے موجب اسباب کا تعلق ہے، تو وہ ہمارے نزدیک قابلِ اعتبار نہیں۔ پس صاحبِ بلا وہی ہے جس میں درد قائم ہو، اور صاحبِ نعمت وہی ہے جس میں لذت قائم ہو، خواہ اس کا سبب عادتاً ہو یا غیر عادتاً۔\n\nاور اس قسم میں اللہ یہ بات رکھ دیتا ہے کہ وہ خود اپنے اندر ہر اس چیز کا مراد (مراد) ہو جائے جسے اللہ اس پر نازل کرنا چاہتا ہے۔ پس جب اللہ اسے اس کا مراد عطا کر دیتا ہے، اور یہ ضروری ہے کیونکہ وہ اللہ تعالیٰ کا مراد ہے، تو وہ اپنے مراد کے واقع ہونے سے لذت محسوس کرتا ہے۔ پس مخالف سختیاں اور ناگواریاں اس کے لیے مراد (مراد) بن جاتی ہیں، اور وہ اس پر نازل ہوتی ہیں تو وہ انہیں اپنی اندرونی قوت اور اس طاقت کے ذریعے اٹھا لیتا ہے جو اللہ نے اس میں رکھی ہے۔ پس مراد (المراد) کا حال اس مقام پر ہو سکتا ہے۔ اور اس طریق کے اہل ابتداء، توبہ کے حصول کے وقت، ہر اس سختی سے لذت لیتے ہیں جو ان پر وارد ہوتی ہے۔ وہ دوسروں کے نزدیک سختی ہوتی ہے، مگر ان کے نزدیک وہ لذیذ اور آسان ہوتی ہے۔ اسی لیے عارفین (العارفين) میں سے اہل نہایت اس لذت کی خاطر ابتداء کی طرف مائل ہوتے ہیں، کیونکہ وہ اسے نہایت میں نہیں پاتے۔ وہ تمیز والے لوگ ہیں جو ذات حق (الحق) کے ساتھ متحقق ہیں، پس وہ غضب اور رضا والے ہیں۔ وہ اس التذاذ کی خاطر ابتداء کی طرف مائل ہوتے ہیں جو اس میں ہے۔ اور جب بھی کوئی شخص کامل ہوتا ہے، اللہ اسے امور میں تمیز عطا کرتا ہے اور اسے حقائق (الحقائق) کے ساتھ متحقق کرتا ہے، کیونکہ یہ مقام اسی کا تقاضا کرتا ہے۔ اگر دنیا کا مزاج جنت کے مزاج پر ہوتا تو صرف خالص نعمت ہی ملتی، یا اگر دوزخ کے مزاج پر ہوتا تو صرف درد ہی ملتا۔ چونکہ یہ (دنیا) کبھی اس طرح اور کبھی اس طرح ملی جلی ہے، اس لیے عارفین (العارفون) مقام کے مطابق ہوتے ہیں۔\n\nاور جب تم یہ جان چکے ہو تو یہ بھی جان لو کہ مراد (المراد) کے احوال میں سے یہ بھی ہے کہ وہ اپنے نفس سے تمنا، طمع اور اخلاص کو بھی اٹھا لیتا ہے، باوجود اس کے کہ وہ اعمال میں مبالغہ کرتا ہے۔ پس وہ انہیں اس حیثیت سے دیکھتا ہے کہ وہ ان کے جاری ہونے کا محل ہے، اور انہیں ان اقدار (الأقدار) میں شامل کرتا ہے جو اس پر جاری ہیں۔ اور یہ اس لیے ہے کہ وہ اپنے آپ سے منسوب ہونے والے حول اور قوت سے فنا (الفناء) ہو چکا ہے۔ پس اس کا کوئی مقام (مقام) نہیں ہوتا اور نہ ہی کوئی حال (حال) اس پر حکم کرتا ہے، کیونکہ وہ مقام (المقام) اور حال (الحال) کو نہیں دیکھتا، بلکہ وہ ربِ مقام اور ربِ حال کو ربِ مقام اور ربِ حال کی آنکھ سے دیکھتا ہے، اور وہ اپنے اوپر اقدار (الأقدار) کے جاری ہونے اور اس میں ان کے ظاہر ہونے میں تماشائی ہوتا ہے، اور وہ اپنے نفس کے ساتھ ایسا ہوتا ہے گویا نہ وہ اس میں داخل ہے اور نہ اس سے خارج ہے۔\n\nاور جہاں تک اس شخص کو مراد (مراد) کہے جانے کا تعلق ہے، تو اس کا مطلب یہ نہیں کہ وہ اس چیز کا مراد ہے جو اس کے لیے چاہی گئی ہے، بلکہ اس کا مطلب یہ ہے کہ وہ محبوب ہے۔ کیونکہ محبوب کو کسی چیز سے عذاب نہیں دیا جاتا۔ پس محب کے لیے ضروری ہے کہ وہ اپنے محبوب اور اس چیز کے درمیان حائل ہو جائے جو اس کے محبوب کو تکلیف دیتی ہے۔ اور اگر وہ ایسا نہ کرے تو وہ محب نہیں اور نہ ہی وہ محبوب ہے۔ اور اسی طرح یہ بھی واقع ہوا کہ اللہ نے اپنے محبوب بندوں میں سے جن کو آزمایا، تو انہیں محبوب ہونے کی حیثیت سے نہیں آزمایا، بلکہ اللہ نے انہیں جو رزق دیا، اس میں یہ بھی شامل تھا کہ انہیں اپنا محب بنا دیا۔ پس جب انہوں نے اپنی محبت کا دعویٰ کیا تو اللہ نے انہیں محب ہونے کی حیثیت سے آزمایا، نہ کہ محبوب ہونے کی حیثیت سے۔ پس سمجھو! محبوب کے لیے ناز ہے اور محب کے لیے عاجزی ہے۔ پس مراد (المراد) ہی محبوب ہے، لہٰذا وہ بلا (البلاء) کا ذائقہ نہیں چکھتا۔ اور وہ مراد (المراد) جو اس چیز کا مراد ہو جو اس کے لیے چاہی گئی ہے، تو اسے لازماً اس چیز کا ارادہ (الإرادة) بھی رزق کیا جاتا ہے جو اس کے لیے چاہی گئی ہے، پس اس پر وہی واقع ہوتا ہے جو اس کے لیے مراد (مراد) ہے۔ اور ہم اسے بیان کر چکے ہیں۔ اور ہر وہ شخص جو اس چیز کا مراد ہو جو اس کے لیے چاہی گئی ہے، ضروری نہیں کہ اسے اس چیز میں ارادہ (الإرادة) بھی ہو۔ پس جسے اس چیز کا ارادہ (الإرادة) ہو، وہی اس طریق میں اصطلاحی مراد (المراد) ہے۔ وہ مراد جو اس چیز کا مراد ہو جو اس کے لیے چاہی گئی ہے، وہ ایک ایسا حال ہے جو تمام مخلوق کو شامل ہے، اس میں کوئی خصوصیت نہیں۔ اور جسے اس چیز میں ارادہ (الإرادة) ہو جو اس کے لیے چاہی گئی ہے، وہ خصوصیت ہے، اور اہل اللہ کے نزدیک اس طریق میں اسی لفظ اور اسی نام سے یہی مطلوب ہے۔ پس وہ مراد (مراد) بھی ہوتا ہے اور مرید (مريد) بھی۔ اور اللہ سچ فرماتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔ کیونکہ ارادہ، مراد (المراد) اور مرید (المريد) کے باب میں کلام طویل ہے۔",
    "fa": "باب دویست و بیست و هفتم در معرفت حال مراد (المراد)\n\nمراد کسی است که به حال (حال) جذب شده است، در هر وضعیتی، چه در اقامت و چه در سفر.\n\nاو به واسطه آن (حال) در آسایش و آرامش گام برمی‌دارد، از مقامی (مقام) به مقامی دیگر.\n\nاین عنایتی از جانب اوست و خداوند رحمان با چشم خود او را نگهبانی می‌کند، پس او در نعمت و اقبال است.\n\n### [مراد کسی است که از اراده خود مجذوب شده، در حالی که امور برایش مهیا گشته است]\n\nبدانید که مراد (المراد) در اصطلاح اهل طریقت (القوم)، کسی است که از اراده خود مجذوب (المجذوب) شده است، در حالی که امور برای او مهیا گشته است. پس او از رسوم و مقامات (المقامات) بدون مشقت، بلکه با التذاذ، شیرینی و خوشی عبور می‌کند؛ امری که سختی‌ها و شدائد امور را بر او آسان می‌سازد. مرادون در اینجا به دو دسته تقسیم می‌شوند:\n\nدسته اول آن است که امور دشوار را بر خود هموار می‌سازد و بلاهای محسوس و نفسانی بر او فرود می‌آید. او آن‌ها را حس می‌کند و طبعش از آن کراهت دارد، اما در باطن امر، خیر و نعمتی را که نزد حق (الحق) برای او در آن است، مشاهده می‌کند و می‌بیند؛ مانند عافیتی که در نوشیدن داروی ناگوار است. پس مشاهده آن نعمت (النعيم) که در لابلای این بلا نهفته است، بر او غلبه می‌کند و به آنچه از مخالفت غرض (که همان عذاب نفسانی و آلام محسوس است) بر او وارد می‌شود، به خاطر این مشاهده، التذاذ می‌یابد. مانند عمر بن خطاب (رضی الله عنه) که از صاحبان این مقام بود و در این باره فرمود: «هیچ مصیبتی به من نرسید مگر آنکه دیدم خداوند در آن سه نعمت بر من دارد: نعمت اول اینکه آن مصیبت در دینم نبود؛ نعمت دوم اینکه مصیبت بزرگتر از آن نبود، زیرا ممکن بود بزرگتر باشد؛ و نعمت سوم، آنچه نزد خداوند برای من در آن از کفاره خطاها و رفعت درجات است.» پس هنگام فرود آمدن هر مصیبتی، خدای تعالی را شکر کن.\n\nدر اینجا فقهی شگفت‌انگیز در طریق اهل طریقت (القوم) وجود دارد که حقایق (الحقائق) آن را به کسی که راه حق (الله) را شناخته است، عطا می‌کند؛ زیرا بلا (البلاء) شکر را نمی‌پذیرد و نعمت (النعمة) صبر را نمی‌پذیرد. اگر کسی که بلا بر او وارد شده، شکر کند، مشهود او جز نعمت‌ها نیست، پس شکر بر او واجب است. و اگر کسی که نعمت بر او وارد شده، صبر کند، مشهود او جز بلا نیست؛ و آن همان تکلیف طلب شکر بر آن نعمت از حق (الله) و حکمی است که برای تصرف در آن مکلف شده است. پس مشهود او صبر را اقتضا می‌کند. حق سبحانه (الحق سبحانه) نعمت‌ها را پی در پی بر او می‌فرستد و او در شهود (الشهود) خود می‌نگرد که حق (الحق) چه حقوقی بر او در آن نعمت‌ها دارد، پس خود را در ادای آن حقوق به زحمت می‌اندازد. بنابراین، به آنچه مردم گمان می‌کنند او از آن لذت می‌برد، التذاذ نمی‌یابد، بلکه بر پی در پی آمدن نعمت‌ها صبر می‌کند. پس او صاحب بلا است. در نتیجه، آنچه معتبر است، تنها چیزی است که حق (الحق) در وقت او مشاهده می‌کند. پس او بسته به وقت خود، یا صاحب شکر است یا صاحب صبر. این حال دسته اول از مرادون است.\n\nاما دسته دیگر، شدائد معمول را حس نمی‌کنند، بلکه خداوند در آن‌ها چنان قدرتی قرار می‌دهد که آن شدائدی را که دیگران از حمل آن ناتوانند، حمل می‌کنند؛ مانند مرد بزرگ و نیرومندی که مکلف به حمل چیزی می‌شود که بر کودک دشوار است. او از آن خبر ندارد، بلکه آن را بدون مشقت حمل می‌کند، زیرا تحت قدرت و توانایی اوست؛ در حالی که کودک آن را با مشقت و زحمت حمل می‌کند. پس این شخص به حمل آن التذاذ می‌یابد، به قدرت خود شاد است و به آن افتخار می‌کند، دردی نمی‌یابد و آن را حس نمی‌کند. چنانکه ابویزید (بسطامی) در برخی مناجات‌های خود فرمود:\n\nتو را می‌خواهم، نه برای ثواب، بلکه تو را برای عقاب می‌خواهم.\n\nو به همه خواسته‌هایم رسیده‌ام، جز لذت وجد (وجد) من به عذاب.\n\nپس او لذت را در چیزی طلب کرد که عادت بر آن جاری شده که ثمره عذاب باشد؛ این خرق عادت (خرق للعادة) است. اهل حق (أهل الله) می‌گویند: شگفتی از کسی نیست که در بوستان وارد شود، بلکه شگفتی از کسی است که در قعر آتش‌ها وارد شود. صاحب این سخن می‌گوید: شگفتی از کسی نیست که به آنچه طبع عادت دارد به آن التذاذ یابد، لذت ببرد؛ بلکه شگفتی از کسی است که به آنچه طبع عادت دارد از آن متألم شود، التذاذ یابد. نقل شده است که یکی از محبان مرتکب جرمی شد و حاکم او را صد تازیانه زد. او نود و نه تازیانه را حس نکرد و استغاثه نکرد. اما وقتی تازیانه صدم رسید، استغاثه کرد. از او در این باره پرسیدند، گفت: چشمی که به خاطر آن مجازات می‌شدم، به من نگاه می‌کرد و من از نگاه او متنعم بودم، پس جای برخورد تازیانه را بر پشتم حس نمی‌کردم. اما وقتی تازیانه صدم رسید، آن چشم از من غایب شد، پس جای تازیانه را حس کردم و استغاثه نمودم.\n\nو زن صالحه در مکه، فاطمه بنت التاج، را دیدم که پدرش او را بدون ارتکاب جرمی به شدت کتک زد، اما او آن را حس نکرد. او چیزی را حس می‌کرد که بین پشتش و محل برخورد تازیانه‌ها حائل می‌شد و تازیانه بر آن حائل می‌افتاد و صدای برخورد تازیانه را با گوش خود می‌شنید و تعجب می‌کرد که چرا آن را حس نمی‌کند. برای ما نیز در ابتدای سلوکمان، در حکایتی طولانی، چنین چیزی رخ داد. پس این مراد (المراد) را خداوند ممکن است همیشه در هر چیزی که بر او وارد می‌شود، چه بلا و چه نعمت، لذت عطا کند؛ زیرا نعیم (النعيم) چیزی زائد بر عین لذتی که در شخص قائم است، نیست؛ همانطور که بلا (البلاء) چیزی زائد بر وجود عین الم نیست. اما اسباب موجبه آن‌ها نزد ما معتبر نیست. پس صاحب بلا (البلاء) نیست مگر کسی که الم در او قائم شده باشد، و صاحب نعمت (النعمة) نیست مگر کسی که لذت در او قائم شده باشد، و سبب آن هر چه می‌خواهد باشد، چه معتاد و چه غیر معتاد.\n\nاین دسته، خداوند ممکن است در آن‌ها قرار دهد که مراد (المراد) در ذات خود، خواهان تمام چیزهایی باشد که خداوند می‌خواهد بر او نازل کند. و چون خداوند مراد او را عطا کند، و این حتماً رخ می‌دهد، زیرا آن مراد حق تعالی است، او از وقوع مراد خود لذت می‌برد. پس شدائد و مکروهات متضاد، مراد او می‌شوند و بر او فرود می‌آیند و او آن‌ها را به واسطه آنچه نزد خود دارد و قدرتی که خداوند در او قرار داده، حمل می‌کند. پس حال مراد می‌تواند به این صورت باشد. اهل بدایت در این طریق، همگی هنگام حصول توبه (التوبة)، از هر شدتی که بر آن‌ها عارض می‌شود، التذاذ می‌یابند. آن شدائد نزد دیگران سخت است، اما نزد آن‌ها لذت‌بخش و آسان است. به همین دلیل، اهل نهایت از عارفان (العارفين) به خاطر این لذت، حسرت بدایت را می‌خورند، زیرا آن را در نهایت نمی‌یابند. چرا که آن‌ها اهل تمییز (التمييز) هستند و به حق (الحق) متحقق شده‌اند، پس اهل غضب و رضایت هستند. آن‌ها به بدایت حسرت می‌خورند به خاطر التذاذی که در آن بود. هرگاه انسان کامل‌تر شود، خداوند تمییز در امور را به او عطا می‌کند و او را به حقایق (الحقائق) متحقق می‌سازد، زیرا موطن (مقام) این را اقتضا می‌کند. اگر مزاج دنیا بر مزاج بهشت بود، جز نعیم محض عطا نمی‌شد، یا اگر بر مزاج آتش بود، جز الم عطا نمی‌شد. چون دنیا آمیخته است، گاهی چنین و گاهی چنان، عارفان نیز بر حسب موطن خود هستند.\n\nو چون این را دانستی، بدان که از احوال مراد (المراد) همچنین رفع آرزو، طمع و اخلاص از نفس خود است، با وجود مبالغه در اعمال. او اعمال را از آن جهت که محلی برای جریان آن‌هاست، مشاهده می‌کند و آن‌ها را جزئی از تقدیرات (الأقدار) جاری بر خود می‌داند. این به دلیل فنای (فنائه) او از آنچه از حول و قوه به او نسبت داده می‌شود، است. پس او نه مقامی (مقام) دارد و نه حالی (حال) بر او حکم می‌کند؛ زیرا او نه مقام را می‌بیند و نه حال را، بلکه با چشم رب مقام و حال، به رب مقام و حال می‌نگرد و در جریان تقدیرات بر خود و ظهور آن‌ها در وجودش، تماشاچی است. او نسبت به نفس خود، گویی نه داخل در آن است و نه خارج از آن.\n\nاما اینکه این شخص مراد (المراد) نامیده شده، به این معنی نیست که او مرادِ آنچه اراده شده است باشد، بلکه به این معنی است که او محبوب (محبوب) است. زیرا محبوب به چیزی عذاب داده نمی‌شود، و محب (خداوند) ناگزیر است بین آنچه محبوبش را آزار می‌دهد و محبوبش حائل شود. اگر چنین نکند، نه محب است و نه آن شخص محبوب. و چنین واقع شده است که خداوند بندگان محبوب خود را از آن جهت که محبوب هستند، مبتلا نکرده است، بلکه از جمله آنچه به آن‌ها روزی داده، این است که آن‌ها را محب خود قرار داده است. پس چون ادعای محبت او را کردند، آن‌ها را از آن جهت که محب هستند، مبتلا کرد، نه از آن جهت که محبوب هستند. پس بفهم. محبوب را ناز و دلال است و محب را خضوع. پس مراد (المراد) همان محبوب است و بلا را نمی‌چشد.\n\nاما مرادی که مرادِ آنچه اراده شده است باشد، ناگزیر است که اراده آنچه اراده شده است به او روزی داده شود، پس جز آنچه مراد اوست، برایش واقع نمی‌شود. و ما این را ذکر کردیم. اما هر مرادِ آنچه اراده شده است، اراده‌ای در آنچه اراده شده است ندارد. پس کسی که اراده آن را داشته باشد، همان مراد (المراد) اصطلاحی در این طریق است. مرادِ آنچه اراده شده است، حالی است که عموم خلق را در بر می‌گیرد و اختصاصی در آن نیست. اما کسی که اراده‌ای در آنچه اراده شده است داشته باشد، این یک خصوصیت است و همان است که با این لفظ و این نام در این طریق نزد اهل حق (أهل الله) مطلوب است. پس او مرادِ مرید (مراد مرید) خواهد بود. و خداوند حق (الحق) را می‌گوید و راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ). زیرا سخن در باب اراده (الإرادة)، مراد (المراد) و مرید (المرید) به درازا می‌کشد."
  },
  "page_count": 3
}