{
  "id": 481,
  "title": {
    "ar": "الباب الأحد والثمانون وأربعمائة في حال قطب كان منزله إن الله لا يضيع أَجْرَ من أَحْسَنَ عَمَلًا",
    "en": "Chapter Four Hundred and Eighty-One: Concerning the spiritual state of a Pole (قطب) whose station was: <<إِنَّ اللهَ لَا يُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا>> (Indeed, Allah does not allow to be lost the reward of those who perfect their deeds).",
    "ur": "باب نمبر چار سو اکیاسی: اس قطب کے حال کے بیان میں جس کا روحانی مقام یہ تھا: \"إِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا\" (بے شک اللہ نیک عمل کرنے والوں کا اجر ضائع نہیں کرتا)۔",
    "fa": "باب چهارصد و هشتاد و یکم در بیان حال قطبی که منزل او این آیه بود: «إِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا» (همانا خداوند پاداش نیکوکاران را ضایع نمی‌کند)."
  },
  "content": {
    "ar": "## «الباب الأحد والثمانون وأربعمائة في حال قطب كان منزله إن الله لا يضيع أَجْرَ من أَحْسَنَ عَمَلًا»\n\n\n> من يشهد الله في أعماله حسنت *** نشأتها فلها في الوزن رجحان‏\n\n\n> مع الشهود له أجر يخص به *** قضى بذلك في التعريف ميزان‏\n\n\n> أن الرسول له أجر تعينه *** له رسالته ما فيه نقصان‏\n\n\n> لو لا الوجود لما كان الشهود لنا *** وفي الوجود لنا ربح وخسران‏\n\n\n> وليس يدري الذي جئنا به أحد *** الا عليم بما في الأمر حيران‏\n\n\n### [إن العبد إذا عمل في عمله عبادة يرى ربه بما استحضره في تلك العبادة على قدر علمه‏]\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الإحسان إنه العمل على رؤية الحق في العبادة وهو تنبيه عجيب من عالم شفيق على أمته لأنه علم أنه إذا قام العبد في عمله عبادة وجعل في نفسه أنه يرى ربه ويراه ربه بما استحضره في تلك العبادة على قدر علمه فإنه إذا كان هذا هجيره وديدنه ذلك أبصر أن العامل هو الله لا هو وأن العبد محل ظهور ذلك العمل كما ورد أن الله قال على لسان عبده سمع الله لمن حمده فالإحسان في العبادة كالروح في الصورة يحييها وإذا أحياها لم تزل تستغفر لصاحبها ولها البقاء الدائم فلا يزال مغفورا له فإن الله صادق وقد أخبر أنه لا يضيع أَجْرَ من أَحْسَنَ عَمَلًا بل لا يضيع عَمَلَ عامِلٍ مِنْكُمْ من ذَكَرٍ أَوْ أُنْثى‏ بَعْضُكُمْ من بَعْضٍ كان العمل ما كان فإن كان خيرا فلا يضيع أجره وإن لم يكن خيرا فإن الله لا يضيعه لأنه لا بد أن يبدل الله سيئات التائب حسنات فإن لم يكن العمل غير مضيع وإلا ففي أي أمر يقع التبديل لأن الأعمال صور أنشأها العامل لا بل أنشأها الله فإنه العامل والعبد محل ظهور ذلك العمل كالهيولى لما يقبله من فتح الصور فيها ثم إن الحضور مع الله تعالى وهو الإحسان في ذلك العمل حياة ذلك العمل وبه سمي عبادة ولو لا هذا\nالحضور ما كان عبادة فما من مؤمن يعصي إلا وفي نفسه ذل المعصية فلذلك يصير عبادة ولو لم يكن إلا علمه بأنها معصية وأي روح أشرف من العلم كما قال الله عن نفسه إنه أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً ودل عليه دليل العقل والعمل من الأشياء وهو يعلمه ويعلم حيث هو فكيف يضيع عنه أو يضيعه وهو خلق من خلقه يسبح بحمده فإن كانت حياته عن نفخ ربه سبح بحمده وإن كانت حياته عن حضور عامله ومنشئه وكان العمل ما كان سبح بحمده واستغفر لعامله فهذا الفرقان بين العملين فإن أعطى الله المغفرة لغير الحاضر فإنما ذلك مراعاة إلهية لكون هذا العبد أنشأ بوجوده صورة ولا بد لكل صورة من روح فإن الله يغفر له لكونه ظهرت عنه صورة نفخ الحق فيها روحا منه فسبحت بحمده فلهذا الاشتراك لحقت المغفرة صاحب ذلك العمل كان من كان ولحقته متى لحقته والتروك لا تكون أعمالا إلا إذا نويت وما لم ينوها صاحبها فإنها ليست بعمل فإن الأعمال منها ظاهرة وباطنة أو يترك الإنسان ما أمر بفعله فإن الترك عدم محض إلا أن هناك دقيقة وذلك أن العمل الذي يكون فيه في زمان ترك ما أوجب الله عليه فعله هو الذي يكون صورة من إنشاء عامله لا عين الترك فإن الزمان إنما هو لذلك العمل المتروك حتى يتوب وهذا أشد المعاصي وأعظمها ولهذا ذهب من ذهب من أهل الظاهر إلى أنه من صلى ركعتي الفجر ولم يضطجع فإن صلاة الصبح لا تصح له وإن لم يركع الفجر لم يجب عليه الاضطجاع وجازت صلاة الصبح وغايته أنه ترك سنة مؤكدة لا إثم عليه في تركها وهذا عين ما ذكرناه والتعليل واحد فكل عمل مأمور به على طريق الفرض والوجوب وترك فإن العمل الذي يقوم الإنسان فيه على البدل من العمل المأمور به هو الذي يقوم صورة لا عين الترك فافهم ولكن إذا كان العمل المتروك يشغل زمانا بذاته لا يصح في ذلك الزمان غيره ويكون مطلقا لا يكون زمانا مقيدا ويكون العمل ممن يحرم على العامل التصرف في عمل غيره كالصلاة فإن لم يكن كذلك فأي عمل عمله فإنه مقبول أعني من أعمال الخير لأنه عمله في زمان يجوز له فيه عمله فأحسن العمل ما عمل بشرطه وفي زمانه وتمام خلقه وكمال رتبته في حاله فحينئذ يكون صورة مخلوقة فافهم ذلك واعمل بحسبه فإنك تنتفع بذلك إن شاء الله‏\n\n",
    "en": "## Chapter Four Hundred and Eighty-One: Concerning the State of a Pole Whose Station is <<إِنَّ اللهَ لَا يُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا>> (Indeed Allah does not allow to be lost the reward of those who do good deeds)\n\nWhoever witnesses Allah in his deeds, their formation is excellent,\nand thus they possess preponderance in the Balance.\n\nAlong with this Witnessing (الشهود), there is a specific reward for him;\na balance has decreed this in the definition (of spiritual excellence).\n\nThe Messenger has a reward that aids him;\nhis message is for him, and there is no deficiency in it.\n\nWere it not for Existence (الوجود), there would be no Witnessing (الشهود) for us;\nand in Existence, we find both profit and loss.\n\nNo one comprehends what we have brought forth,\nexcept for one who is knowledgeable yet bewildered by the matter.\n\n[When the servant performs an act of worship (عبادة), he sees his Lord in that act, according to what he brings to mind (استحضره) in that worship, and commensurate with his knowledge (علم).]\n\nThe Messenger of Allah (peace and blessings be upon him) said concerning spiritual excellence (الإحسان) that it is performing the deed upon the vision of the Real (رؤية الحق) in the act of worship (العبادة). This is a marvelous admonition from a scholar who is compassionate toward his community, for he knew that when the servant undertakes an act of worship and places in his soul that he sees his Lord, his Lord sees him according to what he brings to mind (استحضره) in that worship, commensurate with his knowledge (علم).\n\nIf this becomes his habit and custom, he will perceive that the Agent (العامل) is Allah, not himself, and that the servant is merely the locus of manifestation (محل ظهور) for that action, just as it is related that Allah said through the tongue of His servant, \"Allah hears the one who praises Him.\"\n\nSpiritual excellence (الإحسان) in worship is like the spirit (الروح) in the form (الصورة); it gives it life. When it is brought to life, it continuously seeks forgiveness for its owner, and it possesses eternal subsistence (البقاء الدائم). Thus, forgiveness is perpetually granted to him, for Allah is truthful and has informed us that He does not allow to be lost the reward of those who do good deeds (أَحْسَنَ عَمَلًا). Rather, He does not allow to be lost <<عَمَلَ عَامِلٍ مِنْكُمْ مِنْ ذَكَرٍ أَوْ أُنْثَى بَعْضُكُمْ مِنْ بَعْضٍ>> (the work of any worker among you, male or female, you are members one of another).\n\nWhatever the action may be, if it is good, its reward is not lost. And even if it is not good, Allah does not allow it to be lost, because Allah must transform the evil deeds of the repentant person into good deeds. If the action were not preserved (غير مضيع), then in what matter would the transformation (التبديل) occur? This is because actions are forms (صور) created by the agent—no, rather, they are created by Allah, for He is the Agent (العامل), and the servant is the locus of manifestation (محل ظهور) for that action, like prime matter (الهيولى) receiving the opening of forms within it.\n\nFurthermore, the Presence (الحضور) with Allah the Exalted—which is spiritual excellence (الإحسان) in that action—is the life of that action. By virtue of this, it is called worship (عبادة). Were it not for this Presence, it would not be worship. There is no believer who disobeys except that the humiliation of the disobedience is in his soul, and thus it becomes worship, even if it were only his knowledge (علم) that it is a disobedience. What spirit is nobler than Knowledge (العلم), just as Allah said about Himself that He <<أَحَاطَ بِكُلِّ شَيْءٍ عِلْماً>> (encompasses all things in Knowledge).\n\nThe proof of reason (دليل العقل) points to this, and the action is one of the things (الأشياء); He knows it and knows where it is. How could it be lost to Him, or how could He allow it to be lost, when it is a creation (خلق) among His creations that glorifies Him with His praise? If its life comes from the breathing (نفخ) of its Lord, it glorifies Him with His praise. And if its life comes from the presence (حضور) of its agent and originator, whatever the action may be, it glorifies Him with His praise and seeks forgiveness for its agent. This is the distinction (الفرقان) between the two types of action.\n\nIf Allah grants forgiveness to the one who was not present (غير الحاضر), that is merely a Divine consideration (مراعاة إلهية) due to the fact that this servant created a form (صورة) through his existence, and every form must have a spirit (روح). Thus, Allah forgives him because a form manifested through him, into which the Real (الحق) breathed a spirit from Himself, and so it glorified Him with His praise. Due to this shared participation (الاشتراك), forgiveness reaches the owner of that action, whoever he may be, and it reaches him whenever it reaches him.\n\nOmissions (التروك) do not become actions (أعمال) unless they are intended (نويت). If their owner does not intend them, they are not actions. Actions are either manifest or hidden. If a person omits what he was commanded to do, the omission (الترك) is pure non-existence (عدم محض). However, there is a subtle point (دقيقة) here: the action in which he is engaged during the time he omits what Allah obligated him to perform is what constitutes a form (صورة) created by its agent, not the omission itself. The time is dedicated to that omitted action until he repents. This is the most severe and greatest of disobediences.\n\nFor this reason, some of the people of the Exoteric (أهل الظاهر) have held that whoever prays the two cycles (ركعتي) of the Dawn Prayer (Fajr) and does not lie down (يضطجع), his Morning Prayer (Salat al-Subh) is invalid. Conversely, if he did not pray the two cycles of the Dawn Prayer, the lying down is not obligatory upon him, and the Morning Prayer is valid. His utmost fault is that he omitted a confirmed Sunnah (سنة مؤكدة), for the omission of which there is no sin. This is precisely what we have mentioned, and the reasoning (التعليل) is the same.\n\nTherefore, every action commanded as a mandatory duty (الفرض والوجوب) that is omitted—the action that the person performs as a substitute (البدل) for the commanded action is what constitutes the form (صورة), not the omission itself. Understand this.\n\nHowever, if the omitted action occupies a time period by itself, such that no other action is valid during that time, and that time is absolute (مطلقا) and not restricted (مقيدا), and the action is one where the agent is forbidden from engaging in another action, such as the Prayer (الصلاة)—if it is not like this, then whatever good deed he performs is acceptable, because he performed it during a time when he was permitted to perform it.\n\nThe most excellent action (أحسن العمل) is that which is performed according to its condition (بشرطه), in its proper time (في زمانه), with the perfection of its creation (تمام خلقه), and the completeness of its degree (كمال رتبته) in its state (حاله). At that point, it becomes a created form (صورة مخلوقة). Understand this and act accordingly, for you will benefit from it, if Allah wills.",
    "ur": "چار سو اکیاسیواں باب اس قطب کے حال کے بارے میں جس کا مقام یہ ہے: \"بیشک اللہ نیک عمل کرنے والوں کا اجر ضائع نہیں کرتا۔\" (قرآن ۱۸:۳۰)\n\nجو شخص اپنے اعمال میں اللہ کا شہود (الشہود) کرتا ہے، ان کی نشو و نما اچھی ہوتی ہے، پس میزان میں ان کا پلڑا بھاری ہوتا ہے۔\nشہود (الشہود) کے ساتھ اس کے لیے ایک خاص اجر ہے، تعریف (المعرفۃ) میں میزان نے اسی کا فیصلہ کیا ہے۔\nبیشک رسول کے لیے ایک اجر ہے جو اس کی رسالت میں اس کی مدد کرتا ہے، اس میں کوئی کمی نہیں ہے۔\nاگر ہستی (الوجود) نہ ہوتی تو ہمارے لیے شہود (الشہود) نہ ہوتا، اور ہستی (الوجود) میں ہمارے لیے نفع اور نقصان ہے۔\nجو کچھ ہم لائے ہیں اسے کوئی نہیں جانتا، سوائے اس علیم کے جو اس معاملے میں حیران ہے۔\n\n[بیشک بندہ جب اپنے عمل میں کوئی عبادت کرتا ہے تو وہ اپنے رب کو اس علم کے مطابق دیکھتا ہے جو اس نے اس عبادت میں حاضر کیا]\n\nرسول اللہ صلی اللہ علیہ وسلم نے احسان کے بارے میں فرمایا کہ یہ عبادت میں ذات حق (الحق) کو دیکھنے پر عمل کرنا ہے۔ یہ اپنی امت پر شفیق عالم کی طرف سے ایک عجیب تنبیہ ہے، کیونکہ آپ صلی اللہ علیہ وسلم جانتے تھے کہ جب بندہ اپنے عمل میں عبادت کے لیے کھڑا ہوتا ہے اور اپنے دل میں یہ خیال کرتا ہے کہ وہ اپنے رب کو دیکھ رہا ہے، تو اس کا رب بھی اسے اس علم کے مطابق دیکھتا ہے جو اس نے اس عبادت میں حاضر کیا ہے۔ پس اگر یہ اس کی عادت اور طریقہ بن جائے تو وہ یہ دیکھتا ہے کہ عمل کرنے والا اللہ ہے نہ کہ وہ (بندہ)، اور یہ کہ بندہ اس عمل کے ظہور کا محل ہے۔ جیسا کہ روایت میں آیا ہے کہ اللہ نے اپنے بندے کی زبان پر فرمایا: \"اللہ نے سن لیا جس نے اس کی تعریف کی۔\"\n\nپس عبادت میں احسان، صورت میں روح کی مانند ہے جو اسے زندہ رکھتی ہے۔ اور جب وہ اسے زندہ رکھتی ہے تو وہ اپنے صاحب کے لیے مسلسل استغفار کرتی رہتی ہے اور اس کے لیے بقا (البقاء) دائمی ہوتی ہے، لہٰذا وہ ہمیشہ بخشا ہوا رہتا ہے۔ بیشک اللہ سچا ہے اور اس نے خبر دی ہے کہ: \"وہ نیک عمل کرنے والوں کا اجر ضائع نہیں کرتا۔\" (قرآن ۱۸:۳۰) بلکہ وہ تم میں سے کسی عمل کرنے والے کے عمل کو ضائع نہیں کرتا، خواہ وہ مرد ہو یا عورت، تم ایک دوسرے سے ہو۔ (قرآن ۳:۱۹۵) عمل جیسا بھی ہو، اگر وہ خیر ہے تو اس کا اجر ضائع نہیں ہوتا، اور اگر وہ خیر نہیں ہے تب بھی اللہ اسے ضائع نہیں کرتا، کیونکہ اللہ توبہ کرنے والے کی برائیوں کو نیکیوں سے بدل دیتا ہے۔ اگر عمل ضائع ہونے والا نہ ہو تو پھر کس چیز میں تبدیلی واقع ہوگی؟ کیونکہ اعمال وہ صورتیں ہیں جنہیں عامل نے ایجاد کیا ہے، نہیں بلکہ اللہ نے ایجاد کیا ہے، کیونکہ وہی عامل ہے اور بندہ اس عمل کے ظہور کا محل ہے، جیسے ہیولیٰ (مادہ اولیٰ) جو اپنے اندر صورتوں کے کھلنے کو قبول کرتا ہے۔\n\nپھر اللہ تعالیٰ کے ساتھ حاضر رہنا، جو کہ اس عمل میں احسان ہے، اس عمل کی زندگی ہے۔ اور اسی کی وجہ سے اسے عبادت کہا جاتا ہے۔ اگر یہ حضور نہ ہوتا تو وہ عبادت نہ ہوتی۔ کوئی بھی مومن ایسا نہیں جو نافرمانی کرے مگر اس کے دل میں معصیت کی ذلت موجود ہوتی ہے، لہٰذا یہ (ذلت کا احساس) عبادت بن جاتا ہے، اگرچہ صرف اس کا یہ علم ہی ہو کہ یہ نافرمانی ہے۔ اور علم سے زیادہ اشرف کون سی روح ہو سکتی ہے؟ جیسا کہ اللہ نے اپنے بارے میں فرمایا: \"بیشک اس نے ہر چیز کو علم سے گھیر رکھا ہے۔\" (قرآن ۶۵:۱۲) اور عقل کی دلیل نے اس پر دلالت کی ہے، اور عمل بھی اشیاء میں سے ہے، اور وہ اسے جانتا ہے اور جانتا ہے کہ وہ کہاں ہے۔ تو وہ اس سے کیسے ضائع ہو سکتا ہے یا وہ اسے کیسے ضائع کر سکتا ہے، حالانکہ وہ اس کی مخلوق میں سے ہے جو اس کی حمد کے ساتھ تسبیح کرتی ہے۔ پس اگر اس کی زندگی اس کے رب کے نفخ سے ہے تو وہ اس کی حمد کے ساتھ تسبیح کرتی ہے، اور اگر اس کی زندگی اس کے عامل اور موجد کے حضور سے ہے، اور عمل جیسا بھی ہو، تو وہ اس کی حمد کے ساتھ تسبیح کرتا ہے اور اپنے عامل کے لیے استغفار کرتا ہے۔ پس یہ دونوں اعمال کے درمیان فرقان (امتیاز) ہے۔\n\nپس اگر اللہ غیر حاضر (جس نے احسان کے ساتھ عمل نہیں کیا) کو مغفرت عطا کرتا ہے، تو یہ محض ایک الٰہی رعایت ہے، کیونکہ اس بندے نے اپنے وجود سے ایک صورت ایجاد کی ہے، اور ہر صورت کے لیے روح ضروری ہے۔ پس اللہ اسے اس لیے بخش دیتا ہے کہ اس سے ایک ایسی صورت ظاہر ہوئی جس میں ذات حق (الحق) نے اپنی طرف سے روح پھونکی، پس اس نے اس کی حمد کے ساتھ تسبیح کی۔ لہٰذا، اس اشتراک کی وجہ سے اس عمل کے صاحب کو مغفرت حاصل ہوئی، خواہ وہ کوئی بھی ہو، اور جب بھی اسے حاصل ہوئی (تو اسی سبب سے ہوئی)۔\n\nاور ترک (چھوڑی ہوئی چیزیں) اعمال نہیں بنتے مگر جب ان کی نیت کی جائے، اور جب تک ان کے صاحب نے ان کی نیت نہ کی ہو، وہ عمل نہیں ہیں۔ کیونکہ اعمال میں سے کچھ ظاہری ہوتے ہیں اور کچھ باطنی۔ یا یہ کہ انسان اس چیز کو چھوڑ دے جس کے کرنے کا اسے حکم دیا گیا ہے، تو ترک محض عدم ہے۔ مگر یہاں ایک باریک نکتہ ہے، اور وہ یہ ہے کہ وہ عمل جس میں وہ اس وقت مشغول ہوتا ہے جب وہ اس چیز کو چھوڑتا ہے جسے اللہ نے اس پر فرض کیا تھا، وہ عمل اس کے عامل کی ایجاد کردہ صورت ہوتا ہے، نہ کہ عین ترک۔ کیونکہ وقت تو اس متروک عمل کے لیے ہوتا ہے جب تک کہ وہ توبہ نہ کر لے۔ اور یہ سخت ترین اور عظیم ترین معصیتوں میں سے ہے۔ اسی وجہ سے اہل ظاہر میں سے بعض اس طرف گئے ہیں کہ جس نے فجر کی دو رکعتیں پڑھیں اور (اس کے بعد) نہ لیٹا تو اس کی صبح کی نماز صحیح نہیں ہوگی۔ اور اگر اس نے فجر کی رکعتیں نہیں پڑھیں تو اس پر لیٹنا واجب نہیں تھا اور صبح کی نماز جائز ہو گئی، اور اس کی انتہا یہ ہے کہ اس نے ایک سنت مؤکدہ کو چھوڑا جس کے ترک پر کوئی گناہ نہیں ہے۔ اور یہ بعینہ وہی ہے جو ہم نے ذکر کیا، اور دلیل ایک ہی ہے۔\n\nپس ہر وہ عمل جس کا فرض یا وجوب کے طور پر حکم دیا گیا ہو اور اسے ترک کر دیا جائے، تو وہ عمل جس میں انسان مامور بہ عمل کے بدلے میں کھڑا ہوتا ہے، وہ ایک صورت کے طور پر قائم ہوتا ہے نہ کہ عین ترک۔ پس اسے سمجھو۔ لیکن اگر متروک عمل بذات خود ایک ایسا وقت گھیرتا ہو جس میں اس کے سوا کوئی دوسرا عمل صحیح نہ ہو، اور وہ مطلق ہو، مقید وقت نہ ہو، اور وہ عمل ایسا ہو کہ عامل پر اس کے علاوہ کسی دوسرے عمل میں تصرف حرام ہو، جیسے نماز۔ تو اگر ایسا نہ ہو، تو اس نے جو بھی عمل کیا وہ مقبول ہے، میرا مطلب ہے نیک اعمال میں سے، کیونکہ اس نے اسے ایسے وقت میں کیا جس میں اسے وہ عمل کرنے کی اجازت تھی۔ پس بہترین عمل وہ ہے جو اپنی شرط کے مطابق، اپنے وقت میں، اپنی تخلیق کی تکمیل کے ساتھ، اور اپنے حال میں اپنے مرتبے کے کمال کے ساتھ کیا جائے۔ تب وہ ایک مخلوق صورت بنتا ہے۔ پس اس بات کو سمجھو اور اس کے مطابق عمل کرو، بیشک تم اس سے فائدہ اٹھاؤ گے، ان شاء اللہ۔",
    "fa": "باب چهارصد و هشتاد و یکم در بیان حال قطبی که منزل او این آیه بود: «إِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا» (همانا خداوند پاداش نیکوکاران را ضایع نمی‌کند).\n\nهر کس خدا را در اعمالش شهود (الشهود) کند،\nسرشت آن اعمال نیکو می‌شود و در سنجش (وزن) برتری می‌یابد.\n\nهمراه با شهود (الشهود) برای او پاداشی است که به آن اختصاص دارد؛\nمیزان (معیار) در تعریف، چنین حکم کرده است.\n\nرسول (پیامبر) را پاداشی است که رسالتش آن را تعیین می‌کند\nو در آن نقصی نیست.\n\nاگر هستی (الوجود) نبود، شهود (الشهود) برای ما میسر نمی‌شد؛\nو در هستی (الوجود) برای ما سود و زیان است.\n\nآنچه ما آورده‌ایم را کسی نمی‌داند،\nمگر دانایی که در این امر حیران است.\n\n[همانا بنده چون در عمل خود عبادتی انجام دهد، پروردگارش را به اندازه‌ی علمی که در آن عبادت حاضر کرده است، می‌بیند.]\n\nرسول خدا (صلی الله علیه و سلم) درباره‌ی احسان (الإحسان) فرمودند که آن، عمل کردن بر اساس رؤیت حق (الحق) در عبادت است. این تنبیهی شگفت‌انگیز از سوی عالمی دلسوز نسبت به امت خویش است، زیرا او می‌دانست که اگر بنده در عمل خود به عبادت برخیزد و در درون خود قرار دهد که پروردگارش را می‌بیند، و پروردگارش نیز او را به اندازه‌ی علمی که در آن عبادت حاضر کرده است، می‌بیند؛ در این صورت، اگر این روش و عادت او باشد، درمی‌یابد که عامل حقیقی، خداست نه او، و بنده تنها محل ظهور آن عمل است. چنانکه وارد شده است که خداوند بر زبان بنده‌اش فرمود: «سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ» (خداوند سخن کسی را که او را ستایش کند، می‌شنود). احسان (الإحسان) در عبادت، مانند روح در کالبد است که به آن حیات می‌بخشد. و چون به آن حیات بخشد، پیوسته برای صاحبش استغفار می‌کند و بقای (البقاء) دائمی دارد. پس آن شخص همواره آمرزیده است، زیرا خداوند راستگوست و خبر داده است که «لَا يُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا» (پاداش نیکوکاران را ضایع نمی‌کند)، بلکه «لَا يُضِيعُ عَمَلَ عَامِلٍ مِنْكُمْ مِنْ ذَكَرٍ أَوْ أُنْثى‏ بَعْضُكُمْ مِنْ بَعْضٍ» (عمل هیچ عمل‌کننده‌ای از شما، چه مرد و چه زن، که همگی از یکدیگرید، را ضایع نمی‌کند). عمل هر چه باشد، اگر خیر باشد، پاداشش ضایع نمی‌شود؛ و اگر خیر نباشد، باز هم خداوند آن را ضایع نمی‌کند، زیرا ناگزیر است که خداوند بدی‌های توبه‌کننده را به نیکی‌ها تبدیل کند. اگر عمل ضایع نشود، پس تبدیل (سیئات به حسنات) در کدام امر واقع می‌شود؟ زیرا اعمال، صورت‌هایی هستند که عامل آن‌ها را ایجاد کرده است، نه، بلکه خدا آن‌ها را ایجاد کرده است، زیرا او عامل است و بنده محل ظهور آن عمل است، مانند هیولی (الهيولى) برای آنچه از گشودن صورت‌ها در آن می‌پذیرد.\n\nسپس، حضور با خدای تعالی که همان احسان (الإحسان) در آن عمل است، حیات آن عمل است و به واسطه‌ی آن، عمل، عبادت نامیده می‌شود. اگر این حضور نبود، آن عمل عبادت محسوب نمی‌شد. هیچ مؤمنی نیست که مرتکب معصیت شود، مگر اینکه در درونش خواری آن معصیت وجود دارد؛ به همین دلیل، آن عمل (حتی معصیت) به عبادت تبدیل می‌شود، حتی اگر تنها علم او به اینکه آن عمل معصیت است، وجود داشته باشد. و چه روحی شریف‌تر از علم است؟ چنانکه خداوند درباره‌ی خود فرمود: «أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً» (علم او همه چیز را در بر گرفته است). دلیل عقل و عمل نیز بر این دلالت دارد، زیرا اشیاء وجود دارند و او آن‌ها را می‌داند و می‌داند که کجا هستند. پس چگونه ممکن است چیزی از او ضایع شود یا او آن را ضایع کند، در حالی که آن مخلوقی از مخلوقات اوست که به حمد او تسبیح می‌گوید؟ اگر حیات آن عمل از نفخ پروردگارش باشد، به حمد او تسبیح می‌گوید؛ و اگر حیات آن از حضور عامل و ایجادکننده‌اش باشد، و عمل هر چه باشد، به حمد او تسبیح می‌گوید و برای عاملش استغفار می‌کند. این است فرقان (تمایز) میان دو نوع عمل. اگر خداوند مغفرت را به غیر حاضر (کسی که حضور قلبی ندارد) عطا کند، این تنها مراعاتی الهی است به این دلیل که این بنده با هستی (الوجود) خود صورتی را ایجاد کرده است، و هر صورتی ناگزیر از روح است. پس خداوند او را می‌آمرزد به این دلیل که صورتی از او ظاهر شده که حق (الحق) روحی از خود در آن دمیده است، و آن صورت به حمد او تسبیح گفته است. به واسطه‌ی این اشتراک است که مغفرت شامل صاحب آن عمل می‌شود، هر که باشد و هر زمان که شامل حال او شود.\n\nو ترک‌ها (تروک) عمل محسوب نمی‌شوند مگر آنکه نیت شوند. و تا زمانی که صاحبشان آن‌ها را نیت نکرده باشد، عمل نیستند. زیرا اعمال برخی ظاهری و برخی باطنی هستند. یا اینکه انسان آنچه را که به انجامش امر شده، ترک کند. ترک، عدم محض است، مگر اینکه در اینجا نکته‌ی ظریفی وجود دارد: و آن این است که عملی که انسان در زمان ترک آنچه خداوند بر او واجب کرده است، انجام می‌دهد، همان است که صورتی از ایجاد عامل است، نه عین ترک. زیرا زمان تنها برای آن عمل متروک است تا زمانی که توبه کند. و این سخت‌ترین و بزرگترین معاصی است. به همین دلیل، برخی از اهل ظاهر بر این عقیده‌اند که هر کس دو رکعت نماز فجر را بخواند و نخوابد (اضطجاع نکند)، نماز صبحش صحیح نیست؛ و اگر نماز فجر را نخواند، اضطجاع بر او واجب نیست و نماز صبحش جایز است. نهایت امر این است که او سنتی مؤکد را ترک کرده که در ترک آن گناهی بر او نیست. و این عین همان چیزی است که ما ذکر کردیم و تعلیل (دلیل) یکی است. پس هر عملی که به طریق فرض و وجوب به آن امر شده و ترک شود، عملی که انسان به جای آن عمل مأمور به انجام می‌دهد، همان است که صورت می‌گیرد، نه عین ترک. پس این را بفهم.\n\nاما اگر عمل متروک، زمانی را به ذات خود اشغال کند که در آن زمان غیر آن عمل صحیح نباشد، و آن زمان مطلق باشد نه مقید، و عمل از کسی صادر شود که تصرف در عمل غیر برای او حرام است، مانند نماز؛ اگر چنین نباشد، هر عملی که انجام دهد، مقبول است، منظورم از اعمال خیر است، زیرا آن را در زمانی انجام داده که انجام آن برایش جایز بوده است. پس بهترین عمل آن است که با شرط خود، در زمان خود، با تمام خلقتش و کمال مرتبه‌اش در حال خود انجام شود. در این صورت، آن عمل صورتی مخلوق خواهد بود. پس این را بفهم و بر اساس آن عمل کن، که ان‌شاءالله از آن بهره‌مند خواهی شد."
  },
  "page_count": 2
}