{
  "id": 365,
  "title": {
    "ar": "الباب الخامس والستون وثلاثمائة في معرفة منزل أسرار اتصلت في حضرة الرحمة بمن خفي مقامه وحاله على الأكوان وهو من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Sixty-Five: Concerning the Gnosis of the Station of Secrets (منزل أسرار) that connected within the Divine Presence of Mercy (حضرة الرحمة) with him whose spiritual Station (مقامه) and State (حاله) are concealed from the Cosmos (الأكوان), and who belongs to the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو پینسٹھ: اسرار کے اس منزل کی معرفت میں جو حضرۃ الرحمۃ (حضرۃ الرحمۃ) میں اس ذات سے متصل ہوئے جس کا مقام اور حال اکوان پر مخفی ہے، اور وہ حضرۃ محمدیہ (الحضرۃ المحمدیۃ) سے ہے۔",
    "fa": "باب سیصد و شصت و پنجم در معرفت منزل اسراری که در حضرت رحمت به کسی پیوسته است که مقام و حالش بر اکوان پنهان است و او از حضرت محمدیه است."
  },
  "content": {
    "ar": "## «الباب الخامس والستون وثلاثمائة في معرفة منزل أسرار اتصلت في حضرة الرحمة بمن خفي مقامه وحاله على الأكوان وهو من الحضرة المحمدية»\n\n\n> مرتبة الخمسة معروفة *** تحفظ ما جاوزها من عدد\n\n\n> تحفظ ذكر الله من رحمة *** قامت بها ليس لها مستند\n\n\n> سوى الذي يحفظ أعياننا *** وهو الإله المتعالي الصمد\n\n\n> جميع ما في الكون من خلقه *** له إذا يدعوه عبدي سجد\n\n\n> لولاه لم نوجد بأعياننا *** مع كونه سبحانه لم يلد\n\n\n> فهو مع الكثرة في حكمه *** لم تنتف عنه صفات الأحد\n\n\n> لو لا وجود الكثر في حكمه *** لما بدا منه وجود العدد\n\n\n> فهو وحيد العين في ملكه *** وحكمه في كونه مستند\n\n\n> لما حملناه على كوننا *** من نفسنا من فضله ما عبد\n\n\n> عز فما يدركه غيره *** وجل أن يبقى بحكم المدد\n\n\n> سبحانه من ملك قاهر *** قد قهر الكل وأهل العدد\n\n\n> ليس على غير من أكوانه *** لكل من يعرفه معتمد\n\n\n> من أزل صح له حكمنا *** كذاك أيضا حكمه في الأبد\n\n\n### [إن الظاهر والباطن اقتضى أن يكون الأمر الوجودي بالنسبة إلينا بين جلي وخفي‏]\n\n\nاعلم أيدنا الله وإياك بروح منه أن الله لما سمي نفسه بالظاهر والباطن اقتضى ذلك أن يكون الأمر الوجودي بالنسبة إلينا بين جلي وخفي فما جلاه لنا فهو الجلي وما ستره عنا فهو الخفي وكل ذلك له تعالى جلي‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في دعائه اللهم إني أسألك بكل اسم سميت به نفسك أو علمته أحدا من خلقك‏\n\n\nوهو الجلي عند من علمه الله إياه والخفي عمن لم يعلمه‏\n\n\nثم قال أو استأثرت به في علم غيبك‏\n\n\nفهذا خفي عما سوى الله فلا يعلمه إلا الله فإنه تعالى يَعْلَمُ السِّرَّ وهو ما بينه وبين خلقه وأَخْفى‏ وهو ما لا يعلمه إلا هو مثل مفاتح الغيب التي عنده لا يَعْلَمُها إِلَّا هُوَ فهو عالِمُ الْغَيْبِ وهو الخفي والشَّهادَةِ وهو الجلي وما أوجده من الممكنات وهو الجلي أيضا وما لم يوجده منها وهو الخفي أيضا ولا يخلو العالم من هاتين النسبتين دنيا ولا آخرة فالمزيد الواقع من العالم في العالم فهو من الخفي والمزيد لا يزال فالعالم مزيد خارج من الخفاء إلى الجلاء لا يزال فالجلي من سؤال السائلين إنما يسمعه الحق من الاسم الظاهر والخفي منه يسمعه من الاسم الباطن فإذا أعطاه ما سأل فالاسم الباطن يعطيه للظاهر والظاهر يعطيه للسائل فالظاهر حاجب الباطن والجلي حاجب الخفي كما إن الشعور حاجب العلم واعلم أن الله عز وجل يعامل عباده بما يعاملونه به فكأنه تعالى بحكم التبعية لهم وإن كان ابتداء الأمر منه ولكن هكذا علمنا وقرر لدينا فإنا لا ننسب إليه إلا ما نسبه إلى نفسه ولا يتمكن لنا إلا ذلك فمن حكم تبعية الحق تعالى للمخلوق قوله تعالى قُلْ إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله وقوله صَلَّى اللهُ عَليهِ وسَلَّم في الصحيح إن الله لا يمل حتى تملوا\n\n\nوقوله تعالى فَاذْكُرُونِي أَذْكُرْكُمْ وقوله سبحانه من ذكرني في نفسه ذكرته في نفسي ومن ذكرني في ملأ ذكرته في ملأ خير منه‏\n\n\n> فلا يكون العبد في حالة *** إلا يكون الحق في مثلها\n> وكلها منه ولكنه *** كذا أتانا الحكم في شكلها\n\n\nفكل مخالف أمر الحق فإنه يستدعي بهذه المخالفة من الحق مخالفة غرضه ولذلك لا يكون العفو والتجاوز والمغفرة من الحق جزاء لمخالفة العبد في بعض العبيد وإنما يكون ذلك امتنانا من الله عليه فإن كان جزاء فهو جزاء لمن عفا عن عبد مثله وتجاوز وغفر لمن أساء إليه في دنياه فقام له الحق في تلك الصفة من العفو والصفح والتجاوز والمغفرة مثلا بمثل يدا بيدها وها\n\n\nورد في الخبر الصحيح عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ما كان الله لينهاكم عن الربا ويأخذه منكم‏\n\n\nفما نهى الله عباده عن شي‏ء إلا كان منه أبعد ولا أمركم بكريم خلق إلا كان الحق به أحق‏\n\n\n### [منزل الميراث المعنوي هو منزل الشريعة]\n\n\nواعلم أن هذا المنزل هو منزل الميراث المعنوي وهو منزل الشريعة وكون الحياة شرطا في جميع وجود النسب المنسوبة إلى الله وهذه النسبة أوجبت له سبحانه أن يكون له اسمه الحي فجميع الأسماء الإلهية موقوفة عليه ومشروطة به حتى الاسم الله فالاسم الله هو المهيمن على جميع الأسماء التي من جملتها الحي ونسبة الاسم الحي لها المهيمنية على جميع النسب الأسمائية حتى نسبة الألوهة التي بها تسمى الله الله‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم العلماء ورثة الأنبياء وما ورثوا دينارا ولا درهما وإنما ورثوا العلم فمن أخذ منه أخذ بحظ وافر\n\n\nوقال نحن معاشر الأنبياء لا نرث ولا نورث ما تركنا صدقة\n\n\nيعني الورث أي ما يورث من الميت من المال فلم يبق الميراث إلا في العلم والحال والعبارة عما وجدوه من الله في كشفهم وأهل النظر في نظرهم وهؤلاء هم العلماء الذين يخشون الله لعلمهم بأنه يعلم حركاتهم وسكناتهم على التعيين والتفصيل فإنه الَّذِي يَراكَ حِينَ تَقُومُ وتَقَلُّبَكَ في السَّاجِدِينَ وفي جميع أحوالك فأبان صَلَّى اللهُ عَليهِ وسَلَّم إن الأنبياء لهم التقدم فإنهم لا يورثون حتى ينقلبوا إلى الله من هذه الدار فكل ما يناله المتبع لنبي خاص في حياته فإنه إنعام من ذلك النبي لا ميراث وكل ما ناله من نبي قد مات فذلك علم موروث فكل وارث علم في زمان فإنما يرث من تقدمه من الأنبياء عليه السلام لا من تأخر عنه فوراثة عالم كل أمة كانت لنبي قبل رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فوراثة جزئية وهذه الأمة المحمدية لما كان نبيها محمد صَلَّى اللهُ عَليهِ وسَلَّم آخر الأنبياء وكانت أمته خير الأمم صح للوارث منهم أن يرثه ويرث جميع الأنبياء عليه السلام ولا يكون هذا أبدا في عالم أمة متقدمة قبل هذه الأمة فلهذا كانت أفضل أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ لأنها زادت على الوارثين بأمر لم ينله إلا هذه الأمة فكل وارث نبي فعلمه من فيض نور من ورثه من الله ونظره سبحانه إلى أنبيائه أتم النظر فعلم الورثة أتم العلوم وكل علم لا يكون عن ورث فإنه ليس بعلم اختصاص كعلم أصحاب الفترات فإن علمهم ليس بعلم وراثة وإن كانوا علماء ولكنهم لم يكونوا متبعين لنبي لأنه لم يبعث إليهم وليسوا بأنبياء فما كان لهم من الله نظرة الأنبياء فنزلوا عن درجة الورثة في العلم وعلموا إن لله أنبياء وأما الذين لا يقرون بالأنبياء ولا بالنبوة على ما هي عليه في نفسها ويرون أن مسمى الأنبياء إنما هو لمن صفى جوهرة نفسه من كدورات الشهوات الطبيعية والتزم مكارم الأخلاق العرفية وإنه إذا كان بهذه المثابة انتقش في نفسه ما في العالم العلوي من الصور بالقوة فنطق بعلم الغيوب وليست النبوة عندنا ولا هي في نفسها كذلك ولا بد وقد تكون في بعض الأشخاص على ما قالوه ولكن مع جواز ما ذكروه من نقش ما في العالم من الصور بالقوة في نفس هذا الشخص مما وقع في الوجود ولا يقع في جزئيات الأمور فإن الذي في حركات الأفلاك وسباحة الكواكب وفي السموات من العلوم التي تكون من آثارها لا علم لها بذلك من كوكب وسماء وفلك وملك فيعرف هذا الشخص منها ما لا تعرف من نفسها وما ذكر عن أحد من نبي ولا حكيم أنه أحاط علما بما يحوي عليه حاله في كل نفس نفس إلى حين موته بل يعلم بعضا ولا يعلم بعضا مع علمنا إن الله عز وجل أَوْحى‏ في كُلِّ سَماءٍ أَمْرَها وأن الله قد أودع اللوح المحفوظ علمه في خلقه بما يكون منهم إلى يوم القيامة ولو سئل اللوح ما فيك أو ما خط القلم فيك من علم الله عز وجل ما علم فإن الله أودع ذلك كله في نظره لمن هو دونه ولا يعلم ما يكون عن ذلك النظر من الأثر إلا الله فإن الأثر ما بظهر عن النظر بل عن استعداد القابل ولهذا قال وما أَمْرُنا إِلَّا واحِدَةٌ كَلَمْحٍ بِالْبَصَرِ فانظر في لمحة البصر الواحد ما تدرك من المنظورات وهذا الأمر وإن كان واحدة فإنه بالوجود مختلف لاختلاف القوابل في الاستعداد فلا يعلم الأمور على التفصيل إلا الله وحده ولا يُحِيطُونَ بِشَيْ‏ءٍ من عِلْمِهِ إِلَّا بِما شاءَ وكل صاحب مجاهدة وخلوة وتصفية نفس على غير شريعة ولا مؤمن بها على ما هي عليه في‏\nنفسها فإن العلم الذي يكون عليه ويجده عند هذا الاستعداد ليس بعلم ميراث ولا للحق إليه نظر نبوي بل غايته إن يتلقى من الأرواح الملكية بقدر ما هو عليه من المناسبة ومن الله على قدر ما أعطاه نظره الفكري لأنه لا كشف له البتة من الله لأن ذلك من خصائص الأنبياء عليه السلام ومتبعيهم لا من قال بهم ولم يتبع واحدا منهم على التعيين من أصحاب التعريف ولا عمل عملا في زمان الفترة لقول نبي وإن وافق بعمله عمل نبي لكنه غير مقصود\n\n\nله الاتباع فإن الإلقاء إليه دون الإلقاء إلى الوارث العامل على ذلك لقول ذلك النبي وبين العلمين بون عظيم وتمييز ذوقي مشهود جعلنا الله وإياكم من الوارثين وكل من أظهر اعتقاد النبوة وصرف ما جاءت به من الأحكام الظاهرة إلى معان نفسية لم تكن من قصد النبي بما ظهر عنه ما اعتقدته العامة من ذلك فإنه لا يحصل على طائل من العلم ومن اعتقد فيما جاء به هذا النبي أنه في الظاهر والعموم على ما هو عليه حق كله وله زيادة مصرف آخر مع ثبوت هذه المعاني فجمع بين الحس والمعنى في نظره فذلك الوارث العالم الذي شاهد الحق على ما هو عليه وهذا لا يحصل إلا بالتعمل وليس معنى التعمل أن يقول هذا الذي ليس له هذا الاعتقاد ثم يسمع به مني أو من غيري فيقول أنا أعتقده وأربط نفسي به فإن كان ما قاله حقا فإنا له وإن لم يكن فما يضرني فمثل هذا لا ينفعه ولا يفتج له فيه لأنه غير مصدق به على القطع بل هو صاحب تجربة وأين الايمان من الشك والتجربة فهذا أعمى البصيرة ناقص النظر فإنه لو صح منه النظر الفكري في الأدلة لعثر على وجه الدلالة فانقدح له المطلوب وأسفر له عن الأمر على ما هو عليه كما أسفر لغيره ممن وفى النظر حقه فإنه إذا وفى الناظر نظره حقه لزمه الايمان ملازمة الظل للشخص لأنهما مزدوجان فإنه يطلع بعين الدليل على رتبة هذا المسمى بالنبي والشارع عند الله فمن المحال أن يشهده ذوقا ولا يتبعه حالا هذا ما لا يتصور ولقد آمنا بالله وبرسوله وما جاء به مجملا ومفصلا مما وصل إلينا من تفصيله وما لم يصل إلينا أو لم يثبت عندنا فنحن مؤمنون بكل ما جاء به في نفس الأمر أخذت ذلك عن أبوي أخذ تقليد ولم يخطر لي ما حكم النظر العقلي فيه من جواز وإحالة ووجوب فعملت على إيماني بذلك حتى علمت من أين آمنت وبما ذا آمنت وكشف الله عن بصري وبصيرتي وخيالي فرأيت بعين البصر ما لا يدرك إلا به ورأيت بعين الخيال ما لا يدرك إلا به ورأيت بعين البصيرة ما لا يدرك إلا بها فصار الأمر لي مشهودا والحكم المتخيل المتوهم بالتقليد موجودا فعلمت قدر من اتبعته وهو الرسول المبعوث إلى محمد صَلَّى اللهُ عَليهِ وسَلَّم وشاهدت جميع الأنبياء كلهم من آدم إلى محمد عليه السلام وأشهدني الله تعالى المؤمنين بهم كلهم حتى ما بقي منهم من أحد ممن كان ويكون إلى يوم القيامة خاصهم وعامهم ورأيت مراتب الجماعة كلها فعلمت أقدارهم واطلعت على جميع ما آمنت به مجملا مما هو في العالم العلوي وشهدت ذلك كله فما زحزحني علم ما رأيته وعاينته عن إيماني فلم أزل أقول وأعمل ما أقوله وأعمله لقول النبي صَلَّى اللهُ عَليهِ وسَلَّم لا لعلمي ولا لعيني ولا لشهودي فواخيت بين الايمان والعيان وهذا عزيز الوجود في الاتباع فإن مزلة الاقدام للأكابر إنما تكون هنا إذا وقعت المعاينة لما وقع به الايمان فتعمل على عين لا على إيمان فلم يجمع بينهما ففاته من الكمال أن يعرف قدره ومنزلته فهو وإن كان من أهل الكشف فما كشف الله له عن قدره ومنزلته فجهل نفسه فعمل على المشاهدة والكامل من عمل على الايمان مع ذوق العيان وما انتقل ولا أثر فيه العيان وما رأيت لهذا المقام ذائقا بالحال وإن كنت اعلم أن له رجالا في العالم لكن ما جمع الله بيني وبينهم في رؤية أعيانهم وأشخاصهم وأسمائهم فقد يمكن أن أكون رأيت منهم وما جمعت بين عينه واسمه وكان سبب ذلك أني ما علقت نفسي قط إلى جانب الحق أن يطلعني على كون من الأكوان ولا حادثة من الحوادث وإنما علقت نفسي مع الله أن يستعملني فيما يرضيه ولا يستعملني فيما يباعدني عنه وأن يخصني بمقام لا يكون لمتبع أعلى منه ولو أشركني فيه جميع من في العالم لم أتأثر لذلك فإني عبد محض لا أطلب التفوق على عباده بل جعل الله في نفسي من الفرح أني أتمني أن يكون العالم كله على قدم واحدة في أعلى المراتب فخصني الله بخاتمة أمر لم يخطر لي ببال فشكرت الله تعالى بالعجز عن شكره مع توفيتي في الشكر حقه وما ذكرت ما ذكرته من حالي للفخر لا والله وإنما ذكرته لأمرين الأمر الواحد لقوله تعالى وأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ وأية نعمة أعظم من هذه والأمر الآخر ليسمع صاحب همة فتحدث فيه همة لاستعمال نفسه فيما استعملتها فينال مثل هذا فيكون معي وفي درجتي فإنه‏\nلا ضيق ولا حرج إلا في المحسوس والألوهية خاصة ولهذا لا يتعلق حكم الغيرة إلا بهذين المقامين فأما المحسوس فلحصره فإنه إذا كان عندك لم يكن عين ما هو عندك عند غيرك وأما في الألوهية فإن المدعي فيها كاذب ومن هي له صادق فمتعلق الغيرة كون من ليست فيه الألوهية ويدعيها كاذبا فالغيرة على المقام فإنها لا تكون إلا لواحد ليس لغيره فيها قدم والغيرة مشتقة من الغير فهذا قد أبنت لك عن سواء السبيل‏\n\n\n### [أن أطيب ما يورث من العلم ما يرثه العالم‏]\n\n\nواعلم أن أطيب ما يورث من العلم ما يرثه العالم من الأسماء الإلهية فإن قلت وكيف تورث الأسماء الإلهية ولا يكون الورث إلا بعد موت قلنا وكذلك أقول فاعلم أني أريد بهذا النوع من العلم كون الحق سبحانه قادرا على إن يفعل ابتداء ما لا يفعله ولا وقع إلا منك كما قد بينا إنك آلة له تعالى فلما كان منك ولا بد ما يمكن أن يكون له دونك ومن المحال أن يكون لما هو منك كونان فإن الكائن لا يقبل كونين بل هو وجود واحد فينزل هذا القدر من الكون الظاهر منك مما كان له منزلة المال الموروث ممن كان له إذ يستحيل أن يكون له مع موته كما استحال أن يكون هذا الكائن عن غير من كان عنه فتحقق هذه النكتة فإنها عجيبة في أصحاب الأذواق لا في أحكام العقل‏\n\n\n### [الاسم الإلهي الحي‏]\n\n\nواعلم أنه لما لم يتمكن أن يتقدم الاسم الحي الإلهي اسم من الأسماء الإلهية كانت له رتبة السبق فهو المنعوت على الحقيقة بالأول فكل حي في العالم وما في العالم إلا حي فهو فرع عن هذا الأصل وكما لا يشبه الفرع الأصل بما يحمله من الثمر وما يظهر منه من تصريف الأهواء له على اختلافها عليه وما يقبل من حال التعرية واللباس إذا أورق وتجرد عن ورقه والأصل ليس كذلك بل هو الممد له بكل ما يظهر فيه وبه إذ ليس له بقاء في فرعيته وأحكامها إلا بالأصل كذلك الاسم الحي مع سائر الأسماء الإلهية فكل اسم هو له إذا حققت الأمر فيسري سره في جميع العالم فخرج على صورته فيما نسب إليه من التسبيح بحمده والتسبيح تنزيه والتنزيه تعرية وكذلك الأصل معرى عن ملابس الفروع وزينتها من ورق وثمر وكل ذلك منه وهو منزه في ذاته عن أن تقوم به فقد أعطى ما لا يقوم به ولا يكون صفة له وهذا علم لا يمكن أن يحصل إلا لصاحب كشف وإذا حصل له لا يمكن أن يقسم العالم إلى حي وإلى غير حي بل هو عنده كله حي ولكن تنسب عندنا الحياة لكل حي بحسب حقيقة المنعوت بها المسمى عند أهل الكشف والشهود لا عند من لا يرى الحياة إلا في غير الجماد والنامي في نظره ليس كلامنا إلا مع أهل الكشف الذين أشهدهم الله الأمر على ما هو عليه في نفسه فاعلم ذلك واعلم أنه لما كان الاسم الحي اسما ذاتيا للحق سبحانه لم يتمكن أن يصدر عنه إلا حي فالعالم كله حي إذ عدم الحياة أو وجود موجود من العالم غير حي لم يكن له مستند إلهي في وجوده البتة ولا بد لكل حادث من مستند فالجماد في نظرك هو حي في نفس الأمر وأما الموت فهو مفارقة حي مدبر لحي مدبر فالمدبر والمدبر حي والمفارقة نسبة عدمية لا وجودية إنما هو عزل عن ولاية ثم إنه ما من شرط الحي أن يحس فإن الإحساس والحواس أمر معقول زائد على كونه حيا وإنما من شرطه العلم وقد يحس وقد لا يحس ولو أحس فليس من شرط الإحساس وجود الآلام واللذات فإن العلم يغني عن ذلك مع كون العالم لا يحس بما جرت العادة أنه لا يدرك إلا بالحس وأنت تعلم وجميع العقلاء أن الله عالم بكل شي‏ء مع تنزيهه عن الإحساس والحواس فلحصول العلم طرق كثيرة عند من يستفيد علما والحس طريق موصلة إلى العلم بالمحسوس فقد يوصل إلى العلم به من غير طريق الحس فيكون معلوما في الحالتين لكنه لا يكون محسوسا لمن علمه من غير طريق الحس لكنه هو له مشهود ومعلوم كما لا نشك أنا نرى ربنا بالأبصار عيانا على ما يليق بجلاله وهو مرئي لنا ولا نقول فيه إنه محسوس لما يطلبه الحس من الحصر والتقييد فهذه رؤية غير مكيفة وكلامنا في هذا مع من يقول بالرؤية بالبصر ولا نقول بالكيف ولا الحصر والتقييد بل نراه منزها كما علمناه منزها وقد قدمنا في غير موضع من هذا الكتاب تصويب كل اعتقاد وصحة كل مقالة عقلية في الله وأما المقالات الشرعية المنزلة من الله فيه فالإيمان بها واجب وما جاءت لتخالف العقل فإنها قد جاءت بموافقة العقل في لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وقد جاءت بما لا يقبله دليل العقل من حيث نظره فزاد علما به لم يكن ليستقل به قبله بإيمانه إن كان عن خبر أو بذوقه إن كان عن شهود وسلمنا له ما وصف به نفسه من كل ما لا يستقل به العقل من حيث انفراده بذلك في نظره لكوننا لا نحيط علما بذاته لا بل لا نعلمها رأسا ولما كانت الأعيان في الوجود لها اتصال بعضها ببعض ولها انفصال بعضها عن بعض جعل‏\nالله ذلك علامة لمن لا كشف له على إن للعالم بالله اتصالا معنويا من وجه وفصلا من وجه فهو من حقيقة ذاته وألوهته وفاعليته متصل منفصل من وجه واحد ذلك الوجه عينه لأنه لا يتكثر وإن كثرت أحكامه وأسماؤه ومعقولات أسمائه فاتصاله خلقه إيانا بيديه ما مَنَعَكَ أَنْ تَسْجُدَ لِما خَلَقْتُ بِيَدَيَّ خَلَقْنا لَهُمْ مِمَّا عَمِلَتْ أَيْدِينا أَنْعاماً فَهُمْ لَها مالِكُونَ وانفصاله انفصال ألوهة من عبودة لا إِلهَ إِلَّا هُوَ الْعَزِيزُ بانفصاله الْحَكِيمُ باتصاله ولكن لا يكون التكوين من العالم إلا باتصاله لا بانفصاله والعالم يكون ما كلفه الله به من العبادات ولهذا أضاف أعمالها إلى العبد وأمره أن يطلب الإعانة من الله في ذلك كما أنه آلة للحق في بعض الأفعال والآلات معينة للصانع فيما لا يصنع إلا بآلة والعالم منفصل عن الحق بحده وحقيقته فهو منفصل متصل من عين واحدة فإنه لا يتكثر في عينه وإن تكثرت أحكامه فإنها نسب وإضافات عدمية معلومة فخرج على صورة حق فما صدر عن الواحد إلا واحد وهو عين الممكن وما صدرت الكثرة أعني أحكامه إلا من الكثرة وهي الأحكام المنسوبة إلى الحق المعبر عنها بالأسماء والصفات فمن نظر العالم من حيث عينه قال بأحديته ومن نظره من حيث أحكامه ونسبه قال بالكثرة في عين واحدة وكذلك نظره في الحق فهو الواحد الكثير كما أنه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهُوَ السَّمِيعُ الْبَصِيرُ وأين التنزيه من التشبيه والآية واحدة وهي كلامه عن نفسه على جهة التعريف لنا بما هو عليه في‏\n\n\nذاته ففصل بليس وأثبت بهو وأما نداؤه تعالى للعالم ونداء العالم إياه فمن حيث الانفصال فهو ينادي يا أَيُّهَا النَّاسُ ونحن ننادي يا ربنا ففصل نفسه عنا كما فصلنا أيضا أنفسنا عنه فتميزنا وأين هذا المقام من مقام الاتصال إذا أحبنا وكان سمعنا وبصرنا وجميع قوانا وجعل ذلك حين أخبرنا اتصال محب بمحبوب فنسب الحب إليه ونحن المحبوبون ولا خفاء بالفرق بين أحكام المحب ومنزلته وبين أحكام المحبوب ومنزلته فارتفعنا به ونزل سبحانه بنا وذلك حتى لا يكون الوجود على السواء فإنه محال التسوية فيه فلا بد من نزول ورفعة فيه وما ثم إلا نحن وهو فإذا كان حكم واحد النزول كان حكم الآخر الرفعة والعلو وكل محب نازل وكل محبوب عال وما منا إلا محب ومحبوب ف ما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ وما منا إلا نازل علي فهذه أحكام مختلفة في عين واحدة\n\n\n> فيا أيها المؤمنون اتقوا *** ويا ربنا ما الذي نتقي‏\n\n\n> فنادى فناديت مستفهما *** فلم أدر من راح أو من بقي‏\n\n\n> وقسم حكمي على حكمه *** فأما سعيد وإما شقي‏\n\n\n> فيرضى ويغضب في حكمه *** ويشقى ويسعد إذا نتقي‏\n\n\n> فأين الإكاليل من رجله *** وأين النعال من المفرق‏\n\n\n> فيظهر في ذا وذا مثله *** ليلقى العبيد الذي قد لقي‏\n\n\n> إذا كان ما قلته كائنا *** فقد علم العبد ما يتقى‏\n\n\n### [القرب المفرط حجاب‏]\n\n\nواعلم أيدك الله أن في هذا المنزل من العلوم علم الحجب المتصلة بالمحجوب فإن القرب المفرط حجاب مثل البعد المفرط وفيه علم مجالسة العبد ربه إذا ذكره وانقسام أهل الذكر فيه إلى من يعلم أنه جليس الحق في حين ذكره الحق وإلى من لا يعلم ذلك وسبب جهله بمجالسته ربه كونه لا يعلم ربه فلا يميزه أو كونه لا يعلم أن ربه ذكره لصمم قام به وغشاوة على بصره فإن الذاكر الصحيح يعلم متى يذكره ربه وإن لم يعلم شهودا مجالسة ربه وغيره يعلم ذلك ويشهد جليسه فكما هو الحق جليس من ذكره كذلك العبد جليس الحق إذا ذكره ربه ولا يجالسه إلا عبد في الحالتين ولو جالسة به فعبوديته لم تزل فإن عينه لم تزل لأن غاية القرب أن يكون الحق سمعه وبصره فقد أثبت عينه وليس عينه سوى عبودته وفيه علم ما الفرق بين مجالسة الحق تعالى في الخلوة والجلوة هل الصورة في ذلك واحدة أم تتنوع بتنوع المجالس وفيه علم ما يتحدث به جليس الحق مع الحق وفي أي صورة يكون ذلك فإن المشاهدة للبهت فهل كل مشاهدة للبهت أو لا يكون البهت إلا في بعض المشاهدات ولا بد من العلم بأن المتجلي هو الله تعالى وفيه علم كل من دعا الله كائنا من كان إنه لا يشقى ولا أحاشي أحدا وإن شقي الداعي لعارض فالمال إلى السعادة الأبدية وفيه علم من خاف غير الله بالله ما حكمه عند الله‏\nوهو مقام عزيز لكونه خاف بالله ومن هذه حالته لا يرى غير الله فكيف يخاف غير الله يقول الله تعالى فَلا تَخافُوهُمْ وخافُونِ إِنْ كُنْتُمْ مُؤْمِنِينَ وفيه علم من طلب الأمان من الله بالغير هل هو مصيب صاحب علم أو مخطئ صاحب جهل وهل يخاف الله لعينه أو يخاف لما يكون منه فمتعلق الخوف إن كان لما يكون منه فمتعلقه ما يكون منه وهو ما يقوم بك وفيه علم أثر العادات في الأكابر أهل الشهود لما ذا يرجع مع علمهم بأنه عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ فما مشهودهم هل مشهودهم فَعَّالٌ لِما يُرِيدُ وهم جاهلون بما في إرادة الحق بهم فتؤثر العادات فيهم بوساطة حالهم في هذا المقام الذي تعطيه الإرادة الإلهية وفيه علم هل الأمور كلها بالنسبة إلى الله على السواء أو ليست على السواء فإن لم تكن على السواء فما السبب الذي أخرجها أن تكون على السواء قال تعالى وهُوَ الَّذِي يَبْدَؤُا الْخَلْقَ ثُمَّ يُعِيدُهُ وهُوَ أَهْوَنُ عَلَيْهِ وقوله ولَهُ الْمَثَلُ الْأَعْلى‏ في السَّماواتِ والْأَرْضِ فهو قوله لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ابتداء وإعادتهم أهون من ابتدائهم وابتداؤهم أهون من خلق السموات والأرض فخلق السموات والأرض أكبر قدرا من خلق الناس فإن الناس لهما عليهم حق ولادة فالناس منفعلون عنهما فإن الجرمية غير معتبرة هنا فإنه قال ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ وما من أحد إلا وهو يعلم حسا أن خلق السموات والأرض أكبر في الجرم من خلق الناس وما ثم إلا انفعال الجسم الطبيعي عنهما لا غير وفيه علم ابتداء كل عين في كونها فليس لها مثال سبق وفيه علم الفرد الأول الذي هو أول الأفراد وفيه علم ما يسمى كلاما فإن ذلك مسألة خلاف طال فيها الكلام بين أهل النظر وقول الله لزكريا عليه السلام إن جعل الله له آية على وجود يحيى عليه السلام أَلَّا تُكَلِّمَ النَّاسَ ثَلاثَةَ أَيَّامٍ إِلَّا رَمْزاً فاستثني وما استثنى إلا الكلام والأثر موجود من الإشارة والرمز كما هو موجود من نظم الحروف في النطق وفيه علم النيابة عن الله ونيابة الحق عن العبد ومن أتم فإنه أمر أن يتخذ وكيلا وجعل بعضنا خلفاء في الأرض وأخبر أنا ننطق بكلامه وهو القائل منا إذا قلنا بعض أقوالنا وفيه علم المناسبة التي تشمل العالم كله وإنه جنس واحد فتصح المفاضلة فيما تحته من الأنواع والأشخاص فإن الإمام أبا القاسم بن قسي صاحب خلع النعلين منع من ذلك فاعتبر خلاف ما اعتبرناه فهو مصيب فيما اعتبره مخطئ باعتبارنا إذ ما ثم إلا حق وأحق وكامل وأكمل فالمفاضلة سارية في أنواع الجنس للمفاضلة التي في الأسماء بالإحاطة وما يزيد به هذا الاسم على غيره كالعالم والقادر وكالقادر والقاهر وفيه علم التأثيرات في العالم وفيه علم ما حكم من رأى لنفسه قدرا وهل إذا أتى بما يدل عليه وهو كامل هل إتيانه بذلك شفقة على الغير أو تعظيما لنفسه وهل يؤثر مثل ذلك في الرضاء أم لا يؤثر فيه ومن أعلى من يحتج عن نفسه ويذب عنها أو من لا يحتج عنها بل يكون مع الناس عليها ومتى يصلح أن يكون للإنسان هذا الحكم ومتى يصلح أن لا يكون له هذا الحكم وقوله ولَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِما يَقُولُونَ ... فَاصْبِرْ ولم يقل تعالى فارض بحكم ربك وفيه علم سعى الإنسان في عدالته عند الحكام لقبول شهادته فهو من باب السعي في حق الغير لا في حق نفسه لأمور تطرأ إن لم يكن عدلا لا يقبل الحاكم شهادته فربما ظهر الباطل على الحق فوجب السعي في العدالة لهذا كما\n\n\nقال أنا سيد الناس يوم القيامة\n\n\nوما قصد الفخر وإنما قصد الإعلام وإراحة أمته من التعب حتى لا تمشي في ذلك اليوم كما تمشي الأمم إلى نبي بعد نبي للشفاعة فتقتصر على محمد صَلَّى اللهُ عَليهِ وسَلَّم بما أعلمها من ذلك وأن الرجوع إليه في آخر الأمر\n\n\n> رأى الأمر يفضي إلى آخر *** فصير آخره أولا\n\n\nفتميزت الأمة المحمدية عن سائر الأمم في ذلك الموطن بهذا القدر إلى غير هذا وفيه علم موطن بيان الأمور لجميع الخلق وارتفاع التلبيس ورجوع الناس وغيرهم إلى الحق وهل ذلك نافعهم أم لا وفيه علم ما لا يصح إلا لله الاتصاف به وفيه علم ما يجب لله وما يستحيل وفيه علم حكم من يبتغي نصرة من خذله الله تعالى عند الله تعالى وفيه علم من يريد شرفا بتشريف من ينسب إليه وفيه علم الفرق بين المهدي والهادي وفيه علم النبوة العامة والنبوة الخاصة وما يبقى منها وما يزول وفيه علم هل يكون للولي الذي ليس بنبي مقام في الولاية لا يكون ذوقا لنبي أم لا وفيه علم ما هي النعم الظاهرة والباطنة ومن يتنعم بكل نعمة منهما من الإنسان وفيه علم علامات المقربين عند الله وبما ذا يعرفون وفيه علم‏\nهل يلحق اللاحق بالسابق وأي المنزلتين أفضل وفيه علم من يرى أن أحوال الآخرة على ميزان أحوال الدنيا سواء في جميع الأمور وفيه علم ما ينبغي أن يكون عليه صاحب جنة الأعمال وما يكون عليه صاحب جنة الورث وما يكون عليه صاحب جنة الاختصاص وفيه علم سبب اختصاص عالم الأمر بالأمر وعالم الإنسان بالنهي والأمر وفيه علم ما نفى الله من أسمائه أن يشرك فيه فلم يشرك وفيه علم ما لا يدرك إلا بالحوالة وفيه علم الجزاء ومحله أيضا وفيه علم صفة الطريق إلى الجنة ومن يسلك وفيه علم من أرخى الله له في طوله في الدنيا هل يرخي له في الآخرة كذلك جزاء وفيه علم اختلاف أحوال الخلق في الاستدعاء إلى الله تعالى يوم القيامة للفصل والقضاء وفيه علم ما هو أعظم الأهوال عند الله ولم يأت به إلا الإنسان خاصة وما أجرأه على ذلك وقد خلقه الله ضعيفا فقيرا إلى كل شي‏ء وفيه انقلاب الولي عدوا لمن كان له وليا وانقلاب العدو وليا لمن كان له عدوا وفيه علم العلم الضروري والنظري والبديهي والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Three Hundred and Sixty-Five: Concerning the Knowledge of the Station of Secrets Connected to the Presence of Mercy, Pertaining to One Whose Station and State are Hidden from the Cosmos, and Who Belongs to the Muhammadan Presence\n\nThe rank of the Five is known,\nIt preserves what exceeds it in number.\n\nIt preserves the remembrance of Allah from a Mercy,\nBy which it subsists, having no support\n\nExcept for the One who preserves our Fixed Entities (أعياننا),\nAnd He is the Exalted God, the Eternal Refuge (الصمد).\n\nAll that is in the cosmos of His creation,\nProstrates to Him when My servant calls upon Him.\n\nWere it not for Him, we would not exist in our Fixed Entities,\nDespite His being exalted, He did not beget.\n\nSo He, despite the Multiplicity (كثرة) in His decree,\nThe Attributes of the One (الأحد) are not negated from Him.\n\nWere it not for the existence of Multiplicity in His decree,\nThe existence of number would not have appeared from Him.\n\nSo He is the Unique Essence (وحيد العين) in His dominion,\nAnd His decree in His cosmos is supported\n\nBy what we bear upon our existence,\nFrom ourselves, by His grace, what is worshipped.\n\nHe is mighty, so none but Him comprehends Him,\nAnd He is majestic, too great to remain subject to the decree of duration.\n\nGlory be to Him, a Subduing King,\nWho has subdued the totality and the people of number.\n\nThere is no reliance for everyone who knows Him,\nExcept upon the one who is from His cosmos.\n\nFrom pre-eternity, our decree was valid for Him,\nLikewise, His decree is also valid in post-eternity.\n\n### [The Manifest and the Hidden Necessitated that the Existential Matter Relative to Us Be Between the Clear and the Concealed]\n\nKnow—may Allah support us and you with a Spirit from Him—that when Allah named Himself The Manifest (الظاهر) and The Hidden (الباطن), this necessitated that the existential matter (الأمر الوجودي) relative to us be between the clear (جلي) and the concealed (خفي). What He made manifest to us is the clear, and what He veiled from us is the concealed. Yet, all of that is clear to Him, the Exalted.\n\nThe Messenger of Allah (PBUH) said in his supplication: \"O Allah, I ask You by every Name You have named Yourself with, or taught to any one of Your creation.\"\n\nThis is the Manifest (الجلي) to the one whom Allah has taught it, and the Hidden (الخفي) from the one He has not taught it.\n\nThen he continued: \"Or have reserved for Yourself in the knowledge of Your Unseen.\"\n\nThis is hidden from everything other than Allah, and none knows it except Allah. For He, the Exalted, <<يَعْلَمُ السِّرَّ>> (knows the secret)—which is what is between Him and His creation—<<وَأَخْفَى>> (and what is yet more hidden)—which none knows but Him, such as the keys to the Unseen (مفاتح الغيب) that are with Him, <<لَا يَعْلَمُهَا إِلَّا هُوَ>> (none knows them except Him). Thus, He is the Knower of the Unseen (عالِمُ الْغَيْبِ), which is the Hidden, and the Visible (الشَّهادَةِ), which is the Manifest. This includes what He has brought into existence from the possibilities (الممكنات), which is also the Manifest, and what He has not brought into existence from them, which is also the Hidden. The World (العالم) is never devoid of these two relations, neither in this world nor the Hereafter. The increase (المزيد) that occurs from the World in the World is from the Hidden, and the increase never ceases. Thus, the World is an increase continually emerging from concealment (الخفاء) into manifestation (الجلاء).\n\nThe Manifest part of the supplicant’s request is heard by The Real (الحق) through the Name The Manifest, and the Hidden part is heard through the Name The Hidden. When He grants the request, the Name The Hidden gives it to The Manifest, and The Manifest gives it to the supplicant. Thus, The Manifest is the veil (حاجب) of The Hidden, and the Clear is the veil of the Concealed, just as consciousness (الشعور) is the veil of Knowledge (العلم).\n\nKnow that Allah, the Mighty and Majestic, deals with His servants according to how they deal with Him. It is as if He, the Exalted, is subject to them by the rule of consequence (حكم التبعية), even though the initiation of the matter is from Him. However, this is how we have been taught and established in our understanding, for we only attribute to Him what He attributes to Himself, and we are only capable of that.\n\nAn example of The Real’s (الحق) consequence to the creature is His saying, the Exalted: <<قُلْ إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله>> (Say: If you love Allah, then follow me, and Allah will love you). And His saying (PBUH) in the authentic Hadith: \"Indeed, Allah does not weary until you weary.\"\n\nAnd His saying, the Exalted: <<فَاذْكُرُونِي أَذْكُرْكُمْ>> (So remember Me; I will remember you). And His saying, the Glorified: \"Whoever remembers Me in himself, I remember him in Myself; and whoever remembers Me in a gathering, I remember him in a better gathering than that.\"\n\nThe servant is never in a state,\nExcept that The Real is in a similar state.\nAll of it is from Him, but it is\nHow the decree came to us in its form.\n\nThus, whoever opposes the command of The Real, by this opposition, he invites from The Real an opposition to his own purpose. Therefore, the pardon, overlooking, and forgiveness (العفو والتجاوز والمغفرة) from The Real are not a reward for the servant’s opposition in the case of some servants. Rather, that is a favor (امتنان) from Allah upon him. If it is a reward, it is a reward for the one who pardoned a servant like himself, overlooked, and forgave the one who wronged him in this world. Thus, The Real stands for him in that attribute of pardon, forbearance, overlooking, and forgiveness, measure for measure, hand in hand.\n\nIt is reported in the authentic narration from the Messenger of Allah (PBUH): \"Allah would not forbid you from usury (الربا) and then take it from you.\"\n\nAllah has not forbidden His servants from anything except that He is further removed from it, nor has He commanded you with a noble character trait except that The Real is more deserving of it.\n\n### [The Station of Spiritual Inheritance is the Station of the Sacred Law]\n\nKnow that this station (منزل) is the station of spiritual inheritance (الميراث المعنوي), and it is the station of the Sacred Law (الشريعة). The existence of life (الحياة) is a condition for the existence of all relations attributed to Allah. This relation necessitated that He, the Glorified, possess the Name The Living (الحي). All Divine Names (الأسماء الإلهية) are dependent upon it and conditioned by it, even the Name Allah. The Name Allah is the Dominant (المهيمن) over all Names, among which is The Living. Yet, the relation of the Name The Living holds dominance over all nominal relations, even the relation of Divinity (الألوهة) by which Allah is named Allah.\n\nThe Prophet (PBUH) said: \"The scholars are the inheritors of the Prophets. They did not inherit dinars or dirhams; they only inherited Knowledge (العلم). Whoever takes from it has taken a generous share.\"\n\nAnd he said: \"We, the company of Prophets, do not inherit nor are we inherited. What we leave behind is charity.\"\n\nHe meant the inheritance of wealth (الورث), which is inherited from the deceased. Thus, inheritance remains only in Knowledge, spiritual state (الحال), and the expression of what they found from Allah in their Unveiling (كشف), and what the people of intellectual reflection found in their reflection. These are the scholars who fear Allah because of their knowledge that He knows their movements and stillness, specifically and in detail, for He is <<الَّذِي يَرَاكَ حِينَ تَقُومُ * وَتَقَلُّبَكَ فِي السَّاجِدِينَ>> (Who sees you when you stand, and your movement among those who prostrate), and in all your states.\n\nThe Prophet (PBUH) made clear that the Prophets have precedence, for they are not inherited until they return to Allah from this abode. Everything that a follower of a specific prophet attains during that prophet’s lifetime is a favor (إنعام) from that prophet, not an inheritance. But everything he attains from a prophet who has died is inherited knowledge (علم موروث).\n\nEvery inheritor of knowledge in any time only inherits from the Prophets (peace be upon them) who preceded him, not from those who came after him. Thus, the inheritance of a scholar of any previous nation, before the Messenger of Allah (PBUH), was a partial inheritance. But since the Prophet of this Muhammadan Community (الأمة المحمدية) was Muhammad (PBUH), the last of the Prophets, and his community is the best of communities, it is valid for the inheritor among them to inherit from him and to inherit from all the Prophets (peace be upon them). This is never the case for a scholar of a preceding community. This is why this community is the <<خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ>> (best community brought forth for mankind), because it has gained an advantage over other inheritors by a matter attained only by this community.\n\nEvery inheritor of a prophet receives his knowledge from the overflow of the light of the one he inherits from Allah. And the gaze of the Glorified upon His Prophets is the most complete gaze. Thus, the knowledge of the inheritors is the most complete of all knowledge.\n\nAny knowledge that is not based on inheritance is not specialized knowledge (علم اختصاص), such as the knowledge of the people of the interval (أصحاب الفترات) between prophets. Their knowledge is not inherited knowledge, even if they are scholars, because they were not followers of a prophet, as none was sent to them, nor were they prophets themselves. Thus, they did not receive the prophetic gaze (نظرة الأنبياء) from Allah. They therefore fall short of the rank of the inheritors in knowledge, even though they know that Allah has Prophets.\n\nAs for those who do not affirm the Prophets or Prophethood as it is in itself, and who believe that the designation of Prophets is only for those who purify the essence of their souls from the impurities of natural desires and adhere to conventional noble character traits, and that when a person reaches this state, the forms of the higher world are potentially imprinted upon his soul, allowing him to speak of the knowledge of the Unseen—Prophethood, in our view, is not like that, nor is it so in itself. It may occur in some individuals as they describe, but even with the possibility of the imprinting of the world’s forms potentially occurring in the soul of this person, it only pertains to what has occurred in existence, not to the particulars of matters. For the knowledge contained in the movements of the spheres, the swimming of the stars, and the heavens—which are the effects of these things—is not known by the star, the heaven, the sphere, or the angel itself. Yet, this person may know from them what they do not know of themselves.\n\nFurthermore, it has not been reported of any prophet or sage that he encompassed the knowledge of his state in every single moment until his death. Rather, he knows some things and not others, even though we know that Allah, the Mighty and Majestic, <<أَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (revealed in every heaven its command), and that Allah has deposited in the Preserved Tablet (اللوح المحفوظ) His knowledge concerning His creation and what will occur from them until the Day of Resurrection. If the Tablet were asked, \"What is in you?\" or \"What has the Pen inscribed in you of the knowledge of Allah, the Mighty and Majestic?\" it would not know. For Allah has deposited all of that in His gaze upon those below Him, and none knows the effect resulting from that gaze except Allah. This is because the effect does not appear from the gaze itself, but from the preparedness of the recipient (استعداد القابل). For this reason, He said: <<وَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ كَلَمْحٍ بِالْبَصَرِ>> (And Our command is but a single [word], like the twinkling of an eye). Look at the single twinkling of an eye and what you perceive of the things seen. Although this command is single, it is varied in existence due to the variation in the preparedness of the recipients.\n\nTherefore, none knows matters in detail except Allah alone, and <<لَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ>> (they encompass nothing of His knowledge except what He wills).\n\nAny person who engages in spiritual striving (مجاهدة), retreat (خلوة), and purification of the soul (تصفية نفس) without following a Sacred Law (شريعة) or believing in it as it is in itself—the knowledge that comes to him and which he finds through this preparedness is not inherited knowledge, nor does The Real have a prophetic gaze toward him. Rather, his utmost attainment is to receive from the angelic spirits (الأرواح الملكية) according to his suitability, and from Allah according to what his intellectual reflection (نظره الفكري) has granted him, because he has absolutely no Unveiling (كشف) from Allah. That is among the exclusive characteristics of the Prophets (peace be upon them) and their followers, not those who merely affirm them but do not follow any one of them specifically among the people of definition, nor did they perform any action during the interval period (زمان الفترة) based on the saying of a prophet, even if their action coincided with the action of a prophet, because the intention of following was absent.\n\nThe inspiration (الإلقاء) given to him is less than the inspiration given to the working inheritor who acts based on the saying of that prophet. There is a vast difference between the two types of knowledge, a witnessed experiential distinction (تمييز ذوقي مشهود). May Allah make us and you among the inheritors.\n\nWhoever outwardly professes belief in Prophethood but diverts the apparent rulings (الأحكام الظاهرة) brought by it into subjective psychological meanings that were not the Prophet’s intention, contrary to what the common people believed—such a person will gain no benefit from knowledge.\n\nBut whoever believes that what this Prophet brought is entirely true in its outward and general sense, and that it has an additional, secondary application (مصرف آخر) while affirming these meanings—such a person combines the sensory and the spiritual meaning in his reflection. That is the knowing inheritor who witnesses The Real as He is.\n\nThis is only achieved through application (التعمل). The meaning of application is not that someone who lacks this belief hears it from me or someone else and says, \"I believe it and bind myself to it. If what he said is true, then it is for me, and and if not, it will not harm me.\" Such a person will not benefit, nor will it be opened up for him, because he does not affirm it with certainty; rather, he is merely experimenting. And where is Faith (الإيمان) compared to doubt and experimentation? This person is blind of insight (بصيرة) and deficient in reflection. If his intellectual reflection upon the proofs were sound, he would stumble upon the face of the indication, and the desired truth would flash for him, revealing the matter as it is, just as it was revealed to others who gave reflection its due right. For when the observer gives his reflection its due right, Faith adheres to him as the shadow adheres to the person, because they are paired. He perceives with the eye of the proof the rank of this one called the Prophet and the Lawgiver (الشارع) with Allah. It is impossible for him to witness this experientially (ذوقا) and not follow him in state (حالا). This is inconceivable.\n\nWe have believed in Allah and His Messenger and what he brought, both generally and in detail—what has reached us of its detail and what has not reached us or is not established with us. We are believers in everything he brought in reality. I took this from my parents through the path of imitation (تقليد), and the judgment of intellectual reflection regarding its possibility, impossibility, or necessity never occurred to me. I acted upon my faith in that until I knew *from where* I believed and *by what* I believed. Allah unveiled my sight (بصر), my insight (بصيرة), and my imagination (خيال). I saw with the eye of sight what is only perceived by it, and I saw with the eye of imagination what is only perceived by it, and I saw with the eye of insight what is only perceived by it. Thus, the matter became witnessed (مشهودا) for me, and the judgment that was previously imagined or conjectured through imitation became existent.\n\nI knew the worth of the one I followed, who is the Messenger sent to Muhammad (PBUH). I witnessed all the Prophets, from Adam to Muhammad (peace be upon them). Allah showed me all the believers in them, so that none of them remained, neither those who were nor those who will be until the Day of Resurrection, neither their elite nor their common folk. I saw the ranks of the entire community, knew their worth, and became acquainted with everything I had believed in generally concerning the higher world. I witnessed all of that.\n\nYet, the knowledge of what I saw and witnessed did not shift me from my Faith. I continue to say and act upon what I say and do because of the saying of the Prophet (PBUH), not because of my knowledge, my vision, or my witnessing. Thus, I established brotherhood between Faith (الإيمان) and Direct Vision (العيان).\n\nThis is a rare existence among followers, for the slipping of the feet (مزلة الأقدام) for the great masters (الأكابر) occurs precisely here: when the direct vision of that which was believed in occurs, they act based on the vision, not on the faith. If they fail to combine the two, they miss the perfection of knowing their own worth and station. Even if they are people of Unveiling (كشف), Allah has not unveiled to them their own worth and station, so they remain ignorant of themselves and act based on observation. The Perfect Human (الكامل) is the one who acts based on Faith, even with the taste of Direct Vision, and is neither shifted nor affected by the Vision.\n\nI have not seen anyone who has tasted this station in state (بالحال), although I know that it has men in the world. But Allah has not brought me together with them in the vision of their essences, persons, and names. It is possible that I have seen some of them but did not connect their essence with their name.\n\nThe reason for this is that I never attached my soul to the side of The Real, asking Him to reveal to me any part of the cosmos or any event. Rather, I attached my soul to Allah, asking Him to employ me in what pleases Him and not to employ me in what distances me from Him, and to grant me a station that no follower could have higher than it. Even if all beings in the world shared it with me, I would not be affected by that, for I am a pure servant, not seeking superiority over His servants. Rather, Allah placed joy in my soul, such that I wish the entire world were on a single footing in the highest ranks.\n\nAllah singled me out with a conclusion to the matter that never crossed my mind. I thanked Allah, the Exalted, with the inability to thank Him, even while fulfilling the right of gratitude.\n\nI have not mentioned my state for the sake of boasting—no, by Allah!—but I mentioned it for two reasons: First, because of His saying, the Exalted: <<وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ>> (But as for the favor of your Lord, report [it]). And what favor is greater than this? Second, so that a person of high aspiration (صاحب همة) may hear it, and aspiration may be stirred within him to employ himself in the way I employed myself, so that he may attain the like of this and be with me in my degree.\n\nThere is no constraint or restriction except in the sensory (المحسوس) and in Divinity (الألوهية) specifically. For this reason, the rule of jealousy (الغيرة) only relates to these two stations. As for the sensory, it is due to its limitation: if something is with you, the exact same thing cannot be with someone else. As for Divinity, the claimant to it is a liar, and the one to whom it belongs is truthful. The object of jealousy is the existence of one who does not possess Divinity and falsely claims it. Thus, the jealousy is over the station, for it belongs only to one, and no one else has a footing in it. Jealousy (الغيرة) is derived from the Other (الغير). I have thus made the straight path clear to you.\n\n### [That the Purest Knowledge Inherited is What the Scholar Inherits]\n\nKnow that the purest knowledge inherited is what the scholar inherits from the Divine Names (الأسماء الإلهية). If you ask, \"How are the Divine Names inherited, since inheritance only occurs after death?\" We say: I agree.\n\nKnow that by this type of knowledge, I mean the fact that The Real, the Glorified, is capable of initiating an act that He does not perform and which only occurs from you, as we have explained that you are an instrument (آلة) for Him, the Exalted. Since what is from you must be something that cannot exist without you, and it is impossible for what is from you to have two existences—for the existent does not accept two existences, but is a single existence—this measure of existence, which is manifest from you and which belonged to Him, takes the place of inherited wealth from the one to whom it belonged, since it is impossible for it to belong to him after his death, just as it was impossible for this existent thing to come from anyone other than the one from whom it came. Realize this subtle point, for it is wondrous among the people of spiritual taste (الأذواق), not in the judgments of the intellect.\n\n### [The Divine Name The Living]\n\nKnow that since no Divine Name could precede the Divine Name The Living (الحي), it holds the rank of precedence. Thus, it is truly described as The First (الأول). Every living thing in the world—and there is nothing in the world except what is living—is a branch (فرع) of this root (أصل).\n\nJust as the branch does not resemble the root in the fruit it bears, the various ways the winds affect it, and its acceptance of the state of being bare or clothed when it sprouts leaves or sheds them—while the root is not like that, but is the provider for everything that appears in and through the branch, since the branch has no subsistence in its branching and its rules except through the root—likewise is the Name The Living with all other Divine Names. Every Name belongs to it, if you realize the matter.\n\nIts secret flows through the entire world, manifesting in its form in what is attributed to it of glorification (التسبيح) with His praise. Glorification is transcendence (تنزيه), and transcendence is stripping away (تعرية). Likewise, the Root is stripped of the garments of the branches and their adornments of leaves and fruit. All of that is from Him, yet He is transcendent in His Essence (ذاته) from being sustained by them. He has given what does not subsist by Him and is not an attribute for Him.\n\nThis is knowledge that can only be attained by the person of Unveiling (صاحب كشف). When he attains it, he cannot divide the world into living and non-living; rather, the entire world is living to him. However, life is attributed to every living thing according to the reality of what is described by it, according to the people of Unveiling and Witnessing (الشهود), not according to those who only see life in what is not inanimate or growing. Our discussion is only with the people of Unveiling whom Allah has shown the matter as it is in itself. Know that.\n\nKnow that since the Name The Living is an essential Name (اسم ذاتي) for The Real, the Glorified, only a living thing can issue from Him. Thus, the entire world is living, for the absence of life, or the existence of an existent thing in the world that is not living, would mean it has absolutely no Divine support (مستند إلهي) for its existence. Every contingent event must have a support. The inanimate (الجماد) in your view is living in reality.\n\nAs for death (الموت), it is the separation of a living director (مدبر) from a living directed thing (مدبر). Both the director and the directed are living, and the separation is a non-existent relation (نسبة عدمية), not an existent one. It is merely the removal from a governorship.\n\nFurthermore, it is not a condition of the living thing that it must perceive (يحس). Perception (الإحساس) and the senses (الحواس) are intelligible matters added to its being alive. The condition of the living thing is Knowledge (العلم). It may perceive or may not perceive. Even if it perceives, the existence of pains and pleasures is not a condition of perception, for Knowledge suffices for that, even though the world does not perceive what is customarily perceived only through the senses. You and all rational people know that Allah is Knower of everything, while being transcendent above perception and the senses.\n\nThere are many paths to attaining knowledge for those who seek it, and the senses are one path leading to knowledge of the sensible. Knowledge may be attained without the path of the senses, so it is known in both cases, but it is not sensible to the one who knows it without the path of the senses. Rather, it is witnessed (مشهود) and known to him.\n\nSimilarly, we do not doubt that we shall see our Lord with our eyes (بالأبصار) in direct vision (عيانا) in a manner befitting His Majesty, and He will be visible to us. We do not say that He is sensible (محسوس), due to the limitation and restriction that sensation requires. This is a vision without modality (غير مكيفة). Our discussion here is with those who affirm vision with the eye, but we do not affirm modality, limitation, or restriction. Rather, we see Him as transcendent, just as we knew Him to be transcendent.\n\nWe have previously established in other places in this book the correctness of every belief and the validity of every rational proposition concerning Allah. As for the revealed legal propositions concerning Him, belief in them is obligatory. They did not come to contradict the intellect, for they came in agreement with the intellect in <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). And they came with what the proof of the intellect does not accept from the perspective of its reflection, thereby adding knowledge of Him that the intellect could not have attained independently before, either through faith (if based on report) or through spiritual taste (if based on witnessing).\n\nWe submit to Him whatever He has described Himself with that the intellect cannot independently grasp through its solitary reflection, because we do not encompass His Essence (ذاته) with knowledge; rather, we do not know it at all.\n\nSince the Fixed Entities (الأعيان) in existence have connection with one another and separation from one another, Allah made this a sign for those who lack Unveiling that the Knower of Allah has a spiritual connection (اتصالا معنويا) from one aspect and a separation from another.\n\nHe is connected from the reality of His Essence (ذاته), His Divinity (ألوهته), and His Actuality (فاعليته), and separated from one single aspect—that aspect is His very Essence—because He does not multiply, even though His decrees, Names, and the intelligibles of His Names multiply.\n\nHis connection is His creation of us with His two Hands: <<مَا مَنَعَكَ أَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ>> (What prevented you from prostrating to that which I created with My two Hands?) and <<خَلَقْنَا لَهُمْ مِمَّا عَمِلَتْ أَيْدِينَا أَنْعَامًا فَهُمْ لَهَا مَالِكُونَ>> (We created for them, from what Our Hands have made, grazing livestock, and they are their owners).\n\nHis separation is the separation of Divinity from servitude: <<لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ>> (There is no god but He, the Exalted in Might)—by His separation—<<الْحَكِيمُ>> (the Wise)—by His connection.\n\nHowever, the formation (التكوين) of the world only occurs through His connection, not through His separation. The world performs the acts of worship (العبادات) that Allah has obligated upon it. For this reason, He attributed these acts to the servant and commanded him to seek assistance from Allah in them, just as the servant is an instrument (آلة) for The Real in certain acts, and instruments assist the Maker in what can only be made with an instrument.\n\nThe world is separated from The Real by its limit and its reality. Thus, it is separated and connected from a single Essence, for He does not multiply in His Essence, even if His decrees multiply, since they are non-existent relations and known attributions.\n\nThe world emerged upon the form of The Real (حق). Only one thing issued from The One, and that is the essence of the possible (عين الممكن). Multiplicity—meaning His decrees—only issued from Multiplicity, which are the decrees attributed to The Real, expressed by the Names and Attributes.\n\nWhoever views the world from the perspective of its essence affirms its Oneness (أحديته). Whoever views it from the perspective of its decrees and relations affirms Multiplicity in a single Essence. Likewise is the view of The Real: He is the One, the Many. Just as <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), <<وَهُوَ السَّمِيعُ الْبَصِيرُ>> (and He is the Hearing, the Seeing). Where is transcendence (التنزيه) compared to similitude (التشبيه)? Yet the verse is one, and it is His speech about Himself for the purpose of defining for us what He is in His Essence. He separated with \"There is nothing like,\" and affirmed with \"He is.\"\n\nAs for His calling to the world and the world calling to Him, this is from the perspective of separation. He calls: <<يَا أَيُّهَا النَّاسُ>> (O mankind), and we call: \"O our Lord.\" He separated Himself from us, just as we also separated ourselves from Him. Thus, we are distinguished.\n\nWhere is this station compared to the station of connection, when He loves us and becomes our hearing, our sight, and all our powers? He made this connection, when He informed us of it, the connection of a lover to a beloved. He attributed love to Himself, and we are the beloveds. There is no hidden difference between the rules and station of the lover and the rules and station of the beloved. We are elevated by Him, and He, the Glorified, descends by us. This is so that existence is not on an equal footing, for equality is impossible in it. There must be descent and elevation within it. And there is nothing there except us and Him. So, if the decree of one is descent, the decree of the other is elevation and highness. Every lover is descending, and every beloved is high. And none of us is anything but a lover and a beloved. Thus, <<وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ>> (There is none of us but has a known station), and none of us is anything but descending and high. These are different decrees in a single Essence.\n\nO believers, fear [Allah]!\nAnd O our Lord, what is it that we fear?\n\nHe called, and I called back, inquiring,\nI did not know who departed or who remained.\n\nAnd He divided my decree upon His decree,\nSo one is happy and one is wretched.\n\nHe is pleased and He is angry in His decree,\nAnd one is wretched and one is happy when we fear.\n\nSo where are the crowns from His foot,\nAnd where are the sandals from the crown of the head?\n\nHe appears in this and that, like it,\nSo that the servants may meet what they have met.\n\nIf what I have said is existent,\nThen the servant has known what he should fear.\n\n### [Excessive Proximity is a Veil]\n\nKnow—may Allah support you—that among the sciences in this station is the knowledge of the veils (الحجب) connected to the veiled one. For excessive proximity (القرب المفرط) is a veil, just like excessive distance (البعد المفرط).\n\nIn it is the knowledge of the servant’s session (مجالسة) with his Lord when he remembers Him, and the division of the people of remembrance (أهل الذكر) into those who know that they are the companion of The Real (جليس الحق) when The Real remembers them, and those who do not know that. The reason for their ignorance of their session with their Lord is either that they do not know their Lord and thus cannot distinguish Him, or that they do not know that their Lord has remembered them due to a deafness that has afflicted them or a covering over their sight. The sound rememberer knows when his Lord remembers him, even if he does not witness his session with his Lord. Others know this and witness their companion. Just as The Real is the companion of the one who remembers Him, so too is the servant the companion of The Real when his Lord remembers him. And none but a servant sits with Him in both states. Even if he sits with Him, his servitude (عبوديته) never ceases, for his essence never ceases. The utmost proximity is for The Real to be his hearing and his sight, and this affirms his essence, and his essence is nothing but his servitude.\n\nIn it is the knowledge of the difference between sitting with The Real, the Exalted, in solitude (الخلوة) and in public (الجلوة). Is the form of this session one, or does it vary with the variation of the gatherings?\n\nIn it is the knowledge of what the companion of The Real speaks about with The Real, and in what form that occurs. For witnessing (المشاهدة) leads to bewilderment (البهت). Is all witnessing bewilderment, or does bewilderment only occur in some instances of witnessing? And there must be knowledge that the one who manifests Himself (المتجلي) is Allah, the Exalted.\n\nIn it is the knowledge that everyone who calls upon Allah, whoever he may be, will not be wretched—and I exclude no one—and even if the caller becomes wretched due to an accident, the final outcome is eternal happiness.\n\nIn it is the knowledge of the ruling concerning the one who fears other than Allah *by* Allah. This is a rare station, because he fears *by* Allah. One whose state is this does not see other than Allah, so how could he fear other than Allah? Allah, the Exalted, says: <<فَلَا تَخَافُوهُمْ وَخَافُونِ إِنْ كُنْتُمْ مُؤْمِنِينَ>> (So fear them not, but fear Me, if you are believers).\n\nIn it is the knowledge of the one who seeks security (الأمان) from Allah through the other. Is he correct and a person of knowledge, or mistaken and a person of ignorance? And does one fear Allah for His Essence, or fear Him for what comes from Him? If the object of fear is what comes from Him, then its object is what comes from Him, which is what subsists in you.\n\nIn it is the knowledge of the effect of habits (العادات) on the great masters (الأكابر) who are people of Witnessing. Why do they revert, despite their knowledge that He is <<عَلَى كُلِّ شَيْءٍ قَدِيرٌ>> (over all things competent)? What is their witnessed reality? Is their witnessed reality <<فَعَّالٌ لِمَا يُرِيدُ>> (Doer of what He intends), and are they ignorant of what is in The Real’s Will (إرادة) concerning them, so that habits affect them through the mediation of their state in this station granted by the Divine Will?\n\nIn it is the knowledge of whether all matters are equal relative to Allah, or not equal. If they are not equal, what is the reason that removed them from being equal? He, the Exalted, said: <<وَهُوَ الَّذِي يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ>> (And He is the one who begins creation; then He repeats it, and that is easier for Him). And His saying: <<وَلَهُ الْمَثَلُ الْأَعْلَى فِي السَّمَاوَاتِ وَالْأَرْضِ>> (And to Him belongs the highest example in the heavens and the earth). This is His saying: <<لَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ>> (The creation of the heavens and earth is greater than the creation of mankind). The beginning of their creation and their repetition is easier than their beginning, and their beginning is easier than the creation of the heavens and the earth. The creation of the heavens and the earth is greater in measure than the creation of mankind, for mankind owes them the right of birth; mankind is acted upon by them. The corporeality (الجرمية) is not considered here, for He said: <<وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ>> (But most of mankind do not know). Yet, everyone knows sensually that the creation of the heavens and the earth is greater in mass than the creation of mankind. There is nothing there but the passivity of the natural body to them, and nothing else.\n\nIn it is the knowledge of the beginning of every Fixed Entity (عين) in its existence, for it has no prior example.\n\nIn it is the knowledge of the First Individual (الفرد الأول), who is the first of the individuals.\n\nIn it is the knowledge of what is called speech (كلام), for this is a controversial issue over which the people of reflection have long debated. And Allah’s saying to Zachariah (peace be upon him) when Allah made a sign for him of the existence of John (Yahya): <<أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَةَ أَيَّامٍ إِلَّا رَمْزًا>> (That you will not speak to the people for three nights, except by sign). He made an exception, and He only excepted speech, while the effect of signaling and indication (الإشارة والرمز) exists, just as the effect of arranging letters in articulation exists.\n\nIn it is the knowledge of deputyship (النيابة) on behalf of Allah and the deputyship of The Real on behalf of the servant. And who is more complete? For the servant is commanded to take a trustee (وكيلا), and He made some of us vicegerents (خلفاء) on earth, and informed us that we speak with His speech, and He is the one who speaks through us when we utter some of our sayings.\n\nIn it is the knowledge of the suitability (المناسبة) that encompasses the entire world, and that it is a single genus, so that preference (المفاضلة) is valid among the species and individuals under it. For Imam Abu al-Qasim ibn Qasī, the author of *Khalʿ al-Naʿlayn* (The Removal of the Sandals), prohibited this. He considered the opposite of what we considered. He is correct in what he considered, and mistaken in our consideration, for there is nothing there but The Real and the more Real, the Perfect and the more Perfect. Thus, preference is current among the species of the genus due to the preference found in the Names through encompassing, and what one Name exceeds another by, such as The Knowing (العالم) and The Powerful (القادر), or The Powerful and The Subduer (القاهر).\n\nIn it is the knowledge of the influences (التأثيرات) in the world.\n\nIn it is the knowledge of the ruling concerning one who sees worth in himself. And if he performs an act that indicates this, while he is perfect, is his performance of that out of compassion for others or self-aggrandizement? And does such an act affect contentment (الرضاء) or not? And who is superior: the one who argues on his own behalf and defends himself, or the one who does not argue but stands with the people against himself? And when is it appropriate for a person to have this ruling, and when is it appropriate for him not to have this ruling? And His saying: <<وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ * فَاصْبِرْ>> (And We already know that your breast is constrained by what they say. So be patient). He did not say, \"Be content with the decree of your Lord.\"\n\nIn it is the knowledge of man’s striving for his own integrity (عدالته) before judges for the acceptance of his testimony. This is a matter of striving for the right of others, not for his own right, because of matters that may arise: if he is not upright, the judge will not accept his testimony, and falsehood may prevail over truth. Thus, striving for integrity is obligatory for this reason, just as [the Prophet] said:\n\n\"I am the master of mankind on the Day of Resurrection.\"\n\nHe did not intend boasting, but rather informing and relieving his community from hardship, so that they would not walk on that Day as other nations walk, going from prophet to prophet for intercession. They will rely solely on Muhammad (PBUH) because he informed them of this, and that the return is ultimately to him.\n\nHe saw the matter leading to an end,\nSo He made its end its beginning.\n\nThus, the Muhammadan Community was distinguished from the rest of the communities in that station by this measure, in addition to other matters.\n\nIn it is the knowledge of the station of the clarification of matters for all creation, the removal of confusion (التلبيس), and the return of mankind and others to The Real. And whether that will benefit them or not.\n\nIn it is the knowledge of what is only valid for Allah to be described by.\n\nIn it is the knowledge of what is necessary for Allah and what is impossible.\n\nIn it is the knowledge of the ruling concerning one who seeks help from someone whom Allah has forsaken.\n\nIn it is the knowledge of one who desires honor through the honoring of one attributed to him.\n\nIn it is the knowledge of the difference between the Guided (المهدي) and the Guide (الهادي).\n\nIn it is the knowledge of general prophethood and specific prophethood, and what remains of them and what vanishes.\n\nIn it is the knowledge of whether a saint (ولي) who is not a prophet can have a station in sainthood (ولايته) that a prophet does not taste experientially (ذوقا).\n\nIn it is the knowledge of what the apparent and hidden favors (النعم الظاهرة والباطنة) are, and which human receives enjoyment from each of them.\n\nIn it is the knowledge of the signs of those brought near (المقربين) to Allah, and by what they are known.\n\nIn it is the knowledge of whether the latecomer (اللاحق) can catch up to the predecessor (السابق), and which of the two stations is superior.\n\nIn it is the knowledge of one who believes that the states of the Hereafter are exactly on the scale of the states of this world in all matters.\n\nIn it is the knowledge of what the person of the Garden of Deeds (جنة الأعمال) should be upon, what the person of the Garden of Inheritance (جنة الورث) should be upon, and what the person of the Garden of Specialization (جنة الاختصاص) should be upon.\n\nIn it is the knowledge of the reason for the specialization of the World of Command (عالم الأمر) with the command, and the World of Man (عالم الإنسان) with the prohibition and the command.\n\nIn it is the knowledge of which of His Names Allah negated partnership in, and thus no partnership occurred.\n\nIn it is the knowledge of what is only perceived through reference (الحوالة).\n\nIn it is the knowledge of the recompense (الجزاء) and its location.\n\nIn it is the knowledge of the description of the path to Paradise and who traverses it.\n\nIn it is the knowledge of whether the one whom Allah granted length in this world will likewise be granted length in the Hereafter as a reward.\n\nIn it is the knowledge of the variation in the states of creation when they are summoned to Allah on the Day of Resurrection for judgment and decree.\n\nIn it is the knowledge of what is the greatest of terrors (الأهوال) with Allah, which none but man specifically brought about. And how bold he is in that, when Allah created him weak and needy of everything.\n\nIn it is the reversal of the saint (الولي) into an enemy for the one to whom he was a saint, and the reversal of the enemy into a saint for the one to whom he was an enemy.\n\nIn it is the knowledge of necessary knowledge (العلم الضروري), theoretical knowledge (النظري), and self-evident knowledge (البديهي). And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the truth, and He guides to the way).",
    "ur": "باب نمبر تین سو پینسٹھ: ان اسرار کے مقام کی معرفت میں جو حضرتِ رحمت (حضرة الرحمة) میں اس ذات سے متصل ہوئے جس کا مقام اور حال تمام کائناتوں سے پوشیدہ ہے، اور وہ حضرتِ محمدیہ (الحضرة المحمدية) سے ہے۔\n\nمرتبۂ خمسہ (پانچ کا درجہ) معروف ہے\nیہ اس عدد کی حفاظت کرتا ہے جو اس سے تجاوز کر جائے\n\nیہ اللہ کے ذکر کی حفاظت کرتا ہے رحمت سے\nجو اس کے ساتھ قائم ہے اور اس کا کوئی سہارا نہیں\n\nسوائے اس ذات کے جو ہماری اعیان (حقیقتوں) کی حفاظت کرتا ہے\nاور وہ اللہ ہے، بلند و بالا، الصمد (بے نیاز)\n\nکائنات میں جو کچھ بھی اس کی مخلوق ہے\nجب میرا بندہ اسے پکارتا ہے تو وہ سجدہ کرتا ہے\n\nاگر وہ نہ ہوتا تو ہم اپنی اعیان کے ساتھ موجود نہ ہوتے\nباوجود اس کے کہ وہ سبحانہ نہ کسی کا باپ ہے\n\nپس وہ اپنے حکم میں کثرت کے ساتھ ہے\nاس سے احد (یکتا) کی صفات کی نفی نہیں ہوتی\n\nاگر اس کے حکم میں کثرت کا وجود نہ ہوتا\nتو اس سے عدد کا وجود ظاہر نہ ہوتا\n\nپس وہ اپنی بادشاہت میں وحید العین (یکتا ذات) ہے\nاور اس کا حکم اپنی کائنات میں مستند (بھروسہ مند) ہے\n\nاس چیز پر جو ہم نے اپنی ہستی پر اٹھائی\nاپنے نفس سے، اس کے فضل سے، جس کی عبادت کی گئی\n\nوہ بلند ہے، پس اسے اس کے سوا کوئی نہیں جانتا\nاور وہ جلیل ہے کہ مدد (مدد) کے حکم پر باقی رہے\n\nوہ پاک ہے، ایک قاہر بادشاہ\nجس نے سب کو اور اہل عدد کو مغلوب کر رکھا ہے\n\nاس کی کائنات میں اس کے غیر پر کوئی بھروسہ نہیں\nہر اس شخص کے لیے جو اسے جانتا ہے، وہ معتمد (بھروسہ گاہ) ہے\n\nازل سے ہمارا حکم اس کے لیے صحیح ہوا\nاسی طرح ابد میں بھی اس کا حکم صحیح ہے۔\n\n***\n\n[بے شک الظاہر (ظاہر) اور الباطن (باطن) کا تقاضا ہے کہ وجودی امر ہمارے لیے جلی (واضح) اور خفی (پوشیدہ) کے درمیان ہو]\n\nجان لو، اللہ ہمیں اور تمہیں اپنی روح سے تائید بخشے، کہ جب اللہ نے اپنے آپ کو الظاہر (ظاہر) اور الباطن (باطن) نام دیا، تو اس کا تقاضا یہ ہوا کہ وجودی امر ہمارے لیے جلی (واضح) اور خفی (پوشیدہ) کے درمیان ہو۔ پس جو کچھ اس نے ہمارے لیے ظاہر کیا وہ جلی ہے، اور جو ہم سے چھپایا وہ خفی ہے، اور یہ سب کچھ اللہ تعالیٰ کے لیے جلی ہے۔\n\nرسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے اپنی دعا میں فرمایا:\n\"اللهم إني أسألك بكل اسم سميت به نفسك أو علمته أحدا من خلقك\"\n(اے اللہ! میں تجھ سے تیرے ہر اس نام کے واسطے سے سوال کرتا ہوں جو تو نے خود کو دیا یا اپنی مخلوق میں سے کسی کو سکھایا)۔\n\nاور یہ اس شخص کے نزدیک جلی ہے جسے اللہ نے سکھایا، اور اس شخص سے خفی ہے جسے نہیں سکھایا۔\n\nپھر آپ نے فرمایا:\n\"أو استأثرت به في علم غيبك\"\n(یا جسے تو نے اپنے علم غیب میں اپنے لیے خاص کر لیا ہے)۔\n\nپس یہ اللہ کے سوا سب سے خفی ہے، اسے صرف اللہ ہی جانتا ہے۔ کیونکہ وہ تعالیٰ \"يَعْلَمُ السِّرَّ\" (راز کو جانتا ہے) اور وہ وہ ہے جو اس کے اور اس کی مخلوق کے درمیان ہے، اور \"أَخْفى\" (اس سے بھی زیادہ پوشیدہ) اور وہ وہ ہے جسے صرف وہی جانتا ہے، جیسے مفاتح الغیب (غیب کی کنجیاں) جو اس کے پاس ہیں، \"لا يَعْلَمُها إِلَّا هُوَ\" (انہیں اس کے سوا کوئی نہیں جانتا)۔ پس وہ \"عالِمُ الْغَيْبِ\" (غیب کا جاننے والا) ہے، جو کہ خفی ہے، اور \"الشَّهادَةِ\" (حاضر کا جاننے والا) ہے، جو کہ جلی ہے۔ اور جو کچھ اس نے ممکنات میں سے وجود میں لایا وہ بھی جلی ہے، اور جو ان میں سے وجود میں نہیں لایا وہ بھی خفی ہے۔ دنیا اور آخرت میں عالم ان دو نسبتوں سے خالی نہیں ہے۔ عالم میں جو اضافہ واقع ہوتا ہے وہ خفی سے ہے، اور اضافہ ہمیشہ جاری رہتا ہے۔ پس عالم ایک اضافہ ہے جو خفا سے جلا کی طرف نکلتا رہتا ہے۔ سائلوں کے سوال میں جو جلی حصہ ہے، ذات حق (الحق) اسے اسم الظاہر (ظاہر نام) سے سنتا ہے، اور جو خفی حصہ ہے اسے اسم الباطن (باطن نام) سے سنتا ہے۔ جب وہ اسے وہ چیز عطا کرتا ہے جو اس نے مانگی، تو اسم الباطن اسے الظاہر کو دیتا ہے، اور الظاہر اسے سائل کو دیتا ہے۔ پس الظاہر، الباطن کا حجاب ہے، اور جلی، خفی کا حجاب ہے، جیسا کہ شعور، علم کا حجاب ہے۔\n\nجان لو کہ اللہ عزوجل اپنے بندوں کے ساتھ وہی معاملہ کرتا ہے جو وہ اس کے ساتھ کرتے ہیں۔ گویا کہ وہ تعالیٰ ان کی تبعیت کے حکم میں ہے، اگرچہ امر کی ابتدا اسی کی طرف سے ہے، لیکن ہمیں یہی سکھایا گیا اور ہمارے نزدیک یہی مقرر ہے۔ کیونکہ ہم اس کی طرف صرف وہی نسبت دیتے ہیں جو اس نے خود اپنی طرف نسبت دی، اور ہمارے لیے اس کے سوا ممکن نہیں۔ مخلوق کے لیے حق تعالیٰ کی تبعیت کے حکم میں سے اس کا یہ قول ہے: \"قُلْ إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله\" (کہہ دو: اگر تم اللہ سے محبت کرتے ہو تو میری پیروی کرو، اللہ تم سے محبت کرے گا)۔ اور صحیح حدیث میں اس کا یہ قول صَلَّى اللهُ عَليهِ وسَلَّم ہے: \"إن الله لا يمل حتى تملوا\" (بے شک اللہ نہیں تھکتا جب تک تم نہ تھک جاؤ)۔\n\nاور اس کا یہ قول ہے: \"فَاذْكُرُونِي أَذْكُرْكُمْ\" (پس تم مجھے یاد کرو، میں تمہیں یاد کروں گا)۔ اور اس کا یہ قول سبحانہ ہے: \"من ذكرني في نفسه ذكرته في نفسي ومن ذكرني في ملأ ذكرته في ملأ خير منه\" (جس نے مجھے اپنے نفس میں یاد کیا، میں نے اسے اپنے نفس میں یاد کیا، اور جس نے مجھے کسی جماعت میں یاد کیا، میں نے اسے اس سے بہتر جماعت میں یاد کیا)۔\n\nفلا يكون العبد في حالة\nإلا يكون الحق في مثلها\nوكلها منه ولكنه\nكذا أتانا الحكم في شكلها\n\n(پس بندہ کسی حال میں نہیں ہوتا\nمگر ذات حق (الحق) بھی اسی کی مانند ہوتا ہے\nاور یہ سب کچھ اسی کی طرف سے ہے لیکن\nحکم ہمارے پاس اسی شکل میں آیا ہے)\n\nپس جو بھی ذات حق (الحق) کے حکم کی مخالفت کرتا ہے، وہ اس مخالفت کے ذریعے ذات حق (الحق) سے اپنے مقصد کی مخالفت کا مطالبہ کرتا ہے۔ اسی لیے ذات حق (الحق) کی طرف سے عفو، درگزر اور مغفرت بعض بندوں کے لیے بندے کی مخالفت کا بدلہ نہیں ہوتی، بلکہ یہ اللہ کی طرف سے اس پر احسان ہوتا ہے۔ اور اگر یہ بدلہ ہے، تو یہ اس شخص کا بدلہ ہے جس نے اپنے جیسے بندے کو معاف کیا، اور اس شخص سے درگزر کیا اور بخش دیا جس نے دنیا میں اس کے ساتھ برا سلوک کیا، پس ذات حق (الحق) اس کے لیے عفو، درگزر، تجاوز اور مغفرت کی اس صفت میں کھڑا ہو گیا، مثال کے بدلے مثال، ہاتھ کے بدلے ہاتھ۔\n\nصحیح خبر میں رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم سے وارد ہوا ہے:\n\"ما كان الله لينهاكم عن الربا ويأخذه منكم\"\n(اللہ ایسا نہیں ہے کہ تمہیں سود سے منع کرے اور پھر خود تم سے سود لے)۔\n\nپس اللہ نے اپنے بندوں کو جس چیز سے بھی منع کیا، وہ خود اس سے زیادہ دور رہا، اور جس اچھے خلق کا تمہیں حکم دیا، ذات حق (الحق) اس کا زیادہ حقدار ہے۔\n\n***\n\n[معنوی وراثت کا مقام شریعت کا مقام ہے]\n\nجان لو کہ یہ مقام معنوی وراثت کا مقام ہے، اور یہ شریعت کا مقام ہے۔ اور یہ کہ حیات (زندگی) اللہ سے منسوب تمام نسبتوں کے وجود میں شرط ہے۔ اور اس نسبت نے اس سبحانہ کے لیے اس کے نام \"الحی\" (زندہ) کا ہونا واجب کر دیا۔ پس تمام اسماء الٰہیہ اس پر موقوف اور مشروط ہیں، یہاں تک کہ اسم \"اللہ\" بھی۔ پس اسم \"اللہ\" تمام اسماء پر مہیمن (غالب) ہے، جن میں سے \"الحی\" بھی ہے۔ اور اسم \"الحی\" کی نسبت تمام اسمائی نسبتوں پر مہیمنیت (غلبہ) رکھتی ہے، یہاں تک کہ الوہیت کی نسبت پر بھی، جس کے ذریعے اللہ کو \"اللہ\" کہا جاتا ہے۔\n\nآپ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا:\n\"العلماء ورثة الأنبياء وما ورثوا دينارا ولا درهما وإنما ورثوا العلم فمن أخذ منه أخذ بحظ وافر\"\n(علماء انبیاء کے وارث ہیں، اور انہوں نے دینار یا درہم کی وراثت نہیں پائی، بلکہ انہوں نے علم کی وراثت پائی، پس جس نے اسے لیا اس نے وافر حصہ لیا)۔\n\nاور آپ نے فرمایا:\n\"نحن معاشر الأنبياء لا نرث ولا نورث ما تركنا صدقة\"\n(ہم گروہ انبیاء نہ وراثت پاتے ہیں اور نہ وراثت چھوڑتے ہیں، جو کچھ ہم چھوڑتے ہیں وہ صدقہ ہوتا ہے)۔\n\nیعنی مال کی وراثت جو میت سے ورثے میں ملتی ہے۔ پس وراثت صرف علم، حال، اور اس چیز کی تعبیر میں باقی رہی جو انہوں نے اپنے کشف (الکشف) میں اللہ سے پائی، اور اہل نظر نے اپنے نظر میں پائی۔ اور یہی وہ علماء ہیں جو اللہ سے ڈرتے ہیں، کیونکہ وہ جانتے ہیں کہ اللہ ان کی حرکات و سکنات کو تعین اور تفصیل کے ساتھ جانتا ہے، کیونکہ وہ \"الَّذِي يَرَاكَ حِينَ تَقُومُ * وَتَقَلُّبَكَ فِي السَّاجِدِينَ\" (وہ جو تمہیں دیکھتا ہے جب تم کھڑے ہوتے ہو اور سجدہ کرنے والوں میں تمہارا پلٹنا) اور تمہارے تمام احوال میں۔ پس آپ صَلَّى اللهُ عَليهِ وسَلَّم نے واضح کیا کہ انبیاء کو تقدم حاصل ہے، کیونکہ وہ اس دنیا سے اللہ کی طرف پلٹنے تک وراثت نہیں چھوڑتے۔ پس جو کچھ بھی کسی خاص نبی کا متبع اس کی زندگی میں حاصل کرتا ہے، وہ اس نبی کی طرف سے انعام ہے، وراثت نہیں۔ اور جو کچھ اس نے کسی فوت شدہ نبی سے حاصل کیا، وہ موروثی علم ہے۔ پس ہر زمانے میں علم کا وارث اپنے سے متقدم انبیاء علیہم السلام سے وراثت پاتا ہے، نہ کہ اپنے سے متاخر سے۔ ہر امت کے عالم کی وراثت جو رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم سے پہلے تھی، وہ جزوی وراثت تھی۔ اور یہ امت محمدیہ، چونکہ اس کے نبی محمد صَلَّى اللهُ عَليهِ وسَلَّم آخری نبی تھے، اور ان کی امت بہترین امت تھی، اس لیے ان کے وارث کے لیے یہ صحیح ہوا کہ وہ آپ کی اور تمام انبیاء علیہم السلام کی وراثت پائے۔ اور یہ کسی بھی متقدم امت کے عالم میں کبھی نہیں ہو سکتا تھا۔ اسی لیے یہ \"خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ\" (بہترین امت جو لوگوں کے لیے نکالی گئی) تھی، کیونکہ اس نے وارثوں پر ایک ایسے امر میں اضافہ کیا جو صرف اسی امت کو حاصل ہوا۔\n\nپس ہر نبی کا وارث، اس کا علم اس نور کے فیض سے ہوتا ہے جو اس کے مورث کو اللہ کی طرف سے ملا، اور اللہ سبحانہ کا اپنے انبیاء پر نظر کامل ترین نظر ہے۔ پس وارثوں کا علم کامل ترین علوم ہے۔ اور ہر وہ علم جو وراثت سے نہ ہو، وہ علم اختصاص نہیں ہے، جیسے اہل فترات (انبیاء کے درمیان کے زمانے کے لوگ) کا علم۔ ان کا علم وراثت کا علم نہیں ہے، اگرچہ وہ علماء تھے، لیکن وہ کسی نبی کے متبع نہیں تھے کیونکہ ان کی طرف کوئی نبی مبعوث نہیں ہوا تھا، اور وہ خود بھی انبیاء نہیں تھے۔ پس انہیں اللہ کی طرف سے انبیاء والی نظر حاصل نہیں تھی، لہٰذا وہ علم میں وارثوں کے درجے سے نیچے اتر گئے، اور انہوں نے جانا کہ اللہ کے انبیاء ہیں۔ اور وہ لوگ جو انبیاء اور نبوت کا اقرار نہیں کرتے جیسا کہ وہ فی نفسہ ہے، اور یہ سمجھتے ہیں کہ انبیاء کا مسمیٰ صرف اس شخص کے لیے ہے جس نے اپنے نفس کے جوہر کو طبعی شہوات کی کدورتوں سے پاک کیا اور عرفی اخلاق حسنہ کو لازم پکڑا، اور جب وہ اس مقام پر پہنچ جاتا ہے تو عالم علوی کی صورتیں بالقوہ اس کے نفس میں نقش ہو جاتی ہیں، پس وہ غیوب کے علم سے بولتا ہے۔ ہمارے نزدیک نبوت نہ تو ایسی ہے اور نہ ہی وہ فی نفسہ ایسی ہے۔ اور یہ ممکن ہے کہ بعض اشخاص میں ایسا ہو جیسا کہ انہوں نے کہا، لیکن اس کے باوجود جو کچھ انہوں نے ذکر کیا کہ عالم کی صورتیں بالقوہ اس شخص کے نفس میں نقش ہو جاتی ہیں، یہ صرف ان چیزوں کے لیے ہے جو وجود میں واقع ہو چکی ہیں، نہ کہ جزئیات امور کے لیے۔ کیونکہ افلاک کی حرکات، کواکب کی گردش اور آسمانوں میں جو علوم ہیں جو ان کے آثار سے ہوتے ہیں، ان کو خود اس کا علم نہیں ہوتا، نہ کوکب کو، نہ آسمان کو، نہ فلک کو، نہ ملک کو۔ پس یہ شخص ان چیزوں کو جانتا ہے جنہیں وہ خود نہیں جانتے۔ اور کسی نبی یا حکیم کے بارے میں یہ ذکر نہیں کیا گیا کہ اس نے اپنی موت تک ہر لمحے کے حال کا احاطہ کر لیا ہو، بلکہ وہ بعض کو جانتا ہے اور بعض کو نہیں جانتا۔ باوجود اس کے کہ ہم جانتے ہیں کہ اللہ عزوجل نے \"أَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا\" (ہر آسمان میں اس کا امر وحی کیا) اور یہ کہ اللہ نے لوح محفوظ میں اپنی مخلوق کے بارے میں قیامت تک ہونے والے علم کو ودیعت کر رکھا ہے۔ اور اگر لوح سے پوچھا جائے کہ تجھ میں کیا ہے یا قلم نے تجھ میں اللہ عزوجل کے علم میں سے کیا لکھا ہے، تو وہ نہیں جانتی۔ کیونکہ اللہ نے یہ سب کچھ اپنے سے نیچے والوں کے لیے اپنی نظر میں ودیعت کر رکھا ہے، اور اس نظر کے اثر کو صرف اللہ ہی جانتا ہے۔ کیونکہ اثر نظر سے ظاہر نہیں ہوتا، بلکہ قابل (قبول کرنے والے) کی استعداد سے ظاہر ہوتا ہے۔ اسی لیے اس نے فرمایا: \"وَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ كَلَمْحٍ بِالْبَصَرِ\" (اور ہمارا حکم تو بس ایک ہی ہوتا ہے، جیسے پلک جھپکنا)۔ پس تم ایک پلک جھپکنے میں دیکھو کہ تم کتنی منظورات (دیکھی جانے والی چیزیں) کا ادراک کرتے ہو۔ اور اگرچہ یہ امر واحد ہے، لیکن وجود میں یہ مختلف ہے، کیونکہ قابلوں کی استعداد مختلف ہے۔ پس امور کو تفصیل سے صرف اللہ ہی جانتا ہے، اور \"وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ\" (اور وہ اس کے علم میں سے کسی چیز کا احاطہ نہیں کر سکتے مگر جتنا وہ چاہے)۔ اور ہر وہ شخص جو مجاہدہ، خلوت اور تصفیہ نفس کرتا ہے، لیکن شریعت پر نہیں ہے اور نہ ہی اس پر ایمان رکھتا ہے جیسا کہ وہ فی نفسہ ہے، تو اس استعداد پر جو علم اسے حاصل ہوتا ہے، وہ علم وراثت نہیں ہے، اور نہ ہی ذات حق (الحق) کی طرف سے اس پر کوئی نبوی نظر ہے۔ بلکہ اس کی انتہا یہ ہے کہ وہ ملکی ارواح سے اتنی مقدار میں حاصل کرتا ہے جتنی اس کی مناسبت ہے، اور اللہ کی طرف سے اتنا ہی جتنا اس کی فکری نظر نے اسے دیا، کیونکہ اسے اللہ کی طرف سے مطلقاً کوئی کشف (الکشف) حاصل نہیں ہوتا، کیونکہ یہ انبیاء علیہم السلام اور ان کے متبعین کی خصوصیات میں سے ہے، نہ کہ ان لوگوں کی جو ان کے قائل تو ہیں لیکن ان میں سے کسی ایک کی بھی تعین کے ساتھ پیروی نہیں کرتے، نہ ہی وہ اہل تعریف میں سے ہیں، اور نہ ہی انہوں نے فترت کے زمانے میں کسی نبی کے قول کی وجہ سے کوئی عمل کیا، اگرچہ ان کا عمل کسی نبی کے عمل کے موافق ہو، لیکن ان کا مقصود اتباع نہیں تھا۔\n\nپس اس کی طرف القاء (علم کا ڈالنا) اس وارث عامل کی طرف القاء سے کم ہے جو اس نبی کے قول کی وجہ سے عمل کرتا ہے۔ اور ان دونوں علوم کے درمیان بہت بڑا فرق ہے، اور یہ ایک ذوقی تمیز ہے جو مشہود ہے۔ اللہ ہمیں اور تمہیں وارثوں میں شامل کرے۔ اور جو شخص نبوت کے اعتقاد کا اظہار کرتا ہے اور اس کے لائے ہوئے ظاہری احکام کو نفسانی معانی کی طرف پھیر دیتا ہے جو نبی کے قصد میں نہیں تھے، اور جو عوام نے اس سے سمجھا، تو اسے علم کا کوئی فائدہ حاصل نہیں ہوتا۔ اور جو شخص اس نبی کے لائے ہوئے احکام کے بارے میں یہ اعتقاد رکھتا ہے کہ وہ ظاہر اور عموم میں بالکل حق ہیں، اور اس کے لیے ایک اضافی مصرف (باطنی معنی) بھی ہے، جبکہ یہ معانی بھی ثابت ہیں، پس اس نے اپنی نظر میں حس اور معنی کو جمع کر لیا۔ وہی وارث عالم ہے جس نے ذات حق (الحق) کا مشاہدہ کیا جیسا کہ وہ فی نفسہ ہے۔ اور یہ صرف \"تعمل\" (عمل کرنے) سے حاصل نہیں ہوتا۔ اور \"تعمل\" کا مطلب یہ نہیں ہے کہ وہ شخص جس کا یہ اعتقاد نہیں ہے، وہ مجھ سے یا کسی اور سے سن کر کہے کہ میں اس کا اعتقاد رکھتا ہوں اور اپنے آپ کو اس سے باندھتا ہوں، کہ اگر جو کچھ اس نے کہا وہ حق ہے تو یہ میرے لیے ہے، اور اگر نہیں ہے تو مجھے کیا نقصان؟ ایسا شخص نہ فائدہ اٹھاتا ہے اور نہ ہی اس کے لیے اس میں کوئی دروازہ کھلتا ہے، کیونکہ وہ قطعی طور پر اس کی تصدیق کرنے والا نہیں ہے، بلکہ وہ تجربہ کرنے والا ہے۔ اور ایمان کا شک اور تجربے سے کیا تعلق؟ یہ شخص بصیرت کا اندھا اور نظر میں ناقص ہے۔ اگر اس کی فکری نظر دلائل میں صحیح ہوتی، تو وہ دلالت کی جہت کو پا لیتا، اور مطلوب اس کے لیے روشن ہو جاتا، اور امر اس کے لیے اسی طرح واضح ہو جاتا جیسا کہ دوسروں کے لیے واضح ہوا جنہوں نے نظر کا حق ادا کیا۔ کیونکہ جب ناظر اپنی نظر کا حق ادا کرتا ہے، تو ایمان اس کے ساتھ ایسے لازم ہو جاتا ہے جیسے سایہ شخص کے ساتھ، کیونکہ وہ دونوں جڑے ہوئے ہیں۔ وہ دلیل کی آنکھ سے اس ذات (نبی اور شارع) کے مرتبے کو اللہ کے نزدیک دیکھتا ہے۔ پس یہ محال ہے کہ وہ اسے ذوقاً دیکھے اور پھر حالاً اس کی پیروی نہ کرے۔\n\nاور ہم اللہ پر اور اس کے رسول پر اور جو کچھ وہ لائے ہیں، اس پر اجمالاً اور تفصیلاً ایمان لائے ہیں، جو تفصیل ہم تک پہنچی ہے اور جو ہم تک نہیں پہنچی یا ہمارے نزدیک ثابت نہیں ہوئی، تو ہم ہر اس چیز پر ایمان رکھتے ہیں جو وہ فی نفسہ لائے ہیں۔ میں نے یہ اپنے والدین سے تقلیداً لیا، اور میرے دل میں کبھی یہ خیال نہیں آیا کہ عقلی نظر کا حکم اس میں جواز، محال یا وجوب کے لحاظ سے کیا ہے۔ پس میں نے اپنے اس ایمان پر عمل کیا یہاں تک کہ میں نے جان لیا کہ میں نے کہاں سے ایمان لایا اور کس چیز پر ایمان لایا۔ اور اللہ نے میری بصارت، بصیرت اور خیال سے پردہ ہٹا دیا، پس میں نے آنکھ سے وہ دیکھا جو صرف آنکھ سے ہی ادراک کیا جا سکتا ہے، اور میں نے خیال کی آنکھ سے وہ دیکھا جو صرف خیال سے ہی ادراک کیا جا سکتا ہے، اور میں نے بصیرت کی آنکھ سے وہ دیکھا جو صرف بصیرت سے ہی ادراک کیا جا سکتا ہے۔ پس امر میرے لیے مشہود ہو گیا، اور تقلید سے متخیل اور متوہم حکم موجود ہو گیا۔ پس میں نے اس ذات کا قدر جانا جس کی میں نے پیروی کی، اور وہ محمد صَلَّى اللهُ عَليهِ وسَلَّم کی طرف مبعوث رسول ہیں۔ اور میں نے آدم سے لے کر محمد علیہم السلام تک تمام انبیاء کا مشاہدہ کیا، اور اللہ تعالیٰ نے مجھے ان سب پر ایمان لانے والوں کا مشاہدہ کرایا، یہاں تک کہ ان میں سے کوئی بھی باقی نہ رہا جو قیامت تک ہو گا، ان کے خاص اور عام۔ اور میں نے تمام جماعتوں کے مراتب دیکھے، پس میں نے ان کی قدریں جانیں، اور میں نے ہر اس چیز پر اطلاع پائی جس پر میں نے اجمالاً ایمان لایا تھا جو عالم علوی میں ہے، اور میں نے ان سب کا مشاہدہ کیا۔ پس جو علم میں نے دیکھا اور مشاہدہ کیا، اس نے میرے ایمان سے مجھے ذرا بھی نہیں ہٹایا۔ میں اب بھی وہی کہتا اور کرتا ہوں جو میں کہتا اور کرتا ہوں، رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے قول کی وجہ سے، نہ کہ اپنے علم، اپنی آنکھ یا اپنے شہود (الشہود) کی وجہ سے۔ پس میں نے ایمان اور عیان (مشاہدہ) کے درمیان مواخات (بھائی چارہ) قائم کیا۔ اور یہ اتباع میں نایاب الوجود ہے۔ کیونکہ اکابر کے قدموں کی پھسلن یہیں ہوتی ہے، جب اس چیز کا معاینہ ہو جاتا ہے جس پر ایمان لایا گیا تھا، تو وہ عیان پر عمل کرتے ہیں نہ کہ ایمان پر۔ پس جب وہ ان دونوں کو جمع نہیں کرتے، تو وہ کمال سے محروم ہو جاتے ہیں کہ وہ اپنی قدر اور منزلت کو جانیں۔ پس اگرچہ وہ اہل کشف (الکشف) میں سے ہے، لیکن اللہ نے اس پر اس کی قدر اور منزلت کا کشف نہیں کیا، پس اس نے اپنے نفس کو نہ جانا، اور مشاہدے پر عمل کیا۔ اور کامل وہ ہے جو عیان کے ذوق کے ساتھ ایمان پر عمل کرے، اور عیان سے متاثر ہو کر منتقل نہ ہو۔ اور میں نے اس مقام کے کسی ذائق کو حال کے ساتھ نہیں دیکھا، اگرچہ میں جانتا ہوں کہ عالم میں اس کے رجال موجود ہیں، لیکن اللہ نے میری اور ان کی ملاقات ان کی اعیان، اشخاص اور ناموں کی رؤیت میں نہیں کرائی۔ پس یہ ممکن ہے کہ میں نے ان میں سے کسی کو دیکھا ہو اور اس کی عین اور نام کو جمع نہ کیا ہو۔ اس کا سبب یہ تھا کہ میں نے کبھی بھی اپنے نفس کو ذات حق (الحق) کی طرف اس بات کے لیے نہیں لگایا کہ وہ مجھے کسی بھی کائنات یا کسی بھی حادثے پر مطلع کرے۔ بلکہ میں نے اپنے نفس کو اللہ کے ساتھ اس بات پر لگایا کہ وہ مجھے اس چیز میں استعمال کرے جو اسے راضی کرے، اور مجھے اس چیز میں استعمال نہ کرے جو مجھے اس سے دور کرے۔ اور مجھے ایک ایسے مقام کے ساتھ خاص کرے جس سے اعلیٰ کسی متبع کا مقام نہ ہو، اور اگر عالم کے تمام لوگ بھی اس میں میرے ساتھ شریک ہو جائیں تو میں اس سے متاثر نہ ہوں۔ کیونکہ میں محض ایک عبد ہوں، میں اس کے بندوں پر فوقیت نہیں چاہتا، بلکہ اللہ نے میرے نفس میں یہ خوشی رکھی ہے کہ میں یہ تمنا کروں کہ پوری دنیا اعلیٰ ترین مراتب میں ایک ہی قدم پر ہو۔ پس اللہ نے مجھے ایک ایسے امر کے خاتمے کے ساتھ خاص کیا جو میرے وہم و گمان میں بھی نہیں تھا۔ پس میں نے اللہ کا شکر ادا کیا، اس کے شکر سے عاجز ہوتے ہوئے، باوجود اس کے کہ میں نے شکر کا حق ادا کیا۔ اور میں نے جو کچھ اپنے حال کے بارے میں ذکر کیا، وہ فخر کے لیے نہیں، اللہ کی قسم! بلکہ میں نے اسے دو وجوہات کی بنا پر ذکر کیا: پہلی وجہ اللہ تعالیٰ کا یہ قول ہے: \"وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ\" (اور اپنے رب کی نعمت کا خوب چرچا کرو)۔ اور اس سے بڑی نعمت کیا ہو سکتی ہے؟ دوسری وجہ یہ ہے کہ کوئی صاحب ہمت سنے، تو اس میں وہ ہمت پیدا ہو کہ وہ اپنے نفس کو اسی چیز میں استعمال کرے جس میں میں نے استعمال کیا، تاکہ وہ بھی ایسا ہی حاصل کرے اور میرے ساتھ میرے درجے میں ہو۔\n\nکیونکہ تنگی اور حرج صرف محسوسات اور خاص طور پر الوہیت میں ہے۔ اسی لیے غیرت (الغيرة) کا حکم صرف ان دو مقامات سے متعلق ہوتا ہے۔ محسوسات میں اس لیے کہ وہ محدود ہیں، پس جب کوئی چیز تمہارے پاس ہے تو وہی عین چیز کسی اور کے پاس نہیں ہو سکتی۔ اور الوہیت میں، کیونکہ اس کا دعویٰ کرنے والا جھوٹا ہے اور جس کے لیے وہ ہے وہ سچا ہے۔ پس غیرت کا تعلق اس شخص سے ہے جس میں الوہیت نہیں ہے اور وہ جھوٹا دعویٰ کرتا ہے۔ پس غیرت مقام پر ہوتی ہے، کیونکہ وہ صرف ایک کے لیے ہوتی ہے، کسی اور کا اس میں قدم نہیں ہوتا۔ اور غیرت \"غیر\" (دوسرا) سے مشتق ہے۔ پس میں نے تمہارے لیے سیدھے راستے کو واضح کر دیا۔\n\n***\n\n[کہ علم میں سب سے پاکیزہ وراثت وہ ہے جو عالم اسماء الٰہیہ سے پاتا ہے]\n\nجان لو کہ علم میں سب سے پاکیزہ وراثت وہ ہے جو عالم اسماء الٰہیہ سے پاتا ہے۔ اگر تم کہو کہ اسماء الٰہیہ کی وراثت کیسے ہو سکتی ہے، جبکہ وراثت صرف موت کے بعد ہوتی ہے؟ ہم کہتے ہیں: میں بھی یہی کہتا ہوں۔ پس جان لو کہ میں اس قسم کے علم سے یہ مراد لیتا ہوں کہ حق سبحانہ اس بات پر قادر ہے کہ وہ ابتداءً وہ کام کرے جو وہ نہیں کرتا اور جو صرف تم سے واقع ہوا، جیسا کہ ہم بیان کر چکے ہیں کہ تم اس کے لیے آلہ ہو۔ پس جب تم سے وہ چیز واقع ہوئی جو اس کے لیے تمہارے بغیر ممکن نہیں تھی، اور یہ محال ہے کہ جو چیز تم سے ہو اس کے دو وجود ہوں۔ کیونکہ موجود دو وجود قبول نہیں کرتا، بلکہ وہ ایک ہی وجود (الوجود) ہے۔ پس وجود کا یہ حصہ جو تم سے ظاہر ہوا، اس کے لیے اس مال موروث کی منزلت میں آ جاتا ہے جو اس شخص کا تھا، کیونکہ اس کے لیے اس کی موت کے ساتھ اس کا ہونا محال ہو گیا، جیسا کہ یہ محال ہو گیا کہ یہ موجود اس کے غیر سے ہو جس سے وہ ہوا تھا۔ پس اس لطیف نکتے کو سمجھو، کیونکہ یہ اہل اذواق کے لیے عجیب ہے، نہ کہ احکام عقل کے لیے۔\n\n***\n\n[اسم الٰہی \"الحی\" (زندہ)]\n\nجان لو کہ چونکہ اسم الٰہی \"الحی\" (زندہ) سے پہلے کوئی اسم الٰہی نہیں آ سکتا، اس لیے اسے سبقت کا مرتبہ حاصل ہے۔ پس وہ حقیقت میں \"الأول\" (اول) کے وصف سے موصوف ہے۔ پس عالم میں ہر زندہ چیز، اور عالم میں زندہ کے سوا کچھ نہیں ہے، وہ اس اصل کی فرع ہے۔ اور جس طرح فرع اصل سے مشابہت نہیں رکھتی، اس پھل کے لحاظ سے جو وہ اٹھاتی ہے، اور مختلف خواہشات کے تصرفات کے لحاظ سے جو اس پر ظاہر ہوتے ہیں، اور تعری (ننگا ہونے) اور لباس (پتوں کا آنا) کی حالت کو قبول کرنے کے لحاظ سے جب وہ پتے نکالتی ہے اور اپنے پتوں سے خالی ہو جاتی ہے، اور اصل ایسی نہیں ہوتی، بلکہ وہ ہر اس چیز کے لیے مددگار ہے جو اس میں اور اس کے ذریعے ظاہر ہوتی ہے، کیونکہ اس کی فرعیت اور اس کے احکام میں اس کا بقا اصل کے بغیر نہیں ہے، اسی طرح اسم \"الحی\" تمام دوسرے اسماء الٰہیہ کے ساتھ ہے۔ پس ہر اسم اسی کا ہے، جب تم امر کی تحقیق کرو۔ پس اس کا راز پورے عالم میں سرایت کرتا ہے، اور اس کی صورت پر ظاہر ہوتا ہے، اس چیز میں جو اس کی طرف منسوب کی گئی ہے، یعنی اس کی حمد کے ساتھ تسبیح کرنا۔ اور تسبیح تنزیہ ہے، اور تنزیہ تعری (پاک کرنا) ہے۔ اور اسی طرح اصل فروع کے لباس اور ان کی زینت (پتوں اور پھلوں) سے پاک ہے۔ اور یہ سب کچھ اسی کی طرف سے ہے، اور وہ اپنی ذات میں اس سے پاک ہے کہ وہ اس کے ساتھ قائم ہو۔ پس اس نے وہ چیز عطا کی جو اس کے ساتھ قائم نہیں ہوتی اور نہ ہی اس کی صفت بنتی ہے۔ اور یہ علم صرف صاحب کشف (الکشف) کو ہی حاصل ہو سکتا ہے، اور جب اسے حاصل ہو جائے تو وہ عالم کو زندہ اور غیر زندہ میں تقسیم نہیں کر سکتا، بلکہ اس کے نزدیک سب کچھ زندہ ہے۔ لیکن ہمارے نزدیک ہر زندہ چیز کی حیات اس حقیقت کے مطابق منسوب کی جاتی ہے جس کے ساتھ وہ موصوف ہے، اہل کشف (الکشف) اور شہود (الشہود) کے نزدیک، نہ کہ اس شخص کے نزدیک جو حیات کو صرف غیر جماد اور نامی (بڑھنے والی چیز) میں دیکھتا ہے۔ ہماری گفتگو صرف اہل کشف (الکشف) کے ساتھ ہے جنہیں اللہ نے امر کا مشاہدہ کرایا جیسا کہ وہ فی نفسہ ہے۔ پس یہ جان لو۔ اور جان لو کہ چونکہ اسم \"الحی\" حق سبحانہ کا ذاتی اسم ہے، اس لیے اس سے صرف زندہ ہی صادر ہو سکتا ہے۔ پس پورا عالم زندہ ہے، کیونکہ حیات کا نہ ہونا یا عالم میں کسی غیر زندہ موجود کا وجود ہونا، اس کے وجود میں مطلقاً کوئی الٰہی مستند نہیں ہو سکتا۔ اور ہر حادث کے لیے ایک مستند ہونا ضروری ہے۔ پس تمہاری نظر میں جو جماد ہے، وہ فی نفسہ زندہ ہے۔ اور موت، ایک مدبر زندہ کا دوسرے مدبر زندہ سے جدا ہونا ہے۔ پس مدبر اور مدبر منہ دونوں زندہ ہیں، اور مفارقت (جدائی) ایک عدمی نسبت ہے، وجودی نہیں۔ یہ صرف ولایت سے معزولی ہے۔ پھر یہ کہ زندہ ہونے کی شرط یہ نہیں ہے کہ وہ محسوس کرے، کیونکہ احساس اور حواس ایک معقول امر ہے جو زندہ ہونے پر زائد ہے۔ اس کی شرط صرف علم ہے، اور وہ محسوس کر بھی سکتا ہے اور نہیں بھی۔ اور اگر محسوس کرے بھی، تو احساس کی شرط یہ نہیں ہے کہ اس میں درد اور لذتیں ہوں۔ کیونکہ علم اس سے بے نیاز کر دیتا ہے، باوجود اس کے کہ عالم ان چیزوں کو محسوس نہیں کرتا جن کا ادراک عام طور پر صرف حس سے ہوتا ہے۔ اور تم اور تمام عقلمند جانتے ہیں کہ اللہ ہر چیز کا عالم ہے، باوجود اس کے کہ وہ احساس اور حواس سے پاک ہے۔ پس علم کے حصول کے بہت سے طریقے ہیں اس شخص کے نزدیک جو علم حاصل کرتا ہے، اور حس محسوسات کے علم تک پہنچانے کا ایک راستہ ہے۔ پس حس کے راستے کے بغیر بھی اس کا علم حاصل ہو سکتا ہے، تو وہ دونوں حالتوں میں معلوم ہو گا، لیکن وہ اس شخص کے لیے محسوس نہیں ہو گا جس نے اسے حس کے راستے کے بغیر جانا۔ لیکن وہ اس کے لیے مشہود اور معلوم ہو گا، جیسا کہ ہمیں کوئی شک نہیں کہ ہم اپنے رب کو آنکھوں سے عیاناً دیکھیں گے، جیسا کہ اس کے جلال کے لائق ہے، اور وہ ہمارے لیے مرئی ہو گا، اور ہم یہ نہیں کہیں گے کہ وہ محسوس ہے، کیونکہ حس حصر اور تقیید کا تقاضا کرتی ہے۔ پس یہ رؤیت غیر مکّیفہ (کیفیت سے پاک) ہے۔ اور ہماری گفتگو اس بارے میں اس شخص سے ہے جو آنکھ سے رؤیت کا قائل ہے، اور ہم کیفیت، حصر اور تقیید کے قائل نہیں ہیں، بلکہ ہم اسے پاک دیکھتے ہیں جیسا کہ ہم نے اسے پاک جانا ہے۔ ہم نے اس کتاب میں کئی جگہ یہ بات پیش کی ہے کہ اللہ کے بارے میں ہر عقلی اعتقاد کی تصحیح اور ہر عقلی مقالے کی صحت ہے۔ اور جہاں تک اللہ کی طرف سے نازل کردہ شرعی مقالات کا تعلق ہے، تو ان پر ایمان لانا واجب ہے۔ اور وہ عقل کی مخالفت کے لیے نہیں آئیں، کیونکہ وہ عقل کی موافقت میں آئی ہیں: \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" (اس کی مثال کوئی چیز نہیں)۔ اور وہ ایسی چیز بھی لائی ہیں جسے عقل اپنی نظر سے قبول نہیں کرتی، پس اس نے اس کے بارے میں مزید علم حاصل کیا جو وہ پہلے خود سے حاصل نہیں کر سکتا تھا، اپنے ایمان کے ذریعے اگر وہ خبر سے ہو، یا اپنے ذوق کے ذریعے اگر وہ شہود (الشہود) سے ہو۔ اور ہم نے اس کے لیے وہ سب کچھ تسلیم کر لیا جو اس نے خود اپنے لیے بیان کیا، جو عقل اپنی انفرادیت میں اپنی نظر سے حاصل نہیں کر سکتی، لکوننا لا نحیط علما بذاتہ لا بل لا نعلمہا رأسا (کیونکہ ہم اس کی ذات کا احاطہ نہیں کر سکتے، بلکہ ہم اسے سرے سے نہیں جانتے)۔ اور چونکہ وجود میں اعیان کا بعض کا بعض سے اتصال ہے اور بعض کا بعض سے انفصال ہے، اللہ نے اسے اس شخص کے لیے علامت بنا دیا جسے کشف (الکشف) نہیں ہے کہ عالم کا اللہ کے ساتھ ایک معنوی اتصال بھی ہے اور ایک جہت سے فصل بھی ہے۔ پس وہ اپنی ذات، الوہیت اور فاعلیت کی حقیقت سے ایک ہی جہت سے متصل اور منفصل ہے۔ وہ جہت اس کی عین ہے، کیونکہ وہ متکثر نہیں ہوتا، اگرچہ اس کے احکام، اس کے اسماء اور اس کے اسماء کے معقولات کثیر ہوں۔ پس اس کا اتصال یہ ہے کہ اس نے ہمیں اپنے ہاتھوں سے پیدا کیا: \"مَا مَنَعَكَ أَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ\" (تجھے کس چیز نے روکا کہ تو اسے سجدہ کرے جسے میں نے اپنے ہاتھوں سے پیدا کیا)؛ \"خَلَقْنَا لَهُمْ مِمَّا عَمِلَتْ أَيْدِينَا أَنْعَامًا فَهُمْ لَهَا مَالِكُونَ\" (ہم نے ان کے لیے اپنی ہاتھوں کے بنائے ہوئے میں سے چوپائے پیدا کیے، پس وہ ان کے مالک ہیں)۔ اور اس کا انفصال الوہیت کا عبودیت سے انفصال ہے: \"لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ\" (اس کے سوا کوئی معبود نہیں، وہ غالب ہے) اپنے انفصال کے ساتھ، \"الْحَكِيمُ\" (حکمت والا) اپنے اتصال کے ساتھ۔ لیکن عالم کی طرف سے تکوین (پیدا کرنا) صرف اس کے اتصال سے ہوتی ہے، نہ کہ اس کے انفصال سے۔ اور عالم وہ عبادات کرتا ہے جن کا اللہ نے اسے مکلف بنایا ہے، اسی لیے اس نے ان اعمال کو بندے کی طرف منسوب کیا اور اسے حکم دیا کہ وہ اس میں اللہ سے مدد طلب کرے۔ جیسا کہ وہ بعض افعال میں ذات حق (الحق) کے لیے آلہ ہے، اور آلات صانع کے لیے مددگار ہوتے ہیں اس چیز میں جو صرف آلے سے ہی بنتی ہے۔ اور عالم اپنی حد اور حقیقت کے لحاظ سے ذات حق (الحق) سے منفصل ہے۔ پس وہ ایک ہی عین سے منفصل اور متصل ہے۔ کیونکہ وہ اپنی عین میں متکثر نہیں ہوتا، اگرچہ اس کے احکام کثیر ہوں، کیونکہ وہ نسب اور اضافی عدمی معلومات ہیں۔ پس وہ ذات حق (الحق) کی صورت پر ظاہر ہوا۔ پس واحد سے صرف واحد ہی صادر ہوا، اور وہ عین ممکن ہے۔ اور کثرت، یعنی اس کے احکام، صرف کثرت سے صادر ہوئے، اور وہ ذات حق (الحق) سے منسوب احکام ہیں جنہیں اسماء و صفات سے تعبیر کیا جاتا ہے۔ پس جس نے عالم کو اس کی عین کے لحاظ سے دیکھا، اس نے اس کی احدیت کا قول کیا، اور جس نے اسے اس کے احکام اور نسبتوں کے لحاظ سے دیکھا، اس نے ایک ہی عین میں کثرت کا قول کیا۔ اور اسی طرح ذات حق (الحق) میں اس کی نظر ہے۔ پس وہ الواحد الکثیر (واحد کثیر) ہے، جیسا کہ وہ \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" (اس کی مثال کوئی چیز نہیں) اور \"وَهُوَ السَّمِيعُ الْبَصِيرُ\" (اور وہ سننے والا، دیکھنے والا ہے)۔ اور تنزیہ کا تشبیہ سے کیا تعلق؟ اور آیت ایک ہی ہے، اور وہ اس کی اپنی ذات کے بارے میں گفتگو ہے، تاکہ ہمیں اس چیز سے آگاہ کرے جو وہ اپنی ذات میں ہے۔\n\nپس اس نے \"لَيْسَ\" (نہیں ہے) کے ساتھ فصل کیا اور \"هُوَ\" (وہ) کے ساتھ اثبات کیا۔ اور جہاں تک اللہ تعالیٰ کا عالم کو پکارنا اور عالم کا اسے پکارنا ہے، تو یہ انفصال کی جہت سے ہے۔ وہ پکارتا ہے: \"يَا أَيُّهَا النَّاسُ\" (اے لوگو!) اور ہم پکارتے ہیں: \"يَا رَبَّنَا\" (اے ہمارے رب!)۔ پس اس نے اپنے آپ کو ہم سے جدا کیا، جیسا کہ ہم نے بھی اپنے آپ کو اس سے جدا کیا۔ پس ہم ممتاز ہو گئے۔ اور یہ مقام مقام اتصال سے کتنا دور ہے، جب وہ ہم سے محبت کرتا ہے اور ہمارا سننا، ہمارا دیکھنا اور ہماری تمام قوتیں بن جاتا ہے، اور جب اس نے ہمیں خبر دی تو اس نے اسے ایک محب کا محبوب سے اتصال بنا دیا، پس اس نے محبت کو اپنی طرف منسوب کیا اور ہم محبوب ہیں۔ اور محب کے احکام اور اس کے مقام اور محبوب کے احکام اور اس کے مقام کے درمیان فرق پوشیدہ نہیں ہے۔ پس ہم اس کے ذریعے بلند ہوئے اور وہ سبحانہ ہمارے ذریعے نیچے آیا۔ اور یہ اس لیے ہے تاکہ وجود (الوجود) میں برابری نہ ہو، کیونکہ اس میں برابری محال ہے۔ پس اس میں نزول اور رفعت (بلندی) کا ہونا ضروری ہے۔ اور وہاں ہمارے اور اس کے سوا کوئی نہیں ہے۔ پس جب ایک کا حکم نزول ہو گا، تو دوسرے کا حکم رفعت اور علو ہو گا۔ اور ہر محب نازل ہوتا ہے اور ہر محبوب بلند ہوتا ہے۔ اور ہم میں سے ہر کوئی محب اور محبوب ہے۔ پس \"وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ\" (اور ہم میں سے کوئی نہیں مگر اس کا ایک معلوم مقام ہے)۔ اور ہم میں سے ہر کوئی نازل اور بلند ہے۔ پس یہ ایک ہی عین میں مختلف احکام ہیں۔\n\nفيا أيها المؤمنون اتقوا\nويا ربنا ما الذي نتقي\nفنادى فناديت مستفهما\nفلم أدر من راح أو من بقي\nوقسم حكمي على حكمه\nفأما سعيد وإما شقي\nفيرضى ويغضب في حكمه\nويشقى ويسعد إذا نتقي\nفأين الإكاليل من رجله\nوأين النعال من المفرق\nفيظهر في ذا وذا مثله\nليلقی العبيد الذي قد لقي\nإذا كان ما قلته كائنا\nفقد علم العبد ما يتقى\n\n(پس اے ایمان والو! تقویٰ اختیار کرو\nاور اے ہمارے رب! ہم کس چیز سے تقویٰ اختیار کریں؟\nاس نے پکارا، تو میں نے سوال کرتے ہوئے پکارا\nپس میں نہ جان سکا کہ کون چلا گیا یا کون باقی رہا؟\nاور اس نے میرے حکم کو اپنے حکم پر تقسیم کیا\nپس یا تو سعید (خوش بخت) ہے یا شقی (بد بخت)\nپس وہ اپنے حکم میں راضی ہوتا ہے اور غضبناک ہوتا ہے\nاور جب ہم تقویٰ اختیار کرتے ہیں تو وہ شقی ہوتا ہے اور سعید ہوتا ہے\nپس اس کے پاؤں سے تاج کہاں ہیں\nاور سر سے جوتے کہاں ہیں؟\nپس وہ اس میں اور اس میں اسی طرح ظاہر ہوتا ہے\nتاکہ بندے کو وہ ملے جو اسے ملا\nجب جو کچھ میں نے کہا وہ ہونے والا ہے\nتو بندے نے جان لیا کہ کس چیز سے تقویٰ اختیار کرنا ہے)\n\n***\n\n[حد سے زیادہ قرب حجاب ہے]\n\nجان لو، اللہ تمہاری تائید کرے، کہ اس مقام میں علوم میں سے ایک علم ان حجابات کا ہے جو محجوب سے متصل ہیں۔ کیونکہ حد سے زیادہ قرب (القرب المفرط) حجاب ہے، جیسے حد سے زیادہ دوری (البعد المفرط)۔ اور اس میں بندے کا اپنے رب کے ساتھ ہم نشینی کا علم ہے جب وہ اسے یاد کرتا ہے، اور اس میں اہل ذکر کی تقسیم ہے: ایک وہ جو جانتا ہے کہ وہ ذات حق (الحق) کا ہم نشین ہے جب ذات حق (الحق) اسے یاد کرتا ہے، اور دوسرا وہ جو یہ نہیں جانتا۔ اور اس کے رب کے ساتھ ہم نشینی سے اس کی جہالت کا سبب یہ ہے کہ وہ اپنے رب کو نہیں جانتا، پس وہ اسے پہچان نہیں پاتا، یا یہ کہ وہ نہیں جانتا کہ اس کے رب نے اسے یاد کیا، کیونکہ اس میں بہرا پن پیدا ہو گیا ہے اور اس کی بصارت پر پردہ پڑ گیا ہے۔ کیونکہ صحیح ذاکر جانتا ہے کہ اس کا رب اسے کب یاد کرتا ہے، اگرچہ وہ اپنے رب کی ہم نشینی کا شہود (الشہود) نہ کرے۔ اور دوسرا یہ جانتا ہے اور اپنے ہم نشین کا مشاہدہ کرتا ہے۔ پس جس طرح ذات حق (الحق) اس کا ہم نشین ہے جو اسے یاد کرتا ہے، اسی طرح بندہ بھی ذات حق (الحق) کا ہم نشین ہے جب اس کا رب اسے یاد کرتا ہے۔ اور وہ دونوں حالتوں میں صرف بندے کے ساتھ ہی ہم نشینی کرتا ہے۔ اور اگر وہ اس کے ساتھ ہم نشینی کرے بھی، تو اس کی عبودیت زائل نہیں ہوتی، کیونکہ اس کی عین (حقیقت) زائل نہیں ہوئی، کیونکہ قرب کی انتہا یہ ہے کہ ذات حق (الحق) اس کا سننا اور دیکھنا بن جائے، پس اس نے اس کی عین کو ثابت کیا، اور اس کی عین اس کی عبودیت کے سوا کچھ نہیں۔ اور اس میں اس علم کا بیان ہے کہ خلوت اور جلوت میں حق تعالیٰ کی ہم نشینی میں کیا فرق ہے؟ کیا اس میں صورت ایک ہی رہتی ہے یا مجالس کے تنوع سے متنوع ہو جاتی ہے؟ اور اس میں اس علم کا بیان ہے کہ ذات حق (الحق) کا ہم نشین ذات حق (الحق) کے ساتھ کیا گفتگو کرتا ہے، اور وہ کس صورت میں ہوتی ہے؟ کیونکہ مشاہدہ حیرت (بہت) کا سبب بنتا ہے، تو کیا ہر مشاہدہ حیرت کا سبب بنتا ہے، یا حیرت صرف بعض مشاہدات میں ہوتی ہے؟ اور یہ جاننا ضروری ہے کہ تجلی (التجلی) کرنے والا اللہ تعالیٰ ہے۔ اور اس میں اس علم کا بیان ہے کہ جو بھی اللہ کو پکارتا ہے، وہ کوئی بھی ہو، وہ بد بخت نہیں ہوتا، اور میں کسی کو مستثنیٰ نہیں کرتا، اور اگر پکارنے والا کسی عارض کی وجہ سے بد بخت ہو بھی جائے، تو انجام ابدی سعادت کی طرف ہے۔ اور اس میں اس علم کا بیان ہے کہ جو شخص اللہ کے ذریعے اللہ کے غیر سے ڈرتا ہے، اللہ کے نزدیک اس کا حکم کیا ہے؟ اور یہ ایک عزیز مقام ہے، کیونکہ وہ اللہ کے ذریعے ڈرا۔ اور جس کا یہ حال ہو، وہ اللہ کے سوا کسی کو نہیں دیکھتا، تو وہ اللہ کے غیر سے کیسے ڈرے گا؟ اللہ تعالیٰ فرماتا ہے: \"فَلَا تَخَافُوهُمْ وَخَافُونِ إِنْ كُنْتُمْ مُؤْمِنِينَ\" (پس تم ان سے نہ ڈرو اور مجھ سے ڈرو اگر تم ایمان والے ہو)۔ اور اس میں اس علم کا بیان ہے کہ جو شخص اللہ سے غیر کے ذریعے امان طلب کرتا ہے، کیا وہ صحیح ہے، صاحب علم ہے، یا غلطی پر ہے، صاحب جہل ہے؟ اور کیا اللہ سے اس کی عین کی وجہ سے ڈرا جاتا ہے یا اس چیز کی وجہ سے جو اس کی طرف سے ہو سکتی ہے؟ پس اگر خوف کا تعلق اس چیز سے ہے جو اس کی طرف سے ہو سکتی ہے، تو اس کا متعلق وہ ہے جو تم میں قائم ہوتا ہے۔ اور اس میں اس علم کا بیان ہے کہ اہل شہود (الشہود) اکابر پر عادات کا اثر کیوں ہوتا ہے، باوجود اس کے کہ وہ جانتے ہیں کہ وہ \"عَلَى كُلِّ شَيْءٍ قَدِيرٌ\" (ہر چیز پر قادر) ہے۔ پس ان کا مشہود کیا ہے؟ کیا ان کا مشہود \"فَعَّالٌ لِمَا يُرِيدُ\" (جو چاہتا ہے وہ کرنے والا) ہے، اور وہ اس چیز سے جاہل ہیں جو ذات حق (الحق) کے ارادے میں ان کے لیے ہے؟ پس عادات ان پر اثر انداز ہوتی ہیں، اس مقام میں ان کے حال کی وساطت سے جو ارادہ الٰہیہ عطا کرتا ہے۔ اور اس میں اس علم کا بیان ہے کہ کیا تمام امور اللہ کے لیے برابر ہیں یا برابر نہیں ہیں؟ اور اگر برابر نہیں ہیں، تو وہ کیا سبب ہے جس نے انہیں برابری سے خارج کر دیا؟ اللہ تعالیٰ فرماتا ہے: \"وَهُوَ الَّذِي يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ\" (اور وہی ہے جو مخلوق کو پہلی بار پیدا کرتا ہے، پھر اسے دوبارہ پیدا کرتا ہے، اور یہ اس پر زیادہ آسان ہے)۔ اور اس کا یہ قول: \"وَلَهُ الْمَثَلُ الْأَعْلَى فِي السَّمَاوَاتِ وَالْأَرْضِ\" (اور آسمانوں اور زمین میں اسی کے لیے اعلیٰ مثال ہے)۔ پس اس کا یہ قول: \"لَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ\" (بے شک آسمانوں اور زمین کی تخلیق لوگوں کی تخلیق سے بڑی ہے)۔ اور ان کی تخلیق کو دوبارہ کرنا ان کی پہلی تخلیق سے آسان ہے، اور ان کی پہلی تخلیق آسمانوں اور زمین کی تخلیق سے آسان ہے۔ پس آسمانوں اور زمین کی تخلیق لوگوں کی تخلیق سے قدر میں بڑی ہے۔ کیونکہ لوگوں کا ان دونوں پر ولادت کا حق ہے، پس لوگ ان دونوں سے منفعل (متاثر) ہیں۔ کیونکہ یہاں جسمیت (جرمیہ) معتبر نہیں ہے، کیونکہ اس نے فرمایا: \"وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ\" (لیکن اکثر لوگ نہیں جانتے)۔ اور کوئی بھی ایسا نہیں جو حسی طور پر نہ جانتا ہو کہ آسمانوں اور زمین کی تخلیق لوگوں کی تخلیق سے جسم میں بڑی ہے۔ اور وہاں صرف جسم طبعی کا ان دونوں سے متاثر ہونا ہے، اور کچھ نہیں۔ اور اس میں ہر عین کی اس کے وجود میں ابتدا کا علم ہے، پس اس کی کوئی سابق مثال نہیں ہے۔ اور اس میں فرد اول کا علم ہے جو افراد میں سب سے اول ہے۔ اور اس میں اس علم کا بیان ہے جسے کلام کہا جاتا ہے، کیونکہ یہ ایک اختلافی مسئلہ ہے جس میں اہل نظر کے درمیان طویل گفتگو ہوئی ہے۔ اور اللہ کا زکریا علیہ السلام سے یہ قول کہ اللہ نے ان کے لیے یحییٰ علیہ السلام کے وجود کی نشانی یہ بنائی کہ \"أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَةَ أَيَّامٍ إِلَّا رَمْزًا\" (تم تین دن تک لوگوں سے اشارے کے سوا بات نہ کرو)۔ پس اس نے استثناء کیا، اور اس نے صرف کلام کو مستثنیٰ کیا، اور اشارے اور رمز کا اثر موجود ہے، جیسا کہ بولنے میں حروف کی ترتیب کا اثر موجود ہے۔ اور اس میں اللہ کی طرف سے نیابت (نائب ہونا) اور بندے کی طرف سے ذات حق (الحق) کی نیابت کا علم ہے۔ اور کس نے مکمل کیا؟ کیونکہ اسے وکیل بنانے کا حکم دیا گیا، اور اس نے ہم میں سے بعض کو زمین میں خلیفہ بنایا، اور خبر دی کہ ہم اس کے کلام سے بولتے ہیں، اور وہ ہم میں سے کہنے والا ہے جب ہم اپنی بعض باتیں کہتے ہیں۔ اور اس میں اس مناسبت کا علم ہے جو پورے عالم کو شامل ہے، اور یہ کہ وہ ایک ہی جنس ہے، پس اس کے تحت انواع اور اشخاص میں فضیلت دینا صحیح ہے۔ کیونکہ امام ابو القاسم ابن قسی، صاحب \"خلع النعلین\"، نے اس سے منع کیا، پس اس نے اس کے خلاف اعتبار کیا جو ہم نے اعتبار کیا۔ پس وہ اس چیز میں صحیح ہے جس کا اس نے اعتبار کیا، اور ہمارے اعتبار سے غلطی پر ہے، کیونکہ وہاں صرف حق اور احق (زیادہ حقدار) اور کامل اور اکمل ہے۔ پس فضیلت جنس کی انواع میں جاری ہے، اس فضیلت کی وجہ سے جو اسماء میں احاطہ کے ذریعے ہے، اور جس سے یہ اسم دوسرے پر بڑھ جاتا ہے، جیسے \"العالم\" (جاننے والا) اور \"القادر\" (قدرت والا)، اور \"القادر\" اور \"القاہر\" (غالب)۔ اور اس میں عالم میں تاثیرات کا علم ہے۔ اور اس میں اس شخص کا حکم ہے جو اپنے لیے کوئی قدر دیکھتا ہے، اور کیا اگر وہ ایسی چیز لائے جو اس پر دلالت کرے، جبکہ وہ کامل ہے، تو کیا اس کا ایسا کرنا دوسروں پر شفقت کی وجہ سے ہے یا اپنے نفس کی تعظیم کی وجہ سے؟ اور کیا ایسی چیز رضامندی میں اثر انداز ہوتی ہے یا نہیں؟ اور کون زیادہ بلند ہے، وہ جو اپنے نفس کا دفاع کرتا ہے اور اس کی طرف سے حجت لاتا ہے، یا وہ جو اس کی طرف سے حجت نہیں لاتا بلکہ لوگوں کے ساتھ اس کے خلاف ہوتا ہے؟ اور کب انسان کے لیے یہ حکم صحیح ہوتا ہے اور کب یہ حکم صحیح نہیں ہوتا؟ اور اس کا یہ قول: \"وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ * فَاصْبِرْ\" (اور ہم یقیناً جانتے ہیں کہ جو کچھ وہ کہتے ہیں اس سے تمہارا سینہ تنگ ہوتا ہے... پس صبر کرو)۔ اور اس نے یہ نہیں فرمایا کہ اپنے رب کے حکم پر راضی ہو جاؤ۔ اور اس میں حاکموں کے سامنے اپنی عدالت کے لیے انسان کی کوشش کا علم ہے تاکہ اس کی گواہی قبول کی جائے، پس یہ غیر کے حق میں کوشش کے باب سے ہے نہ کہ اپنے نفس کے حق میں، ان امور کی وجہ سے جو پیش آتے ہیں کہ اگر وہ عادل نہ ہو تو حاکم اس کی گواہی قبول نہیں کرے گا، پس شاید باطل حق پر غالب آ جائے، لہٰذا اس کے لیے عدالت میں کوشش کرنا واجب ہوا۔\n\nجیسا کہ آپ نے فرمایا:\n\"أنا سيد الناس يوم القيامة\"\n(میں قیامت کے دن لوگوں کا سردار ہوں)۔\n\nاور آپ کا مقصد فخر نہیں تھا، بلکہ اطلاع دینا اور اپنی امت کو تھکاوٹ سے راحت دینا تھا، تاکہ وہ اس دن اس طرح نہ چلیں جس طرح دوسری امتیں شفاعت کے لیے ایک نبی کے بعد دوسرے نبی کے پاس چلتی ہیں۔ پس وہ محمد صَلَّى اللهُ عَليهِ وسَلَّم پر اکتفا کریں، اس چیز کی وجہ سے جو آپ نے انہیں اس بارے میں بتائی، اور یہ کہ آخری امر میں رجوع آپ ہی کی طرف ہے۔\n\nرأى الأمر يفضي إلى آخر\nفصير آخره أولا\n\n(اس نے دیکھا کہ امر آخر کی طرف لے جاتا ہے\nپس اس نے اس کے آخر کو اول بنا دیا)\n\nپس اس قدر کی وجہ سے امت محمدیہ اس مقام پر دوسری امتوں سے ممتاز ہو گئی، اس کے علاوہ دیگر امور بھی ہیں۔ اور اس میں تمام مخلوق کے لیے امور کے بیان کے مقام کا علم ہے، اور التلبیس (الجھاؤ) کا اٹھ جانا، اور لوگوں اور دیگر مخلوقات کا ذات حق (الحق) کی طرف رجوع کرنا، اور کیا یہ انہیں فائدہ دے گا یا نہیں؟ اور اس میں اس علم کا بیان ہے جس کے ساتھ صرف اللہ کا ہی متصف ہونا صحیح ہے۔ اور اس میں اس علم کا بیان ہے جو اللہ کے لیے واجب ہے اور جو محال ہے۔ اور اس میں اس شخص کا حکم ہے جو اللہ کے نزدیک اس شخص سے مدد چاہتا ہے جسے اللہ نے چھوڑ دیا ہے۔ اور اس میں اس علم کا بیان ہے جو اس شخص کی تعظیم سے شرف چاہتا ہے جس کی طرف وہ منسوب ہے۔ اور اس میں \"المہدی\" (ہدایت یافتہ) اور \"الہادی\" (ہدایت دینے والا) کے درمیان فرق کا علم ہے۔ اور اس میں نبوت عامہ اور نبوت خاصہ کا علم ہے، اور ان میں سے کیا باقی رہتا ہے اور کیا زائل ہو جاتا ہے۔ اور اس میں اس علم کا بیان ہے کہ کیا اس ولی کے لیے جو نبی نہیں ہے، ولایت میں کوئی ایسا مقام ہو سکتا ہے جو کسی نبی کے لیے ذوقاً نہ ہو؟ اور اس میں ظاہری اور باطنی نعمتوں کا علم ہے، اور انسان میں سے کون ان میں سے ہر نعمت سے فائدہ اٹھاتا ہے۔ اور اس میں اللہ کے نزدیک مقربین کی علامات کا علم ہے، اور وہ کس چیز سے پہچانے جاتے ہیں۔ اور اس میں اس علم کا بیان ہے کہ کیا لاحق (بعد میں آنے والا) سابق (پہلے آنے والے) سے مل سکتا ہے، اور ان دونوں منزلوں میں سے کون سی افضل ہے؟ اور اس میں اس شخص کا علم ہے جو یہ سمجھتا ہے کہ آخرت کے احوال دنیا کے احوال کے میزان پر ہیں، تمام امور میں برابر ہیں۔ اور اس میں اس علم کا بیان ہے کہ جنت الاعمال (اعمال کی جنت) کا مالک کس حال پر ہو گا، اور جنت الورث (وراثت کی جنت) کا مالک کس حال پر ہو گا، اور جنت الاختصاص (اختصاص کی جنت) کا مالک کس حال پر ہو گا؟ اور اس میں عالم امر کے امر کے ساتھ خاص ہونے اور عالم انسان کے نہی اور امر کے ساتھ خاص ہونے کا سبب کا علم ہے۔ اور اس میں اس علم کا بیان ہے کہ اللہ نے اپنے کن اسماء میں شرک کی نفی کی، پس ان میں شرک نہیں کیا گیا۔ اور اس میں اس علم کا بیان ہے جو صرف حوالے (الحوالة) سے ہی ادراک کیا جا سکتا ہے۔ اور اس میں جزا اور اس کے مقام کا بھی علم ہے۔ اور اس میں جنت کے راستے کی صفت کا علم ہے اور کون اس پر چلتا ہے۔ اور اس میں اس علم کا بیان ہے کہ جسے اللہ نے دنیا میں لمبی عمر دی، کیا اسے آخرت میں بھی اسی طرح بدلہ دیا جائے گا؟ اور اس میں قیامت کے دن فیصلہ اور قضا کے لیے اللہ کی طرف بلائے جانے میں مخلوق کے احوال کے اختلاف کا علم ہے۔ اور اس میں اس علم کا بیان ہے کہ اللہ کے نزدیک سب سے بڑی ہولناکی کیا ہے، اور اسے صرف انسان ہی لایا ہے، اور وہ اس پر کتنا دلیر ہے، حالانکہ اللہ نے اسے کمزور اور ہر چیز کا محتاج پیدا کیا ہے۔ اور اس میں ولی کا اس شخص کے لیے دشمن بن جانا جو اس کا ولی تھا، اور دشمن کا اس شخص کے لیے ولی بن جانا جو اس کا دشمن تھا۔ اور اس میں علم ضروری، نظری اور بدیہی کا علم ہے۔ اور \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و شصت و پنجم: در معرفت منزل اسراری که در حضرت رحمت به کسی پیوسته است که مقام و حالش بر اکوان (هستی‌ها/مخلوقات) پنهان است، و او از حضرت محمدیه است.\n\nمرتبه پنج‌گانه شناخته شده است *** آنچه را که از عدد فراتر رود، حفظ می‌کند\n\nذکر خدا را از رحمتی حفظ می‌کند *** که برپا شده و مستندی ندارد\n\nجز آنکه اعیان (ذوات) ما را حفظ می‌کند *** و اوست خدای متعالی، صمد (بی‌نیاز)\n\nهر آنچه در هستی از خلق اوست *** از آنِ اوست؛ چون بنده‌ام او را بخواند، سجده کند\n\nاگر او نبود، ما با اعیانمان موجود نمی‌شدیم *** با وجود آنکه او سبحانه نزاده است\n\nپس او با کثرت در حکم خویش *** صفات احدیت از او زایل نشده است\n\nاگر وجود کثرت در حکم او نبود *** وجود عدد از او آشکار نمی‌شد\n\nپس او در مُلک خویش یگانه ذات است *** و حکم او در هستی‌اش مستند است\n\nبه آنچه ما بر هستی خود حمل کردیم *** از نفس خودمان، از فضل او، پرستیده نشد\n\nعزیز است و جز او درکش نمی‌کند *** و جلیل است از اینکه به حکم مدد باقی بماند\n\nپاک است او، پادشاهی قاهر *** که همه و اهل عدد را مقهور ساخته است\n\nبرای هر کس که او را می‌شناسد، بر غیر اکوان (مخلوقات) او *** هیچ تکیه‌گاهی نیست\n\nاز ازل حکم ما برای او صحیح بود *** همچنین حکم او در ابد.\n\n### [همانا الظاهر و الباطن اقتضا کرد که امر وجودی نسبت به ما میان آشکار و پنهان باشد]\n\nبدان، خداوند ما و تو را با روحی از جانب خویش تأیید کند، هنگامی که خداوند خود را الظاهر (آشکار) و الباطن (پنهان) نامید، این امر اقتضا کرد که امر وجودی نسبت به ما میان جلی (آشکار) و خفی (پنهان) باشد. پس آنچه را برای ما آشکار ساخت، جلی است و آنچه را از ما پوشاند، خفی است؛ در حالی که همه اینها برای او تعالی جلی است.\n\nرسول خدا (صلی الله علیه و سلم) در دعای خود فرمود: «بار خدایا، از تو می‌خواهم به هر نامی که خود را بدان نامیدی یا آن را به یکی از مخلوقاتت آموختی.»\n\nو این (اسم) نزد کسی که خداوند آن را به او آموخته، جلی است و از کسی که به او نیاموخته، خفی است.\n\nسپس فرمود: «یا آن را در علم غیب خود به خود اختصاص دادی.»\n\nپس این (اسم) از غیر خدا پنهان است و جز خدا آن را نمی‌داند، زیرا او تعالی «راز» (السر) را می‌داند که همان چیزی است که میان او و خلقش است، و «پنهان‌تر» (أخفی) را می‌داند که جز او کسی آن را نمی‌داند، مانند کلیدهای غیب که نزد اوست و «جز او کسی آنها را نمی‌داند» (لَا يَعْلَمُهَا إِلَّا هُوَ). پس او «دانای غیب» (عَالِمُ الْغَيْبِ) است که همان خفی است، و «شهادت» (الشَّهَادَةِ) است که همان جلی است. و آنچه از ممکنات ایجاد کرده، جلی است و آنچه از آنها ایجاد نکرده، خفی است. و عالم در دنیا و آخرت از این دو نسبت خالی نیست. پس آنچه از عالم در عالم واقع می‌شود، از خفی است و این فزونی (المزید) پیوسته ادامه دارد. پس عالم پیوسته فزونی‌ای است که از خفا به جلا خارج می‌شود. پس جلیِ سؤالِ سؤال‌کنندگان را حق (الحق) تنها از اسم الظاهر می‌شنود و خفیِ آن را از اسم الباطن می‌شنود. پس هنگامی که آنچه را درخواست کرده به او عطا می‌کند، اسم الباطن آن را به الظاهر می‌دهد و الظاهر آن را به سائل می‌دهد. پس الظاهر حاجب الباطن است و جلی حاجب خفی است، همان‌گونه که شعور حاجب علم است.\n\nو بدان که خداوند عز و جل با بندگانش به همان‌گونه رفتار می‌کند که آنان با او رفتار می‌کنند. پس گویی او تعالی به حکم تبعیت از ایشان عمل می‌کند، هرچند آغاز امر از اوست، اما این‌گونه به ما آموخته شده و نزد ما مقرر گشته است؛ زیرا ما جز آنچه را که او به خود نسبت داده، به او نسبت نمی‌دهیم و جز این برای ما ممکن نیست. از جمله احکام تبعیت حق تعالی از مخلوق، این فرموده اوست: «بگو: اگر خدا را دوست می‌دارید، از من پیروی کنید تا خدا شما را دوست بدارد» (قُلْ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ). و فرموده پیامبر (صلی الله علیه و سلم) در صحیح است که: «خداوند خسته نمی‌شود تا زمانی که شما خسته شوید.»\n\nو فرموده تعالی: «پس مرا یاد کنید تا شما را یاد کنم» (فَاذْكُرُونِي أَذْكُرْكُمْ). و فرموده سبحانه: «هر کس مرا در نفس خود یاد کند، من او را در نفس خود یاد می‌کنم، و هر کس مرا در جمعی یاد کند، من او را در جمعی بهتر از آن یاد می‌کنم.»\n\nبنده در هیچ حالی نیست *** مگر آنکه حق (الحق) در مثل آن حال باشد\n\nو همه از اوست، اما *** حکم به این شکل به ما رسیده است.\n\nپس هر کس که با امر حق (الحق) مخالفت کند، با این مخالفت، از حق (الحق) مخالفت با غرض خویش را طلب می‌کند. به همین دلیل، عفو و گذشت و مغفرت از جانب حق، پاداش مخالفت بنده در حق برخی بندگان نیست، بلکه این از باب منت‌گذاری خداوند بر اوست. و اگر هم پاداشی باشد، پاداش کسی است که از بنده مانند خود عفو کرده و از کسی که در دنیایش به او بدی کرده، گذشت نموده و او را بخشیده است. پس حق (الحق) برای او در آن صفت عفو و صفح و گذشت و مغفرت، مثل به مثل و دست به دست، قیام کرده است.\n\nدر خبر صحیح از رسول خدا (صلی الله علیه و سلم) وارد شده است: «خداوند شما را از ربا نهی نکرده است که خود آن را از شما بگیرد.»\n\nپس خداوند بندگانش را از چیزی نهی نکرده، مگر آنکه خود از آن دورتر بوده است؛ و شما را به خلق کریمی امر نکرده، مگر آنکه حق (الحق) به آن سزاوارتر بوده است.\n\n### [منزل میراث معنوی، منزل شریعت است]\n\nو بدان که این منزل، منزل میراث معنوی است و آن منزل شریعت است. و وجود حیات شرط در تمامی وجود نسبت‌های منسوب به خداست. و این نسبت برای او سبحانه ایجاب کرد که اسم «الحی» (زنده) را داشته باشد. پس تمامی اسماء الهی بر آن متوقف و مشروط به آن هستند، حتی اسم «الله». پس اسم «الله» مهیمن بر تمامی اسماء است که «الحی» نیز از جمله آنهاست، و نسبت اسم «الحی» نیز مهیمنیت بر تمامی نسبت‌های اسمائی دارد، حتی نسبت الوهیت که به واسطه آن، «الله» نامیده شده است.\n\nپیامبر (صلی الله علیه و سلم) فرمود: «علما وارثان پیامبران هستند. و آنان دینار و درهمی به ارث نبردند، بلکه علم را به ارث بردند. پس هر کس از آن برگیرد، بهره‌ای وافر برده است.»\n\nو فرمود: «ما جماعت پیامبران، ارث نمی‌بریم و ارث نمی‌گذاریم. آنچه بر جای می‌گذاریم، صدقه است.»\n\nیعنی ارث، همان مالی است که از میت به ارث می‌رسد. پس میراث باقی نماند مگر در علم و حال و بیان آنچه که آنان (علما) در کشف (کشف) خود از خدا یافته‌اند و اهل نظر در نظر خود یافته‌اند. و اینان همان علمایی هستند که از خدا می‌ترسند، زیرا می‌دانند که او حرکات و سکناتشان را به طور معین و مفصل می‌داند، زیرا اوست «آن کس که تو را هنگام برخاستن می‌بیند» (الَّذِي يَرَاكَ حِينَ تَقُومُ) و «گردش تو را در میان سجده‌کنندگان» (وَتَقَلُّبَكَ فِي السَّاجِدِينَ) و در تمامی احوالت می‌بیند. پس پیامبر (صلی الله علیه و سلم) بیان فرمود که پیامبران تقدم دارند و تا زمانی که از این دنیا به سوی خدا بازنگردند، ارث نمی‌گذارند. پس هر آنچه پیرو یک پیامبر خاص در زمان حیات او به دست می‌آورد، انعام و بخششی از آن پیامبر است، نه میراث. و هر آنچه از پیامبری که مرده است به دست آورد، آن علم موروث است. پس هر وارث علمی در هر زمانی، تنها از پیامبران پیش از خود (علیهم السلام) ارث می‌برد، نه از کسی که پس از او آمده است. پس وراثت عالم هر امتی که پیش از رسول خدا (صلی الله علیه و سلم) برای پیامبری بوده، وراثتی جزئی است. اما این امت محمدیه، چون پیامبرش محمد (صلی الله علیه و سلم) آخرین پیامبران بود و امتش بهترین امت‌ها، برای وارثان این امت صحیح است که از او و از تمامی پیامبران (علیهم السلام) ارث ببرند. و این امر هرگز در عالم امت‌های پیشین قبل از این امت رخ نداده است. به همین دلیل، این امت «بهترین امتی است که برای مردم پدیدار شده است» (أَفْضَلَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ)، زیرا بر وارثان دیگر به امری افزوده‌اند که جز این امت به آن نرسیده است. پس علم هر وارث پیامبری، از فیض نوری است که از جانب خدا به ارث برده است، و نظر سبحانه به پیامبرانش کامل‌ترین نظر است، پس علم وارثان کامل‌ترین علوم است. و هر علمی که از طریق وراثت نباشد، علم اختصاصی نیست، مانند علم اصحاب فترات (دوران‌های بی‌پیامبر). علم آنان علم وراثت نیست، هرچند عالم باشند، اما پیرو پیامبری نبوده‌اند، زیرا پیامبری برایشان مبعوث نشده بود و خود نیز پیامبر نبودند. پس نظر پیامبران از جانب خدا برای آنان نبوده است، لذا از درجه وارثان در علم پایین‌ترند، هرچند می‌دانند که خداوند پیامبرانی دارد.\n\nاما کسانی که پیامبران و نبوت را آن‌گونه که در حقیقت خود هست، قبول ندارند و معتقدند که نام پیامبران تنها بر کسی اطلاق می‌شود که جوهر نفس خود را از کدورت‌های شهوات طبیعی پاک کرده و به مکارم اخلاق عرفی ملتزم شده باشد، و چون به این مرتبه برسد، آنچه در عالم علوی از صور بالقوه است در نفس او نقش می‌بندد و او به علم غیوب سخن می‌گوید؛ نبوت نزد ما و در حقیقت خود چنین نیست. البته ممکن است در برخی اشخاص آنچه آنان گفته‌اند وجود داشته باشد، اما با وجود جواز آنچه ذکر کردند مبنی بر نقش بستن صور بالقوه عالم در نفس این شخص، این امر تنها در کلیات واقع می‌شود و در جزئیات امور واقع نمی‌گردد. زیرا آنچه در حرکات افلاک و گردش ستارگان و در آسمان‌ها از علومی است که از آثار آنها ناشی می‌شود، خودِ ستاره و آسمان و فلک و فرشته به آن علم ندارند، اما این شخص چیزی از آن را می‌داند که خودشان نمی‌دانند. و از هیچ پیامبر و حکیمی ذکر نشده است که او به آنچه حالش در هر لحظه تا زمان مرگش در بر دارد، احاطه علمی داشته باشد، بلکه بخشی را می‌داند و بخشی را نمی‌داند. با وجود آنکه می‌دانیم خداوند عز و جل «در هر آسمانی امر آن را وحی کرد» (أَوْحَى‏ فِي كُلِّ سَمَاءٍ أَمْرَهَا) و خداوند علم خود را در مورد خلقش و آنچه تا روز قیامت از آنان سر می‌زند، در لوح محفوظ به ودیعه نهاده است. و اگر از لوح پرسیده شود که چه چیزی در توست یا قلم چه چیزی از علم خداوند عز و جل در تو نگاشته است، لوح نمی‌داند. زیرا خداوند همه آن را در نظر خود برای کسی که پایین‌تر از اوست، به ودیعه نهاده است، و جز خدا کسی نمی‌داند که از آن نظر چه اثری حاصل می‌شود، زیرا اثر نه از نظر، بلکه از استعداد قابل (پذیرنده) ظاهر می‌شود. و به همین دلیل فرمود: «و فرمان ما جز یک امر نیست، مانند یک چشم بر هم زدن» (وَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ كَلَمْحٍ بِالْبَصَرِ). پس بنگر که در یک چشم بر هم زدن، چه چیزهایی را از دیدنی‌ها درک می‌کنی. و این امر اگرچه واحد است، اما به دلیل اختلاف استعداد قابل‌ها در استعداد، در وجود متفاوت است. پس امور را به تفصیل جز خداوند به تنهایی نمی‌داند، و «آنان به چیزی از علم او احاطه ندارند، مگر به آنچه او بخواهد» (وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ).\n\nو هر صاحب مجاهده و خلوت و تصفیه نفسی که بر غیر شریعت باشد و به آن آن‌گونه که در حقیقت خود هست، ایمان نداشته باشد، علمی که بر آن است و با این استعداد می‌یابد، علم میراث نیست و حق (الحق) به او نظر نبوی ندارد، بلکه نهایت امر این است که به اندازه مناسبت خود از ارواح ملکیه دریافت می‌کند و از جانب خدا نیز به اندازه آنچه نظر فکری‌اش به او داده است. زیرا او به هیچ وجه کشف (کشف) از جانب خدا ندارد، چرا که کشف از خصائص پیامبران (علیهم السلام) و پیروان آنهاست، نه از کسانی که به پیامبران قائلند اما از اصحاب تعریف (اهل نظر) هستند و از هیچ یک از آنان به طور معین پیروی نکرده‌اند، و نه کسی که در زمان فترت (بی‌پیامبری) عملی را به خاطر قول پیامبری انجام داده باشد، هرچند عملش با عمل پیامبر موافق باشد، اما قصد او پیروی نبوده است. زیرا القای (علم) به او کمتر از القای به وارثی است که به خاطر قول آن پیامبر عمل می‌کند. و میان این دو علم، فاصله عظیمی است و تمایزی ذوقی و مشهود وجود دارد. خداوند ما و شما را از وارثان قرار دهد.\n\nو هر کس که اعتقاد به نبوت را اظهار کند و احکام ظاهری‌ای را که پیامبر آورده است، به معانی نفسانی‌ای تأویل کند که قصد پیامبر نبوده است، در حالی که آنچه عموم مردم از آن اعتقاد دارند، از او ظاهر شده است، چنین کسی به بهره‌ای از علم دست نمی‌یابد. و کسی که معتقد باشد آنچه این پیامبر آورده است، در ظاهر و عموم، تماماً حق است و علاوه بر ثبوت این معانی، مصرف (تأویل) دیگری نیز دارد، و در نظر خود میان حس و معنی جمع کند، او همان وارث عالمی است که حق (الحق) را آن‌گونه که هست، مشاهده کرده است. و این جز با «تعمّل» (تلاش و تعمق) حاصل نمی‌شود. و معنای تعمّل این نیست که کسی که این اعتقاد را ندارد، آن را از من یا دیگری بشنود و بگوید: «من به آن معتقدم و خود را به آن ملتزم می‌کنم؛ اگر آنچه گفته حق باشد، برای ماست، و اگر نباشد، به من ضرری نمی‌رساند.» چنین کسی نه سودی می‌برد و نه دری برایش گشوده می‌شود، زیرا او به طور قطعی تصدیق‌کننده نیست، بلکه صاحب تجربه است. و ایمان کجا و شک و تجربه کجا؟ این شخص کورباطن و ناقص‌النظر است. زیرا اگر نظر فکری او در ادله صحیح بود، بر وجه دلالت دست می‌یافت و مطلوب برایش روشن می‌شد و امر آن‌گونه که هست، برایش آشکار می‌گشت، همان‌گونه که برای دیگرانی که حق نظر را ادا کردند، آشکار شد. زیرا هنگامی که ناظر حق نظر خود را ادا کند، ایمان مانند سایه به شخص، ملازم او می‌شود، زیرا این دو با هم جفت هستند. او با چشم دلیل بر رتبه این شخص که نبی و شارع نامیده می‌شود، نزد خدا آگاه می‌شود. پس محال است که او را ذوقاً مشاهده کند و حالاً از او پیروی نکند. این چیزی است که قابل تصور نیست.\n\nو به یقین ما به خدا و رسولش و آنچه او به اجمال و تفصیل آورده است، ایمان آوردیم؛ چه آنچه از تفصیل آن به ما رسیده و چه آنچه نرسیده یا نزد ما ثابت نشده است. ما به هر آنچه او در حقیقت امر آورده، مؤمن هستیم. من این را از پدر و مادرم به صورت تقلیدی گرفتم و حکم نظر عقلی در آن، از جواز و احاله (محال بودن) و وجوب، به ذهنم خطور نکرد. پس بر اساس ایمانم به آن عمل کردم تا اینکه دانستم از کجا ایمان آورده‌ام و به چه چیزی ایمان آورده‌ام. و خداوند پرده از بصر و بصیرت و خیال من برداشت. پس با چشم بصر آنچه را که جز با آن درک نمی‌شود، دیدم؛ و با چشم خیال آنچه را که جز با آن درک نمی‌شود، دیدم؛ و با چشم بصیرت آنچه را که جز با آن درک نمی‌شود، دیدم. پس امر برای من مشهود شد و حکم متخیّل و موهومِ تقلیدی، موجود گشت. پس قدر کسی را که از او پیروی کردم، دانستم؛ و او رسول مبعوث به محمد (صلی الله علیه و سلم) است. و تمامی پیامبران را از آدم تا محمد (علیهم السلام) مشاهده کردم. و خداوند مؤمنان به ایشان را، خاص و عام، تا روز قیامت، به من نشان داد. و مراتب تمامی این جماعت را دیدم و قدرهایشان را دانستم. و بر تمامی آنچه به اجمال به آن ایمان آورده بودم و در عالم علوی است، آگاه شدم و همه آن را مشاهده کردم. اما علم آنچه دیدم و معاینه کردم، مرا از ایمانم منحرف نساخت. پس پیوسته آنچه را می‌گویم و انجام می‌دهم، به خاطر قول پیامبر (صلی الله علیه و سلم) است، نه به خاطر علمم، نه به خاطر عینم، و نه به خاطر شهودم. پس میان ایمان و عیان (مشاهده) برادری برقرار کردم. و این در میان پیروان، وجودی کمیاب دارد؛ زیرا لغزشگاه بزرگان در همین‌جاست، هنگامی که معاینه آنچه به آن ایمان آورده شده، رخ می‌دهد، پس بر اساس عین عمل می‌کنند نه بر اساس ایمان. در نتیجه، چون میان این دو جمع نکرده‌اند، از کمال محروم مانده‌اند که قدر و منزلت خود را بشناسند. پس او اگرچه از اهل کشف (کشف) است، اما خداوند قدر و منزلتش را بر او آشکار نکرده است، پس خود را نشناخته و بر اساس مشاهده عمل کرده است. و کامل کسی است که بر اساس ایمان عمل کند، با وجود ذوق عیان (مشاهده)، و عیان او را منتقل نکرده و در او تأثیر نگذاشته باشد. و من برای این مقام، کسی را که ذوقاً به آن رسیده باشد، ندیده‌ام، هرچند می‌دانم که مردانی برای آن در عالم وجود دارند، اما خداوند مرا با آنان در رؤیت اعیان و اشخاص و نام‌هایشان جمع نکرده است. پس ممکن است برخی از آنان را دیده باشم، اما میان عین و نامش جمع نکرده باشم. و سبب این امر آن بود که من هرگز نفس خود را به جانب حق (الحق) معلّق نکردم که مرا بر کونی از اکوان یا حادثه‌ای از حوادث آگاه سازد، بلکه نفس خود را با خدا معلّق کردم که مرا در آنچه او را خشنود می‌سازد، به کار گیرد و در آنچه مرا از او دور می‌کند، به کار نگیرد؛ و مرا به مقامی اختصاص دهد که برای هیچ پیرو دیگری بالاتر از آن نباشد، و اگر تمامی اهل عالم نیز در آن با من شریک شوند، متأثر نشوم. زیرا من بنده محض هستم و برتری بر بندگان او را نمی‌طلبم، بلکه خداوند در نفس من چنان شادی‌ای قرار داده که آرزو می‌کنم تمام عالم در بالاترین مراتب بر یک قدم باشند. پس خداوند مرا به خاتمه امری اختصاص داد که هرگز به ذهنم خطور نکرده بود. پس خداوند تعالی را با عجز از شکرش، شکر کردم، با وجود آنکه حق شکر را ادا نمودم. و آنچه از حال خود ذکر کردم، به خاطر فخر نیست، نه به خدا، بلکه به دو دلیل ذکر کردم: اول، به خاطر فرموده تعالی: «و اما نعمت پروردگارت را بازگو کن» (وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ). و چه نعمتی بزرگ‌تر از این؟ و دوم، تا صاحب همتی بشنود و در او همتی ایجاد شود تا نفس خود را در آنچه من به کار گرفتم، به کار گیرد و به مانند این دست یابد و با من و در درجه من باشد. زیرا هیچ تنگی و حرجی نیست، مگر در محسوس و به ویژه در الوهیت. و به همین دلیل، حکم غیرت تنها به این دو مقام تعلق می‌گیرد. اما محسوس، به دلیل محصور بودن آن است؛ زیرا اگر چیزی نزد تو باشد، عین همان نزد دیگری نیست. و اما در الوهیت، مدعی آن دروغگوست و کسی که الوهیت از آن اوست، راستگوست. پس متعلق غیرت، بودن کسی است که الوهیت در او نیست و به دروغ ادعای آن را می‌کند. پس غیرت بر مقام است، زیرا آن مقام تنها برای یک نفر است و دیگری در آن قدمی ندارد. و غیرت مشتق شده از «غیر» است. پس من راه راست (سواء السبیل) را برای تو بیان کردم.\n\n### [همانا پاکیزه‌ترین علمی که به ارث می‌رسد، علمی است که عالم به ارث می‌برد]\n\nو بدان که پاکیزه‌ترین علمی که به ارث می‌رسد، علمی است که عالم از اسماء الهی به ارث می‌برد. اگر بگویی: چگونه اسماء الهی به ارث می‌رسند، در حالی که ارث جز پس از مرگ نیست؟ می‌گوییم: من نیز همین را می‌گویم. پس بدان که منظور من از این نوع علم، این است که حق (الحق) سبحانه قادر است که کاری را از ابتدا انجام دهد که آن را انجام نمی‌دهد و جز از طریق تو واقع نشده است، همان‌گونه که بیان کردیم تو آلت و ابزار او تعالی هستی. پس چون آنچه از تو صادر شده، ناگزیر چیزی است که می‌تواند برای او بدون تو باشد، و محال است که آنچه از تو صادر شده، دو وجود داشته باشد، زیرا موجود، دو وجود را نمی‌پذیرد، بلکه یک وجود واحد است. پس این مقدار از وجودی که از تو ظاهر شده و از آنِ او بوده است، منزلت مال موروث را از کسی که آن مال از آن او بوده، پیدا می‌کند، زیرا محال است که آن مال با مرگ او همچنان از آن او باشد، همان‌گونه که محال است این موجود از غیر کسی که از او صادر شده، باشد. پس این نکته را دریاب، زیرا در نزد صاحبان ذوق (اهل ذوق) شگفت‌انگیز است، نه در احکام عقل.\n\n### [اسم الهی الحی (زنده)]\n\nو بدان که چون هیچ اسمی از اسماء الهی نتوانست بر اسم الهی «الحی» (زنده) پیشی گیرد، رتبه سبقت از آن او شد. پس او در حقیقت به «الأول» (نخستین) وصف می‌شود. پس هر زنده‌ای در عالم، و در عالم جز زنده نیست، فرعی از این اصل است. و همان‌گونه که فرع به دلیل میوه‌ای که حمل می‌کند و تصرفاتی که هواها با اختلاف بر آن ظاهر می‌سازند و حال برهنگی و پوششی که هنگام برگ دادن و برگ‌ریزان می‌پذیرد، شبیه اصل نیست، و اصل چنین نیست، بلکه اصل است که فرع را با هر آنچه در آن و به واسطه آن ظاهر می‌شود، مدد می‌رساند، زیرا بقای فرعیت و احکام آن جز به اصل نیست؛ همچنین اسم «الحی» با سایر اسماء الهی چنین است. پس اگر حقیقت امر را دریابی، هر اسمی از آنِ اوست و سرّ آن در تمام عالم جاری می‌شود. پس عالم بر صورت او خارج شد در آنچه از تسبیح به حمدش به او نسبت داده شده است. و تسبیح، تنزیه است و تنزیه، تعریه (برهنه ساختن). و همچنین اصل از لباس‌های فروع و زینت‌های آنها از برگ و میوه برهنه است. و همه اینها از اوست، در حالی که او در ذات خود منزه از آن است که اینها به او قائم باشند. پس او چیزی را عطا کرده که به او قائم نیست و صفت او نمی‌باشد. و این علمی است که جز برای صاحب کشف (کشف) حاصل نمی‌شود. و هنگامی که برای او حاصل شود، نمی‌تواند عالم را به زنده و غیر زنده تقسیم کند، بلکه نزد او همه عالم زنده است. اما نزد ما، حیات به هر زنده‌ای بر حسب حقیقت موصوف به آن، نسبت داده می‌شود؛ نزد اهل کشف (کشف) و شهود (شهود)، نه نزد کسی که حیات را جز در غیر جماد و نامی (رشدکننده) نمی‌بیند. سخن ما تنها با اهل کشف است که خداوند امر را آن‌گونه که در حقیقت خود هست، به آنان نشان داده است. پس این را بدان.\n\nو بدان که چون اسم «الحی» (زنده) اسمی ذاتی برای حق (الحق) سبحانه بود، ممکن نبود که جز زنده از او صادر شود. پس تمام عالم زنده است، زیرا نبود حیات یا وجود موجودی از عالم که زنده نباشد، به هیچ وجه مستند الهی در وجود خود ندارد، در حالی که هر حادثی ناگزیر مستندی دارد. پس جماد در نظر تو، در حقیقت امر زنده است. و اما مرگ، مفارقت یک زنده تدبیرکننده از یک زنده تدبیرشونده است. پس تدبیرکننده و تدبیرشونده هر دو زنده‌اند، و مفارقت نسبتی عدمی است نه وجودی؛ بلکه تنها عزل از ولایت است. سپس، شرط زنده بودن، احساس کردن نیست، زیرا احساس و حواس امری معقول و زائد بر زنده بودن است. بلکه شرط آن، علم است. و ممکن است احساس کند و ممکن است احساس نکند. و اگر هم احساس کند، وجود آلام و لذات شرط احساس نیست، زیرا علم از آن بی‌نیاز می‌کند. با وجود آنکه عالم به آنچه عادت بر این است که جز با حس درک نمی‌شود، احساس نمی‌کند. و تو و تمامی عقلا می‌دانید که خداوند به هر چیزی عالم است، با تنزیه او از احساس و حواس. پس برای حصول علم، نزد کسی که علم می‌آموزد، راه‌های بسیاری وجود دارد. و حس راهی است که به علم به محسوس می‌رساند. پس ممکن است علم به آن از غیر طریق حس نیز حاصل شود و در هر دو حالت معلوم باشد، اما برای کسی که آن را از غیر طریق حس دانسته، محسوس نیست، بلکه برای او مشهود و معلوم است. همان‌گونه که شک نداریم که پروردگارمان را با چشم‌ها آشکارا می‌بینیم، آن‌گونه که شایسته جلال اوست، و او برای ما مرئی است، اما نمی‌گوییم محسوس است، زیرا حس، حصر و تقیید را طلب می‌کند. پس این رؤیتی است که کیفیت ندارد. و سخن ما در این باره با کسی است که به رؤیت با بصر قائل است، و ما قائل به کیفیت و حصر و تقیید نیستیم، بلکه او را منزه می‌بینیم، همان‌گونه که او را منزه دانسته‌ایم. و ما در مواضع دیگر این کتاب، تصحیح هر اعتقادی و صحت هر مقاله‌ای عقلی در مورد خدا را بیان کرده‌ایم. اما مقالات شرعی که از جانب خدا در مورد او نازل شده است، ایمان به آنها واجب است و نیامده‌اند که با عقل مخالفت کنند، زیرا با عقل در «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْءٌ) موافقت کرده‌اند. و همچنین با آنچه دلیل عقل از جهت نظر خود نمی‌پذیرد، آمده‌اند، پس علم به او را افزوده‌اند که عقل پیش از آن به تنهایی قادر به درک آن نبود، چه از طریق ایمان به خبر باشد و چه از طریق ذوق (ذوق) اگر از شهود (شهود) باشد. و ما آنچه را که او خود را بدان وصف کرده است، از هر آنچه عقل به تنهایی در نظر خود قادر به درک آن نیست، تسلیم کرده‌ایم، زیرا ما به ذات او احاطه علمی نداریم، بلکه اصلاً آن را نمی‌دانیم.\n\nو چون اعیان (ذوات) در هستی (الوجود) با یکدیگر اتصال و انفصال دارند، خداوند این را نشانه‌ای قرار داد برای کسی که کشف (کشف) ندارد، بر اینکه عالم با خدا از یک جهت اتصال معنوی و از جهتی انفصال دارد. پس او از جهت حقیقت ذات و الوهیت و فاعلیت خود، متصل و منفصل است از یک وجه واحد، و آن وجه، عین اوست، زیرا او کثرت نمی‌پذیرد، هرچند احکام و اسماء و معقولات اسماء او کثیر باشند. پس اتصال او، خلق کردن ما با «دو دست» (بیدیه) اوست: «چه چیز تو را بازداشت از اینکه سجده کنی برای آنچه با دو دست خود آفریدم؟» (مَا مَنَعَكَ أَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ)، «و برای آنان از آنچه دست‌های ما عمل کرده، چهارپایانی آفریدیم، پس آنان مالک آن هستند» (خَلَقْنَا لَهُمْ مِمَّا عَمِلَتْ أَيْدِينَا أَنْعَامًا فَهُمْ لَهَا مَالِكُونَ). و انفصال او، انفصال الوهیت از عبودیت است: «هیچ معبودی جز او نیست» (لَا إِلَهَ إِلَّا هُوَ)، «العزیز» (عزیز) به واسطه انفصالش، «الحکیم» (حکیم) به واسطه اتصالش. اما تکوین از عالم جز با اتصال او صورت نمی‌گیرد، نه با انفصال او. و عالم آنچه را که خداوند او را به آن مکلف کرده است، از عبادات انجام می‌دهد، و به همین دلیل اعمال آن را به بنده نسبت داده و به او امر کرده است که در آن از خدا یاری بخواهد، همان‌گونه که او (بنده) در برخی افعال، آلت و ابزار حق (الحق) است، و آلات در آنچه جز با آلت ساخته نمی‌شود، یاری‌دهنده صانع هستند. و عالم به حد و حقیقت خود از حق (الحق) منفصل است، پس او از یک عین واحد، منفصل و متصل است، زیرا در عین خود کثرت نمی‌پذیرد، هرچند احکام او کثیر باشند، زیرا آنها نسبت‌ها و اضافات عدمی معلوم هستند. پس عالم بر صورت حق (الحق) خارج شد. و از واحد جز واحد صادر نشده است، و آن عین ممکن است. و کثرت، یعنی احکام او، جز از کثرت صادر نشده است، و آن احکام منسوب به حق (الحق) است که با اسماء و صفات تعبیر می‌شوند. پس کسی که به عالم از جهت عین آن بنگرد، به احدیت آن قائل می‌شود، و کسی که از جهت احکام و نسبت‌های آن بنگرد، به کثرت در یک عین واحد قائل می‌شود. و همچنین نظر او در حق (الحق) چنین است؛ او واحد کثیر است، همان‌گونه که «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْءٌ) و «او شنوای بیناست» (وَهُوَ السَّمِيعُ الْبَصِيرُ). و تنزیه کجا و تشبیه کجا؟ در حالی که آیه یکی است و آن سخن او از خود است به جهت تعریف ما به آنچه او در ذات خود بر آن است. پس با «لیس» (نیست) فصل داد و با «هو» (او) اثبات کرد. و اما ندای او تعالی به عالم و ندای عالم به او، از جهت انفصال است. پس او ندا می‌دهد: «ای مردم» (يَا أَيُّهَا النَّاسُ)، و ما ندا می‌دهیم: «ای پروردگار ما» (یا ربنا). پس او خود را از ما جدا کرد، همان‌گونه که ما نیز خود را از او جدا کردیم، پس متمایز شدیم. و این مقام کجا و مقام اتصال کجا، هنگامی که ما را دوست بدارد و گوش و چشم و تمامی قوای ما باشد، و این را هنگامی که به ما خبر داد، اتصال محب به محبوب قرار داد. پس محبت را به خود نسبت داد و ما محبوبان هستیم. و تفاوت میان احکام و منزلت محب و احکام و منزلت محبوب پنهان نیست. پس ما به واسطه او رفعت یافتیم و او سبحانه به واسطه ما نزول کرد. و این برای آن است که هستی (الوجود) بر یکسان نباشد، زیرا تساوی در آن محال است. پس ناگزیر در آن نزول و رفعتی وجود دارد. و در آنجا جز ما و او نیست. پس اگر حکم یکی نزول باشد، حکم دیگری رفعت و علو خواهد بود. و هر محبی نازل است و هر محبوبی عالی. و هیچ یک از ما نیست مگر اینکه محب و محبوب است. پس «هیچ یک از ما نیست مگر اینکه مقامی معلوم دارد» (مَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ). و هیچ یک از ما نیست مگر اینکه نازل و عالی است. پس اینها احکام مختلف در یک عین واحد هستند.\n\nای مؤمنان، تقوا پیشه کنید *** و ای پروردگار ما، از چه چیزی تقوا پیشه کنیم؟\n\nپس ندا داد و من با پرسش ندا دادم *** و ندانستم چه کسی رفت و چه کسی ماند\n\nو حکم من بر حکم او تقسیم شد *** پس یا سعادتمند است و یا شقی\n\nپس در حکم خود راضی می‌شود و خشم می‌گیرد *** و اگر تقوا پیشه کنیم، شقی می‌شود و سعادتمند\n\nپس تاج‌ها کجا و پای او کجا *** و نعلین‌ها کجا و فرق سر کجا؟\n\nپس در این و آن، مانند خود ظاهر می‌شود *** تا بندگان آنچه را که او یافته، بیابند\n\nاگر آنچه گفتم واقع شدنی است *** پس بنده دانست که از چه باید پرهیز کند.\n\n### [قرب مفرط (بیش از حد) حجاب است]\n\nو بدان، خداوند تو را تأیید کند، که در این منزل از علوم، علم حجاب‌هایی است که به محجوب متصل هستند، زیرا قرب مفرط (بیش از حد) حجاب است، مانند بُعد مفرط (بیش از حد). و در آن، علم همنشینی بنده با پروردگارش هنگامی که او را ذکر می‌کند، وجود دارد. و تقسیم اهل ذکر در این باره به کسی که می‌داند در حین ذکر حق (الحق)، جلیس اوست، و کسی که این را نمی‌داند. و سبب جهل او به همنشینی با پروردگارش این است که پروردگارش را نمی‌شناسد تا او را تمییز دهد، یا نمی‌داند که پروردگارش او را ذکر کرده است، به دلیل کری‌ای که در اوست و پرده‌ای که بر دیده‌اش افتاده است. زیرا ذاکر صحیح می‌داند که پروردگارش چه زمانی او را یاد می‌کند، هرچند همنشینی با پروردگارش را شهوداً نداند. و دیگری این را می‌داند و جلیس خود را مشاهده می‌کند. پس همان‌گونه که حق (الحق) جلیس کسی است که او را ذکر کند، بنده نیز جلیس حق است هنگامی که پروردگارش او را ذکر کند. و در هر دو حالت، جز بنده با او همنشین نمی‌شود، و اگر هم با او همنشین شود، عبودیتش زایل نشده است، زیرا عین او زایل نشده است. چون نهایت قرب این است که حق (الحق) گوش و چشم او باشد، پس عین او را اثبات کرده است، و عین او چیزی جز عبودیتش نیست. و در آن، علم تفاوت میان همنشینی حق تعالی در خلوت و جلوت وجود دارد؛ آیا صورت در آن یکی است یا با تنوع مجالس، متنوع می‌شود؟ و در آن، علم آنچه جلیس حق با حق (الحق) در میان می‌گذارد و اینکه این در چه صورتی خواهد بود، وجود دارد. زیرا مشاهده برای بهت (حیرت) است. پس آیا هر مشاهده‌ای برای بهت است یا بهت تنها در برخی مشاهدات رخ می‌دهد؟ و ناگزیر باید دانست که متجلی، خداوند تعالی است. و در آن، علم این است که هر کس خدا را بخواند، هر که باشد، شقی نمی‌شود، و من هیچ کس را استثنا نمی‌کنم. و اگر دعا کننده به دلیل عارضی شقی شود، سرانجام به سعادت ابدی است. و در آن، علم حکم کسی که از غیر خدا به واسطه خدا می‌ترسد، نزد خدا چیست؟ و این مقام عزیزی است، زیرا او به واسطه خدا ترسیده است. و کسی که حالش چنین است، جز خدا را نمی‌بیند، پس چگونه از غیر خدا می‌ترسد؟ خداوند تعالی می‌فرماید: «پس از آنان نترسید و از من بترسید، اگر مؤمن هستید» (فَلَا تَخَافُوهُمْ وَخَافُونِ إِنْ كُنْتُمْ مُؤْمِنِينَ). و در آن، علم کسی که از خدا به واسطه غیر، طلب امان می‌کند، وجود دارد؛ آیا او درستکار و صاحب علم است یا خطاکار و صاحب جهل؟ و آیا از خدا به خاطر ذاتش می‌ترسد یا به خاطر آنچه از او صادر می‌شود؟ اگر متعلق ترس، آنچه از او صادر می‌شود باشد، پس متعلق آن، چیزی است که به واسطه تو قائم می‌شود. و در آن، علم تأثیر عادات در بزرگان اهل شهود (شهود) وجود دارد؛ چرا با وجود علمشان به اینکه او «بر هر چیزی تواناست» (عَلَى كُلِّ شَيْءٍ قَدِيرٌ)، باز می‌گردند؟ پس مشهود آنان چیست؟ آیا مشهود آنان «هر چه بخواهد انجام می‌دهد» (فَعَّالٌ لِمَا يُرِيدُ) است و آنان نسبت به آنچه در اراده حق (الحق) برایشان است، جاهل هستند؟ پس عادات در آنان به واسطه حالشان در این مقامی که اراده الهی عطا می‌کند، تأثیر می‌گذارد. و در آن، علم این است که آیا همه امور نسبت به خدا یکسان هستند یا یکسان نیستند؟ و اگر یکسان نیستند، چه سببی آنها را از یکسان بودن خارج کرده است؟ خداوند تعالی می‌فرماید: «و اوست که آفرینش را آغاز می‌کند، سپس آن را باز می‌گرداند، و این بر او آسان‌تر است» (وَهُوَ الَّذِي يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ). و فرموده او: «و برای او مثل اعلی در آسمان‌ها و زمین است» (وَلَهُ الْمَثَلُ الْأَعْلَى فِي السَّمَاوَاتِ وَالْأَرْضِ). پس این همان فرموده اوست: «آفرینش آسمان‌ها و زمین بزرگ‌تر از آفرینش مردم است» (لَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ). آغاز آفرینش آسمان‌ها و زمین بزرگ‌تر از آفرینش مردم است، و بازگرداندن آنان آسان‌تر از آغاز آفرینششان است، و آغاز آفرینششان آسان‌تر از خلق آسمان‌ها و زمین است. پس خلق آسمان‌ها و زمین از نظر قدر بزرگ‌تر از خلق مردم است، زیرا مردم بر آن دو حق ولادت دارند، پس مردم منفعل از آن دو هستند، چرا که جرمیت در اینجا مورد نظر نیست. زیرا فرمود: «ولی بیشتر مردم نمی‌دانند» (وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ). و هیچ کس نیست مگر اینکه حساً می‌داند که خلق آسمان‌ها و زمین از نظر جرم بزرگ‌تر از خلق مردم است، و در آنجا جز انفعال جسم طبیعی از آن دو نیست و بس. و در آن، علم آغاز هر عین در هستی آن است، پس برای آن مثال پیشینی وجود ندارد. و در آن، علم فرد اول که اولین افراد است، وجود دارد. و در آن، علم آنچه کلام نامیده می‌شود، وجود دارد، زیرا این مسئله اختلافی است که سخن در آن میان اهل نظر طولانی شده است. و فرموده خداوند به زکریا (علیه السلام) هنگامی که خداوند برای او نشانه‌ای بر وجود یحیی (علیه السلام) قرار داد: «که سه روز با مردم سخن نگویی، مگر با رمز و اشاره» (أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَةَ أَيَّامٍ إِلَّا رَمْزًا). پس استثنا کرد، و آنچه استثنا کرد جز کلام نبود، در حالی که اثر از اشاره و رمز موجود است، همان‌گونه که از نظم حروف در نطق موجود است. و در آن، علم نیابت از خدا و نیابت حق (الحق) از بنده وجود دارد. و کسی که کامل است، امر شده است که وکیلی بگیرد. و برخی از ما را خلیفه در زمین قرار داد و خبر داد که ما به کلام او سخن می‌گوییم و اوست که از ما سخن می‌گوید هنگامی که برخی از اقوال خود را می‌گوییم. و در آن، علم مناسبتی وجود دارد که تمام عالم را در بر می‌گیرد و اینکه عالم یک جنس واحد است، پس مفاضله (برتری دادن) در انواع و اشخاص زیر آن صحیح است. زیرا امام ابوالقاسم بن قسی، صاحب کتاب *خلع النعلین*، از این امر منع کرد. پس او خلاف آنچه ما در نظر گرفتیم، در نظر گرفت. او در آنچه در نظر گرفت، مصیب است و به اعتبار ما مخطئ، زیرا در آنجا جز حق و احق و کامل و اکمل نیست. پس مفاضله در انواع جنس، به دلیل مفاضله‌ای که در اسماء به واسطه احاطه وجود دارد، جاری است، و آنچه این اسم بر غیر خود می‌افزاید، مانند «العالم» (دانا) و «القادر» (توانا)، و مانند «القادر» و «القاهر» (چیره). و در آن، علم تأثیرات در عالم وجود دارد. و در آن، علم حکم کسی که برای خود قدری قائل است، وجود دارد. و آیا اگر او که کامل است، کاری را انجام دهد که بر قدر او دلالت کند، انجام دادن آن از روی شفقت بر غیر است یا تعظیم نفس خود؟ و آیا چنین امری در رضایت تأثیر می‌گذارد یا تأثیر نمی‌گذارد؟ و چه کسی برتر است؟ کسی که از نفس خود احتجاج می‌کند و دفاع می‌نماید، یا کسی که از آن احتجاج نمی‌کند، بلکه با مردم بر علیه آن است؟ و چه زمانی برای انسان شایسته است که این حکم را داشته باشد و چه زمانی شایسته است که این حکم را نداشته باشد؟ و فرموده او: «و به یقین می‌دانیم که سینه‌ات به سبب آنچه می‌گویند، تنگ می‌شود... پس صبر کن» (وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ ... فَاصْبِرْ)، و نفرمود: «پس به حکم پروردگارت راضی باش.» و در آن، علم تلاش انسان برای عدالت خود نزد حاکمان برای پذیرش شهادتش وجود دارد. پس این از باب تلاش در حق غیر است، نه در حق نفس خود، به دلیل اموری که عارض می‌شوند؛ اگر عادل نباشد، حاکم شهادتش را نمی‌پذیرد، پس چه بسا باطل بر حق ظاهر شود. لذا تلاش برای عدالت به این دلیل واجب است، همان‌گونه که فرمود: «من سرور مردم در روز قیامت هستم.» و قصد فخر نداشت، بلکه قصد آگاه ساختن و آسوده کردن امتش از سختی بود، تا در آن روز مانند امت‌ها به دنبال پیامبری پس از پیامبر دیگر برای شفاعت نروند، بلکه به محمد (صلی الله علیه و سلم) اکتفا کنند، به واسطه آنچه او به آنان از این امر آگاه ساخت و اینکه بازگشت در آخر امر به سوی اوست. «امر را دید که به آخری می‌انجامد *** پس آخر آن را اول قرار داد.» پس امت محمدیه در آن موطن به این مقدار از سایر امت‌ها متمایز شد، علاوه بر امور دیگر. و در آن، علم موطن بیان امور برای تمامی خلق و برداشته شدن تلبیس (اشتباه‌اندازی) و بازگشت مردم و غیر ایشان به حق (الحق) وجود دارد، و اینکه آیا این برایشان سودمند است یا خیر. و در آن، علم آنچه جز برای خدا صحیح نیست که بدان وصف شود، وجود دارد. و در آن، علم آنچه بر خدا واجب است و آنچه محال است، وجود دارد. و در آن، علم حکم کسی که از کسی که خداوند او را خوار کرده است، نزد خداوند تعالی یاری می‌جوید، وجود دارد. و در آن، علم کسی که با تشریف کسی که به او منسوب است، شرف می‌خواهد، وجود دارد. و در آن، علم تفاوت میان المهدی (هدایت‌یافته) و الهادی (هدایت‌کننده) وجود دارد. و در آن، علم نبوت عامه و نبوت خاصه و آنچه از آنها باقی می‌ماند و آنچه زایل می‌شود، وجود دارد. و در آن، علم این است که آیا برای ولی‌ای که نبی نیست، مقامی در ولایت وجود دارد که ذوقاً برای نبی نباشد یا خیر. و در آن، علم این است که نعمت‌های ظاهره و باطنه کدامند و کدام انسان از هر یک از آنها متنعم می‌شود. و در آن، علم علامات مقربان نزد خدا و اینکه با چه چیزی شناخته می‌شوند، وجود دارد. و در آن، علم این است که آیا لاحق (کسی که دیرتر می‌آید) به سابق (کسی که زودتر می‌آید) می‌رسد و کدام یک از این دو منزلت برتر است. و در آن، علم کسی که معتقد است احوال آخرت بر میزان احوال دنیاست و در تمامی امور یکسان است، وجود دارد. و در آن، علم آنچه شایسته است صاحب جنة الأعمال (بهشت اعمال) بر آن باشد، و آنچه صاحب جنة الورث (بهشت میراث) بر آن باشد، و آنچه صاحب جنة الاختصاص (بهشت اختصاص) بر آن باشد، وجود دارد. و در آن، علم سبب اختصاص عالم امر به امر و عالم انسان به نهی و امر وجود دارد. و در آن، علم آنچه خداوند از اسماء خود نفی کرده است که در آن شریک داشته باشد، پس شریکی نداشته است، وجود دارد. و در آن، علم آنچه جز با حواله (ارجاع) درک نمی‌شود، وجود دارد. و در آن، علم جزا و محل آن نیز وجود دارد. و در آن، علم صفت راه به سوی بهشت و کسی که آن را می‌پیماید، وجود دارد. و در آن، علم این است که آیا کسی که خداوند در دنیا به او طول (عمر) داده است، در آخرت نیز به عنوان جزا به او طول می‌دهد. و در آن، علم اختلاف احوال خلق در استدعا به سوی خداوند تعالی در روز قیامت برای فصل و قضا وجود دارد. و در آن، علم این است که بزرگ‌ترین اهوال (ترس‌ها) نزد خدا چیست و جز انسان خاصی آن را نیاورده است، و چه چیزی او را بر این امر جرأت داده است، در حالی که خداوند او را ضعیف و نیازمند به هر چیزی آفریده است. و در آن، علم انقلاب ولی به دشمن برای کسی که ولی او بوده و انقلاب دشمن به ولی برای کسی که دشمن او بوده، وجود دارد. و در آن، علم علم ضروری و نظری و بدیهی وجود دارد. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 7
}