{
  "id": 133,
  "title": {
    "ar": "الباب الثالث والثلاثون ومائة في مقام ترك الاستقامة",
    "en": "Chapter 133: Concerning the Station (مقام) of Abandoning Steadfastness (الاستقامة)",
    "ur": "ایک سو تینتیسواں باب: مقام ترک استقامت کے بیان میں",
    "fa": "باب صد و سی و سوم: در مقام ترک استقامت"
  },
  "content": {
    "ar": "## (الباب الثالث والثلاثون ومائة في مقام ترك الاستقامة)\n\n\n> أَلا إِلَى الله تَصِيرُ الْأُمُورُ *** فلا تغرنك دار الغرور\n\n\n> وكل ما خالف ما قاله *** سبحانه فإنه قول زور\n\n\n> فكل معوج له غاية *** إليه حقا في جميع الأمور\n\n\n> فلا تعين واحدا أنه *** حكم بجهل حاصل أو قصور\n\n\n> فصلت الأشياء أغراضنا *** إلى سعيد وإلى من يبور\n\n\n> ورجع الكل إلى قوله *** أَلا إِلَى الله تَصِيرُ الْأُمُورُ\n\n\n### [ترك الاستقامة من أعلام الإقامة]\n\n\nاعلم علمك الله أن ترك الاستقامة من أعلام الإقامة عند الله والحضور معه في كل حال كما\n\n\nقالت عائشة أم المؤمنين رضي الله عنها في حق النبي صَلَّى اللهُ عَليهِ وسَلَّم من أنه كان يذكر الله على كل أحيانه‏\n\n\nفهو في الدنيا موصوف بصفة أرض الآخرة لا تَرى‏ فِيها عِوَجاً ولا أَمْتاً ولما كانت الاستقامة تتميز بالاعوجاج ولا اعوجاج فلا استقامة مشهودة\n\n\n> فالكل في عين الوجود *** على طريق واحد\n\n\n> والكل في عين الرضي *** من مؤمن أو جاحد\n\n\n### [الإمكان للعالم نعت ذاتى له فالميل له ذاتى فلا استقامة]\n\n\nوقد يكون مشهد صاحب هذا الشهود النظر في إمكان العالم والإمكان سبب مرضه والمرض ميل والميل ضد الاستقامة والإمكان للعالم نعت ذاتي لا يتصور زواله لا في حال عدمه ولا في حال وجوده فالمرض له ذاتي فالميل له ذاتي فلا استقامة فالعالم مرضه زمانة لا يرجى رفعها إلا إن الكون محل لوجود المغالطات لأمور تقتضيها الحكمة ويطلبها العقل السليم لعلمه بما يصلح الكون إذ شرع التكليف ولم يكن في الوسع أن تكون آحاد العالم على مزاج واحد فلما اختلفت الأمزجة كان في العالم العالم والأعلم والفاضل والأفضل فمنه من عرف الله مطلقا من غير تقييد ومنهم من لا يقدر على تحصيل العلم بالله حتى يقيده بالصفات التي لا توهم الحدوث وتقتضي كمال الموصوف ومنهم من لا يقدر على العلم بالله حتى يقيده بصفات الحدوث فيدخله تحت حكم ظرفية الزمان وظرفية المكان والحد والمقدار\n\n\n### [تنزلت الشرائع الإلهية على حسب الأمزجة الإنسانية والكامل المزاج من عقد كل اعتقاد]\n\n\nولما كان الأمر في العلم بالله في العالم في أصل خلقه وعلى هذا المزاج الطبيعي المذكور أنزل الله الشرائع على هذه المراتب حتى يعم الفضل الإلهي جميع الخلق كله فأنزل ليس كمثله شي‏ء وهو لأهل العلم بالله مطلقا من غير تقييد وأنزل قوله تعالى أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً وهُوَ عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ فَعَّالٌ لِما يُرِيدُ وهُوَ السَّمِيعُ الْبَصِيرُ والله لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ وفَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله وهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ وهذا كله في حق من قيده بصفات الكمال وأنزل تعالى من الشرائع قوله الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ وهُوَ الله في السَّماواتِ وفي الْأَرْضِ وتَجْرِي بِأَعْيُنِنا ولَوْ أَرَدْنا أَنْ نَتَّخِذَ لَهْواً لَاتَّخَذْناهُ من لَدُنَّا فعمت الشرائع ما تطلبه أمزجة العالم ولا يخلو المعتقد من أحد هذه الأقسام والكامل المزاج هو\nالذي يعم جميع هذه الاعتقادات ويعلم مصادرها ومواردها ولا يغيب عنه منها شي‏ء فمثل هذا لا تتعين له الاستقامة لأنه لا يرى لهذه الحال ضدا تتميز به هذه الحالة لأنه فيها والكون إذا كان في الشي‏ء لا يدركه عينا ورؤية بصر وإن عرفه كما لا يدرك الهواء للقرب المفرط كذلك لا يدرك الحق للقرب المفرط فإنه أقرب إلينا من حَبْلِ الْوَرِيدِ ف لا تُدْرِكُهُ الْأَبْصارُ\n\n\n### [سبحان من خلق العالم للسعادة لا للشقاء وكان الشقاء فيه عرضا عرض‏]\n\n\nفسبحان من خلق العالم للسعادة لا للشقاء فكان الشقاء فيه عرضا عرض له ثم يزول وذلك لأن الله تعالى ما خلق العالم لنفس العالم وإنما خلقه لنفسه فقال فيه وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ ونحن من الأشياء ثم قال في حقنا وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فما من أحد منا يتعزز على الله ولا يتكبر عليه وإن تكبر بعضنا على بعض وما من صاحب نحلة ولا ملة ولا نظر إلا وتسأله عن طلبه فتجده مستوفر الهمة على طلب موجدة لأنه خلقه للمعرفة به واختلفت أحوالهم في إدراك مطلوبهم لاختلاف أمزجتهم ونزلت الشرائع تصوب نظر كل ناظر ويتجلى لأهل الكشوف والكل أهل كشف لكن بعضهم لا يدري أن مطلوبه قد أدركه وهو الذي خشع له وآخر قد علم أنه لا يرى سوى مطلوبه فالكل في عين الوجود والشهود ولكِنَّ أَكْثَرَهُمْ لا يَعْلَمُونَ فرحم الله الجميع وهذا معنى قوله ورَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ\n\n\n### [مدرسة الوجود الجامعية ربها المعيدون فيها المذنبون فيها المذنبون أصناف عاومها الكلية الأربعة]\n\n\nوسيرد إن شاء الله في منزل الإنعام والآلاء من هذا الكتاب ما أشرنا إليه في هذا الكلام فإنا جعلنا فيه أن الوجود مدرسة وأن الحق سبحانه هو رب هذه المدرسة وملقي الدروس فيها على المتعلمين وهم العالم والرسل هم المعيدون والورثة هم المذنبون وهم معيدو المعيدين والعلوم التي يلقيها للمتعلمين في هذه المدرسة وإن كثرت فهي ترجع إلى أربعة أصناف صنف يلقى عليهم دروس موازين الكلام في الألفاظ والمعاني ليميزوا بها الصحيح من السقيم وإن كان الكل صحيحا عند العلماء بالله وإنما يسمى سقيما بالنظر إلى ضده أو غرض ما معين والعلم الثاني هو العلم بتنقيح الأذهان وتدريب الأفكار وتهذيب العقول لأن رب المدرسة إنما يريد أن يعرفهم بنفسه وهو الغاية المطلوبة التي لأجلها وضع هذه المدرسة وجمع هؤلاء الفقهاء فاستدرجهم للعلم به شيئا بعد شي‏ء وبعضهم تجلى لهم ابتداء فعرفوه لصحة مزاجهم كالملائكة والأجسام المعدنية والنباتية والحيوانية وما احتجب إلا عن الثقلين ففيهما وضع هذه العلوم ليتدربوا بها للعلم به وهو لا يزال خلف حجاب المعيدين والعقول ستر مسدل وباب مقفل ودروس يلقيها أيضا ليعلمهم بذلك ما سبب وجود هذه الهياكل واختلافات أمزجتها وبما امتزجت وما سبب عللها وأمراضها وصحتها وعافيتها ومن أي شي‏ء قامت وما يصلحها ويفسدها وما معنى الطبيعة فيها وأين مرتبتها من العالم وهل هي أمر وجودي عيني أو هي أمر وجودي عقلي وهل يخرج عنها شي‏ء أو صنف من العالم أو لا حكم لها إلا في الأجسام المركبة التي تقبل الحل والتركيب والكون والفساد وما أشبه هذا الفن والدرس الرابع هو ما يلقيه من العلم الإلهي وما يجب أن يكون عليه هذا المفتقر إليه الذي هو الله سبحانه وما يستحيل أن ينعت به وما يجوز فعله في خلقه وما ثم درس خامس أصلا لأنه ليس وراء الله مرمى غير أن كل نوع من أنواع هذه العلوم ينقسم إلى علوم جزئية كثيرة يتسع المجال فيها فمن وقف مع شي‏ء منها ولم يحضر من الدروس إلا درسها كان ناقصا عن غيره ومن ارتفعت همته وعلم أن هذه الدروس ليس المطلوب منها نفسها ولا وضعت لعينها وإنما المقصود منها تحصيل العلم بالله الذي هو رب هذه المدرسة جعل في همته طلب هذا العلم الإلهي فمنهم من طلبه بمقدمات هذه العلوم وهو طلب عقلي ومنهم من طلبه من المعيد واقتصر عليه فإنه رأى بينه وبين المدرس وصلة ورأى رسولا يخرج إليه من خلف الحجاب يعرفه بأمور يلقيها على الحاضرين وأوقات يدخل المعيد إليه ثم يخرج من عنده فقال هذا الطالب العلم بالله من جهة هذا المعيد أحق وأوثق للنفس من أن تتخذ دليلا نظريا أو فكريا مما تقدم من هذه العلوم الأخر فلما أخذ علمه من المعيد كان وارثا وصار معيدا للمعيد وهو المذنب ويسمى في الشرع الوارث وهم ورثة الأنبياء\n\n",
    "en": "## Chapter One Hundred and Thirty-Three Concerning the Station of Abandoning Rectitude\n\nBehold, unto Allah return all affairs,\nSo let not the abode of delusion deceive you.\nAnd everything that contradicts what He said,\nExalted is He, then it is a false statement.\nFor every crooked thing has a purpose,\nTruly unto Him in all affairs.\nSo do not specify anyone that he,\nJudged by ignorance or deficiency that occurred.\nOur purposes separated things,\nInto the fortunate and into those who perish.\nAnd all returned to His saying:\nBehold, unto Allah return all affairs.\n\n### [Abandoning Rectitude is a Sign of Abiding]\n\nKnow—may Allah grant you knowledge—that the abandoning of rectitude [ترك الاستقامة] is among the signs of abiding [الإقامة] with Allah and being present with Him in every state. This is just as Aisha, the Mother of the Believers, may Allah be pleased with her, said concerning the Prophet, peace and blessings be upon him, that he used to remember Allah in all his states.\n\nThus, in this world, he is described by the characteristic of the land of the Hereafter: <<You will see therein no crookedness nor unevenness>> (Quran 20:107). And since rectitude [الاستقامة] is distinguished by crookedness [الاعوجاج], and there is no crookedness, there is no rectitude to be witnessed.\n\nSo all, in the eye of Being [الوجود],\nAre upon a single path.\nAnd all, in the eye of contentment,\nWhether believer or denier.\n\n### [Contingency is an Essential Attribute of the World, so Inclination is Essential to it, thus there is no Rectitude]\n\nThe station of witnessing [الشهود] for the possessor of this state may be the contemplation of the contingency [الإمكان] of the world [العالم]. Contingency is the cause of its illness, and illness is inclination [ميل], and inclination is the opposite of rectitude [الاستقامة]. Contingency is an essential attribute [نعت ذاتي] of the world; its removal is inconceivable, neither in its state of non-existence nor in its state of existence. Thus, the illness is essential to it, and the inclination is essential to it, so there is no rectitude.\n\nThe world’s illness is a chronic infirmity [زمانة] whose removal is not hoped for, except that the cosmos is a locus for the existence of fallacies due to matters necessitated by Wisdom and sought by the sound intellect, because of its knowledge of what rectifies the cosmos, since the Divine Command [التكليف] was legislated. It was not possible for the individuals of the world to be upon a single temperament [مزاج]. When the temperaments differed, there arose in the world the knowledgeable and the most knowledgeable, the virtuous and the most virtuous.\n\nAmong them are those who know Allah absolutely, without restriction. And among them are those who cannot attain knowledge of Allah unless they restrict Him with Attributes [الصفات] that do not suggest origination and necessitate the perfection of the Described. And among them are those who cannot attain knowledge of Allah unless they restrict Him with the attributes of origination, thereby placing Him under the ruling of the circumstantiality of time, the circumstantiality of place, limit, and measure.\n\n### [The Divine Laws Descended According to Human Temperaments, and the Perfect Temperament is He Who Embraces Every Belief]\n\nSince the matter of the knowledge of Allah in the world, in its original creation, was upon this mentioned natural temperament, Allah sent down the Divine Laws [الشرائع] upon these levels [المراتب] so that the Divine Grace [الفضل الإلهي] might encompass all of creation.\n\nSo He revealed: <<There is nothing like unto Him>> (Quran 42:11), and this is for the people who know Allah absolutely, without restriction. And He revealed His saying, Exalted is He: <<He encompasses all things in knowledge>> (Quran 65:12), <<And He is over all things competent>> (Quran 5:120), <<Doer of what He intends>> (Quran 85:16), <<And He is the Hearing, the Seeing>> (Quran 42:11), <<Allah—there is no deity except Him, the Ever-Living, the Sustainer of existence>> (Quran 2:255), <<Grant him protection until he hears the word of Allah>> (Quran 9:6), and <<And He is Knowing of all things>> (Quran 2:29). This is all concerning those who restrict Him with the attributes of perfection.\n\nAnd He revealed, Exalted is He, from the Divine Laws, His saying: <<The Most Merciful [Ar-Rahman] ascended the Throne [al-Arsh]>> (Quran 20:5), <<And He is with you wherever you are>> (Quran 57:4), <<And He is Allah in the heavens and in the earth>> (Quran 6:3), <<And it sailed under Our observation>> (Quran 54:14), and <<Had We intended to take a diversion, We could have taken it from [what is] with Us>> (Quran 21:17).\n\nThus, the Divine Laws encompassed what the temperaments of the world demand, and the believer is not devoid of one of these categories. The one with the perfect temperament [الكامل المزاج] is he who encompasses all these beliefs, knows their sources and their destinations, and nothing of them is hidden from him.\n\nSuch a person does not have rectitude [الاستقامة] specified for him, because he does not see an opposite to this state by which this state might be distinguished, for he is within it. When existence [الكون] is within a thing, that thing does not perceive it visually or by sight, even if it knows it, just as the air is not perceived due to extreme proximity. Similarly, the Real [الحق] is not perceived due to extreme proximity, for He is nearer to us than the <<jugular vein>> (Quran 50:16), so <<Vision does not perceive Him>> (Quran 6:103).\n\n### [Glory be to Him Who Created the World for Felicity, Not for Misery, and Misery was an Accidental Occurrence in it]\n\nGlory be to Him Who created the world [العالم] for felicity [السعادة], not for misery [الشقاء]. Thus, misery was an accidental occurrence [عرضا عرض] in it, which will then vanish. That is because Allah, Exalted is He, did not create the world for the sake of the world itself, but rather created it for His own sake. He said concerning it: <<And there is nothing except that it glorifies Him with praise>> (Quran 17:44). And we are among the things. Then He said concerning us: <<And I did not create the jinn and mankind except to worship Me>> (Quran 51:56).\n\nThere is none among us who seeks might against Allah or acts arrogantly toward Him, even if some of us act arrogantly toward others. There is no follower of a doctrine, a religion, or a philosophical view whom you ask about his quest, but you will find him fully intent upon seeking the object of existence [موجدة]. This is because He created him for gnosis [المعرفة] of Him. Their states differed in attaining their object of desire due to the difference in their temperaments. The Divine Laws descended to correct the view of every observer, and He manifests Himself [يتجلى] to the People of Unveiling [أهل الكشوف].\n\nAnd all are People of Unveiling, but some do not know that their object of desire has attained them—and that is the one who submits to Him. And another has known that he sees nothing but his object of desire. So all are in the eye of Being [الوجود] and Witnessing [الشهود], <<but most of them do not know>> (Quran 7:187). So Allah has mercy on all. And this is the meaning of His saying: <<And My Mercy encompasses all things>> (Quran 7:156).\n\n### [The Universal School of Being, Whose Lord is the Repeaters, and the Sinners are in it, and its Four Universal Categories of Knowledge]\n\nWhat we have alluded to in this discourse will be presented, if Allah wills, in the Station of Grace and Blessings [منزل الإنعام والآلاء] in this book. For we established therein that Being [الوجود] is a school, and that the Real [الحق], Exalted is He, is the Lord of this school and the one who delivers the lessons therein to the students, who are the world [العالم]. The Messengers are the Repeaters [المعيدون], and the Inheritors [الورثة] are the Sinners [المذنبون]—and they are the repeaters of the Repeaters.\n\nThe sciences that He delivers to the students in this school, though numerous, return to four categories [أصناف]:\n\n1.  One category: lessons on the balances of discourse [موازين الكلام] concerning words and meanings are delivered to them, so that they may distinguish the sound from the unsound—even though all is sound according to the Gnostics of Allah [العلماء بالله]; it is only called unsound when viewed in relation to its opposite or a specific purpose.\n2.  The second science is the science of refining the minds, training the thoughts, and purifying the intellects. This is because the Lord of the school only desires to make Himself known to them, and this is the desired goal for which this school was established and these scholars [الفقهاء] were gathered, drawing them gradually toward knowledge of Him, thing after thing.\n    To some, He manifested Himself initially, and they knew Him due to the soundness of their temperament, such as the angels, and the mineral, vegetative, and animal bodies. He was veiled only from the two weighty ones (jinn and mankind). Thus, these sciences were established for them so that they might train themselves for knowledge of Him, while He remains behind the veil of the Repeaters, and the intellects are a drawn curtain and a locked door.\n3.  He also delivers lessons to teach them the cause of the existence of these structures, the differences in their temperaments, how they were compounded, the cause of their defects, illnesses, health, and well-being, from what they arose, what rectifies and corrupts them, what the meaning of Nature [الطبيعة] is within them, where its level is in the world, whether it is an essential existent reality [أمر وجودي عيني] or a conceptual existent reality [أمر وجودي عقلي], whether anything or any category of the world falls outside of it, or whether it has jurisdiction only over composite bodies that accept dissolution, composition, generation, and corruption, and similar matters of this discipline.\n4.  The fourth lesson is what He delivers concerning the Divine Science [العلم الإلهي]: what must be attributed to this One who is sought, who is Allah, Exalted is He, what is impossible to attribute to Him, and what is permissible for Him to do in His creation.\n\nThere is absolutely no fifth lesson, because there is no goal beyond Allah. However, every category of these sciences is divided into many particular sciences where the field expands. So whoever stops at one of them and attends only its lesson is deficient compared to others.\n\nBut whoever’s aspiration [همته] is elevated and knows that these lessons are not sought for themselves, nor were they established for their own sake, but rather the intention behind them is the attainment of the Knowledge of Allah, Who is the Lord of this school, he places the seeking of this Divine Science [العلم الإلهي] within his aspiration.\n\nAmong them are those who seek it through the preliminaries of these sciences, and that is a rational seeking. And among them are those who seek it from the Repeater [المعيد] and restrict themselves to him, for they see a connection between him and the Teacher, and they see a Messenger emerging to him from behind the veil, informing him of matters that he delivers to those present, and times when the Repeater enters to Him and then emerges from His presence. This student said that knowledge of Allah derived from this Repeater is more rightful and trustworthy for the soul than taking a theoretical or intellectual proof from the other preceding sciences. So when he took his knowledge from the Repeater, he became an Inheritor [وارث] and became a repeater of the Repeater—and he is the Sinner [المذنب]—and he is called the Inheritor [الوارث] in the Sacred Law, and they are the inheritors of the Prophets.",
    "ur": "## (باب ایک سو تینتیس: استقامت کو ترک کرنے کے مقام کے بیان میں)\n\n> خبردار! تمام معاملات اللہ ہی کی طرف لوٹتے ہیں (أَلا إِلَى الله تَصِيرُ الْأُمُورُ)\n> پس تمہیں یہ فریب کا گھر (دنیا) دھوکے میں نہ ڈالے\n> اور ہر وہ بات جو اس کے (اللہ سبحانہ و تعالیٰ کے) فرمان کے خلاف ہو\n> تو وہ یقیناً جھوٹا قول ہے\n> پس ہر کجی (ٹیڑھا پن) کی ایک غایت ہے\n> جو تمام معاملات میں حق کے طور پر اسی کی طرف جاتی ہے\n> لہٰذا کسی ایک شخص کو بھی متعین نہ کرو کہ وہ\n> جہالت یا کوتاہی کی وجہ سے حکم لگا رہا ہے\n> ہماری اغراض نے اشیاء کو تقسیم کر دیا\n> خوش بخت اور ہلاک ہونے والے میں\n> اور سب کا رجوع اسی قول کی طرف ہے:\n> خبردار! تمام معاملات اللہ ہی کی طرف لوٹتے ہیں (أَلا إِلَى الله تَصِيرُ الْأُمُورُ)\n\n### [استقامت کو ترک کرنا اقامت کی علامتوں میں سے ہے]\n\nاللہ تمہیں علم عطا فرمائے، جان لو کہ ترکِ استقامت (ترك الاستقامة) اللہ کے ہاں اقامت (الإقامة) اور ہر حال میں اس کے ساتھ حاضری کی علامتوں میں سے ہے۔ جیسا کہ ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے نبی اکرم صلی اللہ علیہ وسلم کے حق میں فرمایا کہ آپ ہر حال میں اللہ کا ذکر کرتے تھے۔ پس آپ دنیا میں آخرت کی زمین کی صفت سے متصف تھے: \"نہ تم اس میں کوئی کجی دیکھو گے اور نہ کوئی اونچ نیچ\" (لا تَرى‏ فِيها عِوَجاً ولا أَمْتاً)۔ اور چونکہ استقامت (الاستقامة) کجی (اعوجاج) کے ذریعے ممتاز ہوتی ہے، اور جب کجی ہی نہ ہو تو کوئی مشہود استقامت (الاستقامة) بھی نہیں ہے۔\n\n> پس ہستی (الوجود) کی نظر میں سب\n> ایک ہی راستے پر ہیں\n> اور رضامندی کی نظر میں سب\n> خواہ وہ مومن ہو یا منکر\n\n### [عالم کے لیے امکان ایک ذاتی صفت ہے، لہٰذا میلان ذاتی ہے اور استقامت نہیں ہے]\n\nاور اس شہود (الشہود) کے حامل کا مشاہدہ عالم (العالم) کے امکان (الإمكان) میں غور کرنا ہو سکتا ہے۔ اور امکان (الإمكان) اس کی بیماری کا سبب ہے، اور بیماری میلان (جھکاؤ) ہے، اور میلان استقامت (الاستقامة) کی ضد ہے۔ اور عالم (العالم) کے لیے امکان (الإمكان) ایک ذاتی صفت ہے جس کا زوال نہ اس کے عدم کی حالت میں متصور ہے اور نہ اس کے وجود کی حالت میں۔ پس اس کی بیماری ذاتی ہے، لہٰذا اس کا میلان ذاتی ہے، پس کوئی استقامت (الاستقامة) نہیں۔ چنانچہ عالم (العالم) کی بیماری ایک ایسی دائمی کمزوری ہے جس کے دور ہونے کی امید نہیں، مگر یہ کہ کائنات مغالطات کے وجود کا محل ہے ان امور کے لیے جن کا تقاضا حکمت کرتی ہے اور جن کا مطالبہ عقل سلیم کرتی ہے، کیونکہ وہ جانتی ہے کہ کائنات کی اصلاح کس چیز میں ہے، جب کہ تکلیف (شرعی ذمہ داری) کو مشروع کیا گیا۔ اور یہ ممکن نہ تھا کہ عالم (العالم) کے افراد ایک ہی مزاج پر ہوں۔ پس جب مزاج مختلف ہوئے تو عالم میں عالم، اعلم، فاضل اور افضل موجود ہوئے۔ ان میں سے بعض وہ ہیں جنہوں نے اللہ کو مطلقاً بغیر کسی قید کے پہچانا، اور ان میں سے بعض وہ ہیں جو اللہ کے علم کو حاصل کرنے پر قادر نہیں ہوتے جب تک کہ اسے ایسی صفات کے ساتھ مقید نہ کریں جو حدوث (پیدا ہونے) کا وہم نہ دلائیں اور موصوف کے کمال کا تقاضا کریں۔ اور ان میں سے بعض وہ ہیں جو اللہ کے علم پر قادر نہیں ہوتے جب تک کہ اسے حدوث کی صفات کے ساتھ مقید نہ کریں، پس وہ اسے زمان و مکان کی ظرفیت، حد اور مقدار کے حکم کے تحت داخل کر دیتے ہیں۔\n\n### [شرائع الٰہیہ انسانی مزاجوں کے مطابق نازل ہوئیں، اور کامل المزاج وہ ہے جو ہر اعتقاد کو باندھ لے]\n\nاور چونکہ عالم (العالم) میں اللہ کے علم کا معاملہ اس کی اصل تخلیق میں اور مذکورہ بالا طبعی مزاج پر تھا، اس لیے اللہ نے شرائع (الشرائع) کو ان مراتب پر نازل فرمایا تاکہ فضلِ الٰہی تمام مخلوق کو شامل ہو جائے۔ پس اس نے نازل فرمایا: \"کوئی چیز اس کے مثل نہیں\" (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)، اور یہ ان لوگوں کے لیے ہے جو اللہ کو مطلقاً بغیر کسی قید کے جانتے ہیں۔ اور اس نے یہ قول نازل فرمایا: \"اس نے ہر چیز کو علم سے گھیر رکھا ہے\" (أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً)، \"اور وہ ہر چیز پر قادر ہے\" (وَهُوَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ)، \"جو چاہتا ہے اسے خوب کرنے والا ہے\" (فَعَّالٌ لِمَا يُرِيدُ)، \"اور وہ سننے والا، دیکھنے والا ہے\" (وَهُوَ السَّمِيعُ الْبَصِيرُ)، \"اللہ، اس کے سوا کوئی معبود نہیں، وہ زندہ ہے، سب کو قائم رکھنے والا ہے\" (اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ)، اور \"اسے پناہ دو تاکہ وہ اللہ کا کلام سن لے\" (فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ)، \"اور وہ ہر چیز کو جاننے والا ہے\" (وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ)۔ اور یہ سب ان لوگوں کے حق میں ہے جنہوں نے اسے صفاتِ کمال کے ساتھ مقید کیا۔ اور اللہ تعالیٰ نے شرائع (الشرائع) میں سے یہ بھی نازل فرمایا: \"رحمٰن عرش پر مستوی ہوا\" (الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى)، \"اور تم جہاں کہیں بھی ہو وہ تمہارے ساتھ ہے\" (وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ)، \"اور وہی اللہ آسمانوں میں ہے اور زمین میں ہے\" (وَهُوَ اللَّهُ فِي السَّمَاوَاتِ وَفِي الْأَرْضِ)، اور \"وہ ہماری آنکھوں کے سامنے چلتی رہی\" (تَجْرِي بِأَعْيُنِنَا)، اور \"اگر ہم کوئی کھیل بنانا چاہتے تو اسے اپنے پاس سے بنا لیتے\" (وَلَوْ أَرَدْنَا أَنْ نَتَّخِذَ لَهْوًا لَاتَّخَذْنَاهُ مِنْ لَدُنَّا)۔ پس شرائع (الشرائع) نے ان تمام چیزوں کا احاطہ کر لیا جن کا تقاضا عالم (العالم) کے مزاج کرتے ہیں۔ اور کوئی بھی معتقد ان اقسام میں سے کسی ایک سے خالی نہیں ہوتا۔ اور کامل المزاج وہ ہے جو ان تمام اعتقادات کو شامل کرتا ہے اور ان کے مصادر اور ان کے موارد کو جانتا ہے، اور ان میں سے کوئی چیز اس سے غائب نہیں ہوتی۔ ایسے شخص کے لیے استقامت (الاستقامة) متعین نہیں ہوتی، کیونکہ وہ اس حال کی کوئی ضد نہیں دیکھتا جس سے یہ حالت ممتاز ہو، کیونکہ وہ اس حال کے اندر ہے۔ اور جب کوئی شے کسی چیز کے اندر ہو تو وہ اسے آنکھ اور بصارت کے ذریعے ادراک نہیں کر سکتی، اگرچہ وہ اسے جانتی ہو۔ جیسا کہ ہوا کو انتہائی قربت کی وجہ سے ادراک نہیں کیا جا سکتا، اسی طرح ذات حق (الحق) کو بھی انتہائی قربت کی وجہ سے ادراک نہیں کیا جا سکتا، کیونکہ وہ ہماری شہ رگ سے بھی زیادہ قریب ہے (حَبْلِ الْوَرِيدِ)، پس \"نگاہیں اسے پا نہیں سکتیں\" (لَا تُدْرِكُهُ الْأَبْصَارُ)۔\n\n### [پاک ہے وہ ذات جس نے عالم کو سعادت کے لیے پیدا کیا نہ کہ شقاوت کے لیے، اور شقاوت اس میں ایک عارضی امر تھی]\n\nپس پاک ہے وہ ذات جس نے عالم (العالم) کو سعادت (خوش بختی) کے لیے پیدا کیا، نہ کہ شقاوت (بدبختی) کے لیے۔ پس شقاوت اس میں ایک عارضی امر تھی جو اسے لاحق ہوئی، پھر وہ زائل ہو جائے گی۔ اور یہ اس لیے ہے کہ اللہ تعالیٰ نے عالم (العالم) کو عالم کی خاطر پیدا نہیں کیا، بلکہ اسے اپنی ذات کی خاطر پیدا کیا، چنانچہ اس کے بارے میں فرمایا: \"اور کوئی چیز ایسی نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے\" (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ)۔ اور ہم بھی اشیاء میں سے ہیں۔ پھر ہمارے حق میں فرمایا: \"اور میں نے جنوں اور انسانوں کو صرف اس لیے پیدا کیا کہ وہ میری عبادت کریں\" (وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ)۔ ہم میں سے کوئی بھی اللہ کے مقابلے میں عزت کا دعویٰ نہیں کرتا اور نہ ہی اس پر تکبر کرتا ہے، اگرچہ ہم میں سے بعض ایک دوسرے پر تکبر کرتے ہیں۔ اور کوئی بھی مذہب، ملت یا نظریہ رکھنے والا ایسا نہیں ہے جس سے تم اس کے مطلوب کے بارے میں پوچھو تو تم اسے ذات حق (الحق) کی طلب میں پوری ہمت صرف کرتے ہوئے نہ پاؤ، کیونکہ اس نے اسے اپنی معرفت (المعرفۃ) کے لیے پیدا کیا ہے۔ اور ان کے مطلوب کے ادراک میں ان کے احوال ان کے مزاجوں کے اختلاف کی وجہ سے مختلف ہو گئے۔ اور شرائع (الشرائع) اس لیے نازل ہوئیں تاکہ ہر دیکھنے والے کی نظر کو درست کریں، اور اہل کشف (الکشف) کے لیے ظہور الٰہی (التجلی) ہوتا ہے۔ اور سب ہی اہل کشف (الکشف) ہیں، لیکن بعض نہیں جانتے کہ انہوں نے اپنے مطلوب کو پا لیا ہے، اور وہ وہی ہے جس نے اس کے سامنے خشوع اختیار کیا۔ اور دوسرا وہ ہے جو جانتا ہے کہ وہ اپنے مطلوب کے سوا کچھ نہیں دیکھتا۔ پس سب ہستی (الوجود) اور شہود (الشہود) کی نظر میں ہیں، \"لیکن ان میں سے اکثر نہیں جانتے\" (وَلَكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ)۔ پس اللہ سب پر رحم فرمائے، اور یہی اس کے قول کا معنی ہے: \"اور میری رحمت ہر چیز پر محیط ہے\" (وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ)۔\n\n### [وجود کا جامع مدرسہ، اس کا رب، اس کے معیدون اور اس کے مذنبون، اور اس کے چار کلی علوم]\n\nاور ان شاء اللہ اس کتاب کے \"منزل الانعام والآلاء\" میں وہ بات آئے گی جس کی طرف ہم نے اس کلام میں اشارہ کیا ہے۔ کیونکہ ہم نے اس میں یہ بیان کیا ہے کہ ہستی (الوجود) ایک مدرسہ ہے، اور ذات حق (الحق) سبحانہ و تعالیٰ اس مدرسے کا رب ہے اور اس میں متعلمین (سیکھنے والوں) پر دروس القا کرنے والا ہے، اور وہ متعلمین عالم (العالم) ہیں۔ اور رسول (پیغمبر) معیدون (دہرانے والے/ٹیوٹر) ہیں، اور ورثاء (وارث) مذنبون (دہرانے والے) ہیں، اور وہ معیدون کے بھی معیدون ہیں۔ اور وہ علوم جو اس مدرسے میں متعلمین پر القا کیے جاتے ہیں، اگرچہ وہ کثیر ہیں، لیکن وہ چار اقسام کی طرف لوٹتے ہیں: ایک قسم وہ ہے جس میں ان پر الفاظ اور معانی میں کلام کے موازین کے دروس القا کیے جاتے ہیں تاکہ وہ ان کے ذریعے صحیح کو سقیم سے ممتاز کر سکیں، اگرچہ اللہ کے علماء کے نزدیک سب صحیح ہے، اور اسے سقیم صرف اس کی ضد کے اعتبار سے یا کسی خاص غرض کے پیش نظر کہا جاتا ہے۔ اور دوسرا علم اذہان کی تنقیح، افکار کی تربیت اور عقول کی تہذیب کا علم ہے، کیونکہ مدرسے کا رب صرف یہ چاہتا ہے کہ وہ انہیں اپنی ذات سے متعارف کرائے، اور یہی وہ مطلوبہ غایت ہے جس کے لیے اس مدرسے کو قائم کیا گیا اور ان فقہاء کو جمع کیا گیا۔ پس اس نے انہیں رفتہ رفتہ اپنے علم کی طرف کھینچا۔ اور بعض پر ابتداء ہی میں ظہور الٰہی (التجلی) ہوا، پس انہوں نے اپنے مزاج کی صحت کی وجہ سے اسے پہچان لیا، جیسے فرشتے، معدنی، نباتاتی اور حیوانی اجسام۔ اور اس نے پردہ صرف جن و انس (ثقلین) سے رکھا، پس ان ہی میں یہ علوم رکھے گئے تاکہ وہ ان کے ذریعے اس کے علم کے لیے تربیت حاصل کریں، اور وہ ابھی تک معیدون کے حجاب کے پیچھے ہے۔ اور عقلیں ایک لٹکا ہوا پردہ اور ایک مقفل دروازہ ہیں۔ اور وہ دروس بھی القا کرتا ہے تاکہ انہیں یہ سکھائے کہ ان ہیاکل کے وجود کا سبب کیا ہے، اور ان کے مزاجوں کے اختلافات کیا ہیں، اور وہ کس چیز سے مرکب ہوئے، اور ان کی علتوں، بیماریوں، صحت اور عافیت کا سبب کیا ہے، اور وہ کس چیز سے قائم ہوئے، اور کون سی چیزیں انہیں درست کرتی ہیں اور کون سی بگاڑتی ہیں، اور ان میں طبیعت کا معنی کیا ہے، اور عالم (العالم) میں اس کا مرتبہ کہاں ہے، اور کیا یہ کوئی وجودی عینی امر ہے یا یہ کوئی وجودی عقلی امر ہے، اور کیا کوئی شے یا عالم کی کوئی صنف اس سے خارج ہے یا اس کا حکم صرف ان مرکب اجسام میں ہے جو حل اور ترکیب، کون اور فساد کو قبول کرتے ہیں، اور اس فن سے مشابہ دیگر امور۔ اور چوتھا درس وہ ہے جو وہ علم الٰہی کے بارے میں القا کرتا ہے، اور یہ کہ اس ذات پر کیا واجب ہے جس کی طرف یہ سب محتاج ہیں، جو کہ اللہ سبحانہ و تعالیٰ ہے، اور وہ کون سی صفات ہیں جن سے اس کا متصف ہونا محال ہے، اور وہ کون سے افعال ہیں جن کا کرنا اس کے لیے اپنی مخلوق میں جائز ہے۔ اور پانچواں درس سرے سے کوئی نہیں ہے، کیونکہ اللہ کے ماوراء کوئی منزل نہیں ہے۔ البتہ ان علوم کی ہر نوع بہت سے جزوی علوم میں تقسیم ہوتی ہے جس میں میدان وسیع ہو جاتا ہے۔ پس جس نے ان میں سے کسی ایک پر اکتفا کیا اور صرف اسی کا درس لیا تو وہ دوسروں سے ناقص رہا۔ اور جس کی ہمت بلند ہوئی اور اس نے جان لیا کہ ان دروس کا مطلوب خود یہ دروس نہیں ہیں اور نہ ہی انہیں اپنی ذات کے لیے وضع کیا گیا ہے، بلکہ ان کا مقصود اللہ کے علم کا حصول ہے جو اس مدرسے کا رب ہے، تو اس نے اپنی ہمت میں اس علم الٰہی کی طلب کو شامل کر لیا۔ پس ان میں سے بعض نے اسے ان علوم کے مقدمات کے ذریعے طلب کیا، اور یہ عقلی طلب ہے۔ اور ان میں سے بعض نے اسے معید (ٹیوٹر) سے طلب کیا اور اسی پر اکتفا کیا، کیونکہ اس نے اپنے اور مدرس کے درمیان ایک تعلق دیکھا، اور ایک رسول کو دیکھا جو پردے کے پیچھے سے اس کی طرف نکلتا ہے اور اسے ان امور سے آگاہ کرتا ہے جو وہ حاضرین پر القا کرتا ہے، اور ایسے اوقات بھی دیکھے جب معید اس کے پاس داخل ہوتا ہے اور پھر اس کے پاس سے باہر آتا ہے۔ پس اس طالب نے کہا کہ اللہ کا علم اس معید کی طرف سے حاصل کرنا نفس کے لیے زیادہ حق اور زیادہ قابل اعتماد ہے بہ نسبت اس کے کہ وہ ان دیگر علوم سے کوئی نظری یا فکری دلیل اختیار کرے۔ پس جب اس نے اپنا علم معید سے لیا تو وہ وارث بنا اور معید کا بھی معید بن گیا، اور وہی مذنب (دہرانے والا) ہے، اور شرع میں اسے وارث کہا جاتا ہے، اور یہی انبیاء کے ورثاء ہیں۔ (ورثة الأنبياء)",
    "fa": "(باب صد و سی و سوم در مقام ترک استقامت)\n\nآگاه باشید که امور به سوی خداوند بازمی‌گردد (أَلا إِلَى الله تَصِيرُ الْأُمُورُ) *** پس مبادا سرای فریب (دنیا) شما را بفریبد.\nو هر آنچه با گفته او سبحانه مخالف باشد *** همانا سخنی باطل و دروغ است.\nپس هر کجی را غایتی است *** که در حقیقت در تمامی امور به سوی اوست.\nپس هیچ کس را متهم مکن که *** به جهل یا قصوری حکم کرده است.\nاغراض ما اشیاء را جدا کرد *** به سعادتمند و به کسی که تباه می‌شود.\nو همه به این قول او بازگشتند *** آگاه باشید که امور به سوی خداوند بازمی‌گردد (أَلا إِلَى الله تَصِيرُ الْأُمُورُ).\n\n[ترک استقامت از نشانه‌های اقامت (الإقامة) است]\n\nخداوند به شما علم دهد، بدانید که ترک استقامت (ترك الاستقامة) از نشانه‌های اقامت (الإقامة) نزد حق و حضور با او در هر حال است، چنانکه عایشه، ام‌المؤمنین (رضی الله عنها)، درباره پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود که او در تمامی احوالش ذکر خدا می‌گفت.\n\nپس او در دنیا به صفت سرزمین آخرت توصیف شده است: «در آن هیچ کجی و بلندی نمی‌بینی» (لا تَرى‏ فِيها عِوَجاً ولا أَمْتاً). و از آنجا که استقامت با کجی متمایز می‌شود و کجی‌ای وجود ندارد، پس استقامتی مشهود نیست.\n\nپس همه در عین هستی (الوجود) *** بر یک راه واحدند\nو همه در عین رضایت (حق) هستند *** چه مؤمن باشد و چه منکر.\n\n[امکان (الإمكان) برای عالم صفتی ذاتی است، پس میل برای آن ذاتی است و استقامتی وجود ندارد]\n\nو ممکن است مشهد صاحب این شهود (الشهود)، نظر کردن در امکان (الإمكان) عالم باشد. و امکان (الإمكان) سبب بیماری آن است، و بیماری همان میل است، و میل ضد استقامت است. و امکان (الإمكان) برای عالم صفتی ذاتی است که زوال آن نه در حال عدمش و نه در حال وجودش تصور نمی‌شود. پس بیماری برای آن ذاتی است و میل برای آن ذاتی است، لذا استقامتی وجود ندارد.\n\nپس بیماری عالم، ناتوانی‌ای است که امید به رفع آن نیست، مگر اینکه هستی (الکون) محل وجود مغالطات باشد، به دلیل اموری که حکمت اقتضا می‌کند و عقل سلیم آن را می‌طلبد، زیرا عقل به آنچه جهان را اصلاح می‌کند آگاه است، چرا که تکلیف تشریع شد. و در توان نبود که آحاد عالم بر یک مزاج واحد باشند.\n\nپس چون مزاج‌ها مختلف شد، در عالم، عالم و اعلم، و فاضل و افضل پدید آمد. از ایشان کسی است که خداوند را مطلق و بدون تقیید شناخته است، و از ایشان کسی است که قادر به تحصیل علم به خداوند نیست مگر آنکه او را به صفاتی مقید کند که توهم حدوث ایجاد نکند و کمال موصوف را اقتضا کند. و از ایشان کسی است که قادر به علم به خداوند نیست مگر آنکه او را به صفات حدوث مقید کند، و او را تحت حکم ظرفیت زمان و ظرفیت مکان و حد و مقدار درآورد.\n\n[شرایع الهی بر حسب مزاج‌های انسانی نازل شد و کامل‌المزاج کسی است که به هر اعتقادی معتقد باشد]\n\nو چون امر در علم به خداوند در عالم، در اصل خلقتش، بر این مزاج طبیعی مذکور بود، خداوند شرایع را بر این مراتب نازل کرد تا فضل الهی تمامی خلق را فرا گیرد. پس نازل کرد: «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)، و این برای اهل علم به خداوند به طور مطلق و بدون تقیید است.\n\nو قول او تعالی را نازل کرد: «علم او همه چیز را احاطه کرده است» (أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً)، و «او بر هر چیزی تواناست» (وَهُوَ عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ)، «هر چه بخواهد انجام می‌دهد» (فَعَّالٌ لِما يُرِيدُ)، و «او شنوای بیناست» (وَهُوَ السَّمِيعُ الْبَصِيرُ)، و «الله که معبودی جز او نیست، زنده و پاینده است» (والله لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ)، و «به او پناه ده تا کلام خدا را بشنود» (فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله)، و «او به هر چیزی داناست» (وَهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ). و این همه در حق کسی است که او را به صفات کمال مقید کرده است.\n\nو تعالی از شرایع، قول خود را نازل کرد: «رحمان بر عرش استیلا یافت» (الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏)، و «او با شماست هر جا که باشید» (وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ)، و «او الله است در آسمان‌ها و در زمین» (وَهُوَ الله في السَّماواتِ وفي الْأَرْضِ)، و «زیر نظر ما حرکت می‌کند» (وَتَجْرِي بِأَعْيُنِنا)، و «اگر می‌خواستیم سرگرمی‌ای برگزینیم، آن را از نزد خود برمی‌گزیدیم» (وَلَوْ أَرَدْنا أَنْ نَتَّخِذَ لَهْواً لَاتَّخَذْناهُ من لَدُنَّا). پس شرایع آنچه را که مزاج‌های عالم می‌طلبید فرا گرفت، و معتقد از یکی از این اقسام خالی نیست.\n\nو کامل‌المزاج کسی است که تمامی این اعتقادات را در بر می‌گیرد و منابع و مآخذ آن‌ها را می‌داند و چیزی از آن‌ها بر او پوشیده نمی‌ماند. چنین کسی استقامت (الاستقامة) برایش تعیین نمی‌شود، زیرا برای این حال ضدی نمی‌بیند که این حالت با آن متمایز شود، چرا که او در آن است.\n\nو هستی (الکون) هنگامی که در چیزی باشد، آن را به عین و رؤیت بصری درک نمی‌کند، اگرچه آن را بشناسد؛ چنانکه هوا به دلیل نزدیکی مفرط درک نمی‌شود. همچنین حق (الحق) به دلیل نزدیکی مفرط درک نمی‌شود، زیرا او از «رگ گردن» (حَبْلِ الْوَرِيدِ) به ما نزدیک‌تر است، پس «چشم‌ها او را در نمی‌یابند» (لا تُدْرِكُهُ الْأَبْصارُ).\n\n[منزه است کسی که عالم را برای سعادت آفرید نه برای شقاوت، و شقاوت در آن عارضی بود که عارض شد]\n\nپس منزه است کسی که عالم را برای سعادت آفرید نه برای شقاوت، و شقاوت در آن عارضی بود که بر آن عارض شد و سپس زائل می‌گردد. و این بدان سبب است که خداوند تعالی عالم را برای خود عالم نیافرید، بلکه آن را برای خود آفرید. پس درباره آن فرمود: «و هیچ چیزی نیست مگر آنکه با ستایش او تسبیح می‌گوید» (وَإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ)، و ما از اشیاء هستیم. سپس در حق ما فرمود: «و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند» (وَما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ).\n\nپس هیچ یک از ما بر خداوند عزت نمی‌فروشد و بر او تکبر نمی‌کند، اگرچه بعضی از ما بر بعضی دیگر تکبر کنیم. و هیچ صاحب نحل و ملت و نظری نیست مگر آنکه از او درباره مطلوبش بپرسی، و او را می‌یابی که همت خود را تماماً صرف طلب یافتن حق کرده است، زیرا او را برای معرفت (المعرفة) به خود آفریده است. و احوال ایشان در ادراک مطلوبشان به دلیل اختلاف مزاج‌هایشان متفاوت شد.\n\nو شرایع نازل شد تا نظر هر بیننده‌ای را تصحیح کند، و برای اهل کشف (الکشف) تجلی (التجلی) کند. و همه اهل کشف (الکشف) هستند، اما بعضی از ایشان نمی‌دانند که مطلوبشان را درک کرده‌اند، و او کسی است که برای حق خضوع کرده است. و دیگری دانسته است که جز مطلوب خود نمی‌بیند. پس همه در عین هستی (الوجود) و شهود (الشهود) هستند، «ولی بیشترشان نمی‌دانند» (وَلَكِنَّ أَكْثَرَهُمْ لا يَعْلَمُونَ). پس خداوند بر همگان رحمت آورد، و این معنای قول اوست: «و رحمت من همه چیز را فرا گرفته است» (وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ).\n\n[مدرسه هستی (الوجود) جامع است، پروردگار آن، معیدان در آن، و مذنبون (وارثان) در آن، و اصناف کلی چهارگانه علوم آن]\n\nو آنچه در این کلام به آن اشاره کردیم، ان‌شاءالله در منزل انعام و آلاء این کتاب خواهد آمد. زیرا ما در آنجا بیان کردیم که هستی (الوجود) یک مدرسه است، و حق (الحق) سبحانه پروردگار این مدرسه و القاکننده دروس بر متعلمان است که همان عالم هستند. و رسولان، معیدان (تکرارکنندگان درس) هستند، و وارثان، مذنبون (تذکردهندگان) هستند، و ایشان معیدانِ معیدان هستند.\n\nو علومی که او بر متعلمان در این مدرسه القا می‌کند، اگرچه بسیارند، اما به چهار صنف بازمی‌گردند: صنفی که بر ایشان دروس موازین کلام در الفاظ و معانی القا می‌شود تا به وسیله آن صحیح را از سقیم تمییز دهند، اگرچه نزد عالمان به حق (الحق) همه صحیح است، و سقیم نامیده شدن تنها به اعتبار ضد آن یا غرضی معین است.\n\nو علم دوم، علم به تنقیح اذهان و تمرین افکار و تهذیب عقول است، زیرا پروردگار مدرسه تنها می‌خواهد که ایشان را به خود بشناساند، و این همان غایت مطلوبی است که مدرسه به خاطر آن تأسیس شده و این فقها جمع شده‌اند. پس ایشان را گام به گام به سوی علم به خود سوق داد.\n\nو بر بعضی از ایشان در ابتدا تجلی (التجلی) کرد و او را به دلیل صحت مزاجشان شناختند، مانند ملائکه و اجسام معدنی، نباتی و حیوانی. و او جز از ثقلین (جن و انس) محجوب نشد. پس این علوم در مورد ایشان وضع شد تا به وسیله آن برای علم به او تمرین کنند، در حالی که او همچنان پشت حجاب معیدان است و عقول پرده‌ای آویخته و دری قفل شده‌اند.\n\nو همچنین دروسی را القا می‌کند تا به وسیله آن به ایشان بیاموزد که سبب وجود این هیاکل و اختلافات مزاج‌هایشان چیست، و با چه چیزی آمیخته شده‌اند، و سبب علل و امراض و صحت و عافیتشان چیست، و از چه چیزی برپا شده‌اند، و چه چیزی آن‌ها را اصلاح و فاسد می‌کند، و معنای طبیعت در آن‌ها چیست، و مرتبه آن در عالم کجاست، و آیا طبیعت امری وجودی عینی است یا امری وجودی عقلی، و آیا چیزی یا صنفی از عالم از آن خارج می‌شود یا حکم آن تنها در اجسام مرکبی است که حل و ترکیب و کون و فساد را می‌پذیرند، و آنچه شبیه این فن است.\n\nو درس چهارم، علمی الهی است که او القا می‌کند، و آنچه که باید این نیازمند به او، که همان خداوند سبحانه است، بر آن باشد، و آنچه محال است که به آن توصیف شود، و آنچه جایز است که در خلق خود انجام دهد. و اصلاً درس پنجمی وجود ندارد، زیرا ورای خداوند مقصدی نیست.\n\nجز اینکه هر نوعی از انواع این علوم به علوم جزئی بسیاری تقسیم می‌شود که مجال در آن‌ها گسترده است. پس هر کس با چیزی از آن‌ها توقف کند و جز درس آن را حاضر نشود، نسبت به دیگری ناقص است. و هر کس همتش بالا رود و بداند که مطلوب از این دروس، خود آن‌ها نیست و برای ذاتشان وضع نشده‌اند، بلکه مقصود از آن‌ها تحصیل علم به خداوند است که پروردگار این مدرسه است، در همت خود طلب این علم الهی را قرار می‌دهد.\n\nپس بعضی از ایشان آن را با مقدمات این علوم طلب کردند، و این طلب عقلی است. و بعضی آن را از معید طلب کردند و به آن اکتفا نمودند، زیرا میان او و مدرس (حق) پیوندی دیدند، و رسولی را دیدند که از پشت حجاب نزد او می‌آید و او را به اموری آگاه می‌سازد که بر حاضران القا می‌کند، و اوقاتی که معید نزد او داخل می‌شود و سپس از نزد او خارج می‌گردد. پس این طالب گفت: علم به خداوند از طریق این معید برای نفس سزاوارتر و موثق‌تر است تا اینکه دلیلی نظری یا فکری از علوم دیگر پیشین را برگزیند.\n\nپس هنگامی که علم خود را از معید گرفت، وارث بود و معیدِ معید شد، و او همان مذنب است و در شرع، وارث نامیده می‌شود، و ایشان وارثان انبیا هستند."
  },
  "page_count": 2
}