{
  "id": 221,
  "title": {
    "ar": "الباب الأحد والعشرون ومائتان في معرفة البقاء وأسراره",
    "en": "Chapter Two Hundred and Twenty-One concerning the Gnosis (المعرفة) of Subsistence (البقاء) and its Mysteries.",
    "ur": "باب دو سو اکیس (۲۲۱) بقا (البقاء) کی معرفت (المعرفۃ) اور اس کے اسرار کے بیان میں",
    "fa": "باب دویست و بیست و یکم در معرفت بقا (البقاء) و اسرار آن"
  },
  "content": {
    "ar": "## «الباب الأحد والعشرون ومائتان في معرفة البقاء وأسراره»\n\n\n> إذا رأيت قيام الله جل على *** كل النفوس بما فيها من الأثر\n\n\n> ذاك البقاء الذي قال الرجال به *** وأنت باق به إن كنت ذا نظر\n\n\n> فكن به لا تكن بالفكر متصفا *** فإنما الغير مشتق من الغير\n\n\n> وأين غير وما في الكون أجمعه *** سوى الوجود الذي تدعوه بالبشر\n\n\n> فإنه اسم يعم الكون أجمعه *** عينا وعلما فلا تخرج عن الصور\n\n\n### [أن البقاء بقاء الطاعات كما أن الفناء فناء المعاصي‏]\n\n\nاعلم أن البقاء عند بعض الطائفة بقاء الطاعات كما كان الفناء فناء المعاصي عند صاحب هذا القول وعند بعضهم البقاء بقاء رؤية العبد قيام الله على كل شي‏ء وهذا قول من قال في الفناء إنه فناء رؤية العبد فعله بقيام الله تعالى على ذلك وعند بعضهم البقاء بقاء بالحق وهو قول من قال في الفناء إنه فناء عن الخلق‏\n\n\n### [أن البقاء نسبة إلى الحق‏]\n\n\nاعلم أن نسبة البقاء عندنا أشرف في هذا الطريق من نسبة الفناء لأن الفناء عن الأدنى في المنزلة أبدا عند الفاني والبقاء بالأعلى في المنزلة أبدا عند الباقي فإن الفناء هو الذي أفناك عن كذا فله القوة والسلطان فيك والبقاء نسبتك إلى الحق وإضافتك إليه أعني البقاء في هذا الطريق عند أهل الله فيما اصطلحوا والفناء نسبتك إلى الكون فإنك تقول فنيت عن كذا ونسبتك إلى الحق أعلى فالبقاء في النسبة أولى لأنهما حالان مرتبطان فلا يبقى في هذا الطريق إلا فإن ولا يفنى إلا باق والموصوف بالفناء لا يكون إلا في حال البقاء والموصوف بالبقاء لا يكون إلا في حال الفناء ففي نسبة البقاء شهود حق وفي نسبة الفناء شهود خلق لأنك لا تقول فنيت عن كذا إلا مع تعقلك من فنيت عنه ونفس تعقلك إياه هو نفس شهودك إياه إذ لا بد من إحضاره في نفسك لتعقل حكم الفناء عنه وكذلك البقاء لا بد من شهود من أنت باق به ولا يكون البقاء في هذا الطريق إلا بالحق فلا بد من شهود الحق فإنه لا بد من إحضارك إياه في قلبك وتعقلك إياه فحينئذ تقول بقيت بالحق وهذه النسبة أشرف وأعلى لعلو المنسوب إليه فحال البقاء أعلى من حال الفناء وإن تلازما وكانا\n\n\nللشخص في زمان واحد فلا خفاء عند ذي نظر سليم في الفرق بين النسبتين في الشرف والمنزلة «شرح هذا المقام يتضمنه شرح باب الفناء» وذلك أن ننظر في كل نوع من أنواع الفناء إلى السبب الذي أفناك عن كذا فهو الذي أنت باق معه هذا جماع هذا الباب إلا أن هنا تحقيقا لا يكون إلا في الفناء وذلك أن البقاء نسبة لا تزول ولا تحول حكمه ثابت حقا وخلقا وهو نعت إلهي والفناء نسبة تزول وهو نعت كياني لا مدخل له في حضرة الحق وكل نعت ينسب إلى الجانبين فهو أتم وأعلى من النعت المخصوص بالجانب الكوني إلا العبودة فإن نسبتها إلى الكون أتم وأعلى من‏\nنسبة الربوبية والسيادة إليه فإن قلت فالفناء راجع إلى العبودة ولازم قلنا لا يصح أن يكون كالعبودة فإن العبودة نعت ثابت لا يرتفع عن الكون والفناء قد يفنيه عن عبودته وعن نفسه فحكمه يخالف حكم العبودة وكل أمر يخرج الشي‏ء عن أصله ويحجبه عن حقيقته فليس بذلك الشرف عند الطائفة فإنه أعطاك الأمر على خلاف ما هو به فألحقك بالجاهلين والبقاء حال العبد الثابت الذي لا يزول فإنه من المحال عدم عينه الثابتة كما أنه من المحال اتصاف عينه بأنه عين الوجود بل الوجود نعته بعد أن لم تكن وإنما قلنا هذا لأن الحق هو الوجود ولا يلزم أن تكون الصفة عين الموصوف بل هو محال والعبد باقي العين في ثبوته ثابت الوجود في عبودته دائم الحكم في ذلك إِنْ كُلُّ من في السَّماواتِ والْأَرْضِ إِلَّا آتِي الرَّحْمنِ عَبْداً ما عِنْدَكُمْ يَنْفَدُ وما عِنْدَ الله باقٍ فنحن عنده وهو عندنا فالحق النفاد والبقاء بمن ألحقته هذه الآية والنفاد فناء والبقاء نعت الوجود من حيث جوهره والفناء نعت العرض من حيث ذاته بل نعت سائر المقولات ما عدا الجوهر وقد أومأنا إلى ما فيه غنية لِمَنْ كانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ لخطاب الحق وهُوَ شَهِيدٌ\n\n",
    "en": "Chapter Two Hundred and Twenty-One: Concerning the Gnosis of Subsistence (البقاء) and its Secrets\n\nWhen you witness the establishment of Allah, exalted is He,\nOver every soul, including the trace that resides within it,\n\nThat is the Subsistence (البقاء) of which the men of the Path spoke,\nAnd you subsist by Him if you possess insight.\n\nSo exist by Him, and do not be characterized by mere thought,\nFor the 'other' is only derived from the 'other.'\n\nAnd where is the 'other'? There is nothing in the entire cosmos\nSave the Existence (الوجود) which you call 'humanity' (البشر).\n\nFor it is a Name that encompasses the entire cosmos,\nEssentially and cognitively, so do not depart from the forms.\n\n### [That Subsistence (البقاء) is the Perpetuity of Acts of Obedience, just as Annihilation (الفناء) is the Annihilation of Acts of Disobedience]\n\nKnow that Subsistence (البقاء), according to some of the Sufi community (الطائفة), is the perpetuity of acts of obedience, just as Annihilation (الفناء), according to the proponent of this view, was the annihilation of acts of disobedience. According to others, Subsistence is the perpetuity of the servant's witnessing of Allah's establishment over everything. This is the view of those who defined Annihilation as the annihilation of the servant's witnessing of his own action due to the establishment of Allah, the Exalted, over that action. According to yet others, Subsistence is subsistence *by* The Real (بالحق), which is the view of those who defined Annihilation as annihilation *from* Creation (عن الخلق).\n\n### [That Subsistence (البقاء) is a Relation (نسبة) to The Real (الحق)]\n\nKnow that the relation (نسبة) of Subsistence (البقاء), in our view, is nobler in this Path than the relation of Annihilation (الفناء). This is because Annihilation is always from what is lower in degree, according to the one undergoing annihilation, while Subsistence is always by what is higher in degree, according to the one subsisting. Annihilation is that which causes you to be annihilated from something, thus it holds power and authority over you. Subsistence, however, is your relation to The Real (الحق) and your attribution to Him—meaning Subsistence as understood by the People of Allah (أهل الله) in their technical usage within this Path. Annihilation is your relation to the Cosmos (الكون), for you say, \"I was annihilated from such-and-such.\" Since your relation to The Real is higher, Subsistence is preferable in terms of relation. This is because they are two interconnected states: no one subsists in this Path except one who has been annihilated, and no one is annihilated except one who subsists. The one characterized by Annihilation is only so in the state of Subsistence, and the one characterized by Subsistence is only so in the state of Annihilation. Thus, in the relation of Subsistence, there is the witnessing (شهود) of The Real (حق), and in the relation of Annihilation, there is the witnessing of Creation (خلق). This is because you do not say, \"I was annihilated from such-and-such,\" except while conceiving of that from which you were annihilated. Your very conception of it is your very witnessing of it, for it must be present in your soul for you to conceive of the ruling of annihilation from it. Likewise, Subsistence necessitates the witnessing of that by which you subsist. Since Subsistence in this Path is only *by* The Real, the witnessing of The Real is necessary. It is necessary that you make Him present in your heart and conceive of Him. Only then do you say, \"I subsisted by The Real (بالحق).\" This relation is nobler and higher due to the loftiness of that to which the relation is made. Thus, the state of Subsistence is higher than the state of Annihilation, even though they are inseparable and may occur for the individual at the same time. There is no obscurity for one possessing sound insight regarding the difference in nobility and degree between the two relations.\n\nThe explanation of this station is contained within the explanation of the Chapter on Annihilation (الفناء). This is because we must look at the cause that annihilated you from something in every type of annihilation; that cause is what you subsist with. This is the summary of this chapter. However, there is a verification here that occurs only in Annihilation. Subsistence (البقاء) is a relation (نسبة) that neither vanishes nor changes; its ruling is fixed, both in relation to The Real (حق) and to Creation (خلق), and it is a Divine Attribute (نعت إلهي). Annihilation (الفناء) is a relation that vanishes; it is a cosmic attribute (نعت كياني) that has no entry into the Divine Presence (حضرة الحق). Every attribute that is related to both sides (Divine and cosmic) is more complete and higher than the attribute specific only to the cosmic side, except for Servitude (العبودة). The relation of Servitude to the Cosmos is more complete and higher than the relation of Lordship (الربوبية) and Sovereignty (السيادة) to it. If you say that Annihilation relates to and is necessary for Servitude, we reply that it cannot be like Servitude, for Servitude is a fixed attribute that is never lifted from the Cosmos. Annihilation, however, may annihilate the servant from his servitude and from his very self, so its ruling differs from the ruling of Servitude. Any matter that removes a thing from its origin or veils it from its reality does not possess that high degree of nobility according to the Sufi community (الطائفة), for it presents the matter to you contrary to what it truly is, thus associating you with the ignorant. Subsistence (البقاء) is the state of the fixed servant (العبد الثابت) that does not vanish, for the non-existence of his Fixed Entity (عينه الثابتة) is impossible, just as it is impossible for his entity to be characterized as the very Essence (عين) of Existence (الوجود). Rather, Existence is his attribute after he was not. We say this because The Real is Existence, and it is not necessary—indeed, it is impossible—for the attribute to be the very essence of the characterized. The servant remains subsistent in his entity, fixed in Existence in his Servitude, and perpetual in that ruling: <<إِنْ كُلُّ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ إِلَّا آتِي الرَّحْمَنِ عَبْدًا>> (There is none in the heavens and the earth but comes to the Most Merciful as a servant). <<مَا عِنْدَكُمْ يَنْفَدُ وَمَا عِنْدَ اللَّهِ بَاقٍ>> (What is with you vanishes, and what is with Allah subsists). Thus, we are with Him, and He is with us. The Real is the vanishing (النفاد) and the Subsistence (البقاء) by virtue of those whom this verse includes. Vanishing is Annihilation (فناء). Subsistence is the attribute of Existence (الوجود) in terms of its substance (جوهر), while Annihilation is the attribute of accident (العرض) in terms of its essence, or rather, the attribute of all other categories besides substance. We have alluded here to what is sufficient <<لِمَنْ كَانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ>> (for one who has a heart or gives ear) to the address of The Real <<وَهُوَ شَهِيدٌ>> (while he is a witness).",
    "ur": "باب نمبر دو سو اکیس: بقا (Baqāʾ) اور اس کے اسرار کی معرفت میں\n\nجب تو دیکھے کہ اللہ جل جلالہ کا قیام ہر نفس پر ہے، اس اثر کے ساتھ جو ان میں موجود ہے۔\nیہی وہ بقا (Baqāʾ) ہے جس کا ذکر اہلِ معرفت نے کیا، اور اگر تو صاحبِ نظر ہے تو تو بھی اسی کے ساتھ باقی ہے۔\nپس تو اسی کے ساتھ ہو، فکر کے ساتھ متصف نہ ہو، کیونکہ غیر تو غیر سے ہی مشتق ہوتا ہے۔\nاور غیر کہاں ہے؟ جبکہ پوری کائنات (الکون) میں اس ہستی (الوجود) کے سوا کچھ نہیں جسے تو بشر کہتا ہے۔\nکیونکہ یہ (بشر) ایک ایسا نام ہے جو کائنات (الکون) کو عین اور علم کے اعتبار سے محیط ہے، پس تو صورتوں سے باہر نہ نکل۔\n\n[کہ بقا (Baqāʾ) طاعات کی بقا ہے، جیسا کہ فنا (Fanāʾ) معاصی کی فنا ہے]\n\nجان لو کہ بعض طائفہ (صوفیاء کا گروہ) کے نزدیک بقا (Baqāʾ) طاعات (نیک اعمال) کی بقا ہے، جیسا کہ اس قول کے قائل کے نزدیک فنا (Fanāʾ) معاصی (گناہوں) کی فنا تھی۔ اور بعض کے نزدیک بقا (Baqāʾ) بندے کا اللہ تعالیٰ کے ہر شے پر قائم ہونے کا شہود (الشہود) ہے۔ اور یہ اس شخص کا قول ہے جس نے فنا (Fanāʾ) کے بارے میں کہا کہ یہ بندے کا اپنے فعل کو اللہ تعالیٰ کے اس پر قائم ہونے کے سبب فنا کر دینا ہے۔ اور بعض کے نزدیک بقا (Baqāʾ) حق (الحق) کے ساتھ بقا ہے، اور یہ اس شخص کا قول ہے جس نے فنا (Fanāʾ) کے بارے میں کہا کہ یہ خلق (الخلق) سے فنا ہے۔\n\n[کہ بقا (Baqāʾ) کی نسبت حق (الحق) کی طرف ہے]\n\nجان لو کہ ہمارے نزدیک اس طریق میں بقا (Baqāʾ) کی نسبت فنا (Fanāʾ) کی نسبت سے زیادہ شرف والی ہے، کیونکہ فنا (Fanāʾ) ہمیشہ فانی کے نزدیک منزلت میں ادنیٰ سے ہوتی ہے، اور بقا (Baqāʾ) ہمیشہ باقی کے نزدیک منزلت میں اعلیٰ کے ساتھ ہوتی ہے۔ پس فنا (Fanāʾ) ہی وہ ہے جس نے تجھے فلاں شے سے فنا کیا، لہٰذا اس کے لیے تجھ میں قوت اور سلطنت ہے۔ اور بقا (Baqāʾ) تیری نسبت حق (الحق) کی طرف ہے اور تیرا اس کی طرف منسوب ہونا ہے— میرا مطلب ہے کہ اہلِ اللہ کے نزدیک اس طریق میں بقا (Baqāʾ) ان کی اصطلاح کے مطابق ہے۔ اور فنا (Fanāʾ) تیری نسبت کائنات (الکون) کی طرف ہے، کیونکہ تو کہتا ہے کہ میں فلاں شے سے فنا ہو گیا، اور تیری نسبت حق (الحق) کی طرف اعلیٰ ہے، لہٰذا نسبت میں بقا (Baqāʾ) اولیٰ ہے۔ کیونکہ یہ دونوں ایسی حالتیں ہیں جو ایک دوسرے سے جڑی ہوئی ہیں، پس اس طریق میں کوئی باقی نہیں رہتا مگر وہ جو فانی ہو، اور کوئی فنا نہیں ہوتا مگر وہ جو باقی ہو۔ اور فنا (Fanāʾ) کے ساتھ موصوف شخص بقا (Baqāʾ) کی حالت میں ہی ہو سکتا ہے، اور بقا (Baqāʾ) کے ساتھ موصوف شخص فنا (Fanāʾ) کی حالت میں ہی ہو سکتا ہے۔ پس بقا (Baqāʾ) کی نسبت میں حق (الحق) کا شہود (الشہود) ہے، اور فنا (Fanāʾ) کی نسبت میں خلق (الخلق) کا شہود (الشہود) ہے۔ کیونکہ تو یہ نہیں کہتا کہ میں فلاں شے سے فنا ہو گیا، مگر اس کے ساتھ کہ تو اس شے کا تعقل (ادراک) کر رہا ہو جس سے تو فنا ہوا ہے، اور تیرا اس کا تعقل کرنا ہی تیرا اس کا شہود (الشہود) کرنا ہے، کیونکہ اس سے فنا کے حکم کا تعقل کرنے کے لیے ضروری ہے کہ تو اسے اپنے نفس میں حاضر کرے۔ اسی طرح بقا (Baqāʾ) میں بھی اس کا شہود (الشہود) ضروری ہے جس کے ساتھ تو باقی ہے۔ اور اس طریق میں بقا (Baqāʾ) حق (الحق) کے ساتھ ہی ہو سکتی ہے، لہٰذا حق (الحق) کا شہود (الشہود) ضروری ہے۔ کیونکہ ضروری ہے کہ تو اسے اپنے قلب میں حاضر کرے اور اس کا تعقل کرے۔ تب ہی تو کہے گا کہ میں حق (الحق) کے ساتھ باقی رہا۔ اور یہ نسبت زیادہ شرف والی اور اعلیٰ ہے، کیونکہ جس کی طرف نسبت کی گئی ہے وہ بلند ہے۔ پس بقا (Baqāʾ) کی حالت فنا (Fanāʾ) کی حالت سے اعلیٰ ہے، اگرچہ وہ دونوں لازم و ملزوم ہوں اور ایک ہی وقت میں شخص کے لیے ہوں۔ پس سلیم نظر والے کے نزدیک شرف اور منزلت میں دونوں نسبتوں کے فرق میں کوئی پوشیدگی نہیں۔ \"اس مقام کی شرح باب الفنا کی شرح میں شامل ہے\"۔ اور وہ یہ ہے کہ ہم فنا (Fanāʾ) کی ہر قسم میں اس سبب کو دیکھیں جس نے تجھے فلاں شے سے فنا کیا، پس وہی وہ ہے جس کے ساتھ تو باقی ہے۔ یہ اس باب کا خلاصہ ہے۔ مگر یہاں ایک ایسی تحقیق ہے جو صرف فنا (Fanāʾ) میں ہی ہو سکتی ہے، اور وہ یہ ہے کہ بقا (Baqāʾ) ایک ایسی نسبت ہے جو زائل نہیں ہوتی اور نہ ہی بدلتی ہے، اس کا حکم حق (الحق) اور خلق (الخلق) دونوں میں ثابت ہے، اور یہ ایک الٰہی نعت (صفت) ہے۔ اور فنا (Fanāʾ) ایک ایسی نسبت ہے جو زائل ہو جاتی ہے، اور یہ ایک کیانی (وجودی) نعت ہے جس کا حضرت حق (الحق) میں کوئی دخل نہیں۔ اور ہر وہ نعت جو دونوں جانبوں سے منسوب ہو، وہ اس نعت سے زیادہ کامل اور اعلیٰ ہے جو صرف کونی (کائناتی) جانب کے ساتھ مخصوص ہو، سوائے عبودیت کے۔ کیونکہ اس کی نسبت کائنات (الکون) کی طرف، ربوبیت اور سیادت کی نسبت اس کی طرف ہونے سے زیادہ کامل اور اعلیٰ ہے۔ اگر تو کہے کہ فنا (Fanāʾ) عبودیت کی طرف لوٹتی ہے اور اس کے لیے لازم ہے، تو ہم کہیں گے کہ یہ عبودیت کی طرح صحیح نہیں ہو سکتی، کیونکہ عبودیت ایک ثابت نعت ہے جو کائنات (الکون) سے ختم نہیں ہوتی، جبکہ فنا (Fanāʾ) بندے کو اس کی عبودیت اور اس کے نفس سے بھی فنا کر سکتی ہے، لہٰذا اس کا حکم عبودیت کے حکم سے مختلف ہے۔ اور ہر وہ امر جو شے کو اس کی اصل سے نکال دے اور اسے اس کی حقیقت سے حجاب میں ڈال دے، وہ طائفہ (صوفیاء) کے نزدیک اس شرف کا حامل نہیں ہوتا، کیونکہ اس نے تجھے معاملہ اس کے خلاف دیا جو وہ حقیقت میں ہے، پس تجھے جاہلوں کے ساتھ ملا دیا۔ اور بقا (Baqāʾ) بندے کی وہ ثابت حالت ہے جو زائل نہیں ہوتی، کیونکہ اس کی ثابت عین کا معدوم ہونا محال ہے، جیسا کہ اس کی عین کا ہستی (الوجود) کی عین ہونے کی صفت سے متصف ہونا محال ہے۔ بلکہ ہستی (الوجود) اس کی نعت ہے جب کہ وہ (عین) نہیں تھی۔ اور ہم نے یہ اس لیے کہا کہ حق (الحق) ہی ہستی (الوجود) ہے، اور یہ لازم نہیں آتا کہ صفت عین موصوف ہو، بلکہ یہ محال ہے۔ اور بندہ اپنے ثبوت میں باقی العین ہے، اپنی عبودیت میں ثابت الوجود ہے، اور اس میں دائمی الحکم ہے۔\nإِنْ كُلُّ من في السَّماواتِ والْأَرْضِ إِلَّا آتِي الرَّحْمنِ عَبْداً\n\"آسمانوں اور زمین میں جو کوئی بھی ہے، وہ رحمن کے حضور بندہ بن کر ہی حاضر ہونے والا ہے۔\" (مریم: ۹۳)\nما عِنْدَكُمْ يَنْفَدُ وما عِنْدَ الله باقٍ\n\"جو کچھ تمہارے پاس ہے وہ ختم ہو جائے گا، اور جو کچھ اللہ کے پاس ہے وہ باقی رہنے والا ہے۔\" (النحل: ۹۶)\nپس ہم اس کے پاس ہیں اور وہ ہمارے پاس ہے۔ پس حق (الحق) نفاد (ختم ہونا) اور بقا (Baqāʾ) ہے اس کے ساتھ جس کے ساتھ اس آیت نے اسے ملحق کیا۔ اور نفاد فنا (Fanāʾ) ہے، اور بقا (Baqāʾ) جوہر کے لحاظ سے ہستی (الوجود) کی نعت ہے، اور فنا (Fanāʾ) ذات کے لحاظ سے عرض کی نعت ہے، بلکہ جوہر کے علاوہ باقی تمام مقولات (Categories) کی نعت ہے۔ اور ہم نے اس کی طرف اشارہ کر دیا ہے جو اس شخص کے لیے کافی ہے لِمَنْ كانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ (جس کے پاس قلب ہو یا جس نے کان لگا کر سنا ہو) حق (الحق) کے خطاب کو وَهُوَ شَهِيدٌ (اور وہ شاہد ہو)۔",
    "fa": "«باب دویست و بیست و یکم در معرفت بقا (البقاء) و اسرار آن»\n\nاگر دیدی که حق (الحق) جلّ و علا بر *** هر نفسی با آنچه از اثر در آن است، قائم است\n\nآن است بقایی (البقاء) که مردان از آن سخن گفتند *** و تو نیز به آن باقی هستی اگر صاحب نظر باشی\n\nپس به او باش و به فکر (الفکر) متصف مشو *** زیرا که غیر (الغیر) تنها از غیر مشتق می‌شود\n\nو غیر کجاست؟ و در تمام کَون (الکون) نیست *** جز آن هستی (الوجود) که آن را بشر می‌خوانی\n\nزیرا آن (هستی) نامی است که تمام کَون (الکون) را *** از حیث عین و علم در بر می‌گیرد، پس از صورت‌ها خارج مشو\n\n### [اینکه بقا (البقاء) بقای طاعات است، همان‌طور که فنا (الفناء) فنای معاصی است]\n\nبدان که بقا (البقاء) نزد برخی از طایفه (الطائفة)، بقای طاعات است، همان‌طور که فنا (الفناء) نزد صاحب این قول، فنای معاصی بود. و نزد برخی دیگر، بقا (البقاء) بقای رؤیت بنده نسبت به قیام حق (الله) بر هر چیزی است. و این قول کسی است که در باب فنا (الفناء) گفته است که آن فنای رؤیت فعل بنده است به واسطه قیام حق تعالی بر آن. و نزد برخی دیگر، بقا (البقاء) بقا به حق (الحق) است، و این قول کسی است که در باب فنا (الفناء) گفته است که آن فنا از خلق (الخلق) است.\n\n### [اینکه بقا (البقاء) نسبتی به حق (الحق) است]\n\nبدان که نسبت بقا (البقاء) نزد ما در این طریق شریف‌تر از نسبت فنا (الفناء) است. زیرا فنا (الفناء) همیشه از مرتبه پایین‌تر است نزد فانی، و بقا (البقاء) همیشه به مرتبه بالاتر است نزد باقی. زیرا فنا (الفناء) همان چیزی است که تو را از فلان چیز فانی می‌کند، پس آن (فنا) در تو قدرت و سلطنت دارد. و بقا (البقاء) نسبت تو به حق (الحق) و اضافت تو به اوست؛ منظورم بقا (البقاء) در این طریق نزد اهل الله در اصطلاح ایشان است. و فنا (الفناء) نسبت تو به کَون (الکون) است، زیرا تو می‌گویی: «از فلان چیز فانی شدم.» و نسبت تو به حق (الحق) بالاتر است، پس بقا (البقاء) در نسبت اولی‌تر است. زیرا این دو، دو حال مرتبط به هم هستند؛ پس در این طریق کسی باقی نمی‌ماند مگر فانی، و کسی فانی نمی‌شود مگر باقی. و موصوف به فنا (الفناء) جز در حال بقا (البقاء) نیست، و موصوف به بقا (البقاء) جز در حال فنا (الفناء) نیست. پس در نسبت بقا (البقاء) شهود حق (الحق) است و در نسبت فنا (الفناء) شهود خلق (الخلق) است. زیرا تو نمی‌گویی «از فلان چیز فانی شدم» مگر با تعقل تو نسبت به آنچه از آن فانی شدی. و نفس تعقل تو نسبت به آن، عین شهود (الشهود) تو نسبت به آن است، زیرا ناگزیر باید آن را در نفس خود حاضر کنی تا حکم فنا (الفناء) از آن را تعقل نمایی. و همچنین بقا (البقاء) مستلزم شهود (الشهود) کسی است که به او باقی هستی، و بقا (البقاء) در این طریق جز به حق (الحق) نیست، پس شهود حق (الحق) ضروری است. زیرا ناگزیر باید او را در قلب خود حاضر کنی و او را تعقل نمایی، آنگاه می‌گویی: «به حق (الحق) باقی ماندم.» و این نسبت شریف‌تر و والاتر است به دلیل علوّ منسوبٌ‌الیه. پس حال بقا (البقاء) بالاتر از حال فنا (الفناء) است، هرچند که ملازم یکدیگر باشند و برای شخص در یک زمان باشند. پس نزد صاحب نظر سلیم، در تفاوت میان این دو نسبت از حیث شرافت و منزلت، هیچ پوشیدگی نیست. «شرح این مقام، شرح باب فنا (الفناء) را در بر می‌گیرد.» و آن این است که در هر نوعی از انواع فنا (الفناء)، به سببی بنگریم که تو را از فلان چیز فانی کرده است؛ همان سبب است که تو با آن باقی هستی. این چکیده این باب است، جز اینکه در اینجا تحقیقی وجود دارد که جز در فنا (الفناء) حاصل نمی‌شود. و آن این است که بقا (البقاء) نسبتی است که حکمش زایل و متحول نمی‌شود، حکمش ثابت است، هم حقاً و هم خلقاً، و آن نعت (صفت) الهی است. و فنا (الفناء) نسبتی است که زایل می‌شود و نعت (صفت) کِیانی است که در حضرت حق (الحق) راهی ندارد. و هر نعتی که به هر دو جانب (حق و خلق) نسبت داده شود، کامل‌تر و والاتر از نعتی است که مخصوص جانب کَونی است، مگر عبودیت (العبودة). زیرا نسبت آن (عبودیت) به کَون (الکون) کامل‌تر و والاتر از نسبت ربوبیت (الربوبية) و سیادت به آن است. اگر بگویی: «پس فنا (الفناء) به عبودیت (العبودة) باز می‌گردد و ملازم آن است»، می‌گوییم: «صحیح نیست که مانند عبودیت باشد.» زیرا عبودیت (العبودة) نعتی ثابت است که از کَون (الکون) برداشته نمی‌شود، در حالی که فنا (الفناء) گاهی او را از عبودیتش و از خودش فانی می‌سازد، پس حکم آن با حکم عبودیت متفاوت است. و هر امری که شیء را از اصلش خارج سازد و آن را از حقیقتش محجوب کند، نزد طایفه (الطائفة) آن شرافت را ندارد. زیرا آن (فنا) امر را بر خلاف آنچه هست به تو می‌دهد و تو را به جاهلان ملحق می‌سازد. و بقا (البقاء) حال ثابت بنده است که زایل نمی‌شود. زیرا معدوم شدن عین ثابت (عین الثابتة) او محال است، همان‌طور که متصف شدن عین او به اینکه عین هستی (الوجود) باشد، محال است. بلکه هستی (الوجود) نعت اوست پس از آنکه نبودی. و ما این را گفتیم زیرا حق (الحق) همان هستی (الوجود) است، و لازم نیست که صفت عین موصوف باشد، بلکه این محال است. و بنده در ثبوت خود باقی‌العین است، در عبودیت خود ثابت‌الوجود است و در این امر دائم‌الحکم است. إِنْ كُلُّ مَنْ فِي السَّماواتِ وَالْأَرْضِ إِلَّا آتِي الرَّحْمنِ عَبْداً (هیچ کس در آسمان‌ها و زمین نیست مگر آنکه بنده [و مطیع] رحمان است.) ما عِنْدَكُمْ يَنْفَدُ وَما عِنْدَ الله باقٍ (آنچه نزد شماست فانی می‌شود و آنچه نزد خداست باقی می‌ماند.) پس ما نزد او هستیم و او نزد ماست. بنابراین، حق (الحق) همان نفاد (فنا) و بقا (البقاء) است به واسطه کسی که این آیه آن را به او ملحق کرده است. و نفاد (النفاذ) همان فنا (الفناء) است، و بقا (البقاء) نعت هستی (الوجود) است از حیث جوهرش. و فنا (الفناء) نعت عَرَض (العرض) است از حیث ذاتش، بلکه نعت سایر مقولات (المقولات) است به جز جوهر (الجوهر). و ما به آنچه در آن کفایت است اشاره کردیم، برای لِمَنْ كانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ (کسی که قلب [آگاه] داشته باشد یا گوش فرا دهد) به خطاب حق (الحق) وَهُوَ شَهِيدٌ (در حالی که شاهد است)."
  },
  "page_count": 2
}