{
  "id": 406,
  "title": {
    "ar": "الباب السادس وأربعمائة في معرفة منازلة ما ظهر مني شي‏ء لشي‏ء ولا ينبغي أن يظهر",
    "en": "Chapter Four Hundred and Six: Concerning the Knowledge of the Station where nothing appeared from Me to anything, and it is not fitting that it should appear.",
    "ur": "باب چار سو چھ: اس روحانی منزل (منازلة) کی معرفت میں کہ مجھ سے کوئی شے کسی شے کے لیے ظاہر نہیں ہوئی، اور نہ ہی اس کا ظاہر ہونا مناسب ہے۔",
    "fa": "باب چهارصد و ششم: در معرفت (معرفة) منزلتِ [اینکه] هیچ چیز از من برای هیچ چیز ظاهر نشد و شایسته نیست که ظاهر شود"
  },
  "content": {
    "ar": "## «الباب السادس وأربعمائة في معرفة منازلة ما ظهر مني شي‏ء لشي‏ء ولا ينبغي أن يظهر»\n\n\n> لو ظهرنا للشي‏ء كان سوانا *** وسوانا ما ثم أين الظهور\n\n\n> أنت عين الوجود ما ثم غير *** ولهذا أنا الإله الغيور\n\n\n> لا تقل يا عبيد إنك أني *** أنا باق وأنت فإن تبور\n\n\n> كل وقت فأنت خلق جديد *** ولهذا لك الفناء والنشور\n\n\n### [وجود الله عين ظهوره‏]\n\n\nيقول الحق ما ثم شي‏ء أظهر إليه لأني عين كل شي‏ء فما أظهر إلا لمن ليست له شيئية الوجود فلا تراني إلا الممكنات في شيئية ثبوتها فما ظهرت إليها لأنها لم تزل معدومة وأنا لم أزل موجودا فوجودي عين ظهوري ولا ينبغي أن يكون الأمر إلا هكذا\nولما كانت إلا حكم فيما ظهر لأسمائي وفي نفس الأمر لأعيان الممكنات والوجود عيني لا غيري وفصلت الأحكام الإمكانية الصور في العين الواحدة كما يقول أهل النظر في تفصيل الأنواع في الجنس وتفصيل الأشخاص في النوع كذلك تفصيل الصور الإمكانية في العين وترى الأسماء أنا مسماها أعني الأسماء الحسنى فيجعل الأثر لها وفي الحقيقة ما الأثر إلا لأعيان الممكنات ولهذا ينطلق على صور أسماء الممكنات ومن أسماء الممكنات أسماء الله فلها نسبتان نسبة إلى الله تعالى ونسبة إلى صور الممكنات فالحق ليس بظاهر لأعيان صور الممكنات من حيث ما هي صور لها لا من حيث إنها ظهرت في عين الوجود الحق والشي‏ء إذا كان في الشي‏ء بمثل هذه الكينونة من القرب لا يمكن أن يراه فلا يمكن أن يظهر له كما نراه في الهواء ما منعنا من رؤيته إلا القرب المفرط فلا يمكن أن نراه ولا يمكن أن يظهر لنا عادة فلو تباعد عنا لرأيناه ومن المحال بعد الصور عن العين التي توجد فيها لأنها لو فارقتها انعدمت كما هو الأمر في نفسه فإن الصور في هذه العين تنعدم وهي في لبس من خلق جديد فالممكنات من حيث إن لها الأسماء الإلهية وهابة هذه الصور الظاهرة بعضها لبعض في عين الوجود فما أظهرت هذه الأعيان الممكنات صورة إلا بالأسماء الإلهية من قائل وقادر وخالق ورازق ومحي ومميت ومعز ومذل وأما الغني والعزة فهي للذات وهو الغني العزيز فغناها لها بكونها تعطي هذه الصور ولا تقبل العطاء لما تعطيه حقيقة ذاتها وأما العزة لها فإن هذه الصور لا تعطيها ولا تؤثر فيها علما بما تستفيده في حال وجودها بعضها من بعض فإن الأعيان هي المعطية لهذه الصور تلك العلوم التي استفادتها بالأسماء الإلهية وهذا معنى قوله تعالى حَتَّى نَعْلَمَ وهو العالم بلا شك فالحق عالم والأعيان عالمة ومستفيدة والعلم أنما هو عين الصور واستفادتها من الأسماء الإلهية التي أعطتها أعيان الممكنات العلوم ومن هنا تعلم حكم الكثرة والوحدة والمؤثر والمؤثر فيه والأثر ونسبة العالم من الله ونسبة تنوع الصور الظاهرة وما ظهر ومن ظهر وما بطن ومن بطن وحقيقة الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ وإنها نعوت لمن لِلَّهِ الْأَسْماءُ الْحُسْنى‏ فتحقق ما ذكرناه في هذا الباب فإنه نافع جدا يحوي على أمر عظيم لا يقدر قدره إلا الله فمن عرف هذا الباب عرف نفسه هل هو الصورة أو هو عين واهب الصورة أو هو عين العين الثابتة الممكنة التي لها العدم من ذاتها ومن عرف نفسه عرف ربه ضرورة فما يعرف الحق إلا الحق فلا تقدم ولا تأخر لأن الممكن في حال عدمه ليس بمتأخر عن الأزل المنسوب إلى وجود الحق لأن الأزل كما هو واجب لوجود الحق هو واجب لعدم الممكن وثبوته وتعيينه عند الحق ولو لا ما هو متعين عند الحق مميز عن ممكن آخر لما خصصه بالخطاب في قول كُنْ ومن عرف هذا الباب عرف من يقول كن ولمن يقال كن ومن يتكون عن قول كن ومن يقبل حكم الكاف والنون والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيل‏\n\n",
    "en": "## Chapter 406: On the Gnosis of the Station where nothing of Me is disclosed to anything, nor should it be disclosed\n\nIf We were disclosed to a thing, that thing would be other than Us,\nBut there is no other than Us, so where is the disclosure?\n\nYou are the very Essence (عين) of Existence; there is no other,\nAnd for this reason, I am the Jealous God (الإله الغيور).\n\nDo not say, O servant, that you are Me,\nI am Subsisting (باق), and you are perishing (تبور).\n\nAt every moment, you are a new creation (خلق جديد),\nAnd for this reason, annihilation (الفناء) and resurrection (النشور) belong to you.\n\n### [The Existence of Allah is the very Essence of His Disclosure]\n\nThe Real (الحق) says: There is nothing to which I am disclosed, because I am the very Essence (عين) of everything. Thus, I am only disclosed to that which does not possess the 'thingness' (شيئية) of Existence. Therefore, only the contingent things (الممكنات) see Me in the thingness of their fixedness (ثبوتها). I was not disclosed to them because they have never ceased to be non-existent (معدومة), while I have never ceased to be Existent (موجودا). Thus, My Existence (وجودي) is the very Essence of My Disclosure (ظهوري), and the matter should not be otherwise.\n\nSince there was nothing but a ruling (حكم) regarding what was disclosed to My Names (أسمائي), and in reality (في نفس الأمر), regarding the Fixed Entities (الأعيان الثابتة) of the contingent things, and since Existence (الوجود) is My Essence (عيني) and not other than Me, the contingent rulings (الأحكام الإمكانية) differentiated the forms (الصور) within the Single Essence (العين الواحدة), just as the people of speculation (أهل النظر) speak of the differentiation of species within the genus, and the differentiation of individuals within the species. Likewise is the differentiation of the contingent forms within the Essence.\n\nThe Names—meaning the Most Beautiful Names (الأسماء الحسنى)—see that I am their Named (مسماها), and thus the effect (الأثر) is attributed to them. Yet, in reality, the effect belongs only to the Fixed Entities (أعيان الممكنات) of the contingent things. For this reason, the Names of the contingent things are applied to their forms. And among the Names of the contingent things are the Names of Allah. These Names have two relations: a relation to Allah the Exalted, and a relation to the forms of the contingent things.\n\nThus, The Real (الحق) is not disclosed to the Fixed Entities of the forms of the contingent things insofar as they are forms for them, but rather insofar as they are disclosed within the very Essence of the Real Existence (عين الوجود الحق). When a thing is within another thing with such a degree of proximity (القرب), it cannot see it, nor can the latter be disclosed to it. This is like the air (الهواء) we see: nothing prevents us from seeing it except its excessive proximity (القرب المفرط). Thus, we cannot see it, nor can it customarily be disclosed to us. If it were to distance itself from us, we would see it.\n\nIt is impossible for the forms (الصور) to be distant from the Essence (العين) in which they exist, because if they were to separate from it, they would cease to exist (انعدمت). This is the reality of the matter itself, for the forms in this Essence cease to exist while they are simultaneously clothed in a new creation (خلق جديد).\n\nThe contingent things (الممكنات), insofar as they possess the Divine Names (الأسماء الإلهية), are the givers (وهابة) of these manifest forms to one another within the Essence of Existence (عين الوجود). These Fixed Entities (الأعيان الممكنات) did not manifest any form except through the Divine Names, such as the Speaker, the Powerful, the Creator, the Provider, the Giver of Life, the Giver of Death, the Honorer, and the Humiliator.\n\nAs for Self-Sufficiency (الغني) and Might (العزة), they belong to the Essence (الذات), which is the Self-Sufficient (الغني), the Mighty (العزيز). Its Self-Sufficiency belongs to it because it gives these forms but does not accept any gift in return for what the reality of its Essence gives. As for its Might, it is because these forms do not give to it nor do they affect it, knowing the benefit they gain from one another in the state of their existence. Indeed, the Fixed Entities (الأعيان) are the givers of those knowledges (العلوم) to these forms, which they benefited from through the Divine Names.\n\nThis is the meaning of His saying, the Exalted: <<حَتَّى نَعْلَمَ>> (Until We know), and He is undoubtedly the Knower (العالم). Thus, The Real (الحق) is Knower, and the Fixed Entities (الأعيان) are knowing and benefiting. Knowledge (العلم) is nothing but the very Essence of the forms and their benefit derived from the Divine Names, which the Fixed Entities of the contingent things granted them as knowledge.\n\nFrom this, you understand the ruling concerning Multiplicity (الكثرة) and Unity (الوحدة), the Effector (المؤثر) and the Affected (المؤثر فيه), and the Effect (الأثر); the relation of the cosmos (العالم) to Allah; the relation of the variety of manifest forms; what is disclosed and who is disclosed; what is hidden and who is hidden; and the reality of <<الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ>> (The First, the Last, the Manifest, and the Hidden), and that these are attributes belonging to Him <<لِلَّهِ الْأَسْماءُ الْحُسْنى‏>> (To Allah belong the Most Beautiful Names).\n\nTherefore, realize what We have mentioned in this chapter, for it is extremely beneficial, encompassing a tremendous matter whose true measure none but Allah can estimate. Whoever knows this chapter knows himself: whether he is the form (الصورة), or the Essence (عين) of the Giver of the form, or the very Essence of the contingent Fixed Entity (العين الثابتة الممكنة) which possesses non-existence (العدم) inherently.\n\nAnd whoever knows himself necessarily knows his Lord. For none knows The Real (الحق) except The Real. Thus, there is neither precedence nor subsequence, because the contingent thing (الممكن) in its state of non-existence is not subsequent to the Eternity (الأزل) attributed to the Existence (وجود) of The Real. For Eternity (الأزل), just as it is necessary for the Existence of The Real, is also necessary for the non-existence, fixedness (ثبوته), and determination (تعيينه) of the contingent thing in the presence of The Real. Were it not for that which is determined in the presence of The Real and distinguished from another contingent thing, He would not have singled it out for the address in the saying: \"Be (كُنْ).\"\n\nWhoever knows this chapter knows who says \"Be (كُنْ),\" to whom \"Be\" is said, what comes into being (يتكون) from the saying of \"Be,\" and who accepts the ruling of the *Kāf* and the *Nūn*. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيل‏>> (says the Truth, and He guides to the Way).",
    "ur": "باب چار سو چھ (۴۰۶) اس معرفت کے بیان میں کہ مجھ سے کوئی شے کسی شے کے لیے ظاہر نہیں ہوئی اور نہ ہی اسے ظاہر ہونا چاہیے۔\n\n> لو ظهرنا للشي‏ء كان سوانا *** وسوانا ما ثم أين الظهور\nاگر ہم کسی شے کے لیے ظاہر ہوتے تو وہ ہمارے سوا ہوتی / اور ہمارے سوا کوئی نہیں، تو پھر ظہور (الظہور) کہاں ہے؟\n\n> أنت عين الوجود ما ثم غير *** ولهذا أنا الإله الغيور\nتو عین الوجود (عين الوجود) ہے، کوئی غیر نہیں / اور اسی لیے میں معبود غیور (الإله الغيور) ہوں۔\n\n> لا تقل يا عبيد إنك أني *** أنا باق وأنت فإن تبور\nاے بندے، یہ نہ کہہ کہ تو میں ہے / میں باقی (باق) ہوں اور تو فانی (فان) ہے، تباہ ہو جائے گا۔\n\n> كل وقت فأنت خلق جديد *** ولهذا لك الفناء والنشور\nہر لمحہ تو ایک نئی تخلیق ہے / اور اسی لیے تیرے لیے فنا (الفناء) اور حشر (النشور) ہے۔\n\n### اللہ کا وجود (الوجود) ہی اس کا عین ظہور (الظہور) ہے۔\n\nذات حق (الحق) فرماتی ہے کہ کوئی شے ایسی نہیں جس کے لیے میں ظاہر ہوں، کیونکہ میں ہر شے کا عین (عين كل شي‏ء) ہوں۔ پس میں صرف اس کے لیے ظاہر ہوتا ہوں جس کے لیے وجود (الوجود) کی شیئیت (thingness) نہیں ہے۔ لہٰذا مجھے صرف ممکنات (الممكنات) ہی اپنے ثبوت (ثبوت) کی شیئیت میں دیکھتی ہیں۔ میں ان کے لیے ظاہر نہیں ہوا کیونکہ وہ ہمیشہ سے معدوم (non-existent) تھیں اور میں ہمیشہ سے موجود (existent) تھا۔ پس میرا وجود (الوجود) ہی میرا عین ظہور (عين ظهوري) ہے، اور معاملہ ایسا ہی ہونا چاہیے۔\n\nاور جب یہ صرف ایک حکم تھا جو میرے اسماء (أسماء) کے لیے ظاہر ہوا، اور نفس الامر میں ممکنات (الممكنات) کے اعیان (fixed entities) کے لیے، اور وجود (الوجود) میرا عین (عين) ہے نہ کہ میرا غیر، تو امکانی احکام (الأحكام الإمكانية) نے ایک ہی عین (عين) میں صورتوں کو الگ الگ کر دیا، جیسا کہ اہل نظر (اہل نظر) جنس میں انواع کی تفصیل اور نوع میں اشخاص کی تفصیل کے بارے میں کہتے ہیں۔ اسی طرح امکانی صورتوں کی تفصیل عین (عين) میں ہے۔ اور اسماء (أسماء) یہ دیکھتی ہیں کہ میں ان کا مسمیٰ ہوں، یعنی اسماء حسنیٰ (الأسماء الحسنىٰ)، پس اثر ان کے لیے قرار دیا جاتا ہے، حالانکہ حقیقت میں اثر ممکنات (الممكنات) کے اعیان (اعیان) کے سوا کسی کے لیے نہیں ہے۔ اور اسی لیے یہ ممکنات کی صورتوں کے اسماء (أسماء) پر لاگو ہوتا ہے۔ اور ممکنات کے اسماء میں سے اللہ کے اسماء بھی ہیں، پس ان کے دو نسبتیں ہیں: ایک اللہ تعالیٰ کی طرف نسبت اور دوسری ممکنات کی صورتوں کی طرف نسبت۔ پس ذات حق (الحق) ممکنات کی صورتوں کے اعیان (اعیان) کے لیے ظاہر نہیں ہے اس حیثیت سے کہ وہ ان کی صورتیں ہیں، نہ کہ اس حیثیت سے کہ وہ عین الوجود الحق (عين الوجود الحق) میں ظاہر ہوئی ہیں۔ اور جب کوئی شے کسی شے میں اس طرح کے قرب (قرب) کے ساتھ موجود ہو تو اسے دیکھنا ممکن نہیں ہوتا، اور نہ ہی اس کے لیے ظاہر ہونا ممکن ہوتا ہے، جیسا کہ ہم ہوا کو دیکھتے ہیں؛ ہمیں اس کے دیکھنے سے صرف انتہائی قرب (القرب المفرط) نے روکا ہے۔ لہٰذا ہم اسے دیکھ نہیں سکتے اور نہ ہی وہ ہمارے لیے عادتاً ظاہر ہو سکتی ہے۔ اگر وہ ہم سے دور ہو جاتی تو ہم اسے دیکھ لیتے۔ اور صورتوں کا اس عین (عين) سے دور ہونا محال ہے جس میں وہ موجود ہیں، کیونکہ اگر وہ اس سے جدا ہو جائیں تو معدوم ہو جائیں گی، جیسا کہ معاملہ فی نفسہ ہے۔ پس اس عین (عين) میں صورتیں معدوم ہو جاتی ہیں اور وہ خلق جدید (خلق جديد) کے لباس میں ہوتی ہیں۔\n\nپس ممکنات (الممكنات) اس حیثیت سے کہ ان کے لیے اسماء الٰہیہ (الأسماء الإلهية) ہیں، وجود (الوجود) کے عین (عين) میں ان ظاہر صورتوں کو ایک دوسرے کو عطا کرنے والی ہیں۔ اور ان اعیان ممکنات (أعيان الممكنات) نے کوئی صورت ظاہر نہیں کی مگر اسماء الٰہیہ (الأسماء الإلهية) کے ذریعے، جیسے قائل (کہنے والا)، قادر (قدرت والا)، خالق (پیدا کرنے والا)، رازق (رزق دینے والا)، محیی (زندہ کرنے والا)، ممیت (موت دینے والا)، معز (عزت دینے والا)، اور مذل (ذلت دینے والا)۔ اور جہاں تک غنی (Richness) اور عزت (Might) کا تعلق ہے، وہ ذات (الذات) کے لیے ہیں، اور وہ الغنی العزیز (غنی اور غالب) ہے۔ پس اس کا غنی (غنی) اس لیے ہے کہ وہ ان صورتوں کو عطا کرتی ہے اور جو کچھ وہ اپنی حقیقت ذات (حقيقة ذاتها) سے عطا کرتی ہے، اسے قبول نہیں کرتی۔ اور جہاں تک اس کی عزت (عزت) کا تعلق ہے، تو یہ صورتیں اسے کچھ عطا نہیں کرتیں اور نہ ہی اس پر اثر انداز ہوتی ہیں، اس علم کی بنا پر جو وہ اپنے وجود (وجود) کی حالت میں ایک دوسرے سے حاصل کرتی ہیں۔ کیونکہ اعیان (اعیان) ہی ان صورتوں کو وہ علوم عطا کرنے والی ہیں جو انہوں نے اسماء الٰہیہ (الأسماء الإلهية) کے ذریعے حاصل کیے ہیں۔ اور یہی اللہ تعالیٰ کے اس فرمان کا مفہوم ہے:\n\n> **حَتَّى نَعْلَمَ** (یہاں تک کہ ہم جان لیں)\n\nاور وہ بلاشبہ عالم (جاننے والا) ہے۔ پس ذات حق (الحق) عالم ہے اور اعیان (اعیان) بھی عالم اور مستفید (فائدہ اٹھانے والی) ہیں۔ اور علم (علم) صرف صورتوں کا عین (عين) ہے اور ان کا اسماء الٰہیہ (الأسماء الإلهية) سے استفادہ کرنا ہے جو اعیان ممکنات (أعيان الممكنات) نے انہیں علوم عطا کیے ہیں۔ اور یہیں سے تم کثرت (الكثرة) اور وحدت (الوحدة)، مؤثر (اثر ڈالنے والا)، مؤثر فیہ (جس پر اثر ڈالا گیا)، اور اثر (الأثر) کا حکم جان سکتے ہو۔ اور اللہ سے عالم (عالم) کی نسبت، اور ظاہر ہونے والی صورتوں کے تنوع کی نسبت، اور جو ظاہر ہوا، اور جس نے ظاہر کیا، اور جو باطن ہوا، اور جس نے باطن کیا، اور الْأَوَّلُ (اول)، الْآخِرُ (آخر)، الظَّاهِرُ (ظاہر)، اور الْبَاطِنُ (باطن) کی حقیقت کو جان سکتے ہو، اور یہ کہ یہ ان کے اوصاف ہیں جن کے لیے\n\n> **لِلَّهِ الْأَسْمَاءُ الْحُسْنَىٰ** (اللہ ہی کے لیے اسماء حسنیٰ ہیں)\n\nپس اس باب میں جو کچھ ہم نے ذکر کیا ہے اسے متحقق کرو، کیونکہ یہ بہت نفع بخش ہے اور ایک عظیم امر پر مشتمل ہے جس کی قدر اللہ کے سوا کوئی نہیں جانتا۔ پس جس نے اس باب کو پہچان لیا، اس نے اپنے نفس کو پہچان لیا کہ آیا وہ صورت ہے، یا وہ صورت عطا کرنے والے کا عین (عين) ہے، یا وہ اس ثابت ممکن عین (عين) کا عین ہے جس کے لیے عدم (عدم) اس کی ذات سے ہے۔ اور جس نے اپنے نفس کو پہچان لیا، اس نے اپنے رب کو ضرور پہچان لیا۔ پس ذات حق (الحق) کو حق کے سوا کوئی نہیں پہچانتا۔ پس نہ کوئی تقدم ہے اور نہ کوئی تاخر، کیونکہ ممکن (الممكن) اپنی عدم (عدم) کی حالت میں اس ازل (ازل) سے مؤخر نہیں ہے جو وجود حق (وجود الحق) سے منسوب ہے۔ کیونکہ ازل (ازل) جیسا کہ وجود حق کے لیے واجب ہے، ویسا ہی ممکن کے عدم (عدم)، اس کے ثبوت (ثبوت) اور حق کے ہاں اس کے تعین (تعیین) کے لیے بھی واجب ہے۔ اور اگر وہ حق کے ہاں متعین (متعین) ہو کر دوسرے ممکن سے ممتاز نہ ہوتا تو اللہ تعالیٰ اسے اپنے اس خطاب میں خاص نہ کرتا:\n\n> **كُنْ** (ہو جا!)\n\nاور جس نے اس باب کو پہچان لیا، اس نے پہچان لیا کہ کون \"کن\" کہتا ہے، اور کس سے \"کن\" کہا جاتا ہے، اور کون \"کن\" کے قول سے وجود میں آتا ہے، اور کون کاف اور نون (الكاف والنون) کے حکم کو قبول کرتا ہے۔\n\n> **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راہ دکھاتا ہے)",
    "fa": "باب چهارصد و شصتم در معرفت منزلتی که هیچ چیزی از من برای هیچ چیزی ظاهر نشد و شایسته نیست که ظاهر شود.\n\nاگر برای چیزی ظاهر می‌شدیم، آن چیز غیر ما بود،\nو چون غیری در کار نیست، پس ظهور کجاست؟\n\nتو عین هستی (الوجود) هستی و غیری در کار نیست،\nو از این روست که من خدای غیورم.\n\nای بنده، مگو که تو من هستی،\nمن باقی هستم و تو فانی و نابود شونده‌ای.\n\nتو در هر لحظه آفرینشی نو هستی،\nو از این روست که فنا (الفناء) و برانگیختن (النشور) از آنِ توست.\n\n### [هستی (وجود) خداوند عین ظهور اوست]\n\nحق (الحق) می‌گوید: هیچ چیزی نیست که من برای آن ظاهر شوم، زیرا من عین هر چیزی هستم. پس ظاهر نمی‌شوم مگر برای کسی که شیئیت هستی (شيئية الوجود) ندارد. بنابراین، مرا نمی‌بینند مگر ممکنات (الممكنات) در شیئیت ثبوتشان. من برای آن‌ها ظاهر نشدم، زیرا آن‌ها پیوسته معدوم بوده‌اند و من پیوسته موجود. پس هستی (وجود) من عین ظهور من است و شایسته نیست که امر جز این باشد.\n\nو چون جز حکم در آنچه برای اسماء من ظاهر شد و در نفس‌الامر برای اعیان ممکنات (أعيان الممكنات) نبود، و هستی (الوجود) عین من است نه غیر من، احکام امکانی، صور را در عین (العين) واحد تفصیل دادند؛ همان‌گونه که اهل نظر در تفصیل انواع در جنس و تفصیل اشخاص در نوع می‌گویند. همچنین تفصیل صور امکانی در عین (العين). و اسماء (الأسماء) می‌بینند که من مسمای آن‌ها هستم، یعنی اسماء حسنی (الأسماء الحسنى). پس اثر را به آن‌ها نسبت می‌دهند، در حالی که در حقیقت، اثر جز برای اعیان ممکنات (أعيان الممكنات) نیست. از این رو، بر صور اسماء ممکنات اطلاق می‌شود، و از جمله اسماء ممکنات، اسماء الله هستند. پس آن‌ها دو نسبت دارند: نسبتی به خداوند متعال و نسبتی به صور ممکنات.\n\nحق (الحق) برای اعیان صور ممکنات از آن جهت که صور آن‌ها هستند، ظاهر نیست؛ نه از آن جهت که در عین هستی حق (عين الوجود الحق) ظاهر شده‌اند. و شیء اگر در شیء دیگری با چنین نزدیکی و کینونتی باشد، ممکن نیست که آن را ببیند و ممکن نیست که برای آن ظاهر شود؛ همان‌گونه که در مورد هوا می‌بینیم که چیزی جز نزدیکی مفرط، ما را از دیدن آن باز نمی‌دارد. پس نه می‌توانیم آن را ببینیم و نه می‌تواند به طور معمول برای ما ظاهر شود. اگر از ما دور می‌شد، آن را می‌دیدیم. و محال است که صور از عینی که در آن موجود شده‌اند، دور شوند، زیرا اگر از آن جدا شوند، معدوم می‌گردند. همان‌گونه که امر در نفس خود چنین است، صور در این عین معدوم می‌شوند در حالی که در پوشش آفرینشی نو (خلق جديد) هستند.\n\nممکنات (الممكنات) از آن جهت که اسماء الهی را دارند، این صور ظاهره را در عین هستی (عين الوجود) به یکدیگر می‌بخشند. این اعیان ممکنات (الأعيان الممكنات) هیچ صورتی را ظاهر نکردند مگر به واسطه اسماء الهی، از قبیل: قائل، قادر، خالق، رازق، محیی، ممیت، معز و مذل. اما غنا و عزت از آنِ ذات است و او غنی عزیز است. غنای او برای ذاتش به این دلیل است که این صور را عطا می‌کند و عطای آنچه را که حقیقت ذاتش می‌بخشد، نمی‌پذیرد. و اما عزت برای ذاتش به این دلیل است که این صور به او عطا نمی‌کنند و در او تأثیر نمی‌گذارند، با علم به آنچه در حال وجودشان از یکدیگر کسب می‌کنند. زیرا اعیان (الأعيان) همان‌هایی هستند که آن علوم را که به واسطه اسماء الهی کسب کرده‌اند، به این صور عطا می‌کنند. و این معنای سخن خداوند متعال است: **حَتَّى نَعْلَمَ** (تا بدانیم) [قرآن، ۴۷:۳۱]، در حالی که او بدون شک داناست.\n\nپس حق (الحق) داناست و اعیان (الأعيان) دانا و بهره‌مند هستند. و علم چیزی جز عین صور و بهره‌مندی آن‌ها از اسماء الهی نیست که اعیان ممکنات (أعيان الممكنات) آن علوم را به آن‌ها بخشیده‌اند. از اینجا حکم کثرت و وحدت، مؤثر و مؤثرٌفیه، و اثر، و نسبت عالم از خدا، و نسبت تنوع صور ظاهره، و آنچه ظاهر شد و کسی که ظاهر شد، و آنچه باطن شد و کسی که باطن شد، و حقیقت **الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ** (اول و آخر و ظاهر و باطن) [قرآن، ۵۷:۳] را می‌دانی، و اینکه این‌ها نعت‌هایی هستند برای کسی که **لِلَّهِ الْأَسْمَاءُ الْحُسْنَى** (برای خداست اسماء حسنی) [قرآن، ۷:۱۸۰].\n\nپس آنچه را در این باب ذکر کردیم، محقق کن، زیرا بسیار سودمند است و حاوی امری عظیم است که قدر آن را جز خدا نمی‌داند. هر کس این باب را شناخت، خود را شناخت که آیا او صورت است، یا عین بخشنده صورت، یا عینِ عینِ ثابتِ ممکن که عدم از ذات اوست. و هر کس خود را شناخت، پروردگارش را به ضرورت شناخت. پس حق (الحق) را جز حق نمی‌شناسد. پس نه تقدمی هست و نه تأخری، زیرا ممکن در حال عدمش از ازلی که به هستی حق (وجود الحق) منسوب است، متأخر نیست؛ چرا که ازل همان‌گونه که برای هستی حق واجب است، برای عدم ممکن و ثبوت و تعیین آن نزد حق نیز واجب است. و اگر آنچه نزد حق متعین و از ممکن دیگری متمایز است، نبود، او را به خطاب در قول **كُنْ** (باش) [قرآن، ۲:۱۱۷] اختصاص نمی‌داد. و هر کس این باب را شناخت، دانست که چه کسی «کن» می‌گوید، و به چه کسی «کن» گفته می‌شود، و چه کسی از قول «کن» متکون می‌شود، و چه کسی حکم کاف و نون را می‌پذیرد. و خداوند **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و او راه را هدایت می‌کند) [قرآن، ۳۳:۴]."
  },
  "page_count": 2
}