{
  "id": 401,
  "title": {
    "ar": "الباب الحادي وأربعمائة في معرفة منازلة الميت والحي ليس له إلى رؤيتى من سبيل",
    "en": "Chapter Four Hundred and One: Concerning the Gnosis of the Station of the Dead, and that the Living has no Path to My Vision.",
    "ur": "باب چار سو ایک: میت (مردہ) اور حی (زندہ) کے منازل (مقامات) کی معرفت کا بیان، جبکہ زندہ کے لیے میری رؤیت (دیدار) تک پہنچنے کا کوئی راستہ نہیں۔",
    "fa": "باب چهارصد و یکم در معرفت منازل میت، و اینکه زنده را به دیدن من راهی نیست"
  },
  "content": {
    "ar": "## «الباب الحادي وأربعمائة في معرفة منازلة الميت والحي ليس له إلى رؤيتى من سبيل»\n\n\n> قد استوى الميت والحي *** في كونهم ما عندهم شي‏ء\n\n\n> مني فلا نور ولا ظلمة *** فيهم ولا ظل ولا في‏\n\n\n> رؤيتهم إلى معدومة *** فنشرهم في كونها طي‏\n\n\n> وفهمهم إن كان معناهم *** عنه إذا حققته عي‏\n\n\n### [إن الله لا تدركه الأبصار]\n\n\nقال الله عز وجل لا تُدْرِكُهُ الْأَبْصارُ وقال عز وجل لموسى عليه السلام لَنْ تَرانِي وكل مرئي لا يرى الرائي إذا رآه منه إلا قدر منزلته ورتبته فما رآه وما رأى إلا نفسه ولو لا ذلك ما تفاضلت الرؤية في الرائين إذ لو كان هو المرئي ما اختلفوا لكن لما كان هو مجلى رؤيتهم أنفسهم لذلك وصفوه بأنه يتجلى وأنه يرى ولكن شغل الرائي برؤيته نفسه في مجلى الحق حجبه عن رؤية الحق فلذلك لو لم تبد للرائي صورته أو صورة كون من الأكوان ربما كان يراه فما حجبنا عنه إلا أنفسنا فلو زلنا عنا ما رأيناه لأنه ما كان يبقى ثم بزوالنا من يراه وإن نحن لم نزل فما نرى إلا أنفسنا فيه وصورنا وقدرنا ومنزلتنا فعلى كل حال ما رأيناه وقد نتوسع فنقول قد رأيناه ونصدق كما أنه لو قلنا رأينا الإنسان صدقنا في أن تقول رأينا من مضى من الناس ومن بقي ومن في زماننا من كونهم إنسانا لا من حيث شخصية كل إنسان ولما كان العالم أجمعه وآحاده على صورة حق ورأينا الحق فقد رأينا وصدقنا وإن نظرنا إلى عين التمييز في عين عين لم نصدق وأما قوله صَلَّى اللهُ عَليهِ وسَلَّم في حديث الدجال ودعواه إنه إله فعهد إلينا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أن أحدنا لا يرى ربه حتى يموت‏ لأن الغطاء لا ينكشف عن البصر إلا بالموت والبصر من العبد هوية الحق فعينك غطاء على بصر الحق فبصر الحق أدرك الحق ورآه لا أنت فإن الله لا تُدْرِكُهُ الْأَبْصارُ وهُوَ يُدْرِكُ الْأَبْصارَ وهُوَ اللَّطِيفُ الْخَبِيرُ ولا ألطف من هوية تكون عين بصر العبد وبصر العبد لا يدرك الله وليس في القوة أن يفصل بين البصرين والخبير علم الذوق فهو العليم خبرة إنه بصر العبد في بصر العبد وكذا هو الأمر في نفسه وإن كان حيا فقد استوى الميت والحي في كون الحق تعالى بصرهما وما عندهما شي‏ء فإن الله لا يحل في شي‏ء ولا يحل فيه شي‏ء إذ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهُوَ السَّمِيعُ الْبَصِيرُ\n\n\n> فكل سمع وبصر *** هوية الحق وقد\n\n\n> فانظر إذا أبصرت من *** تبصره وتر العدد\n\n\n> وكن به معترفا *** في كل غي ورشد\n\n",
    "en": "Chapter 401: Concerning the Gnosis of the Station of the Dead and the Living, and that the Living has no Way to My Vision\n\nThe dead and the living are equal\nIn that they possess nothing.\n\nFrom Me (the Real), there is neither light nor darkness\nIn them, nor shadow, nor in [them] is anything.\n\nTheir vision is towards non-existence (ma'dūma),\nSo their spreading is folded (ṭayy) within its being.\n\nAnd their understanding, if it were their meaning\nConcerning Him, when you verify it, is inability ('ayy).\n\n### [Indeed, Vision Does Not Perceive Allah]\n\nAllah, the Mighty and Majestic, said: <<لَا تُدْرِكُهُ الْأَبْصَارُ>> (Vision does not perceive Him), and He, the Mighty and Majestic, said to Moses (peace be upon him): <<لَن تَرَانِي>> (You will never see Me).\n\nEvery object of vision (mar'ī) is such that the viewer (rā'ī), when seeing it, sees nothing of it except the measure of his own station (manzila) and degree (rutba). Thus, he has not seen It (the Real), but has only seen himself. Were it not so, vision would not differ among the viewers, for if He were the object of vision (mar'ī) itself, they would not differ. But since He is the locus of manifestation (majlá) for their vision of themselves, they therefore describe Him as manifesting (yatajallá) and as being seen (yurá).\n\nHowever, the viewer's preoccupation with seeing himself in the locus of manifestation of the Real (majlá al-Ḥaqq) screens him from seeing the Real (al-Ḥaqq). Therefore, if the viewer's own form (ṣūratuhu) or the form of any entity from the cosmos (kawn min al-akwān) did not appear to him, he might perhaps see Him. Thus, nothing screens us from Him except ourselves. If we were removed from ourselves, we would not see Him, because, with our removal, there would remain no one there to see Him. And if we are not removed, we see nothing in Him except ourselves, our forms, our measure, and our station. So, in every case, we have not seen Him.\n\nWe may, however, speak broadly and say, \"We have seen Him,\" and be truthful, just as if we said, \"We have seen humanity,\" we would be truthful in saying we have seen those who have passed away, those who remain, and those in our time, in terms of their being human, not in terms of the specific individuality (shakhṣiyya) of each person. And since the entire World (al-'ālam) and its particulars (āḥāduh) are upon the form of the Real (ṣūrat Ḥaqq), and we have seen the Real, then we have seen and we are truthful. But if we look with the eye of distinction (ʿayn al-tamyīz) into the very essence (ʿayn ʿayn), we are not truthful.\n\nAs for the saying of the Prophet (peace and blessings be upon him) in the hadith concerning the Dajjal (Antichrist) and his claim to divinity, the Messenger of Allah (peace and blessings be upon him) entrusted to us that none of us shall see his Lord until he dies. This is because the veil (ghiṭā') is not lifted from the sight (baṣar) except through death, and the sight of the servant is the very Identity (Huwiyya) of the Real (al-Ḥaqq). Thus, your essence ('aynuka) is a veil over the sight of the Real (baṣar al-Ḥaqq). The sight of the Real perceives the Real and sees Him, not you. For Allah—<<لَا تُدْرِكُهُ الْأَبْصَارُ وَهُوَ يُدْرِكُ الْأَبْصَارَ وَهُوَ اللَّطِيفُ الْخَبِيرُ>> (Vision does not perceive Him, but He perceives [all] vision; and He is the Subtle [al-Laṭīf], the All-Aware [al-Khabīr]).\n\nAnd there is nothing more subtle (alṭaf) than an Identity (Huwiyya) that constitutes the very essence of the servant's sight, yet the servant's sight does not perceive Allah. It is not within the power [of the servant] to distinguish between the two sights. And the All-Aware (al-Khabīr) is the knowledge of tasting (dhawq). Thus, He is the Knower (al-'Alīm) by experience (khibra) that the sight of the servant is within the sight of the servant.\n\nAnd such is the matter in itself. Even if he is alive, the dead and the living are equal in that the Real (al-Ḥaqq) is their sight, and they possess nothing. For Allah does not inhere (yaḥill) in anything, nor does anything inhere in Him, since <<لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ>> (There is nothing like unto Him, and He is the All-Hearing, the All-Seeing).\n\nFor every hearing and sight\nIs the Identity (Huwiyya) of the Real, and indeed—\n\nLook, then, when you see, at whom\nYou are seeing, and observe the number (al-'adad).\n\nAnd be acknowledging of Him\nIn every error (ghayy) and right guidance (rushd).",
    "ur": "باب نمبر چار سو ایک: میت اور زندہ کی منزلوں کی معرفت میں، جس کے لیے میری رؤیت تک کوئی راستہ نہیں ہے۔\n\nمیت اور زندہ برابر ہیں\nاس بات میں کہ ان کے پاس کچھ نہیں ہے\n\nمجھ سے، نہ ان میں کوئی نور ہے نہ ظلمت\nاور نہ کوئی سایہ ہے اور نہ کوئی (وجود)\n\nان کی رؤیت معدوم کی طرف ہے\nپس ان کا پھیلاؤ (نشر) اس کے وجود میں لپٹا ہوا (طی) ہے\n\nاور ان کا فہم، اگر ان کا معنی اس سے ہو\nجب تم اسے حقیقت بناؤ تو وہ عاجز ہو جاتا ہے\n\n### [بے شک اللہ کو بصارتیں نہیں پا سکتیں]\n\nذات حق (الحق) نے فرمایا: \"اسے (اللہ کو) بصارتیں نہیں پا سکتیں (لَا تُدْرِكُهُ الْأَبْصَارُ)\" اور ذات حق (الحق) نے موسیٰ علیہ السلام سے فرمایا: \"تم مجھے ہرگز نہیں دیکھ سکو گے (لَنْ تَرَانِي)\"۔ اور ہر دیکھا جانے والا (مرئی) جب دیکھنے والا (الرائي) اسے دیکھتا ہے تو وہ اس میں سے اپنی منزلت اور مرتبے کے سوا کچھ نہیں دیکھتا۔ پس اس نے اسے نہیں دیکھا، اور اس نے اپنی ذات کے سوا کچھ نہیں دیکھا۔ اگر ایسا نہ ہوتا تو دیکھنے والوں میں رؤیت (الرؤية) میں فرق نہ ہوتا، کیونکہ اگر وہ (الحق) ہی دیکھا جانے والا (المرئی) ہوتا تو وہ اختلاف نہ کرتے۔ لیکن جب وہ (الحق) ان کے اپنی ذات کو دیکھنے کا مظہر (مجلی) ہے، اسی لیے انہوں نے اس کی یہ صفت بیان کی کہ وہ ظہور الٰہی (التجلی) کرتا ہے اور وہ دیکھا جاتا ہے۔ لیکن دیکھنے والے کا ذات حق (الحق) کے مظہر میں اپنی ذات کو دیکھنے میں مشغول ہو جانا اسے ذات حق (الحق) کی رؤیت سے حجاب میں رکھتا ہے۔\n\nاسی لیے اگر دیکھنے والے کے لیے اس کی صورت یا اکوان (الأكوان) میں سے کسی کون کی صورت ظاہر نہ ہوتی تو شاید وہ اسے دیکھ لیتا۔ پس ہمیں اس سے ہماری ذاتوں کے سوا کسی چیز نے حجاب میں نہیں رکھا۔ اگر ہم اپنی ذاتوں کو ہٹا دیں تو ہم اسے نہیں دیکھ پائیں گے، کیونکہ ہمارے ہٹ جانے کے بعد وہاں کوئی باقی نہیں رہے گا جو اسے دیکھے۔ اور اگر ہم نہیں ہٹتے تو ہم اس میں اپنی ذاتوں، اپنی صورتوں، اپنی تقدیروں اور اپنی منزلوں کے سوا کچھ نہیں دیکھتے۔ پس بہر حال ہم نے اسے نہیں دیکھا۔ اور ہم وسعت اختیار کرتے ہوئے کہہ سکتے ہیں کہ ہم نے اسے دیکھ لیا ہے اور ہم سچ کہتے ہیں، جیسا کہ اگر ہم کہیں کہ ہم نے انسان کو دیکھا تو ہم سچ کہتے ہیں کہ ہم نے ان لوگوں کو دیکھا جو گزر چکے، جو باقی ہیں، اور جو ہمارے زمانے میں ہیں، اس حیثیت سے کہ وہ انسان ہیں، نہ کہ ہر انسان کی انفرادی شخصیت کی حیثیت سے۔ اور چونکہ سارا عالم اور اس کے افراد ذات حق (الحق) کی صورت پر ہیں، اور ہم نے ذات حق (الحق) کو دیکھا، تو ہم نے دیکھا اور ہم سچ کہتے ہیں۔ لیکن اگر ہم عینِ عین میں تمیز کی آنکھ سے دیکھیں تو ہم سچ نہیں کہتے۔\n\nاور جہاں تک دجال کے بارے میں آپ صلی اللہ علیہ وسلم کے اس فرمان کا تعلق ہے کہ وہ خدائی کا دعویٰ کرے گا، تو رسول اللہ صلی اللہ علیہ وسلم نے ہم سے یہ عہد لیا کہ ہم میں سے کوئی بھی اپنے رب کو نہیں دیکھے گا جب تک کہ وہ مر نہ جائے۔ کیونکہ بصارت سے پردہ موت کے ذریعے ہی ہٹتا ہے۔ اور بندے کی بصارت ذات حق (الحق) کی ہویت (الهوية) ہے۔ پس تمہاری آنکھ ذات حق (الحق) کی بصارت پر ایک پردہ ہے۔ لہٰذا ذات حق (الحق) کی بصارت نے ذات حق (الحق) کو پایا اور دیکھا، نہ کہ تم نے۔ بے شک اللہ کو بصارتیں نہیں پا سکتیں (لَا تُدْرِكُهُ الْأَبْصَارُ) اور وہ بصارتوں کو پاتا ہے (وَهُوَ يُدْرِكُ الْأَبْصَارَ)، اور وہ لطیف (اللَّطِيفُ) اور باخبر (الْخَبِيرُ) ہے۔ اور اس ہویت (الهوية) سے زیادہ لطیف کوئی چیز نہیں جو بندے کی بصارت کی عین ہو۔ اور بندے کی بصارت اللہ کو نہیں پا سکتی، اور اس میں یہ طاقت نہیں کہ وہ دونوں بصارتوں کے درمیان فرق کر سکے۔ اور باخبر (الْخَبِيرُ) ذوق کا علم ہے، پس وہ تجربے سے جاننے والا (العليم خبرة) ہے کہ یہ بندے کی بصارت میں بندے کی بصارت ہے۔ اور خود امر بھی ایسا ہی ہے۔\n\nاور اگرچہ وہ زندہ ہے، میت اور زندہ اس بات میں برابر ہو گئے کہ ذات حق (الحق) تعالیٰ ان دونوں کی بصارت ہے اور ان کے پاس کچھ نہیں ہے۔ کیونکہ اللہ کسی چیز میں حلول نہیں کرتا اور نہ کوئی چیز اس میں حلول کرتی ہے، کیونکہ اس جیسی کوئی چیز نہیں ہے (لَيْسَ كَمِثْلِهِ شَيْءٌ) اور وہ سننے والا (السَّمِيعُ) اور دیکھنے والا (الْبَصِيرُ) ہے۔\n\nپس ہر سماعت اور بصارت\nذات حق (الحق) کی ہویت (الهوية) ہے، اور بے شک\n\nپس جب تم دیکھو تو دیکھو کہ تم کسے دیکھتے ہو\nاور عدد کو دیکھو\n\nاور ہر گمراہی اور ہدایت میں\nاس کا اعتراف کرنے والے بنو",
    "fa": "باب چهارصد و یکم در معرفت منزلت مرده و زنده که برای او راهی به سوی رؤیت من نیست\n\n> مرده و زنده یکسان شدند\n> در اینکه هیچ چیزی نزدشان نیست\n> از من، پس نه نوری و نه ظلمتی\n> در ایشان است، و نه سایه‌ای و نه در [آنها]\n> رؤیتشان به سوی نیستی است\n> پس گستره‌شان در هستی آن نیستی درهم پیچیده است\n> و فهمشان، اگر معنای آنها باشد،\n> از او (حق) اگر آن را محقق سازی، ناتوانی است.\n\n### [خداوند را چشم‌ها درک نمی‌کنند]\n\nخداوند عز و جل فرمود: «لَا تُدْرِكُهُ الْأَبْصَارُ» (چشم‌ها او را درک نمی‌کنند) و به موسی علیه السلام فرمود: «لَنْ تَرَانِي» (هرگز مرا نخواهی دید). هر شیء دیده‌شده‌ای، بیننده هنگامی که آن را می‌بیند، از آن شیء جز به اندازه منزلت و مرتبه خود نمی‌بیند. پس او (حق) را ندیده است و جز خود را ندیده است. اگر چنین نبود، رؤیت در بینندگان متفاوت نمی‌شد، زیرا اگر او (حق) همان شیء دیده‌شده بود، اختلاف نمی‌کردند. اما چون او (حق) مَجلای رؤیت خودِ ایشان است، به همین دلیل او را به تجلی (التجلی) و دیده شدن وصف کردند. اما مشغول شدن بیننده به رؤیت خود در مَجلای حق، او را از رؤیت حق (الحق) محجوب ساخت. به همین دلیل، اگر صورت او یا صورت کونی از اکوان (هستی‌ها) برای بیننده آشکار نمی‌شد، شاید او را می‌دید. پس ما را جز خودمان از او محجوب نساخت. اگر ما از خودمان زائل شویم، او را نمی‌بینیم، زیرا با زوال ما، کسی باقی نمی‌ماند که او را ببیند. و اگر ما زائل نشویم، جز خودمان و صورت‌هایمان و قدر و منزلت‌مان را در او نمی‌بینیم. پس در هر حال، ما او را ندیده‌ایم. ممکن است توسعه دهیم و بگوییم او را دیده‌ایم و راست گفته‌ایم، همان‌طور که اگر بگوییم انسان را دیدیم، راست گفته‌ایم که بگوییم کسانی را که از مردم گذشته‌اند و کسانی که باقی مانده‌اند و کسانی که در زمان ما هستند، دیده‌ایم، از حیث اینکه انسان هستند، نه از حیث شخصیت هر انسان. و چون عالم به تمام و آحادش بر صورت حق است و ما حق را دیده‌ایم، پس دیده‌ایم و راست گفته‌ایم. اما اگر به چشم تمییز در عینِ عین بنگریم، راست نگفته‌ایم.\n\nو اما قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در حدیث دجال و ادعای او مبنی بر اینکه او خداست، رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) با ما پیمان بست که هیچ یک از ما پروردگارش را نمی‌بیند مگر اینکه بمیرد، زیرا پرده از بصر (چشم باطن) برداشته نمی‌شود مگر با مرگ. و بصر از جانب بنده، هویت (هوية الحق) حق است. پس چشم تو پوششی بر بصر حق است. بصر حق، حق را درک کرد و دید، نه تو. زیرا خداوند «لَا تُدْرِكُهُ الْأَبْصَارُ وَهُوَ يُدْرِكُ الْأَبْصَارَ وَهُوَ اللَّطِيفُ الْخَبِيرُ» (چشم‌ها او را درک نمی‌کنند و او چشم‌ها را درک می‌کند و او لطیف و آگاه است). و هیچ لطیف‌تر از هویتی نیست که عین بصر بنده باشد، و بصر بنده خدا را درک نمی‌کند. و در توان نیست که میان دو بصر تفکیک قائل شود. و «الخبير» (آگاه) علم ذوق است، پس اوست دانای به آگاهی که بصر بنده در بصر بنده است. و امر در نفس خود چنین است. و اگر زنده باشد، مرده و زنده یکسان شده‌اند در اینکه حق تعالی بصر هر دوی آنهاست و نزدشان هیچ چیزی نیست. زیرا خداوند در چیزی حلول نمی‌کند و چیزی نیز در او حلول نمی‌کند، چرا که «لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ» (چیزی مانند او نیست و او شنوای بیناست).\n\n> پس هر سمع و بصری\n> هویت (هوية الحق) حق است و محققاً\n> بنگر، هنگامی که دیدی، چه کسی را\n> می‌بینی و عدد را ببین\n> و به او اعتراف کن\n> در هر گمراهی و هدایتی."
  },
  "page_count": 1
}