{
  "id": 92,
  "title": {
    "ar": "الباب الثاني والتسعون في معرفة مقام ترك الورع",
    "en": "Chapter Ninety-Two: Concerning the Knowledge (معرفة) of the Station (مقام) of Abandoning Scrupulousness (ترك الورع)",
    "ur": "باب نمبر بانوے، مقام ترک الورع (ترك الورع) کی معرفت میں",
    "fa": "باب نود و دوم در معرفت مقام ترک ورع"
  },
  "content": {
    "ar": "## (الباب الثاني والتسعون في معرفة مقام ترك الورع)\n\n\n> شفعية الإنسان تؤذن بالورع *** والوتر فيها موجب ترك الورع‏\n> العين واحدة إذا حققتها *** مضت المطامع فانتفى حكم الطمع‏\n\n\n> ما تطلب الأعمال عين وجودها *** إلا لضعف في البصائر أو صدع‏\n\n\n### [الأحكام الأربعة للأمور: الظاهر الباطن الحد المطلع‏]\n\n\nلما كانت الأمور كلها لها أربعة أحكام حكم ظاهر وحكم باطن وحكم حد وحكم مطلع وكان الورع يحكم على ظاهر صاحبه وباطنه بالحد فأبان له هذا العمل وجه الحق في كل شي‏ء وهو المطلع فاطلع فما وقعت عينه على الأشياء وإنما وقعت عينه على وجه الحق فيها الذي ارتبطت في وجودها به والذي ظهرت عنه فاقتضى حاله ترك الورع لأنه لا ينبغي أن يجتنب رؤية وجه الحق في الأشياء وما هو من حكم ما لا ينبغي فإن العبد لا يقدر أن يدفع عن نفسه التجلي إذا كان حقيقة فهو محكوم عليه به‏\n\n\n### [المعنى الحقيقي لمقام ترك الورع‏]\n\n\nولست أعني بقولي ترك الورع إن صاحبه يتناول الحرام أو الشبهة بعد علمه بذينك هذا لا يقول به أحد وإنما صاحب هذا المقام يتناول الأشياء بحسب ما خاطبه به الشرع فلا يأكل إلا حلالا ولا يتصرف إلا حلالا فإن العلامة أزالها الحق عنه برؤية الوجه والورع بغير علامة سوء ظن بالناس وحاشى أهل الله ولا سيما أصحاب مشاهدة الوجه أن يسيئوا الظن بعباد الله أو يخطر شي‏ء من قبائحهم ببال صاحب هذا الحال المتمكن في مقامه‏\n\n\n### [ليكن نظرك دائما إلى الله وشغلك دأبا بالله‏]\n\n\nولقد لقي بعض أصحابنا بعض الأبدال في سياحته فأخذ يذكر له ما هم الناس عليه من فساد الأحوال في الملوك والولاة والرعايا فغضب البدل وقال له ما لك وعباد الله لا تدخل بين السيد وعبده فإن الرحمة والمغفرة والإحسان لهؤلاء يطلبون أ تريد أن تبقي الألوهية معطلة الحكم اشغل بنفسك وأعرض عن هذه الأشياء وليكن نظرك إليه تعالى وشغلك بالله‏\n\n\n### [الحياة الروحية طريق مع رفيق إلى الرفيق‏]\n\n\nولقد اتفق لي في بدايتي وما ثم إلا بداية وأما النهاية فمقولة غير معقولة دخلت على شيخنا أبي العباس العريني وأنا في مثل هذه الحال وقد تكدر على وقتي لما أرى الناس فيه من مخالفة الحق فقال لي صاحبي عليك بالله فخرجت من عنده ودخلت على شيخنا أبي عمران الميرتلي وأنا على تلك الحالة فقال لي عليك بنفسك فقلت له يا سيدنا قد حرت بينكما هذا أبو العباس يقول عليك بالله وأنت تقول عليك بنفسك وأنتما إمامان دالان على الحق فبكى أبو عمران وقال لي يا حبيبي الذي دلك عليه أبو العباس هو الحق وإليه الرجوع وكل واحد منا دلك على ما يقتضيه حاله وأرجو إن شاء الله أن يلحقني بالمقام الذي أشار إليه أبو العباس فاسمع منه فإنه أولى بي وبك فما أحسن إنصاف القوم فرجعت إلى أبي العباس وذكرت له مقالة أبي عمران وقال لي أحسن في قوله هو دلك على الطريق وأنا دللتك على الرفيق فاعمل بما قال لك وبما قلته لك فتجمع بين الرفيق والطريق‏\n\n\n### [من لا يصحب الحق في سفره ليس على بينة من سلامته فيه‏]\n\n\nوكل من لا يصحب الحق في سفره فليس هو على بينة من سلامته فيه وكل من تورع بغير علامة له من الله في الأشياء وما ثم حكم معين في ذلك الأمر من رؤية معاملة خاصة مشاهدة في الوقت تقتضي الحرام أو الشبهة فصاحب هذا الورع مخدوع مقطوع به عن الله فإن حاله سوء الظن بعباد الله فباطنه مظلم وخلقه سيئ فهو ولا شي‏ء في حكم واحد بل لا شي‏ء أحسن منه فينبغي للإنسان أن يتحفظ إذا أراد أن يكون ورعا كما أوجب الله عليه بأن يتحقق ويكون على بصيرة فيما يتورع وهذا قليل العلم به لمن لا علامة له لأن الإنسان لو رأى إنسانا على مخالفة حق مشروع وفارقه لحظة ثم رآه في في اللحظة الأخرى وحكم عليه بالحالة الأولى فما وفي الألوهية حقها ولا الأدب مع الله حقه وكان قرين إبليس حليف الخسران سيئ الظن بالله وبعباده وكان ورعه مقتا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "The duality of the human signals scrupulous piety, / While the singularity within it necessitates the abandonment of piety.\nIf you realize that the Essence (العين) is one, / Desires depart, and the rule of craving is negated.\n\nActions do not seek the very essence of their existence, / Except due to a weakness in insights (البصائر) or a rift.\n\n### [The Four Rulings of Matters: The Manifest, The Hidden, The Limit, The Point of Observation]\n\nSince all matters possess four rulings: a manifest ruling (حكم ظاهر), a hidden ruling (حكم باطن), a ruling of the limit (حكم حد), and a ruling of the point of observation (حكم مطلع); and since scrupulous piety (الورع) judges the manifest and hidden aspects of its practitioner by the limit (الحد), this action (i.e., transcending the limit) reveals to him the Face of the Real (وجه الحق) in everything, which is the point of observation (المطلع). So he observes. His eye does not fall upon the things themselves, but rather his eye falls upon the Face of the Real (وجه الحق) within them, to which they are bound in their existence, and from which they appeared. Thus, his state necessitates the abandonment of scrupulous piety (ترك الورع), because it is not proper to shun the vision of the Face of the Real in things. And this is not subject to the ruling of what should be avoided, for the servant cannot repel the Theophany (التجلي) from himself if it is a Reality (حقيقة); rather, he is ruled by it.\n\n### [The True Meaning of the Station of Abandoning Scrupulous Piety]\n\nI do not mean by my statement \"abandoning scrupulous piety\" (ترك الورع) that its practitioner consumes the unlawful (الحرام) or the doubtful (الشبهة) after knowing them; no one would assert this. Rather, the practitioner of this station approaches things according to what the Sacred Law (الشرع) addresses him with. Thus, he eats only the lawful (حلالا) and acts only in the lawful manner. For the sign (العلامة) has been removed from him by the Real (الحق) through the vision of the Face. And scrupulous piety without a sign is merely ill-opinion (سوء ظن) of people. Far be it from the People of Allah (أهل الله), especially those who witness the Face (مشاهدة الوجه), to harbor ill-opinion of the servants of Allah, or for any of their indecencies to cross the mind of the practitioner of this state who is established in his station.\n\n### [Let Your Gaze Always Be Upon Allah and Your Occupation Constantly With Allah]\n\nOne of our companions met one of the Substitutes (الأبدال) during his travels and began mentioning to him the corruption of affairs among the people, concerning kings, governors, and subjects. The Substitute became angry and said to him, \"What concern are the servants of Allah to you? Do not intervene between the Master and His servant. For Mercy, Forgiveness, and Benevolence are sought for these people. Do you wish to leave the Divinity (الألوهية) with its ruling suspended? Occupy yourself with your own soul, turn away from these matters, and let your gaze be upon Him, the Exalted, and your occupation be with Allah.\"\n\n### [The Spiritual Life: A Path with a Companion to the Beloved Companion]\n\nThis happened to me in my beginning—and there is nothing but beginning, for the end (النهاية) is a saying that cannot be grasped by the intellect (غير معقولة). I entered upon our Shaykh, Abu al-Abbas al-Urayni, while I was in a similar state, my spiritual time (وقتي) having been disturbed by what I saw of people’s opposition to the Real (الحق). My companion said to me, \"Hold fast to Allah (عليك بالله).\" I left him and entered upon our Shaykh, Abu Imran al-Mirtili, while still in that state. He said to me, \"Hold fast to your own soul (عليك بنفسك).\" I said to him, \"O our master, I am confused between the two of you. Abu al-Abbas says, 'Hold fast to Allah,' and you say, 'Hold fast to your own soul,' yet both of you are Imams guiding to the Real (الحق).\" Abu Imran wept and said to me, \"My beloved, what Abu al-Abbas guided you to is the Real, and to Him is the return. Each of us guided you according to what your state (حاله) required. I hope, God willing, that He will join me to the station (المقام) that Abu al-Abbas indicated. So listen to him, for he is more appropriate for me and for you.\" How excellent is the fairness (إنصاف) of these folk! I returned to Abu al-Abbas and mentioned to him the statement of Abu Imran. He said to me, \"He spoke well. He guided you to the Path (الطريق), and I guided you to the Beloved Companion (الرفيق). So act upon what he told you and what I told you, and you will combine the Beloved Companion and the Path.\"\n\n### [Whoever Does Not Accompany the Real in His Journey Is Not Certain of His Safety Therein]\n\nWhoever does not accompany the Real (الحق) in his journey is not certain of his safety therein. And whoever practices scrupulous piety (تورع) without a sign (علامة) granted to him by Allah concerning things—and there is no specific ruling in that matter based on the vision of a particular transaction witnessed at that moment that necessitates the unlawful (الحرام) or the doubtful (الشبهة)—the practitioner of this kind of piety is deceived, cut off from Allah by it, for his state is ill-opinion (سوء الظن) of the servants of Allah. His inner being (باطنه) is dark, and his character is bad. He and nothingness are under the same ruling; rather, nothingness is better than him. Therefore, a person must guard himself if he wishes to be scrupulously pious (ورعا) as Allah has obligated him, by verifying and being insightful (على بصيرة) concerning what he is cautious about. Knowledge of this is scarce for one who lacks a sign, because if a person sees another violating a legitimate right (حق مشروع), and then leaves him for a moment, and then sees him again in the next moment and judges him based on the first state, he has not fulfilled the right of Divinity (الألوهية) nor the right of proper conduct (الأدب) with Allah. He is the companion of Iblis, the ally of loss, holding ill-opinion of Allah and His servants, and his piety is hateful. And Allah says the Truth (الحق), and He guides to the Way (السبيل).",
    "ur": "## (باب نمبر بانوے: ترک پرہیزگاری (ترك الورع) کے مقام کی معرفت میں)\n\nانسان کی جفتی (شفعية) پرہیزگاری کی خبر دیتی ہے،\nاور اس میں طاق (وتر) ترک پرہیزگاری کو واجب کرتا ہے۔\nجب تم آنکھ (العين) کو حقیقت کے ساتھ دیکھو گے،\nتو تمام لالچ ختم ہو جائیں گے اور طمع کا حکم باقی نہیں رہے گا۔\n\nاعمال اپنی ہستی (وجود) کی اصل کو طلب نہیں کرتے،\nمگر بصیرتوں میں کمزوری یا دراڑ کی وجہ سے۔\n\n### [امور کے چار احکام: ظاہر، باطن، حد، مطلع]\n\nچونکہ تمام امور کے چار احکام ہوتے ہیں: ایک حکم ظاہر، ایک حکم باطن، ایک حکم حد (الحد)، اور ایک حکم مطلع (المطلع)۔ اور پرہیزگاری (الورع) اپنے صاحب کے ظاہر اور باطن پر حد (الحد) کے ساتھ حکم لگاتی ہے۔ پس اس عمل نے اس کے لیے ہر شے میں ذات حق (الحق) کا وجہ (Aspect) واضح کر دیا، اور یہی مطلع (المطلع) ہے۔ چنانچہ اس نے مطلع کیا، تو اس کی نظر اشیاء پر نہیں پڑی، بلکہ اس کی نظر ان میں موجود ذات حق (الحق) کے اس وجہ پر پڑی جس کے ساتھ وہ اپنی ہستی (وجود) میں منسلک ہیں اور جس سے وہ ظاہر ہوئی ہیں۔ لہٰذا، اس کے حال نے ترک پرہیزگاری (ترك الورع) کا تقاضا کیا، کیونکہ اشیاء میں ذات حق (الحق) کے وجہ کو دیکھنے سے اجتناب نہیں کرنا چاہیے، اور یہ ان احکام میں سے نہیں ہے جن سے اجتناب کیا جاتا ہے۔ کیونکہ بندہ اپنے آپ سے ظہور الٰہی (التجلی) کو دفع نہیں کر سکتا جب وہ حقیقت ہو، پس وہ اس کے ذریعے محکوم ہے۔\n\n### [ترک پرہیزگاری کے مقام کا حقیقی معنی]\n\nاور ترک پرہیزگاری (ترك الورع) سے میرا یہ مطلب نہیں ہے کہ اس کا صاحب حرام یا شبہ والی چیز کو جاننے کے بعد بھی استعمال کرے؛ یہ بات کوئی نہیں کہتا۔ بلکہ اس مقام کا صاحب اشیاء کو اس کے مطابق استعمال کرتا ہے جس کا شرع نے اسے حکم دیا ہے۔ پس وہ صرف حلال کھاتا ہے اور صرف حلال میں تصرف کرتا ہے۔ کیونکہ ذات حق (الحق) نے وجہ (الوجه) کے مشاہدے کے ذریعے اس سے علامت کو زائل کر دیا ہے۔ اور علامت کے بغیر پرہیزگاری (الورع) لوگوں کے بارے میں بدگمانی ہے۔ اور اللہ والوں کو، خاص طور پر وجہ (الوجه) کا مشاہدہ کرنے والوں کو، یہ زیب نہیں دیتا کہ وہ اللہ کے بندوں کے بارے میں بدگمانی کریں یا ان کی کوئی برائی اس حال والے شخص کے دل میں آئے جو اپنے مقام میں متمکن ہے۔\n\n### [تمہاری نظر ہمیشہ اللہ کی طرف ہو اور تمہارا شغل ہمیشہ اللہ کے ساتھ ہو]\n\nاور ہمارے بعض اصحاب نے اپنے سفر میں ایک ابدال سے ملاقات کی، تو وہ اسے لوگوں کے احوال کی خرابی کے بارے میں بتانے لگا جو بادشاہوں، حکمرانوں اور رعایا میں پھیلی ہوئی ہے۔ تو ابدال غضبناک ہوا اور اس سے کہا: تمہیں اللہ کے بندوں سے کیا کام؟ تم آقا اور اس کے بندے کے درمیان دخل اندازی نہ کرو۔ کیونکہ ان لوگوں کے لیے رحمت، مغفرت اور احسان مطلوب ہیں۔ کیا تم چاہتے ہو کہ الوہیت (الألوهية) کا حکم معطل رہے؟ اپنے آپ میں مشغول رہو اور ان چیزوں سے اعراض کرو۔ اور تمہاری نظر ہمیشہ اس (اللہ) کی طرف ہو اور تمہارا شغل اللہ کے ساتھ ہو۔\n\n### [روحانی زندگی: رفیق کے ساتھ رفیق کی طرف راستہ]\n\nاور میرے ساتھ میری ابتدا میں یہ واقعہ پیش آیا— اور وہاں صرف ابتدا ہی ہے، جہاں تک انتہا کا تعلق ہے تو وہ ایک ایسی بات ہے جو عقل میں نہیں آتی— میں اپنے شیخ ابو العباس العرینی کے پاس گیا، اور میں اسی حال میں تھا، اور میرا وقت مکدر ہو چکا تھا اس وجہ سے کہ میں لوگوں کو حق (الحق) کی مخالفت کرتے ہوئے دیکھ رہا تھا۔ تو میرے ساتھی نے مجھ سے کہا: \"تم پر اللہ لازم ہے (عليك بالله)\"۔ پھر میں ان کے پاس سے نکلا اور اپنے شیخ ابو عمران المیرتلی کے پاس گیا، اور میں اسی حالت میں تھا۔ تو انہوں نے مجھ سے کہا: \"تم پر تمہارا نفس لازم ہے (عليك بنفسك)\"۔ میں نے ان سے کہا: اے ہمارے سردار! میں آپ دونوں کے درمیان حیران ہو گیا ہوں۔ یہ ابو العباس کہتے ہیں کہ \"تم پر اللہ لازم ہے\" اور آپ کہتے ہیں کہ \"تم پر تمہارا نفس لازم ہے\"، حالانکہ آپ دونوں حق (الحق) کی طرف رہنمائی کرنے والے امام ہیں۔ تو ابو عمران رو پڑے اور مجھ سے کہا: اے میرے حبیب! جس کی طرف ابو العباس نے تمہاری رہنمائی کی ہے، وہی حق (الحق) ہے اور اسی کی طرف لوٹنا ہے۔ اور ہم میں سے ہر ایک نے تمہاری رہنمائی اس چیز کی طرف کی جو اس کے حال کا تقاضا تھا۔ اور میں اللہ سے امید کرتا ہوں کہ وہ مجھے اس مقام سے ملا دے جس کی طرف ابو العباس نے اشارہ کیا ہے۔ پس تم ان کی بات سنو، کیونکہ وہ میرے اور تمہارے لیے زیادہ بہتر ہیں۔ قوم کا انصاف کتنا اچھا ہے! چنانچہ میں ابو العباس کے پاس واپس آیا اور انہیں ابو عمران کی بات بتائی۔ تو انہوں نے مجھ سے کہا: انہوں نے اپنی بات میں اچھا کیا، انہوں نے تمہیں راستہ (الطريق) کی طرف رہنمائی کی اور میں نے تمہیں رفیق (الرفيق) کی طرف رہنمائی کی۔ پس تم اس پر عمل کرو جو انہوں نے تم سے کہا اور جو میں نے تم سے کہا، تاکہ تم رفیق اور راستہ دونوں کو جمع کر لو۔\n\n### [جو اپنے سفر میں حق کا ساتھ نہیں دیتا، وہ اس میں اپنی سلامتی کی دلیل پر نہیں ہوتا]\n\nاور جو کوئی بھی اپنے سفر میں ذات حق (الحق) کا ساتھ نہیں دیتا، وہ اس میں اپنی سلامتی کی دلیل پر نہیں ہوتا۔ اور جو کوئی بھی اشیاء میں اللہ کی طرف سے کسی علامت کے بغیر پرہیزگاری (الورع) اختیار کرتا ہے، اور اس معاملے میں کوئی خاص حکم نہیں ہے جو وقت میں کسی خاص مشاہدہ شدہ معاملے کو دیکھنے سے حرام یا شبہ کا تقاضا کرے، تو اس پرہیزگاری (الورع) کا صاحب دھوکہ کھایا ہوا ہے اور اللہ سے منقطع ہے۔ کیونکہ اس کا حال اللہ کے بندوں کے بارے میں بدگمانی ہے، پس اس کا باطن تاریک ہے اور اس کا اخلاق برا ہے۔ وہ اور \"لا شیء\" (کچھ نہیں) ایک ہی حکم میں ہیں، بلکہ \"لا شیء\" اس سے بہتر ہے۔ لہٰذا انسان کو چاہیے کہ اگر وہ پرہیزگار (ورع) بننا چاہتا ہے جیسا کہ اللہ نے اس پر واجب کیا ہے، تو وہ احتیاط کرے، اس طرح کہ وہ تحقیق کرے اور جس چیز سے پرہیز کر رہا ہے اس میں بصیرت پر ہو۔ اور یہ علم اس شخص کے لیے کم ہے جس کے پاس کوئی علامت نہ ہو۔ کیونکہ اگر کوئی شخص کسی دوسرے شخص کو کسی جائز حق کی مخالفت کرتے ہوئے دیکھے اور ایک لمحے کے لیے اس سے جدا ہو جائے، پھر دوسرے لمحے میں اسے دیکھے اور پہلی حالت کے مطابق اس پر حکم لگائے، تو اس نے نہ الوہیت (الألوهية) کا حق ادا کیا اور نہ ہی اللہ کے ساتھ ادب کا حق ادا کیا۔ اور وہ ابلیس کا ساتھی، خسارے کا حلیف، اور اللہ اور اس کے بندوں کے بارے میں بدگمان ٹھہرا۔ اور اس کی پرہیزگاری (الورع) نفرت کا باعث تھی۔ اور اللہ سچ فرماتا ہے اور وہی راستہ دکھاتا ہے۔ (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب نود و دوم در معرفت مقام ترک ورع\n\nدوگانگی انسان خبر از ورع می‌دهد *** و فردیت (وتر) در آن موجب ترک ورع است\nاگر چشم (حقیقت) را یکی ببینی و محقق سازی *** طمع‌ها از بین می‌روند و حکم طمع منتفی می‌شود\nاعمال، عین هستی (الوجود) خود را نمی‌طلبند *** مگر به دلیل ضعفی در بصیرت‌ها یا شکافی (صدع)\n\n### [احکام چهارگانه امور: ظاهر، باطن، حد، و مطلع]\n\nاز آنجا که همه امور دارای چهار حکم هستند: حکم ظاهر، حکم باطن، حکم حد، و حکم مطلع؛ و ورع بر ظاهر و باطن صاحبش با حد حکم می‌کند، این عمل (ترک ورع) وجه حق (الحق) را در هر چیزی برای او آشکار ساخت، و آن همان مطلع است. پس او مطلع شد و چشمش بر اشیاء نیفتاد، بلکه چشمش بر وجه حق (الحق) در آنها افتاد؛ وجهی که هستی (الوجود) آنها به آن وابسته است و از آن آشکار شده‌اند. پس حال او اقتضای ترک ورع را داشت، زیرا شایسته نیست که از دیدن وجه حق (الحق) در اشیاء اجتناب شود، و این (اجتناع) از حکم آنچه شایسته نیست، نمی‌باشد. زیرا بنده نمی‌تواند تجلی (التجلی) را از خود دور کند، اگر آن تجلی حقیقت باشد، پس او محکوم به آن است.\n\n### [معنای حقیقی مقام ترک ورع]\n\nمنظور من از گفتار «ترک ورع» این نیست که صاحب آن پس از علم به حرام یا شبهه، آنها را مصرف کند؛ این را هیچ کس نمی‌گوید. بلکه صاحب این مقام اشیاء را بر اساس آنچه شرع او را بدان خطاب کرده، مصرف می‌کند؛ پس جز حلال نمی‌خورد و جز در حلال تصرف نمی‌کند. زیرا حق (الحق) علامت (شبهه) را با رؤیت وجه (الحق) از او برداشته است. و ورع بدون علامت، سوء ظن به مردم است. و حاشا بر اهل الله، به ویژه صاحبان مشاهده وجه (الحق)، که به بندگان خدا سوء ظن ببرند یا چیزی از زشتی‌های آنان به ذهن صاحب این حال که در مقام خود متمکن است، خطور کند.\n\n### [باید نگاهت همیشه به سوی حق (الله) و اشتغالت پیوسته به حق (الله) باشد]\n\nیکی از یاران ما در سفر معنوی (سیاحته) خود با یکی از ابدال (الأبدال) ملاقات کرد. او شروع به ذکر فساد احوال مردم در میان پادشاهان، حاکمان و رعایا نمود. بدل خشمگین شد و به او گفت: تو را چه کار به بندگان خدا؟ میان مولا و بنده او داخل نشو. زیرا رحمت، مغفرت و احسان برای اینان طلب می‌شود. آیا می‌خواهی الوهیت را از حکم معطل بگذاری؟ به خودت مشغول باش و از این چیزها روی بگردان. و باید نگاهت به سوی او تعالی و اشتغالت به حق (الله) باشد.\n\n### [حیات روحانی، راهی است همراه با رفیق به سوی رفیق (حق)]\n\nدر ابتدای کارم برای من اتفاق افتاد – و جز آغاز (بِدایة) چیزی نیست، اما پایان (نهایة) گفتاری است که درک نمی‌شود (غیر معقولة) – که بر شیخمان ابوالعباس العرینی وارد شدم در حالی که در چنین وضعیتی بودم و وقتم به دلیل آنچه از مخالفت مردم با حق (الحق) می‌دیدم، مکدر شده بود. پس او به من گفت: بر تو باد به حق (الله). از نزد او خارج شدم و بر شیخمان ابوعمران میرتلی وارد شدم در حالی که بر همان حال بودم. او به من گفت: بر تو باد به خودت. به او گفتم: ای سرور ما، من میان شما دو نفر حیران شده‌ام. این ابوالعباس می‌گوید بر تو باد به حق (الله)، و شما می‌گویید بر تو باد به خودت، در حالی که شما هر دو امامانی هستید که بر حق (الحق) دلالت می‌کنید. ابوعمران گریست و به من گفت: ای حبیب من، آنچه ابوالعباس تو را بدان راهنمایی کرد، حق (الحق) است و بازگشت به سوی اوست. و هر یک از ما تو را بر آنچه حالش اقتضا می‌کرد، راهنمایی نمود. و امیدوارم ان شاء الله که مرا به مقامی که ابوالعباس بدان اشاره کرد، برساند. پس از او بشنو، زیرا او برای من و تو سزاوارتر است. چه نیکوست انصاف این قوم! پس به نزد ابوالعباس بازگشتم و سخن ابوعمران را برایش بازگو کردم. او گفت: نیکو گفته است. او تو را بر راه (طریق) دلالت کرد و من تو را بر رفیق (حق) دلالت کردم. پس به آنچه او گفت و آنچه من گفتم عمل کن تا میان رفیق و راه جمع کنی.\n\n### [هر کس در سفر خود با حق (الحق) همراه نباشد، بر بینه‌ای از سلامت خود در آن سفر نیست]\n\nو هر کس در سفر خود با حق (الحق) همراه نباشد، بر بینه‌ای از سلامت خود در آن نیست. و هر کس بدون علامتی از جانب حق (الله) در امور، ورع ورزد، و در آن امر حکم معینی از رؤیت معامله‌ای خاص که در آن لحظه مشاهده شود و اقتضای حرام یا شبهه کند، وجود نداشته باشد، صاحب این ورع فریب خورده و از حق (الله) بریده شده است. زیرا حال او سوء ظن به بندگان خداست، پس باطن او تاریک و خُلق او بد است. او و «هیچ چیز» در یک حکم هستند، بلکه «هیچ چیز» از او بهتر است. پس شایسته است که انسان اگر می‌خواهد ورع داشته باشد، همان‌گونه که حق (الله) بر او واجب کرده است، احتیاط کند به این صورت که متحقق شود و در آنچه ورع می‌ورزد، بر بصیرت باشد. و این (بصیرت) برای کسی که علامتی ندارد، کم است. زیرا اگر انسانی، فردی را در حال مخالفت با حقی مشروع ببیند و لحظه‌ای از او جدا شود، سپس در لحظه دیگر او را ببیند و بر اساس حالت اول بر او حکم کند، حق الوهیت را ادا نکرده و حق ادب با حق (الله) را به جای نیاورده است. و او قرین ابلیس و هم‌پیمان زیان است، بدگمان به حق (الله) و بندگان اوست، و ورع او نفرت‌انگیز است. و حق (الله) می‌فرماید: **«وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ»** (و حق (الله) حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 2
}