{
  "id": 375,
  "title": {
    "ar": "الباب الخامس والسبعون وثلاثمائة في معرفة منزل التضاهي الخيالي وعالم الحقائق والامتزاج‏",
    "en": "Chapter Three Hundred and Seventy-Five: Concerning the Knowledge of the Station of Imaginative Correspondence, the Realm of Realities, and Intermingling.",
    "ur": "باب تین سو پچھتر: خیالی تضاہی (التضاهي الخيالي) کی منزل، اور عالم حقائق (عالم الحقائق) اور امتزاج (الامتزاج) کی معرفت۔",
    "fa": "باب سیصد و هفتاد و پنجم در معرفت منزل همانندی خیالی (التضاهي الخيالي) و عالم حقایق و امتزاج."
  },
  "content": {
    "ar": "## «الباب الخامس والسبعون وثلاثمائة» في معرفة منزل التضاهي الخيالي وعالم الحقائق والامتزاج‏\n\n\nوهو من الحضرة المحمدية\n> كيف التبري وما في الكون إلا هو *** فكل كون أراه أنت معناه‏\n\n\n> وقد أتى بالتبري في شريعته *** فحير العقل شرع كان يهواه‏\n\n\n> أدناه منه ولا عين تغايره *** فمن دنا ثم بعد القرب أقصاه‏\n\n\n> الله مولى جميع الخلق كلهم *** ولم يخب أحد الله مولاه‏\n\n\n### [الخيال من موالي النفس الناطقة]\n\n\nاعلم أيدك الله‏\n\n\nأن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قال مولى القوم منهم‏\n\n\nوالخيال من موالي النفس الناطقة فهي منها بمنزلة المولى من السيد وللمولى في السيد نوع من أنواع التحكم من أجل الملكية فإنه به وبأمثاله من الموالي يصح كون السيد مالكا وملكا قلما لم يصح للسيد هذه المنزلة إلا بالمولى كان له بذلك يدهي التي تعطيه بعض التحكم في السيد وما له فيه من التحكم إلا أنه يصورها في أي صورة شاء وإن كانت النفس على صورة في نفسها ولكن لا يتركها هذا الخيال عند المتخيل إلا على حسب ما يريده من الصور في تخيله وليس للخيال قوة تخرجه عن درجة المحسوسات لأنه ما تولد ولا ظهر عينه إلا من الحس فكل تصرف يتصرفه في المعدومات والموجودات ومما له عين في الوجود أو لا عين له فإنه يصوره في صورة محسوس له عين في الوجود أو يصور صورة ما لها بالمجموع عين في الوجود ولكن أجزاء تلك الصورة كلها أجزاء وجودية محسوسة لا يمكن له أن يصورها إلا على هذا الحد فقد جمع الخيال بين الإطلاق العام الذي لا إطلاق يشبهه فإن له التصرف العام في الواجب والمحال والجائز وما ثم من له حكم هذا الإطلاق وهذا هو تصرف الحق في المعلومات بوساطة هذه القوة كما إن له التقييد الخاص المنحصر فلا يقدر أن يصور أمرا من الأمور إلا في صورة حسية كانت موجودة تلك الصورة المحسوسة أو لم تكن لكن لا بد من أجزاء الصورة المتخيلة أن تكون كلها كما ذكرنا موجودة في المحسوسات أي قد أخذها من الحس حين أدركها متفرقة لكن المجموع قد لا يكون في الوجود\n\n\n### [أن الله لم يزل في الدنيا متجليا للقلوب‏]\n\n\nواعلم أن الحق لم يزل في الدنيا متجليا للقلوب دائما فتتنوع الخواطر في الإنسان عن التجلي الإلهي من حيث لا يشعر بذلك إلا أهل الله كما أنهم يعلمون أن اختلاف الصور الظاهرة في الدنيا والآخرة في جميع الموجودات كلها ليس غير تنوعه فهو الظاهر إذ هو عين كل شي‏ء وفي الآخرة يكون باطن الإنسان ثابتا فإنه عين ظاهر صورته في الدنيا والتبدل فيه خفي وهو خلقه الجديد في كل زمان الذي هم فيه في لبس وفي الآخرة يكون ظاهره مثل باطنه في الدنيا ويكون التجلي الإلهي له دائما بالفعل فيتنوع ظاهره في الآخرة كما كان يتنوع باطنه في الدنيا في الصور التي يكون فيها التجلي الإلهي فينصبغ بها انصباغا فذلك هو التضاهي الإلهي الخيالي غير أنه في الآخرة ظاهر وفي الدنيا باطن فحكم الخيال مستصحب للإنسان في الآخرة وللحق وذلك هو المعبر عنهما بالشأن الذي هو فيه الحق من قوله كُلَّ يَوْمٍ هُوَ في شَأْنٍ فلم يزل ولا يزال وإنما سمي ذلك خيالا لأنا نعرف أن ذلك راجع إلى الناظر لا إلى الشي‏ء في نفسه فالشي‏ء في نفسه ثابت على حقيقته لا يتبدل لأن الحقائق لا تتبدل ويظهر إلى الناظر في صور متنوعة وذلك التنوع حقيقة أيضا لا تتبدل على تنوعها فلا تقبل الثبوت على صورة واحدة بل حقيقتها الثبوت على التنوع فكل ظاهر في العالم صورة ممثلة كيانية مضاهية لصورة إلهية لأنه لا يتجلى للعالم إلا بما يناسب العالم في عين جوهر ثابت كما إن الإنسان من حيث جوهره ثابت أيضا فترى الثابت بالثابت وهو الغيب منك ومنه وترى الظاهر بالظاهر وهو المشهود والشاهد والشهادة منك ومنه فكذا تدركه وكذا تدرك ذانك غير أنك معروف في كل صورة إنك أنت لا غيرك كما تعلم أن زيدا في تنوعه في كيفياته من خجل ووجل ومرض وعافية ورضي وغضب وكل ما يتقلب فيه من الأحوال أنه زيد لا غيره كذلك الأمر فنقول قد تغير فلان من حال إلى حال ومن صورة إلى صورة ولو لا ما هو الأمر على هذا لكان إذا تبدل الحال عليه لم نعرفه وقلنا بعدمه فعلمنا إن ثم عينين كما قال تعالى أَ لَمْ نَجْعَلْ لَهُ عَيْنَيْنِ فعين يدرك به من يتحول وعين يدرك به التحول وهما طريقان مختلفان قد أبانهما الله لذي عينين وهو قوله وهَدَيْناهُ النَّجْدَيْنِ أي بينا له الطريقين كما قال الشاعر\n\n\n> نجدا على أنه طريق *** تقطعه للظبا عيون‏\n\n\nفجعل قطع الطريق للعيون فكل عين لها طريق فاعلم من رأيت وما رأيت ولهذا صح وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏\nفالعين التي أدركت بها إن الرمي لله غير العين التي أدركت بها إن الرمي لمحمد صَلَّى اللهُ عَليهِ وسَلَّم فتعلم إن لك عينين إن كنت صاحب علم فتعلم قطعا إن الرامي هو الله في صورة محمدية جسدية وليس التمثل والتخيل غير هذا فالله قد نبهك وأنت لا تتنبه وهذه هي الآيات التي جعلها الله لِقَوْمٍ يَعْقِلُونَ عنه ويتفكرون فيها وذكرى لِمَنْ كانَ لَهُ قَلْبٌ يتقلب ف أَلْقَى السَّمْعَ لما قيل له وعرف به وهُوَ شَهِيدٌ لتقلبه في نفسه فيعلم إن الأمر كذلك وهؤلاء هم أولو الألباب فإن اللب يحجبه صورة القشر فلا يعلم اللب إلا من علم إن ثم لبا ولو لا ذلك ما كسر القشر فقد امتزج الأمر وما اختلطت الحقائق وبذلك يميز الفاضل من المفضول فيتنعم العالم بعلمه به وينعم الجاهل بجهله به ولا يعلم أنه جاهل به لأنه لا يعلم أن الأمر الذي هو على خلاف ما يعلمه أنه على خلاف ما يعلمه بل يقول ما ثم إلا هذا ولو علم إن ثم خلاف ما يعلمه وما أدركه لتنغص كما يتنغص في الدنيا كل متنغص لما فاته مما يقتضيه مقامه من التاجر في تجارته والفقيه في فقهه وكل عالم في طوره فتحقيق قوله عموما كُلُّ حِزْبٍ بِما لَدَيْهِمْ فَرِحُونَ إنما ذلك في الآخرة بخلاف الدنيا فإنه لا يعلم في الدنيا بل هو في الكثير من غير عموم فإن الإنسان لا يفرح بما عنده من العلم بما هو به متصور قبل حصوله فإنه منتظر إياه فهو في أ لم فإذا حصل عنده أيضا لم يفرح به ومال الكل في الآخرة بعد انقضاء مدة المؤاخذة إلى الفرح بما عنده وبما هو عليه وهذا المنزل هو منزل خلق الله آدم على صورته ومن جعل على صورة أمر ما فكان ذلك الأمر هو عين هذه الصورة فهو هو لا هو وبهذا صح وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ فكل ما يظهر من تلك الصورة فأصله ممن هي عليه فلا يصح له أن يبقى عن كل ما يظهر منها ولهذا جاء وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ يعني الذي هو عليه العالم بأسره ولهذا وصف الحق نفسه على ألسنة رسله بما وصف به العالم كله قدما بقدم ما اختل شي‏ء من ذلك ولا أخل به‏\n\n\n> فعين الخلق عين الحق فيه *** فلا تنكر فإن الكون عينه‏\n\n\n> فإن فرقت فالفرقان باد *** وإن لم فاعتبر فالبين بينه‏\n\n\nولما قال إنه جعلك على الصورة علم أنه لا بد لك من الدعوى بالملك لما أنت عليه كما أنه ذو ملك وليس لك ملك أقرب من نفسك وهي التي تدعى الملك لأنها على صورة من له الملك فعمد إليها من كونها مؤمنة من اسمه المؤمن فاشترى من المؤمن نفسه فبقي المؤمن لا نفس له كسائر الحيوان فلم يبق من يدعي ملكا فصار الملك لِلَّهِ الْواحِدِ الْقَهَّارِ وزال الاشتراك فالمؤمن لا نفس له فلا دعوى له في الملك فكل مؤمن ادعى ملكا حقيقة فليس بمؤمن فإن المؤمن من باع نفسه فما بقي له من يدعي لأن نفسه كانت صاحبة الدعوى لكونها على صورة من له الدعوى بالملك حقيقة وهو الله تعالى فاحفظ نفسك يا أخي من دعوى تسلب عنك الايمان فإياك إن تحامي عن نفسك التي كانت لك وإذا عزمت على أن تحامي عنها فحام عنها بحضور وعلم على أنها نفس الحق لا نفسك ومن هناك يحازيك ربك فإنك صادق ومؤثر ودرجة الإيثار قد علمت ما تقتضيه عند الله من الرفعة فاعمل على ذلك فإذا علمت هذا\n\n\n### [إن للإنسان وجهين وجها إلى ذاته ووجها إلى ربه‏]\n\n\nفاعلم إن للإنسان وجهين وجها إلى ذاته ووجها إلى ربه ومع أي وجه توجهت إليه غبت عن الآخر غير إن هنا لطيفة أنبهك عليها وذلك إنك إذا توجهت إلى مشاهدة وجهك غبت من وجه ربك ذي الجلال والإكرام ووجهك هالك فإذا انقلبت إليه فنى عنك وجهك فصرت غريبا في الحضرة تستوحش فيها وتطلب وجهك الذي كنت تأنس به فلا تجده وإن توجهت إلى وجه ربك وتركت وجهك أقبل عليك ولم يكن لك مؤنس سواه ولا مشهود إلا إياه فإذا انقلبت إليه الانقلاب الخاص الذي لا بد لكل إنسان منه وجدت من كان لك قبل هذا الانقلاب أنيسا وجليسا وصاحبا ففرحت بلقائه وعاد الأنس أعظم وتتذكر الأنس الماضي فتزيد أنسا إلى أنس وترى عنده وجه ذاتك ولا تفقده فتجمع بين الوجهين في صورة واحدة فيتحد الأنس لاتحاد الوجهين فيعظم الابتهاج والسرور وهذه حالة برزخية بين حالتين لكونها جمعت بين الطرفين فمن جمع بينهما في الدنيا حرم ذلك في الآخرة\n\n\nكالمنافق فإنه برزخ بين المؤمن والكافر فإذا انقلب تخلص إلى أحد الطرفين وهو طرف الكفر ولم يتخلص للإيمان فلو تخلص هنا إلى الايمان ولم يكن برزخا كان إذا انقلب إلى الله كما ذكرناه من جمعه بين الطرفين فاحذر هنا من صفة النفاق فإنها مهلكة ولها في سوق الآخرة نفاق اقتضى ذلك الموطن وما أخذ المنافق‏\nهنا إلا لأمر دقيق لا يشعر به كثير من المؤمنين العلماء وقد نبه الله عليه لمن أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ وذلك أن المنافقين هنا إِذا لَقُوا الَّذِينَ آمَنُوا قالُوا آمَنَّا لو قالوا ذلك حقيقة لسعدوا وإِذا خَلَوْا إِلى‏ شَياطِينِهِمْ قالُوا إِنَّا مَعَكُمْ لو قالوا ذلك وسكتوا ما أثر فيهم الذم الواقع وإنما زادوا إِنَّما نَحْنُ مُسْتَهْزِؤُنَ فشهدوا على أنفسهم أنهم كانوا كاذبين فما أخذوا إلا بما أقروا به وإلا لو أنهم بقوا على صورة النفاق من غير زيادة لسعدوا أ لا ترى الله لما أخبر عن نفسه في مؤاخذته إياهم كيف قال الله يَسْتَهْزِئُ بِهِمْ فما أخذهم بقولهم إِنَّا مَعَكُمْ وإنما أخذهم بما زادوا به على النفاق وهو قولهم إِنَّما نَحْنُ مُسْتَهْزِؤُنَ وما عرفك الله بالجزاء الذي جازى به المنافق إلا لتعلم من أين أخذ من أخذ حتى تكون أنت تجتنب موارد الهلاك وقد قال عليه السلام إن مداراة الناس صدقة\n\n\nفالمنافق يداري الطرفين مداراة حقيقة ولا يزيد على المداراة فإنه يجني ثمرة الزائد كان ما كان فتفطن فقد نبهتك على سر عظيم من أسرار القرآن وهو واضح ووضوحه إخفاء وانظر في صورة كل منافق تجده ما أخذ إلا بما زاد على النفاق وبذلك قامت عليه الحجة ولو لم يكن كذلك الحشر على الأعراف مع أصحاب الأعراف وكان حاله حال أصحاب الأعراف ولكِنْ لِيَقْضِيَ الله أَمْراً كانَ مَفْعُولًا فالمؤمن المداري منافق وهو ناج فاعل خير فإنه إذا انفرد مع أحد الوجهين أظهر له الاتحاد به ولم يتعرض إلى ذكر الوجه الآخر الذي ليس بحاضر معه فإذا انقلب إلى الوجه الآخر كان معه أيضا بهذه المثابة والباطن في الحالتين مع الله فإن المقام الإلهي هذه صورته فإنه لعباده بالصورتين فنزه نفسه وشبه فالمؤمن الكامل بهذه المثابة وهذا عين الكمال فاحذر من الزيادة على ما ذكرته لك وكن متخلقا بأخلاق الله وقد قال تعالى لنبيه صَلَّى اللهُ عَليهِ وسَلَّم ممتنا عليه فَبِما رَحْمَةٍ من الله لِنْتَ لَهُمْ واللين خفض الجناح والمداراة والسياسة أ لا ترى إلى الحق تعالى يرزق الكافر على كفره ويمهل له في المؤاخذة عليه وقال عز وجل لموسى وهارون في حق فرعون فَقُولا لَهُ قَوْلًا لَيِّناً وهذه عين المداراة فإنه يتخيل في ذلك إنك معه ومن هذا المقام لما ذقته واتحدت به اتفق لي أني صحبت الملوك والسلاطين وما قضيت لأحد من خلق الله عند واحد منهم حاجة إلا من هذا المقام وما زدني أحد من الملوك في حاجة التمستها منه لأحد من خلق الله وذلك أني كنت إذا أردت أن أقضي عنده حاجة أحد أبسط له بساطا استدرجه فيه حتى يكون الملك هو الذي يسأل ويطلب قضاء تلك الحاجة مسارعا على الفور بطيب نفس وحرص لما يرى له فيها من المنفعة فكنت أقضي للسلطان حاجة بأن أقبل منه قضاء حاجة ذلك الإنسان ولقد كلمت الملك الظاهر بأمر الله صاحب حلب في حوائج كثيرة فقضى لي في يوم واحد مائة حاجة وثمان عشرة حاجة للناس ولو كان عندي في ذلك اليوم أكثر من هذا قضاء طيب النفس راغبا وإذا حصل للإنسان هذه القوة انتفع به الناس عند الملوك فما في العالم أمر مذموم على الإطلاق ولا محمود على الإطلاق فإن الوجوه وقرائن الأحوال تقيده فإن الأصل التقييد لا الإطلاق فإن الوجود مقيد بالضرورة ولذلك يدل الدليل على إن كل ما دخل في الوجود فإنه متناه فالإطلاق الصحيح إنما يرجع لمن في قوته إن يتقيد بكل صورة ولا يطرأ عليه ضرر من ذلك التقييد وليس هذا إلا لمن تحقق بالمداراة وهو الإمعة والله عز وجل يقول وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ فهي أشرف الحالات لمن عرف ميزانها وتحقق بها وهو واحد وأين ذلك الواحد\n\n\n> إلا إن النفاق هو النفاق *** إليه إذا تحققت المساق‏\n\n\n> فكن فيه تكن بالحق صرفا *** وتحمده إذ شد الوثاق‏\n\n\n> إذا ما كنت معتمد الشي‏ء *** فأنت له إذا فكرت ساق‏\n\n\n> على العمد الذي قد غاب عنا *** إذا ما كنت تعتمد الطباق‏\n\n\n> فكن ذاك العماد تكن إماما *** فيظهر عندك الدين الوفاق‏\n\n\nفتدبر القرآن من كونه فرقانا وقرآنا فللقرآن موطن وللفرقان موطن فقم في كل موطن باستحقاقه تحمدك المواطن والمواطن شهداء عدل عند الله فإنها لا تشهد إلا بصدق وقد نصحتك فاعمل والله الموفق قلنا وفي هذا المنزل من العلوم علم دقيق خفي لا يشعر به لخفائه مع ظهوره فإن العلماء بالله قد علموا شمول الرحمة\nوالمؤمنون قد علموا اتساعها ثم يرونها مع الشمول والاتساع ما لها صورة في بعض المواطن ومع كونها ما لها صورة ظاهرة في بعض المواطن فإن الحكم لها في ذلك الموطن الذي ما لها فيه صورة ولا يكون لها حكم إلا بوجودها ولكن هو خفي لبطونها جلي لظهور حكمها وأكثر ما يظهر ذلك في صنعة الطب وإقامة الحدود فالله يقول في إقامة الحدود في حد الزاني والزانية ولا تَأْخُذْكُمْ بِهِما رَأْفَةٌ في دِينِ الله فهذا عين انتزاع الرحمة بهم وإقامة الحدود من حكم الرحمة وما لها عين ظاهرة وكالطب إذا قطع الطبيب رجل صاحب الأكلة فإن رحمه في هذا الموطن ولم بقطع رجله هلك فحكم الرحمة حكم بقطع رجله ولا عين لها فللرحمة موطن تظهر فيه بصورتها ولها موطن تظهر فيه بحكمها فيتخيل أنها قد انتزعت من ذلك المحل وليس كذلك وفي الأحكام الشرعية في هذه المسألة خفاء إلا لمن نور الله بصيرته فإن القاتل ظلما قد نزع الله الرحمة من قلبه في حق المقتول وهو تحت حكم الرحمة في قتله ظلما وبقي حكمها في القاتل فأما إن يقاد منه وإما أن يموت فيكون في المشيئة وإن كان القائل كافرا فأما إن يسلم فتظهر فيه الرحمة بصورتها وحيثما كانت الرحمة بالصورة كانت بالحكم وقد تكون بالحكم ولا تكون بالصورة وفيه علم غريب وهو علم تقييد الحق بانتزاح الكون عنه مع كونه في قبضته وتحت سلطانه وملكه وفيه علم السياسة في الدعوة إلى الله فإن صورتها من الداعي تختلف باختلاف صورة المدعو فثم دعاء بصفة غلظة وقهر وثم دعاء بصفة لين وعطف وفيه علم عموم العهد الإلهي الذي أخذه على بنى آدم وفيه علم الجولان في الملكوت حسا وخيالا وعقلا بثلث النشأة الإلهية فإن النشأة الإنسانية لما أنشئت ممتزجة من الأخلاط أشبهت السنة في فصولها وليس كمال الزمان إلا بفصول السنة ثم يعود الدور فالإنسان من حيث أخلاطه سنة فهو عين الدهر الذي هو الزمان فله جولان في الملكوت بأحد ثلاثة أمور أو بكلها أو ببعضها فأما أن يجول بحسه وهو الكشف وإما أن يجول بعقله وهو حال فكره وتفكره وإما أن يجول بخياله والسنة اثنا عشر شهرا فلكل حقيقة من هذه النشأة المشبهة بالسنة ثلث السنة فلها التثليث في التربيع ولها التربيع في التثليث فأما تثليثها في التربيع فهو ما ذكرناه من تقسيمها على ثلاثة من حس وخيال وعقل في تربيع أخلاطها وأما تربيعها في التثليث فإن حكم الأخلاط بكمالها في كل قسم من الأقسام الثلاثة وهي أربعة فلتربيعها حكم في الحس وحكم في الخيال وحكم في العقل ولا يشعر بذلك إلا أهل الحضور الناظرون الآيات في أنفسهم وفيه علم جهل الإنسان عند مسابقته لله وحجتنا\n\n\nقوله تعالى بادرني عبدي نفسه فيمن قتل نفسه‏\n\n\nوالقول بهذا السياق هو قول أهل النظر في التشبه بالإله جهد الطاقة وأن ذلك إذا وجد هو الكمال وهذا عندنا هو عين الجهل أن يسابق الحق فيما هو له بما هو لي فإنه من المحال أن تسابقه بما هو له فإن الشي‏ء لا يسابق نفسه ومن المحال أن تسابقه بما هو لي فإنه ما ثم غاية يسابق إليها فيكون عمل في غير معمل وطمع في غير مطمع ومن كان في هذه الحال فلا خفاء بجهله لو عقل نفسه وفيه علم الإعلام الإلهي في المادة الإلهية بما ذا يكون وما ذا يقع في إسماع السامعين من ذلك الإعلام هل يقع في كل سمع على حد واحد أو يختلف تعلق السمع عند ذلك الإعلام وفيه علم المعاملة مع الخلق على اختلاف أصنافهم بما يسرهم منك لا بما يسوءهم وهو علم عزيز صعب التناول ودقيق الوزن مجهول الميزان يحتاج صاحبه إلى كشف وحينئذ يحصل له وفيه علم ما حكم أصحاب الآجال إذا انتهت آجالهم هل يؤخرون بعد ذلك الانتهاء إلى أجل مسمى أو لا يكون لهم أجل أيضا ينتهون إليه وفيه علم ما يمكن أن يصح من الشروط وما لا يمكن أن يصح منها وفيه علم إعطاء الأمان ولمن ينبغي أن يعطي فلا بد من علم الأحوال لهذا المتحكم وفيه علم تنوع الناس في أخلاقهم وما هو المحمود من ذلك وما هو المذموم منها وفيه علم علم الملائكة بالله الذي لا يعلمه أحد من البشر حتى يتجرد عن بشريته ويتجرد عن حكم ما فيه للطبيعة من حيث نشأته حتى يبقى بما فيه إلا الروح المنفوخ فحينئذ يتخلص إلى العلم بالله من حيث تعلمه الملائكة فيقوم في عبادته ربه مقام الملائكة في عبادتهم لله وهي العلامة فيمن ادعى أنه يعلم الله بصورة ما تعلمه الملائكة فمن ادعى ذلك من غير هذه العلامة فدعواه زور وبهتان فإن للملائكة علما بالله تعالى يعم الصنف وعلما خالصا لكل ملك بالله لا يكون لغيره فنحن ما نطالبه في دعواه إلا بالعلم العام وهذه العلامة معلومة عندنا ذوقا لا نذكرها لأحد لئلا يظهر بها في وقت وهو\nكاذب في دعواه غير متحقق فلهذا أمرنا وأمثالنا بستر هذا وأمثاله وفيه علم دلالات العلماء بالله على طبقاتهم فإنهم على طبقات في العلم بالله تعالى وفيه علم إزالة العلل وأمراض النفوس وفيه علم آداب الدخول على الله وفيه علم صفات من يدعي أنه جليس الله جلوس شهود لا جلوس ذكر فإن الذاكرين أيضا جلساء الله وهم على الحقيقة جلساء الله من حيث الاسم الذي يذكرونه به وهذه مسألة لا يعرفها كثير من الناس وفيه علم ما تعطيه رحمة الرضاء ورحمة الفضل وأنواع الرحموتيات وفيه علم إقامة النعيم هل لذلك النعيم الدوام أو يتخلله حال لا نعيم فيه ولا غير ذلك وفيه علم تفاصيل الأجور عند الله عز وجل وبما ذا تتميز وفيه علم الحب الإلهي المندرج في كل حب وما مقام من شاهد ذلك وعلمه وهل يستوي من لا علم له بذلك مع العالم به أم لا وفيه علم المعتمدات وما يجب منها وما لا يجب وفيه علم السكائن جمع سكينة هل يجمعها أمر واحد كالإنسانية في أشخاصها أو هي متنوعة كل سكينة من نوع ليس هو عين السكينة الأخرى وفيه علم تنوع الرجوع الإلهي لتنوع حال المرجوع إليه أيضا وفيه علم درجات الأغنياء بالله في غناهم بالله جل ثناؤه وفيه علم ما السبب الموجب للطبيعة أن تستخبث وتتقذر وما يكون منها وهي عينه وهل لها في العلم الإلهي أصل ترجع إليه مثل ما يذم من أفعال العباد وسفساف الأخلاق مع العلم بأن ذلك صورة من الصور التي تكون مجلى وفيه علم من العلوم الإلهية في تفضيل بعض النسب الإلهية على بعض وإن رفع العالم بعضه على بعض ينتج من هذا الأصل فإنه من المحال أن يكون في العالم شي‏ء ليس له مستند إلى أمر إلهي يكون نعتا للحق تعالى كان ما كان وفيه علم ما ينبغي أن يضاف إلى الله وما لا ينبغي أن يضاف وفيه علم سريان الربوبية في العالم حتى عبد من عبد من دون الله تعالى وفيه علم ما ينبغي أن يدخر من العلوم وما ينبغي أن لا يفشي وما ينبغي أن لا يدخر وما ينبغي أن يفشي وفيه علم ما اصطفاه الله من الزمان من ساعاته وأيامه ولياليه وشهوره وهو علم تفاضل الدهر في نفسه وما أصل الدهر وما السبب لتسمية الله باسم الدهر وهو اسم أزلي له ولا دهر وهل سمي الزمان دهر الأجل هذا الاسم أو تسمى الله بهذا الاسم لعلمه أنه يخلق أمرا يقال له الدهر فإنه لم يزل خالقا ولا يزال خالقا وهل ينتهي حكم الزمان في العالم أو لا ينتهي وما حظ حركات الأفلاك من الزمان وفيه علم من دعي إلى سعادته فتلكأ عن الإجابة مع علمه بأنه دعي إلى حق وفيه علم أسباب النصر الإلهي وفيه علم محبة الحق وفيه علم ما السبب الداعي إلى المباهت مع علمه أنه مباهت مع علمه أنه مسئول عن ذلك والغلبة للاقوى وللحق القوة والهوى يغالبه وقد يظهر عليه فهل ظهوره عليه بما له نصيب من الحق فلا يظهر على الحق إلا الحق وفيه علم ابتلاء الإمام أصحابه لإقامة الحجة عليهم لا يستفيد علما بذلك وفيه علم ما يقال عند كل حال يتقلب على العبد أو يتقلب العبد فيه وفيه علم الدوائر المهلكة ما هي وأسبابها الموجبة لآثارها في الكون وفيه علم ما السبب الذي يمنع من قبول العمل الخالص حتى يعمل العامل في غير معمل وفيه علم قسمة النعم على العباد وهي في أيدي العباد وما لهم منها سوى الاختزان في نفس الأمر وهم مسئولون عنها وفيه علم الإصغاء لكل قائل وما فائدته إذا لم يؤثر في السامع فإن كان سريع الانفعال لما يسمع فيجب عليه عقلا إن لا يصغي لقائل شر وفيه علم اختلاف الأسماء على الله عند الطوائف والمقصود واحد وفيه علم ما السبب في معاداة أشخاص النوع الواحد وموالاة الأنواع وإن عمها جنس واحد وفيه علم القدر وما مستنده من النعت الإلهي وهل هو عين الاستدراج أو غيره وفيه علم أسباب الطرد الإلهي والكل في قبضته فممن يكون الطرد وإلى أين وما معنى‏\n\n\nقولهم البعد من الله وفيه علم إنزال المنازل في القوالب لأي معنى تنزل في الصور ولا تنزل معاني كما هي في نفس الأمر وفيه علم أسباب رفع الحرج في حق من ارتفع عنه فإنه محال رفعه عن العالم إذ لو ارتفع لزال العالم عن درجة الكمال وهو كامل بالمرتبة وإن قبل الزيادة بأشخاص الأنواع فلا يتصف بالنقص من أجلها وفيه علم ما لا يكفر من الايمان المعقودة إذا حنث صاحبها في صورة الأمر وهي مسألة ينكرها الفقهاء ويفتون بخلافها وفيه علم ما يعد من مذام الأخلاق وهو من مكارمها عند الله وفيه علم مخالفة الحق عبده المقرب فيما يريده منه مثل قوله تعالى إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ الله لَهُمْ وأمثاله وفيه علم حكم من خرج عن الجماعة أو أخرج يدا من طاعة إمام بعد عقد بيعته وثبوتها وفيه علم السابق‏\nواللاحق وفيه علم الشر والخير وحكم الايمان وفيه علم النفوس الجزئية وفيه علم صفات المقربين وفيه علم الضلال والهدى وفيه علم إقامة الواحد مقام الجمع والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## The Three Hundred and Seventy-Fifth Chapter: On the Knowledge of the Station of Imaginal Correspondence, the World of Realities, and Intermixture\n\nThis is from the Muhammadan Presence (الحضرة المحمدية).\n\n> How can there be disavowal when nothing in the cosmos is but He?\n> For every cosmos I see, You are its meaning.\n> Yet He brought disavowal in His Law,\n> So the Law which He loved perplexed the intellect.\n> He brought him near, yet no essence differs from Him,\n> So whoever drew near, then after proximity, He distanced him.\n> Allah is the Master (مولى) of all creation, all of them,\n> And no one whose Master is Allah shall fail.\n\n### [Imagination is among the Dependents of the Rational Soul]\n\nKnow, may Allah strengthen you, that the Messenger of Allah, peace and blessings be upon him, said: \"The dependent (Mawlā) of a people is one of them.\"\n\nThe Imagination (الخيال) is among the dependents (موالي) of the Rational Soul (النفس الناطقة). Thus, it stands in relation to the Soul as the dependent stands to the master. The dependent has a certain kind of control over the master due to ownership, for it is through him and others like him among the dependents that the master's status as owner and possessor is validated. Since this status is not validated for the master except through the dependent, the dependent thereby gains a hand that grants him some control over the master.\n\nThe only control it has over the Soul is that it pictures it in whatever form it wills. Even though the Soul has a form in itself, this Imagination does not leave it, in the mind of the imaginer (المتخيل), except according to the images it desires in its imagining.\n\nThe Imagination does not possess the power to remove it from the degree of the sensibles (المحسوسات), because it was neither generated nor did its essence appear except from sense perception (الحس). Thus, every action it performs concerning non-existent things (المعدومات) and existent things (الموجودات), whether they have an essence (عين) in Existence (الوجود) or not, it pictures them in a sensible form that has an essence in Existence, or it pictures a form whose totality does not have an essence in Existence, but all the parts of that form are existent, sensible parts; it cannot picture them except within this limit.\n\nThus, the Imagination combines the general absolute freedom (الإطلاق العام) which no other absolute freedom resembles, for it has general disposal over the Necessary (الواجب), the Impossible (المحال), and the Possible (الجائز). And there is nothing else that possesses the rule of this absolute freedom. This is the disposal of The Real (الحق) over the known things (المعلومات) through the mediation of this power.\n\nJust as it possesses the specific, restricted limitation (التقييد الخاص المنحصر), for it cannot picture any matter except in a sensible form, whether that sensible form was previously existent or not. However, it is necessary that all the parts of the imagined form, as we mentioned, must be existent in the sensibles—meaning, it took them from sense perception when it perceived them separately—even though the composite whole may not exist in Being.\n\n### [That Allah has always been Manifesting in the World to Hearts]\n\nKnow that The Real (الحق) has always been manifesting (متجليا) to hearts (القلوب) in the world constantly. Thus, the thoughts (الخواطر) in man vary due to the Divine Theophany (التجلي الإلهي), though only the People of Allah (أهل الله) perceive this. Just as they know that the variation of the apparent forms in this world and the Hereafter, across all existent things, is nothing other than His variation; He is the Manifest (الظاهر), for He is the essence (عين) of everything.\n\nIn the Hereafter, the inner aspect (باطن) of man will be fixed, for it is the essence of the apparent form of his image in this world. The change within it is hidden; this is His new creation (خلقه الجديد) in every moment, concerning which they are in confusion. In the Hereafter, his outer aspect (ظاهره) will be like his inner aspect in this world, and the Divine Theophany will be constantly active for him, so his outer aspect will vary in the Hereafter just as his inner aspect varied in this world, in the forms wherein the Divine Theophany occurs, and he will be dyed by them completely.\n\nThat is the Divine Imaginal Correspondence (التضاهي الإلهي الخيالي), except that in the Hereafter it is manifest (ظاهر), and in this world it is hidden (باطن). Thus, the rule of Imagination (الخيال) is maintained for man in the Hereafter, and for The Real. That is what is expressed concerning both of them by the \"Affair\" (الشأن) in which The Real is, from His saying: <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>> (Every day He is in [a new] Affair). He has not ceased and will not cease.\n\nThis is only called Imagination (خيال) because we know that it refers back to the observer (الناظر), not to the thing in itself. For the thing in itself is fixed upon its Reality (حقيقته) and does not change, because Realities (الحقائق) do not change. But it appears to the observer in varied forms, and that variation is also a Reality that does not change in its variation; thus, it does not accept fixation upon a single form, but its Reality is fixation upon variation.\n\nThus, every manifest thing in the world (العالم) is a represented, essential form corresponding (مضاهية) to a Divine Form, because He only manifests (يتجلى) to the world with what suits the world, in the essence of a fixed substance. Just as man, in terms of his substance (جوهر), is also fixed. So you see the fixed by means of the fixed, which is the Unseen (الغيب) from you and from Him. And you see the manifest by means of the manifest, which is the Witnessed (المشهود), the Witness (الشاهد), and the Witnessing (الشهادة) from you and from Him. Thus you perceive Him, and thus you perceive those two.\n\nExcept that you are known in every form to be yourself and no other. Just as you know that Zayd, in the variation of his states—of shyness, fear, sickness, health, pleasure, anger, and all the conditions he passes through—is Zayd and no other. The matter is likewise. So we say: So-and-so has changed from one state to another, and from one form to another. If the matter were not thus, then when the state changed upon him, we would not recognize him and would declare his non-existence.\n\nSo we know that there are two eyes, as the Almighty said: <<أَ لَمْ نَجْعَلْ لَهُ عَيْنَيْنِ>> (Did We not make for him two eyes?). One eye by which he perceives the one who changes, and one eye by which he perceives the change. And they are two different paths that Allah has made clear for the possessor of two eyes, which is His saying: <<وهَدَيْناهُ النَّجْدَيْنِ>> (And We guided him to the two highways). Meaning, We made clear to him the two paths, as the poet said:\n\n> A highway, on the basis that it is a path,\n> Which eyes traverse for the gazelles.\n\nSo He made the traversing of the path belong to the eyes; thus, every eye has a path. So know whom you saw and what you saw. For this reason, the saying is valid: <<وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى>> (And you did not throw when you threw, but Allah threw). The eye by which you perceived that the throwing belonged to Allah is different from the eye by which you perceived that the throwing belonged to Muhammad, peace and blessings be upon him. So you know that you have two eyes, if you are a possessor of Knowledge (علم). Then you know definitively that the thrower is Allah in a physical Muhammadan form. And representation (التمثل) and imagination (التخيل) are nothing other than this.\n\nAllah has alerted you, yet you do not take heed. These are the signs (الآيات) that Allah made for <<لِقَوْمٍ يَعْقِلُونَ>> (a people who reason) about Him and reflect upon them, and a reminder for <<لِمَنْ كانَ لَهُ قَلْبٌ>> (whoever has a heart) that turns, so he <<أَلْقَى السَّمْعَ>> (gives ear) to what was said to him and knows by it, while <<وهُوَ شَهِيدٌ>> (he is a witness) to his own turning within himself, and thus knows that the matter is so. These are the possessors of intellects (أولو الألباب). For the kernel (اللب) is veiled by the form of the husk (القشر), and only he who knows that there is a kernel knows the kernel; otherwise, he would not break the husk.\n\nThe matter has become intermixed (امتزج), yet the Realities (الحقائق) have not become confused. By this, the superior is distinguished from the inferior. So the knower (العالم) enjoys bliss through his knowledge of it, and the ignorant (الجاهل) enjoys bliss through his ignorance of it, and he does not know that he is ignorant of it, because he does not know that the matter which is contrary to what he knows is indeed contrary to what he knows; rather, he says, \"There is nothing but this.\" If he knew that there was something contrary to what he knows and perceives, he would be distressed, just as everyone in this world is distressed by what they miss that their station requires, whether it be the merchant in his trade, the jurist in his jurisprudence, or every scholar in his domain.\n\nThe realization of His general saying: <<كُلُّ حِزْبٍ بِما لَدَيْهِمْ فَرِحُونَ>> (Every party is rejoicing in what they have) is only fully achieved in the Hereafter, unlike this world, where it is not known generally, but only in many cases without being universal. For man does not rejoice in the knowledge he possesses concerning something he imagines before its attainment, because he is awaiting it, and thus he is in pain. And even when he attains it, he does not rejoice in it. But in the Hereafter, after the period of accountability ends, everyone inclines toward rejoicing in what they possess and what they are upon.\n\nThis station (منزل) is the station of Allah creating Adam upon His form. Whoever is made upon the form of a certain matter, and that matter is the very essence of this form, then he is Him, yet not Him. By this, the saying is valid: <<وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى>> (And you did not throw when you threw, but Allah threw). Everything that appears from that form has its origin in the One upon whose form it is, so it is not valid for him to remain separate from everything that appears from it. For this reason, the saying came: <<وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him is returned the whole affair)—meaning, the state upon which the entire cosmos rests. For this reason, The Real described Himself upon the tongues of His messengers with what He described the entire cosmos, step by step; nothing of that was deficient, nor did He neglect it.\n\n> The essence of Creation is the essence of The Real within it,\n> So do not deny, for the cosmos is His essence.\n> If you differentiate, then the Criterion (Furqān) is manifest,\n> And if not, then reflect, for the separation is between them.\n\nWhen He said that He made you upon the Form, He knew that you must necessarily claim ownership (الملك) over what you are upon, just as He is the Possessor of Ownership. And you have no ownership closer than your soul (نفسك), and it is the one that claims ownership because it is upon the form of the One who possesses Ownership. So He directed Himself toward it, since it was a believer (مؤمن) from His Name, The Giver of Security (المؤمن), and He bought the soul from the believer. Thus, the believer remained without a soul, like the rest of the animals, and there remained no one to claim ownership, so the Ownership became <<لِلَّهِ الْواحِدِ الْقَهَّارِ>> (for Allah, the One, the Subduer), and partnership ceased.\n\nThe believer has no soul, so he has no claim to ownership. Thus, any believer who truly claims ownership is not a believer. For the believer is one who sold his soul, so nothing remains for him to claim, because his soul was the claimant, due to its being upon the form of the One who truly claims Ownership, which is Allah Almighty. So guard yourself, my brother, from a claim that strips you of faith (الإيمان). Beware of defending the soul that was yours. And if you resolve to defend it, then defend it with presence (حضور) and knowledge (علم), on the basis that it is the Soul of The Real (نفس الحق), not your soul. And from there your Lord rewards you, for you are truthful and altruistic (مؤثر). You know the elevation that the degree of Altruism (الإيثار) necessitates with Allah, so act upon that. If you know this...\n\n### [That Man has Two Faces: a Face toward his Essence and a Face toward his Lord]\n\nKnow that man has two faces: a face toward his Essence (ذاته) and a face toward his Lord. With whichever face you turn toward, you are absent from the other. Except that here is a subtlety (لطيفة) I will alert you to: If you turn toward witnessing (مشاهدة) your own face, you are absent from the Face of your Lord, Possessor of Majesty and Honor. And your face is perishable. So when you turn back to it, your face is annihilated (فنى) from you, and you become a stranger in the Presence (الحضرة), feeling alienated, seeking your face with which you used to feel intimacy (أنس), but not finding it.\n\nBut if you turn toward the Face of your Lord and abandon your face, He turns toward you, and you have no intimate companion other than Him, and nothing witnessed (مشهود) except Him. Then, when you turn back to it—the specific turning that is necessary for every human—you find the one who was your intimate, companion, and friend before this turning. So you rejoice at meeting him, and the intimacy returns, greater than before, and you remember the past intimacy, thus adding intimacy upon intimacy. And you see the face of your Essence (وجه ذاتك) with Him and do not lose it, thus combining the two faces in a single form, and the intimacy unites due to the union of the two faces, and the joy and happiness become immense.\n\nThis is a state of the Isthmus (حالة برزخية) between two states, because it combines the two extremes. Whoever combines them in this world is deprived of that in the Hereafter. Like the hypocrite (المنافق), for he is an Isthmus (برزخ) between the believer and the disbeliever. When he turns back, he is delivered to one of the two extremes, which is the extreme of disbelief, and he is not delivered to faith. If he had been delivered here to faith and was not an Isthmus, then when he turned back to Allah, he would have combined the two extremes, as we mentioned.\n\nSo beware here of the quality of hypocrisy (النفاق), for it is destructive, and it has a currency in the market of the Hereafter that necessitates that station. The hypocrite was only seized here for a subtle matter that many knowledgeable believers do not perceive. Allah has alerted to it for whoever <<أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ>> (gives ear while he is a witness). That is, the hypocrites here, <<إِذا لَقُوا الَّذِينَ آمَنُوا قالُوا آمَنَّا>> (when they meet those who believe, they say, \"We believe\"). If they had said that truthfully, they would have been happy. And <<وإِذا خَلَوْا إِلى‏ شَياطِينِهِمْ قالُوا إِنَّا مَعَكُمْ>> (when they are alone with their devils, they say, \"Indeed, we are with you\"). If they had said that and remained silent, the ensuing blame would not have affected them. But they added: <<إِنَّما نَحْنُ مُسْتَهْزِؤُنَ>> (We are only mockers), thus testifying against themselves that they were liars. They were only seized for what they confessed. Otherwise, if they had remained upon the form of hypocrisy without addition, they would have been happy.\n\nDo you not see that when Allah informed about Himself concerning His seizing them, He said: <<الله يَسْتَهْزِئُ بِهِمْ>> (Allah mocks them)? So He did not seize them for their saying, \"Indeed, we are with you,\" but rather for what they added to the hypocrisy, which was their saying, \"We are only mockers.\" Allah only informed you of the recompense He gave the hypocrite so that you may know from where those who were seized were taken, so that you may avoid the sources of destruction. The Prophet, peace be upon him, said: \"Conciliating people (مداراة الناس) is charity (ṣadaqa).\"\n\nThe hypocrite conciliates both parties with true conciliation, but he does not add anything to the conciliation, for he reaps the fruit of the addition, whatever it may be. Be aware, for I have alerted you to a great secret among the secrets of the Quran; it is manifest, and its manifestation is concealment. Look at the form of every hypocrite, and you will find that he was only seized for what he added to the hypocrisy, and by that, the proof was established against him. If it were not so, the gathering would be on the Heights (الأعراف) with the People of the Heights, and his state would be the state of the People of the Heights, but <<لِيَقْضِيَ الله أَمْراً كانَ مَفْعُولًا>> (that Allah might accomplish a matter already destined to be done).\n\nThe conciliatory believer is a hypocrite, yet he is saved and a doer of good. For when he is alone with one of the two faces, he shows him union with it and does not mention the other face that is not present with him. And when he turns back to the other face, he is also with it in this manner. And the inner aspect (الباطن) in both states is with Allah. For the Divine Station (المقام الإلهي) has this form: He manifests to His servants in both forms, so He declares Himself transcendent (نزه) and He likens Himself (شبه). The Perfect Believer (المؤمن الكامل) is in this manner, and this is the very essence of Perfection (الكمال).\n\nSo beware of adding to what I have mentioned to you, and be characterized by the morals of Allah. The Almighty said to His Prophet, peace and blessings be upon him, conferring a favor upon him: <<فَبِما رَحْمَةٍ من الله لِنْتَ لَهُمْ>> (So by mercy from Allah, [O Muhammad], you were lenient with them). And leniency (اللين) is lowering the wing, conciliation (المداراة), and policy (السياسة). Do you not see that The Real (الحق) Almighty provides for the disbeliever despite his disbelief and grants him respite regarding accountability for it? And He, Exalted and Mighty, said to Moses and Aaron concerning Pharaoh: <<فَقُولا لَهُ قَوْلًا لَيِّناً>> (So speak to him with gentle speech). This is the very essence of conciliation, for it is imagined thereby that you are with him.\n\nFrom this station, when I tasted it and became united with it, it happened to me that I accompanied kings and sultans, and I never fulfilled a need for any of Allah's creation with any of them except from this station. And none of the kings ever refused me a need I sought from him for any of Allah's creation. This is because when I wanted to fulfill someone's need with him, I would spread out a carpet for him, drawing him into it until the king himself would ask and seek to fulfill that need immediately, with good cheer and eagerness, due to the benefit he saw in it for himself. Thus, I would fulfill a need for the Sultan by accepting from him the fulfillment of that person's need. I spoke to Al-Malik al-Zahir bi-Amr Allah, the ruler of Aleppo, concerning many needs, and he fulfilled for me in a single day one hundred and eighteen needs for people. Had I had more than that on that day, he would have fulfilled them with good cheer and willingness. When a person attains this power, people benefit from him in the presence of kings.\n\nThere is nothing in the world that is absolutely blameworthy (مذموم) or absolutely praiseworthy (محمود). For the faces (وجوه) and the context of the states (قرائن الأحوال) restrict it, since the origin is restriction (التقييد), not absolute freedom (الإطلاق). For Existence (الوجود) is necessarily restricted, and thus the proof indicates that everything that enters into Existence is finite. The true absolute freedom (الإطلاق الصحيح) only belongs to the one who has the power to be restricted by every form, and no harm befalls him from that restriction. This belongs only to the one who has realized conciliation (المداراة), and that is the *Imma'a* [the one who agrees with everyone]. And Allah, Exalted and Mighty, says: <<وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ>> (And He is with you wherever you are). This is the noblest of states for whoever knows its balance and realizes it, and he is one. Where is that one?\n\n> Except that hypocrisy (النفاق) is the hypocrisy\n> To Him, if you realize the course.\n> Be in it, and you will be The Real purely,\n> And you praise Him when He tightens the bond.\n> If you are the support of the thing,\n> Then you are its leg, if you reflect,\n> Upon the support that has been hidden from us,\n> If you rely upon the layers.\n> So be that support, and you will be an Imām,\n> And the religion of agreement (al-Wifāq) will appear with you.\n\nSo reflect upon the Quran in terms of its being a Criterion (Furqān) and a Recitation (Quran). For the Recitation has a station, and the Criterion has a station. So stand in every station according to its due, and the stations will praise you. The stations are just witnesses with Allah, for they only testify truthfully. I have advised you, so act, and Allah is the Granter of Success.\n\nWe say: And in this station (منزل) there is a subtle, hidden knowledge (علم دقيق خفي) that is not perceived due to its hiddenness, despite its manifestation. For the Gnostics of Allah (العلماء بالله) have known the comprehensiveness of Mercy (الرحمة), and the believers have known its vastness. Yet they see that, despite its comprehensiveness and vastness, it has no form (صورة) in certain stations. Even though it has no manifest form in certain stations, the ruling (الحكم) belongs to it in that station where it has no form, and it would not have a ruling except by its existence. However, it is hidden due to its inwardness (بطونها) and manifest due to the appearance of its ruling.\n\nThis appears most clearly in the craft of medicine and the establishment of legal penalties (الحدود). Allah says concerning the establishment of penalties for the male and female fornicator: <<ولا تَأْخُذْكُمْ بِهِما رَأْفَةٌ في دِينِ الله>> (And let no pity (ra'fa) for them prevent you from [carrying out] the religion of Allah). This is the very essence of the removal of Mercy toward them, yet the establishment of penalties is from the ruling of Mercy, though it has no manifest essence. And like medicine: if the doctor cuts off the leg of a person suffering from gangrene, then if he had mercy on him in this station and did not cut off his leg, he would perish. Thus, the ruling of Mercy ruled that his leg be cut off, yet Mercy has no essence [form] there. So Mercy has a station where it appears in its form, and it has a station where it appears by its ruling, and it is imagined that it has been removed from that place, but this is not so.\n\nIn the legal rulings (الأحكام الشرعية), there is hiddenness in this matter, except for the one whose insight Allah has illuminated. The unjust killer: Allah has removed Mercy from his heart concerning the victim, yet he is under the ruling of Mercy in his unjust killing. And its ruling remains upon the killer: either retribution (qisās) is taken from him, or he dies and is subject to the Divine Will (المشيئة). If the killer was a disbeliever, then either he embraces Islam, and Mercy appears in him in its form, or not. Wherever Mercy is present in form, it is present in ruling, but it may be present in ruling without being present in form.\n\nAnd in it is a strange knowledge: the knowledge of restricting The Real (الحق) by the removal of the cosmos from Him, despite the cosmos being in His grasp and under His authority and ownership.\n\nAnd in it is the knowledge of policy (السياسة) in calling to Allah, for its form, coming from the caller, differs according to the form of the one being called. So there is a call characterized by harshness and subjugation, and there is a call characterized by gentleness and compassion.\n\nAnd in it is the knowledge of the universality of the Divine Covenant (العهد الإلهي) that He took from the Children of Adam.\n\nAnd in it is the knowledge of traversing the Kingdom (الملكوت) by sense, imagination, and intellect, through the third of the Divine Genesis (النشأة الإلهية). For when the human genesis (النشأة الإنسانية) was created mixed from humors (الأخلاط), it resembled the year in its seasons. And the perfection of time is only achieved by the seasons of the year, then the cycle returns. Man, in terms of his humors, is a year; thus, he is the very essence of Time (الدهر) which is duration (الزمان). So he has a traversing in the Kingdom by one of three things, or by all of them, or by some of them. Either he traverses by his sense, which is Unveiling (الكشف); or he traverses by his intellect, which is the state of his thought and reflection; or he traverses by his Imagination (الخيال).\n\nThe year has twelve months, so each Reality (حقيقة) of this genesis, which resembles the year, has a third of the year. Thus, it has the triplication in the quadruplication, and the quadruplication in the triplication. As for its triplication in the quadruplication, it is what we mentioned concerning its division into three—sense, imagination, and intellect—in the quadruplication of its humors. As for its quadruplication in the triplication, it is that the ruling of the humors, in their perfection, is present in each of the three divisions, and they are four. So its quadruplication has a ruling in the sense, a ruling in the Imagination, and a ruling in the intellect. Only the People of Presence (أهل الحضور), who observe the signs (الآيات) within themselves, perceive this.\n\nAnd in it is the knowledge of man's ignorance when he races against Allah, and our proof is His saying, Almighty: \"My servant anticipated Me concerning his soul,\" regarding the one who kills himself. The statement in this context is the saying of the People of Speculation (أهل النظر) concerning imitating the Divine to the utmost capacity, and that when this is found, it is Perfection (الكمال). But this, in our view, is the very essence of ignorance: that one should race against The Real (الحق) in what belongs to Him, with what belongs to me. For it is impossible to race against Him with what belongs to Him, since a thing does not race against itself. And it is impossible to race against Him with what belongs to me, for there is no goal to race toward, so it would be action in a place where action is not possible, and ambition in a place where ambition is not possible. Whoever is in this state, his ignorance is not hidden, if he were to understand himself.\n\nAnd in it is the knowledge of the Divine Announcement (الإعلام الإلهي) in the Divine Matter: what it will be, and what will occur in the hearing of the listeners concerning that announcement. Does it occur in every hearing uniformly, or does the attachment of the hearing differ during that announcement?\n\nAnd in it is the knowledge of dealing with creation, despite their varying types, with what pleases them from you, not what displeases them. This is a rare knowledge, difficult to attain, subtle in weight, and its balance is unknown; its possessor requires Unveiling (كشف), and then he attains it.\n\nAnd in it is the knowledge of the ruling concerning the possessors of appointed terms (الآجال) when their terms end: Are they delayed after that ending until a specified term, or do they also have no term to which they end?\n\nAnd in it is the knowledge of which conditions can be valid and which cannot.\n\nAnd in it is the knowledge of granting security (الأمان) and to whom it should be granted. Thus, the one who controls this must have knowledge of the states.\n\nAnd in it is the knowledge of the variation of people in their morals, and what among them is praiseworthy and what is blameworthy.\n\nAnd in it is the knowledge of the angels' knowledge of Allah, which none of mankind knows until he strips himself of his humanity and strips himself of the ruling of what is in him due to nature (الطبيعة) in terms of his genesis, until nothing remains in him except the Spirit that was breathed in. Then he is delivered to the Knowledge of Allah (العلم بالله) from the perspective that the angels know Him, and he stands in the worship of his Lord in the station of the angels in their worship of Allah. This is the sign for anyone who claims that he knows Allah in the manner that the angels know Him. Whoever claims that without this sign, his claim is falsehood and slander. For the angels have a knowledge of Allah Almighty that is general to the species, and a pure knowledge of Allah specific to each angel that no other possesses. We only require him to prove the general knowledge in his claim, and this sign is known to us by tasting (ذوقا); we do not mention it to anyone, lest he manifest it at some time while he is lying in his claim and not realized. For this reason, we and those like us have been commanded to conceal this and its like.\n\nAnd in it is the knowledge of the indications of the Gnostics of Allah (العلماء بالله) concerning their levels, for they are in levels in the Knowledge of Allah Almighty.\n\nAnd in it is the knowledge of removing ailments and diseases of the souls (النفوس).\n\nAnd in it is the knowledge of the manners of entering upon Allah.\n\nAnd in it is the knowledge of the characteristics of one who claims that he is the intimate companion (jalīs) of Allah by the sitting of Witnessing (شهود), not the sitting of remembrance (dhikr). For the rememberers (الذاكرين) are also the companions of Allah, and they are truly the companions of Allah by virtue of the Name by which they remember Him. This is a matter that many people do not know.\n\nAnd in it is the knowledge of what the Mercy of Contentment (رحمة الرضاء) and the Mercy of Grace (رحمة الفضل) grant, and the types of Mercifulness (الرحموتيات).\n\nAnd in it is the knowledge of the establishment of bliss (النعيم): Does that bliss endure, or is it interspersed with a state in which there is neither bliss nor anything else?\n\nAnd in it is the knowledge of the details of rewards (الأجور) with Allah, Exalted and Mighty, and by what they are distinguished.\n\nAnd in it is the knowledge of the Divine Love (الحب الإلهي) inherent in every love, and the station of one who witnesses and knows that, and whether the one who has no knowledge of it is equal to the one who knows it or not.\n\nAnd in it is the knowledge of the relied-upon things, and what among them is obligatory and what is not.\n\nAnd in it is the knowledge of the Tranquilities (السكائن, plural of Sakīna): Are they unified by a single matter, like humanity in its individuals, or are they varied, such that each Tranquility is of a type that is not the essence of the other Tranquility?\n\nAnd in it is the knowledge of the variation of the Divine Return (الرجوع الإلهي) due to the variation of the state of the one returned to.\n\nAnd in it is the knowledge of the degrees of those who are rich through Allah (الأغنياء بالله) in their richness through Allah, Glorious is His Praise.\n\nAnd in it is the knowledge of the cause that necessitates nature (الطبيعة) to become foul and filthy, and what proceeds from it, which is its very essence. Does it have an origin in Divine Knowledge (العلم الإلهي) to which it returns, similar to the blameworthy acts of servants and base morals, despite knowing that this is one of the forms that serves as a manifestation (مجلى)?\n\nAnd in it is a knowledge from the Divine Sciences concerning the preference of some Divine Relations (النسب الإلهية) over others, and that the elevation of one part of the world over another results from this origin. For it is impossible that there be anything in the world that does not have a basis in a Divine Matter that serves as an attribute (نعت) for The Real Almighty, whatever it may be.\n\nAnd in it is the knowledge of what ought to be attributed to Allah and what ought not to be attributed.\n\nAnd in it is the knowledge of the permeation of Lordship (الربوبية) throughout the cosmos, to the extent that some worship what they worship besides Allah Almighty.\n\nAnd in it is the knowledge of which sciences ought to be stored up, which ought not to be divulged, which ought not to be stored up, and which ought to be divulged.\n\nAnd in it is the knowledge of what Allah has chosen from time (الزمان)—from its hours, days, nights, and months—which is the knowledge of the inherent superiority of Time (الدهر). And what is the origin of Time, and what is the reason for Allah naming Himself with the Name *al-Dahr* (Time), which is an eternal Name for Him, even when there was no time? Was duration named *Dahr* because of this Name, or did Allah name Himself with this Name because of His knowledge that He would create a matter called *Dahr*? For He has never ceased to be a Creator and will never cease to be a Creator. And does the ruling of duration (الزمان) end in the cosmos or not? And what is the share of the movements of the celestial spheres (الأفلاك) from duration?\n\nAnd in it is the knowledge of one who is called to his happiness (سعادته) but hesitates to respond, despite knowing that he was called to The Truth (حق).\n\nAnd in it is the knowledge of the causes of Divine Victory (النصر الإلهي).\n\nAnd in it is the knowledge of the Love of The Real (محبة الحق).\n\nAnd in it is the knowledge of the cause that leads to astonishment/confusion (المباهت), despite knowing that one is astonished, and knowing that one is accountable for it. And victory belongs to the stronger, and The Real (الحق) possesses strength, yet caprice (الهوى) struggles against Him and may appear to overcome Him. Is its apparent victory over Him due to its having a share of The Real, such that nothing overcomes The Real except The Real?\n\nAnd in it is the knowledge of the Imām testing his companions to establish proof against them, without gaining knowledge thereby.\n\nAnd in it is the knowledge of what is said during every state that turns upon the servant, or in which the servant turns.\n\nAnd in it is the knowledge of the destructive cycles (الدوائر المهلكة): what they are, and their causes that necessitate their effects in the cosmos.\n\nAnd in it is the knowledge of the cause that prevents the acceptance of sincere action, such that the actor acts in a place where action is not possible.\n\nAnd in it is the knowledge of the division of blessings (النعم) among the servants, which are in the hands of the servants, and they possess nothing of them except storage in reality, and they are accountable for them.\n\nAnd in it is the knowledge of listening to every speaker, and what its benefit is if it does not affect the listener. If the listener is quick to be affected by what he hears, then it is rationally obligatory upon him not to listen to a speaker of evil.\n\nAnd in it is the knowledge of the variation of the Names applied to Allah among different groups, while the intended meaning is one.\n\nAnd in it is the knowledge of the reason for the enmity between individuals of the same species, and the alliance between different species, even though they are encompassed by a single genus.\n\nAnd in it is the knowledge of Divine Decree (القدر), and what Divine Attribute (النعت الإلهي) it relies upon, and whether it is the very essence of gradual enticement (الاستدراج) or something else.\n\nAnd in it is the knowledge of the causes of Divine Expulsion (الطرد الإلهي), when everything is in His grasp. From whom does the expulsion occur, and to where? And what is the meaning of their saying, \"Distance from Allah\"?\n\nAnd in it is the knowledge of the descent of the stations (المنازل) into molds (القوالب): for what reason do they descend into forms and not descend as meanings, as they are in reality?\n\nAnd in it is the knowledge of the causes for the removal of constraint (الحرج) concerning the one from whom it is removed. For it is impossible to remove it from the cosmos (العالم), since if it were removed, the cosmos would depart from the degree of Perfection (الكمال), and it is perfect by rank, even if it accepts increase through the individuals of the species, so it is not characterized by deficiency because of them.\n\nAnd in it is the knowledge of what does not nullify the contracted faith (الايمان المعقودة) if its possessor breaks his oath concerning the form of the matter—a question that jurists (الفقهاء) deny and rule against.\n\nAnd in it is the knowledge of what is counted among blameworthy morals (مذام الأخلاق) yet is among the noble morals (مكارمها) with Allah.\n\nAnd in it is the knowledge of The Real (الحق) opposing His close servant (عبده المقرب) in what he desires from Him, such as His saying, Almighty: <<إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ الله لَهُمْ>> (If you ask forgiveness for them seventy times, Allah will never forgive them), and similar instances.\n\nAnd in it is the knowledge of the ruling concerning one who leaves the community (الجماعة) or withdraws his hand from the obedience of an Imām after his pledge of allegiance (بيعة) has been contracted and established.\n\nAnd in it is the knowledge of the Preceder (السابق) and the Follower (اللاحق).\n\nAnd in it is the knowledge of Evil (الشر) and Good (الخير) and the ruling of faith (الايمان).\n\nAnd in it is the knowledge of the Partial Souls (النفوس الجزئية).\n\nAnd in it is the knowledge of the characteristics of the Near Ones (المقربين).\n\nAnd in it is the knowledge of error (الضلال) and guidance (الهدى).\n\nAnd in it is the knowledge of establishing the single one in the place of the multitude, and <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب تین سو پچھتر: خیالی مماثلت (التضاهي الخيالي) کے مقام، عالم حقائق (عالم الحقائق) اور امتزاج (الامتزاج) کی معرفت میں۔\n\nاور یہ مقام حضرت محمدیہ (الحضرة المحمدية) سے ہے۔\n> کیسا ہے تَبَرّی (جدائی) جبکہ کائنات میں اُس کے سوا کوئی نہیں؟\n> پس ہر کائنات جسے میں دیکھتا ہوں، تُو ہی اُس کا معنی ہے۔\n> اور وہ (نبی ﷺ) اپنی شریعت میں تَبَرّی (جدائی) لائے،\n> پس اُس شریعت نے عقل کو حیران کر دیا جسے وہ (عقل) چاہتی تھی۔\n> اُس نے اُسے (بندے کو) اپنے قریب کیا اور کوئی ایسی عین نہیں جو اُس سے مختلف ہو،\n> پس جو قریب ہوا، پھر قرب کے بعد اُسے دور کر دیا۔\n> اللہ تمام مخلوقات کا مولیٰ ہے،\n> اور کوئی ناکام نہیں ہوتا جس کا مولیٰ اللہ ہو۔\n\n### [خیال (الخيال) ناطق نفس (النفس الناطقة) کے موالی (ماتحتوں) میں سے ہے]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: \"قوم کا مولیٰ انہی میں سے ہوتا ہے۔\"\n\nاور خیال (الخيال) ناطق نفس (النفس الناطقة) کے موالی میں سے ہے، پس یہ (خیال) ناطق نفس کے لیے مولیٰ کی حیثیت رکھتا ہے جیسے آقا کے لیے مولیٰ۔ اور مولیٰ کو آقا پر ملکیت کی وجہ سے ایک قسم کا اختیار حاصل ہوتا ہے، کیونکہ مولیٰ اور اس جیسے دیگر موالی کے ذریعے ہی آقا کا مالک اور بادشاہ ہونا درست ہوتا ہے۔ جب آقا کے لیے یہ مقام مولیٰ کے بغیر درست نہ ہو، تو مولیٰ کو اس وجہ سے ایک ایسا ہاتھ مل جاتا ہے جو اسے آقا پر کچھ اختیار دیتا ہے۔ اور اس کا آقا پر اختیار صرف یہ ہے کہ وہ اسے (نفس کو) جس صورت میں چاہے، مصور کر دے، اگرچہ نفس اپنی ذات میں ایک صورت پر ہو، لیکن یہ خیال متخیل (تخیل کرنے والے) کے نزدیک اسے صرف اسی صورت پر چھوڑتا ہے جو وہ اپنے تخیل میں چاہتا ہے۔ اور خیال میں یہ طاقت نہیں کہ وہ اسے محسوسات (المحسوسات) کے درجے سے باہر نکال سکے، کیونکہ یہ پیدا ہی نہیں ہوا اور نہ ہی اس کی عین ظاہر ہوئی مگر حس (حواس) سے۔ پس ہر وہ تصرف جو یہ معدومات (غیر موجود چیزوں) اور موجودات میں کرتا ہے، اور ہر وہ چیز جس کی وجود میں عین ہو یا نہ ہو، یہ اسے ایک محسوس صورت میں مصور کرتا ہے جس کی وجود میں عین ہو، یا ایسی صورت مصور کرتا ہے جس کی مجموعی طور پر وجود میں عین نہ ہو، لیکن اس صورت کے تمام اجزاء وجودی اور محسوس اجزاء ہوتے ہیں۔ یہ اس کے لیے ممکن نہیں کہ وہ اسے اس حد کے سوا کسی اور طرح مصور کرے۔ پس خیال نے عام اطلاق کو جمع کر دیا ہے جس کی کوئی مماثلت نہیں، کیونکہ اسے واجب، محال اور جائز میں عام تصرف حاصل ہے، اور وہاں کوئی نہیں جسے اس اطلاق کا حکم حاصل ہو۔ اور یہ ذات حق (الحق) کا معلومات میں اس قوت کے واسطے سے تصرف ہے۔ جیسا کہ اسے خاص محدود تقیید بھی حاصل ہے، پس وہ کسی بھی امر کو محسوس صورت کے سوا کسی اور صورت میں مصور نہیں کر سکتا، خواہ وہ محسوس صورت موجود ہو یا نہ ہو، لیکن متخیلہ صورت کے اجزاء کا جیسا کہ ہم نے ذکر کیا، محسوسات میں موجود ہونا ضروری ہے، یعنی اس نے انہیں حس سے لیا ہے جب اس نے انہیں متفرق طور پر ادراک کیا، لیکن مجموعہ وجود میں نہ ہو۔\n\n### [بے شک اللہ دنیا میں ہمیشہ دلوں پر متجلی (ظاہر) رہا ہے]\n\nاور جان لیجیے کہ ذات حق (الحق) دنیا میں ہمیشہ دلوں پر متجلی (متجليا) رہا ہے، پس انسان میں خواطر (خیالات) ظہور الٰہی (التجلي الإلهي) کی وجہ سے متنوع ہوتے ہیں، جس کا شعور صرف اہلِ اللہ کو ہوتا ہے۔ جیسا کہ وہ جانتے ہیں کہ دنیا اور آخرت میں تمام موجودات کی ظاہری صورتوں کا اختلاف صرف اُس (ذات حق) کا تنوع ہے، پس وہ ہی الظاہر ہے کیونکہ وہ ہر شے کی عین ہے۔ اور آخرت میں انسان کا باطن ثابت ہو گا، کیونکہ وہ دنیا میں اس کی صورت کے ظاہر کی عین ہے، اور اس میں تبدیلی پوشیدہ ہے، اور وہ ہر زمانے میں اس کی نئی تخلیق ہے جس میں وہ (لوگ) الجھن میں ہیں۔ اور آخرت میں اس کا ظاہر دنیا میں اس کے باطن جیسا ہو گا، اور ظہور الٰہی (التجلي الإلهي) اس کے لیے ہمیشہ بالفعل ہو گا، پس آخرت میں اس کا ظاہر متنوع ہو گا جیسا کہ دنیا میں اس کا باطن ان صورتوں میں متنوع ہوتا تھا جن میں ظہور الٰہی ہوتا ہے، پس وہ ان میں رنگ جاتا ہے۔ پس یہی خیالی مماثلت (التضاهي الإلهي الخيالي) ہے، مگر یہ آخرت میں ظاہر ہے اور دنیا میں باطن۔ پس خیال (الخيال) کا حکم انسان کے لیے آخرت میں اور ذات حق (الحق) کے لیے بھی جاری رہے گا۔ اور اسی کو اُس شأن (حال) سے تعبیر کیا گیا ہے جس میں ذات حق (الحق) ہے، جیسا کہ اُس کے قول: **كُلَّ يَوْمٍ هُوَ في شَأْنٍ** (ہر دن وہ ایک نئی شان میں ہے) میں بیان ہوا ہے۔ پس وہ ہمیشہ سے ہے اور ہمیشہ رہے گا۔ اور اسے خیال (الخيال) صرف اس لیے کہا گیا ہے کہ ہم جانتے ہیں کہ یہ دیکھنے والے کی طرف راجع ہے نہ کہ شے کی اپنی ذات کی طرف۔ پس شے اپنی ذات میں اپنی حقیقت پر ثابت ہے، تبدیل نہیں ہوتی، کیونکہ حقائق (الحقائق) تبدیل نہیں ہوتیں۔ اور دیکھنے والے کے لیے وہ متنوع صورتوں میں ظاہر ہوتی ہے، اور وہ تنوع بھی ایک حقیقت ہے جو اپنے تنوع پر تبدیل نہیں ہوتی، پس وہ ایک صورت پر ثبات کو قبول نہیں کرتی، بلکہ اس کی حقیقت ہی تنوع پر ثبات ہے۔ پس عالم میں ہر ظاہر ہونے والی شے ایک مثالی، کیانی صورت ہے جو ایک الٰہی صورت کے مماثل ہے، کیونکہ وہ عالم پر صرف اسی چیز کے ذریعے متجلی ہوتا ہے جو عالم کے ایک ثابت جوہر کی عین میں مناسب ہو۔ جیسا کہ انسان بھی اپنے جوہر کے لحاظ سے ثابت ہے۔ پس تم ثابت کو ثابت کے ذریعے دیکھتے ہو، اور وہ تم سے اور اُس سے غیب ہے۔ اور تم ظاہر کو ظاہر کے ذریعے دیکھتے ہو، اور وہ تم سے اور اُس سے مشہود، شاہد اور شہادت ہے۔ پس تم اسے اسی طرح ادراک کرتے ہو، اور تم ان دونوں کو بھی اسی طرح ادراک کرتے ہو، مگر تم ہر صورت میں پہچانے جاتے ہو کہ تم ہی ہو، کوئی اور نہیں۔ جیسا کہ تم جانتے ہو کہ زید اپنی کیفیات کے تنوع میں، خواہ وہ شرم، خوف، بیماری، صحت، رضا یا غضب ہو، اور ہر وہ حال جس میں وہ پلٹتا ہے، وہ زید ہی ہے، کوئی اور نہیں۔ معاملہ بھی ایسا ہی ہے۔ پس ہم کہتے ہیں کہ فلاں ایک حال سے دوسرے حال میں اور ایک صورت سے دوسری صورت میں بدل گیا۔ اور اگر معاملہ ایسا نہ ہوتا تو جب اس پر حال بدلتا تو ہم اسے نہ پہچانتے اور اس کے عدم کا حکم لگاتے۔ پس ہم نے جانا کہ وہاں دو عینیں ہیں، جیسا کہ اللہ تعالیٰ نے فرمایا: **أَ لَمْ نَجْعَلْ لَهُ عَيْنَيْنِ** (کیا ہم نے اس کے لیے دو آنکھیں نہیں بنائیں؟)۔ پس ایک عین وہ ہے جس سے وہ ادراک کرتا ہے جو تبدیل ہوتا ہے، اور ایک عین وہ ہے جس سے وہ تبدیلی کو ادراک کرتا ہے۔ اور یہ دو مختلف راستے ہیں جنہیں اللہ نے دو آنکھوں والے کے لیے واضح کر دیا ہے، اور یہ اس کا قول ہے: **وهَدَيْناهُ النَّجْدَيْنِ** (اور ہم نے اسے دو راستے دکھائے)۔ یعنی ہم نے اسے دو راستے بیان کر دیے، جیسا کہ شاعر نے کہا:\n\n> نجد (بلند راستہ) اس پر ہے کہ وہ ایک راستہ ہے\n> جسے ہرنوں کی آنکھیں کاٹتی ہیں۔\n\nپس اس نے راستے کا کاٹنا آنکھوں کے لیے قرار دیا، پس ہر آنکھ کا ایک راستہ ہے۔ پس جان لو کہ تم نے کسے دیکھا اور کیا دیکھا۔ اور اسی لیے یہ قول درست ہوا: **وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏** (اور جب تم نے پھینکا تو تم نے نہیں پھینکا، بلکہ اللہ نے پھینکا)۔\n\nپس وہ عین جس سے تم نے ادراک کیا کہ پھینکنا اللہ کی طرف سے ہے، وہ اس عین سے مختلف ہے جس سے تم نے ادراک کیا کہ پھینکنا محمد صَلَّى اللهُ عَليهِ وسَلَّم کے لیے ہے۔ پس اگر تم صاحبِ علم ہو تو جان لو کہ تمہاری دو آنکھیں ہیں۔ پس تم یقیناً جان لو کہ پھینکنے والا اللہ ہی ہے جو محمدی جسمانی صورت میں ہے۔ اور تمثل (مثال بننا) اور تخیل (تصور کرنا) اس کے سوا کچھ نہیں۔ پس اللہ نے تمہیں متنبہ کیا ہے اور تم متنبہ نہیں ہوتے۔ اور یہ وہ آیات ہیں جنہیں اللہ نے **لِقَوْمٍ يَعْقِلُونَ** (ان لوگوں کے لیے جو عقل رکھتے ہیں) جو اس سے عقل حاصل کرتے ہیں اور ان میں غور و فکر کرتے ہیں، اور یہ **ذِكْرَى لِمَنْ كانَ لَهُ قَلْبٌ** (نصیحت ہے اس کے لیے جس کے پاس دل ہو) جو پلٹتا ہے، پس اس نے جو کچھ کہا گیا اسے **أَلْقَى السَّمْعَ** (کان لگا کر سنا) اور اس کے ذریعے پہچانا، اور **وَهُوَ شَهِيدٌ** (اور وہ گواہ ہے) اپنے نفس میں اپنی تبدیلی پر، پس وہ جانتا ہے کہ معاملہ ایسا ہی ہے۔ اور یہی لوگ اولو الالباب (عقل والے) ہیں۔ کیونکہ گودا (لب) چھلکے کی صورت سے پردے میں رہتا ہے، پس گودے کو صرف وہی جانتا ہے جو جانتا ہے کہ وہاں گودا ہے۔ اگر ایسا نہ ہوتا تو وہ چھلکے کو نہ توڑتا۔ پس معاملہ گھل مل گیا ہے (امتزاج)، لیکن حقائق (الحقائق) آپس میں خلط نہیں ہوئیں۔ اور اسی سے فاضل اور مفضول میں تمیز ہوتی ہے۔ پس عالم اپنے علم سے اس میں لذت پاتا ہے، اور جاہل اپنے جہل سے اس میں لذت پاتا ہے، اور وہ نہیں جانتا کہ وہ اس سے جاہل ہے، کیونکہ وہ نہیں جانتا کہ جو امر اس کے علم کے خلاف ہے، وہ اس کے علم کے خلاف ہے۔ بلکہ وہ کہتا ہے کہ اس کے سوا کچھ نہیں۔ اور اگر وہ جانتا کہ اس کے علم اور ادراک کے خلاف بھی کچھ ہے تو وہ پریشان ہوتا، جیسا کہ دنیا میں ہر پریشان ہونے والا اس چیز کے فوت ہونے پر پریشان ہوتا ہے جو اس کے مقام کا تقاضا ہے، خواہ وہ تاجر اپنی تجارت میں ہو، یا فقیہ اپنے فقہ میں، اور ہر عالم اپنے دائرے میں۔ پس اس کے قول **كُلُّ حِزْبٍ بِما لَدَيْهِمْ فَرِحُونَ** (ہر گروہ اس پر خوش ہے جو ان کے پاس ہے) کی عمومیت کی تحقیق صرف آخرت میں ہے، دنیا کے برعکس۔ کیونکہ دنیا میں وہ نہیں جانتا، بلکہ یہ اکثر میں ہے، عمومیت کے ساتھ نہیں۔ کیونکہ انسان اپنے پاس موجود علم پر اس چیز کے بارے میں خوش نہیں ہوتا جس کا تصور اسے اس کے حصول سے پہلے ہوتا ہے، کیونکہ وہ اس کا منتظر ہوتا ہے، پس وہ تکلیف میں ہوتا ہے۔ اور جب وہ اسے حاصل کر لیتا ہے تب بھی وہ اس پر خوش نہیں ہوتا۔ اور آخرت میں، مواخذے کی مدت ختم ہونے کے بعد، سب اپنے پاس موجود چیز اور جس حال پر وہ ہیں، اس پر خوش ہوں گے۔ اور یہ مقام وہ مقام ہے جہاں اللہ نے آدم کو اپنی صورت پر پیدا کیا۔ اور جسے کسی امر کی صورت پر بنایا گیا، اور وہ امر اس صورت کی عین ہو، تو وہ وہی ہے، نہ کہ وہ۔ اور اسی سے یہ قول درست ہوا: **وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏** (اور جب تم نے پھینکا تو تم نے نہیں پھینکا، بلکہ اللہ نے پھینکا)۔ پس جو کچھ اس صورت سے ظاہر ہوتا ہے، اس کی اصل اس سے ہے جس پر وہ صورت ہے۔ پس اس کے لیے یہ درست نہیں کہ وہ ہر اس چیز سے باقی رہے جو اس سے ظاہر ہوتی ہے۔ اور اسی لیے یہ آیا: **وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ** (اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں) یعنی وہ جس پر سارا عالم ہے۔ اور اسی لیے ذات حق (الحق) نے اپنے رسولوں کی زبانوں پر اپنے آپ کو ان چیزوں سے بیان کیا جن سے پورے عالم کو بیان کیا، قدم بہ قدم، اس میں کوئی چیز نہ تو خراب ہوئی اور نہ ہی اس نے اسے چھوڑا۔\n\n> پس خلق کی عین اُس میں ذات حق (الحق) کی عین ہے،\n> پس انکار نہ کر، کیونکہ کائنات اُس کی عین ہے۔\n> اگر تو نے فرق کیا تو فرقان (جدائی) ظاہر ہے،\n> اور اگر نہیں، تو غور کر، کیونکہ جدائی ان دونوں کے درمیان ہے۔\n\nاور جب اس نے کہا کہ اس نے تجھے صورت پر بنایا ہے، تو اس نے جان لیا کہ تجھے اس چیز کی ملکیت کا دعویٰ کرنا ضروری ہے جس پر تو ہے، جیسا کہ وہ ملکیت والا ہے۔ اور تیرے لیے تیرے نفس سے زیادہ قریب کوئی ملکیت نہیں، اور وہی ملکیت کا دعویٰ کرتا ہے کیونکہ وہ اس کی صورت پر ہے جو ملکیت رکھتا ہے۔ پس اس نے اس کی طرف توجہ کی کہ وہ اس کے نام المؤمن (ایمان دینے والا) سے مومن ہے، پس اس نے مومن سے اس کا نفس خرید لیا۔ پس مومن دیگر حیوانات کی طرح بے نفس رہ گیا، پس کوئی باقی نہ رہا جو ملکیت کا دعویٰ کرے، پس ملکیت **لِلَّهِ الْواحِدِ الْقَهَّارِ** (اللہ واحد و قہار کے لیے) ہو گئی اور شراکت ختم ہو گئی۔ پس مومن کا کوئی نفس نہیں، پس اس کا ملکیت میں کوئی دعویٰ نہیں۔ پس ہر مومن جس نے حقیقت میں ملکیت کا دعویٰ کیا، وہ مومن نہیں، کیونکہ مومن وہ ہے جس نے اپنا نفس بیچ دیا، پس اس کے لیے کوئی باقی نہ رہا جو دعویٰ کرے، کیونکہ اس کا نفس دعویٰ کرنے والا تھا کیونکہ وہ اس کی صورت پر تھا جسے حقیقت میں ملکیت کا دعویٰ ہے، اور وہ اللہ تعالیٰ ہے۔ پس اے میرے بھائی! اپنے نفس کو اس دعوے سے بچا جو تجھ سے ایمان چھین لے۔ پس خبردار! تو اپنے اس نفس کی حمایت نہ کر جو تیرا تھا، اور اگر تو نے اس کی حمایت کا ارادہ کر لیا ہے تو اس کی حمایت حضور اور علم کے ساتھ کر، اس حیثیت سے کہ وہ ذات حق (الحق) کا نفس ہے نہ کہ تیرا نفس۔ اور وہاں سے تیرا رب تجھے جزا دے گا، کیونکہ تو سچا اور ایثار کرنے والا ہے۔ اور ایثار (دوسرے کو ترجیح دینا) کا درجہ تو جانتا ہے کہ اللہ کے نزدیک رفعت کا کیا تقاضا کرتا ہے۔ پس اس پر عمل کر۔ پس جب تم یہ جان لو،\n\n### [بے شک انسان کے دو رُخ ہیں: ایک اپنی ذات کی طرف اور ایک اپنے رب کی طرف]\n\nتو جان لو کہ انسان کے دو رُخ ہیں: ایک اپنی ذات کی طرف اور ایک اپنے رب کی طرف۔ اور تم جس رُخ کی طرف بھی متوجہ ہوتے ہو، دوسرے سے غائب ہو جاتے ہو۔ مگر یہاں ایک لطیف نکتہ ہے جس پر میں تمہیں متنبہ کرتا ہوں، اور وہ یہ ہے کہ جب تم اپنے رُخ کے مشاہدے کی طرف متوجہ ہوتے ہو تو اپنے رب ذوالجلال والاکرام کے رُخ سے غائب ہو جاتے ہو، اور تمہارا رُخ ہلاک ہونے والا ہے۔ پس جب تم اس کی طرف پلٹتے ہو تو تمہارا رُخ تم سے فنا (الفناء) ہو جاتا ہے، پس تم اس حضور (الحضرة) میں اجنبی بن جاتے ہو، اس میں وحشت محسوس کرتے ہو اور اپنے اس رُخ کو تلاش کرتے ہو جس سے تم مانوس تھے، لیکن اسے نہیں پاتے۔ اور اگر تم اپنے رب کے رُخ کی طرف متوجہ ہوتے ہو اور اپنے رُخ کو چھوڑ دیتے ہو، تو وہ تمہاری طرف متوجہ ہوتا ہے اور اس کے سوا تمہارا کوئی مونس نہیں ہوتا اور نہ ہی اس کے سوا کوئی مشہود (الشہود) ہوتا ہے۔ پس جب تم اس خاص پلٹاؤ کی طرف پلٹتے ہو جو ہر انسان کے لیے ضروری ہے، تو تم اسے پاتے ہو جو اس پلٹاؤ سے پہلے تمہارا مونس، ہم نشین اور ساتھی تھا، پس تم اس کی ملاقات سے خوش ہوتے ہو اور اُنس پہلے سے زیادہ ہو جاتا ہے، اور تم گزرے ہوئے اُنس کو یاد کرتے ہو، پس اُنس میں اضافہ ہوتا ہے۔ اور تم اس کے پاس اپنی ذات کا رُخ دیکھتے ہو اور اسے کھوتے نہیں، پس تم دونوں رُخوں کو ایک ہی صورت میں جمع کر لیتے ہو، پس رُخوں کے متحد ہونے سے اُنس متحد ہو جاتا ہے، پس خوشی اور مسرت بڑھ جاتی ہے۔ اور یہ ایک برزخی حالت ہے جو دو حالتوں کے درمیان ہے، کیونکہ اس نے دونوں کناروں کو جمع کر لیا ہے۔ پس جو دنیا میں ان دونوں کو جمع کرتا ہے، وہ آخرت میں اس سے محروم ہو جاتا ہے۔\n\nجیسے منافق (المنافق) جو مومن اور کافر کے درمیان برزخ ہے۔ پس جب وہ پلٹتا ہے تو دونوں کناروں میں سے ایک کی طرف نکل جاتا ہے، اور وہ کفر کا کنارہ ہے، اور ایمان کی طرف نہیں نکلتا۔ اگر وہ یہاں ایمان کی طرف نکل جاتا اور برزخ نہ ہوتا، تو جب وہ اللہ کی طرف پلٹتا تو جیسا کہ ہم نے ذکر کیا، وہ دونوں کناروں کو جمع کر لیتا۔ پس یہاں نفاق (النفاق) کی صفت سے بچو، کیونکہ یہ ہلاک کرنے والی ہے، اور آخرت کے بازار میں اس کا ایک نفاق ہے جس کا تقاضا وہ مقام کرتا ہے۔ اور منافق کو یہاں صرف ایک باریک امر کی وجہ سے پکڑا گیا ہے جس کا شعور بہت سے مومن علماء کو نہیں ہوتا۔ اور اللہ نے اس پر اسے متنبہ کیا ہے جو **أَلْقَى السَّمْعَ وَهُوَ شَهِيدٌ** (کان لگا کر سنتا ہے اور وہ گواہ ہے)۔ اور وہ یہ ہے کہ منافقین یہاں جب **إِذا لَقُوا الَّذِينَ آمَنُوا قالُوا آمَنَّا** (جب وہ ایمان والوں سے ملتے ہیں تو کہتے ہیں کہ ہم ایمان لائے)۔ اگر وہ یہ حقیقت میں کہتے تو کامیاب ہو جاتے۔ اور **وَإِذا خَلَوْا إِلى‏ شَياطِينِهِمْ قالُوا إِنَّا مَعَكُمْ** (اور جب وہ اپنے شیطانوں کے ساتھ تنہا ہوتے ہیں تو کہتے ہیں کہ ہم تمہارے ساتھ ہیں)۔ اگر وہ یہ کہتے اور خاموش رہتے تو ان پر واقع ہونے والی مذمت ان پر اثر نہ کرتی۔ لیکن انہوں نے مزید کہا: **إِنَّما نَحْنُ مُسْتَهْزِؤُنَ** (ہم تو صرف مذاق کرنے والے ہیں)۔ پس انہوں نے خود پر گواہی دی کہ وہ جھوٹے تھے۔ پس انہیں صرف اس چیز کی وجہ سے پکڑا گیا جس کا انہوں نے اقرار کیا، ورنہ اگر وہ نفاق کی صورت پر بغیر کسی اضافے کے باقی رہتے تو کامیاب ہو جاتے۔ کیا تم نہیں دیکھتے کہ جب اللہ نے ان کے مواخذے کے بارے میں خبر دی تو کیسے فرمایا: **الله يَسْتَهْزِئُ بِهِمْ** (اللہ ان سے مذاق کرتا ہے)۔ پس اس نے انہیں ان کے قول **إِنَّا مَعَكُمْ** کی وجہ سے نہیں پکڑا، بلکہ اس چیز کی وجہ سے پکڑا جو انہوں نے نفاق پر بڑھا دی، اور وہ ان کا قول **إِنَّما نَحْنُ مُسْتَهْزِؤُنَ** ہے۔ اور اللہ نے تمہیں اس جزا سے آگاہ نہیں کیا جو اس نے منافق کو دی، مگر اس لیے کہ تم جان لو کہ جسے پکڑا گیا، اسے کہاں سے پکڑا گیا، تاکہ تم ہلاکت کے مقامات سے بچو۔ اور نبی علیہ السلام نے فرمایا: \"لوگوں سے مدارات (نرمی برتنا) صدقہ ہے۔\"\n\nپس منافق دونوں فریقوں سے حقیقی مدارات کرتا ہے اور مدارات سے زیادہ نہیں کرتا، کیونکہ وہ زائد کا پھل کاٹتا ہے، خواہ وہ کچھ بھی ہو۔ پس غور کرو، میں نے تمہیں قرآن کے ایک عظیم راز پر متنبہ کیا ہے، اور وہ واضح ہے، اور اس کا واضح ہونا ہی اس کا پوشیدہ ہونا ہے۔ اور ہر منافق کی صورت میں دیکھو، تم اسے پاؤ گے کہ اسے صرف اس چیز کی وجہ سے پکڑا گیا جو اس نے نفاق پر بڑھا دی، اور اسی سے اس پر حجت قائم ہوئی۔ اور اگر ایسا نہ ہوتا تو وہ اصحابِ اعراف کے ساتھ اعراف پر حشر ہوتا اور اس کا حال اصحابِ اعراف کا ہوتا۔ **وَلَكِنْ لِيَقْضِيَ الله أَمْراً كانَ مَفْعُولًا** (لیکن تاکہ اللہ ایک ایسے امر کو پورا کرے جو ہو کر رہنا تھا)۔ پس مدارات کرنے والا مومن منافق ہے، اور وہ نجات پانے والا، خیر کا فاعل ہے۔ کیونکہ جب وہ دونوں رُخوں میں سے کسی ایک کے ساتھ تنہا ہوتا ہے تو اس کے لیے اس کے ساتھ اتحاد ظاہر کرتا ہے اور دوسرے رُخ کا ذکر نہیں کرتا جو اس کے ساتھ حاضر نہیں ہے۔ پس جب وہ دوسرے رُخ کی طرف پلٹتا ہے تو اس کے ساتھ بھی اسی طرح ہوتا ہے، اور دونوں حالتوں میں باطن اللہ کے ساتھ ہوتا ہے، کیونکہ مقام الٰہی کی یہی صورت ہے، پس وہ اپنے بندوں کے لیے دونوں صورتوں میں ہے، پس اس نے اپنے آپ کو تنزیہ (پاک) بھی کیا اور تشبیہ (مشابہت) بھی دی۔ پس کامل مومن اسی طرح ہوتا ہے، اور یہی عین کمال ہے۔ پس اس چیز سے بچو جو میں نے تمہیں بتائی ہے اس پر اضافہ کرنے سے، اور اللہ کے اخلاق سے متخلق ہو جاؤ۔ اور اللہ تعالیٰ نے اپنے نبی صَلَّى اللهُ عَليهِ وسَلَّم پر احسان جتاتے ہوئے فرمایا: **فَبِما رَحْمَةٍ من الله لِنْتَ لَهُمْ** (پس اللہ کی رحمت کے سبب تم ان کے لیے نرم ہو گئے)۔ اور نرمی جناح جھکانا، مدارات اور سیاست ہے۔ کیا تم نہیں دیکھتے کہ ذات حق (الحق) کافر کو اس کے کفر پر رزق دیتا ہے اور اس کے مواخذے میں مہلت دیتا ہے؟ اور اس نے موسیٰ اور ہارون علیہما السلام سے فرعون کے حق میں فرمایا: **فَقُولا لَهُ قَوْلًا لَيِّناً** (پس تم دونوں اس سے نرم بات کہو)۔ اور یہ عین مدارات ہے، کیونکہ وہ اس میں یہ تصور کرتا ہے کہ تم اس کے ساتھ ہو۔ اور جب میں نے اس مقام کو چکھا اور اس کے ساتھ متحد ہوا، تو میرے لیے یہ اتفاق ہوا کہ میں نے بادشاہوں اور سلاطین کی صحبت اختیار کی، اور میں نے ان میں سے کسی کے پاس بھی اللہ کی مخلوق میں سے کسی کی کوئی حاجت پوری نہیں کی مگر اسی مقام سے۔ اور کسی بھی بادشاہ نے اس حاجت میں اضافہ نہیں کیا جو میں نے اللہ کی مخلوق میں سے کسی کے لیے اس سے طلب کی۔ اور وہ یہ تھا کہ جب میں اس کے پاس کسی کی حاجت پوری کرانا چاہتا تھا، تو میں اس کے لیے ایک بساط بچھاتا تھا جس میں میں اسے اس طرح کھینچتا تھا کہ بادشاہ خود ہی اس حاجت کو پورا کرنے کا سوال کرتا اور طلب کرتا، فوراً، خوش دلی سے اور حرص کے ساتھ، کیونکہ وہ اس میں اپنے لیے فائدہ دیکھتا تھا۔ پس میں سلطان کی حاجت پوری کرتا تھا کہ میں اس انسان کی حاجت پوری کرنے کو اس سے قبول کر لیتا تھا۔ اور میں نے ملک الظاہر بأمر اللہ، حلب کے حاکم سے بہت سی حاجتوں کے بارے میں بات کی، تو اس نے ایک ہی دن میں میرے لیے لوگوں کی ایک سو اٹھارہ حاجتیں پوری کیں۔ اور اگر اس دن میرے پاس اس سے زیادہ ہوتیں تو وہ خوش دلی سے اور رغبت کے ساتھ پوری کر دیتا۔ اور جب انسان کو یہ قوت حاصل ہو جاتی ہے تو لوگ بادشاہوں کے پاس اس سے فائدہ اٹھاتے ہیں۔ پس عالم میں کوئی امر مطلقاً مذموم نہیں اور نہ ہی مطلقاً محمود، کیونکہ رُخ اور حالات کی قرائن اسے مقید کرتے ہیں۔ کیونکہ اصل تقیید (محدودیت) ہے، نہ کہ اطلاق (آزادی)۔ کیونکہ وجود (الوجود) بالضرورت مقید ہے۔ اور اسی لیے دلیل اس بات پر دلالت کرتی ہے کہ ہر وہ چیز جو وجود میں داخل ہوئی ہے، وہ متناہی (محدود) ہے۔ پس صحیح اطلاق (آزادی) صرف اس کے لیے ہے جس کی قوت میں ہو کہ وہ ہر صورت سے مقید ہو جائے اور اس تقیید سے اس پر کوئی نقصان نہ آئے، اور یہ صرف اس کے لیے ہے جو مدارات سے متحقق ہو، اور وہ \"اِمَّعَہ\" (ہر ایک کے ساتھ ہو جانے والا) ہے۔ اور اللہ عزوجل فرماتا ہے: **وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ** (اور وہ تمہارے ساتھ ہے جہاں کہیں تم ہو)۔ پس یہ اشرف ترین حالت ہے اس کے لیے جو اس کا میزان جانتا ہے اور اس سے متحقق ہوتا ہے، اور وہ ایک ہے، اور وہ ایک کہاں ہے؟\n\n> خبردار! نفاق (النفاق) ہی نفاق ہے،\n> اگر تو متحقق ہو جائے تو مساق (راستہ) اسی کی طرف ہے۔\n> پس تو اس میں ہو جا، تو ذات حق (الحق) کے ساتھ خالص ہو جائے گا،\n> اور تو اس کی تعریف کرے گا جب وہ بندھن کو مضبوط کر دے۔\n> جب تو کسی شے کا معتمد (بھروسہ کرنے والا) ہو،\n> تو اگر تو غور کرے تو تو ہی اس کا ساق (ستون) ہے۔\n> اس عماد (ستون) پر جو ہم سے غائب ہو گیا،\n> جب تو طباق (مطابقت) پر بھروسہ کرے۔\n> پس تو وہ عماد بن جا، تو امام بن جائے گا،\n> پس تیرے پاس دینِ وفاق (مطابقت) ظاہر ہو گا۔\n\nپس قرآن میں غور و فکر کر، اس کے فرقان (جدائی) اور قرآن (جمع) ہونے کے لحاظ سے۔ پس قرآن کے لیے ایک مقام ہے اور فرقان کے لیے ایک مقام ہے۔ پس ہر مقام پر اس کے استحقاق کے ساتھ کھڑا ہو جا، تو مقامات تیری تعریف کریں گے، اور مقامات اللہ کے نزدیک عادل گواہ ہیں، کیونکہ وہ صرف سچائی کی گواہی دیتے ہیں۔ اور میں نے تمہیں نصیحت کی ہے، پس عمل کرو، اور اللہ ہی توفیق دینے والا ہے۔ ہم نے کہا: اور اس مقام میں علوم میں سے ایک باریک، پوشیدہ علم ہے جس کا شعور اس کے پوشیدہ ہونے کے باوجود اس کے ظاہر ہونے کی وجہ سے نہیں ہوتا۔ کیونکہ اللہ کے علماء نے رحمت کے شمول کو جان لیا ہے، اور مومنوں نے اس کی وسعت کو جان لیا ہے۔ پھر وہ اسے شمول اور وسعت کے ساتھ دیکھتے ہیں کہ بعض مقامات پر اس کی کوئی صورت نہیں ہوتی۔ اور اس کے باوجود کہ بعض مقامات پر اس کی کوئی ظاہری صورت نہیں ہوتی، اس مقام میں حکم اسی کا ہوتا ہے، اور اس کا حکم اس کے وجود کے بغیر نہیں ہو سکتا، لیکن وہ اپنے بطون (پوشیدگی) کی وجہ سے پوشیدہ ہے اور اپنے حکم کے ظاہر ہونے کی وجہ سے جلی (ظاہر) ہے۔ اور یہ اکثر طب کے فن اور حدود قائم کرنے میں ظاہر ہوتا ہے۔ پس اللہ زانی اور زانیہ کی حد قائم کرنے میں فرماتا ہے: **وَلا تَأْخُذْكُمْ بِهِما رَأْفَةٌ في دِينِ الله** (اور تمہیں اللہ کے دین میں ان دونوں پر ذرا بھی رحم نہ آئے)۔ پس یہ ان سے رحمت کے چھین لیے جانے کی عین ہے، حالانکہ حدود قائم کرنا رحمت کے حکم میں سے ہے اور اس کی کوئی ظاہری عین نہیں ہے۔ اور جیسے طب، جب طبیب سڑنے والے عضو والے شخص کا پاؤں کاٹتا ہے، پس اگر وہ اس مقام پر اس پر رحم کرتا اور اس کا پاؤں نہ کاٹتا تو وہ ہلاک ہو جاتا۔ پس رحمت کا حکم اس کے پاؤں کاٹنے کا حکم دیتا ہے اور اس کی کوئی عین نہیں ہے۔ پس رحمت کے لیے ایک مقام ہے جہاں وہ اپنی صورت میں ظاہر ہوتی ہے، اور اس کے لیے ایک مقام ہے جہاں وہ اپنے حکم میں ظاہر ہوتی ہے، پس یہ تصور کیا جاتا ہے کہ وہ اس جگہ سے چھین لی گئی ہے، حالانکہ ایسا نہیں ہے۔ اور شرعی احکام میں اس مسئلے میں پوشیدگی ہے، سوائے اس کے جس کی بصیرت کو اللہ نے منور کر دیا ہو۔ کیونکہ ظالم قاتل کے دل سے اللہ نے مقتول کے حق میں رحمت چھین لی ہے، اور وہ اپنے ظلم سے قتل کرنے میں رحمت کے حکم کے تحت ہے، اور اس کا حکم قاتل میں باقی رہا۔ پس یا تو اس سے قصاص لیا جائے گا، یا وہ مر جائے گا اور مشیت میں ہو گا، اور اگر قاتل کافر ہو، تو یا وہ اسلام قبول کرے گا، پس اس میں رحمت اپنی صورت میں ظاہر ہو گی، اور جہاں رحمت صورت کے ساتھ ہو گی، وہاں حکم کے ساتھ بھی ہو گی، اور کبھی حکم کے ساتھ ہوتی ہے اور صورت کے ساتھ نہیں ہوتی۔ اور اس میں ایک عجیب علم ہے، اور وہ ذات حق (الحق) کو کائنات کے اس سے چھین لیے جانے کے ساتھ مقید کرنے کا علم ہے، باوجود اس کے کہ وہ اس کی گرفت میں، اس کے تسلط اور اس کی ملکیت کے تحت ہے۔ اور اس میں اللہ کی طرف دعوت دینے میں سیاست کا علم ہے، کیونکہ داعی کی صورت مدعو کی صورت کے اختلاف سے مختلف ہوتی ہے۔ پس وہاں سختی اور قہر کی صفت کے ساتھ دعوت ہے، اور وہاں نرمی اور شفقت کی صفت کے ساتھ دعوت ہے۔ اور اس میں اس الٰہی عہد کے عموم کا علم ہے جو اس نے بنی آدم سے لیا تھا۔ اور اس میں ملکوت (الملکوت) میں حس، خیال (الخيال) اور عقل کے ذریعے جولان (گھومنے) کا علم ہے، جو الٰہی نشأت کے ایک تہائی حصے سے ہے۔ کیونکہ جب انسانی نشأت اخلاط (مزاجوں) کے امتزاج سے پیدا کی گئی تو وہ سال کے موسموں سے مشابہت رکھتی تھی، اور زمانے کا کمال سال کے موسموں کے بغیر نہیں ہوتا، پھر دور لوٹ آتا ہے۔ پس انسان اپنے اخلاط کے لحاظ سے سال ہے، پس وہ عین دہر (الدهر) ہے جو کہ زمانہ ہے۔ پس اسے ملکوت میں تین چیزوں میں سے کسی ایک کے ذریعے یا ان سب کے ذریعے یا ان میں سے بعض کے ذریعے جولان حاصل ہے: یا تو وہ اپنی حس کے ذریعے جولان کرے، اور وہ کشف (الکشف) ہے، یا اپنی عقل کے ذریعے جولان کرے، اور وہ اس کے فکر اور تفکر کی حالت ہے، یا اپنے خیال (الخيال) کے ذریعے جولان کرے۔ اور سال بارہ مہینوں کا ہوتا ہے، پس اس نشأت کے ہر حقیقت کے لیے جو سال سے مشابہت رکھتی ہے، سال کا ایک تہائی حصہ ہے۔ پس اس کے لیے تثلیث (تین حصوں میں تقسیم) میں تربيع (چار حصوں میں تقسیم) ہے اور اس کے لیے تثلیث میں تربيع ہے۔ پس اس کا تثلیث میں تربيع وہ ہے جو ہم نے ذکر کیا کہ اسے تین حصوں میں تقسیم کیا گیا ہے: حس، خیال اور عقل، اس کے اخلاط کے تربيع میں۔ اور اس کا تثلیث میں تربيع یہ ہے کہ اخلاط کا حکم اپنی مکمل حالت میں تینوں اقسام میں سے ہر قسم میں ہے، اور وہ چار ہیں۔ پس اس کے تربيع کا حکم حس میں ہے، اور حکم خیال میں ہے، اور حکم عقل میں ہے۔ اور اس کا شعور صرف اہلِ حضور کو ہوتا ہے جو اپنی ذات میں آیات کو دیکھتے ہیں۔ اور اس میں اللہ کے ساتھ مقابلہ کرنے میں انسان کی جہالت کا علم ہے، اور ہماری دلیل اللہ تعالیٰ کا یہ قول ہے: \"میرے بندے نے اپنے نفس کے ذریعے مجھ پر سبقت لے جانے کی کوشش کی\" اس شخص کے بارے میں جس نے خود کو قتل کیا۔\n\nاور اس سیاق میں قول اہلِ نظر کا قول ہے جو طاقت بھر اللہ سے مشابہت اختیار کرنے میں ہے، اور یہ کہ جب یہ پایا جائے تو یہی کمال ہے۔ اور یہ ہمارے نزدیک عین جہالت ہے کہ وہ ذات حق (الحق) پر اس چیز میں سبقت لے جانے کی کوشش کرے جو اس کے لیے ہے، اس چیز کے ذریعے جو میرے لیے ہے۔ کیونکہ یہ محال ہے کہ تم اس پر اس چیز میں سبقت لے جاؤ جو اس کے لیے ہے، کیونکہ شے خود پر سبقت نہیں لے جاتی۔ اور یہ محال ہے کہ تم اس پر اس چیز میں سبقت لے جاؤ جو میرے لیے ہے، کیونکہ وہاں کوئی غایت نہیں جس کی طرف سبقت لے جائی جائے، پس یہ غیر کارآمد جگہ میں عمل ہو گا اور غیر مطلوب جگہ میں طمع ہو گی۔ اور جو اس حال میں ہو، اگر وہ اپنی عقل سے کام لے تو اس کی جہالت میں کوئی پوشیدگی نہیں۔ اور اس میں الٰہی اعلام (خبر دینے) کا علم ہے الٰہی مادے میں کہ کیا ہو گا اور کیا واقع ہو گا، سننے والوں کے کانوں میں اس اعلام سے کیا واقع ہوتا ہے؟ کیا یہ ہر کان میں ایک ہی حد پر واقع ہوتا ہے یا اس اعلام کے وقت سمع کا تعلق مختلف ہوتا ہے؟ اور اس میں مخلوق کے ساتھ ان کی مختلف اقسام کے مطابق اس طرح معاملہ کرنے کا علم ہے جو انہیں تم سے خوش کرے، نہ کہ جو انہیں ناخوش کرے۔ اور یہ ایک عزیز علم ہے، جس کا حصول مشکل ہے، اور وزن میں باریک ہے، میزان میں نامعلوم ہے، اس کے صاحب کو کشف (الکشف) کی ضرورت ہوتی ہے، تب ہی اسے حاصل ہوتا ہے۔ اور اس میں اس علم کا علم ہے کہ جب اصحابِ اجل کی اجل ختم ہو جاتی ہے تو کیا انہیں اس انتہا کے بعد ایک مقررہ مدت تک مؤخر کیا جاتا ہے یا ان کے لیے بھی کوئی اجل نہیں ہوتی جس پر وہ ختم ہوں؟ اور اس میں اس علم کا علم ہے کہ شرائط میں سے کیا درست ہو سکتا ہے اور کیا درست نہیں ہو سکتا۔ اور اس میں امان دینے کا علم ہے اور کسے دینا چاہیے، پس اس اختیار رکھنے والے کے لیے احوال کا علم ضروری ہے۔ اور اس میں لوگوں کے اخلاق میں تنوع کا علم ہے، اور ان میں سے کیا محمود ہے اور کیا مذموم ہے۔ اور اس میں اللہ کے بارے میں فرشتوں کے علم کا علم ہے، جسے کوئی بشر نہیں جانتا جب تک کہ وہ اپنی بشریت سے مجرد نہ ہو جائے اور اپنی نشأت کے لحاظ سے طبیعت کے حکم سے مجرد نہ ہو جائے، یہاں تک کہ وہ صرف پھونکی گئی روح کے ساتھ باقی رہے۔ تب وہ اللہ کے بارے میں اس علم کی طرف نکل جاتا ہے جس طرح فرشتے اسے جانتے ہیں، پس وہ اپنے رب کی عبادت میں فرشتوں کے مقام پر کھڑا ہوتا ہے، اور یہ اس شخص کی علامت ہے جو یہ دعویٰ کرتا ہے کہ وہ اللہ کو اس صورت میں جانتا ہے جس طرح فرشتے اسے جانتے ہیں۔ پس جو اس علامت کے بغیر یہ دعویٰ کرے، اس کا دعویٰ جھوٹ اور بہتان ہے، کیونکہ فرشتوں کے لیے اللہ کے بارے میں ایک عام علم ہے جو صنف کو شامل ہے، اور ایک خالص علم ہر فرشتے کے لیے اللہ کے بارے میں ہے جو دوسرے کو نہیں ہوتا۔ پس ہم اس کے دعوے میں صرف عام علم کا مطالبہ کرتے ہیں۔ اور یہ علامت ہمارے نزدیک ذوقاً معلوم ہے، ہم اسے کسی کے سامنے ذکر نہیں کرتے تاکہ وہ کسی وقت اس کے ذریعے ظاہر نہ ہو جائے جبکہ وہ اپنے دعوے میں جھوٹا اور غیر متحقق ہو۔ اسی لیے ہمیں اور ہمارے جیسے لوگوں کو اس اور اس جیسے امور کو چھپانے کا حکم دیا گیا ہے۔ اور اس میں اللہ کے علماء کی ان کے طبقات کے مطابق دلالتوں کا علم ہے، کیونکہ وہ اللہ کے علم میں طبقات پر ہیں۔ اور اس میں علتوں اور نفوس کی بیماریوں کو دور کرنے کا علم ہے۔ اور اس میں اللہ کے حضور داخل ہونے کے آداب کا علم ہے۔ اور اس میں ان لوگوں کی صفات کا علم ہے جو یہ دعویٰ کرتے ہیں کہ وہ اللہ کے ہم نشین ہیں، شہود (الشہود) کے بیٹھنے کے لحاظ سے نہ کہ ذکر کے بیٹھنے کے لحاظ سے، کیونکہ ذکر کرنے والے بھی اللہ کے ہم نشین ہیں، اور وہ حقیقت میں اللہ کے ہم نشین ہیں اس اسم کے لحاظ سے جس کے ذریعے وہ اسے یاد کرتے ہیں۔ اور یہ ایک ایسا مسئلہ ہے جسے بہت سے لوگ نہیں جانتے۔ اور اس میں رضا کی رحمت اور فضل کی رحمت کیا دیتی ہے، اور انواعِ رحموت (رحمتوں) کا علم ہے۔ اور اس میں نعمت کے قیام کا علم ہے، کیا اس نعمت کو دوام حاصل ہے یا اس میں ایک ایسی حالت داخل ہوتی ہے جس میں نہ نعمت ہو اور نہ کچھ اور؟ اور اس میں اللہ عزوجل کے ہاں اجروں کی تفصیلات کا علم ہے اور وہ کس چیز سے ممتاز ہوتے ہیں۔ اور اس میں الٰہی محبت کا علم ہے جو ہر محبت میں شامل ہے، اور اس شخص کا مقام کیا ہے جس نے اس کا مشاہدہ کیا اور اسے جانا، اور کیا وہ شخص جو اس کا علم نہیں رکھتا، اس عالم کے برابر ہے یا نہیں؟ اور اس میں معتمدات (بھروسہ کی جانے والی چیزوں) کا علم ہے اور ان میں سے کیا واجب ہے اور کیا واجب نہیں۔ اور اس میں سکائن (سکینہ کی جمع) کا علم ہے، کیا انہیں کوئی ایک امر جمع کرتا ہے جیسے انسانوں میں انسانیت، یا وہ متنوع ہیں، ہر سکینہ ایک قسم کی ہے جو دوسری سکینہ کی عین نہیں ہے؟ اور اس میں الٰہی رجوع کے تنوع کا علم ہے جو مرجوع الیہ (جس کی طرف رجوع کیا گیا) کے حال کے تنوع کی وجہ سے ہے۔ اور اس میں اللہ کے ساتھ غنی ہونے میں اللہ کے ساتھ غنی لوگوں کے درجات کا علم ہے، اس کی شان بلند ہے۔ اور اس میں اس سبب کا علم ہے جو طبیعت کو خبیث اور ناپاک ہونے پر مجبور کرتا ہے، اور وہ کیا ہے جو اس سے ہوتا ہے اور وہ اس کی عین ہے؟ اور کیا الٰہی علم میں اس کی کوئی اصل ہے جس کی طرف وہ لوٹے، جیسے بندوں کے مذموم افعال اور اخلاق کی پستی، اس علم کے ساتھ کہ وہ ان صورتوں میں سے ایک صورت ہے جو مجلی (ظہور کی جگہ) ہوتی ہے؟ اور اس میں الٰہی علوم میں سے بعض الٰہی نسبتوں کو بعض پر فضیلت دینے کا علم ہے، اور عالم کا بعض کو بعض پر بلند کرنا اسی اصل سے پیدا ہوتا ہے، کیونکہ یہ محال ہے کہ عالم میں کوئی ایسی شے ہو جس کا کوئی مستند کسی الٰہی امر کی طرف نہ ہو جو ذات حق (الحق) کی صفت ہو، خواہ وہ کچھ بھی ہو۔ اور اس میں اس علم کا علم ہے کہ کیا چیز اللہ کی طرف منسوب کرنی چاہیے اور کیا منسوب نہیں کرنی چاہیے۔ اور اس میں عالم میں ربوبیت کے سرایت کرنے کا علم ہے، یہاں تک کہ جس نے اللہ کے سوا کسی اور کی عبادت کی، اس نے بھی کی۔ اور اس میں اس علم کا علم ہے کہ علوم میں سے کیا ذخیرہ کرنا چاہیے اور کیا فاش نہیں کرنا چاہیے، اور کیا ذخیرہ نہیں کرنا چاہیے اور کیا فاش کرنا چاہیے۔ اور اس میں اس علم کا علم ہے کہ اللہ نے زمانے میں سے اس کی گھڑیوں، دنوں، راتوں اور مہینوں میں سے کیا چنا ہے، اور یہ زمانے کی اپنی ذات میں فضیلت کا علم ہے، اور دہر (الدهر) کی اصل کیا ہے، اور اللہ کے دہر کے نام سے نامزد ہونے کا سبب کیا ہے، جبکہ یہ اس کا ازلی نام ہے اور کوئی دہر نہیں؟ اور کیا زمانے کو اس نام کی وجہ سے دہر کہا گیا، یا اللہ نے اس نام سے نامزد کیا کیونکہ وہ جانتا تھا کہ وہ ایک ایسی چیز پیدا کرے گا جسے دہر کہا جائے گا؟ کیونکہ وہ ہمیشہ سے خالق ہے اور ہمیشہ خالق رہے گا۔ اور کیا عالم میں زمانے کا حکم ختم ہو جائے گا یا ختم نہیں ہو گا؟ اور زمانے میں افلاک کی حرکتوں کا حصہ کیا ہے؟ اور اس میں اس شخص کا علم ہے جسے اس کی سعادت کی طرف بلایا گیا، لیکن اس نے جواب دینے میں سستی کی، باوجود اس کے کہ وہ جانتا تھا کہ اسے حق کی طرف بلایا گیا ہے۔ اور اس میں الٰہی نصرت کے اسباب کا علم ہے۔ اور اس میں ذات حق (الحق) کی محبت کا علم ہے۔ اور اس میں اس سبب کا علم ہے جو مباہت (مخالفت) کی طرف بلاتا ہے، باوجود اس کے کہ وہ جانتا ہے کہ وہ مباہت کر رہا ہے، اور وہ جانتا ہے کہ وہ اس کے بارے میں مسئول ہے، اور غلبہ قوی کے لیے ہے، اور ذات حق (الحق) کے لیے قوت ہے، اور خواہش اس سے مقابلہ کرتی ہے، اور کبھی اس پر غالب آ جاتی ہے، تو کیا اس کا غلبہ اس وجہ سے ہے کہ اس کا حق میں کوئی حصہ ہے؟ پس حق پر حق کے سوا کوئی غالب نہیں آتا۔ اور اس میں امام کا اپنے اصحاب کو آزمائش میں ڈالنے کا علم ہے تاکہ ان پر حجت قائم کرے، اس سے کوئی علم حاصل نہیں کرتا۔ اور اس میں اس علم کا علم ہے کہ ہر حال میں کیا کہا جائے جس میں بندہ پلٹتا ہے یا بندہ اس میں پلٹتا ہے۔ اور اس میں ہلاک کرنے والے دائروں کا علم ہے کہ وہ کیا ہیں اور ان کے اسباب کیا ہیں جو کائنات میں ان کے اثرات کو واجب کرتے ہیں۔ اور اس میں اس سبب کا علم ہے جو خالص عمل کو قبول کرنے سے روکتا ہے، یہاں تک کہ عمل کرنے والا غیر کارآمد جگہ میں عمل کرتا ہے۔ اور اس میں بندوں پر نعمتوں کی تقسیم کا علم ہے، اور وہ بندوں کے ہاتھوں میں ہیں، اور انہیں ان میں سے صرف ذخیرہ اندوزی حاصل ہے، اور وہ ان کے بارے میں مسئول ہیں۔ اور اس میں ہر کہنے والے کی بات سننے کا علم ہے، اور اس کا کیا فائدہ ہے اگر وہ سننے والے پر اثر انداز نہ ہو؟ پس اگر وہ سنی ہوئی چیز سے جلد متاثر ہونے والا ہو، تو اس پر عقلی طور پر واجب ہے کہ وہ شر کہنے والے کی بات نہ سنے۔ اور اس میں فرقوں کے نزدیک اللہ کے ناموں کے اختلاف کا علم ہے جبکہ مقصود ایک ہے۔ اور اس میں ایک ہی نوع کے افراد کے درمیان دشمنی اور انواع کے درمیان دوستی کا سبب کیا ہے، حالانکہ ان سب کو ایک ہی جنس شامل ہے؟ اور اس میں تقدیر (القدر) کا علم ہے اور الٰہی صفت میں اس کا مستند کیا ہے، اور کیا یہ عین استدراج (تدریجی پکڑ) ہے یا اس کے علاوہ؟ اور اس میں الٰہی طرد (دھتکارنے) کے اسباب کا علم ہے، حالانکہ سب اس کی گرفت میں ہیں، پس طرد کس سے ہو گا اور کہاں تک؟ اور ان کے قول \"اللہ سے دوری\" کا کیا معنی ہے؟ اور اس میں منازل کو قالبوں میں اتارنے کا علم ہے، کس معنی کے لیے وہ صورتوں میں اترتی ہیں اور معانی کے طور پر نہیں اترتیں جیسا کہ وہ نفس الامر میں ہیں۔ اور اس میں اس شخص کے حق میں حرج (تنگی) کو اٹھانے کے اسباب کا علم ہے جس سے وہ اٹھا لیا گیا ہے، کیونکہ عالم سے اس کا اٹھانا محال ہے، کیونکہ اگر وہ اٹھا لیا جاتا تو عالم کمال کے درجے سے زائل ہو جاتا، حالانکہ وہ مرتبے کے لحاظ سے کامل ہے، اگرچہ انواع کے افراد کے ذریعے زیادتی قبول کرتا ہے، پس وہ اس کی وجہ سے نقص سے متصف نہیں ہوتا۔ اور اس میں اس علم کا علم ہے کہ جب ایمان کی پختہ قسمیں کھائی جائیں اور صاحبِ قسم امر کی صورت میں حانث ہو جائے تو کیا چیز کفر نہیں بنتی، اور یہ ایک ایسا مسئلہ ہے جس کا فقہاء انکار کرتے ہیں اور اس کے خلاف فتویٰ دیتے ہیں۔ اور اس میں اس علم کا علم ہے کہ اخلاق کی مذمتوں میں سے کیا شمار ہوتا ہے جبکہ وہ اللہ کے نزدیک اس کی مکرمات (عمدہ صفات) میں سے ہے۔ اور اس میں ذات حق (الحق) کا اپنے مقرب بندے کی مخالفت کا علم ہے اس چیز میں جو وہ اس سے چاہتا ہے، جیسے اللہ تعالیٰ کا قول: **إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرْ الله لَهُمْ** (اگر تم ان کے لیے ستر بار بھی مغفرت طلب کرو گے تو اللہ انہیں ہرگز نہیں بخشے گا) اور اس کی مثالیں۔ اور اس میں اس شخص کے حکم کا علم ہے جو جماعت سے نکل گیا یا امام کی بیعت کے پختہ ہونے کے بعد اس کی اطاعت سے ہاتھ کھینچ لیا۔ اور اس میں سابق (آگے بڑھنے والے) اور لاحق (پیچھے آنے والے) کا علم ہے۔ اور اس میں شر اور خیر کا علم ہے اور ایمان کے حکم کا علم ہے۔ اور اس میں جزوی نفوس کا علم ہے۔ اور اس میں مقربین کی صفات کا علم ہے۔ اور اس میں گمراہی اور ہدایت کا علم ہے۔ اور اس میں واحد کو جمع کے مقام پر قائم کرنے کا علم ہے، اور **وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب سیصد و هفتاد و پنجم» در معرفت منزل همانندی خیالی (التضاهي الخيالي) و عالم حقایق (الحقائق) و امتزاج.\n\nو این از حضرت محمدیه (الحضرة المحمدية) است:\n> چگونه بیزاری جویم در حالی که در هستی (الكون) جز او نیست؟ *** پس هر هستی‌ای که می‌بینم، تو معنای آنی.\n>\n> و او (پیامبر) در شریعت خود بیزاری (از غیر حق) آورد *** پس شریعتی که عقل آن را دوست می‌داشت، عقل را حیران ساخت.\n>\n> او را به خود نزدیک کرد در حالی که هیچ ذاتی با او مغایرت نداشت *** پس کسی که نزدیک شد، سپس بعد از قرب او را دور ساخت.\n>\n> خداوند مولای همه خلق است *** و هرگز کسی که خداوند مولای اوست، ناامید نمی‌شود.\n\n### [خیال (الخيال) از موالی نفس ناطقه (النفس الناطقة)]\n\nبدان، خداوند تو را یاری کند، که رسول خدا (صلی الله علیه و سلم) فرمود: «مولای قوم از خودشان است.» (مولى القوم منهم)\n\nو خیال (الخيال) از موالی نفس ناطقه (النفس الناطقة) است. پس خیال برای نفس ناطقه به منزله مولا برای سَرور است. و مولا به دلیل مالکیت، نوعی از انواع تسلط را بر سَرور دارد، زیرا با او و امثال او از موالی است که سَرور بودنِ مالک و مَلِک صحیح می‌شود. چون این منزلت برای سَرور جز به واسطه مولا صحیح نمی‌شود، از این رو مولا دستی دارد که به او مقداری تسلط بر سَرور می‌دهد. و تسلطی که خیال بر نفس دارد، تنها این است که نفس را در هر صورتی که بخواهد، تصویر می‌کند. اگرچه نفس در ذات خود بر صورتی است، اما این خیال آن را نزد متخیّل جز بر حسب آنچه از صور در تخیل خود می‌خواهد، رها نمی‌کند.\n\nو خیال قدرتی ندارد که آن را از درجه محسوسات خارج سازد، زیرا تولد و ظهور ذات آن جز از حس نبوده است. پس هر تصرفی که در معدومات و موجودات، و در آنچه در هستی (الوجود) عین دارد یا عین ندارد، انجام می‌دهد، آن را در صورتی محسوس تصویر می‌کند که آن صورت در هستی عین دارد، یا صورتی را تصویر می‌کند که مجموعاً در هستی عین ندارد، اما اجزای آن صورت، همگی اجزای وجودی محسوس هستند. خیال نمی‌تواند آن را جز بر این حد تصویر کند.\n\nپس خیال میان اطلاق عامی که هیچ اطلاقی شبیه آن نیست، جمع کرده است؛ زیرا تصرف عام در واجب و محال و جایز دارد، و هیچ کس دیگری حکم این اطلاق را ندارد. و این همان تصرف حق (الحق) در معلومات است به واسطه این قوه.\n\nهمان‌طور که برای خیال، تقیید خاص و محصور نیز وجود دارد؛ پس نمی‌تواند هیچ امری را تصویر کند مگر در صورتی حسی که آن صورت محسوس موجود بوده باشد یا نبوده باشد، اما اجزای صورت متخیّل باید همگی، همان‌طور که ذکر کردیم، در محسوسات موجود باشند؛ یعنی آن‌ها را از حس گرفته است در حالی که آن‌ها را متفرق درک کرده است، اما ممکن است مجموع آن در هستی (الوجود) نباشد.\n\n### [اینکه خداوند همواره در دنیا بر قلب‌ها متجلی (متجليا) بوده است]\n\nو بدان که حق (الحق) همواره در دنیا پیوسته بر قلب‌ها متجلی (متجليا) بوده است. پس خواطر در انسان به واسطه تجلی الهی (التجلي الإلهي) متنوع می‌شوند، در حالی که جز اهل الله از آن آگاه نیستند. همان‌طور که آنان می‌دانند که اختلاف صور ظاهری در دنیا و آخرت در تمامی موجودات، چیزی جز تنوع او نیست. پس او ظاهر است، زیرا او عین هر شیء است.\n\nو در آخرت، باطن انسان ثابت می‌ماند، زیرا باطن، عین ظاهر صورت او در دنیاست، و تبدل در آن پنهان است، و آن همان خلق جدید او در هر زمان است که در آن در پوشش (لبس) هستند.\n\nو در آخرت، ظاهر او مانند باطن او در دنیا خواهد بود، و تجلی الهی (التجلي الإلهي) برای او پیوسته بالفعل خواهد بود. پس ظاهر او در آخرت متنوع می‌شود، همان‌طور که باطن او در دنیا در صورتی که تجلی الهی در آن واقع می‌شد، متنوع می‌گشت، و به آن رنگ می‌پذیرفت. پس آن همان همانندی الهی خیالی (التضاهي الإلهي الخيالي) است، با این تفاوت که در آخرت ظاهر است و در دنیا باطن.\n\nپس حکم خیال (الخيال) در آخرت برای انسان و برای حق (الحق) همراه است. و این همان چیزی است که از آن به «شأن» تعبیر می‌شود که حق (الحق) در آن است، از قول او: كُلَّ يَوْمٍ هُوَ في شَأْنٍ (الرحمن: ۲۹) (هر روز او در کاری است). پس همواره بوده و خواهد بود.\n\nو این امر تنها از آن رو خیال (خيال) نامیده شد که می‌دانیم این امر به ناظر بازمی‌گردد نه به خود شیء. زیرا شیء در ذات خود بر حقیقتش ثابت است و دگرگون نمی‌شود، چون حقایق (الحقائق) دگرگون نمی‌شوند، اما برای ناظر در صور متنوع ظاهر می‌شود. و آن تنوع نیز حقیقتی است که بر تنوع خود دگرگون نمی‌شود، پس ثبوت بر یک صورت را نمی‌پذیرد، بلکه حقیقت آن، ثبوت بر تنوع است.\n\nپس هر ظاهری در عالم، صورتی تمثیل شده و کیانی است که با صورتی الهی همانندی دارد، زیرا حق (الحق) بر عالم تجلی نمی‌کند مگر به آنچه با عالم در عین جوهر ثابت مناسبت دارد. همان‌طور که انسان نیز از حیث جوهرش ثابت است.\n\nپس ثابت را با ثابت می‌بینی، و آن غیب از تو و از اوست. و ظاهر را با ظاهر می‌بینی، و آن مشهود و شاهد و شهادت از تو و از اوست. پس این‌گونه آن را درک می‌کنی و آن دو را نیز این‌گونه درک می‌کنی. با این تفاوت که تو در هر صورتی شناخته شده‌ای که تو خود هستی و نه دیگری. همان‌طور که می‌دانی زید در تنوع کیفیاتش از خجالت و ترس و بیماری و عافیت و رضایت و خشم و هر آنچه در آن از احوال دگرگون می‌شود، همان زید است و نه دیگری. امر نیز چنین است.\n\nپس می‌گوییم: فلان از حالی به حال و از صورتی به صورتی تغییر کرد. و اگر امر بر این منوال نبود، هرگاه حالش دگرگون می‌شد، او را نمی‌شناختیم و حکم به عدم او می‌کردیم. پس دانستیم که دو عین وجود دارد، همان‌طور که خداوند متعال فرمود: أَ لَمْ نَجْعَلْ لَهُ عَيْنَيْنِ (البلد: ۸) (آیا برای او دو چشم قرار ندادیم؟). پس چشمی که با آن کسی را که متحول می‌شود، درک می‌کند، و چشمی که با آن تحول را درک می‌کند. و این دو، دو راه متفاوت هستند که خداوند آن‌ها را برای صاحب دو چشم آشکار ساخته است، و آن قول اوست: وهَدَيْناهُ النَّجْدَيْنِ (البلد: ۱۰) (و او را به دو راه هدایت کردیم). یعنی دو راه را برای او بیان کردیم، همان‌طور که شاعر گفت:\n\n> دو راه است، با اینکه یک راه است *** که چشم‌ها برای آهوان آن را طی می‌کنند.\n\nپس طی کردن راه را برای چشم‌ها قرار داد. پس هر چشمی راهی دارد. پس بدان چه کسی را دیدی و چه چیزی را ندیدی. و به همین دلیل صحیح است: وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ (الأنفال: ۱۷) (و هنگامی که پرتاب کردی، تو پرتاب نکردی، بلکه خدا پرتاب کرد).\n\nپس چشمی که با آن درک کردی که پرتاب برای خداست، غیر از چشمی است که با آن درک کردی که پرتاب برای محمد (صلی الله علیه و سلم) است. پس اگر صاحب علم باشی، می‌دانی که دو چشم داری. پس قطعاً می‌دانی که پرتاب‌کننده، خداست در صورت محمدی جسمانی. و تمثل و تخیل جز این نیست.\n\nپس خداوند تو را آگاه ساخت و تو آگاه نمی‌شوی. و این‌ها همان آیاتی هستند که خداوند آن‌ها را برای قَوْمٍ يَعْقِلُونَ (برای گروهی که تعقل می‌کنند) قرار داد تا از او (خدا) تعقل کنند و در آن‌ها تفکر کنند، و تذکری است برای لِمَنْ كانَ لَهُ قَلْبٌ (برای کسی که قلبی دارد) که دگرگون می‌شود، پس أَلْقَى السَّمْعَ (گوش فرا داد) به آنچه به او گفته شد و به واسطه آن شناخت، وهُوَ شَهِيدٌ (و او شاهد است) بر دگرگونی خود در نفسش، پس می‌داند که امر چنین است.\n\nو اینان همان اولو الألباب (صاحبان خرد) هستند. زیرا مغز (اللب) را صورت پوست (القشر) می‌پوشاند، و مغز جز برای کسی که بداند مغزی وجود دارد، شناخته نمی‌شود. و اگر چنین نبود، پوست شکسته نمی‌شد. پس امر آمیخته شد و حقایق (الحقائق) با هم مخلوط نشدند. و به واسطه این، فاضل از مفضول متمایز می‌شود. پس عالم به علم خود به آن متنعم می‌شود و جاهل به جهل خود به آن متنعم می‌شود، و نمی‌داند که جاهل است، زیرا نمی‌داند که امری که بر خلاف آن چیزی است که می‌داند، بر خلاف آن چیزی است که می‌داند، بلکه می‌گوید: جز این نیست.\n\nو اگر می‌دانست که خلاف آنچه می‌داند و درک کرده است، وجود دارد، زندگی‌اش تلخ می‌شد، همان‌طور که در دنیا هر کسی که به دلیل از دست دادن آنچه مقامش اقتضا می‌کند، تلخ‌کام می‌شود؛ از تاجر در تجارتش و فقیه در فقهش و هر عالمی در مرحله خود. پس تحقق قول او به طور عموم: كُلُّ حِزْبٍ بِما لَدَيْهِمْ فَرِحُونَ (مؤمنون: ۵۳) (هر گروهی به آنچه نزد خود دارند شادمانند) تنها در آخرت است، بر خلاف دنیا. زیرا در دنیا این‌گونه نیست، بلکه در موارد بسیاری است و نه به طور عموم. زیرا انسان به علمی که نزد خود دارد، قبل از حصولش شادمان نمی‌شود، زیرا منتظر آن است و در رنج (ألم) است. و هنگامی که نزد او حاصل می‌شود نیز به آن شادمان نمی‌شود. و همه در آخرت، پس از پایان مدت مؤاخذه، به شادمانی به آنچه نزد خود دارند و بر آن هستند، متمایل می‌شوند.\n\nو این منزل، منزل خلق کردن آدم بر صورت اوست. و کسی که بر صورت امری قرار داده شود، و آن امر عین این صورت باشد، پس او همان اوست، نه او. و به همین دلیل صحیح است: وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ (الأنفال: ۱۷). پس هر آنچه از آن صورت ظاهر می‌شود، اصلش از کسی است که آن صورت بر اوست. پس صحیح نیست که از هر آنچه از آن ظاهر می‌شود، بری باشد. و به همین دلیل آمده است: وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ (هود: ۱۲۳) (و همه امور به سوی او بازگردانده می‌شود)، یعنی امری که عالم به تمامه بر آن است.\n\nو به همین دلیل حق (الحق) خود را بر زبان رسولانش به آنچه عالم به تمامه به آن وصف شده است، وصف کرد، قدم به قدم. هیچ چیز از آن مختل نشد و او آن را مختل نکرد.\n\n> پس عین خلق، عین حق (الحق) در آن است *** انکار مکن، زیرا هستی (الكون) عین اوست.\n>\n> اگر تفرقه اندازی، فرقان (جدایی) آشکار است *** و اگر نه، پس عبرت گیر، زیرا جدایی میان اوست.\n\nو هنگامی که گفت تو را بر صورت قرار داد، دانست که ناگزیر باید ادعای مالکیت بر آنچه بر آن هستی، داشته باشی، همان‌طور که او صاحب ملک است. و تو مالکی نزدیک‌تر از نفس خود نداری، و این نفس است که ادعای مالکیت می‌کند، زیرا بر صورت کسی است که مالکیت دارد. پس خداوند قصد نفس کرد از آن جهت که مؤمن است، از اسم او «المؤمن» (ایمن‌کننده)، پس نفس را از مؤمن خرید. پس مؤمن بدون نفس ماند، مانند سایر حیوانات. پس کسی نماند که ادعای ملک کند. پس ملک برای لِلَّهِ الْواحِدِ الْقَهَّارِ (برای خدای یگانه قهار) شد و اشتراک از بین رفت. پس مؤمن نفسی ندارد، بنابراین ادعایی در ملک ندارد. پس هر مؤمنی که حقیقتاً ادعای ملکی کند، مؤمن نیست. زیرا مؤمن کسی است که نفس خود را فروخته است، پس کسی برای ادعا برای او باقی نمانده است، زیرا نفس او صاحب ادعا بود به دلیل اینکه بر صورت کسی بود که حقیقتاً ادعای ملک دارد، و او خداوند متعال است. پس ای برادر، نفس خود را از ادعایی که ایمان را از تو سلب می‌کند، حفظ کن. و مبادا از نفس خود که برای تو بود، دفاع کنی. و اگر تصمیم گرفتی که از آن دفاع کنی، با حضور و علم دفاع کن، بر این اساس که آن نفس حق (الحق) است نه نفس تو. و از آنجاست که پروردگارت تو را پاداش می‌دهد، زیرا تو صادق و ایثارگر هستی. و درجه ایثار را می‌دانی که نزد خدا چه رفعت و منزلتی را اقتضا می‌کند. پس بر آن عمل کن.\n\n### [اینکه انسان دو وجه دارد: وجهی به سوی ذات خود و وجهی به سوی پروردگارش]\n\nپس اگر این را دانستی، بدان که انسان دو وجه دارد: وجهی به سوی ذات خود و وجهی به سوی پروردگارش. و با هر وجهی که به سوی آن روی آوری، از دیگری غایب می‌شوی. با این حال، در اینجا لطیفه‌ای است که تو را به آن آگاه می‌سازم: و آن این است که اگر به مشاهده وجه خود روی آوری، از وجه پروردگارت ذی الجلال و الاکرام غایب می‌شوی، و وجه تو فانی است. پس اگر به سوی او بازگردی، وجه تو از تو فانی می‌شود، و در حضرت (الحضرة) غریب می‌شوی و در آن وحشت می‌کنی و وجه خود را که با آن انس می‌گرفتی، می‌طلبی و آن را نمی‌یابی.\n\nو اگر به وجه پروردگارت روی آوری و وجه خود را رها کنی، او به تو روی می‌آورد و جز او انیس و جز او مشهودی برای تو نخواهد بود. پس اگر به سوی او بازگشت خاصی که برای هر انسانی ناگزیر است، بازگردی، کسی را که قبل از این بازگشت انیس و هم‌نشین و یار تو بود، می‌یابی. پس از ملاقات او شادمان می‌شوی و انس بزرگ‌تر بازمی‌گردد و انس گذشته را به یاد می‌آوری، پس انسی بر انس می‌افزایی و وجه ذات خود را نزد او می‌بینی و آن را گم نمی‌کنی. پس دو وجه را در یک صورت جمع می‌کنی. پس انس به دلیل اتحاد دو وجه، متحد می‌شود. پس شادمانی و سرور عظیم می‌شود. و این حالتی برزخی میان دو حالت است، به دلیل اینکه دو طرف را جمع کرده است. پس کسی که در دنیا میان آن دو جمع کند، در آخرت از آن محروم می‌شود.\n\nمانند منافق که برزخی میان مؤمن و کافر است. پس هنگامی که بازگردد، به یکی از دو طرف، یعنی طرف کفر، رهایی می‌یابد و به ایمان رهایی نمی‌یابد. اگر در اینجا به ایمان رهایی می‌یافت و برزخ نبود، هنگامی که به سوی خدا بازمی‌گشت، همان‌طور که ذکر کردیم، میان دو طرف جمع می‌کرد. پس در اینجا از صفت نفاق برحذر باش، زیرا آن مهلک است و در بازار آخرت، نفاقی دارد که آن موطن اقتضا کرده است.\n\nو منافق در اینجا تنها به دلیل امری دقیق مؤاخذه شد که بسیاری از مؤمنان عالِم از آن آگاه نیستند. و خداوند کسی را که أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ (گوش فرا داد و شاهد است) بر آن آگاه ساخت. و آن این است که منافقان در اینجا إِذا لَقُوا الَّذِينَ آمَنُوا قالُوا آمَنَّا (بقره: ۱۴) (هنگامی که با کسانی که ایمان آورده‌اند ملاقات می‌کنند، می‌گویند ایمان آوردیم). اگر این را حقیقتاً می‌گفتند، سعادتمند می‌شدند. و إِذا خَلَوْا إِلى‏ شَياطِينِهِمْ قالُوا إِنَّا مَعَكُمْ (بقره: ۱۴) (و هنگامی که با شیاطین خود خلوت می‌کنند، می‌گویند ما با شماییم). اگر این را می‌گفتند و سکوت می‌کردند، مذمتی که واقع شد، در آن‌ها تأثیر نمی‌گذاشت. بلکه اضافه کردند: إِنَّما نَحْنُ مُسْتَهْزِؤُنَ (بقره: ۱۴) (ما فقط مسخره‌کنندگان هستیم). پس بر خود شهادت دادند که دروغگو بوده‌اند. پس مؤاخذه نشدند مگر به آنچه خود اقرار کردند. وگرنه اگر بر صورت نفاق بدون اضافه باقی می‌ماندند، سعادتمند می‌شدند. آیا نمی‌بینی هنگامی که خداوند از مؤاخذه خود نسبت به آن‌ها خبر داد، چگونه فرمود: الله يَسْتَهْزِئُ بِهِمْ (بقره: ۱۵) (خداوند آن‌ها را مسخره می‌کند)؟ پس آن‌ها را به خاطر قولشان: إِنَّا مَعَكُمْ مؤاخذه نکرد، بلکه به خاطر آنچه بر نفاق افزودند، یعنی قولشان: إِنَّما نَحْنُ مُسْتَهْزِؤُنَ، مؤاخذه کرد. و خداوند جزای منافق را به تو نشناسانید مگر برای اینکه بدانی کسی که مؤاخذه شد، از کجا مؤاخذه شد، تا تو از موارد هلاکت دوری کنی.\n\nو پیامبر (علیه السلام) فرمود: «مدارای با مردم صدقه است.» (إن مداراة الناس صدقة)\n\nپس منافق با دو طرف مدارای حقیقی می‌کند و بر مدارا نمی‌افزاید. زیرا ثمره آن افزوده را درو می‌کند، هر چه که باشد. پس هوشیار باش، زیرا تو را بر سرّی عظیم از اسرار قرآن آگاه ساختم، و آن واضح است و وضوح آن، پنهان بودن است. و در صورت هر منافقی بنگر، می‌یابی که او مؤاخذه نشد مگر به آنچه بر نفاق افزود. و به واسطه آن، حجت بر او اقامه شد. و اگر چنین نبود، در اعراف با اصحاب اعراف محشور می‌شد و حال او حال اصحاب اعراف بود. ولكِنْ لِيَقْضِيَ الله أَمْراً كانَ مَفْعُولًا (انفال: ۴۲) (ولی تا خداوند امری را که باید انجام می‌شد، به انجام رساند).\n\nپس مؤمن مداراکننده، منافق است و او نجات‌یافته و فاعل خیر است. زیرا هنگامی که با یکی از دو وجه تنها می‌شود، اتحاد با آن را به او نشان می‌دهد و متعرض ذکر وجه دیگر که حاضر نیست، نمی‌شود. و هنگامی که به وجه دیگر بازگردد، با او نیز به همین منوال است. و باطن در هر دو حالت با خداست. زیرا مقام الهی این صورت را دارد. او برای بندگانش با دو صورت عمل می‌کند: تنزیه می‌کند و تشبیه می‌کند. پس مؤمن کامل این‌گونه است و این عین کمال است. پس از افزودن بر آنچه برایت ذکر کردم، برحذر باش و به اخلاق خدا متخلق باش.\n\nو خداوند متعال به پیامبرش (صلی الله علیه و سلم) منت نهاده فرمود: فَبِما رَحْمَةٍ من الله لِنْتَ لَهُمْ (آل عمران: ۱۵۹) (پس به سبب رحمتی از جانب خدا، با آنان نرم‌خو شدی). و نرم‌خویی (اللين)، فروتنی و مدارا و سیاست است. آیا نمی‌بینی که حق (الحق) تعالی کافر را با وجود کفرش روزی می‌دهد و در مؤاخذه او مهلت می‌دهد؟ و فرمود عز و جل به موسی و هارون در حق فرعون: فَقُولا لَهُ قَوْلًا لَيِّناً (طه: ۴۴) (پس با او سخنی نرم بگویید). و این عین مداراست. زیرا در آن تخیل می‌شود که تو با او هستی.\n\nو از این مقام، هنگامی که آن را چشیدم و با آن متحد شدم، برایم اتفاق افتاد که با ملوک و سلاطین مصاحبت کردم و هیچ حاجتی از خلق خدا را نزد هیچ یک از آن‌ها برآورده نکردم مگر از این مقام. و هیچ یک از ملوک در حاجتی که برای یکی از خلق خدا از او خواستم، به من «نه» نگفت. و آن این است که هرگاه می‌خواستم حاجتی را نزد او برآورده کنم، بساطی برای او می‌گستراندم که او را در آن به تدریج می‌کشاندم تا اینکه خودِ مَلِک، برآوردن آن حاجت را با شتاب و فوراً، با طیب خاطر و حرص، به دلیل منفعتی که در آن می‌دید، سؤال و طلب می‌کرد. پس من حاجتی را برای سلطان برآورده می‌کردم به اینکه برآوردن حاجت آن انسان را از او می‌پذیرفتم. و من با ملک الظاهر بأمر الله، حاکم حلب، در مورد حوائج بسیاری صحبت کردم، و او در یک روز صد و هجده حاجت مردم را برای من برآورده کرد. و اگر در آن روز بیش از این نزد من بود، با طیب خاطر و رغبت برآورده می‌کرد.\n\nو هنگامی که این قوه برای انسان حاصل شود، مردم نزد ملوک از او نفع می‌برند. پس در عالم، امری مذموم به طور مطلق و امری محمود به طور مطلق وجود ندارد. زیرا وجوه و قرائن احوال آن را مقید می‌سازند. زیرا اصل، تقیید است نه اطلاق. زیرا هستی (الوجود) بالضروره مقید است. و به همین دلیل دلیل دلالت می‌کند بر اینکه هر آنچه وارد هستی شده است، متناهی است. پس اطلاق صحیح تنها به کسی بازمی‌گردد که در قوّت اوست که به هر صورتی مقید شود و از آن تقیید ضرری به او نرسد. و این جز برای کسی که به مدارا تحقق یافته است، نیست، و او «اِمَّعه» (بی‌اراده) است. و خداوند عز و جل می‌فرماید: وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ (حدید: ۴) (و او با شماست هر کجا که باشید).\n\nپس این شریف‌ترین حالات است برای کسی که میزان آن را بشناسد و به آن تحقق یابد. و او یکی است، و آن یک کجاست؟\n\n> آگاه باش که نفاق، همان نفاق است *** اگر به آن تحقق یابی، مسیر به سوی اوست.\n>\n> پس در آن باش تا به حق (الحق) خالص باشی *** و او را ستایش کنی هنگامی که بندها را محکم کرد.\n>\n> اگر بر چیزی تکیه کنی *** پس اگر بیندیشی، تو برای آن ستون هستی.\n>\n> بر ستونی که از ما غایب شده است *** اگر بر طبقات تکیه کنی.\n>\n> پس آن ستون باش تا امام شوی *** و دین موافق نزد تو آشکار گردد.\n\nپس در قرآن تدبر کن از آن جهت که فرقان و قرآن است. پس برای قرآن موطنی است و برای فرقان موطنی. پس در هر موطنی به استحقاق آن قیام کن تا موطن‌ها تو را ستایش کنند. و موطن‌ها نزد خدا شاهدان عادل هستند، زیرا جز به صدق شهادت نمی‌دهند. و من تو را نصیحت کردم، پس عمل کن. و خداوند توفیق‌دهنده است.\n\nگفتیم: و در این منزل از علوم، علم دقیق و پنهانی وجود دارد که به دلیل پنهان بودنش با وجود ظهورش، کسی از آن آگاه نمی‌شود. زیرا عالمان به خدا (العلماء بالله) شمول رحمت را دانسته‌اند و مؤمنان وسعت آن را دانسته‌اند. سپس آن را با وجود شمول و وسعت، می‌بینند که در بعضی موطن‌ها صورتی ندارد. و با وجود اینکه در بعضی موطن‌ها صورت ظاهری ندارد، حکم در آن موطن که در آن صورت ندارد، برای آن است. و حکم برای آن نیست مگر به وجود آن، اما به دلیل بطونش پنهان است و به دلیل ظهور حکمش آشکار است. و بیشتر این امر در صنعت طب و اجرای حدود ظاهر می‌شود.\n\nپس خداوند در اجرای حدود در حد زانی و زانیه می‌فرماید: ولا تَأْخُذْكُمْ بِهِما رَأْفَةٌ في دِينِ الله (نور: ۲) (و در دین خدا، نسبت به آن دو، رأفت (دلسوزی) شما را نگیرد). این عین سلب رحمت از آن‌هاست، در حالی که اجرای حدود از حکم رحمت است و صورت ظاهری ندارد. و مانند طب، هنگامی که طبیب پای کسی را که دچار آکله (بیماری خورنده) است، قطع می‌کند. اگر در این موطن به او رحم می‌کرد و پایش را قطع نمی‌کرد، هلاک می‌شد. پس حکم رحمت، حکم به قطع پای او کرد، در حالی که صورتی (ظاهری) ندارد. پس رحمت موطنی دارد که در آن به صورت خود ظاهر می‌شود، و موطنی دارد که در آن به حکم خود ظاهر می‌شود. پس تخیل می‌شود که از آن محل سلب شده است، در حالی که چنین نیست.\n\nو در احکام شرعی در این مسئله، پنهانی وجود دارد، مگر برای کسی که خداوند بصیرتش را نورانی کرده باشد. زیرا قاتل ظالم، خداوند رحمت را از قلبش نسبت به مقتول سلب کرده است، در حالی که او در کشتن ظالمانه خود تحت حکم رحمت است. و حکم رحمت در قاتل باقی مانده است: یا از او قصاص گرفته می‌شود، یا می‌میرد و در مشیت الهی قرار می‌گیرد. و اگر قاتل کافر باشد، یا اسلام می‌آورد و رحمت در او به صورت خود ظاهر می‌شود. و هر جا که رحمت به صورت باشد، به حکم نیز هست. و ممکن است به حکم باشد و به صورت نباشد.\n\nو در آن علم غریبی است، و آن علم تقیید حق (الحق) به سلب هستی (الكون) از اوست، با وجود اینکه هستی در قبضه و تحت سلطنت و ملک اوست.\n\nو در آن علم سیاست در دعوت به سوی خداست. زیرا صورت آن از سوی داعی، با اختلاف صورت مدعو، متفاوت است. پس دعوتی با صفت خشونت و قهر وجود دارد، و دعوتی با صفت نرمی و عطوفت.\n\nو در آن علم عموم عهد الهی است که بر بنی آدم گرفته است.\n\nو در آن علم جولان در ملکوت، به حس و خیال (الخيال) و عقل، با ثلث نشأت الهی است. زیرا نشأت انسانی هنگامی که آمیخته از اخلاط ایجاد شد، شبیه سال در فصولش شد. و کمال زمان جز به فصول سال نیست، سپس دور بازمی‌گردد. پس انسان از حیث اخلاطش، سال است. پس او عین دهر است که همان زمان است. پس او جولانی در ملکوت دارد به یکی از سه امر، یا به همه آن‌ها، یا به بعضی از آن‌ها: یا به حس خود جولان می‌کند که همان کشف (الکشف) است، یا به عقل خود جولان می‌کند که حال فکر و تفکر اوست، یا به خیال (الخيال) خود جولان می‌کند. و سال دوازده ماه است. پس برای هر حقیقتی از این نشأت که شبیه سال است، ثلث سال است. پس برای آن تثلیث در تربیع و تربیع در تثلیث است. اما تثلیث آن در تربیع، همان است که ذکر کردیم از تقسیم آن بر سه (حس و خیال و عقل) در تربیع اخلاط آن. و اما تربیع آن در تثلیث، این است که حکم اخلاط به کمال خود در هر یک از اقسام سه‌گانه است، و آن‌ها چهارتا هستند. پس تربیع آن حکمی در حس و حکمی در خیال و حکمی در عقل دارد. و جز اهل حضور که آیات را در نفس خود می‌نگرند، از آن آگاه نیستند.\n\nو در آن علم جهل انسان هنگام مسابقه با خداست. و حجت ما قول خداوند متعال است: «بنده من در مورد نفس خود بر من پیشی گرفت» (بادرني عبدي نفسه) در مورد کسی که خود را کشت. و قول به این سیاق، قول اهل نظر در تشبه به اله به نهایت توان است، و اینکه اگر این یافت شود، کمال است. و این نزد ما عین جهل است که با حق (الحق) در آنچه برای اوست، با آنچه برای من است، مسابقه دهم. زیرا محال است که با او در آنچه برای اوست، مسابقه دهی، چون شیء با نفس خود مسابقه نمی‌دهد. و محال است که با او در آنچه برای من است، مسابقه دهی، زیرا غایتی وجود ندارد که به سوی آن مسابقه داده شود، پس عملی در غیر محل عمل و طمعی در غیر محل طمع خواهد بود. و کسی که در این حال باشد، اگر نفس خود را تعقل کند، جهل او پنهان نیست.\n\nو در آن علم اعلام الهی در ماده الهی است که چه خواهد شد و چه واقع می‌شود، در شنیدن شنوندگان از آن اعلام، آیا در هر گوشی به یک حد واقع می‌شود یا تعلق گوش هنگام آن اعلام متفاوت است؟\n\nو در آن علم معامله با خلق بر اختلاف اصنافشان است، به آنچه آن‌ها را از تو شاد می‌کند نه به آنچه آن‌ها را ناراحت می‌کند. و آن علمی عزیز، سخت‌دسترس و دقیق‌الوزن است که میزان آن مجهول است و صاحبش به کشف (الکشف) نیاز دارد و در آن هنگام برای او حاصل می‌شود.\n\nو در آن علم حکم اصحاب آجال است، هنگامی که آجالشان به پایان می‌رسد، آیا بعد از آن پایان به اجل مسمایی تأخیر داده می‌شوند یا برای آن‌ها نیز اجلی نیست که به آن پایان یابند؟\n\nو در آن علم آنچه ممکن است از شروط صحیح باشد و آنچه ممکن نیست از آن‌ها صحیح باشد.\n\nو در آن علم اعطای امان است و اینکه به چه کسی باید اعطا شود. پس برای این متصرف، علم به احوال ضروری است.\n\nو در آن علم تنوع مردم در اخلاقشان است و آنچه از آن محمود است و آنچه از آن مذموم است.\n\nو در آن علم علم ملائکه به خداست که هیچ یک از بشر آن را نمی‌داند مگر اینکه از بشریت خود مجرد شود و از حکم آنچه در نشأت او برای طبیعت است، مجرد شود تا جز روح دمیده شده (الروح المنفوخ) در او باقی نماند. در آن هنگام به علم به خدا از آن جهت که ملائکه آن را می‌دانند، رهایی می‌یابد. پس در عبادت پروردگارش در مقام ملائکه در عبادتشان برای خدا قرار می‌گیرد. و این علامت کسی است که ادعا کند خدا را به صورتی که ملائکه می‌دانند، می‌شناسد. پس هر کس این ادعا را بدون این علامت کند، ادعای او دروغ و بهتان است. زیرا ملائکه علمی عام به خدا دارند که صنف را شامل می‌شود، و علمی خالص برای هر فرشته به خدا دارند که برای دیگری نیست. و ما در ادعای او جز علم عام را از او نمی‌خواهیم. و این علامت نزد ما ذوقاً معلوم است و آن را برای کسی ذکر نمی‌کنیم تا مبادا در زمانی با آن ظاهر شود در حالی که در ادعای خود دروغگو و غیر متحقق باشد. به همین دلیل به ما و امثال ما امر شده است که این و امثال آن را بپوشانیم.\n\nو در آن علم دلالات عالمان به خدا (العلماء بالله) بر طبقاتشان است. زیرا آن‌ها در علم به خدای متعال بر طبقاتی هستند.\n\nو در آن علم از بین بردن علل و بیماری‌های نفوس است.\n\nو در آن علم آداب ورود بر خداست.\n\nو در آن علم صفات کسی است که ادعا می‌کند هم‌نشین خداست، هم‌نشینی شهود (شهود) نه هم‌نشینی ذکر. زیرا ذاکران نیز هم‌نشینان خدا هستند، و آن‌ها حقیقتاً هم‌نشینان خدا هستند از حیث اسمی که او را با آن ذکر می‌کنند. و این مسئله‌ای است که بسیاری از مردم آن را نمی‌دانند.\n\nو در آن علم آنچه رحمت رضایت و رحمت فضل و انواع رحموت‌ها عطا می‌کند.\n\nو در آن علم برپایی نعمت است، آیا آن نعمت دوام دارد یا حالی در آن رخنه می‌کند که نه نعمتی در آن است و نه غیر آن؟\n\nو در آن علم تفصیل پاداش‌ها نزد خداوند عز و جل است و به چه چیزی متمایز می‌شوند.\n\nو در آن علم حب الهی است که در هر حبی مندرج است، و مقام کسی که آن را مشاهده کرده و دانسته است چیست؟ و آیا کسی که به آن علم ندارد با عالم به آن برابر است یا نه؟\n\nو در آن علم معتمدات است و آنچه از آن‌ها واجب است و آنچه واجب نیست.\n\nو در آن علم سکائن (جمع سکینه) است، آیا یک امر آن‌ها را جمع می‌کند مانند انسانیت در اشخاصش، یا آن‌ها متنوع هستند و هر سکینه‌ای از نوعی است که عین سکینه دیگر نیست؟\n\nو در آن علم تنوع رجوع الهی به دلیل تنوع حال مرجوع‌الیه نیز هست.\n\nو در آن علم درجات بی‌نیازشدگان به خدا (الأغنياء بالله) در بی‌نیازی‌شان به خداوند جل ثناؤه است.\n\nو در آن علم سبب موجبی است که طبیعت را وادار به پلیدی و ناپاکی می‌کند، و آنچه از آن صادر می‌شود و آن عین آن است. و آیا برای آن در علم الهی اصلی وجود دارد که به آن بازگردد، مانند آنچه از افعال بندگان و اخلاق پست مذمت می‌شود، با علم به اینکه آن صورتی از صور است که محل تجلی (مجلى) است؟\n\nو در آن علمی از علوم الهی در برتری دادن بعضی از نسبت‌های الهی بر بعضی دیگر است. و اینکه عالم بعضی را بر بعضی دیگر برتری دهد، از این اصل نتیجه می‌شود. زیرا محال است که در عالم چیزی باشد که مستندی به امر الهی نداشته باشد که نعت حق (الحق) تعالی باشد، هر چه که باشد.\n\nو در آن علم آنچه شایسته است به خدا نسبت داده شود و آنچه شایسته نیست که نسبت داده شود.\n\nو در آن علم سریان ربوبیت در عالم است تا جایی که کسی که پرستیده شد، غیر از خداوند متعال بود.\n\nو در آن علم آنچه شایسته است از علوم ذخیره شود و آنچه شایسته است فاش نشود، و آنچه شایسته است ذخیره نشود و آنچه شایسته است فاش شود.\n\nو در آن علم آنچه خداوند از زمان، از ساعات و روزها و شب‌ها و ماه‌هایش برگزیده است. و آن علم برتری دهر در ذات خود است. و اصل دهر چیست؟ و سبب نامیدن خداوند به اسم دهر چیست، در حالی که آن اسمی ازلی برای اوست و دهری وجود ندارد؟ و آیا زمان به دلیل این اسم، دهر نامیده شد یا خداوند به این اسم نامیده شد به دلیل علمش به اینکه امری را خلق می‌کند که به آن دهر گفته می‌شود؟ زیرا او همواره خالق بوده و همواره خالق خواهد بود. و آیا حکم زمان در عالم به پایان می‌رسد یا به پایان نمی‌رسد؟ و سهم حرکات افلاک از زمان چیست؟\n\nو در آن علم کسی است که به سعادتش دعوت شد و با علم به اینکه به حق (الحق) دعوت شده است، در اجابت سستی کرد.\n\nو در آن علم اسباب نصرت الهی است.\n\nو در آن علم محبت حق (الحق) است.\n\nو در آن علم سبب دعوت‌کننده به مباهته (جدال باطل) است، با علم به اینکه او مباهت‌کننده است، با علم به اینکه مسئول آن است. و غلبه برای قوی‌تر است، و برای حق (الحق) قوت است، و هوی با آن مبارزه می‌کند و گاهی بر آن غلبه می‌کند. آیا غلبه هوی بر آن به دلیل سهمی است که از حق (الحق) دارد؟ پس جز حق بر حق غلبه نمی‌کند.\n\nو در آن علم ابتلای امام اصحاب خود را برای اقامه حجت بر آن‌هاست، نه برای کسب علم از آن.\n\nو در آن علم آنچه باید در هر حالی که بر بنده دگرگون می‌شود یا بنده در آن دگرگون می‌شود، گفته شود.\n\nو در آن علم دایره‌های مهلک است که چیستند و اسباب موجبه آثار آن‌ها در هستی (الكون) چیست.\n\nو در آن علم سببی است که از قبول عمل خالص جلوگیری می‌کند تا عامل در غیر محل عمل کار کند.\n\nو در آن علم تقسیم نعمت‌ها بر بندگان است، در حالی که آن‌ها در دست بندگان هستند و برای آن‌ها جز ذخیره‌سازی در نفس الامر نیست، و آن‌ها مسئول آن هستند.\n\nو در آن علم گوش فرا دادن به هر گوینده‌ای است و فایده آن چیست اگر در شنونده تأثیر نکند؟ پس اگر سریع‌الانفعال به آنچه می‌شنود باشد، عقلاً بر او واجب است که به گوینده شر گوش فرا ندهد.\n\nو در آن علم اختلاف نام‌ها بر خدا نزد طوایف است، در حالی که مقصود یکی است.\n\nو در آن علم سبب دشمنی اشخاص نوع واحد و دوستی انواع است، با اینکه جنس واحدی آن‌ها را شامل می‌شود.\n\nو در آن علم قدر (القَدَر) است و مستند آن از نعت الهی چیست؟ و آیا آن عین استدراج است یا غیر آن؟\n\nو در آن علم اسباب طرد الهی است، در حالی که همه در قبضه اوست. پس طرد از چه کسی و به کجا خواهد بود؟ و معنای قول آن‌ها: «دوری از خدا» چیست؟\n\nو در آن علم انزال منازل در قالب‌هاست، به چه معنا در صور نازل می‌شوند و معانی همان‌طور که در نفس الامر هستند، نازل نمی‌شوند؟\n\nو در آن علم اسباب رفع حرج در حق کسی است که حرج از او برداشته شده است. زیرا رفع آن از عالم محال است، چون اگر برداشته می‌شد، عالم از درجه کمال زائل می‌شد، در حالی که عالم به مرتبه کامل است، اگرچه افزایش را با اشخاص انواع می‌پذیرد، اما به دلیل آن به نقص متصف نمی‌شود.\n\nو در آن علم آنچه از ایمان‌های منعقد شده کفرآور نیست، هنگامی که صاحبش در صورت امر حنث کند. و این مسئله‌ای است که فقها آن را انکار می‌کنند و بر خلاف آن فتوا می‌دهند.\n\nو در آن علم آنچه از مذمومات اخلاق شمرده می‌شود، در حالی که نزد خدا از مکارم آن است.\n\nو در آن علم مخالفت حق (الحق) با بنده مقرب خود در آنچه از او می‌خواهد، مانند قول خداوند متعال: إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ الله لَهُمْ (توبه: ۸۰) (اگر هفتاد بار هم برای آن‌ها طلب آمرزش کنی، خداوند هرگز آن‌ها را نمی‌آمرزد) و امثال آن.\n\nو در آن علم حکم کسی است که از جماعت خارج شود یا دستی از طاعت امام بعد از بستن بیعت و ثبوت آن بیرون کشد.\n\nو در آن علم سابق و لاحق است.\n\nو در آن علم شر و خیر و حکم ایمان است.\n\nو در آن علم نفوس جزئیه است.\n\nو در آن علم صفات مقربین است.\n\nو در آن علم ضلالت و هدایت است.\n\nو در آن علم قرار دادن واحد به جای جمع است. و خداوند يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (احزاب: ۴) (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 7
}