{
  "id": 106,
  "title": {
    "ar": "الباب السادس ومائة في معرفة الجوع المطلوب",
    "en": "Chapter 106: Concerning the Gnosis of the Required Hunger",
    "ur": "باب ایک سو چھٹا: مطلوبہ بھوک کی معرفت میں",
    "fa": "باب صد و ششم در معرفت گرسنگی مطلوب"
  },
  "content": {
    "ar": "## (الباب السادس ومائة في معرفة الجوع المطلوب)\n\n\n> الجوع موت أبيض *** وهو من أعلام الهدى‏\n\n\n> ما لم يؤثر خبلا *** فهو دواء وهو دا\n\n\n> فاحكم به تكن به *** موفقا مسددا\n\n\n### [الموتات الأربعة في طريق أهل الله‏]\n\n\nالجوع حلية أهل الله وأعني بذلك جوع العادة وهو الموت الأبيض فإن أهل الله جعلوا في طريقهم أربع موتات هذا أحدها وموت أخضر وهو لباس المرقعات إلا المشهرات كان لعمر بن الخطاب ثوب يلبسه فيه ثلاث عشرة رقعة إحداهن قطعة جلد وهو أمير المؤمنين وموت أسود وهو تحمل الأذى وموت أحمر وهو مخالفة النفس في أغراضها وهو لأهل الملامية\n\n\n### [الجوع المطلوب للسالكين‏]\n\n\nفالجوع المطلوب في الطريق هو للسالكين جوع اختيار لتقليل فضول الطبع ولطلب السكون عن الحركة إلى الحاجة فإن علا فلطلب الصفة الصمدية وحده عندنا صوم يوم فإن زاد فإلى السحر هذا هو\nالجوع المشروع الاختياري وما لنا طريق إلى الله إلا على الوجه المشروع ولو لا إن الله جعل هذا حد المصلحة في عموم خلقه لما وقته إلى هذا القدر فلا يكون الإنسان في الزيادة عليه أعلم بمصالح الجوع في العبد من ربه هذا غاية سوء الأدب فإن كان ممن يطعم ويسقى في مبيته وفنائه ويجد أثر ذلك في قوته وصحة عقله وحفظ مزاجه فليواصل ما شاء فإنه ليس بصاحب جوع وكلامنا في الجوع وإن كان أيضا ممن يستغرقه حال ووارد قوي يحول بينه وبين الطعام كأبي عقال فإن كان صاحب فائدة فهي المطلوب وإن لم يكن فذلك مرض يعرض حاله على الأطباء وما ذلك مطلب القوم‏\n\n\n### [جوع الأكابر]\n\n\nوأما جوع الأكابر فجوع اضطرار فإن الذي ينتجه الجوع قد حصل لهم ملكة لا تزول عنهم في حال جوع ولا شبع فلم يبق إلا التقليل ولكن من الحلال إما للنشاط في الطاعات وإما لخفة الحساب‏\n\n\nفإن النبي صَلَّى اللهُ عَليهِ وسَلَّم قال إنكم لتسئلون عن نعيم هذا اليوم‏\n\n\nولم يكن سوى تمر وماء وما أدخل نفسه في الجماعة فإن لله عبادا سليمانيين يقول الله لهم هذا عَطاؤُنا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسابٍ وهم سبعون ألفا في هذه الأمة قد نعتهم النبي صَلَّى اللهُ عَليهِ وسَلَّم والخبر صحيح وعكاشة منهم بالنص عليه‏\n\n\n### [ترك العمل اتباعا أعظم أجرا من العمل ابتداعا]\n\n\nفينبغي للصالح السالك أن لا يزيد على الحد المشروع فيكون متبعا فإن ترك العمل بالاتباع أعظم أجرا من العمل بالابتداع فإنا بالاتباع بحكم الأصل فإن وجودنا تبع لوجود من أوجدنا فلتكن أفعال العلماء بهذه المرتبة على ذلك ولما\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم إن الشيطان يجري من ابن آدم مجرى الدم فسدوا مجاريه بالجوع والعطش‏\n\n\nلم يختلف أحد من العلماء ولا من أهل الله إنه أراد الصوم والتقليل من الطعام في السحور المسنون لمن واصل وفي الإفطار لمن أفطر فإنه قال بحسب ابن آدم لقيمات يقمن صلبه فلا يتعدى المريد الحد الذي سنه من شرع الطريق إلى الله به ولا تعرف قدر ما دللتك عليه إلا في نتيجته إن فتح لك هنا ولا تجع من غير صوم فإنه غير طريق مشروعة ولا تجعل سبب ذلك حديث أجر الصوم فذلك ليس لك إنما هو للعمل ودع النفس ترغب في الأجرة التي لها على ذلك فإن فيها من يطلب ذلك وأنت بالسر الإلهي والروح الامري بمعزل عن هذا الطلب الذي تطلبه النفس الحيوانية فإنك مجموع ولا تلحق بأهل الغلط من أهل هذه الطريق الذين يجوعون تلامذتهم من غير صوم أو يصومونهم ثم يطعمونهم قبل غروب الشمس ذلك غلط منهم وجهل بطريق الله تعالى وإن كانوا يقصدون بذلك مخالفة النفوس فما هذا موضعه وإنما ينبغي أن يخالفوها في تعيين المأكول على حد مخصوص ووجه معين وميزان مستقيم يعرفه أهل الله فإذا مالت إلى طعام خاص معين عندها حتى لا تكره شيئا من نعم الله ولقد عملت على هذا زمانا حتى طاب لي كل شي‏ء كنت لا أقدر على أكله وتمجه نفسي وكذلك في التقليل منه وهو أشد ما على النفس أن تشرع في الشي‏ء ثم يحال بينها وبين التملي منه والله الموفق لا رب غيره‏\n\n",
    "en": "## Chapter 106: Concerning the Knowledge of the Desired Hunger\n\nHunger is a White Death,\nAnd it is among the signs of guidance.\nAs long as it does not cause confusion,\nIt is both a remedy and a cure.\nRule by it, and by it you shall be\nSuccessful and rightly guided.\n\n### The Four Deaths on the Path of the People of Allah\n\nHunger is the adornment (حلية) of the People of Allah (أهل الله). By this, I mean the customary hunger, which is the White Death (الموت الأبيض). The People of Allah have established four deaths on their path. This is one of them.\n\nThe Green Death (الموت الأخضر) is the wearing of patched garments (لباس المرقعات), provided they are not conspicuous. Umar ibn al-Khattab had a garment he wore that contained thirteen patches, one of which was a piece of leather, while he was the Commander of the Faithful (أمير المؤمنين).\n\nThe Black Death (الموت الأسود) is enduring harm (تحمل الأذى).\n\nThe Red Death (الموت الأحمر) is opposing the ego/soul (النفس) in its aims, and this belongs to the People of Blame (أهل الملامية).\n\n### The Desired Hunger for the Seekers\n\nThe hunger desired on the Path (الطريق) for the Seekers (السالكين) is a voluntary hunger (جوع اختيار) intended to reduce the excesses of natural disposition (فضول الطبع) and to seek stillness (السكون) from the movement toward need. If it is elevated, it is for the purpose of seeking the Attribute of Absolute Independence (الصفة الصمدية). Its limit, according to us, is the fast of one day. If it is increased, it extends until the pre-dawn meal (السحر). This is the prescribed, voluntary hunger (الجوع المشروع الاختياري).\n\nWe have no path to Allah except through the prescribed manner (الوجه المشروع). If Allah had not made this the limit of benefit (حد المصلحة) for the generality of His creation, He would not have limited it to this extent. Therefore, a person who exceeds this limit is not more knowledgeable than his Lord concerning the benefits of hunger for the servant. This is the height of ill-manners (سوء الأدب).\n\nIf the person is one who is fed and given drink in his sleeping place and dwelling—meaning, spiritually sustained—and finds the effect of this in his strength, the soundness of his intellect, and the preservation of his temperament, then let him continue fasting as he wishes, for he is not truly a person of hunger (صاحب جوع). Our discussion concerns hunger. If he is also one who is overwhelmed by a spiritual state (حال) or a powerful influx (وارد قوي) that prevents him from eating, like Abu Uqal, then if he gains benefit (فائدة) from it, that is the desired goal. If not, then that is an illness that should be presented to physicians, and it is not the objective of the People (القوم).\n\n### The Hunger of the Great Masters\n\nAs for the hunger of the Great Masters (جوع الأكابر), it is a hunger of necessity (جوع اضطرار). This is because the result produced by hunger has already become an established quality (ملكة) for them, which does not depart from them whether they are hungry or satiated. Thus, nothing remains but the reduction, but only from what is lawful (الحلال), either for the sake of spiritual vigor in acts of obedience or for the lightness of the reckoning.\n\nThe Prophet, peace and blessings be upon him, said: \"Indeed, you will be questioned about the delight (نعيم) of this day.\"\n\nAnd that delight was nothing more than dates and water. He did not include himself in the general group. For Allah has servants who are like Solomon (سليمانيين), to whom Allah says: <<هذا عَطاؤُنا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسابٍ>> (This is Our gift; therefore, bestow or withhold without reckoning). They are seventy thousand in this Community (الأمة), whom the Prophet, peace and blessings be upon him, described, and the report is sound, and Ukasha is explicitly named among them.\n\n### Abandoning an Act in Adherence is Greater in Reward than Performing an Act in Innovation\n\nThe righteous Seeker (السالك) should therefore not exceed the prescribed limit (الحد المشروع), so that he remains an adherent (متبعا). For abandoning an act through adherence (الاتباع) is greater in reward than performing an act through innovation (الابتداع). We are governed by adherence based on the fundamental principle (الأصل), for our existence is a consequence of the existence of the One who brought us into existence. The actions of the Gnostics (العلماء) should be at this level, based on that principle.\n\nWhen the Prophet, peace and blessings be upon him, said: \"Indeed, Satan flows through the son of Adam like blood; so restrict his passages with hunger and thirst,\"\n\nNone of the scholars or the People of Allah disagreed that he meant fasting (الصوم) and the reduction of food during the recommended pre-dawn meal (السحور المسنون) for those who continue fasting, and during the breaking of the fast (الإفطار) for those who break it. For he said: \"A few morsels that keep his back straight are sufficient for the son of Adam.\"\n\nThe Aspirant (المريد) should not transgress the limit established by the one who legislated the Path to Allah. You will not know the value of what I have guided you to except through its result, if an unveiling (فتح) is granted to you here.\n\nDo not hunger without fasting, for that is not a prescribed path (طريق مشروعة). Do not make the reason for this the hadith concerning the reward of fasting, for that is not for you; it is only for the action itself. Let the ego/soul (النفس) desire the reward that is due to it for that action, for there are those within it who seek that. But you, by virtue of the Divine Secret (السر الإلهي) and the Spirit of Command (الروح الامري), are far removed from this seeking which the animal soul (النفس الحيوانية) desires, for you are gathered (مجموع).\n\nDo not join the people of error (أهل الغلط) on this Path who cause their students to hunger without fasting, or who make them fast and then feed them before sunset. That is an error on their part and ignorance of the Path of Allah the Exalted. Even if they intend by this to oppose the egos/souls, this is not the proper place for it. Rather, they should oppose the egos/souls in specifying the food to a particular limit, a specific manner, and a straight balance (ميزان مستقيم) known to the People of Allah. [They should oppose the ego] when it inclines toward a specific, particular food, until they dislike none of Allah’s blessings. I practiced this for a time until everything I could not previously eat and which my soul rejected became palatable to me. Likewise, [they should oppose the ego] in reducing the quantity, which is the hardest thing for the ego: to begin something and then be prevented from fully satisfying itself with it. And Allah is the Granter of Success; there is no Lord but Him.",
    "ur": "باب ایک سو چھ: مطلوبہ بھوک (الجوع المطلوب) کی معرفت میں\n\nبھوک (الجوع) ایک سفید موت (موت أبيض) ہے *** اور یہ ہدایت کی نشانیوں میں سے ہے\nجب تک یہ جنون پیدا نہ کرے *** یہ دوا بھی ہے اور مرض بھی\nپس اس پر حکم چلاؤ تاکہ تم *** کامیاب اور درست راہ پر ہو جاؤ\n\n### [اہلِ حق کے راستے میں چار موتیں]\n\nبھوک (الجوع) اہلِ حق (أهل الله) کا زیور ہے، اور اس سے میری مراد وہ بھوک ہے جو عادت بن جائے، اور یہی سفید موت (الموت الأبيض) ہے۔ اہلِ حق نے اپنے راستے میں چار موتیں مقرر کی ہیں، یہ ان میں سے ایک ہے۔ دوسری سبز موت (موت أخضر) ہے، جو پیوند لگے کپڑے پہننا ہے، سوائے ان کے جو شہرت کا باعث بنیں۔ حضرت عمر بن خطاب رضی اللہ عنہ کے پاس ایک کپڑا تھا جسے وہ پہنتے تھے، اس میں تیرہ پیوند لگے تھے، جن میں سے ایک چمڑے کا ٹکڑا تھا، حالانکہ وہ امیر المؤمنین تھے۔ تیسری کالی موت (موت أسود) ہے، جو اذیت برداشت کرنا ہے۔ اور چوتھی سرخ موت (موت أحمر) ہے، جو نفس کی خواہشات کی مخالفت کرنا ہے، اور یہ اہلِ ملامت (أهل الملامية) کے لیے ہے۔\n\n### [سالکین کے لیے مطلوبہ بھوک]\n\nپس راستے میں مطلوبہ بھوک (الجوع المطلوب) سالکین (السالکین) کے لیے اختیاری بھوک ہے، تاکہ طبعی فضولیات کو کم کیا جا سکے اور ضرورت کی طرف حرکت سے سکون حاصل کیا جا سکے۔ اگر یہ بھوک بڑھ جائے تو اس کا مقصد صفتِ صمدیت (الصفة الصمدية) کا حصول ہے۔ ہمارے نزدیک اس کی حد ایک دن کا روزہ ہے۔ اگر اس سے زیادہ ہو تو سحری تک (روزہ رکھنا)۔ یہ وہ اختیاری بھوک (الجوع المشروع الاختياري) ہے جو شریعت کے مطابق ہے۔\n\nاور ہمارے لیے اللہ کی طرف کوئی راستہ نہیں مگر صرف شرعی طریقے پر۔ اگر اللہ تعالیٰ نے اپنی تمام مخلوق کے لیے مصلحت کی حد یہ مقرر نہ کی ہوتی تو وہ اسے اس مقدار تک محدود نہ کرتا۔ لہٰذا، اس حد سے تجاوز کرنے میں انسان اپنے رب سے زیادہ بندے کے لیے بھوک کی مصلحتوں کو جاننے والا نہیں ہو سکتا۔ یہ انتہائی سوءِ ادب ہے۔\n\nاگر کوئی ایسا شخص ہے جسے اس کے ٹھکانے اور احاطے میں کھانا اور پانی ملتا رہے اور وہ اس کا اثر اپنی قوت، عقل کی صحت اور مزاج کی حفاظت میں پائے، تو وہ جتنا چاہے روزہ رکھے (یا بھوکا رہے)، کیونکہ وہ بھوک کا مالک نہیں ہے۔ اور ہماری گفتگو بھوک کے بارے میں ہے۔ اگر کوئی ایسا شخص بھی ہو جسے کوئی قوی حال (حالت) یا وارد (وارد) اپنی لپیٹ میں لے لے اور کھانے سے روک دے، جیسے ابو عقال۔ اگر اس میں کوئی فائدہ ہو تو وہی مطلوب ہے، اور اگر نہ ہو تو یہ ایک بیماری ہے جس کا حال طبیبوں کے سامنے پیش کیا جائے، اور یہ اہلِ حق (القوم) کا مطلوب نہیں ہے۔\n\n### [اکابر کی بھوک]\n\nاور جہاں تک اکابر (الأكابر) کی بھوک کا تعلق ہے، تو وہ اضطراری بھوک ہے۔ کیونکہ جو چیز بھوک سے پیدا ہوتی ہے، وہ انہیں ایک ایسی ملکہ (ملکہ) کے طور پر حاصل ہو چکی ہے جو بھوک یا سیری کی حالت میں ان سے زائل نہیں ہوتی۔ لہٰذا، اب صرف حلال چیزوں میں کمی کرنا باقی رہ گیا ہے، یا تو طاعات میں چستی کے لیے، یا حساب کی آسانی کے لیے۔\n\nکیونکہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: **\"تم سے اس دن کی نعمتوں کے بارے میں ضرور پوچھا جائے گا۔\"** اور وہ (نعمتیں) صرف کھجور اور پانی کے سوا کچھ نہ تھیں۔ اور آپ صلی اللہ علیہ وسلم نے خود کو اس جماعت میں شامل نہیں کیا۔ کیونکہ اللہ کے کچھ سلیمانی بندے ہیں جن سے اللہ تعالیٰ فرماتا ہے: **\"یہ ہماری بخشش ہے، اب چاہے احسان کرو یا روکے رکھو، کوئی حساب نہیں ہو گا۔\"** (هذا عَطاؤُنا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسابٍ) اور وہ اس امت میں ستر ہزار ہیں جن کی تعریف نبی صلی اللہ علیہ وسلم نے کی ہے، اور یہ خبر صحیح ہے، اور عکاشہ رضی اللہ عنہ ان میں سے ہیں، جیسا کہ نص میں بیان ہوا ہے۔\n\n### [پیروی میں عمل کو ترک کرنا بدعت میں عمل کرنے سے زیادہ اجر رکھتا ہے]\n\nپس صالح سالک (السالک) کے لیے ضروری ہے کہ وہ شرعی حد (الحد المشروع) سے تجاوز نہ کرے تاکہ وہ متبع (پیروی کرنے والا) رہے۔ کیونکہ پیروی (اتباع) کی وجہ سے عمل کو ترک کرنا، بدعت (ابتداع) کے طور پر عمل کرنے سے زیادہ اجر رکھتا ہے۔ اس لیے کہ ہم اصل کے حکم کے تحت پیروی کرتے ہیں، کیونکہ ہمارا وجود اس ذات کے وجود کا تابع ہے جس نے ہمیں وجود بخشا۔ پس علماء کے افعال کو بھی اسی مرتبے پر ہونا چاہیے۔\n\nاور جب نبی صلی اللہ علیہ وسلم نے فرمایا: **\"شیطان ابن آدم میں خون کی طرح دوڑتا ہے، پس اس کے راستوں کو بھوک اور پیاس سے تنگ کر دو۔\"** تو علماء اور اہلِ حق (أهل الله) میں سے کسی نے اختلاف نہیں کیا کہ آپ صلی اللہ علیہ وسلم کی مراد روزہ اور سحری میں کھانے کی کمی تھی ان کے لیے جو مسلسل روزہ رکھتے ہیں، اور افطار میں کمی ان کے لیے جو روزہ افطار کرتے ہیں۔ کیونکہ آپ صلی اللہ علیہ وسلم نے فرمایا: \"ابن آدم کے لیے چند لقمے کافی ہیں جو اس کی کمر کو سیدھا رکھیں۔\"\n\nپس مرید (المريد) کو اس حد سے تجاوز نہیں کرنا چاہیے جو اس ذات نے مقرر کی ہے جس نے اللہ کی طرف راستے کو مشروع کیا۔ اور تم اس چیز کی قدر نہیں جانو گے جس کی طرف میں نے تمہاری رہنمائی کی ہے، مگر اس کے نتیجے میں، اگر یہاں تمہارے لیے کشف (الکشف) ہو جائے۔\n\nاور روزے کے بغیر بھوکا نہ رہو، کیونکہ یہ شرعی راستہ نہیں ہے۔ اور اس کا سبب روزے کے اجر کی حدیث کو نہ بناؤ، کیونکہ وہ تمہارے لیے نہیں ہے، بلکہ وہ عمل کے لیے ہے۔ اور نفس کو اس اجر کی رغبت کرنے دو جو اسے اس پر ملتا ہے، کیونکہ ان میں سے کچھ ایسے ہیں جو اس کے طالب ہیں۔ اور تم سرِ الٰہی (السر الإلهي) اور روحِ امری (الروح الامري) کے ذریعے اس طلب سے دور ہو جس کی طلب نفسِ حیوانی کرتا ہے۔ کیونکہ تم مجموع (جمع کیے گئے) ہو، اور اس راستے کے غلطی کرنے والوں سے نہ ملو جو اپنے شاگردوں کو روزے کے بغیر بھوکا رکھتے ہیں، یا انہیں روزہ رکھواتے ہیں اور پھر سورج غروب ہونے سے پہلے انہیں کھلا دیتے ہیں۔ یہ ان کی غلطی ہے اور اللہ تعالیٰ کے راستے سے ناواقفیت ہے۔ اگرچہ وہ اس سے نفوس کی مخالفت کا ارادہ رکھتے ہوں، لیکن یہ اس کا مقام نہیں ہے۔\n\nبلکہ انہیں چاہیے کہ وہ نفس کی مخالفت کھانے کی تعیین میں ایک مخصوص حد، ایک معین طریقے اور ایک سیدھے میزان کے مطابق کریں جسے اہلِ حق (أهل الله) جانتے ہیں۔ یہاں تک کہ جب نفس کسی خاص کھانے کی طرف مائل ہو تو اس کی مخالفت کی جائے، تاکہ وہ اللہ کی کسی بھی نعمت کو ناپسند نہ کرے۔ اور میں نے ایک زمانے تک اس پر عمل کیا، یہاں تک کہ ہر وہ چیز میرے لیے خوشگوار ہو گئی جسے میں کھا نہیں سکتا تھا اور میرا نفس اسے ناپسند کرتا تھا۔ اور اسی طرح اس میں کمی کرنے میں بھی (مخالفت کی جائے)، اور یہ نفس پر سب سے زیادہ شاق ہے کہ وہ کسی چیز میں مشغول ہو اور پھر اسے اس سے سیر ہونے سے روک دیا جائے۔ اور اللہ ہی توفیق دینے والا ہے، اس کے سوا کوئی رب نہیں۔",
    "fa": "## باب صد و ششم در معرفت گرسنگی مطلوب\n\nگرسنگی مرگ سفید است *** و آن از نشانه‌های هدایت است\nالجوع موت أبيض *** وهو من أعلام الهدى‏\n\nتا زمانی که جنونی به بار نیاورد *** هم درمان است و هم درد\nما لم يؤثر خبلا *** فهو دواء وهو دا\n\nپس به آن حکم کن تا به واسطه‌ی آن *** موفق و هدایت‌شده باشی\nفاحكم به تكن به *** موفقا مسددا\n\n### [چهار مرگ در طریق اهل الله]\n\nگرسنگی زیور اهل الله است، و منظورم از آن گرسنگی عادت است که همان مرگ سفید (الموت الأبيض) است. زیرا اهل الله در طریق خود چهار مرگ قرار داده‌اند که این یکی از آنهاست. و مرگ سبز (الموت الأخضر) که پوشیدن جامه‌های وصله‌دار (مرقعات) است، مگر آنهایی که شهرت‌آور باشند. عمر بن خطاب جامه‌ای می‌پوشید که سیزده وصله داشت، که یکی از آنها تکه‌ای چرم بود، در حالی که او امیرالمؤمنین بود. و مرگ سیاه (الموت الأسود) که تحمل آزار است. و مرگ سرخ (الموت الأحمر) که مخالفت با نفس در خواسته‌هایش است، و این مخصوص اهل ملامت (اهل الملامية) است.\n\n### [گرسنگی مطلوب برای سالکان]\n\nپس گرسنگی مطلوب در طریق، برای سالکان (سالکین) گرسنگی اختیاری است برای کاهش فضولات طبع و برای طلب سکون از حرکت به سوی نیاز. اگر بالاتر رود، برای طلب صفت صمدیت (الصفة الصمدية) است. حد آن نزد ما روزه یک روز است. اگر بیشتر شود، تا سحر است. این همان گرسنگی مشروع اختیاری است. و ما را راهی به سوی الحق (الحق) نیست مگر بر وجه مشروع. و اگر خداوند این را حد مصلحت در عموم خلق خود قرار نداده بود، آن را به این اندازه محدود نمی‌کرد. پس انسان در زیاده‌روی بر آن، داناتر به مصالح گرسنگی در بنده از پروردگارش نیست؛ این نهایت سوء ادب (سوء الأدب) است. اگر کسی از کسانی باشد که در خوابگاه و حیاطش به او طعام و آب داده می‌شود و اثر آن را در قوت، سلامت عقل و حفظ مزاجش می‌یابد، پس هر چقدر می‌خواهد روزه پیوسته بگیرد، زیرا او صاحب گرسنگی نیست. و سخن ما درباره گرسنگی است، هرچند کسی نیز باشد که حالی و وارد قوی او را فرا گیرد که میان او و طعام حائل شود، مانند ابوعقال. اگر صاحب فایده باشد، همان مطلوب است. و اگر نباشد، آن یک بیماری است که حالش باید بر پزشکان عرضه شود، و آن مطلوب این قوم نیست.\n\n### [گرسنگی بزرگان]\n\nو اما گرسنگی بزرگان (الأكابر)، گرسنگی اضطرار است. زیرا آنچه گرسنگی به بار می‌آورد، برای آنان ملکه‌ای (ملکة) شده است که در حال گرسنگی و سیری از ایشان زایل نمی‌شود. پس جز کم خوردن باقی نمانده است، اما از حلال، یا برای نشاط در طاعات (طاعات) و یا برای سبکی حساب.\n\nزیرا پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «شما در مورد نعمت این روز مورد سؤال قرار خواهید گرفت.»\nإنكم لتسئلون عن نعيم هذا اليوم‏\n\nو آن جز خرما و آب نبود. و او خود را در آن جماعت وارد نکرد. زیرا خداوند بندگانی سلیمانی دارد که خداوند به آنها می‌گوید: «هذا عَطاؤُنا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسابٍ (این عطای ماست، پس [آن را] ببخش یا نگه دار، بدون حساب)» و آنها هفتاد هزار نفر در این امت هستند که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) آنها را وصف کرده است و خبر صحیح است و عکاشه به تصریح در میان آنهاست.\n\n### [ترک عمل به طریق اتباع، پاداشش از عمل به طریق ابتداع بیشتر است]\n\nپس شایسته است که سالک (سالک) صالح از حد مشروع تجاوز نکند تا متبع (پیرو) باشد. زیرا ترک عمل به طریق اتباع (اتباع)، پاداشش از عمل به طریق ابتداع (ابتداع) بیشتر است. چرا که ما به حکم اصل، پیرو هستیم، زیرا وجود ما تابع وجود کسی است که ما را به وجود آورده است. پس باید افعال علما بر این مرتبه و بر این اساس باشد. و هنگامی که\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «شیطان در رگ‌های فرزند آدم مانند خون جریان می‌یابد، پس مجاری او را با گرسنگی و تشنگی ببندید.»\nإن الشيطان يجري من ابن آدم مجرى الدم فسدوا مجاريه بالجوع والعطش‏\n\nهیچ یک از علما و اهل الله (أهل الله) اختلاف نکردند که منظور ایشان روزه و کم خوردن غذا در سحور مسنون برای کسی است که روزه پیوسته می‌گیرد، و در افطار برای کسی است که روزه می‌گشاید. زیرا ایشان فرمودند: «برای فرزند آدم چند لقمه که پشت او را راست نگه دارد، کافی است.» پس مرید (مرید) نباید از حدی که شارع طریق به سوی الحق (الحق) برای او سنت نهاده است، تجاوز کند. و قدر آنچه تو را بدان راهنمایی کردم، نخواهی دانست مگر در نتیجه‌ی آن، اگر در اینجا برایت فتحی (فتح) حاصل شود. و بدون روزه گرسنگی نکش، زیرا آن طریق مشروع نیست. و سبب آن را حدیث پاداش روزه قرار مده، زیرا آن برای تو نیست، بلکه برای عمل است. و بگذار نفس به پاداشی که برای آن دارد رغبت کند، زیرا در میان آنها کسانی هستند که طالب آنند. اما تو به واسطه‌ی سر الهی (السر الإلهي) و روح امری (الروح الامری)، از این طلبی که نفس حیوانی (النفس الحيوانية) می‌طلبد، به دور هستی، زیرا تو مجموع هستی. و به اهل غلط (أهل الغلط) از پیروان این طریق ملحق نشو که شاگردان خود را بدون روزه گرسنه نگه می‌دارند یا آنها را روزه می‌دهند و سپس قبل از غروب آفتاب به آنها طعام می‌دهند. این اشتباهی از جانب آنها و جهل به طریق خدای تعالی است. و اگرچه قصدشان از این کار مخالفت با نفوس باشد، این جایگاه آن نیست. بلکه شایسته است که با نفوس در تعیین خوراک بر حد مخصوص، وجه معین و میزان مستقیمی که اهل الله (أهل الله) آن را می‌شناسند، مخالفت کنند. تا زمانی که نفس به طعام خاصی میل می‌کند، [باید با آن مخالفت کرد] تا جایی که هیچ یک از نعمت‌های خدا را ناخوش ندارد. و من زمانی بر این اساس عمل کردم تا هر چیزی که نمی‌توانستم بخورم و نفسم آن را پس می‌زد، برایم خوشایند شد. و همچنین در کم خوردن آن، که سخت‌ترین چیز بر نفس این است که به چیزی شروع کند و سپس میان او و سیر شدن کامل از آن حائل شوند. و خداوند توفیق‌دهنده است، پروردگاری جز او نیست."
  },
  "page_count": 2
}