{
  "id": 155,
  "title": {
    "ar": "الباب الخامس والخمسون ومائة في معرفة مقام النبوة وأسرارها",
    "en": "Chapter One Hundred and Fifty-Five: Concerning the Gnosis (المعرفة) of the Station of Prophethood (مقام النبوة) and its Mysteries.",
    "ur": "باب ایک سو پچپن: مقام نبوت (مقام النبوة) اور اس کے اسرار کی معرفت میں",
    "fa": "باب صد و پنجاه و پنجم در معرفت مقام نبوت و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الخامس والخمسون ومائة في معرفة مقام النبوة وأسرارها)\n\n\n> بين الولاية والرسالة برزخ *** فيه النبوة حكمها لا يجهل‏\n\n\n> لكنها قسمان إن حققتها *** قسم بتشريع وذاك الأول‏\n\n\n> عند الجميع وثم قسم آخر *** ما فيه تشريع وذاك الأنزل‏\n\n\n> في هذه الدنيا وأما عند ما *** تبدو لنا الأخرى التي هي منزل‏\n\n\n> فيزول تشريع الوجود وحكمه *** وهناك يظهر أن هذا الأفضل‏\n\n\n> وهو الأعم فإنه الأصل الذي *** لله فهو نبأ الولي الأكمل‏\n\n\n### [النبوة نعت إلهى أثبتها في الجناب العالي الاسم السميع‏]\n\n\nالنبوة نعت إلهي يثبتها في الجناب العالي الاسم السميع ويثبت حكمها صفة الأمر الذي في الدعاء المأمور به وإجابة الحق عباده فيما يسألونه فيه فإنها أيضا من الله في حق العبد سؤال إلهي بصفة افعل ولا تفعل ونقول نحن سَمِعْنا وأَطَعْنا ويقول هو سبحانه سمعت وأجبت فإنه قال أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ وصيغة الأمر من العبد في الطلب اغْفِرْ لَنا ارْحَمْنا اعْفُ عَنَّا فَانْصُرْنا واهْدِنَا ارْزُقْنا وشبه ذلك وصيغة النهي من العبد في الدعاء لا تُزِغْ قُلُوبَنا لا تَجْعَلْنا فِتْنَةً لِلْقَوْمِ الظَّالِمِينَ لا تُخْزِنا يَوْمَ الْقِيامَةِ لا تُخْزِنِي يَوْمَ يُبْعَثُونَ‏\n\n\n### [انقطاع الرسالة والنبوة التشريعية وبقاء المبشرات وحكم المجتهدين‏]\n\n\nوليست النبوة بمعقول زائد على هذا الذي ذكرنا إلا أنه لم يطلق على نفسه من ذلك اسما كما أطلق في الولاية فسمى نفسه وليا وما سمي نفسه نبيا مع كونه أخبرنا وسمع دعاءنا فهو من الوجهين بهذه المثابة ولهذا\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم إن الرسالة والنبوة قد انقطعت‏\n\n\nوما انقطعت إلا من وجه خاص انقطع منها مسمى النبي والرسول ولذلك‏\n\n\nقال فلا رسول بعدي ولا نبي‏\n\n\nثم أبقى منها المبشرات وأبقى منها حكم المجتهدين وأزال عنهم الاسم أبقى الحكم وأمر من لا علم له بالحكم الإلهي أن يسأل أهل الذكر فيفتونه بما أداه إليه اجتهادهم وإن اختلفوا كما اختلفت الشرائع لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً وكذلك لكل مجتهد جعل له شرعة من دليله ومنهاجا وهو عين دليله في إثبات الحكم ويحرم عليه العدول عنه وقرر\nالشرع الإلهي ذلك كله فحرم الشافعي عين ما أحله الحنفي وأجاز أبو حنيفة عين ما منعه أحمد بن حنبل فأجاز هذا ما لم يجز هذا فاتفقوا في أشياء واختلفوا في أشياء وكل في هذه الأمة شرع مقرر لنا من عند الله مع علمنا إن مرتبتهم دون مرتبة الرسل الموحى إليهم من عند الله‏\n\n\n### [النبوة من حيث عينها وحكمها ما نسخت وإنما انقطع الوحى الخاص بالرسول والنبي‏]\n\n\nفالنبوة والرسالة من حيث عينها وحكمها ما نسخت وإنما انقطع الوحي الخاص بالرسول والنبي من نزول الملك على أذنه وقلبه وتحجير لفظ اسم النبي والرسول فلا يقال في المجتهد إنه نبي ولا رسول كما حجر الاجتهاد على الأنبياء فيما شرعه والمجتهد وإن كان يرشد الناس بما أداه إليه دليله واجتهاده فلا يطلق عليه هذا الاسم فهو لفظ خاص بالأنبياء والرسل ما هو لله ولا للأولياء بل هو اسم خاص للعبودية التي هي عين القرب من السيد وعدم مزاحمة السيد في رتبته بخلاف الولاية فإن العبد مزاحم له في اسم الولي تعالى ولهذا شق على المستخلصين من العبيد انقطاع اسم النبي واسم الرسول لما كان من خصائصها ولم يكن له في الأسماء الإلهية عين‏\n\n\n### [الواقعة التي رأى فيها ابن عربى الباب السهل المرتقى إليه الصعب النزول عنه‏]\n\n\nوإذا كانت النبوة نعتا إلهيا في أحكامها ومنها أوجب الحق على نفسه ما أوجب لأن الوجوب للشرع ما هو لغير الشرع فقال كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ هذا من حكم الشرع فاعلم ذلك وتثبت في معرفة ما ذكرناه فإنه سهل المرتقى صعب النزول عنه هكذا رأيته في الواقعة ليلة أردت أن أقيد هذا الباب فما تكلمنا في هذا الباب بما تكلمنا به إلا بما شاهدناه في الواقعة ورأينا فيها باب اسم الرسول والنبي مغلقا على يميني والمعراج بإدراجه منه إلى الطريق الشارع الذي يمشي الناس عليه وأنا عند الباب واقف وليس فوق ذلك المقام الذي أوقفني الحق فيه مقام لأحد إلا ما في داخل ذلك المغلق الموثق الغلق ومع غلقه ما ينحجب عني ما وراءه إلا أنه لا قدم لأحد فيه إلا الكشف ولقد طلع إلى شخص فلما وصل بسهولة ورآه توعر عليه النزول وحار ولم يقدر على الثبات فيه فتركني وسلك الطريق الذي عليه جئت أنا إلى ذلك الموضع وراح وتركني راجعا واستيقظت على هذه الحالة فقيدت ما أودعته في هذا الباب‏\n\n\n### [المبشرات من بقايا النبوة التعريفية]\n\n\nورأيت في هذه الليلة رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وهو يكره إدخال الجنازة في المسجد ويكره أيضا أن يستر الميت من الذكران بثوب زائد على كفنه وأمر أن يسلب عنه ويترك على نعشه في كفنه وأن لا يستر في تابوت أصلا وأمرني إذا كان البردان أسخن الماء للغسل من الجنابة ولا أصبح على جنابة ورأيته يشكر على الجماع ويستحسن ذلك من فاعله هذا كله رأيته في هذه الليلة ورأيت أحمد بن حنبل في هذه الليلة وذكرت له أن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أمرني أن أسخن الماء للغسل من الجنابة فقال لي هكذا ذكر البخاري أنه رأى النبي صَلَّى اللهُ عَليهِ وسَلَّم في النوم فأمره بذلك ورأى الفربري البخاري في النوم فأمره بذلك ورآني الفربري في النوم وعلمت أنه رآني في النوم ورأيته أنا في نومه فذكر لي أن البخاري ذكر له هذا فعلمته أنا من قول الفربري وثبت عندي وها أنا في النوم قد قلته لك فاعمل به واستيقظت فأمرت أهلي أن يسخنوا لي ماء واغتسلت مع الفجر وهذه كلها من المبشرات‏\n\n\n### [النبوة المهموزة والنبوة التي هي غير مهموزة]\n\n\nوأما النبوة التي هي غير مهموزة فهي الرفعة ولم يطلق على الله منها اسم ولها في الإله اسم رَفِيعُ الدَّرَجاتِ ذُو الْعَرْشِ يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ ولها أيضا الاسم العلي والأعلى وهي النبوة المهموزة وهي مولدة عن النبوة التي هي الرفعة فالقصر الأصل والمد زيادة أ لا ترى العرب في ضرورة الشعر تجوز قصر الممدود لأنه رجوع إلى الأصل ولا تجوز مد المقصور لأنه خروج عن الأصل والروح بينه تعالى وبين من شاء من عباده بالبشارة والنذارة وللأولياء في هذه النبوة مشرب عظيم كما ذكرنا ولا سيما والنبي صَلَّى اللهُ عَليهِ وسَلَّم قد قال فيمن حفظ القرآن إن النبوة قد أدرجت بين جنبيه‏\n\n\nفإنها له غيب وهي للنبي شهادة\n\n\n### [الوراثة والولاية والنبوة وعلم علماء الرسوم‏]\n\n\nفهذا هو الفرقان بين النبي والولي في النبوة فيقال فيه نبي ويقال في الولي وارث والوراثة نعت إلهي فإنه قال عن نفسه إنه خَيْرُ الْوارِثِينَ فالولي لا يأخذ النبوة من النبي إلا بعد أن يرثها الحق منهم ثم يلقيها إلى الولي ليكون ذلك أتم في حقه حتى ينتسب في ذلك إلى الله لا إلى غيره وبعض الأولياء يأخذونها وراثة عن النبي وهم الصحابة الذين شاهدوه أو من رآه في النوم ثم علماء الرسوم يأخذونها خلفا عن سلف إلى يوم القيامة فيبعد النسب وأما الأولياء فيأخذونها عن الله تعالى من كونه ورثها وجاد بها على هؤلاء فهم أتباع الرسل بمثل هذا السند العالي المحفوظ الذي لا يَأْتِيهِ الْباطِلُ من بَيْنِ يَدَيْهِ ولا من خَلْفِهِ تَنْزِيلٌ من حَكِيمٍ حَمِيدٍ\n\n\n### [أخذ العلم ميتا عن ميت وأخذ العلم عن الحي الذي لا يموت‏]\n\n\nقال أبو يزيد أخذتم علمكم ميتا عن ميت وأخذنا علمنا عن الحي الذي لا يموت قال الله تعالى لنبيه صَلَّى اللهُ عَليهِ وسَلَّم في مثل هذا المقام لما ذكر الأنبياء\nعليهم السلام في سورة الأنعام أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ وكانوا قد ماتوا وورثهم الله وهو خَيْرُ الْوارِثِينَ ثم جاد على النبي صَلَّى اللهُ عَليهِ وسَلَّم بذلك الهدى الذي هداهم به فجعله صَلَّى اللهُ عَليهِ وسَلَّم مقتديا بهداهم والموصل الله ونعم السند ونِعْمَ الْمَوْلى‏ ونِعْمَ النَّصِيرُ وهذا عين ما قلناه في علم الأولياء اليوم بهدى النبي صَلَّى اللهُ عَليهِ وسَلَّم وهدى الأنبياء أخذوه عن الله ألقاه في صدورهم من لدنه رحمة بهم وعناية سبقت لهم عند ربهم كما قال في عبده خضر آتَيْناهُ رَحْمَةً من عِنْدِنا وعَلَّمْناهُ من لَدُنَّا عِلْماً\n\n\n### [النبوة السارية في كل موجود]\n\n\nوهذه النبوة سارية في الحيوان مثل قوله تعالى وأَوْحى‏ رَبُّكَ إِلَى النَّحْلِ وكلهم بهذه المثابة فمن علمه الله منطق الحيوانات وتسبيح النبات والجماد وعلم صلاة كل واحد من المخلوقات وتسبيحه علم إن النبوة سارية في كل موجود يعلم ذلك أهل الكشف والوجود لكنه لا ينطلق من ذلك اسم نبي ولا رسول على واحد منهم إلا على الملائكة خاصة الرسل منهم وهم المسمون ملائكة وكل روح لا يعطي رسالة فهو روح لا يقال فيه ملك إلا مجازا كالأرواح المخلوقة من أنفاس المؤمنين الذاكرين الله يخلق الله من أنفاسهم أرواحا يستغفرون لصاحب ذلك الذكر إلى يوم القيامة وكذلك من أعمالهم كلها المحمودة التي فيها أنفاسهم ولقد رأيته صَلَّى اللهُ عَليهِ وسَلَّم في مبشرة وهو يقول ويشير إلى الكعبة يا ساكني هذا البيت لا تمنعوا أحدا طاف به وصلى في أي وقت شاء من ليل أو نهار فإن الله يخلق له من صلاته ملكا يستغفر له إلى يوم القيامة وهؤلاء كلهم أرواح مطهرة فمن أرسل منهم في أمر سمي ملكا\n\n",
    "en": "Chapter One Hundred and Fifty-Five: Concerning the Knowledge of the Station of Prophethood (مقام النبوة) and its Secrets.\n\nBetween Sainthood (الولاية) and Messengership (الرسالة) is an Isthmus (برزخ),\nWithin it is the ruling of Prophethood (النبوة), which is not unknown.\n\nBut if you verify it, it has two divisions:\nOne division is with legislation (تشريع), and that is the first,\n\n[Known] by all; and then there is another division,\nWhich contains no legislation (تشريع), and that is the lower [in rank]\n\nIn this world (الدنيا); but when\nThe Hereafter (الأخرى) appears to us, which is the [final] dwelling,\n\nThe legislation (تشريع) of Existence (الوجود) and its ruling will vanish,\nAnd there it will become manifest that this [non-legislative type] is the superior.\n\nAnd it is the most general, for it is the Origin (الأصل) which\nBelongs to Allah, and it is the tidings (نبأ) of the Most Perfect Saint (الولي الأكمل).\n\n### [Prophethood (النبوة) is a Divine Attribute established in the High Presence by the Name The All-Hearing (السميع)]\n\nProphethood (النبوة) is a Divine Attribute (نعت إلهي) that the Name The All-Hearing (السميع) establishes in the High Presence (الجناب العالي). Its ruling is established by the Attribute of Command (صفة الأمر) found in the commanded supplication (الدعاء المأمور به) and the response of The Real (الحق) to His servants regarding what they ask of Him. For this [Prophethood] is also, from Allah to the servant, a Divine Question (سؤال إلهي) in the form of \"Do\" and \"Do not do.\" And we say, \"We have heard and we have obeyed (سَمِعْنا وأَطَعْنا).\" And He, Glory be to Him, says, \"I have heard and I have answered.\" For He said: <<أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ>> (I answer the call of the caller when he calls upon Me). The form of command from the servant in the request is: \"Forgive us (اغْفِرْ لَنا),\" \"Have mercy on us (ارْحَمْنا),\" \"Pardon us (اعْفُ عَنَّا),\" \"Grant us victory (فَانْصُرْنا),\" \"Guide us (وَاهْدِنَا),\" \"Provide for us (ارْزُقْنا),\" and similar phrases. The form of prohibition from the servant in the supplication is: <<لا تُزِغْ قُلُوبَنا>> (Do not let our hearts deviate), <<لا تَجْعَلْنا فِتْنَةً لِلْقَوْمِ الظَّالِمِينَ>> (Do not make us a trial for the wrongdoing people), <<لا تُخْزِنا يَوْمَ الْقِيامَةِ>> (Do not disgrace us on the Day of Resurrection), <<لا تُخْزِنِي يَوْمَ يُبْعَثُونَ>> (Do not disgrace me on the Day they are resurrected).\n\n### [The Cessation of Messengership (الرسالة) and Legislative Prophethood (النبوة التشريعية) and the Persistence of Glad Tidings (المبشرات) and the Ruling of the Jurists (المجتهدين)]\n\nProphethood (النبوة) is not an intelligible concept (معقول) added to what we have mentioned, except that He did not apply a Name from it to Himself, as He did in the case of Sainthood (الولاية). Thus, He named Himself the Guardian (ولي), but He did not name Himself the Prophet (نبي), despite the fact that He informed us and heard our supplication. Therefore, He is in this position from both aspects. This is why the Prophet, peace and blessings be upon him, said: \"Indeed, Messengership (الرسالة) and Prophethood (النبوة) have ceased.\"\n\nIt has ceased only from a specific aspect: the designation of Prophet (نبي) and Messenger (رسول) has ceased. That is why he said: \"There is no Messenger after me, nor any Prophet.\"\n\nThen He preserved from it the glad tidings (المبشرات) and preserved from it the ruling of the jurists (المجتهدين), removing the Name from them but preserving the ruling. He commanded those who lack knowledge of the Divine Ruling (الحكم الإلهي) to ask the People of Remembrance (أهل الذكر), who then issue a legal opinion (يفتونه) based on what their independent reasoning (اجتهادهم) led them to, even if they differ, just as the Divine Laws (الشرائع) differed: <<لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً>> (For each of you We have appointed a law [شِرْعَةً] and a way [مِنْهاجاً]).\n\nSimilarly, for every jurist (مجتهد), a law (شرعة) has been appointed for him from his evidence and a way (منهاج), which is the very essence of his evidence in establishing the ruling, and it is forbidden for him to deviate from it. The Divine Law (الشرع الإلهي) confirmed all of this. Thus, Al-Shafi'i forbade the very thing that Al-Hanafi permitted, and Abu Hanifa permitted the very thing that Ahmad ibn Hanbal prohibited. So, one permitted what the other did not permit. They agreed on some matters and differed on others. Yet, everything in this Community (الأمة) is an established law (شرع مقرر) for us from Allah, even though we know that their rank is below the rank of the Messengers (الرسل) who received revelation (الوحي) from Allah.\n\n### [Prophethood (النبوة), in terms of its Essence (عينها) and Ruling (حكمها), has not been abrogated; rather, the specific Revelation (الوحي) belonging to the Messenger (الرسول) and the Prophet (النبي) has ceased]\n\nProphethood (النبوة) and Messengership (الرسالة), in terms of their very essence (عينها) and ruling (حكمها), have not been abrogated (ما نسخت). Rather, what has ceased is the specific Revelation (الوحي) belonging to the Messenger (الرسول) and the Prophet (النبي)—the descent of the Angel upon his ear and heart—and the restriction of the term 'Prophet' (نبي) and 'Messenger' (رسول).\n\nThus, the jurist (مجتهد) is not called a Prophet or a Messenger, just as independent reasoning (الاجتهاد) was restricted for the Prophets regarding what He legislated. Although the jurist guides people according to what his evidence and reasoning led him to, this Name is not applied to him. It is a term specific to the Prophets and Messengers. It does not belong to Allah, nor to the Saints (الأولياء). Rather, it is a Name specific to the servitude (العبودية) which is the very essence of proximity (القرب) to the Master and the absence of rivalry with the Master in His rank. This is unlike Sainthood (الولاية), where the servant rivals Him in the Name of the Guardian (الولي), exalted is He. This is why the cessation of the Name of Prophet and the Name of Messenger was difficult for the purified servants (المستخلصين من العبيد), because it was among their specific characteristics and had no corresponding essence (عين) among the Divine Names (الأسماء الإلهية).\n\n### [The Vision (الواقعة) in which Ibn Arabi saw the Gate that is Easy to Ascend to, but Difficult to Descend From]\n\nSince Prophethood (النبوة) is a Divine Attribute (نعت إلهي) in its rulings, and from it The Real (الحق) made incumbent upon Himself what He made incumbent—because obligation (الوجوب) belongs to the Law (الشرع), not to anything else—He said: <<كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ>> (Your Lord has decreed upon Himself mercy). This is from the ruling of the Law (حكم الشرع).\n\nKnow this and be firm in the knowledge of what we have mentioned, for it is easy to ascend to, but difficult to descend from. This is how I saw it in a vision (الواقعة) the night I intended to record this chapter. We have only spoken in this chapter about what we witnessed in that vision.\n\nIn it, I saw the gate of the Name of the Messenger (الرسول) and the Prophet (النبي) closed on my right, and the ascent (المعراج) with its steps leading from it to the main road (الطريق الشارع) where people walk. I was standing at the gate, and there was no station (مقام) above the station where The Real (الحق) placed me for anyone, except what was inside that closed, tightly sealed [gate]. Despite its closure, what was behind it was not veiled from me, yet no one has a footing (قدم) within it except through Unveiling (الكشف).\n\nIndeed, a person ascended to it, and when he reached it easily and saw it, the descent became difficult for him, and he became confused and could not remain firm in it. So, he left me and took the road by which I had come to that place, and he departed, leaving me returning. I awoke in this state and recorded what I have deposited in this chapter.\n\n### [Glad Tidings (المبشرات) are among the Remnants of Informative Prophethood (النبوة التعريفية)]\n\nI saw the Messenger of Allah, peace and blessings be upon him, in this night. He disliked the entry of the funeral bier (الجنازة) into the mosque, and he also disliked that the deceased males (الذكران) be covered with a cloth exceeding their shroud (كفن). He commanded that it be stripped off and that the body be left on its bier in its shroud, and that it should not be covered in a coffin (تابوت) at all. He commanded me, if the weather was cold (البردان), to heat the water for the ritual bath (الغسل) from major ritual impurity (الجنابة) and not to wake up in a state of major ritual impurity. I saw him expressing gratitude for sexual intercourse (الجماع) and approving of the one who performs it. I saw all of this on that night.\n\nI also saw Ahmad ibn Hanbal that night and mentioned to him that the Messenger of Allah, peace and blessings be upon him, commanded me to heat the water for the ritual bath from major ritual impurity. He told me: \"Bukhari mentioned that he saw the Prophet, peace and blessings be upon him, in a dream and he commanded him to do that. And Al-Farabri saw Al-Bukhari in a dream and he commanded him to do that. And Al-Farabri saw me in a dream, and I knew that he saw me in a dream, and I saw him in his sleep. He mentioned to me that Al-Bukhari mentioned this to him, so I learned it from Al-Farabri's statement, and it became confirmed with me. And here I am, in a dream, telling it to you, so act upon it.\"\n\nI awoke and commanded my family to heat water for me, and I performed the ritual bath at dawn. All of these are among the glad tidings (المبشرات).\n\n### [Prophethood (النبوة) with the Hamza (المهموزة) and Prophethood (النبوة) without the Hamza (غير مهموزة)]\n\nAs for Prophethood (النبوة) which is without the hamza (غير مهموزة), it means elevation (الرفعة). No Name from this has been applied to Allah, though He has a Name related to it: <<رَفِيعُ الدَّرَجاتِ ذُو الْعَرْشِ يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ>> (Exalter of Ranks [رَفِيعُ الدَّرَجاتِ], Possessor of the Throne. He casts the Spirit [الرُّوح] by His command upon whoever He wills of His servants).\n\nIt also has the Name The Most High (العلي) and The Highest (الأعلى). And Prophethood (النبوة) with the hamza (المهموزة)—meaning 'to inform'—is derived from Prophethood (النبوة) which is elevation (الرفعة). The short vowel (القصر) is the origin, and the long vowel (المد) is an addition. Do you not see that the Arabs, in poetic necessity, permit shortening the extended vowel (قصر الممدود) because it is a return to the origin, but they do not permit extending the shortened vowel (مد المقصور) because it is a departure from the origin?\n\nThe Spirit (الروح) is between Him, Exalted is He, and whoever He wills of His servants, through glad tidings (البشارة) and warning (النذارة). The Saints (الأولياء) have a great share (مشرب عظيم) in this Prophethood, as we mentioned, especially since the Prophet, peace and blessings be upon him, said concerning the one who memorizes the Quran: \"Prophethood (النبوة) has been folded between his sides.\"\n\nFor him [the memorizer], it is unseen (غيب), but for the Prophet, it is witnessing (شهادة).\n\n### [Inheritance (الوراثة), Sainthood (الولاية), Prophethood (النبوة), and the Knowledge of the Scholars of External Forms (علماء الرسوم)]\n\nThis, then, is the distinction (الفرقان) between the Prophet (النبي) and the Saint (الولي) regarding Prophethood (النبوة). The former is called a Prophet, while the Saint is called an Inheritor (وارث). Inheritance (الوراثة) is a Divine Attribute (نعت إلهي), for He said of Himself that He is <<خَيْرُ الْوارِثِينَ>> (The Best of Inheritors).\n\nThe Saint (الولي) does not take Prophethood (النبوة) from the Prophet until The Real (الحق) inherits it from them first, and then casts it upon the Saint. This is so that it may be more complete in the Saint’s right, allowing him to attribute it to Allah and not to anyone else.\n\nSome Saints take it as an inheritance (وراثة) directly from the Prophet—these are the Companions who witnessed him, or those who see him in a dream. Then, the Scholars of External Forms (علماء الرسوم) take it, succeeding one generation after another until the Day of Resurrection, making the lineage distant.\n\nAs for the Saints (الأولياء), they take it from Allah, Exalted is He, by virtue of His having inherited it and bestowed it generously upon them. Thus, they are the followers of the Messengers (الرسل) through this high, preserved chain of transmission (السند العالي المحفوظ), <<لا يَأْتِيهِ الْباطِلُ من بَيْنِ يَدَيْهِ ولا من خَلْفِهِ تَنْزِيلٌ من حَكِيمٍ حَمِيدٍ>> (Falsehood cannot approach it from before it or from behind it; [it is] a revelation from One Wise and Praiseworthy).\n\n### [Taking Knowledge (العلم) from the Dead about the Dead, and Taking Knowledge from the Living Who Never Dies]\n\nAbu Yazid said: \"You took your knowledge (علمكم) from the dead about the dead, and we took our knowledge from the Living Who never dies.\"\n\nAllah, Exalted is He, said to His Prophet, peace and blessings be upon him, concerning a similar station, when mentioning the Prophets, peace be upon them, in Surat Al-An'am: <<أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ>> (Those are the ones whom Allah has guided; so follow their guidance). They had already died, and Allah inherited them, for He is <<خَيْرُ الْوارِثِينَ>> (The Best of Inheritors). Then He bestowed generously upon the Prophet, peace and blessings be upon him, that guidance (الهدى) with which He had guided them, making the Prophet, peace and blessings be upon him, an emulator of their guidance. The One Who conveys is Allah, and what an excellent chain of transmission (السند), and <<نِعْمَ الْمَوْلى‏ ونِعْمَ النَّصِيرُ>> (What an excellent Protector and what an excellent Helper).\n\nThis is the very essence of what we said regarding the knowledge (علم) of the Saints (الأولياء) today concerning the guidance of the Prophet, peace and blessings be upon him, and the guidance of the Prophets: they took it from Allah, Who cast it into their hearts from His Presence (من لدنه), as a mercy to them and a prior care (عناية سبقت) destined for them by their Lord, just as He said concerning His servant Khidr: <<آتَيْناهُ رَحْمَةً من عِنْدِنا وعَلَّمْناهُ من لَدُنَّا عِلْماً>> (We gave him mercy from Our Presence and taught him knowledge from Our Own).\n\n### [The Prophethood (النبوة) that Pervades Every Existing Thing (موجود)]\n\nThis Prophethood (النبوة) pervades the animal kingdom, such as His saying, Exalted is He: <<وأَوْحى‏ رَبُّكَ إِلَى النَّحْلِ>> (And your Lord inspired [أَوْحى] the bee). All of creation is in this position.\n\nWhoever Allah teaches the language of animals (منطق الحيوانات), the glorification (تسبيح) of plants and inanimate objects (الجماد), and the knowledge of the prayer (صلاة) and glorification of every single creature, knows that Prophethood (النبوة) pervades every existing thing (موجود). The People of Unveiling (أهل الكشف) and Existence (الوجود) know this.\n\nHowever, the name Prophet (نبي) or Messenger (رسول) is not applied to any of them, except specifically to the Angels (الملائكة) who are Messengers (الرسل) among them, and they are called Angels (ملائكة).\n\nEvery spirit (روح) that is not given a message is a spirit that is not called an Angel (ملك) except metaphorically, such as the spirits created from the breaths of the believing servants (المؤمنين) who remember Allah. Allah creates spirits from their breaths that seek forgiveness for the person performing that remembrance until the Day of Resurrection. The same applies to all their praiseworthy deeds that contain their breaths.\n\nI saw the Prophet, peace and blessings be upon him, in a glad tidings vision (مبشرة), and he was saying, pointing to the Kaaba: \"O dwellers of this House! Do not prevent anyone from circumambulating it (طاف به) or praying in it at any time they wish, night or day. For Allah creates for him, from his prayer, an Angel (ملك) who seeks forgiveness for him until the Day of Resurrection.\"\n\nAll of these are purified spirits (أرواح مطهرة). Whoever among them is sent on a mission is called an Angel.",
    "ur": "(باب ایک سو پچپن: مقام نبوت اور اس کے اسرار کی معرفت میں)\n\nولایت (الولایۃ) اور رسالت (الرسالۃ) کے درمیان ایک برزخ (البرزخ) ہے،\nجس میں نبوت (النبوۃ) کا حکم ہے، جو نامعلوم نہیں ہے۔\nلیکن اگر تم اس کی حقیقت جانو تو وہ دو قسم کی ہے:\nایک قسم تشریع (التشریع) کے ساتھ ہے، اور وہ پہلی ہے۔\nسب کے نزدیک، اور پھر ایک دوسری قسم ہے،\nجس میں تشریع نہیں ہے، اور وہ اس دنیا میں سب سے نچلی ہے۔\nلیکن جب ہمارے سامنے آخرت ظاہر ہوگی، جو کہ اصل ٹھکانہ ہے،\nتو ہستی (الوجود) کی تشریع اور اس کا حکم زائل ہو جائے گا،\nاور وہاں یہ ظاہر ہوگا کہ یہ (دوسری قسم) افضل ہے۔\nاور یہ زیادہ عام ہے، کیونکہ یہ وہ اصل ہے جو\nاللہ کے لیے ہے، پس یہ ولی اکمل (الولی الأکمل) کی خبر ہے۔\n\n### [نبوت (النبوۃ) ایک الٰہی صفت ہے جسے اسم سمیع (الاسم السمیع) ذات حق (الحق) میں ثابت کرتا ہے]\n\nنبوت (النبوۃ) ایک الٰہی صفت ہے جسے اسم سمیع (الاسم السمیع) ذات حق (الحق) میں ثابت کرتا ہے، اور اس کے حکم کو صفتِ امر ثابت کرتی ہے جو اس دعا میں ہے جس کا حکم دیا گیا ہے، اور اس میں ذات حق (الحق) کا اپنے بندوں کی ان چیزوں میں اجابت کرنا ہے جو وہ مانگتے ہیں۔ کیونکہ یہ بھی اللہ کی طرف سے بندے کے حق میں ایک الٰہی سوال ہے، \"کر\" اور \"نہ کر\" کی صفت کے ساتھ۔ اور ہم کہتے ہیں: \"ہم نے سنا اور اطاعت کی (سَمِعْنا وأَطَعْنا)\"، اور وہ سبحانہ کہتے ہیں: \"میں نے سنا اور قبول کیا (سمعت وأجبت)\"۔ کیونکہ اس نے فرمایا: \"میں پکارنے والے کی پکار کا جواب دیتا ہوں جب وہ مجھے پکارتا ہے (أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ)\"۔ اور بندے کی طرف سے طلب میں امر کا صیغہ یہ ہے: \"ہمیں بخش دے (اغْفِرْ لَنا)، ہم پر رحم کر (ارْحَمْنا)، ہم سے درگزر کر (اعْفُ عَنَّا)، پس ہماری مدد کر (فَانْصُرْنا)، اور ہمیں ہدایت دے (واهْدِينَا)، ہمیں رزق دے (ارْزُقْنا)\" اور اسی طرح کے دیگر صیغے۔ اور بندے کی طرف سے دعا میں نہی کا صیغہ یہ ہے: \"ہمارے دلوں کو ٹیڑھا نہ کر (لا تُزِغْ قُلُوبَنا)، ہمیں ظالم قوم کے لیے فتنہ نہ بنا (لا تَجْعَلْنا فِتْنَةً لِلْقَوْمِ الظَّالِمِينَ)، ہمیں قیامت کے دن رسوا نہ کر (لا تُخْزِنا يَوْمَ الْقِيامَةِ)، جس دن لوگ اٹھائے جائیں گے مجھے رسوا نہ کرنا (لا تُخْزِنِي يَوْمَ يُبْعَثُونَ)\"۔\n\n### [رسالت (الرسالۃ) اور نبوت تشریعیہ (النبوۃ التشریعیۃ) کا انقطاع اور مبشرات (المبشرات) اور مجتہدین کے حکم کا باقی رہنا]\n\nنبوت (النبوۃ) اس ذکر کردہ چیز کے علاوہ کوئی زائد معقول نہیں ہے، سوائے اس کے کہ ذات حق (الحق) نے اپنے لیے اس میں سے کوئی نام استعمال نہیں کیا جیسا کہ ولایت (الولایۃ) میں کیا، پس اس نے خود کو ولی (الولی) کہا، لیکن خود کو نبی (النبی) نہیں کہا، باوجود اس کے کہ اس نے ہمیں خبر دی اور ہماری دعا سنی۔ پس وہ دونوں پہلوؤں سے اسی مقام پر ہے۔ اور اسی لیے نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"رسالت (الرسالۃ) اور نبوت (النبوۃ) منقطع ہو چکی ہے (إن الرسالة والنبوة قد انقطعت)\"۔ اور یہ منقطع نہیں ہوئی مگر ایک خاص پہلو سے، یعنی نبی (النبی) اور رسول (الرسول) کا نام منقطع ہو گیا ہے۔ اور اسی لیے آپ صلی اللہ علیہ وسلم نے فرمایا: \"میرے بعد کوئی رسول نہیں اور نہ کوئی نبی (فلا رسول بعدي ولا نبي)\"۔ پھر آپ نے اس میں سے مبشرات (المبشرات) کو باقی رکھا، اور اس میں سے مجتہدین (المجتہدین) کے حکم کو باقی رکھا، اور ان سے نام کو ہٹا دیا، لیکن حکم کو باقی رکھا۔ اور جس شخص کو حکم الٰہی کا علم نہ ہو، اسے حکم دیا کہ وہ اہل ذکر سے پوچھے، تو وہ اسے اس چیز کا فتویٰ دیں جو ان کے اجتہاد (الاجتہاد) نے انہیں پہنچایا ہو، اگرچہ وہ اختلاف کریں، جیسا کہ شرائع میں اختلاف ہوا: \"ہم نے تم میں سے ہر ایک کے لیے ایک شریعت اور ایک طریقہ مقرر کیا ہے (لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً)\"۔ اسی طرح ہر مجتہد کے لیے اس کی دلیل سے ایک شریعت اور ایک طریقہ مقرر کیا گیا ہے، اور وہ حکم کے اثبات میں اس کی دلیل کا عین ہے، اور اس کے لیے اس سے انحراف حرام ہے۔ اور شرع الٰہی نے اس سب کو مقرر کیا، چنانچہ شافعی نے عین اسی چیز کو حرام قرار دیا جسے حنفی نے حلال کیا، اور ابو حنیفہ نے عین اسی چیز کو جائز قرار دیا جسے احمد بن حنبل نے منع کیا، پس ایک نے وہ جائز قرار دیا جو دوسرے نے جائز نہیں قرار دیا۔ چنانچہ وہ کچھ چیزوں میں متفق ہوئے اور کچھ چیزوں میں مختلف، اور اس امت میں ہر ایک چیز ہمارے لیے اللہ کی طرف سے مقرر کردہ شریعت ہے، باوجود اس علم کے کہ ان کا مرتبہ ان رسولوں کے مرتبے سے کم ہے جن پر اللہ کی طرف سے وحی نازل ہوتی ہے۔\n\n### [نبوت (النبوۃ) اپنی ذات اور حکم کے اعتبار سے منسوخ نہیں ہوئی، بلکہ صرف رسول (الرسول) اور نبی (النبی) کے ساتھ خاص وحی منقطع ہوئی ہے]\n\nپس نبوت (النبوۃ) اور رسالت (الرسالۃ) اپنی ذات اور حکم کے اعتبار سے منسوخ نہیں ہوئیں، بلکہ صرف رسول (الرسول) اور نبی (النبی) کے ساتھ خاص وحی منقطع ہوئی ہے، یعنی فرشتے کا ان کے کان اور دل پر نازل ہونا، اور نبی (النبی) اور رسول (الرسول) کے نام کے لفظ کو محدود کر دیا گیا ہے۔ چنانچہ مجتہد (المجتہد) کے بارے میں یہ نہیں کہا جاتا کہ وہ نبی ہے اور نہ رسول، جیسا کہ انبیاء (الأنبیاء) پر ان چیزوں میں اجتہاد (الاجتہاد) کو محدود کر دیا گیا جو انہوں نے مشروع کیں۔ اور مجتہد اگرچہ لوگوں کی رہنمائی اس چیز سے کرتا ہے جو اس کی دلیل اور اجتہاد نے اسے پہنچایا ہو، لیکن اس پر یہ نام نہیں بولا جاتا۔ پس یہ انبیاء (الأنبیاء) اور رسولوں (الرسل) کے ساتھ خاص لفظ ہے، یہ نہ اللہ کے لیے ہے اور نہ اولیاء (الأولیاء) کے لیے، بلکہ یہ بندگی (العبودیۃ) کے ساتھ خاص نام ہے جو آقا سے قربت کا عین ہے اور آقا کے مرتبے میں مزاحمت نہ کرنا ہے۔ برخلاف ولایت (الولایۃ) کے، کیونکہ بندہ اسم ولی (الولی) میں ذات حق (الحق) کے ساتھ مزاحمت کرتا ہے۔ اور اسی لیے مخلص بندوں پر نبی (النبی) اور رسول (الرسول) کے نام کا انقطاع شاق گزرا، کیونکہ یہ ان کی خصوصیات میں سے تھا اور اس کا الٰہی اسماء میں کوئی عین نہیں تھا۔\n\n### [وہ واقعہ جس میں ابن عربی نے وہ دروازہ دیکھا جس پر چڑھنا آسان تھا مگر اس سے اترنا مشکل تھا]\n\nاور جب نبوت (النبوۃ) اپنے احکام میں ایک الٰہی صفت ہے، اور اسی میں سے ذات حق (الحق) نے اپنے اوپر وہ چیز واجب کی جو واجب کی، کیونکہ وجوب شریعت کے لیے ہے نہ کہ غیر شریعت کے لیے۔ پس اس نے فرمایا: \"تمہارے رب نے اپنے اوپر رحمت لازم کر لی ہے (كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ)\"۔ یہ شرع کے حکم میں سے ہے۔ پس اس کو جان لو اور جو کچھ ہم نے ذکر کیا ہے اس کی معرفت میں ثابت قدم رہو، کیونکہ اس پر چڑھنا آسان ہے مگر اس سے اترنا مشکل ہے۔ میں نے اسے واقعہ (الواقعۃ) میں اسی طرح دیکھا تھا، جس رات میں نے اس باب کو قلمبند کرنے کا ارادہ کیا۔ پس ہم نے اس باب میں جو کچھ کہا ہے وہ صرف اسی مشاہدے کی بنا پر کہا ہے جو ہم نے واقعہ (الواقعۃ) میں دیکھا۔ اور ہم نے اس میں رسول (الرسول) اور نبی (النبی) کے نام کا دروازہ اپنے دائیں طرف بند دیکھا، اور اس سے سیڑھیوں کے ذریعے اس عام راستے کی طرف معراج تھی جس پر لوگ چلتے ہیں۔ اور میں دروازے کے پاس کھڑا تھا، اور اس مقام سے اوپر کوئی مقام کسی کے لیے نہیں تھا جہاں ذات حق (الحق) نے مجھے کھڑا کیا تھا، سوائے اس کے جو اس مضبوطی سے بند دروازے کے اندر تھا۔ اور اس کے بند ہونے کے باوجود، اس کے پیچھے کی چیز مجھ سے پوشیدہ نہیں تھی، لیکن اس میں کسی کا قدم نہیں تھا سوائے کشف (الکشف) کے۔ اور ایک شخص میرے پاس چڑھا، پس جب وہ آسانی سے پہنچا اور اسے دیکھا تو اس پر اترنا مشکل ہو گیا اور وہ حیران ہو گیا اور اس میں ثابت قدم نہ رہ سکا، پس اس نے مجھے چھوڑ دیا اور اس راستے پر چل پڑا جس پر میں اس جگہ آیا تھا، اور وہ چلا گیا اور مجھے واپس لوٹتا ہوا چھوڑ دیا۔ اور میں اسی حالت پر بیدار ہوا، پس میں نے وہ سب کچھ قلمبند کر لیا جو میں نے اس باب میں ودیعت کیا ہے۔\n\n### [نبوت تعریفیہ (النبوۃ التعریفیۃ) کے باقیات میں سے مبشرات (المبشرات)]\n\nاور میں نے اسی رات رسول اللہ صلی اللہ علیہ وسلم کو دیکھا، اور آپ صلی اللہ علیہ وسلم جنازے کو مسجد میں داخل کرنے کو ناپسند فرما رہے تھے، اور یہ بھی ناپسند فرما رہے تھے کہ مردوں میں سے میت کو کفن کے علاوہ کسی زائد کپڑے سے ڈھانپا جائے، اور آپ نے حکم دیا کہ وہ کپڑا اتار لیا جائے اور اسے اس کی چارپائی پر کفن میں ہی چھوڑ دیا جائے، اور اسے تابوت میں بالکل نہ ڈھانپا جائے۔ اور آپ نے مجھے حکم دیا کہ جب دو ٹھنڈکیں (صبح و شام) ہوں تو غسل جنابت کے لیے پانی گرم کروں اور جنابت کی حالت میں صبح نہ کروں۔ اور میں نے آپ کو جماع پر شکر ادا کرتے ہوئے دیکھا اور اس کے کرنے والے کو سراہتے ہوئے دیکھا۔ یہ سب کچھ میں نے اسی رات دیکھا۔ اور میں نے اسی رات احمد بن حنبل کو دیکھا، اور میں نے ان سے ذکر کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے حکم دیا ہے کہ غسل جنابت کے لیے پانی گرم کروں۔ تو انہوں نے مجھ سے کہا: \"بخاری نے اسی طرح ذکر کیا ہے کہ انہوں نے نبی صلی اللہ علیہ وسلم کو خواب میں دیکھا تو آپ نے انہیں اس کا حکم دیا، اور فرَبری نے بخاری کو خواب میں دیکھا تو انہوں نے اسے اس کا حکم دیا، اور فرَبری نے مجھے خواب میں دیکھا، اور میں جانتا تھا کہ اس نے مجھے خواب میں دیکھا ہے، اور میں نے اسے اس کے خواب میں دیکھا، تو اس نے مجھ سے ذکر کیا کہ بخاری نے اسے یہ بات بتائی تھی، پس میں نے اسے فرَبری کے قول سے جانا اور یہ میرے نزدیک ثابت ہو گیا۔ اور اب میں نے خواب میں یہ بات تم سے کہی ہے، پس اس پر عمل کرو۔\" اور میں بیدار ہوا تو میں نے اپنے گھر والوں کو حکم دیا کہ میرے لیے پانی گرم کریں اور میں نے فجر کے وقت غسل کیا، اور یہ سب مبشرات (المبشرات) میں سے ہیں۔\n\n### [ہمزہ والی نبوت (النبوۃ المہموزۃ) اور وہ نبوت جو ہمزہ کے بغیر ہے]\n\nاور وہ نبوت (النبوۃ) جو ہمزہ کے بغیر ہے، وہ رفعت (بلندی) ہے، اور اللہ پر اس میں سے کوئی نام نہیں بولا گیا، لیکن ذات حق (الحق) میں اس کے لیے یہ نام ہے: \"بلند درجات والا، عرش کا مالک، اپنے حکم سے روح کو اپنے بندوں میں سے جس پر چاہتا ہے نازل کرتا ہے (رَفِيعُ الدَّرَجاتِ ذُو الْعَرْشِ يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ)\"۔ اور اس کے لیے اسم العلی (العلی) اور الأعلی (الأعلی) بھی ہے۔ اور وہ نبوت (النبوۃ) جو ہمزہ والی ہے، وہ اس نبوت سے پیدا ہوئی ہے جو رفعت ہے۔ پس قصر (چھوٹا کرنا) اصل ہے اور مد (لمبا کرنا) اضافہ ہے۔ کیا تم نہیں دیکھتے کہ عرب شعر کی ضرورت میں ممدود کو قصر کرنا جائز سمجھتے ہیں کیونکہ یہ اصل کی طرف رجوع ہے، اور مقصور کو مد کرنا جائز نہیں سمجھتے کیونکہ یہ اصل سے خروج ہے۔ اور روح ذات حق (الحق) اور اس کے بندوں میں سے جس پر وہ چاہتا ہے، بشارت اور ڈرانے کے ذریعے رابطہ قائم کرتی ہے۔ اور اولیاء (الأولیاء) کے لیے اس نبوت میں ایک عظیم حصہ ہے جیسا کہ ہم نے ذکر کیا، خاص طور پر جب نبی صلی اللہ علیہ وسلم نے قرآن حفظ کرنے والے کے بارے میں فرمایا: \"نبوت (النبوۃ) اس کے پہلوؤں کے درمیان داخل کر دی گئی ہے (إن النبوة قد أدرجت بين جنبيه)\"۔ پس یہ اس (ولی) کے لیے غیب ہے، اور نبی (النبی) کے لیے شہود (الشہود) ہے۔\n\n### [وراثت (الوراثۃ)، ولایت (الولایۃ)، نبوت (النبوۃ) اور علماء رسوم کا علم]\n\nپس نبوت (النبوۃ) میں نبی (النبی) اور ولی (الولی) کے درمیان یہی فرق ہے، کہ نبی کے بارے میں کہا جاتا ہے کہ وہ نبی ہے، اور ولی کے بارے میں کہا جاتا ہے کہ وہ وارث ہے۔ اور وراثت (الوراثۃ) ایک الٰہی صفت ہے، کیونکہ اس نے اپنے بارے میں فرمایا: \"وہ بہترین وارث ہے (خَيْرُ الْوارِثِينَ)\"۔ پس ولی (الولی) نبی (النبی) سے نبوت (النبوۃ) نہیں لیتا مگر اس کے بعد کہ ذات حق (الحق) ان سے اس کا وارث ہو جائے، پھر اسے ولی کی طرف القا کرے، تاکہ یہ اس کے حق میں زیادہ مکمل ہو جائے، یہاں تک کہ وہ اس میں اللہ کی طرف منسوب ہو، نہ کہ کسی اور کی طرف۔ اور بعض اولیاء (الأولیاء) اسے نبی سے وراثت میں لیتے ہیں، اور وہ صحابہ ہیں جنہوں نے آپ کو دیکھا، یا وہ جنہوں نے آپ کو خواب میں دیکھا۔ پھر علماء رسوم (علماء الرسوم) اسے قیامت تک سلف سے خلف کے طور پر لیتے ہیں، تو نسبت دور ہو جاتی ہے۔ لیکن اولیاء (الأولیاء) اسے اللہ تعالیٰ سے لیتے ہیں، اس حیثیت سے کہ اللہ اس کا وارث ہوا اور ان پر اس کا فیض کیا۔ پس وہ رسولوں کے پیروکار ہیں اس عالی اور محفوظ سند کے ساتھ: \"جس کے پاس باطل نہ اس کے آگے سے آ سکتا ہے اور نہ اس کے پیچھے سے، یہ حکمت والے، قابل تعریف ہستی کی طرف سے نازل کردہ ہے (لا يَأْتِيهِ الْباطِلُ من بَيْنِ يَدَيْهِ ولا من خَلْفِهِ تَنْزِيلٌ من حَكِيمٍ حَمِيدٍ)\"۔\n\n### [مردہ سے مردہ کا علم لینا اور اس زندہ سے علم لینا جو کبھی نہیں مرتا]\n\nابو یزید نے کہا: \"تم نے اپنا علم مردہ سے مردہ کے ذریعے لیا، اور ہم نے اپنا علم اس زندہ سے لیا جو کبھی نہیں مرتا (أخذتم علمكم ميتا عن ميت وأخذنا علمنا عن الحي الذي لا يموت)\"۔ اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم سے اسی مقام پر فرمایا، جب سورۃ الانعام میں انبیاء علیہم السلام کا ذکر کیا: \"یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی، پس آپ ان کی ہدایت کی پیروی کریں (أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ)\"۔ اور وہ (انبیاء) وفات پا چکے تھے، اور اللہ ان کا وارث ہوا، اور وہ بہترین وارث ہے (خَيْرُ الْوارِثِينَ)۔ پھر اس نے نبی صلی اللہ علیہ وسلم پر اس ہدایت کا فیض کیا جس سے اس نے انہیں ہدایت دی تھی، پس آپ صلی اللہ علیہ وسلم کو ان کی ہدایت کی پیروی کرنے والا بنا دیا، اور پہنچانے والا اللہ ہے، اور کیا ہی خوب سند ہے، اور کیا ہی خوب آقا اور کیا ہی خوب مددگار ہے (ونِعْمَ الْمَوْلى‏ ونِعْمَ النَّصِيرُ)۔ اور یہ عین وہی بات ہے جو ہم نے آج اولیاء (الأولیاء) کے علم کے بارے میں کہی ہے، کہ انہوں نے نبی صلی اللہ علیہ وسلم کی ہدایت اور انبیاء کی ہدایت کو اللہ سے لیا، جسے اس نے ان پر رحمت اور سابقہ عنایت کے طور پر ان کے سینوں میں القا کیا، جیسا کہ اس نے اپنے بندے خضر کے بارے میں فرمایا: \"ہم نے اسے اپنی طرف سے رحمت عطا کی اور اسے اپنے پاس سے علم سکھایا (آتَيْناهُ رَحْمَةً من عِنْدِنا وعَلَّمْناهُ من لَدُنَّا عِلْماً)\"۔\n\n### [وہ نبوت (النبوۃ) جو ہر موجود میں جاری و ساری ہے]\n\nاور یہ نبوت (النبوۃ) حیوانات میں بھی جاری و ساری ہے، جیسا کہ اللہ تعالیٰ کا فرمان ہے: \"اور آپ کے رب نے شہد کی مکھی کو وحی کی (وَأَوْحَى رَبُّكَ إِلَى النَّحْلِ)\"۔ اور یہ سب اسی مقام پر ہیں۔ پس جس شخص کو اللہ نے حیوانات کی بولی، نباتات اور جمادات کی تسبیح سکھا دی، اور مخلوقات میں سے ہر ایک کی نماز اور تسبیح کا علم دے دیا، تو وہ جانتا ہے کہ نبوت (النبوۃ) ہر موجود میں جاری و ساری ہے۔ اس بات کو اہل کشف (أهل الکشف) اور اہل ہستی (أهل الوجود) جانتے ہیں، لیکن ان میں سے کسی پر بھی نبی (النبی) یا رسول (الرسول) کا نام نہیں بولا جاتا، سوائے فرشتوں کے، خاص طور پر ان میں سے جو رسول ہیں، اور جنہیں ملائکہ کہا جاتا ہے۔ اور ہر وہ روح جسے رسالت نہیں دی جاتی، وہ روح ہے جسے مجازاً ہی ملک (فرشتہ) کہا جاتا ہے، جیسے کہ وہ ارواح جو اللہ کا ذکر کرنے والے مومنین کے سانسوں سے پیدا ہوتی ہیں۔ اللہ ان کے سانسوں سے ایسی ارواح پیدا کرتا ہے جو اس ذکر کرنے والے کے لیے قیامت تک استغفار کرتی ہیں۔ اور اسی طرح ان کے تمام قابل تعریف اعمال سے بھی جن میں ان کے سانس شامل ہیں۔ اور میں نے آپ صلی اللہ علیہ وسلم کو ایک مبشرہ (خوشخبری والے خواب) میں دیکھا، آپ کعبہ کی طرف اشارہ کرتے ہوئے فرما رہے تھے: \"اے اس گھر کے رہنے والو! کسی کو بھی اس کا طواف کرنے اور رات یا دن کے جس وقت چاہے نماز پڑھنے سے نہ روکو، کیونکہ اللہ اس کی نماز سے ایک فرشتہ پیدا کرتا ہے جو قیامت تک اس کے لیے استغفار کرتا ہے۔\" اور یہ سب پاکیزہ ارواح ہیں، پس ان میں سے جسے کسی کام کے لیے بھیجا جاتا ہے، اسے ملک (فرشتہ) کہا جاتا ہے۔",
    "fa": "(باب صد و پنجاه و پنجم در معرفت مقام نبوت (النبوة) و اسرار آن)\n\nمیان ولایت (الولایة) و رسالت (الرسالة) برزخی است *** که حکم نبوت (النبوة) در آن مجهول نیست.\nاما اگر آن را تحقیق کنی، دو بخش است: *** بخشی با تشریع (التشریع) است و آن اولی است.\nنزد همگان، و سپس بخش دیگری است *** که در آن تشریعی نیست و آن فروتر است.\nدر این دنیا؛ اما هنگامی که *** آخرت برای ما آشکار شود که منزلگاه است،\nتشریع (التشریع) هستی (الوجود) و حکم آن زائل می‌شود *** و آنجا آشکار می‌گردد که این (قسم دوم) برتر است.\nو آن عام‌تر است، زیرا آن اصلی است که *** از آنِ حق (الحق) است، پس آن خبر ولیّ کامل (الولي الأكمل) است.\n\n### [نبوت (النبوة) وصفی الهی است که اسم سمیع (السمیع) آن را در ساحت عالی اثبات می‌کند]\n\nنبوت (النبوة) وصفی الهی است که اسم سمیع (السمیع) آن را در ساحت عالی اثبات می‌کند و حکم آن را صفت امر که در دعای مأمور به است، و اجابت حق (الحق) بندگانش را در آنچه از او می‌خواهند، اثبات می‌نماید. زیرا نبوت (النبوة) نیز از جانب خداوند در حق بنده، سؤال الهی است با صفت «بکن» و «نکن». و ما می‌گوییم: «شنیدیم و اطاعت کردیم» (سَمِعْنا وأَطَعْنا) و او سبحانه می‌فرماید: «شنیدم و اجابت کردم». زیرا فرمود: «دعای دعا کننده را هنگامی که مرا بخواند، اجابت می‌کنم» (أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ). و صیغه امر از بنده در طلب این است: «ما را بیامرز، به ما رحم کن، از ما درگذر، پس ما را یاری کن، و ما را هدایت کن، به ما روزی ده» (اغْفِرْ لَنا ارْحَمْنا اعْفُ عَنَّا فَانْصُرْنا واهْدِنَا ارْزُقْنا) و مانند آن. و صیغه نهی از بنده در دعا این است: «دل‌های ما را منحرف مگردان» (لا تُزِغْ قُلُوبَنا)، «ما را مایه فتنه برای قوم ستمکار قرار مده» (لا تَجْعَلْنا فِتْنَةً لِلْقَوْمِ الظَّالِمِينَ)، «ما را در روز قیامت رسوا مکن» (لا تُخْزِنا يَوْمَ الْقِيامَةِ)، «مرا در روزی که برانگیخته می‌شوند، رسوا مکن» (لا تُخْزِنِي يَوْمَ يُبْعَثُونَ).\n\n### [انقطاع رسالت (الرسالة) و نبوت (النبوة) تشریعی و بقای مبشرات (المبشرات) و حکم مجتهدین]\n\nنبوت (النبوة) مفهومی افزون بر آنچه ذکر کردیم نیست، جز اینکه خداوند از آن اسمی بر خود اطلاق نکرده است، چنانکه در ولایت (الولایة) اطلاق کرد و خود را ولی (الولي) نامید، اما خود را نبی (النبي) ننامید. با وجود اینکه او ما را خبر داده و دعای ما را شنیده است، پس از هر دو جهت در این جایگاه است. و به همین دلیل پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «رسالت (الرسالة) و نبوت (النبوة) قطع شده است.» و قطع نشد مگر از وجهی خاص که نام نبی (النبي) و رسول (الرسول) از آن قطع شد. و به همین دلیل فرمود: «پس از من رسولی نیست و نه نبی‌ای.» سپس مبشرات (المبشرات) را از آن باقی گذاشت و حکم مجتهدین را از آن باقی نهاد و اسم را از آنان برداشت، اما حکم را باقی گذاشت. و به کسی که علم به حکم الهی ندارد، امر کرد که از اهل ذکر بپرسد تا آنان بر اساس آنچه اجتهادشان به آن رسیده، فتوا دهند، اگرچه اختلاف کنند، چنانکه شرایع مختلف بودند: «برای هر یک از شما شریعت و راهی قرار دادیم» (لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً). و همچنین برای هر مجتهدی، شریعتی از دلیلش و راهی قرار داده شده که عین دلیل او در اثبات حکم است و عدول از آن بر او حرام است. و شرع الهی همه این‌ها را مقرر کرد. پس شافعی عین چیزی را که حنفی حلال دانسته، حرام کرد و ابوحنیفه عین چیزی را که احمد بن حنبل منع کرده، جایز دانست. پس این، چیزی را جایز دانست که آن دیگری جایز ندانست. در نتیجه در اموری توافق کردند و در اموری اختلاف ورزیدند. و هر یک از این‌ها در این امت، شریعتی مقرر شده از جانب خداوند برای ماست، با علم به اینکه مرتبه آنان پایین‌تر از مرتبه رسولانی است که از جانب خداوند به آنان وحی شده است.\n\n### [نبوت (النبوة) از حیث ذات و حکم نسخ نشده است، بلکه تنها وحی خاص به رسول (الرسول) و نبی (النبي) قطع شده است]\n\nپس نبوت (النبوة) و رسالت (الرسالة) از حیث ذات و حکم نسخ نشده است، بلکه تنها وحی خاص به رسول (الرسول) و نبی (النبي) قطع شده است؛ یعنی نزول فرشته بر گوش و قلب او، و محدود شدن لفظ اسم نبی (النبي) و رسول (الرسول). پس در مورد مجتهد گفته نمی‌شود که او نبی (النبي) یا رسول (الرسول) است، همان‌طور که اجتهاد بر انبیا در آنچه تشریع کرده‌اند، محدود شده بود. و مجتهد اگرچه مردم را به آنچه دلیل و اجتهادش به آن رسیده، ارشاد می‌کند، اما این اسم بر او اطلاق نمی‌شود. این لفظی است خاص برای انبیا و رسولان، نه برای خداوند و نه برای اولیا (الأولیاء)، بلکه اسمی خاص برای عبودیتی است که عین قرب به سَروَر و عدم مزاحمت با سَروَر در رتبه‌اش است. برخلاف ولایت (الولایة)، که بنده در اسم ولی (الولي) با او مزاحمت دارد. و به همین دلیل، انقطاع اسم نبی (النبي) و اسم رسول (الرسول) بر بندگان خالص دشوار آمد، زیرا این اسم از خصایص آنان بود و در اسماء الهی عین و نظیری نداشت.\n\n### [واقعه‌ای که ابن عربی در آن، دری را دید که بالا رفتن به آن آسان و پایین آمدن از آن دشوار بود]\n\nو چون نبوت (النبوة) در احکامش وصفی الهی است و از جمله آن احکام، حق (الحق) آنچه را بر خود واجب کرده، واجب نموده است؛ زیرا وجوب از آنِ شرع است نه غیر شرع. پس فرمود: «پروردگارتان رحمت را بر خود مقرر داشته است» (كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ). این از حکم شرع است. پس این را بدان و در معرفت آنچه ذکر کردیم، ثابت قدم باش، زیرا بالا رفتن به آن آسان و پایین آمدن از آن دشوار است. من این را در واقعه‌ای دیدم، شبی که می‌خواستم این باب را به نگارش درآورم. پس ما در این باب سخنی نگفتیم مگر به آنچه در آن واقعه مشاهده کردیم. و در آن دیدیم که درِ اسم رسول (الرسول) و نبی (النبي) در سمت راست من بسته بود و معراج با پله‌هایش از آن به سوی راه آشکاری که مردم بر آن راه می‌روند، می‌رسید. و من نزد آن در ایستاده بودم و بالاتر از آن مقامی که حق (الحق) مرا در آن متوقف کرده بود، مقامی برای هیچ‌کس نبود، مگر آنچه در داخل آن درِ بسته و محکم قفل شده بود. و با وجود بسته بودن، آنچه پشت آن بود از من پنهان نمی‌شد، جز اینکه هیچ‌کس را در آن قدمی نبود مگر کشف (الکشف). و شخصی به سوی من بالا آمد، اما هنگامی که به آسانی رسید و آن را دید، پایین آمدن بر او دشوار شد و سرگردان گشت و نتوانست در آن ثابت بماند. پس مرا رها کرد و راهی را که من از آن به آن مکان آمده بودم، در پیش گرفت و رفت و مرا در حال بازگشت رها کرد. و من بر این حالت بیدار شدم و آنچه را در این باب گنجانده‌ام، ثبت کردم.\n\n### [مبشرات (المبشرات) از بقایای نبوت (النبوة) تعریفی]\n\nو در این شب رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را دیدم در حالی که از وارد کردن جنازه به مسجد کراهت داشت و همچنین کراهت داشت که میت از مردان با لباسی اضافه بر کفن پوشانده شود و امر کرد که آن لباس از او برداشته شود و در کفنش بر روی تابوت گذاشته شود و اصلاً در تابوت پوشانده نشود. و به من امر کرد که اگر هوا سرد بود، آب را برای غسل جنابت گرم کنم و با جنابت صبح نکنم. و دیدم که بر جماع شکر می‌کرد و آن را از انجام‌دهنده‌اش نیکو می‌شمرد. همه این‌ها را در این شب دیدم. و احمد بن حنبل را در این شب دیدم و به او گفتم که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به من امر کرده است که آب را برای غسل جنابت گرم کنم. او به من گفت: بخاری چنین ذکر کرده است که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) را در خواب دید و به او امر کرد. و فَرَبَری، بخاری را در خواب دید و به او امر کرد. و فَرَبَری مرا در خواب دید و من دانستم که او مرا در خواب دیده است و من او را در خوابش دیدم. پس او به من گفت که بخاری این را به او گفته است. پس من آن را از قول فَرَبَری دانستم و نزد من ثابت شد. و اینک من در خواب آن را به تو گفتم، پس به آن عمل کن. و بیدار شدم و به خانواده‌ام امر کردم که برایم آب گرم کنند و هنگام فجر غسل کردم. و همه این‌ها از مبشرات (المبشرات) است.\n\n### [نبوت (النبوة) مهموز و نبوت (النبوة) غیر مهموز]\n\nو اما نبوت (النبوة) که غیر مهموز است، به معنای رفعت و بلندی است و هیچ اسمی از آن بر خداوند اطلاق نشده است. اما برای آن در خداوند اسم «رفیع الدرجات، صاحب عرش، که روح را به فرمان خود بر هر کس از بندگانش که بخواهد القا می‌کند» (رَفِيعُ الدَّرَجاتِ ذُو الْعَرْشِ يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ) وجود دارد. و همچنین اسم‌های العلی و الأعلی برای آن است. و نبوت (النبوة) مهموز، مولود نبوت (النبوة) است که به معنای رفعت است. پس قصر (کوتاه خواندن) اصل است و مد (کشیده خواندن) اضافه است. آیا نمی‌بینی که عرب در ضرورت شعر، کوتاه خواندن ممدود را جایز می‌شمارد، زیرا بازگشت به اصل است، اما کشیده خواندن مقصور را جایز نمی‌شمارد، زیرا خروج از اصل است؟ و روح، واسطه میان خداوند متعال و هر کس از بندگانش که بخواهد، با بشارت و انذار است. و اولیا (الأولیاء) در این نبوت (النبوة) بهره‌ای عظیم دارند، چنانکه ذکر کردیم، به ویژه که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) درباره کسی که قرآن را حفظ کند، فرموده است: «نبوت (النبوة) در میان دو پهلوی او گنجانده شده است.» پس نبوت (النبوة) برای او غیب است و برای نبی (النبي) شهود (الشهود).\n\n### [وراثت، ولایت (الولایة)، نبوت (النبوة) و علم علمای رسوم]\n\nپس این است فرق میان نبی (النبي) و ولی (الولي) در نبوت (النبوة). در مورد نبی (النبي) گفته می‌شود: نبی، و در مورد ولی (الولي) گفته می‌شود: وارث. و وراثت وصفی الهی است، زیرا خداوند درباره خود فرموده است: «او بهترین وارثان است» (خَيْرُ الْوارِثِينَ). پس ولی (الولي) نبوت (النبوة) را از نبی (النبي) نمی‌گیرد، مگر پس از آنکه حق (الحق) آن را از آنان به ارث ببرد و سپس آن را به ولی (الولي) القا کند تا این امر در حق او کامل‌تر باشد و در این امر به خداوند منتسب شود نه به غیر او. و برخی از اولیا (الأولیاء) آن را به وراثت از نبی (النبي) می‌گیرند، و آنان صحابه‌ای هستند که او را مشاهده کرده‌اند یا کسانی که او را در خواب دیده‌اند. سپس علمای رسوم آن را نسل به نسل تا روز قیامت می‌گیرند و نسبت دور می‌شود. اما اولیا (الأولیاء) آن را از خداوند متعال می‌گیرند، از آن جهت که خداوند آن را به ارث برده و بر اینان بخشیده است. پس آنان پیروان رسولان هستند با چنین سند عالی و محفوظی که «باطل از پیش رو و پشت سر به آن راه نمی‌یابد، فرو فرستاده‌ای از حکیم حمید است» (لا يَأْتِيهِ الْباطِلُ من بَيْنِ يَدَيْهِ ولا من خَلْفِهِ تَنْزِيلٌ من حَكِيمٍ حَمِيدٍ).\n\n### [گرفتن علم مرده از مرده و گرفتن علم از زنده جاودان]\n\nابویزید گفت: «شما علم خود را مرده از مرده گرفتید و ما علم خود را از زنده جاودان گرفتیم.» خداوند متعال به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) در چنین مقامی، هنگامی که انبیا (علیهم السلام) را در سوره انعام ذکر کرد، فرمود: «آنان کسانی هستند که خداوند هدایتشان کرده است، پس به هدایت آنان اقتدا کن» (أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ). و آنان مرده بودند و خداوند وارث آنان بود و او «بهترین وارثان است» (خَيْرُ الْوارِثِينَ). سپس خداوند با آن هدایتی که آنان را بدان هدایت کرده بود، بر پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) بخشش نمود و او را مقتدی به هدایت آنان قرار داد. و رساننده خداوند است و چه نیکو سندی و «چه نیکو مولایی و چه نیکو یاوری» (نِعْمَ الْمَوْلى‏ ونِعْمَ النَّصِيرُ). و این عین همان چیزی است که ما امروز درباره علم اولیا (الأولیاء) به هدایت پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) و هدایت انبیا گفتیم؛ که آن را از خداوند گرفته‌اند و او از نزد خود به رحمت و عنایتی که نزد پروردگارشان برایشان سبقت گرفته بود، در سینه‌هایشان افکنده است، چنانکه درباره بنده خود خضر فرمود: «از نزد خود به او رحمتی دادیم و از جانب خود به او علمی آموختیم» (آتَيْناهُ رَحْمَةً من عِنْدِنا وعَلَّمْناهُ من لَدُنَّا عِلْماً).\n\n### [نبوت (النبوة) جاری در هر موجودی]\n\nو این نبوت (النبوة) در حیوانات نیز جاری است، مانند سخن خداوند متعال: «و پروردگار تو به زنبور عسل وحی کرد» (وأَوْحى‏ رَبُّكَ إِلَى النَّحْلِ). و همه آنان در این جایگاه هستند. پس هر کس که خداوند منطق حیوانات و تسبیح گیاهان و جمادات را به او بیاموزد و نماز و تسبیح هر یک از مخلوقات را بداند، می‌داند که نبوت (النبوة) در هر موجودی جاری است. این را اهل کشف (الکشف) و هستی (الوجود) می‌دانند، اما اسم نبی (النبي) و رسول (الرسول) از این جهت بر هیچ‌یک از آنان اطلاق نمی‌شود، مگر بر فرشتگان، به ویژه رسولان از میان آنان، که ملائکه نامیده می‌شوند. و هر روحی که رسالتی به او داده نشود، روحی است که به آن مَلَک گفته نمی‌شود، مگر به صورت مجازی، مانند ارواحی که از انفاس مؤمنان ذاکر خداوند خلق می‌شوند. خداوند از انفاس آنان ارواحی می‌آفریند که تا روز قیامت برای صاحب آن ذکر استغفار می‌کنند. و همچنین از همه اعمال ستوده آنان که انفاسشان در آن است. و من پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) را در یک مبشره (المبشرات) دیدم که می‌فرمود و به کعبه اشاره می‌کرد: «ای ساکنان این خانه، هیچ‌کس را از طواف و نماز در آن در هر وقت از شب یا روز که بخواهد، منع نکنید. زیرا خداوند از نماز او فرشته‌ای می‌آفریند که تا روز قیامت برای او استغفار می‌کند.» و اینان همه ارواح مطهر هستند. پس هر کس از آنان که در امری فرستاده شود، مَلَک نامیده می‌شود."
  },
  "page_count": 3
}