{
  "id": 339,
  "title": {
    "ar": "الباب التاسع والثلاثون وثلاثمائة في معرفة منزل جثو لشريعة بين يدي الحقيقة تطلب الاستمداد من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Thirty-Nine: Concerning the Gnosis of the Station of Kneeling (juthū) for the Divine Law (Sharī‘a) before the Reality (Ḥaqīqa), seeking spiritual sustenance (istimdād) from the Muhammadan Presence (al-Ḥaḍra al-Muḥammadiyya).",
    "ur": "باب تین سو انتالیس: شریعت کے لیے جثو (گھٹنے ٹیکنے) کے مقام کی معرفت میں، جو حقیقت (الحقيقة) کے حضور استمداد کے لیے حضرہ محمدیہ (الحضرة المحمدية) سے طلب گار ہوتی ہے۔",
    "fa": "باب سیصد و سی و نهم در معرفت منزل جثو برای شریعت در پیشگاه حقیقت (الحقيقة) که استمداد از حضرت محمدیه (الحضرة المحمدية) می‌طلبد."
  },
  "content": {
    "ar": "## «الباب التاسع والثلاثون وثلاثمائة في معرفة منزل جثو لشريعة بين يدي الحقيقة تطلب الاستمداد من الحضرة المحمدية»\n\n\nوهو المنزل الذي يظهر فيه اللواء الثاني من ألوية الحمد الذي يتضمن تسعة وتسعين اسما إلهيا»\n\n\n> الحجر من شيم الحدوث فلا تقل *** إني لأجل خلافتي لمسرح‏\n> هيهات أنت مقيد بخلافة *** أين السراح وباب كونك يفتح‏\n\n\n> والقلب خلف مغالق مجبولة *** ضاعت مفاتحها فليست تفتح‏\n\n\n> لا تفرحن بشرح صدرك إنه *** شرح لتعلم إن قيدك أرجح‏\n\n\n### [تكلم الناس في الشريعة والحقيقة]\n\n\nاعلم أيدك الله أيها الولي الحميم أن الناس تكلموا في الشريعة والحقيقة قال الله تعالى لنبيه صَلَّى اللهُ عَليهِ وسَلَّم آمرا وقُلْ رَبِّ زِدْنِي عِلْماً يريد من العلم به من حيث ما له تعالى من الوجوه في كل مخلوق ومبدع وهو علم الحقيقة فما طلب الزيادة من علم الشريعة بل كان يقول اتركوني ما تركتكم وعلم الشريعة علم محجة وطريق لا بد له من سالك والسلوك تعب فكان يريد التقليل من ذلك وغاية طريق الشريعة السعادة الحسية وليست الحقيقة غايتها في العموم فإن من الناس من ينال الحقيقة في أول قدم يضعه في طريق الشريعة لأن وجه الحق في كل قدم وما كل أحد يكشف له وجه الحق في كل قدم والشريعة المحكوم بها في المكلفين والحقيقة الحكم بذلك المحكوم به والشريعة تنقطع والحقيقة لها الدوام فإنها باقية بالبقاء الإلهي والشريعة باقية بالإبقاء الإلهي والإبقاء يرتفع والبقاء لا يرتفع\n\n\nفهذا المنزل يعطيك شرف الإنسان على جميع من في السماء الأرض وإنه العين المقصودة للحق من الموجودات لأنه الذي اتخذه الله مجلى وأعني به الإنسان الكامل لأنه ما كمل إلا بصورة الحق كما إن المرآة وإن كانت تامة الخلق فلا تكمل إلا بتجلى صورة الناظر فتلك مرتبتها والمرتبة هي الغاية كما إن الألوهة تامة بالأسماء التي تطلبها من المألوهين فهي لا ينقصها شي‏ء وكمالها أعني الرتبة التي تستحقها الغني عن العالمين فكان له الكمال المطلق بالغنى عن العالمين ولما شاء أن يعطي كما له حقه ولم يزل كذلك وخلق العالم للتسبيح بحمده سبحانه لا لأمر آخر والتسبيح لله ولا يكون المسبح في حالة الشهود لأنه فناء عن الشهود والعالم لا يفتر عن التسبيح طرفة عين لأن تسبيحه ذاتي كالنفس للمتنفس فدل إن العالم لا يزال محجوبا وطلبهم بذلك التسبيح المشاهدة فخلق سبحانه الإنسان الكامل على صورته وعرف الملائكة بمرتبته وأخبرهم بأنه الخليفة في العالم وأن مسكنه الأرض وجعلها له دارا لأنه منها خلقه وشغل الملأ الأعلى به سماء وأرضا فسخر له ما في السَّماواتِ وما في الْأَرْضِ جَمِيعاً مِنْهُ أي من أجله واحتجب الحق إذ لا حكم للنائب بظهور من استخلفه فاحتجب عن البصائر كما احتجب عن الأبصار\n\n\nفقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يخاطب الناس الذين يشبهون الإنسان في الصورة الحسية وهم نازلون عن رتبة الكمال إن الله احتجب عن البصائر كما احتجب عن الأبصار وإن الملأ الأعلى يطلبونه كما تطلبونه أنتم فكما لا تدركه الأبصار كذلك لا تدركه البصائر\n\n\nوهي العقول لا تدركه بأفكارها فتعجز عن الوصول إلى مطلوبها والظفر به وعَلَّمَ آدَمَ الْأَسْماءَ كُلَّها وأمره بتعليم الملإ الأعلى وأمر من في السموات والأرض بالنظر فيما يستحقه هذا النائب فسخر له جميع من في السموات والأرض حتى المقول عليه الإنسان من حيث تماميته لا من حيث كماليته فهذا النوع المشارك له في الاسم إذا لم يكمل هو من جملة المسخرين لمن كمل والحق في كماله بالغنى عن العالمين وهو وحده أعني الإنسان الكامل يعبد ربه الغني عنه فكماله إن لا يستغني عنه وما ثم من يعبده من غير تسبيح إلا الكامل فإن التجلي له دائم فحكم الشهود له لازم فهو أكمل الموجودات معرفة بالله وأدومهم شهودا وله إلى الحق نظران ولهذا جعل له عينين فينظر بالعين الواحدة إليه من كونه غنيا عن العالمين فلا يراه في شي‏ء ولا في نفسه وينظر إليه بالعين الأخرى من اسمه الرحمن بكونه يطلب العالم ويطلبه العالم فيراه ساري الوجود في كل شي‏ء فيفتقر بهذه النظرة من هذه العين إلى كل شي‏ء من حيث ما هي الأشياء أسماء الحق لا من حيث أعيانها فلا أفقر من الإنسان الكامل إلى العالم لأنه يشهده مسخرا له فعلم أنه لو لا ما هو عليه من الحاجة إلى ما سخروا فيه من أجله ما سخروا فيعرف نفسه أنه أحوج إلى العالم من العالم إليه فقام له هذا الفقر العام مقام الغني الإلهي العام فنزل في العالم في الفقر منزلة الحق من حيث الأسماء الإلهية التي تطلب التأثير في العالم فما ظهر في فقره إلا ظهور أسماء الحق فهو حق في غناه عن العالم لأن العالم مسخر في حقه بتأثير الأسماء الإلهية فيه أعني في العالم فما يسخر له إلا من له التأثير لا من حيث عين العالم فلم يفتقر إلا لله وهو حق في فقره إلى العالم فإنه لما علم إن الله ما سخر العالم لهذا الإنسان إلا ليشتغل العالم بما كلفهم من التسخير عن طلب العلم به من حيث الشهود فإن ذلك ليس لهم لأنهم‏\nنازلون عن رتبة الكمال أظهر الإنسان الكامل الحاجة لما سخر فيه العالم فقوى التسخير في العالم لئلا يفرطوا فيما أمرهم الحق به من ذلك لأنهم لا يَعْصُونَ الله ما أَمَرَهُمْ فوافق الإنسان الكامل بإظهار هذا الفقر الحق في أشغال العالم فكان حقا في فقره كالاسماء وحقا في غناه لأنه لا يرى المسخر له إلا من له الأثر وهو للأسماء الإلهية لا لأعيان العالم فما افتقر إلا لله في أعيان العالم والعالم لا علم له بذلك ولما أطت السماء بعمارها وقال صَلَّى اللهُ عَليهِ وسَلَّم وحق لها أن تئط ما فيها موضع شبر إلا وفيه ملك ساجد لله‏\n\n\nفأخبر في قوله ساجد لله لينبه على نظر كل ملك في السماء إلى الأرض لأن السجود التطاطؤ والانخفاض وقد عرفوا إن الأرض موضع الخليفة وأمروا بالسجود فطأطئوا عن أمر الله ناظرين إلى مكان هذا الخليفة حتى يكون السجود له لأن الله أمرهم بالسجود له ولم يزل حكم السجود فيهم لآدم وللكامل أبدا دائما فإن قلت فيزول في الدار الآخرة مثل هذا السجود قلنا لا يزول لأن الصورة الظاهرة من الإنسان الكامل التي وقع السجود لها أنشأها الله من الطبيعة العنصرية ابتداء وإعادة ففي الابتداء أنبتها من الأرض ثم أعادها إليها بالموت ثم أخرجها منها إخراجا بالبعث ولها السفل في الرتبة تطلب بهذه الحقيقة الله الذي‏\n\n\nقال فيه النبي صَلَّى اللهُ عَليهِ وسَلَّم لو دليتم بحبل لهبط على الله‏\n\n\nوكذا ينبغي أن يكون الأمر في نفسه فلا بد من استصحاب سجودهم للإمام دنيا وآخرة فحاز الإنسان الكامل صورة العالم وصورة الحق ففضل بالمجموع فالساجد والمسجود له فيه ومنه ولو لم يكن الأمر هكذا لم يكن جامعا فعند الملإ الأعلى ازدحام لرؤية الإنسان الكامل كما يزدحم الناس عند رؤية الملك إذا طلع عليهم فأطت السماء لازدحامهم فمن عرف الله بهذه المعرفة عرف نعم الله التي أسبغها عليه الظاهرة والباطنة فتبرأ من المجادلة في الله بغير علم وهو ما أعطاه الدليل النظري ولا كتاب منير وهو ما وقع به التعريف مما هو الحق عليه من النعوت فقال ومن النَّاسِ من يُجادِلُ في الله بِغَيْرِ عِلْمٍ أعطاه دليل فكره ولا هُدىً يقول ولا بيان أبانه له كشفه ولا كِتابٍ مُنِيرٍ وهو ما وقع به التعريف لما نزلت به الآيات من المعرفة بالله في كتبه المنزلة الموصوفة بأنها نور ليكشف بها ما نزلت به لما كان النور يكشف به فنفاهم عن تقليد الحق وعن التجلي والكشف وعن النظر العقلي ولا مرتبة في الجهل أنزل من هذه المرتبة ولهذا جاءت من الحق في معرض الذم يذم بها من قامت به هذه الصفة وإذا عرفوا نعم الله كما قلنا أوجب هذا العلم عليهم الشكر فشغلوا نفوسهم بشكره‏\n\n\nكما فعله رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حين نزل عليه لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ ويُتِمَّ نِعْمَتَهُ عَلَيْكَ ويَهْدِيَكَ صِراطاً مُسْتَقِيماً ويَنْصُرَكَ الله نَصْراً عَزِيزاً فقام حتى تورمت قدماه شكرا على هذه النعمة وهكذا أخبر لما قيل له في ذلك فقال أ فلا أكون عبدا شكورا\n\n\nفأتى بفعول وهو بنية المبالغة فكثر منه الشكر لما كثرت النعم فطلبت كل نعمة منه الشكر لله عليها ولا يخطر لصاحب هذا المقام في شكره طلب الزيادة لأنه فعل يطلب الماضي والواقع فكانت الزيادة من النعم للشاكر فضلا من الله ولهذا سماها زيادة يطلبها الشكر لا الشاكر فيجني ثمرته الشاكر فهي من الشكر جزاء للشاكر حيث أوجد عين الشكر في الوجود وأقام نشأته صورة متجسدة تسبح الله وتذكره فطلبت من الله تعالى أن يزيد هذا الشاكر نعمة إلى نعمته حيث كان سببا في إيجاد عين الشكر فسمع الله منه وأجابه لما سأل فسأله أن يعرف الشاكرين بذلك حتى يعلموا أن الشكر قد أدى عند الله ما وجب عليه من حق الشاكر فقال الله لعباده لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ فأعلمنا بالزيادة فالعارف بالله يشكر الله ليكون خلاقا لصورة الشكر ليكثر المسبحون لله القائمون في عبادته فإذا علم الله هذا منه زاده في النعم الظاهرة والباطنة ليدوم له نعت الخلق للشكر فلا يزال الأمر له دائما دنيا وآخرة وأعظم نشأة يظهر بها الشكر في الوجود نشأة الشكر على نعمة الصورة الكمالية ونشأة الشكر على نعمة التسخير والمزيد من الله للشاكر على قدر صورة الشكر فاعلم كيف تشكر واشتغل بالأهم فالأهم من ذلك فإذا طلب الشاكر بشكره المزيد لما وعد الله به لم يعطه الله من نعمة المزيد إلا على قدر طلبه وصورته من التخليط والسلامة فيكون مزيده مغفرة وعفوا وتجاوزا لا غير وبالجملة فينزل عن درجة الأول الذي أعطى بسؤال الشكر فإن نشأة الشكر بريئة من التخليط في عينها وإن كان الشاكر مخلطا فلا أثر لتخليطه في صورة الشكر وله أثر في المزيد إذا شكر لتحصيل المزيد فتحصل المفاضلة بين الشاكرين على ما قررناه من الطالبين المزيد وغير الطالبين والمشتغلين بالأهم وغير المشتغلين به فهذه طرق لله‏\nمختلفة كما قال لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً وهي الطرق والحقيقة عين واحدة هي غاية لهذه الطرق وهو قوله وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فأما قوله تعالى لنبيه محمد في سورة الفتح وهو فتوح المكاشفة بالحق وفتوح الحلاوة في الباطن وفتوح العبارة ولهذا الفتوح كان للقرآن معجزة فما أعطى أحد فتوح العبارة على كمال ما أعطيه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فإنه قال لَئِنِ اجْتَمَعَتِ الْإِنْسُ والْجِنُّ عَلى‏ أَنْ يَأْتُوا بِمِثْلِ هذَا الْقُرْآنِ لا يَأْتُونَ بِمِثْلِهِ ولَوْ كانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيراً أي معينا فقال له إِنَّا فَتَحْنا لَكَ فَتْحاً مُبِيناً في الثلاثة الأنواع من الفتوح فتحا فأكده بالمصدر مبينا أي ظاهرا يعرفه كل من رآه بما تجلى وما حواه ففتوح الحلاوة ثابت له ذوقا وفتوح العبارة ثابت للعرب بالعجز عن المعارضة وفتوح المكاشفة ثابت بما أشهده ليلة إسرائه من الآيات لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ فيسترك عما يستحقه صاحب الذنب من العتب والمؤاخذة وما تأخر يسترك عن عين الذنب حتى لا يجدك فيقوم بك فأعلمنا بالمغفرة في الذنب المتأخر أنه معصوم بلا شك ويؤيد عصمته إن جعله الله أسوة يتأسى به فلو لم يقمه الله في مقام العصمة للزمنا التأسي به فيما يقع منه من الذنوب إن لم ينص عليها كما نص على النكاح بالهبة إن ذلك خالص له مشروع وهو حرام علينا ويُتِمَّ نِعْمَتَهُ عَلَيْكَ بأن يعطيها خلقها إذ قد عرفنا بالمخلقة من ذلك وغير المخلقة وأخبر بهذه الآية أن نعمته التي أعطاها محمدا مخلقة أي تامة الخلقة صَلَّى اللهُ عَليهِ وسَلَّم ويَهْدِيَكَ صِراطاً مُسْتَقِيماً وهو صراط ربه الذي هو عليه كما قال هود عليه السلام إِنَّ رَبِّي عَلى‏ صِراطٍ مُسْتَقِيمٍ والشرائع كلها أنوار وشرع محمد صَلَّى اللهُ عَليهِ وسَلَّم بين هذه الأنوار كنور الشمس بين أنوار الكواكب فإذا ظهرت الشمس خفيت أنوار الكواكب واندرجت أنوارها في نور الشمس فكان خفاؤها نظير ما نسخ من الشرائع بشرعه صَلَّى اللهُ عَليهِ وسَلَّم مع وجود أعيانها كما يتحقق وجود أنوار الكواكب ولهذا ألزمنا في شرعنا العام أن نؤمن بجميع الرسل وجميع شرائعهم أنها حق فلم ترجع بالنسخ باطلا ذلك ظن الذين جهلوا فرجعت الطرق كلها ناظرة إلى طريق النبي صَلَّى اللهُ عَليهِ وسَلَّم فلو كانت الرسل في زمانه لتبعوه كما تبعت\n\n\nشرائعهم شرعه فإنه أوتي جوامع الكلم ويَنْصُرَكَ الله نَصْراً عَزِيزاً والعزيز من يرام فلا يستطاع الوصول إليه فإذا كانت الرسل هي الطالبة للوصول إليه فقد عز عن إدراكها إياه ببعثته العامة وإعطاء الله إياه جوامع الكلم والسيادة بالمقام المحمود في الدار الآخرة وبجعل الله أمته خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ وأمة كل نبي على قدر مقام نبيها فاعلم ذلك وإذا طلب الوصول إليه القائلون باكتساب النبوة عز عليهم الوصول إلى ذلك فإن المكتسب إنما هو السلوك والوصول إلى الباب وأما ما وراء الباب فلا علم للواصلين إليه بمن يفتح له ذلك الباب فمن الناس من يفتح له بالإيمان العام وهو مطالعة الحقيقة كأبي بكر فلم ير شيئا إلا رأى الله قبله ومنهم من يفتح له بالإنباء العام الذي لا شرع فيه وهذان الفتحان باقيان في هذه الأمة إلى يوم القيامة ومن الواصلين من يفتح له الباب بنبوة التشريع المقصور عليهم ومنهم من يفتح له الباب بالرسالة بما شرع وهذان بابان أو فتحان قد منع الله أن يتحقق بهما أحد أو يفتح له فيهما إلا أهل الاجتهاد فإن الله أبقى عليهم من ذلك بعض شي‏ء بتقرير الشرع فحكمه للشارع لا لهم فكل ما خرج من وراء الباب عند فتحه ما هو مكتسب والنبوة غير مكتسبة فنصره الله النصر العزيز فلم يصل إليه من قال باكتساب النبوة لأن الموصوف بالعزة لا عين للعزة إلا مع وجود الطالب لمن قامت به فيحمى مقامه وحضرته أن لا يصل طالب إليه فالشرائع الحكمية السياسية الظاهرة بصورة الشرائع الإلهية ليس لها هذا النصر العزيز وإنما هو مختص بصاحب الشرع الإلهي المنزل والحقيقة تعم الشرعين الشرع الإلهي والحكمي السياسي فصاحب الشريعة وهو المؤمن إنما جثى بين يدي المحقق الذي هو صاحب الحقيقة ليبين له مأخذ كل شرع من الحضرة الإلهية ولا يعلم ذلك إلا صاحب الحقيقة فلهذا سمي هذا المنزل بجثو الشريعة بين يدي الحقيقة لأن كل شرع يطلبها إذ هي باطن كل شرع والشرائع صورها الظاهرة في عالم الشهادة ولهذا ما تخلو أمة عن نذير يقوم بسياستها لبقاء المصلحة في حقها سواء كان ذلك الشرع إلهيا\n\n\nأو سياسيا على كل حال تقع المصلحة به في القرن الذي يظهر فيه وبعد أن علمت منزلة الشريعة من الحقيقة ولها باب يخصه من هذا الكتاب قد تقدم فلنذكر ما يتضمنه هذا المنزل من العلوم فمن ذلك علم لواء خاص من ألوية الحمد وأسمائه وعلم ما لهذا اللواء من حكم الرحمة في العالم الذي يكون تحته وعلم المناسبات التي تنضم الأشياء الصورية بها بعضها إلى بعض لإقامة أعيان الصور التي‏\nلا تظهر إلا بهذا الانتظام وهي صور تعطي العلم بذاتها للناظر وفيه علم الإعلام بالأعلام المنصوبة على الطريق للسلاك فيه لئلا يضلوا عن مقصودهم الذي هو غاية طريقهم وفيه علم أنواع الأرزاق فإنها تختلف باختلاف المرزوقين وفيه علم فائدة الأخبار بالعبارة المؤيدة بقرائن الأحوال هل حصول العلم بذلك الخبر عن الخبر أو عن قرائن الأحوال أو عن المجموع أو العلم الذي تعطيه قرينة الحال غير العلم الذي يعطيه الخبر أو في موضع يجتمعان وفي موضع لا يجتمعان وفيه علم الفرق بين الاستماع هل يقع بالفهم أو بغير ذلك والفرق بين من هو هو وبين من هو كأنه هو وفيه علم الجزاء الخاص بكل مجازي وفيه علم العلم العام الذي غايته العمل والذي ليس غايته العمل وفيه علم نسبة العالم من الحق بطريق خاص وفيه علم ما تنتجه الأفكار من العلوم في قلوب المتفكرين وفيه علم تقرير النعم وفيه علم ما خلق العالم له وما السبب الذي حال بينه وبين ما خلق له مع العلم بما خلق له ولا أقوى من العلم لأن له الإحاطة فمقاومه تحت حيطته فأين يذهب وفيه علم من هو من أهل الأمر ممن هو ليس هو منهم وفيه علم الولاية الوجودية السارية التي بها كان الظالمون بَعْضُهُمْ أَوْلِياءُ بَعْضٍ والمؤمنون بَعْضُهُمْ أَوْلِياءُ بَعْضٍ والله وَلِيُّ الْمُؤْمِنِينَ من كونه مؤمنا فمن أين هو ولي المتقين ولا يتصف بالتقوى أو يتصف بالتقوى من حيث إنه أخذ الجن والإنس وقاية يتقى بها نسبة الصفات المذمومة عرفا وشرعا إليه فتنسب إلى الجن والإنس وهما الوقاية التي اتقى بها هذه النسبة فهو ولي المتقين من كونه متقيا وإذا كان وليهم وما ثم إلا متق فهي بشرى من الله للكل بعموم الرحمة والنصرة على الغضب لأن الولي الناصر فافهم وفيه علم المراتب بالنسبة إلى الشرع خاصة لا المراتب بما يقتضيها الوجود وفيه علم الإله الأعظم الذي شرع اتخاذ الآلهة من دون الله وفيه علم الحيرة فيما يقطع به أنه معلوم لك والعلم ضد الحيرة في معلومه فما الذي حيرك مع العلم وفيه علم سلب الهداية من العالم مع قوله عَلَّمَهُ الْبَيانَ وهو عين الهدى وفيه علم الدهر من الزمان وفيه علم الجمع الأوسط لأن الجمع ظهر في ثلاثة مواطن في أخذ الميثاق وفي البرزخ بين الدنيا والآخرة والجمع في البعث بعد الموت وما ثم بعد هذا الجمع جمع يعم فإنه بعد القيامة كل دار تستقل بأهلها فلا يجتمع عالم الإنس والجن بعد هذا الجمع أبدا وفيه علم النحل والملل وعلم عموم النطق الساري في العالم كله وأنه لا يختص به الإنسان كما جعلوه فصله المقوم له بأنه حيوان ناطق فالكشف لا يقول بخصوص هذا الحد في الإنسان وإنما حد الإنسان بالصورة الإلهية خاصة ومن ليس له هذا الحد فليس بإنسان وإنما هو حيوان يشبه في الصورة ظاهر الإنسان فاطلب لصاحب هذا الوصف حدا يخصه كما طلبت لسائر الحيوان وفيه علم ماهية النسخ هل يقع في الأعيان فيعبر عنه بالمسخ كما يقع في الأحكام أم لا وفيه علم مراتب الفوز فإنه ثم فوز مطلق وفوز مقيد بالإنابة ومقيد بالعظمة وما حد كل واحد منهم وفيه علم الاستحقاق وفيه علم اليقين والعلم والظن والجهل والشك والنظر وفيه علم حكم الشهود من حكم العلم وفيه علم من لا يرضى الله عنه وإن رحمه فما رحمه عن رضي والفرق بين المرحوم عن رضي وبين المرحوم لا عن رضي وأين منزل كل واحد منهم من الدارين وفيه علم الكبرياء والجبروت متى يظهر عمومه في العالم بحيث يعرف على التعيين فإنه الآن ظاهر لا يعلمه إلا قليل من الناس والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Thirty-Nine: On the Gnosis of the Station (منزل) of the Law (الشريعة) Kneeling Before the Reality (الحقيقة), Seeking Sustenance (الاستمداد) from the Muhammadan Presence (الحضرة المحمدية)\n\nThis is the Station wherein appears the second Banner of the Banners of Praise (ألوية الحمد), which encompasses ninety-nine Divine Names.\n\n> Confinement is among the characteristics of contingency (الحدوث), so do not say,\n> \"I am free because of my vicegerency (خلافتي).\"\n> Far from it! You are bound by vicegerency,\n> Where is freedom when the door of your being is opened?\n> And the heart is behind innate locks,\n> Whose keys are lost, so they cannot be opened.\n> Do not rejoice in the expansion of your breast,\n> For it is an expansion so you may know that your fetter is heavier.\n\n### [People Spoke Concerning the Law and the Reality]\n\nKnow, may Allah support you, O intimate friend (الولي الحميم), that people have spoken concerning the Law (الشريعة) and the Reality (الحقيقة). Allah the Exalted commanded His Prophet (peace and blessings be upon him), saying: <<وَقُلْ رَبِّ زِدْنِي عِلْماً>> (And say: My Lord, increase me in knowledge). He desires knowledge of Him (Allah) from the perspective of the Faces (الوجوه) He possesses in every created and originated thing. This is the knowledge of the Reality (علم الحقيقة). He did not seek an increase in the knowledge of the Law (علم الشريعة); rather, he used to say, \"Leave me alone as long as I leave you alone.\" The knowledge of the Law is the knowledge of the highway and the path, which necessarily requires a traveler (سالك), and traveling (السلوك) is toil. Thus, he desired a reduction of that. The ultimate goal of the path of the Law is sensory happiness (السعادة الحسية), but the Reality is not its goal generally. Indeed, some people attain the Reality (الحقيقة) with the very first step they place on the path of the Law, because the Face of the Real (وجه الحق) is in every step. Yet, not everyone has the Face of the Real unveiled to him in every step. The Law is that which is decreed upon the legally responsible (المكلفين), while the Reality is the judgment by that which is decreed. The Law ceases (تنقطع), but the Reality has permanence (الدوام), for it subsists through Divine Subsistence (البقاء الإلهي). The Law subsists through Divine Preservation (الإبقاء الإلهي), and Preservation is lifted, but Subsistence is not lifted.\n\nThis Station grants you the nobility of the Human (الإنسان) over all those in the heavens and the earth, and that he is the intended Essence (العين المقصودة) for the Real (الحق) among all existing things, because he is the one whom Allah took as a locus of manifestation (مجلى). I mean by this the Perfect Human (الإنسان الكامل), for he is only perfected by the form of the Real (صورة الحق), just as a mirror, even if perfectly created, is only perfected by the theophany (تجلي) of the image of the beholder. That is his rank (مرتبتها). The rank is the ultimate goal, just as Divinity (الألوهة) is complete through the Names that seek it from the worshipped (المألوهين). Nothing is lacking in it. Its perfection—I mean the rank it deserves—is the independence from the worlds (الغني عن العالمين). Thus, it possessed absolute perfection through independence from the worlds. When He willed to give His perfection its due—and He has ever been thus—He created the world for the glorification (التسبيح) of His praise, exalted is He, not for any other matter. Glorification is for Allah, and the glorifier cannot be in the state of Witnessing (الشهود), because it is annihilation (فناء) from Witnessing. The world does not cease glorifying for the blink of an eye, because its glorification is intrinsic (ذاتي), like breath for the breather. This indicates that the world remains veiled (محجوبا), and their seeking through that glorification is the direct vision (المشاهدة). So, He created the Perfect Human upon His Form (صورته) and informed the angels of his rank, telling them that he is the Vicegerent (الخليفة) in the world and that his dwelling is the earth, making it a home for him because He created him from it. He occupied the Highest Assembly (الملأ الأعلى) with him, heaven and earth, and subjected to him <<مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعًا مِنْهُ>> (whatever is in the heavens and whatever is in the earth, all of it, from Him)—that is, for his sake. The Real veiled Himself, since the deputy (النائب) has no authority when the one who appointed him appears. Thus, He veiled Himself from the inner visions (البصائر) just as He veiled Himself from the outer sights (الأبصار).\n\nThe Messenger of Allah (peace and blessings be upon him) addressed the people who resemble the Human in sensory form but fall short of the rank of perfection, saying: \"Indeed, Allah has veiled Himself from the inner visions just as He has veiled Himself from the outer sights. And the Highest Assembly seeks Him just as you seek Him. Just as the sights do not perceive Him, so too the inner visions do not perceive Him.\"\n\nThese are the intellects (العقول); they do not perceive Him through their thoughts, thus failing to reach their goal and achieve success. <<وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا>> (And He taught Adam all the Names) and commanded him to teach the Highest Assembly. He commanded those in the heavens and the earth to look into what this deputy deserves. Thus, He subjected to him all those in the heavens and the earth, even those called 'Human' (الإنسان) from the perspective of their completeness, not their perfection. This type, which shares the name with him, if not perfected, is among those subjected to the one who is perfected. The Real, in His perfection, is independent of the worlds. And He alone—I mean the Perfect Human—worships his Lord, Who is independent of him. Thus, his perfection lies in not being independent of Him. There is none who worships Him without glorification (تسبيح) except the Perfect Human, for the Theophany is constant for him, and the rule of Witnessing is necessary for him. Therefore, he is the most perfect of existing things in gnosis (معرفة) of Allah and the most constant of them in Witnessing. He has two perspectives toward the Real, which is why He gave him two eyes. With one eye, he looks toward Him from the perspective of His being independent of the worlds, so he does not see Him in anything, nor in himself. With the other eye, he looks toward Him from the perspective of His Name, the All-Merciful (الرحمن), by virtue of His seeking the world and the world seeking Him. Thus, he sees Him pervading Existence (ساري الوجود) in everything. By this gaze from this eye, he becomes needy of everything, from the perspective that things are the Names of the Real (أسماء الحق), not from the perspective of their immutable essences (أعيانها). There is none poorer than the Perfect Human toward the world, because he witnesses it subjected to him. He knows that were it not for his need for that for which they were subjected, they would not have been subjected. Thus, he knows himself to be more in need of the world than the world is of him. This universal poverty (الفقر العام) takes the place of the universal Divine Independence (الغني الإلهي العام) for him. He descends into the world in poverty (الفقر) to the station of the Real (الحق) from the perspective of the Divine Names (الأسماء الإلهية) that seek to effect influence (التأثير) in the world. His manifestation in his poverty is nothing but the manifestation of the Names of the Real. He is the Real (حق) in his independence from the world, because the world is subjected for his sake through the influence of the Divine Names in it—I mean, in the world. Nothing is subjected to him except that which has influence, not from the perspective of the essence (عين) of the world. Thus, he is needy only of Allah. He is the Real (حق) in his need for the world, for when he knew that Allah only subjected the world to this Human so that the world would be occupied by the subjection with which they were charged, preventing them from seeking knowledge of Him through Witnessing—since that is not for them because they fall short of the rank of perfection—the Perfect Human manifested the need for that in which the world was subjected. This strengthened the subjection in the world so that they would not neglect what the Real commanded them concerning it, for <<لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ>> (they do not disobey Allah in what He commands them). Thus, the Perfect Human, by manifesting this poverty, agreed with the Real in occupying the world. He was therefore the Real (حق) in his poverty, like the Names, and the Real (حق) in his independence, because he only sees the one who has the effect (الأثر) as the one who subjects him, and that belongs to the Divine Names, not to the immutable essences of the world. Thus, he is needy only of Allah in the immutable essences of the world. The world has no knowledge of this.\n\nWhen the heaven groaned (أطت) with its inhabitants, the Prophet (peace and blessings be upon him) said: \"And it has the right to groan. There is no space of four fingers in it but there is an angel prostrating to Allah.\"\n\nHe informed us in his saying, \"prostrating to Allah,\" to draw attention to the gaze of every angel in the heaven toward the earth, because prostration (السجود) is bending and lowering. They knew that the earth is the place of the Vicegerent (الخليفة), and they were commanded to prostrate. They lowered themselves by Allah's command, looking toward the place of this Vicegerent, so that the prostration would be for him, because Allah commanded them to prostrate to him. The rule of prostration remains perpetually incumbent upon them for Adam and for the Perfect One (الكامل). If you ask, \"Will such prostration cease in the Hereafter?\" We say, \"It will not cease,\" because the manifest form of the Perfect Human (الإنسان الكامل) to which the prostration occurred was created by Allah from the elemental nature (الطبيعة العنصرية) both initially and recurrently. In the beginning, He caused it to grow from the earth, then returned it to the earth through death, then brought it forth from it through the Resurrection (البعث). It has the lowest rank (السفل في الرتبة). By this reality, it seeks Allah, concerning Whom the Prophet (peace and blessings be upon him) said: \"If you were to let down a rope, it would descend upon Allah.\"\n\nAnd thus the matter should be in itself. Their prostration to the Imam (الإمام) must be maintained, both in this world and the Hereafter. The Perfect Human thus acquired the form of the World (صورة العالم) and the form of the Real (صورة الحق), excelling by the combination. The prostrator and the one prostrated to are in him and from him. If the matter were not thus, he would not be the Comprehensive One (جامعا). Thus, there is a crowding among the Highest Assembly (الملأ الأعلى) to see the Perfect Human, just as people crowd when they see the king appear before them. The heaven groaned due to their crowding.\n\nWhoever knows Allah with this gnosis (المعرفة) knows the favors of Allah that He has bestowed upon him, both manifest and hidden. He is thus absolved from arguing about Allah without knowledge (بغير علم)—which is what theoretical proof (الدليل النظري) grants him—and without an illuminating book (كتاب منير)—which is the definition that occurs concerning the attributes (النعوت) that are due to the Real. So He said: <<وَمِنَ النَّاسِ مَن يُجَادِلُ فِي اللَّهِ بِغَيْرِ عِلْمٍ>> (And among the people is he who disputes concerning Allah without knowledge) that his intellectual proof granted him, <<وَلَا هُدًى>> (nor guidance)—meaning, nor a clear statement (بيان) that his unveiling (كشفه) made manifest to him—<<وَلَا كِتَابٍ مُّنِيرٍ>> (nor an illuminating book)—which is the definition that occurs when the verses (الآيات) concerning the gnosis of Allah descend in His revealed books, described as light (نور) so that what descended in them may be unveiled, since light is used for unveiling. He thus negated them from imitating the Real (تقليد الحق), from Theophany and Unveiling (التجلي والكشف), and from intellectual speculation (النظر العقلي). There is no rank in ignorance lower than this rank. Therefore, it came from the Real in the context of blame, censuring those in whom this attribute resides.\n\nWhen they know the favors of Allah, as we have said, this knowledge necessitates gratitude (الشكر) upon them, so they occupy themselves with thanking Him, as the Messenger of Allah (peace and blessings be upon him) did when <<لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِن ذَنبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعْمَتَهُ عَلَيْكَ وَيَهْدِيَكَ صِرَاطًا مُّسْتَقِيمًا وَيَنصُرَكَ اللَّهُ نَصْرًا عَزِيزًا>> (That Allah may forgive you what preceded of your sin and what will follow and complete His favor upon you and guide you to a straight path and grant you a mighty victory) was revealed to him. He stood until his feet swelled in gratitude for this favor. He informed us of this when he was asked about it, saying, \"Should I not be a grateful servant (عبدا شكورا)?\"\n\nHe used the intensive form (فَعُول), which denotes exaggeration. Thus, his gratitude increased as the favors increased. Every favor sought gratitude to Allah from him for it. The possessor of this station does not seek increase (الزيادة) in his gratitude, because it is an act that seeks the past and the present. The increase in favors for the grateful one was a bounty (فضل) from Allah. Therefore, He called it an increase (زيادة) sought by the gratitude, not by the grateful one. The grateful one reaps its fruit, so it is from the gratitude as a reward for the grateful one, since he brought the essence of gratitude (عين الشكر) into existence and established its manifestation (نشأته) as an embodied form that glorifies and remembers Allah. Thus, it asked Allah the Exalted to increase this grateful one in favor upon his favor, since he was the cause for the existence of the essence of gratitude. Allah heard him and answered what he asked. Then He asked Him to inform the grateful ones of this, so they might know that gratitude has fulfilled its obligation to Allah regarding the right of the grateful one. So Allah said to His servants: <<لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ>> (If you are grateful, I will surely increase you). Thus, He informed us of the increase.\n\nThe Gnostic (العارف بالله) thanks Allah in order to be a creator (خلاق) of the form of gratitude, so that the glorifiers of Allah, who stand in His worship, may multiply. When Allah knows this from him, He increases him in manifest and hidden favors, so that the attribute of creating gratitude may endure for him. Thus, the matter remains constant for him, in this world and the Hereafter. The greatest manifestation (نشأة) through which gratitude appears in existence is the manifestation of gratitude for the favor of the perfect form (الصورة الكمالية) and the manifestation of gratitude for the favor of subjection (التسخير). The increase (المزيد) from Allah for the grateful one is commensurate with the form of gratitude. Know how to be grateful and occupy yourself with what is most important, then the next most important, of that. If the grateful one seeks increase through his gratitude, based on what Allah promised, Allah will only grant him the favor of increase according to his request and its form, regarding mixture (التخليط) and soundness (السلامة). Thus, his increase will be forgiveness, pardon, and overlooking, nothing else. In general, he falls short of the degree of the first one, who was granted by the request of the gratitude itself. For the manifestation of gratitude (نشأة الشكر) is inherently free from mixture (في عينها), even if the grateful one is mixed (مخلطا). His mixture has no effect on the form of gratitude, but it does have an effect on the increase if he gives thanks to obtain the increase. Thus, differentiation occurs among the grateful ones based on what we have established concerning those who seek increase and those who do not, and those who occupy themselves with the most important matters and those who do not.\n\nThese are different paths (طرق) to Allah, as He said: <<لِكُلٍّ جَعَلْنَا مِنكُمْ شِرْعَةً وَمِنْهَاجًا>> (For each of you We have appointed a law [شِرْعَةً] and a clear way [مِنْهَاجًا]). These are the paths, but the Reality (الحقيقة) is a single essence (عين واحدة), which is the goal of these paths. This is His saying: <<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him is returned the whole affair).\n\nAs for His saying to His Prophet Muhammad in *Surat al-Fath* (The Victory)—which is the victory of unveiling (فتوح المكاشفة) by the Real, the victory of sweetness (فتوح الحلاوة) in the inner being, and the victory of expression (فتوح العبارة)—it is because of this victory that the Quran was a miracle. No one was granted the victory of expression to the completeness that the Messenger of Allah (peace and blessings be upon him) was granted. Indeed, he said: <<لَئِنِ اجْتَمَعَتِ الْإِنْسُ وَالْجِنُّ عَلَى أَنْ يَأْتُوا بِمِثْلِ هَذَا الْقُرْآنِ لَا يَأْتُونَ بِمِثْلِهِ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًا>> (If mankind and jinn were to gather to produce the like of this Quran, they could not produce the like thereof, even if they were to be helpers to one another).\n\nSo He said to him: <<إِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِينًا>> (Indeed, We have granted you a clear victory [فَتْحًا مُّبِينًا]) in the three types of victories. He confirmed it with the verbal noun *mubīnan* (مبينا), meaning manifest, known to everyone who sees it by what it manifests and what it contains. The victory of sweetness is established for him by taste (ذوقا), the victory of expression is established for the Arabs by their inability to challenge it, and the victory of unveiling is established by the signs (الآيات) He showed him on the night of his Ascension (إسراؤه).\n\n<<لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِن ذَنبِكَ وَمَا تَأَخَّرَ>> (That Allah may forgive you what preceded of your sin and what will follow). What preceded: He shields you from what the sinner deserves of blame and accountability. What will follow: He shields you from the essence of sin (عين الذنب) so that He does not find you committing it. His informing us of forgiveness for the subsequent sin confirms his infallibility (عصمته) without doubt. His infallibility is supported by the fact that Allah made him an exemplar (أسوة) to be followed. If Allah had not established him in the station of infallibility, we would be obliged to follow him in the sins that occurred from him, unless they were explicitly exempted, just as He explicitly exempted marriage by way of gift (نكاح بالهبة), stating that it was exclusively lawful for him (خالص له مشروع), while it is forbidden for us.\n\n<<وَيُتِمَّ نِعْمَتَهُ عَلَيْكَ>> (And complete His favor upon you) by giving it its creation (خلقها), since He has made known to us the created (المخلقة) and the uncreated of that. This verse informs us that the favor He granted Muhammad (peace and blessings be upon him) is *mukhallaqa* (مخلقة), meaning perfectly created.\n\n<<وَيَهْدِيَكَ صِرَاطًا مُّسْتَقِيمًا>> (And guide you to a straight path), which is the path of his Lord upon which He stands, as Hud (peace be upon him) said: <<إِنَّ رَبِّي عَلَى صِرَاطٍ مُّسْتَقِيمٍ>> (Indeed, my Lord is on a straight path).\n\nAll Divine Laws (الشرائع) are lights, and the Law of Muhammad (peace and blessings be upon him) among these lights is like the light of the sun among the lights of the stars. When the sun appears, the lights of the stars are hidden, and their lights are absorbed into the light of the sun. Their concealment is analogous to the abrogation (نسخ) of previous Laws by his Law (peace and blessings be upon him), while their immutable essences (أعيانها) still exist, just as the existence of the lights of the stars is confirmed. For this reason, we are obligated in our universal Law to believe in all the Messengers and all their Laws, that they are true. They did not become false through abrogation; that is the assumption of those who are ignorant. Thus, all paths return, looking toward the path of the Prophet (peace and blessings be upon him). If the Messengers had been in his time, they would have followed him, just as their Laws followed his Law, for he was granted the comprehensive words (جوامع الكلم).\n\n<<وَيَنصُرَكَ اللَّهُ نَصْرًا عَزِيزًا>> (And grant you a mighty victory). The Mighty (العزيز) is one who is sought but cannot be reached. Since the Messengers are those who seek to reach him, he has become mighty (عز) beyond their grasp through his universal mission (بعثته العامة), Allah's granting him the comprehensive words, and the mastery (السيادة) through the Praised Station (المقام المحمود) in the Hereafter, and by Allah making his community <<خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ>> (the best community brought forth for mankind). The community of every prophet is commensurate with the station of its prophet, so know that.\n\nWhen those who claim the acquisition of prophethood (اكتساب النبوة) seek to reach him, reaching that becomes mighty (عز) for them. For what is acquired is only the spiritual journey (السلوك) and reaching the door. As for what is beyond the door, those who reach it have no knowledge of who opens that door for them. Among people, some are granted the opening (فتح) through universal faith (الإيمان العام), which is the contemplation of the Reality (مطالعة الحقيقة), like Abu Bakr, who saw nothing except that he saw Allah before it. Among them, some are granted the opening through universal prophecy (الإنباء العام) which contains no Law. These two openings remain in this community until the Day of Resurrection.\n\nAmong those who reach, some are granted the opening of the door through the prophethood of legislation (نبوة التشريع), which is restricted to them. Among them, some are granted the opening of the door through Messengership (الرسالة) with what was legislated. These two doors, or two openings, Allah has forbidden anyone to realize or be granted an opening in them except the people of independent judgment (أهل الاجتهاد), for Allah has preserved some part of that for them by confirming the Law, but the ruling belongs to the Lawgiver, not to them. Everything that emerges from beyond the door when it is opened is not acquired, and prophethood is not acquired.\n\nThus, Allah granted him the Mighty Victory (النصر العزيز). Those who claimed the acquisition of prophethood did not reach him, because the one described by Might (العزة) has no essence of Might except with the existence of the seeker of the one who possesses it. Thus, his station and presence are protected from any seeker reaching him.\n\nThe political, judicial laws (الشرائع الحكمية السياسية) that appear in the form of Divine Laws (الشرائع الإلهية) do not possess this Mighty Victory. Rather, it is exclusive to the possessor of the revealed Divine Law. The Reality (الحقيقة) encompasses both Laws: the Divine Law and the political, judicial Law.\n\nThe possessor of the Law (صاحب الشريعة)—who is the believer—only kneels (جثى) before the Realizer (المحقق)—who is the possessor of the Reality—so that the latter may clarify for him the source (مأخذ) of every Law from the Divine Presence (الحضرة الإلهية). Only the possessor of the Reality knows this. For this reason, this Station is named \"The Kneeling of the Law before the Reality\" (جثو الشريعة بين يدي الحقيقة), because every Law seeks it, as it is the inner dimension (باطن) of every Law, and the Laws are its manifest forms in the world of witnessing (عالم الشهادة). For this reason, no community is devoid of a warner (نذير) who undertakes its governance (سياستها) for the continuation of benefit (المصلحة) concerning it, whether that Law is Divine or political, in every case, benefit occurs through it in the generation in which it appears.\n\nNow that you have known the station of the Law in relation to the Reality—and it has a specific chapter in this book that has preceded—let us mention the sciences contained within this Station.\n\nAmong them is the science of a specific banner (لواء خاص) of the Banners of Praise (ألوية الحمد) and its Names. The science of the rule of Mercy (حكم الرحمة) that this banner holds in the world that is beneath it. The science of the correspondences (المناسبات) by which formal things (الأشياء الصورية) are joined to one another to establish the immutable essences of the forms (أعيان الصور) that only appear through this organization. These are forms that grant knowledge of themselves to the observer. It contains the science of informing by means of signs (الأعلام) erected on the path for the travelers (السلاك) therein, so that they do not stray from their intended goal, which is the end of their path. It contains the science of the types of provisions (الأرزاق), for they differ according to the recipients of provision (المرزوقين). It contains the science of the benefit of information (الأخبار) through expression (العبارة) supported by circumstantial evidence (قرائن الأحوال): whether the attainment of knowledge of that information is from the information itself, or from the circumstantial evidence, or from the combination; or whether the knowledge granted by the circumstantial evidence is different from the knowledge granted by the information; or in what place they combine and in what place they do not. It contains the science of the difference regarding listening (الاستماع): whether it occurs through understanding or otherwise, and the difference between \"he who is He\" (من هو هو) and \"he who is as if he is He\" (من هو كأنه هو). It contains the science of the specific recompense (الجزاء الخاص) for every recompensed one (مجازي). It contains the science of universal knowledge (العلم العام) whose goal is action, and that whose goal is not action. It contains the science of the relationship of the world to the Real (الحق) through a specific path. It contains the science of the knowledge produced by thoughts (الأفكار) in the hearts of those who reflect (المتفكرين). It contains the science of confirming favors (تقرير النعم). It contains the science of that for which the world was created, and the reason that intervened between it and that for which it was created, along with the knowledge of that for which it was created. Nothing is stronger than Knowledge (العلم), for it possesses encompassing (الإحاطة). Its opponent is under its enclosure, so where can it go? It contains the science of who belongs to the People of the Command (أهل الأمر) and who does not. It contains the science of the pervasive existential sainthood (الولاية الوجودية السارية) by which the wrongdoers were <<بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ>> (allies of one another) and the believers were <<بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ>> (allies of one another). And Allah is <<وَلِيُّ الْمُؤْمِنِينَ>> (the Protector of the believers) by virtue of His being a believer. So, from where is He the Protector of the pious (المتقين)? He is not described by piety, or He is described by piety in that He took the jinn and mankind as a shield (وقاية) by which He guards against the attribution of blameworthy attributes, conventionally and legally, to Himself. Thus, they are attributed to the jinn and mankind, and they are the shield by which He guarded against this attribution. Thus, He is the Protector of the pious by virtue of His being pious. If He is their Protector, and there is none but the pious, then this is good news from Allah for everyone, signifying the universality of Mercy and victory over Wrath, because the Protector (الولي) is the Helper (الناصر). So understand. It contains the science of the ranks (المراتب) specifically in relation to the Law, not the ranks necessitated by Existence (الوجود). It contains the science of the Greatest God (الإله الأعظم) who legislated the taking of gods besides Allah. It contains the science of bewilderment (الحيرة) concerning what is definitively known to you, while knowledge is the opposite of bewilderment regarding what is known. So what is it that bewilders you despite the knowledge? It contains the science of the removal of guidance (سلب الهداية) from the world, despite His saying <<عَلَّمَهُ الْبَيَانَ>> (He taught him clear expression), which is the essence of guidance. It contains the science of Time (الدهر) in relation to temporal duration (الزمان). It contains the science of the Middle Gathering (الجمع الأوسط), because the Gathering (الجمع) appeared in three places: in the taking of the Covenant (أخذ الميثاق), in the Isthmus (البرزخ) between this world and the Hereafter, and the Gathering in the Resurrection (البعث) after death. There is no universal gathering after this Gathering, for after the Resurrection, every abode becomes independent with its inhabitants, and the world of mankind and jinn will never gather after this Gathering. It contains the science of sects (النحل) and religions (الملل). The science of the universality of speech (النطق) pervading the entire world, and that it is not exclusive to the Human, as they made it his constitutive differentia (فصله المقوم له) by defining him as a rational animal (حيوان ناطق). Unveiling (الكشف) does not affirm the exclusivity of this definition to the Human. Rather, the Human is defined specifically by the Divine Form (بالصورة الإلهية). Whoever does not possess this definition is not a Human; rather, he is an animal resembling the outward form of the Human. Seek a specific definition for the possessor of this description, just as you sought one for the rest of the animals. It contains the science of the nature of abrogation (النسخ): whether it occurs in the immutable essences (الأعيان), in which case it is expressed as metamorphosis (المسخ), as it occurs in rulings, or not. It contains the science of the ranks of triumph (مراتب الفوز), for there is absolute triumph (فوز مطلق), triumph restricted by turning to Allah (مقيد بالإنابة), and triumph restricted by majesty (مقيد بالعظمة). What is the definition of each of them? It contains the science of deservingness (الاستحقاق). It contains the science of certainty (اليقين), knowledge (العلم), conjecture (الظن), ignorance (الجهل), doubt (الشك), and speculation (النظر). It contains the science of the ruling of Witnessing (الشهود) compared to the ruling of Knowledge (العلم). It contains the science of the one with whom Allah is not pleased, even if He shows him mercy. Thus, His mercy is not based on pleasure. And the difference between the one shown mercy based on pleasure and the one shown mercy not based on pleasure, and the station of each of them in the two abodes. It contains the science of Grandeur (الكبرياء) and Omnipotence (الجبروت): when their universality appears in the world such that they are known specifically, for they are now manifest, but only a few people know them. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "## «باب نمبر تین سو انتالیس: شریعت کے حقیقت کے سامنے گھٹنے ٹیکنے کے مقام کی معرفت، جو حضرت محمدیہ سے مدد طلب کرتی ہے»\n\nیہ وہ مقام ہے جہاں حمد کے جھنڈوں میں سے دوسرا جھنڈا ظاہر ہوتا ہے، جس میں ننانوے اسماء الٰہیہ شامل ہیں۔\n\n> پتھر حدوث کی خصلتوں میں سے ہے، پس یہ نہ کہو\n> کہ میں اپنی خلافت کی وجہ سے آزاد ہوں (لمسرح)۔\n> ہرگز نہیں! تم خلافت سے مقید ہو،\n> آزادی کہاں؟ جبکہ تمہارے وجود کا دروازہ کھل رہا ہے۔\n\n> اور دل جبلت کی زنجیروں کے پیچھے ہے،\n> جس کی چابیاں گم ہو چکی ہیں، لہٰذا وہ نہیں کھلتا۔\n\n> اپنے سینے کے کشادہ ہونے پر خوش نہ ہو،\n> یہ کشادگی تو اس لیے ہے کہ تم جان لو کہ تمہاری قید زیادہ مضبوط ہے۔\n\n### [لوگوں کا شریعت اور حقیقت کے بارے میں کلام]\n\nجان لو، اللہ تمہاری مدد کرے، اے میرے گہرے دوست! کہ لوگوں نے شریعت اور حقیقت کے بارے میں کلام کیا ہے۔ اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو حکم دیتے ہوئے فرمایا:\n**\"اور کہو کہ اے میرے رب! مجھے علم میں اضافہ عطا فرما\" (وَقُلْ رَبِّ زِدْنِي عِلْماً)**۔\nاس سے مراد وہ علم ہے جو اللہ تعالیٰ کے بارے میں ہے، اس حیثیت سے کہ ہر مخلوق اور ہر ایجاد شدہ شے میں اس کے جو وجوہ (پہلو) ہیں، اور یہی علم الحقیقت (حقیقت کا علم) ہے۔ آپ صلی اللہ علیہ وسلم نے علم الشریعت (شریعت کے علم) میں اضافے کی طلب نہیں کی، بلکہ آپ صلی اللہ علیہ وسلم فرمایا کرتے تھے: \"مجھے چھوڑ دو جب تک میں تمہیں چھوڑے رکھوں\"۔ علم الشریعت ایک واضح راستہ اور طریقہ ہے جس کے لیے سالک (چلنے والے) کا ہونا ضروری ہے، اور سلوک (چلنا) مشقت طلب ہے۔ لہٰذا آپ صلی اللہ علیہ وسلم اس میں کمی چاہتے تھے۔ شریعت کے راستے کی انتہا حسی سعادت ہے، جبکہ حقیقت کی انتہا عموماً یہ نہیں ہے۔ کیونکہ بعض لوگ شریعت کے راستے پر پہلا قدم رکھتے ہی حقیقت کو پا لیتے ہیں، اس لیے کہ الحق (ذات حق) کا چہرہ ہر قدم میں موجود ہے۔ لیکن ہر کسی کے لیے ہر قدم میں الحق کا چہرہ منکشف نہیں ہوتا۔\n\nشریعت وہ ہے جس کا حکم مکلفین (جن پر ذمہ داری عائد کی گئی ہے) پر لگایا گیا ہے، اور حقیقت اس حکم کردہ چیز کا حکم ہے۔ شریعت منقطع ہو جاتی ہے، جبکہ حقیقت کو دوام حاصل ہے، کیونکہ وہ البقاء الإلهي (بقا الٰہی) کے ساتھ باقی ہے۔ اور شریعت الإبقاء الإلهي (ابقا الٰہی - باقی رکھنے) کے ساتھ باقی ہے، اور ابقا اٹھ جاتا ہے جبکہ بقا نہیں اٹھتا۔\n\nپس یہ مقام تمہیں آسمان و زمین کی تمام مخلوقات پر انسان کی فضیلت عطا کرتا ہے، اور یہ کہ وہ موجودات میں سے الحق (ذات حق) کا مقصود بالذات (اصل مقصود) ہے۔ کیونکہ اللہ نے اسے اپنا مجلیٰ (ظہور کی جگہ) بنایا ہے، اور اس سے میری مراد الإنسان الکامل (انسان کامل) ہے، کیونکہ وہ الحق کی صورت کے بغیر کامل نہیں ہوتا، جس طرح آئینہ اگرچہ کامل تخلیق ہو، مگر ناظر کی صورت کے التجلی (ظہور) کے بغیر کامل نہیں ہوتا۔ پس یہ اس کا مرتبہ ہے، اور مرتبہ ہی غایت (انتہا) ہے۔\n\nجس طرح الألوہۃ (الوہیت) ان اسماء کے ساتھ کامل ہے جو وہ مألوہین (جن کی عبادت کی جاتی ہے) سے طلب کرتی ہے، اسے کسی چیز کی کمی نہیں ہے۔ اور اس کا کمال، یعنی وہ رتبہ جس کا وہ مستحق ہے، وہ غنی عن العالمین (تمام جہانوں سے بے نیاز) ہونا ہے۔ پس اسے غنی عن العالمین ہونے کے سبب کمال مطلق حاصل تھا۔ اور جب اس نے چاہا کہ اپنے کمال کا حق عطا کرے، اور وہ ہمیشہ سے ایسا ہی ہے، اور اس نے عالم کو اپنی حمد کی تسبیح کے لیے پیدا کیا، نہ کہ کسی اور مقصد کے لیے۔ اور تسبیح اللہ کے لیے ہے، اور مسبح (تسبیح کرنے والا) الشہود (مشاہدہ) کی حالت میں نہیں ہوتا، کیونکہ وہ شہود سے الفناء (فنا) ہے۔ اور عالم ایک پلک جھپکنے کے لیے بھی تسبیح سے غافل نہیں ہوتا، کیونکہ اس کی تسبیح ذاتی ہے، جیسے سانس لینے والے کے لیے سانس۔ اس سے یہ ثابت ہوا کہ عالم ہمیشہ محجوب (پردے میں) رہتا ہے، اور وہ اس تسبیح کے ذریعے المشاہدۃ (مشاہدہ) طلب کرتے ہیں۔\n\nپس اللہ سبحانہ و تعالیٰ نے الإنسان الکامل (انسان کامل) کو اپنی صورت پر پیدا کیا، اور فرشتوں کو اس کے مرتبے سے آگاہ کیا، اور انہیں خبر دی کہ وہ عالم میں خلیفہ ہے، اور اس کا ٹھکانہ زمین ہے، اور اسے اس کے لیے گھر بنایا، کیونکہ اسے اسی سے پیدا کیا تھا۔ اور اس نے ملأ اعلیٰ (فرشتوں کی جماعت) کو آسمان و زمین میں اس کے ساتھ مشغول کر دیا، پس اس نے اس کے لیے **\"جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے، سب کو اپنی طرف سے مسخر کر دیا\" (مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعاً مِنْهُ)**، یعنی اس کی خاطر۔ اور الحق (ذات حق) نے پردہ کر لیا، کیونکہ نائب کے لیے اس کے ظاہر ہونے کے ساتھ کوئی حکم نہیں ہوتا جسے اس نے خلیفہ بنایا ہے۔ پس اس نے بصیرتوں سے پردہ کر لیا، جس طرح اس نے آنکھوں سے پردہ کر لیا۔\n\nپس رسول اللہ صلی اللہ علیہ وسلم نے ان لوگوں کو مخاطب کرتے ہوئے فرمایا جو حسی صورت میں انسان سے مشابہت رکھتے ہیں، لیکن کمال کے مرتبے سے نیچے ہیں، کہ اللہ نے بصیرتوں سے پردہ کر لیا ہے جس طرح اس نے آنکھوں سے پردہ کر لیا ہے۔ اور ملأ اعلیٰ اسے طلب کرتے ہیں جس طرح تم اسے طلب کرتے ہو۔ پس جس طرح اسے آنکھیں نہیں پا سکتیں، اسی طرح اسے بصیرتیں بھی نہیں پا سکتیں۔\n\nاور یہ عقلیں ہیں جو اسے اپنی فکروں سے نہیں پا سکتیں، پس وہ اپنے مطلوب تک پہنچنے اور اسے حاصل کرنے سے عاجز رہتی ہیں۔ اور اللہ نے **\"آدم کو تمام اسماء سکھا دیے\" (وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا)**، اور اسے ملأ اعلیٰ کو تعلیم دینے کا حکم دیا، اور آسمانوں اور زمین میں موجود ہر چیز کو حکم دیا کہ وہ اس نائب کے استحقاق پر غور کرے۔ پس اس نے آسمانوں اور زمین میں موجود ہر چیز کو اس کے لیے مسخر کر دیا، یہاں تک کہ وہ جسے انسان کہا جاتا ہے، اس کی تمامیت (پوری ہونے) کے لحاظ سے، نہ کہ اس کی کمالیت (کامل ہونے) کے لحاظ سے۔ پس یہ نوع جو نام میں اس کے ساتھ شریک ہے، اگر وہ کامل نہ ہو، تو وہ ان مسخرین میں شامل ہے جو کامل کے لیے مسخر کیے گئے ہیں۔\n\nاور الحق (ذات حق) اپنے کمال میں غنی عن العالمین (جہانوں سے بے نیاز) ہے۔ اور وہ اکیلا، یعنی الإنسان الکامل (انسان کامل)، اپنے رب کی عبادت کرتا ہے جو اس سے بے نیاز ہے۔ پس اس کا کمال یہ ہے کہ وہ اس سے بے نیاز نہ ہو۔ اور وہاں کوئی نہیں جو تسبیح کے بغیر اس کی عبادت کرتا ہو سوائے کامل کے، کیونکہ اس کے لیے التجلی (ظہور الٰہی) دائمی ہے، پس الشہود (مشاہدہ) کا حکم اس کے لیے لازم ہے۔ پس وہ اللہ کی المعرفۃ (معرفت) میں تمام موجودات سے کامل تر ہے، اور شہود میں ان سب سے زیادہ دائمی ہے۔\n\nاور اس کی الحق (ذات حق) کی طرف دو نظریں ہیں، اور اسی لیے اس کے لیے دو آنکھیں بنائی گئیں۔ پس وہ ایک آنکھ سے اس کی طرف دیکھتا ہے کہ وہ غنی عن العالمین ہے، پس وہ اسے کسی چیز میں اور نہ ہی خود اپنے نفس میں دیکھتا ہے۔ اور دوسری آنکھ سے اس کے اسم الرحمن کی طرف دیکھتا ہے، اس حیثیت سے کہ وہ عالم کو طلب کرتا ہے اور عالم اسے طلب کرتا ہے، پس وہ اسے ہر چیز میں ساری الوجود (وجود میں جاری) دیکھتا ہے۔ پس وہ اس آنکھ کی اس نظر سے ہر چیز کا محتاج ہو جاتا ہے، اس حیثیت سے کہ اشیاء اسماء الحق (ذات حق کے اسماء) ہیں، نہ کہ ان کے اعیان (حقیقتوں) کے لحاظ سے۔ پس الإنسان الکامل (انسان کامل) سے زیادہ عالم کا محتاج کوئی نہیں، کیونکہ وہ اسے اپنے لیے مسخر دیکھتا ہے۔ پس وہ جانتا ہے کہ اگر وہ اس حاجت پر نہ ہوتا جس کے لیے انہیں مسخر کیا گیا ہے، تو وہ مسخر نہ ہوتے۔ پس وہ اپنے نفس کو عالم کا زیادہ محتاج جانتا ہے بہ نسبت عالم کے اس کا محتاج ہونے کے۔ پس یہ فقر عام (عام محتاجی) اس کے لیے غنی الٰہی عام (عام الٰہی بے نیازی) کے مقام پر قائم ہو گیا۔\n\nپس وہ عالم میں فقر (محتاجی) میں اس حیثیت سے اترا جس حیثیت سے اسماء الٰہیہ عالم میں تاثیر طلب کرتی ہیں۔ پس وہ اپنے فقر میں ظاہر نہیں ہوا مگر اسماء الحق کے ظہور کے طور پر۔ پس وہ عالم سے اپنی بے نیازی میں حق ہے، کیونکہ عالم اس کے حق میں اسماء الٰہیہ کی تاثیر کے ذریعے مسخر ہے، یعنی عالم میں۔ پس وہ صرف اللہ کا محتاج ہوا اعیان عالم میں۔ اور عالم کو اس کا علم نہیں ہے۔\n\nاور جب آسمان نے اپنے آباد کرنے والوں کے بوجھ سے آواز نکالی، تو نبی صلی اللہ علیہ وسلم نے فرمایا: **\"اور اسے حق ہے کہ وہ آواز نکالے، اس میں چار انگل کے برابر بھی جگہ نہیں مگر اس میں ایک فرشتہ اللہ کے لیے سجدہ ریز ہے\"**۔\n\nپس آپ صلی اللہ علیہ وسلم نے اپنے قول \"ساجد لله\" (اللہ کے لیے سجدہ ریز) میں خبر دی تاکہ ہر فرشتے کو آسمان سے زمین کی طرف دیکھنے پر متنبہ کریں، کیونکہ سجدہ جھکنے اور پست ہونے کو کہتے ہیں۔ اور وہ جانتے تھے کہ زمین خلیفہ کا مقام ہے، اور انہیں سجدہ کا حکم دیا گیا تھا، پس وہ اللہ کے حکم سے جھکے، اس خلیفہ کے مقام کی طرف دیکھتے ہوئے، تاکہ سجدہ اس کے لیے ہو، کیونکہ اللہ نے انہیں اس کے لیے سجدہ کرنے کا حکم دیا تھا۔ اور سجدہ کا حکم ان میں آدم کے لیے اور کامل کے لیے ہمیشہ دائمی رہا ہے۔\n\nاگر تم کہو کہ کیا آخرت میں یہ سجدہ ختم ہو جائے گا؟ ہم کہیں گے کہ یہ ختم نہیں ہو گا، کیونکہ الإنسان الکامل (انسان کامل) کی ظاہری صورت جس کے لیے سجدہ واقع ہوا، اللہ نے اسے عنصری طبیعت سے ابتداءً اور اعادۃً (دوبارہ) پیدا کیا۔ پس ابتداء میں اسے زمین سے اگایا، پھر موت کے ذریعے اسے اس میں لوٹا دیا، پھر بعث (اٹھانے) کے ذریعے اسے اس سے نکالا۔ اور اس کا رتبے میں سفل (نیچے ہونا) ہے، وہ اس حقیقت کے ذریعے اللہ کو طلب کرتا ہے جس کے بارے میں\n\nنبی صلی اللہ علیہ وسلم نے فرمایا: **\"اگر تم ایک رسی لٹکاؤ تو وہ اللہ پر گرے گی\"**۔\n\nاور ایسا ہی معاملہ خود اس میں ہونا چاہیے۔ پس دنیا اور آخرت میں ان کا امام کے لیے سجدہ جاری رہنا ضروری ہے۔ پس الإنسان الکامل (انسان کامل) نے عالم کی صورت اور الحق (ذات حق) کی صورت کو حاصل کیا، پس وہ مجموعہ کے سبب فضیلت والا ہوا۔ پس سجدہ کرنے والا اور جس کے لیے سجدہ کیا گیا، وہ اس میں اور اسی سے ہے۔ اور اگر معاملہ ایسا نہ ہوتا تو وہ جامع نہ ہوتا۔ پس ملأ اعلیٰ میں الإنسان الکامل کو دیکھنے کے لیے ازدحام ہوتا ہے، جس طرح لوگ بادشاہ کو دیکھ کر ازدحام کرتے ہیں جب وہ ان پر ظاہر ہوتا ہے۔ پس آسمان ان کے ازدحام کی وجہ سے آواز نکالتا ہے۔\n\nپس جس نے اللہ کو اس معرفت کے ساتھ جانا، اس نے اللہ کی ان نعمتوں کو جانا جو اس نے اس پر ظاہر اور باطن میں مکمل کی ہیں۔ پس وہ اللہ کے بارے میں بغیر علم کے جھگڑنے سے بری ہو گیا، اور وہ یہ ہے کہ نہ تو اسے نظری دلیل نے کچھ دیا، اور نہ ہی کوئی روشن کتاب، اور وہ یہ ہے کہ الحق (ذات حق) کی جو صفات ہیں ان کے ذریعے جو تعریف واقع ہوئی ہے۔ پس اس نے فرمایا: **\"اور لوگوں میں سے وہ بھی ہیں جو اللہ کے بارے میں بغیر علم کے جھگڑتے ہیں\" (وَمِنَ النَّاسِ مَنْ يُجَادِلُ فِي اللَّهِ بِغَيْرِ عِلْمٍ)**، جو اس کی فکری دلیل نے اسے دیا، **\"اور نہ کوئی ہدایت\" (وَلَا هُدًى)**، یعنی نہ کوئی بیان جو اس کے کشف (الکشف) نے اس کے لیے واضح کیا، **\"اور نہ کوئی روشن کتاب\" (وَلَا كِتَابٍ مُنِيرٍ)**، اور وہ یہ ہے کہ اللہ کی معرفت کے بارے میں جو آیات اس کی نازل کردہ کتابوں میں نازل ہوئیں، جنہیں نور سے موصوف کیا گیا ہے تاکہ ان کے ذریعے وہ چیزیں منکشف ہوں جو ان میں نازل ہوئیں، کیونکہ نور سے چیزیں منکشف ہوتی ہیں۔ پس اس نے انہیں الحق کی تقلید سے، التجلی (ظہور) اور کشف سے، اور عقلی نظر سے نفی کر دیا۔ اور جہالت میں اس مرتبے سے نیچے کوئی مرتبہ نہیں ہے۔ اور اسی لیے یہ الحق کی طرف سے مذمت کے انداز میں آیا ہے، جس سے اس صفت کے حامل شخص کی مذمت کی جاتی ہے۔\n\nاور جب وہ اللہ کی نعمتوں کو جان لیتے ہیں جیسا کہ ہم نے کہا، تو یہ علم ان پر شکر واجب کرتا ہے، پس وہ اپنے نفوس کو اس کے شکر میں مشغول کر دیتے ہیں۔\n\nجیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے کیا جب آپ پر یہ نازل ہوا: **\"تاکہ اللہ آپ کے اگلے اور پچھلے گناہ بخش دے، اور اپنی نعمت آپ پر پوری کر دے، اور آپ کو سیدھے راستے پر چلائے، اور اللہ آپ کی زبردست مدد کرے\" (لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعْمَتَهُ عَلَيْكَ وَيَهْدِيَكَ صِرَاطاً مُسْتَقِيماً وَيَنْصُرَكَ اللَّهُ نَصْراً عَزِيزاً)**۔ پس آپ صلی اللہ علیہ وسلم کھڑے رہے یہاں تک کہ آپ کے قدم سوج گئے، اس نعمت پر شکر ادا کرتے ہوئے۔ اور جب آپ صلی اللہ علیہ وسلم سے اس بارے میں پوچھا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: **\"کیا میں شکر گزار بندہ نہ بنوں؟\" (أَفَلَا أَكُونُ عَبْداً شَكُوراً)**۔\n\nپس آپ صلی اللہ علیہ وسلم نے \"فعول\" کا صیغہ استعمال کیا، جو مبالغہ کے لیے ہے، پس جب نعمتیں زیادہ ہوئیں تو آپ صلی اللہ علیہ وسلم نے شکر کو زیادہ کیا۔ پس ہر نعمت نے اس پر اللہ کا شکر طلب کیا۔ اور اس مقام کے حامل شخص کے شکر میں اضافے کی طلب کا خیال نہیں آتا، کیونکہ یہ ایک ایسا فعل ہے جو ماضی اور واقع کو طلب کرتا ہے۔ پس شکر گزار کے لیے نعمتوں میں اضافہ اللہ کی طرف سے فضل تھا۔ اور اسی لیے اس نے اسے اضافہ کہا، جسے شکر طلب کرتا ہے نہ کہ شکر گزار، پس شکر گزار اس کا پھل کاٹتا ہے۔ پس یہ شکر کی طرف سے شکر گزار کے لیے جزا ہے، کیونکہ اس نے شکر کی حقیقت کو وجود میں لایا اور اس کی نشأت کو ایک مجسم صورت میں قائم کیا جو اللہ کی تسبیح اور ذکر کرتی ہے۔ پس اس نے اللہ تعالیٰ سے طلب کیا کہ وہ اس شکر گزار کو اس کی نعمت پر مزید نعمت عطا کرے، کیونکہ وہ شکر کی حقیقت کو وجود میں لانے کا سبب بنا۔ پس اللہ نے اس کی سنی اور اس کی درخواست قبول کی۔ پس اس نے اللہ سے درخواست کی کہ وہ شکر گزاروں کو اس سے آگاہ کرے، تاکہ وہ جان لیں کہ شکر نے اللہ کے ہاں شکر گزار کا حق ادا کر دیا ہے۔ پس اللہ نے اپنے بندوں سے فرمایا: **\"اگر تم شکر کرو گے تو میں تمہیں ضرور زیادہ دوں گا\" (لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ)**۔ پس اس نے ہمیں اضافے سے آگاہ کیا۔\n\nپس العارف باللہ (اللہ کو جاننے والا) اللہ کا شکر کرتا ہے تاکہ وہ شکر کی صورت کو تخلیق کرنے والا بنے، تاکہ اللہ کی تسبیح کرنے والے اور اس کی عبادت میں قائم رہنے والے زیادہ ہوں۔ پس جب اللہ اس سے یہ جانتا ہے، تو وہ اسے ظاہر اور باطن نعمتوں میں اضافہ کرتا ہے، تاکہ اس کے لیے شکر کی تخلیق کی صفت دائمی رہے۔ پس یہ معاملہ دنیا اور آخرت میں اس کے لیے ہمیشہ جاری رہتا ہے۔ اور سب سے عظیم نشأت جس کے ذریعے شکر وجود میں ظاہر ہوتا ہے، وہ صورت کمالیہ کی نعمت پر شکر کی نشأت ہے، اور تسخیر کی نعمت پر شکر کی نشأت ہے۔ اور اللہ کی طرف سے شکر گزار کے لیے اضافہ شکر کی صورت کے مطابق ہوتا ہے۔ پس جان لو کہ تم کیسے شکر کرتے ہو، اور اس میں اہم سے اہم تر میں مشغول ہو جاؤ۔\n\nپس اگر شکر گزار اپنے شکر کے ذریعے اس اضافے کو طلب کرے جس کا اللہ نے وعدہ کیا ہے، تو اللہ اسے نعمت کا اضافہ صرف اس کی طلب اور اس کی صورت کے مطابق دے گا، جو ملاوٹ اور سلامتی میں ہے۔ پس اس کا اضافہ صرف مغفرت، عفو اور درگزر ہو گا۔ اور بالعموم، وہ اس پہلے درجے سے نیچے ہو جائے گا جسے شکر کے سوال سے عطا کیا گیا۔ کیونکہ شکر کی نشأت اپنی حقیقت میں ملاوٹ سے پاک ہے، اگرچہ شکر گزار ملاوٹ والا ہو، لیکن اس کی ملاوٹ کا شکر کی صورت پر کوئی اثر نہیں ہوتا۔ اور اس کا اثر اضافے پر ہوتا ہے اگر وہ اضافے کے حصول کے لیے شکر کرے۔ پس شکر گزاروں کے درمیان فضیلت کا فرق پیدا ہوتا ہے، جیسا کہ ہم نے مقرر کیا، اضافے کے طالب اور غیر طالب کے درمیان، اور اہم میں مشغول ہونے والے اور غیر مشغول ہونے والے کے درمیان۔\n\nپس یہ اللہ کے مختلف راستے ہیں، جیسا کہ اس نے فرمایا: **\"تم میں سے ہر ایک کے لیے ہم نے ایک شریعت اور ایک طریقہ مقرر کیا\" (لِكُلٍّ جَعَلْنَا مِنْكُمْ شِرْعَةً وَمِنْهَاجاً)**، اور یہ راستے ہیں۔ اور حقیقت ایک ہی ہے، جو ان راستوں کی غایت (انتہا) ہے، اور یہ اس کا قول ہے: **\"اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں\" (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ)**۔\n\nجہاں تک اللہ تعالیٰ کا اپنے نبی محمد صلی اللہ علیہ وسلم کے لیے سورۃ الفتح میں قول ہے، اور یہ الحق کے ذریعے مکاشفہ کی فتوحات، اور باطن میں حلاوت کی فتوحات، اور عبارت کی فتوحات ہیں۔ اور اسی فتوح کی وجہ سے قرآن معجزہ بنا۔ پس کسی کو بھی عبارت کی فتوحات اس کمال کے ساتھ عطا نہیں کی گئیں جو رسول اللہ صلی اللہ علیہ وسلم کو عطا کی گئیں۔ کیونکہ آپ صلی اللہ علیہ وسلم نے فرمایا: **\"اگر انسان اور جن سب مل کر اس قرآن جیسا لانا چاہیں تو وہ اس جیسا نہیں لا سکتے، اگرچہ وہ ایک دوسرے کے مددگار بن جائیں\" (لَئِنِ اجْتَمَعَتِ الْإِنْسُ وَالْجِنُّ عَلَى أَنْ يَأْتُوا بِمِثْلِ هَذَا الْقُرْآنِ لَا يَأْتُونَ بِمِثْلِهِ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيراً)**۔\n\nپس اللہ نے آپ صلی اللہ علیہ وسلم سے فرمایا: **\"بے شک ہم نے آپ کو ایک کھلی فتح عطا کی\" (إِنَّا فَتَحْنَا لَكَ فَتْحاً مُبِيناً)**، تینوں قسم کی فتوحات میں ایک فتح، پس اس نے اسے مصدر کے ذریعے مؤکد کیا، **\"مبیناً\"** یعنی ظاہر، جسے ہر وہ شخص جانتا ہے جو اسے دیکھتا ہے، اس کے التجلی (ظہور) اور اس کے احاطہ کی وجہ سے۔ پس حلاوت کی فتوحات آپ صلی اللہ علیہ وسلم کے لیے ذوقاً ثابت ہیں، اور عبارت کی فتوحات عربوں کے لیے معارضہ سے عاجز ہونے کے سبب ثابت ہیں، اور مکاشفہ کی فتوحات ان آیات کے ذریعے ثابت ہیں جن کا آپ صلی اللہ علیہ وسلم نے معراج کی رات مشاہدہ کیا۔\n\n**\"تاکہ اللہ آپ کے اگلے اور پچھلے گناہ بخش دے\" (لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ)**۔ پس وہ آپ کو اس عتاب اور مؤاخذہ سے پردہ میں رکھے جس کا مستحق گناہ گار ہوتا ہے۔ اور **\"ما تأخر\"** (جو پیچھے رہ گیا) آپ کو گناہ کی حقیقت سے پردہ میں رکھے، یہاں تک کہ وہ آپ میں نہ پائے اور آپ کے ساتھ قائم نہ ہو۔ پس اس نے ہمیں متأخر گناہ میں مغفرت سے آگاہ کیا کہ آپ صلی اللہ علیہ وسلم بلاشبہ معصوم ہیں۔ اور آپ صلی اللہ علیہ وسلم کی عصمت کی تائید یہ کرتی ہے کہ اللہ نے آپ کو اسوہ (نمونہ) بنایا جس کی پیروی کی جاتی ہے۔ پس اگر اللہ آپ کو عصمت کے مقام پر قائم نہ کرتا، تو ہم پر لازم ہوتا کہ ہم ان گناہوں میں بھی آپ کی پیروی کریں جو آپ سے سرزد ہوتے، اگر ان پر نص نہ ہوتی، جیسا کہ ہبہ کے ذریعے نکاح پر نص ہے کہ یہ آپ کے لیے خاص مشروع ہے اور ہم پر حرام ہے۔\n\n**\"اور اپنی نعمت آپ پر پوری کر دے\" (وَيُتِمَّ نِعْمَتَهُ عَلَيْكَ)**، اس طرح کہ وہ اسے اس کی خلقت عطا کرے، کیونکہ اس نے ہمیں اس میں سے مخلوق اور غیر مخلوق سے آگاہ کیا ہے۔ اور اس آیت کے ذریعے خبر دی کہ اس کی وہ نعمت جو اس نے محمد صلی اللہ علیہ وسلم کو عطا کی، وہ مخلوق ہے، یعنی کامل الخلقت ہے۔\n\n**\"اور آپ کو سیدھے راستے پر چلائے\" (وَيَهْدِيَكَ صِرَاطاً مُسْتَقِيماً)**، اور وہ اس کے رب کا راستہ ہے جس پر وہ قائم ہے، جیسا کہ ہود علیہ السلام نے فرمایا: **\"بے شک میرا رب سیدھے راستے پر ہے\" (إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ)**۔ اور تمام شرائع انوار ہیں، اور محمد صلی اللہ علیہ وسلم کی شریعت ان انوار کے درمیان سورج کی روشنی کی طرح ہے ستاروں کی روشنی کے درمیان۔ پس جب سورج ظاہر ہوتا ہے تو ستاروں کی روشنیاں چھپ جاتی ہیں اور ان کی روشنیاں سورج کی روشنی میں شامل ہو جاتی ہیں۔ پس ان کا چھپ جانا اس کے مشابہ ہے جو آپ صلی اللہ علیہ وسلم کی شریعت کے ذریعے منسوخ ہوا، جبکہ ان کے اعیان (حقیقتیں) موجود ہیں، جس طرح ستاروں کی روشنیوں کا وجود متحقق ہے۔ اور اسی لیے ہمیں اپنی عام شریعت میں لازم کیا گیا ہے کہ ہم تمام رسولوں اور ان کی تمام شرائع پر ایمان لائیں کہ وہ حق ہیں۔ پس وہ نسخ کے ذریعے باطل نہیں ہوئیں، یہ ان لوگوں کا گمان ہے جو جاہل ہیں۔\n\nپس تمام راستے نبی صلی اللہ علیہ وسلم کے راستے کی طرف دیکھنے والے ہو گئے۔ پس اگر رسول آپ صلی اللہ علیہ وسلم کے زمانے میں ہوتے تو وہ آپ کی پیروی کرتے، جس طرح ان کی شرائع نے آپ کی شریعت کی پیروی کی۔ کیونکہ آپ صلی اللہ علیہ وسلم کو جوامع الکلم (جامع کلمات) عطا کیے گئے۔\n\n**\"اور اللہ آپ کی زبردست مدد کرے\" (وَيَنْصُرَكَ اللَّهُ نَصْراً عَزِيزاً)**۔ اور عزیز (زبردست) وہ ہے جسے طلب کیا جائے لیکن اس تک پہنچنا ممکن نہ ہو۔ پس جب رسول ہی اس تک پہنچنے کے طالب ہوں، تو آپ صلی اللہ علیہ وسلم اپنی عام بعثت اور اللہ کے آپ کو جوامع الکلم عطا کرنے، اور آخرت میں مقام محمود کے ذریعے سیادت عطا کرنے، اور اللہ کے آپ کی امت کو **\"بہترین امت جو لوگوں کے لیے نکالی گئی\" (خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ)** بنانے کے سبب ان کے ادراک سے عزیز ہو گئے۔ اور ہر نبی کی امت اس کے نبی کے مقام کے مطابق ہے۔ پس یہ جان لو۔\n\nاور جب نبوت کے اکتساب کے قائلین اس تک پہنچنے کی کوشش کرتے ہیں، تو ان کے لیے اس تک پہنچنا مشکل ہو جاتا ہے، کیونکہ اکتساب صرف سلوک اور دروازے تک پہنچنا ہے۔ لیکن دروازے کے پیچھے کیا ہے، اس تک پہنچنے والوں کو اس کا علم نہیں ہوتا کہ وہ دروازہ کس کے لیے کھولا جائے گا۔ پس بعض لوگوں کے لیے عام ایمان کے ذریعے کھولا جاتا ہے، جو حقیقت کا مطالعہ ہے، جیسے ابوبکر رضی اللہ عنہ، جنہوں نے کوئی چیز نہیں دیکھی مگر اس سے پہلے اللہ کو دیکھا۔ اور بعض کے لیے عام انباء (خبر دینے) کے ذریعے کھولا جاتا ہے جس میں کوئی شریعت نہیں ہوتی۔ اور یہ دونوں فتوحات اس امت میں قیامت تک باقی ہیں۔\n\nاور واصلین (پہنچنے والوں) میں سے بعض کے لیے دروازہ نبوت التشریع (شریعت والی نبوت) کے ذریعے کھولا جاتا ہے جو ان پر مقصور ہے، اور بعض کے لیے دروازہ رسالت کے ذریعے کھولا جاتا ہے جو اس نے مشروع کیا۔ اور یہ دو دروازے یا فتوحات ہیں جن سے اللہ نے منع کیا ہے کہ کوئی ان کے ذریعے متحقق ہو یا ان میں اس کے لیے کھولا جائے، سوائے اہل اجتہاد کے۔ کیونکہ اللہ نے ان کے لیے اس میں سے کچھ باقی رکھا ہے شریعت کی تقریر (ثابت کرنے) کے ذریعے، پس اس کا حکم شارع کے لیے ہے نہ کہ ان کے لیے۔ پس جو کچھ دروازہ کھلنے پر اس کے پیچھے سے نکلتا ہے، وہ اکتسابی نہیں ہے۔ اور نبوت اکتسابی نہیں ہے۔ پس اللہ نے آپ صلی اللہ علیہ وسلم کی نصرت عزیزہ (زبردست مدد) کی، پس نبوت کے اکتساب کے قائلین آپ تک نہیں پہنچے۔ کیونکہ عزت سے موصوف کے لیے عزت کی حقیقت صرف طالب کے وجود کے ساتھ ہوتی ہے جس میں وہ قائم ہے، پس وہ اپنے مقام اور اپنی بارگاہ کی حفاظت کرتا ہے کہ کوئی طالب اس تک نہ پہنچے۔\n\nپس حکمی سیاسی شرائع جو الٰہی شرائع کی صورت میں ظاہر ہوتی ہیں، انہیں یہ نصر عزیز حاصل نہیں ہوتا، بلکہ یہ صرف صاحب الشرع الإلهي المنزل (نازل کردہ الٰہی شریعت کے مالک) کے لیے خاص ہے۔ اور حقیقت دونوں شرائع کو عام ہے، شریعت الٰہی اور حکمی سیاسی۔\n\nپس صاحب الشریعت، یعنی مؤمن، حقیقت کے مالک، جو محقق ہے، کے سامنے صرف اس لیے گھٹنے ٹیکتا ہے تاکہ وہ اسے ہر شریعت کا مأخذ (ماخذ) الحضرة الإلهية (الٰہی بارگاہ) سے واضح کرے۔ اور یہ صرف صاحب الحقیقت ہی جانتا ہے۔ اسی لیے اس مقام کا نام شریعت کا حقیقت کے سامنے گھٹنے ٹیکنا رکھا گیا ہے، کیونکہ ہر شریعت اسے طلب کرتی ہے، کیونکہ وہ ہر شریعت کا باطن ہے۔ اور شرائع عالم الشہادۃ (عالم ظاہر) میں ان کی ظاہری صورتیں ہیں۔ اور اسی لیے کوئی امت نذیر (ڈرانے والے) سے خالی نہیں ہوتی جو اس کی سیاست (انتظام) کو قائم رکھے، تاکہ اس کے حق میں مصلحت باقی رہے، خواہ وہ شریعت الٰہی ہو یا سیاسی، ہر حال میں اس صدی میں مصلحت واقع ہوتی ہے جس میں وہ ظاہر ہوتی ہے۔\n\nاور جب تم نے حقیقت سے شریعت کا مرتبہ جان لیا، اور اس کتاب میں اس کا ایک خاص باب پہلے گزر چکا ہے، تو ہم ان علوم کا ذکر کرتے ہیں جو یہ مقام اپنے اندر رکھتا ہے۔ ان میں سے ایک علم حمد کے جھنڈوں میں سے ایک خاص جھنڈے کا علم اور اس کے اسماء کا علم ہے۔ اور اس علم کا علم کہ اس جھنڈے کا اس عالم میں رحمت کا کیا حکم ہے جو اس کے تحت ہوتا ہے۔ اور ان مناسبات کا علم جن کے ذریعے صوری اشیاء ایک دوسرے سے ملتی ہیں تاکہ ان صورتوں کے اعیان قائم ہوں جو اس انتظام کے بغیر ظاہر نہیں ہوتیں، اور یہ وہ صورتیں ہیں جو ناظر کو اپنی ذات کا علم عطا کرتی ہیں۔\n\nاور اس میں ان علامات کا علم ہے جو راستے پر چلنے والوں کے لیے نصب کی گئی ہیں تاکہ وہ اپنے مقصود سے گمراہ نہ ہوں جو ان کے راستے کی غایت ہے۔ اور اس میں رزق کی اقسام کا علم ہے، کیونکہ وہ مرزوقین (جنہیں رزق دیا جاتا ہے) کے اختلاف سے مختلف ہوتی ہیں۔ اور اس میں عبارت کے ذریعے خبر دینے کا فائدہ، جو احوال کے قرائن سے مؤید ہو، کیا اس خبر سے علم کا حصول خبر سے ہوتا ہے یا احوال کے قرائن سے، یا مجموعہ سے؟ یا وہ علم جو حال کا قرینہ دیتا ہے وہ اس علم سے مختلف ہے جو خبر دیتی ہے؟ یا کسی جگہ وہ دونوں جمع ہوتے ہیں اور کسی جگہ جمع نہیں ہوتے؟\n\nاور اس میں سننے کے درمیان فرق کا علم ہے، کیا وہ سمجھ کے ساتھ واقع ہوتا ہے یا اس کے بغیر؟ اور اس کے درمیان فرق کا علم جو \"وہ ہے\" اور جو \"گویا وہ ہے\"۔ اور اس میں ہر جزا دیے جانے والے کے لیے خاص جزا کا علم ہے۔ اور اس میں عام علم کا علم ہے جس کی غایت عمل ہے، اور وہ جس کی غایت عمل نہیں ہے۔ اور اس میں ایک خاص طریقے سے عالم کی الحق (ذات حق) سے نسبت کا علم ہے۔ اور اس میں ان علوم کا علم ہے جو متفکرین کے دلوں میں افکار سے پیدا ہوتے ہیں۔ اور اس میں نعمتوں کو ثابت کرنے کا علم ہے۔\n\nاور اس میں اس چیز کا علم ہے جس کے لیے عالم کو پیدا کیا گیا، اور وہ سبب جس نے اس کے اور اس چیز کے درمیان رکاوٹ ڈالی جس کے لیے اسے پیدا کیا گیا، اس علم کے ساتھ کہ وہ کس کے لیے پیدا کیا گیا ہے۔ اور علم سے زیادہ قوی کوئی چیز نہیں، کیونکہ اسے احاطہ حاصل ہے، پس اس کا مقام اس کے احاطہ کے تحت ہے، پس وہ کہاں جائے گا؟\n\nاور اس میں ان لوگوں کا علم ہے جو اہل الأمر (حکم والے) میں سے ہیں اور جو ان میں سے نہیں ہیں۔ اور اس میں ساری الوجود (وجود میں جاری) ولایت کا علم ہے، جس کے ذریعے ظالم **\"ایک دوسرے کے دوست ہیں\" (بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ)**، اور مؤمن **\"ایک دوسرے کے دوست ہیں\" (بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ)**۔ اور اللہ **\"مؤمنوں کا دوست ہے\" (وَاللَّهُ وَلِيُّ الْمُؤْمِنِينَ)**، اس حیثیت سے کہ وہ مؤمن ہے۔ پس وہ متقین (پرہیزگاروں) کا دوست کس حیثیت سے ہے، جبکہ وہ تقویٰ سے متصف نہیں ہوتا؟ یا وہ تقویٰ سے متصف ہوتا ہے اس حیثیت سے کہ اس نے جنوں اور انسانوں کو ڈھال بنایا جس سے وہ عرفاً اور شرعاً مذموم صفات کی نسبت سے بچتا ہے، پس وہ جنوں اور انسانوں کی طرف منسوب کی جاتی ہیں، اور وہ دونوں وہ ڈھال ہیں جس سے اس نے اس نسبت سے بچاؤ کیا۔ پس وہ متقین کا دوست ہے اس حیثیت سے کہ وہ متقی ہے۔ اور جب وہ ان کا دوست ہے، اور وہاں صرف متقی ہی ہیں، تو یہ اللہ کی طرف سے سب کے لیے عام رحمت اور غضب پر نصرت کی خوشخبری ہے، کیونکہ ولی ناصر (مددگار) ہوتا ہے۔ پس سمجھو۔\n\nاور اس میں مراتب کا علم ہے، خاص طور پر شریعت کے لحاظ سے، نہ کہ وہ مراتب جو الوجود (ہستی) کا تقاضا کرتے ہیں۔ اور اس میں اس الٰہ اعظم کا علم ہے جس نے اللہ کے سوا معبود بنانے کو مشروع کیا۔ اور اس میں اس حیرت کا علم ہے جس سے یہ یقینی ہو جاتا ہے کہ وہ تمہارے لیے معلوم ہے، اور علم اپنے معلوم میں حیرت کی ضد ہے۔ پس علم کے باوجود تمہیں کس چیز نے حیران کیا؟\n\nاور اس میں عالم سے ہدایت کے سلب (چھین لینے) کا علم ہے، باوجود اس کے کہ اس نے فرمایا: **\"اسے بیان سکھایا\" (عَلَّمَهُ الْبَيَانَ)**، اور وہ عین ہدایت ہے۔ اور اس میں زمانے میں دہر (وقت) کا علم ہے۔ اور اس میں الجمع الأوسط (درمیانی جمع) کا علم ہے، کیونکہ جمع تین مقامات پر ظاہر ہوئی: میثاق لینے میں، دنیا اور آخرت کے درمیان برزخ میں، اور موت کے بعد بعث میں جمع۔ اور اس جمع کے بعد کوئی عام جمع نہیں ہے، کیونکہ قیامت کے بعد ہر گھر اپنے رہنے والوں کے ساتھ مستقل ہو جائے گا، پس انسان اور جن کی دنیا اس جمع کے بعد کبھی جمع نہیں ہو گی۔\n\nاور اس میں فرقوں اور ملتوں کا علم ہے۔ اور اس میں پورے عالم میں جاری نطق (بولنے) کی عمومیت کا علم ہے، اور یہ کہ یہ انسان کے ساتھ خاص نہیں ہے، جیسا کہ انہوں نے اسے اس کی مقوم فصل (بنیادی امتیاز) بنایا ہے کہ وہ حیوان ناطق ہے۔ پس الکشف (کشف) انسان میں اس حد کی خصوصیت کا قائل نہیں ہے۔ بلکہ انسان کی حد صرف صورت الٰہیہ کے ساتھ کی گئی ہے۔ اور جس کے لیے یہ حد نہیں ہے، وہ انسان نہیں ہے، بلکہ وہ ایک حیوان ہے جو ظاہری صورت میں انسان سے مشابہت رکھتا ہے۔ پس اس صفت کے حامل کے لیے ایک خاص حد تلاش کرو، جیسا کہ تم نے باقی حیوانات کے لیے تلاش کی۔\n\nاور اس میں نسخ کی ماہیت کا علم ہے، کیا وہ اعیان (حقیقتوں) میں واقع ہوتا ہے، پس اسے مسخ سے تعبیر کیا جاتا ہے، جیسا کہ احکام میں واقع ہوتا ہے، یا نہیں؟ اور اس میں فوز (کامیابی) کے مراتب کا علم ہے، کیونکہ وہاں فوز مطلق ہے، اور فوز مقید بالإنابہ (توبہ سے مقید) ہے، اور مقید بالعظمۃ (عظمت سے مقید) ہے۔ اور ان میں سے ہر ایک کی حد کیا ہے؟\n\nاور اس میں استحقاق کا علم ہے۔ اور اس میں الیقین (یقین)، العلم (علم)، الظن (گمان)، الجہل (جہالت)، الشک (شک)، اور النظر (غور و فکر) کا علم ہے۔ اور اس میں الشہود (مشاہدہ) کا حکم، علم کے حکم سے ہے۔ اور اس میں اس کا علم ہے جس سے اللہ راضی نہیں ہوتا اگرچہ اس پر رحم کرے، پس اس نے اس پر رضامندی سے رحم نہیں کیا۔ اور المرحوم عن رضی (رضامندی سے رحم کیے گئے) اور المرحوم لا عن رضی (بغیر رضامندی کے رحم کیے گئے) کے درمیان فرق، اور دونوں جہانوں میں ان میں سے ہر ایک کا مقام کہاں ہے؟\n\nاور اس میں الکبریاء (بڑائی) اور الجبروت (جبر) کا علم ہے، کہ وہ عالم میں کب اپنی عمومیت ظاہر کرتے ہیں، اس طرح کہ وہ تعین کے ساتھ معلوم ہو جائیں؟ کیونکہ وہ اب ظاہر ہے، لیکن اسے بہت کم لوگ جانتے ہیں۔ **\"اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)**۔",
    "fa": "باب سیصد و سی و نهم در معرفت منزل زانو زدن شریعت (الشريعة) در پیشگاه حقیقت (الحقيقة) که طلب یاری از حضرت محمدیه (الحضرة المحمدية) می‌کند.\n\nو این منزلی است که در آن، لوای دوم از پرچم‌های حمد آشکار می‌شود که دربردارنده نود و نه اسم الهی است.\n\nسنگ از ویژگی‌های حدوث است، پس مگو *** که من به خاطر خلافتم رها شده‌ام.\nهیهات! تو به خلافت مقیدی *** رهایی کجاست، در حالی که باب هستی تو گشوده می‌شود؟\n\nو قلب پشت قفل‌های سرشته شده‌ای است *** که کلیدهایش گم شده و گشوده نمی‌شود.\n\nبه شرح صدرت شادمان مباش، زیرا *** شرحی است تا بدانی که قید تو سنگین‌تر است.\n\n### [سخن مردم درباره شریعت و حقیقت]\n\nبدان، خداوند تو را ای ولیّ صمیمی تأیید کند، که مردم درباره شریعت (الشريعة) و حقیقت (الحقيقة) سخن گفته‌اند. خداوند متعال به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) امرکنان فرمود: **«و بگو پروردگارا، علم مرا زیاد کن»** (وَقُلْ رَبِّ زِدْنِي عِلْماً). منظور از این علم، علم به اوست از آن حیث که او را در هر مخلوق و پدیده‌ای وجوهی است، و این همان علم حقیقت است. پس او طلب فزونی در علم شریعت نکرد، بلکه می‌فرمود: «مرا واگذارید تا زمانی که من شما را واگذاشته‌ام.» علم شریعت، علم راه و طریقی است که ناگزیر سالکی می‌طلبد، و سلوک، رنج است؛ از این رو، پیامبر (ص) می‌خواست از آن بکاهد. نهایت راه شریعت، سعادت حسی است، در حالی که حقیقت (الحقيقة) به طور عموم غایت آن نیست؛ زیرا برخی از مردم حقیقت را در اولین قدمی که در راه شریعت می‌گذارند، درمی‌یابند، چرا که وجه حق (الحق) در هر قدمی است. اما نه هر کسی که وجه حق در هر قدمی برایش کشف (الکشف) شود. شریعت، حکمی است که بر مکلفین جاری می‌شود، و حقیقت، حکم به آن محكوم‌به است. شریعت منقطع می‌شود، اما حقیقت دوام دارد، زیرا به بقای الهی (البقاء الإلهي) باقی است، در حالی که شریعت به ابقای الهی باقی است، و ابقا زائل می‌شود، اما بقا زائل نمی‌شود.\n\nپس این منزل، شرف انسان را بر تمامی موجودات آسمان و زمین به تو می‌نمایاند، و اینکه او عین مقصود حق (الحق) از میان موجودات است، زیرا خداوند او را مَجلا (محل تجلی) قرار داد، و منظورم از او انسان کامل (الإنسان الکامل) است. زیرا او کامل نشد مگر به صورت حق، همان‌گونه که آینه اگرچه خلقتش کامل است، اما کامل نمی‌شود مگر به تجلی (التجلی) صورت بیننده. پس آن مرتبه آینه است و مرتبه همان غایت است. همان‌گونه که الوهیت به واسطه اسمایی که از مألوهین (معبودین) طلب می‌کند، کامل است، و هیچ نقصی ندارد. و کمال آن، یعنی مرتبه‌ای که سزاوار آن است، بی‌نیازی از عالمیان است. پس کمال مطلق را به واسطه بی‌نیازی از عالمیان داشت. و چون خواست که حق کمال خود را عطا کند، و همیشه چنین بوده است، عالم را برای تسبیح به حمد خود آفرید، نه برای امر دیگری. و تسبیح برای خداست، و تسبیح‌کننده در حالت شهود (الشهود) نیست، زیرا شهود فنا (الفناء) است. و عالم لحظه‌ای از تسبیح باز نمی‌ایستد، زیرا تسبیحش ذاتی است، مانند نفس برای نفس‌کشنده. پس این دلالت می‌کند که عالم پیوسته محجوب است و طلب آن‌ها از آن تسبیح، مشاهده است. پس خداوند سبحان انسان کامل (الإنسان الکامل) را بر صورت خود آفرید و ملائکه را به مرتبه او شناساند و به آن‌ها خبر داد که او خلیفه در عالم است و مسکنش زمین است و آن را برای او خانه قرار داد، زیرا او را از آن آفرید. و ملأ اعلی را به واسطه او در آسمان و زمین مشغول ساخت، پس **«آنچه در آسمان‌ها و آنچه در زمین است، همه را از جانب خود برای شما مسخر ساخت»** (مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعًا مِنْهُ) یعنی به خاطر او. و حق (الحق) محجوب شد، زیرا با ظهور کسی که او را خلیفه ساخته، حکمی برای نایب نیست. پس از بصیرت‌ها محجوب شد، همان‌گونه که از دیده‌ها محجوب شد.\n\nپس رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) خطاب به مردمی که در صورت حسی شبیه انسان هستند، در حالی که از مرتبه کمال پایین‌ترند، فرمود: «خداوند از بصیرت‌ها محجوب شد، همان‌گونه که از دیده‌ها محجوب شد، و ملأ اعلی او را می‌طلبند، همان‌گونه که شما او را می‌طلبید. پس همان‌گونه که دیده‌ها او را درک نمی‌کنند، بصیرت‌ها نیز او را درک نمی‌کنند.»\n\nو این بصیرت‌ها همان عقول هستند که او را با افکارشان درک نمی‌کنند، پس از رسیدن به مطلوب و ظفر یافتن به آن عاجز می‌مانند. و **«همه اسماء را به آدم آموخت»** (وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا) و او را به تعلیم ملأ اعلی امر کرد و به هر که در آسمان‌ها و زمین است فرمان داد که در آنچه این نایب سزاوار آن است بنگرند. پس تمامی آنچه در آسمان‌ها و زمین است را برای او مسخر ساخت، حتی کسی که از حیث تمامیتش انسان نامیده می‌شود، نه از حیث کمالش. پس این نوع که در اسم با او شریک است، اگر کامل نشود، از جمله مسخرشدگان برای کسی است که کامل شده است. و حق (الحق) در کمال خود به واسطه بی‌نیازی از عالمیان است، و او به تنهایی، یعنی انسان کامل (الإنسان الکامل)، پروردگارش را که از او بی‌نیاز است، عبادت می‌کند. پس کمال او در این است که از او بی‌نیاز نشود. و هیچ کس نیست که او را بدون تسبیح عبادت کند مگر انسان کامل، زیرا تجلی (التجلی) برای او دائمی است، پس حکم شهود (الشهود) برای او لازم است. از این رو، او کامل‌ترین موجودات در معرفت (المعرفة) به خدا و بادوام‌ترین آن‌ها در شهود است. و او به حق (الحق) دو نظر دارد، و به همین دلیل برای او دو چشم قرار داده شد: با یک چشم به او می‌نگرد از آن حیث که از عالمیان بی‌نیاز است، پس او را در هیچ چیز و در خود نمی‌بیند؛ و با چشم دیگر به او می‌نگرد از اسم رحمانش، از آن حیث که او عالم را می‌طلبد و عالم او را می‌طلبد، پس او را ساری در وجود (ساري الوجود) در هر چیزی می‌بیند. پس با این نظر از این چشم، به هر چیزی محتاج می‌شود، از آن حیث که اشیاء اسماء حق (الأسماء الحق) هستند، نه از حیث اعیانشان. پس هیچ کس فقیرتر از انسان کامل (الإنسان الکامل) به عالم نیست، زیرا او عالم را مسخر خود می‌بیند. پس دانست که اگر نیاز او به آنچه به خاطرش مسخر شده‌اند نبود، مسخر نمی‌شدند. پس خود را می‌شناسد که به عالم محتاج‌تر است تا عالم به او. پس این فقر عام برای او به جای غنای الهی عام قرار گرفت. پس در عالم در فقر، منزلت حق (الحق) را یافت از حیث اسماء الهی (الأسماء الإلهية) که طلب تأثیر در عالم می‌کنند. پس در فقر او جز ظهور اسماء حق (الأسماء الحق) ظاهر نشد. پس او در بی‌نیازی‌اش از عالم بر حق است، زیرا عالم در حق او به واسطه تأثیر اسماء الهی در آن (یعنی در عالم) مسخر شده است. پس برای او مسخر نمی‌شود مگر کسی که تأثیر دارد، نه از حیث عین عالم. پس او جز به خدا محتاج نشد. و او در فقرش به عالم بر حق است، زیرا وقتی دانست که خداوند عالم را برای این انسان مسخر نکرده است مگر برای اینکه عالم به آنچه از تسخیر مکلف شده‌اند، از طلب علم به او از حیث شهود (الشهود) مشغول شوند، زیرا این برای آن‌ها نیست، چون آن‌ها از مرتبه کمال پایین‌ترند، انسان کامل (الإنسان الکامل) نیاز به آنچه عالم در آن مسخر شده است را آشکار ساخت. پس تسخیر را در عالم تقویت کرد تا مبادا در آنچه حق (الحق) به آن امر کرده است کوتاهی کنند، زیرا **«از آنچه خدا به آن‌ها امر کرده سرپیچی نمی‌کنند»** (لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ). پس انسان کامل با اظهار این فقر، با حق (الحق) در مشغول ساختن عالم موافقت کرد. پس او در فقرش مانند اسماء بر حق بود و در بی‌نیازی‌اش نیز بر حق بود، زیرا مسخرشده برای خود را نمی‌بیند مگر کسی که اثر دارد، و آن اثر برای اسماء الهی است نه برای اعیان عالم. پس او جز به خدا در اعیان عالم محتاج نشد، و عالم به این امر علم ندارد.\n\nو هنگامی که آسمان با ساکنانش به ناله درآمد، پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: **«و حق دارد که به ناله درآید، زیرا در آن جای یک وجب نیست مگر اینکه فرشته‌ای در آن برای خدا سجده‌کننده است.»** پس در قولش «ساجد لله» (سجده‌کننده برای خدا) خبر داد تا بر نظر هر فرشته‌ای در آسمان به سوی زمین آگاه سازد، زیرا سجده به معنای خم شدن و فرود آمدن است. و آن‌ها دانستند که زمین جایگاه خلیفه است و به سجده امر شدند، پس به فرمان خدا سر فرود آوردند و به مکان این خلیفه می‌نگریستند تا سجده برای او باشد، زیرا خداوند آن‌ها را به سجده برای او امر کرد. و حکم سجده برای آدم و برای انسان کامل (الکامل) همیشه و ابدی در میان آن‌ها باقی است. اگر بگویی: آیا چنین سجده‌ای در سرای آخرت زائل می‌شود؟ می‌گوییم: زائل نمی‌شود، زیرا صورت ظاهری انسان کامل (الإنسان الکامل) که سجده برای آن واقع شد، خداوند آن را از طبیعت عنصری در ابتدا و اعاده ایجاد کرد. پس در ابتدا آن را از زمین رویاند، سپس با مرگ آن را به زمین بازگرداند، سپس با بعث آن را از آن خارج ساخت. و این صورت در مرتبه، سفل (پایین) است و با این حقیقت، خدایی را می‌طلبد که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) درباره‌اش فرمود: **«اگر ریسمانی را آویزان کنید، بر خدا فرود می‌آید.»** و امر در نفس خود نیز باید چنین باشد. پس همراهی سجده آن‌ها برای امام در دنیا و آخرت ضروری است.\n\nپس انسان کامل (الإنسان الکامل) صورت عالم و صورت حق (الحق) را حائز شد، و به واسطه این مجموع برتری یافت. پس سجده‌کننده و مسجودٌله در او و از اوست. و اگر امر چنین نبود، او جامع نبود. پس نزد ملأ اعلی برای دیدن انسان کامل (الإنسان الکامل) ازدحام است، همان‌گونه که مردم هنگام دیدن پادشاهی که بر آن‌ها طلوع می‌کند، ازدحام می‌کنند. پس آسمان به دلیل ازدحام آن‌ها به ناله درآمد. پس هر کس خدا را با این معرفت (المعرفة) بشناسد، نعمت‌های ظاهری و باطنی خدا را که بر او کامل کرده است، می‌شناسد. پس از مجادله در مورد خدا بدون علم (العلم) بیزاری می‌جوید. و آن علمی است که دلیل نظری به او نداده است، و نه کتاب روشنگری (كِتابٍ مُنِيرٍ) که تعریفی از صفات حق (الحق) در آن واقع شده باشد. پس فرمود: **«و از مردم کسانی هستند که بدون هیچ علم و دانش و بدون هیچ هدایت و کتاب روشنگری در مورد خدا مجادله می‌کنند»** (وَمِنَ النَّاسِ مَن يُجَادِلُ فِي اللَّهِ بِغَيْرِ عِلْمٍ وَلَا هُدًى وَلَا كِتَابٍ مُّنِيرٍ). «علم» یعنی دلیلی که فکرش به او داده باشد، و «هدایت» (هُدىً) یعنی بیانی که کشف (الکشف) برای او آشکار ساخته باشد، و «کتاب روشنگر» (كِتابٍ مُنِيرٍ) یعنی تعریفی که آیات معرفت (المعرفة) به خدا در کتب نازل شده‌اش که به نور توصیف شده‌اند، برای آشکار ساختن آنچه نازل شده است، واقع شده باشد، زیرا نور با آن آشکار می‌شود. پس آن‌ها را از تقلید حق (الحق)، از تجلی (التجلی) و کشف (الکشف)، و از نظر عقلی نفی کرد. و در جهل مرتبه‌ای پایین‌تر از این مرتبه نیست. و به همین دلیل از جانب حق (الحق) در معرض مذمت آمده است و کسی را که این صفت در اوست، مذمت می‌کند. و هنگامی که نعمت‌های خدا را همان‌گونه که گفتیم شناختند، این علم شکر را بر آن‌ها واجب ساخت، پس نفس‌های خود را به شکر او مشغول کردند.\n\nهمان‌گونه که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) انجام داد، هنگامی که بر او نازل شد: **«تا خداوند گناه گذشته و آینده تو را بیامرزد و نعمتش را بر تو تمام کند و تو را به راه راست هدایت نماید و خداوند تو را به نصرتی عزیز یاری دهد»** (لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِن ذَنبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعْمَتَهُ عَلَيْكَ وَيَهْدِيَكَ صِرَاطًا مُّسْتَقِيمًا وَيَنصُرَكَ اللَّهُ نَصْرًا عَزِيزًا). پس ایستاد تا پاهایش از شکر این نعمت ورم کرد. و هنگامی که در این باره به او گفته شد، چنین پاسخ داد و فرمود: **«آیا بنده شکرگزار نباشم؟»** (أَفَلَا أَكُونُ عَبْدًا شَكُورًا).\n\nپس صیغه «فَعُول» را آورد که برای مبالغه است. پس شکر از او زیاد شد، چون نعمت‌ها زیاد شد. پس هر نعمتی از او شکر خدا را بر آن طلب کرد. و در شکر صاحب این مقام، طلب فزونی (الزیادة) خطور نمی‌کند، زیرا شکر فعلی است که گذشته و حال را می‌طلبد. پس فزونی نعمت‌ها برای شاکر، فضلی از جانب خدا بود. و به همین دلیل آن را «زیاده» نامید که شکر آن را می‌طلبد نه شاکر. پس شاکر ثمره آن را می‌چیند. پس آن زیاده از جانب شکر است، به عنوان پاداش برای شاکر، از آن رو که عین شکر را در هستی (الوجود) ایجاد کرد و نشأت آن را به صورت مجسمی برپا داشت که خدا را تسبیح و ذکر می‌کند. پس شکر از خداوند متعال خواست که نعمتی بر نعمت‌های این شاکر بیفزاید، زیرا او سبب ایجاد عین شکر بود. پس خداوند از او شنید و درخواستش را اجابت کرد. سپس از او خواست که شاکران را به این امر آگاه سازد تا بدانند که شکر حق شاکر را نزد خدا ادا کرده است. پس خداوند به بندگانش فرمود: **«اگر شکر کنید، قطعاً بر شما می‌افزایم»** (لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ). پس ما را به زیاده آگاه ساخت. پس عارف بالله، خدا را شکر می‌کند تا خالق صورت شکر باشد و تسبیح‌کنندگان خدا و قیام‌کنندگان در عبادت او زیاد شوند. پس هنگامی که خداوند این را از او بداند، بر نعمت‌های ظاهری و باطنی او می‌افزاید تا وصف خلق شکر برای او دوام یابد. پس این امر برای او در دنیا و آخرت پیوسته دائمی است. و بزرگترین نشأتی که شکر در هستی (الوجود) با آن ظاهر می‌شود، نشأت شکر بر نعمت صورت کمالی و نشأت شکر بر نعمت تسخیر است. و فزونی از جانب خدا برای شاکر به اندازه صورت شکر است. پس بدان چگونه شکر کنی و به مهم‌تر و مهم‌تر از آن مشغول شو.\n\nپس اگر شاکر با شکر خود، فزونی (المزید) را به خاطر وعده الهی طلب کند، خداوند از نعمت فزونی به او عطا نمی‌کند مگر به اندازه طلب و صورت او از حیث آمیختگی (تخلیط) و سلامت. پس فزونی او فقط مغفرت، عفو و گذشت خواهد بود. و در مجموع، از درجه اولی که به واسطه درخواست شکر به او عطا شد، پایین‌تر می‌آید. زیرا نشأت شکر در ذات خود از آمیختگی مبرا است، و اگرچه شاکر آمیخته باشد، آمیختگی او در صورت شکر اثری ندارد، اما در فزونی اثر دارد، اگر برای به دست آوردن فزونی شکر کند. پس برتری میان شاکران بر اساس آنچه مقرر کردیم، از طالبان فزونی و غیر طالبان، و مشغول‌شوندگان به مهم‌تر و غیر مشغول‌شوندگان به آن، حاصل می‌شود. پس این‌ها راه‌های مختلفی برای خدا هستند، همان‌گونه که فرمود: **«برای هر یک از شما شریعت و راهی قرار دادیم»** (لِكُلٍّ جَعَلْنَا مِنكُمْ شِرْعَةً وَمِنْهَاجًا). و این‌ها همان راه‌ها هستند، در حالی که حقیقت (الحقيقة) یک عین واحد است که غایت این راه‌هاست، و آن قول اوست: **«و همه امور به سوی او بازگردانده می‌شود»** (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ).\n\nو اما قول خداوند متعال به پیامبرش محمد (ص) در سوره فتح، که فتح مکاشفه (المکاشفة) به حق (الحق)، فتح حلاوت در باطن، و فتح عبارت است. و به خاطر این فتوحات بود که قرآن معجزه شد. هیچ کس فتح عبارت را به کمال آنچه به رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) عطا شد، دریافت نکرد. زیرا او فرمود: **«اگر انس و جن گرد هم آیند تا همانند این قرآن را بیاورند، نمی‌توانند همانند آن را بیاورند، هر چند برخی از آن‌ها پشتیبان برخی دیگر باشند»** (لَئِنِ اجْتَمَعَتِ الْإِنْسُ وَالْجِنُّ عَلَى أَنْ يَأْتُوا بِمِثْلِ هَذَا الْقُرْآنِ لَا يَأْتُونَ بِمِثْلِهِ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًا) یعنی یاور. پس به او فرمود: **«ما برای تو فتحی آشکار گشودیم»** (إِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِينًا) در سه نوع از فتوحات، فتحی که آن را با مصدر تأکید کرد، «مبین» یعنی آشکار که هر کس آن را ببیند، به واسطه آنچه تجلی (التجلی) کرده و دربرگرفته است، آن را می‌شناسد. پس فتح حلاوت به صورت ذوق برای او ثابت است، و فتح عبارت به واسطه عجز عرب از معارضه برای او ثابت است، و فتح مکاشفه (المکاشفة) به واسطه آیاتی که در شب معراج به او شهود (الشهود) داد، ثابت است: **«تا خداوند گناه گذشته و آینده تو را بیامرزد»** (لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِن ذَنبِكَ وَمَا تَأَخَّرَ). پس تو را از آنچه صاحب گناه سزاوار آن است، از عتاب و مؤاخذه می‌پوشاند. و «آنچه تأخیر یافته» تو را از عین گناه می‌پوشاند تا گناه تو را نیابد و در تو قیام نکند. پس با مغفرت در گناه متأخر، ما را آگاه ساخت که او بدون شک معصوم است. و عصمت او را این تأیید می‌کند که خداوند او را اسوه‌ای قرار داد تا به او اقتدا شود. پس اگر خداوند او را در مقام عصمت قرار نمی‌داد، بر ما لازم بود که در گناهانی که از او سر می‌زند، به او اقتدا کنیم، مگر اینکه بر آن‌ها تصریح شود، همان‌گونه که بر نکاح با هبه تصریح شد که آن برای او خالص و مشروع است، در حالی که بر ما حرام است.\n\nو **«نعمتش را بر تو تمام کند»** (وَيُتِمَّ نِعْمَتَهُ عَلَيْكَ) به این صورت که خلقت آن را به آن عطا کند، زیرا ما را به نعمت‌های خلق شده و غیر خلق شده آگاه ساخته است. و با این آیه خبر داد که نعمتی که به محمد (صَلَّى اللهُ عَليهِ وسَلَّم) عطا کرده، خلق شده، یعنی کامل الخلقه است. و **«تو را به راه راست هدایت کند»** (وَيَهْدِيَكَ صِرَاطًا مُّسْتَقِيمًا)، و آن صراط پروردگار اوست که بر آن است، همان‌گونه که هود (علیه السلام) فرمود: **«همانا پروردگار من بر راهی راست است»** (إِنَّ رَبِّي عَلَى صِرَاطٍ مُّسْتَقِيمٍ). و شریعت‌ها همگی نور هستند، و شریعت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) در میان این انوار مانند نور خورشید در میان انوار ستارگان است. پس هنگامی که خورشید ظاهر شود، انوار ستارگان پنهان می‌شوند و انوار آن‌ها در نور خورشید مستتر می‌گردد. پس پنهان شدن آن‌ها نظیر نسخ شدن شرایع به واسطه شریعت او (صَلَّى اللهُ عَليهِ وسَلَّم) است، با وجود اعیان آن‌ها، همان‌گونه که وجود انوار ستارگان محقق است. و به همین دلیل در شریعت عام ما لازم شده است که به تمامی رسولان و تمامی شرایع آن‌ها ایمان بیاوریم که حق هستند. پس با نسخ، باطل نشدند؛ این گمان کسانی است که جاهل شدند. پس تمامی راه‌ها به راه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) نظر دارند. پس اگر رسولان در زمان او بودند، از او پیروی می‌کردند، همان‌گونه که شرایع آن‌ها از شریعت او پیروی کرد، زیرا به او جوامع الکلم (سخنان جامع) عطا شده است.\n\nو **«خداوند تو را به نصرتی عزیز یاری دهد»** (وَيَنصُرَكَ اللَّهُ نَصْرًا عَزِيزًا). و عزیز کسی است که قصد او شود، اما رسیدن به او ممکن نباشد. پس اگر رسولان طالب رسیدن به او باشند، به واسطه بعثت عام او و اعطای جوامع الکلم به او و سیادت به مقام محمود در سرای آخرت و قرار دادن امتش به عنوان **«بهترین امتی که برای مردم پدیدار شده است»** (خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ)، درک او برای آن‌ها دشوار شده است. و امت هر پیامبری به اندازه مقام پیامبرش است، پس این را بدان. و اگر قائلان به اکتساب نبوت، طلب رسیدن به او کنند، رسیدن به آن برایشان دشوار است، زیرا آنچه اکتسابی است، فقط سلوک و رسیدن به درگاه است. اما آنچه ورای درگاه است، واصلان به آن نمی‌دانند که آن درگاه برای چه کسی گشوده می‌شود. پس برخی از مردم هستند که درگاه برایشان با ایمان عام گشوده می‌شود، و آن مطالعه حقیقت (الحقيقة) است، مانند ابوبکر که هیچ چیز را ندید مگر اینکه خدا را قبل از آن دید. و برخی از آن‌ها هستند که درگاه برایشان با اِنباء عام که در آن شریعتی نیست، گشوده می‌شود. و این دو فتح تا روز قیامت در این امت باقی است. و از واصلان کسانی هستند که درگاه با نبوت تشریع که مخصوص آن‌هاست، برایشان گشوده می‌شود. و برخی از آن‌ها هستند که درگاه با رسالت به آنچه تشریع شده است، برایشان گشوده می‌شود. و این دو درگاه یا دو فتح، خداوند منع کرده است که کسی به آن‌ها تحقق یابد یا در آن‌ها برایش گشوده شود، مگر اهل اجتهاد. زیرا خداوند مقداری از آن را با تقریر شریعت برای آن‌ها باقی گذاشته است، پس حکم آن برای شارع است نه برای آن‌ها. پس هر آنچه هنگام گشوده شدن از ورای درگاه خارج شود، اکتسابی نیست، و نبوت اکتسابی نیست. پس خداوند او را به نصرت عزیز یاری داد، و کسی که قائل به اکتساب نبوت است، به او نرسید، زیرا برای کسی که به عزت توصیف شده است، عین عزت وجود ندارد مگر با وجود طالب برای کسی که عزت در او قائم است. پس مقام و حضرت او محافظت می‌شود که هیچ طالب به او نرسد.\n\nپس شریعت‌های حکمی سیاسی که به صورت شرایع الهی ظاهر می‌شوند، این نصرت عزیز را ندارند، بلکه این نصرت مختص صاحب شریعت الهی نازل شده است. و حقیقت (الحقيقة) هر دو شریعت را در بر می‌گیرد: شریعت الهی و حکمی سیاسی. پس صاحب شریعت، که همان مؤمن است، تنها در پیشگاه محقق که صاحب حقیقت (الحقيقة) است، زانو می‌زند تا مأخذ هر شریعتی را از حضرت الهی برای او بیان کند، و این را جز صاحب حقیقت نمی‌داند. به همین دلیل این منزل به «زانو زدن شریعت در پیشگاه حقیقت» نامیده شد، زیرا هر شریعتی آن را می‌طلبد، چرا که حقیقت باطن هر شریعتی است و شرایع صورت‌های ظاهری آن در عالم شهادت هستند. و به همین دلیل هیچ امتی از بیم‌دهنده‌ای که به سیاست آن‌ها قیام کند، خالی نمی‌ماند تا مصلحت در حق آن‌ها باقی بماند، خواه آن شریعت الهی باشد یا سیاسی، در هر حال مصلحت به واسطه آن در قرنی که در آن ظاهر می‌شود، واقع می‌گردد. و پس از آنکه منزلت شریعت را نسبت به حقیقت دانستی، و بابی مخصوص به آن در این کتاب پیش‌تر آمده است، اکنون علوم دربرگیرنده این منزل را ذکر می‌کنیم.\n\nاز جمله آن علوم، علم لوای خاصی از پرچم‌های حمد و اسماء آن است. و علم حکم رحمت این لوا در عالمی که تحت آن قرار دارد. و علم مناسباتی که اشیاء صوری به واسطه آن‌ها به یکدیگر ضمیمه می‌شوند تا اعیان صورت‌هایی را برپا دارند که جز با این انتظام ظاهر نمی‌شوند، و این صورت‌ها علم را به ذات خود به بیننده می‌دهند. و در آن علم اعلام به واسطه نشانه‌های نصب شده بر راه برای سالکان است تا از مقصود خود که غایت راهشان است، گمراه نشوند. و در آن علم انواع روزی‌هاست، زیرا با اختلاف روزی‌گیرندگان متفاوت است. و در آن علم فایده اخبار با عبارتی است که با قرائن احوال تأیید شده است؛ آیا حصول علم به آن خبر از خود خبر است یا از قرائن احوال یا از مجموع؟ یا علمی که قرینه حال می‌دهد غیر از علمی است که خبر می‌دهد؟ یا در جایی با هم جمع می‌شوند و در جایی جمع نمی‌شوند؟ و در آن علم فرق میان استماع است که آیا با فهم واقع می‌شود یا به غیر آن؟ و فرق میان کسی که او، خود اوست و کسی که گویی او، اوست. و در آن علم جزای خاص هر مجازات‌شونده‌ای است. و در آن علم علم عامی است که غایت آن عمل است و علمی که غایت آن عمل نیست. و در آن علم نسبت عالم به حق (الحق) از طریق خاص است. و در آن علم آنچه افکار از علوم در قلوب متفکران تولید می‌کنند. و در آن علم تقریر نعمت‌هاست. و در آن علم آنچه عالم برای آن خلق شده است و سببی که میان او و آنچه برای آن خلق شده حائل گشته است، با وجود علم به آنچه برای آن خلق شده است. و هیچ چیز قوی‌تر از علم نیست، زیرا علم احاطه دارد، پس مقاومت‌کننده تحت احاطه آن است، پس کجا می‌تواند برود؟ و در آن علم کسی است که از اهل امر است و کسی که از آن‌ها نیست. و در آن علم ولایت وجودی (الولایة الوجودية) ساری است که به واسطه آن ظالمان **«برخی ولیّ برخی دیگرند»** (بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ) و مؤمنان **«برخی ولیّ برخی دیگرند»** (بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ). و خداوند **«ولیّ مؤمنان است»** (وَاللَّهُ وَلِيُّ الْمُؤْمِنِينَ) از آن حیث که مؤمن است. پس از کجا ولیّ متقین است در حالی که به تقوا متصف نیست؟ یا به تقوا متصف است از آن حیث که جن و انس را وقایه‌ای قرار داده است که با آن از نسبت دادن صفات مذموم عرفی و شرعی به خود پرهیز می‌کند، پس آن صفات به جن و انس نسبت داده می‌شود، و این دو همان وقایه‌ای هستند که با آن از این نسبت پرهیز کرده است. پس او ولیّ متقین است از آن حیث که متقی است. و اگر او ولیّ آن‌ها باشد و جز متقی در آنجا نباشد، پس این بشارتی از جانب خدا برای همگان به عموم رحمت و نصرت بر غضب است، زیرا ولیّ همان ناصر است، پس بفهم. و در آن علم مراتب نسبت به شریعت به طور خاص است، نه مراتب به آنچه وجود اقتضا می‌کند. و در آن علم اله اعظم است که تشریع اتخاذ آلهه از غیر خدا را قرار داد. و در آن علم حیرت در چیزی است که به قطع می‌دانی که برای تو معلوم است، در حالی که علم ضد حیرت در معلوم خود است، پس چه چیزی تو را با وجود علم متحیر ساخته است؟ و در آن علم سلب هدایت از عالم است با وجود قول او: **«بیان را به او آموخت»** (عَلَّمَهُ الْبَيَانَ) که عین هدایت است. و در آن علم دهر از زمان است. و در آن علم جمع اوسط است، زیرا جمع در سه موضع ظاهر شد: در گرفتن میثاق، در برزخ میان دنیا و آخرت، و جمع در بعث پس از مرگ. و پس از این جمع، جمع فراگیری وجود ندارد، زیرا پس از قیامت هر سرایی به اهل خود مستقل می‌شود و عالم انس و جن پس از این جمع هرگز با هم جمع نمی‌شوند. و در آن علم نحل (فرقه‌ها) و ملل (آیین‌ها) است. و علم عموم نطق ساری در تمام عالم است و اینکه نطق مختص انسان نیست، همان‌گونه که آن را فصل مقوم او قرار دادند که «حیوان ناطق» است. پس کشف (الکشف) به خصوصیت این حد در انسان قائل نیست، بلکه انسان را به صورت الهی به طور خاص تعریف کرده است. و کسی که این حد را ندارد، انسان نیست، بلکه حیوانی است که در صورت ظاهری شبیه انسان است. پس برای صاحب این وصف، حدی خاص او را طلب کن، همان‌گونه که برای سایر حیوانات طلب کردی. و در آن علم ماهیت نسخ است که آیا در اعیان واقع می‌شود و با مسخ از آن تعبیر می‌شود، همان‌گونه که در احکام واقع می‌شود، یا خیر؟ و در آن علم مراتب فوز است، زیرا فوز مطلق، فوز مقید به انابه، و فوز مقید به عظمت وجود دارد، و حد هر یک از آن‌ها چیست؟ و در آن علم استحقاق است. و در آن علم یقین، علم، ظن، جهل، شک و نظر است. و در آن علم حکم شهود (الشهود) از حکم علم است. و در آن علم کسی است که خداوند از او راضی نیست، اگرچه به او رحم کند، پس رحمت او از روی رضایت نبوده است. و فرق میان مرحوم از روی رضایت و مرحوم نه از روی رضایت چیست؟ و منزل هر یک از آن‌ها در دو سرا کجاست؟ و در آن علم کبریایی و جبروت است که چه زمانی عموم آن در عالم ظاهر می‌شود به طوری که به تعیین شناخته شود، زیرا اکنون ظاهر است و جز اندکی از مردم آن را نمی‌دانند. و **«خداوند حق را می‌گوید و او راه را هدایت می‌کند»** (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 5
}