{
  "id": 287,
  "title": {
    "ar": "الباب السابع والثمانون ومائتان في معرفة منزل التجلي الصمداني وأسراره من الحضرة المحمدية",
    "en": "Chapter Two Hundred and Eighty-Seven: Concerning the Gnosis of the Station (منزل) of the Eternally Besought Self-disclosure (التجلي الصمداني) and its Mysteries from the Muhammadan Presence (الحضرة المحمدية)",
    "ur": "باب دو سو ستاسی (۲۸۷) صمدانی ظہور الٰہی (التجلی الصمدانی) کے منزل کی معرفت اور اس کے اسرار کے بیان میں، جو الحضرة المحمدیۃ سے ہیں۔",
    "fa": "باب دویست و هشتاد و هفتم در معرفت منزل تجلی صمدانی (التجلي الصمداني) و اسرار آن از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب السابع والثمانون ومائتان في معرفة منزل التجلي الصمداني وأسراره من الحضرة المحمدية»\n\n\n> شخص الزمان له نفس تدبره *** غيدا معطرة من عالم الأمر\n\n\n> جيم وعين وفاء من منازلها *** جاءت به رسله في محكم الذكر\n\n\n> لها صلاتان من علم الغيوب وما *** للظهر والعصر ذاك الفخر والفجر\n\n\nمن أراد أن يقف على ما تضمنه هذا المنزل في التجلي الصمداني الذي هو خاص به من المعارف والحقائق والأسرار الضيائية وغيرها فليطالعه في باب القلب من كتاب مواقع النجوم لنا في علم هذا الطريق فلنذكر في هذا المنزل ما سوى ذلك مخافة التطويل‏\n\n\n### [إن الإنابة من منزل التجلي‏]\n\n\nفاعلم إن لهذا المنزل الإنابة وممن تحقق بها أبو يزيد البسطامي وهي الجمعية الذاتية ولا تكون للعارف من الله إلا عن شهود محقق من خلف حجاب مظهر بشرى واعلم أن القوم قد اصطلحوا على ألفاظ لمعان قرروها في نفوسهم يخاطبون بها بعضهم بعضا كما فعلت كل طائفة فيما تنتحله من العلوم كالنحويين وأصحاب العدد والمهندسين والأطباء والمتكلمين والفقهاء وغيرهم فمما اصطلحت عليه هذه الطائفة الهوية والإنية والأنانية لأغراض في نفوسهم فهذا المنزل من ذلك منزل الأنانة فالإنية هي عبارة عن الحقيقة من حيث الأحدية والأنانية التي هنا عبارة عن الحقيقة الأحدية التي هي عين الجمع فهذا منزل من منازل الغيوب لا ظهور له في الشهادة لكن المنازل التي في الغيب على ضربين منازل يكون عنها آثار في الشهادة يستدل بتلك الآثار عليها وإن كانت غيبا سواء ورد بذلك التعريف الإلهي أو لم يرد من حيث الخطاب ومنازل لا يكون عنها في الشهادة أثر فلا تعرف إلا من طريق التعريف الإلهي ولا نتحقق تحقق منازل الآثار وهذه الأنانية من المنازل التي لها آثار في عالم الشهادة والملكوت وآثارها مختلفة وتتقيد باختلاف آثارها وإن كانت في نفسها مطلقة فتارة تتقيد باسم ضمير مثلها في الرتبة فتحتاج إلى تقييد آخر مثل قوله تعالى إنا أوحينا إليك فإنا والنون من أوحينا على مرتبة واحدة من حيث أحدية حقيقة الجمعية والتقييد لأنا الوحي والتقييد للنون من أوحينا ما يذكره بعده من قرآن أو روح أو غير ذلك وتارة لا يتقيد باسم ضمير مثل قولهم إنا بنى فلان وكما قيل‏\n\n\n> نحن بنى ضبة إذ جد الوهل *** الموت أحلى عندنا من العسل‏\n\n\nوما وقفت على مثل هذا في القرآن فكنا نستشهد به وإنما استشهدت بهذا وإن لم يكن قرآنا فإنه من كلام العرب الذي نزل القرآن بلسانهم والذي تقيدت به في هذا المنزل الإنزال الإلهي لا التنزيل على العارفين من عباده إما بما أجراه في خلقه أو بما يجريه في خلقه وإنزاله على قسمين قسم يكون الإنزال على جهة التعريف بمكانة ما يجريه في خلقه أو ما أجراه‏\nومرتبته فيكون تنزله على قلب لعبد من الغيب في الغيب من عين واحد إلى عين واحد لا يقبل التفصيل والقسم الآخر يكون تنزله على قلب العبد وهو مشغول في تدبير هيكله وطبيعته لا يأخذه عن ذلك وذلك الإنزال من عين جمع إلى عين جمع ليفصل ما نزل عليه لخلقه مما أجراه لله أو يحكيه حكى لنا عن جماعة منهم أبو البدر عن شيخنا عبد القادر رحمه الله أنه قال إن السنة تأتيني إذا دخلت فتخبرني بما يكون فيها ويحدث وكذلك الشهر والجمعة واليوم وكذلك كان الشيخ أبو يعزى أبو النور ببلاد المغرب كان إذا دخل رمضان جاءه يعلمه بما قبل فيه من العمل وممن قبل ويقبل وإنما قيدته هنا في حق شيخنا أبي يعزى برمضان لأن صاحبنا أبا زيد الرقراقي الأصولي أخبرني بشهادة هذا في شهر رمضان إذ كان هذا المخبر عنده في ذلك الوقت فرأى رمضان قد جاءه مخبرا بما ذكرناه فلا تعرف منازل الأكوان عند الله من طريق التعريف الإلهي والعناية بهذا المقرب إلا بتعريف الله عباده في أسرارهم بما يلقيه فيها من نفث روح في روع مثل ما كانت الملائكة تنزل على الأنبياء عليهم السلام بذلك‏\n\n\n### [إن مراتب الخلق متفاضلة]\n\n\nواعلم أن المراتب التي يكون الخلق عليها متفاضلة في كل جنس فالرسل يفضل بعضهم بعضا والأنبياء يفضل بعضهم بعضا والمحققون يفضل بعضهم بعضا والعارفون يفضل بعضهم بعضا وهكذا إلى أصحاب الصنائع العملية فهذا المنزل يفضل غيره في التجليات الإلهية المشبه رؤيتها برؤية القمر والشمس بألفي تجل وثمان تجليات منطوية مندرجة في الألفين المذكورين غير أن هذه الثمانية لها خصوص وصف يظهر في تجلى المقامات الذي هو مائة وستة وستون تجليا فعند ذلك يظهر سلطان هذه الثمانية من التجليات ويعطي من المعارف ما شاء الله أن يعطي وأما الألفان فهي تجليات سريعة الزوال مكثها قليل ولا تعطي علما عاما وأما المائة والستة والستون فتعطي من العلوم العامة السارية في الموجودات وبقائها وما يكون عنها وبسببها علما عاما مجردا خالصا ثابتا لا يتزلزل ولا يشتبه وإن كان حكمه ينتقل منه وفيه ولا يخرج عنه واختلف أصحابنا هل ثم تجل في هذه التجليات يتصف بالنقص من حيث الصورة التي يتجلى فيها إذا كانت صورة طبيعية والطبائع رباعية فيكون التجلي الناقص في الصورة الطبيعية في وقت في العنصر الناري فيكون غير كامل في نفسه ولكن يعطي بحسب ما يعطيه عنصره لا يزيد عليه فإذا كان في تجل آخر انضاف إلى تلك الصورة العنصر الثاني إلى أن يكمل العناصر في أربع تجليات فيقع التجلي في العنصر الرابع بكمال الصورة الطبيعية على صورة مكملة فيلحق بإخوانه من التجليات والأمر عندنا ليس كذلك ولا يصح أن يكون هناك تجل ينقص أو يزيد وإنما هذا الشخص القائل بهذا ظهرت له حالته في عين التجلي فتخيل أن النقص في التجلي وكان النقص فيه ثم اتفق أنه لما تجلى له التجلي الثاني رأى تلك الصورة التي كان عليها في نفسه قد زاد فيها ما لم يكن والنقص والزيادة فيه فحكم على التجلي بذلك‏\n\n\n### [أن الأرواح النورية المسخرة تنزل على قلوب العارفين‏]\n\n\nواعلم أن الأرواح النورية المسخرة لا المدبرة تنزل على قلوب العارفين كما قلناه بالأوامر والشئون الإلهية والخيرات بحسب ما يريده الحق بهذا العبد فترقيه بما نزلت به إليه ترقية وتخليصا إلى الحجاب الأقرب من الحجب البعيدة إلى أن يتولاه الله بارتفاع الوسائط غير إن هذا القلب إذا فارقته التنزلات الروحية التي يشترك فيها أهل هذه الطريقة والحكماء العاملون على تصفية النفوس وتخليصها من كدر الطبع وقبل أن يتولى الحق أمره بارتفاع الوسائط يمكث معرى عن الأمرين مثل الوقفة بين المقامين ومثل النومة العامة بين الحس والخيال وهو مقام الحيرة لهذا القلب فإن الذي كان يأنس إليه ويأخذ عنه قد فقده والذي يأتي إليه ما رآه بعد فيبقى حائرا ولقد أخبرني صاحبي أبو إسحاق إبراهيم بن محمد الأنصاري القرطبي وفقه الله عن شيخنا أبي زكريا الحسنى ببجاية قال أخبرني غير واحد من أصحابه وممن حضر موته أن الشيخ خرج إلى الناس وكان في المسجد الجامع معتكفا في شهر رمضان وقد غير لباسه الذي كان عليه وقد ظهر فيه التغير فقال لهم ادعوا لي فإني قد فقدت الذي كان عندي ولم يكن بعد قد حصل له شي‏ء مما يأتي وحار في أمره فطلب من الناس الدعاء له فإنه لم يكن من أهل الأذواق الإلهية لغلبة الفقه عليه ما تخلص له الأمر ثم عاد إلى خلوته فأبطأ عليهم خروجه فدخلوا عليه فإذا هو مسجى قد فارق الدنيا فأشار إليهم بتغيير لباسه إن الذي كان يلبسه قد جرد عنه والحيرة والافتقار إلى دعاء الإخوان دلت على أنه ما كان الحق تولى أمره الذي أومأنا إليه ففرحت له بذلك لعل الله يكون قد تولاه قبل موته بلحظة فقبضه إليه وهو عنده وحال العارف في هذه الحيرة والوقفة التضرع‏\nوالابتهال إلى الله بالافتقار والخشوع المستعمل في إن يتجلى له حكم توليه إياه بارتفاع الوسائط من الوجه الخاص الذي بين كل موجود وبين ربه الذي لا يعرفه كل عارف ومن هذا المنزل يعرف ما ينزل الحق من المعارف على قلوب عباده بإنزال الأرواح إليها قال تعالى يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ ... أَنَّهُ لا إِلهَ إِلَّا أَنَا ولم يقل هو فكان الروح هو الملقي من عند الله إلى قلوب عباده ويكون أمر الله هو الذي ألقاه ويكون ذلك الروح صورة قوله لا إِلهَ إِلَّا أَنَا فَاتَّقُونِ فارتفعت الوساطة في هذا المنزل إذ كان عين الوحي المنزل هو عين الروح وكان الملقي هو الله لا غيره فهذا الروح ليس عين الملك وإنما هو عين المالكة فافهم فمثل هذا الروح لا تعرفه الملائكة لأنه ليس من جنسها فإنه روح غير محمول ليس نورانيا والملك روح في نور وهذا الذوق لنا ولسائر الأنبياء وأما الملائكة فقد يكونون ممن اختص بهم الرسل وهو قوله تعالى نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ فهو رسول الرسول وأما تنزل الأرواح الملكية على قلوب العباد فإنهم لا ينزلون إلا بأمر الله الرب وليس معنى ذلك أن الله يأمرهم من حضرة الخطاب بالإنزال وإنما يلقي إليهم ما لا يليق بمقامهم في صورة من ينزلون عليه بذلك فيعرفون إن الله قد أراد منهم الإنزال والنزول بما وجدوه في نفوسهم من الوحي الذي لا يليق بهم وأن ذلك الوحي من خصائص البشر ويشاهدون صورة المنزل عليه في الصور التي عندهم تسبيحها يا من أظهر الجميل وستر القبيح للستور التي تسدل وترفع فيعرفون من تلك الصور من هو صاحبها في الأرض فينزلون عليه ويلقون إليه ما ألقى إليهم فيعبر عن ذلك الملقي بالشرع والوحي فإن كان منسوبا إلى الله بحكم الصفة سمي قرآنا وفرقانا وتوراة وزبورا وإنجيلا وصحفا وإن كان منسوبا إلى الله بحكم الفعل لا بحكم الصفة سمي حديثا وخبرا ورأيا وسنة وقد ينزلون أيضا بالأمر الإلهي من حضرة الخطاب وكلا الوجهين من التنزل يتضمنه قول جبريل لمحمد صلى الله عليه وسلم لما قال له الحق أن يفر له لنبيه صلى الله عليه وسلم عن ربه ولهذا جعله من القرآن وهو حكاية الله عن جبريل وجبريل هو الذي نزل به وما أخرجه نزوله به والحكاية عنه عن إن يكون قرآنا فكان جبريل يحكي عن الله تعالى ما حكى الله تعالى عن جبريل أن لو قال لمحمد صلى الله عليه وسلم ذلك لقاله له على هذا الحد في عالم الشهادة وهو قوله وما نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ لَهُ ما بَيْنَ أَيْدِينا وما خَلْفَنا وما بَيْنَ ذلِكَ وما كانَ رَبُّكَ نَسِيًّا فيما شاهده من قول جبريل لمحمد عليهما السلام وهم أعيان ثابتة في حال عدمهم وخطاباتهم أعيان ثابتة في حال عدمهم له فهو الإشارة إليه بقوله نَسِيًّا فكانت الحكاية أمرا محققا عن وجود لله محقق لا يتصف بالحدوث ثم حدث الوجود لتلك الأعيان فأخبرت بما كان منها قبل كونها مما شاهده الحق ولم تشهده لعدم وجودها في عينها روى عن الزهري أنه حدث عن شخص من الثقات حديثا أو حدث عنه فقال المحدث عنه لا أعلم هذا الحديث ولا أنا منه على يقين ولكن أنت عندي ثقة فرواه عنه عن نفسه وقال حدثني فلان عني وقال إني قلت له حدثني فلان واتصل الإسناد فتنبه لهذه المسألة في طريق الرواية ومما يتضمن هذا المنزل فضل العلم المستور على العلم المشهور والعلم المستور هو على ضربين ضرب منه لم يضمن في الشهادة صور كلمات وضرب ضمن صور كلمات فمثل العلم المضمن صور كلمات وهو مستور عن إن يتعلق به معرفة عارف على القطع إلا بأخبار إلهي فهو علم ما تشابه من القرآن الذي لا يعلم تَأْوِيلَهُ إِلَّا الله فهذا من العلوم المستورة ولكن لا يعرف من صور الكلمات في أي وجه هو مستور فيه والعلم الثاني المستور هو الذي لم يكن له صورة يحتجب بها من صور الكلمات وفضل مثل هذا العلم ومنزلته مجهولة يعلمها الله ومن أعلمه الله وقد يصادف الإنسان العمل بما يقتضيه ذلك العلم وهو لا يعرف ذلك حتى ينتقل إلى الدار الآخرة فيجد ثمرة عمله مرتبطة بمنزلة ذلك العلم المستور فيعلمه‏\n\n\nعند ذلك ومما يتعلق بهذا الباب إنزال الهو منزلة الشاهد مع بقاء الهو في عينه منزها ولا يكون الهو ينزل أبدا إلا في صور مدركة بالحس إما في الحس وإما في الخيال ويسمى بالهو في حال ظهور الصورة ليعلم أن الهو روح تلك الصورة ومدلولها فيعلم إن تلك الصورة لا يعلم معناها إلا الله كما قال تعالى وعِنْدَهُ مَفاتِحُ الْغَيْبِ لا يَعْلَمُها إِلَّا هُوَ ومن كان عند الهو كان بحيث الهو والهو غيب والذي يكون عنده غيب وإذا كان غيبا عند غيب فلا تعلمه الشهادة وإنما يعلمه الغيب فلا يعلم ما في الغيب إلا من هو غيب فمن حيث الصور ينسب إلى الغيب الظرفية فإذا ارتفعت الصور زال الغيب لأن الحجاب قد ارتفع فلا يتصف‏\nبالغيب ولا بالشهادة لأن الشهادة لا تنفك عن الصور وقد قلنا لا صورة فقد قلنا لا شهادة والصورة تجعل ذلك الأمر غيبا وقد قلنا بزوال الصورة فقد رفعنا حكم الغيب عن ذلك الأمر فلا غيب ولا شهادة وفي هذا المنزل من العجائب والأسرار ما لو أظهرناه لتوقفت عقول أكثر علماء هذه الطريقة السليمة عن قبول مثلها ومن هذا المنزل يتلقى ملك الموت آجال الناس واختلف أهل الكشف في آجال الحيوان وفي آجال كل ما سوى الإنسان هل هذا المنزل منزل علمها أم لا وهل لما عدا الحيوان آجال أم لا\n\n\n### [إن الله تعالى جعل لكل صورة في العالم أجلا]\n\n\nفاعلم إن الله تعالى جعل لكل صورة في العالم أجلا تنتهي إليه في الدنيا والآخرة إلا الأعيان القابلة للصور فإنه لا أجل لها بل لها منذ خلقها الله الدوام والبقاء قال تعالى كُلٌّ يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى وقال ثُمَّ قَضى‏ أَجَلًا وأَجَلٌ مُسَمًّى عِنْدَهُ فجاء بكل وهي تقتضي الإحاطة والعموم وقد قلنا إن الأعيان القابلة للصور لا أجل لها فبما ذا خرجت من حكم كل قلنا ما خرجت وإنما الأجل الذي للعين إنما هو ارتباطها بصورة من الصور التي تقبلها فهي تنتهي في القبول لها إلى أجل مسمى وهو انقضاء زمان تلك الصورة فإذا وصل الأجل المعلوم عند الله في هذا الارتباط انعدمت الصورة وقبل العين صورة أخرى فقد جرت الأعيان إلى أجل مسمى في قبول صورة ما كما جرت الصورة إلى أجل مسمى في ثبوتها لتلك العين الذي كان محل ظهورها فقد عم الكل الأجل المسمى فقد قدر الله لكل شي‏ء أجلا في أمر ما ينتهي إليه ثم ينتقل إلى حالة أخرى يجري فيها أيضا إلى أجل مسمى فإن الله خلاق على الدوام مع الأنفاس فمن الأشياء ما يكون مدة بقائه زمان وجوده وينتهي إلى أجله في الزمان الثاني من زمان وجوده وهي أقصر مدة في العالم وفعل الله ذلك ليصح الافتقار مع الأنفاس من الأعيان إلى الله تعالى فلو بقيت زمانين فصاعدا لاتصفت بالغنى عن الله في تلك المدة وهذه مسألة لا يقول بها أحد إلا أهل الكشف المحقق منا والأشاعرة من المتكلمين وموضع الإجماع من الكل في هذه المسألة التي لا يقدرون على إنكارها الحركة إلا طائفتين من يجعل الحركة نسبة لا وجود لها وهو الباقلاني من المتكلمين وأصحاب الكمون والظهور القائلون به وإن قال القائلون بالكمون والظهور بذلك فإنهم تحت حيطة كل بهذا المذهب فإنه قد جرى في كمونه إلى أجل مسمى وهو زمان ظهوره فقد انقضت مدة كمونه وجرى في ظهوره إلى أجل مسمى وهو زمان كمونه فقد انقضت مدة ظهوره ولا يلزم من جريانهم إلى الأجل أن المراد عدمهم بل يجوز أن يكون له العدم ويجوز أن يكون الانتقال مع بقاء العين الموصوفة بالجري ويجوز أن يكون منه أجل يعدمه ومنه ما يكون له أجل بانتقاله يعدمه وهو الذي نذهب إليه ونقول به‏\n\n\n### [إن لله أرواحا من الملائكة ما لا يدري مقداره‏]\n\n\nواعلم أن لله في هذا المنزل أرواحا من الملائكة بأيديهم من الخيرات والنعيم الدائم ما لا يدري مقداره إلا الله تعالى قد وكلهم الله على ذلك وجعلهم حفظة عليه وخزانا لأصحابه من الأناسي يؤدون ذلك إليه في الوقت الذي قد قرر لهم الحق ذلك وعينه لهم بالحال التي ينتقل ذلك العبد السعيد إليها وكذلك له ملائكة خزنة بالنقيض أيضا معدة لإنسان آخر يؤدون ذلك إليه في الوقت الذي قرره الحق لهم بالحال التي ينتقل إليها ذلك العبد الشقي كل ذلك بتقدير العزيز العليم‏\n\n\n### [خلق الملائكة من تكلم العبد]\n\n\nواعلم أنه ما من كلمة يتكلم بها العبد إلا ويخلق الله من تلك الكلمة ملكا فإن كانت خيرا كان ملك رحمة وإن كانت شرا كان ملك نقمة فإن تاب إلى الله وتلفظ بتوبته خلق الله من تلك اللفظة ملك رحمة وخلع من المعنى الذي دل عليه ذلك اللفظ بالتوبة الذي قام يقلب التائب على ذلك الملك الذي كان خلقه من كلمة الشر خلعة رحمة وواخى بينه وبين الملك الذي خلقه من كلمة التوبة وهو قوله تبت إلى الله فإن كانت التوبة عامة خلع على كل ملك نقمة كان مخلوقا لذلك العبد من كلمات شره خلع رحمة وجعل مصاحبا لملك المخلوق من لفظة توبته فإنه إذا قال العبد تبت إليك من كل شي‏ء لا يرضيك كان في هذا اللفظ من الخير جمعية كل شي‏ء من الشر فخلق من هذا اللفظ ملائكة كثيرة بعدد كلمات الشر التي كانت منه فإن الإنسان أعطى لفظا يدل على الإفراد وأعطى لفظا يدل على الاثنين وأعطى لفظا يدل على الكثرة فلفظة كل تدل على الكثرة فعلم إن قوله تبت إلى الله من كل شي‏ء إنه تبت إلى الله من كذا تبت إلى الله من كذا تبت إلى الله من كذا كما تقول زيدون تريد بذلك زيد وزيد وزيد هذا أقله إلى ما لا يتناهى كثرة وكذلك لفظة زيود في جمع التكسير فلهذا خلق الله من كلمة الجمع ملائكة بعدد ما تعمه تلك الكلمة وإنما قلنا بأن الملائكة المخلوقة من كلمة الشر يخلع عليها خلع الخير وترجع ملائكة رحمة في حق هذا التائب ويصاحب بينها وبين الملائكة\nالمخلوقة من لفظ التوبة عن ذلك الشر فإن الكشف أعطى ذلك وصدقه الوحي المنزل بقول الله تعالى في هذا الصنف يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ فجعل التبديل في عين السيئة وهو ما ذكرناه ولقد أخبرني عبد الكريم بن وحشي المصري وكان من الرجال بمكة رحمه الله سنة تسع وتسعين وخمسمائة قال لي ركبت البحر من جدة نطلب الديار المصرية فلما مخرنا جئنا ليلة ونحن نجري في وسط البحر وقد نام أهل المركب فإذا شخص من الجماعة قد قام يريد قضاء الحاجة فزلقت رجله ووقع في البحر وأخذته الأمواج فسكت الرائس وما تكلم وكانت الريح طيبة فما شعر رائس المركب إلا والرجل يجي‏ء على وجه الماء حتى دخل المركب وصحبته طائر كبير فلما وصل إلى المركب طار الطائر ونزل بجامور الصاري على رأس القرية ثم رآه قد مد منقاره إلى إذن ذلك الرجل كأنه يكلمه ثم طار فلم يقل له الرائس شيئا حتى إذا كان في وقت آخر من النهار أخذه الرائس وأكرمه وسأله الدعاء فقال له الرجل ما أنا من القوم الذين يسأل منهم الدعاء فقال له الربان رأيتك البارحة وما جرى منك فقال يا أخي ليس الأمر كما ظننت ولكني لما وقعت في البحر وأخذتني الأمواج تيقنت بالهلاك وعلمت إن الاستغاثة بكم لا تفيد فقلت ذلك تقدير العزيز العليم مستسلما لقضاء الله فما شعرت إلا وطائر قد قبض علي وأقامني من بين الأمواج وحملني على موج البحر إلى أن أدخلني المركب كما رأيت فتعجبت من صنع الله وبقيت أتطلع إلى الطائر وأقول يا ليت شعري من يكون هذا الطائر الذي جعله الله سبب نجاتي وحياتي فمد الطائر منقاره من أعلى الصاري إلى أذني وقال لي أنا كلمتك ذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ وبه سميت فكان اسم ذلك الطائر ذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ فهذا مما أشرنا إليه من خلق الله الملائكة من الكلمات وتلك الكلمات تكون أسماءهم وبها يتميزون وبها يدعون كانت ما كانت ويختص بهذا المنزل علوم كثيرة وتجليات يطول الكلام فيها ويكفي هذا القدر والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "**Chapter Two Hundred and Eighty-Seven: Concerning the Knowledge of the Station of the Self-Sufficient Theophany (التجلي الصمداني) and its Secrets from the Muhammadan Presence (الحضرة المحمدية)**\n\n> The person of Time has a soul that governs it, / Beautiful, fragrant maidens from the World of Command (عالم الأمر).\n> *Jīm*, *Ayn*, and *Fā'* are among its stations, / Its messengers brought it in the decisive Remembrance.\n> It has two prayers from the knowledge of the Unseen (علم الغيوب), / And the Noon, Afternoon, that glory, and the Dawn do not possess that.\n\nWhoever wishes to stand upon what this station contains regarding the Self-Sufficient Theophany (التجلي الصمداني), which is specific to it, concerning gnoses (المعارف), realities (الحقائق), luminous secrets (الأسرار الضيائية), and other matters, let him consult it in the chapter on the Heart (القلب) in our book *Mawāqi‘ al-Nujūm* (The Settings of the Stars) concerning the science of this Path. Therefore, we shall mention in this station only what is other than that, for fear of undue length.\n\n### [Indeed, the Turning (الإنابة) is from the Station of Theophany]\n\nKnow that this station possesses the Turning (الإنابة), and among those who realized it was Abū Yazīd al-Bisṭāmī. It is the Essential Synthesis (الجمعية الذاتية), and it does not occur for the Gnostic (العارف) from God except through a verified witnessing (شهود محقق) from behind a veil of human manifestation.\n\nKnow that the People (the Sufis) have agreed upon terms (ألفاظ) for meanings (معان) that they have established in their souls, by which they address one another, just as every group has done in the sciences they pursue, such as grammarians, mathematicians, engineers, physicians, theologians (المتكلمين), jurists (الفقهاء), and others. Among the terms this group has agreed upon are *al-Huwiyyah* (He-ness), *al-Inniyyah* (I-ness), and *al-Anāniyyah* (Egoity/I-am-ness), for purposes within their souls. This station is, therefore, the station of *al-Anānah* (the I-am-ness).\n\n*Al-Inniyyah* (I-ness) is an expression for the Reality (الحقيقة) from the perspective of Absolute Oneness (الأحدية). And *al-Anāniyyah* (Egoity) here is an expression for the Reality of Absolute Oneness (الحقيقة الأحدية) which is the very essence of Synthesis (الجمع).\n\nThis is a station among the stations of the Unseen (الغيوب); it has no manifestation (ظهور) in the Visible World (الشهادة). However, the stations in the Unseen are of two types: stations from which there are effects (آثار) in the Visible World, and these effects lead one to infer the stations, even though they are Unseen, whether or not the Divine Definition (التعريف الإلهي) concerning them has been revealed through discourse; and stations from which there is no effect in the Visible World, and thus they are known only through the path of Divine Definition, and we do not realize them with the same certainty as the stations of effects.\n\nThis *Anāniyyah* (Egoity) is among the stations that have effects in the World of Visibility (عالم الشهادة) and the World of Dominion (الملكوت). Its effects are varied, and it becomes restricted by the variation of its effects, even though in itself it is absolute (مطلقة). Sometimes it is restricted by a pronominal Name (اسم ضمير) that is similar to it in rank, thus requiring another restriction, such as His saying, the Exalted: <<إِنَّا أَوْحَيْنَا إِلَيْكَ>> (Indeed, We have revealed to you). The *Innā* (We) and the *Nūn* (We) of *awḥaynā* (We revealed) are on one rank in terms of the Oneness (أحدية) of the Reality of Synthesis (حقيقة الجمعية). The restriction for *Innā* is the revelation (الوحي), and the restriction for the *Nūn* of *awḥaynā* is what He mentions after it, whether it be Qur’an, Spirit (روح), or other things.\n\nAnd sometimes it is not restricted by a pronominal Name, such as their saying, \"We are the sons of so-and-so,\" and as was said:\n\n> We are the sons of Ḍabbah when fear intensified, / Death is sweeter to us than honey.\n\nI have not come across anything like this in the Qur’an that we could use as evidence. I only used this as evidence, even though it is not Qur’an, because it is from the speech of the Arabs in whose tongue the Qur’an was revealed.\n\nWhat I have restricted myself to in this station is the Divine Sending Down (*al-Inzāl*), not the Gradual Revelation (*al-Tanzīl*) upon His Gnostic servants, whether it be through what He has already established in His creation or what He is establishing in His creation. This Sending Down (*Inzāl*) is of two types: One type is the Sending Down for the purpose of defining the status of what He establishes or has established in His creation, and its rank. This descent occurs upon the heart of a servant, from the Unseen (الغيب) within the Unseen, from one essence (عين واحد) to one essence, accepting no detail. The second type is the descent upon the heart of the servant while he is occupied with the governance of his physical structure (هيكله) and nature (طبيعته), without distracting him from that. This Sending Down is from the essence of Synthesis (عين جمع) to the essence of Synthesis, so that he may detail for His creation what has descended upon him concerning what God has established or what he relates.\n\nA group related to us, among them Abū al-Badr, who related from our Shaykh, ‘Abd al-Qādir (may God have mercy on him), that he said: \"The year comes to me when it enters and informs me of what will be in it and what will occur.\" Likewise the month, the week, and the day. Similarly, Shaykh Abū Ya‘zā Abū al-Nūr in the lands of the Maghrib, when Ramadan entered, it would come to him and inform him of the deeds accepted therein, and who was accepted and who will be accepted. I restricted this here concerning our Shaykh Abū Ya‘zā to Ramadan because our companion Abū Zayd al-Raqrāqī al-Uṣūlī informed me of witnessing this during the month of Ramadan, as the informant was with him at that time, and he saw Ramadan come to him, informing him of what we mentioned.\n\nThus, the stations of the Existents (الأكوان) with God are not known through the path of Divine Definition (التعريف الإلهي) and the special care for this near servant (المقرب), except by God defining His servants in their secrets (أسرارهم) through what He casts into them, like the insufflation of a spirit into the heart (نفث روح في روع), similar to how the angels used to descend upon the Prophets (peace be upon them) with that.\n\n### [Indeed, the Levels of Creation (مراتب الخلق) are Graded]\n\nKnow that the levels (المراتب) upon which creation (الخلق) exists are graded in every genus. Thus, Messengers excel one another, Prophets excel one another, the Realized Ones (المحققون) excel one another, and the Gnostics (العارفون) excel one another, and so on, down to the practitioners of practical crafts.\n\nThis station excels others in the Divine Theophanies (التجليات الإلهية), the vision of which is likened to the vision of the moon and the sun, by two thousand theophanies and eight theophanies folded and included within the aforementioned two thousand. However, these eight have a specific quality that manifests in the Theophany of the Stations (تجلى المقامات), which consists of one hundred and sixty-six theophanies. At that point, the sovereignty of these eight theophanies appears, and they bestow gnoses (المعارف) as God wills.\n\nAs for the two thousand, they are fleeting theophanies (سريعة الزوال) whose duration is short and which do not grant general knowledge (علما عاما). As for the one hundred and sixty-six, they grant general, pure, abstract, and stable knowledge (علما عاما مجردا خالصا ثابتا) concerning the general sciences that permeate the existents (الموجودات), their subsistence, and what results from them and because of them—knowledge that neither wavers nor is confused, even though its ruling transfers from it and within it, and does not depart from it.\n\nOur companions differed as to whether there is a theophany among these theophanies that is characterized by deficiency (النقص) in terms of the form (الصورة) in which it manifests, if that form is natural, and the natures are fourfold. Thus, the deficient theophany in the natural form occurs at one time in the fiery element (العنصر الناري), being incomplete in itself, but granting according to what its element grants, without exceeding it. Then, if it occurs in another theophany, the second element is added to that form, until the elements are completed in four theophanies. The theophany then occurs in the fourth element with the completeness of the natural form, in a perfected image, thus joining its brethren among the theophanies.\n\nHowever, the matter is not so according to us, and it is not valid for a theophany to be deficient or excessive. Rather, the state of the person who holds this view appeared to him within the essence of the theophany, and he imagined that the deficiency was in the theophany, whereas the deficiency was in himself. Then it happened that when the second theophany manifested to him, he saw that the form he was upon in himself had increased in what was previously absent, and the deficiency and increase were in him, so he judged the theophany accordingly.\n\n### [That the Subjugated Luminous Spirits (الأرواح النورية المسخرة) Descend upon the Hearts of the Gnostics]\n\nKnow that the subjugated luminous spirits (الأرواح النورية المسخرة)—not the governing ones—descend upon the hearts of the Gnostics (العارفين), as we said, with Divine Commands (الأوامر), Affairs (الشئون الإلهية), and blessings, according to what the Real (الحق) desires for that servant. They elevate him by what they descend with, purifying and raising him toward the nearest veil among the distant veils, until God takes charge of him (يتولاه الله) through the removal of intermediaries (الوسائط).\n\nHowever, when this heart is left by the spiritual descents—in which the people of this Path and the wise ones (الحكماء) who work to purify souls and free them from the turbidity of nature (كدر الطبع) share—and before the Real takes charge of its affair through the removal of intermediaries, it remains stripped of both matters, like the pause between two stations (المقامين), or like the general sleep between sensation (الحس) and imagination (الخيال). This is the station of bewilderment (الحيرة) for this heart. For that which he used to find intimacy with and receive from has been lost, and that which is coming to him he has not yet seen, so he remains bewildered.\n\nMy companion Abū Isḥāq Ibrāhīm ibn Muḥammad al-Anṣārī al-Qurṭubī (may God grant him success) informed me concerning our Shaykh Abū Zakariyyā al-Ḥasanī in Bijayah. He said that more than one of his companions, and those who attended his death, informed him that the Shaykh came out to the people—he had been in retreat (*i‘tikāf*) in the Grand Mosque during Ramadan—and he had changed the clothes he was wearing, and a change was apparent in him. He said to them, \"Pray for me, for I have lost what was with me, and nothing of what is coming has yet reached me.\" He was bewildered in his affair, so he asked the people to pray for him. Since he was not among the People of Divine Tastes (أهل الأذواق الإلهية) due to the dominance of jurisprudence (الفقه) over him, the matter was not resolved for him. Then he returned to his seclusion, and his emergence was delayed. They entered upon him and found him laid out, having departed the world. His changing of his clothes indicated to them that what he used to wear had been stripped from him. His bewilderment and his need for the prayers of his brethren indicated that the Real had not yet taken charge of his affair, which we alluded to. I rejoiced for him because of that, hoping that God might have taken charge of him a moment before his death, and thus took him to Himself while he was with Him.\n\nThe state of the Gnostic (العارف) during this bewilderment and pause is supplication (التضرع) and humble entreaty (الابتهال) to God, utilizing poverty (الافتقار) and reverence (الخشوع), so that the ruling of God taking charge of him through the removal of intermediaries may manifest to him, specifically from the particular aspect (الوجه الخاص) that exists between every existent (موجود) and its Lord, which not every Gnostic knows.\n\nFrom this station, one knows what the Real sends down of gnoses (المعارف) upon the hearts of His servants by sending down the spirits (الأرواح) to them. The Exalted said: <<يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ أَنَّهُ لَا إِلَهَ إِلَّا أَنَا>> (He casts the Spirit by His command upon whomever He wills of His servants... that there is no god except I). He did not say *He* (هو). Thus, the Spirit (الروح) is the one cast from God to the hearts of His servants, and the Command of God (أمر الله) is what cast it, and that Spirit is the form of His saying: <<لَا إِلَهَ إِلَّا أَنَا فَاتَّقُونِ>> (There is no god except I, so fear Me).\n\nIntermediation (الوساطة) is thus removed in this station, since the very essence of the revealed inspiration (الوحي المنزل) is the very essence of the Spirit, and the Caster is God and none other. This Spirit is not the essence of the Angel (الملك); rather, it is the essence of the Possessor (المالكة)—so understand this. Such a Spirit is not known by the angels because it is not of their genus. It is an unborne spirit, not luminous, whereas the Angel is a spirit within light. This taste (الذوق) belongs to us and to the rest of the Prophets.\n\nAs for the angels, they may be among those specifically assigned to the Messengers, which is His saying, the Exalted: <<نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَى قَلْبِكَ>> (The Trustworthy Spirit [Rūḥ al-Amīn] has descended with it upon your heart). He is the Messenger of the Messenger.\n\nAs for the descent of the angelic spirits (الأرواح الملكية) upon the hearts of the servants, they only descend by the command of God, the Lord. This does not mean that God commands them to descend from the Presence of Discourse (حضرة الخطاب). Rather, He casts upon them what is inappropriate for their station, in the form of the one upon whom they are to descend with it. Thus, they know that God intends for them to perform the Sending Down and the Descent by what they find in their souls of inspiration (الوحي) that is not fitting for them, and that this inspiration is specific to human beings. They witness the image of the one upon whom the descent is made in the forms whose glorification (تسبيحها) they possess: \"O He who manifests the beautiful and conceals the ugly,\" due to the veils that are lowered and raised. From those forms, they recognize who their owner is on Earth, so they descend upon him and cast upon him what was cast upon them. That which is cast is then expressed as Law (الشرع) and Revelation (الوحي).\n\nIf it is attributed to God by virtue of the Attribute (الصفة), it is called Qur’an, Furqān, Torah, Zabūr, Injīl, and Scrolls. If it is attributed to God by virtue of the Act (الفعل) and not the Attribute, it is called Ḥadīth, Report, Opinion, and Sunnah.\n\nThey may also descend with the Divine Command from the Presence of Discourse (حضرة الخطاب). Both aspects of descent are contained in the saying of Gabriel to Muhammad (peace and blessings be upon him) when the Real commanded him to convey to His Prophet (peace and blessings be upon him) from his Lord. For this reason, He made it part of the Qur’an, and it is God’s narration about Gabriel. Gabriel is the one who descended with it, and his descent with it and the narration about him did not exclude it from being Qur’an. Thus, Gabriel was narrating from God the Exalted what God the Exalted narrated about Gabriel—that if he were to say that to Muhammad (peace and blessings be upon them), he would say it to him in this manner in the World of Visibility (عالم الشهادة). This is His saying: <<وَمَا نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ لَهُ مَا بَيْنَ أَيْدِينَا وَمَا خَلْفَنَا وَمَا بَيْنَ ذَلِكَ وَمَا كَانَ رَبُّكَ نَسِيًّا>> (We do not descend except by the command of your Lord. To Him belongs what is before us and what is behind us and what is between that, and your Lord is never forgetful), concerning what he witnessed of Gabriel’s speech to Muhammad (peace be upon them).\n\nThey are Fixed Entities (أعيان ثابتة) in their state of non-existence, and their discourses are Fixed Entities in their state of non-existence for Him. This is the allusion to His saying, *nasīyyan* (forgetful). Thus, the narration was a verified matter concerning a verified Existence (وجود) belonging to God, which is not characterized by origination (الحدوث). Then existence occurred for those Entities, and they informed of what was from them before their being, which the Real witnessed but they did not witness due to the absence of their existence in their essence.\n\nIt is related that al-Zuhrī narrated a Ḥadīth from a trustworthy person, or narrated about him, and the person narrated about said: \"I do not know this Ḥadīth, nor am I certain of it, but you are trustworthy to me.\" So he narrated it from him, from himself, saying, \"So-and-so narrated to me from myself,\" and he said, \"I told him, 'So-and-so narrated to me,'\" and the chain of transmission (الإسناد) was connected. Be aware of this issue in the method of narration.\n\nAmong what this station encompasses is the superiority of Concealed Knowledge (العلم المستور) over Manifest Knowledge (العلم المشهور). Concealed Knowledge is of two types: one type that was not included in the Visible World (الشهادة) as forms of words, and one type that was included as forms of words. An example of the knowledge included as forms of words, yet concealed from being definitively known by a Gnostic (معرفة عارف على القطع) except through Divine information, is the knowledge of the ambiguous parts of the Qur’an, <<لَا يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ>> (whose interpretation no one knows except Allah). This is among the Concealed Sciences, but it is not known from the forms of the words in what aspect it is concealed. The second Concealed Knowledge is that which had no form of words by which it could be veiled. The superiority and rank of such knowledge are unknown; only God knows them, and whomever God informs. A person may happen to act according to what that knowledge requires while not knowing it, until he transfers to the Hereafter, where he finds the fruit of his action linked to the rank of that Concealed Knowledge, and thus he knows it then.\n\nAmong what relates to this chapter is the descent of the He-ness (الهو) to the station of the Witnessed (الشاهد), while the He-ness remains transcendent (منزها) in its essence. The He-ness never descends except in forms perceptible by the senses, either in sensation (الحس) or in imagination (الخيال). It is called the He-ness (الهو) during the manifestation of the form, so that it may be known that the He-ness is the spirit of that form and its signified meaning. Thus, it is known that the meaning of that form is known only by God, as the Exalted said: <<وَعِنْدَهُ مَفَاتِحُ الْغَيْبِ لَا يَعْلَمُهَا إِلَّا هُوَ>> (And with Him are the keys of the Unseen; none knows them except He). And whoever is with the He-ness is in the state of the He-ness. The He-ness is Unseen (غيب), and that which is with Him is Unseen. If it is Unseen with the Unseen, the Visible World (الشهادة) does not know it; rather, the Unseen knows it. Thus, none knows what is in the Unseen except he who is Unseen.\n\nIn terms of forms, the Unseen is attributed to the circumstantial. If the forms are removed, the Unseen vanishes, because the veil has been lifted. Thus, it is not characterized by the Unseen (الغيب) nor by the Visible World (الشهادة), because the Visible World is inseparable from forms. When we say \"no form,\" we have said \"no Visible World.\" The form makes that matter Unseen, and when we speak of the removal of the form, we have lifted the ruling of the Unseen from that matter. Thus, there is neither Unseen nor Visible World.\n\nIn this station, there are wonders and secrets such that if we were to reveal them, the minds of most scholars of this sound Path would cease from accepting them.\n\nFrom this station, the Angel of Death (ملك الموت) receives the appointed terms (آجال) of people. The People of Unveiling (أهل الكشف) differed concerning the appointed terms of animals and the appointed terms of everything other than humans: whether this station is the station of their knowledge or not, and whether things other than animals have appointed terms or not.\n\n### [Indeed, God the Exalted has Appointed a Term for Every Form in the World]\n\nKnow that God the Exalted has appointed a term (*ajal*) for every form (صورة) in the world (العالم) to which it must end, both in this world and the Hereafter, except for the Entities (الأعيان) capable of receiving forms, for they have no term; rather, since God created them, they possess permanence and subsistence (الدوام والبقاء). The Exalted said: <<كُلٌّ يَجْرِي إِلَى أَجَلٍ مُسَمًّى>> (All runs to an appointed term), and He said: <<ثُمَّ قَضَى أَجَلًا وَأَجَلٌ مُسَمًّى عِنْدَهُ>> (Then He decreed a term, and there is an appointed term with Him). He used the word \"All\" (*kull*), which necessitates comprehensiveness and generality. We have stated that the Entities capable of receiving forms have no term. So, by what means are they excluded from the ruling of \"All\"? We say they are not excluded. Rather, the term that belongs to the Entity is only its connection to one of the forms it accepts. Its acceptance of that form ends at an appointed term, which is the expiration of the time of that form. When the term known to God concerning this connection is reached, the form ceases to exist, and the Entity accepts another form. Thus, the Entities have run to an appointed term in the acceptance of a specific form, just as the form has run to an appointed term in its establishment for that Entity which was the locus of its manifestation. Therefore, the appointed term encompasses all.\n\nGod has decreed a term for everything in a certain matter to which it ends, and then it transfers to another state in which it also runs to an appointed term. Indeed, God is the Creator continuously, with every breath.\n\nAmong things, there are those whose duration of subsistence is the time of their existence, and they end at their term in the second moment of their existence—this is the shortest duration in the world. God did this so that the dependence (الافتقار) of the Entities upon God the Exalted, with every breath, might be valid. If they were to subsist for two moments or more, they would be characterized by independence (الغنى) from God during that period.\n\nThis is an issue that no one affirms except the Realized People of Unveiling (أهل الكشف المحقق) among us, and the Ash‘arites among the theologians (المتكلمين). The point of consensus among all regarding this issue—which they cannot deny—is motion (الحركة), except for two groups: those who consider motion to be a relation (نسبة) that has no existence, such as al-Bāqillānī among the theologians; and the proponents of Latency and Manifestation (الكمون والظهور). Even if the proponents of Latency and Manifestation affirm this, they are encompassed by the ruling of \"All\" according to this doctrine, for the thing has run in its latency to an appointed term, which is the time of its manifestation, so the duration of its latency has expired. And it has run in its manifestation to an appointed term, which is the time of its latency, so the duration of its manifestation has expired.\n\nIt is not necessary that their running to the term implies their non-existence. Rather, it is possible that non-existence occurs for it, and it is possible that transition occurs while the Entity characterized by the running remains. And it is possible that some of it has a term that annihilates it, and some of it has a term that annihilates it through its transition. This is the view we adopt and affirm.\n\n### [Indeed, God has Spirits of Angels whose Measure is Unknown]\n\nKnow that in this station, God has spirits of angels (أرواحا من الملائكة) in whose hands are blessings and everlasting bliss (النعيم الدائم) whose measure none knows except God the Exalted. God has entrusted them with this and made them guardians over it and treasurers for their human companions, delivering that to them at the time the Real has decreed it for them and specified it for them, corresponding to the state to which that fortunate servant transitions. Likewise, He has angels who are treasurers of the opposite, prepared for another human being, delivering that to him at the time the Real has decreed it for them, corresponding to the state to which that wretched servant transitions. All of this is by the decree of the All-Mighty, the All-Knowing.\n\n### [The Creation of Angels from the Servant's Speech]\n\nKnow that there is no word spoken by the servant except that God creates an angel from that word. If it is good, it is an angel of mercy (ملك رحمة); if it is evil, it is an angel of retribution (ملك نقمة).\n\nIf he repents to God and utters his repentance, God creates an angel of mercy from that utterance. And from the meaning signified by that word of repentance, which arose in the heart of the penitent, He bestows a robe of mercy (خلعة رحمة) upon the angel that was created from the word of evil, and He establishes brotherhood between it and the angel created from the word of repentance, which is his saying, \"I repent to God.\"\n\nIf the repentance is general, He bestows a robe of mercy upon every angel of retribution that was created for that servant from his words of evil, and makes it a companion to the angel created from the utterance of his repentance. For when the servant says, \"I repent to You from everything that does not please You,\" this utterance contains the synthesis (جمعية) of all evil things in terms of goodness. Thus, many angels are created from this utterance, corresponding to the number of evil words that originated from him. For man has been given a word that indicates singularity, a word that indicates duality, and a word that indicates multiplicity. The word *kull* (all/every) indicates multiplicity. Thus, it is known that his saying, \"I repent to God from everything,\" means \"I repent to God from such-and-such, I repent to God from such-and-such, I repent to God from such-and-such,\" just as you say *Zaydūn* (plural of Zayd) intending Zayd, Zayd, and Zayd—this is the minimum, extending to infinite multiplicity. Likewise is the word *Zuyūd* in the broken plural.\n\nFor this reason, God creates angels from the word of synthesis (كلمة الجمع) corresponding to the number of things encompassed by that word. We only stated that the angels created from the word of evil are bestowed with robes of goodness and return as angels of mercy concerning this penitent, and brotherhood is established between them and the angels created from the utterance of repentance for that evil, because Unveiling (الكشف) granted this, and the revealed inspiration confirmed it with God’s saying concerning this category: <<يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ>> (Allah will change their evil deeds into good deeds). Thus, He made the change occur in the very essence of the evil deed, which is what we have mentioned.\n\n‘Abd al-Karīm ibn Waḥshī al-Miṣrī, who was one of the men in Mecca (may God have mercy on him) in the year 599 AH, informed me. He said to me: \"I boarded a ship from Jeddah heading for the lands of Egypt. As we sailed, one night we were running in the middle of the sea, and the people of the ship were asleep. Suddenly, one person from the group stood up, intending to relieve himself. His foot slipped, and he fell into the sea, and the waves took him. The captain remained silent and did not speak, and the wind was favorable. The captain did not notice anything until the man came back upon the surface of the water until he entered the ship, accompanied by a large bird. When he reached the ship, the bird flew and landed on the masthead at the top of the yardarm. Then he saw it extend its beak to the man’s ear, as if speaking to him, and then it flew away.\"\n\nThe captain did not say anything to him until later that day. The captain took him aside, honored him, and asked him for a prayer (du‘ā’). The man said to him, \"I am not one of the people from whom prayers are requested.\" The captain said to him, \"I saw you last night and what happened to you.\" The man replied, \"My brother, the matter is not as you supposed. But when I fell into the sea and the waves took me, I was certain of destruction and knew that seeking help from you would be useless. So I said, '<<ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ>> (That is the decree of the All-Mighty, the All-Knowing),' submitting to God’s decree. I did not perceive anything until a bird seized me, lifted me from the waves, and carried me upon the sea wave until it brought me into the ship, as you saw. I was astonished by God’s doing and kept looking at the bird, saying, 'Oh, I wish I knew who this bird is that God made the cause of my salvation and life!' The bird extended its beak from the top of the mast to my ear and said to me, 'I am your word: <<ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ>> (That is the decree of the All-Mighty, the All-Knowing), and by it I am named.'\"\n\nThis is an example of what we alluded to concerning God creating angels from words, and those words become their names, by which they are distinguished and by which they are called, whatever they may be. Many sciences and theophanies are specific to this station, and discussing them would be lengthy. This much suffices. And God <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو ستاسی (287): تجلی صمدانی (التجلي الصمداني) کے مقام کی معرفت اور اس کے اسرار، جو حضرت محمدیہ (الحضرة المحمدية) سے متعلق ہیں۔\n\nزمان کا شخص ایک نفس رکھتا ہے جو اس کی تدبیر کرتا ہے،\nیہ نفس عالمِ امر (عالم الأمر) سے معطر حسیناؤں کی مانند ہے۔\nجیم، عین اور فا (ج، ع، ف) اس کی منازل سے ہیں،\nاسے اس کے رسول محکم ذکر (قرآن) میں لائے ہیں۔\nاس کے لیے علم الغیوب (علم الغيوب) سے دو نمازیں ہیں،\nاور ظہر و عصر کے لیے وہ فخر اور فجر نہیں ہے۔\n\nجو شخص ان معارف، حقائق اور ضیائی اسرار وغیرہ پر واقف ہونا چاہتا ہے جو اس مقام (منزل) میں تجلی صمدانی (التجلي الصمداني) کے حوالے سے شامل ہیں اور جو اس کے لیے خاص ہیں، تو اسے چاہیے کہ وہ ہماری کتاب \"مواقع النجوم\" کے بابِ قلب میں اس طریق (طریق) کے علم کے تحت اس کا مطالعہ کرے۔ لہٰذا ہم اس مقام میں اس کے علاوہ دیگر چیزوں کا ذکر کریں گے، طوالت کے خوف سے۔\n\n### [بے شک انابت (رجوع الی اللہ) تجلی کے مقام سے ہے]\n\nجان لو کہ اس مقام کے لیے انابت (الإنابة) ہے، اور جن لوگوں نے اسے حاصل کیا ان میں ابو یزید بسطامی بھی شامل ہیں۔ یہ انابت جمعیۃ ذاتیہ (الجمعية الذاتية) ہے، اور عارف کو اللہ کی طرف سے یہ تب تک حاصل نہیں ہوتی جب تک کہ بشری مظہر کے پردے کے پیچھے سے محقق شہود (شهود) نہ ہو۔\n\nاور جان لو کہ اس جماعت (صوفیاء) نے کچھ معانی کے لیے الفاظ وضع کیے ہیں جنہیں انہوں نے اپنے نفوس میں مقرر کیا ہے اور جن کے ذریعے وہ ایک دوسرے سے مخاطب ہوتے ہیں، جیسا کہ ہر گروہ نے اپنے علوم میں کیا ہے، جیسے نحوی، ماہرینِ اعداد، انجینئر، طبیب، متکلمین اور فقہاء وغیرہ۔ اس جماعت نے جن اصطلاحات کو وضع کیا ہے ان میں ھویۃ (الهوية)، انیۃ (الإنية) اور انانیۃ (الأنانية) شامل ہیں، جو ان کے نفوس میں موجود اغراض کے لیے ہیں۔ پس یہ مقام (منزل) ان میں سے انانیت (الأنانة) کا مقام ہے۔\n\nپس انیۃ (الإنية) سے مراد حقیقت (الحقيقة) ہے، احدیت (الأحدية) کے اعتبار سے۔ اور یہاں جو انانیۃ (الأنانية) ہے، اس سے مراد وہ احدی حقیقت ہے جو عینِ جمع ہے۔ یہ غیوب (الغيوب) کے مقامات میں سے ایک مقام ہے جس کا عالمِ شہادت (الشهادة) میں کوئی ظہور نہیں۔ لیکن غیب میں موجود مقامات دو طرح کے ہوتے ہیں: ایک وہ مقامات جن کے آثار عالمِ شہادت میں ہوتے ہیں اور ان آثار کے ذریعے ان پر استدلال کیا جاتا ہے، اگرچہ وہ غیب ہی ہوں۔ خواہ اس بارے میں الٰہی تعریف (التعريف الإلهي) آئی ہو یا نہ آئی ہو، خطاب کے لحاظ سے۔ اور دوسرے وہ مقامات جن کا عالمِ شہادت میں کوئی اثر نہیں ہوتا، لہٰذا وہ صرف الٰہی تعریف کے ذریعے ہی پہچانے جاتے ہیں، اور ہم ان کا تحقق اس طرح نہیں کر سکتے جس طرح آثار والے مقامات کا کرتے ہیں۔\n\nاور یہ انانیۃ (الأنانية) ان مقامات میں سے ہے جن کے آثار عالمِ شہادت (عالم الشهادة) اور ملکوت (الملكوت) میں ہوتے ہیں۔ اس کے آثار مختلف ہوتے ہیں اور یہ اپنے آثار کے اختلاف کے ساتھ مقید ہوتی ہے، اگرچہ یہ بذاتِ خود مطلق ہے۔ کبھی یہ اپنے ہی مرتبے کے کسی ضمیر کے نام سے مقید ہوتی ہے، تو اسے ایک اور قید کی ضرورت ہوتی ہے، جیسا کہ اللہ تعالیٰ کا فرمان ہے: **إِنَّا أَوْحَيْنَا إِلَيْكَ** (بے شک ہم نے آپ کی طرف وحی بھیجی)۔ پس \"إِنَّا\" (ہم) اور \"أَوْحَيْنَا\" (ہم نے وحی بھیجی) میں موجود نون، حقیقتِ جمعیۃ (حقيقة الجمعية) کی احدیت کے لحاظ سے ایک ہی مرتبے پر ہیں۔ اور \"إِنَّا\" کے لیے قید وحی ہے، اور \"أَوْحَيْنَا\" میں موجود نون کے لیے قید وہ ہے جو اس کے بعد ذکر کیا گیا ہے، جیسے قرآن، روح یا کوئی اور چیز۔\n\nاور کبھی یہ کسی ضمیر کے نام سے مقید نہیں ہوتی، جیسا کہ ان کا قول ہے: \"ہم فلاں کے بیٹے ہیں\" اور جیسا کہ کہا گیا ہے:\n\n> ہم ضبہ کے بیٹے ہیں جب خوف شدید ہو جائے،\n> موت ہمارے نزدیک شہد سے زیادہ میٹھی ہے\n\nمیں نے قرآن میں اس کی مثال نہیں پائی، ورنہ ہم اس سے استدلال کرتے۔ میں نے اس شعر سے استدلال اس لیے کیا ہے، اگرچہ یہ قرآن نہیں ہے، کیونکہ یہ عربوں کا کلام ہے جس کی زبان میں قرآن نازل ہوا۔\n\nاور اس مقام میں جس چیز سے میں نے قید لگائی ہے وہ الٰہی انزال (الإنزال الإلهي) ہے، نہ کہ اپنے عارف بندوں پر تنزیل (التنزيل)، خواہ وہ اس کے ذریعے ہو جو اس نے اپنی مخلوق میں جاری کیا یا جو وہ اپنی مخلوق میں جاری کرے گا۔ اور اس کا انزال دو قسموں پر ہے: ایک قسم وہ ہے جس میں انزال اس چیز کے مقام کی تعریف کے لیے ہوتا ہے جو وہ اپنی مخلوق میں جاری کرتا ہے یا جو اس نے جاری کیا، اور اس کے مرتبے کی تعریف کے لیے ہوتا ہے۔ پس اس کا نزول بندے کے قلب پر غیب سے غیب میں، ایک عین سے ایک عین کی طرف ہوتا ہے جو تفصیل کو قبول نہیں کرتا۔ دوسری قسم وہ ہے جس میں اس کا نزول بندے کے قلب پر ہوتا جبکہ وہ اپنے جسم (ہیکل) اور طبیعت کی تدبیر میں مشغول ہوتا ہے، اور یہ نزول اسے اس تدبیر سے نہیں ہٹاتا۔ اور یہ انزال عینِ جمع سے عینِ جمع کی طرف ہوتا ہے تاکہ وہ اپنی مخلوق کے لیے اس چیز کی تفصیل بیان کرے جو اس پر نازل ہوئی ہے، اس چیز میں سے جو اللہ کے لیے جاری کیا گیا ہے یا وہ اس کی حکایت کرے۔\n\nہمیں ایک جماعت نے حکایت بیان کی، ان میں سے ابو البدر نے ہمارے شیخ عبدالقادر (رحمہ اللہ) سے روایت کی کہ انہوں نے فرمایا: \"جب سال داخل ہوتا ہے تو وہ میرے پاس آتا ہے اور مجھے بتاتا ہے کہ اس میں کیا ہو گا اور کیا واقعات پیش آئیں گے۔ اسی طرح مہینہ، جمعہ اور دن بھی آتے ہیں۔\" اسی طرح شیخ ابو یعزیٰ ابو النور مغرب (شمالی افریقہ) کے علاقوں میں تھے، جب رمضان داخل ہوتا تو وہ ان کے پاس آتا اور انہیں بتاتا کہ اس میں کون سا عمل قبول ہوا، اور کون قبول ہوا اور کون قبول ہو گا۔ میں نے یہاں اپنے شیخ ابو یعزیٰ کے حق میں اسے رمضان کے ساتھ اس لیے مقید کیا ہے کہ ہمارے ساتھی ابو زید الرقراقی الاصولی نے مجھے رمضان کے مہینے میں اس شہود (شہود) کی خبر دی تھی، کیونکہ یہ خبر دینے والا اس وقت ان کے پاس موجود تھا، اور اس نے دیکھا کہ رمضان ان کے پاس آ کر مذکورہ بالا باتوں کی خبر دے رہا ہے۔\n\nپس اکوان (الأكوان) کے مقامات اللہ کے نزدیک الٰہی تعریف (التعريف الإلهي) اور اس مقرب کی عنایت کے ذریعے نہیں پہچانے جاتے، مگر اس طرح کہ اللہ اپنے بندوں کو ان کے اسرار میں اس چیز کے ذریعے تعریف کرائے جو وہ ان میں روح کے نفث کے طور پر القاء کرتا ہے، جیسا کہ فرشتے انبیاء علیہم السلام پر نازل ہوتے تھے۔\n\n### [بے شک مخلوق کے مراتب میں فضیلت ہے]\n\nاور جان لو کہ مخلوق کے مراتب ہر جنس میں ایک دوسرے سے افضل ہوتے ہیں۔ پس رسول ایک دوسرے سے افضل ہیں، انبیاء ایک دوسرے سے افضل ہیں، محققین ایک دوسرے سے افضل ہیں، اور عارفین (العارفون) ایک دوسرے سے افضل ہیں، اور اسی طرح عملی صنعتوں کے ماہرین تک۔\n\nیہ مقام (منزل) الٰہی تجلیات (التجليات الإلهية) میں دوسروں سے افضل ہے، جن کا دیکھنا چاند اور سورج کے دیکھنے سے مشابہ ہے، دو ہزار تجلیوں اور آٹھ تجلیوں کے ساتھ جو مذکورہ دو ہزار میں شامل ہیں۔ البتہ ان آٹھ تجلیوں کی ایک خاص صفت ہے جو مقامات کی تجلی میں ظاہر ہوتی ہے، جو ایک سو چھیاسٹھ (166) تجلیات ہیں۔ اس وقت ان آٹھ تجلیات کا غلبہ (سلطان) ظاہر ہوتا ہے اور وہ وہ معارف عطا کرتی ہیں جو اللہ چاہتا ہے۔ جہاں تک دو ہزار تجلیوں کا تعلق ہے، وہ تیزی سے زائل ہونے والی تجلیات ہیں، ان کا قیام کم ہوتا ہے اور وہ کوئی عام علم عطا نہیں کرتیں۔ اور جہاں تک ایک سو چھیاسٹھ (166) تجلیوں کا تعلق ہے، وہ موجودات میں جاری رہنے والے اور ان کے بقا سے متعلق عام علوم عطا کرتی ہیں، اور جو کچھ ان سے اور ان کے سبب سے ہوتا ہے، وہ ایک عام، مجرد، خالص اور ثابت علم ہوتا ہے جو متزلزل نہیں ہوتا اور نہ ہی مشتبہ ہوتا ہے، اگرچہ اس کا حکم اس سے اور اس میں منتقل ہوتا رہتا ہے اور اس سے باہر نہیں نکلتا۔\n\nہمارے ساتھیوں میں اختلاف ہے کہ کیا ان تجلیات میں کوئی ایسی تجلی ہے جو اس صورت کے لحاظ سے نقص سے متصف ہو جس میں وہ تجلی کرتی ہے، اگر وہ صورت طبعی ہو؟ اور طبائع چونکہ چار ہیں، تو ناقص تجلی طبعی صورت میں ایک وقت میں ناری عنصر (العنصر الناري) میں ہو گی، تو وہ بذاتِ خود کامل نہیں ہو گی، لیکن وہ اتنا ہی عطا کرے گی جتنا اس کا عنصر عطا کرتا ہے، اس سے زیادہ نہیں۔ پھر جب وہ کسی دوسری تجلی میں ہو گی تو اس صورت میں دوسرا عنصر شامل ہو جائے گا، یہاں تک کہ چار تجلیوں میں عناصر مکمل ہو جائیں گے، تو چوتھے عنصر میں تجلی طبعی صورت کی کاملیت کے ساتھ ایک مکمل صورت پر واقع ہو گی، اور وہ اپنی دیگر تجلیات کے ساتھ مل جائے گی۔\n\nہمارے نزدیک معاملہ ایسا نہیں ہے، اور یہ درست نہیں کہ کوئی تجلی ناقص ہو یا زیادہ ہو۔ بلکہ یہ بات کہنے والے شخص کی حالت عینِ تجلی (عين التجلي) میں ظاہر ہوئی، تو اس نے یہ گمان کیا کہ نقص تجلی میں ہے، حالانانکہ نقص اس شخص میں تھا۔ پھر ایسا ہوا کہ جب اس کے لیے دوسری تجلی ہوئی تو اس نے دیکھا کہ وہ صورت جس پر وہ خود تھا، اس میں وہ چیز بڑھ گئی جو پہلے نہیں تھی، اور نقص اور زیادتی اسی شخص میں تھی، تو اس نے اس کا حکم تجلی پر لگا دیا۔\n\n### [بے شک مسخر نورانی ارواح عارفین کے قلوب پر نازل ہوتی ہیں]\n\nاور جان لو کہ مسخر نورانی ارواح (الأرواح النورية المسخرة)، نہ کہ مدبر ارواح، عارفین (العارفون) کے قلوب پر نازل ہوتی ہیں، جیسا کہ ہم نے کہا، الٰہی اوامر، شؤون اور خیرات کے ساتھ، اس بندے کے لیے حق (الحق) جو چاہتا ہے۔ پس وہ اسے اس چیز کے ذریعے ترقی دیتی ہیں جس کے ساتھ وہ نازل ہوئی ہیں، ترقی دیتے ہوئے اور اسے دور کے حجابات سے قریب ترین حجاب تک خالص کرتے ہوئے، یہاں تک کہ اللہ واسطوں کے اٹھ جانے کے ساتھ اس کا متولی ہو جاتا ہے۔\n\nلیکن جب یہ قلب ان روحانی تنزلات سے جدا ہو جاتا ہے جن میں اس طریق (طریقہ) کے لوگ اور نفوس کو طبع کی کدورت سے پاک کرنے والے حکماء شریک ہوتے ہیں، اور اس سے پہلے کہ حق واسطوں کے اٹھ جانے کے ساتھ اس کا متولی ہو، تو یہ قلب دونوں چیزوں سے خالی رہتا ہے، جیسے دو مقامات کے درمیان ٹھہر جانا، اور جیسے حس اور خیال کے درمیان عمومی نیند۔ اور یہ اس قلب کے لیے مقامِ حیرت (مقام الحيرة) ہے۔ کیونکہ جس سے وہ انس رکھتا تھا اور جس سے علم لیتا تھا، اسے کھو چکا ہے، اور جو اس کے پاس آنے والا ہے، اسے ابھی تک دیکھا نہیں، لہٰذا وہ حیران رہتا ہے۔\n\nاور میرے ساتھی ابو اسحاق ابراہیم بن محمد الانصاری القرطبی (اللہ انہیں توفیق دے) نے ہمیں ہمارے شیخ ابو زکریا الحسنیٰ کے بارے میں بجایہ سے خبر دی، انہوں نے کہا: مجھے ان کے کئی ساتھیوں نے اور ان لوگوں نے بھی خبر دی جو ان کی وفات کے وقت موجود تھے کہ شیخ لوگوں کے پاس آئے، اور وہ رمضان کے مہینے میں جامع مسجد میں اعتکاف میں تھے، اور انہوں نے اپنا لباس بدل لیا تھا جو وہ پہنے ہوئے تھے، اور ان میں تبدیلی ظاہر ہو رہی تھی۔ انہوں نے لوگوں سے کہا: \"میرے لیے دعا کرو، کیونکہ میں نے وہ چیز کھو دی ہے جو میرے پاس تھی، اور جو آنے والی ہے وہ ابھی تک مجھے حاصل نہیں ہوئی ہے۔\" اور وہ اپنے معاملے میں حیران تھے، تو انہوں نے لوگوں سے اپنے لیے دعا کی درخواست کی۔ چونکہ ان پر فقہ کا غلبہ تھا، اس لیے وہ اہل اذواقِ الٰہیہ (الأذواق الإلهية) میں سے نہیں تھے، لہٰذا ان کا معاملہ خالص نہ ہو سکا۔ پھر وہ اپنی خلوت میں واپس چلے گئے، اور ان کا باہر آنا دیر سے ہوا، تو لوگ ان کے پاس داخل ہوئے، تو دیکھا کہ وہ کفن میں لپٹے ہوئے ہیں اور دنیا سے رخصت ہو چکے ہیں۔ ان کے لباس کی تبدیلی سے یہ اشارہ ملتا ہے کہ جو کچھ وہ پہنتے تھے وہ ان سے چھین لیا گیا تھا، اور حیرت اور بھائیوں کی دعا کی محتاجی اس بات کی دلیل تھی کہ حق (الحق) نے ان کے معاملے کی تولیت نہیں لی تھی جس کی طرف ہم نے اشارہ کیا تھا۔ میں نے ان کے لیے اس پر خوشی محسوس کی، شاید اللہ نے ان کی موت سے ایک لمحہ پہلے ہی ان کی تولیت لے لی ہو اور انہیں اپنے پاس قبض کر لیا ہو، جبکہ وہ اس کے پاس ہوں۔\n\nاور اس حیرت اور توقف میں عارف کی حالت یہ ہوتی ہے کہ وہ عاجزی اور گڑگڑاہٹ کے ساتھ اللہ کی طرف رجوع کرتا ہے، محتاجی اور خشوع کے ساتھ، تاکہ اس پر واسطوں کے اٹھ جانے کے ساتھ اس کی تولیت کا حکم ظاہر ہو جائے، اس خاص پہلو سے جو ہر موجود اور اس کے رب کے درمیان ہے، جسے ہر عارف نہیں جانتا۔\n\nاور اسی مقام سے یہ معلوم ہوتا ہے کہ حق (الحق) اپنے بندوں کے قلوب پر ارواح کے انزال کے ذریعے جو معارف نازل کرتا ہے۔ اللہ تعالیٰ فرماتا ہے: **يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَى مَن يَشَاءُ مِنْ عِبَادِهِ أَنْ أَنَّهُ لَا إِلَهَ إِلَّا أَنَا فَاتَّقُونِ** (وہ اپنے حکم سے روح کو اپنے بندوں میں سے جس پر چاہتا ہے نازل کرتا ہے کہ میرے سوا کوئی معبود نہیں، پس مجھ سے ڈرو)۔ اور اللہ نے \"هُوَ\" (وہ) نہیں کہا۔ پس روح ہی اللہ کی طرف سے اس کے بندوں کے قلوب پر القاء کی جانے والی چیز تھی، اور اللہ کا امر ہی وہ تھا جس نے اسے القاء کیا۔ اور وہ روح اس کے قول **لَا إِلَهَ إِلَّا أَنَا فَاتَّقُونِ** (میرے سوا کوئی معبود نہیں، پس مجھ سے ڈرو) کی صورت ہوتی ہے۔\n\nپس اس مقام میں وساطت (الوساطة) ختم ہو گئی، کیونکہ نازل ہونے والی وحی (الوحي المنزل) عینِ روح تھی، اور القاء کرنے والا صرف اللہ تھا، کوئی اور نہیں۔ پس یہ روح عینِ ملک (فرشتہ) نہیں ہے، بلکہ یہ عینِ مالکہ (مالکیت) ہے، پس سمجھو۔ ایسی روح کو فرشتے نہیں پہچانتے کیونکہ یہ ان کی جنس سے نہیں ہے۔ یہ ایک غیر محمول روح ہے، نورانی نہیں ہے، جبکہ ملک (فرشتہ) نور میں روح ہے۔ یہ ذوق (الذوق) ہمارے لیے اور دیگر انبیاء کے لیے ہے۔ جہاں تک فرشتوں کا تعلق ہے، وہ ان میں سے ہو سکتے ہیں جنہیں رسولوں کے لیے خاص کیا گیا ہے، اور یہ اللہ تعالیٰ کا فرمان ہے: **نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَى قَلْبِكَ** (اسے روح الامین نے آپ کے قلب پر نازل کیا)۔ پس وہ رسول کا رسول ہے۔\n\nاور جہاں تک بندوں کے قلوب پر ملکی ارواح (الأرواح الملكية) کے نزول کا تعلق ہے، تو وہ صرف اللہ رب کے حکم سے نازل ہوتے ہیں۔ اور اس کا مطلب یہ نہیں کہ اللہ انہیں حضرۃ الخطاب (حضرة الخطاب) سے انزال کا حکم دیتا ہے، بلکہ وہ ان پر وہ چیز القاء کرتا ہے جو ان کے مقام کے لائق نہیں ہوتی، اس شخص کی صورت میں جس پر وہ نازل ہوتے ہیں، تو وہ جان لیتے ہیں کہ اللہ نے ان سے انزال کا ارادہ کیا ہے اور نزول کا بھی، اس وحی کی وجہ سے جو انہوں نے اپنے نفوس میں پائی جو ان کے لائق نہیں تھی، اور یہ وحی بشری خصائص میں سے ہے۔ اور وہ اس شخص کی صورت کو دیکھتے ہیں جس پر نزول ہونا ہے، ان صورتوں میں جن کی تسبیح ان کے پاس ہے: \"اے وہ ذات جس نے خوبصورتی کو ظاہر کیا اور پردوں کے ذریعے برائی کو چھپایا جو لٹکائے جاتے ہیں اور اٹھائے جاتے ہیں\"۔ پس وہ ان صورتوں سے پہچان لیتے ہیں کہ زمین پر اس کا صاحب کون ہے، تو وہ اس پر نازل ہوتے ہیں اور اس پر وہ چیز القاء کرتے ہیں جو ان پر القاء کی گئی تھی۔\n\nپس اس القاء کی تعبیر شریعت اور وحی سے کی جاتی ہے۔ اگر اس کی نسبت اللہ کی طرف صفت کے حکم سے ہو تو اسے قرآن، فرقان، تورات، زبور، انجیل اور صحیفے کہا جاتا ہے۔ اور اگر اس کی نسبت اللہ کی طرف فعل کے حکم سے ہو، نہ کہ صفت کے حکم سے، تو اسے حدیث، خبر، رائے اور سنت کہا جاتا ہے۔ اور وہ حضرۃ الخطاب (حضرة الخطاب) سے الٰہی حکم کے ذریعے بھی نازل ہو سکتے ہیں۔ اور نزول کے یہ دونوں پہلو حضرت جبرائیل علیہ السلام کے نبی اکرم صلی اللہ علیہ وسلم سے اس قول میں شامل ہیں، جب حق نے ان سے کہا کہ وہ اپنے نبی صلی اللہ علیہ وسلم کے لیے اپنے رب کی طرف سے فرار اختیار کریں۔ اور اسی لیے اللہ نے اسے قرآن کا حصہ بنایا، اور یہ اللہ کی جبرائیل کے بارے میں حکایت ہے، اور جبرائیل ہی اسے لے کر نازل ہوئے، اور ان کا نزول اور ان کی حکایت اسے قرآن ہونے سے خارج نہیں کرتی۔\n\nپس جبرائیل اللہ تعالیٰ کی طرف سے وہی حکایت کر رہے تھے جو اللہ تعالیٰ نے جبرائیل کے بارے میں حکایت کی کہ اگر وہ محمد صلی اللہ علیہ وسلم سے یہ بات کہتے تو وہ عالمِ شہادت (عالم الشهادة) میں اسی حد پر کہتے، اور وہ یہ فرمان ہے: **وَمَا نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ لَهُ مَا بَيْنَ أَيْدِينَا وَمَا خَلْفَنَا وَمَا بَيْنَ ذَلِكَ وَمَا كَانَ رَبُّكَ نَسِيًّا** (اور ہم نہیں اترتے مگر آپ کے رب کے حکم سے، اسی کا ہے جو ہمارے آگے ہے اور جو ہمارے پیچھے ہے اور جو اس کے درمیان ہے، اور آپ کا رب بھولنے والا نہیں ہے)۔ یہ اس چیز میں ہے جو انہوں نے محمد علیہما السلام سے جبرائیل کے قول کا مشاہدہ کیا۔ اور وہ (ملائکہ) عدم کی حالت میں ثابت اعیان (أعيان ثابتة) ہیں، اور ان کے خطابات عدم کی حالت میں اس کے لیے ثابت اعیان ہیں۔ پس یہ اس کے قول **نَسِيًّا** (بھولنے والا) کی طرف اشارہ ہے۔ پس یہ حکایت ایک محقق وجود کے بارے میں ایک محقق امر تھی جو حدوث (حادث ہونا) سے متصف نہیں ہوتا۔ پھر ان اعیان کا وجود حادث ہوا، تو انہوں نے اس چیز کی خبر دی جو ان کے وجود سے پہلے ان کی طرف سے تھی، جس کا حق نے مشاہدہ کیا تھا لیکن انہوں نے اپنی عین میں موجود نہ ہونے کی وجہ سے مشاہدہ نہیں کیا تھا۔\n\nزہری سے روایت ہے کہ انہوں نے ایک ثقہ شخص سے ایک حدیث بیان کی یا اس شخص نے ان سے بیان کی، تو جس سے حدیث بیان کی گئی تھی اس نے کہا: \"میں اس حدیث کو نہیں جانتا اور نہ ہی مجھے اس پر یقین ہے، لیکن آپ میرے نزدیک ثقہ ہیں،\" تو انہوں نے اس شخص سے اپنی طرف سے روایت کی اور کہا: \"مجھے فلاں نے مجھ سے بیان کیا،\" اور کہا: \"میں نے اسے کہا تھا کہ مجھے فلاں نے بیان کیا،\" اور اس طرح سند متصل ہو گئی۔ پس روایت کے اس طریقے میں اس مسئلے پر غور کرو۔\n\nاور جو چیزیں اس مقام میں شامل ہیں ان میں علمِ مستور (پوشیدہ علم) کی فضیلت علمِ مشہور پر ہے۔ اور علمِ مستور دو طرح کا ہوتا ہے: ایک وہ جس میں عالمِ شہادت (الشهادة) میں کلمات کی صورتیں شامل نہیں ہوتیں، اور دوسرا وہ جس میں کلمات کی صورتیں شامل ہوتی ہیں۔ پس وہ علم جس میں کلمات کی صورتیں شامل ہیں، اور وہ اس سے پوشیدہ ہے کہ کوئی عارف قطعی طور پر اس کی معرفت حاصل کر سکے، مگر الٰہی خبر کے ذریعے۔ یہ قرآن کے متشابہات کا علم ہے جس کی **تَأْوِيلَهُ إِلَّا اللَّهُ** (تاویل اللہ کے سوا کوئی نہیں جانتا)۔ پس یہ مستور علوم میں سے ہے، لیکن کلمات کی صورتوں سے یہ معلوم نہیں ہوتا کہ وہ کس پہلو سے پوشیدہ ہے۔ اور دوسرا مستور علم وہ ہے جس کی کوئی صورت نہیں ہوتی جس کے ذریعے وہ کلمات کی صورتوں سے پردہ کرے۔ اور ایسے علم کی فضیلت اور اس کا مقام نامعلوم ہے، جسے اللہ جانتا ہے اور جسے اللہ نے بتا دیا۔ اور کبھی انسان اس علم کے تقاضے کے مطابق عمل کر لیتا ہے اور وہ اسے نہیں جانتا، یہاں تک کہ وہ دارِ آخرت میں منتقل ہو جاتا ہے، تو وہ اپنے عمل کا ثمرہ اس مستور علم کے مقام سے جڑا ہوا پاتا ہے، تو اس وقت اسے معلوم ہو جاتا ہے۔\n\nاور اس باب سے متعلق چیزوں میں سے \"ھو\" (الهو) کو شاہد (الشاهد) کے مقام پر نازل کرنا ہے، جبکہ \"ھو\" اپنی عین میں منزہ باقی رہتا ہے۔ اور \"ھو\" کبھی بھی نازل نہیں ہوتا مگر حسی طور پر ادراک کی جانے والی صورتوں میں، خواہ حس میں ہو یا خیال میں۔ اور صورت کے ظاہر ہونے کی حالت میں اسے \"ھو\" کہا جاتا ہے تاکہ یہ معلوم ہو جائے کہ \"ھو\" اس صورت کی روح اور اس کا مدلول ہے۔ پس یہ معلوم ہوتا ہے کہ اس صورت کا معنی اللہ کے سوا کوئی نہیں جانتا، جیسا کہ اللہ تعالیٰ نے فرمایا: **وَعِندَهُ مَفَاتِحُ الْغَيْبِ لَا يَعْلَمُهَا إِلَّا هُوَ** (اور غیب کی کنجیاں اسی کے پاس ہیں، انہیں اس کے سوا کوئی نہیں جانتا)۔ اور جو \"ھو\" کے پاس ہوتا ہے وہ \"ھو\" کی جگہ پر ہوتا ہے، اور \"ھو\" غیب ہے، اور جو اس کے پاس ہوتا ہے وہ بھی غیب ہے۔ اور جب غیب، غیب کے پاس ہو، تو اسے عالمِ شہادت (الشهادة) نہیں جانتا، بلکہ اسے غیب ہی جانتا ہے۔ پس غیب میں جو کچھ ہے اسے وہی جانتا ہے جو خود غیب ہے۔\n\nپس صورتوں کے لحاظ سے غیب کی طرف ظرفیت کی نسبت کی جاتی ہے۔ جب صورتیں اٹھ جاتی ہیں تو غیب زائل ہو جاتا ہے، کیونکہ حجاب اٹھ چکا ہوتا ہے، تو وہ نہ غیب سے متصف ہوتا ہے اور نہ شہادت سے، کیونکہ شہادت صورتوں سے جدا نہیں ہوتی۔ اور جب ہم نے کہا کہ کوئی صورت نہیں، تو ہم نے کہا کہ کوئی شہادت نہیں۔ اور صورت اس امر کو غیب بنا دیتی ہے۔ اور جب ہم نے صورت کے زوال کا کہا، تو ہم نے اس امر سے غیب کا حکم اٹھا لیا۔ پس نہ غیب ہے اور نہ شہادت۔\n\nاور اس مقام میں ایسی عجائبات اور اسرار ہیں کہ اگر ہم انہیں ظاہر کر دیں تو اس سلیم طریق (طریقہ) کے اکثر علماء کی عقلیں انہیں قبول کرنے سے رک جائیں گی۔ اور اسی مقام سے ملک الموت (فرشتہ موت) لوگوں کی اجلیں (آجال) وصول کرتا ہے۔ اور اہل کشف (أهل الكشف) میں حیوانات کی اجلوں اور انسان کے علاوہ ہر چیز کی اجلوں کے بارے میں اختلاف ہے کہ کیا یہ مقام ان کے علم کا مقام ہے یا نہیں، اور کیا حیوان کے علاوہ کسی چیز کی اجلیں ہیں یا نہیں؟\n\n### [بے شک اللہ تعالیٰ نے عالم میں ہر صورت کے لیے ایک مدت مقرر کی ہے]\n\nپس جان لو کہ اللہ تعالیٰ نے عالم میں ہر صورت کے لیے ایک مدت (اجل) مقرر کی ہے جس پر وہ دنیا اور آخرت میں ختم ہوتی ہے، سوائے صور کو قبول کرنے والی اعیان (الأعيان القابلة للصور) کے، کیونکہ ان کے لیے کوئی مدت نہیں، بلکہ جب سے اللہ نے انہیں پیدا کیا ہے ان کے لیے دوام اور بقا ہے۔ اللہ تعالیٰ فرماتا ہے: **كُلٌّ يَجْرِي إِلَى أَجَلٍ مُّسَمًّى** (ہر ایک ایک مقررہ مدت تک چل رہا ہے)۔ اور فرمایا: **ثُمَّ قَضَى أَجَلًا وَأَجَلٌ مُّسَمًّى عِندَهُ** (پھر اس نے ایک مدت مقرر کی اور ایک مقررہ مدت اس کے پاس ہے)۔ پس اللہ نے \"کُلٌّ\" (ہر ایک) کا ذکر کیا، اور یہ احاطہ اور عموم کا تقاضا کرتا ہے۔ اور ہم نے کہا کہ صور کو قبول کرنے والی اعیان کے لیے کوئی مدت نہیں، تو وہ \"کُلٌّ\" کے حکم سے کیسے خارج ہو گئیں؟\n\nہم کہتے ہیں: وہ خارج نہیں ہوئیں۔ بلکہ عین (العين) کے لیے جو مدت ہے، وہ صرف ان صور میں سے کسی صورت کے ساتھ اس کا تعلق ہے جسے وہ قبول کرتی ہے۔ پس وہ اس کے قبول کرنے میں ایک مقررہ مدت تک ختم ہوتی ہے، اور وہ اس صورت کے زمانے کا ختم ہو جانا ہے۔ پس جب اللہ کے نزدیک معلوم مدت اس تعلق میں پہنچ جاتی ہے، تو صورت معدوم ہو جاتی ہے اور عین دوسری صورت کو قبول کر لیتی ہے۔ پس اعیان کسی صورت کے قبول کرنے میں ایک مقررہ مدت تک چلتی ہیں، جیسا کہ صورت اس عین کے لیے اپنے ثبوت میں ایک مقررہ مدت تک چلی جو اس کے ظہور کا محل تھی۔ پس مقررہ مدت نے سب کو شامل کر لیا۔ اللہ نے ہر چیز کے لیے کسی نہ کسی معاملے میں ایک مدت مقرر کی ہے جس پر وہ ختم ہوتی ہے، پھر وہ دوسری حالت کی طرف منتقل ہو جاتی ہے جس میں وہ بھی ایک مقررہ مدت تک چلتی ہے۔ کیونکہ اللہ سانسوں کے ساتھ ہمیشہ خالق (خلاق) ہے۔\n\nپس بعض چیزیں ایسی ہیں جن کے بقا کی مدت ان کے وجود کا زمانہ ہوتی ہے، اور وہ اپنے وجود کے دوسرے زمانے میں اپنی مدت کو ختم کر دیتی ہیں، اور یہ عالم میں سب سے مختصر مدت ہے۔ اور اللہ نے ایسا اس لیے کیا تاکہ اعیان کی طرف سے اللہ تعالیٰ کے لیے سانسوں کے ساتھ محتاجی (الافتقار) درست ہو جائے۔ اگر وہ دو یا اس سے زیادہ زمانوں تک باقی رہتیں تو وہ اس مدت میں اللہ سے بے نیازی (الغنى) سے متصف ہو جاتیں۔ اور یہ ایک ایسا مسئلہ ہے جسے ہمارے محقق اہل کشف (أهل الكشف المحقق) اور متکلمین میں سے اشاعرہ کے علاوہ کوئی نہیں کہتا۔ اور اس مسئلے میں سب کا اجماع حرکت پر ہے، جس کا انکار وہ نہیں کر سکتے، سوائے دو گروہوں کے: ایک وہ جو حرکت کو نسبت قرار دیتا ہے جس کا کوئی وجود نہیں، اور وہ متکلمین میں سے باقلانی ہے، اور دوسرے کمون (پوشیدگی) اور ظہور کے قائلین۔ اور اگر کمون اور ظہور کے قائلین یہ بات کہتے ہیں، تو وہ اس مذہب کے ساتھ \"کُلٌّ\" کے احاطے میں ہیں۔ کیونکہ وہ اپنے کمون میں ایک مقررہ مدت تک چلا، اور وہ اس کے ظہور کا زمانہ ہے، تو اس کے کمون کی مدت ختم ہو گئی۔ اور وہ اپنے ظہور میں ایک مقررہ مدت تک چلا، اور وہ اس کے کمون کا زمانہ ہے، تو اس کے ظہور کی مدت ختم ہو گئی۔ اور ان کے مدت تک چلنے سے یہ لازم نہیں آتا کہ ان کی مراد ان کا عدم (فنا) ہو، بلکہ جائز ہے کہ اس کے لیے عدم ہو، اور جائز ہے کہ چلنے سے موصوف عین کے باقی رہنے کے ساتھ انتقال ہو، اور جائز ہے کہ ان میں سے کچھ کی مدت ایسی ہو جو اسے معدوم کر دے، اور کچھ کی مدت ایسی ہو جو اس کے انتقال سے اسے معدوم کر دے، اور یہی وہ بات ہے جس کی طرف ہم جاتے ہیں اور کہتے ہیں۔\n\n### [بے شک اللہ کے لیے فرشتوں میں سے ایسی ارواح ہیں جن کی مقدار اللہ کے سوا کوئی نہیں جانتا]\n\nاور جان لو کہ اللہ کے لیے اس مقام میں فرشتوں میں سے ایسی ارواح ہیں جن کے ہاتھوں میں خیرات اور دائمی نعمتیں ہیں جن کی مقدار اللہ تعالیٰ کے سوا کوئی نہیں جانتا۔ اللہ نے انہیں اس پر مقرر کیا ہے اور انہیں اس پر محافظ اور انسانوں میں سے اپنے ساتھیوں کے لیے خزانچی بنایا ہے۔ وہ اسے اس وقت ادا کرتے ہیں جو حق (الحق) نے ان کے لیے مقرر کیا ہے اور اس حالت کے ساتھ متعین کیا ہے جس کی طرف وہ سعید بندہ منتقل ہوتا ہے۔ اسی طرح اس کے لیے اس کے برعکس خزانچی فرشتے بھی ہیں جو دوسرے انسان کے لیے تیار کیے گئے ہیں، وہ اسے اس وقت ادا کرتے ہیں جو حق نے ان کے لیے مقرر کیا ہے، اس حالت کے ساتھ جس کی طرف وہ شقی بندہ منتقل ہوتا ہے۔ یہ سب عزیز و علیم (العزيز العليم) کی تقدیر سے ہے۔\n\n### [بندے کے کلام سے فرشتوں کی تخلیق]\n\nاور جان لو کہ بندہ جو بھی کلمہ بولتا ہے، اللہ اس کلمے سے ایک فرشتہ پیدا کرتا ہے۔ اگر وہ خیر کا کلمہ ہو تو وہ رحمت کا فرشتہ ہوتا ہے، اور اگر وہ شر کا کلمہ ہو تو وہ عذاب کا فرشتہ ہوتا ہے۔ اگر بندہ اللہ سے توبہ کرے اور اپنی توبہ کا تلفظ کرے، تو اللہ اس لفظ سے رحمت کا فرشتہ پیدا کرتا ہے، اور اس معنی کی وجہ سے جو اس توبہ کے لفظ نے ظاہر کیا، جو توبہ کرنے والے کے قلب میں قائم ہوا، اس فرشتے پر جو شر کے کلمے سے پیدا ہوا تھا، رحمت کا خلعت (لباس) ڈالتا ہے، اور اس کے اور اس فرشتے کے درمیان بھائی چارہ قائم کرتا ہے جسے اس نے توبہ کے کلمے سے پیدا کیا، اور وہ اس کا قول ہے: \"میں نے اللہ سے توبہ کی\"۔ اگر توبہ عام ہو، تو اس بندے کے شر کے کلمات سے پیدا ہونے والے ہر عذاب کے فرشتے پر رحمت کا خلعت ڈالا جاتا ہے، اور اسے اس فرشتے کا ساتھی بنا دیا جاتا ہے جو اس کی توبہ کے لفظ سے پیدا ہوا ہے۔ کیونکہ جب بندہ کہتا ہے: \"میں نے ہر اس چیز سے تیری طرف توبہ کی جو تجھے پسند نہیں،\" تو اس لفظ میں خیر کی وہ جامعیت ہوتی ہے جو ہر شر کو شامل کر لیتی ہے۔ پس اس لفظ سے بہت سے فرشتے پیدا ہوتے ہیں، ان شر کے کلمات کی تعداد کے برابر جو اس سے صادر ہوئے تھے۔ کیونکہ انسان کو ایک لفظ دیا گیا ہے جو افراد پر دلالت کرتا ہے، ایک لفظ جو دو پر دلالت کرتا ہے، اور ایک لفظ جو کثرت پر دلالت کرتا ہے۔ پس لفظ \"کُلٌّ\" (ہر ایک) کثرت پر دلالت کرتا ہے۔ لہٰذا یہ معلوم ہوا کہ اس کا قول \"میں نے ہر چیز سے اللہ کی طرف توبہ کی\" درحقیقت یہ ہے کہ \"میں نے اللہ کی طرف فلاں سے توبہ کی، میں نے اللہ کی طرف فلاں سے توبہ کی، میں نے اللہ کی طرف فلاں سے توبہ کی،\" جیسا کہ تم \"زیدون\" کہتے ہو اور اس سے تمہاری مراد زید، زید اور زید ہوتی ہے، یہ کم از کم ہے، جو لامتناہی کثرت تک جاتا ہے۔ اور اسی طرح جمعِ مکسر میں لفظ \"زیود\" ہے۔ اسی لیے اللہ جمع کے کلمے سے اتنے فرشتے پیدا کرتا ہے جتنے کو وہ کلمہ شامل کرتا ہے۔\n\nاور ہم نے یہ اس لیے کہا کہ شر کے کلمے سے پیدا ہونے والے فرشتوں پر خیر کا خلعت ڈالا جاتا ہے اور وہ اس توبہ کرنے والے کے حق میں رحمت کے فرشتے بن جاتے ہیں، اور ان کے اور اس شر سے توبہ کے لفظ سے پیدا ہونے والے فرشتوں کے درمیان بھائی چارہ قائم کیا جاتا ہے، کیونکہ کشف (الکشف) نے یہ عطا کیا ہے، اور نازل شدہ وحی نے اللہ تعالیٰ کے اس صنف کے بارے میں اس فرمان سے اس کی تصدیق کی ہے: **يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ** (اللہ ان کی برائیوں کو نیکیوں سے بدل دیتا ہے)۔ پس اللہ نے تبدیلی کو عینِ برائی میں رکھا، اور یہی وہ بات ہے جو ہم نے ذکر کی۔\n\nاور مجھے عبدالکریم بن وحشی المصری نے خبر دی، جو مکہ میں رجال (صوفیاء) میں سے تھے، اللہ ان پر رحم کرے، سنہ 599ھ میں۔ انہوں نے مجھے بتایا: \"میں مصر کے علاقوں کی تلاش میں جدہ سے سمندری سفر پر نکلا۔ جب ہم سمندر میں گہرائی میں پہنچے، تو ایک رات ہم سمندر کے بیچ میں چل رہے تھے اور کشتی کے لوگ سو رہے تھے۔ اچانک جماعت کا ایک شخص قضائے حاجت کے لیے اٹھا، اس کا پاؤں پھسلا اور وہ سمندر میں گر گیا، اور لہروں نے اسے لے لیا۔ کپتان خاموش رہا اور کچھ نہ بولا، اور ہوا اچھی تھی۔ کپتان کو اس وقت تک معلوم نہ ہوا جب تک کہ وہ شخص پانی کی سطح پر آتا ہوا کشتی میں داخل نہ ہو گیا، اور اس کے ساتھ ایک بڑا پرندہ تھا۔ جب وہ کشتی تک پہنچا تو پرندہ اڑ گیا اور مستول کے سرے پر بیٹھ گیا۔ پھر کپتان نے دیکھا کہ پرندے نے اپنی چونچ اس شخص کے کان کی طرف بڑھائی، گویا وہ اس سے بات کر رہا ہو، پھر وہ اڑ گیا۔\"\n\nکپتان نے اس سے کچھ نہیں کہا، یہاں تک کہ دن کے کسی اور وقت کپتان نے اسے بلایا، اس کی عزت کی اور اس سے دعا کی درخواست کی۔ اس شخص نے کہا: \"میں ان لوگوں میں سے نہیں ہوں جن سے دعا کی درخواست کی جاتی ہے۔\" کپتان نے اس سے کہا: \"میں نے تمہیں کل رات دیکھا تھا اور جو کچھ تمہارے ساتھ ہوا وہ بھی دیکھا۔\" اس شخص نے کہا: \"اے میرے بھائی! معاملہ ایسا نہیں جیسا تم نے گمان کیا، لیکن جب میں سمندر میں گرا اور لہروں نے مجھے لے لیا، تو مجھے یقین ہو گیا کہ میں ہلاک ہو جاؤں گا، اور میں جانتا تھا کہ تم سے مدد مانگنا فائدہ مند نہیں ہو گا۔ تو میں نے اللہ کے فیصلے کے سامنے سر تسلیم خم کرتے ہوئے کہا: **ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ** (یہ غالب، سب کچھ جاننے والے کی تقدیر ہے)۔\"\n\n\"تو مجھے محسوس نہیں ہوا مگر یہ کہ ایک پرندے نے مجھے پکڑ لیا اور لہروں کے درمیان سے مجھے اٹھایا اور سمندر کی لہر پر مجھے اٹھا کر لایا یہاں تک کہ مجھے کشتی میں داخل کر دیا، جیسا کہ تم نے دیکھا۔ میں اللہ کی کاریگری پر حیران ہوا اور میں پرندے کی طرف دیکھتا رہا اور کہتا رہا: کاش مجھے معلوم ہوتا کہ یہ پرندہ کون ہے جسے اللہ نے میری نجات اور زندگی کا سبب بنایا؟\" تو پرندے نے مستول کے اوپر سے اپنی چونچ میرے کان تک بڑھائی اور مجھ سے کہا: \"میں تمہارا کلمہ ہوں: **ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ** (یہ غالب، سب کچھ جاننے والے کی تقدیر ہے)، اور اسی سے میرا نام رکھا گیا ہے۔\"\n\nپس یہ ان چیزوں میں سے ہے جس کی طرف ہم نے اشارہ کیا کہ اللہ فرشتوں کو کلمات سے پیدا کرتا ہے، اور وہ کلمات ان کے نام ہوتے ہیں، اور ان کے ذریعے وہ ممتاز ہوتے ہیں، اور ان کے ذریعے وہ پکارے جاتے ہیں، خواہ وہ کچھ بھی ہوں۔ اور اس مقام کے ساتھ بہت سے علوم اور تجلیات ہیں جن کے بارے میں بات طویل ہو جائے گی، اور یہ مقدار کافی ہے۔ اور **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب دویست و هشتاد و هفتم در معرفت منزل التجلی الصمدانی (تجلی الهی بی‌نیاز) و اسرار آن از الحضرة المحمدیة (حضور محمدی)\n\nشخص الزمان له نفس تدبره *** غيدا معطرة من عالم الأمر\nشخص زمان، جانی دارد که آن را تدبیر می‌کند *** زیبا و معطر از عالم امر (عالم فرمان الهی)\n\nجيم وعين وفاء من منازلها *** جاءت به رسله في محكم الذكر\nجیم و عین و فاء (حروف) از منازل خود *** رسولانش آن را در ذکر محکم (قرآن) آوردند\n\nلها صلاتان من علم الغيوب وما *** للظهر والعصر ذاك الفخر والفجر\nبرای آن دو نماز از علم غیوب است *** و آن فخر و فجر (صبح) برای ظهر و عصر نیست.\n\nهر کس می‌خواهد بر آنچه این منزل در التجلی الصمدانی (تجلی الهی بی‌نیاز) در بر دارد، از معارف (شناخت‌ها)، حقائق (حقایق هستی) و اسرار نورانی و غیره که خاص این منزل است، آگاه شود، باید آن را در باب قلب از کتاب «مواقع النجوم» ما در علم این طریق مطالعه کند. پس ما در این منزل، به جز آن، چیز دیگری را ذکر می‌کنیم تا از طولانی شدن کلام پرهیز شود.\n\n### [إن الإنابة من منزل التجلي‏]\n\nبدان که برای این منزل، الإنابة (بازگشت به حق) است و کسی که به آن تحقق یافت، ابویزید بسطامی است. این همان الجمعیة الذاتیة (جمعیت ذاتی) است و برای عارف از جانب خداوند حاصل نمی‌شود مگر از طریق شهود محقق (مشاهده یقینی) از پشت حجاب مظهر بشری. و بدان که این قوم (صوفیان) بر الفاظی اصطلاح کرده‌اند برای معانی‌ای که در نفوس خود تثبیت کرده‌اند و با آن با یکدیگر سخن می‌گویند، همان‌طور که هر طایفه‌ای در علومی که به آن می‌پردازد، چنین کرده است؛ مانند نحویان، اصحاب عدد، مهندسان، پزشکان، متکلمان و فقها و غیره. از جمله اصطلاحاتی که این طایفه بر آن توافق کرده‌اند، الهویة (هویت)، الإنیة (اِنّیت) و الأنانية (اَنانیت) است برای مقاصدی که در نفوس خود دارند. این منزل از آن جمله، منزل الأنانة (اَنانیت) است. الإنیة (اِنّیت) عبارت است از الحقیقة (حقیقت) از حیث الأحدیة (احدیت)، و الأنانية (اَنانیت) که در اینجا مورد نظر است، عبارت است از الحقیقة الأحدیة (حقیقت احدی) که عین الجمع (عین جمع) است. پس این منزلی از منازل الغیوب (غیب‌ها) است که ظهوری در الشهادة (عالم شهود) ندارد. اما منازلی که در غیب هستند، بر دو دسته‌اند: منازلی که آثاری از آن‌ها در عالم شهادت وجود دارد و با آن آثار بر آن‌ها استدلال می‌شود، هرچند که غیب باشند، چه تعریف الهی در مورد آن‌ها وارد شده باشد یا نشده باشد؛ و منازلی که هیچ اثری از آن‌ها در عالم شهادت نیست و تنها از طریق تعریف الهی شناخته می‌شوند و تحقق ما به آن‌ها مانند تحقق منازل آثار نیست. این الأنانية (اَنانیت) از منازلی است که آثاری در عالم شهادت و ملکوت دارد و آثار آن متفاوت است و با اختلاف آثارش مقید می‌شود، هرچند که در ذات خود مطلق است. گاهی با اسم ضمیری که هم‌رتبه آن است، مقید می‌شود و نیاز به تقیید دیگری دارد، مانند سخن خداوند متعال: **إِنَّا أَوْحَيْنَا إِلَيْكَ** (ما به تو وحی کردیم). «إِنَّا» (ما) و نون در «أَوْحَيْنَا» (وحی کردیم) از حیث احدیت حقیقت جمعیت، در یک مرتبه هستند. تقیید برای «إِنَّا» (ما) همان وحی است و تقیید برای نون در «أَوْحَيْنَا» (وحی کردیم) چیزی است که بعد از آن ذکر می‌کند، مانند قرآن یا روح یا غیر آن. و گاهی با اسم ضمیر مقید نمی‌شود، مانند سخن آنان که می‌گویند: «ما فرزندان فلان هستیم» و چنانکه گفته شده است:\n\nنحن بنى ضبة إذ جد الوهل *** الموت أحلى عندنا من العسل‏\nما فرزندان ضبه هستیم آنگاه که ترس جدی شد *** مرگ نزد ما شیرین‌تر از عسل است.\n\nو من در قرآن به مانند این (مورد بدون ضمیر) برنخورده‌ام تا به آن استشهاد کنم. و اگرچه این شعر، قرآن نیست، اما از کلام عرب است که قرآن به زبان آنان نازل شده است و من به آن استشهاد کردم. آنچه در این منزل به آن مقید شده‌ام، إنزال الهی (فرود آوردن الهی) است نه تنزیل (نازل کردن تدریجی) بر عارفان از بندگانش؛ خواه به آنچه در خلق خود جاری کرده است یا آنچه جاری خواهد کرد. و إنزال (فرود آوردن) بر دو قسم است: قسمی که إنزال به جهت تعریف به جایگاه آنچه در خلق خود جاری می‌کند یا آنچه جاری کرده است و مرتبه آن است. پس تنزل آن از غیب در غیب، از عین واحد به عین واحد بر قلب بنده‌ای است که تفصیل نمی‌پذیرد. و قسم دیگر آن است که تنزل آن بر قلب بنده است در حالی که او مشغول تدبیر هیکل و طبیعت خود است و او را از آن باز نمی‌دارد. و آن إنزال از عین جمع به عین جمع است تا آنچه بر او نازل شده است را برای خلقش از آنچه خداوند جاری کرده است، تفصیل دهد یا آن را حکایت کند. جماعتی برای ما حکایت کرده‌اند، از جمله ابوالبدر از شیخ ما عبدالقادر (رحمه الله) که گفت: «سال (سنه) هنگامی که بر من وارد می‌شود، می‌آید و مرا از آنچه در آن خواهد بود و رخ خواهد داد، خبر می‌دهد. و همچنین ماه و هفته و روز.» و همچنین شیخ ابویعزی ابوالنور در سرزمین مغرب چنین بود. هنگامی که رمضان وارد می‌شد، نزد او می‌آمد و او را از اعمالی که در آن پذیرفته شده و کسانی که پذیرفته شده‌اند و پذیرفته خواهند شد، آگاه می‌ساخت. من این را در حق شیخمان ابویعزی به رمضان مقید کردم، زیرا صاحب ما ابوزید الرقراقی الأصولی، این شهادت را در ماه رمضان به من خبر داد، چرا که این خبردهنده در آن زمان نزد او بود و دید که رمضان نزد او آمده و او را از آنچه ذکر کردیم، خبر می‌دهد. پس منازل اکوان (هستی‌ها) نزد خداوند از طریق تعریف الهی و عنایت به این مقرب شناخته نمی‌شود، مگر با تعریف خداوند به بندگانش در اسرارشان، به آنچه در آن می‌افکند از نفث روح در روع (دمیدن روح در دل)، مانند آنچه ملائکه بر انبیا (علیهم السلام) نازل می‌شدند.\n\n### [إن مراتب الخلق متفاضلة]\n\nو بدان که مراتبی که خلق بر آن هستند، در هر جنس متفاضل (برتر از یکدیگر) است. رسولان بر یکدیگر برتری دارند، انبیا بر یکدیگر برتری دارند، محققان بر یکدیگر برتری دارند، و عارفان بر یکدیگر برتری دارند، و همین‌طور تا صاحبان صنایع عملی. این منزل بر غیر خود در التجلیات الإلهیة (تجلیات الهی) که رؤیت آن به رؤیت ماه و خورشید تشبیه شده است، به دو هزار و هشت تجلی برتری دارد که این هشت تجلی در آن دو هزار تجلی مذکور منطوی و مندرج هستند. با این تفاوت که این هشت تجلی، خصوصیت وصفی دارند که در تجلی المقامات (تجلی مقامات) که صد و شصت و شش تجلی است، ظاهر می‌شود. در آن هنگام، سلطان این هشت تجلی ظاهر می‌شود و از معارف (شناخت‌ها) آنچه را که خداوند بخواهد، عطا می‌کند. اما آن دو هزار تجلی، تجلیاتی سریع‌الزوال هستند که مدت ماندگاری‌شان کم است و علم عامی نمی‌دهند. اما صد و شصت و شش تجلی، از علوم عامه که در موجودات ساری است و بقای آن‌ها و آنچه از آن‌ها و به سبب آن‌ها حاصل می‌شود، علمی عام، مجرد، خالص و ثابت می‌دهد که متزلزل نمی‌شود و مشتبه نمی‌گردد، هرچند که حکم آن از آن و در آن منتقل می‌شود و از آن خارج نمی‌گردد. اصحاب ما اختلاف کرده‌اند که آیا در این تجلیات، تجلی‌ای وجود دارد که از حیث صورتی که در آن تجلی می‌کند، متصف به نقص باشد، اگر آن صورت، صورت طبیعی باشد؟ و طبایع چهارگانه هستند. پس تجلی ناقص در صورت طبیعی در یک زمان در عنصر ناری (آتشین) خواهد بود و در ذات خود کامل نیست، اما به اندازه آنچه عنصرش می‌دهد، عطا می‌کند و از آن فراتر نمی‌رود. سپس اگر در تجلی دیگری باشد، عنصر دوم به آن صورت اضافه می‌شود تا اینکه عناصر در چهار تجلی کامل شوند. پس تجلی در عنصر چهارم با کمال صورت طبیعی، به صورت کامل‌شده‌ای واقع می‌شود و به برادران خود از تجلیات ملحق می‌گردد. اما امر نزد ما چنین نیست و صحیح نیست که در آنجا تجلی‌ای باشد که نقص یا زیادت یابد. بلکه این شخص که چنین می‌گوید، حالتش در عین التجلی (تجلی) بر او ظاهر شده است، پس گمان کرده که نقص در التجلی (تجلی) است، در حالی که نقص در خود او بوده است. سپس اتفاق افتاد که وقتی التجلی (تجلی) دوم بر او تجلی کرد، آن صورتی را که در نفس خود داشت، دید که در آن چیزی اضافه شده است که قبلاً نبود، و نقص و زیادت در او بود، پس حکم آن را به التجلی (تجلی) نسبت داد.\n\n### [أن الأرواح النورية المسخرة تنزل على قلوب العارفين‏]\n\nو بدان که الأرواح النوریة المسخرة (ارواح نورانی مسخر شده)، نه مدبره، بر قلب‌های عارفان نازل می‌شوند، همان‌طور که گفتیم، با اوامر و شئون الهی و خیرات، بر حسب آنچه الحق (خداوند) برای این بنده می‌خواهد. پس او را با آنچه بر او نازل شده است، ترقی می‌دهد و تخليص می‌کند تا به الحجاب الأقرب (نزدیک‌ترین حجاب) از حجاب‌های دور برسد، تا اینکه خداوند او را با ارتفاع وسائط (برداشته شدن واسطه‌ها) متولی شود. با این حال، این قلب، هنگامی که تنزلات روحی که اهل این طریقت و حکیمان عامل بر تصفیه نفوس و تخليص آن‌ها از کدورت طبع در آن مشترک هستند، از آن جدا شود و قبل از آنکه الحق (خداوند) امر او را با ارتفاع وسائط متولی شود، معری (برهنه) از هر دو امر می‌ماند، مانند الوقفة بین المقامین (توقف میان دو مقام) و مانند خواب عمومی میان حس و خیال. و این مقام الحیرة (مقام حیرت) برای این قلب است؛ زیرا آنچه با آن انس می‌گرفت و از آن می‌گرفت، از دست داده است و آنچه به سوی او می‌آید، هنوز ندیده است. پس حیران می‌ماند. صاحبم ابواسحاق ابراهیم بن محمد انصاری قرطبی (وفقه الله) از شیخمان ابوزکریا الحسنی در بجایه برایم نقل کرد که گفت: بیش از یک نفر از اصحاب او و کسانی که هنگام مرگش حاضر بودند، به من خبر دادند که شیخ در ماه رمضان در مسجد جامع معتکف بود. او لباس خود را که بر تن داشت، تغییر داد و تغییر در او ظاهر شد. به مردم گفت: «برایم دعا کنید، زیرا آنچه نزد من بود، از دست داده‌ام و هنوز چیزی از آنچه می‌آید، برایم حاصل نشده است.» و در کار خود حیران ماند، پس از مردم طلب دعا کرد، زیرا او از اهل الأذواق الإلهیة (ذوق‌های الهی) نبود، به دلیل غلبه فقه بر او، کار برایش خالص نشد. سپس به خلوت خود بازگشت و خروجش طول کشید. پس بر او وارد شدند و دیدند که او مسجی (پوشیده) است و دنیا را ترک کرده است. تغییر لباس او اشاره به این بود که آنچه می‌پوشید، از او سلب شده است. و حیرت و افتقار (نیاز) به دعای برادران، دلالت بر آن داشت که الحق (خداوند) امر او را که به آن اشاره کردیم، متولی نشده بود. من از این بابت برای او خوشحال شدم، شاید خداوند لحظه‌ای قبل از مرگش او را متولی شده باشد و او را به سوی خود قبض کرده باشد در حالی که نزد اوست. حال عارف در این حیرت و توقف، تضرع و ابتهال (زاری) به سوی خداوند با افتقار و خشوع است که به کار می‌برد تا حکم تولّی او توسط خداوند با ارتفاع وسائط (برداشته شدن واسطه‌ها) از وجه خاصی که میان هر موجود و پروردگارش است و هر عارفی آن را نمی‌شناسد، بر او تجلی کند. و از این منزل شناخته می‌شود که الحق (خداوند) چه معارفی را با إنزال (فرود آوردن) ارواح بر قلب‌های بندگانش نازل می‌کند. خداوند متعال می‌فرماید: **يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ ... أَنَّهُ لَا إِلَهَ إِلَّا أَنَا** (روح را به فرمان خود بر هر کس از بندگانش که بخواهد القا می‌کند... که هیچ معبودی جز من نیست). و نفرمود: «هو» (او). پس روح، همان القاکننده از نزد خداوند به قلب‌های بندگانش است و امر خداوند همان چیزی است که آن را القا کرده است و آن روح، صورت سخن اوست: **لَا إِلَهَ إِلَّا أَنَا فَاتَّقُونِ** (هیچ معبودی جز من نیست، پس از من پروا کنید). پس وساطت در این منزل مرتفع شد، زیرا عین وحی نازل‌شده، عین روح بود و القاکننده، خود خداوند بود نه غیر او. پس این روح، عین ملک (فرشته) نیست، بلکه عین المالکة (مالکیت) است، پس بفهم. چنین روحی را ملائکه نمی‌شناسند، زیرا از جنس آن‌ها نیست. این روح، روحی غیرمحمول است که نورانی نیست، در حالی که ملک، روحی در نور است. این ذوق (تجربه) برای ما و سایر انبیاست. اما ملائکه، ممکن است از کسانی باشند که رسولان به آن‌ها اختصاص یافته‌اند، و این همان سخن خداوند متعال است: **نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَى قَلْبِكَ** (روح الامین آن را بر قلب تو نازل کرد). پس او رسولِ رسول است. اما تنزل ارواح ملکی بر قلب‌های بندگان، آن‌ها نازل نمی‌شوند مگر به امر الله الرب (خداوند پروردگار). و معنای آن این نیست که خداوند از حضرة الخطاب (حضور خطاب) به آن‌ها امر به إنزال (فرود آوردن) می‌کند، بلکه چیزی را به آن‌ها القا می‌کند که شایسته مقام آن‌ها نیست، در صورتی از کسی که بر او نازل می‌شوند. پس می‌دانند که خداوند از آن‌ها إنزال و نزول را اراده کرده است، به واسطه وحیی که در نفوس خود یافته‌اند و شایسته آن‌ها نیست و آن وحی از خصائص بشر است. و صورت کسی که وحی بر او نازل می‌شود را در صورتی که نزد آن‌هاست و تسبیح آن «یا من أظهر الجمیل و ستر القبیح» (ای کسی که زیبایی را آشکار و زشتی را پنهان کردی) است، مشاهده می‌کنند. پس از آن صور، می‌شناسند که صاحب آن در زمین کیست. پس بر او نازل می‌شوند و آنچه به آن‌ها القا شده است را به او القا می‌کنند. و آن القاشده را به شرع و وحی تعبیر می‌کنند. اگر به حکم صفت به خداوند نسبت داده شود، قرآن، فرقان، تورات، زبور، انجیل و صحف نامیده می‌شود. و اگر به حکم فعل، نه به حکم صفت، به خداوند نسبت داده شود، حدیث، خبر، رأی و سنت نامیده می‌شود. و گاهی نیز با امر الهی از حضرة الخطاب (حضور خطاب) نازل می‌شوند. و هر دو وجه تنزل را سخن جبرئیل به محمد (صلی الله علیه و سلم) در بر می‌گیرد، هنگامی که الحق (خداوند) به او فرمود که برای پیامبرش (صلی الله علیه و سلم) از جانب پروردگارش خبر دهد. و به همین دلیل آن را از قرآن قرار داد، در حالی که حکایت خداوند از جبرئیل است و جبرئیل آن را نازل کرده است. و نزول او و حکایت از او، آن را از قرآن بودن خارج نکرده است. پس جبرئیل از خداوند متعال حکایت می‌کرد، آنچه را که خداوند متعال از جبرئیل حکایت کرد که اگر به محمد (صلی الله علیه و سلم) آن را می‌گفت، به همین حد در عالم شهادت به او می‌گفت، و آن سخن خداوند است: **وَمَا نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ لَهُ مَا بَيْنَ أَيْدِينَا وَمَا خَلْفَنَا وَمَا بَيْنَ ذَلِكَ وَمَا كَانَ رَبُّكَ نَسِيًّا** (و ما نازل نمی‌شویم مگر به فرمان پروردگارت. آنچه پیش روی ما و آنچه پشت سر ما و آنچه میان آن دو است، از آن اوست، و پروردگار تو فراموشکار نبوده است). در آنچه از سخن جبرئیل به محمد (علیهما السلام) مشاهده کرد، و آن‌ها اعیان ثابته (ذوات ثابت) در حال عدمشان هستند و خطاباتشان اعیان ثابته در حال عدمشان برای اوست. این اشاره به سخن اوست: **نَسِيًّا** (فراموشکار). پس حکایت، امری محقق از وجودی محقق برای خداوند بود که متصف به حدوث نمی‌شود. سپس وجود برای آن اعیان حادث شد، پس از آنچه قبل از وجودشان از آن‌ها بود و الحق (خداوند) آن را مشاهده کرد و آن‌ها به دلیل عدم وجودشان در عین خود، آن را مشاهده نکردند، خبر دادند. از زهری روایت شده است که از شخصی از ثقات (افراد مورد اعتماد) حدیثی را نقل کرد یا از او نقل شد، پس آن کسی که حدیث از او نقل شده بود، گفت: «من این حدیث را نمی‌دانم و نسبت به آن یقین ندارم، اما تو نزد من مورد اعتماد هستی.» پس آن را از او از جانب خودش روایت کرد و گفت: «فلان از من برایم حدیث گفت.» و گفت: «من به او گفتم که فلان از من برایم حدیث گفت.» و اسناد متصل شد. پس به این مسئله در طریق روایت توجه کن. و از جمله چیزهایی که این منزل در بر می‌گیرد، برتری علم مستور (پنهان) بر علم مشهور (آشکار) است. و علم مستور بر دو قسم است: قسمی که در عالم شهادت، صور کلمات را در بر نگرفته است، و قسمی که صور کلمات را در بر گرفته است. مانند علمی که صور کلمات را در بر گرفته است و پنهان است از اینکه معرفت عارفی به طور قطع به آن تعلق گیرد، مگر با اخبار الهی. این همان علم متشابهات قرآن است که **لَا يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ** (تأویل آن را جز خدا نمی‌داند). این از علوم مستور است، اما از صور کلمات شناخته نمی‌شود که در کدام وجه پنهان است. و علم مستور دوم، آن است که صورتی از صور کلمات نداشته باشد که با آن محجوب شود. و برتری و منزلت چنین علمی مجهول است و خداوند و کسی که خداوند او را آگاه سازد، آن را می‌داند. و گاهی انسان به عملی که مقتضای آن علم است، دست می‌یابد، در حالی که آن را نمی‌شناسد تا اینکه به سرای آخرت منتقل شود و ثمره عمل خود را مرتبط با منزلت آن علم مستور بیابد، پس در آن هنگام آن را می‌آموزد.\n\nعند ذلك ومما يتعلق بهذا الباب إنزال الهو منزلة الشاهد مع بقاء الهو في عينه منزها ولا يكون الهو ينزل أبدا إلا في صور مدركة بالحس إما في الحس وإما في الخيال ويسمى بالهو في حال ظهور الصورة ليعلم أن الهو روح تلك الصورة ومدلولها فيعلم إن تلك الصورة لا يعلم معناها إلا الله كما قال تعالى **وَعِنْدَهُ مَفَاتِحُ الْغَيْبِ لَا يَعْلَمُهَا إِلَّا هُوَ** (و کلیدهای غیب نزد اوست، جز او کسی آن‌ها را نمی‌داند). و کسی که نزد الهو (او) باشد، در جایگاه الهو (او) است، و الهو (او) غیب است و آنچه نزد اوست، غیب است. و چون غیب نزد غیب باشد، عالم شهادت آن را نمی‌داند، بلکه غیب آن را می‌داند. پس آنچه در غیب است را جز کسی که خود غیب است، نمی‌داند. از حیث صور، غیب به ظرفیت (مکان) نسبت داده می‌شود. پس اگر صور مرتفع شوند، غیب زائل می‌شود، زیرا حجاب برداشته شده است. پس متصف به غیب و شهادت نمی‌شود، زیرا شهادت از صور جدا نمی‌شود و ما گفتیم که صورتی نیست، پس گفتیم شهادتی نیست. و صورت، آن امر را غیب می‌سازد و ما به زوال صورت حکم کردیم، پس حکم غیب را از آن امر برداشتیم. پس نه غیبی هست و نه شهادتی. و در این منزل از عجایب و اسرار چیزی است که اگر آن را آشکار می‌کردیم، عقول بیشتر علمای این طریقت که سلیم هستند، از پذیرش آن باز می‌ایستاد. و از این منزل، ملک الموت آجال (سررسیدهای) مردم را دریافت می‌کند. و اهل الکشف (اهل کشف) در مورد آجال حیوانات و آجال هر آنچه غیر از انسان است، اختلاف کرده‌اند که آیا این منزل، منزل علم به آن‌ها هست یا خیر؟ و آیا آنچه غیر از حیوان است، آجالی دارد یا خیر؟\n\n### [إن الله تعالى جعل لكل صورة في العالم أجلا]\n\nبدان که خداوند متعال برای هر صورتی در عالم، أجلی (سررسیدی) قرار داده است که در دنیا و آخرت به آن پایان می‌یابد، مگر الأعیان القابلة للصور (ذوات پذیرنده صور) که برای آن‌ها أجلی نیست، بلکه از زمانی که خداوند آن‌ها را خلق کرده است، دوام و بقا دارند. خداوند متعال می‌فرماید: **كُلٌّ يَجْرِي إِلَى أَجَلٍ مُسَمًّى** (همه تا سررسیدی معین در حرکتند). و فرمود: **ثُمَّ قَضَى أَجَلًا وَأَجَلٌ مُسَمًّى عِنْدَهُ** (سپس سررسیدی را مقرر کرد و سررسیدی معین نزد اوست). پس «کلّ» (همه) را آورد و این اقتضای احاطه و عموم دارد. و ما گفتیم که الأعیان القابلة للصور (ذوات پذیرنده صور) أجلی ندارند. پس چگونه از حکم «کلّ» خارج شدند؟ می‌گوییم: خارج نشدند، بلکه أجلی که برای عین است، تنها ارتباط آن با صورتی از صور است که آن را می‌پذیرد. پس در پذیرش آن صورت، تا أجلی مسمی (سررسیدی معین) پایان می‌یابد، و آن انقضای زمان آن صورت است. پس هنگامی که أجل معلوم نزد خداوند در این ارتباط فرا رسد، صورت معدوم می‌شود و عین، صورت دیگری را می‌پذیرد. پس الأعیان (ذوات) تا أجلی مسمی (سررسیدی معین) در پذیرش صورتی خاص در جریان بوده‌اند، همان‌طور که صورت تا أجلی مسمی در ثبوت خود برای آن عین که محل ظهورش بود، در جریان بوده است. پس أجل مسمی (سررسید معین) همه را فرا گرفته است. پس خداوند برای هر چیزی در امری، أجلی مقدر کرده است که به آن پایان می‌یابد، سپس به حالت دیگری منتقل می‌شود که در آن نیز تا أجلی مسمی در جریان است. زیرا خداوند پیوسته با هر نفس (دم) خالق است. از اشیا، چیزهایی هستند که مدت بقایشان، زمان وجودشان است و در زمان دوم از زمان وجودشان به أجل خود پایان می‌یابند، و این کوتاه‌ترین مدت در عالم است. و خداوند این کار را کرد تا افتقار (نیاز) اعیان به خداوند با هر نفس، صحیح باشد. اگر دو زمان یا بیشتر باقی می‌ماندند، در آن مدت متصف به بی‌نیازی از خداوند می‌شدند. و این مسئله‌ای است که هیچ کس جز اهل الکشف المحقق (اهل کشف محقق) از ما و اشاعره از متکلمین به آن قائل نیستند. و موضع اجماع از همه در این مسئله که نمی‌توانند آن را انکار کنند، حرکت است، مگر دو طایفه: یکی کسانی که حرکت را نسبتی می‌دانند که وجود ندارد، و او باقلانی از متکلمین است، و دیگری اصحاب کمون و ظهور (نهفتگی و آشکار شدن) که به آن قائلند. و اگر قائلان به کمون و ظهور به این قائل باشند، باز هم تحت احاطه «کلّ» با این مذهب هستند، زیرا آن (شیء) در کمون خود تا أجلی مسمی (سررسیدی معین) در جریان بوده است که همان زمان ظهورش است، پس مدت کمونش سپری شده است. و در ظهور خود تا أجلی مسمی در جریان بوده است که همان زمان کمونش است، پس مدت ظهورش سپری شده است. و از جریان آن‌ها به سوی أجل، لازم نمی‌آید که مراد، عدم آن‌ها باشد، بلکه ممکن است که عدم برای آن باشد و ممکن است که انتقال با بقای عین موصوف به جریان باشد. و ممکن است که أجلی باشد که آن را معدوم کند و أجلی باشد که با انتقالش آن را معدوم کند، و این همان چیزی است که ما به آن می‌رویم و به آن قائل هستیم.\n\n### [إن لله أرواحا من الملائكة ما لا يدري مقداره‏]\n\nو بدان که خداوند در این منزل، ارواحی از ملائکه دارد که در دست‌هایشان از خیرات و نعیم دائم (نعمت پایدار) چیزی است که مقدار آن را جز خداوند متعال نمی‌داند. خداوند آن‌ها را بر آن موکل کرده و حافظ و خزانه‌دار آن برای اصحابشان از انسان‌ها قرار داده است. آن‌ها آن را در زمانی که الحق (خداوند) برای آن بنده سعادتمند مقرر و معین کرده است، با حالی که آن بنده به آن منتقل می‌شود، به او می‌رسانند. و همچنین ملائکه خزانه‌داری برای نقیض آن نیز دارد که برای انسان دیگری آماده شده‌اند و آن را در زمانی که الحق (خداوند) برای آن‌ها مقرر کرده است، با حالی که آن بنده شقاوتمند به آن منتقل می‌شود، به او می‌رسانند. همه این‌ها به تقدیر العزیز العلیم (خدای مقتدر دانا) است.\n\n### [خلق الملائكة من تكلم العبد]\n\nو بدان که هیچ کلمه‌ای نیست که بنده به آن سخن بگوید، مگر اینکه خداوند از آن کلمه، ملکی خلق می‌کند. اگر خیر باشد، ملک رحمة (فرشته رحمت) است و اگر شر باشد، ملک نقمة (فرشته انتقام) است. پس اگر به سوی خداوند توبه کند و توبه خود را به زبان آورد، خداوند از آن لفظ، ملک رحمة (فرشته رحمت) خلق می‌کند و از معنایی که آن لفظ توبه بر آن دلالت دارد و در قلب توبه‌کننده قائم است، بر آن ملکی که از کلمه شر خلق شده بود، خلعت رحمت می‌پوشاند و میان او و ملکی که از کلمه توبه خلق شده است، برادری برقرار می‌کند، و آن سخن اوست: «تُبتُ إلی الله» (به سوی خدا توبه کردم). اگر توبه عام باشد، بر هر ملک نقمة (فرشته انتقام) که از کلمات شر آن بنده خلق شده بود، خلعت رحمت می‌پوشاند و او را مصاحب ملکی قرار می‌دهد که از لفظ توبه او خلق شده است. زیرا هنگامی که بنده می‌گوید: «تُبتُ إلیک من کل شیء لا یرضیک» (از هر چیزی که تو را راضی نمی‌کند، به سوی تو توبه کردم)، در این لفظ خیر، جامعیت هر چیزی از شر وجود دارد. پس خداوند از این لفظ، ملائکه بسیاری به تعداد کلمات شری که از او صادر شده است، خلق می‌کند. زیرا به انسان لفظی داده شده که بر افراد دلالت می‌کند و لفظی داده شده که بر دو نفر دلالت می‌کند و لفظی داده شده که بر کثرت دلالت می‌کند. پس لفظ «کلّ» (همه) بر کثرت دلالت می‌کند. پس دانسته می‌شود که سخن او: «تُبتُ إلی الله من کل شیء» (از هر چیزی به سوی خدا توبه کردم)، یعنی: «تُبتُ إلی الله من کذا، تُبتُ إلی الله من کذا، تُبتُ إلی الله من کذا»، همان‌طور که می‌گویی: «زیدون» و منظور تو زید و زید و زید است، و این کمترین آن است تا کثرتی که پایان ندارد. و همچنین لفظ «زیود» در جمع مکسر. به همین دلیل، خداوند از کلمه جمع، ملائکه‌ای به تعداد آنچه آن کلمه در بر می‌گیرد، خلق می‌کند. و ما گفتیم که ملائکه‌ای که از کلمه شر خلق شده‌اند، خلعت خیر بر آن‌ها پوشانده می‌شود و در حق این توبه‌کننده، ملائکه رحمت می‌شوند و میان آن‌ها و ملائکه‌ای که از لفظ توبه از آن شر خلق شده‌اند، مصاحبت برقرار می‌شود، زیرا الکشف (کشف) این را عطا کرده است و وحی نازل‌شده آن را تصدیق کرده است، با سخن خداوند متعال در مورد این صنف: **يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ** (خداوند بدی‌هایشان را به نیکی‌ها تبدیل می‌کند). پس تبدیل را در عین سیئه (بدی) قرار داد، و این همان چیزی است که ما ذکر کردیم. عبدالکریم بن وحشی مصری که از مردان (صالح) در مکه بود (رحمه الله) در سال پانصد و نود و نه برایم حکایت کرد و گفت: «از جده سوار دریا شدم و دیار مصر را طلب می‌کردم. هنگامی که حرکت کردیم، شبی در وسط دریا در حال حرکت بودیم و اهل کشتی خوابیده بودند. ناگهان شخصی از جمع برخاست و قصد قضای حاجت داشت. پایش لغزید و در دریا افتاد و امواج او را گرفتند. رئیس کشتی ساکت ماند و سخنی نگفت و باد خوب بود. رئیس کشتی متوجه نشد، مگر اینکه آن مرد بر روی آب می‌آمد تا اینکه وارد کشتی شد و پرنده بزرگی همراه او بود. هنگامی که به کشتی رسید، پرنده پرواز کرد و بر جامور (نوک) دکل بر بالای سر آن مرد نشست. سپس دید که منقار خود را به گوش آن مرد دراز کرد، گویی با او سخن می‌گوید، سپس پرواز کرد. رئیس کشتی چیزی به او نگفت تا اینکه در وقت دیگری از روز، رئیس او را گرفت و اکرام کرد و از او طلب دعا نمود. مرد گفت: «من از آن قومی نیستم که از آن‌ها طلب دعا می‌شود.» رئیس کشتی به او گفت: «دیشب تو را دیدم و آنچه بر تو گذشت.» مرد گفت: «ای برادر، امر آن‌طور که گمان کردی نیست، بلکه هنگامی که در دریا افتادم و امواج مرا گرفتند، به هلاکت یقین کردم و دانستم که استغاثه به شما فایده‌ای ندارد. پس در تسلیم به قضای الهی گفتم: **ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ** (این تقدیر خدای مقتدر داناست). پس متوجه نشدم، مگر اینکه پرنده‌ای مرا گرفت و از میان امواج بلند کرد و مرا بر موج دریا حمل کرد تا اینکه مرا وارد کشتی کرد، همان‌طور که دیدی. پس از صنع خداوند تعجب کردم و به پرنده نگاه می‌کردم و می‌گفتم: ای کاش می‌دانستم این پرنده کیست که خداوند او را سبب نجات و حیات من قرار داد. پس پرنده منقار خود را از بالای دکل به گوش من دراز کرد و به من گفت: «من کلمه تو هستم: **ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ** (این تقدیر خدای مقتدر داناست) و به آن نامیده شده‌ام.» پس نام آن پرنده **ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ** بود. این از جمله چیزهایی است که به آن اشاره کردیم که خداوند ملائکه را از کلمات خلق می‌کند و آن کلمات، نام‌های آن‌ها هستند و با آن‌ها متمایز می‌شوند و با آن‌ها خوانده می‌شوند، هرچه که باشند. و علوم و تجلیات بسیاری به این منزل اختصاص دارد که سخن در مورد آن‌ها طولانی می‌شود و همین مقدار کافی است. و **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}