{
  "id": 516,
  "title": {
    "ar": "الباب السادس عشر وخمسمائة في معرفة حال قطب",
    "en": "Chapter 516: On the Knowledge of the State (حال) of the Pole (قطب)",
    "ur": "پانچ سو سولہواں باب، قطب کے حال کی معرفت میں",
    "fa": "باب پانصد و شانزدهم در معرفت حال قطب"
  },
  "content": {
    "ar": "## «الباب السادس عشر وخمسمائة في معرفة حال قطب»\n\n\nكان منزله قُلْ إِنْ كانَ آباؤُكُمْ وأَبْناؤُكُمْ وإِخْوانُكُمْ وأَزْواجُكُمْ وعَشِيرَتُكُمْ وأَمْوالٌ اقْتَرَفْتُمُوها وتِجارَةٌ تَخْشَوْنَ كَسادَها ومَساكِنُ تَرْضَوْنَها أَحَبَّ إِلَيْكُمْ من الله ورَسُولِهِ وجِهادٍ في سَبِيلِهِ فَتَرَبَّصُوا حَتَّى يَأْتِيَ الله بِأَمْرِهِ فَفِرُّوا إِلَى الله‏\n\n\n> ليس الإله الذي بالكشف تدركه *** هو الإله الذي بالفكر تدريه‏\n\n\n> لكون فكرك لا تعدوه رتبته *** وقد يكون ولكن فيه ما فيه‏\n\n\n> الحكم بالفكر في الأشياء مختلف *** والحكم بالكشف لا تدري مبانيه‏\n\n\n> يراه في كشفه في كل معتقد *** وليس ينكر معنى من معانيه‏\n\n\n> جل الإله فلا عقل يحيط به *** وليس يدري سواه فانظروا فيه‏\n\n\n> جل الإله فلا كشف يحيط به *** وليس شي‏ء من الأكوان يحويه‏\n\n\n> وهو الذي في جميع الكون تدركه *** وليس يدرك إلا من تجليه‏\n\n\n> إذا تدلى لعبد جاء يقصده *** أعطاه ما ليس يدري في تدليله‏\n\n\n> من كل خير ومن علم ومعرفة *** فمن يعادله أو من يدانيه‏\n\n\n### [الحكمة وهو الخير الكثير]\n\n\nاعلم أيدنا الله وإياك بروح منه أن الخير في هذا المنظوم يريد به الحكمة وهو الخير الكثير والعلم ما يدركه من التركيب والمعرفة ما يدركه في المفردات هذه آية جاءت إلينا يوم جمعة بعد الصلاة في المقابر بإشبيلية سنة ست وثمانين وخمسمائة فبقيت فيها سكران مالي تلاوة في صلاة ولا يقظة ولا نوم إلا بها ثلاث سنين متوالية أجد لها حلاوة ولذة لا يقدر قدرها وهي من الأذكار المفرقة بين الله وبين الخلق تفريق تمييز فهو تفريق في جمع وفرقان في قرآن فيجمع بهذا الذكر بين القرآن والفرقان فكل من له عليك ولادة من أي نوع وفي أي صورة كان من ظاهر وباطن واسم إلهي وكياني فهو أبوك وكل من لك عليه ولادة من أي نوع كان وفي أي صورة كان من ظاهر وباطن واسم إلهي وكياني فهو ابنك فقد يكون ابنك في هذا الذكر عين أبيك فيكون له عليك ولادة ولك عليه ولادة وهو المقام الذي أشار إليه الحلاج بقوله‏\n\n\n> ولدت أمي أباها *** إن ذا من عجباتي‏\n\n\nوكل ما قابلك من الأمثال وداخلك من الأشباه ومازجك أو قارب من الأنداد وكان عديلا لك في الوراثة بحيث لو وزنتما في العلم الموروث من الكتاب ما رجح عليك وزنا ولا رجحت عليه فهو أخوك ولكن من الاسم الظاهر فأبوكما واحد ظاهرا لا غير وليس للاسم الباطن هنا حكم فإن الباطن يمنع أن تكونا أخوين لأب واحد وأم واحدة فإن المزاج الواحد لا يجمع اثنين في الكون والتجلي لا يكون عنه اثنان فإن الأمر أوسع من ذلك فكل واحد له واحد من أم وأب فالطبيعة لا تلد توأمين والوالد لا يلقي في كل نكاح ماءين كما لا يكون في العالم لواحد في زمن واحد شأنان وكل من ثناك وجوده وانفعل لك فيما تريده وكنت فيه خلاقا وإليه إذا غاب عنك مشتاقا وجمعتكما الرحمة الواحدة والمودة الثابتة وسكنت إليك وسكن إليك وأعطاك من نفسه التحكم فيه وظهر فيه اقتدارك فهو زوجك‏\nتحبه طبعا وتتحد به ويكون ملكا لك شرعا وكل ما تعتضد به في أمورك من الأسماء الإلهية والتجلي والكون من أرواح قدسية وعقول ندسية تؤيدك في الشدائد وتأتيك بالتحف والزوائد فهو عشيرتك وكل من تميل إليه فيميل إليك لميلك ويحضره ديوان نيلك ويقف عند فعلك فيه وقولك ويتحكم فيه سلطان طولك وتصل في اقتنائه نهارك بليلك فذلك هو مالك الذي اقترفته من الأموال الظاهرة والباطنة والمعنوية والمحسوسة من ثابت كالعقار ومن غير ثابت كالعروض والدرهم والدينار وكل منقول لا يقربه قرار فالثابت كالمقام وغير الثابت كالحال وكله مال لأنه مال وإليه المال بعد الرحلة عنه والانفصال ولكن إذا آل إليه أمرك رأيته في غير الصورة التي عليها فارقته وكل أمر تطلب الخروج عنه ليكون ذلك الخروج سببا لتحصيل ما يكون عندك أنفس منه فتطلب به النفاق في الأسواق ويقوم لك فيه الجمع بين التلاق والفراق والنكاح والطلاق ظاهرا وباطنا فذلك التجارة التي تخشى كسادها وتخاف فسادها فاستبطنت مهادها واستوطأت قتادها وأعددت لها إعدادها وحصلت لها إن كنت تاجر سفر زادها لتنجيك من عذاب أليم وتوفيك الربح والحق الجسيم وكل من اتخذته محلا وكنت به محلي وجعلته حرما لك وحلا فذلك مسكنك الذي ترضاه ومنزلك الذي تقصده وتتوخاه فقال لك الحق فيما أنزله إليك ووفد به رسوله الأمين عليك إذا لم تر وجه الحق في كل ما ذكرته وتعشقت به لعينه وتعرف أنه من عنده ما هو عينه وآثرته مع هذا الحجاب على ما دعاك الحق إليه من الزهد فيه إذا فقدت‏\n\n\nفيه وجه الحق فتعلم إن الله ما أراد منك إلا أن تعرفه فيما أمرك بالزهد فيه والرغبة عنه وأحببته حب عين وصورة كون وكان أحب إليك من الله الجامع للرغبة فيه والرغبة عنه فإنه المعطي المانع والضار النافع وأحب إليك من رسوله الوافد عليك المعرف بما هو حجاب عن المقصود وستر بين العابد والمعبود مع علمك بما أعلمك أنه ما خلقك إلا لتعبده وتؤثره على ما تراه فيه وتقصده وأحب إليك من جهادك في سبيل الله الذي يجمع لك بين الحياتين فلا تعرف للموت طعما ولا للحصر حكما فَتَرَبَّصُوا كلمة تهديد ووعيد حَتَّى يَأْتِيَ الله بِأَمْرِهِ فتعرف عند ذلك خيره من شره وحلوه من مره وتذوق شهده من صبره ثم نصح في الإنزال على لسان الإرسال بالفرار إلى الله من هذه الحجب والتدبر لما جاءت به من عند الله الصحف والكتب مع إرخاء الطنب لتخلو بالمقصورات في الخيام وتفتض أبكارا لم يطمثهن إنس قبلك ولا جان فتحصل من المعارف في تلك العوارف ما لا يصفه واصف ولا يتمكن أن يقف عنده واقف لورود ما هو أعلى وأنفس من كل محل أقدس وإن كان الفكر والتجلي في عدم الإحاطة بالمدرك بهما سيان وهما من هذا الوجه مثلان فبينهما فرقان بين لا خفاء به إن صاحب الفكر يحكم عليه في محصوله الدخل وتتمكن منه الشبه وتزلزله عما كان بالأمس يعتمد عليه ويركن إليه والتجلي للعارف ليس كذلك بل هو في نعيم متجدد وفي شهود لخلق جديد ما هو منه في لبس وهو الجامع في الالتذاذ بين اليوم والأمس فلا يزال في لذة موجودة لصورة إلهيه مشهودة لا يعطيه الفناء عن جميع لذاته لأنها من لذاته وجدت لوجوده فاجتمعا في شهوده والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "His station was: Say: <<If your fathers, and your sons, and your brethren, and your wives, and your kindred, and wealth you have acquired, and merchandise for which you fear a decline, and dwellings that you love, are dearer to you than Allah and His Messenger and striving in His way, then wait until Allah brings forth His command.>> So, <<Flee unto Allah.>>\n\nThe God whom you perceive through Unveiling (الكشف) is not the God whom you know through Intellect (الفكر).\nBecause your intellect does not transcend its own degree (رتبته); and it may exist, but there is in it what is in it.\nJudgment based on Intellect (الفكر) concerning things is varied, but the judgment based on Unveiling (الكشف)—you do not know its foundations.\nHe sees Him in his Unveiling (كشفه) in every belief, and he does not deny any meaning of His meanings.\nExalted is the God, for no intellect encompasses Him, and none knows Him save Him; so look into Him.\nExalted is the God, for no Unveiling (كشف) encompasses Him, and nothing of the existent things (الأكوان) contains Him.\nAnd He is the One whom you perceive in the entire Cosmos (الكون), and He is not perceived except through His Theophany (تجليه).\nWhen He descends (تدلى) to a servant who comes seeking Him, He grants him in His descent (تدليله) what he does not know.\nOf every good, and of Knowledge (علم) and Gnosis (معرفة); so who can equal Him, or who can approach Him?\n\n### [Wisdom (الحكمة), which is Abundant Good]\n\nKnow—may Allah support us and you with a spirit from Him—that the Good (الخير) in this poem refers to Wisdom (الحكمة), which is the Abundant Good (الخير الكثير). Knowledge (العلم) is what one perceives through composition (التركيب), and Gnosis (المعرفة) is what one perceives in the singulars (المفردات). This verse (آية) came to us on a Friday after the prayer in the cemeteries of Seville in the year 586 AH. I remained intoxicated (سكران) by it for three consecutive years, having no recitation in prayer, nor in wakefulness, nor in sleep, except with it. I found in it a sweetness and delight whose measure cannot be estimated. It is one of the remembrances (الأذكار) that distinguishes between Allah and the Creation (الخلق)—a distinction of differentiation (تفريق تمييز). Thus, it is a differentiation within a gathering (جمع) and a Criterion (فرقان) within a Quran (قرآن). By this remembrance, the Quran and the Criterion are brought together.\n\nEveryone who has given birth to you (ولادة) of any kind, and in any form, whether outwardly or inwardly, whether an Divine Name (اسم إلهي) or an essential reality (كياني), is your father. And everyone to whom you have given birth (ولادة) of any kind, and in any form, whether outwardly or inwardly, whether an Divine Name (اسم إلهي) or an essential reality (كياني), is your son. Your son (ابنك) may, in this remembrance, be the very essence (عين) of your father (أبيك). Thus, he has given birth to you, and you have given birth to him. This is the station (المقام) to which Al-Hallaj alluded when he said:\n\nMy mother gave birth to her father,\nIndeed, this is one of my wonders.\n\nEverything that confronts you of similitudes (الأمثال), and enters into you of likenesses (الأشباه), and mixes with you or approaches you of rivals (الأنداد), and is an equal (عديلا) to you in inheritance (الوراثة)—such that if you were weighed against each other in the inherited Knowledge (العلم الموروث) from the Book, neither would outweigh the other—that is your brother. However, this is only through the Manifest Name (الاسم الظاهر), so your father is one outwardly, and nothing else. The Inner Name (الاسم الباطن) has no ruling here, for the Inner prevents you from being two brothers from one father and one mother. This is because a single temperament (المزاج الواحد) does not gather two in existence (الكون), and a Theophany (التجلي) does not result in two. The matter is broader than that: every single person has one mother and one father. Nature (الطبيعة) does not give birth to twins, and the progenitor does not cast two waters (ماءين) in every union, just as there are not two affairs (شأنان) for one person in the World (العالم) at the same time.\n\nEveryone whose existence (وجوده) makes you two, and who is receptive to you (انفعل لك) in what you desire, and in whom you are a creator (خلاقا), and for whom you yearn when he is absent from you, and whom the single Mercy (الرحمة الواحدة) and the firm Affection (المودة الثابتة) gather together, and you find rest in him and he finds rest in you, and who grants you control over himself, and in whom your power (اقتدارك) is manifest—that is your spouse (زوجك). You love him naturally (طبعا) and unite with him, and he is legally (شرعا) your possession.\n\nEverything by which you are strengthened in your affairs—of the Divine Names (الأسماء الإلهية), the Theophany (التجلي), and the Cosmos (الكون), including holy spirits (أرواح قدسية) and subtle intellects (عقول ندسية) that support you in hardships and bring you gifts and additions—that is your kindred (عشيرتك).\n\nEveryone toward whom you incline and who inclines toward you because of your inclination, and whom the register of your attainment (ديوان نيلك) attends, and who stands by your action and word concerning him, and over whom the authority of your power (سلطان طولك) holds sway, and in whose acquisition you connect your day with your night—that is your wealth (مالك) which you have acquired (اقترفته). This includes wealth that is manifest and hidden, conceptual and sensible, whether fixed, like real estate (العقار), or unfixed, like commodities (العروض), the dirham, and the dinar, and every movable thing that finds no rest. The fixed is like the Spiritual Station (المقام), and the unfixed is like the Spiritual State (الحال). All of it is wealth (مال) because it inclines (مال) and to it the matter returns (آل) after departure and separation from it. However, when your affair returns to it, you will see it in a form other than the one upon which you left it.\n\nEvery matter from which you seek to exit, so that this exit may be a means of acquiring what is more precious to you, and by which you seek circulation (النفاق) in the markets, and in which the combination of meeting and separation (التلاق والفراق), and marriage and divorce (النكاح والطلاق), is established for you, outwardly and inwardly—that is the merchandise (التجارة) for which you fear a decline (كسادها) and whose corruption you dread. So you have sought its inner foundations (مهادها), made its thorny ground (قتادها) your dwelling, prepared its provisions, and, if you are a traveling merchant, secured its supplies, so that it may save you from a painful torment and grant you the immense profit and the great Reality (الحق الجسيم).\n\nEveryone whom you have taken as a place (محلا), and by whom you are localized (محلي), and whom you have made both a sacred precinct (حرما) and a permissible place (حلا) for yourself—that is your dwelling (مسكنك) which you approve, and your station (منزلك) which you seek and aim for.\n\nThe Real (الحق) said to you, in what He revealed to you and with which His Trustworthy Messenger (رسوله الأمين) came to you: If you do not see the Face of the Real (وجه الحق) in everything I have mentioned, and you become passionately attached to it for its own sake, knowing that it comes from Him but is not His Essence (عينه), and yet you prefer it, despite this veil (الحجاب), over what the Real has called you to—namely, detachment (الزهد) from it when you lose the Face of the Real in it—then know that Allah only desired that you recognize Him in what He commanded you to renounce and turn away from. And if you love it with the love of an essence (عين) and a cosmic form (صورة كون), and it is dearer to you than Allah, who combines the desire for Him and the turning away from Him—for He is the Giver and the Withholder, the Harmful and the Beneficial—and it is dearer to you than His Messenger, who came to you making known what is a veil (حجاب) from the Goal (المقصود) and a screen between the worshipper and the Worshipped, despite your knowledge of what He informed you: that He only created you to worship Him and to prefer Him over what you see and seek in it; and it is dearer to you than your striving (جهادك) in the way of Allah, which combines the two lives for you, so that you know neither the taste of death nor the ruling of confinement—then <<wait>> (فَتَرَبَّصُوا) is a word of threat and warning, <<until Allah brings forth His command>> (حَتَّى يَأْتِيَ الله بِأَمْرِهِ). Then you will know its good from its evil, its sweet from its bitter, and taste its honey from its patience. Then, in the Revelation (الإنزال) upon the tongue of the Sending (الإرسال), He advised flight <<unto Allah>> (الفرار إلى الله) from these veils, and reflection upon what the Scrolls and Books brought from Allah, while loosening the tent ropes (إرخاء الطنب) so that you may be alone with the secluded maidens (المقصورات) in the tents, and deflower virgins (أبكارا) whom neither man nor jinn has touched before you. Thus, you will acquire from the Gnosis (المعارف) in those spiritual gifts (العوارف) what no describer can describe, and no one standing can stop at, due to the arrival of what is higher and more precious than every most holy place. Although Intellect (الفكر) and Theophany (التجلي) are equal in their inability to encompass the object of perception, and are thus similar in this respect, there is a clear difference between them that is not hidden: the person of Intellect (صاحب الفكر) is subject to corruption (الدخل) in his outcome, and doubts (الشبه) take hold of him, shaking him from what he relied upon and trusted yesterday. The Theophany (التجلي) for the Gnostic (العارف) is not like that; rather, he is in ever-renewed bliss and in the Witnessing (شهود) of a new creation (خلق جديد) about which he is not confused. He is the one who combines delight between today and yesterday. He remains in an existing delight for a witnessed Divine Form (صورة إلهيه مشهودة). Annihilation (الفناء) does not deprive him of all his delights, because they are among His delights that came into existence for His Existence (وجوده), and thus they are gathered in his Witnessing (شهوده). And <<Allah speaks the Truth, and He guides to the Way.>>",
    "ur": "باب پانچ سو سولہ: قطب (قطب) کے حال کی معرفت میں\n\nاس کا مقام یہ ہے: \"کہہ دیجیے: اگر تمہارے باپ، اور تمہارے بیٹے، اور تمہارے بھائی، اور تمہاری بیویاں، اور تمہارا قبیلہ، اور وہ مال جو تم نے کمائے ہیں، اور وہ تجارت جس کے کساد (نقصان) کا تمہیں ڈر ہے، اور وہ مکانات جنہیں تم پسند کرتے ہو، تمہیں اللہ اور اس کے رسول اور اس کی راہ میں جہاد سے زیادہ محبوب ہیں، تو انتظار کرو یہاں تک کہ اللہ اپنا حکم لے آئے۔ پس اللہ کی طرف بھاگو۔\" (التوبہ: ۲۴)\n\n> ليس الإله الذي بالكشف تدركه *** هو الإله الذي بالفكر تدريه‏\n> وہ الٰہ جسے تم کشف (الکشف) سے پاتے ہو، وہ الٰہ نہیں جسے تم فکر (الفکر) سے جانتے ہو۔\n\n> لكون فكرك لا تعدوه رتبته *** وقد يكون ولكن فيه ما فيه‏\n> کیونکہ تمہاری فکر اپنے مرتبے سے تجاوز نہیں کرتی، اور وہ (فکر کا نتیجہ) ہو سکتا ہے، لیکن اس میں جو کچھ ہے وہ موجود ہے۔\n\n> الحكم بالفكر في الأشياء مختلف *** والحكم بالكشف لا تدري مبانيه‏\n> اشیاء میں فکر (الفکر) کے ذریعے حکم (الحکم) مختلف ہوتا ہے، اور کشف (الکشف) کے ذریعے حکم کی بنیادیں تم نہیں جانتے۔\n\n> يراه في كشفه في كل معتقد *** وليس ينكر معنى من معانيه‏\n> وہ (عارف) اسے اپنے کشف (الکشف) میں ہر معتقد میں دیکھتا ہے، اور اس کے معانی میں سے کسی معنی کا انکار نہیں کرتا۔\n\n> جل الإله فلا عقل يحيط به *** وليس يدري سواه فانظروا فيه‏\n> اللہ بلند و برتر ہے، کوئی عقل اس کا احاطہ نہیں کر سکتی، اور اس کے سوا کوئی نہیں جانتا، پس اس میں غور کرو۔\n\n> جل الإله فلا كشف يحيط به *** وليس شي‏ء من الأكوان يحويه‏\n> اللہ بلند و برتر ہے، کوئی کشف (الکشف) اس کا احاطہ نہیں کر سکتا، اور کائنات (الأکوان) میں سے کوئی شے اسے اپنے اندر نہیں سما سکتی۔\n\n> وهو الذي في جميع الكون تدركه *** وليس يدرك إلا من تجليه‏\n> اور وہ وہی ہے جسے تم تمام کون (الکون) میں پاتے ہو، اور وہ صرف اپنے ظہور الٰہی (التجلی) سے ہی پایا جاتا ہے۔\n\n> إذا تدلى لعبد جاء يقصده *** أعطاه ما ليس يدري في تدليله‏\n> جب وہ کسی بندے کے لیے نزول فرماتا ہے جو اس کا قصد کرتا ہے، تو اسے اپنے نزول میں وہ کچھ عطا کرتا ہے جو وہ نہیں جانتا۔\n\n> من كل خير ومن علم ومعرفة *** فمن يعادله أو من يدانيه‏\n> ہر خیر، ہر علم اور ہر معرفت (المعرفۃ) میں سے، پس کون اس کے برابر ہو سکتا ہے یا کون اس کے قریب آ سکتا ہے؟\n\n### [حکمت (الحکمۃ) اور وہ خیر کثیر ہے]\n\nجان لو، اللہ ہمیں اور تمہیں اپنی روح سے تائید بخشے، کہ اس منظوم (آیت) میں خیر سے مراد حکمت (الحکمۃ) ہے، اور وہ خیر کثیر ہے۔ اور علم وہ ہے جسے وہ ترکیب (مرکبات) سے پاتا ہے، اور معرفت (المعرفۃ) وہ ہے جسے وہ مفردات (تنہا اشیاء) میں پاتا ہے۔ یہ وہ آیت ہے جو ہمارے پاس جمعہ کے دن نماز کے بعد اشبیلیہ کے قبرستانوں میں ۵۸۶ھ میں آئی۔ پس میں اس میں تین سال مسلسل مست رہا، نہ نماز میں کوئی تلاوت تھی، نہ بیداری میں اور نہ نیند میں، مگر اسی کے ساتھ۔ میں اس میں ایسی مٹھاس اور لذت پاتا تھا جس کا اندازہ نہیں لگایا جا سکتا۔ اور یہ ان اذکار میں سے ہے جو اللہ اور خلق (الخلق) کے درمیان تمیز کے ساتھ تفریق کرتے ہیں۔ پس یہ جمع (الجمع) میں تفریق ہے اور قرآن (القرآن) میں فرقان (الفرقان) ہے۔ چنانچہ اس ذکر کے ذریعے قرآن اور فرقان کو جمع کیا جاتا ہے۔\n\nپس ہر وہ ہستی جس سے تمہیں ولادت (پیدائش) حاصل ہوئی ہو، خواہ وہ کسی بھی نوعیت کی ہو اور کسی بھی صورت میں ہو، ظاہر و باطن میں، اسم الٰہی میں یا کیانی (وجودی) صورت میں، وہ تمہارا باپ ہے۔ اور ہر وہ ہستی جسے تم سے ولادت حاصل ہوئی ہو، خواہ وہ کسی بھی نوعیت کی ہو اور کسی بھی صورت میں ہو، ظاہر و باطن میں، اسم الٰہی میں یا کیانی صورت میں، وہ تمہارا بیٹا ہے۔ چنانچہ اس ذکر میں تمہارا بیٹا عین تمہارا باپ ہو سکتا ہے، پس اسے تم پر ولادت حاصل ہو اور تمہیں اس پر ولادت حاصل ہو۔ اور یہ وہی مقام ہے جس کی طرف حلاج نے اپنے اس قول میں اشارہ کیا:\n\n> ولدت أمي أباها *** إن ذا من عجباتي‏\n> میری ماں نے اپنے باپ کو جنم دیا، بے شک یہ میرے عجائبات میں سے ہے۔\n\nاور ہر وہ شے جو تمہیں مثالوں میں ملی، اور جو مشابہتوں میں تمہارے اندر داخل ہوئی، اور جو تمہارے ساتھ گھل مل گئی یا ندوں (ہمسروں) میں سے قریب ہوئی، اور وراثت میں تمہارے لیے ہم پلہ تھی، اس طرح کہ اگر تم دونوں کو کتاب سے ورثے میں ملے ہوئے علم میں تولا جاتا تو نہ وہ تم پر وزن میں بڑھتا اور نہ تم اس پر بڑھتے، تو وہ تمہارا بھائی ہے۔ لیکن یہ صرف اسم ظاہر (الاسم الظاہر) کی رو سے ہے، پس تمہارا باپ ظاہراً ایک ہی ہے، اور بس۔ اور اسم باطن (الاسم الباطن) کا یہاں کوئی حکم نہیں ہے، کیونکہ باطن اس بات سے منع کرتا ہے کہ تم ایک باپ اور ایک ماں کے دو بھائی ہو، اس لیے کہ ایک مزاج کون (الکون) میں دو کو جمع نہیں کرتا، اور ظہور الٰہی (التجلی) سے دو وجود میں نہیں آتے، کیونکہ معاملہ اس سے کہیں زیادہ وسیع ہے۔ پس ہر ایک کے لیے ماں اور باپ میں سے ایک ہی ہوتا ہے۔ چنانچہ طبیعت جڑواں پیدا نہیں کرتی، اور والد ہر نکاح میں دو پانی نہیں ڈالتا، جیسا کہ عالم میں ایک ہی وقت میں ایک کے لیے دو شانیں نہیں ہوتیں۔\n\nاور ہر وہ ہستی جس کے وجود نے تمہیں دوگنا کیا، اور جو تمہاری مراد میں تمہارے لیے منفعل ہوئی، اور تم اس میں خالق (خلاق) تھے، اور جب وہ تم سے غائب ہو تو تم اس کے مشتاق ہو، اور تم دونوں کو ایک ہی رحمت اور پائیدار محبت نے جمع کیا، اور تم اس کی طرف مائل ہوئے اور وہ تمہاری طرف مائل ہوا، اور اس نے تمہیں اپنے نفس سے اس پر قابو پانے کی اجازت دی، اور اس میں تمہاری قدرت ظاہر ہوئی، تو وہ تمہاری بیوی ہے۔ تم اسے طبعاً محبوب رکھتے ہو، اور اس کے ساتھ متحد ہو جاتے ہو، اور وہ شرعاً تمہاری ملکیت ہوتا ہے۔\n\nاور ہر وہ شے جس سے تم اپنے معاملات میں مدد حاصل کرتے ہو، خواہ وہ اسماء الٰہیہ (الأسماء الإلهیۃ)، ظہور الٰہی (التجلی)، یا کون (الکون) میں سے قدسی ارواح اور پاکیزہ عقول ہوں جو سختیوں میں تمہاری تائید کرتی ہیں اور تمہارے لیے تحفے اور اضافے لاتی ہیں، تو وہ تمہارا قبیلہ ہے۔\n\nاور ہر وہ شے جس کی طرف تم مائل ہوتے ہو اور وہ تمہاری رغبت کی وجہ سے تمہاری طرف مائل ہوتی ہے، اور تمہاری حصولیابی کے دیوان میں حاضر ہوتی ہے، اور تمہارے فعل اور قول پر رکتی ہے، اور اس پر تمہاری فضیلت کا سلطان حکم چلاتا ہے، اور تم اسے حاصل کرنے میں اپنا دن رات سے ملا دیتے ہو، تو وہ تمہارا مال ہے جسے تم نے کمایا ہے، خواہ وہ ظاہری، باطنی، معنوی یا محسوس مال ہو، جیسے کہ ثابت مال جیسے جائیداد، اور غیر ثابت مال جیسے سامان، درہم اور دینار، اور ہر وہ منقولہ شے جسے قرار حاصل نہیں ہوتا۔ پس ثابت مال مقام (المقام) کی طرح ہے اور غیر ثابت مال حال (الحال) کی طرح ہے، اور یہ سب مال ہے کیونکہ یہ مائل ہوتا ہے، اور اس سے کوچ اور جدائی کے بعد اسی کی طرف رجوع ہوتا ہے۔ لیکن جب تمہارا معاملہ اس کی طرف لوٹتا ہے تو تم اسے اس صورت کے علاوہ کسی اور صورت میں دیکھتے ہو جس پر تم نے اسے چھوڑا تھا۔\n\nاور ہر وہ امر جس سے تم نکلنا چاہتے ہو تاکہ وہ خروج تمہارے نزدیک اس سے زیادہ نفیس شے کے حصول کا سبب بنے، پس تم اس کے ذریعے بازاروں میں نفاق (رواج) چاہتے ہو، اور اس میں تمہارے لیے ظاہراً و باطناً ملاپ اور جدائی، نکاح اور طلاق کا جمع ہونا قائم ہوتا ہے، تو وہ تمہاری تجارت ہے جس کے کساد (نقصان) کا تمہیں ڈر ہے اور جس کے فساد کا تمہیں خوف ہے۔ پس تم نے اس کی بنیادوں کو مضبوط کیا، اس کے کانٹوں کو نرم کیا، اس کے لیے اس کا سامان تیار کیا، اور اگر تم سفر کے تاجر ہو تو اس کے لیے زادِ راہ حاصل کیا، تاکہ وہ تمہیں دردناک عذاب سے نجات دے اور تمہیں بڑا نفع اور عظیم حق پورا کرے۔\n\nاور ہر وہ شے جسے تم نے ٹھکانہ بنایا، اور تم اس کے ذریعے مقامی ہوئے، اور تم نے اسے اپنے لیے حرم اور حلال بنایا، تو وہ تمہارا مسکن ہے جسے تم پسند کرتے ہو، اور تمہارا وہ مقام ہے جس کا تم قصد کرتے ہو اور جسے تم تلاش کرتے ہو۔\n\nپس ذات حق (الحق) نے تمہیں اس چیز میں فرمایا جو اس نے تم پر نازل کی اور جسے اس کے امین رسول نے تم پر بھیجا، کہ جب تم ان تمام مذکورہ چیزوں میں ذات حق (الحق) کا چہرہ نہ دیکھو، اور تم نے ان سے ان کی اپنی ذات کی وجہ سے عشق کیا، اور تم جانتے ہو کہ وہ اس کے پاس سے ہیں لیکن وہ عین ذات حق نہیں ہیں، اور تم نے اس حجاب کے باوجود انہیں اس چیز پر ترجیح دی جس کی طرف ذات حق نے تمہیں بلایا تھا، یعنی ان میں زہد اختیار کرنا جب تم ان میں وجہ حق کو کھو دو۔ تو جان لو کہ اللہ نے تم سے صرف یہ چاہا کہ تم اسے ان چیزوں میں پہچانو جن میں اس نے تمہیں زہد اور بے رغبتی کا حکم دیا، اور تم نے ان سے عین ذات اور صورتِ کون (کون) کی محبت کی، اور وہ تمہیں اللہ سے زیادہ محبوب ہو گئیں، جو رغبت اور بے رغبتی دونوں کو جمع کرنے والا ہے، کیونکہ وہ عطا کرنے والا، روکنے والا، نقصان پہنچانے والا اور نفع دینے والا ہے۔ اور وہ تمہیں اس کے رسول سے زیادہ محبوب ہو گئیں جو تم پر وارد ہوا، اور اس نے تمہیں اس چیز کی معرفت کرائی جو مقصود سے حجاب ہے اور عابد و معبود کے درمیان پردہ ہے، باوجود اس علم کے جو اس نے تمہیں دیا کہ اس نے تمہیں صرف اپنی عبادت کے لیے پیدا کیا ہے اور تاکہ تم اسے ہر اس شے پر ترجیح دو جسے تم اس میں دیکھتے ہو اور جس کا تم قصد کرتے ہو۔ اور وہ تمہیں اللہ کی راہ میں تمہارے جہاد سے زیادہ محبوب ہو گئیں، وہ جہاد جو تمہارے لیے دونوں حیاتوں کو جمع کرتا ہے، پس تم موت کا ذائقہ نہیں جانتے اور نہ ہی محصور ہونے کا کوئی حکم۔\n\n\"فَتَرَبَّصُوا\" (تو انتظار کرو) یہ دھمکی اور وعید کا کلمہ ہے، \"حَتَّى يَأْتِيَ الله بِأَمْرِهِ\" (یہاں تک کہ اللہ اپنا حکم لے آئے)، پس تم اس وقت اس کی بھلائی کو اس کی برائی سے، اور اس کی مٹھاس کو اس کی کڑواہٹ سے پہچانو گے، اور اس کے شہد کو اس کے صبر سے چکھو گے۔ پھر اس نے نزول میں، ارسال (رسالت) کی زبان پر، ان حجابات سے اللہ کی طرف بھاگنے کی نصیحت کی، اور ان صحیفوں اور کتابوں میں جو اللہ کی طرف سے آئی ہیں، تدبر کرنے کی نصیحت کی، ساتھ ہی خیموں میں مقصورات (پردہ نشینوں) کے ساتھ خلوت اختیار کرنے کے لیے رسیاں ڈھیلی کرنے کی بھی، اور ان کنواریوں کو کھولنے کی جو تم سے پہلے کسی انسان یا جن نے نہیں چھوئی ہیں۔ پس تم ان عوارف (عطیات) میں سے ایسی معرفتیں (المعارف) حاصل کرو گے جسے کوئی بیان کرنے والا بیان نہیں کر سکتا، اور نہ کوئی کھڑا ہونے والا اس کے پاس ٹھہر سکتا ہے، کیونکہ ہر مقدس مقام سے اعلیٰ اور نفیس چیز کا ورود ہوتا ہے۔\n\nاگرچہ فکر (الفکر) اور ظہور الٰہی (التجلی) دونوں کے ذریعے مدرک (جس کا ادراک کیا جائے) کا احاطہ نہ کرنے میں برابر ہیں، اور اس لحاظ سے وہ دو مثالیں ہیں، لیکن ان دونوں کے درمیان ایک واضح فرق ہے جو پوشیدہ نہیں۔ وہ یہ ہے کہ صاحبِ فکر (الفکر) پر اس کے حاصل میں شک کا حکم لگایا جاتا ہے، اور شبہات اس پر غالب آ جاتے ہیں، اور اسے اس چیز سے متزلزل کر دیتے ہیں جس پر وہ کل بھروسہ کرتا تھا اور جس کی طرف مائل ہوتا تھا۔ جبکہ عارف کے لیے ظہور الٰہی (التجلی) ایسا نہیں ہوتا، بلکہ وہ ایک متجدد نعمت میں ہوتا ہے اور ایک نئی خلق (الخلق) کے شہود (الشہود) میں ہوتا ہے، جس میں اسے کوئی شک نہیں ہوتا۔ اور وہ لذت حاصل کرنے میں آج اور کل کے درمیان جمع کرنے والا ہوتا ہے، پس وہ ایک مشہود صورت الٰہیہ کے لیے موجود لذت میں ہمیشہ رہتا ہے، فنا (الفناء) اسے اپنی تمام لذتوں سے محروم نہیں کرتی، کیونکہ وہ لذتیں اس کے وجود کے لیے پائی گئی تھیں، پس وہ اس کے شہود (الشہود) میں جمع ہو گئیں۔\n\nاور اللہ حق (الحق) فرماتا ہے اور وہی راہ دکھاتا۔ (الاحزاب: ۴)",
    "fa": "باب پانصد و شانزدهم در معرفت حال قطب\n\nمنزل او این بود: بگو: «اگر پدرانتان، و پسرانتان، و برادرانتان، و همسرانتان، و خویشاوندانتان، و اموالی که به دست آورده‌اید، و تجارتی که از کساد آن می‌ترسید، و خانه‌هایی که به آن‌ها دلخوش هستید، نزد شما از خدا و رسولش و جهاد در راه او محبوب‌ترند، پس منتظر باشید تا خداوند فرمان خود را بیاورد.» پس به سوی خدا بگریزید. (اشاره به آیه ۲۴ سوره توبه و آیه ۵۰ سوره ذاریات)\n\nآن خدایی که با کشف (الکشف) درکش می‌کنی،\nآن خدایی نیست که با فکر او را می‌شناسی.\n\nزیرا فکر تو از مرتبه خود فراتر نمی‌رود،\nو شاید باشد، اما آنچه در آن است، در آن است.\n\nحکم با فکر در اشیاء متفاوت است،\nو حکم با کشف (الکشف) را نمی‌دانی که بر چه بنا شده است.\n\nاو (عارف) او را در کشفش (الکشف) در هر معتقدی می‌بیند،\nو هیچ معنایی از معانی او را انکار نمی‌کند.\n\nخداوند والاست، پس هیچ عقلی او را احاطه نمی‌کند،\nو جز او کسی نمی‌داند، پس در آن بنگرید.\n\nخداوند والاست، پس هیچ کشفی (الکشف) او را احاطه نمی‌کند،\nو هیچ چیز از اکوان (هستی‌ها) او را در بر نمی‌گیرد.\n\nو اوست که در تمام هستی (الکون) او را درک می‌کنی،\nو درک نمی‌شود مگر از تجلی‌اش (التجلی).\n\nهرگاه برای بنده‌ای که قصد او کرده است، فرود آید (تدلی)،\nدر آن فرود آمدن، چیزی به او می‌دهد که نمی‌داند.\n\nاز هر خیر و از علم و معرفت (المعرفة)،\nپس کیست که با او برابری کند یا به او نزدیک شود؟\n\n### [حکمت که همان خیر کثیر است]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که منظور از «خیر» در این منظومه، حکمت است که همان خیر کثیر (الخير الكثير) می‌باشد. و «علم» آن چیزی است که از ترکیب درک می‌شود، و «معرفت» (المعرفة) آن چیزی است که در مفردات درک می‌شود. این آیه در روز جمعه پس از نماز در گورستان‌های اشبیلیه در سال پانصد و هشتاد و شش (۵۸۶ق) بر ما وارد شد. پس سه سال پیاپی در آن مست ماندم، نه در نماز، نه در بیداری و نه در خواب، تلاوتی جز آن نداشتم. برای آن شیرینی و لذتی می‌یافتم که قدرش قابل اندازه‌گیری نیست. و این آیه از اذکار جداکننده میان خدا و خلق است، جدایی تمییز؛ پس آن تفریق در جمع و فرقان در قرآن است. بدین ترتیب، با این ذکر، قرآن و فرقان با هم جمع می‌شوند.\n\nپس هر کس که از هر نوع و در هر صورتی، چه ظاهری و چه باطنی، و چه اسم الهی و چه کیانی، بر تو ولادتی (تولدی/منشأیی) داشته باشد، او پدر توست. و هر کس که تو بر او ولادتی داشته باشی، از هر نوع و در هر صورتی، چه ظاهری و چه باطنی، و چه اسم الهی و چه کیانی، او پسر توست. و چه بسا در این ذکر، پسر تو عین پدر تو باشد، پس او بر تو ولادت دارد و تو بر او ولادت داری. و این همان مقامی است که حلاج با این سخن به آن اشاره کرده است:\n\nمادرم پدرش را زایید،\nاین از شگفتی‌های من است.\n\nو هر آنچه از امثال با تو روبرو شود، و از اشباه در تو داخل گردد، و از انداد با تو آمیخته یا نزدیک شود، و در وراثت برای تو همتا باشد، به طوری که اگر در علم موروث از کتاب وزن شوید، نه او بر تو وزنی فزونی یابد و نه تو بر او، پس او برادر توست. اما این برادری از جهت اسم ظاهر است، پس پدر شما ظاهراً یکی است و نه غیر آن. و اسم باطن در اینجا حکمی ندارد، زیرا باطن مانع از آن است که شما دو برادر از یک پدر و یک مادر باشید. چرا که یک مزاج واحد، دو نفر را در هستی (الکون) جمع نمی‌کند، و از یک تجلی (التجلی) دو چیز پدید نمی‌آید. زیرا امر گسترده‌تر از این است؛ پس هر کس یک مادر و یک پدر دارد. طبیعت دوقلو نمی‌زاید و والد در هر نکاحی دو آب نمی‌افکند، همان‌طور که در عالم برای یک نفر در یک زمان واحد دو شأن وجود ندارد.\n\nو هر کس که وجودش تو را دوتا کند، و در آنچه اراده می‌کنی برای تو منفعل شود، و تو در او خالق باشی، و هنگامی که از تو غایب شود مشتاق او باشی، و رحمت واحد و مودت ثابت شما را جمع کند، و تو به او آرامش یابی و او به تو آرامش یابد، و از جانب خود به تو اجازه تسلط بر او دهد و اقتدار تو در او ظاهر شود، پس او همسر توست. او را طبعاً دوست می‌داری و با او متحد می‌شوی و شرعاً ملک تو خواهد بود.\n\nو هر آنچه در امور خود به آن تکیه می‌کنی، از اسماء الهی و تجلی (التجلی) و هستی (الکون)، از ارواح قدسی و عقول پاکیزه که تو را در سختی‌ها تأیید می‌کنند و تحفه‌ها و افزونی‌ها برایت می‌آورند، پس او عشیره (قبیله) توست.\n\nو هر کس که تو به او متمایل شوی و او نیز به خاطر تمایل تو به تو متمایل شود، و دیوان نیل تو در نزد او حاضر باشد، و در برابر فعل و قول تو در او بایستد، و سلطان قدرت تو بر او حاکم باشد، و در به دست آوردن آن شب و روزت را به هم وصل کنی، پس آن مال توست که به دست آورده‌ای؛ از اموال ظاهری و باطنی، معنوی و محسوس، از ثابت مانند ملک و از غیر ثابت مانند کالاها و درهم و دینار و هر منقولی که قرار نمی‌گیرد. پس ثابت مانند مقام است و غیر ثابت مانند حال. و همه این‌ها مال است، زیرا متمایل می‌شود (مال) و پس از کوچ و جدایی از آن، بازگشت به سوی اوست. اما هنگامی که امر تو به او بازگردد، او را در صورتی غیر از صورتی که از آن جدا شدی، خواهی دید.\n\nو هر امری که می‌خواهی از آن خارج شوی تا آن خروج، سبب تحصیل چیزی شود که نزد تو نفیس‌تر از آن است، و با آن در بازارها خواهان رواج باشی، و در آن برای تو جمع میان ملاقات و فراق، و نکاح و طلاق، ظاهراً و باطناً، برقرار شود، پس آن تجارتی است که از کساد آن می‌ترسی و از فساد آن بیم داری. پس بستر آن را نرم ساختی و خار آن را زیر پا نهادی، و آمادگی لازم را برای آن فراهم کردی، و اگر تاجر سفر هستی، توشه آن را به دست آوردی تا تو را از عذابی دردناک نجات دهد و سود و حق عظیم را به طور کامل به تو برساند.\n\nو هر آنچه را که محل قرار دادی و تو در آن محل بودی، و آن را برای خود حرم و حِل قرار دادی، پس آن مسکن توست که به آن راضی هستی و منزل توست که قصد آن می‌کنی و در پی آن هستی.\n\nپس حق (الحق) در آنچه بر تو نازل کرد و رسول امینش با آن بر تو وارد شد، به تو فرمود: اگر وجه حق (الحق) را در تمام آنچه ذکر شد نبینی، و به خاطر عین آن عاشقش شوی، و بدانی که آن از جانب اوست اما عین او نیست، و با وجود این حجاب، آن را بر آنچه حق تو را به آن فراخوانده است (یعنی زهد در آن) ترجیح دهی، در حالی که وجه حق را در آن از دست داده‌ای، پس بدان که خداوند از تو نخواسته است مگر اینکه او را در آنچه به تو امر کرده که در آن زهد ورزی و از آن روی گردانی، بشناسی. و اگر آن را با حب عین و صورت هستی (الکون) دوست داشته باشی و آن نزد تو محبوب‌تر از خداوندی باشد که جامع رغبت در او و رغبت از اوست، زیرا او بخشنده و بازدارنده، و زیان‌رسان و سودبخش است؛ و محبوب‌تر از رسول او باشد که بر تو وارد شده و تو را به آنچه حجاب از مقصود و پرده میان عابد و معبود است، آگاه می‌سازد، با وجود آنکه می‌دانی او تو را نیافریده مگر برای اینکه او را عبادت کنی و او را بر آنچه در آن می‌بینی و قصد می‌کنی، ترجیح دهی؛ و محبوب‌تر از جهاد تو در راه خدا باشد که دو حیات را برای تو جمع می‌کند، به طوری که طعم مرگ را نمی‌شناسی و برای حصر (محدودیت) حکمی قائل نیستی؛ پس «فَتَرَبَّصُوا» (منتظر باشید) کلمه تهدید و وعید است «حَتَّى يَأْتِيَ الله بِأَمْرِهِ» (تا خداوند فرمان خود را بیاورد). در آن هنگام خیرش را از شرش و شیرینش را از تلخش خواهی شناخت و شهدش را از صبرش خواهی چشید.\n\nسپس در این انزال، بر زبان ارسال، به فرار به سوی خدا از این حجاب‌ها و تدبر در آنچه صحیفه‌ها و کتاب‌ها از جانب خدا آورده‌اند، نصیحت شده است؛ همراه با رها کردن طناب‌ها تا با مقصورات (زنان پرده‌نشین) در خیمه‌ها خلوت کنی و دوشیزگانی را بگشایی که پیش از تو نه انسی و نه جنی به آن‌ها دست نزده است. پس از آن معارف در آن عوارف (عطایا) به دست آوری که هیچ وصف‌کننده‌ای آن را وصف نکند و هیچ ایستاده‌ای نتواند نزد آن توقف کند، به دلیل ورود آنچه بالاتر و نفیس‌تر از هر محل مقدسی است. و اگرچه فکر و تجلی (التجلی) در عدم احاطه به مدرَک، با یکدیگر برابرند و از این جهت دو مَثَل هستند، اما میان آن‌ها دو فرقان آشکار است که پنهانی ندارد: صاحب فکر در محصول خود حکم به دخالت می‌دهد و شبهات بر او مسلط می‌شوند و او را از آنچه دیروز بر آن اعتماد می‌کرد و به آن تکیه می‌نمود، متزلزل می‌سازند. اما تجلی (التجلی) برای عارف این‌گونه نیست، بلکه او در نعمتی نو شونده و در شهود (الشهود) خلقی جدید است که هیچ ابهامی در آن ندارد. و او در التذاذ، جمع‌کننده میان امروز و دیروز است. پس پیوسته در لذتی موجود برای صورتی الهی مشهود است که فنا (الفناء) او را از تمام لذاتش باز نمی‌دارد، زیرا آن لذات به خاطر وجود او یافت شده‌اند، پس در شهود (الشهود) او با هم جمع شدند. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 2
}