{
  "id": 10,
  "title": {
    "ar": "الباب العاشر في معرفة دورة الملك‏",
    "en": "The Tenth Chapter: Concerning the Knowledge of the Cycle of Dominion.",
    "ur": "دسواں باب: دورۂ ملک (دورة الملك) کی معرفت میں",
    "fa": "باب دهم در معرفت دور پادشاهی (دورة الملك)"
  },
  "content": {
    "ar": "## «الباب العاشر» في معرفة دورة الملك‏\n\n\nوأول منفصل فيها عن أول موجود وآخر منفصل فيها عن آخر منفصل عنه وبما ذا عمر الموضع المنفصل عنه منهما وتمهيد الله هذه المملكة حتى جاء مليكها وما مرتبة العالم الذي بين عيسى ومحمد عليهما السلام وهو زمان الفترة\n\n\n> الملك لو لا وجود الملك ما عرفا *** ولم تكن صفة مما به وصفا\n\n\n> فدورة الملك برهان عليه لذا *** قد التقت طرفاها هكذا كشفا\n\n\n> فكان آخرها كمثل أولها *** وكان أولها عن سابق سلفا\n\n\n> وعند ما كملت بالختم قام بها *** مليكها سيد الله معترفا\n\n\n> أعطاه خالقه فضلا معارفها *** وما يكون وما قد كان وانصرفا\n\n\n### [الأنبياء نواب محمد]\n\n\nاعلم أيدك الله أنه‏\n\n\nورد في الخبر أن النبي صلى الله عليه وسلم قال أنا سيد ولد آدم ولا فخر\n\n\nبالراء وفي رواية بالزاي وهو التبجح بالباطل وفي صحيح مسلم أنا سيد الناس يوم القيامة\n\n\nفثبتت له السيادة والشرف على أبناء جنسه من البشر وقال عليه السلام كنت نبيا وآدم بين الماء والطين‏\n\n\nيريد على علم بذلك فأخبره الله تعالى بمرتبته وهو روح قبل إيجاده الأجسام‏\nالإنسانية كما أخذ الميثاق على بنى آدم قبل إيجاده أجسامهم وألحقنا الله تعالى بأنبيائه بأن جعلنا شهداء على أممهم معهم حين يبعث من كل أمة شَهِيداً عَلَيْهِمْ من أَنْفُسِهِمْ وهم الرسل فكانت الأنبياء في العالم نوابه صلى الله عليه وسلم من آدم إلى آخر الرسل عليهم السلام وقد أبان صلى الله عليه وسلم عن هذا المقام بأمور منها\n\n\nقوله صلى الله عليه وسلم والله لو كان موسى حيا ما وسعه إلا أن يتبعني‏\n\n\nوقوله في نزول عيسى بن مريم في آخر الزمان إنه يؤمنا\n\n\nأي يحكم فينا بسنة نبينا عليه السلام ويكسر الصليب ويقتل الخنزير ولو كان محمد صلى الله عليه وسلم قد بعث في زمان آدم لكانت الأنبياء وجميع الناس تحت حكم شريعته إلى يوم القيامة حسا ولهذا لم ببعث عامة إلا هو خاصة فهو الملك والسيد وكل رسول سواه فبعث إلى قوم مخصوصين فلم تعم رسالة أحد من الرسل سوى رسالته صلى الله عليه وسلم فمن زمان آدم عليه السلام إلى زمان بعث محمد صلى الله عليه وسلم إلى يوم القيامة ملكه وتقدمه في الآخرة على جميع الرسل وسيادته فمنصوص على ذلك في الصحيح عنه‏\n\n\n### [روحانية محمد مع كل نبي ورسول‏]\n\n\nفروحانيته صلى الله عليه وسلم موجودة وروحانية كل نبي ورسول فكان الإمداد يأتي إليهم من تلك الروح الطاهرة بما يظهرون به من الشرائع والعلوم في زمان وجودهم رسلا وتشريعه الشرائع كعلي ومعاذ وغيرهما في زمان وجودهم ووجوده صلى الله عليه وسلم وكإلياس وخضر عليهما السلام وعيسى عليه السلام في زمان ظهوره في آخر الزمان حاكما بشرع محمد صلى الله عليه وسلم في أمته المقرر في الظاهر لكن لما لم يتقدم في عالم الحس وجود عينه صلى الله عليه وسلم أولا نسب كل شرع إلى من بعث به وهو في الحقيقة شرع محمد صلى الله عليه وسلم وإن كان مفقود العين من حيث لا يعلم ذلك كما هو مفقود العين الآن وفي زمان نزول عيسى عليه السلام والحكم بشرعه‏\n\n\n### [شرع محمد ناسخ لجميع الشرائع‏]\n\n\nوأما نسخ الله بشرعه جميع الشرائع فلا يخرج هذا النسخ ما تقدم من الشرائع أن يكون من شرعه فإن الله قد أشهدنا في شرعه الظاهر المنزل به صلى الله عليه وسلم في القرآن والسنة النسخ مع إجماعنا واتفاقنا على إن ذلك المنسوخ شرعه الذي بعث به إلينا فنسخ بالمتأخر المتقدم فكان تنبيها لنا هذا النسخ الموجود في القرآن والسنة على إن نسخه لجميع الشرائع المتقدمة لا يخرجها عن كونها شرعا له وكان نزول عيسى عليه السلام في آخر الزمان حاكما بغير شرعه أو بعضه الذي كان عليه في زمان رسالته وحكمه بالشرع المحمدي المقرر اليوم دليلا على أنه لا حكم لأحد اليوم من الأنبياء عليهم السلام مع وجود ما قرره صلى الله عليه وسلم في شرعه ويدخل في ذلك ما هم عليه أهل الذمة من أهل الكتاب ما داموا يعطون الْجِزْيَةَ عَنْ يَدٍ وهُمْ صاغِرُونَ فإن حكم الشرع على الأحوال‏\n\n\n### [سيادة محمد على جميع بني آدم‏]\n\n\nفخرج من هذا المجموع كله أنه ملك وسيد على جميع بنى آدم وأن جميع من تقدمه كان ملكا له وتبعا والحاكمون فيه نواب عنه فإن قيل‏\n\n\nفقوله صلى الله عليه وسلم لا تفضلوني‏\n\n\nفالجواب نحن ما فضلناه بل الله فضله فإن ذلك ليس لنا وإن كان قد ورد أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ لما ذكر الأنبياء عليهم السلام فهو صحيح فإنه قال فَبِهُداهُمُ وهداهم من الله وهو شرعه صلى الله عليه وسلم أي ألزم شرعك الذي ظهر به نوابك من إقامة الدين ولا تَتَفَرَّقُوا فِيهِ فلم يقل فبهم اقتده وفي قوله ولا تَتَفَرَّقُوا فِيهِ تنبيه على أحدية الشرائع وقوله اتَّبِعْ مِلَّةَ إِبْراهِيمَ وهو الدين فهو مأمور باتباع الدين فإن الدين إنما هو من الله لا من غيره وانظروا في‏\n\n\nقوله عليه السلام لو كان موسى حيا ما وسعه إلا أن يتبعني‏\n\n\nفأضاف الاتباع إليه وأمر هو صلى الله عليه وسلم باتباع الدين وهدى الأنبياء لا بهم فإن الإمام الأعظم إذا حضر لا يبقى لنائب من نوابه حكم الإله فإذا غاب حكم النواب بمراسمه فهو الحاكم غيبا وشهادة وما أوردنا هذه الأخبار والتنبيهات إلا تأنيسا لمن لا يعرف هذه المرتبة من كشفه ولا أطلعه الله على ذلك من نفسه‏\n\n\n### [شواهد أهل الله‏]\n\n\nوأما أهل الله فهم على ما نحن عليه فيه قد قامت لهم شواهد التحقيق على ذلك من عند ربهم في نفوسهم وإن كان يتصور على جميع ما أوردناه في ذلك احتمالات كثيرة فذلك راجع إلى ما تعطيه الألفاظ من القوة في أصل وضعها لا ما هو عليه الأمر في نفسه عند أهل الأذواق الذين يأخذون العلم عن الله كالخضر وأمثاله فإن الإنسان ينطق بالكلام يريد به معنى واحدا مثلا من المعاني التي يتضمنها ذلك الكلام فإذا فسر بغير مقصود المتكلم من تلك المعاني فإنما فسر المفسر بعض ما تعطيه قوة اللفظ وإن كان لم يصب مقصود المتكلم أ لا ترى الصحابة كيف شق عليهم قوله تعالى الَّذِينَ آمَنُوا ولَمْ يَلْبِسُوا إِيمانَهُمْ بِظُلْمٍ فأتى به نكرة فقالوا وأينا لم يلبس إيمانه بظلم فهؤلاء الصحابة وهم العرب الذين نزل القرآن بلسانهم ما عرفوا\nمقصود الحق من الآية والذي نظروه سائغ في الكلمة غير منكور\n\n\nفقال لهم النبي صلى الله عليه وسلم ليس الأمر كما ظننتم وإنما أراد الله بالظلم هنا ما قالَ لُقْمانُ لِابْنِهِ وهُوَ يَعِظُهُ يا بُنَيَّ لا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ‏\n\n\nفقوة الكلمة تعم كل ظلم وقصد المتكلم إنما هو ظلم معين مخصوص فكذلك ما أوردناه من الأخبار في أن بنى آدم سوقة وملك لهذا السيد محمد صلى الله عليه وسلم هو المقصود من طريق الكشف كما كان الظلم هناك المقصود من المتكلم به الشرك خاصة ولذلك تتقوى التفاسير في الكلام بقرائن الأحوال فإنها المميزة للمعاني المقصودة للمتكلم فكيف من عنده الكشف الإلهي والعلم اللدني الرباني فينبغي للعاقل المنصف أن يسلم لهؤلاء القوم ما يخبرون به فإن صدقوا في ذلك فذلك الظن بهم وأنصفوا بالتسليم حيث لم يرد المسلم ما هو حق في نفس الأمر وإن لم يصدقوا لم يضر المسلم بل انتفعوا حيث تركوا الخوض فيما ليس لهم به قطع وردوا علم ذلك إلى الله تعالى فوفوا الربوبية حقها إذ كان ما قاله أولياء الله ممكنا فالتسليم أولى بكل وجه‏\n\n\n### [دورة الملك‏]\n\n\nوهذا الذي نزعنا إليه من دورة الملك قال به غيرنا كالإمام أبي القاسم بن قسي في خلعه وهو روايتنا عن ابنه عنه وهو من سادات القوم وكان شيخه الذي كشف له على يديه من أكبر شيوخ المغرب يقال له ابن خليل من أهل لبلة فنحن ما نعتمد في كل ما نذكره إلا على ما يلقي الله عندنا من ذلك لا على ما تحتمله الألفاظ من الوجوه وقد تكون جميع المحتملات في بعض الكلام مقصودة للمتكلم فنقول بها كلها فدورة الملك عبارة عما مهد الله من آدم إلى زمان محمد صلى الله عليه وسلم من الترتيبات في هذه النشأة الإنسانية بما ظهر من الأحكام الإلهية فيها فكانوا خلفاء الخليفة السيد فأول موجود ظهر من الأجسام الإنسانية كان آدم عليه السلام وهو الأب الأول من هذا الجنس وسائر الآباء من الأجناس يأتي بعد هذا الباب إن شاء الله وهو أول من ظهر بحكم الله من هذا الجنس ولكن كما قررناه ثم فصل عنه أبا ثانيا لنا سماه أما فصح لهذا الأب الأول الدرجة عليها لكونه أصلا لها فختم النواب من دورة الملك بمثل ما به بدأ لينبه على إن الفضل بيد الله وأن ذلك الأمر ما اقتضاه الأب الأول لذاته فأوجد عيسى عن مريم فتنزلت مريم منزلة آدم وتنزل عيسى منزلة حواء فكما وجدت أنثى من ذكر وجد ذكر من أنثى فختم بمثل ما به بدأ في إيجاد ابن من غير أب كما كانت حواء من غير أم فكان عيسى وحواء إخوان وكان آدم ومريم أبوان لهما\n\n\n### [مثل عيسى عند الله كمثل آدم‏]\n\n\nإِنَّ مَثَلَ عِيسى‏ عِنْدَ الله كَمَثَلِ آدَمَ فأوقع التشبيه في عدم الأبوة الذكرانية من أجل أنه نصبه دليلا لعيسى في براءة أمه ولم يوقع التشبيه بحواء وإن كان الأمر عليه لكون المرأة محل التهمة لوجود الحمل إذ كانت محلا موضوعا للولادة وليس الرجل بمحل لذلك والمقصود من الأدلة ارتفاع الشكوك وفي حواء من آدم لا يقع الالتباس لكون آدم ليس محلا لما صدر عنه من الولادة وهذا لا يكون دليلا إلا عند من ثبت عنده وجود آدم وتكوينه والتكوين منه وكما لا يعهد ابن من غير أب كذلك لا يعهد من غير أم فالمثل من طريق المعنى أن عيسى كحواء ولكن لما كان الدخل بتطرق في ذلك من المنكر لكون الأنثى كما قلنا محلا لما صدر عنها ولذلك كانت التهمة كان التشبيه بآدم لحصول براءة مريم مما يمكن في العادة فظهور عيسى بن مريم من غير أب كظهور حواء من آدم من غير أم وهو الأب الثاني‏\n\n\n### [انفصال حواء من آدم‏]\n\n\nولما انفصلت حواء من آدم عمر موضعها منه بالشهوة النكاحية إليها التي وقع بها الغشيان لظهور التناسل والتوالد وكان الهواء الخارج الذي عمر موضعه جسم حواء عند خروجها إذ لا خلاء في العالم فطلب ذلك الجزء الهوائي موضعه الذي أخذته حواء بشخصيتها فحرك آدم لطلب موضعه فوجده معمورا بحواء فوقع عليها فلما تغشاها حملت منه فجاءت بالذرية فبقي ذلك سنة جارية في الحيوان من بنى آدم وغيره بالطبع لكن الإنسان هو الكلمة الجامعة ونسخة العالم فكل ما في العالم جزء منه وليس الإنسان بجزء لواحد من العالم وكان سبب هذا الفصل وإيجاد هذا المنفصل الأول طلب الأنس بالمشاكل في الجنس الذي هو النوع الأخص وليكون في عالم الأجسام بهذا الالتحام الطبيعي الإنساني الكامل بالصورة الذي أراده الله ما يشبه القلم الأعلى واللوح المحفوظ الذي يعبر عنه بالعقل الأول والنفس الكل وإذا قلت القلم الأعلى فتفطن للاشارة التي تتضمن الكاتب وقصد الكتابة فيقوم معك معنى‏\n\n\nقول الشارع إن الله خلق آدم على صورته‏\n\n\n### [كن والكون‏]\n\n\nثم عبارة الشارع في الكتاب العزيز في إيجاد الأشياء عن كُنْ فأتى بحرفين اللذين هما بمنزلة المقدمتين وما يكون عند كن بالنتيجة وهذان الحرفان هما الظاهران والثالث الذي هو\nالرابط بين المقدمتين خفي في كن وهو الواو المحذوف لالتقاء الساكنين كذلك إذا التقى الرجل والمرأة لم يبق للقلم عين ظاهرة فكان القاؤه النطفة في الرحم غيبا لأنه سر ولهذا عبر عن النكاح بالسر في اللسان قال تعالى ولكِنْ لا تُواعِدُوهُنَّ سِرًّا وكذلك عند الإلقاء يسكنان عن الحركة ويمكن إخفاء القلم كما خفي الحرف الثالث الذي هو الواو من كن للساكنين وكان الواو لأن له العلو لأنه متولد عن الرفع وهو إشباع الضمة وهو من حروف العلة\n\n\n### [أول منفصل وآخر منفصل في دورة الملك‏]\n\n\nوهذا الذي ذكرناه إنما هو إذا كان الملك عبارة عن الأناسي خاصة فإن نظرنا إلى سيادته على جميع ما سوى الحق كما ذهب إليه بعض الناس‏\n\n\nللحديث المروي إن الله يقول لولاك يا محمد ما خلقت سماء ولا أرضا ولا جنة ولا نارا\n\n\nوذكر خلق كل ما سوى الله فيكون أول منفصل فيها النفس الكلية عن أول موجود وهو العقل الأول وآخر منفصل فيها حواء عن آخر موجود آدم فإن الإنسان آخر موجود من أجناس العالم فإنه ما ثم إلا ستة أجناس وكل جنس تحته أنواع وتحت الأنواع أنواع فالجنس الأول الملك والثاني الجان والثالث المعدن والرابع النبات والخامس الحيوان وانتهى الملك وتمهد واستوى وكان الجنس السادس جنس الإنسان وهو الخليفة على هذه المملكة وإنما وجد آخرا ليكون إماما بالفعل حقيقة لا بالصلاحية والقوة فعند ما وجد عينه لم يوجد إلا واليا سلطانا ملحوظا ثم جعل له نوابا حين تأخرت نشأة جسده فأول نائب كان له وخليفة آدم عليه السلام ثم ولد واتصل النسل وعين في كل زمان خلفاء إلى أن وصل زمان نشأة الجسم الطاهر محمد صلى الله عليه وسلم فظهر مثل الشمس الباهرة فاندرج كل نور في نوره الساطع وغاب كل حكم في حكمه وانقادت جميع الشرائع إليه وظهرت سيادته التي كانت باطنة ف هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ وهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ فإنه‏\n\n\nقال أوتيت جوامع الكلم‏\n\n\nوقال عن ربه ضرب بيده بين كتفي فوجدت برد أنامله بين ثديي فعلمت علم الأولين والآخرين‏\n\n\nفحصل له التخلق والنسب الإلهي من قوله تعالى عن نفسه هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ وهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ وجاءت هذه الآية في سورة الحديد الذي فِيهِ بَأْسٌ شَدِيدٌ ومَنافِعُ لِلنَّاسِ فلذلك بعث بالسيف وأرسل رَحْمَةً لِلْعالَمِينَ وكل منفصل عن شي‏ء فقد كان عامرا لما عنه انفصل وقد قلنا إنه لا خلاء في العالم فعمر موضع انفصاله بظله إذ كان انفصاله إلى النور وهو للظهور فلما قابل النور بذاته امتد ظله فعمر موضع انفصاله فلم يفقده من انفصل عنه فكان مشهودا لمن انفصل إليه ومشهودا لمن انفصل عنه وهو المعنى الذي أراده القائل بقوله‏\n\n\n(شهدتك موجودا بكل مكان)\n\n\nفمن أسرار العالم أنه ما من شي‏ء يحدث إلا وله ظل يسجد لله ليقوم بعبادة ربه على كل حال سواء كان ذلك الأمر الحادث مطيعا أو عاصيا فإن كان من أهل الموافقة كان هو وظله على السواء وإن كان مخالفا ناب ظله منابه في الطاعة لله قال الله تعالى وظِلالُهُمْ بِالْغُدُوِّ والْآصالِ‏\n\n\n### [السلطان ظل الله في الأرض‏]\n\n\nالسلطان ظل الله في الأرض إذ كان ظهوره بجميع صور الأسماء الإلهية التي لها الأثر في عالم الدنيا والعرش ظل الله في الآخرة فالضلالات أبدا تابعة للصورة المنبعثة عنها حسا ومعنى فالحس قاصر لا يقوي قوة الظل المعنوي للصورة المعنوية لأنه يستدعي نورا مقيدا لما في الحس من التقييد والضيق وعدم الاتساع ولهذا نبهنا على الظل المعنوي بما جاء في الشرع من أن السلطان ظل الله في الأرض فقد بان لك أن بالظلالات عمرت الأماكن فهنا قد ذكرنا طرفا مما يليق بهذا الباب ولم نمعن فيه مخافة التطويل وفيما أوردناه كفاية لمن تنبه إن كان ذا فهم سليم وتذكرة لمن شاهد وعلم واشتغل بما هو أعلى أو غفل بما هو أنزل فيرجع إلى ما ذكرناه عند ما ينظر في هذا الباب‏\n\n\n### (فصل) [مراتب أهل الفترة]\n\n\nوأما مرتبة العالم الذي بين عيسى عليه السلام ومحمد صلى الله عليه وسلم وهم أهل الفترة فهم على مراتب مختلفة بحسب ما يتجلى لهم من الأسماء عن علم منهم بذلك وعن غير علم فمنهم من وحد الله بما تجلى لقلبه عند فكره وهو صاحب الدليل فَهُوَ عَلى‏ نُورٍ من رَبِّهِ ممتزج بكون من أجل فكره فهذا يبعث أمة وحده كقُسِّ بن ساعدة وأمثاله فإنه ذكر في خطبته ما يدل على ذلك فإنه ذكر المخلوقات واعتباره فيها وهذا هو الفكر ومنهم من وحد الله بنور وجده في قلبه لا يقدر على دفعه من غير فكرة ولا روية ولا نظر ولا استدلال فهم على نور من ربهم خالص غير ممتزج بكون فهؤلاء يحشرون أخفياء أبرياء ومنهم من ألقى في نفسه وأطلع من كشفه لشدة نوره وصفاء سره لخلوص يقينه على منزلة محمد\nصلى الله عليه وسلم وسيادته وعموم رسالته باطنا من زمان آدم إلى وقت هذا المكاشف فآمن به في عالم الغيب على شهادة منه وبينة من ربه وهو قوله تعالى أَ فَمَنْ كانَ عَلى‏ بَيِّنَةٍ من رَبِّهِ ويَتْلُوهُ شاهِدٌ مِنْهُ يشهد له في قلبه بصدق ما كوشف به فهذا يحشر يوم القيامة في ضنائن خلقه وفي باطنية محمد صلى الله عليه وسلم ومنهم من تبع ملة حق ممن تقدمه كمن تهود أو تنصر أو اتبع ملة إبراهيم أو من كان من الأنبياء لما علم واعلم أنهم رسل من عند الله يدعون إلى الحق لطائفة مخصوصة فتبعهم وآمن بهم وسلك سننهم فحرم على نفسه ما حرمه ذلك الرسول وتعبد نفسه مع الله بشريعته وإن كان ذلك ليس بواجب عليه إذ لم يكن ذلك الرسول مبعوثا إليه فهذا يحشر مع من تبعه يوم القيامة ويتميز في زمرته في ظاهريته إذ كان شرع ذلك النبي قد تقرر في الظاهر ومنهم من طالع في كتب الأنبياء شرف محمد صلى الله عليه وسلم ودينه وتواب من اتبعه فآمن به وصدق على علم وإن لم يدخل في شرع نبي ممن تقدم وأتى مكارم الأخلاق فهذا أيضا يحشر في المؤمنين بمحمد صلى الله عليه وسلم فآمن به فله أجران وهؤلاء كلهم سعداء عند الله ومنهم من عطل فلم يقر بوجود عن نظر قاصر ذلك القصور هو بالنظر إليه غاية قوته لضعف في مزاجه عن قوة غيره ومنهم من عطل لا عن نظر بل عن تقليد فذلك شقي مطلق ومنهم من أشرك عن نظر أخطأ فيه طريق الحق مع بذل المجهود الذي تعطيه قوته ومنهم من أشرك لا عن استقصاء نظر فذلك شقي ومنهم من أشرك عن تقليد فذلك شقي ومنهم من عطل بعد ما أثبت عن نظر بلغ فيه أقصى القوة التي هو عليها لضعفها ومنهم من عطل بعد ما أثبت لا عن استقصاء في النظر أو تقليد فذلك شقي فهذه كلها مراتب أهل الفترة الذين ذكرناهم في هذا الباب‏\n\n",
    "en": "Chapter Ten: Concerning the Knowledge of the Cycle of Sovereignty (دورة الملك)\n\n[This chapter discusses] the first separation (منفصل) within it [the Cycle] from the first existent (موجود), and the last separation within it from the last thing separated from it, and by what means the place of separation was filled in both cases, and how God prepared this Dominion (المملكة) until its Sovereign (مليكها) arrived, and what is the rank of the people who lived between Jesus and Muhammad (peace be upon them), which is the time of the Interval (الفترة).\n\n> Sovereignty (الملك), were it not for the existence of the Sovereign (الملك), would not be known,\n> Nor would it be an Attribute (صفة) among those by which He is described.\n> Thus, the Cycle of Sovereignty (دورة الملك) is a proof of Him,\n> For this reason, its two ends meet, as revealed (كشفا).\n> So its end was like its beginning,\n> And its beginning was preceded by what came before.\n> And when it was completed by the Seal (الختم), its Sovereign (مليكها) arose in it,\n> The Master (سيد) acknowledging God.\n> His Creator granted him, by grace, its gnoses (معارفها),\n> And what shall be, and what has been, and what has passed away.\n\n### [The Prophets are the Deputies of Muhammad]\n\nKnow, may God strengthen you, that it is reported in the tradition (الخبر) that the Prophet (peace and blessings be upon him) said: \"I am the Master (سيد) of the children of Adam, and I say this without pride (لا فخر).\"\n\nIn one narration, the word is *fakhara* (pride), and in another, it is *zajr* (which means boasting of falsehood). In *Sahih Muslim*, [he said]: \"I am the Master of mankind on the Day of Resurrection.\"\n\nThus, mastery (السيادة) and honor (الشرف) were established for him over the children of his human species. He also said (peace be upon him): \"I was a Prophet while Adam was between water and clay.\"\n\nHe meant that he knew this by Divine Knowledge (علم بذلك), for God Most High informed him of his rank while he was a spirit (روح) before the creation of human bodies, just as God took the covenant (الميثاق) from the children of Adam before the creation of their bodies. God Most High has joined us to His Prophets by making us witnesses over their nations alongside them when He raises from every nation <<شَهِيداً عَلَيْهِمْ مِنْ أَنْفُسِهِمْ>> (a witness against them from among themselves), and these are the Messengers (الرسل). Therefore, the Prophets in the world were his deputies (نوابه) (peace and blessings be upon him), from Adam to the last of the Messengers (peace be upon them).\n\nThe Prophet (peace and blessings be upon him) made this rank clear through several matters, including:\n\nHis saying (peace and blessings be upon him): \"By God, if Moses were alive, he would have no choice but to follow me.\"\n\nAnd his saying regarding the descent of Jesus son of Mary (peace be upon him) at the end of time, that he will lead us in prayer (يؤمنا), meaning he will rule among us according to the Sunnah of our Prophet (peace be upon him), break the cross, and kill the swine.\n\nIf Muhammad (peace and blessings be upon him) had been sent during the time of Adam, the Prophets and all people would have been under the rule of his Divine Law (شريعته) until the Day of Resurrection, perceptually. This is why he alone was sent universally (عامة), while all other Messengers were sent specifically (خاصة) to particular peoples. The mission of no Messenger was universal except his (peace and blessings be upon him).\n\nThus, from the time of Adam (peace be upon him) until the time of the sending of Muhammad (peace and blessings be upon him) until the Day of Resurrection is his Dominion (ملكه), and his precedence in the Hereafter over all Messengers and his mastery (سيادته) are explicitly stated in the authentic traditions concerning him.\n\n### [The Spiritual Reality of Muhammad with Every Prophet and Messenger]\n\nHis spiritual reality (روحانيته) (peace and blessings be upon him) is existent, as is the spiritual reality of every Prophet and Messenger. Sustenance (الإمداد) came to them from that pure spirit (الروح الطاهرة) with which they manifested the Divine Laws (الشرائع) and sciences (العلوم) during the time of their existence as Messengers, and with which they legislated laws, such as Ali and Mu'adh and others during the time of their existence and his existence (peace and blessings be upon him), and such as Elias, Khidr, and Jesus (peace be upon them), during the time of his appearance at the end of time, ruling by the Law of Muhammad (شرع محمد صلى الله عليه وسلم) established outwardly for his community.\n\nHowever, because the existence of his physical entity (عين) (peace and blessings be upon him) did not precede them in the sensory world (عالم الحس), every law was attributed to the one who was sent with it, though in reality, it was the Law of Muhammad (شرع محمد صلى الله عليه وسلم), even if his physical entity was absent (مفقود العين) in a way that they did not know. This is just as his physical entity is absent now, and during the time of Jesus’ descent and his ruling by his Law.\n\n### [The Law of Muhammad Abrogates All Laws]\n\nAs for God’s abrogation of all previous Divine Laws (الشرائع) by means of his Law, this abrogation does not remove the preceding laws from being part of his Law. God has shown us in His manifest Law (شرعه الظاهر) revealed to him (peace and blessings be upon him) in the Quran and the Sunnah, the occurrence of abrogation (النسخ), along with our consensus and agreement that the abrogated law was His Law sent down to us. Thus, the later abrogated the earlier.\n\nThis abrogation found in the Quran and Sunnah serves as an alert to us that his abrogation of all preceding laws does not exclude them from being his Law. The descent of Jesus (peace be upon him) at the end of time, ruling by the Muhammadan Law (الشرع المحمدي) established today, and not by his own Law or any part of it that he followed during his time of messengership, is proof that no Prophet (peace be upon them) has authority to rule today, given the existence of what the Prophet (peace and blessings be upon him) established in his Law. This includes the status of the People of the Book (أهل الكتاب) who are the People of the Covenant (أهل الذمة), as long as they pay <<الْجِزْيَةَ عَنْ يَدٍ وَهُمْ صَاغِرُونَ>> (the tribute readily, being humbled), for the ruling of the Law applies to all circumstances.\n\n### [The Sovereignty of Muhammad over All Children of Adam]\n\nIt is concluded from all this that he is the Sovereign (ملك) and Master (سيد) over all children of Adam, and that all who preceded him were his dominion (ملكا له) and followers (تبعا), and the rulers among them were his deputies (نواب عنه).\n\nIf it is said: What about his saying (peace and blessings be upon him): \"Do not prefer me (لا تفضلوني)\"?\n\nThe answer is: We did not prefer him; rather, God preferred him, for that is not within our power. Although it is reported, when mentioning the Prophets (peace be upon them): <<أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ>> (Those are the ones whom God has guided; so follow their guidance), this is correct, for He said: \"Follow their guidance (فَبِهُدَاهُمُ),\" and their guidance is from God, and it is his Law (شرعه) (peace and blessings be upon him). That is, adhere to your Law which your deputies manifested in establishing the religion, and <<وَلَا تَتَفَرَّقُوا فِيهِ>> (and do not be divided therein). He did not say: \"Follow them.\" And in His saying <<وَلَا تَتَفَرَّقُوا فِيهِ>> there is an indication of the oneness (أحدية) of the Divine Laws. And His saying <<اتَّبِعْ مِلَّةَ إِبْرَاهِيمَ>> (Follow the religion of Abraham) refers to the religion (الدين). Thus, he is commanded to follow the religion, for the religion is only from God, not from anyone else.\n\nConsider his saying (peace be upon him): \"If Moses were alive, he would have no choice but to follow me.\"\n\nHe attributed the following (الاتباع) to himself, while he (peace and blessings be upon him) was commanded to follow the religion and the guidance of the Prophets, not the Prophets themselves. For when the Supreme Imam (الإمام الأعظم) is present, none of his deputies retains authority. If he is absent, the deputies rule according to his decrees. Thus, he is the Ruler, whether in the unseen (غيبا) or the witnessed (شهادة).\n\nWe have only presented these traditions and indications to reassure those who do not know this rank through their own unveiling (كشفه) or whom God has not informed of it within themselves.\n\n### [The Testimonies of the People of God]\n\nAs for the People of God (أهل الله), they are in agreement with us on this matter, for the testimonies of verification (شواهد التحقيق) have been established for them from their Lord within their souls. Although all that we have presented regarding this matter may admit many possible interpretations (احتمالات كثيرة), that refers back to the power inherent in the original linguistic placement of the words, not to the reality of the matter itself as understood by the People of Spiritual Tasting (أهل الأذواق) who receive knowledge directly from God, like Al-Khidr and his likes.\n\nA person may utter a statement intending only one meaning out of the many meanings that the statement encompasses. If the interpreter explains it using a meaning other than the speaker's intention, the interpreter has only explained some of what the power of the word allows, even if he missed the speaker's intended meaning.\n\nDo you not see how difficult it was for the Companions to understand the saying of God Most High: <<الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ>> (Those who believe and do not mix their faith with injustice)? Since the word *injustice* (ظلم) was indefinite (نكرة), they asked: \"Which of us has not mixed his faith with injustice?\" These Companions, who were Arabs and in whose tongue the Quran was revealed, did not know the intended meaning of the Real (الحق) in the verse, although the meaning they considered was permissible in the word and not denied.\n\nThe Prophet (peace and blessings be upon him) told them: \"The matter is not as you supposed. God only intended by *injustice* here what Luqman said to his son while advising him: <<يَا بُنَيَّ لَا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ>> (O my son, do not associate [others] with God. Indeed, association [with Him] is a great injustice).\"\n\nThe power of the word encompasses all injustice, but the speaker's intention was a specific, designated injustice, which is *shirk* (polytheism). Similarly, the traditions we have presented—that the children of Adam are subjects (سوقة) and that this Master Muhammad (peace and blessings be upon him) is the Sovereign (ملك)—is the intended meaning derived through the path of Unveiling (الكشف), just as the intended injustice in the verse was specifically *shirk*.\n\nFor this reason, interpretations of speech are strengthened by circumstantial evidence (قرائن الأحوال), for these distinguish the meanings intended by the speaker. How much more so for one who possesses Divine Unveiling (الكشف الإلهي) and Ladanian, Lordly Knowledge (العلم اللدني الرباني)?\n\nThe fair-minded, intelligent person should submit to what these people report. If they are truthful in that—which is the assumption made about them—then one is fair-minded by submitting, as the submitter has not rejected what is true in reality. If they are not truthful, the submitter is not harmed; rather, they benefit by avoiding delving into what is not theirs to decide, and they refer the knowledge of it to God Most High. Thus, they fulfill the right of Lordship (الربوبية), since what the friends of God (أولياء الله) have said is possible, and submission is therefore preferable in every respect.\n\n### [The Cycle of Sovereignty]\n\nThis concept of the Cycle of Sovereignty (دورة الملك) to which we have inclined has been affirmed by others, such as Imam Abu al-Qasim ibn Qassi in his book *Khal' al-Na'layn* (The Removal of the Two Sandals), which is our narration from his son about him. He was one of the masters of the folk. His Shaykh, at whose hands he received the unveiling, was one of the greatest Shaykhs of the Maghrib, called Ibn Khalil, from Lebla.\n\nWe rely in everything we mention only upon what God casts upon us of that knowledge, not upon the various interpretations that words may bear. Sometimes, all possible interpretations in certain speech may be intended by the speaker, and in that case, we affirm them all.\n\nThe Cycle of Sovereignty is an expression of the arrangements (الترتيبات) God established from Adam to the time of Muhammad (peace and blessings be upon him) in this human existence (النشأة الإنسانية) through the manifestation of Divine Rulings (الأحكام الإلهية) within it. They were the vicegerents (خلفاء) of the Vicegerent Master (الخليفة السيد).\n\nThe first existent to appear among human bodies was Adam (peace be upon him), who is the first father (الأب الأول) of this species. (The rest of the fathers of the other genera will come in the chapter after this, God willing.) He was the first of this species to appear by God's decree. However, as we established, a second father was separated from him, whom He named Eve (أما). Thus, the first father was entitled to the rank above her because he was her origin.\n\nThe deputies of the Cycle of Sovereignty were sealed with the like of that with which it began, to indicate that favor (الفضل) is in God's hand and that the matter was not necessitated by the first father for his own sake. Thus, Jesus was brought forth from Mary. Mary descended to the rank of Adam, and Jesus descended to the rank of Eve. Just as a female was found from a male, a male was found from a female. Thus, the cycle was sealed with the like of that with which it began, in the creation of a son without a father, just as Eve was created without a mother. Thus, Jesus and Eve were siblings, and Adam and Mary were their parents.\n\n### [The Likeness of Jesus in the Sight of God is as the Likeness of Adam]\n\n<<إِنَّ مَثَلَ عِيسَى عِنْدَ اللَّهِ كَمَثَلِ آدَمَ>> (Indeed, the likeness of Jesus in the sight of God is as the likeness of Adam). The comparison is made based on the absence of male parentage (الأبوة الذكرانية) because He established this as proof for Jesus regarding the innocence of his mother. The comparison was not made with Eve, even though the reality is such, because the woman is the locus of suspicion when pregnancy occurs, as she is the designated vessel for birth, while the man is not. The purpose of proofs is to remove doubts. In the case of Eve from Adam, no confusion arises because Adam is not the locus for the birth that issued from him. This is only a proof for those who affirm the existence of Adam, his formation, and the formation from him. Just as a son without a father is not customary, neither is a child without a mother customary.\n\nThe likeness, in terms of meaning, is that Jesus is like Eve. However, because doubt could enter into that, since the female, as we said, is the locus of what issues from her, and thus the suspicion arose, the comparison was made to Adam to establish Mary's innocence from what is possible according to custom. The appearance of Jesus son of Mary without a father is like the appearance of Eve from Adam without a mother, and he is the second father.\n\n### [The Separation of Eve from Adam]\n\nWhen Eve separated from Adam, her place in him was filled by conjugal desire (الشهوة النكاحية) toward her, which led to intercourse, resulting in procreation and generation. The outgoing air (الهواء الخارج) that filled his place became the body of Eve upon her exit, since there is no vacuum (خلاء) in the world. That aerial part sought its place, which Eve had taken with her personhood, and this moved Adam to seek his place. He found it filled by Eve, so he lay with her. When he covered her, she conceived from him and brought forth progeny. This remained a continuous custom in the animal kingdom, including the children of Adam and others, by nature.\n\nHowever, the human being is the comprehensive Word (الكلمة الجامعة) and the microcosm of the world (نسخة العالم). Everything in the world is a part of him, but the human being is not a part of any single thing in the world.\n\nThe reason for this separation and the creation of this first separated entity was the search for intimacy (الأنس) with a counterpart of the same specific species (النوع الأخص), and so that there might be in the world of bodies, through this natural human connection, the Perfect Human (الإنساني الكامل) in form, which God intended to resemble the Supreme Pen (القلم الأعلى) and the Preserved Tablet (اللوح المحفوظ), which are expressed as the First Intellect (العقل الأول) and the Universal Soul (النفس الكل). If you say the Supreme Pen, pay attention to the implication that includes the writer and the intention of writing, which brings you to the meaning of the Lawgiver's saying: \"Indeed, God created Adam upon His form.\"\n\n### [Be and Becoming]\n\nFurthermore, the expression of the Lawgiver in the Glorious Book for the creation of things is the command *Kun* (كُنْ - Be!), which consists of two letters (Kaf and Nun) that are equivalent to the two premises, and what results from *Kun* is the conclusion. These two letters are the manifest ones. The third letter, which is the link between the two premises, is hidden in *Kun*—it is the suppressed *Waw* (و) due to the meeting of two quiescent letters (التقاء الساكنين).\n\nSimilarly, when the man and the woman meet, the \"pen\" (القلم) has no manifest entity. The casting of the semen (النطفة) into the womb is unseen (غيبا) because it is a secret (سر). For this reason, intercourse (النكاح) is expressed as a secret in the language. God Most High said: <<وَلَكِنْ لَا تُوَاعِدُوهُنَّ سِرًّا>> (But do not promise them secretly). Likewise, during the casting, they both become quiescent (يسكنان) from movement, and the \"pen\" can be hidden, just as the third letter, the *Waw*, was hidden in *Kun* due to the quiescent letters. The *Waw* was chosen because it signifies elevation (العلو), as it is generated from the raising (الرفع), which is the lengthening of the *dammah*, and it is one of the weak letters (حروف العلة).\n\n### [The First Separation and the Last Separation in the Cycle of Sovereignty]\n\nWhat we have mentioned is only if the Sovereignty (الملك) refers specifically to human beings (الأناسي). If we consider his mastery over everything other than the Real (الحق), as some people hold, based on the reported Hadith: \"Were it not for you, O Muhammad, I would not have created the heavens, nor the earth, nor Paradise, nor the Fire,\" and mentioning the creation of everything other than God, then:\n\nThe first separation (منفصل) within it is the Universal Soul (النفس الكلية) from the first existent (أول موجود), which is the First Intellect (العقل الأول).\n\nThe last separation within it is Eve (حواء) from Adam (آدم), for the human being is the last existent among the genera of the world. There are only six genera, and under each genus are species, and under the species are types. The first genus is the Angel (الملك), the second is the Jinn (الجان), the third is the Mineral (المعدن), the fourth is the Plant (النبات), the fifth is the Animal (الحيوان). The Dominion (الملك) ended, was prepared, and perfected. The sixth genus is the Human (الإنسان), who is the Vicegerent (الخليفة) over this Dominion.\n\nHe was created last so that he might be an Imam (Imam) *in actuality* (بالفعل), not merely potentially (بالصلاحية والقوة). When his physical entity (عينه) came into existence, he was only found as a governor (واليا) and a sovereign (سلطانا) who was observed. Then, when the formation of his body was delayed, deputies were appointed for him. The first deputy and vicegerent for him was Adam (peace be upon him). Then progeny was born, and the lineage continued, and vicegerents were appointed in every age until the time of the formation of the pure body of Muhammad (peace and blessings be upon him). He appeared like the dazzling sun (الشمس الباهرة). Every light was absorbed into his radiant light, every ruling vanished in his ruling, all Divine Laws submitted to him, and his sovereignty (سيادته), which had been hidden, became manifest.\n\n<<هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ>> (He is the First and the Last, the Manifest and the Hidden, and He is the Knower of all things).\n\nFor he said: \"I was given the comprehensive words (جوامع الكلم).\"\n\nAnd he reported from his Lord: \"He struck His hand between my shoulders, and I felt the coolness of His fingertips between my breasts, and I knew the knowledge of the first and the last.\"\n\nThus, he attained the Divine character (التخلق) and the Divine relationship (النسب الإلهي) from God’s saying about Himself: <<هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ>>. This verse came in the chapter of Iron (الحديد), which contains <<بَأْسٌ شَدِيدٌ وَمَنَافِعُ لِلنَّاسِ>> (great might and benefits for mankind). For this reason, he was sent with the sword and sent as <<رَحْمَةً لِلْعَالَمِينَ>> (a mercy to the worlds).\n\nEvery entity separated from something was filling the place from which it separated. We have said that there is no vacuum in the world. Thus, the place of its separation was filled by its shadow (ظله), since its separation was toward the Light (النور) and toward manifestation (الظهور). When it faced the Light with its Essence (بذاته), its shadow extended and filled the place of its separation. Thus, the one from whom it separated did not lose it. It was witnessed by the one toward whom it separated and witnessed by the one from whom it separated. This is the meaning intended by the one who said:\n\n(I witnessed you existent in every place.)\n\nIt is one of the secrets of the world that nothing occurs except that it has a shadow that prostrates to God, so that it may fulfill the worship of its Lord in every state, whether the occurring matter is obedient or disobedient. If it is among the people of compliance, then it and its shadow are equal. If it is disobedient, its shadow acts as its substitute in obedience to God. God Most High said: <<وَظِلَالُهُمْ بِالْغُدُوِّ وَالْآصَالِ>> (And their shadows [prostrate] in the mornings and the evenings).\n\n### [The Sultan is the Shadow of God on Earth]\n\nThe Sultan (السلطان) is the Shadow of God on Earth, since his manifestation is through all the forms of the Divine Names (الأسماء الإلهية) that have an effect in the world of this life. The Throne (العرش) is the Shadow of God in the Hereafter.\n\nShadows (الظلالات) are always followers of the form from which they emanate, sensually and spiritually. The sensory realm (الحس) is limited and does not possess the strength of the spiritual shadow (الظل المعنوي) of the spiritual form, because it requires a restricted light due to the restriction, narrowness, and lack of expanse in the sensory realm. For this reason, we drew attention to the spiritual shadow by what came in the Divine Law (الشرع): that the Sultan is the Shadow of God on Earth.\n\nIt has become clear to you that places are filled by shadows. Here we have mentioned a portion of what is appropriate for this chapter, without delving deeply, for fear of prolixity. What we have presented is sufficient for one who is alert, if he possesses a sound understanding, and it is a reminder for one who has witnessed and known, but has become preoccupied with what is higher, or negligent due to what is lower, so that he may return to what we have mentioned when he considers this chapter.\n\n***\n\n(Section) [The Ranks of the People of the Interval]\n\nAs for the rank of the people who lived between Jesus (peace be upon him) and Muhammad (peace and blessings be upon him)—who are the People of the Interval (أهل الفترة)—they are of different ranks according to the manifestation (تجلى) of the Names to them, whether they knew it or not.\n\nAmong them are those who unified God based on what was manifested to their hearts through reflection (فكر). This is the person of rational proof (صاحب الدليل). <<فَهُوَ عَلَى نُورٍ مِنْ رَبِّهِ>> (He is upon a light from his Lord), but it is mixed with createdness (كون) due to his reflection. This person will be resurrected as a nation unto himself, like Quss ibn Sa'ida and his likes, for he mentioned in his sermon what indicates this, as he mentioned created things and his contemplation (اعتباره) of them, and this is reflection.\n\nAmong them are those who unified God by a light they found in their hearts, which they could not repel, without reflection, deliberation, speculation, or deduction. They are upon a pure light (نور خالص) from their Lord, unmixed with createdness. These will be resurrected as innocent, hidden ones (أخفياء أبرياء).\n\nAmong them are those into whose soul it was cast, and who were informed by their unveiling (كشفه), due to the intensity of their light and the purity of their inner being (سرّه) and the sincerity of their certainty, of the rank of Muhammad (peace and blessings be upon him), his mastery (سيادته), and the universality of his mission inwardly (باطنا) from the time of Adam until the time of this recipient of unveiling (المكاشف). Thus, he believed in him in the world of the Unseen (عالم الغيب) based on his witnessing (شهادة) and clear proof (بينة) from his Lord. This is God’s saying: <<أَفَمَنْ كَانَ عَلَى بَيِّنَةٍ مِنْ رَبِّهِ وَيَتْلُوهُ شَاهِدٌ مِنْهُ>> (Is he, then, who is on a clear proof from his Lord, and whom a witness from Him follows?). This witness testifies in his heart to the truth of what was unveiled to him. This person will be resurrected on the Day of Resurrection among God's chosen ones (ضنائن خلقه) and in the inner reality of Muhammad (باطنية محمد صلى الله عليه وسلم).\n\nAmong them are those who followed a true religion (ملة حق) of those who preceded him, such as one who became Jewish or Christian, or followed the religion of Abraham, or the religion of one of the Prophets, when he knew and was informed that they were Messengers from God calling a specific group to the Truth. So he followed them, believed in them, and walked their path, forbidding himself what that Messenger forbade and worshipping God according to his Divine Law (شريعته), even though that was not obligatory upon him since that Messenger was not sent to him. This person will be resurrected with those he followed on the Day of Resurrection and will be distinguished in their company in his outward aspect (ظاهريته), since the Law of that Prophet was established outwardly.\n\nAmong them are those who studied the books of the Prophets and learned of the honor of Muhammad (peace and blessings be upon him), his religion, and the reward of those who follow him. So he believed in him and affirmed him based on knowledge, even if he did not enter the Law of a preceding Prophet, and he practiced noble character (مكارم الأخلاق). This person will also be resurrected among the believers in Muhammad (peace and blessings be upon him), for he believed in him, and he shall have a double reward (أجران). All these are happy (سعداء) in the sight of God.\n\nAmong them are those who negated (عطل) [existence] and did not affirm it, due to a limited reflection (نظر قاصر), which limitation was the maximum strength he possessed due to a weakness in his constitution compared to the strength of others.\n\nAmong them are those who negated, not due to reflection, but due to imitation (تقليد). That one is absolutely wretched (شقي مطلق).\n\nAmong them are those who committed polytheism (أشرك) due to reflection in which they missed the path of the Real (الحق), despite exerting the maximum effort their strength allowed.\n\nAmong them are those who committed polytheism, not due to exhaustive reflection. That one is wretched (شقي).\n\nAmong them are those who committed polytheism due to imitation. That one is wretched.\n\nAmong them are those who negated after affirming, due to reflection that reached the maximum strength they possessed, due to its weakness.\n\nAmong them are those who negated after affirming, not due to exhaustive reflection or imitation. That one is wretched.\n\nThese are all the ranks of the People of the Interval (أهل الفترة) whom we have mentioned in this chapter.",
    "ur": "باب دہم: بادشاہت کے دور (دورة الملك) کی معرفت میں\n\nاور اس (دور) میں سب سے پہلے موجود سے سب سے پہلے جدا ہونے والی شے، اور اس میں سب سے آخر میں جدا ہونے والی شے سے سب سے آخر میں جدا ہونے والی شے، اور ان دونوں میں سے اس جگہ کو کس چیز نے آباد کیا جو اس سے جدا ہوئی، اور اللہ تعالیٰ نے اس سلطنت کو کیسے تیار کیا یہاں تک کہ اس کا بادشاہ آیا، اور اس عالم کا مرتبہ کیا ہے جو عیسیٰ اور محمد علیہما السلام کے درمیان ہے، جو کہ فترت کا زمانہ ہے۔\n\n> اگر بادشاہت (الملک) کا وجود نہ ہوتا تو بادشاہ کو نہ پہچانا جاتا،\n> اور نہ ہی وہ صفت ہوتی جس سے اسے موصوف کیا گیا۔\n\n> پس بادشاہت کا دور (دورة الملك) اس پر دلیل ہے، اسی لیے\n> اس کے دونوں سرے اس طرح کشف (الکشف) کے ذریعے مل گئے ہیں۔\n\n> پس اس کا آخر اس کے اول کی مانند تھا،\n> اور اس کا اول اپنے سے پہلے والے کا جانشین تھا۔\n\n> اور جب وہ (دور) ختم ہونے پر مکمل ہوا، تو اس کا بادشاہ،\n> اللہ کا سردار، اعتراف کرتے ہوئے اس میں کھڑا ہوا۔\n\n> اس کے خالق نے اسے فضل کے طور پر اس کی معرفتیں عطا کیں،\n> اور جو کچھ ہونے والا ہے اور جو کچھ ہو چکا ہے (اس کا علم دیا)، اور وہ (دور) ختم ہو گیا۔\n\n### [انبیاء محمد کے نائب ہیں]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ خبر میں آیا ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا: \"میں اولادِ آدم کا سردار ہوں اور مجھے فخر نہیں\" (یہ روایت 'راء' کے ساتھ ہے)۔ اور ایک روایت میں 'زے' کے ساتھ ہے، جس کا مطلب باطل پر فخر کرنا ہے۔ اور صحیح مسلم میں ہے: \"میں قیامت کے دن لوگوں کا سردار ہوں گا۔\"\n\nپس آپ صلی اللہ علیہ وسلم کے لیے بنی نوع انسان میں اپنے ہم جنسوں پر سیادت اور شرف ثابت ہو گیا۔ اور آپ علیہ السلام نے فرمایا: \"میں نبی تھا جبکہ آدم پانی اور مٹی کے درمیان تھے۔\"\n\nآپ کا مطلب یہ ہے کہ آپ کو اس کا علم تھا، پس اللہ تعالیٰ نے آپ کو آپ کے مرتبے کی خبر دی جبکہ آپ انسانی اجسام کی تخلیق سے پہلے روح تھے، جیسا کہ بنی آدم کے اجسام کی تخلیق سے پہلے ان سے میثاق لیا گیا۔ اور اللہ تعالیٰ نے ہمیں اپنے انبیاء کے ساتھ شامل کیا، اس طرح کہ ہمیں ان کی امتوں پر ان کے ساتھ گواہ بنایا، جب وہ ہر امت میں سے ان پر گواہ (شَهِيداً عَلَيْهِمْ من أَنْفُسِهِمْ) بھیجے گا، اور وہ رسول ہیں۔ پس آدم علیہ السلام سے لے کر آخری رسولوں تک، انبیاء دنیا میں آپ صلی اللہ علیہ وسلم کے نائب تھے۔ آپ صلی اللہ علیہ وسلم نے اس مقام کو کئی امور سے واضح فرمایا، جن میں سے ایک آپ صلی اللہ علیہ وسلم کا یہ فرمان ہے: \"اللہ کی قسم! اگر موسیٰ زندہ ہوتے تو ان کے لیے میری پیروی کے سوا کوئی چارہ نہ ہوتا۔\"\n\nاور آپ کا یہ فرمان کہ آخر زمانے میں عیسیٰ بن مریم کا نزول ہو گا، وہ ہماری امامت کریں گے، یعنی وہ ہمارے نبی علیہ السلام کی سنت کے مطابق ہم میں فیصلہ کریں گے، صلیب کو توڑیں گے اور خنزیر کو قتل کریں گے۔ اور اگر محمد صلی اللہ علیہ وسلم آدم کے زمانے میں مبعوث ہوتے تو انبیاء اور تمام لوگ قیامت تک حسی طور پر آپ کی شریعت کے حکم کے تحت ہوتے۔ اسی لیے آپ کے علاوہ کسی کو عام مبعوث نہیں کیا گیا، بلکہ آپ خاص طور پر بادشاہ (الملک) اور سردار ہیں۔ آپ کے سوا ہر رسول مخصوص قوموں کی طرف مبعوث ہوا، پس آپ صلی اللہ علیہ وسلم کی رسالت کے سوا کسی رسول کی رسالت عام نہیں ہوئی۔ پس آدم علیہ السلام کے زمانے سے لے کر محمد صلی اللہ علیہ وسلم کی بعثت کے زمانے تک اور قیامت تک، یہ آپ کی بادشاہت (ملکہ) ہے، اور آخرت میں تمام رسولوں پر آپ کی برتری اور سیادت ہے۔ یہ بات صحیح احادیث میں آپ سے منصوص ہے۔\n\n### [محمد کی روحانیت ہر نبی اور رسول کے ساتھ]\n\nپس آپ صلی اللہ علیہ وسلم کی روحانیت اور ہر نبی و رسول کی روحانیت موجود ہے۔ چنانچہ ان کی طرف اس روح طاہرہ سے امداد آتی تھی جس کے ذریعے وہ اپنے رسول ہونے کے زمانے میں شریعتیں اور علوم ظاہر کرتے تھے۔ اور آپ کا شریعتیں مقرر کرنا، جیسے علی اور معاذ وغیرہ کے لیے ان کے اور آپ صلی اللہ علیہ وسلم کے وجود کے زمانے میں، اور جیسے الیاس اور خضر علیہما السلام، اور عیسیٰ علیہ السلام کے لیے آخر زمانے میں اپنی امت میں محمد صلی اللہ علیہ وسلم کی مقرر کردہ شریعت کے مطابق حاکم بن کر ظاہر ہونا۔ لیکن چونکہ عالمِ حس میں آپ صلی اللہ علیہ وسلم کے جسم کا وجود پہلے نہیں ہوا، اس لیے ہر شریعت کو اس کی طرف منسوب کیا گیا جو اس کے ساتھ مبعوث ہوا، حالانکہ وہ حقیقت میں محمد صلی اللہ علیہ وسلم کی شریعت ہے، اگرچہ آپ کا جسم غائب تھا جہاں سے یہ بات معلوم نہیں ہوتی، جیسا کہ آپ کا جسم اب بھی غائب ہے اور عیسیٰ علیہ السلام کے نزول اور آپ کی شریعت کے مطابق حکم کرنے کے زمانے میں بھی (غائب ہو گا)۔\n\n### [محمد کی شریعت تمام شریعتوں کو منسوخ کرنے والی ہے]\n\nاور جہاں تک اللہ تعالیٰ کا اپنی شریعت کے ذریعے تمام شریعتوں کو منسوخ کرنا ہے، تو یہ نسخ پچھلی شریعتوں کو اس بات سے خارج نہیں کرتا کہ وہ آپ ہی کی شریعت کا حصہ ہوں۔ کیونکہ اللہ تعالیٰ نے ہمیں اپنی ظاہری شریعت میں، جو آپ صلی اللہ علیہ وسلم پر قرآن اور سنت میں نازل ہوئی، نسخ دکھایا ہے، اس کے باوجود کہ ہم سب کا اس پر اجماع اور اتفاق ہے کہ وہ منسوخ شدہ حکم آپ ہی کی شریعت تھی جو ہمارے لیے بھیجی گئی تھی، پس مؤخر حکم نے متقدم حکم کو منسوخ کر دیا۔ یہ نسخ جو قرآن اور سنت میں موجود ہے، ہمارے لیے اس بات پر تنبیہ تھا کہ آپ کا تمام پچھلی شریعتوں کو منسوخ کرنا انہیں آپ کی شریعت ہونے سے خارج نہیں کرتا۔ اور آخر زمانے میں عیسیٰ علیہ السلام کا نزول، جو اپنی رسالت کے زمانے کی شریعت یا اس کے بعض حصوں کے بجائے، آج مقرر کردہ شریعت محمدی کے مطابق حکم کریں گے، اس بات کی دلیل ہے کہ آج کسی بھی نبی علیہ السلام کا کوئی حکم باقی نہیں ہے، جب کہ آپ صلی اللہ علیہ وسلم نے اپنی شریعت میں جو کچھ مقرر فرمایا ہے وہ موجود ہے۔ اور اس میں وہ حالت بھی شامل ہے جس پر اہل کتاب میں سے اہل ذمہ ہیں، جب تک وہ (الْجِزْيَةَ عَنْ يَدٍ وهُمْ صاغِرُونَ) \"اپنے ہاتھ سے جزیہ دیں اور وہ ذلیل ہوں\" (سورۃ التوبہ: ۲۹)۔ کیونکہ شریعت کا حکم حالات پر ہوتا ہے۔\n\n### [محمد کی سیادت تمام بنی آدم پر]\n\nپس اس تمام مجموعے سے یہ نتیجہ نکلا کہ آپ تمام بنی آدم پر بادشاہ (الملک) اور سردار ہیں، اور آپ سے پہلے جو بھی گزرے وہ آپ کی بادشاہت اور آپ کے تابع تھے، اور ان میں حکم کرنے والے آپ کے نائب تھے۔ اگر یہ کہا جائے کہ آپ صلی اللہ علیہ وسلم کا فرمان ہے: \"مجھے فضیلت نہ دو۔\"\n\nتو جواب یہ ہے کہ ہم نے انہیں فضیلت نہیں دی بلکہ اللہ نے انہیں فضیلت دی ہے، کیونکہ یہ ہمارا اختیار نہیں ہے۔ اگرچہ یہ آیت آئی ہے: (أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ) \"یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی، پس آپ ان کی ہدایت کی پیروی کریں\" (سورۃ الانعام: ۹۰)، جب انبیاء علیہم السلام کا ذکر کیا گیا، تو یہ صحیح ہے۔ کیونکہ اللہ نے فرمایا: \"ان کی ہدایت کی پیروی کریں\" (فَبِهُداهُمُ)، اور ان کی ہدایت اللہ کی طرف سے ہے، اور وہ آپ صلی اللہ علیہ وسلم کی شریعت ہے۔ یعنی آپ اپنی اس شریعت کو لازم پکڑیں جس کے ذریعے آپ کے نائبین نے دین کو قائم کیا، اور (ولا تَتَفَرَّقُوا فِيهِ) \"اس میں تفرقہ نہ ڈالو\" (سورۃ الشوریٰ: ۱۳)۔ اللہ نے یہ نہیں فرمایا کہ \"ان کی پیروی کرو\" (فَبِهِمُ اقْتَدِهْ)۔ اور آپ کے فرمان (ولا تَتَفَرَّقُوا فِيهِ) میں شریعتوں کی وحدانیت پر تنبیہ ہے۔ اور آپ کا فرمان (اتَّبِعْ مِلَّةَ إِبْراهِيمَ) \"ابراہیم کے دین کی پیروی کرو\" (سورۃ النحل: ۱۲۳)، اور وہ دین ہے۔ پس آپ کو دین کی پیروی کا حکم دیا گیا، کیونکہ دین صرف اللہ کی طرف سے ہے نہ کہ کسی اور کی طرف سے۔ اور آپ صلی اللہ علیہ وسلم کے اس فرمان پر غور کریں: \"اگر موسیٰ زندہ ہوتے تو ان کے لیے میری پیروی کے سوا کوئی چارہ نہ ہوتا۔\"\n\nپس آپ نے پیروی کو اپنی طرف منسوب کیا، اور آپ صلی اللہ علیہ وسلم کو دین اور انبیاء کی ہدایت کی پیروی کا حکم دیا گیا، نہ کہ ان (انبیاء) کی پیروی کا۔ کیونکہ جب امام اعظم حاضر ہو جائے تو اس کے کسی نائب کا کوئی حکم باقی نہیں رہتا۔ پس جب وہ غائب ہوتا ہے تو نائبین اس کے فرامین کے مطابق حکم کرتے ہیں۔ پس وہ غیب اور شہود (الشہود) میں حاکم ہیں۔ اور ہم نے یہ خبریں اور تنبیہات صرف ان لوگوں کی دلجوئی کے لیے پیش کی ہیں جو اپنے کشف (الکشف) سے اس مرتبے کو نہیں جانتے، اور نہ ہی اللہ نے انہیں ان کے نفس سے اس پر مطلع کیا ہے۔\n\n### [اہل اللہ کے شواہد]\n\nاور جہاں تک اہل اللہ کا تعلق ہے، وہ اس معاملے میں اسی پر ہیں جس پر ہم ہیں، ان کے لیے ان کے رب کی طرف سے ان کے نفوس میں اس پر تحقیق کے شواہد قائم ہو چکے ہیں۔ اگرچہ اس بارے میں جو کچھ ہم نے پیش کیا ہے اس پر بہت سے احتمالات کا تصور کیا جا سکتا ہے، تو یہ اس قوت کی طرف لوٹتا ہے جو الفاظ اپنے اصل وضع میں دیتے ہیں، نہ کہ اس حقیقت کی طرف جو اہل ذوق کے نزدیک ہے جو علم اللہ سے حاصل کرتے ہیں، جیسے خضر اور ان جیسے لوگ۔ کیونکہ انسان کوئی کلام کرتا ہے اور اس سے ایک معنی مراد لیتا ہے، مثلاً ان معانی میں سے جو وہ کلام اپنے اندر رکھتا ہے۔ پس اگر اس کی تفسیر متکلم کے مقصود کے علاوہ کسی اور معنی سے کی جائے، تو مفسر نے صرف اس قوت کا کچھ حصہ بیان کیا جو لفظ دیتا ہے، اگرچہ اس نے متکلم کے مقصود کو نہیں پایا۔ کیا آپ نہیں دیکھتے کہ صحابہ کرام پر اللہ تعالیٰ کا یہ فرمان کتنا مشکل گزرا: (الَّذِينَ آمَنُوا ولَمْ يَلْبِسُوا إِيمانَهُمْ بِظُلْمٍ) \"وہ لوگ جو ایمان لائے اور اپنے ایمان کو ظلم کے ساتھ خلط ملط نہیں کیا\" (سورۃ الانعام: ۸۲)، پس ظلم کو نکرہ لایا گیا۔ تو انہوں نے کہا: ہم میں سے کون ہے جس نے اپنے ایمان کو ظلم سے خلط ملط نہ کیا ہو؟ پس یہ صحابہ کرام، جو وہ عرب تھے جن کی زبان میں قرآن نازل ہوا، آیت سے ذات حق (الحق) کا مقصود نہ جان سکے، حالانکہ جو معنی انہوں نے سمجھا وہ کلمے میں جائز اور غیر منکور تھا۔\n\nتو نبی صلی اللہ علیہ وسلم نے ان سے فرمایا: \"بات وہ نہیں جو تم نے گمان کی، بلکہ اللہ نے یہاں ظلم سے وہی مراد لیا ہے جو لقمان نے اپنے بیٹے سے کہا تھا جب وہ اسے نصیحت کر رہے تھے: (يا بُنَيَّ لا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ) 'اے میرے بیٹے! اللہ کے ساتھ شرک نہ کرنا، بے شک شرک بہت بڑا ظلم ہے' (سورۃ لقمان: ۱۳)۔\"\n\nپس کلمے کی قوت ہر ظلم کو شامل ہے، لیکن متکلم کا مقصود ایک خاص اور معین ظلم ہے۔ اسی طرح جو خبریں ہم نے پیش کی ہیں کہ بنی آدم رعایا ہیں اور یہ سردار محمد صلی اللہ علیہ وسلم ان کے بادشاہ (الملک) ہیں، یہ کشف (الکشف) کے طریقے سے مقصود ہے، جیسا کہ وہاں متکلم کا مقصود ظلم سے خاص طور پر شرک تھا۔ اسی لیے کلام کی تفاسیر حالات کے قرائن سے مضبوط ہوتی ہیں، کیونکہ وہ متکلم کے مقصود معانی کو ممتاز کرتی ہیں۔ تو اس شخص کا کیا حال ہو گا جسے کشف (الکشف) الٰہی اور علم لدنی ربانی حاصل ہو؟ پس عقل مند اور منصف شخص کو چاہیے کہ وہ ان لوگوں کی خبروں کو تسلیم کر لے، کیونکہ اگر وہ اس میں سچے ہیں تو ان سے یہی گمان ہے، اور تسلیم کرنے سے انہوں نے انصاف کیا، جہاں تسلیم کرنے والے نے اس چیز کو رد نہیں کیا جو حقیقت میں حق ہے۔ اور اگر وہ سچے نہ بھی ہوں تو تسلیم کرنے والے کو کوئی نقصان نہیں ہو گا، بلکہ انہیں فائدہ ہوا کہ انہوں نے اس چیز میں غور و خوض چھوڑ دیا جس میں انہیں یقین حاصل نہیں تھا، اور اس کا علم اللہ کے سپرد کر دیا، پس انہوں نے ربوبیت کا حق ادا کیا، کیونکہ جو کچھ اولیاء اللہ نے کہا وہ ممکن تھا، لہٰذا ہر صورت میں تسلیم کرنا زیادہ بہتر ہے۔\n\n### [بادشاہت کا دور (دورة الملك)]\n\nاور یہ دورہ ملک (دورة الملك) جس کی طرف ہم مائل ہوئے ہیں، ہمارے علاوہ دوسروں نے بھی اسے بیان کیا ہے، جیسے امام ابو القاسم ابن قسی نے اپنی کتاب \"خلع\" میں، اور یہ ان کے بیٹے کے ذریعے ہماری روایت ہے۔ وہ قوم کے سرداروں میں سے تھے، اور ان کے شیخ جن کے ہاتھوں پر انہیں کشف (الکشف) حاصل ہوا، مغرب کے سب سے بڑے شیوخ میں سے تھے، جنہیں ابن خلیل کہا جاتا تھا اور وہ لبلہ کے رہنے والے تھے۔ پس ہم جو کچھ بھی ذکر کرتے ہیں، اس میں صرف اسی پر بھروسہ کرتے ہیں جو اللہ ہمارے دل میں ڈالتا ہے، نہ کہ ان وجوہ پر جو الفاظ میں محتمل ہیں۔ اور بعض کلام میں تمام محتملات متکلم کے مقصود ہو سکتے ہیں، تو ہم ان سب کو قبول کرتے ہیں۔ پس دورہ ملک (دورة الملك) اس ترتیب کا نام ہے جو اللہ نے آدم سے لے کر محمد صلی اللہ علیہ وسلم کے زمانے تک اس انسانی نشأت (النشأة الإنسانية) میں قائم کی، ان الٰہی احکام کے ذریعے جو اس میں ظاہر ہوئے۔ پس وہ (انبیاء) خلیفہ سردار کے نائب تھے۔ انسانی اجسام میں سب سے پہلے ظاہر ہونے والا وجود آدم علیہ السلام تھے، اور وہ اس جنس کے پہلے باپ ہیں۔ اور باقی اجناس کے آباء کا ذکر ان شاء اللہ اس باب کے بعد آئے گا۔ اور وہ اس جنس میں اللہ کے حکم سے سب سے پہلے ظاہر ہوئے۔ لیکن جیسا کہ ہم نے مقرر کیا، پھر ان سے ہمارے لیے ایک دوسرا باپ جدا کیا جسے ماں کا نام دیا گیا۔ پس اس پہلے باپ کے لیے وہ درجہ صحیح ہوا جس پر وہ فائز تھے، کیونکہ وہ اس کی اصل تھے۔ پس نائبین کا دورہ ملک (دورة الملك) اسی طرح ختم ہوا جس طرح شروع ہوا تھا، تاکہ اس بات پر تنبیہ ہو کہ فضل اللہ کے ہاتھ میں ہے اور یہ معاملہ پہلے باپ نے اپنی ذات کے لیے حاصل نہیں کیا تھا۔ پس عیسیٰ کو مریم سے پیدا کیا گیا، تو مریم آدم کے مرتبے پر اتریں اور عیسیٰ حواء کے مرتبے پر اترے۔ پس جس طرح ایک مؤنث ایک مذکر سے پیدا ہوئی، اسی طرح ایک مذکر ایک مؤنث سے پیدا ہوا۔ پس اس دور کا اختتام اسی طرح ہوا جس طرح آغاز ہوا تھا، یعنی بغیر باپ کے بیٹے کی پیدائش سے، جیسا کہ حواء بغیر ماں کے تھیں۔ پس عیسیٰ اور حواء بھائی تھے، اور آدم اور مریم ان دونوں کے باپ تھے۔\n\n### [اللہ کے نزدیک عیسیٰ کی مثال آدم کی مثال جیسی ہے]\n\n(إِنَّ مَثَلَ عِيسى‏ عِنْدَ الله كَمَثَلِ آدَمَ) \"بے شک عیسیٰ کی مثال اللہ کے نزدیک آدم کی مثال جیسی ہے\" (سورۃ آل عمران: ۵۹)۔ پس تشبیہ کو مذکر باپ کے نہ ہونے میں واقع کیا گیا، اس لیے کہ اللہ نے اسے عیسیٰ کی دلیل کے طور پر ان کی والدہ کی براءت کے لیے قائم کیا۔ اور تشبیہ حواء سے نہیں دی گئی، اگرچہ معاملہ اسی پر تھا، کیونکہ عورت حمل کے وجود کی وجہ سے تہمت کی جگہ ہے، اس لیے کہ وہ ولادت کے لیے مقرر کردہ محل ہے۔ اور مرد اس کا محل نہیں ہے۔ اور دلائل کا مقصد شک و شبہات کو دور کرنا ہے۔ اور آدم سے حواء کی پیدائش میں کوئی التباس واقع نہیں ہوتا، کیونکہ آدم اس چیز کا محل نہیں تھے جو ان سے صادر ہوئی (یعنی ولادت)۔ اور یہ (آیت) دلیل نہیں ہو سکتی مگر اس شخص کے نزدیک جس کے ہاں آدم کا وجود، ان کی تخلیق، اور ان سے تخلیق کا ثبوت ہو۔ اور جس طرح بغیر باپ کے بیٹے کا ہونا غیر معروف ہے، اسی طرح بغیر ماں کے (بیٹے کا ہونا) بھی غیر معروف ہے۔ پس معنی کے لحاظ سے مثال یہ ہے کہ عیسیٰ حواء کی طرح ہیں، لیکن چونکہ اس میں منکر کی طرف سے دخل اندازی کا امکان تھا، کیونکہ جیسا کہ ہم نے کہا، مؤنث اس چیز کا محل ہے جو اس سے صادر ہوتی ہے، اور اسی وجہ سے تہمت لگی، اس لیے تشبیہ آدم سے دی گئی تاکہ مریم کی براءت حاصل ہو جائے اس چیز سے جو عام طور پر ممکن ہے۔ پس عیسیٰ بن مریم کا بغیر باپ کے ظاہر ہونا، حواء کا آدم سے بغیر ماں کے ظاہر ہونے جیسا ہے، اور وہ (آدم) دوسرا باپ ہے۔\n\n### [حواء کا آدم سے جدا ہونا]\n\nاور جب حواء آدم سے جدا ہوئیں، تو ان کی جگہ کو آدم میں نکاح کی شہوت سے آباد کیا گیا، جس کے ذریعے جماع واقع ہوا تاکہ نسل اور توالد کا ظہور ہو۔ اور وہ خارج ہونے والی ہوا جس نے حواء کے جسم کی جگہ کو آباد کیا جب وہ نکلیں، کیونکہ عالم میں کوئی خلا نہیں ہے، تو اس ہوائی جز نے اپنی اس جگہ کو طلب کیا جسے حواء نے اپنی شخصیت کے ساتھ لے لیا تھا، پس اس نے آدم کو اپنی جگہ کی طلب کے لیے حرکت دی، تو انہوں نے اسے حواء سے آباد پایا، پس وہ ان پر واقع ہوئے، اور جب انہوں نے ان سے جماع کیا تو وہ ان سے حاملہ ہوئیں اور ذریت کو جنم دیا۔ پس یہ طریقہ بنی آدم اور دیگر حیوانات میں طبعی طور پر جاری سنت بن گیا۔ لیکن انسان کلمہ جامعہ اور عالم کا نسخہ ہے۔ پس عالم کی ہر چیز اس کا جز ہے، لیکن انسان عالم کی کسی ایک چیز کا جز نہیں ہے۔ اور اس جدائی اور اس پہلے جدا ہونے والے وجود کا سبب یہ تھا کہ ہم جنس میں مماثلت کے ساتھ انسیت کی طلب ہو، جو کہ نوعِ اخص ہے۔ اور تاکہ اجسام کے عالم میں اس طبعی انسانی اتصال کے ذریعے، جو صورت کے لحاظ سے کامل ہے اور جسے اللہ نے چاہا، وہ چیز وجود میں آئے جو قلم اعلیٰ اور لوح محفوظ سے مشابہ ہو، جسے عقل اول اور نفس کل سے تعبیر کیا جاتا ہے۔ اور جب آپ قلم اعلیٰ کہیں تو اس اشارے پر غور کریں جو کاتب اور کتابت کے ارادے کو شامل ہے، تو آپ کے ساتھ شارع کے اس قول کا معنی قائم ہو جائے گا کہ: \"اللہ نے آدم کو اپنی صورت پر پیدا کیا۔\"\n\n### [کُن اور کَون]\n\nپھر کتاب عزیز میں چیزوں کی تخلیق کے بارے میں شارع کا تعبیر (کُنْ) سے ہے، پس وہ دو حروف لایا جو دو مقدمات کے درجے میں ہیں، اور جو کچھ (کُنْ) کے ذریعے ہوتا ہے وہ نتیجہ ہے۔ اور یہ دو حروف ظاہر ہیں، اور تیسرا حرف جو دو مقدمات کے درمیان ربط ہے، وہ (کُنْ) میں پوشیدہ ہے، اور وہ واؤ ہے جو دو ساکنوں کے ملنے کی وجہ سے حذف ہو گیا ہے۔ اسی طرح جب مرد اور عورت ملتے ہیں تو قلم (تخلیق کا آلہ) کی کوئی ظاہری آنکھ باقی نہیں رہتی۔ پس اس کا نطفہ کو رحم میں ڈالنا غیب میں ہوتا ہے کیونکہ یہ ایک راز ہے۔ اسی لیے زبان میں نکاح کو راز (سر) سے تعبیر کیا گیا ہے۔ اللہ تعالیٰ نے فرمایا: (ولكِنْ لا تُواعِدُوهُنَّ سِرًّا) \"لیکن تم ان سے خفیہ وعدہ نہ کرو\" (سورۃ البقرہ: ۲۳۵)۔ اور اسی طرح نطفہ ڈالنے کے وقت وہ دونوں حرکت سے ساکن ہو جاتے ہیں، اور قلم کو چھپایا جا سکتا ہے، جیسا کہ (کُنْ) میں دو ساکنوں کی وجہ سے تیسرا حرف جو کہ واؤ تھا، چھپ گیا۔ اور واؤ اس لیے تھا کہ اسے بلندی حاصل ہے، کیونکہ وہ رفع سے پیدا ہوتا ہے، جو ضمہ کا اشباع ہے، اور وہ حروف علت میں سے ہے۔\n\n### [بادشاہت کے دور (دورة الملك) میں پہلا جدا ہونے والا اور آخری جدا ہونے والا]\n\nاور یہ جو ہم نے ذکر کیا ہے، یہ تب ہے جب بادشاہت (الملک) سے مراد صرف انسان ہوں۔ لیکن اگر ہم آپ کی سیادت کو ذات حق (الحق) کے سوا ہر چیز پر دیکھیں، جیسا کہ بعض لوگوں کا خیال ہے، اس مروی حدیث کی بنا پر کہ اللہ فرماتا ہے: \"اے محمد! اگر آپ نہ ہوتے تو میں نہ آسمان پیدا کرتا، نہ زمین، نہ جنت، نہ دوزخ،\" اور اللہ کے سوا ہر چیز کی تخلیق کا ذکر کیا، تو اس صورت میں اس (دور) میں سب سے پہلے جدا ہونے والی شے نفس کلیہ ہو گی، جو پہلے موجود یعنی عقل اول سے جدا ہوئی۔ اور اس میں سب سے آخر میں جدا ہونے والی شے حواء ہو گی، جو آخری موجود یعنی آدم سے جدا ہوئیں۔ کیونکہ انسان عالم کی اجناس میں آخری موجود ہے۔ وہاں صرف چھ اجناس ہیں، اور ہر جنس کے تحت انواع ہیں، اور انواع کے تحت مزید انواع ہیں۔ پہلی جنس فرشتہ (الملک)، دوسری جن، تیسری معدن، چوتھی نباتات، پانچویں حیوان۔ اور بادشاہت (الملک) ختم ہوئی، تیار ہوئی اور برابر ہو گئی، اور چھٹی جنس انسان کی تھی، جو اس سلطنت کا خلیفہ ہے۔ اور وہ آخر میں اس لیے وجود میں آیا تاکہ وہ حقیقت میں بالفعل امام ہو، نہ کہ صرف صلاحیت اور قوت کے لحاظ سے۔ پس جب آپ کا جسم وجود میں آیا تو آپ ایک حاکم، ایک نمایاں سلطان کے طور پر ہی وجود میں آئے۔ پھر جب آپ کے جسم کی نشأت میں تاخیر ہوئی تو آپ کے لیے نائبین مقرر کیے گئے۔ پس آپ کا پہلا نائب اور خلیفہ آدم علیہ السلام تھے، پھر نسل پیدا ہوئی اور متصل ہوئی، اور ہر زمانے میں خلفاء مقرر کیے گئے، یہاں تک کہ جسم طاہر محمد صلی اللہ علیہ وسلم کی نشأت کا زمانہ آیا، تو آپ چمکتے ہوئے سورج کی طرح ظاہر ہوئے، پس ہر نور آپ کے چمکتے ہوئے نور میں شامل ہو گیا، اور ہر حکم آپ کے حکم میں غائب ہو گیا، اور تمام شریعتیں آپ کے تابع ہو گئیں، اور آپ کی وہ سیادت ظاہر ہو گئی جو باطنی تھی۔ پس (هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ وهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ) \"وہی اول ہے اور وہی آخر ہے اور وہی ظاہر ہے اور وہی باطن ہے اور وہ ہر چیز کو جاننے والا ہے\" (سورۃ الحدید: ۳)۔ کیونکہ آپ نے فرمایا: \"مجھے جوامع الکلم عطا کیے گئے۔\"\n\nاور آپ نے اپنے رب کے بارے میں فرمایا: \"اس نے اپنا ہاتھ میرے دونوں کندھوں کے درمیان مارا، تو میں نے اس کی انگلیوں کی ٹھنڈک اپنے دونوں پستانوں کے درمیان محسوس کی، پس میں نے اولین و آخرین کا علم جان لیا۔\"\n\nپس آپ کو اللہ تعالیٰ کے اپنے بارے میں اس فرمان سے تخلق اور نسبت الٰہی حاصل ہوئی: (هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ وهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ)۔ اور یہ آیت سورۃ الحدید میں آئی ہے، جس میں (فِيهِ بَأْسٌ شَدِيدٌ ومَنافِعُ لِلنَّاسِ) \"اس میں سخت قوت اور لوگوں کے لیے فائدے ہیں\" (سورۃ الحدید: ۲۵)۔ اسی لیے آپ کو تلوار کے ساتھ مبعوث کیا گیا اور (رَحْمَةً لِلْعالَمِينَ) \"تمام جہانوں کے لیے رحمت\" بنا کر بھیجا گیا۔ اور ہر وہ شے جو کسی چیز سے جدا ہوتی ہے، تو وہ اس جگہ کو آباد کر چکی ہوتی ہے جس سے وہ جدا ہوئی ہے۔ اور ہم کہہ چکے ہیں کہ عالم میں کوئی خلا نہیں ہے۔ پس اس نے اپنی جدائی کی جگہ کو اپنے سائے سے آباد کیا، کیونکہ اس کی جدائی نور کی طرف تھی، اور وہ ظہور کے لیے ہے۔ پس جب اس نے اپنی ذات کے ساتھ نور کا مقابلہ کیا تو اس کا سایہ پھیل گیا، اور اس نے اپنی جدائی کی جگہ کو آباد کر دیا، پس جس سے وہ جدا ہوا اس نے اسے کھویا نہیں۔ پس وہ اس کے لیے بھی مشہود تھا جس کی طرف وہ جدا ہوا، اور اس کے لیے بھی مشہود تھا جس سے وہ جدا ہوا۔ اور یہی وہ معنی ہے جو کہنے والے نے اپنے قول سے مراد لیا:\n\n(میں نے تجھے ہر جگہ موجود دیکھا)\n\nپس عالم کے اسرار میں سے یہ ہے کہ کوئی بھی چیز وجود میں نہیں آتی مگر اس کا ایک سایہ ہوتا ہے جو اللہ کو سجدہ کرتا ہے، تاکہ وہ ہر حال میں اپنے رب کی عبادت کو قائم رکھے، خواہ وہ حادث ہونے والی چیز مطیع ہو یا نافرمان۔ پس اگر وہ موافقت کرنے والوں میں سے ہو تو وہ اور اس کا سایہ برابر ہوتے ہیں، اور اگر وہ مخالف ہو تو اس کا سایہ اللہ کی اطاعت میں اس کی جگہ نائب بن جاتا ہے۔ اللہ تعالیٰ نے فرمایا: (وظِلالُهُمْ بِالْغُدُوِّ والْآصالِ) \"اور ان کے سائے صبح و شام\" (سورۃ الرعد: ۱۵)۔\n\n### [سلطان زمین پر اللہ کا سایہ ہے]\n\nسلطان زمین پر اللہ کا سایہ ہے، کیونکہ اس کا ظہور تمام الٰہی اسماء کی صورتوں کے ساتھ ہوتا ہے جن کا اثر دنیا کے عالم میں ہے۔ اور عرش آخرت میں اللہ کا سایہ ہے۔ پس سائے ہمیشہ اس صورت کے تابع ہوتے ہیں جس سے وہ حسی اور معنوی طور پر نکلتے ہیں۔ اور حس قاصر ہے، وہ معنوی صورت کے معنوی سائے کی قوت کو مضبوط نہیں کر سکتی، کیونکہ وہ ایک مقید نور کا تقاضا کرتی ہے، اس لیے کہ حس میں تقیید، تنگی اور عدم وسعت ہے۔ اور اسی لیے ہم نے معنوی سائے پر اس بات سے تنبیہ کی جو شریعت میں آیا ہے کہ سلطان زمین پر اللہ کا سایہ ہے۔ پس آپ پر واضح ہو گیا کہ سائے ہی سے جگہیں آباد ہوئیں۔ یہاں ہم نے اس باب کے مناسب کچھ حصہ ذکر کیا ہے اور طوالت کے خوف سے اس میں زیادہ گہرائی میں نہیں گئے ہیں۔ اور جو کچھ ہم نے پیش کیا ہے وہ اس شخص کے لیے کافی ہے جو تنبہ حاصل کرے، اگر وہ سلیم فہم رکھتا ہو، اور یہ اس شخص کے لیے یاد دہانی ہے جس نے شہود (الشہود) کیا اور جانا، اور جو اعلیٰ چیزوں میں مشغول رہا یا جو ادنیٰ چیزوں میں غافل رہا، تو وہ اس باب کو دیکھتے وقت ہماری ذکر کردہ باتوں کی طرف رجوع کرے۔\n\n### (فصل) [اہل فترت کے مراتب]\n\nاور جہاں تک اس عالم کے مرتبے کا تعلق ہے جو عیسیٰ علیہ السلام اور محمد صلی اللہ علیہ وسلم کے درمیان ہے، اور وہ اہل فترت ہیں، تو وہ مختلف مراتب پر ہیں، اس کے مطابق کہ ان پر اسماء کا ظہور (التجلی) کس طرح ہوتا ہے، خواہ انہیں اس کا علم ہو یا نہ ہو۔ پس ان میں سے کچھ وہ ہیں جنہوں نے اللہ کی توحید اس چیز کے ذریعے کی جو ان کے فکر کے وقت ان کے دل پر ظاہر ہوئی، اور وہ دلیل کے مالک ہیں، پس (فَهُوَ عَلى‏ نُورٍ من رَبِّهِ) \"وہ اپنے رب کی طرف سے نور پر ہے\" (سورۃ الزمر: ۲۲)، جو ان کے فکر کی وجہ سے کَون (تخلیق) کے ساتھ ملا ہوا ہے۔ پس یہ شخص اکیلا ایک امت کے طور پر اٹھایا جائے گا، جیسے قس بن ساعدہ اور ان جیسے لوگ، کیونکہ انہوں نے اپنے خطبے میں ایسی بات ذکر کی جو اس پر دلالت کرتی ہے، کیونکہ انہوں نے مخلوقات کا ذکر کیا اور ان میں غور و فکر کیا، اور یہی فکر ہے۔ اور ان میں سے کچھ وہ ہیں جنہوں نے اللہ کی توحید اس نور کے ذریعے کی جو انہوں نے اپنے دل میں پایا، جسے وہ بغیر کسی فکر، غور و خوض، نظر یا استدلال کے دفع نہیں کر سکتے۔ پس وہ اپنے رب کے خالص نور پر ہیں جو کَون کے ساتھ ملا ہوا نہیں ہے۔ پس یہ لوگ قیامت کے دن پوشیدہ اور بے گناہ اٹھائے جائیں گے۔ اور ان میں سے کچھ وہ ہیں جن کے نفس میں ڈالا گیا اور ان کے کشف (الکشف) سے ان پر ظاہر کیا گیا، ان کے نور کی شدت اور ان کے راز کی صفائی کی وجہ سے، ان کے یقین کے خلوص کی بنا پر، محمد صلی اللہ علیہ وسلم کے مرتبے، آپ کی سیادت اور آپ کی رسالت کی باطنی عمومیت پر، جو آدم کے زمانے سے لے کر اس مکاشف کے وقت تک ہے۔ پس انہوں نے عالم غیب میں آپ پر ایمان لایا، اپنی طرف سے گواہی اور اپنے رب کی طرف سے دلیل کے ساتھ، اور یہی اللہ تعالیٰ کا فرمان ہے: (أَ فَمَنْ كانَ عَلى‏ بَيِّنَةٍ من رَبِّهِ ويَتْلُوهُ شاهِدٌ مِنْهُ) \"کیا وہ شخص جو اپنے رب کی طرف سے دلیل پر ہو اور اس کے پیچھے اس کی طرف سے ایک گواہ ہو\" (سورۃ ہود: ۱۷)، جو اس کے دل میں اس کشف (الکشف) کی سچائی کی گواہی دیتا ہے۔ پس یہ شخص قیامت کے دن اللہ کی مخلوق کے چنیدہ لوگوں میں اور محمد صلی اللہ علیہ وسلم کی باطنی جماعت میں اٹھایا جائے گا۔\n\nاور ان میں سے کچھ وہ ہیں جنہوں نے اپنے سے پہلے کسی حق والے دین کی پیروی کی، جیسے وہ شخص جو یہودی ہو گیا یا نصرانی ہو گیا یا ملت ابراہیم کی پیروی کی، یا ان انبیاء میں سے کسی کی پیروی کی جب اسے معلوم ہوا اور اس نے جان لیا کہ وہ اللہ کی طرف سے رسول ہیں جو ایک مخصوص گروہ کو حق کی طرف بلاتے ہیں، پس اس نے ان کی پیروی کی، ان پر ایمان لایا اور ان کے طریقوں پر چلا، اور اپنے اوپر وہ چیزیں حرام کر لیں جو اس رسول نے حرام کی تھیں، اور اللہ کے ساتھ اپنی شریعت کے مطابق عبادت کی، اگرچہ یہ اس پر واجب نہیں تھا کیونکہ وہ رسول اس کی طرف مبعوث نہیں ہوا تھا۔ پس یہ شخص قیامت کے دن ان لوگوں کے ساتھ اٹھایا جائے گا جن کی اس نے پیروی کی، اور وہ اپنی ظاہری جماعت میں ممتاز ہو گا، کیونکہ اس نبی کی شریعت ظاہر میں مقرر ہو چکی تھی۔ اور ان میں سے کچھ وہ ہیں جنہوں نے انبیاء کی کتابوں میں محمد صلی اللہ علیہ وسلم کے شرف، آپ کے دین اور آپ کی پیروی کرنے والوں کے ثواب کا مطالعہ کیا، پس علم کے ساتھ آپ پر ایمان لائے اور تصدیق کی، اگرچہ وہ اپنے سے پہلے کسی نبی کی شریعت میں داخل نہیں ہوئے اور انہوں نے مکارم اخلاق کو اپنایا۔ پس یہ بھی محمد صلی اللہ علیہ وسلم پر ایمان لانے والوں میں اٹھایا جائے گا، پس اس نے آپ پر ایمان لایا تو اسے دو اجر ملیں گے۔ اور یہ سب اللہ کے نزدیک سعید (خوش بخت) ہیں۔ اور ان میں سے کچھ وہ ہیں جنہوں نے تعطیل کی (وجود کا انکار کیا) اور قاصر نظر کی وجہ سے وجود کا اقرار نہیں کیا، اور یہ قصور ان کی قوت کے لحاظ سے ان کی انتہا تھی، کیونکہ ان کے مزاج میں دوسروں کی قوت کے مقابلے میں کمزوری تھی۔ اور ان میں سے کچھ وہ ہیں جنہوں نے نظر کے بجائے تقلید کی وجہ سے تعطیل کی، پس وہ مطلق شقی (بد بخت) ہیں۔ اور ان میں سے کچھ وہ ہیں جنہوں نے نظر کی وجہ سے شرک کیا، جس میں انہوں نے حق کا راستہ غلط سمجھا، باوجود اس کے کہ انہوں نے اپنی قوت کے مطابق پوری کوشش کی۔ اور ان میں سے کچھ وہ ہیں جنہوں نے بغیر گہری نظر کے شرک کیا، پس وہ شقی ہیں۔ اور ان میں سے کچھ وہ ہیں جنہوں نے تقلید کی وجہ سے شرک کیا، پس وہ شقی ہیں۔ اور ان میں سے کچھ وہ ہیں جنہوں نے ثابت کرنے کے بعد تعطیل کی، اس نظر کے ذریعے جو ان کی موجودہ قوت کی انتہا تک پہنچی، لیکن اس قوت کی کمزوری کی وجہ سے۔ اور ان میں سے کچھ وہ ہیں جنہوں نے ثابت کرنے کے بعد تعطیل کی، بغیر گہری نظر یا تقلید کے، پس وہ شقی ہیں۔ پس یہ سب اہل فترت کے مراتب ہیں جن کا ہم نے اس باب میں ذکر کیا۔",
    "fa": "«باب دهم» در معرفت دوره‌ی پادشاهی (دورة الملك)\n\nو اولین جداشده (منفصل) در آن از اولین موجود، و آخرین جداشده در آن از آخرین جداشده از او، و اینکه جایگاه جداشده از آن دو چگونه آباد شد، و چگونه خداوند این قلمرو (المملكة) را آماده ساخت تا پادشاه آن آمد، و مرتبه‌ی عالمی که میان عیسی و محمد (علیهما السلام) است، که همان زمان فترت (زمان انقطاع وحی) است.\n\nاگر هستیِ پادشاهی (الملك) نبود، پادشاه شناخته نمی‌شد *** و صفتی از آنچه بدان وصف شده، وجود نمی‌داشت.\nپس دوره‌ی پادشاهی (دورة الملك) برهانی بر اوست، از این رو *** دو سر آن این‌گونه در کشف (الکشف) به هم رسید.\nآخرش مانند اولش بود *** و اولش از پیشینیان سلف بود.\nو هنگامی که با ختم کامل شد، *** پادشاهش، سیدِ معترف به خداوند، در آن قیام کرد.\nآفریننده‌اش از روی فضل، معارف آن را به او عطا کرد *** و آنچه خواهد بود و آنچه بوده و سپری شده است.\n\n### [انبیاء نائبان محمد]\n\nبدان، خداوند تو را تأیید کند، که در خبر آمده است که پیامبر (صلی الله علیه و سلم) فرمود: «أنا سيد ولد آدم ولا فخر» (من سرور فرزندان آدم هستم و فخری نیست). در روایتی با حرف \"ز\" (زخر) آمده که به معنای فخر فروشی باطل است، اما در صحیح مسلم آمده است: «أنا سيد الناس يوم القيامة» (من سرور مردم در روز قیامت هستم).\n\nپس سیادت و شرف بر ابناء جنس خود از بشر برای او ثابت شد. و فرمود (علیه السلام): «كنت نبيا وآدم بين الماء والطين» (من نبی بودم در حالی که آدم میان آب و گِل بود). منظور این است که بر این امر علم داشت، پس خداوند متعال او را از مرتبه‌اش آگاه ساخت، در حالی که او روحی بود پیش از ایجاد اجسام انسانی، همان‌گونه که از بنی آدم پیش از ایجاد اجسامشان پیمان گرفت. و خداوند متعال ما را به انبیاء خود ملحق ساخت، به این صورت که ما را شاهد بر امت‌های آنان قرار داد، همراه با آنان، هنگامی که از هر امتی «شَهِيداً عَلَيْهِمْ من أَنْفُسِهِمْ» (گواهی از خودشان بر آنان) برمی‌انگیزد، و آنان همان رسولان هستند. پس انبیاء در عالم، نائبان او (صلی الله علیه و سلم) بودند، از آدم تا آخرین رسولان (علیهم السلام). و او (صلی الله علیه و سلم) این مقام را با اموری آشکار ساخت، از جمله: فرموده‌ی او (صلی الله علیه و سلم): «والله لو كان موسى حيا ما وسعه إلا أن يتبعني» (به خدا سوگند، اگر موسی زنده بود، چاره‌ای جز پیروی از من نداشت).\n\nو فرموده‌ی او درباره‌ی نزول عیسی بن مریم در آخرالزمان که او بر ما امامت می‌کند، یعنی در میان ما بر اساس سنت پیامبرمان (علیه السلام) حکم می‌راند، صلیب را می‌شکند و خوک را می‌کشد. و اگر محمد (صلی الله علیه و سلم) در زمان آدم مبعوث شده بود، انبیاء و همه‌ی مردم تا روز قیامت تحت حکم شریعت او بودند، به صورت محسوس. و به همین دلیل، جز او کسی به صورت عام مبعوث نشد، بلکه او به صورت خاص مبعوث شد. پس او پادشاه (الملك) و سرور است، و هر رسول دیگری به سوی قوم مخصوصی مبعوث شد. بنابراین، رسالت هیچ‌یک از رسولان جز رسالت او (صلی الله علیه و سلم) فراگیر نشد. پس از زمان آدم (علیه السلام) تا زمان بعثت محمد (صلی الله علیه و سلم) تا روز قیامت، قلمرو (ملكه) و پیشی گرفتن او در آخرت بر همه‌ی رسولان و سیادت اوست، و این امر در صحیح از او منصوص است.\n\n### [روحانیت محمد با هر نبی و رسول]\n\nپس روحانیت او (صلی الله علیه و سلم) و روحانیت هر نبی و رسولی موجود است. و امداد از آن روح پاک به آنان می‌رسید، به واسطه‌ی آنچه از شرایع و علوم در زمان وجودشان به عنوان رسول آشکار می‌ساختند، و تشریع شرایع توسط او، مانند علی و معاذ و دیگران در زمان وجودشان و وجود او (صلی الله علیه و سلم)، و مانند الیاس و خضر (علیهما السلام) و عیسی (علیه السلام) در زمان ظهورش در آخرالزمان، که حاکم به شریعت محمد (صلی الله علیه و سلم) در امت اوست که در ظاهر مقرر شده است. اما چون وجود عینی او (صلی الله علیه و سلم) در عالم حس ابتدا مقدم نبود، هر شریعتی به کسی که با آن مبعوث شده بود، نسبت داده شد، در حالی که در حقیقت، آن شریعت محمد (صلی الله علیه و سلم) است، هرچند که از حیث عین (وجود ظاهری) مفقود بود و این امر دانسته نمی‌شد، همان‌گونه که اکنون و در زمان نزول عیسی (علیه السلام) و حکم به شریعت او، از حیث عین مفقود است.\n\n### [شریعت محمد ناسخ همه‌ی شرایع]\n\nو اما نسخ کردن خداوند همه‌ی شرایع را به واسطه‌ی شریعت او، این نسخ، شرایع پیشین را از اینکه جزو شریعت او باشند، خارج نمی‌سازد. زیرا خداوند در شریعت ظاهری که بر او (صلی الله علیه و سلم) در قرآن و سنت نازل شده، نسخ را به ما نشان داده است، با وجود اجماع و اتفاق ما بر اینکه آن منسوخ، شریعت اوست که با آن به سوی ما مبعوث شده است، پس متأخر، متقدم را نسخ کرد. این نسخ موجود در قرآن و سنت، تنبیهی برای ما بود بر اینکه نسخ او برای همه‌ی شرایع پیشین، آن‌ها را از اینکه شریعت او باشند، خارج نمی‌سازد. و نزول عیسی (علیه السلام) در آخرالزمان، در حالی که حاکم به غیر شریعت خود یا بخشی از آن که در زمان رسالتش بر آن بود، و حکم کردنش به شریعت محمدی که امروز مقرر است، دلیلی است بر اینکه امروز برای هیچ‌یک از انبیاء (علیهم السلام) حکمی نیست، با وجود آنچه او (صلی الله علیه و سلم) در شریعت خود مقرر کرده است. و در این حکم، آنچه اهل ذمه از اهل کتاب بر آن هستند نیز داخل می‌شود، مادامی که «الْجِزْيَةَ عَنْ يَدٍ وهُمْ صاغِرُونَ» (جزیه را با دست خود و در حال خواری) بپردازند، زیرا حکم شریعت بر احوال است.\n\n### [سیادت محمد بر همه‌ی بنی آدم]\n\nپس از مجموع این‌ها نتیجه می‌شود که او پادشاه (الملك) و سرور بر همه‌ی بنی آدم است، و همه‌ی کسانی که پیش از او بودند، قلمرو (ملكا) و تابع او بودند، و حاکمان در آن، نائبان او بودند. اگر گفته شود: پس فرموده‌ی او (صلی الله علیه و سلم) که «لا تفضلوني» (مرا برتری ندهید) چه می‌شود؟ پاسخ این است که ما او را برتری ندادیم، بلکه خداوند او را برتری داد، زیرا این کار از جانب ما نیست. و اگرچه آمده است: «أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ» (آنان کسانی هستند که خداوند هدایتشان کرده است، پس به هدایت آنان اقتدا کن) هنگامی که انبیاء (علیهم السلام) را ذکر کرد، این صحیح است، زیرا فرمود: «فَبِهُداهُمُ» (پس به هدایت آنان)، و هدایت آنان از جانب خداست و آن همان شریعت او (صلی الله علیه و سلم) است. یعنی شریعت خود را که نائبان تو با آن برای برپایی دین ظاهر شدند، لازم بدار و «لا تَتَفَرَّقُوا فِيهِ» (در آن تفرقه نکنید). پس نگفت: «فبهم اقتده» (پس به آنان اقتدا کن). و در فرموده‌ی او «ولا تَتَفَرَّقُوا فِيهِ» تنبیهی است بر یگانگی شرایع. و فرموده‌ی او: «اتَّبِعْ مِلَّةَ إِبْراهِيمَ» (از آیین ابراهیم پیروی کن)، که همان دین است. پس او مأمور به پیروی از دین است، زیرا دین تنها از جانب خداست نه از غیر او. و در فرموده‌ی او (علیه السلام) بنگرید: «لو كان موسى حيا ما وسعه إلا أن يتبعني» (اگر موسی زنده بود، چاره‌ای جز پیروی از من نداشت). پس پیروی را به خود نسبت داد، در حالی که خود او (صلی الله علیه و سلم) مأمور به پیروی از دین و هدایت انبیاء بود، نه پیروی از خود انبیاء. زیرا هنگامی که امام اعظم حاضر باشد، برای هیچ‌یک از نائبان او حکم الهی باقی نمی‌ماند. و اگر غایب باشد، نائبان به دستورات او حکم می‌کنند. پس او حاکم در غیب و شهود است. و ما این اخبار و تنبیهات را نیاوردیم مگر برای انس دادن کسی که این مرتبه را از کشف (الکشف) خود نمی‌شناسد و خداوند او را بر آن آگاه نساخته است.\n\n### [شواهد اهل الله]\n\nو اما اهل الله، آنان بر همان چیزی هستند که ما بر آنیم، و شواهد تحقیق از جانب پروردگارشان در نفوسشان برایشان بر این امر اقامه شده است. و اگرچه در مورد همه‌ی آنچه ذکر کردیم، احتمالات بسیاری متصور است، اما این به قوّتی بازمی‌گردد که الفاظ در اصل وضع خود می‌دهند، نه آنچه امر در نفس خود نزد اهل ذوق (اهل الأذواق) است که علم را از خداوند می‌گیرند، مانند خضر و امثال او. زیرا انسان سخنی می‌گوید و مثلاً یک معنا از معانی‌ای را که آن کلام در بر دارد، اراده می‌کند. پس اگر مفسر آن را به غیر مقصود متکلم از آن معانی تفسیر کند، در واقع تنها بخشی از آنچه را که قوّت لفظ می‌دهد، تفسیر کرده است، هرچند که به مقصود متکلم نرسیده باشد. آیا نمی‌بینی که چگونه فرموده‌ی خداوند متعال: «الَّذِينَ آمَنُوا ولَمْ يَلْبِسُوا إِيمانَهُمْ بِظُلْمٍ» (کسانی که ایمان آوردند و ایمان خود را به ظلمی نیامیختند) بر صحابه دشوار آمد؟ پس آن را به صورت نکره آورد، و آنان گفتند: کدام یک از ما ایمان خود را به ظلمی نیامیخته است؟ پس این صحابه، که عرب بودند و قرآن به زبان آنان نازل شد، مقصود حق (الحق) را از آیه نشناختند، در حالی که آنچه آنان در نظر گرفتند، در کلمه جایز و غیر قابل انکار بود.\n\nپس پیامبر (صلی الله علیه و سلم) به آنان فرمود: «ليس الأمر كما ظننتم وإنما أراد الله بالظلم هنا ما قالَ لُقْمانُ لِابْنِهِ وهُوَ يَعِظُهُ يا بُنَيَّ لا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ» (امر آن‌گونه که گمان کردید نیست، بلکه خداوند در اینجا از ظلم، همان را اراده کرده که لقمان به پسرش گفت در حالی که او را موعظه می‌کرد: ای پسرک من، به خدا شرک نورز، همانا شرک ظلمی بزرگ است). قوّت کلمه هر ظلمی را شامل می‌شود، اما قصد متکلم تنها ظلم معین و مخصوصی است. همچنین، آنچه ما از اخبار در مورد اینکه بنی آدم رعیت (سوقة) و قلمرو (ملك) این سرور، محمد (صلی الله علیه و سلم) هستند، آوردیم، همان مقصود از طریق کشف (الکشف) است، همان‌گونه که ظلم در آنجا، مقصود متکلم، خصوص شرک بود. و به همین دلیل، تفاسیر در کلام با قرائن احوال تقویت می‌شوند، زیرا قرائن، معانی مقصود متکلم را متمایز می‌سازند. پس چگونه است حال کسی که کشف (الکشف) الهی و علم لدنی ربانی دارد؟ بنابراین، بر عاقل منصف لازم است که آنچه را این قوم خبر می‌دهند، بپذیرد. اگر در آن راستگو باشند، این همان گمان نیک به آنان است و با تسلیم انصاف ورزیده‌اند، زیرا تسلیم‌شونده آنچه را که حق در نفس امر است، رد نکرده است. و اگر راستگو نباشند، به تسلیم‌شونده ضرری نمی‌رسد، بلکه سود برده‌اند، زیرا از فرو رفتن در آنچه قطعیت ندارند، دست کشیده‌اند و علم آن را به خداوند متعال بازگردانده‌اند. پس حق ربوبیت را ادا کرده‌اند، زیرا آنچه اولیاء الله گفته‌اند، ممکن است، و تسلیم در هر صورت اولی است.\n\n### [دوره‌ی پادشاهی]\n\nو این دوره‌ی پادشاهی (دورة الملك) که ما به آن تمایل یافتیم، دیگران نیز آن را گفته‌اند، مانند امام ابوالقاسم بن قسی در کتاب *خلع النعلین*، و این روایت ما از پسر او از اوست، و او از سادات قوم بود. و شیخ او که کشف (الکشف) بر دستان او برایش حاصل شد، از بزرگ‌ترین شیوخ مغرب بود که به او ابن خلیل از اهل لبلة می‌گفتند. پس ما در هر آنچه ذکر می‌کنیم، تنها بر آنچه خداوند از آن نزد ما القا می‌کند، اعتماد می‌کنیم، نه بر وجوهی که الفاظ احتمال می‌دهند. و گاهی ممکن است همه‌ی احتمالات در برخی کلام‌ها مقصود متکلم باشد، پس ما به همه‌ی آن‌ها قائل می‌شویم. پس دوره‌ی پادشاهی (دورة الملك) عبارتی است از آنچه خداوند از آدم تا زمان محمد (صلی الله علیه و سلم) از ترتیبات در این نشأت انسانی، با آنچه از احکام الهی در آن ظاهر شد، آماده ساخت. پس آنان خلفای خلیفه‌ی سرور بودند. اولین موجودی که از اجسام انسانی ظاهر شد، آدم (علیه السلام) بود، و او پدر اول این جنس است، و سایر پدران اجناس، ان‌شاءالله پس از این باب خواهد آمد. و او اولین کسی است که به حکم خدا از این جنس ظاهر شد، اما همان‌گونه که مقرر کردیم، سپس از او پدری دوم برای ما جدا شد که آن را مادر نامید. پس برای این پدر اول، درجه‌ای که بر آن است، به دلیل اصل بودن برای آن، صحیح است. پس نائبان دوره‌ی پادشاهی (دورة الملك) با همان چیزی که آغاز شد، ختم شدند تا تنبیه شود که فضل به دست خداست و آن امر را پدر اول به ذات خود اقتضا نکرده است. پس عیسی را از مریم به وجود آورد. پس مریم منزلت آدم را یافت و عیسی منزلت حواء را. پس همان‌گونه که مؤنثی از مذکر به وجود آمد، مذکری نیز از مؤنث به وجود آمد. پس با همان چیزی که آغاز شد، ختم شد، در ایجاد پسری بدون پدر، همان‌گونه که حواء بدون مادر بود. پس عیسی و حواء برادر بودند و آدم و مریم پدر و مادر برای آن دو.\n\n### [مَثَل عیسی نزد خداوند مانند مَثَل آدم است]\n\n«إِنَّ مَثَلَ عِيسى‏ عِنْدَ الله كَمَثَلِ آدَمَ» (همانا مَثَل عیسی نزد خداوند، مانند مَثَل آدم است). پس تشبیه را در نبود پدریِ مذکر قرار داد، به این دلیل که آن را دلیلی برای عیسی در برائت مادرش قرار دهد. و تشبیه را به حواء قرار نداد، اگرچه امر بر آن بود، زیرا زن محل تهمت برای وجود حمل است، چرا که محلی برای زایمان قرار داده شده است، در حالی که مرد محل آن نیست. و مقصود از دلایل، رفع شک و شبهه است. و در مورد حواء از آدم، اشتباهی رخ نمی‌دهد، زیرا آدم محل آنچه از او صادر شده (ولادت) نیست. و این دلیل تنها نزد کسی دلیل است که وجود آدم و تکوین او و تکوین از او نزدش ثابت شده باشد. و همان‌گونه که پسری بدون پدر معهود نیست، پسری بدون مادر نیز معهود نیست. پس مَثَل از طریق معنا این است که عیسی مانند حواء است، اما چون از جانب منکر، شبهه در آن راه می‌یافت، به دلیل اینکه مؤنث، همان‌گونه که گفتیم، محل آنچه از او صادر شده است، می‌باشد و به همین دلیل تهمت وجود داشت، تشبیه به آدم بود تا برائت مریم از آنچه در عادت ممکن است، حاصل شود. پس ظهور عیسی بن مریم بدون پدر، مانند ظهور حواء از آدم بدون مادر است، و او پدر دوم است.\n\n### [جدایی حواء از آدم]\n\nو هنگامی که حواء از آدم جدا شد، جایگاه او در آدم با شهوت نکاحی به سوی حواء آباد شد، که به واسطه‌ی آن، غشیان (آمیزش) برای ظهور تناسل و توالد رخ داد. و هوای خارج شده‌ای که جایگاه حواء را آباد کرد، جسم حواء بود هنگام خروجش، زیرا در عالم خلأ (خلاء) وجود ندارد. پس آن جزء هوایی، جایگاه خود را که حواء با شخصیت خود گرفته بود، طلب کرد. پس آدم را برای طلب جایگاهش به حرکت درآورد، و آن را آباد شده با حواء یافت، پس بر او واقع شد. هنگامی که با او آمیزش کرد، از او باردار شد و ذریه را آورد. پس این امر سنتی جاری در حیوانات از بنی آدم و غیر آن به طور طبیعی باقی ماند. اما انسان، کلمه‌ی جامع و نسخه‌ی عالم است. پس هر آنچه در عالم است، جزئی از اوست، در حالی که انسان جزئی از هیچ‌یک از عالم نیست. و سبب این جدایی و ایجاد این جداشده‌ی اول، طلب انس با مشابه در جنس بود که همان نوع اخص است، و تا در عالم اجسام، به واسطه‌ی این پیوستگی طبیعی انسانی کامل به صورت، آنچه خداوند اراده کرده است، شبیه قلم اعلی و لوح محفوظ باشد که از آن به عقل اول و نفس کل تعبیر می‌شود. و هنگامی که قلم اعلی را می‌گویی، به اشاره‌ای که شامل نویسنده و قصد نوشتن است، توجه کن، تا معنای فرموده‌ی شارع که «إن الله خلق آدم على صورته» (خداوند آدم را بر صورت خود آفرید) برایت حاصل شود.\n\n### [کُن و کَوْن]\n\nسپس عبارت شارع در کتاب عزیز (قرآن) در ایجاد اشیاء، از «كُنْ» (باش) است. پس دو حرف آورد که به منزله‌ی دو مقدمه هستند، و آنچه هنگام «كُنْ» حاصل می‌شود، نتیجه است. و این دو حرف، ظاهر هستند، و سومی که رابط میان دو مقدمه است، در «كُنْ» پنهان است، و آن واو محذوف به دلیل التقای ساکنین است. همچنین، هنگامی که مرد و زن به هم می‌رسند، برای قلم (آلت تناسلی) عین ظاهری باقی نمی‌ماند. پس انداختن نطفه در رحم، غیبی است، زیرا سرّ است. و به همین دلیل، در زبان از نکاح به سرّ تعبیر شده است. خداوند متعال می‌فرماید: «ولكِنْ لا تُواعِدُوهُنَّ سِرًّا» (ولی با آنان وعده‌ی پنهانی نگذارید). و همچنین هنگام القاء، هر دو از حرکت باز می‌ایستند و می‌توان قلم را پنهان کرد، همان‌گونه که حرف سوم که واو است، از «كُنْ» به دلیل ساکن بودن پنهان شد. و واو بود، زیرا برای آن علو است، چون از رفع (ضمه) متولد می‌شود که اشباع ضمه است و از حروف عله است.\n\n### [اولین جداشده و آخرین جداشده در دوره‌ی پادشاهی]\n\nو این مطلبی که ذکر کردیم، تنها در صورتی است که پادشاهی (الملك) به طور خاص عبارت از انسان‌ها باشد. اما اگر به سیادت او بر همه‌ی آنچه غیر حق (الحق) است بنگریم، همان‌گونه که برخی بدان رفته‌اند، به دلیل حدیث مروی که خداوند می‌فرماید: «لولاك يا محمد ما خلقت سماء ولا أرضا ولا جنة ولا نارا» (ای محمد، اگر تو نبودی، نه آسمان را می‌آفریدم و نه زمین را، نه بهشت را و نه دوزخ را)، و خلق هر آنچه غیر خداست را ذکر کرد، در این صورت اولین جداشده (منفصل) در آن، نفس کلیه از اولین موجود که عقل اول است، خواهد بود. و آخرین جداشده در آن، حواء از آخرین موجود یعنی آدم است. زیرا انسان آخرین موجود از اجناس عالم است. در عالم تنها شش جنس وجود دارد، و زیر هر جنسی انواعی و زیر انواع، انواعی دیگر است. جنس اول، مَلَک (فرشته) است، دوم، جن، سوم، معدن، چهارم، نبات، و پنجم، حیوان. و پادشاهی (الملك) به پایان رسید و آماده و مستوی شد. و جنس ششم، جنس انسان بود که خلیفه‌ی این قلمرو (المملكة) است. و تنها به این دلیل آخر از همه به وجود آمد که حقیقتاً امام بالفعل باشد، نه بالقوه و صلاحیت. پس هنگامی که عین او به وجود آمد، جز به صورت والی و سلطان مورد توجه، به وجود نیامد. سپس هنگامی که نشأت جسد او به تأخیر افتاد، برای او نائبان قرار داد. پس اولین نائب و خلیفه‌ی او، آدم (علیه السلام) بود. سپس نسل متولد شد و متصل گشت و در هر زمان خلفایی تعیین شدند تا زمانی که نشأت جسم پاک محمد (صلی الله علیه و سلم) فرا رسید. پس مانند خورشید درخشان ظاهر شد، و هر نوری در نور ساطع او مستتر گشت، و هر حکمی در حکم او پنهان شد، و همه‌ی شرایع تسلیم او شدند، و سیادت او که باطنی بود، آشکار گشت. پس «هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ وهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ» (اوست اول و آخر و ظاهر و باطن، و او به هر چیزی داناست). زیرا او فرمود: «أوتيت جوامع الكلم» (جوامع کلمات به من عطا شده است). و از پروردگارش نقل کرد: «ضرب بيده بين كتفي فوجدت برد أنامله بين ثديي فعلمت علم الأولين والآخرين» (با دست خود میان دو کتفم زد، پس سردی انگشتانش را میان دو سینه‌ام یافتم، و علم اولین و آخرین را دانستم). پس تخلق و نسبت الهی از فرموده‌ی خداوند متعال درباره‌ی خود: «هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ وهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ» برای او حاصل شد. و این آیه در سوره‌ی حدید آمده است که «فِيهِ بَأْسٌ شَدِيدٌ ومَنافِعُ لِلنَّاسِ» (در آن سختی شدید و منافعی برای مردم است). به همین دلیل، او با شمشیر مبعوث شد و «رَحْمَةً لِلْعالَمِينَ» (رحمتی برای جهانیان) فرستاده شد. و هر جداشده‌ای (منفصل) از چیزی، جایگاهی را که از آن جدا شده، آباد کرده است. و ما گفتیم که در عالم خلأ (خلاء) وجود ندارد. پس جایگاه انفصال خود را با سایه‌اش آباد کرد، زیرا انفصال او به سوی نور بود و او برای ظهور است. پس هنگامی که با ذات خود با نور مقابله کرد، سایه‌اش امتداد یافت و جایگاه انفصالش را آباد کرد. پس کسی که از او جدا شد، او را از دست نداد. پس او برای کسی که به سویش جدا شده، مشهود است و برای کسی که از او جدا شده، نیز مشهود است. و این همان معنایی است که گوینده با این سخن اراده کرده است: (شهدتك موجودا بكل مكان) (تو را در هر مکانی موجود دیدم). پس از اسرار عالم این است که هیچ چیزی حادث نمی‌شود مگر اینکه سایه‌ای دارد که برای خدا سجده می‌کند تا عبادت پروردگارش را در هر حال به جا آورد، خواه آن امر حادث مطیع باشد یا عاصی. اگر از اهل موافقت باشد، او و سایه‌اش یکسان هستند، و اگر مخالف باشد، سایه‌اش به جای او در طاعت خدا قیام می‌کند. خداوند متعال می‌فرماید: «وظِلالُهُمْ بِالْغُدُوِّ والْآصالِ» (و سایه‌هایشان در بامدادان و شامگاهان).\n\n### [سلطان سایه‌ی خدا در زمین است]\n\nسلطان، سایه‌ی خدا در زمین است، زیرا ظهور او به همه‌ی صور اسماء الهی است که در عالم دنیا اثر دارند. و عرش، سایه‌ی خدا در آخرت است. پس سایه‌ها همیشه تابع صورتی هستند که از آن منبعث شده‌اند، چه حسی و چه معنوی. حس، قاصر است و قوّت سایه‌ی معنوی برای صورت معنوی را ندارد، زیرا نور مقیدی را می‌طلبد، به دلیل تقیید و تنگی و عدم وسعتی که در حس وجود دارد. و به همین دلیل، ما بر سایه‌ی معنوی با آنچه در شریعت آمده است که سلطان سایه‌ی خدا در زمین است، تنبیه کردیم. پس برای تو آشکار شد که مکان‌ها با سایه‌ها آباد شده‌اند. در اینجا ما بخشی از آنچه شایسته‌ی این باب است را ذکر کردیم و از ترس طولانی شدن، در آن تعمق نکردیم. و آنچه آوردیم، برای کسی که تنبه یابد، اگر دارای فهم سلیم باشد، کافی است، و تذکری است برای کسی که شهود (الشهود) و علم یافته و به آنچه بالاتر است مشغول شده یا از آنچه پایین‌تر است غفلت ورزیده است، تا هنگام نظر در این باب به آنچه ذکر کردیم بازگردد.\n\n### (فصل) [مراتب اهل فترت]\n\nو اما مرتبه‌ی عالمی که میان عیسی (علیه السلام) و محمد (صلی الله علیه و سلم) است، که همان اهل فترت (زمان انقطاع وحی) هستند، آنان بر مراتب مختلفی قرار دارند، بر حسب آنچه از اسماء الهی بر آنان تجلی (التجلی) می‌کند، چه با علم آنان به آن و چه بدون علم. پس برخی از آنان، خداوند را به واسطه‌ی آنچه هنگام فکر کردن بر قلبشان تجلی کرد، توحید کردند، و او صاحب دلیل است. «فَهُوَ عَلى‏ نُورٍ من رَبِّهِ» (پس او بر نوری از پروردگارش است) که به دلیل فکرش با کَوْن آمیخته شده است. پس این شخص به تنهایی امتی برانگیخته می‌شود، مانند قُسّ بن ساعده و امثال او، زیرا او در خطبه‌ی خود چیزی را ذکر کرد که بر این دلالت دارد، چرا که مخلوقات و اعتبار در آن‌ها را ذکر کرد، و این همان فکر است. و برخی از آنان، خداوند را با نوری که در قلب خود یافتند و نمی‌توانستند آن را دفع کنند، توحید کردند، بدون فکر و تأمل و نظر و استدلال. پس آنان بر نوری خالص از پروردگارشان هستند که با کَوْن آمیخته نشده است. اینان به صورت پنهان و بی‌گناه محشور می‌شوند. و برخی از آنان، به دلیل شدت نور و صفای سرّشان و خلوص یقینشان، بر منزلت محمد (صلی الله علیه و سلم) و سیادت و عموم رسالت باطنی او از زمان آدم تا زمان این مکاشف، در نفسشان القا شد و از کشف (الکشف) خود بر آن مطلع شدند. پس در عالم غیب به او ایمان آوردند، بر اساس شهادت (الشهود) و بینه‌ای از پروردگارشان، و آن فرموده‌ی خداوند متعال است: «أَ فَمَنْ كانَ عَلى‏ بَيِّنَةٍ من رَبِّهِ ويَتْلُوهُ شاهِدٌ مِنْهُ» (آیا کسی که بر بینه‌ای از پروردگارش است و شاهدی از او به دنبالش می‌آید). این شاهد در قلب او به صدق آنچه بر او مکاشفه شده، گواهی می‌دهد. پس این شخص در روز قیامت در زمره‌ی برگزیدگان خلق و در باطنیه‌ی محمد (صلی الله علیه و سلم) محشور می‌شود. و برخی از آنان، از ملت حقی که پیش از او بودند، پیروی کردند، مانند کسی که یهودی یا نصرانی شد، یا از آیین ابراهیم یا از آیین یکی از انبیاء پیروی کرد، هنگامی که دانست و آگاه شد که آنان رسولانی از جانب خدا هستند که طایفه‌ی مخصوصی را به حق دعوت می‌کنند. پس از آنان پیروی کرد و به آنان ایمان آورد و روش‌های آنان را پیمود، و آنچه را آن رسول حرام کرده بود، بر خود حرام کرد و نفس خود را با شریعت او در برابر خدا به عبادت واداشت، اگرچه این امر بر او واجب نبود، زیرا آن رسول به سوی او مبعوث نشده بود. پس این شخص در روز قیامت با کسی که از او پیروی کرده، محشور می‌شود و در زمره‌ی او در ظاهر متمایز می‌گردد، زیرا شریعت آن نبی در ظاهر مقرر شده بود. و برخی از آنان، در کتب انبیاء، شرف محمد (صلی الله علیه و سلم) و دین او و ثواب پیروانش را مطالعه کردند، پس با علم به او ایمان آوردند و تصدیق کردند، اگرچه وارد شریعت هیچ نبی پیشینی نشدند و مکارم اخلاق را به جا آوردند. این شخص نیز در زمره‌ی مؤمنین به محمد (صلی الله علیه و سلم) محشور می‌شود، پس به او ایمان آورده و دو پاداش دارد. و همه‌ی اینان نزد خداوند سعادتمند هستند. و برخی از آنان، تعطیل کردند (منکر شدند) و به وجود اقرار نکردند، به دلیل نظری قاصر، که آن قصور در نظر او نهایت قوّت اوست، به دلیل ضعفی در مزاجش نسبت به قوّت دیگری. و برخی از آنان، تعطیل کردند، نه از روی نظر، بلکه از روی تقلید، پس او شقی مطلق است. و برخی از آنان، شرک ورزیدند، از روی نظری که در آن راه حق را به خطا رفتند، با وجود بذل نهایت تلاشی که قوّتشان به آنان می‌داد. و برخی از آنان، شرک ورزیدند، نه از روی استقصای نظر، پس او شقی است. و برخی از آنان، شرک ورزیدند، از روی تقلید، پس او شقی است. و برخی از آنان، پس از اثبات، تعطیل کردند، از روی نظری که در آن به نهایت قوّتی که بر آن بود، رسید، به دلیل ضعف آن قوّت. و برخی از آنان، پس از اثبات، تعطیل کردند، نه از روی استقصا در نظر یا تقلید، پس او شقی است. پس همه‌ی این‌ها مراتب اهل فترت هستند که در این باب ذکر کردیم."
  },
  "page_count": 5
}