{
  "id": 45,
  "title": {
    "ar": "الباب الخامس والأربعون في معرفة من عاد بعد ما وصل ومن جعله يعود",
    "en": "Chapter Forty-Five: Concerning the Gnosis of him who returned after attaining arrival, and the one who caused him to return.",
    "ur": "باب پینتالیس: اس شخص کی معرفت میں جو وصول (وصول) کے بعد واپس لوٹا، اور اس کی معرفت میں جس نے اسے واپس لوٹنے پر مجبور کیا۔",
    "fa": "باب چهل و پنجم در معرفت کسی که پس از وصول بازگشت و کسی که او را بازگرداند"
  },
  "content": {
    "ar": "## (الباب الخامس والأربعون في معرفة من عاد بعد ما وصل ومن جعله يعود)\n\n\n> وجودك عن تدبير أمر محقق *** وتفصيل آيات لو أنك تعقل‏\n\n\n> فيا أيها الإنسان ما غر ذاتكم *** برب يرى الأشياء تعلو وتسفل‏\n\n\n> فإن كنت ذا عقل وفهم وفطنة *** علمت الذي قد كنت بالأمس تجهل‏\n\n\n> وذلك أن تدري بأنك قابل *** لقرب وبعد بالذي أنت تعمل‏\n\n\n> فخف رب تدبير وتفصيل مجمل *** فذاك الذي بالعبد أولى وأجمل‏\n\n\n> إذا كان هذا حالك اليوم دائبا *** لعل بشارات بسعدك تحصل‏\n\n\n> فإن جلال الحق يعظم قدره *** وفي الخلق يقضي ما يشاء ويفصل‏\n\n\n> إذا أخذ المولى قلوب عباده *** إليه ويقضي ما يشاء ويعدل‏\n\n\n> فمن شاء أبقاه لديه مكرما *** ورد الذي قد شاء لما كان يأمل‏\n\n\n> وذاك نبي أو رسول ووارث *** وما ثم إلا هؤلاء فأجملوا\n\n\n> ولم يبق إلا واحد وهو وارث *** والاثنان قد راحا فما لك تعدل‏\n\n\n> فسبحان من خص الولي براحة *** ليغبطه فيها الذي هو أفضل‏\n\n\n### [الرسالة والولاية والوراثة الكاملة]\n\n\nقال رسول الله صلى الله عليه وسلم العلماء ورثة الأنبياء وإن الأنبياء ما ورثوا دينارا ولا درهما ورثوا العلم‏\n\n\nولما كانت حالته صلى الله عليه وسلم في ابتداء أمره صلى الله عليه وسلم إن الله تعالى وفقه لعبادته بملة إبراهيم الخليل عليه السلام‏\nفكان يخلو بغار حراء يتحنث فيه عناية من الله سبحانه به صلى الله عليه وسلم إلى أن فجأه الحق فجاءه الملك فسلم عليه بالرسالة وعرفه بنبوته فلما تقررت عنده أرسل إلى الناس كافة بَشِيراً ونَذِيراً وداعِياً إِلَى الله بِإِذْنِهِ وسِراجاً مُنِيراً فبلغ الرسالة وأدى الأمانة ودعا إلى الله عز وجل عَلى‏ بَصِيرَةٍ فالوارث الكامل من الأولياء منا من انقطع إلى الله بشريعة رسول الله صلى الله عليه وسلم إلى أن فتح الله له في قلبه في فهم ما أنزل الله عز وجل على نبيه ورسوله محمد صلى الله عليه وسلم بتجل إلهي في باطنه فرزقه الفهم في كتابه عز وجل وجعله من المحدثين في هذه الأمة فقام له هذا مقام الملك الذي جاء إلى رسول الله صلى الله عليه وسلم ثم رده الله إلى الخلق يرشدهم إلى صلاح قلوبهم مع الله ويفرق لهم بين الخواطر المحمودة والمذمومة ويبين لهم مقاصد الشرع وما ثبت من الأحكام عن رسول الله صلى الله عليه وسلم وما لم يثبت بإعلام من الله أتاه رحمة من عنده وعلمه من لدنه علما فيرقى هممهم إلى طلب الأنفس بالمقام الأقدس ويرغبهم فيما عند الله كما فعل رسول الله صلى الله عليه وسلم في تبليغ رسالته غير إن الوارث لا يحدث شريعة ولا ينسخ حكما مقررا لكن يبين فإنه عَلى‏ بَيِّنَةٍ من رَبِّهِ وبصيرة في علمه ويَتْلُوهُ شاهِدٌ مِنْهُ بصدق اتباعه وهو الذي أشركه الله تعالى مع رسوله صلى الله عليه وسلم في الصفة التي يدعو بها إلى الله فأخبر وقال أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي وهم الورثة فهم يدعون إلى الله على بصيرة وكذلك شركهم مع الأنبياء عليهم السلام في المحنة وما ابتلوا به فقال إِنَّ الَّذِينَ يَكْفُرُونَ بِآياتِ الله ويَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّ ويَقْتُلُونَ الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ من النَّاسِ وهم الورثة فشرك بينهم في البلاء كما شرك بينهم في الدعوة إلى الله‏\n\n\n### [صفة الكمال في الوراثة النبوية]\n\n\nفكان شيخنا أبو مدين رضي الله عنه كثيرا ما يقول من علامات صدق المريد في إرادته فراره عن الخلق وهذه حالة الرسول صلى الله عليه وسلم في خروجه وانقطاعه عن الناس في غار حراء للتحنث ثم يقول ومن علامات صدق فراره عن الخلق وجوده للحق فما زال رسول الله صلى الله عليه وسلم يتحنث في انقطاعه حتى فجأه الحق ثم قال ومن علامات صدق وجوده للحق رجوعه إلى الخلق يريد حالة بعثه صلى الله عليه وسلم بالرسالة إلى الناس ويعني في حق الورثة بالإرشاد وحفظ الشريعة عليهم فأراد الشيخ بهذا صفة الكمال في الورث النبوي فإن لله عبادا إذا فجأهم الحق أخذهم إليه ولم يردهم إلى العالم وشغلهم به وقد وقع هذا كثيرا ولكن كمال الورث النبوي الرسالي في الرجوع إلى الخلق فإن اعترضك هنا قول أبي سليمان الداراني لو وصلوا ما رجعوا إنما ذلك فيمن رجع إلى شهواته الطبيعية ولذاته وما تاب منه إلى الله وأما الرجوع إلى الله تعالى بالإرشاد فلا يقول لو لاح لهم بارقة من الحقيقة ما رجعوا إلى ما تابوا إلى الله منه ولو رأوا وجه الحق فيه فإن موطن التكليف والأدب يمنعهم من ذلك وأما قول الآخر من أكابر الرجال لما قيل له فلان يزعم أنه وصل فقال إلى سقر فإنه يريد بهذا أنه من زعم أن الله محدود يوصل إليه وهو القائل وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ أو ثم أمر إذا وصل إليه سقطت عنه الأعمال المشروعة وأنه غير مخاطب بها مع وجود عقل التكليف عنده وإن ذلك الوصول أعطاه ذلك فهو هذا الذي قال فيه الشيخ إلى سقر أي هذا لا يصح بل الوصول إلى الله بقطع كل ما دونه حتى يكون الإنسان يأخذ عن ربه فهذا لا تمنعه الطائفة بلا خلاف‏\n\n\n### [الرجوع إلى الخلق قبل الوصول إلى الحق‏]\n\n\nوكان شيخنا أبو يعقوب يوسف بن يخلف الكومي يقول بيننا وبين الحق المطلوب عقبة كئود ونحن في أسفل العقبة من جهة الطبيعة فلا نزال نصعد في تلك العقبة حتى نصل إلى أعلاها فإذا استشرفنا على ما وراءها من هناك لم نرجع فإن وراءها ما لا يمكن الرجوع عنه وهو قول أبي سليمان الداراني لو وصلوا ما رجعوا يريد إلى رأس العقبة فمن رجع من الناس إنما رجع من قبل الوصول إلى رأس العقبة والإشراف على ما وراءها فالسبب الموجب للرجوع مع هذا إنما هو طلب الكمال ولكن لا ينزل بل يدعوهم من مقامه ذلك وهو قوله عَلى‏ بَصِيرَةٍ فيشهد فيعرف المدعو على شهود محقق والذي لم يرد ماله وجه إلى العالم فيبقى هناك واقفا وهو أيضا المسمى بالواقف فإنه ما وراء تلك العقبة تكليف ولا ينحدر منها إلا من مات إلا أنه منهم أعني من الواقفين من يكون مستهلكا فيما يشاهده هنالك وقد وجد منهم جماعة وقد دامت هذه الحالة على أبي يزيد البسطامي وهذا كان حال أبي عقال المغربي وغيره‏\n\n\n### [مراتب الواصلين إلى الله‏]\n\n\nواعلم أنه بعد ما أعلمتك ما معنى الوصول إلى الله أن الواصلين على مراتب منهم من يكون وصوله إلى اسم ذاتي لا يدل إلا على الله تعالى من حيث هو دليل على الذات كالاسماء الأعلام عندنا لا تدل على معنى آخر مع‏\nذلك يعقل فهذا يكون حاله الاستهلاك كالملائكة المهيمن في جلال الله تعالى والملائكة الكروبيين فلا يعرفون سواه ولا يعرفهم سواه سبحانه ومنهم من يصل إلى الله من حيث الاسم الذي أوصله إلى الله أو من حيث الاسم الذي يتجلى له من الله ويأخذه من الاسم الذي أوصله إليه سبحانه ثم إن هذين الرجلين المذكورين أو الشخصين فإنه قد يكون منهم النساء إذا وصلوا فإن كان وصولهم من حيث الاسم الذي أوصلهم فشاهدوه فكان لهم عين يقين فلا يخلو ذلك الاسم إما أن يطلب صفة فعل كخالق وبارئ أو صفة صفة كالشكور والحسيب أو صفة تنزيه كالغني فيكون بحسب ما تعطيه حقيقة ذلك الاسم ومن ثم يكون مشربه وذوقه وريه ووجوده لا يتعداه فيكون الغالب عليه عندنا في حاله ما تعطيه حقيقة ذلك الاسم الإلهي فتضيفه إليه وبه تدعوه فتقول عبد الشكور وعبد الباري وعبد الغني وعبد الجليل وعبد الرزاق وإن كان وصولهم إلى اسم غير الاسم الذي أوصلهم فإنه يأتي بعلم غريب لا يعطيه حاله بحسب ما تعطيه حقيقة ذلك الاسم فيتكلم بغرائب العلم في ذلك المقام وقد يكون في ذلك العلم ما ينكره عليه من لا علم له بطريق القوم ويرى الناس أن علمه فوق حاله وهو عندنا أعلى من الذي وصل إلى مشاهدة الاسم الذي أوصله فإن هذا لا يأتي بعلم غريب لا يناسب حاله فيرى الناس أن علمه تحت حاله ودونه يقول أبو يزيد البسطامي رضي الله عنه العارف فوق ما يقول والعالم تحت ما يقول فبهذا قد حصرنا لك مراتب الواصلين فمنهم من يعود ومنهم من لا يعود\n\n\n### [أقسام الراجعين من الحق إلى الخلق‏]\n\n\nثم إن الراجعين على قسمين منهم من يرجع اختيارا كأبي مدين ومنهم من يرجع اضطرارا مجبورا كأبي يزيد لما خلع عليه الحق الصفات التي بها ينبغي أن يكون وارثا وراثة إرشاد وهداية خطا خطوة من عنده فغشي عليه فإذا النداء ردوا على حبيبي فلا صبر له عني فمثل هذا لا يرغب في الخروج إلى الناس وهو صاحب حال وأما العالي من الرجال وهم الأكابر وهم الذين ورثوا من رسول الله صلى الله عليه وسلم عبوديته فإن أمروا بالتبليغ فيحتالون في ستر مقامهم عن أعين الناس ليظهروا عند الناس بما لا يعلمون في العادة أنهم من أهل الاختصاص الإلهي فيجمعون بين الدعوة إلى الله وبين ستر المقام فيدعونهم بقراءة الحديث وكتب الرقائق وحكايات كلام المشايخ حتى لا تعرفهم العامة إلا أنهم نقلة لا أنهم يتكلمون عن أحوالهم من مقام القربة هذا إذا كانوا مأمورين ولا بد وإن لم يكونوا مأمورين بذلك فهم مع العامة التي لم تزل مستورة الحال لا يعتقد فيهم خير ولا شر\n\n\n### [الرجال الواصلون وفتوحاتهم في عالم المناسبات‏]\n\n\nثم إن من الرجال الواصلين من لا يكشف لهم عن العلم بالأسماء الإلهية التي تدبرهم ولكن لهم نظر إلى الأعمال المشروعة التي يسلكون بها وهي ثمانية يد ورجل وبطن ولسان وسمع وبصر وفرج وقلب ما ثم غير ذلك فهؤلاء يفتح لهم عند وصولهم في عالم المناسبات فينظرون فيما يفتح لهم عند الوصول إلى الباب الذي قرعوه فعند ما يفتح لهم يعرفون فيما يتجلى لهم من الغيب أي باب ذلك الباب الذي فتح لهم فإن كان المشهود لهم يطلب اليد بمناسبة تظهر لهم كان صاحب يد وإن كان يطلب البصر بمناسبة كان صاحب بصر وهكذا جميع الأعضاء ومن ذلك الجنس تكون كراماته إن كان وليا ومعجزاته إن كان نبيا ومن ذلك الجنس تكون منازله ومعارفه كما\n\n\nأشار إلى ذلك رسول الله صلى الله عليه وسلم فيمن يتوضأ فيسبغ الوضوء ثم يركع ركعتين لا يحدث نفسه فيهما بشي‏ء فتحت له الثمانية الأبواب من الجنة يدخل من أيها شاء\n\n\nكذلك هذا الشخص يفتح له من أعمال أعضائه إذا كملت طهارته وصفا سره أي شي‏ء كان مما تعطيه أعمال أعضائه المكلفة وقد بينا هذه المراتب العملية على الأعضاء في كتاب مواقع النجوم‏\n\n\n### [الرجال الواصلون وإمداداتهم من الأنوار الثمانية]\n\n\nثم إن الله سبحانه يمدهم من الأنوار بما يناسبهم وهي ثمانية من حضرة النور فمنهم من يكون إمداده من نور البرق وهو المشهد الذاتي وهو على ضربين خلب وغير خلب فإن لم ينتج مثل صفات التنزيه فهو البرق الخلب وإن أنتج ولا ينتج إلا أمرا واحدا لأنه ليس لله صفة نفسية سوى واحدة هي عين ذاته لا يصح أن تكون اثنان فإن اتفق أن يحصل له من هذا النور البرقي في بعض كشف تعريف إلهي لا يكون برق خلب ومنهم من يكون إمداده من حضرة النور نور الشمس ومنهم من يكون إمداده من نور البدر ومنهم من يكون إمداده من نور القمر ومنهم من يكون إمداده من نور الهلال ومنهم من يكون إمداده من نور السراج ومنهم من يكون إمداده من نور النجوم ومنهم من يكون إمداده من نور النار وما ثم نور أكثر وقد ذكرنا مراتب هذه‏\nالأنوار في مواقع النجوم أيضا فيكون إدراكهم على قدر مراتب أنوارهم فتتميز المراتب بتمييز الأنوار وتتميز الرجال بتمييز المراتب‏\n\n\n### [الواصلون من الأولياء إلى حقائق الأنبياء]\n\n\nومن الرجال الواصلين من ليس لهم معرفة بهذا المقام ولا بالأسماء الإلهية ولكن لهم وصول إلى حقائق الأنبياء ولطائفهم فإذا وصلوا فتح لهم باب من لطائف الأنبياء على قدر ما كانوا عليه من الأعمال في وقت الفتح فمنهم من يتجلى له حقيقة موسى عليه السلام فيكون موسوي المشهد ومنهم من يتجلى له لطيفة عيسى وهكذا سائر الرسل فينسب إلى ذلك الرسول بالوراثة ولكن من حيث شريعة محمد صلى الله عليه وسلم المقررة من شرع ذلك النبي الذي تجلى له فيجد هذا الواصل أنه كان محققا في عمله الموجب لفتحه من جهة ظاهره أو باطنه شرع نبي متقدم مثل قوله تعالى أَقِمِ الصَّلاةَ لِذِكْرِي فإن ذلك من شرع موسى وقرره الشارع لنا فيمن خرج عنه وقت الصلاة بنوم أو نسيان فهؤلاء يأخذون من لطائف الأنبياء عليهم السلام ولقينا منهم جماعة وليس لهؤلاء في الأنوار ولا في الأعضاء ولا في الأسماء الإلهية ذوق ولا شرب ولا شرب ومن الواصلين أيضا إلى الله تعالى الوصول الذي بيناه من يجمع الله له الجميع ومنهم من يكون له من ذلك مرتبتان وأكثر على قدر رزقه الذي قسمه الله له منه وكل إنسان من هؤلاء إذا رد إلى الخلق بالإرشاد والهداية لا يتعدى ذوقه في أي مرتبة كان والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Forty-Five: Concerning the Gnosis of those who Return after they have Reached [the Goal], and Who Causes them to Return\n\nYour existence is based on the management of a verified matter,\nAnd the detailing of signs, if only you would understand.\n\nO human, what has deceived your essence\nConcerning a Lord who sees things rise and fall?\n\nIf you possess intellect, understanding, and insight,\nYou will know what you were ignorant of yesterday.\n\nAnd that is knowing that you are receptive\nTo nearness and distance based on what you do.\n\nSo fear the Lord of management and the detailing of the summarized—\nFor that is what is most fitting and beautiful for the servant.\n\nIf this is your persistent state today,\nPerhaps glad tidings of your felicity will be attained.\n\nFor the Majesty of the Real (جلال الحق) magnifies His power,\nAnd in Creation (الخلق) He decrees and details what He wills.\n\nWhen the Master takes the hearts of His servants\nUnto Himself, He decrees what He wills and acts justly.\n\nWhomever He wills, He keeps honored in His presence;\nAnd whomever He wills, He returns to what he hoped for.\n\nAnd that [one who returns] is a Prophet, or a Messenger, or an Inheritor (وارث)—\nAnd there are none but these, so be concise.\n\nAnd only one remains, and that is the Inheritor (وارث);\nThe two [Prophet and Messenger] have passed, so why do you deviate?\n\nGlory be to Him who singled out the Saint (الولي) with a repose,\nSo that the one who is superior [the Prophet/Messenger] envies him in it.\n\n### [The Message, Sainthood, and Perfect Inheritance]\n\nThe Messenger of Allah (peace and blessings be upon him) said: \"The scholars are the inheritors of the Prophets. Indeed, the Prophets did not bequeath a dinar or a dirham; they bequeathed Knowledge (العلم).\"\n\nSince the state of the Messenger of Allah (peace and blessings be upon him) at the beginning of his affair was that Allah the Exalted guided him to worship Him according to the religion of Abraham the Intimate Friend (peace be upon him), he used to seclude himself in the Cave of Hira, devoting himself to worship (يتحنث فيه)—a Divine care bestowed upon him (peace and blessings be upon him)—until the Real (الحق) suddenly came upon him. The Angel came and greeted him with the Message and informed him of his Prophethood. When this was established with him, he was sent to all mankind as <<بَشِيراً ونَذِيراً وداعِياً إِلَى الله بِإِذْنِهِ وسِراجاً مُنِيراً>> (a bearer of glad tidings and a warner, and a caller to Allah by His permission, and an illuminating lamp). He conveyed the Message, fulfilled the Trust, and called unto Allah, the Mighty and Majestic, <<عَلى‏ بَصِيرَةٍ>> (upon clear evidence).\n\nThe Perfect Inheritor (الوارث الكامل) among the Saints (الأولياء) is one who isolates himself unto Allah according to the Law (شريعة) of the Messenger of Allah (peace and blessings be upon him), until Allah grants him an opening in his heart, enabling him to understand what Allah, the Mighty and Majestic, revealed to His Prophet and Messenger Muhammad (peace and blessings be upon him) through a Divine Theophany (تجل إلهي) in his inner being. Thus, He grants him understanding (الفهم) of His Mighty Book and makes him one of the Inspired Ones (المحدثين) in this community. This experience stands for him in the place of the Angel who came to the Messenger of Allah (peace and blessings be upon him). Then, Allah returns him to Creation (الخلق) to guide them to the rectification of their hearts with Allah, to distinguish for them between praiseworthy and blameworthy thoughts (الخواطر), and to clarify for them the aims of the Law (مقاصد الشرع) and what rulings are established from the Messenger of Allah (peace and blessings be upon him) and what are not, through an announcement that comes to him from Allah, a mercy from Him, and a knowledge taught to him from His Presence (علما من لدنه). He raises their aspirations to seek the souls through the Most Holy Station (المقام الأقدس) and encourages them regarding what is with Allah, just as the Messenger of Allah (peace and blessings be upon him) did in conveying his Message.\n\nHowever, the Inheritor does not institute a new law (شريعة) nor abrogate an established ruling (حكما مقررا), but rather clarifies, for he is <<عَلى‏ بَيِّنَةٍ من رَبِّهِ>> (upon clear evidence from his Lord) and insight (بصيرة) in his knowledge, and <<يَتْلُوهُ شاهِدٌ مِنْهُ>> (a witness from Him follows it) through the sincerity of his following. He is the one whom Allah the Exalted associated with His Messenger (peace and blessings be upon him) in the quality by which he calls unto Allah, for He informed and said: <<أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي>> (I call unto Allah upon clear evidence, I and those who follow me). These are the Inheritors, and they call unto Allah upon clear evidence (بصيرة). Likewise, He associated them with the Prophets (peace be upon them) in the trial (المحنة) and what they were afflicted with, saying: <<إِنَّ الَّذِينَ يَكْفُرُونَ بِآياتِ الله ويَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّ ويَقْتُلُونَ الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ من النَّاسِ>> (Indeed, those who disbelieve in the signs of Allah and kill the Prophets without right, and kill those among the people who enjoin justice). These are the Inheritors. Thus, He associated them in affliction just as He associated them in the call unto Allah.\n\n### [The Quality of Perfection in Prophetic Inheritance]\n\nOur Shaykh Abū Madyan (may Allah be pleased with him) often used to say: \"Among the signs of the seeker's (المريد) sincerity in his seeking is his flight from Creation (فراره عن الخلق).\" This is the state of the Messenger (peace and blessings be upon him) in his departure and isolation from people in the Cave of Hira for devotion. Then he would say: \"And among the signs of the sincerity of his flight from Creation is his finding of the Real (وجوده للحق).\" The Messenger of Allah (peace and blessings be upon him) continued his devotion in isolation until the Real suddenly came upon him. Then he said: \"And among the signs of the sincerity of his finding of the Real is his return to Creation (رجوعه إلى الخلق).\" He means the state of his being sent (بعثه) with the Message to the people, and in the case of the Inheritors, he means guidance (الإرشاد) and the preservation of the Law (الشريعة) for them.\n\nBy this, the Shaykh intended the quality of perfection in the Prophetic Inheritance (الورث النبوي). For Allah has servants whom, when the Real suddenly comes upon them, He takes them unto Himself and does not return them to the World (العالم), occupying them with Himself. This has occurred frequently. However, the perfection of the Prophetic Inheritance of the Message (الرسالي) lies in the return to Creation.\n\nIf the saying of Abū Sulaymān al-Dārānī confronts you here—\"If they had reached, they would not have returned\"—that applies only to those who return to their natural desires (شهواته الطبيعية), their pleasures, and what they had repented of to Allah. As for returning to Allah the Exalted through guidance (الإرشاد), he would not say, \"If a flash of the Reality (الحقيقة) had appeared to them, they would not have returned to what they repented of to Allah,\" even if they saw the Face of the Real (وجه الحق) in it. For the station of responsibility (التكليف) and proper conduct (الأدب) prevents them from that.\n\nAs for the saying of another of the great men, when he was told, \"So-and-so claims he has reached,\" and he replied, \"To Saqar [Hell],\" he meant by this the one who claims that Allah is limited and can be reached, He who said: <<وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ>> (And He is with you wherever you are). Or, he meant that upon reaching Him, the prescribed actions (الأعمال المشروعة) fall away from him, and that he is no longer addressed by them, despite possessing the intellect of responsibility (عقل التكليف), and that this reaching granted him that. This is the one about whom the Shaykh said, \"To Saqar.\" That is, this is invalid. Rather, reaching Allah (الوصول إلى الله) is by cutting off everything besides Him, until the human takes directly from his Lord. This is not denied by the Sufi community (الطائفة), without dispute.\n\n### [Returning to Creation Before Reaching the Real]\n\nOur Shaykh Abū Yaʿqūb Yūsuf ibn Yakhluf al-Kūmī used to say: \"Between us and the desired Real (الحق المطلوب) is a difficult ascent (عقبة كئود). We are at the bottom of the ascent, on the side of nature. We continue to climb that ascent until we reach its summit. If we look out over what lies beyond from there, we will not return.\"\n\nThis supports the saying of Abū Sulaymān al-Dārānī, \"If they had reached, they would not have returned\"—meaning to the summit of the ascent. Thus, those among people who return only return from before reaching the summit of the ascent and looking out over what lies beyond it.\n\nThe reason necessitating the return, even with this, is only the pursuit of perfection (طلب الكمال). However, he does not descend, but rather calls them from that station (مقام) of his, which is his saying: <<عَلى‏ بَصِيرَةٍ>> (upon clear evidence). Thus, he witnesses and knows the one being called through verified witnessing (شهود محقق).\n\nAs for the one who is not returned, he has no face toward the World (العالم), and he remains standing there. He is also called The Stander (الواقف). For beyond that ascent, there is no responsibility (تكليف), and no one descends from it except the one who dies. However, among them—meaning The Standers—are those who are consumed (مستهلكا) by what they witness there. A group of them has been found, and this state persisted for Abū Yazīd al-Bisṭāmī, and it was the state of Abū ʿIqāl al-Maghribī and others.\n\n### [The Levels of Those Who Reach Allah]\n\nKnow that after I have informed you of the meaning of reaching Allah (الوصول إلى الله), the Reached Ones (الواصلين) are of several levels.\n\n**First:** Among them is one whose reaching is to a Self-Subsistent Name (اسم ذاتي) that indicates nothing but Allah the Exalted, purely as an indicator of the Essence (الذات), like proper nouns (الأسماء الأعلام) among us, which do not indicate another intelligible meaning alongside that. The state of this person is consumption/annihilation (الاستهلاك), like the Angels Veiled in Divine Majesty (الملائكة المهيمن) and the Cherubim (الملائكة الكروبيين) in the Majesty of Allah the Exalted. They know none besides Him, and none besides Him knows them, glory be to Him.\n\n**Second:** Among them is one who reaches Allah through the Name that led him to Allah, or through the Name by which Allah discloses Himself (يتجلى له) to him, and he takes it from the Name that led him to Him, glory be to Him. These two men, or persons—for women may also be among them when they reach—if their reaching was through the Name that led them, and they witnessed it, so that they attained the certainty of sight (عين يقين), then that Name must relate either to:\n1. An Attribute of Act (صفة فعل), such as *Khāliq* (Creator) or *Bāriʾ* (Maker).\n2. An Attribute of Attribute (صفة صفة), such as *Shakūr* (Appreciative) or *Ḥasīb* (Reckoner).\n3. An Attribute of Transcendence (صفة تنزيه), such as *Ghanī* (Rich/Self-Sufficient).\nHis state will be according to what the reality of that Name dictates. From that derives his spiritual drink (مشربه), his taste (ذوقه), his satisfaction (ريه), and his existence (وجوده); he does not transgress it. Thus, what dominates him in his state, in our view, is what the reality of that Divine Name dictates. You attribute him to it and call him by it, saying: ʿAbd al-Shakūr (Servant of the Appreciative), ʿAbd al-Bārī (Servant of the Maker), ʿAbd al-Ghanī (Servant of the Rich), ʿAbd al-Jalīl (Servant of the Majestic), and ʿAbd al-Razzāq (Servant of the Provider).\n\n**Third:** If their reaching was to a Name other than the Name that led them, then he comes with strange knowledge (علم غريب) that his state does not grant, according to what the reality of that Name dictates. He speaks of profound sciences (غرائب العلم) in that station. That knowledge may contain things that are denied by those who lack knowledge of the path of the people, and people see that his knowledge is above his state. This person, in our view, is higher than the one who reached the witnessing of the Name that led him, for the latter does not come with strange knowledge that does not suit his state, so people see that his knowledge is beneath his state and lower than it.\n\nAbū Yazīd al-Bisṭāmī (may Allah be pleased with him) said: \"The Gnostic (العارف) is above what he says, and the scholar (العالم) is below what he says.\"\n\nBy this, we have defined for you the levels of the Reached Ones: some return, and some do not return.\n\n### [Categories of Those Who Return from the Real to Creation]\n\nThe Returners (الراجعين) are of two categories:\n\n**First:** Those who return by choice (اختيارا), like Abū Madyan.\n\n**Second:** Those who return by necessity, being compelled (اضطرارا مجبورا), like Abū Yazīd. When the Real clothed him in the Attributes by which he ought to be an Inheritor of guidance (وراثة إرشاد) and direction, he took one step from His Presence and fainted. Then came the call: \"Return My beloved to Me, for he has no patience without Me.\" Such a person does not desire to go out to people; he is a master of spiritual state (صاحب حال).\n\n**Third:** As for the highest men (العالي من الرجال), who are the great masters (الأكابر), they are those who inherited the servitude (عبوديته) of the Messenger of Allah (peace and blessings be upon him). If they are commanded to convey the message, they strive to conceal their station (مقامهم) from people's eyes, so that they appear to people in a way that they do not ordinarily know them to be among the people of Divine specialization (الاختصاص الإلهي). They combine the call to Allah with the concealment of their station. They call people by reading Hadith, books of spiritual refinement (كتب الرقائق), and recounting the words of the masters (المشايخ), so that the common folk only know them as transmitters (نقلة), not as speakers about their own states from the station of nearness (مقام القربة). This is if they are commanded, which is necessary. If they are not commanded to do so, they remain among the common folk whose state is always concealed, neither good nor bad being attributed to them.\n\n### [The Reached Men and their Openings in the World of Correspondences]\n\nAmong the Reached Men (الواصلين) are those who are not granted unveiling (كشف) concerning the knowledge of the Divine Names (الأسماء الإلهية) that govern them. Rather, their focus is on the prescribed actions (الأعمال المشروعة) through which they travel the path. These are eight: hand, foot, belly, tongue, hearing, sight, private parts, and heart—there is nothing else besides that.\n\nThese individuals, upon reaching, are granted an opening (فتح) in the World of Correspondences (عالم المناسبات). They examine what is opened to them upon reaching the door they knocked upon. When the opening occurs, they know, through what is disclosed to them from the Unseen (الغيب), which door that door was. If the reality witnessed (المشهود لهم) demands the hand due to a correspondence (مناسبة) that appears to them, he is a \"man of the hand\" (صاحب يد). If it demands sight due to a correspondence, he is a \"man of sight.\" And so on for all the members.\n\nTheir miracles (كرامات), if they are saints (ولي), and their miracles (معجزات), if they are prophets (نبي), and their stations (منازل) and gnosis (معارف) are of that same kind, as the Messenger of Allah (peace and blessings be upon him) indicated concerning the one who performs ablution (يتوضأ) perfectly, then prays two cycles (ركعتين) without distracting himself in them with anything: the eight doors of Paradise are opened for him, and he enters through whichever he wills.\n\nLikewise, this person receives an opening from the actions of his members, once his purification is complete and his inner secret (سره) is pure, whatever that opening may be, according to what the actions of his responsible members grant. We have explained these practical levels concerning the members in the book *Mawāqiʿ al-Nujūm* (The Settings of the Stars).\n\n### [The Reached Men and their Sustenance from the Eight Lights]\n\nThen, Allah the Exalted sustains them (يمدهم) with Lights (الأنوار) that correspond to them. These are eight, from the Presence of Light (حضرة النور).\n\n**First:** Among them is one whose sustenance comes from the Light of Lightning (نور البرق), which is the Essential Witnessing (المشهد الذاتي). This is of two types: deceptive (*khalab*) and non-deceptive. If it does not produce attributes of transcendence (صفات التنزيه), it is deceptive lightning (*al-barq al-khalab*). If it produces—and it only produces one thing, because Allah has no essential attribute besides one, which is the Essence (الذات) itself, and it cannot be two—then if it happens that he attains a Divine definition in some unveiling (كشف) from this lightning light, it is not deceptive lightning.\n\n**Second:** Among them is one whose sustenance comes from the Presence of Light, the Light of the Sun (نور الشمس).\n\n**Third:** Among them is one whose sustenance comes from the Light of the Full Moon (نور البدر).\n\n**Fourth:** Among them is one whose sustenance comes from the Light of the Moon (نور القمر).\n\n**Fifth:** Among them is one whose sustenance comes from the Light of the Crescent (نور الهلال).\n\n**Sixth:** Among them is one whose sustenance comes from the Light of the Lamp (نور السراج).\n\n**Seventh:** Among them is one whose sustenance comes from the Light of the Stars (نور النجوم).\n\n**Eighth:** Among them is one whose sustenance comes from the Light of the Fire (نور النار).\n\nThere are no more lights than these. We have also mentioned the levels of these Lights in *Mawāqiʿ al-Nujūm*.\n\nTheir realization (إدراكهم) is according to the rank of their lights. The ranks are distinguished by the distinction of the lights, and men are distinguished by the distinction of the ranks.\n\n### [The Saints Who Reach the Realities of the Prophets]\n\nAmong the Reached Men are those who have no gnosis (معرفة) of this station, nor of the Divine Names (الأسماء الإلهية). However, their reaching is to the Realities (حقائق) and Subtleties (لطائف) of the Prophets. When they reach, a door opens to them from the subtleties of the Prophets, according to the actions they were engaged in at the time of the opening.\n\nAmong them is one to whom the Reality of Moses (حقيقة موسى) (peace be upon him) is disclosed, and he becomes Mosaically Witnessed (*Mūsawī al-Mashhad*). Among them is one to whom the subtlety of Jesus is disclosed, and so on for the rest of the Messengers. He is attributed to that Messenger by inheritance, but always within the established Law (شريعة) of Muhammad (peace and blessings be upon him) concerning the law of that Prophet who was disclosed to him.\n\nThis Reached One finds that his action, which necessitated his opening, was realized, either outwardly or inwardly, according to the law of a preceding Prophet. An example is the saying of the Exalted: <<أَقِمِ الصَّلاةَ لِذِكْرِي>> (Establish the prayer for My remembrance), for that is from the law of Moses, and the Lawgiver [Muhammad] confirmed it for us regarding those who missed the time of prayer due to sleep or forgetfulness.\n\nThese individuals take from the subtleties of the Prophets (peace be upon them). We have met a group of them. These have no taste (ذوق) or spiritual drink (شرب) in the Lights, the Members, or the Divine Names.\n\nAlso among those who reach Allah the Exalted, according to the reaching we have explained, are those for whom Allah combines all these aspects, and among them are those who possess two or more of these ranks, according to the portion that Allah has allotted to them.\n\nEvery person among these, when returned to Creation for guidance (الإرشاد والهداية), does not exceed his taste (ذوقه) in whatever rank he was. <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "پینتالیسواں باب: اس شخص کی معرفت میں جو واصل ہونے کے بعد واپس لوٹا، اور اس ہستی کی معرفت میں جس نے اسے واپس لوٹایا۔\n\nتیرا وجود ایک یقینی امر کی تدبیر سے ہے،\nاور آیات کی تفصیل سے ہے، کاش تو عقل کرے۔\n\nاے انسان! تجھے کس چیز نے تیری ذات کو دھوکے میں ڈالا\nاس رب سے جو چیزوں کو بلند ہوتے اور پست ہوتے دیکھتا ہے؟\n\nپس اگر تو عقل، فہم اور فطانت والا ہے،\nتو تو وہ جان لے گا جسے تو کل تک جہالت میں تھا۔\n\nاور وہ یہ ہے کہ تو جان لے کہ تو اپنے عمل کے ذریعے\nقرب اور بعد دونوں کو قبول کرنے والا ہے۔\n\nپس تو تدبیر کے رب اور مجمل کی تفصیل کے رب سے ڈر،\nکیونکہ یہی وہ ہے جو بندے کے لیے زیادہ مناسب اور خوبصورت ہے۔\n\nجب تیرا یہ حال آج مسلسل رہے گا،\nتو شاید تیری سعادت کی بشارتیں حاصل ہو جائیں۔\n\nبے شک ذات حق (Al-Ḥaqq) کا جلال اس کی قدر کو عظیم کرتا ہے،\nاور مخلوق میں وہ جو چاہتا ہے فیصلہ کرتا اور تفصیل بیان کرتا ہے۔\n\nجب مولیٰ اپنے بندوں کے دلوں کو\nاپنی طرف لے لیتا ہے، اور جو چاہتا ہے فیصلہ کرتا اور عدل کرتا ہے۔\n\nپس جسے وہ چاہتا ہے اسے اپنے پاس عزت کے ساتھ باقی رکھتا ہے،\nاور جسے وہ چاہتا ہے اسے اس کی امید کی طرف لوٹا دیتا ہے۔\n\nاور وہ نبی، یا رسول، یا وارث ہوتا ہے،\nاور وہاں ان کے سوا کوئی نہیں، پس وہ خوبصورت ہیں۔\n\nاور صرف ایک باقی ہے اور وہ وارث ہے،\nاور وہ دونوں (نبی اور رسول) جا چکے، پس تو کیوں عدل کرتا ہے؟\n\nپس پاک ہے وہ ذات جس نے ولی کو راحت کے ساتھ خاص کیا،\nتاکہ اس میں وہ شخص بھی رشک کرے جو اس سے افضل ہے۔\n\n### [رسالت، ولایت، اور وراثت کاملہ]\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"علماء انبیاء کے وارث ہیں، اور بے شک انبیاء نے نہ دینار وراثت میں چھوڑا نہ درہم، انہوں نے علم وراثت میں چھوڑا۔\"\n\nاور جب رسول اللہ صلی اللہ علیہ وسلم کی ابتدائی حالت یہ تھی کہ اللہ تعالیٰ نے آپ کو ملت ابراہیم خلیل علیہ السلام کے ساتھ اپنی عبادت کی توفیق دی، تو آپ غار حرا میں خلوت اختیار کرتے اور اللہ سبحانہ کی طرف سے آپ صلی اللہ علیہ وسلم پر عنایت کے طور پر وہاں تحنث (عبادت) کرتے، یہاں تک کہ ذات حق (Al-Ḥaqq) نے آپ پر اچانک ظہور کیا، اور آپ کے پاس فرشتہ آیا، اور آپ کو رسالت کے ساتھ سلام کیا اور آپ کو آپ کی نبوت سے آگاہ کیا۔ جب یہ بات آپ کے نزدیک مستحکم ہو گئی، تو آپ کو تمام لوگوں کی طرف بھیجا گیا: بَشِيراً ونَذِيراً وداعِياً إِلَى الله بِإِذْنِهِ وسِراجاً مُنِيراً (بشارت دینے والا، ڈرانے والا، اور اللہ کے حکم سے اس کی طرف بلانے والا، اور روشن چراغ)۔ پس آپ نے رسالت پہنچائی، امانت ادا کی، اور اللہ عزوجل کی طرف عَلى‏ بَصِيرَةٍ (بصیرت کے ساتھ) دعوت دی۔\n\nپس اولیاء میں سے کامل وارث وہ ہے جو رسول اللہ صلی اللہ علیہ وسلم کی شریعت کے ساتھ اللہ کی طرف منقطع ہو گیا، یہاں تک کہ اللہ نے اس کے دل میں کشادگی پیدا کی تاکہ وہ اس چیز کو سمجھے جو اللہ عزوجل نے اپنے نبی اور رسول محمد صلی اللہ علیہ وسلم پر نازل کی ہے، اس کے باطن میں ایک ظہور الٰہی (At-Tajallī) کے ذریعے، پس اللہ نے اسے اپنی کتاب میں فہم عطا کیا اور اسے اس امت میں محدثین میں سے بنا دیا۔ پس یہ مقام اس کے لیے اس فرشتے کے مقام پر قائم ہوا جو رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تھا۔ پھر اللہ اسے مخلوق کی طرف لوٹا دیتا ہے تاکہ وہ انہیں اللہ کے ساتھ ان کے دلوں کی اصلاح کی طرف رہنمائی کرے، اور ان کے لیے محمود اور مذموم خواطر کے درمیان فرق کرے، اور انہیں شریعت کے مقاصد اور ان احکام کی وضاحت کرے جو رسول اللہ صلی اللہ علیہ وسلم سے ثابت ہیں اور جو ثابت نہیں ہیں، یہ سب اللہ کی طرف سے ایک اطلاع کے ذریعے جو اس کے پاس اس کی رحمت سے آتی ہے، اور وہ اسے اپنے پاس سے علم سکھاتا ہے۔ پس وہ ان کے ہمتوں کو مقام اقدس کے ذریعے نفوس کی طلب کی طرف بلند کرتا ہے، اور انہیں اللہ کے پاس موجود چیزوں کی رغبت دلاتا ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی رسالت کی تبلیغ میں کیا۔\n\nفرق صرف یہ ہے کہ وارث نہ تو کوئی نئی شریعت لاتا ہے اور نہ ہی کسی مقررہ حکم کو منسوخ کرتا ہے، بلکہ وہ صرف وضاحت کرتا ہے، کیونکہ وہ اپنے رب کی طرف سے بَيِّنَةٍ (واضح دلیل) اور اپنے علم میں بصیرت پر ہے، اور يَتْلُوهُ شاهِدٌ مِنْهُ (اس کی طرف سے ایک گواہ اس کی پیروی کرتا ہے) اپنی سچی اتباع کے ساتھ۔ اور یہی وہ ہے جسے اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اس صفت میں شریک کیا ہے جس کے ذریعے وہ اللہ کی طرف دعوت دیتے ہیں، پس اللہ نے خبر دی اور فرمایا: أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي (میں اور جس نے میری پیروی کی، ہم بصیرت کے ساتھ اللہ کی طرف بلاتے ہیں)۔ اور وہ (پیروی کرنے والے) ہی وارث ہیں، پس وہ بصیرت کے ساتھ اللہ کی طرف دعوت دیتے ہیں۔ اسی طرح اللہ نے انہیں انبیاء علیہم السلام کے ساتھ آزمائش اور ابتلاء میں بھی شریک کیا، پس فرمایا: إِنَّ الَّذِينَ يَكْفُرُونَ بِآياتِ الله ويَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّ ويَقْتُلُونَ الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ من النَّاسِ (بے شک وہ لوگ جو اللہ کی آیات کا انکار کرتے ہیں اور انبیاء کو ناحق قتل کرتے ہیں، اور ان لوگوں کو قتل کرتے ہیں جو لوگوں میں انصاف کا حکم دیتے ہیں)۔ اور وہ (انصاف کا حکم دینے والے) وارث ہیں، پس اللہ نے انہیں بلاء میں شریک کیا جیسا کہ انہیں اللہ کی طرف دعوت میں شریک کیا۔\n\n### [وراثت نبوی میں کمال کی صفت]\n\nہمارے شیخ ابو مدین رضی اللہ عنہ اکثر فرمایا کرتے تھے کہ مرید کی اپنے ارادے میں سچائی کی علامتوں میں سے ایک مخلوق سے اس کا فرار ہے۔ اور یہ رسول اللہ صلی اللہ علیہ وسلم کی حالت تھی جب آپ غار حرا میں لوگوں سے نکل کر انقطاع اختیار کرتے تھے تاکہ تحنث (عبادت) کریں۔ پھر وہ فرماتے تھے: اور مخلوق سے اس کے فرار کی سچائی کی علامتوں میں سے ایک ذات حق (Al-Ḥaqq) کا اس کے لیے موجود ہونا ہے۔ پس رسول اللہ صلی اللہ علیہ وسلم اپنے انقطاع میں تحنث کرتے رہے یہاں تک کہ ذات حق (Al-Ḥaqq) نے آپ پر اچانک ظہور کیا۔ پھر فرمایا: اور ذات حق (Al-Ḥaqq) کے لیے اس کے وجود کی سچائی کی علامتوں میں سے ایک مخلوق کی طرف اس کا لوٹنا ہے۔ اس سے آپ صلی اللہ علیہ وسلم کی رسالت کے ساتھ لوگوں کی طرف مبعوث ہونے کی حالت مراد لیتے ہیں، اور وارثوں کے حق میں اس سے مراد ارشاد اور ان پر شریعت کی حفاظت ہے۔\n\nپس شیخ نے اس سے وراثت نبوی رسالی میں کمال کی صفت مراد لی، کیونکہ اللہ کے کچھ بندے ایسے ہیں کہ جب ذات حق (Al-Ḥaqq) ان پر اچانک ظہور کرتا ہے تو وہ انہیں اپنی طرف لے لیتا ہے اور انہیں عالم کی طرف واپس نہیں لوٹاتا، اور انہیں اپنے ساتھ مشغول رکھتا ہے۔ اور یہ کثرت سے واقع ہوا ہے، لیکن نبوی رسالی وراثت کا کمال مخلوق کی طرف لوٹنے میں ہے۔ اگر یہاں تمہیں ابو سلیمان دارانی کا قول اعتراض کرے کہ \"اگر وہ واصل ہو جاتے تو واپس نہ لوٹتے،\" تو یہ صرف ان لوگوں کے بارے میں ہے جو اپنی طبعی شہوات اور لذات کی طرف لوٹتے ہیں، اور ان چیزوں کی طرف جن سے انہوں نے اللہ کے حضور توبہ کی تھی۔ لیکن اللہ تعالیٰ کی طرف ارشاد کے لیے لوٹنا، تو وہ یہ نہیں کہتے کہ \"اگر حقیقت کی کوئی چمک ان پر ظاہر ہو جاتی تو وہ ان چیزوں کی طرف واپس نہ لوٹتے جن سے انہوں نے اللہ کے حضور توبہ کی تھی،\" اگرچہ وہ اس میں ذات حق (Al-Ḥaqq) کا چہرہ دیکھیں۔ کیونکہ تکلیف اور ادب کا مقام انہیں اس سے منع کرتا ہے۔\n\nاور جہاں تک دوسرے اکابر رجال کے قول کا تعلق ہے، جب ان سے کہا گیا کہ فلاں شخص دعویٰ کرتا ہے کہ وہ واصل ہو گیا ہے، تو انہوں نے کہا: \"جہنم کی طرف (إلى سقر)\"۔ اس سے ان کی مراد یہ ہے کہ جو شخص یہ دعویٰ کرتا ہے کہ اللہ محدود ہے اور اس تک پہنچا جا سکتا ہے، حالانکہ اللہ ہی وہ ہے جو فرماتا ہے: وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)، یا یہ کہ جب کوئی اس تک پہنچ جاتا ہے تو اس سے مشروع اعمال ساقط ہو جاتے ہیں، اور وہ ان کا مکلف نہیں رہتا جبکہ اس کے پاس عقلِ تکلیف موجود ہے، اور یہ کہ اس وصول نے اسے یہ حق دیا ہے۔ پس یہ وہی شخص ہے جس کے بارے میں شیخ نے کہا: \"جہنم کی طرف (إلى سقر)\"۔ یعنی یہ صحیح نہیں ہے۔ بلکہ اللہ تک وصول ہر اس چیز کو کاٹ دینے سے ہوتا ہے جو اس کے سوا ہے، یہاں تک کہ انسان اپنے رب سے اخذ کرنے لگے، اور یہ وہ چیز ہے جسے یہ طائفہ (صوفیاء) بلا اختلاف منع نہیں کرتی۔\n\n### [ذات حق تک وصول سے پہلے مخلوق کی طرف لوٹنا]\n\nاور ہمارے شیخ ابو یعقوب یوسف بن یخلف الکومی فرمایا کرتے تھے: ہمارے اور مطلوب ذات حق (Al-Ḥaqq) کے درمیان ایک دشوار گزار گھاٹی (عقبہ کئود) ہے۔ اور ہم طبیعت کی طرف سے گھاٹی کے نچلے حصے میں ہیں۔ پس ہم اس گھاٹی میں چڑھتے رہتے ہیں یہاں تک کہ اس کی چوٹی پر پہنچ جاتے ہیں۔ جب ہم وہاں سے اس کے پیچھے کی چیزوں پر جھانکتے ہیں، تو ہم واپس نہیں لوٹتے، کیونکہ اس کے پیچھے وہ چیز ہے جس سے واپس لوٹنا ممکن نہیں ہے۔ اور یہی ابو سلیمان دارانی کا قول ہے: \"اگر وہ واصل ہو جاتے تو واپس نہ لوٹتے۔\" اس سے ان کی مراد گھاٹی کی چوٹی تک پہنچنا ہے۔ پس لوگوں میں سے جو بھی واپس لوٹتا ہے، وہ گھاٹی کی چوٹی تک پہنچنے اور اس کے پیچھے کی چیزوں پر جھانکنے سے پہلے ہی لوٹتا ہے۔ اس کے باوجود لوٹنے کا سبب جو اسے واجب کرتا ہے، وہ کمال کی طلب ہے۔ لیکن وہ نیچے نہیں اترتا، بلکہ وہ انہیں اپنے اسی مقام سے دعوت دیتا ہے، اور یہی اللہ کا قول ہے: عَلى‏ بَصِيرَةٍ (بصیرت کے ساتھ)۔ پس وہ شہود (Ash-Shuhūd) کرتا ہے اور ایک محقق شہود (Ash-Shuhūd) پر مدعو کو پہچانتا ہے۔ اور جو واپس نہیں لوٹتا، اس کا عالم کی طرف کوئی رخ نہیں ہوتا، پس وہیں کھڑا رہتا ہے، اور اسے ہی الواقف (کھڑا رہنے والا) کہا جاتا ہے۔ کیونکہ اس گھاٹی کے پیچھے کوئی تکلیف (شرعی ذمہ داری) نہیں ہے، اور وہاں سے وہی نیچے اترتا ہے جو مر جاتا ہے۔ البتہ ان (واقفین) میں سے کچھ ایسے ہوتے ہیں جو وہاں جو کچھ دیکھتے ہیں اس میں مستغرق (مستهلك) ہو جاتے ہیں۔ اور ان میں سے ایک جماعت پائی گئی ہے، اور یہ حالت ابو یزید بسطامی پر طویل عرصے تک رہی، اور یہی حال ابو عقال مغربی اور دیگر کا تھا۔\n\n### [اللہ تک واصل ہونے والوں کے مراتب]\n\nاور جان لو کہ جب میں نے تمہیں بتا دیا کہ اللہ تک وصول کا کیا مطلب ہے، تو واصلین کئی مراتب پر ہیں۔ ان میں سے کچھ ایسے ہیں جن کا وصول ایک ذاتی اسم تک ہوتا ہے جو صرف اللہ تعالیٰ پر دلالت کرتا ہے، اس حیثیت سے کہ وہ ذات پر دلیل ہے، جیسے ہمارے ہاں اسمائے اعلام (نام) کسی دوسرے معنی پر دلالت نہیں کرتے جو اس کے ساتھ معقول ہو۔ پس اس کا حال استغراق (استہلاک) کا ہوتا ہے، جیسے ملائکہ مہیمن جو اللہ تعالیٰ کے جلال میں ہیں اور ملائکہ کروبیین، پس وہ اس کے سوا کسی کو نہیں جانتے اور نہ ہی وہ سبحانہ کے سوا کسی کو جانتے ہیں۔\n\nاور ان میں سے کچھ ایسے ہیں جو اللہ تک اس اسم کے ذریعے پہنچتے ہیں جس نے انہیں اللہ تک پہنچایا، یا اس اسم کے ذریعے جس سے اللہ ان پر ظہور الٰہی (At-Tajallī) کرتا ہے، اور وہ اسے اس اسم سے اخذ کرتے ہیں جس نے انہیں سبحانہ تک پہنچایا۔ پھر یہ دونوں مذکورہ مرد یا شخصیات (کیونکہ ان میں عورتیں بھی ہو سکتی ہیں جب وہ واصل ہوں)۔ اگر ان کا وصول اس اسم کے ذریعے ہوا جس نے انہیں پہنچایا، اور انہوں نے اس کا شہود (Ash-Shuhūd) کیا، تو ان کے لیے عین یقین حاصل ہوا۔ پس وہ اسم یا تو صفت فعل کا متقاضی ہو گا، جیسے خالق (پیدا کرنے والا) اور باری (وجود بخشنے والا)، یا صفت صفت کا، جیسے شکور (قدردان) اور حسیب (حساب لینے والا)، یا صفت تنزیہ کا، جیسے غنی (بے نیاز)۔ پس یہ اس کے مطابق ہو گا جو اس اسم کی حقیقت عطا کرتی ہے۔ اور اسی وجہ سے ان کا مشرب (پینے کی جگہ)، ذوق، سیرابی، اور ہستی (Al-Wujūd) اس سے تجاوز نہیں کرتی۔ پس ان کے حال پر ہمارے نزدیک وہ چیز غالب رہتی ہے جو اس الٰہی اسم کی حقیقت عطا کرتی ہے، پس تم انہیں اس کی طرف منسوب کرتے ہو اور اسی کے ذریعے انہیں پکارتے ہو، پس تم کہتے ہو: عبد الشکور، عبد الباری، عبد الغنی، عبد الجلیل، اور عبد الرزاق۔\n\nاور اگر ان کا وصول کسی ایسے اسم تک ہوا جو اس اسم کے علاوہ ہے جس نے انہیں پہنچایا، تو وہ ایک ایسا عجیب علم لاتا ہے جو اس کے حال کے مطابق نہیں ہوتا، اس کے مطابق جو اس اسم کی حقیقت عطا کرتی ہے۔ پس وہ اس مقام میں علم کی عجیب و غریب باتیں کرتا ہے۔ اور ہو سکتا ہے کہ اس علم میں ایسی چیزیں ہوں جن کا انکار وہ شخص کرے جسے اس قوم کے طریقے کا علم نہ ہو۔ اور لوگ دیکھتے ہیں کہ اس کا علم اس کے حال سے بلند ہے، اور وہ ہمارے نزدیک اس شخص سے اعلیٰ ہے جو اس اسم کے شہود (Ash-Shuhūd) تک پہنچا جس نے اسے پہنچایا۔ کیونکہ یہ شخص کوئی ایسا عجیب علم نہیں لاتا جو اس کے حال کے مطابق نہ ہو، پس لوگ دیکھتے ہیں کہ اس کا علم اس کے حال سے نیچے اور کم ہے۔ ابو یزید بسطامی رضی اللہ عنہ فرماتے ہیں: \"عارف اس سے بلند ہوتا ہے جو وہ کہتا ہے، اور عالم اس سے کم ہوتا ہے جو وہ کہتا ہے۔\" پس اس طرح ہم نے تمہارے لیے واصلین کے مراتب کو محدود کر دیا ہے، پس ان میں سے کچھ واپس لوٹتے ہیں اور کچھ واپس نہیں لوٹتے۔\n\n### [ذات حق سے مخلوق کی طرف لوٹنے والوں کی اقسام]\n\nپھر لوٹنے والے دو قسموں پر ہیں۔ ان میں سے کچھ وہ ہیں جو اختیاری طور پر لوٹتے ہیں، جیسے ابو مدین۔ اور ان میں سے کچھ وہ ہیں جو اضطراری طور پر، مجبوراً لوٹتے ہیں، جیسے ابو یزید۔ جب ذات حق (Al-Ḥaqq) نے ان پر وہ صفات پہنائیں جن کے ذریعے انہیں ارشاد اور ہدایت کی وراثت کا وارث ہونا چاہیے تھا، تو انہوں نے اپنی طرف سے ایک قدم اٹھایا اور ان پر غشی طاری ہو گئی، تو ندا آئی: \"میرے حبیب کو واپس لوٹا دو، کیونکہ وہ مجھ سے صبر نہیں کر سکتا۔\" پس ایسا شخص لوگوں کی طرف نکلنے کی رغبت نہیں رکھتا، اور وہ صاحب حال ہوتا ہے۔\n\nاور جو بلند مرتبہ رجال ہیں، اور وہ اکابر ہیں، اور وہ جنہوں نے رسول اللہ صلی اللہ علیہ وسلم سے آپ کی عبودیت کی وراثت پائی، اگر انہیں تبلیغ کا حکم دیا جائے، تو وہ اپنے مقام کو لوگوں کی نظروں سے چھپانے کی تدبیر کرتے ہیں، تاکہ وہ لوگوں کے سامنے اس طرح ظاہر ہوں کہ لوگ عام طور پر یہ نہ جانیں کہ وہ الٰہی اختصاص والے ہیں۔ پس وہ اللہ کی طرف دعوت دینے اور مقام کو چھپانے کے درمیان جمع کرتے ہیں۔ پس وہ انہیں حدیث پڑھنے، رقائق کی کتابیں اور مشائخ کے کلام کی حکایات کے ذریعے دعوت دیتے ہیں، یہاں تک کہ عام لوگ انہیں صرف ناقل کے طور پر جانتے ہیں، نہ کہ وہ قربت کے مقام سے اپنے احوال کے بارے میں بات کرنے والے ہیں۔ یہ تب ہے جب انہیں حکم دیا گیا ہو اور یہ ضروری ہو۔ اور اگر انہیں اس کا حکم نہ دیا گیا ہو، تو وہ عام لوگوں کے ساتھ ہوتے ہیں جن کا حال ہمیشہ پوشیدہ رہتا ہے، نہ ان کے بارے میں خیر کا اعتقاد رکھا جاتا ہے اور نہ شر کا۔\n\n### [واصل رجال اور عالم مناسبات میں ان کے فتوحات]\n\nپھر واصل رجال میں سے کچھ ایسے ہیں جن پر ان الٰہی اسماء کے علم کا کشف (Al-Kashf) نہیں ہوتا جو ان کی تدبیر کرتے ہیں، لیکن ان کی نظر ان مشروع اعمال پر ہوتی ہے جن کے ذریعے وہ سلوک کرتے ہیں۔ اور وہ آٹھ ہیں: ہاتھ، پاؤں، پیٹ، زبان، کان، آنکھ، شرمگاہ، اور دل۔ اس کے سوا کچھ نہیں۔ پس ان کے لیے ان کے وصول کے وقت عالم مناسبات میں کشادگی (فتح) ہوتی ہے۔ پس وہ اس چیز کو دیکھتے ہیں جو ان کے لیے اس دروازے تک پہنچنے پر کھلتا ہے جسے انہوں نے کھٹکھٹایا تھا۔ پس جب ان کے لیے کشادگی ہوتی ہے، تو وہ اس غیب میں جو ان پر ظہور الٰہی (At-Tajallī) کرتا ہے، پہچان لیتے ہیں کہ وہ کون سا دروازہ ہے جو ان کے لیے کھولا گیا ہے۔ پس اگر ان کا مشہود (جس کا شہود کیا گیا) کسی مناسبت سے ہاتھ کا متقاضی ہو جو ان پر ظاہر ہو، تو وہ صاحبِ ید (ہاتھ والا) ہوتا ہے۔ اور اگر وہ کسی مناسبت سے بصارت کا متقاضی ہو، تو وہ صاحبِ بصر (آنکھ والا) ہوتا ہے۔ اور اسی طرح تمام اعضاء۔ اور اسی جنس سے اس کی کرامات ہوتی ہیں اگر وہ ولی ہو، اور اس کے معجزات ہوتے ہیں اگر وہ نبی ہو۔ اور اسی جنس سے اس کے منازل اور اس کی معرفتیں ہوتی ہیں۔ جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے اس شخص کے بارے میں اشارہ کیا جو وضو کرتا ہے اور اچھی طرح وضو کرتا ہے، پھر دو رکعتیں ادا کرتا ہے جن میں اپنے نفس سے کوئی بات نہیں کرتا، تو اس کے لیے جنت کے آٹھوں دروازے کھول دیے جاتے ہیں، وہ جس سے چاہے داخل ہو جائے۔\n\nاسی طرح اس شخص کے لیے اس کے اعضاء کے اعمال سے کشادگی ہوتی ہے، جب اس کی طہارت کامل ہو جاتی ہے اور اس کا باطن (سر) صاف ہو جاتا ہے، جو کچھ بھی اس کے مکلف اعضاء کے اعمال عطا کرتے ہیں۔ اور ہم نے ان عملی مراتب کو اعضاء پر اپنی کتاب *مواقع النجوم* میں بیان کیا ہے۔\n\n### [واصل رجال اور آٹھ انوار سے ان کی امداد]\n\nپھر اللہ سبحانہ انہیں ان انوار سے امداد دیتا ہے جو ان کے لیے مناسب ہیں، اور وہ نور کی حضرۃ سے آٹھ ہیں۔ ان میں سے کچھ ایسے ہیں جن کی امداد نورِ برق (بجلی کا نور) سے ہوتی ہے، اور یہ مشہد ذاتی ہے۔ اور یہ دو قسموں پر ہے: خلب (جھوٹا) اور غیر خلب (سچا)۔ اگر وہ صفات تنزیہ کی طرح کے نتائج پیدا نہ کرے، تو وہ برق خلب ہے۔ اور اگر وہ نتائج پیدا کرے، اور وہ صرف ایک ہی امر پیدا کرتا ہے، کیونکہ اللہ کے لیے ذات کی صفت ایک کے سوا نہیں ہے جو اس کی ذات کا عین ہے اور دو نہیں ہو سکتی۔ پس اگر اس نورِ برقی سے کسی کشف (Al-Kashf) میں کوئی الٰہی تعریف حاصل ہو جائے، تو وہ برق خلب نہیں ہو گا۔\n\nاور ان میں سے کچھ ایسے ہیں جن کی امداد نورِ شمس (سورج کا نور) کی حضرۃ سے ہوتی ہے۔ اور ان میں سے کچھ ایسے ہیں جن کی امداد نورِ بدر (چودھویں کے چاند کا نور) سے ہوتی ہے۔ اور ان میں سے کچھ ایسے ہیں جن کی امداد نورِ قمر (چاند کا نور) سے ہوتی ہے۔ اور ان میں سے کچھ ایسے ہیں جن کی امداد نورِ ہلال (نئے چاند کا نور) سے ہوتی ہے۔ اور ان میں سے کچھ ایسے ہیں جن کی امداد نورِ سراج (چراغ کا نور) سے ہوتی ہے۔ اور ان میں سے کچھ ایسے ہیں جن کی امداد نورِ نجوم (ستاروں کا نور) سے ہوتی ہے۔ اور ان میں سے کچھ ایسے ہیں جن کی امداد نورِ نار (آگ کا نور) سے ہوتی ہے۔ اور اس سے زیادہ کوئی نور نہیں ہے۔ اور ہم نے ان انوار کے مراتب کو بھی *مواقع النجوم* میں ذکر کیا ہے۔ پس ان کا ادراک ان کے انوار کے مراتب کے مطابق ہوتا ہے۔ پس انوار کی تمیز سے مراتب ممتاز ہوتے ہیں، اور مراتب کی تمیز سے رجال ممتاز ہوتے ہیں۔\n\n### [اولیاء میں سے انبیاء کی حقائق تک واصل ہونے والے]\n\nاور واصل رجال میں سے کچھ ایسے ہیں جنہیں اس مقام کی معرفت (Al-Ma‘rifah) نہیں ہوتی اور نہ ہی الٰہی اسماء کی، لیکن انہیں انبیاء کی حقائق اور ان کی لطائف تک وصول حاصل ہوتا ہے۔ پس جب وہ واصل ہوتے ہیں، تو ان کے لیے انبیاء کی لطائف میں سے ایک دروازہ کھلتا ہے، اس قدر کے مطابق جو وہ فتح کے وقت اعمال میں تھے۔ پس ان میں سے کچھ ایسے ہیں جن پر موسیٰ علیہ السلام کی حقیقت کا ظہور الٰہی (At-Tajallī) ہوتا ہے، پس وہ موسوی المشہد (موسیٰ کے مشاہدے والے) ہوتے ہیں۔ اور ان میں سے کچھ ایسے ہیں جن پر عیسیٰ کی لطیفہ کا ظہور الٰہی (At-Tajallī) ہوتا ہے، اور اسی طرح باقی رسولوں کا۔ پس وہ اس رسول کی طرف وراثت کے ذریعے منسوب ہوتے ہیں، لیکن محمد صلی اللہ علیہ وسلم کی مقررہ شریعت کے لحاظ سے، اس نبی کی شریعت سے جس کا ان پر ظہور الٰہی (At-Tajallī) ہوا۔ پس یہ واصل پاتا ہے کہ اس کا عمل، جو اس کے لیے کشادگی کا موجب بنا، اپنے ظاہر یا باطن کے لحاظ سے کسی متقدم نبی کی شریعت میں محقق تھا۔ جیسے اللہ تعالیٰ کا قول: أَقِمِ الصَّلاةَ لِذِكْرِي (میری یاد کے لیے نماز قائم کرو)۔ پس یہ موسیٰ کی شریعت میں سے تھا، اور ہمارے شارع نے اسے اس شخص کے لیے مقرر کیا جو نیند یا بھول کی وجہ سے نماز کے وقت سے نکل جائے۔ پس یہ لوگ انبیاء علیہم السلام کی لطائف سے اخذ کرتے ہیں، اور ہم ان میں سے ایک جماعت سے ملے ہیں۔ اور ان لوگوں کے لیے انوار میں، نہ اعضاء میں، اور نہ ہی الٰہی اسماء میں کوئی ذوق یا مشرب (پینے کی جگہ) ہے۔\n\nاور اللہ تعالیٰ تک واصل ہونے والوں میں سے، اس وصول کے ساتھ جو ہم نے بیان کیا، وہ بھی ہیں جن کے لیے اللہ سب کو جمع کر دیتا ہے، اور ان میں سے کچھ ایسے ہیں جن کے لیے اس میں سے دو یا زیادہ مراتب ہوتے ہیں، ان کی اس رزق کے مطابق جو اللہ نے ان کے لیے تقسیم کیا ہے۔ اور ان میں سے ہر انسان جب ارشاد اور ہدایت کے ساتھ مخلوق کی طرف لوٹایا جاتا ہے، تو وہ اپنے ذوق سے تجاوز نہیں کرتا، وہ جس مرتبے میں بھی ہو۔ واللہ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهل و پنجم در شناخت کسی که پس از وصول (رسیدن) بازگشت و کسی که او را بازگرداند\n\nهستی تو از تدبیر امری محقق است\nو تفصیل آیاتی است اگر تعقل کنی\n\nای انسان، چه چیز ذات تو را مغرور ساخت\nبه پروردگاری که اشیا را در اوج و حضیض می‌بیند؟\n\nاگر صاحب عقل و فهم و فطانت باشی\nآنچه را که دیروز نادان بودی، خواهی دانست\n\nو آن این است که بدانی تو پذیرای\nقرب و بُعد هستی، به واسطه آنچه عمل می‌کنی\n\nپس از پروردگار تدبیر و تفصیل مجمل بترس\nکه این برای بنده سزاوارتر و نیکوتر است\n\nاگر امروز حالت پیوسته چنین باشد\nشاید بشارت‌هایی به سعادت تو حاصل شود\n\nزیرا جلال حق (الحق) قدرش عظیم است\nو در خلق آنچه را بخواهد حکم می‌کند و تفصیل می‌دهد\n\nهنگامی که مولا دل‌های بندگانش را\nبه سوی خود ببرد و آنچه را بخواهد حکم کند و عدالت ورزد\n\nپس هر که را بخواهد نزد خود گرامی می‌دارد\nو هر که را بخواهد به آنچه آرزو داشت باز می‌گرداند\n\nو آن [بازگشته] یا پیامبر است یا رسول و یا وارث\nو جز اینان کسی نیست، پس نیکو عمل کنید\n\nو جز یکی باقی نمانده و او وارث است\nو آن دو [نبی و رسول] رفته‌اند، پس چرا عدول می‌کنی؟\n\nپاک و منزه است کسی که ولی (الولی) را به آسایشی اختصاص داد\nتا آنکه برتر است بر او غبطه خورد\n\n### [رسالت، ولایت و وراثت کامل]\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «علما وارثان پیامبران هستند، و پیامبران دینار و درهمی به ارث نگذاشتند، بلکه علم را به ارث گذاشتند.»\n\nو چون حال ایشان (صلی الله علیه و سلم) در ابتدای امر چنین بود که خداوند متعال او را به عبادت بر دین ابراهیم خلیل (علیه السلام) موفق ساخت، ایشان در غار حرا خلوت می‌گزید و به عبادت می‌پرداخت. این عنایتی از جانب خداوند سبحان به ایشان بود تا آنکه حق (الحق) ناگهان بر او وارد شد و فرشته نزد او آمد و با رسالت بر او سلام کرد و او را به نبوتش آگاه ساخت. هنگامی که این امر نزد او تثبیت شد، او را به سوی عموم مردم فرستاد در حالی که «بشارت‌دهنده و بیم‌دهنده و دعوت‌کننده به سوی خدا به اذن او و چراغی فروزان» بود. پس رسالت را ابلاغ کرد و امانت را ادا نمود و «با بصیرت» به سوی خداوند عز و جل دعوت کرد.\n\nپس وارث کامل از اولیای ما کسی است که با شریعت رسول خدا (صلی الله علیه و سلم) از خلق بریده و به سوی خدا منقطع شده است، تا آنکه خداوند در قلب او برای فهم آنچه خداوند عز و جل بر پیامبر و رسولش محمد (صلی الله علیه و سلم) نازل کرده است، با تجلی (التجلی) الهی در باطن او گشایشی ایجاد کند. پس فهم کتاب عز و جل را روزی او سازد و او را از «مُحَدَّثین» (کسانی که الهام غیبی دریافت می‌کنند) در این امت قرار دهد. این مقام برای او به منزله فرشته‌ای است که نزد رسول خدا (صلی الله علیه و سلم) آمد. سپس خداوند او را به سوی خلق باز می‌گرداند تا ایشان را به صلاح قلب‌هایشان با خدا ارشاد کند و میان خواطر ستوده و نکوهیده برایشان فرق بگذارد و مقاصد شریعت و احکامی را که از رسول خدا (صلی الله علیه و سلم) ثابت شده و آنچه ثابت نشده است، با اعلامی از جانب خدا که از روی رحمت و علم لَدُنّی به او رسیده، برایشان بیان کند. پس همت‌هایشان را به طلب نفوس در مقام اقدس بالا می‌برد و ایشان را به آنچه نزد خداست ترغیب می‌کند، همان‌گونه که رسول خدا (صلی الله علیه و سلم) در ابلاغ رسالتش انجام داد. با این تفاوت که وارث، شریعتی جدید نمی‌آورد و حکمی مقرر را نسخ نمی‌کند، بلکه تبیین می‌کند؛ زیرا او «بر حجتی روشن از پروردگارش» و بصیرتی در علم خود است و «شاهدی از او» به واسطه صدق پیروی‌اش او را دنبال می‌کند. و او کسی است که خداوند متعال او را با رسولش (صلی الله علیه و سلم) در صفتی که با آن به سوی خدا دعوت می‌کند شریک ساخته است. پس خبر داد و فرمود: «من و هر کس که از من پیروی کند، با بصیرت به سوی خدا دعوت می‌کنیم.» و ایشان همان وارثان هستند که با بصیرت به سوی خدا دعوت می‌کنند. همچنین خداوند ایشان را با انبیا (علیهم السلام) در محنت و بلایی که به آن مبتلا شدند شریک ساخت و فرمود: «همانا کسانی که به آیات خدا کفر می‌ورزند و پیامبران را به ناحق می‌کشند و کسانی از مردم را که به قسط (عدل) امر می‌کنند، می‌کشند.» و ایشان همان وارثان هستند. پس خداوند میان ایشان در بلا شریک ساخت، همان‌گونه که میان ایشان در دعوت به سوی خدا شریک ساخت.\n\n### [صفت کمال در وراثت نبوی]\n\nشیخ ما، ابومدین (رضی الله عنه)، بسیار می‌فرمود: از نشانه‌های صدق مرید در اراده‌اش، فرار او از خلق است. و این همان حالت رسول خدا (صلی الله علیه و سلم) در خروج و انقطاع از مردم در غار حرا برای عبادت بود. سپس می‌فرمود: و از نشانه‌های صدق فرار او از خلق، وجود (یافتن) او برای حق (الحق) است. و رسول خدا (صلی الله علیه و سلم) پیوسته در انقطاع خود به عبادت مشغول بود تا آنکه حق (الحق) ناگهان بر او وارد شد. سپس فرمود: و از نشانه‌های صدق وجود او برای حق، بازگشت او به سوی خلق است. منظور او حالت مبعوث شدن ایشان (صلی الله علیه و سلم) با رسالت به سوی مردم است، و در حق وارثان، منظور ارشاد و حفظ شریعت برای ایشان است. پس شیخ با این سخن، صفت کمال در وراثت نبوی را اراده کرده است؛ زیرا خداوند بندگانی دارد که اگر حق (الحق) ناگهان بر ایشان وارد شود، آنان را به سوی خود می‌برد و به عالم باز نمی‌گرداند و ایشان را به خود مشغول می‌سازد. و این امر بسیار رخ داده است، اما کمال وراثت نبوی رسالی در بازگشت به سوی خلق است.\n\nاگر در اینجا سخن ابوسلیمان دارانی که گفت: «اگر واصل می‌شدند، باز نمی‌گشتند» بر تو ایراد شود، [بدان که] این سخن تنها در مورد کسی است که به شهوات طبیعی و لذات خود و آنچه از آن به سوی خدا توبه کرده بود، بازگشته است. اما بازگشت به سوی خداوند متعال برای ارشاد، [چنین نیست]. و او نمی‌گوید: اگر پرتوی از حقیقت (الحقیقة) بر ایشان آشکار می‌شد، به آنچه از آن به سوی خدا توبه کرده بودند باز نمی‌گشتند، حتی اگر وجه حق (الحق) را در آن می‌دیدند؛ زیرا موطن تکلیف و ادب، ایشان را از آن باز می‌دارد. و اما سخن دیگری از بزرگان رجال که وقتی به او گفته شد: «فلانی گمان می‌کند که واصل شده است»، گفت: «به سوی سقر (جهنم)!»؛ منظور او از این سخن کسی است که گمان کند خداوند محدود است و می‌توان به او رسید، در حالی که او خود فرموده است: «و او با شماست هر کجا که باشید.» یا [منظور کسی است که گمان کند] اگر به او رسید، اعمال مشروع از او ساقط می‌شود و با وجود عقل تکلیف، دیگر مخاطب به آن اعمال نیست و آن وصول این امر را به او داده است. این همان کسی است که شیخ درباره‌اش گفت: «به سوی سقر»، یعنی این ادعا صحیح نیست. بلکه وصول به خدا با بریدن از هر آنچه غیر اوست حاصل می‌شود تا انسان از پروردگارش اخذ کند. و این وصولی است که طایفه (صوفیه) بدون هیچ اختلافی آن را منع نمی‌کنند.\n\n### [بازگشت به سوی خلق پیش از وصول به حق]\n\nشیخ ما، ابویعقوب یوسف بن یخلف کومی، می‌فرمود: میان ما و حق (الحق) مطلوب، گردنه‌ای سخت و دشوار است و ما از جهت طبیعت در پایین آن گردنه قرار داریم. پیوسته در آن گردنه بالا می‌رویم تا به بالاترین نقطه آن برسیم. پس اگر از آنجا بر آنچه ورای آن است مشرف شویم، باز نخواهیم گشت؛ زیرا ورای آن چیزی است که بازگشت از آن ممکن نیست. و این همان سخن ابوسلیمان دارانی است که گفت: «اگر واصل می‌شدند، باز نمی‌گشتند.» منظور او [وصول] به قله گردنه است. پس هر کس از مردم بازگشته، تنها پیش از رسیدن به قله گردنه و اشراف بر ماورای آن بازگشته است. بنابراین، سبب موجب بازگشت با وجود این [سختی]، تنها طلب کمال است، اما [واصل] پایین نمی‌آید، بلکه آنان را از همان مقام خود دعوت می‌کند، و این همان سخن اوست: «با بصیرت». پس شهود می‌کند و مدعو را بر اساس شهود (الشهود) محقق می‌شناسد. و کسی که بازنگشته، رویی به سوی عالم ندارد و در آنجا «واقف» می‌ماند. و او همچنین «واقف» نامیده می‌شود؛ زیرا ورای آن گردنه تکلیفی نیست و کسی از آن پایین نمی‌آید مگر کسی که بمیرد. با این حال، برخی از ایشان، یعنی از واقفین، کسانی هستند که در آنچه در آنجا مشاهده می‌کنند، مستهلک (فانی) شده‌اند. و گروهی از ایشان یافت شده‌اند و این حالت بر ابویزید بسطامی و همچنین ابوعقال مغربی و دیگران دوام داشته است.\n\n### [مراتب واصلان به خدا]\n\nو بدان که پس از آنکه تو را از معنای وصول به خدا آگاه ساختم، واصلان دارای مراتبی هستند: برخی از ایشان وصولشان به اسم ذاتی است که جز بر ذات خداوند متعال دلالت نمی‌کند، از آن حیث که راهنمای ذات است، مانند اسم‌های عَلَم نزد ما که بر معنای دیگری که قابل تعقل باشد دلالت نمی‌کنند. پس حال این شخص استهلاک (فنا شدن) است، مانند فرشتگان مهیمن در جلال خداوند متعال و فرشتگان کروبی که جز او را نمی‌شناسند و جز او نیز ایشان را نمی‌شناسد، سبحانه. و برخی از ایشان از حیث اسمی که او را به خدا رسانده است، یا از حیث اسمی که از جانب خدا بر او تجلی (التجلی) می‌کند و آن را از اسمی که او را به سوی او رسانده است، اخذ می‌کند، به خدا می‌رسند. سپس این دو مرد یا دو شخص مذکور (که ممکن است زن نیز باشند اگر واصل شوند)، اگر وصولشان از حیث اسمی باشد که ایشان را رسانده و آن را مشاهده کرده باشند، پس برایشان عین الیقین حاصل شده است. آن اسم یا صفت فعلی را طلب می‌کند، مانند خالق و باری، یا صفت صفتی را، مانند شکور و حسیب، یا صفت تنزیهی را، مانند غنی. پس [وصول] بر حسب چیزی است که حقیقت آن اسم اقتضا می‌کند. و از این رو، مَشرَب، ذوق، سیراب شدن و وجود (الوجود) او از آن فراتر نمی‌رود. پس آنچه حقیقت آن اسم الهی اقتضا می‌کند، در حال او غالب می‌شود. پس او را به آن اسم اضافه می‌کنی و با آن او را می‌خوانی و می‌گویی: عبد الشکور، عبد الباری، عبد الغنی، عبد الجلیل و عبد الرزاق. و اگر وصولشان به اسمی غیر از اسمی باشد که ایشان را رسانده است، علمی غریب می‌آورد که حال او بر حسب اقتضای حقیقت آن اسم به او نمی‌دهد. پس در آن مقام از غرایب علم سخن می‌گوید. و ممکن است در آن علم چیزی باشد که کسی که به طریق قوم (صوفیه) آگاه نیست، آن را انکار کند و مردم ببینند که علم او بالاتر از حال اوست. و این شخص نزد ما بالاتر از کسی است که به مشاهده اسمی که او را رسانده است، رسیده است؛ زیرا این شخص [دوم] علمی غریب که با حالش مناسب نباشد نمی‌آورد، پس مردم می‌بینند که علم او پایین‌تر از حال اوست. ابویزید بسطامی (رضی الله عنه) می‌گوید: «عارف بالاتر از آن است که می‌گوید و عالم پایین‌تر از آن است که می‌گوید.» پس با این بیان، مراتب واصلان را برای تو محدود ساختیم؛ برخی از ایشان باز می‌گردند و برخی باز نمی‌گردند.\n\n### [اقسام بازگشت‌کنندگان از حق به سوی خلق]\n\nسپس بازگشت‌کنندگان بر دو دسته‌اند: برخی از ایشان به اختیار باز می‌گردند، مانند ابومدین، و برخی به اضطرار و اجبار باز می‌گردند، مانند ابویزید. هنگامی که حق (الحق) صفاتی را که شایسته است با آنها وارث وراثت ارشاد و هدایت باشد، بر او پوشاند، او از نزد خود گامی برداشت و بیهوش شد. ناگهان ندا آمد: «محبوب مرا به من بازگردانید، زیرا او را صبر دوری از من نیست.» چنین کسی تمایلی به خروج به سوی مردم ندارد و او صاحب حال است. اما مردان عالی‌مقام که بزرگان هستند و کسانی‌اند که عبودیت رسول خدا (صلی الله علیه و سلم) را به ارث برده‌اند، اگر به تبلیغ امر شوند، در پنهان کردن مقام خود از دیدگان مردم چاره‌اندیشی می‌کنند تا نزد مردم به گونه‌ای ظاهر شوند که عرفاً ندانند ایشان از اهل اختصاص الهی هستند. پس میان دعوت به سوی خدا و پنهان کردن مقام جمع می‌کنند. آنان مردم را با خواندن حدیث، کتب رَقائق (نرم‌کننده‌های دل) و حکایات سخنان مشایخ دعوت می‌کنند تا عامه مردم ایشان را تنها به عنوان ناقل بشناسند، نه اینکه از احوال خود از مقام قرب سخن می‌گویند. این در صورتی است که مأمور باشند و چاره‌ای جز آن نباشد. و اگر به آن مأمور نباشند، با عامه مردم هستند که حالشان پیوسته پوشیده است و مردم نه خیر و نه شری درباره ایشان اعتقاد ندارند.\n\n### [مردان واصل و فتوحاتشان در عالم مناسبات]\n\nسپس برخی از مردان واصل هستند که علم به اسماء الهی که ایشان را تدبیر می‌کند، برایشان کشف (الکشف) نمی‌شود، اما نظرشان به اعمال مشروعی است که با آنها سلوک می‌کنند. و آن اعمال هشت چیز است: دست، پا، شکم، زبان، گوش، چشم، فرج و قلب. جز اینها چیزی نیست. پس برای اینان هنگام وصولشان در عالم مناسبات گشایش (فتح) حاصل می‌شود. پس به آنچه هنگام وصول به بابی که کوبیده‌اند برایشان گشوده می‌شود، می‌نگرند. هنگامی که برایشان گشایش حاصل می‌شود، از آنچه از غیب بر ایشان تجلی (التجلی) می‌کند، می‌شناسند که آن باب گشوده شده کدام باب است. پس اگر آنچه برایشان مشهود شده، دست را به مناسبتی که برایشان ظاهر می‌شود طلب کند، او صاحب دست است. و اگر چشم را به مناسبتی طلب کند، صاحب چشم است. و همین‌طور سایر اعضا. و کرامات او اگر ولی باشد و معجزاتش اگر نبی باشد، از همین جنس خواهد بود. و منازل و معارف او نیز از همین جنس خواهد بود، چنانکه رسول خدا (صلی الله علیه و سلم) به آن اشاره کرد درباره کسی که وضو می‌گیرد و وضوی خود را کامل می‌کند، سپس دو رکعت نماز می‌خواند و در آن با خود سخنی نمی‌گوید؛ هشت در بهشت برای او گشوده می‌شود که از هر کدام بخواهد وارد می‌شود.\n\nهمچنین برای این شخص از اعمال اعضای او، هنگامی که طهارتش کامل شود و سرّش صافی گردد، هر چیزی که اعمال اعضای مکلف او اقتضا کند، گشایش حاصل می‌شود. و ما این مراتب عملی بر اعضا را در کتاب *مواقع النجوم* بیان کرده‌ایم.\n\n### [مردان واصل و امدادهایشان از انوار هشت‌گانه]\n\nسپس خداوند سبحان ایشان را از انواری که مناسب حالشان است، مدد می‌رساند. و آن انوار هشت‌گانه از حضرت نور هستند: برخی از ایشان امدادشان از نور برق است، و آن مشهد ذاتی است و بر دو نوع است: «خَلَب» (بی‌بار) و «غیر خَلَب» (باردار). اگر [این نور] صفاتی مانند صفات تنزیه را نتیجه ندهد، برق خلب است. و اگر نتیجه دهد، و جز یک امر را نتیجه نمی‌دهد، زیرا خداوند صفتی نفسی جز یکی که عین ذات اوست ندارد و صحیح نیست که دو تا باشد. پس اگر اتفاق افتد که در برخی از کشف‌ها (الکشف) تعریفی الهی از این نور برقی برای او حاصل شود، برق خلب نخواهد بود. و برخی از ایشان امدادشان از حضرت نور، نور خورشید است. و برخی امدادشان از نور بدر (ماه کامل) است. و برخی امدادشان از نور قمر (ماه) است. و برخی امدادشان از نور هلال است. و برخی امدادشان از نور سراج (چراغ) است. و برخی امدادشان از نور ستارگان است. و برخی امدادشان از نور آتش است. و نور دیگری نیست. و ما مراتب این انوار را نیز در *مواقع النجوم* ذکر کرده‌ایم. پس ادراک ایشان به اندازه مراتب انوارشان خواهد بود. پس مراتب با تمییز انوار متمایز می‌شوند و مردان با تمییز مراتب متمایز می‌شوند.\n\n### [واصلان از اولیا به حقایق انبیا]\n\nو برخی از مردان واصل کسانی هستند که معرفتی (المعرفة) به این مقام و به اسماء الهی ندارند، اما وصولی به حقایق و لطایف انبیا دارند. پس هنگامی که واصل می‌شوند، بابی از لطایف انبیا به اندازه اعمالی که در وقت فتح بر آن بوده‌اند، برایشان گشوده می‌شود. پس برای برخی از ایشان حقیقت موسی (علیه السلام) تجلی (التجلی) می‌کند و او موسوی المشهد می‌شود، و برای برخی لطیفه عیسی تجلی می‌کند، و همین‌طور سایر رسولان. پس به واسطه وراثت به آن رسول منسوب می‌شود، اما از حیث شریعت محمد (صلی الله علیه و سلم) که مقرر شده از شریعت آن پیامبری است که بر او تجلی کرده است. پس این واصل می‌یابد که در عمل خود که موجب گشایش او شده است، از جهت ظاهر یا باطن، شریعت پیامبر متقدمی را محقق ساخته است، مانند سخن خداوند متعال: «نماز را برای یاد من برپا دار.» زیرا این از شریعت موسی است و شارع ما آن را برای کسی که وقت نماز از او به خواب یا فراموشی فوت شده، مقرر کرده است. پس اینان از لطایف انبیا (علیهم السلام) اخذ می‌کنند و ما گروهی از ایشان را ملاقات کرده‌ایم. و اینان در انوار و اعضا و اسماء الهی ذوق و مَشرَب و سیرابی ندارند. و همچنین از واصلان به سوی خداوند متعال، به آن وصولی که بیان کردیم، کسی است که خداوند همه اینها را برای او جمع می‌کند، و برخی از ایشان دو مرتبه یا بیشتر از آن را دارند، به اندازه روزی‌ای که خداوند از آن برایشان قسمت کرده است. و هر یک از این افراد، اگر برای ارشاد و هدایت به سوی خلق بازگردانده شود، ذوق او از هر مرتبه‌ای که باشد، فراتر نمی‌رود. و خداوند «حق (الحق) را می‌گوید و او راه را هدایت می‌کند.»"
  },
  "page_count": 4
}