{
  "id": 140,
  "title": {
    "ar": "الباب الأربعون ومائة في معرفة مقام الحرية وأسراره وهو باب خطر",
    "en": "Chapter One Hundred and Forty: Concerning the Gnosis of the Station of Freedom (مقام الحرية) and its Secrets. It is a Perilous Chapter.",
    "ur": "خاموشی سے سوچیں:\n۱.  **Identify the core components:**\n    *   الباب الأربعون ومائة: Chapter ۱۴۰\n    *   في معرفة مقام الحرية: Concerning the knowledge of the station of freedom (Maqam al-Hurriyyah)\n    *   وأسراره: And its secrets\n    *   وهو باب خطر: And it is a dangerous chapter (a chapter of great significance/peril).\n\n۲.  **Translate and structure (literal draft):**\n    *   باب ایک سو چالیس، مقام حریت کی معرفت اور اس کے اسرار کے بارے میں، اور یہ ایک خطرناک باب ہے۔\n\n۳.  **Refine for scholarly Urdu (Ibn Arabi style):**\n    *   \"مقام الحرية\" should be kept as \"مقام الحرية\" (Maqam al-Hurriyyah) with the Urdu equivalent \"آزادی کا مقام\" or \"حریت کا مقام\". Since the instruction requires keeping specific terms in Arabic, I will use the Arabic term followed by the Urdu equivalent if necessary, but for a title, a direct, elegant translation is best.\n    *   \"خطر\" (khatar) in this context means significant, perilous, or profound. \"خطرناک\" (khatarnak) is appropriate.\n\n۴.  **Final Translation:**\n    *   باب ایک سو چالیس: مقام الحرية (مقام حریت) اور اس کے اسرار کی معرفت میں، اور یہ ایک اہم (یا خطرناک) باب ہے۔ (Using 'خطرناک' as it is the direct meaning, or 'اہم'/'پرخطر' for better flow). I will stick to 'خطرناک' as it reflects the gravity implied by Ibn Arabi.\n\n۵.  **Final Output (as requested):** باب ایک سو چالیس: مقام الحرية (مقام حریت) اور اس کے اسرار کی معرفت میں، اور یہ ایک خطرناک باب ہے۔ (I will use the more common scholarly phrasing for the number).\n\n۶.  **Revised Final Output (Focusing on elegance and directness):** باب ایک سو چالیس: مقام الحرية (مقام حریت) اور اس کے اسرار کی معرفت میں، اور یہ ایک پرخطر باب ہے۔ (Using 'پرخطر' for better flow than 'خطرناک').باب ایک سو چالیس: مقام الحرية (مقام حریت) اور اس کے اسرار کی معرفت میں، اور یہ ایک پرخطر باب ہے۔",
    "fa": "باب صد و چهلم در معرفت مقام حریّت و اسرار آن، و آن بابی خطیر است"
  },
  "content": {
    "ar": "## (الباب الأربعون ومائة في معرفة مقام الحرية وأسراره وهو باب خطر)\n\n\n> عبد الهوى آبق عن ملك مولاه *** وليس يخرج عنه فهو تياه‏\n\n\n> الحر من ملك الأكوان أجمعها *** وليس يملكه مال ولا جاه‏\n\n\n> فإن تعرض للتكوين أبطل ما *** قد كان أصله من ملك مولاه‏\n\n\n### [الحرية مقام الذات ولا يتخلص لعبد مقيد الصفات‏]\n\n\nاعلم وفقك الله أن الحرية مقام ذاتي لا إلهي ولا يتخلص للعبد مطلقا فإنه عبد لله عبودية لا تقبل العتق وأحلناها في حق الحق من كونه إلها لارتباطه بالمألوه ارتباط السيادة بوجود العبد والمالك بالملك والملك بالملك انظر في قوله إِنْ يَشَأْ يُذْهِبْكُمْ ... ويَأْتِ بِآخَرِينَ فنبه بإتيان قوم آخرين على هذا الارتباط فإنه يلزم من حقيقة الإضافة عقلا ووجودا تصور المتضايفين فلا حرية مع الإضافة والربوبية والألوهية إضافة ولما لم يكن بين الحق والخلق مناسبة ولا إضافة بل هو الغني عن العالمين وذلك لا يكون لذات موجودة إلا لذات الحق فلا يربطها كون ولا تدركها عين ولا يحيط بها حد ولا يفيدها برهان وجدانها في العقل ضروري كما إن نفي صفات التعلق التي تدخلها تحت التقييد نظري‏\n\n\n### [حرية العبد في عدميته وحرية الذات في وجودها]\n\n\nفإذا أراد العبد التحقق بهذا المقام فإنه مقام تحقق لا مقام تخلق ونظر أنه لا يصح له ذلك إلا بزوال الافتقار الذي يصحبه لإمكانه ويرى أن الغيرة الإلهية تقتضي أن لا يتصف بالوجود إلا الله لما يقتضيه الوجود من الدعوى فعلم بهذا النظر أن نسبة الوجود إلى الممكن محال لأن الغيرة حد مانع من ذلك فنظر إلى عينه فإذا هو معدوم لا وجود له وأن العدم له وصف نفسي فلم يخطر له الوجود بخاطر فزال الافتقار وبقي حرا في عدميته حرية الذات في وجودها\n\n\n### [وقوف الممكن مع عينه هو الحرية ومع استعداده هو العبودية]\n\n\nثم إنه أراد أن يعرف ما يناسب الأسماء الإلهية التي لهذه الذات من ذات الممكن المعدوم فرأى إن كل عين من عيون الممكنات على استعداد لا يكون في غيره ليقع التمييز بين الأعيان فما وقع بين ذات الممكن وذات الحق بالوجود للحق الواجب والعدم للممكن الواجب فجعل هذه الاستعدادات له بمنزلة الأسماء للحق والوجود في أعيان الممكنات لله تعالى فإذا ظهر في عين من أعيان الممكنات لنفسه باسم ما من الأسماء الإلهية أعطاه استعداد تلك العين اسما حادثا تسمى‏\nبه فيقال هذا عرش وهذا عقل وهذا قلم ولوح وكرسي وفلك وملك ونار وهوى وماء وأرض ومعدن ونبات وحيوان وإنسان ما بين أجناس وأنواع ثم سرت هذه الحقيقة في الأشخاص فيقال زيد وعمرو وهذا الفرس وهذا الحجر وهذه الشجرة هذا كله أعطاه استعداد أعيان الممكنات فاستدللت بآثارها في الوجود على ما هي عليه من الحقائق في ذاتها كما استدللت بآثار الأسماء في الوجود على الأسماء الإلهية وما للمسمى عين يقع عليها الإدراك فإذا وقف الممكن مع عينه كان حرا لا عبودية فيه وإذا وقف مع استعداداته كان عبدا فقيرا\n\n\n### [الحرية على مستوى الخاصة وفي لسان الخصوص‏]\n\n\nفليس لنا مقام في الحرية المطلقة إلا أن يكون مشهدنا ما ذكرناه فلا تحدث نفسك بغير هذا ومن لا يشهد هذا المقام فإنه لا يعلم أبدا مدلول قوله فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ أي هو غني عن الدلالة عليه إذ لو أوجد العالم للدلالة عليه لما صح له الغني عنه فاعلم المعرفة من نصب العالم دليلا وعلى من يدل وهو أظهر وأجلي من أن يستدل عليه بغير أو يتقد تعالى بسوى إذ لو كان الأمر كذلك لكان للدليل بعض سلطنة وفخر على المدلول ولو نصبه المدلول دليلا لم ينفك هذا الدليل عن مرتبة الزهو بكونه أفاد الدال به أمرا لم يتمكن للمدلول أن يوصل إليه إلا به فكان ببطل الغني والحرية وهما ثابتان لله تعالى فما نصب الأدلة عليه وإنما نصبها على المرتبة ليعلم أَنَّهُ لا إِلهَ إِلَّا هُوَ فهذا لسان الخصوص في الحرية\n\n\n### [الحرية على مستوى العامة وفي لسان العموم‏]\n\n\nوأما لسان العموم فالحرية عند القوم من لا يسترقه كون إلا الله فهو حر عن ما سوى الله فالحرية عبودة محققة لله فلا يكون عبد الغير الله الذي خلقه ليعبده فوفى بما خلق له فقيل فيه نعم العبد إنه أواب أي رجاع إلى العبودة التي خلق لها لأنه خلق محتاجا إلى كل ما في الوجود فما في الوجود شي‏ء إلا ويناديه بلسان فقر هذا العبد أنا الذي يفتقر إلي فارجع إلي فإذا كان عالما بالأمور علم إن الحق عند من ناداه وأنه فقير إلى ذلك السبب لكونه مستعدا لهذا الفقر إليه فإذا بحقيقته افتقر ثم نظر إلى معطي ما هو محتاج إليه في هذا السبب فرآه الاسم الإلهي فما افتقر إلا إلى الله من اسمه ولا افتقر إلا بنفسه من أثر استعداده فعلم ما الفقر ومن افتقر ومن افتقر إليه فلهذا أمر صَلَّى اللهُ عَليهِ وسَلَّم أن يقول رَبِّ زِدْنِي عِلْماً فقد نبهتك على ما فيه كفاية في الحرية وأسرارها مما لا تجده في غير هذا الكتاب من مصنفات غيرنا\n\n",
    "en": "Chapter One Hundred and Forty: Concerning the Knowledge of the Station of Freedom (مقام الحرية) and its Secrets, and it is a perilous chapter.\n\nThe slave of caprice (الهوى) is a runaway from the dominion of his Master,\nYet he does not depart from Him, so he is lost.\n\nThe Free one is he who possesses all the universes,\nAnd neither wealth nor status possesses him.\n\nBut if he exposes himself to creation (التكوين), he nullifies that\nWhich was his origin from the dominion of his Master.\n\n### [Freedom (الحرية) is the Station of the Essence (مقام الذات), and it is not attained by a servant bound by Attributes]\n\nKnow, may Allah grant you success, that Freedom (الحرية) is a station pertaining to the Essence (مقام ذاتي), not the Divinity (لا إلهي), and it is never attained absolutely by the servant, for he is a servant of Allah in a servitude (عبودية) that does not accept emancipation. We have established it (Freedom) for The Real (الحق) in respect to His being God (إلها), due to His connection with the object of worship (المألوه)—a connection like that of lordship (السيادة) to the existence of the servant, or the owner (المالك) to the owned, or the king (الملك) to the kingdom. Consider His saying: <<إِنْ يَشَأْ يُذْهِبْكُمْ ... ويَأْتِ بِآخَرِينَ>> (If He wills, He can do away with you... and bring others). By bringing other people, He draws attention to this connection, for the reality of relation (الإضافة), both rationally and existentially, necessitates the conception of the correlatives. Thus, there is no freedom alongside relation, and Lordship (الربوبية) and Divinity (الألوهية) are relations. Since there is neither suitability nor relation between The Real (الحق) and creation (الخلق)—rather, He is the Independent One (الغني) from the worlds—this (absolute independence) cannot belong to any existing essence except the Essence (الذات) of The Real. No cosmos (كون) binds it, no eye (عين) perceives it, no limit (حد) encompasses it, and no proof (برهان) benefits it. Its finding (وجدانها) in the intellect is necessary, just as the negation of the attributes of attachment (صفات التعلق) that would place it under restriction (التقييد) is theoretical.\n\n### [The Freedom of the Servant in his Non-existence (عدميته) and the Freedom of the Essence (الذات) in its Existence (وجودها)]\n\nIf the servant desires to realize this station (مقام), which is a station of realization (تحقق) and not a station of moral transformation (تخلق), he must consider that this realization is only valid for him through the removal of the need (الافتقار) that accompanies him due to his contingency (لإمكانه). He sees that the Divine Jealousy (الغيرة الإلهية) necessitates that none but Allah be described by Being (الوجود), due to the claim (الدعوى) that Being entails. Through this contemplation, he knows that attributing Being to the contingent (الممكن) is impossible, because Jealousy is a boundary preventing that. So he looks at his immutable essence (عينه) and finds that he is non-existent (معدوم), possessing no Being. Since non-existence (العدم) is his essential description (وصف نفسي), Being does not cross his mind. Thus, the need vanishes, and he remains free in his non-existence, just as the Essence (الذات) is free in Its Existence.\n\n### [The Contingent’s Standing with its Essence (عينه) is Freedom (الحرية), and its Standing with its Readiness (استعداده) is Servitude (العبودية)]\n\nThen he desired to know what corresponds to the Divine Names (الأسماء الإلهية) belonging to this Essence (الذات) from the essence of the non-existent contingent (الممكن المعدوم). He saw that every immutable essence (عين) among the contingent entities (عيون الممكنات) possesses a readiness (استعداد) that is not found in any other, so that distinction (التمييز) occurs between the essences. What occurred between the essence of the contingent and the Essence of The Real (الحق) was Being for The Real, Who is Necessary (الواجب), and non-existence for the contingent, which is necessary (الواجب). He made these readinesses (استعدادات) for the contingent entity equivalent to the Names for The Real, and the existence in the contingent entities belongs to Allah, the Exalted. When The Real manifests in one of the contingent entities for itself through one of the Divine Names, the readiness of that essence grants it an originated name (اسما حادثا) by which it is called. Thus, it is said: this is a Throne (عرش), this is Intellect (عقل), this is Pen (قلم), Tablet (لوح), Footstool (كرسي), Sphere (فلك), Angel (ملك), Fire (نار), Air (هوى), Water (ماء), Earth (أرض), Mineral (معدن), Plant (نبات), Animal (حيوان), and Human (إنسان)—encompassing genera and species. Then this reality permeates the individuals (الأشخاص), so it is said: Zayd, Amr, this horse, this stone, this tree. All of this is granted by the readiness of the contingent entities. You infer from their effects in Existence (الوجود) what their realities are in themselves, just as you infer the Divine Names from the effects of the Names in Existence, and the Named (المسمى) has no essence upon which perception falls. Therefore, when the contingent stands with its immutable essence (عينه), it is free, having no servitude (عبودية) in it; but when it stands with its readinesses (استعداداته), it is a poor servant.\n\n### [Freedom (الحرية) at the Level of the Elite and in the Language of Specificity]\n\nWe have no station in Absolute Freedom (الحرية المطلقة) unless our witnessing (مشهدنا) is what we have mentioned. Therefore, do not entertain any thought other than this. Whoever does not witness this station will never know the meaning of His saying: <<فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ>> (Indeed, Allah is Independent of the worlds). That is, He is independent of being indicated by them. For if He had created the world to indicate Him, His independence from it would not be valid. Know the Gnosis (المعرفة) of who established the world as a proof (دليلا) and upon whom it indicates. He is too manifest and too clear to be proven by another or to be preceded by anything else, exalted is He. If the matter were otherwise, the proof would possess some authority and pride over the proven. Even if the Proven One established it as a proof, this proof would not be free from the rank of vanity, having conveyed to the one seeking proof something that the Proven One could not convey except through it. This would nullify Independence (الغني) and Freedom (الحرية), both of which are established for Allah, the Exalted. Thus, He did not establish proofs upon Himself, but rather established them upon the rank (المرتبة) so that it may be known <<أَنَّهُ لا إِلهَ إِلَّا هُوَ>> (that there is no god but He). This is the language of specificity (لسان الخصوص) regarding Freedom.\n\n### [Freedom (الحرية) at the Level of the Common People and in the Language of Generality]\n\nAs for the language of generality (لسان العموم), Freedom (الحرية) according to these people is attained by the one whom no cosmos (كون) enslaves except Allah. Thus, he is free from everything other than Allah. Freedom, therefore, is a realized servitude (عبودة محققة) to Allah. He does not become the servant of other than Allah, Who created him to worship Him. So, he fulfilled that for which he was created, and it was said of him: \"An excellent servant (نعم العبد) he was, for he was ever-returning (أواب),\" meaning returning to the servitude (العبودة) for which he was created. This is because he was created in need (محتاجا) of everything in Existence (الوجود). There is nothing in Existence except that it calls out to him with the tongue of this servant’s poverty: \"I am the one you need, so return to me.\" If he is knowledgeable of affairs, he knows that The Real (الحق) is with the one who calls him, and that he is poor (فقير) toward that cause (السبب) because he is ready for this poverty toward it. Thus, by his reality, he becomes poor. Then he looks at the Giver of what he needs in this cause and sees that it is the Divine Name (الاسم الإلهي). He is poor only toward Allah through His Name, and he is poor only by himself through the effect of his readiness (استعداده). Thus, he knows what poverty is, who is poor, and to Whom he is poor. For this reason, the Prophet, may Allah bless him and grant him peace, was commanded to say: <<رَبِّ زِدْنِي عِلْماً>> (My Lord, increase me in Knowledge). I have alerted you to what is sufficient concerning Freedom (الحرية) and its secrets, which you will not find in any other book among the works of others.",
    "ur": "## (باب ایک سو چالیس: مقام حریت اور اس کے اسرار کی معرفت میں، اور یہ ایک خطرناک باب ہے)\n\nہوا و ہوس کا غلام اپنے آقا کی ملکیت سے بھاگا ہوا ہے،\nاور وہ اس سے باہر نہیں نکل سکتا، پس وہ بھٹکا ہوا ہے۔\n\nحُر وہ ہے جو تمام کائناتوں کا مالک ہو،\nاور اسے نہ مال ملکیت میں لے سکے اور نہ جاہ و مرتبہ۔\n\nپس اگر وہ تکوین (پیدا کرنے) کی طرف مائل ہو، تو وہ اس چیز کو باطل کر دے گا\nجو اس کی اصل میں اس کے آقا کی ملکیت سے تھی۔\n\n### [حریت مقام ذات ہے اور یہ صفات کے قید میں جکڑے ہوئے بندے کے لیے حاصل نہیں ہوتی]\n\nجان لو، اللہ تمہیں توفیق دے، کہ حریت (آزادی) ایک ذاتی مقام ہے، الٰہی مقام نہیں، اور یہ بندے کے لیے مطلقاً حاصل نہیں ہو سکتا، کیونکہ وہ اللہ کا بندہ ہے، ایسی بندگی کے ساتھ جو آزادی قبول نہیں کرتی۔ اور ہم نے اسے حق (الحق) کے حق میں اس کے معبود (الٰہ) ہونے سے خارج کر دیا ہے، کیونکہ اس کا تعلق مألوہ (جس کی عبادت کی جائے) سے ہے، یہ تعلق ایسا ہی ہے جیسے سیادت کا تعلق بندے کے وجود سے، مالک کا تعلق ملکیت سے، اور بادشاہ کا تعلق مملکت سے ہوتا ہے۔ اللہ تعالیٰ کے اس قول پر غور کرو:\n**إِنْ يَشَأْ يُذْهِبْكُمْ ... ويَأْتِ بِآخَرِينَ**\n(اگر وہ چاہے تو تمہیں لے جائے... اور دوسروں کو لے آئے)\nپس اس نے دوسرے لوگوں کو لانے کے ذریعے اس تعلق پر تنبیہ کی، کیونکہ اضافت (تعلق) کی حقیقت عقلی اور وجودی طور پر متضائفین (جن کے درمیان تعلق ہو) کے تصور کو لازم کرتی ہے۔ پس اضافت کے ساتھ کوئی حریت نہیں، اور ربوبیت اور الوہیت ایک اضافت ہیں۔\n\nاور چونکہ حق (الحق) اور خلق کے درمیان کوئی مناسبت اور کوئی اضافت نہیں، بلکہ وہ **غَنِيٌّ عَنِ الْعالَمِينَ** (تمام جہانوں سے بے نیاز) ہے، اور یہ (بے نیازی) کسی موجود ذات کے لیے نہیں ہو سکتی مگر صرف ذات حق (الحق) کے لیے۔ پس کوئی کَون (وجود) اسے باندھ نہیں سکتا، کوئی آنکھ اسے پا نہیں سکتی، کوئی حد اس کا احاطہ نہیں کر سکتی، اور کوئی برہان اسے فائدہ نہیں دے سکتا۔ اس کا وجدان عقل میں ضروری ہے، جیسا کہ تعلق کی صفات کی نفی جو اسے تقیید (قید) میں داخل کرتی ہیں، نظری ہے۔\n\n### [بندے کی حریت اس کی عدمیت میں اور ذات کی حریت اس کے وجود میں]\n\nپس جب بندہ اس مقام سے متحقق ہونا چاہے، اور یہ تحقق کا مقام ہے، تخلق (اختیار کرنے) کا مقام نہیں، اور وہ دیکھے کہ یہ اس کے لیے تب تک درست نہیں ہو سکتا جب تک کہ وہ افتقار (محتاجی) زائل نہ ہو جائے جو اس کے امکان (ممکن ہونے) کی وجہ سے اس کے ساتھ ہے۔ اور وہ دیکھتا ہے کہ غیرت الٰہیہ اس بات کا تقاضا کرتی ہے کہ وجود کے ساتھ صرف اللہ ہی متصف ہو، کیونکہ وجود دعویٰ کا تقاضا کرتا ہے۔ پس اس نظر سے اسے معلوم ہوا کہ ممکن کی طرف وجود کی نسبت محال ہے، کیونکہ غیرت ایک حد ہے جو اس سے مانع ہے۔ پس اس نے اپنی عین (حقیقت) کی طرف دیکھا تو وہ معدوم ہے، اس کا کوئی وجود نہیں، اور عدم اس کی ذاتی صفت ہے۔ پس وجود کا خیال بھی اس کے دل میں نہیں آیا، تو افتقار زائل ہو گیا، اور وہ اپنی عدمیت میں آزاد رہا، جیسے ذات (الحق) اپنے وجود میں آزاد ہے۔\n\n### [ممکن کا اپنی عین کے ساتھ ٹھہرنا حریت ہے اور اپنے استعداد کے ساتھ ٹھہرنا عبودیت]\n\nپھر اس نے ارادہ کیا کہ وہ جانے کہ اس ذات (الحق) کے الٰہی اسماء کے ساتھ معدوم ممکن کی ذات میں کیا مناسبت ہے۔ تو اس نے دیکھا کہ ممکنات کی ہر عین (حقیقت) ایک ایسے استعداد پر ہے جو کسی دوسرے میں نہیں، تاکہ اعیان کے درمیان تمیز واقع ہو۔ پس جو کچھ ممکن کی ذات اور حق (الحق) کی ذات کے درمیان واقع ہوا، وہ حق کے لیے واجب الوجود اور ممکن کے لیے واجب العدم ہے۔ پس اس نے ان استعدادات کو اپنے لیے اسماء کے مقام پر رکھا، جیسے حق (الحق) کے لیے اسماء ہیں، اور ممکنات کے اعیان میں وجود اللہ تعالیٰ کے لیے ہے۔\n\nپس جب وہ ممکنات کے اعیان میں سے کسی عین میں اپنے لیے الٰہی اسماء میں سے کسی اسم کے ساتھ ظاہر ہوتا ہے، تو اس عین کا استعداد اسے ایک حادث اسم عطا کرتا ہے جس سے وہ موسوم ہوتا ہے۔ پس کہا جاتا ہے: یہ عرش ہے، یہ عقل ہے، یہ قلم، لوح، کرسی، فلک، مَلَک (فرشتہ)، نار (آگ)، ہوا، پانی، زمین، معدن، نباتات، حیوان، اور انسان ہے، جو اجناس اور انواع کے درمیان ہیں۔ پھر یہ حقیقت اشخاص میں سرایت کر گئی، پس کہا جاتا ہے: یہ زید ہے، یہ عمرو ہے، یہ گھوڑا ہے، یہ پتھر ہے، یہ درخت ہے۔ یہ سب کچھ ممکنات کے اعیان کے استعداد نے عطا کیا۔ پس میں نے وجود میں ان کے آثار سے ان حقائق پر استدلال کیا جن پر وہ اپنی ذات میں ہیں، جیسا کہ میں نے وجود میں اسماء کے آثار سے الٰہی اسماء پر استدلال کیا، اور مسمیٰ کی کوئی ایسی عین نہیں جس پر ادراک واقع ہو۔ پس جب ممکن اپنی عین کے ساتھ ٹھہرتا ہے تو وہ حُر ہوتا ہے، اس میں کوئی عبودیت نہیں، اور جب وہ اپنے استعدادات کے ساتھ ٹھہرتا ہے تو وہ عبد (غلام) اور فقیر (محتاج) ہوتا ہے۔\n\n### [خاص لوگوں کے درجے پر حریت اور خواص کی زبان میں]\n\nپس ہمارے لیے مطلق حریت میں کوئی مقام نہیں، مگر یہ کہ ہمارا مشاہدہ وہی ہو جو ہم نے ذکر کیا ہے۔ پس اس کے علاوہ کسی اور چیز کا خیال اپنے دل میں نہ لاؤ۔ اور جو اس مقام کا مشاہدہ نہیں کرتا، وہ کبھی بھی اللہ تعالیٰ کے اس قول کے مفہوم کو نہیں جان سکتا:\n**فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ**\n(پس بے شک اللہ تمام جہانوں سے بے نیاز ہے)\nیعنی وہ اپنی دلالت (ثبوت) سے بے نیاز ہے۔ کیونکہ اگر اس نے عالم کو اپنی دلالت کے لیے پیدا کیا ہوتا، تو اس کے لیے اس سے بے نیاز ہونا درست نہ ہوتا۔ پس اس معرفت کو جانو کہ کس نے عالم کو دلیل بنایا اور وہ کس پر دلالت کرتا ہے، حالانکہ وہ اس سے کہیں زیادہ ظاہر اور روشن ہے کہ اس پر کسی غیر کے ذریعے استدلال کیا جائے یا وہ کسی دوسرے کے ذریعے مقدم ہو۔ کیونکہ اگر معاملہ ایسا ہوتا، تو دلیل کو مدلول پر کچھ سلطنت اور فخر حاصل ہوتا۔ اور اگر مدلول نے اسے دلیل بنایا ہوتا، تو یہ دلیل اس زعم کے مرتبے سے کبھی جدا نہ ہوتی کہ اس نے دال (دلالت کرنے والے) کو ایک ایسا امر فائدہ پہنچایا ہے جسے مدلول اس کے بغیر نہیں پہنچا سکتا تھا۔ پس اس سے غنی اور حریت باطل ہو جاتی، حالانکہ وہ دونوں اللہ تعالیٰ کے لیے ثابت ہیں۔ پس اس نے اپنے اوپر دلائل قائم نہیں کیے، بلکہ اس نے انہیں مرتبے پر قائم کیا تاکہ یہ معلوم ہو جائے کہ **أَنَّهُ لا إِلهَ إِلَّا هُوَ** (کہ اس کے سوا کوئی معبود نہیں)۔ پس یہ حریت میں خواص کی زبان ہے۔\n\n### [عام لوگوں کے درجے پر حریت اور عوام کی زبان میں]\n\nاور جہاں تک عوام کی زبان کا تعلق ہے، تو قوم کے نزدیک حریت یہ ہے کہ اسے اللہ کے سوا کوئی کَون (وجود) غلام نہ بنائے۔ پس وہ اللہ کے سوا ہر چیز سے آزاد ہے۔ پس حریت اللہ کے لیے ایک محقق شدہ عبودیت ہے۔ پس وہ اللہ کے غیر کا بندہ نہیں ہو سکتا، جس نے اسے اپنی عبادت کے لیے پیدا کیا، تو اس نے اس چیز کو پورا کیا جس کے لیے اسے پیدا کیا گیا تھا۔ پس اس کے بارے میں کہا گیا: **نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ** (وہ کیا ہی اچھا بندہ ہے، بے شک وہ بہت رجوع کرنے والا ہے)۔ یعنی وہ اس عبودیت کی طرف رجوع کرنے والا ہے جس کے لیے اسے پیدا کیا گیا، کیونکہ وہ وجود کی ہر چیز کا محتاج پیدا کیا گیا ہے۔ پس وجود میں کوئی چیز ایسی نہیں مگر وہ اس بندے کی فقر کی زبان سے اسے پکارتی ہے کہ میں وہ ہوں جس کا تو محتاج ہے، پس میری طرف رجوع کر۔\n\nپس جب وہ امور کا عالم ہوتا ہے، تو وہ جانتا ہے کہ حق (الحق) اس کے پاس ہے جس نے اسے پکارا، اور وہ اس سبب کا محتاج ہے، کیونکہ وہ اس فقر کے لیے مستعد ہے۔ پس وہ اپنی حقیقت کے ساتھ محتاج ہوا۔ پھر اس نے اس سبب میں اس چیز کے عطا کرنے والے کی طرف دیکھا جس کا وہ محتاج ہے، تو اس نے اسے اسم الٰہی پایا۔ پس وہ صرف اللہ کا محتاج ہوا، اس کے اسم کی طرف سے، اور وہ صرف اپنی ذات سے محتاج ہوا، اپنے استعداد کے اثر کی وجہ سے۔ پس اس نے جان لیا کہ فقر کیا ہے، کون محتاج ہوا، اور کس کا محتاج ہوا۔ اسی لیے نبی اکرم صلی اللہ علیہ وسلم کو حکم دیا گیا کہ وہ کہیں: **رَبِّ زِدْنِي عِلْماً** (اے میرے رب! میرے علم میں اضافہ فرما)۔ پس میں نے تمہیں حریت اور اس کے اسرار کے بارے میں کافی معلومات سے آگاہ کر دیا ہے، جو تمہیں ہماری تصنیفات کے علاوہ کسی اور کتاب میں نہیں ملیں گی۔",
    "fa": "(باب صد و چهلم در معرفت مقام حریّت (الحرية) و اسرار آن، و این بابی خطیر است)\n\nبنده هوس از ملک مولای خود گریزان است\nو از آن (ملکیت) خارج نمی‌شود، پس او سرگردان است.\n\nآزاد کسی است که تمام کائنات (الأكوان) را مالک شود\nو مال و جاه او را به ملکیت درنیاورد.\n\nپس اگر به تکوین روی آورد، باطل می‌کند\nآنچه اصلش از ملک مولایش بود.\n\n### [حریّت (الحرية) مقام ذات است و برای بنده مقید به صفات رهایی نمی‌یابد]\n\nبدان -خداوند تو را توفیق دهد- که حریّت (الحرية) مقامی ذاتی است نه الهی، و مطلقاً برای بنده رهایی نمی‌یابد، زیرا او بنده خداست با عبودیتی که آزاد شدن نمی‌پذیرد. و ما آن (حریّت) را در حق (الحق) از جهت معبود بودنش جایز ندانستیم، به دلیل ارتباطش با مورد پرستش (المألوه)؛ ارتباطی مانند سروری (السيادة) با وجود بنده، و مالک با ملک، و پادشاه با مُلک.\n\nبه این سخن خداوند بنگر: «إِنْ يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِآخَرِينَ» (اگر بخواهد شما را می‌برد و دیگرانی را می‌آورد). پس با آوردن قوم دیگری، بر این ارتباط هشدار داده است. زیرا از حقیقت اضافه (الإضافة)، تصور دو طرف نسبت (المتضايفين) عقلاً و وجوداً لازم می‌آید. پس با وجود اضافه، حریّتی نیست، و ربوبیت (الربوبية) و الوهیت (الألوهية) نیز اضافه هستند.\n\nو چون میان حق (الحق) و خلق مناسبت و اضافه‌ای نیست، بلکه او «الْغَنِيُّ عَنِ الْعَالَمِينَ» (بی‌نیاز از جهانیان) است، و این (بی‌نیازی) برای هیچ ذات موجودی جز ذات حق (ذات الحق) ممکن نیست؛ پس هیچ کونی آن را محدود نمی‌کند، هیچ چشمی آن را درک نمی‌کند، هیچ حدی آن را احاطه نمی‌کند، و هیچ برهانی به آن سودی نمی‌رساند. یافتن آن در عقل ضروری است، همان‌طور که نفی صفات تعلقی که آن را تحت تقیید درمی‌آورد، نظری است.\n\n### [حریّت (الحرية) بنده در عدمیتش و حریّت (الحرية) ذات در وجودش]\n\nپس اگر بنده بخواهد به این مقام تحقق یابد، که مقام تحقق است نه مقام تخلق، باید بنگرد که این امر برای او صحیح نیست مگر با زوال نیازمندی (الافتقار) که به دلیل امکانش همراه اوست. و می‌بیند که غیرت الهی (الغيرة الإلهية) اقتضا می‌کند که جز خداوند به وجود متصف نشود، به دلیل ادعایی که وجود اقتضا می‌کند.\n\nپس با این نظر دانست که نسبت دادن وجود به ممکن محال است، زیرا غیرت، حدّی بازدارنده از آن است. سپس به عین خود نگریست و دید که او معدوم است و وجودی ندارد، و عدم برای او وصفی نفسی است. پس وجود به خاطرش خطور نکرد، و نیازمندی (الافتقار) زائل شد و او در عدمیت خود آزاد باقی ماند، مانند حریّت (الحرية) ذات در وجودش.\n\n### [ایستادن ممکن با عین خود، حریّت (الحرية) است و با استعدادش، عبودیت (العبودية) است]\n\nسپس خواست بداند چه چیزی از ذات ممکن معدوم، مناسب اسماء الهی (الأسماء الإلهية) است که برای این ذات هستند. پس دید که هر عین (عين) از اعیان ممکنات (عيون الممكنات) بر استعدادی است که در غیر آن نیست، تا تمایز میان اعیان واقع شود. پس آنچه میان ذات ممکن و ذات حق (الحق) واقع شد، به واسطه وجود برای حق واجب و عدم برای ممکن واجب بود. پس این استعدادها را برای او (ممکن) به منزله اسماء برای حق (الحق) قرار داد، و وجود در اعیان ممکنات را برای خداوند متعال قرار داد.\n\nپس هنگامی که در عینی از اعیان ممکنات، برای خودش به واسطه اسمی از اسماء الهی (الأسماء الإلهية) ظاهر شد، استعداد آن عین به او اسمی حادث داد که به آن نامیده شد. پس گفته می‌شود: این عرش است، این عقل است، این قلم و لوح و کرسی و فلک و فرشته و آتش و هوا و آب و زمین و معدن و نبات و حیوان و انسان است، در میان اجناس و انواع. سپس این حقیقت در اشخاص جریان یافت، پس گفته می‌شود: زید و عمرو، و این اسب، و این سنگ، و این درخت. همه این‌ها را استعداد اعیان ممکنات به او بخشید.\n\nپس به آثار آن‌ها در وجود، بر حقایقی که در ذات خود دارند استدلال کردم، همان‌طور که به آثار اسماء در وجود، بر اسماء الهی (الأسماء الإلهية) استدلال کردم، در حالی که مسمّا (خداوند) عینی ندارد که ادراک بر آن واقع شود. پس اگر ممکن با عین خود بایستد، آزاد است و عبودیتی (عبودية) در او نیست، و اگر با استعدادهایش بایستد، بنده و فقیر است.\n\n### [حریّت (الحرية) در سطح خواص و در زبان خصوص]\n\nپس ما را در حریّت (الحرية) مطلقه مقامی نیست، مگر اینکه مشهد ما همان باشد که ذکر کردیم. پس با غیر این، با خود سخن مگو. و کسی که این مقام را شهود نکند، هرگز مدلول این سخن خداوند را نمی‌داند: «فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ» (پس همانا خداوند از جهانیان بی‌نیاز است).\n\nیعنی او از دلالت بر خود بی‌نیاز است، زیرا اگر عالم را برای دلالت بر خود ایجاد می‌کرد، بی‌نیازی (الغني) از آن برایش صحیح نبود. پس معرفت کسی را بدان که عالم را دلیل قرار داده است و بر چه کسی دلالت می‌کند، در حالی که او آشکارتر و جلی‌تر از آن است که با غیر بر او استدلال شود یا با چیزی جز او پیشی گرفته شود. زیرا اگر امر چنین بود، دلیل بر مدلول نوعی سلطنت و فخر داشت. و حتی اگر مدلول، آن را دلیل قرار می‌داد، این دلیل از مرتبه غرور جدا نمی‌شد، به این دلیل که امری را به دلالت‌کننده رسانده که مدلول نمی‌توانست جز به واسطه آن به آن برسد. پس بی‌نیازی (الغني) و حریّت (الحرية) باطل می‌شدند، در حالی که این دو برای خداوند متعال ثابت هستند. پس او ادله را بر ذات خود نصب نکرده، بلکه آن‌ها را بر مرتبه نصب کرده تا دانسته شود: «أَنَّهُ لا إِلهَ إِلَّا هُوَ» (که هیچ معبودی جز او نیست). پس این زبان خواص در حریّت (الحرية) است.\n\n### [حریّت (الحرية) در سطح عوام و در زبان عموم]\n\nو اما زبان عموم، حریّت (الحرية) نزد این قوم کسی است که هیچ کونی جز خداوند او را به بندگی نکشد. پس او از غیر خدا آزاد است. بنابراین حریّت، عبودیتی (عبودة) محقق شده برای خداست. پس او بنده غیر خدا که او را برای عبادت خلق کرده، نمی‌شود.\n\nپس به آنچه برای آن خلق شده وفا کرده است، و درباره او گفته شده: «نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ» (چه بنده خوبی است، همانا او بسیار بازگشت‌کننده است)، یعنی بسیار بازگشت‌کننده به عبودیتی (العبودة) که برای آن خلق شده است، زیرا او محتاج به هر آنچه در وجود است، خلق شده است. پس هیچ چیزی در وجود نیست مگر اینکه با زبان فقر این بنده، او را ندا می‌دهد: «من آنم که او به من نیازمند است، پس به سوی من بازگرد.» پس اگر عالم به امور باشد، می‌داند که حق نزد کسی است که او را ندا داده، و او به آن سبب فقیر است، به دلیل اینکه برای این فقر به سوی آن مستعد است.\n\nپس با حقیقت خود نیازمند شد، سپس به بخشنده آنچه در این سبب به آن محتاج است نگریست و آن را اسم الهی (الاسم الإلهي) دید. پس جز به سوی خداوند از اسم او نیازمند نشد، و جز به واسطه خودش از اثر استعدادش نیازمند نشد. پس دانست که فقر چیست، و چه کسی نیازمند شد، و چه کسی مورد نیاز واقع شد. به همین دلیل پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) امر شد که بگوید: «رَبِّ زِدْنِي عِلْماً» (پروردگارا، علم مرا زیاد کن). به راستی تو را بر آنچه در حریّت (الحرية) و اسرار آن کفایت می‌کند، آگاه ساختم؛ چیزی که در غیر این کتاب از تألیفات دیگران نخواهی یافت."
  },
  "page_count": 2
}