{
  "id": 100,
  "title": {
    "ar": "الباب الموفي مائة في مقام الخوف",
    "en": "Chapter 100: On the Station of Fear (مقام الخوف)",
    "ur": "خوف کے مقام میں ایک سوواں باب",
    "fa": "باب صدم در مقام خوف (ترس)"
  },
  "content": {
    "ar": "## (الباب الموفي مائة في مقام الخوف)\n\n\n> خف الله يا مسكين إن كنت مؤمنا *** إذا جاء سلطان المنازع في الأمر\n\n\n> ف إِنْ جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَها تنل *** بها رتب العليا في عالم الأمر\n\n\n> وما قلته بل قاله الله معلما *** كما جاء في القرآن في محكم الذكر\n\n\n### [الخوف مقام الإلهيين وله الاسم الله‏]\n\n\nاعلم أيدك الله وعصمك إن الخوف مقام الإلهيين له الاسم الله لأنه متناقض الحكم فإنه يخاف من الحجاب ويخاف من رفع الحجاب أما خوفه من الحجاب فلما فيه من الجهل بما هو حجاب عنه وأما خوفه من رفع الحجاب فلذهاب عينه عند رفعه فتزول الفائدة والالتذاذ بالجمال المطلق آية المحجوب قوله تعالى كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ في معرض الذم وأما الحديث‏\n\n\nفقوله صَلَّى اللهُ عَليهِ وسَلَّم في الحجب لو كشفها أو لو رفعها لأحرقت سبحات وجهه ما أدركه بصره من خلقه‏\n\n\nوما أشبه هذا المقام يقول القائل‏\n\n\n> الليل إن وصلت كالليل إن هجرت *** أشكو من الطول ما أشكو من القصر\n\n\n### [مقام الخوف هو مقام الحيرة والوقوف‏]\n\n\nفمقام الخوف مقام الحيرة والوقوف لا يتعين له ما يرجح لقيام شاهد كل جانب عنده ومن خرج عن هذا الخوف إلى الخوف من متعلق غيره فهو خوف وليس بمقام فإن كل خوف ما عدا هذا فليس له هذا الحكم فإن المقام كل ما له قدم راسخ في الألوهة وما ليس له ذلك فليس بمقام وإنما هو حال يرد ويزول بزوال حكم التعلق والمتعلق ببشرى أو بغيرها والخوف الذي هو مقام يستصحب للعالم بالله الذي يعلم ما ثم ومن لا يعلم ذلك فلا يستصحبه خوف إلا إلى أول قدم يضعه من الصراط في الجنة أو حاضرها فالخائف هو الذي يعلم ما هو التجلي وما هو الذي يرى يوم القيامة وهو الذي يعلم أن أهل النار لهم تجل يزيد في عذابهم كما إن لأهل الجنة تجليا يزيد في نعيمهم أهل النار محجوبون عنه ولهذا قال عن ربهم أهل النار والرب المربي والمصلح‏\n\n\n### [باب العلم بالله من حيث ذاته مغلق‏]\n\n\nفباب العلم بالله دون ما سواه مغلق من حيث ذاته وهو المطلوب بالتجلي فالخلق في عين الجهل بهذا الذي ذكرناه إلا من رحم الله ولقد أصابت المعتزلة في إنكارها الرؤية لا في دليلها على ذلك فلو لم تذكر دلالتها لتخيلنا أنها عالمة بالأمر كما علمه أهل الله لكنها في دلالتها كانت كما قال بعضهم لصاحبه حين قال له ما أعجبه وأخذ به فلما ذكر له الإسناد فيما أورده زال عنه ذلك الفرح وقال له أفسدت حين أسندت فمن لم يعرف الله هكذا لم يعرفه المعرفة المطلوبة منه‏\n\n",
    "en": "## Chapter 100: On the Station of Fear (مقام الخوف)\n\nFear Allah, O dependent one, if you are a believer,\nWhen the authority of the contender comes in the matter.\nSo <<if they incline to peace, you also incline to it>> (Quran 8:61), that you may attain\nBy it the highest degrees in the World of Command (عالم الأمر).\nI did not say this, rather Allah said it, teaching,\nAs it came in the Quran, in the decisive Revelation.\n\n### [The Station of Fear is the Station of the Divine Ones and it pertains to the Name Allah]\n\nKnow, may Allah support and protect you, that Fear (الخوف) is the station of the Divine Ones (الإلهيين) and pertains to the Name Allah, because its ruling is contradictory. For one fears the Veiling (الحجاب) and fears the lifting of the Veiling. As for fearing the Veiling, it is due to the ignorance contained therein regarding that which veils him. As for fearing the lifting of the Veiling, it is due to the vanishing of his essence (عين) upon its removal, whereby the benefit and the delight in the Absolute Beauty cease.\n\nThe sign of the veiled one is His saying, the Exalted: <<Nay! Indeed, from their Lord, that Day, they will be veiled>> (Quran 83:15), which is presented in the context of censure.\n\nAs for the Hadith, it is his saying, peace and blessings be upon him, concerning the Veils: \"If He were to uncover them, or if He were to lift them, the glories (سبحات) of His Face would burn whatever His sight perceives of His creation.\"\n\nHow similar this station is to the saying of the poet:\n\nThe night, if I unite, is like the night if I separate;\nI complain of the length what I complain of the shortness.\n\n### [The Station of Fear is the Station of Bewilderment and Halting]\n\nThe station of Fear (الخوف) is thus the station of Bewilderment (الحيرة) and Halting (الوقوف). That which is preferable is not determined for the aspirant, due to the presence of a witness for every aspect with him. Whoever departs from this Fear to fear something related to other than Him, that is fear, but it is not a station (مقام). For every fear other than this does not possess this specific nature.\n\nThe station (مقام) is everything that has a firm footing in Divinity (الألوهة). Whatever does not possess that is not a station, but merely a state (حال) that comes and vanishes with the removal of the ruling of the attachment and the attached object, whether by glad tidings or otherwise.\n\nThe Fear which is a station accompanies the Gnostic (العالم بالله) who knows what is there. As for the one who does not know that, fear does not accompany him except until the first step he places from the Bridge (الصراط) into Paradise or its immediate presence.\n\nThus, the fearful one is he who knows what the Theophany (التجلي) is and what is seen on the Day of Resurrection. He is also the one who knows that the people of the Fire have a Theophany (تجلي) that increases their torment, just as the people of Paradise have a Theophany that increases their bliss. The people of the Fire are veiled from Him, and this is why He said concerning their Lord (ربهم)—the Lord (الرب) being the Educator (المربي) and the Reformer (المصلح)—the people of the Fire [are veiled].\n\n### [The Door of Knowledge of Allah from the Perspective of His Essence is Closed]\n\nThe door of Knowledge (العلم) of Allah, apart from what is other than Him, is closed from the perspective of His Essence (الذات), and He is the one sought through the Theophany (التجلي). Thus, creation is in the very essence of ignorance regarding what we have mentioned, except for those upon whom Allah has mercy.\n\nThe Mu'tazila were indeed correct in their denial of the Vision (الرؤية), but not in their proof for it. Had they not mentioned their evidence, we would have imagined that they knew the matter just as the People of Allah (أهل الله) know it. But in their evidence, they were like the one who said to his companion, when the companion mentioned something that astonished him and captivated him, but when the companion mentioned the chain of transmission (الإسناد) for what he had presented, that joy vanished from him, and he said to him, \"You ruined it when you provided the chain of transmission.\"\n\nTherefore, whoever does not know Allah in this manner has not known Him with the Gnosis (المعرفة) required of him.",
    "ur": "## (باب نمبر سو: مقام خوف کے بیان میں)\n\nاے مسکین! اگر تو مومن ہے تو اللہ سے خوف کر، جب امر (حکم) میں جھگڑنے والے کا سلطان (غلبہ) آ جائے۔\nپس اگر وہ صلح کی طرف مائل ہوں تو تم بھی اس کی طرف مائل ہو جاؤ (فَاجْنَحْ لَها)، اس کے ذریعے تم عالمِ امر میں بلند درجات حاصل کرو گے۔\nاور یہ میں نے نہیں کہا، بلکہ اللہ نے تعلیم دیتے ہوئے فرمایا ہے، جیسا کہ قرآن میں محکم ذکر میں آیا ہے۔\n\n### [خوف الٰہیین کا مقام ہے اور اس کے لیے اسم اللہ ہے]\n\nجان لو، اللہ تمہاری تائید کرے اور تمہیں محفوظ رکھے، کہ خوف الٰہیین (الإلهيين) کا مقام ہے، اس کے لیے اسم اللہ (الاسم الله) ہے، کیونکہ یہ حکم میں متناقض ہے۔ وہ حجاب (الحجاب) سے بھی خوف کھاتا ہے اور حجاب کے اٹھ جانے (رفع الحجاب) سے بھی خوف کھاتا ہے۔ جہاں تک حجاب سے خوف کا تعلق ہے، تو وہ اس جہالت کی وجہ سے ہے جو اس چیز کے بارے میں ہے جو اس سے پردہ کیے ہوئے ہے۔ اور جہاں تک حجاب کے اٹھ جانے سے خوف کا تعلق ہے، تو وہ اس کے اٹھنے پر اس کی اپنی ہستی (عین) کے فنا ہو جانے کی وجہ سے ہے، جس سے فائدہ اور جمال مطلق (الجمال المطلق) سے لذت حاصل کرنے کا عمل زائل ہو جائے گا۔ محجوب کی نشانی اللہ تعالیٰ کا یہ قول ہے:\n**كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ** (ہرگز نہیں! بے شک وہ اس دن اپنے رب سے ضرور پردے میں ہوں گے)۔\nیہ آیت مذمت کے سیاق میں ہے۔ اور جہاں تک حدیث کا تعلق ہے، تو حجابات کے بارے میں نبی اکرم صلی اللہ علیہ وسلم کا فرمان ہے:\n\"اگر وہ انہیں کھول دے یا انہیں اٹھا دے، تو اس کے چہرے (ذات حق) کی عظمت و جلال (سبحات وجهه) کی شعاعیں اس کی مخلوق میں سے ہر اس چیز کو جلا ڈالیں گی جس پر اس کی نگاہ پڑے۔\"\n\nاور یہ مقام کس قدر مشابہ ہے، جیسا کہ کہنے والا کہتا ہے:\nوصل کی رات بھی ہجر کی رات کی مانند ہے، میں طول کی شکایت کرتا ہوں جس طرح قصر (کمی) کی شکایت کرتا ہوں۔\n\n### [مقام خوف، حیرت اور توقف کا مقام ہے]\n\nپس مقام خوف (مقام الخوف)، حیرت (الحيرة) اور توقف (الوقوف) کا مقام ہے، اس کے لیے کوئی ترجیحی پہلو متعین نہیں ہوتا کیونکہ اس کے پاس ہر جانب کا شاہد موجود ہوتا ہے۔ اور جو شخص اس خوف سے نکل کر کسی دوسرے متعلق سے خوف کی طرف جاتا ہے، تو وہ خوف تو ہے لیکن مقام (المقام) نہیں ہے۔ کیونکہ اس خوف کے علاوہ ہر خوف کے لیے یہ حکم نہیں ہے۔ مقام وہ ہے جس کا الوہیت (الألوهة) میں راسخ قدم ہو، اور جس کے لیے یہ نہ ہو وہ مقام نہیں ہے، بلکہ وہ ایک حال (حال) ہے جو وارد ہوتا ہے اور تعلق کے حکم کے زائل ہونے سے زائل ہو جاتا ہے، خواہ وہ تعلق کسی بشارت سے ہو یا کسی اور چیز سے۔ اور وہ خوف جو مقام ہے، وہ اللہ کے عارف (العالم بالله) کے ساتھ رہتا ہے جو جانتا ہے کہ وہاں کیا ہے۔ اور جو یہ نہیں جانتا، تو خوف اس کے ساتھ نہیں رہتا مگر صراط (الصراط) سے جنت میں یا اس کے حاضر مقام میں پہلا قدم رکھنے تک۔ پس خائف وہ ہے جو جانتا ہے کہ التجلی (ظہور الٰہی) کیا ہے اور وہ کیا ہے جو قیامت کے دن دیکھا جائے گا۔ اور وہ یہ بھی جانتا ہے کہ اہل نار کے لیے بھی ایک التجلی (ظہور الٰہی) ہے جو ان کے عذاب میں اضافہ کرتا ہے، جیسا کہ اہل جنت کے لیے ایک التجلی ہے جو ان کی نعمتوں میں اضافہ کرتا ہے۔ اہل نار اس سے محجوب (پردے میں) ہیں۔ اسی لیے اہل نار کے بارے میں فرمایا: \"اپنے رب سے\"، اور رب (الرب) پالنے والا اور اصلاح کرنے والا ہے۔\n\n### [اللہ کی ذات کے اعتبار سے علم کا دروازہ بند ہے]\n\nپس اللہ کا علم، اس کی ذات (ذات) کے اعتبار سے، اس کے ماسوا کے علم کے مقابلے میں بند ہے۔ اور یہی وہ ہے جو التجلی (ظہور الٰہی) کے ذریعے مطلوب ہے۔ پس مخلوق اس چیز کے بارے میں جو ہم نے ذکر کی ہے، عین جہالت میں ہے، سوائے ان کے جن پر اللہ نے رحم کیا۔ اور معتزلہ نے رؤیت (اللہ کے دیدار) کے انکار میں درست بات کہی، لیکن اس پر ان کی دلیل درست نہیں تھی۔ اگر وہ اپنی دلیل کا ذکر نہ کرتے تو ہم یہ گمان کرتے کہ وہ اس امر کو جانتے ہیں جیسا کہ اہل اللہ نے جانا ہے۔ لیکن وہ اپنی دلیل میں ایسے تھے جیسا کہ کسی نے اپنے ساتھی سے کہا جب اس نے اسے کوئی بات بتائی جو اسے بہت اچھی لگی اور اس نے اسے قبول کر لیا، لیکن جب اس نے اپنی پیش کردہ بات کی سند (اسناد) بیان کی تو اس کی وہ خوشی زائل ہو گئی اور اس نے کہا: \"جب تم نے سند بیان کی تو تم نے اسے خراب کر دیا۔\" پس جس نے اللہ کو اس طرح نہیں جانا، اس نے اسے وہ مطلوبہ معرفت (المعرفة المطلوبة) حاصل نہیں کی جو اس سے مطلوب ہے۔",
    "fa": "(باب صدم در مقام خوف)\n\nای مسکین، اگر مؤمن هستی، از خدا بترس، *** آنگاه که سلطانِ نزاع‌کننده در امر (حکومت) فرا رسد.\nپس اگر [دشمنان] به صلح گرایش یافتند، تو نیز به آن گرایش یاب (فَإِنْ جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَها)، *** تا به واسطه آن به مراتب والا در عالم امر دست یابی.\nو این را من نگفته‌ام، بلکه خداوند آن را به عنوان آموزگار فرموده است، *** چنانکه در قرآن، در ذکر محکم (آیات استوار) آمده است.\n\n### [خوف، مقام الهیون است و اسم الله از آن اوست]\n\nبدان، خداوند تو را یاری دهد و حفظ کند، که خوف (الخوف) مقام الهیون (الإلهيين) است و اسم الله از آن اوست، زیرا حکمی متناقض دارد؛ شخص هم از حجاب (الحجاب) می‌ترسد و هم از برداشته شدن حجاب. اما ترس او از حجاب به دلیل جهلی است که در آن نسبت به آنچه از او پوشیده شده وجود دارد. و اما ترس او از برداشته شدن حجاب، به دلیل زوال عین (هویت) او هنگام رفع حجاب است، در نتیجه فایده و لذت بردن از جمال مطلق (الجمال المطلق) از بین می‌رود. نشانه محجوب (المحجوب) این سخن خداوند متعال است که در مقام نکوهش می‌فرماید: «هرگز چنین نیست، آنان در آن روز از پروردگارشان محجوبند» (كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ). و اما حدیث:\n\nسخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) درباره حجاب‌ها این است: «اگر آنها را کنار می‌زد یا برمی‌داشت، انوار جلال وجه او هر آنچه را که دیده‌اش از خلق درک می‌کرد، می‌سوزاند.»\n\nو چه شبیه است این مقام به سخن گوینده‌ای که می‌گوید:\n\nشبی که وصال است، چون شبی است که هجران است، *** از درازی‌اش شکوه می‌کنم، همان‌گونه که از کوتاهی‌اش شکوه می‌کنم.\n\n### [مقام خوف، مقام حیرت و توقف است]\n\nپس مقام خوف (الخوف)، مقام حیرت (الحيرة) و توقف (الوقوف) است؛ برای آن ترجیحی تعیین نمی‌شود، زیرا شاهد هر دو جانب نزد سالک برقرار است. و هر کس از این خوف خارج شود و به خوفی از متعلق دیگری روی آورد، آن خوف است نه مقام (المقام). زیرا هر خوفی غیر از این، چنین حکمی ندارد. مقام (المقام) آن چیزی است که قدمی راسخ در الوهیت (الألوهة) دارد، و آنچه چنین نباشد، مقام نیست، بلکه حالی (حال) است که وارد می‌شود و با زوال حکم تعلق و متعلق، چه با بشارت باشد یا غیر آن، از بین می‌رود. و خوفی که مقام است، برای عارف بالله (العالم بالله) که می‌داند در آنجا چه هست، همراهی می‌شود. و کسی که این را نمی‌داند، خوفی او را همراهی نمی‌کند مگر تا اولین قدمی که از صراط در بهشت یا در محضر آن می‌گذارد. پس خائف کسی است که می‌داند تجلی (التجلي) چیست و چه چیزی در روز قیامت دیده می‌شود. و او کسی است که می‌داند اهل آتش تجلی‌ای دارند که بر عذابشان می‌افزاید، همان‌گونه که اهل بهشت تجلی‌ای دارند که بر نعیمشان می‌افزاید. اهل آتش از او محجوبند، و به همین دلیل درباره پروردگارشان (ربهم) سخن گفته است؛ اهل آتش و رب (الرب) که پرورنده و اصلاح‌کننده است.\n\n### [باب علم به خدا از حیث ذات او بسته است]\n\nپس باب علم به خدا، جدای از آنچه غیر اوست، از حیث ذات او بسته است، و اوست که با تجلی (التجلي) طلب می‌شود. خلق در عین جهل به این چیزی هستند که ذکر کردیم، مگر کسی که خداوند به او رحم کند. و معتزله در انکار رؤیت (دیدار خداوند) درست گفته‌اند، اما نه در دلیلشان بر آن. اگر دلیل خود را ذکر نمی‌کردند، گمان می‌کردیم که آنان به امر آگاهند، همان‌گونه که اهل الله (أهل الله) آن را می‌دانند. اما آنان در دلیل خود، مانند کسی بودند که به دوستش گفت: «چه شگفت‌انگیز است این سخن» و آن را پذیرفت، اما هنگامی که اسناد (سند) آنچه را که آورده بود، ذکر کرد، آن شادی از او زائل شد و به او گفت: «هنگامی که اسناد دادی، تباه کردی.» پس کسی که خدا را این‌گونه نشناسد، او را به معرفت (المعرفة) مطلوب نشناخته است."
  },
  "page_count": 1
}