{
  "id": 416,
  "title": {
    "ar": "الباب السادس عشر وأربعمائة في معرفة منازلة عين القلب",
    "en": "Chapter Four Hundred and Sixteen: Concerning the Gnosis of the Spiritual Stations of the Essence of the Heart.",
    "ur": "باب چار سو سولہ: عین قلب (عين القلب) کے روحانی مقامات کی معرفت (المعرفة) کے بیان میں۔",
    "fa": "باب چهارصد و شانزدهم در معرفت منازل عین القلب (عين القلب)"
  },
  "content": {
    "ar": "## «الباب السادس عشر وأربعمائة في معرفة منازلة عين القلب»\n\n\n> عين القلوب من الوجود الناظر *** وعليه سادات الطريق تناظر\n\n\n> فانظره في تقليبها متقلبا *** ومقلبا فهو الوجود الحاضر\n\n\n> ما ثم إلا ما يعاين وقته *** والماضي والآتي حديث سائر\n\n\n> الظرف في الأكوان ليس بكائن *** ما ثم ثم وثم حكم قاصر\n\n\n> هذا هو الحق الذي ظهرت به *** أعياننا وأنا العليم الخابر\n\n\n> لو قلت ما هو لم تسعه عقولكم *** أين العقول وليس ثم مغاير\n\n\n### [الذكر يورث الاطمئنان‏]\n\n\nقال الله تعالى الَّذِينَ آمَنُوا وتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ الله الذي ذكرها به أَلا بِذِكْرِ الله الذي ذكرها به إذا كانت مؤمنة تَطْمَئِنُّ الْقُلُوبُ في تقلبها فتسكن إلى التقليب مع الأنفاس وتعلم أن الثبات على حال واحدة لا يصح فإن صورة الحق لا تعطي الضيق ولا اتساع لها ولا مجال إلا في التقليب ولا تقليب للحق إلا في أعيان الممكنات وأعيان الممكنات لا نهاية لها فالتقليب الإلهي فيها لا يتناهى فهو كل يوم في شأن حيث كان فما زال الأمر مذ كان ولا يزال من حال إلى حال فالعين‏\nآلة وبالبصر يقع الإدراك للمبصر وهو الحق فبه تبصر ومن أبصر أمرا فقد علمه وإذا علمه فقد سكن إليه فأبصر التقليب دائما فعلمه دائما فاطمأن به وسكن إليه فهو في كل نفس ينظر إلى آثار ربه في قلبه فيما يقيمه وفيما خرج عنه ما يعطيه فيه وينبهه به عليه فلا يزال صاحب هذا المقام في كل نفس في علم جديد فهو في خلق جديد وغيره في لبس من هذا الخلق الجديد أمر الله تبارك وتعالى نبيه صَلَّى اللهُ عَليهِ وسَلَّم أن يقول رَبِّ زِدْنِي عِلْماً أي ارفع عني اللبس الذي يحول بيني وبين العلم بالخلق الجديد فيفوتني خير كثير حصل في الوجود لا أعلمه والحجاب ليس إلا التشابه والتماثل ولو لا ذلك لما التبس على أحد الخلق الجديد الذي لله في العالم في كل نفس بكل شأن وما تنبه لهذا من الطوائف إلا القائلون بتجديد العالم في كل زمان فرد وهم طائفة يقال لهم الحسبانية ولم يبلغوا فيه مبلغ الأمر على ما هو عليه لكنهم قاربوا كما قارب القائلون بأن العرض لا يبقى زمانين والعرض كل ما لا قيام له بنفسه فهؤلاء أيضا قاربوا الأمر وما بلغوا فيه ما هو الأمر عليه إلا القاضي أبو بكر بن الطيب فإنه قارب في بعض الأمر في موضعين الموضع الواحد قوله في الأكوان إنها نسب لا عين لها وقوله فيما نسب إلى الحق من صفة إن ذلك الحكم لمعنى ما هو عين المعنى الآخر الذي أعطى حكما آخر فقارب أيضا ولم يبلغ فيه ما هو الأمر عليه وإنما تميز عمن يقول إن سمع الحق وبصره عين علمه والباقلاني لا يقول بهذا ورأيت بفأس أبا عبد الله الكناني إمام أهل الكلام في زمانه بالمغرب وقد سألني يوما في الصفات الإلهية فقلت له ما هو الأمر عليه عندنا ثم قلت له فما قولك أنت فيها هل أنت مع المتكلمين أو تخالفهم في شي‏ء مما ذهبوا إليه فيها فقال لي أنا أقول لك ما عندي أما إثبات الزائد على الذات المسمى صفة فلا بد منه عندي وعند الجماعة وأما كون ذلك الزائد عينا واحدة لها أحكام مختلفة كثيرة أو لكل حكم معنى زائد أوجبه ما عندنا دليل على أحديته ولا على تكثره هذا هو الإنصاف عندي في هذه المسألة وكل من تكلف في غير هذا دليلا فهو مدخول والزائد لا بد منه غير إنا نقول ما هو هو ولا هو غيره لما قد علمت يا سيدنا من مذهب أهل هذا الشأن في الغيرين فقلت له يا أبا عبد الله أقول لك ما\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لأبي بكر في تعبيره الرؤيا أصبت بعضا وأخطأت بعضا\n\n\nفقال لي لا أتهمك والله فيما تعلمه ولا أقدر أرجع عن الحكم بالزائد إلا إن فتح الله لي بما فتح الله به عليك مع اختلاف أهل النظر فيما ذهبت إليه هذا قوله فتعجبت من إنصافه ومن تصميمه مع شهادته على نفسه إنه ما يتهمني وهو يخالفني فأشبه من أضله الله على علم ولكن لا يقدح ذلك عندي في إيمانه وإنما يقدح في عقله ثم نرجع ونقول إن عين القلب ليس إلا ما هو الحق عليه في أحوال العالم ظاهرا وباطنا وأولا وآخرا وإن تعددت الأسماء فالمسمى واحد والمفهوم ليس بواحد فيحار الداعي إذا دعا ما يدري ما يدعو هل يدعو المسمى أو يدعو المفهوم فإن الأسماء الإلهية ما تعددت جزافا فلا بد من نسب تعقل لتعددها فالمفهوم من العالم ما هو عين المفهوم من الحي والحي هو العالم فالحي عين العالم والمفهوم من الحي ما هو المفهوم من العالم ولا القادر ولا العزيز ولا العالي ولا المتعالي ولا الكبير ولا المتكبر ولم نقل هذا عنه ولا سميته بهذا بل هو سمي لي نفسه بهذا فهل هو اسم له أو لما هو المفهوم منه وهل المفهوم منه أمر وجودي أو نسبة ثم مشاركتنا إياه في هذه الأسماء الواردة الإلهية كلها من أعجب ما في الأمر ثم رفع المماثلة بيني وبينه فتعلم قطعا إن هذه الأسماء من حيث المفهوم لا ترفع المماثلة\n\n\n> فقد حرنا وقد حارا *** فمن حار فما جارا\n\n\n> فقد أبعدني عينا *** وقد قربني جارا\n\n\n> وقد عين لي دارا *** وقد عينني دارا\n\n\n> له يسكنها خلدا *** فدارنا حيث ما دارا\n\n\n> فمن أصغى ومن قال *** ومن كسرى ومن دارا\n\n\n> مليك ما له ملك *** محال حار من حارا\n\n\n> ونادى من أتى يبغي *** فكانت داره النارا\n\n\nفما عينني دار إلا له فبه أسمع وبه أبصر وقد وسعه قلبي وما عين لي دارا إلا هو فيه أقيم وبه أنزل وهو يسترني بهويته عن خلقه فهو الظاهر وأنا مخبوء في كنفه فإذا سمع بالآلة أو بالنسب فبي يسمع وبي يبصر على ذلك كما أسمع به وأبصر به فهو في بالنوافل فإنه الأصل وأنا الزائد فإن ظاهر الصورة عيني وأنا فيه بالفرائض فبي يسمع وبي يبصر\n\n\n> فمن كان سمع الحق فالحق سامع *** ومن كان عين الحق فالحق ناظر\n> فيختلف التقليب والعين واحد *** على مثل هذا كل عبد يثابر\n\n",
    "en": "Chapter 416: Concerning the Knowledge of the Station of the Eye of the Heart\n\nThe Eye of the hearts is from the witnessing Existence (الوجود الناظر),\nAnd upon it the masters of the Path gaze.\nSo look at it in its turning, being turned,\nAnd turning others; for it is the Present Existence (الوجود الحاضر).\nThere is nothing there except what witnesses its time,\nAnd the past and the future are merely common talk.\nTime/Circumstance (الظرف) in the cosmos (الأكوان) is not an existent thing;\nWhat is there is there, and there is a deficient judgment.\nThis is The Real (الحق) by which appeared\nOur essences (أعياننا), and I am the All-Knowing, the Aware.\nIf I said what it is, your intellects would not encompass it;\nWhere are the intellects when there is no otherness there?\n\n### [Remembrance Inherits Tranquility]\n\nAllah the Exalted said: <<Those who have believed and whose hearts are assured by the remembrance of Allah>> (الَّذِينَ آمَنُوا وتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ الله) by which He remembers them. <<Unquestionably, by the remembrance of Allah>> (أَلا بِذِكْرِ الله) by which He remembers them, if they are believers, <<the hearts are assured>> (تَطْمَئِنُّ الْقُلُوبُ) in their turning, so they find rest in the turning (التقليب) with the breaths, and they know that permanence upon a single state is not valid. For the form of The Real (الحق) does not grant restriction, nor does it have expansion or scope except in the turning. And there is no turning for The Real except in the Fixed Entities (الأعيان الثابتة) of the possibilities, and the Fixed Entities of the possibilities have no end. Thus, the Divine turning within them is endless. He is <<every day in [a new] affair>> wherever He was.\n\nThe matter has not ceased, since it began, to move from state to state. So the eye is an instrument, and by sight, the perception of the object of sight—which is The Real—occurs. By Him, you see. And whoever sees a thing has known it, and when he knows it, he finds rest in it. Thus, he perpetually sees the turning, perpetually knows it, and is thereby assured and finds rest in it. In every breath, he looks at the traces of his Lord in his heart, in what He establishes and in what has departed from it, what He grants him therein, and what He alerts him to concerning it. The possessor of this station remains, in every breath, in new knowledge; thus, he is in a new creation (خلق جديد). Others are in confusion (لبس) regarding this new creation.\n\nAllah, blessed and exalted, commanded His Prophet (peace and blessings be upon him) to say: <<My Lord, increase me in knowledge>> (رَبِّ زِدْنِي عِلْماً). That is, remove from me the confusion that intervenes between me and the knowledge of the new creation, lest I miss much good that has occurred in Existence (الوجود) which I do not know. The veil is nothing but similarity and resemblance (التشابه والتماثل). Were it not for that, the new creation which belongs to Allah in the World (العالم) in every breath, in every affair, would not be confusing to anyone.\n\nNo group among the sects has been alerted to this except those who affirm the renewal of the world in every single moment (زمان فرد), who are a group called the Hasbaniyya. Yet, they did not reach the full extent of the matter as it truly is, though they came close, just as those who say that the accident (العرض) does not remain for two moments came close—and the accident is everything that does not subsist by itself. These also approached the matter but did not reach the full extent of the matter as it truly is, except for the Judge Abu Bakr ibn al-Tayyib, who approached the matter in two specific points. The first point is his statement concerning the cosmos (الأكوان) that they are relations (نسب) without substance (عين لها). The second is his statement concerning the attribute (صفة) attributed to The Real, that this ruling (الحكم) is due to a meaning (معنى) that is not the essence (عين) of the other meaning that gave a different ruling. He also approached the matter but did not reach the full extent of the matter as it truly is. He distinguished himself from those who say that the hearing and sight of The Real are the essence of His knowledge, for Al-Baqillani does not hold this view.\n\nI met in Fez Abu Abdullah al-Kinani, the Imam of the people of scholastic theology (أهل الكلام) in his time in the Maghrib. He asked me one day about the Divine Attributes (الصفات الإلهية). I told him what the matter is according to us. Then I asked him, \"What is your view on them? Are you with the theologians, or do you differ with them in anything they have concluded?\" He replied, \"I will tell you what I hold. As for affirming the addition (الزائد) to the Essence (الذات) called an attribute, it is necessary according to me and the group. But as for whether that addition is a single essence (عين واحدة) having many different rulings, or whether every ruling requires an additional meaning that necessitated it—we have no proof for its oneness nor for its multiplicity. This is my honest assessment of this issue. Anyone who forces a proof beyond this is flawed. The addition is necessary, except that we say: it is neither He nor other than He, due to what you know, O our master, concerning the doctrine of the people of this Path (أهل هذا الشأن) regarding the two non-others (الغيرين).\"\n\nI said to him, \"O Abu Abdullah, I say to you what the Messenger of Allah (peace and blessings be upon him) said to Abu Bakr concerning his interpretation of the dream: 'You were right in part and wrong in part.'\"\n\nHe said to me, \"By Allah, I do not doubt what you know, nor can I abandon the ruling of the addition unless Allah grants me the same unveiling (فتح) He granted you, especially given the disagreement among the people of speculation regarding what you have concluded.\" This was his statement. I was astonished by his fairness and his insistence, despite his testimony against himself that he did not doubt me, even though he disagreed with me. He resembled one whom Allah has led astray upon knowledge (أضله الله على علم), but this does not impugn his faith in my view; it only impugns his intellect (عقله).\n\nThen we return and say that the Eye of the Heart (عين القلب) is nothing but what The Real (الحق) is upon in the states of the World (العالم), outwardly and inwardly, first and last. Even if the Names (الأسماء) multiply, the Named (المسمى) is one, but the concept (المفهوم) is not one. Thus, the invoker is bewildered when he invokes; he does not know what he is invoking: Is he invoking the Named or the concept? For the Divine Names did not multiply randomly; there must be intelligible relations (نسب تعقل) for their multiplicity.\n\nThe concept derived from the All-Knowing (العالم) is not the essence of the concept derived from the Living (الحي), yet the Living is the All-Knowing, so the Living is the essence of the All-Knowing. And the concept derived from the Living is not the concept derived from the All-Knowing, nor the Powerful (القادر), nor the Mighty (العزيز), nor the High (العالي), nor the Exalted (المتعالي), nor the Great (الكبير), nor the Proud (المتكبر). We did not say this about Him, nor did I name Him thus; rather, He named Himself thus for me. Is it a Name for Him, or for what is conceived from Him? And is what is conceived from Him an existent thing (أمر وجودي) or a relation (نسبة)?\n\nThen, our participation with Him in all these transmitted Divine Names (الأسماء الإلهية) is among the most astonishing things in the matter. Yet, He removed the likeness (المماثلة) between me and Him, so you know definitively that these Names, from the perspective of the concept, do not remove the likeness.\n\nWe have been bewildered, and He has been bewildered,\nSo whoever is bewildered has not deviated.\nHe has made me distant in essence,\nAnd He has made me near as a neighbor.\nHe has designated a dwelling for me,\nAnd He has designated me as a dwelling,\nFor Him to dwell in eternally,\nSo our dwelling is wherever He turns.\nSo whoever listened, and whoever spoke,\nAnd whoever was Khosrau, and whoever was Dara,\nA Sovereign who has no kingdom—\nAn impossibility—bewildered is he who is bewildered.\nAnd He called out to whoever came seeking,\nAnd his dwelling was the Fire.\n\nHe designated me as a dwelling only for Him. By Him I hear, and by Him I see, and my heart has encompassed Him. And He designated a dwelling for me only that He might reside in it, and by Him I descend. He conceals me by His Ipseity (هويته) from His creation; thus, He is the Outward (الظاهر), and I am hidden in His shelter. So, if He hears by the instrument or by the relations, He hears by me and sees by me, just as I hear by Him and see by Him. He is in me through the supererogatory acts (النوافل), for He is the Origin (الأصل) and I am the addition (الزائد). For the outward form is my essence (عيني), and I am in Him through the obligatory acts (الفرائض); thus, He hears by me and sees by me.\n\nSo whoever is the hearing of The Real, The Real is the Hearer,\nAnd whoever is the eye of The Real, The Real is the Seer.\nThe turning (التقليب) differs, yet the essence (العين) is one;\nUpon the like of this, every servant strives.",
    "ur": "باب چار سو سولہ: قلب کی آنکھ کے مقام کی معرفت (معرفۃ) میں\n\nقلب کی آنکھ دیکھنے والی ہستی (الوجود) سے ہے\nاور اسی پر طریقت کے سردار نظر رکھتے ہیں۔\nپس اسے اس کے پلٹنے (تقلیب) میں پلٹتے ہوئے دیکھ،\nاور پلٹنے والا بھی وہی ہے، کیونکہ وہ ہستی (الوجود) حاضر ہے۔\nوہاں صرف وہی ہے جو اپنے وقت میں مشاہدہ کیا جاتا ہے،\nاور ماضی و مستقبل محض ایک عام بات ہے۔\nکائنات میں ظرف (وقت) کوئی موجود نہیں ہے،\nوہاں کوئی 'وہاں' نہیں ہے، اور وہاں حکم قاصر ہے۔\nیہ وہی ذات حق (الحق) ہے جس کے ذریعے ہمارے اعیان (أعيان) ظاہر ہوئے، اور میں جاننے والا، خبر رکھنے والا ہوں۔\nاگر میں کہوں کہ وہ کیا ہے، تو تمہاری عقلیں اسے گھیر نہیں سکتیں،\nعقلیں کہاں ہیں؟ اور وہاں کوئی دوسرا نہیں ہے۔\n\n[ذکر اطمینان کا وارث بناتا ہے]\n\nاللہ تعالیٰ نے فرمایا: \"وہ لوگ جو ایمان لائے اور ان کے دل اللہ کے ذکر سے اطمینان (اطمئنان) پاتے ہیں\" (الَّذِينَ آمَنُوا وتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ الله)۔ وہ ذکر جس کے ذریعے اللہ نے ان کا ذکر کیا، \"خبردار! اللہ کے ذکر سے\" (أَلا بِذِكْرِ الله) جب وہ مؤمن ہو، تو دل اپنے پلٹنے (تقلب) میں اطمینان (اطمئنان) پاتے ہیں، اور سانسوں کے ساتھ پلٹنے (تقلیب) کی طرف سکون اختیار کرتے ہیں، اور یہ جانتے ہیں کہ ایک ہی حال پر ثابت قدمی درست نہیں ہے۔ کیونکہ ذات حق (الحق) کی صورت تنگی نہیں دیتی، اور نہ ہی اس کے لیے کوئی وسعت یا میدان ہے سوائے پلٹنے (تقلیب) کے۔ اور ذات حق (الحق) کا پلٹنا (تقلیب) ممکنات (الممكنات) کے اعیان (أعيان) کے سوا کہیں نہیں ہوتا، اور ممکنات (الممكنات) کے اعیان (أعيان) کی کوئی انتہا نہیں ہے۔ لہٰذا ان میں الٰہی پلٹنا (تقلیب) لامتناہی ہے۔ پس وہ ہر روز ایک نئی شان میں ہے جہاں وہ تھا۔ اور جب سے یہ معاملہ ہے، یہ ہمیشہ ایک حال سے دوسرے حال میں منتقل ہوتا رہا ہے۔\n\nپس آنکھ ایک آلہ ہے، اور بصارت کے ذریعے مبصر کا ادراک ہوتا ہے، اور وہ ذات حق (الحق) ہے۔ پس اسی کے ذریعے تو دیکھتا ہے۔ اور جس نے کسی چیز کو دیکھا، اس نے اسے جان لیا، اور جب اسے جان لیا تو اس کی طرف سکون اختیار کیا۔ پس اس نے پلٹنے (تقلیب) کو ہمیشہ دیکھا، تو اسے ہمیشہ جانا، اور اس کے ذریعے اطمینان (اطمئنان) پایا اور اس کی طرف سکون اختیار کیا۔ پس وہ ہر سانس میں اپنے رب کے آثار کو اپنے قلب میں دیکھتا ہے، اس میں جو اسے قائم رکھتا ہے اور اس میں جو اس سے نکل جاتا ہے، جو کچھ وہ اسے اس میں عطا کرتا ہے اور جس پر اسے متنبہ کرتا ہے۔ پس اس مقام کا حامل ہر سانس میں ایک نئے علم میں ہوتا ہے، لہٰذا وہ ایک نئی تخلیق (خلق جدید) میں ہوتا ہے، جبکہ دوسرا اس نئی تخلیق کے التباس میں ہوتا ہے۔ اللہ تبارک و تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو حکم دیا کہ وہ کہیں: \"اے میرے رب! میرے علم میں اضافہ فرما\" (رَبِّ زِدْنِي عِلْماً)۔ یعنی مجھ سے وہ التباس دور کر جو میرے اور نئی تخلیق (خلق جدید) کے علم کے درمیان حائل ہوتا ہے، ورنہ میں اس کثیر خیر سے محروم ہو جاؤں گا جو ہستی (الوجود) میں واقع ہوا اور میں اسے نہیں جانتا۔ اور حجاب مشابہت اور مماثلت کے سوا کچھ نہیں ہے۔ اگر ایسا نہ ہوتا تو کسی پر بھی وہ نئی تخلیق (خلق جدید) مشتبہ نہ ہوتی جو اللہ کے لیے عالم میں ہر سانس میں ہر شان کے ساتھ ہے۔\n\nاور فرقوں میں سے صرف وہی لوگ اس پر متنبہ ہوئے جو ہر فردِ وقت میں عالم کی تجدید کے قائل ہیں، اور وہ ایک گروہ ہے جسے حسبانیہ کہا جاتا ہے۔ انہوں نے اس معاملے کی حقیقت کو اس طرح نہیں پایا جیسا کہ وہ ہے، لیکن وہ قریب پہنچ گئے، جیسا کہ وہ لوگ قریب پہنچے جو کہتے ہیں کہ عرض دو زمانوں تک باقی نہیں رہتا، اور عرض ہر وہ چیز ہے جو بذات خود قائم نہ ہو۔ یہ لوگ بھی معاملے کے قریب پہنچے لیکن اس کی حقیقت کو نہیں پا سکے، سوائے قاضی ابو بکر بن الطیب کے، جنہوں نے بعض معاملے میں دو مقامات پر قربت حاصل کی۔ پہلا مقام ان کا یہ قول ہے کہ کائناتیں (الأكوان) نسبتیں ہیں جن کا کوئی عین (أعيان) نہیں ہے، اور دوسرا ان کا یہ قول ہے کہ ذات حق (الحق) کی طرف منسوب صفات کے بارے میں یہ حکم کسی ایسے معنی کے لیے ہے جو دوسرے معنی کا عین نہیں ہے جس نے دوسرا حکم دیا، پس وہ بھی قریب پہنچے لیکن اس کی حقیقت کو نہیں پا سکے جیسا کہ وہ ہے۔ البتہ وہ ان لوگوں سے ممتاز ہوئے جو کہتے ہیں کہ ذات حق (الحق) کا سننا اور دیکھنا اس کے علم کا عین ہے، اور باقلانی یہ نہیں کہتے۔\n\nاور میں نے فاس میں ابو عبد اللہ الکنانی کو دیکھا، جو مغرب میں اپنے زمانے کے اہل کلام کے امام تھے، اور انہوں نے ایک دن مجھ سے الٰہی صفات کے بارے میں پوچھا۔ میں نے انہیں بتایا کہ ہمارے نزدیک اس معاملے کی حقیقت کیا ہے۔ پھر میں نے ان سے کہا: آپ کا اس بارے میں کیا قول ہے؟ کیا آپ متکلمین کے ساتھ ہیں یا ان کے کسی موقف سے اختلاف رکھتے ہیں؟ انہوں نے مجھ سے کہا: میں آپ کو وہ بتاتا ہوں جو میرے پاس ہے۔ جہاں تک ذات پر زائد چیز کے اثبات کا تعلق ہے جسے صفت کہا جاتا ہے، تو میرے اور جماعت کے نزدیک وہ ضروری ہے۔ اور جہاں تک اس زائد چیز کے ایک ہی عین (أعيان) ہونے کا تعلق ہے جس کے بہت سے مختلف احکام ہیں، یا ہر حکم کے لیے ایک زائد معنی ہے جس نے اسے واجب کیا، تو ہمارے پاس اس کی وحدانیت یا اس کی کثرت پر کوئی دلیل نہیں ہے۔ میرے نزدیک اس مسئلے میں یہی انصاف ہے۔ اور جو کوئی اس کے علاوہ کسی دلیل کی تکلیف اٹھاتا ہے تو وہ مشکوک ہے۔ اور زائد کا ہونا ضروری ہے، لیکن ہم کہتے ہیں کہ وہ نہ تو وہ (ذات) ہے اور نہ ہی اس کے علاوہ ہے، جیسا کہ آپ ہمارے سید (سیدنا) اس شان کے لوگوں کے مذہب کو دو غیروں کے بارے میں جانتے ہیں۔ میں نے ان سے کہا: اے ابو عبد اللہ! میں آپ کو وہی کہتا ہوں جو رسول اللہ صلی اللہ علیہ وسلم نے ابو بکر سے ان کے خواب کی تعبیر کے بارے میں کہا تھا: \"آپ نے کچھ درست کہا اور کچھ غلطی کی\"۔ انہوں نے مجھ سے کہا: اللہ کی قسم! میں آپ کے علم پر کوئی الزام نہیں لگاتا، اور میں زائد کے حکم سے رجوع نہیں کر سکتا، مگر یہ کہ اللہ مجھ پر وہ کشف (الکشف) فرمائے جو اس نے آپ پر فرمایا ہے، باوجود اس کے کہ اہل نظر آپ کے موقف سے اختلاف رکھتے ہیں۔ یہ ان کا قول تھا۔ پس میں ان کے انصاف اور ان کے اصرار پر حیران ہوا، باوجود اس کے کہ وہ خود گواہی دے رہے تھے کہ وہ مجھ پر الزام نہیں لگاتے اور وہ میری مخالفت کر رہے ہیں۔ پس وہ اس شخص سے مشابہت رکھتے ہیں جسے اللہ نے علم کے باوجود گمراہ کر دیا، لیکن یہ میرے نزدیک ان کے ایمان میں کوئی نقص نہیں ڈالتا، بلکہ ان کی عقل میں نقص ڈالتا ہے۔\n\nپھر ہم واپس آتے ہیں اور کہتے ہیں کہ قلب کی آنکھ (عين القلب) صرف وہی ہے جس پر ذات حق (الحق) عالم کے احوال میں ظاہر و باطن، اول و آخر میں ہے۔ اگرچہ اسماء (الأسماء) متعدد ہیں، لیکن مسمیٰ (المسمى) ایک ہے، اور مفہوم ایک نہیں ہے۔ پس دعا کرنے والا جب دعا کرتا ہے تو حیران ہوتا ہے کہ وہ کسے پکار رہا ہے، کیا وہ مسمیٰ کو پکار رہا ہے یا مفہوم کو؟ کیونکہ الٰہی اسماء (الأسماء الإلهية) بے مقصد طور پر متعدد نہیں ہوئے، لہٰذا ان کے تعدد کے لیے عقلی نسبتوں کا ہونا ضروری ہے۔ پس عالم (العالم) سے جو مفہوم ہے وہ حی (الحي) سے مفہوم کا عین نہیں ہے، حالانکہ حی (الحي) ہی عالم (العالم) ہے۔ پس حی (الحي) عالم (العالم) کا عین ہے، اور حی (الحي) سے جو مفہوم ہے وہ عالم (العالم) سے مفہوم نہیں ہے، نہ ہی قادر (القادر)، نہ عزیز (العزيز)، نہ عالی (العالي)، نہ متعالی (المتعالي)، نہ کبیر (الکبیر)، اور نہ متکبر (المتکبر) ہے۔ اور ہم نے یہ اس کے بارے میں نہیں کہا اور نہ ہی میں نے اسے یہ نام دیا، بلکہ اس نے خود کو میرے لیے یہ نام دیا ہے۔ تو کیا یہ نام اس کے لیے ہے یا اس کے لیے جو اس سے مفہوم ہے؟ اور کیا اس سے مفہوم کوئی وجودی امر ہے یا کوئی نسبت؟ پھر ان تمام وارد شدہ الٰہی اسماء (الأسماء الإلهية) میں ہمارا اس کے ساتھ شریک ہونا سب سے زیادہ حیرت انگیز امر ہے۔ پھر میرے اور اس کے درمیان مماثلت کو ختم کر دیا گیا، پس تم یقیناً جانتے ہو کہ یہ اسماء (الأسماء) مفہوم کے لحاظ سے مماثلت کو ختم نہیں کرتے۔\n\nہم حیران ہوئے اور وہ بھی حیران ہوا، پس جو حیران ہوا اس نے ظلم نہیں کیا۔\nاس نے مجھے عین (أعيان) کے لحاظ سے دور کر دیا، اور پڑوسی کے لحاظ سے قریب کر دیا۔\nاس نے میرے لیے ایک گھر (دارا) مقرر کیا، اور مجھے بھی گھر (دارا) مقرر کیا۔\nاس کے لیے جس میں وہ ہمیشہ رہے گا، پس ہمارا گھر (دار) وہیں ہے جہاں وہ گھومتا ہے۔\nپس جس نے کان لگائے اور جس نے کہا، اور کسریٰ اور دارا (بادشاہوں کے نام)،\nوہ بادشاہ ہے جس کی کوئی بادشاہت نہیں، یہ محال ہے، جو حیران ہوا وہ حیران ہوا۔\nاور اس نے پکارا جو طلب کرنے آیا، پس اس کا گھر (دار) آگ (النار) تھا۔\n\nپس اس نے مجھے گھر (دار) مقرر نہیں کیا مگر اپنے لیے، پس اسی کے ذریعے میں سنتا ہوں اور اسی کے ذریعے میں دیکھتا ہوں، اور میرے قلب نے اسے گھیر لیا ہے۔ اور اس نے میرے لیے گھر (دارا) مقرر نہیں کیا مگر وہ خود، اسی میں میں قیام کرتا ہوں اور اسی کے ذریعے میں اترتا ہوں۔ اور وہ اپنی ہویت (ہستی) کے ذریعے مجھے اپنی مخلوق سے چھپاتا ہے، پس وہ ظاہر ہے اور میں اس کی پناہ میں پوشیدہ ہوں۔ پس جب وہ آلے یا نسبتوں کے ذریعے سنتا ہے یا دیکھتا ہے، تو وہ میرے ذریعے سنتا ہے اور میرے ذریعے دیکھتا ہے، جیسا کہ میں اس کے ذریعے سنتا ہوں اور اس کے ذریعے دیکھتا ہوں۔ پس وہ نوافل (النوافل) میں میرے ساتھ ہے، کیونکہ وہ اصل ہے اور میں زائد ہوں۔ کیونکہ صورت کا ظاہر میرا عین (أعيان) ہے، اور میں فرائض (الفرائض) میں اس کے ساتھ ہوں، پس میرے ذریعے وہ سنتا ہے اور میرے ذریعے وہ دیکھتا ہے۔\n\nپس جو ذات حق (الحق) کا سننا ہے، تو ذات حق (الحق) ہی سننے والا ہے،\nاور جو ذات حق (الحق) کی آنکھ ہے، تو ذات حق (الحق) ہی دیکھنے والا ہے۔\nپس پلٹنا (تقلیب) مختلف ہوتا ہے، حالانکہ عین (أعيان) ایک ہے،\nاسی طرح ہر بندہ کوشش کرتا ہے۔",
    "fa": "باب چهارصد و شانزدهم در معرفت منزلت عین قلب\n\n> عین قلب‌ها از هستی (الوجود) بیننده است *** و بزرگان طریقت بر آن نظر می‌کنند\n\n> پس در تقلب آن، او را متقلب بنگر *** و اوست که تقلیب می‌کند، پس او هستی (الوجود) حاضر است\n\n> در آنجا جز آنچه در وقت خود مشاهده می‌شود نیست *** و گذشته و آینده سخنی است که می‌گذرد\n\n> ظرف در اکوان (هستی‌ها) موجود نیست *** در آنجا «آنجا»یی نیست و حکم در آنجا قاصر است\n\n> این همان حقی (الحق) است که به واسطه آن *** اعیان ما ظاهر شدند و من دانای آگاه هستم\n\n> اگر بگویم او چیست، عقل‌های شما گنجایش آن را ندارد *** عقل‌ها کجایند و در آنجا مغایری (دوگانگی) نیست\n\n### [ذکر، اطمینان به ارث می‌گذارد]\n\nخداوند متعال فرمود: «الَّذِينَ آمَنُوا وتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ الله» (کسانی که ایمان آورده‌اند و دل‌هایشان به یاد خدا آرام می‌گیرد). به واسطه ذکری که خداوند قلب‌ها را به آن یاد کرده است، «أَلا بِذِكْرِ الله» (آگاه باشید که با یاد خدا) که اگر مؤمن باشند، «تَطْمَئِنُّ الْقُلُوبُ» (دل‌ها آرام می‌گیرد) در تقلب خود. پس با هر نفس به تقلیب (دگرگونی) سکون می‌یابد و می‌داند که ثبات بر یک حال صحیح نیست، زیرا صورت حق نه تنگی می‌دهد و نه گشایشی برای آن است و نه مجالی جز در تقلیب. و تقلیب برای حق جز در اعیان ممکنات نیست، و اعیان ممکنات بی‌نهایت هستند. پس تقلیب الهی در آن‌ها پایان نمی‌پذیرد، و او هر روز در شأنی است، هر کجا که باشد. پس امر از زمانی که بوده است، پیوسته از حالی به حال دیگر در جریان است و هرگز متوقف نمی‌شود. پس عین (چشم) ابزار است و ادراک مبصَر (آنچه دیده می‌شود) که همان حق است، به واسطه بصر (بینایی) رخ می‌دهد. پس به واسطه او می‌بینی، و هر کس چیزی را ببیند، آن را شناخته است، و چون آن را شناخت، به آن آرام گرفت. پس تقلیب را همیشه مشاهده کرد، و همیشه آن را دانست، پس به آن اطمینان یافت و به آن سکون گزید. پس او در هر نفس به آثار پروردگارش در قلب خود می‌نگرد، در آنچه او را بر آن می‌دارد و آنچه از آن خارج می‌شود، آنچه در آن به او عطا می‌کند و او را به آن آگاه می‌سازد. پس صاحب این مقام در هر نفس در علم جدیدی است، پس او در خلق جدیدی است، و دیگران در پوششی از این خلق جدید هستند. خداوند تبارک و تعالی به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) امر فرمود که بگوید: «رَبِّ زِدْنِي عِلْماً» (پروردگارا، علم مرا زیاد کن). یعنی پوششی را که بین من و علم به خلق جدید حائل می‌شود، از من بردار، تا خیر بسیاری که در هستی (الوجود) حاصل شده و من از آن بی‌خبرم، از دست نرود. و حجاب چیزی جز تشابه و تماثل نیست، و اگر این نبود، خلق جدیدی که خداوند در هر نفس با هر شأنی در عالم دارد، بر هیچ کس مشتبه نمی‌شد. و از فرقه‌ها، جز کسانی که قائل به تجدید عالم در هر زمان فرد هستند، به این امر آگاه نشدند. و آن‌ها فرقه‌ای هستند که به آن‌ها حِسبانیه گفته می‌شود، و در این امر به آن مرتبه‌ای که هست نرسیدند، اما نزدیک شدند، همان‌طور که قائلان به اینکه عَرَض (صفت غیر قائم به ذات) دو زمان باقی نمی‌ماند، نزدیک شدند. و عَرَض هر چیزی است که قیام به نفس خود ندارد. پس اینان نیز به امر نزدیک شدند و به آنچه امر بر آن است نرسیدند، مگر قاضی ابوبکر بن الطیب که در برخی امور در دو موضع نزدیک شد: موضع اول، قول او در اکوان (هستی‌ها) است که آن‌ها نِسب (نسبت‌ها) هستند و عینی برای آن‌ها نیست. و قول او در مورد صفتی که به حق نسبت داده می‌شود، این است که آن حکم برای معنایی است که عین معنای دیگری نیست که حکم دیگری داده است. پس او نیز نزدیک شد و به آنچه امر بر آن است نرسید. و تنها از کسانی که می‌گویند سمع و بصر حق عین علم اوست، متمایز شد، و باقلانی این را نمی‌گوید. و من در فاس، ابوعبدالله کنانی، امام اهل کلام زمان خود در مغرب را دیدم که روزی از من درباره صفات الهی پرسید. من آنچه را که امر بر آن است نزد ما، به او گفتم. سپس به او گفتم: نظر تو در مورد آن‌ها چیست؟ آیا با متکلمین هستی یا در چیزی که آن‌ها در مورد صفات گفته‌اند، با آن‌ها مخالفت می‌کنی؟ او به من گفت: من آنچه را که نزد من است به تو می‌گویم. اما اثبات زائد بر ذات که صفت نامیده می‌شود، نزد من و نزد جماعت ضروری است. اما اینکه آن زائد، عین واحدی باشد که احکام مختلف و بسیاری دارد، یا برای هر حکم، معنای زائدی باشد که آن را ایجاب کرده است، ما دلیلی بر احدیت (یگانگی) آن و نه بر تکثر (چندگانگی) آن نداریم. این نزد من انصاف در این مسئله است. و هر کس در غیر این، دلیلی به زحمت بیاورد، آن دلیل معیوب است. و زائد ضروری است، جز اینکه ما می‌گوییم: نه او (حق) است و نه غیر او، به دلیل آنچه ای سید ما از مذهب اهل این شأن در مورد دو غیر دانسته‌ای. پس به او گفتم: ای ابوعبدالله، آنچه را که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به ابوبکر در تعبیر خوابش گفت، به تو می‌گویم: «بخشی را درست گفتی و بخشی را خطا».\n\nاو به من گفت: به خدا سوگند، در آنچه می‌دانی تو را متهم نمی‌کنم، و نمی‌توانم از حکم به زائد برگردم، مگر اینکه خداوند برای من بگشاید، همان‌طور که برای تو گشوده است، با وجود اختلاف اهل نظر در آنچه تو به آن رفته‌ای. این سخن او بود. پس از انصاف او و از پافشاری او با وجود شهادتش بر خودش که مرا متهم نمی‌کند و با من مخالفت می‌کند، تعجب کردم. پس شبیه کسی شد که خداوند او را با علم گمراه کرده است، اما این امر نزد من در ایمان او قدحی وارد نمی‌کند، بلکه در عقل او قدح وارد می‌کند. سپس باز می‌گردیم و می‌گوییم که عین قلب چیزی نیست جز آنچه حق بر آن است در احوال عالم، ظاهر و باطن، اول و آخر. و اگرچه اسامی متعدد باشند، مسمّا (نامیده شده) یکی است، اما مفهوم یکی نیست. پس داعی (دعاکننده) وقتی دعا می‌کند، متحیر می‌شود و نمی‌داند چه کسی را می‌خواند، آیا مسمّا را می‌خواند یا مفهوم را؟ زیرا اسامی الهی بیهوده متعدد نشده‌اند، پس باید نِسبی (نسبت‌هایی) تعقل شوند تا تعدد آن‌ها توجیه شود. پس مفهومی که از «العالم» (داننده) است، عین مفهومی که از «الحی» (زنده) است، نیست. و «الحی» همان «العالم» است. پس «الحی» عین «العالم» است. و مفهومی که از «الحی» است، مفهومی که از «العالم» است، نیست، و نه «القادر» (توانا)، نه «العزیز» (عزیز)، نه «العالی» (بلندمرتبه)، نه «المتعالی» (برتر)، نه «الکبیر» (بزرگ)، و نه «المتکبر» (متکبر). و ما این را در مورد او نگفتیم و او را به این نام ننامیدیم، بلکه او خود را به این نام برای من نامید. پس آیا این نام برای اوست یا برای آنچه از او فهمیده می‌شود؟ و آیا آنچه از او فهمیده می‌شود، امری وجودی است یا یک نسبت؟ سپس مشارکت ما با او در این اسامی الهی وارد شده، از عجیب‌ترین امور است. سپس مماثلت (همانندی) بین من و او را برطرف کرد. پس قطعاً می‌دانی که این اسامی از حیث مفهوم، مماثلت را برطرف نمی‌کنند.\n\n> پس ما حیران شدیم و او حیران شد *** پس هر کس حیران شد، ستم نکرد\n\n> او مرا از حیث عین (ذات) دور کرد *** و از حیث همسایگی (جار) نزدیک کرد\n\n> و برای من خانه‌ای (دارا) تعیین کرد *** و مرا خانه‌ای (دارا) تعیین کرد\n\n> که او در آن جاودانه ساکن می‌شود *** پس خانه ما هر جا که او بگردد، همانجاست\n\n> پس هر کس گوش فرا داد و هر کس گفت *** و هر کس کسرای (پادشاه) بود و هر کس دارا (پادشاه) بود\n\n> پادشاهی که مُلکی برای او نیست *** محال است، هر کس حیران شد، حیران شد\n\n> و ندا داد به کسی که می‌آمد و می‌خواست *** پس خانه او آتش بود\n\nپس او مرا خانه‌ای تعیین نکرد مگر برای خودش. پس به واسطه او می‌شنوم و به واسطه او می‌بینم، و قلبم او را گنجانده است. و او برای من خانه‌ای تعیین نکرد مگر اینکه او در آن است، در آن اقامت می‌کنم و به واسطه او فرود می‌آیم. و او مرا به واسطه هویتش از خلقش می‌پوشاند، پس او ظاهر است و من در پناه او پنهانم. پس اگر با ابزار یا با نسبت‌ها بشنود، به واسطه من می‌شنود و به واسطه من می‌بیند، همان‌طور که من به واسطه او می‌شنوم و به واسطه او می‌بینم. پس او در من به واسطه نوافل است، زیرا او اصل است و من زائد هستم. زیرا ظاهر صورت، عین من است و من در او به واسطه فرائض هستم. پس به واسطه من می‌شنود و به واسطه من می‌بیند.\n\n> پس هر کس سمع حق باشد، حق شنواست *** و هر کس عین حق باشد، حق بیناست\n> پس تقلیب‌ها مختلف می‌شود و عین (ذات) یکی است *** بر مانند این، هر بنده‌ای تلاش می‌کند"
  },
  "page_count": 3
}