{
  "id": 310,
  "title": {
    "ar": "الباب العاشر وثلاثمائة في معرفة منزل الصلصلة الروحانية من الحضرة الموسوية",
    "en": "Chapter Three Hundred and Ten: Concerning the Gnosis (معرفة) of the Station (منزل) of the Spiritual Clanging (الصلصلة الروحانية) from the Mosaic Presence (الحضرة الموسوية).",
    "ur": "باب تین سو دس: موسوی حضور (الحضرة الموسوية) سے روحانی صلصلہ (الصلصلة الروحانية) کی منزل کی معرفت میں۔",
    "fa": "باب سیصد و دهم در معرفت منزل صلصله (الصلصلة) روحانی از حضرت موسوی."
  },
  "content": {
    "ar": "## «الباب العاشر وثلاثمائة في معرفة منزل الصلصلة الروحانية من الحضرة الموسوية»\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في إنزال الوحي إنه يأتيه الوحي مثل صلصلة الجرس وهو أشده علي يقول الراوي فيفصم عنه وإن جبينه ليتفصد عرقا\n\n\nفإن نزول الوحي على الأنبياء له صور مختلفة أشدها وحي الصلصلة شعر\n\n\n> إن البروج لأوضاع مقدرة *** وهي المنازل للسيارة الشهب‏\n\n\n> نظيرها من وجود السعد يشمله *** هذي إلى الفوز والأخرى إلى العطب‏\n\n\n> إذا تعرضت الأنواء تطلبني *** حبا لتمنحني ما شئت من أدب‏\n\n\n> وجاءت السحب والأرواح تحملها *** والرعد يفصح عن عجم وعن عرب‏\n\n\n> والبرق يخلع من أنوار نشأته *** على ظلام الدجا ثوبا من الذهب‏\n\n\n> والسحب تسكب أمطار الحقائق في *** بيت من الطين والأهواء واللهب‏\n\n\n> والأرض تهتز إعجابا بزهرتها *** والروض يرفل في أثوابه القشب‏\n\n\n> علم الحقائق هذا لا أريد سوى *** العلم بالله والأسماء والحجب‏\n\n\n> لما تنزه علم ذاته علم *** على الوصول به ناديت من كثب‏\n> أنت الإله الذي لا شي‏ء يشبهه *** إلا الذي جاء في التنزيل والكتب‏\n\n\n### [إن الله خلق الأرواح على ثلاث مراتب‏]\n\n\nاعلم أن الله خلق الأرواح على ثلاث مراتب لا رابع لها أرواح ليس لهم شغل إلا تعظيم جناب الحق ليس لهم وجه مصروف إلى العالم ولا إلى نفوسهم قد هيمهم جلال الله واختطفهم عنهم فهم فيه حيارى سكارى وأرواح مدبرة أجساما طبيعية أرضية وهي أرواح الأناسي وأرواح الحيوانات عند أهل الكشف من كل جسم طبيعي عنصري فإن الله عز وجل يقول وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يشهد للمؤذن مدى صوته من رطب ويابس وسبح الحصى في كفه صَلَّى اللهُ عَليهِ وسَلَّم وفي كف من شاء الله من أصحابه‏\n\n\nوقال في أحد هذا جبل يحبنا ونحبه‏\n\n\nفهذه الأخبار كلها تدل على حياة كل شي‏ء ومعرفته بربه فإن السماء والأرض قالَتا أَتَيْنا طائِعِينَ ونحن نعرف ذلك من طريق الكشف ولو لم يأت في ذلك خبر وهذه الأرواح المدبرة لهذه الأجسام مقصورة عليها مسخرة بعضها لبعض بما فضل الله بعضهم على بعض كما قال عز وجل ورَفَعْنا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجاتٍ لِيَتَّخِذَ بَعْضُهُمْ بَعْضاً سُخْرِيًّا وأرواح أخر مسخرات لنا وهم على طبقات كثيرة فمنهم الموكل بالوحي والإلقاء ومنهم الموكل بالأرزاق ومنهم الموكل بقبض الأرواح ومنهم الموكل بإحياء الموتى ومنهم الموكل بالاستغفار للمؤمنين والدعاء لهم ومنهم الموكلون بالغراسات في الجنة جزاء لأعمال العباد\n\n\n### [إن الله جعل للأرواح الأناسي آلات طبيعية]\n\n\nفاعلم إن أرواح الأناسي جعل الله لها آلات طبيعية كالعين والأذن والأنف والحنك وجعل فيها قوى سماها سمعا وبصرا وغير ذلك وخلق لهذه القوي وجهين وجه إلى المحسوسات عالم الشهادة ووجه إلى حضرة الخيال وجعل حضرة الخيال محلا واسعا أوسع من عالم الشهادة وجعل فيها قوة تسمى الخيال إلى قوى كثيرة مثل المصورة والفكر والحفظ والوهم والعقل وغير ذلك وبهذه القوي تدرك النفس الإنسانية جميع ما يعطيها حقائق هذه القوي من المعلومات فبالوجه الذي للبصر إلى عالم الشهادة تدرك جميع المحسوسات وترفعها إلى الخيال فتحفظها في الخيال بالقوة الحافظة بعد ما تصورها القوة المصورة وقد تأخذ القوة المصورة أمورا من موجودات مختلفة كلها محسوسة وتركب منها شكلا غريبا ما أبصرته قط حسا بمجموعه لكن ما فيه جزء إلا وقد أبصرته فإذا نام الإنسان نظر البصر بالوجه الذي له إلى عالم الخيال فيرى ما فيه مما نقله الحس مجموعا أو مما صورته القوة المصورة مما لم يقع الحس على مجموعه قط لا على أجزائه التي تألفت منها هذه الصورة فتراه نائما إلى جانبك وهو يبصر نفسه معذبا أو منعما أو تاجرا أو ملكا أو مسافرا ويطرأ عليه خوف في منامه في خياله فيصيح ويزعق والذي إلى جانبه لا علم له بذلك ولا بما هو فيه وربما إذا اشتد الأمر تغير له المزاج فأثر في الصورة الظاهرة النائمة حركة أو زعاقا أو كلاما أو احتلاما كل ذلك من غلبة تلك القوة على الروح الحيواني فيتغير البدن في صورته فإذا تنزلت الأملاك المسخرة بالوحي على الأنبياء عليه السلام أو تنزل رقائق منها على قلوب الأولياء لأن الملك لا ينزل بوحي على قلب غير نبي أصلا ولا بأمر إلهي جملة واحدة فإن الشريعة قد استقرت وتبين الفرض والواجب والمندوب والمباح والمكروه فانقطع الأمر الإلهي بانقطاع النبوة والرسالة ولهذا لم يكتف رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بانقطاع الرسالة فقط لئلا يتوهم أن النبوة باقية في الأمة\n\n\nفقال عليه السلام إن النبوة والرسالة قد انقطعت فلا نبي بعدي ولا رسول‏\n\n\nفما بقي أحد من خلق الله يأمره الله بأمر يكون شرعا يتعبده به فإنه إن أمره بفرض كان الشارع قد أمره به فالأمر للشارع وذلك وهم منه وادعاء نبوة قد انقطعت فإن قال إنما يأمره بالمباح قلنا لا يخلو إما أن يرجع ذلك المباح واجبا في حقه فهذا هو عين نسخ الشرع الذي هو عليه حيث صير بهذا الوحي المباح الذي قرره الرسول مباحا واجبا يعصي بتركه وإن أبقاه مباحا كما كان فكذلك كان فآية فائدة في الأمر الذي به جاء هذا الملك لهذا المدعي صاحب هذا المقام فإن قال ما جاء به ملك لكن الله أمرني به من غير واسطة قلنا هذا أعظم من ذلك فإنك ادعيت أن الله يكلمك كما كلم موسى عليه السلام ولا قائل به لا من علماء الرسوم ولا من علماء أهل الذوق ثم إنه لو كلمك أو لو قال لك فما كان يلقي إليك في كلامه إلا علوما وأخبارا لا أحكاما ولا شرعا ولا يأمرك أصلا فإنه إن أمرك كان الحكم مثل ما قلنا في وحي الملك فإن كان ذلك الذي دندنت عليه عبارة عن إن الله خلق في قلبك علما بأمر ما فما ثم في كل نفس إلا خلق العلم في كل إنسان ما يختص به ولي من غيره وقد بينا في هذا الكتاب وغيره ما هو الأمر عليه ومنعنا\nجملة واحدة أن يأمر الله أحدا بشريعة يتعبده بها في نفسه أو يبعثه بها إلى غيره وما نمنع أن يعلمه الحق على الوجه الذي نقرره وقرره أهل طريقنا بالشرع الذي تعبده به على لسان الرسول عليه السلام من غير أن يعلمه ذلك عالم من علماء الرسوم بالمبشرات التي أبقيت علينا من آثار النبوة وهي الرؤيا يراها الرجل المسلم أو ترى له وهي حق ووحي ولا يشترط فيها النوم لكن قد تكون في النوم وفي غير النوم وفي أي حالة كانت فهي رؤيا في الخيال بالحس لا في الحس والمتخيل قد يكون من داخل في القوة وقد يكون من خارج بتمثل الروحاني أو التجلي المعروف عند القوم ولكن هو خيال حقيقي إذا كان المزاج المستقيم المهيا للحق فإذا ورد الملك على النبي عليه السلام بحكم أو بعلم خبري وإن كان الكل من قبيل الخبر ولقي تلك الصورة الروح الإنساني وتلاقى هذا بالإصغاء وذلك بالإلقاء وهما نوران احتد المزاج واشتعل وتقوت الحرارة الغريزية المزاجية في النورين وزادت كميتها فتغير وجه الشخص لذلك وهو المعبر عنه بالحال وهو أشد ما يكون وتصعد الرطوبات البدنية بخارات إلى سطح كرة البدن لاستيلاء الحرارة فيكون من ذلك العرق الذي يطرأ على أصحاب هذه الأحوال للانضغاط الذي يحصل بين الطبائع من التقاء الروحين ولقوة الهواء الحار الخارج من البدن بالرطوبات تغمر المسام فلا يتخلله الهواء البارد من خارج فإذا سرى عن النبي وعن صاحب الحال وانصرف الملك من النبي والرقيقة الروحانية من الولي سكن المزاج وانفشت تلك الحرارة وانفتحت المسام وقبل الجسم الهواء البارد من خارج فتخلل الجسم فيبرد المزاج فيزيد في كمية البرودة وتستولي على الحرارة وتضعفها فذلك هو البرد الذي يجده صاحب الحال ولهذا تأخذه القشعريرة فيزاد عليه الثياب ليسخن ثم بعد ذلك يخبر بما حصل له في تلك البشرى إن كان وليا أو في ذلك الوحي إن كان نبيا وهذا كله إذا كان التنزيل على القلب بالصفة الروحانية فإن كان نفثا فهو الإلهام وهذا يكون للولي وللنبي وأما إن حدث فسمع من غير رؤية فهو المحدث وأما إن تراءى له الملك إن كان نبيا في زمان وجود النبوة أو تراءت له الرقيقة رجلا ممثلا أو صورة حيوان يخاطبه بما جاء به إليه فإن كان وليا فيعرضه على الكتاب والسنة فإن وافق رآه خطاب حق وتشريف لا غير لا زيادة حكم ولا إحداث حكم لكن قد يكون بيان حكم أو أعلاما بما هو الأمر عليه فيرجع ما كان مظنونا معلوما عنده وإن لم يوافق الكتاب والسنة رآه خطاب حق وابتلاء لا بد من ذلك فعلم قطعا إن تلك الرقيقة ليست برقيقة ملك ولا بمجلى إلهي ولكن هي رقيقة شيطانية فإن الملائكة ليس لها مثل هذا المقام وإنها أجل من ذلك وأكثر ما يطرأ هذا على أهل السماع من الحق في الخلق فما بقي للأولياء اليوم بعد ارتفاع النبوة إلا التعريف وانسدت أبواب الأوامر الإلهية والنواهي فمن ادعاها بعد محمد فهو مدع شريعة أوحي بها إليه سواء وافق بها شرعنا أو خالف وأما في غير زماننا قبل رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فلم يكن تحجير ولذلك قال العبد الصالح خضر وما فَعَلْتُهُ عَنْ أَمْرِي فإن زمانه أعطى ذلك وهو على شريعة من ربه وقد شهد له الحق بذلك عند موسى وعندنا وزكاه وأما اليوم فإلياس والخضر على شريعة محمد صَلَّى اللهُ عَليهِ وسَلَّم إما بحكم الوفاق أو بحكم الاتباع وعلى كل حال فلا يكون لهما ذلك إلا على طريق التعريف لا على طريق النبوة وكذلك عيسى عليه السلام إذا نزل فلا يحكم فينا إلا بسنتنا عرفه الحق بها على طريق التعريف لا على طريق النبوة وإن كان نبيا فتحفظوا يا إخواننا من غوائل هذا الموطن فإن تمييزه صعب جدا وتستحليه النفوس ويطرأ عليها فيه التلبيس لتعشقها به وإذا أنس المحل بمثل هذا الإلقاء الذي ذكرناه هان عليه حمله وما يكون فيه كمثله حين يفجأه وإن الله إذا تكلم بالوحي فكأنه سلسلة على صفوان فتصعق الأرواح عند سماعها ويكون العلم الذي يحصل لها في تلك الصلصلة كالعلم الذي حصل من الضرب بين الكتفين وكالعلم الحاصل من النظر سؤالا وجوابا واستفادة علوم كثيرة من مجرد ضرب أو نظر وقد رأينا هذا كله بحمد الله من‏\n\n\nنفوسنا فلا نشك فيه وما أشبهه إلا بأبواب مغلقة فإذا فتحت الأبواب وتجلى لك ما وراءها أحطت بالنظرة الواحدة علما بها كما يفتح الإنسان عينه في اللمحة الواحدة فيدرك من الأرض إلى فلك البروج ثم الذي يجده صاحب هذا الأمر من ثلج برد اليقين ما لا يقدر قدره ولتلك الحرارة التي قلنا توجد عند الإلقاء\n\n\nكان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يقول عند افتتاح كل صلاة وفي أكثر الأحوال اللهم اغسلني بالثلج والماء البارد والبرد\n\n\nفهذه ثلاثة كلها بوارد\nليقابل بها حرارة الوحي فإنه محرق ولو لا القوة التي تحصل للقلب من هذا البرد هلك‏\n\n\n### [علم أحوال الآخرة من جانب ما تحوي عليه من الشدائد خاصة]\n\n\nواعلم أن هذا المنزل يتضمن من العلوم علم اليقين وعلم الحجاب وعلم الوعيد وعلم الكبرياء الكوني المنوط بالحق وعلم التقديس وعلم السبب الذي لأجله اتخذت المخلوقات أربابا من دون الله ولما ذا قال أَرْباباً من دُونِ الله وهم اتخذوها أربابا مع الله وعلم ما يحل من الربا وعلم إيثار الحق وهل يصح هذا مع اعتقادك أن لا فاعل إلا الله فعلى من يؤثره وعلم أحدية النفخة واختلاف الأثر ولما كان الاشتعال في النار بالنفخ وينطفي به السراج والهواء أقرب للاشتعال للطافته من الحشيش والفحم وعلم أحوال الآخرة من جانب ما تحوي عليه من الشدائد خاصة وعلم المعارضة التي قصدها الحلاج حتى دعا عليه عمرو بن عثمان فلما جرى عليه ما جرى كانت المشيخة تقول إنما أصيب الحلاج بدعوة الشيخ وعلم السحر الحقيقي وغير الحقيقي وهل هو في الحالتين خيال أم لا وعلم لما ذا يرجع كون الباري له كلام هل لخلقه أو لصفة قائمة به زائدة على ذاته أو نسبة خاصة أو لعلمه ومحل الإعجاز من القرآن ما هو فإن هذا علم عظيم منيع الحمى وعلم الاصطلام الذي تنتجه معارضة الكلام وعلم ما تحوي عليه البسملة من الأسرار ولما ذا انحصرت في هذه الثلاثة الأسماء وهذه الحروف المخصوصة دون باقي الحروف وأين محلها من الآخرة وهل تخلق من حروفها ملائكة أي يأتي يوم القيامة كل حرف منها صورة قائمة مثل ما تأتي سورة البقرة وسورة آل عمران وهما الزهراوان يشهدان لقارئهما وإذا وجدت صور هذه الحروف يوم القيامة فمن حيث رقمها أو من حيث التلفظ بها أو منهما والحروف المشددة منها هل تخلق صورتين أو صورة واحدة وإذا خلقت هذه الحروف صورا فمن أي شي‏ء تقي قارئها ومن في مقابلتها ووقايتها هل هي عين الشهادة فإن كانت للشهادة فما تشهد إلا لمن رقمها أو من تلفظ بها أنه رقمها أو تلفظ بها وقد رقمها الكافر وتلفظ بها المنافق وإن كانت تشهد بالإيمان بها الذي محله القلب فما هي بسملة الرقم ولا بسملة اللفظ وليس في النفس إلا العلم بها والايمان والإرادة لها وكذلك يكون الأمر على هذا التقسيم في الزهراوين من رقمها أو قراءتها أو من كونها سورة فقط أو من كونها ذات آيات وحروف وهل الآيات في الصورة كالأعضاء لصورة الحيوان أو هي لها كالصفات النفسية للموصوف لا كالأعضاء هذا كله من علم هذا المنزل وعلم الضلال والهدى وهل يرجعان إلى نسب أو إلى أعيان موجودة وإن كانت موجودة أعيانا فهل هي مخلوقة أو غير ذلك وإن كانت مخلوقة فهل هما من خلق العباد أو من خلق الله أو بعضها من خلق العبد وبعضها من خلق الله وعلم تسليط المخلوقات بعضهم على بعض من المعاني وغير المعاني فإن الله تعالى لما سمي نفسه ملكا سمي خلقه جنودا وإذا كانوا جنودا وما ثم إلا الله وخلقه فلمن يحاربون أو هم أجناد زينة لا أجناد محاربة فإن حارب بعضهم بعضا وهو الواقع فمن أجناد الله من هؤلاء الأجناد فالذين هم أجناد الله فإن الله مليكهم فمن ملك الأجناد الآخرين وهنا من الأسرار الإلهية مهالك ويرجع علم ذلك لما في أحكام الأسماء الإلهية من المنازعة والتضاد ومنها الموافق والمخالف وكذلك الأرواح الملكية وقد روى أن رجلا من المسرفين على نفسه أراد التوبة وكان من قرية كلها شر وكانت ثم قرية أخرى كلها خير فأراد الهجرة إليها فبينا هو في الطريق جاء أجله فمات فتنازعت ملائكة الرحمة الذين هم أجناد الاسم الرحيم وملائكة العذاب الذين هم أجناد الاسم المنتقم فلما طال النزاع بينهم فيمن يتسلمه من هاتين الطائفتين الذين هم وزعة الأسماء الإلهية أوحى الله إليهم إن قدروا ما بين القريتين فإلى أيهما كان أقرب كان من أهلها فقدروا ما بين القريتين فوجدوا الرجل قد ناء بصدره لا غير نحو قرية السعادة فحكم له بالسعادة فتسلمته ملائكة الرحمة ومعلوم أنه ما مشى إلا بعد حصول التوبة في قلبه أو إرادتها إن كان لا يعلم حدها فقد علم الله من ذلك ما علم وكل خطوة خطاها من أول خروجه من قريته فهجرة وحركة محمودة ومع هذا وقع الحكم بالتقدير المكاني والمكان فما سبب ذلك وما أثره في الكون وهل للحاكم فيه مدخل في الحكم بين الناس وهو الحكم بالاستهام وهو القرعة وعلم الأعمال المشروعة هل لها وجود قبل إن يعمل بها المكلف أو لا وجود لها بل هي عين عمل المكلف وإذا كانت عمله كيف تحكم الصنعة على صانعها من غير حكم النسب إذ لا أثر لها فيه إلا بما ينسب إليه منها من الثناء المحمود أو المذموم وقد ورد أن كل إنسان مرهون بعمله‏\n\n\nفمن الراهن والمرتهن إذا كان المكلف عين الرهن فما أعجب حكم الله في خلقه فو الله ما عرف الله‏\nإلا الله وهل السعداء والأشقياء على هذا الحكم أو يختص به الأشقياء دون السعداء وعلم من يخرج الله من النار من غير شفاعة شافع من المخلوقين هل هو إخراج امتناني حتى لا يتقيد أو هل هو عن شفاعة الأسماء الإلهية كما قال تعالى يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً ومعلوم أنه لا يحشر إلى شي‏ء من كان عند ذلك الشي‏ء ولما كان الاتقاء والخوف من حكم المتقي منه وهو الاسم الشديد العقاب والسريع الحساب فكان المتقي في حكم أمثال هذه الأسماء الإلهية فحشرهم الله يوم القيامة إلى الرحمن وزال عنهم حكم هؤلاء الأسماء الآخر فإن كان الأمر على هذا فقد يكون خروج شفاعة وإن لم يكن فهو خروج امتنان وهبة. وعلم صور الأعراض عن الحق والكل في قبضته. وعلم ما يتميز به الإنسان من سائر الحيوان كله والنبات والجماد والملائكة مخلوقون في المعارف إلا لطيفة الإنسان وإنها تخالف سائر المخلوقات في الخلق وهل العقل الذي في الإنسان وجد لاقتناء العلوم أو لدفع الهوى خاصة ما له غير ذلك وهذه المسألة من مسائل سهل بن عبد الله التستري ما رأيت غيره ذكرها ولا وصلت إلينا إلا من طريقه وعلوم هذا المنزل لا تحصى كثرة فاقتصرنا من ذلك على ما ذكرناه فإنه كالأمهات لما بقي في المنزل من العلوم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيل‏\n\n",
    "en": "Chapter Three Hundred and Ten: Concerning the Knowledge of the Station of the Spiritual Clanging (الصلصلة الروحانية) from the Mosaic Presence (الحضرة الموسوية).\n\nThe Messenger of Allah, peace and blessings be upon him, said concerning the descent of the Revelation (الوحي) that the Revelation comes to him like the clanging of a bell (صلصلة الجرس), and that is the hardest upon me. The narrator says: then it ceases from him, and his forehead is streaming with sweat.\n\nThe descent of the Revelation upon the Prophets has different forms, the hardest of which is the Revelation of the Clanging (وحي الصلصلة).\n\nPoetry:\n> Indeed, the constellations are predetermined positions,\n> And they are the stations (المنازل) for the wandering stars.\n> Their counterpart is the existence of fortune (السعد) that encompasses them;\n> These lead to triumph, and those to ruin.\n> When the celestial influences approach, seeking me out of love,\n> To grant me whatever knowledge (أدب) I desire.\n> And the clouds and spirits (الأرواح) came, carrying it,\n> And the thunder speaks clearly of both non-Arabs and Arabs.\n> And the lightning strips away from the lights of its origin,\n> Clothing the darkness of the night in a garment of gold.\n> And the clouds pour down the rains of Realities (الحقائق)\n> Into a house of clay, passions (الأهواء), and flame.\n> And the earth trembles in admiration of its bloom,\n> And the garden trails in its fresh garments.\n> This is the knowledge of Realities (علم الحقائق); I desire nothing but\n> The Knowledge of Allah, the Names (الأسماء), and the Veils (الحجب).\n> When the knowledge of His Essence (علم ذاته) became transcendent, He knew;\n> Upon reaching Him, I called out from nearby:\n> You are the God Whom nothing resembles,\n> Except that which came in the Revelation (التنزيل) and the Books.\n\n### [Indeed, Allah created the Spirits (الأرواح) upon Three Levels (مراتب)]\n\nKnow that Allah created the spirits (الأرواح) upon three levels, and there is no fourth:\n\n1.  Spirits whose only occupation is the glorification of the Divine Presence (جناب الحق). They have no face turned toward the world (العالم) or toward their own souls (نفوسهم). The Majesty of Allah (جلال الله) has bewildered them and snatched them away from themselves, so they are lost and intoxicated (سكارى) within Him.\n2.  Spirits governing natural, earthly bodies (أجساما طبيعية أرضية). These are the spirits of humans (الأناسي) and the spirits of animals, according to the People of Unveiling (أهل الكشف), from every elemental natural body (جسم طبيعي عنصري). For Allah, the Mighty and Majestic, says: <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (And there is nothing except that it glorifies Him with praise). And the Messenger of Allah, peace and blessings be upon him, said that everything wet and dry bears witness for the caller to prayer as far as his voice reaches, and the pebbles glorified Allah in his hand, peace and blessings be upon him, and in the hands of whomever Allah willed among his Companions. He also said concerning Uhud: \"This is a mountain that loves us, and we love it.\" These reports all indicate the life of everything and its knowledge (معرفته) of its Lord. Indeed, the heavens and the earth said: <<أَتَيْنَا طَائِعِينَ>> (We have come willingly). We know this through the path of Unveiling (الكشف), even if no report had come concerning it. These spirits governing these bodies are confined to them and subjugated one to another by virtue of the degrees (درجات) by which Allah has favored some over others, as He, the Mighty and Majestic, said: <<وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِيَتَّخِذَ بَعْضُهُمْ بَعْضًا سُخْرِيًّا>> (And We have raised some of them above others in degrees, that some of them may take others in subjugation).\n3.  Other spirits subjugated to us (مسخرات لنا). They are of many classes: those entrusted with Revelation (الوحي) and inspiration (الإلقاء); those entrusted with sustenance (الأرزاق); those entrusted with seizing souls (قبض الأرواح); those entrusted with resurrecting the dead (إحياء الموتى); those entrusted with seeking forgiveness (الاستغفار) for the believers and praying for them; and those entrusted with the plantings in Paradise as a reward for the acts of the servants.\n\n### [Indeed, Allah made natural instruments (آلات طبيعية) for the spirits of humans (الأناسي)]\n\nKnow that Allah made natural instruments (آلات طبيعية) for the spirits of humans, such as the eye, the ear, the nose, and the mouth. He placed within them powers (قوى) which He named hearing, sight, and so forth. He created for these powers two faces: one face toward the sensibles (المحسوسات), the world of witnessing (عالم الشهادة), and one face toward the Presence of Imagination (حضرة الخيال).\n\nHe made the Presence of Imagination a vast locus, wider than the world of witnessing. He placed within it a power called Imagination (الخيال), along with many other powers such as the Formative Faculty (المصورة), Thought (الفكر), Memory (الحفظ), Estimation (الوهم), and Intellect (العقل). By means of these powers, the human soul (النفس الإنسانية) perceives all the information granted to it by the realities (حقائق) of these powers.\n\nBy the face of sight that is directed toward the world of witnessing, it perceives all the sensibles and raises them to the Imagination, where the Memory preserves them after the Formative Faculty has shaped them. The Formative Faculty may also take matters from various existing things, all of which are sensible, and combine them into a strange form that was never perceived physically (حسا) in its totality, though every part of it was perceived.\n\nWhen a person sleeps, the sight looks with the face it has toward the realm of Imagination (عالم الخيال) and sees what is within it, whether it was collected by the senses or formed by the Formative Faculty—a form whose totality the senses never encountered, only the parts from which it was composed. Thus, you see the sleeper next to you perceiving himself as tormented or blessed, a merchant, a king, or a traveler. Fear may strike him in his sleep, in his Imagination, causing him to shout and scream, while the person next to him has no knowledge of this or of his state. Sometimes, if the matter intensifies, his temperament (المزاج) changes, affecting the apparent sleeping form with movement, screaming, speech, or nocturnal emission. All of this results from the dominance of that power over the animal spirit (الروح الحيواني), causing the body to change its form.\n\nWhen the subjugated angels (الأملاك المسخرة) descend with Revelation (الوحي) upon the Prophets (عليه السلام), or subtle spiritual realities (رقائق) descend upon the hearts of the Saints (الأولياء)—for the angel never descends with Revelation upon the heart of anyone other than a Prophet, nor with a complete Divine Command (أمر إلهي جملة واحدة), since the Law (الشريعة) has been established and the obligatory (الفرض), the necessary (الواجب), the recommended (المندوب), the permissible (المباح), and the disliked (المكروه) have been clarified—the Divine Command ceased with the cessation of Prophethood and Messengership. This is why the Messenger of Allah, peace and blessings be upon him, did not suffice with the cessation of Messengership alone, lest it be imagined that Prophethood remained in the Community.\n\nHe said, peace and blessings be upon him: \"Indeed, Prophethood and Messengership have ceased, so there is no Prophet after me, nor a Messenger.\"\n\nThus, no one among Allah’s creation remains whom Allah commands with an order that constitutes a law (شرعا) by which he must worship Him. For if He commanded him with an obligation, the Lawgiver (الشارع) had already commanded him with it, and the command belongs to the Lawgiver. To claim otherwise is an illusion and a claim to a Prophethood that has ceased. If he says that he is only commanded with the permissible (المباح), we say: this must either result in that permissible act becoming obligatory for him—and this is the very essence of abrogating the Law (نسخ الشرع) he follows, since by this Revelation he has made the permissible act, which the Messenger established as permissible, into an obligation whose omission is sinful—or he keeps it permissible as it was, in which case it remains as it was. What benefit, then, is there in the command brought by this angel to this claimant who holds this station?\n\nIf he says that no angel brought it, but Allah commanded him directly without an intermediary, we say: this is even greater, for you have claimed that Allah speaks to you as He spoke to Moses (عليه السلام), and no one asserts this, neither the scholars of external forms (علماء الرسوم) nor the scholars of direct experience (أهل الذوق). Furthermore, even if He spoke to you or said something to you, He would only cast into your speech knowledge (علوما) and information (أخبارا), not rulings (أحكاما) or law (شرعا), nor would He command you at all. For if He commanded you, the ruling would be the same as what we said concerning the Revelation of the angel.\n\nIf what you are hinting at is merely that Allah created knowledge (علما) in your heart concerning a certain matter, then there is nothing in every soul except the creation of knowledge specific to that individual Saint (ولي) and not others. We have clarified in this book and elsewhere what the matter is, and we have absolutely prohibited the notion that Allah commands anyone with a law (شريعة) by which he must worship Him personally or by which he is sent to others.\n\nWe do not prohibit the Real (الحق) from informing him in the manner we establish—and which the people of our path establish—with the Law by which he is commanded through the tongue of the Messenger (عليه السلام), without a scholar of external forms informing him of it, through the glad tidings (المبشرات) that remain for us from the traces of Prophethood (آثار النبوة). This is the vision (الرؤيا) that the Muslim man sees or is seen for him, and it is true and a form of Revelation (وحي). Sleep is not a prerequisite for it, but it may occur in sleep or outside of sleep. In whatever state it occurs, it is a vision perceived by the senses in the Imagination (في الخيال بالحس), not in the physical sense (لا في الحس). The imagined (المتخيل) may come from within the power or from without, through the representation of the spiritual being (الروحاني) or the Theophany (التجلي) known to the folk. However, it is a true Imagination (خيال حقيقي) if the temperament (المزاج) is sound and prepared for the Real.\n\nWhen the Angel descends upon the Prophet (عليه السلام) with a ruling or informational knowledge—even though all of it is informational—and that image meets the human spirit (الروح الإنساني), and the spirit meets it by listening (الإصغاء) and the angel by casting (الإلقاء), and they are two lights (نوران), the temperament intensifies and ignites. The innate, temperamental heat (الحرارة الغريزية) increases in quantity in the two lights, causing the person’s face to change—this is what is expressed as the State (الحال), and it is the most intense state. The bodily moisture rises as vapors to the surface of the body’s sphere due to the dominance of the heat. This results in the sweat (العرق) that affects the people of these states, due to the compression (الانضغاط) that occurs between the natures from the meeting of the two spirits. Due to the strength of the hot air exiting the body with the moisture, it covers the pores, preventing cold air from outside from penetrating.\n\nWhen the state passes from the Prophet or the person in the state, and the Angel departs from the Prophet, or the spiritual subtlety (الرقيقة الروحانية) departs from the Saint, the temperament calms, that heat subsides, the pores open, and the body accepts the cold air from outside, which penetrates the body. The temperament cools, increasing the quantity of coldness and dominating and weakening the heat. That is the coldness (البرد) that the person in the state feels, and this is why he shivers (القشعريرة) and is covered with clothes to warm him. After that, he informs others of what he received in that glad tidings, if he is a Saint, or in that Revelation, if he is a Prophet.\n\nThis entire process occurs when the descent upon the heart is in the spiritual mode (بالصفة الروحانية). If it is a *Nafth* (whispering/blowing), it is Inspiration (الإلهام), and this occurs for both the Saint and the Prophet. If he hears without seeing, he is the *Muḥaddath* (one spoken to). If the Angel appears to him—if he is a Prophet during the time of Prophethood—or if the subtlety appears to him as a represented man or the image of an animal addressing him with what it brought, then if he is a Saint, he must present it to the Book and the Sunnah. If it conforms, he sees it as an address of the Real (خطاب حق) and an honor, nothing more—no addition of a ruling, nor the creation of a ruling. However, it may be a clarification of a ruling or an announcement of the reality of the matter, whereby what was merely conjectured becomes known to him. If it does not conform to the Book and the Sunnah, he sees it as an address of the Real and a trial (ابتلاء), which is necessary. He knows definitively that that subtlety is neither the subtlety of an angel nor a Divine Theophany (مجلى إلهي), but rather a satanic subtlety (رقيقة شيطانية), for the angels are far above such a station. This mostly affects the people who hear the Real in Creation.\n\nNothing remains for the Saints today, after the cessation of Prophethood, except Divine Disclosure (التعريف), and the doors of Divine Commands and Prohibitions are closed. Whoever claims them after Muhammad (PBUH) is claiming a law revealed to him, whether it conforms to our Law or contradicts it.\n\nAs for the time before the Messenger of Allah (PBUH), there was no restriction, which is why the righteous servant Khidr said: <<وَمَا فَعَلْتُهُ عَنْ أَمْرِي>> (And I did not do it of my own accord). His time allowed that, and he was upon a law from his Lord. The Real testified to this before Moses and before us, and purified him. As for today, Elias and Khidr are upon the Law of Muhammad (PBUH), either by agreement or by following. In any case, they only receive this through the path of Disclosure (التعريف), not through the path of Prophethood. Likewise, when Jesus (عليه السلام) descends, he will only rule among us according to our Sunnah, which the Real will make known to him through Disclosure, not through Prophethood, even though he is a Prophet.\n\nSo, be cautious, O our brothers, of the pitfalls (غوائل) of this station, for its distinction is very difficult, and souls find it sweet, and deception (التلبيس) affects them due to their passion for it. If the locus becomes accustomed to such a casting (الإلقاء) as we have mentioned, bearing it becomes easy, unlike when it comes upon him suddenly.\n\nWhen Allah speaks with the Revelation, it is as if it were a chain on a smooth rock (سلسلة على صفوان), causing the spirits to swoon (تصعق الأرواح) upon hearing it. The knowledge gained by them in that Clanging (الصلصلة) is like the knowledge gained from a strike between the shoulders, or like the knowledge gained from a glance (نظر)—acquiring vast knowledge from a mere strike or glance. We have witnessed all of this, praise be to Allah, in our own souls, so we have no doubt about it. I only liken it to closed doors: when the doors are opened and what is behind them is disclosed to you, you encompass knowledge of them with a single glance, just as a person opens his eye in a single moment and perceives from the earth to the sphere of the constellations.\n\nFurthermore, the recipient of this matter finds the snow-coldness of certainty (ثلج برد اليقين) whose measure cannot be estimated. Because of that heat (الحرارة) which we said is found during the casting, the Messenger of Allah, peace and blessings be upon him, used to say at the beginning of every prayer and in most states: \"O Allah, wash me with snow (الثلج), cold water (الماء البارد), and hail (البرد).\" These three are all cooling agents (بوارد) to counteract the heat of the Revelation, for it is burning. Were it not for the strength gained by the heart from this coldness, he would perish.\n\n### [The Knowledge of the States of the Hereafter, especially concerning the hardships it contains]\n\nKnow that this station (المنزل) contains, among its sciences: the science of Certainty (علم اليقين); the science of the Veil (علم الحجاب); the science of Warning (علم الوعيد); the science of Cosmic Majesty (علم الكبرياء الكوني) pertaining to the Real (الحق); the science of Sanctification (علم التقديس); the reason why creatures took lords besides Allah (أربابا من دون الله), and why He said <<أَرْبَابًا مِنْ دُونِ اللَّهِ>> (lords besides Allah) when they took them as lords alongside Allah; the ruling on what is permissible concerning usury (الربا); the science of preferring the Real (إيثار الحق) and whether this is valid given your belief that there is no agent but Allah—upon whom, then, does one prefer Him?\n\nIt also contains the science of the Oneness of the Breath (أحدية النفخة) and the difference in its effect, and why blowing causes fire to ignite, yet extinguishes a lamp, and why air is closer to ignition due to its subtlety than wood or coal; the science of the states of the Hereafter (الآخرة), especially concerning the hardships (الشدائد) it contains; the science of the opposition intended by Al-Hallaj, which led Amr ibn Uthman to curse him, and when what happened to him occurred, the Shaykhs used to say that Al-Hallaj was afflicted by the curse of the Shaykh; the science of real and unreal magic (السحر الحقيقي وغير الحقيقي), and whether it is Imagination (خيال) in both cases; the science of why the Creator having Speech (كلام) returns to His creation, or to an Attribute (صفة) subsisting in Him beyond His Essence (ذاته), or to a specific relation (نسبة خاصة), or to His Knowledge (علمه); and what the locus of the miraculous nature (الإعجاز) of the Quran is, for this is a great and protected science.\n\nIt includes the science of the Annihilation (الاصطلام) resulting from the opposition of speech; the secrets contained in the Basmala (بسم الله الرحمن الرحيم), and why it is confined to these three Names and these specific letters rather than the rest of the letters; where its place is in the Hereafter, and whether angels are created from its letters—that is, whether every letter comes on the Day of Resurrection as a standing image, just as Surah Al-Baqarah and Surah Al Imran come as the two luminous ones (الزهراوان) testifying for their reciter.\n\nIf the images of these letters are found on the Day of Resurrection, is it based on their inscription (رقمها) or their pronunciation (التلفظ بها), or both? Do the doubled letters (المشددة) create two images or one? If these letters create images, from what do they protect their reciter, and who is the opposite of their protection? If they are for testimony (الشهادة), they only testify for the one who inscribed them or pronounced them that he inscribed or pronounced them, yet the disbeliever inscribed it and the hypocrite pronounced it. If they testify to the faith (الإيمان) in it, whose locus is the heart, then it is neither the Basmala of inscription nor the Basmala of utterance, but rather the knowledge, faith, and will in the soul. The same applies to the two luminous ones (الزهراوان) according to this division: is it based on their inscription, their recitation, or their being merely a Surah, or their being composed of verses and letters? Are the verses in the image like the limbs of the animal image, or are they like the psychological attributes (الصفات النفسية) of the described, not like the limbs? All of this is from the science of this station.\n\nIt includes the science of Misguidance (الضلال) and Guidance (الهدى): Do they return to relations (نسب) or to existing entities (أعيان موجودة)? If they are existing entities, are they created or otherwise? If created, are they from the creation of the servants or the creation of Allah, or some from the creation of the servant and some from the creation of Allah?\n\nIt includes the science of Allah subjugating creatures to one another (تسليط المخلوقات بعضهم على بعض), both in meanings and otherwise. Since Allah named Himself King (ملك), He named His creation soldiers (جنود). If they are soldiers, and there is nothing but Allah and His creation, whom do they fight? Or are they soldiers for adornment, not for fighting? If they fight one another, which is what happens, who among these soldiers are the soldiers of Allah? Those who are the soldiers of Allah have Him as their King, so who is the King of the other soldiers? Herein lie deadly Divine secrets, and the knowledge of this returns to the conflict and opposition found in the rulings of the Divine Names (الأسماء الإلهية), some of which are agreeable and some contradictory. The same applies to the angelic spirits (الأرواح الملكية).\n\nIt has been narrated that a man who had been excessive against his own soul desired repentance. He was from a village that was entirely evil, and there was another village that was entirely good. He intended to migrate to the good village. While he was on the road, his term came, and he died. The angels of Mercy (who are the soldiers of the Name The Compassionate - الرحيم) and the angels of Punishment (who are the soldiers of the Name The Avenger - المنتقم) disputed over who should receive him from these two groups, who are the distributors of the Divine Names. When the dispute between them grew long, Allah revealed to them: \"Measure the distance between the two villages. Whichever he is closer to, he belongs to its people.\" They measured the distance between the two villages and found that the man had leaned forward with his chest, and nothing else, toward the village of happiness. So, happiness was decreed for him, and the angels of Mercy received him.\n\nIt is known that he only walked after repentance had occurred in his heart, or the intention for it, if he did not know its limit. Allah knew what He knew of that. Every step he took from the moment he left his village was a migration and a praiseworthy movement. Yet, the ruling was based on spatial measurement (التقدير المكاني) and place. What is the reason for this, and what is its effect in the Cosmos (الكون)? Does the judge have a role in judging between people, which is the judgment by casting lots (الاستهام)?\n\nIt includes the science of prescribed actions (الأعمال المشروعة): Do they have existence before the responsible person (المكلف) performs them, or do they have no existence, but are the very act of the المكلف? If they are his act, how does the artifact rule over its maker, without the ruling of relations, since it has no effect on him except for the praiseworthy or blameworthy praise attributed to him from it? It has been reported that every person is held in pledge for what he has earned (مرهون بعمله). Who is the pledger (الراهن) and the pledgee (المرتهن) if the المكلف is the pledge itself? How wondrous is the judgment of Allah in His creation! By Allah, none knows Allah but Allah. Are the fortunate (السعداء) and the wretched (الأشقياء) subject to this ruling, or is it specific to the wretched, excluding the fortunate?\n\nIt includes the science of those whom Allah removes from the Fire without the intercession of any creature. Is this a removal by grace (إخراج امتناني) so that it is not restricted, or is it through the intercession of the Divine Names (الأسماء الإلهية), as He the Almighty said: <<يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمَنِ وَفْدًا>> (The Day We will gather the righteous to the Most Merciful as a delegation)? It is known that one is not gathered to something when one is already with that thing. Since piety (الاتقاء) and fear arise from the ruling of that which is feared—namely, the Name Severe in Punishment (الشديد العقاب) and Swift in Reckoning (السريع الحساب)—the pious were under the ruling of such Divine Names. Thus, Allah gathers them on the Day of Resurrection to the Most Merciful (الرحمن), and the ruling of those other Names is removed from them. If the matter is thus, then the removal may be by intercession; if not, it is a removal by grace and gift.\n\nIt includes the science of the forms of turning away from the Real (الأعراض عن الحق), while everything is in His grasp.\n\nIt includes the science of what distinguishes the human being (الإنسان) from all other animals, plants, minerals, and angels created in terms of gnosis (المعارف), except for the human subtlety (لطيفة الإنسان), which differs from all other created things in its creation.\n\nIt includes the purpose of the Intellect (العقل) in humans: Is it for acquiring knowledge (اقتناء العلوم) or solely for repelling caprice (دفع الهوى), having no other purpose? This question is one of the issues raised by Sahl ibn Abdullah al-Tustari; I have not seen anyone else mention it, nor has it reached us except through his path.\n\nThe sciences of this station are too numerous to count, so we have limited ourselves to what we have mentioned, for they are like the foundations (الأمهات) for the remaining sciences in this station. And Allah speaks the Truth (الحق), and He guides to the Way.",
    "ur": "باب نمبر تین سو دس: حضرت موسوی (Al-Ḥaḍrah al-Mūsawiyyah) سے روحانی جھنکار (Aṣ-Ṣalṣalah ar-Rūḥāniyyah) کے مقام کی معرفت میں\n\nرسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے وحی کے نزول کے بارے میں فرمایا کہ آپ کے پاس وحی گھنٹی کی جھنکار (صلصلة الجرس) کی مانند آتی ہے، اور یہ آپ پر سب سے زیادہ شدید ہوتی ہے۔ راوی کہتا ہے کہ جب یہ کیفیت آپ سے ختم ہوتی تو آپ کی پیشانی سے پسینہ ٹپک رہا ہوتا۔\n\nپس انبیاء پر وحی کا نزول مختلف صورتوں میں ہوتا ہے، جن میں سب سے شدید وحیِ صلصلہ ہے۔\n\nشعر:\n> إِنَّ الْبُرُوجَ لَأَوْضَاعٌ مُقَدَّرَةٌ *** وَهِيَ الْمَنَازِلُ لِلسَّيَّارَةِ الشُّهُبِ‏\n> بے شک برج مقررہ مقامات ہیں، اور وہ سیاروں اور شہابوں کی منزلیں ہیں۔\n\n> نَظِيرُهَا مِنْ وُجُودِ السَّعْدِ يَشْمَلُهُ *** هَذِي إِلَى الْفَوْزِ وَالْأُخْرَى إِلَى الْعَطَبِ‏\n> ان کا نظیر سعد (خوش بختی) کی ہستی (Al-Wujūd) سے شامل ہوتا ہے، یہ (ایک) کامیابی کی طرف اور دوسری ہلاکت کی طرف لے جاتی ہے۔\n\n> إِذَا تَعَرَّضَتِ الْأَنْوَاءُ تَطْلُبُنِي *** حُبًّا لِتَمْنَحَنِي مَا شِئْتُ مِنْ أَدَبِ‏\n> جب ستارے مجھ سے محبت میں ملنے آتے ہیں تاکہ مجھے وہ ادب عطا کریں جو میں چاہوں۔\n\n> وَجَاءَتِ السُّحْبُ وَالْأَرْوَاحُ تَحْمِلُهَا *** وَالرَّعْدُ يُفْصِحُ عَنْ عُجْمٍ وَعَنْ عَرَبِ‏\n> اور بادل آئے، اور ارواح (Al-Arwāḥ) انہیں اٹھائے ہوئے تھیں، اور گرج عجمی اور عربی دونوں کے بارے میں وضاحت کرتی ہے۔\n\n> وَالْبَرْقُ يَخْلَعُ مِنْ أَنْوَارِ نَشْأَتِهِ *** عَلَى ظَلَامِ الدُّجَا ثَوْبًا مِنَ الذَّهَبِ‏\n> اور بجلی اپنی پیدائش کے انوار سے تاریک رات پر سونے کا لباس ڈالتی ہے۔\n\n> وَالسُّحْبُ تَسْكُبُ أَمْطَارَ الْحَقَائِقِ فِي *** بَيْتٍ مِنَ الطِّينِ وَالْأَهْوَاءِ وَاللَّهَبِ‏\n> اور بادل حقائق کی بارش مٹی، خواہشات اور شعلے کے گھر میں انڈیلتے ہیں۔\n\n> وَالْأَرْضُ تَهْتَزُّ إِعْجَابًا بِزَهْرَتِهَا *** وَالرَّوْضُ يَرْفُلُ فِي أَثْوَابِهِ الْقُشُبِ‏\n> اور زمین اپنے پھولوں پر ناز کرتے ہوئے کانپتی ہے، اور باغ اپنے نئے لباس میں جھومتا ہے۔\n\n> عِلْمُ الْحَقَائِقِ هَذَا لَا أُرِيدُ سِوَى *** الْعِلْمِ بِاللَّهِ وَالْأَسْمَاءِ وَالْحُجُبِ‏\n> یہ حقائق کا علم ہے، میں ذات حق (Al-Ḥaqq)، اسماء اور حجابات کے علم کے سوا کچھ نہیں چاہتا۔\n\n> لَمَّا تَنَزَّهَ عِلْمُ ذَاتِهِ عُلِمَ *** عَلَى الْوُصُولِ بِهِ نَادَيْتُ مِنْ كَثَبِ‏\n> جب اس کی ذات کا علم پاکیزہ ہو کر معلوم ہوا، تو میں نے اس تک پہنچنے کے لیے قریب سے پکارا۔\n\n> أَنْتَ الْإِلَهُ الَّذِي لَا شَيْ‏ءَ يُشْبِهُهُ *** إِلَّا الَّذِي جَاءَ فِي التَّنْزِيلِ وَالْكُتُبِ‏\n> تو وہ معبود ہے جس کی کوئی چیز مشابہت نہیں رکھتی، سوائے اس کے جو تنزیل اور کتابوں میں آیا ہے۔\n\n### [بے شک اللہ نے ارواح کو تین مراتب پر پیدا کیا]\n\nجان لو کہ اللہ نے ارواح (Al-Arwāḥ) کو تین مراتب پر پیدا کیا ہے، چوتھا کوئی نہیں۔ (۱) ایسی ارواح جن کا کام صرف جناب حق (Al-Ḥaqq) کی تعظیم ہے، ان کا رخ نہ عالم کی طرف ہے اور نہ ہی اپنی ذات کی طرف۔ اللہ کے جلال نے انہیں مدہوش کر دیا ہے اور انہیں ان سے چھین لیا ہے، پس وہ اس میں حیران اور مست ہیں۔ (۲) وہ ارواح جو طبعی، زمینی اجسام کی تدبیر کرتی ہیں، اور یہ اہل کشف (Al-Kashf) کے نزدیک ہر طبعی عنصری جسم کی انسانی ارواح اور حیوانی ارواح ہیں۔ کیونکہ اللہ عزوجل فرماتا ہے: وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ (اور کوئی چیز ایسی نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے)۔ اور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: مؤذن کے لیے اس کی آواز کی حد تک تر و خشک ہر چیز گواہی دیتی ہے۔ اور آپ صلی اللہ علیہ وسلم کی ہتھیلی میں اور آپ کے صحابہ میں سے جس کی اللہ نے چاہا، اس کی ہتھیلی میں کنکریوں نے تسبیح کی۔\n\nاور آپ نے احد کے بارے میں فرمایا: هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ (یہ ایسا پہاڑ ہے جو ہم سے محبت کرتا ہے اور ہم اس سے محبت کرتے ہیں)۔\n\nپس یہ تمام خبریں ہر چیز کی زندگی اور اس کے رب کی معرفت (Al-Ma'rifah) پر دلالت کرتی ہیں، کیونکہ آسمان اور زمین نے کہا: أَتَيْنَا طَائِعِينَ (ہم خوشی سے حاضر ہیں)۔ اور ہم یہ بات کشف (Al-Kashf) کے ذریعے جانتے ہیں، اگرچہ اس بارے میں کوئی خبر نہ بھی آتی۔ اور یہ ارواح جو ان اجسام کی تدبیر کرتی ہیں، ان پر محدود ہیں، اور اللہ نے ان میں سے بعض کو بعض پر جو فضیلت دی ہے، اس کے سبب وہ ایک دوسرے کے لیے مسخر ہیں۔ جیسا کہ اللہ عزوجل نے فرمایا: وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِيَتَّخِذَ بَعْضُهُمْ بَعْضًا سُخْرِيًّا (اور ہم نے ان میں سے بعض کو بعض پر درجات میں بلند کیا تاکہ وہ ایک دوسرے کو خدمت میں لے آئیں)۔ (۳) اور کچھ دوسری ارواح ہیں جو ہمارے لیے مسخر ہیں، اور وہ کئی طبقات پر ہیں۔ ان میں سے کچھ وحی اور القاء پر مقرر ہیں، کچھ رزق پر مقرر ہیں، کچھ ارواح قبض کرنے پر مقرر ہیں، کچھ مردوں کو زندہ کرنے پر مقرر ہیں، کچھ مؤمنین کے لیے استغفار اور دعا پر مقرر ہیں، اور کچھ بندوں کے اعمال کے بدلے میں جنت میں باغات لگانے پر مقرر ہیں۔\n\n### [بے شک اللہ نے انسانی ارواح کے لیے طبعی آلات بنائے]\n\nپس جان لو کہ اللہ نے انسانی ارواح کے لیے طبعی آلات بنائے ہیں، جیسے آنکھ، کان، ناک اور منہ۔ اور ان میں قوتیں رکھیں جنہیں سماعت، بصارت وغیرہ کا نام دیا۔ اور ان قوتوں کے لیے دو رُخ بنائے: ایک رُخ محسوسات کی طرف یعنی عالمِ شہادت کی طرف، اور دوسرا رُخ عالمِ خیال (Ḥaḍrat al-Khayāl) کی طرف۔ اور عالمِ خیال (Ḥaḍrat al-Khayāl) کو ایک وسیع جگہ بنایا جو عالمِ شہادت سے بھی زیادہ وسیع ہے۔ اور اس میں ایک قوت رکھی جسے خیال (Al-Khayāl) کہتے ہیں، اس کے علاوہ بہت سی قوتیں ہیں جیسے مصوّرہ (تصویر بنانے والی)، فکر، حفظ، وہم اور عقل وغیرہ۔ اور ان قوتوں کے ذریعے نفسِ انسانی وہ تمام معلومات حاصل کرتا ہے جو ان قوتوں کے حقائق اسے عطا کرتے ہیں۔\n\nبصارت کا جو رُخ عالمِ شہادت کی طرف ہے، اس کے ذریعے وہ تمام محسوسات کا ادراک کرتا ہے اور انہیں خیال (Al-Khayāl) کی طرف اٹھا دیتا ہے۔ پھر قوتِ حافظہ انہیں خیال میں محفوظ رکھتی ہے، اس کے بعد کہ قوتِ مصوّرہ ان کی تصویر بنا چکی ہوتی ہے۔ اور کبھی قوتِ مصوّرہ مختلف موجودات سے، جو سب محسوس ہیں، کچھ امور لے کر ایک ایسی عجیب شکل ترکیب دیتی ہے جسے اس نے مجموعی طور پر کبھی حِس سے نہیں دیکھا ہوتا، لیکن اس کا کوئی جز ایسا نہیں ہوتا جسے اس نے نہ دیکھا ہو۔\n\nجب انسان سوتا ہے، تو بصارت اپنے اس رُخ سے جو عالمِ خیال کی طرف ہے، دیکھتی ہے، اور وہ اس میں وہ چیزیں دیکھتا ہے جو حِس نے مجموعی طور پر منتقل کی تھیں، یا وہ جو قوتِ مصوّرہ نے تصویر کی تھیں، جن پر حِس مجموعی طور پر کبھی نہیں پڑی تھی، صرف ان اجزاء پر پڑی تھی جن سے یہ صورت مرکب ہوئی ہے۔ پس تم اسے اپنے پہلو میں سویا ہوا دیکھتے ہو، اور وہ خود کو عذاب میں، یا نعمت میں، یا تاجر، یا بادشاہ، یا مسافر دیکھ رہا ہوتا ہے۔ اور نیند میں اس کے خیال میں اس پر خوف طاری ہوتا ہے، تو وہ چیختا اور چلاتا ہے۔ اور اس کے پہلو والے کو اس کا کوئی علم نہیں ہوتا اور نہ ہی اس کیفیت کا جس میں وہ ہے۔ اور بسا اوقات جب معاملہ شدید ہو جاتا ہے تو اس کا مزاج (Al-Mizāj) بدل جاتا ہے، اور سوئی ہوئی ظاہری صورت میں حرکت، چیخ، کلام یا احتلام کی صورت میں اثر ظاہر ہوتا ہے۔ یہ سب اس قوت کے حیوانی روح پر غالب آنے کی وجہ سے ہوتا ہے، جس سے بدن اپنی صورت میں بدل جاتا ہے۔\n\nاور جب وحی کے ساتھ مسخر کیے گئے فرشتے انبیاء علیہم السلام پر نازل ہوتے ہیں، یا ان کے لطائف اولیاء کے دلوں پر نازل ہوتے ہیں (کیونکہ فرشتہ کسی نبی کے علاوہ کسی کے دل پر وحی کے ساتھ ہرگز نازل نہیں ہوتا، اور نہ ہی کسی الٰہی حکم کے ساتھ مجموعی طور پر نازل ہوتا ہے)، کیونکہ شریعت مستحکم ہو چکی ہے اور فرض، واجب، مستحب، مباح اور مکروہ واضح ہو چکے ہیں۔ لہٰذا نبوت اور رسالت کے منقطع ہونے سے الٰہی حکم منقطع ہو گیا۔ اسی لیے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے صرف رسالت کے انقطاع پر اکتفا نہیں کیا، تاکہ یہ وہم نہ ہو کہ امت میں نبوت باقی ہے۔\n\nپس آپ صلی اللہ علیہ وسلم نے فرمایا: إِنَّ النُّبُوَّةَ وَالرِّسَالَةَ قَدِ انْقَطَعَتْ فَلَا نَبِيَّ بَعْدِي وَلَا رَسُولَ (بے شک نبوت اور رسالت منقطع ہو چکی ہے، میرے بعد کوئی نبی نہیں اور نہ کوئی رسول ہے)۔\n\nپس اللہ کی مخلوق میں سے کوئی باقی نہیں رہا جسے اللہ کسی ایسے امر کا حکم دے جو شریعت ہو اور وہ اس کی عبادت کرے۔ کیونکہ اگر اللہ اسے فرض کا حکم دے، تو شارع (رسول) نے اسے پہلے ہی حکم دے رکھا ہے۔ پس حکم شارع کا ہے، اور یہ اس کی طرف سے وہم اور نبوت کا دعویٰ ہے جو منقطع ہو چکی ہے۔ اگر وہ کہے کہ اسے صرف مباح کا حکم دیا گیا ہے، تو ہم کہیں گے کہ یہ دو حالتوں سے خالی نہیں: یا تو وہ مباح اس کے حق میں واجب ہو جائے گا، تو یہ عین شریعت کو منسوخ کرنا ہے جس پر وہ قائم ہے، کیونکہ اس وحی کے ذریعے اس مباح کو جسے رسول نے مباح قرار دیا تھا، واجب بنا دیا گیا جس کے ترک پر گناہ ہو گا۔ اور اگر وہ اسے مباح ہی رکھے جیسا کہ وہ تھا، تو پھر وہ ویسا ہی رہا۔ تو اس حکم میں کیا فائدہ ہوا جس کے ساتھ یہ فرشتہ اس مدعی صاحبِ مقام کے پاس آیا؟\n\nاگر وہ کہے کہ فرشتہ نہیں آیا بلکہ اللہ نے مجھے بغیر کسی واسطے کے حکم دیا، تو ہم کہیں گے کہ یہ اس سے بھی بڑا دعویٰ ہے، کیونکہ تم نے یہ دعویٰ کیا کہ اللہ تم سے کلام کرتا ہے جیسا کہ اس نے موسیٰ علیہ السلام سے کلام کیا، اور اس کا کوئی قائل نہیں، نہ علماءِ رسوم میں سے اور نہ ہی اہل ذوق کے علماء میں سے۔ پھر یہ کہ اگر وہ تم سے کلام کرتا یا تم سے کہتا، تو وہ اپنے کلام میں تمہیں صرف علوم اور اخبار ہی القاء کرتا، نہ کہ احکام اور شریعت، اور نہ ہی تمہیں کوئی حکم دیتا۔ کیونکہ اگر وہ تمہیں حکم دیتا تو حکم وہی ہوتا جو ہم نے وحیِ ملک کے بارے میں کہا۔\n\nاگر وہ جس پر تم زور دے رہے ہو، اس بات کا اظہار ہے کہ اللہ نے تمہارے دل میں کسی امر کا علم پیدا کر دیا ہے، تو ہر نفس میں صرف وہی علم پیدا کیا جاتا ہے جو اس ولی کے ساتھ خاص ہوتا ہے، نہ کہ کسی اور کے ساتھ۔ اور ہم نے اس کتاب اور دیگر کتب میں بیان کر دیا ہے کہ معاملہ کیا ہے، اور ہم نے یکسر منع کر دیا ہے کہ اللہ کسی کو ایسی شریعت کا حکم دے جس کے ذریعے وہ اپنی ذات میں عبادت کرے یا اسے کسی دوسرے کی طرف بھیجے۔\n\nاور ہم اس بات سے منع نہیں کرتے کہ ذات حق (Al-Ḥaqq) اسے اس طریقے سے علم دے جس کا ہم اور ہمارے طریق کے اہل نے فیصلہ کیا ہے، یعنی اس شریعت کے ذریعے جس کی عبادت کا حکم اسے رسول علیہ السلام کی زبان پر دیا گیا ہے، بغیر اس کے کہ علماءِ رسوم میں سے کوئی عالم اسے بتائے۔ یہ ان مبشرات (خوشخبریوں) کے ذریعے ہوتا ہے جو نبوت کے آثار میں سے ہمارے لیے باقی رکھی گئی ہیں، اور وہ رؤیا (خواب) ہے جسے مسلمان شخص دیکھتا ہے یا اس کے لیے دیکھا جاتا ہے، اور وہ حق اور وحی ہوتی ہے۔ اس میں سونا شرط نہیں، لیکن یہ نیند میں بھی ہو سکتی ہے اور نیند کے علاوہ بھی۔ اور کسی بھی حالت میں ہو، وہ حِس میں نہیں بلکہ حِس کے ذریعے خیال (Al-Khayāl) میں رؤیا ہوتی ہے۔ اور متخیَّل (جس کا خیال کیا جائے) کبھی قوت کے اندر سے ہوتا ہے اور کبھی باہر سے، روحانی کے تمثل (صورت اختیار کرنے) یا قوم کے ہاں معروف تجلی (At-Tajallī) کے ذریعے ہوتا ہے۔ لیکن یہ حقیقی خیال ہوتا ہے، جب مزاج (Al-Mizāj) درست ہو اور حق کے لیے تیار ہو۔\n\nپس جب فرشتہ نبی علیہ السلام پر کسی حکم یا خبری علم کے ساتھ نازل ہوتا ہے (اگرچہ سب خبر کے قبیل سے ہے) اور وہ صورت روحانی انسانی روح سے ملتی ہے، اور یہ (روح) سننے کے ذریعے اور وہ (فرشتہ) القاء کے ذریعے ملتا ہے، اور وہ دونوں نور ہیں، تو مزاج (Al-Mizāj) تیز ہو جاتا ہے اور بھڑک اٹھتا ہے، اور دونوں نوروں میں غریزی مزاجی حرارت قوی ہو جاتی ہے اور اس کی مقدار بڑھ جاتی ہے۔ اس لیے شخص کا چہرہ بدل جاتا ہے، اور اسی کو حال سے تعبیر کیا جاتا ہے، اور یہ سب سے زیادہ شدید ہوتا ہے۔ اور جسمانی رطوبتیں بخارات بن کر بدن کے کرہ کی سطح پر چڑھ جاتی ہیں، حرارت کے غلبے کی وجہ سے۔ پس اسی سے وہ پسینہ آتا ہے جو ان احوال کے اصحاب پر طاری ہوتا ہے، جو دونوں روحوں کے ملنے سے طبائع کے درمیان پیدا ہونے والے دباؤ کی وجہ سے ہوتا ہے۔ اور رطوبتوں کے ساتھ بدن سے خارج ہونے والی گرم ہوا کی قوت کی وجہ سے مسام بند ہو جاتے ہیں، اور باہر سے ٹھنڈی ہوا اس میں داخل نہیں ہو پاتی۔\n\nجب نبی اور صاحبِ حال سے یہ کیفیت دور ہو جاتی ہے، اور فرشتہ نبی سے اور روحانی لطیفہ ولی سے واپس چلا جاتا ہے، تو مزاج (Al-Mizāj) پرسکون ہو جاتا ہے، وہ حرارت کم ہو جاتی ہے، اور مسام کھل جاتے ہیں، اور جسم باہر سے ٹھنڈی ہوا قبول کرتا ہے، تو جسم میں ٹھنڈک داخل ہو جاتی ہے اور مزاج ٹھنڈا ہو جاتا ہے، اور ٹھنڈک کی مقدار بڑھ جاتی ہے اور حرارت کو کمزور کر دیتی ہے۔ پس یہی وہ سردی ہے جو صاحبِ حال محسوس کرتا ہے، اور اسی لیے اسے کپکپی طاری ہوتی ہے، تو اسے گرم ہونے کے لیے مزید کپڑے اوڑھائے جاتے ہیں۔ پھر اس کے بعد وہ اس خوشخبری کے بارے میں بتاتا ہے جو اسے حاصل ہوئی، اگر وہ ولی ہے، یا اس وحی کے بارے میں بتاتا ہے، اگر وہ نبی ہے۔\n\nیہ سب اس وقت ہوتا ہے جب نزول قلب پر روحانی صفت کے ساتھ ہو۔ اگر وہ نفث (پھونک) ہو تو وہ الہام (Al-Ilhām) ہے، اور یہ ولی اور نبی دونوں کو ہوتا ہے۔ لیکن اگر وہ بغیر رؤیت کے سنا جائے تو وہ محدَّث (جس سے کلام کیا جائے) ہے۔ اور اگر نبی کے لیے نبوت کے زمانے میں فرشتہ ظاہر ہو، یا ولی کے لیے لطیفہ کسی آدمی کی صورت میں یا کسی حیوان کی صورت میں ظاہر ہو جو اس سے اس چیز کے بارے میں مخاطب ہو جو وہ لایا ہے، تو اگر وہ ولی ہے تو وہ اسے کتاب و سنت پر پیش کرے گا۔ اگر وہ موافق ہو تو وہ اسے حق کا خطاب اور محض تشریف سمجھے گا، نہ کہ حکم میں اضافہ یا حکم کا احداث۔ لیکن یہ کسی حکم کا بیان یا اس امر کی اطلاع ہو سکتی ہے جس پر معاملہ قائم ہے، تو جو چیز اس کے نزدیک ظنی تھی وہ معلوم ہو جائے گی۔ اور اگر وہ کتاب و سنت کے موافق نہ ہو، تو وہ اسے حق کا خطاب اور ابتلاء (آزمائش) سمجھے گا، جو ضروری ہے۔ پس وہ قطعی طور پر جان لے گا کہ وہ لطیفہ نہ تو فرشتہ کا لطیفہ ہے اور نہ ہی الٰہی تجلی (At-Tajallī)، بلکہ وہ شیطانی لطیفہ ہے۔ کیونکہ فرشتوں کا ایسا مقام نہیں ہے، اور وہ اس سے زیادہ جلیل ہیں۔ اور یہ کیفیت اکثر ان لوگوں پر طاری ہوتی ہے جو مخلوق میں حق کی سماعت کرتے ہیں۔\n\nپس نبوت کے اٹھ جانے کے بعد آج اولیاء کے لیے صرف تعریف (آگاہی) باقی رہ گئی ہے، اور الٰہی اوامر و نواہی کے دروازے بند ہو چکے ہیں۔ پس جو محمد صَلَّى اللهُ عَليهِ وسَلَّم کے بعد ان کا دعویٰ کرے، وہ ایسی شریعت کا مدعی ہے جو اس پر وحی کی گئی ہے، خواہ وہ ہماری شریعت کے موافق ہو یا مخالف۔\n\nلیکن ہمارے زمانے سے پہلے، رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم سے پہلے، کوئی پابندی نہیں تھی، اسی لیے نیک بندے خضر نے کہا: وَمَا فَعَلْتُهُ عَنْ أَمْرِي (اور میں نے یہ اپنے حکم سے نہیں کیا)۔ کیونکہ ان کا زمانہ اس کی اجازت دیتا تھا، اور وہ اپنے رب کی شریعت پر تھے، اور ذات حق (Al-Ḥaqq) نے موسیٰ کے سامنے اور ہمارے سامنے اس کی گواہی دی اور اسے پاکیزہ قرار دیا۔ لیکن آج الیاس اور خضر محمد صَلَّى اللهُ عَليهِ وسَلَّم کی شریعت پر ہیں، خواہ موافقت کے حکم سے ہو یا اتباع کے حکم سے۔ اور بہر حال، ان کے لیے یہ صرف تعریف (آگاہی) کے طریقے پر ہو گا، نہ کہ نبوت کے طریقے پر۔ اسی طرح عیسیٰ علیہ السلام جب نازل ہوں گے تو ہم میں صرف ہماری سنت کے مطابق ہی حکم کریں گے، حق نے انہیں نبوت کے طریقے پر نہیں بلکہ تعریف کے طریقے پر اس سے آگاہ کیا ہے۔\n\nپس اے ہمارے بھائیو! اس مقام کی آفتوں سے بچو، کیونکہ اس کی تمیز بہت مشکل ہے، اور نفوس اسے لذیذ سمجھتے ہیں، اور اس سے ان کی محبت کی وجہ سے اس میں ان پر فریب طاری ہو جاتا ہے۔ اور جب محل اس طرح کے القاء کا عادی ہو جاتا ہے جس کا ہم نے ذکر کیا، تو اس کا بوجھ اٹھانا اس پر آسان ہو جاتا ہے، جیسا کہ جب وہ اچانک آتا ہے تو ہوتا ہے۔\n\nاور بے شک اللہ جب وحی کے ساتھ کلام کرتا ہے تو گویا وہ پتھر پر زنجیر کی جھنکار (صلصلة) ہے۔ پس ارواح اسے سن کر بے ہوش ہو جاتی ہیں، اور جو علم انہیں اس صلصلہ (Aṣ-Ṣalṣalah) میں حاصل ہوتا ہے، وہ اس علم کی طرح ہوتا ہے جو دو کندھوں کے درمیان ضرب سے حاصل ہوتا ہے، اور اس علم کی طرح جو سوال و جواب کے ذریعے نظر سے حاصل ہوتا ہے، اور محض ضرب یا نظر سے بہت سے علوم کا استفادہ ہوتا ہے۔ ہم نے یہ سب کچھ اللہ کی حمد سے اپنی ذاتوں میں دیکھا ہے، لہٰذا ہمیں اس میں کوئی شک نہیں ہے۔ اور میں اس کی مثال صرف بند دروازوں سے دیتا ہوں، جب دروازے کھل جاتے ہیں اور جو کچھ ان کے پیچھے ہے وہ تم پر ظاہر ہو جاتا ہے، تو تم ایک ہی نظر میں اس کا علم حاصل کر لیتے ہو، جیسا کہ انسان ایک لمحے میں اپنی آنکھ کھولتا ہے تو زمین سے لے کر برجوں کے فلک تک کا ادراک کر لیتا ہے۔\n\nپھر جو چیز صاحبِ امر کو یقین کی ٹھنڈک (ثلج برد الیقین) سے ملتی ہے، اس کی قدر و قیمت کا اندازہ نہیں لگایا جا سکتا۔ اور اس حرارت کی وجہ سے جو ہم نے کہا کہ القاء کے وقت پائی جاتی ہے،\n\nرسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم ہر نماز کے آغاز میں اور اکثر حالات میں یہ دعا فرماتے تھے: اللَّهُمَّ اغْسِلْنِي بِالثَّلْجِ وَالْمَاءِ الْبَارِدِ وَالْبَرَدِ (اے اللہ! مجھے برف، ٹھنڈے پانی اور اولوں سے دھو دے)۔\n\nیہ تینوں چیزیں ٹھنڈک لانے والی ہیں، تاکہ ان سے وحی کی حرارت کا مقابلہ کیا جائے، کیونکہ وہ جلانے والی ہے۔ اور اگر اس ٹھنڈک سے قلب کو قوت حاصل نہ ہوتی تو وہ ہلاک ہو جاتا۔\n\n### [خاص طور پر آخرت کے احوال کا علم، اس پہلو سے کہ وہ کن سختیوں پر مشتمل ہے]\n\nاور جان لو کہ یہ مقام علوم میں سے علم الیقین، علم الحجاب، علم الوعید (سزا کا علم)، ذات حق (Al-Ḥaqq) سے متعلق کونیائی کبریائی کا علم، علم تقدیس، اور اس سبب کا علم جس کی وجہ سے مخلوقات نے اللہ کے سوا رب بنائے، اور یہ کہ اللہ نے أَرْبَابًا مِنْ دُونِ اللَّهِ (اللہ کے سوا رب) کیوں کہا، حالانکہ انہوں نے انہیں اللہ کے ساتھ رب بنایا تھا، اور سود کے حلال ہونے کا علم، اور ذات حق (Al-Ḥaqq) کو ترجیح دینے کا علم، اور کیا یہ تمہارے اس اعتقاد کے ساتھ درست ہے کہ اللہ کے سوا کوئی فاعل نہیں؟ تو پھر کس پر ترجیح دی جائے؟ اور نفخ (پھونک) کی احدیت اور اثر کے اختلاف کا علم، اور یہ کہ آگ میں شعلہ نفخ سے کیوں ہوتا ہے، اور چراغ اس سے کیوں بجھ جاتا ہے، اور ہوا اپنی لطافت کی وجہ سے لکڑی اور کوئلے سے زیادہ جلنے کے قریب کیوں ہے؟ اور خاص طور پر آخرت کے احوال کا علم، اس پہلو سے کہ وہ کن سختیوں پر مشتمل ہے۔\n\nاور اس مخالفت کا علم جس کا قصد حلاج نے کیا، یہاں تک کہ عمرو بن عثمان نے اس کے خلاف دعا کی، پس جب اس پر وہ گزرا جو گزرا، تو مشائخ کہا کرتے تھے کہ حلاج کو شیخ کی دعا کی وجہ سے مصیبت پہنچی۔ اور حقیقی اور غیر حقیقی جادو کا علم، اور کیا وہ دونوں حالتوں میں خیال ہے یا نہیں؟ اور اس علم کا کہ باری تعالیٰ کے لیے کلام کا ہونا کس وجہ سے ہے؟ کیا اس کی مخلوق کی وجہ سے، یا اس کی ذات پر زائد کسی قائم صفت کی وجہ سے، یا کسی خاص نسبت کی وجہ سے، یا اس کے علم کی وجہ سے؟ اور قرآن میں اعجاز کا محل کیا ہے؟ کیونکہ یہ ایک عظیم اور محفوظ علم ہے۔ اور اس اصطلام (جڑ سے اکھاڑ پھینکنے) کا علم جو کلام کی مخالفت سے پیدا ہوتا ہے۔\n\nاور بسم اللہ میں موجود اسرار کا علم، اور یہ کہ وہ ان تین اسماء اور ان مخصوص حروف میں کیوں محدود ہوئی، باقی حروف کے بغیر؟ اور آخرت میں اس کا مقام کہاں ہے؟ اور کیا اس کے حروف سے فرشتے پیدا ہوں گے؟ یعنی کیا قیامت کے دن اس کا ہر حرف ایک قائم صورت میں آئے گا، جیسا کہ سورۃ البقرہ اور سورۃ آل عمران آتی ہیں، اور وہ دونوں زہراوان (روشن) ہیں جو اپنے پڑھنے والے کے لیے گواہی دیں گی؟\n\nاور جب قیامت کے دن ان حروف کی صورتیں پائی جائیں گی، تو کیا وہ ان کے رقم (لکھنے) کے اعتبار سے ہوں گی یا ان کے تلفظ کے اعتبار سے، یا دونوں کے اعتبار سے؟ اور ان میں سے مشدد حروف کیا دو صورتیں پیدا کریں گے یا ایک صورت؟ اور جب یہ حروف صورتیں پیدا کریں گے، تو وہ اپنے پڑھنے والے کو کس چیز سے بچائیں گی؟ اور ان کے مقابلے میں اور ان کی حفاظت میں کون ہو گا؟ کیا وہ عین شہادت (گواہی) ہیں؟ اگر وہ شہادت کے لیے ہیں، تو وہ صرف اسی کے لیے گواہی دیں گی جس نے انہیں لکھا یا جس نے ان کا تلفظ کیا، کہ اس نے انہیں لکھا یا ان کا تلفظ کیا؟ حالانکہ کافر نے بھی انہیں لکھا ہے اور منافق نے بھی ان کا تلفظ کیا ہے۔ اور اگر وہ اس ایمان کی گواہی دیتی ہیں جس کا محل قلب ہے، تو وہ نہ تو رقم کی بسم اللہ ہے اور نہ ہی لفظ کی بسم اللہ، اور نفس میں صرف اس کا علم، ایمان اور ارادہ ہے۔\n\nاور اسی طرح زہراوان (البقرہ اور آل عمران) کے بارے میں بھی یہی تقسیم ہو گی، کہ کیا وہ ان کے رقم (لکھنے) کی وجہ سے ہیں، یا ان کے پڑھنے کی وجہ سے، یا صرف ان کے سورت ہونے کی وجہ سے، یا ان کے آیات اور حروف والی ہونے کی وجہ سے؟ اور کیا آیات صورت میں حیوان کی صورت کے اعضاء کی طرح ہیں، یا وہ موصوف کے لیے نفسیاتی صفات کی طرح ہیں نہ کہ اعضاء کی طرح؟ یہ سب اس مقام کے علم میں سے ہے۔\n\nاور گمراہی (الضلال) اور ہدایت (الھدیٰ) کا علم، اور کیا وہ نسبتوں کی طرف لوٹتے ہیں یا موجودہ اعیان (حقیقی وجود) کی طرف؟ اور اگر وہ موجودہ اعیان ہیں، تو کیا وہ مخلوق ہیں یا کچھ اور؟ اور اگر وہ مخلوق ہیں، تو کیا وہ بندوں کی تخلیق میں سے ہیں یا اللہ کی تخلیق میں سے، یا ان میں سے کچھ بندے کی تخلیق میں سے ہیں اور کچھ اللہ کی تخلیق میں سے؟\n\nاور مخلوقات کو ایک دوسرے پر مسلط کرنے کا علم، خواہ وہ معانی میں ہوں یا غیر معانی میں۔ کیونکہ اللہ تعالیٰ نے جب اپنا نام مَلِک (بادشاہ) رکھا، تو اپنی مخلوق کو جنود (لشکر) کا نام دیا۔ اور اگر وہ لشکر ہیں، اور اللہ اور اس کی مخلوق کے سوا کچھ نہیں، تو وہ کس سے لڑتے ہیں؟ یا وہ محض زینت کے لشکر ہیں، نہ کہ لڑنے والے لشکر؟ اگر وہ ایک دوسرے سے لڑتے ہیں، جو کہ حقیقت ہے، تو ان لشکروں میں سے اللہ کے لشکر کون ہیں؟ جو اللہ کے لشکر ہیں، تو اللہ ان کا بادشاہ ہے، تو دوسرے لشکروں کا بادشاہ کون ہے؟ اور یہاں الٰہی اسرار میں ہلاکتیں ہیں۔\n\nاور اس کا علم الٰہی اسماء کے احکام میں موجود نزاع اور تضاد کی طرف لوٹتا ہے، اور ان میں سے موافق اور مخالف بھی ہیں۔ اور اسی طرح ملکی ارواح (فرشتوں کی ارواح) بھی۔\n\nاور روایت ہے کہ ایک شخص جو اپنی جان پر اسراف کرنے والا تھا، توبہ کا ارادہ کیا، اور وہ ایک ایسے گاؤں سے تھا جو سراسر شر تھا، اور وہاں ایک دوسرا گاؤں تھا جو سراسر خیر تھا۔ اس نے اس کی طرف ہجرت کا ارادہ کیا، تو راستے میں ہی اس کی موت آ گئی۔ پس رحمت کے فرشتوں نے، جو اسم الرحمٰن کے لشکر ہیں، اور عذاب کے فرشتوں نے، جو اسم المنتقم کے لشکر ہیں، جھگڑا کیا۔ جب ان دونوں گروہوں کے درمیان، جو الٰہی اسماء کے تقسیم کار ہیں، اس بات پر جھگڑا طویل ہو گیا کہ اسے کون وصول کرے گا، تو اللہ نے ان کی طرف وحی کی کہ دونوں گاؤں کے درمیان فاصلہ ناپو، پس وہ جس کے زیادہ قریب ہو گا، وہ اسی کے اہل میں سے ہو گا۔ انہوں نے دونوں گاؤں کے درمیان فاصلہ ناپا، تو انہوں نے پایا کہ وہ شخص صرف اپنے سینے کے بل سعادت کے گاؤں کی طرف جھکا ہوا تھا۔ پس اس کے لیے سعادت کا حکم دیا گیا، اور رحمت کے فرشتوں نے اسے وصول کر لیا۔\n\nاور یہ معلوم ہے کہ اس نے چلنا صرف اپنے دل میں توبہ کے حصول یا اس کے ارادے کے بعد شروع کیا، اگرچہ وہ اس کی حد نہیں جانتا تھا۔ پس اللہ نے اس میں سے وہ جانا جو جانا۔ اور اس کے گاؤں سے نکلنے کے آغاز سے اس کا ہر قدم ہجرت اور قابل تعریف حرکت تھی۔ اس کے باوجود، حکم مکانی اندازے پر اور مکان پر واقع ہوا۔ تو اس کا سبب کیا ہے؟ اور کائنات میں اس کا اثر کیا ہے؟ اور کیا حاکم کو لوگوں کے درمیان حکم میں دخل ہے، اور وہ قرعہ اندازی (الاستہام) کے ذریعے حکم کرنا ہے؟\n\nاور مشروع اعمال کا علم، کیا مکلف کے ان پر عمل کرنے سے پہلے ان کا وجود ہوتا ہے یا ان کا کوئی وجود نہیں ہوتا بلکہ وہ عین مکلف کا عمل ہیں؟ اور اگر وہ اس کا عمل ہیں، تو صنعت اپنے صانع پر کیسے حکم لگاتی ہے، بغیر نسبت کے حکم کے؟ کیونکہ اس میں اس کا کوئی اثر نہیں ہوتا، سوائے اس کے کہ اس کی طرف سے جو قابل تعریف یا قابل مذمت تعریف منسوب کی جائے۔\n\nاور یہ وارد ہوا ہے کہ ہر انسان اپنے عمل کے بدلے گروی ہے (مرهون بعمله)۔\n\nتو گروی رکھنے والا اور گروی لینے والا کون ہے، جب کہ مکلف عین گروی ہے؟ پس اللہ کا اپنی مخلوق میں حکم کتنا عجیب ہے! اللہ کی قسم، اللہ کو اللہ کے سوا کسی نے نہیں پہچانا۔\n\nاور کیا سعداء (خوش بخت) اور اشقیاء (بد بخت) اسی حکم پر ہیں، یا یہ صرف اشقیاء کے ساتھ خاص ہے، سعداء کے بغیر؟\n\nاور اس شخص کا علم جسے اللہ مخلوق میں سے کسی شفاعت کرنے والے کی شفاعت کے بغیر آگ سے نکالے گا، کیا یہ احسان کے طور پر نکالنا ہو گا تاکہ وہ مقید نہ ہو؟ یا کیا یہ الٰہی اسماء کی شفاعت کے ذریعے ہو گا؟ جیسا کہ اللہ تعالیٰ نے فرمایا: يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمَنِ وَفْدًا (جس دن ہم پرہیزگاروں کو رحمٰن کی طرف مہمان بنا کر جمع کریں گے)۔\n\nاور یہ معلوم ہے کہ جو کسی چیز کے پاس ہو، اسے اس کی طرف جمع نہیں کیا جاتا۔ اور چونکہ پرہیزگاری اور خوف اس حکم سے تھا جس سے پرہیز کیا جاتا ہے، یعنی اسم شدید العقاب (سخت سزا دینے والا) اور السریع الحساب (جلد حساب لینے والا)، تو پرہیزگار ان اسماء الٰہیہ کے حکم میں تھا۔ پس اللہ انہیں قیامت کے دن رحمٰن کی طرف جمع کرے گا، اور ان سے ان دوسرے اسماء کا حکم زائل ہو جائے گا۔ اگر معاملہ اس طرح ہے، تو یہ شفاعت کے ذریعے نکلنا ہو سکتا ہے۔ اور اگر نہیں، تو یہ احسان اور ہبہ کے طور پر نکلنا ہو گا۔\n\nاور ذات حق (Al-Ḥaqq) سے اعراض کرنے کی صورتوں کا علم، حالانکہ سب اس کی گرفت میں ہیں۔\n\nاور اس چیز کا علم جو انسان کو تمام حیوانات، نباتات، جمادات اور فرشتوں سے ممتاز کرتی ہے، جو معرفتوں میں مخلوق ہیں، سوائے انسان کے لطیفے کے، اور یہ کہ وہ تخلیق میں باقی تمام مخلوقات سے مختلف ہے۔\n\nاور کیا انسان میں موجود عقل علوم حاصل کرنے کے لیے پائی گئی ہے یا صرف خواہشات کو دفع کرنے کے لیے؟ اس کا کوئی اور مقصد نہیں ہے۔ یہ مسئلہ سہل بن عبداللہ تستری کے مسائل میں سے ہے، میں نے ان کے علاوہ کسی کو اس کا ذکر کرتے ہوئے نہیں دیکھا، اور یہ ہم تک صرف ان کے ذریعے پہنچی ہے۔\n\nاور اس مقام کے علوم کثرت میں بے شمار ہیں، لہٰذا ہم نے صرف اسی پر اکتفا کیا جو ہم نے ذکر کیا، کیونکہ یہ اس مقام میں باقی ماندہ علوم کے لیے امہات (بنیادی اصول) کی حیثیت رکھتے ہیں۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب سیصد و دهم در معرفت منزل صلصلة (صلصله) روحانی از حضرت موسوی»\n\nرسول خدا (صلی الله علیه و سلم) درباره نزول وحی فرمودند که وحی به صورت صلصلة الجرس (صلصله زنگ) بر ایشان می‌آید و این سخت‌ترین حالت بر من است. راوی می‌گوید: پس از آن، وحی از ایشان قطع می‌شد در حالی که پیشانی‌شان غرق در عرق بود.\n\nهمانا نزول وحی بر انبیا صور مختلفی دارد که سخت‌ترین آن‌ها وحی صلصله (صلصله) است.\n\nشعر:\n> همانا برج‌ها وضع‌هایی مقدر شده‌اند * و آن‌ها منازل ستارگان شهاب‌گون سیارند\n> نظیر آن از وجود سعادت شامل حالش می‌شود * یکی به سوی رستگاری و دیگری به سوی هلاکت است\n> هنگامی که بادها و طوفان‌ها در معرض من قرار گیرند و مرا طلب کنند * از روی محبت تا هر آنچه از ادب خواهم به من ببخشند\n> و ابرها و ارواح آن‌ها را حمل می‌کنند * و رعد از عجم و عرب سخن می‌گوید\n> و برق از انوار پیدایش خود می‌پوشاند * بر تاریکی شب جامه‌ای از طلا\n> و ابرها باران حقایق (حقائق) را می‌ریزند * در خانه‌ای از گِل و هوس‌ها و شعله‌ها\n> و زمین از شکوفایی خود به وجد می‌آید * و باغ در جامه‌های نو و زیبای خود می‌خرامد\n> این است علم حقایق (حقائق)، من جز * علم به خداوند و اسماء و حجاب‌ها نمی‌خواهم\n> چون علم ذات او منزه شد، دانست * که برای رسیدن به او از نزدیک ندا دادم\n> تو آن خدایی هستی که هیچ چیز شبیه او نیست * مگر آنچه در تنزیل و کتاب‌ها آمده است.\n\n### [همانا خداوند ارواح را بر سه مرتبه آفرید]\n\nبدان که خداوند ارواح را بر سه مرتبه آفریده است که چهارمی ندارد: ارواحی که کاری جز تعظیم جناب حق (الحق) ندارند؛ رویی به سوی عالم یا به سوی نفوس خود ندارند. جلال خداوند آن‌ها را واله و شیدا کرده و از خودشان ربوده است، پس آن‌ها در آن حیران و مست‌اند.\n\nو ارواحی که مدبر اجسام طبیعی زمینی هستند، و آن‌ها ارواح انسان‌ها و ارواح حیوانات نزد اهل کشف (الکشف) از هر جسم طبیعی عنصری هستند. زیرا خداوند عز و جل می‌فرماید: «و هیچ چیز نیست مگر اینکه با ستایش او تسبیح می‌گوید» (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ). و رسول خدا (صلی الله علیه و سلم) فرمودند: «هر تر و خشکی که صدای مؤذن به آن می‌رسد، برای او شهادت می‌دهد.» و سنگریزه‌ها در کف دست ایشان (صلی الله علیه و سلم) و در کف دست هر یک از اصحاب که خداوند می‌خواست، تسبیح گفتند.\n\nو درباره کوه احد فرمودند: «این کوهی است که ما را دوست دارد و ما نیز او را دوست داریم.»\n\nپس این اخبار همگی بر حیات هر شیء و معرفت (المعرفة) آن به پروردگارش دلالت دارد، زیرا آسمان و زمین گفتند: «با رغبت آمدیم» (قَالَتَا أَتَيْنَا طَائِعِينَ). و ما این را از طریق کشف (الکشف) می‌دانیم، حتی اگر خبری در این باره نیامده بود. و این ارواح مدبر این اجسام، محدود به آن‌ها هستند و برخی مسخر برخی دیگر شده‌اند به سبب فضیلتی که خداوند به بعضی بر بعضی دیگر داده است، چنانکه عز و جل فرمود: «و برخی از آنان را بر برخی دیگر به درجاتی برتری دادیم تا بعضی از آن‌ها، بعضی دیگر را به خدمت گیرند» (وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِيَتَّخِذَ بَعْضُهُمْ بَعْضًا سُخْرِيًّا).\n\nو ارواح دیگری نیز هستند که مسخر ما شده‌اند و آن‌ها بر طبقات بسیاری هستند؛ از جمله آن‌ها موکلان وحی و القاء، موکلان روزی‌ها، موکلان قبض ارواح، موکلان زنده کردن مردگان، موکلان استغفار و دعا برای مؤمنان، و موکلان غرس کردن در بهشت به عنوان جزای اعمال بندگان.\n\n### [همانا خداوند برای ارواح انسان‌ها آلات طبیعی قرار داد]\n\nپس بدان که خداوند برای ارواح انسان‌ها آلات طبیعی قرار داده است، مانند چشم، گوش، بینی و دهان، و در آن‌ها قوایی نهاده که آن‌ها را شنیدن، دیدن و غیره نامیده است. و برای این قوا دو وجه خلق کرده است: وجهی به سوی محسوسات (عالم شهادت) و وجهی به سوی حضرت خیال. و حضرت خیال را محلی وسیع‌تر از عالم شهادت قرار داده است و در آن قوه‌ای به نام خیال نهاده است، علاوه بر قوای بسیاری مانند مصوره (صورت‌ساز)، فکر، حفظ، وهم و عقل و غیره. و به واسطه این قوا، نفس انسانی تمام معلوماتی را که حقایق (حقائق) این قوا به او می‌دهند، درک می‌کند. پس با آن وجهی که بصر (بینایی) به عالم شهادت دارد، تمام محسوسات را درک کرده و آن‌ها را به خیال بالا می‌برد، و پس از آنکه قوه مصوره آن‌ها را صورت بخشید، قوه حافظه آن‌ها را در خیال حفظ می‌کند. و گاهی قوه مصوره اموری را از موجودات مختلف که همگی محسوس‌اند، می‌گیرد و از آن‌ها شکلی غریب ترکیب می‌کند که هرگز مجموع آن را به حس ندیده است، اما هیچ جزئی از آن نیست مگر اینکه آن را دیده باشد.\n\nپس هنگامی که انسان می‌خوابد، بصر با آن وجهی که به عالم خیال دارد، نظر می‌کند و آنچه در آن است را می‌بیند؛ خواه آنچه حس به صورت مجموع منتقل کرده باشد، یا آنچه قوه مصوره صورت بخشیده و حس هرگز بر مجموع آن واقع نشده، بلکه بر اجزایی که این صورت از آن‌ها تألیف شده، واقع شده است. پس او را می‌بینی که در کنار تو خوابیده است، در حالی که خود را معذب یا متنعم، یا تاجر، یا پادشاه، یا مسافر می‌بیند. و در خوابش در عالم خیال، ترسی بر او عارض می‌شود و فریاد می‌زند و شیون می‌کند، در حالی که کسی که در کنار اوست، از آن و از حال او بی‌خبر است. و چه بسا اگر امر شدید شود، مزاج او تغییر کند و در صورت ظاهریِ خوابیده، تأثیری چون حرکت، شیون، کلام یا احتلام بگذارد. همه این‌ها ناشی از غلبه آن قوه بر روح حیوانی است که در نتیجه آن، بدن در صورت خود تغییر می‌کند.\n\nپس هنگامی که فرشتگان مسخر به وحی بر انبیا (علیهم السلام) نازل می‌شوند، یا رقیقه‌هایی از آن بر قلب اولیا نازل می‌گردد (زیرا فرشته هرگز با وحی بر قلب غیر نبی نازل نمی‌شود، و نه با امر الهی به صورت کلی)، چرا که شریعت مستقر شده و فرض، واجب، مستحب، مباح و مکروه تبیین گشته است. بنابراین، امر الهی با انقطاع نبوت و رسالت قطع شد. به همین دلیل، رسول خدا (صلی الله علیه و سلم) تنها به انقطاع رسالت اکتفا نکردند تا توهم نشود که نبوت در امت باقی است. پس ایشان (علیه السلام) فرمودند: «همانا نبوت و رسالت قطع شده است، پس نه پیامبری بعد از من هست و نه رسولی.»\n\nپس هیچ کس از خلق خدا باقی نمانده است که خداوند او را به امری فرمان دهد که شرعی باشد و او به آن تعبد کند. زیرا اگر او را به فرضی امر کند، شارع (پیامبر) پیش از این او را به آن امر کرده است، پس امر از آنِ شارع است. و این توهمی از جانب او و ادعای نبوتی است که قطع شده است. اگر بگوید: «فقط او را به مباح امر می‌کند»، می‌گوییم: این امر خالی از دو حالت نیست؛ یا آن مباح در حق او واجب می‌شود، که این عین نسخ شریعتی است که بر آن است، زیرا با این وحی، مباحی را که رسول (صلی الله علیه و سلم) مباح قرار داده بود، واجب می‌سازد که با ترک آن معصیت می‌شود. و اگر آن را مباح بگذارد، همان‌گونه که بود، پس چه فایده‌ای در امری است که این فرشته برای این مدعیِ صاحب این مقام آورده است؟ اگر بگوید: «فرشته‌ای نیاورده، بلکه خداوند بدون واسطه به من امر کرده است»، می‌گوییم: این از آن هم بزرگ‌تر است، زیرا تو ادعا کرده‌ای که خداوند با تو سخن می‌گوید، چنانکه با موسی (علیه السلام) سخن گفت. و هیچ کس، نه از علمای رسوم و نه از علمای اهل ذوق، قائل به این نیست. سپس، اگر با تو سخن می‌گفت یا به تو می‌فرمود، در کلام خود جز علوم و اخبار به تو القا نمی‌کرد، نه احکام و نه شریعت، و اصلاً به تو امر نمی‌کرد. زیرا اگر به تو امر می‌کرد، حکم همان می‌شد که درباره وحی فرشته گفتیم.\n\nپس اگر آنچه بر آن اصرار می‌ورزی، عبارت از این باشد که خداوند در قلب تو علمی را درباره امری خلق کرده است، در این صورت در هر نفسی جز خلق علم در هر انسانی که مختص به اوست، چیزی نیست، و این برای ولی از غیر اوست. و ما در این کتاب و کتب دیگر بیان کرده‌ایم که امر بر چه منوال است و به طور کلی منع کرده‌ایم که خداوند کسی را به شریعتی امر کند که او به آن در نفس خود تعبد کند یا او را با آن به سوی دیگری بفرستد. و ما منع نمی‌کنیم که حق (الحق) او را بر وجهی که ما و اهل طریقت ما مقرر کرده‌ایم، به شریعتی که به واسطه زبان رسول (علیه السلام) به آن تعبد کرده است، آگاه سازد؛ بدون آنکه عالمی از علمای رسوم او را به آن آگاه کند، بلکه به واسطه مبشراتی که از آثار نبوت برای ما باقی مانده است، و آن رؤیایی است که مرد مسلمان می‌بیند یا برای او دیده می‌شود، و آن حق و وحی است. و در آن خواب شرط نیست، بلکه ممکن است در خواب یا در غیر خواب باشد. و در هر حالتی که باشد، آن رؤیا در خیال (الخیال) به واسطه حس است، نه در حس. و متخیل ممکن است از درون در قوه باشد، یا از بیرون به واسطه تمثل روحانی یا تجلی (التجلی) که نزد قوم معروف است. اما اگر مزاج مستقیم و مهیا برای حق (الحق) باشد، آن خیال حقیقی است.\n\nپس هنگامی که فرشته بر پیامبر (علیه السلام) با حکمی یا با علم خبری وارد می‌شود (اگرچه همه از قبیل خبر است) و روح انسانی آن صورت را ملاقات می‌کند و این با گوش دادن و آن با القاء تلاقی می‌یابند، و هر دو نور هستند، مزاج تند و شعله‌ور می‌شود و حرارت غریزی مزاجی در آن دو نور تقویت شده و کمیت آن افزایش می‌یابد. پس چهره شخص به همین دلیل تغییر می‌کند، و این همان است که به حال تعبیر می‌شود و شدیدترین حالت است. و رطوبت‌های بدنی به صورت بخارات به سطح کره بدن صعود می‌کنند به دلیل غلبه حرارت، و از این رو عرقی بر صاحبان این احوال عارض می‌شود، به سبب فشردگی که میان طبایع از برخورد دو روح حاصل می‌گردد. و به دلیل قوت هوای گرمی که با رطوبت‌ها از بدن خارج می‌شود، منافذ را می‌پوشاند و هوای سرد از بیرون به آن نفوذ نمی‌کند. پس هنگامی که از پیامبر و صاحب حال رفع می‌شود و فرشته از پیامبر و رقیقه روحانی از ولی منصرف می‌گردد، مزاج آرام می‌گیرد و آن حرارت فروکش می‌کند و منافذ باز می‌شوند و جسم هوای سرد را از بیرون می‌پذیرد و در جسم نفوذ می‌کند، پس مزاج سرد می‌شود و کمیت سردی افزایش یافته و بر حرارت غلبه می‌کند و آن را تضعیف می‌نماید. پس آن، همان سردی است که صاحب حال احساس می‌کند و به همین دلیل لرزه بر او عارض می‌شود و لباس بر او می‌افزایند تا گرم شود. سپس بعد از آن، از آنچه در آن بشارت (اگر ولی باشد) یا در آن وحی (اگر نبی باشد) برایش حاصل شده، خبر می‌دهد.\n\nو این همه هنگامی است که تنزیل بر قلب با صفت روحانی باشد. اما اگر نفث (دمیدن) باشد، آن الهام است و این برای ولی و نبی رخ می‌دهد. و اگر سخنی گفته شود و بشنود بدون رؤیت، او محدَّث است. و اما اگر فرشته بر او ظاهر شود (اگر نبی باشد در زمان وجود نبوت) یا رقیقه به صورت مردی متمثل یا صورت حیوانی بر او ظاهر شود که با او به آنچه آورده است، سخن گوید؛ اگر ولی باشد، آن را بر کتاب و سنت عرضه می‌کند. اگر موافق بود، آن را خطاب حق (الحق) و تشریف می‌بیند و نه چیز دیگر؛ نه افزایش حکم و نه احداث حکم. اما ممکن است بیان حکمی باشد یا اعلامی به آنچه امر بر آن است، که در نتیجه آنچه مظنون بود، نزد او معلوم می‌گردد. و اگر با کتاب و سنت موافق نبود، آن را خطاب حق (الحق) و ابتلایی می‌بیند که چاره‌ای از آن نیست. پس قطعاً می‌داند که آن رقیقه، نه رقیقه فرشته است و نه تجلی (التجلی) الهی، بلکه رقیقه شیطانی است؛ زیرا فرشتگان چنین مقامی ندارند و والاتر از آن هستند. و بیشتر این حالت بر اهل سماع از حق (الحق) در خلق عارض می‌شود.\n\nپس برای اولیا امروز پس از برداشته شدن نبوت، جز تعریف (آگاه‌سازی) باقی نمانده است و درهای اوامر و نواهی الهی بسته شده است. پس هر کس بعد از محمد (صلی الله علیه و سلم) ادعای آن را کند، مدعی شریعتی است که به او وحی شده است، خواه با شریعت ما موافق باشد یا مخالف. اما در غیر زمان ما، پیش از رسول خدا (صلی الله علیه و سلم)، محدودیتی نبود. به همین دلیل، بنده صالح، خضر، گفت: «و آن را به رأی خود انجام ندادم» (وَمَا فَعَلْتُهُ عَنْ أَمْرِي). زیرا زمان او این اجازه را می‌داد و او بر شریعتی از جانب پروردگارش بود. و حق (الحق) نزد موسی و نزد ما به این امر برای او شهادت داد و او را تزکیه کرد. اما امروز، الیاس و خضر بر شریعت محمد (صلی الله علیه و سلم) هستند، یا به حکم توافق یا به حکم تبعیت. و در هر حال، این امر برای آن‌ها جز از طریق تعریف (آگاه‌سازی) نیست، نه از طریق نبوت. و همچنین عیسی (علیه السلام) هنگامی که نازل شود، جز به سنت ما در میان ما حکم نمی‌کند. حق (الحق) او را به این سنت از طریق تعریف آگاه کرده است، نه از طریق نبوت، اگرچه او پیامبر است. پس ای برادران ما، از فریب‌های این موطن برحذر باشید، زیرا تمییز آن بسیار دشوار است و نفوس آن را شیرین می‌یابند و به دلیل عشق ورزیدن به آن، دچار تلبیس (اشتباه) می‌شوند.\n\nو هنگامی که محل به چنین القایی که ذکر کردیم انس بگیرد، تحمل آن بر او آسان می‌شود و آنچه در آن است مانند زمانی نیست که ناگهان بر او وارد شود. و هنگامی که خداوند با وحی سخن می‌گوید، گویی زنجیری بر سنگ صاف است، پس ارواح هنگام شنیدن آن مدهوش می‌شوند. و علمی که در آن صلصله (صلصله) برای آن‌ها حاصل می‌شود، مانند علمی است که از ضربه زدن بین دو کتف حاصل شد، و مانند علمی است که از نگاه کردن حاصل می‌شود، که سؤال و جواب و استفاده علوم بسیاری از صرف یک ضربه یا نگاه است. و ما به حمدالله همه این‌ها را از نفوس خود دیده‌ایم و در آن شک نداریم. و آن را جز به درهای بسته تشبیه نمی‌کنم؛ پس هنگامی که درها گشوده شوند و آنچه پشت آن‌هاست بر تو تجلی (التجلی) کند، با یک نظر به آن علم پیدا می‌کنی، چنانکه انسان در یک لحظه چشم خود را باز می‌کند و از زمین تا فلک بروج را درک می‌نماید. سپس آنچه صاحب این امر از برف سردی یقین می‌یابد، قدرش قابل اندازه‌گیری نیست. و به خاطر آن حرارتی که گفتیم هنگام القاء وجود دارد، رسول خدا (صلی الله علیه و سلم) هنگام شروع هر نماز و در بیشتر احوال می‌فرمودند: «خداوندا، مرا با برف و آب سرد و تگرگ بشوی.» پس این سه، همگی سردی‌آور هستند تا با حرارت وحی مقابله کند، زیرا وحی سوزاننده است و اگر نیرویی که از این سردی برای قلب حاصل می‌شود نبود، هلاک می‌شد.\n\n### [علم احوال آخرت به ویژه از جهت شدایدی که در بر دارد]\n\nو بدان که این منزل از علوم، شامل علم الیقین، علم حجاب، علم وعید، علم کبریاء (بزرگی) کونی که منوط به حق (الحق) است، علم تقدیس، و علم سببی است که مخلوقات به خاطر آن، اربابانی جز خداوند گرفتند. و چرا خداوند فرمود: «اربابانی جز خدا» (أَرْبَابًا مِنْ دُونِ اللَّهِ)، در حالی که آن‌ها آن اربابان را همراه با خدا گرفتند. و علم آنچه از ربا حلال می‌شود، و علم ایثار حق (الحق)، و اینکه آیا این امر با اعتقاد تو به اینکه فاعلی جز خداوند نیست، صحیح است؟ پس بر چه کسی ایثار می‌کند؟ و علم احدیت نفخه (دمیدن) و اختلاف اثر آن، و اینکه چرا اشتعال در آتش با دمیدن است و چرا چراغ با آن خاموش می‌شود، و چرا هوا به دلیل لطافتش برای اشتعال نزدیک‌تر از هیزم و زغال است. و علم احوال آخرت به ویژه از جهت شدایدی که در بر دارد، و علم معارضه‌ای که حلاج قصد کرد تا جایی که عمرو بن عثمان بر او دعا کرد، و هنگامی که آنچه بر او رفت، مشایخ می‌گفتند: حلاج تنها به سبب دعای شیخ آسیب دید. و علم سحر حقیقی و غیر حقیقی، و اینکه آیا در هر دو حالت خیال است یا نه. و علم اینکه چرا وجود کلام برای باری (خالق) به خلق او باز می‌گردد، یا به صفتی قائم به او که زائد بر ذات اوست، یا به نسبتی خاص، یا به علم او. و محل اعجاز قرآن چیست؟ زیرا این علمی عظیم و دست‌نیافتنی است. و علم اصطلام (ربوده شدن) که معارضه کلام آن را نتیجه می‌دهد. و علم اسراری که بسمله (بسم الله الرحمن الرحیم) در بر دارد، و اینکه چرا در این سه اسم و این حروف مخصوص، نه سایر حروف، محصور شده است. و جایگاه آن در آخرت کجاست؟ و آیا از حروف آن فرشتگانی خلق می‌شوند؟ یعنی آیا هر حرفی از آن در روز قیامت به صورت قائم می‌آید، همان‌گونه که سوره بقره و سوره آل عمران می‌آیند، در حالی که آن‌ها دو نورانی (الزهراوان) هستند و برای قاری خود شهادت می‌دهند؟ و اگر صورت‌های این حروف در روز قیامت یافت شوند، آیا از جهت نگاشتن آن‌هاست یا از جهت تلفظ به آن‌ها، یا از هر دو؟ و آیا حروف مشدد از آن‌ها دو صورت خلق می‌کنند یا یک صورت؟ و اگر این حروف صورت‌هایی خلق کنند، قاری خود را از چه چیزی حفظ می‌کنند؟ و چه کسی در مقابل آن و حفظ آن قرار دارد؟ آیا آن عین شهادت است؟ اگر برای شهادت باشد، جز برای کسی که آن را نگاشته یا کسی که به آن تلفظ کرده، شهادت نمی‌دهد که او آن را نگاشته یا تلفظ کرده است، در حالی که کافر آن را نگاشته و منافق به آن تلفظ کرده است. و اگر به ایمان به آن شهادت دهد که محلش قلب است، پس آن نه بسمله نگاشته شده است و نه بسمله لفظی، و در نفس جز علم به آن و ایمان و اراده آن نیست. و همچنین امر بر این تقسیم در مورد دو سوره نورانی (الزهراوان) نیز جاری است: آیا از جهت نگاشتن آن‌هاست یا خواندن آن‌ها، یا از جهت اینکه فقط سوره هستند، یا از جهت اینکه دارای آیات و حروف هستند؟ و آیا آیات در صورت مانند اعضای صورت حیوان هستند، یا برای آن مانند صفات نفسانی برای موصوف هستند، نه مانند اعضا؟\n\nهمه این‌ها از علم این منزل است. و علم ضلالت و هدایت، و اینکه آیا به نسبت‌ها باز می‌گردند یا به اعیان موجود؟ و اگر اعیان موجود باشند، آیا مخلوق‌اند یا غیر آن؟ و اگر مخلوق باشند، آیا از خلق بندگان هستند یا از خلق خداوند، یا برخی از خلق بنده و برخی از خلق خداوند؟ و علم مسلط کردن مخلوقات بر یکدیگر، از معانی و غیر معانی. زیرا خداوند متعال هنگامی که خود را مَلِک (پادشاه) نامید، خلق خود را لشکریان نامید. و اگر آن‌ها لشکریان هستند و جز خداوند و خلق او چیزی نیست، پس با چه کسی می‌جنگند؟ یا آن‌ها لشکریان زینت هستند نه لشکریان جنگی؟ پس اگر برخی با برخی دیگر بجنگند، که این واقع می‌شود، کدام یک از این لشکریان، لشکریان خداوند هستند؟ کسانی که لشکریان خداوند هستند، خداوند پادشاه آن‌هاست، پس پادشاه لشکریان دیگر کیست؟ و در اینجا از اسرار الهی، مهلکه‌ها (مواضع خطر) وجود دارد. و علم آن به منازعه و تضادی که در احکام اسماء الهی وجود دارد، باز می‌گردد، که برخی موافق و برخی مخالف‌اند. و همچنین ارواح ملکیه (فرشتگان).\n\nو روایت شده است که مردی از کسانی که بر نفس خود اسراف کرده بود، قصد توبه کرد. او از روستایی بود که تماماً شر بود، و روستای دیگری بود که تماماً خیر بود. پس قصد هجرت به آنجا را کرد. در حالی که در راه بود، اجلش فرا رسید و مرد. پس فرشتگان رحمت که لشکریان اسم رحیم هستند، و فرشتگان عذاب که لشکریان اسم منتقم هستند، با هم به نزاع پرداختند. هنگامی که نزاع میان آن‌ها بر سر اینکه کدام یک از این دو طایفه که توزیع‌کنندگان اسماء الهی هستند، او را تحویل بگیرد، طولانی شد، خداوند به آن‌ها وحی کرد که فاصله میان دو روستا را اندازه بگیرید؛ به هر کدام نزدیک‌تر بود، از اهل آن خواهد بود. پس فاصله میان دو روستا را اندازه گرفتند و دریافتند که مرد فقط با سینه‌اش به سوی روستای سعادت متمایل شده است. پس به سعادت او حکم شد و فرشتگان رحمت او را تحویل گرفتند. و معلوم است که او راه نپیمود مگر پس از حصول توبه در قلبش یا اراده آن، اگر حد آن را نمی‌دانست. پس خداوند از آن، آنچه را که می‌دانست، دانست. و هر قدمی که از ابتدای خروج از روستایش برداشت، هجرت و حرکتی پسندیده بود. با این حال، حکم بر اساس تقدیر مکانی و مکان واقع شد. پس سبب آن چیست و اثر آن در هستی (الوجود) چیست؟ و آیا حاکم در حکم کردن میان مردم، که همان حکم به استهام (قرعه) است، دخالتی دارد؟\n\nو علم اعمال مشروع؛ آیا آن‌ها قبل از اینکه مکلف آن‌ها را انجام دهد، وجود دارند یا وجود ندارند، بلکه عین عمل مکلف هستند؟ و اگر عمل او باشند، چگونه مصنوع بر صانع خود حکم می‌کند، بدون حکم نسبت؟ زیرا اثری در آن نیست مگر به آنچه از ستایش پسندیده یا نکوهیده به او نسبت داده می‌شود. و وارد شده است که هر انسانی در گرو عمل خویش است. پس اگر مکلف عین رهن باشد، راهن (گروگیرنده) و مرتهن (گروگذار) کیست؟ پس حکم خداوند در خلقش چقدر شگفت‌انگیز است! به خدا سوگند، خداوند را جز خداوند نشناخت. و آیا سعادتمندان و شقاوتمندان بر این حکم هستند، یا این حکم مختص شقاوتمندان است نه سعادتمندان؟ و علم کسی که خداوند او را بدون شفاعت هیچ شفاعت‌کننده‌ای از مخلوقات از آتش خارج می‌کند؛ آیا این خروج از روی امتنان است تا مقید نشود، یا از شفاعت اسماء الهی است؟ چنانکه تعالی فرمود: «روزی که پرهیزگاران را به سوی [خدای] رحمان، گروه گروه محشور می‌کنیم» (يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمَنِ وَفْدًا). و معلوم است کسی که نزد آن شیء باشد، به سوی آن محشور نمی‌شود. و چون پرهیز و ترس از حکم آن چیزی بود که از آن پرهیز می‌شد، یعنی اسم شدید العقاب و سریع الحساب، پس پرهیزکار در حکم امثال این اسماء الهی بود. پس خداوند آن‌ها را در روز قیامت به سوی رحمان محشور کرد و حکم آن اسماء دیگر از آن‌ها زائل شد. اگر امر بر این منوال باشد، پس ممکن است خروج شفاعت باشد، و اگر نباشد، خروج امتنان و بخشش است.\n\nو علم صورت‌های رویگردانی از حق (الحق)، در حالی که همه در قبضه اوست. و علم آنچه انسان به واسطه آن از سایر حیوانات، نباتات، جمادات و فرشتگان متمایز می‌شود؛ همه در معارف خلق شده‌اند، مگر لطیفه انسان، و آن در خلقت با سایر مخلوقات تفاوت دارد. و آیا عقلی که در انسان است، برای کسب علوم به وجود آمده است یا فقط برای دفع هوی و هوس، و کار دیگری ندارد؟ و این مسئله از مسائل سهل بن عبدالله تستری است؛ کسی جز او را ندیده‌ام که آن را ذکر کرده باشد و جز از طریق او به ما نرسیده است. و علوم این منزل از کثرت قابل شمارش نیستند، پس ما به آنچه ذکر کردیم اکتفا نمودیم، زیرا این‌ها مانند اصول و مادران برای سایر علوم باقی‌مانده در این منزل هستند. و خداوند حق (الحق) را می‌گوید و او به راه هدایت می‌کند (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 5
}