{
  "id": 430,
  "title": {
    "ar": "الباب الثلاثون وأربعمائة في معرفة منازلة أن حيرتك أوصلتك إلى",
    "en": "Chapter Four Hundred and Thirty: Concerning the Gnosis of the Station where Your Bewilderment Has Led You.",
    "ur": "باب چار سو تیس: اس منزل کی معرفت (Ma'rifa) کے بیان میں کہ تیری حیرت (Hayra) تجھے (مطلوب تک) پہنچا چکی ہے",
    "fa": "باب چهارصد و سی‌ام در معرفت منازل [که] حیرت تو را به آن رسانده است"
  },
  "content": {
    "ar": "## «الباب الثلاثون وأربعمائة في معرفة منازلة أن حيرتك أوصلتك إلى»\n\n\n> كل من حار وصل *** والذي اهتدى انفصل‏\n\n\n> وهو نعت ثابت *** للذي عز وجل‏\n\n\n> وهو نعت حاصل *** لعبيد قد عقل‏\n\n\n> فإذا قال فتى *** إنه اهتدى غفل‏\n> وتراه زاهيا *** في حلي وحلل‏\n\n\n> كاشفا عورته *** مثل ما جاء المثل‏\n\n\n### [الوصول إلى الحيرة في الحق هو عين الوصول إلى الله‏]\n\n\nقوله عليه الصلاة والسلام رب كاسية عارية\n\n\nقال الله تعالى في الحيرة وما كانَ الله لِيُضِلَّ قَوْماً بَعْدَ إِذْ هَداهُمْ حَتَّى يُبَيِّنَ لَهُمْ ما يَتَّقُونَ ومن باب الحيرة والله خَلَقَكُمْ وما تَعْمَلُونَ وما رَمَيْتَ إِذْ رَمَيْتَ وكذلك فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ والقتل ما شوهد إلا من المخلوق فنفى ما وقع به العلم الضروري في الحس‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في هذه المنازلة لا أحصي ثناء عليك‏\n\n\nوهذا مقام عزة الحيرة\n\n\nأنت كما أثنيت على نفسك‏\n\n\nوهذا حال الوصول وقال الصديق في هذه المنازلة العجز عن درك الإدراك إدراك فتحير فوصل فالوصول إلى الحيرة في الحق هو عين الوصول إلى الله والحيرة أعظم ما تكون لأهل التجلي لاختلاف الصور عليهم في العين الواحدة والحدود تختلف باختلاف الصور والعين لا يأخذها حد ولا تشهد كما أنها لا تعلم فمن وقف مع الحدود التابعة للصور حار ومن علم إن ثم عينا هي التي تتقلب في الصور في أعين الناظرين ولا في نفسها علم إن ثم ذاتا مجهولة لا تعلم ولا تشهد فتحصل من هذا\n\n\n### [أن العلماء على أربعة أصناف‏]\n\n\nأن العلماء بالله أربعة أصناف صنف ما له علم بالله إلا من طريق النظر الفكري وهم القائلون بالسلوب وصنف ما له علم بالله إلا من طريق التجلي وهم القائلون بالثبوت والحدود وصنف ثالث يحدث لهم علم بالله بين الشهود والنظر فلا يبقون مع الصور في التجلي ولا يصلون إلى معرفة الذات الظاهرة بهذه الصور في أعين الناظرين والصنف الرابع ليس واحدا من هؤلاء الثلاثة ولا يخرج عن جميعهم وهو الذي يعلم أن الله قابل لكل معتقد كان ما كان ذلك المعتقد وهذا الصنف ينقسم إلى صنفين صنف يقول عين الحق هو المتجلي في صور الممكنات وصنف آخر يقول أحكام الممكنات وهي الصور الظاهرة في عين الوجود الحق وكل قال ما هو الأمر عليه ومن هنا نشأت الحيرة في المتحيرين وهي عين الهدى في كل حائر فمن وقف مع الحيرة حار ومن وقف مع كون الحيرة هدى وصل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 430: Concerning the Station of Knowing that Your Bewilderment Has Led You To\n\nEveryone who is bewildered attains,\nAnd he who is guided is separated.\n\nIt is a fixed attribute\nFor the One who is Mighty and Majestic,\n\nAnd it is an attribute attained\nBy servants who have understood.\n\nSo if a youth says\nThat he is guided, he is heedless.\n\nAnd you see him radiant\nIn ornaments and fine garments,\n\nExposing his nakedness,\nJust as the proverb came.\n\n### [Attainment of Bewilderment in the Real is the very Essence of Attainment to Allah]\n\nThe saying of the Prophet, peace and blessings be upon him: \"Perhaps a clothed woman is naked.\"\n\nAllah the Exalted spoke concerning bewilderment: <<وَمَا كَانَ اللَّهُ لِيُضِلَّ قَوْمًا بَعْدَ إِذْ هَدَاهُمْ حَتَّى يُبَيِّنَ لَهُمْ مَا يَتَّقُونَ>> (And Allah would not lead a people astray after He has guided them until He makes clear to them what they should guard against).\n\nAnd from the door of bewilderment are the verses: <<وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ>> (And Allah created you and what you do), and <<وَمَا رَمَيْتَ إِذْ رَمَيْتَ>> (And you did not throw when you threw), and likewise <<فَلَمْ تَقْتُلُوهُمْ وَلَكِنَّ اللَّهَ قَتَلَهُمْ>> (So you did not kill them, but Allah killed them). The killing was only witnessed from the creature, yet He negated what was established by necessary sensory knowledge.\n\nThe Messenger of Allah, peace and blessings be upon him, said concerning this station: \"I cannot enumerate Your praise.\"\n\nThis is the station of the might of Bewilderment (الحيرة).\n\n\"You are as You have praised Yourself.\"\n\nThis is the state of Attainment (الوصول). Al-Siddiq [Abu Bakr] said concerning this station: \"Inability to attain comprehension is comprehension.\" So he was bewildered, and thus he attained.\n\nTherefore, the attainment of bewilderment in the Real (الحق) is the very essence of attainment to Allah. Bewilderment is greatest for the People of Theophany (أهل التجلي) due to the variation of forms (الصور) appearing to them in the single Essence (العين الواحدة). The definitions (الحدود) vary according to the variation of the forms, but the Essence (العين) is not encompassed by a definition, nor is it witnessed, just as it is not known.\n\nSo whoever stops at the definitions that follow the forms is bewildered. But whoever knows that there is an Essence which transforms in the forms—in the eyes of the beholders, but not in itself—knows that there is an unknown Essence (ذات مجهولة) that is neither known nor witnessed. From this, it is concluded:\n\n### [That the Gnostics are of Four Categories]\n\nThat the Gnostics of Allah (العلماء بالله) are of four categories (أصناف):\n\n1.  A category whose Knowledge (العلم) of Allah is only through intellectual speculation (النظر الفكري), and they are those who affirm negation (القائلون بالسلوب) [defining God by what He is not].\n2.  And a category whose Knowledge of Allah is only through Theophany (التجلي), and they are those who affirm affirmation and definitions (القائلون بالثبوت والحدود).\n3.  And a third category, for whom Knowledge of Allah arises between witnessing (الشهود) and speculation (النظر). They neither remain with the forms in the Theophany, nor do they attain the Gnosis (معرفة) of the Essence (الذات) that manifests through these forms in the eyes of the beholders.\n4.  And the fourth category is not one of these three, yet it does not exclude any of them. This is the one who knows that Allah accepts every belief, whatever that belief may be.\n\nThis category is divided into two sub-categories:\n\n1.  One sub-category says that the very Essence of the Real (عين الحق) is the one manifesting (المتجلي) in the forms of the contingent things (الممكنات).\n2.  And another sub-category says that the determinations of the contingent things (أحكام الممكنات)—which are the forms manifesting in the Essence of Real Existence (عين الوجود الحق)—[are the reality].\n\nAnd each has stated what the matter truly is.\n\nAnd from this arose the bewilderment (الحيرة) in the bewildered, and it is the very essence of guidance (الهدى) in every bewildered one. So whoever stops at bewilderment remains bewildered, and whoever stops at the fact that bewilderment is guidance attains [union].\n\n<<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب چار سو تیس: اس مقام کی معرفت میں کہ تیری حیرت نے تجھے (حق تک) پہنچا دیا\n\nجو بھی حیران ہوا، وہ پہنچ گیا\nاور جو ہدایت پا گیا، وہ جدا ہو گیا\n\nاور یہ ایک ثابت صفت ہے\nاس ذات کے لیے جو عزت اور جلال والی ہے\n\nاور یہ ایک حاصل شدہ صفت ہے\nان بندوں کے لیے جنہوں نے عقل کی\n\nپس جب کوئی جوان کہے\nکہ وہ ہدایت پا گیا، تو وہ غافل ہو گیا\n\nاور تو اسے دیکھے گا کہ وہ چمک رہا ہے\nزیوروں اور لباسوں میں\n\nاپنی شرمگاہ کو کھولے ہوئے\nجیسا کہ مثال آئی ہے\n\n[حق (الحق) میں حیرت تک پہنچنا ہی عین اللہ تک پہنچنا ہے]\n\nآپ صلی اللہ علیہ وسلم کا فرمان ہے: بہت سی لباس پہننے والیاں ننگی ہوں گی۔\n\nاللہ تعالیٰ نے حیرت (الحیرۃ) کے بارے میں فرمایا: \"اور اللہ کی یہ شان نہیں کہ کسی قوم کو ہدایت دینے کے بعد گمراہ کر دے جب تک کہ ان کے لیے وہ چیزیں واضح نہ کر دے جن سے انہیں پرہیز کرنا چاہیے\" (وَمَا كَانَ اللَّهُ لِيُضِلَّ قَوْمًا بَعْدَ إِذْ هَدَاهُمْ حَتَّىٰ يُبَيِّنَ لَهُم مَّا يَتَّقُونَ)۔ اور حیرت (الحیرۃ) کے باب سے ہے: \"حالانکہ اللہ نے تمہیں اور تمہارے اعمال کو پیدا کیا\" (وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ)۔ اور \"جب تم نے پھینکا تو تم نے نہیں پھینکا\" (وَمَا رَمَيْتَ إِذْ رَمَيْتَ)۔ اور اسی طرح \"تم نے انہیں قتل نہیں کیا بلکہ اللہ نے انہیں قتل کیا\" (فَلَمْ تَقْتُلُوهُمْ وَلَٰكِنَّ اللَّهَ قَتَلَهُمْ)۔ حالانکہ قتل مخلوق کے سوا کسی سے مشاہدہ نہیں ہوا، پس (اللہ نے) اس چیز کی نفی کر دی جس پر حسی (حس) میں علم ضروری واقع ہوا تھا۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے اس مقام (منازلۃ) کے بارے میں فرمایا: \"میں آپ کی ثنا کا احاطہ نہیں کر سکتا۔\"\n\nاور یہ حیرت (الحیرۃ) کی عزت کا مقام ہے۔\n\nآپ ویسے ہی ہیں جیسے آپ نے اپنی ثنا خود کی۔\n\nاور یہ وصول (الوصول) کی حالت ہے۔ اور صدیق (ابوبکر رضی اللہ عنہ) نے اس مقام (منازلۃ) کے بارے میں فرمایا: \"ادراک (الإدراک) کے ادراک سے عاجز ہونا ہی ادراک ہے۔\" پس وہ حیران ہوا تو پہنچ گیا۔ پس حق (الحق) میں حیرت (الحیرۃ) تک پہنچنا ہی عین اللہ تک پہنچنا ہے۔ اور حیرت (الحیرۃ) اہل تجلی (التجلی) کے لیے سب سے بڑی ہوتی ہے، کیونکہ ایک ہی عین (العین) میں ان پر صورتوں (الصور) کا اختلاف ہوتا ہے۔ اور حدود (الحدود) صورتوں کے اختلاف سے مختلف ہوتی ہیں، جبکہ عین (العین) کو کوئی حد نہیں پکڑتی اور نہ ہی اس کا شہود (الشہود) ہوتا ہے، جیسا کہ وہ معلوم نہیں ہوتی۔ پس جو شخص صورتوں (الصور) کی تابع حدود (الحدود) کے ساتھ ٹھہر گیا، وہ حیران ہو گیا۔ اور جس نے یہ جان لیا کہ وہاں ایک عین (العین) ہے جو دیکھنے والوں کی آنکھوں میں صورتوں (الصور) میں پلٹتی ہے، نہ کہ خود اپنے اندر، تو اس نے جان لیا کہ وہاں ایک ذات (الذات) مجهولہ ہے جو نہ معلوم ہوتی ہے اور نہ ہی اس کا شہود (الشہود) ہوتا ہے۔ اس سے یہ نتیجہ نکلا:\n\n[کہ علماء چار اقسام پر ہیں]\n\nکہ اللہ کے علماء چار اقسام کے ہیں۔ ایک قسم وہ ہے جسے اللہ کا علم صرف نظری فکری (النظر الفکری) کے ذریعے حاصل ہوا، اور یہ وہ ہیں جو سلوب (السُلوب) کے قائل ہیں۔ اور ایک قسم وہ ہے جسے اللہ کا علم صرف تجلی (التجلی) کے ذریعے حاصل ہوا، اور یہ وہ ہیں جو ثبوت (الثبوت) اور حدود (الحدود) کے قائل ہیں۔ اور تیسری قسم وہ ہے جن کے لیے اللہ کا علم شہود (الشہود) اور نظر (النظر) کے درمیان پیدا ہوتا ہے، پس وہ تجلی (التجلی) میں صورتوں (الصور) کے ساتھ باقی نہیں رہتے اور نہ ہی وہ اس ذات (الذات) کی معرفت (المعرفۃ) تک پہنچتے ہیں جو دیکھنے والوں کی آنکھوں میں ان صورتوں کے ذریعے ظاہر ہوتی ہے۔ اور چوتھی قسم ان تینوں میں سے کوئی ایک نہیں ہے اور نہ ہی وہ ان سب سے باہر ہے۔ اور یہ وہ ہے جو جانتا ہے کہ اللہ ہر عقیدے کو قبول کرنے والا ہے، وہ عقیدہ جیسا بھی ہو۔ اور یہ قسم مزید دو اقسام میں تقسیم ہوتی ہے: ایک قسم جو کہتی ہے کہ عین حق (عین الحق) ہی ممکنات (الممکنات) کی صورتوں (الصور) میں متجلی (المتجلی) ہے۔ اور دوسری قسم جو کہتی ہے کہ ممکنات کے احکام ہی وہ صورتیں ہیں جو عین الوجود الحق (عین الوجود الحق) میں ظاہر ہیں۔ اور ہر ایک نے وہی کہا جس پر معاملہ ہے۔ اور یہیں سے حیران ہونے والوں میں حیرت (الحیرۃ) پیدا ہوئی۔ اور یہی ہر حیران شخص میں عین ہدایت ہے۔ پس جو حیرت (الحیرۃ) کے ساتھ ٹھہر گیا، وہ حیران رہا، اور جو اس بات کے ساتھ ٹھہرا کہ حیرت ہدایت ہے، وہ پہنچ گیا۔ اور \"اللہ حق فرماتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و سی‌ام در معرفت منزلتی که حیرت تو را به آن رسانده است.\n\nهر کس که حیران شد، واصل گشت *** و آنکه هدایت یافت، جدا شد.\nو این صفتی ثابت است *** برای آنکه عزیز و جلیل است.\nو این صفتی است که حاصل می‌شود *** برای بندگانی که تعقل کرده‌اند.\nپس اگر جوانی بگوید *** که هدایت یافته، غافل شده است.\nو او را می‌بینی که در زیور و جامه‌ها *** خودنمایی می‌کند.\nدر حالی که عورت خود را آشکار کرده است *** همان‌گونه که مَثَل آمده است.\n\n[وصول به حیرت در حق (الحق) عین وصول به خداوند است]\n\nسخن پیامبر (صلی الله علیه و آله و سلم): «چه بسا پوشیده‌ای که برهنه است.» (رُبَّ كَاسِيَةٍ عَارِيَةٍ)\n\nخداوند متعال درباره حیرت می‌فرماید: «و خداوند بر آن نیست که قومی را پس از آنکه هدایتشان کرد، گمراه سازد، مگر آنکه آنچه را باید از آن بپرهیزند، برایشان بیان کند.» (وَمَا كَانَ اللَّهُ لِيُضِلَّ قَوْمًا بَعْدَ إِذْ هَدَاهُمْ حَتَّى يُبَيِّنَ لَهُمْ مَا يَتَّقُونَ) و از باب حیرت است (آیات): «و خداوند شما و آنچه را عمل می‌کنید، آفریده است.» (وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ) و «و تو پرتاب نکردی آنگاه که پرتاب کردی.» (وَمَا رَمَيْتَ إِذْ رَمَيْتَ) و همچنین: «شما آنان را نکشتید، بلکه خداوند آنان را کشت.» (فَلَمْ تَقْتُلُوهُمْ وَلَكِنَّ اللَّهَ قَتَلَهُمْ). و حال آنکه قتل جز از مخلوق مشاهده نشد؛ پس آنچه را که علم ضروری در حس به آن حکم می‌کند، نفی نمود.\n\nرسول خدا (صلی الله علیه و آله و سلم) در این منزلت فرمود: «من نمی‌توانم ثنای تو را برشمارم.» (لَا أُحْصِي ثَنَاءً عَلَيْكَ). و این مقام عزت حیرت است. تو همان‌گونه‌ای که خود بر خویشتن ثنا گفتی. و این حال وصول است. و صدیق (ابوبکر) در این منزلت گفت: «ناتوانی از درکِ درک، خود درک است.» پس حیران شد و واصل گشت. بنابراین، وصول به حیرت در حق (الحق) عین وصول به خداوند است. و حیرت برای اهل تجلی (التجلی) به دلیل اختلاف صور بر آنان در عین (العین) واحد، به اوج خود می‌رسد. و حدود (تعاریف) با اختلاف صور، متفاوت می‌شوند، در حالی که عین (العین) را حدی در بر نمی‌گیرد و شهود نمی‌شود، همان‌گونه که دانسته نمی‌شود. پس هر کس که با حدودِ تابعِ صور توقف کند، حیران می‌شود؛ و هر کس بداند که در آنجا عینی (العین) وجود دارد که در صور در دیدگان ناظران (نه در ذات خود) متقلب می‌شود، می‌داند که در آنجا ذاتی مجهول است که نه دانسته می‌شود و نه شهود می‌گردد. از این مطلب حاصل می‌شود که:\n\n[دانشمندان بر چهار دسته‌اند]\n\nدانشمندان به خداوند چهار دسته‌اند: دسته‌ای که علمشان به خداوند جز از طریق نظر فکری نیست، و آنان قائلان به سَلْب (نفی صفات) هستند. و دسته‌ای که علمشان به خداوند جز از طریق تجلی (التجلی) نیست، و آنان قائلان به ثبوت (اثبات صفات) و حدود هستند. و دسته سومی که علم به خداوند برایشان بین شهود (الشهود) و نظر حاصل می‌شود، پس نه با صور در تجلی (التجلی) باقی می‌مانند و نه به معرفت ذات (الذات) که با این صور در دیدگان ناظران ظاهر شده است، می‌رسند. و دسته چهارم هیچ‌یک از این سه نیستند و از همه آن‌ها نیز خارج نمی‌شوند؛ و او کسی است که می‌داند خداوند پذیرای هر اعتقادی است، هر چه که آن اعتقاد باشد. و این صنف خود به دو زیردسته تقسیم می‌شود: زیردسته‌ای که می‌گوید عین حق (الحق) همان است که در صور ممکنات تجلی (التجلی) کرده است؛ و زیردسته دیگری که می‌گوید احکام ممکنات، که همان صور ظاهر شده در عین وجود حق (الوجود الحق) هستند. و هر یک آنچه را که امر بر آن است، بیان کرده است. و از اینجا حیرت در حیرت‌زدگان نشأت گرفته است، و این حیرت عین هدایت در هر حیران‌شونده‌ای است. پس هر کس که با حیرت توقف کند، حیران می‌ماند؛ و هر کس که با این حقیقت توقف کند که حیرت، هدایت است، واصل می‌شود. «و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند.» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}