{
  "id": 11,
  "title": {
    "ar": "الباب الحادي عشر في معرفة آبائنا العلويات وأمهاتنا السفليات",
    "en": "Chapter Eleven: On the Knowledge of Our Celestial Fathers and Our Terrestrial Mothers.",
    "ur": "گیارہواں باب: ہمارے علوی آباء اور سفلی ماؤں کی معرفت میں",
    "fa": "باب یازدهم در معرفت پدران علوی ما و مادران سفلی ما"
  },
  "content": {
    "ar": "## «الباب الحادي عشر في معرفة آبائنا العلويات وأمهاتنا السفليات»\n\n\n> أنا ابن آباء أرواح مطهرة *** وأمهات نفوس عنصريات‏\n\n\n> ما بين روح وجسم كان مظهرنا *** عن اجتماع بتعنيق ولذات‏\n\n\n> ما كنت عن واحد حتى أوحده *** بل عن جماعة آباء وأمات‏\n\n\n> هم للاله إذا حققت شأنهمو *** كصانع صنع الأشياء بآلات‏\n\n\n> فنسبة الصنع للنجار ليس لها *** كذاك أوجدنا رب البريات‏\n\n\n> فيصدق الشخص في توحيد موجدة *** ويصدق الشخص في إثبات علات‏\n\n\n> فإن نظرت إلى الآلات طال بنا *** إسناد عنعنة حتى إلى الذات‏\n\n\n> وإن نظرت إليه وهو يوجدنا *** قلنا بوحدته لا بالجماعات‏\n\n\n> إني ولدت وحيد العين منفردا *** والناس كلهمو أولاد علات‏\n\n\n### [الابوة والامومة والبنوة]\n\n\nاعلم أيدك الله أنه لما كان المقصود من هذا العالم الإنسان وهو الإمام لذلك أضفنا الآباء والأمهات إليه فقلنا آباؤنا العلويات وأمهاتنا السفليات فكل مؤثر أب وكل مؤثر فيه أم هذا هو الضابط لهذا الباب والمتولد بينهما من ذلك الأثر يسمى ابنا ومولدا وكذلك المعاني في إنتاج العلوم إنما هو بمقدمتين تنكح إحداهما الأخرى بالمفرد الواحد الذي يتكرر فيهما وهو الرابط وهو النكاح والنتيجة التي تصدر بينهما هي المطلوبة فالأرواح كلها آباء والطبيعة أم لما كانت محل الاستحالات وتتوجه هذه الأرواح على هذه الأركان التي هي العناصر القابلة للتغيير والاستحالة تظهر فيها المولدات وهي المعادن والنبات والحيوان والجان والإنسان أكملها\n\n\n### [النسوة الأربعة والأركان الأربعة]\n\n\nوكذلك جاء شرعنا أكمل الشرائع حيث جرى مجرى الحقائق الكلية فاوتي جوامع الكلم واقتصر على أربع نسوة وحرم ما زاد على ذلك بطريق النكاح الموقوف على العقد فلم يدخل في ذلك ملك اليمين وأباح ملك اليمين في مقابلة الأمر الخامس الذي ذهب إليه بعض العلماء كذلك الأركان من عالم الطبيعة أربعة وبنكاح العالم العلوي لهذه الأربعة يوجد الله ما يتولد فيها واختلفوا في ذلك على ستة مذاهب (فطائفة) زعمت أن كل واحد من هذه الأربعة أصل في نفسه وقالت طائفة ركن النار هو الأصل‏\nفما كثف منه كان هواء وما كثف من الهواء كان ماء وما كثف من الماء كان ترابا وقالت طائفة ركن الهواء هو الأصل فما سخف منه كان نارا وما كثف منه كان ماء وقالت طائفة ركن الماء هو الأصل وقالت طائفة ركن التراب هو الأصل وقالت طائفة الأصل أمر خامس ليس واحدا من هذه الأربعة وهذا هو الذي جعلناه بمنزلة ملك اليمين فعمت شريعتنا في النكاح أتم المذاهب ليندرج فيها جميع المذاهب‏\n\n\n### [نظرية الأصل الخامس‏]\n\n\nوهذا المذهب بالأصل الخامس هو الصحيح عندنا وهو المسمى بالطبيعة فإن الطبيعة معقول واحد عنها ظهر ركن النار وجميع الأركان فيقال ركن النار من الطبيعة ما هو عينها ولا يصح أن يكون المجموع الذي هو عين الأربعة فإن بعض الأركان منافر للآخر بالكلية وبعضها منافر لغيره بأمر واحد كالنار والماء متنافران من جميع الوجوه والهواء والتراب كذلك ولهذا رتبها الله في الوجود ترتيبا حكيما لأجل الاستحالات فلو جعل المنافر مجاورا لمنافره لما استحال إليه وتعطلت الحكمة فجعل الهواء يلي ركن النار والجامع بينهما الحرارة وجعل الماء يلي الهواء والجامع بينهما الرطوبة وجعل التراب يلي الماء والجامع بينهما البرودة فالمحيل أب والمستحيل أم والاستحالة نكاح والذي استحال إليها ابن فالمتكلم أب والسامع أم والتكلم نكاح والموجود من ذلك في فهم السامع ابن فكل أب علوي فإنه مؤثر وكل أم سفلية فإنها مؤثر فيها وكل نسبة بينهما معينة نكاح وتوجه وكل نتيجة ابن ومن هنا يفهم قول المتكلم لمن يريد قيامه قم فيقوم المراد بالقيام عن أثر لفظة قم فإن لم يقم السامع وهو أم بلا شك فهو عقيم وإذا كان عقيما فليس بأم في تلك الحالة\n\n\n### [الأب الأول. الام الاولى. النكاح الأول‏]\n\n\nوهذا الباب إنما يختص بالأمهات فأول الآباء العلوية معلوم وأول الأمهات السفلية شيئية المعدوم الممكن وأول نكاح القصد بالأمر وأول ابن وجود عين تلك الشيئية التي ذكرنا فهذا أب ساري الأبوة وتلك أم سارية الأمومة وذلك النكاح سار في كل شي‏ء والنتيجة دائمة لا تنقطع في حق كل ظاهر العين فهذا يسمى عندنا النكاح الساري في جميع الذراري يقول الله تعالى في الدليل على ما قلناه إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ ولنا فيه كتاب شريف منيع الحمى البصير فيه أعمى فكيف من حل به العمي فلو رأيت تفصيل هذا المقام وتوجهات هذه الأسماء الإلهية الأعلام لرأيت أمرا عظيما وشاهدت مقاما هائلا جسيما فلقد تنزه العارفون بالله وبصنعه الجميل‏\n\n\n### [العقل الكلي والنفس الكلية]\n\n\nبأولى وبعد أن أشرت إلى فهمك الثاقب ونظرك الصائب بالأب الأول الساري وهو الاسم الجامع الأعظم الذي تتبعه جميع الأسماء في رفعه ونصبه وخفضه الساري حكمه والأم الأولية الآخرية السارية في نسبة الأنوثة في جميع الأبناء فلنشرع في الآباء الذين هم أسباب موضوعة بالوضع الإلهي والأمهات واتصالهما بالنكاح المعنوي والحسي المشروع حتى يكون الأبناء أبناء حلال إلى أن أصل إلى التناسل الإنساني وهو آخر نوع تكون وأول مبدع بالقصد تعين فنقول إن العقل الأول الذي هو أول مبدع خلق وهو القلم الأعلى ولم يكن ثم محدث سواه وكان مؤثرا فيه بما أحدث الله فيه من انبعاث اللوح المحفوظ عنه كانبعاث حواء من آدم في عالم الأجرام ليكون ذلك اللوح موضعا ومحلا لما يكتب فيه هذا القلم الأعلى الإلهي وتخطيط الحروف الموضوعة للدلالة على ما جعلها الحق تعالى أدلة عليه فكان اللوح المحفوظ أول موجود انبعاثي وقد ورد في الشرع أن أول ما خلق الله القلم ثم خلق اللوح وقال للقلم اكتب قال القلم وما أكتب قال الله له اكتب وأنا أملي عليك فخط القلم في اللوح ما يملي عليه الحق وهو علمه في خلقه الذي يخلق إلى يوم القيامة\n\n\n### [النكاح المعنوي بين القلم واللوح‏]\n\n\nفكان بين القلم واللوح نكاح معنوي معقول وأثر حسي مشهود ومن هنا كان العمل بالحروف المرقومة عندنا وكان ما أودع في اللوح من الأثر مثل الماء الدافق الحاصل في رحم الأنثى وما ظهر من تلك الكتابة من المعاني المودعة في تلك الحروف الجرمية بمنزلة أرواح الأولاد المودعة في أجسامهم فافهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ وجعل الحق في هذا اللوح العاقل عن الله ما أوحى به إليه المسبح بحمده الذي لا يفقه تسبيحه إلا من أعلمه الله به وفتح سمعه لما يورده كما فتح سمع رسول الله صلى الله عليه وسلم ومن حضر من أصحابه لإدراك تسبيح الحصى في كفه الطاهرة الطيبة صلى الله عليه وسلم وإنما قلنا فتح سمعه إذ كان الحصى ما زال مذ خلقه الله مسبحا بحمد موجدة فكان خرق العادة في الإدراك السمعي لا فيه ثم أوجد فيه صفتين صفة علم وصفة عمل فبصفة العمل تظهر صور العالم عنه كما تظهر صورة التابوت للعين عند عمل النجار فبها يعطي‏\nالصور والصور على قسمين صور ظاهرة حسية وهي الأجرام وما يتصل بها حسا كالأشكال والألوان والأكوان وصور باطنة معنوية غير محسوسة وهي ما فيها من العلوم والمعارف والإرادات وبتينك الصفتين ظهر ما ظهر من الصور فالصفة العلامة أب فإنها المؤثرة والصفة العاملة أم فإنها المؤثر فيها وعنها ظهرت الصور التي ذكرناها فإن النجار المهندس إذا كان عالما ولا يحسن العمل فيلقي ما عنده على سمع من يحسن عمل النجارة وهذا الإلقاء نكاح فكلام المهندس أب وقبول السامع أم ثم يصير علم السامع أبا وجوارحه أما وإن شئت قلت فالمهندس أب والصانع الذي هو النجار أم من حيث ما هو مصغ لما يلقي إليه المهندس فإذا أثر فيه فقد أنزل ما في قوته في نفس النجار والصورة التي ظهرت للنجار في باطنه مما ألقى إليه المهندس وحصلت في وجود خياله قائمة ظاهرة له بمنزلة الولد الذي ولد له فهمه عن المهندس ثم عمل النجار فهو أب في الخشب الذي هو أم النجارة بالآلات التي يقع بها النكاح وإنزال الماء الذي هو أثر كل ضربة بالقدوم أو قطع بالمنشار وكل قطع وفصل وجمع في القطع المنجورة لا نشاء الصورة فظهر التابوت الذي هو بمنزلة الولد المولود الخارج للحس فهكذا فلتفهم الحقائق في ترتيب الآباء والأمهات والأبناء وكيفية الإنتاج فكل أب ليس عنده صفة العمل فليس هو أب من ذلك الوجه حتى أنه لو كان عالما ومنع آلة التوصيل بالكلام أو الإشارة ليقع الإفهام وهو غير عامل لم يكن أبا من جميع الوجوه وكان أما لما حصل في نفسه من العلوم غير إن الجنين لم يخلق فيه الروح في بطن أمه أو مات في بطن أمه فأحالته طبيعة لام إلى أن تصرف ولم يظهر له عين فافهم‏\n\n\n### [الطبيعة الكلية والهباء]\n\n\nوبعد أن عرفت الأب الثاني من الممكنات وأنه أم ثانية للقلم الأعلى كان مما ألقى إليها من الإلقاء الأقدس الروحاني الطبيعة والهباء فكان أول أم ولدت توأمين فأول ما ألقت الطبيعة ثم تبعتها بالهباء فالطبيعة والهباء أخ وأخت لأب واحد وأم واحدة فانكح الطبيعة الهباء فولد بينهما صورة الجسم الكلي وهو أول جسم ظهر فكان الطبيعة الأب فإن لها الأثر وكان الهباء الأم فإن فيها ظهر الأثر وكانت النتيجة الجسم ثم نزل التوالد في العلم إلى التراب على ترتيب مخصوص ذكرناه في كتابنا المسمى بعقلة المستوفز وفيه طول لا يسعه هذا الباب فإن الغرض الاختصار\n\n\n### [نظرية المركز ونظرية نهاية الأركان‏]\n\n\nونحن لا نقول بالمركز وإنما نقول بنهاية الأركان وأن الأعظم يجذب الأصغر ولهذا نرى البخار والنار يطلبان العلو والحجر وما أشبهه يطلب السفل فاختلفت الجهات وذلك على الاستقامة من الاثنين أعني طالب العلو والسفل فإن القائل بالمركز يقول إنه أمر معقول دقيق تطلبه الأركان ولو لا التراب لدار به الماء ولو لا الماء لدار به الهواء ولو لا الهواء لدار به النار ولو كان كما قال لكنا نرى البخار يطلب السفل والحس يشهد بخلاف ذلك وقد بينا هذا الفصل في كتاب المركز لنا وهو جزء لطيف فإذا ذكرناه في بعض كتبنا إنما نسوقه على جهة مثال النقطة من الأكرة التي عنها يحدث المحيط لما لنا في ذلك من الغرض المتعلق بالمعارف الإلهية والنسب لكون الخطوط الخارجة من النقطة إلى المحيط على السواء لتساوى النسب حتى لا يقع هناك تفاضل فإنه لو وقع تفاضل أدى إلى نقص المفضول والأمر ليس كذلك وجعلناه محل العنصر الأعظم تنبيها على إن الأعظم يحكم على الأقل وذكرناه مشارا إليه في عقلة المستوفز\n\n\n### [دورة الأفلاك العلوية]\n\n\nولما أدار الله هذه الأفلاك العلوية وأوجد الأيام بالفلك الأول وعينه بالفلك الثاني الذي فيه الكواكب الثابتة للابصار ثم أوجد الأركان ترابا وماء وهواء ونارا ثم سوى السموات سبعا طباقا وفتقها أي فصل كل سماء على حدة بعد ما كانت رتقا إذ كانت دخانا وفتق الأرض إلى سبع أرضين سماء أولي لأرض أولى وثانية لثانية إلى سبع وخلق الجواري الخنس خمسة في كل سماء كوكب وخلق القمر وخلق أيضا الشمس فحدث الليل والنهار بخلق الشمس في اليوم وقد كان اليوم موجودا فجعل النصف من هذا اليوم لأهل الأرض نهارا وهو من طلوع الشمس إلى غروبها وجعل النصف الآخر منه ليلا وهو من غروب الشمس إلى طلوعها واليوم عبارة عن المجموع ولهذا خَلَقَ السَّماواتِ والْأَرْضَ وما بَيْنَهُما في سِتَّةِ أَيَّامٍ فإن الأيام كانت موجودة بوجود حركة فلك البروج وهي الأيام المعروفة عندنا لا غير فما قال الله خلق العرش والكرسي وإنما قال خَلَقَ السَّماواتِ والْأَرْضَ في سِتَّةِ أَيَّامٍ فإذا دار فلك البروج دورة واحدة فذلك هو اليوم الذي خلق الله فيه السموات والأرض ثم أحدث الله الليل والنهار عند وجود الشمس لا الأيام وأما ما يطرأ فيها من الزيادة والنقصان أعني في الليل والنهار لا في الساعات فإنها أربع وعشرون ساعة وذلك لحلول الشمس في منطقة البروج وهي حمائلية بالنسبة\nإلينا فيها ميل فيطول النهار إذا كانت الشمس في المنازل العالية حيث كانت وإذا حلت الشمس في المنازل النازلة قصر النهار حيث كانت وإنما قلنا حيث كانت فإنه إذا طال الليل عندنا طال النهار عند غيرنا فتكون الشمس في المنازل العالية بالنسبة إليهم وفي المنازل النازلة بالنسبة إلينا فإذا قصر النهار عندنا طال الليل عندهم لما ذكرناه واليوم هو اليوم بعينه أربع وعشرون ساعة لا يزيد ولا يقص ولا يطول ولا يقصر في موضع الاعتدال فهذا هو حقيقة اليوم ثم قد نسمي النهار وحده يوما بحكم الاصطلاح فافهم‏\n\n\n### [الزمان والشؤون الإلهية]\n\n\nوقد جعل الله هذا الزمان الذي هو الليل والنهار يوما والزمان هو اليوم والليل والنهار موجودان في الزمان جعلهما أبا وأما لما يحدث الله فيهما كما قال يُغْشِي اللَّيْلَ النَّهارَ كمثل قوله في آدم فَلَمَّا تَغَشَّاها حَمَلَتْ فإذا غشى الليل النهار كان الليل أبا وكان النهار أما وصار كل ما يحدث الله في النهار بمنزلة الأولاد التي تلد المرأة وإذا غشى النهار الليل كان النهار أبا وكان الليل أما وكان كل ما يحدث الله من الشئون في الليل بمنزلة الأولاد التي تلد الأم وقد بينا هذا الفصل في كتاب الشأن لنا تكلمنا فيه على قوله تعالى كُلَّ يَوْمٍ هُوَ في شَأْنٍ وسيأتي إن شاء الله في هذا الكتاب إن ذكرنا الله به من معرفة الأيام طرفا شافيا وكذلك قال تعالى أيضا يُولِجُ اللَّيْلَ في النَّهارِ ويُولِجُ النَّهارَ في اللَّيْلِ فزاد بيانا في التناكح وأبان سبحانه بقوله وآيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهارَ أن الليل أم له وأن النهار متولد عنه كما ينسلخ المولود من أمه إذا خرج منها والحية من جلدها فيظهر مولدا في عالم آخر غير العالم الذي يحويه الليل والأب هو اليوم الذي ذكرناه وقد بينا ذلك في كتاب الزمان لنا ومعرفة الدهر فهذا الليل والنهار أبوان بوجه وأمان بوجه وما يحدث الله فيهما في عالم الأركان من المولدات عند تصريفهما يسمون أولاد الليل والنهار كما قررناه‏\n\n\n### [أهرام مصر بنيت والنسر في الأسد]\n\n\nولما أنشأ الله أجرام العالم كله القابل للتكوين فيه جعل من حد ما يلي مقعر السماء الدنيا إلى باطن الأرض عالم الطبيعة والاستحالات وظهور الأعيان التي تحدث عند الاستحالات وجعلها بمنزلة الأم وجعل من مقعر فلك السماء الدنيا إلى آخر الأفلاك بمنزلة الأب وقدر فيها منازل وزينها بالأنوار الثابتة والسابحة فالسابحة تقطع في الثابتة والثابتة والسابحة تقطع في الفلك المحيط بتقدير العزيز بدليل أنه رؤي في بعض الأهرام التي بديار مصر مكتوبا بقلم يذكر في ذلك تاريخ لأهرام أنها بنيت والنسر في الأسد ولا شك أنه الآن في الجدي كذا ندركه فدل على أن الكواكب الثابتة تقطع في فلك البروج الأطلس والله يقول في القمر والْقَمَرَ قَدَّرْناهُ مَنازِلَ وقال في الكواكب كُلٌّ في فَلَكٍ يَسْبَحُونَ وقال تعالى والشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَها وقد قرئ لا مستقر لها وليس بين القراءتين تنافر ثم قال ذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ ينظر إلى قوله في القمر أنه قدره منازل وقال لا الشَّمْسُ يَنْبَغِي لَها أَنْ تُدْرِكَ الْقَمَرَ ولا اللَّيْلُ سابِقُ النَّهارِ وكُلٌّ في فَلَكٍ يَسْبَحُونَ أي في شي‏ء مستدير\n\n\n### [الامر الإلهي المنزل بين السماء والأرض‏]\n\n\nوجعل لهذه الأنوار المسماة بالكواكب أشعة متصلة بالأركان تقوم اتصالاتها بها مقام نكاح الآباء للامهات فيحدث الله تعالى عند اتصال تلك الشعاعات النورية في الأركان الأربعة من عالم الطبيعة ما يتكون فيها مما نشاهده حسا فهذه الأركان لها بمنزلة الأربعة النسوة في شرعنا وكما لا يكون نكاح شرعي عندنا حلالا إلا بعقد شرعي كذلك أَوْحى‏ في كُلِّ سَماءٍ أَمْرَها فكان من ذلك الوحي تنزل الأمر بينهن كما قال تعالى يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ يعني الأمر الإلهي وفي تفسير هذا التنزل أسرار عظيمة تقرب مما نشير إليه في هذا الباب وقد روى عن ابن عباس أنه قال في هذه الآية لو فسرتها لقلتم إني كافر وفي رواية لرجمتموني وإنها من أسرار آي القرآن قال تعالى خَلَقَ سَبْعَ سَماواتٍ ومن الْأَرْضِ مِثْلَهُنَّ ثم قال يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ ثم تمم وأبان فقال لِتَعْلَمُوا أَنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ وهو الذي أشرنا إليه بصفة العمل الذي ذكرناه آنفا من إيجاد الله صفة العلم والعمل في الأب الثاني فإن القدرة للإيجاد وهو العمل ثم تمم في الأخبار فقال وإن الله قد أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً وقد أشرنا إليه بصفة العلم التي أعطاها الله للأب الثاني الذي هو النفس الكلية المنبعثة فهو العليم سبحاته بما يوجد القدير على إيجاد ما يريد إيجاده لا مانع له فجعل الأمر يتنزل بين السماء والأرض كالولد يظهر بين الأبوين‏\n\n\n### [أشعة الكواكب واتصالها بالأركان الأربعة]\n\n\nوأما اتصال الأشعة النورية الكوكبية عن الحركة الفلكية السماوية بالأركان الأربعة التي هي أم المولدات في الحين الواحد للكل معا جعله الحق مثالا للعارفين في نكاح أهل الجنة في الجنة جميع نسائهم وجواريهم في الآن الواحد نكاحا حسيا كما إن هذه الاتصالات حسية فينكح الرجل في الجنة جميع من عنده من المنكوحات إذا اشتهى ذلك في‏\nالآن الواحد نكاحا جسميا محسوسا بإيلاج ووجود لذة خاصة بكل امرأة من غير تقدم ولا تأخر وهذا هو النعيم الدائم والاقتدار الإلهي والعقل يعجز عن إدراك هذه الحقيقة من حيث فكره وإنما يدرك هذا بقوة أخرى إلهية في قلب من يشاء من عباده كما أن الإنسان في الجنة في سوق الصور إذا اشتهى صورة دخل فيها كما تشكل الروح هنا عندنا وإن كان جسما ولكن أعطاه الله هذه القدرة على ذلك والله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ وحديث سوق الجنة ذكره أبو عيسى الترمذي في مصنفه فانظره هناك فإذا اتصلت الأشعة النورية في الأركان الأربعة ظهرت المولدات عن هذا النكاح الذي قدره العزيز العليم فصارت المولدات بين آباء وهي الأفلاك والأنوار العلوية وبين أمهات وهي الأركان الطبيعية السفلية وصارت الأشعة المتصلة من الأنوار بالأركان كالنكاح وحركات الأفلاك وسباحات الأنوار بمنزلة حركات المجامع وكان حركات الأركان بمنزلة المخاض للمرأة لاستخراج الزبد الذي يخرج بالمخض وهو ما يظهر من المولدات في هذه الأركان للعين من صورة المعادن والنبات والحيوان ونوع الجن والإنس فسبحان القادر على ما يشاء لا إله إلا هو رب كل شي‏ء ومليكه‏\n\n\n### [الشكر لله وللوالدين من المقام الكلي‏]\n\n\nقال تعالى أَنِ اشْكُرْ لِي ولِوالِدَيْكَ فقد تبين لك أيها الولي آباؤك وأمهاتك من هم إلى أقرب أب لك وهو الذي ظهر عينك به وأمك كذلك القريبة إليك إلى الأب الأول وهو الجد الأعلى إلى بما بينهما من الآباء والأمهات فشكرهم الذي يسرون به ويفرحون بالثناء عليهم هو أن تنسبهم إلى مالكهم وموجدهم وتسلب الفعل عنهم وتلحقه بمستحقه الذي هو خالق كل شي‏ء فإذا فعلت ذلك فقد أدخلت سرورا على آبائك بفعلك ذلك وإدخال هذا السرور عليهم هو عين برك بهم وشكرك إياهم وإذا لم تفعل هذا ونسيت الله بهم فما شكرتهم ولا امتثلت أمر الله في شكرهم فإنه قال أَنِ اشْكُرْ لِي فقدم نفسه ليعرفك أنه السبب الأول والأولى ثم عطف وقال ولِوالِدَيْكَ وهي الأسباب التي أوجدك الله عندها لتنسبها إليه سبحانه ويكون لها عليك فضل التقدم بالوجود خاصة لا فضل التأثير لأنه في الحقيقة لا أثر لها وإن كانت أسبابا لوجود الآثار فبهذا القدر صح لها الفضل وطلب منك الشكر وأنزلها الحق لك وعندك منزلته في التقدم عليك لا في الأثر ليكون الثناء بالتقدم والتأثير لله تعالى وبالتقدم والتوقف للوالدين ولكن على ما شرطناه فلا تشرك بعبادة ربك أحدا فإذا أثنيت على الله تعالى وقلت ربنا ورب آبائنا العلويات وأمهاتنا السفليات فلا فرق بين أن أقولها أنا أو يقولها جميع بنى آدم من البشر فلم يخاطب شخصا بعينه حتى يسوق آباءه وأمهاته من آدم وحواء إلى زمانه وإنما القصد هذا النش‏ء الإنساني فكنت مترجما عن كل مولود بهذا التحميد من عالم الأركان وعالم الطبيعة والإنسان ثم ترتقي في النيابة عن كل مولد بين مؤثر ومؤثر فيه فتحمده بكل لسان وتتوجه إليه بكل وجه فيكون الجزاء لنا من عند الله من ذلك المقام الكلي‏\n\n\n### [السلام التام على جميع الأنام‏]\n\n\nكما قال لي بعض مشيختي إذا قلت السلام علينا وعلى عباد الله الصالحين أو قلت السلام عليكم إذا سلمت في طريقك على أحد فاحضر في قلبك كل صالح لله من عباده في الأرض والسماء وميت وحي فإنه من ذلك المقام يرد عليك فلا يبقى ملك مقرب ولا روح مطهر يبلغه سلامك إلا ويرد عليك وهو دعاء فيستجاب فيك فتفلح ومن لم يبلغه سلامك من عباد الله المهيمين في جلاله المشتغلين به المستفرغين فيه وأنت قد سلمت عليهم بهذا الشمول فإن الله ينوب عنهم في الرد عليك وكفى بهذا شرفا في حقك حيث يسلم عليك الحق فليته لم تسمع أحدا ممن سلمت عليه حتى ينوب عن الجميع في الرد عليك فإنه بك أشرف قال تعالى تشريفا في حق يحيى عليه السلام وسَلامٌ عَلَيْهِ يَوْمَ وُلِدَ ويَوْمَ يَمُوتُ ويَوْمَ يُبْعَثُ حَيًّا وهذا سلام فضيلة وإخبار فكيف سلام واجب ناب الحق مناب من أجاب عنه وجزاء الفرائض أعظم من جزاء الفضائل في حق من قيل فيه وسَلامٌ عَلَيْهِ يَوْمَ وُلِدَ فيجمع له بين الفضيلتين وقد وردت صلاة الله علينا ابتداء وما وصل إلي هل ورد السلام ابتداء كما وردت الصلاة أم لا فمن روى في ذلك شيئا وتحققه فقد جعلت أمانة في عنقه أن يلحقه في هذا الموضع إلى جانب صلاة الله علينا في هذا الباب ليكون بشرى للمؤمنين وشرفا لكتابي هذا والله المعين والموفق لا رب غيره‏\n\n\n### [الآباء الطبيعيون والأمهات الطبيعيات‏]\n\n\nوأما الآباء الطبيعيون والأمهات فلم نذكرهم فلنذكر الأمر الكلي من ذلك وهم أبوان وأمان فالأبوان هما الفاعلان والأمان هما المنفعلان وما يحدث عنهما هو المنفعل عنهما فالحرارة والبرودة فاعلان والرطوبة واليبوسة منفعلان فنكحت‏\nالحرارة اليبوسة فانتجا ركن النار ونكحت الحرارة الرطوبة فانتجا ركن الهواء ثم نكح البرودة الرطوبة فانتجا ركن الماء ونكح البرودة اليبوسة فانتجا ركن التراب فحصلت في الأبناء حقائق الآباء والأمهات فكانت النار حارة يابسة فحرارتها من جهة الأب ويبوستها من جهة الأم وكان الهواء حارا رطبا فحرارته من جهة الأب ورطوبته من جهة الأم وكان الماء باردا رطبا فبرودته من جهة الأب ورطوبته من جهة الأم وكانت الأرض باردة يابسة فبرودتها من جهة الأب ويبوستها من جهة الأم فالحرارة والبرودة من العلم والرطوبة واليبوسة من الإرادة هذا حد تعلقها في وجودها من العلم الإلهي وما يتولد عنهما من القدرة ثم يقع التوالد في هذه الأركان من كونها أمهات لآباء الأنوار العلوية لا من كونها آباء وإن كانت الأبوة فيها موجودة فقد عرفناك أن الأبوة والبنوة من الإضافات والنسب فالأب ابن لأب هو ابن له والابن أب لابن هو أب له وكذلك باب النسب فانظر فيه والله الموفق لا رب غيره ولما كانت اليبوسة منفعلة عن الحرارة وكانت الرطوبة منفعلة عن البرودة قلنا في الرطوبة واليبوسة إنهما منفعلتان وجعلناهما بمنزلة الأم للأركان ولما كانت الحرارة والبرودة فاعلين جعلناهما بمنزلة الأب للأركان ولما كانت الصنعة تستدعي صانعا ولا بد والمنفعل يطلب الفاعل بذاته فإنه منفعل لذاته ولو لم يكن منفعلا لذاته لما قبل الانفعال والأثر وكان مؤثرا فيه بخلاف الفاعل فإنه يفعل بالاختيار إن شاء فعل فيسمى فاعلا وإن شاء ترك وليس ذلك للمنفعل ولهذه الحقيقة ذكر تعالى وهو من فصاحة القرآن وإيجازه ولا رطب ولا يابس إلا في كتاب مبين فذكر المنفعل ولم يذكر ولا حار ولا بارد لما كانت الرطوبة واليبوسة عند العلماء بالطبيعة تطلب الحرارة والبرودة اللتين هما منفعلتان عنهما كما تطلب الصنعة الصانع لذلك ذكرهما دون ذكر الأصل وإن كان الكل في الكتاب المبين فلقد جاء الله سيدنا محمدا صلى الله عليه وسلم بعلوم ما نالها أحد سواه كما قال فعلمت علم الأولين والآخرين في حديث الضرب باليد فالعلم الإلهي هو أصل العلوم كلها وإليه ترجع وقد استوفينا ما يستحقه هذا الباب على غاية الإيجاز والاختصار فإن الطول فيه إنما هو بذكر الكيفيات وأما الأصول فقد ذكرناها ومهدناها والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء الثاني عشر\n\n",
    "en": "## The Eleventh Chapter: Concerning the Knowledge of Our Celestial Fathers and Our Terrestrial Mothers\n\n> I am the son of fathers who are purified Spirits,\n> And mothers who are elemental Souls.\n> Our manifestation occurred between Spirit and body,\n> Through a union of embrace and delights.\n> I was not born of one, that I should unify Him alone,\n> But of a multitude of fathers and mothers.\n> If you realize their affair concerning the Deity,\n> They are like a craftsman who makes things with tools.\n> The attribution of the making to the carpenter is not absolute;\n> Thus did the Lord of Creatures bring us into existence.\n> Thus, the person is truthful in affirming the Oneness (توحيد) of his Originator,\n> And the person is truthful in establishing the causes.\n> If you look to the tools, the chain of transmission (إسناد عنعنة) extends for us\n> Until it reaches the Essence (الذات).\n> But if you look to Him while He brings us into existence,\n> We affirm His Unity (وحدة), not the collectivities.\n> Indeed, I was born unique in essence, solitary,\n> While all other people are children of secondary causes.\n\n### [Fatherhood, Motherhood, and Sonship]\n\nKnow, may God strengthen you, that since the purpose of this world is the Human, and the Human is its Imam (Leader), we have attributed the fathers and mothers to him, saying: \"Our Celestial Fathers and our Terrestrial Mothers.\" Thus, every agent (مؤثر) is a father, and every recipient (مؤثر فيه) is a mother. This is the rule (الضابط) for this chapter. The entity generated between them from that influence is called a son or offspring (ابنا ومولدا). Similarly, in the production of knowledge, concepts are generated by two premises, one of which marries the other through the single term that is repeated in both—this is the link, which is the marriage—and the conclusion that results between them is the desired outcome. All Spirits (الأرواح) are fathers, and Nature (الطبيعة) is the mother, as she is the locus of transformations (الاستحالات). These Spirits turn toward these Pillars (الأركان), which are the elements capable of change and transformation, and in them appear the generated entities (المولدات): minerals, plants, animals, jinn, and the Human, who is the most perfect of them.\n\n### [The Four Wives and the Four Elements]\n\nLikewise, our Law (Shari'a) came as the most perfect of laws, running according to the course of Universal Realities (الحقائق الكلية). It was granted the comprehensive words (جوامع الكلم) and limited marriage to four wives, prohibiting anything beyond that by way of marriage dependent on a contract, thereby excluding concubinage (ملك اليمين). Concubinage was permitted in correspondence to the fifth principle (الأمر الخامس) that some scholars adopted. Similarly, the Pillars (Elements) of the world of Nature are four, and through the marriage of the Celestial World to these four, God brings into existence what is generated within them. Scholars have differed on this matter, holding six doctrines: One group claimed that each of these four elements is a principle in itself. Another group said that the element of Fire is the principle; what condensed from it was Air, what condensed from Air was Water, and what condensed from Water was Earth. Another group said that the element of Air is the principle; what rarefied from it was Fire, and what condensed from it was Water. Another group said that the element of Water is the principle. Another group said that the element of Earth is the principle. And another group said that the principle is a fifth matter, not one of these four. This is what we have placed in the position of concubinage. Thus, our Law concerning marriage encompassed the most complete doctrines, so that all doctrines might be included within it.\n\n### [The Theory of the Fifth Principle]\n\nThis doctrine of the Fifth Principle (الأصل الخامس) is the correct one according to us, and it is called Nature (الطبيعة). Nature is a single intelligible concept (معقول واحد) from which the element of Fire and all other elements appeared. It is said that the element of Fire is from Nature, but is not Nature itself. Nor can Nature be the totality which is the four elements, for some elements are entirely antagonistic to others, and some are antagonistic to others in only one respect. Fire and Water are antagonistic in all respects, and Air and Earth are likewise. For this reason, God arranged them in Existence (الوجود) in a wise order, for the sake of transformations. If He had placed the antagonistic element adjacent to its antagonist, it would not have transformed into it, and wisdom would have been nullified. So, He placed Air next to the element of Fire, and the commonality between them is heat. He placed Water next to Air, and the commonality between them is moisture. He placed Earth next to Water, and the commonality between them is coldness. Thus, the transformer (المحيل) is the father, the transformed (المستحيل) is the mother, the transformation (الاستحالة) is the marriage, and the entity that is transformed into is the son. The speaker is the father, the listener is the mother, speech is the marriage, and the understanding that results in the listener’s mind is the son. Every celestial father is an agent (مؤثر), and every terrestrial mother is a recipient (مؤثر فيها). Every specific relationship between them is a marriage and an orientation, and every result is a son. From this, one understands the statement of the speaker to someone he wishes to stand: \"Stand!\" and the desired standing occurs due to the influence of the word \"Stand!\" If the listener, who is undoubtedly the mother, does not stand, then she is barren (عقيم) and is not a mother in that instance.\n\n### [The First Father, The First Mother, The First Marriage]\n\nThis chapter is specifically concerned with the mothers. The first of the Celestial Fathers is known, and the first of the Terrestrial Mothers is the 'thingness' (شيئية) of the possible non-existent (المعدوم الممكن). The first marriage is the intention (القصد) through the Command (الأمر), and the first son is the existence (وجود) of the essence of that 'thingness' we mentioned. This Father is pervasive in fatherhood, and that Mother is pervasive in motherhood, and that marriage is pervasive in everything. The result is permanent and continuous for every manifest entity. This is what we call the Pervasive Marriage (النكاح الساري) in all progeny. God Almighty says, as proof of what we have stated: <<إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ>> (Indeed, Our word to a thing, when We intend it, is only that We say to it, \"Be,\" and it is.) We have a noble book concerning this, whose sanctuary is inviolable, where the seeing person is blind, so how about one who is afflicted by blindness? If you were to see the detail of this station and the orientations of these glorious Divine Names (الأسماء الإلهية الأعلام), you would see a tremendous matter and witness a terrifying, mighty station. Truly, the Gnostics (العارفون) are exalted above such things by God and His beautiful making.\n\n### [The Universal Intellect and the Universal Soul]\n\nAfter I have alluded to your penetrating understanding and sound insight regarding the First Pervasive Father—who is the All-Comprehensive Greatest Name (الاسم الجامع الأعظم) that all other Names follow in its elevation, accusative, and genitive cases, whose ruling is pervasive—and the First, Last, Pervasive Mother in the proportion of femininity in all sons, let us now proceed to the fathers who are causes established by Divine ordinance, and the mothers, and their connection through spiritual and sensible, legislated marriage, so that the sons may be legitimate children, until I reach human procreation, which is the last type of formation and the first entity determined by intention. We say that the First Intellect (العقل الأول), which is the first created entity, and which is the Supreme Pen (القلم الأعلى), was created. There was no other originated entity besides it, and it was an agent of influence upon the Preserved Tablet (اللوح المحفوظ) through what God originated within it, just as Eve emanated from Adam in the world of bodies. This Tablet was to be the place and locus for what this Supreme Divine Pen writes, and for the tracing of the letters established to signify what the Real (الحق) made them indicators of. Thus, the Preserved Tablet was the first emanated existent. It is reported in the Law (Shari'a) that the first thing God created was the Pen, then He created the Tablet, and He said to the Pen, \"Write.\" The Pen said, \"What shall I write?\" God said to it, \"Write, and I shall dictate to you.\" So the Pen traced upon the Tablet what the Real dictated to it, which is His Knowledge (العلم) concerning His creation that He will create until the Day of Resurrection.\n\n### [The Spiritual Marriage between the Pen and the Tablet]\n\nThus, there was between the Pen and the Tablet a spiritual, intelligible marriage and a sensible, witnessed effect. From this comes the significance of working with inscribed letters according to us. What was deposited in the Tablet of the effect is like the gushing water (semen) that occurs in the womb of the female. And what appeared from that writing, of the meanings deposited in those corporeal letters, is analogous to the spirits of the children deposited in their bodies. Understand this, and <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way). The Real placed in this Tablet the capacity to understand from God what He revealed to it, praising Him, whose glorification is not understood except by those whom God informs and whose hearing He opens to what it conveys, just as He opened the hearing of the Messenger of God (peace and blessings be upon him) and those Companions present to perceive the glorification of the pebbles in his pure, blessed hand (peace and blessings be upon him). We say He opened his hearing because the pebbles had been glorifying their Originator since God created them. Thus, the breaking of the custom (خرق العادة) was in the auditory perception, not in the pebbles themselves. Then, He originated in the Tablet two qualities: the quality of Knowledge (علم) and the quality of Action (عمل). By the quality of Action, the forms of the world appear from it, just as the form of the ark appears to the eye when the carpenter works. By this quality, it gives the forms. The forms are of two types: manifest sensible forms, which are bodies and what is connected to them sensually, such as shapes, colors, and occurrences; and inner spiritual, non-sensible forms, which are the sciences, gnoses (المعارف), and volitions contained within them. By these two qualities, what appeared of the forms became manifest. The knowing quality is the father, for it is the agent (المؤثرة), and the acting quality is the mother, for it is the recipient (المؤثر فيها). From them appeared the forms we mentioned. For the engineering carpenter, if he is knowledgeable but not skilled in execution, he conveys what he knows to the hearing of one who is skilled in carpentry. This conveyance is the marriage. The engineer's speech is the father, and the listener's acceptance is the mother. Then, the listener's knowledge becomes the father, and his limbs become the mother. Or, if you wish, you may say: the engineer is the father, and the craftsman, who is the carpenter, is the mother, insofar as he listens attentively to what the engineer conveys to him. When the engineer influences him, he has deposited what is in his potentiality into the soul of the carpenter. The form that appeared to the carpenter internally, from what the engineer conveyed to him, and which subsisted in the existence of his imagination (خيال) appearing clearly to him, is analogous to the child born to him from his understanding of the engineer. Then the carpenter's action is the father to the wood, which is the mother of carpentry, using the tools by which the marriage occurs, and the depositing of the water—which is the effect of every blow with the adze or cut with the saw, and every cutting, separating, and joining of the carved pieces—for the creation of the form. Thus, the ark appeared, which is analogous to the born child that emerges into the senses. This is how you should understand the realities concerning the arrangement of fathers, mothers, and sons, and the manner of generation. Every father who does not possess the quality of action is not a father from that perspective, even if he is knowledgeable. If he is prevented from the means of conveyance—by speech or gesture—to effect understanding, and he is not an agent, he is not a father in any respect. He would be a mother due to the knowledge that has settled within his soul, except that the fetus has not been given the spirit in her womb, or it died in her womb, and her nature transformed it until it was disposed of and its entity did not appear. Understand this.\n\n### [Universal Nature and Haba']\n\nAfter you have known the Second Father among the possibles, and that it is a second Mother to the Supreme Pen (القلم الأعلى) through the most sacred spiritual conveyance imparted to it, the next entities are Nature (الطبيعة) and *Haba'* (الهباء, Primordial Dust). The first mother gave birth to twins: first she cast forth Nature, then *Haba'* followed. Nature and *Haba'* are brother and sister from one father and one mother. Nature married *Haba'*, and between them was born the form of the Universal Body (الجسم الكلي), which was the first body to appear. Thus, Nature was the father, for it possessed the influence (الأثر), and *Haba'* was the mother, for the influence appeared within it. The result was the Body. Then, procreation descended in the world of knowledge down to the Earth (التراب) in a specific order, which we mentioned in our book called *'Uqlat al-Mustawfiz* (The Knot of the Hurried Seeker). That discussion is lengthy and cannot be contained in this chapter, as the purpose here is brevity.\n\n### [The Theory of the Center and the Theory of the Extremities of the Elements]\n\nWe do not affirm the Center (المركز), but rather the extremities of the Elements (نهاية الأركان), and that the greater attracts the lesser. For this reason, we see vapor and fire seeking elevation, while stone and similar things seek the bottom. Thus, the directions differed, and this is based on the straightness of the two—meaning the seeker of elevation and the seeker of the bottom. The proponent of the Center says that it is a subtle, intelligible matter sought by the elements, and were it not for Earth, Water would revolve around it; were it not for Water, Air would revolve around it; and were it not for Air, Fire would revolve around it. If this were true, we would see vapor seeking the bottom, but sense perception testifies to the contrary. We have clarified this section in our book on the Center, which is a subtle part. When we mention it in some of our books, we only present it as an example of the point in the sphere from which the circumference arises, due to our purpose related to Divine Gnosis (المعارف الإلهية) and proportions, since the lines extending from the point to the circumference are equal, ensuring the equality of proportions so that no differentiation occurs, for if differentiation occurred, it would lead to the deficiency of the lesser, and the matter is not so. We made it the locus of the Greatest Element (العنصر الأعظم) to indicate that the greater governs the lesser, and we mentioned it by allusion in *'Uqlat al-Mustawfiz*.\n\n### [The Rotation of the Celestial Spheres]\n\nWhen God caused these Celestial Spheres (الأفلاك العلوية) to rotate, He brought the Days into existence by the First Sphere, and determined it by the Second Sphere, which contains the fixed stars visible to the eye. Then He brought the Elements—Earth, Water, Air, and Fire—into existence. Then He perfected the heavens as seven layers (سبعا طباقا) and split them (فتقها)—meaning He separated each heaven individually—after they had been joined (رتقا), since they were smoke. He split the Earth into seven earths, a first heaven for a first earth, and a second for a second, up to seven. He created the five wandering stars (الجواري الخنس), one star in each heaven, and He created the Moon, and He also created the Sun. Night and Day occurred through the creation of the Sun on the Day, though the Day had already existed. He made half of this Day daytime for the people of the Earth, which is from sunrise to sunset, and He made the other half of it nighttime, which is from sunset to sunrise. The Day (اليوم) refers to the totality. For this reason, He <<خَلَقَ السَّماواتِ وَالْأَرْضَ وَما بَيْنَهُما فِي سِتَّةِ أَيَّامٍ>> (created the heavens and the earth and what is between them in six days), for the Days were already existent through the movement of the sphere of the Zodiac (فلك البروج), and these are the Days known to us, nothing else. God did not say He created the Throne (*al-'Arsh*) and the Footstool (*al-Kursi*), but rather He said He <<خَلَقَ السَّماواتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ>> (created the heavens and the earth in six days). When the sphere of the Zodiac completes one rotation, that is the Day in which God created the heavens and the earth. Then God originated Night and Day upon the existence of the Sun, not the Days themselves. As for the increase and decrease that occurs in them—meaning in the length of Night and Day, not in the hours, for they are twenty-four hours—that is due to the Sun's position in the belt of the Zodiac (منطقة البروج), which is inclined relative to us. The day lengthens when the Sun is in the higher mansions, wherever it may be, and the day shortens when the Sun is in the lower mansions, wherever it may be. We say \"wherever it may be\" because when the night is long for us, the day is long for others. Thus, the Sun is in the higher mansions relative to them and in the lower mansions relative to us. When the day shortens for us, the night lengthens for them, for the reason we mentioned. The Day itself is twenty-four hours; it neither increases nor decreases, nor lengthens nor shortens at the point of equilibrium. This is the reality of the Day. However, we sometimes call the daytime alone a \"day\" by convention. Understand this.\n\n### [Time and the Divine Concerns]\n\nGod made this Time (الزمان), which is Night and Day, a Day. Time is the Day, and Night and Day exist within Time. He made them father and mother for what He brings into existence within them, as He said: <<يُغْشِي اللَّيْلَ النَّهارَ>> (He covers the Day with the Night), similar to His saying concerning Adam: <<فَلَمَّا تَغَشَّاها حَمَلَتْ>> (And when he covered her, she conceived). If the Night covers the Day, the Night is the father and the Day is the mother, and everything God brings into existence during the Day is analogous to the children the woman bears. If the Day covers the Night, the Day is the father and the Night is the mother, and everything God brings into existence of the Divine Concerns (الشؤون) during the Night is analogous to the children the mother bears. We have clarified this section in our book *Kitab ash-Sha'n* (The Book of the Divine Concern), where we discussed His saying: <<كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (Every day He is in [a new] Divine Concern). God willing, a sufficient portion of the knowledge of the Days will come in this book if God reminds us of it. Likewise, He Almighty also said: <<يُولِجُ اللَّيْلَ فِي النَّهارِ وَيُولِجُ النَّهارَ فِي اللَّيْلِ>> (He causes the Night to enter into the Day, and He causes the Day to enter into the Night), adding clarification regarding the intercourse. And He, the Glorified, made clear by His saying: <<وَآيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهارَ>> (And a sign for them is the Night; We strip the Day from it), that the Night is a mother to it, and that the Day is generated from it, just as the newborn is stripped from its mother when it emerges, or the snake from its skin, appearing as an offspring in a world other than the world contained by the Night. The father is the Day we mentioned. We have clarified that in our book *Kitab az-Zaman wa Ma'rifat ad-Dahr* (The Book of Time and the Knowledge of Eternity). Thus, this Night and Day are fathers in one respect and mothers in another, and what God brings into existence within them in the world of the Elements (الأركان) of generated entities (المولدات) during their operation are called the children of Night and Day, as we have established.\n\n### [The Pyramids of Egypt were Built and the Vulture was in the Lion]\n\nWhen God originated the bodies of the entire world capable of formation, He made the region extending from the concave of the lowest heaven to the interior of the Earth the world of Nature (الطبيعة), transformations (الاستحالات), and the appearance of the entities that occur during transformations, and He made it analogous to the Mother. He made the region from the concave of the lowest celestial sphere to the end of the spheres analogous to the Father. He ordained mansions within it and adorned it with fixed and wandering lights (stars). The wandering stars traverse the fixed stars, and both the fixed and wandering stars traverse the encompassing sphere (الفلك المحيط) by the decree of the Almighty. The proof of this is that it was seen written in some of the pyramids in the land of Egypt, in a script mentioning the history of the pyramids, that they were built when the Vulture (constellation) was in the Lion (Leo). There is no doubt that it is now in Capricorn, as we perceive it. This indicates that the fixed stars traverse the Atlas Sphere of the Zodiac (فلك البروج الأطلس). God says concerning the Moon: <<وَالْقَمَرَ قَدَّرْناهُ مَنازِلَ>> (And the Moon, We have decreed for it mansions). And He said concerning the stars: <<كُلٌّ فِي فَلَكٍ يَسْبَحُونَ>> (All [celestial bodies] swim in an orbit). And He Almighty said: <<وَالشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَها>> (And the Sun runs to its fixed station). It has also been recited as *la mustaqarra laha* (it has no fixed station), and there is no contradiction between the two readings. Then He said: <<ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ>> (That is the decree of the Almighty, the All-Knowing). This relates to His saying concerning the Moon that He decreed mansions for it. And He said: <<لَا الشَّمْسُ يَنْبَغِي لَها أَنْ تُدْرِكَ الْقَمَرَ وَلَا اللَّيْلُ سابِقُ النَّهارِ وَكُلٌّ فِي فَلَكٍ يَسْبَحُونَ>> (It is not for the Sun to overtake the Moon, nor does the Night outstrip the Day. And all [celestial bodies] swim in an orbit), meaning in something circular.\n\n### [The Divine Command Descending Between Heaven and Earth]\n\nHe made for these lights, called stars (الكواكب), rays connected to the Elements (الأركان). Their connections to the Elements stand in the place of the marriage of the fathers to the mothers. Upon the connection of those luminous rays in the four Elements of the world of Nature (الطبيعة), God Almighty brings into existence what is formed within them, which we observe sensually. These Elements are analogous to the four wives in our Law. Just as a legal marriage is not lawful according to us except by a legal contract, so too did He <<أَوْحَى فِي كُلِّ سَماءٍ أَمْرَها>> (reveal in every heaven its command). From that revelation came the descent of the Command between them, as He Almighty said: <<يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ>> (The Command descends between them), meaning the Divine Command (الأمر الإلهي). In the exegesis of this descent are tremendous secrets that approach what we are alluding to in this chapter. It is narrated from Ibn Abbas that he said concerning this verse: \"If I were to explain it, you would say I am a disbeliever,\" and in another narration, \"you would stone me.\" It is one of the secrets of the verses of the Quran. He Almighty said: <<خَلَقَ سَبْعَ سَماواتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ>> (He created seven heavens and of the earth, their like). Then He said: <<يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ>> (The Command descends between them). Then He completed and clarified, saying: <<لِتَعْلَمُوا أَنَّ اللهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ>> (That you may know that Allah is over all things competent). This is what we alluded to with the quality of Action (صفة العمل) that we mentioned earlier, concerning God's origination of the quality of Knowledge and Action in the Second Father, for competence (القدرة) is for origination, which is Action. Then He completed the information by saying: <<وَأَنَّ اللهَ قَدْ أَحاطَ بِكُلِّ شَيْءٍ عِلْماً>> (And that Allah has encompassed all things in Knowledge). This is what we alluded to with the quality of Knowledge (صفة العلم) that God gave to the Second Father, who is the emanated Universal Soul (النفس الكلية). Thus, He, the Glorified, is the All-Knowing concerning what He brings into existence, the Competent to bring into existence what He wills to originate, with no barrier to Him. So He made the Command descend between the heaven and the earth, like the child appearing between the two parents.\n\n### [The Rays of the Stars and their Connection to the Four Elements]\n\nAs for the connection of the luminous stellar rays, resulting from the celestial spherical movement, to the four Elements—which are the mother of generated entities (المولدات)—occurring simultaneously for all of them, the Real made this an example for the Gnostics (العارفين) of the marriage of the people of Paradise to all their wives and concubines simultaneously (في الآن الواحد) with physical intercourse. These connections are sensible. Thus, the man in Paradise marries all those he possesses of wives and concubines simultaneously, if he desires it, with physical, sensible intercourse, involving penetration and the existence of a specific pleasure with every woman, without precedence or delay. This is the everlasting bliss and the Divine Power (الاقتدار الإلهي). The intellect is incapable of grasping this reality through its thought, but it is grasped by another Divine power in the heart of whomever He wills among His servants. Just as the Human in Paradise, in the market of forms, enters into any form he desires, as the Spirit (الروح) takes shape here with us, even though he is a body, God grants him this power over that. <<وَاللهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ>> (And Allah is over all things competent). The hadith of the market of Paradise was mentioned by Abu Isa al-Tirmidhi in his compilation, so look for it there. When the luminous rays connect to the four Elements, the generated entities appear from this marriage decreed by the Almighty, the All-Knowing. Thus, the generated entities exist between fathers, which are the celestial spheres and lights, and mothers, which are the terrestrial natural Elements. The rays connecting the lights to the Elements are like the marriage, and the movements of the spheres and the swimming of the lights are analogous to the movements of intercourse. The movements of the Elements are analogous to the labor pains (المخاض) of the woman for extracting the butter that emerges through churning, which is what appears of the generated entities in these Elements to the eye, in the form of minerals, plants, animals, jinn, and the human species. Glory be to the Competent over what He wills! There is no god but He, the Lord and Sovereign of everything.\n\n### [Gratitude to God and to the Parents from the Universal Station]\n\nGod Almighty said: <<أَنِ اشْكُرْ لِي وَلِوَالِدَيْكَ>> (Be grateful to Me and to your parents). It has become clear to you, O friend of God (ولي), who your fathers and mothers are, down to your nearest father—by whom your essence appeared—and your nearest mother, up to the First Father, who is the Highest Grandfather, and all the fathers and mothers between them. The gratitude that delights them and makes them rejoice in praise is that you attribute them to their Owner and Originator (مالكهم وموجدهم), and strip the act (الفعل) from them, attaching it to its rightful possessor, who is the Creator of all things. If you do this, you have brought joy to your parents by your action, and bringing this joy to them is the essence of your dutifulness and your gratitude to them. If you do not do this and forget God through them, you have neither thanked them nor fulfilled God's command regarding gratitude to them. For He said: <<أَنِ اشْكُرْ لِي>> (Be grateful to Me), placing Himself first to inform you that He is the First and Foremost Cause. Then He conjoined, saying: <<وَلِوَالِدَيْكَ>> (and to your parents), who are the secondary causes (الأسباب) through which God brought you into existence, so that you may attribute them to Him, the Glorified, and that they may have the virtue of precedence in existence over you, but not the virtue of influence (التأثير), because in reality, they have no influence, even though they are causes for the existence of effects. By this measure, the virtue is established for them, and gratitude is requested from you. The Real placed them for you and with you in His position regarding precedence over you, but not in influence, so that the praise for precedence and influence belongs to God Almighty, and the praise for precedence and cessation belongs to the parents, but according to the condition we stipulated: \"Do not associate anyone with the worship of your Lord.\" If you praise God Almighty and say, \"Our Lord and the Lord of our Celestial Fathers and our Terrestrial Mothers,\" there is no difference whether I say it or all the children of Adam say it. He did not address a specific person so that he should trace his fathers and mothers from Adam and Eve up to his time. Rather, the intention is this human generation. Thus, you are translating on behalf of every generated entity with this praise, from the world of the Elements, the world of Nature, and the Human. Then you ascend in representation on behalf of every entity generated between an agent (مؤثر) and a recipient (مؤثر فيه), praising Him with every tongue and turning toward Him with every face. The reward for us from God will then be from that Universal Station (المقام الكلي).\n\n### [The Complete Peace upon All Creatures]\n\nAs one of my Shaykhs told me: When you say, *As-Salamu 'alayna wa 'ala 'ibadillahis-salihin* (Peace be upon us and upon the righteous servants of God), or when you say *As-Salamu 'alaykum* (Peace be upon you) when greeting someone on your path, bring to your heart every righteous servant of God on earth and in heaven, dead and alive. For the response will come to you from that Station. No proximate angel or purified spirit who receives your salutation will fail to return it to you, and it is a supplication that is answered in your favor, so you succeed. As for those servants of God absorbed in His Majesty (المهيمين في جلاله), preoccupied with Him, and immersed in Him, whom your salutation does not reach, yet you have greeted them with this comprehensiveness—God responds on their behalf. This is sufficient honor for you, that the Real (الحق) greets you. Would that you heard none of those you greeted, so that the Real might respond on behalf of all of them, for He is more noble than you. God Almighty said, conferring honor upon John (Yahya), peace be upon him: <<وَسَلَامٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوتُ وَيَوْمَ يُبْعَثُ حَيًّا>> (And peace is upon him the day he was born and the day he dies and the day he is raised alive). This is a peace of supererogation (فضيلة) and information. How much greater is the peace that is obligatory, where the Real stands in the place of those who respond to it? The reward for obligatory duties (الفرائض) is greater than the reward for supererogatory acts (الفضائل) for the one concerning whom it was said: <<وَسَلَامٌ عَلَيْهِ يَوْمَ وُلِدَ>>. Thus, both virtues are combined for him. The prayer of God upon us has been reported as an initiation. What has reached me is whether the salutation has been reported as an initiation, as the prayer was, or not. Whoever narrates anything concerning this and verifies it, I have placed an obligation upon his neck to append it in this place, alongside the prayer of God upon us in this chapter, so that it may be good tidings for the believers and an honor for this book of mine. God is the Helper and the Granter of Success; there is no Lord but Him.\n\n### [The Natural Fathers and Natural Mothers]\n\nAs for the Natural Fathers and Natural Mothers, we have not mentioned them, so let us mention the universal principle concerning them. They are two fathers and two mothers. The two fathers are the agents (الفاعلان), and the two mothers are the recipients (المنفعلان). What results from them is the entity acted upon by them. Heat (الحرارة) and Coldness (البرودة) are the agents, and Moisture (الرطوبة) and Dryness (اليبوسة) are the recipients. Heat married Dryness, and they produced the element of Fire. Heat married Moisture, and they produced the element of Air. Then Coldness married Moisture, and they produced the element of Water. Coldness married Dryness, and they produced the element of Earth. Thus, the realities of the fathers and mothers were established in the sons. Fire was hot and dry; its heat was from the father and its dryness was from the mother. Air was hot and moist; its heat was from the father and its moisture was from the mother. Water was cold and moist; its coldness was from the father and its moisture was from the mother. Earth was cold and dry; its coldness was from the father and its dryness was from the mother. Heat and Coldness are from Knowledge (العلم), and Moisture and Dryness are from Will (الإرادة). This is the limit of their connection in their existence from Divine Knowledge, and what is generated from them is from Power (القدرة). Then procreation occurs within these Elements by virtue of their being mothers to the fathers of the Celestial Lights (الأنوار العلوية), not by virtue of their being fathers, even though fatherhood exists within them. We have informed you that fatherhood and sonship are matters of attribution and relation. The father is a son to a father who is a son to him, and the son is a father to a son who is a father to him. Look into the chapter on relations. God is the Granter of Success; there is no Lord but Him. Since Dryness was acted upon by Heat, and Moisture was acted upon by Coldness, we said that Moisture and Dryness are recipients (منفعلتان) and made them analogous to the mother for the Elements. Since Heat and Coldness are agents (فاعلين), we made them analogous to the father for the Elements. Since craftsmanship necessarily requires a craftsman, and the recipient inherently seeks the agent—for it is a recipient by its very essence, and if it were not a recipient by its essence, it would not accept the influence and the effect—it is influenced by the agent, unlike the agent, who acts by choice: if he wills, he acts, and is called an agent, and if he wills, he refrains, which is not the case for the recipient. Due to this reality, God Almighty mentioned, and this is from the eloquence and conciseness of the Quran: <<وَلَا رَطْبٍ وَلَا يَابِسٍ إِلَّا فِي كِتَابٍ مُبِينٍ>> (Nor anything moist nor anything dry, but that it is in a clear register). He mentioned the recipients (moist and dry) and did not mention \"nor hot nor cold,\" because Moisture and Dryness, according to scholars of Nature, seek Heat and Coldness, which are the agents acting upon them, just as the craft seeks the craftsman. Therefore, He mentioned them without mentioning the principle, even though all are in the Clear Register. God brought our master Muhammad (peace and blessings be upon him) with knowledge that no one else attained, as he said: \"I was taught the knowledge of the first and the last,\" in the hadith of the striking with the hand. Divine Knowledge (العلم الإلهي) is the origin of all knowledge, and to it all knowledge returns. We have fully covered what this chapter requires with the utmost conciseness and brevity, for the length in it would only be in mentioning the modalities (الكيفيات), but the principles (الأصول) we have mentioned and established. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).\n\nEnd of Part Twelve.",
    "ur": "## باب گیارہواں: ہمارے علوی آباء اور سفلی ماؤں کی معرفت میں\n\nمیں پاکیزہ ارواح کے آباء کا بیٹا ہوں، اور عنصری نفوس کی ماؤں کا۔\nروح اور جسم کے درمیان ہمارا ظہور ہوا، ایک ملاپ سے جو آغوش اور لذت پر مبنی تھا۔\nمیں کسی ایک سے نہیں تھا کہ اسے واحد مانوں، بلکہ آباء اور امہات کی ایک جماعت سے تھا۔\nاگر تم ان کی شان کو حقیقت میں دیکھو تو وہ ذات حق کے لیے ایسے ہیں جیسے کوئی کاریگر آلات سے چیزیں بناتا ہے۔\nچنانچہ، بڑھئی کی طرف کاریگری کی نسبت ایسی نہیں ہے (جیسے ذات حق کی طرف)، اسی طرح رب کائنات نے ہمیں وجود بخشا۔\nپس شخص اپنے موجد کی توحید میں سچا ہے، اور شخص علل (اسباب) کے اثبات میں بھی سچا ہے۔\nاگر تم آلات کی طرف دیکھو گے تو اسناد کا سلسلہ ہم سے ذات (الٰہی) تک لمبا ہو جائے گا۔\nاور اگر تم اس کی طرف دیکھو جو ہمیں وجود بخشتا ہے، تو ہم اس کی وحدت کے قائل ہوں گے، نہ کہ جماعتوں کے۔\nمیں توحید کی آنکھ سے یکتا اور منفرد پیدا ہوا، اور تمام لوگ علل (اسباب) کی اولاد ہیں۔\n\n### ابوت، امومت اور بنوت\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ چونکہ اس عالم کا مقصود انسان ہے اور وہی اس کا امام ہے، اس لیے ہم نے آباء اور امہات کی نسبت اسی کی طرف کی اور کہا: ہمارے علوی آباء (الآباء العلويات) اور ہماری سفلی مائیں (الأمهات السفليات)۔ پس ہر مؤثر (اثر ڈالنے والا) باپ ہے، اور ہر مؤثر فیہ (جس پر اثر ڈالا جائے) ماں ہے۔ یہی اس باب کا ضابطہ ہے۔ اور جو ان دونوں کے درمیان اس اثر سے پیدا ہوتا ہے، وہ بیٹا یا مولود کہلاتا ہے۔ اسی طرح علوم کی پیداوار میں معانی کا معاملہ بھی ایسا ہی ہے، جو دو مقدمات سے ہوتا ہے، جن میں سے ایک دوسرے سے اس مفرد واحد کے ذریعے نکاح کرتا ہے جو ان دونوں میں مکرر ہوتا ہے، اور وہی رابطہ (رابط) ہے، اور یہی نکاح ہے۔ اور جو نتیجہ ان دونوں کے درمیان صادر ہوتا ہے، وہی مطلوب ہوتا ہے۔ پس تمام ارواح آباء ہیں، اور طبیعت (الطبيعة) ماں ہے، کیونکہ وہ استحالات (الاستحالات) کا محل ہے۔ اور یہ ارواح ان ارکان (الأركان) کی طرف متوجہ ہوتی ہیں جو عناصر ہیں اور تبدیلی اور استحالت کو قبول کرنے والے ہیں۔ ان میں مولودات (المولدات) ظاہر ہوتی ہیں، اور وہ معدنیات، نباتات، حیوانات، جن اور انسان ہیں، جن میں انسان سب سے کامل ہے۔\n\n### چار عورتیں اور چار ارکان\n\nاسی طرح ہماری شریعت، جو کامل ترین شرائع ہے، آئی، کیونکہ وہ کلی حقائق (الحقائق الكلية) کے مطابق جاری ہوئی۔ چنانچہ اسے جوامع الکلم عطا کیے گئے اور اسے چار عورتوں تک محدود رکھا گیا، اور اس سے زیادہ کو نکاح کے طریقے پر حرام قرار دیا گیا جو عقد پر موقوف ہے۔ اس میں ملک یمین (لونڈی) شامل نہیں ہے۔ اور ملک یمین کو اس پانچویں امر کے مقابلے میں مباح قرار دیا گیا جس کی طرف بعض علماء گئے ہیں۔ اسی طرح عالم طبیعت (الطبيعة) کے ارکان (الأركان) بھی چار ہیں۔ اور عالم علوی کے ان چاروں سے نکاح کے ذریعے اللہ تعالیٰ ان میں پیدا ہونے والی چیزوں کو وجود بخشتا ہے۔ اور اس بارے میں چھ مذاہب میں اختلاف ہے۔ ایک گروہ نے یہ دعویٰ کیا کہ ان چاروں میں سے ہر ایک بذات خود اصل ہے۔ اور ایک گروہ نے کہا کہ رکنِ نار (آگ) اصل ہے۔ جو اس سے کثیف ہوا وہ ہوا بنا، اور جو ہوا سے کثیف ہوا وہ پانی بنا، اور جو پانی سے کثیف ہوا وہ مٹی (تراب) بنا۔ اور ایک گروہ نے کہا کہ رکنِ ہوا اصل ہے، جو اس سے لطیف ہوا وہ آگ بنا، اور جو کثیف ہوا وہ پانی بنا۔ اور ایک گروہ نے کہا کہ رکنِ ماء (پانی) اصل ہے۔ اور ایک گروہ نے کہا کہ رکنِ تراب (مٹی) اصل ہے۔ اور ایک گروہ نے کہا کہ اصل ایک پانچواں امر ہے جو ان چاروں میں سے کوئی نہیں ہے۔ اور یہی وہ ہے جسے ہم نے ملک یمین کے درجے میں رکھا ہے۔ پس ہماری شریعت نے نکاح میں کامل ترین مذاہب کو شامل کیا تاکہ اس میں تمام مذاہب شامل ہو جائیں۔\n\n### پانچویں اصل کا نظریہ\n\nاور یہ پانچویں اصل کا مذہب ہمارے نزدیک صحیح ہے، اور اسے طبیعت (الطبيعة) کہا جاتا ہے۔ کیونکہ طبیعت ایک واحد معقول (واحد تصور) ہے جس سے رکنِ نار اور تمام ارکان ظاہر ہوئے۔ چنانچہ کہا جاتا ہے کہ رکنِ نار طبیعت سے ہے، لیکن وہ عین طبیعت نہیں ہے۔ اور یہ درست نہیں ہو سکتا کہ مجموعہ جو کہ چاروں کا عین ہے (طبیعت ہو)، کیونکہ بعض ارکان دوسرے سے کلی طور پر متنافر (مخالف) ہیں، اور بعض دوسرے سے ایک امر میں متنافر ہیں۔ جیسے آگ اور پانی تمام وجوہ سے متنافر ہیں، اور ہوا اور مٹی بھی اسی طرح۔ اسی لیے اللہ تعالیٰ نے استحالات (تبدیلیوں) کی خاطر انہیں وجود میں ایک حکیمانہ ترتیب سے رکھا۔ اگر متنافر کو اپنے متنافر کے ساتھ ملا دیا جاتا تو وہ اس کی طرف تبدیل نہ ہو پاتا اور حکمت معطل ہو جاتی۔ چنانچہ ہوا کو رکنِ نار کے ساتھ ملحق کیا گیا، اور ان دونوں میں جامع حرارت (گرمی) ہے۔ اور پانی کو ہوا کے ساتھ ملحق کیا گیا، اور ان دونوں میں جامع رطوبت (نمی) ہے۔ اور مٹی کو پانی کے ساتھ ملحق کیا گیا، اور ان دونوں میں جامع برودت (سردی) ہے۔ پس محیل (تبدیل کرنے والا) باپ ہے، اور مستحیل (تبدیل ہونے والا) ماں ہے، اور استحالت (الاستحالة) نکاح ہے، اور جو اس کی طرف تبدیل ہوا وہ بیٹا ہے۔ پس متکلم (بولنے والا) باپ ہے، اور سامع (سننے والا) ماں ہے، اور کلام نکاح ہے، اور سامع کی سمجھ میں جو کچھ اس سے وجود میں آیا وہ بیٹا ہے۔ اسی سے متکلم کا یہ قول سمجھا جاتا ہے کہ وہ کسی شخص سے کہتا ہے: \"قم\" (کھڑا ہو جا)، اور وہ قیام کے ارادے سے لفظ \"قم\" کے اثر سے کھڑا ہو جاتا ہے۔ اگر سامع کھڑا نہ ہو، جو بلاشبہ ماں ہے، تو وہ بانجھ ہے، اور اگر وہ بانجھ ہے تو اس حالت میں وہ ماں نہیں ہے۔\n\n### پہلا باپ، پہلی ماں، پہلا نکاح\n\nاور یہ باب صرف ماؤں سے متعلق ہے۔ پس علوی آباء میں سے پہلا معلوم ہے، اور سفلی ماؤں میں سے پہلی معدوم ممکن (شیئیت) ہے۔ اور پہلا نکاح امر کے ذریعے قصد کرنا ہے، اور پہلا بیٹا اس شیئیت کا وجود ہے جس کا ہم نے ذکر کیا۔ پس یہ باپ ابوت (الأبوة) میں جاری ہے، اور وہ ماں امومت (الأمومة) میں جاری ہے، اور وہ نکاح ہر چیز میں جاری ہے، اور نتیجہ ہر ظاہر العین کے حق میں دائمی ہے جو منقطع نہیں ہوتا۔ پس اسے ہمارے نزدیک نکاح ساری (ہر چیز میں جاری ہونے والا نکاح) کہا جاتا ہے۔ اللہ تعالیٰ ہمارے اس قول کی دلیل میں فرماتا ہے:\n**إِنَّما قَوْلُنا لِشَيْءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ**\n(ہم جب کسی چیز کا ارادہ کرتے ہیں تو ہمارا کہنا بس یہی ہوتا ہے کہ ہم اسے کہتے ہیں: \"ہو جا\"، تو وہ ہو جاتی ہے۔)\nاور اس بارے میں ہماری ایک شریف کتاب ہے جو محفوظ ہے، جس میں بصیر بھی اندھا ہو جاتا ہے، تو اس کا کیا حال ہو گا جس میں اندھا پن حلول کر چکا ہو۔ اگر تم اس مقام کی تفصیل اور ان الٰہی اسماءِ اعلام (نشانات) کے توجہات کو دیکھتے تو ایک عظیم امر دیکھتے اور ایک ہولناک اور بڑا مقام مشاہدہ کرتے۔ پس اللہ اور اس کے خوبصورت صنع (کاریگری) کے ذریعے عارفین پاکیزہ ہو گئے۔\n\n### عقل کلی اور نفس کلی\n\nاور اس کے بعد کہ میں نے آپ کی گہری سمجھ اور درست نظر کی طرف پہلے جاری باپ (الأب الأول الساري) کے ذریعے اشارہ کیا، جو اسم جامع اعظم (الاسم الجامع الأعظم) ہے، جس کی پیروی تمام اسماء اس کے رفع، نصب اور خفض میں کرتے ہیں، جس کا حکم جاری ہے، اور پہلی آخری ماں (الأم الأولية الآخرية) جو تمام بیٹوں میں انوثت (مادگی) کی نسبت میں جاری ہے، تو اب ہم ان آباء کا ذکر شروع کرتے ہیں جو وضع الٰہی کے ذریعے مقرر کردہ اسباب ہیں، اور ان ماؤں کا اور ان کا معنوی اور حسی نکاح کے ذریعے اتصال، جو مشروع ہے، تاکہ بیٹے حلال بیٹے ہوں، یہاں تک کہ میں انسانی تناسل تک پہنچوں، جو تکوین کی آخری نوع ہے اور قصد کے ذریعے متعین ہونے والا پہلا مبدع ہے۔\nپس ہم کہتے ہیں کہ عقل اول (العقل الأول) جو پہلی مبدع مخلوق ہے، اور وہ قلم اعلیٰ (القلم الأعلى) ہے، اور اس کے سوا کوئی محدث نہیں تھا۔ اور وہ اس میں مؤثر تھا جس کو اللہ نے اس میں لوح محفوظ (اللوح المحفوظ) کے اس سے ابعاث (پیدا ہونے) کے ذریعے پیدا کیا، جیسے اجسام کے عالم میں حوا کا آدم سے ابعاث ہوا، تاکہ وہ لوح اس کے لیے جگہ اور محل بنے جو یہ قلم اعلیٰ الٰہی اس میں لکھتا ہے، اور ان حروف کی تخطیط جو ان چیزوں پر دلالت کے لیے مقرر کیے گئے ہیں جن پر ذات حق تعالیٰ نے انہیں دلائل بنایا ہے۔ پس لوح محفوظ پہلا ابعاثی موجود تھا۔ اور شریعت میں وارد ہے کہ اللہ نے سب سے پہلے قلم کو پیدا کیا، پھر لوح کو پیدا کیا، اور قلم سے کہا: \"لکھو۔\" قلم نے کہا: \"میں کیا لکھوں؟\" اللہ نے اس سے کہا: \"لکھو، اور میں تم پر املا کروں گا۔\" پس قلم نے لوح میں وہ سب کچھ لکھا جو ذات حق اس پر املا کرتا تھا، اور وہ اس کی مخلوق کے بارے میں اس کا علم ہے جو قیامت تک پیدا ہو گی۔\n\n### قلم اور لوح کے درمیان معنوی نکاح\n\nپس قلم اور لوح کے درمیان ایک معنوی اور معقول نکاح تھا، اور ایک حسی اور مشہود اثر تھا۔ اور اسی وجہ سے ہمارے نزدیک مرقوم حروف کے ساتھ عمل ہوتا ہے۔ اور جو اثر لوح میں ودیعت کیا گیا، وہ اس بہتے ہوئے پانی کی طرح ہے جو عورت کے رحم میں ہوتا ہے، اور جو معانی ان جسمانی حروف میں ودیعت کیے گئے ہیں اور اس کتابت سے ظاہر ہوئے ہیں، وہ اولاد کی ارواح کے مانند ہیں جو ان کے اجسام میں ودیعت کی گئی ہیں۔ پس سمجھو، اور اللہ **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق کہتا ہے اور وہی سیدھا راستہ دکھاتا ہے)۔\nاور حق نے اس لوح میں، جو اللہ کی طرف سے وحی کردہ چیزوں کو سمجھنے والا ہے، اس کی حمد کے ساتھ تسبیح کرنے والا بنایا، جس کی تسبیح کو صرف وہی سمجھتا ہے جسے اللہ نے اس کی خبر دی ہو اور اس کے کان کو اس کے لیے کھول دیا ہو جو وہ وارد کرتا ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم اور آپ کے صحابہ میں سے حاضرین کے کان کو آپ کے پاکیزہ اور طیب ہاتھ میں کنکریوں کی تسبیح کو سمجھنے کے لیے کھولا گیا۔ اور ہم نے یہ اس لیے کہا کہ اس کے کان کو کھولا گیا، کیونکہ کنکریاں جب سے اللہ نے انہیں پیدا کیا ہے، اپنے موجد کی حمد کے ساتھ تسبیح کرتی رہی ہیں۔ پس خرقِ عادت (معجزہ) ادراکِ سمعی میں تھا، نہ کہ کنکریوں میں۔\nپھر اللہ نے اس میں دو صفات پیدا کیں: ایک علم کی صفت اور ایک عمل کی صفت۔ صفتِ عمل کے ذریعے عالم کی صورتیں اس سے ظاہر ہوتی ہیں، جیسے بڑھئی کے کام کے وقت تابوت کی صورت آنکھ کے سامنے ظاہر ہوتی ہے۔ پس اس کے ذریعے وہ صورتیں عطا کرتا ہے۔ اور صورتیں دو قسم کی ہیں: ظاہری حسی صورتیں، اور وہ اجسام ہیں اور جو ان سے حسی طور پر متصل ہیں، جیسے اشکال، رنگ اور اکوان (وجودات)۔ اور باطنی معنوی صورتیں جو محسوس نہیں ہیں، اور وہ وہ علوم، معارف اور ارادات ہیں جو ان میں ہیں۔ اور ان دو صفات کے ذریعے وہ صورتیں ظاہر ہوئیں جن کا ہم نے ذکر کیا۔ پس صفتِ علامہ (علم والی صفت) باپ ہے، کیونکہ وہ مؤثر ہے، اور صفتِ عاملہ (عمل کرنے والی صفت) ماں ہے، کیونکہ وہ مؤثر فیہ ہے، اور اس سے وہ صورتیں ظاہر ہوئیں جن کا ہم نے ذکر کیا۔\nکیونکہ اگر کوئی ماہر بڑھئی عالم ہو لیکن کام کرنا نہ جانتا ہو، تو وہ اپنا علم اس شخص کے کان پر ڈالتا ہے جو بڑھئی کا کام جانتا ہے۔ اور یہ القاء (ڈالنا) نکاح ہے۔ پس مہندس کا کلام باپ ہے، اور سامع کا قبول کرنا ماں ہے۔ پھر سامع کا علم باپ بن جاتا ہے اور اس کے جوارح (اعضاء) ماں بن جاتے ہیں۔ اور اگر تم چاہو تو کہو کہ مہندس باپ ہے، اور کاریگر جو کہ بڑھئی ہے، ماں ہے، اس لحاظ سے کہ وہ مہندس کی طرف سے القاء کردہ چیز کو سنتا ہے۔ پس جب اس نے اس پر اثر ڈالا، تو اس نے اپنی قوت میں موجود چیز کو بڑھئی کے نفس میں اتارا۔ اور وہ صورت جو بڑھئی کے باطن میں مہندس کے القاء سے ظاہر ہوئی اور اس کے وجودِ خیال میں قائم اور ظاہر ہوئی، وہ اس بچے کے مانند ہے جو اس کے لیے پیدا ہوا، جسے اس نے مہندس سے سمجھا۔ پھر بڑھئی کا عمل ہوتا ہے، پس وہ لکڑی میں باپ ہے، جو کہ بڑھئی کے کام کی ماں ہے، ان آلات کے ذریعے جن سے نکاح واقع ہوتا ہے، اور پانی کا اتارنا جو کہ کدال کی ہر ضرب یا آری کے ہر کاٹنے کا اثر ہے، اور تصویر بنانے کے لیے تراشی ہوئی لکڑیوں میں ہر کاٹنا، الگ کرنا اور جوڑنا۔ پس تابوت ظاہر ہوا، جو کہ محسوس ہونے والے مولود بچے کے مانند ہے۔ پس حقائق کو آباء، امہات اور ابناء کی ترتیب میں اور پیداوار کے طریقے کو اسی طرح سمجھو۔\nپس ہر باپ جس کے پاس صفتِ عمل نہ ہو، وہ اس لحاظ سے باپ نہیں ہے، یہاں تک کہ اگر وہ عالم ہو اور کلام یا اشارے کے ذریعے ایصال کا آلہ روک دے تاکہ تفہیم واقع ہو، اور وہ خود عامل نہ ہو، تو وہ تمام وجوہ سے باپ نہیں ہو گا، بلکہ ماں ہو گا اس علم کے لحاظ سے جو اس کے نفس میں حاصل ہوا، سوائے اس کے کہ جنین (بچہ) میں اس کی ماں کے پیٹ میں روح نہ ڈالی گئی ہو، یا وہ اپنی ماں کے پیٹ میں مر گیا ہو، اور ماں کی طبیعت نے اسے تحلیل کر دیا ہو یہاں تک کہ وہ تصرف ہو گیا اور اس کا کوئی وجود ظاہر نہ ہوا۔ پس سمجھو۔\n\n### طبیعت کلیہ اور ہباء\n\nاور جب آپ نے ممکنات میں سے دوسرے باپ کو جان لیا، اور یہ کہ وہ قلم اعلیٰ کے لیے دوسری ماں تھی، تو اس اقدس روحانی القاء سے جو اس پر ڈالا گیا، وہ طبیعت (الطبيعة) اور ہباء (الہباء) تھا۔ پس یہ پہلی ماں تھی جس نے جڑواں بچوں کو جنم دیا۔ سب سے پہلے اس نے طبیعت کو ڈالا، پھر اس کے بعد ہباء کو۔ پس طبیعت اور ہباء ایک باپ اور ایک ماں کے بھائی بہن ہیں۔ پھر طبیعت نے ہباء سے نکاح کیا، تو ان دونوں کے درمیان جسم کلی (الجسم الكلي) کی صورت پیدا ہوئی، اور یہ پہلا جسم تھا جو ظاہر ہوا۔ پس طبیعت باپ تھی، کیونکہ اس کا اثر تھا، اور ہباء ماں تھی، کیونکہ اس میں اثر ظاہر ہوا، اور نتیجہ جسم تھا۔ پھر علم میں توالد (نسل در نسل پیدائش) ایک مخصوص ترتیب پر مٹی (تراب) تک اترا، جس کا ذکر ہم نے اپنی کتاب \"عقلۃ المستوفز\" میں کیا ہے، اور اس میں طوالت ہے جو اس باب میں سما نہیں سکتی، کیونکہ مقصد اختصار ہے۔\n\n### مرکز کا نظریہ اور ارکان کے اختتام کا نظریہ\n\nاور ہم مرکز (المرکز) کے قائل نہیں ہیں، بلکہ ہم ارکان کے اختتام (نهاية الأركان) کے قائل ہیں، اور یہ کہ اعظم (بڑا) اصغر (چھوٹے) کو اپنی طرف کھینچتا ہے۔ اسی لیے ہم دیکھتے ہیں کہ بخارات اور آگ بلندی کی طلب کرتے ہیں، اور پتھر اور اس جیسی چیزیں پستی کی طلب کرتی ہیں۔ پس جہات مختلف ہو گئیں، اور یہ بلندی اور پستی کے طالب دونوں کی استقامت پر ہے۔ کیونکہ مرکز کا قائل کہتا ہے کہ یہ ایک معقول اور لطیف امر ہے جسے ارکان طلب کرتے ہیں، اور اگر مٹی نہ ہوتی تو پانی اس کے گرد گھومتا، اور اگر پانی نہ ہوتا تو ہوا اس کے گرد گھومتی، اور اگر ہوا نہ ہوتی تو آگ اس کے گرد گھومتی۔ اگر ایسا ہوتا جیسا کہ اس نے کہا، تو ہم بخارات کو پستی کی طلب کرتے ہوئے دیکھتے، جبکہ حس اس کے خلاف گواہی دیتی ہے۔\nاور ہم نے اس فصل کو اپنی کتاب \"المرکز\" میں بیان کیا ہے، جو ایک لطیف جز ہے۔ اور جب ہم اسے اپنی بعض کتابوں میں ذکر کرتے ہیں، تو ہم اسے کرہ (گولے) کے نقطے کی مثال کے طور پر لاتے ہیں، جس سے محیط پیدا ہوتا ہے، کیونکہ اس میں ہمارے لیے الٰہی معارف (المعارف الإلهية) اور نسبتوں سے متعلق ایک غرض ہے، اس لیے کہ نقطے سے محیط کی طرف نکلنے والی لکیریں مساوی ہوتی ہیں تاکہ نسبتیں برابر ہوں، تاکہ وہاں کوئی تفاضل (برتری) واقع نہ ہو، کیونکہ اگر تفاضل واقع ہو تو یہ مفضول (کم تر) کی کمی کا باعث بنے گا، اور معاملہ ایسا نہیں ہے۔ اور ہم نے اسے عنصر اعظم (الأعظم) کا محل بنایا ہے، اس تنبیہ کے لیے کہ اعظم اقل (کم تر) پر حکم کرتا ہے۔ اور ہم نے اسے \"عقلۃ المستوفز\" میں اشارے کے طور پر ذکر کیا ہے۔\n\n### علوی افلاک کا دورہ\n\nاور جب اللہ تعالیٰ نے ان علوی افلاک (الأفلاك العلوية) کو گردش دی، اور پہلے فلک کے ذریعے ایام کو وجود بخشا، اور اسے دوسرے فلک کے ذریعے متعین کیا جس میں آنکھوں کے لیے ثابت ستارے ہیں، پھر ارکان کو مٹی، پانی، ہوا اور آگ کے طور پر وجود بخشا، پھر سات آسمانوں کو تہ بہ تہ برابر کیا اور انہیں پھاڑ دیا، یعنی ہر آسمان کو الگ کر دیا، جب کہ وہ پہلے رتق (بند) تھے کیونکہ وہ دھواں تھے، اور زمین کو سات زمینوں میں پھاڑ دیا، پہلی زمین کے لیے پہلا آسمان، اور دوسری کے لیے دوسرا، یہاں تک کہ سات۔ اور اس نے پانچ خنس (چھپ جانے والے) سیاروں کو پیدا کیا، ہر آسمان میں ایک ستارہ، اور چاند کو پیدا کیا، اور سورج کو بھی پیدا کیا۔ پس سورج کی تخلیق سے دن میں رات اور دن پیدا ہوئے، حالانکہ دن پہلے سے موجود تھا۔ پس اس نے اس دن کا نصف اہل زمین کے لیے دن بنایا، اور وہ سورج کے طلوع سے غروب تک ہے، اور اس کا دوسرا نصف رات بنایا، اور وہ سورج کے غروب سے طلوع تک ہے۔ اور دن مجموعے کا نام ہے۔ اسی لیے **خَلَقَ السَّماواتِ والْأَرْضَ وما بَيْنَهُما في سِتَّةِ أَيَّامٍ** (اس نے آسمانوں اور زمین کو اور جو کچھ ان کے درمیان ہے چھ دنوں میں پیدا کیا)۔ کیونکہ ایام فلکِ بروج کی حرکت کے وجود سے موجود تھے، اور وہ ہمارے ہاں معروف ایام ہیں، اور کچھ نہیں۔ پس اللہ نے یہ نہیں کہا کہ اس نے عرش اور کرسی کو پیدا کیا، بلکہ کہا: **خَلَقَ السَّماواتِ والْأَرْضَ في سِتَّةِ أَيَّامٍ** (اس نے آسمانوں اور زمین کو چھ دنوں میں پیدا کیا)۔ پس جب فلکِ بروج ایک بار گردش کرتا ہے، تو وہی دن ہے جس میں اللہ نے آسمانوں اور زمین کو پیدا کیا۔ پھر اللہ نے سورج کے وجود کے وقت رات اور دن کو پیدا کیا، نہ کہ ایام کو۔\nاور جہاں تک ان میں ہونے والے اضافے اور کمی کا تعلق ہے، یعنی رات اور دن میں، نہ کہ گھنٹوں میں، کیونکہ وہ چوبیس گھنٹے ہیں، تو یہ سورج کے منطقہ البروج (زودیاک) میں حلول کرنے کی وجہ سے ہے، جو ہمارے لیے مائل ہے، اس میں جھکاؤ ہے۔ پس جب سورج بلند منازل میں ہوتا ہے تو دن لمبا ہو جاتا ہے، جہاں بھی وہ ہو۔ اور جب سورج نچلی منازل میں حلول کرتا ہے تو دن چھوٹا ہو جاتا ہے، جہاں بھی وہ ہو۔ اور ہم نے \"جہاں بھی وہ ہو\" اس لیے کہا کہ جب ہمارے ہاں رات لمبی ہوتی ہے تو دوسروں کے ہاں دن لمبا ہوتا ہے۔ پس سورج ان کے لحاظ سے بلند منازل میں ہوتا ہے اور ہمارے لحاظ سے نچلی منازل میں۔ پس جب ہمارے ہاں دن چھوٹا ہوتا ہے تو ان کے ہاں رات لمبی ہوتی ہے، جیسا کہ ہم نے ذکر کیا۔ اور دن وہی دن ہے، چوبیس گھنٹے، نہ بڑھتا ہے اور نہ گھٹتا ہے، اور نہ اعتدال کی جگہ پر لمبا ہوتا ہے اور نہ چھوٹا ہوتا ہے۔ پس یہ دن کی حقیقت ہے۔ پھر ہم اصطلاح کے حکم سے صرف دن کو بھی دن کہہ دیتے ہیں۔ پس سمجھو۔\n\n### زمان اور شؤون الٰہیہ\n\nاور اللہ تعالیٰ نے اس زمان (الزمان) کو، جو کہ رات اور دن ہے، دن بنایا، اور زمان ہی دن ہے۔ اور رات اور دن زمان میں موجود ہیں، اللہ نے انہیں باپ اور ماں بنایا اس کے لیے جو کچھ وہ ان میں پیدا کرتا ہے، جیسا کہ اس نے فرمایا: **يُغْشِي اللَّيْلَ النَّهارَ** (رات دن کو ڈھانپ لیتی ہے)، جیسے اس کا قول آدم کے بارے میں ہے: **فَلَمَّا تَغَشَّاها حَمَلَتْ** (پس جب اس نے اسے ڈھانپا تو وہ حاملہ ہو گئی)۔ پس جب رات دن کو ڈھانپتی ہے، تو رات باپ ہوتی ہے اور دن ماں ہوتا ہے، اور جو کچھ اللہ دن میں پیدا کرتا ہے وہ اس اولاد کے مانند ہوتا ہے جسے عورت جنم دیتی ہے۔ اور جب دن رات کو ڈھانپتا ہے، تو دن باپ ہوتا ہے اور رات ماں ہوتی ہے، اور جو کچھ اللہ رات میں شؤون (امور) پیدا کرتا ہے وہ اس اولاد کے مانند ہوتا ہے جسے ماں جنم دیتی ہے۔ اور ہم نے اس فصل کو اپنی کتاب \"الشأن\" میں بیان کیا ہے، جس میں ہم نے اللہ تعالیٰ کے اس قول پر کلام کیا ہے: **كُلَّ يَوْمٍ هُوَ في شَأْنٍ** (وہ ہر دن ایک نئی شان میں ہوتا ہے)۔ اور اگر اللہ نے ہمیں اس کتاب میں ایام کی معرفت کا شافی حصہ یاد دلایا تو ان شاء اللہ وہ آئے گا۔\nاسی طرح اللہ تعالیٰ نے یہ بھی فرمایا: **يُولِجُ اللَّيْلَ في النَّهارِ ويُولِجُ النَّهارَ في اللَّيْلِ** (وہ رات کو دن میں داخل کرتا ہے اور دن کو رات میں داخل کرتا ہے)۔ پس اس نے نکاح میں مزید وضاحت کی۔ اور اس نے اپنے قول سے واضح کیا: **وآيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهارَ** (اور ان کے لیے ایک نشانی رات ہے، ہم اس سے دن کو کھینچ نکالتے ہیں) کہ رات اس کے لیے ماں ہے، اور دن اس سے پیدا ہوتا ہے، جیسے مولود اپنی ماں سے نکلتا ہے، اور سانپ اپنی کھال سے نکلتا ہے، پس وہ ایک دوسرے عالم میں مولود کی صورت میں ظاہر ہوتا ہے جو اس عالم سے مختلف ہے جسے رات گھیرے ہوئے ہے۔ اور باپ وہ دن ہے جس کا ہم نے ذکر کیا۔ اور ہم نے اسے اپنی کتاب \"الزمان\" اور \"معرفۃ الدھر\" میں بیان کیا ہے۔ پس یہ رات اور دن ایک لحاظ سے باپ ہیں اور ایک لحاظ سے مائیں، اور جو کچھ اللہ ان میں ارکان کے عالم میں ان کے تصرف کے وقت مولودات (المولدات) پیدا کرتا ہے، انہیں رات اور دن کی اولاد کہا جاتا ہے، جیسا کہ ہم نے مقرر کیا۔\n\n### مصر کے اہرام بنائے گئے اور نسر اسد میں تھا\n\nاور جب اللہ تعالیٰ نے عالم کے تمام اجسام کو پیدا کیا جو تکوین (پیدائش) کو قبول کرنے والے ہیں، تو اس نے آسمان دنیا کے مقعر (اندرونی سطح) سے لے کر زمین کے باطن تک کے حد کو عالمِ طبیعت (عالم الطبيعة) اور استحالات (تبدیلیوں) اور ان اعیان (وجودات) کے ظہور کا عالم بنایا جو استحالات کے وقت پیدا ہوتے ہیں، اور اسے ماں کے درجے میں رکھا۔ اور آسمان دنیا کے مقعر سے لے کر آخری افلاک تک کے حد کو باپ کے درجے میں رکھا، اور اس میں منازل مقرر کیں اور اسے ثابت اور تیرتے ہوئے انوار (ستاروں) سے مزین کیا۔ پس تیرتے ہوئے (سیارے) ثابت (ستاروں) میں قطع کرتے ہیں، اور ثابت اور تیرتے ہوئے (دونوں) فلکِ محیط میں عزیز (اللہ) کی تقدیر سے قطع کرتے ہیں۔ اس کی دلیل یہ ہے کہ مصر کے بعض اہرام پر ایک قلم سے لکھا ہوا دیکھا گیا جس میں اہرام کی تاریخ کا ذکر ہے کہ وہ اس وقت بنائے گئے جب نسر (عقاب) اسد (شیر) میں تھا۔ اور بلاشبہ اب ہم اسے جدی (بکری) میں پاتے ہیں۔ پس اس سے معلوم ہوا کہ ثابت ستارے فلکِ بروجِ اطلس میں قطع کرتے ہیں۔\nاور اللہ تعالیٰ چاند کے بارے میں فرماتا ہے: **والْقَمَرَ قَدَّرْناهُ مَنازِلَ** (اور ہم نے چاند کے لیے منزلیں مقرر کیں)۔ اور ستاروں کے بارے میں فرمایا: **كُلٌّ في فَلَكٍ يَسْبَحُونَ** (ہر ایک اپنے مدار میں تیر رہا ہے)۔ اور اللہ تعالیٰ نے فرمایا: **والشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَها** (اور سورج اپنے ٹھکانے کی طرف چل رہا ہے)۔ اور اسے \"لا مستقر لها\" (اس کا کوئی ٹھکانہ نہیں) بھی پڑھا گیا ہے، اور دونوں قرأتوں میں کوئی تنافر (تضاد) نہیں ہے۔ پھر فرمایا: **ذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ** (یہ غالب، جاننے والے کی تقدیر ہے)۔ یہ اس کے قول کی طرف اشارہ ہے کہ اس نے چاند کے لیے منزلیں مقرر کیں۔ اور فرمایا: **لا الشَّمْسُ يَنْبَغِي لَها أَنْ تُدْرِكَ الْقَمَرَ ولا اللَّيْلُ سابِقُ النَّهارِ وكُلٌّ في فَلَكٍ يَسْبَحُونَ** (نہ سورج کے لیے یہ مناسب ہے کہ وہ چاند کو جا پکڑے اور نہ رات دن سے آگے نکل سکتی ہے، اور ہر ایک اپنے مدار میں تیر رہا ہے) یعنی ایک گول چیز میں۔\n\n### امر الٰہی جو آسمان اور زمین کے درمیان نازل ہوتا ہے\n\nاور اللہ نے ان انوار کو، جنہیں کواکب (ستارے) کہا جاتا ہے، ارکان سے متصل شعاعیں عطا کیں، جن کا اتصال ارکان سے آباء کے امہات سے نکاح کے مقام پر قائم ہوتا ہے۔ پس اللہ تعالیٰ ان نوری شعاعوں کے عالمِ طبیعت کے چار ارکان میں متصل ہونے پر وہ چیزیں پیدا کرتا ہے جو ان میں وجود میں آتی ہیں، جنہیں ہم حسی طور پر دیکھتے ہیں۔ پس یہ ارکان ہمارے شرع میں چار عورتوں کے مانند ہیں۔ اور جس طرح ہمارے ہاں شرعی نکاح حلال نہیں ہوتا مگر شرعی عقد کے ذریعے، اسی طرح **أَوْحى‏ في كُلِّ سَماءٍ أَمْرَها** (اس نے ہر آسمان میں اس کا امر وحی کیا)۔ پس اس وحی سے ان کے درمیان امر کا نزول ہوا، جیسا کہ اللہ تعالیٰ نے فرمایا: **يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ** (امر ان کے درمیان نازل ہوتا ہے) یعنی امر الٰہی۔ اور اس نزول کی تفسیر میں عظیم اسرار ہیں جو اس کے قریب ہیں جس کی طرف ہم اس باب میں اشارہ کر رہے ہیں۔\nاور ابن عباس رضی اللہ عنہ سے روایت ہے کہ انہوں نے اس آیت کے بارے میں فرمایا: \"اگر میں اس کی تفسیر کروں تو تم کہو گے کہ میں کافر ہوں، اور ایک روایت میں ہے کہ تم مجھے سنگسار کر دو گے۔\" اور یہ قرآن کی آیات کے اسرار میں سے ہے۔ اللہ تعالیٰ نے فرمایا: **خَلَقَ سَبْعَ سَماواتٍ ومن الْأَرْضِ مِثْلَهُنَّ** (اس نے سات آسمان پیدا کیے اور زمین میں سے بھی ان کے مانند)۔ پھر فرمایا: **يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ** (امر ان کے درمیان نازل ہوتا ہے)۔ پھر تکمیل کرتے ہوئے واضح فرمایا: **لِتَعْلَمُوا أَنَّ الله عَلى‏ كُلِّ شَيْءٍ قَدِيرٌ** (تاکہ تم جان لو کہ اللہ ہر چیز پر قادر ہے)۔ اور یہی وہ ہے جس کی طرف ہم نے صفتِ عمل کے ذریعے اشارہ کیا جو ہم نے ابھی دوسرے باپ میں اللہ کے علم اور عمل کی صفت پیدا کرنے کے بارے میں ذکر کیا۔ کیونکہ قدرت ایجاد کے لیے ہے، اور وہ عمل ہے۔ پھر خبر میں تکمیل کرتے ہوئے فرمایا: **وإن الله قد أَحاطَ بِكُلِّ شَيْءٍ عِلْماً** (اور بلاشبہ اللہ نے ہر چیز کو علم سے گھیر رکھا ہے)۔ اور ہم نے اس کی طرف صفتِ علم کے ذریعے اشارہ کیا جو اللہ نے دوسرے باپ کو عطا کی، جو کہ نفس کلیہ (النفس الكلية) ہے جو ابعاث ہوا ہے۔ پس وہ سبحانہ علیم ہے اس کے بارے میں جو وہ وجود بخشتا ہے، اور قدیر ہے اس چیز کو وجود بخشنے پر جس کا وہ ارادہ کرتا ہے، اسے کوئی روکنے والا نہیں۔ پس اس نے امر کو آسمان اور زمین کے درمیان نازل کیا، جیسے اولاد والدین کے درمیان ظاہر ہوتی ہے۔\n\n### کواکب کی شعاعیں اور چار ارکان سے ان کا اتصال\n\nاور جہاں تک فلکی آسمانی حرکت سے کواکبی نوری شعاعوں کا چار ارکان سے اتصال کا تعلق ہے، جو مولودات کی ماں ہیں، ایک ہی وقت میں سب کے لیے، حق نے اسے عارفین کے لیے جنت میں اہل جنت کے تمام بیویوں اور لونڈیوں سے ایک ہی لمحے میں حسی نکاح کرنے کی مثال بنایا، جیسا کہ یہ اتصالات حسی ہیں۔ پس جنتی مرد جنت میں اپنی تمام منکوحات سے ایک ہی لمحے میں جسمانی، محسوس نکاح کرتا ہے، جب وہ اس کی خواہش کرتا ہے، ایلاج کے ساتھ اور ہر عورت کے ساتھ خاص لذت کے وجود کے ساتھ، بغیر کسی تقدم یا تاخر کے۔ اور یہی دائمی نعمت اور الٰہی اقتدار ہے۔ اور عقل اپنی فکر کے لحاظ سے اس حقیقت کو سمجھنے سے عاجز ہے، بلکہ یہ صرف ایک دوسری الٰہی قوت کے ذریعے سمجھا جاتا ہے جو اللہ اپنے بندوں میں سے جسے چاہتا ہے اس کے دل میں ڈالتا ہے۔ جیسا کہ انسان جنت میں بازارِ صور (صورتوں کے بازار) میں جب کسی صورت کی خواہش کرتا ہے تو اس میں داخل ہو جاتا ہے، جیسے روح یہاں ہمارے ہاں شکل اختیار کرتی ہے، اگرچہ وہ جسم ہے، لیکن اللہ نے اسے یہ قدرت عطا کی ہے۔ اور اللہ **عَلى‏ كُلِّ شَيْءٍ قَدِيرٌ** (ہر چیز پر قادر ہے)۔ اور جنت کے بازار کی حدیث کو ابو عیسیٰ ترمذی نے اپنی مصنف میں ذکر کیا ہے، پس اسے وہاں دیکھو۔\nپس جب نوری شعاعیں چار ارکان میں متصل ہوتی ہیں، تو اس نکاح سے مولودات ظاہر ہوتی ہیں جسے عزیز و علیم نے مقدر کیا ہے۔ پس مولودات آباء کے درمیان، جو کہ افلاک اور علوی انوار ہیں، اور امہات کے درمیان، جو کہ سفلی طبیعی ارکان ہیں، ہو جاتی ہیں۔ اور انوار سے ارکان تک متصل ہونے والی شعاعیں نکاح کی طرح ہو جاتی ہیں، اور افلاک کی حرکات اور انوار کا تیرنا مجامعت کرنے والے کی حرکات کے مانند ہو جاتا ہے، اور ارکان کی حرکات عورت کے دردِ زہ کے مانند ہو جاتی ہیں تاکہ وہ مکھن نکالے جو مکھنے سے نکلتا ہے، اور وہ وہ مولودات ہیں جو ان ارکان میں آنکھ کے سامنے معدنیات، نباتات، حیوانات، جن اور انسان کی صورت میں ظاہر ہوتی ہیں۔ پس وہ ذات پاک ہے جو جو چاہتا ہے اس پر قادر ہے، اس کے سوا کوئی معبود نہیں، وہ ہر چیز کا رب اور مالک ہے۔\n\n### اللہ اور والدین کا شکر مقام کلی کے لحاظ سے\n\nاللہ تعالیٰ نے فرمایا: **أَنِ اشْكُرْ لِي ولِوالِدَيْكَ** (میرا شکر ادا کر اور اپنے والدین کا)۔ پس اے ولی! آپ پر واضح ہو گیا کہ آپ کے آباء اور امہات کون ہیں، آپ کے قریب ترین باپ سے لے کر، جس کے ذریعے آپ کا وجود ظاہر ہوا، اور آپ کی قریب ترین ماں سے لے کر، پہلے باپ تک، جو جدِ اعلیٰ ہے، اور ان کے درمیان موجود تمام آباء اور امہات تک۔\nپس ان کا شکر، جس سے وہ خوش ہوتے ہیں اور ان کی تعریف سے فرحت پاتے ہیں، یہ ہے کہ آپ انہیں ان کے مالک اور موجد کی طرف منسوب کریں، اور فعل کو ان سے سلب کر کے اس کے مستحق سے ملحق کریں جو ہر چیز کا خالق ہے۔ جب آپ ایسا کریں گے، تو آپ نے اپنے اس فعل سے اپنے آباء کو خوشی دی، اور ان کو یہ خوشی دینا ہی ان کے ساتھ آپ کی نیکی اور ان کا شکر ہے۔ اور اگر آپ نے ایسا نہ کیا اور ان کے ذریعے اللہ کو بھول گئے، تو آپ نے نہ ان کا شکر ادا کیا اور نہ ہی ان کے شکر کے بارے میں اللہ کے حکم کی تعمیل کی۔ کیونکہ اس نے فرمایا: **أَنِ اشْكُرْ لِي** (میرا شکر ادا کر)، پس اس نے اپنی ذات کو مقدم کیا تاکہ آپ کو معلوم ہو جائے کہ وہی پہلا اور اولیٰ سبب ہے۔ پھر عطف کیا اور فرمایا: **ولِوالِدَيْكَ** (اور اپنے والدین کا)، اور یہ وہ اسباب ہیں جن کے ذریعے اللہ نے آپ کو وجود بخشا تاکہ آپ انہیں اس کی طرف منسوب کریں، اور ان کے لیے آپ پر صرف وجود میں تقدم (پہلے ہونے) کی فضیلت ہو، نہ کہ تاثیر (اثر ڈالنے) کی فضیلت، کیونکہ حقیقت میں ان کا کوئی اثر نہیں ہے، اگرچہ وہ آثار کے وجود کا سبب ہیں۔ پس اس قدر سے ان کے لیے فضیلت صحیح ہوئی اور آپ سے شکر کا مطالبہ کیا گیا۔ اور حق نے انہیں آپ کے لیے اور آپ کے نزدیک آپ پر تقدم میں وہی درجہ دیا جو اس کا ہے، نہ کہ اثر میں، تاکہ تقدم اور تاثیر کی تعریف اللہ تعالیٰ کے لیے ہو، اور تقدم اور توقف (فعل سے رکنے) کی تعریف والدین کے لیے ہو، لیکن اس شرط پر جو ہم نے مقرر کی۔\nپس اپنے رب کی عبادت میں کسی کو شریک نہ ٹھہراؤ۔ جب آپ اللہ تعالیٰ کی تعریف کریں اور کہیں: \"ہمارا رب اور ہمارے علوی آباء اور سفلی ماؤں کا رب\"، تو اس میں کوئی فرق نہیں کہ یہ میں کہوں یا تمام بنی آدم کہیں۔ پس اس نے کسی خاص شخص کو مخاطب نہیں کیا کہ وہ آدم اور حوا سے لے کر اپنے زمانے تک کے اپنے آباء اور امہات کو بیان کرے، بلکہ مقصود یہ انسانی نشو و نما ہے۔ پس آپ اس تحمید کے ذریعے عالمِ ارکان، عالمِ طبیعت اور انسان کے ہر مولود کی طرف سے ترجمانی کرنے والے بن گئے۔ پھر آپ ہر مؤثر اور مؤثر فیہ کے درمیان پیدا ہونے والے ہر مولود کی طرف سے نیابت میں ترقی کرتے ہیں، پس آپ ہر زبان سے اس کی حمد کرتے ہیں اور ہر رخ سے اس کی طرف متوجہ ہوتے ہیں، پس اس کلی مقام سے اللہ کی طرف سے ہمیں جزا ملے گی۔\n\n### تمام مخلوقات پر کامل سلام\n\nجیسا کہ میرے بعض مشائخ نے مجھ سے کہا: جب تم \"السلام علينا وعلى عباد الله الصالحين\" (سلام ہو ہم پر اور اللہ کے نیک بندوں پر) کہو، یا جب تم راستے میں کسی کو سلام کرو اور \"السلام علیکم\" کہو، تو اپنے دل میں زمین اور آسمان میں اللہ کے ہر نیک بندے، مردہ اور زندہ کو حاضر کرو۔ کیونکہ اس مقام سے وہ آپ کو جواب دیں گے۔ پس کوئی ملک مقرب (مقرب فرشتہ) یا روح مطہر (پاکیزہ روح) باقی نہیں رہے گی جسے آپ کا سلام پہنچے اور وہ آپ کو جواب نہ دے، اور یہ دعا ہے، پس آپ کے حق میں قبول ہو گی اور آپ کامیاب ہوں گے۔ اور اللہ کے وہ بندے جنہیں آپ کا سلام نہیں پہنچتا جو اس کے جلال میں مستغرق ہیں، اس میں مشغول ہیں، اور اس میں فنا ہو چکے ہیں، اور آپ نے اس شمولیت کے ساتھ ان پر سلام بھیجا ہے، تو اللہ ان کی طرف سے آپ کو جواب دیتا ہے۔ اور یہ آپ کے حق میں کافی شرف ہے کہ حق آپ کو سلام کرے۔ کاش آپ کسی کو نہ سنتے جس پر آپ نے سلام کیا، تاکہ حق سب کی طرف سے آپ کو جواب دیتا، کیونکہ وہ آپ کے ذریعے زیادہ شرف والا ہے۔\nاللہ تعالیٰ نے یحییٰ علیہ السلام کے حق میں شرف بخشتے ہوئے فرمایا: **وسَلامٌ عَلَيْهِ يَوْمَ وُلِدَ ويَوْمَ يَمُوتُ ويَوْمَ يُبْعَثُ حَيًّا** (اور سلامتی ہو اس پر جس دن وہ پیدا ہوا اور جس دن وہ مرے گا اور جس دن وہ زندہ اٹھایا جائے گا)۔ اور یہ فضیلت اور خبر کا سلام ہے۔ تو اس سلام کا کیا کہنا جو واجب ہے، جس کا جواب حق نے ان کی طرف سے دیا جنہوں نے جواب نہیں دیا، اور فرائض کا بدلہ فضائل کے بدلے سے زیادہ عظیم ہوتا ہے اس شخص کے حق میں جس کے بارے میں کہا گیا: **وسَلامٌ عَلَيْهِ يَوْمَ وُلِدَ**، پس اس کے لیے دونوں فضیلتیں جمع ہو گئیں۔\nاور ہم پر اللہ کی طرف سے ابتداءً صلوٰۃ (درود) وارد ہوئی ہے، لیکن مجھے یہ نہیں معلوم ہوا کہ کیا سلام بھی ابتداءً وارد ہوا ہے جیسا کہ صلوٰۃ وارد ہوئی ہے یا نہیں؟ پس جس نے اس بارے میں کوئی چیز روایت کی ہو اور اسے متحقق کیا ہو، تو میں نے اس کی گردن میں امانت رکھی ہے کہ وہ اسے اس مقام پر اللہ کی ہم پر صلوٰۃ کے ساتھ اس باب میں شامل کر دے، تاکہ یہ مومنوں کے لیے بشارت ہو اور میری اس کتاب کے لیے شرف ہو۔ اور اللہ ہی مددگار اور توفیق دینے والا ہے، اس کے سوا کوئی رب نہیں۔\n\n### طبیعی آباء اور طبیعی مائیں\n\nاور جہاں تک طبیعی آباء اور امہات کا تعلق ہے، تو ہم نے ان کا ذکر نہیں کیا، پس ہم اس کا کلی امر ذکر کرتے ہیں۔ اور وہ دو باپ اور دو مائیں ہیں۔ پس دو باپ فاعل (اثر کرنے والے) ہیں، اور دو مائیں منفعل (اثر قبول کرنے والی) ہیں۔ اور جو ان سے پیدا ہوتا ہے وہ ان سے منفعل ہوتا ہے۔ پس حرارت (گرمی) اور برودت (سردی) فاعل ہیں، اور رطوبت (نمی) اور یبوست (خشکی) منفعل ہیں۔ پس حرارت نے یبوست سے نکاح کیا، تو رکنِ نار (آگ) پیدا ہوا۔ اور حرارت نے رطوبت سے نکاح کیا، تو رکنِ ہوا پیدا ہوا۔ پھر برودت نے رطوبت سے نکاح کیا، تو رکنِ ماء (پانی) پیدا ہوا، اور برودت نے یبوست سے نکاح کیا، تو رکنِ تراب (مٹی) پیدا ہوا۔\nپس بیٹوں میں آباء اور امہات کی حقیقتیں حاصل ہو گئیں۔ پس آگ گرم اور خشک تھی، اس کی حرارت باپ کی طرف سے ہے اور اس کی یبوست ماں کی طرف سے ہے۔ اور ہوا گرم اور نم تھی، اس کی حرارت باپ کی طرف سے ہے اور اس کی رطوبت ماں کی طرف سے ہے۔ اور پانی سرد اور نم تھا، اس کی برودت باپ کی طرف سے ہے اور اس کی رطوبت ماں کی طرف سے ہے۔ اور زمین سرد اور خشک تھی، اس کی برودت باپ کی طرف سے ہے اور اس کی یبوست ماں کی طرف سے ہے۔\nپس حرارت اور برودت علم سے ہیں، اور رطوبت اور یبوست ارادے سے ہیں۔ یہ ان کے وجود میں الٰہی علم سے ان کے تعلق کی حد ہے، اور جو کچھ ان سے قدرت سے پیدا ہوتا ہے۔ پھر ان ارکان میں توالد (نسل در نسل پیدائش) واقع ہوتا ہے، اس لحاظ سے کہ وہ علوی انوار کے آباء کے لیے مائیں ہیں، نہ کہ اس لحاظ سے کہ وہ خود آباء ہیں، اگرچہ ان میں ابوت موجود ہے۔ ہم نے آپ کو بتا دیا ہے کہ ابوت اور بنوت اضافات اور نسبتوں میں سے ہیں۔ پس باپ اس باپ کا بیٹا ہے جس کا وہ بیٹا ہے، اور بیٹا اس بیٹے کا باپ ہے جس کا وہ باپ ہے۔ اور اسی طرح نسبتوں کا باب ہے۔ پس اس میں غور کرو، اور اللہ ہی توفیق دینے والا ہے، اس کے سوا کوئی رب نہیں۔\nاور چونکہ یبوست حرارت سے منفعل ہے، اور رطوبت برودت سے منفعل ہے، اس لیے ہم نے رطوبت اور یبوست کے بارے میں کہا کہ وہ منفعل ہیں، اور انہیں ارکان کے لیے ماں کے درجے میں رکھا۔ اور چونکہ حرارت اور برودت فاعل ہیں، اس لیے ہم نے انہیں ارکان کے لیے باپ کے درجے میں رکھا۔ اور چونکہ صنعت صانع (کاریگر) کا تقاضا کرتی ہے، اور منفعل اپنی ذات سے فاعل کو طلب کرتا ہے، کیونکہ وہ اپنی ذات کے لیے منفعل ہے، اور اگر وہ اپنی ذات کے لیے منفعل نہ ہوتا تو انفعال اور اثر کو قبول نہ کرتا، اور وہ مؤثر فیہ ہوتا، بخلاف فاعل کے، جو اختیار سے فعل کرتا ہے، اگر چاہے تو فعل کرے، تو اسے فاعل کہا جاتا ہے، اور اگر چاہے تو چھوڑ دے، اور یہ منفعل کے لیے نہیں ہے۔ اور اسی حقیقت کی وجہ سے اللہ تعالیٰ نے فرمایا، اور یہ قرآن کی فصاحت اور ایجاز میں سے ہے: **ولا رطب ولا يابس إلا في كتاب مبين** (اور نہ کوئی تر ہے اور نہ کوئی خشک مگر یہ کہ وہ کھلی کتاب میں ہے)۔ پس اس نے منفعل کا ذکر کیا اور \"نہ گرم اور نہ سرد\" کا ذکر نہیں کیا، کیونکہ طبیعت کے علماء کے نزدیک رطوبت اور یبوست حرارت اور برودت کو طلب کرتی ہیں، جو ان سے منفعل ہیں، جیسے صنعت صانع کو طلب کرتی ہے۔ اسی لیے اس نے ان دونوں کا ذکر کیا اور اصل کا ذکر نہیں کیا، اگرچہ سب کچھ کھلی کتاب میں ہے۔\nبلاشبہ اللہ نے ہمارے آقا محمد صلی اللہ علیہ وسلم کو ایسے علوم عطا کیے جو ان کے سوا کسی کو حاصل نہیں ہوئے، جیسا کہ آپ نے فرمایا: \"پس میں نے اولین اور آخرین کا علم جان لیا\" (حدیثِ ضرب بالید میں)۔ پس علم الٰہی تمام علوم کی اصل ہے اور اسی کی طرف سب لوٹتے ہیں۔ اور ہم نے اس باب کے حق کو اختصار اور ایجاز کے ساتھ پورا کر دیا ہے، کیونکہ اس میں طوالت صرف کیفیات کے ذکر سے ہوتی ہے، اور جہاں تک اصول کا تعلق ہے، تو ہم نے انہیں ذکر کر دیا ہے اور ان کی بنیاد رکھ دی ہے۔ اور اللہ **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق کہتا ہے اور وہی سیدھا راستہ دکھاتا ہے)۔",
    "fa": "«باب یازدهم در معرفت پدران علوی ما و مادران سفلی ما»\n\nمن فرزند پدرانی هستم که ارواحی پاکند *** و مادرانی که نفوس عنصری‌اند\n\nظهور ما میان روح و جسم بود *** از اجتماع و در آغوش کشیدن و لذت‌ها\n\nمن از یک واحد نبودم که او را یگانه بدانم *** بلکه از گروهی از پدران و مادران بودم\n\nاگر شأن آن‌ها را دریابی، آنان برای خداوند *** همچون صنعتگری هستند که اشیا را با ابزار می‌سازد\n\nپس نسبت ساختن به نجار (به تنهایی) برای آن نیست *** این‌گونه پروردگار مخلوقات ما را هستی بخشید\n\nپس شخص در توحید هستی‌بخش خود صادق است *** و شخص در اثبات علل (واسطه) نیز صادق است\n\nو اگر به ابزارها بنگری، اسناد سلسله‌وار ما طولانی می‌شود *** تا به ذات (حق) برسد\n\nو اگر به او بنگری در حالی که ما را هستی می‌بخشد *** به وحدانیت او قائل می‌شویم نه به جماعت‌ها\n\nمن یگانه چشم و تنها متولد شدم *** و همه مردم فرزندان علل (واسطه) هستند\n\n### [پدری، مادری و فرزندی]\n\nبدان، خداوند تو را تأیید کند، از آنجا که مقصود از این عالم، انسان است و او امام (پیشوا) این عالم است، ما پدران و مادران را به او نسبت دادیم و گفتیم: پدران علوی ما و مادران سفلی ما. پس هر مؤثری پدر است و هر مؤثر فیه (تأثیرپذیرفته‌ای) مادر است. این ضابطه (قانون) این باب است. و آنچه میان آن دو از آن اثر متولد می‌شود، پسر و مولود نامیده می‌شود. همچنین معانی در تولید علوم، تنها به واسطه دو مقدمه است که یکی از آن‌ها با مفرد واحدی که در هر دو تکرار می‌شود، دیگری را نکاح می‌کند؛ و آن مفرد، رابط و همان نکاح است. و نتیجه‌ای که از میان آن دو صادر می‌شود، همان مطلوب است. پس ارواح همگی پدرند و طبیعت ام (مادر) است، زیرا طبیعت محل استحالات (دگرگونی‌ها) است. و این ارواح بر این ارکان که همان عناصر قابل تغییر و استحاله هستند، متوجه می‌شوند و در آن‌ها مولودات (متولدات) ظاهر می‌گردند که عبارتند از: معادن، نبات، حیوان، جن و انسان که کامل‌ترین آن‌هاست.\n\n### [چهار زن و چهار رکن]\n\nهمچنین شریعت ما که کامل‌ترین شرایع است، به همین منوال آمده است، زیرا بر مجرای حقایق کلیه (حقائق کلیة) جاری شده است. پس جوامع الکلم (جامعیت کلمات) به آن داده شد و به چهار زن اکتفا کرد و آنچه را که از طریق نکاح متوقف بر عقد، بر آن افزوده می‌شد، حرام نمود. پس ملک یمین (کنیز) در این حکم داخل نشد. و ملک یمین را در مقابل امر پنجمی که برخی از علما به آن قائل شدند، مباح ساخت. همچنین ارکان عالم طبیعت چهارتاست و خداوند با نکاح عالم علوی با این چهار رکن، آنچه را که در آن‌ها متولد می‌شود، ایجاد می‌کند. و در این باره شش مذهب وجود دارد: (گروهی) گمان کردند که هر یک از این چهار رکن، خود اصلی مستقل است. و گروهی گفتند: رکن آتش اصل است. آنچه از آن غلیظ شد، هوا بود، و آنچه از هوا غلیظ شد، آب بود، و آنچه از آب غلیظ شد، خاک بود. و گروهی گفتند: رکن هوا اصل است. آنچه از آن رقیق شد، آتش بود، و آنچه غلیظ شد، آب بود. و گروهی گفتند: رکن آب اصل است. و گروهی گفتند: رکن خاک اصل است. و گروهی گفتند: اصل، امر پنجمی است که هیچ یک از این چهار رکن نیست. و این همان است که ما آن را به منزله ملک یمین قرار دادیم. پس شریعت ما در نکاح، کامل‌ترین مذاهب را در بر گرفت تا همه مذاهب در آن گنجانده شوند.\n\n### [نظریه اصل پنجم]\n\nو این مذهبِ قائل به اصل پنجم، نزد ما صحیح است و آن را طبیعت می‌نامند. زیرا طبیعت، معقولی واحد است که رکن آتش و همه ارکان از آن ظاهر شده‌اند. پس گفته می‌شود: رکن آتش از طبیعت است، در حالی که عین طبیعت نیست. و صحیح نیست که مجموعی باشد که عین چهار رکن است، زیرا برخی از ارکان به کلی با دیگری منافر (ناسازگار) است و برخی دیگر تنها با یک امر با دیگری منافر است؛ مانند آتش و آب که از همه جهات متنافرند، و هوا و خاک نیز چنین‌اند. به همین دلیل، خداوند آن‌ها را در هستی (الوجود) به ترتیبی حکیمانه برای وقوع استحالات (دگرگونی‌ها) مرتب ساخت. اگر منافر را در مجاورت منافرش قرار می‌داد، استحاله به آن صورت نمی‌گرفت و حکمت معطل می‌ماند. پس هوا را در کنار رکن آتش قرار داد و جامع میان آن دو، حرارت است. و آب را در کنار هوا قرار داد و جامع میان آن دو، رطوبت است. و خاک را در کنار آب قرار داد و جامع میان آن دو، برودت (سردی) است. پس محیل (دگرگون‌کننده) پدر است و مستحیل (دگرگون‌شونده) مادر است و استحاله، نکاح است و آنچه به آن استحاله یافته، پسر است. پس متکلم (سخن‌گو) پدر است و شنونده مادر است و تکلم، نکاح است و آنچه از آن در فهم شنونده موجود می‌شود، پسر است. پس هر پدر علوی، مؤثر است و هر مادر سفلی، مؤثر فیه (تأثیرپذیرفته) است. و هر نسبتی معین میان آن دو، نکاح و توجه است و هر نتیجه‌ای، پسر است. از اینجاست که سخن متکلم به کسی که می‌خواهد برخیزد، فهمیده می‌شود: «قم» (برخیز)، و او به واسطه اثر لفظ «قم» برمی‌خیزد. اگر شنونده که بی‌شک مادر است، برنخیزد، پس او عقیم است. و اگر عقیم باشد، در آن حالت مادر نیست.\n\n### [پدر اول، مادر اول، نکاح اول]\n\nاین باب تنها به مادران اختصاص دارد. پس اولین پدران علوی معلوم است و اولین مادران سفلی، شیئیت (شیء بودن) معدوم ممکن است. و اولین نکاح، قصد با امر (الهی) است. و اولین پسر، وجود عین همان شیئیت است که ذکر کردیم. پس این پدر، پدری‌اش ساری (جاری) است و آن مادر، مادری‌اش ساری است و آن نکاح در هر چیزی ساری است و نتیجه در حق هر ظاهرالعینی دائمی و بی‌انقطاع است. این را نزد ما نکاح ساری در جمیع ذریات می‌نامند. خداوند متعال در اثبات آنچه گفتیم، می‌فرماید: **إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ** (سخن ما برای چیزی، هنگامی که اراده‌اش کنیم، تنها این است که به آن بگوییم: باش، پس می‌شود). و ما در این باره کتابی شریف داریم که حریم آن منیع است؛ بینا در آن کور است، پس چگونه است حال کسی که کوری بر او حلول کرده باشد؟ اگر تفصیل این مقام و توجهات این اسماء الهیِ اعلام را می‌دیدی، امر عظیمی را مشاهده می‌کردی و مقامی هولناک و بزرگ را شهود می‌نمودی. به راستی که عارفان به خداوند و صنع زیبای او منزه شده‌اند.\n\n### [عقل کلی و نفس کلی]\n\nپس از آنکه با فهم نافذ و نظر صائب تو به پدر اول ساری (جاری) اشاره کردم که همان اسم جامع اعظم است و همه اسماء در رفع و نصب و خفض (حرکات اعرابی) از او تبعیت می‌کنند و حکم او جاری است، و به مادر اولیِ آخریه که در نسبت مادریت در همه فرزندان ساری است، اکنون به پدرانی می‌پردازیم که اسباب موضوعه (نهاده شده) به وضع الهی هستند و به مادران و اتصال آن‌ها از طریق نکاح معنوی و حسی مشروع، تا فرزندان، فرزندان حلال باشند، تا اینکه به تناسل انسانی برسم که آخرین نوع تکوّن و اولین مبدع (مخلوق) است که به قصد معین شده است. پس می‌گوییم: عقل اول که اولین مبدع خلق شده و همان قلم اعلی است، و در آن هنگام محدَثی (موجودی حادث) جز او نبود، و او مؤثر بود در آنچه خداوند در او از انبعاث لوح محفوظ ایجاد کرد، مانند انبعاث حوا از آدم در عالم اجرام؛ تا آن لوح، موضع و محلی باشد برای آنچه این قلم اعلای الهی در آن می‌نویسد و برای ترسیم حروفی که برای دلالت بر آنچه حق تعالی آن‌ها را دلیل قرار داده، وضع شده‌اند. پس لوح محفوظ اولین موجود انبعاثی بود. و در شرع وارد شده است که اولین چیزی که خداوند خلق کرد، قلم بود، سپس لوح را خلق کرد و به قلم گفت: بنویس. قلم گفت: چه بنویسم؟ خداوند به او گفت: بنویس و من بر تو املا می‌کنم. پس قلم در لوح آنچه را که حق بر او املا می‌کرد، ترسیم کرد، و آن علم او در خلقش است که تا روز قیامت خلق می‌کند.\n\n### [نکاح معنوی میان قلم و لوح]\n\nپس میان قلم و لوح، نکاحی معنوی و معقول و اثری حسی و مشهود وجود داشت. از اینجاست که عمل به حروف مرقوم (نوشته شده) نزد ما اهمیت دارد. و آنچه در لوح از اثر به ودیعه نهاده شد، مانند آب دافق (جهنده) است که در رحم مؤنث حاصل می‌شود. و آنچه از آن کتابت از معانیِ به ودیعه نهاده شده در آن حروف جسمانی ظاهر شد، به منزله ارواح فرزندانی است که در اجسامشان به ودیعه نهاده شده‌اند. پس بفهم، و خداوند **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و او راه را هدایت می‌کند). و حق در این لوح، آنچه را که به او وحی کرده بود، قرار داد؛ لوحی که از جانب خداوند عاقل است و به حمد او تسبیح می‌گوید، تسبیحی که جز کسی که خداوند او را آگاه کرده و گوشش را برای شنیدن آنچه وارد می‌شود گشوده باشد، آن را نمی‌فهمد؛ همان‌گونه که گوش رسول خدا (صلی الله علیه و سلم) و اصحاب حاضرش را برای درک تسبیح سنگریزه‌ها در کف پاک و مطهرش گشود. و ما گفتیم گوشش را گشود، زیرا سنگریزه‌ها از زمانی که خداوند آن‌ها را خلق کرده بود، پیوسته به حمد هستی‌بخش خود تسبیح می‌گفتند. پس خرق عادت (شکستن عادت) در ادراک سمعی بود نه در خود سنگریزه‌ها. سپس خداوند در آن (لوح/نفس کلی) دو صفت ایجاد کرد: صفت علم و صفت عمل. با صفت عمل، صور عالم از آن ظاهر می‌شود، همان‌گونه که صورت تابوت هنگام کار نجار برای چشم ظاهر می‌گردد. پس با آن (صفت عمل) صور را می‌دهد. و صور بر دو قسم‌اند: صور ظاهری حسی که همان اجرام و آنچه حساً به آن‌ها متصل است، مانند اشکال و رنگ‌ها و اکوان (هستی‌ها)؛ و صور باطنی معنوی غیر محسوس که همان علوم و معارف (المعرفة) و اراداتی است که در آن‌هاست. و با آن دو صفت، آنچه از صور ظاهر شد، پدید آمد. پس صفت عالِمه پدر است، زیرا مؤثر است؛ و صفت عامِله مادر است، زیرا مؤثر فیه (تأثیرپذیرفته) است و صور مذکور از آن ظاهر شده‌اند. زیرا نجار مهندس اگر عالم باشد ولی کار کردن را نداند، آنچه را که نزد اوست بر گوش کسی که کار نجاری را خوب می‌داند، القا می‌کند. و این القا، نکاح است. پس کلام مهندس پدر است و قبول شنونده مادر است. سپس علم شنونده پدر می‌شود و جوارح (اعضا) او مادر. و اگر بخواهی می‌توانی بگویی: مهندس پدر است و صنعتگر که همان نجار است، مادر است، از آن جهت که به آنچه مهندس به او القا می‌کند، گوش فرا می‌دهد. پس هنگامی که در او تأثیر گذاشت، آنچه در قوه (پتانسیل) او بود، در نفس نجار نازل شده است. و صورتی که در باطن نجار از آنچه مهندس به او القا کرده، ظاهر شده و در وجود خیال او به صورت قائم و ظاهر حاصل گشته، به منزله فرزندی است که از فهم او از مهندس متولد شده است. سپس عمل نجار، پدر است در چوب که مادر نجاری است، با ابزارهایی که نکاح با آن‌ها واقع می‌شود و انزال آب (ماده) که اثر هر ضربه با تیشه یا برش با اره است. و هر برش و جداسازی و جمع‌آوری در قطعات نجاری شده برای ایجاد صورت، باعث ظهور تابوت می‌شود که به منزله فرزند مولود خارج شده به حس است. پس حقایق را در ترتیب پدران و مادران و فرزندان و چگونگی تولید این‌گونه بفهم. پس هر پدری که صفت عمل نزد او نباشد، از آن وجه پدر نیست، حتی اگر عالم باشد و ابزار رساندن (علم) با کلام یا اشاره برای وقوع افهام (فهماندن) از او منع شود و او عامل نباشد، از همه وجوه پدر نخواهد بود، بلکه مادر خواهد بود به واسطه علومی که در نفس او حاصل شده است، مگر اینکه جنین در شکم مادرش روح نیافته باشد یا در شکم مادرش مرده باشد و طبیعت آن مادر او را تحلیل برده باشد تا اینکه تصرف شود و عین (وجود خارجی) برایش ظاهر نشود. پس بفهم.\n\n### [طبیعت کلی و هباء]\n\nو پس از آنکه پدر دوم از ممکنات را شناختی و اینکه او مادر دومی برای قلم اعلی بود، از آنچه از القای اقدس روحانی به او القا شد، طبیعت و هباء (ماده اولیه) بود. پس اولین مادری بود که دو قلو زایید. اولین چیزی که القا کرد، طبیعت بود، سپس هباء به دنبال آن آمد. پس طبیعت و هباء، برادر و خواهرند از یک پدر و یک مادر. پس طبیعت با هباء نکاح کرد و از میان آن دو، صورت جسم کلی متولد شد که اولین جسم ظاهر شده است. پس طبیعت پدر بود، زیرا اثر از او بود؛ و هباء مادر بود، زیرا اثر در آن ظاهر شد؛ و نتیجه، جسم بود. سپس توالد (تولید مثل) در عالم تا خاک، بر ترتیب مخصوصی که در کتاب ما به نام *عقلة المستوفز* ذکر کرده‌ایم، نازل شد. و در آن تفصیل طولانی است که این باب گنجایش آن را ندارد، زیرا هدف اختصار است.\n\n### [نظریه مرکز و نظریه انتهای ارکان]\n\nو ما قائل به مرکز نیستیم، بلکه قائل به انتهای ارکان هستیم و اینکه بزرگ‌تر، کوچک‌تر را جذب می‌کند. به همین دلیل می‌بینیم که بخار و آتش طالب علو (بالا رفتن) هستند و سنگ و مانند آن طالب سفل (پایین رفتن) است. پس جهات مختلف شدند و این بر استقامت (خط مستقیم) از آن دو است، یعنی طالب علو و طالب سفل. زیرا قائل به مرکز می‌گوید که مرکز امری معقول و دقیق است که ارکان آن را می‌طلبند، و اگر خاک نبود، آب به دور آن می‌چرخید، و اگر آب نبود، هوا به دور آن می‌چرخید، و اگر هوا نبود، آتش به دور آن می‌چرخید. اگر چنین بود که او می‌گوید، باید بخار را می‌دیدیم که طالب سفل است، در حالی که حس خلاف آن را شهادت می‌دهد. ما این فصل را در کتاب *المرکز* خود که جزئی لطیف است، بیان کرده‌ایم. پس اگر آن را در برخی از کتاب‌هایمان ذکر می‌کنیم، تنها به عنوان مثال نقطه از کره است که محیط از آن پدید می‌آید، به دلیل غرضی که در آن داریم و به معارف الهی و نسبت‌ها مربوط است؛ زیرا خطوطی که از نقطه به محیط خارج می‌شوند، مساوی هستند تا نسبت‌ها برابر باشند و تفاضلی (برتری) در آنجا واقع نشود. زیرا اگر تفاضلی واقع می‌شد، منجر به نقص مفضول (کمتر) می‌شد، در حالی که امر چنین نیست. و ما آن را محل عنصر اعظم قرار دادیم تا تنبیهی باشد بر اینکه اعظم بر اقل حکم می‌کند. و ما به آن در *عقلة المستوفز* اشاره کرده‌ایم.\n\n### [گردش افلاک علوی]\n\nو هنگامی که خداوند این افلاک علوی را به گردش درآورد و ایام را با فلک اول ایجاد کرد و آن را با فلک دوم که ستارگان ثابت برای دیدن در آن هستند، معین نمود، سپس ارکان را به صورت خاک و آب و هوا و آتش ایجاد کرد، سپس آسمان‌ها را هفت طبقه مساوی ساخت و آن‌ها را فتق (جدا) کرد، یعنی هر آسمان را جداگانه پس از آنکه رتق (به هم پیوسته) بودند، جدا نمود، زیرا آن‌ها دود بودند. و زمین را به هفت زمین فتق کرد؛ آسمان اول برای زمین اول، و دوم برای دوم، تا هفت. و جواری خنس (پنج سیاره سرگردان) را خلق کرد که در هر آسمانی یک ستاره است، و ماه را خلق کرد و همچنین خورشید را خلق کرد. پس شب و روز با خلق خورشید در روز پدید آمد، در حالی که روز از قبل موجود بود. پس نیمی از این روز را برای اهل زمین، روز قرار داد، که از طلوع خورشید تا غروب آن است، و نیم دیگر آن را شب قرار داد، که از غروب خورشید تا طلوع آن است. و روز عبارت است از مجموع (شب و روز). به همین دلیل فرمود: **خَلَقَ السَّماواتِ والْأَرْضَ وما بَيْنَهُما في سِتَّةِ أَيَّامٍ** (آسمان‌ها و زمین و آنچه میان آن‌هاست را در شش روز آفرید). زیرا ایام با وجود حرکت فلک بروج موجود بودند و آن‌ها همان ایام شناخته شده نزد ما هستند و نه غیر آن. و خداوند نگفت عرش و کرسی را خلق کرد، بلکه فرمود: **خَلَقَ السَّماواتِ والْأَرْضَ في سِتَّةِ أَيَّامٍ** (آسمان‌ها و زمین را در شش روز آفرید). پس اگر فلک بروج یک دور کامل بزند، آن همان روزی است که خداوند آسمان‌ها و زمین را در آن خلق کرد. سپس خداوند شب و روز را هنگام وجود خورشید پدید آورد، نه ایام را. اما آنچه در آن‌ها از افزایش و کاهش رخ می‌دهد، یعنی در شب و روز، نه در ساعات، زیرا ساعات بیست و چهار ساعت است، به دلیل قرار گرفتن خورشید در منطقه البروج است که نسبت به ما حمائلی (مایل) است و در آن میل وجود دارد. پس هنگامی که خورشید در منازل عالیه قرار گیرد، روز طولانی می‌شود، هر کجا که باشد. و هنگامی که خورشید در منازل نازله قرار گیرد، روز کوتاه می‌شود، هر کجا که باشد. و ما گفتیم هر کجا که باشد، زیرا اگر شب نزد ما طولانی شود، روز نزد دیگران طولانی می‌شود. پس خورشید نسبت به آن‌ها در منازل عالیه و نسبت به ما در منازل نازله است. پس اگر روز نزد ما کوتاه شود، شب نزد آن‌ها طولانی می‌شود به دلیل آنچه ذکر کردیم. و روز، همان روز است، بیست و چهار ساعت، نه زیاد می‌شود و نه کم، و نه طولانی می‌شود و نه کوتاه در موضع اعتدال. پس این حقیقت روز است. سپس ممکن است ما تنها روز (روشنایی) را به حکم اصطلاح، روز بنامیم. پس بفهم.\n\n### [زمان و شئون الهی]\n\nو خداوند این زمان را که همان شب و روز است، روز قرار داد، و زمان همان روز است. و شب و روز در زمان موجودند. خداوند آن‌ها را پدر و مادر قرار داد برای آنچه در آن‌ها ایجاد می‌کند، همان‌گونه که فرمود: **يُغْشِي اللَّيْلَ النَّهارَ** (شب را بر روز می‌پوشاند)، مانند سخن او درباره آدم: **فَلَمَّا تَغَشَّاها حَمَلَتْ** (پس هنگامی که او را پوشاند، باردار شد). پس اگر شب، روز را بپوشاند، شب پدر است و روز مادر، و هر آنچه خداوند در روز ایجاد می‌کند، به منزله فرزندانی است که زن می‌زاید. و اگر روز، شب را بپوشاند، روز پدر است و شب مادر، و هر آنچه خداوند از شئون (امور) در شب ایجاد می‌کند، به منزله فرزندانی است که مادر می‌زاید. و ما این فصل را در کتاب *الشأن* خود بیان کرده‌ایم و در آن درباره سخن خداوند متعال: **كُلَّ يَوْمٍ هُوَ في شَأْنٍ** (هر روز او در کاری است) سخن گفته‌ایم. و اگر خداوند ما را به یاد آورد، در این کتاب نیز بخشی شافی از معرفت ایام خواهد آمد. همچنین خداوند متعال فرمود: **يُولِجُ اللَّيْلَ في النَّهارِ ويُولِجُ النَّهارَ في اللَّيْلِ** (شب را در روز داخل می‌کند و روز را در شب داخل می‌کند). پس در نکاح (تولید) توضیح بیشتری داد. و سبحانه با سخن خود: **وآيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهارَ** (و نشانه‌ای برای آن‌ها شب است که روز را از آن برمی‌کشیم) بیان کرد که شب مادر روز است و روز متولد شده از آن است، همان‌گونه که مولود از مادرش جدا می‌شود هنگامی که از او خارج می‌گردد، و مار از پوستش جدا می‌شود، و به صورت مولودی در عالم دیگری غیر از عالمی که شب آن را در بر می‌گیرد، ظاهر می‌شود. و پدر، همان روزی است که ذکر کردیم. و ما این را در کتاب *الزمان* و *معرفة الدهر* خود بیان کرده‌ایم. پس این شب و روز از یک وجه پدرند و از وجهی دیگر مادر، و آنچه خداوند در آن‌ها در عالم ارکان از مولودات هنگام تصریف (گردش) آن‌ها ایجاد می‌کند، فرزندان شب و روز نامیده می‌شوند، همان‌گونه که مقرر کردیم.\n\n### [اهرام مصر بنا شد در حالی که نسر در اسد بود]\n\nو هنگامی که خداوند اجرام کل عالم را که قابلیت تکوین (پدید آمدن) در آن را دارند، ایجاد کرد، از حد زیرین مقعر آسمان دنیا تا باطن زمین را عالم طبیعت و استحالات (دگرگونی‌ها) و ظهور اعیان (موجودات خارجی) که هنگام استحالات پدید می‌آیند، قرار داد و آن را به منزله مادر قرار داد. و از مقعر فلک آسمان دنیا تا آخر افلاک را به منزله پدر قرار داد و در آن منازلی مقدر کرد و آن را با انوار ثابت و سابح (شناور) زینت داد. پس سابح (سیارات) در ثابت (ستارگان) حرکت می‌کند و ثابت و سابح در فلک محیط به تقدیر عزیز (خداوند) حرکت می‌کنند. دلیل آن این است که در برخی از اهرام در سرزمین مصر، نوشته‌ای با قلمی دیده شده که در آن تاریخ اهرام ذکر شده که آن‌ها بنا شدند در حالی که نسر (صورت فلکی عقاب) در اسد (صورت فلکی شیر) بود. و بی‌شک اکنون ما آن را در جدی (صورت فلکی بزغاله) درک می‌کنیم. پس این دلالت می‌کند که کواکب ثابت در فلک بروج اطلس (بی‌ستاره) حرکت می‌کنند. و خداوند درباره ماه می‌فرماید: **والْقَمَرَ قَدَّرْناهُ مَنازِلَ** (و برای ماه منزل‌هایی مقدر کردیم). و درباره ستارگان فرمود: **كُلٌّ في فَلَكٍ يَسْبَحُونَ** (هر یک در مداری شناورند). و خداوند متعال فرمود: **والشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَها** (و خورشید به سوی قرارگاه خود در حرکت است). و قرائت شده است: *لا مستقر لها* (قرارگاهی برای آن نیست). و میان این دو قرائت تنافری نیست. سپس فرمود: **ذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ** (این تقدیر خدای عزیز و داناست). و به سخن خود درباره ماه که آن را منازل مقدر کرده، نظر دارد. و فرمود: **لا الشَّمْسُ يَنْبَغِي لَها أَنْ تُدْرِكَ الْقَمَرَ ولا اللَّيْلُ سابِقُ النَّهارِ وكُلٌّ في فَلَكٍ يَسْبَحُونَ** (نه خورشید را سزاست که به ماه برسد و نه شب بر روز پیشی می‌گیرد و هر یک در مداری شناورند)، یعنی در چیزی گرد.\n\n### [امر الهی نازل شده میان آسمان و زمین]\n\nو برای این انوار که کواکب نامیده می‌شوند، شعاع‌هایی قرار داد که به ارکان متصل‌اند. اتصال آن‌ها به ارکان، به منزله نکاح پدران با مادران است. پس خداوند متعال هنگام اتصال آن شعاع‌های نوری در ارکان چهارگانه عالم طبیعت، آنچه را که در آن‌ها تکوین می‌یابد و ما آن را حساً مشاهده می‌کنیم، ایجاد می‌کند. پس این ارکان برای آن (شعاع‌ها) به منزله چهار زن در شریعت ما هستند. و همان‌گونه که نکاح شرعی نزد ما حلال نیست مگر با عقد شرعی، همچنین **أَوْحى‏ في كُلِّ سَماءٍ أَمْرَها** (در هر آسمانی امرش را وحی کرد). و از آن وحی، تنزل امر میان آن‌ها بود، همان‌گونه که خداوند متعال فرمود: **يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ** (امر میان آن‌ها نازل می‌شود)، یعنی امر الهی. و در تفسیر این تنزل، اسرار عظیمی است که به آنچه در این باب به آن اشاره می‌کنیم، نزدیک است. و از ابن عباس روایت شده است که درباره این آیه گفت: اگر آن را تفسیر کنم، خواهید گفت که من کافرم، و در روایتی دیگر: مرا سنگسار خواهید کرد. و این از اسرار آیات قرآن است. خداوند متعال فرمود: **خَلَقَ سَبْعَ سَماواتٍ ومن الْأَرْضِ مِثْلَهُنَّ** (هفت آسمان و از زمین نیز مانند آن‌ها آفرید). سپس فرمود: **يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ** (امر میان آن‌ها نازل می‌شود). سپس کامل کرد و بیان نمود: **لِتَعْلَمُوا أَنَّ الله عَلى‏ كُلِّ شَيْءٍ قَدِيرٌ** (تا بدانید که خداوند بر هر چیزی تواناست). و این همان است که ما به صفت عمل که پیش‌تر ذکر کردیم، اشاره نمودیم، یعنی ایجاد صفت علم و عمل توسط خداوند در پدر دوم. زیرا قدرت برای ایجاد است و آن همان عمل است. سپس در اخبار کامل کرد و فرمود: و خداوند **قد أَحاطَ بِكُلِّ شَيْءٍ عِلْماً** (به هر چیزی احاطه علمی دارد). و ما به صفت علمی که خداوند به پدر دوم که همان نفس کلی منبعث است، عطا کرد، اشاره نمودیم. پس او سبحانه داناست به آنچه ایجاد می‌کند و تواناست بر ایجاد آنچه می‌خواهد ایجاد کند و هیچ مانعی برای او نیست. پس امر را قرار داد که میان آسمان و زمین نازل شود، مانند فرزندی که میان پدر و مادر ظاهر می‌شود.\n\n### [شعاع‌های کواکب و اتصال آن‌ها به ارکان چهارگانه]\n\nو اما اتصال شعاع‌های نوری کواکب از حرکت فلکی آسمانی به ارکان چهارگانه که مادر مولودات هستند، در یک زمان واحد برای همه با هم، حق آن را مثالی برای عارفان قرار داد در نکاح اهل بهشت با همه زنان و کنیزانشان در یک آن واحد، نکاحی حسی. همان‌گونه که این اتصالات حسی هستند. پس مرد در بهشت با همه منکوحات (همسران) خود، اگر آن را بخواهد، در یک آن واحد، نکاحی جسمانی و محسوس با ایلاج (دخول) و وجود لذتی خاص برای هر زن، بدون تقدم و تأخر، انجام می‌دهد. و این همان نعیم دائم و اقتدار الهی است. و عقل از درک این حقیقت از جهت فکر خود عاجز است، بلکه این را با نیرویی دیگر الهی در قلب هر کس از بندگانش که بخواهد، درک می‌کند. همان‌گونه که انسان در بهشت در بازار صور، اگر صورتی را بخواهد، در آن داخل می‌شود، همان‌گونه که روح در اینجا نزد ما شکل می‌گیرد، اگرچه جسم است، ولی خداوند این قدرت را به او داده است. و خداوند **عَلى‏ كُلِّ شَيْءٍ قَدِيرٌ** (بر هر چیزی تواناست). و حدیث بازار بهشت را ابوعیسی ترمذی در مصنف خود ذکر کرده است، پس آن را در آنجا ببین. پس هنگامی که شعاع‌های نوری در ارکان چهارگانه متصل شوند، مولودات از این نکاح که عزیز علیم آن را مقدر کرده، ظاهر می‌شوند. پس مولودات میان پدران که همان افلاک و انوار علوی هستند، و مادران که همان ارکان طبیعی سفلی هستند، قرار می‌گیرند. و شعاع‌های متصل شده از انوار به ارکان، مانند نکاح می‌شوند. و حرکات افلاک و شناوری انوار، به منزله حرکات مجامع (آمیزش‌کنندگان) است. و حرکات ارکان به منزله مخاض (درد زایمان) برای زن است برای استخراج زبده (خلاصه) که با مخض (تکان دادن) خارج می‌شود، و آن همان چیزی است که از مولودات در این ارکان برای چشم ظاهر می‌شود، از صورت معادن و نبات و حیوان و نوع جن و انس. پس منزه است توانایی که بر هر چه بخواهد قادر است. هیچ معبودی جز او نیست، پروردگار و مالک هر چیز.\n\n### [شکر برای خدا و والدین از مقام کلی]\n\nخداوند متعال فرمود: **أَنِ اشْكُرْ لِي ولِوالِدَيْكَ** (که شکرگزار من و پدر و مادرت باش). ای ولی، پدران و مادرانت برای تو روشن شد که چه کسانی هستند؛ تا نزدیک‌ترین پدرت که عین تو به واسطه او ظاهر شد و همچنین مادر نزدیکت، تا پدر اول که جد اعلی است و تا آنچه میان آن‌ها از پدران و مادران است. شکر آن‌ها که با آن شاد و مسرور می‌شوند و با ستایش آن‌ها خوشحال می‌گردند، این است که آن‌ها را به مالک و هستی‌بخششان نسبت دهی و فعل را از آن‌ها سلب کنی و آن را به مستحقش که خالق هر چیز است، ملحق سازی. اگر چنین کنی، با این کار سروری بر پدرانت وارد کرده‌ای و وارد کردن این سرور بر آن‌ها، عین نیکی تو به آن‌ها و شکر تو از آن‌هاست. و اگر این کار را نکنی و خداوند را به واسطه آن‌ها فراموش کنی، نه شکر آن‌ها را به جا آورده‌ای و نه امر خداوند را در شکر آن‌ها امتثال کرده‌ای. زیرا فرمود: **أَنِ اشْكُرْ لِي** (که شکرگزار من باش)، پس خود را مقدم داشت تا به تو بشناساند که او سبب اول و اولی است. سپس عطف کرد و فرمود: **ولِوالِدَيْكَ** (و پدر و مادرت)، و آن‌ها اسبابی هستند که خداوند تو را نزد آن‌ها ایجاد کرده است تا آن‌ها را به او سبحانه نسبت دهی و آن‌ها بر تو فضل تقدم در هستی را داشته باشند، نه فضل تأثیر را، زیرا در حقیقت آن‌ها تأثیری ندارند، اگرچه اسباب وجود آثار هستند. پس به همین اندازه، فضل برای آن‌ها صحیح است و از تو شکر خواسته شده است. و حق، آن‌ها را نزد تو و برای تو در منزلت تقدم بر تو قرار داده است، نه در اثر، تا ستایش به تقدم و تأثیر برای خداوند متعال باشد و به تقدم و توقف برای والدین، اما بر اساس آنچه شرط کردیم. پس هیچ کس را در عبادت پروردگارت شریک مگردان. پس اگر خداوند متعال را ستایش کردی و گفتی: پروردگار ما و پروردگار پدران علوی ما و مادران سفلی ما، فرقی نمی‌کند که من آن را بگویم یا همه بنی آدم از بشر آن را بگویند. زیرا شخص خاصی مورد خطاب قرار نگرفته است تا پدران و مادرانش را از آدم و حوا تا زمان خود بیاورد، بلکه مقصود این نشأت انسانی است. پس تو مترجم از جانب هر مولودی با این تحمید از عالم ارکان و عالم طبیعت و انسان هستی. سپس در نیابت از هر مولودی که میان مؤثر و مؤثر فیه است، ارتقا می‌یابی و او را با هر زبانی حمد می‌گویی و با هر وجهی به او توجه می‌کنی. پس پاداش ما از جانب خداوند از آن مقام کلی خواهد بود.\n\n### [سلام کامل بر همه مردمان]\n\nهمان‌گونه که یکی از مشایخ من به من گفت: هنگامی که می‌گویی: «السلام علینا و علی عباد الله الصالحین» (سلام بر ما و بر بندگان صالح خدا) یا هنگامی که در راه به کسی سلام می‌کنی، می‌گویی: «السلام علیکم» (سلام بر شما)، باید در قلبت هر بنده صالحی از بندگان خدا در زمین و آسمان، مرده و زنده را حاضر کنی. زیرا از آن مقام (کلی) به تو پاسخ داده می‌شود. پس هیچ فرشته مقرب و روح مطهری نمی‌ماند که سلام تو به او برسد، مگر اینکه به تو پاسخ دهد. و این دعایی است که در حق تو مستجاب می‌شود و رستگار می‌شوی. و کسانی از بندگان خدا که در جلال او غرق شده‌اند و به او مشغولند و در او مستغرق‌اند و سلام تو با این شمول به آن‌ها نرسیده است، خداوند از جانب آن‌ها به تو پاسخ می‌دهد. و همین شرافت برای تو کافی است که حق به تو سلام کند. ای کاش هیچ یک از کسانی که به آن‌ها سلام کردی، پاسخ نمی‌دادند تا حق از جانب همه به تو پاسخ دهد، زیرا او برای تو شریف‌تر است. خداوند متعال در تشریف یحیی (علیه السلام) فرمود: **وسَلامٌ عَلَيْهِ يَوْمَ وُلِدَ ويَوْمَ يَمُوتُ ويَوْمَ يُبْعَثُ حَيًّا** (و سلام بر او روزی که متولد شد و روزی که می‌میرد و روزی که زنده برانگیخته می‌شود). و این سلام فضیلت و اخبار است. پس چگونه است سلام واجب که حق به جای کسی که از پاسخ دادن عاجز است، پاسخ می‌دهد؟ و جزای فرائض (واجبات) بزرگ‌تر از جزای فضائل (مستحبات) است در حق کسی که درباره‌اش گفته شد: **وسَلامٌ عَلَيْهِ يَوْمَ وُلِدَ**. پس برای او میان دو فضیلت جمع می‌شود. و صلاة (درود) خداوند بر ما به صورت ابتدایی وارد شده است. و به من نرسیده است که آیا سلام نیز به صورت ابتدایی وارد شده است، همان‌گونه که صلاة وارد شده است یا خیر. پس هر کس در این باره چیزی روایت کرده و آن را محقق ساخته است، امانتی بر گردن او قرار داده‌ام که آن را در این موضع، در کنار صلاة خداوند بر ما در این باب، ملحق سازد تا بشارتی برای مؤمنان و شرافتی برای این کتاب من باشد. و خداوند یاری‌دهنده و موفق‌کننده است، پروردگاری جز او نیست.\n\n### [پدران طبیعی و مادران طبیعی]\n\nو اما پدران طبیعی و مادران طبیعی، ما آن‌ها را ذکر نکردیم. پس امر کلی از آن را ذکر می‌کنیم. و آن‌ها دو پدر و دو مادر هستند. دو پدر، فاعل‌ها هستند و دو مادر، منفعل‌ها (تأثیرپذیرها). و آنچه از آن‌ها پدید می‌آید، منفعل از آن‌هاست. پس حرارت و برودت (سردی) فاعل هستند و رطوبت و یبوست (خشکی) منفعل هستند. پس حرارت با یبوست نکاح کرد و رکن آتش را تولید کرد. و حرارت با رطوبت نکاح کرد و رکن هوا را تولید کرد. سپس برودت با رطوبت نکاح کرد و رکن آب را تولید کرد. و برودت با یبوست نکاح کرد و رکن خاک را تولید کرد. پس حقایق پدران و مادران در فرزندان حاصل شد. پس آتش، گرم و خشک بود؛ گرمی‌اش از جهت پدر و خشکی‌اش از جهت مادر. و هوا، گرم و مرطوب بود؛ گرمی‌اش از جهت پدر و رطوبت‌اش از جهت مادر. و آب، سرد و مرطوب بود؛ سردی‌اش از جهت پدر و رطوبت‌اش از جهت مادر. و زمین، سرد و خشک بود؛ سردی‌اش از جهت پدر و خشکی‌اش از جهت مادر. پس حرارت و برودت از علم هستند و رطوبت و یبوست از اراده. این حد تعلق آن‌ها در هستی‌شان از علم الهی است و آنچه از قدرت از آن‌ها متولد می‌شود. سپس توالد در این ارکان از جهت اینکه مادر برای پدران انوار علوی هستند، واقع می‌شود، نه از جهت اینکه خود پدر هستند، اگرچه پدری در آن‌ها موجود است. ما به تو شناساندیم که پدری و فرزندی از اضافات و نسبت‌ها هستند. پس پدر، پسرِ پدری است که او پسر اوست، و پسر، پدرِ پسری است که او پدر اوست. و همچنین باب نسبت‌ها. پس در آن بنگر. و خداوند موفق‌کننده است، پروردگاری جز او نیست. و چون یبوست منفعل از حرارت بود و رطوبت منفعل از برودت بود، ما درباره رطوبت و یبوست گفتیم که آن‌ها منفعل هستند و آن‌ها را به منزله مادر برای ارکان قرار دادیم. و چون حرارت و برودت فاعل بودند، آن‌ها را به منزله پدر برای ارکان قرار دادیم. و چون صنعت مستلزم صنعتگری است و منفعل ذاتاً طالب فاعل است، زیرا منفعل ذاتاً منفعل است و اگر ذاتاً منفعل نبود، انفعال و اثر را نمی‌پذیرفت و مؤثر می‌بود، بر خلاف فاعل که با اختیار فعل می‌کند؛ اگر بخواهد فعل می‌کند و فاعل نامیده می‌شود و اگر بخواهد ترک می‌کند، و این برای منفعل نیست. و به دلیل همین حقیقت، خداوند متعال فرمود، و این از فصاحت و ایجاز قرآن است: **ولا رطب ولا يابس إلا في كتاب مبين** (و هیچ تر و خشکی نیست مگر در کتابی آشکار). پس منفعل را ذکر کرد و «و نه گرم و نه سرد» را ذکر نکرد، زیرا رطوبت و یبوست نزد علمای طبیعت، طالب حرارت و برودت هستند که منفعل از آن‌ها هستند، همان‌گونه که صنعت طالب صنعتگر است. به همین دلیل آن‌ها را ذکر کرد بدون ذکر اصل، اگرچه همه در کتاب مبین هستند. به راستی که خداوند به سید ما محمد (صلی الله علیه و سلم) علومی عطا کرد که هیچ کس جز او به آن‌ها دست نیافت، همان‌گونه که فرمود: «پس علم اولین و آخرین را دانستم» در حدیث ضربه با دست. پس علم الهی اصل همه علوم است و همه به آن باز می‌گردند. و ما آنچه را که این باب استحقاق آن را داشت، با نهایت ایجاز و اختصار به پایان رساندیم، زیرا تفصیل در آن تنها با ذکر کیفیات است، اما اصول را ذکر کردیم و مهیا ساختیم. و خداوند **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و او راه را هدایت می‌کند). جزء دوازدهم به پایان رسید."
  },
  "page_count": 6
}