{
  "id": 289,
  "title": {
    "ar": "الباب التاسع والثمانون ومائتان في معرفة منزل العلم الأمي الذي ما تقدمه علم من الحضرة الموسوية",
    "en": "Chapter Two Hundred and Eighty-Nine: Concerning the Gnosis of the Station (منزل) of the Unlettered Knowledge (العلم الأمي), which no knowledge preceded it, from the Mosaic Presence (الحضرة الموسوية).",
    "ur": "باب دو سو نواسی: اس علم امّی (العلم الأمي) کے مقام کی معرفت کے بیان میں، جس سے پہلے حضرت موسویہ (الحضرة الموسوية) کی جانب سے کوئی علم نہیں آیا۔",
    "fa": "باب دویست و هشتاد و نهم در معرفت منزل علم اُمّی که هیچ علمی از حضرت موسوی بر آن پیشی نگرفته است"
  },
  "content": {
    "ar": "## «الباب التاسع والثمانون ومائتان في معرفة منزل العلم الأمي الذي ما تقدمه علم من الحضرة الموسوية»\n\n\n> العلم بالله تزيين وتحلية *** والعلم بالفكر تشبيه وتضليل‏\n\n\n> والعلم بالفكر إجمال ومغلطة *** والعلم بالله تحقيق وتفصيل‏\n\n\n> والعلم بالفكر أعلام مجردة *** والعلم بالله تحويل وتبديل‏\n\n\n> فلا تغرنك أقوال مزخرفة *** فإن مدلولها جهل وتعليل‏\n\n\n> فالفيلسوف يرى نفي الإله بما *** تعطيه علته وذاك تعطيل‏\n\n\n> والأشعري يرى عينا مكثرة *** وذاك علم ولكن فيه تمثيل‏\n\n\n### [الأمية عند ابن العربي‏]\n\n\nالأمية عندنا لا تنافي حفظ القرآن ولا حفظ الأخبار النبوية ولكن الأمية عندنا من لم يتصرف بنظره الفكري وحكمه العقلي في استخراج ما تحوي عليه من المعاني والأسرار وما تعطيه من الأدلة العقلية في العلم بالإلهيات وما تعطيه للمجتهدين من الأدلة الفقهية والقياسات والتعليلات في الأحكام الشرعية فإذا سلم القلب من علم النظر الفكري شرعا وعقلا كان أميا وكان قابلا للفتح الإلهي على أكمل ما يكون بسرعة دون بطء ويرزق من العلم اللدني في كل شي‏ء ما لا يعرف قدر ذلك إلا نبي أو من ذاقه من الأولياء وبه تكمل درجة الايمان ونشأته ويقف بهذا العلم على إصابة الأفكار وغلطاتها وبأي نسبة ينسب إليها الصحة والسقم وكل ذلك من الله ويعلم مع حكمه بالباطل أنه لا باطل في الوجود إذ كان كل ما دخل في الوجود من عين وحكم لله تعالى لا لغيره فلا عبث ولا باطل في عين ولا حكم إذ لا فعل إلا لله ولا فاعل إلا الله ولا حكم إلا لله ولا حاكم إلا الله فمن تقدمه العلم بما ذكرناه فبعيد إن يحصل له من العلم اللدني الإلهي ما يحصل للأمي منا الذي ما تقدمه ما ذكرناه فإن الموازين العقلية وظواهر الموازين الاجتهادية في الفقهاء ترد كثيرا مما ذكرناه إذ كان الأمر جله ومعظمه فوق طور العقل وميزانه لا يعمل هنالك وفوق ميزان المجتهدين من الفقهاء لا فوق الفقه فإن ذلك عين الفقه الصحيح والعلم الصريح وفي قصة موسى والخضر دليل قوي على ما ذكرناه فكيف حال الفقيه وأين الأينية وما شاكلها التي نسبها الشارع والكشف إلى الإله من الموازين النظرية والبراهين العقلية على زعم العقل وحكم المجتهد فالرحمة التي يعطيها الله عبده أن يحول بينه وبين العلم النظري والحكم الاجتهادي من جهة نفسه حتى يكون الله يحابيه بذلك في الفتح الإلهي والعلم الذي يعطيه من لدنه قال تعالى في حق عبده خضر عَبْداً من عِبادِنا فأضافه إلى نون الجمع\n\n\nآتَيْناهُ رَحْمَةً من عِنْدِنا بنون الجمع وعَلَّمْناهُ بنون الجمع من لَدُنَّا بنون الجمع عِلْماً أي جمع له في هذا الفتح العلم الظاهر والباطن وعلم السر والعلانية وعلم الحكم والحكمة وعلم العقل والوضع وعلم الأدلة والشبه ومن أعطى العلم العام وأمر بالتصرف فيه كالأنبياء ومن شاء الله من الأولياء أنكر عليه ولم ينكر هذا الشخص على أحد ما يأتي به من العلوم وإن حكم بخلافه ولكن يعرف موطنه وأين يحكم به فيعطي البصر حقه في حكمه وسائر الحواس ويعطي العقل حكمه وسائر القوي المعنوية ويعطي النسب الإلهية والفتح الإلهي حكمهم فبهذا يزيد العالم الإلهي على غيره وهو\nالبصيرة التي نزل القرآن بها في قوله تعالى أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي وهو تتميم قوله تعالى بَعَثَ في الْأُمِّيِّينَ رَسُولًا مِنْهُمْ فهو النبي الأمي الذي يدعو على بصيرة مع أميته والأميون هم الذين يدعون معه إلى الله على بصيرة فهم التابعون له في الحكم إذ كان رأس الجماعة والمجتهد وصاحب الفكر لا يكون أبدا على بصيرة فيما يحكم به فأما المجتهد فقد يحكم اليوم في نازلة شرعية بحكم فإذا كان في غد لاح له أمر آخر أبان له خطأ ما حكم به بالأمس في النازلة فرجع عنه وحكم اليوم بما ظهر له ويمضي الشارع حكمه في الأول والآخر ويحرم عليه الخروج عما أعطاه الدليل في اجتهاده في ذلك الوقت فلو كان على بصيرة لما حكم بالخطإ في النظر الأول بخلاف حكم النبي فإن ذلك صحيح أعني الحكم الأول ثم رفع الله ذلك الحكم بنقيضه وسمي ذلك نسخا وأين النسخ من الخطاء فالنسخ يكون مع البصيرة والخطاء لا يكون مع البصيرة وكذلك صاحب العقل وهو واقع من جماعة من العقلاء إذا نظروا واستوفوا في نظرهم الدليل وعثروا على وجه الدليل أعطاهم ذلك العلم بالمدلول ثم تراهم في زمان آخر أو يقوم لهم خصم من طائفة أخرى كمعتزلي وأشعري أو برهمى أو فيلسوف بأمر آخر يناقض دليله الذي كان يقطع به ويقدح فيه فينظر فيه فيرى إن ذلك الأول كان خطأ وأنه ما استوفى أركان دليله وأنه أخل بالميزان في ذلك ولم يشعر وأين هذا من البصيرة ولما ذا لا يقع له هذا في ضرورات العقل فالبصيرة في الحكم لأهل هذا الشأن مثل الضروريات للعقول فمثل هذا العلم ينبغي للإنسان أن يفرح به حكي عن أبي حامد الغزالي المترجم عن أهل هذه الطريقة بعض ما كانوا يتحققون به قال لما أردت أن انخرط في سلكهم وآخذ مأخذهم وأغرف من البحر الذي اغترفوا منه خلوت بنفسي واعتزلت عن نظري وفكري وشغلت نفسي بالذكر فانقدح لي من العلم ما لم يكن عندي ففرحت بذلك وقلت إنه قد حصل لي ما حصل للقوم فتأملت فيه فإذا فيه قوة فقهية مما كنت عليه قبل ذلك فعلمت أنه بعد ما خلص لي فعدت إلى خلوتي واستعملت ما استعمله القوم فوجدت مثل الذي وجدت أولا وأوضح وأسنى فسررت فتأملت فإذا فيه قوة فقهية مما كنت عليه وما خلص لي عاودت ذلك مرارا والحال الحال فتميزت عن سائر النظار أصحاب الأفكار بهذا القدر ولم ألحق بدرجة القوم في ذلك وعلمت أن الكتابة على المحو ليست كالكتابة على غير المحو أ لا ترى الأشجار منها ما يتقدم ثمره زهره وهو كمرتبة علماء النظر إذا دخلوا طريق الله كالفقيه والمتكلم ومنه ما لا يتقدم ثمره زهره وهو الأمي الذي لم يتقدم علمه اللدني علم ظاهر فكري فيأتيه ذلك بأسهل الوجوه وسبب ذلك أنه لما كان لا فاعل إلا الله وجاء هذا الفقيه والمتكلم إلى الحضرة الإلهية بميزانهما ليزنوا على الله وما عرفوا إن الله تعالى ما أعطاهم تلك الموازين إلا ليزنوا بها لله لا على الله فحرموا الأدب ومن حرم الأدب عوقب بالجهل بالعلم اللدني الفتحي فلم يكن على بصيرة من أمره فإن كان وافر العقل علم من أين أصيب فمنهم من دخل وترك ميزانه على الباب حتى إذا خرج أخذه ليزن به لله وهذا أحسن حالا ممن دخل به على الله ولكن قلبه متعلق بما تركه إذ كان في نفسه الرجوع إليه فحرم من الحق المطلوب بقدر ما تعلق به خاطره فيما تركه للالتفات الذي له إليه وأحسن من هذا حالا من كسر ميزانه فإن كان خشبا أحرقه وإن كان مما يذوب أذابه أو برده حتى يزول كونه ميزانا وإن بقي عين جوهره فلا يبالي وهذا عزيز جدا ما سمعنا أن أحدا فعله فإن فرضنا وليس بمحال إن الله قوى بعض عباده حتى فعل مثل هذا كما ذكر أبو حامد الغزالي عن نفسه أنه بقي أربعين يوما حائرا وهذا خطر ليس حال الأمي على هذا فإن الأمي يدخل إلى الله مؤمنا وهذه الحال التي ذكرها أبو حامد ليست حال القوم وإنما هي حالة من لم يكن على شريعة فأراد إن يعرف ما ثم فسأل فدل على طريق القوم فدخل ليعرف الحق بتعريف الله فهذا أيضا طاهر المحل وأبو حامد\n\n\nكان محله مشغولا بالحيرة فلم يقو قوة هذا في قبول ما يرد به الفتح الإلهي فإذا اتفق على التقدير أن يفتح على مثل هذا الشخص الذي هو بهذه المثابة أبصر فيما يفتح له به تلك الموازين التي أذهبها فيعجب من ذلك فلما خرج خرج بها فوزن بها لله لا عليه كما فعلته الأنبياء عليهم السلام فهو لا يرد شيئا ولا يضع شيئا في غير ميزانه وارتفع الغلط والشك وعرف معنى قوله ونَضَعُ الْمَوازِينَ الْقِسْطَ لِيَوْمِ الْقِيامَةِ فجعلها موازين كثيرة ليزن بكل ميزان ما وضع له ولما وزن المتكلم بميزان عقله ما هو خارج عن‏\nالعقل لكونه وراء طوره وهو النسب الإلهية لم يقبله ميزانه ورمى به وكفر به وتخيل أنه ما ثم حق إلا ما دخل في ميزانه والمجتهد الفقيه وزن حكم الشرع بميزان نظره كالشافعي المذهب مثلا أراد أن يزن بميزانه تحليل النبيذ الذي قبله ميزان أبي حنيفة فرمى به ميزان الشافعي فحرمه وقال أخطأ أبو حنيفة ولم يكن ينبغي للشافعي المذهب مثلا أن يقول مثل هذا دون تقييد وقد علم إن الشرع قد تعبد كل مجتهد بما أداه إليه اجتهاده وحرم عليه العدول عن دليله فما وفى الصنعة حقها وأخطأ الميزان العام الذي يشمل حكم الشريعة على الإطلاق وهو الذي استند إليه علماء الشريعة بلا خلاف في أصول الأدلة وفي فروع الأحكام فأما في الأصول فالمثبتون القياس دليلا أداهم إلى ذلك اجتهادهم المشروع لهم وقد علم المخالف لهم من الظاهرية أن كل مجتهد متعبد بما أعطاه اجتهاده ولكن يقول فيهم إنهم أخطئوا في إثباتهم القياس دليلا وليس للظاهرية تخطئة ما قرره الشرع حكما فيثبت القياس دليلا شرعا ويثبت نفي القياس أن يكون دليلا شرعا وأما في الفروع‏\n\n\nفكعلي رضي الله عنه الذي يرى نكاح الربيبة إذا لم تكن في الحجر وإن دخل بأمها لعدم وجود الشرطين معا وإنه بوجودهما تحرم الربيبة\n\n\nيعني بالمجموع والمخالف لا يرى ذلك فالميزان العام يمضي حكم كل واحد منهما ولكن العامل بالميزان العام قليل لعدم الإنصاف فقد بينا في هذا الفصل سبب الحرمان الذي حكم على الفقهاء العقلاء النظار فلم يلجوا باب هذا العلم الشريف الإحاطي الذي يسلم لكل طائفة ما هي عليه سواء قادهم ذلك إلى السعادة أو إلى الشقاء ولا يسلم له أحد طريقه سوى من ذاق ما ذاقوه وآمن به كما قال أبو يزيد إذا رأيتم من يؤمن بكلام أهل هذه الطريقة ويسلم لهم ما يتحققون به فقولوا له يدعو لكم فإنه مجاب الدعوة وكيف لا يكون مجاب الدعوة والمسلم في بحبوحة الحضرة ولكن لا يعرف أنه فيها لجهله بها فالله يجعلنا ممن جعل له نورا من النور الذي يَهْدِي به من يَشاءُ من عِبادِهِ حتى يهدي به إِلى‏ صِراطٍ مُسْتَقِيمٍ صِراطِ الله الَّذِي لَهُ ما في السَّماواتِ وما في الْأَرْضِ من الموازين والصراطات أَلا إِلَى الله تَصِيرُ الْأُمُورُ وترجع قال تعالى في معرض الامتنان منه على رسوله صلى الله عليه وسلم وكَذلِكَ أَوْحَيْنا إِلَيْكَ رُوحاً من أَمْرِنا وهو قوله يُلْقِي الرُّوحَ من أَمْرِهِ ... ما كُنْتَ تَدْرِي ما الْكِتابُ ولا الْإِيمانُ وهو عرو المحل عن كل ما يشغله عن قبول ما أوحي به إليه ولكِنْ جَعَلْناهُ نُوراً يعني هذا المنزل نَهْدِي به من نَشاءُ من عِبادِنا فجاء بمن وهي نكرة في الدلالة مختصة عنده ببعض عباده من نبي أو ولي وإنك لتهدي بذلك النور الذي هديتك به فإن كان هذا العبد نبيا فهو شرع وإن كان وليا فهو تأييد لشرع النبي وحكمه أمر مشروع مجهول عند بعض المؤمنين به إِلى‏ صِراطٍ مُسْتَقِيمٍ في حق النبي طريق السعادة والعلم وفي حق الولي طريق العلم لما جهل من الأمر المشروع فيما يتضمنه من الحكمة قال تعالى يُؤْتِي الْحِكْمَةَ من يَشاءُ ومن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْراً كَثِيراً لا يقال فيه قليل ثم قال وما يَذَّكَّرُ إِلَّا أُولُوا الْأَلْبابِ واللب نور في العقل كالدهن في اللوز والزيتون والتذكر لا يكون إلا عن علم منسي فتنبه لما حررناه في هذه الآيات تسعد إن شاء الله تعالى وبعد أن أبنت لك عن مرتبة هذا العلم من هذا المنزل فلنبين أصل هذا العلم ومادة بقائه وحجاب مادته وبما ذا يوصل إلى ذلك بتأييد الله وتوفيقه‏\n\n\n### [العلوم الإلهي الذي ينتهى إليه العارفون‏]\n\n\nفاعلم إن أصل هذا العلم الإلهي هو المقام الذي ينتهي إليه العارفون وهو أن لا مقام كما وقعت به الإشارة بقوله تعالى يا أَهْلَ يَثْرِبَ لا مُقامَ لَكُمْ وهذا المقام لا يتقيد بصفة أصلا وقد نبه عليه أبو يزيد البسطامي رحمه الله لما قيل له كيف أصبحت فقال لا صباح لي ولا مساء إنما الصباح والمساء لمن تقيد بالصفة وأنا لا صفة لي فالصباح للشروق والمساء للغروب والشروق للظهور وعالم الملك والشهادة والغروب للستر وعالم الغيب والملكوت فالعارف في هذا المقام كالزيتونة المباركة التي لا هي شرقية ولا غربية فلا يحكم على هذا المقام وصف ولا يتقيد به وهو حظه من لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وسُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ فالمقام الذي بهذه المثابة هو أصل هذا العلم وبين هذا الأصل وهذا العلم مراتب فالأصل هو الثبات على التنزيه عن قبول الوصف والميل إلى حال دون حال ثم ينتج هذا الثبات صورة يتصف بها العارف لها ظاهر ولها باطن فالباطن منها لا يصل إليه إلا بعد المجاهدة البدنية والرياضة النفسية فإذا وصل إلى سر هذا الباطن وهو علم خاص هو لهذا العلم المطلوب كالدهن للسراج والعلم‏\nكالسراج فلا يظهر لهذا العلم ثمرة إلا في العلماء به كما لا يظهر للدهن حكم إلا في السراج القائم بالفتيلة وهنا يقع له اكتساب الأوصاف التي نزهنا الأصل عنها في ذلك المقام وفي هذا المقام نصفه بها من أجلنا لا من أجله فهذا الوصف للآثار لا له كان الله ولا شي‏ء معه وسيأتي الكلام على هذا الأصل في الباب الخمسين وثلاثمائة من هذا الكتاب ومما يتضمنه هذا المنزل علم خلق الأجسام الطبيعية وأن أصلها من النور ولذلك إذا عرف الإنسان كيف يصفي جميع الأجسام الكثيفة الظلمانية أبرزها شفافة للنورية التي هي أصلها مثل الزجاج إذا خلص من كدورة رملة يعود شفافا وجلى الأحجار من هذا الباب ومعادن البلور والمها وإنما كان ذلك لأن أصل الموجودات كلها الله من اسمه نُورُ السَّماواتِ وهي ما علا والْأَرْضِ وهي ما سفل فتأمل في إضافته النور إلى السموات والأرض ولو لا النورية التي في الأجسام الكثيفة ما صح للمكاشف أن يكشف ما خلف الجدران وما تحت الأرض وما فوق السموات ولو لا اللطافة التي هي أصلها ما صح اختراق بعض الأولياء الجدران ولا كان قيام الميت في قبره والتراب عليه أو التابوت مسمرا عليه مجعولا عليه التراب لا يمنعه شي‏ء من ذلك عن قعوده وإن كان الله قد أخذ بأبصارنا عنه ويكشفه المكاشف منا وقد ورد في ذلك أخبار كثيرة وحكايات عن الصالحين ولهذا ما ترى جسما قط خلقه الله وبقي على أصل خلقته مستقيما قط ما يكون أبدا إلا مائلا للاستدارة لا من جماد ولا من نبات ولا من حيوان ولا سماء ولا أرض ولا جبل ولا ورق ولا حجر وسبب ذلك ميلة إلى أصله وهو النور فأول موجود العقل وهو القلم وهو نور إلهي إبداعي وأوجد عنه النفس وهو اللوح المحفوظ وهي دون العقل في النورية للواسطة التي بينها وبين الله وما زالت الأشياء تكثف حتى انتهت إلى الأركان والمولدات وبما كان لكل موجود وجه خاص إلى موجدة به كان سريان النور فيه وبما كان له وجه إلى سببه به كان فيه من الظلمة والكثافة ما فيه فتأمل إن كنت عاقلا فلهذا كان الأمر كلما نزل أظلم وأكثف فأين منزلة العقل من منزلة الأرض كم بينهما من الوسائط ثم لتعلم إن جسم الإنسان آخر مولد فهو آخر الأولاد مركب من حَمَإٍ مَسْنُونٍ صَلْصالٍ وهو كما رأيت مائل إلى الاستدارة وإن كانت له الحركة المستقيمة دون البهائم والنبات وفيه من الأنوار المعنوية والحسية والزجاجية ما فيه مما لا تجده في غيره من المولدات بما أعطاه الله من القوي الروحانية فما قبلها إلا بالنورية التي فيه فهي المناسبة لقبول هذه الإدراكات ولهذا قال تعالى وآيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهارَ\n\n\n### [لو لا النور ما كانت ظلمة]\n\n\nفاعلم إن النور مبطون في الظلمة فلو لا النور ما كانت الظلمة ولم يقل نسلخ منه النور إذ لو أخذ منه النور لانعدم وجود الظلام إن كان أخذ عدم وإن كان أخذ انتقال تبعه حيث ينتقل إذ هو عين ذاته والنهار من بعض الأنوار المتولدة عن شروق الشمس فلو لا إن للظلمة نورا ذاتيا لها ما صح أن تكون ظرفا للنهار ولا صح أن تدرك وهي مدركة ولا يدرك الشي‏ء إن لم يكن فيه نور يدرك به من ذاته وهو عين وجوده واستعداده بقبول إدراك الأبصار بما فيها من الأنوار له واختص الإدراك بالعين عادة وإنما الإدراك في نفسه إنما هو لكل شي‏ء فكل شي‏ء يدرك بنفسه وبكل شي‏ء أ لا ترى الرسول صلى الله عليه وسلم كيف كان يدرك من خلف ظهره كما كان يدرك من أمامه ولم يحجبه كثافة عظم الرأس وعروقه وعظامه وعصبه ومخه غير إن الله أعطى الظلمة والكثافة الأمانة فهي تستر ما تحوي عليه ولهذا لا تظهر ما فيها فإذا ظهر فيكون خرق عادة لقوة إلهية أعطاها الله بعض الأشخاص وإذا أمر من أودع الأمانة من أودعها أن يظهرها لمن شاءه المودع وهو الحق تعالى فله أن يؤديها إليه فلا أمين مثل الأجسام المظلمة على ما تنطوي عليه من الأنوار وقد نبه الله على أمانتهم بذكر بعضهم في قوله وهذَا الْبَلَدِ الْأَمِينِ فسماه أمينا وهو أرض ذو جدران وأسوار وتراب وطين ولبن فوصفه بالأمانة وأقسم به كما أقسم بغيره تعظيما لمخلوقات الله وتعليما لنا أن نعظم خالقها ونعظمها بتعظيم الله إياها لا من جهة القسم بها فإنه لا يجوز لنا أن نقسم بها ومن أقسم بغير الله كان مخالفا أمر الله وهي مسألة فيها خلاف بين علماء الرسوم مشهور أعني القسم بغير الله فكلما اعوجت الأجسام كانت أقرب إلى الأصل الذي هو الاستدارة فإن أول شكل قبل الجسم الأول الاستدارة فكان فلكا ولما كان ما تحته عنه كان مثله وما بعد عنه كان قريبا منه ولو لم تكن الطبيعة نورا في أصلها لما وجدت بين النفس الكلية وبين الهيولى الكل والهيولى الذي هو الهباء أول ما ظهر الظلام بوجودها فهو\nجوهر مظلم فيه ظهرت الأجسام الشفافة وغيرها فكل ظلام في العالم من جوهر الهباء الذي هو الهيولى وبما هي في أصلها من النور قبلت جميع الصور النورية للمناسبة فانتفت ظلمتها بنور صورها فإن الصورة أظهرتها فنسبت إلى الطبع الظلمة في اصطلاح العقلاء وعندنا ليست الظلمة عبارة عن شي‏ء سوى الغيب إذ الغيب لا يدرك بالحس ولا يدرك به والظلمة تدرك ولا يدرك بها فلو لا إن الظلمة نور ما صح أن تدرك ولو كانت غيبا ما صح أن تشهد فالغيب لا يعلمه إلا هو وهذه كلها مفاتيح الغيب ولكن لا يعلم كونها مفاتح إلا الله يقول تعالى وعِنْدَهُ مَفاتِحُ الْغَيْبِ لا يَعْلَمُها إِلَّا هُوَ وإن كانت موجودة بيننا لكن لا نعلم أنها مفاتح للغيب وإذا علمنا بالأخبار أنها مفاتح لا نعلم الغيب حتى نفتحه بها فهذا بمنزلة من وجد مفتاح بيت ولا يعرف البيت الذي يفتحه به عالِمُ الْغَيْبِ فَلا يُظْهِرُ عَلى‏ غَيْبِهِ أَحَداً ثم لتعلم بعد ما عرفتك بسريان النور في الأشياء أن الخلق بين شقي وسعيد فبسريان النور في جميع الموجودات كثيفها ولطيفها المظلمة وغير المظلمة أقرت الموجودات كلها بوجود الصانع لها بلا شك ولا ريب وبما له الغيب المطلق لا تعلم ذاته من طريق الثبوت لكن تنزه عما يليق بالمحدثات كما أن الغيب يعلم أن ثم غيبا ولكن لا يعلم ما فيه ولا ما هو فإذا وردت الأخبار الإلهية على ألسنة الروحانيين ونقلتها إلى الرسل ونقلتها الرسل عليهم السلام إلينا فمن آمن بها وترك فكره خلف ظهره وقبلها بصفة القبول التي في عقله وصدق المخبر فيما أتاه به فإن اقتضى عملا زائدا على التصديق به عمله فذلك المعبر عنه بالسعيد وهو مما أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ وله الجزاء بما وعده به من الخير في دار القرار والنعيم الدائم الذي لا يجري إلى أجل مسمى فينقطع بحلول أجله من حيث الجملة حكما إلهيا لا يتبدل ولا ينخرم ولا ينتسخ ومن لم يؤمن بها وجعل فكره الفاسد أمامه واقتدى به ورد\n\n\nالأخبار النبوية إما بتكذيب الأصل وإما بالتأويل الفاسد فإن كذب المخبر بما أتاه به ولم يعمل بمقتضى ما قيل له إن اقتضى ذلك عملا زائدا على التصديق به فذلك المعبر عنه بالشقي وهو من جهة ما فيه من الظلمة كما آمن السعيد من جهة ما فيه من النور وله الجزاء بما أوعده إن كذب من الشر في دار البوار وعدم القرار لوجود العذاب الدائم الذي لا يجري إلى أجل مسمى وإن كان له أجل في نفس الأمر من حيث الجملة حكما إلهيا عدلا كما كان في السعيد فضلا لا يتبدل ولا ينخرم ولا ينتسخ وفي هذا خلاف بين أهل الكشف وهي مسألة عظيمة بين علماء الرسوم من المؤمنين وبين أهل الكشف وكذلك أيضا بين أهل الكشف فيها الخلاف هل يتسرمد العذاب عليهم إلى ما لا نهاية له أو يكون لهم نعيم بدار الشقاء فينتهي العذاب فيهم إلى أجل مسمى واتفقوا في عدم الخروج منها وإنهم بها ماكثون إلى ما لا نهاية له فإن لكل واحدة من الدارين ملؤها وتتنوع عليهم أسباب الآلام ظاهرا لا بد من ذلك وهم يجدون في ذلك لذة في أنفسهم بالخلاف المتقدم باطنا بعد ما يأخذ الألم منهم جزاء العقوبة حدثني عبد الله الموروري في جماعة غيره عن أبي مدين إمام الجماعة أنه قال يدخل أهل الدارين فيهما السعداء بفضل الله وأهل النار بعدل الله وينزلون فيهما بالأعمال ويخلدون فيهما بالنيات وهذا كشف صحيح وكلام حر عليه حشمة فيأخذ جزاء العقوبة الألم موازيا لمدة المعمر في الشرك في الدنيا فإذا فرغ الأمد جعل لهم نعيم في النار بحيث إنهم لو دخلوا الجنة تألموا لعدم موافقة المزاج الذي ركبهم الله فيه فهم يتلذذون بما هم فيه من نار وزمهرير وما فيها من لدغ الحيات والعقارب كما يلتذ أهل الجنة بالظلال والنور ولثم الحور الحسان لأن مزاجهم يقضي بذلك أ لا ترى الجعل في الدنيا هو على مزاج يتضرر بريح الورد ويلتذ بالنتن كذلك من خلق على مزاجه وقد وقع في الدنيا أمزجة على هذا شاهدناها فما ثم مزاج في العالم إلا وله لذة بالمناسب وعدم لذة بالمنافر أ لا ترى المحرور يتألم بريح المسك فاللذات تابعة للملائم والآلام لعدم الملائم فهذا الأمر محقق في نفسه لا ينكره عاقل وإنما الشأن هل أهل النار على هذا المزاج بهذه المثابة بعد فراغ المدة أم لا أو هم على مزاج يقتضي لهم الإحساس بالآلام للأشياء المؤلمة والنقل الصحيح الصريح النص الذي لا إشكال فيه إذا وجد مفيدا للعلم يحكم به بلا شك ف الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ وإن كنت لا أجهل الأمر في ذلك ولكن لا يلزم الإفصاح عنه فإن الإفصاح عنه لا يرفع الخلاف من العالم وبعض أهل الكشف قال إنهم يخرجون إلى الجنة حتى لا يبقى فيها أحد من الناس البتة وتبقي أبوابها تصفق وينبت فيها الجرجير ويخلق الله لها أهلا يملؤها بهم من مزاجها كما يخلق السمك في الماء وعالم الهواء في الهواء وعالم‏\nفي بطن الأرض لا حياة لهم إلا فيها كالخلد فإذا حصل على ظهر الأرض مات فالغم الذي لنا في ذلك الغم حياتهم فالسمك إذا خرج إلى الهواء مات وكان في الهواء غمه فينطفي فيه نور حياته والإنسان والحيوان البري إذا غرق في الماء هلك وكان في الماء غمه ينطفي به نور حياته وثم حيوان يرى بحري يعيش هنا ويعيش هنا كالتماسح وإنسان الماء وكلبه وبعض الطيور وهذا كله بالطبع والمزاج الذي ركبه الله عليه وقد ذكرنا في هذا المنزل ما فيه كفاية واستوفينا أصوله بعون الله والهامة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Eighty-Nine: Concerning the Knowledge of the Station of the Unlettered Science (العلم الأمي), which is not preceded by knowledge from the Mosaic Presence (الحضرة الموسوية).\n\nKnowledge of Allah is adornment and beautification,\nWhile knowledge through intellect (الفكر) is anthropomorphism (تشبيه) and misguidance (تضليل).\n\nKnowledge through intellect is generalization and confusion,\nWhile knowledge of Allah is verification (تحقيق) and detailed explanation (تفصيل).\n\nKnowledge through intellect consists of abstract signs (أعلام مجردة),\nWhile knowledge of Allah is transformation (تحويل) and change (تبديل).\n\nSo let not embellished sayings deceive you,\nFor their meaning is ignorance and rationalization (تعليل).\n\nThe philosopher sees the negation of the Divine based on what his causality (علته) provides,\nAnd that is negation (تعطيل).\n\nThe Ash'ari sees a multiplied Essence (عينا مكثرة),\nAnd that is knowledge, but it contains representation (تمثيل).\n\n### The State of Being Unlettered (الأمية) according to Ibn Arabi\n\nThe state of being unlettered (الأمية) according to us does not negate the memorization of the Quran nor the memorization of Prophetic traditions (الأخبار النبوية). Rather, the state of being unlettered (الأمية) according to us belongs to him who does not engage his intellectual speculation (نظره الفكري) and rational judgment (حكمه العقلي) in extracting the meanings and secrets contained within [the texts], nor in deriving the rational proofs (الأدلة العقلية) they provide concerning the knowledge of the Divine (الإلهيات), nor in deriving the jurisprudential proofs (الأدلة الفقهية), analogies (القياسات), and rationalizations (التعليلات) they provide for the jurists (المجتهدين) regarding legal rulings (الأحكام الشرعية).\n\nIf the heart is safe from the knowledge of intellectual speculation (علم النظر الفكري), legally and rationally, then he is unlettered (أميا) and is receptive to the Divine Opening (الفتح الإلهي) in the most complete manner, swiftly and without delay. He is granted the Inspired Knowledge (العلم اللدني) concerning everything, the measure of which is known only by a Prophet or by one of the Friends of God (الأولياء) who has tasted it. Through this [knowledge], the degree and development of faith (الايمان) are perfected. By means of this knowledge, he stands upon the correctness and errors of intellectual thoughts, and the proportion by which soundness and sickness are attributed to them. All of this is from Allah.\n\nHe knows, along with his judgment of falsehood (الباطل), that there is no falsehood in Existence (الوجود), since everything that enters into Existence, whether essence (عين) or ruling (حكم), belongs to Allah the Exalted, not to another. Thus, there is no futility (عبث) or falsehood (باطل) in any essence or ruling, for there is no act (فعل) except for Allah, no agent (فاعل) except for Allah, no ruling (حكم) except for Allah, and no ruler (حاكم) except for Allah.\n\nWhoever is preceded by the knowledge we have mentioned is unlikely to attain the Divine Inspired Knowledge (العلم اللدني الإلهي) that is attained by the unlettered one (الأمي) among us, who was not preceded by what we mentioned. This is because the rational scales (الموازين العقلية) and the apparent scales of jurisprudential effort (الموازين الاجتهادية) among the jurists often reject much of what we have mentioned, since the matter, in its entirety and majority, is beyond the scope (طور) of the intellect and its scale does not operate there. It is also above the scale of the jurists who exert effort (المجتهدين من الفقهاء)—not above jurisprudence (الفقه) itself, for that [Inspired Knowledge] is the very essence of sound jurisprudence and clear knowledge (العلم الصريح).\n\nThe story of Moses and Al-Khidr provides strong evidence for what we have mentioned. What then is the state of the jurist? And where are the 'hows' (الأينية) and similar concepts that the Lawgiver (الشارع) and Unveiling (الكشف) attribute to the Divine, compared to the theoretical scales (الموازين النظرية) and rational proofs (البراهين العقلية) based on the claim of the intellect and the judgment of the jurist?\n\nThe mercy (الرحمة) that Allah grants His servant is that He intervenes between him and theoretical knowledge (العلم النظري) and self-derived jurisprudential judgment (الحكم الاجتهادي) so that Allah favors him with the Divine Opening (الفتح الإلهي) and the knowledge He grants from His Presence (لدنه). Allah the Exalted said concerning His servant Al-Khidr: <<عَبْداً من عِبادِنا>> (a servant from Our servants), attributing him to the plural 'We'. <<آتَيْناهُ رَحْمَةً من عِنْدِنا>> (We granted him mercy from Our Presence), using the plural 'We', and <<عَلَّمْناهُ من لَدُنَّا عِلْماً>> (We taught him knowledge from Our Presence), using the plural 'We'. Meaning: In this Opening (الفتح), He gathered for him both the manifest and the hidden knowledge, the knowledge of the secret and the public, the knowledge of ruling and wisdom, the knowledge of the intellect and convention, and the knowledge of proofs and ambiguities.\n\nWhoever is granted general knowledge and commanded to act upon it, such as the Prophets and whomever Allah wills among the Friends of God (الأولياء), will have his actions questioned. However, this person [the unlettered knower] does not question anyone regarding the sciences they bring forth, even if he rules contrary to them. Rather, he knows its proper place and where it should be applied. Thus, he gives the sight (البصر) its due in its ruling, and likewise all the senses. He gives the intellect its ruling, and likewise all the spiritual faculties (القوي المعنوية). And he gives the Divine Relations (النسب الإلهية) and the Divine Opening (الفتح الإلهي) their rulings.\n\nIt is by this that the Divine Knower (العالم الإلهي) surpasses others. This is the insight (البصيرة) with which the Quran descended, in His saying, the Exalted: <<أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي>> (I call unto Allah upon insight (بصيرة)—I and whoever follows me). This completes His saying, the Exalted: <<بَعَثَ في الْأُمِّيِّينَ رَسُولًا مِنْهُمْ>> (He raised among the unlettered (الأُمِّيِّينَ) a Messenger from among them). He is the Unlettered Prophet (النبي الأمي) who calls upon insight (بصيرة) despite his unletteredness. The unlettered ones (الأميون) are those who call unto Allah with him upon insight, for they are his followers in judgment.\n\nThe jurist who exerts effort (المجتهد) and the man of intellectual speculation (صاحب الفكر) are never upon insight (بصيرة) in what they rule. As for the jurist, he may rule today on a legal case (نازلة شرعية) with one ruling, but tomorrow, another matter becomes clear to him, showing him the error of his ruling yesterday concerning that case, so he retracts it and rules today according to what has become manifest to him. The Lawgiver (الشارع) executes his ruling in the first and the last instance, and it is forbidden for him [the jurist] to deviate from what the evidence provided him in his effort (اجتهاده) at that time. If he were upon insight (بصيرة), he would not have ruled erroneously in the first consideration. This is contrary to the ruling of the Prophet, for that [first] ruling is sound—meaning the first ruling—then Allah abrogated (رفع) that ruling with its opposite, and this is called abrogation (نسخ). Where is abrogation compared to error? Abrogation occurs with insight (بصيرة), while error does not occur with insight.\n\nSimilarly, the man of intellect (صاحب العقل)—and this happens to a group of rationalists—when they speculate and fully exhaust the evidence and stumble upon the face of the proof, that grants them knowledge of the signified (المدلول). Then you see them at another time, or an opponent from another group—such as a Mu'tazili, an Ash'ari, a Barahmi, or a philosopher—rises against them with another matter that contradicts their proof which they were certain of, and casts doubt upon it. He then examines it and sees that the first [conclusion] was an error, that he had not fulfilled the pillars of his proof, and that he had violated the scale (الميزان) in that matter without realizing it. Where is this compared to insight (البصيرة)? And why does this not happen to him in the necessities of the intellect (ضرورات العقل)? Insight (البصيرة) in judgment for the people of this station is like the necessities (الضروريات) for the intellects.\n\nSuch knowledge is what a person should rejoice in. It is related concerning Abu Hamid al-Ghazali, who translated some of the realizations of the people of this Path (الطريقة), that he said: \"When I desired to join their ranks, adopt their approach, and draw from the sea from which they drew, I secluded myself and withdrew from my speculation and thought (نظري وفكري). I occupied myself with remembrance (الذكر), and knowledge flashed upon me that I did not possess before. I rejoiced in this and said that I had attained what the people had attained. I reflected upon it, and behold, it contained a jurisprudential strength (قوة فقهية) from what I had been upon before that. So I knew that it had not yet been purified for me.\"\n\n\"I returned to my seclusion and employed what the people employed. I found the same thing I found the first time, but clearer and more radiant. I was pleased. I reflected, and behold, it contained a jurisprudential strength from what I had been upon, and it had not been purified for me.\" \"I repeated this several times, and the situation remained the same. I distinguished myself from the rest of the speculative thinkers (النظار أصحاب الأفكار) by this much, but I did not reach the degree of the People (القوم) in that.\" \"I knew that writing upon an erased surface (الكتابة على المحو) is not like writing upon a surface that has not been erased.\"\n\nDo you not see that among trees, some have their fruit precede their blossoms? This is like the rank of the scholars of speculation (علماء النظر) when they enter the path of Allah, such as the jurist and the theologian (المتكلم). And among them are those whose fruit does not precede their blossoms. This is the unlettered one (الأمي) whose Inspired Knowledge (علمه اللدني) is not preceded by apparent intellectual knowledge. This knowledge comes to him in the easiest ways.\n\nThe reason for this is that since there is no agent (فاعل) except Allah, this jurist and theologian came to the Divine Presence (الحضرة الإلهية) with their scales (ميزانهما) to weigh *against* Allah, not knowing that Allah the Exalted only gave them those scales to weigh *for* Allah, not *against* Allah. Thus, they were deprived of proper conduct (الأدب). Whoever is deprived of proper conduct is punished by ignorance of the Inspired Knowledge (العلم اللدني الفتحي) that comes through the Opening, and thus is not upon insight (بصيرة) concerning his affair. If he is highly intelligent, he knows where he was afflicted.\n\nAmong them are those who entered and left their scale at the door, so that when they exit, they take it to weigh *for* Allah. This one is in a better state than the one who entered with it upon Allah. However, his heart is attached to what he left behind, since he intends to return to it. Thus, he is deprived of the sought Reality (الحق المطلوب) to the extent that his mind is attached to what he left, due to the turning back (الالتفات) he has toward it.\n\nBetter in state than this is the one who breaks his scale. If it is wood, he burns it; if it is something that melts, he dissolves it or files it down until its nature as a scale is removed, even if the essence of its substance remains. He does not care. This is very rare; we have not heard of anyone who did this. If we hypothesize—and it is not impossible—that Allah strengthened some of His servants to do such a thing, as Abu Hamid al-Ghazali mentioned about himself that he remained perplexed (حائرا) for forty days.\n\nThis is a danger (خطر). The state of the unlettered one (الأمي) is not like this, for the unlettered one enters unto Allah as a believer. The state mentioned by Abu Hamid is not the state of the People (القوم); rather, it is the state of one who was not upon a [Sufi] law (شريعة) and desired to know what was there. He asked and was guided to the path of the People, so he entered to know the Truth (الحق) through Allah's definition. This one also has a pure place (طاهر المحل). Abu Hamid’s place was occupied by perplexity (الحيرة), so he did not possess the strength of this [pure-hearted] person in accepting what the Divine Opening (الفتح الإلهي) brings.\n\nIf, hypothetically, an opening occurs for such a person who is in this position, he will perceive within what is opened to him those scales (الموازين) that he had discarded. He will be astonished by this. When he exits, he exits with them, and he weighs *for* Allah, not *against* Him, just as the Prophets (عليهم السلام) did. Thus, he neither rejects anything nor places anything outside its proper scale. Error and doubt are lifted, and he knows the meaning of His saying: <<ونَضَعُ الْمَوازِينَ الْقِسْطَ لِيَوْمِ الْقِيامَةِ>> (And We shall set up the Scales of Justice (الموازين القسط) for the Day of Resurrection). He made them many scales (موازين كثيرة) so that each scale weighs what it was designated for.\n\nWhen the theologian (المتكلم) weighed with his rational scale that which is outside the intellect, because it is beyond its scope (طور)—namely, the Divine Relations (النسب الإلهية)—his scale did not accept it, and he cast it aside, disbelieved in it, and imagined that there was no truth (حق) except what entered his scale. The jurist who exerts effort (المجتهد الفقيه) weighed the ruling of the Law (حكم الشرع) with the scale of his speculation. For example, the Shafi'i jurist wanted to weigh with his scale the permissibility (تحليل) of date-wine (النبيذ), which the scale of Abu Hanifa accepted. The scale of the Shafi'i cast it aside, so he forbade it and said, \"Abu Hanifa erred.\"\n\nIt was not appropriate for the Shafi'i jurist, for example, to say such a thing without qualification, for he knew that the Law (الشرع) has obligated every jurist (مجتهد) to follow what his effort (اجتهاده) led him to, and has forbidden him from deviating from his evidence. He did not give the craft its due and erred concerning the general scale (الميزان العام) which encompasses the ruling of the Sacred Law (الشريعة) absolutely. This is the scale upon which the scholars of the Law (علماء الشريعة) rely without dispute regarding the fundamental proofs (أصول الأدلة) and the subsidiary rulings (فروع الأحكام).\n\nAs for the fundamentals (الأصول): Those who affirm analogy (القياس) as a proof were led to it by their sanctioned effort (اجتهادهم المشروع لهم). Their opponents, the Literalists (الظاهرية), know that every jurist is obligated by what his effort provides, but they say that [the analogists] erred in establishing analogy as a proof. The Literalists are not permitted to declare erroneous what the Law has established as a ruling. Thus, analogy is established as a legal proof (دليلا شرعا), and the negation of analogy being a legal proof is also established.\n\nAs for the subsidiaries (الفروع): Such as Ali (رضي الله عنه) who held that marriage with a stepdaughter (الربيبة) is permissible if she was not under his guardianship (في الحجر), even if he had consummated the marriage with her mother, due to the absence of both conditions together. He held that by the existence of both, the stepdaughter is forbidden (تحرم الربيبة)—meaning by the combination [of conditions]. The opponent does not hold this view. The general scale (الميزان العام) validates the ruling of each of them. However, those who operate with the general scale are few due to the lack of fairness (الإنصاف).\n\nWe have explained in this section the reason for the deprivation imposed upon the rational, speculative jurists (الفقهاء العقلاء النظار). They did not enter the door of this noble, encompassing knowledge (العلم الشريف الإحاطي) which validates every group in what they are upon, whether that leads them to felicity (السعادة) or wretchedness (الشقاء). No one validates his path except one who has tasted what they have tasted and believed in it. As Abu Yazid said: \"If you see someone who believes in the words of the people of this Path (الطريقة) and validates their realizations (ما يتحققون به), tell him to pray for you, for his prayer is answered.\" How can his prayer not be answered when the one who validates is in the midst of the Divine Presence (بحبوحة الحضرة), yet he does not know he is in it due to his ignorance of it?\n\nMay Allah make us among those for whom He has made a light from the Light with which <<يَهْدِي به من يَشاءُ من عِبادِهِ>> (He guides whomever He wills among His servants), so that He guides him thereby <<إِلى‏ صِراطٍ مُسْتَقِيمٍ>> (to a straight path), <<صِراطِ الله الَّذِي لَهُ ما في السَّماواتِ وما في الْأَرْضِ>> (the path of Allah, to Whom belongs whatever is in the heavens and whatever is in the earth)—of scales (الموازين) and paths (الصراطات). <<أَلا إِلَى الله تَصِيرُ الْأُمُورُ>> (Unquestionably, to Allah all matters return).\n\nAllah the Exalted said, in the context of granting favor to His Messenger (صلى الله عليه وسلم): <<وكَذلِكَ أَوْحَيْنا إِلَيْكَ رُوحاً من أَمْرِنا>> (And thus We have revealed to you a Spirit (روحاً) from Our command)—which is His saying: <<يُلْقِي الرُّوحَ من أَمْرِهِ ... ما كُنْتَ تَدْرِي ما الْكِتابُ ولا الْإِيمانُ>> (He casts the Spirit by His command... You did not know what the Scripture was, nor [what] Faith [was]). This is the emptiness of the place (عرو المحل) from everything that would distract it from accepting what was revealed to it. <<ولكِنْ جَعَلْناهُ نُوراً>> (But We have made it a Light)—meaning this station (منزل)—<<نَهْدِي به من نَشاءُ من عِبادِنا>> (We guide thereby whomever We will among Our servants). He used *man* (من), which is indefinite in its indication, but specific in His view to some of His servants, whether Prophet or Friend of God (ولي). <<وإنك لتهدي بذلك النور الذي هديتك به>> (And indeed, you guide by that Light with which We have guided you). If this servant is a Prophet, it is a Law (شرع). If he is a Friend of God (ولي), it is a confirmation (تأييد) of the Prophet's Law, and his ruling is a sanctioned matter (أمر مشروع) unknown to some of those who believe in it. <<إِلى‏ صِراطٍ مُسْتَقِيمٍ>> (to a straight path). In the case of the Prophet, this is the path of felicity and knowledge. In the case of the Friend of God, it is the path of knowledge concerning the sanctioned matter that was unknown regarding the wisdom (الحكمة) it contains. Allah the Exalted said: <<يُؤْتِي الْحِكْمَةَ من يَشاءُ ومن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْراً كَثِيراً>> (He gives wisdom (الحكمة) to whomever He wills, and whoever is given wisdom has certainly been given much good). It is not said that it is little. Then He said: <<وما يَذَّكَّرُ إِلَّا أُولُوا الْأَلْبابِ>> (And none will remember except those of understanding (أُولُوا الْأَلْبابِ)). The core (اللب) is a light in the intellect, like the oil in the almond or the olive. Remembrance (التذكر) only occurs concerning forgotten knowledge. Pay attention to what we have elaborated in these verses, and you will be felicitous, if Allah the Exalted wills. Now that I have clarified for you the rank of this knowledge from this station (منزل), let us explain the origin of this knowledge, the substance of its subsistence, the veil of its substance, and by what means one reaches that, with Allah's support and success.\n\n### The Divine Sciences (العلوم الإلهي) to which the Gnostics Attain\n\nKnow that the origin of this Divine Science (العلم الإلهي) is the Station (المقام) to which the Gnostics (العارفون) attain, which is *no station* (أن لا مقام), as indicated by His saying, the Exalted: <<يا أَهْلَ يَثْرِبَ لا مُقامَ لَكُمْ>> (O people of Yathrib, there is no station for you). This Station is not restricted by any attribute (صفة) whatsoever. Abu Yazid al-Bistami (رحمه الله) drew attention to this when he was asked, \"How did you wake up this morning?\" He replied, \"I have no morning and no evening. Morning and evening belong only to one who is restricted by an attribute, and I have no attribute.\" Morning (الصباح) is for rising (الشروق), and evening (المساء) is for setting (الغروب). Rising is for manifestation (الظهور) and the world of dominion (الملك) and witnessing (الشهادة). Setting is for concealment (الستر) and the world of the Unseen (الغيب) and the Kingdom (الملكوت). The Gnostic (العارف) in this Station is like the blessed olive tree, which is neither eastern nor western. No description rules over this Station, nor is it restricted by it. This is his share of <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him) and <<سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصْفُونَ>> (Exalted is your Lord, the Lord of Might, above what they describe).\n\nThe Station that is of this nature is the origin (أصل) of this knowledge. Between this origin and this knowledge are levels (مراتب). The origin is steadfastness (الثبات) upon transcendence (التنزيه) from accepting description and from inclining toward one state over another. This steadfastness then produces a form (صورة) with which the Gnostic is described. This form has an outer aspect and an inner aspect. The inner aspect is reached only after physical striving (المجاهدة البدنية) and psychic discipline (الرياضة النفسية). When he reaches the secret of this inner aspect, which is a specific knowledge, it is to this sought knowledge like oil is to a lamp (السراج). Knowledge is like the lamp. The fruit of this knowledge only appears in those who possess it, just as the effect of oil only appears in the lamp that stands with a wick (الفتيلة). Here, he acquires the attributes (الأوصاف) from which we declared the Origin (الأصل) transcendent in that Station. In this Station, we describe him with them for our sake, not for his sake. This description belongs to the effects (الآثار), not to him. \"Allah was, and there was nothing with Him.\" The discussion of this Origin will come in Chapter Three Hundred and Fifty of this book.\n\nAmong what this station (منزل) contains is the knowledge of the creation of natural bodies (الأجسام الطبيعية) and that their origin is Light (النور). Therefore, if a person knows how to purify all dense, dark bodies (الأجسام الكثيفة الظلمانية), he will bring them forth transparent (شفافة) to the luminosity (النورية) which is their origin. This is like glass (الزجاج): when it is purified from the turbidity of sand, it returns to transparency. The polishing of stones (جلى الأحجار) and the minerals of crystal (البلور) and opal (المها) fall under this category. This is because the origin of all existent things (الموجودات) is Allah, from His Name: <<نُورُ السَّماواتِ>> (The Light of the heavens)—which is what is high—<<وَالْأَرْضِ>> (and the earth)—which is what is low. Reflect upon His attribution of Light to the heavens and the earth.\n\nWere it not for the luminosity (النورية) present in dense bodies, it would not be possible for the one who receives unveiling (المكاشف) to unveil what is behind walls, beneath the earth, and above the heavens. Were it not for the subtlety (اللطافة) which is their origin, it would not be possible for some Friends of God (الأولياء) to pass through walls, nor for the dead person to sit up in his grave, with the earth or a nailed coffin placed upon him, without anything preventing him from sitting up—even though Allah has veiled our sight from him. The one who receives unveiling among us can perceive him. Many reports and stories about the righteous (الصالحين) have been transmitted concerning this.\n\nFor this reason, you never see a body created by Allah that remains perfectly straight upon its original creation. It is always inclined toward circularity (الاستدارة), whether it is inanimate (جماد), plant (نبات), animal (حيوان), heaven (سماء), earth (أرض), mountain (جبل), leaf (ورق), or stone (حجر). The reason for this is its inclination toward its origin, which is Light (النور).\n\nThe first existent thing is the Intellect (العقل), which is the Pen (القلم), and it is a Divine Creative Light (نور إلهي إبداعي). From it, He brought into existence the Soul (النفس), which is the Preserved Tablet (اللوح المحفوظ). It is less luminous than the Intellect due to the intermediary (الواسطة) between it and Allah. Things continued to become denser until they reached the elements (الأركان) and the generated things (المولدات). Since every existent thing has a specific face toward its originator, the Light flows through it. And since it has a face toward its cause, it contains darkness and density accordingly. Reflect upon this if you are rational.\n\nTherefore, the lower the matter descends, the darker and denser it becomes. Where is the station of the Intellect compared to the station of the Earth? How many intermediaries are between them? Then know that the human body is the last generated thing (آخر مولد). It is the last of the offspring, composed of <<حَمَإٍ مَسْنُونٍ صَلْصالٍ>> (black mud molded into shape, of clay). As you see, it is inclined toward circularity (الاستدارة), even though it possesses straight movement, unlike animals and plants. It contains spiritual, sensory, and glassy lights (الأنوار المعنوية والحسية والزجاجية) that you do not find in other generated things, due to the spiritual faculties (القوي الروحانية) Allah has granted it. It only accepts these perceptions (الإدراكات) through the luminosity (النورية) within it, which is suitable for accepting these perceptions. For this reason, the Exalted said: <<وآيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهارَ>> (And a sign for them is the night; We strip [the light of] the day from it).\n\n### Were it not for Light, there would be no Darkness\n\nKnow that Light (النور) is hidden within Darkness (الظلمة). Were it not for Light, there would be no Darkness. He did not say, \"We strip the Light from it,\" for if the Light were taken from it, the existence of the darkness would cease. If the taking implies annihilation, [it ceases]; and if the taking implies transference, [the darkness] would follow it wherever it transfers, since [the Light] is the very essence of [the darkness]. The day (النهار) is one of the lights generated by the rising of the sun. Were it not that darkness possesses an essential light (نورا ذاتيا لها), it would not be possible for it to be a container (ظرفا) for the day, nor would it be possible for it to be perceived (تدرك). Yet it is perceived. A thing is not perceived unless it contains a light by which it is perceived from its own essence (ذاته), which is the very essence of its existence and its readiness to accept the perception of the eyes (الأبصار) through the lights within them. Perception is conventionally restricted to the eye, but perception in itself belongs to everything. Everything perceives by itself and by everything else.\n\nDo you not see how the Messenger (صلى الله عليه وسلم) used to perceive from behind his back just as he perceived from in front of him? The density of the skull, its veins, bones, nerves, and brain did not veil him. However, Allah has given darkness and density the quality of trust (الأمانة), so they conceal what they contain. Therefore, they do not reveal what is within them. If it is revealed, it is a breaking of habit (خرق عادة) due to a Divine power that Allah grants to certain individuals. If the one entrusted with the trust is commanded by the One who deposited it—namely, the Real (الحق تعالى)—to reveal it to whomever He wills, then he is permitted to render it to Him. There is no trustee (أمين) like the dark bodies (الأجسام المظلمة) concerning the lights they conceal.\n\nAllah drew attention to their trustworthiness by mentioning some of them in His saying: <<وهذَا الْبَلَدِ الْأَمِينِ>> (And [by] this secure city (البلد الأمين)). He called it secure (أمينا), and it is an earth with walls, fences, dust, clay, and bricks. He described it with trustworthiness and swore by it, just as He swore by others, in glorification of Allah's creations and as a teaching for us to glorify their Creator and to glorify them through Allah's glorification of them—not by swearing by them, for it is not permissible for us to swear by them. Whoever swears by other than Allah is disobeying Allah's command. This is a well-known point of contention among the scholars of convention (علماء الرسوم) regarding swearing by other than Allah.\n\nThe more crooked the bodies are, the closer they are to the origin, which is circularity (الاستدارة). The first shape before the first body was circularity, so it was a sphere (فلكا). Since what is beneath it originated from it, it was similar to it. What is distant from it was close to it. If Nature (الطبيعة) were not Light in its origin, there would be no existence between the Universal Soul (النفس الكلية) and the Universal Hyle (الهيولى الكل). Hyle (الهيولى), which is the Dust (الهباء), is the first thing in which darkness appeared through its existence. It is a dark substance (جوهر مظلم) in which transparent and other bodies appeared. All darkness in the world comes from the substance of the Dust (الهباء), which is Hyle (الهيولى). Since it is Light in its origin, it accepted all luminous forms (الصور النورية) due to suitability (المناسبة). Its darkness was negated by the light of its forms, for the form made it manifest. Thus, darkness is attributed to Nature (الطبع) in the terminology of the rationalists (العقلاء).\n\nAccording to us, darkness (الظلمة) is nothing but the Unseen (الغيب), since the Unseen is not perceived by the senses, nor does one perceive by means of it. Darkness is perceived, but one does not perceive by means of it. Were it not that darkness is light, it would not be possible for it to be perceived. If it were the Unseen, it would not be possible for it to be witnessed (تشهد). The Unseen is known only by Him. These are all the keys to the Unseen (مفاتيح الغيب), but only Allah knows that they are keys. He says, the Exalted: <<وعِنْدَهُ مَفاتِحُ الْغَيْبِ لا يَعْلَمُها إِلَّا هُوَ>> (And with Him are the keys of the Unseen; none knows them except Him). Even though they exist among us, we do not know that they are keys to the Unseen. And if we know through reports that they are keys, we do not know the Unseen so that we may open it with them. This is like someone who finds the key to a house but does not know the house it opens. <<عالِمُ الْغَيْبِ فَلا يُظْهِرُ عَلى‏ غَيْبِهِ أَحَداً>> (Knower of the Unseen, and He does not disclose His Unseen to anyone).\n\nThen know, after I have informed you of the flow of Light (النور) through things, that creation is divided into wretched (شقي) and felicitous (سعيد). Through the flow of Light in all existent things—dense and subtle, dark and non-dark—all existent things affirmed the existence of their Maker (الصانع) without doubt or uncertainty. Since He possesses Absolute Unseenness (الغيب المطلق), His Essence (ذاته) is not known through the path of affirmation (الثبوت), but rather He is declared transcendent (تنزه) above what is fitting for created things (المحدثات). Just as the Unseen knows that there is an Unseen, but does not know what is in it or what it is.\n\nWhen the Divine Reports (الأخبار الإلهية) arrive upon the tongues of the spiritual beings (الروحانيين) and they transmit them to the Messengers, and the Messengers (عليهم السلام) transmit them to us: Whoever believes in them and casts his corrupt thought (فكره الفاسد) behind his back, and accepts them with the quality of acceptance (صفة القبول) in his intellect, and confirms the Informer in what he brought—and if it requires an action beyond mere confirmation, he performs it—that one is referred to as the Felicitous (السعيد). He is one who <<أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ>> (gives ear while he is a witness). He shall have the reward promised to him of goodness in the Abode of Permanence (دار القرار) and everlasting bliss (النعيم الدائم), which does not run to a fixed term to be cut off by the arrival of its term, generally speaking, by a Divine ruling that does not change, break, or become abrogated.\n\nAnd whoever does not believe in them, and places his corrupt thought (فكره الفاسد) before him, and follows it, and rejects the Prophetic reports—either by denying the origin or by corrupt interpretation (التأويل الفاسد)—and denies the Informer concerning what he brought, and does not act according to what he was told, if it required an action beyond mere confirmation—that one is referred to as the Wretched (الشقي). He is wretched due to the darkness (الظلمة) within him, just as the felicitous one believed due to the light (النور) within him. He shall have the recompense with which he was threatened, of evil in the Abode of Destruction (دار البوار) and lack of permanence, due to the existence of everlasting torment (العذاب الدائم), which does not run to a fixed term, even though it has a term in reality, generally speaking, by a just Divine ruling, just as the felicitous one’s reward was by grace (فضلا). This ruling does not change, break, or become abrogated.\n\nThere is a disagreement concerning this among the People of Unveiling (أهل الكشف). It is a great issue among the scholars of convention (علماء الرسوم) who are believers, and also among the People of Unveiling. There is also disagreement among the People of Unveiling regarding whether the torment will be eternal (يتسرمد) for them without end, or whether they will have bliss (نعيم) in the Abode of Wretchedness (دار الشقاء), so that the torment ends for them at a fixed term. They agreed on the non-exit from it, and that they will abide therein eternally (إلى ما لا نهاية له). Each of the two abodes has its fullness, and the causes of pain will vary upon them outwardly—this is necessary—yet they will find pleasure in that inwardly, according to the preceding disagreement, after the pain takes its toll as the recompense for the punishment.\n\nAbdullah al-Mururi narrated to me, along with a group of others, that Abu Madyan, the Imam of the Community, said: \"The people of the two abodes enter them—the felicitous by Allah's grace, and the people of the Fire by Allah's justice. They settle in them by their deeds, and they abide eternally in them by their intentions (النيات).\" This is a sound unveiling (كشف صحيح) and a noble statement (كلام حر). The pain takes its toll as the recompense for the punishment, commensurate with the duration of the life of the polytheist (المعمر في الشرك) in the world. When that period ends, bliss (نعيم) is established for them in the Fire, such that if they were to enter Paradise, they would suffer pain due to the lack of conformity with the temperament (المزاج) upon which Allah created them. Thus, they find pleasure in what they are in—of fire, freezing cold (زمهرير), and the stinging of snakes and scorpions—just as the people of Paradise find pleasure in shades, light, and kissing beautiful houris, because their temperament demands it. Do you not see that the dung beetle (الجعل) in this world has a temperament that is harmed by the scent of roses and finds pleasure in foul odors? Likewise is the one created upon his temperament. We have witnessed temperaments of this nature occurring in this world. There is no temperament in the world except that it finds pleasure in what is suitable (الملائم) and lack of pleasure in what is repulsive (المنافر). Do you not see that the feverish person suffers pain from the scent of musk? Pleasures follow suitability, and pains follow the lack of suitability.\n\nThis matter is verified in itself; no rational person denies it. The question is whether the people of the Fire are upon this temperament in this state after the period ends, or whether they are upon a temperament that requires them to feel pain from painful things. The sound, explicit, textual transmission (النقل الصحيح الصريح النص) that is found to convey knowledge must be judged by without doubt. <<الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ>> (Allah is over all things competent). Although I am not ignorant of the matter concerning this, I am not obligated to disclose it, for disclosing it will not remove the disagreement from the world.\n\nSome of the People of Unveiling (أهل الكشف) said that they will exit to Paradise until absolutely no one remains in [the Fire]. Its doors will remain flapping, and cress (الجرجير) will grow in it. Allah will create people for it to fill it, from its temperament, just as He creates fish in the water, and the world of air in the air, and a world in the belly of the earth whose life is only there, like the mole (الخلد). If it reaches the surface of the earth, it dies. The distress (الغم) that we feel in that distress is their life. The fish, if it comes out into the air, dies, and its distress is in the air, where the light of its life is extinguished. Man and land animals, if they drown in water, perish, and their distress is in the water, by which the light of their life is extinguished. There are marine animals that live here and live there, like crocodiles, the sea-man, its dog, and some birds. All of this is due to the nature (الطبع) and temperament (المزاج) upon which Allah created them. We have mentioned in this station (منزل) what is sufficient and have exhausted its fundamentals, with Allah's help and inspiration. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر دو سو نواسی: اُمّی علم کے مقام کی معرفت میں، جس سے پہلے حضرت موسیٰ علیہ السلام کی حضوری سے کوئی علم نہیں آیا۔\n\nاللہ کی معرفت (العلم بالله) زینت اور آرائش ہے، اور فکری علم (العلم بالفكر) تشبیہ اور گمراہی ہے۔\nفکری علم (العلم بالفكر) اجمال اور مغالطہ ہے، اور اللہ کی معرفت (العلم بالله) تحقیق اور تفصیل ہے۔\nفکری علم (العلم بالفكر) محض علامات ہیں، اور اللہ کی معرفت (العلم بالله) تحویل اور تبدیلی ہے۔\nپس تمہیں آراستہ اقوال دھوکے میں نہ ڈالیں، کیونکہ ان کا مفہوم جہالت اور تعلیل ہے۔\nفلسفی اپنے سبب (علت) کے تقاضے سے معبود کی نفی دیکھتا ہے، اور یہ تعطیل (تعطيل) ہے۔\nاور اشعری ایک کثیر شدہ عین (ذات) کو دیکھتا ہے، اور یہ علم ہے لیکن اس میں تمثیل (تمثيل) ہے۔\n\n### [ابن عربی کے نزدیک اُمّیت (الأمية)]\n\nہمارے نزدیک اُمّیت (الأمية) قرآن کے حفظ یا نبوی اخبار کے حفظ کے منافی نہیں ہے، بلکہ ہمارے نزدیک اُمّی وہ ہے جس نے اپنے فکری غور (النظر الفكري) اور عقلی حکم (الحكم العقلي) کو استعمال نہ کیا ہو تاکہ وہ ان معانی اور اسرار کو نکال سکے جو ان میں موجود ہیں، اور نہ ہی وہ دلائل عقلیہ کو استعمال کرے جو وہ الٰہیات کے علم میں دیتے ہیں، اور نہ ہی وہ دلائل فقہیہ، قیاسات اور تعلیلات کو استعمال کرے جو وہ مجتہدین کو شرعی احکام میں دیتے ہیں۔ پس جب قلب شرعاً اور عقلاً فکری نظر کے علم سے محفوظ ہو جائے تو وہ اُمّی ہوتا ہے، اور وہ الٰہی فتح (الفتح الإلهي) کو مکمل ترین صورت میں تیزی سے قبول کرنے والا ہوتا ہے، بغیر کسی سستی کے۔ اور اسے ہر شے کا وہ علمِ لدنی (العلم اللدني) عطا کیا جاتا ہے جس کی قدر نبی یا اولیاء میں سے کوئی چکھنے والا ہی جانتا ہے۔ اسی سے ایمان کا درجہ اور اس کی نشوونما مکمل ہوتی ہے۔ اور وہ اس علم کے ذریعے افکار کی درستی اور ان کی غلطیوں پر واقف ہوتا ہے، اور کس نسبت سے صحت اور سقم ان کی طرف منسوب کیا جاتا ہے۔ اور یہ سب کچھ اللہ کی طرف سے ہے۔ اور وہ باطل کا حکم لگانے کے باوجود یہ جانتا ہے کہ الوجود (الوجود) میں کوئی باطل نہیں ہے، کیونکہ جو کچھ بھی عین (ذات) اور حکم کے اعتبار سے الوجود (الوجود) میں داخل ہوا ہے وہ اللہ تعالیٰ کے لیے ہے نہ کہ کسی اور کے لیے۔ پس نہ عین میں کوئی عبث ہے اور نہ حکم میں کوئی باطل، کیونکہ اللہ کے سوا کوئی فعل نہیں، اللہ کے سوا کوئی فاعل نہیں، اللہ کے سوا کوئی حکم نہیں، اور اللہ کے سوا کوئی حاکم نہیں۔\n\nپس جس شخص کو مذکورہ علم پہلے حاصل ہو چکا ہو، تو اس کے لیے بعید ہے کہ اسے وہ علمِ لدنی (العلم اللدني) الٰہی حاصل ہو جو ہمارے اُمّی شخص کو حاصل ہوتا ہے، جسے مذکورہ علم پہلے حاصل نہیں ہوا۔ کیونکہ عقلی ترازو اور فقہاء کے اجتہادی ترازو کے ظواہر ہمارے بیان کردہ بہت سے امور کو رد کر دیتے ہیں، اس لیے کہ معاملہ کا اکثر حصہ عقل کے دائرے اور اس کے ترازو سے بالاتر ہے، جہاں وہ کام نہیں کرتا، اور فقہاء کے مجتہدین کے ترازو سے بھی بالاتر ہے، نہ کہ فقہ سے بالاتر، کیونکہ یہ صحیح فقہ اور صریح علم کا عین ہے۔\n\nاور موسیٰ اور خضر علیہما السلام کا قصہ ہمارے بیان کردہ پر ایک قوی دلیل ہے۔ پس فقیہ کا کیا حال ہوگا؟ اور وہ \"اَینِیَّت\" (کہاں ہونا) اور اس سے ملتی جلتی چیزیں کہاں ہیں جنہیں شارع اور کشف (الکشف) نے الٰہ کی طرف منسوب کیا ہے، جبکہ عقل کے زعم اور مجتہد کے حکم کے مطابق وہ نظری ترازو اور عقلی دلائل کے خلاف ہیں؟\n\nپس وہ رحمت جو اللہ اپنے بندے کو عطا کرتا ہے وہ یہ ہے کہ وہ اس کے اور نظری علم (العلم النظري) اور اجتہادی حکم کے درمیان اس کی اپنی طرف سے رکاوٹ ڈال دے، تاکہ اللہ اسے الٰہی فتح (الفتح الإلهي) اور علمِ لدنی (العلم اللدني) سے نوازے۔ اللہ تعالیٰ نے اپنے بندے خضر کے حق میں فرمایا:\nعَبْداً من عِبادِنا (ہمارے بندوں میں سے ایک بندہ)۔ (پس اللہ نے اسے نونِ جمع کے ساتھ اپنی طرف منسوب کیا)\nآتَيْناهُ رَحْمَةً من عِنْدِنا (ہم نے اسے اپنی طرف سے رحمت عطا کی)۔ (نونِ جمع کے ساتھ)\nوعَلَّمْناهُ من لَدُنَّا عِلْماً (اور ہم نے اسے اپنے پاس سے علم سکھایا)۔ (نونِ جمع کے ساتھ)\nیعنی اس فتح میں اس کے لیے ظاہر اور باطن کا علم، سر اور علانیہ کا علم، حکم اور حکمت کا علم، عقل اور وضع کا علم، اور دلائل اور شبہات کا علم جمع کر دیا۔\n\nاور جسے عام علم عطا کیا گیا ہو اور اسے اس میں تصرف کا حکم دیا گیا ہو، جیسے انبیاء اور اولیاء میں سے جسے اللہ چاہے، وہ اس پر انکار کرے گا، لیکن یہ شخص (جسے علمِ لدنی ملا) کسی پر بھی ان علوم کی وجہ سے انکار نہیں کرے گا جو وہ لاتا ہے، اگرچہ وہ اس کے خلاف حکم دے، لیکن وہ اس کے مقام کو جانتا ہے اور کہاں اس کا حکم لگایا جائے گا۔ پس وہ بصارت کو اس کے حکم میں اس کا حق دیتا ہے اور دیگر حواس کو بھی، اور عقل کو اس کا حکم دیتا ہے اور دیگر معنوی قوتوں کو بھی، اور الٰہی نسبتوں اور الٰہی فتح (الفتح الإلهي) کو ان کا حکم دیتا ہے۔\n\nاسی وجہ سے الٰہی عالم دوسروں پر سبقت لے جاتا ہے، اور یہ وہ بصیرت (البصيرة) ہے جس کے ساتھ قرآن نازل ہوا، جیسا کہ اللہ تعالیٰ کا فرمان ہے:\nأَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي (میں اور میرے پیروکار اللہ کی طرف بصیرت کے ساتھ بلاتے ہیں)۔\nاور یہ اللہ تعالیٰ کے اس فرمان کی تکمیل ہے:\nبَعَثَ في الْأُمِّيِّينَ رَسُولًا مِنْهُمْ (اس نے اُمّیوں میں انہی میں سے ایک رسول بھیجا)۔\nپس وہ نبی اُمّی ہیں جو اپنی اُمّیت کے ساتھ بصیرت (بصیرت) پر دعوت دیتے ہیں، اور اُمّی وہ ہیں جو ان کے ساتھ بصیرت (بصیرت) پر اللہ کی طرف دعوت دیتے ہیں، پس وہ حکم میں ان کے پیروکار ہیں۔\n\nکیونکہ جماعت کا سربراہ، مجتہد اور صاحبِ فکر کبھی بھی اپنے حکم میں بصیرت (بصیرت) پر نہیں ہوتا۔ مجتہد کا حال یہ ہے کہ وہ آج کسی شرعی نازلہ میں ایک حکم لگاتا ہے، پھر کل اسے کوئی دوسرا امر ظاہر ہوتا ہے جو اسے بتاتا ہے کہ کل کا حکم غلط تھا، تو وہ اس سے رجوع کر کے آج اس پر حکم لگاتا ہے جو اسے ظاہر ہوا ہے۔ جبکہ شارع (نبی) کا حکم اول و آخر میں نافذ ہوتا ہے، اور اس پر حرام ہے کہ وہ اس دلیل سے ہٹ جائے جو اس وقت اس کے اجتہاد میں اسے ملی تھی۔ اگر وہ بصیرت (بصیرت) پر ہوتا تو پہلی نظر میں غلط حکم نہ لگاتا۔ بخلاف نبی کے حکم کے، کیونکہ وہ صحیح ہوتا ہے، یعنی پہلا حکم، پھر اللہ اس حکم کو اس کے مخالف حکم سے اٹھا لیتا ہے، اور اسے نسخ (النسخ) کہا جاتا ہے۔ اور نسخ (النسخ) اور خطاء (غلطی) میں کتنا فرق ہے! نسخ (النسخ) بصیرت (بصیرت) کے ساتھ ہوتا ہے، اور خطاء بصیرت (بصیرت) کے ساتھ نہیں ہوتی۔\n\nاسی طرح صاحبِ عقل کا حال ہے، جو عقلمندوں کی ایک جماعت میں واقع ہوتا ہے کہ جب وہ غور کرتے ہیں اور اپنی نظر میں دلیل کو پورا کرتے ہیں اور دلیل کے پہلو کو پاتے ہیں تو وہ انہیں مدلول کا علم دیتا ہے، پھر تم انہیں دوسرے وقت میں دیکھتے ہو، یا ان کے لیے دوسری جماعت کا کوئی مخالف کھڑا ہوتا ہے، جیسے معتزلی، اشعری، برہمی یا فلسفی، جو ان کی اس دلیل کے منافی کوئی اور امر لاتا ہے جس پر وہ یقین رکھتے تھے اور اس میں قدح کرتا ہے۔ پس وہ اس میں غور کرتا ہے اور دیکھتا ہے کہ پہلا حکم غلط تھا، اور اس نے اپنی دلیل کے ارکان پورے نہیں کیے تھے، اور اس نے اس میں ترازو میں خلل ڈالا تھا اور اسے محسوس نہیں ہوا تھا۔ اور یہ بصیرت (بصیرت) سے کتنا دور ہے! اور اسے عقلی ضروریات میں یہ کیوں نہیں ہوتا؟\n\nپس حکم میں بصیرت (البصيرة) اہل اس شان کے لیے ایسی ہی ہے جیسے عقول کے لیے ضروریات۔ ایسے علم پر انسان کو خوش ہونا چاہیے۔\n\nابو حامد الغزالی سے، جو اس طریقے کے لوگوں کے احوال بیان کرتے ہیں، حکایت کی گئی ہے کہ جب میں ان کے طریقے میں شامل ہونا چاہتا تھا اور ان کا راستہ اختیار کرنا چاہتا تھا اور اس سمندر سے غوطہ لگانا چاہتا تھا جس سے انہوں نے غوطہ لگایا، تو میں نے خود کو خلوت میں ڈالا اور اپنی نظر اور فکر سے کنارہ کشی اختیار کی اور خود کو ذکر میں مشغول کیا۔ تو میرے لیے وہ علم منکشف ہوا جو میرے پاس نہیں تھا۔ میں اس پر خوش ہوا اور کہا کہ مجھے وہ حاصل ہو گیا جو ان لوگوں کو حاصل ہوا تھا۔ پھر میں نے اس میں غور کیا تو اس میں فقہی قوت موجود تھی جو میرے پاس پہلے سے تھی۔ پس میں نے جان لیا کہ یہ ابھی میرے لیے خالص نہیں ہوا۔ تو میں اپنی خلوت میں واپس گیا اور وہی عمل کیا جو ان لوگوں نے کیا تھا۔ تو مجھے وہی چیز ملی جو پہلے ملی تھی، بلکہ زیادہ واضح اور روشن۔ میں خوش ہوا، پھر غور کیا تو اس میں فقہی قوت موجود تھی جو میرے پاس پہلے سے تھی اور وہ میرے لیے خالص نہیں ہوئی تھی۔ میں نے یہ عمل کئی بار دہرایا اور حال وہی رہا۔ پس میں اس قدر سے دوسرے اہل نظر اور اصحابِ افکار سے ممتاز ہو گیا، لیکن میں اس میں ان لوگوں کے درجے کو نہیں پہنچ سکا۔ اور میں نے جان لیا کہ مٹے ہوئے پر لکھنا اس طرح نہیں ہے جیسے غیر مٹے ہوئے پر لکھنا۔\n\nکیا تم نہیں دیکھتے کہ درختوں میں سے کچھ ایسے ہیں جن کا پھل ان کے پھول سے پہلے آتا ہے، اور یہ نظری علماء کے مرتبے کی طرح ہے جب وہ اللہ کے راستے میں داخل ہوتے ہیں، جیسے فقیہ اور متکلم۔ اور کچھ ایسے ہیں جن کا پھل ان کے پھول سے پہلے نہیں آتا، اور یہ وہ اُمّی ہے جس کے علمِ لدنی (العلم اللدني) سے پہلے کوئی ظاہری فکری علم نہیں آیا، تو یہ علم اسے آسان ترین طریقوں سے حاصل ہوتا ہے۔\n\nاور اس کی وجہ یہ ہے کہ جب اللہ کے سوا کوئی فاعل نہیں ہے، اور یہ فقیہ اور متکلم اپنے ترازو کے ساتھ الٰہی حضور میں آئے تاکہ وہ اللہ پر وزن کریں، اور وہ نہیں جانتے تھے کہ اللہ تعالیٰ نے انہیں وہ ترازو صرف اس لیے دیے تھے کہ وہ ان کے ذریعے اللہ کے لیے وزن کریں نہ کہ اللہ پر۔ پس وہ ادب سے محروم ہو گئے، اور جو ادب سے محروم ہوا اسے علمِ لدنی (العلم اللدني) فتحی سے جہالت کی سزا ملی، پس وہ اپنے معاملے میں بصیرت (بصیرت) پر نہیں تھا۔ اگر وہ وافر عقل والا ہو تو جان لیتا ہے کہ اسے کہاں سے نقصان پہنچا۔\n\nپس ان میں سے کچھ ایسے ہیں جو داخل ہوئے اور اپنا ترازو دروازے پر چھوڑ دیا، یہاں تک کہ جب وہ باہر نکلے تو اسے لے لیا تاکہ اس کے ذریعے اللہ کے لیے وزن کریں، اور یہ اس شخص سے بہتر حال میں ہے جو اسے لے کر اللہ کے پاس داخل ہوا، لیکن اس کا دل اس چیز سے متعلق تھا جسے اس نے چھوڑا تھا، کیونکہ اس کے دل میں اس کی طرف لوٹنے کا ارادہ تھا، پس وہ مطلوبہ حق سے اس قدر محروم ہو گیا جس قدر اس کا دل اس چیز سے متعلق تھا جسے اس نے چھوڑا تھا۔\n\nاور اس سے بہتر حال میں وہ ہے جس نے اپنا ترازو توڑ دیا، اگر وہ لکڑی کا تھا تو اسے جلا دیا، اور اگر وہ پگھلنے والا تھا تو اسے پگھلا دیا یا اسے رگڑ کر ختم کر دیا یہاں تک کہ اس کی ترازو ہونے کی حیثیت ختم ہو جائے، اگرچہ اس کا جوہر باقی رہے۔ اور یہ بہت ہی نایاب ہے، ہم نے نہیں سنا کہ کسی نے ایسا کیا ہو۔ اگر ہم فرض کریں، اور یہ ناممکن نہیں ہے، کہ اللہ نے اپنے بعض بندوں کو اتنی قوت دی کہ انہوں نے ایسا کیا، جیسا کہ ابو حامد الغزالی نے اپنے بارے میں ذکر کیا کہ وہ چالیس دن حیران رہے، اور یہ ایک خطرہ ہے۔ اُمّی کا حال ایسا نہیں ہوتا، کیونکہ اُمّی ایمان کے ساتھ اللہ کے پاس داخل ہوتا ہے۔\n\nاور یہ حالت جو ابو حامد نے ذکر کی ہے، وہ ان لوگوں کی حالت نہیں ہے، بلکہ یہ اس شخص کی حالت ہے جو کسی شریعت پر نہیں تھا، پھر وہ جاننا چاہتا تھا کہ وہاں کیا ہے، تو اس نے سوال کیا، تو اسے ان لوگوں کے راستے کی طرف رہنمائی کی گئی، تو وہ داخل ہوا تاکہ اللہ کی تعریف سے حق کو جان سکے۔ پس یہ بھی پاک محل والا ہے۔ اور ابو حامد کا محل حیرت میں مشغول تھا، پس وہ اس شخص کی قوت کو قبول کرنے کی طاقت نہ رکھ سکا جو الٰہی فتح (الفتح الإلهي) کے ذریعے وارد ہوتا ہے۔\n\nپس اگر بالفرض ایسا ہو کہ اس شخص پر فتح ہو جائے جو اس مرتبے پر ہے، تو وہ اس فتح میں ان ترازو کو دیکھے گا جنہیں اس نے ختم کر دیا تھا، تو وہ اس پر تعجب کرے گا۔ پس جب وہ باہر نکلے گا تو انہیں لے کر نکلے گا، اور ان کے ذریعے اللہ کے لیے وزن کرے گا نہ کہ اللہ پر، جیسا کہ انبیاء علیہم السلام نے کیا تھا۔ پس وہ کسی چیز کو رد نہیں کرتا اور نہ ہی کسی چیز کو اس کے ترازو کے علاوہ میں رکھتا ہے، اور غلطی اور شک دور ہو جاتا ہے، اور وہ اللہ تعالیٰ کے اس فرمان کا معنی جان لیتا ہے:\nونَضَعُ الْمَوازِينَ الْقِسْطَ لِيَوْمِ الْقِيامَةِ (اور ہم قیامت کے دن انصاف کے ترازو رکھیں گے)۔\nپس اللہ نے انہیں بہت سے ترازو بنایا تاکہ ہر ترازو سے اس چیز کو وزن کیا جائے جس کے لیے وہ رکھا گیا ہے۔\n\nاور جب متکلم نے اپنی عقل کے ترازو سے اس چیز کو وزن کیا جو عقل سے خارج ہے، کیونکہ وہ اس کے دائرے سے باہر ہے، یعنی الٰہی نسبتیں، تو اس کے ترازو نے اسے قبول نہیں کیا اور اسے پھینک دیا اور اس کا کفر کیا، اور یہ خیال کیا کہ وہاں کوئی حق نہیں ہے سوائے اس کے جو اس کے ترازو میں داخل ہو۔\n\nاور مجتہد فقیہ نے شرع کے حکم کو اپنی نظر کے ترازو سے وزن کیا، جیسے شافعی مذہب کا شخص، مثال کے طور پر، اس نے اپنے ترازو سے نبیذ کے حلال ہونے کو وزن کرنا چاہا جسے ابو حنیفہ کے ترازو نے قبول کیا تھا، تو شافعی کے ترازو نے اسے پھینک دیا اور اسے حرام قرار دیا اور کہا کہ ابو حنیفہ نے غلطی کی۔ اور شافعی مذہب کے شخص کو ایسی بات بغیر کسی قید کے نہیں کہنی چاہیے تھی، جبکہ وہ جانتا ہے کہ شرع نے ہر مجتہد کو اس چیز کا پابند کیا ہے جس کی طرف اس کا اجتہاد اسے لے گیا ہے، اور اس پر حرام کیا ہے کہ وہ اپنی دلیل سے ہٹ جائے۔ پس اس نے صنعت کا حق ادا نہیں کیا اور اس نے اس عام ترازو میں غلطی کی جو شریعت کے حکم کو مطلقاً شامل ہے، اور یہی وہ ترازو ہے جس پر علماء شریعت نے اصولِ دلائل میں اور فروعِ احکام میں بلا اختلاف اعتماد کیا ہے۔\n\nاصول میں: وہ لوگ جو قیاس کو دلیل ثابت کرتے ہیں، ان کا مشروع اجتہاد انہیں اس طرف لے گیا ہے۔ اور ان کے مخالف ظاہریہ بھی جانتے ہیں کہ ہر مجتہد اس چیز کا پابند ہے جو اس کے اجتہاد نے اسے دی ہے، لیکن وہ ان کے بارے میں کہتے ہیں کہ انہوں نے قیاس کو دلیل ثابت کرنے میں غلطی کی۔ اور ظاہریہ کے لیے یہ جائز نہیں کہ وہ اس چیز کو غلط قرار دیں جسے شرع نے حکم قرار دیا ہے، پس شرعاً قیاس کو دلیل ثابت کرنا بھی ثابت ہے اور قیاس کی نفی بھی ثابت ہے کہ وہ شرعی دلیل نہیں ہے۔\n\nاور فروع میں: جیسے علی رضی اللہ عنہ جو ربیبہ (سوتیلی بیٹی) سے نکاح کو جائز سمجھتے ہیں اگر وہ زیر پرورش نہ ہو، اگرچہ اس کی ماں سے دخول ہو چکا ہو، کیونکہ دونوں شرطیں ایک ساتھ موجود نہیں ہیں، اور ان دونوں کے وجود سے ربیبہ حرام ہو جاتی ہے (یعنی مجموعی طور پر)۔ اور مخالف اسے جائز نہیں سمجھتا۔ پس عام ترازو ان دونوں میں سے ہر ایک کے حکم کو نافذ کرتا ہے، لیکن عام ترازو پر عمل کرنے والا کم ہے، کیونکہ انصاف کی کمی ہے۔\n\nپس ہم نے اس فصل میں اس محرومی کا سبب بیان کر دیا جو فقہاء، عقلاء اور اہل نظر پر حکم لگایا گیا، پس وہ اس شریف، احاطہ کرنے والے علم کے دروازے میں داخل نہیں ہوئے جو ہر جماعت کے لیے اس چیز کو تسلیم کرتا ہے جس پر وہ ہے، خواہ وہ انہیں سعادت (سعادت) کی طرف لے جائے یا شقاوت (شقاوت) کی طرف۔ اور کوئی بھی اس کے طریقے کو تسلیم نہیں کرتا سوائے اس کے جس نے وہ چکھا جو انہوں نے چکھا اور اس پر ایمان لایا، جیسا کہ ابو یزید نے فرمایا: \"اگر تم کسی ایسے شخص کو دیکھو جو اس طریقے کے لوگوں کی باتوں پر ایمان لاتا ہے اور ان کے حقائق کو تسلیم کرتا ہے، تو اسے کہو کہ وہ تمہارے لیے دعا کرے، کیونکہ اس کی دعا قبول ہوتی ہے۔\" اور وہ کیسے قبول الدعاء نہ ہو، جبکہ تسلیم کرنے والا حضوری کے بیچ میں ہے، لیکن وہ اس سے ناواقفیت کی وجہ سے نہیں جانتا کہ وہ اس میں ہے۔\n\nپس اللہ ہمیں ان لوگوں میں شامل کرے جن کے لیے اس نے اس نور سے نور بنایا جس کے ذریعے وہ اپنے بندوں میں سے جسے چاہتا ہے ہدایت دیتا ہے، یہاں تک کہ وہ اس کے ذریعے صراطِ مستقیم (صِراطٍ مُسْتَقِيمٍ) کی طرف ہدایت دیتا ہے، اللہ کے راستے کی طرف جس کے لیے آسمانوں اور زمین میں سب کچھ ہے، ترازو اور راستوں میں۔ أَلا إِلَى الله تَصِيرُ الْأُمُورُ (خبردار! تمام معاملات اللہ ہی کی طرف لوٹتے ہیں)۔\n\nاللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم پر احسان جتاتے ہوئے فرمایا:\nوكَذلِكَ أَوْحَيْنا إِلَيْكَ رُوحاً من أَمْرِنا (اور اسی طرح ہم نے آپ کی طرف اپنے حکم سے روح (وحی) بھیجی)۔ اور یہ اس کا فرمان ہے: يُلْقِي الرُّوحَ من أَمْرِهِ ... ما كُنْتَ تَدْرِي ما الْكِتابُ ولا الْإِيمانُ (وہ اپنے حکم سے روح ڈالتا ہے... آپ نہیں جانتے تھے کہ کتاب کیا ہے اور ایمان کیا ہے)۔ اور یہ محل کا ہر اس چیز سے خالی ہونا ہے جو اسے وحی کے قبول کرنے سے مشغول کرے۔ ولكِنْ جَعَلْناهُ نُوراً (لیکن ہم نے اسے نور بنایا) یعنی یہ مقام نَهْدِي به من نَشاءُ من عِبادِنا (جس کے ذریعے ہم اپنے بندوں میں سے جسے چاہتے ہیں ہدایت دیتے ہیں)۔ پس وہ \"مِنْ\" کے ساتھ آیا، جو دلالت میں نکرہ ہے، جو اس کے نزدیک اپنے بعض بندوں، نبی یا ولی کے ساتھ خاص ہے۔\n\nاور آپ اس نور کے ذریعے ہدایت دیتے ہیں جس کے ذریعے ہم نے آپ کو ہدایت دی ہے۔ پس اگر یہ بندہ نبی ہو تو وہ شریعت ہے، اور اگر ولی ہو تو وہ نبی کی شریعت کی تائید ہے، اور اس کا حکم ایک مشروع امر ہے جو بعض مومنین کے نزدیک اس حکمت کے سبب سے نامعلوم ہے جو اس میں شامل ہے۔ اللہ تعالیٰ نے فرمایا:\nيُؤْتِي الْحِكْمَةَ من يَشاءُ ومن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْراً كَثِيراً (وہ جسے چاہتا ہے حکمت عطا کرتا ہے، اور جسے حکمت عطا کی گئی اسے بہت زیادہ بھلائی دی گئی)۔ اس کے بارے میں یہ نہیں کہا جا سکتا کہ یہ کم ہے۔ پھر فرمایا: وما يَذَّكَّرُ إِلَّا أُولُوا الْأَلْبابِ (اور نصیحت صرف عقل والے ہی حاصل کرتے ہیں)۔ اور لب (مغز) عقل میں نور ہے، جیسے بادام اور زیتون میں تیل۔ اور تذکر (نصیحت حاصل کرنا) صرف بھولے ہوئے علم سے ہوتا ہے۔ پس جو کچھ ہم نے ان آیات میں تحریر کیا ہے اس پر غور کرو، ان شاء اللہ تم کامیاب ہو جاؤ گے۔\n\nاور اس کے بعد کہ میں نے تمہیں اس علم کے مرتبے کو اس مقام سے واضح کر دیا ہے، تو اب ہم اس علم کی اصل اور اس کے بقا کے مادے اور اس کے مادے کے حجاب کو بیان کریں گے، اور یہ کہ اللہ کی تائید اور توفیق سے اس تک کیسے پہنچا جا سکتا ہے۔\n\n### [وہ علمِ الٰہی جس پر عارفین منتہی ہوتے ہیں]\n\nپس جان لو کہ اس علمِ الٰہی کی اصل وہ مقام ہے جس پر عارفین (العارفون) منتہی ہوتے ہیں، اور وہ یہ ہے کہ کوئی مقام نہ ہو، جیسا کہ اللہ تعالیٰ کے اس فرمان میں اشارہ ہوا ہے:\nيا أَهْلَ يَثْرِبَ لا مُقامَ لَكُمْ (اے اہل یثرب! تمہارے لیے کوئی ٹھکانہ نہیں)۔\nاور یہ مقام کسی صفت کے ساتھ مقید نہیں ہوتا۔ اور ابو یزید بسطامی رحمۃ اللہ علیہ نے اس پر تنبیہ کی جب ان سے پوچھا گیا کہ آپ نے صبح کیسے کی؟ تو انہوں نے فرمایا: \"میری کوئی صبح نہیں اور نہ کوئی شام، صبح اور شام تو اس کے لیے ہے جو صفت کے ساتھ مقید ہو، اور میری کوئی صفت نہیں ہے۔\"\n\nپس صبح طلوع کے لیے ہے اور شام غروب کے لیے، اور طلوع ظہور اور عالمِ ملک و شہادت کے لیے ہے، اور غروب پردہ اور عالمِ غیب و ملکوت کے لیے ہے۔ پس اس مقام میں عارف اس مبارک زیتون کے درخت کی طرح ہے جو نہ مشرقی ہے اور نہ مغربی (لا هي شرقية ولا غربية)۔ پس اس مقام پر کوئی وصف حکم نہیں لگاتا اور نہ ہی وہ اس کے ساتھ مقید ہوتا ہے۔ اور یہ اس کا حصہ ہے لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (اس کی مانند کوئی شے نہیں) اور سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ (پاک ہے تیرا رب، عزت کا رب، ان چیزوں سے جو وہ بیان کرتے ہیں)۔\n\nپس جو مقام اس مرتبے پر ہے وہ اس علم کی اصل ہے۔ اور اس اصل اور اس علم کے درمیان کئی مراتب ہیں۔ پس اصل تنزیہ (التنزيه) پر ثابت قدم رہنا ہے کہ وہ وصف کو قبول نہ کرے اور کسی حال کی طرف مائل نہ ہو۔ پھر یہ ثبات ایک صورت پیدا کرتا ہے جس کے ساتھ عارف متصف ہوتا ہے، اس کا ایک ظاہر ہوتا ہے اور ایک باطن۔ پس اس کا باطن صرف بدنی مجاہدہ اور نفسانی ریاضت کے بعد ہی حاصل ہوتا ہے۔ پس جب وہ اس باطن کے راز تک پہنچ جاتا ہے، جو ایک خاص علم ہے، تو وہ اس مطلوبہ علم کے لیے ایسا ہے جیسے چراغ کے لیے تیل، اور علم چراغ کی طرح ہے۔ پس اس علم کا پھل صرف اس کے علماء میں ہی ظاہر ہوتا ہے، جیسا کہ تیل کا حکم صرف اس چراغ میں ظاہر ہوتا ہے جو بتی کے ساتھ قائم ہو۔\n\nاور یہاں اسے ان اوصاف کا اکتساب حاصل ہوتا ہے جن سے ہم نے اصل کو اس مقام میں منزہ قرار دیا تھا۔ اور اس مقام میں ہم اسے اپنی خاطر ان اوصاف سے متصف کرتے ہیں نہ کہ اس کی خاطر۔ پس یہ وصف آثار کے لیے ہے نہ کہ اس کے لیے۔ \"اللہ تھا اور اس کے ساتھ کوئی شے نہیں تھی۔\" اور اس اصل پر کلام اس کتاب کے باب نمبر تین سو پچاس میں آئے گا۔\n\nاور اس مقام میں جو کچھ شامل ہے وہ طبیعی اجسام کی تخلیق کا علم ہے، اور یہ کہ ان کی اصل نور (النور) سے ہے۔ اسی لیے جب انسان یہ جان لیتا ہے کہ تمام کثیف، ظلمانی اجسام کو کیسے صاف کیا جائے، تو وہ انہیں شفاف بنا کر اس نوری حالت میں ظاہر کر دیتا ہے جو ان کی اصل ہے، جیسے شیشہ جب ریت کی کدورت سے پاک ہو جاتا ہے تو شفاف ہو جاتا ہے۔ اور پتھروں کا جلا دینا، اور بلور اور مہا (ایک قسم کا قیمتی پتھر) کی معدنیات اسی باب سے ہیں۔\n\nاور یہ اس لیے ہے کہ تمام موجودات کی اصل اللہ ہے، اس کے نام نُورُ السَّماواتِ (آسمانوں کا نور) سے، جو بلند ہیں، اور الْأَرْضِ (اور زمین کا نور)، جو پست ہے۔ پس اس کے نور کو آسمانوں اور زمین کی طرف منسوب کرنے پر غور کرو۔ اور اگر کثیف اجسام میں نورانیت نہ ہوتی تو مکاشف (المكاشف) کے لیے دیواروں کے پیچھے، زمین کے نیچے اور آسمانوں کے اوپر کی چیزوں کو منکشف کرنا صحیح نہ ہوتا۔ اور اگر وہ لطافت نہ ہوتی جو ان کی اصل ہے، تو بعض اولیاء کا دیواروں سے گزرنا صحیح نہ ہوتا، اور نہ ہی قبر میں میت کا کھڑا ہونا، جبکہ اس پر مٹی ہو یا تابوت کیلوں سے جڑا ہوا ہو اور اس پر مٹی ڈالی گئی ہو، ان میں سے کوئی چیز اسے بیٹھنے سے نہیں روکتی، اگرچہ اللہ نے ہماری آنکھوں کو اس سے پردہ کر رکھا ہے۔ اور ہم میں سے مکاشف اسے منکشف کر لیتا ہے۔ اور اس بارے میں بہت سی خبریں اور صالحین کی حکایات وارد ہوئی ہیں۔\n\nاور اسی لیے تم کوئی ایسا جسم نہیں دیکھتے جسے اللہ نے پیدا کیا ہو اور وہ اپنی اصل خلقت پر بالکل سیدھا باقی رہا ہو، وہ ہمیشہ استداره (گولائی) کی طرف مائل ہوتا ہے، نہ جمادات میں، نہ نباتات میں، نہ حیوانات میں، نہ آسمان میں، نہ زمین میں، نہ پہاڑ میں، نہ پتے میں اور نہ پتھر میں۔ اور اس کی وجہ اس کا اپنی اصل کی طرف مائل ہونا ہے، جو نور (النور) ہے۔\n\nپس سب سے پہلی موجود عقل (العقل) ہے، جو قلم (القلم) ہے، اور وہ ایک الٰہی، ابداعی نور ہے۔ اور اس سے نفس (النفس) کو وجود بخشا گیا، جو لوحِ محفوظ (اللوح المحفوظ) ہے، اور وہ عقل سے نورانیت میں کم ہے، اس واسطے کی وجہ سے جو اس کے اور اللہ کے درمیان ہے۔ اور چیزیں کثیف ہوتی گئیں یہاں تک کہ ارکان اور مولدات (پیدا شدہ چیزوں) تک پہنچ گئیں۔ اور چونکہ ہر موجود کا اپنے موجد کی طرف ایک خاص رخ ہے، اس لیے اس میں نور کا سرایت کرنا ہے۔ اور چونکہ اس کا اپنے سبب کی طرف ایک رخ ہے، اس لیے اس میں ظلمت اور کثافت موجود ہے۔ اگر تم عقل مند ہو تو غور کرو۔\n\nاسی لیے معاملہ جتنا نیچے اترتا گیا، اتنا ہی تاریک اور کثیف ہوتا گیا۔ پس عقل کا مقام زمین کے مقام سے کہاں ہے؟ ان دونوں کے درمیان کتنے واسطے ہیں!\n\nپھر تمہیں معلوم ہونا چاہیے کہ انسان کا جسم آخری مولود ہے، پس وہ آخری اولاد ہے، جو حَمَإٍ مَسْنُونٍ صَلْصالٍ (سڑی ہوئی کیچڑ، کھنکھناتی مٹی) سے مرکب ہے، اور جیسا کہ تم دیکھتے ہو، وہ استداره (گولائی) کی طرف مائل ہے، اگرچہ اسے بہائم اور نباتات کے مقابلے میں سیدھی حرکت حاصل ہے۔ اور اس میں معنوی، حسی اور شیشے کی طرح کے انوار موجود ہیں جو تمہیں دوسری مولدات میں نہیں ملتے، اس روحانی قوتوں کی وجہ سے جو اللہ نے اسے عطا کی ہیں۔ پس اس نے انہیں صرف اس نورانیت کی وجہ سے قبول کیا جو اس میں ہے، پس یہی ان ادراکات کو قبول کرنے کے لیے مناسب ہے۔ اور اسی لیے اللہ تعالیٰ نے فرمایا:\nوآيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهارَ (اور ان کے لیے ایک نشانی رات ہے، ہم اس سے دن کو کھینچ نکالتے ہیں)۔\n\n### [اگر نور نہ ہوتا تو ظلمت نہ ہوتی]\n\nپس جان لو کہ نور (النور) ظلمت (الظلمة) میں پوشیدہ ہے۔ پس اگر نور نہ ہوتا تو ظلمت نہ ہوتی۔ اور اللہ نے یہ نہیں فرمایا کہ ہم اس سے نور کو کھینچ نکالتے ہیں، کیونکہ اگر اس سے نور لے لیا جاتا تو ظلمت کا وجود ختم ہو جاتا، اگر لینا عدم کی صورت میں ہوتا، اور اگر لینا انتقال کی صورت میں ہوتا تو وہ اس کے پیچھے چلتا جہاں وہ منتقل ہوتا، کیونکہ وہ اس کی ذات کا عین ہے۔ اور دن بعض ان انوار میں سے ہے جو سورج کے طلوع سے پیدا ہوتے ہیں۔ پس اگر ظلمت کے لیے اپنی ذاتی نورانیت نہ ہوتی تو اس کے لیے دن کا ظرف بننا صحیح نہ ہوتا، اور نہ ہی اس کا ادراک کرنا صحیح ہوتا، جبکہ اس کا ادراک کیا جاتا ہے۔ اور کسی شے کا ادراک نہیں کیا جاتا جب تک کہ اس میں اپنی ذات سے کوئی نور نہ ہو جس کے ذریعے اس کا ادراک کیا جائے، اور وہ اس کا عینِ وجود اور اس کی استعداد ہے کہ وہ آنکھوں کے ادراک کو قبول کرے، ان انوار کی وجہ سے جو ان میں اس کے لیے ہیں۔ اور ادراک عام طور پر آنکھ کے ساتھ خاص کیا گیا ہے، جبکہ ادراک بذاتِ خود ہر شے کے لیے ہے۔ پس ہر شے اپنے آپ کو اور ہر شے کو ادراک کرتی ہے۔\n\nکیا تم نہیں دیکھتے کہ رسول صلی اللہ علیہ وسلم اپنی پشت کے پیچھے سے بھی ادراک کرتے تھے جیسا کہ وہ اپنے سامنے سے ادراک کرتے تھے، اور سر کی ہڈی، رگوں، ہڈیوں، پٹھوں اور دماغ کی کثافت نے انہیں حجاب نہیں کیا؟ مگر یہ کہ اللہ نے ظلمت اور کثافت کو امانت عطا کی ہے، پس وہ اس چیز کو چھپاتی ہے جو اس میں موجود ہے، اور اسی لیے وہ اس چیز کو ظاہر نہیں کرتی جو اس میں ہے۔ پس جب وہ ظاہر ہوتی ہے تو یہ ایک خرقِ عادت ہوتا ہے، اس الٰہی قوت کی وجہ سے جو اللہ نے بعض اشخاص کو عطا کی ہے۔ اور جب امانت رکھنے والے کو، جسے امانت سونپی گئی ہے، حکم دیا جاتا ہے کہ وہ اسے اس کے لیے ظاہر کرے جسے امانت رکھنے والا، یعنی الحق (ذات حق) تعالیٰ، چاہتا ہے، تو اسے یہ حق ہے کہ وہ اسے اس تک پہنچا دے۔ پس تاریک اجسام سے بڑھ کر کوئی امین نہیں ہے اس چیز پر جو وہ انوار سے لپیٹے ہوئے ہیں۔\n\nاور اللہ نے ان کی امانت پر ان میں سے بعض کا ذکر کر کے تنبیہ کی ہے، جیسا کہ اس کا فرمان ہے:\nوهذَا الْبَلَدِ الْأَمِينِ (اور یہ امانت والا شہر)۔\nپس اس نے اسے امین کہا، اور وہ زمین ہے جس میں دیواریں، فصیلیں، مٹی اور گارا ہے۔ پس اس نے اسے امانت سے متصف کیا اور اس کی قسم کھائی، جیسا کہ اس نے دوسروں کی قسم کھائی، اللہ کی مخلوقات کی تعظیم کے لیے اور ہمیں یہ سکھانے کے لیے کہ ہم ان کے خالق کی تعظیم کریں اور اللہ کی تعظیم کی وجہ سے ان کی تعظیم کریں، نہ کہ ان کی قسم کھانے کی وجہ سے، کیونکہ ہمارے لیے ان کی قسم کھانا جائز نہیں ہے۔ اور جو اللہ کے سوا کسی اور کی قسم کھائے وہ اللہ کے حکم کی خلاف ورزی کرنے والا ہے۔ اور یہ ایک مشہور اختلافی مسئلہ ہے علماءِ رسوم کے درمیان، یعنی اللہ کے سوا کسی اور کی قسم کھانا۔\n\nجسم جتنا زیادہ ٹیڑھا ہوتا ہے، اتنا ہی وہ اصل کے قریب ہوتا ہے جو استداره (گولائی) ہے۔ کیونکہ پہلے جسم سے پہلے کی شکل استداره تھی، پس وہ فلک تھا۔ اور چونکہ جو کچھ اس کے نیچے ہے وہ اس سے ہے، اس لیے وہ اس جیسا تھا، اور جو اس سے دور ہوا وہ اس کے قریب تھا۔\n\nاور اگر طبیعت اپنی اصل میں نور نہ ہوتی تو نفسِ کلیہ اور ہیولیٰ (الهيولى) کے درمیان کوئی چیز نہ پائی جاتی۔ اور ہیولیٰ (الهيولى) جو کہ ہباء (الهباء) ہے، سب سے پہلے اس کے وجود سے ظلمت ظاہر ہوئی، پس وہ ایک تاریک جوہر ہے جس میں شفاف اور دیگر اجسام ظاہر ہوئے۔ پس عالم میں ہر ظلمت ہیولیٰ (الهيولى) کے جوہر سے ہے جو ہباء (الهباء) ہے۔ اور چونکہ وہ اپنی اصل میں نور سے ہے، اس لیے اس نے مناسبت کی وجہ سے تمام نوری صورتوں کو قبول کیا، پس اس کی ظلمت ان کی نوری صورتوں سے ختم ہو گئی، کیونکہ صورت نے اسے ظاہر کیا۔ پس عقلمندوں کی اصطلاح میں ظلمت کو طبیعت کی طرف منسوب کیا گیا۔\n\nاور ہمارے نزدیک ظلمت (الظلمة) غیب (الغيب) کے سوا کسی چیز کا اظہار نہیں ہے، کیونکہ غیب کا ادراک حس سے نہیں ہوتا اور نہ ہی اس کے ذریعے ادراک کیا جاتا ہے۔ اور ظلمت کا ادراک کیا جاتا ہے اور اس کے ذریعے ادراک نہیں کیا جاتا۔ پس اگر ظلمت نور نہ ہوتی تو اس کا ادراک کرنا صحیح نہ ہوتا، اور اگر وہ غیب ہوتی تو اس کا مشاہدہ کرنا صحیح نہ ہوتا۔ پس غیب کو اس کے سوا کوئی نہیں جانتا۔ اور یہ سب غیب کی کنجیاں ہیں، لیکن ان کے کنجیاں ہونے کا علم اللہ کے سوا کسی کو نہیں ہے۔ اللہ تعالیٰ فرماتا ہے:\nوعِنْدَهُ مَفاتِحُ الْغَيْبِ لا يَعْلَمُها إِلَّا هُوَ (اور اسی کے پاس غیب کی کنجیاں ہیں، جنہیں اس کے سوا کوئی نہیں جانتا)۔\nاگرچہ وہ ہمارے درمیان موجود ہیں، لیکن ہم نہیں جانتے کہ وہ غیب کی کنجیاں ہیں۔ اور اگر ہم خبروں سے جان بھی لیں کہ وہ کنجیاں ہیں، تو ہم غیب کو نہیں جانتے یہاں تک کہ ہم ان کے ذریعے اسے کھول سکیں۔ پس یہ اس شخص کی طرح ہے جسے کسی گھر کی چابی مل جائے اور وہ اس گھر کو نہ جانتا ہو جسے وہ اس سے کھولے۔\nعالِمُ الْغَيْبِ فَلا يُظْهِرُ عَلى‏ غَيْبِهِ أَحَداً (وہ غیب کا جاننے والا ہے، پس وہ اپنے غیب پر کسی کو مطلع نہیں کرتا)۔\n\nپھر تمہیں یہ جاننا چاہیے، اس کے بعد کہ میں نے تمہیں چیزوں میں نور کے سرایت کرنے سے آگاہ کیا، کہ مخلوق شقی اور سعید کے درمیان ہے۔ پس تمام موجودات میں، ان کے کثیف اور لطیف، تاریک اور غیر تاریک میں نور کے سرایت کرنے کی وجہ سے، تمام موجودات نے اپنے صانع کے وجود کا اقرار کیا، بغیر کسی شک و شبہ کے۔ اور چونکہ اس کے لیے غیبِ مطلق ہے، اس لیے اس کی ذات کو ثبوت کے طریقے سے نہیں جانا جاتا، لیکن اسے ان چیزوں سے منزہ کیا جاتا ہے جو مخلوقات کے لائق ہیں۔ جیسا کہ غیب یہ جانتا ہے کہ وہاں غیب ہے، لیکن وہ نہیں جانتا کہ اس میں کیا ہے اور وہ کیا ہے۔\n\nپس جب الٰہی خبریں روحانیوں کی زبانوں پر وارد ہوئیں اور انہوں نے انہیں رسولوں تک پہنچایا، اور رسولوں علیہم السلام نے انہیں ہم تک پہنچایا، تو جس نے ان پر ایمان لایا اور اپنی فکر کو اپنی پشت کے پیچھے چھوڑ دیا اور انہیں اپنے عقل میں موجود قبولیت کی صفت کے ساتھ قبول کیا اور خبر دینے والے کی تصدیق کی جو وہ لایا، پھر اگر اس نے تصدیق کے علاوہ کسی زائد عمل کا تقاضا کیا تو اس نے وہ عمل کیا، تو وہی سعید (السعيد) کہلاتا ہے، اور وہ ان میں سے ہے جس نے أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ (کان لگائے اور وہ حاضر ہو)۔ اور اس کے لیے وہ جزا ہے جس کا اس سے دار القرار میں اور دائمی نعمت میں وعدہ کیا گیا ہے، جو کسی مقررہ مدت تک نہیں چلتی کہ اس کی مدت پوری ہونے پر ختم ہو جائے، مجموعی طور پر ایک الٰہی حکم کے طور پر جو نہ بدلے گا، نہ ٹوٹے گا اور نہ منسوخ ہوگا۔\n\nاور جس نے ان پر ایمان نہ لایا اور اپنی فاسد فکر کو اپنے سامنے رکھا اور اس کی پیروی کی اور نبوی خبروں کو رد کر دیا، یا تو اصل کی تکذیب سے یا فاسد تاویل سے، پس اگر اس نے خبر دینے والے کی تکذیب کی جو وہ لایا اور اس کے تقاضے کے مطابق عمل نہ کیا، اگر اس نے تصدیق کے علاوہ کسی زائد عمل کا تقاضا کیا، تو وہی شقی (الشقِي) کہلاتا ہے، اور یہ اس ظلمت کی وجہ سے ہے جو اس میں ہے، جیسا کہ سعید نے اس نور کی وجہ سے ایمان لایا جو اس میں ہے۔ اور اس کے لیے وہ جزا ہے جس کی اسے دار البوار (ہلاکت کا گھر) میں اور عدم قرار میں شر سے وعید دی گئی ہے، دائمی عذاب کے وجود کی وجہ سے جو کسی مقررہ مدت تک نہیں چلتا، اگرچہ نفس الامر میں مجموعی طور پر اس کی ایک مدت ہے، ایک عدل پر مبنی الٰہی حکم کے طور پر، جیسا کہ سعید کے حق میں فضل پر مبنی تھا، جو نہ بدلے گا، نہ ٹوٹے گا اور نہ منسوخ ہوگا۔\n\nاور اس میں اہل کشف (اہل الکشف) کے درمیان اختلاف ہے، اور یہ مومنین کے علماءِ رسوم اور اہل کشف کے درمیان ایک عظیم مسئلہ ہے۔ اور اسی طرح اہل کشف کے درمیان بھی اس میں اختلاف ہے کہ کیا ان پر عذاب ہمیشہ کے لیے رہے گا جس کی کوئی انتہا نہیں، یا ان کے لیے شقاوت کے گھر میں نعمت ہوگی، پس ان میں عذاب ایک مقررہ مدت پر ختم ہو جائے گا؟ اور وہ اس بات پر متفق ہیں کہ وہ اس سے باہر نہیں نکلیں گے اور وہ اس میں ہمیشہ رہیں گے جس کی کوئی انتہا نہیں ہے۔ کیونکہ دونوں گھروں میں سے ہر ایک کا اپنا بھرپور حصہ ہے، اور ان پر ظاہری طور پر مختلف قسم کے درد کے اسباب ہوں گے، جو ضروری ہیں۔ اور وہ اس میں اپنے اندرونی اختلاف کی وجہ سے باطنی طور پر لذت پائیں گے، اس کے بعد کہ درد ان سے سزا کا بدلہ لے لے۔\n\nمجھے عبداللہ الموروری نے ایک جماعت کے ساتھ، ابو مدین، امام الجماعت سے روایت کرتے ہوئے بتایا کہ انہوں نے فرمایا: \"دونوں گھروں کے لوگ ان میں داخل ہوں گے، سعداء اللہ کے فضل سے اور اہل نار اللہ کے عدل سے۔ اور وہ ان میں اعمال کے ذریعے اتریں گے اور نیتوں کے ذریعے ان میں ہمیشہ رہیں گے۔\" اور یہ ایک صحیح کشف اور ایک قیمتی کلام ہے۔\n\nپس سزا کا بدلہ درد لے گا، جو دنیا میں شرک میں عمر گزارنے کی مدت کے برابر ہوگا۔ پس جب مدت ختم ہو جائے گی، تو ان کے لیے آگ میں نعمت بنا دی جائے گی، اس طرح کہ اگر وہ جنت میں داخل ہوتے تو انہیں تکلیف ہوتی، اس مزاج کے موافق نہ ہونے کی وجہ سے جس پر اللہ نے انہیں پیدا کیا ہے۔ پس وہ اس آگ، زمہریر اور سانپوں اور بچھوؤں کے ڈسنے سے لذت حاصل کریں گے، جیسا کہ اہل جنت سائے اور نور سے اور خوبصورت حوروں کے بوسے سے لذت حاصل کرتے ہیں، کیونکہ ان کا مزاج اس کا تقاضا کرتا ہے۔ کیا تم نہیں دیکھتے کہ دنیا میں گوبریلا ایسے مزاج پر ہے کہ وہ گلاب کی خوشبو سے پریشان ہوتا ہے اور بدبو سے لذت حاصل کرتا ہے؟ اسی طرح وہ شخص جو اپنے مزاج پر پیدا کیا گیا ہو۔ اور دنیا میں ایسے مزاج واقع ہوئے ہیں جن کا ہم نے مشاہدہ کیا ہے۔ پس عالم میں کوئی ایسا مزاج نہیں ہے مگر اس کے لیے مناسب چیز سے لذت ہے اور نامناسب چیز سے عدم لذت ہے۔ کیا تم نہیں دیکھتے کہ گرم مزاج والا مشک کی خوشبو سے تکلیف محسوس کرتا ہے؟ پس لذتیں موافق چیز کے تابع ہیں اور درد عدم موافقت کے تابع ہیں۔\n\nپس یہ امر بذاتِ خود محقق ہے، کوئی عقل مند اس کا انکار نہیں کرتا۔ لیکن اصل مسئلہ یہ ہے کہ کیا اہل نار اس مدت کے ختم ہونے کے بعد اس مرتبے پر اس مزاج پر ہوں گے یا نہیں؟ یا وہ ایسے مزاج پر ہوں گے جو انہیں تکلیف دہ چیزوں سے درد کا احساس دلائے گا؟ اور صحیح، صریح، بے عیب نقل، جب علم کا فائدہ دے، تو اس پر بلا شک حکم لگایا جاتا ہے۔ ف الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ (پس اللہ ہر چیز پر قادر ہے)۔ اگرچہ میں اس معاملے میں جاہل نہیں ہوں، لیکن اس کا اظہار ضروری نہیں ہے، کیونکہ اس کا اظہار عالم سے اختلاف کو ختم نہیں کرے گا۔\n\nاور بعض اہل کشف نے کہا کہ وہ جنت کی طرف نکل جائیں گے، یہاں تک کہ اس میں کوئی بھی شخص باقی نہیں رہے گا، اور اس کے دروازے بجتے رہیں گے، اور اس میں جرجیر (ایک قسم کی سبزی) اگے گی، اور اللہ اس کے لیے ایسے اہل پیدا کرے گا جو اسے اس کے مزاج سے بھر دیں گے، جیسا کہ وہ پانی میں مچھلی اور ہوا میں ہوا کی مخلوق اور زمین کے اندر ایک مخلوق پیدا کرتا ہے جس کی زندگی صرف اسی میں ہوتی ہے، جیسے چھچھوندر، پس جب وہ زمین کی سطح پر آتا ہے تو مر جاتا ہے۔ پس جو غم ہمارے لیے ہے وہ ان کی زندگی کا غم ہے۔ پس مچھلی جب ہوا میں نکلتی ہے تو مر جاتی ہے اور ہوا میں اس کا غم ہوتا ہے، جس سے اس کی زندگی کا نور بجھ جاتا ہے۔ اور انسان اور خشکی کا حیوان جب پانی میں ڈوبتا ہے تو ہلاک ہو جاتا ہے اور پانی میں اس کا غم ہوتا ہے، جس سے اس کی زندگی کا نور بجھ جاتا ہے۔ اور پھر کچھ سمندری حیوانات ہیں جو یہاں بھی رہتے ہیں اور وہاں بھی، جیسے مگرمچھ، آبی انسان اور اس کا کتا، اور بعض پرندے۔ اور یہ سب اس طبیعت اور مزاج کی وجہ سے ہے جس پر اللہ نے انہیں پیدا کیا ہے۔\n\nاور ہم نے اس مقام میں وہ کچھ ذکر کر دیا ہے جو کافی ہے اور اللہ کی مدد اور الہام سے اس کے اصولوں کو پورا کر دیا ہے۔ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب دویست و هشتاد و نهم در معرفت منزل علم اُمّی که هیچ علمی از حضرت موسوی بر آن پیشی نگرفته است.\n\nعلم به حق (الحق) زینت و آرایش است *** و علم به تفکر، تشبیه و گمراهی است.\n\nو علم به تفکر، اجمال و مغالطه است *** و علم به حق (الحق)، تحقیق و تفصیل است.\n\nو علم به تفکر، نشانه‌هایی مجرد است *** و علم به حق (الحق)، تحول و تبدیل است.\n\nپس گفتارهای آراسته تو را نفریبد *** زیرا مدلول آن‌ها جهل و تعلیل است.\n\nفیلسوف نفی خدا را می‌بیند به آنچه *** علت او می‌دهد و این تعطیل (انکار صفات) است.\n\nو اشعری عین کثیر شده را می‌بیند *** و این علم است، اما در آن تمثیل (تشبیه) وجود دارد.\n\n### [اُمّی بودن از دیدگاه ابن عربی]\n\nاُمّی بودن (الأمية) نزد ما منافاتی با حفظ قرآن و حفظ اخبار نبوی ندارد، بلکه اُمّی بودن نزد ما کسی است که با نظر فکری و حکم عقلی خود در استخراج معانی و اسراری که قرآن و اخبار در بر دارند، و در استخراج ادله عقلی در علم الهیات، و ادله فقهی، قیاسات و تعلیلات در احکام شرعی تصرف نکرده باشد. اگر قلب از علم نظر فکری، چه شرعی و چه عقلی، سالم بماند، اُمّی خواهد بود و قابلیت پذیرش فتح الهی را به کامل‌ترین وجه و با سرعت و بدون کُندی خواهد داشت. چنین کسی از علم لَدُنّی (العلم اللدني) در هر چیزی بهره‌مند می‌شود که قدر آن را جز پیامبر یا کسی از اولیا که آن را چشیده باشد، نمی‌داند. با این علم، درجه ایمان و نشأت آن کامل می‌شود و به درستی و نادرستی افکار و اینکه صحت و سقم به چه نسبتی به آن‌ها منسوب می‌شود، وقوف می‌یابد. همه این‌ها از جانب خداست. او با وجود حکم به باطل، می‌داند که هیچ باطلی در هستی (الوجود) نیست، زیرا هر آنچه وارد هستی شده، از عین و حکم، از آنِ خدای تعالی است نه غیر او. پس نه عبثی در عین است و نه باطلی در حکم، زیرا فعلی جز از خدا نیست و فاعلی جز خدا نیست و حکمی جز از خدا نیست و حاکمی جز خدا نیست. کسی که علم مذکور بر او پیشی گرفته باشد، بعید است که از علم لَدُنّی الهی به اندازه‌ای بهره‌مند شود که اُمّیِ ما که علم مذکور بر او پیشی نگرفته، بهره‌مند می‌شود. زیرا موازین عقلی و ظواهر موازین اجتهادی نزد فقها، بسیاری از آنچه را که ما ذکر کردیم، رد می‌کنند، چرا که امر، کلاً و غالباً، فراتر از طور عقل و میزان آن است و در آنجا کارایی ندارد، و فراتر از میزان مجتهدان از فقهاست، نه فراتر از فقه؛ زیرا این (علم لَدُنّی) عین فقه صحیح و علم صریح است. در داستان موسی و خضر دلیل قوی بر آنچه گفتیم وجود دارد. پس حال فقیه چگونه است و آن «اَینیت» (الأينية) و مانند آن که شارع و کشف (الکشف) آن را به خدا نسبت داده‌اند، کجا قرار دارد؟ این‌ها کجایند در برابر موازین نظری و براهین عقلی، بر اساس گمان عقل و حکم مجتهد؟ پس رحمتی که خداوند به بنده خود عطا می‌کند این است که میان او و علم نظری و حکم اجتهادی از جهت نفس او حائل شود تا خداوند او را به این وسیله در فتح الهی و علمی که از نزد خود به او می‌دهد، مورد لطف قرار دهد. خدای تعالی در حق بنده خود خضر فرمود: **عَبْداً من عِبادِنا** (بنده‌ای از بندگان ما) و او را به نون جمع اضافه کرد. **آتَيْناهُ رَحْمَةً من عِنْدِنا** (رحمتی از نزد خود به او دادیم) با نون جمع، و **عَلَّمْناهُ** (به او آموختیم) با نون جمع، **من لَدُنَّا عِلْماً** (از نزد خود علمی) با نون جمع. یعنی در این فتح، علم ظاهر و باطن، علم سر و علانیه، علم حکم و حکمت، علم عقل و وضع، و علم ادله و شبهات را برای او جمع کرد. کسی که علم عام به او داده شده و مأمور به تصرف در آن است، مانند انبیا و هر کس از اولیا که خدا بخواهد، مورد انکار قرار می‌گیرد (از سوی دیگران). اما این شخص (صاحب علم لَدُنّی) هیچ‌یک از علومی را که می‌آورد، بر کسی انکار نمی‌کند، هرچند حکم آن علم با حکم دیگران مخالف باشد، بلکه جایگاه آن را می‌شناسد و می‌داند که در کجا باید به آن حکم کرد. پس حق بصیرت و سایر حواس را در حکم خود ادا می‌کند، و حکم عقل و سایر قوای معنوی را ادا می‌کند، و حکم نَسَب‌های الهی و فتح الهی را ادا می‌کند. به این ترتیب، عالم الهی بر دیگران برتری می‌یابد و آن همان بصیرتی است که قرآن با آن نازل شد، در قول خدای تعالی: **أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي** (من و هر کس که از من پیروی کند، با بصیرت به سوی خدا دعوت می‌کنیم). و این تتمه قول خدای تعالی است: **بَعَثَ في الْأُمِّيِّينَ رَسُولًا مِنْهُمْ** (در میان اُمّیان رسولی از خودشان برانگیخت). پس او پیامبر اُمّی است که با وجود اُمّی بودنش، با بصیرت دعوت می‌کند. و اُمّیان کسانی هستند که همراه او با بصیرت به سوی خدا دعوت می‌کنند، پس آنان در حکم، تابع او هستند. زیرا رئیس جماعت، مجتهد و صاحب فکر هرگز در آنچه حکم می‌کند، بر بصیرت نیست. اما مجتهد ممکن است امروز در یک واقعه شرعی حکمی کند، سپس فردا امر دیگری بر او آشکار شود که خطای حکم دیروزش را نشان دهد، پس از آن بازگردد و امروز به آنچه برایش ظاهر شده حکم کند. اما شارع (پیامبر) حکم خود را در اول و آخر جاری می‌سازد و خروج از آنچه دلیل در اجتهاد آن زمان به او داده، بر او حرام است. اگر او بر بصیرت بود، در نظر اول حکم به خطا نمی‌کرد. برخلاف حکم پیامبر که آن (حکم اول) صحیح است، سپس خداوند آن حکم را با نقیضش برمی‌دارد و این را نسخ می‌نامند. و نسخ کجا و خطا کجا؟ نسخ با بصیرت همراه است، اما خطا با بصیرت همراه نیست. همچنین است حال صاحب عقل، که در میان گروهی از عقلا رخ می‌دهد: وقتی نظر می‌کنند و دلیل را به طور کامل بررسی می‌کنند و به وجه دلیل دست می‌یابند، آن دلیل علم به مدلول را به آن‌ها می‌دهد. سپس در زمان دیگری می‌بینی که یا خصمی از طایفه‌ای دیگر، مانند معتزلی یا اشعری یا برهمایی یا فیلسوف، امری دیگر را مطرح می‌کند که دلیل او را که به آن قطع داشت، نقض کرده و در آن خدشه وارد می‌سازد. او در آن نظر می‌کند و می‌بیند که آن نظر اول خطا بوده و ارکان دلیل خود را کامل نکرده و در آن میزان را رعایت نکرده و متوجه نشده است. این کجا و بصیرت کجا؟ و چرا این امر در ضروریات عقل برای او رخ نمی‌دهد؟ پس بصیرت در حکم برای اهل این شأن، مانند ضروریات برای عقول است. سزاوار است که انسان به چنین علمی شادمان شود. حکایت شده است که ابوحامد غزالی، که مترجم احوال اهل این طریقه بود، برخی از آنچه را که آنان به آن متحقق می‌شدند، بیان کرد و گفت: «وقتی خواستم وارد سلک آن‌ها شوم و روش آن‌ها را در پیش گیرم و از دریایی که آن‌ها از آن غرفه‌اند، غرفی برگیرم، با خود خلوت کردم و از نظر و فکر خود کناره گرفتم و خود را به ذکر مشغول ساختم. پس علمی برایم منقدح شد که قبلاً نداشتم. از آن شادمان شدم و گفتم آنچه برای آن قوم حاصل شده، برای من نیز حاصل شده است. در آن تأمل کردم، دیدم در آن قوت فقهی از آنچه قبلاً بر آن بودم، وجود دارد. دانستم که هنوز برایم خالص نشده است. دوباره به خلوت خود بازگشتم و آنچه را که آن قوم به کار می‌بردند، به کار بستم. همانند آنچه در ابتدا یافته بودم، بلکه روشن‌تر و درخشان‌تر یافتم. شادمان شدم. تأمل کردم، دیدم در آن قوت فقهی از آنچه بر آن بودم، وجود دارد و برایم خالص نشده است. این کار را بارها تکرار کردم و حال همان حال بود. با این مقدار از سایر نظّار و صاحبان افکار متمایز شدم، اما به درجه آن قوم در این زمینه نرسیدم. دانستم که نوشتن بر روی محو (لوح پاک شده) مانند نوشتن بر روی غیر محو نیست. آیا نمی‌بینی که برخی درختان میوه‌شان بر گلشان پیشی می‌گیرد؟ این مانند مرتبه علمای نظر است که وارد راه خدا می‌شوند، مانند فقیه و متکلم. و برخی دیگر میوه‌شان بر گلشان پیشی نمی‌گیرد، و این همان اُمّی است که علم ظاهری فکری بر علم لَدُنّی او پیشی نگرفته است. این علم به آسان‌ترین وجه به او می‌رسد. و سبب آن این است که چون فاعلی جز خدا نیست، این فقیه و متکلم با میزان‌های خود به حضرت الهی آمدند تا خدا را با آن بسنجند، در حالی که نمی‌دانستند خدای تعالی آن میزان‌ها را به آن‌ها نداده مگر برای اینکه با آن برای خدا بسنجند، نه بر خدا. پس از ادب محروم شدند. و کسی که از ادب محروم شود، به جهل نسبت به علم لَدُنّیِ فتحی مجازات می‌شود، پس بر بصیرت از امر خود نخواهد بود. اگر عقل وافری داشته باشد، می‌داند که از کجا ضربه خورده است. پس برخی از آن‌ها وارد شدند و میزان خود را بر در گذاشتند تا وقتی خارج شدند آن را بردارند و با آن برای خدا بسنجند. حال این شخص بهتر از کسی است که میزان را با خود بر خدا وارد کرده است، اما قلبش به آنچه ترک کرده، وابسته است، زیرا در نفس خود قصد بازگشت به آن را دارد. پس به اندازه تعلقی که خاطرش به آنچه ترک کرده دارد، از حق مطلوب محروم می‌شود، به دلیل التفاتش به آن. و حال کسی که میزان خود را شکسته، بهتر از این است. اگر چوبی بوده، آن را سوزانده، و اگر از چیزهایی است که ذوب می‌شود، آن را ذوب کرده یا سوهان زده تا ماهیت میزان بودن آن از بین برود، هرچند عین جوهرش باقی بماند. این بسیار نادر است و نشنیده‌ایم کسی چنین کرده باشد. اگر فرض کنیم (و محال نیست) که خداوند برخی از بندگانش را تقویت کند تا چنین کاری انجام دهند، همان‌طور که ابوحامد غزالی درباره خود ذکر کرد که چهل روز متحیر ماند. این خطرناک است. حال اُمّی این‌گونه نیست، زیرا اُمّی مؤمنانه وارد خدا می‌شود. و این حالی که ابوحامد ذکر کرد، حال آن قوم نیست، بلکه حال کسی است که بر شریعت نبوده و خواسته است آنچه را که در آنجاست بشناسد، پس سؤال کرده و به راه آن قوم راهنمایی شده و وارد شده تا حق را با تعریف خدا بشناسد. این شخص نیز محلش پاک است. اما ابوحامد محلش به حیرت مشغول بود، پس به اندازه این شخص در پذیرش آنچه فتح الهی به او می‌آورد، قوت نداشت. اگر بنا بر تقدیر، بر چنین شخصی که در این مرتبه است، فتحی حاصل شود، آن میزان‌هایی را که از بین برده بود، در آنچه برایش گشوده شده، می‌بیند و از آن تعجب می‌کند. وقتی خارج شد، آن‌ها را با خود برد و با آن‌ها برای خدا سنجید، نه بر خدا، همان‌طور که انبیا (علیهم السلام) انجام دادند. پس او چیزی را رد نمی‌کند و چیزی را در غیر میزان خود قرار نمی‌دهد و خطا و شک از بین می‌رود و معنای قول او را می‌شناسد: **ونضَعُ الْمَوازِينَ الْقِسْطَ لِيَوْمِ الْقِيامَةِ** (و ترازوهای عدالت را برای روز قیامت می‌نهیم). پس خداوند آن‌ها را میزان‌های بسیاری قرار داد تا با هر میزان، آنچه را که برای آن وضع شده، بسنجد. و چون متکلم با میزان عقل خود چیزی را که خارج از عقل است، سنجید، زیرا فراتر از طور اوست، یعنی نَسَب‌های الهی، میزانش آن را نپذیرفت و آن را دور انداخت و به آن کفر ورزید و خیال کرد که حقی جز آنچه در میزان او وارد شود، وجود ندارد. و مجتهد فقیه، حکم شرع را با میزان نظر خود سنجید، مانند شافعی مذهب، که خواست با میزان خود حلال بودن نبیذ (شراب خرما) را بسنجد که میزان ابوحنیفه آن را پذیرفته بود. میزان شافعی آن را دور انداخت و حرام کرد و گفت ابوحنیفه خطا کرده است. سزاوار نبود که شافعی مذهب چنین سخنی را بدون قید بگوید، در حالی که می‌دانست شرع هر مجتهدی را به آنچه اجتهادش به آن رسیده، متعبد ساخته و خروج از دلیل خود را بر او حرام کرده است. پس او حق صنعت را ادا نکرد و در میزان عامی که حکم شریعت را به طور مطلق شامل می‌شود، خطا کرد. این همان چیزی است که علمای شریعت بدون اختلاف در اصول ادله و فروع احکام به آن استناد کرده‌اند. اما در اصول، کسانی که قیاس را دلیلی اثبات کردند، اجتهاد مشروعشان آن‌ها را به آن رساند. و مخالف آن‌ها از ظاهریه می‌داند که هر مجتهدی به آنچه اجتهادش به او داده، متعبد است، اما درباره آن‌ها می‌گوید که در اثبات قیاس به عنوان دلیل خطا کرده‌اند. در حالی که برای ظاهریه جایز نیست که حکمی را که شرع مقرر کرده، تخطئه کنند. پس قیاس به عنوان دلیل شرعی اثبات می‌شود و نفی قیاس به عنوان دلیل شرعی نیز اثبات می‌شود. و اما در فروع، مانند علی (رضی الله عنه) که نکاح ربیبه (دختر زن) را در صورتی که در حجر (تحت سرپرستی) نباشد، حلال می‌داند، حتی اگر با مادرش دخول کرده باشد، به دلیل عدم وجود هر دو شرط با هم. و با وجود هر دو شرط، ربیبه حرام می‌شود. یعنی با مجموع (دو شرط). و مخالف این را نمی‌پذیرد. پس میزان عام حکم هر دوی آن‌ها را جاری می‌سازد، اما عامل به میزان عام به دلیل عدم انصاف کم است. ما در این فصل سبب محرومیت فقها، عقلا و نظّار را بیان کردیم که چرا وارد باب این علم شریف احاطی نشدند، علمی که هر طایفه‌ای را بر آنچه هست، تصدیق می‌کند، چه آن راه آن‌ها را به سعادت بکشاند و چه به شقاوت. و هیچ‌کس راه خود را به او تسلیم نمی‌کند، مگر کسی که آنچه را آن‌ها چشیده‌اند، چشیده باشد و به آن ایمان آورده باشد. چنانکه ابویزید گفت: «اگر کسی را دیدید که به کلام اهل این طریقه ایمان می‌آورد و آنچه را که آن‌ها به آن متحقق می‌شوند، به آن‌ها تسلیم می‌کند، به او بگویید برای شما دعا کند، زیرا دعایش مستجاب است.» و چگونه دعایش مستجاب نباشد، در حالی که تسلیم‌شونده در بحبوحه حضرت (الهی) است، اما به دلیل جهل به آن، نمی‌داند که در آنجاست. خداوند ما را از کسانی قرار دهد که نوری از نوری که **يَهْدِي به من يَشاءُ من عِبادِهِ** (هر که را بخواهد از بندگانش به آن هدایت می‌کند) برایشان قرار داده است، تا به وسیله آن به **صِراطٍ مُسْتَقِيمٍ صِراطِ الله الَّذِي لَهُ ما في السَّماواتِ وما في الْأَرْضِ** (راه راست، راه خدا که آنچه در آسمان‌ها و آنچه در زمین است از آن اوست) از موازین و صراط‌ها هدایت کند. **أَلا إِلَى الله تَصِيرُ الْأُمُورُ** (آگاه باشید که امور به سوی خدا بازمی‌گردد). خدای تعالی در مقام منت‌گذاری بر رسولش (صلی الله علیه و سلم) فرمود: **وكَذلِكَ أَوْحَيْنا إِلَيْكَ رُوحاً من أَمْرِنا** (و این‌گونه روحی از امر خود را به تو وحی کردیم) و آن قول اوست: **يُلْقِي الرُّوحَ من أَمْرِهِ** (روح را به فرمان خود القا می‌کند)... **ما كُنْتَ تَدْرِي ما الْكِتابُ ولا الْإِيمانُ** (تو نمی‌دانستی کتاب چیست و ایمان کدام است). و این به معنای عاری بودن محل (قلب) از هر چیزی است که او را از پذیرش آنچه به او وحی شده، باز دارد. **ولكِنْ جَعَلْناهُ نُوراً** (ولی ما آن را نوری قرار دادیم) یعنی این منزل را، **نَهْدِي به من نَشاءُ من عِبادِنا** (هر که را از بندگانمان بخواهیم، به آن هدایت می‌کنیم). و با «مَن» آمده که نکره است در دلالت، اما نزد او مختص به برخی از بندگانش از پیامبر یا ولی است. و تو با آن نوری که تو را به آن هدایت کردیم، هدایت می‌کنی. اگر این بنده پیامبر باشد، آن نور شریعت است، و اگر ولی باشد، تأییدی است برای شریعت پیامبر و حکم او، امری مشروع که نزد برخی از مؤمنان به آن مجهول است، **إِلى‏ صِراطٍ مُسْتَقِيمٍ** (به سوی راه راست). در حق پیامبر، راه سعادت و علم است، و در حق ولی، راه علم به آنچه از امر مشروع که حکمت را در بر دارد، مجهول مانده است. خدای تعالی فرمود: **يُؤْتِي الْحِكْمَةَ من يَشاءُ ومن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْراً كَثِيراً** (حکمت را به هر که بخواهد می‌دهد، و به هر کس حکمت داده شود، خیر بسیاری به او داده شده است) که نمی‌توان گفت در آن اندکی است. سپس فرمود: **وما يَذَّكَّرُ إِلَّا أُولُوا الْأَلْبابِ** (و جز خردمندان پند نمی‌گیرند). و لُبّ، نوری در عقل است، مانند روغن در بادام و زیتون. و تذکر (به یاد آوردن) جز از علم فراموش شده حاصل نمی‌شود. پس به آنچه در این آیات بیان کردیم، توجه کن تا ان‌شاءالله سعادتمند شوی. و پس از آنکه مرتبه این علم را از این منزل برایت آشکار ساختم، باید اصل این علم و ماده بقای آن و حجاب ماده آن و اینکه با تأیید و توفیق الهی چگونه به آن می‌توان رسید، بیان کنیم.\n\n### [علوم الهی که عارفان به آن منتهی می‌شوند]\n\nبدان که اصل این علم الهی، مقامی است که عارفان (العارفون) به آن منتهی می‌شوند، و آن این است که «مقامی وجود ندارد»، چنانکه در اشاره به قول خدای تعالی آمده است: **يا أَهْلَ يَثْرِبَ لا مُقامَ لَكُمْ** (ای اهل یثرب، برای شما جای ماندن نیست). این مقام اصلاً به صفتی مقید نمی‌شود. ابویزید بسطامی (رحمه الله) به این نکته توجه داده است؛ وقتی به او گفته شد: «چگونه صبح کردی؟» گفت: «من نه صباحی دارم و نه مسائی. صباح و مساء برای کسی است که به صفت مقید باشد و من صفتی ندارم.» پس صباح برای طلوع است و مساء برای غروب. و طلوع برای ظهور و عالم مُلک و شهادت است، و غروب برای پوشیدگی و عالم غیب و ملکوت. عارف در این مقام مانند زیتون مبارکی است که نه شرقی است و نه غربی. پس هیچ وصفی بر این مقام حکم نمی‌کند و به آن مقید نمی‌شود. و این بهره او از **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست) و **سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصْفُونَ** (منزه است پروردگار تو، پروردگار عزت، از آنچه وصف می‌کنند) است. پس مقامی که چنین است، اصل این علم است. و میان این اصل و این علم مراتبی وجود دارد. اصل، ثبات بر تنزیه از پذیرش وصف و میل به حالی دون حال است. سپس این ثبات، صورتی را نتیجه می‌دهد که عارف به آن متصف می‌شود. این صورت ظاهری دارد و باطنی. به باطن آن جز پس از مجاهدت بدنی و ریاضت نفسانی نمی‌توان رسید. وقتی به سرّ این باطن رسید، که علمی خاص است و برای این علم مطلوب مانند روغن برای چراغ است، و علم مانند چراغ است. پس ثمره این علم جز در علمای به آن ظاهر نمی‌شود، همان‌طور که حکم روغن جز در چراغی که با فتیله برپاست، ظاهر نمی‌شود. و در اینجا برای او اکتساب اوصافی رخ می‌دهد که ما اصل را در آن مقام از آن‌ها منزه دانستیم. و در این مقام، ما او را به خاطر خودمان وصف می‌کنیم، نه به خاطر خودش. پس این وصف برای آثار است، نه برای او. «خدا بود و چیزی با او نبود.» و سخن درباره این اصل در باب سیصد و پنجاهم این کتاب خواهد آمد. و از جمله آنچه این منزل در بر دارد، علم خلق اجسام طبیعی است و اینکه اصل آن‌ها از نور است. به همین دلیل، اگر انسان بداند چگونه تمام اجسام کثیف ظلمانی را تصفیه کند، آن‌ها را شفاف می‌سازد تا نورانیتی که اصل آن‌هاست، آشکار شود؛ مانند شیشه که اگر از کدورت ماسه خالص شود، شفاف می‌گردد. و جلا دادن سنگ‌ها و معادن بلور و مروارید از این باب است. و این بدان سبب است که اصل همه موجودات، خداست، از اسم او **نُورُ السَّماواتِ** (نور آسمان‌ها) که همان بالایی‌هاست، **وَالْأَرْضِ** (و زمین) که همان پایینی‌هاست. پس در اضافه کردن نور به آسمان‌ها و زمین تأمل کن. اگر نورانیت در اجسام کثیف نبود، برای مکاشف صحیح نبود که پشت دیوارها و زیر زمین و بالای آسمان‌ها را کشف کند. و اگر لطافتی که اصل آن‌هاست نبود، صحیح نبود که برخی اولیا دیوارها را بشکافند، و قیام مرده در قبرش و خاک بر او یا تابوت میخ‌کوب شده بر او که خاک بر آن ریخته شده، مانع نشستن او نشود، هرچند خداوند دیدگان ما را از او گرفته باشد. و مکاشف از ما او را کشف می‌کند. در این باره اخبار و حکایات بسیاری از صالحان وارد شده است. به همین دلیل، هیچ جسمی را که خدا آفریده و بر اصل خلقت خود مستقیم باقی مانده باشد، نمی‌بینی. هرگز چنین نیست، مگر مایل به استداره (گردی) است، نه از جماد و نه از نبات و نه از حیوان و نه آسمان و نه زمین و نه کوه و نه برگ و نه سنگ. و سبب آن، میل آن به اصل خود یعنی نور است. اولین موجود، عقل است که همان قلم است و نوری الهی و ابداعی است. و از آن، نفس را ایجاد کرد که همان لوح محفوظ است و از نظر نورانیت به دلیل واسطه‌ای که میان آن و خداست، پایین‌تر از عقل است. و اشیا پیوسته کثیف‌تر شدند تا به ارکان و مولدات (موجودات متولد شده) رسیدند. و چون هر موجودی وجه خاصی به سوی موجِد خود داشت، سریان نور در آن بود. و چون وجهی به سوی سبب خود داشت، از ظلمت و کثافت در آن بود. اگر عاقل باشی، تأمل کن. به همین دلیل، هر چه امر پایین‌تر می‌آید، تاریک‌تر و کثیف‌تر می‌شود. پس منزلت عقل کجا و منزلت زمین کجا؟ چقدر واسطه میان آن‌هاست! سپس بدان که جسم انسان آخرین مولود است. پس او آخرین فرزند است که از **حَمَإٍ مَسْنُونٍ صَلْصالٍ** (گِل بدبو و خشک) ترکیب شده است. و همان‌طور که دیدی، مایل به استداره است، هرچند حرکت مستقیم دارد، برخلاف چهارپایان و گیاهان. و در آن از انوار معنوی و حسی و زجاجی (شیشه‌ای) وجود دارد که در هیچ‌یک از مولدات دیگر نمی‌یابی، به دلیل قوای روحانی که خداوند به او عطا کرده است. و این قوا را نپذیرفت مگر به نورانیتی که در اوست. پس این نورانیت مناسب پذیرش این ادراکات است. و به همین دلیل خدای تعالی فرمود: **وآيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهارَ** (و نشانه‌ای برای آن‌ها شب است که روز را از آن برمی‌کشیم).\n\n### [اگر نور نبود، ظلمتی وجود نداشت]\n\nبدان که نور در ظلمت پنهان است. اگر نور نبود، ظلمتی وجود نداشت. و نفرمود: «نور را از آن برمی‌کشیم»، زیرا اگر نور از آن گرفته می‌شد، وجود ظلمت از بین می‌رفت، اگر گرفتن به معنای عدم باشد، و اگر به معنای انتقال باشد، ظلمت به دنبال آن می‌رفت، زیرا ظلمت عین ذات نور است. و روز از برخی انوار متولد شده از طلوع خورشید است. اگر ظلمت نور ذاتی برای خود نداشت، صحیح نبود که ظرفی برای روز باشد، و صحیح نبود که ادراک شود، در حالی که ادراک می‌شود. و شیء ادراک نمی‌شود مگر اینکه در آن نوری باشد که با آن از ذات خود ادراک شود، و آن عین وجود و استعداد آن برای پذیرش ادراک دیدگان به واسطه انواری است که در آن‌هاست. و ادراک به طور معمول به چشم اختصاص داده شده است، در حالی که ادراک فی‌نفسه برای هر چیزی است. پس هر چیزی خود را و هر چیز دیگری را ادراک می‌کند. آیا نمی‌بینی که رسول (صلی الله علیه و سلم) چگونه پشت سر خود را ادراک می‌کرد، همان‌طور که جلوی خود را ادراک می‌کرد؟ و کثافت استخوان سر و رگ‌ها و استخوان‌ها و عصب و مغز او را محجوب نمی‌ساخت. جز اینکه خداوند به ظلمت و کثافت امانت داده است، پس آنچه را در بر دارند، می‌پوشانند. به همین دلیل، آنچه در درون دارند، آشکار نمی‌شود. و اگر آشکار شود، این خرق عادت است به دلیل نیروی الهی که خداوند به برخی اشخاص عطا کرده است. و اگر کسی که امانت به او سپرده شده، از سوی امانت‌گذار (که حق تعالی است) مأمور شود که آن را برای هر که او بخواهد آشکار کند، می‌تواند آن را به او ادا کند. پس هیچ امینی مانند اجسام تاریک بر انواری که در خود نهفته دارند، نیست. و خداوند با ذکر برخی از آن‌ها در قول خود به امانت آن‌ها توجه داده است: **وهذَا الْبَلَدِ الْأَمِينِ** (و سوگند به این شهر امن). پس آن را امین نامید، در حالی که زمینی است دارای دیوارها و حصارها و خاک و گِل و خشت. پس آن را به امانت وصف کرد و به آن سوگند یاد کرد، همان‌طور که به غیر آن سوگند یاد کرد، برای تعظیم مخلوقات خدا و تعلیم ما که خالق آن‌ها را تعظیم کنیم و آن‌ها را به تعظیم خدا تعظیم کنیم، نه از جهت سوگند خوردن به آن‌ها، زیرا برای ما جایز نیست که به آن‌ها سوگند بخوریم. و کسی که به غیر خدا سوگند بخورد، مخالف امر خداست. و این مسئله‌ای است که میان علمای رسوم (فقه) مشهور است، یعنی سوگند به غیر خدا. هر چه اجسام کج‌تر باشند، به اصل که استداره است، نزدیک‌ترند. زیرا اولین شکلی که جسم اول پذیرفت، استداره بود، پس فلک شد. و چون آنچه زیر آن است از آن است، مانند آن بود. و آنچه از آن دور شد، نزدیک به آن بود. و اگر طبیعت در اصل خود نور نبود، میان نفس کلی و هیولای کل (الهيولى) چیزی یافت نمی‌شد. و هیولایی که همان هباء (غبار) است، اولین چیزی است که ظلمت با وجود آن ظاهر شد. پس آن جوهری تاریک است که اجسام شفاف و غیر آن در آن ظاهر شدند. پس هر ظلمتی در عالم از جوهر هباء است که همان هیولاست. و چون در اصل خود از نور است، همه صورت‌های نورانی را به دلیل مناسبت پذیرفت. پس ظلمت آن با نور صورت‌هایش از بین رفت، زیرا صورت آن را آشکار ساخت. پس ظلمت در اصطلاح عقلا به طبع نسبت داده شد. و نزد ما، ظلمت چیزی جز غیب نیست، زیرا غیب با حس ادراک نمی‌شود و با آن نیز ادراک نمی‌شود. اما ظلمت ادراک می‌شود و با آن ادراک نمی‌شود. اگر ظلمت نور نبود، صحیح نبود که ادراک شود. و اگر غیب بود، صحیح نبود که شهود شود. پس غیب را جز او نمی‌داند. و همه این‌ها کلیدهای غیب هستند، اما اینکه کلید هستند را جز خدا نمی‌داند. خدای تعالی می‌فرماید: **وعِنْدَهُ مَفاتِحُ الْغَيْبِ لا يَعْلَمُها إِلَّا هُوَ** (و کلیدهای غیب نزد اوست، جز او کسی آن‌ها را نمی‌داند). اگرچه آن‌ها در میان ما موجودند، اما نمی‌دانیم که کلیدهای غیب هستند. و اگر با اخبار بدانیم که کلید هستند، غیب را نمی‌دانیم تا با آن‌ها آن را بگشاییم. این مانند کسی است که کلید خانه‌ای را یافته، اما خانه‌ای را که با آن باز می‌شود، نمی‌شناسد. **عالِمُ الْغَيْبِ فَلا يُظْهِرُ عَلى‏ غَيْبِهِ أَحَداً** (دانای غیب است و کسی را بر غیب خود آگاه نمی‌سازد). سپس پس از آنکه تو را به سریان نور در اشیا آگاه ساختم، بدان که خلق میان شقی و سعید است. با سریان نور در همه موجودات، چه کثیف و چه لطیف، چه تاریک و چه غیر تاریک، همه موجودات به وجود صانع خود بدون شک و تردید اقرار کردند. و چون غیب مطلق از آن اوست، ذات او از طریق ثبوت شناخته نمی‌شود، بلکه از آنچه شایسته محدثات است، منزه می‌شود. همان‌طور که غیب می‌داند که غیبی وجود دارد، اما نمی‌داند که در آن چیست و آن چیست. پس وقتی اخبار الهی بر زبان روحانیون وارد شد و آن‌ها آن را به رسولان منتقل کردند و رسولان (علیهم السلام) آن را به ما منتقل کردند، کسی که به آن‌ها ایمان آورد و فکر خود را پشت سر انداخت و آن‌ها را با صفت قبولی که در عقلش است پذیرفت و مخبر را در آنچه آورده، تصدیق کرد، و اگر عمل زائدی بر تصدیق لازم بود، آن را انجام داد، او همان کسی است که به سعید تعبیر می‌شود. و او از کسانی است که **أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ** (گوش فرا داد در حالی که شاهد بود). و پاداش او همان است که به او وعده داده شده از خیر در سرای قرار و نعمت دائمی که به سوی اجل معینی نمی‌رود تا با فرارسیدن اجلش قطع شود، از حیث کلی، حکمی الهی که تبدیل و نقض و نسخ نمی‌شود. و کسی که به آن‌ها ایمان نیاورد و فکر فاسد خود را پیش روی خود قرار داد و از آن پیروی کرد و اخبار نبوی را یا با تکذیب اصل و یا با تأویل فاسد رد کرد، اگر مخبر را در آنچه آورده تکذیب کرد و به مقتضای آنچه به او گفته شده عمل نکرد، اگر عمل زائدی بر تصدیق لازم بود، او همان کسی است که به شقی تعبیر می‌شود. و او از جهت ظلمتی که در اوست، ایمان نیاورد، همان‌طور که سعید از جهت نوری که در اوست، ایمان آورد. و پاداش او همان است که به او وعده داده شده از شر در سرای هلاکت و عدم قرار، به دلیل وجود عذاب دائمی که به سوی اجل معینی نمی‌رود، هرچند در نفس الامر از حیث کلی اجلی دارد، حکمی الهی و عادلانه، همان‌طور که در سعید فضل بود، که تبدیل و نقض و نسخ نمی‌شود. و در این مسئله میان اهل کشف (أهل الکشف) اختلاف است. و این مسئله عظیمی است میان علمای رسوم از مؤمنان و اهل کشف. همچنین میان اهل کشف نیز در این باره اختلاف است که آیا عذاب بر آن‌ها تا بی‌نهایت ادامه می‌یابد یا اینکه در دار شقاوت نعمتی برای آن‌ها خواهد بود و عذاب در آن‌ها به اجل معینی پایان می‌یابد. و در عدم خروج از آن و اینکه تا بی‌نهایت در آنجا ماندگارند، اتفاق نظر دارند. زیرا هر یک از دو سرا پرکننده خود را دارد. و اسباب آلام به ظاهر بر آن‌ها متنوع می‌شود، که چاره‌ای از آن نیست. و آن‌ها در باطن، به دلیل اختلاف پیشین، در آن لذتی می‌یابند، پس از آنکه درد، جزای عقوبت را از آن‌ها می‌گیرد. عبدالله موروری و گروهی دیگر از او، از ابومدین، امام جماعت، برایم نقل کردند که گفت: «اهل دو سرا وارد آن‌ها می‌شوند؛ سعادتمندان به فضل خدا و اهل آتش به عدل خدا. و با اعمال در آن‌ها منزل می‌گیرند و با نیت‌ها در آن‌ها جاودانه می‌شوند.» این کشفی صحیح و کلامی ارزشمند است. پس درد، جزای عقوبت را به اندازه مدت عمر مشرک در دنیا می‌گیرد. وقتی مدت به پایان رسید، نعمتی برای آن‌ها در آتش قرار داده می‌شود، به طوری که اگر وارد بهشت شوند، به دلیل عدم موافقت با مزاجی که خداوند آن‌ها را بر آن سرشته، رنج می‌برند. پس آن‌ها از آنچه در آن هستند، از آتش و زمهریر و نیش مارها و عقرب‌ها، لذت می‌برند، همان‌طور که اهل بهشت از سایه‌ها و نور و بوسیدن حوریان زیبا لذت می‌برند، زیرا مزاج آن‌ها چنین اقتضا می‌کند. آیا نمی‌بینی که سوسک در دنیا بر مزاجی است که از بوی گل سرخ متضرر می‌شود و از بوی گند لذت می‌برد؟ همچنین کسی که بر مزاجی خلق شده است. و در دنیا مزاج‌هایی بر این اساس رخ داده که ما آن‌ها را مشاهده کرده‌ایم. پس هیچ مزاجی در عالم نیست مگر اینکه با آنچه مناسب آن است، لذت می‌برد و با آنچه منافر است، لذت نمی‌برد. آیا نمی‌بینی که فرد گرم‌مزاج از بوی مشک رنج می‌برد؟ پس لذت‌ها تابع ملایم و آلام تابع عدم ملایم است. این امر فی‌نفسه محقق است و هیچ عاقلی آن را انکار نمی‌کند. اما بحث این است که آیا اهل آتش پس از پایان مدت بر این مزاج هستند یا نه؟ یا بر مزاجی هستند که اقتضای احساس درد نسبت به اشیای دردناک را دارد؟ نقل صحیح و صریح و نصّی که در آن اشکالی نیست، اگر مفید علم باشد، بدون شک به آن حکم می‌شود. **فَالله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ** (پس خداوند بر هر چیزی تواناست). اگرچه من در این باره جاهل نیستم، اما افصاح از آن لازم نیست، زیرا افصاح از آن، اختلاف را از عالم برنمی‌دارد. و برخی از اهل کشف گفتند که آن‌ها به بهشت خارج می‌شوند تا هیچ‌کس از مردم در آن باقی نماند و درهای آن باز و بسته شود و در آن تره تیزک بروید. و خداوند اهل دیگری برای آن خلق می‌کند که آن را پر کنند، از مزاج آن، همان‌طور که ماهی را در آب و عالم هوا را در هوا و عالمی را در شکم زمین خلق می‌کند که حیاتشان جز در آنجا نیست، مانند موش کور. اگر بر روی زمین ظاهر شود، می‌میرد. پس غمی که برای ما در آن است، حیات آن‌هاست. ماهی اگر به هوا خارج شود، می‌میرد و غم آن در هواست، پس نور حیاتش در آن خاموش می‌شود. و انسان و حیوان خشکی اگر در آب غرق شود، هلاک می‌شود و غم آن در آب است که نور حیاتش با آن خاموش می‌شود. و حیوان دریایی نیز هست که هم در اینجا و هم در آنجا زندگی می‌کند، مانند تمساح‌ها و انسان آبی و سگ آبی و برخی پرندگان. و همه این‌ها به طبع و مزاجی است که خداوند او را بر آن سرشته است. و ما در این منزل آنچه کفایت می‌کند را ذکر کردیم و اصول آن را به یاری و الهام خدا کامل کردیم. **والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 6
}