{
  "id": 548,
  "title": {
    "ar": "الباب الثامن والأربعون وخمسمائة في معرفة حال قطب كان منزله وهجيره فَاذْكُرُونِي أَذْكُرْكُمْ",
    "en": "Chapter Five Hundred and Forty-Eight: Concerning the knowledge of the state of a Pole (قطب) whose station and refuge was: <<Therefore remember Me, I will remember you>>.",
    "ur": "باب پانچ سو اڑتالیس (۵۴۸) ایک قطب (Qutb) کے حال کی معرفت (Ma'rifah) کے بیان میں جس کا مسکن اور جس کی دائمی مشغولیت یہ تھی: \"فَاذْكُرُونِي أَذْكُرْكُمْ\" (پس تم مجھے یاد کرو، میں تمہیں یاد کروں گا)۔",
    "fa": "باب پانصد و چهل و هشتم در معرفت حال قطبی که منزل و هجیر او این بود: «مرا یاد کنید تا شما را یاد کنم» (فَاذْكُرُونِي أَذْكُرْكُمْ)"
  },
  "content": {
    "ar": "## «الباب الثامن والأربعون وخمسمائة في معرفة حال قطب كان منزله وهجيره فَاذْكُرُونِي أَذْكُرْكُمْ»\n\n\n> من يذكر الله في أحواله أبدا *** يذكره فيها فلا تنفك تذكره‏\n\n\n> فإن ذكرك ذكر الحق ليس سوى *** ما قلته وكذا في الكشف تبصره‏\n\n\n> الحق عين وجود الكون فاعتبروا *** العين تشهده والوهم يحصره‏\n\n\n> والعقل ينفي بحكم الفكر صورته *** والفكر يستره والكشف يظهره‏\n\n\n> والعقل بينهما حارت خواطره *** هذا ينزهه وذا يصوره‏\n\n\n> وليس يدري الذي فيه يقلده *** فالله يرشده والله ينصره‏\n\n\n> إذا رأى العقل ما قلناه فيه رأى *** أمرا عظيما ونورا فيه يبهره‏\n\n\n> وكل ذلك حد والحدود أبت *** فليس شي‏ء من الأشياء يحجره‏\n\n\n### [فإذا كان الذاكر صحيح الذكر فلا بد أن يسمع الله ذكره‏]\n\n\nقال الله تعالى جده وكبرياؤه هُوَ الَّذِي يُصَلِّي فوصف نفسه بالتأخر في الذكر عن ذكر العبد وهنا كان ذكر العبد يعطي في نفس الحق الذكر لعبده كما يعطي السائل الإجابة في الحق ومن هذه الحضرة ظهر تأثير الكون في الوجود الحق فإذا كان الذاكر صحيح الذكر وهو أن يسمع بذكره المذكور وهو صادق في أنه يذكره إذا ذكره عبده فلا بد أن يسمعه ذكره لصدقه في قوله فمن لم يسمع ذكر ربه إياه عند ذكره فيتهم نفسه في ذكره وإنه ما وفى بشرط الذكر الموجب لذكر ربه إياه وهنا سر لا يمكن كشفه من أجل الدعوى وهو أن الله قد أعلمنا بما تذكره من تكبير وتهليل وتسبيح وتقديس وتحميد وتمجيد كل ذلك معلوم مقرر وما أعلمنا بما يذكرنا فإذا ذكره صاحب هذا الذكر ووفى الشرط من الإخلاص والحضور فعلامته أن يسمع ما يذكره به ربه فيعلم ما يذكره به كما أعلمه على لسان الرسول ما يذكر به ربه فإذا لم يعلم ذلك فما هو ذلك الذاكر ولا صاحب هجير فليلزم ما قلناه فإنه لا علامة له على صحة ذكره إلا ما ذكرناه خاصة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 548: Concerning the Knowledge of the State of a Pole (قطب) Whose Station (منزل) and Constant Practice (هجير) Was: \"So remember Me, and I will remember you\"\n\nWhoever remembers Allah perpetually in all his states,\nHe remembers him therein, so you never cease remembering Him.\n\nFor your remembrance is the remembrance of The Real (الحق), nothing other than what you have uttered;\nAnd thus, in the Unveiling (الكشف), you perceive it.\n\nThe Real (الحق) is the very Essence (عين) of the existence (وجود) of the Cosmos (العالم); so reflect!\nThe eye witnesses Him, while delusion (الوهم) confines Him.\n\nAnd the Intellect (العقل), by the judgment of thought (الفكر), negates His form;\nThought conceals Him, but Unveiling (الكشف) manifests Him.\n\nAnd the Intellect (العقل) is bewildered between the two, its thoughts confused:\nThis one declares Him transcendent (تنزه), and that one gives Him form (تصور).\n\nAnd he does not know which path he should follow;\nSo Allah guides him, and Allah grants him victory.\n\nIf the Intellect (العقل) perceives what we have said concerning Him,\nIt perceives a tremendous matter and a light that overwhelms it.\n\nAnd all of that is a limit (حد), and the limits refuse;\nThus, nothing among the things can confine Him.\n\n### [If the one remembering (الذاكر) possesses sound remembrance (صحيح الذكر), he must necessarily hear Allah’s remembrance of him.]\n\nAllah, exalted is His Majesty and Grandeur, said: <<هُوَ الَّذِي يُصَلِّي>> (It is He who confers blessing). Thus, He described Himself as being subsequent in remembrance (الذكر) to the servant's remembrance. And here, the servant's remembrance gives rise, in the very Essence (نفس) of The Real (الحق), to the remembrance of His servant, just as the petitioner gives rise to the answer in The Real. And from this Divine Presence (الحضرة) appeared the influence of the Cosmos (الكون) upon the True Existence (الوجود الحق).\n\nIf the one remembering (الذاكر) possesses sound remembrance (صحيح الذكر)—which means that he hears the One Remembered (المذكور) remembering him—and since He (Allah) is truthful in that He remembers him when His servant remembers Him, then the servant must necessarily hear His remembrance of him, due to His truthfulness in His saying. So whoever does not hear his Lord’s remembrance of him when he remembers Him should accuse himself regarding his remembrance, concluding that he has not fulfilled the condition of remembrance (الذكر) that necessitates his Lord’s remembrance of him.\n\nAnd here is a secret that cannot be unveiled due to the claim (of knowledge): Allah has indeed informed us of what we should remember Him with—such as *Takbir* (magnification), *Tahlil* (declaration of oneness), *Tasbih* (glorification), *Taqdis* (sanctification), *Tahmid* (praise), and *Tamjid* (exaltation)—all of which is known and established. But He has not informed us of what He remembers us with.\n\nSo if the possessor of this remembrance remembers Him and fulfills the condition of sincerity (الإخلاص) and presence (الحضور), his sign is that he hears what his Lord remembers him with, thereby knowing what He remembers him with, just as He informed him, through the tongue of the Messenger, of what he should remember his Lord with. If he does not know that, then he is neither that true rememberer (الذاكر) nor the possessor of constant practice (هجير). Therefore, let him adhere to what we have stated, for he has no sign of the soundness of his remembrance except specifically what we have mentioned. And Allah <<يَقُولُ الْحَقَّ>> (speaks the Truth) and <<وَهُوَ يَهْدِي السَّبِيلَ>> (He guides to the way).",
    "ur": "باب پانچ سو اڑتالیس: ایک قطب کے حال کی معرفت میں جس کا مسکن اور دائمی وظیفہ یہ تھا: \"تم مجھے یاد کرو، میں تمہیں یاد کروں گا\" (فَاذْكُرُونِي أَذْكُرْكُمْ)۔\n\nجو شخص اپنے تمام احوال میں ہمیشہ اللہ کا ذکر کرتا ہے،\nوہ (اللہ) بھی ان احوال میں اس کا ذکر کرتا ہے، پس تو ہمیشہ اس کا ذکر کرتا رہے گا۔\n\nپس تیرا ذکر، ذات حق (الحق) کا ہی ذکر ہے، اس کے سوا کچھ نہیں\nجو تو نے کہا، اور اسی طرح تو اسے کشف (الکشف) میں دیکھتا ہے۔\n\nذات حق (الحق) ہی کائنات کی ہستی (الوجود) کی عین (حقیقت) ہے، پس غور کرو۔\nعین (حقیقت) اس کا شہود (الشہود) کرتی ہے، اور وہم (الوہم) اسے محدود کرتا ہے۔\n\nاور عقل (العقل) فکر کے حکم سے اس کی صورت کی نفی کرتی ہے،\nاور فکر اسے چھپاتی ہے، اور کشف (الکشف) اسے ظاہر کرتا ہے۔\n\nاور عقل ان دونوں کے درمیان ہے، اس کے خیالات حیران ہیں،\nیہ (فکر) اسے تنزیہہ دیتا ہے اور وہ (وہم) اسے صورت دیتا ہے۔\n\nاور وہ نہیں جانتا کہ کس میں اس کی تقلید کرے،\nپس اللہ ہی اسے ہدایت دیتا ہے اور اللہ ہی اس کی مدد کرتا ہے۔\n\nجب عقل اس میں وہ دیکھتی ہے جو ہم نے کہا، تو وہ\nایک عظیم امر اور ایک نور دیکھتی ہے جو اسے خیرہ کر دیتا ہے۔\n\nاور یہ سب کچھ حد ہے، اور حدود نے انکار کر دیا ہے،\nپس کوئی بھی شے اسے محدود نہیں کر سکتی۔\n\n### [پس جب ذاکر کا ذکر صحیح ہو تو ضروری ہے کہ اللہ اس کا ذکر سنے]\n\nاللہ تعالیٰ، جس کی عظمت اور کبریائی ہے، نے فرمایا: \"وہی ہے جو درود بھیجتا ہے\" (هُوَ الَّذِي يُصَلِّي)۔ پس اس نے اپنے آپ کو بندے کے ذکر کے مقابلے میں ذکر میں تاخیر سے متصف کیا۔ اور یہاں بندے کا ذکر، ذات حق (الحق) کے نفس میں اپنے بندے کے لیے ذکر عطا کرتا ہے، جیسا کہ سائل ذات حق (الحق) میں جواب عطا کرتا ہے۔ اور اسی حضور سے ہستی حق (الوجود الحق) میں کائنات کا اثر ظاہر ہوا۔\n\nپس جب ذاکر کا ذکر صحیح ہو، اور وہ یہ ہے کہ وہ اپنے ذکر کے ذریعے مذکور (اللہ) کو سنے، اور وہ (اللہ) اس بات میں سچا ہے کہ جب اس کا بندہ اسے یاد کرتا ہے تو وہ اسے یاد کرتا ہے، لہٰذا اس کے لیے ضروری ہے کہ وہ (اللہ) اپنے قول میں سچا ہونے کی وجہ سے اس (بندے) کا ذکر سنے۔ پس جو شخص اپنے ذکر کے وقت اپنے رب کا اپنے لیے کیا گیا ذکر نہ سنے، تو وہ اپنے ذکر میں خود پر الزام لگائے، اور یہ کہ اس نے ذکر کی اس شرط کو پورا نہیں کیا جو اس کے رب کے ذکر کو اس کے لیے واجب کرتی ہے۔\n\nاور یہاں ایک راز ہے جس کا دعوے کی وجہ سے کشف (الکشف) ممکن نہیں۔ اور وہ یہ ہے کہ اللہ نے ہمیں اس چیز سے آگاہ کیا ہے جس کے ذریعے ہم اسے یاد کرتے ہیں، جیسے تکبیر، تہلیل، تسبیح، تقدیس، تحمید، اور تمجید۔ یہ سب معلوم اور مقرر ہے۔ لیکن اس نے ہمیں اس چیز سے آگاہ نہیں کیا جس کے ذریعے وہ ہمیں یاد کرتا ہے۔\n\nپس جب اس ذکر کا حامل اسے یاد کرے اور اخلاص اور حضور کی شرط پوری کرے، تو اس کی علامت یہ ہے کہ وہ سنے جو اس کا رب اسے یاد کرتا ہے، پس وہ جان لے کہ وہ اسے کس چیز سے یاد کرتا ہے، جیسا کہ اس نے رسول کی زبان پر اسے آگاہ کیا کہ وہ اپنے رب کو کس چیز سے یاد کرے۔ پس اگر وہ یہ نہ جان پائے تو وہ نہ تو وہ ذاکر ہے اور نہ ہی صاحبِ دائمی وظیفہ (ہجیر)۔ پس اسے چاہیے کہ جو ہم نے کہا ہے اس پر قائم رہے، کیونکہ اس کے ذکر کی صحت کی کوئی علامت نہیں سوائے اس کے جو ہم نے خاص طور پر ذکر کی ہے۔ اور اللہ حق (الحق) فرماتا ہے اور وہی سیدھے راستے کی طرف ہدایت دیتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و چهل و هشتم در معرفت حال قطبی که منزل و ورد (ذکر دائمی) او این بود: «مرا یاد کنید تا شما را یاد کنم» (فَاذْكُرُونِي أَذْكُرْكُمْ).\n\nهر کس خدا را در همه احوالش پیوسته یاد کند،\nاو (خدا) نیز وی را در آن احوال یاد می‌کند، پس هرگز از یاد او جدا نمی‌شوی.\n\nزیرا ذکر تو، ذکر حق (الحق) است و جز این نیست\nآنچه گفتم، و همچنین در کشف (الکشف) آن را می‌بینی.\n\nحق (الحق) عین هستی (الوجود) کائنات است، پس عبرت بگیرید؛\nچشم (بصیرت) او را شهود (الشهود) می‌کند و وهم او را محدود می‌سازد.\n\nو عقل به حکم تفکر، صورت او را نفی می‌کند،\nو فکر او را می‌پوشاند، و کشف (الکشف) او را آشکار می‌سازد.\n\nو عقل میان آن دو (فکر و کشف) خواطرش حیران است؛\nاین (کشف) او را تنزیه می‌کند و آن (فکر) او را صورت می‌بخشد.\n\nو نمی‌داند که در چه چیزی از آن تقلید کند؛\nپس خداوند او را هدایت می‌کند و خداوند او را یاری می‌رساند.\n\nهنگامی که عقل آنچه را که درباره‌اش گفتیم ببیند،\nامری عظیم و نوری را می‌بیند که او را خیره می‌سازد.\n\nو همه اینها حد و مرز است، و حدود ابا دارند (از محدود کردن حق)؛\nپس هیچ چیز از اشیاء نمی‌تواند او را محصور سازد.\n\n***\n\n[پس اگر ذاکر، ذکرش صحیح باشد، ناگزیر باید بشنود که خداوند او را یاد می‌کند.]\n\nخداوند که جلال و کبریایی‌اش والاست، فرمود: «اوست که درود می‌فرستد» (هُوَ الَّذِي يُصَلِّي). پس خود را به تأخیر در ذکر نسبت به ذکر بنده وصف کرد. و در اینجا، ذکر بنده در ذات حق (الحق)، ذکر بنده را به او عطا می‌کند، همان‌گونه که درخواست‌کننده، اجابت را در حق دریافت می‌کند. و از این حضرت (حضور الهی) است که تأثیر کائنات در هستی حق (الوجود الحق) آشکار شد.\n\nپس اگر ذاکر، ذکرش صحیح باشد، و آن این است که با ذکرش، مذکور (خداوند) را بشنود، و او (خداوند) در اینکه بنده را هنگامی که بنده او را یاد می‌کند، یاد می‌کند، صادق است؛ پس ناگزیر باید ذکر خود را به او بشنواند، به دلیل صدقش در قول. پس هر کس هنگام ذکرش، یاد پروردگارش را نسبت به خود نشنود، باید خود را در ذکرش متهم سازد و بداند که شرط ذکری را که موجب یاد پروردگارش نسبت به او می‌شود، به جا نیاورده است.\n\nو در اینجا رازی است که به دلیل ادعا (ی مدعیان)، کشف (الکشف) آن ممکن نیست، و آن این است که خداوند ما را به آنچه یاد می‌کنیم، از تکبیر و تهلیل و تسبیح و تقدیس و تحمید و تمجید، آگاه ساخته است؛ همه اینها معلوم و مقرر است. اما ما را به آنچه او ما را یاد می‌کند، آگاه نساخته است.\n\nپس هنگامی که صاحب این ذکر، او (خداوند) را یاد کند و شرط اخلاص و حضور را به جا آورد، نشانه آن این است که بشنود پروردگارش او را به چه چیزی یاد می‌کند، و بداند که او را به چه چیزی یاد می‌کند، همان‌گونه که بر زبان رسول، آنچه را که بنده پروردگارش را به آن یاد می‌کند، به او آموخت.\n\nپس اگر این را نداند، او آن ذاکر و صاحب ورد (ذکر دائمی) نیست. پس باید به آنچه گفتیم پایبند باشد، زیرا هیچ نشانه‌ای برای صحت ذکر او جز آنچه به طور خاص ذکر کردیم، وجود ندارد. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 1
}