{
  "id": 137,
  "title": {
    "ar": "الباب السابع والثلاثون ومائة في معرفة مقام ترك الصدق وأسراره",
    "en": "Chapter One Hundred and Thirty-Seven: On the knowledge of the station (مقام) of abandoning truthfulness (الصدق) and its secrets.",
    "ur": "ایک سو سینتیسواں باب: مقام ترک الصدق (مقام ترك الصدق) کی معرفت اور اس کے اسرار میں۔",
    "fa": "باب صد و سی و هفتم در معرفت مقام ترک صدق و اسرار آن"
  },
  "content": {
    "ar": "## (الباب السابع والثلاثون ومائة في معرفة مقام ترك الصدق وأسراره)\n\n\n> الصدق يخرج عن ضعف العبودة إذ *** هو الصدوق الشديد القهر للنفس‏\n\n\n> وكل ما حال بين العبد في طبق *** وضعفه فاتركنه خيفة اللبس‏\n\n\n> إذ ليس يقهر إلا من يماثله *** ولا يماثله شخص من الإنس‏\n\n\n> وهو الأتم وجودا من مغايره *** وكل غير ففي قيد وفي حبس‏\n\n\n> فإنه أحد وخلقه عدد *** والفصل ليس له حكم بلا جنس‏\n\n\n### [الصدق يطلب المماثلة لذلك أنف رجال الله من الاتصاف به‏]\n\n\nلما كان الصدق يطلب المماثلة وإن كان محمودا فرجال الله أنفوا من الاتصاف به مع حكمه فيهم وظهور أثره عليهم غير أنه ليس مشهودا لهم ثم نظروا إليه من كونه نعتا إلهيا فلم يجدوا له عينا هناك ورأوا تعلق الصدق الإلهي إنما هو فيما وعد لا في كل ما أوعد ومن شرط النعت الإلهي عدم التقييد فيما هو متعلق له فعلموا أنه نعت إضافي لاختصاصه ببعض متعلقاته فلما رأوه على هذا أوجبوا ترك مشاهدته فإنهم كالناظرين في أمر معدوم لا وجود له‏\n\n\n### [درجات الصدق في العارفين وفي الملامية]\n\n\nوالصدق وإن كان نسبة وليست له عين موجودة فله درجات فدرجاته في العارفين من أهل الأسرار مائة وخمس وتسعون درجة وفي العارفين من أهل الأنوار مائتان وخمس وعشرون وفي الملامية من أهل الأسرار مائة وأربع وستون درجة وفي الملامية من أهل الأنوار مائة وأربع وتسعون درجة\n\n\n### [ترك المثبت هو ترك شهوده لا ترك وجوده‏]\n\n\nوأنا أعطيك أصلا مطردا في كل ما أذكره من ترك كل ما نثبته إنما أريد بذلك ترك شهوده لا ترك أثره فإن حكمه لا يتمكن أن يقول فيه ليس فإنه موجود مشهود لكل عين فعلى هذا تأخذ كل ما أذكره في هذا الكتاب من التروك فاعلم ذلك‏\n\n",
    "en": "## Chapter One Hundred and Thirty-Seven: Concerning Knowledge of the Station of Abandoning Truthfulness and its Secrets\n\nTruthfulness departs from the weakness of servanthood, since\nHe is the Truthful One, severe in conquering the soul.\n\nAnd everything that intervenes between the servant in his state\nAnd his weakness, abandon it for fear of confusion.\n\nSince none conquers save one who resembles Him,\nAnd no person among mankind resembles Him.\n\nAnd He is the most complete in Being (وجودا) than what differs from Him,\nAnd every other is in a bond and in a prison.\n\nFor He is One (أحد) and His creation is number (عدد),\nAnd distinction has no ruling without a genus.\n\n### [Truthfulness (الصدق) demands resemblance, therefore the Men of Allah disdained being characterized by it]\n\nSince Truthfulness (الصدق) demands resemblance, even though it is praiseworthy, the Men of Allah disdained being characterized by it, despite its ruling being present in them and its effect appearing upon them; yet it is not witnessed by them.\n\nThen they looked at it from the perspective of its being a Divine Attribute (نعتا إلهيا), but they did not find an essence (عينا) for it there. They saw that the connection of Divine Truthfulness (الصدق الإلهي) is only in what He promised, not in everything He threatened. A condition of the Divine Attribute is the absence of restriction in what it relates to. Thus, they knew that it is a relative attribute (نعت إضافي) due to its specialization in some of its related matters. When they saw it thus, they made the abandonment of witnessing it (ترك مشاهدته) obligatory, for they are like those looking at a non-existent matter that has no Being (وجود).\n\n### [The degrees of Truthfulness (الصدق) among the Gnostics (العارفين) and the People of Blame (الملامية)]\n\nAlthough Truthfulness is a relation (نسبة) and does not have an existent essence (عين موجودة), it has degrees. Its degrees among the Gnostics (العارفين) who are the People of Secrets (أهل الأسرار) are one hundred and ninety-five degrees. Among the Gnostics who are the People of Lights (أهل الأنوار) are two hundred and twenty-five. Among the People of Blame (الملامية) who are the People of Secrets are one hundred and sixty-four degrees. And among the People of Blame who are the People of Lights are one hundred and ninety-four degrees.\n\n### [The abandonment of what is affirmed (المثبت) is the abandonment of witnessing it (شهوده), not the abandonment of its existence (وجوده)]\n\nI shall give you a consistent principle regarding everything I mention concerning the abandonment (ترك) of everything we affirm (نثبته): I only mean by that the abandonment of witnessing it (ترك شهوده), not the abandonment of its effect (أثره). For its ruling cannot be denied by saying 'it is not,' since it is existent and witnessed by every essence (عين). Therefore, upon this basis, you should understand everything I mention in this book concerning abandonments (التروك). Know this.",
    "ur": "(باب ایک سو سینتیس: صدق (الصدق) کے ترک کے مقام اور اس کے اسرار کی معرفت میں)\n\nصدق بندگی (العبودة) کی کمزوری سے نکل جاتا ہے، کیونکہ *** وہ (ذات حق) ہی صدوق ہے، نفس (النفس) پر شدید قہر کرنے والا ہے۔\n\nاور ہر وہ چیز جو بندے اور اس کے مقام میں اس کی کمزوری کے درمیان حائل ہو، *** اسے ترک کر دو، التباس کے خوف سے۔\n\nکیونکہ وہ صرف اسی پر قہر کرتا ہے جو اس کی مماثلت رکھتا ہو، *** اور انسانوں میں سے کوئی شخص اس کی مماثلت نہیں رکھتا۔\n\nاور وہ اپنے غیر سے وجود (الوجود) میں اتم (کامل تر) ہے، *** اور ہر غیر قید اور حبس میں ہے۔\n\nپس وہ احد (أحد) ہے اور اس کی مخلوق عدد ہے، *** اور فصل (امتیاز) کا حکم جنس (الجنس) کے بغیر نہیں ہوتا۔\n\n[صدق (الصدق) مماثلت کا تقاضا کرتا ہے، اسی لیے رجال اللہ نے اس سے متصف ہونے سے گریز کیا]\n\nچونکہ صدق (الصدق) مماثلت کا تقاضا کرتا ہے، اگرچہ وہ محمود ہے، اس لیے رجال اللہ نے اس سے متصف ہونے سے گریز کیا، باوجود اس کے کہ اس کا حکم ان میں جاری ہوتا ہے اور اس کا اثر ان پر ظاہر ہوتا ہے، مگر وہ ان کے لیے مشہود (الشهود) نہیں ہوتا۔ پھر انہوں نے اسے صفت الٰہی (النعت الإلهي) ہونے کے پہلو سے دیکھا تو وہاں اس کی کوئی عین (حقیقت) نہ پائی۔ اور انہوں نے دیکھا کہ صدق الٰہی کا تعلق صرف اس چیز سے ہے جس کا اس نے وعدہ کیا ہے، نہ کہ ہر اس چیز سے جس کی اس نے وعید سنائی ہے۔ اور صفت الٰہی کی شرط یہ ہے کہ اس کے متعلق میں کوئی تقیید نہ ہو۔ پس انہوں نے جان لیا کہ یہ ایک اضافی صفت (نعت إضافي) ہے کیونکہ یہ اپنے بعض متعلقات کے ساتھ خاص ہے۔ جب انہوں نے اسے اس طرح دیکھا تو اس کے مشاہدے (الشهود) کو ترک کرنا واجب قرار دیا، کیونکہ وہ ایسے ہیں جیسے کسی معدوم چیز کو دیکھ رہے ہوں جس کا کوئی وجود (الوجود) نہ ہو۔\n\n[عارفین (العارفين) اور ملامیہ (الملامية) میں صدق (الصدق) کے درجات]\n\nاور صدق (الصدق)، اگرچہ وہ ایک نسبت ہے اور اس کی کوئی موجود عین (حقیقت) نہیں ہے، لیکن اس کے درجات ہیں۔ پس اسرار (الأسرار) کے حامل عارفین (العارفين) میں اس کے درجات ایک سو پچانوے (۱۹۵) ہیں، اور انوار (الأنوار) کے حامل عارفین میں دو سو پچیس (۲۲۵) ہیں۔ اور اسرار کے حامل ملامیہ (الملامية) میں ایک سو چونسٹھ (۱۶۴) درجات ہیں، اور انوار کے حامل ملامیہ میں ایک سو چورانوے (۱۹۴) درجات ہیں۔\n\n[جس چیز کو ہم ثابت کرتے ہیں اس کا ترک، اس کے شہود (الشهود) کا ترک ہے نہ کہ اس کے وجود (الوجود) کا ترک]\n\nاور میں تمہیں ایک ایسا کلی اصول دیتا ہوں جو ہر اس چیز میں جاری ہوگا جس کا میں ذکر کروں گا: ہر اس چیز کا ترک جسے ہم ثابت کرتے ہیں، اس سے میری مراد صرف اس کے شہود (الشهود) کا ترک ہے نہ کہ اس کے اثر کا ترک۔ کیونکہ اس کے حکم میں یہ کہنا ممکن نہیں کہ وہ نہیں ہے، اس لیے کہ وہ ہر عین کے لیے موجود اور مشہود ہے۔ پس تم اس کتاب میں میرے ذکر کردہ تمام تروک (ترک کی گئی چیزوں) کو اسی اصول پر سمجھو۔ پس یہ جان لو۔",
    "fa": "(باب صد و سی و هفتم در معرفت مقام ترک صدق و اسرار آن)\n\nصدق از ضعف عبودیت خارج می‌شود، زیرا او (حق) خود صدوقی است که نفس را به شدت مقهور می‌سازد.\n\nو هر آنچه میان بنده در مرتبه و ضعف او حائل شود، آن را به جهت ترس از اشتباه (لبس) رها کن.\n\nزیرا کسی مقهور نمی‌شود مگر آنکه شبیه او باشد، و هیچ فردی از انسان‌ها شبیه او نیست.\n\nو او (حق) از نظر هستی (الوجود) کامل‌تر از هر مغایری است، و هر غیری در بند و زندان است.\n\nزیرا او احد است و خلق او عدد (کثرت) است، و فصل (جدایی) بدون جنس (نوع) حکمی ندارد.\n\n[صدق طلب مماثلت می‌کند، از این رو مردان خدا از متصف شدن به آن ابا کردند]\n\nاز آنجا که صدق طلب مماثلت می‌کند، اگرچه ستوده است، اما مردان خدا از متصف شدن به آن ابا کردند، با وجود اینکه حکم آن در ایشان جاری است و اثرش بر آنان ظاهر می‌شود، جز اینکه برایشان مشهود نیست. سپس به آن از حیث اینکه نعت (صفت) الهی است نگریستند، اما در آنجا (در ذات حق) برای آن عینی نیافتند. و دیدند که تعلق صدق الهی تنها به وعده‌های اوست، نه به هر آنچه وعید داده است. و از شرط نعت الهی، عدم تقیید در متعلقات آن است. پس دانستند که صدق، نعت (صفت) اضافی است، زیرا به برخی از متعلقاتش اختصاص دارد. چون آن را بر این وجه دیدند، ترک مشاهده آن را واجب شمردند، زیرا آنان مانند کسانی هستند که در امری معدوم که وجودی ندارد، می‌نگرند.\n\n[درجات صدق در عارفان و ملامتیان]\n\nو صدق، اگرچه نسبتی است و عین موجودی ندارد، اما دارای درجاتی است. درجات آن در عارفان از اهل اسرار، صد و نود و پنج درجه است؛ و در عارفان از اهل انوار، دویست و بیست و پنج درجه؛ و در ملامیه (الملامية) از اهل اسرار، صد و شصت و چهار درجه؛ و در ملامیه (الملامية) از اهل انوار، صد و نود و چهار درجه است.\n\n[ترک آنچه اثبات شده، ترک شهود آن است نه ترک وجود آن]\n\nو من اصلی کلی (مُطَّرِد) را در مورد هر آنچه از ترک آنچه اثباتش می‌کنیم ذکر می‌کنم، به تو می‌دهم: مقصودم از آن، ترک شهود (الشهود) آن است نه ترک اثرش. زیرا حکم آن نمی‌تواند بگوید که «نیست»، چرا که آن برای هر چشمی موجود و مشهود است. پس بر این اساس، هر آنچه را که در این کتاب از تروک (ترک‌ها/رها کردن‌ها) ذکر می‌کنم، بپذیر. این را بدان."
  },
  "page_count": 1
}