{
  "id": 132,
  "title": {
    "ar": "الباب الثاني والثلاثون ومائة في معرفة مقام الاستقامة",
    "en": "Chapter One Hundred and Thirty-Two: Concerning the Knowledge (معرفة) of the Station (مقام) of Rectitude (الاستقامة)",
    "ur": "باب ایک سو بتیسواں: مقام استقامت کی معرفت میں",
    "fa": "باب صد و سی و دوم در معرفت مقام استقامت"
  },
  "content": {
    "ar": "## (الباب الثاني والثلاثون ومائة في معرفة مقام الاستقامة)\n\n\n> للمستقيم ولاية مخصوصة *** شملت جميع الكون في تخصيصها\n\n\n> للمستقيم تنزلت أرواحه *** بالطيب المكنون في تنصيصها\n\n\n> الاستقامة نزلت أربابها *** منها منازل لم تنل بخصوصها\n\n\n> هي نعته سبحانه في قصة *** قد قالها فانظره في منصوصها\n\n\n### [لزوم ما لا يلزم من غير قصد إلى ذلك‏]\n\n\nجاءت هذه الأبيات لزوم ما لا يلزم من غير قصد وكذلك أمثالها فإنما أنطق بما يجريه الله فينا من غير تعمل ولا روية\n### [ما ثم إلا من هو مستقيم لأنه ما ثم إلا من هو الحق آخذ بناصيته‏]\n\n\nاعلم وفقك الله أن الله أخبر عن نبيه ورسوله عليه السلام في كتابه أنه قال إِنَّ رَبِّي عَلى‏ صِراطٍ مُسْتَقِيمٍ فوصف نفسه بأنه على صراط مستقيم وما خطأ هذا الرسول في هذا القول ثم إنه ما قال ذلك إلا بعد قوله ما من دَابَّةٍ إِلَّا هُوَ آخِذٌ بِناصِيَتِها فما ثم إلا من هو مستقيم على الحقيقة على صراط الرب لأنه ما ثم إلا من الحق آخذ بناصيته ولا يمكن إزالة ناصيته من يد سيده وهو على صراط مستقيم ونكر لفظ دابة فعم فأين المعوج حتى تعدل عنه فهذا جبر وهذه استقامة فالله يوفقنا لإنزال كل حكمة في موضعها فهنالك تظهر عناية الله بعبده‏\n\n\n### [الشرعة المجعولة والمنهاج المرسوم‏]\n\n\nلِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً وهي أحكام الطريقة التي في قوله ومِنْهاجاً فكلها مجعولة بجعل الله فمن مشى في غير طريقه التي عين الله له المشي عليها فقد حاد عن سواء السبيل التي عين الله له المشي عليها كما أن ذلك الآخر لو ترك سبيله التي شرع الله له المشي عليها وسلك سبيل هذا سميناه حائدا عن سبيل الله والكل بالنسبة إلى واحد واحد على صراط مستقيم فيما شرع له‏\n\n\n### [الشريعة الاسلامية والشرائع النبوية والنواميس الحكمية]\n\n\nولهذا خط رسول الله صَلَّى اللهُ عَليهِ وسَلَّم خطا وخط عن جنبتي ذلك الخط خطوطا فكان ذلك الخط شرعه ومنهاجه الذي بعث به وقيل له قل لأمتك تسلك عليه ولا تعدل عنه وكانت تلك الخطوط شرائع الأنبياء التي تقدمته والنواميس الحكمية الموضوعة ثم وضع يده على الخط وتلا وأَنَّ هذا صِراطِي مُسْتَقِيماً فأضافه إليه ولم يقل صراط الله ووصفه بالاستقامة وما تعرض لنعت تلك الخطوط بل سكت عنها ثم قال فَاتَّبِعُوهُ الضمير يعود على صراطه ولا تَتَّبِعُوا السُّبُلَ يعني شرائع من تقدمه ومناهجهم من حيث ما هي شرائع لهم إلا إن وجد حكم منها في شرعي فاتبعوه من حيث ما هو شرع لنا لا من حيث ما كان شرعا لهم فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ يعني تلك الشرائع عن سبيله أي عن طريقه الذي جاء به محمد صَلَّى اللهُ عَليهِ وسَلَّم ولم يقل عن سبيل الله لأن الكل سبيل الله إذ كان الله غايتها ذلِكُمْ وَصَّاكُمْ به لَعَلَّكُمْ تَتَّقُونَ أي تتخذون تلك السبيل وقاية تحول بينكم وبين المشي على غيره من السبل‏\n\n\n### [الملائكة أولياء المستقيمين في الحياة الدنيا وفي الآخرة]\n\n\nوهو قوله إِنَّ الَّذِينَ قالُوا من أي شرع كان إذا كان له الزمان والوقت رَبُّنَا الله ثُمَّ اسْتَقامُوا على طريقهم التي شرع الله لهم المشي عليها تَتَنَزَّلُ عَلَيْهِمُ الْمَلائِكَةُ وهذا التنزل هو النبوة العامة لا نبوة التشريع تتنزل عليهم بالبشر أَلَّا تَخافُوا ولا تَحْزَنُوا فإنكم في طريق الاستقامة ثم قالوا لهم هؤلاء المبشرون من الملائكة نَحْنُ أَوْلِياؤُكُمْ في الْحَياةِ الدُّنْيا أي نحن كنا ننصركم في الحياة الدنيا في الوقت الذي كان الشيطان يلقي إليكم بلمته العدول عن الصراط الذي شرع لكم المشي عليه فكنا ننصركم عليه باللمة التي كنتم تجدونها في وقت التردد بين الخاطرين هل يفعل أو لا يفعل نحن كنا الذين نلقي إليكم ذلك في مقابلة إلقاء العدو فنحن أيضا أولياؤكم في الآخرة بالشهادة لكم إنكم كنتم تأخذون بلمتنا وتدفعون بها عدوكم فهذه ولايتهم في الآخرة وولايتهم أيضا بالشفاعة فيهم فيما غلب عليهم الشيطان في لمته فيكون العبد من أهل التخليط فتشفع الملائكة فيه حتى لا يؤاخذ بعمل الشيطان فهذا معنى قوله وفي الْآخِرَةِ ولَكُمْ فِيها ما تَشْتَهِي أَنْفُسُكُمْ من شهادتنا لها وشفاعتنا فيها في هذا الموطن ولَكُمْ (فِيها) ما تَدَّعُونَ من الدعة نُزُلًا من غَفُورٍ رَحِيمٍ بشهادتنا وشفاعتنا حيث قبلها فأسعدكم الله بها فستركم في كنفه وأدخلكم في رحمته هذا معنى الاستقامة المتعلقة بالنجاة\n\n\n### [الاستقامة التي تطلبها حكمة الله السارية في الكون‏]\n\n\nوأما الاستقامة التي تطلبها حكمة الله فهي السارية في كل كون قال تعالى مصدقا لموسى عليه السلام أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ فكل شي‏ء في استقامة حاصلة فاستقامة النبات أن تكون حركته منكوسة واستقامة الحيوان أن تكون حركته أفقية وإن لم يكن كذلك لم ينتفع بواحد منهما لأن حركة النبات إن لم تكن منكوسة حتى يشرب الماء بأصولها لم تعط منفعة إذ لا قوة له إلا كذلك وكذلك الحيوان لو كانت حركته إلى العلو وقام على رجلين مثلنا لم يعط فائدة الركوب وحمل الأثقال على ظهره ولا حصلت به المنفعة التي تقع بالحركة الأفقية فاستقامته ما خلق له فهي الحركة المعتبرة التي تقع بها المنفعة المطلوبة وإلا فالنبات والحيوان لهما حركة إلى العلو وهو قوله والنَّخْلَ باسِقاتٍ فلو لا الحركة ما نما علوا وإنما غلبنا عليه الحركة المنكوسة للمنفعة المطلوبة فافهم ذلك‏\n\n\n### [الحركة في الوسط ومن الوسط وإلى الوسط]\n\n\nفإن المتكلمين في هذا الفن ما حرر والكلام في حقيقة هذه الحركات فالحركة في الوسط مستقيمة لأنها أعطت حقيقتها كحركة الأرض وحركة الكرة والحركة من الوسط حركة العروج والحركة إلى الوسط حركة النزول فحركة النزول ملكية وإلهية وحركة العروج حركة بشرية وكلها مستقيمة فما ثم إلا استقامة لا سبيل إلى المخالفة فإن المخالفة\nتشاجر أ لا ترى أنه ما وقع التحجير على آدم إلا في الشجرة أي لا تقرب التشاجر وألزم طريقة إنسانيتك وما تستحقه واترك الملك وما يستحقه والحيوان وما يستحقه وكل ما سواك وما يستحقه ولا تزاحم أحدا في حقيقته فإن المزاحمة تشاجر وخلاف ولهذا لما قرب من الشجرة خالف نهي ربه فكان مشاجرا فذهبت عنه في تلك الحال السعادة العاجلة في الوقت وما ذهبت عنه استقامة التشاجر فإنه وفاها حقها بمخالفة النهي الإلهي‏\n\n\n### [اعوجاج القوس هو استقامته لما أريد له‏]\n\n\nاعوجاج القوس استقامته لما أريد له فما في الكون إلا استقامة فإن موجدة وهو الله تعالى على صراط مستقيم من كونه ربا فإن دخلت السبل بعضها على بعض واختلطت فما خرجت عن الاستقامة استقامة الأخلاط واستقامة ما وجدت له فهي في الاستقامة المطلقة التي لها الحكم في كل كون وهي قوله وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ ... وهُوَ عَلى‏ صِراطٍ مُسْتَقِيمٍ ... فَاعْبُدْهُ أي تذلل له في كل صراط يقيمك فيه لا نتذلل لغيره فإن غيره عدم ومن قصد العدم لم تظفر يداه بشي‏ء ثم إنه جاء بضمير الغائب في قوله فَاعْبُدْهُ أي لا تقل أنت المدرك فإن الأبصار لا تدركه إذ لو أدرك الغيب ما كان غيبا فاعبد ذاتا منزهة مجهولة لا تعرف منها سوى نسبتك إليها بالافتقار ولهذا تمم فقال وتَوَكَّلْ عَلَيْهِ أي اعتمد عليه وما رَبُّكَ بِغافِلٍ عَمَّا تَعْمَلُونَ قطع بهذا ظهر المدعين في هذا المقام إذا لم يكن صفتهم ولا حالهم ولا وصل إليهم علمه فالاستقامة سارية في جميع الأعيان من جواهر وأعراض وأحوال وأقوال كما قال وأَقْوَمُ قِيلًا وهي نعت إلهي وكوني جعلنا الله ممن لم يعدل عن استقامته إلا باستقامته آمين بعزته‏\n\n\n### [الاستقامة بلسان عامة أهل الله‏]\n\n\nوأما الاستقامة بلسان عامة أهل الله فهي أن تقول الاستقامة عامة في الكون كما قررنا فما ثم طريق إلا وهو مستقيم لأنه ما ثم طريق إلا وهو موصل إلى الله ولكن قال الله تعالى لنبيه ولنا فَاسْتَقِمْ كَما أُمِرْتَ لم يخاطبه بالاستقامة المطلقة فإنه قد تقرر أن إِلَى الله تَصِيرُ الْأُمُورُ وأنه غاية كل طريق ولكن الشأن إلى أي اسم تصل وتصير من الأسماء الإلهية فينفذ في الواصل إليه أثر ذلك الاسم من سعادة ونعيم أو شقاوة وعذاب فمعنى الاستقامة الحركات والسكنات على الطريقة المشروعة\n\n\n### [الصراط المستقيم رأسه منازله أحواله أحكامه‏]\n\n\nوالصراط المستقيم هو الشرع الإلهي والايمان بالله رأس هذا الطريق وشعب الايمان منازل هذا الطريق التي بين أوله وغايته وما بين المنزلين أحواله وأحكامه ولما كان الصراط المستقيم مما تنزلت به الملائكة المعبر عنها بالأرواح العلوية وهي الرسل من الله إلى المصطفين من عباده المسمين أنبياء ورسلا جعل الله بينها وبين من تنزل عليه من هؤلاء الأصناف نسبا جوامع بينهما بتلك النسب يكون الإلقاء من الملائكة وبها يكون القبول من الأنبياء فكل من استقام بما أنزل على هؤلاء المسمين أنبياء ورسلا من البشر بعد ما آمن بهم أنهم رسل الله وأنهم أخذوا ما جاءوا به عن رسل آخرين ملكيين تنزلت الملائكة عليهم أيضا بالبشرى وكانت لمن هذه صفته جلساء\n\n\n### [الأرواح العلوية والاسم الذي تولاها من الحضرة الإلهية]\n\n\nولما كانت هذه الأرواح العلوية حية بالذات كان الاسم الذي تولاها من الحضرة الإلهية الاسم الحي كما كان المتولي من الأسماء الإلهية لمن كانت حياته عرضية مكتسبة الاسم المحيي فما عقل الملك قط الأحياء بخلاف البشر فإنهم كانوا أمواتا فأحياهم ثم يميتهم ثم يحييهم ولأهل هذه الحياة العرضية من العناصر ركن الماء قال تعالى وكانَ عَرْشُهُ عَلَى الْماءِ وقال وجَعَلْنا من الْماءِ كُلَّ شَيْ‏ءٍ حَيٍّ فالماء أصل العناصر والأسطقسات والعرش الملك وما تم الملك وكمل إلا في عالم الاستحالة وهو عالم الأركان الذي أصله الماء ولو لا عالم الاستحالة ما كان الله يصف نفسه بأنه كل يوم في شأن فالعالم يستحيل والحق في شأن حفظ وجود أعيانه يمده بما به بقاء عينه من الإيجاد فهو الشأن الذي هو الحق عليه وليس لغير عالم الاستحالة هذه الحقيقة\n\n\n### [من استقام على الطريقة سقاه الله بماء الحقيقة]\n\n\nولما صار الماء أصلا لكل حي حياته عرضية كان من استقام سقاه الله ماء الحياة فإن كان سقي عناية كالأنبياء والرسل حيي به من شاء الله وإن كان سقي ابتلاء لما فيه من الدعوى كان بحكم ما أريد بسقيه قال تعالى وأَنْ لَوِ اسْتَقامُوا عَلَى الطَّرِيقَةِ لَأَسْقَيْناهُمْ ماءً غَدَقاً لِنَفْتِنَهُمْ فِيهِ فهذا سقي ابتلاء\n\n\n### [الاستقامة انبعاث من رقدة الغفلات وقيام بحقوق الواجبات‏]\n\n\nوإنما طلبت الاستقامة من المكلف في القيام بفرائض الله عليه فإن المكلف من جهة الحقيقة ملقى طريح عند باب سيده تجري عليه تصاريف الأقدار وما أودع الله في حركات هذه الأكوار مما يجي‏ء به الليل والنهار من تنوع الأطوار بين محو وإثبات لظهور آيات بعد آيات وقد جعل الله المكلف محلا للحياة والحركات وطلب منه القيام من تلك الرقدة بما كلفه من القيام بحقه فأصعب ما يمر على العارفين أمر الله بالاستقامة وهو قوله تعالى فَاسْتَقِمْ كَما أُمِرْتَ ومن تابَ مَعَكَ ولا تَطْغَوْا\nأي لا ترتفعوا عن أمره بما تجدونه في نفوسكم من خلقكم على الصورة الإلهية فتقولوا مثلنا لا يكون مأمورا فلا يعرف العلماء بالله هل وافق أمر الله إرادته فيهم أنهم يمتثلون أمره أو يخالفونه فلهذا صعب عليهم أمر الله واشتد وهوقوله عليه السلام شيبتني هود\n\n\nفإنها السورة التي نزل فيها فَاسْتَقِمْ كَما أُمِرْتَ وأخواتها مما فيها هذه الآية أو ما في معناها فهم من ذلك على خطر\n\n\n### [الاستقامة نشاط لا تنضبط حدوده وطريق لا تتقيد مراتبه‏]\n\n\nوطريق الاستقامة لا تتقيد مراتبه ولا تنضبط كما\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم استقيموا ولن تحصوا\n\n\nيعني طرق الاستقامة\n\n\nوما أحصيتم منها فلن تحصوا ما لكم في ذلك من الأجر والخير\n\n\nوالظاهر إنما أراد لن تحصوا طرق الاستقامة فإنها كثيرة لن يسعها أحد منكم على التعيين ولهذا اتبع هذا القول‏\n\n\nبقوله واعملوا وخير أعمالكم الصلاة وإذ لم تستطيعوا إحصاء طرق الاستقامة فخذوا الأفضل منها\n\n\n### [الاسم الإلهي القيوم هو أخو الاسم الحي الملازم له‏]\n\n\nوينظر إلى الاسم الحي المحيي بهذه العبادات الاسم القيوم ولهذا قيل للمكلف وأَقِيمُوا الصَّلاةَ وأَقِيمُوا الْوَزْنَ فالقيوم أخو الحي الملازم له قال تعالى الله لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ وقال الم الله لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ وقال وعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ فما جاء الاسم الحي إلا والقيوم معه فتدبر هذا الباب فإنه يحتوي على أسرار إلهية\n\n",
    "en": "Chapter One Hundred and Thirty-Two: Concerning the Knowledge of the Station of Rectitude (مقام الاستقامة)\n\nThe one who possesses Rectitude (المستقيم) has a specific guardianship (ولاية مخصوصة),\nwhich encompasses the entire cosmos in its particularization.\n\nFor the one who possesses Rectitude, his spirits descend\nwith the hidden fragrance (الطيب المكنون) in their designation.\n\nRectitude (الاستقامة) causes its masters to descend\ninto stations that cannot be attained by their own particular efforts.\n\nIt is His description, glory be to Him, in a narrative\nwhich He has spoken, so look for it in its textual evidence.\n\n### [The Necessity of the Unnecessary (لزوم ما لا يلزم) without Intending It]\n\nThese verses came as the necessity of the unnecessary (لزوم ما لا يلزم) without intention, and likewise their parallels. I only speak what God causes to flow through us, without effort or deliberation.\n\n### [There is none but the one who is Rectified, because there is none but The Real holding him by the forelock]\n\nKnow, may God grant you success, that God informed us concerning His Prophet and Messenger, peace be upon him, in His Book that he said: <<إِنَّ رَبِّي عَلى‏ صِراطٍ مُسْتَقِيمٍ>> (Indeed, my Lord is upon a straight path). Thus, he described Himself as being upon a straight path. This Messenger was not mistaken in this statement. Furthermore, he only said this after His saying: <<ما من دَابَّةٍ إِلَّا هُوَ آخِذٌ بِناصِيَتِها>> (There is no creature but that He is holding it by its forelock). Therefore, there is none but the one who is truly rectified (مستقيم) upon the path of the Lord, because there is none but The Real (الحق) holding him by his forelock. It is impossible to remove his forelock from the hand of his Master while he is upon a straight path. The word \"creature\" (دابة) is indefinite, making it general. Where then is the crooked one that you might deviate from him? This is compulsion (جبر), and this is rectitude (استقامة). May God grant us success in placing every wisdom in its proper place, for it is there that God’s care for His servant becomes manifest.\n\n### [The Established Law (الشرعة المجعولة) and the Prescribed Way (المنهاج المرسوم)]\n\n<<لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً>> (For each of you We have appointed a law [شِرْعَةً] and a way [مِنْهاجاً]). These are the rulings of the spiritual path (الطريقة) mentioned in His saying, \"and a way.\" All of them are established by God’s establishment. Whoever walks upon a path other than the one God designated for him to walk upon has deviated from the straight path (سواء السبيل) that God designated for him. Similarly, if that other person abandoned his path which God legislated for him to walk upon and followed the path of this one, we would call him one who deviates from the path of God (سبيل الله). Yet, everyone, individually, is upon a straight path (صراط مستقيم) in what has been legislated for him.\n\n### [The Islamic Law, the Prophetic Laws, and the Laws of Wisdom]\n\nFor this reason, the Messenger of God, may God bless him and grant him peace, drew a line and drew lines on both sides of that line. That central line was his Law (شرعه) and his Way (منهاجه) with which he was sent, and he was told to command his community to follow it and not deviate from it. Those surrounding lines were the laws (شرائع) of the Prophets who preceded him, and the established laws of wisdom (النواميس الحكمية). Then he placed his hand on the central line and recited: <<وأَنَّ هذا صِراطِي مُسْتَقِيماً>> (And that this is My path, straight). He attributed it to Himself, but did not say \"the path of God,\" and He described it as Rectitude (الاستقامة). He did not address the description of those other lines, but remained silent about them. Then He said: <<فَاتَّبِعُوهُ>> (So follow it)—the pronoun refers back to His path—<<ولا تَتَّبِعُوا السُّبُلَ>> (and do not follow the [other] ways), meaning the laws and ways of those who preceded him, insofar as they are laws for them. Unless a ruling from them is found in my Law, then follow it insofar as it is a law for us, not insofar as it was a law for them. <<فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ>> (Lest they separate you from His way)—meaning those laws separate you from His way, that is, from the path brought by Muhammad, may God bless him and grant him peace. He did not say \"from the path of God\" because all paths lead to God, since God is their ultimate goal. <<ذلِكُمْ وَصَّاكُمْ به لَعَلَّكُمْ تَتَّقُونَ>> (This He has instructed you, that you may become righteous [or attain piety]), meaning that you take that path as a shield (وقاية) that prevents you from walking upon other paths.\n\n### [The Angels are the Guardians (أولياء) of the Rectified in the Worldly Life and the Hereafter]\n\nThis refers to His saying: <<إِنَّ الَّذِينَ قالُوا>> (Indeed, those who say)—from whatever law (شرع) it may be, provided it is timely and current—<<رَبُّنَا الله ثُمَّ اسْتَقامُوا>> (Our Lord is Allah, then they attain rectitude [استقاموا]) upon the path that God legislated for them to walk upon, <<تَتَنَزَّلُ عَلَيْهِمُ الْمَلائِكَةُ>> (the angels descend upon them). This descent is the general prophecy (النبوة العامة), not the prophecy of legislation (نبوة التشريع). They descend upon them with glad tidings: <<أَلَّا تَخافُوا ولا تَحْزَنُوا>> (Do not fear and do not grieve), for you are upon the path of Rectitude (الاستقامة). Then these angelic bearers of glad tidings say to them: <<نَحْنُ أَوْلِياؤُكُمْ في الْحَياةِ الدُّنْيا>> (We are your guardians [أولياؤكم] in the worldly life). That is, we used to support you in the worldly life at the time when Satan cast his suggestion (لمته) to you, urging deviation from the path legislated for you. We supported you against him by the suggestion (اللمة) that you found during the moment of hesitation between the two thoughts: \"Should I do it or not?\" We were the ones who cast that suggestion to you, countering the enemy's casting. We are also your guardians in the Hereafter by bearing witness for you that you accepted our suggestion and repelled your enemy with it. This is their guardianship (ولاية) in the Hereafter. Their guardianship also includes intercession (الشفاعة) for them regarding what the Devil overcame them with through his suggestion, resulting in the servant being among those who mix good and bad deeds (أهل التخليط). The angels intercede for him so that he is not held accountable for the Devil’s action. This is the meaning of His saying: <<وفي الْآخِرَةِ>> (and in the Hereafter). <<ولَكُمْ فِيها ما تَشْتَهِي أَنْفُسُكُمْ>> (And for you therein is whatever your souls desire), which includes our testimony for them and our intercession for them in that station. <<ولَكُمْ (فِيها) ما تَدَّعُونَ>> (And for you therein is what you request) of ease (الدعة), <<نُزُلًا من غَفُورٍ رَحِيمٍ>> (as hospitality from One Forgiving and Merciful), through our testimony and intercession, since He accepted it and thereby made you happy, sheltered you in His protection, and admitted you into His Mercy. This is the meaning of Rectitude related to salvation (النجاة).\n\n### [The Rectitude Demanded by God's Wisdom Pervading the Cosmos]\n\nAs for the Rectitude (الاستقامة) demanded by God’s Wisdom (حكمة الله), it is that which pervades every existent thing (كون). God Almighty said, confirming Moses, peace be upon him: <<أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ>> (He gave everything its creation [or form]). Thus, everything possesses an inherent rectitude. The rectitude of the plant is that its movement is inverted (منكوسة), and the rectitude of the animal is that its movement is horizontal (أفقية). If it were not so, neither would yield benefit. For if the movement of the plant were not inverted, allowing it to drink water through its roots, it would not provide benefit, as it has no strength except in that manner. Likewise, if the animal’s movement were upward, and it stood on two legs like us, it would not provide the benefit of riding or carrying heavy loads on its back, nor would the benefit derived from horizontal movement be achieved. Therefore, its rectitude is what it was created for; it is the considered movement (الحركة المعتبرة) through which the desired benefit occurs. Otherwise, both the plant and the animal have an upward movement, which is His saying: <<والنَّخْلَ باسِقاتٍ>> (And the palm trees, lofty). Were it not for this movement, it would not grow upward. However, we emphasize the inverted movement due to the desired benefit. Understand this.\n\n### [Movement in the Center, from the Center, and toward the Center]\n\nIndeed, the theologians (المتكلمين) in this field have not fully elaborated the discussion concerning the reality of these movements. Movement *in* the center (الوسط) is rectified because it fulfills its reality, such as the movement of the Earth and the movement of the Sphere. Movement *from* the center is the movement of ascent (العروج), and movement *toward* the center is the movement of descent (النزول). The movement of descent is angelic and divine, while the movement of ascent is human. All of them are rectified (مستقيمة). Thus, there is nothing but Rectitude (استقامة); there is no way to opposition, for opposition is contention (تشاجر). Do you not see that Adam was only forbidden the tree—meaning, \"Do not approach contention\"—and was commanded to adhere to the way of your humanity and what it deserves, and leave the angel, the animal, and everything other than you to what they deserve? Do not compete with anyone regarding his reality, for competition (المزاحمة) is contention and opposition. Therefore, when Adam approached the tree, he opposed the prohibition of his Lord, and thus became contentious. The immediate happiness (السعادة العاجلة) departed from him at that moment, but the rectitude of contention (استقامة التشاجر) did not depart from him, for he fulfilled its due by opposing the Divine prohibition.\n\n### [The Crookedness of the Bow (القوس) is its Rectitude for what it was Intended]\n\nThe crookedness (اعوجاج) of the bow (القوس) is its rectitude (استقامته) for what it was intended. Thus, there is nothing in the cosmos (الكون) but Rectitude, for its Originator, God Almighty, is upon a straight path (صراط مستقيم) by virtue of His being the Lord (رب). Even if the paths intersect and become mixed, they do not depart from Rectitude—the rectitude of mixtures and the rectitude of that for which they were brought into existence. They are, therefore, within the Absolute Rectitude (الاستقامة المطلقة) which governs every existent thing. This is His saying: <<وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him is returned the whole affair...) and <<وَهُوَ عَلى‏ صِراطٍ مُسْتَقِيمٍ>> (And He is upon a straight path). <<فَاعْبُدْهُ>> (So worship Him)—meaning, humble yourself to Him upon every path in which He establishes you. We do not humble ourselves to other than Him, for other than Him is non-existence ('adam). Whoever aims for non-existence will not achieve anything. Furthermore, He used the third-person pronoun in His saying <<فَاعْبُدْهُ>> (So worship Him), meaning, do not say, \"You are the Perceived,\" for sights do not perceive Him. If the Unseen (الغيب) were perceived, it would not be the Unseen. Therefore, worship an Essence (ذات) that is transcendent (منزهة) and unknown, of which you know nothing except your relation to it through need (الافتقار). For this reason, He concluded by saying: <<وتَوَكَّلْ عَلَيْهِ>> (And rely upon Him), meaning, depend upon Him. <<وما رَبُّكَ بِغافِلٍ عَمَّا تَعْمَلُونَ>> (And your Lord is not unaware of what you do). By this, He cuts off the claims of those who pretend to this station if it is neither their attribute nor their state, and if its knowledge has not reached them. Rectitude (الاستقامة) is pervasive in all fixed entities (الأعيان), whether substances (جواهر), accidents (أعراض), states (أحوال), or sayings (أقوال), as He said: <<وَأَقْوَمُ قِيلًا>> (and the most upright in speech). This is a divine and cosmic attribute. May God make us among those who do not deviate from their rectitude except by their rectitude. Amen, by His Might.\n\n### [Rectitude (الاستقامة) according to the Language of the Common People of God (أهل الله)]\n\nAs for Rectitude (الاستقامة) according to the language of the common people of God (أهل الله), it is to say that Rectitude is general in the cosmos (الكون), as we have established. There is no path that is not straight, because there is no path that does not lead to God. However, God Almighty said to His Prophet and to us: <<فَاسْتَقِمْ كَما أُمِرْتَ>> (So be upright [or attain rectitude] as you have been commanded). He did not address him with Absolute Rectitude, for it is established that <<إِلَى الله تَصِيرُ الْأُمُورُ>> (To Allah belong all matters) and that He is the goal of every path. But the crucial matter is which Divine Name (الاسم الإلهي) you reach and arrive at, so that the effect of that Name penetrates the one who reaches it, whether it be happiness and bliss, or wretchedness and punishment. Thus, the meaning of Rectitude is the movements and stillness upon the legislated spiritual path (الطريقة المشروعة).\n\n### [The Straight Path (الصراط المستقيم): Its Head, Its Stations, Its States, Its Rulings]\n\nThe Straight Path (الصراط المستقيم) is the Divine Law (الشرع الإلهي). Belief in God is the head of this path, and the branches of faith (شعب الايمان) are the stations (منازل) of this path, lying between its beginning and its end. What lies between the two stations are its states (أحوال) and its rulings (أحكامه). Since the Straight Path is that with which the angels—expressed as the celestial spirits (الأرواح العلوية)—descended, being the messengers from God to the chosen ones among His servants, named Prophets and Messengers, God established a comprehensive relationship (نسبا جوامع) between them and those upon whom they descend. Through these relationships, the casting (الإلقاء) occurs from the angels, and through them, the acceptance (القبول) occurs from the Prophets. Therefore, everyone who attains rectitude (استقام) according to what was revealed to these human Prophets and Messengers, after believing that they are messengers of God and that they received what they brought from other angelic messengers, the angels also descend upon them with glad tidings, and they become companions (جلساء) to anyone possessing this description.\n\n### [The Celestial Spirits (الأرواح العلوية) and the Name that Governs them from the Divine Presence (الحضرة الإلهية)]\n\nSince these celestial spirits (الأرواح العلوية) are living by Essence (بالذات), the Name (الاسم) that governs them from the Divine Presence (الحضرة الإلهية) is the Name *The Living* (الحي). Just as the Name that governs those whose life is accidental (عرضية) and acquired is the Name *The Giver of Life* (المحيي). The angel never comprehended the dead, unlike humans, who were dead, then He gave them life, then He causes them to die, then He brings them back to life. For the people of this accidental life, the element of water is their pillar. God Almighty said: <<وكانَ عَرْشُهُ عَلَى الْماءِ>> (And His Throne was upon the water). And He said: <<وجَعَلْنا من الْماءِ كُلَّ شَيْءٍ حَيٍّ>> (And We made from water every living thing). Water is the origin of the elements (العناصر) and the primary substances (الأسطقسات). The Throne (العرش) is the Dominion (الملك). The Dominion is not perfected and completed except in the world of transformation (عالم الاستحالة), which is the world of the pillars (الأركان) whose origin is water. Were it not for the world of transformation, God would not describe Himself as being <<كُلَّ يَوْمٍ فِي شَأْنٍ>> (every day in [a new] affair). The world transforms, and The Real (الحق) is in the affair of preserving the existence of its fixed entities (أعيانه), sustaining them with that by which their essence subsists through origination (الإيجاد). This is the affair (الشأن) upon which The Real is established, and this reality belongs to no world other than the world of transformation.\n\n### [Whoever Attains Rectitude (استقام) upon the Path (الطريقة), God Gives him to Drink the Water of Reality (ماء الحقيقة)]\n\nSince water became the origin for every living thing whose life is accidental, whoever attains rectitude (استقام) is given the Water of Life (ماء الحياة) to drink by God. If the drink is one of Divine care (عناية), like that of the Prophets and Messengers, whoever God wills is brought to life by it. But if the drink is one of trial (ابتلاء), due to the claim (الدعوى) inherent in it, then it is according to the judgment of what was intended by that drink. God Almighty said: <<وأَنْ لَوِ اسْتَقامُوا عَلَى الطَّرِيقَةِ لَأَسْقَيْناهُمْ ماءً غَدَقاً لِنَفْتِنَهُمْ فِيهِ>> (And if they had remained upright upon the Path [الطريقة], We would have given them abundant water to drink, that We might test them thereby). This is a drink of trial.\n\n### [Rectitude (الاستقامة) is an Awakening (انبعاث) from the Slumber of Negligence (رقدة الغفلات) and the Fulfillment of Necessary Duties (الواجبات)]\n\nRectitude (الاستقامة) is only demanded of the legally responsible person (المكلف) in fulfilling the obligations (فرائض) God has placed upon him. For, in reality, the legally responsible person is cast down and laid prostrate at the door of his Master, subject to the dispositions of destiny (تصاريف الأقدار) and what God has deposited in the movements of these cycles (الأكوار)—the variety of phases brought by night and day, oscillating between effacement (محو) and affirmation (إثبات), for the manifestation of signs following signs. God has made the legally responsible person a locus for life and movements, and demanded that he rise from that slumber by fulfilling the duty (حقه) with which He charged him. The most difficult thing that passes over the Gnostics (العارفين) is God’s command for Rectitude, which is His saying, the Exalted: <<فَاسْتَقِمْ كَما أُمِرْتَ ومَنْ تابَ مَعَكَ ولا تَطْغَوْا>> (So be upright as you have been commanded, and those who repent with you, and do not transgress). That is, do not elevate yourselves above His command based on what you find in your souls regarding your creation upon the Divine Form (الصورة الإلهية), causing you to say, \"One like us cannot be commanded.\" Thus, the scholars of God (العلماء بالله) do not know whether God’s command corresponds to His Will concerning them—that they obey His command or oppose it. This is why God’s command was difficult and severe for them, and this is the meaning of his, peace be upon him, saying: \"Hud has aged me.\" For it is the Surah in which <<فَاسْتَقِمْ كَما أُمِرْتَ>> (So be upright as you have been commanded) and its sister verses, or those with similar meaning, were revealed. They are therefore in danger concerning this.\n\n### [Rectitude (الاستقامة) is an Activity Whose Limits are Not Fixed and a Path Whose Levels (مراتبه) are Not Restricted]\n\nThe path of Rectitude (الاستقامة) has levels (مراتبه) that are not restricted and limits that are not fixed, as he, may God bless him and grant him peace, said: \"Be upright (استقيموا), and you will not encompass [it].\" Meaning, the paths of Rectitude. \"And whatever you encompass of it, you will not encompass the reward and goodness you have in that.\" It is apparent that he meant: you will not encompass the paths of Rectitude, for they are numerous, and none of you can contain them specifically. For this reason, he followed this statement with his saying: \"And act, and the best of your deeds is the prayer.\" Since you cannot encompass the paths of Rectitude, then take the best of them.\n\n### [The Divine Name Al-Qayyum (القيوم) is the Brother of the Name Al-Hayy (الحي), Inseparable from It]\n\nThe Name *The Self-Subsisting* (القيوم) looks upon the Name *The Living* (الحي) and *The Giver of Life* (المحيي) through these acts of worship. For this reason, the legally responsible person (المكلف) was told: <<وأَقِيمُوا الصَّلاةَ>> (And establish the prayer) and <<وأَقِيمُوا الْوَزْنَ>> (And establish the balance). *Al-Qayyum* (القيوم) is the inseparable brother of *Al-Hayy* (الحي). God Almighty said: <<الله لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ>> (Allah, there is no deity except Him, The Living, The Self-Subsisting). And He said: <<الم الله لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ>> (Alif, Lam, Mim. Allah, there is no deity except Him, The Living, The Self-Subsisting). And He said: <<وعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ>> (And [all] faces shall be humbled before The Living, The Self-Subsisting). The Name *Al-Hayy* never appears except that *Al-Qayyum* is with it. Reflect upon this chapter, for it contains Divine secrets.",
    "ur": "(باب ایک سو بتیس: مقام استقامت (Maqām al-Istiqāmah) کی معرفت میں)\n\nمستقيم کے لیے ایک مخصوص ولایت (Wilāyah) ہے،\nجو اپنی تخصیص میں تمام کائنات کو شامل ہے۔\n\nمستقيم کے لیے اس کی روحیں نازل ہوئیں،\nاپنے تنصیص میں پوشیدہ پاکیزگی کے ساتھ۔\n\nاستقامت (Al-Istiqāmah) نے اپنے ارباب کو اتارا،\nایسے منازل پر جو ان کی خصوصیت سے حاصل نہیں ہو سکتے تھے۔\n\nیہ اس (ذات حق) کی صفت ہے جو اس نے ایک قصے میں بیان کی ہے،\nپس اسے اس کے منصوص (بیان کردہ) میں دیکھو۔\n\n### [لزوم ما لا یلزم (غیر ضروری کا لازم ہونا) بغیر کسی قصد کے]\n\nیہ اشعار لزوم ما لا یلزم کے طور پر بغیر کسی قصد کے آئے ہیں، اور اسی طرح ان کی مثالیں بھی۔ میں تو صرف وہی بات کرتا ہوں جو اللہ ہم میں جاری کرتا ہے، بغیر کسی بناوٹ یا غور و فکر کے۔\n\n### [وہاں کوئی نہیں مگر وہ جو مستقيم ہے، کیونکہ وہاں کوئی نہیں مگر وہ ذات حق (Al-Ḥaqq) ہے جو اس کی پیشانی پکڑے ہوئے ہے]\n\nجان لو، اللہ تمہیں توفیق دے، کہ اللہ نے اپنے نبی اور رسول علیہ السلام کے بارے میں اپنی کتاب میں خبر دی ہے کہ انہوں نے فرمایا:\n**إِنَّ رَبِّي عَلَى صِرَاطٍ مُّسْتَقِيمٍ** (بیشک میرا رب صراط مستقیم (Ṣirāṭ al-Mustaqīm) پر ہے)۔\nپس انہوں نے اپنے آپ کو صراط مستقیم پر ہونے سے موصوف کیا۔ اور اس قول میں اس رسول سے کوئی خطا نہیں ہوئی۔ پھر انہوں نے یہ بات اس قول کے بعد ہی کہی:\n**مَا مِن دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا** (کوئی جاندار نہیں مگر وہ (اللہ) اس کی پیشانی پکڑے ہوئے ہے)۔\nپس حقیقت میں صراط رب پر مستقيم کے سوا کوئی نہیں ہے، کیونکہ وہاں کوئی نہیں مگر وہ ذات حق (Al-Ḥaqq) ہے جو اس کی پیشانی پکڑے ہوئے ہے۔ اور یہ ممکن نہیں کہ اس کی پیشانی اس کے آقا کے ہاتھ سے ہٹ جائے، اور وہ صراط مستقیم (Ṣirāṭ al-Mustaqīm) پر ہو۔ اور لفظ \"دابہ\" (جاندار) کو نکرہ لایا گیا، پس یہ عام ہو گیا، تو ٹیڑھا پن کہاں ہے کہ تم اس سے ہٹ جاؤ؟ یہ جبر ہے اور یہی استقامت (Al-Istiqāmah) ہے۔ پس اللہ ہمیں ہر حکمت کو اس کے مقام پر نازل کرنے کی توفیق دے، وہیں اللہ کی اپنے بندے پر عنایت ظاہر ہوتی ہے۔\n\n### [مقرر کردہ شریعت (Sharī‘ah) اور مرسوم منہاج (Minhāj)]\n\n**لِكُلٍّ جَعَلْنَا مِنكُمْ شِرْعَةً وَمِنْهَاجًا** (تم میں سے ہر ایک کے لیے ہم نے ایک شریعت (Sharī‘ah) اور ایک منہاج (Minhāj) مقرر کیا ہے)۔\nاور یہ منہاج (Minhāj) کے قول میں موجود طریقے کے احکام ہیں۔ پس یہ سب اللہ کے مقرر کرنے سے مقرر کیے گئے ہیں۔ لہٰذا جو شخص اس راستے کے علاوہ کسی اور راستے پر چلا جو اللہ نے اس کے لیے چلنے کے لیے مقرر کیا ہے، تو وہ اس سیدھے راستے سے ہٹ گیا جو اللہ نے اس کے لیے چلنے کے لیے مقرر کیا تھا۔ جیسا کہ اگر دوسرا شخص اپنا راستہ چھوڑ دے جو اللہ نے اس کے لیے مشروع کیا تھا اور اس (پہلے شخص) کا راستہ اختیار کر لے، تو ہم اسے بھی سبیل اللہ سے ہٹنے والا کہیں گے۔ اور ہر ایک شخص اپنے لیے مقرر کردہ شریعت (Sharī‘ah) کے اعتبار سے صراط مستقیم (Ṣirāṭ al-Mustaqīm) پر ہے۔\n\n### [شریعت اسلامیہ، شرائع نبویہ اور نوامیس حکمیہ]\n\nاسی لیے رسول اللہ صلی اللہ علیہ وسلم نے ایک خط کھینچا اور اس خط کے دونوں اطراف مزید خطوط کھینچے۔ وہ (درمیانی) خط آپ صلی اللہ علیہ وسلم کی شریعت (Sharī‘ah) اور منہاج (Minhāj) تھا جس کے ساتھ آپ مبعوث ہوئے، اور آپ سے کہا گیا کہ اپنی امت سے کہیں کہ وہ اس پر چلیں اور اس سے نہ ہٹیں۔ اور وہ (اطراف کے) خطوط آپ سے پہلے گزرے ہوئے انبیاء کی شرائع اور مقرر کردہ حکمی نوامیس (Laws of Wisdom) تھے۔ پھر آپ نے اپنا ہاتھ اس (درمیانی) خط پر رکھا اور یہ آیت تلاوت فرمائی:\n**وَأَنَّ هَذَا صِرَاطِي مُسْتَقِيمًا** (اور یہ کہ یہی میرا راستہ ہے جو سیدھا ہے)۔\nپس آپ نے اسے اپنی طرف منسوب کیا اور \"صراط اللہ\" نہیں کہا، اور اسے استقامت (Al-Istiqāmah) سے موصوف کیا۔ اور آپ نے ان (اطراف کے) خطوط کی صفت بیان نہیں کی بلکہ ان کے بارے میں خاموشی اختیار کی۔ پھر فرمایا:\n**فَاتَّبِعُوهُ** (پس تم اس کی پیروی کرو)۔ (ضمیر آپ کے صراط کی طرف لوٹتی ہے)۔\n**وَلَا تَتَّبِعُوا السُّبُلَ** (اور دوسرے راستوں کی پیروی نہ کرو)۔\nیعنی ان لوگوں کی شرائع اور ان کے مناہج (Mināhij) کی پیروی نہ کرو جو آپ سے پہلے گزرے ہیں، اس حیثیت سے کہ وہ ان کی شرائع تھیں، مگر یہ کہ ان کا کوئی حکم ہماری شریعت میں پایا جائے، تو اس کی پیروی اس حیثیت سے کرو کہ وہ ہمارے لیے شریعت ہے، نہ کہ اس حیثیت سے کہ وہ ان کے لیے شریعت تھی۔\n**فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ** (تو وہ تمہیں اس کے راستے سے ہٹا دیں گے)۔\nیعنی وہ شرائع اس کے راستے سے، یعنی اس طریقے سے جو محمد صلی اللہ علیہ وسلم لائے ہیں۔ اور یہ نہیں کہا کہ \"سبیل اللہ سے\"، کیونکہ سب کچھ سبیل اللہ ہے جب اللہ ہی اس کی غایت ہے۔\n**ذَلِكُمْ وَصَّاكُمْ بِهِ لَعَلَّكُمْ تَتَّقُونَ** (یہ وہ ہے جس کی اللہ نے تمہیں وصیت کی ہے تاکہ تم پرہیزگار بن جاؤ)۔\nیعنی تم اس راستے کو ایک ڈھال بنا لو جو تمہارے اور دوسرے راستوں پر چلنے کے درمیان حائل ہو جائے۔\n\n### [ملائکہ دنیا اور آخرت میں مستقيمین کے اولیاء (Awliyā') ہیں]\n\nاور یہ اللہ کا قول ہے:\n**إِنَّ الَّذِينَ قَالُوا** (بیشک وہ لوگ جنہوں نے کہا) – خواہ وہ کسی بھی شریعت (Sharī‘ah) سے ہوں، جب اس کا زمانہ اور وقت ہو – **رَبُّنَا اللَّهُ ثُمَّ اسْتَقَامُوا** (ہمارا رب اللہ ہے، پھر وہ استقامت (Al-Istiqāmah) اختیار کرتے ہیں)۔\nیعنی اس طریقے پر جو اللہ نے ان کے لیے چلنے کے لیے مشروع کیا تھا، **تَتَنَزَّلُ عَلَيْهِمُ الْمَلَائِكَةُ** (ان پر فرشتے نازل ہوتے ہیں)۔\nاور یہ نزول نبوت عامہ ہے، نہ کہ نبوت تشریع۔ وہ ان پر بشارت کے ساتھ نازل ہوتے ہیں:\n**أَلَّا تَخَافُوا وَلَا تَحْزَنُوا** (کہ نہ تم ڈرو اور نہ غم کرو)۔\nکیونکہ تم استقامت (Al-Istiqāmah) کے راستے پر ہو۔ پھر یہ بشارت دینے والے فرشتے ان سے کہتے ہیں:\n**نَحْنُ أَوْلِيَاؤُكُمْ فِي الْحَيَاةِ الدُّنْيَا** (ہم دنیا کی زندگی میں تمہارے دوست (اولیاء) ہیں)۔\nیعنی ہم دنیا کی زندگی میں تمہاری مدد کرتے تھے، اس وقت جب شیطان اپنی لمہ (Lammah) کے ذریعے تمہیں اس صراط (Ṣirāṭ) سے ہٹنے کا القاء کرتا تھا جو تمہارے لیے مشروع کیا گیا تھا۔ پس ہم اس پر تمہاری مدد اس لمہ (Lammah) کے ذریعے کرتے تھے جو تم دو خطرات کے درمیان تردد کے وقت پاتے تھے کہ آیا یہ کام کرے یا نہ کرے؟ ہم ہی تھے جو دشمن کے القاء کے مقابلے میں تمہیں وہ القاء کرتے تھے۔ پس ہم آخرت میں بھی تمہارے اولیاء (Awliyā') ہیں، تمہارے حق میں گواہی دے کر کہ تم ہماری لمہ (Lammah) کو لیتے تھے اور اس سے اپنے دشمن کو دفع کرتے تھے۔ پس یہ آخرت میں ان کی ولایت (Wilāyah) ہے۔ اور ان کی ولایت (Wilāyah) ان کے حق میں شفاعت کے ذریعے بھی ہے، ان امور میں جہاں شیطان اپنی لمہ (Lammah) میں ان پر غالب آ گیا ہو، اور بندہ اہل تخلیط (گڑبڑ کرنے والوں) میں سے ہو جائے۔ تو فرشتے اس کے حق میں شفاعت کریں گے تاکہ اسے شیطان کے عمل پر مؤاخذہ نہ کیا جائے۔ یہ ہے اللہ کے قول **وَفِي الْآخِرَةِ** (اور آخرت میں بھی) کا معنی۔\n**وَلَكُمْ فِيهَا مَا تَشْتَهِي أَنْفُسُكُمْ** (اور تمہارے لیے اس میں وہ سب کچھ ہے جو تمہارے دل چاہیں گے)۔\nیعنی اس مقام پر ہماری گواہی اور ہماری شفاعت سے۔\n**وَلَكُمْ (فِيهَا) مَا تَدَّعُونَ** (اور تمہارے لیے اس میں وہ سب کچھ ہے جس کا تم دعویٰ کرو گے)۔\nیعنی آرام و سکون۔\n**نُزُلًا مِّنْ غَفُورٍ رَّحِيمٍ** (غفور و رحیم کی طرف سے مہمانی کے طور پر)۔\nیہ ہماری گواہی اور شفاعت کی وجہ سے ہے، جب اللہ اسے قبول فرمائے گا، تو تمہیں اس کے ذریعے سعادت بخشے گا، تمہیں اپنی پناہ میں چھپا لے گا اور تمہیں اپنی رحمت میں داخل کر دے گا۔ یہ استقامت (Al-Istiqāmah) کا وہ معنی ہے جو نجات سے متعلق ہے۔\n\n### [وہ استقامت (Al-Istiqāmah) جو کائنات میں جاری اللہ کی حکمت کا تقاضا ہے]\n\nاور رہی وہ استقامت (Al-Istiqāmah) جو اللہ کی حکمت کا تقاضا ہے، تو وہ ہر وجود میں جاری و ساری ہے۔ اللہ تعالیٰ نے موسیٰ علیہ السلام کی تصدیق کرتے ہوئے فرمایا:\n**أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ** (اس نے ہر چیز کو اس کی خلقت عطا کی)۔\nپس ہر چیز ایک حاصل شدہ استقامت (Al-Istiqāmah) میں ہے۔ چنانچہ نباتات کی استقامت یہ ہے کہ اس کی حرکت الٹی (منکوسہ) ہو، اور حیوان کی استقامت یہ ہے کہ اس کی حرکت افقی ہو۔ اگر ایسا نہ ہو تو ان میں سے کسی سے بھی فائدہ حاصل نہیں ہو سکتا۔ کیونکہ اگر نباتات کی حرکت الٹی نہ ہو تاکہ وہ اپنی جڑوں سے پانی پی سکے، تو وہ کوئی فائدہ نہیں دے گا، کیونکہ اس کی قوت اسی طرح ہے۔ اسی طرح حیوان اگر اس کی حرکت اوپر کی طرف ہو اور وہ ہماری طرح دو پیروں پر کھڑا ہو جائے تو وہ سواری اور پیٹھ پر بوجھ اٹھانے کا فائدہ نہیں دے گا، اور نہ ہی وہ فائدہ حاصل ہو گا جو افقی حرکت سے ہوتا ہے۔ پس اس کی استقامت (Al-Istiqāmah) وہی ہے جس کے لیے اسے پیدا کیا گیا ہے، اور یہی وہ معتبر حرکت ہے جس سے مطلوبہ فائدہ حاصل ہوتا ہے۔ ورنہ نباتات اور حیوانات دونوں میں اوپر کی طرف حرکت بھی ہوتی ہے، اور یہی اللہ کا قول ہے:\n**وَالنَّخْلَ بَاسِقَاتٍ** (اور کھجور کے لمبے درخت)۔\nاگر حرکت نہ ہوتی تو وہ اوپر کی طرف نشوونما نہ پاتا۔ لیکن ہم نے مطلوبہ منفعت کے لیے اس پر الٹی حرکت کو غالب قرار دیا۔ پس اس بات کو سمجھ لو۔\n\n### [مرکز میں، مرکز سے، اور مرکز کی طرف حرکت]\n\nکیونکہ اس فن کے متکلمین نے ان حرکات کی حقیقت پر کلام کو مکمل طور پر واضح نہیں کیا۔ مرکز میں حرکت مستقيم (Mustaqīm) ہے کیونکہ اس نے اپنی حقیقت کو پورا کیا، جیسے زمین کی حرکت اور کرہ کی حرکت۔ اور مرکز سے حرکت عروج کی حرکت ہے، اور مرکز کی طرف حرکت نزول کی حرکت ہے۔ پس نزول کی حرکت ملکی اور الٰہی ہے، اور عروج کی حرکت بشری ہے۔ اور یہ سب مستقيم ہیں۔ پس استقامت (Al-Istiqāmah) کے سوا کچھ نہیں، مخالفت کا کوئی راستہ نہیں، کیونکہ مخالفت جھگڑا ہے۔ کیا تم نہیں دیکھتے کہ آدم علیہ السلام پر درخت کے معاملے میں پابندی صرف اس لیے لگائی گئی تھی کہ جھگڑے کے قریب نہ جاؤ؟ اور اپنی انسانیت کے طریقے کو لازم پکڑو اور جو اس کا حق ہے، اور ملک (فرشتہ) اور جو اس کا حق ہے، اور حیوان اور جو اس کا حق ہے، اور تمہارے سوا ہر چیز اور جو اس کا حق ہے، اسے چھوڑ دو۔ اور کسی کو اس کی حقیقت میں مزاحمت نہ کرو، کیونکہ مزاحمت جھگڑا اور اختلاف ہے۔ اسی لیے جب آدم علیہ السلام درخت کے قریب گئے تو انہوں نے اپنے رب کی ممانعت کی مخالفت کی، پس وہ جھگڑنے والے بن گئے، تو اس وقت ان سے عاجل سعادت جاتی رہی، لیکن جھگڑے کی استقامت (Al-Istiqāmah) ان سے نہیں گئی، کیونکہ انہوں نے نہی الٰہی کی مخالفت کے ذریعے اس کا حق پورا کر دیا۔\n\n### [کمان کا ٹیڑھا پن اس کے لیے مطلوبہ استقامت (Al-Istiqāmah) ہے]\n\nکمان کا ٹیڑھا پن اس کے لیے مطلوبہ استقامت (Al-Istiqāmah) ہے۔ پس کائنات میں استقامت (Al-Istiqāmah) کے سوا کچھ نہیں، کیونکہ اس کا موجد، جو کہ اللہ تعالیٰ ہے، رب ہونے کے ناطے صراط مستقیم (Ṣirāṭ al-Mustaqīm) پر ہے۔ اگر راستے ایک دوسرے میں داخل ہو جائیں اور مخلوط ہو جائیں، تب بھی وہ استقامت (Al-Istiqāmah) سے باہر نہیں نکلتے، وہ اختلاط کی استقامت اور جس کے لیے وہ موجود ہوئے اس کی استقامت ہے۔ پس وہ مطلق استقامت (Al-Istiqāmah) میں ہیں جس کا حکم ہر وجود پر جاری ہے۔ اور یہی اللہ کا قول ہے:\n**وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ** (اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں)۔\n**وَهُوَ عَلَى صِرَاطٍ مُّسْتَقِيمٍ** (اور وہ صراط مستقیم (Ṣirāṭ al-Mustaqīm) پر ہے)۔\n**فَاعْبُدْهُ** (پس اس کی عبادت کرو)۔\nیعنی ہر اس صراط (Ṣirāṭ) میں اس کے لیے عاجزی اختیار کرو جس پر وہ تمہیں قائم کرتا ہے۔ ہم اس کے غیر کے لیے عاجزی نہیں کرتے، کیونکہ اس کا غیر عدم (Non-existence) ہے۔ اور جس نے عدم کا قصد کیا، اس کے ہاتھ کچھ نہیں آیا۔ پھر اللہ نے **فَاعْبُدْهُ** (پس اس کی عبادت کرو) میں ضمیر غائب استعمال کی، یعنی یہ نہ کہو کہ تم اسے پانے والے ہو، کیونکہ آنکھیں اسے نہیں پا سکتیں، اگر غیب کو پا لیا جائے تو وہ غیب نہیں رہے گا۔ پس ایک ایسی ذات منزہ اور مجہول کی عبادت کرو جس کے بارے میں تم سوائے اپنی نسبت کے، جو کہ افتقار (محتاجی) کی ہے، کچھ نہیں جانتے۔ اسی لیے بات مکمل کرتے ہوئے فرمایا:\n**وَتَوَكَّلْ عَلَيْهِ** (اور اسی پر بھروسہ کرو)۔\n**وَمَا رَبُّكَ بِغَافِلٍ عَمَّا تَعْمَلُونَ** (اور تمہارا رب تمہارے اعمال سے غافل نہیں ہے)۔\nاس سے اس مقام کے مدعیوں کا پردہ چاک ہو جاتا ہے، اگر یہ ان کی صفت یا حال نہ ہو اور ان تک اس کا علم نہ پہنچا ہو۔ پس استقامت (Al-Istiqāmah) تمام اعیان (A‘yān) میں جاری ہے، خواہ وہ جواہر ہوں، اعراض ہوں، احوال ہوں یا اقوال، جیسا کہ اللہ نے فرمایا:\n**وَأَقْوَمُ قِيلًا** (اور سب سے سیدھی بات)۔\nاور یہ ایک الٰہی اور کونی صفت ہے۔ اللہ ہمیں ان لوگوں میں شامل کرے جو اپنی استقامت (Al-Istiqāmah) سے صرف اپنی استقامت کے ذریعے ہی ہٹتے ہیں۔ آمین، اپنی عزت کے ساتھ۔\n\n### [عام اہل اللہ کی زبان میں استقامت (Al-Istiqāmah)]\n\nاور رہی عام اہل اللہ کی زبان میں استقامت (Al-Istiqāmah)، تو وہ یہ ہے کہ تم کہو کہ استقامت (Al-Istiqāmah) کائنات میں عام ہے جیسا کہ ہم نے مقرر کیا ہے۔ پس کوئی راستہ نہیں مگر وہ مستقيم ہے، کیونکہ کوئی راستہ نہیں مگر وہ اللہ تک پہنچانے والا ہے۔ لیکن اللہ تعالیٰ نے اپنے نبی اور ہمیں مخاطب کرتے ہوئے فرمایا:\n**فَاسْتَقِمْ كَمَا أُمِرْتَ** (پس تم استقامت (Al-Istiqāmah) اختیار کرو جیسا کہ تمہیں حکم دیا گیا ہے)۔\nاللہ نے آپ کو مطلق استقامت (Al-Istiqāmah) سے مخاطب نہیں کیا، کیونکہ یہ بات مقرر ہو چکی ہے کہ **إِلَى اللَّهِ تَصِيرُ الْأُمُورُ** (تمام معاملات اللہ ہی کی طرف لوٹتے ہیں) اور وہ ہر راستے کی غایت ہے۔ لیکن اصل معاملہ یہ ہے کہ تم اسماء الٰہیہ میں سے کس اسم تک پہنچتے ہو اور لوٹتے ہو، تاکہ اس اسم کا اثر اس تک پہنچنے والے میں سعادت اور نعمت یا شقاوت اور عذاب کی صورت میں نافذ ہو۔ پس استقامت (Al-Istiqāmah) کا معنی مشروع طریقے پر حرکات و سکنات کا ہونا ہے۔\n\n### [صراط مستقیم (Ṣirāṭ al-Mustaqīm): اس کا سر، اس کے منازل، اس کے احوال، اس کے احکام]\n\nاور صراط مستقیم (Ṣirāṭ al-Mustaqīm) شریعت الٰہی ہے۔ اور اللہ پر ایمان اس راستے کا سر ہے، اور ایمان کے شعبے اس راستے کے منازل ہیں جو اس کے آغاز اور اس کی غایت کے درمیان ہیں۔ اور دو منزلوں کے درمیان جو کچھ ہے وہ اس کے احوال اور احکام ہیں۔ اور چونکہ صراط مستقیم (Ṣirāṭ al-Mustaqīm) وہ ہے جس کے ساتھ ملائکہ نازل ہوئے، جنہیں ارواح علویہ (Upper Spirits) سے تعبیر کیا جاتا ہے، اور وہ اللہ کی طرف سے اپنے چنے ہوئے بندوں کی طرف رسول ہیں جنہیں انبیاء اور رسول کہا جاتا ہے، اس لیے اللہ نے ان (ملائکہ) اور ان (انبیاء و رسل) کے درمیان ایک جامع نسبت قائم کی ہے۔ ان نسبتوں کے ذریعے ملائکہ کی طرف سے القاء ہوتا ہے اور ان کے ذریعے انبیاء کی طرف سے قبولیت ہوتی ہے۔ پس ہر وہ شخص جو ان انسانوں پر نازل ہونے والی شریعت پر استقامت (Al-Istiqāmah) اختیار کرتا ہے جنہیں انبیاء اور رسول کہا جاتا ہے، اس ایمان کے بعد کہ وہ اللہ کے رسول ہیں اور انہوں نے جو کچھ لائے ہیں وہ دوسرے ملکی رسولوں سے لیا ہے، تو ان پر بھی فرشتے بشارت کے ساتھ نازل ہوتے ہیں، اور جس کی یہ صفت ہو وہ ان کے ہم نشین بن جاتے ہیں۔\n\n### [ارواح علویہ (Al-Arwāḥ al-‘Ulwiyyah) اور وہ اسم جو انہیں حضور الٰہیہ (Al-Ḥaḍrah al-Ilāhiyyah) سے سنبھالتا ہے]\n\nاور چونکہ یہ ارواح علویہ (Al-Arwāḥ al-‘Ulwiyyah) بالذات زندہ ہیں، اس لیے حضور الٰہیہ (Al-Ḥaḍrah al-Ilāhiyyah) سے جو اسم ان کا متولی ہے وہ اسم \"الحی\" (زندہ) ہے۔ جیسا کہ ان لوگوں کے لیے جن کی حیات عرضی اور اکتسابی ہے، ان کا متولی اسم الٰہی \"المحیی\" (زندہ کرنے والا) ہے۔ فرشتے کبھی بھی (عارضی) زندگی کو نہیں سمجھتے، برخلاف انسانوں کے، جو مردہ تھے تو اللہ نے انہیں زندہ کیا، پھر انہیں موت دے گا، پھر زندہ کرے گا۔ اور اس عرضی زندگی کے حاملین کے لیے عناصر میں سے پانی کا رکن ہے۔ اللہ تعالیٰ نے فرمایا:\n**وَكَانَ عَرْشُهُ عَلَى الْمَاءِ** (اور اس کا عرش پانی پر تھا)۔\nاور فرمایا:\n**وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ** (اور ہم نے ہر زندہ چیز کو پانی سے بنایا)۔\nپس پانی عناصر اور اسطقسات (بنیادی اجزاء) کی اصل ہے۔ اور عرش ملک (بادشاہت) ہے۔ اور ملک (بادشاہت) مکمل نہیں ہوتی مگر عالم استحالت (عالمِ تغیر) میں، اور یہ ارکان کا عالم ہے جس کی اصل پانی ہے۔ اگر عالم استحالت نہ ہوتا تو اللہ اپنے آپ کو اس صفت سے موصوف نہ کرتا کہ وہ **كُلَّ يَوْمٍ فِي شَأْنٍ** (ہر دن ایک نئی شان میں) ہے۔ پس عالم متغیر ہوتا ہے، اور ذات حق (Al-Ḥaqq) ان کے اعیان (A‘yān) کے وجود کو محفوظ رکھنے کی شان میں ہے، وہ انہیں اس چیز سے مدد دیتا ہے جس سے ان کے عین کی بقا (Baqā') ہوتی ہے، یعنی ایجاد سے۔ پس یہی وہ شان ہے جس پر ذات حق (Al-Ḥaqq) قائم ہے، اور عالم استحالت کے علاوہ کسی اور عالم کے لیے یہ حقیقت نہیں ہے۔\n\n### [جو شخص طریقے پر استقامت (Al-Istiqāmah) اختیار کرتا ہے، اللہ اسے حقیقت کا پانی پلاتا ہے]\n\nاور چونکہ پانی ہر اس زندہ چیز کی اصل بن گیا جس کی حیات عرضی ہے، اس لیے جس نے استقامت (Al-Istiqāmah) اختیار کی، اللہ اسے آب حیات پلاتا ہے۔ اگر وہ عنایت کا پانی ہو، جیسے انبیاء اور رسولوں کو پلایا گیا، تو اس سے وہ زندہ ہو جاتا ہے جسے اللہ چاہتا ہے۔ اور اگر وہ آزمائش کا پانی ہو، اس دعوے کی وجہ سے جو اس میں شامل ہے، تو وہ اس حکم کے مطابق ہوتا ہے جو اس کے پلانے سے مراد ہوتا ہے۔ اللہ تعالیٰ نے فرمایا:\n**وَأَن لَّوِ اسْتَقَامُوا عَلَى الطَّرِيقَةِ لَأَسْقَيْنَاهُم مَّاءً غَدَقًا لِّنَفْتِنَهُمْ فِيهِ** (اور اگر وہ طریقے پر استقامت (Al-Istiqāmah) اختیار کرتے تو ہم انہیں وافر پانی پلاتے تاکہ ہم انہیں اس میں آزمائیں)۔\nپس یہ آزمائش کا پانی ہے۔\n\n### [استقامت (Al-Istiqāmah) غفلت کی نیند سے بیدار ہونا اور واجبات کے حقوق کی ادائیگی ہے]\n\nاور مکلف سے استقامت (Al-Istiqāmah) کا مطالبہ صرف اس لیے کیا گیا ہے کہ وہ اللہ کے فرائض کو ادا کرے۔ کیونکہ مکلف حقیقت کے اعتبار سے اپنے آقا کے دروازے پر پڑا ہوا ہے، جس پر تقدیر کے تصرفات جاری ہوتے ہیں، اور جو کچھ اللہ نے ان ادوار کی حرکات میں ودیعت کیا ہے جو رات اور دن لاتے ہیں، محو (مٹانے) اور اثبات (قائم رکھنے) کے درمیان اطوار کی تبدیلی سے، تاکہ ایک کے بعد ایک آیات ظاہر ہوں۔ اور اللہ نے مکلف کو زندگی اور حرکات کا محل بنایا ہے، اور اس سے مطالبہ کیا ہے کہ وہ اس نیند سے بیدار ہو کر اس حق کو ادا کرے جس کا اسے مکلف بنایا گیا ہے۔ پس عارفین (Al-‘Ārifīn) پر سب سے مشکل جو چیز گزرتی ہے وہ اللہ کا استقامت (Al-Istiqāmah) کا حکم ہے، اور وہ اللہ تعالیٰ کا یہ قول ہے:\n**فَاسْتَقِمْ كَمَا أُمِرْتَ وَمَن تَابَ مَعَكَ وَلَا تَطْغَوْا** (پس تم استقامت (Al-Istiqāmah) اختیار کرو جیسا کہ تمہیں حکم دیا گیا ہے، اور وہ بھی جو تمہارے ساتھ توبہ کر چکے ہیں، اور حد سے تجاوز نہ کرو)۔\nیعنی اپنے آپ کو اس کے حکم سے بلند نہ سمجھو، اس بنا پر کہ تم اپنے نفوس میں اپنے آپ کو صورت الٰہیہ پر پیدا شدہ پاتے ہو، اور یہ کہو کہ ہم جیسا شخص مامور (حکم دیا گیا) نہیں ہو سکتا۔ پس اللہ کے علماء یہ نہیں جانتے کہ آیا اللہ کا حکم ان کے بارے میں اس کی ارادت کے مطابق ہے کہ وہ اس کے حکم کی تعمیل کریں گے یا اس کی مخالفت کریں گے۔ اسی لیے اللہ کا یہ حکم ان پر مشکل اور سخت ہو گیا، اور یہی آپ صلی اللہ علیہ وسلم کا قول ہے: \"مجھے سورۃ ہود نے بوڑھا کر دیا\"۔\nکیونکہ یہ وہ سورت ہے جس میں **فَاسْتَقِمْ كَمَا أُمِرْتَ** اور اس کی ہم معنی آیات نازل ہوئیں، پس وہ اس سے خطرے میں ہیں۔\n\n### [استقامت (Al-Istiqāmah) ایک ایسا نشاط ہے جس کی حدود مقرر نہیں، اور ایک ایسا راستہ ہے جس کے مراتب مقید نہیں]\n\nاور استقامت (Al-Istiqāmah) کے راستے کے مراتب مقید نہیں ہیں اور نہ ہی اس کی حدود مقرر ہیں، جیسا کہ نبی صلی اللہ علیہ وسلم نے فرمایا:\n**استقيموا ولن تحصوا** (استقامت (Al-Istiqāmah) اختیار کرو، اور تم شمار نہیں کر سکو گے)۔\nیعنی استقامت (Al-Istiqāmah) کے طریقوں کو۔ اور جو تم نے شمار کر لیے، تو تم اس میں اپنے لیے اجر اور خیر کو شمار نہیں کر سکو گے۔ اور ظاہر یہ ہے کہ آپ کی مراد یہ تھی کہ تم استقامت (Al-Istiqāmah) کے طریقوں کو شمار نہیں کر سکو گے، کیونکہ وہ بہت زیادہ ہیں اور تم میں سے کوئی بھی انہیں متعین طور پر احاطہ نہیں کر سکتا۔ اسی لیے آپ نے اس قول کے بعد یہ فرمایا:\n**واعملوا وخير أعمالكم الصلاة** (اور عمل کرو، اور تمہارے اعمال میں سب سے بہتر نماز ہے)۔\nاور جب تم استقامت (Al-Istiqāmah) کے طریقوں کا احاطہ نہیں کر سکتے تو ان میں سے افضل کو اختیار کر لو۔\n\n### [اسم الٰہی \"القیوم\" (Al-Qayyūm) اسم \"الحی\" (Al-Ḥayy) کا لازم و ملزوم بھائی ہے]\n\nاور ان عبادات کے ذریعے اسم \"الحی\" (Al-Ḥayy) اور \"المحیی\" (Al-Muḥyī) کی طرف اسم \"القیوم\" (Al-Qayyūm) دیکھتا ہے۔ اسی لیے مکلف سے کہا گیا:\n**وَأَقِيمُوا الصَّلَاةَ** (اور نماز قائم کرو)۔\nاور **وَأَقِيمُوا الْوَزْنَ** (اور وزن کو قائم کرو)۔\nپس \"القیوم\" (Al-Qayyūm) \"الحی\" (Al-Ḥayy) کا لازم و ملزوم بھائی ہے۔ اللہ تعالیٰ نے فرمایا:\n**اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ** (اللہ، اس کے سوا کوئی معبود نہیں، وہ زندہ ہے، قائم رکھنے والا ہے)۔\nاور فرمایا:\n**الم اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ** (الم، اللہ، اس کے سوا کوئی معبود نہیں، وہ زندہ ہے، قائم رکھنے والا ہے)۔\nاور فرمایا:\n**وَعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ** (اور تمام چہرے حی و قیوم کے سامنے جھک گئے)۔\nپس اسم \"الحی\" (Al-Ḥayy) کبھی نہیں آیا مگر \"القیوم\" (Al-Qayyūm) اس کے ساتھ آیا۔ پس اس باب پر غور کرو، کیونکہ یہ الٰہی اسرار پر مشتمل ہے۔",
    "fa": "باب صد و سی و دوم در معرفت مقام استقامت\n\nبرای شخص مستقیم (مستقیم) ولایتی مخصوص است *** که همه هستی (الکون) را در تخصیص خود فرا گرفته است\n\nبرای شخص مستقیم، ارواحش نازل شده‌اند *** با عطر پنهان در نصّ (تنصيص) آن\n\nاستقامت، ارباب خود را نازل کرده است *** از آن، به منازلی که با خصوصیت‌هایش به دست نیامده است\n\nآن (استقامت) صفت او سبحانه در داستانی است *** که آن را گفته است، پس در متن آن بنگر\n\n### [لزوم آنچه لازم نیست، بدون قصد به آن]\n\nاین ابیات به صورت لزوم ما لا یلزم (لزوم آنچه لازم نیست) و بدون قصد به آن آمده‌اند، و همچنین امثال آن‌ها؛ زیرا من تنها به آنچه خداوند در ما جاری می‌سازد سخن می‌گویم، بدون تکلف و اندیشه.\n\n### [جز کسی که مستقیم است وجود ندارد، زیرا جز کسی که حق (الحق) ناصیه‌اش را گرفته است، وجود ندارد]\n\nبدان، خداوند تو را موفق بدارد، که خداوند در کتابش از پیامبر و رسولش (علیه السلام) خبر داده که فرمود: إِنَّ رَبِّي عَلى‏ صِراطٍ مُسْتَقِيمٍ (همانا پروردگار من بر صراط مستقیم است). پس خود را وصف کرده که بر صراط مستقیم است و این رسول در این سخن خطایی نکرده است. سپس، این را نگفته مگر پس از قولش: ما من دَابَّةٍ إِلَّا هُوَ آخِذٌ بِناصِيَتِها (هیچ جنبنده‌ای نیست مگر اینکه او ناصیه (موی پیشانی) آن را گرفته است). پس در حقیقت جز کسی که مستقیم است بر صراط پروردگار وجود ندارد، زیرا جز کسی که حق (الحق) ناصیه‌اش را گرفته است، وجود ندارد. و ممکن نیست که ناصیه‌اش از دست سرورش جدا شود، در حالی که او بر صراط مستقیم است. و لفظ «دابّه» (جنبنده) نکره آمده و عمومیت دارد. پس کج‌رو کجاست تا از او روی برگردانی؟ این جبر است و این استقامت. پس خداوند ما را موفق بدارد تا هر حکمتی را در جایگاه خود فرود آوریم، که در آنجاست که عنایت خداوند به بنده‌اش آشکار می‌شود.\n\n### [شریعت مقرر شده و راه رسم شده]\n\nلِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً (برای هر یک از شما شریعت و راهی قرار دادیم). و آن احکام طریقت (الطريقة) است که در قولش: ومِنْهاجاً (و راهی) آمده است. پس همه آن‌ها به جعل خداوند مقرر شده‌اند. بنابراین، هر کس در غیر راهی که خداوند برای او معین کرده است گام بردارد، از راه راست (سواء السبيل) که خداوند برای او معین کرده است منحرف شده است. همان‌طور که اگر آن دیگری راهی را که خداوند برای او تشریع کرده است رها کند و راه این شخص را بپیماید، او را منحرف از راه خدا می‌نامیم. و همه، نسبت به هر فرد، بر صراط مستقیم هستند در آنچه برای او تشریع شده است.\n\n### [شریعت اسلامی، شرایع نبوی و نوامیس حکمی]\n\nبه همین دلیل، رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) خطی کشید و در دو طرف آن خطوطی دیگر کشید. آن خط، شریعت و منهاج او بود که با آن مبعوث شد و به او گفته شد که به امتت بگو بر آن سلوک کنند و از آن منحرف نشوند. و آن خطوط دیگر، شرایع پیامبرانی بودند که پیش از او بودند و نوامیس حکمی (قوانین الهی) وضع شده. سپس دست خود را بر آن خط گذاشت و این آیه را تلاوت کرد: وأَنَّ هذا صِراطِي مُسْتَقِيماً (و اینکه این راه من است، راهی مستقیم). پس آن را به خود نسبت داد و نگفت صراط الله (راه خدا)، و آن را به استقامت وصف کرد و متعرض وصف آن خطوط دیگر نشد، بلکه درباره آن‌ها سکوت کرد. سپس فرمود: فَاتَّبِعُوهُ (پس از آن پیروی کنید) که ضمیر به صراط او بازمی‌گردد، ولا تَتَّبِعُوا السُّبُلَ (و از راه‌ها پیروی نکنید) یعنی شرایع پیشینیان و مناهج آن‌ها، از آن جهت که شرایع آن‌ها هستند، مگر اینکه حکمی از آن‌ها در شریعت ما یافت شود، پس از آن پیروی کنید از آن جهت که شرع ماست، نه از آن جهت که شرع آن‌ها بوده است. فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ (که شما را از راه او پراکنده می‌سازد) یعنی آن شرایع شما را از راه او، یعنی از طریقی که محمد (صَلَّى اللهُ عَليهِ وسَلَّم) آورده است، پراکنده می‌سازد. و نگفت از راه خدا، زیرا همه راه‌ها، راه خدا هستند، چرا که خداوند غایت آن‌هاست. ذلِكُمْ وَصَّاكُمْ به لَعَلَّكُمْ تَتَّقُونَ (این است آنچه خداوند شما را به آن سفارش کرده است، باشد که پرهیزگار شوید) یعنی آن راه‌ها را سپری قرار دهید که میان شما و گام نهادن بر غیر آن راه‌ها حائل شود.\n\n### [فرشتگان، اولیای مستقیمان در زندگی دنیا و آخرت]\n\nو آن قول خداوند است: إِنَّ الَّذِينَ قالُوا (همانا کسانی که گفتند) از هر شریعتی که باشد، اگر زمان و وقت آن را داشته باشد، رَبُّنَا الله ثُمَّ اسْتَقامُوا (پروردگار ما خداست، سپس استقامت ورزیدند) بر راهی که خداوند برایشان تشریع کرده بود تا بر آن گام بردارند، تَتَنَزَّلُ عَلَيْهِمُ الْمَلائِكَةُ (فرشتگان بر آنان نازل می‌شوند). و این تنزل، نبوت عامه است نه نبوت تشریع. فرشتگان بر آنان با بشارت نازل می‌شوند که: أَلَّا تَخافُوا ولا تَحْزَنُوا (نترسید و غمگین نباشید) زیرا شما در راه استقامت هستید. سپس این بشارت‌دهندگان از فرشتگان به آنان می‌گویند: نَحْنُ أَوْلِياؤُكُمْ في الْحَياةِ الدُّنْيا (ما دوستان شما در زندگی دنیا هستیم) یعنی ما در زندگی دنیا شما را یاری می‌کردیم، در زمانی که شیطان با وسوسه خود شما را به انحراف از صراطی که برایتان تشریع شده بود می‌انداخت. ما شما را بر او یاری می‌کردیم با الهامی که در وقت تردید میان دو خاطر (آیا انجام دهد یا ندهد) در خود می‌یافتید. ما بودیم که آن را در مقابل القای دشمن به شما می‌انداختیم. پس ما در آخرت نیز اولیای شما هستیم، با شهادت دادن برای شما که شما الهام ما را می‌پذیرفتید و دشمن خود را با آن دفع می‌کردید. این ولایت آن‌ها در آخرت است. و ولایت آن‌ها همچنین با شفاعت در مورد کسانی است که شیطان در وسوسه‌اش بر آن‌ها غلبه کرده است، در نتیجه بنده از اهل اختلاط (تخلیط) می‌شود. پس فرشتگان برای او شفاعت می‌کنند تا به عمل شیطان مؤاخذه نشود. این معنای قول اوست: وفي الْآخِرَةِ (و در آخرت). و لَكُمْ فِيها ما تَشْتَهِي أَنْفُسُكُمْ (و برای شما در آن است آنچه دل‌هایتان آرزو می‌کند) از شهادت ما برای آن‌ها و شفاعت ما در مورد آن‌ها در این موطن. و لَكُمْ (فِيها) ما تَدَّعُونَ (و برای شما در آن است آنچه طلب می‌کنید) از آسایش (دعة)، نُزُلًا من غَفُورٍ رَحِيمٍ (به عنوان پذیرایی از جانب آمرزنده مهربان) به واسطه شهادت و شفاعت ما، آنجا که خداوند آن را پذیرفت و شما را به واسطه آن سعادتمند ساخت، پس شما را در پناه خود پوشاند و در رحمت خود داخل کرد. این معنای استقامتی است که به نجات مربوط می‌شود.\n\n### [استقامتی که حکمت جاری خداوند در هستی آن را می‌طلبد]\n\nو اما استقامتی که حکمت خداوند آن را می‌طلبد، همان است که در تمام هستی (الکون) جاری است. خداوند متعال در تأیید موسی (علیه السلام) فرمود: أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ (به هر چیزی خلقتش را عطا کرد). پس هر چیزی در استقامتی حاصل است. استقامت گیاه این است که حرکتش واژگون باشد، و استقامت حیوان این است که حرکتش افقی باشد. اگر چنین نباشد، از هیچ یک از آن‌ها بهره‌ای برده نمی‌شود. زیرا اگر حرکت گیاه واژگون نباشد تا آب را با ریشه‌هایش بنوشد، منفعتی نمی‌دهد، چون نیرویی جز این ندارد. و همچنین حیوان، اگر حرکتش به سمت بالا باشد و مانند ما بر دو پا بایستد، فایده سواری و حمل بار سنگین بر پشتش را نمی‌دهد و منفعتی که با حرکت افقی حاصل می‌شود، به دست نمی‌آید. پس استقامت آن، همان چیزی است که برای آن خلق شده است؛ و آن حرکتی است معتبر که منفعت مطلوب با آن حاصل می‌شود. وگرنه، گیاه و حیوان هر دو حرکتی به سمت بالا دارند، و آن قول خداوند است: والنَّخْلَ باسِقاتٍ (و نخل‌های بلند). اگر حرکت نبود، به سمت بالا رشد نمی‌کرد. اما ما حرکت واژگون را به خاطر منفعت مطلوب بر آن غالب دانستیم. پس این را بفهم.\n\n### [حرکت در مرکز، از مرکز و به سوی مرکز]\n\nزیرا متکلمان در این فن، کلام را در حقیقت این حرکات آزاد نکرده‌اند. حرکت در مرکز، مستقیم است، زیرا حقیقت خود را داده است، مانند حرکت زمین و حرکت کُره. حرکت از مرکز، حرکت عروج است، و حرکت به سوی مرکز، حرکت نزول است. پس حرکت نزول، مَلَکی و الهی است، و حرکت عروج، حرکت بشری است. و همه آن‌ها مستقیم هستند. پس جز استقامت وجود ندارد و راهی برای مخالفت نیست. زیرا مخالفت، نزاع است. آیا نمی‌بینی که منع آدم (علیه السلام) تنها در مورد درخت بود؟ یعنی به نزاع نزدیک نشو و طریق انسانیت خود و آنچه شایسته آن هستی را لازم بگیر، و ملک و آنچه شایسته آن است، و حیوان و آنچه شایسته آن است، و هر آنچه غیر توست و آنچه شایسته آن است را رها کن. و با هیچ کس در حقیقتش مزاحمت نکن، زیرا مزاحمت، نزاع و خلاف است. به همین دلیل، وقتی به درخت نزدیک شد، با نهی پروردگارش مخالفت کرد و نزاع‌کننده شد. پس سعادت زودگذر در آن حال از او رفت، اما استقامت نزاع از او نرفت، زیرا حق آن را با مخالفت نهی الهی ادا کرد.\n\n### [کجی کمان، استقامت آن است برای آنچه از آن خواسته شده است]\n\nکجی کمان، استقامت آن است برای آنچه از آن خواسته شده است. پس در هستی (الکون) جز استقامت وجود ندارد، زیرا ایجادکننده‌اش که خداوند متعال است، بر صراط مستقیم است از جهت ربوبیتش. اگر راه‌ها در هم داخل شوند و مخلوط گردند، از استقامت خارج نشده‌اند؛ استقامت اخلاط و استقامت آنچه برای آن موجود شده است. پس آن‌ها در استقامت مطلق هستند که حکم آن در هر هستی جاری است، و آن قول خداوند است: وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ (و همه امور به سوی او بازگردانده می‌شود)... وهُوَ عَلى‏ صِراطٍ مُسْتَقِيمٍ (و او بر صراط مستقیم است)... فَاعْبُدْهُ (پس او را بپرست) یعنی در هر راهی که تو را در آن قرار می‌دهد، برای او تذلل کن، نه برای غیر او، زیرا غیر او عدم است و هر کس قصد عدم کند، دستانش به چیزی دست نمی‌یابد. سپس با ضمیر غایب در قولش: فَاعْبُدْهُ (پس او را بپرست) آمده است، یعنی نگو تو درک‌شونده هستی، زیرا دیده‌ها او را درک نمی‌کنند، چرا که اگر غیب درک می‌شد، دیگر غیب نبود. پس ذاتی منزه و مجهول را بپرست که از او جز نسبت خودت به او از طریق افتقار (نیاز) نمی‌دانی. و به همین دلیل کامل کرد و فرمود: وتَوَكَّلْ عَلَيْهِ (و بر او توکل کن) یعنی بر او اعتماد کن. وما رَبُّكَ بِغافِلٍ عَمَّا تَعْمَلُونَ (و پروردگار تو از آنچه انجام می‌دهید غافل نیست). با این سخن، مدعیان در این مقام را که این صفت و حال آن‌ها نیست و علم آن به آن‌ها نرسیده است، قطع کرد. پس استقامت در تمام اعیان (الأعیان) از جواهر و اعراض و احوال و اقوال جاری است، چنانکه فرمود: وأَقْوَمُ قِيلًا (و گفتاری راست‌تر). و این صفتی الهی و کونی است. خداوند ما را از کسانی قرار دهد که از استقامت خود منحرف نشدند مگر به واسطه استقامت خود. آمین به عزت او.\n\n### [استقامت به زبان عامه اهل الله]\n\nو اما استقامت به زبان عامه اهل الله (اهل معرفت)، این است که بگوییم استقامت در هستی (الکون) عام است، همان‌طور که مقرر کردیم. پس هیچ راهی نیست مگر اینکه مستقیم است، زیرا هیچ راهی نیست مگر اینکه به سوی خداوند می‌رساند. اما خداوند متعال به پیامبرش و به ما فرمود: فَاسْتَقِمْ كَما أُمِرْتَ (پس همان‌گونه که امر شده‌ای استقامت کن). او را به استقامت مطلق خطاب نکرد، زیرا مقرر شده است که إِلَى الله تَصِيرُ الْأُمُورُ (امور به سوی خدا بازمی‌گردد) و او غایت هر راهی است. اما مهم این است که به کدام اسم از اسماء الهی می‌رسی و بازمی‌گردی، تا اثر آن اسم از سعادت و نعمت یا شقاوت و عذاب در واصل به آن نفوذ کند. پس معنای استقامت، حرکات و سکنات بر طریقه (الطريقة) مشروع است.\n\n### [صراط مستقیم: سر آن، منازل آن، احوال آن، احکام آن]\n\nو صراط مستقیم، همان شریعت الهی است. و ایمان به خدا سر این راه است، و شعبه‌های ایمان، منازل این راه هستند که میان آغاز و غایت آن قرار دارند، و آنچه میان دو منزل است، احوال و احکام آن است. و چون صراط مستقیم چیزی بود که فرشتگان (که از آن‌ها به ارواح علوی تعبیر می‌شود) و رسولان از جانب خدا به سوی برگزیدگان از بندگانش که انبیا و رسولان نامیده می‌شوند، با آن نازل شدند، خداوند میان آن‌ها و کسانی که فرشتگان بر آن‌ها نازل می‌شوند، نسبتی جامع قرار داد. به واسطه آن نسبت‌ها، القاء از جانب فرشتگان صورت می‌گیرد و به واسطه آن‌ها، پذیرش از جانب انبیا حاصل می‌شود. پس هر کس بر آنچه بر این نام‌بردگان از بشر (انبیا و رسولان) نازل شده است، استقامت ورزد، پس از آنکه به آن‌ها ایمان آورد که رسولان خدا هستند و آنچه آورده‌اند را از رسولان دیگری (ملکی) گرفته‌اند، فرشتگان نیز بر آن‌ها با بشارت نازل می‌شوند و برای کسی که این صفت اوست، همنشین خواهند بود.\n\n### [ارواح علوی و اسمی که از حضرت الهی متولی آن‌هاست]\n\nو چون این ارواح علوی (الأرواح العلوية) به ذات خود زنده بودند، اسمی که از حضرت الهی (الحضرة الإلهية) متولی آن‌ها بود، اسم «الحی» (زنده) بود. همان‌طور که متولی از اسماء الهی برای کسی که حیاتش عرضی و اکتسابی است، اسم «المحیی» (زنده‌کننده) است. پس فرشته هرگز احیا را تعقل نکرده است، برخلاف بشر که مرده بودند و خداوند آن‌ها را زنده کرد، سپس می‌میراند و دوباره زنده می‌کند. و برای اهل این حیات عرضی از عناصر، رکن آب است. خداوند متعال فرمود: وكانَ عَرْشُهُ عَلَى الْماءِ (و عرش او بر آب بود) و فرمود: وجَعَلْنا من الْماءِ كُلَّ شَيْءٍ حَيٍّ (و هر چیز زنده‌ای را از آب قرار دادیم). پس آب اصل عناصر و اسطقسات (عناصر اربعه) است. و عرش، مُلک است. و مُلک کامل نشد مگر در عالم استحاله (دگرگونی)، که همان عالم ارکان است و اصل آن آب است. و اگر عالم استحاله نبود، خداوند خود را به اینکه هر روز در شأنی است، وصف نمی‌کرد. پس عالم دگرگون می‌شود و حق (الحق) در شأنی است که وجود اعیان (الأعیان) آن‌ها را حفظ می‌کند و آن‌ها را با آنچه بقای عینشان به آن است، یعنی ایجاد، مدد می‌رساند. پس این همان شأنی است که حق بر آن است و غیر از عالم استحاله این حقیقت را ندارد.\n\n### [هر کس بر طریقت (الطريقة) استقامت ورزد، خداوند او را از آب حقیقت (الحقيقة) سیراب می‌کند]\n\nو چون آب اصل هر موجود زنده‌ای شد که حیاتش عرضی است، هر کس استقامت ورزد، خداوند او را آب حیات می‌نوشاند. اگر نوشاندن، نوشاندن عنایت باشد، مانند انبیا و رسولان، هر که را خدا بخواهد با آن زنده می‌کند. و اگر نوشاندن، نوشاندن ابتلا باشد، به دلیل ادعایی که در آن است، به حکم آنچه از نوشاندن او اراده شده است، خواهد بود. خداوند متعال فرمود: وأَنْ لَوِ اسْتَقامُوا عَلَى الطَّرِيقَةِ لَأَسْقَيْناهُمْ ماءً غَدَقاً لِنَفْتِنَهُمْ فِيهِ (و اگر بر طریقت استقامت ورزند، آبی فراوان به آن‌ها می‌نوشانیم تا آن‌ها را در آن بیازماییم). پس این نوشاندن ابتلا است.\n\n### [استقامت، برخاستن از خواب غفلت‌ها و قیام به حقوق واجبات است]\n\nو استقامت تنها از مکلف در قیام به فرائض الهی بر او خواسته شده است. زیرا مکلف از جهت حقیقت، در آستانه درگاه سرورش افتاده و رها شده است، و تصاریف تقدیرات و آنچه خداوند در حرکات این ادوار (کوار) از تنوع اطوار میان محو و اثبات برای ظهور آیات پی در پی، در شب و روز به ودیعه نهاده است، بر او جاری می‌شود. و خداوند مکلف را محل حیات و حرکات قرار داده و از او خواسته است که از آن خواب برخیزد به آنچه او را به قیام به حق خود مکلف کرده است. پس سخت‌ترین چیزی که بر عارفان می‌گذرد، امر خداوند به استقامت است، و آن قول خداوند متعال است: فَاسْتَقِمْ كَما أُمِرْتَ ومَنْ تابَ مَعَكَ ولا تَطْغَوْا (پس همان‌گونه که امر شده‌ای استقامت کن و هر کس با تو توبه کرده است، و طغیان نکنید). یعنی به واسطه آنچه در نفوس خود از خلقتتان بر صورت الهی می‌یابید، از امر او فراتر نروید، تا بگویید کسی مانند ما نباید مأمور باشد. پس عالمان به خدا نمی‌دانند که آیا امر خداوند با اراده او در مورد آن‌ها موافق است که امر او را امتثال کنند یا با آن مخالفت ورزند. به همین دلیل امر خداوند بر آن‌ها دشوار و سخت آمد، و آن قول پیامبر (علیه السلام) است: شيبتني هود (سوره هود مرا پیر کرد). زیرا آن سوره‌ای است که در آن فَاسْتَقِمْ كَما أُمِرْتَ (پس همان‌گونه که امر شده‌ای استقامت کن) و خواهران آن که شامل این آیه یا معنای آن هستند، نازل شده است. پس آن‌ها از این جهت در خطر هستند.\n\n### [استقامت، نشاطی است که حدودش منضبط نیست و راهی است که مراتبش محدود نمی‌شود]\n\nو راه استقامت، مراتبش محدود نمی‌شود و منضبط نیست، چنانکه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: استقيموا ولن تحصوا (استقامت ورزید و هرگز نمی‌توانید آن را شمارش کنید). یعنی راه‌های استقامت را. و آنچه از آن شمارش کرده‌اید، هرگز نمی‌توانید اجر و خیری را که در آن برای شماست، شمارش کنید. و ظاهر این است که منظور او این بوده که راه‌های استقامت را شمارش نخواهید کرد، زیرا آن‌ها بسیارند و هیچ یک از شما نمی‌تواند آن‌ها را به طور معین در بر گیرد. و به همین دلیل این سخن را با این قول دنبال کرد: واعملوا وخير أعمالكم الصلاة (و عمل کنید و بهترین اعمال شما نماز است). و چون نتوانستید راه‌های استقامت را شمارش کنید، پس بهترین آن‌ها را بگیرید.\n\n### [اسم الهی قیوم، برادر اسم حی است که ملازم اوست]\n\nو اسم «القیوم» (پاینده) به واسطه این عبادات به اسم «الحی» (زنده) و «المحیی» (زنده‌کننده) می‌نگرد. و به همین دلیل به مکلف گفته شد: وأَقِيمُوا الصَّلاةَ (و نماز را برپا دارید) و أَقِيمُوا الْوَزْنَ (و وزن را برپا دارید). پس قیوم (القیوم) برادر حی (الحی) است که ملازم اوست. خداوند متعال فرمود: الله لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ (الله، هیچ معبودی جز او نیست، زنده و پاینده). و فرمود: الم الله لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ (الم، الله، هیچ معبودی جز او نیست، زنده و پاینده). و فرمود: وعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ (و چهره‌ها در برابر حی قیوم خضوع کردند). پس اسم حی (الحی) نیامده مگر اینکه قیوم (القیوم) همراه اوست. پس در این باب تدبر کن، زیرا حاوی اسرار الهی است."
  },
  "page_count": 4
}