{
  "id": 348,
  "title": {
    "ar": "الباب الثامن والأربعون وثلاثمائة في معرفة منزل سرين من أسرار قلب الجمع والوجود",
    "en": "Chapter Three Hundred and Forty-Eight, Concerning the Gnosis of the Station of Two Secrets from the Mysteries of the Heart of Unification and Being (قلب الجمع والوجود).",
    "ur": "باب تین سو اڑتالیس: قلبِ جامعیت (قلب الجمع) اور ہستی (الوجود) کے اسرار میں سے دو رازوں کے مقام کی معرفت کے بیان میں۔",
    "fa": "باب سیصد و چهل و هشتم در معرفت منزل دو سرّ از اسرار قلب جمع و هستی (الوجود)"
  },
  "content": {
    "ar": "## «الباب الثامن والأربعون وثلاثمائة في معرفة منزل سرين من أسرار قلب الجمع والوجود»\n\n\n> إن قيل هل في وجود الكون أوسع من *** من رحمة الله فقل قلب إذا كانا\n\n\n> بيت الإله لإيمان يقوم به *** مع التورع والتقوى إذا زانا\n\n\n> يحيط بالحق علما عين صورته *** وهو العزيز الذي في عينه هانا\n\n\n> القلب ملكي والسكنى لخالقه *** عمري ورقبى وإيمانا وإحسانا\n\n\n### [إن الأنصار كلمات الله نصر الله بهم دينه وأظهره‏]\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إني لأجد نفس الرحمن يأتيني من قبل اليمن فنفس الله عنه بالأنصار\n\n\nفكانت الأنصار كلمات الله نصر الله بهم دينه وأظهره وهذا المنزل هو منزل ذلك التنفس الرحماني وهذا المنزل عنه ظهرت جميع المنازل الإلهية كلها في العالم الذي هو كل ما سوى الله تعالى علوا وسفلا روحا وجسما معنى وحسا ظاهرا وباطنا فمنه ظهرت المقولات العشر وجاء في الخبر النبوي رائحة لما قلناه وله وجوه إلى كل جنس ونوع وشخص من العالم لا تكون لجنس آخر ولا لنوع آخر ولا لشخص آخر ولهذا المنزل صورة وروح وإمداد إلهي من حيث ما نسب الحق إلى نفسه من الصورة ولكن من باطن الصورة وحكم هذا الإمداد في الظاهر والباطن من صورة هذا المنزل لكنه في الباطن أتم ولهذا أخر الاسم الباطن عن الأول والآخر والظاهر لما عبر عن هذه النعوت الإلهية وذلك أن الأمر الإلهي في التالي أتم منه وأكمل‏\nمنه في المتلو الذي هو قبله ففيه ما في الأول وزيادة هكذا هي كلمات الوجود الإلهية والآخر يتضمن ما في الأول والظاهر يتضمن ما في الآخر والأول والباطن يتضمن ما في الظاهر والآخر والأول ولو جاء شي‏ء بعد الباطن لتضمن الباطن وما قبله ولكن الحصر منع أن يكون سوى هذه الأربعة ولا خامس لها إلا هويته تعالى وما ثم في العالم حكم إلا من هذه الأربعة وعلى صورة هذه الأربعة ظهر عالم الأرواح وعالم الأجسام وما ثم عالم سوى هذين فمن الإلهيات علم وإرادة وقدرة وقول عنها ظهر عالم الأرواح الخارج عن الطبيعة والطبيعة ثم أظهر عن هذه الأربعة الإلهية الطبيعة على أربع وعنها أظهر عالم الأجسام كثيفها ولطيفها كما أظهر عن هذه الأربع الإلهية من عالم التدوين والتسطير عقلا ونفسا وطبيعة وهيولى قبل ظهور الأجسام وأظهر الأركان أربعة وهي النار والهواء والماء والتراب وأظهر النشأة الحيوانية على أربعة أخلاط وجعل لهذه الأخلاط أربع قوى جاذبة وماسكة وهاضمة ودافعة فأقام الوجود على التربيع وجعله لنفسه كالبيت القائم على أربعة أركان فإنه الأول والآخر والظاهر والباطن فللباطن ركن الحجر الأسود فإنه يمين الله في الأرض المقبل على جهة البيعة لله فالعين تقع على الحجر والبصيرة تقع على اليمين فاليمين باطن للحجر غير ظاهر للبصر فيشرف ركن الحجر على سائر الأركان فضم حكم الباطن حكم الثلاثة النعوت التي قبل الباطن وهو المخصوص بهذا المنزل ولب هذا المنزل هو الصورة الإلهية التي منها يكون الإمداد له لب تلك الصورة وهو روحها وهو لب اللب وهو خزانة الإمداد لهذا المنزل ولهذا المنزل التحكم في العالم كله كَمِشْكاةٍ فِيها مِصْباحٌ الْمِصْباحُ في زُجاجَةٍ الزجاجة يُوقَدُ من شَجَرَةٍ هويته فهي لا شَرْقِيَّةٍ ولا غَرْبِيَّةٍ لا تقبل الجهات عن هذه الزيتونة يكون الزيت وهو المادة لظهور هذا النور فهذه أربعة مشكاة وزجاجة ومصباح وزيت والخامس الهوية وهو الزيتونة المنزهة عن الجهات وكني عنها بالشجرة من التشاجر وهو التضاد لما تحمله هذه الهوية من الأسماء المتقابلة كالمعز والمذل والضار والنافع فانظر ما أكمل العبارات الإلهية في الإخبار بما هو الأمر عليه فمن دخل هذا المنزل وفاته شي‏ء من العالم وحقائقه فما دخله وإنما خيل الشيطان له أو النفس أنه دخله وما قَتَلُوهُ وما صَلَبُوهُ ولكِنْ شُبِّهَ لَهُمْ إذ حضرة الخيال تنشئ كل صورة وكثير من الناس يدخلون هذه الحضرة الخيالية ويشاهدون ما تجلى لهم من الصور فيزعمون أنهم شاهدوا الوجود الثابت العين على ما هو عليه ولم يكن سوى ما صوره الخيال فمن يلي بمثل هذا فليتربص قليلا فإن كان ما يشاهده روحا ثابت العين في الوجود أو محسوسا في العين فإنه يثبت ولا يتغير وإن كان خيالا فلا يثبت ويسرع إليه التغير في الحال ويرى صورة التغير فيه ويعلم أن الذي ظهر له بالتغير هو عين الأول ويرى بعضهم نفسه في صورتين وأكثر ويعلم أنه هو فبهذا يفرق بين الصور الثابتة في عينها حسا وروحا وبين الصور الخيالية وهذا ميزانها لمن لا معرفة له فقد نبهتك ونصحتك فلا تغفل عن هذا الميزان إن كنت من أهل الكشف وما جعل الله النوم في العالم الحيواني إلا لمشاهدة حضرة الخيال في العموم فيعلم إن ثم عالما آخر يشبه العالم الحسي ونبهه بسرعة استحالة تلك الصور الخيالية للنائمين من العقلاء على إن في العالم الحسي والكون الثابت استحالات مع الأنفاس لكن لا تدركها الأبصار ولا الحواس إلا في الكلام خاصة وفي الحركات وما عدا هذين الصنفين فلا تدركه صورة الاستحالات والتغيرات فيها إلا بالبصيرة وهو الكشف أو بالفكر الصحيح في بعض هذه الصور لا في كلها فإن الفكر يقصر عن ذلك وأصل ذلك كله أعني أصل التغير من صورة إلى مثلها أو خلافها في الخيال أو في الحس أو حيثما كان في العالم فإنه كله لا يزال يتغير أبد الآبدين إلى غير نهاية لتغير الأصل الذي يمده وهو التحول الإلهي في الصور الوارد في الصحيح فمن هناك ظهر في المعاني والصور\n\n\n> فمن معنى إلى معنى *** ومن صور إلى صور\n\n\nوهو قوله تعالى كُلَّ يَوْمٍ هُوَ في شَأْنٍ وهو ما يحدثه من التغييرات في الأكوان فلا بد أن يظهر في كل صورة تغيرها بحكم لا يكون إلا لذلك المتغير فإن فهمت فقد أبنت لك الأمر على ما هو عليه ف إِنَّ في ذلِكَ لَذِكْرى‏ أي في تغيير العالم ذكرى بتغير الأصل لِمَنْ كانَ لَهُ قَلْبٌ فإن القلب له التقليب من حال إلى حال وبه سمي قلبا فمن فسر القلب بالعقل فلا معرفة له بالحقائق فإن العقل تقييد من العقال فإن أراد بالعقل الذي هو التقييد ما نريده نحن أي ما هو مقيد بالتقليب فلا يبرح‏\nيتقلب فهو صحيح كما نقول بالتمكين في التلوين فلا يزال يتلون وما كل أحد يشعر بذلك ولما علمنا أن من صفة الدهر التحول القلب والله هو الدهر وثبت أنه يتحول في الصور وأنه كل يوم في شأن واليوم قدر النفس فذلك من اسمه الدهر لا من اسم آخر إن عقلت فلو راقب الإنسان قلبه لرأى أنه لا يبقى على حالة واحدة فيعلم إن الأصل لو لم يكن بهذه المثابة لم يكن لهذا التقلب مستند فإنه بين أصبعين من أصابع خالقه وهو الرحمن فتقليب الأصابع للقلب بغير حال الإصبعين لتغير ما يريد أن يقلب القلب فيه ف\n\n\nمن عرف نفسه عرف ربه‏\n\n\nوفي حديث الأصابع بشارة إلهية حيث أضافهما إلى الرحمن فلا يقلبه إلا من رحمة إلى رحمة وإن كان في أنواع التقليب بلاء ففي طيه رحمة غائبة عنه يعرفها الحق فإن الإصبعين أصبعا الرحمن فافهم فإنك إذا علمت ما ذكرناه علمت من هو قلب الوجود الذي يمد عالم صورته التي هو لها قلب وأجزاؤها كلها وإنه هو قلب الجمع وهو ما جمعته هذه الصورة الوجودية من الحقائق الظاهرة والباطنة فلما كان الله كُلَّ يَوْمٍ هُوَ في شَأْنٍ كان تقليب العالم الذي هو صورة هذا القالب من حال إلى حال مع الأنفاس فلا يثبت العالم قط على حال واحدة زمانا فردا لأن الله خلاق على الدوام ولو بقي العالم على حالة واحدة زمانين لا تصف بالغنى عن الله ولكن الناس في لَبْسٍ من خَلْقٍ جَدِيدٍ فسبحان من أعطى أهل الكشف والوجود التنزه في تقليب الأحوال والمشاهدة لمن هو كل يوم في شأن والله هو الدهر فلا فراغ لحكم هذا الدهر في العالم الأكبر والأصغر الذي هو الإنسان وهو أحد المعلومات الأربعة التي لها التأثير فالمعلوم الأول لنا الإنسان والمعلوم الثاني العالم الأكبر الذي هو صورة ظاهر العالم الإنساني والإنسان الذي هو قلب هذه الصورة ولا أريد به إلا الكامل صاحب المرتبة وهو المعلوم الثالث والمعلوم الرابع حقيقة الحقائق التي لها الحكم في القدم والحدوث وما ثم معلوم خامس له أثر سوى ما ذكرناه ويتشعب من هذا المنزل شعب الايمان وذلك بضع وسبعون شعبة أدناها إماطة الأذى عن الطريق وأرفعها قول لا إله إلا الله وما بينهما من الشعب وهذا المنزل منزل الايمان ومنه ظهر الايمان في قلب المؤمن والخاص به الاسم المؤمن من الأسماء الإلهية فمن هنا شرع المؤمن شعب الايمان وأبانها ومن هذا المنزل أخذت أمة محمد أعمارها فغاية عمر هذه الأمة المحمدية سبعون سنة لا تزيد عليها شيئا فإن زاد فما هو محمدي وإنما هو وارث لمن شاء الله من الأنبياء من آدم إلى خالد بن سنان فيطول عمره طول من ورثه ولهذا\n\n\nقال النبي صَلَّى اللهُ عَليهِ وسَلَّم في أعمار أمته إنها ما بين الستين إلى السبعين‏\n\n\nفجعل السبعين الغاية لعمر أمته فعلمنا أنه ما يريد بأمته إلا المحمديين الذين خصهم الله برتبة ما خص الله بها نبيه من الأحكام والمراتب على جميع الأنبياء إذ كنا خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ وكل حكم ورتبة كانت لنبي قبله وإن كانت له ووقع له فيها الاشتراك فلم يخلص له وحده وليس له الشرف الكامل إلا بما خلص له دون غيره فأمته مثله فمن كان عند انفصاله عن الدنيا أو في حاله على شرع مشترك من هذه الأمة نسبناه إلى من ظهر به أولا قبل ظهور محمد صَلَّى اللهُ عَليهِ وسَلَّم ليظهر الفرق بين الأمرين ولتعرف منزلة الشخصين وإن كان ما أخذه إلا من تقرير محمد صَلَّى اللهُ عَليهِ وسَلَّم فإنه من أمته ولكن حكم الاشتراك يتميز عن حكم الاختصاص ومات صَلَّى اللهُ عَليهِ وسَلَّم وله ثلاث وستون سنة والذي يزيد على السبعين سنة بالغا ما بلغ وإن كان من أمته وممن حصل له الاختصاص المحمدي كله فإنه لا يقبض حين يقبض إلا في الشرع المشترك وما هو نقص به فإنه قد حصل حكم الاختصاص ولكن خروجه عن السبعين التي جعلها رسول الله صَلَّى اللهُ عَليهِ وسَلَّم غالب غاية عمر أمته المقبوضين في الحكم الاختصاصي جعله أن يفرق بينه وبين غيره من الأمة وهذا من العلوم التي لا تدرك بالرأي والقياس وإنما ذلك من علوم الوهب الإلهي وكذا ذكر أن كل واحد من الخلفاء الأربعة ما مات حتى بلغ ثلاثا وستين سنة إثباتا أنهم قبضوا في الاختصاص المحمدي لا في حكم الشرع المشترك فمن هذا المنزل تعين هؤلاء الأربعة من غيرهم وتعينت العشرة أيضا من هذا المنزل الذين هم أبو بكر وعمر وعثمان وعلي وسعد وسعيد وطلحة والزبير وعبد الرحمن بن عوف وأبو عبيدة بن الجراح فهذا منزلهم الذي منه عينهم رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وشهد لهم بالجنة في مجلس واحد بأسمائهم فإن المشهود لهم بالجنة كثيرون لكن ليس في مجلس واحد ومقيدون بصفة خاصة كالسبعين ألفا الذين يَدْخُلُونَ الْجَنَّةَ ... بِغَيْرِ حِسابٍ وعين منهم عكاشة بن محصن ونبه بقوله بِغَيْرِ حِسابٍ أي لم يكن ذلك في حسابهم‏\nولا تخيلوه فبدا لهم خير من الله لم يكونوا يحتسبونه وهم الذين لا يسترقون ولا يكتوون ولا يتطيرون وعَلى‏ رَبِّهِمْ يَتَوَكَّلُونَ فقوله لا يسترقون أي لا يستدعون الرقية لإزالة ألم يصيبهم ولا يرقون أحدا من ألم يصيبه وجاء بالاستفعال للمبالغة وإنما رقى النبي صَلَّى اللهُ عَليهِ وسَلَّم واستعمل الطب في نفسه في مرضه لأنه يتأسى به فيتأسى به الضعيف والقوي فإنه رحمة للعالم وهكذا جميع الرسل فما حكمهم حكم أممهم فلا يقدح ذلك في مقامهم فلهم المقام المجهول حيث يظهرون لأممهم بصورة القوة والضعف فلا يعرف أحد لما ذا ينسبهم من المقامات وقوله ولا يتطيرون فإن الطائر هو الحظ فهم خارجون عن حظوظ نفوسهم مشتغلون بما كلفهم الله به من الأعمال وفاء لما تستحقه الربوبية عليهم لا يبتغون بذلك حظا لنفوسهم من الأجر الذي وعد الله به على ما هم عليه من الأعمال فلم يبعثهم على العمل ما نيط به من الأجر ولكن ما ذكرناه من وفاء المقام فهذا معنى لا يتطيرون أي لا يعملون على الحظوظ وقوله ولا يكتوون فإن الاكتواء لا يكون إلا بالنار وقد عصمهم الله أن تمسهم النار فيجدون في نفوسهم أنهم لا يكتوون وتلك عصمة إلهية من حيث لا يشعرون وقوله وعَلى‏ رَبِّهِمْ يَتَوَكَّلُونَ أي يتخذونه وكيلا فيتكلون عليه اتكال الموكل على الوكيل وهي معرفة وسطي جاءتهم من القصد الثاني فرأوا إن الله خلق الأشياء لهم وخلقهم له فاتخذوه وكيلا فيما خلق لهم ليتفرغوا إلى ما خلقوا له وإنما قلنا مرتبة وسطي لأن فوقها المرتبة العالية وهو القصد الأول فإن الله ما خلق شيئا من العالم كله إلا له ليسبحه بحمده وننتفع نحن بحكم العناية والتبعية والقصد الثاني هو هذا لأنه لما سوانا وسخر لنا ما في السَّماواتِ وما في الْأَرْضِ جَمِيعاً مِنْهُ قصدان في الخلق في العالم الإنساني وغير الإنساني من يتوكل عليه في أمره كله لأنه مؤمن بأن لله تعالى في كل شي‏ء وجها ولا يقول به إلا المؤمن إذ كان غير المؤمن من الناس خاصة من يقول إن الله ما وجد عنه بطريق العلية إلا واحد ولا علم له بجزئيات العالم على التفصيل إلا بالعلم الكلي الذي يندرج فيه جميع العلم بالجزئيات فلهذا جعل التوكل في المؤمنين قال تعالى وعَلَى الله فَتَوَكَّلُوا إِنْ كُنْتُمْ مُؤْمِنِينَ فجعل التوكل علامة على وجود الايمان في قلب العبد ولم يتخذه وكيلا إلا طائفة مخصوصة من المتوكلين المؤمنين الذين امتثلوا أمر الله في ذلك في قوله فَاتَّخِذْهُ وَكِيلًا فيتخيل من لا علم له بالوجود في الأشياء إنك صاحب المال فاتخذته وكيلا سبحانه فيما هو ملك لك وأن إضافة الأموال إليك بقوله أموالكم إضافة ملك وما علم إن تلك الإضافة إضافة استحقاق كسرج الدابة وباب الدار لا إضافة ملك والذي نراه نحن والأكابر إن الله قال لنا وأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ فما هو لنا فوكلناه واتخذناه وكيلا في الإنفاق الذي هو ملكنا لعلمنا بعلم الوكيل بالمصالح ومواضع الإنفاق التي لا يدخلها حكم الإسراف ولا التقتير فتولى الله الإنفاق علينا بأن ألهمنا حيث ننفق ومتى ننفق فإن النفقة على أيدينا تظهر فيدنا يد الوكيل في الإنفاق فنحن معصومون في الإنفاق لمعرفتنا بالوجوه ولأن يدنا يد حق فإنها يد الوكيل وهذا لا يعلم إلا بالكشف الإلهي فهم بهذه المثابة في التوكل وما يشعرون بذلك لأنه قال بغير حساب فهم على غير بصيرة وأفعالهم أفعال أهل البصائر عناية إلهية يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ والله ذُو الْفَضْلِ الْعَظِيمِ والفضل الزيادة\n\n\n### [أن العالم مربوط وجوده بالواجب الوجود لنفسه‏]\n\n\nواعلم أن العالم لما كان أصله أن يكون مربوطا وجوده بالواجب الوجود لنفسه كان مربوطا بعضه ببعض فيتسلسل الأمر فيه إذا شرع الإنسان ينظر في العلم به فيخرجه من شي‏ء إلى شي‏ء بحكم الارتباط الذي فيه ولا يكون هذا إلا في علم أهل الله خاصة فلا يجري على قانون العلماء الذين هم علماء الرسوم والكون فقانونهم ارتباط العالم بعضه ببعض فلهذا تراهم يخرجون من شي‏ء إلى شي‏ء وإن كان يراه عالم الرسوم غير مناسب وهذا هو علم الله ومعلوم أن المناسبة ثم ولكن في غاية الخفاء مثل قوله تعالى حافِظُوا عَلَى الصَّلَواتِ والصَّلاةِ الْوُسْطى‏ وقُومُوا لِلَّهِ قانِتِينَ فجاء بآية الصلاة وقبلها آيات النكاح والطلاق وبعدها آيات الوفاة والوصية وغير ذلك مما لا مناسبة في الظاهر بينهما وبين الصلاة وأن آية الصلاة لو زالت من هذا الموضع واتصلت الآية التي بعدها بالآيات التي قبلها لظهر التناسب لكل ذي عينين فهكذا علم أولياء الله تعالى (سئل) الجنيد عن التوحيد (فأجاب) السائل بأمر فقال له لم أفهمه أعد علي فأجابه بأمر آخر فقال السائل لم أفهمه فأجابه بأمر آخر ثم قال له هكذا هو الأمر فقال أمله علي فقال إن كنت أجريه فأنا أمليه يقول إني لا أنطق عن هوى بل ذلك علم الله لا علمي فمن علم القرآن وتحقق به علم علم أهل الله وأنه لا يدخل تحت فصول منحصرة ولا يجري على‏\nقانون منطقي ولا يحكم عليه ميزان فإنه ميزان كل ميزان فلهذا المنزل من عالم الأجسام فلك الشمس من الأفلاك فسبعة فوقه منها ثلاث سماوات وفلك المنزل والأطلس الذي هو فلك البروج والكرسي والعرش المحيط وهو نهاية عالم الأجسام وتحته أيضا سبعة ثلاث سماوات وكرات الأثير والهواء والماء والأرض وبقطعها في الفلك تظهر فصول السنة وهي أربعة فصول لوجود التربيع الذي ذكرناه فإن البروج التي هي التقديرات في الفلك الأطلس مربعة قد جعلها الله على أربع مراتب نارية وترابية وهوائية ومائية لحكم الأربعة الإلهية والأربعة الطبيعية ولكل فصل ثلاثة أحكام حكمان للطرفين وحكم للوسط وبينهما أحكام في كل حركة ودقيقة وثانية وثالثة إلى ما لا يتناهى التقسيم فيها وجعل نجم السماء الثانية من جهتنا ممتزجا وهو الكاتب ولهذا أسكنه عيسى عليه السلام لأنه ممتزج من العالمين فإنه ظهر بين ملك وبشر وهما جبريل ومريم فهو روح عن روح وبشر عن بشر ولم يجعل ذلك في غيره من هذا النوع كما لم يجعل شيئا من الجواري الخنس على صورة الكاتب فهو السادس من هناك ليحصل له شرف رتبة قوله ولا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ وهو الثاني من جهتنا لأن الثاني هو الباء وهو المبدع الأول بفتح الدال الظاهر عن الإنسان الذي هو ظل الصورة الإلهية الذي لم يزل فذلك هو الأول لا أولية الحق لأن أولية الحق لا تقبل الثاني فإن الواحد ليس بعدد وأول العدد الاثنان فظهر في السنة الامتزاج بظهور الفصول‏\n\n\n### [إن الله هو الدهر]\n\n\nواعلم أن الله لما أعلمنا أنه هو الدهر ذكر لنا سبحانه أن له أياما من كونه دهرا وهي أيام الله فعين هذه الأيام أحكام أسمائه تعالى في العالم فلكل اسم أيام وهي زمان حكم ذلك الاسم والكل أيام الله وتفاصيل الدهر بالحكم في العالم وهذه الأيام تتوالج ويدخل بعضها في بعض ويغشى بعضها بعضا وهو ما نراه في العالم من اختلاف الأحكام في الزمان الواحد فذلك لتوالجها وغشيانها وتقليبها وتكررها ولهذه الأيام الإلهية ليل ونهار فليلها غيب وهو ما غاب عنا منها وهو عين حكمها في الأرواح العلوية الكائنة فوق الطبيعة والأرواح المهيمة ونهارها شهادة وهو عين حكمها في الأجسام الطبيعية إلى آخر جسم عنصري وهي ما تحت الطبيعة وسدفة هذا اليوم عين حكم هذه الأيام في الأرواح المسخرة التي تحت الطبيعة وهم عمار السموات والأرض وما بينهما وهم الصافون والتالون والمسبحون وهم على مقامات معلومة فمنهم الزاجرات والمرسلات والمقسمات والمنقيات والنازعات والناشطات والمدبرات وغير ذلك مثل السائحين والعارجين والكاتبين والراقبين كل هؤلاء تحت حكم أيام الله من حيث سدف هذه الأيام فعن غشيان نهار هذه الأيام ليلها وجدت الأرواح التي فوق الطبيعة وعن غشيان ليل هذه الأيام نهارها وجدت الأجسام التي دون الطبيعة وعن توالج ليلها بنهارها فليس بنهار خالص لحكم الليل ومشاركته وليس بليل خالص لحكم النهار ومشاركته وهذا الحال لهذه الأيام تسمى سدفا وجد عن هذا التوالج الأرواح التي دون الطبيعة ولما قسم الله أيامه هذه الأقسام جعل ليلها ثلاثة أقسام ونهارها ثلاثة أقسام فهو سبحانه ينزل لعباده في الثلث الأخير من ليل أيامه وهو تجليه فيه للأرواح الطبيعية المدبرة للأجسام العنصرية والثلث الوسط يتجلى فيه للأرواح المسخرة والثلث الأول يتجلى فيه للأرواح المهيمنة وقسم نهار هذه الأيام إلى ثلاثة أقسام يتجلى في كل قسم إلى عالم الأجسام من أجل ما هي مسبحة بحمد الله دائما ففي الثلث الأول يتجلى للأجسام اللطيفة التي لا تدركها الأبصار وفي الثلث الوسط يتجلى للأجسام الشفافة وفي الثلث الأخير يتجلى للأجسام الكثيفة ولو لا هذا التجلي ما صحت لهم المعرفة بمن يسبحونه فإن المسبح لا بد أن يكون له معرفة بمن يسبحه والمعرفة بالله لا يصح أن تكون عن فكر ولا عن خبر وإنما تكون عن تجليه لكل مسبح فمنهم العالم بذلك ومنهم من لا يعلم ذلك ولا يعلم أنه سبح عن معرفة تجل وذلك ليس إلا لبعض الثقلين وما عدا هذين فهم عارفون بمن تجلى لهم مسبحون له على الشهود أجساما عموما وأرواحا خصوصا فكل من ليس له قوة التوصيل لما يشهده فعنده العلم بمن تجلى له وكذلك من له قوة التوصيل غير أنه أمين لا يتكلم إلا عن أمر إلهي فذلك عنده العلم بمن تجلى له ومن علم إن عنده قوة التوصيل وهو نمام ينم بما شهده وسمعه وليس بأمين ينتظر أمر صاحب الأمانة فإنه لا يعلمه الحق في تجليه أنه هو وهم المنكرون له إذا تجلى لهم في الدنيا والآخرة جعلنا الله من الأمناء العالمين بمن تجلى لهم فإن قلت فالليل والنهار في اليوم ما يحدثه إلا طلوع الشمس وغروبها فما الشمس التي أظهرت الليل والنهار في أيام الله المسمى دهرا قلنا اسمه النور الذي‏\nذكر أنه نور السموات والأرض فله الطلوع والغروب علينا من خلف حجاب الإنسان المثلى الذي ذكرنا أنه ظله المخلوق على صورته الأزلي الحكم الذي نفى عنه المثلية وأثبت عين وجوده في قوله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ بكاف الصفة فيسمى ليله باطنا ونهاره ظاهرا فهو الباطن من حيث ليله وهو الظاهر من حيث نوره وذلك المثل الإنساني يميز طلوع هذا النور فيكون النهار وغروب هذا النور فيكون الليل وهو حكم الظاهر والباطن في العالم وقد قررنا أنه لكل اسم في العالم حكم قبل هذا فالدهر من حيث عينه يوم واحد لا يتعدد ولا ليل له ولا نهار فإذا أخذته الأسماء الإلهية عينت بأحكامها في هذا اليوم الأزلي الأبدي الذي هو عين لدهر الأيام الإلهية التي أمر المذكر أن يذكرنا بها لنعرفها من أيام الزمان وأنه إذا أخذ الاسم النور في وجود الظل المثلى المنزه وفي طلوعه على من فيه من العالم سمي العالم الذي في هذا المثل ذلك الطلوع إلى وقت غروبه عنهم نهارا ومن وقت غروبه عنهم سموه ليلا وذلك النور غير غائب عن ذلك الظل كما إن الشمس غير غائبة عن الأرض في طلوعها وغروبها وإنما تطلع وتغيب عن العالم الذي فيها والظلام الحادث في الأرض إنما هو ظلال اتصالات ما فيها من العالم فهو على الحقيقة ظل يسمونه ظلاما والذين يسمونه ظلاما ممن ليس له هذا الكشف يجعل ذلك ظل الأرض لما هي عليه من الكثافة وهي في المثل الظلي الإلهي ظل أعيان عمرته لا غير فاعلم ذلك‏\n\n\n### [أحكام الأيام الإلهية]\n\n\nثم جعل الله هذه الأيام المعلومة عندنا التي أحدثتها حركة الأطلس والليل والنهار اللذين أحدثتهما حركة القلب أعني الشمس ليقدر بها أحكام الأيام الإلهية التي للأسماء فهي كالموازين لها يعرف بها مقادير تلك الأيام فقال وإِنَّ يَوْماً عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ فإذا ضربت ثلاثمائة يوم وستين يوما في ألف سنة فما خرج لك بعد الضرب من العدد فهو أيام التقدير التي ليوم الرب فينقضي ثم ينشئ في الدهر يوما آخر لاسم آخر غير اسم الرب وكذلك يضرب ثلاثمائة يوم وستين يوما في خَمْسِينَ أَلْفَ سَنَةٍ فما خرج لك بعد الضرب من الأيام فهو أيام التقدير التي ليوم ذِي الْمَعارِجِ من الأسماء الإلهية فإذا انقضى ذلك اليوم أنشأ في الدهر يوما آخر لاسم آخر غير الذي لذي المعارج هكذا الأمر دائما فلكل اسم إلهي يوم وإنما ذكرنا هذين اليومين يوم الرب ويوم ذي المعارج لكونهما جاءا في كتاب الله فلا يقدر المؤمنون بذلك على إنكارهما وما لم يرد إلا على ألسنتنا فلهم حكم الإنكار في ذلك بل الأمر كما ذكرناه أنه ما من اسم إلهي مما يعلم ويجهل إلا وله يوم في الدهر وتلك أيام الله والكل على الحقيقة أيام الله ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ فإذا نزلنا من الأسماء الإلهية إلى يوم العقل الأول قسمه حكمه في النفس الكلية إلى ليل ونهار فليل هذا اليوم عند النفس أعراض العقل عنها حين يقبل على ربه بالاستفادة ونهاره عند هذه النفس حين يقبل عليها بالإفادة فهو يومها وجعل الله من هذا الحكم في النفس قوتين قوة علمية وهي ليلها في العالم الذي دونها وقوة عملية وهي النهار في العالم الذي دونها وهو المسمى غيبا وشهادة وحرفا ومعنى ومعقولا ومحسوسا فهذا الحكم في النفس يوم لا نهار فيه ولا ليل وهو في العالم نهار وليل وكذلك يوم الهيولى الكل ليلها جوهرها ونهارها صورتها وهي في نفسها يوم لا ليل فيه ولا نهار وشمس كل ليل ونهاره هو المعنى المظهر لهذا الحكم الذي به ينسب إلى هذا اليوم ليل ونهار فإذا نزلنا إلى فلك البروج تعين في حركته اليوم وعين ذلك الكرسي الذي تقطع فيه فتعيينه من فوق لأنه لم يكن ظهر في جوفه بعد ما تعين به حركته مستوفاة فهو يوم لا نهار له ولا ليل ولا مقدار أيام من جهة مقعره وهو متماثل الأجزاء ما هو متماثل الأحكام ولما كان الكرسي هو الذي أظهر فيه تعيين الأحكام بتعيين المقادير المسماة بروجا وجعل لكل مقدار فيها ملكا معينا تعينت المقادير بتلك الأحكام التي وليها ذلك الملك المعين فإذا دار دورة واحدة سميت من جهة الكرسي يوما وكانت الكلمة في العرش واحدة مثل حكم اليوم فلما وجد الكرسي تحت العرش كحلقة ملقاة في فلاة من الأرض انقسمت في الكرسي تلك الكلمة الواحدة التي هي يوم العرش فكانت قسمتها بالقدمين اللتين تدلتا إلى هذا الكرسي وهما قدم الرب وقدم الجبار فكانتا أعني هاتين القدمين ليوم العرش كالنهار والليل اللذين قسما اليوم ويوم العرش أحدية كلمته لأن أمر الله واحدة\n\n\n### [إن الله أوجد فلك الكواكب الثابتة]\n\n\nثم إن الله أوجد فلك الكواكب الثابتة التي ميزتها مقادير البروج ولكل كوكب منها قطع في فلك البروج فإذا قطعه الكوكب كله كان يوما واحدا من أيام ذلك الكوكب مدة قطعه وهو يقطع درجة من ثلاثمائة وستين درجة في مائة\nسنة مما نعده من سنينا ثم أوجد بين هذين الفلكين الجنة وما فيها ومن العالم ما لا يحصي عددهم إلا الله ومن فلك البروج إلى آخر العالم الجسمي ظهر حكم البروج الهوائية والنارية والمائية والترابية في الفضاء الذي بين كل فلك وفلك ولا يعلم ذلك إلا بالمشاهدة والذين لا علم لهم بذلك يقولون إن الأفلاك تحت مقعر كل فلك منها سطح الذي تحته ولا علم لهم بأن بينهم فضاء فيه حكم الطبيعة كما هي في العناصر سواء غير أنها مختلفة الحكم بحسب القوابل ثم أوجد الأركان الأربعة على حكم ما هي عليه البروج التي في الفلك الأطلس لكل ركن طرفان وواسطة للثلاثة الوجوه التي في البروج فللأثير حكم الحمل والأسد والقوس فالقوس والأسد للطرفين والحمل للوسط وللتراب الثور والسنبلة والجدي فالجدي والسنبلة للطرفين والثور للوسط وللهواء الجوزاء والميزان والدالي فالميزان والجوزاء للطرفين والدالي للوسط وللماء السرطان والعقرب والحوت فالحوت للوسط والعقرب والسرطان للطرفين وإنما رتبناها هذا الترتيب لأن وجود الزمان والعالم الذي يحتوي عليه الفلك الأطلس كان بطالع الميزان وقد انتهت الدورة بالحكم إليه من أول مبعث رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ونحن اليوم في سلطانه ولهذا كان العلم والعدل في هذه الأمة والكشف أكثر وأتم مما كان في غيرها من الأمم وكل ما مضى الأمر استحكم سلطانه وعظم الكشف حتى يظهر ذلك في العام والخاص فتكلم الرجل عذبة سوطه ويكلم الرجل فخذه بما فعل أهله وقال رسول الله صلى الله عليه وسلم إن الزمان قد استدار كهيئته يوم خلقه الله‏\n\n\nولما خلق الله الأركان خلق منها دخانا فتق فيه سبع سماوات ساكنة غير متحركة وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها بأن خلق لها أفلاكا وجعلها محلا لسباحات الجواري الكنس الخنس وخلق فيها عمارا يعمرونها من الملائكة وجعل لها أبوابا تغلق وتفتح لنزول الملائكة وعروجها وأسكنها أرواح من شاء من أنبيائه وعباده وخلق في الفضاء الذي بين سطح السماء السابعة ومقعر فلك الكواكب سدرة المنتهى التي غشاها من نور الله ما غشى وخلق على سطح هذه السماء البيت الضراح وقد تقدم ذكره وذكر الملائكة التي تدخله في كل يوم ويخرج من أصل هذه السدرة أربعة أنهار تمشي إلى الجنة فإذا انتهت إلى الجنة أخرج الله منها على دار الجلال نهرين النيل والفرات اللذين عندنا في الأرض فأما النيل فظهر من جبل القمر وأما الفرات فظهر من أرزن الروم وأثر فيهما مزاج الأرض فتغير طعمهما عما كان عليه في الجنة فإذا كان في القيامة عادا إلى الجنة وكذلك يعود سيحون وجيحون ولما فتق الله هذه السموات بعد ما كانت رتقا في الدخان ومعنى الدخان أنه أصل لها وهي اليوم سماوات كما إن آدم خَلَقَهُ من تُرابٍ أي أصله وهو لحم ودم وعروق وأعصاب كما خلقنا من ماءٍ مَهِينٍ وأحدث الله الليل والنهار بخلق الشمس وطلوعها وغروبها في الأرض فأما السموات فنور ليس فيها ليل ولا نهار ومخرج الليل من كرة الأرض التي غرب عنها الشمس مخروط الشكل كشكل نور السراج كما تبصره يخرج من رأس الفتيلة فيشعل الهواء مخروط الشكل إلى أن ينتهي إلى أمد قوة اشتعاله وينقطع ويبقى الهواء الذي فوقه محترقا غير مشتعل قوى الحرارة ولما سبحت هذه الأنجم في أفلاكها جعل الله لكل كوكب يوما من أيام حركة فلك البروج سمي تلك الأيام زمانا يعد به حركة الفلك كما جعل حركة فلك البروج أياما كل حركة يوم يعد به مدة الزمان المتوهم الذي يتوهم ولا يعلم ولا يدرك وهو الدهر الذي نهينا عن سبه وقال الناهي إن الله هو الدهر\n\n\nفجعله اسما من أسمائه فله الأسماء الحسنى جل وتعالى فعين لكل يوم ليلا ونهارا وفرق بين كل ليلة ونهارها بحكم الكواكب الذي هو لليوم الذي ظهر فيه الليل أو النهار فينظر لمن هي أول ساعة من النهار من الجواري فهو حاكم ذلك النهار ويطلب في الليالي فالليلة التي حكم في أول ساعة منها ذلك الكوكب الذي حكم في أول ساعة من النهار فتلك الليلة ليلة ذلك النهار وبالحساب تعرف ذلك وفتق الأرض سبعا جعل لكل أرض قبولا لنظر كوكب من الجواري إليه وقد ذكرنا ذلك كله فيما تقدم وجعل لكل كوكب قطعا في فلك البروج فإذا انتهى قطعه فذلك يوم واحد له هو يومه الذي أحدثه قطعه وجعل حركات هذه الأفلاك والأركان في الوسط لا من الوسط ولا إلى الوسط وجعل حركة عمارها إلى الوسط ومن الوسط وتحدث الأشياء عند هذه الحركات في عالم الخلق والأمر وفي الجناب الأقدس وهي آثار محسوسة ومعقولة يحكم بها دليل الشرع والعقل وهي‏\nآثار أحوال كنزول الحق إلى السماء الدنيا وأعمال وأقوال كإجابة الحق من دعاه وخلق الملائكة من أعمال بنى آدم الظاهرة والباطنة وغرس الجنة من أعمال أهلها من بنى آدم ويوم شرع محمد إن كمل ليله ونهاره فهو من أيام الرب وإن لم يكمل وانقطع في أية ساعة انقطع فيها فذلك مقداره وهو من الاسم الخاذل والناصر لأن الخاذل والناصر ليس ليومهما مقدار معلوم عندنا بل ميزانه عند الله لا يعلمه إلا هو وحكمهما في كل إنسان بقدر عمر ذلك الإنسان وقدرهما في هذه الأمة بقدر بقائها في الدار الدنيا وذلك بحسب نظرها إلى نبيها محمد صَلَّى اللهُ عَليهِ وسَلَّم فإن نظرت إليه كمل لها يوم الرب وإن أعرضت فلها ما انقضى من مدة يوم الرب ويرجع الحكم لاسم آخر له عند الله يوم موقت لا يعلمه إلا هو ويوم هذه الأمة متصل بيوم الآخرة ليس بينهما إلا ليل البرزخ خاصة وفي فجر هذه الليلة تكون نفخة البعث وفي طلوع شمس يومه يكون إتيان الحق للفصل والقضاء وفي قدر ركعتي الإشراق‏\n\n\nينقضي الحكم فتعمر الداران بأهلهما وذلك يوم السبت فيكون نهاره أبديا لأهل الجنان ويكون ليله أبديا لأهل جهنم فإذا انقضت مدة الآلام في جهنم وهو يوم من خَمْسِينَ أَلْفَ سَنَةٍ في حق قوم وأقل من ذلك في حق قوم وشفعت التسعة عشر ملكا في أهل جهنم للرحمة التي سبقت ارتفعت الآلام فراحتهم ارتفاع الآلام لا وجود النعيم فافهم وهذا القدر هو نعيم أهل جهنم إن علمت وفي هذا المنزل من العلوم علم رحمة السيادة وأين ينادى بها وبما ذا يستحقها وما حكمة كونه نداء ترخيم والترخيم التسهيل ولهذا يوصف به الحسان فيقال في المرأة الحسناء رخيمة الدلال أي سهلة وفيه علم جميع الحكم لا جميع كل شي‏ء فإن الحكم ليس لها عين إلا في الترتيب خاصة معنى وحسا وفيه علم الرسالة على اختلاف أنواعها لاختلاف الرسل فإن الأنبياء رسل والملائكة رسل والبشر رسل وتختلف الرسالة باختلاف الأحوال وكل ذلك شرائع موصلة إلى الله وإلى السعادة الدائمة لا اعوجاج فيها ولا ينبغي لأنها نزلت من عرش الرحمة مرتدية بالعزة فلا يؤثر فيها شي‏ء يخرج أممها عن حكمها فما من أمة إلا والرحمة تلحقها كما لحقتها الشريعة التي خوطبت بها وفيه علم حكمة وضع الشرائع في العالم ولما ذا وضعت في الدار الدنيا ولم توضع في الآخرة لما ذا وتوقيت ما وضع منها في الدار الآخرة أولا كالتحجير على آدم في قرب الشجرة وآخرا كدعاء الحق عباده إلى السجود يوم القيامة وبهذا الحكم الشرعي يوم القيامة يرجح ميزان أهل الأعراف فيثقل ميزانهم بهذه السجدة فينصرفون إلى الجنة بعد ما كان منزلهم في سور الأعراف ليس لهم ما يدخلهم النار ولا ما يدخلهم الجنة وفيه قوة المؤمن فيعدل من قوى الكفار قوى كثيرين ولهذا شرع لهم أن لا يفروا في قتال عدوهم وشرع لبعضهم قوة واحد لعشرة ثم خفف عنهم مع إبقاء القوة عليهم فشرع لهم لكل قوة مؤمن قوة رجلين من الكفار ولهذا\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إنه يوعك كما يوعك رجلان من أمته‏\n\n\nفأعطى قوة رجلين من أمته وفيه علم رحمة وجود الغفلة والنسيان في العالم بل في هذه الأمة لما نص فيها وكذلك الخطاء وفيه علم الفرق بين القول وقول الله والقول المضاف إلى الخلق والكلمة وهل لكل قول وكلمة حق واجب في الإمضاء أو ليس ذلك إلا لخصوص قول فإن كان لخصوص قول دون كلمة فما السبب الموجب لهذا التخصيص والكل قول من حيث ما هو قول وكلمة من حيث ما هي كلمة وإذا كان في نفس الأمر الحكم للقول وهو السابق فلما ذا وقع الأخذ بالسؤال والتقرير مع العلم بأنه مجبور في اختياره وهي مسألة صعبة التصور كثيرة التفلت ولو لا وجود الآلام لهانت وما خطرت على بال وفيه علم تقييد المعاني ووجود آثار أحكامها فيمن قامت به وإلى أين ينتهي حد التقييد منها في نشأة الإنسان وفيه علم السبب الذي لأجله ترفع الوجوه والأبصار إلى الفوق يوم القيامة وفي الدنيا هل حكمهما وسببهما واحد أو مختلف وهل الرفع عن جذب من خلف أم عن اختيار وفيه علم كون الإنسان بين قضاء الله وقدره فلا يقدر يتعداهما وهل عم القضاء والقدر جهات الإنسان كلها أو ليس لهما منه إلا جهتان جهة الحادي والهادي وهما السائق والشهيد وما الذي أعمى الناس اليوم عن شهود هذين وفي الآخرة يرونهما ولم اختصا بالخلف والأمام دون سائر الجهات والشيطان له مسالك الأربع جهات فهل مكان الخلف والأمام لهما الاستشراف على اليمين والشمال بحكم اليدين اللذين لهما ولو كان لهما اليمين والشمال لتعطلت اليد الواحدة من كل واحد منهما في حق من التزماه فلا بد أن يكون لهما الخلف والأمام وفيه علم نسبة العدم والوجود إلى الممكن وهو لا يعقل إلا\nبالمرجح وليس عند المرجح إلا وجه واحد من هاتين النسبتين فيرتفع الإمكان فما الصحيح في ذلك هل بقاء الإمكان أو ارتفاعه وفيه علم القوابل هل هي قوابل لكل شي‏ء أو لأشياء مخصوصة أو تتميز في القبول فيكون على صفة توجب لبعض القوابل ما تقبله مما لا تقبله وهل لما تقبله من الأمور التي تأخذها القوابل طريق واحد أم تختلف الطرق وفيه علم وصف الأجر بالعظمة والكرم لما ذا يرجع وهو علم شريف وفيه علم الموت وما معنى إحياء الموتى ومن يميتهم هل الله بلا سبب أو هل الملك وما هو ذلك الملك هل هو بعض الأخلاط التي قام بها الجسد الحيواني فإن الأخلاط من ملائكة الله أو هو ملك من ملائكة السموات وإن أضيف إلى السموات هل يضاف إلى واحدة منها بحكم أنه عن حركة ما أوحى الله فيها قوى هذا الخلط القاهر المسمى ملك الموت أو هو ملك غريب من سكان السماء السابعة وكذلك المحيي مثل المميت غير أنه تختلف السماء فإن السماء السادسة معدن الحياة ولها تقوية من كل سماء كما للموت أيضا والكلام في المحيي كالكلام في المميت أو يكون المميت هو الله من حيث إنه اسم إلهي من أسمائه وكذلك المحيي فهو المميت المحيي ولا نقدر نرفع الأسباب التي وضعها الحق فتبطل حكمة الحق فنرفع الأسباب في الاعتقاد ونقرها في الوجود في أماكنها وإسرافيل ينفخ في الصور وعزرائيل يقبض الأرواح وهذا للاستعداد الذي في هذه الصور لقبول الاشتعال فتحيا ولقبول الانطفاء فتموت وهذا الملك الموكل بنا لا بالموت هو الذي يقوي الملك الذي به وبأصحابه قامت نشأة جسد الحيوان فيميت لقوة سلطانه على بقية أصحابه ولهذا تعرف الأطباء أن الإنسان يموت بالعلامات فلو كان الملك غير ما ذكرناه ما انتهى إليه علم الأطباء فإن ذلك من خصائص علم الأنبياء ومن أعلمه الله من عباده وهل المقتول له هذا الحكم الذي للعليل في الموت أم له حكم آخر وهل للملك الموكل بنا لا بالموت هل له حكم الموت أو حكم قبض الأرواح والعروج بها وهل هو ملك واحد أو ملائكة فإن الله أضاف وفاة الأنفس إليه وإلى ملك الموت وإلى رسله فلا بد من علم هذه الإضافات وما المراد بها وهل تختلف مدارجها أو هي على مدرجة واحدة وفيه علم ما يؤول إليه الجسم بعد الموت والروح وما يبعث في نفخة البعث منهما وهل يتغير النش‏ء بالعرض أو بالصورة وفيه علم آثار الأكوان وما الحضرة التي تمسك فيها إلى وقت الحشر فيوقف أصحابها عليها وهي آثار المكلفين وهي ما صدر عنهم من الأفعال زمان التكليف لا في غير زمانه مثل النائم والمغلوب على عقله والشخص الذي لم يبلغ الحلم فلهذا قلنا زمان التكليف ولم نقل دار التكليف وفيه علم تتابع الرسل في الأمة الواحدة بخلاف هذه الأمة المحمدية فإنها ما اختلفت عليها الرسل بل إن ظهر فيها من كان رسولا التحق بها وقام بشرعها وجرت عليه أحكام شرع محمد صَلَّى اللهُ عَليهِ وسَلَّم وفيه علم النصائح وكون هذه النشأة الإنسانية جبلت على البخل والكرم لها بحكم العرض ما هو لها ذاتي وإذا كانت بهذه المثابة فمن أين صح لها الأجر الكريم وليس بينها وبين الكرم نسبة ذاتية والكرم للأجر ذاتي والعظمة له ذاتية وللأجر العظيم قوم مخصوصون وللأجر الكريم قوم مخصوصون وفيه علم اختلاف أسباب البواعث على العبادة في الثقلين وغيرهما وفيه علم التسليم والتفويض إلى الله وفيه علم التمني وفائدته وصفة القائم به وفيه علم معرفة كون العالم ملكا لله تعالى من حيث ما هو ملك ومن ينازعه حتى وصف نفسه أن لِلَّهِ جُنُودُ السَّماواتِ والْأَرْضِ وفيه علم ما يضاف إلى الله أنه منعوت بالوحدة وما سبب تكثر هذه الوحدة وما أثرها في العالم وفيه علم الكشف لما كان غيبا وفيه علم عدم القبول مع ظهور الدليل والعلم به أنه دليل وما سبب جهل من جهل إنه دليل وهل لكل معلوم دليل أم هو لبعض المعلومات وفيه علم عدم الرجعة إلى ما خرج منه وفيه علم الحضرة التي يجتمع فيها عالم لدنيا من مكلف وغير مكلف وهل يبعث غير المكلف من حيوان ونبات وحجر لتقوم به المطالبة والحجة من الله على المكلفين أو يبعثون لأنفسهم لما لهم في ذلك من الخير المعلوم عند الله ثم ما يؤول إليه أمرهم بعد البعث وفيه علم ما اختزن الله لنا في عالم السماء والأرض من المنافع وفيه علم الشكر الواجب من الشكر الذي يتبرع به الإنسان وأيهما أكمل أجرا وفيه علم السبب والحكمة التي لأجلها خلق الله من كل شي‏ء زوجين وهل من هذه الحكمة خلق آدم على صورته وفيه علم الزمان الذي يفصل به اليوم وفيه علم سكون من لا سكون له وفيه علم مناهل المسافرين وهل يحصون عددا أم لا وفيه علم اختلاف الصفات على المسافرين باختلاف طرقهم ومناهلهم وفيه علم السابق الذي يلحق والسابق الذي لا يلحق من‏\nالمسافرين كالشخص مع ظله لا يلحق ظله أبدا ويلحقه ظله وغير ذلك من المسافرين وهو علم شريف يتضمن جميع الأسفار الإلهية والكونية والعلوية والسفلية وهو علم عزيز المنال بعيد المدرك لا يتفطن له كل أحد وأما الإحاطة به فلا تعلم إلا بإعلام الله ولا يصح الإعلام بها على التفصيل فإنها أسفار لا نهاية لها وفيه علم الطرق التي يسلك فيها كل مسافر وفيه علم الأسباب التي تحول بين بعض المسافرين وبين ما قصدوه في سفرهم والفرق بين السفر الاختياري والجبري وفيه علم زمان الدنيا العام الذي يكون بعد انقضائه القيامة الكبرى وفيه علم زمان عمر الحيوان والمولدات وقيامتهم الصغرى بانقضاء مدتهم والفرق بين هذين الحشرين‏\n\n\nفإن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قال من مات فقد قامت قيامته‏\n\n\nفحشرهم إلى البرزخ قيامة وفيه علم صفات ترجى الرحمة التي تسأل الرحمة بلسانها وفيه علم السبب الموجب الذي لأجله أعرض من أعرض عن النظر في الدلالات العقلية التي جاءت بها الرسل والتي لم تجي‏ء بها من الآيات المعتادة وهل تختلف دلالتها وما صورة دلالتها وهل يختلف مدلولها باختلاف قصد الدال أو قصد الذي يحرك الدال للنظر في الدليل كالرسول يجي‏ء بالدلالة على صدقه في كونه رسولا وتلك الدلالة بعينها تكون دلالة على وجود الحق وعجز الخلق وفيه علم التأسي بالله فيما ذمه الله هل يذم صاحبه من جهة لسان الحقيقة أو لا يذم إلا بلسان الشرع وفيه علم ما يقبض عليه الإنسان هل يبقى عليه في البرزخ ويحشر عليه أم يتغير عليه الحال أو يقبض على ما يبدو له عند كشف الغطاء قبل القبض أو هل عين القبض هو عين الكشف للغطاء وفيه علم رد السائل هل رده عن سؤاله جواب له عن سؤاله أم لا وفيه علم السبب الموجب للاسراع لمن ناداه الحق هل هو إسراع جبر أو إسراع توقع جبر وفيه علم ما سبب اختلاف كلام المبعوثين من أهل القبور وفيه علم من يجيبهم في ذلك هل يجيبهم الحق أو الملائكة أو العالمون وفيه علم\n\n\nما يتجلى للذين يبعثون من قبورهم هل هو صورة واحدة أم صور مختلفة وهل ذلك المتجلي اسم إلهي أم لا وفيه علم ما السبب الذي أوجب أن يخالف ترتيب البروج وهي طبيعة ترتيب العناصر فإن ترتيب البروج كل برج بين منافر ومناسب بوجه كل واحد إذا أخذته تجده كما ذكرناه وأما الأركان فترتيبها لمناسبة ليس فيها تنافر من جميع الوجوه فالنارية الثلاثة كلها من مائية وترابية والترابية كلها من نارية وهوائية والهوائية كلها بين ترابية ومائية والمائية كلها بين هوائية ونارية والأركان ليست كذلك وفيه علم الفرق بين عندي ولدي وعندنا ولدنا ولدينا ولدني وفيه علم الفصل بين الأشياء ليتميز بعضها عن بعض وفيه علم ما يرى الرائي غير صورته وصفته كان الرائي من كان وفيه علم الاشتغال ولم سمي شغلا وعمن يشتغل وهل ثم شغل يغني عن سواه بالكلية أم لا وفيه علم الأنس بمثله إلا بمثلية لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وفيه علم إلهيات والحالات التي تكتسبها النفوس في الدار الدنيا وفيه علم الأعراس الإلهية وفيه علم ما لكل اسم إلهي من الرحمة من الأسماء التي تعطي بظاهرها ذهاب الرحمة منها وفيه علم الاستحقاق الذي يستحقه العالم من حيث ما هو عليه من الصفة فهو استحقاق الصفة لا استحقاق الموصوف وفيه علم العهد الإلهي والكوني فيما ذا وقع وفيه علم حكم المتقدم كيف ظهر في المتأخر ومن أين ظهر وفيه علم البعد الكوني من البعد الإلهي وفيه علم النطق والصمت وتعيين الناطق والصامت وزمانه ومكانه وفيه علم تبدل الصور العلية بالصور الدنية وفيه علم سبب التثبط عن النهوض مع وجود الكشف وفيه علم ما يعطيه الزمان في نشأة الإنسان وفي سائر المعادن والنبات والحيوان وفيه علم الإبهام والإيضاح وفيه علم اجتماع الكثير على إيجاد الواحد وفيه علم تمليك ما ينشئه المنشئ لكونه أنشأه وفيه علم الرياضة الإلهية والفرق بينها وبين الرياضة الكونية وفيه علم حضرة المنعم وما لها في الدنيا والآخرة في الحكم وفيه علم سبب الاعتماد على من يعلم أنه ليس ممن يعتمد عليه وفيه علم المبدأ والمعاد وفيه علم التشبيه وعكس التشبيه وما هو الأصل الذي يقع به التشبيه وفيه علم تأثير اجتماع الأضداد من العلم الإلهي ووجود النار في الماء والماء في النار وفيه علم الصفة التي أظهرت العالم في عينه وفيه علم الملكوت وأين حظه من الملك والجبروت والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏",
    "en": "Chapter Three Hundred and Forty-Eight: Concerning the Knowledge of the Station of Two Secrets from the Secrets of the Heart of Synthesis (الجمع) and Existence (الوجود).\n\nIf it is asked, \"Is there anything wider in the existence of the cosmos than\nThe Mercy of Allah?\" then say, \"The Heart, if it is [perfected].\"\n\nIt is the House of the God, due to the faith established within it,\nAlong with piety and God-consciousness, if they adorn it.\n\nIt encompasses The Real (الحق) with knowledge, the very essence of His Form,\nAnd He is the Mighty One (العزيز) who, in its eye, becomes humble.\n\nThe Heart is my dominion, and the dwelling is for its Creator,\nMy life, my expectation, my faith, and my spiritual excellence (إحسانا).\n\n[Indeed, the Helpers (al-Ansar) are the Words of Allah; Allah aided His religion through them and made it manifest.]\n\nThe Messenger of Allah, peace and blessings be upon him, said: \"I find the Breath of the Merciful (نفس الرحمن) coming to me from the direction of Yemen.\" Allah relieved Him through the Helpers (الأنصار).\n\nThus, the Helpers were the Words of Allah; Allah aided His religion through them and made it manifest. This station (منزل) is the locus of that Merciful Breath (التنفس الرحماني). From this station appeared all the Divine Stations (المنازل الإلهية) in the World (العالم)—which is everything other than Allah, high and low, spirit and body, meaning and sensation, manifest and hidden. From it appeared the Ten Categories (المقولات العشر). A hint of what we have said is found in the prophetic report.\n\nThis station has aspects directed toward every genus, species, and individual in the World that are not shared by any other genus, species, or individual. This station possesses a form, a spirit, and a Divine sustenance (إمداد إلهي) derived from the aspect where The Real (الحق) attributed the Form (الصورة) to Himself, but specifically from the inner dimension (باطن) of the Form. The ruling of this sustenance is manifest and hidden within the form of this station, but it is more complete (أتم) in the inner dimension. This is why the Name 'The Hidden' (الباطن) is placed last after 'The First' (الأول), 'The Last' (الآخر), and 'The Manifest' (الظاهر) when these Divine attributes (النعوت الإلهية) are expressed. This is because the Divine Command in the subsequent [Name] is more complete and perfect than it is in the preceding [Name]. Thus, the subsequent contains what is in the first, plus an increase.\n\nThe Last (الآخر) encompasses what is in the First (الأول). The Manifest (الظاهر) encompasses what is in the Last and the First. The Hidden (الباطن) encompasses what is in the Manifest, the Last, and the First. If anything came after the Hidden, it would encompass the Hidden and what preceded it. However, the limitation prevents there being anything other than these four, and there is no fifth except His Absolute Identity (هويته تعالى).\n\nThere is no ruling in the World except that which originates from these four. The world of spirits (عالم الأرواح) and the world of bodies (عالم الأجسام)—and there is no world besides these two—appeared in the form of these four. From the Divine Attributes (الإلهيات)—Knowledge (علم), Will (إرادة), Power (قدرة), and Speech (قول)—the world of spirits, which is external to Nature (الطبيعة), appeared. Then, from these four Divine Attributes, Nature was manifested in four aspects. From Nature, the world of dense and subtle bodies appeared, just as these four Divine Attributes manifested the world of codification and inscription (عالم التدوين والتسطير) as Intellect (عقل), Soul (نفس), Nature (طبيعة), and Prime Matter (هيولى) before the appearance of bodies.\n\nHe manifested the four Elements (الأركان): Fire, Air, Water, and Earth. He manifested the animal constitution (النشأة الحيوانية) based on four humors (أخلاط), and He gave these humors four powers: attractive, retentive, digestive, and repulsive. Thus, He established Existence (الوجود) upon the principle of quadrature (التربيع), making it like a House standing on four corners. For He is The First, The Last, The Manifest, and The Hidden.\n\nThe corner corresponding to The Hidden (الباطن) is the Black Stone (الحجر الأسود), for it is the Right Hand of Allah on Earth, facing the direction of the covenant (البيعة) with Allah. The physical eye falls upon the Stone, but the inner sight (البصيرة) falls upon the Hand. The Hand is the inner dimension (باطن) of the Stone, not manifest to sight. Thus, the corner of the Stone is superior to the other corners, as the ruling of The Hidden encompasses the rulings of the three attributes preceding it. This station is specialized by this [Hidden] attribute.\n\nThe core (لب) of this station is the Divine Form (الصورة الإلهية) from which its sustenance (الإمداد) comes. The core of that Form is its spirit (روحها), and it is the core of the core (لب اللب), the treasury of sustenance for this station. This station has control over the entire World (العالم), like: <<كَمِشْكاةٍ فِيها مِصْباحٌ الْمِصْباحُ في زُجاجَةٍ الزجاجة يُوقَدُ من شَجَرَةٍ>> (A niche wherein is a lamp, the lamp is in a glass, the glass is kindled from a tree). That tree is His Identity (هويته), which is <<لا شَرْقِيَّةٍ ولا غَرْبِيَّةٍ>> (neither of the East nor of the West), accepting no directions. From this olive tree (الزيتونة) comes the oil (الزيت), which is the substance (المادة) for the manifestation of this light (النور). These are four: niche, glass, lamp, and oil. The fifth is the Identity (الهوية), which is the Olive Tree, transcendent of directions. It is symbolized by the tree (شجرة) due to *tashājur* (contention), referring to the opposition inherent in this Identity through the contrasting Names, such as The Exalter (المعز) and The Humiliator (المذل), The Harmful (الضار) and The Beneficial (النافع).\n\nLook at how complete the Divine expressions are in reporting the true state of affairs.\n\nIf someone enters this station and misses any part of the World or its realities (حقائقه), then he has not truly entered it. Rather, Satan or the lower soul (النفس) has deluded him into thinking he entered it. <<وما قَتَلُوهُ وما صَلَبُوهُ ولكِنْ شُبِّهَ لَهُمْ>> (And they did not kill him, nor did they crucify him, but it was made to appear to them so), because the Presence of Imagination (حضرة الخيال) creates every form. Many people enter this imaginative presence (الحضرة الخيالية) and witness the forms disclosed to them (تجلى لهم), claiming they have witnessed the fixed, essential existence (الوجود الثابت العين) as it truly is, when it was nothing but what the Imagination formed.\n\nWhoever is afflicted by this should wait a little. If what he witnesses is a spirit (روحا) fixed in essential existence, or something physically perceived (محسوسا في العين), it will remain stable and unchanging. If it is Imagination (خيال), it will not remain stable and will quickly change. He will see the form of change within it and know that what appeared to him through change is the very essence of the first [form]. Some see themselves in two or more forms and know that it is still them. By this, one differentiates between forms fixed in their essence (sensually and spiritually) and imaginative forms. This is the balance (ميزانها) for those lacking gnosis (المعرفة). I have alerted and advised you, so do not neglect this balance if you are among the People of Unveiling (أهل الكشف).\n\nAllah only instituted sleep in the animal world so that people might generally witness the Presence of Imagination (حضرة الخيال). This teaches them that there is another world resembling the sensory world, and alerts them, through the rapid transformation of those imaginative forms experienced by the rational sleepers, that even in the sensory world and fixed existence, transformations occur with every breath. However, eyes and senses do not perceive these transformations, except specifically in speech and movements. In all other categories, the form of transformation and change is not perceived except through inner sight (البصيرة), which is Unveiling (الكشف), or through sound reflection (الفكر الصحيح) in some, but not all, of these forms, as reflection falls short.\n\nThe origin of all this—meaning the origin of change from one form to its like or its opposite, whether in Imagination or in sensation, or wherever it may be in the World—is that it perpetually changes, forever and ever, due to the change in the Origin (الأصل) that sustains it, which is the Divine Transformation in Forms (التحول الإلهي في الصور) mentioned in the authentic Hadith. From there, it appeared in meanings and forms:\n\nFrom meaning to meaning,\nAnd from forms to forms.\n\nThis is His saying, the Exalted: <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>> (Every day He is in [some] affair). This refers to the changes He brings about in the existents (الأكوان). If you have understood, I have clarified the matter as it truly is. For <<إِنَّ في ذلِكَ لَذِكْرى‏>> (Indeed, in that is a reminder)—meaning, in the change of the World is a reminder of the change of the Origin—<<لِمَنْ كانَ لَهُ قَلْبٌ>> (for whoever has a heart). The heart (القلب) is so named because of its constant turning (التقليب) from one state to another. Whoever interprets the heart as the intellect (العقل) has no gnosis (معرفة) of the realities (الحقائق), for the intellect is a restriction (تقييد) derived from the fetter (*iqāl*). If, by the intellect which is restriction, he means what we mean—that which is restricted by constant turning and never ceases to turn—then he is correct, just as we speak of establishment (*tamkīn*) within variation (*talwīn*).\n\nNot everyone perceives this. Since we know that the attribute of Time (الدهر) is transformation, and Allah is Time, and it is established that He transforms in forms and is \"Every day in [some] affair\"—and the day is the measure of the breath (النفس)—this transformation stems from His Name *al-Dahr* (Time), not from another Name, if you understand. If a person observed his heart, he would see that it never remains in one state, thus knowing that if the Origin (الأصل) were not of this nature, this turning would have no basis. For the heart is between two fingers (أصبعين) of the fingers of its Creator, who is The Merciful (الرحمن). The turning of the fingers for the heart, changing the state of the two fingers, is due to the change in what He wills to turn the heart toward.\n\nWhoever knows himself knows his Lord.\n\nThe hadith about the fingers contains a Divine promise, as He attributed them to The Merciful. Thus, He only turns the heart from mercy to mercy. Even if the types of turning involve tribulation (بلاء), hidden within them is a mercy known to The Real (الحق), for the two fingers are the fingers of The Merciful. Understand this.\n\nIf you know what we have mentioned, you know who is the Heart of Existence (قلب الوجود), who sustains the world of his form—for which he is the heart and all its parts—and that he is the Heart of Synthesis (قلب الجمع), which is the synthesis of the manifest and hidden realities gathered by this existential form. Since Allah is <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>>, the turning of the World, which is the form of this mold (القالب), from state to state occurs with every breath (الأنفاس). The World never remains fixed in a single state for a single moment, because Allah is the perpetual Creator (خلاق على الدوام). If the World remained in one state for two moments, it would be described as being independent of Allah. But people are in <<لَبْسٍ من خَلْقٍ جَدِيدٍ>> (confusion concerning a new creation). Glory be to Him who granted the People of Unveiling (أهل الكشف) and Existence (الوجود) transcendence in the turning of states and the witnessing of Him who is \"Every day in [some] affair.\"\n\nAllah is Time (الدهر). The ruling of this Time never ceases in the Greater World (العالم الأكبر) and the Lesser World (الأصغر), which is the Human. The Human is one of the four known entities (المعلومات) that possess influence (التأثير). The first known entity for us is the Human. The second known entity is the Greater World, which is the manifest form of the human world. The Human who is the heart of this form—and by this, I mean only the Perfect Human (الكامل) who holds the rank (المرتبة)—is the third known entity. The fourth known entity is the Reality of Realities (حقيقة الحقائق), which holds the ruling in pre-eternity (القدم) and origination (الحدوث). There is no fifth known entity that has an effect besides what we have mentioned.\n\nFrom this station branch the branches of faith (شعب الايمان), which are seventy-odd branches. The lowest is removing harm from the road, and the highest is the saying, \"There is no god but Allah.\" The branches between them are also included. This station is the Station of Faith (منزل الايمان), and from it, faith appeared in the heart of the believer. The Name specifically associated with it is *Al-Mu'min* (The Giver of Faith) among the Divine Names. From here, the believer legislated the branches of faith and made them clear.\n\nFrom this station, the community of Muhammad (أمة محمد) derived its lifespan. The maximum age for this Muhammadan community is seventy years; it does not increase beyond that. If someone lives longer, he is not purely Muhammadan; rather, he is an inheritor of whomever Allah willed among the Prophets, from Adam up to Khalid ibn Sinan, and his life is extended according to the length of the life of the one he inherited from.\n\nThe Prophet, peace and blessings be upon him, said concerning the ages of his community: \"They are between sixty and seventy.\"\n\nHe made seventy the limit for the age of his community. Thus, we know that by his community, he only means the Muhammadans whom Allah distinguished with a rank (رتبة) that He did not grant to any other Prophet concerning the rulings and degrees over all the Prophets, since we are <<خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ>> (the best community brought forth for mankind). Every ruling and rank that belonged to a Prophet before him, even if it was shared by him, was not exclusive to him alone. His complete honor is only in what was exclusive to him, not others. His community is like him.\n\nWhoever, at the time of his departure from the world or in his current state, follows a shared law (شرع مشترك) from this community, we attribute him to the one through whom it first appeared before the appearance of Muhammad, peace and blessings be upon him, in order to show the difference between the two matters and to recognize the station of the two individuals. Even if he took it only from the confirmation of Muhammad, peace and blessings be upon him, he is still part of his community, but the ruling of sharing is distinct from the ruling of exclusivity.\n\nThe Prophet, peace and blessings be upon him, died at sixty-three years of age. Whoever exceeds seventy years, no matter how old he becomes, even if he is from his community and has attained all the Muhammadan exclusivity, he is only taken (قبض) when he is taken according to the shared law (الشرع المشترك). This is not a deficiency for him, as he has attained the ruling of exclusivity, but his exceeding the seventy years—which the Messenger of Allah, peace and blessings be upon him, made the dominant limit for the age of his community taken in the exclusive ruling—is what distinguishes him from others in the community. This is among the sciences not attained by opinion or analogy, but rather by Divine bestowal (الوهب الإلهي).\n\nSimilarly, it is mentioned that none of the four Caliphs died until he reached sixty-three years, confirming that they were taken in the Muhammadan exclusivity, not under the ruling of the shared law. From this station, these four were designated from others, and the Ten [Companions] were also designated from this station: Abu Bakr, Umar, Uthman, Ali, Sa'd, Sa'id, Talha, Al-Zubayr, Abd al-Rahman ibn Awf, and Abu Ubaydah ibn al-Jarrah. This is their station from which the Messenger of Allah, peace and blessings be upon him, designated them and testified to their entry into Paradise in a single sitting by their names.\n\nMany have been testified to enter Paradise, but not in a single sitting, and they are restricted by a specific description, like the seventy thousand who <<يَدْخُلُونَ الْجَنَّةَ ... بِغَيْرِ حِسابٍ>> (will enter Paradise... without reckoning). Ukkasha ibn Mihsan was designated from among them. The phrase \"without reckoning\" means that this was not part of their expectation or calculation. A goodness appeared to them from Allah that they had not anticipated. They are those who do not seek *ruqya* (incantation), nor do they use cauterization (الكي), nor do they take omens (التطير), and <<عَلى‏ رَبِّهِمْ يَتَوَكَّلُونَ>> (upon their Lord they rely).\n\nHis saying, \"They do not seek *ruqya*,\" means they do not request incantation to remove pain, nor do they perform incantation for anyone suffering pain. The use of the reflexive form (*istif'āl*) is for emphasis. The Prophet, peace and blessings be upon him, did perform *ruqya* and used medicine during his illness because he is an example to be followed by the weak and the strong. This is the case for all Messengers; their ruling is not the same as the ruling of their communities. This does not detract from their station, for they hold the unknown station (المقام المجهول) where they appear to their communities in the form of strength and weakness, so no one knows to which stations he should attribute them.\n\nHis saying, \"nor do they take omens,\" means that the bird (*al-tā'ir*) is fortune/lot (الحظ). They are external to the fortunes of their lower souls (نفوسهم), occupied with the duties Allah has assigned them, fulfilling what Lordship (الربوبية) requires of them. They do not seek a personal share (حظا) of the reward Allah promised for their deeds. What motivates them to act is not the reward attached to the action, but the fulfillment of the station. This is the meaning of \"they do not take omens\"—they do not act based on personal fortunes.\n\nHis saying, \"nor do they use cauterization,\" means that cauterization only involves fire. Allah has protected them from being touched by fire, so they find within themselves that they do not use cauterization. This is a Divine protection (عصمة إلهية) of which they are unaware.\n\nHis saying, <<وعَلى‏ رَبِّهِمْ يَتَوَكَّلُونَ>> (upon their Lord they rely), means they take Him as their Agent (وكيلا) and rely upon Him with the reliance of the principal upon the agent. This is an intermediate gnosis (معرفة وسطي) that came to them from the secondary intention (القصد الثاني). They saw that Allah created things for them and created them for Him. So, they took Him as an Agent concerning what was created for them, so that they might be free for what they were created for.\n\nWe call this an intermediate rank because above it is the high rank, which is the primary intention (القصد الأول): Allah created nothing in the entire World except for Himself, so that it might glorify Him with His praise, and we benefit by way of providence and subservience. The secondary intention is this [reliance], because when He made us equal and subjected to us <<ما في السَّماواتِ وما في الْأَرْضِ جَمِيعاً مِنْهُ>> (whatever is in the heavens and whatever is on the earth—all from Him), there are two intentions in creation.\n\nIn the human world and the non-human world, there are those who rely upon Him in all their affairs because they believe that Allah, the Exalted, has a Face (وجها) in everything. Only the believer asserts this, since the non-believer, especially among humans, is one who says that Allah only originated one thing through the path of causality, and that He has no detailed knowledge of the particulars of the World except through the universal knowledge (العلم الكلي) in which all knowledge of particulars is subsumed. For this reason, reliance (التوكل) was placed among the believers. The Exalted said: <<وعَلَى الله فَتَوَكَّلُوا إِنْ كُنْتُمْ مُؤْمِنِينَ>> (And upon Allah rely, if you should be believers). He made reliance a sign of the existence of faith in the servant's heart.\n\nYet, only a specific group of relying believers took Him as an Agent, those who obeyed Allah's command in His saying: <<فَاتَّخِذْهُ وَكِيلًا>> (So take Him as an Agent). The one who lacks knowledge of existence in things imagines that you are the owner of the wealth and have appointed Him as an agent, glory be to Him, over what is your property, and that the attribution of wealth to you (e.g., \"your wealth\") is an attribution of ownership. But they do not know that this attribution is one of entitlement (استحقاق), like the saddle of a beast or the door of a house, not an attribution of ownership.\n\nWhat we and the great masters see is that Allah said to us: <<وأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ>> (And spend from that over which He has made you successors). Thus, what is \"ours\" is what we have appointed Him as Agent over, relying on Him for spending, knowing the Agent's knowledge of what is beneficial and the proper places for expenditure, which are free from extravagance or stinginess. Allah takes charge of spending on our behalf by inspiring us where and when to spend. The expenditure appears through our hands, so our hand is the hand of the Agent in spending. We are protected (معصومون) in expenditure because of our knowledge of the proper channels and because our hand is the hand of The Real (يد حق), for it is the hand of the Agent.\n\nThis is known only through Divine Unveiling (الكشف الإلهي). They are in this state of reliance, yet they are unaware of it, because He said, \"without reckoning.\" They act without conscious insight (بصيرة), yet their actions are the actions of the people of insight, due to Divine providence: <<يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ والله ذُو الْفَضْلِ الْعَظِيمِ>> (He selects for His mercy whom He wills, and Allah is the Possessor of Great Bounty). And bounty (*al-faḍl*) means increase.\n\n[That the existence of the World is bound to the Necessary Existent (الواجب الوجود) by Himself.]\n\nKnow that since the origin of the World was to be bound in its existence to the Necessary Existent by Himself (الواجب الوجود لنفسه), its parts are bound to one another. The matter becomes a chain (يتسلسل) when a person begins to look into the knowledge of it, leading him from one thing to another by virtue of the connection within it. This occurs only in the knowledge of the People of Allah (أهل الله) specifically. This does not follow the rule of the scholars of formal knowledge (علماء الرسوم والكون). Their rule is the connection of the World's parts to one another. Thus, you see them moving from one thing to another, even if the formal scholar sees no apparent suitability. This is the knowledge of Allah, and it is known that suitability exists, but it is extremely subtle.\n\nFor example, His saying, the Exalted: <<حافِظُوا عَلَى الصَّلَواتِ والصَّلاةِ الْوُسْطى‏ وقُومُوا لِلَّهِ قانِتِينَ>> (Maintain the prayers and [especially] the middle prayer, and stand before Allah in devotion). This verse about prayer is placed before verses about marriage and divorce, and after it are verses about death and bequests, and other matters for which there is no apparent suitability with prayer. If the verse of prayer were removed from this place and the subsequent verse were connected to the preceding verses, the suitability would be apparent to every person with two eyes.\n\nSuch is the knowledge of the Friends of Allah (أولياء الله). Al-Junayd was asked about Unity (التوحيد). He answered the questioner with one matter. The questioner said, \"I did not understand, repeat it.\" He answered him with another matter. The questioner said, \"I did not understand.\" He answered him with a third matter, then said, \"This is how the matter is.\" The questioner said, \"Dictate it to me.\" He replied, \"If I were dictating it, I would dictate it.\" (Meaning: I do not speak from caprice; rather, this is the knowledge of Allah, not my knowledge.)\n\nWhoever knows the Quran and realizes its truth knows the knowledge of the People of Allah, and that it does not fall under restricted categories, nor does it follow a logical rule, nor is it judged by a balance (ميزان), for it is the balance of every balance.\n\nThis station corresponds, in the world of bodies, to the sphere of the Sun (فلك الشمس) among the spheres. Above it are seven: three heavens, the sphere of the station, the Atlas Sphere (الأطلس) which is the sphere of the Zodiac (فلك البروج), the Footstool (الكرسي), and the encompassing Throne (العرش المحيط), which is the limit of the world of bodies. Below it are also seven: three heavens, and the spheres of Aether, Air, Water, and Earth.\n\nBy the Sun's cutting through the sphere, the four seasons appear, due to the quadrature (التربيع) we mentioned. The signs of the Zodiac (البروج), which are the estimations in the Atlas Sphere, are squared (مربعة). Allah established them upon four levels: fiery, earthy, airy, and watery, corresponding to the ruling of the four Divine Attributes and the four natural elements. Each season has three rulings: two for the extremes and one for the middle, and between them are rulings in every movement, minute, second, and third, into infinite division.\n\nThe star of the second heaven, from our perspective, is mixed (ممتزجا), which is the Scribe (الكاتب - Mercury). This is why Jesus, peace be upon him, dwells there, because he is mixed from the two worlds: he appeared between an angel and a human (Gabriel and Mary). He is a spirit from a spirit and a human from a human. This was not granted to anyone else of this type, just as none of the receding stars (الجواري الخنس) were made in the form of the Scribe. He is the sixth from that perspective, so that he may attain the honor of the rank mentioned in His saying: <<ولا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ>> (nor five, except that He is their sixth). He is the second from our perspective, because the second is the letter *Bā'* (ب), which is the First Originator (المبدع الأول), manifest from the Human who is the shadow of the Divine Form (الظل الصورة الإلهية) that never ceased. That is the First, but not the firstness of The Real (الحق), because the firstness of The Real does not accept a second, for the One is not a number, and the first number is two. Thus, the mixing appeared in the year through the appearance of the seasons.\n\n[Indeed, Allah is Time (الدهر).]\n\nKnow that since Allah informed us that He is Time (الدهر), He mentioned that He has days (أياما) derived from His being Time—these are the Days of Allah (أيام الله). These days designate the rulings of His Names (أحكام أسمائه) in the World. Every Name has days, which is the duration of that Name's ruling. All of them are the Days of Allah and the details of Time (الدهر) through the ruling in the World. These days interpenetrate (تتوالج), one entering into the other, and one covering the other. This is what we see in the World: the variation of rulings in a single time period. This is due to their interpenetration, covering, turning, and repetition.\n\nThese Divine Days have night and day. Their night is the Unseen (غيب), which is what is hidden from us, and it is the essence of their ruling in the celestial spirits (الأرواح العلوية) above Nature and the bewildered spirits (الأرواح المهيمة). Their day is the Witnessed (شهادة), which is the essence of their ruling in the natural bodies (الأجسام الطبيعية) down to the last elemental body, which is below Nature. The twilight (سدفة) of this day is the essence of the ruling of these days in the subjugated spirits (الأرواح المسخرة) below Nature, who are the inhabitants of the heavens and the earth and what is between them. They are the Ranks (الصافون), the Reciters (التالون), and the Glorifiers (المسبحون). They are in known stations: the Drivers (الزاجرات), the Sent Ones (المرسلات), the Dividers (المقسمات), the Purifiers (المنقيات), the Snatchers (النازعات), the Drawers (الناشطات), the Managers (المدبرات), and others, such as the Wanderers (السائحين), the Ascenders (العارجين), the Scribes (الكاتبين), and the Observers (الراقبين). All these are under the ruling of the Days of Allah, specifically through the twilight of these days.\n\nFrom the covering of the day of these days over their night, the spirits above Nature were found. From the covering of the night of these days over their day, the bodies below Nature were found. From the interpenetration of their night with their day—which is neither pure day due to the ruling and participation of the night, nor pure night due to the ruling and participation of the day—this state of the days is called twilight (سدفا), and from this interpenetration, the spirits below Nature were found.\n\nWhen Allah divided His days into these sections, He made their night three sections and their day three sections. He descends (ينزل) to His servants in the last third of the night of His days. This is His Theophany (تجليه) therein to the natural spirits (الأرواح الطبيعية) that manage the elemental bodies. The middle third is where He manifests to the subjugated spirits. The first third is where He manifests to the bewildered spirits.\n\nHe divided the day of these days into three sections, manifesting in each section to the world of bodies, because they constantly glorify Allah with His praise. In the first third, He manifests to the subtle bodies (الأجسام اللطيفة) that eyes cannot perceive. In the middle third, He manifests to the transparent bodies (الأجسام الشفافة). In the last third, He manifests to the dense bodies (الأجسام الكثيفة). Were it not for this Theophany, they would not have sound gnosis (المعرفة) of the One they glorify, for the glorifier must have knowledge of the One he glorifies. Gnosis of Allah cannot be based on reflection (فكر) or report (خبر); rather, it must be through His Theophany to every glorifier.\n\nSome are aware of this, and some are not aware that they glorify based on the gnosis of a Theophany. This applies only to some of the two weighty groups (mankind and jinn). All others are gnostics (عارفون) of the One who manifests to them, glorifying Him through witnessing (الشهود)—bodies generally, and spirits specifically. Everyone who lacks the power to convey what he witnesses possesses knowledge of the One who manifests to him. Likewise, the one who has the power to convey but is trustworthy (أمين) and speaks only by Divine command possesses knowledge of the One who manifests to him. But the one who knows he has the power to convey, yet is a talebearer (نمام) who reports what he witnessed and heard, and is not trustworthy, awaiting the command of the Owner of the Trust—The Real (الحق) does not make Himself known to him in His Theophany, neither in this world nor the Hereafter. May Allah make us among the trustworthy ones who know the One who manifests to them.\n\nIf you ask, \"Night and day in the [temporal] day are only caused by the rising and setting of the sun. What is the sun that manifested night and day in the Days of Allah, called Time (الدهر)?\" We say: It is His Name, The Light (النور), which He mentioned as the Light of the heavens and the earth. This Light has a rising and setting upon us from behind the veil of the Archetypal Human (الإنسان المثلى), which we mentioned is His shadow created upon His Form (صورته)—the eternal ruling that negated similitude from Him and affirmed the essence of His existence in His saying: <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him), with the *kāf* (like) of description.\n\nHis night is called the Hidden (باطنا), and His day is called the Manifest (ظاهرا). He is The Hidden (الباطن) by virtue of His night, and He is The Manifest (الظاهر) by virtue of His light. That human archetype distinguishes the rising of this Light, which becomes the day, and the setting of this Light, which becomes the night. This is the ruling of The Manifest and The Hidden in the World.\n\nWe have established that every Name has a ruling in the World. Time (الدهر), in its essence, is a single day (يوم واحد); it does not multiply, nor does it have night or day. When the Divine Names take hold of it, they designate, through their rulings, [sections] in this eternal, everlasting day, which is the essence of the Time of the Divine Days that the Reminder (the Prophet) was commanded to remind us of, so that we might distinguish them from the days of temporal time (الزمان). When the Name The Light (النور) takes hold in the existence of the transcendent archetypal shadow (الظل المثلى المنزه), and in its rising upon those in the World who are within it, the World within that archetype is called day from the time of its rising until its setting from them, and from the time of its setting from them, they call it night. That Light is not absent from that shadow, just as the sun is not absent from the earth in its rising and setting; rather, it rises and sets only from the world within it. The darkness that occurs on Earth is truly the shadows of the connections of the world within it. It is, in reality, a shadow that they call darkness. Those who call it darkness, who lack this Unveiling (الكشف), consider it the shadow of the Earth due to its density. In the Divine archetypal shadow, it is nothing but the shadow of the essences of those who inhabit it. Know this.\n\n[The Rulings of the Divine Days.]\n\nThen Allah made these known days of ours—which are caused by the movement of the Atlas Sphere (الأطلس) and the night and day caused by the movement of the heart (meaning the Sun)—to measure the rulings of the Divine Days belonging to the Names. They are like balances for them, by which the measures of those days are known. He said: <<وإِنَّ يَوْماً عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ>> (Indeed, a day with your Lord is like a thousand years of what you count). If you multiply three hundred and sixty days by one thousand years, the resulting number is the days of estimation for the Day of the Lord (يوم الرب). It then concludes, and in Time (الدهر), He initiates another day for another Name, other than the Name of the Lord. Similarly, one multiplies three hundred and sixty days by <<خَمْسِينَ أَلْفَ سَنَةٍ>> (fifty thousand years). The resulting number of days is the days of estimation for the Day of *Dhī al-Ma'ārij* (Possessor of Ascending Ways) among the Divine Names. When that day concludes, He initiates another day in Time for another Name, other than *Dhī al-Ma'ārij*. This is the perpetual state of affairs. Every Divine Name has a day.\n\nWe only mentioned the Day of the Lord and the Day of *Dhī al-Ma'ārij* because they appeared in the Book of Allah, so believers cannot deny them. But what has only come upon our tongues (i.e., the general rule) is subject to their denial. But the matter is as we stated: there is no Divine Name, known or unknown, that does not have a day in Time (الدهر). Those are the Days of Allah, and in reality, all are the Days of Allah, <<ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ>> (but most people do not know).\n\nWhen we descend from the Divine Names to the day of the First Intellect (العقل الأول), its ruling divides it into night and day within the Universal Soul (النفس الكلية). The night of this day, according to the Soul, is the Intellect's turning away from it when it turns toward its Lord for benefit (استفادة). Its day, according to the Soul, is when it turns toward the Soul for bestowal (إفادة). This is the Soul's day. Allah established from this ruling in the Soul two powers: a cognitive power (قوة علمية), which is its night in the world below it, and an active power (قوة عملية), which is the day in the world below it. This is called the Unseen and the Witnessed, letter and meaning, intelligible and sensible. This ruling in the Soul is a day that has neither night nor day in itself, but in the World, it is night and day.\n\nSimilarly, the day of Prime Matter (الهيولى): its essence (جوهرها) is its night, and its form (صورتها) is its day. In itself, it is a day with neither night nor day. The sun of every night and day is the meaning (المعنى) that manifests this ruling, by which night and day are attributed to that day.\n\nWhen we descend to the sphere of the Zodiac, the day is designated by its movement, and the Footstool (الكرسي) in which it cuts through is designated. Its designation comes from above, because nothing has yet appeared in its interior by which its movement is fully designated. It is a day with neither night nor day, and no measure of days from the perspective of its concave side. It is uniform in its parts, but not uniform in its rulings.\n\nWhen the Footstool manifested the designation of rulings by designating the measures called the Zodiac signs, and a specific angel was appointed for each measure, the measures were designated by those rulings overseen by that specific angel. When it completes one revolution, it is called a day from the perspective of the Footstool. The Word (الكلمة) in the Throne (العرش) was one, like the ruling of the day. When the Footstool was found beneath the Throne, like a ring cast in a desert, that single Word, which is the day of the Throne, was divided in the Footstool. Its division was by the two Feet (القدمين) that dangled down to this Footstool—the Foot of the Lord (قدم الرب) and the Foot of the Compeller (قدم الجبار). These two Feet were, for the day of the Throne, like the night and day that divide the [temporal] day. The day of the Throne is the oneness of its Word, because the Command of Allah is one.\n\n[Indeed, Allah created the Sphere of the Fixed Stars.]\n\nThen Allah created the Sphere of the Fixed Stars (فلك الكواكب الثابتة), which are distinguished by the measures of the Zodiac. Each star has a section (قطع) in the sphere of the Zodiac. When the star completes its section, that is one day of the days of that star, the duration of its section. It cuts one degree out of three hundred and sixty degrees in one hundred years of our counting.\n\nThen He created Paradise (الجنة) and what is in it between these two spheres, and creatures whose number none but Allah can count. From the sphere of the Zodiac to the end of the corporeal world (العالم الجسمي), the ruling of the airy, fiery, watery, and earthy Zodiac signs appeared in the space (الفضاء) between every sphere. This is known only through witnessing (المشاهدة). Those who lack knowledge of this say that the spheres are surfaces beneath the concave side of the sphere above them. They do not know that there is a space between them containing the ruling of Nature, exactly as it is in the elements, except that its ruling varies according to the recipients (القوابل).\n\nThen He created the four Elements (الأركان) according to the ruling of the Zodiac signs in the Atlas Sphere. Each element has two extremes and a middle, corresponding to the three faces in the Zodiac signs. Aether (الأثير) has the ruling of Aries, Leo, and Sagittarius (Sagittarius and Leo for the extremes, Aries for the middle). Earth (التراب) has Taurus, Virgo, and Capricorn (Capricorn and Virgo for the extremes, Taurus for the middle). Air (الهواء) has Gemini, Libra, and Aquarius (Libra and Gemini for the extremes, Aquarius for the middle). Water (الماء) has Cancer, Scorpio, and Pisces (Pisces for the middle, Scorpio and Cancer for the extremes).\n\nWe arranged them in this order because the existence of Time and the World contained by the Atlas Sphere began with the rising sign of Libra (طالع الميزان). The cycle has concluded its ruling with it since the beginning of the mission of the Messenger of Allah, peace and blessings be upon him. We are currently under its dominion. This is why knowledge and justice (العدل) are more abundant and complete in this community than in others. As time passes, its dominion strengthens and Unveiling (الكشف) increases until it becomes manifest to the common and the elite. A man's whip will speak to him, and a man's thigh will speak to him about what his family did. The Messenger of Allah, peace and blessings be upon him, said: \"Time has revolved to its form on the day Allah created it.\"\n\nWhen Allah created the Elements, He created smoke (دخانا) from them, in which He split seven stationary, non-moving heavens. He <<أَوْحى‏ في كُلِّ سَماءٍ أَمْرَها>> (revealed in every heaven its command) by creating spheres for them and making them the place for the swimming of the receding, sweeping stars (الجواري الكنس الخنس). He created inhabitants (عمارا) in them from the angels, and made gates for them that close and open for the descent and ascent of the angels. He settled in them the spirits of whomever He willed among His prophets and servants.\n\nIn the space between the surface of the seventh heaven and the concave side of the sphere of the stars, He created the Lote Tree of the Utmost Boundary (سدرة المنتهى), which was covered by the Light of Allah with what covered it. On the surface of this heaven, He created the Frequented House (البيت الضراح), which has been mentioned previously, along with the angels who enter it every day. From the root of this Lote Tree emerge four rivers that flow toward Paradise. When they reach Paradise, Allah brings forth from them, upon the Abode of Majesty (دار الجلال), two rivers: the Nile and the Euphrates, which we have on Earth. The Nile appeared from the Mountain of the Moon, and the Euphrates appeared from Arzan al-Rum. The mixture of the Earth affected them, changing their taste from what it was in Paradise. On the Day of Resurrection, they will return to Paradise, as will the Sayhun and Jayhun.\n\nWhen Allah split these heavens after they were joined in the smoke—the meaning of smoke is that it is their origin, and today they are heavens, just as Adam was <<خَلَقَهُ من تُرابٍ>> (created from dust), meaning his origin, and he is flesh, blood, veins, and nerves, just as we were created from <<ماءٍ مَهِينٍ>> (a despised fluid)—Allah created night and day by creating the Sun and its rising and setting on Earth. As for the heavens, they are light; there is no night or day in them. The exit of the night from the sphere of the Earth, where the sun has set, is cone-shaped, like the light of a lamp, as you see it emerging from the tip of the wick, igniting the air in a cone shape until it reaches the limit of its ignition power and cuts off. The air above it remains burned but not ignited, intensely hot.\n\nWhen these stars swim in their spheres, Allah made for every star a day from the days of the movement of the Zodiac sphere. He called those days temporal time (زمان), by which the movement of the sphere is counted, just as He made the movement of the Zodiac sphere into days—each movement being a day—by which the duration of the imagined time (الزمان المتوهم) is counted, which is imagined but not known or perceived, and that is Time (الدهر) which we were forbidden to curse. The one who forbade it said, \"Indeed, Allah is Time.\"\n\nHe made it one of His Names, for He has the Most Beautiful Names, exalted is He. He designated a night and a day for every day, and differentiated between every night and its day by the ruling of the star that belongs to the day in which the night or day appeared. One looks to see which of the stars governs the first hour of the day; that star is the ruler of that day. Then one seeks in the nights: the night in whose first hour that same star ruled is the night of that day. This is known through calculation.\n\nHe split the Earth into seven, making each Earth receptive to the gaze of one of the stars. We have mentioned all this previously. He made for every star a section in the sphere of the Zodiac. When its section ends, that is one day for it—its day caused by its section.\n\nHe made the movements of these spheres and elements in the middle, but not from the middle or toward the middle. He made the movement of their inhabitants toward the middle and from the middle. Things occur at these movements in the world of creation and command, and in the Most Holy Presence (الجناب الأقدس). These are sensible and intelligible effects, judged by the evidence of the Law (الشرع) and the Intellect. These are effects of states, such as the descent of The Real to the lowest heaven, and acts and sayings, such as The Real answering those who call upon Him, the creation of angels from the manifest and hidden deeds of the children of Adam, and the planting of Paradise from the deeds of its inhabitants among the children of Adam.\n\nIf the day of Muhammad's Law (يوم شرع محمد) completes its night and day, it is one of the Days of the Lord (أيام الرب). If it does not complete it and is cut off at any hour, that is its measure, and it belongs to the Name The Abandoner (الخاذل) and The Helper (الناصر), because their day has no known measure for us; rather, its balance is with Allah, known only to Him. Their ruling applies to every person according to that person's lifespan, and their measure in this community is according to its duration in the worldly abode. This depends on the community's regard for its Prophet Muhammad, peace and blessings be upon him. If they regard him, the Day of the Lord is completed for them. If they turn away, they receive only the duration that has passed of the Day of the Lord, and the ruling reverts to another Name that has a fixed day with Allah, known only to Him.\n\nThe day of this community is connected to the Day of the Hereafter, separated only by the night of the Isthmus (ليل البرزخ). At the dawn of this night is the Blast of Resurrection (نفخة البعث). At the rising of the sun of its day is the coming of The Real for separation and judgment. In the measure of the two *rak'ahs* of sunrise prayer (الإشراق), the judgment concludes, and the two abodes are inhabited by their people. That day is Saturday. Its day will be eternal for the people of the Gardens, and its night will be eternal for the people of Hell. When the duration of the pains in Hell concludes—which is a day of <<خَمْسِينَ أَلْفَ سَنَةٍ>> (fifty thousand years) for some people, and less for others—and the nineteen angels intercede for the people of Hell due to the mercy that preceded, the pains are lifted. Their relief is the lifting of the pains, not the existence of bliss. Understand this. This measure is the bliss of the people of Hell, if you know.\n\nIn this station are the sciences of the mercy of sovereignty (رحمة السيادة), where it is proclaimed, by what it is deserved, and the wisdom of its being a call of truncation (*tarkhīm*). Truncation is facilitation (تسهيل). This is why beautiful women are described by it, saying of a beautiful woman that her coquetry is *rakhīmat al-dalāl* (easy/gentle). In it is the science of all ruling (الحكم), but not the totality of everything, for ruling has no essence except specifically in arrangement (الترتيب), meaningfully and sensually.\n\nIn it is the science of messengership (الرسالة) according to its different types, due to the difference in messengers: prophets are messengers, angels are messengers, and humans are messengers. Messengership varies according to the variation of states. All of this constitutes laws (شرائع) leading to Allah and to perpetual felicity (السعادة الدائمة), without deviation, nor should there be, because they descended from the Throne of Mercy (عرش الرحمة), clothed in Might (العزة). Nothing affects them to remove their communities from their ruling. There is no community that mercy does not reach, just as the law addressed to them reached them.\n\nIn it is the science of the wisdom of establishing laws in the World, and why they were established in the worldly abode and not in the Hereafter. And the timing of what was established of them in the Hereafter, first, like the prohibition placed upon Adam regarding approaching the tree, and last, like the call of The Real to His servants to prostrate on the Day of Resurrection. By this legal ruling on the Day of Resurrection, the balance of the People of the Heights (أهل الأعراف) is tipped, and their balance becomes heavy with this prostration, so they turn toward Paradise after their station on the wall of the Heights left them with nothing to enter Hell or Paradise.\n\nIn it is the strength of the believer, who equals the strength of many disbelievers. This is why it was legislated for them not to flee in fighting their enemy. For some, the strength of one was legislated to equal ten, then it was lightened for them while maintaining the strength, so that the strength of one believer was legislated to equal the strength of two men from the disbelievers.\n\nFor this reason, the Messenger of Allah, peace and blessings be upon him, said: \"I suffer from fever as two men from my community suffer.\"\n\nHe (the Prophet) was given the strength of two men from his community. And therein is the knowledge of the mercy inherent in the existence of heedlessness (الغفلة) and forgetfulness (النسيان) in the world, especially in this community, due to what is explicitly stated concerning it, as well as error (الخطاء).\n\nAnd therein is the knowledge of the difference between a saying (القول), the saying of Allah (قول الله), the saying attributed to creation (القول المضاف إلى الخلق), and the Word (الكلمة). And whether every saying and every Word has a necessary right (حق واجب) to be executed, or if this applies only to a specific saying. If it applies to a specific saying but not to a Word, what is the compelling reason for this specification, given that everything is a saying insofar as it is a saying, and a Word insofar as it is a Word?\n\nAnd if, in the reality of the matter (في نفس الأمر), the ruling belongs to the saying, which is the precedent, then why did the reckoning occur through questioning and interrogation, despite the knowledge that the individual is compelled (مجبور) in his choice? This is a matter difficult to conceive and prone to slipping away (كثيرة التفلت); were it not for the existence of pains, it would be trivial and would not cross the mind.\n\nAnd therein is the knowledge of the restriction of meanings (تقييد المعاني) and the existence of the effects of their rulings in the one in whom they subsist, and where the limit of this restriction ends in the human constitution (نشأة الإنسان).\n\nAnd therein is the knowledge of the reason why faces and gazes are raised upwards on the Day of Resurrection, and whether their ruling and cause in this world are the same or different, and whether the raising is due to an attraction from behind or due to choice.\n\nAnd therein is the knowledge of the human being existing between the Divine Decree (قضاء الله) and Destiny (قدره), such that he cannot transgress them. And whether the Decree and Destiny encompass all aspects of the human being, or if they only relate to two aspects: the aspect of the Driver (الحادي) and the Guide (الهادي), who are the Driver (السائق) and the Witness (الشهيد). And what is it that blinds people today from witnessing these two? And in the Hereafter, they will see them. And why are they specific to the back (الخلف) and the front (الأمام) rather than all other directions? And the Devil (الشيطان) has paths in the four directions. Do the positions of the back and the front allow them to oversee the right and the left, by virtue of the two hands they possess? If they were assigned the right and the left, the single hand of each of them would be rendered ineffective concerning the one they are committed to; thus, they must be assigned the back and the front.\n\nAnd therein is the knowledge of the relation of Non-existence (العدم) and Existence (الوجود) to the possible (الممكن), which is only conceivable through the Determiner (المرجح). And the Determiner possesses only one aspect of these two relations, whereby Possibility (الإمكان) is removed. What is the correct view in this matter: the persistence of Possibility or its removal?\n\nAnd therein is the knowledge of the Receptacles (القوابل): are they receptive to everything, or to specific things, or do they differ in their receptivity, such that they possess a quality that necessitates that some Receptacles accept what they accept and reject what they do not accept? And is there a single path for the matters that the Receptacles receive, or do the paths differ?\n\nAnd therein is the knowledge of why the reward (الأجر) is described by Greatness (العظمة) and Generosity (الكرم). This is a noble science.\n\nAnd therein is the knowledge of death (الموت), and the meaning of raising the dead (إحياء الموتى). And who causes them to die? Is it Allah without a cause, or is it the Angel? And what is that Angel? Is it one of the Humors (الأخلاط) by which the animal body subsists—for the Humors are among the angels of Allah—or is it an Angel from the angels of the heavens? And if it is attributed to the heavens, is it attributed to one specific heaven, by virtue of its being caused by a movement in which Allah revealed the powers of this dominant Humor called the Angel of Death (ملك الموت)? Or is it a unique Angel residing in the Seventh Heaven? Likewise, the Quickener (المحيي) is like the Causer of Death (المميت), except that the heaven differs, for the Sixth Heaven is the source of life, and it receives reinforcement from every heaven, just as death does. The discussion concerning the Quickener is the same as the discussion concerning the Causer of Death. Or is the Causer of Death Allah, insofar as He is a Divine Name (اسم إلهي) among His Names? And likewise the Quickener. Thus, He is the Causer of Death, the Quickener (المميت المحيي). We cannot remove the causes established by the Real (الحق), thereby nullifying the wisdom of the Real. So, we remove the causes in belief (الاعتقاد) but affirm them in Existence (الوجود) in their proper places. Israfil (إسرافيل) blows the Trumpet (الصور), and Azra'il (عزرائيل) seizes the souls. This is due to the preparedness in these forms to accept ignition, so they live, and to accept extinction, so they die. This Angel entrusted with us—not with death—is the one who strengthens the Angel by whom and by whose companions the constitution of the animal body subsists. He causes death due to the strength of his authority over the rest of his companions. This is why physicians recognize that a person dies by signs. If the Angel were other than what we have mentioned, the knowledge of physicians would not reach it, for that is specific to the knowledge of the Prophets and those whom Allah informs among His servants. Does the slain person have the same ruling regarding death as the sick person, or does he have a different ruling? And does the Angel entrusted with us—not with death—have the ruling of death, or the ruling of seizing the souls and ascending with them? And is it a single Angel or multiple Angels? For Allah attributes the passing of souls (وفاة الأنفس) to Himself, to the Angel of Death, and to His Messengers. Thus, it is necessary to know these attributions and what is intended by them, and whether their degrees differ or if they are on a single degree.\n\nAnd therein is the knowledge of what the body (الجسم) and the spirit (الروح) revert to after death, and what is resurrected from them in the blast of the Resurrection (نفخة البعث). And whether the constitution (النشء) changes by accident (بالعرض) or by form (بالصورة).\n\nAnd therein is the knowledge of the traces of the Existents (آثار الأكوان), and the Presence (الحضرة) in which they are held until the time of the Gathering (الحشر), where their possessors are made to stand upon them. These are the traces of those held responsible (المكلفين), meaning the actions that proceeded from them during the time of responsibility (زمان التكليف), not outside that time, such as the sleeper, the one overcome in his intellect, or the person who has not reached puberty. This is why we said \"time of responsibility\" and not \"abode of responsibility.\"\n\nAnd therein is the knowledge of the succession of Messengers (الرسل) in a single community, unlike this Muhammadan Community (الأمة المحمدية), upon which the Messengers did not differ. Rather, if one who was a Messenger appeared within it, he would join it, uphold its Law (شرعها), and the rulings of the Law of Muhammad (peace and blessings be upon him) would apply to him.\n\nAnd therein is the knowledge of counsels (النصائح), and that this human constitution (النشأة الإنسانية) was created upon stinginess (البخل), and that generosity (الكرم) is accidental (عرض) to it, not essential (ذاتي). If it is of this nature, then how is the noble reward (الأجر الكريم) valid for it, given that there is no essential relation between it and generosity? Yet, generosity is essential to the reward, and greatness (العظمة) is essential to it. And for the tremendous reward (الأجر العظيم) there are specific people, and for the noble reward (الأجر الكريم) there are specific people.\n\nAnd therein is the knowledge of the difference in the causes that motivate worship (العبادة) among the two weighty groups (الثقلين—Jinn and Humans) and others.\n\nAnd therein is the knowledge of submission (التسليم) and delegation (التفويض) to Allah.\n\nAnd therein is the knowledge of wishing (التمني), its benefit, and the description of the one who practices it.\n\nAnd therein is the knowledge of knowing that the World (العالم) is the dominion (ملك) of Allah the Exalted, insofar as it is a dominion, and who disputes Him, such that He described Himself: <<لِلَّهِ جُنُودُ السَّماواتِ والْأَرْضِ>> (To Allah belong the hosts of the heavens and the earth).\n\nAnd therein is the knowledge of what is attributed to Allah, that He is described by Unity (الوحدة), and what is the cause of the multiplicity (تكثر) of this Unity, and what is its effect in the World (العالم).\n\nAnd therein is the knowledge of the Unveiling (الكشف) of what was hidden (غيبا).\n\nAnd therein is the knowledge of non-acceptance despite the appearance of the proof (الدليل) and the knowledge that it is a proof. And what is the reason for the ignorance of the one who is ignorant that it is a proof? And does every known thing have a proof, or is it only for some known things?\n\nAnd therein is the knowledge of the non-return to that from which one has departed.\n\nAnd therein is the knowledge of the Presence (الحضرة) in which the world of this life (عالم لدنيا)—both those held responsible (مكلف) and those not held responsible (غير مكلف)—gathers. And whether the non-responsible beings, such as animals, plants, and stones, are resurrected so that the claim and proof (الحجة) of Allah may be established against those held responsible, or if they are resurrected for their own sake, due to the good known to Allah that they possess therein, and then what their ultimate fate will be after the resurrection.\n\nAnd therein is the knowledge of the benefits that Allah has stored up for us in the realm of the heavens and the earth.\n\nAnd therein is the knowledge of the obligatory gratitude (الشكر الواجب) versus the voluntary gratitude (الشكر الذي يتبرع به الإنسان), and which of the two has the more perfect reward.\n\nAnd therein is the knowledge of the reason and wisdom for which Allah created pairs (زوجين) of everything. And whether the creation of Adam upon His form (صورته) is part of this wisdom.\n\nAnd therein is the knowledge of the time by which the day is divided.\n\nAnd therein is the knowledge of the stillness of that which has no stillness.\n\nAnd therein is the knowledge of the watering places (مناهل) of the travelers (المسافرين), and whether they can be counted or not.\n\nAnd therein is the knowledge of the variation of attributes among the travelers according to the variation of their paths and watering places.\n\nAnd therein is the knowledge of the preceding traveler who is overtaken, and the preceding traveler who is not overtaken, such as a person with his shadow: he never overtakes his shadow, but his shadow overtakes him, and other types of travelers. This is a noble science that encompasses all the Divine Journeys (الأسفار الإلهية), the Cosmic Journeys (الكونية), the Celestial Journeys (العلوية), and the Terrestrial Journeys (السفلية). It is a science difficult to attain (عزيز المنال) and far-reaching in comprehension (بعيد المدرك); not everyone grasps it. As for encompassing it fully, that is only known by the information of Allah, and detailed information about it is not possible, for these are journeys without end.\n\nAnd therein is the knowledge of the paths that every traveler traverses.\n\nAnd therein is the knowledge of the causes that intervene between some travelers and what they intended in their journey, and the difference between voluntary journeying (السفر الاختياري) and compulsory journeying (الجبري).\n\nAnd therein is the knowledge of the general time span of the world (زمان الدنيا العام), after the expiration of which the Greater Resurrection (القيامة الكبرى) occurs.\n\nAnd therein is the knowledge of the lifespan of animals and generated beings (المولدات), and their Lesser Resurrection (قيامتهم الصغرى) upon the expiration of their term, and the difference between these two Gatherings (الحشرين). For the Messenger of Allah (peace and blessings be upon him) said: \"Whoever dies, his Resurrection has commenced.\" Thus, their gathering to the Isthmus (البرزخ) is a resurrection.\n\nAnd therein is the knowledge of the attributes of hoped-for mercy (ترجى الرحمة) that ask for mercy with their own tongue.\n\nAnd therein is the knowledge of the compelling reason why those who turn away from considering the rational proofs (الدلالات العقلية) brought by the Messengers, and those not brought by them from the customary signs (الآيات المعتادة), do so. And whether their indication differs, and what the form of their indication is. And whether their signified meaning (مدلولها) differs according to the intention of the indicator or the intention of the one who moves the indicator to look at the proof, such as the Messenger who brings a proof of his truthfulness in being a Messenger, and that very proof is also an indication of the Existence of the Real (وجود الحق) and the incapacity of creation (عجز الخلق).\n\nAnd therein is the knowledge of imitating Allah (التأسي بالله) in what Allah has condemned: is the practitioner condemned from the perspective of the tongue of Reality (لسان الحقيقة), or is he only condemned by the tongue of the Law (لسان الشرع)?\n\nAnd therein is the knowledge of what the human being dies upon (ما يقبض عليه): does it remain with him in the Isthmus (البرزخ) and is he resurrected upon it, or does his state change? Or is he seized upon what appears to him when the veil (الغطاء) is lifted before the seizure? Or is the very moment of seizure the very moment of the lifting of the veil?\n\nAnd therein is the knowledge of whether turning away the questioner (رد السائل) from his question constitutes an answer to his question or not.\n\nAnd therein is the knowledge of the compelling reason for the haste (الاسراع) of the one whom the Real (الحق) calls: is it the haste of compulsion (إسراع جبر) or the haste of anticipating compulsion?\n\nAnd therein is the knowledge of the reason for the difference in the speech of those resurrected from the inhabitants of the graves.\n\nAnd therein is the knowledge of who answers them in that matter: is it the Real (الحق), the Angels, or the knowledgeable ones (العالمون)?\n\nAnd therein is the knowledge of what is disclosed (يتجلى) to those who are resurrected from their graves: is it a single form or different forms? And is that which is disclosed a Divine Name (اسم إلهي) or not?\n\nAnd therein is the knowledge of the reason that necessitated the arrangement of the Zodiacal Signs (البروج) to differ from the nature of the arrangement of the Elements (العناصر). For the arrangement of the Zodiacal Signs is such that every sign is both repellent (منافر) and suitable (مناسب) in some respect; whichever one you take, you find it as we have mentioned. As for the Constituents (الأركان), their arrangement is based on suitability without repulsion in any respect. The three fiery signs are all composed of watery and earthy elements, and the earthy signs are all composed of fiery and airy elements, and the airy signs are all composed of earthy and watery elements, and the watery signs are all composed of airy and fiery elements. The Constituents are not like that.\n\nAnd therein is the knowledge of the difference between *‘indī* (with me), *laday* (at/near), *‘indanā* (with us), *ladaynā* (at/near us), *ladayna* (at/near us), and *ladunnī* (from Me/My Presence).\n\nAnd therein is the knowledge of the separation between things so that some may be distinguished from others.\n\nAnd therein is the knowledge of what the seer sees that is not his own form or attribute, whoever the seer may be.\n\nAnd therein is the knowledge of preoccupation (الاشتغال), why it is called preoccupation, and from whom one is preoccupied. And whether there is any preoccupation that completely suffices one from everything else or not.\n\nAnd therein is the knowledge of intimacy (الأنس) with one's like, except by the likeness of Him of whom <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him).\n\nAnd therein is the knowledge of Divine matters (إلهيات) and the states that souls acquire in the abode of this world (الدار الدنيا).\n\nAnd therein is the knowledge of the Divine Nuptials (الأعراس الإلهية).\n\nAnd therein is the knowledge of the portion of mercy (الرحمة) that each Divine Name possesses, even those Names whose outward meaning suggests the removal of mercy from them.\n\nAnd therein is the knowledge of the merit (الاستحقاق) that the World (العالم) deserves, insofar as it possesses an attribute (الصفة); thus, it is the merit of the attribute, not the merit of the described subject (الموصوف).\n\nAnd therein is the knowledge of what the Divine Covenant (العهد الإلهي) and the Cosmic Covenant (الكوني) pertain to.\n\nAnd therein is the knowledge of how the ruling of the precedent (المتقدم) appeared in the subsequent (المتأخر), and from where it appeared.\n\nAnd therein is the knowledge of the Cosmic Distance (البعد الكوني) from the Divine Distance (البعد الإلهي).\n\nAnd therein is the knowledge of speech (النطق) and silence (الصمت), and the determination of the speaker and the silent one, and their time and place.\n\nAnd therein is the knowledge of the transformation of the lofty forms (الصور العلية) into the base forms (الصور الدنية).\n\nAnd therein is the knowledge of the reason for hesitation (التثبط) in rising up, despite the existence of Unveiling (الكشف).\n\nAnd therein is the knowledge of what time grants in the constitution of the human being, and in all minerals, plants, and animals.\n\nAnd therein is the knowledge of ambiguity (الإبهام) and clarification (الإيضاح).\n\nAnd therein is the knowledge of the gathering of the many (الكثير) to bring about the existence of the one (الواحد).\n\nAnd therein is the knowledge of the ownership granted to the originator (المنشئ) over what he originates, by virtue of his having originated it.\n\nAnd therein is the knowledge of Divine Spiritual Discipline (الرياضة الإلهية) and the difference between it and Cosmic Spiritual Discipline (الرياضة الكونية).\n\nAnd therein is the knowledge of the Presence of the Benefactor (حضرة المنعم) and what ruling it holds in this world (الدنيا) and the Hereafter (الآخرة).\n\nAnd therein is the knowledge of the reason for relying upon someone known not to be reliable.\n\nAnd therein is the knowledge of the Origin (المبدأ) and the Return (المعاد).\n\nAnd therein is the knowledge of assimilation (التشبيه) and the inverse of assimilation, and what is the fundamental principle upon which assimilation occurs.\n\nAnd therein is the knowledge of the effect of the convergence of opposites (اجتماع الأضداد) from the Divine Knowledge (العلم الإلهي), and the existence of fire in water and water in fire.\n\nAnd therein is the knowledge of the attribute that manifested the World (العالم) in its essence.\n\nAnd therein is the knowledge of the Realm of Dominion (الملكوت) and its share of the Visible Kingdom (الملك) and the Realm of Power (الجبروت). And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (says the Truth, and He guides to the way).",
    "ur": "باب نمبر تین سو اڑتالیس: قلب الجمع (قلب الجمع) اور الوجود (الوجود) کے اسرار میں سے دو رازوں کے مقام کی معرفت کے بیان میں۔\n\nاگر کہا جائے کہ کیا کائنات کی ہستی (الوجود) میں اللہ کی رحمت سے زیادہ وسیع کوئی چیز ہے؟ تو کہو: وہ قلب ہے، جب وہ موجود ہو۔\nوہ ذات حق (الحق) کا گھر ہے، اس ایمان کے لیے جو اس میں قائم ہو، جب پرہیزگاری اور تقویٰ اسے مزین کرے۔\nوہ ذات حق (الحق) کو علم کے ذریعے گھیر لیتا ہے، جو اس کی صورت کا عین ہے، اور وہ (قلب) عزیز ہے جو اس کی (ذات حق کی) نظر میں حقیر ہے۔\nقلب میرا ملک ہے اور اس میں رہائش اس کے خالق کی ہے، میری زندگی، میری نگرانی، میرا ایمان اور میرا احسان (احسان) ہے۔\n\n### بے شک انصار اللہ کے کلمات ہیں، اللہ نے ان کے ذریعے اپنے دین کی مدد کی اور اسے غالب کیا۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"میں رحمن کی سانس (نفس الرحمن) کو یمن کی طرف سے آتا ہوا پاتا ہوں، پس اللہ نے انصار کے ذریعے ان سے سانس لیا (یا انصار کے ذریعے ان کی تنگی دور کی)۔\"\n\nپس انصار اللہ کے کلمات تھے، اللہ نے ان کے ذریعے اپنے دین کی مدد کی اور اسے غالب کیا۔ اور یہ مقام اسی تنفس رحمانی (التنفس الرحماني) کا مقام ہے۔ اور اسی مقام سے تمام الٰہی منازل ظاہر ہوئیں، اس عالم میں جو اللہ تعالیٰ کے سوا ہر چیز ہے، بلندی میں بھی اور پستی میں بھی، روح میں بھی اور جسم میں بھی، معنی میں بھی اور حس میں بھی، ظاہر میں بھی اور باطن میں بھی۔ پس اسی سے دس مقولات (مقولات العشر) ظاہر ہوئے، اور نبوی خبر میں اس کی خوشبو آئی جو ہم نے کہا۔ اور اس (مقام) کے عالم کے ہر جنس، نوع اور شخص کی طرف ایسے رخ ہیں جو کسی دوسرے جنس، نوع یا شخص کے لیے نہیں ہیں۔ اور اس منزل کی ایک صورت ہے اور ایک روح ہے، اور ایک الٰہی امداد ہے اس حیثیت سے کہ ذات حق (الحق) نے صورت کو اپنی طرف منسوب کیا، لیکن صورت کے باطن سے۔ اور اس امداد کا حکم اس منزل کی صورت کے ظاہر اور باطن میں جاری ہے، لیکن باطن میں یہ زیادہ مکمل ہے۔ اور اسی لیے جب ان الٰہی صفات کا اظہار کیا گیا تو اسم الباطن کو الاول، الآخر اور الظاہر کے بعد رکھا گیا، کیونکہ الٰہی امر بعد والے میں اس سے زیادہ مکمل اور کامل ہوتا ہے جو اس سے پہلے ہوتا ہے۔ پس اس میں وہ سب کچھ ہے جو پہلے میں ہے اور اس پر اضافہ بھی ہے۔ الٰہی ہستی (الوجود) کے کلمات اسی طرح ہیں۔ اور الآخر اپنے اندر الاول کو شامل کرتا ہے، اور الظاہر اپنے اندر الآخر اور الاول کو شامل کرتا ہے، اور الباطن اپنے اندر الظاہر، الآخر اور الاول کو شامل کرتا ہے۔ اور اگر الباطن کے بعد کوئی چیز آتی تو وہ الباطن اور اس سے پہلے والوں کو شامل کرتی، لیکن حصر نے ان چار کے سوا کسی پانچویں کو ہونے سے روک دیا، سوائے اس کی ہویت (ہویۃ) کے۔ اور عالم میں ان چار کے سوا کسی کا حکم نہیں ہے، اور ان چار کی صورت پر عالم ارواح اور عالم اجسام ظاہر ہوئے۔ اور ان دو کے سوا کوئی عالم نہیں ہے۔ پس الٰہیات میں سے علم، ارادہ، قدرت اور قول ہیں، جن سے عالم ارواح ظاہر ہوا جو طبیعت (الطبیعۃ) اور طبیعت سے باہر ہے۔ پھر ان چار الٰہیات سے طبیعت کو چار پر ظاہر کیا، اور اس سے عالم اجسام کو اس کے کثیف اور لطیف حصوں کے ساتھ ظاہر کیا، جیسا کہ ان چار الٰہیات سے عالم تدوین اور تسطیر (لکھنے اور ترتیب دینے کا عالم) میں عقل، نفس، طبیعت اور ہیولیٰ (ہیولیٰ) کو اجسام کے ظاہر ہونے سے پہلے ظاہر کیا۔ اور ارکان کو چار پر ظاہر کیا، جو آگ، ہوا، پانی اور مٹی ہیں۔ اور حیوانی نشأت کو چار اخلاط (مزاجوں) پر ظاہر کیا، اور ان اخلاط کے لیے چار قوتیں بنائیں: جاذبہ (کھینچنے والی)، ماسکہ (روکنے والی)، ہاضمہ (ہضم کرنے والی) اور دافعہ (دفع کرنے والی)۔ پس اس نے ہستی (الوجود) کو چوکور (تربیع) پر قائم کیا، اور اسے اپنے لیے ایک گھر کی مانند بنایا جو چار ارکان پر قائم ہے، کیونکہ وہ الاول، الآخر، الظاہر اور الباطن ہے۔ پس الباطن کے لیے حجر اسود کا رکن ہے، کیونکہ وہ زمین میں اللہ کا دایاں ہاتھ ہے جو اللہ سے بیعت کی طرف متوجہ ہے۔ پس آنکھ حجر پر پڑتی ہے اور بصیرت دائیں ہاتھ پر پڑتی ہے۔ پس دایاں ہاتھ حجر کا باطن ہے جو آنکھ کے لیے ظاہر نہیں ہے۔ پس حجر کا رکن باقی تمام ارکان پر شرف رکھتا ہے۔ پس باطن کا حکم ان تین صفات کے حکم کو شامل کرتا ہے جو باطن سے پہلے ہیں، اور یہی وہ مقام ہے جو اس منزل کے لیے مخصوص ہے۔ اور اس منزل کا لب لباب وہ الٰہی صورت ہے جس سے اس کے لیے امداد ہوتی ہے، اور اس صورت کا لب لباب اس کی روح ہے، اور وہ لب اللب ہے، اور وہ اس منزل کے لیے امداد کا خزانہ ہے۔ اور اس منزل کو پورے عالم پر کنٹرول حاصل ہے، جیسے: **كَمِشْكاةٍ فِيها مِصْباحٌ الْمِصْباحُ في زُجاجَةٍ الزجاجة يُوقَدُ من شَجَرَةٍ** (جیسے ایک طاق جس میں چراغ ہو، چراغ ایک شیشے کی قندیل میں ہو، قندیل ایک درخت سے روشن کی جائے) [النور: 35]، جو اس کی ہویت (ہویۃ) ہے، پس وہ **لا شَرْقِيَّةٍ ولا غَرْبِيَّةٍ** (نہ مشرقی ہے اور نہ مغربی)، وہ جہات کو قبول نہیں کرتی۔ اس زیتون کے درخت سے تیل نکلتا ہے، اور وہ اس نور کے ظہور کا مادہ ہے۔ پس یہ چار ہیں: طاق (مشکاۃ)، قندیل (زجاجہ)، چراغ (مصباح) اور تیل (زیت)۔ اور پانچواں ہویت (ہویۃ) ہے، جو زیتون کا درخت ہے جو جہات سے پاک ہے۔ اور اسے شجرہ (درخت) سے کنایہ کیا گیا ہے، جو تشاجر (اختلاف) سے ہے، یعنی تضاد، اس لیے کہ یہ ہویت (ہویۃ) متقابل اسماء کو اپنے اندر رکھتی ہے، جیسے المعز (عزت دینے والا) اور المذل (ذلت دینے والا)، الضار (نقصان پہنچانے والا) اور النافع (نفع دینے والا)۔ پس دیکھو کہ الٰہی عبارات کتنی کامل ہیں اس بات کی خبر دینے میں کہ امر کس طرح ہے۔ پس جو شخص اس منزل میں داخل ہوا اور عالم اور اس کی حقائق (الحقائق) میں سے کوئی چیز اس سے چھوٹ گئی، تو وہ اس میں داخل نہیں ہوا، بلکہ شیطان یا نفس نے اسے یہ وہم دلایا کہ وہ داخل ہو گیا ہے۔ **وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَكِنْ شُبِّهَ لَهُمْ** (اور نہ انہوں نے اسے قتل کیا اور نہ سولی دی، بلکہ ان کے لیے شبہ پیدا کر دیا گیا) [النساء: 157]، کیونکہ حضرۃ الخیال (خیال کی موجودگی) ہر صورت کو پیدا کرتی ہے۔ اور بہت سے لوگ اس خیالی حضرۃ میں داخل ہوتے ہیں اور ان صورتوں کا مشاہدہ کرتے ہیں جو ان پر ظہور الٰہی (التجلی) کرتی ہیں، تو وہ گمان کرتے ہیں کہ انہوں نے ثابت العین ہستی (الوجود) کا مشاہدہ کیا ہے جیسا کہ وہ ہے، حالانکہ وہ صرف وہی تھا جو خیال نے صورت دی تھی۔ پس جو شخص اس طرح کی آزمائش میں مبتلا ہو، اسے تھوڑا انتظار کرنا چاہیے، اگر جو وہ دیکھ رہا ہے وہ ہستی (الوجود) میں ثابت العین روح ہے یا آنکھ سے محسوس ہونے والی چیز ہے، تو وہ ثابت رہے گا اور تبدیل نہیں ہوگا، اور اگر وہ خیال ہے تو وہ ثابت نہیں رہے گا اور فوراً اس میں تبدیلی آ جائے گی، اور وہ اس میں تبدیلی کی صورت دیکھے گا اور جان لے گا کہ جو چیز تبدیلی کے ساتھ ظاہر ہوئی ہے وہ عین پہلی چیز ہے۔ اور بعض لوگ اپنے آپ کو دو یا زیادہ صورتوں میں دیکھتے ہیں اور جانتے ہیں کہ وہ وہی ہیں، پس اس سے حسی اور روحانی طور پر اپنی عین میں ثابت صورتوں اور خیالی صورتوں کے درمیان فرق کیا جاتا ہے۔ اور یہ اس شخص کے لیے اس کا میزان ہے جسے معرفت (المعرفۃ) نہیں ہے۔ پس میں نے تمہیں متنبہ کر دیا اور نصیحت کر دی، اگر تم اہل کشف (الکشف) میں سے ہو تو اس میزان سے غافل نہ ہونا۔ اور اللہ نے حیوانی عالم میں نیند کو صرف اس لیے نہیں رکھا مگر عمومی طور پر حضرۃ الخیال (خیال کی موجودگی) کا مشاہدہ کرنے کے لیے، تاکہ وہ جان لے کہ وہاں ایک اور عالم ہے جو حسی عالم سے مشابہت رکھتا ہے، اور اسے عقل مندوں کے لیے سونے والوں کی ان خیالی صورتوں کے تیزی سے بدل جانے سے متنبہ کیا کہ حسی عالم اور ثابت کائنات میں بھی سانسوں کے ساتھ تبدیلیاں ہوتی ہیں، لیکن آنکھیں اور حواس انہیں نہیں پا سکتے، سوائے خاص طور پر کلام اور حرکات میں۔ اور ان دو قسموں کے علاوہ، ان میں تبدیلیوں اور تغیرات کی صورت کو صرف بصیرت (یعنی کشف (الکشف)) یا صحیح فکر کے ذریعے ہی پایا جا سکتا ہے، لیکن ان سب میں نہیں، کیونکہ فکر اس سے قاصر ہے۔ اور اس سب کی اصل، یعنی خیال میں یا حس میں یا عالم میں جہاں کہیں بھی ایک صورت سے اس جیسی یا اس کے خلاف دوسری صورت میں تبدیلی کی اصل، یہ ہے کہ یہ سب ہمیشہ ہمیشہ کے لیے بدلتا رہتا ہے، کیونکہ اس اصل میں تبدیلی آتی ہے جو اسے مدد دیتی ہے، اور وہ ہے الٰہی تحول (التحول الإلهي) جو صحیح حدیث میں وارد ہے۔ پس وہاں سے یہ معانی اور صورتوں میں ظاہر ہوا۔\n\nپس ایک معنی سے دوسرے معنی کی طرف\nاور ایک صورت سے دوسری صورت کی طرف\n\nاور یہ اس کا قول ہے: **كُلَّ يَوْمٍ هُوَ في شَأْنٍ** (وہ ہر دن ایک نئی شان میں ہوتا ہے) [الرحمن: 29]، اور یہ وہ تبدیلیاں ہیں جو وہ کائنات میں پیدا کرتا ہے۔ پس ہر صورت میں اس کی تبدیلی کا حکم ظاہر ہونا ضروری ہے جو صرف اسی بدلنے والی چیز کے لیے ہوتا ہے۔ اگر تم سمجھ گئے تو میں نے تمہارے لیے امر کو واضح کر دیا جیسا کہ وہ ہے۔ پس **إِنَّ في ذلِكَ لَذِكْرى‏** (بے شک اس میں نصیحت ہے) [ق: 37]، یعنی عالم کی تبدیلی میں اصل کی تبدیلی کی نصیحت ہے، **لِمَنْ كانَ لَهُ قَلْبٌ** (اس کے لیے جس کے پاس قلب ہو) [ق: 37]، کیونکہ قلب میں ایک حال سے دوسرے حال میں پلٹنا ہوتا ہے، اور اسی وجہ سے اسے قلب (پلٹنے والا) کہا جاتا ہے۔ پس جس نے قلب کی تفسیر عقل سے کی، اسے حقائق (الحقائق) کی معرفت (المعرفۃ) نہیں ہے۔ کیونکہ عقل عِقال (رسی) سے قید کرنا ہے۔ اگر وہ عقل سے مراد وہ قید لینا چاہتا ہے جو ہم چاہتے ہیں، یعنی جو پلٹنے سے مقید ہو اور پلٹتا رہے، تو یہ صحیح ہے، جیسا کہ ہم تلوین (رنگ بدلنے) میں تمکین (استحکام) کے بارے میں کہتے ہیں، پس وہ ہمیشہ رنگ بدلتا رہتا ہے۔ اور ہر کوئی اس کا احساس نہیں کرتا۔ اور جب ہم نے جانا کہ زمانے کی صفت قلب کا تحول (پلٹنا) ہے، اور اللہ ہی دہر (زمانہ) ہے، اور یہ ثابت ہو گیا کہ وہ صورتوں میں بدلتا ہے اور وہ ہر دن ایک نئی شان میں ہوتا ہے، اور دن نفس کی مقدار ہے، تو یہ اس کے اسم الدہر سے ہے، کسی دوسرے اسم سے نہیں، اگر تم عقل کرو۔ پس اگر انسان اپنے قلب کی نگرانی کرے تو وہ دیکھے گا کہ وہ ایک حال پر باقی نہیں رہتا، تو وہ جان لے گا کہ اگر اصل اس مرتبے پر نہ ہوتی تو اس پلٹنے کا کوئی سہارا نہ ہوتا، کیونکہ وہ اس کے خالق کی دو انگلیوں کے درمیان ہے، اور وہ رحمن ہے۔ پس انگلیوں کا قلب کو پلٹنا اس حال کے بغیر ہے جس میں وہ قلب کو پلٹنا چاہتا ہے۔\n\nجس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا۔\n\nاور انگلیوں کی حدیث میں ایک الٰہی بشارت ہے، جہاں اس نے انہیں رحمن کی طرف منسوب کیا ہے۔ پس وہ اسے صرف رحمت سے رحمت کی طرف پلٹاتا ہے، اگرچہ پلٹنے کی اقسام میں آزمائش ہو، لیکن اس کے اندر ایک پوشیدہ رحمت ہے جسے ذات حق (الحق) جانتا ہے، کیونکہ دونوں انگلیاں رحمن کی انگلیاں ہیں۔ پس سمجھو! کیونکہ جب تم نے وہ جان لیا جو ہم نے ذکر کیا، تو تم جان لو گے کہ ہستی (الوجود) کا قلب کون ہے جو اپنی صورت کے عالم کو مدد دیتا ہے جس کا وہ قلب ہے اور اس کے تمام اجزاء کو بھی، اور یہ کہ وہ قلب الجمع (قلب الجمع) ہے، اور یہ وہ ہے جسے اس وجودی صورت نے ظاہری اور باطنی حقائق (الحقائق) سے جمع کیا ہے۔ پس جب اللہ **كُلَّ يَوْمٍ هُوَ في شَأْنٍ** (ہر دن ایک نئی شان میں ہوتا ہے) [الرحمن: 29]، تو عالم کا پلٹنا جو اس قلب کی صورت ہے، سانسوں کے ساتھ ایک حال سے دوسرے حال میں ہوتا ہے۔ پس عالم کبھی بھی ایک لمحے کے لیے ایک حال پر ثابت نہیں رہتا، کیونکہ اللہ ہمیشہ خالق ہے۔ اور اگر عالم ایک لمحے کے لیے ایک حال پر باقی رہتا تو وہ اللہ سے بے نیاز ہونے کی صفت سے متصف ہوتا، لیکن لوگ **لَبْسٍ مِنْ خَلْقٍ جَدِيدٍ** (نئی تخلیق کے شک) میں ہیں [ق: 15]۔ پس پاک ہے وہ ذات جس نے اہل کشف (الکشف) اور الوجود (الوجود) کو احوال کے پلٹنے میں پاکیزگی اور مشاہدہ عطا کیا، اس کے لیے جو ہر دن ایک نئی شان میں ہوتا ہے۔ اور اللہ ہی دہر (زمانہ) ہے۔ پس اس دہر کے حکم کے لیے عالم اکبر اور عالم اصغر (جو انسان ہے) میں کوئی فراغت نہیں ہے۔ اور یہ ان چار معلومات میں سے ایک ہے جن کا اثر ہوتا ہے۔ پس ہمارے لیے پہلا معلوم انسان ہے، اور دوسرا معلوم عالم اکبر ہے جو انسانی عالم کی ظاہری صورت ہے، اور انسان جو اس صورت کا قلب ہے، اور اس سے میری مراد صرف کامل (الإنسان الکامل) ہے جو مرتبے والا ہے۔ اور تیسرا معلوم وہ ہے، اور چوتھا معلوم حقیقۃ الحقائق (حقيقۃ الحقائق) ہے جس کا حکم قدم (ازلیت) اور حدوث (حادث ہونے) میں ہے۔ اور ان مذکورہ کے سوا کوئی پانچواں معلوم نہیں ہے جس کا اثر ہو۔ اور اسی منزل سے شعب الایمان (ایمان کی شاخیں) نکلتی ہیں، اور وہ ستر سے کچھ اوپر شاخیں ہیں، جن میں سب سے کم راستے سے تکلیف دہ چیز کو ہٹانا ہے، اور سب سے بلند قول لا الہ الا اللہ ہے۔ اور ان کے درمیان کی شاخیں ہیں۔ اور یہ منزل ایمان کی منزل ہے، اور اسی سے ایمان مومن کے قلب میں ظاہر ہوا، اور اس کے لیے خاص الٰہی اسماء میں سے اسم المؤمن ہے۔ پس یہاں سے مومن نے ایمان کی شاخیں شروع کیں اور انہیں واضح کیا۔ اور اسی منزل سے امت محمدیہ نے اپنی عمریں حاصل کیں۔ پس اس امت محمدیہ کی عمر کی انتہا ستر سال ہے، اس سے زیادہ نہیں ہوتی۔ اگر زیادہ ہو تو وہ محمدی نہیں ہے، بلکہ وہ ان انبیاء میں سے کسی کا وارث ہے جنہیں اللہ نے چاہا، آدم سے لے کر خالد بن سنان تک، تو اس کی عمر اتنی لمبی ہوتی ہے جتنی اس کی جس کا وہ وارث ہے۔ اور اسی لیے\n\nنبی صلی اللہ علیہ وسلم نے اپنی امت کی عمروں کے بارے میں فرمایا: \"وہ ساٹھ سے ستر کے درمیان ہیں۔\"\n\nپس آپ نے ستر کو اپنی امت کی عمر کی انتہا قرار دیا، تو ہم نے جان لیا کہ آپ اپنی امت سے صرف محمدیوں کو مراد لیتے ہیں جنہیں اللہ نے اس مرتبے کے ساتھ خاص کیا جو اس نے اپنے نبی کو تمام انبیاء پر احکام اور مراتب میں خاص کیا، کیونکہ ہم **خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ** (بہترین امت ہیں جو لوگوں کے لیے نکالی گئی) [آل عمران: 110]۔ اور ہر حکم اور مرتبہ جو آپ سے پہلے کسی نبی کے لیے تھا، اگرچہ وہ آپ کے لیے بھی تھا اور اس میں آپ کی شرکت واقع ہوئی، لیکن وہ صرف آپ کے لیے خالص نہیں ہوا، اور آپ کے لیے کامل شرف صرف اسی میں ہے جو آپ کے لیے دوسروں کے بغیر خالص ہوا۔ پس آپ کی امت بھی آپ کی طرح ہے۔ پس جو شخص دنیا سے جدا ہوتے وقت یا اپنے حال میں اس امت کے مشترکہ شریعت پر ہو، ہم اسے اس کی طرف منسوب کرتے ہیں جو محمد صلی اللہ علیہ وسلم کے ظہور سے پہلے اس کے ذریعے ظاہر ہوا، تاکہ دونوں امور کے درمیان فرق ظاہر ہو اور دونوں شخصوں کا مرتبہ معلوم ہو، اگرچہ اس نے جو کچھ لیا وہ محمد صلی اللہ علیہ وسلم کی تقریر سے ہی لیا، پس وہ آپ کی امت میں سے ہے، لیکن اشتراک کا حکم اختصاص کے حکم سے ممتاز ہوتا ہے۔ اور آپ صلی اللہ علیہ وسلم نے تریسٹھ سال کی عمر میں وفات پائی۔ اور جو شخص ستر سال سے زیادہ عمر پاتا ہے، خواہ وہ کتنا ہی ہو، اگرچہ وہ آپ کی امت میں سے ہو اور اسے مکمل محمدی اختصاص حاصل ہو، لیکن جب اسے قبض کیا جاتا ہے تو وہ صرف مشترکہ شریعت کے حکم میں ہوتا ہے۔ اور یہ اس کے لیے کوئی نقص نہیں ہے، کیونکہ اسے اختصاص کا حکم حاصل ہو چکا ہے، لیکن اس کا ستر سے باہر نکل جانا جسے رسول اللہ صلی اللہ علیہ وسلم نے اختصاصی حکم میں قبض کیے جانے والے اپنی امت کی عمر کی غالب انتہا قرار دیا، اسے اس بات پر مجبور کرتا ہے کہ اس کے اور امت کے دوسرے لوگوں کے درمیان فرق کیا جائے۔ اور یہ ان علوم میں سے ہے جو رائے اور قیاس سے نہیں پائے جاتے، بلکہ یہ الٰہی وہبی علوم میں سے ہے۔ اور اسی طرح یہ بھی ذکر کیا گیا ہے کہ چاروں خلفاء میں سے ہر ایک تریسٹھ سال کی عمر کو پہنچے بغیر فوت نہیں ہوا، اس بات کو ثابت کرنے کے لیے کہ انہیں محمدی اختصاص کے حکم میں قبض کیا گیا، نہ کہ مشترکہ شریعت کے حکم میں۔ پس اسی منزل سے یہ چاروں دوسروں سے ممتاز ہوئے، اور اسی منزل سے وہ دس بھی ممتاز ہوئے جو ابوبکر، عمر، عثمان، علی، سعد، سعید، طلحہ، زبیر، عبدالرحمن بن عوف اور ابوعبیدہ بن الجراح ہیں۔ پس یہ ان کا مقام ہے جہاں سے رسول اللہ صلی اللہ علیہ وسلم نے انہیں ممتاز کیا اور ایک ہی مجلس میں ان کے نام لے کر جنت کی گواہی دی۔ کیونکہ جنت کی گواہی دیے جانے والے بہت سے ہیں، لیکن ایک ہی مجلس میں نہیں، اور وہ ایک خاص صفت کے ساتھ مقید ہیں، جیسے ستر ہزار لوگ جو **يَدْخُلُونَ الْجَنَّةَ ... بِغَيْرِ حِسابٍ** (جنت میں داخل ہوں گے... بغیر حساب کے) [متفق علیہ]۔ اور ان میں سے عکاشہ بن محصن کو ممتاز کیا گیا، اور آپ نے **بِغَيْرِ حِسابٍ** (بغیر حساب کے) کہہ کر متنبہ کیا، یعنی یہ ان کے حساب میں نہیں تھا، اور نہ انہوں نے اس کا تصور کیا تھا، پس ان کے لیے اللہ کی طرف سے ایسی بھلائی ظاہر ہوئی جس کا انہوں نے حساب نہیں لگایا تھا۔ اور وہ وہ لوگ ہیں جو نہ جھاڑ پھونک کرواتے ہیں، نہ داغ لگواتے ہیں، نہ بدشگونی لیتے ہیں، اور **وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ** (اور وہ اپنے رب پر توکل کرتے ہیں) [النحل: 99]۔ پس آپ کا قول \"لا یسترقون\" (نہ جھاڑ پھونک کرواتے ہیں) یعنی وہ کسی تکلیف کو دور کرنے کے لیے رقیہ (جھاڑ پھونک) کا مطالبہ نہیں کرتے، اور نہ ہی کسی کو رقیہ کرتے ہیں۔ اور مبالغہ کے لیے استفعال (طلب کرنے کا صیغہ) لایا گیا۔ اور نبی صلی اللہ علیہ وسلم نے رقیہ کروایا اور اپنی بیماری میں طب کا استعمال کیا، کیونکہ آپ کی پیروی کی جاتی ہے، پس کمزور اور طاقتور دونوں آپ کی پیروی کرتے ہیں، کیونکہ آپ عالمین کے لیے رحمت ہیں۔ اور تمام رسول بھی اسی طرح ہیں۔ پس ان کا حکم ان کی امتوں کا حکم نہیں ہے۔ پس یہ ان کے مقام میں کوئی نقص نہیں ہے۔ پس ان کا مقام مجہول ہے، جہاں وہ اپنی امتوں کے سامنے قوت اور ضعف کی صورت میں ظاہر ہوتے ہیں، پس کوئی نہیں جانتا کہ انہیں کس مقام سے منسوب کیا جائے۔ اور آپ کا قول \"ولا یتطیرون\" (نہ بدشگونی لیتے ہیں)، کیونکہ طائر (پرندہ) سے مراد حصہ (حظ) ہے۔ پس وہ اپنے نفسوں کے حصوں سے باہر ہیں، اور ان کاموں میں مشغول ہیں جن کا اللہ نے انہیں مکلف کیا ہے، اس ربوبیت کا حق ادا کرنے کے لیے جو ان پر واجب ہے، وہ اس سے اپنے نفسوں کے لیے کوئی حصہ نہیں چاہتے، اس اجر سے جو اللہ نے ان کے اعمال پر وعدہ کیا ہے۔ پس انہیں عمل پر اس اجر نے نہیں ابھارا جو اس سے منسلک ہے، بلکہ اس مقام کے حق کو ادا کرنے نے ابھارا جو ہم نے ذکر کیا۔ پس یہ \"لا یتطیرون\" کا معنی ہے، یعنی وہ حصوں پر عمل نہیں کرتے۔ اور آپ کا قول \"ولا یکتوون\" (نہ داغ لگواتے ہیں)، کیونکہ داغ لگانا صرف آگ سے ہوتا ہے، اور اللہ نے انہیں اس سے محفوظ رکھا ہے کہ آگ انہیں چھوئے، پس وہ اپنے نفسوں میں پاتے ہیں کہ وہ داغ نہیں لگواتے، اور یہ ایک الٰہی عصمت ہے جہاں سے انہیں شعور نہیں ہوتا۔ اور آپ کا قول **وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ** (اور وہ اپنے رب پر توکل کرتے ہیں) [النحل: 99]، یعنی وہ اسے وکیل بناتے ہیں، پس وہ اس پر توکل کرتے ہیں جیسے موکل وکیل پر توکل کرتا ہے۔ اور یہ ایک درمیانی معرفت (المعرفۃ) ہے جو انہیں دوسرے مقصد سے حاصل ہوئی، پس انہوں نے دیکھا کہ اللہ نے چیزوں کو ان کے لیے پیدا کیا اور انہیں اپنے لیے پیدا کیا، پس انہوں نے اسے ان چیزوں میں وکیل بنایا جو ان کے لیے پیدا کی گئیں تاکہ وہ اس کے لیے فارغ ہو جائیں جس کے لیے وہ پیدا کیے گئے تھے۔ اور ہم نے اسے درمیانی مرتبہ اس لیے کہا کہ اس سے اوپر ایک بلند مرتبہ ہے، اور وہ پہلا مقصد ہے۔ کیونکہ اللہ نے عالم میں کوئی چیز پیدا نہیں کی مگر اپنے لیے تاکہ وہ اس کی حمد کے ساتھ تسبیح کرے، اور ہم عنایت اور تبعیت کے حکم سے فائدہ اٹھاتے ہیں۔ اور دوسرا مقصد یہی ہے، کیونکہ جب اس نے ہمیں برابر کیا اور ہمارے لیے **مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعًا مِّنْهُ** (جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے، سب اپنی طرف سے) [الجاثیہ: 13] مسخر کر دیا، تو انسانی اور غیر انسانی عالم میں تخلیق کے دو مقصد ہیں۔ جو اپنے تمام معاملات میں اس پر توکل کرتا ہے، کیونکہ وہ اس بات پر ایمان رکھتا ہے کہ اللہ تعالیٰ کے لیے ہر چیز میں ایک رُخ ہے۔ اور یہ بات صرف مومن ہی کہتا ہے، کیونکہ غیر مومن، خاص طور پر انسانوں میں سے، وہ ہے جو کہتا ہے کہ اللہ سے علت کے طریقے پر صرف ایک ہی چیز وجود میں آئی، اور اسے عالم کے جزئیات کا تفصیلی علم نہیں ہے، مگر صرف کلی علم کے ذریعے جس میں تمام جزئیات کا علم شامل ہے۔ اسی لیے توکل کو مومنوں میں رکھا گیا، اللہ تعالیٰ نے فرمایا: **وَعَلَى اللَّهِ فَتَوَكَّلُوا إِن كُنتُم مُّؤْمِنِينَ** (اور اللہ پر ہی توکل کرو اگر تم مومن ہو) [المائدہ: 23]۔ پس اس نے توکل کو بندے کے قلب میں ایمان کے وجود کی علامت قرار دیا۔ اور اسے وکیل صرف متوکل مومنوں کے ایک مخصوص گروہ نے بنایا جنہوں نے اس بارے میں اللہ کے حکم کی تعمیل کی، اس کے قول میں: **فَاتَّخِذْهُ وَكِيلًا** (پس اسے وکیل بنا لو) [المزمل: 9]۔ پس جسے ہستی (الوجود) کا علم نہیں ہے، وہ چیزوں میں یہ خیال کرتا ہے کہ تم مال کے مالک ہو، پس تم نے اسے وکیل بنایا ہے، پاک ہے وہ، اس چیز میں جو تمہاری ملکیت ہے، اور یہ کہ تمہارے اموال کی تمہاری طرف نسبت، اس کے قول میں \"اموالکم\" (تمہارے اموال)، ملکیت کی نسبت ہے۔ حالانکہ اسے یہ علم نہیں کہ وہ نسبت استحقاق کی نسبت ہے، جیسے جانور کا زین اور گھر کا دروازہ، نہ کہ ملکیت کی نسبت۔ اور جو ہم اور اکابر دیکھتے ہیں وہ یہ ہے کہ اللہ نے ہم سے فرمایا: **وَأَنفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ** (اور خرچ کرو اس میں سے جس میں اس نے تمہیں نائب بنایا ہے) [الحدید: 7]۔ پس وہ ہمارا نہیں ہے، تو ہم نے اسے وکیل بنایا اور اسے خرچ کرنے میں وکیل بنایا جو ہماری ملکیت ہے، کیونکہ ہم وکیل کے مصالح اور خرچ کرنے کی جگہوں کے علم کو جانتے ہیں جہاں اسراف یا تنگی کا حکم داخل نہیں ہوتا۔ پس اللہ نے ہم پر خرچ کرنے کی ذمہ داری لی، اس طرح کہ اس نے ہمیں الہام کیا کہ ہم کہاں خرچ کریں اور کب خرچ کریں۔ پس خرچ ہمارے ہاتھوں سے ظاہر ہوتا ہے، تو ہمارا ہاتھ خرچ کرنے میں وکیل کا ہاتھ ہے۔ پس ہم خرچ کرنے میں معصوم ہیں، کیونکہ ہم وجوہات کو جانتے ہیں، اور اس لیے کہ ہمارا ہاتھ حق کا ہاتھ ہے، کیونکہ یہ وکیل کا ہاتھ ہے۔ اور یہ صرف الٰہی کشف (الکشف) سے ہی معلوم ہوتا ہے۔ پس وہ توکل میں اس مرتبے پر ہیں، اور انہیں اس کا شعور نہیں ہے، کیونکہ اس نے کہا \"بغیر حساب کے\"۔ پس وہ بغیر بصیرت کے ہیں، اور ان کے افعال اہل بصیرت کے افعال ہیں، الٰہی عنایت سے: **يَخْتَصُّ بِرَحْمَتِهِ مَن يَشَاءُ** (وہ جسے چاہتا ہے اپنی رحمت کے ساتھ خاص کر لیتا ہے) [آل عمران: 74]، اور **وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ** (اور اللہ بڑے فضل والا ہے) [آل عمران: 74]، اور فضل زیادتی ہے۔\n\n### عالم کا وجود اس واجب الوجود (الواجب الوجود) سے مربوط ہے جو اپنی ذات کے لیے ہے۔\n\nاور جان لو کہ جب عالم کی اصل یہ تھی کہ اس کا وجود واجب الوجود (الواجب الوجود) سے مربوط ہو جو اپنی ذات کے لیے ہے، تو اس کا بعض حصہ بعض سے مربوط ہو گیا، پس جب انسان اس کے علم میں غور کرنا شروع کرتا ہے تو امر اس میں تسلسل پیدا کرتا ہے، پس وہ اسے ایک چیز سے دوسری چیز کی طرف نکالتا ہے، اس ربط کے حکم سے جو اس میں ہے۔ اور یہ صرف اہل اللہ کے علم میں ہی ہوتا ہے، پس یہ ان علماء کے قانون پر نہیں چلتا جو رسوم اور کائنات کے علماء ہیں۔ پس ان کا قانون عالم کا بعض کا بعض سے مربوط ہونا ہے۔ اسی لیے تم انہیں ایک چیز سے دوسری چیز کی طرف نکلتے ہوئے دیکھتے ہو، اگرچہ عالم رسوم اسے غیر مناسب سمجھے۔ اور یہی اللہ کا علم ہے۔ اور معلوم ہے کہ مناسبت وہاں موجود ہے، لیکن انتہائی پوشیدگی میں، جیسے اللہ تعالیٰ کا قول: **حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَىٰ وَقُومُوا لِلَّهِ قَانِتِينَ** (تمام نمازوں کی اور خاص طور پر درمیانی نماز کی حفاظت کرو، اور اللہ کے لیے فرمانبردار بن کر کھڑے ہو جاؤ) [البقرہ: 238]۔ پس اس نے نماز کی آیت لائی، اور اس سے پہلے نکاح اور طلاق کی آیات تھیں، اور اس کے بعد وفات اور وصیت کی آیات اور دیگر چیزیں تھیں جن کے درمیان اور نماز کے درمیان ظاہر میں کوئی مناسبت نہیں ہے۔ اور اگر نماز کی آیت اس جگہ سے ہٹا دی جاتی اور اس کے بعد والی آیت اس سے پہلے والی آیات سے مل جاتی تو ہر دو آنکھوں والے کے لیے مناسبت ظاہر ہو جاتی۔ پس اہل اللہ کا علم اسی طرح ہے۔ جنید سے توحید کے بارے میں پوچھا گیا، تو انہوں نے سائل کو ایک امر سے جواب دیا، تو اس نے کہا: میں نہیں سمجھا، دوبارہ بتائیں۔ تو انہوں نے دوسرے امر سے جواب دیا، تو سائل نے کہا: میں نہیں سمجھا، تو انہوں نے تیسرے امر سے جواب دیا، پھر فرمایا: امر اسی طرح ہے۔ تو اس نے کہا: مجھے لکھوا دیں۔ تو انہوں نے فرمایا: اگر میں اسے جاری کر رہا ہوتا تو میں اسے لکھوا دیتا۔ وہ کہتے ہیں کہ میں اپنی خواہش سے نہیں بولتا، بلکہ وہ اللہ کا علم ہے، میرا علم نہیں۔ پس جس نے قرآن کو جانا اور اس کی حقیقت کو پایا، اس نے اہل اللہ کے علم کو جانا، اور یہ کہ وہ محدود فصول کے تحت نہیں آتا اور نہ ہی کسی منطقی قانون پر چلتا ہے اور نہ ہی اس پر کوئی میزان حکم کرتا ہے، کیونکہ وہ ہر میزان کا میزان ہے۔ پس اس منزل کے لیے عالم اجسام میں افلاک میں سے فلک شمس ہے۔ پس اس کے اوپر سات ہیں، جن میں سے تین آسمان ہیں، اور فلک منزل، اور فلک اطلس (فلك البروج)، اور کرسی، اور عرش محیط، اور یہ عالم اجسام کی انتہا ہے۔ اور اس کے نیچے بھی سات ہیں: تین آسمان، اور کرات اثیر، ہوا، پانی اور زمین۔ اور ان کے فلک میں کٹنے سے سال کے موسم ظاہر ہوتے ہیں، اور وہ چار موسم ہیں، اس چوکور (تربیع) کے وجود کی وجہ سے جو ہم نے ذکر کیا۔ کیونکہ بروج جو فلک اطلس میں تقدیرات ہیں، وہ چوکور ہیں، اللہ نے انہیں چار مراتب پر بنایا ہے: ناری، ترابی، ہوائی اور مائی، چار الٰہی اور چار طبعی احکام کی وجہ سے۔ اور ہر موسم کے تین احکام ہیں: دو احکام اطراف کے لیے اور ایک حکم وسط کے لیے، اور ان کے درمیان ہر حرکت، دقیقہ، ثانیہ اور ثالثہ میں احکام ہیں، جن کی تقسیم کی کوئی انتہا نہیں ہے۔ اور اس نے ہماری طرف سے دوسرے آسمان کے ستارے کو ممزوج بنایا، اور وہ کاتب (عطارد) ہے۔ اور اسی لیے عیسیٰ علیہ السلام کو اس میں ٹھہرایا، کیونکہ وہ دو عالموں سے ممزوج ہیں، کیونکہ وہ ایک فرشتہ اور ایک بشر کے درمیان ظاہر ہوئے، اور وہ جبرائیل اور مریم ہیں۔ پس وہ روح سے روح ہیں اور بشر سے بشر۔ اور اس نوع میں یہ کسی اور کے لیے نہیں بنایا گیا، جیسا کہ جواری خنس (چھپنے والے ستارے) میں سے کسی کو کاتب کی صورت پر نہیں بنایا گیا۔ پس وہ وہاں سے چھٹا ہے تاکہ اسے اس قول کا شرف حاصل ہو: **وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ** (اور نہ پانچ مگر وہ چھٹا ہوتا ہے) [المجادلہ: 7]۔ اور وہ ہماری طرف سے دوسرا ہے، کیونکہ دوسرا باء (ب) ہے، اور وہ پہلا مبدع (پیدا کرنے والا) ہے، جو انسان سے ظاہر ہوا جو الٰہی صورت کا سایہ ہے جو ہمیشہ سے ہے۔ پس وہ پہلا ہے، نہ کہ ذات حق (الحق) کی اولیت، کیونکہ ذات حق کی اولیت دوسرے کو قبول نہیں کرتی، کیونکہ واحد عدد نہیں ہے، اور عدد کی ابتدا دو ہے۔ پس سال میں امتزاج موسموں کے ظہور سے ظاہر ہوا۔\n\n### بے شک اللہ ہی دہر (زمانہ) ہے۔\n\nاور جان لو کہ جب اللہ نے ہمیں بتایا کہ وہ ہی دہر (زمانہ) ہے، تو اس نے ہمیں بتایا کہ دہر ہونے کی حیثیت سے اس کے دن ہیں، اور وہ اللہ کے دن ہیں۔ پس ان دنوں نے عالم میں اس کے اسماء تعالیٰ کے احکام کو متعین کیا۔ پس ہر اسم کے دن ہیں، اور وہ اس اسم کے حکم کا زمانہ ہے، اور سب اللہ کے دن ہیں اور عالم میں حکم کے ذریعے دہر کی تفصیلات ہیں۔ اور یہ دن آپس میں داخل ہوتے ہیں، اور بعض بعض میں داخل ہوتے ہیں اور بعض بعض کو ڈھانپ لیتے ہیں، اور یہی وہ ہے جو ہم عالم میں ایک ہی وقت میں احکام کے اختلاف میں دیکھتے ہیں۔ پس یہ ان کے آپس میں داخل ہونے، ڈھانپنے، پلٹنے اور دہرانے کی وجہ سے ہے۔ اور ان الٰہی دنوں کے لیے رات اور دن ہیں۔ پس ان کی رات غیب ہے، اور وہ وہ ہے جو ہم سے غائب ہے، اور وہ طبیعت (الطبیعۃ) سے اوپر کی علوی ارواح اور ارواح مہیمہ (ارواح مہیمہ) میں ان کے حکم کا عین ہے۔ اور ان کا دن شہادت (ظاہر) ہے، اور وہ عنصری اجسام تک طبعی اجسام میں ان کے حکم کا عین ہے، اور وہ طبیعت سے نیچے ہیں۔ اور اس دن کی سدفہ (شفق/تاریکی) ان دنوں کے حکم کا عین ہے مسخر ارواح میں جو طبیعت سے نیچے ہیں، اور وہ آسمانوں اور زمین اور ان کے درمیان کے آباد کرنے والے ہیں، اور وہ صف باندھنے والے، تلاوت کرنے والے اور تسبیح کرنے والے ہیں۔ اور وہ معلوم مقامات پر ہیں، پس ان میں سے زاجرات (جھڑکنے والے)، مرسلات (بھیجنے والے)، مقسمات (تقسیم کرنے والے)، منقیات (پاک کرنے والے)، نازعات (کھینچنے والے)، ناشطات (آسانی سے نکالنے والے)، مدبرات (تدبیر کرنے والے) اور دیگر ہیں، جیسے سیاحین (سیر کرنے والے)، عارجین (اوپر چڑھنے والے)، کاتبین (لکھنے والے) اور راقبین (نگرانی کرنے والے)۔ یہ سب ان دنوں کی سدفہ کے حکم کے تحت ہیں۔ پس ان دنوں کے دن کے رات کو ڈھانپنے سے وہ ارواح وجود میں آئیں جو طبیعت سے اوپر ہیں، اور ان دنوں کی رات کے دن کو ڈھانپنے سے وہ اجسام وجود میں آئے جو طبیعت سے نیچے ہیں۔ اور ان کی رات کے دن کے ساتھ داخل ہونے سے، جو نہ خالص دن ہے رات کے حکم اور شرکت کی وجہ سے، اور نہ خالص رات ہے دن کے حکم اور شرکت کی وجہ سے، اور یہ حال ان دنوں کے لیے سدفہ کہلاتا ہے، اس توالج (داخل ہونے) سے وہ ارواح وجود میں آئیں جو طبیعت سے نیچے ہیں۔ اور جب اللہ نے اپنے ان دنوں کو ان حصوں میں تقسیم کیا، تو اس نے ان کی رات کو تین حصوں میں اور ان کے دن کو تین حصوں میں تقسیم کیا۔ پس وہ سبحانہ اپنے بندوں کے لیے اپنے دنوں کی رات کے آخری تہائی میں نازل ہوتا ہے، اور وہ اس میں عنصری اجسام کی تدبیر کرنے والی طبعی ارواح پر اس کا ظہور الٰہی (التجلی) ہے۔ اور درمیانی تہائی میں وہ مسخر ارواح پر ظہور الٰہی (التجلی) کرتا ہے، اور پہلی تہائی میں وہ ارواح مہیمنہ پر ظہور الٰہی (التجلی) کرتا ہے۔ اور اس نے ان دنوں کے دن کو تین حصوں میں تقسیم کیا، وہ ہر حصے میں عالم اجسام پر ظہور الٰہی (التجلی) کرتا ہے، اس لیے کہ وہ ہمیشہ اللہ کی حمد کے ساتھ تسبیح کرتے ہیں۔ پس پہلی تہائی میں وہ لطیف اجسام پر ظہور الٰہی (التجلی) کرتا ہے جنہیں آنکھیں نہیں پا سکتیں، اور درمیانی تہائی میں وہ شفاف اجسام پر ظہور الٰہی (التجلی) کرتا ہے، اور آخری تہائی میں وہ کثیف اجسام پر ظہور الٰہی (التجلی) کرتا ہے۔ اور اگر یہ ظہور الٰہی (التجلی) نہ ہوتا تو ان کے لیے اس کی معرفت (المعرفۃ) صحیح نہ ہوتی جس کی وہ تسبیح کرتے ہیں، کیونکہ تسبیح کرنے والے کے لیے ضروری ہے کہ اسے اس کی معرفت (المعرفۃ) ہو جس کی وہ تسبیح کرتا ہے۔ اور اللہ کی معرفت (المعرفۃ) نہ فکر سے صحیح ہو سکتی ہے اور نہ خبر سے، بلکہ وہ ہر تسبیح کرنے والے پر اس کے ظہور الٰہی (التجلی) سے ہوتی ہے۔ پس ان میں سے بعض اس کے عالم ہیں اور بعض اس کے عالم نہیں ہیں، اور وہ نہیں جانتے کہ انہوں نے ظہور الٰہی (التجلی) کی معرفت (المعرفۃ) سے تسبیح کی ہے۔ اور یہ صرف بعض ثقلین (جن و انس) کے لیے ہے۔ اور ان دو کے علاوہ، وہ اس کی معرفت (المعرفۃ) رکھتے ہیں جس نے ان پر ظہور الٰہی (التجلی) کیا، اور وہ اس کے لیے شہود (الشہود) پر تسبیح کرتے ہیں، اجسام عمومی طور پر اور ارواح خصوصی طور پر۔ پس ہر وہ شخص جس میں اس چیز کو پہنچانے کی طاقت نہیں ہے جس کا وہ مشاہدہ کرتا ہے، تو اس کے پاس اس کی معرفت (المعرفۃ) ہے جس نے اس پر ظہور الٰہی (التجلی) کیا۔ اور اسی طرح وہ شخص جس میں پہنچانے کی طاقت ہے، لیکن وہ امین ہے اور صرف الٰہی حکم سے ہی بات کرتا ہے، تو اس کے پاس اس کی معرفت (المعرفۃ) ہے جس نے اس پر ظہور الٰہی (التجلی) کیا۔ اور جو جانتا ہے کہ اس میں پہنچانے کی طاقت ہے، اور وہ چغل خور ہے، جو اس چیز کی چغلی کھاتا ہے جس کا اس نے مشاہدہ کیا اور سنا، اور وہ امین نہیں ہے جو امانت والے کے حکم کا انتظار کرے، تو ذات حق (الحق) اپنے ظہور الٰہی (التجلی) میں اسے نہیں جانتا کہ وہ وہی ہے، اور وہ دنیا اور آخرت میں اس کے منکر ہیں۔ اللہ ہمیں ان امینوں میں سے بنائے جو اس کی معرفت (المعرفۃ) رکھتے ہیں جس نے ان پر ظہور الٰہی (التجلی) کیا۔ اگر تم کہو کہ دن میں رات اور دن کو صرف سورج کا طلوع اور غروب ہی پیدا کرتا ہے، تو وہ کون سا سورج ہے جس نے اللہ کے دنوں میں رات اور دن کو ظاہر کیا جسے دہر (زمانہ) کہا جاتا ہے؟ ہم کہیں گے: وہ اس کا اسم النور ہے، جس کے بارے میں ذکر کیا گیا ہے کہ وہ آسمانوں اور زمین کا نور ہے۔ پس اس کا طلوع اور غروب ہم پر انسان مثلی (الإنسان المثلي) کے پردے کے پیچھے سے ہوتا ہے، جسے ہم نے ذکر کیا کہ وہ اس کا سایہ ہے جو اس کی صورت پر ازلی حکم کے ساتھ پیدا کیا گیا، جس نے اس سے مثلیت کی نفی کی اور اس کے وجود کا عین ثابت کیا، اس کے قول میں: **لَيْسَ كَمِثْلِهِ شَيْءٌ** (اس کی مثال کوئی چیز نہیں) [الشوریٰ: 11]، صفت کی کاف کے ساتھ۔ پس اس کی رات کو باطن (الباطن) کہا جاتا ہے اور اس کے دن کو ظاہر (الظاہر) کہا جاتا ہے۔ پس وہ باطن (الباطن) ہے اپنی رات کی حیثیت سے، اور وہ ظاہر (الظاہر) ہے اپنے نور کی حیثیت سے۔ اور وہ انسانی مثل اس نور کے طلوع کو ممتاز کرتا ہے، تو دن ہوتا ہے، اور اس نور کے ان سے غروب ہونے کو ممتاز کرتا ہے، تو رات ہوتی ہے۔ اور یہ عالم میں ظاہر (الظاہر) اور باطن (الباطن) کا حکم ہے۔ اور ہم پہلے یہ طے کر چکے ہیں کہ عالم میں ہر اسم کا ایک حکم ہے۔ پس دہر (زمانہ) اپنی عین کی حیثیت سے ایک دن ہے جو متعدد نہیں ہوتا، اور نہ اس کی رات ہے اور نہ دن۔ پس جب الٰہی اسماء اسے لے لیتی ہیں، تو وہ اس ازلی ابدی دن میں اپنے احکام کے ذریعے متعین ہو جاتی ہیں، جو الٰہی دنوں کے دہر کا عین ہے، جن کے بارے میں یاد دلانے والے کو حکم دیا گیا کہ وہ ہمیں یاد دلائے تاکہ ہم انہیں زمانے کے دنوں سے پہچانیں۔ اور جب اسم النور اس منزہ مثلی سایہ کے وجود میں اور اس میں موجود عالم پر اس کے طلوع میں آتا ہے، تو اس مثل میں موجود عالم اس طلوع کو ان سے غروب ہونے کے وقت تک دن کہتا ہے، اور ان سے غروب ہونے کے وقت سے وہ اسے رات کہتے ہیں۔ اور وہ نور اس سایہ سے غائب نہیں ہوتا، جیسا کہ سورج اپنے طلوع اور غروب میں زمین سے غائب نہیں ہوتا، بلکہ وہ اس میں موجود عالم سے طلوع اور غروب ہوتا ہے۔ اور زمین میں پیدا ہونے والی تاریکی صرف اس میں موجود عالم کے اتصالات کے سائے ہیں، پس وہ حقیقت میں ایک سایہ ہے جسے وہ تاریکی کہتے ہیں۔ اور جو لوگ اسے تاریکی کہتے ہیں، ان میں سے جنہیں یہ کشف (الکشف) نہیں ہے، وہ اسے زمین کا سایہ قرار دیتے ہیں، اس کی کثافت کی وجہ سے، حالانکہ وہ الٰہی ظلی مثل میں صرف اس کے آباد کرنے والوں کی اعیان کا سایہ ہے۔ پس یہ جان لو۔\n\n### الٰہی دنوں کے احکام۔\n\nپھر اللہ نے ہمارے نزدیک ان معلوم دنوں کو بنایا جنہیں فلک اطلس کی حرکت اور رات اور دن نے پیدا کیا جنہیں قلب (یعنی سورج) کی حرکت نے پیدا کیا، تاکہ ان کے ذریعے اسماء کے الٰہی دنوں کے احکام کی مقدار مقرر کی جائے، پس وہ ان کے لیے میزان کی مانند ہیں جن سے ان دنوں کی مقداریں معلوم ہوتی ہیں۔ پس اس نے فرمایا: **وَإِنَّ يَوْمًا عِندَ رَبِّكَ كَأَلْفِ سَنَةٍ مِّمَّا تَعُدُّونَ** (اور بے شک تمہارے رب کے نزدیک ایک دن تمہارے شمار کے ہزار سال کے برابر ہے) [الحج: 47]۔ پس جب تم تین سو ساٹھ دن کو ہزار سال سے ضرب دو گے، تو ضرب کے بعد جو عدد نکلے گا، وہ رب کے دن کے لیے تقدیر کے دن ہیں، پھر وہ ختم ہو جاتا ہے، پھر دہر میں کسی دوسرے اسم کے لیے ایک اور دن پیدا کرتا ہے جو اسم الرب کے علاوہ ہے۔ اور اسی طرح تین سو ساٹھ دن کو **خَمْسِينَ أَلْفَ سَنَةٍ** (پچاس ہزار سال) [المعارج: 4] سے ضرب دیتا ہے، تو ضرب کے بعد جو دن نکلتے ہیں، وہ الٰہی اسماء میں سے ذی المعارج (بلندیوں والا) کے دن کے لیے تقدیر کے دن ہیں۔ پس جب وہ دن ختم ہو جاتا ہے تو دہر میں کسی دوسرے اسم کے لیے ایک اور دن پیدا کرتا ہے جو ذی المعارج کے علاوہ ہے۔ امر ہمیشہ اسی طرح ہے۔ پس ہر الٰہی اسم کا ایک دن ہے۔ اور ہم نے ان دو دنوں، یوم الرب اور یوم ذی المعارج کا ذکر صرف اس لیے کیا کہ وہ اللہ کی کتاب میں آئے ہیں، پس مومن ان کا انکار نہیں کر سکتے۔ اور جو صرف ہماری زبانوں پر وارد ہوا ہے، تو انہیں اس میں انکار کا حق ہے۔ بلکہ امر جیسا کہ ہم نے ذکر کیا ہے کہ ہر الٰہی اسم، خواہ وہ معلوم ہو یا مجہول، اس کا دہر میں ایک دن ہے۔ اور وہ اللہ کے دن ہیں، اور حقیقت میں سب اللہ کے دن ہیں، **وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ** (لیکن اکثر لوگ نہیں جانتے) [الاعراف: 187]۔ پس جب ہم الٰہی اسماء سے عقل اول کے دن کی طرف اترتے ہیں، تو اس کے حکم نے اسے نفس کلیہ میں رات اور دن میں تقسیم کیا۔ پس اس دن کی رات نفس کے نزدیک اس کا اس سے اعراض کرنا ہے جب وہ استفادہ کے لیے اپنے رب کی طرف متوجہ ہوتا ہے، اور اس کا دن اس نفس کے نزدیک اس وقت ہے جب وہ افادہ کے لیے اس کی طرف متوجہ ہوتا ہے۔ پس وہ اس کا دن ہے۔ اور اللہ نے اس حکم سے نفس میں دو قوتیں بنائیں: ایک علمی قوت، جو اس سے نیچے کے عالم میں اس کی رات ہے، اور ایک عملی قوت، جو اس سے نیچے کے عالم میں دن ہے، اور اسے غیب اور شہادت (الشہود)، حرف اور معنی، معقول اور محسوس کہا جاتا ہے۔ پس نفس میں یہ حکم ایک دن ہے جس میں نہ دن ہے اور نہ رات، اور وہ عالم میں دن اور رات ہے۔ اور اسی طرح ہیولیٰ (ہیولیٰ) کا دن، اس کا جوہر اس کی پوری رات ہے اور اس کی صورت اس کا دن ہے، اور وہ بذات خود ایک دن ہے جس میں نہ رات ہے اور نہ دن۔ اور ہر رات اور دن کا سورج وہ معنی ہے جو اس حکم کو ظاہر کرتا ہے، جس سے اس دن کی طرف رات اور دن کی نسبت کی جاتی ہے۔ پس جب ہم فلک بروج کی طرف اترتے ہیں، تو اس کی حرکت میں دن متعین ہوتا ہے، اور وہ کرسی متعین ہوتی ہے جس میں وہ کٹتا ہے۔ پس اس کا تعین اوپر سے ہوتا ہے، کیونکہ اس کے اندر ابھی تک وہ چیز ظاہر نہیں ہوئی جس سے اس کی حرکت مکمل طور پر متعین ہو۔ پس وہ ایک دن ہے جس میں نہ دن ہے اور نہ رات، اور اس کے مقعر کی طرف سے دنوں کی کوئی مقدار نہیں ہے، اور وہ اجزاء میں مماثل ہے، لیکن احکام میں مماثل نہیں ہے۔ اور جب کرسی ہی وہ ہے جس میں احکام کا تعین مقداروں کے تعین سے ظاہر ہوا جنہیں بروج کہا جاتا ہے، اور ہر مقدار میں ایک معین فرشتہ مقرر کیا گیا، تو مقداریں ان احکام سے متعین ہو گئیں جن کی ذمہ داری اس معین فرشتہ نے لی۔ پس جب وہ ایک چکر پورا کرتا ہے تو کرسی کی طرف سے اسے ایک دن کہا جاتا ہے۔ اور عرش میں کلمہ ایک تھا، جیسے دن کا حکم۔ پس جب کرسی عرش کے نیچے زمین کے ایک میدان میں پھینکی ہوئی انگوٹھی کی طرح پائی گئی، تو عرش کے اس ایک کلمہ کی جو دن ہے، کرسی میں تقسیم ہو گئی، پس اس کی تقسیم ان دو قدموں سے ہوئی جو اس کرسی کی طرف لٹکے ہوئے ہیں، اور وہ قدم الرب اور قدم الجبار ہیں۔ پس وہ دونوں، یعنی یہ دونوں قدم، عرش کے دن کے لیے رات اور دن کی طرح تھے جنہوں نے دن کو تقسیم کیا۔ اور عرش کا دن اس کے کلمہ کی احدیت (احدیۃ) ہے، کیونکہ اللہ کا امر ایک ہے۔\n\n### بے شک اللہ نے کواکب ثابتہ (ثابت ستاروں) کا فلک پیدا کیا۔\n\nپھر اللہ نے کواکب ثابتہ (ثابت ستاروں) کا فلک پیدا کیا جنہیں بروج کی مقداروں نے ممتاز کیا، اور ان میں سے ہر ستارے کا فلک بروج میں ایک قطعہ ہے۔ پس جب ستارہ اسے پورا کاٹ لیتا ہے تو وہ اس ستارے کے دنوں میں سے ایک دن ہوتا ہے، جو اس کے کاٹنے کی مدت ہے۔ اور وہ ہمارے شمار کے سالوں میں سے سو سال میں تین سو ساٹھ درجوں میں سے ایک درجہ کاٹتا ہے۔ پھر اس نے ان دو فلکوں کے درمیان جنت اور اس میں موجود چیزیں پیدا کیں، اور عالم میں سے وہ چیزیں جن کی تعداد اللہ کے سوا کوئی نہیں جانتا۔ اور فلک بروج سے لے کر عالم جسمی کی انتہا تک، ہوائی، ناری، مائی اور ترابی بروج کا حکم ہر فلک اور فلک کے درمیان کی فضا میں ظاہر ہوا، اور یہ صرف مشاہدہ (الشہود) سے ہی معلوم ہوتا ہے۔ اور جنہیں اس کا علم نہیں ہے، وہ کہتے ہیں کہ افلاک ان میں سے ہر ایک کے مقعر کے نیچے اس کے نیچے والے کی سطح ہے۔ اور انہیں یہ علم نہیں کہ ان کے درمیان ایک فضا ہے جس میں طبیعت (الطبیعۃ) کا حکم ہے، جیسا کہ عناصر میں ہے، سوائے اس کے کہ وہ قبول کرنے والوں کے لحاظ سے مختلف الحکم ہے۔ پھر اس نے چار ارکان کو اس حکم پر پیدا کیا جس پر وہ بروج ہیں جو فلک اطلس میں ہیں، ہر رکن کے دو اطراف اور ایک واسطہ ہے، ان تین وجوہات کے لیے جو بروج میں ہیں۔ پس اثیر کے لیے حمل، اسد اور قوس کا حکم ہے، پس قوس اور اسد اطراف کے لیے ہیں اور حمل وسط کے لیے ہے۔ اور مٹی کے لیے ثور، سنبلہ اور جدی ہیں، پس جدی اور سنبلہ اطراف کے لیے ہیں اور ثور وسط کے لیے ہے۔ اور ہوا کے لیے جوزاء، میزان اور دالی ہیں، پس میزان اور جوزاء اطراف کے لیے ہیں اور دالی وسط کے لیے ہے۔ اور پانی کے لیے سرطان، عقرب اور حوت ہیں، پس حوت وسط کے لیے ہے اور عقرب اور سرطان اطراف کے لیے ہیں۔ اور ہم نے انہیں اس ترتیب سے اس لیے رکھا کہ زمانے اور عالم کا وجود جسے فلک اطلس گھیرے ہوئے ہے، طالع میزان کے ساتھ تھا، اور دورہ کا حکم رسول اللہ صلی اللہ علیہ وسلم کی پہلی بعثت سے اس پر ختم ہو چکا ہے۔ اور ہم آج اس کے تسلط میں ہیں۔ اور اسی لیے اس امت میں علم اور عدل اور کشف (الکشف) دوسری امتوں کے مقابلے میں زیادہ اور مکمل ہے۔ اور جوں جوں امر گزرتا جائے گا، اس کا تسلط مضبوط ہوتا جائے گا اور کشف (الکشف) عظیم ہوتا جائے گا، یہاں تک کہ وہ عام اور خاص میں ظاہر ہو جائے گا، پس آدمی کو اس کے کوڑے کا کنارہ بات کرے گا اور آدمی کو اس کی ران بات کرے گی کہ اس کے گھر والوں نے کیا کیا۔\n\nاور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"بے شک زمانہ اپنی اسی ہیئت پر لوٹ آیا ہے جس دن اللہ نے اسے پیدا کیا تھا۔\"\n\nاور جب اللہ نے ارکان کو پیدا کیا، تو ان سے دھواں پیدا کیا، جس میں سات ساکن آسمانوں کو پھاڑا جو حرکت نہیں کرتے، اور **وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا** (اور ہر آسمان میں اس کا حکم بھیج دیا) [فصلت: 12]، اس طرح کہ ان کے لیے افلاک پیدا کیے اور انہیں جواری کنس خنس (چھپنے والے ستارے) کے تیرنے کی جگہ بنایا، اور ان میں آباد کرنے والے فرشتے پیدا کیے جو انہیں آباد کرتے ہیں، اور ان کے لیے دروازے بنائے جو فرشتوں کے اترنے اور چڑھنے کے لیے بند اور کھلتے ہیں، اور ان میں اپنے انبیاء اور بندوں میں سے جسے چاہا ان کی ارواح کو ٹھہرایا۔ اور اس آسمان ہفتم کی سطح پر سدرۃ المنتہیٰ (سدرۃ المنتہیٰ) کو پیدا کیا، جسے اللہ کے نور نے ڈھانپ لیا جو ڈھانپ لیا۔ اور اس آسمان کی سطح پر بیت الضراح کو پیدا کیا، جس کا ذکر پہلے گزر چکا ہے، اور ان فرشتوں کا ذکر جو ہر دن اس میں داخل ہوتے ہیں۔ اور اس سدرہ کی جڑ سے چار نہریں نکلتی ہیں جو جنت کی طرف چلتی ہیں، پس جب وہ جنت تک پہنچتی ہیں تو اللہ ان میں سے دار الجلال پر دو نہریں نکالتا ہے، نیل اور فرات جو ہمارے پاس زمین میں ہیں۔ پس نیل جبل القمر سے ظاہر ہوا، اور فرات ارزن الروم سے ظاہر ہوا۔ اور زمین کے مزاج نے ان پر اثر کیا، پس ان کا ذائقہ اس سے بدل گیا جو جنت میں تھا۔ پس جب قیامت ہو گی تو وہ جنت کی طرف لوٹ جائیں گے، اور اسی طرح سیحون اور جیحون بھی لوٹ جائیں گے۔ اور جب اللہ نے ان آسمانوں کو پھاڑا، جب وہ دھوئیں میں بند تھے، اور دھوئیں کا معنی یہ ہے کہ وہ ان کی اصل ہے، اور وہ آج آسمان ہیں، جیسا کہ آدم کو **خَلَقَهُ مِن تُرَابٍ** (اسے مٹی سے پیدا کیا) [آل عمران: 59]، یعنی اس کی اصل، اور وہ گوشت، خون، رگیں اور اعصاب ہے، جیسا کہ ہمیں **مَاءٍ مَّهِينٍ** (حقیر پانی) [المرسلات: 20] سے پیدا کیا۔ اور اللہ نے رات اور دن کو سورج کی تخلیق اور زمین میں اس کے طلوع اور غروب سے پیدا کیا۔ لیکن آسمان نور ہیں، ان میں رات اور دن نہیں ہے۔ اور رات کا مخرج زمین کے کرہ سے ہے جہاں سے سورج غروب ہوا، مخروطی شکل کا، جیسے چراغ کے نور کی شکل، جیسا کہ تم اسے دیکھتے ہو کہ وہ فتیلے کے سرے سے نکلتا ہے، پس وہ ہوا کو مخروطی شکل میں جلاتا ہے یہاں تک کہ وہ اپنی جلنے کی طاقت کی انتہا تک پہنچ جاتا ہے اور کٹ جاتا ہے، اور اس کے اوپر کی ہوا جلتی رہتی ہے، لیکن شدید حرارت کے ساتھ جلتی نہیں ہے۔ اور جب یہ ستارے اپنے افلاک میں تیرے، تو اللہ نے ہر ستارے کے لیے فلک بروج کی حرکت کے دنوں میں سے ایک دن مقرر کیا، اس نے ان دنوں کو زمانہ کہا، جس سے فلک کی حرکت کو شمار کیا جاتا ہے، جیسا کہ اس نے فلک بروج کی حرکت کو دن بنایا، ہر حرکت ایک دن، جس سے موہوم زمانے کی مدت کو شمار کیا جاتا ہے، جو موہوم ہے اور معلوم نہیں ہے اور نہ پایا جاتا ہے، اور وہ دہر (زمانہ) ہے جس کی برائی کرنے سے ہمیں منع کیا گیا، اور منع کرنے والے نے کہا کہ اللہ ہی دہر (زمانہ) ہے۔\n\nپس اس نے اسے اپنے اسماء میں سے ایک اسم بنایا، پس اس کے لیے اسماء حسنیٰ ہیں، وہ جلیل اور بلند ہے۔ پس اس نے ہر دن کے لیے رات اور دن مقرر کیا، اور ہر رات اور اس کے دن کے درمیان اس ستارے کے حکم سے فرق کیا جو اس دن میں ظاہر ہوا جس میں رات یا دن ظاہر ہوا۔ پس دیکھا جاتا ہے کہ جواری (ستاروں) میں سے دن کی پہلی ساعت کس کی ہے، پس وہ اس دن کا حاکم ہے۔ اور راتوں میں تلاش کیا جاتا ہے، پس وہ رات جس کی پہلی ساعت میں اس ستارے نے حکم کیا جس نے دن کی پہلی ساعت میں حکم کیا، تو وہ رات اس دن کی رات ہے۔ اور تم حساب سے یہ جان سکتے ہو۔ اور اس نے زمین کو سات حصوں میں پھاڑا، ہر زمین کے لیے جواری میں سے ایک ستارے کی نظر کو قبول کرنے والا بنایا۔ اور ہم نے یہ سب پہلے ذکر کر دیا ہے۔ اور اس نے ہر ستارے کے لیے فلک بروج میں ایک قطعہ بنایا، پس جب اس کا قطعہ ختم ہو جاتا ہے تو وہ اس کا ایک دن ہوتا ہے، جو اس کے قطعہ نے پیدا کیا۔ اور اس نے ان افلاک اور ارکان کی حرکات کو وسط میں رکھا، نہ وسط سے اور نہ وسط کی طرف۔ اور اس نے ان کے آباد کرنے والوں کی حرکت کو وسط کی طرف اور وسط سے رکھا۔ اور چیزیں ان حرکات کے وقت عالم خلق اور امر میں اور جناب اقدس میں پیدا ہوتی ہیں، اور وہ محسوس اور معقول آثار ہیں جن پر شرعی اور عقلی دلیل حکم کرتی ہے۔ اور وہ احوال کے آثار ہیں، جیسے ذات حق (الحق) کا آسمان دنیا پر نزول، اور اعمال اور اقوال، جیسے ذات حق (الحق) کا دعا کرنے والے کی دعا قبول کرنا، اور بنی آدم کے ظاہری اور باطنی اعمال سے فرشتوں کی تخلیق، اور بنی آدم میں سے اہل جنت کے اعمال سے جنت کا لگانا۔ اور جس دن محمد کی شریعت شروع ہوئی، اگر اس کی رات اور دن مکمل ہو جائیں، تو وہ رب کے دنوں میں سے ہے، اور اگر مکمل نہ ہو اور کسی بھی ساعت میں کٹ جائے، تو وہ اس کی مقدار ہے، اور وہ اسم الخاذل (ذلیل کرنے والا) اور الناصر (مددگار) سے ہے، کیونکہ خاذل اور ناصر کے دن کی ہمارے نزدیک کوئی معلوم مقدار نہیں ہے، بلکہ اس کا میزان اللہ کے پاس ہے، اسے صرف وہی جانتا ہے۔ اور ان کا حکم ہر انسان میں اس انسان کی عمر کے مطابق ہے، اور ان کی مقدار اس امت میں اس کے دار دنیا میں باقی رہنے کے مطابق ہے، اور یہ اس کے اپنے نبی محمد صلی اللہ علیہ وسلم کی طرف دیکھنے کے مطابق ہے۔ پس اگر اس نے آپ کی طرف دیکھا تو اس کے لیے رب کا دن مکمل ہو جائے گا، اور اگر اس نے اعراض کیا تو اس کے لیے رب کے دن کی جو مدت گزر چکی ہے وہ ہے۔ اور حکم کسی دوسرے اسم کی طرف لوٹ جائے گا جس کا اللہ کے پاس ایک مقرر دن ہے جسے صرف وہی جانتا ہے۔ اور اس امت کا دن آخرت کے دن سے ملا ہوا ہے، ان کے درمیان صرف برزخ کی رات ہے۔ اور اس رات کی فجر میں بعث (دوبارہ اٹھائے جانے) کا نفخہ ہو گا، اور اس کے دن کے سورج کے طلوع کے وقت ذات حق (الحق) کا فیصلہ اور قضاء کے لیے آنا ہو گا۔ اور اشراق کی دو رکعتوں کی مقدار میں\n\nحکم ختم ہو جائے گا، پس دونوں گھر اپنے اہل سے آباد ہو جائیں گے۔ اور وہ دن ہفتہ کا دن ہو گا، پس اس کا دن اہل جنت کے لیے ابدی ہو گا، اور اس کی رات اہل جہنم کے لیے ابدی ہو گی۔ پس جب جہنم میں تکلیفوں کی مدت ختم ہو جائے گی، اور وہ ایک قوم کے حق میں **خَمْسِينَ أَلْفَ سَنَةٍ** (پچاس ہزار سال) [المعارج: 4] کا ایک دن ہے، اور ایک قوم کے حق میں اس سے کم، اور انیس فرشتوں نے اہل جہنم کے لیے اس رحمت کی شفاعت کی جو سبقت لے گئی، تو تکلیفیں اٹھ جائیں گی۔ پس ان کا آرام تکلیفوں کا اٹھ جانا ہے، نہ کہ نعمت کا وجود۔ پس سمجھو! اور یہ مقدار اہل جہنم کی نعمت ہے، اگر تم جانو۔ اور اس منزل کے علوم میں سیادت کی رحمت کا علم ہے، اور اسے کہاں پکارا جاتا ہے، اور اسے کس چیز سے مستحق کیا جاتا ہے، اور اس کے ترخیم (آواز کو نرم کرنا) کی پکار ہونے کی حکمت کیا ہے، اور ترخیم آسانی ہے۔ اور اسی لیے اسے حسینوں کے لیے صفت کے طور پر استعمال کیا جاتا ہے، پس خوبصورت عورت کے بارے میں کہا جاتا ہے: رخیمۃ الدلال (آسانی سے ناز کرنے والی)، یعنی آسان۔ اور اس میں تمام حکم کا علم ہے، نہ کہ ہر چیز کا علم، کیونکہ حکم کی کوئی عین نہیں ہے مگر خاص طور پر ترتیب میں، معنی اور حس کے لحاظ سے۔ اور اس میں رسالت کا علم ہے، اس کی مختلف اقسام کے ساتھ، رسولوں کے اختلاف کی وجہ سے، کیونکہ انبیاء رسول ہیں، اور فرشتے رسول ہیں، اور بشر رسول ہیں۔ اور رسالت احوال کے اختلاف سے مختلف ہوتی ہے۔ اور یہ سب شریعتیں ہیں جو اللہ اور دائمی سعادت تک پہنچاتی ہیں، ان میں کوئی کجی نہیں ہے اور نہ ہونی چاہیے، کیونکہ وہ عرش رحمت سے عزت کا لباس پہن کر نازل ہوئی ہیں، پس کوئی چیز ان پر اثر نہیں کرتی کہ وہ اپنی امتوں کو اپنے حکم سے باہر نکال دے۔ پس کوئی امت ایسی نہیں مگر رحمت اسے پہنچتی ہے، جیسا کہ اسے وہ شریعت پہنچی جس سے اسے مخاطب کیا گیا۔ اور اس میں عالم میں شرائع کو رکھنے کی حکمت کا علم ہے، اور انہیں دنیا کے گھر میں کیوں رکھا گیا اور آخرت میں کیوں نہیں رکھا گیا، اور ان میں سے جو آخرت کے گھر میں رکھے گئے ان کی توقیت (وقت مقرر کرنا) کا علم، پہلے جیسے آدم پر درخت کے قریب جانے سے روکنا، اور آخر میں جیسے قیامت کے دن ذات حق (الحق) کا اپنے بندوں کو سجدہ کرنے کی دعوت دینا۔ اور قیامت کے دن اس شرعی حکم سے اہل اعراف کا میزان بھاری ہو جائے گا، پس ان کا میزان اس سجدہ سے بھاری ہو جائے گا، تو وہ جنت کی طرف لوٹ جائیں گے، جب کہ ان کا مقام سور اعراف میں تھا، ان کے پاس نہ کوئی چیز تھی جو انہیں جہنم میں داخل کرے اور نہ کوئی چیز جو انہیں جنت میں داخل کرے۔ اور اس میں مومن کی قوت ہے، پس وہ کفار کی بہت سی قوتوں کے برابر ہو جاتا ہے۔ اور اسی لیے ان کے لیے یہ مشروع کیا گیا کہ وہ اپنے دشمن سے لڑائی میں نہ بھاگیں، اور ان میں سے بعض کے لیے ایک کی قوت دس کے برابر مشروع کی گئی، پھر ان پر تخفیف کی گئی، لیکن قوت کو ان پر باقی رکھا گیا، پس ان کے لیے ہر مومن کی قوت دو کفار کی قوت کے برابر مشروع کی گئی۔ اور اسی لیے\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"بے شک آپ کو اتنی ہی شدت سے بخار ہوتا ہے جتنی شدت سے آپ کی امت کے دو آدمیوں کو ہوتا ہے۔\"\n\nپس اس نے اپنی امت کے دو آدمیوں کی قوت عطا کی، اور اس میں غفلت اور نسیان کے وجود کی رحمت کا علم ہے دنیا میں، بلکہ اس امت میں، جیسا کہ اس میں نص موجود ہے، اور اسی طرح خطا کا علم بھی ہے۔ اور اس میں قول اور قولِ حق (اللہ کا قول) اور مخلوق کی طرف منسوب قول اور کلمہ کے درمیان فرق کا علم ہے۔ اور کیا ہر قول اور کلمہ کے لیے نفاذ میں کوئی واجب حق ہے یا یہ صرف مخصوص قول کے لیے ہے؟ اور اگر یہ کلمہ کے بجائے مخصوص قول کے لیے ہے، تو اس تخصیص کا سبب کیا ہے، جبکہ ہر ایک قول ہے اس حیثیت سے کہ وہ قول ہے، اور کلمہ ہے اس حیثیت سے کہ وہ کلمہ ہے۔ اور جب نفسِ امر میں حکم قول کے لیے ہے اور وہ سابق ہے، تو پھر سوال اور اقرار کے ساتھ گرفت کیوں ہوئی، جبکہ یہ علم ہے کہ وہ اپنے اختیار میں مجبور ہے؟ اور یہ ایک مشکل التصور (تصور میں مشکل) مسئلہ ہے جو بہت زیادہ پھسلتا ہے، اور اگر اس میں تکلیفوں کا وجود نہ ہوتا تو یہ آسان ہو جاتا اور کبھی ذہن میں نہ آتا۔\n\nاور اس میں معانی کی تقیید (پابندی) کا علم ہے اور ان کے احکام کے آثار کا وجود اس شخص میں جس میں وہ قائم ہوئے، اور انسان کی نشأت میں ان کی تقیید کی حد کہاں ختم ہوتی ہے۔ اور اس میں اس سبب کا علم ہے جس کی وجہ سے قیامت کے دن اور دنیا میں چہرے اور نگاہیں اوپر کی طرف اٹھائی جائیں گی، کیا ان کا حکم اور سبب ایک ہے یا مختلف؟ اور کیا یہ اٹھانا پیچھے سے کسی کشش کی وجہ سے ہے یا اختیار کی وجہ سے؟\n\nاور اس میں انسان کے قضاءِ الٰہی اور قدر کے درمیان ہونے کا علم ہے، پس وہ ان دونوں سے تجاوز نہیں کر سکتا۔ اور کیا قضاء اور قدر نے انسان کی تمام جہات کو عام کیا ہے یا ان دونوں کا اس سے صرف دو جہتوں سے تعلق ہے: جہتِ حادی (ہانکنے والا) اور ہادی (ہدایت دینے والا)، اور وہ سائق (ہانکنے والا) اور شہید (گواہ) ہیں۔ اور آج لوگوں کو ان دونوں کے شہود (مشاہدہ) سے کس چیز نے اندھا کر دیا ہے؟ اور آخرت میں وہ انہیں دیکھیں گے۔ اور یہ صرف خلف (پیچھے) اور امام (آگے) کے ساتھ کیوں مخصوص ہوئے، نہ کہ باقی جہات کے ساتھ؟ اور شیطان کے لیے چاروں جہات کی راہیں ہیں، تو کیا خلف اور امام کی جگہ ان کے لیے دائیں اور بائیں پر استشراف (جھانکنے) کی ہے، ان دو ہاتھوں کے حکم سے جو ان کے لیے ہیں؟ اور اگر ان کے لیے دائیں اور بائیں ہوتے تو ان میں سے ہر ایک کا ایک ہاتھ اس شخص کے حق میں معطل ہو جاتا جس کا انہوں نے التزام کیا ہے، لہٰذا ضروری ہے کہ ان کے لیے خلف اور امام ہوں۔\n\nاور اس میں ممکن (ممکن الوجود) کی طرف عدم اور وجود کی نسبت کا علم ہے، اور وہ مرجح (ترجیح دینے والے) کے بغیر معقول نہیں ہوتا، اور مرجح کے پاس ان دونوں نسبتوں میں سے صرف ایک ہی وجہ ہوتی ہے، تو امکان ختم ہو جاتا ہے۔ تو اس میں صحیح کیا ہے، کیا امکان کا باقی رہنا یا اس کا ختم ہو جانا؟\n\nاور اس میں قوابل (قبول کرنے والی استعدادیں) کا علم ہے، کیا وہ ہر چیز کے لیے قوابل ہیں یا مخصوص چیزوں کے لیے؟ یا وہ قبول کرنے میں ممتاز ہوتی ہیں، تو وہ ایسی صفت پر ہوتی ہیں جو بعض قوابل کے لیے وہ چیز واجب کرتی ہے جسے وہ قبول کرتی ہیں اور جسے قبول نہیں کرتیں۔ اور کیا ان امور کو قبول کرنے کا جو قوابل لیتی ہیں، ایک ہی راستہ ہے یا راستے مختلف ہیں؟\n\nاور اس میں اجر کو عظمت اور کرم سے متصف کرنے کا علم ہے، یہ کس چیز کی طرف لوٹتا ہے؟ اور یہ ایک شریف علم ہے۔\n\nاور اس میں موت کا علم ہے، اور مردوں کو زندہ کرنے کا کیا مطلب ہے؟ اور انہیں کون مارتا ہے؟ کیا اللہ بغیر کسی سبب کے؟ یا کیا کوئی فرشتہ؟ اور وہ فرشتہ کیا ہے؟ کیا وہ بعض اخلاط (مزاج کے اجزاء) ہیں جن پر حیوانی جسم قائم ہے؟ کیونکہ اخلاط اللہ کے فرشتوں میں سے ہیں، یا وہ آسمانوں کے فرشتوں میں سے کوئی فرشتہ ہے؟ اور اگر اسے آسمانوں کی طرف منسوب کیا جائے، تو کیا اسے ان میں سے کسی ایک کی طرف منسوب کیا جائے گا، اس حکم سے کہ یہ کسی حرکت سے ہے جس میں اللہ نے اس غالب خلط کی قوتیں وحی کی ہیں جسے ملک الموت کہا جاتا ہے؟ یا وہ ساتویں آسمان کے باشندوں میں سے کوئی غریب فرشتہ ہے؟ اور اسی طرح محیی (زندہ کرنے والا) بھی ممیت (مارنے والے) کی طرح ہے، سوائے اس کے کہ آسمان مختلف ہے، کیونکہ چھٹا آسمان حیات کا معدن ہے اور اسے ہر آسمان سے تقویت ملتی ہے، جیسا کہ موت کو بھی ملتی ہے۔ اور محیی کے بارے میں کلام ممیت کے بارے میں کلام کی طرح ہے، یا یہ ہو سکتا ہے کہ ممیت اللہ ہو اس حیثیت سے کہ وہ اس کے اسماء میں سے ایک اسمِ الٰہی ہے، اور اسی طرح محیی بھی، پس وہی الممیت المحیی (مارنے والا، زندہ کرنے والا) ہے۔ اور ہم ان اسباب کو ختم نہیں کر سکتے جو الحق (ذات حق) نے مقرر کیے ہیں، ورنہ الحق کی حکمت باطل ہو جائے گی۔ پس ہم اعتقاد میں اسباب کو ختم کرتے ہیں اور وجود میں انہیں ان کی جگہوں پر برقرار رکھتے ہیں۔ اور اسرافیل صور پھونکتے ہیں اور عزرائیل روحیں قبض کرتے ہیں۔ اور یہ اس استعداد کی وجہ سے ہے جو ان صورتوں میں ہے کہ وہ اشتعال (جلنے) کو قبول کریں تاکہ زندہ ہوں، اور انطفاء (بجھنے) کو قبول کریں تاکہ مر جائیں۔ اور یہ فرشتہ جو ہم پر مقرر ہے، نہ کہ موت پر، وہی اس فرشتہ کو تقویت دیتا ہے جس کے ذریعے اور اس کے ساتھیوں کے ذریعے حیوان کے جسم کی نشأت قائم ہوئی، پس وہ اپنے باقی ساتھیوں پر اپنے سلطان کی قوت کی وجہ سے مارتا ہے۔ اور اسی لیے اطباء (ڈاکٹر) علامات سے جانتے ہیں کہ انسان مر رہا ہے۔ پس اگر فرشتہ وہ نہ ہوتا جو ہم نے ذکر کیا، تو اطباء کا علم وہاں تک نہ پہنچتا، کیونکہ یہ انبیاء کے علم کی خصوصیات میں سے ہے اور ان بندوں کے علم میں سے ہے جنہیں اللہ نے سکھایا ہے۔\n\nاور کیا مقتول کا وہی حکم ہے جو موت میں بیمار کا ہے یا اس کا کوئی اور حکم ہے؟ اور کیا اس فرشتہ کا جو ہم پر مقرر ہے، نہ کہ موت پر، کیا اس کا حکم موت کا ہے یا روحوں کو قبض کرنے اور انہیں اوپر لے جانے کا؟ اور کیا وہ ایک فرشتہ ہے یا کئی فرشتے؟ کیونکہ اللہ نے نفوس کی وفات کو اپنی طرف، ملک الموت کی طرف، اور اپنے رسولوں کی طرف منسوب کیا ہے۔ لہٰذا ان اضافات کا علم ضروری ہے اور ان سے کیا مراد ہے؟ اور کیا ان کے مدارج مختلف ہیں یا وہ ایک ہی درجے پر ہیں؟\n\nاور اس میں موت کے بعد جسم اور روح کا کیا انجام ہوتا ہے، اور نفخہ بعث (دوبارہ زندہ کرنے کا صور) میں ان دونوں میں سے کیا چیز دوبارہ اٹھائی جائے گی؟ اور کیا نشأت (پیدائش) عرض (عارضی صفت) سے تبدیل ہوگی یا صورت (شکل) سے؟\n\nاور اس میں اکوان (کائنات) کے آثار کا علم ہے، اور وہ کون سی حضرہ (مقام) ہے جس میں وہ حشر کے وقت تک روکے جاتے ہیں، اور ان کے اصحاب کو ان پر کھڑا کیا جاتا ہے؟ اور وہ مکلفین (جن پر شرعی احکام لاگو ہیں) کے آثار ہیں، اور وہ وہ افعال ہیں جو ان سے تکلیف کے زمانے میں صادر ہوئے، نہ کہ غیر تکلیف کے زمانے میں، جیسے سونے والا، اور جس کی عقل پر غلبہ ہو، اور وہ شخص جو بلوغت کو نہ پہنچا ہو۔ اسی لیے ہم نے \"زمان التکلیف\" کہا اور \"دار التکلیف\" نہیں کہا۔\n\nاور اس میں ایک ہی امت میں رسولوں کے پے در پے آنے کا علم ہے، بخلاف اس امت محمدیہ کے، کیونکہ اس پر رسولوں کا اختلاف نہیں ہوا، بلکہ اگر اس میں کوئی ایسا شخص ظاہر ہوا جو رسول تھا، تو وہ اس سے ملحق ہو گیا اور اس کی شریعت پر قائم ہوا، اور اس پر محمد صلی اللہ علیہ وسلم کی شریعت کے احکام جاری ہوئے۔\n\nاور اس میں نصیحتوں کا علم ہے، اور اس انسانی نشأت کا بخل پر جبلت (فطرت) ہونا، اور کرم کا اس کے لیے عرض (عارضی صفت) کے حکم سے ہونا جو اس کے لیے ذاتی نہیں ہے۔ اور جب وہ اس مقام پر ہے، تو اسے اجرِ کریم (عزت والا اجر) کہاں سے صحیح ہوا، جبکہ اس کے اور کرم کے درمیان کوئی ذاتی نسبت نہیں ہے؟ اور کرم اجر کے لیے ذاتی ہے اور عظمت اس کے لیے ذاتی ہے۔ اور اجرِ عظیم کے لیے مخصوص قوم ہے، اور اجرِ کریم کے لیے مخصوص قوم ہے۔\n\nاور اس میں ثقلین (جن و انس) اور دیگر میں عبادت پر ابھارنے والے اسباب کے اختلاف کا علم ہے۔\n\nاور اس میں اللہ پر تسلیم (سپردگی) اور تفویض (اختیار سونپنے) کا علم ہے۔\n\nاور اس میں تمنی (آرزو) کا علم، اس کا فائدہ، اور اس پر قائم رہنے والے کی صفت کا علم ہے۔\n\nاور اس میں اس معرفت کا علم ہے کہ عالم اللہ تعالیٰ کی ملکیت ہے اس حیثیت سے کہ وہ ملک ہے، اور کون اس سے جھگڑتا ہے، یہاں تک کہ اس نے اپنے آپ کو اس طرح بیان کیا کہ: **لِلَّهِ جُنُودُ السَّماواتِ وَالْأَرْضِ** (اللہ ہی کے لیے ہیں آسمانوں اور زمین کے لشکر)۔\n\nاور اس میں اس چیز کا علم ہے جو اللہ کی طرف منسوب کی جاتی ہے کہ وہ وحدت (یکتائی) سے متصف ہے، اور اس وحدت کے کثرت کا سبب کیا ہے، اور عالم میں اس کا اثر کیا ہے؟\n\nاور اس میں کشف (مکاشفہ) کا علم ہے جب وہ غیب تھا۔\n\nاور اس میں دلیل کے ظاہر ہونے اور اس کے دلیل ہونے کے علم کے باوجود قبول نہ کرنے کا علم ہے، اور اس شخص کی جہالت کا سبب کیا ہے جو یہ نہیں جانتا کہ وہ دلیل ہے؟ اور کیا ہر معلوم کے لیے دلیل ہے یا یہ بعض معلومات کے لیے ہے؟\n\nاور اس میں اس چیز کی طرف واپس نہ لوٹنے کا علم ہے جس سے وہ نکل چکا ہے۔\n\nاور اس میں اس حضرہ (مقام) کا علم ہے جہاں دنیا کا عالم جمع ہوتا ہے، مکلف اور غیر مکلف میں سے۔ اور کیا غیر مکلف کو بھی اٹھایا جائے گا، جیسے حیوان، نباتات اور پتھر، تاکہ ان کے ذریعے مکلفین پر اللہ کی طرف سے مطالبہ اور حجت قائم ہو؟ یا وہ اپنے لیے اٹھائے جائیں گے اس خیر کی وجہ سے جو ان کے لیے ہے اور جو اللہ کے علم میں ہے؟ پھر بعث (اٹھائے جانے) کے بعد ان کا کیا انجام ہوگا؟\n\nاور اس میں ان منافع کا علم ہے جو اللہ نے ہمارے لیے آسمان اور زمین کے عالم میں چھپا رکھے ہیں۔\n\nاور اس میں واجب شکر اور اس شکر کا علم ہے جو انسان اپنی مرضی سے کرتا ہے، اور ان دونوں میں سے اجر کے لحاظ سے کون زیادہ کامل ہے؟\n\nاور اس میں وہ سبب اور حکمت کا علم ہے جس کی وجہ سے اللہ نے ہر چیز کے جوڑے پیدا کیے، اور کیا اسی حکمت میں سے آدم کو اپنی صورت پر پیدا کرنا ہے؟\n\nاور اس میں اس وقت کا علم ہے جس سے دن کو تقسیم کیا جاتا ہے۔\n\nاور اس میں اس شخص کے سکون کا علم ہے جس کے لیے کوئی سکون نہیں ہے۔\n\nاور اس میں مسافروں کے مناہل (گھاٹ) کا علم ہے، اور کیا وہ تعداد میں شمار کیے جا سکتے ہیں یا نہیں؟\n\nاور اس میں مسافروں پر ان کے راستوں اور مناہل کے اختلاف کی وجہ سے صفات کے اختلاف کا علم ہے۔\n\nاور اس میں اس سابق (آگے بڑھنے والے) کا علم ہے جو مل جاتا ہے، اور اس سابق کا علم ہے جو مسافروں میں سے نہیں ملتا، جیسے شخص اپنے سائے کے ساتھ، وہ کبھی اپنے سائے کو نہیں پکڑ سکتا، اور اس کا سایہ اسے پکڑ لیتا ہے، اور دیگر مسافرین۔ اور یہ ایک شریف علم ہے جو تمام اسفارِ الٰہیہ (الٰہی سفر)، کونیہ (کائناتی سفر)، علویہ (بالائی سفر) اور سفلیہ (زیریں سفر) کو شامل ہے۔ اور یہ ایک عزیز المنال (مشکل سے حاصل ہونے والا)، بعید المدرک (سمجھ سے دور) علم ہے، ہر کوئی اس پر غور نہیں کر سکتا۔ اور اس کا احاطہ تو صرف اللہ کے بتانے سے ہی معلوم ہو سکتا ہے، اور اس کی تفصیل کے ساتھ اطلاع صحیح نہیں ہے، کیونکہ یہ ایسے اسفار ہیں جن کی کوئی انتہا نہیں ہے۔\n\nاور اس میں ان راستوں کا علم ہے جن میں ہر مسافر سفر کرتا ہے۔\n\nاور اس میں ان اسباب کا علم ہے جو بعض مسافروں کو ان کے سفر میں مقصود چیز سے روکتے ہیں، اور سفرِ اختیاری اور جبری کے درمیان فرق کا علم ہے۔\n\nاور اس میں دنیا کے اس عام وقت کا علم ہے جس کے ختم ہونے کے بعد قیامت کبریٰ (بڑی قیامت) ہوگی۔\n\nاور اس میں حیوان اور مولدات (پیدا ہونے والی چیزوں) کی عمر کا وقت اور ان کی مدت ختم ہونے پر ان کی صغریٰ قیامت (چھوٹی قیامت) کا علم، اور ان دونوں حشروں کے درمیان فرق کا علم ہے۔\n\nکیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: **\"من مات فقد قامت قيامته\"** (جو مر گیا اس کی قیامت قائم ہو گئی)۔\n\nپس ان کا برزخ کی طرف حشر ہی قیامت ہے۔\n\nاور اس میں ان صفات کا علم ہے جن سے رحمت کی امید کی جاتی ہے، جو اپنی زبان سے رحمت کا سوال کرتی ہیں۔\n\nاور اس میں اس واجب سبب کا علم ہے جس کی وجہ سے جس نے اعراض کیا، اس نے ان عقلی دلائل پر غور کرنے سے اعراض کیا جو رسول لائے تھے اور جو آیاتِ معتادہ (معمول کی نشانیاں) میں سے نہیں لائے تھے۔ اور کیا ان کی دلالت مختلف ہوتی ہے؟ اور ان کی دلالت کی صورت کیا ہے؟ اور کیا ان کا مدلول (جس پر دلالت کی جائے) دلالت کرنے والے کے مقصد یا اس شخص کے مقصد کے اختلاف سے مختلف ہوتا ہے جو دلیل پر غور کرنے کے لیے دلالت کرنے والے کو حرکت دیتا ہے؟ جیسے رسول اپنی رسالت کے سچے ہونے پر دلالت لے کر آتا ہے، اور وہی دلالت بعینہٖ الحق (ذات حق) کے وجود اور مخلوق کے عجز پر دلالت ہوتی ہے۔\n\nاور اس میں اللہ کی پیروی کا علم ہے اس چیز میں جسے اللہ نے مذمت کیا ہے، کیا اس کے کرنے والے کی مذمت لسانِ حقیقت (حقیقت کی زبان) کی طرف سے ہوتی ہے یا صرف لسانِ شرع (شریعت کی زبان) سے مذمت ہوتی ہے؟\n\nاور اس میں اس چیز کا علم ہے جس پر انسان قبض کیا جاتا ہے، کیا وہ برزخ میں اس پر باقی رہتی ہے اور اسی پر حشر کیا جاتا ہے؟ یا اس پر حال تبدیل ہو جاتا ہے؟ یا اس چیز پر قبض کیا جاتا ہے جو پردہ اٹھنے سے پہلے قبض کے وقت اس پر ظاہر ہوتی ہے؟ یا کیا عین قبض ہی عین کشف الغطاء (پردہ کا اٹھنا) ہے؟\n\nاور اس میں سائل کو رد کرنے کا علم ہے، کیا اس کے سوال کا رد کرنا ہی اس کے سوال کا جواب ہے یا نہیں؟\n\nاور اس میں اس واجب سبب کا علم ہے جس کی وجہ سے اس شخص کے لیے تیزی ہوتی ہے جسے الحق (ذات حق) نے پکارا، کیا یہ جبر کی تیزی ہے یا جبر کی توقع کی تیزی؟\n\nاور اس میں اہل قبور میں سے اٹھائے جانے والوں کے کلام کے اختلاف کا سبب کیا ہے؟\n\nاور اس میں اس کا علم ہے کہ انہیں اس بارے میں کون جواب دیتا ہے، کیا الحق (ذات حق) جواب دیتا ہے یا فرشتے یا عالمون (جاننے والے)؟\n\nاور اس میں اس چیز کا علم ہے جو ان لوگوں پر **تجلی** (ظہور الٰہی) کرتی ہے جو اپنی قبروں سے اٹھائے جاتے ہیں، کیا وہ ایک صورت ہے یا مختلف صورتیں؟ اور کیا وہ **متجلی** (ظاہر ہونے والا) کوئی اسمِ الٰہی ہے یا نہیں؟\n\nاور اس میں اس سبب کا علم ہے جس نے بروج (برجوں) کی ترتیب کو مختلف کر دیا، جبکہ وہ عناصر کی ترتیب کی فطرت ہے۔ کیونکہ بروج کی ترتیب یہ ہے کہ ہر برج کسی نہ کسی لحاظ سے منافر (مخالف) اور مناسب (موافق) کے درمیان ہوتا ہے، جب آپ ہر ایک کو لیں گے تو اسے ویسا ہی پائیں گے جیسا ہم نے ذکر کیا۔ لیکن ارکان (عناصر) کی ترتیب مناسبت کے لیے ہے جس میں تمام وجوہ سے کوئی تنافر نہیں ہے۔ پس ناری (آتشی) تینوں مائیہ (آبی) اور ترابیہ (خاکی) سے ہیں، اور ترابیہ تینوں ناریہ اور ہوائیہ (ہوائی) سے ہیں، اور ہوائیہ تینوں ترابیہ اور مائیہ کے درمیان ہیں، اور مائیہ تینوں ہوائیہ اور ناریہ کے درمیان ہیں۔ اور ارکان ایسے نہیں ہیں۔\n\nاور اس میں \"عندی\" (میرے پاس)، \"لدی\" (میرے نزدیک)، \"عندنا\" (ہمارے پاس)، \"لدنا\" (ہمارے نزدیک)، \"لدینا\" (ہمارے پاس) اور \"لدنی\" (میرے نزدیک) کے درمیان فرق کا علم ہے۔\n\nاور اس میں چیزوں کے درمیان فصل (جدائی) کا علم ہے تاکہ وہ ایک دوسرے سے ممتاز ہو جائیں۔\n\nاور اس میں اس کا علم ہے کہ دیکھنے والا اپنی صورت اور صفت کے علاوہ کسی اور چیز کو دیکھتا ہے، خواہ دیکھنے والا کوئی بھی ہو۔\n\nاور اس میں اشتغال (مشغولیت) کا علم ہے، اور اسے شغل کیوں کہا گیا؟ اور کس سے مشغول ہوا جاتا ہے؟ اور کیا کوئی ایسا شغل ہے جو مکمل طور پر دوسروں سے بے نیاز کر دے یا نہیں؟\n\nاور اس میں اپنے جیسے سے انس کا علم ہے، مگر ایسی مثلیت سے جو **لَيْسَ كَمِثْلِهِ شَيْءٌ** (اس کی مثال کوئی چیز نہیں) کی مثلیت ہو۔\n\nاور اس میں الٰہیات کا علم اور وہ حالات جو نفوس دنیا کے گھر میں حاصل کرتی ہیں۔\n\nاور اس میں اعراسِ الٰہیہ (الٰہی شادیاں) کا علم ہے۔\n\nاور اس میں ہر اسمِ الٰہی کے لیے رحمت میں سے ان اسماء کا علم ہے جو اپنے ظاہر سے رحمت کے ختم ہونے کو ظاہر کرتے ہیں۔\n\nاور اس میں اس استحقاق کا علم ہے جو عالم کو اس صفت کی حیثیت سے حاصل ہوتا ہے جس پر وہ ہے، پس یہ صفت کا استحقاق ہے نہ کہ موصوف کا استحقاق۔\n\nاور اس میں عہدِ الٰہی اور کونی (کائناتی عہد) کا علم ہے کہ وہ کس چیز میں واقع ہوا؟\n\nاور اس میں متقدم (پہلے والے) کا حکم متاخر (بعد والے) میں کیسے ظاہر ہوا اور کہاں سے ظاہر ہوا؟\n\nاور اس میں بعدِ کونی (کائناتی دوری) کا بعدِ الٰہی (الٰہی دوری) سے فرق کا علم ہے۔\n\nاور اس میں نطق (بولنے) اور صمت (خاموشی) کا علم، اور ناطق اور صامت کی تعیین، اور ان کا وقت اور جگہ کا علم ہے۔\n\nاور اس میں علوی (بلند) صورتوں کا دنی (پست) صورتوں سے بدل جانے کا علم ہے۔\n\nاور اس میں کشف کے موجود ہونے کے باوجود نہ اٹھنے سے سستی کا سبب کا علم ہے۔\n\nاور اس میں اس چیز کا علم ہے جو زمانہ انسان کی نشأت میں اور دیگر معدنیات، نباتات اور حیوانات میں عطا کرتا ہے۔\n\nاور اس میں ابہام (مبہم رکھنا) اور ایضاح (واضح کرنا) کا علم ہے۔\n\nاور اس میں کثیر کا ایک کے وجود پر جمع ہونے کا علم ہے۔\n\nاور اس میں منشئ (پیدا کرنے والے) کو اس چیز کی ملکیت دینے کا علم ہے جسے اس نے پیدا کیا، اس وجہ سے کہ اس نے اسے پیدا کیا۔\n\nاور اس میں ریاضتِ الٰہیہ (الٰہی مجاہدہ) اور ریاضتِ کونیہ (کائناتی مجاہدہ) کے درمیان فرق کا علم ہے۔\n\nاور اس میں حضرہِ منعم (انعام کرنے والے کا مقام) کا علم، اور دنیا اور آخرت میں حکم میں اس کے لیے کیا ہے۔\n\nاور اس میں اس شخص پر اعتماد کرنے کے سبب کا علم ہے جس کے بارے میں معلوم ہے کہ وہ قابلِ اعتماد نہیں ہے۔\n\nاور اس میں مبدأ (ابتداء) اور معاد (انجام) کا علم ہے۔\n\nاور اس میں تشبیہ (مثال دینا) اور عکسِ تشبیہ کا علم، اور وہ اصل کیا ہے جس سے تشبیہ واقع ہوتی ہے؟\n\nاور اس میں علمِ الٰہی سے اضداد کے اجتماع کے اثر کا علم، اور پانی میں آگ کا اور آگ میں پانی کا وجود۔\n\nاور اس میں اس صفت کا علم ہے جس نے عالم کو اس کی عین (حقیقت) میں ظاہر کیا۔\n\nاور اس میں ملکوت (عالمِ غیب) کا علم، اور ملک (عالمِ شہادت) اور جبروت (عالمِ قدرت) سے اس کا حصہ کہاں ہے؟\n\nاور اللہ **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب سیصد و چهل و هشتم در معرفت منزل دو سرّ از اسرار قلب الجمع (قلب الجمع) و هستی (الوجود)»\n\nاگر گفته شود آیا در هستی (الوجود) کائنات چیزی وسیع‌تر از / رحمت خدا هست، بگو: قلبی که وجود داشته باشد.\nخانۀ الهی برای ایمانی که بر آن استوار است / همراه با پرهیزگاری و تقوا، اگر آن را بیاراید.\nحق (الحق) را از روی علم، عین صورتش، احاطه می‌کند / و اوست عزیزی که در چشم او خوار گشته است.\nقلب، ملک من است و سکونتگاه خالقش / عمر و مراقبت و ایمان و احسان است.\n\n[همانا انصار، کلمات خدا هستند که خداوند دین خود را به واسطۀ آنان یاری داد و آشکار ساخت]\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «من نسیم (نفس) رحمان را می‌یابم که از سوی یمن به من می‌رسد.» پس خداوند به واسطۀ انصار، از او (پیامبر) گشایش داد.\n\nانصار، کلمات خدا بودند که خداوند دین خود را به واسطۀ آنان یاری داد و آشکار ساخت. و این منزل، منزل آن تنفس رحمانی است. و از این منزل، تمامی منازل الهی در عالَم آشکار شدند؛ عالَمی که هر آنچه غیر از خداوند متعال است، اعم از بالا و پایین، روح و جسم، معنی و حس، ظاهر و باطن را شامل می‌شود. از این منزل، مقولات ده‌گانه پدید آمدند و در خبر نبوی، بویی از آنچه گفتیم آمده است. این منزل وجوهی به سوی هر جنس، نوع و شخص از عالَم دارد که برای جنس، نوع یا شخص دیگری نیست. و این منزل دارای صورت، روح و امداد الهی است، از آن حیث که حق (الحق) صورت را به خود نسبت داده است، اما از باطن صورت. و حکم این امداد در ظاهر و باطن صورت این منزل جاری است، اما در باطن کامل‌تر است. به همین دلیل، اسم باطن (الباطن) هنگام بیان این نعوت الهی، پس از اول (الأول)، آخر (الآخر) و ظاهر (الظاهر) ذکر شده است. و این بدان سبب است که امر الهی در تالی (آنچه بعد می‌آید) کامل‌تر و تمام‌تر از متلو (آنچه پیش از آن آمده) است؛ پس آنچه در اول است، در آن هست و افزون بر آن. کلمات هستی (الوجود) الهی این‌گونه‌اند: آخر (الآخر) متضمن اول (الأول) است، ظاهر (الظاهر) متضمن آخر (الآخر) و اول (الأول) است، و باطن (الباطن) متضمن ظاهر (الظاهر)، آخر (الآخر) و اول (الأول) است. و اگر چیزی پس از باطن می‌آمد، باطن و ماقبل آن را در بر می‌گرفت، اما حصر (محدودیت) مانع از آن شد که جز این چهار اسم وجود داشته باشد و پنجمی برای آن‌ها نیست، مگر هویت (هویته) متعالی او. و در عالَم حکمی نیست مگر از این چهار اسم. و عالَم ارواح و عالَم اجسام بر صورت این چهار اسم ظاهر شدند و عالَمی جز این دو نیست. از الهیات، علم، اراده، قدرت و قول است که عالَم ارواح، خارج از طبیعت و خود طبیعت، از آن‌ها پدید آمد. سپس از این چهار امر الهی، طبیعت را بر چهار وجه آشکار ساخت و از آن، عالَم اجسام، اعم از کثیف و لطیف، را ظاهر کرد. همان‌گونه که از این چهار امر الهی، از عالَم تدوین و تسطیر، عقل، نفس، طبیعت و هیولی را پیش از ظهور اجسام آشکار ساخت. و ارکان چهارگانه را آشکار کرد که عبارتند از آتش، هوا، آب و خاک. و نشأت حیوانی را بر چهار خلط (مزاج) ظاهر ساخت و برای این اخلاط چهار نیروی جاذبه، ماسکه، هاضمه و دافعه قرار داد. پس هستی (الوجود) را بر چهارگانه (تربیع) بنا نهاد و آن را برای خود همچون خانه‌ای قرار داد که بر چهار رکن استوار است؛ زیرا او اول (الأول)، آخر (الآخر)، ظاهر (الظاهر) و باطن (الباطن) است. برای باطن، رکن حجرالأسود است، زیرا آن دست راست خدا در زمین است که رو به بیعت با خدا دارد. پس چشم بر حجر می‌افتد و بصیرت بر دست راست. دست راست، باطن حجر است و برای چشم ظاهر نیست. پس رکن حجر بر سایر ارکان شرافت دارد و حکم باطن، حکم سه نعت (صفت) پیش از باطن را در خود جمع کرده است و این منزل به آن اختصاص دارد. و لُبّ این منزل، صورت الهی است که امداد از آن به این منزل می‌رسد. لُبّ آن صورت، روح آن است و آن لُبّ اللُبّ و خزانۀ امداد برای این منزل است. و این منزل بر تمام عالَم تسلط دارد، مانند: **كَمِشْكاةٍ فِيها مِصْباحٌ الْمِصْباحُ في زُجاجَةٍ** (چون چراغدانی که در آن چراغی است، چراغ در آبگینه‌ای است)؛ **الزجاجة يُوقَدُ من شَجَرَةٍ** (آبگینه از درختی افروخته می‌شود) که هویت اوست، پس **لا شَرْقِيَّةٍ ولا غَرْبِيَّةٍ** (نه شرقی است و نه غربی) و جهات را نمی‌پذیرد. از این زیتونه، روغن حاصل می‌شود که مادۀ ظهور این نور است. پس این‌ها چهار چیزند: مشکات، زجاجه، مصباح و زیت. و پنجمی هویت (هویته) است که همان زیتونۀ منزه از جهات است و به شجره (درخت) از باب تشاجر (درگیری و اختلاف) کنایه شده است، که همان تضاد است، به دلیل اسماء متقابلی که این هویت در بر دارد، مانند المعز (عزت‌دهنده) و المذل (خوارکننده)، الضار (زیان‌رسان) و النافع (سودرسان). پس بنگر که عبارات الهی در خبر دادن از آنچه امر بر آن است، چقدر کامل است. کسی که وارد این منزل شود و چیزی از عالَم و حقایق آن را از دست بدهد، در واقع وارد آن نشده است، بلکه شیطان یا نفس به او چنین وانمود کرده است که وارد شده است. **وما قَتَلُوهُ وما صَلَبُوهُ ولكِنْ شُبِّهَ لَهُمْ** (و او را نکشتند و به دار نیاویختند، بلکه امر بر آنان مشتبه شد)؛ زیرا حضرت خیال هر صورتی را ایجاد می‌کند. بسیاری از مردم وارد این حضرت خیالی می‌شوند و آنچه از صور بر آنان تجلی (التجلی) کرده است را مشاهده می‌کنند و گمان می‌برند که هستی (الوجود) ثابت‌العین را آن‌گونه که هست، مشاهده کرده‌اند، در حالی که جز آنچه خیال صورت داده، نبوده است. پس هر کس با چنین امری مواجه شد، اندکی درنگ کند. اگر آنچه مشاهده می‌کند، روحی ثابت‌العین در هستی (الوجود) یا محسوس در عین باشد، ثابت می‌ماند و تغییر نمی‌کند؛ اما اگر خیال باشد، ثابت نمی‌ماند و تغییر به سرعت به آن راه می‌یابد و صورت تغییر را در آن می‌بیند و می‌داند که آنچه با تغییر ظاهر شده، عین همان اولی است. برخی نیز خود را در دو صورت یا بیشتر می‌بینند و می‌دانند که او خودشان هستند. با این روش می‌توان بین صور ثابت‌العین، حساً و روحاً، و صور خیالی تفاوت گذاشت. و این ترازوی آن کسی است که معرفت (المعرفة) ندارد. من تو را آگاه ساختم و نصیحت کردم، پس اگر از اهل کشف (الکشف) هستی، از این میزان غافل مشو. خداوند خواب را در عالَم حیوانی قرار نداد، مگر برای مشاهدۀ حضرت خیال به طور عمومی، تا دانسته شود که عالَم دیگری وجود دارد که شبیه عالَم حسی است. و او را به سرعت دگرگونی آن صور خیالی برای خفتگان عاقل آگاه ساخت، بر این اساس که در عالَم حسی و کون ثابت نیز دگرگونی‌هایی همراه با اَنفاس (دم‌ها) وجود دارد، اما چشم‌ها و حواس آن‌ها را درک نمی‌کنند، مگر به طور خاص در کلام و حرکات. و غیر از این دو صنف، صورت دگرگونی‌ها و تغییرات در آن‌ها درک نمی‌شود، مگر با بصیرت که همان کشف (الکشف) است، یا با تفکر صحیح در برخی از این صور، نه در همۀ آن‌ها، زیرا فکر از درک کامل آن قاصر است. و اصل همۀ این‌ها، یعنی اصل تغییر از صورتی به مانند آن یا خلاف آن، در خیال یا در حس یا هر جای دیگر در عالَم، این است که همواره تا ابدالآبدین در حال تغییر است، به دلیل تغییر اصلی که آن را مدد می‌رساند و آن تحول الهی در صور است که در حدیث صحیح آمده است. پس از آنجاست که در معانی و صور ظاهر شد:\n\nاز معنایی به معنای دیگر / و از صورتی به صورتی دیگر.\n\nو این همان قول خداوند متعال است: **كُلَّ يَوْمٍ هُوَ في شَأْنٍ** (هر روز او در کاری است) و آن همان تغییراتی است که در کائنات ایجاد می‌کند. پس ناگزیر است که در هر صورتی، تغییر آن با حکمی ظاهر شود که جز برای آن متغیر نباشد. اگر فهمیدی، پس امر را آن‌گونه که هست برایت روشن ساختم. پس **إِنَّ في ذلِكَ لَذِكْرى‏** (همانا در این، تذکری است)؛ یعنی در تغییر عالَم، تذکری است به تغییر اصل، **لِمَنْ كانَ لَهُ قَلْبٌ** (برای کسی که قلب دارد). زیرا قلب دارای تقلیب (دگرگونی) از حالی به حال دیگر است و به همین دلیل قلب نامیده شده است. پس کسی که قلب را به عقل تفسیر کند، معرفت (المعرفة) به حقایق ندارد؛ زیرا عقل، قید و بند است. اما اگر منظور او از عقل که همان قید است، چیزی باشد که ما می‌خواهیم، یعنی آنچه مقید به تقلیب است و پیوسته در حال دگرگونی است، پس صحیح است، همان‌گونه که ما در مورد تمکین در تلوین (رنگارنگی) می‌گوییم که پیوسته در حال رنگ عوض کردن است. و هر کسی این را درک نمی‌کند. و چون دانستیم که از صفات دهر، تحول قلب است و خداوند همان دهر است و ثابت شده است که او در صور متحول می‌شود و هر روز در کاری است و روز به اندازۀ نَفَس است، پس این از اسم دهر اوست، نه از اسم دیگری، اگر تعقل کنی. اگر انسان قلب خود را مراقبت کند، می‌بیند که بر یک حالت باقی نمی‌ماند. پس می‌داند که اگر اصل این‌گونه نبود، این تقلب (دگرگونی) مستندی نداشت؛ زیرا قلب میان دو انگشت از انگشتان خالقش، یعنی رحمان، قرار دارد. و دگرگون کردن انگشتان برای قلب، به غیر از حالت دو انگشت است، برای تغییر آنچه می‌خواهد قلب را در آن دگرگون کند.\n\n«هر کس خود را شناخت، پروردگارش را شناخت.»\n\nو در حدیث انگشتان، بشارتی الهی است، زیرا آن دو را به رحمان نسبت داده است. پس قلب را دگرگون نمی‌کند مگر از رحمتی به رحمت دیگر. و اگرچه در انواع دگرگونی‌ها بلا و سختی باشد، اما در باطن آن رحمتی پنهان است که حق (الحق) آن را می‌داند؛ زیرا آن دو انگشت، انگشتان رحمان هستند. پس بفهم! زیرا اگر آنچه را ذکر کردیم بدانی، خواهی دانست که قلب هستی (الوجود) کیست که عالَم صورت خود را که او قلب آن و تمامی اجزای آن است، مدد می‌رساند. و او قلب الجمع (قلب الجمع) است و آن چیزی است که این صورت وجودی از حقایق ظاهر و باطن جمع کرده است. و چون خداوند **كُلَّ يَوْمٍ هُوَ في شَأْنٍ** (هر روز در کاری است)، دگرگونی عالَم که صورت این قالب است، همراه با اَنفاس (دم‌ها) از حالی به حال دیگر است. پس عالَم هرگز بر یک حالت واحد، حتی برای یک لحظه، ثابت نمی‌ماند؛ زیرا خداوند پیوسته خالق است. و اگر عالَم برای دو لحظه بر یک حالت باقی می‌ماند، به بی‌نیازی از خدا متصف می‌شد. اما مردم در **لَبْسٍ من خَلْقٍ جَدِيدٍ** (اشتباهی از آفرینش جدید) هستند. پس منزه است کسی که به اهل کشف (الکشف) و هستی (الوجود)، تنزه در دگرگونی احوال و مشاهدۀ کسی که هر روز در کاری است، عطا کرده است. و خداوند همان دهر است. پس حکم این دهر در عالَم اکبر و اصغر که همان انسان است، هرگز متوقف نمی‌شود. و انسان یکی از معلومات چهارگانه‌ای است که تأثیر دارند. معلوم اول برای ما انسان است. معلوم دوم عالَم اکبر است که صورت ظاهر عالَم انسانی است. و انسان که قلب این صورت است، و منظورم از آن جز انسان کامل (الإنسان الکامل) صاحب مرتبه نیست، معلوم سوم است. و معلوم چهارم، حقیقة الحقائق (حقيقة الحقائق) است که حکم در قِدَم و حدوث دارد. و معلوم پنجمی که تأثیری داشته باشد، جز آنچه ذکر کردیم، وجود ندارد. و از این منزل، شاخه‌های ایمان منشعب می‌شود که هفتاد و چند شعبه است؛ پایین‌ترین آن، دور کردن آزار از راه و بالاترین آن، گفتن «لا إله إلا الله» است و شاخه‌های میان این دو. و این منزل، منزل ایمان است و ایمان در قلب مؤمن از آنجا ظاهر شده است. و اسم «المؤمن» از اسماء الهی، مخصوص این منزل است. پس مؤمن از اینجا شاخه‌های ایمان را آغاز کرد و آشکار ساخت. و امت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) عمرهای خود را از این منزل گرفته‌اند. پس نهایت عمر این امت محمدیه هفتاد سال است و چیزی بر آن افزوده نمی‌شود. اگر بیشتر شود، محمدی نیست، بلکه وارث کسی است که خداوند از انبیا، از آدم تا خالد بن سنان، خواسته است و عمرش به اندازۀ عمر کسی که از او ارث برده، طولانی می‌شود. و به همین دلیل:\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) دربارۀ عمرهای امتش فرمود: «عمرهای آنان بین شصت تا هفتاد سال است.»\n\nپس هفتاد سال را نهایت عمر امت خود قرار داد. از این رو دانستیم که منظور او از امتش، جز محمدیونی نیستند که خداوند آنان را به رتبه‌ای مخصوص گردانیده که پیامبرش را به آن اختصاص داده است، از احکام و مراتب بر تمامی انبیا؛ زیرا ما **خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ** (بهترین امتی هستیم که برای مردم پدیدار شده است). و هر حکم و رتبه‌ای که برای پیامبری پیش از او بود، اگرچه برای او نیز بود و در آن اشتراک داشت، اما به تنهایی برای او خالص نشد. و شرف کامل برای او نیست مگر به آنچه که برای او خالص شده و غیر او در آن شریک نیست. پس امت او نیز مانند او هستند. کسی از این امت که هنگام جدایی از دنیا یا در حال خود بر شرع مشترک باشد، او را به کسی نسبت می‌دهیم که ابتدا پیش از ظهور محمد (صَلَّى اللهُ عَليهِ وسَلَّم) به واسطۀ او ظاهر شده است، تا تفاوت بین دو امر آشکار شود و منزلت دو شخص شناخته گردد. و اگرچه او آن را جز از تقریر محمد (صَلَّى اللهُ عَليهِ وسَلَّم) نگرفته باشد، او از امت اوست، اما حکم اشتراک از حکم اختصاص متمایز می‌شود. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در سن شصت و سه سالگی درگذشت. و کسی که عمرش از هفتاد سال بیشتر شود، هر چقدر هم که باشد، اگرچه از امت او و از کسانی باشد که تمام اختصاص محمدی را کسب کرده است، هنگام قبض روح، جز در شرع مشترک قبض نمی‌شود. و این نقصانی برای او نیست، زیرا حکم اختصاص را به دست آورده است، اما خروج او از هفتاد سالی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آن را غایت غالب عمر امت خود که در حکم اختصاصی قبض می‌شوند، قرار داد، باعث می‌شود که بین او و دیگران از امت تفاوت گذاشته شود. و این از علومی است که با رأی و قیاس درک نمی‌شود، بلکه از علوم موهبت الهی است. همچنین ذکر شده است که هر یک از خلفای چهارگانه نمرد مگر اینکه به شصت و سه سالگی رسیدند، تا اثبات شود که آنان در اختصاص محمدی قبض شدند، نه در حکم شرع مشترک. پس از این منزل، این چهار نفر از دیگران متمایز شدند. و همچنین ده نفر (مبشره) نیز از این منزل متمایز شدند که عبارتند از ابوبکر، عمر، عثمان، علی، سعد، سعید، طلحه، زبیر، عبدالرحمن بن عوف و ابوعبیده بن جراح. پس این منزل آنان است که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) از آنجا آنان را تعیین کرد و در یک مجلس با نام‌هایشان برایشان بهشت را گواهی داد. زیرا کسانی که به بهشت گواهی داده شده‌اند بسیارند، اما نه در یک مجلس و مقید به صفت خاصی هستند، مانند هفتاد هزار نفری که **يَدْخُلُونَ الْجَنَّةَ ... بِغَيْرِ حِسابٍ** (بدون حساب وارد بهشت می‌شوند). و عکاشه بن محصن از میان آنان تعیین شد. و با قول **بِغَيْرِ حِسابٍ** (بدون حساب) هشدار داد؛ یعنی این امر در حساب آنان نبوده و آن را تصور نکرده بودند، بلکه خیری از جانب خدا برایشان آشکار شد که انتظارش را نداشتند. و آنان کسانی هستند که رقیه (دعا) نمی‌طلبند، داغ نمی‌کنند، فال بد نمی‌زنند و **عَلى‏ رَبِّهِمْ يَتَوَكَّلُونَ** (بر پروردگارشان توکل می‌کنند). منظور از «لا يسترقون» (رقیه نمی‌طلبند) این است که برای رفع دردی که به آن‌ها می‌رسد، طلب رقیه نمی‌کنند و برای کسی که دردی به او رسیده، رقیه نمی‌خوانند. و استفعال (طلب) برای مبالغه آمده است. اما پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) رقیه خواند و در بیماری خود از طب استفاده کرد، زیرا به او تأسّی می‌شود، پس ضعیف و قوی به او تأسّی می‌کنند، چرا که او رحمتی برای عالمیان است. و همۀ رسولان نیز چنین‌اند. پس حکم آنان، حکم امت‌هایشان نیست و این در مقام آنان قدحی وارد نمی‌کند. آنان مقامی مجهول دارند که در آن برای امت‌هایشان به صورت قوت و ضعف ظاهر می‌شوند، پس هیچ کس نمی‌داند که آنان را به کدام مقام نسبت دهد. و قول او «ولا يتطيرون» (فال بد نمی‌زنند)، زیرا طائر (پرنده) همان حظ (بهره) است. پس آنان از بهره‌های نفس خود خارج شده‌اند و مشغول به اعمالی هستند که خداوند آنان را به آن مکلف کرده است، به جهت وفای به آنچه ربوبیت بر آنان مستحق است. آنان به دنبال بهره‌ای برای نفس خود از پاداشی که خداوند بر آن اعمال وعده داده است، نیستند. پس آنچه آنان را به عمل واداشته، پاداش نیست، بلکه وفای به مقام است که ذکر کردیم. پس معنای «لا يتطيرون» این است که بر اساس حظوظ (بهره‌ها) عمل نمی‌کنند. و قول او «ولا يكتوون» (داغ نمی‌کنند)، زیرا داغ کردن جز با آتش نیست و خداوند آنان را از تماس آتش حفظ کرده است. پس در نفس خود می‌یابند که داغ نمی‌کنند و این یک عصمت الهی است، از جایی که خودشان نمی‌دانند. و قول او **وعَلى‏ رَبِّهِمْ يَتَوَكَّلُونَ** (بر پروردگارشان توکل می‌کنند)، یعنی او را وکیل می‌گیرند و بر او توکل می‌کنند، توکل موکل بر وکیل. و این یک معرفت (المعرفة) میانی است که از قصد دوم به آنان رسیده است. آنان دیدند که خداوند اشیا را برای آنان آفریده و آنان را برای خود آفریده است. پس او را در آنچه برایشان آفریده، وکیل گرفتند تا برای آنچه آفریده شده‌اند، فارغ شوند. و ما گفتیم مرتبۀ میانی، زیرا بالاتر از آن مرتبۀ عالی است که همان قصد اول است. زیرا خداوند هیچ چیز از عالَم را نیافرید مگر برای خود، تا او را به حمدش تسبیح گوید، و ما به حکم عنایت و تبعیت از آن بهره‌مند می‌شویم. و قصد دوم همین است، زیرا وقتی ما را مساوی قرار داد و **ما في السَّماواتِ وما في الْأَرْضِ جَمِيعاً مِنْهُ** (آنچه در آسمان‌ها و آنچه در زمین است، همه از اوست) را برای ما مسخر کرد، دو قصد در خلقت در عالَم انسانی و غیر انسانی وجود دارد. کسی که در تمام امورش بر او توکل می‌کند، زیرا مؤمن است که خداوند متعال در هر چیزی وجهی دارد. و جز مؤمن این را نمی‌گوید، زیرا غیر مؤمن از مردم، به ویژه کسانی که می‌گویند خداوند جز یکی را از طریق علیت ایجاد نکرده و به جزئیات عالَم به تفصیل علم ندارد، مگر با علم کلی که تمام علم به جزئیات در آن مندرج است. به همین دلیل، توکل را در مؤمنان قرار داد. خداوند متعال می‌فرماید: **وعَلَى الله فَتَوَكَّلُوا إِنْ كُنْتُمْ مُؤْمِنِينَ** (و اگر مؤمن هستید، بر خدا توکل کنید). پس توکل را نشانۀ وجود ایمان در قلب بنده قرار داد. و جز گروه مخصوصی از متوکلان مؤمن که امر خدا را در این باره اطاعت کردند، او را وکیل نگرفتند، در قول او: **فَاتَّخِذْهُ وَكِيلًا** (پس او را وکیل بگیر). کسی که به هستی (الوجود) در اشیا علم ندارد، تصور می‌کند که تو صاحب مال هستی و او را وکیل گرفته‌ای، منزه است او، در آنچه ملک توست. و اینکه نسبت دادن اموال به تو در قول او «اموالکم» (اموال شما) نسبت ملکیت است. در حالی که نمی‌داند آن نسبت، نسبت استحقاق است، مانند زین چهارپا و درِ خانه، نه نسبت ملکیت. و آنچه ما و اکابر می‌بینیم این است که خداوند به ما فرمود: **وَأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ** (و از آنچه شما را در آن جانشین قرار داده، انفاق کنید). پس آنچه برای ما نیست، او را وکیل گرفتیم و او را وکیل در انفاقی قرار دادیم که ملک ماست، به دلیل علم ما به علم وکیل به مصالح و مواضع انفاقی که حکم اسراف و بخل در آن وارد نمی‌شود. پس خداوند انفاق را بر ما به عهده گرفت، به این صورت که به ما الهام کرد کجا و چه زمانی انفاق کنیم. زیرا نفقه بر دست ما ظاهر می‌شود و دست ما دست وکیل در انفاق است. پس ما در انفاق معصوم هستیم، به دلیل معرفت (المعرفة) ما به وجوه و اینکه دست ما دست حق (الحق) است، زیرا دست وکیل است. و این جز با کشف (الکشف) الهی دانسته نمی‌شود. پس آنان در توکل در این مرتبه هستند و خودشان آن را درک نمی‌کنند، زیرا فرمود: «بغیر حساب». پس آنان بر غیر بصیرت هستند و اعمالشان اعمال اهل بصیرت است، به عنایت الهی: **يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ والله ذُو الْفَضْلِ الْعَظِيمِ** (رحمت خود را به هر که بخواهد اختصاص می‌دهد و خداوند صاحب فضل بزرگ است). و فضل به معنای زیادت است.\n\n[اینکه هستی (الوجود) عالَم به واجب الوجود لنفسه (واجب الوجود بالذات) گره خورده است]\n\nو بدان که چون اصل عالَم این بود که هستی (الوجود) آن به واجب الوجود لنفسه (واجب الوجود بالذات) گره خورده باشد، پس بعضی از آن به بعض دیگر گره خورده است. از این رو، هنگامی که انسان شروع به نظر در علم آن می‌کند، امر در آن به تسلسل می‌افتد و او را به حکم ارتباطی که در آن است، از چیزی به چیز دیگر می‌کشاند. و این جز در علم اهل الله خاصه نیست و بر قانون علمای رسوم و کون جاری نمی‌شود. قانون آنان، ارتباط عالَم به یکدیگر است. به همین دلیل می‌بینی که از چیزی به چیز دیگر می‌روند، اگرچه عالم رسوم آن را نامناسب ببیند. و این همان علم خداست. و معلوم است که مناسبت وجود دارد، اما در نهایت خفا. مانند قول خداوند متعال: **حافِظُوا عَلَى الصَّلَواتِ والصَّلاةِ الْوُسْطى‏ وقُومُوا لِلَّهِ قانِتِينَ** (بر نمازها و نماز میانه محافظت کنید و برای خدا با فروتنی بایستید). پس آیۀ نماز را آورد و پیش از آن آیات نکاح و طلاق و پس از آن آیات وفات و وصیت و غیره آمده است که در ظاهر هیچ مناسبتی بین آن‌ها و نماز نیست. و اگر آیۀ نماز از این موضع حذف می‌شد و آیۀ بعد از آن به آیات قبل از آن متصل می‌شد، تناسب برای هر صاحب دو چشمی آشکار می‌شد. علم اولیای خدا این‌گونه است. از جنید دربارۀ توحید سؤال شد. او با امری به سائل پاسخ داد. سائل گفت: نفهمیدم، دوباره بگو. او با امر دیگری پاسخ داد. سائل گفت: نفهمیدم. او با امر دیگری پاسخ داد و سپس به او گفت: امر این‌گونه است. سائل گفت: آن را بر من املا کن. جنید گفت: اگر من آن را جاری می‌کردم، املا می‌کردم. (یعنی) می‌گوید: من از روی هوی سخن نمی‌گویم، بلکه آن علم خداست، نه علم من. پس کسی که قرآن را بداند و به آن تحقق یابد، علم اهل الله را می‌داند و می‌داند که آن تحت فصول محصور وارد نمی‌شود و بر قانون منطقی جاری نمی‌گردد و هیچ میزانی بر آن حکم نمی‌کند، زیرا آن میزان هر میزانی است. برای این منزل از عالَم اجسام، فلک خورشید از افلاک است. هفت فلک بالای آن است که سه تای آن‌ها سماوات و فلک منزل و اطلس است که همان فلک بروج و کرسی و عرش محیط است و این پایان عالَم اجسام است. و زیر آن نیز هفت چیز است: سه سماوات و کرات اثیر، هوا، آب و زمین. و با قطع کردن آن در فلک، فصول سال ظاهر می‌شوند که چهار فصل هستند، به دلیل وجود تربیع (چهارگانه) که ذکر کردیم. زیرا بروج که همان تقدیرات در فلک اطلس هستند، چهارگانه می‌باشند و خداوند آن‌ها را بر چهار مرتبۀ ناری، ترابی، هوایی و مائی قرار داده است، به حکم چهارگانۀ الهی و چهارگانۀ طبیعی. و برای هر فصل سه حکم است: دو حکم برای دو طرف و یک حکم برای وسط. و بین آن‌ها احکامی در هر حرکت، دقیقه، ثانیه و ثالثه وجود دارد که تقسیم در آن‌ها به بی‌نهایت می‌رسد. و ستارۀ آسمان دوم را از جهت ما ممزوج قرار داد که همان کاتب (عطارد) است. و به همین دلیل عیسی (علیه السلام) را در آن ساکن کرد، زیرا او ممزوج از دو عالَم است؛ زیرا بین فرشته و بشر ظاهر شد که جبرئیل و مریم هستند. پس او روحی از روح و بشری از بشر است. و این را در غیر او از این نوع قرار نداد، همان‌گونه که چیزی از جواری خُنس (ستارگان پنهان‌شونده) را به صورت کاتب قرار نداد. پس او ششمین از آنجاست تا شرف رتبۀ قول خداوند را به دست آورد: **ولا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ** (و نه پنج نفر، مگر اینکه او ششمین آن‌هاست). و او از جهت ما دومین است، زیرا دوم همان باء است و او مبدع اول (با فتح دال) است که از انسان ظاهر شده است، انسانی که ظل صورت الهی است که ازلی است. پس آن، اول است، نه اولیت حق (الحق)، زیرا اولیت حق (الحق) دومی را نمی‌پذیرد، چرا که واحد عدد نیست و اول عدد، دو است. پس امتزاج در سال با ظهور فصول آشکار شد.\n\n[همانا خداوند همان دهر است]\n\nو بدان که چون خداوند ما را آگاه ساخت که او همان دهر است، سبحانه برای ما ذکر کرد که برای او ایامی از حیث دهر بودنش وجود دارد و آن‌ها ایام الله هستند. پس این ایام، احکام اسماء متعالی او در عالَم را تعیین می‌کنند. برای هر اسمی ایامی است که زمان حکم آن اسم است و همۀ آن‌ها ایام الله و تفصیلات دهر با حکم در عالَم هستند. و این ایام در هم می‌آمیزند (توالج) و برخی در برخی دیگر داخل می‌شوند و برخی بر برخی دیگر غلبه می‌کنند. و این همان چیزی است که ما در عالَم از اختلاف احکام در یک زمان واحد می‌بینیم. این به دلیل توالج، غلبه، دگرگونی و تکرار آن‌هاست. و برای این ایام الهی، شب و روزی است. شب آن، غیب است و آن چیزی است که از ما پنهان است و عین حکم آن در ارواح علوی که فوق طبیعت هستند و ارواح مهیمه است. و روز آن، شهادت است و آن عین حکم آن در اجسام طبیعی تا آخرین جسم عنصری است که زیر طبیعت قرار دارند. و سدفۀ (تاریکی گرگ و میش) این روز، عین حکم این ایام در ارواح مسخّر است که زیر طبیعت هستند و آن‌ها آبادکنندگان آسمان‌ها و زمین و آنچه بین آن‌هاست، می‌باشند. و آن‌ها صافون (صف‌کشیدگان)، تالون (تلاوت‌کنندگان) و مسبحون (تسبیح‌کنندگان) هستند و بر مقامات معلومی قرار دارند. از جملۀ آن‌ها زاجرات (رانندگان)، مرسلات (فرستادگان)، مقسمات (تقسیم‌کنندگان)، منقیات (پاک‌کنندگان)، نازعات (برکندگان)، ناشطات (بیرون‌آورندگان) و مدبرات (تدبیرکنندگان) و غیره، مانند سائحین (سیاحت‌کنندگان)، عارجین (بالاروندگان)، کاتبین (نویسندگان) و راقبین (مراقبان) هستند. همۀ این‌ها تحت حکم ایام الله از حیث سدفۀ این ایام قرار دارند. از غلبۀ روز این ایام بر شب آن، ارواحی که فوق طبیعت هستند، به وجود آمدند. و از غلبۀ شب این ایام بر روز آن، اجسامی که زیر طبیعت هستند، به وجود آمدند. و از توالج (درهم‌آمیختگی) شب آن با روز آن، که نه روز خالص است به دلیل حکم شب و مشارکت آن، و نه شب خالص است به دلیل حکم روز و مشارکت آن، و این حالت برای این ایام، سدفه نامیده می‌شود، ارواحی که زیر طبیعت هستند، به وجود آمدند. و چون خداوند ایام خود را به این اقسام تقسیم کرد، شب آن را سه قسم و روز آن را سه قسم قرار داد. پس او سبحانه در ثلث آخر شب ایام خود بر بندگانش نازل می‌شود و آن تجلی الهی (التجلی) او در آن برای ارواح طبیعی مدبر اجسام عنصری است. و ثلث وسط، در آن برای ارواح مسخّر تجلی (التجلی) می‌کند. و ثلث اول، در آن برای ارواح مهیمنه تجلی (التجلی) می‌کند. و روز این ایام را به سه قسم تقسیم کرد که در هر قسم بر عالَم اجسام تجلی (التجلی) می‌کند، به دلیل اینکه آن‌ها پیوسته به حمد خدا تسبیح می‌گویند. پس در ثلث اول، بر اجسام لطیفی که چشم‌ها آن‌ها را درک نمی‌کنند، تجلی (التجلی) می‌کند. و در ثلث وسط، بر اجسام شفاف تجلی (التجلی) می‌کند. و در ثلث آخر، بر اجسام کثیف تجلی (التجلی) می‌کند. و اگر این تجلی (التجلی) نبود، معرفت (المعرفة) آنان به کسی که او را تسبیح می‌گویند، صحیح نمی‌شد؛ زیرا تسبیح‌کننده باید معرفت (المعرفة) به کسی که او را تسبیح می‌گوید، داشته باشد. و معرفت (المعرفة) به خدا صحیح نیست که از فکر یا خبر باشد، بلکه از تجلی (التجلی) او برای هر تسبیح‌کننده‌ای است. پس برخی از آنان به این امر عالم هستند و برخی دیگر آن را نمی‌دانند و نمی‌دانند که از روی معرفت (المعرفة) تجلی (التجلی) تسبیح گفته‌اند. و این جز برای برخی از ثقلین (جن و انس) نیست. و غیر از این دو، آنان عارف به کسی هستند که بر آنان تجلی (التجلی) کرده است و او را بر اساس شهود (الشهود) تسبیح می‌گویند، اجسام به طور عمومی و ارواح به طور خصوصی. پس هر کس که قدرت رساندن آنچه را مشاهده می‌کند، ندارد، علم به کسی که بر او تجلی (التجلی) کرده است، نزد اوست. و همچنین کسی که قدرت رساندن دارد، اما امین است و جز به امر الهی سخن نمی‌گوید، علم به کسی که بر او تجلی (التجلی) کرده است، نزد اوست. و کسی که می‌داند قدرت رساندن دارد، اما سخن‌چین است و آنچه را مشاهده و شنیده، فاش می‌کند و امین نیست که منتظر امر صاحب امانت باشد، حق (الحق) در تجلی (التجلی) خود به او نمی‌شناساند که اوست. و آنان همان منکران او هستند، هنگامی که در دنیا و آخرت بر آنان تجلی (التجلی) می‌کند. خداوند ما را از امنای عالم به کسی که بر آنان تجلی (التجلی) کرده است، قرار دهد. اگر بگویی: شب و روز در روز جز با طلوع و غروب خورشید ایجاد نمی‌شود، پس خورشیدی که شب و روز را در ایام الله که دهر نامیده می‌شود، آشکار کرده، چیست؟ می‌گوییم: اسم او «النور» است که ذکر شده است نور آسمان‌ها و زمین است. پس طلوع و غروب برای او از پشت حجاب انسان مثلی است که ذکر کردیم او ظل (سایه) اوست که بر صورت او آفریده شده است، همان حکم ازلی که مثلیت را از او نفی کرد و عین هستی (الوجود) او را در قولش **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست) با کاف صفت اثبات کرد. پس شب او باطن و روز او ظاهر نامیده می‌شود. پس او باطن است از حیث شبش و ظاهر است از حیث نورش. و آن مثل انسانی، طلوع این نور را متمایز می‌کند، پس روز می‌شود و غروب این نور را متمایز می‌کند، پس شب می‌شود. و این حکم ظاهر و باطن در عالَم است. و ما پیش از این مقرر کردیم که برای هر اسمی در عالَم حکمی وجود دارد. پس دهر از حیث عین خود، یک روز است که تعدد نمی‌پذیرد و شب و روزی ندارد. پس هنگامی که اسماء الهی آن را در بر می‌گیرند، با احکام خود در این روز ازلی ابدی که عین دهر ایام الهی است، آن را تعیین می‌کنند. ایامی که تذکردهنده امر شده است که ما را به آن‌ها متذکر سازد تا آن‌ها را از ایام زمان بشناسیم. و هنگامی که اسم «النور» در هستی (الوجود) ظل مثلی منزه و در طلوع آن بر کسانی که در آن از عالَم هستند، گرفته می‌شود، عالَمی که در این مثل است، آن طلوع تا زمان غروب آن از آنان، روز نامیده می‌شود و از زمان غروب آن از آنان، شب نامیده می‌شود. و آن نور از آن ظل غایب نیست، همان‌گونه که خورشید در طلوع و غروب خود از زمین غایب نیست، بلکه بر عالَمی که در آن است، طلوع و غروب می‌کند. و تاریکی‌ای که در زمین حادث می‌شود، جز سایه‌های اتصالات آنچه از عالَم در آن است، نیست. پس آن در حقیقت سایه‌ای است که آن را تاریکی می‌نامند. و کسانی که آن را تاریکی می‌نامند و این کشف (الکشف) را ندارند، آن را سایۀ زمین می‌دانند به دلیل کثافتی که دارد. و آن در مثل ظلی الهی، فقط سایۀ اعیان آبادکنندگان آن است. پس این را بدان.\n\n[احکام ایام الهی]\n\nسپس خداوند این ایام معلوم نزد ما را که حرکت فلک اطلس آن‌ها را ایجاد کرده است و شب و روزی را که حرکت قلب، یعنی خورشید، آن‌ها را ایجاد کرده است، قرار داد تا احکام ایام الهی که برای اسماء هستند، با آن‌ها اندازه‌گیری شوند. پس آن‌ها مانند میزان‌هایی برای آن ایام هستند که مقادیر آن ایام با آن‌ها شناخته می‌شود. پس فرمود: **وَإِنَّ يَوْمًا عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ** (و همانا یک روز نزد پروردگار تو مانند هزار سال از آن چیزی است که شما می‌شمارید). پس اگر سیصد و شصت روز را در هزار سال ضرب کنی، عددی که پس از ضرب به دست می‌آید، ایام تقدیری است که برای «یوم الرب» است. پس آن روز سپری می‌شود و سپس در دهر، روز دیگری برای اسم دیگری غیر از اسم «الرب» ایجاد می‌کند. و همچنین سیصد و شصت روز را در **خَمْسِينَ أَلْفَ سَنَةٍ** (پنجاه هزار سال) ضرب می‌کند. پس عددی که پس از ضرب از ایام به دست می‌آید، ایام تقدیری است که برای «یوم ذی المعارج» از اسماء الهی است. پس هنگامی که آن روز سپری شود، در دهر روز دیگری برای اسم دیگری غیر از «ذی المعارج» ایجاد می‌کند. امر همیشه این‌گونه است. پس برای هر اسم الهی روزی است. و ما این دو روز، «یوم الرب» و «یوم ذی المعارج» را ذکر کردیم، به دلیل اینکه در کتاب خدا آمده‌اند و مؤمنان نمی‌توانند آن‌ها را انکار کنند. اما آنچه جز بر زبان ما نیامده است، آنان حکم انکار در آن دارند. بلکه امر همان‌گونه است که ذکر کردیم: هیچ اسم الهی، از آنچه دانسته می‌شود و نادانسته می‌ماند، نیست مگر اینکه در دهر روزی دارد و آن‌ها ایام الله هستند، **وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ** (ولی بیشتر مردم نمی‌دانند). هنگامی که از اسماء الهی به «یوم العقل الاول» (روز عقل اول) نزول می‌کنیم، حکم آن در نفس کلی آن را به شب و روز تقسیم می‌کند. شب این روز نزد نفس، اعراض عقل از آن است، هنگامی که برای کسب فیض به پروردگارش روی می‌آورد. و روز آن نزد این نفس، هنگامی است که برای افاضه به آن روی می‌آورد. پس آن روز نفس است. و خداوند از این حکم در نفس دو نیرو قرار داد: نیروی علمی که شب آن در عالَم زیرین است، و نیروی عملی که روز آن در عالَم زیرین است. و آن همان است که غیب و شهادت، حرف و معنی، معقول و محسوس نامیده می‌شود. پس این حکم در نفس، روزی است که در آن نه روز است و نه شب، در حالی که در عالَم، روز و شب است. و همچنین «یوم الهیولی الکل» (روز هیولای کلی)، شب آن جوهر آن و روز آن صورت آن است و آن در ذات خود روزی است که نه شب دارد و نه روز. و خورشید هر شب و روز آن، همان معنای آشکارکنندۀ این حکم است که به واسطۀ آن، شب و روز به این روز نسبت داده می‌شود. هنگامی که به فلک بروج نزول می‌کنیم، روز در حرکت آن تعیین می‌شود و آن کرسی که در آن قطع می‌شود، تعیین می‌شود. پس تعیین آن از بالاست، زیرا هنوز در جوف آن چیزی که حرکتش به واسطۀ آن کامل شود، ظاهر نشده بود. پس آن روزی است که نه روز دارد و نه شب و نه مقدار ایامی از جهت مقعر آن. و آن متماثل الاجزاء است، اما متماثل الاحکام نیست. و چون کرسی همان بود که تعیین احکام را با تعیین مقادیر نامیده شده به بروج در آن آشکار ساخت و برای هر مقدار در آن فرشتۀ معینی قرار داد، مقادیر با آن احکامی که آن فرشتۀ معین متولی آن بود، تعیین شدند. پس هنگامی که یک دور کامل می‌زند، از جهت کرسی، روز نامیده می‌شود. و کلمه در عرش یکی بود، مانند حکم روز. پس هنگامی که کرسی زیر عرش قرار گرفت، مانند حلقه‌ای که در دشتی از زمین انداخته شده باشد، آن کلمۀ واحد که روز عرش است، در کرسی تقسیم شد. و تقسیم آن به واسطۀ دو قدمی بود که به این کرسی آویزان شدند و آن‌ها «قدم الرب» و «قدم الجبار» هستند. پس آن دو، یعنی این دو قدم، برای روز عرش مانند شب و روزی بودند که روز را تقسیم کردند. و روز عرش، احدیت کلمۀ اوست، زیرا امر خدا واحد است.\n\n[همانا خداوند فلک کواکب ثابته (ستارگان ثابت) را ایجاد کرد]\n\nسپس خداوند فلک کواکب ثابته (ستارگان ثابت) را ایجاد کرد که مقادیر بروج آن‌ها را متمایز می‌سازد. و برای هر کوکبی از آن‌ها، قطعی در فلک بروج است. هنگامی که کوکب تمام آن را قطع کند، یک روز از ایام آن کوکب است که مدت قطع آن است. و آن کوکب یک درجه از سیصد و شصت درجه را در صد سال از سال‌هایی که ما می‌شماریم، قطع می‌کند. سپس بین این دو فلک، بهشت و آنچه در آن است و از عالَم آنچه را که جز خدا عددشان را نمی‌داند، ایجاد کرد. و از فلک بروج تا آخر عالَم جسمی، حکم بروج هوایی، ناری، مائی و ترابی در فضایی که بین هر فلک و فلک دیگر است، ظاهر شد. و این جز با مشاهده دانسته نمی‌شود. و کسانی که به این امر علم ندارند، می‌گویند که افلاک زیر مقعر هر فلکی از آن‌ها، سطح فلک زیرین است. و نمی‌دانند که بین آن‌ها فضایی وجود دارد که حکم طبیعت در آن است، همان‌گونه که در عناصر است، با این تفاوت که احکام آن بر حسب قوابل (پذیرندگان) متفاوت است. سپس ارکان چهارگانه را بر حکم آنچه بروج در فلک اطلس بر آن هستند، ایجاد کرد. برای هر رکن دو طرف و یک واسطه برای سه وجهی که در بروج است، وجود دارد. برای اثیر، حکم حمل، اسد و قوس است. قوس و اسد برای دو طرف و حمل برای وسط است. و برای خاک، ثور، سنبله و جدی است. جدی و سنبله برای دو طرف و ثور برای وسط است. و برای هوا، جوزاء، میزان و دالی است. میزان و جوزاء برای دو طرف و دالی برای وسط است. و برای آب، سرطان، عقرب و حوت است. حوت برای وسط و عقرب و سرطان برای دو طرف است. و ما آن‌ها را به این ترتیب مرتب کردیم، زیرا هستی (الوجود) زمان و عالَمی که فلک اطلس آن را در بر دارد، با طالع میزان بود. و دورۀ حکم به آن از ابتدای مبعث رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) به پایان رسیده است و ما امروز در سلطۀ آن هستیم. و به همین دلیل، علم و عدل در این امت و کشف (الکشف) بیشتر و کامل‌تر از آنچه در امت‌های دیگر بود، می‌باشد. و هر چه امر پیش می‌رود، سلطۀ آن محکم‌تر می‌شود و کشف (الکشف) عظیم‌تر می‌گردد، تا جایی که این امر در عام و خاص ظاهر می‌شود و مرد با نوک تازیانه‌اش سخن می‌گوید و مرد با ران خود دربارۀ آنچه اهلش انجام داده‌اند، سخن می‌گوید. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «همانا زمان به هیئت روزی که خداوند آن را آفرید، چرخیده است.» هنگامی که خداوند ارکان را آفرید، از آن‌ها دودی خلق کرد و در آن هفت آسمان ساکن و غیر متحرک را شکافت و **وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا** (و در هر آسمانی امر آن را وحی کرد) به این صورت که برای آن‌ها افلاکی خلق کرد و آن‌ها را محل شناوری جواری کُنس خُنس (ستارگان پنهان‌شونده) قرار داد. و در آن‌ها آبادکنندگانی از فرشتگان خلق کرد که آن‌ها را آباد می‌کنند. و برای آن‌ها درهایی قرار داد که برای نزول و عروج فرشتگان بسته و باز می‌شوند. و ارواح هر کس از انبیا و بندگانش را که خواست، در آن‌ها ساکن کرد. و در فضایی که بین سطح آسمان هفتم و مقعر فلک کواکب است، سدرة المنتهی را خلق کرد که از نور خدا آنچه را که پوشاند، پوشاند. و بر سطح این آسمان، بیت الضراح را خلق کرد که ذکر آن و ذکر فرشتگانی که هر روز وارد آن می‌شوند، پیش از این گذشت. و از اصل این سدره چهار نهر خارج می‌شود که به سوی بهشت روان هستند. هنگامی که به بهشت می‌رسند، خداوند از آن‌ها بر دار الجلال نهرین نیل و فرات را که در زمین نزد ما هستند، خارج کرد. اما نیل از جبل القمر (کوه ماه) ظاهر شد و فرات از ارزن الروم ظاهر شد. و مزاج زمین در آن‌ها تأثیر گذاشت و طعم آن‌ها از آنچه در بهشت بود، تغییر کرد. و هنگامی که قیامت شود، به بهشت باز می‌گردند. و همچنین سیحون و جیحون باز می‌گردند. و هنگامی که خداوند این آسمان‌ها را پس از آنکه در دود به هم پیوسته بودند، شکافت. و معنای دود این است که اصل آن‌هاست و امروز آسمان‌ها هستند، همان‌گونه که آدم را **خَلَقَهُ مِنْ تُرَابٍ** (او را از خاک آفرید)؛ یعنی اصل او، در حالی که او امروز گوشت و خون و رگ و عصب است، همان‌گونه که ما را از **مَاءٍ مَهِينٍ** (آب ناچیز) آفرید. و خداوند شب و روز را با خلق خورشید و طلوع و غروب آن در زمین ایجاد کرد. اما آسمان‌ها نور هستند و در آن‌ها شب و روزی نیست. و محل خروج شب از کرۀ زمین که خورشید از آن غروب کرده است، مخروطی شکل است، مانند شکل نور چراغ که می‌بینی از سر فتیله خارج می‌شود و هوا را به شکل مخروطی روشن می‌کند تا به نهایت قدرت اشتعال خود برسد و قطع شود و هوای بالای آن سوخته باقی می‌ماند، اما با حرارت قوی مشتعل نیست. و هنگامی که این ستارگان در افلاک خود تسبیح گفتند، خداوند برای هر کوکبی روزی از ایام حرکت فلک بروج قرار داد و آن ایام را زمان نامید که حرکت فلک با آن شمرده می‌شود، همان‌گونه که حرکت فلک بروج را ایامی قرار داد که هر حرکت آن روزی است که مدت زمان موهوم که توهم می‌شود و دانسته و درک نمی‌شود، یعنی دهر، با آن شمرده می‌شود. همان دهری که از دشنام دادن به آن نهی شدیم و نهی‌کننده فرمود: «همانا خداوند همان دهر است.» پس آن را اسمی از اسماء خود قرار داد. پس او را اسماء حسنی است، جل و تعالی. پس برای هر روزی شب و روزی تعیین کرد و بین هر شب و روز آن با حکم کوکبی که برای روزی است که شب یا روز در آن ظاهر شده، تفاوت گذاشت. پس نگاه می‌شود که اولین ساعت روز از جواری (ستارگان سیار) برای کیست، او حاکم آن روز است. و در شب‌ها جستجو می‌شود، پس شبی که آن کوکبی که در اولین ساعت روز حکم کرده، در اولین ساعت آن حکم کرده باشد، آن شب، شب آن روز است و با حساب آن را می‌شناسی. و زمین را هفت طبقه شکافت و برای هر زمین قبولی برای نظر کوکبی از جواری به آن قرار داد. و ما همۀ این‌ها را در گذشته ذکر کردیم. و برای هر کوکبی قطعی در فلک بروج قرار داد. پس هنگامی که قطع آن به پایان برسد، آن یک روز واحد برای اوست که روزی است که قطع آن ایجاد کرده است. و حرکات این افلاک و ارکان را در وسط قرار داد، نه از وسط و نه به سوی وسط. و حرکت آبادکنندگان آن‌ها را به سوی وسط و از وسط قرار داد. و اشیا هنگام این حرکات در عالَم خلق و امر و در جناب اقدس حادث می‌شوند و آن‌ها آثار محسوس و معقولی هستند که دلیل شرع و عقل بر آن‌ها حکم می‌کند. و آن‌ها آثار احوالی هستند، مانند نزول حق (الحق) به آسمان دنیا، و اعمال و اقوالی، مانند اجابت حق (الحق) کسی را که او را بخواند، و خلق فرشتگان از اعمال ظاهر و باطن بنی آدم، و غرس بهشت از اعمال اهل آن از بنی آدم. و روز شرع محمد (صَلَّى اللهُ عَليهِ وسَلَّم)، اگر شب و روزش کامل شود، فهو من أيام الرب (پس آن از ایام رب است). و اگر کامل نشود و در هر ساعتی که قطع شود، آن مقدار آن است و آن از اسم «الخاذل» (خوارکننده) و «الناصر» (یاری‌دهنده) است؛ زیرا خاذل و ناصر برای روزشان مقدار معلومی نزد ما ندارند، بلکه میزان آن نزد خداست و جز او کسی آن را نمی‌داند. و حکم آن دو در هر انسانی به اندازۀ عمر آن انسان است و قدر آن دو در این امت به اندازۀ بقای آن در دار دنیاست. و این بر حسب نظر آن به پیامبرش محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است. اگر به او نظر کند، روز رب برایش کامل می‌شود و اگر اعراض کند، آنچه از مدت روز رب سپری شده، برای اوست و حکم به اسم دیگری باز می‌گردد که نزد خدا روزی موقت دارد و جز او کسی آن را نمی‌داند. و روز این امت به روز آخرت متصل است و بین آن‌ها جز شب برزخ خاصی نیست. و در فجر این شب، نفخۀ بعث خواهد بود و در طلوع خورشید روز آن، آمدن حق (الحق) برای فصل و قضا خواهد بود. و به اندازۀ دو رکعت اشراق، حکم سپری می‌شود و دو سرا با اهلشان آباد می‌گردند. و آن روز شنبه است. پس روز آن برای اهل بهشت ابدی خواهد بود و شب آن برای اهل جهنم ابدی خواهد بود. هنگامی که مدت آلام در جهنم سپری شود، که آن یک روز از **خَمْسِينَ أَلْفَ سَنَةٍ** (پنجاه هزار سال) در حق قومی و کمتر از آن در حق قومی است، و نوزده فرشته برای رحمت پیشی گرفته، اهل جهنم را شفاعت کنند، آلام برطرف می‌شود. پس آسایش آنان، برطرف شدن آلام است، نه وجود نعمت. پس بفهم! و این مقدار، نعمت اهل جهنم است، اگر بدانی. و در این منزل از علوم، علم رحمت سیادت است و اینکه کجا به آن ندا داده می‌شود و به چه چیزی مستحق آن می‌شود و حکمت اینکه ندای ترخیم (کوتاه کردن) است، چیست. و ترخیم به معنای تسهیل (آسان‌سازی) است. و به همین دلیل، زیبارویان با آن توصیف می‌شوند و دربارۀ زن زیبا گفته می‌شود: «رخیمة الدلال» (ناز و کرشمۀ آسان)، یعنی آسان‌گیر. و در آن، علم تمام حکم است، نه تمام هر چیز؛ زیرا حکم عین ندارد مگر در ترتیب خاص، معناً و حساً. و در آن، علم رسالت بر اختلاف انواع آن به دلیل اختلاف رسولان است؛ زیرا انبیا رسول هستند، فرشتگان رسول هستند و بشر رسول هستند. و رسالت با اختلاف احوال متفاوت است. و همۀ این‌ها شرایعی هستند که به سوی خدا و سعادت دائمی می‌رسانند و در آن‌ها هیچ کجی نیست و نباید باشد، زیرا از عرش رحمت نازل شده‌اند در حالی که لباس عزت پوشیده‌اند. پس هیچ چیز در آن‌ها تأثیر نمی‌گذارد که امت‌هایشان را از حکم آن خارج سازد. هیچ امتی نیست مگر اینکه رحمت به آن می‌رسد، همان‌گونه که شریعتی که با آن مخاطب شده، به آن رسیده است. و در آن، علم حکمت وضع شرایع در عالَم است و اینکه چرا در دار دنیا وضع شده و چرا در آخرت وضع نشده است. و توقیت (تعیین وقت) آنچه از آن در دار آخرت وضع شده است، ابتدا مانند منع آدم از نزدیک شدن به درخت، و انتها مانند دعوت حق (الحق) بندگانش به سجده در روز قیامت. و با این حکم شرعی در روز قیامت، میزان اهل اعراف سنگین می‌شود و میزانشان با این سجده سنگین می‌گردد. پس به سوی بهشت می‌روند، بعد از آنکه منزلشان در سور اعراف بود و نه چیزی داشتند که آن‌ها را وارد آتش کند و نه چیزی که آن‌ها را وارد بهشت کند. و در آن، قوت مؤمن است که با قوت بسیاری از کفار برابری می‌کند. و به همین دلیل برای آنان تشریع شد که در جنگ با دشمن خود فرار نکنند. و برای برخی از آنان قوت یک نفر برای ده نفر تشریع شد. سپس با باقی ماندن قوت بر آنان، تخفیف داده شد و برای هر قوت مؤمن، قوت دو مرد از کفار تشریع شد. و به همین دلیل:\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «همانا او (پیامبر) تب می‌کند، همان‌گونه که دو مرد از امتش تب می‌کنند.»\n\nپس نیروی دو مرد از امت خود را به او عطا کرد. و در آن [کتاب] دانش رحمت وجود غفلت و نسیان در عالم، بلکه در این امت، به دلیل آنچه در آن تصریح شده، و همچنین خطا [وجود دارد].\n\nو در آن دانش تفاوت میان قول و قول الله، و قولی که به خلق نسبت داده می‌شود، و کلمه [وجود دارد]. و اینکه آیا برای هر قول و کلمه‌ای حقی واجب در اجرا هست یا این فقط مخصوص قول خاصی است؟ و اگر مخصوص قول خاصی است نه کلمه، پس سبب این تخصیص چیست، در حالی که همه از حیث قول، قول هستند و از حیث کلمه، کلمه.\n\nو اگر در نفس‌الامر (در واقع) حکم از آنِ قول است و آن [قول] سابق است، پس چرا با وجود علم به اینکه [انسان] در اختیار خود مجبور است، سؤال و اقرار صورت می‌گیرد؟ و این مسئله‌ای است که تصورش دشوار و فرارش بسیار است، و اگر وجود آلام (دردها) نبود، آسان می‌شد و به ذهن خطور نمی‌کرد.\n\nو در آن دانش مقید ساختن معانی و وجود آثار احکام آن‌ها در کسی که آن [معانی] در او قائم شده، و اینکه حد این تقیید در نشأت (آفرینش) انسان به کجا ختم می‌شود [وجود دارد].\n\nو در آن دانش سببی که به خاطر آن چهره‌ها و دیدگان در روز قیامت و در دنیا به بالا بلند می‌شوند [وجود دارد]. آیا حکم و سبب آن‌ها یکی است یا متفاوت؟ و آیا این بالا بردن ناشی از جذبی از پشت است یا از روی اختیار؟\n\nو در آن دانش قرار گرفتن انسان میان قضا و قدر (قضاء الله وقدره) الهی [وجود دارد]، به طوری که نمی‌تواند از آن دو فراتر رود. و آیا قضا و قدر (القضاء والقدر) همه جهات انسان را فرا گرفته است یا تنها دو جهت از او را در بر می‌گیرد: جهت حادی (سوق‌دهنده) و هادی (هدایت‌کننده) که همان راننده و شاهد هستند؟ و چه چیزی امروز مردم را از شهود (الشهود) این دو کور کرده است، در حالی که در آخرت آن‌ها را می‌بینند؟ و چرا این دو [قضا و قدر] به جای سایر جهات، به پشت و جلو اختصاص یافته‌اند؟ و شیطان برای خود راه‌های چهار جهت را دارد. آیا جایگاه پشت و جلو برای آن‌ها [قضا و قدر] این است که بر راست و چپ، به حکم دو دستی که دارند، مشرف باشند؟ و اگر راست و چپ از آنِ آن‌ها بود، دست واحد هر یک از آن‌ها در حق کسی که به او ملتزم شده‌اند، معطل می‌ماند. پس ناگزیر باید پشت و جلو از آنِ آن‌ها باشد.\n\nو در آن دانش نسبت عدم و وجود به ممکن (موجود ممکن) [وجود دارد]، در حالی که ممکن جز با مرجّح (ترجیح‌دهنده) معقول نیست. و نزد مرجّح جز یک وجه از این دو نسبت [عدم یا وجود] نیست، پس امکان مرتفع می‌شود. پس صحیح در این باره چیست؟ آیا بقای امکان است یا ارتفاع آن؟\n\nو در آن دانش قابلیت‌ها (القوابل) [وجود دارد]. آیا آن‌ها قابلیت پذیرش هر چیزی را دارند یا مخصوص اشیاء خاصی هستند؟ یا در پذیرش متمایز می‌شوند، به طوری که بر صفتی باشند که برای برخی قابلیت‌ها آنچه را می‌پذیرند واجب سازد، در مقابل آنچه نمی‌پذیرند؟ و آیا اموری که قابلیت‌ها می‌پذیرند، یک راه واحد دارند یا راه‌ها متفاوت است؟\n\nو در آن دانش وصف پاداش (أجر) به عظمت و کرم [وجود دارد]، اینکه چرا این وصف باز می‌گردد، و این دانشی شریف است.\n\nو در آن دانش مرگ [وجود دارد]، و معنای زنده کردن مردگان چیست؟ و چه کسی آن‌ها را می‌میراند؟ آیا خداوند بدون سبب [می‌میراند] یا ملک (فرشته)؟ و آن ملک چیست؟ آیا او برخی از اخلاط (مزاج‌ها) است که جسد حیوانی به واسطه آن‌ها قائم شده است؟ زیرا اخلاط از فرشتگان خدا هستند. یا او فرشته‌ای از فرشتگان آسمان‌ها است؟ و اگر به آسمان‌ها نسبت داده شود، آیا به یکی از آن‌ها نسبت داده می‌شود، به حکم اینکه از حرکت چیزی است که خداوند در آن قوای این خلط غالب را که ملک‌الموت نامیده می‌شود، وحی کرده است؟ یا او فرشته‌ای غریب از ساکنان آسمان هفتم است؟\n\nو همچنین محیی (زنده‌کننده) مانند ممیت (میراننده) است، جز اینکه آسمان متفاوت است؛ زیرا آسمان ششم معدن حیات است و از هر آسمانی تقویت می‌شود، همان‌طور که مرگ نیز چنین است. و سخن در مورد محیی مانند سخن در مورد ممیت است. یا اینکه ممیت (میراننده) خود حق (الحق) است، از آن جهت که اسمی الهی از اسماء اوست، و همچنین محیی (زنده‌کننده). پس او ممیت و محیی است. و ما نمی‌توانیم اسبابی را که حق (الحق) قرار داده است، برداریم تا حکمت حق (الحق) باطل شود. پس اسباب را در اعتقاد برمی‌داریم و در وجود در جایگاه‌های خودشان تثبیت می‌کنیم.\n\nو اسرافیل در صور می‌دمد و عزرائیل ارواح را قبض می‌کند. و این به دلیل استعدادی است که در این صورت‌ها برای پذیرش اشتعال وجود دارد تا زنده شوند، و برای پذیرش خاموشی تا بمیرند. و این فرشته‌ای که موکل بر ماست، نه بر مرگ، همان کسی است که فرشته‌ای را تقویت می‌کند که به واسطه او و یارانش نشأت (آفرینش) جسد حیوانی قائم شده است. پس به دلیل قدرت سلطه‌اش بر بقیه یارانش، می‌میراند. و به همین دلیل است که پزشکان می‌دانند که انسان با علائم می‌میرد. پس اگر فرشته غیر از آنچه ذکر کردیم بود، علم پزشکان به آن نمی‌رسید، زیرا آن [علم] از ویژگی‌های علم انبیاء و کسانی است که خداوند از بندگانش به آن‌ها تعلیم داده است.\n\nو آیا مقتول همان حکمی را در مرگ دارد که بیمار دارد، یا حکم دیگری دارد؟ و آیا فرشته‌ای که موکل بر ماست، نه بر مرگ، حکم مرگ را دارد یا حکم قبض ارواح و عروج با آن‌ها را؟ و آیا او یک فرشته است یا فرشتگان؟ زیرا خداوند وفات نفوس را به خود، به ملک‌الموت و به رسولانش نسبت داده است. پس ناگزیر باید این انتساب‌ها و مراد از آن‌ها دانسته شود. و آیا مراتب آن‌ها متفاوت است یا بر یک مرتبه هستند؟\n\nو در آن دانش آنچه جسم پس از مرگ و روح به آن باز می‌گردد [وجود دارد]، و آنچه در نفخه بعث از آن دو برانگیخته می‌شود. و آیا نشأت (آفرینش) با عرض تغییر می‌کند یا با صورت؟\n\nو در آن دانش آثار اکوان (موجودات) [وجود دارد]، و آن حضرت (مقام) که در آن تا زمان حشر نگهداری می‌شوند و صاحبانشان بر آن آگاه می‌گردند، چیست؟ و آن آثار مکلفین است، یعنی آنچه از افعال در زمان تکلیف از آن‌ها صادر شده است، نه در غیر زمان تکلیف، مانند شخص خوابیده، یا کسی که عقلش مغلوب شده، یا شخصی که به بلوغ نرسیده است. به همین دلیل گفتیم «زمان تکلیف» و نگفتیم «دار تکلیف».\n\nو در آن دانش پی در پی آمدن رسولان در یک امت واحد [وجود دارد]، برخلاف این امت محمدیه، که رسولان بر آن اختلاف نکرده‌اند، بلکه اگر کسی در آن ظاهر شود که رسول باشد، به آن ملحق شده و به شریعت آن عمل می‌کند و احکام شریعت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) بر او جاری می‌شود.\n\nو در آن دانش نصایح [وجود دارد]، و اینکه این نشأت (آفرینش) انسانی بر بخل سرشته شده است، و کرم برای آن به حکم عرض است، نه ذاتی. و اگر چنین است، پس چگونه پاداش کریمانه برای آن صحیح است، در حالی که میان آن و کرم نسبت ذاتی وجود ندارد؟ و کرم برای پاداش ذاتی است و عظمت نیز برای آن ذاتی است. و برای پاداش عظیم قومی مخصوص و برای پاداش کریم قومی مخصوص وجود دارد.\n\nو در آن دانش اختلاف اسباب برانگیزاننده بر عبادت در ثقلین (جن و انس) و غیر آن‌ها [وجود دارد]. و در آن دانش تسلیم و تفویض به خداوند [وجود دارد]. و در آن دانش آرزو (تمنی)، فایده آن و صفت کسی که به آن قیام می‌کند [وجود دارد].\n\nو در آن دانش معرفت اینکه عالم از حیث ملک، ملک خداوند متعال است [وجود دارد]، و چه کسی با او منازعه می‌کند، تا جایی که خود را چنین وصف کرده است: **لِلَّهِ جُنُودُ السَّماواتِ والْأَرْضِ** (لشکر آسمان‌ها و زمین از آنِ خداست).\n\nو در آن دانش آنچه به خداوند نسبت داده می‌شود و به وحدت (یگانگی) وصف شده است [وجود دارد]، و سبب تکثر (کثرت یافتن) این وحدت چیست و اثر آن در عالم کدام است. و در آن دانش کشف (الکشف) آنچه غیب بوده [وجود دارد].\n\nو در آن دانش عدم پذیرش با وجود ظهور دلیل و علم به اینکه آن دلیل است [وجود دارد]. و سبب جهل کسی که جاهل است به اینکه آن دلیل است، چیست؟ و آیا برای هر معلومی دلیلی هست یا فقط برای برخی معلومات؟ و در آن دانش عدم بازگشت به آنچه از آن خارج شده [وجود دارد].\n\nو در آن دانش حضرت (مقام) که عالم دنیوی از مکلف و غیر مکلف در آن جمع می‌شوند [وجود دارد]. و آیا غیر مکلف از حیوان و نبات و سنگ برانگیخته می‌شود تا مطالبه و حجت خداوند بر مکلفین به واسطه آن‌ها اقامه شود، یا برای خودشان برانگیخته می‌شوند به دلیل خیری که در آن برایشان معلوم است نزد خداوند؟ سپس امر آن‌ها پس از بعث به کجا می‌انجامد؟\n\nو در آن دانش منافعی که خداوند برای ما در عالم آسمان و زمین ذخیره کرده است [وجود دارد]. و در آن دانش شکر واجب از شکری که انسان به تبرع (اختیار) انجام می‌دهد [وجود دارد]، و کدام یک از نظر پاداش کامل‌تر است.\n\nو در آن دانش سبب و حکمتی که خداوند به خاطر آن از هر چیزی جفت‌هایی آفرید [وجود دارد]. و آیا آفرینش آدم بر صورت او نیز از همین حکمت است؟ و در آن دانش زمانی که روز به واسطه آن جدا می‌شود [وجود دارد]. و در آن دانش سکون کسی که سکون ندارد [وجود دارد].\n\nو در آن دانش منزلگاه‌های مسافران [وجود دارد]. و آیا آن‌ها به عدد قابل شمارش هستند یا خیر؟ و در آن دانش اختلاف صفات بر مسافران به دلیل اختلاف راه‌ها و منزلگاه‌هایشان [وجود دارد].\n\nو در آن دانش سابق (پیشی‌گیرنده) از مسافران که به او می‌رسند و سابقی که به او نمی‌رسند [وجود دارد]، مانند شخص با سایه‌اش که هرگز به سایه‌اش نمی‌رسد و سایه‌اش به او می‌رسد، و غیر از این‌ها از مسافران. و این دانشی شریف است که شامل تمامی سفرهای الهی، کونی، علوی و سفلی می‌شود. و این دانشی است که دسترسی به آن دشوار و درکش دور از دسترس است و هر کسی به آن پی نمی‌برد. اما احاطه به آن جز با آگاه ساختن خداوند دانسته نمی‌شود، و آگاه ساختن به آن به تفصیل صحیح نیست، زیرا آن‌ها سفرهایی بی‌نهایت هستند.\n\nو در آن دانش راه‌هایی که هر مسافری در آن سلوک می‌کند [وجود دارد]. و در آن دانش اسبابی که میان برخی مسافران و آنچه در سفر قصد کرده‌اند حائل می‌شود [وجود دارد]. و تفاوت میان سفر اختیاری و جبری.\n\nو در آن دانش زمان عمومی دنیا که پس از انقضای آن قیامت کبری رخ می‌دهد [وجود دارد]. و در آن دانش زمان عمر حیوان و مولدات (موجودات متولد شده) و قیامت صغرای آن‌ها با پایان یافتن مدتشان [وجود دارد]. و تفاوت میان این دو حشر.\n\nزیرا رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «هر کس بمیرد، قیامت او برپا شده است.»\n\nپس حشر آن‌ها به سوی برزخ، قیامت است. و در آن دانش صفاتی که رحمت از آن‌ها امید می‌رود [وجود دارد]، صفاتی که رحمت را با زبان خود می‌طلبند.\n\nو در آن دانش سبب موجبی که به خاطر آن کسی که اعراض کرده، از نظر کردن در دلالات عقلی که رسولان آورده‌اند و آن‌هایی که از آیات معتاد (عادی) نیاورده‌اند، روی گردانده است [وجود دارد]. و آیا دلالت آن‌ها متفاوت است و صورت دلالت آن‌ها چیست؟ و آیا مدلول آن‌ها با اختلاف قصد دال (دلالت‌کننده) یا قصد کسی که دال را برای نظر در دلیل به حرکت در می‌آورد، متفاوت است؟ مانند رسولی که دلالتی بر صدق خود در رسول بودن می‌آورد، و همان دلالت، خود دلالتی بر وجود حق (الحق) و عجز خلق است.\n\nو در آن دانش تأسی (اقتدا) به خداوند در آنچه خداوند آن را مذمت کرده [وجود دارد]. آیا صاحب آن [فعل] از جهت لسان حقیقت مذمت می‌شود یا فقط به لسان شرع مذمت می‌شود؟\n\nو در آن دانش آنچه انسان بر آن قبض (گرفته) می‌شود [وجود دارد]. آیا در برزخ بر همان باقی می‌ماند و بر آن محشور می‌شود، یا حالش تغییر می‌کند؟ یا بر آنچه هنگام کشف غطاء (الکشف) قبل از قبض برایش آشکار می‌شود، قبض می‌شود؟ یا آیا عین قبض، عین کشف غطاء است؟\n\nو در آن دانش رد سائل [وجود دارد]. آیا بازگرداندن او از سؤالش، خود جوابی برای سؤال اوست یا خیر؟ و در آن دانش سبب موجبی که برای کسی که حق (الحق) او را ندا داده، موجب شتاب می‌شود [وجود دارد]. آیا این شتاب، شتاب جبر است یا شتاب توقع جبر؟\n\nو در آن دانش سبب اختلاف کلام برانگیخته‌شدگان از اهل قبور [وجود دارد]. و در آن دانش اینکه چه کسی در این باره به آن‌ها پاسخ می‌دهد [وجود دارد]. آیا حق (الحق) به آن‌ها پاسخ می‌دهد یا فرشتگان یا عالمان؟ و در آن دانش...\n\nآنچه برای کسانی که از قبورشان برانگیخته می‌شوند، تجلی (التجلی) می‌کند، آیا یک صورت واحد است یا صورت‌های مختلف؟ و آیا آن متجلی، اسم الهی است یا خیر؟\n\nو در آن دانش سببی که موجب شده است ترتیب برج‌ها با طبیعت ترتیب عناصر مخالفت کند [وجود دارد]. زیرا ترتیب برج‌ها به گونه‌ای است که هر برجی از جهتی میان منافر (ناسازگار) و مناسب است، و هر یک را که در نظر بگیری، آن را همان‌گونه که ذکر کردیم می‌یابی. اما ارکان (عناصر اصلی)، ترتیب آن‌ها بر اساس مناسبتی است که در آن از هیچ جهتی تنافری نیست. پس سه [عنصر] ناری (آتشین) همگی از مائی (آبی) و ترابی (خاکی) هستند، و ترابی همگی از ناری و هوایی (بادی) هستند، و هوایی همگی میان ترابی و مائی هستند، و مائی همگی میان هوایی و ناری هستند. در حالی که ارکان این‌گونه نیستند.\n\nو در آن دانش تفاوت میان «عندی» (نزد من)، «لدی» (نزد)، «عندنا» (نزد ما)، «لدنا» (نزد ما)، «لدینا» (نزد ما) و «لدنی» (نزد من) [وجود دارد].\n\nو در آن دانش جداسازی میان اشیاء تا برخی از برخی دیگر متمایز شوند [وجود دارد]. و در آن دانش آنچه بیننده می‌بیند که غیر از صورت و صفت اوست، هر که می‌خواهد باشد [وجود دارد].\n\nو در آن دانش اشتغال [وجود دارد]. و چرا شغل نامیده شده است؟ و از چه کسی مشغول می‌شود؟ و آیا شغلی هست که به کلی از غیر خود بی‌نیاز کند یا خیر؟ و در آن دانش انس گرفتن به مثل او، جز به مثلیتی که **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (هیچ چیز مانند او نیست) [وجود دارد].\n\nو در آن دانش الهیات و حالاتی که نفوس در سرای دنیا کسب می‌کنند [وجود دارد]. و در آن دانش اعراس (جشن‌های عروسی) الهی [وجود دارد]. و در آن دانش آنچه برای هر اسم الهی از رحمت وجود دارد، از اسم‌هایی که ظاهرشان زوال رحمت را نشان می‌دهد [وجود دارد].\n\nو در آن دانش استحقاقی که عالم از حیث صفتی که بر آن است، مستحق آن می‌شود [وجود دارد]. پس آن استحقاق صفت است نه استحقاق موصوف. و در آن دانش عهد الهی و کونی [وجود دارد]، اینکه در چه چیزی واقع شده است.\n\nو در آن دانش حکم متقدم (پیشین) [وجود دارد]، اینکه چگونه در متأخر (پسین) ظاهر شد و از کجا ظاهر شد. و در آن دانش بُعد کونی از بُعد الهی [وجود دارد]. و در آن دانش نطق و صمت (سکوت)، و تعیین ناطق و صامت و زمان و مکان آن [وجود دارد].\n\nو در آن دانش تبدیل شدن صورت‌های عالی به صورت‌های دانی [وجود دارد]. و در آن دانش سبب سستی در برخاستن با وجود کشف (الکشف) [وجود دارد].\n\nو در آن دانش آنچه زمان در نشأت (آفرینش) انسان و در سایر معادن، نبات و حیوان عطا می‌کند [وجود دارد]. و در آن دانش ابهام و ایضاح (روشن‌سازی) [وجود دارد]. و در آن دانش اجتماع کثیر بر ایجاد واحد [وجود دارد].\n\nو در آن دانش تملیک آنچه منشئ (ایجادکننده) ایجاد می‌کند، به دلیل اینکه آن را ایجاد کرده است [وجود دارد]. و در آن دانش ریاضت الهی و تفاوت میان آن و ریاضت کونی [وجود دارد]. و در آن دانش حضرت (مقام) منعم (نعمت‌دهنده) و آنچه در دنیا و آخرت در حکم دارد [وجود دارد].\n\nو در آن دانش سبب اعتماد بر کسی که می‌داند از کسانی نیست که بر او اعتماد می‌شود [وجود دارد]. و در آن دانش مبدأ و معاد [وجود دارد]. و در آن دانش تشبیه و عکس تشبیه، و اصلی که تشبیه به واسطه آن واقع می‌شود، چیست [وجود دارد].\n\nو در آن دانش تأثیر اجتماع اضداد از علم الهی [وجود دارد]، و وجود آتش در آب و آب در آتش. و در آن دانش صفتی که عالم را در عین خود ظاهر ساخت [وجود دارد]. و در آن دانش ملکوت [وجود دارد]، و سهم آن از مُلک و جبروت کجاست. و خداوند **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 10
}