{
  "id": 57,
  "title": {
    "ar": "الباب السابع والخمسون في معرفة تحصيل علم الإلهام بنوع ما من أنواع الاستدلال ومعرفة النفس",
    "en": "Chapter Fifty-Seven: Concerning the understanding of how to acquire the knowledge of Inspiration (علم الإلهام) by means of a certain type of inferential reasoning (الاستدلال), and the knowledge of the Soul (النفس).",
    "ur": "ستاونواں باب: علم الہام (الإلهام) کے حصول کی معرفت، استدلال (الاستدلال) کی اقسام میں سے کسی ایک نوع کے ذریعے، اور نفس (النفس) کی معرفت کے بیان میں۔",
    "fa": "باب پنجاه و هفتم در معرفت به دست آوردن علم الهام به نوعی از انواع استدلال و معرفت نفس."
  },
  "content": {
    "ar": "## (الباب السابع والخمسون في معرفة تحصيل علم الإلهام بنوع ما من أنواع الاستدلال ومعرفة النفس)\n\n\n> لا تحكمن بإلهام تجده فقد *** يكون في غير ما يرضاه واهبه‏\n> واجعل شريعتك المثلى مصححة *** فإنها تمر يجنيه كاسبه‏\n\n\n> له الإساءة والحسنى معا فكما *** تعلى طرائقه تردى مذاهبه‏\n\n\n> فاحذره إن له في كل طائفة *** حكما إذا جهلت فينا مكاسبه‏\n\n\n> لا تطلبن من الإلهام صورته *** فإن وسواس إبليس يصاحبه‏\n\n\n> في شكله وعلى ترتيب صورته *** وإن تميز فالمعنى يقاربه‏\n\n\n### [النفس محل قابل لما تلهمه من الفجور والتقوى‏]\n\n\nقال الله تعالى ونَفْسٍ وما سَوَّاها فَأَلْهَمَها فُجُورَها وتَقْواها من قوله أيضا كُلًّا نُمِدُّ هؤُلاءِ وهَؤُلاءِ من عَطاءِ رَبِّكَ وما كانَ عَطاءُ رَبِّكَ مَحْظُوراً فجعل النفس محلا قابلا لما تلهمه من الفجور والتقوى فتميز الفجور فتجتنبه والتقوى فتسلك طريقه ومن وجه آخر تطلبه الآية وهو أنه بما ألهمها عراها أن يكون لها في الفجور والتقوى كسب أو تعمل وإنما هي محل لظهور الفعل فجورا كان أو تقوى شرعا فهي برزخ وسط بين هذين الحكمين‏\n\n\n### [خاطر المباح نعت ذاتي للنفس كالضحك للإنسان‏]\n\n\nولم ينسب سبحانه إلى نفسه خاطر المباح ولا الهامة فيها به وسبب ذلك أن المباح ذاتي لها فبنفس ما خلق عينها ظهر عين المباح فهو من صفاتها النفسية التي لا تعقل النفس إلا به فهو على الحقيقة أعني خاطر المباح نعت خاص كالضحك للإنسان وإن لم يكن من الفصول المقومة فهو حد لازم رسمي فإن من خاصية النفس دفع المضار واستجلاب المنافع وهذا لا يوجد في أقسام أحكام الشرع إلا في قسم المباح خاصة فإنه الذي يستوي فعله وتركه فلا أجر فيه ولا وزر شرعا وهو قوله وما سواها من التسوية وهو الاعتدال في الشي‏ء فسواك فعدلك يمتن بذلك على الإنسان وما في أقسام أحكام الشريعة قسم يقتضي العدل ويعطي الاعتدال إلا قسم المباح فهي تطلبه بذاتها وخاصيتها فلذلك لم يصفها بأنها ملهمة فيه‏\n\n\n### [من هو ملهم النفس فجورها وتقواها]\n\n\nوما ذكر سبحانه من الملهم لها بالفجور والتقوى فأضمر الفاعل فالظاهر أن الضمير المضمر يعود على المضمر في سواها وهو الله تعالى ومن نظر في‏\n\n\nقول رسول الله صلى الله عليه وسلم إن للملك في الإنسان لمة وللشيطان لمة\n\n\nيعني بالطاعة وهي التقوى والمعصية وهي الفجور فيكون الضمير في فَأَلْهَمَها للملك في التقوى وللشيطان في الفجور ولم يجمعهما في ضمير واحد لبعد المناسبة بينهما وكل بقضاء الله وقدره ولا يصح أن يقال في هذا الموضع إن الله هو الملهم بالتقوى وإن الشيطان هو الملهم بالفجور لما في هذا من الجهل وسوء الأدب لما في ذلك من غلبة أحد الخاطرين والفجور أغلب من التقوى وأيضا لقوله تعالى ما أَصابَكَ من حَسَنَةٍ فَمِنَ الله وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ فإنه في تلك الآية ظاهر الاسم والسيئة فيها ما هي شرعا فتكون فجورا وإنما هي مما يسوءه ولا يوافق غرضه وهو في الظاهر قولهم فإنهم كانوا يتطيرون به صلى الله عليه وسلم أعني الكافرين فأمره سبحانه أن يقول كُلٌّ من عِنْدِ الله فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً أي ما يحدث فيهم من الكوائن يقول الله عنهم إنهم يقولون إِنْ تُصِبْهُمْ حَسَنَةٌ يَقُولُوا هذِهِ من عِنْدِ الله وإِنْ تُصِبْهُمْ سَيِّئَةٌ أي ما يسوءهم ف من عِنْدِكَ قُلْ كُلٌّ من عِنْدِ الله وهو قوله طائِرُكُمْ عِنْدَ الله فالفاعل في فَأَلْهَمَها مضمر فإن كان الله هنا في الضمير هو الملهم بالتقوى والشيطان هو الملهم بالفجور فقد جمع الله والشيطان ضمير واحد وهذا غاية في سوء الأدب مع الله وما أحسن ما جاء بالواو العاطفة في قوله وتَقْواها فتعالى الله الملك القدوس أن يجتمع مع المطرود من رحمة الله في ضمير مع احتمال الأمر في ذلك وقد قال رسول الله صلى الله عليه وسلم بئس الخطيب أنت لما سمعه قد جمع بين الله تعالى ورسوله صلى الله عليه وسلم في ضمير واحد فقال ومن يعصهما\n\n\nوما قال ذلك رسول الله صلى الله عليه وسلم إذ جمع بين الله وبين نفسه في ضمير واحد إلا بوحي من الله وهو قوله من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله وقال وما يَنْطِقُ عَنِ الْهَوى‏ ونحن يلزمنا ملازمة الأدب فيما لم نؤمر به ولا نهينا عنه كما فعل رسول الله صلى الله عليه وسلم في قوله بئس الخطيب أنت وكذلك لا يترجح أن تنسب الإلهام بالفجور إلى الله فلم يبق بعد هذا الاستقصاء أن يكون الضمير في فَأَلْهَمَها بالفجور إلا الشيطان وبالواو بالتقوى إلا الملك فمقابلة مخلوق بمخلوق أولى من مقابلة مخلوق بخالق وفي قول رسول الله صلى الله عليه وسلم بئس الخطيب كفاية لمن أنار الله بصيرته‏\n\n\n### [النفس ليست بأمارة بالسوء من حيث ذاتها ولكن من حيث قابليتها]\n\n\nفقد أعلمك برتبة نفسك وإنها ليست بأمارة بالسوء من حيث ذاتها وإنما ينسب إليها ذلك من حيث إنها قابلة لإلهام الشيطان بالفجور ولجهلها بالحكم المشروع في ذلك كنفس أمرت صاحبها بارتكاب أمر لم تعلم تحريمه‏\nفي الشرع أو قامت عندها شبهة بإباحة ذلك فيراه من مذهبه التحريم فيقول إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ كشرب النبيذ بين محلله ومحرمه ونكاح الربيبة التي لم يجتمع فيها الشرطان ومثل هذا في الشريعة كثير وكلا المذهبين شرع مقرر صحيح إذا كانا عن اجتهاد مع أن أحدهما أخطأ دليل الشارع الذي حكم به في تلك المسألة أو لو حكم فيها والمجتهدان مأجوران وقد يكون في المسألة أحد المجتهدين مصيبا وقد يكون كل واحد منهما مخطئا فإن الحكم في تلك المسألة شرعا ليس بمنحصر ثم إن قول الله تعالى إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ فما هو حكم الله عليها بذلك وإنما الله حكى ما قالته امرأة العزيز في مجلس العزيز وهل أصابت في هذه الإضافة أ ولم تصب هذا حكم آخر مسكوت عنه بل الذي هو لها أنها لوامة نفسها إذا قبلت من الشيطان ما يأمرها به فهذا الإخبار عن النفس أنها أمارة بالسوء ما هو حكم الله عليها ولا من قول يوسف عليه السلام فبطل التمسك بهذه الآية لما دل عليه الظاهر والدليل إذا دخله الاحتمال سقط الاحتجاج به وأما قوله تعالى في هذا المقام كُلًّا نُمِدُّ هؤُلاءِ وهَؤُلاءِ من عَطاءِ رَبِّكَ فهو إبانة عن حقيقة صحيحة بما هو الأمر عليه في نفسه من أنه لا حول ولا قوة إلا بالله وقوله وما كانَ عَطاءُ رَبِّكَ مَحْظُوراً أي ممنوعا يقول إن الله يعطي على الدوام والمحال تقبل على قدر حقائق استعداداتها كما تقول إن الشمس تنبسط أنوارها على الموجودات وما تبخل بنورها على أحد وتقبل المحال ذلك النور على قدر استعدادها وكل محل يضيف الأثر إلى الشمس ويغفل عن استعداده فالشخص المبرود يلتذ بحرارتها والجسم المحرور يتألم بحرارتها والنور من حيث ذاته واحد وكل واحد من الشخصين يتألم بما به يتنعم صاحبه فلو كان ذلك للنور وحده لأعطى حقيقة واحدة وكذلك أعطى ما في قوته غير أنه للقابل حكم في ذلك ولا بد فإن النتيجة لا تكون إلا عن مقدمتين فيسود وجه القصار الذي يبيض الثوب فإن استعداد الثوب تعطي الشمس فيه التبيض ووجه القصار تعطي الشمس فيه السواد وكذلك النفخة الواحدة من النافخ وهي الهواء تطفئ السراج وتشعل النار الذي في الحشيش والهواء في نفسه واحد فترد الآية من كتاب الله واحدة العين على الأسماع فسامع يفهم منها أمرا واحد أو سامع آخر لا يفهم منها ذلك الأمر ويفهم منها أمرا آخر وآخر يفهم منها أمورا كثيرة ولهذا يستشهد كل واحد من الناظرين فيها بها لاختلاف استعداد الأفهام وهكذا في التجليات الإلهية فالمتجلي من حيث هو في نفسه واحد العين واختلفت التجليات أعني صورها بحسب استعدادات المتجلي لهم وكذلك في العطايا الإلهية سواء فإذا فهمت هذا علمت إن عطاء الله ليس بممنوع إلا أنك تحب أن يعطيك ما لا يقبله استعدادك وتنسب المنع إليه فيما طلبته منه ولم تجعل بالك إلى الاستعداد فقد يستعد الشخص للسؤال وما عنده استعداد لقبول ما سأل فيه فلو أعطيه بدلا من المنع ويقول إِنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ ويصدق في ذلك ولكنك تغفل عن ترتيب الحكمة الإلهية في العالم وما تعطيه حقائق الأشياء والكل من عند الله فمنعه عطاء وعطاؤه منع ولكن بقي لك أن تعلم لكذا ومن كذا\n\n\n### [الفرق بين الإلهام وعلم الإلهام والعلم اللدني‏]\n\n\nفقد عرفتك بالنفس وأنها المحركة للجوارح بما يغلب عليها أما من ذاتها أو مما تقبله من الملك أو الشيطان فيما يلهمها به فعلم الإلهام هو أن تعلم أن الله ألهمك بما أوقره في نفسك ولكن بقي عليك إن تنظر على يدي من ألهمك وعلى أي طريق جاءك ذلك الإلهام من ملك أو شيطان وما يخرج من قبيل الأمر والنهي المشروع فهو العلم اللدني ما هو الإلهام فالعلم بالطاعة الهامي والعلم نتائج الطاعة لدني ففرق ما بين العلم اللدني والإلهام فالإلهام عارض طارئ يزول ويجي‏ء غيره والعلم اللدني ثابت لا يبرح فمنه ما يكون في أصل الخلقة والجبلة كعلم الحيوانات والأطفال الصغار ببعض منافعهم ومضارهم فهو علم ضروري لا إلهام وأما قوله وأَوْحى‏ رَبُّكَ إِلَى النَّحْلِ فإنه يريد في أصل نشأتها فطرها الله على ذلك والإلهام هو ما يلهمه العبد من الأمور التي لم يكن يعرفها قبل ذلك والعلم اللدني الذي لا يكون في أصل الخلقة فهو العلم الذي تنتجه الأعمال فيرحم الله بعض عباده بأن يوفقه لعمل صالح فيعمل به فيورثه الله من ذلك علما من لدنه لم يكن يعلمه قبل ذلك ولا يلزم من العلم اللدني أن يكون في مادة والإلهام لا يكون إلا في مواد والعلم يصيب ولا بد والإلهام قد يصيب وقد يخطئ فالمصيب منه يسمى علم الإلهام وما يخطئ منه يسمى إلهاما لا علما أي لا علم إلهام والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏",
    "en": "Chapter Fifty-Seven: Concerning the Knowledge of Attaining the Science of Inspiration (علم الإلهام) through a certain type of inferential reasoning (الاستدلال) and the knowledge of the Soul (النفس).\n\nDo not judge by an inspiration you find, for it may be in something other than what its Giver approves.\nAnd make your exemplary Law (الشريعة) the corrector, for it is the fruit that its earner harvests.\nFor him (the recipient), there is both evil and good together, so just as his paths are elevated, his doctrines may be cast down.\nSo beware of it, for it has a ruling in every group, if its acquisitions (مكاسبه) are unknown among us.\nDo not seek the form (صورة) of inspiration, for the whispering (وسواس) of Iblis accompanies it.\nIn its shape and upon the arrangement of its form, and even if it is distinguished, the meaning approximates it.\n\n### The Soul (النفس) is a receptive locus for what is inspired into it, whether wickedness (الفجور) or piety (التقوى)\n\nAllah the Exalted said: <<وَنَفْسٍ وَمَا سَوَّاهَا * فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا>> (And [by] the soul and He who proportioned it * And inspired it [with discernment of] its wickedness and its righteousness). And also from His saying: <<كُلًّا نُمِدُّ هَؤُلَاءِ وَهَؤُلَاءِ مِنْ عَطَاءِ رَبِّكَ وَمَا كَانَ عَطَاءُ رَبِّكَ مَحْظُورًا>> (To all—these as well as those—We extend from the gift of your Lord. And never has the gift of your Lord been restricted). Thus, He made the soul (النفس) a receptive locus (محل قابل) for what is inspired into it, whether wickedness (الفجور) or piety (التقوى). Wickedness is thereby distinguished so that one may avoid it, and piety so that one may follow its path. From another perspective, the verse demands that since He inspired it, it is stripped of having any acquisition (كسب) or independent action regarding wickedness or piety. Rather, it is merely a locus for the manifestation of the act, whether that act is wickedness or piety according to the Law (شرعا). Therefore, it is a middle Isthmus (برزخ) between these two rulings.\n\n### The thought (خاطر) of the Permissible (المباح) is an essential attribute (نعت ذاتي) of the Soul, like laughter for the human\n\nThe Glorified did not attribute the thought (خاطر) of the Permissible (المباح) to Himself, nor the inspiration concerning it. The reason for this is that the Permissible is essential (ذاتي) to the soul. By the very act of creating its essence (عينها), the essence of the Permissible appeared. Thus, it is one of its psychic attributes (صفاتها النفسية) without which the soul cannot be conceived. Therefore, the thought of the Permissible is, in reality, a specific attribute (نعت خاص), like laughter for the human, even if it is not one of the constitutive differentiae (الفصول المقومة). It is a necessary, descriptive limit (حد لازم رسمي). For, among the specific characteristics of the soul is the repulsion of harm and the attraction of benefits. This is found in the divisions of the rulings of the Law (أحكام الشرع) only in the division of the Permissible specifically, as it is that whose performance and omission are equal, carrying neither reward nor sin according to the Law (شرعا). This relates to His saying, <<وَمَا سَوَّاهَا>> (And He who proportioned it), referring to the proportioning (التسوية), which is moderation (الاعتدال) in a thing. He proportioned you and made you balanced, thereby conferring a favor upon the human. Among the divisions of the rulings of the Law, there is no division that necessitates justice and grants moderation except the division of the Permissible. The soul seeks this by its very essence and characteristic; therefore, He did not describe it as being inspired concerning it.\n\n### Who is the inspirer of the Soul's wickedness and piety?\n\nRegarding what the Glorified mentioned about the inspirer of the soul (النفس) with wickedness (الفجور) and piety (التقوى), He concealed the agent (الفاعل). The apparent meaning is that the concealed pronoun returns to the concealed agent in <<سَوَّاهَا>> (He proportioned it), which is Allah the Exalted. However, whoever considers the saying of the Messenger of Allah (may Allah bless him and grant him peace): \"Indeed, the Angel has a touch (لمة) in the human, and Satan has a touch (لمة),\" meaning obedience, which is piety (التقوى), and disobedience, which is wickedness (الفجور)—then the pronoun in <<فَأَلْهَمَهَا>> (He inspired it) would refer to the Angel for piety and to Satan for wickedness. They are not combined in a single pronoun due to the distance in suitability between them. Everything is by the decree (قضاء) and predestination (قدر) of Allah. It is not correct to say in this context that Allah is the inspirer of piety and Satan is the inspirer of wickedness, due to the ignorance and lack of propriety (سوء الأدب) inherent in that, given that one of the two thoughts (الخاطرين) usually prevails, and wickedness is generally more prevalent than piety. Furthermore, regarding the saying of the Exalted: <<مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ>> (Whatever good befalls you is from Allah, and whatever evil befalls you is from yourself), the Name (الاسم) is manifest in that verse. The evil (السيئة) mentioned there is not necessarily evil according to the Law (شرعا); rather, it is whatever displeases the person and does not align with their purpose. Superficially, this refers to the saying of the disbelievers (الكافرين) who used to take bad omens from the Prophet (may Allah bless him and grant him peace). So, the Glorified commanded him to say: <<قُلْ كُلٌّ مِنْ عِنْدِ اللَّهِ فَمَا لِهَؤُلَاءِ الْقَوْمِ لَا يَكَادُونَ يَفْقَهُونَ حَدِيثًا>> (Say: \"All is from Allah.\" So what is wrong with these people that they hardly understand any statement?). That is, concerning the events that occur among them. Allah relates that they say: <<إِنْ تُصِبْهُمْ حَسَنَةٌ يَقُولُوا هَذِهِ مِنْ عِنْدِ اللَّهِ وَإِنْ تُصِبْهُمْ سَيِّئَةٌ>> (If good befalls them, they say, \"This is from Allah\"; and if evil befalls them)—meaning what displeases them—<<فَمِنْ عِنْدِكَ>> (it is from you). Say: <<قُلْ كُلٌّ مِنْ عِنْدِ اللَّهِ>> (Say: \"All is from Allah\"). This is His saying: <<طَائِرُكُمْ عِنْدَ اللَّهِ>> (Your omen is with Allah). The agent in <<فَأَلْهَمَهَا>> (He inspired it) is concealed. If Allah in the pronoun here were the inspirer of piety and Satan were the inspirer of wickedness, then Allah and Satan would be joined in a single pronoun, and this is the extreme of impropriety (سوء الأدب) toward Allah. How excellent is the use of the conjunction *waw* (و) in His saying <<وَتَقْوَاهَا>> (and its piety)! Exalted is Allah, the King, the Holy, from being joined with the one expelled from His Mercy in a single pronoun, even though the matter allows for this possibility. The Messenger of Allah (may Allah bless him and grant him peace) said, \"What a poor orator you are,\" when he heard someone join Allah the Exalted and His Messenger (may Allah bless him and grant him peace) in a single pronoun, saying, \"And whoever disobeys them both.\" The Messenger of Allah (may Allah bless him and grant him peace) only joined Allah and himself in a single pronoun by revelation from Allah, which is His saying: <<مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ>> (Whoever obeys the Messenger has obeyed Allah), and His saying: <<وَمَا يَنْطِقُ عَنِ الْهَوَى>> (Nor does he speak from [his own] inclination). We are obligated to adhere to propriety (الأدب) in matters concerning which we have neither been commanded nor forbidden, just as the Messenger of Allah (may Allah bless him and grant him peace) did when he said, \"What a poor orator you are.\" Likewise, it is not preferable to attribute the inspiration of wickedness (الفجور) to Allah. After this exhaustive examination, the pronoun in <<فَأَلْهَمَهَا>> (He inspired it) must refer to Satan for wickedness and, by the conjunction *waw*, to the Angel for piety. Comparing a creature to a creature is more appropriate than comparing a creature to the Creator. The saying of the Messenger of Allah, \"What a poor orator you are,\" is sufficient for anyone whose insight (بصيرة) Allah has illuminated.\n\n### The Soul is not inherently commanding of evil (أمارة بالسوء) but only by virtue of its receptivity (قابليتها)\n\nHe has informed you of the rank of your soul (النفس) and that it is not commanding of evil (أمارة بالسوء) by virtue of its essence (ذاتها). Rather, this is attributed to it because it is receptive (قابلة) to the inspiration of Satan with wickedness, or due to its ignorance of the prescribed ruling (الحكم المشروع) in that matter—like a soul that commanded its owner to commit an act whose prohibition it did not know in the Law (الشرع), or concerning which a doubt arose regarding its permissibility. If the owner holds the view that it is forbidden, he says: <<إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ>> (Indeed, the soul is a persistent commander of evil). Examples include drinking date wine (النبيذ) where some permit and others forbid it, or marrying a stepdaughter where the two conditions are not met. There are many such examples in the Law. Both doctrines are established and sound Law if they result from independent legal reasoning (اجتهاد), even if one of them erred concerning the evidence of the Lawgiver (الشارع) who ruled on that issue, or would have ruled on it. Both mujtahids (those who exercise ijtihad) are rewarded. It may be that in a given issue, one mujtahid is correct, or it may be that both are mistaken, for the ruling in that issue is not necessarily confined to one answer according to the Law. Furthermore, the saying of Allah the Exalted, <<إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ>> (Indeed, the soul is a persistent commander of evil), is not Allah’s judgment upon it as such. Rather, Allah merely recounted what the wife of Al-Aziz said in the presence of Al-Aziz. Whether she was correct in this attribution or not is another ruling about which silence is maintained. Rather, what is proper for the soul is that it is self-reproaching (لوامة) if it accepts what Satan commands it to do. This statement that the soul is commanding of evil is neither a judgment from Allah upon it nor a saying of Joseph (peace be upon him). Thus, reliance upon this verse is invalidated, based on what the apparent meaning indicates, for when probability enters into evidence (الدليل), the argument based on it falls away. As for His saying in this context: <<كُلًّا نُمِدُّ هَؤُلَاءِ وَهَؤُلَاءِ مِنْ عَطَاءِ رَبِّكَ>> (To all—these as well as those—We extend from the gift of your Lord), this is an explanation of a sound reality concerning the nature of the matter itself: that there is no power nor strength except with Allah. And His saying: <<وَمَا كَانَ عَطَاءُ رَبِّكَ مَحْظُورًا>> (And never has the gift of your Lord been restricted), means prohibited. He says that Allah gives continuously, but the loci (المحال) receive according to the measure of the realities of their preparedness (استعداداتها). This is like saying that the sun spreads its lights upon all existing things and does not withhold its light from anyone, but the loci receive that light according to the measure of their preparedness. Every locus attributes the effect to the sun and neglects its own preparedness. The person who is cold enjoys its warmth, while the person who is feverish suffers pain from its heat. The light, in its essence (ذاته), is one. Yet, each of the two persons suffers pain from the very thing by which his companion finds pleasure. If the effect were due solely to the light, it would yield a single reality. Likewise, the Divine gives what is in His power, but the recipient (القابل) necessarily has a ruling in this matter. For the result (النتيجة) only comes from two premises. Thus, the face of the launderer who whitens the garment turns black. The preparedness of the garment causes the sun to whiten it, while the face of the launderer causes the sun to blacken it. Similarly, a single puff from the blower, which is air, extinguishes the lamp and ignites the fire in the dry grass, yet the air itself is one. Thus, a single verse from the Book of Allah reaches the ears, and one listener understands one thing from it, while another listener does not understand that thing but understands something else, and yet another understands many things. This is why every observer uses it as evidence, due to the difference in the preparedness of understandings. The same applies to the Divine Theophanies (التجليات الإلهية). The One who manifests (المتجلي) is, in His essence, one and the same (واحد العين), but the Theophanies—meaning their forms (صورها)—differ according to the preparedness (استعدادات) of those to whom He manifests. The same is true for the Divine gifts (العطايا الإلهية). If you understand this, you will know that the gift of Allah is not prohibited, except that you desire Him to give you what your preparedness cannot accept, and you attribute the prohibition to Him regarding what you requested, without paying attention to the preparedness. A person may be prepared to ask, but lack the preparedness to accept what he asked for. If he were given it, it would be a prohibition instead of a gift. He says: <<إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ>> (Indeed, Allah is over all things competent), and he speaks the truth in that, but you neglect the arrangement of the Divine Wisdom (الحكمة الإلهية) in the Cosmos (العالم) and what the realities of things necessitate. And all is from Allah. His prohibition is a gift, and His gift is a prohibition. But it remains for you to know what is for what, and from what.\n\n### The Difference between Inspiration (الإلهام), the Science of Inspiration (علم الإلهام), and Ladunni Knowledge (العلم اللدني)\n\nI have informed you about the soul (النفس) and that it is the mover of the limbs based on what prevails over it, whether from its own essence or from what it receives from the Angel or Satan in what they inspire into it. The Science of Inspiration (علم الإلهام) is that you know that Allah has inspired you with what He has settled in your soul, but it remains for you to examine through whose agency He inspired you, and by what path that inspiration came to you—from an Angel or Satan. What falls under the category of prescribed command and prohibition (الأمر والنهي المشروع) is Ladunni Knowledge (العلم اللدني), not mere Inspiration (الإلهام). Thus, the knowledge of obedience is inspirational (الهامي), but the knowledge resulting from obedience is Ladunni. Therefore, distinguish between Ladunni Knowledge and Inspiration. Inspiration is a transient, incidental occurrence (عارض طارئ) that vanishes and is replaced by another. Ladunni Knowledge is fixed (ثابت) and does not depart. Part of it is inherent in the original creation and disposition (الخلقة والجبلة), such as the knowledge animals and young children have of some of their benefits and harms; this is necessary knowledge (علم ضروري), not inspiration. As for His saying: <<وَأَوْحَى رَبُّكَ إِلَى النَّحْلِ>> (And your Lord inspired the bee), He means that in the origin of its formation, Allah created it upon that nature (فطرها). Inspiration (الإلهام) is what is inspired into the servant concerning matters he did not know before. Ladunni Knowledge (العلم اللدني) that is not in the original creation is the knowledge produced by actions. Allah shows mercy to some of His servants by granting them success (توفيق) in a righteous deed, and when they perform it, Allah bequeaths to them, from His Presence (من لدنه), a knowledge they did not know before. Ladunni Knowledge does not necessarily require a material basis (مادة), whereas Inspiration only occurs in materials (مواد). Knowledge (العلم) must be correct, while Inspiration may be correct or mistaken. The correct part of it is called the Science of Inspiration (علم الإلهام), and the mistaken part is called Inspiration, but not Knowledge (أي لا علم إلهام). And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "## (باب نمبر ۵۷: علمِ الہام کے حصول کی معرفت، جو کہ استدلال کی ایک قسم اور نفس کی معرفت سے حاصل ہوتا ہے)\n\nکسی ایسے الہام پر حکم نہ لگاؤ جو تم پاؤ،\nکیونکہ ہو سکتا ہے کہ وہ اس کے دینے والے کی رضا کے خلاف ہو۔\nاور اپنی شریعتِ مثلیٰ کو تصحیح کرنے والی بناؤ،\nکیونکہ یہ اس پھل کی طرح ہے جسے کمانے والا چنتا ہے۔\n\nاس کے لیے برائی اور بھلائی دونوں ہیں، پس جس طرح\nاس کے طریقے بلند ہوتے ہیں، اسی طرح اس کے مذاہب بھی پست ہوتے ہیں۔\n\nپس اس سے بچو، کیونکہ ہر گروہ میں اس کا ایک حکم ہے\nجب تم ہم میں اس کے کسب سے ناواقف ہو جاؤ۔\n\nالہام کی صورت کو مت تلاش کرو،\nکیونکہ ابلیس کا وسوسہ اس کے ساتھ ہوتا ہے۔\n\nاس کی شکل میں اور اس کی صورت کی ترتیب پر،\nاور اگرچہ وہ ممتاز ہو، لیکن معنی اس کے قریب ہوتا ہے۔\n\n### [نفس فجور اور تقویٰ کے الہام کو قبول کرنے کا محل ہے]\n\nاللہ تعالیٰ نے فرمایا: **\"اور نفس کی قسم اور اس ذات کی جس نے اسے درست کیا، پھر اسے اس کی بدکاری اور پرہیزگاری کا الہام کیا\" (وَنَفْسٍ وَمَا سَوَّاهَا فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا)**۔ نیز اس کے اس قول سے بھی: **\"ہم ان سب کو اور ان سب کو تیرے رب کے عطیے سے مدد دیتے ہیں، اور تیرے رب کا عطیہ ممنوع نہیں ہے\" (كُلًّا نُّمِدُّ هَٰؤُلَاءِ وَهَٰؤُلَاءِ مِنْ عَطَاءِ رَبِّكَ وَمَا كَانَ عَطَاءُ رَبِّكَ مَحْظُورًا)**۔ پس اس نے نفس کو فجور اور تقویٰ کے الہام کو قبول کرنے کا محل بنایا۔ پس فجور کو ممتاز کیا تاکہ تم اس سے بچو، اور تقویٰ کو ممتاز کیا تاکہ تم اس کے راستے پر چلو۔ اور ایک دوسرے پہلو سے بھی آیت اس کا تقاضا کرتی ہے، اور وہ یہ ہے کہ چونکہ اسے الہام کیا گیا، اس لیے اسے اس بات سے عاری کر دیا گیا کہ فجور اور تقویٰ میں اس کا کوئی کسب یا عمل ہو، بلکہ یہ صرف فعل کے ظاہر ہونے کا محل ہے، خواہ وہ شرعاً فجور ہو یا تقویٰ۔ پس یہ ان دونوں احکام کے درمیان ایک درمیانی برزخ ہے۔\n\n### [مباح کا خیال نفس کی ایک ذاتی صفت ہے، جیسے انسان کے لیے ہنسنا]\n\nاور اللہ سبحانہ نے مباح کے خیال کو یا اس کے بارے میں الہام کو اپنی ذات سے منسوب نہیں کیا۔ اس کی وجہ یہ ہے کہ مباح اس کے لیے ذاتی ہے، پس جس طرح اس کی عین کو پیدا کیا گیا، اسی طرح مباح کی عین ظاہر ہوئی، لہٰذا یہ اس کی نفسانی صفات میں سے ہے جس کے بغیر نفس کا تصور نہیں کیا جا سکتا۔ پس یہ، یعنی مباح کا خیال، حقیقت میں ایک خاص صفت ہے، جیسے انسان کے لیے ہنسنا۔ اگرچہ یہ مقوم فصول میں سے نہیں ہے، لیکن یہ ایک لازم رسمی حد ہے۔ کیونکہ نفس کی خاصیت میں سے ہے کہ وہ نقصانات کو دور کرے اور منافع کو حاصل کرے۔ اور یہ شریعت کے احکام کی اقسام میں سے صرف مباح کی قسم میں پایا جاتا ہے، کیونکہ یہ وہ ہے جس کا فعل اور ترک برابر ہے، لہٰذا شرعاً اس میں نہ کوئی اجر ہے اور نہ کوئی گناہ۔ اور یہی اس کا قول ہے **\"وَمَا سَوَّاهَا\"** (اور جس نے اسے درست کیا) جو کہ تسویہ سے ہے، اور وہ کسی چیز میں اعتدال ہے۔ پس اس نے تجھے درست کیا اور معتدل بنایا، اور اس کے ذریعے انسان پر احسان جتلاتا ہے۔ اور شریعت کے احکام کی اقسام میں کوئی ایسی قسم نہیں جو عدل کا تقاضا کرے اور اعتدال عطا کرے سوائے مباح کی قسم کے۔ پس نفس اسے اپنی ذات اور خاصیت کے ذریعے طلب کرتا ہے، اسی لیے اس نے اسے اس میں ملہم ہونے سے متصف نہیں کیا۔\n\n### [نفس کو فجور اور تقویٰ کا الہام کرنے والا کون ہے]\n\nاور اللہ سبحانہ نے فجور اور تقویٰ کے ساتھ نفس کو الہام کرنے والے کا جو ذکر کیا ہے، تو اس نے فاعل کو مضمر رکھا ہے۔ ظاہر یہ ہے کہ مضمر ضمیر **\"سَوَّاهَا\"** میں مضمر ضمیر کی طرف لوٹتی ہے، اور وہ اللہ تعالیٰ ہے۔ اور جس نے رسول اللہ صلی اللہ علیہ وسلم کے اس قول پر غور کیا:\n\n**\"بے شک انسان میں فرشتے کی طرف سے ایک لَمَّہ (خیال) ہوتا ہے اور شیطان کی طرف سے ایک لَمَّہ ہوتا ہے\"** (حدیث)\n\nیعنی اطاعت کے ساتھ جو کہ تقویٰ ہے، اور معصیت کے ساتھ جو کہ فجور ہے۔ تو **\"فَأَلْهَمَهَا\"** میں ضمیر تقویٰ میں فرشتے کے لیے اور فجور میں شیطان کے لیے ہوگی۔ اور ان دونوں کو ایک ضمیر میں جمع نہیں کیا گیا، کیونکہ ان کے درمیان مناسبت کم ہے۔ اور سب کچھ اللہ کی قضا و قدر سے ہے۔ اور اس مقام پر یہ کہنا درست نہیں کہ اللہ تقویٰ کا الہام کرنے والا ہے اور شیطان فجور کا الہام کرنے والا ہے، کیونکہ اس میں جہالت اور سوءِ ادب ہے، اس لیے کہ اس میں دو میں سے ایک خیال کا غلبہ ہے، اور فجور تقویٰ سے زیادہ غالب ہے۔ نیز اللہ تعالیٰ کے اس قول کی وجہ سے: **\"تجھے جو بھی بھلائی پہنچتی ہے وہ اللہ کی طرف سے ہے، اور تجھے جو بھی برائی پہنچتی ہے وہ تیرے نفس کی طرف سے ہے\" (مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ وَمَا أَصَابَكَ مِن سَيِّئَةٍ فَمِن نَّفْسِكَ)**۔ کیونکہ اس آیت میں اسم ظاہر ہے، اور اس میں سیئہ وہ نہیں جو شرعاً شر ہو، لہٰذا وہ فجور ہو، بلکہ وہ ہے جو اسے ناگوار گزرے اور اس کے مقصد کے موافق نہ ہو۔ اور یہ بظاہر ان کا قول ہے، کیونکہ وہ (کافر) رسول اللہ صلی اللہ علیہ وسلم سے بدشگونی لیتے تھے۔ پس اللہ سبحانہ نے انہیں حکم دیا کہ وہ کہیں: **\"سب کچھ اللہ کی طرف سے ہے، ان لوگوں کو کیا ہو گیا ہے کہ وہ بات کو سمجھنے کے قریب بھی نہیں آتے\" (كُلٌّ مِّنْ عِندِ اللَّهِ فَمَا لِهَٰؤُلَاءِ الْقَوْمِ لَا يَكَادُونَ يَفْقَهُونَ حَدِيثًا)**۔ یعنی جو واقعات ان میں رونما ہوتے ہیں۔ اللہ ان کے بارے میں فرماتا ہے کہ وہ کہتے ہیں: **\"اگر انہیں کوئی بھلائی پہنچتی ہے تو کہتے ہیں یہ اللہ کی طرف سے ہے، اور اگر انہیں کوئی برائی پہنچتی ہے\"** یعنی جو انہیں ناگوار گزرے، **\"تو کہتے ہیں یہ آپ کی طرف سے ہے\" (وَإِن تُصِبْهُمْ سَيِّئَةٌ فَمِنْ عِندِكَ)**۔ کہہ دو: **\"سب کچھ اللہ کی طرف سے ہے\" (قُلْ كُلٌّ مِّنْ عِندِ اللَّهِ)**۔ اور یہی اس کا قول ہے: **\"تمہاری بدشگونی اللہ کے پاس ہے\" (طَائِرُكُمْ عِندَ اللَّهِ)**۔ پس **\"فَأَلْهَمَهَا\"** میں فاعل مضمر ہے۔ اگر اس ضمیر میں اللہ تقویٰ کا الہام کرنے والا ہو اور شیطان فجور کا الہام کرنے والا ہو، تو اللہ اور شیطان کو ایک ضمیر میں جمع کر دیا گیا، اور یہ اللہ کے ساتھ سوءِ ادب کی انتہا ہے۔ اور یہ کتنا اچھا ہے کہ اس نے **\"وَتَقْوَاهَا\"** میں واؤِ عاطفہ لایا۔ پس اللہ، بادشاہ، قدوس اس سے بلند ہے کہ وہ اپنی رحمت سے دھتکارے ہوئے کے ساتھ ایک ضمیر میں جمع ہو، حالانکہ اس امر کا احتمال موجود ہے۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: **\"تم برے خطیب ہو\"** جب آپ نے ایک شخص کو سنا کہ اس نے اللہ تعالیٰ اور رسول اللہ صلی اللہ علیہ وسلم کو ایک ضمیر میں جمع کر دیا اور کہا: \"اور جو ان دونوں کی نافرمانی کرے\"۔\n\nاور رسول اللہ صلی اللہ علیہ وسلم نے اللہ اور اپنی ذات کو ایک ضمیر میں جمع کر کے یہ بات صرف اللہ کی وحی سے کہی، اور وہ اس کا قول ہے: **\"جو رسول کی اطاعت کرتا ہے، اس نے درحقیقت اللہ کی اطاعت کی\" (مَن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ)**۔ اور فرمایا: **\"اور وہ اپنی خواہش سے نہیں بولتے\" (وَمَا يَنطِقُ عَنِ الْهَوَىٰ)**۔ اور ہم پر لازم ہے کہ ہم اس چیز میں ادب کو لازم پکڑیں جس کا ہمیں نہ حکم دیا گیا ہو اور نہ منع کیا گیا ہو، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے قول **\"تم برے خطیب ہو\"** میں کیا۔ اسی طرح یہ بھی ترجیح نہیں دی جا سکتی کہ فجور کا الہام اللہ کی طرف منسوب کیا جائے۔ پس اس استقصاء کے بعد یہ باقی نہیں رہتا کہ **\"فَأَلْهَمَهَا\"** میں فجور کے ساتھ ضمیر شیطان کے لیے ہو، اور واؤ کے ساتھ تقویٰ کے لیے ملک (فرشتے) کے لیے ہو۔ پس مخلوق کا مقابلہ مخلوق سے کرنا خالق کے مقابلہ مخلوق سے کرنے سے بہتر ہے۔ اور رسول اللہ صلی اللہ علیہ وسلم کے قول **\"تم برے خطیب ہو\"** میں اس شخص کے لیے کافی ہے جس کی بصیرت کو اللہ نے روشن کر دیا ہو۔\n\n### [نفس اپنی ذات کے اعتبار سے برائی کا حکم دینے والی نہیں ہے، بلکہ اپنی قبولیت کی صلاحیت کے اعتبار سے ہے]\n\nپس اس نے تمہیں تمہارے نفس کے مرتبے سے آگاہ کر دیا، اور یہ کہ وہ اپنی ذات کے اعتبار سے برائی کا حکم دینے والی نہیں ہے، بلکہ یہ اس کی طرف اس اعتبار سے منسوب کیا جاتا ہے کہ وہ شیطان کے فجور کے الہام کو قبول کرنے والی ہے، اور اس میں مشروع حکم سے اس کی جہالت کی وجہ سے، جیسے کوئی نفس اپنے صاحب کو کسی ایسے کام کے ارتکاب کا حکم دے جس کی حرمت اسے شرع میں معلوم نہ ہو، یا اس کے نزدیک اس کے مباح ہونے کا شبہ قائم ہو، پھر وہ شخص اسے اپنے مذہب میں حرام سمجھے، تو وہ کہتا ہے: **\"بے شک نفس تو برائی کا بہت حکم دینے والا ہے\" (إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ)**۔ جیسے نبیذ کا پینا، جو حلال کرنے والے اور حرام کرنے والے کے درمیان ہے، اور ربِیبہ (سوتیلی بیٹی) سے نکاح جس میں دونوں شرطیں جمع نہ ہوں، اور شریعت میں اس طرح کی مثالیں بہت ہیں۔ اور دونوں مذاہب مقرر شدہ صحیح شرع ہیں، اگر وہ اجتہاد پر مبنی ہوں، اگرچہ ان میں سے ایک نے اس مسئلے میں شارع کی دلیل میں خطا کی ہو جس سے اس نے حکم دیا، یا اگر وہ اس میں حکم دیتا۔ اور دونوں مجتہد ماجور ہیں۔ اور ہو سکتا ہے کہ کسی مسئلے میں ایک مجتہد صحیح ہو، اور ہو سکتا ہے کہ دونوں ہی خطا پر ہوں، کیونکہ اس مسئلے میں شرعاً حکم منحصر نہیں ہے۔ پھر اللہ تعالیٰ کا قول **\"إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ\"** (بے شک نفس تو برائی کا بہت حکم دینے والا ہے) تو یہ اللہ کا اس پر حکم نہیں ہے، بلکہ اللہ نے وہ بات نقل کی ہے جو عزیز کی بیوی نے عزیز کی مجلس میں کہی تھی۔ اور کیا اس نے اس اضافت میں درست کہا یا نہیں، یہ ایک دوسرا حکم ہے جس پر خاموشی اختیار کی گئی ہے۔ بلکہ جو اس کے لیے ہے وہ یہ ہے کہ وہ اپنے آپ کو ملامت کرنے والی ہے جب وہ شیطان کی طرف سے جو اسے حکم دیتا ہے قبول کر لیتی ہے۔ پس نفس کے بارے میں یہ خبر کہ وہ برائی کا حکم دینے والی ہے، نہ تو اللہ کا اس پر حکم ہے اور نہ ہی یوسف علیہ السلام کا قول ہے۔ پس اس آیت سے استدلال باطل ہو گیا، کیونکہ ظاہر نے اس پر دلالت کی، اور جب دلیل میں احتمال داخل ہو جائے تو اس سے احتجاج ساقط ہو جاتا ہے۔ اور جہاں تک اس مقام پر اللہ تعالیٰ کے قول **\"ہم ان سب کو اور ان سب کو تیرے رب کے عطیے سے مدد دیتے ہیں\" (كُلًّا نُّمِدُّ هَٰؤُلَاءِ وَهَٰؤُلَاءِ مِنْ عَطَاءِ رَبِّكَ)** کا تعلق ہے، تو یہ ایک صحیح حقیقت کا بیان ہے کہ معاملہ اپنی ذات میں اسی طرح ہے کہ **\"لا حول ولا قوة إلا بالله\"** (اللہ کی مدد کے بغیر نہ کوئی طاقت ہے اور نہ کوئی قوت)۔ اور اس کا قول **\"اور تیرے رب کا عطیہ ممنوع نہیں ہے\" (وَمَا كَانَ عَطَاءُ رَبِّكَ مَحْظُورًا)** یعنی روکا ہوا نہیں۔ وہ کہتا ہے کہ اللہ ہمیشہ عطا کرتا ہے، اور محال (محل) اپنی استعداد کی حقیقتوں کے مطابق قبول کرتے ہیں۔ جیسا کہ تم کہتے ہو کہ سورج کی روشنی موجودات پر پھیلتی ہے، اور وہ اپنی روشنی میں کسی پر بخل نہیں کرتا، اور محال اس روشنی کو اپنی استعداد کے مطابق قبول کرتے ہیں۔ اور ہر محل اثر کو سورج کی طرف منسوب کرتا ہے اور اپنی استعداد سے غافل ہو جاتا ہے۔ پس سرد مزاج شخص اس کی حرارت سے لذت محسوس کرتا ہے، اور گرم مزاج جسم اس کی حرارت سے تکلیف محسوس کرتا ہے۔ اور نور اپنی ذات کے اعتبار سے ایک ہے، اور دونوں میں سے ہر ایک اس چیز سے تکلیف محسوس کرتا ہے جس سے اس کا ساتھی لطف اندوز ہوتا ہے۔ پس اگر یہ صرف نور کے لیے ہوتا تو وہ ایک ہی حقیقت عطا کرتا۔ اور اسی طرح اس نے وہ عطا کیا جو اس کی قوت میں ہے، لیکن قبول کرنے والے کے لیے اس میں ایک حکم ہے اور یہ ضروری ہے۔ کیونکہ نتیجہ دو مقدمات کے بغیر نہیں ہو سکتا۔ پس دھوبی کا چہرہ کالا ہو جاتا ہے جو کپڑے کو سفید کرتا ہے۔ کیونکہ کپڑے کی استعداد سورج میں سفیدی عطا کرتی ہے، اور دھوبی کا چہرہ سورج میں سیاہی عطا کرتا ہے۔ اسی طرح پھونکنے والے کی ایک ہی پھونک، جو کہ ہوا ہے، چراغ کو بجھا دیتی ہے اور گھاس میں موجود آگ کو بھڑکا دیتی ہے۔ اور ہوا اپنی ذات میں ایک ہے۔ پس اللہ کی کتاب کی آیت ایک ہی عین کے ساتھ کانوں پر آتی ہے، تو ایک سننے والا اس سے ایک ہی امر سمجھتا ہے، اور دوسرا سننے والا اس سے وہ امر نہیں سمجھتا اور اس سے کوئی دوسرا امر سمجھتا ہے، اور کوئی تیسرا اس سے بہت سے امور سمجھتا ہے۔ اور اسی لیے اس میں غور کرنے والا ہر شخص اپنے فہم کی استعداد کے اختلاف کی وجہ سے اس سے استدلال کرتا ہے۔ اور اسی طرح تجلیاتِ الٰہیہ میں بھی ہے۔ پس متجلی اپنی ذات میں ایک ہی عین ہے، اور تجلیات، یعنی ان کی صورتیں، متجلی لہم کی استعداد کے مطابق مختلف ہو گئیں۔ اور اسی طرح عطیاتِ الٰہیہ میں بھی ہے۔ پس جب تم یہ سمجھ گئے تو تم جان گئے کہ اللہ کا عطیہ ممنوع نہیں ہے، مگر یہ کہ تم چاہتے ہو کہ وہ تمہیں وہ عطا کرے جسے تمہاری استعداد قبول نہیں کرتی، اور تم اس کی طرف منع کو منسوب کرتے ہو جو تم نے اس سے طلب کیا، اور تم نے اپنی توجہ استعداد کی طرف نہیں کی۔ پس ہو سکتا ہے کہ شخص سوال کے لیے تیار ہو، لیکن اس کے پاس اس چیز کو قبول کرنے کی استعداد نہ ہو جس کے بارے میں اس نے سوال کیا ہے۔ پس اگر اسے منع کے بجائے عطا کر دیا جائے، اور وہ کہتا ہے: **\"بے شک اللہ ہر چیز پر قادر ہے\" (إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ)**، اور وہ اس میں سچا ہے، لیکن تم عالم میں حکمتِ الٰہیہ کی ترتیب اور اشیاء کی حقیقتوں کے عطا کرنے سے غافل ہو جاتے ہو، اور سب کچھ اللہ کی طرف سے ہے۔ پس اس کا منع کرنا عطا ہے اور اس کی عطا منع ہے۔ لیکن تمہارے لیے یہ جاننا باقی ہے کہ یہ کس لیے ہے اور کس سے ہے۔\n\n### [الہام، علمِ الہام اور علمِ لدنی میں فرق]\n\nپس میں نے تمہیں نفس سے آگاہ کر دیا کہ وہ اعضاء کو حرکت دینے والا ہے اس چیز کے ذریعے جو اس پر غالب آتی ہے، یا تو اس کی ذات سے، یا اس چیز سے جو وہ فرشتے یا شیطان سے قبول کرتا ہے جس کا وہ اسے الہام کرتے ہیں۔ پس علمِ الہام یہ ہے کہ تم جانو کہ اللہ نے تمہیں اس چیز کا الہام کیا جو اس نے تمہارے نفس میں ڈالی، لیکن تم پر یہ باقی ہے کہ تم دیکھو کہ اس نے تمہیں کس کے ہاتھ پر الہام کیا اور وہ الہام تمہارے پاس کس راستے سے آیا، فرشتے سے یا شیطان سے۔ اور جو امر و نہیِ مشروع کے قبیل سے نکلتا ہے، وہ علمِ لدنی ہے، وہ الہام نہیں ہے۔ پس اطاعت کا علم الہامی ہے، اور اطاعت کے نتائج کا علم لدنی ہے۔ پس علمِ لدنی اور الہام کے درمیان فرق ہے۔ الہام ایک عارضی طاری ہونے والی چیز ہے جو زائل ہو جاتی ہے اور اس کی جگہ دوسری آ جاتی ہے، اور علمِ لدنی ثابت ہے جو زائل نہیں ہوتا۔ پس اس میں سے کچھ وہ ہوتا ہے جو اصل خلقت اور جبلت میں ہوتا ہے، جیسے حیوانات اور چھوٹے بچوں کا اپنے بعض منافع اور نقصانات کا علم، پس یہ ایک ضروری علم ہے، الہام نہیں ہے۔ اور جہاں تک اس کے قول **\"اور تیرے رب نے شہد کی مکھی کو وحی کی\" (وَأَوْحَىٰ رَبُّكَ إِلَى النَّحْلِ)** کا تعلق ہے، تو وہ اس کی اصل نشوونما میں مراد لیتا ہے، کہ اللہ نے اسے اس پر فطرت دی۔ اور الہام وہ ہے جو بندے کو ان امور کا الہام کیا جاتا ہے جنہیں وہ اس سے پہلے نہیں جانتا تھا۔ اور وہ علمِ لدنی جو اصل خلقت میں نہیں ہوتا، وہ وہ علم ہے جو اعمال پیدا کرتے ہیں، پس اللہ اپنے بعض بندوں پر رحم کرتا ہے کہ اسے نیک عمل کی توفیق دیتا ہے، پس وہ اس پر عمل کرتا ہے، تو اللہ اسے اپنی طرف سے وہ علم عطا کرتا ہے جسے وہ اس سے پہلے نہیں جانتا تھا۔ اور علمِ لدنی کے لیے یہ ضروری نہیں کہ وہ کسی مادہ میں ہو، جبکہ الہام صرف مواد میں ہوتا ہے۔ اور علم کا صحیح ہونا ضروری ہے، اور الہام کبھی صحیح ہوتا ہے اور کبھی خطا کرتا ہے۔ پس جو صحیح ہوتا ہے اسے علمِ الہام کہا جاتا ہے، اور جو خطا کرتا ہے اسے الہام کہا جاتا ہے، علم نہیں، یعنی علمِ الہام نہیں۔ اور **\"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)**۔",
    "fa": "باب پنجاه و هفتم در معرفت به دست آوردن علم الهام (علم الإلهام) به نوعی از انواع استدلال و معرفت نفس\n\nبه الهامی که می‌یابی حکم مکن، زیرا\nممکن است در غیر آنچه واهبش (بخشنده‌اش) می‌پسندد باشد.\nو شریعت برتر خود را تصحیح‌کننده قرار ده،\nزیرا آن میوه‌ای است که کسب‌کننده‌اش آن را می‌چیند.\n\nبدی و نیکی هر دو از آن اوست، پس همان‌گونه که\nراه‌هایش بالا می‌رود، مذاهبش نیز پست می‌شود.\n\nپس از آن برحذر باش، زیرا در هر گروهی\nحکمی دارد، اگر کسب‌هایش در ما ناشناخته بماند.\n\nصورت (ظاهر) الهام (الإلهام) را طلب مکن،\nزیرا وسواس ابلیس با آن همراه است.\n\nدر شکل آن و بر ترتیب صورت آن (همراه است)،\nو اگرچه متمایز شود، معنا به آن نزدیک است.\n\n### [نفس، محلی است که آنچه از فجور و تقوا به آن الهام می‌شود را می‌پذیرد]\n\nخداوند متعال می‌فرماید: «وَنَفْسٍ وَمَا سَوَّاهَا * فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا» (سوگند به نفس و آنکه آن را سامان داد * سپس فجور و تقوای آن را به آن الهام کرد). و نیز از قول اوست: «كُلًّا نُمِدُّ هَؤُلَاءِ وَهَؤُلَاءِ مِنْ عَطَاءِ رَبِّكَ وَمَا كَانَ عَطَاءُ رَبِّكَ مَحْظُورًا» (هر یک از اینان و آنان را از عطای پروردگارت مدد می‌رسانیم، و عطای پروردگارت ممنوع نبوده است). پس نفس را محلی قرار داد که آنچه از فجور و تقوا به آن الهام می‌شود را می‌پذیرد. پس فجور را تشخیص می‌دهد تا از آن دوری کند و تقوا را تشخیص می‌دهد تا راه آن را بپیماید. و از وجهی دیگر، آیه آن را طلب می‌کند، و آن این است که به سبب الهامی که به نفس شده، نفس از اینکه در فجور و تقوا کسبی یا عملی داشته باشد، عاری شده است. بلکه نفس تنها محلی برای ظهور فعل است، خواه آن فعل فجور باشد یا تقوای شرعی. پس نفس برزخی میانه بین این دو حکم است.\n\n### [خاطر مباح، وصف ذاتی نفس است مانند خنده برای انسان]\n\nو خداوند سبحان خاطر مباح و الهام در آن را به خود نسبت نداده است. و سبب آن این است که مباح برای نفس ذاتی است. پس به محض خلقت عین نفس، عین مباح نیز ظاهر شد. بنابراین، مباح از صفات نفسانی آن است که نفس جز با آن تعقل نمی‌شود. پس در حقیقت، منظورم خاطر مباح، وصفی خاص است مانند خنده برای انسان؛ و اگرچه از فصول مقوّم (اجزای ذاتی) نیست، اما حدی لازم و رسمی است. زیرا از خاصیت نفس دفع ضررها و جلب منافع است. و این در اقسام احکام شرع یافت نمی‌شود مگر در بخش مباح به طور خاص، زیرا مباح چیزی است که انجام و ترک آن مساوی است و از نظر شرعی نه پاداشی در آن است و نه گناهی. و این همان قول اوست: «وَمَا سَوَّاهَا» (و آنکه آن را سامان داد) که از تسویه (سامان دادن) است و آن اعتدال در شیء است. پس تو را سامان داد و معتدل ساخت، و بدین وسیله بر انسان منت می‌نهد. و در اقسام احکام شریعت، قسمی که مقتضی عدل باشد و اعتدال بخشد، جز قسم مباح نیست. پس نفس آن را به ذات و خاصیت خود طلب می‌کند، از این رو آن را به الهام (الإلهام) در این مورد وصف نکرده است.\n\n### [چه کسی الهام‌کننده فجور و تقوای نفس است]\n\nو آنچه خداوند سبحان درباره الهام‌کننده فجور و تقوا ذکر کرده، فاعل آن را مضمر (پنهان) ساخته است. ظاهر این است که ضمیر مضمر به ضمیر در «سَوَّاهَا» (سامان داد) بازمی‌گردد که همان خداوند متعال است. و کسی که در قول رسول خدا (صلی الله علیه و آله و سلم): «همانا برای فرشته در انسان لَمّه (خطور) و برای شیطان لَمّه (خطور) است» نظر کند، منظور از آن، طاعت است که همان تقواست، و معصیت است که همان فجور است. پس ضمیر در «فَأَلْهَمَهَا» (به آن الهام کرد) برای فرشته در تقوا و برای شیطان در فجور خواهد بود. و آن دو را در یک ضمیر جمع نکرد به دلیل دوری تناسب میان آن دو. و همه به قضا و قدر الهی است. و صحیح نیست که در این موضع گفته شود که خداوند الهام‌کننده تقوا و شیطان الهام‌کننده فجور است، زیرا در این سخن جهل و سوء ادب وجود دارد، به دلیل غلبه یکی از دو خاطر (خطور فرشته یا شیطان)، و فجور اغلب از تقواست. و همچنین به دلیل قول خداوند متعال: «مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ» (آنچه از نیکی به تو رسد از جانب خداست و آنچه از بدی به تو رسد از جانب خود توست). زیرا در آن آیه، اسم ظاهر است و سیئه (بدی) در آن، آنچه شرعاً سیئه است نیست که فجور باشد، بلکه چیزی است که او را ناخوش می‌آید و با غرضش موافق نیست. و این در ظاهر، قول آنان است، زیرا کافران به پیامبر (صلی الله علیه و آله و سلم) فال بد می‌زدند. پس خداوند سبحان به او امر کرد که بگوید: «كُلٌّ مِّنْ عِندِ اللَّهِ فَمَا لِهَؤُلَاءِ الْقَوْمِ لَا يَكَادُونَ يَفْقَهُونَ حَدِيثًا» (همه از جانب خداست. پس این قوم را چه شده که نزدیک نیست سخنی را بفهمند؟) یعنی آنچه از حوادث در میانشان رخ می‌دهد. خداوند از قول آنان می‌گوید که می‌گویند: «إِن تُصِبْهُمْ حَسَنَةٌ يَقُولُوا هَذِهِ مِنْ عِندِ اللَّهِ وَإِن تُصِبْهُمْ سَيِّئَةٌ» (یعنی آنچه آنان را ناخوش آید) «فَمِنْ عِندِكَ قُلْ كُلٌّ مِّنْ عِندِ اللَّهِ» (اگر نیکی به آنان رسد، می‌گویند این از جانب خداست، و اگر بدی به آنان رسد، می‌گویند این از جانب توست. بگو: همه از جانب خداست). و این همان قول اوست: «طَائِرُكُمْ عِندَ اللَّهِ» (فال بد شما نزد خداست). پس فاعل در «فَأَلْهَمَهَا» مضمر است. اگر خداوند در اینجا در ضمیر، الهام‌کننده تقوا و شیطان الهام‌کننده فجور باشد، پس خداوند و شیطان در یک ضمیر جمع شده‌اند، و این نهایت سوء ادب با خداست. و چه نیکوست که واو عاطفه در قول او «وَتَقْوَاهَا» آمده است. پس خداوند، ملک قدوس، برتر است از اینکه با رانده‌شده از رحمت الهی در یک ضمیر جمع شود، با وجود احتمال امر در آن. و رسول خدا (صلی الله علیه و آله و سلم) فرمود: «چه خطیب بدی هستی» هنگامی که شنید او خداوند متعال و رسولش (صلی الله علیه و آله و سلم) را در یک ضمیر جمع کرده و گفت: «و هر کس از آن دو نافرمانی کند». و رسول خدا (صلی الله علیه و آله و سلم) این سخن را نگفت (که جمع بین خود و خدا در ضمیر واحد سوء ادب است) زیرا جمع بین خدا و خودش در یک ضمیر، جز به وحی الهی نبود، و آن قول اوست: «مَن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ» (هر کس از رسول اطاعت کند، قطعاً از خدا اطاعت کرده است) و فرمود: «وَمَا يَنطِقُ عَنِ الْهَوَى» (و از روی هوای نفس سخن نمی‌گوید). و بر ما لازم است که ملازم ادب باشیم در آنچه به آن امر نشده‌ایم و از آن نهی نشده‌ایم، همان‌گونه که رسول خدا (صلی الله علیه و آله و سلم) در قولش: «چه خطیب بدی هستی» عمل کرد. و همچنین ترجیح داده نمی‌شود که الهام (الإلهام) به فجور را به خداوند نسبت دهیم. پس بعد از این استقصاء (جستجوی کامل)، باقی نمی‌ماند که ضمیر در «فَأَلْهَمَهَا» در مورد فجور جز شیطان باشد و با واو در مورد تقوا جز فرشته باشد. پس مقابله مخلوق با مخلوق، اولی‌تر از مقابله مخلوق با خالق است. و در قول رسول خدا (صلی الله علیه و آله و سلم): «چه خطیب بدی هستی» کفایت است برای کسی که خداوند بصیرتش را روشن کرده باشد.\n\n### [نفس از حیث ذات خود امرکننده به بدی نیست، بلکه از حیث قابلیت خود چنین است]\n\nپس تو را به مرتبه نفس خود آگاه ساخت که از حیث ذات خود امرکننده به بدی نیست، بلکه این نسبت به آن داده می‌شود از آن جهت که پذیرای الهام (الإلهام) شیطان به فجور است و به دلیل جهلش به حکم مشروع در آن. مانند نفسی که صاحبش را به ارتکاب امری فرمان دهد که حرمت آن را در شرع نمی‌داند، یا شبهه‌ای در اباحه آن نزدش ایجاد شده باشد، در حالی که دیگری تحریم آن را از مذهب خود می‌بیند، پس می‌گوید: «إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ» (همانا نفس قطعاً بسیار امرکننده به بدی است). مانند نوشیدن نبیذ (شراب خرما) که بین حلال‌کننده و حرام‌کننده آن اختلاف است، و نکاح ربیبه (دختر زن) که دو شرط در آن جمع نشده باشد. و مانند این در شریعت بسیار است. و هر دو مذهب، شرعی مقرر و صحیح هستند اگر از روی اجتهاد باشند، با وجود اینکه یکی از آن دو، دلیل شارع را که در آن مسئله حکم کرده یا اگر حکم می‌کرد، خطا کرده است. و هر دو مجتهد مأجورند. و ممکن است در مسئله‌ای یکی از مجتهدان مصیب باشد و ممکن است هر دو خطا کرده باشند، زیرا حکم شرعی در آن مسئله منحصر نیست. سپس، قول خداوند متعال: «إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ»، حکم خداوند بر نفس نیست، بلکه خداوند آنچه را که زن عزیز در مجلس عزیز گفته، حکایت کرده است. و اینکه آیا او در این نسبت دادن درست گفته یا نه، این حکم دیگری است که مسکوت عنه است. بلکه آنچه برای نفس است، این است که اگر آنچه شیطان به آن امر می‌کند را بپذیرد، نفس، لوّامه (ملامت‌کننده) خود است. پس این خبر دادن از نفس که امرکننده به بدی است، نه حکم خداوند بر آن است و نه از قول یوسف (علیه السلام). پس تمسک به این آیه باطل است، به دلیل آنچه ظاهر بر آن دلالت دارد، و دلیلی که احتمال در آن راه یابد، احتجاج به آن ساقط می‌شود. و اما قول خداوند متعال در این مقام: «كُلًّا نُمِدُّ هَؤُلَاءِ وَهَؤُلَاءِ مِنْ عَطَاءِ رَبِّكَ»، بیانگر حقیقتی صحیح است بر اساس آنچه امر در نفس خود بر آن است، که «لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ» (هیچ نیرو و توانی جز به یاری خدا نیست). و قول او: «وَمَا كَانَ عَطَاءُ رَبِّكَ مَحْظُورًا» (و عطای پروردگارت ممنوع نبوده است)، یعنی ممنوع نیست. می‌گوید: خداوند پیوسته عطا می‌کند و محل‌ها به اندازه حقایق استعدادهایشان می‌پذیرند. همان‌گونه که می‌گویی: خورشید انوار خود را بر موجودات می‌گستراند و نور خود را از هیچ‌کس دریغ نمی‌کند، و محل‌ها آن نور را به اندازه استعداد خود می‌پذیرند. و هر محلی اثر را به خورشید نسبت می‌دهد و از استعداد خود غافل می‌شود. پس شخص سردمزاج از گرمای آن لذت می‌برد و جسم گرم‌مزاج از گرمای آن متألم می‌شود. و نور از حیث ذات خود واحد است، و هر یک از این دو شخص از چیزی متألم می‌شود که دیگری از آن متنعم می‌گردد. پس اگر این (اثر) تنها برای نور بود، یک حقیقت واحد را عطا می‌کرد. و همچنین آنچه در قوه اوست را عطا کرده است، جز اینکه برای قابل (پذیرنده) در این امر حکمی است که ناگزیر باید باشد، زیرا نتیجه جز از دو مقدمه حاصل نمی‌شود. پس روی گازری که لباس را سفید می‌کند، سیاه می‌شود. زیرا استعداد لباس، خورشید را به سفید کردن در آن وامی‌دارد، و استعداد روی گازر، خورشید را به سیاه کردن در آن وامی‌دارد. و همچنین یک دمیدن از دمنده که همان هواست، چراغ را خاموش می‌کند و آتش را در هیزم شعله‌ور می‌سازد، در حالی که هوا در ذات خود واحد است. پس آیه از کتاب خدا با عین واحد بر گوش‌ها وارد می‌شود، و شنونده‌ای از آن امری واحد می‌فهمد، و شنونده‌ای دیگر آن امر را نمی‌فهمد و امری دیگر می‌فهمد، و دیگری امور بسیاری می‌فهمد. و به همین دلیل، هر یک از نظرکنندگان در آن، به دلیل اختلاف استعداد فهم‌ها، به آن استشهاد می‌کنند. و همچنین در تجلیات الهی (التجلی)، متجلی از حیث ذات خود واحدالعین است، و تجلیات (التجلی) یعنی صور آن‌ها، بر حسب استعدادهای کسانی که بر آن‌ها تجلی شده، متفاوت گشته است. و همچنین در عطایای الهی نیز همین‌طور است. پس اگر این را فهمیدی، دانستی که عطای خداوند ممنوع نیست، جز اینکه تو دوست داری چیزی به تو عطا کند که استعدادت آن را نمی‌پذیرد، و منع را به او نسبت می‌دهی در آنچه از او طلب کرده‌ای و به استعداد توجه نکرده‌ای. چه بسا شخص برای سؤال استعداد داشته باشد، اما استعداد پذیرش آنچه را که سؤال کرده، نداشته باشد. پس اگر به جای منع، به او عطا شود، می‌گوید: «إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ» (همانا خداوند بر هر چیزی تواناست) و در این راستگوست، اما تو از ترتیب حکمت الهی در عالم و آنچه حقایق اشیاء عطا می‌کنند، غافل می‌شوی. و همه از نزد خداست، پس منع او عطا و عطای او منع است، اما بر تو باقی است که بدانی برای چه و از چه.\n\n### [تفاوت بین الهام، علم الهام و علم لدنی]\n\nمن تو را به نفس شناساندم و اینکه نفس محرک جوارح (اعضا) است به واسطه آنچه بر آن غلبه می‌کند، یا از ذات خود یا از آنچه از فرشته یا شیطان در آنچه به آن الهام (الإلهام) می‌شود، می‌پذیرد. پس علم الهام (علم الإلهام) آن است که بدانی خداوند آنچه را در نفس تو قرار داده، به تو الهام کرده است، اما بر تو باقی است که بنگری به دست چه کسی به تو الهام شده و از چه طریقی آن الهام (الإلهام) به تو رسیده است، از فرشته یا شیطان. و آنچه از قبیل امر و نهی مشروع خارج شود، علم لدنی (العلم اللدني) است، نه الهام (الإلهام). پس علم به طاعت، الهامی است و علمِ نتایج طاعت، لدنی است. پس بین علم لدنی (العلم اللدني) و الهام (الإلهام) تفاوت بگذار. الهام (الإلهام) عارضه‌ای گذراست که زائل می‌شود و دیگری می‌آید، اما علم لدنی (العلم اللدني) ثابت است و از بین نمی‌رود. بخشی از آن در اصل خلقت و جبلّت (سرشت) است، مانند علم حیوانات و کودکان خردسال به برخی منافع و مضار خود، که این علم ضروری است نه الهام (الإلهام). و اما قول او: «وَأَوْحَى رَبُّكَ إِلَى النَّحْلِ» (و پروردگار تو به زنبور عسل وحی کرد)، منظور این است که خداوند آن را در اصل نشأت و فطرتش بر آن سرشته است. و الهام (الإلهام) آن است که اموری به بنده الهام شود که پیش از آن نمی‌دانسته است. و علم لدنی (العلم اللدني) که در اصل خلقت نیست، علمی است که اعمال آن را نتیجه می‌دهند. پس خداوند بر برخی بندگانش رحمت می‌آورد به اینکه او را به عمل صالحی موفق می‌سازد و او آن را انجام می‌دهد، و خداوند از آن عمل، علمی از نزد خود (لدنی) به او به ارث می‌دهد که پیش از آن نمی‌دانسته است. و لازم نیست که علم لدنی (العلم اللدني) در ماده باشد، در حالی که الهام (الإلهام) جز در مواد نیست. و علم حتماً به صواب می‌رسد، اما الهام (الإلهام) ممکن است به صواب رسد و ممکن است خطا کند. آنچه از آن به صواب رسد، علم الهام (علم الإلهام) نامیده می‌شود، و آنچه خطا کند، الهام (الإلهام) نامیده می‌شود نه علم، یعنی نه علم الهام (علم الإلهام). «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 3
}