{
  "id": 298,
  "title": {
    "ar": "الباب الثامن والتسعون ومائتان في معرفة منزل الذكر من العالم العلوي في الحضرة المحمدية",
    "en": "Chapter Two Hundred and Ninety-Eighth: Concerning the Gnosis (معرفة) of the Station (منزل) of Remembrance (الذكر) from the Celestial World (العالم العلوي) within the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب دو سو اٹھانوے: الحضرة المحمدية (Al-Ḥaḍra al-Muḥammadiyya) میں عالم علوی سے تعلق رکھنے والے ذکر (Dhikr) کے مقام کی معرفت کے بیان میں۔",
    "fa": "باب دویست و نود و هشتم در معرفت جایگاه ذکر از عالم علوی در حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب الثامن والتسعون ومائتان في معرفة منزل الذكر من العالم العلوي في الحضرة المحمدية»\n\n\n> زهر المعارف من زهر الرياضات *** وزهر روضك من زهر السموات‏\n\n\n> فللجسوم علوم ليس يشبهها *** علم النفوس لأسباب وآفات‏\n\n\n> حقائق الحق لا تخفى مداركها *** لأن إدراكها للذات بالذات‏\n\n\n> وما سواها فإدراك بواسطة *** بما يراه من أعلام وآيات‏\n\n\n> هزل الأكابر جد عن مشاهدة *** في طيه عندهم مكر الكرامات‏\n\n\n> إمهالهم ليس إهمالا لعلمهم *** بأن ذلك مربوط بأوقات‏\n\n\n> إن الرجال وإن حققت نسبتهم *** إلى أب واحد أولاد علات‏\n> إن قلت هم فهم أو قلت لا فهم *** لكونهم بين آلام ولذات‏\n\n\n> لأنه ليس تفنيهم مظاهره *** وهي المعبر عنها بالستارات‏\n\n\n### [علم الخروج عن الطبع‏]\n\n\nاعلم وفقك الله أن شيخنا أبا العباس العريبي كان ممن تحقق بهذا المنزل وفاوضناه فيه مرارا فكانت قدمه فيه راسخة رحمه الله واعلم أن هذا المنزل قد جمع بين المشقة الشديدة والأمور التي لا تنال إلا بالقهر الشديد والآفات المانعة عن إدراك المطلوب وبين الرفق وارتفاع الآفات والوصول إلى المطلوب بالراحة المستلذة المعشوقة للنفوس وما بين هاتين الصفتين شدائد عظام فأول علم يتضمن هذا المنزل علم الخروج عن الطبع فاعلم إن الحركات منها طبيعية ومنها قسرية فلا تتخيل أن الحركة الطبيعية تعطي لذة والحركة القسرية تعطي ألما لخروجك عن الطبع قد يكون الأمر كذلك وقد يكون على النقيض فلو وقع الإنسان من علو عظيم لكان نزوله إلى الأرض عن حركة طبيعية ولكن إذا وصل إلى الأرض ربما تكسرت أعضاؤه وتضاعفت آلامه وسببه الاضطراب الذاتي وعدم موافقة الاختيار الذي تطلبه ربانيته المودعة فيه التي قيل له اخرج عنها فما فعل والحركة القسرية هي أن يعرج به فيرى من الآيات والفرح والانفساحات والتنزه على قدر ما علت به تلك الحركة القسرية التي أخرجته عن طبعه واضطراره ووافقته في اختياره فلا تفرح بكل ما يقتضيه الطبع فإنه أيضا ما قبل الحركة القسرية إلا بطبعه فالطبع لا يفارقه حكمه في الحركتين‏\n\n\n### [أن الذاتي لا يتغير]\n\n\nواعلم أن الصفات التي جبل عليها الإنسان لا تتبدل فإنها ذاتية له في هذه النشأة الدنيا والمزاج الخاص من الجبن والشح والحسد والحرص والنميمة والتكبر والغلظة وطلب القهر وأمثال هذا ولما لم يتجه تبدلها بين الله لها مصارف صرفها إليها حكما مشروعا فإن صرفت إليها أحكام هذه الصفات سعدت ونالت الدرجات فجبنت عن إتيان المحارم لما تتوقعه من المضرة وشحت بدينها وحسدت منفق المال وطالب العلم وحرصت على الخير وسعت بين الناس بإيصال الخير فنمت به كما تنم الروضة بما فيها من الأزهار الطيبة الريح وتكبرت بالله على من تكبر على أمر الله وأغلظت القول والفعل في المواطن التي تعلم أن ذلك في مرضاة الله وطلبت القهر على من ناوى الحق وقاواه فلم تزل هذه النفس عن صفاتها وصرفتها في المصارف التي يحمدها عليها ربها وملائكته ورسله فالشرع ما جاء إلا بما يساعده الطبع فلا أدري من أين ينال الإنسان المشقة وما حجر عليه ما يقتضيه طبعه من هذه الصفات بتبيين المصارف فما هلك الناس إلا بسلطان الأغراض فإنه الذي أدخل الألم عليهم والمكروه فلو أن الإنسان يصرف غرضه إلى ما أراده له خالقه لاستراح قيل لأبي يزيد ما تريد قال أريد أن لا أريد أي اجعلني مريد الكل ما تريد حتى لا يكون إلا ما يريد الحق سبحانه فما يريد بعباده إلا اليسر ولا يريد بهم العسر ويريد لهم الخير وليس إليه الشر كما\n\n\nورد في الخبر الصحيح والخير كله في يديك والشر ليس إليك‏\n\n\nوإن كان الكل من عند الله بحكم الأصل ولما كان خروج الإنسان عن إن يكون مريدا محالا وإنه أول ما كان يقدح ذلك في الطاعات فيفعلها من غير نية مشروعة فلا تكون طاعة وإنما طلب أبو يزيد الخروج عن الأغراض النفسية التي لا توافق مرضاة الحق عز وجل‏\n\n\n### [المشي في الظلمة بغير سراج وضوء طريق إلى المهالك‏]\n\n\nواعلم أن المشي في الظلمة بغير سراج وضوء في طريق كثيرة المهالك والحفر والأوحال والمهاوي والحشرات المؤذية التي لا يتقى شي‏ء من هذا كله إلا أن يكون الماشي فيها بضوء يرى به حيث يجعل قدمه ويجتنب به ما ينبغي أن يجتنب مما يضره من مهواة يهوى فيها أو مهلك يحصل فيه أو حية تلدغه وليس له ضوء سوى نور الشرع الذي قال فيه تعالى نُوراً نَهْدِي به من نَشاءُ من عِبادِنا وقال ومن لَمْ يَجْعَلِ الله لَهُ نُوراً فَما لَهُ من نُورٍ وقال نُورٌ عَلى‏ نُورٍ فإذا اجتمع نور الشرع مع نور بصر التوفيق والهداية بان الطريق بالنورين فلو كان نور واحد لما ظهر له ضوء ولا شك أن نور الشرع قد ظهر كظهور نور الشمس ولكن الأعمى لا يبصره كذلك من أعمى الله بصيرته لم يدركه فلم يؤمن به ولو كان نور عين البصيرة موجودا ولم يظهر للشرع نور بحيث أن يجتمع النوران فيحدث الضوء في الطريق لما رأى صاحب نور البصيرة كيف يسلك لأنه في طريق مجهولة لا يعرف ما فيها ولا أين تنتهي به من غير دليل وموقف فهذا الشخص الماشي في هذه الطريق إن لم يحفظ سراجه من الأهواء إن تطفئه بهبوبها وإلا هبت عليه رياح زعازع فأطفأت سراجه وذهب نوره وهو كل ريح يؤثر في نور توحيده وإيمانه فإن هبت ريح لينة تميل لسان سراجه وتحيره حتى‏\nيتحير عليه الضوء في مشاهدة للطريق فتلك الريح كمتابعة الهوى في فروع الشريعة وهي المعاصي التي لا يكفر بها الإنسان ولا تقدح في توحيده وإيمانه فلقد خلقنا لأمر عظيم ولكن إذا اقتحمنا هذه الشدائد وقاسينا هذه المكاره حصلنا على أمر عظيم وهو سعادة الأبد التي لا شقاء فيها\n\n\n### [المشي على طريق المستقيم‏]\n\n\nومما يتضمن هذا المنزل علم الوقت الذي يصحبه فيه القرينان من الملك والشيطان فاعلم إن الإنسان إذا خلقه الله في أمة لم يبعث فيها رسول لم يقترن به ملك ولا شيطان ويبقى يتصرف بحكم طبعه ناصيته بيد ربه خاصة فكل ما يمشي فيه في ذلك الوقت فهو على صراط مستقيم فإن ربه على صراط مستقيم قال تعالى ما من دَابَّةٍ إِلَّا هُوَ آخِذٌ بِناصِيَتِها إِنَّ رَبِّي عَلى‏ صِراطٍ مُسْتَقِيمٍ فإذا بعث فيهم رسول أو خلق في أمة فيهم رسول لزمه من حين ولادته قرينان ملك وشيطان من حين يولد لأجل وجود الشرع وأعطى كل واحد من القرينين لمة يهمزه ويقبضه بها ولا تقل إن المولود غير مكلف فلما ذا يقرن به هذان القرينان‏\n\n\n### [إن الله ما جعل ملك وشيطان في حق المولود]\n\n\nفاعلم إن الله ما جعل له هذين القرينين في حق المولود وإنما ذلك من أجل مرتبة والديه أو من كان فيهمزه القرين الشيطاني فيبكي أو يلعب بيده فيفسد شيئا مما يكره فساده أبوه أو غيره فتكون تلك الحركة من المولود الغير مكلف سببا مثيرا في الغير ضجرا وتسخطا كراهة لفعل الله فيتعلق به الإثم فلهذا يقرن به الشيطان لا لنفسه وكذلك الملك وهو كل حركة تطرأ من المولود مما تثير في نفس الغير أمرا موجبا للشر أو للخير فإن كان شرا فمن الشيطان وإن كان خيرا فمن الملك وليس للصبي الصغير قط حركة نفسية ولا ربانية حتى يدرك وإن لم يكن في أمه لها شرع فحركته كلها نفسية من حال ولادته إلى أن يموت ما لم يرسل إليه رسول أو يدخل هو في دين إلهي يتقيد به أي دين كان مشروعا من الله أو غير مشروع حينئذ يوكل به القرينان إذ لم يكن للعقل أن يشرع القربات وإن كان على مكارم الأخلاق المعتادة في العرف المحبوبة بالطبع التي يدركها العقل ولكن لا يحكم عليها بحكم أصلا يقطع به على الله وليس له حكم في إثبات الآخرة ولا نفيها لكن هو متمكن بعقله من النظر في إثبات موجدة ولمن يستند في وجوده وما ينبغي أن يكون عليه موجدة من الصفات وما ينبغي أن يعظه به من نعوت الجلال لكن لا على جهة المنزلة الأخراوية عنده ولا يعرف بعقله ما يصير إليه بعد الموت ولا يدري هذا المدبر لبدنه ما هو ولا أين يذهب من الميت إذا مات ولو لا إن الأمر من آدم كان ابتداؤه بالنبوة فأخبر بما هنالك ففطنت العقول حيث أعلمت مال هذه النفوس فذلك الذي حرضها على البحث والنظر في ذلك وحشر النفوس بعد الموت إلى أين يكون وكيف يجمع وصورة ما ينتقل به وإليه وهل تنتقل مدبرة لمواد أخر أو تتجرد عن المادة وهل كان لها وجود قبل تسوية البدن في التكوين أم حدثت بحدوث البدن ووقفوا على حكم تأثيرات في العالم فراقبوا الأفلاك وحركات الكواكب ورأوا حدوث الآثار عند تلك الحركات عن تكرار فعلموا إن ثم نسبة بين هذا الأثر وتلك الحركات وأما ما لم تدرك الأعمار تكراره فذلك بإعلام النبي عليه السلام الذي كان في زمانهم أتاهم بما أعلمه الله وأطلعه على ما اختزنه في تلك الحركات العلوية من الآثار العنصرية وأعلمهم حكمها في الدنيا والآخرة وليس مثل هذا كله من مدركات العقول من غير موقف فلو لا التعريف الإلهي في هذه الدار والدار الآخرة ما عرف أحد شيئا مما هنالك‏\n\n\n### [أن كل مخلوق على فطرتهم يعظمون الحق‏]\n\n\nواعلم أن كل مخلوق ما سوى الإنس والجان مفطورون على تعظيم الحق والتسبيح بحمده وكذلك أعضاء جسد الإنس والجان كلها ولكن لا على جهة التقريب وابتغاء المنزلة العظمى بل التسبيح لهم كالأنفاس في المتنفسين لما تستحقه الذات وهكذا يكون تسبيح الإنس والجان في الجنة والنار لا على طريق القربة ولا ينتج لهم قربة بل كل واحد منهم على مقام معلوم فتصير العبادة طبيعية تقتضيها حقائقهم ويرتفع التكليف ولا يتصور منهم مخالفة لأمر الله إذا ورد عليهم ولا يبقى هنالك نهي أصلا بعد قوله لأهل النار اخْسَؤُا فِيها ولا تُكَلِّمُونِ وكلامنا إذا نزل الناس منازلهم في كل دار وغلقت الأبواب واستقرت الداران بأهلها الذين هم أهلها وارتفع شأن أرض الحشر وعادت كلها نارا وصار كل ما تحت مقعر فلك الكواكب الثابتة إلى منتهى أسفل سافلين دارا واحدة تسمى جهنم تحوي على حرور وزمهرير وبينهما برازخ يكون فيها التكوينات في الجلود التي يقع فيها التبديل عند الإنضاج خالِدِينَ فِيها ما دامَتِ السَّماواتُ والْأَرْضُ يريد المدة التي كانت الأرض عليها من يوم خلقها الله إلى يوم التبديل وكانت العرب التي نزل القرآن بلسانها تطلق هذه‏\nاللفظة ونريد بها التأييد وهي منقطعة بالخبر الإلهي وتعريف النبي صلى الله عليه وسلم إِلَّا ما شاءَ رَبُّكَ بما يرزقون في النار من اللذة والنعيم بها إِنَّ رَبَّكَ فَعَّالٌ لِما يُرِيدُ وفي الجنة خالِدِينَ فِيها ما دامَتِ السَّماواتُ والْأَرْضُ من حيث جوهرهما لا من حيث صورتهما ولهذا قال عَطاءً غَيْرَ مَجْذُوذٍ أي غير مقطوع ويقع الاستثناء في قوله إِلَّا ما شاءَ رَبُّكَ من زوال صورتهما إذ كانت السماء سماء والأرض أرضا فإنا نعلم أن جوهر السماء هو جوهر الدخان وتبدلت عليه الصور فالجوهر الذي قبل صورة الدخان هو الذي قبل صورة السماء كما قبل جوهر الطين والحجر صورة البيت فإذا تهدم البيت ويبس الطين ذهبت صورة البيت والطين وبقي عين الجوهر وكذلك العالم كله بالجوهر واحد وبالصور يختلف فاعلم ذلك فيكون الاستثناء في حق أهل النار لمدة عذابهم ويكون الاستثناء في حق أهل الجنة على معنى إلا أن يشاء ربك وقد شاء أن لا يخرجهم فهم لا يخرجون فإن الله ما شاء ذلك بقوله عَطاءً غَيْرَ مَجْذُوذٍ ولم يقل في أهل النار عذابا غير مجذوذ فافهم فإن الخبر الصحيح المتواتر قد ورد فقال تعالى يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ والسَّماواتُ ووصف السماء بأنها تصير كالدهان ووصفها بالانشقاق وإنها تمور وقال تعالى فَكانَتْ وَرْدَةً كَالدِّهانِ أي مثل الدهن الأحمر في اللون والسيلان فهذا كله إخبار عن ذهاب الصورة لا ذهاب الجوهر ومما يتضمن هذا المنزل علم ما أراد الله من الإنسان أن يشتغل به في حال اعتباره وتفكره لما يؤديه ذلك النظر إليه من المعرفة بخالقه لا بربه فإنه لكل اسم من أسماء الله في العالم دليل خاص لا يدل على غيره من حيث هو دليل عليه ومن هنا تعلم أن الأرض خلقت من تموج الماء حتى أزبد فكان ذلك الزبد عين الأرض لأنه انتقل من المائية إلى الزبدية وفي الزبد يكون الأرض وهذا هو السبب في اختراق الصالحين لها وجلوس الميت في قبره مع ردم الأرض عليه وحكم كل ما خلق منها حكمها وحكمها حكم الزبد وحكم الزبد حكم الماء والماء يقبل الخرق وتحرك الأشياء فيه فيجري حكم هذا الأصل في جميع ما وجد عنه سواء كثف كالأرض أو سخف كالهواء والنار لكن النار للماء بمنزلة ولد الولد والأرض للماء بمنزلة الولد والهواء والزبد للماء بمنزلة أولاد الصلب فالماء لهما أب وهو للنار جد من جهة الهواء وللأرض جد من جهة الزبد فبين خلق آدم والماء وجود التراب الزبد فهو ولد ولد الولد من حيث كثافته وكذلك بما فيه من النار وبما فيه من الهواء هو ولد الولد وأما خلق حواء فبينها وبين الأصل ثلاثة آدم والتراب والزبد فهي أبعد من الأصل وأما خلق بنى آدم فهم أقرب إلى الأصل من آدم فإنهم مخلوقون من الماء فهم من الماء مثل الزبد فهم أولاد الماء لصلبه والزبد أخ لبني آدم وهو جد لآدم وأب للأرض فبنو آدم أعمام للأرض فتكون منزلة آدم من بنيه منزلة ابن الأخ من عم أبيه ويكون بنو آدم من آدم بمنزلة عم أبيه فهم أولاده وهو ولد ابن أخيهم فهم في الإسناد من هذا الوجه أقرب إلى السبب الأول وهو الجد الأعلى إلا بما في آدم من الماء الذي صار به التراب طينا ففيه إلحاق بولد الصلب بمنزلة من نكح امرأة وهي حامل من غيره فسقى زرع غيره فله فيه بما حصل له من ذلك السقي نصيب وأما خلق عيسى عليه السلام فبينه وبين الماء أمه وحواء وآدم والأرض والزبد إلا من وجه آخر فهو يشبهنا وقليل من يعثر عليه وقد نبه الله على ما أومأنا إليه بقوله فَتَمَثَّلَ لَها بَشَراً سَوِيًّا لما أراد الله فسرت اللذة بالنظر إليه بعد ما استعاذت منه وعرفها أنه رسول الحق ليهب لها غلاما زكيا فتأهبت لقبول الولد فسرت فيها لذة النكاح بمجرد النظر فنزل الماء منها إلى الرحم فتكون جسم عيسى من ذلك الماء المتولد عن النفخ الموجب للذة فيها فهو من ماء أمه وينكر ذلك الطبيعيون ويقولون إنه لا يتكون من ماء المرأة شي‏ء وذلك ليس بصحيح وهو عندنا إن الإنسان يتكون من ماء الرجل ومن ماء المرأة وقد ثبت عن النبي صلى الله عليه وسلم الذي لا ينطق عن الهوى أنه قال إذا علا ماء الرجل ماء المرأة أذكرا وإذا علا ماء المرأة ماء الرجل أنثا وفي رواية سبق بدل علا\n\n\nفقد جاء بالضمير المثنى في أذكرا وأنثا وقد قلنا في كتاب النكاح لنا في هذا الفصل إن المرأة والرجل إذا لم يسبق أحدهما صاحبه في إنزال الماء وأنزلا معا بحيث أن يختلطا ولا يعلو أحد الماءين على الآخر فإنه من أجل تلك الحالة إذا وقعت على تلك الصورة يخلق الله الخنثى فيجمع بين الذكورة والأنوثة فإن كانا على السواء من جميع الجهات والاعتدال من غير انحراف ماء من أحدهما كان الخنثى يحيض من فرجه ويمني من ذكره فيعطي الولد ويقبل الولد ممن ينكحه وقد روى أنه رؤي رجل ومعه ولدان أحدهما من صلبه والآخر من بطنه وإن انحرف الماء عن الاعتدال‏\nولم يبلغ مبلغ العلو على الآخر كان الحكم للمنحرف إلى العلو فإن كان ماء المرأة حاض الخنثى ولم يمن وإن كان ماء الرجل أمنى ولم يحض فسبحان القدير الخلاق العليم وهذا من أعجب البرازخ في الحيوان ذلك لِتَعْلَمُوا أَنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ وأَنَّ الله قَدْ أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً ويكفي علم هذا القدر من هذا المنزل فإنه يتضمن مسائل كثيرة أكثرها في تولد العالم الطبيعي بين حركات الأفلاك وتوجهاتها وتوجهات كواكبها بأشعة النور وبين قبول العناصر والمولدات لآثار تلك الأنوار فيظهر من تلك الأحكام إيجاد الأعيان والمراتب والأحوال وهذا علم كبير طويل ويتعلق بهذا المنزل علم الابتلاء في\n\n\nغير موطن التكليف ويتضمن علم الديوان الإلهي ويتضمن علم وجوب الكلمة الإلهية التي لا تتبدل ويتضمن علم أنه ما في العالم باطل ولا عبث وإنه حق كله بما فيه من الحق والباطل ويتضمن لما ذا أخر الله غالبا العقوبات إلى الدار الآخرة في حق الأكثرين وعجلها في حق آخرين وهو المعبر عنه بإنفاذ الوعيد وهو خبر والخبر الذي لا يتضمن حكما لا يدخله النسخ فقد ينفذ ما أوعد به لمن خالفه لأنه لم يخص بإنفاذه دارا من دار بل قال في الدنيا لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا وهو من جملة إنفاذ الوعيد فالذاهبون إلى القول بإنفاذ الوعيد مصيبون ولكن إنفاذه حيث يعينه الحق تعالى فإذا أنفذه في الدنيا بمرض وألم نفسي أو حسي يدخله على هذا المستحق بالوعيد كان ذلك سترا له عن عقوبة الآخرة فهو المعبر عن ذلك هنا بالمغفرة أي لا يؤاخذ بها في الآخرة وهذه أحوال أكثر السعداء والسعداء الذين لا تهمهم النار ولا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ الذين فَلا خَوْفٌ عَلَيْهِمْ ولا هُمْ يَحْزَنُونَ ولهذا عظم ابتلاء النفوس والبلاء المحسوس في الأمثال من الناس كالأنبياء والَّذِينَ يَأْمُرُونَ بِالْقِسْطِ من النَّاسِ من رد الحق في وجوههم وما يسمعون من الكفرة مما يتأذون به في نفوسهم وقد أخبر الله بذلك وكذلك ما سلط عليهم من القتل والضرب كل ذلك من إنفاذ الوعيد لخطرات وحركات تقتضيها البشرية والطبع مما لا يليق بالمنصب الذي هم فيه لكن هو لائق بالبشر ومن هنا يعرف قول الله تعالى لرسوله صلى الله عليه وسلم لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ فقد قرر الذنب وأوقع المغفرة وأفهم من ذلك عباده أنه لا يعاقبهم في الآخرة وما علق المغفرة بالدنيا لما فيها من الآلام والأمراض النفسية والحسية وهو عين إنفاذ الوعيد في حقهم ويصح قول المعتزلي في هذه المسألة مسألة إيلام البري‏ء فإن الأشعري يجوز ذلك على الله ولكن ما كل جائز واقع وكل ما يحتجون به على المعتزلة فليس هو بذلك الطائل والانفصال عنه سهل وليس هذا الكتاب موضع إيراد هذا العلم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "The blossoms of Gnosis (*Ma'rifa*) are from the blossoms of spiritual disciplines (*Riyadat*),\nAnd the blossoms of your garden are from the blossoms of the heavens.\n\nFor bodies there are sciences that the science of souls does not resemble,\nDue to causes and defects (*afat*).\n\nThe Realities of the Real (*Haqa'iq al-Haqq*) are not hidden in their perceptions,\nBecause their apprehension of the Essence (*al-Dhat*) is by the Essence.\n\nAnd what is other than them is apprehension through an intermediary,\nBy means of the signs (*a'lam*) and verses (*ayat*) that one sees.\n\nThe jesting of the great ones is seriousness derived from witnessing (*shuhud*),\nWithin which, for them, is concealed the subtlety of miraculous gifts (*karamat*).\n\nTheir granting of respite is not negligence, due to their knowledge\nThat this is bound to specific times (*awqat*).\n\nIndeed, men, even if you verify their lineage\nTo a single father, are children of different mothers (*awlad 'allat*).\nIf you say they are, they are; or if you say they are not, they are not,\nBecause they exist between pains and pleasures.\n\nBecause their manifestations do not annihilate them,\nAnd these manifestations are what are expressed as veils (*sitarat*).\n\n### [The Science of Departing from Nature]\n\nKnow, may Allah grant you success, that our Shaykh Abu al-Abbas al-Uraybi was among those who realized this station (*manzil*). We discussed it with him repeatedly, and his footing in it was firm, may Allah have mercy on him. Know that this station combines intense hardship and matters that are only attained through severe coercion (*qahr shadid*) and defects (*afat*) that prevent the attainment of the desired goal, alongside gentleness, the removal of defects, and the attainment of the desired goal through delightful comfort beloved by the souls. Between these two qualities are tremendous difficulties.\n\nThe first science contained within this station is the science of departing from nature (*al-khuruj 'an al-tab'*). Know that movements are either natural (*tabi'iyya*) or coercive (*qasriyya*). Do not imagine that natural movement always gives pleasure and coercive movement always gives pain because you are departing from nature. The matter may be so, or it may be the opposite.\n\nIf a person falls from a great height, his descent to the earth is a natural movement, but when he reaches the earth, his limbs may break and his pains multiply. The cause of this is intrinsic agitation (*al-idhtirab al-dhati*) and the lack of conformity with the choice demanded by the Divine Lordship (*rubbaniyya*) deposited within him, which he was told to abandon but did not.\n\nCoercive movement is when he is ascended, and he sees signs (*ayat*), joy, expansion, and delight, commensurate with the height to which that coercive movement—which removed him from his nature and necessity (*idhtirar*) and agreed with his choice—carried him. Therefore, do not rejoice in everything that nature dictates, for nature only accepted the coercive movement also by its own nature. The ruling of nature never leaves it in either movement.\n\n### [That which is Intrinsic does not Change]\n\nKnow that the attributes upon which man was created do not change, for they are intrinsic (*dhatiyya*) to him in this worldly existence (*nash'a*). This includes the specific temperament (*mizaj*) of cowardice, stinginess, envy, greed, tale-bearing, arrogance, harshness, and the desire for domination (*qahr*), and similar traits. Since their change was not intended, Allah clarified the channels (*masarif*) to which these attributes should be directed as a prescribed ruling (*hukm mashru'a*). If the rulings of these attributes are directed to those channels, the person is felicitous and attains high degrees (*darajat*).\n\nHe becomes cowardly about committing forbidden acts due to the harm he anticipates; he becomes stingy with his religion; he envies the spender of wealth and the seeker of knowledge; he is greedy for good; he walks among people by conveying good, thus growing through it, just as a garden grows through the sweet-smelling flowers within it. He becomes arrogant through Allah against those who are arrogant toward the command of Allah; he uses harsh words and actions in situations where he knows that is pleasing to Allah; and he seeks domination over those who oppose the Real (*al-Haqq*) and resist it.\n\nThus, this soul has not departed from its attributes, but has directed them into channels for which its Lord, His angels, and His messengers praise it. The Law (*al-Shar'*) only came with what nature assists. I do not know from where man attains hardship, since what his nature dictates regarding these attributes was not restricted, but rather its channels were clarified. People were only destroyed by the dominion of personal desires (*sultan al-aghrad*), for it is what introduced pain and dislike upon them.\n\nIf man were to direct his desire (*gharad*) toward what his Creator willed for him, he would find rest. Abu Yazid was asked, \"What do you desire?\" He replied, \"I desire not to desire.\" Meaning: Make me the one who wills everything You will, so that nothing exists except what the Real (al-Haqq), Glory be to Him, wills. He wills nothing for His servants except ease, and He does not will hardship for them. He wills good for them, and evil is not attributed to Him, as stated in the authentic report: \"All good is in Your hands, and evil is not attributed to You.\"\n\nEven though everything originates from Allah by virtue of the Principle (*hukm al-asl*), since it is impossible for man to cease being a wilful agent (*murid*), the first thing that would be impaired is acts of obedience, which he would perform without a prescribed intention (*niyya mashru'a*), thus rendering them not obedience. Rather, Abu Yazid sought to depart from the egoistic desires (*al-aghrad al-nafsiyya*) that do not conform to the pleasure of the Real, Almighty and Majestic.\n\n### [Walking in Darkness Without a Lamp and Light is a Path to Destruction]\n\nKnow that walking in darkness without a lamp and light on a path full of dangers, pits, mud, abysses, and harmful insects—none of this can be avoided unless the walker has a light by which he sees where to place his foot and avoids what should be avoided, such as a pit he might fall into, a place of destruction he might enter, or a snake that might bite him.\n\nHe has no light except the light of the Law (*Nur al-Shar'*) concerning which Allah the Exalted said: <<نُوراً نَهْدِي به من نَشاءُ من عِبادِنا>> (a light by which We guide whom We will of Our servants), and He said: <<ومن لَمْ يَجْعَلِ الله لَهُ نُوراً فَما لَهُ من نُورٍ>> (And for him to whom Allah has not granted light, there is no light), and He said: <<نُورٌ عَلى‏ نُورٍ>> (Light upon Light).\n\nWhen the light of the Law combines with the light of the eye of Divine Success and Guidance (*Nur Basar al-Tawfiq*), the path becomes clear through the two lights. If there were only one light, no illumination would appear. Undoubtedly, the light of the Law has appeared like the light of the sun, but the blind person does not see it. Likewise, he whose inner sight (*basira*) Allah has blinded does not perceive it and does not believe in it.\n\nEven if the light of the eye of inner sight were present, but the light of the Law did not appear so that the two lights could combine and produce illumination on the path, the possessor of the light of inner sight would not know how to proceed, because he is on an unknown path, unaware of what is in it or where it will lead him, without a guide or a stopping point.\n\nThis person walking on this path must guard his lamp from the whims (*ahwa'*) lest they extinguish it with their gusts. Otherwise, violent winds (*riyah za'azi'*) will blow upon him and extinguish his lamp, and his light will vanish. Every wind that affects the light of his Unity (*Tawhid*) and Faith (*Iman*) is such a danger. If a gentle wind blows, tilting the wick of his lamp and confusing him until the light becomes confused in his witnessing (*mushahada*) of the path, that wind is like following passion (*hawa*) in the branches of the Sacred Law—which are the acts of disobedience (*ma'asi*) that do not cause a person to become an unbeliever (*kafir*) or impair his Unity and Faith. Indeed, we were created for a great matter, but if we overcome these hardships and endure these adversities, we attain a great matter, which is eternal felicity (*sa'adat al-abad*) in which there is no misery.\n\n### [Walking on the Straight Path]\n\nAmong what this station includes is the knowledge of the time when the two companions (*al-qarinan*)—the angel and the devil—accompany man. Know that if Allah created man in a nation to which no messenger was sent, he is not accompanied by an angel or a devil. He remains acting according to the rule of his nature, his forelock held solely by his Lord. Everything he walks in during that time is upon a straight path, for his Lord is upon a straight path. Allah the Exalted said: <<ما من دَابَّةٍ إِلَّا هُوَ آخِذٌ بِناصِيَتِها إِنَّ رَبِّي عَلى‏ صِراطٍ مُسْتَقِيمٍ>> (There is no creature but He holds it by its forelock. Indeed, my Lord is upon a straight path).\n\nIf a messenger is sent to them, or if he is created in a nation where a messenger exists, he is accompanied from the moment of his birth by two companions: an angel and a devil, due to the existence of the Law (*al-Shar'*). Each of the two companions is given a *lamma* (a point of influence) by which he incites or restrains him. Do not say that the newborn is not accountable (*mukallaf*), so why are these two companions attached to him?\n\n### [Indeed, Allah did not Appoint an Angel and a Devil for the Newborn]\n\nKnow that Allah did not appoint these two companions for the newborn *for the newborn himself*, but rather for the sake of the rank of his parents or those around him. The satanic companion incites the infant, causing him to cry or play with his hand, thus spoiling something whose spoiling is disliked by his father or others. That movement from the non-accountable infant becomes a cause that provokes annoyance and discontent in the other person, a dislike of Allah's action, and thus sin attaches to that person. For this reason, the devil is attached to the infant, not for the infant himself.\n\nLikewise, the angel is attached for every movement that occurs from the infant that provokes in the soul of the other person something necessitating evil or good. If it is evil, it is from the devil; if it is good, it is from the angel. The young child has absolutely no psychic (*nafsiyya*) or Divine (*rabbaniyya*) movement until he reaches discernment. If his nation has no Law, all his movement is psychic, from the moment of his birth until he dies, unless a messenger is sent to him, or he enters into a Divine religion by which he is bound—whether that religion is prescribed by Allah or not prescribed.\n\nIt is at that point that the two companions are appointed to him, since the intellect (*al-'Aql*) cannot prescribe acts of proximity (*qurbat*), even if he adheres to the customary noble morals (*makarim al-akhlaq*) beloved by nature and perceived by the intellect. However, the intellect cannot issue a definitive ruling concerning Allah. It has no ruling regarding the affirmation or negation of the Hereafter (*al-Akhira*). But the intellect is capable of contemplating the affirmation of an Originator (*mujid*) and to Whom his existence is attributed, and what attributes of Majesty (*jalal*) should be ascribed to his Originator, but this is not in the sense of the station of the Hereafter (*al-manzila al-ukhrawiyya*) in his view.\n\nHe does not know by his intellect what he will become after death, nor does this manager of his body know what the soul is, or where it goes from the deceased when he dies. Were it not that the matter began with Adam through Prophecy (*Nubuwwa*), who informed them of what is there, the intellects would not have become aware when they were informed of the destiny of these souls. That is what incited them to research and contemplate that matter: where the souls are gathered after death, how they are gathered, the form of what they transition by and to, whether they transition as managers of other materials, or become stripped of matter, and whether they had existence before the body was formed in creation, or if they came into being with the body's coming into being.\n\nThey observed the ruling of influences in the world, monitored the celestial spheres (*aflak*), and the movements of the stars (*kawakib*). They saw the occurrence of effects (*athar*) following those movements through repetition, and thus knew that there is a relationship between that effect and those movements. As for what lifetimes could not perceive through repetition, that was through the information provided by the Prophet (peace be upon him) who was in their time, who brought them what Allah informed him of and revealed to him concerning what He had stored in those celestial movements of elemental effects (*al-athar al-'unsuriyya*), and informed them of their ruling in this world and the Hereafter. None of this is among the perceptions of the intellects without a standing point. Were it not for the Divine definition (*al-ta'rif al-ilahi*) regarding this abode and the Hereafter, no one would have known anything of what is there.\n\n### [That Every Creature by its Nature Glorifies the Real]\n\nKnow that every creature other than humans and jinn is created upon the natural disposition (*fitra*) of glorifying the Real (*al-Haqq*) and praising Him. Likewise, all the limbs of the bodies of humans and jinn [glorify Him], but not for the purpose of drawing near (*taqrib*) or seeking the highest station (*al-manzila al-'uzma*). Rather, glorification (*tasbih*) for them is like breathing for those who breathe, due to what the Essence (*al-Dhat*) deserves. This is how the glorification of humans and jinn will be in Paradise and Hell: not as a path to proximity (*qurba*), nor will it produce proximity for them. Rather, each of them is upon a known station (*maqam ma'lum*). Worship (*al-'ibada*) thus becomes natural, necessitated by their realities (*haqa'iq*). Accountability (*al-taklif*) is lifted, and disobedience to Allah's command is inconceivable when it reaches them. There remains absolutely no prohibition after His saying to the people of the Fire: <<اخْسَؤُا فِيها ولا تُكَلِّمُونِ>> (Remain despised therein, and do not speak to Me).\n\nOur discussion concerns when people have settled in their stations in each abode, the gates are closed, and the two abodes are established with their inhabitants who belong to them. The status of the Gathering Ground (*ard al-Hashr*) is elevated, and it all returns to fire. Everything beneath the concave of the sphere of the fixed stars down to the lowest of the low (*asfal safilin*) becomes a single abode called Hell (*Jahannam*), containing heat (*hurur*) and intense cold (*zamharir*), and between them are isthmuses (*barazikh*) where the formations occur in the skins that undergo replacement when they are cooked.\n\n<<خالِدِينَ فِيها ما دامَتِ السَّماواتُ والْأَرْضُ>> (Abiding therein as long as the heavens and the earth endure). This refers to the duration that the earth was upon, from the day Allah created it until the Day of Replacement (*al-tabdil*). The Arabs, in whose tongue the Quran was revealed, used this phrase intending perpetuity (*al-ta'yid*), but it is interrupted by the Divine report and the definition given by the Prophet (peace and blessings be upon him): <<إِلَّا ما شاءَ رَبُّكَ>> (Except what your Lord wills), concerning the pleasure and bliss they are provided with in the Fire, <<إِنَّ رَبَّكَ فَعَّالٌ لِما يُرِيدُ>> (Indeed, your Lord is the Doer of what He intends).\n\nAnd concerning Paradise: <<خالِدِينَ فِيها ما دامَتِ السَّماواتُ والْأَرْضُ>> (Abiding therein as long as the heavens and the earth endure), referring to their essence (*jawhar*) not their form (*sura*). For this reason, He said: <<عَطاءً غَيْرَ مَجْذُوذٍ>> (an unfailing gift), meaning uninterrupted. The exception in His saying <<إِلَّا ما شاءَ رَبُّكَ>> (Except what your Lord wills) applies to the cessation of their form, since the heaven was a heaven and the earth was an earth. We know that the essence of the heaven is the essence of smoke (*dukhān*), and the forms changed upon it. The essence that accepted the form of smoke is the same essence that accepted the form of heaven, just as the essence of clay and stone accepted the form of a house. When the house collapses and the clay dries, the form of the house and the clay vanishes, but the essence (*'ayn al-jawhar*) remains. Likewise, the entire cosmos (*al-'alam*) is one in essence but differs in forms. Understand this.\n\nThus, the exception applies to the people of the Fire for the duration of their torment, and the exception applies to the people of Paradise on the meaning of \"unless your Lord wills,\" and He has willed that He will not remove them, so they will not leave. For Allah did not will that, by His saying: <<عَطاءً غَيْرَ مَجْذُوذٍ>> (an unfailing gift). He did not say concerning the people of the Fire, \"an uninterrupted torment.\" Understand this. Indeed, the authentic, continuously transmitted report has come, and Allah the Exalted said: <<يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ والسَّماواتُ>> (The Day the earth will be replaced by another earth, and the heavens as well). He described the heaven as becoming like molten copper (*al-dihān*), and described it as splitting apart and surging. He the Exalted said: <<فَكانَتْ وَرْدَةً كَالْدِّهانِ>> (And it became rose-colored like molten copper), meaning like red oil in color and fluidity. All this is information about the disappearance of the form, not the disappearance of the essence (*jawhar*).\n\nAmong what this station includes is the knowledge of what Allah intended man to occupy himself with during his contemplation and reflection, because that contemplation leads him to the Gnosis (*Ma'rifa*) of his Creator, not his Lord. For every Name of Allah in the cosmos (*al-'alam*) there is a specific indicator (*dalil khass*) that does not indicate any other Name, insofar as it is an indicator for that Name.\n\nFrom this, you learn that the earth was created from the surging of water until it foamed (*azbada*). That foam (*al-zabad*) was the very essence of the earth, because it transitioned from wateriness (*al-ma'iyya*) to foaminess (*al-zabdiyya*), and the earth is found in the foam. This is the reason for the righteous penetrating it [the earth] and the deceased sitting in his grave despite the earth being filled in over him. The ruling of everything created from it is its ruling, and its ruling is the ruling of foam, and the ruling of foam is the ruling of water. Water accepts penetration, and things move within it. The ruling of this origin applies to everything that came into existence from it, whether it is dense like the earth or subtle like the air and fire.\n\nBut fire is to water like the child of the child, and the earth is to water like the child, and the air and foam are to water like the children of the loins (*awlad al-sulb*). Water is the father to them [air and foam], and it is the grandfather to fire through air, and the grandfather to earth through foam. Between the creation of Adam and water is the existence of the soil/foam. So Adam is the child of the child of the child, in terms of his density. Likewise, due to the fire and air within him, he is the child of the child.\n\nAs for the creation of Eve (*Hawwa'*), between her and the Origin (*al-Asl*) are three: Adam, soil, and foam. Thus, she is further from the Origin. As for the children of Adam (*Banu Adam*), they are closer to the Origin than Adam, for they are created from water. They are like foam from water, so they are the children of water from its loins. Foam is the brother of the children of Adam, and it is the grandfather of Adam and the father of the earth. Thus, the children of Adam are the paternal uncles of the earth. The station of Adam relative to his children is the station of the nephew relative to his paternal uncle's father. And the children of Adam relative to Adam are in the station of his paternal uncle's father. They are his children, and he is the child of their nephew. In terms of attribution, they are closer to the First Cause (*al-Sabab al-Awwal*), which is the Highest Grandfather, except for the water in Adam that turned the soil into clay. In this respect, he is attached to the child of the loins, like one who marries a pregnant woman and waters the seed of another. He has a share in it due to that watering.\n\nAs for the creation of Jesus (peace be upon him), between him and water are his mother, Eve, Adam, the earth, and the foam—except from another perspective. He resembles us, and few stumble upon this. Allah drew attention to what we have alluded to in His saying: <<فَتَمَثَّلَ لَها بَشَراً سَوِيًّا>> (Then he appeared to her as a man in all respects). When Allah willed it, pleasure flowed through her upon looking at him, after she sought refuge from him and he informed her that he was the messenger of the Real to grant her a pure boy. She prepared herself to receive the child. The pleasure of intercourse flowed through her merely by looking, and water descended from her to the womb. Thus, the body of Jesus was formed from that water generated by the blowing (*al-nafkh*) which caused pleasure in her. He is from his mother's water.\n\nNaturalists (*al-tabi'iyyun*) deny this, saying that nothing is formed from the woman's water, but that is incorrect. In our view, man is formed from the water of the man and the water of the woman. It is confirmed from the Prophet (peace and blessings be upon him), who does not speak from caprice, that he said: \"If the man's water prevails over the woman's water, the child is male (*adhkara*); and if the woman's water prevails over the man's water, the child is female (*anatha*).\" In one narration, \"precedes\" (*sabaqa*) is used instead of \"prevails\" (*'ala*).\n\nHe used the dual pronoun in *adhkara* (male) and *anatha* (female). We have stated in our Book of Marriage (*Kitab al-Nikah*) concerning this chapter that if neither the man nor the woman precedes the other in the emission of water, and they emit simultaneously such that they mix and neither water prevails over the other, then due to that state, if it occurs in that manner, Allah creates the hermaphrodite (*al-khuntha*), combining masculinity and femininity. If they are equal in all respects and balanced without any deviation of water from either of them, the hermaphrodite menstruates from its female organ and emits semen from its male organ. It can give birth and accept a child from whomever it marries. It is narrated that a man was seen with two children, one from his loins and the other from his belly. If the water deviates from balance but does not reach the level of prevailing over the other, the ruling belongs to the one that deviated toward prevalence. If it was the woman's water, the hermaphrodite menstruates but does not emit semen. If it was the man's water, it emits semen but does not menstruate. Glory be to the All-Powerful, the Creator, the All-Knowing! This is one of the most wondrous isthmuses (*barazikh*) in the animal kingdom. That is <<لِتَعْلَمُوا أَنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ وأَنَّ الله قَدْ أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً>> (so that you may know that Allah is over all things competent, and that Allah has encompassed all things in knowledge).\n\nKnowledge of this much suffices for this station, for it includes many issues, most of which concern the generation of the natural world (*al-'alam al-tabi'i*) between the movements and orientations of the celestial spheres (*aflak*) and the orientations of their stars with rays of light, and the acceptance of the elements (*'anasir*) and generated things (*muwalladat*) of the effects of those lights. From these rulings appears the creation of the Fixed Entities (*al-A'yan*), the Levels (*al-Maratib*), and the States (*al-Ahwal*). This is a great and lengthy science.\n\nRelated to this station is the science of trial (*al-ibtilā'*) in a place other than the locus of accountability (*mawtin al-taklif*). It includes the science of the Divine Register (*al-Diwan al-Ilahi*). It includes the science of the necessity of the Divine Word (*al-Kalima al-Ilahiyya*) which does not change. It includes the science that there is nothing false (*batil*) or frivolous (*'abath*) in the cosmos, but that it is all Real (*Haqq*), including the Real and the false within it.\n\nIt includes the reason why Allah generally postpones punishments until the Hereafter for the majority, and hastens them for others. This is expressed as the execution of the threat (*infadh al-wa'id*). This is a report (*khabar*), and a report that does not contain a ruling is not subject to abrogation (*naskh*). He may execute what He threatened against those who disobeyed Him, because He did not specify one abode over another for its execution. Rather, He said concerning this world: <<لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا>> (That He may let them taste part of [the consequence of] what they have done), and this is part of the execution of the threat.\n\nThose who hold the view of the execution of the threat are correct, but its execution occurs where the Real (al-Haqq) the Exalted specifies it. If He executes it in this world through illness, or psychological or physical pain that He inflicts upon the one deserving the threat, that serves as a covering (*sitr*) for him from the punishment of the Hereafter. This is what is expressed here as forgiveness (*maghfira*), meaning he will not be held accountable for it in the Hereafter. These are the states of most of the felicitous (*su'ada'*), those felicitous ones whom the Fire does not concern, and <<ولا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ>> (nor will the Great Terror grieve them), those concerning whom <<فَلا خَوْفٌ عَلَيْهِمْ ولا هُمْ يَحْزَنُونَ>> (there will be no fear concerning them, nor will they grieve).\n\nFor this reason, the trial (*ibtilā'*) of the souls and the perceptible affliction (*al-balā' al-mahsūs*) was great among the exemplary people, such as the Prophets and <<الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ من النَّاسِ>> (those who enjoin justice among the people), due to the rejection of the Real (*al-Haqq*) in their faces and what they hear from the unbelievers that causes them psychological harm. Allah has informed us of this, as well as the killing and beating inflicted upon them. All of this is part of the execution of the threat for the passing thoughts (*khatarat*) and movements necessitated by humanity (*al-bashariyya*) and nature (*al-tab'*) that are unfitting for the station they hold, though fitting for human beings.\n\nFrom this, one understands the saying of Allah the Exalted to His Messenger (peace and blessings be upon him): <<لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ>> (That Allah may forgive you your sin that preceded and that which will follow). He confirmed the sin (*dhanb*) and enacted the forgiveness (*maghfira*). By this, He made His servants understand that He will not punish them in the Hereafter. He did not link the forgiveness to this world, due to the psychological and physical pains and illnesses within it, which is the very execution of the threat in their regard. The saying of the Mu'tazili concerning the issue of inflicting pain upon the innocent (*īlām al-barī'*) is valid in this matter. The Ash'ari permits this concerning Allah, but not everything permissible is actualized. All that they use to argue against the Mu'tazila is not of great substance, and separating from it is easy. This book is not the place to introduce this science. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو اٹھانوے: عالم علوی میں ذکر کے منزل کی معرفت، *الحضرۃ المحمدیۃ* (الحضرة المحمدية) میں۔\n\nمعرفت کے پھول ریاضتوں کے پھولوں سے ہیں،\nاور تیرے باغ کے پھول آسمانوں کے پھولوں سے ہیں۔\n\nپس اجسام کے لیے ایسے علوم ہیں جو نفوس کے علوم سے مشابہت نہیں رکھتے،\nاسباب اور آفات کی وجہ سے۔\n\n*الحق* (الحق) کی حقیقتیں ان کے ادراک سے پوشیدہ نہیں ہوتیں،\nکیونکہ ان کا ادراک *الذات* (ذات) کے ذریعے *الذات* (ذات) کو ہوتا ہے۔\n\nاور جو کچھ اس کے سوا ہے، اس کا ادراک واسطے سے ہوتا ہے،\nان نشانیوں اور آیات کے ذریعے جو وہ دیکھتا ہے۔\n\nبزرگوں کا مذاق بھی *مشاہدہ* (مشاهدة) کی رو سے سنجیدہ ہوتا ہے،\nجس کے اندر ان کے نزدیک کرامات کی تدبیر پوشیدہ ہوتی ہے۔\n\nان کی مہلت دینا غفلت نہیں ہے،\nکیونکہ وہ جانتے ہیں کہ یہ (معاملہ) اوقات کے ساتھ مربوط ہے۔\n\nبے شک مرد، اگرچہ ان کی نسبت ایک ہی باپ سے ثابت ہو، وہ سوتیلی ماؤں کی اولاد ہیں۔\nاگر تم کہو کہ وہ ہیں، تو وہ ہیں، یا اگر تم کہو کہ وہ نہیں ہیں، تو وہ نہیں ہیں،\nکیونکہ وہ دکھوں اور لذتوں کے درمیان ہیں۔\n\nکیونکہ ان کے مظاہر انہیں فنا نہیں کرتے،\nاور یہی وہ ہیں جنہیں پردوں (ستارات) سے تعبیر کیا جاتا ہے۔\n\n### [طبع سے خروج کا علم]\n\nجان لو، اللہ تمہیں توفیق دے، کہ ہمارے شیخ ابو العباس العریبی ان لوگوں میں سے تھے جنہوں نے اس منزل میں *تحقق* (تحقق) حاصل کیا، اور ہم نے ان سے اس بارے میں کئی بار گفتگو کی، پس اللہ ان پر رحم کرے، اس میں ان کا قدم راسخ تھا۔ اور جان لو کہ یہ منزل شدید مشقت اور ان امور کے درمیان جمع ہے جو صرف سخت قہر اور مطلوب کے ادراک سے مانع آفات کے ذریعے حاصل ہوتے ہیں، اور نرمی، آفات کے رفع ہونے، اور نفوس کو محبوب و لذیذ راحت کے ساتھ مطلوب تک پہنچنے کے درمیان ہے۔ اور ان دونوں صفات کے درمیان عظیم سختیاں ہیں۔ پس پہلا علم جو اس منزل میں شامل ہے وہ طبع سے خروج کا علم ہے۔\n\nپس جان لو کہ حرکات میں سے کچھ طبعی ہوتی ہیں اور کچھ قسری (جبری)۔ یہ خیال نہ کرو کہ طبعی حرکت لذت دیتی ہے اور قسری حرکت درد دیتی ہے، کیونکہ تمہارا طبع سے خروج ہو رہا ہے۔ ہو سکتا ہے معاملہ ایسا ہو، اور ہو سکتا ہے اس کے برعکس ہو۔ اگر انسان کسی عظیم بلندی سے گرے، تو اس کا زمین کی طرف نزول طبعی حرکت کے ذریعے ہو گا، لیکن جب وہ زمین پر پہنچتا ہے تو شاید اس کے اعضاء ٹوٹ جائیں اور اس کے درد دوچند ہو جائیں۔ اور اس کا سبب ذاتی اضطراب ہے اور اس اختیار کی عدم موافقت ہے جسے اس کی ربانیتِ ودیعت طلب کرتی ہے، جس کے بارے میں اسے کہا گیا تھا کہ اس سے باہر نکل، مگر اس نے ایسا نہیں کیا۔ اور قسری حرکت یہ ہے کہ اسے اوپر چڑھایا جائے، تو وہ آیات، خوشی، کشادگی اور سیر و تفریح دیکھے، اس مقدار کے مطابق جس قدر اس قسری حرکت نے اسے اوپر اٹھایا جس نے اسے اس کے طبع اور اضطرار سے باہر نکالا اور اس کے اختیار میں اس کی موافقت کی۔ پس ہر اس چیز پر خوش نہ ہو جو طبع کا تقاضا ہو، کیونکہ اس نے قسری حرکت کو بھی اپنے طبع کے ذریعے ہی قبول کیا ہے۔ پس طبع دونوں حرکتوں میں اپنے حکم سے جدا نہیں ہوتا۔\n\n### [ذاتی چیزیں تبدیل نہیں ہوتیں]\n\nاور جان لو کہ وہ صفات جن پر انسان کو پیدا کیا گیا ہے، وہ تبدیل نہیں ہوتیں، کیونکہ وہ اس نشأۃِ دنیا میں اس کے لیے ذاتی ہیں۔ اور خاص مزاج جیسے بزدلی، بخل، حسد، حرص، چغل خوری، تکبر، سختی، اور قہر کی طلب اور اس جیسی چیزیں۔ اور چونکہ ان کا تبدیل ہونا ممکن نہ تھا، اللہ نے ان کے لیے ایسے مصارف (راستے) بیان کر دیے جن کی طرف انہیں شرعی حکم کے طور پر صرف کیا جائے۔ پس اگر ان صفات کے احکام کو ان مصارف کی طرف صرف کیا جائے تو وہ سعادت مند ہو گا اور درجات حاصل کرے گا۔ پس وہ محرمات کے ارتکاب سے بزدلی دکھائے گا، اس نقصان کے خوف سے جس کی وہ توقع کرتا ہے، اور اپنے دین کے معاملے میں بخل کرے گا، اور مال خرچ کرنے والے اور علم طلب کرنے والے سے حسد کرے گا، اور خیر پر حرص کرے گا، اور لوگوں کے درمیان خیر پہنچانے کے لیے چلے گا، پس اس کے ذریعے وہ نمو پائے گا، جیسے باغ اپنے اندر موجود خوشبودار پھولوں سے نمو پاتا ہے۔ اور اللہ کے ذریعے اس شخص پر تکبر کرے گا جو اللہ کے حکم پر تکبر کرتا ہے، اور ان مقامات پر قول و فعل میں سختی کرے گا جہاں وہ جانتا ہے کہ یہ اللہ کی رضا میں ہے۔ اور اس شخص پر قہر کی طلب کرے گا جو *الحق* (الحق) سے دشمنی رکھتا ہے اور اس کی مخالفت کرتا ہے۔ پس اس نفس نے اپنی صفات کو زائل نہیں کیا، بلکہ انہیں ان مصارف میں صرف کیا جن پر اس کا رب، اس کے فرشتے اور اس کے رسول اس کی تعریف کرتے ہیں۔ پس شریعت صرف اسی چیز کے ساتھ آئی ہے جس میں طبع اس کی مدد کرتا ہے۔ پس میں نہیں جانتا کہ انسان کو مشقت کہاں سے پہنچتی ہے، جبکہ اس پر ان صفات کے ذریعے جو اس کا طبع تقاضا کرتا ہے، مصارف کی وضاحت کے ذریعے کوئی پابندی نہیں لگائی گئی۔ لوگ صرف اغراض (مقاصد نفسانی) کے غلبے کی وجہ سے ہلاک ہوئے، کیونکہ یہی وہ چیز ہے جس نے ان پر درد اور ناپسندیدہ چیزیں داخل کیں۔ اگر انسان اپنی غرض کو اس طرف صرف کر دے جو اس کے خالق نے اس کے لیے ارادہ کیا ہے تو وہ راحت پائے گا۔ ابو یزید سے پوچھا گیا: تم کیا چاہتے ہو؟ انہوں نے کہا: میں چاہتا ہوں کہ میں نہ چاہوں۔ یعنی مجھے ہر اس چیز کا ارادہ کرنے والا بنا دے جو تو چاہتا ہے، تاکہ صرف وہی ہو جو *الحق* (الحق) سبحانہ چاہتا ہے۔ پس وہ اپنے بندوں کے لیے صرف آسانی چاہتا ہے، اور ان کے لیے تنگی نہیں چاہتا، اور ان کے لیے خیر چاہتا ہے، اور شر اس کی طرف نہیں ہے، جیسا کہ صحیح خبر میں آیا ہے: \"اور خیر سب تیرے ہاتھوں میں ہے اور شر تیری طرف نہیں ہے۔\" اگرچہ اصل حکم کے مطابق سب کچھ اللہ کی طرف سے ہے۔ اور چونکہ انسان کا ارادہ کرنے والا ہونے سے باہر نکلنا محال ہے، اور یہ پہلی چیز ہے جو طاعات میں نقص ڈالتی ہے، پس وہ انہیں بغیر کسی مشروع نیت کے کرتا ہے، تو وہ طاعت نہیں ہوتی۔ اور ابو یزید نے صرف ان نفسانی اغراض سے خروج طلب کیا جو *الحق* (الحق) عزوجل کی رضا کے موافق نہیں ہیں۔\n\n### [بغیر چراغ اور روشنی کے تاریکی میں چلنا ہلاکتوں کا راستہ ہے]\n\nاور جان لو کہ تاریکی میں بغیر چراغ اور روشنی کے چلنا ایک ایسے راستے پر ہے جہاں ہلاکتیں، گڑھے، کیچڑ، گہری کھائیاں اور موذی حشرات بہت زیادہ ہیں، جن میں سے کسی سے بھی بچا نہیں جا سکتا، مگر یہ کہ اس میں چلنے والا روشنی کے ساتھ ہو، جس سے وہ دیکھے کہ وہ اپنا قدم کہاں رکھتا ہے، اور اس سے ان چیزوں سے بچے جن سے بچنا ضروری ہے، جیسے کوئی گہری کھائی جس میں وہ گر جائے، یا کوئی ہلاکت خیز جگہ جہاں وہ پھنس جائے، یا کوئی سانپ جو اسے ڈس لے۔ اور اس کے پاس شریعت کے نور کے سوا کوئی روشنی نہیں ہے، جس کے بارے میں اللہ تعالیٰ نے فرمایا:\n**نُوراً نَهْدِي به من نَشاءُ من عِبادِنا**\n\"ایک نور جس کے ذریعے ہم اپنے بندوں میں سے جسے چاہتے ہیں ہدایت دیتے ہیں۔\"\nاور فرمایا:\n**ومن لَمْ يَجْعَلِ الله لَهُ نُوراً فَما لَهُ من نُورٍ**\n\"اور جسے اللہ نور نہ دے، تو اس کے لیے کوئی نور نہیں۔\"\nاور فرمایا:\n**نُورٌ عَلى‏ نُورٍ**\n\"نور پر نور۔\"\nپس جب شریعت کا نور توفیق اور ہدایت کی بصیرت کے نور کے ساتھ جمع ہو جاتا ہے، تو راستہ دونوں نوروں سے واضح ہو جاتا ہے۔ اگر ایک ہی نور ہوتا تو اس کے لیے روشنی ظاہر نہ ہوتی۔ اور اس میں کوئی شک نہیں کہ شریعت کا نور سورج کی روشنی کی طرح ظاہر ہو چکا ہے، لیکن اندھا اسے نہیں دیکھتا۔ اسی طرح جس کی بصیرت کو اللہ نے اندھا کر دیا، وہ اسے نہیں پا سکا اور اس پر ایمان نہیں لایا۔ اور اگر بصیرت کی آنکھ کا نور موجود ہوتا اور شریعت کا نور ظاہر نہ ہوتا، اس طرح کہ دونوں نور جمع ہو کر راستے میں روشنی پیدا کرتے، تو بصیرت کے نور والا یہ نہ دیکھ پاتا کہ وہ کیسے چلے، کیونکہ وہ ایک نامعلوم راستے پر ہے، وہ نہیں جانتا کہ اس میں کیا ہے، اور بغیر کسی دلیل اور ٹھکانے کے وہ کہاں ختم ہو گا۔ پس یہ شخص جو اس راستے پر چل رہا ہے، اگر وہ اپنے چراغ کو خواہشات سے نہ بچائے کہ وہ اپنی پھونکوں سے اسے بجھا دیں، ورنہ اس پر تیز ہوائیں چلیں گی اور اس کا چراغ بجھا دیں گی اور اس کا نور چلا جائے گا۔ اور یہ ہر وہ ہوا ہے جو اس کے *توحید* (توحيد) اور ایمان کے نور پر اثر انداز ہوتی ہے۔ پس اگر کوئی نرم ہوا چلے جو اس کے چراغ کی لو کو جھکا دے اور اسے حیران کر دے، یہاں تک کہ راستے کے *مشاہدہ* (مشاهدة) میں اس پر روشنی مبہم ہو جائے، تو وہ ہوا شریعت کے فروع میں خواہش کی پیروی کی طرح ہے، اور وہ گناہ ہیں جن سے انسان کافر نہیں ہوتا اور نہ ہی اس کے *توحید* (توحيد) اور ایمان میں نقص آتا ہے۔ یقیناً ہمیں ایک عظیم مقصد کے لیے پیدا کیا گیا ہے، لیکن جب ہم ان سختیوں میں گھستے ہیں اور ان ناپسندیدہ چیزوں کو برداشت کرتے ہیں، تو ہمیں ایک عظیم چیز حاصل ہوتی ہے، اور وہ ابدی سعادت ہے جس میں کوئی بدبختی نہیں۔\n\n### [صراط مستقیم پر چلنا]\n\nاور جو کچھ اس منزل میں شامل ہے، وہ اس وقت کا علم ہے جب فرشتے اور شیطان کے دو *قرینین* (قرينان) اس کے ساتھ ہوتے ہیں۔ پس جان لو کہ جب اللہ کسی انسان کو ایسی امت میں پیدا کرتا ہے جس میں کوئی رسول مبعوث نہیں ہوا، تو اس کے ساتھ نہ فرشتہ ہوتا ہے اور نہ شیطان۔ اور وہ اپنے طبع کے حکم کے مطابق تصرف کرتا رہتا ہے، اس کی پیشانی خاص طور پر اس کے رب کے ہاتھ میں ہوتی ہے۔ پس اس وقت وہ جس چیز پر بھی چلتا ہے، وہ صراط مستقیم پر ہوتا ہے، کیونکہ اس کا رب صراط مستقیم پر ہے۔ اللہ تعالیٰ نے فرمایا:\n**ما من دَابَّةٍ إِلَّا هُوَ آخِذٌ بِناصِيَتِها إِنَّ رَبِّي عَلى‏ صِراطٍ مُسْتَقِيمٍ**\n\"کوئی چلنے والا نہیں مگر وہ اس کی پیشانی پکڑے ہوئے ہے، بے شک میرا رب صراط مستقیم پر ہے۔\"\nپس جب ان میں کوئی رسول مبعوث ہوتا ہے، یا وہ ایسی امت میں پیدا ہوتا ہے جس میں رسول موجود ہو، تو پیدائش کے وقت سے ہی دو *قرینین* (قرينان)، ایک فرشتہ اور ایک شیطان، اس کے ساتھ لازم ہو جاتے ہیں، شریعت کے وجود کی وجہ سے۔ اور دونوں *قرینین* (قرينان) میں سے ہر ایک کو ایک لمہ (اثر ڈالنے کی جگہ) دی گئی ہے جس کے ذریعے وہ اسے چھیڑتا اور قابو کرتا ہے۔ اور یہ نہ کہو کہ نوزائیدہ بچہ مکلف نہیں ہے، تو پھر یہ دونوں *قرینین* (قرينان) اس کے ساتھ کیوں ہوتے ہیں؟\n\n### [اللہ نے نوزائیدہ کے حق میں فرشتہ اور شیطان مقرر نہیں کیا]\n\nپس جان لو کہ اللہ نے یہ دونوں *قرینین* (قرينان) نوزائیدہ کے حق میں نہیں بنائے، بلکہ یہ اس کے والدین یا ان لوگوں کے مرتبے کی وجہ سے ہے جو اس کے ساتھ ہیں۔ پس شیطانی *قرین* (قرين) اسے چھیڑتا ہے تو وہ روتا ہے یا اپنے ہاتھ سے کھیلتا ہے اور کوئی ایسی چیز خراب کر دیتا ہے جس کی خرابی اس کے باپ یا کسی اور کو ناپسند ہو۔ پس نوزائیدہ غیر مکلف کی وہ حرکت دوسروں میں بے چینی اور ناراضگی پیدا کرنے کا سبب بنتی ہے، اللہ کے فعل کو ناپسند کرنے کی وجہ سے، تو اس سے گناہ متعلق ہو جاتا ہے۔ اسی لیے شیطان اس کے ساتھ ہوتا ہے، نہ کہ خود اس (بچے) کے لیے۔ اور اسی طرح فرشتہ بھی، اور وہ ہر وہ حرکت ہے جو نوزائیدہ سے ظاہر ہوتی ہے جو دوسروں کے نفس میں شر یا خیر کو واجب کرنے والا امر پیدا کرتی ہے۔ پس اگر شر ہو تو شیطان کی طرف سے، اور اگر خیر ہو تو فرشتے کی طرف سے۔ اور چھوٹے بچے کے لیے ادراک حاصل ہونے تک کوئی نفسانی یا ربانی حرکت نہیں ہوتی۔ اور اگر اس کی امت میں کوئی شریعت نہ ہو، تو اس کی تمام حرکتیں پیدائش سے لے کر موت تک نفسانی ہوتی ہیں۔ جب تک کہ اس کی طرف کوئی رسول نہ بھیجا جائے یا وہ خود کسی الٰہی دین میں داخل نہ ہو جائے جس کی وہ پابندی کرے، خواہ وہ اللہ کی طرف سے مشروع ہو یا غیر مشروع۔ تب اس پر دونوں *قرینین* (قرينان) مقرر کیے جاتے ہیں، کیونکہ عقل کے لیے قربتوں کو مشروع کرنا ممکن نہیں ہے۔ اگرچہ وہ عرف میں مروج اور طبعاً محبوب اخلاق حسنہ پر ہو جنہیں عقل ادراک کرتی ہے، لیکن وہ ان پر کوئی ایسا حکم نہیں لگا سکتی جو قطعی طور پر اللہ پر لازم ہو۔ اور نہ ہی اس کے پاس آخرت کے اثبات یا نفی کا کوئی حکم ہے۔ لیکن وہ اپنی عقل کے ذریعے اپنے موجد (پیدا کرنے والے) کے اثبات میں غور کرنے پر قادر ہے، اور یہ کہ وہ اپنے وجود میں کس پر انحصار کرتا ہے، اور اس کے موجد کو کن صفات پر ہونا چاہیے، اور جلال کی کن صفات کے ذریعے اسے تعظیم دینی چاہیے۔ لیکن اس کے نزدیک اخروی منزل کے پہلو سے نہیں۔ اور وہ اپنی عقل سے یہ نہیں جانتا کہ موت کے بعد اس کا کیا انجام ہو گا، اور نہ ہی یہ جانتا ہے کہ اس کے بدن کا یہ مدبر کون ہے، اور جب وہ مر جاتا ہے تو کہاں جاتا ہے۔ اور اگر آدم سے ہی امر کا آغاز نبوت کے ساتھ نہ ہوتا، تو وہ وہاں کی چیزوں کے بارے میں خبر نہ دیتے، پس انہوں نے وہاں کی چیزوں کی خبر دی، تو عقلیں ہوشیار ہو گئیں جب انہیں ان نفوس کے انجام کے بارے میں بتایا گیا۔ یہی وہ چیز ہے جس نے انہیں اس بارے میں تحقیق اور غور و فکر پر آمادہ کیا، اور موت کے بعد نفوس کا حشر کہاں ہو گا، اور انہیں کیسے جمع کیا جائے گا، اور وہ صورت جس کے ذریعے اور جس کی طرف وہ منتقل ہوں گے، اور کیا وہ دوسرے مواد کی مدبر بن کر منتقل ہوں گی یا مادے سے مجرد ہو جائیں گی، اور کیا تخلیق میں بدن کی تسویہ سے پہلے ان کا وجود تھا یا وہ بدن کے وجود کے ساتھ ہی پیدا ہوئیں؟ اور انہوں نے عالم میں تاثیرات کے حکم پر غور کیا، پس انہوں نے افلاک اور کواکب کی حرکات کا مشاہدہ کیا، اور انہوں نے دیکھا کہ ان حرکات کے تکرار سے آثار پیدا ہوتے ہیں۔ پس انہوں نے جانا کہ اس اثر اور ان حرکات کے درمیان ایک نسبت ہے۔ اور وہ چیز جس کے تکرار کو عمریں ادراک نہ کر سکیں، وہ نبی علیہ السلام کے بتانے سے ہے جو ان کے زمانے میں تھے، وہ ان کے پاس وہ لے کر آئے جو اللہ نے انہیں بتایا اور انہیں ان عنصری آثار پر مطلع کیا جو ان علوی حرکات میں پوشیدہ تھے، اور انہیں دنیا اور آخرت میں ان کا حکم بتایا۔ اور یہ سب کچھ بغیر کسی ٹھکانے کے عقلوں کے ادراکات میں سے نہیں ہے۔ اور اگر اس دنیا اور آخرت میں الٰہی تعریف (تعارف) نہ ہوتا، تو کوئی بھی وہاں کی چیزوں میں سے کچھ نہ جانتا۔\n\n### [ہر مخلوق اپنی فطرت پر الحق کی تعظیم کرتی ہے]\n\nاور جان لو کہ انسان اور جن کے سوا ہر مخلوق *الحق* (الحق) کی تعظیم اور اس کی حمد کے ساتھ تسبیح کرنے پر مفطور (پیدا) کی گئی ہے۔ اور اسی طرح انسان اور جن کے جسم کے تمام اعضاء بھی (تسبیح کرتے ہیں)، لیکن تقرب اور عظیم ترین منزل کی طلب کے پہلو سے نہیں، بلکہ ان کے لیے تسبیح سانس لینے والوں میں سانسوں کی طرح ہے، اس لیے کہ *الذات* (ذات) اس کی مستحق ہے۔ اور اسی طرح انسان اور جن کی تسبیح جنت اور جہنم میں ہو گی، قربت کے طریقے پر نہیں، اور نہ ہی ان کے لیے قربت پیدا کرے گی۔ بلکہ ان میں سے ہر ایک ایک معلوم مقام پر ہو گا۔ پس عبادت طبعی ہو جائے گی جو ان کی حقیقتوں کا تقاضا ہو گی، اور تکلیف (شرعی ذمہ داری) اٹھا لی جائے گی۔ اور جب اللہ کا حکم ان پر وارد ہو گا تو ان سے مخالفت کا تصور بھی نہیں کیا جا سکتا۔ اور وہاں کوئی نہی (ممانعت) باقی نہیں رہے گی، اہل نار سے اس کے قول کے بعد:\n**اخْسَؤُا فِيها ولا تُكَلِّمُونِ**\n\"دھتکارے ہوئے اسی میں رہو اور مجھ سے بات نہ کرو۔\"\nاور ہماری بات اس وقت کی ہے جب لوگ ہر گھر میں اپنی منزلوں پر اتر جائیں گے، اور دروازے بند ہو جائیں گے، اور دونوں گھر اپنے اہل کے ساتھ مستقر ہو جائیں گے جو ان کے اہل ہیں۔ اور ارضِ حشر کی شان بلند ہو جائے گی اور وہ سب آگ بن جائے گی۔ اور ثابت ستاروں کے فلک کے مقعر کے نیچے سے لے کر اسفل سافلین کی انتہا تک سب ایک ہی گھر بن جائے گا جسے جہنم کہا جاتا ہے، جو گرمی اور ٹھنڈک (زمہریر) پر مشتمل ہو گا، اور ان کے درمیان برزخ ہوں گے، جن میں کھالوں میں تکوینیات ہوں گی جن میں پکنے کے وقت تبدیلی واقع ہو گی۔\n**خالِدِينَ فِيها ما دامَتِ السَّماواتُ والْأَرْضُ**\n\"وہ اس میں ہمیشہ رہیں گے جب تک آسمان اور زمین قائم ہیں۔\"\nاس سے مراد وہ مدت ہے جس پر زمین تھی، جس دن اللہ نے اسے پیدا کیا اس دن سے لے کر تبدیلی کے دن تک۔ اور وہ عرب جن کی زبان میں قرآن نازل ہوا، وہ اس لفظ کو اطلاق کرتے تھے اور اس سے ابدیت مراد لیتے تھے، حالانکہ یہ الٰہی خبر سے منقطع ہے، اور نبی صلی اللہ علیہ وسلم کے اس فرمان سے:\n**إِلَّا ما شاءَ رَبُّكَ**\n\"مگر جو تیرا رب چاہے\"\nاس لذت اور نعمت کے ساتھ جو انہیں جہنم میں رزق دی جائے گی۔\n**إِنَّ رَبَّكَ فَعَّالٌ لِما يُرِيدُ**\n\"بے شک تیرا رب جو چاہتا ہے وہ کرنے والا ہے۔\"\nاور جنت کے بارے میں:\n**خالِدِينَ فِيها ما دامَتِ السَّماواتُ والْأَرْضُ**\n\"وہ اس میں ہمیشہ رہیں گے جب تک آسمان اور زمین قائم ہیں۔\"\nان کے جوہر کے لحاظ سے، نہ کہ ان کی صورت کے لحاظ سے۔ اور اسی لیے فرمایا:\n**عَطاءً غَيْرَ مَجْذُوذٍ**\n\"ایسا عطیہ جو کبھی ختم نہ ہو گا۔\"\nیعنی غیر منقطع۔ اور استثناء اس کے قول \"مگر جو تیرا رب چاہے\" میں ان کی صورت کے زوال سے واقع ہوتا ہے، جب آسمان آسمان تھا اور زمین زمین تھی۔ کیونکہ ہم جانتے ہیں کہ آسمان کا جوہر دھوئیں کا جوہر ہے، اور اس پر صورتیں بدلتی رہیں۔ پس وہ جوہر جس نے دھوئیں کی صورت قبول کی، وہی ہے جس نے آسمان کی صورت قبول کی۔ جیسے مٹی اور پتھر کے جوہر نے گھر کی صورت قبول کی۔ پس جب گھر گر جاتا ہے اور مٹی سوکھ جاتی ہے، تو گھر اور مٹی کی صورت چلی جاتی ہے اور عین جوہر باقی رہتا ہے۔ اور اسی طرح سارا عالم جوہر کے لحاظ سے ایک ہے اور صورتوں کے لحاظ سے مختلف ہے۔ پس یہ جان لو، تو اہل نار کے حق میں استثناء ان کے عذاب کی مدت کے لیے ہو گا، اور اہل جنت کے حق میں استثناء اس معنی میں ہو گا کہ \"مگر یہ کہ تیرا رب چاہے\"، اور اس نے چاہا ہے کہ وہ انہیں نہ نکالیں، پس وہ نہیں نکلیں گے، کیونکہ اللہ نے اپنے قول \"ایسا عطیہ جو کبھی ختم نہ ہو گا\" کے ذریعے یہ نہیں چاہا۔ اور اہل نار کے بارے میں یہ نہیں کہا کہ \"عذاب غیر مجذوذ\" (نہ ختم ہونے والا عذاب)، پس سمجھ لو۔ کیونکہ صحیح متواتر خبر وارد ہوئی ہے، پس اللہ تعالیٰ نے فرمایا:\n**يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ والسَّماواتُ**\n\"جس دن زمین بدل دی جائے گی دوسری زمین سے اور آسمان بھی۔\"\nاور آسمان کو اس طرح بیان کیا کہ وہ تیل کی طرح ہو جائے گا، اور اس کے پھٹنے اور ڈولنے کو بیان کیا۔ اور اللہ تعالیٰ نے فرمایا:\n**فَكانَتْ وَرْدَةً كَالْدِّهانِ**\n\"پس وہ سرخ چمڑے کی طرح ہو جائے گی۔\"\n(یعنی سرخ تیل کی طرح رنگ اور بہاؤ میں)۔ پس یہ سب صورت کے زوال کی خبر ہے، نہ کہ جوہر کے زوال کی۔\n\n### [وہ علم جس میں اللہ نے انسان سے مشغول ہونے کا ارادہ کیا]\n\nاور جو کچھ اس منزل میں شامل ہے، وہ اس علم کا ہے جس میں اللہ نے انسان سے چاہا کہ وہ اپنے غور و فکر اور اعتبار کی حالت میں مشغول ہو، کیونکہ یہ نظر اسے اپنے خالق کی *معرفت* (المعرفة) کی طرف لے جاتی ہے، نہ کہ اپنے رب کی۔ کیونکہ اللہ کے ہر نام کے لیے عالم میں ایک خاص دلیل ہے جو اس کے علاوہ کسی اور پر دلالت نہیں کرتی، اس حیثیت سے کہ وہ اس پر دلیل ہے۔ اور یہاں سے تم جانو گے کہ زمین پانی کے تموج سے پیدا ہوئی یہاں تک کہ وہ جھاگ بن گیا، پس وہ جھاگ ہی عین زمین تھا۔ کیونکہ وہ مائیت (پانی کی حالت) سے زبدیہ (جھاگ کی حالت) میں منتقل ہوا، اور جھاگ میں زمین ہوتی ہے۔ اور یہی وجہ ہے کہ صالحین اسے چیر کر نکل جاتے ہیں، اور مردہ پر مٹی ڈالنے کے باوجود وہ اپنی قبر میں بیٹھا رہتا ہے۔ اور ہر وہ چیز جو اس سے پیدا ہوئی، اس کا حکم زمین کا حکم ہے، اور زمین کا حکم جھاگ کا حکم ہے، اور جھاگ کا حکم پانی کا حکم ہے۔ اور پانی پھٹنے کو قبول کرتا ہے اور چیزیں اس میں حرکت کرتی ہیں، پس اس اصل کا حکم ان تمام چیزوں میں جاری ہوتا ہے جو اس سے وجود میں آئیں، خواہ وہ زمین کی طرح کثیف ہو یا ہوا اور آگ کی طرح لطیف۔ لیکن آگ پانی کے لیے پوتے کی طرح ہے، اور زمین پانی کے لیے بیٹے کی طرح ہے۔ اور ہوا اور جھاگ پانی کے لیے صلبی اولاد کی طرح ہیں۔ پس پانی ان دونوں کا باپ ہے، اور وہ آگ کے لیے ہوا کی طرف سے دادا ہے، اور زمین کے لیے جھاگ کی طرف سے دادا ہے۔ پس آدم کی تخلیق اور پانی کے درمیان مٹی اور جھاگ کا وجود ہے۔ پس وہ اپنی کثافت کے لحاظ سے پوتے کا بیٹا ہے۔ اور اسی طرح جو کچھ اس میں آگ اور ہوا ہے، اس لحاظ سے وہ پوتا ہے۔ اور حوا کی تخلیق کا معاملہ یہ ہے کہ ان کے اور اصل (پانی) کے درمیان تین واسطے ہیں: آدم، مٹی اور جھاگ۔ پس وہ اصل سے زیادہ دور ہیں۔ اور بنی آدم کی تخلیق کا معاملہ یہ ہے کہ وہ آدم سے زیادہ اصل کے قریب ہیں، کیونکہ وہ پانی سے پیدا کیے گئے ہیں۔ پس وہ پانی سے جھاگ کی طرح ہیں، وہ پانی کی صلبی اولاد ہیں۔ اور جھاگ بنی آدم کا بھائی ہے، اور وہ آدم کا دادا اور زمین کا باپ ہے۔ پس بنی آدم زمین کے چچا ہیں۔ پس آدم کا مرتبہ اپنے بیٹوں کے مقابلے میں بھتیجے کا اپنے باپ کے چچا کے مقابلے میں ہو گا۔ اور بنی آدم کا مرتبہ آدم کے مقابلے میں اس کے باپ کے چچا کا ہو گا۔ پس وہ اس کی اولاد ہیں اور وہ ان کے بھتیجے کا بیٹا ہے۔ پس وہ اس پہلو سے اسناد میں پہلے سبب یعنی جد اعلیٰ کے زیادہ قریب ہیں۔ مگر اس پانی کی وجہ سے جو آدم میں ہے، جس سے مٹی کیچڑ بن گئی، تو اس میں صلبی اولاد کے ساتھ الحاق ہے، اس شخص کے مرتبے کی طرح جس نے کسی ایسی عورت سے نکاح کیا جو کسی اور سے حاملہ تھی، پس اس نے کسی اور کی کھیتی کو سیراب کیا، تو اس سیرابی سے جو اسے حاصل ہوا، اس میں اس کا حصہ ہے۔ اور عیسیٰ علیہ السلام کی تخلیق کا معاملہ یہ ہے کہ ان کے اور پانی کے درمیان ان کی والدہ، حوا، آدم، زمین اور جھاگ کا واسطہ ہے۔ مگر ایک دوسرے پہلو سے، وہ ہم سے مشابہت رکھتے ہیں، اور کم لوگ ہی اس پر مطلع ہوتے ہیں۔ اور اللہ نے اس چیز پر متنبہ کیا جس کی طرف ہم نے اشارہ کیا، اپنے قول سے:\n**فَتَمَثَّلَ لَها بَشَراً سَوِيًّا**\n\"پس وہ اس کے سامنے ایک مکمل انسان کی صورت میں ظاہر ہوا۔\"\nجب اللہ نے ارادہ کیا، تو اس (مریم) کو اسے دیکھنے کے بعد لذت محسوس ہوئی، جب کہ اس نے اس سے پناہ مانگی تھی، اور اس نے اسے بتایا کہ وہ *الحق* (الحق) کا رسول ہے تاکہ اسے ایک پاکیزہ لڑکا عطا کرے۔ پس وہ بچے کو قبول کرنے کے لیے تیار ہو گئیں، تو محض دیکھنے سے ان میں نکاح کی لذت سرایت کر گئی، پس ان سے پانی رحم میں اترا، تو عیسیٰ کا جسم اس پانی سے بنا جو اس نفخ سے پیدا ہوا جس نے ان میں لذت پیدا کی۔ پس وہ اپنی والدہ کے پانی سے ہیں، اور طبیعات کے ماہر اس کا انکار کرتے ہیں اور کہتے ہیں کہ عورت کے پانی سے کچھ نہیں بنتا۔ اور یہ صحیح نہیں ہے، اور ہمارے نزدیک انسان مرد کے پانی اور عورت کے پانی سے بنتا ہے۔ اور نبی صلی اللہ علیہ وسلم سے، جو خواہش سے نہیں بولتے، یہ ثابت ہے کہ انہوں نے فرمایا: \"جب مرد کا پانی عورت کے پانی پر غالب آ جائے تو لڑکا ہوتا ہے، اور جب عورت کا پانی مرد کے پانی پر غالب آ جائے تو لڑکی ہوتی ہے۔\" اور ایک روایت میں \"علا\" کی جگہ \"سبق\" (پہلے ہونا) ہے۔ پس \"أذكرا\" (دونوں مذکر ہوں) اور \"أنثا\" (دونوں مؤنث ہوں) میں تثنیہ کا ضمیر آیا ہے۔ اور ہم نے اپنی کتاب النکاح میں اس فصل میں کہا ہے کہ جب مرد اور عورت میں سے کوئی بھی اپنے ساتھی سے پانی اتارنے میں سبقت نہ کرے، اور دونوں ایک ساتھ اس طرح پانی اتاریں کہ وہ آپس میں مل جائیں اور کوئی بھی پانی دوسرے پر غالب نہ آئے، تو اس حالت کی وجہ سے، جب وہ اس صورت میں واقع ہوتی ہے، اللہ خنثیٰ (مخلوط جنس) کو پیدا کرتا ہے، پس وہ مذکر اور مؤنث دونوں کو جمع کرتا ہے۔ اگر وہ تمام پہلوؤں سے مساوی اور معتدل ہوں، اور ان میں سے کسی کا پانی منحرف نہ ہو، تو خنثیٰ اپنی شرمگاہ سے حیض بھی لائے گا اور اپنے ذکر سے منی بھی خارج کرے گا، پس وہ اولاد بھی دے گا اور جو اس سے نکاح کرے گا اس سے اولاد قبول بھی کرے گا۔ اور روایت ہے کہ ایک شخص کو دیکھا گیا جس کے ساتھ دو بچے تھے، ایک اس کے صلب سے اور دوسرا اس کے بطن سے۔ اور اگر پانی اعتدال سے منحرف ہو جائے اور دوسرے پر غالب آنے کی حد تک نہ پہنچے، تو حکم اس کے لیے ہو گا جو غلبے کی طرف مائل ہو۔ پس اگر عورت کا پانی (غالب ہونے کی طرف مائل ہو) تو خنثیٰ حیض لائے گا اور منی خارج نہیں کرے گا، اور اگر مرد کا پانی (غالب ہونے کی طرف مائل ہو) تو منی خارج کرے گا اور حیض نہیں لائے گا۔ پس پاک ہے وہ قادر، خالق، علیم! اور یہ حیوانات میں سب سے عجیب برزخوں میں سے ہے۔\n**لِتَعْلَمُوا أَنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ وأَنَّ الله قَدْ أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً**\nیہ اس لیے ہے تاکہ تم جان لو کہ \"بے شک اللہ ہر چیز پر قادر ہے، اور بے شک اللہ نے ہر چیز کو علم سے گھیر رکھا ہے۔\"\nاور اس منزل سے اس قدر علم کافی ہے، کیونکہ یہ بہت سے مسائل پر مشتمل ہے، جن میں سے اکثر عالمِ طبعی کی پیدائش کے بارے میں ہیں، جو افلاک کی حرکات، ان کے رخ، اور ان کے ستاروں کے نور کی شعاعوں کے رخ کے درمیان ہوتی ہے، اور عناصر اور مولدات کے ان انوار کے آثار کو قبول کرنے کے درمیان، پس ان احکام سے اعیان، مراتب اور احوال کا وجود ظاہر ہوتا ہے۔ اور یہ ایک بڑا اور طویل علم ہے۔ اور اس منزل سے غیر مکلف مقام پر ابتلاء کا علم متعلق ہے، اور یہ الٰہی دیوان کے علم پر مشتمل ہے، اور الٰہی کلمہ کے وجوب کے علم پر مشتمل ہے جو تبدیل نہیں ہوتا، اور یہ اس علم پر مشتمل ہے کہ عالم میں کوئی چیز باطل یا عبث نہیں ہے، اور یہ سب *الحق* (الحق) ہے، بشمول اس میں موجود *الحق* (الحق) اور باطل کے۔ اور یہ اس علم پر مشتمل ہے کہ اللہ نے اکثر لوگوں کے حق میں سزاؤں کو عموماً دارِ آخرت تک کیوں مؤخر کیا اور دوسروں کے حق میں انہیں کیوں جلدی دے دیا۔ اور اسی کو \"انفاذ الوعید\" (وعید کا نفاذ) سے تعبیر کیا جاتا ہے، اور یہ ایک خبر ہے، اور وہ خبر جس میں حکم شامل نہ ہو، اس میں نسخ داخل نہیں ہوتا۔ پس وہ اس چیز کو نافذ کر سکتا ہے جس کی وعید اس نے اپنے مخالف کے لیے دی ہے، کیونکہ اس نے اس کے نفاذ کے لیے کسی ایک گھر (دنیا یا آخرت) کو خاص نہیں کیا۔ بلکہ دنیا کے بارے میں فرمایا:\n**لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا**\n\"تاکہ وہ انہیں ان کے بعض اعمال کا مزہ چکھائے۔\"\nاور یہ \"انفاذ الوعید\" کے جملے میں سے ہے۔ پس جو لوگ \"انفاذ الوعید\" کے قول کی طرف جاتے ہیں وہ درست ہیں، لیکن اس کا نفاذ وہاں ہوتا ہے جہاں *الحق* (الحق) تعالیٰ اسے مقرر کرے۔ پس جب وہ اسے دنیا میں کسی بیماری، یا نفسیاتی یا حسی درد کے ذریعے نافذ کرتا ہے جو اس وعید کے مستحق پر داخل ہوتا ہے، تو یہ اس کے لیے آخرت کی سزا سے پردہ پوشی ہوتی ہے۔ پس اسی کو یہاں مغفرت سے تعبیر کیا جاتا ہے، یعنی آخرت میں اس پر مؤاخذہ نہیں ہو گا۔ اور یہ اکثر سعادت مندوں اور ان سعادت مندوں کے احوال ہیں جنہیں آگ کی کوئی پرواہ نہیں ہو گی، اور\n**ولا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ**\n\"انہیں سب سے بڑی گھبراہٹ غمگین نہیں کرے گی\"،\nوہ جن پر\n**فَلا خَوْفٌ عَلَيْهِمْ ولا هُمْ يَحْزَنُونَ**\n\"نہ کوئی خوف ہو گا اور نہ وہ غمگین ہوں گے\"۔\nاور اسی لیے لوگوں میں مثال کے طور پر نفوس کا ابتلاء اور محسوس بلاء عظیم ہوا، جیسے انبیاء اور\n**الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ من النَّاسِ**\n\"وہ لوگ جو لوگوں میں انصاف کا حکم دیتے ہیں\"،\nاس سے کہ *الحق* (الحق) کو ان کے چہروں پر رد کیا گیا، اور جو کچھ وہ کافروں سے سنتے ہیں جس سے ان کے نفوس کو تکلیف پہنچتی ہے۔ اور اللہ نے اس کی خبر دی ہے، اور اسی طرح جو قتل اور مار پیٹ ان پر مسلط کی گئی۔ یہ سب \"انفاذ الوعید\" میں سے ہے، ان خطرات اور حرکات کے لیے جو بشریت اور طبع کا تقاضا ہیں، جو ان کے منصب کے لائق نہیں ہیں، لیکن وہ بشر کے لائق ہے۔ اور یہیں سے اللہ تعالیٰ کا اپنے رسول صلی اللہ علیہ وسلم سے یہ قول معلوم ہوتا ہے:\n**لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ**\n\"تاکہ اللہ تمہارے اگلے اور پچھلے گناہ بخش دے۔\"\nپس اس نے گناہ کو مقرر کیا اور مغفرت کو واقع کیا، اور اس سے اپنے بندوں کو یہ سمجھایا کہ وہ انہیں آخرت میں سزا نہیں دے گا۔ اور اس نے مغفرت کو دنیا کے ساتھ معلق نہیں کیا، کیونکہ اس میں نفسیاتی اور حسی درد اور بیماریاں ہیں، اور یہی ان کے حق میں عین \"انفاذ الوعید\" ہے۔ اور اس مسئلے میں معتزلی کا قول صحیح ہے، یعنی بے گناہ کو تکلیف دینے کا مسئلہ۔ کیونکہ اشعری اللہ پر اس کو جائز قرار دیتے ہیں، لیکن ہر جائز چیز واقع نہیں ہوتی۔ اور وہ سب کچھ جس سے وہ معتزلہ پر حجت پکڑتے ہیں، وہ اتنا بڑا نہیں ہے اور اس سے علیحدگی آسان ہے۔ اور یہ کتاب اس علم کو بیان کرنے کی جگہ نہیں ہے، اور\n**والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏**\n\"اور اللہ *الحق* (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے۔\"",
    "fa": "باب دویست و نود و هشتم در معرفت منزل ذکر از عالم علوی در حضرت محمدیه (الحضرة المحمدیة).\n\nشکوفه معارف از شکوفه ریاضت‌هاست،\nو شکوفه باغ تو از شکوفه آسمان‌هاست.\n\nپس برای جسم‌ها علومی است که\nعلم نفوس به سبب‌ها و آفت‌ها شبیه آن نیست.\n\nحقائق الحق (حقيقة الحقائق) درک‌هایشان پنهان نمی‌ماند،\nزیرا ادراک آن‌ها برای ذات (حق) به واسطه ذات است.\n\nو آنچه غیر از آن است، ادراک به واسطه است،\nبه آنچه از نشانه‌ها و آیات می‌بیند.\n\nشوخی بزرگان، جدی است ناشی از مشاهده (شهود)،\nکه در نهان آن نزد ایشان مکر کرامات است.\n\nمهلت دادنشان از روی بی‌توجهی نیست،\nبه دلیل علمشان به اینکه آن (امر) به زمان‌ها گره خورده است.\n\nاگرچه مردان، نسبتشان به پدری واحد محقق شود،\nفرزندان علّات (فرزندان یک پدر از مادران مختلف) هستند.\nاگر بگویی «هستند»، پس هستند، یا اگر بگویی «نیستند»، پس نیستند،\nبه دلیل قرار گرفتنشان میان دردها و لذت‌ها.\n\nزیرا مظاهر، آن‌ها را فانی نمی‌کند،\nو این مظاهر همان‌هایی هستند که به «پوشش‌ها» (ستارات) تعبیر می‌شوند.\n\n### [علم خروج از طبع]\n\nبدان، خداوند تو را توفیق دهد، که شیخ ما ابوالعباس عریبی از کسانی بود که به این منزل (منزل) تحقق یافته بود و بارها با او در این باره گفتگو کردیم، و قدمش در آن راسخ بود، رحمت خدا بر او باد. و بدان که این منزل میان مشقت شدید و اموری که جز با قهر شدید و آفات مانع از ادراک مطلوب به دست نمی‌آید، و میان رفق و رفع آفات و رسیدن به مطلوب با آسایش لذت‌بخش و مورد علاقه نفوس، جمع شده است. و میان این دو صفت، سختی‌های بزرگی وجود دارد. پس اولین علمی که این منزل در بر می‌گیرد، علم خروج از طبع (الطبع) است.\n\nبدان که حرکات برخی طبیعی و برخی قسری (اجباری) هستند. پس گمان مبر که حرکت طبیعی لذت می‌دهد و حرکت قسری درد، به دلیل خروجت از طبع. ممکن است امر چنین باشد و ممکن است برعکس آن باشد. اگر انسانی از بلندی عظیمی سقوط کند، فرود آمدنش به زمین از روی حرکت طبیعی است، اما وقتی به زمین می‌رسد، چه بسا اعضایش بشکند و دردهایش مضاعف شود. و سبب آن، اضطراب ذاتی و عدم موافقت با اختیاری است که ربانیت (ربانیته) نهفته در او آن را می‌طلبد، که به او گفته شد از آن خارج شو، اما او چنین نکرد. و حرکت قسری آن است که او را به معراج ببرند و از آیات و شادی‌ها و گشایش‌ها و تنزه (سیر و سیاحت) ببیند، به اندازه‌ای که آن حرکت قسری او را بالا برده است؛ حرکتی که او را از طبع و اضطرارش خارج کرده و با اختیارش موافقت نموده است. پس به هر آنچه طبع اقتضا می‌کند شاد مباش، زیرا او نیز حرکت قسری را نپذیرفت مگر به طبع خود. پس حکم طبع در هر دو حرکت از آن جدا نمی‌شود.\n\n### [ذاتی تغییر نمی‌کند]\n\nو بدان که صفاتی که انسان بر آن‌ها سرشته شده است، تغییر نمی‌کنند، زیرا آن‌ها در این نشئه دنیوی برای او ذاتی هستند؛ مانند مزاج خاص از ترس، بخل، حسد، حرص، سخن‌چینی، تکبر، درشتی و طلب قهر و امثال این‌ها. و چون تغییر آن‌ها ممکن نبود، خداوند مصارفی (محل‌های صرف) برای آن‌ها بیان کرد که حکم شرعی صرف آن‌ها به سوی آن مصارف است. پس اگر احکام این صفات به سوی آن مصارف صرف شود، سعادتمند می‌شود و به درجات می‌رسد. پس از ارتکاب محارم می‌ترسد (جبن) به دلیل ضرری که انتظارش را می‌کشد، و نسبت به دینش بخل می‌ورزد (شح)، و به کسی که مال انفاق می‌کند و علم می‌طلبد حسد می‌برد، و بر خیر حریص می‌شود، و میان مردم به رساندن خیر تلاش می‌کند، پس با آن رشد می‌کند (نمّت) همان‌گونه که باغ با گل‌های خوش‌بویش رشد می‌کند، و به واسطه خدا بر کسی که بر امر خدا تکبر می‌ورزد، تکبر می‌کند، و در گفتار و کردار در جاهایی که می‌داند رضای خدا در آن است، درشتی می‌کند، و طلب قهر بر کسی می‌کند که با حق دشمنی کرده و با آن مقابله نموده است. پس این نفس از صفات خود زایل نشد، بلکه آن را در مصارفی صرف کرد که پروردگارش و فرشتگان و رسولانش او را بر آن می‌ستایند. پس شریعت نیامده مگر با آنچه طبع آن را یاری می‌کند. پس نمی‌دانم انسان از کجا به مشقت می‌رسد، در حالی که آنچه طبعش از این صفات اقتضا می‌کند، با بیان مصارف بر او ممنوع نشده است. مردم هلاک نشدند مگر به سلطه اغراض (خواسته‌های نفسانی)، زیرا این اغراض است که درد و ناخوشایندی را بر آن‌ها وارد کرده است. اگر انسان غرض خود را به آنچه خالقش برای او خواسته است صرف کند، آسوده می‌شود. از ابویزید پرسیدند: چه می‌خواهی؟ گفت: می‌خواهم که نخواهم. یعنی مرا مراد کل قرار ده، نه مراد آنچه تو می‌خواهی، تا جز آنچه حق سبحانه می‌خواهد، نباشد. و او برای بندگانش جز آسانی نمی‌خواهد و برایشان سختی نمی‌خواهد، و برایشان خیر می‌خواهد و شر به سوی او نیست، چنانکه در خبر صحیح آمده است:\n«والخير كله في يديك والشر ليس إليك» (و خیر تماماً در دستان توست و شر به سوی تو نیست).\nو اگرچه همه چیز به حکم اصل از جانب خداست، اما چون خروج انسان از مراد بودن محال است، و این اولین چیزی است که در طاعات رخنه می‌کند، پس آن‌ها را بدون نیت مشروع انجام می‌دهد و طاعت محسوب نمی‌شود. بلکه ابویزید خروج از اغراض نفسانی را طلب کرد که موافق رضای حق عز و جل نیست.\n\n### [راه رفتن در تاریکی بدون چراغ و نور، راهی به سوی هلاکت‌هاست]\n\nو بدان که راه رفتن در تاریکی بدون چراغ و نور، در راهی که پر از هلاکت‌ها، گودال‌ها، گل و لای و پرتگاه‌ها و حشرات موذی است، که از هیچ یک از این‌ها نمی‌توان پرهیز کرد، مگر اینکه رونده در آن با نوری باشد که ببیند کجا قدم می‌گذارد و با آن از آنچه باید اجتناب کند، دوری جوید؛ از پرتگاهی که در آن سقوط کند یا مهلکه‌ای که در آن گرفتار شود یا ماری که او را بگزد. و برای او نوری جز نور شریعت نیست که خداوند درباره آن فرمود:\n«نُوراً نَهْدِي به من نَشاءُ من عِبادِنا» (نوری که با آن هر کس از بندگانمان را بخواهیم هدایت می‌کنیم).\nو فرمود:\n«ومن لَمْ يَجْعَلِ الله لَهُ نُوراً فَما لَهُ من نُورٍ» (و هر کس که خداوند برای او نوری قرار نداده باشد، پس او نوری ندارد).\nو فرمود:\n«نُورٌ عَلى‏ نُورٍ» (نور بر نور).\nپس هنگامی که نور شریعت با نور بینایی توفیق و هدایت جمع شود، راه با این دو نور آشکار می‌شود. اگر تنها یک نور بود، روشنایی برای او ظاهر نمی‌شد. و شکی نیست که نور شریعت مانند ظهور نور خورشید آشکار شده است، اما کور آن را نمی‌بیند. همچنین کسی که خداوند بصیرتش را کور کرده باشد، آن را درک نمی‌کند و به آن ایمان نمی‌آورد. و اگر نور چشم بصیرت موجود بود و نور شریعت ظاهر نمی‌شد، به طوری که دو نور جمع شوند و روشنایی در راه ایجاد شود، صاحب نور بصیرت نمی‌دید که چگونه سلوک کند، زیرا در راهی ناشناخته است که نمی‌داند چه در آن است و بدون راهنما و توقفگاه به کجا ختم می‌شود. پس این شخص که در این راه می‌رود، اگر چراغ خود را از هواهای نفسانی حفظ نکند که با وزش خود آن را خاموش کنند، بادهای تند بر او می‌وزند و چراغش را خاموش می‌کنند و نورش از بین می‌رود. و هر بادی که بر نور توحید و ایمان او تأثیر بگذارد، چنین است. اگر باد ملایمی بوزد، زبان چراغ او را متمایل می‌کند و او را متحیر می‌سازد تا نور بر او در مشاهده راه مشتبه شود. آن باد مانند پیروی از هوی در فروع شریعت است، که همان معاصی‌ای هستند که انسان با آن‌ها کافر نمی‌شود و در توحید و ایمان او رخنه نمی‌کنند. به راستی که ما برای امری عظیم خلق شده‌ایم، اما اگر از این سختی‌ها بگذریم و این ناخوشایندی‌ها را تحمل کنیم، به امر عظیمی دست می‌یابیم که همان سعادت ابدی است که در آن شقاوتی نیست.\n\n### [راه رفتن بر صراط مستقیم]\n\nو از جمله آنچه این منزل در بر می‌گیرد، علم به زمانی است که دو قرین (قرینان) از فرشته و شیطان با انسان همراه می‌شوند. بدان که اگر خداوند انسانی را در امتی خلق کند که رسولی در آن مبعوث نشده باشد، فرشته و شیطانی با او قرین نمی‌شوند و او به حکم طبع خود تصرف می‌کند، در حالی که ناصیه‌اش (موی پیشانی‌اش) خاصه در دست پروردگارش است. پس هر آنچه در آن زمان در آن گام برمی‌دارد، بر صراط مستقیم است، زیرا پروردگارش بر صراط مستقیم است. خداوند متعال می‌فرماید:\n«ما من دَابَّةٍ إِلَّا هُوَ آخِذٌ بِناصِيَتِها إِنَّ رَبِّي عَلى‏ صِراطٍ مُسْتَقِيمٍ» (هیچ جنبنده‌ای نیست مگر اینکه او ناصیه‌اش را گرفته است؛ به راستی که پروردگار من بر صراط مستقیم است).\nاما اگر رسولی در میان آن‌ها مبعوث شود یا در امتی که رسولی در آن است خلق شود، از لحظه تولد، دو قرین (قرینان)، فرشته و شیطان، به دلیل وجود شریعت، ملازم او می‌شوند. و به هر یک از این دو قرین، لمّه‌ای (نقطه‌ای در قلب) داده شده است که با آن او را وسوسه (همز) می‌کند و قبض می‌کند. و مگو که مولود مکلف نیست، پس چرا این دو قرین با او همراه می‌شوند؟\n\n### [خداوند فرشته و شیطان را در حق مولود قرار نداده است]\n\nبدان که خداوند این دو قرین را در حق مولود قرار نداده است، بلکه این به خاطر مرتبه والدین او یا کسانی است که در میان آن‌هاست. پس قرین شیطانی او را وسوسه می‌کند و او گریه می‌کند یا با دستش بازی می‌کند و چیزی را که پدرش یا دیگری از فساد آن ناخوشایند است، خراب می‌کند. پس آن حرکت از مولود غیر مکلف، سببی می‌شود که در دیگری بی‌قراری و نارضایتی ایجاد کند، به دلیل ناخوشایندی از فعل خدا، و گناه به او تعلق می‌گیرد. به همین دلیل شیطان با او قرین می‌شود، نه برای خودش. و همچنین فرشته، که هر حرکتی است که از مولود سر می‌زند و در نفس دیگری امری را که موجب شر یا خیر است، برمی‌انگیزد. اگر شر باشد، از شیطان است و اگر خیر باشد، از فرشته است. و کودک کوچک هرگز حرکت نفسانی یا ربانی ندارد تا زمانی که به ادراک برسد. و اگر در امتی باشد که برای آن‌ها شریعتی نیست، تمام حرکت او از زمان تولد تا مرگ، نفسانی است، مگر اینکه رسولی به سوی او فرستاده شود یا او خود وارد دین الهی شود که به آن مقید گردد، هر دینی که باشد، مشروع از جانب خدا یا غیر مشروع. در آن هنگام، دو قرین بر او گماشته می‌شوند. زیرا عقل را یارای آن نیست که قربات (اعمال عبادی) را تشریع کند، اگرچه بر مکارم اخلاق معمول در عرف که طبع آن را دوست دارد و عقل آن را درک می‌کند، باشد، اما عقل بر آن حکمی نمی‌کند که به طور قطع بر خدا جاری سازد. و عقل در اثبات آخرت یا نفی آن حکمی ندارد، اما با عقل خود می‌تواند در اثبات وجودی (موجده) و اینکه وجودش به چه کسی مستند است، و صفاتی که آن وجودی باید داشته باشد، و نعت‌های جلالی که باید او را با آن تعظیم کند، نظر کند، اما نه از جهت منزلت اخروی نزد او. و با عقل خود نمی‌داند که پس از مرگ به کجا می‌رود، و این مدبر بدن نمی‌داند که چیست و از مرده به کجا می‌رود. و اگر امر از آدم با نبوت آغاز نمی‌شد، و او از آنچه در آنجاست خبر نمی‌داد، عقول متوجه نمی‌شدند، زیرا به آن‌ها اعلام شده بود که سرانجام این نفوس چیست. این همان چیزی است که آن‌ها را بر جستجو و نظر در آن و اینکه حشر نفوس پس از مرگ به کجا خواهد بود و چگونه جمع می‌شوند و صورت آنچه با آن و به سوی آن منتقل می‌شوند، و آیا آن‌ها مدبر مواد دیگری منتقل می‌شوند یا از ماده مجرد می‌گردند، و آیا قبل از تسویه بدن در تکوین وجودی داشته‌اند یا با حدوث بدن حادث شده‌اند، برانگیخت. و آن‌ها بر حکم تأثیرات در عالم وقوف یافتند، پس افلاک و حرکات کواکب را زیر نظر گرفتند و حدوث آثار را هنگام آن حرکات از روی تکرار دیدند، پس دانستند که نسبتی میان این اثر و آن حرکات وجود دارد. و اما آنچه عمرها به تکرار آن نرسید، آن به اعلام پیامبر (علیه السلام) بود که در زمان آن‌ها بود و آنچه را که خداوند به او آموخته بود و او را بر آنچه در آن حرکات علوی از آثار عنصری ذخیره کرده بود، مطلع ساخته بود، به آن‌ها رساند و حکم آن‌ها را در دنیا و آخرت به آن‌ها اعلام کرد. و هیچ یک از این‌ها از مدرکات عقول بدون توقفگاه نیست. و اگر تعریف الهی در این دنیا و سرای آخرت نبود، هیچ کس چیزی از آنچه در آنجاست نمی‌دانست.\n\n### [هر مخلوقی بر فطرت خود حق را تعظیم می‌کند]\n\nو بدان که هر مخلوقی غیر از انس و جن، بر تعظیم حق (الحق) و تسبیح به حمد او مفطور (سرشته) شده‌اند. و همچنین اعضای بدن انس و جن، همگی چنین‌اند، اما نه از جهت تقرب و طلب منزلت عظمی، بلکه تسبیح برای آن‌ها مانند نفس کشیدن برای نفس‌کشندگان است، به دلیل آنچه ذات (الحق) مستحق آن است. و تسبیح انس و جن در بهشت و جهنم نیز چنین خواهد بود، نه از طریق قربت، و برای آن‌ها قربتی به بار نمی‌آورد، بلکه هر یک از آن‌ها بر مقامی معلوم هستند. پس عبادت طبیعی می‌شود که حقایق آن‌ها اقتضای آن را دارد و تکلیف برداشته می‌شود و مخالفت با امر خدا از آن‌ها تصور نمی‌شود، هنگامی که امر بر آن‌ها وارد شود. و پس از قول خداوند به اهل آتش:\n«اخْسَؤُا فِيها ولا تُكَلِّمُونِ» (دور شوید در آن و با من سخن مگویید)،\nاصلاً نهی‌ای باقی نمی‌ماند. و سخن ما هنگامی است که مردم در منازل خود در هر سرا فرود آیند و درها بسته شود و دو سرا با اهل خود که اهل آن هستند، مستقر شوند، و شأن زمین حشر بالا رود و تمام آن آتش شود، و هر آنچه زیر مقعر فلک کواکب ثابت تا منتهای اسفل سافلین است، یک سرای واحد شود که جهنم نامیده می‌شود و شامل حرارت و زمهرير (سرمای شدید) است، و میان آن‌ها برزخ‌هایی است که در آن تکوین‌ها در پوست‌هایی رخ می‌دهد که هنگام پخته شدن (إنضاج) تبدیل در آن‌ها واقع می‌شود:\n«خالِدِينَ فِيها ما دامَتِ السَّماواتُ والْأَرْضُ» (جاودان در آن هستند تا زمانی که آسمان‌ها و زمین برقرارند).\nمنظور مدت زمانی است که زمین از روزی که خداوند آن را خلق کرد تا روز تبدیل بر آن بوده است. و عربی که قرآن به زبان او نازل شد، این لفظ را به کار می‌برد و منظور از آن تأیید (جاودانگی) است، در حالی که با خبر الهی و تعریف پیامبر (صلی الله علیه و سلم) منقطع می‌شود:\n«إِلَّا ما شاءَ رَبُّكَ» (مگر آنچه پروردگارت بخواهد)،\nبه آنچه در آتش از لذت و نعمت به آن‌ها روزی می‌شود:\n«إِنَّ رَبَّكَ فَعَّالٌ لِما يُرِيدُ» (به راستی که پروردگار تو هر چه بخواهد انجام می‌دهد).\nو در بهشت:\n«خالِدِينَ فِيها ما دامَتِ السَّماواتُ والْأَرْضُ» (جاودان در آن هستند تا زمانی که آسمان‌ها و زمین برقرارند)،\nاز حیث جوهرشان، نه از حیث صورتشان. و به همین دلیل فرمود:\n«عَطاءً غَيْرَ مَجْذُوذٍ» (عطایی که قطع نمی‌شود).\nو استثناء در قول او:\n«إِلَّا ما شاءَ رَبُّكَ» (مگر آنچه پروردگارت بخواهد)،\nاز زوال صورت آن دو واقع می‌شود، زیرا آسمان، آسمان بود و زمین، زمین. ما می‌دانیم که جوهر آسمان، جوهر دود است و صورت‌ها بر آن تبدیل شده‌اند. پس جوهری که صورت دود را پذیرفت، همان است که صورت آسمان را پذیرفت، همان‌گونه که جوهر گِل و سنگ، صورت خانه را پذیرفت. پس هنگامی که خانه ویران شود و گِل خشک شود، صورت خانه و گِل از بین می‌رود و عین جوهر باقی می‌ماند. و همچنین تمام عالم به جوهر واحد است و به صورت‌ها متفاوت. پس این را بدان. بنابراین، استثناء در حق اهل آتش برای مدت عذابشان است، و استثناء در حق اهل بهشت بر این معناست که «مگر اینکه پروردگارت بخواهد»، و او خواسته است که آن‌ها را خارج نکند، پس آن‌ها خارج نمی‌شوند، زیرا خداوند با قول خود:\n«عَطاءً غَيْرَ مَجْذُوذٍ» (عطایی که قطع نمی‌شود)،\nچنین نخواسته است. و در مورد اهل آتش نگفت: «عذابی که قطع نمی‌شود». پس بفهم. زیرا خبر صحیح متواتر وارد شده است. خداوند متعال می‌فرماید:\n«يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ والسَّماواتُ» (روزی که زمین به زمینی دیگر و آسمان‌ها [به آسمان‌هایی دیگر] تبدیل می‌شوند).\nو آسمان را وصف کرد که مانند روغن می‌شود و آن را به شکافته شدن و متلاطم شدن وصف کرد. و فرمود:\n«فَكانَتْ وَرْدَةً كَالْدِّهانِ» (پس مانند گل سرخی چون روغن گداخته شد).\nیعنی مانند روغن سرخ در رنگ و سیلان. پس همه این‌ها خبر از رفتن صورت است، نه رفتن جوهر.\nو از جمله آنچه این منزل در بر می‌گیرد، علم به آنچه خداوند از انسان خواسته است که در حال اعتبار و تفکر به آن مشغول شود، زیرا آن نظر او را به معرفت خالقش می‌رساند، نه پروردگارش. زیرا برای هر اسمی از اسماء خدا در عالم، دلیلی خاص وجود دارد که از حیث اینکه دلیل بر آن است، بر غیر آن دلالت نمی‌کند.\nو از اینجا می‌دانی که زمین از تموج آب خلق شد تا کف کرد، و آن کف، عین زمین بود، زیرا از حالت آبی به حالت کف منتقل شد، و در کف، زمین وجود دارد. و این همان سبب نفوذ صالحان در آن و نشستن مرده در قبرش با وجود پر شدن زمین بر اوست. و حکم هر آنچه از آن خلق شده، حکم آن است، و حکم آن، حکم کف است، و حکم کف، حکم آب است. و آب، خرق (شکافته شدن) را می‌پذیرد و اشیاء در آن حرکت می‌کنند. پس حکم این اصل در تمام آنچه از آن به وجود آمده، جاری می‌شود، چه متراکم باشد مانند زمین، یا لطیف باشد مانند هوا و آتش. اما آتش برای آب به منزله فرزندِ فرزند است، و زمین برای آب به منزله فرزند است، و هوا و کف برای آب به منزله فرزندان صُلبی هستند. پس آب برای آن‌ها پدر است و برای آتش از جهت هوا، پدربزرگ است، و برای زمین از جهت کف، پدربزرگ است. پس میان خلقت آدم و آب، وجود خاک و کف است. پس او (آدم) فرزندِ فرزندِ فرزند است از حیث تراکم، و همچنین به دلیل آنچه در او از آتش و هواست، فرزندِ فرزند است.\nو اما خلقت حوا، میان او و اصل (آب) سه چیز است: آدم، خاک و کف. پس او از اصل دورتر است.\nو اما خلقت بنی آدم، آن‌ها به اصل نزدیک‌تر از آدم هستند، زیرا آن‌ها از آب خلق شده‌اند. پس آن‌ها مانند کف از آب هستند. پس آن‌ها فرزندان صُلبی آب هستند، و کف برادر بنی آدم است و پدربزرگ آدم و پدر زمین است. پس بنی آدم عموهای زمین هستند. پس منزلت آدم نسبت به فرزندانش، منزلت برادرزاده نسبت به عموی پدرش است، و بنی آدم نسبت به آدم، به منزله عموی پدر او هستند. پس آن‌ها در اسناد از این جهت به سبب اول که جد اعلی است، نزدیک‌ترند، مگر به واسطه آبی که در آدم بود و خاک به واسطه آن گِل شد. پس در او الحاق به فرزند صُلبی وجود دارد، به منزله کسی که با زنی ازدواج کند در حالی که از دیگری حامله است، پس زراعت دیگری را آبیاری کند، پس به دلیل آن آبیاری، نصیبی در آن دارد.\nو اما خلقت عیسی (علیه السلام)، میان او و آب، مادرش، حوا، آدم، زمین و کف است، مگر از وجهی دیگر که او شبیه ماست و کمتر کسی بر آن آگاه می‌شود. و خداوند به آنچه ما به آن اشاره کردیم، با قول خود تنبیه فرموده است:\n«فَتَمَثَّلَ لَها بَشَراً سَوِيًّا» (پس برای او به صورت بشری کامل مجسم شد).\nهنگامی که خداوند اراده کرد، لذت با نگاه به او جاری شد، پس از آنکه مریم از او پناه خواست و او به او شناساند که فرستاده حق است تا پسری پاک به او ببخشد. پس او آماده پذیرش فرزند شد و لذت نکاح تنها با نگاه در او جاری شد، پس آب از او به رحم فرود آمد و جسم عیسی از آن آب متولد شد که ناشی از نفخی بود که موجب لذت در او شد. پس او از آب مادرش است. و طبیعیون این را انکار می‌کنند و می‌گویند که چیزی از آب زن تکوین نمی‌شود، و این صحیح نیست. و نزد ما، انسان از آب مرد و آب زن تکوین می‌شود. و از پیامبر (صلی الله علیه و سلم) که از روی هوی سخن نمی‌گوید، ثابت شده است که فرمود:\n«إذا علا ماء الرجل ماء المرأة أذكرا وإذا علا ماء المرأة ماء الرجل أنثا» (اگر آب مرد بر آب زن غلبه کند، پسر می‌شود و اگر آب زن بر آب مرد غلبه کند، دختر می‌شود).\nو در روایتی به جای «علا» (غلبه کرد)، «سبق» (پیشی گرفت) آمده است.\nپس با ضمیر مثنی در «أذكرا» و «أنثا» آمده است. و ما در کتاب نکاح خود در این فصل گفته‌ایم که اگر یکی از زن و مرد در انزال آب بر دیگری پیشی نگیرد و هر دو با هم انزال کنند، به طوری که با هم مخلوط شوند و هیچ یک از دو آب بر دیگری غلبه نکند، در آن صورت، اگر این حالت به آن صورت واقع شود، خداوند خنثی (دوجنسی) را خلق می‌کند که ذکورت و انوثت را جمع می‌کند. اگر از همه جهات مساوی و معتدل باشند و هیچ یک از آب‌ها انحراف نداشته باشد، خنثی از فرج خود حیض می‌شود و از ذکر خود منی خارج می‌کند، پس فرزند می‌دهد و فرزند می‌پذیرد از کسی که با او نکاح کند. و روایت شده است که مردی دیده شد که دو فرزند با او بود، یکی از صلب او و دیگری از بطن او. و اگر آب از اعتدال منحرف شود و به حد غلبه بر دیگری نرسد، حکم برای آنی است که به سوی غلبه منحرف شده است. پس اگر آب زن غلبه کند، خنثی حیض می‌شود و منی خارج نمی‌کند، و اگر آب مرد غلبه کند، منی خارج می‌کند و حیض نمی‌شود. پس منزه است آفریدگار توانا و دانا. و این از عجیب‌ترین برزخ‌ها در حیوان است. این برای آن است که:\n«لِتَعْلَمُوا أَنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ وأَنَّ الله قَدْ أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً» (تا بدانید که خداوند بر هر چیزی تواناست و اینکه خداوند بر هر چیزی احاطه علمی دارد).\nو علم به این مقدار از این منزل کافی است، زیرا مسائل بسیاری را در بر می‌گیرد که بیشتر آن‌ها در تولد عالم طبیعی میان حرکات افلاک و توجهات آن‌ها و توجهات کواکبشان با پرتوهای نور، و میان پذیرش عناصر و مولدات برای آثار آن انوار است. پس از آن احکام، ایجاد اعیان و مراتب و احوال ظاهر می‌شود. و این علم بزرگی و طولانی است.\nو به این منزل، علم ابتلا در غیر موطن تکلیف، و علم دیوان الهی، و علم وجوب کلمه الهی که تبدیل نمی‌شود، و علم اینکه در عالم باطل و عبثی نیست و همه آن حق است، با آنچه در آن از حق و باطل است، و اینکه چرا خداوند غالباً عقوبت‌ها را در حق اکثر مردم به سرای آخرت تأخیر انداخته و در حق دیگران تعجیل کرده است، که به آن «انفاذ وعید» (اجرای تهدید) تعبیر می‌شود، تعلق دارد. و این خبر است، و خبری که متضمن حکمی نباشد، نسخ در آن راه ندارد. پس ممکن است آنچه را که به مخالف خود وعده داده است، اجرا کند، زیرا اجرای آن را به سرایی خاص محدود نکرده است، بلکه در دنیا فرمود:\n«لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا» (تا بخشی از آنچه را که انجام داده‌اند به آن‌ها بچشاند).\nو این از جمله اجرای وعید است. پس کسانی که به قول اجرای وعید می‌روند، بر حق‌اند، اما اجرای آن در جایی است که حق تعالی آن را تعیین کند. پس اگر آن را در دنیا با بیماری و درد نفسانی یا حسی بر این مستحق وعید اجرا کند، این پوششی برای او از عقوبت آخرت است. و این همان چیزی است که در اینجا به «مغفرت» تعبیر می‌شود، یعنی در آخرت به آن مؤاخذه نمی‌شود. و این‌ها احوال بیشتر سعادتمندان و سعادتمندانی است که آتش آن‌ها را نگران نمی‌کند و:\n«لا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ» (فزع اکبر آن‌ها را غمگین نمی‌سازد)،\nهمان کسانی که:\n«فَلا خَوْفٌ عَلَيْهِمْ ولا هُمْ يَحْزَنُونَ» (نه ترسی بر آن‌هاست و نه غمگین می‌شوند).\nو به همین دلیل، ابتلای نفوس و بلای محسوس در میان مردم مانند انبیا و:\n«الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ من النَّاسِ» (کسانی که مردم را به عدالت فرمان می‌دهند)،\nعظیم بوده است؛ از رد شدن حق در روی آن‌ها و آنچه از کافران می‌شنوند که در نفوسشان آزار می‌بینند. و خداوند از این خبر داده است. و همچنین آنچه از قتل و ضرب بر آن‌ها مسلط شده است، همه این‌ها از اجرای وعید برای خطرات و حرکاتی است که بشریت و طبع اقتضای آن را دارد و شایسته مقامی که در آن هستند نیست، اما شایسته بشر است. و از اینجا قول خداوند متعال به رسولش (صلی الله علیه و سلم) شناخته می‌شود:\n«لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ» (تا خداوند گناه گذشته و آینده تو را بیامرزد).\nپس گناه را مقرر کرد و مغفرت را واقع ساخت، و از آن به بندگانش فهماند که آن‌ها را در آخرت عقوبت نمی‌کند، و مغفرت را به دنیا معلق نکرد، به دلیل آنچه در آن از دردها و بیماری‌های نفسانی و حسی است، و این عین اجرای وعید در حق آن‌هاست. و قول معتزلی در این مسئله، یعنی مسئله آزار رساندن به بی‌گناه، صحیح است. زیرا اشعری این را بر خدا جایز می‌داند، اما هر جایزی واقع نمی‌شود. و هر آنچه با آن بر معتزله احتجاج می‌کنند، چندان مهم نیست و جدا شدن از آن آسان است. و این کتاب جایگاه آوردن این علم نیست. و:\n«والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}