{
  "id": 467,
  "title": {
    "ar": "الباب السابع والستون وأربعمائة في حال قطب كان منزله الحمد لله",
    "en": "Chapter Four Hundred and Sixty-Seven: Concerning the State of a Pole (قطب) Whose Spiritual Station (منزله) Was [the Realization of] \"Praise Belongs to God (الحمد لله).\"",
    "ur": "باب چار سو سڑسٹھواں: اس قطب کے حال کے بیان میں جس کا مقام (منزل) 'الحمد للہ' تھا۔",
    "fa": "باب چهارصد و شصت و هفتم در بیان حال قطبی که منزلگاهش «الحمد لله» بود"
  },
  "content": {
    "ar": "## «الباب السابع والستون وأربعمائة في حال قطب كان منزله الحمد لله»\n\n\n> الحمد لله في قيد وإطلاق *** مثل الفروع التي قامت على ساق‏\n\n\n> يمدها بالذي تبديه من ثمر *** لشاهد الحس في أنفاس أعراق‏\n\n\n> ونحن فرع لمن أبدى حقائقنا *** ذات بذات وأخلاق بأخلاق‏\n\n\nقال الله تعالى آمرا قُلِ الْحَمْدُ لِلَّهِ‏\n\n\n### [أن الحمد والمحامد هي عواقب الثناء]\n\n\nاعلم أن الحمد والمحامد هي عواقب الثناء ولهذا يكون آخرا في الأمور كما ورد أن آخِرُ دَعْواهُمْ أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ وقوله صَلَّى اللهُ عَليهِ وسَلَّم في الحمد لله إنها تملأ الميزان‏\n\n\nأي هي آخر ما يجعل في الميزان وذلك لأن التحميد يأتي عقيب الأمور ففي السراء يقال الحمد لله المنعم المفضل وفي الضراء يقال الحمد لله على كل حال والحمد وهو الثناء على الله وهو على قسمين ثناء عليه بما هو له كالثناء بالتسبيح والتكبير والتهليل وثناء عليه بما يكون منه وهو الشكر على ما أسبغ من الآلاء والنعم وله العواقب فإن مرجع الحمد ليس إلا إلى الله فإنه المثنى على العبد والمثنى عليه وهوقوله صَلَّى اللهُ عَليهِ وسَلَّم أنت كما أثنيت على نفسك‏\n\n\nوهو الذي أثنى به العبد عليه فرد الثناء له من كونه مثنيا اسم فاعل ومن كونه مثنيا عليه اسم مفعول فعاقبة الحمد في الأمرين له تعالى وتقسيم آخر وهو أن الحمد يرد من الله مطلقا ومقيدا في اللفظ وإن كان مقيدا بالحال فإنه لا يصح في الوجود إطلاق فيه لأنه لا بد من باعث على الحمد وذلك الباعث هو الذي قيده وإن لم يتقيد لفظا كأمره في قوله تعالى قُلِ الْحَمْدُ لِلَّهِ فلم يقيد وأما المقيد فلا بد أن يكون مقيدا بصفة فعل كقوله الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ السَّماواتِ والْأَرْضَ وكقوله الْحَمْدُ لِلَّهِ الَّذِي أَنْزَلَ عَلى‏ عَبْدِهِ الْكِتابَ والْحَمْدُ لِلَّهِ فاطِرِ السَّماواتِ وقد يكون مقيدا بصفة تنزيه كقوله الْحَمْدُ لِلَّهِ الَّذِي لَمْ يَتَّخِذْ وَلَداً\n\n\n### [أن الحمد بكل وجه شكر]\n\n\nواعلم أن الحمد لما كان يعطي المزيد للحامد علمنا أن الحمد بكل وجه شكر وكذلك ما أعطى المزيد من الأذكار فهو شكر فهو حمد كله لأنه ثناء على الله فأما زيادته التي تحصل لمن أثنى عليه بما هو عليه فهي أن يعطيه الحق من العلم الذاتي به سبحانه ما يثني به عليه وهو قوله وقُلْ رَبِّ زِدْنِي عِلْماً وأما إذا أثنى عليه بما يكون منه فإنه يزيده من ذلك ليثابر عليه بالثناء على الله به فعلى كل حال يعطي الزيادة وإن كان بين التحميدين فرقان ولكن من حيث ما هو تحميد من الخلق فهو عطاء أعطاه الله إياه وكل عطاء يقبل المعطي الزيادة منه فإنا لا نحمده إلا بما أعلمنا أن نحمده به فحمده مبناه على التوقيف وقد خالفنا في ذلك جماعة من علماء الرسوم لا من العلماء الإلهيين فإن التلفظ بالحمد على جهة القربة لا يصح إلا من جهة الشرع ولو استصبح هذا المخالف بنور الإنصاف لعلم أن الصدق حسن وهو يقول به إنه حسن لذاته ومع هذا فإنه يقبح في مواطن ويأثم القائل به فلهذا لا يتمكن أن يقال على جهة القربة وإن عقل إنه خير إلا حتى يقول الحق اذكروني فأما إن يطلق بكل ذكر ينسب إليه الحسن في العرف وهو من مكارم الأخلاق وإما أن يقيده فيعين ذكرا خاصا فالثناء على الله بما هو فاعل ثناء عرفي يثني به المخلوق على الخالق ما لم ينه عنه إذا كان ذلك الثناء مما يعظم في العالم فقد يكون من حيث ما هو فاعل وليس بعظيم في العالم فإذا ذكر بما هذا مثله نكر ومثاله أن نقول الحمد لله خالق كل شي‏ء فيدخل فيه كل مخلوق معظم ومحقر ومثال‏\nالمعظم في العرف أن تقول الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ السَّماواتِ ومثل ذلك ولا ينبغي أن يعين في الثناء خلق المحقر عرفا والمستقذر طبعا وإن دخل في عموم كل شي‏ء ولكن إذا عين لا يقتضيه الأدب بل ينسب معينه إلى سوء الأدب أو فساد العقيدة مع صحة ذلك ولا أمثل به فإني أستحيي أن يقرأ مع الزمان في كتابي فلذلك لم نمثل به كما مثلت بالعام وبالعظيم والكل منه ونعمته ولو لا حقارة ذلك بالعرف لم نقل به فإني ما أرى شيئا ليس عندي بعظيم لأني أنظر بعين اعتناء الله به حيث أبرزه في الوجود فأعطاه الخير فليس عندنا أمر محتقر وهذا شهود القوم فالكل نعمته ظاهرة وباطنة فظاهرة ما شوهد منها وباطنة ما علم ولم يشهد وظاهرة التعظيم عرفا وباطنة التعظيم عند أهل الله وأهل النظر المستقيم مما ليس بعظيم في الظاهر لأن هذا الأمر شبيه بالآيات المعتادة والآيات غير المعتادة فالآيات المعتادة ما هي آيات إلا لِقَوْمٍ يَعْقِلُونَ ولا فرق بينها وبين الآيات غير المعتادة مثل حركات الأفلاك واختلاف الليل والنهار وما يظهر في فصول السنة من\n\n\nالأرزاق والأمور المعادة والمسخرات فلا يتنبه بها إلا كل ذي عقل سليم إنها آيات وأما غير المعتادة فهي آيات للجميع فتنبعث النفوس للثناء على الله بها دون المعتادة فصاحب هجير الحمد المطلق الذي لا يقيده الذاكر بشي‏ء من الصفات وإن اختلفت عليه الأحوال فما هي بواعث لذلك الذكر وإنما هو الباعث الأول الذي به أطلق الذكر فهو تقييد في إطلاق فينتج له جميع ما يعطيه كل تحميد مقيد بنعت ما من النعوت أو اسم أو صفة ما لم يقف صاحب هذا الذكر مع حال من الأحوال لما يحصل له فيه من الحلاوة فيقيده ذلك الاستحلاء وإن أطلقه في اللفظ فلا ينتج له بعد ذلك إلا ما يناسب الحال الذي أعطاه الاستحلاء فإنه ذو صفة فهو بحيث هي وزال عنه بها الحكم الأول قيل لأبي يزيد كيف أصبحت فقال لا صباح لي ولا مساء إنما الصباح والمساء لمن تقيد بالصفة وأنا لا صفة لي فلا يقف صاحب هذا الذكر مع أمر يرد عليه من الحق يقيده فهو مع كل وارد بحسب الوارد من غير تعلق بمعية فمعيته مع الوارد معية الحق مع عباده حيث ما كانوا لعلمه أنهم لا يكونون إلا بحسب أسمائه الحاكمة عليهم والمتصرفة فيهم فهو مع أسمائه لا معهم ولكن ما وقع الإخبار إلا إن الله معهم أينما كانوا كذلك الواردات لا تتعين للعبد إلا بحسب استعداده الذي أعطاه ذكره وذكره من فعله في معيته مع الواردات مع نفسه كما ذكرنا في معية الحق على السواء والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Sixty-Seven: Concerning the Spiritual State of a Pole Whose Station Was \"Praise Belongs to God\"\n\nPraise belongs to God, in restriction and in absolute freedom,\nLike the branches that stand upon a trunk.\n\nHe sustains them with that which they manifest as fruit,\nFor the witness of the senses in the breaths of origins.\n\nAnd we are a branch of Him who manifested our realities (ḥaqā’iq),\nEssence by Essence, and character traits by character traits.\n\nAllah the Exalted commanded: <<قُلِ الْحَمْدُ لِلَّهِ>> (Say: Praise belongs to God).\n\n### That Praise and Praises are the Consequences of Eulogy\n\nKnow that *al-ḥamd* (praise) and *al-maḥāmid* (praises) are the consequences (*‘awāqib*) of eulogy (*al-thanā’*). This is why it comes last in matters, as it is related: <<آخِرُ دَعْواهُمْ أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ>> (The last of their call will be: Praise belongs to God, Lord of the Worlds). And His saying (peace and blessings be upon him) concerning *Al-Ḥamd Lillāh*, that it fills the Balance, means that it is the last thing placed in the Balance.\n\nThis is because the act of praising (*al-taḥmīd*) follows after matters. In times of ease, one says: \"Praise belongs to God, the Benefactor, the Gracious.\" And in times of hardship, one says: \"Praise belongs to God in every state.\"\n\nPraise (*al-ḥamd*), which is eulogy upon God, is of two divisions: Eulogy upon Him for what is inherent to Him, such as eulogy through glorification (*tasbīḥ*), magnification (*takbīr*), and declaration of oneness (*tahlīl*); and eulogy upon Him for what proceeds from Him, which is gratitude (*shukr*) for the bounties and favors He has bestowed. To Him belong the consequences, for the return of praise is only to God. He is the one who eulogizes the servant, and the one who is eulogized. This is His saying (peace and blessings be upon him): \"You are as You have praised Yourself.\" He is the one by whom the servant eulogizes Him, so the eulogy returns to Him, both from the perspective of being the eulogizer (active participle) and from the perspective of being the eulogized (passive participle). Thus, the consequence of praise in both matters belongs to Him, the Exalted.\n\nThere is another division: that praise comes from God, absolute (*muṭlaq*) and restricted (*muqayyad*) in wording, even if it is restricted by the state (*ḥāl*), for absolute freedom is not valid in Existence (*al-wujūd*). This is because there must be an impetus (*bā‘ith*) for praise, and that impetus is what restricts it, even if it is not restricted verbally. An example is His command in His saying, the Exalted: <<قُلِ الْحَمْدُ لِلَّهِ>> (Say: Praise belongs to God), which is unrestricted.\n\nAs for the restricted, it must be restricted by an attribute of Act (*ṣifat fi‘l*), such as His saying: <<الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ السَّماواتِ والْأَرْضَ>> (Praise belongs to God, who created the heavens and the earth), and His saying: <<الْحَمْدُ لِلَّهِ الَّذِي أَنْزَلَ عَلى‏ عَبْدِهِ الْكِتابَ>> (Praise belongs to God, who sent down the Book upon His servant), and <<الْحَمْدُ لِلَّهِ فاطِرِ السَّماواتِ>> (Praise belongs to God, Originator of the heavens). It may also be restricted by an attribute of transcendence (*tanzīh*), such as His saying: <<الْحَمْدُ لِلَّهِ الَّذِي لَمْ يَتَّخِذْ وَلَداً>> (Praise belongs to God, who has not taken a son).\n\n### That Praise in Every Aspect is Gratitude\n\nKnow that since praise (*al-ḥamd*) grants increase (*al-mazīd*) to the praiser, we know that praise in every aspect is gratitude (*shukr*). Likewise, any remembrance (*dhikr*) that grants increase is gratitude; thus, it is all praise, because it is eulogy upon God.\n\nAs for the increase that accrues to the one who eulogizes Him for what He is (inherently), it is that the Real (al-Ḥaqq) grants him, from the essential Knowledge (*al-‘ilm al-dhātī*) of Him, the means by which he may eulogize Him. This is His saying: <<وَقُلْ رَبِّ زِدْنِي عِلْماً>> (And say: My Lord, increase me in knowledge). But if he eulogizes Him for what proceeds from Him (His acts), He increases him in that act so that he may persevere in praising God through it. Thus, in every state, He grants increase, even though there is a difference between the two types of praising.\n\nHowever, insofar as it is praise coming from the creation (*al-khalq*), it is a gift that God has bestowed upon them. And every gift accepts increase from the Giver. For we do not praise Him except by what He has informed us to praise Him with. Thus, His praise is based on divine instruction (*al-tawqīf*).\n\nA group of scholars of external forms (*‘ulamā’ al-rusūm*), but not the Divine Scholars (*al-‘ulamā’ al-ilāhiyyīn*), have disagreed with us on this point. For uttering praise with the intention of drawing near (*qurba*) is only valid through the channel of the Sacred Law (*al-shar‘*). If this opponent were to seek light from the lamp of fairness (*nūr al-inṣāf*), he would know that truthfulness is good—and he himself says it is good in itself—yet despite this, it becomes ugly in certain situations, and the speaker is sinful for uttering it. Therefore, it is not possible to say something with the intention of drawing near, even if it is rationally understood to be good, unless the Real (al-Ḥaqq) says: \"Remember Me.\"\n\nEither He leaves every remembrance that is customarily considered good and belongs to noble character traits unrestricted, or He restricts it and specifies a particular remembrance. Eulogy upon God for what He is as an Actor (*fā‘il*) is a customary eulogy by which the creature praises the Creator, provided it is not forbidden, and provided that eulogy is of something magnified in the World (*al-‘ālam*). For He may be an Actor in a way that is not magnified in the World. If He is mentioned by something of this nature, it is disapproved. An example is when we say: \"Praise belongs to God, Creator of everything,\" which includes every creature, whether magnified or despised.\n\nAn example of what is customarily magnified is when you say: <<الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ السَّماواتِ>> (Praise belongs to God, who created the heavens), and the like. It is not appropriate to specify in praise the creation of what is customarily despised or naturally repulsive, even if it falls under the generality of \"everything.\" However, if one specifies it, good manners (*adab*) do not require it. Rather, the one who specifies it is attributed with bad manners or corruption of belief, even though the statement itself is true. I will not give an example of this, for I am ashamed that it might be read in my book over time. For this reason, I did not give an example of it, just as I gave examples of the general and the magnificent. Everything is from Him and His favor.\n\nWere it not for the customary contempt for that thing, we would not have mentioned it. For I do not see anything that is not magnificent in my view, because I look with the eye of God’s attention to it, since He brought it forth into Existence (*al-wujūd*) and granted it goodness. Thus, there is nothing despised in our view. This is the witnessing (*shuhūd*) of the People (Sufis). Everything is His favor, manifest (*ẓāhirah*) and hidden (*bāṭinah*). The manifest is what is witnessed of it, and the hidden is what is known but not witnessed. The manifest is what is customarily magnified, and the hidden is what is magnified by the People of God and the People of sound contemplation, even if it is not magnificent outwardly.\n\nThis matter is similar to the customary signs (*āyāt*) and the non-customary signs. The customary signs are only signs <<لِقَوْمٍ يَعْقِلُونَ>> (for a people who understand), and there is no difference between them and the non-customary signs, such as the movements of the celestial spheres, the alternation of night and day, and what appears in the seasons of the year in terms of provisions, recurring matters, and subjugated things. Only those possessing a sound intellect realize that these are signs. As for the non-customary signs, they are signs for everyone, so souls are moved to praise God through them, unlike the customary ones.\n\nThe possessor of the constant practice (*hajīr*) of absolute praise (*al-ḥamd al-muṭlaq*)—which the rememberer does not restrict with any of the Attributes (*ṣifāt*), even if the states change upon him—those states are not the impetuses for that remembrance. Rather, the impetus is the First Impetus, by which the remembrance was made absolute. Thus, it is restriction within absolute freedom. This yields for him everything that is granted by every praise restricted by any description, Name, or Attribute.\n\nThis is provided that the possessor of this remembrance does not stop at one of the states due to the sweetness (*ḥalāwah*) he finds in it, thereby restricting him through that enjoyment, even if he utters it absolutely in wording. After that, it will only yield for him what corresponds to the state that granted him the enjoyment, for he is then characterized by an attribute, existing according to it, and the First Ruling is removed from him by it.\n\nIt was said to Abū Yazīd: \"How did you wake up?\" He replied: \"I have neither morning nor evening. Morning and evening belong only to one who is restricted by an attribute, and I have no attribute.\"\n\nThus, the possessor of this remembrance does not stop at any matter that comes to him from the Real (al-Ḥaqq) that would restrict him. He is with every incoming spiritual influx (*wārid*) according to that influx, without attachment to a specific companionship (*ma‘iyyah*). His companionship with the influx is like the companionship of the Real (al-Ḥaqq) with His servants wherever they may be, due to his knowledge that they only exist according to His Names that govern them and dispose of them. So he is with His Names, not with them. However, the divine report only stated that God is with them wherever they may be.\n\nLikewise, the influxes are only determined for the servant according to his preparedness (*isti‘dād*) granted by his remembrance, and his remembrance is from his own act. Thus, his companionship with the influxes is with himself, just as we mentioned concerning the companionship of the Real (al-Ḥaqq), equally. And <<وَاللهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And God speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو سڑسٹھ، اس قطب کے حال میں جس کا مقام \"الحمد للہ\" تھا۔\n\nحمد ہے اللہ کے لیے، قید میں بھی اور اطلاق میں بھی،\nان شاخوں کی مانند جو تنے پر قائم ہیں۔\nوہ انہیں اس پھل سے مدد دیتا ہے جو وہ ظاہر کرتی ہیں،\nحس کے شاہد کے لیے، رگوں کی سانسوں میں۔\nاور ہم اس کے لیے شاخ ہیں جس نے ہماری حقیقتوں کو ظاہر کیا،\nذات کے ساتھ ذات اور اخلاق کے ساتھ اخلاق۔\n\nاللہ تعالیٰ نے حکم دیتے ہوئے فرمایا: \"کہہ دیجیے: سب تعریف اللہ کے لیے ہے۔\" (قُلِ الْحَمْدُ لِلَّهِ)\n\n### [یہ کہ حمد اور محامد ثناء کے نتائج ہیں]\n\nجان لو کہ حمد اور محامد ثناء کے نتائج ہیں، اور اسی لیے یہ معاملات میں آخر میں آتے ہیں، جیسا کہ وارد ہوا ہے: \"اور ان کی آخری پکار یہ ہوگی کہ سب تعریف اللہ کے لیے ہے جو تمام جہانوں کا رب ہے۔\" (آخِرُ دَعْواهُمْ أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ) اور نبی اکرم صلی اللہ علیہ وسلم کا فرمان \"الحمد للہ\" کے بارے میں کہ یہ میزان کو بھر دیتی ہے۔\n\nیعنی یہ آخری چیز ہے جو میزان میں رکھی جائے گی، اور یہ اس لیے ہے کہ تحمید (حمد کرنا) معاملات کے بعد آتا ہے۔ چنانچہ خوشحالی میں کہا جاتا ہے: \"الحمد للہ، احسان کرنے والا، فضیلت دینے والا۔\" اور تنگی میں کہا جاتا ہے: \"الحمد للہ علی کل حال۔\" اور حمد، جو کہ اللہ پر ثناء ہے، دو قسموں پر ہے: ایک وہ ثناء جو اس پر اس کی ذات کے اعتبار سے ہو، جیسے تسبیح، تکبیر اور تہلیل کے ذریعے ثناء کرنا۔ اور دوسری وہ ثناء جو اس سے صادر ہونے والے افعال پر ہو، اور وہ ان نعمتوں اور احسانات پر شکر ہے جو اس نے عطا کیے۔ اور اسی کے لیے نتائج (عواقب) ہیں۔ کیونکہ حمد کا مرجع صرف اللہ کی طرف ہے، اس لیے کہ وہ بندے پر ثناء کرنے والا (المثنى) بھی ہے اور وہ جس پر ثناء کی جائے (المثنى عليه) بھی ہے۔ اور یہی نبی اکرم صلی اللہ علیہ وسلم کا فرمان ہے: \"تو ویسا ہی ہے جیسا تو نے خود اپنی ثناء کی۔\"\n\nاور وہ (اللہ) ہی ہے جس کی ثناء بندے نے اس پر کی، تو ثناء اس کی طرف لوٹ گئی، اس حیثیت سے کہ وہ ثناء کرنے والا (اسم فاعل) ہے اور اس حیثیت سے کہ وہ جس پر ثناء کی گئی (اسم مفعول) ہے۔ پس دونوں صورتوں میں حمد کا نتیجہ (عاقبة) اسی ذات حق (الحق) کے لیے ہے۔ اور ایک دوسری تقسیم یہ ہے کہ حمد اللہ کی طرف سے لفظ میں مطلق اور مقید دونوں طرح وارد ہوتی ہے، اگرچہ وہ حال کے اعتبار سے مقید ہی ہو۔ کیونکہ الوجود (ہستی) میں اس میں مطلق ہونا صحیح نہیں ہے، اس لیے کہ حمد کے لیے کوئی نہ کوئی محرک (باعث) ضرور ہوتا ہے، اور وہی محرک اسے مقید کرتا ہے، اگرچہ لفظاً مقید نہ ہو۔ جیسے اس کا حکم اس فرمان میں: \"کہہ دیجیے: سب تعریف اللہ کے لیے ہے۔\" (قُلِ الْحَمْدُ لِلَّهِ) تو یہاں قید نہیں لگائی گئی۔ اور جو مقید ہے، وہ لازماً کسی صفتِ فعل کے ساتھ مقید ہوگا، جیسے اس کا فرمان: \"سب تعریف اللہ کے لیے ہے جس نے آسمانوں اور زمین کو پیدا کیا۔\" (الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ السَّماواتِ والْأَرْضَ) اور جیسے اس کا فرمان: \"سب تعریف اللہ کے لیے ہے جس نے اپنے بندے پر کتاب نازل کی۔\" (الْحَمْدُ لِلَّهِ الَّذِي أَنْزَلَ عَلى‏ عَبْدِهِ الْكِتابَ) اور \"سب تعریف اللہ کے لیے ہے جو آسمانوں کا بنانے والا ہے۔\" (الْحَمْدُ لِلَّهِ فاطِرِ السَّماواتِ) اور کبھی یہ کسی صفتِ تنزیہ کے ساتھ مقید ہوتا ہے، جیسے اس کا فرمان: \"سب تعریف اللہ کے لیے ہے جس نے کوئی بیٹا نہیں بنایا۔\" (الْحَمْدُ لِلَّهِ الَّذِي لَمْ يَتَّخِذْ وَلَداً)\n\n### [یہ کہ ہر لحاظ سے حمد شکر ہے]\n\nاور جان لو کہ چونکہ حمد حامد کو مزید عطا کرتی ہے، اس لیے ہم نے جانا کہ ہر لحاظ سے حمد شکر ہے۔ اور اسی طرح جو بھی اذکار مزید عطا کرتے ہیں، وہ شکر ہیں، پس وہ سب حمد ہیں کیونکہ وہ اللہ پر ثناء ہیں۔ لیکن وہ زیادتی جو اس شخص کو حاصل ہوتی ہے جو اس پر اس کی ذات کے اعتبار سے ثناء کرتا ہے، وہ یہ ہے کہ ذات حق (الحق) اسے اپنے بارے میں ذاتی علم (العلم الذاتي) میں سے وہ کچھ عطا کرتا ہے جس کے ذریعے وہ اس کی ثناء کرے۔ اور یہی اس کا فرمان ہے: \"اور کہیے: اے میرے رب! میرے علم میں اضافہ فرما۔\" (وَقُلْ رَبِّ زِدْنِي عِلْماً) اور جب وہ اس پر اس کے افعال کے اعتبار سے ثناء کرتا ہے، تو وہ اسے اس میں مزید اضافہ دیتا ہے تاکہ وہ اس کے ذریعے اللہ پر ثناء کرنے میں ثابت قدم رہے۔ پس ہر حال میں وہ زیادتی عطا کرتا ہے، اگرچہ دونوں تحمیدوں میں فرق ہے۔ لیکن اس حیثیت سے کہ یہ مخلوق کی طرف سے تحمید ہے، یہ ایک عطیہ ہے جو اللہ نے اسے دیا ہے، اور ہر عطیہ دینے والے سے زیادتی قبول کرتا ہے۔ کیونکہ ہم اس کی حمد نہیں کرتے مگر اسی چیز کے ذریعے جس کی حمد کرنے کا اس نے ہمیں علم دیا۔ پس اس کی حمد کی بنیاد توقیف (شرعی رہنمائی) پر ہے۔ اس معاملے میں علماء الرسوم (ظاہری علوم کے علماء) کی ایک جماعت نے ہماری مخالفت کی ہے، نہ کہ علماء الٰہیین (اہلِ معرفت) نے۔ کیونکہ قربت کی نیت سے حمد کا تلفظ شرع کی طرف سے اجازت کے بغیر صحیح نہیں ہے۔ اگر یہ مخالف انصاف کے نور سے روشنی حاصل کرتا تو جان لیتا کہ سچائی اچھی ہے، اور وہ خود بھی کہتا ہے کہ یہ اپنی ذات میں اچھی ہے، اس کے باوجود یہ بعض مقامات پر قبیح ہو جاتی ہے اور اسے کہنے والا گنہگار ہوتا ہے۔ اسی لیے قربت کی نیت سے اسے کہنا ممکن نہیں، اگرچہ عقل اسے خیر سمجھے، جب تک کہ ذات حق (الحق) یہ نہ کہے کہ \"مجھے یاد کرو۔\" یا تو وہ ہر اس ذکر کے ساتھ مطلق ہو جائے جسے عرف میں حسن سمجھا جاتا ہے اور جو مکارم اخلاق میں سے ہے، یا وہ اسے مقید کر دے اور کسی خاص ذکر کو متعین کرے۔ پس اللہ پر اس کے فاعل ہونے کی حیثیت سے ثناء کرنا ایک عرفی ثناء ہے جو مخلوق خالق پر کرتا ہے، جب تک کہ اس سے منع نہ کیا گیا ہو، بشرطیکہ وہ ثناء دنیا میں تعظیم کا باعث ہو۔ کبھی ایسا بھی ہوتا ہے کہ وہ فاعل ہونے کی حیثیت سے ہو لیکن دنیا میں عظیم نہ ہو۔ جب اس جیسی چیز کا ذکر کیا جاتا ہے تو اسے ناپسند کیا جاتا ہے۔ اس کی مثال یہ ہے کہ ہم کہیں: \"الحمد للہ، ہر چیز کا خالق۔\" تو اس میں ہر معظم اور حقیر مخلوق شامل ہو جاتی ہے۔ اور عرف میں معظم کی مثال یہ ہے کہ آپ کہیں: \"سب تعریف اللہ کے لیے ہے جس نے آسمانوں کو پیدا کیا۔\" (الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ السَّماواتِ) اور اسی طرح۔ اور ثناء میں عرفاً حقیر اور طبعاً مکروہ چیز کی تخلیق کو متعین نہیں کرنا چاہیے، اگرچہ وہ \"ہر چیز\" کے عموم میں داخل ہو۔ لیکن جب اسے متعین کیا جائے تو یہ ادب کا تقاضا نہیں، بلکہ اس کے متعین کرنے والے کو سوءِ ادب یا عقیدے کی خرابی کی طرف منسوب کیا جاتا ہے، حالانکہ وہ چیز صحیح ہوتی ہے۔ اور میں اس کی مثال نہیں دوں گا، کیونکہ مجھے شرم آتی ہے کہ زمانے کے ساتھ میری کتاب میں اسے پڑھا جائے۔ اسی لیے ہم نے اس کی مثال نہیں دی، جیسا کہ ہم نے عام اور عظیم کی مثال دی، حالانکہ سب کچھ اسی کی طرف سے ہے اور اسی کی نعمت ہے۔ اگر عرف کے لحاظ سے اس کی حقارت نہ ہوتی تو ہم یہ بات نہ کہتے۔ کیونکہ میں کسی بھی چیز کو حقیر نہیں سمجھتا، اس لیے کہ میں اسے اللہ کی توجہ کی نگاہ سے دیکھتا ہوں، جب اس نے اسے الوجود (ہستی) میں ظاہر کیا اور اسے خیر عطا کیا۔ پس ہمارے نزدیک کوئی حقیر امر نہیں ہے۔ اور یہ اہل اللہ کا شہود (الشہود) ہے۔ پس سب کچھ اس کی ظاہری اور باطنی نعمت ہے۔ ظاہری وہ ہے جس کا شہود (الشہود) کیا گیا، اور باطنی وہ ہے جس کا علم ہوا لیکن شہود نہیں کیا گیا۔ اور ظاہری وہ ہے جو عرف میں تعظیم کا حامل ہے، اور باطنی وہ ہے جو اہل اللہ اور اہل نظر مستقیم کے نزدیک تعظیم کا حامل ہے، اگرچہ وہ ظاہر میں عظیم نہ ہو۔ کیونکہ یہ معاملہ معتاد (عام) آیات اور غیر معتاد (غیر معمولی) آیات سے مشابہ ہے۔ پس معتاد آیات صرف \"عقل رکھنے والوں کے لیے\" (لِقَوْمٍ يَعْقِلُونَ) ہی آیات ہیں، اور ان میں اور غیر معتاد آیات میں کوئی فرق نہیں، جیسے افلاک کی حرکتیں، رات اور دن کا اختلاف، اور جو کچھ موسموں میں رزق اور مکرر امور اور مسخرات (تابع کی گئی چیزوں) کی صورت میں ظاہر ہوتا ہے۔ ان پر صرف ہر سلیم العقل شخص ہی متنبہ ہوتا ہے کہ یہ آیات ہیں۔ لیکن غیر معتاد آیات سب کے لیے آیات ہیں، تو ان کے ذریعے اللہ پر ثناء کرنے کے لیے نفوس ابھرتے ہیں، معتاد آیات کے ذریعے نہیں۔\n\nپس مطلق حمد کا ورد کرنے والا (صاحب ہجیر الحمد المطلق) وہ ہے جو ذاکر کو کسی بھی صفت کے ساتھ مقید نہیں کرتا، اگرچہ اس پر احوال مختلف ہوں۔ وہ احوال اس ذکر کے محرک نہیں ہوتے، بلکہ وہ پہلا محرک (الباعث الأول) ہوتا ہے جس کے ذریعے ذکر کو مطلق کیا گیا۔ پس یہ اطلاق میں ایک قید ہے۔ تو یہ اسے وہ سب کچھ نتیجہ میں دیتا ہے جو ہر وہ تحمید دیتی ہے جو کسی بھی نعت، اسم یا صفت کے ساتھ مقید ہو۔ بشرطیکہ اس ذکر کا صاحب کسی حال پر نہ ٹھہر جائے، اس مٹھاس کی وجہ سے جو اسے اس حال میں حاصل ہوتی ہے، اور وہ مٹھاس اسے مقید کر دے، اگرچہ وہ لفظ میں اسے مطلق ہی کہے۔ تو اس کے بعد اسے صرف وہی نتیجہ حاصل ہوگا جو اس حال کے مناسب ہو جس نے اسے مٹھاس عطا کی، کیونکہ وہ صاحبِ صفت ہو گیا، پس وہ اسی صفت کے مطابق ہے اور اس سے پہلا حکم زائل ہو گیا۔ ابو یزید سے پوچھا گیا: \"آپ نے صبح کیسے کی؟\" تو انہوں نے فرمایا: \"میری نہ کوئی صبح ہے اور نہ کوئی شام۔ صبح اور شام تو اس کے لیے ہے جو صفت کے ساتھ مقید ہو، اور میری کوئی صفت نہیں ہے۔\" پس اس ذکر کا صاحب ذات حق (الحق) کی طرف سے وارد ہونے والے کسی ایسے امر پر نہیں ٹھہرتا جو اسے مقید کرے۔ پس وہ ہر وارد (وارد ہونے والے امر) کے ساتھ وارد کے مطابق ہوتا ہے، بغیر کسی معیت (ساتھ ہونے) کے تعلق کے۔ پس وارد کے ساتھ اس کی معیت (ساتھ ہونا) ایسی ہی ہے جیسے ذات حق (الحق) کی اپنے بندوں کے ساتھ معیت جہاں کہیں بھی وہ ہوں۔ کیونکہ وہ جانتا ہے کہ وہ صرف اس کے حاکم اسماء کے مطابق ہی ہوتے ہیں جو ان میں تصرف کرتے ہیں۔ پس وہ اپنے اسماء کے ساتھ ہے نہ کہ ان کے ساتھ۔ لیکن خبر صرف یہی واقع ہوئی ہے کہ \"اللہ ان کے ساتھ ہے جہاں کہیں بھی وہ ہوں۔\" اسی طرح واردات (الوارِدات) بھی بندے کے لیے صرف اس کی استعداد کے مطابق ہی متعین ہوتی ہیں جو اس کے ذکر نے اسے عطا کی، اور اس کا ذکر اس کے فعل میں سے ہے۔ پس واردات کے ساتھ اس کی معیت (ساتھ ہونا) اس کی اپنی ذات کے ساتھ ہے، جیسا کہ ہم نے ذات حق (الحق) کی معیت کے بارے میں یکساں طور پر ذکر کیا۔ اور اللہ حق فرماتا ہے اور وہی سیدھے راستے کی رہنمائی کرتا ہے۔ (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)",
    "fa": "باب چهارصد و شصت و هفتم در بیان حال قطبی (قطب) که منزل او \"الحمد لله\" بود\n\nحمد (الحمد لله) در قید و اطلاق، *** مانند شاخه‌هایی است که بر ساقه‌ای ایستاده‌اند.\n\nآن را با آنچه از میوه آشکار می‌سازد، مدد می‌رساند، *** برای شاهد حس در دم‌های رگ‌ها (أعراق).\n\nو ما فرع کسی هستیم که حقایق ما را آشکار ساخت، *** ذات به ذات و اخلاق به اخلاق.\n\nخداوند متعال امرکنان فرمود: بگو: حمد از آن خداست (قُلِ الْحَمْدُ لِلَّهِ).\n\n### [اینکه حمد و ستایش‌ها (المحامد) عواقب ثنا هستند]\n\nبدان که حمد و ستایش‌ها (المحامد) عواقب ثنا هستند و به همین دلیل در امور در آخر می‌آیند، چنانکه وارد شده است: «آخرین دعایشان این است که: حمد از آن خداست، پروردگار جهانیان (آخِرُ دَعْواهُمْ أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ)». و سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) درباره «الحمد لله» این است که ترازو را پر می‌کند.\n\nیعنی حمد آخرین چیزی است که در ترازو قرار داده می‌شود، و این بدان سبب است که تحمید پس از امور می‌آید. در خوشی گفته می‌شود: «الحمد لله، بخشنده و فضل‌کننده»، و در سختی گفته می‌شود: «الحمد لله علی کل حال». حمد، که همان ثنا بر خداوند است، بر دو قسم است: ثنا بر او به آنچه شایسته اوست، مانند ثنا به تسبیح و تکبیر و تهلیل؛ و ثنا بر او به آنچه از او صادر می‌شود، که همان شکر بر نعمت‌ها و عطایایی است که گسترانیده است. و عواقب از آن اوست، زیرا مرجع حمد جز به سوی خداوند نیست؛ اوست که ثناکننده بر بنده و ثناشونده است. و این همان سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) است که: «تو چنان هستی که خود بر خویشتن ثنا گفتی (أنت كما أثنيت على نفسك)».\n\nو اوست که بنده با آن بر او ثنا گفته است، پس ثنا به او باز می‌گردد، هم از جهت اینکه ثناکننده (اسم فاعل) است و هم از جهت اینکه ثناشونده (اسم مفعول) است. بنابراین، عاقبت حمد در هر دو امر از آن او تعالی است. و تقسیم دیگری نیز وجود دارد، و آن اینکه حمد از جانب خداوند به صورت مطلق و مقید در لفظ وارد شده است، اگرچه در حال مقید است، زیرا در هستی (الوجود) اطلاقی در آن صحیح نیست، چرا که ناگزیر باید محرکی برای حمد وجود داشته باشد، و آن محرک همان است که آن را مقید ساخته، هرچند در لفظ مقید نشده باشد، مانند امر او در این سخن متعال: بگو: حمد از آن خداست (قُلِ الْحَمْدُ لِلَّهِ)، که مقید نشده است. اما مقید ناگزیر باید به صفت فعلی مقید باشد، مانند سخن او: حمد از آن خداوندی است که آسمان‌ها و زمین را آفرید (الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ السَّماواتِ والْأَرْضَ)، و مانند سخن او: حمد از آن خداوندی است که کتاب را بر بنده خود نازل کرد (الْحَمْدُ لِلَّهِ الَّذِي أَنْزَلَ عَلى‏ عَبْدِهِ الْكِتابَ)، و حمد از آن خداوندی است که آفریننده آسمان‌هاست (الْحَمْدُ لِلَّهِ فاطِرِ السَّماواتِ). و گاهی ممکن است به صفت تنزیهی مقید باشد، مانند سخن او: حمد از آن خداوندی است که فرزندی نگرفته است (الْحَمْدُ لِلَّهِ الَّذِي لَمْ يَتَّخِذْ وَلَداً).\n\n### [اینکه حمد از هر جهت شکر است]\n\nو بدان، از آنجا که حمد به حامد فزونی می‌بخشد، دانستیم که حمد از هر جهت شکر است. و همچنین هر ذکری که فزونی بخشد، شکر است، پس تماماً حمد است، زیرا ثنا بر خداوند است. اما فزونی‌ای که برای کسی که بر او ثنا می‌گوید به آنچه شایسته اوست حاصل می‌شود، این است که حق (الحق) از علم ذاتی به خودش (سبحانه) به او عطا کند تا با آن بر او ثنا گوید، و این همان سخن اوست: و بگو: پروردگارا، علم مرا بیفزای (وَقُلْ رَبِّ زِدْنِي عِلْماً). و اما اگر بر او به آنچه از او صادر می‌شود ثنا گوید، از همان چیز به او فزونی می‌دهد تا با ثنا بر خداوند به آن مداومت ورزد. پس در هر حال فزونی می‌بخشد، اگرچه میان این دو تحمید تفاوت‌هایی وجود دارد. اما از آن حیث که تحمید از سوی خلق است، عطایی است که خداوند به او داده است، و هر عطایی که معطی از آن فزونی بپذیرد [حمد است]. زیرا ما او را حمد نمی‌کنیم مگر به آنچه به ما آموخته که او را با آن حمد کنیم. پس بنای حمد او بر توقیف است.\n\nو گروهی از علمای رسوم (علماء الرسوم)، نه علمای الهی (العلماء الإلهيين)، در این باره با ما مخالفت کرده‌اند، زیرا تلفظ به حمد به قصد قربت جز از طریق شرع صحیح نیست. اگر این مخالف با نور انصاف روشن می‌شد، می‌دانست که صدق نیکوست و او خود می‌گوید که صدق ذاتاً نیکوست، با این حال در مواطنی زشت شمرده می‌شود و گوینده آن گناهکار می‌گردد. به همین دلیل، نمی‌توان گفت که به قصد قربت است، اگرچه درک شود که خیر است، مگر اینکه حق (الحق) بگوید: مرا یاد کنید. اما اینکه هر ذکری را که در عرف به او نسبت داده می‌شود و از مکارم اخلاق است، به طور مطلق به کار برد، یا اینکه آن را مقید سازد و ذکر خاصی را معین کند [موضوع بحث است]. پس ثنا بر خداوند به آنچه فاعل آن است، ثنایی عرفی است که مخلوق با آن بر خالق ثنا می‌گوید، مادامی که از آن نهی نشده باشد، اگر آن ثنا از چیزهایی باشد که در عالم بزرگ شمرده می‌شود.\n\nچه بسا [آن فعل] از حیث فاعل بودن باشد، اما در عالم بزرگ شمرده نشود. پس اگر با چیزی که مانند این است ذکر شود، ناپسند می‌آید. مثال آن این است که بگوییم: «حمد از آن خداست، آفریننده هر چیز»، که در آن هر مخلوق بزرگ و کوچک شمرده شده‌ای داخل می‌شود. و مثال بزرگ شمرده شده در عرف این است که بگویی: حمد از آن خداوندی است که آسمان‌ها را آفرید (الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ السَّماواتِ) و مانند آن. و شایسته نیست که در ثنا، آفرینش آنچه در عرف کوچک و در طبع ناپسند شمرده می‌شود، معین گردد، اگرچه در عموم «هر چیز» داخل است. اما اگر معین شود، ادب آن را اقتضا نمی‌کند، بلکه معین‌کننده آن را به سوء ادب یا فساد عقیده نسبت می‌دهند، با وجود صحت آن [آفرینش]. و من مثالی برای آن نمی‌آورم، زیرا شرم دارم که در گذر زمان در کتاب من خوانده شود. به همین دلیل، برای آن مثال نیاوردیم، چنانکه برای عام و عظیم مثال آوردم. و همه چیز از او و نعمت اوست.\n\nو اگر حقارت آن در عرف نبود، ما این سخن را نمی‌گفتیم. زیرا من چیزی را نمی‌بینم که نزد من عظیم نباشد، چرا که با چشم عنایت خداوند به آن می‌نگرم، آنجا که آن را در هستی (الوجود) آشکار ساخت و خیر به آن عطا کرد. پس نزد ما امر حقیری وجود ندارد. و این شهود (الشهود) اهل [عرفان] است. پس همه چیز نعمت اوست، چه ظاهر و چه باطن. ظاهر، آنچه از آن مشاهده شده است؛ و باطن، آنچه دانسته شده ولی مشاهده نشده است. و ظاهر، تعظیم عرفی است؛ و باطن، تعظیم نزد اهل الله و اهل نظر مستقیم است، نسبت به آنچه در ظاهر عظیم نیست. زیرا این امر شبیه آیات معتاد و آیات غیرمعتاد است.\n\nپس آیات معتاد، آیات نیستند مگر برای گروهی که تعقل می‌کنند (لِقَوْمٍ يَعْقِلُونَ)، و تفاوتی میان آن‌ها و آیات غیرمعتاد نیست، مانند حرکات افلاک و اختلاف شب و روز و آنچه در فصول سال از روزی‌ها و امور تکراری و مسخرات آشکار می‌شود. پس جز هر صاحب عقل سلیمی متوجه نمی‌شود که این‌ها آیات هستند. اما آیات غیرمعتاد، برای همگان آیات هستند، و نفوس برای ثنا بر خداوند به واسطه آن‌ها برانگیخته می‌شوند، برخلاف آیات معتاد.\n\nپس صاحب عادت حمد مطلق، که ذاکر آن را به هیچ یک از صفات مقید نمی‌سازد، اگرچه احوال بر او مختلف شوند، آن احوال محرک آن ذکر نیستند، بلکه محرک، همان محرک اول است که به واسطه آن ذکر را مطلق ساخته است. پس این تقیید در اطلاق است. و نتیجه آن، تمام چیزی است که هر تحمید مقید به نعت یا اسم یا صفتی از صفات به او عطا می‌کند، مادامی که صاحب این ذکر با حالی از احوال توقف نکند، به دلیل حلاوتی که در آن حال برایش حاصل می‌شود، و آن شیرینی او را مقید سازد، اگرچه در لفظ آن را مطلق بگوید. پس از آن، جز آنچه مناسب حالی است که آن شیرینی به او داده است، برایش نتیجه نمی‌دهد، زیرا او صاحب صفت شده است و در همان موضع قرار دارد و حکم اول به واسطه آن از او زائل گشته است.\n\nبه ابویزید گفته شد: چگونه صبح کردی؟ گفت: مرا صباح و مسایی نیست. صباح و مساء برای کسی است که به صفت مقید شده باشد، و من صفتی ندارم. پس صاحب این ذکر با امری که از حق (الحق) بر او وارد می‌شود و او را مقید می‌سازد، توقف نمی‌کند. او با هر واردی به حسب آن وارد است، بدون تعلق به معیّت. پس معیّت او با وارد، همانند معیّت حق (الحق) با بندگانش است، هر کجا که باشند، زیرا می‌داند که آن‌ها جز به حسب اسماء حاکم بر آن‌ها و متصرف در آن‌ها نیستند. پس او با اسماء خود است، نه با آن‌ها. اما خبر جز این واقع نشده که خداوند با آن‌هاست هر کجا که باشند. همچنین واردات جز به حسب استعداد بنده که ذکرش به او عطا کرده، برای او معین نمی‌شوند، و ذکر او از فعل اوست. پس معیّت او با واردات، با نفس خود اوست، همان‌گونه که در مورد معیّت حق (الحق) به طور مساوی ذکر کردیم. و خداوند حق (الْحَقَّ) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}