{
  "id": 494,
  "title": {
    "ar": "الباب الرابع والتسعون وأربعمائة في معرفة حال قطب كان منزله إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ وما أشبه هذا من الآيات القرآنية",
    "en": "Chapter Four Hundred and Ninety-Four: Concerning the knowledge of the state (حال) of a Pole (قطب) whose station (منزل) was [the meaning of the verse]: <<Only those of His servants who possess knowledge fear Allah>> (إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ), and similar Quranic verses.",
    "ur": "باب چار سو چورانوے: ایک قطب (Quṭb) کے حال کی معرفت (Ma'rifah) کے بیان میں جس کا روحانی منزل (Manzil) یہ آیت تھی: إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ (اللہ سے اس کے بندوں میں سے صرف وہی ڈرتے ہیں جو علم رکھتے ہیں) اور جو کچھ اس سے مشابہ قرآن کی آیات ہیں۔",
    "fa": "باب چهارصد و نود و چهارم در معرفت حال قطبی که منزلگاهش این بود: «إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ» (همانا از میان بندگان خدا، تنها دانایان از او می‌ترسند) و آنچه شبیه این از آیات قرآنی است."
  },
  "content": {
    "ar": "## «الباب الرابع والتسعون وأربعمائة في معرفة حال قطب كان منزله إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ وما أشبه هذا من الآيات القرآنية»\n\n\n> إنما يخشى الإله الحق من *** يعلم الحق ويبقى رسمه‏\n\n\n> فإذا ما فنى الكل به *** فنى العالم فيه واسمه‏\n\n\n> إنما العلم الذي ينفعنا *** كل علم قد شهدنا حكمه‏\n\n\n> فهو العلم الذي نعرفه *** وبه يعلم علمي علمه‏\n\n\n### [الخشية من صفات العلم‏]\n\n\nالخشية من صفات العلم الذي يعطي الخشية اللازمة له وعلى قدر العلم بها تكون الخشية المنسوبة إلى العالم ولا أعلم بها ممن علمه عينه فلا أخشى منه للاسم الله لجمع هذا الاسم بين الأضداد المتقابلات ومن هنا نزل قوله حَتَّى نَعْلَمَ ولما كان الأمر الذي هو علة ظهور الممكنات أينما ظهر منها ليس إلا أحكام الأسماء الإلهية فما من اسم إلهي إلا وهو يخشى الله لعلمه بما عنده من الأسماء التي تقابل هذا الاسم الوالي في الحال صاحب الحكم فيقول كما وولاني ولم أكن واليا على هذا المحل الخاص الذي ظهر فيه حكمي قد يعزلني عن ذلك بوال آخر يعني بحكم اسم آخر إلهي فلا أعلم من الأسماء الإلهية فلا أخشى منها لله فإن الله له التصرف فيها بالتولي والعزل وهو الواقع في الوجود فمنها ما يقع عن سؤال من الكون ومنها ما يقع عن غير سؤال بل يقع بانتهاء مدة الحكم فيكون نسخا فكما انطلق على العلماء من المحدثات اسم الخشية لله انطلق على الأسماء الخشية لله ولسؤال المحدثات في رفع أحكام الأسماء الإلهية صارت الأسماء الإلهية التي لها الحكم في الوقت تخشى سؤال المحدثات الله في رفع حكمها عن ذلك المحل كقول أيوب عليه السلام إِذْ نادى‏ رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ يطلب عزل الاسم الضار وإزالة حكمه فعزل الله حكمه فانعزل بزوال حكمه وتولى موضعه الاسم النافع فكشف الله ما به من ضر فصارت الأسماء الإلهية تخشى الله لما بيده من العزل والتولية وتخشى العالم لما عنده من السؤال وعند الله من القبول لسؤال العالم ولا سيما أهل الاضطرار ثم ننظر إلى انتهاء مدة أحكامها فتترقب العزل كما أيضا ترجوه لمشاهدتهم التولية فلا شي‏ء من الأسماء أكثر خشية من المنتقم فإنه يرى ويشاهد زوال حكمه فعلا ولا يبقى له حكم في الوجود ويكون بالقوة في الحق ومن جرى مجراه من الأسماء الإلهية فتفطن لخشية الأسماء الإلهية العالم فإنك إذا كوشفت عليه رأيت أنه لو لا ما هو حق بوجه ما صح أن تخشاه الأسماء الإلهية لأنه لا يخشى ولا يرجى في الحقيقة إلا الله ولا يخشاه إلا العالم ولا أعلم من الله فلا يخشى الله إلا الله لكن الصور مختلفة لاختلاف النسب أو النسب مختلفة لاختلاف الصور فلو لا النسب ما حدثت الصور ولو لا الصور ما علم اختلاف النسب فالوجود مربوط بعضه ببعضه فإبرامه عين نقضه ثم إنه في هذا الذكر إِنَّ الله عَزِيزٌ غَفُورٌ فعزته امتناعه تعالى عن أن يكون له حكم الأسماء الإلهية من نظر بعضها إلى بعض كما ينظر العالم بعضه إلى بعض فيتصف لذلك بالخوف والرجاء والكرة والمحبة والله عزيز عن مثل هذا فإنه الذي يخاف‏\nويرجى ويسأل ويجيب إن شاء وإن شاء وغفور بما ستر من هذه العلوم والأسرار الراجعة إليه تعالى وإلى أسمائه وإلى العالم عن الخلق كلهم بالمجموع فلا يعلم المجموع ولا واحد من الخلق لكن له العلم بالآحاد فعند واحد ما ليس عند الآخر فهو بالمجموع حاصل فهو حاصل في المجموع غير حاصل عند واحد واحد وهو قوله ولا يُحِيطُونَ بِشَيْ‏ءٍ من عِلْمِهِ إِلَّا بِما شاءَ فجاء بباء التبعيض فعند واحد من العلم بالله ما ليس عند الآخر فلذلك قال إِنَّ الله عَزِيزٌ غَفُورٌ\n\n",
    "en": "## Chapter Four Hundred and Ninety-Four: Concerning the Knowledge of the State of a Pole (قطب) Whose Station is <<إِنَّما يَخْشَى اللهَ مِنْ عِبادِهِ الْعُلَماءُ>> (Indeed, only those of His servants who have knowledge fear Allah) and Similar Quranic Verses\n\nOnly the True God (الإله الحق) is feared by the one who knows The Real (الحق) while his trace (رسمه) yet remains.\n\nBut when the totality is annihilated (فنى) in Him, the knower (العالم) and his name are annihilated within Him.\n\nIndeed, the knowledge (العلم) that benefits us is every knowledge whose ruling (حكمه) we have witnessed.\n\nThat is the knowledge we recognize, and by it, my knowledge knows His Knowledge.\n\n### [Awe/Fear (الخشية) is among the Attributes of Knowledge (العلم)]\n\nAwe/Fear (الخشية) is among the attributes (صفات) of Knowledge (العلم), which grants the necessary awe. The awe attributed to the knower (العالم) is proportional to his knowledge of it. I do not know of anything more knowledgeable than the one whose knowledge is his very Essence (عينه). Thus, I do not fear Him (Allah) due to the Name Allah, because this Name combines opposing contraries (الأضداد المتقابلات). It is from this perspective that His saying <<حَتَّى نَعْلَمَ>> (until We know) descended.\n\nSince the matter which is the cause of the manifestation of the contingent entities (الممكنات), wherever they appear, is nothing but the rulings (أحكام) of the Divine Names (الأسماء الإلهية), there is no Divine Name except that it fears Allah. This is due to its knowledge of the Names that oppose the Name currently governing (الوالي في الحال) and holding the ruling (صاحب الحكم). It says: \"Just as He appointed me governor (ولاني) when I was not governing this specific locus (المحل الخاص) where my ruling appeared, He may dismiss me from that by another governor,\" meaning, by the ruling (حكم) of another Divine Name. Thus, I do not know of any Divine Name that does not fear Allah, for Allah has the power to dispose of them through appointment (التولي) and dismissal (العزل), and this is what occurs in Existence (الوجود). Some of these occurrences happen due to a request (سؤال) from the cosmos (الكون), and some happen without a request, but rather occur when the duration of the ruling ends, resulting in abrogation (نسخ).\n\nJust as the name of awe/fear (الخشية) of Allah is applied to the knowers (العلماء) among the originated things (المحدثات), so too is awe/fear of Allah applied to the Names. Because of the request of the originated things to Allah to lift the rulings of the Divine Names, the Divine Names that hold the ruling at that time fear the request of the originated things to Allah to lift their ruling from that locus. An example is the saying of Ayyub (Job), peace be upon him, <<إِذْ نادى‏ رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ>> (when he called upon his Lord, \"Indeed, adversity has touched me\"), requesting the dismissal (عزل) of the Name The Harmful (الضار) and the removal of its ruling. So Allah dismissed its ruling, and it was dismissed by the removal of its ruling. The Name The Beneficial (النافع) took its place, and Allah removed the adversity that afflicted him. Thus, the Divine Names fear Allah because He holds the power of dismissal (العزل) and appointment (التولية), and they fear the knower (العالم) because of the request he possesses, and because Allah accepts the request of the knower, especially the people of necessity (أهل الاضطرار).\n\nThen we look at the end of the duration of their rulings, and they anticipate dismissal (العزل), just as they also hope for it, due to their witnessing of appointment (التولية). No Name is more fearful (خشية) than The Avenger (المنتقم), for it sees and witnesses the actual removal of its ruling, and no ruling remains for it in Existence (الوجود); it exists potentially (بالقوة) in The Real (الحق). The same applies to other Divine Names that follow its course. Pay attention to the awe/fear (خشية) of the Divine Names toward the knower (العالم). If this is unveiled (كوشفت) to you, you will see that were it not for the fact that the knower is The Real (الحق) in some respect, it would not be correct for the Divine Names to fear him, because in reality, none is feared or hoped for except Allah. And none fears Him except the knower (العالم). And none is more knowledgeable than Allah. Therefore, none fears Allah except Allah, but the forms (الصور) differ due to the difference in relations (النسب), or the relations differ due to the difference in forms. Were it not for the relations, the forms would not have come into being, and were it not for the forms, the difference in relations would not have been known. Thus, Existence (الوجود) is bound one part to another, so its confirmation (إبرامه) is the very essence of its annulment (نقضه).\n\nFurthermore, in this mention, <<إِنَّ اللهَ عَزِيزٌ غَفُورٌ>> (Indeed, Allah is All-Mighty, All-Forgiving). His Might (عزته) is His transcendence (امتناعه) from being subject to the ruling of the Divine Names regarding how some of them look upon others, just as the world (العالم) looks upon itself, thereby being characterized by fear (الخوف), hope (الرجاء), aversion (الكرة), and love (المحبة). Allah is Mighty (عزيز) above such things, for He is the One Who is feared, hoped for, asked, and Who answers if He wills. And He is Forgiving (غفور) for what He has concealed of these sciences (العلوم) and secrets (الأسرار) pertaining to Him, to His Names, and to the knower (العالم), from all of creation collectively (بالمجموع). Thus, the totality is not known by any single creature, but He has knowledge of the individuals (الآحاد). What one possesses is not possessed by another. Therefore, the totality is attained collectively (بالمجموع), but not attained by any single individual. This is His saying: <<وَلا يُحِيطُونَ بِشَيْ‏ءٍ مِنْ عِلْمِهِ إِلَّا بِما شاءَ>> (and they encompass nothing of His Knowledge except what He wills). The preposition *bā’* (باء) here denotes partiality (التبعيض). Thus, one person possesses knowledge of Allah that another does not. That is why He said, <<إِنَّ اللهَ عَزِيزٌ غَفُورٌ>> (Indeed, Allah is All-Mighty, All-Forgiving).",
    "ur": "باب نمبر چار سو چورانوے، اس قطب کے حال کی معرفت میں جس کا مقام یہ آیت تھی: \"إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ\" (اللہ کے بندوں میں سے صرف علم والے ہی اس سے ڈرتے ہیں) اور اس سے ملتی جلتی قرآنی آیات۔\n\nمعبود برحق سے صرف وہی خشیت رکھتا ہے،\nجو الحق (ذات حق) کو جانتا ہے اور اس کا نقش باقی رہتا ہے۔\n\nپھر جب سب کچھ اس میں فنا (فنا) ہو جاتا ہے،\nتو عالم اور اس کا نام بھی اس میں فنا ہو جاتا ہے۔\n\nوہ علم جو ہمیں نفع دیتا ہے،\nوہ ہر علم ہے جس کے حکم کا ہم نے شہود (شہود) کیا ہے۔\n\nپس وہی وہ علم ہے جسے ہم جانتے ہیں،\nاور اسی کے ذریعے میرا علم اس کے علم کو جانتا ہے۔\n\n### [خشیت علم کی صفات میں سے ہے]\n\nخشیت علم کی صفات میں سے ہے جو اس کے لیے لازم خشیت عطا کرتا ہے۔ اور اس (علم) کی مقدار کے مطابق ہی وہ خشیت ہوتی ہے جو عالم کی طرف منسوب کی جاتی ہے۔ اور میں اس سے زیادہ جاننے والا نہیں ہوں جس کا علم عین اس کی ذات ہو، لہٰذا میں اسم اللہ سے خشیت نہیں رکھتا کیونکہ یہ اسم متقابل اضداد کو جمع کرتا ہے۔ اور اسی مقام سے یہ قول نازل ہوا: \"حَتَّى نَعْلَمَ\" (تاکہ ہم جان لیں)۔\n\nچونکہ وہ امر جو ممکنات کے ظہور کی علت ہے، جہاں کہیں بھی وہ ظاہر ہوتا ہے، وہ اسماء الٰہیہ کے احکام کے سوا کچھ نہیں ہے۔ لہٰذا کوئی بھی اسم الٰہی ایسا نہیں ہے جو اللہ سے خشیت نہ رکھتا ہو، کیونکہ وہ ان اسماء کو جانتا ہے جو اس والی (حکمران) اسم کے مقابل ہیں جو اس وقت حکم کا مالک ہے۔ پس وہ (والی اسم) کہتا ہے کہ جس طرح اس نے مجھے والی بنایا حالانکہ میں اس خاص محل پر والی نہیں تھا جہاں میرا حکم ظاہر ہوا، ہو سکتا ہے کہ وہ مجھے کسی دوسرے والی کے ذریعے معزول کر دے، یعنی کسی دوسرے اسم الٰہی کے حکم کے ذریعے۔ پس میں اسماء الٰہیہ میں سے کسی کو نہیں جانتا، لہٰذا میں ان سے اللہ کے لیے خشیت نہیں رکھتا، کیونکہ اللہ کو ان میں تولیت اور عزل (برطرفی) کا تصرف حاصل ہے، اور یہی الوجود (ہستی) میں واقع ہوتا ہے۔ ان میں سے کچھ ایسے ہیں جو کائنات کے سوال پر واقع ہوتے ہیں، اور کچھ ایسے ہیں جو بغیر سوال کے واقع ہوتے ہیں، بلکہ حکم کی مدت ختم ہونے پر واقع ہوتے ہیں، تو یہ نسخ (منسوخی) ہوتا ہے۔\n\nجس طرح محدثات (مخلوقات) میں سے علماء پر اللہ کے لیے خشیت کا نام لاگو ہوتا ہے، اسی طرح اسماء پر بھی اللہ کے لیے خشیت لاگو ہوتی ہے۔ اور اسماء الٰہیہ کے احکام کو اٹھانے کے لیے محدثات کے سوال کی وجہ سے، وہ اسماء الٰہیہ جو اس وقت حکم رکھتے ہیں، محدثات کے اس سوال سے ڈرتے ہیں کہ وہ اللہ سے ان کے حکم کو اس محل سے اٹھا لینے کا مطالبہ کریں۔ جیسا کہ ایوب علیہ السلام کا قول ہے: \"إِذْ نادى‏ رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ\" (جب انہوں نے اپنے رب کو پکارا کہ مجھے تکلیف پہنچی ہے)۔ وہ اسم الضار (نقصان پہنچانے والے اسم) کی معزولی اور اس کے حکم کو ہٹانے کا مطالبہ کر رہے تھے۔ پس اللہ نے اس کے حکم کو معزول کر دیا، اور وہ اپنے حکم کے زوال سے معزول ہو گیا، اور اس کی جگہ اسم النافع (نفع دینے والے اسم) نے تولیت حاصل کر لی، پس اللہ نے ان کی تکلیف کو دور کر دیا۔ لہٰذا اسماء الٰہیہ اللہ سے خشیت رکھتے ہیں کیونکہ عزل اور تولیت اس کے ہاتھ میں ہے، اور وہ عالم (جاننے والے) سے بھی خشیت رکھتے ہیں کیونکہ اس کے پاس سوال ہے اور اللہ کے پاس عالم کے سوال کی قبولیت ہے، خاص طور پر اہل اضطرار (مجبوری کی حالت میں پکارنے والوں) کے سوال کی۔\n\nپھر ہم ان کے احکام کی مدت کے اختتام کو دیکھتے ہیں، تو وہ عزل کی توقع رکھتے ہیں، جیسا کہ وہ تولیت کا بھی مشاہدہ کرتے ہوئے اس کی امید رکھتے ہیں۔ پس اسم المنتقم (انتقام لینے والا) سے زیادہ خشیت رکھنے والا کوئی اسم نہیں ہے، کیونکہ وہ اپنے حکم کے فعلی زوال کو دیکھتا اور مشاہدہ کرتا ہے، اور الوجود (ہستی) میں اس کا کوئی حکم باقی نہیں رہتا، اور وہ الحق (ذات حق) میں بالقوۃ (امکانی حالت میں) ہوتا ہے۔ اور جو اسماء الٰہیہ اس کے ہم پلہ ہیں۔ پس اسماء الٰہیہ کی عالم سے خشیت پر غور کرو، کیونکہ جب تم پر اس کا کشف (کشف) ہو گا تو تم دیکھو گے کہ اگر کسی نہ کسی لحاظ سے وہ حق نہ ہوتا تو اسماء الٰہیہ کے لیے اس سے خشیت رکھنا درست نہ ہوتا، کیونکہ حقیقت میں اللہ کے سوا کسی سے نہ خشیت رکھی جاتی ہے اور نہ امید، اور اللہ سے صرف عالم ہی خشیت رکھتا ہے، اور اللہ سے زیادہ کوئی عالم نہیں، لہٰذا اللہ سے صرف اللہ ہی خشیت رکھتا ہے۔ لیکن صورتیں مختلف ہیں نسبتوں کے اختلاف کی وجہ سے، یا نسبتیں مختلف ہیں صورتوں کے اختلاف کی وجہ سے۔ پس اگر نسبتیں نہ ہوتیں تو صورتیں وجود میں نہ آتیں، اور اگر صورتیں نہ ہوتیں تو نسبتوں کا اختلاف معلوم نہ ہوتا۔ پس الوجود (ہستی) ایک دوسرے سے جڑا ہوا ہے، لہٰذا اس کا مضبوط کرنا ہی اس کا توڑنا ہے۔\n\nپھر اس ذکر میں یہ ہے کہ: \"إِنَّ الله عَزِيزٌ غَفُورٌ\" (بے شک اللہ غالب ہے، بہت بخشنے والا ہے)۔ پس اس کی عزت (غلبہ) یہ ہے کہ وہ اس سے پاک ہے کہ اس پر اسماء الٰہیہ کا حکم لاگو ہو کہ وہ ایک دوسرے کو دیکھیں جیسا کہ عالم (مخلوق) ایک دوسرے کو دیکھتے ہیں، اور اس وجہ سے خوف، رجاء (امید)، نفرت اور محبت سے متصف ہوں۔ اور اللہ اس طرح کی چیزوں سے عزیز (غالب) ہے۔ کیونکہ وہی ہے جس سے خوف کیا جاتا ہے، اور امید رکھی جاتی ہے، اور سوال کیا جاتا ہے، اور وہ جواب دیتا ہے اگر وہ چاہے، اور وہ غفور (بخشنے والا) ہے اس علم اور ان اسرار کو چھپانے کی وجہ سے جو اس کی ذات، اس کے اسماء، اور عالم (جاننے والے) کی طرف لوٹتے ہیں، تمام مخلوق سے مجموعی طور پر۔ پس مجموعی علم کو مخلوق میں سے کوئی ایک بھی نہیں جانتا، لیکن اسے آحاد (انفرادی چیزوں) کا علم حاصل ہے۔ پس ایک کے پاس وہ علم ہے جو دوسرے کے پاس نہیں، لہٰذا وہ مجموعی طور پر حاصل ہے، وہ مجموعے میں تو حاصل ہے لیکن ہر ایک فرد کے پاس حاصل نہیں ہے۔ اور یہی اس کا قول ہے: \"ولا يُحِيطُونَ بِشَيْ‏ءٍ من عِلْمِهِ إِلَّا بِما شاءَ\" (اور وہ اس کے علم میں سے کسی چیز کا احاطہ نہیں کر سکتے مگر جتنا وہ چاہے)۔ پس یہاں \"باء\" تبعیض (جزوی ہونے) کے لیے آیا ہے۔ پس ایک کے پاس اللہ کے علم میں سے وہ حصہ ہے جو دوسرے کے پاس نہیں ہے۔ اسی لیے اس نے فرمایا: \"إِنَّ الله عَزِيزٌ غَفُورٌ\" (بے شک اللہ غالب ہے، بہت بخشنے والا ہے)۔",
    "fa": "باب چهارصد و نود و چهارم در شناخت حال قطبی که منزل او آیه «إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ» (همانا از میان بندگان خدا، تنها دانایان از او می‌ترسند) و آیات قرآنی مشابه آن بود.\n\nهمانا از خدای حق (الحق) کسی می‌ترسد *** که حق (الحق) را می‌داند و رسم او باقی می‌ماند.\nپس اگر همه چیز در او فانی (الفناء) شود *** عالم و نام او در آن فانی (الفناء) می‌گردد.\nهمانا علمی که ما را سود می‌رساند *** هر علمی است که حکم آن را شهود (الشهود) کرده‌ایم.\nپس آن علمی است که ما آن را می‌شناسیم *** و به واسطه آن، علم من، علم او را می‌داند.\n\n### [خشیت از صفات علم است]\n\nخشیت (الخشية) از صفات علم است که خشیت لازم خود را می‌بخشد، و به اندازه علم به آن، خشیت به عالم (العالم) نسبت داده می‌شود. و من کسی را داناتر از آنکه علمش عین اوست نمی‌دانم، پس از او به خاطر اسم «الله» نمی‌ترسم، زیرا این اسم اضداد متقابل را در خود جمع کرده است. و از همین جاست که سخن او نازل شد: «حَتَّى نَعْلَمَ» (تا بدانیم).\n\nو چون امری که علت ظهور ممکنات (الممکنات) در هر کجا که ظاهر شوند، چیزی جز احکام اسماء الهی نیست، هیچ اسم الهی نیست مگر آنکه از حق (الله) می‌ترسد؛ زیرا می‌داند که حق (الله) اسماء دیگری دارد که در حال حاضر با این اسمِ والی و صاحب حکم، مقابله می‌کنند. پس می‌گوید: همان‌طور که مرا والی کرد در حالی که من والی بر این محل خاص که حکم من در آن ظاهر شد نبودم، ممکن است مرا با والی دیگری (یعنی با حکم اسم الهی دیگری) از آن عزل کند. پس من از اسماء الهی داناتر نیستم، بنابراین از آنها به خاطر حق (الله) نمی‌ترسم، زیرا حق (الله) در آنها با ولایت دادن و عزل کردن تصرف می‌کند، و این همان چیزی است که در هستی (الوجود) واقع می‌شود.\n\nپس برخی از این تصرفات به واسطه درخواست از سوی کَون (جهان خلق) واقع می‌شود، و برخی دیگر بدون درخواست، بلکه با پایان یافتن مدت حکم واقع می‌شود که در این صورت نسخ است. همان‌طور که نام خشیت (الخشية) برای حق (الله) بر عالمان (العلماء) از میان ممکنات (المحدثات) اطلاق شد، خشیت برای حق (الله) نیز بر اسماء اطلاق شد. و به دلیل درخواست ممکنات (المحدثات) برای برداشته شدن احکام اسماء الهی، اسماء الهی که در آن زمان حکم دارند، از درخواست ممکنات از حق (الله) برای رفع حکمشان از آن محل می‌ترسند. مانند سخن ایوب علیه السلام: «إِذْ نادى‏ رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ» (آنگاه که پروردگارش را ندا داد که همانا به من آسیب رسیده است). او درخواست عزل اسم «الضار» (زیان‌رسان) و از بین بردن حکمش را داشت. پس حق (الله) حکمش را عزل کرد و آن اسم با زوال حکمش عزل شد و اسم «النافع» (سودرسان) جای آن را گرفت. پس حق (الله) آنچه از آسیب در او بود را برطرف ساخت.\n\nپس اسماء الهی از حق (الله) می‌ترسند به خاطر آنچه در دست اوست از عزل و ولایت دادن، و از عالم (العالم) می‌ترسند به خاطر آنچه نزد اوست از درخواست، و آنچه نزد حق (الله) است از پذیرش درخواست عالم (العالم)، به ویژه اهل اضطرار. سپس به پایان مدت احکامشان می‌نگرند و منتظر عزل می‌مانند، همان‌طور که به آن امید نیز دارند، زیرا ولایت دادن را مشاهده کرده‌اند. پس هیچ اسمی ترسوتر از «المنتقم» (انتقام‌گیرنده) نیست، زیرا او زوال حکمش را عملاً می‌بیند و شهود (الشهود) می‌کند و دیگر حکمی در هستی (الوجود) برایش باقی نمی‌ماند و تنها به صورت بالقوه در حق (الحق) خواهد بود. و همچنین است حال اسماء الهی که مانند او هستند. پس به خشیت اسماء الهی از عالم (العالم) توجه کن، زیرا اگر بر تو کشف (الکشف) شود، خواهی دید که اگر عالم به وجهی حق (الحق) نبود، صحیح نبود که اسماء الهی از او بترسند، زیرا در حقیقت جز از حق (الله) ترسیده نمی‌شود و به جز او امید بسته نمی‌شود، و جز عالم (العالم) از او نمی‌ترسد، و هیچ کس داناتر از حق (الله) نیست، پس جز حق (الله) از حق (الله) نمی‌ترسد. اما صورت‌ها به دلیل اختلاف نسبت‌ها متفاوتند، یا نسبت‌ها به دلیل اختلاف صورت‌ها متفاوتند. پس اگر نسبت‌ها نبودند، صورت‌ها پدید نمی‌آمدند، و اگر صورت‌ها نبودند، اختلاف نسبت‌ها دانسته نمی‌شد. پس هستی (الوجود) برخی به برخی دیگر پیوسته است، و محکم کردن آن عین نقض کردن آن است.\n\nسپس در این ذکر است که: «إِنَّ الله عَزِيزٌ غَفُورٌ» (همانا خداوند عزیز و غفور است). عزت او، امتناع اوست از اینکه حکم اسماء الهی را داشته باشد که برخی از آنها به برخی دیگر می‌نگرند، همان‌طور که عالم (العالم) برخی از خود را به برخی دیگر می‌نگرد و به همین دلیل به ترس و امید و کراهت و محبت متصف می‌شود. و حق (الله) از چنین چیزی عزیز (منزه) است، زیرا اوست که از او ترسیده می‌شود و به او امید بسته می‌شود و از او درخواست می‌شود و اگر بخواهد اجابت می‌کند. و غفور (بسیار آمرزنده) است به واسطه آنچه از این علوم و اسرار که به او تعالی و به اسماء او و به عالم (العالم) بازمی‌گردد، از همه خلق به صورت مجموع پوشانده است. پس نه مجموع و نه هیچ یک از خلق، آن را نمی‌دانند، اما او به آحاد علم دارد. پس نزد یکی از خلق چیزی از علم هست که نزد دیگری نیست. بنابراین، آن علم به صورت مجموع حاصل است، یعنی در مجموع حاصل است اما نزد تک تک افراد حاصل نیست. و این همان سخن اوست: «ولا يُحِيطُونَ بِشَيْ‏ءٍ من عِلْمِهِ إِلَّا بِما شاءَ» (و به چیزی از علم او احاطه نمی‌یابند مگر به آنچه او بخواهد). پس باء تبعیض (باء جزئیت) را آورده است. پس نزد یکی از خلق، علمی از حق (الله) هست که نزد دیگری نیست. به همین دلیل فرمود: «إِنَّ الله عَزِيزٌ غَفُورٌ»."
  },
  "page_count": 2
}