{
  "id": 492,
  "title": {
    "ar": "الباب الثاني والتسعون وأربعمائة في معرفة حال قطب كان منزله عالِمُ الْغَيْبِ فَلا يُظْهِرُ عَلى‏ غَيْبِهِ أَحَداً إِلَّا من ارْتَضى‏ من رَسُولٍ",
    "en": "Chapter Four Hundred and Ninety-Two: Concerning the knowledge of the state of a Pole (قطب) whose station was: <<عالِمُ الْغَيْبِ فَلا يُظْهِرُ عَلى‏ غَيْبِهِ أَحَداً إِلَّا من ارْتَضى‏ من رَسُولٍ>> (Knower of the Unseen, and He does not disclose His Unseen to anyone, except to one whom He has approved as a Messenger).",
    "ur": "باب نمبر چار سو بانوے (۴۹۲): ایک قطب (Qutb) کے حال کی معرفت (Ma'rifah) کے بیان میں جس کا منزل (Manzil) یہ تھی: \"عالِمُ الْغَيْبِ فَلا يُظْهِرُ عَلى‏ غَيْبِهِ أَحَداً إِلَّا من ارْتَضى‏ من رَسُولٍ\" (غیب کا جاننے والا، پس وہ اپنے غیب پر کسی کو مطلع نہیں کرتا، سوائے اس رسول کے جسے وہ پسند کر لے۔)",
    "fa": "باب چهارصد و نود و دوم در شناخت حال قطب (Qutb) که منزلگاه او «دانای غیب است و هیچ کس را بر غیب خود آگاه نمی‌سازد، مگر رسولی را که مورد رضایت او باشد» (عالِمُ الْغَيْبِ فَلا يُظْهِرُ عَلى‏ غَيْبِهِ أَحَداً إِلَّا من ارْتَضى‏ من رَسُولٍ) بود."
  },
  "content": {
    "ar": "## «الباب الثاني والتسعون وأربعمائة في معرفة حال قطب كان منزله عالِمُ الْغَيْبِ فَلا يُظْهِرُ عَلى‏ غَيْبِهِ أَحَداً إِلَّا من ارْتَضى‏ من رَسُولٍ»\n\n\n> لو بد الغيب لعين لم يكن *** ذاك غيبا أنه قد شهدا\n\n\n> عالم الغيب فلا يظهره *** لا ولا يظهر فيه أحدا\n\n\n> فجميع الكون مشهود له *** ما لديه غائب ما وجدا\n\n\n> إنما الغيب لنا ليس له *** ولهذا في الوجود انفردا\n\n\n> ولذا قال لمن يشهدكن *** فاتخذه يا ولي سندا\n\n\nاعلم أيدنا الله وإياك بروح القدس أنه من صادف العلم في ظنه أنه موصوف بالعلم عند نفسه وإن كان نعته العلم في نفس الأمر ولهذا\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم للرجل الذي وقع له إنها الفاتحة ليهنك العلم يعني في نفس الأمر ثم يقول النبي صَلَّى اللهُ عَليهِ وسَلَّم له ليهنك العلم‏\n\n\nفيما ذكر في واقعته حصل له العلم في نفسه كما هو في نفس الأمر لا بد من ذلك‏\n\n\n### [الغيب على قسمين غيب لا يعلم أبدا وغيب إضافي‏]\n\n\nفاعلم إن الغيب على قسمين غيب لا يعلم أبدا وليس إلا هوية الحق ونسبته إلينا وأما نسبتنا إليه فدون ذلك فهذا غيب لا يمكن ولا يعلم أبدا والقسم الآخر غيب إضافي فما هو مشهود لأحد قد يكون غيبا لآخر فما في الوجود غيب أصلا لا يشهده أحد وأدقه أن يشهد الموجود نفسه الذي هو غيب عن كل أحد سوى نفسه فما ثم غيب إلا وهو مشهود في حال غيبته عمن ليس بمشاهد له فإذا ارتضى الله من ارتضاه لعلم ذلك أطلعه عليه علما لا ظنا ولا تخمينا فلا يعلم إلا بإعلام الله أو بإعلام من أعلمه الله عند من يعتقد فيه إن الله أعلمه وما عدا هذا فلا علم له بغيب أصلا وإنما اختص بهذا الإعلام مسمى الرسول لأنه ما أعلمه بذلك الغيب اقتصارا عليه وإنما أعلمه ليعلمه فتحصل له درجة الفضيلة على من أعلمه به لتعلم مكانته عند ربه فلهذا سماه رسولا وهذا النوع من الغيب لا يكون إلا من الوجه الخاص لا يعلمه ملك ولا غيره إلا الرسول خاصة سواء كان الرسول ملكا أو غيره فإن الله نفى أن يظهر على غيبه أحدا وإنما قال بأن الذي ارتضاه لذلك يَسْلُكُ من بَيْنِ يَدَيْهِ ومن خَلْفِهِ رَصَداً عصمة له من الشبه القادحة فيه فهو علم لا دخول للشبه فيه على صاحبه وهذا هو صاحب البصيرة الذي هو عَلى‏ بَيِّنَةٍ من رَبِّهِ في علمه وله ذوق خاص يتميز به لا يشاركه فيه غيره إذ لو شاركه لما كان خاصا فإذا جاء الرسول به لمن يعلمه فذلك ليس عند هذا المتعلم من علم الغيب فإن الرسول قد أظهره الله عليه فما هو عند هذا من علم الغيب الذي لا يظهر الله عليه أحدا وإنما هو ما يحصل لأي عالم كان من الوجه الخاص ولكنه الآن ليس بواقع في الدنيا لكنه يقع في‏\nالآخرة وسبب ذلك أن كل علم يحصل للإنسان في الدنيا من العلم بالله خاصة فإن محمدا صَلَّى اللهُ عَليهِ وسَلَّم قد علمه فإنه علم علم الأولين والآخرين وأنت من الآخرين بلا شك وأما في غير العلم بالله فقد يعطاه الإنسان من الوجه الخاص فلا يعلم إلا منه فهو رسول في تعليمه إلى من يعلمه بذلك هذا أعطاه مقام محمد صَلَّى اللهُ عَليهِ وسَلَّم وليست الفائدة إلا في العلم بالله تعالى فإنه العلم الذي به تحسن صورة العالم في نفسه فالعلم بالله من الرسول في المتعلم أعظم وأنفع من العلم الذي يحصل لك من الوجه الخاص إذا كان المعلوم كونا ما من الأكوان ليس الله فما الشرف للإنسان إلا في علمه بالله وأما علمه بسوى الله تعالى فعلالة يتعلل بها الإنسان المحجوب فإن المنصف ما له همة إلا العلم به تعالى فاجهد إن تكون ممن يأخذ العلم بالله عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فتكون محمدي الشهود إذ قد قطعنا أنه لا علم بالله اليوم عينا يختص به أحد من خلق الله وقد أشارت عائشة رضي الله عنها إلى ذلك في تأويلها في حق رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فقالت من زعم أن محمدا رأى ربه فقد أعظم على الله الفرية فإن الله يقول لا تُدْرِكُهُ الْأَبْصارُ وهنا سر فابحث عليه ولا تقل قد حجرت واسعا فإني ما حجرت عليك إن لا تعلم وإنما حجرت عليك أنك لا تعلم مثل هذا من الحق إلا في صورة محمدية وقد بينا أن أعظم الرؤية رؤية محمدية في صورة محمدية وإليه ذهب الإمام أبو القاسم بن قسي رحمه الله في كتاب خلع النعلين له وهو روايتنا عن ابنه عنه بتونس سنة تسعين وخمسمائة وما رأيت هذا النفس لغيره فنعينه فإنه ما وصل إلينا فيمكن إن يكون كما علمته أنا من الله تعالى إلقاء إلهيا من غير واسطة أعني ما علمه ابن قسي في ذلك يمكن أيضا أن يكون غير ابن قسي قبله أو بعده أو في زمانه قد أطلعه الله على ذلك وما وصل إلينا والله أعلم فلا شرف يعلو شرف العلم ولا حالة تسمو على حالة الفهم عن الله‏\n\n",
    "en": "Chapter Four Hundred and Ninety-Two: Concerning the knowledge of the state of a Pole (قطب) whose station was the verse: <<عَالِمُ الْغَيْبِ فَلَا يُظْهِرُ عَلَى غَيْبِهِ أَحَدًا إِلَّا مَنِ ارْتَضَى مِنْ رَسُولٍ>> (Knower of the Unseen, He does not disclose His Unseen to anyone, except to a Messenger whom He has approved).\n\nIf the Unseen (الغيب) were revealed to an eye,\nThat would not be the Unseen, for it has been witnessed.\n\nThe Knower of the Unseen (عالم الغيب) does not disclose it,\nNor does He reveal anyone within it.\n\nThus, the entire Cosmos (الكون) is witnessed by Him,\nNothing is absent from Him, nothing is un-found.\n\nThe Unseen (الغيب) is only for us, not for Him,\nAnd for this reason, He is unique (انفردا) in Existence (الوجود).\n\nAnd thus He said to the one who witnesses you,\nSo take him, O friend (ولي), as a support.\n\nKnow, may Allah support us and you with the Holy Spirit (روح القدس), that whoever finds Knowledge (العلم) in his assumption that he is described by knowledge in his own estimation, even if his description is Knowledge in reality (في نفس الأمر). And for this reason, the Messenger of Allah (PBUH) said to the man who realized that it was *Al-Fatiha*: \"May the Knowledge (العلم) be pleasing to you,\" meaning, in reality (في نفس الأمر). Then the Prophet (PBUH) says to him: \"May the Knowledge be pleasing to you,\" regarding what was mentioned in his realization (واقعته); the Knowledge was attained within himself exactly as it is in reality—this is necessary.\n\n### [The Unseen (الغيب) is of Two Types: Unseen that is Never Known, and Relative Unseen (غيب إضافي)]\n\nKnow that the Unseen (الغيب) is of two types: Unseen that is never known, and this is none other than the Identity (هوية) of the Real (الحق) and His relation to us. As for our relation to Him, that is less than that. This is the Unseen that is impossible and can never be known. The second type is relative Unseen (غيب إضافي). For what is witnessed by one person may be unseen (غيبا) by another. Thus, there is nothing in Existence (الوجود) that is absolutely unseen (غيب أصلا) that no one witnesses. The most subtle aspect of this is that the existent thing witnesses itself, which is unseen (غيب) by everyone other than itself. Therefore, there is no Unseen (غيب) except that it is witnessed even in its state of being unseen by the one who is not witnessing it.\n\nSo when Allah approves (ارتضى) whomever He approves for the knowledge of that, He informs him of it as certain Knowledge (علما), not as conjecture (ظنا) or estimation (تخمينا). Thus, it is not known except by the informing of Allah, or by the informing of one whom Allah has informed, according to the one who believes that Allah has informed him. Other than this, there is absolutely no knowledge of the Unseen (غيب) for him. This informing is specifically designated for the one named the Messenger (الرسول). Because He did not inform him of that Unseen (الغيب) merely for his own exclusive benefit, but rather He informed him so that he might teach it. Thus, he attains the degree of superiority (الفضيلة) over the one who informs him of it, so that his station (مكانته) with his Lord may be known. For this reason, He named him a Messenger (رسولا). This type of Unseen (الغيب) only comes through the specific aspect (الوجه الخاص). Neither an angel nor anyone else knows it, except the Messenger (الرسول) specifically, whether the Messenger is an angel or other than an angel. For Allah denied that He discloses His Unseen (غيبه) to anyone, but rather He said that the one whom He approved for that, He causes to proceed before him and behind him watchers (رَصَداً), as a protection (عصمة) for him against doubts (الشبه) that might impair it. Thus, it is Knowledge (علم) into which doubts cannot enter for its possessor. And this is the possessor of insight (صاحب البصيرة) who is upon clear evidence (بَيِّنَةٍ) from his Lord concerning his knowledge. And he has a specific taste (ذوق خاص) by which he is distinguished, and no one else shares it with him, for if they shared it, it would not be specific.\n\nSo when the Messenger (الرسول) brings it to the one whom he teaches, that is not considered knowledge of the Unseen (علم الغيب) by this learner, for the Messenger has already been informed of it by Allah, so it is not, for this learner, part of the knowledge of the Unseen upon which Allah does not disclose anyone. Rather, it is what is attained by any knower (عالم) through the specific aspect (الوجه الخاص). But now it is not realized in this world (الدنيا), though it will be realized in the Hereafter (الآخرة). The reason for this is that every knowledge (علم) concerning Allah specifically that a person attains in this world, Muhammad (PBUH) has already known it, for he knew the knowledge of the first and the last, and you are undoubtedly among the last. As for knowledge other than the Knowledge of Allah, a person may be granted it through the specific aspect (الوجه الخاص), and it is not known except through him. He is a messenger (رسول) in teaching it to the one whom he informs of it. This grants him the station (مقام) of Muhammad (PBUH). The benefit lies only in the Knowledge of Allah (العلم بالله تعالى), for it is the Knowledge by which the form of the knower (العالم) is perfected within himself. Thus, the Knowledge of Allah (العلم بالله) received by the learner from the Messenger (الرسول) is greater and more beneficial than the knowledge you attain through the specific aspect (الوجه الخاص) if the known object is merely one of the contingent entities (الأكوان) and is not Allah. For the honor of humanity lies only in its Knowledge of Allah. As for his knowledge of what is other than Allah (سوى الله تعالى), it is merely a distraction (علالة) by which the veiled person (الإنسان المحجوب) occupies himself. For the sincere seeker (المنصف) has no aspiration (همة) except the Knowledge of Him, the Exalted. Strive, therefore, to be among those who take the Knowledge of Allah (العلم بالله) from the Messenger of Allah (PBUH), so that you may be Muhammadan in your Witnessing (محمدي الشهود). Since we have established definitively that there is no essential Knowledge of Allah (علم بالله عينا) today that is exclusive to any of Allah's creation. And Aisha (may Allah be pleased with her) alluded to this in her interpretation concerning the Messenger of Allah (PBUH) when she said: \"Whoever claims that Muhammad saw his Lord has committed a great slander against Allah,\" for Allah says: <<لَا تُدْرِكُهُ الْأَبْصَارُ>> (Vision does not comprehend Him). There is a secret here, so search for it, and do not say, \"You have restricted what is vast.\" For I have not restricted you from knowing, but rather I have restricted you from knowing such a Reality (الحق) except in a Muhammadan form (صورة محمدية). And we have explained that the greatest vision (الرؤية) is a Muhammadan vision in a Muhammadan form. This is the view adopted by Imam Abu al-Qasim ibn Qasi (may Allah have mercy on him) in his book *Khala' al-Na'layn* (The Removal of the Sandals). This is our narration from his son, transmitted from him in Tunis in the year 590 AH. I have not seen this spirit (نفس) in anyone else, so we attribute it to him. For what reached us may be exactly as I learned it from Allah the Exalted, as a Divine inspiration (إلقاء إلهيا) without intermediary. I mean, what Ibn Qasi knew concerning this—it is also possible that someone other than Ibn Qasi, before him, after him, or contemporary with him, was informed of it by Allah, but it did not reach us. And Allah knows best. Thus, no honor surpasses the honor of Knowledge (العلم), and no state is loftier than the state of understanding from Allah.",
    "ur": "باب نمبر چار سو بانوے: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا:\n**عَالِمُ الْغَيْبِ فَلَا يُظْهِرُ عَلَىٰ غَيْبِهِ أَحَدًا إِلَّا مَنِ ارْتَضَىٰ مِن رَّسُولٍ**\n(غیب کا جاننے والا، پس وہ اپنے غیب پر کسی کو مطلع نہیں کرتا، سوائے اس رسول کے جسے وہ پسند کر لے)\n\nاگر غیب کسی آنکھ کے لیے ظاہر ہو جائے،\nتو وہ غیب نہیں رہتا، کیونکہ اس کا شہود (الشہود) ہو چکا۔\n\nوہ غیب کا جاننے والا ہے، پس وہ اسے ظاہر نہیں کرتا،\nاور نہ ہی اس میں کسی کو ظاہر کرتا ہے۔\n\nپس تمام کائنات اس کے لیے مشہود ہے،\nاس کے نزدیک کوئی غائب نہیں جو موجود نہ ہو۔\n\nغیب تو صرف ہمارے لیے ہے، اس کے لیے نہیں،\nاور اسی لیے وہ ہستی (الوجود) میں منفرد ہے۔\n\nاور اسی لیے اس نے کہا جو تمہیں شہود (الشہود) کراتا ہے،\nاے ولی! اسے اپنا سہارا بنا لے۔\n\nجان لو، اللہ ہمیں اور تمہیں روح القدس سے تائید بخشے، کہ جو شخص علم کو اپنے گمان میں پاتا ہے، وہ اپنے نزدیک علم سے متصف ہوتا ہے، اگرچہ حقیقتِ امر میں اس کی صفت علم ہی ہو۔ اور اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے اس شخص سے فرمایا جسے یہ کشف (الکشف) ہوا تھا کہ یہ سورۃ الفاتحہ ہے: \"تمہیں علم مبارک ہو\" یعنی حقیقتِ امر میں۔ پھر نبی صلی اللہ علیہ وسلم نے اس سے فرمایا: \"تمہیں علم مبارک ہو\" اس کے واقعے میں جو ذکر ہوا، اسے اپنے اندر علم حاصل ہوا جیسا کہ حقیقتِ امر میں ہے، یہ ضروری ہے۔\n\n### [غیب کی دو اقسام: غیب جو کبھی معلوم نہیں ہوتا اور غیب اضافی]\n\nپس جان لو کہ غیب کی دو اقسام ہیں: ایک وہ غیب جو کبھی معلوم نہیں ہوتا، اور وہ صرف ذات حق (الحق) کی ہویت اور اس کی ہماری طرف نسبت ہے۔ اور ہماری اس کی طرف نسبت اس سے کم ہے۔ یہ وہ غیب ہے جو ممکن نہیں اور کبھی معلوم نہیں ہو سکتا۔ دوسری قسم غیب اضافی ہے۔ جو چیز کسی ایک کے لیے مشہود ہے، وہ دوسرے کے لیے غیب ہو سکتی ہے۔ پس ہستی (الوجود) میں کوئی ایسا غیب نہیں جسے کوئی بھی شہود (الشہود) نہ کرے۔ اور اس سے زیادہ دقیق بات یہ ہے کہ موجود خود اپنا شہود (الشہود) کرے، جو اس کے سوا ہر ایک سے غیب ہے۔ پس وہاں کوئی غیب نہیں مگر وہ اپنی غیبت کی حالت میں بھی اس کے لیے مشہود ہے جو اس کا مشاہدہ نہیں کر رہا۔ پس جب اللہ تعالیٰ کسی کو اس علم کے لیے پسند کر لیتا ہے، تو اسے اس پر مطلع کر دیتا ہے، یہ علم ہوتا ہے، نہ کہ گمان یا تخمین۔ پس غیب معلوم نہیں ہوتا مگر اللہ کے مطلع کرنے سے، یا اس شخص کے مطلع کرنے سے جسے اللہ نے مطلع کیا ہو، اس شخص کے نزدیک جو یہ اعتقاد رکھتا ہے کہ اللہ نے اسے مطلع کیا ہے۔ اس کے علاوہ کسی کو غیب کا کوئی علم حاصل نہیں ہوتا۔\n\nاور اس اطلاع کے ساتھ صرف رسول (الرسول) کا نام مختص کیا گیا، کیونکہ اللہ نے اسے اس غیب سے صرف اس پر اکتفا کرتے ہوئے مطلع نہیں کیا، بلکہ اس لیے مطلع کیا تاکہ وہ اسے دوسروں کو بتائے۔ پس اسے اس شخص پر فضیلت کا درجہ حاصل ہوتا ہے جسے وہ مطلع کرتا ہے، تاکہ اس کا مقام اپنے رب کے نزدیک معلوم ہو جائے۔ اسی لیے اللہ نے اسے رسول (الرسول) کا نام دیا۔ اور غیب کی یہ قسم صرف خاص پہلو (الوجه الخاص) سے ہی ہوتی ہے، اسے کوئی فرشتہ یا کوئی اور نہیں جانتا سوائے رسول (الرسول) کے، خواہ وہ رسول فرشتہ ہو یا کوئی اور۔ کیونکہ اللہ نے اس بات کی نفی کی ہے کہ وہ اپنے غیب پر کسی کو مطلع کرے، بلکہ اس نے فرمایا کہ جسے وہ اس کے لیے پسند کرتا ہے، وہ اس کے آگے اور پیچھے نگہبان (رصداً) چلاتا ہے:\n**يَسْلُكُ مِن بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ رَصَدًا**\n(وہ اس کے آگے اور پیچھے نگہبان چلاتا ہے)\nیہ اس کے لیے عصمت ہے تاکہ اس میں قدح کرنے والے شبہات داخل نہ ہوں۔ پس یہ ایسا علم ہے جس میں شبہات کا داخلہ اس کے حامل کے لیے ممکن نہیں۔ اور یہی صاحب بصیرت ہے جو اپنے علم میں **عَلَىٰ بَيِّنَةٍ مِّن رَّبِّهِ** (اپنے رب کی طرف سے واضح دلیل پر) ہے۔ اور اس کے لیے ایک خاص ذوق ہوتا ہے جس سے وہ ممتاز ہوتا ہے، کوئی دوسرا اس میں شریک نہیں ہوتا، کیونکہ اگر کوئی شریک ہوتا تو وہ خاص نہ رہتا۔\n\nپس جب رسول (الرسول) یہ علم اس شخص کے پاس لاتا ہے جسے وہ سکھاتا ہے، تو یہ اس متعلم کے نزدیک علم غیب میں سے نہیں ہوتا، کیونکہ اللہ نے رسول کو اس پر ظاہر کر دیا ہے۔ پس یہ اس کے نزدیک اس علم غیب میں سے نہیں ہے جس پر اللہ کسی کو مطلع نہیں کرتا۔ بلکہ یہ وہ علم ہے جو کسی بھی عالم کو خاص پہلو (الوجه الخاص) سے حاصل ہوتا ہے، لیکن یہ اب دنیا میں واقع نہیں ہوتا، بلکہ آخرت میں واقع ہوگا۔ اس کی وجہ یہ ہے کہ دنیا میں انسان کو جو بھی علم حاصل ہوتا ہے، خاص طور پر اللہ کے بارے میں، تو محمد صلی اللہ علیہ وسلم نے اسے ضرور جان لیا ہے۔ کیونکہ آپ صلی اللہ علیہ وسلم نے اولین و آخرین کا علم جانا، اور بلاشبہ تم آخرین میں سے ہو۔ البتہ اللہ کے علم کے علاوہ، انسان کو خاص پہلو (الوجه الخاص) سے دیا جا سکتا ہے، اور وہ صرف اسی سے معلوم ہوتا ہے۔ پس وہ اس تعلیم میں رسول (الرسول) ہے جو اسے سکھاتا ہے۔ یہ (علم) اسے محمد صلی اللہ علیہ وسلم کا مقام عطا کرتا ہے۔ اور فائدہ صرف اللہ تعالیٰ کے علم میں ہے، کیونکہ یہ وہ علم ہے جس سے عالم کی صورت اس کے نفس میں بہتر ہوتی ہے۔ پس متعلم کے لیے رسول (الرسول) کی طرف سے حاصل ہونے والا اللہ کا علم اس علم سے زیادہ عظیم اور نفع بخش ہے جو تمہیں خاص پہلو (الوجه الخاص) سے حاصل ہوتا ہے، اگر معلوم کوئی ایسی کونی چیز ہو جو اللہ نہ ہو۔ پس انسان کے لیے شرف صرف اللہ کے علم میں ہے، اور اللہ تعالیٰ کے سوا کسی اور چیز کا علم تو ایک دل بہلاوا ہے جس سے محجوب انسان دل بہلاتا ہے۔ کیونکہ منصف کی ہمت صرف اللہ تعالیٰ کے علم میں ہوتی ہے۔\n\nپس کوشش کرو کہ تم ان لوگوں میں سے ہو جو اللہ کا علم رسول اللہ صلی اللہ علیہ وسلم سے حاصل کرتے ہیں، تاکہ تم محمدی شہود (الشہود) والے بن جاؤ۔ کیونکہ ہم نے یہ قطعی فیصلہ کر دیا ہے کہ آج اللہ کا کوئی ایسا علم نہیں جو خاص طور پر اللہ کی مخلوق میں سے کسی ایک کے لیے مختص ہو۔ اور حضرت عائشہ رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم کے حق میں اپنی تاویل میں اسی طرف اشارہ کیا تھا، جب انہوں نے فرمایا: \"جس نے یہ گمان کیا کہ محمد نے اپنے رب کو دیکھا، تو اس نے اللہ پر بہت بڑا جھوٹ باندھا۔\" کیونکہ اللہ تعالیٰ فرماتا ہے:\n**لَّا تُدْرِكُهُ الْأَبْصَارُ**\n(نگاہیں اسے پا نہیں سکتیں)\nاور یہاں ایک راز ہے، پس اسے تلاش کرو۔ اور یہ نہ کہو کہ میں نے وسیع چیز کو محدود کر دیا، کیونکہ میں نے تم پر یہ پابندی نہیں لگائی کہ تم علم حاصل نہ کرو، بلکہ میں نے تم پر یہ پابندی لگائی ہے کہ تم حق (الحق) کے ایسے علم کو محمدی صورت کے بغیر نہیں جان سکتے۔ اور ہم بیان کر چکے ہیں کہ سب سے عظیم رؤیت محمدی صورت میں محمدی رؤیت ہے۔ اور اسی طرف امام ابو القاسم ابن قسی رحمہ اللہ اپنی کتاب *خلع النعلین* میں گئے ہیں، اور یہ ہماری روایت ہے جو ہم نے ان کے بیٹے سے ۵۹۰ھ میں تونس میں ان سے سنی۔ اور میں نے یہ نفس (روحانیت) کسی اور میں نہیں دیکھا، پس ہم اس کی تعیین کرتے ہیں، کیونکہ یہ ہم تک نہیں پہنچا۔ ممکن ہے کہ یہ ویسا ہی ہو جیسا کہ میں نے اسے اللہ تعالیٰ سے بلا واسطہ الہامی القاء کے ذریعے جانا ہے۔ میرا مطلب ہے کہ جو کچھ ابن قسی نے اس بارے میں جانا، یہ بھی ممکن ہے کہ ابن قسی سے پہلے یا بعد میں یا ان کے زمانے میں کسی اور کو بھی اللہ نے اس پر مطلع کیا ہو، لیکن وہ ہم تک نہیں پہنچا۔ اور اللہ ہی بہتر جانتا ہے۔ پس کوئی شرف علم کے شرف سے بلند نہیں، اور کوئی حال اللہ سے حاصل ہونے والی فہم کی حالت سے برتر نہیں۔",
    "fa": "باب چهارصد و نود و دوم در شناخت حال قطبی که منزلگاه او [مقام] «دانای غیب است و هیچ کس را بر غیب خود آگاه نمی‌سازد، مگر رسولی را که برگزیده است» (عَالِمُ الْغَيْبِ فَلَا يُظْهِرُ عَلَى غَيْبِهِ أَحَدًا إِلَّا مَنِ ارْتَضَى مِنْ رَسُولٍ).\n\nاگر غیب بر چشمی آشکار شود،\nآن دیگر غیب نیست، زیرا شهود شده است.\n\nدانای غیب آن را آشکار نمی‌سازد،\nو هیچ کس را نیز در آن آشکار نمی‌کند.\n\nپس تمام هستی (الکون) برای او مشهود است،\nنزد او غایبی وجود ندارد که یافت نشود.\n\nغیب تنها برای ماست، نه برای او،\nو به همین دلیل در هستی (الوجود) یگانه است.\n\nو از این رو به کسی که تو را شهود می‌کند گفت:\nای ولی، او را تکیه‌گاه خود قرار ده.\n\nبدان، خداوند ما و تو را به روح القدس تأیید کند، کسی که علم را در گمان خود بیابد، نزد خویش به علم متصف است، هرچند وصف او در نفس‌الامر (حقیقت امر) نیز علم باشد. و به همین دلیل است که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به مردی که برایش مکاشفه شد که آن [سوره] فاتحه است، فرمود: «علم بر تو گوارا باد» (لِيَهْنِكَ الْعِلْمُ)، یعنی در نفس‌الامر. سپس پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) به او می‌فرماید: «علم بر تو گوارا باد» (لِيَهْنِكَ الْعِلْمُ). در آنچه در واقعه‌اش ذکر شد، علم در نفس او حاصل شد، همان‌گونه که در نفس‌الامر است؛ این امر ضروری است.\n\n### [غیب بر دو قسم است: غیبی که هرگز دانسته نمی‌شود و غیب اضافی]\n\nپس بدان که غیب بر دو قسم است: غیبی که هرگز دانسته نمی‌شود، و آن چیزی نیست جز هویت حق (الحق) و نسبت او به ما. اما نسبت ما به او پایین‌تر از آن است. این غیبی است که هرگز ممکن نیست دانسته شود. و قسم دیگر غیب اضافی است؛ چیزی که برای یک نفر مشهود است، ممکن است برای دیگری غیب باشد. پس در هستی (الوجود) اصلاً غیبی وجود ندارد که هیچ کس آن را شهود (الشهود) نکند. و دقیق‌تر آن است که موجود، خودِ خویش را شهود کند، که آن [خود] غیب است از هر کس جز خودش. پس در آنجا غیبی نیست مگر آنکه در حال غیبتش از کسی که مشاهده‌کننده او نیست، مشهود است. پس هرگاه خداوند کسی را که برای علم به آن [غیب] برگزیده است، بپسندد، او را بر آن آگاه می‌سازد؛ آگاهی‌ای که علم است، نه گمان و تخمین. پس دانسته نمی‌شود مگر به آگاه ساختن خداوند، یا به آگاه ساختن کسی که خداوند او را آگاه کرده است، نزد کسی که اعتقاد دارد خداوند او را آگاه ساخته است. و غیر از این، هیچ علمی به غیب اصلاً وجود ندارد.\n\nو تنها کسی که به این آگاه‌سازی اختصاص یافته، مسمای رسول است؛ زیرا خداوند او را به آن غیب آگاه نساخت تا فقط برای خودش باشد، بلکه او را آگاه ساخت تا [دیگران را] آگاه کند. پس او به درجه فضیلت بر کسی که او را آگاه ساخته است، دست می‌یابد تا مقام او نزد پروردگارش دانسته شود. به همین دلیل او را رسول نامید. و این نوع از غیب تنها از وجه خاص (الوجه الخاص) حاصل می‌شود؛ نه فرشته‌ای آن را می‌داند و نه دیگری، مگر رسول به طور خاص، خواه رسول فرشته باشد یا غیر آن. زیرا خداوند نفی کرده است که کسی را بر غیب خود آگاه سازد، بلکه فرموده است کسی که او را برای این امر برگزیده است، «از پیش رو و پشت سرش نگهبانانی (رَصَداً) می‌فرستد» (يَسْلُكُ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ رَصَدًا) تا او را از شبهات آسیب‌رساننده حفظ کند. پس این علمی است که شبهه در آن برای صاحبش راه ندارد. و این همان صاحب بصیرت است که در علم خود «بر دلیل روشنی از پروردگارش» (عَلَى بَيِّنَةٍ مِنْ رَبِّهِ) قرار دارد و ذوق خاصی دارد که به واسطه آن متمایز می‌شود و دیگری در آن شریک نیست؛ زیرا اگر دیگری شریک می‌شد، دیگر خاص نبود.\n\nپس هرگاه رسول آن [علم] را برای کسی که به او تعلیم می‌دهد بیاورد، آن [علم] نزد این متعلم از علم غیب نیست؛ زیرا خداوند رسول را بر آن آگاه ساخته است. پس آن نزد این شخص از علم غیبی نیست که خداوند هیچ کس را بر آن آگاه نمی‌سازد، بلکه آن چیزی است که برای هر عالمی از وجه خاص (الوجه الخاص) حاصل می‌شود، اما اکنون در دنیا واقع نمی‌شود، بلکه در آخرت واقع خواهد شد. و سبب آن این است که هر علمی که در دنیا به انسان حاصل می‌شود، به ویژه از علم به خداوند، محمد (صَلَّى اللهُ عَليهِ وسَلَّم) آن را دانسته است؛ زیرا او علم اولین و آخرین را می‌داند و تو بدون شک از آخرین هستی. اما در غیر علم به خداوند، ممکن است به انسان از وجه خاص (الوجه الخاص) داده شود و جز از طریق او دانسته نشود. پس او در تعلیم خود به کسی که آن را به او می‌آموزد، رسول است. این [علم] مقام محمد (صَلَّى اللهُ عَليهِ وسَلَّم) را به او داده است. و فایده تنها در علم به خداوند متعال است، زیرا آن علمی است که به واسطه آن صورت عالم در نفس خود نیکو می‌شود. پس علم به خداوند که از رسول به متعلم می‌رسد، بزرگ‌تر و سودمندتر است از علمی که از وجه خاص (الوجه الخاص) به تو می‌رسد، اگر معلوم، کونی از اکوان باشد که خداوند نیست. پس شرفی برای انسان نیست مگر در علم او به خداوند. اما علم او به غیر خداوند متعال، سرگرمی‌ای است که انسان محجوب (المحجوب) خود را با آن مشغول می‌سازد؛ زیرا انسان منصف همتی جز علم به او تعالی ندارد.\n\nپس بکوش تا از کسانی باشی که علم به خداوند را از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) می‌گیرند، تا شهود (الشهود) تو محمدی باشد. زیرا ما قطعاً می‌دانیم که امروز هیچ علم عینی به خداوند وجود ندارد که به طور خاص به یکی از مخلوقات خداوند اختصاص یابد. و عایشه (رضی الله عنها) در تأویل خود درباره رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به این نکته اشاره کرده است و فرموده است: «هر کس گمان کند محمد پروردگارش را دیده است، بزرگ‌ترین دروغ را بر خداوند بسته است»، زیرا خداوند می‌فرماید: «چشم‌ها او را در نمی‌یابند» (لَا تُدْرِكُهُ الْأَبْصَارُ). و در اینجا رازی است، پس در پی آن باش و مگو که من بر تو تنگ گرفته‌ام. زیرا من بر تو تنگ نگرفته‌ام که ندانی، بلکه بر تو تنگ گرفته‌ام که چنین حقیقتی را ندانی مگر در صورت محمدیه (الصورة المحمدیة). و ما بیان کردیم که بزرگ‌ترین رؤیت، رؤیت محمدی در صورت محمدیه (الصورة المحمدیة) است. و امام ابوالقاسم بن قسی (رحمه الله) در کتاب خود «خلع النعلین» به این رأی رفته است، و این روایت ما از پسر او در تونس در سال پانصد و نود است. و من این نفس [معنا] را برای دیگری ندیده‌ام تا او را تأیید کنیم، زیرا به ما نرسیده است. پس ممکن است همان‌گونه باشد که من آن را از خداوند متعال به صورت القای الهی بدون واسطه آموخته‌ام. منظورم این است که آنچه ابن قسی در این باره دانسته است، ممکن است شخص دیگری قبل یا بعد یا در زمان او نیز خداوند او را بر آن آگاه ساخته باشد و به ما نرسیده باشد، و خداوند داناتر است. پس هیچ شرفی بالاتر از شرف علم نیست و هیچ حالی برتر از حال فهم از جانب خداوند نیست."
  },
  "page_count": 2
}