{
  "id": 179,
  "title": {
    "ar": "الباب التاسع والسبعون ومائة في معرفة مقام الخلة",
    "en": "Chapter One Hundred and Seventy-Nine: Concerning the Knowledge of the Station of Intimate Friendship [al-Khulla]",
    "ur": "باب ایک سو اناسی: مقام الخلة (مقام الخلة) کی معرفت (معرفت) کے بیان میں۔",
    "fa": "باب صد و هفتاد و نهم در معرفت مقام خُلّت (الخلة)"
  },
  "content": {
    "ar": "## (الباب التاسع والسبعون ومائة في معرفة مقام الخلة)\n\n\n> بخلة الكون يسد الخلل *** بخلة الحق فأكرم به‏\n\n\n> من نعت حق ورسولي هدى *** وما له في الخلق من مشبه‏\n\n\n> إن عجزت عنه نفوس الورى *** فأنت من عالمه قم به‏\n\n\nالخلة نعت إلهي يقول قائلهم‏\n\n\n> وتخللت مسلك الروح مني *** وبذا سمي الخليل خليلا\n\n\nيعضده حال الحلاج وزليخا انكتب بدم زليخا يوسف حيث وقع وبدم الحلاج الله الله حيث وقع فأنشد\n\n\n> ما قد لي عضو ولا مفصل *** إلا وفيه لكم ذكر\n\n\n### [إذا تخللت المعرفة بالله أجزاء العارف فلا يبقى فيه جوهر فرد]\n\n\nإذا تخللت المعرفة بالله أجزاء العارف من حيث ما هو مركب فلا يبقى فيه جوهر فرد إلا وقد حلت فيه معرفة ربه فهو عارف به بكل جزء فيه ولو لا ذلك ما انتظمت أجزاؤه ولا ظهر تركيبه ولا نظرت روحانيته طبيعته فبه تعالى انتظمت الأمور معنى وحسا وخيالا وكذلك أشكال خيال الإنسان لا تتناهى وما ينتظم منها شكل إلا بالله ويكون حكمها في تلك الحضرة في المعرفة بالله حكم ما ذكرناه في الصورة الحسية والروحانية هكذا في كل موجود فإذا أحس الإنسان بما ذكرناه وتحقق به وجودا وشهودا كان خليلا من حصل في هذا المقام كان حاله في العالم نعت الحق فبه يرزق مع كفر النعم ويملي ليزداد ذلك الشخص إثما فيظهر عظم المغفرة وسلطان العفو والتجاوز\n\n\nنزل ضيف من غير ملة إبراهيم عليه السلام بإبراهيم عليه السلام فقال له إبراهيم عليه السلام وحد الله حتى أكرمك وأضيفك فقال يا إبراهيم من أجل لقمة أترك ديني ودين آبائي فانصرف عنه فأوحى الله إليه يا إبراهيم صدقك لي سبعون سنة أرزقه وهو يشرك بي فتريد أنت منه أن يترك دينه ودين آبائه لأجل لقمة فلحقه إبراهيم عليه السلام وسأله الرجوع إليه ليقربه واعتذر إليه فقال له المشرك يا إبراهيم ما بدا لك فقال إن ربي عتبني فيك وقال لي أنا أرزقه منذ سبعين سنة على كفره بي وأنت تريد منه أن يترك دينه ودين آبائه لأجل لقمة فقال المشرك أ وقد وقع هذا مثل هذا ينبغي أن يعبد فأسلم ورجع مع إبراهيم عليه السلام إلى منزله ثم عمت كرامته خلق الله من كل وارد ورد عليه فقيل له في ذلك فقال تعلمت الكرم من ربي رأيته لا يضيع أعداءه فلا أضيعهم فأوحى الله إليه أنت خليلي حقا\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم المرء على دين خليل فلينظر أحدكم من يخالل‏\n\n\nقال الشاعر\n\n\n> عن المرء لا تسأل وسل عن قرينه *** وكل خليل بالمقارن مقتد\n\n\n> إذا كنت في قوم فصاحب خيارهم *** ولا تصحب الأردى فتردى مع الردي‏\n\n\nقيل لبعضهم من أحب الناس إليك قال أخي إذا كان خليلي علامة الخليل أن يسد خلة صاحبه بما أمكنه فإذا لم يستطع قاسمه في همه كما قيل‏\n\n\n> خليلي من يقاسمني همومي *** ويرمي بالعداوة من رمانى‏\n\n\n(و قال الآخر)\n\n\n> ما أنا إلا لمن بغاني *** أرى خليلي كما يراني‏\nقال الله تعالى يا أَيُّهَا الَّذِينَ آمَنُوا لا تَتَّخِذُوا عَدُوِّي وعَدُوَّكُمْ أَوْلِياءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ وقد قلنا بأن الخليل على دين خليله وهؤلاء الموصوفون بأنهم أعداء الله مع كون الله يحسن إليهم فذلك لجهلهم به وحجب الأسباب دونه في أعينهم فلا يعلمون إلا ما شاهدوه فمن أراد تحصيل هذا المقام وأن يكون خليلا للرحمن يجمع بين الآية في قوله لا تَتَّخِذُوا عَدُوِّي وعَدُوَّكُمْ أَوْلِياءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ مع جهل الأعداء به إن الإحسان منه تعالى وهو محسن إليهم مع عداوتهم ولم يجعل في قلوبهم الشعور بذلك فينبغي للإنسان الطالب مقام الخلة أن يحسن عامة لجميع خلق الله كافرهم ومؤمنهم طائعهم وعاصيهم وأن يقوم في العالم مع قوته مقام الحق فيهم من شمول الرحمة وعموم لطائفه من حيث لا يشعرهم أن ذلك الإحسان منه ويوصل الإحسان إليهم من حيث لا يعلمون فمن عامل الخلق بهذه الطريقة وهي طريقة سهلة فإني دخلتها وذقتها فما رأيت أسهل منها ولا ألطف وما فوق لذتها لذة فإذا كان العبد بهذه المثابة صحت له الخلة وإذا لم يستطع بالظاهر لعدم الموجود أمدهم بالباطن فدعا الله لهم في نفسه بينه وبين ربه هكذا تكون حالة الخليل فهو رحمة كله ولو لا الرحمة الإلهية ما كان الله يقول وإِنْ جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَها وما كان الله يقول حَتَّى يُعْطُوا الْجِزْيَةَ أ ليس هذا كله إبقاء عليهم ولو لا ما سبقت الكلمة وكان وقوع خلاف المعلوم محالا ما تألمت ذرة في العالم فلا بد من نفوذ الكلمة ثم يكون المال للرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ فهو في الدنيا يرزق مع الكفر ويعافي ويرحم فكيف مع الايمان والاعتراف في الدار الآخرة على الكشف كما كان في قبض الذرية فعقابهم وعذابهم تطهير وتنظيف كأمراض المؤمنين وما ابتلوا به في الدنيا من مقاساة البلايا وحلول الرزايا مع إيمانهم ثم دخول بعض أهل الكبائر النار مع إيمانهم وتوحيدهم إلى أن يخرجوا بالشفاعة ثم إخراج الحق من النار من لم يعمل خيرا قط حتى الساكنين في جهنم لهم فيها حال يستعذبونها وبهذا سمي العذاب عذابا فالخليل على عادة خليله وهوقوله صَلَّى اللهُ عَليهِ وسَلَّم المرء على دين خليله‏\n\n\nأي على عادة خليله قال إمرؤ القيس‏\n\n\n> كدينك من أم الحويرث قبلها *** وجارتها أم الرباب بمأسل‏\n\n\nيقول كعادتك فمن كانت عادته في خلق الله ما عودهم الله من لطائف مننه وأسبغ عليهم من جزيل نعمه وأعطف بعضهم على بعض فلم يظهر في العالم غضب لا تشوبه رحمة ولا عداوة لا تتخللها مودة فذلك يستحق اسم الخلة لقيامه بحقها واستيفائه شروطها لو لم يكن من عظيم الرجاء في شمول الرحمة إلا قوله الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ فإذا استقرت الرحمة في العرش الحاوي على جميع أجسام العالم فكل ما يناقضها أو يريد رفعها من الأسماء والصفات فعوارض لا أصل لها في البقاء لأن الحكم للمستولي وهو الرحمن ف إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فابحث على صفات إبراهيم عليه السلام وقم بها عسى الله أن يرزقك بركته فإنه بالخلة قام بها ما هي أوجبت له الخلة فلهذا دللناك على التخلق بأخلاق الله وقد قال صَلَّى اللهُ عَليهِ وسَلَّم بعثت لأتمم مكارم الأخلاق‏\n\n\nومعنى هذا أنه لما قسمت الأخلاق إلى مكارم وإلى سفساف وظهرت مكارم الأخلاق كلها في الشرائع على الأنبياء والرسل وتبين سفسافها من مكارمها عند الجميع وما في العالم على ما يقوم عليه الدليل ويعطيه الكشف والمعرفة إلا أخلاق الله فكلها مكارم فما ثم سفساف أخلاق فبعث رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بالكلمة الجامعة إلى الناس كافة وأوتي جوامع الكلم وكل نبي تقدمه على شرع خاص فأخبر صَلَّى اللهُ عَليهِ وسَلَّم أنه بعث ليتمم مكارم الأخلاق لأنها أخلاق الله فالحق ما قيل فيه إنه سفساف أخلاق بمكارم الأخلاق فصار الكل مكارم أخلاق فما ترك صَلَّى اللهُ عَليهِ وسَلَّم في العالم سفساف أخلاق جملة واحدة لمن عرف مقصد الشرع فأبان لنا مصارف لهذا المسمى سفساف أخلاق من حرص وحسد وشره وبخل وفزع وكل صفة مذمومة فأعطانا لها مصارف إذا أجريناها على تلك المصارف عادت مكارم أخلاق وزال عنها اسم الذم وكانت محمودة فتمم الله به مكارم الأخلاق فلا ضد له كما أنه لا ضد للحق وكل ما في الكون أخلاقه فكلها مكارم ولكن لا تعرف وما أمر الله باجتناب ما يجتنب منها إلا لاعتقادهم فيها إنها سفساف أخلاق وأوحى إلى نبيه أن يبين مصارفها ليتنبهوا فمنا من علم ومنا من جهل فهذا معنى قوله إنه بعث ليتمم مكارم الأخلاق وبه كان خاتما\n\n",
    "en": "## Chapter One Hundred and Seventy-Nine: Concerning the Knowledge of the Station of Intimate Friendship (al-Khulla)\n\nThrough the intimate friendship (khulla) of the Cosmos, the deficiency (khalal) is repaired,\nAnd through the intimate friendship of the Real (al-Haqq), how honored is he!\n\nHe is of the attribute of the Real, and my Messenger guided,\nAnd he has no peer among creation.\n\nIf the souls of mankind are incapable of attaining it,\nThen you are of its world; rise up to it.\n\nIntimate Friendship (al-Khulla) is a Divine Attribute (na‘t ilahi). One of them said:\n\n\"You penetrated the pathway of the spirit within me,\nAnd by this was the Intimate Friend (al-Khalil) named the Intimate Friend.\"\n\nThis is supported by the state (hal) of al-Hallaj and Zulaikha. Written in Zulaikha’s blood, wherever it fell, was \"Yusuf,\" and in al-Hallaj’s blood, wherever it fell, was \"Allah, Allah.\" Then he recited:\n\n\"No limb or joint is mine,\nExcept that in it is a remembrance of you.\"\n\n### [When Gnosis of Allah Penetrates the Parts of the Gnostic, No Single Atom Remains in Him]\n\nWhen the Gnosis (al-Ma‘rifa) of Allah penetrates the parts (ajza’) of the Gnostic (al-‘Arif), insofar as he is a composite being, no single atom (jawhar fard) remains in him except that the knowledge of his Lord has settled within it. Thus, he knows Him through every part of himself. Were it not for this, his parts would not be ordered, nor would his composition appear, nor would his spirituality (ruhaniyya) regard his nature. Through Him, the Exalted, all matters are ordered: conceptually, sensually, and imaginatively (khayalan).\n\nSimilarly, the forms of human imagination are endless, and no form among them is ordered except by Allah. Their ruling in that Presence (hadra), concerning the Gnosis of Allah, is the same as what we mentioned regarding the sensible and spiritual form. This applies to every existent thing.\n\nTherefore, when a human being perceives what we have mentioned and realizes it, both in existence (wujud) and witnessing (shuhud), he becomes an Intimate Friend (Khalil). Whoever attains this station (maqam), his state in the world is an attribute of the Real (na‘t al-Haqq). Through him, sustenance is provided even while blessings are denied, and respite is granted so that the person may increase in sin, thereby manifesting the greatness of Forgiveness and the sovereignty of Pardon and Overlooking.\n\nA guest, who was not of the religion of Abraham (peace be upon him), came down to him. Abraham said to him, \"Unify Allah so that I may honor you and host you.\" The man replied, \"O Abraham, should I abandon my religion and the religion of my fathers for the sake of a morsel?\" So Abraham turned away from him.\n\nAllah revealed to him: \"O Abraham, I have sustained him for seventy years while he associates partners with Me. Do you wish him to abandon his religion and the religion of his fathers for the sake of a morsel?\"\n\nAbraham caught up with him and asked him to return so that he might host him, and he apologized to him. The polytheist asked, \"O Abraham, what has changed your mind?\"\n\nHe replied, \"My Lord rebuked me concerning you. He said to me, 'I have sustained him for seventy years despite his disbelief in Me, and you wish him to abandon his religion and the religion of his fathers for the sake of a morsel?'\"\n\nThe polytheist said, \"Oh! Has this happened? Such a One ought to be worshipped!\" So he submitted and returned with Abraham (peace be upon him) to his dwelling.\n\nThereafter, Abraham’s generosity encompassed all of Allah’s creation, every visitor who came to him. When he was questioned about this, he said, \"I learned generosity from my Lord. I saw that He does not abandon His enemies, so I shall not abandon them.\" Then Allah revealed to him: \"You are truly My Intimate Friend (Khalili haqqan).\"\n\nThe Messenger of Allah (may Allah bless him and grant him peace) said: \"A man is upon the religion of his intimate friend (khalil), so let one of you look carefully at whom he takes as an intimate friend.\"\n\nThe poet said:\n\n\"Do not ask about the man, but ask about his companion,\nFor every intimate friend follows his associate.\n\nIf you are among a people, associate with the best of them,\nAnd do not associate with the worst, lest you fall with the worst.\"\n\nIt was said to some of them, \"Who is the most beloved of people to you?\" He replied, \"My brother, if he is my intimate friend.\"\n\nThe sign of the Intimate Friend is that he mends the deficiency (khalla) of his companion with whatever he can. If he is unable, he shares his worry, as was said:\n\n\"My intimate friend is he who shares my worries,\nAnd casts enmity upon whoever casts enmity upon me.\"\n\n(And another said):\n\n\"I am only for the one who seeks me,\nI see my intimate friend as he sees me.\"\n\nAllah the Exalted said: <<يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ>> (O you who have believed, do not take My enemy and your enemy as allies, extending to them affection).\n\nWe have already stated that the Intimate Friend is upon the religion of his intimate friend. These individuals, described as enemies of Allah, are treated kindly by Allah because of their ignorance of Him and because the veils of secondary causes (asbab) obscure Him in their eyes. Thus, they know only what they witness.\n\nWhoever desires to attain this station and become an Intimate Friend of the All-Merciful (Khalil al-Rahman) must reconcile the verse <<لَا تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ>> (Do not take My enemy and your enemy as allies, extending to them affection) with the fact that these enemies are ignorant of Him, and that kindness (al-ihsan) comes from Him, the Exalted, and He is kind to them despite their enmity, without placing the awareness of this kindness in their hearts.\n\nTherefore, the human seeker of the station of Intimate Friendship (maqam al-Khulla) must show universal kindness to all of Allah’s creation: their disbelievers and their believers, their obedient and their rebellious. And he must stand in the world, with his strength, in the station of the Real (maqam al-Haqq) concerning them, encompassing them with Mercy (rahma) and the universality of His subtle graces (lata’if), without making them aware that this kindness originates from him, delivering kindness to them from where they do not know.\n\nWhoever deals with creation in this manner—and it is an easy path, for I have entered it and tasted it, and I have seen nothing easier or subtler, and no delight above its delight—when the servant reaches this level, Intimate Friendship is confirmed for him. If he cannot achieve this outwardly due to lack of means, he supports them inwardly (al-batin), praying to Allah for them privately between himself and his Lord. This is the state of the Intimate Friend; he is entirely Mercy.\n\nWere it not for the Divine Mercy (al-Rahma al-Ilahiyya), Allah would not have said: <<وَإِن جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَهَا>> (But if they incline to peace, you also incline to it), nor would Allah have said: <<حَتَّى يُعْطُوا الْجِزْيَةَ>> (Until they give the jizya [tribute]). Is this not all preservation (ibqa’) for them? Were it not for the Word (al-Kalima) that preceded, and were the occurrence of anything contrary to what is Known (al-Ma‘lum) impossible, not a single atom in the world would suffer pain. The Word must necessarily be executed, but the ultimate outcome belongs to the Mercy which <<وَسِعَتْ كُلَّ شَيْءٍ>> (encompasses all things).\n\nThus, in this world, the disbeliever is sustained, granted well-being, and shown mercy. How much more so will this be the case for the believer who acknowledges the Truth in the Hereafter, based on Unveiling (al-Kashf), just as it was in the grasp of the progeny? Therefore, their punishment and torment are purification and cleansing, just like the illnesses of the believers and the afflictions they endure in this world—the suffering of calamities and the descent of misfortunes—despite their faith.\n\nThen there is the entry of some perpetrators of major sins into the Fire, despite their faith and affirmation of Unity (tawhid), until they are brought out by intercession (shafa‘a). Then there is the Real’s removal from the Fire of those who never did any good whatsoever. Even those dwelling in Hell (Jahannam) have a state within it that they find sweet, and by this is the torment called ‘sweet water’ (‘adhab).\n\nThus, the Intimate Friend follows the custom (‘ada) of his intimate friend. This is the meaning of his saying (may Allah bless him and grant him peace): \"A man is upon the religion of his intimate friend,\" meaning, upon the custom of his intimate friend. Imru’ al-Qays said:\n\n\"Like your custom (din) with Umm al-Huwayrith before her,\nAnd her neighbor Umm al-Rabab at Ma’sal.\"\n\nHe means: \"Like your custom.\"\n\nSo, whoever’s custom regarding Allah’s creation is what Allah has accustomed them to—the subtlety of His favors, the abundance of His great blessings poured upon them, and the affection He instilled between them—so that no wrath appears in the world that is not mixed with Mercy, and no enmity that is not penetrated by affection, then that person deserves the name of Intimate Friend (al-Khulla) for fulfilling its right and satisfying its conditions.\n\nIf there were nothing else to inspire great hope in the universality of Mercy except His saying: <<الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى>> (The All-Merciful established Himself upon the Throne), [that would suffice]. Since Mercy is established upon the Throne (al-‘Arsh), which encompasses all the bodies of the Cosmos (al-‘alam), everything that contradicts it or seeks to remove it among the Names (al-Asma’) and Attributes (al-Sifat) are merely transient accidents (‘awarid) that have no basis in Subsistence (al-Baqa’), because the ruling authority belongs to the One who is established, and that is the All-Merciful (al-Rahman). For <<إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (To Him is referred the whole affair).\n\nTherefore, seek out the attributes of Abraham (peace be upon him) and stand by them, so that Allah may grant you his blessing. For it was through Intimate Friendship that he stood by them, and it was not they that necessitated Intimate Friendship for him.\n\nFor this reason, we have guided you to assume the character traits (al-takhalluq) of Allah. The Prophet (may Allah bless him and grant him peace) said: \"I was sent to perfect noble character traits (makarim al-akhlaq).\"\n\nThe meaning of this is that when character traits were divided into noble and base, and all noble character traits appeared in the Divine Laws (al-Shara’i‘) through the Prophets and Messengers, and their base aspects were distinguished from their noble aspects by everyone—yet, according to what the proof establishes and what Unveiling and Gnosis grant, there are only the character traits of Allah in the Cosmos, and all of them are noble. Thus, there is no such thing as base character traits.\n\nSo, the Messenger of Allah (may Allah bless him and grant him peace) was sent with the comprehensive Word (al-Kalima al-Jami‘a) to all mankind, and he was granted comprehensive speech (jawami‘ al-kalim), whereas every Prophet before him was sent with a specific law. He (may Allah bless him and grant him peace) informed us that he was sent to perfect noble character traits because they are the character traits of Allah. The truth is that what was called base character traits was perfected by noble character traits, so that everything became noble character traits.\n\nThus, the Prophet (may Allah bless him and grant him peace) did not leave any base character traits whatsoever in the world for the one who knows the purpose of the Divine Law (maqsid al-Shar‘). He clarified for us the proper channels (masarif) for what is called base character traits—such as greed, envy, gluttony, stinginess, and panic, and every blameworthy attribute—and gave us channels for them. If we direct them through those channels, they revert to noble character traits, the name of blame is removed from them, and they become praiseworthy.\n\nThus, Allah perfected noble character traits through him. He has no opposite, just as the Real has no opposite, and everything in the Cosmos is His character trait, so all of them are noble, though they may not be recognized as such. Allah only commanded the avoidance of what is to be avoided among them because of people’s belief that they are base character traits. He revealed to His Prophet to clarify their proper channels so that people might become aware. Among us are those who know, and among us are those who are ignorant. This is the meaning of his saying that he was sent to perfect noble character traits, and by this, he was the Seal (khatiman).",
    "ur": "## (باب ایک سو اناسی: مقام خُلّت (مقام الخلة) کی معرفت میں)\n\n> **بخلة الكون يسد الخلل *** بخلة الحق فأكرم به‏**\n> خُلّتِ کَون سے کمی دور ہوتی ہے، خُلّتِ حق سے تو کیا ہی شرف حاصل ہوتا ہے!\n> **من نعت حق ورسولي هدى *** وما له في الخلق من مشبه‏**\n> وہ ذات حق (الحق) کی صفت ہے اور میری رہنمائی کرنے والا رسول ہے، مخلوق میں اس کا کوئی ہم پلہ نہیں۔\n> **إن عجزت عنه نفوس الورى *** فأنت من عالمه قم به‏**\n> اگر مخلوق کے نفوس اس سے عاجز آ جائیں، تو تم اس کے عالم سے ہو، اس کے ساتھ قائم ہو جاؤ۔\n\nخُلّت (الخلة) ایک الٰہی صفت (نعت إلهي) ہے، ان کے کہنے والے کہتے ہیں:\n\n> **وتخللت مسلك الروح مني *** وبذا سمي الخليل خليلا**\n> تو میری روح کی گزرگاہ میں سرایت کر گیا، اور اسی لیے خلیل کو خلیل کہا گیا۔\n\nاس کی تائید حلاج اور زلیخا کے حال سے ہوتی ہے۔ زلیخا کے خون سے جہاں بھی گرا، یوسف لکھا گیا، اور حلاج کے خون سے جہاں بھی گرا، اللہ اللہ لکھا گیا۔ پس اس نے یہ شعر پڑھا:\n\n> **ما قد لي عضو ولا مفصل *** إلا وفيه لكم ذكر**\n> میرا کوئی عضو یا جوڑ ایسا نہیں، مگر اس میں تمہارا ذکر موجود ہے۔\n\n### [جب معرفت باللہ عارف کے اجزاء میں سرایت کر جاتی ہے تو اس میں کوئی جوہر فرد باقی نہیں رہتا]\n\nجب ذات حق (الحق) کی معرفت (المعرفة) عارف کے اجزاء میں اس حیثیت سے سرایت کر جاتی ہے کہ وہ مرکب ہے، تو اس میں کوئی جوہر فرد باقی نہیں رہتا مگر یہ کہ اس میں اس کے رب کی معرفت حلول کر چکی ہو۔ پس وہ اپنے ہر جزو کے ذریعے اس کا عارف ہوتا ہے۔ اگر ایسا نہ ہوتا تو اس کے اجزاء منظم نہ ہوتے، نہ اس کی ترکیب ظاہر ہوتی، اور نہ اس کی روحانیت (روحانيته) اس کی طبیعت پر نظر ڈالتی۔ پس اسی ذات حق (الحق) کے ذریعے ہی امور معنی، حس اور خیال کے اعتبار سے منظم ہوئے۔ اسی طرح انسان کے خیال کی شکلیں لامتناہی ہیں، اور ان میں سے کوئی شکل منظم نہیں ہوتی مگر اللہ کے ذریعے۔ اور اس معرفت (المعرفة) میں اس کا حکم اس حضور (الحضرة) میں وہی ہوتا ہے جو ہم نے حسی اور روحانی صورت میں بیان کیا ہے۔ ہر موجود میں یہی حال ہے۔ پس جب انسان اس چیز کو محسوس کر لیتا ہے جس کا ہم نے ذکر کیا اور وجود (وجودا) اور شہود (شهودا) کے ذریعے اس کی حقیقت کو پا لیتا ہے، تو وہ خلیل (الخليل) بن جاتا ہے۔\n\nجو شخص اس مقام کو حاصل کر لیتا ہے، دنیا میں اس کا حال ذات حق (الحق) کی صفت (نعت الحق) جیسا ہوتا ہے۔ اسی کے ذریعے نعمتوں کی ناشکری کے باوجود رزق دیا جاتا ہے اور مہلت دی جاتی ہے تاکہ وہ شخص گناہ میں بڑھ جائے، اور اس طرح مغفرت کی عظمت اور عفو و درگزر کا غلبہ ظاہر ہو۔\n\nحضرت ابراہیم علیہ السلام کے پاس ان کی ملت سے باہر کا ایک مہمان آیا۔ ابراہیم علیہ السلام نے اس سے کہا: اللہ کو ایک مانو تاکہ میں تمہاری عزت کروں اور تمہاری میزبانی کروں۔ اس نے کہا: اے ابراہیم، ایک لقمے کی خاطر میں اپنا اور اپنے آباؤ اجداد کا دین چھوڑ دوں؟ پس ابراہیم علیہ السلام اس سے منہ موڑ کر چلے گئے۔ اللہ تعالیٰ نے ان کی طرف وحی بھیجی: اے ابراہیم، ستر سال سے میں اسے رزق دے رہا ہوں حالانکہ وہ میرے ساتھ شرک کرتا ہے، اور تم چاہتے ہو کہ وہ ایک لقمے کی خاطر اپنا اور اپنے آباؤ اجداد کا دین چھوڑ دے؟ پس ابراہیم علیہ السلام نے اس کا پیچھا کیا اور اسے واپس آنے کی درخواست کی تاکہ وہ اس کی میزبانی کر سکیں اور اس سے معذرت کی۔ مشرک نے ان سے پوچھا: اے ابراہیم، تمہیں کیا ہوا؟ انہوں نے کہا: میرے رب نے تمہارے بارے میں مجھ پر عتاب کیا اور فرمایا کہ میں اسے ستر سال سے اس کے کفر کے باوجود رزق دے رہا ہوں، اور تم چاہتے ہو کہ وہ ایک لقمے کی خاطر اپنا اور اپنے آباؤ اجداد کا دین چھوڑ دے؟ مشرک نے کہا: اوہ! کیا ایسا ہوا ہے؟ ایسی ذات کی عبادت کرنی چاہیے۔ پس وہ مسلمان ہو گیا اور ابراہیم علیہ السلام کے ساتھ ان کے گھر واپس آ گیا۔ پھر ان کی سخاوت اللہ کی تمام مخلوق پر عام ہو گئی جو بھی ان کے پاس آتا۔ جب ان سے اس بارے میں پوچھا گیا تو انہوں نے کہا: میں نے اپنے رب سے کرم سیکھا ہے۔ میں نے دیکھا کہ وہ اپنے دشمنوں کو بھی ضائع نہیں کرتا، تو میں انہیں کیسے ضائع کروں؟ پس اللہ تعالیٰ نے ان کی طرف وحی بھیجی: تم واقعی میرے خلیل (خليلي) ہو۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n> **المرء على دين خليل فلينظر أحدكم من يخالل‏**\n> آدمی اپنے خلیل (خلیل) کے دین پر ہوتا ہے، پس تم میں سے ہر ایک کو دیکھنا چاہیے کہ وہ کس سے خُلّت (خُلّت) کرتا ہے۔\n\nشاعر نے کہا:\n> **عن المرء لا تسأل وسل عن قرينه *** وكل خليل بالمقارن مقتد**\n> آدمی کے بارے میں مت پوچھو، بلکہ اس کے ساتھی کے بارے میں پوچھو، اور ہر خلیل (خلیل) اپنے ساتھی کی پیروی کرتا ہے۔\n> **إذا كنت في قوم فصاحب خيارهم *** ولا تصحب الأردى فتردى مع الردي‏**\n> اگر تم کسی قوم میں ہو تو ان کے بہترین لوگوں سے دوستی کرو، اور برے لوگوں کی صحبت اختیار نہ کرو ورنہ تم بھی برے کے ساتھ ہلاک ہو جاؤ گے۔\n\nبعض لوگوں سے پوچھا گیا: تمہیں سب سے زیادہ محبوب کون ہے؟ اس نے کہا: میرا بھائی، اگر وہ میرا خلیل (خليلي) ہو۔ خلیل (الخليل) کی علامت یہ ہے کہ وہ اپنے ساتھی کی کمی (خلة) کو جہاں تک ممکن ہو دور کرے۔ اور اگر وہ ایسا نہ کر سکے تو اس کے غم میں شریک ہو جائے، جیسا کہ کہا گیا ہے:\n\n> **خليلي من يقاسمني همومي *** ويرمي بالعداوة من رمانى‏**\n> میرا خلیل (خليلي) وہ ہے جو میرے غموں میں میرا شریک ہو، اور جو مجھ پر دشمنی کرے اس پر دشمنی کرے۔\n\n(اور دوسرے نے کہا):\n> **ما أنا إلا لمن بغاني *** أرى خليلي كما يراني‏**\n> میں صرف اس کے لیے ہوں جو مجھے چاہتا ہے، میں اپنے خلیل (خليلي) کو ویسا ہی دیکھتا ہوں جیسا وہ مجھے دیکھتا ہے۔\n\nاللہ تعالیٰ نے فرمایا:\n> **يا أَيُّهَا الَّذِينَ آمَنُوا لا تَتَّخِذُوا عَدُوِّي وعَدُوَّكُمْ أَوْلِياءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ**\n> اے ایمان والو! میرے اور اپنے دشمنوں کو دوست نہ بناؤ کہ تم ان کی طرف محبت کا پیغام بھیجو۔\n\nاور ہم نے کہا ہے کہ خلیل (الخليل) اپنے خلیل (خلیل) کے دین پر ہوتا ہے۔ اور یہ وہ لوگ ہیں جنہیں اللہ کا دشمن کہا جاتا ہے، اس کے باوجود اللہ ان کے ساتھ احسان کرتا ہے۔ یہ ان کی ذات حق (الحق) سے جہالت کی وجہ سے ہے اور اسباب کے پردے ان کی آنکھوں میں حائل ہیں، لہٰذا وہ صرف وہی جانتے ہیں جو انہوں نے دیکھا ہے۔ پس جو شخص اس مقام کو حاصل کرنا چاہتا ہے اور رحمن کا خلیل (خلیل) بننا چاہتا ہے، اسے اس آیت کو جمع کرنا چاہیے: **لا تَتَّخِذُوا عَدُوِّي وعَدُوَّكُمْ أَوْلِياءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ** (میرے اور اپنے دشمنوں کو دوست نہ بناؤ کہ تم ان کی طرف محبت کا پیغام بھیجو)، اس کے ساتھ کہ دشمن ذات حق (الحق) سے جاہل ہیں، لیکن اس کی طرف سے ان کے ساتھ احسان ہو رہا ہے، اور وہ ان کی عداوت کے باوجود ان پر احسان کرنے والا ہے، اور اس نے ان کے دلوں میں اس کا شعور پیدا نہیں کیا۔ لہٰذا، خُلّت (الخلة) کے مقام کا طالب انسان کو چاہیے کہ وہ اللہ کی تمام مخلوق کے ساتھ عام طور پر احسان کرے، خواہ وہ کافر ہوں یا مومن، فرمانبردار ہوں یا نافرمان۔ اور اسے چاہیے کہ وہ اپنی طاقت کے ساتھ دنیا میں ان کے درمیان ذات حق (الحق) کے مقام پر قائم ہو جائے، یعنی رحمت کے شمول اور اس کے لطف و کرم کے عموم کے ساتھ، اس طرح کہ انہیں یہ احساس نہ ہو کہ یہ احسان اس کی طرف سے ہے۔ اور وہ ان تک احسان اس طرح پہنچائے کہ انہیں علم نہ ہو۔ پس جو شخص مخلوق کے ساتھ اس طریقے سے معاملہ کرتا ہے، اور یہ ایک آسان طریقہ ہے، کیونکہ میں اس میں داخل ہوا ہوں اور میں نے اسے چکھا ہے، تو میں نے اس سے زیادہ آسان اور لطیف کوئی چیز نہیں دیکھی، اور اس کی لذت سے بڑھ کر کوئی لذت نہیں۔ پس جب بندہ اس مرتبے پر فائز ہو جاتا ہے تو اس کے لیے خُلّت (الخلة) صحیح ہو جاتی ہے۔ اور اگر وہ ظاہری طور پر موجود نہ ہونے کی وجہ سے ایسا نہ کر سکے، تو وہ باطن کے ذریعے ان کی مدد کرے، پس وہ اپنے اور اپنے رب کے درمیان تنہائی میں ان کے لیے دعا کرے۔ خلیل (الخليل) کا حال ایسا ہی ہوتا ہے، وہ سراپا رحمت ہوتا ہے۔\n\nاور اگر الٰہی رحمت نہ ہوتی تو اللہ تعالیٰ یہ نہ فرماتا:\n> **وإِنْ جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَها**\n> اور اگر وہ صلح کی طرف مائل ہوں تو تم بھی اس کی طرف مائل ہو جاؤ۔\n\nاور نہ اللہ تعالیٰ یہ فرماتا:\n> **حَتَّى يُعْطُوا الْجِزْيَةَ**\n> یہاں تک کہ وہ جزیہ دیں۔\n\nکیا یہ سب ان پر بقا نہیں؟ اور اگر کلمہ (الکلمة) پہلے سے نہ ہو چکا ہوتا اور معلوم کے خلاف کا وقوع محال نہ ہوتا، تو دنیا میں ایک ذرہ بھی تکلیف نہ اٹھاتا۔ پس کلمہ کا نافذ ہونا ضروری ہے، پھر انجام اس رحمت کے لیے ہو گا جو **وَسِعَتْ كُلَّ شَيْ‏ءٍ** (ہر چیز پر چھا گئی ہے)۔ پس وہ دنیا میں کفر کے باوجود رزق دیتا ہے، عافیت دیتا ہے اور رحم کرتا ہے، تو آخرت میں ایمان اور اعتراف کے ساتھ کشف (الکشف) پر کیا حال ہو گا، جیسا کہ ذریات کو قبض کرنے میں تھا۔ پس ان کا عقاب اور عذاب درحقیقت تطہیر اور صفائی ہے، جیسے مومنوں کی بیماریاں اور وہ آزمائشیں جن میں وہ دنیا میں مبتلا ہوتے ہیں، یعنی مصیبتوں کا سامنا کرنا اور آفات کا آنا، ان کے ایمان کے باوجود۔ پھر بعض کبیرہ گناہوں کے مرتکب افراد کا اپنے ایمان اور توحید کے باوجود جہنم میں داخل ہونا، یہاں تک کہ وہ شفاعت کے ذریعے نکالے جائیں گے، پھر ذات حق (الحق) کا ان لوگوں کو بھی آگ سے نکالنا جنہوں نے کبھی کوئی نیکی نہیں کی، یہاں تک کہ جہنم میں رہنے والوں کے لیے بھی وہاں ایک ایسا حال ہو گا جسے وہ شیریں سمجھیں گے، اور اسی وجہ سے عذاب کو عذاب (شیریں) کہا جاتا ہے۔ پس خلیل (الخليل) اپنے خلیل (خلیل) کی عادت پر ہوتا ہے، اور یہی رسول اللہ صلی اللہ علیہ وسلم کا قول ہے:\n> **المرء على دين خليله‏**\n> آدمی اپنے خلیل (خلیل) کے دین پر ہوتا ہے۔\n\nیعنی اپنے خلیل (خلیل) کی عادت پر۔ امرؤ القیس نے کہا:\n> **كدينك من أم الحويرث قبلها *** وجارتها أم الرباب بمأسل‏**\n> جیسا کہ تمہاری عادت تھی ام حویرث سے پہلے اور اس کی پڑوسن ام رباب سے مأسل میں۔\n\nوہ کہتا ہے: تمہاری عادت کے مطابق۔ پس جس کی عادت اللہ کی مخلوق میں وہی ہو جو اللہ نے انہیں اپنے لطف و کرم کی نزاکتوں سے سکھائی ہے، اور ان پر اپنی عظیم نعمتیں مکمل کی ہیں، اور ان میں سے بعض کو بعض پر مہربان کیا ہے، اور دنیا میں کوئی ایسا غضب ظاہر نہیں ہوا جس میں رحمت کی آمیزش نہ ہو، اور کوئی ایسی عداوت نہیں جس میں محبت سرایت نہ کر گئی ہو، تو وہ شخص خُلّت (الخلة) کے نام کا مستحق ہے، کیونکہ اس نے اس کا حق ادا کیا اور اس کی شرائط کو پورا کیا۔\n\nاگر رحمت کے شمول میں عظیم امید کے لیے صرف یہ قول نہ ہوتا:\n> **الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏**\n> رحمن (اللہ) عرش پر مستوی ہوا۔\n\nپس جب رحمت عرش پر مستحکم ہو گئی جو عالم کے تمام اجسام کو گھیرے ہوئے ہے، تو ہر وہ چیز جو اس کی نفی کرتی ہے یا اسے ہٹانا چاہتی ہے، اسماء و صفات میں سے، وہ عارضی ہیں جن کی بقا میں کوئی اصل نہیں، کیونکہ حکم غالب کا ہے اور وہ رحمن ہے۔ پس **إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ** (اسی کی طرف تمام معاملات لوٹائے جاتے ہیں)۔ پس حضرت ابراہیم علیہ السلام کی صفات کی تلاش کرو اور ان پر قائم ہو جاؤ، شاید اللہ تمہیں ان کی برکت سے نوازے۔ کیونکہ انہوں نے خُلّت (الخلة) کے ذریعے ہی قیام کیا، نہ کہ خُلّت (الخلة) نے انہیں واجب کیا۔ اسی لیے ہم نے تمہیں اللہ کے اخلاق سے متصف ہونے کی رہنمائی کی ہے۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n> **بعثت لأتمم مكارم الأخلاق‏**\n> میں مکارمِ اخلاق (اچھے اخلاق) کی تکمیل کے لیے بھیجا گیا ہوں۔\n\nاس کا مطلب یہ ہے کہ جب اخلاق کو مکارم (اچھے اخلاق) اور سفساف (برے اخلاق) میں تقسیم کیا گیا، اور تمام مکارمِ اخلاق انبیاء اور رسولوں کی شریعتوں میں ظاہر ہوئے، اور ان کے سفساف (برے اخلاق) مکارم (اچھے اخلاق) سے سب کے نزدیک واضح ہو گئے، حالانکہ عالم میں دلیل کے مطابق اور کشف (الکشف) و معرفت (المعرفة) کے عطا کردہ کے مطابق صرف اللہ کے اخلاق ہیں، پس وہ سب مکارم (اچھے اخلاق) ہیں۔ وہاں کوئی سفسافِ اخلاق (برے اخلاق) نہیں ہے۔ پس رسول اللہ صلی اللہ علیہ وسلم کو تمام لوگوں کے لیے کلمہ جامعہ کے ساتھ بھیجا گیا اور انہیں جوامع الکلم (جامع کلمات) عطا کیے گئے، جبکہ ان سے پہلے ہر نبی ایک خاص شریعت پر تھا۔ پس آپ صلی اللہ علیہ وسلم نے خبر دی کہ آپ مکارمِ اخلاق کی تکمیل کے لیے بھیجے گئے ہیں، کیونکہ وہ اللہ کے اخلاق ہیں۔ پس حق یہ ہے کہ جسے سفسافِ اخلاق (برے اخلاق) کہا گیا، وہ مکارمِ اخلاق (اچھے اخلاق) کے ساتھ مل گئے، اور سب کے سب مکارمِ اخلاق بن گئے۔ پس آپ صلی اللہ علیہ وسلم نے اس شخص کے لیے جو شریعت کے مقصد کو جانتا ہے، دنیا میں سفسافِ اخلاق کو یکسر نہیں چھوڑا، بلکہ انہوں نے ہمیں اس چیز کے لیے مصارف (استعمال کی جگہیں) بیان کیے جسے سفسافِ اخلاق کہا جاتا ہے، جیسے حرص، حسد، لالچ، بخل، اور گھبراہٹ، اور ہر مذموم صفت۔ پس انہوں نے ہمیں ان کے لیے ایسے مصارف عطا کیے کہ جب ہم انہیں ان مصارف پر جاری کرتے ہیں تو وہ مکارمِ اخلاق بن جاتے ہیں اور ان سے مذمت کا نام زائل ہو جاتا ہے اور وہ محمود ہو جاتے ہیں۔ پس اللہ نے آپ صلی اللہ علیہ وسلم کے ذریعے مکارمِ اخلاق کی تکمیل فرمائی۔ پس آپ کا کوئی ضد نہیں، جیسا کہ ذات حق (الحق) کا کوئی ضد نہیں۔ اور کائنات میں جو کچھ بھی ہے وہ اس کے اخلاق ہیں، پس وہ سب مکارم (اچھے اخلاق) ہیں، لیکن انہیں پہچانا نہیں جاتا۔ اور اللہ نے ان چیزوں سے بچنے کا حکم صرف اس لیے دیا جن سے بچا جاتا ہے کہ لوگ انہیں سفسافِ اخلاق سمجھتے تھے۔ اور اس نے اپنے نبی کی طرف وحی کی کہ وہ ان کے مصارف بیان کریں تاکہ لوگ متنبہ ہوں، پس ہم میں سے کچھ نے جان لیا اور کچھ نے جہالت کی۔ پس یہ ہے اس قول کا معنی کہ آپ مکارمِ اخلاق کی تکمیل کے لیے بھیجے گئے، اور اسی کے ذریعے آپ خاتم (خاتم) تھے۔",
    "fa": "(باب صد و هفتاد و نهم در معرفت مقام خُلّت)\n\n> با خُلّت کَون (الکون)، نقص‌ها برطرف می‌شود *** و با خُلّت حق (الحق)، چه گرامی است او!\n> او صفتی از حق (الحق) و رسولی هدایتگر است *** و در میان خلق، هیچ شبیهی ندارد.\n> اگر نفوس مردمان از درک او عاجز شوند *** تو از عالم او هستی، پس به آن قیام کن.\n\nخُلّت (الخلة) صفتی الهی است که گوینده‌ای در وصف آن می‌گوید:\n\n> و در مسیر روح من نفوذ کردی *** و به همین دلیل، خلیل، خلیل نامیده شد.\n\nحال حلاج و زلیخا این را تأیید می‌کند؛ با خون زلیخا، هر جا که می‌افتاد، «یوسف» نوشته می‌شد و با خون حلاج، هر جا که می‌افتاد، «الله الله» نوشته می‌شد. پس سرود:\n\n> هیچ عضو و مفصلی برای من نیست *** مگر آنکه در آن، یاد شماست.\n\n### [آنگاه که معرفت به خداوند در اجزای عارف نفوذ کند، هیچ جوهر فردی باقی نمی‌ماند]\n\nهنگامی که معرفت (المعرفة) به خداوند در اجزای عارف، از آن حیث که مرکب است، نفوذ کند، هیچ جوهر فردی باقی نمی‌ماند مگر آنکه معرفت پروردگارش در آن حلول کرده باشد. پس او با هر جزء خود، عارف به حق است. اگر چنین نبود، اجزای او نظم نمی‌یافت و ترکیبش آشکار نمی‌شد و روحانیت او به طبیعتش نظر نمی‌کرد. پس به واسطه او تعالی است که امور، چه در معنا، چه در حس و چه در خیال، نظم یافته‌اند. همچنین، اشکال خیال انسان نامتناهی است و هیچ شکلی از آن‌ها نظم نمی‌یابد مگر به واسطه خداوند. و حکم این اشکال در آن حضرت، در معرفت به خداوند، همانند حکمی است که برای صورت حسی و روحانی ذکر کردیم؛ و اینچنین است در هر موجودی. پس هنگامی که انسان آنچه را ذکر کردیم، احساس کند و به آن وجوداً و شهوداً (الشهود) تحقق یابد، خلیل خواهد بود. کسی که به این مقام دست یابد، حال او در جهان، صفت حق (الحق) است. به واسطه اوست که روزی داده می‌شود، حتی با وجود کفران نعمت‌ها، و مهلت داده می‌شود تا آن شخص بر گناه خود بیفزاید، تا عظمت مغفرت و سلطنت عفو و گذشت آشکار گردد.\n\nمهمانی از غیر ملت ابراهیم (علیه السلام) بر ابراهیم (علیه السلام) وارد شد. ابراهیم (علیه السلام) به او گفت: «خدا را یگانه بدان تا تو را گرامی بدارم و مهمان کنم.» او گفت: «ای ابراهیم، به خاطر یک لقمه، دین خود و دین پدرانم را ترک کنم؟» پس ابراهیم از او روی گرداند. خداوند به او وحی کرد: «ای ابراهیم، هفتاد سال است که من او را روزی می‌دهم در حالی که به من شرک می‌ورزد، آنگاه تو می‌خواهی او به خاطر یک لقمه، دین خود و دین پدرانش را ترک کند؟» ابراهیم (علیه السلام) به دنبال او رفت و از او خواست که بازگردد تا او را گرامی بدارد و از او عذرخواهی کرد. مشرک گفت: «ای ابراهیم، چه چیزی برای تو پیش آمده است؟» ابراهیم گفت: «پروردگارم مرا درباره تو سرزنش کرد و فرمود: من هفتاد سال است که او را با وجود کفرش به من روزی می‌دهم، آنگاه تو می‌خواهی او به خاطر یک لقمه، دین خود و دین پدرانش را ترک کند؟» مشرک گفت: «آیا چنین چیزی رخ داده است؟ چنین کسی شایسته پرستش است.» پس اسلام آورد و همراه ابراهیم (علیه السلام) به منزلش بازگشت. سپس کرامت ابراهیم شامل حال همه خلق خدا شد، از هر کسی که بر او وارد می‌شد. از او درباره این کار پرسیدند، گفت: «کرم را از پروردگارم آموختم. دیدم که او دشمنانش را ضایع نمی‌کند، پس من نیز آن‌ها را ضایع نمی‌کنم.» پس خداوند به او وحی کرد: «تو به راستی خلیل من هستی.»\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «انسان بر دین دوست صمیمی (خلیل) خود است، پس هر یک از شما بنگرد که با چه کسی دوستی می‌کند.»\n\nشاعر گفت:\n\n> از شخص مپرس و از همنشین او بپرس *** و هر خلیلی از همنشین خود پیروی می‌کند.\n> اگر در میان قومی بودی، با بهترین‌هایشان مصاحبت کن *** و با فرومایگان همنشین مشو که با فرومایه، فرومایه می‌شوی.\n\nبه یکی از آن‌ها گفته شد: محبوب‌ترین مردم نزد تو کیست؟ گفت: برادرم، اگر خلیل من باشد. نشانه خلیل آن است که نقص (خلة) دوستش را تا حد امکان برطرف کند، و اگر نتوانست، در غم او شریک شود، چنانکه گفته شده است:\n\n> خلیل من کسی است که غم‌هایم را با من تقسیم کند *** و با کسی که به من دشمنی ورزد، دشمنی کند.\n\n(و دیگری گفت:)\n\n> من نیستم مگر برای کسی که مرا بخواهد *** خلیل خود را آن‌گونه می‌بینم که او مرا می‌بیند.\n\nخداوند متعال می‌فرماید: (يا أَيُّهَا الَّذِينَ آمَنُوا لا تَتَّخِذُوا عَدُوِّي وعَدُوَّكُمْ أَوْلِياءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ) «ای کسانی که ایمان آورده‌اید، دشمن من و دشمن خودتان را دوستان صمیمی (اولیاء) نگیرید که با آن‌ها اظهار دوستی می‌کنید.» و ما گفتیم که خلیل بر دین خلیل خود است. این کسانی که به عنوان دشمنان خدا توصیف شده‌اند، با وجود اینکه خداوند به آن‌ها احسان می‌کند، این به دلیل جهل آن‌ها نسبت به او و حجاب اسباب در برابر دیدگانشان است، پس جز آنچه را مشاهده کرده‌اند، نمی‌دانند. بنابراین، کسی که می‌خواهد این مقام را به دست آورد و خلیل رحمان باشد، باید میان این آیه (لا تَتَّخِذُوا عَدُوِّي وعَدُوَّكُمْ أَوْلِياءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ) و جهل دشمنان به حق، جمع کند؛ زیرا احسان از جانب او تعالی است و او با وجود دشمنی‌شان، به آن‌ها احسان می‌کند و در دل‌هایشان شعور به این احسان را قرار نداده است. پس بر انسانی که طالب مقام خُلّت (الخلة) است، سزاوار است که به طور عام به همه خلق خدا، کافر و مؤمن، مطیع و عاصی، احسان کند و در جهان، با قدرت خود، در مقام حق (الحق) نسبت به آن‌ها قیام کند؛ از جهت شمول رحمت و عموم لطف‌هایش، به گونه‌ای که آن‌ها را متوجه نسازد که این احسان از جانب اوست و احسان را از جایی که نمی‌دانند به آن‌ها برساند. پس هر کس با خلق به این شیوه رفتار کند، که شیوه‌ای آسان است، زیرا من وارد آن شده و آن را چشیده‌ام و آسان‌تر و لطیف‌تر از آن ندیده‌ام و لذتی بالاتر از لذت آن نیست، اگر بنده به این مرتبه باشد، خُلّت برای او صحیح می‌گردد. و اگر نتوانست در ظاهر (به دلیل نبود امکانات) احسان کند، در باطن به آن‌ها یاری رساند و در خلوت خود با پروردگارش، برای آن‌ها دعا کند. حال خلیل این‌گونه است؛ او سراسر رحمت است.\n\nو اگر رحمت الهی نبود، خداوند نمی‌فرمود: (وإِنْ جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَها) «و اگر به صلح تمایل نشان دادند، تو نیز به آن تمایل نشان ده.» و خداوند نمی‌فرمود: (حَتَّى يُعْطُوا الْجِزْيَةَ) «تا زمانی که جزیه را بپردازند.» آیا همه این‌ها برای باقی ماندن آن‌ها نیست؟ و اگر کلمه (تقدیر الهی) سبقت نگرفته بود و وقوع خلاف معلوم محال نبود، ذره‌ای در عالم درد نمی‌کشید. پس نفوذ کلمه (تقدیر) ضروری است، سپس سرانجام کار به رحمت بازمی‌گردد که (وَسِعَتْ كُلَّ شَيْ‏ءٍ) «همه چیز را فرا گرفته است.» پس او در دنیا با وجود کفر، روزی می‌دهد و عافیت می‌بخشد و رحم می‌کند؛ پس چگونه خواهد بود حال او در آخرت با ایمان و اعتراف، بر اساس کشف (الکشف)، همان‌گونه که در قبض ذریه بود؟ پس عقاب و عذاب آن‌ها، تطهیر و تنظیف است، مانند بیماری‌های مؤمنان و بلاهایی که در دنیا با وجود ایمانشان به آن‌ها می‌رسد و مصیبت‌هایی که بر آن‌ها فرود می‌آید. سپس ورود برخی از مرتکبان گناهان کبیره به آتش، با وجود ایمان و توحیدشان، تا زمانی که با شفاعت خارج شوند، و سپس خارج کردن حق (الحق) از آتش، کسانی را که هرگز کار خیری انجام نداده‌اند؛ حتی ساکنان جهنم نیز در آنجا حالی دارند که آن را شیرین می‌یابند و به همین دلیل عذاب، عذاب نامیده شده است. پس خلیل بر عادت خلیل خود است، و این همان فرموده رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) است که: «انسان بر دین خلیل خود است.»\n\nیعنی بر عادت خلیل خود. امرؤ القیس گفت:\n\n> مانند عادت تو با ام‌الحویرث پیش از او *** و همسایه‌اش ام‌الرباب در مأسل.\n\nمی‌گوید: «مانند عادت تو.» پس کسی که عادتش در برخورد با خلق خدا، همان عادتی باشد که خداوند به آن‌ها داده است؛ از لطف‌های نیکویش و نعمت‌های فراوانش که بر آن‌ها گسترده است و مهربان کردن برخی بر برخی دیگر؛ به گونه‌ای که در جهان، خشمی که رحمت در آن نباشد، یا دشمنی‌ای که دوستی در آن نفوذ نکند، ظاهر نشود، چنین کسی مستحق نام خُلّت (الخلة) است، به دلیل قیام به حق آن و استیفای شروطش. اگر از امید بزرگ به شمول رحمت، جز این قول خداوند نبود که: (الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏) «رحمان بر عرش استیلا یافت.» پس هنگامی که رحمت در عرش، که دربرگیرنده همه اجسام عالم است، مستقر شد، هر آنچه که با آن در تضاد باشد یا بخواهد آن را از اسماء و صفات بردارد، عوارضی است که در بقا اصلی ندارند، زیرا حکم از آنِ مستولی است و او رحمان است. پس (إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ) «همه امور به سوی او بازگردانده می‌شود.» پس صفات ابراهیم (علیه السلام) را جستجو کن و به آن‌ها قیام کن، باشد که خداوند برکت او را روزی تو گرداند، زیرا او به واسطه خُلّت به آن صفات قیام کرد، نه اینکه آن صفات خُلّت را برای او واجب کرده باشند. به همین دلیل، تو را به تخلق به اخلاق الهی راهنمایی کردیم. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «من مبعوث شدم تا مکارم اخلاق را کامل کنم.»\n\nو معنای این سخن آن است که چون اخلاق به مکارم (اخلاق نیکو) و سفساف (اخلاق پست) تقسیم شد و همه مکارم اخلاق در شرایع بر پیامبران و رسولان آشکار گشت و سفساف آن‌ها از مکارمشان نزد همگان مشخص شد، و در عالم، بنا بر آنچه دلیل بر آن اقامه می‌شود و کشف (الکشف) و معرفت (المعرفة) آن را می‌دهد، جز اخلاق خداوند نیست، پس همه آن‌ها مکارم هستند و اخلاق پستی (سفساف) وجود ندارد. پس رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) با کلمه جامع برای عموم مردم مبعوث شد و جوامع الکلم به او داده شد، در حالی که هر پیامبری پیش از او بر شریعت خاصی مبعوث شده بود. پس او (صَلَّى اللهُ عَليهِ وسَلَّم) خبر داد که مبعوث شد تا مکارم اخلاق را کامل کند، زیرا آن‌ها اخلاق خداوند هستند. پس حق (الحق) آن است که آنچه سفساف اخلاق نامیده می‌شد، به مکارم اخلاق تبدیل شد و همه آن‌ها مکارم اخلاق گشتند. پس برای کسی که مقصد شریعت را بشناسد، پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) هیچ اخلاق پستی را به طور کلی در جهان باقی نگذاشت. او مصارف و مجاری‌ای را برای این صفات که سفساف اخلاق نامیده می‌شوند، مانند حرص، حسد، شکم‌بارگی، بخل و ترس و هر صفت نکوهیده دیگری، برای ما بیان کرد. پس برای آن‌ها مصارفی به ما داد که اگر آن‌ها را بر آن مصارف جاری کنیم، به مکارم اخلاق بازمی‌گردند و نام نکوهیدگی از آن‌ها زائل می‌شود و ستوده می‌گردند. پس خداوند به واسطه او مکارم اخلاق را کامل کرد. پس برای او ضدی نیست، همان‌گونه که برای حق (الحق) ضدی نیست. و هر آنچه در کَون (الکون) است، اخلاق اوست و همه آن‌ها مکارم هستند، اما شناخته نمی‌شوند. و خداوند به اجتناب از آنچه باید اجتناب شود، امر نکرد مگر به دلیل اعتقاد مردم به اینکه آن‌ها سفساف اخلاق هستند، و به پیامبرش وحی کرد که مصارف آن‌ها را بیان کند تا مردم آگاه شوند. پس برخی از ما دانستند و برخی ندانستند. این است معنای سخن او که مبعوث شد تا مکارم اخلاق را کامل کند، و به واسطه او بود که خاتمیت تحقق یافت."
  },
  "page_count": 2
}