{
  "id": 244,
  "title": {
    "ar": "الباب الرابع والأربعون ومائتان في الغيبة",
    "en": "Chapter Two Hundred and Forty-Four, Concerning Absence (الغيبة)",
    "ur": "۲۴۴ واں باب غیبت (الغيبة) کے بیان میں",
    "fa": "باب دویست و چهل و چهارم در غیبت"
  },
  "content": {
    "ar": "## «الباب الرابع والأربعون ومائتان في الغيبة»\n\n\n> أغيب عنه ولي عين تشاهده *** في حضرة الغيب والغياب ما حضروا\n\n\n> ما في الوجود سواه في شهادته *** وغيبه فانظروا في الغيب وافتكروا\n\n\n> فتلك غيبة من هاتيك حالته *** فغيبة القلب حال ليس تعتبر\n\n\n> عمن تغيب وما في الكون من أحد *** سوى الوجود فلا عين ولا أثر\n\n\n### [أن الغيبة غيبة القلب عن علم ما يجري من أحوال الخلق لشغل القلب‏]\n\n\nاعلم أن الغيبة عند القوم غيبة القلب عن علم ما يجري من أحوال الخلق لشغل القلب بما يرد عليه وإذا كان هذا فلا تكون الغيبة إلا عن تجل إلهي ولا يصح أن تكون الغيبة على ما حدوه عن ورود مخلوق فإنه مشغول غائب عن أحوال الخلق وبهذا تميزت الطائفة عن غيرها فإن الغيبة موجودة الحكم في جميع الطوائف فغيبة هذه الطائفة تكون بحق عن خلق حتى تنسب إليه على جهة الشرف والمدح وأهل الله في الغيبة على طبقات وإن كانت كلها بحق فغيبة العارفين غيبة بحق عن حق وغيبة من دونهم من أهل الله غيبة بحق عن خلق وغيبة الأكابر من العلماء بالله غيبة بخلق عن خلق فإنهم قد علموا أن الوجود ليس إلا الله بصور أحكام الأعيان الثابتة الممكنات ولا يغيبه إلا صورة حكم عين في وجود حق فيغيب عن حكم صورة عين أخرى تعطي في وجود الحق ما لا تعطي هذه والأعيان وأحكامها خلق فما غاب إلا بخلق عن خلق في وجود حق فالعامة مصيبة لبعض هذه المسألة فإنها ينقصها منها في وجود حق وغيبتها إنما هي بخلق عن خلق مثل الكمل من رجال الله وما في الأعيان عين يكون حكمها مشاهدة للكل فلا تتصف بالغيبة ولما لم تكن ثم عين لها وصف الإحاطة بالحضور مع الكل وإن ذلك من خصائص الإله فلا بد من الغيبة في العالم والحضور وقد أومأنا إلى ما فيه كفاية في هذا الباب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Forty-Four Concerning Absence (الغيبة)\n\nI am absent from Him, yet I have an eye that witnesses Him\nIn the Presence of the Unseen (Ghayb), and the absent ones (Ghiyāb) are not present.\n\nThere is nothing in Existence (al-Wujūd) but Him in His witnessing\nAnd His Unseen. So look into the Unseen and reflect.\n\nThat is the absence (Ghayba) of one whose state is like that;\nThus, the absence of the heart is a state that is not considered.\n\nFrom whom do you become absent, when there is no one in the Cosmos\nExcept Existence (al-Wujūd)? So there is neither entity ('Ayn) nor trace.\n\n### [That Absence (al-Ghayba) is the absence of the heart from knowing the states of Creation (al-Khalaq) due to the heart's preoccupation]\n\nKnow that Absence (al-Ghayba), according to the People [the Sufis], is the absence of the heart from knowing the states of Creation (al-Khalaq) due to the heart’s preoccupation with what descends upon it [from the Divine]. If this is the case, then Absence cannot occur except through a Divine Theophany (Tajallī Ilāhī). It is not correct for Absence, as they have defined it, to be caused by the descent of a creature (makhlūq), for [the heart] is already preoccupied and absent from the states of Creation.\n\nBy this, this group [the Sufis] is distinguished from others, for the ruling of Absence exists among all groups. The Absence of this group is therefore by The Real (Haqq) from Creation (Khalaq), so that it is attributed to Him [The Real] as a matter of honor and praise.\n\nThe People of Allah (Ahl Allāh) are of various levels (Marātib) regarding Absence, even though all of it is by The Real. The Absence of the Gnostics (al-Ārifīn) is an absence by The Real from The Real. The Absence of those among the People of Allah who are below them is an absence by The Real from Creation. And the Absence of the greatest among the Scholars of Allah (al-Ulamā' bi-Allāh) is an absence by Creation from Creation.\n\nFor they have known that Existence (al-Wujūd) is nothing but Allah in the forms of the rulings of the Fixed Entities (al-A'yān al-Thābita), which are the possibles (al-Mumkināt). And nothing makes him absent except the form of the ruling of an entity ('Ayn) within the Existence of The Real (Wujūd Haqq). Thus, he becomes absent from the ruling of the form of another entity ('Ayn) which manifests in the Existence of The Real what this [first entity] does not manifest. Since the Entities and their rulings are Creation, he is absent only by Creation from Creation within the Existence of The Real.\n\nThe common people (al-'Āmma) grasp part of this matter, but what is missing for them is [the understanding] \"within the Existence of The Real.\" Their Absence is only by Creation from Creation, just like the Perfect Ones (al-Kummal) among the Men of Allah.\n\nThere is no entity ('Ayn) among the Entities whose ruling is the witnessing (Mushāhada) of the totality, such that it is not characterized by Absence. Since there is no entity that possesses the attribute of encompassing Presence (al-Hudūr) with the totality—for that is among the exclusive characteristics of the Deity (al-Ilāh)—Absence and Presence are necessary in the World (al-'Ālam).\n\nWe have alluded to what is sufficient in this chapter. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "## باب نمبر دو سو چوالیس: غیبت (الغيبة) کے بیان میں\n\nمیں اس سے غائب ہوتا ہوں جبکہ میری ایک آنکھ اس کا مشاہدہ (الشہود) کرتی ہے\nغیب کی حضوری (حضور) میں، اور غائب لوگ حاضر نہیں ہوئے۔\n\nاس کے شہود (شہود) اور اس کے غیب میں وجود (الوجود) میں اس کے سوا کچھ نہیں،\nپس غیب میں دیکھو اور غور کرو۔\n\nپس یہ اس شخص کی غیبت ہے جس کا یہ حال ہے،\nجبکہ قلب کی غیبت ایک ایسا حال ہے جو قابلِ اعتبار نہیں۔\n\nتم کس سے غائب ہوتے ہو؟ جبکہ کون و مکان میں وجود (الوجود) کے سوا کوئی نہیں،\nپس نہ کوئی عین (ذات) ہے اور نہ کوئی اثر۔\n\n### [غیبت یہ ہے کہ قلب مخلوق کے احوال سے بے خبر ہو جائے کیونکہ قلب مشغول ہو جاتا ہے]\n\nجان لو کہ اہل تصوف کے نزدیک غیبت (الغيبة) قلب کا مخلوق کے احوال سے بے علم ہو جانا ہے، کیونکہ قلب اس چیز میں مشغول ہو جاتا ہے جو اس پر وارد ہوتی ہے۔ اور جب یہ حال ہو تو غیبت صرف ظہور الٰہی (التجلی) کے سبب ہی ہو سکتی ہے، اور یہ درست نہیں کہ غیبت، جیسا کہ انہوں نے تعریف کی ہے، کسی مخلوق کے وارد ہونے سے ہو، کیونکہ وہ (سالک) مخلوق کے احوال سے مشغول اور غائب ہے۔\n\nاور اسی سے یہ جماعت (صوفیاء) دوسروں سے ممتاز ہوئی، کیونکہ غیبت کا حکم تمام جماعتوں میں پایا جاتا ہے۔ پس اس جماعت کی غیبت حق (الحق) کے ذریعے خلق سے ہوتی ہے، یہاں تک کہ یہ (غیبت) شرف اور مدح کے طور پر اس (حق) کی طرف منسوب کی جاتی ہے۔\n\nاور اہل اللہ غیبت میں مختلف طبقات پر ہیں، اگرچہ وہ سب حق (الحق) کے ذریعے ہی ہوتی ہیں۔ پس عارفین کی غیبت حق (الحق) کے ذریعے حق (الحق) سے غیبت ہے، اور ان سے کم درجے کے اہل اللہ کی غیبت حق (الحق) کے ذریعے خلق سے غیبت ہے۔ اور اللہ کے بارے میں بڑے علماء (کاملین) کی غیبت خلق کے ذریعے خلق سے غیبت ہے۔\n\nکیونکہ وہ جان چکے ہیں کہ وجود (الوجود) ممکنات کی ثابت اعیان (ذوات) کے احکام کی صورتوں میں اللہ کے سوا کچھ نہیں۔ اور اسے غائب نہیں کرتی مگر کسی عین (ذات) کے حکم کی صورت حق (الحق) کے وجود (الوجود) میں، پس وہ کسی دوسری عین (ذات) کے حکم کی صورت سے غائب ہو جاتا ہے جو حق (الحق) کے وجود (الوجود) میں وہ چیز دیتی ہے جو یہ (پہلی عین) نہیں دیتی۔ اور اعیان (ذوات) اور ان کے احکام خلق ہیں، پس وہ حق (الحق) کے وجود (الوجود) میں خلق کے ذریعے خلق سے ہی غائب ہوا۔\n\nپس عام لوگ اس مسئلے کے کچھ حصے کو درست پاتے ہیں، کیونکہ ان میں حق (الحق) کے وجود (الوجود) میں کمی ہوتی ہے، اور ان کی غیبت بھی خلق کے ذریعے خلق سے ہی ہوتی ہے، جیسے اللہ کے کامل مردوں (رجال اللہ) کی۔ اور اعیان (ذوات) میں کوئی ایسی عین (ذات) نہیں جس کا حکم سب کے لیے مشاہدہ (الشہود) ہو، پس وہ غیبت (الغيبة) سے متصف نہیں ہو سکتی۔ اور جب کوئی ایسی عین (ذات) نہیں جو سب کے ساتھ احاطہ کرنے والی حضوری (حضور) کی صفت رکھتی ہو، اور یہ (احاطہ) الٰہ کی خصوصیات میں سے ہے، تو عالم میں غیبت (الغيبة) اور حضوری (حضور) کا ہونا ضروری ہے۔\n\nاور ہم نے اس باب میں کافی اشارہ کر دیا ہے۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راہ دکھاتا ہے۔ (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)",
    "fa": "باب دویست و چهل و چهارم در غیبت (الغیبة)\n\nاز او غایبم، در حالی که چشمی دارم که او را شهود می‌کند\nدر حضرت غیب، و غایبان حاضر نیستند.\n\nدر هستی (الوجود) جز او نیست، نه در شهودش (شهود) و نه در غیبتش\nپس در غیب بنگرید و تفکر کنید.\n\nپس آن غیبت کسی است که حالش چنین است\nو غیبت قلب (القلب) حالی است که به حساب نمی‌آید.\n\nاز چه کسی غایب می‌شوی، در حالی که در کائنات هیچ کس نیست\nجز هستی (الوجود)، نه عین و نه اثری.\n\n[اینکه غیبت، غیبت قلب (القلب) است از آگاهی به آنچه از احوال خلق می‌گذرد به دلیل مشغولیت قلب]\n\nبدان که غیبت (الغیبة) نزد این طایفه، غیبت قلب (القلب) است از آگاهی به آنچه از احوال خلق (الخلق) می‌گذرد، به دلیل مشغول شدن قلب به آنچه بر آن وارد می‌شود. و چون چنین است، غیبت جز از تجلی الهی (التجلی) نخواهد بود. و صحیح نیست که غیبت، آن‌گونه که تعریف کرده‌اند، از ورود مخلوقی باشد؛ زیرا او (سالک) مشغول و غایب از احوال خلق است. و به این سبب، این طایفه از دیگران متمایز شده است؛ زیرا حکم غیبت در همه طوایف وجود دارد. پس غیبت این طایفه به حق (الحق) از خلق (الخلق) است، تا آنجا که به جهت شرافت و مدح به او نسبت داده می‌شود.\n\nو اهل الله در غیبت (الغیبة) بر طبقاتی هستند، اگرچه همه آنها به حق (الحق) است. پس غیبت عارفان، غیبت به حق (الحق) از حق (الحق) است، و غیبت کسانی که پایین‌تر از ایشان از اهل الله هستند، غیبت به حق (الحق) از خلق (الخلق) است. و غیبت بزرگان از عالمان بالله، غیبت به خلق (الخلق) از خلق (الخلق) است؛ زیرا آنان دانسته‌اند که هستی (الوجود) جز خداوند نیست، در صور احکام اعیان ثابته (الأعيان الثابتة) ممکنات. و او را غایب نمی‌کند مگر صورت حکم یک عین در هستی (الوجود) حق (الحق)؛ پس از حکم صورت عین دیگری غایب می‌شود که در هستی حق (الحق) چیزی را می‌دهد که این (عین) نمی‌دهد. و اعیان و احکام آنها خلق (الخلق) هستند؛ پس غایب نشد مگر به خلق (الخلق) از خلق (الخلق) در هستی حق (الحق).\n\nپس عامه مردم به بخشی از این مسئله دست یافته‌اند، اما در آن، «در هستی حق (الحق)» از ایشان کم است؛ و غیبت آنها تنها به خلق (الخلق) از خلق (الخلق) است، مانند کاملان از رجال الله. و در میان اعیان، هیچ عینی نیست که حکمش مشاهده برای همه باشد و به غیبت (الغیبة) متصف نشود. و چون در آنجا عینی وجود ندارد که وصف احاطه به حضور با همه را داشته باشد، و این از خصائص اله است، پس ناگزیر در عالم، غیبت (الغیبة) و حضور وجود دارد. و ما به آنچه در این باب کفایت می‌کند اشاره کردیم. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 1
}