{
  "id": 77,
  "title": {
    "ar": "الباب السابع والسبعون في ترك المجاهدة",
    "en": "Chapter Seventy-Seven: On Abandoning the Spiritual Struggle (المجاهدة)",
    "ur": "ساتہترواں باب مجاہدہ (المجاهدة) کو ترک کرنے کے بیان میں",
    "fa": "باب هفتاد و هفتم در ترک مجاهده"
  },
  "content": {
    "ar": "## (الباب السابع والسبعون في ترك المجاهدة)\n\n\n> لا تجاهد فإن عين المنازع *** هو عين الذي تجاهد فيه‏\n> وإذا كان واحدا من تناوي *** أي عقل يرضاه أو يصطفيه‏\n\n\n> هل لعين الشريك عين وجود *** فتراه بالعلم أو تنفيه‏\n\n\n> كيف ينفي من كان في الأصل نفيا *** وهو نفي والنفي يستوفيه‏\n\n\n### [ترك الجهاد لاقتضاء الموطن‏]\n\n\nلما اطلع المجاهد فيه وفي سبيله وفي الله وفي سبيل الله على السبل التي هداه الله إليها فبانت عنده فرأى أنه ما جاهد غير الله فاستحيا لأجل هذا المشهد فترك الجهاد لاقتضاء الموطن وهو المجاهد تعالى وما هو ممن يتصف بالمشقة فإنه يقول فيما هو أعظم من هذا وما مسنا من لغوب وقال وهُوَ الَّذِي يَبْدَؤُا الْخَلْقَ ثُمَّ يُعِيدُهُ وهُوَ أَهْوَنُ عَلَيْهِ وليس هذا الهين عن صعوبة في الابتداء ولهذا القول بالمفهوم ضعيف في الدلالة لأنه لا يكون حقا في كل موضع ونسب ذلك إلى الله كما شاهده كما ترك رسول الله صلى الله عليه وسلم تعظيم عزة الله إذا اتصف بها أحد من عباد الله مثل قوله عَبَسَ وتَوَلَّى أَنْ جاءَهُ الْأَعْمى‏\n\n\n### [بعث الرسول بدعوة عامة وإظهار الآيات‏]\n\n\nفإنه صلى الله عليه وسلم كان يحب الفال الحسن‏\n\n\nوبعثه بدعوة الحق وإظهار الآيات إنما يظهرها لمن يتصف بأنه يرى فلما جاءه الأعمى قام له حقيقة من بعث إليهم وهم أهل الأبصار فأعرض وتولى لأنه ما بعث لمثل هذا فهذا كان نظره صلى الله عليه وسلم وما عتبة سبحانه فيما علمه وإنما عتبة جبر القلب ابن أم مكتوم وأمثاله لأنهم غائبون عن الذي يشهده صلى الله عليه وسلم وأمره أن يحبس نفسه معهم فقال له واصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَداةِ والْعَشِيِّ يُرِيدُونَ وَجْهَهُ‏\n\n\n### [لسان الحقيقة في فعل الرسول‏]\n\n\nوكان خباب بن الأرت وبلال وغيرهم من الأعبد والفقراء لما تكبر كبراء قريش وأهل الجاهلية عن أن يجمعهم عند رسول الله صلى الله عليه وسلم مجلس واحد وأجابهم إلى ذلك رسول الله صلى الله عليه وسلم فيقول لسان الظاهر إن النبي صلى الله عليه وسلم كان يفعل لهم ذلك ليتألفهم على الإسلام لأن واحدا منهم كان إذا أسلم أسلم لإسلامه بشر كثير لكونه مطاعا في قومه ويترجم عن هذا المقام لسان الحقيقة أن النبي صلى الله عليه وسلم لم يشاهد سوى الحق فأينما بري الصفة التي لا تنبغي إلا لله عظمها ولم يشاهد معها سواها وقام لها ووفاها حقها مثل العزة والكبرياء والغني فقال له ربه أَمَّا من اسْتَغْنى‏ فنبهه ببنية الاستغفال فَأَنْتَ لَهُ تَصَدَّى وقد علم أنه لمن تصدى محمد صلى الله عليه وسلم يقول له وإن كنت تعظم صفتي حيث تراها لغلبة شهودك إياي فقد أمرتك أن لا تشاهدها مقيدة في المحدثين وهوقوله عليه السلام إن الله أدبني فأحسن أدبي‏\n\n\nوهذا من ذلك التأديب‏\n\n\n### [ترحيب النبي بمن عاتبه ربه فيهم‏]\n\n\nوكان رسول الله صلى الله عليه وسلم إذا رأى هؤلاء تلك الأعبد يقول مرحبا بمن عاتبني فيهم ربي فكلما جلسوا عنده جلس لجلوسهم لا يمكن لهم أن يقوم ولا ينصرف حتى يكونوا هم الذين ينصرفون‏\n\n\nفإن الله قال له واصْبِرْ نَفْسَكَ ولما علموا ذلك منه وأنه عليه السلام قد تعرض له أمور يحتاج إلى التصرف فيها فكانوا يخففون فلا يلبثون عنده إلا قليلا وينصرفون حتى ينصرف النبي صلى الله عليه وسلم لأشغاله‏\n\n\nفترك صلى الله عليه وسلم ذلك الأمر الذي كان له فيه مشهد صحيح إلهي مراعاة لحفظ القلوب المنكسرة\n\n\n### [الله عند المنكسرة قلوبهم غيبا وعند المتكبرين عينا]\n\n\nفإن الله عند المنكسرة قلوبهم غيبا يثبته الايمان وينفيه العيان وهو عند المتكبرين عينا يثبته العيان وينفيه الايمان فنقل الله نبيه صلى الله عليه وسلم من العيان إلى الايمان وأخبره أن تجليه تعالى في أعيان الأعزاء المتكبرين من زينة الحياة الدنيا فهي زينة الله للحياة الدنيا لا لنا والذي لنا زينة الله من غير تقييد بالحياة الدنيا وما يلزم من كونه زينا لزيد أن يكون زينا لعمرو\n\n\n### [الزينة ومشاهد الناس لها]\n\n\nفمن الناس من لا شهود له إلا زينة الله ومن الناس من لا شهود له إلا زينة الحياة الدنيا من حيث ما هي زينة الله لها لا لنا فيشهدها لها وإن لم تكن لنا زينة ومن الناس من يشهد زينة الشيطان في عمله وأعمال الخلق في قوله وزَيَّنَ لَهُمُ الشَّيْطانُ أَعْمالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ وكانُوا مُسْتَبْصِرِينَ فهم الذين أضلهم الله على علم فيشهدها أهل الله زينة الله للشيطان لأنه عمله ومن الناس من يشهد من زين له عمله ولا يدري من زينه هل متعلق تلك الزينة الذم أو الحمد وهو موضع الشبهة كمن يرى رجلا يحب أن يكون نعله حسنا وثوبه حسنا فلا يدري أ هو ممن يحب زينة الحياة الدنيا أو هو ممن يتجمل لله في قوله خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ\n\n\n### [حسن الظن أنت مندوب إليه وسوء الظن أنت منهى عنه‏]\n\n\nوقد قال عليه السلام للرجل الذي قال له إني أحب أن يكون نعلي حسنا وثوبي حسنا إن الله جميل يحب الجمال‏\n\n\nفوقع لهذا الرجل الاشتباه فلا يدري لمن ينسب تلك الزينة كمن يسمع شخصا يقول الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ فلا يدري هل هو تال أو هو ذاكر من غير قصد تلاوة القرآن لأن‏\nاللفظ واحد وهو المشهود والقصد غيب والأولى أن تحسن الظن بمن يتجمل فإنك مندوب إليه وسوء الظن أنت مأمور باجتنابه في حق المسلمين ولهذا\n\n\nفسر النبي صلى الله عليه وسلم كلامه للرجلين في اعتكافه حين انقلب يشيع صفية إني خشيت أن يقذف الشيطان‏\n\n\nفما أساء الظن إلا بأهله وهو الشيطان فينبغي لك إذا سمعت من يقول كلمة هي في القرآن كما قلنا فيمن سمع من يقول الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ أن تسمعها تلاوة قرآنية وإن لم يقصدها قائلها فإنك تؤجر أجر من سمع القرآن ولا بد وهذا مشهد عزيز قل أن ترى له ذائقا وهو قريب سهل لا كلفة فيه‏\n\n\n### [من زين له سوء عمله‏]\n\n\nوأما قوله أَ فَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ فمن قوله سُوءُ عَمَلِهِ عرفت من زينه وإن لم يذكره ومع هذا فالاحتمال لا يرتفع عنه فإن الله يقول في مثل هذا زَيَّنَّا لَهُمْ أَعْمالَهُمْ فَهُمْ يَعْمَهُونَ فجاء بنون الكناية عن نفسه ونسب الحيرة إليهم بهذا التزيين فمثل هذا إذا لم يبين الله له في كشفه لمن هو هذا التزيين يقبله على مراد الله فيه من غير تعيين فيكون جزاؤه على الله من غير تعيين عندنا وإن كان معينا عند الله فإنه عند الله أيضا لا معين فإنا لم نعينه فهو يعلمه معينا لا معينا بنسبتين مختلفتين فافهم ذلك انتهى الجزء الثاني والتسعون‏\n\n\n(بسم الله الرحمن الرحيم)\n\n",
    "en": "Chapter Seventy-Seven: Concerning the Abandonment of Spiritual Struggle (ترك المجاهدة)\n\nDo not strive (تجاهد), for the very essence (عين) of the contender\nIs the very essence of that in which you strive.\nAnd if He is One, whom do you contend with?\nWhat intellect would approve of this or choose it?\n\nDoes the essence of a partner (الشريك) possess the essence of Being (وجود)?\nSo that you might perceive it through Knowledge (العلم) or negate it?\n\nHow can one negate that which was originally a negation?\nWhile it is negation, and negation fulfills it.\n\n### [Abandoning the Striving due to the Requirement of the Station (الموطن)]\n\nWhen the one who strives (المجاهد) in Him, and in His path, and in Allah, and in the path of Allah, gains insight into the paths to which Allah has guided him, and they become manifest to him, he sees that he has striven against none other than Allah. He felt shame because of this Witnessing (المشهد), and thus abandoned the striving (الجهاد) due to the requirement of the Station, which is the Striver Himself, exalted is He. And He is not one who is characterized by hardship, for He says concerning what is greater than this: <<وَمَا مَسَّنَا مِنْ لُغُوبٍ>> (And no weariness touched Us). And He said: <<وَهُوَ الَّذِي يَبْدَؤُا الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ>> (And He is the One who originates the creation, then reproduces it, and it is easier for Him). This ease (الهين) does not stem from difficulty in the beginning. Therefore, the implication (المفهوم) of this statement is weak in its indication, because it is not true in every instance. This was attributed to Allah as the seeker witnessed it, just as the Messenger of Allah (peace and blessings be upon him) abandoned the magnification of Allah’s Might (عزة الله) when one of Allah’s servants was characterized by it, such as in His saying: <<عَبَسَ وَتَوَلَّى أَنْ جَاءَهُ الْأَعْمَى>> (He frowned and turned away / Because the blind man came to him).\n\n### [The Sending of the Messenger with a General Call and the Manifestation of Signs]\n\nThe Prophet (peace and blessings be upon him) loved good omens (الفال الحسن). His sending with the call of the Real (الحق) and the manifestation of the Signs (الآيات) is only to manifest them to those characterized by sight. When the blind man came to him, the reality of those to whom he was sent—namely, the people of sight—stood before him. So he turned away and frowned, because he was not sent for such a situation. This was the Prophet’s perspective (نظره). His Lord, exalted is He, did not censure him for what he knew; rather, He censured him for the sake of mending the heart of Ibn Umm Maktum and those like him, because they were absent from what the Prophet (peace and blessings be upon him) was witnessing (يشهده). He commanded him to restrain himself with them, saying to him: <<وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ>> (And restrain yourself with those who call upon their Lord morning and evening, desiring His Face).\n\n### [The Tongue of Reality (لسان الحقيقة) concerning the Messenger’s Action]\n\nKhabbab ibn al-Aratt, Bilal, and others among the slaves and the poor were present when the elders of Quraysh and the people of Ignorance (الجاهلية) were too arrogant to share a single gathering with the Messenger of Allah (peace and blessings be upon him). The Messenger of Allah (peace and blessings be upon him) agreed to their request. The tongue of the apparent (لسان الظاهر) says that the Prophet (peace and blessings be upon him) did this for them to reconcile their hearts to Islam, because if one of them embraced Islam, many people would follow him due to his authority among his tribe. However, the tongue of Reality (لسان الحقيقة) interprets this station (المقام) by saying that the Prophet (peace and blessings be upon him) witnessed nothing but the Real (الحق). Wherever he saw an Attribute (الصفة) that belongs only to Allah, he magnified it, witnessing nothing else alongside it. He stood for it and fulfilled its due right, such as Might (العزة), Grandeur (الكبرياء), and Self-Sufficiency (الغني). So his Lord said to him: <<أَمَّا مَنِ اسْتَغْنَى * فَأَنْتَ لَهُ تَصَدَّى>> (As for him who considers himself self-sufficient / To him you attend). He alerted him through the structure of the word *istighfal* (self-sufficiency). Even though Muhammad (peace and blessings be upon him) was magnifying His Attribute wherever he saw it, due to the overwhelming nature of his Witnessing (شهود) of Him, He said to him: \"I have commanded you not to witness it as restricted within created beings (المحدثين).\" This is related to his saying (peace and blessings be upon him): \"Indeed, Allah disciplined me, and He perfected my discipline.\" This incident is part of that discipline.\n\n### [The Prophet’s Welcome to Those for Whom His Lord Censured Him]\n\nWhenever the Messenger of Allah (peace and blessings be upon him) saw those slaves, he would say: \"Welcome to those for whom my Lord censured me.\" Whenever they sat with him, he would sit for their sitting, making it impossible for them to stand or leave until they were the ones who departed. This is because Allah had said to him: <<وَاصْبِرْ نَفْسَكَ>> (And restrain yourself). When they realized this about him, and that he (peace and blessings be upon him) had matters requiring his attention and action, they would lighten the burden, staying with him only briefly before departing, so that the Prophet (peace and blessings be upon him) could attend to his affairs. Thus, he (peace and blessings be upon him) abandoned that matter—in which he had a sound Divine Witnessing (مشهد صحيح إلهي)—out of consideration for protecting broken hearts (القلوب المنكسرة).\n\n### [Allah is Hidden (غيبا) with the Broken-Hearted and Manifest (عينا) with the Arrogant]\n\nIndeed, Allah is Hidden (غيبا) with the broken-hearted, affirmed by Faith (الايمان) and negated by Direct Perception (العيان). And He is Manifest (عينا) with the arrogant, affirmed by Direct Perception and negated by Faith. Allah thus transferred His Prophet (peace and blessings be upon him) from Direct Perception to Faith, informing him that His Theophany (تجليه), exalted is He, in the essences (أعيان) of the mighty and the arrogant among the adornments of the worldly life (زينة الحياة الدنيا), is Allah’s adornment *for* the worldly life, not *for* us. That which is for us is Allah’s adornment without restriction to the worldly life. And the fact that something is an adornment for Zayd does not necessitate that it is an adornment for Amr.\n\n### [Adornment (الزينة) and People’s Witnessing (مشاهد) of It]\n\nAmong people are those whose Witnessing (شهود) is only of Allah’s adornment. And among people are those whose Witnessing is only of the adornment of the worldly life, in that it is Allah’s adornment *for* it, not *for* us. They witness it as being for the worldly life, even if it is not an adornment for us. And among people are those who witness the adornment of Satan in his work and the works of creation, as in His saying: <<وَزَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ وَكَانُوا مُسْتَبْصِرِينَ>> (And Satan made their deeds pleasing to them and averted them from the path, while they were insightful). These are the ones whom Allah led astray despite their knowledge. The People of Allah (أهل الله) witness this as Allah’s adornment *for* Satan, because it is his work. And among people are those who witness the one who made his deed pleasing to him, but they do not know who adorned it—whether that adornment relates to blame or praise. This is the point of ambiguity (الشبهة), like one who sees a man who likes his sandals to be beautiful and his garment to be beautiful, and one does not know whether he is one who loves the adornment of the worldly life or one who beautifies himself for Allah, as in His saying: <<خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ>> (Take your adornment at every place of prostration).\n\n### [Good Opinion (حسن الظن) is Recommended for You, and Bad Opinion (سوء الظن) is Forbidden for You]\n\nThe Prophet (peace and blessings be upon him) said to the man who told him, \"I love my sandals to be beautiful and my garment to be beautiful,\" that \"Indeed, Allah is Beautiful and loves beauty.\" This man experienced ambiguity (الاشتباه), not knowing to whom to attribute that adornment. This is like someone who hears a person saying: <<الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ>> (Praise be to Allah, Lord of the Worlds), and does not know whether he is reciting (تال) or merely remembering (ذاكر) without intending to recite the Quran, because the wording is the same—that is the object of Witnessing (المشهود)—while the intention (القصد) is hidden (غيب). It is better for you to have a good opinion (حسن الظن) of the one who beautifies himself, for you are recommended to do so, and you are commanded to avoid bad opinion (سوء الظن) concerning Muslims. For this reason, the Prophet (peace and blessings be upon him) explained his conversation to the two men during his spiritual retreat (اعتكافه) when he returned accompanying Safiyya, saying: \"I feared that Satan might cast [evil thoughts].\" He only had a bad opinion of those who deserved it, namely Satan. Therefore, if you hear someone utter a word that is in the Quran, as we said regarding the one who hears someone say <<الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ>>, you should hear it as a Quranic recitation, even if the speaker did not intend it. You will inevitably be rewarded with the reward of one who heard the Quran. This is a precious Witnessing (مشهد عزيز) that few taste, yet it is close and easy, without difficulty.\n\n### [He Whose Evil Deed Was Made Pleasing to Him]\n\nAs for His saying: <<أَفَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ>> (Is he whose evil deed was made pleasing to him...), from His saying \"his evil deed,\" you know who adorned it, even if He did not mention the adorner. Nevertheless, the possibility of ambiguity (الاحتمال) is not removed from it, for Allah says in a similar context: <<زَيَّنَّا لَهُمْ أَعْمَالَهُمْ فَهُمْ يَعْمَهُونَ>> (We made their deeds pleasing to them, so they wander blindly). Here, He used the plural pronoun referring to Himself and attributed the bewilderment (الحيرة) to them through this adornment. When Allah does not clarify in one’s Unveiling (كشف) who the adorner is, one accepts it according to Allah’s intent concerning it, without specific designation (تعيين). Thus, his recompense is with Allah without specific designation *for us*, even if it is designated *with Allah*. Yet, even with Allah, it is also non-designated (لا معين), for we did not designate it. Thus, He knows it as designated and non-designated through two different relations. Understand that.\n\nEnd of the Ninety-Second Section. (In the Name of Allah, the Most Compassionate, the Most Merciful)",
    "ur": "(باب ستترواں: مجاہدہ (روحانی کوشش) ترک کرنے کے بیان میں)\n\n> مجاہدہ نہ کر، کیونکہ جھگڑنے والے کی عین (حقیقت)\n> وہی ہے جس کے بارے میں تو مجاہدہ کر رہا ہے۔\n> اور جب وہ ایک ہی ہے تو تو کس سے جھگڑتا ہے؟\n> کون سی عقل اسے پسند کرے گی یا چن لے گی؟\n> کیا شریک کی عین (حقیقت) کا کوئی وجود ہے؟\n> کہ تو اسے علم سے دیکھے یا اس کی نفی کرے؟\n> جو اصل میں نفی تھا، اس کی نفی کیسے کی جائے؟\n> جبکہ وہ خود نفی ہے اور نفی ہی اسے پورا کرتی ہے۔\n\n### [مقام کے تقاضے کے تحت جہاد ترک کرنا]\n\nجب مجاہد (سالک) نے اس ذات میں، اس کی راہ میں، اللہ میں، اور اللہ کی راہ میں ان راستوں پر اطلاع پائی جن کی طرف اللہ نے اسے ہدایت دی تھی، تو یہ راستے اس کے سامنے واضح ہو گئے اور اس نے دیکھا کہ اس نے ذات حق (الحق) کے سوا کسی اور سے مجاہدہ نہیں کیا۔ اس مشاہدے (الشہود) کی وجہ سے اسے شرم محسوس ہوئی اور اس نے مقام (الموطن) کے تقاضے کے تحت جہاد ترک کر دیا، اور وہ مجاہد (ذات حق) بلند ہے، اور وہ ان میں سے نہیں جو مشقت سے متصف ہوں، کیونکہ وہ اس سے بھی بڑے معاملے میں فرماتا ہے: \"اور ہمیں کوئی تھکاوٹ نہیں پہنچی\" (وَمَا مَسَّنَا مِنْ لُغُوبٍ)۔ اور فرمایا: \"اور وہی ہے جو مخلوق کو پہلی بار پیدا کرتا ہے، پھر اسے دوبارہ پیدا کرے گا، اور یہ اس پر زیادہ آسان ہے\" (وَهُوَ الَّذِي يَبْدَؤُا الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ)۔ اور یہ آسانی ابتداء میں کسی مشکل کی وجہ سے نہیں ہے، اور اسی لیے اس قول کا مفہوم دلالت میں کمزور ہے، کیونکہ یہ ہر جگہ حق نہیں ہو سکتا۔ اور اس نے یہ بات اللہ کی طرف منسوب کی جیسا کہ اس نے مشاہدہ کیا، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے اللہ کی عزت (العزة) کی تعظیم کو ترک کر دیا جب اللہ کے بندوں میں سے کوئی اس صفت سے متصف ہوا، جیسے کہ اس کا یہ قول: \"اس نے تیوری چڑھائی اور منہ موڑ لیا، اس لیے کہ اس کے پاس نابینا آیا\" (عَبَسَ وَتَوَلَّى أَنْ جَاءَهُ الْأَعْمَى)۔\n\n### [رسول کا عام دعوت اور آیات کا اظہار]\n\nبے شک آپ صلی اللہ علیہ وسلم نیک فال کو پسند فرماتے تھے۔ اور آپ کا حق کی دعوت کے ساتھ مبعوث ہونا اور آیات کا ظاہر کرنا، آپ انہیں صرف اس کے لیے ظاہر کرتے ہیں جو دیکھنے کی صفت سے متصف ہو۔ پس جب آپ کے پاس نابینا آیا تو آپ نے حقیقت میں ان لوگوں کے لیے قیام کیا جن کی طرف آپ مبعوث کیے گئے تھے، اور وہ اہل بصارت تھے۔ پس آپ نے منہ موڑا اور اعراض کیا، کیونکہ آپ اس طرح کے لوگوں کے لیے مبعوث نہیں ہوئے تھے۔ یہ آپ صلی اللہ علیہ وسلم کا نظریہ تھا، اور اللہ سبحانہ و تعالیٰ نے اس چیز پر آپ کو عتاب نہیں کیا جو آپ جانتے تھے، بلکہ آپ کو ابن ام مکتوم اور ان جیسے لوگوں کے دلوں کو جوڑنے پر عتاب کیا، کیونکہ وہ اس چیز سے غائب تھے جس کا آپ صلی اللہ علیہ وسلم مشاہدہ (الشہود) فرما رہے تھے۔ اور آپ کو حکم دیا کہ آپ اپنے آپ کو ان کے ساتھ روکے رکھیں، پس آپ سے فرمایا: \"اور اپنے آپ کو ان لوگوں کے ساتھ روکے رکھو جو صبح و شام اپنے رب کو پکارتے ہیں، اس کی ذات چاہتے ہیں\" (وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ)۔\n\n### [رسول کے فعل میں حقیقت کی زبان]\n\nاور جب قریش کے سرداروں اور اہل جاہلیت نے اس بات پر تکبر کیا کہ خباب بن ارت، بلال اور دیگر غلاموں اور فقراء کے ساتھ ایک ہی مجلس میں رسول اللہ صلی اللہ علیہ وسلم کے پاس جمع ہوں، اور رسول اللہ صلی اللہ علیہ وسلم نے ان کی بات مان لی، تو ظاہر کی زبان کہتی ہے کہ نبی صلی اللہ علیہ وسلم نے ان کے لیے ایسا اس لیے کیا تاکہ انہیں اسلام پر مائل کریں، کیونکہ ان میں سے کوئی بھی جب اسلام قبول کرتا تو اس کے اسلام لانے کی وجہ سے بہت سے لوگ اسلام قبول کر لیتے، کیونکہ وہ اپنی قوم میں مانا جاتا تھا۔ اور اس مقام کی ترجمانی حقیقت کی زبان (لسان الحقیقۃ) یوں کرتی ہے کہ نبی صلی اللہ علیہ وسلم نے ذات حق (الحق) کے سوا کسی کا مشاہدہ (الشہود) نہیں کیا، پس جہاں بھی آپ نے وہ صفت دیکھی جو صرف اللہ کے لیے مناسب ہے، آپ نے اس کی تعظیم کی اور اس کے ساتھ کسی اور کا مشاہدہ نہیں کیا، اور اس کے لیے کھڑے ہوئے اور اس کا حق پورا کیا، جیسے کہ عزت (العزة)، کبریائی (الکبریاء) اور بے نیازی (الغنی)۔ پس آپ کے رب نے آپ سے فرمایا: \"لیکن جو بے نیاز ہوا\" (أَمَّا مَنِ اسْتَغْنَىٰ)۔ پس آپ کو بے نیازی کی صفت کی بنا پر متنبہ کیا: \"تو آپ اس کی طرف متوجہ ہوتے ہیں\" (فَأَنْتَ لَهُ تَصَدَّىٰ)۔ اور اللہ جانتا تھا کہ محمد صلی اللہ علیہ وسلم کس کی طرف متوجہ ہوئے تھے۔ اللہ آپ سے فرماتا ہے: اگرچہ تم میری صفت کی تعظیم کرتے ہو جہاں تم اسے میرے غلبہ شہود (الشہود) کی وجہ سے دیکھتے ہو، لیکن میں نے تمہیں حکم دیا ہے کہ تم اسے مخلوق میں مقید نہ دیکھو۔ اور یہی آپ صلی اللہ علیہ وسلم کا قول ہے: \"بے شک میرے رب نے مجھے ادب سکھایا اور میرے ادب کو بہترین بنایا۔\" اور یہ اسی ادب سکھانے میں سے ہے۔\n\n### [نبی کا ان لوگوں کو خوش آمدید کہنا جن کے بارے میں رب نے عتاب کیا]\n\nاور رسول اللہ صلی اللہ علیہ وسلم جب ان غلاموں کو دیکھتے تو فرماتے: \"خوش آمدید ان لوگوں کو جن کے بارے میں میرے رب نے مجھ پر عتاب کیا ہے۔\" پس جب بھی وہ آپ کے پاس بیٹھتے، آپ ان کے بیٹھنے کی وجہ سے بیٹھے رہتے، اور ان کے لیے ممکن نہ ہوتا کہ وہ کھڑے ہوں یا چلے جائیں جب تک کہ وہ خود نہ چلے جاتے۔ کیونکہ اللہ نے آپ سے فرمایا تھا: \"اور اپنے آپ کو روکے رکھو\" (وَاصْبِرْ نَفْسَكَ)۔ اور جب انہوں نے آپ سے یہ بات جان لی، اور یہ بھی کہ آپ صلی اللہ علیہ وسلم کو ایسے امور پیش آتے ہیں جن میں تصرف کی ضرورت ہوتی ہے، تو وہ تخفیف کرتے اور آپ کے پاس تھوڑی دیر ہی ٹھہرتے اور چلے جاتے تاکہ نبی صلی اللہ علیہ وسلم اپنے کاموں کے لیے فارغ ہو سکیں۔ پس آپ صلی اللہ علیہ وسلم نے اس امر کو ترک کر دیا جس میں آپ کے لیے ایک صحیح الٰہی مشاہدہ (الشہود) تھا، تاکہ ٹوٹے ہوئے دلوں کی حفاظت کا خیال رکھا جائے۔\n\n### [اللہ ٹوٹے دل والوں کے پاس غیب کے طور پر اور متکبروں کے پاس عین کے طور پر]\n\nکیونکہ اللہ ٹوٹے ہوئے دل والوں کے پاس غیب کے طور پر ہوتا ہے، جسے ایمان ثابت کرتا ہے اور عیان (مشاہدہ) اس کی نفی کرتا ہے۔ اور وہ متکبروں کے پاس عین (حقیقت) کے طور پر ہوتا ہے، جسے عیان ثابت کرتا ہے اور ایمان اس کی نفی کرتا ہے۔ پس اللہ نے اپنے نبی صلی اللہ علیہ وسلم کو عیان سے ایمان کی طرف منتقل کیا، اور آپ کو خبر دی کہ عزت دار متکبرین کی حقیقتوں میں اس کا ظہور الٰہی (التجلی) دنیاوی زندگی کی زینت میں سے ہے، پس وہ دنیاوی زندگی کے لیے اللہ کی زینت ہے، ہمارے لیے نہیں۔ اور جو ہمارے لیے ہے وہ اللہ کی زینت ہے جو دنیاوی زندگی کی قید سے آزاد ہے۔ اور یہ ضروری نہیں کہ جو چیز زید کے لیے زینت ہو وہ عمرو کے لیے بھی زینت ہو۔\n\n### [زینت اور لوگوں کا اس کا مشاہدہ]\n\nپس لوگوں میں سے کچھ ایسے ہیں جن کا شہود (مشاہدہ) صرف اللہ کی زینت کے لیے ہوتا ہے۔ اور کچھ لوگ ایسے ہیں جن کا شہود صرف دنیاوی زندگی کی زینت کے لیے ہوتا ہے، اس حیثیت سے کہ وہ اللہ کی زینت ہے اس کے لیے، نہ کہ ہمارے لیے۔ پس وہ اس زینت کا مشاہدہ دنیاوی زندگی کے لیے کرتے ہیں، اگرچہ وہ ہمارے لیے زینت نہ ہو۔ اور کچھ لوگ ایسے ہیں جو شیطان کی زینت کا مشاہدہ اس کے عمل میں اور مخلوق کے اعمال میں کرتے ہیں، جیسا کہ اس کے قول میں ہے: \"اور شیطان نے ان کے اعمال کو ان کے لیے مزین کر دیا، پس اس نے انہیں راستے سے روک دیا، حالانکہ وہ بصیرت والے تھے\" (وَزَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ وَكَانُوا مُسْتَبْصِرِينَ)۔ پس یہ وہ لوگ ہیں جنہیں اللہ نے علم کے باوجود گمراہ کر دیا۔ پس اہل اللہ اس زینت کا مشاہدہ شیطان کے لیے اللہ کی زینت کے طور پر کرتے ہیں کیونکہ یہ اس کا عمل ہے۔ اور کچھ لوگ ایسے ہیں جو اس کا مشاہدہ کرتے ہیں جس کے لیے اس کا عمل مزین کیا گیا، اور وہ نہیں جانتے کہ کس نے اسے مزین کیا، آیا اس زینت کا تعلق مذمت سے ہے یا تعریف سے۔ اور یہ شبہ کا مقام ہے، جیسے کوئی شخص کسی ایسے آدمی کو دیکھے جو یہ پسند کرتا ہو کہ اس کا جوتا اچھا ہو اور اس کا لباس اچھا ہو، تو وہ نہیں جانتا کہ آیا وہ ان لوگوں میں سے ہے جو دنیاوی زندگی کی زینت کو پسند کرتے ہیں یا وہ ان لوگوں میں سے ہے جو اللہ کے لیے خوبصورتی اختیار کرتے ہیں، جیسا کہ اس کے قول میں ہے: \"ہر مسجد کے پاس اپنی زینت اختیار کرو\" (خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ)۔\n\n### [حسن ظن کی طرف تمہیں بلایا گیا ہے اور سوء ظن سے تمہیں منع کیا گیا ہے]\n\nاور آپ صلی اللہ علیہ وسلم نے اس شخص سے فرمایا جس نے آپ سے کہا تھا کہ میں پسند کرتا ہوں کہ میرا جوتا اچھا ہو اور میرا لباس اچھا ہو: \"بے شک اللہ جمیل ہے اور جمال کو پسند کرتا ہے۔\" پس اس شخص کے لیے اشتباہ واقع ہوا، تو وہ نہیں جانتا کہ اس زینت کو کس کی طرف منسوب کرے۔ جیسے کوئی شخص کسی کو یہ کہتے ہوئے سنے: \"تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے\" (الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ)، تو وہ نہیں جانتا کہ آیا وہ تلاوت کرنے والا ہے یا بغیر تلاوت قرآن کے ارادے کے ذکر کرنے والا ہے، کیونکہ لفظ ایک ہی ہے اور وہ مشہود (دیکھی جانے والی چیز) ہے، اور ارادہ غیب ہے۔ اور بہتر یہ ہے کہ جو شخص خوبصورتی اختیار کرے اس کے بارے میں حسن ظن رکھو، کیونکہ تمہیں اس کی طرف بلایا گیا ہے، اور سوء ظن سے تمہیں مسلمانوں کے حق میں اجتناب کا حکم دیا گیا ہے۔ اور اسی لیے نبی صلی اللہ علیہ وسلم نے اپنے اعتکاف کے دوران جب صفیہ کو چھوڑنے کے لیے پلٹے تو دو آدمیوں کے سامنے اپنی بات کی وضاحت کی: \"میں ڈرا کہ شیطان کوئی وسوسہ ڈال دے۔\" پس آپ نے سوء ظن صرف اس کے اہل یعنی شیطان کے حق میں رکھا۔ لہٰذا تمہارے لیے مناسب ہے کہ جب تم کسی کو کوئی ایسا کلمہ کہتے ہوئے سنو جو قرآن میں ہے، جیسا کہ ہم نے اس شخص کے بارے میں کہا جو الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ کہتا ہے، تو تم اسے قرآنی تلاوت سمجھ کر سنو، اگرچہ کہنے والے نے اس کا ارادہ نہ کیا ہو۔ کیونکہ تمہیں قرآن سننے کا ثواب ضرور ملے گا۔ اور یہ ایک عزیز مشاہدہ (الشہود) ہے، کم ہی لوگ ہیں جو اس کا ذائقہ چکھتے ہیں، حالانکہ یہ قریب اور آسان ہے، اس میں کوئی مشقت نہیں۔\n\n### [جس کے لیے اس کا برا عمل مزین کیا گیا]\n\nاور جہاں تک اس کے قول کا تعلق ہے: \"تو کیا وہ شخص جس کے لیے اس کا برا عمل مزین کر دیا گیا\" (أَفَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ)، تو اس کے قول \"اس کا برا عمل\" (سُوءُ عَمَلِهِ) سے تم نے جان لیا کہ کس نے اسے مزین کیا، اگرچہ اس کا ذکر نہیں کیا گیا۔ اس کے باوجود، اس سے احتمال ختم نہیں ہوتا، کیونکہ اللہ اس طرح کے معاملے میں فرماتا ہے: \"ہم نے ان کے اعمال کو ان کے لیے مزین کر دیا، پس وہ بھٹکتے پھرتے ہیں\" (زَيَّنَّا لَهُمْ أَعْمَالَهُمْ فَهُمْ يَعْمَهُونَ)۔ پس اس نے اپنی ذات کے لیے نونِ کنایہ (جمع متکلم کا صیغہ) استعمال کیا اور اس تزیین کی وجہ سے حیرانی (بھٹکنے) کو ان کی طرف منسوب کیا۔ پس جب اللہ اپنے کشف (الکشف) میں یہ واضح نہ کرے کہ یہ تزیین کس کے لیے ہے، تو سالک اسے اللہ کی مراد پر قبول کرتا ہے بغیر کسی تعین کے۔ پس اس کا بدلہ اللہ کے ذمہ ہے، ہمارے نزدیک بغیر کسی تعین کے، اگرچہ وہ اللہ کے نزدیک متعین ہے۔ کیونکہ وہ اللہ کے نزدیک بھی غیر متعین نہیں ہے، چونکہ ہم نے اسے متعین نہیں کیا، اس لیے وہ اسے دو مختلف نسبتوں سے متعین اور غیر متعین جانتا ہے۔ پس اسے سمجھ لو۔\n\nیہ بانوےواں حصہ مکمل ہوا۔\n\n(بسم اللہ الرحمن الرحیم)",
    "fa": "(باب هفتاد و هفتم در ترک مجاهده)\n\nمجاهده مکن، زیرا عین (عين) آنکه با او نزاع می‌کنی، همان عین (عين) کسی است که در او مجاهده می‌کنی.\nو اگر او یکی باشد، چگونه با او نزاع می‌کنی؟ کدام عقل آن را می‌پسندد یا برمی‌گزیند؟\n\nآیا عین (عين) شریک، عین (عين) وجودی دارد که آن را با علم ببینی یا نفی کنی؟\n\nچگونه نفی کند کسی را که در اصل نفی بوده است؟ و او خود نفی است و نفی او را کامل می‌کند.\n\n[ترک جهاد به اقتضای موطن]\n\nهنگامی که مجاهده‌کننده در او، و در راه او، و در الله، و در راه الله، بر راه‌هایی که خداوند او را به آن‌ها هدایت کرده است، آگاه شد و آن را نزد خود آشکار دید، مشاهده کرد که جز با الله مجاهده نکرده است. پس به خاطر این مشهد (مشهد) شرمگین شد و جهاد را به اقتضای موطن (موطن) ترک کرد، و آن موطن، خودِ مجاهده‌شونده (تعالی) است. و او کسی نیست که به مشقت متصف شود، زیرا در مورد چیزی که از این هم بزرگتر است می‌فرماید: **وَمَا مَسَّنَا مِنْ لُغُوبٍ** (و هیچ خستگی به ما نرسید). و فرمود: **وَهُوَ الَّذِي يَبْدَؤُا الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ** (و اوست که آفرینش را آغاز می‌کند، سپس آن را بازمی‌گرداند، و این کار بر او آسان‌تر است). و این آسانی به دلیل دشواری در ابتدا نیست. از این رو، دلالت این قول بر اساس مفهوم (مفهوم) ضعیف است، زیرا در هر موضعی حق نیست. و این (ترک مجاهده) را به خداوند نسبت داد، همان‌گونه که آن را مشاهده کرد، چنانکه رسول الله (صلی الله علیه و سلم) نیز تعظیم عزت الله را ترک کرد، هنگامی که یکی از بندگان خدا به آن متصف شد، مانند قولش: **عَبَسَ وَتَوَلَّى أَنْ جَاءَهُ الْأَعْمَى** (چهره درهم کشید و روی برگرداند، از اینکه نابینا به نزد او آمد).\n\n[مبعوث شدن رسول با دعوت عام و آشکار ساختن آیات]\n\nزیرا او (صلی الله علیه و سلم) فال نیک را دوست می‌داشت.\n\nو مبعوث شدن او با دعوت حق و آشکار ساختن آیات، تنها برای کسی است که به دیدن متصف باشد. پس هنگامی که نابینا نزد او آمد، حقیقت کسانی که برایشان مبعوث شده بود، یعنی اهل بصیرت، برای او آشکار شد. پس روی برگرداند و اعراض کرد، زیرا برای مانند این شخص مبعوث نشده بود. این دیدگاه (نظر) پیامبر (صلی الله علیه و سلم) بود. و خداوند او را در آنچه می‌دانست سرزنش نکرد، بلکه سرزنش او برای جبران دل ابن ام مکتوم و امثال او بود، زیرا آنان از آنچه پیامبر (صلی الله علیه و سلم) شهود (شهود) می‌کرد غایب بودند. و به او امر کرد که خود را با آنان حبس کند و به او فرمود: **وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَداةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ** (و خود را با کسانی که پروردگارشان را صبح و شام می‌خوانند و روی او را می‌خواهند، شکیبا ساز).\n\n[زبان حقیقت در فعل رسول]\n\nخباب بن ارت و بلال و دیگر بردگان و فقرا، هنگامی که بزرگان قریش و اهل جاهلیت از اینکه در یک مجلس با رسول الله (صلی الله علیه و سلم) جمع شوند تکبر ورزیدند، رسول الله (صلی الله علیه و سلم) با آنان موافقت کرد. پس زبان ظاهر می‌گوید که پیامبر (صلی الله علیه و سلم) این کار را برای آنان انجام داد تا دلشان را به اسلام متمایل سازد، زیرا هرگاه یکی از آنان اسلام می‌آورد، به واسطه اسلام او، افراد بسیاری اسلام می‌آوردند، چون در قوم خود مطاع بود. اما زبان حقیقت (حقيقة) این مقام را چنین ترجمه می‌کند که پیامبر (صلی الله علیه و سلم) جز حق (الحق) را مشاهده نمی‌کرد. پس هر جا صفتی را می‌دید که جز برای خدا شایسته نیست، آن را بزرگ می‌داشت و جز آن را با آن مشاهده نمی‌کرد و برای آن قیام می‌کرد و حقش را ادا می‌نمود، مانند عزت، کبریا و غنا (بی‌نیازی). پس پروردگارش به او فرمود: **أَمَّا مَنِ اسْتَغْنَى** (اما کسی که بی‌نیازی جست)، و او را با ساختار استغفال (غفلت‌خواهی) آگاه ساخت: **فَأَنْتَ لَهُ تَصَدَّى** (پس تو به او روی می‌آوری). و او می‌دانست که محمد (صلی الله علیه و سلم) به چه کسی روی می‌آورد. (خداوند) به او می‌گوید: اگرچه تو صفت مرا بزرگ می‌داری، آنجا که آن را به دلیل غلبه شهود (شهود) من می‌بینی، اما من به تو امر کرده‌ام که آن را مقید در محدثین (مخلوقات) مشاهده نکنی. و این همان قول اوست (علیه السلام): «خداوند مرا ادب کرد و نیکو ادب کردنم». و این از همان تأدیب است.\n\n[ترحيب (خوشامدگویی) پیامبر به کسانی که پروردگارش او را به خاطر آنان سرزنش کرد]\n\nو رسول الله (صلی الله علیه و سلم) هرگاه آن بردگان را می‌دید، می‌فرمود: «خوش آمدید به کسانی که پروردگارم مرا به خاطر آنان سرزنش کرد». پس هرگاه نزد او می‌نشستند، به خاطر نشستن آنان می‌نشست و اجازه نمی‌داد که برخیزند یا بروند تا اینکه خودشان بروند. زیرا خداوند به او فرمود: **وَاصْبِرْ نَفْسَكَ** (و خود را شکیبا ساز). و چون آنان این را از او دانستند و اینکه پیامبر (علیه السلام) با اموری مواجه می‌شود که نیاز به رسیدگی دارد، سبک می‌کردند و جز اندکی نزد او نمی‌ماندند و می‌رفتند تا پیامبر (صلی الله علیه و سلم) به کارهای خود بپردازد. پس پیامبر (صلی الله علیه و سلم) آن امری را که در آن مشهدی (مشهد) صحیح و الهی داشت، به خاطر رعایت حفظ دل‌های شکسته ترک کرد.\n\n[الله نزد دل‌شکستگان غیب و نزد متکبران عین است]\n\nزیرا خداوند نزد کسانی که دل‌هایشان شکسته است، غیب (غيب) است؛ ایمانی که آن را اثبات می‌کند و عیان (ديدن) آن را نفی می‌کند. و نزد متکبران، عین (عين) است؛ عیانی که آن را اثبات می‌کند و ایمان آن را نفی می‌کند. پس خداوند پیامبرش (صلی الله علیه و سلم) را از عیان به ایمان منتقل کرد و به او خبر داد که تجلی (التجلی) او تعالی در اعیان (ذوات) عزیزان متکبر از زینت زندگی دنیاست. پس آن، زینت خدا برای زندگی دنیاست، نه برای ما. و آنچه برای ماست، زینت خداست بدون قید به زندگی دنیا. و لازم نیست که چون چیزی برای زید زینت است، برای عمرو نیز زینت باشد.\n\n[زینت و مشاهد مردم نسبت به آن]\n\nپس برخی از مردم شهود (شهود) ندارند مگر زینت خدا را. و برخی از مردم شهود ندارند مگر زینت زندگی دنیا را، از آن حیث که زینت خدا برای دنیاست نه برای ما. پس آن را برای دنیا شهود می‌کنند، اگرچه برای ما زینت نباشد. و برخی از مردم زینت شیطان را در عمل او و اعمال خلق شهود می‌کنند، در قولش: **وَزَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ وَكَانُوا مُسْتَبْصِرِينَ** (و شیطان اعمالشان را برایشان آراست و آنان را از راه بازداشت، در حالی که بینا بودند). پس آنان کسانی هستند که خداوند آن‌ها را با علم گمراه کرد. اهل الله آن را زینت خدا برای شیطان شهود می‌کنند، زیرا آن عمل اوست. و برخی از مردم کسی را که عملش برای او آراسته شده است، شهود می‌کنند، اما نمی‌دانند چه کسی آن را آراسته است؛ آیا متعلق آن زینت، نکوهش است یا ستایش؟ و این موضع شبهه است. مانند کسی که مردی را می‌بیند که دوست دارد کفش و لباسش زیبا باشد، اما نمی‌داند آیا او از کسانی است که زینت زندگی دنیا را دوست دارد، یا از کسانی است که برای خدا تجمل می‌کند، در قولش: **خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ** (زینت خود را نزد هر مسجدی برگیرید).\n\n[حسن ظن به تو توصیه شده و از سوء ظن نهی شده‌ای]\n\nو او (علیه السلام) به مردی که به او گفت: «من دوست دارم کفشم زیبا و لباسم زیبا باشد»، فرمود: «خداوند زیباست و زیبایی را دوست دارد». پس برای این مرد اشتباه رخ داد و نمی‌دانست این زینت را به چه کسی نسبت دهد. مانند کسی که می‌شنود شخصی می‌گوید: **الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ** (ستایش از آنِ خداست، پروردگار جهانیان)، و نمی‌داند آیا او تلاوت‌کننده است یا ذاکری است که قصد تلاوت قرآن ندارد، زیرا لفظ یکی است و آن مشهود است، اما قصد غیب است. و بهتر آن است که به کسی که تجمل می‌کند، حسن ظن داشته باشی، زیرا به آن توصیه شده‌ای، و از سوء ظن در حق مسلمانان نهی شده‌ای. و به همین دلیل، پیامبر (صلی الله علیه و سلم) سخن خود را برای آن دو مرد در اعتکافش، هنگامی که برای بدرقه صفیه بازگشت، تفسیر کرد: «من ترسیدم که شیطان [در دل شما] وسوسه کند». پس او سوء ظن نبرد مگر به اهلش، یعنی شیطان. بنابراین، شایسته است که هرگاه از کسی کلمه‌ای را شنیدی که در قرآن است، چنانکه در مورد کسی که می‌گوید **الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ** گفتیم، آن را تلاوت قرآنی بشنوی، حتی اگر گوینده قصد آن را نداشته باشد. زیرا تو پاداش کسی را که قرآن شنیده است، خواهی برد و این حتمی است. و این مشهدی (مشهد) عزیز است که کمتر کسی را می‌بینی که آن را چشیده باشد، در حالی که نزدیک و آسان است و هیچ زحمتی در آن نیست.\n\n[کسی که بدی عملش برای او آراسته شده است]\n\nو اما قول او: **أَفَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ** (آیا کسی که بدی عملش برای او آراسته شده است)، از قول او «بدی عملش» دانستی چه کسی آن را آراسته است، اگرچه او را ذکر نکرده باشد. با این حال، احتمال از آن برداشته نمی‌شود، زیرا خداوند در مانند این می‌فرماید: **زَيَّنَّا لَهُمْ أَعْمَالَهُمْ فَهُمْ يَعْمَهُونَ** (ما اعمالشان را برایشان آراستیم، پس سرگردانند). پس نون کنایه (نون متکلم مع الغیر) را آورد که اشاره به ذات اوست و سرگردانی را به واسطه این آراستن به آنان نسبت داد. پس چنین کسی، اگر خداوند در کشف (کشف) خود برای او مشخص نکند که این آراستن از کیست، آن را بر مراد خدا در آن می‌پذیرد، بدون تعیین. پس پاداش او نزد خداست بدون تعیین نزد ما، اگرچه نزد خدا معین باشد. زیرا نزد خدا نیز نامعین نیست. ما آن را تعیین نکردیم، پس او آن را معین می‌داند نه نامعین، با دو نسبت متفاوت. پس این را بفهمید.\nپایان جزء نود و دوم.\n\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 3
}