{
  "id": 346,
  "title": {
    "ar": "الباب السادس والأربعون وثلاثمائة في معرفة منزل سر صدق فيه بعض العارفين فرأى نوره كيف ينبعث من جوانب ذلك المنزل وهو من الحضرات المحمدية",
    "en": "Chapter Three Hundred and Forty-Six: Concerning the Gnosis (المعرفة) of the Station of the Secret of Truthfulness (منزل سر صدق), in which some of the Gnostics (العارفين) entered and witnessed how its light emanates from the quarters of that station, and it is one of the Muhammadan Presences (الحضرات المحمدية).",
    "ur": "باب تین سو چھیالیس: معرفت (معرفة) منزل (منزل) سر صدق (سر صدق) کے بیان میں، جس میں بعض عارفین (العارفين) نے قیام کیا اور اس کے نور کو دیکھا کہ وہ کس طرح اس منزل (منزل) کے اطراف سے پھوٹتا ہے، اور یہ منزل (منزل) الحضرات المحمدیہ (الحضرات المحمدية) میں سے ہے۔",
    "fa": "باب سیصد و چهل و ششم در معرفت منزل سرّ صدق که برخی از عارفان در آن وارد شدند و نور آن را دیدند که چگونه از جوانب آن منزل ساطع می‌شود، و این منزل از حضرات محمدیه است."
  },
  "content": {
    "ar": "## «الباب السادس والأربعون وثلاثمائة في معرفة منزل سر صدق فيه بعض العارفين فرأى نوره كيف ينبعث من جوانب ذلك المنزل وهو من الحضرات المحمدية»\n\n\n> عجبت لمعصوم يقال له اتبع *** ولا تبتدئ واحكم بما أنزل الله‏\n\n\n> وكيف يرى المعصوم يحكم بالهوى *** مع الوحي والتحقيق ما ثم إلا هو\n\n\n> فكل هوى في عالم الخلق ساقط *** إذا نظرت من عارف الوقت عيناه‏\n\n\n> ولكنه المرموز ولا يدرك السنا *** وشاهد حال الوقت عن ذاك أعماه‏\n\n\n> وما يعلم المعنى الذي قد قصدته *** وبينته إلا حليم وأواه‏\n\n\n> ألا كل كون حرف لفظ محقق *** ونسبتكم من ذلك الحرف معناه‏\n\n\n### [الفرقان بين الأجسام والأجساد]\n\n\nاعلم أن هذا المنزل من منازل التوحيد والأنوار وأدخلنيه الله تعالى مرتين وفي هذا المنزل صرت نورا\n\n\nكما قال صَلَّى اللهُ عَليهِ وسَلَّم في دعائه واجعلني نورا\n\n\nومن هذا المنزل علمت الفرقان بين الأجسام والأجساد فالأجسام هي هذه المعروفة في العموم لطيفها وشفافها وكثيفها ما يرى منها وما لا يرى والأجساد هي ما يظهر فيها الأرواح في اليقظة الممثلة في صور الأجسام وما يدركه النائم في نومه من الصور المشبهة بالأجسام فيما يعطيه الحس وهي في نفسها ليست بالأجسام‏\n\n\n### [أن مرتبة الإنسان الكامل من العالم مرتبة النفس الناطقة من الإنسان‏]\n\n\nواعلم أن مرتبة الإنسان الكامل من العالم مرتبة النفس الناطقة من الإنسان فهو الكامل الذي لا أكمل منه وهو محمد صَلَّى اللهُ عَليهِ وسَلَّم ومرتبة الكمل من الأناسي النازلين عن درجة هذا الكمال الذي هو الغاية من العالم منزلة القوي الروحانية من الإنسان وهم الأنبياء صلوات الله وسلامه عليهم ومنزلة من نزل في الكمال عن درجة هؤلاء من العالم منزلة القوي الحسية من الإنسان وهم الورثة رضي الله عنهم وما بقي ممن هو على صورة الإنسان في الشكل هو من جملة الحيوان فهم بمنزلة الروح الحيواني في الإنسان الذي يعطي النمو والإحساس واعلم أن العالم اليوم بفقد جمعية محمد ص‏\nفي ظهوره روحا وجسما وصورة ومعنى نائم لا ميت وإن روحه الذي هو محمد صَلَّى اللهُ عَليهِ وسَلَّم هو من العالم في صورة المحل الذي هو فيه روح الإنسان عند النوم إلى يوم البعث الذي هو مثل يقظة النائم هنا وإنما قلنا في محمد صَلَّى اللهُ عَليهِ وسَلَّم على التعيين إنه الروح الذي هو النفس الناطقة في العالم لما أعطاه الكشف وقوله صَلَّى اللهُ عَليهِ وسَلَّم إنه سيد الناس‏\n\n\nوالعالم من الناس فإنه الإنسان الكبير في الجرم والمقدم في التسوية والتعديل ليظهر عنه صورة نشأة محمد صَلَّى اللهُ عَليهِ وسَلَّم كما سوى الله جسم الإنسان وعدله قبل وجود روحه ثم نَفَخَ فِيهِ من رُوحِهِ روحا كان به إنسانا تاما أعطاه بذلك خلقه وهو نفسه الناطقة فقبل ظهور نشأته صَلَّى اللهُ عَليهِ وسَلَّم كان العالم في حال التسوية والتعديل كالجنين في بطن أمه وحركته بالروح الحيواني منه الذي صحت له به الحياة فأجل فكرك فيما ذكرته لك فإذا كان في القيامة حيي العالم كله بظهور نشأته مكملة صَلَّى اللهُ عَليهِ وسَلَّم موفر القوي وكان أهل النار الذين هم أهلها في مرتبتهم في إنسانية العالم مرتبة ما ينمو من الإنسان فلا يتصف بالموت ولا بالحياة وكذا ورد فيهم النص من رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إنهم لا يموتون فيها ولا يحيون‏\n\n\nوقال الله فيهم لا يَمُوتُ فِيها ولا يَحْيى‏ والملائكة من العالم كله كالصور الظاهرة في خيال الإنسان وكذلك الجن فليس العالم إنسانا كبيرا إلا بوجود الإنسان الكامل الذي هو نفسه الناطقة كما إن نشأة الإنسان لا تكون إنسانا إلا بنفسها الناطقة ولا تكون كاملة هذه النفس الناطقة من الإنسان إلا بالصورة الإلهية المنصوص عليها من الرسول صَلَّى اللهُ عَليهِ وسَلَّم فكذلك نفس العالم الذي هو محمد صَلَّى اللهُ عَليهِ وسَلَّم حاز درجة الكمال بتمام الصورة الإلهية في البقاء والتنوع في الصور وبقاء العالم به فقد بان لك حال العالم قبل ظهوره صَلَّى اللهُ عَليهِ وسَلَّم إنه كان بمنزلة الجسد المسوي وحال العالم بعد موته بمنزلة النائم وحالة لعالم ببعثه يوم القيامة بمنزلة الانتباه واليقظة بعد النوم‏\n\n\n### [أن الإنسان كان على الصورة الإلهية]\n\n\nواعلم أن الإنسان لما كان مثال الصورة الإلهية كالظل للشخص الذي لا يفارقه على كل حال غير أنه يظهر للحس تارة ويخفى تارة فإذا خفي فهو معقول فيه وإذا ظهر فهو مشهود بالبصر لمن يراه فالإنسان الكامل في الحق معقول فيه كالظل إذا خفي في الشمس فلا يظهر فلم يزل الإنسان أزلا وأبدا ولهذا كان مشهودا للحق من كونه موصوفا بأن له بصرا فلما مد الظل منه ظهر بصورته أَ لَمْ تَرَ إِلى‏ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ ولَوْ شاءَ لَجَعَلَهُ ساكِناً أي ثابتا فيمن هو ظله فلا يمده فلا يظهر له عين في الوجود الحسي إلا لله وحده فلم يزل مع الله ولا يزال مع الله فهو باق ببقاء الله وما عدا الإنسان الكامل فهو باق بإبقاء الله ولما سوى الله جسم العالم وهو الجسم الكل الصوري في جوهر الهباء المعقول قبل فيض الروح الإلهي الذي لم يزل منتشرا غير معين إذ لم يكن ثم من يعينه فحيي جسم العالم به فكما تضمن جسم العالم أجسام شخصياته كذلك تضمن روحه أرواح شخصياته هُوَ الَّذِي خَلَقَكُمْ من نَفْسٍ واحِدَةٍ ومن هنا قال من قال إن الروح واحد العين في أشخاص نوع الإنسان وإن روح زيد هو روح عمرو وسائر أشخاص هذا النوع ولكن ما حقق صاحب هذا الأمر صورة هذا الأمر فيه فإنه كما لم تكن صورة جسم آدم جسم كل شخص من ذريته وإن كان هو الأصل الذي منه ظهرنا وتولدنا كذلك الروح المدبرة لجسم العالم بأسره كما أنك لو قدرت الأرض مستوية لا نرى فِيها عِوَجاً ولا أَمْتاً وانتشرت الشمس عليها أشرقت بنورها ولم يتميز النور بعضه عن بعضه ولا حكم عليه بالتجزي ولا بالقسمة ولا على الأرض فلما ظهرت البلاد والديار وبدت ظلالات هذه الأشخاص القائمة انقسم النور الشمسي وتميز بعضه عن بعضه لما طرأ من هذه الصور في الأرض فإذا اعتبرت هذا علمت إن النور الذي يخص هذا المنزل ليس النور الذي يخص المنزل الآخر ولا المنازل الأخر وإذا اعتبرت التي ظهر منها هذا النورة وهو عينها من حيث انفهاقه عنها قلت الأرواح روح واحدة وإنما اختلفت بالمحال الشمس كالأنوار نور عين واحدة غير أن حكم الاختلاف في القوابل مختلف لاختلاف أمزجتها وصور أشكالها ولما أعطيت هذا المنزل سنة إحدى وتسعين وخمسمائة وأقمت فيه شبه لي بالماء في النهر لا يتميز فيه صورة بل هو عين الماء لا غير فإذا حصل ما حصل منه في الأواني تعين عند ذلك ماء الحب من ماء الجرة من ماء الكوز وظهر فيه شكل إنائه ولون إنائه فحكمت عليه الأواني بالتجزي والأشكال مع علمك إن عين ما لم يظهر فيه شكل إذا كان في النهر عين ما ظهر إذا لم يكن فيه غير إن الفرقان بين الصورتين في ضرب المثل إن ماء الأواني وأنوار المنازل إذا فقدت رجعت إلى النور الأصلي والنهر الأصلي‏\nوكذلك هو في نفس الأمر لو لم تبق آنية ولا يبقى منزل لأنه لما أراد الله بقاء هذه الأنوار على ما قبلته من التمييز خلق لها أجسادا برزخية تميزت فيها هذه الأرواح عند انتقالها عن هذه الأجسام الدنياوية في النوم وبعد الموت وخلق لها في الآخرة أجساما طبيعية كما جعل لها في الدنيا ذلك غير إن المزاج مختلف فنقلها عن جسد البرزخ إلى أجسام نشأة الآخرة فتميزت أيضا بحكم تميز صور أجسامها ثم لا تزال كذلك أبد الآبدين فلا ترجع إلى الحال الأول من الوحدة العينية أبدا فانظر ما أعجب صُنْعَ الله الَّذِي أَتْقَنَ كُلَّ شَيْ‏ءٍ فالعالم اليوم كله نائم من ساعة مات رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يرى نفسه حيث هي صورة محمد صَلَّى اللهُ عَليهِ وسَلَّم إلى أن يبعث ونحن بحمد الله في الثلث الأخير من هذه الليلة التي العالم نائم فيها ولما كان تجلى الحق في الثلث الأخير من الليل وكان تجليه يعطي الفوائد والعلوم والمعارف التامة على أكمل وجوهها لأنها عن تجل أقرب لأنه تجل في السماء الدنيا فكان علم آخر هذه الأمة أتم من علم وسطها وأولها بعد موت رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لأن النبي صَلَّى اللهُ عَليهِ وسَلَّم لما بعثه الله بعثه والشرك قائم والكفر ظاهر فلم يدع القرن الأول وهو قرن الصحابة إلا إلى الايمان خاصة ما أظهر لهم مما كان يعلمه من العلم المكنون وأنزل عليه القرآن الكريم وجعله يترجم عنه بما يبلغه أفهام عموم ذلك القرن فصور وشبه ونعت بنعوت المحدثات وأقام جميع ما قاله من صفة خالقه مقام صورة حسية مسواة معدلة ثم نفخ في هذه الصورة الخطابية روحا لظهور كمال النشأة فكان الروح لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وسُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ وكل آية تسبيح في القرآن فهو روح صورة نشأة الخطاب فافهم فإنه سر عجيب فلاح من ذلك لخواص القرن الأول دون عامته بل لبعض خواصه من خلف خطاب التنزيه أسرار عظيمة ومع هذا لم يبلغوا فيها مبلغ المتأخرين من هذه الأمة لأنهم أخذوها من مواد حروف القرآن والأخبار النبوية فكانوا في ذلك بمنزلة أهل السمر الذين يتحدثون في أول الليل قبل نومهم فلما وصل زمان ثلث هذه الليلة وهو الزمان الذي نحن فيه إلى أن يطلع الفجر فجر القيامة والبعث ويوم النشر والحشر تجلى الحق في ثلث هذه الليلة وهو زماننا فأعطى من العلوم والأسرار والمعارف في القلوب بتجليه ما لا تعطيه حروف الأخبار فإنه أعطاها في غير مواد بل المعاني مجردة فكانوا أتم في العلم وكان القرن الأول أتم في العمل وأما الايمان فعلى التساوي فإن هذه النشأة لما فطرت على الحسد وبعث فيها نبي من جنسها فما آمن به إلا قوي على دفع نفسه لما فيها من الحسد وحب التفوق والنفور من الحكم عليها ولا سيما إذا كان الحاكم عليها من جنسها تقول بما ذا فضل علي حتى يتحكم في بما يريده فينسب إلى المؤمن من الصحابة من القوة في الايمان ما لا ينسب إلى من ليست له مشاهدة تقدم جنسه عليه فكان اشتغالهم بدفع قوة سلطان الحسد أن يحكم فيهم بالكفر يمنعهم من إدراك غوامض العلوم وأسرار الحق في عباده ولم تحصل له رتبة الايمان بغيب صورة الرسول وما جاء به لكونهم مشاهدين له ولصورة ما جاء فلما جاء زماننا ووجدنا أوراقا مكتوبة سوادا في بياض وأخبارا منقولة ووجدنا القبول عليها ابتداء لا نقدر على دفعه من نفوسنا إذا وفقنا الله علمنا إن قوة نور الايمان أعطى ذلك ولم نجد ترددا ولا طلبنا آية ولا دليلا على صحة ما وجدناه مكتوبا من القرآن ولا منقولا من الأخبار فعلمنا على القطع قوة الايمان الذي أعطانا الله عناية منه وكنا في هذه الحالة مؤمنين بالغيب الذي لا درجة للصحابة فيه ولا قدم كما لم يكن لنا قدم في الايمان الذي غلب ما يعطيه سلطان الحسد عند المشاهدة فقابلنا هذه القوة بتلك القوة فتساويا وبقي الفضل في العلم حيث أخذناه من تجلى هذه الليلة المباركة التي فاز بها أهل ثلثها مما لا قدم للثلثين الماضيين من هذه الليلة فيها\n\n\n### [إن تجلى الله في الثلث الليل الأخير]\n\n\nثم إن تجليه سبحانه في ثلث الليل من هذه الليالي الجزئية التي يعطيها الجديد إن في‏\n\n\nقوله إن ربنا ينزل كل ليلة في الثلث الأخير منها إلى السماء الدنيا فيقول هل من تائب هل من مستغفر هل من سائل حتى ينصدع الفجر\n\n\nفقد شاركنا المتقدمين في هذا النزول وما يعطيه غير أنه تجل منقطع وتجلى ثلث هذه الليلة التي نحن في الثلث الأخير منها وهي من زمان موت رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إلى يوم القيامة لم يشاركنا في هذا الثلث أحد من المتقدمين فإذا طلع فجرها وهو فجر القيامة لم ينقطع التجلي بل اتصل لنا تجليه فلم يزل بأعيننا فنحن بين تجل دنياوي وأخراوي وعام وخاص غير منقطع ولا محجوب وفي الليالي الزمانية يحجبه طلوع الفجر فحزنا ما حازوه في هذه الليالي وفزنا بما حصل لنا من تجلى ثلث هذه لليلة المباركة التي لا نصيب لغير أهلها\nجبرا لقلوبهم لما فقدوه من مشاهدة الرسول صَلَّى اللهُ عَليهِ وسَلَّم وكان خيرا لهم فإنهم لا يعرفون كيف كانت تكون أحوالهم عند المشاهدة هل يغلبهم الحسد أو يغلبونه ف كَفَى الله الْمُؤْمِنِينَ الْقِتالَ وكانَ الله قَوِيًّا عَزِيزاً فاعرف يا ولي منزلتك من هذه الصورة الإنسانية التي محمد صَلَّى اللهُ عَليهِ وسَلَّم روحها ونفسها الناطقة هل أنت من قواها أو من محال قواها وما أنت من قواها هل بصرها أم سمعها أم شمها أم لمسها أم طعمها فإني والله قد علمت أي قوة أنا من قوى هذه الصورة لله الحمد على ذلك ولا تظن يا ولي أن اختصاصنا في المنزلة من هذه الصورة بمنزلة القوي الحسية من الإنسان بل من الحيوان إن ذلك نقص بنا عن منزلة القوي الروحانية لا تظن ذلك بل هي أتم القوي لأن لها الاسم الوهاب لأنها هي التي تهب للقوى الروحانية ما تتصرف فيه وما يكون به حياتها العلمية من قوة خيال وفكر وحفظ وتصور ووهم وعقل وكل ذلك من مواد هذه القوي الحسية ولهذا\n\n\nقال الله تعالى في الذي أحبه من عباده كنت سمعه الذي يسمع به وبصره الذي يبصر به‏\n\n\nوذكر الصورة المحسوسة وما ذكر من القوي الروحانية شيئا ولا أنزل نفسه منزلتها لأن منزلتها منزلة لافتقار إلى الحواس والحق لا ينزل منزلة من يفتقر إلى غيره والحواس مفتقرة إلى الله لا إلى غيره فنزل لمن هو مفتقر إليه لم يشرك به أحدا فأعطاها الغني فهي يؤخذ منها وعنها ولا تأخذ هي من سائر القوي إلا من الله فاعرف شرف الحس وقدره وأنه عين الحق ولهذا لا تكمل النشأة لآخرة إلا بوجود الحس والمحسوس لأنها لا تكمل إلا بالحق فالقوى الحسية هم الخلفاء على الحقيقة في أرض هذه النشأة عن الله أ لا تراه سبحانه كيف وصف نفسه بكونه سميعا بصيرا متكلما حيا عالما قادرا مريدا وهذه كلها صفات لها أثر في المحسوس ويحس الإنسان من نفسه بقيام هذه القوي به ولم يصف سبحانه نفسه بأنه عاقل ولا مفكر ولا متخيل وما أبقى له من القوي الروحانية إلا ما للحس مشاركة فيه وهو الحافظ والمصور فإن الحس له أثر في الحفظ والتصوير فلو لا الاشتراك ما وصف الحق بهما نفسه فهو الحافظ المصور فهاتان صفتان روحانية وحسية فتنبه لما نبهناك عليه لئلا ينكسر قلبك لما أنزلتك منزلة القوي الحسية لخساسة الحس عندك وشرف العقل فأعلمتك إن الشرف كله في الحس وإنك جهلت أمرك وقدرك فلو علمت نفسك علمت ربك كما إن ربك علمك وعلم العالم بعلمه بنفسه وأنت صورته فلا بد أن تشاركه في هذا العلم فتعلمه من علمك بنفسك وهذه نكتة ظهرت من رسول الله ص‏\n\n\nحيث قال من عرف نفسه عرف ربه‏\n\n\nإذ كان الأمر في علم الحق بالعالم علمه بنفسه وهذا نظير قوله تعالى سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ فذكر النشأتين نشأة صورة العالم بالآفاق ونشأة روحه بقوله وفي أَنْفُسِهِمْ فهو إنسان واحد ذو نشأتين حَتَّى يَتَبَيَّنَ لَهُمْ للرائين أَنَّهُ الْحَقُّ أي أن الرائي فيما رآه الحق لا غيره فانظر يا ولي ما ألطف رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بأمته وما أحسن ما علمهم وما طرق لهم فنعم المدرس والمطرق جعلنا الله ممن مشى على مدرجته حتى التحق بدرجته آمين بعزته فإن كنت ذا فطنة فقد أومأنا إليك بما هو الأمر عليه بل صرحنا بذلك وتحملنا في ذلك ما ينسب إلينا من ينكر ما أشرنا به في هذه المسألة من العمي الذين يَعْلَمُونَ ظاهِراً من الْحَياةِ الدُّنْيا وهُمْ عَنِ الْآخِرَةِ هُمْ غافِلُونَ وو الله لو لا هذا القول لحكمنا عليهم بالعمى في ظاهر الحياة الدنيا والآخرة كما حكم الله عليهم بعدم السماع مع سماعهم في قوله تعالى ناهيا ولا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ مع كونهم سمعوا نفى عنهم السمع وهكذا هو علم هؤلاء بظاهر الحياة بما تدركه حواسهم من الأمور المحسوسة لا غير لأن الحق تعالى ليس سمعهم ولا بصرهم فلنذكر ما يتضمنه هذا المنزل من العلوم إن شاء الله فمن ذلك علم عطش العالم الذي لا يقبل معه الري من العلم بالله وفيه علم استناد هذه العلم الذي أعطاه هذا التعطش إلى حضرة الجمع الذي فيه عين الفرقة وفيه علم ما يحصل بالذكر هل هو علم ما نسيه أو مثله لا عينه لشبهة في الصورة فإنه كان عالما بأمر ثم نسيه لما تعطيه نشأته فلم تحفظ عليه صورة علمه بذلك المعلوم ثم ذكره بعد ذلك فهل ما شاهده في ذكره عين ما نسيه أو مثله فإن الزمان قد اختلف عليه مع شبه الزمان بعضه ببعضه فأنت تعلم أن عين أمس ما هو عين اليوم ولا عين غد مع شبهه به في الصورة فمن أي قبيل هو علم الذكر فإن كان هو عينه فمن حفظه حتى ذكره وأين خزانة حفظه هل هي في الناسي ولا ندري أو لها موضع آخر تحفظ فيه زمان نسيانه فإذا تذكر كان عين‏\nتجلى ذلك العلم له فيكون الحق خزانته وهو الحافظ له والمجلى له حتى بذكره هذا الناسي وإن لم يكن الأمر كذلك وإلا فليس بذاكر لما نسي بل هو متعلم علما جديدا مماثلا لعلمه الأول وإنما وقع التجديد في التجلي الذي أعطاه ذكر ما نسي وهي مسألة عجيبة في علم كون العبد نسي ربه في أوقات ما لشغله بنفسه أو بشي‏ء من العالم ثم يتذكره وهذا المنسي الذي لا يقبل التجديد بل هو عينه فمن هنا تعرف علم ذكر ما نسيته وفيه علم البدا وهل يستحيل هذا الوصف على الله أم لا ومن هنا أنكر من أنكر النسخ الإلهي في الأمور والشرائع وقال بإنكاره خلق كثير كما قال بتقريره لا على جهة البدا خلق كثير ونحن سلكنا في علم النسخ طريقا بين طريقين فلم نقل بالبداء ولا نفينا النسخ وجعلناه انتهاء مدة الحكم في علم الله إذ لم يرد حكم من الله ذكر أنه مؤبد أو جار إلى أجل معين ثم رفعته قبل وصول ذلك الأجل فلهذا سلكنا هذه الطريقة فيه وفيه علم من ظهر في غير منزلته بصورة غيره حتى جعل نفسه مشقا أو مثلا لمن تلك صورته ليوقع اللبس ما حكم الله فيمن هذه صفته وما نعته الذي ينبغي أن يطلق عليه وفيه علم الحكمة في الأمور التي تعطي التقديم والأمور التي تعطي التأخير بحكم الجزم أو بحكم الاختيار وفيه علم منزلة المعتبرين اعتبارهم ومن أين تطرق لهم هذا الزلل مع صحة الاعتبار في نفسه فإنه لا زلل فيه وإنما الزلل في المعتبرين وتميز طبقاتهم في ذلك وهو علم عزيز إذ ما كل معتبر يقيم الاعتبار في موضعه وهل المعتبر فيه بفتح الباء لما نصبه الحق هل نصبه لمجرد الاعتبار خاصة فلا يكون له قرار في نفسه إلا ما دام عبرة فإذا ارتفعت عنه صفة الاعتبار من العالم ارتفع وجوده أو هو مقرر في نفسه لا يزول سواء اعتبره المعتبر أو لم يعتبره أو زال الاعتبار من العالم كما يزول في الآخرة عند الإقامة في الدارين وفيه علم إنكار الجاهل على العالم من أين أنكر عليه هل من حضرة أو صفة وجودية في عينها أو عن تخيل لا وجود له من خارج في عين هبل في حضرة خيال المنكر فإن إنكار العالم على الجاهل ما ينكره الجاهل عليه ما هي صورته صورة إنكار الجاهل على العالم وإن اجتمعا في النكران وهل على الحقيقة في العالم ما ينكر أم لا وما هو الإنكار وعلى ما هو حقيقة هل هو أمر وجودي أو نسبة وفيه علم التنافس من أين ظهر في العالم ولما ذا لا يظهر إلا في الجنس وهل التشبه بالإله من هذا القبيل فإن كان فما الجنس الجامع بين الخلق والحق هل الصورة التي نالها الإنسان الكامل المخلوق عليها أو ما ينافس هذا الإنسان الجزئي إلا الإنسان الذي لم يزل يحفظ صورة الحق في نفسه الذي هو ظل له فيحب هذا الإنسان الجزئي أن ينال رتبة ذلك الإنسان الذي هو ظل الصورة الإلهية أو ليس صورة الحق إلا عين هذا الإنسان الذي عبرنا عنه بالظل والحق روح تلك الصورة فيكون الحق ذا صورة وروح كما يتجلى في الآخرة فينكر ويعرف فإن الله ما ذكر ذلك التجلي سدى أعني في ذكر النبي صَلَّى اللهُ عَليهِ وسَلَّم له في هذه الحياة الدنيا فما ذكره إلا لينبه القلوب على طلب علم ذلك من الله وفيه علم خزائن الرحموت لا الرحمة وفيه علم الرحمة المستندة إلى إعطاء الإنعام وإلى المقام الذي به رفعت حكم الغضب الإلهي من العالم وإلى المقام الذي يكون منه خلق ما يصلح بالعالم وأعني بذلك كله عالم التكليف ومن هذا المقام تكلم القائلون بوجوب مراعاة الأصلح في حق الحق وفيه علم الترقي في علم الأسباب هل ينتهي أو لا ينتهي وهل الترقي سبب فيرتقي فيه وبه وفيه علم الفتن والملاحم المعنوية ولمن تكون الغلبة فيها والظهور وإلى حيث ينتهي أمر هذا الفتن وفيه علم تشبه العالم بالعالم وطبقاته فمن ذلك ما هو تشبه محمود كتشبه عالم التكليف منا بعالم التسبيح وهو كل شي‏ء مسبح بحمد الله من العالم وكتشبه الإنسان بمن تقدمه في مكارم الأخلاق ومنه ما هو تشبه مذموم وأما التشبه بالحق فذلك التشبه المطلوب عند أكثر أهل الله وأما عند نافلا يصح‏\n\n\nالتشبه بالله وما قال به من الحكماء إلا من لا معرفة له بالأمر على ما هو عليه في نفسه وفيه علم الفرق بين قوله تعالى ثُمَّ نُفِخَ فِيهِ أُخْرى‏ وبين قوله تعالى ما لَها من فَواقٍ فوحد وثني فما محل التثنية من محل الإفراد أو كيف هو الأمر وفيه علم الخاتمة في الحال قبل كونها هل ذلك خاتمة في حق العالم بها أم لا وهل العلم بذلك من البشرى التي قال الله فيها لَهُمُ الْبُشْرى‏ في الْحَياةِ أم لهذا صورة وللبشرى صورة أخرى‏\n\n\nفإن النبي صَلَّى اللهُ عَليهِ وسَلَّم قد بشر جماعة بالجنة وعاشوا بعد ذلك زمانا طويلا\n\n\nبخلاف بشرى المحتضر وفيه علم القوة الحادثة وتجزئها في المحدثات وهل ثم محدث أخذها كلها أم لا يتصور ذلك وما قدرها من القوة الإلهية هل جزء من كذا كذا جزءا منها أم لا\nفإن القوة الإلهية محلها الممكنات على الإطلاق والقوة الحادثة محلها بعض الممكنات فإذا حصرت أجناس العالم الممكن وسميت ما للقوة من الممكنات علمت على القطع مقدار ذلك من القوة الإلهية وفيه علم الفرق بين التسخير العالم والتسخير الخاص وهل كون الحق كُلَّ يَوْمٍ هُوَ في شَأْنٍ وسَنَفْرُغُ لَكُمْ هل هو من علم التسخير وبابه أو هو من حقيقة أخرى فإن السيد بصورة الحال يقوم بما يحتاج إليه بعده فهو تسخير دقيق يعطى كمالا في السيد فإن العبد ليست منزلته أن يسخر سيده ومنزلة العبد أن يكون مسخرا تحت تسخير سيده بالحالين تسخير بأمر سيده وتسخير بنفسه من ذاته لكونه عبدا وقد يسخر لغير سيده من أمثال سيده ومن أمثاله بطرق مختلفة منها ما يكون تسخيره لذلك الغير عن أمر سيده ومنها ما يكون بطريق المروءة مع المسخر له بفتح الخاء ومنه ما يكون عادة لاستصحاب التسخير له من كونه عبدا فصار له ذلك ديدنا يحكم عليه فيتسخر لغير سيده بحكم العادة لا بالمروءة ولا بأمر السيد وفيه علم نظر العالم كله إلى هذا الإنسان هل ينظر إليه من كونه خليفة أو ينظر إليه من حيث ما عنده من الأمانات له ليؤديها إليه فهو مرسل من الحق بحكم الجبر لا بحكم الاختيار لأنه ما خلق بالأصالة إلا لتسبيح خالقه وفيه علم ما تقع به العناية الإلهية للعبد وما يعطيه ذلك الاعتناء من المنزلة والعلم وفيه علم الإجمال والتفصيل وفيه علم دقيق وهوأن آدم عليه السلام أعطى لداود من عمره ستين سنة حين رأى صورته بين إخوته فأحبه فقبل ذلك داود فجحد آدم بعد ذلك ما أعطاه فانكسر قلب داود عند ذلك فجبره الله بذكر لم يعطه آدم‏\n\n\nفقال في آدم إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً وما عينه باسمه ولا جمع له بين أداة المخاطب وبين ما شرفه به فلم يقل له وعلمتك الأسماء كلها وقال في خلافة داود يا داوُدُ إِنَّا جَعَلْناكَ خَلِيفَةً في الْأَرْضِ فسماه فلما علم الله أن مثل هذا المقام والاعتناء يورثه النفاسة على أبيه آدم فإنه على كل حال بشر يكون منه ما يكون من البشر وما عرف قدر هذا إلا رسول الله ص‏\n\n\nفقال إنما أنا بشر أغضب كما يغضب البشر يعني لنفسه ولحق غيره وأرضى كما يرضى البشر\n\n\nيعني لنفسه ولغيره وكان هذا من التأديب الإلهي الذي أدبه به ربه تعالى فيما أوحى به إليه فقال له قُلْ إِنَّما أَنَا بَشَرٌ مِثْلُكُمْ أي حكم البشرية في حكمها فيكم فلما أراد الله تأديب داود لما يعطيه الذكر الذي سماه الله به من النفاسة على أبيه ولا سيما وقد تقدم من أبيه في حقه ما تقدم من الجحد لما امتن به عليه لكون الإنسان إِذا مَسَّهُ الْخَيْرُ مَنُوعاً غير إن آدم ما جحد ما جحده إلا لعلمه بمرتبته حيث جعله الله محلا لعلم الأسماء الإلهية التي ما أثنت الملائكة على الله بها ولم تعط بعده إلا لمحمد صَلَّى اللهُ عَليهِ وسَلَّم وهو العلم الذي كني عنه بأنه جوامع الكلم فعلم آدم أن داود في تلك المدة التي أعطاه من عمره لا يمكن أن يعبد الله فيها إلا على قدر كماله وهو أنقص من آدم في المرتبة بلا شك لسجود الملائكة وما علمهم من الأسماء فطلب آدم أن يكون له العمر الذي جاد به على ابنه داود عليه السلام ليقوم فيه بالعبادة لله على قدر علو مرتبته على ابنه داود وغيره مما لا يقوم بذلك داود فإذا قام بتلك العبادة في ذلك الزمان المعين وهب لابنه داود أجر ما تعطيه تلك العبادة من مثل آدم ولو ترك تلك المدة لداود لم تحصل له رتبة هذا الجزاء وحصل لآدم عليه السلام من الله على ذلك رتبة جزاء من آثر على نفسه فإنه يجري بجزاء مثل هذا لم يكن يحصل له لو لم يكن ترك تلك المدة لداود فكما أحبه في القبضة حين أعطاه من عمره ما أعطاه كذلك من حبه رجع في ذلك ليعطيه جزاء ما يقع في تلك المدة من آدم من العمل ولا علم لداود بذلك فلما جبره الله بذكر اسمه في الخلافة قال له من أجل ما ذكرناه من تطرق النفاسة التي في طبع هذه النشأة وإليه لا تَتَّبِعِ الْهَوى‏ فَيُضِلَّكَ عَنْ سَبِيلِ الله فحذره فشغله ذلك الحذر عن الفرح بما حصل له من تعيين الله له باسمه ولكن قد حصل له الفرح وأخذ حظه منه قبل إن يصل إليه زمان ولا تَتَّبِعِ الْهَوى‏ فَيُضِلَّكَ عَنْ سَبِيلِ الله لا عن الله فأمر بمراقبة السبيل ثم تأدب الله معه حيث قال له إِنَّ الَّذِينَ يَضِلُّونَ عَنْ سَبِيلِ الله لَهُمْ عَذابٌ شَدِيدٌ بِما نَسُوا ولم يقل فإنك إن ضللت عن سبيل الله لك عذاب شديد وهذا علم شريف وفي هذا المنزل علم أصحاب الكشف أنه ليس من حقيقة الكشف أن يعلمه المكاشف في كل صورة بل ذلك على قدر ما يريده الحق فيستر عنه ما شاء ويطلعه على ما شاء فليس من شأن المكاشف نفوذ بصره في كل صورة تتجلى له بل تقوم له تلك الصورة التي لا يدري ما هي مقام كثافة الصورة عن إدراك الحس البشري لما خطر في‏\nنفس تلك الصورة التي أدركها البصر وفي وقت آخر يعطيه الكشف بما تكلم به ذلك الشخص فيه قلبه وهو الكلام على الخاطر عن علم معين له وكشف لا عن زجر ولا حدس ولا موافقة وفيه علم ما يبقى الرفق الإلهي بالعالم وفيه علم حكمة وجود العالم وفيه علم أسباب النزول وفيه علم الوهب والكسب وفيه علم ما هو الأمر الذي يقوم فيه العبد مقام سيده وفيه علم رعاية الأسباب التي أعطت الخير لصاحب النظر فيها وفيه علم الإبدال أي علم الصور التي يدركها البدل على صورته حيث شاء على علم منه وإن منزلته منزلة عيسى عليه السلام في قوله والسَّلامُ عَلَيَّ يَوْمَ وُلِدْتُ ويَوْمَ أَمُوتُ ويَوْمَ أُبْعَثُ حَيًّا وعلم الصور التي يقيمها الحق بد لا من صورة هذا الذي يقام عنه حيث شاء الحق على غير علم من هذا الذي يقام عنه ومنزلته فيها منزلة يحيى عليه السلام في قول الله وسَلامٌ عَلَيْهِ يَوْمَ وُلِدَ ويَوْمَ يَمُوتُ ويَوْمَ يُبْعَثُ حَيًّا وأي المقامين أتم وأعلى وكون يحيى لم يجعل لَهُ من قَبْلُ سَمِيًّا واختصاصه بذبح الموت يوم القيامة وفيه علم ما السبب الذي يدعو الإنسان أن يطلب الانفراد بالأتم والأعلى والتفوق على غيره وفيه علم رفع المقادير هل ترفع في نفس الأمر أو لا يصح رفعها وإنما ترفع في حق من ترفع في حقه وهي مقدرة عند الله من حيث لا يشعر العالم بذلك وفيه علم إن كل شي‏ء يعلمه الإنسان إنما هو تذكر لا ابتداء علم وأن كل علم عنده لكنه نسيه وفيه علم صورة تسليط الجن على الإنس والإنس على الجن وهل تسليط الجن على الإنس ظاهر أو باطنا أو هو في حق قوم ظاهرا خاصة والباطن معصوم أو كيف هو الأمر وكذلك القول في تسليط الإنس على الجن إلا إن الإنس ليس لهم تسليط إلا على ظاهر الجن الأمن تروحن من الأنس وتلطف معناه بحيث يظهر في ألطف من صور الجن فيسري بذاته في باطن الجن سريان الجن في باطن الإنس فيجهله الجني ويتخيل أن ذلك من حكم نفسه عليه وهو حكم هذا الإنسي المتروحن وما رأيت أحدا نبه على هذا النوع من العلم وأطلعني الله تعالى عليه فما أدري هل علمه من تقدم من جنسي وما ذكره أم لا وفيه علم الدواء الذي يزيل به الإنسان ما أثر فيه الجن في تسلطه عليه وفيه علم ما ينكشف له بعد ذهاب هذا الأثر منه وفيه علم صدور الكثرة عن الواحد وهل صدر عن الواحد أحدية الكثرة أو الكثرة وفيه علم الصادر عن المصدر أنه يؤذن أن يكون له حكم المصدر فإن ثبت هذا فيكون مال العالم المكلف إلى الراحة فإن الحق ما صدر عنه العالم من يوم الأحد إلى يوم الجمعة ودخل يوم الأبد وهو يوم السبت والسبت الراحة وهو السابع من الأيام الذي لا انقضاء له وما مس الخالق من لغوب في خلقه ما خلق ولكن كان يوم السبت يوم الفراغ من طبقات العالم وبقي الخلق من الله فيما يحتاج إليه هذا العالم من الأحوال التي لا ينتهي أبدها ولا ينقضي أمدها وفيه علم نش‏ء الملائكة وفيه علم نش‏ء الإنسان ومرتبته وما له من الحضرة الإلهية وتفاضل أشخاص هذا النوع بما ذا يكون التفاضل هل بالنش‏ء أو بما يقبله من الأعراض وفيه من العلوم غير هذا ولكن قصدنا إلى المهم فالمهم من ذلك لننبه القلوب عليه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 346: Concerning the Knowledge of the Station of the Secret of Sincerity (منزل سر صدق), which some Gnostics (العارفين) entered and saw its light emanating from the sides of that Station, and which belongs to the Muhammadan Presences (الحضرات المحمدية).\n\nI wonder at the infallible one (ma‘ṣūm) who is told: Follow,\nAnd do not innovate, and judge by what Allah has revealed.\n\nAnd how can the infallible one be seen judging by caprice (hawā),\nWhen with Revelation and Realization (التحقيق), there is nothing there but He (Hū)?\n\nFor every caprice in the world of creation (عالم الخلق) falls away,\nWhen the eyes of the Gnostic of the Time (عارف الوقت) behold it.\n\nBut it is the symbolized, and the radiance (al-sanā) is not grasped,\nAnd the witness of the state of the Time is blinded from that.\n\nAnd none knows the meaning that I intended\nAnd clarified, except the forbearing and the oft-returning.\n\nBehold, every existence (كون) is a letter of a realized utterance,\nAnd your relation to that letter is its meaning.\n\n### [The Distinction between Bodies (الأجسام) and Corporeal Forms (الأجساد)]\n\nKnow that this station is one of the stations of Unity (التوحيد) and Lights (الأنوار). Allah the Exalted admitted me into it twice, and in this station, I became light (nūr), as the Prophet, peace and blessings be upon him, said in his supplication: \"And make me light.\"\n\nFrom this station, I learned the distinction (الفرقان) between bodies (الأجسام) and corporeal forms (الأجساد). Bodies (الأجسام) are those generally known, whether subtle, transparent, or dense, those that are seen and those that are not seen. Corporeal forms (الأجساد) are those in which spirits (الأرواح) appear in wakefulness, represented in the forms of bodies, and those images perceived by the sleeper in their dream, which resemble bodies in what the senses convey, yet are not bodies in themselves.\n\n### [That the Rank of the Perfect Human (الإنسان الكامل) in the Cosmos is the Rank of the Rational Soul (النفس الناطقة) in the Human Being]\n\nKnow that the rank of the Perfect Human (الإنسان الكامل) in the Cosmos (العالم) is the rank of the Rational Soul (النفس الناطقة) in the human being. He is the Perfect One, than whom there is none more perfect, and he is Muhammad, peace and blessings be upon him.\n\nThe rank of the perfected ones among mankind who fall short of this ultimate degree of perfection in the Cosmos is the station of the spiritual faculties (القوي الروحانية) in the human being, and they are the Prophets, peace and blessings of Allah be upon them. The station of those in the Cosmos whose perfection is lower than the degree of these (Prophets) is the station of the sensory faculties (القوي الحسية) in the human being, and they are the Inheritors (الورثة), may Allah be pleased with them. As for the rest who possess the human form in shape, they belong to the category of animals; they are in the position of the animal spirit (الروح الحيواني) in the human being, which provides growth and sensation.\n\nKnow that the Cosmos today, due to the loss of the comprehensive presence (جمعية) of Muhammad, peace be upon him, in his manifestation as spirit, body, form, and meaning, is sleeping, not dead. And his spirit, which is Muhammad, peace and blessings be upon him, is to the Cosmos like the state of the human spirit during sleep, until the Day of Resurrection (البعث), which is like the awakening of the sleeper here.\n\nWe specifically designated Muhammad, peace and blessings be upon him, as the Spirit, which is the Rational Soul (النفس الناطقة) of the Cosmos, based on what Unveiling (الكشف) granted, and based on his saying, peace and blessings be upon him, that he is the Master of Mankind. The Cosmos is composed of mankind, for it is the Great Human (الإنسان الكبير) in substance, prepared through equalization and adjustment, so that the form of the manifestation (نشأة) of Muhammad, peace and blessings be upon him, might emerge from it. Just as Allah equalized and adjusted the human body before the existence of its spirit, and then breathed into it of His Spirit a spirit, by which it became a complete human being, granting it its nature, which is its Rational Soul.\n\nThus, before the manifestation of his existence, peace and blessings be upon him, the Cosmos was in a state of equalization and adjustment, like a fetus in its mother’s womb, its movement sustained by the animal spirit within it, by which its life was validated. Therefore, elevate your thought concerning what I have mentioned to you. When the Resurrection occurs, the entire Cosmos will be brought to life by the complete manifestation of his existence, peace and blessings be upon him, with all faculties fully provided.\n\nThe people of the Fire, who belong there, will hold the rank in the humanity of the Cosmos of that which grows in the human being but is not characterized by death or life. This is confirmed by the text from the Messenger of Allah, peace and blessings be upon him, that they \"neither die therein nor live.\" And Allah said concerning them: <<He neither dies therein nor lives>>.\n\nThe angels (الملائكة) in the entire Cosmos are like the forms appearing in the human imagination (الخيال), and likewise the Jinn. The Cosmos is not a Great Human except through the existence of the Perfect Human (الإنسان الكامل), who is its Rational Soul. Just as the human manifestation does not become human except through its Rational Soul, and this Rational Soul in the human being is not complete except through the Divine Form (الصورة الإلهية) explicitly mentioned by the Messenger, peace and blessings be upon him. Similarly, the Soul of the Cosmos, which is Muhammad, peace and blessings be upon him, attained the degree of perfection through the completeness of the Divine Form in subsistence (البقاء) and diversification into forms, and the subsistence of the Cosmos is through him.\n\nIt has thus become clear to you that the state of the Cosmos before his manifestation, peace and blessings be upon him, was like the adjusted body; the state of the Cosmos after his death is like the sleeper; and the state of the Cosmos upon its resurrection on the Day of Judgment is like the awakening and vigilance after sleep.\n\n### [That the Human Being was upon the Divine Form (الصورة الإلهية)]\n\nKnow that since the human being is the exemplar of the Divine Form, like the shadow of a person that never leaves them, except that it sometimes appears to the senses and sometimes is hidden. When it is hidden, it is intelligible within him; and when it appears, it is witnessed by sight for whoever sees it. The Perfect Human (الإنسان الكامل) is intelligible within The Real (الحق), like the shadow when it is hidden in the sun and does not appear.\n\nThe human being has been eternally and perpetually existent. For this reason, he was witnessed by The Real by virtue of being described as having sight. When the shadow was extended from Him, it appeared in its form: <<Have you not considered your Lord, how He extends the shadow? And if He had willed, He could have made it stationary>>. Meaning, fixed in the one who is His shadow, so He would not extend it, and no entity (ayn) would appear for Him in sensory existence except for Allah alone. Thus, he has always been with Allah and will always remain with Allah; he subsists (باق) by the Subsistence (بقاء) of Allah. Everything other than the Perfect Human subsists by the sustaining of Allah.\n\nWhen Allah adjusted the body of the Cosmos—which is the total formal body in the intelligible substance of the Dust (الهباء)—before the outpouring of the Divine Spirit (الروح الإلهي), which has always been diffused and undefined, since there was nothing there to define it, the body of the Cosmos was brought to life by it. Just as the body of the Cosmos encompasses the bodies of its individualities, so too does its spirit encompass the spirits of its individualities: <<It is He who created you from a single soul (نفس واحدة)>>.\n\nFrom this perspective, some have said that the Spirit is one in essence (عين) across the individuals of the human species, and that the spirit of Zayd is the spirit of Amr and all other individuals of this species. However, the proponent of this view has not realized the form of this matter within it. For just as the form of Adam’s body was not the body of every individual of his progeny, even though he is the origin from which we appeared and were generated, so too is the Spirit that governs the entire body of the Cosmos.\n\nIt is as if you imagine the earth to be flat, where we see <<no crookedness or unevenness>>. If the sun spreads over it, it shines with its light, and the light is not distinguished one part from another, nor is it subject to fragmentation (التجزي) or division, nor is the earth. But when lands and dwellings appeared, and the shadows of these standing individuals became visible, the solar light was divided and distinguished one part from another due to the emergence of these forms upon the earth. If you consider this, you will know that the light specific to this station is not the light specific to the other station, nor to the other stations.\n\nBut if you consider the source from which this light appeared—which is its very essence in terms of its bursting forth—you would say that the spirits are one spirit, differing only by their loci. The sun is like the lights: the light of a single essence, except that the rule of difference in the recipients (القوابل) varies due to the difference in their temperaments and the forms of their shapes.\n\nWhen I was granted this station in the year 591 AH and resided in it, it was likened to the water in a river, where no form is distinguished; rather, it is the essence of water and nothing else. But when some of that water is placed in vessels, the water of the large jar is then distinguished from the water of the small jar and the water of the cup, and the shape and color of its vessel appear in it. Thus, the vessels impose fragmentation and forms upon it, even though you know that the essence of the water that showed no form when in the river is the same essence as the water that showed form when contained. The only difference between the two images in this analogy is that the water of the vessels and the lights of the stations, if lost, return to the original Light and the original River.\n\nAnd this is the case in reality (في نفس الأمر), even if no vessel or station remains. Because when Allah willed the subsistence of these lights according to the distinction they accepted, He created for them intermediary bodies (أجساد برزخية) in which these spirits became distinct upon their transition from these worldly bodies, both in sleep and after death. And He created for them natural bodies in the Hereafter (الآخرة), just as He did in this world, except that the temperament is different. He transferred them from the body of the Isthmus (البرزخ) to the bodies of the manifestation of the Hereafter, where they also became distinct according to the distinction of the forms of their bodies. They will remain thus forever and ever, never returning to the initial state of essential Unity (الوحدة العينية). Look then at the wondrous <<workmanship of Allah, Who perfected everything>>.\n\nThe entire Cosmos today has been sleeping since the hour the Messenger of Allah, peace and blessings be upon him, died, seeing itself as the form of Muhammad, peace and blessings be upon him, until he is resurrected. And we, praise be to Allah, are in the last third of this night during which the Cosmos is sleeping.\n\nSince the Theophany (التجلي) of The Real (الحق) occurs in the last third of the night, and His Theophany grants perfect benefits, sciences (العلوم), and gnoses (المعارف) in their most complete forms—because it is from a closer Theophany, being a Theophany in the lowest heaven—therefore, the knowledge of the latter part of this Community (Ummah) is more complete than the knowledge of its middle and its beginning, after the death of the Messenger of Allah, peace and blessings be upon him.\n\nBecause when Allah sent the Prophet, peace and blessings be upon him, polytheism (الشرك) was established and disbelief (الكفر) was manifest. He called the first generation, the generation of the Companions, only to faith (الإيمان) specifically, without revealing to them what he knew of the hidden knowledge (العلم المكنون). The Noble Quran was revealed to him, and he was made to interpret it in a way that reached the understanding of the generality of that generation. Thus, he described, likened, and characterized (Allah) with the attributes of created things, and established everything he said concerning the description of his Creator in the position of an adjusted and equalized sensory form. Then He breathed a spirit into this discursive form for the manifestation of the perfection of existence. Thus, the Spirit was: <<There is nothing whatever like unto Him>> and <<Glorified be your Lord, the Lord of Might, above what they describe>>. Every verse of glorification (تسبيح) in the Quran is the spirit of the form of the manifestation of the discourse. Understand this, for it is a wondrous secret.\n\nFrom this, great secrets shone forth for the elite of the first generation, but not their common folk, indeed, only for some of their elite, from behind the discourse of transcendence (التنزيه). Despite this, they did not reach the level of the later generations of this Community, because they derived them from the material letters of the Quran and the Prophetic narrations. In this, they were like people engaged in evening talk who converse in the first part of the night before sleeping.\n\nWhen the time of the last third of this night arrived—which is the time we are in, until the dawn of Resurrection, the Day of Gathering and Assembly—The Real manifested in the last third of this night, which is our time. By His Theophany, He granted sciences, secrets, and gnoses in the hearts that the letters of the narrations do not grant. For He granted them without material means, but as pure meanings. Thus, they (the later generations) were more complete in Knowledge (العلم), while the first generation was more complete in action (العمل).\n\nAs for Faith, it is equal. Since this manifestation was created upon envy (الحسد), and a prophet of its own kind was sent to it, none believed in him except those strong enough to repel their own souls due to the envy and love of superiority within them, and their aversion to being ruled, especially when the ruler was of their own kind. The soul asks: \"By what was he favored over me, that he should rule me with what he desires?\" Thus, the believing Companion is attributed with a strength of faith that is not attributed to one who does not witness the precedence of his own kind over him. Their preoccupation with repelling the power of the dominion of envy, lest it rule them with disbelief, prevented them from grasping the subtle points of the sciences and the secrets of The Real concerning His servants. They did not attain the rank of faith in the unseen (الغيب) form of the Messenger and what he brought, because they were witnessing him and the form of what he brought.\n\nWhen our time came, and we found papers written in black on white, and transmitted narrations, and we found immediate acceptance of them, which we could not repel from our souls when Allah granted us success, we knew that the power of the light of faith (نور الإيمان) granted this. We found no hesitation, nor did we seek a sign or proof for the validity of what we found written of the Quran or transmitted of the narrations. Thus, we knew with certainty the strength of the faith that Allah granted us through His care. In this state, we were believers in the Unseen, a rank in which the Companions had no standing or precedence. Just as we had no standing in the faith that overcame the dominion of envy during witnessing, we countered this strength with that strength, and thus we became equal. The superiority remained in Knowledge, which we took from the Theophany of this blessed night, by which the people of its last third were victorious, a victory in which the preceding two-thirds of this night have no standing.\n\n### [That Allah’s Theophany (تجلي) is in the Last Third of the Night]\n\nFurthermore, His Theophany, glory be to Him, in the last third of the night, concerning these specific nights that the new moon brings, is found in His saying: \"Indeed, our Lord descends every night in the last third of it to the lowest heaven, saying: Is there any repentant one? Is there any seeker of forgiveness? Is there any petitioner? Until the dawn breaks.\"\n\nWe have shared with the predecessors in this descent and what it grants, except that it is a discontinuous Theophany. However, the Theophany of the last third of this (greater) night—which we are in, extending from the time of the death of the Messenger of Allah, peace and blessings be upon him, until the Day of Resurrection—no one among the predecessors shared this third with us. When its dawn breaks, which is the dawn of the Resurrection, the Theophany will not cease; rather, His Theophany will be continuous for us, remaining before our eyes. Thus, we are between a worldly and an otherworldly Theophany, general and specific, neither interrupted nor veiled. In the temporal nights, the rising of the dawn veils it. So, we have attained what they attained in those nights, and we have triumphed with what we received from the Theophany of the last third of this blessed night, in which none but its people have a share.\n\nThis is a compensation for their hearts for what they missed of witnessing the Messenger, peace and blessings be upon him. This was better for them, for they do not know what their states would have been during the witnessing—whether envy would have overcome them or they would have overcome it. <<So Allah spared the believers the fighting, and Allah is Ever Strong, All-Mighty>>.\n\nTherefore, O friend (ولي), know your station in relation to this human form, of which Muhammad, peace and blessings be upon him, is the spirit and the Rational Soul (النفس الناطقة). Are you one of its faculties (قواها) or one of the loci of its faculties? And if you are one of its faculties, are you its sight, its hearing, its smell, its touch, or its taste? For I, by Allah, have known which faculty I am among the faculties of this form. Praise be to Allah for that.\n\nAnd do not imagine, O friend, that our specific station in this form—the station of the sensory faculties (القوي الحسية) in the human being, or even in the animal—implies a deficiency compared to the station of the spiritual faculties (القوي الروحانية). Do not think that. Rather, they are the most complete faculties, because they possess the Name, The Bestower (الوهاب). For they are the ones that bestow upon the spiritual faculties what they operate with, and what constitutes their cognitive life, such as the power of imagination (خيال), thought, memory, conception, estimation, and intellect. All of this comes from the materials provided by these sensory faculties.\n\nFor this reason, Allah the Exalted said concerning the servant whom He loves: \"I am his hearing with which he hears, and his sight with which he sees.\" He mentioned the sensory form, but He did not mention anything of the spiritual faculties, nor did He lower Himself to their station, because their station is one of dependence on the senses. The Real (الحق) does not descend to the station of one who depends on another. The senses are dependent upon Allah, not upon others. So, He descended to that which is dependent upon Him and has associated no partner with Him, granting it richness. Thus, things are taken from and through the senses, but the senses themselves take nothing from the other faculties except from Allah.\n\nTherefore, know the nobility and worth of the sense (الحس), and that it is the very Essence (عين) of The Real. For this reason, the manifestation of the Hereafter is not complete except through the existence of the sense and the sensible, because it is not completed except by The Real. The sensory faculties are, in reality, the vicegerents (الخلفاء) of Allah on the earth of this manifestation. Do you not see how He, glory be to Him, described Himself as Hearing, Seeing, Speaking, Living, Knowing, Powerful, Willing? All of these are attributes that have an effect on the sensible, and the human being senses within himself the establishment of these faculties. Yet, He, glory be to Him, did not describe Himself as intelligent, thinking, or imagining. Of the spiritual faculties, He only retained for Himself those in which the sense has a share: the Preserver (الحافظ) and the Fashioner (المصور). For the sense has an effect on preservation and fashioning. Were it not for this shared aspect, The Real would not have described Himself with them. Thus, He is the Preserver, the Fashioner. These two attributes are spiritual and sensory. Pay attention to what we have alerted you to, lest your heart be broken because I placed you in the station of the sensory faculties, due to the perceived baseness of the sense in your view and the nobility of the intellect.\n\nI have informed you that all nobility lies in the sense, and that you were ignorant of your own affair and worth. If you knew yourself, you would know your Lord, just as your Lord knew you and knew the Cosmos by His knowledge of Himself, and you are His form. Therefore, you must share in this knowledge and know Him through your knowledge of yourself. This is a subtle point that emerged from the Messenger of Allah, peace be upon him, where he said: \"Whoever knows his self (نفسه) knows his Lord.\" Since the matter concerning The Real’s knowledge of the Cosmos is His knowledge of Himself. This is analogous to His saying, the Exalted: <<We will show them Our signs in the horizons (الآفاق) and within themselves (أنفسهم)>>. He mentioned the two manifestations: the manifestation of the form of the Cosmos through the horizons, and the manifestation of its spirit through His saying, \"and within themselves.\" Thus, it is one human being possessing two manifestations, <<Until it becomes clear to them>>—to the beholders—<<that it is The Real (الحق)>>. Meaning, that what the beholder sees is The Real and nothing else.\n\nLook, O friend, at how gentle the Messenger of Allah, peace and blessings be upon him, was with his Community, and how beautifully he taught them and paved the way for them. What an excellent teacher and path-paver! May Allah make us among those who walk his path until we join his degree. Amen, by His Might.\n\nIf you possess insight, we have alluded to you concerning the reality of the matter; indeed, we have stated it explicitly. In doing so, we have borne the accusations leveled against us by those blind ones who deny what we have indicated in this matter, those who <<know only the outward appearance of the worldly life, while they are heedless of the Hereafter>>. By Allah, were it not for this saying (of Allah), we would have judged them blind concerning the outward appearance of the worldly life and the Hereafter, just as Allah judged them as lacking hearing despite their hearing, in His prohibitive saying, the Exalted: <<And be not like those who say, 'We hear,' but they do not hear>>. Despite the fact that they heard, He negated hearing from them. Similarly, the knowledge of these people concerning the outward appearance of life is only what their senses perceive of sensible matters, because The Real is not their hearing nor their sight.\n\nLet us now mention the sciences contained within this station, if Allah wills. Among them is the science of the thirst of the Cosmos that accepts no quenching from the Knowledge of Allah. And in it is the science of the reliance of this knowledge—which this thirst granted—upon the Presence of Gathering (حضرة الجمع) which contains the very essence of Separation (الفرقة).\n\nAnd in it is the science of what is attained through remembrance (الذكر): Is it the knowledge of what one forgot, or merely its likeness, not its essence, due to a similarity in form? For a person was knowledgeable of a matter, then forgot it due to the demands of his manifestation, so the form of his knowledge concerning that known thing was not preserved for him. Then he remembered it afterwards. Is what he witnessed in his remembrance the very essence of what he forgot, or its likeness? For time has changed for him, despite the resemblance of one time to another. You know that the essence of yesterday is not the essence of today, nor the essence of tomorrow, despite their resemblance in form. So, to which category does the knowledge of remembrance belong? If it is the very essence, then who preserved it until he remembered it? And where is the treasury of its preservation? Is it within the forgetful person, and we do not know? Or does it have another place where it is preserved during the time of his forgetfulness? If he remembers, it would be the very Theophany of that knowledge to him. Thus, The Real would be its treasury, the Preserver of it, and the Manifestor of it, even through the remembrance of this forgetful person. If the matter is not so, then he is not remembering what he forgot, but rather learning new knowledge similar to his first knowledge. The renewal occurred only in the Theophany that granted him the remembrance of what he forgot. This is a wondrous issue in the science of the servant forgetting his Lord at certain times due to his preoccupation with himself or with something in the Cosmos, and then remembering Him. This forgotten thing (the Lord) does not accept renewal; rather, He is His very Essence. From this, you understand the science of remembering what you forgot.\n\nAnd in it is the science of Divine Alteration (البدا), and whether this attribute is impossible for Allah or not. From this perspective, many people denied Divine Abrogation (النسخ) in matters and laws, and many affirmed it, though not on the basis of Divine Alteration. We have followed a middle path in the science of Abrogation. We neither affirmed Divine Alteration nor denied Abrogation. Rather, we considered it the termination of the duration of the ruling in Allah’s Knowledge, since no ruling from Allah was revealed stating that it was eternal or running until a specific term, and then was lifted before that term arrived. For this reason, we followed this method concerning it.\n\nAnd in it is the science of one who appears in a station other than his own, in the form of another, even making himself a counterpart or an example of the one whose form that is, in order to cause confusion. What is Allah’s ruling concerning one whose attribute is this, and what is the description that should be applied to him?\n\nAnd in it is the science of the wisdom concerning matters that necessitate precedence and matters that necessitate delay, whether by the rule of certainty or by the rule of choice.\n\nAnd in it is the science of the station of those who draw lessons (المعتبرين) from their consideration, and from where this error crept into them, despite the soundness of the consideration itself—for there is no error in it, but the error lies in the observers, and the distinction of their ranks in this regard. This is a rare science, for not every observer places the consideration in its proper place. And is the object of consideration (المعتبر) established by The Real, established merely for the sake of consideration specifically, so that it has no intrinsic permanence except as long as it serves as a lesson? If the attribute of being a lesson is removed from it by the Cosmos, does its existence cease? Or is it intrinsically established and does not vanish, whether the observer considers it or not, or whether consideration ceases from the Cosmos, as it ceases in the Hereafter upon residence in the two abodes?\n\nAnd in it is the science of the ignorant person’s denial of the Gnostic: From where does he deny him? Is it from a Presence, or an essential existential Attribute, or from an imagination (تخيل) that has no external existence in reality, but only in the presence of the denier’s imagination? For the Gnostic’s denial of the ignorant person is not the same form as the ignorant person’s denial of the Gnostic, even if they both agree on the act of denial. And is there truly anything in the Cosmos that should be denied or not? And what is denial, and what is its reality? Is it an existential matter or a relation?\n\nAnd in it is the science of rivalry (التنافس): From where did it appear in the Cosmos, and why does it only appear within the same species? Is the imitation of the Divine (التشبه بالإله) of this category? If so, what is the genus that unites Creation (الخلق) and The Real (الحق)? Is it the Form upon which the Perfect Human was created and attained? Or does this particular human only rival the Human who perpetually preserves the Form of The Real within himself, who is His shadow? Does this particular human desire to attain the rank of that Human who is the shadow of the Divine Form? Or is the Form of The Real nothing but the very essence of this Human whom we expressed as the shadow, and The Real is the spirit of that Form? Thus, The Real would possess a form and a spirit, just as He manifests in the Hereafter, where He is both denied and recognized. For Allah did not mention that Theophany in vain—I mean, in the Messenger’s mention of it in this worldly life—He only mentioned it to alert hearts to seek the knowledge of that from Allah.\n\nAnd in it is the science of the treasuries of Compassion (الرحموت), not merely Mercy (الرحمة).\n\nAnd in it is the science of Mercy based on the granting of favor, and based on the station by which the rule of Divine Wrath (الغضب الإلهي) was lifted from the Cosmos, and based on the station from which the creation of what is beneficial to the Cosmos proceeds. By all this, I mean the world of moral responsibility (عالم التكليف). From this station, those who speak of the necessity of observing what is most beneficial (الأصلح) concerning The Real have spoken.\n\nAnd in it is the science of ascent (الترقي) in the science of causes: Does it end or not end? And is ascent itself a cause, so that one ascends within it and by means of it?\n\nAnd in it is the science of spiritual trials and great battles, and for whom the victory and manifestation will be, and where the matter of these trials will end.\n\nAnd in it is the science of the resemblance of the cosmos to the cosmos, and its degrees. Among these is praiseworthy resemblance, such as the resemblance of our world of moral responsibility to the world of glorification (عالم التسبيح)—which is everything in the Cosmos that glorifies Allah with praise—and the resemblance of the human being to his predecessors in noble character. And among these is blameworthy resemblance. As for resemblance to The Real, that is the desired resemblance according to most of the People of Allah (أهل الله). But according to us, resemblance to Allah is not valid. None of the philosophers affirmed it except those who lack gnosis (معرفة) of the matter as it is in itself.\n\nAnd in it is the science of the distinction between His saying, the Exalted: <<Then He breathed into it another time>> (referring to the second blast), and His saying, the Exalted: <<There is no pause for it>> (referring to the first blast). He used singular and dual. What is the place of the dual in relation to the place of the singular, or how is the matter?\n\nAnd in it is the science of the conclusion (الخاتمة) in the state (الحال) before its occurrence: Is that a conclusion concerning the one who knows it, or not? And is the knowledge of that among the glad tidings (البشرى) of which Allah said: <<For them are glad tidings in the worldly life>>? Or does this have one form, and the glad tidings have another form? For the Prophet, peace and blessings be upon him, gave glad tidings of Paradise to a group, and they lived a long time afterwards, unlike the glad tidings given to the dying person.\n\nAnd in it is the science of created power (القوة الحادثة) and its fragmentation among created things. Is there any created thing that took all of it, or is that inconceivable? And what is its measure in relation to Divine Power (القوة الإلهية)? Is it one part out of so many parts of it, or not? For Divine Power is the locus of all possibilities (الممكنات) absolutely, while created power is the locus of some possibilities. If you enumerate the species of the possible Cosmos and name what the power holds of the possibilities, you will know with certainty the measure of that in relation to Divine Power.\n\nAnd in it is the science of the distinction between universal subjugation (التسخير العالم) and specific subjugation (التسخير الخاص). And is the fact that The Real is <<Every day He is in a [new] affair>> and <<We shall attend to you>> from the science of subjugation and its category, or is it from another reality? For the Master, in the form of the state, attends to what is needed by those after Him. This is a subtle subjugation that grants perfection to the Master. For it is not the station of the servant to subjugate his Master. The station of the servant is to be subjugated under his Master’s subjugation in two ways: subjugation by the command of his Master, and subjugation by himself, intrinsically, by virtue of being a servant. And sometimes he is subjugated to others besides his Master—to those who resemble his Master or those who resemble himself—through various means. Among these is his subjugation to that other by the command of his Master; among them is by way of chivalry towards the one subjugated to him; and among them is by habit, due to the continuation of subjugation upon him by virtue of being a servant, so that it becomes a custom that rules him, and he is subjugated to others besides his Master by the rule of habit, neither by chivalry nor by the Master’s command.\n\nAnd in it is the science of the view of the entire Cosmos toward this human being: Does it look upon him as a vicegerent (خليفة), or does it look upon him in terms of the trusts he holds for it, so that he may render them to it? Thus, he is sent by The Real by the rule of compulsion (جبر), not by the rule of choice (اختيار), because he was fundamentally created only for the glorification of his Creator.\n\nAnd in it is the science of that by which Divine Providence (العناية الإلهية) falls upon the servant, and the station and knowledge that this attention grants.\n\nAnd in it is the science of summarization and detailed explanation.\n\nAnd in it is a subtle science: that Adam, peace be upon him, gave sixty years of his life to David (داود) when he saw his form among his brothers and loved him. David accepted this. Adam later denied what he had given. David’s heart was broken by this, so Allah compensated him with a mention that He did not grant Adam. Concerning Adam, He said: <<Indeed, I will place upon the earth a vicegerent>>. He did not specify him by name, nor did He combine for him the address pronoun with that by which He honored him. He did not say to him, \"And I taught you all the Names.\" But concerning the vicegerency of David, He said: <<O David, indeed We have made you a vicegerent upon the earth>>. Thus, He named him.\n\nWhen Allah knew that such a station and attention would engender rivalry toward his father Adam—for he is, in any case, a human being from whom human actions proceed—and none knew the measure of this except the Messenger of Allah, peace be upon him. He said: \"I am only a human being; I become angry as humans become angry\"—meaning for himself and for the right of others—\"and I am pleased as humans are pleased\"—meaning for himself and for others. This was part of the Divine discipline with which his Lord disciplined him in what He revealed to him, saying: <<Say, 'I am only a human being like you'>>—meaning, the rule of humanity applies to you as it applies to him.\n\nWhen Allah intended to discipline David for the rivalry that the mention by which Allah named him would engender toward his father, especially since his father had previously denied the favor he bestowed upon him, given that the human being, <<when good touches him, is withholding>>. However, Adam only denied what he denied because of his knowledge of his own rank, since Allah made him the locus for the knowledge of the Divine Names (الأسماء الإلهية), by which the angels did not praise Allah, and which was not granted after him except to Muhammad, peace and blessings be upon him—this is the knowledge alluded to as the comprehensive words (جوامع الكلم). Adam knew that David, during the period of life he gave him, could only worship Allah according to his own perfection, which is undoubtedly lower than Adam’s rank, due to the prostration of the angels and the Names Adam was taught. So Adam requested that the lifespan he had generously given to his son David, peace be upon him, be returned to him, so that he might perform worship to Allah during that time commensurate with the loftiness of his rank above his son David and others—worship that David could not perform. If he performed that worship during that specific time, he would bestow upon his son David the reward that such worship, coming from someone like Adam, would yield. Had he left that period for David, he would not have attained the rank of this recompense. And Adam, peace be upon him, received from Allah the rank of reward for one who prefers others over himself, for he would receive a reward of this kind that he would not have attained had he not initially left that period for David. Just as He loved him in the grasp when He gave him the years He gave him, so too, out of His love, He returned to that matter to grant him the reward for the action performed by Adam during that period, though David had no knowledge of this.\n\nWhen Allah compensated him by mentioning his name in the vicegerency, He said to him—due to the aforementioned possibility of rivalry inherent in the nature of this manifestation—<<Do not follow [personal] caprice (الهوى), lest it lead you astray from the path of Allah (سبيل الله)>>. Thus, He warned him, and that warning preoccupied him from rejoicing in Allah’s designation of him by name. However, he had already experienced joy and taken his share of it before the time of <<Do not follow caprice, lest it lead you astray from the path of Allah>>—not from Allah Himself—reached him. So, He commanded him to observe the Path. Then Allah disciplined him further by saying: <<Indeed, those who go astray from the path of Allah will have a severe punishment because they forgot>>. He did not say: \"If you go astray from the path of Allah, you will have a severe punishment.\" This is a noble science.\n\nIn this station, the People of Unveiling (أصحاب الكشف) know that it is not the reality of Unveiling (الكشف) that the one unveiled to should know everything in every form. Rather, it is according to what The Real wills: He veils from him what He wills and informs him of what He wills. It is not incumbent upon the one unveiled to have his sight penetrate every form that manifests to him. Rather, that form, whose nature he does not know, stands before him in the position of the density of the form, preventing human sense perception from grasping what is contained within the essence of that form which the sight perceived. At another time, Unveiling grants him knowledge of what that person spoke within his heart—which is speech upon the passing thought—based on specific knowledge and Unveiling, not based on reprimand, conjecture, or coincidence.\n\nAnd in it is the science of what sustains Divine Gentleness toward the Cosmos.\n\nAnd in it is the science of the wisdom of the existence of the Cosmos.\n\nAnd in it is the science of the reasons for revelation.\n\nAnd in it is the science of bestowal (الوهب) and acquisition (الكسب).\n\nAnd in it is the science of the matter in which the servant stands in the place of his Master.\n\nAnd in it is the science of observing the causes that granted goodness to the one who considered them.\n\nAnd in it is the science of the Substitutes (الإبدال)—that is, the science of the forms that the Substitute perceives in his own form wherever he wills, with knowledge from him. His station is the station of Jesus, peace be upon him, in his saying: <<And peace is upon me the day I was born and the day I die and the day I am raised alive>>. And the science of the forms that The Real establishes as a substitute for the form of the one being substituted for, wherever The Real wills, without the knowledge of the one being substituted for. His station in this is the station of John (يحيى), peace be upon him, in Allah’s saying: <<And peace was upon him the day he was born and the day he dies and the day he is raised alive>>. And which of the two stations is more complete and higher? And the fact that John was not given <<any namesake before>> him, and his distinction of slaughtering Death on the Day of Resurrection.\n\nAnd in it is the science of the reason that prompts the human being to seek singularity in what is most complete and highest, and superiority over others.\n\nAnd in it is the science of the lifting of decrees (المقادير): Are they lifted in reality, or is their lifting invalid? Rather, are they lifted only concerning the one for whom they are lifted, while they remain decreed with Allah without the Cosmos being aware of it?\n\nAnd in it is the science that everything a human being knows is merely remembrance, not the beginning of knowledge, and that all knowledge is already with him, but he forgot it.\n\nAnd in it is the science of the manner of the domination of the Jinn over humans and humans over the Jinn. Is the domination of the Jinn over humans outward or inward? Or is it outward only for some people, while the inward is protected? Or how is the matter? The same applies to the domination of humans over the Jinn, except that humans have no domination except over the outward appearance of the Jinn, unless a human spiritualizes himself and his meaning becomes subtle, such that he appears in a form subtler than the forms of the Jinn. He then permeates the inward of the Jinn with his essence, just as the Jinn permeate the inward of humans. The Jinn then remains ignorant of this, imagining that it is a ruling from his own self, when it is the ruling of this spiritualized human. I have not seen anyone draw attention to this type of knowledge, and Allah the Exalted informed me of it. I do not know whether those of my kind who preceded me knew it but did not mention it, or not.\n\nAnd in it is the science of the remedy by which the human being removes the effect the Jinn left upon him during their domination.\n\nAnd in it is the science of what is unveiled to him after this effect departs from him.\n\nAnd in it is the science of the emanation (صدور) of Multiplicity (الكثرة) from the One (الواحد). Did the Oneness of Multiplicity (أحدية الكثرة) emanate from the One, or did Multiplicity itself emanate?\n\nAnd in it is the science that what emanates from the Source is permitted to possess the ruling of the Source. If this is established, then the world of moral responsibility tends toward rest. For The Real caused the Cosmos to emanate from Sunday until Friday, and then entered the Day of Eternity, which is Saturday. Saturday is rest, and it is the seventh of the days, which has no end. The Creator was not touched by any weariness in His creation of what He created. But Saturday was the day of completion concerning the strata of the Cosmos. The creation from Allah that remains is in the states needed by this Cosmos, whose eternity does not end and whose duration does not expire.\n\nAnd in it is the science of the manifestation of the angels.\n\nAnd in it is the science of the manifestation of the human being, his rank, and what he possesses of the Divine Presence (الحضرة الإلهية). And by what means is the superiority among the individuals of this species determined? Is it by the manifestation itself, or by the accidents that he accepts?\n\nAnd in it are other sciences besides these, but we aimed at the most important ones to alert hearts to them. And Allah <<speaks the Truth, and He guides to the way>>.",
    "ur": "باب تین سو چھیالیس: اس منزل کے راز کی معرفت میں جس میں بعض عارفین نے سچائی پائی اور دیکھا کہ اس منزل کے اطراف سے اس کا نور کیسے پھوٹتا ہے، اور یہ منزل حضرات محمدیہ (الحضرات المحمدیۃ) میں سے ہے۔\n\nمجھے اس معصوم پر تعجب ہے جسے کہا جاتا ہے کہ پیروی کر،\nاور خود سے ابتدا نہ کر، اور اسی کے مطابق حکم دے جو اللہ نے نازل کیا۔\nاور معصوم کو کیسے دیکھا جاتا ہے کہ وہ وحی کے باوجود خواہش (ہویٰ) سے حکم کرتا ہے،\nجبکہ تحقیق میں وہاں اس (ذات حق) کے سوا کچھ نہیں۔\nپس عالمِ خلق میں ہر خواہش (ہویٰ) ساقط ہے،\nجب عارفِ وقت کی آنکھیں دیکھتی ہیں۔\nلیکن یہ ایک رمز ہے اور اس کی چمک (سنا) کو کوئی نہیں پا سکتا،\nاور حالِ وقت کا شاہد اس سے اندھا ہے۔\nاور جو معنی میں نے مراد لیا اور بیان کیا،\nاسے صرف بردبار اور آہ و زاری کرنے والا ہی جانتا ہے۔\nخبردار! ہر کائنات ایک محقق لفظ کا حرف ہے،\nاور تمہاری نسبت اس حرف کے معنی سے ہے۔\n\n### اجسام (الأجسام) اور اجساد (الأجساد) کے درمیان فرق\n\nجان لو کہ یہ منزل توحید اور انوار کی منازل میں سے ہے، اور اللہ تعالیٰ نے مجھے اس میں دو مرتبہ داخل کیا، اور اسی منزل میں میں نور بن گیا۔\nجیسا کہ نبی اکرم صلی اللہ علیہ وسلم نے اپنی دعا میں فرمایا:\nواجعلني نورا (اور مجھے نور بنا دے)۔\nاور اسی منزل سے میں نے اجسام (الأجسام) اور اجساد (الأجساد) کے درمیان فرق جانا۔ اجسام (الأجسام) وہ ہیں جو عام طور پر معروف ہیں، ان کے لطیف، شفاف اور کثیف حصے، جو نظر آتے ہیں اور جو نظر نہیں آتے۔ اور اجساد (الأجساد) وہ ہیں جن میں ارواح بیداری میں اجسام کی صورتوں میں ظاہر ہوتی ہیں، اور وہ صورتیں جنہیں سونے والا اپنی نیند میں اجسام سے مشابہت کی حالت میں محسوس کرتا ہے، حالانکہ وہ بذاتِ خود اجسام نہیں ہیں۔\n\n### کہ عالم میں انسان کامل (الإنسان الکامل) کا مرتبہ انسان میں نفس ناطقہ (النفس الناطقۃ) کا مرتبہ ہے۔\n\nاور جان لو کہ عالم میں انسان کامل (الإنسان الکامل) کا مرتبہ انسان میں نفس ناطقہ (النفس الناطقۃ) کا مرتبہ ہے۔ پس وہ کامل جس سے بڑھ کر کوئی کامل نہیں، وہ محمد صلی اللہ علیہ وسلم ہیں۔ اور انسانوں میں ان کاملین کا مرتبہ جو اس کمال کی انتہا سے نیچے ہیں جو عالم کی غایت ہے، وہ انسان میں روحانی قوتوں (القوی الروحانیۃ) کا مرتبہ ہے، اور وہ انبیاء علیہم الصلوٰۃ والسلام ہیں۔ اور عالم میں ان لوگوں کا مرتبہ جو کمال میں ان کے درجے سے نیچے ہیں، وہ انسان میں حسی قوتوں (القوی الحسیۃ) کا مرتبہ ہے، اور وہ ورثاء (اولیاء) رضی اللہ عنہم ہیں۔ اور جو لوگ شکل میں انسان کی صورت پر باقی ہیں، وہ حیوانات کے زمرے میں سے ہیں، پس وہ انسان میں حیوانی روح (الروح الحیوانی) کے مرتبے میں ہیں جو نشوونما اور احساس عطا کرتی ہے۔\n\nاور جان لو کہ آج عالم، محمد صلی اللہ علیہ وسلم کی روحاً، جسماً، صورتاً اور معنیٰ کے اعتبار سے جامعیت کے فقدان کی وجہ سے، سویا ہوا ہے، مردہ نہیں۔ اور ان کی روح جو کہ محمد صلی اللہ علیہ وسلم ہیں، عالم میں اس محل کی صورت میں ہیں جس میں انسان کی روح نیند کے وقت ہوتی ہے، یہاں تک کہ قیامت کا دن آ جائے جو یہاں سونے والے کے جاگنے کی مانند ہے۔ اور ہم نے محمد صلی اللہ علیہ وسلم کے بارے میں خاص طور پر یہ اس لیے کہا کہ وہ عالم میں نفس ناطقہ (النفس الناطقۃ) کی حیثیت سے روح ہیں، کیونکہ کشف (الکشف) نے ہمیں یہی عطا کیا، اور آپ صلی اللہ علیہ وسلم کا یہ فرمان کہ آپ لوگوں کے سردار ہیں۔\n\nاور عالم، لوگوں میں سے ہے، کیونکہ وہ جسم میں انسان کبیر (الإنسان الکبیر) ہے اور تسویہ اور تعدیل میں مقدم ہے تاکہ اس سے محمد صلی اللہ علیہ وسلم کی نشأت کی صورت ظاہر ہو، جیسا کہ اللہ نے انسان کے جسم کو اس کی روح کے وجود سے پہلے تسویہ اور تعدیل بخشی، پھر اس میں اپنی روح سے روح پھونکی جس سے وہ ایک کامل انسان بنا، اور اس کے ذریعے اسے اس کی خلقت عطا کی، اور وہ اس کا نفس ناطقہ (النفس الناطقۃ) ہے۔ پس آپ صلی اللہ علیہ وسلم کی نشأت کے ظہور سے پہلے عالم تسویہ اور تعدیل کی حالت میں تھا، جیسے ماں کے پیٹ میں جنین، اور اس کی حرکت اس کی حیوانی روح کے ذریعے تھی جس سے اسے زندگی حاصل تھی۔ پس جو کچھ میں نے تمہیں بتایا ہے اس میں اپنی فکر کو بلند کرو۔ پس جب قیامت ہو گی تو عالم آپ صلی اللہ علیہ وسلم کی مکمل نشأت کے ظہور سے زندہ ہو جائے گا، جس کی قوتیں پوری ہوں گی، اور اہل نار جو اس کے اہل ہیں، وہ عالم کی انسانیت میں اس مرتبے پر ہوں گے جو انسان میں نشوونما پاتا ہے، پس وہ نہ موت سے متصف ہوں گے اور نہ زندگی سے۔ اور رسول اللہ صلی اللہ علیہ وسلم سے ان کے بارے میں یہی نص وارد ہوئی ہے کہ وہ اس میں نہ مریں گے اور نہ زندہ رہیں گے۔\n\nاور اللہ نے ان کے بارے میں فرمایا: لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ (وہ اس میں نہ مرے گا اور نہ زندہ رہے گا) [طٰہٰ: 74]۔ اور عالم میں فرشتے انسان کے خیال میں ظاہر ہونے والی صورتوں کی مانند ہیں، اور اسی طرح جنات بھی۔ پس عالم انسان کبیر (الإنسان الکبیر) نہیں ہے مگر انسان کامل (الإنسان الکامل) کے وجود سے جو اس کا نفس ناطقہ (النفس الناطقۃ) ہے۔ جیسا کہ انسان کی نشأت انسان نہیں بنتی مگر اپنے نفس ناطقہ (النفس الناطقۃ) سے، اور انسان کا یہ نفس ناطقہ کامل نہیں ہوتا مگر اس صورت الٰہیہ (الصورة الإلٰہیۃ) سے جس کی نص رسول صلی اللہ علیہ وسلم نے دی ہے۔ اسی طرح عالم کا نفس جو کہ محمد صلی اللہ علیہ وسلم ہیں، بقا اور صورتوں میں تنوع کے ساتھ صورت الٰہیہ (الصورة الإلٰہیۃ) کی تکمیل سے کمال کے درجے کو پہنچا، اور عالم کی بقا آپ ہی کے ذریعے ہے۔ پس تمہارے لیے واضح ہو گیا کہ آپ صلی اللہ علیہ وسلم کے ظہور سے پہلے عالم کی حالت مسویٰ کیے گئے جسد کی مانند تھی، اور آپ کی وفات کے بعد عالم کی حالت سونے والے کی مانند ہے، اور قیامت کے دن آپ کی بعثت کے ساتھ عالم کی حالت نیند کے بعد بیداری اور ہوشیاری کی مانند ہے۔\n\n### کہ انسان صورت الٰہیہ (الصورة الإلٰہیۃ) پر تھا۔\n\nاور جان لو کہ چونکہ انسان صورت الٰہیہ (الصورة الإلٰہیۃ) کا مثال ہے، جیسے کسی شخص کا سایہ جو کسی بھی حال میں اس سے جدا نہیں ہوتا، مگر یہ کہ کبھی حس کے لیے ظاہر ہوتا ہے اور کبھی چھپ جاتا ہے۔ پس جب وہ چھپ جاتا ہے تو وہ اس میں معقول ہوتا ہے، اور جب ظاہر ہوتا ہے تو دیکھنے والے کے لیے آنکھ سے مشہود ہوتا ہے۔ پس انسان کامل (الإنسان الکامل) حق میں معقول ہے، جیسے سایہ جب سورج میں چھپ جائے اور ظاہر نہ ہو۔ پس انسان ازل سے ابد تک رہا ہے، اور اسی لیے وہ حق کے لیے مشہود تھا کیونکہ وہ بصارت سے موصوف تھا۔ پھر جب اس سے سایہ پھیلا تو وہ اپنی صورت کے ساتھ ظاہر ہوا: أَ لَمْ تَرَ إِلى‏ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ ولَوْ شاءَ لَجَعَلَهُ ساكِناً (کیا تو نے اپنے رب کی طرف نہیں دیکھا کہ اس نے سائے کو کیسے پھیلایا؟ اور اگر وہ چاہتا تو اسے ساکن کر دیتا) [الفرقان: 45]۔ یعنی اسے اس میں ثابت کر دیتا جو اس کا سایہ ہے، پس وہ اسے نہ پھیلاتا، تو وجود حسی میں صرف اللہ کے لیے اس کی کوئی عین ظاہر نہ ہوتی۔ پس وہ ہمیشہ اللہ کے ساتھ رہا اور ہمیشہ اللہ کے ساتھ رہے گا، پس وہ اللہ کی بقا سے باقی ہے۔ اور انسان کامل (الإنسان الکامل) کے علاوہ جو کچھ ہے وہ اللہ کے باقی رکھنے سے باقی ہے۔ اور جب اللہ نے عالم کے جسم کو تسویہ بخشی، جو کہ ہباء (جوہرِ لطیف) کے معقول جوہر میں صوری کل جسم ہے، روح الٰہی کے فیضان سے پہلے جو ہمیشہ پھیلی ہوئی تھی مگر متعین نہیں تھی، کیونکہ وہاں کوئی متعین کرنے والا نہیں تھا، تو عالم کا جسم اس سے زندہ ہوا۔ پس جس طرح عالم کے جسم نے اپنی شخصیات کے اجسام کو شامل کیا، اسی طرح اس کی روح نے اپنی شخصیات کی ارواح کو شامل کیا: هُوَ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ واحِدَةٍ (وہی ہے جس نے تمہیں ایک جان سے پیدا کیا) [النساء: 1]۔ اور اسی بنا پر بعض نے کہا کہ روح نوعِ انسان کے اشخاص میں عین کے اعتبار سے ایک ہے، اور زید کی روح ہی عمرو کی روح ہے اور اس نوع کے باقی اشخاص کی۔ لیکن اس امر کے قائل نے اس میں اس امر کی صورت کو محقق نہیں کیا۔ کیونکہ جس طرح آدم کے جسم کی صورت ان کی ذریت کے ہر شخص کا جسم نہیں تھی، اگرچہ وہ اصل ہیں جس سے ہم ظاہر ہوئے اور پیدا ہوئے، اسی طرح پورے عالم کے جسم کو تدبیر کرنے والی روح ہے۔ جیسا کہ اگر تم زمین کو ہموار فرض کرو، لَا تَرَىٰ فِيهَا عِوَجًا وَلَا أَمْتًا (تو تم اس میں کوئی کجی اور بلندی نہیں دیکھو گے) [طٰہٰ: 107]، اور سورج اس پر پھیل جائے، تو وہ اپنے نور سے چمک اٹھے گا اور نور کا بعض حصہ بعض سے ممتاز نہیں ہو گا، اور نہ اس پر جزوی ہونے کا حکم لگے گا اور نہ تقسیم کا، اور نہ زمین پر۔ پھر جب شہر اور دیار ظاہر ہوئے اور ان کھڑی ہوئی شخصیات کے سائے نمودار ہوئے، تو شمسی نور تقسیم ہو گیا اور بعض حصہ بعض سے ممتاز ہو گیا، کیونکہ زمین میں یہ صورتیں عارض ہوئیں۔ پس جب تم اس پر غور کرو گے تو جان لو گے کہ جو نور اس منزل کے لیے خاص ہے وہ وہ نور نہیں ہے جو دوسری منزل کے لیے خاص ہے اور نہ دوسری منازل کے لیے۔ اور جب تم اس چیز پر غور کرو گے جس سے یہ نور ظاہر ہوا ہے، اور وہ اس کی عین ہے اس لحاظ سے کہ وہ اس سے پھوٹا ہے، تو تم کہو گے کہ ارواح ایک ہی روح ہیں، اور وہ صرف محلوں کے اختلاف سے مختلف ہوئیں، جیسے سورج کے انوار ایک ہی عین کا نور ہیں، مگر قبول کرنے والوں میں اختلاف کا حکم مختلف ہے، ان کے مزاجوں اور ان کی اشکال کی صورتوں کے اختلاف کی وجہ سے۔ اور جب مجھے یہ منزل پانچ سو اکیانوے ہجری میں عطا ہوئی اور میں اس میں مقیم ہوا، تو یہ میرے لیے دریا کے پانی کی مانند تھی، جس میں کوئی صورت ممتاز نہیں ہوتی، بلکہ وہ صرف پانی کی عین ہے۔ پھر جب اس میں سے پانی برتنوں میں ڈالا جاتا ہے تو اس وقت گھڑے کا پانی، مٹکے کا پانی اور کوزے کا پانی متعین ہو جاتا ہے، اور اس میں اس کے برتن کی شکل اور اس کے برتن کا رنگ ظاہر ہوتا ہے۔ پس برتن اس پر جزوی ہونے اور اشکال کا حکم لگاتے ہیں، حالانکہ تم جانتے ہو کہ وہ عین جو نہر میں تھا اور اس میں کوئی شکل ظاہر نہیں ہوئی تھی، وہی عین ہے جو ظاہر ہوا، اگر اس میں کوئی اور چیز نہ ہو۔ مگر دونوں صورتوں میں فرق یہ ہے کہ برتنوں کا پانی اور منازل کے انوار جب ختم ہو جاتے ہیں تو وہ اصلی نور اور اصلی نہر کی طرف لوٹ جاتے ہیں۔\n\nاور نفس الامر میں بھی ایسا ہی ہے، اگر کوئی برتن باقی نہ رہے اور کوئی منزل باقی نہ رہے۔ کیونکہ جب اللہ نے ان انوار کی بقا کا ارادہ کیا اس تمیز کے ساتھ جو انہوں نے قبول کی تھی، تو اس نے ان کے لیے برزخی اجساد (أجساد برزخیۃ) پیدا کیے جن میں یہ ارواح ان دنیاوی اجسام سے نیند میں اور موت کے بعد منتقل ہونے پر ممتاز ہوئیں، اور آخرت میں ان کے لیے طبعی اجسام (أجسام طبیعیۃ) پیدا کیے، جیسا کہ دنیا میں ان کے لیے بنائے تھے، مگر مزاج مختلف ہے۔ پس اس نے انہیں برزخ کے جسد سے آخرت کی نشأت کے اجسام کی طرف منتقل کیا، تو وہ بھی اپنے اجسام کی صورتوں کے امتیاز کے حکم سے ممتاز ہو گئیں، پھر وہ ہمیشہ ہمیشہ کے لیے اسی طرح رہیں گی، اور کبھی بھی عینی وحدت کی پہلی حالت کی طرف نہیں لوٹیں گی۔ پس دیکھو اللہ کی صنعت کتنی عجیب ہے، الَّذِي أَتْقَنَ كُلَّ شَيْءٍ (جس نے ہر چیز کو مضبوط بنایا) [النمل: 88]۔ پس آج سارا عالم رسول اللہ صلی اللہ علیہ وسلم کی وفات کے وقت سے سویا ہوا ہے، وہ اپنے آپ کو دیکھتا ہے جہاں وہ محمد صلی اللہ علیہ وسلم کی صورت ہے، یہاں تک کہ وہ اٹھائے جائیں گے۔ اور ہم بحمد اللہ اس رات کے آخری تہائی حصے میں ہیں جس میں عالم سویا ہوا ہے۔ اور چونکہ حق کا ظہور (تجلی) رات کے آخری تہائی حصے میں ہوتا ہے، اور اس کا ظہور (تجلی) کامل ترین صورتوں میں فوائد، علوم اور کامل معرفتیں عطا کرتا ہے، کیونکہ یہ قریب ترین ظہور (تجلی) ہے، کیونکہ یہ آسمان دنیا میں ظہور (تجلی) ہے۔ پس اس امت کے آخر کا علم اس کے وسط اور اول کے علم سے زیادہ کامل تھا، رسول اللہ صلی اللہ علیہ وسلم کی وفات کے بعد۔ کیونکہ جب نبی صلی اللہ علیہ وسلم کو اللہ نے مبعوث کیا تو شرک قائم تھا اور کفر ظاہر تھا، پس انہوں نے پہلے قرن کو، جو صحابہ کا قرن تھا، صرف ایمان کی طرف بلایا، اور جو کچھ وہ پوشیدہ علم جانتے تھے اس میں سے ان کے لیے ظاہر نہیں کیا، اور ان پر قرآن کریم نازل کیا، اور اسے اس طرح ترجمہ کرنے والا بنایا جو اس قرن کے عوام کی سمجھ تک پہنچے۔ پس اس نے صورتیں بنائیں، تشبیہات دیں، اور محدثات کی صفات سے نعت بیان کی، اور اپنے خالق کی صفت میں جو کچھ کہا اسے ایک حسی، مسویٰ اور معتدل صورت کے مقام پر قائم کیا، پھر اس خطابی صورت میں روح پھونکی تاکہ نشأت کا کمال ظاہر ہو، پس وہ روح لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں) [الشوریٰ: 11] تھی، اور سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ (تیرا رب، عزت کا رب، ان چیزوں سے پاک ہے جو وہ بیان کرتے ہیں) [الصافات: 180]۔ اور قرآن میں ہر تسبیح کی آیت خطاب کی نشأت کی صورت کی روح ہے، پس سمجھو، کیونکہ یہ ایک عجیب راز ہے۔ پس پہلے قرن کے خواص کے لیے، نہ کہ عوام کے لیے، بلکہ ان کے بعض خواص کے لیے، تنزیہ کے خطاب کے پیچھے عظیم اسرار ظاہر ہوئے، اس کے باوجود وہ اس میں اس امت کے متاخرین کے درجے تک نہیں پہنچے، کیونکہ انہوں نے انہیں قرآن کے حروف اور نبوی اخبار کے مواد سے لیا، پس وہ اس میں ان لوگوں کے مرتبے میں تھے جو رات کے شروع میں سونے سے پہلے باتیں کرتے ہیں۔ پھر جب اس رات کے تہائی حصے کا وقت آیا، اور وہ وہ وقت ہے جس میں ہم ہیں، یہاں تک کہ فجر، یعنی قیامت اور بعثت کی فجر، اور حشر و نشر کا دن طلوع ہو جائے، تو حق نے اس رات کے تہائی حصے میں ظہور (تجلی) فرمایا، اور وہ ہمارا زمانہ ہے۔ پس اس نے اپنے ظہور (تجلی) سے دلوں میں ایسے علوم، اسرار اور معرفتیں عطا کیں جو اخبار کے حروف عطا نہیں کرتے، کیونکہ اس نے انہیں غیر مواد میں عطا کیا، بلکہ معانی مجردہ کی صورت میں۔ پس وہ علم میں زیادہ کامل تھے، اور پہلا قرن عمل میں زیادہ کامل تھا۔ اور ایمان کے لحاظ سے وہ برابر ہیں۔ کیونکہ یہ نشأت حسد پر فطرت کی گئی، اور ان میں ان کی جنس کا نبی مبعوث کیا گیا، پس اس پر صرف وہی ایمان لایا جو اپنے نفس کو اس حسد، برتری کی محبت اور اس پر حکم کیے جانے سے نفرت کو دور کرنے پر قادر تھا، خاص طور پر جب حکم کرنے والا اس کی جنس کا ہو۔ وہ کہتا ہے کہ اس نے مجھ پر کس چیز سے فضیلت پائی کہ وہ مجھ پر اپنی مرضی سے حکم کرے؟ پس صحابہ میں سے مومن کو ایمان میں وہ قوت منسوب کی جاتی ہے جو اس شخص کو منسوب نہیں کی جاتی جسے اپنی جنس کے آگے بڑھنے کا مشاہدہ نہ ہو۔ پس ان کا حسد کی قوت کے غلبے کو دفع کرنے میں مشغول رہنا، جو انہیں کفر کا حکم دے سکتا تھا، انہیں علوم کے اسرار اور حق کے بندوں میں پوشیدہ اسرار کو سمجھنے سے روکتا تھا۔ اور انہیں رسول کی صورت اور جو کچھ وہ لائے تھے اس کے غیب پر ایمان کا مرتبہ حاصل نہیں ہوا، کیونکہ وہ انہیں اور جو کچھ وہ لائے تھے اس کی صورت کو مشاہدہ کر رہے تھے۔ پس جب ہمارا زمانہ آیا اور ہم نے سیاہی میں لکھے ہوئے کاغذات اور منقول اخبار پائے، اور ہم نے ان پر ابتدائی قبولیت پائی جسے ہم اپنے نفوس سے دفع نہیں کر سکتے تھے، جب اللہ نے ہمیں توفیق دی، تو ہم نے جانا کہ ایمان کے نور کی قوت نے یہ عطا کیا، اور ہم نے کوئی تردد نہیں پایا اور نہ ہی ہم نے قرآن میں لکھی ہوئی یا اخبار میں منقول چیزوں کی صحت پر کوئی آیت یا دلیل طلب کی۔ پس ہم نے قطعی طور پر اس ایمان کی قوت کو جانا جو اللہ نے اپنی عنایت سے ہمیں عطا کیا، اور ہم اس حالت میں غیب پر ایمان لانے والے تھے جس میں صحابہ کا کوئی درجہ اور قدم نہیں تھا، جیسا کہ ہمیں اس ایمان میں کوئی قدم حاصل نہیں تھا جس نے مشاہدے کے وقت حسد کے غلبے کو مغلوب کیا۔ پس ہم نے اس قوت کا مقابلہ اس قوت سے کیا، تو وہ برابر ہو گئے، اور علم میں فضیلت باقی رہی، کیونکہ ہم نے اسے اس مبارک رات کے ظہور (تجلی) سے حاصل کیا جس سے اس کے تہائی حصے کے اہل نے کامیابی حاصل کی، جس میں اس رات کے گزرے ہوئے دو تہائی حصوں کا کوئی حصہ نہیں ہے۔\n\n### بے شک اللہ کا ظہور (التجلی) رات کے آخری تہائی حصے میں ہوتا ہے۔\n\nپھر اس کی تسبیح کا ان جزوی راتوں کے آخری تہائی حصے میں ظہور (تجلی) جو نیا پن عطا کرتا ہے، اس کے اس قول میں ہے کہ:\nإِنَّ رَبَّنَا يَنْزِلُ كُلَّ لَيْلَةٍ فِي الثُّلُثِ الْأَخِيرِ مِنْهَا إِلَى السَّمَاءِ الدُّنْيَا فَيَقُولُ هَلْ مِنْ تَائِبٍ هَلْ مِنْ مُسْتَغْفِرٍ هَلْ مِنْ سَائِلٍ حَتَّى يَنْصَدِعَ الْفَجْرُ (بے شک ہمارا رب ہر رات کے آخری تہائی حصے میں آسمان دنیا کی طرف نازل ہوتا ہے اور فرماتا ہے: کیا کوئی توبہ کرنے والا ہے؟ کیا کوئی مغفرت طلب کرنے والا ہے؟ کیا کوئی سوال کرنے والا ہے؟ یہاں تک کہ فجر پھٹ جائے) [حدیث]۔\nپس ہم نے اس نزول اور جو کچھ وہ عطا کرتا ہے اس میں متقدمین کے ساتھ شرکت کی، مگر یہ ایک منقطع ظہور (تجلی) ہے۔ اور اس رات کے تہائی حصے کا ظہور (تجلی) جس کے آخری تہائی حصے میں ہم ہیں، اور وہ رسول اللہ صلی اللہ علیہ وسلم کی وفات کے وقت سے لے کر قیامت کے دن تک ہے، اس تہائی حصے میں کسی متقدم نے ہمارے ساتھ شرکت نہیں کی۔ پس جب اس کی فجر طلوع ہو گی، اور وہ قیامت کی فجر ہے، تو ظہور (تجلی) منقطع نہیں ہو گا، بلکہ ہمارے لیے اس کا ظہور (تجلی) متصل ہو جائے گا، پس وہ ہماری آنکھوں سے اوجھل نہیں ہو گا۔ پس ہم دنیاوی اور اخروی، اور عام اور خاص، غیر منقطع اور غیر محجوب ظہور (تجلی) کے درمیان ہیں۔ اور زمانی راتوں میں فجر کا طلوع اسے حجاب میں لے لیتا ہے۔ پس ہم نے وہ سب حاصل کیا جو انہوں نے ان راتوں میں حاصل کیا، اور ہم نے اس مبارک رات کے تہائی حصے کے ظہور (تجلی) سے کامیابی حاصل کی جس میں اس کے اہل کے علاوہ کسی کا حصہ نہیں ہے۔\nیہ ان کے دلوں کو تسلی دینے کے لیے ہے جب انہوں نے رسول صلی اللہ علیہ وسلم کے مشاہدے کو کھو دیا، اور یہ ان کے لیے بہتر تھا، کیونکہ وہ نہیں جانتے کہ مشاہدے کے وقت ان کے احوال کیسے ہوتے، کیا حسد ان پر غالب آتا یا وہ اسے مغلوب کرتے؟ فَكَفَى اللَّهُ الْمُؤْمِنِينَ الْقِتَالَ وَكَانَ اللَّهُ قَوِيًّا عَزِيزًا (پس اللہ نے مومنوں کو لڑائی سے کفایت کی، اور اللہ قوی اور غالب ہے) [الاحزاب: 25]۔ پس اے ولی! اس انسانی صورت میں اپنی منزلت کو پہچان لو جس کی روح اور نفس ناطقہ (النفس الناطقۃ) محمد صلی اللہ علیہ وسلم ہیں، کیا تم اس کی قوتوں میں سے ہو یا اس کی قوتوں کے محلوں میں سے؟ اور اگر تم اس کی قوتوں میں سے ہو تو کیا تم اس کی بصارت ہو یا اس کی سماعت یا اس کی سونگھنے کی حس یا اس کی چھونے کی حس یا اس کا ذائقہ؟ کیونکہ میں، اللہ کی قسم، جان چکا ہوں کہ میں اس صورت کی قوتوں میں سے کون سی قوت ہوں، اس پر اللہ کا شکر ہے۔ اور اے ولی! یہ گمان نہ کرنا کہ اس صورت میں ہماری منزلت کا حسی قوتوں (القوی الحسیۃ) کے مرتبے سے خاص ہونا، بلکہ حیوان کی قوتوں کے مرتبے سے خاص ہونا، یہ روحانی قوتوں (القوی الروحانیۃ) کے مرتبے سے ہماری کمی ہے، ایسا گمان نہ کرنا، بلکہ یہ کامل ترین قوتیں ہیں، کیونکہ ان کے لیے اسم الوہاب (الوہاب) ہے، کیونکہ یہی وہ ہیں جو روحانی قوتوں کو وہ چیزیں عطا کرتی ہیں جن میں وہ تصرف کرتی ہیں اور جن سے ان کی علمی زندگی ہوتی ہے، جیسے قوتِ خیال، فکر، حفظ، تصور اور عقل، اور یہ سب ان حسی قوتوں کے مواد سے ہیں۔ اور اسی لیے\n\nاللہ تعالیٰ نے اپنے ان بندوں کے بارے میں جن سے وہ محبت کرتا ہے، فرمایا: كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ (میں اس کا کان بن جاتا ہوں جس سے وہ سنتا ہے، اور اس کی آنکھ بن جاتا ہوں جس سے وہ دیکھتا ہے) [حدیث قدسی]۔\nاور اس نے محسوس صورت کا ذکر کیا، اور روحانی قوتوں میں سے کسی چیز کا ذکر نہیں کیا، اور نہ ہی اپنے آپ کو ان کے مرتبے پر نازل کیا، کیونکہ ان کا مرتبہ حواس کی محتاجی کا مرتبہ ہے، اور حق اس مرتبے پر نازل نہیں ہوتا جو غیر کا محتاج ہو، اور حواس اللہ کے محتاج ہیں نہ کہ کسی اور کے۔ پس وہ اس کے لیے نازل ہوا جو اس کا محتاج ہے اور اس کے ساتھ کسی کو شریک نہیں کرتا، پس اس نے انہیں غنا عطا کیا، پس ان سے اور ان کے ذریعے لیا جاتا ہے، اور وہ خود دوسری قوتوں سے نہیں لیتیں مگر اللہ سے۔ پس حس کے شرف اور اس کی قدر کو پہچان لو، اور یہ کہ وہ عین حق ہے، اور اسی لیے آخرت کی نشأت حس اور محسوس کے وجود کے بغیر کامل نہیں ہوتی، کیونکہ وہ حق کے بغیر کامل نہیں ہوتی۔ پس حسی قوتیں (القوی الحسیۃ) حقیقت میں اس نشأت کی زمین پر اللہ کے خلفاء ہیں۔ کیا تم نہیں دیکھتے کہ وہ سبحانہ اپنے آپ کو سمیع، بصیر، متکلم، حی، عالم، قادر، مرید ہونے سے کیسے موصوف کرتا ہے؟ اور یہ سب صفات ہیں جن کا اثر محسوس میں ہوتا ہے، اور انسان اپنے اندر ان قوتوں کے قیام کو محسوس کرتا ہے۔ اور اس نے سبحانہ اپنے آپ کو عاقل، مفکر یا متخیل ہونے سے موصوف نہیں کیا، اور روحانی قوتوں میں سے اس نے صرف وہی باقی رکھا جس میں حس کی شرکت ہے، اور وہ حافظ (حفظ کرنے والا) اور مصور (صورت بنانے والا) ہے۔ کیونکہ حس کا حفظ اور تصویر میں اثر ہوتا ہے۔ پس اگر شرکت نہ ہوتی تو حق ان دونوں سے اپنے آپ کو موصوف نہ کرتا۔ پس وہ حافظ (الحافظ) اور مصور (المصور) ہے۔ پس یہ دو صفات روحانی اور حسی ہیں۔ پس اس چیز پر توجہ دو جس پر ہم نے تمہیں متنبہ کیا ہے، تاکہ تمہارا دل نہ ٹوٹے جب میں نے تمہیں حسی قوتوں کے مرتبے پر نازل کیا، تمہارے نزدیک حس کی کمتری اور عقل کے شرف کی وجہ سے۔ پس میں نے تمہیں بتا دیا کہ سارا شرف حس میں ہے، اور تم اپنے امر اور اپنی قدر سے جاہل رہے۔ پس اگر تم اپنے نفس کو جان لیتے تو اپنے رب کو جان لیتے، جیسا کہ تمہارے رب نے تمہیں جانا اور عالم کو اپنے نفس کے علم سے جانا، اور تم اس کی صورت ہو، پس تمہیں اس علم میں اس کے ساتھ شریک ہونا ضروری ہے، پس تم اسے اپنے نفس کے علم سے جانو۔ اور یہ ایک نکتہ ہے جو رسول اللہ صلی اللہ علیہ وسلم سے ظاہر ہوا،\n\nجہاں آپ نے فرمایا: من عرف نفسه عرف ربه (جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا) [حدیث]۔\nکیونکہ حق کا عالم کے بارے میں علم اس کے اپنے نفس کا علم ہے۔ اور یہ اللہ تعالیٰ کے اس قول کے مماثل ہے: سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنفُسِهِمْ (ہم انہیں عنقریب اپنی نشانیاں آفاق میں اور ان کے نفوس میں دکھائیں گے) [فصلت: 53]۔ پس اس نے دو نشأتوں کا ذکر کیا: آفاق کے ساتھ عالم کی صورت کی نشأت، اور اس کی روح کی نشأت اپنے قول \"وَفِي أَنفُسِهِمْ\" سے۔ پس وہ ایک ہی انسان ہے جس کی دو نشأتیں ہیں، حَتَّى يَتَبَيَّنَ لَهُمْ (یہاں تک کہ دیکھنے والوں کے لیے واضح ہو جائے) أَنَّهُ الْحَقُّ (کہ وہ حق ہے) [فصلت: 53]، یعنی جو دیکھنے والا دیکھتا ہے وہ حق ہے نہ کہ کوئی اور۔ پس اے ولی! دیکھو کہ رسول اللہ صلی اللہ علیہ وسلم اپنی امت پر کتنے مہربان تھے، اور انہوں نے انہیں کتنی اچھی تعلیم دی، اور ان کے لیے کتنے اچھے راستے کھولے۔ وہ کتنے اچھے معلم اور راستہ کھولنے والے تھے۔ اللہ ہمیں ان لوگوں میں شامل کرے جو ان کے راستے پر چلے یہاں تک کہ ان کے درجے سے ملحق ہو جائیں، آمین، اپنی عزت کے ساتھ۔ پس اگر تم صاحبِ فطانت ہو تو ہم نے تمہاری طرف اشارہ کر دیا ہے کہ امر کیا ہے، بلکہ ہم نے اس کی صراحت کر دی ہے، اور ہم نے اس میں وہ سب کچھ برداشت کیا جو ہم پر ان اندھوں کی طرف سے منسوب کیا جاتا ہے جو اس بات کا انکار کرتے ہیں جس کی طرف ہم نے اس مسئلے میں اشارہ کیا ہے، جو يَعْلَمُونَ ظَاهِرًا مِّنَ الْحَيَاةِ الدُّنْيَا وَهُمْ عَنِ الْآخِرَةِ هُمْ غَافِلُونَ (دنیا کی زندگی کا صرف ظاہری پہلو جانتے ہیں، اور وہ آخرت سے غافل ہیں) [الروم: 7]۔ اور اللہ کی قسم! اگر یہ قول نہ ہوتا تو ہم ان پر دنیاوی زندگی کے ظاہر اور آخرت میں بھی اندھے ہونے کا حکم لگاتے، جیسا کہ اللہ نے ان پر سننے کے باوجود نہ سننے کا حکم لگایا، اپنے اس قول میں جو منع کرتا ہے: وَلَا تَكُونُوا كَالَّذِينَ قَالُوا سَمِعْنَا وَهُمْ لَا يَسْمَعُونَ (اور ان لوگوں کی طرح نہ ہو جاؤ جنہوں نے کہا کہ ہم نے سنا، حالانکہ وہ نہیں سنتے) [الانفال: 21]۔ حالانکہ انہوں نے سنا تھا، مگر ان سے سماعت کی نفی کر دی گئی۔ اور اسی طرح ان لوگوں کا دنیاوی زندگی کے ظاہر کا علم ہے، صرف ان محسوس چیزوں کا جو ان کے حواس کو ادراک ہوتی ہیں، کیونکہ حق تعالیٰ نہ ان کی سماعت ہے اور نہ ان کی بصارت۔ پس ہم ان شاء اللہ ان علوم کا ذکر کریں گے جو یہ منزل اپنے اندر رکھتی ہے۔ ان میں سے ایک علم عالم کی پیاس (عطش العالم) کا ہے جس کے ساتھ اللہ کے علم سے سیرابی قبول نہیں ہوتی۔ اور اس میں اس علم کا علم ہے جو اس پیاس کو جمع کی حضرہ (حضرة الجمع) سے حاصل ہوتا ہے جس میں عینِ فرقہ ہے۔ اور اس میں اس علم کا علم ہے کہ ذکر سے جو حاصل ہوتا ہے کیا وہ بھولی ہوئی چیز کا علم ہے یا اس کی مثال ہے نہ کہ عین، کیونکہ صورت میں شبہ ہے۔ کیونکہ وہ کسی امر کو جانتا تھا، پھر اپنی نشأت کی وجہ سے اسے بھول گیا، پس اس معلوم کے بارے میں اس کے علم کی صورت اس پر محفوظ نہ رہی، پھر اس کے بعد اسے یاد کیا۔ پس کیا جو کچھ اس نے اپنے ذکر میں مشاہدہ کیا وہ وہی عین ہے جسے وہ بھول گیا تھا یا اس کی مثال ہے؟ کیونکہ زمانہ اس پر مختلف ہو چکا ہے، حالانکہ زمانہ کا بعض حصہ بعض سے مشابہ ہے۔ پس تم جانتے ہو کہ کل کی عین آج کی عین نہیں ہے اور نہ کل کی عین، حالانکہ وہ صورت میں اس سے مشابہ ہے۔ پس ذکر کا علم کس قبیل سے ہے؟ اگر وہ وہی عین ہے تو کس نے اسے محفوظ رکھا یہاں تک کہ اس نے اسے یاد کیا؟ اور اس کے حفظ کا خزانہ کہاں ہے؟ کیا وہ بھولنے والے میں ہے اور ہم نہیں جانتے، یا اس کے لیے کوئی اور جگہ ہے جہاں وہ اس کے بھولنے کے زمانے میں محفوظ رہتا ہے؟ پس جب وہ یاد کرتا ہے تو وہ اس علم کے ظہور (تجلی) کی عین ہوتا ہے، پس حق اس کا خزانہ ہوتا ہے اور وہی اسے محفوظ رکھنے والا اور اس پر ظہور (تجلی) کرنے والا ہوتا ہے یہاں تک کہ یہ بھولنے والا اسے یاد کرے۔ اور اگر معاملہ ایسا نہیں ہے، تو وہ بھولی ہوئی چیز کو یاد کرنے والا نہیں ہے، بلکہ وہ ایک نیا علم سیکھنے والا ہے جو اس کے پہلے علم کے مماثل ہے۔ اور تجدید صرف اس ظہور (تجلی) میں واقع ہوئی جس نے اسے بھولی ہوئی چیز کا ذکر عطا کیا۔ اور یہ ایک عجیب مسئلہ ہے اس علم میں کہ بندہ اپنے رب کو بعض اوقات بھول جاتا ہے، اپنے نفس یا عالم کی کسی چیز میں مشغول ہونے کی وجہ سے، پھر اسے یاد کرتا ہے۔ اور یہ بھولی ہوئی چیز ایسی ہے جو تجدید قبول نہیں کرتی بلکہ وہ اس کی عین ہے۔ پس یہاں سے تم بھولی ہوئی چیز کو یاد کرنے کا علم جانو گے۔ اور اس میں بداء (البداء) کا علم ہے، اور کیا یہ صفت اللہ پر محال ہے یا نہیں؟ اور اسی بنا پر بعض نے امور اور شرائع میں الٰہی نسخ (منسوخ کرنا) کا انکار کیا، اور اس کے انکار کے قائل بہت سے لوگ ہیں، جیسا کہ اس کے اقرار کے قائل بھی بہت سے لوگ ہیں، بداء (البداء) کے پہلو سے نہیں۔ اور ہم نے علمِ نسخ میں دو طریقوں کے درمیان کا راستہ اختیار کیا، پس نہ ہم نے بداء (البداء) کا قول کیا اور نہ ہی ہم نے نسخ کی نفی کی، اور ہم نے اسے اللہ کے علم میں حکم کی مدت کا اختتام قرار دیا، کیونکہ اللہ کی طرف سے کوئی ایسا حکم نہیں آیا جس میں یہ ذکر ہو کہ وہ ہمیشہ کے لیے ہے یا ایک معین مدت تک جاری رہے گا، پھر اس مدت کے پہنچنے سے پہلے اسے اٹھا لیا گیا۔ اسی لیے ہم نے اس میں یہ طریقہ اختیار کیا۔ اور اس میں اس شخص کا علم ہے جو اپنی منزلت کے علاوہ کسی اور کی صورت میں ظاہر ہوا یہاں تک کہ اس نے اپنے آپ کو اس شخص کی صورت کا مشابہ یا مثال بنا لیا تاکہ التباس پیدا کرے، اس شخص کے بارے میں اللہ کا کیا حکم ہے جس کی یہ صفت ہے، اور اس کی کیا نعت ہے جو اس پر اطلاق ہونی چاہیے؟ اور اس میں ان امور میں حکمت کا علم ہے جو جزم کے حکم سے یا اختیار کے حکم سے تقدیم عطا کرتے ہیں اور وہ امور جو تاخیر عطا کرتے ہیں۔ اور اس میں غور کرنے والوں کے اعتبار کا علم ہے، اور یہ لغزش ان پر کہاں سے آئی، حالانکہ اعتبار بذاتِ خود صحیح ہے، کیونکہ اس میں کوئی لغزش نہیں ہے، بلکہ لغزش غور کرنے والوں میں ہے، اور اس میں ان کے طبقات کا امتیاز ہے۔ اور یہ ایک عزیز علم ہے، کیونکہ ہر غور کرنے والا اعتبار کو اس کی جگہ پر قائم نہیں کرتا۔ اور کیا جس میں غور کیا جاتا ہے، باء کے فتحہ کے ساتھ، جسے حق نے نصب کیا ہے، کیا اسے صرف غور کے لیے ہی نصب کیا ہے، پس اس کے نفس میں کوئی قرار نہیں ہو گا مگر جب تک وہ عبرت رہے، پس جب عالم سے اعتبار کی صفت اٹھ جائے گی تو اس کا وجود بھی اٹھ جائے گا؟ یا وہ اپنے نفس میں مقرر ہے، زائل نہیں ہوتا، خواہ غور کرنے والا اس پر غور کرے یا نہ کرے، یا عالم سے اعتبار زائل ہو جائے، جیسا کہ آخرت میں دونوں گھروں میں قیام کے وقت زائل ہو جائے گا؟ اور اس میں جاہل کا عالم پر انکار کا علم ہے، اس نے اس پر کہاں سے انکار کیا؟ کیا کسی حضرہ (حضرۃ) سے یا کسی وجودی صفت سے جو اس کی عین میں ہے، یا کسی ایسے تخیل سے جس کا باہر سے کوئی وجود نہیں ہے، بلکہ منکر کے خیال کی حضرہ (حضرۃ) میں ہے؟ کیونکہ عالم کا جاہل پر انکار، جس کا جاہل اس پر انکار کرتا ہے، اس کی صورت جاہل کے عالم پر انکار کی صورت کیا ہے، اگرچہ وہ انکار میں جمع ہو جائیں؟ اور کیا حقیقت میں عالم میں کوئی ایسی چیز ہے جس کا انکار کیا جائے یا نہیں؟ اور انکار کیا ہے اور اس کی حقیقت کس چیز پر ہے؟ کیا وہ کوئی وجودی امر ہے یا نسبت؟ اور اس میں تنافس (باہمی مقابلہ) کا علم ہے، یہ عالم میں کہاں سے ظاہر ہوا، اور یہ صرف جنس میں ہی کیوں ظاہر ہوتا ہے؟ اور کیا الٰہ سے تشبہ اسی قبیل سے ہے؟ اگر ایسا ہے تو خلق اور حق کے درمیان جامع جنس کیا ہے؟ کیا وہ صورت ہے جو انسان کامل (الإنسان الکامل) کو حاصل ہوئی جس پر وہ پیدا کیا گیا، یا یہ جزوی انسان صرف اس انسان سے مقابلہ کرتا ہے جو ہمیشہ حق کی صورت کو اپنے نفس میں محفوظ رکھتا ہے جو اس کا سایہ ہے؟ پس یہ جزوی انسان اس انسان کا مرتبہ حاصل کرنا چاہتا ہے جو صورت الٰہیہ (الصورة الإلٰہیۃ) کا سایہ ہے؟ یا حق کی صورت صرف اسی انسان کی عین ہے جسے ہم نے سایہ سے تعبیر کیا، اور حق اس صورت کی روح ہے؟ پس حق صورت اور روح والا ہو گا، جیسا کہ وہ آخرت میں ظہور (تجلی) کرے گا، پس وہ انکار کرے گا اور پہچانے گا۔ کیونکہ اللہ نے اس ظہور (تجلی) کا ذکر بے فائدہ نہیں کیا، یعنی نبی صلی اللہ علیہ وسلم کے اس دنیاوی زندگی میں اس کے ذکر میں۔ پس اس نے اس کا ذکر صرف اس لیے کیا تاکہ دلوں کو اللہ سے اس کا علم طلب کرنے پر متنبہ کرے۔ اور اس میں رحمت (الرحموت) کے خزانوں کا علم ہے نہ کہ رحمت (الرحمۃ) کا۔ اور اس میں اس رحمت کا علم ہے جو انعام عطا کرنے پر اور اس مقام پر مستند ہے جس سے عالم سے الٰہی غضب کا حکم اٹھا لیا گیا، اور اس مقام پر جو عالم کے لیے اصلاح کا سبب بننے والی چیز کی تخلیق کا سبب بنتا ہے، اور میں اس سب سے عالمِ تکلیف کو مراد لیتا ہوں۔ اور اسی مقام سے وہ لوگ بولے جنہوں نے حق کے حق میں اصلح کی رعایت کو واجب قرار دیا۔ اور اس میں اسباب کے علم میں ترقی کا علم ہے، کیا وہ ختم ہوتی ہے یا ختم نہیں ہوتی؟ اور کیا ترقی ایک سبب ہے جس میں اور جس کے ذریعے ترقی کی جاتی ہے؟ اور اس میں فتنوں اور معنوی جنگوں کا علم ہے، اور ان میں غلبہ اور ظہور کس کے لیے ہو گا، اور ان فتنوں کا انجام کہاں تک پہنچے گا؟ اور اس میں عالم کا عالم سے تشبہ اور اس کے طبقات کا علم ہے۔ پس ان میں سے وہ تشبہ ہے جو محمود ہے، جیسے ہم میں سے عالمِ تکلیف کا عالمِ تسبیح سے تشبہ، اور وہ ہر چیز ہے جو عالم میں اللہ کی حمد کے ساتھ تسبیح کرتی ہے، اور انسان کا اپنے سے پہلے والوں سے اخلاقِ حسنہ میں تشبہ۔ اور ان میں سے وہ تشبہ ہے جو مذموم ہے۔ اور حق سے تشبہ، وہ تشبہ ہے جو اکثر اہل اللہ کے نزدیک مطلوب ہے، اور نافلہ کے نزدیک صحیح نہیں ہے۔\n\nاللہ سے تشبہ، اور حکماء میں سے صرف اسی نے اس کا قول کیا جسے امر کی معرفت نہیں ہے جیسا کہ وہ اپنے نفس میں ہے۔ اور اس میں اللہ تعالیٰ کے اس قول کے درمیان فرق کا علم ہے: ثُمَّ نُفِخَ فِيهِ أُخْرَىٰ (پھر اس میں دوسری بار پھونکا جائے گا) [الزمر: 68]، اور اس کے اس قول کے درمیان: مَّا لَهَا مِن فَوَاقٍ (اس کے لیے کوئی واپسی نہیں) [ص: 15]۔ پس اس نے واحد کا ذکر کیا اور تثنیہ کا، پس تثنیہ کا محل افراد کے محل سے کیا ہے، یا امر کیسا ہے؟ اور اس میں حال میں خاتمہ (الخاتمۃ) کا علم ہے، اس کے ہونے سے پہلے، کیا یہ اس کے عالم کے حق میں خاتمہ ہے یا نہیں؟ اور کیا اس کا علم اس بشارت میں سے ہے جس کے بارے میں اللہ نے فرمایا: لَهُمُ الْبُشْرَىٰ فِي الْحَيَاةِ (ان کے لیے دنیا کی زندگی میں بشارت ہے) [یونس: 64]، یا اس کی ایک صورت ہے اور بشارت کی دوسری صورت ہے؟\n\nکیونکہ نبی صلی اللہ علیہ وسلم نے ایک جماعت کو جنت کی بشارت دی اور وہ اس کے بعد ایک طویل عرصے تک زندہ رہے،\nبرخلاف محتضر کی بشارت کے۔ اور اس میں حادث قوت اور محدثات میں اس کے جزوی ہونے کا علم ہے، اور کیا کوئی محدث ہے جس نے اسے مکمل طور پر لے لیا ہے یا یہ تصور نہیں کیا جا سکتا؟ اور الٰہی قوت سے اس کی مقدار کیا ہے؟ کیا یہ اس کے اتنے اتنے حصوں میں سے ایک حصہ ہے یا نہیں؟\nکیونکہ الٰہی قوت کا محل مطلق ممکنات ہیں، اور حادث قوت کا محل بعض ممکنات ہیں۔ پس جب تم عالمِ ممکن کی انواع کو محدود کرو گے اور ممکنات میں قوت کے لیے جو کچھ ہے اسے نامزد کرو گے، تو تم قطعی طور پر الٰہی قوت سے اس کی مقدار جان لو گے۔ اور اس میں عالم کی تسخیر اور خاص تسخیر کے درمیان فرق کا علم ہے۔ اور کیا حق کا کُلَّ يَوْمٍ هُوَ فِي شَأْنٍ (وہ ہر دن ایک نئی شان میں ہے) [الرحمن: 29] اور سَنَفْرُغُ لَكُمْ (اور ہم عنقریب تمہاری طرف متوجہ ہوں گے) [الرحمن: 31]، کیا یہ تسخیر کے علم اور اس کے باب سے ہے یا کسی دوسری حقیقت سے؟ کیونکہ سردار حال کی صورت میں اس چیز کو پورا کرتا ہے جس کی اس کے بعد والے کو ضرورت ہوتی ہے، پس یہ ایک دقیق تسخیر ہے جو سردار میں کمال عطا کرتی ہے۔ کیونکہ بندے کا مرتبہ یہ نہیں ہے کہ وہ اپنے سردار کو مسخر کرے، اور بندے کا مرتبہ یہ ہے کہ وہ اپنے سردار کی تسخیر کے تحت مسخر ہو، دونوں حالتوں میں، اپنے سردار کے حکم سے تسخیر اور اپنی ذات سے تسخیر، کیونکہ وہ بندہ ہے۔ اور کبھی وہ اپنے سردار کے علاوہ دوسروں کے لیے مسخر ہوتا ہے، جیسے اپنے سردار کی مثالوں کے لیے اور اپنی مثالوں کے لیے، مختلف طریقوں سے۔ ان میں سے وہ ہے کہ اس کی تسخیر اس دوسرے کے لیے اپنے سردار کے حکم سے ہوتی ہے، اور ان میں سے وہ ہے جو مسخر کیے جانے والے کے ساتھ مروت کے طریقے سے ہوتی ہے، اور ان میں سے وہ ہے جو عادت کی وجہ سے ہوتی ہے، تسخیر کو جاری رکھنے کی وجہ سے کہ وہ بندہ ہے، پس یہ اس کی عادت بن گئی جو اس پر حکم کرتی ہے، پس وہ عادت کے حکم سے اپنے سردار کے علاوہ دوسروں کے لیے مسخر ہوتا ہے، نہ کہ مروت سے اور نہ ہی سردار کے حکم سے۔ اور اس میں پورے عالم کا اس انسان کی طرف دیکھنے کا علم ہے، کیا وہ اسے خلیفہ ہونے کے ناطے دیکھتا ہے یا اس کے پاس موجود امانتوں کے لحاظ سے دیکھتا ہے تاکہ وہ انہیں اس تک پہنچا دے؟ پس وہ حق کی طرف سے جبر کے حکم سے بھیجا گیا ہے نہ کہ اختیار کے حکم سے، کیونکہ وہ اصلاً صرف اپنے خالق کی تسبیح کے لیے پیدا کیا گیا ہے۔ اور اس میں اس چیز کا علم ہے جس سے بندے کے لیے الٰہی عنایت واقع ہوتی ہے، اور وہ اعتناء اسے کیا منزلت اور علم عطا کرتا ہے۔ اور اس میں اجمال اور تفصیل کا علم ہے۔ اور اس میں ایک دقیق علم ہے، اور وہ یہ کہ آدم علیہ السلام نے داؤد کو اپنی عمر سے ساٹھ سال دیے جب انہوں نے اپنے بھائیوں کے درمیان ان کی صورت دیکھی اور ان سے محبت کی، پس داؤد نے اسے قبول کر لیا۔ پھر آدم نے بعد میں اس چیز کا انکار کر دیا جو انہوں نے دی تھی، پس اس پر داؤد کا دل ٹوٹ گیا، تو اللہ نے انہیں ایک ذکر سے تسلی دی جو آدم کو نہیں دیا گیا تھا۔\n\nپس آدم کے بارے میں فرمایا: إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً (میں زمین میں ایک خلیفہ بنانے والا ہوں) [البقرۃ: 30]، اور ان کا نام لے کر انہیں متعین نہیں کیا، اور نہ ہی ان کے لیے مخاطب کے آلے اور اس چیز کو جمع کیا جس سے انہیں شرف بخشا، پس یہ نہیں کہا کہ \"اور میں نے تمہیں تمام نام سکھائے\"۔ اور داؤد کی خلافت کے بارے میں فرمایا: يَا دَاوُودُ إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي الْأَرْضِ (اے داؤد! بے شک ہم نے تمہیں زمین میں خلیفہ بنایا ہے) [ص: 26]، پس ان کا نام لیا۔ پس جب اللہ نے جان لیا کہ ایسا مقام اور اعتناء ان کے والد آدم پر نفاس (حسد) پیدا کرے گا، کیونکہ وہ بہرحال بشر ہیں، ان سے وہی ہو گا جو بشر سے ہوتا ہے، اور اس کی قدر صرف رسول اللہ صلی اللہ علیہ وسلم نے جانی،\n\nجہاں آپ نے فرمایا: إِنَّمَا أَنَا بَشَرٌ أَغْضَبُ كَمَا يَغْضَبُ الْبَشَرُ (میں صرف ایک بشر ہوں، میں غصہ کرتا ہوں جیسا کہ بشر غصہ کرتے ہیں) [حدیث]، یعنی اپنے نفس کے لیے اور دوسروں کے حق کے لیے، وَأَرْضَى كَمَا يَرْضَى الْبَشَرُ (اور میں راضی ہوتا ہوں جیسا کہ بشر راضی ہوتے ہیں)، یعنی اپنے نفس کے لیے اور دوسروں کے لیے۔ اور یہ اس الٰہی تادیب میں سے تھا جس سے ان کے رب تعالیٰ نے انہیں ادب سکھایا، جو ان کی طرف وحی کی، پس ان سے فرمایا: قُلْ إِنَّمَا أَنَا بَشَرٌ مِّثْلُكُمْ (کہہ دو کہ میں تو تمہاری طرح کا ایک بشر ہوں) [الکہف: 110]، یعنی بشریت کا حکم تم میں اس کے حکم میں ہے۔ پس جب اللہ نے داؤد کو ادب سکھانا چاہا، اس نفاس کی وجہ سے جو اس نشأت کی فطرت میں ہے، جو اس ذکر سے پیدا ہوتا ہے جس سے اللہ نے ان کا نام لیا، خاص طور پر جب ان کے والد کی طرف سے ان کے حق میں وہ کچھ ہو چکا تھا جو انہوں نے دی ہوئی چیز کے انکار کی صورت میں ہوا، کیونکہ انسان إِذَا مَسَّهُ الْخَيْرُ مَنُوعًا (جب اسے بھلائی پہنچتی ہے تو وہ روکنے والا ہوتا ہے) [المعارج: 21]۔ مگر آدم نے جو انکار کیا وہ صرف اس لیے کیا کہ وہ اپنے مرتبے کو جانتے تھے، جہاں اللہ نے انہیں اسماء الٰہیہ کے علم کا محل بنایا تھا، جن سے فرشتوں نے اللہ کی ثنا نہیں کی تھی، اور ان کے بعد صرف محمد صلی اللہ علیہ وسلم کو عطا کیے گئے، اور وہ وہ علم ہے جسے جوامع الکلم (جامع کلمات) سے کنایہ کیا گیا ہے۔ پس آدم نے جانا کہ داؤد اس مدت میں جو انہوں نے انہیں اپنی عمر سے دی تھی، اللہ کی عبادت صرف اپنے کمال کے مطابق کر سکتے ہیں، اور وہ آدم سے مرتبے میں بلاشبہ کم ہیں، فرشتوں کے سجدے اور ان اسماء کے علم کی وجہ سے۔ پس آدم نے چاہا کہ وہ عمر انہیں حاصل ہو جو انہوں نے اپنے بیٹے داؤد علیہ السلام کو دی تھی، تاکہ وہ اس میں اللہ کی عبادت اپنے مرتبے کی بلندی کے مطابق کریں، جو ان کے بیٹے داؤد اور دوسروں سے بلند ہے، اور داؤد وہ عبادت نہیں کر سکتے۔ پس جب وہ اس معین زمانے میں وہ عبادت کریں گے، تو وہ اپنے بیٹے داؤد کو اس عبادت کا اجر عطا کریں گے جو آدم جیسے شخص سے واقع ہوتی ہے، اور اگر وہ مدت داؤد کے لیے چھوڑ دی جاتی تو انہیں اس جزا کا مرتبہ حاصل نہ ہوتا۔ اور آدم علیہ السلام کو اللہ کی طرف سے اس پر اس شخص کی جزا کا مرتبہ حاصل ہوا جس نے اپنے نفس پر دوسرے کو ترجیح دی، کیونکہ انہیں اس جزا کا مثل جاری ہوتا ہے جو انہیں حاصل نہ ہوتا اگر وہ مدت داؤد کے لیے نہ چھوڑتے۔ پس جس طرح انہوں نے قبضے میں ان سے محبت کی جب انہیں اپنی عمر سے وہ کچھ دیا جو دیا، اسی طرح اپنی محبت کی وجہ سے انہوں نے اس سے رجوع کیا تاکہ انہیں اس مدت میں آدم سے ہونے والے عمل کی جزا عطا ہو، اور داؤد کو اس کا علم نہیں تھا۔ پس جب اللہ نے خلافت میں ان کا نام لے کر انہیں تسلی دی، تو اس نفاس کے داخل ہونے کی وجہ سے جو اس نشأت کی طبیعت میں ہے، جس کا ہم نے ذکر کیا، ان سے فرمایا: وَلَا تَتَّبِعِ الْهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ اللَّهِ (اور خواہش کی پیروی نہ کرنا، ورنہ وہ تمہیں اللہ کے راستے سے بھٹکا دے گی) [ص: 26]۔ پس انہیں خبردار کیا، تو اس خبرداری نے انہیں اس خوشی سے مشغول کر دیا جو انہیں اللہ کے نام سے ان کے تعین سے حاصل ہوئی تھی، لیکن انہیں خوشی حاصل ہوئی اور انہوں نے اس سے اپنا حصہ لے لیا اس سے پہلے کہ ان تک \"وَلَا تَتَّبِعِ الْهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ اللَّهِ\" کا وقت پہنچے۔ اللہ سے نہیں، بلکہ اللہ کے راستے سے۔ پس انہیں راستے کی نگرانی کا حکم دیا گیا۔ پھر اللہ نے ان کے ساتھ ادب سے پیش آیا جہاں فرمایا: إِنَّ الَّذِينَ يَضِلُّونَ عَن سَبِيلِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ بِمَا نَسُوا (بے شک وہ لوگ جو اللہ کے راستے سے بھٹکتے ہیں، ان کے لیے سخت عذاب ہے، اس لیے کہ وہ بھول گئے) [ص: 26]، اور یہ نہیں فرمایا کہ \"اگر تم اللہ کے راستے سے بھٹک گئے تو تمہارے لیے سخت عذاب ہے\"۔ اور یہ ایک شریف علم ہے۔ اور اس منزل میں اہل کشف (الکشف) کا یہ علم ہے کہ کشف (الکشف) کی حقیقت یہ نہیں ہے کہ مکاشف اسے ہر صورت میں جان لے، بلکہ یہ اس مقدار پر ہوتا ہے جو حق چاہتا ہے، پس وہ اس سے جو چاہتا ہے چھپا لیتا ہے اور جس پر چاہتا ہے اسے مطلع کر دیتا ہے۔ پس مکاشف کا کام یہ نہیں ہے کہ اس کی بصارت ہر اس صورت میں نافذ ہو جو اس پر ظاہر ہوتی ہے، بلکہ وہ صورت جو وہ نہیں جانتا، وہ اس کے لیے اس صورت کی کثافت کے مقام پر قائم ہوتی ہے کہ بشری حس اس چیز کو ادراک نہیں کر پاتی جو اس صورت کے نفس میں خطرہ کے طور پر موجود ہے جسے بصارت نے ادراک کیا۔ اور دوسرے وقت میں کشف (الکشف) اسے اس چیز سے عطا کرتا ہے جو اس شخص نے اس میں اپنے دل میں بات کی، اور وہ ایک معین علم اور کشف (الکشف) سے دل میں آنے والی بات ہوتی ہے، نہ کہ ڈانٹ ڈپٹ، نہ گمان اور نہ موافقت سے۔ اور اس میں اس چیز کا علم ہے جس سے عالم کے ساتھ الٰہی رفق (نرمی) باقی رہتی ہے۔ اور اس میں عالم کے وجود کی حکمت کا علم ہے۔ اور اس میں نزول کے اسباب کا علم ہے۔ اور اس میں وہب (عطا) اور کسب (حصول) کا علم ہے۔ اور اس میں اس امر کا علم ہے جس میں بندہ اپنے سردار کا مقام سنبھالتا ہے۔ اور اس میں ان اسباب کی رعایت کا علم ہے جنہوں نے ان کے صاحبِ نظر کو بھلائی عطا کی۔ اور اس میں ابدال (الإبدال) کا علم ہے، یعنی وہ صورتیں جنہیں بدل (البدل) اپنی صورت پر ادراک کرتا ہے جہاں وہ چاہتا ہے، اپنے علم سے، اور اس کی منزلت عیسیٰ علیہ السلام کی منزلت ہے، ان کے اس قول میں: وَالسَّلَامُ عَلَيَّ يَوْمَ وُلِدتُّ وَيَوْمَ أَمُوتُ وَيَوْمَ أُبْعَثُ حَيًّا (اور مجھ پر سلامتی ہے جس دن میں پیدا ہوا اور جس دن میں مروں گا اور جس دن میں زندہ اٹھایا جاؤں گا) [مریم: 33]۔ اور ان صورتوں کا علم جنہیں حق اس شخص کی صورت کے بدلے میں قائم کرتا ہے جس کے بدلے میں وہ قائم کی جاتی ہیں، جہاں حق چاہتا ہے، اس شخص کے علم کے بغیر جس کے بدلے میں وہ قائم کی جاتی ہیں، اور اس میں ان کی منزلت یحییٰ علیہ السلام کی منزلت ہے، اللہ کے اس قول میں: وَسَلَامٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوتُ وَيَوْمَ يُبْعَثُ حَيًّا (اور اس پر سلامتی ہے جس دن وہ پیدا ہوا اور جس دن وہ مرے گا اور جس دن وہ زندہ اٹھایا جائے گا) [مریم: 15]۔ اور ان دونوں مقامات میں سے کون سا کامل اور اعلیٰ ہے؟ اور یحییٰ کا یہ ہونا کہ لَمْ نَجْعَل لَّهُ مِن قَبْلُ سَمِيًّا (ہم نے اس سے پہلے اس کا ہم نام نہیں بنایا) [مریم: 7]، اور قیامت کے دن موت کو ذبح کرنے کے ساتھ ان کا خاص ہونا۔ اور اس میں اس سبب کا علم ہے جو انسان کو کامل اور اعلیٰ میں انفرادیت اور دوسروں پر برتری طلب کرنے کی دعوت دیتا ہے۔ اور اس میں مقادیر کے اٹھائے جانے کا علم ہے، کیا وہ نفس الامر میں اٹھائے جاتے ہیں یا ان کا اٹھایا جانا صحیح نہیں ہے، اور وہ صرف اس شخص کے حق میں اٹھائے جاتے ہیں جس کے حق میں وہ اٹھائے جاتے ہیں، اور وہ اللہ کے نزدیک مقدر ہیں جہاں عالم کو اس کا شعور نہیں ہوتا۔ اور اس میں یہ علم ہے کہ ہر وہ چیز جو انسان جانتا ہے وہ صرف تذکر (یاد کرنا) ہے نہ کہ علم کی ابتدا، اور یہ کہ ہر علم اس کے پاس ہے لیکن وہ اسے بھول گیا ہے۔ اور اس میں جنات کا انسانوں پر اور انسانوں کا جنات پر تسلط کی صورت کا علم ہے، اور کیا جنات کا انسانوں پر تسلط ظاہری ہے یا باطنی، یا وہ صرف ایک قوم کے حق میں ظاہری ہے اور باطن معصوم ہے، یا امر کیسا ہے؟ اور اسی طرح انسانوں کا جنات پر تسلط کے بارے میں بھی یہی قول ہے، مگر یہ کہ انسانوں کو جنات کے ظاہر پر ہی تسلط حاصل ہے، سوائے ان انسانوں کے جو روحانیت اختیار کر لیتے ہیں اور ان کا معنیٰ لطیف ہو جاتا ہے یہاں تک کہ وہ جنات کی صورتوں سے بھی زیادہ لطیف صورت میں ظاہر ہوتے ہیں، پس وہ اپنی ذات سے جنات کے باطن میں اسی طرح سرایت کرتے ہیں جیسے جنات انسانوں کے باطن میں سرایت کرتے ہیں، پس جن اسے نہیں جانتا اور یہ خیال کرتا ہے کہ یہ اس کے نفس کا حکم ہے، حالانکہ یہ اس روحانیت اختیار کرنے والے انسان کا حکم ہے۔ اور میں نے کسی کو نہیں دیکھا جس نے اس قسم کے علم پر متنبہ کیا ہو، اور اللہ تعالیٰ نے مجھے اس پر مطلع کیا ہے۔ پس میں نہیں جانتا کہ کیا مجھ سے پہلے میری جنس کے کسی شخص نے اسے جانا اور ذکر نہیں کیا یا نہیں؟ اور اس میں اس دوا کا علم ہے جس سے انسان اس اثر کو زائل کرتا ہے جو جنات نے اس پر اپنے تسلط میں ڈالا ہے۔ اور اس میں اس علم کا علم ہے جو اس اثر کے زائل ہونے کے بعد اس پر منکشف ہوتا ہے۔ اور اس میں واحد سے کثرت کے صدور کا علم ہے، اور کیا واحد سے کثرت کی احدیت صادر ہوئی یا کثرت؟ اور اس میں مصدر سے صادر ہونے والے کا علم ہے کہ وہ مصدر کا حکم رکھنے کی اجازت دیتا ہے۔ پس اگر یہ ثابت ہو جائے تو عالمِ مکلف راحت کی طرف لوٹ جائے گا۔ کیونکہ حق نے عالم کو اتوار کے دن سے جمعہ کے دن تک پیدا کیا، اور ابد کا دن، یعنی ہفتہ کا دن، داخل ہو گیا، اور ہفتہ راحت کا دن ہے، اور وہ دنوں میں سے ساتواں دن ہے جس کا کوئی اختتام نہیں ہے۔ اور خالق کو اپنی تخلیق میں کوئی تھکاوٹ نہیں پہنچی، جو اس نے پیدا کیا، لیکن ہفتہ کا دن عالم کے طبقات سے فراغت کا دن تھا، اور اللہ کی طرف سے تخلیق باقی رہی اس چیز میں جس کی اس عالم کو ضرورت ہے، ان احوال میں جن کا ابد ختم نہیں ہوتا اور جن کی مدت پوری نہیں ہوتی۔ اور اس میں فرشتوں کی نشأت کا علم ہے۔ اور اس میں انسان کی نشأت اور اس کے مرتبے کا علم ہے، اور الٰہی حضرہ (الحضرۃ الإلٰہیۃ) میں اس کے لیے کیا ہے، اور اس نوع کے اشخاص کی فضیلت کس چیز سے ہوتی ہے؟ کیا نشأت سے یا ان اعراض سے جو وہ قبول کرتے ہیں؟ اور اس میں اس کے علاوہ بھی علوم ہیں، لیکن ہم نے اہم سے اہم کی طرف قصد کیا تاکہ دلوں کو اس پر متنبہ کریں، وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے) [الاحزاب: 4]۔",
    "fa": "باب سیصد و چهل و ششم در معرفت منزل سرّ صدق که برخی از عارفان در آن صادق بودند و نور آن را دیدند که چگونه از جوانب آن منزل ساطع می‌شود، و این منزل از حضرات محمدیه (الحضرات المحمدية) است.\n\nشگفتم از معصومی که به او گفته می‌شود پیروی کن *** و آغازگر مباش و به آنچه خداوند نازل کرده حکم کن.\nو چگونه معصوم دیده می‌شود که با وجود وحی و تحقیق، به هویٰ (هوس) حکم می‌کند، در حالی که جز او (الحق) چیزی نیست.\nپس هر هویٰ (هوس) در عالم خلق ساقط است *** اگر چشمان عارف زمان به آن بنگرد.\nاما او (الحق) رمزی است و شکوه (سنا) درک نمی‌شود *** و شاهد حال زمان، او را از آن کور کرده است.\nو معنایی را که قصد کرده‌ام و بیان نموده‌ام *** جز بردبار و آه کشنده (أواه) نمی‌داند.\nآگاه باشید که هر کونی حرفی از لفظ محقق است *** و نسبت شما از آن حرف، معنای آن است.\n\n### [الفرقان بين الأجسام والأجساد] (فرق میان اجسام و اجساد)\n\nبدان که این منزل از منازل توحید و انوار است و خداوند متعال دو بار مرا به آن وارد کرد. در این منزل بود که من نور شدم، چنانکه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در دعای خود فرمود: «و مرا نور قرار ده.»\n\nو از این منزل بود که فرقان (الفرقان) میان اجسام (الأجسام) و اجساد (الأجساد) را دانستم. اجسام (الأجسام) همین چیزهای شناخته شده در عموم هستند، چه لطیف و شفاف و چه کثیف، آنچه دیده می‌شود و آنچه دیده نمی‌شود. و اجساد (الأجساد) آن چیزهایی هستند که ارواح در بیداری در آن‌ها ظاهر می‌شوند، که به صورت اجسام تمثل یافته‌اند، و نیز صورتی که شخص خوابیده در خواب خود درک می‌کند که شبیه اجسام است در آنچه حس به او می‌دهد، در حالی که آن صور در ذات خود اجسام نیستند.\n\n### [أن مرتبة الإنسان الكامل من العالم مرتبة النفس الناطقة من الإنسان‏] (اینکه مرتبه انسان کامل در عالم، مرتبه نفس ناطقه در انسان است)\n\nو بدان که مرتبه انسان کامل (الإنسان الکامل) در عالم، مرتبه نفس ناطقه (النفس الناطقة) در انسان است. پس او کامل‌ترین است که کامل‌تر از او نیست، و او محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است. و مرتبه کاملان از انسان‌ها که از درجه این کمال که غایت عالم است پایین‌ترند، به منزله قوای روحانی در انسان هستند، و آنان انبیا (صلوات الله و سلامه علیهم) می‌باشند. و مرتبه کسانی که در کمال از درجه اینان در عالم پایین‌ترند، به منزله قوای حسی در انسان هستند، و آنان ورثه (رضی الله عنهم) می‌باشند. و هر کس که باقی می‌ماند و در شکل بر صورت انسان است، از جمله حیوانات است؛ پس آنان به منزله روح حیوانی در انسان هستند که رشد و احساس را می‌دهد.\n\nو بدان که عالم امروز به دلیل فقدان جامعیت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) در ظهورش از نظر روح و جسم و صورت و معنا، خوابیده است نه مرده. و روح او که محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است، در عالم به صورت محلی است که روح انسان هنگام خواب در آن قرار دارد، تا روز بعث که مانند بیداری شخص خوابیده در اینجاست.\n\nو ما محمد (صَلَّى اللهُ عَليهِ وسَلَّم) را به طور خاص روح و نفس ناطقه (النفس الناطقة) در عالم نامیدیم، به دلیل آنچه کشف (الکشف) به ما داده است و به دلیل قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) که فرمود: «او سرور مردم است.»\n\nو عالم از مردم است، زیرا او انسان بزرگ در جِرم (جسم) و مقدم در تسویه و تعدیل است تا صورت نشأت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) از او ظاهر شود، همان‌گونه که خداوند جسم انسان را پیش از وجود روحش تسویه و تعدیل کرد، سپس «وَنَفَخَ فِيهِ مِنْ رُوحِهِ» (و از روح خود در آن دمید) روحی که به واسطه آن انسان کامل شد و خداوند به او خلقش را عطا کرد که همان نفس ناطقه (النفس الناطقة) اوست. پس پیش از ظهور نشأت او (صَلَّى اللهُ عَليهِ وسَلَّم)، عالم در حال تسویه و تعدیل بود، مانند جنین در شکم مادرش، و حرکتش به واسطه روح حیوانی بود که حیاتش به آن صحیح می‌شد. پس اندیشه خود را در آنچه برایت ذکر کردم بزرگ شمار. هنگامی که قیامت برپا شود، تمام عالم با ظهور نشأت کامل محمد (صَلَّى اللهُ عَليهِ وسَلَّم) که قوایش کامل شده، زنده می‌شود. و اهل آتش که اهل آن هستند، در مرتبه انسانیت عالم، مرتبه آن چیزی را دارند که در انسان رشد می‌کند و نه به مرگ و نه به زندگی متصف می‌شود. و همچنین نص از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) درباره آنان وارد شده است که: «آنان در آن نمی‌میرند و زنده نمی‌شوند.»\n\nو خداوند درباره آنان فرمود: «لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ» (در آن نمی‌میرد و زنده نمی‌شود).\n\nو فرشتگان از تمام عالم مانند صورتی هستند که در خیال انسان ظاهر می‌شود، و همچنین جن. پس عالم، انسان بزرگ نیست مگر به وجود انسان کامل (الإنسان الکامل) که نفس ناطقه (النفس الناطقة) اوست، همان‌گونه که نشأت انسان، انسان نمی‌شود مگر به نفس ناطقه خود، و این نفس ناطقه انسان کامل نمی‌شود مگر به صورت الهی که رسول (صَلَّى اللهُ عَليهِ وسَلَّم) بر آن تصریح کرده است. به همین ترتیب، نفس عالم که محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است، درجه کمال را با تمامیت صورت الهی در بقا و تنوع در صور به دست آورد، و بقای عالم به واسطه اوست. پس حال عالم پیش از ظهور او (صَلَّى اللهُ عَليهِ وسَلَّم) برای تو آشکار شد که به منزله جسد تسویه شده بود، و حال عالم پس از مرگ او به منزله شخص خوابیده، و حال عالم با بعث او در روز قیامت به منزله بیداری و هشیاری پس از خواب است.\n\n### [أن الإنسان كان على الصورة الإلهية] (اینکه انسان بر صورت الهی بود)\n\nو بدان که انسان چون مثال صورت الهی بود، مانند سایه برای شخصی است که در هیچ حالی از او جدا نمی‌شود، جز اینکه گاهی برای حس ظاهر می‌شود و گاهی پنهان. پس اگر پنهان شود، در او معقول است، و اگر ظاهر شود، برای کسی که آن را می‌بیند، با بصر (چشم) مشهود است. پس انسان کامل (الإنسان الکامل) در حق (الحق) معقول است، مانند سایه‌ای که در خورشید پنهان شود و ظاهر نگردد. پس انسان از ازل و ابد بوده است و به همین دلیل برای حق (الحق) مشهود بود، زیرا به داشتن بصر (بینایی) موصوف است. پس هنگامی که سایه از او کشیده شد، به صورتش ظاهر گشت: «أَلَمْ تَرَ إِلَىٰ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ وَلَوْ شَاءَ لَجَعَلَهُ سَاكِنًا» (آیا ندیدی که پروردگارت چگونه سایه را گسترانید؟ و اگر می‌خواست، آن را ساکن می‌گردانید)؛ یعنی ثابت در کسی که سایه اوست، پس آن را نمی‌گستراند و برای او در وجود حسی چشمی جز برای خداوند یگانه ظاهر نمی‌شود. پس او پیوسته با خدا بوده و پیوسته با خدا خواهد بود، و او به بقای خدا باقی است. و هر آنچه غیر از انسان کامل (الإنسان الکامل) است، به ابقای خدا باقی است.\n\nو هنگامی که خداوند جسم عالم را تسویه کرد، که همان جسم کلی صوری در جوهر هباء (الهباء) معقول بود، پیش از فیض روح الهی که پیوسته منتشر و نامعین بود، زیرا کسی نبود که آن را معین کند، جسم عالم به واسطه آن زنده شد. پس همان‌گونه که جسم عالم، اجسام شخصیت‌های خود را در بر گرفت، روح آن نیز ارواح شخصیت‌های خود را در بر گرفت: «هُوَ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ» (اوست که شما را از یک نفس واحد آفرید). و از اینجاست که کسی که گفت روح در اشخاص نوع انسان، واحدالعین است و روح زید همان روح عمرو و سایر اشخاص این نوع است، سخن گفت. اما صاحب این امر، صورت این امر را در آن محقق نساخت. زیرا همان‌گونه که صورت جسم آدم، جسم هر شخص از ذریه او نبود، اگرچه او اصلی است که ما از او ظاهر شدیم و متولد گشتیم، روح مدبر جسم عالم به تمامه نیز چنین است.\n\nهمان‌گونه که اگر زمین را مسطح فرض کنی که «لَا تَرَىٰ فِيهَا عِوَجًا وَلَا أَمْتًا» (در آن هیچ کجی و پستی نمی‌بینی)، و خورشید بر آن منتشر شود، با نور خود می‌درخشد و نور آن از یکدیگر متمایز نمی‌شود و حکم تجزیه و تقسیم بر آن و بر زمین جاری نمی‌شود. اما هنگامی که شهرها و خانه‌ها ظاهر شدند و سایه‌های این اشخاص ایستاده پدیدار گشتند، نور خورشید تقسیم شد و برخی از آن از برخی دیگر متمایز گشت، به دلیل صورتی که در زمین عارض شد. پس اگر این را در نظر بگیری، خواهی دانست که نوری که مخصوص این منزل است، نوری نیست که مخصوص منزل دیگر یا منازل دیگر باشد. و اگر آن چیزی را که این نور از آن ظاهر شده است، در نظر بگیری، که همان عین آن است از حیث گشایش آن از آن، خواهی گفت که ارواح، یک روح واحد هستند، و اختلاف تنها به واسطه محل‌هاست. خورشید مانند انوار، نور یک عین واحد است، جز اینکه حکم اختلاف در قوابل (پذیرندگان) به دلیل اختلاف مزاج‌ها و صور اشکال آن‌ها متفاوت است.\n\nو هنگامی که این منزل در سال پانصد و نود و یک به من عطا شد و در آن اقامت گزیدم، برایم به آب در رودخانه تشبیه شد که در آن صورتی متمایز نیست، بلکه صرفاً عین آب است و بس. اما هنگامی که مقداری از آن در ظروف قرار گیرد، در آن هنگام آب کوزه از آب سبو و آب کاسه متمایز می‌شود و شکل ظرف و رنگ ظرفش در آن ظاهر می‌گردد. پس ظروف بر آن حکم تجزیه و اشکال را جاری می‌کنند، با اینکه می‌دانی عین آبی که در رودخانه شکلی در آن ظاهر نشده، همان عین آبی است که ظاهر شده است، اگرچه در آن غیر از آب نباشد. جز اینکه فرقان (الفرقان) میان دو صورت در این مَثَل این است که آب ظروف و انوار منازل، اگر از بین بروند، به نور اصلی و رودخانه اصلی باز می‌گردند.\n\nو در نفس امر نیز چنین است، حتی اگر ظرفی باقی نماند و منزلی باقی نماند. زیرا هنگامی که خداوند اراده کرد این انوار بر تمایزی که پذیرفته‌اند باقی بمانند، برای آن‌ها اجساد برزخی (أجساد برزخية) خلق کرد که این ارواح هنگام انتقال از این اجسام دنیوی در خواب و پس از مرگ در آن‌ها متمایز شدند. و برای آن‌ها در آخرت اجسام طبیعی خلق کرد، همان‌گونه که در دنیا برایشان قرار داده بود، جز اینکه مزاج متفاوت است. پس آن‌ها را از جسد برزخ به اجسام نشأت آخرت منتقل کرد و در آنجا نیز به حکم تمایز صور اجسامشان متمایز شدند. سپس پیوسته تا ابدالآبدین چنین خواهند بود و هرگز به حال اول وحدت عینی باز نمی‌گردند. پس بنگر که چه شگفت‌انگیز است «صُنْعَ اللَّهِ الَّذِي أَتْقَنَ كُلَّ شَيْءٍ» (صنع خداوندی که هر چیزی را محکم و استوار ساخت).\n\nپس تمام عالم امروز از ساعتی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) وفات یافت، خوابیده است و خود را در جایی می‌بیند که صورت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است، تا زمانی که مبعوث شود. و ما به حمدالله در ثلث آخر این شبی هستیم که عالم در آن خوابیده است.\n\nو چون تجلی (التجلی) حق (الحق) در ثلث آخر شب است و تجلی (التجلی) او فواید و علوم و معارف کامل را به کامل‌ترین وجه عطا می‌کند، زیرا از تجلی (التجلی) نزدیک‌تر است، چون تجلی (التجلی) در آسمان دنیاست؛ از این رو علم آخر این امت پس از وفات رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) کامل‌تر از علم میانه و اول آن بود. زیرا هنگامی که خداوند پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) را مبعوث کرد، او را در حالی مبعوث کرد که شرک برپا و کفر آشکار بود. پس قرن اول که قرن صحابه است را جز به ایمان دعوت نکرد، به ویژه آنچه را که از علم مکنون می‌دانست، برایشان آشکار نساخت. و قرآن کریم بر او نازل شد و او را واداشت تا از آن به گونه‌ای ترجمه کند که فهم عموم آن قرن به آن برسد. پس صورت‌سازی کرد و تشبیه نمود و با صفات پدیده‌ها (محدثات) وصف کرد و تمام آنچه را که درباره صفت خالقش گفت، در مقام یک صورت حسی تسویه شده و تعدیل یافته قرار داد، سپس در این صورت خطابی روحی دمید تا کمال نشأت ظاهر شود. پس آن روح «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست) بود و «سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ» (منزه است پروردگار تو، پروردگار عزت، از آنچه وصف می‌کنند). و هر آیه تسبیح در قرآن، روح صورت نشأت خطاب است. پس بفهم که این سرّی شگفت‌انگیز است.\n\nپس از آن، برای خواص قرن اول، نه عموم آن‌ها، بلکه برای برخی از خواص آن‌ها، از پسِ خطاب تنزیه، اسرار عظیمی آشکار شد. با این حال، آنان به مرتبه متأخرین این امت در آن اسرار نرسیدند، زیرا آن‌ها را از مواد حروف قرآن و اخبار نبوی گرفتند. پس در این کار به منزله اهل سمر بودند که در اول شب پیش از خواب سخن می‌گویند. اما هنگامی که زمان ثلث این شب فرا رسید، که همان زمانی است که ما در آن هستیم تا فجر قیامت و بعث و روز نشر و حشر طلوع کند، حق (الحق) در ثلث این شب که زمان ماست، تجلی (التجلی) کرد. پس از علوم و اسرار و معارف در قلب‌ها به واسطه تجلی (التجلی) خود، چیزی را عطا کرد که حروف اخبار نمی‌دهند، زیرا آن را در غیر مواد، بلکه به صورت معانی مجرد عطا کرد. پس آنان در علم کامل‌تر بودند و قرن اول در عمل کامل‌تر بود، اما ایمان برابری داشت.\n\nزیرا این نشأت بر حسد سرشته شده است و هنگامی که پیامبری از جنس خودشان در آن مبعوث شد، جز کسی که بر دفع نفس خود از حسد و حب برتری و نفرت از حکم شدن بر آن قوی بود، به او ایمان نیاورد، به ویژه اگر حاکم بر آن‌ها از جنس خودشان باشد. نفس می‌گوید: به چه چیز بر من برتری یافته که بر من به آنچه می‌خواهد حکم کند؟ پس به مؤمن از صحابه، از قوت ایمان چیزی نسبت داده می‌شود که به کسی که مشاهده تقدم جنس خود را ندارد، نسبت داده نمی‌شود. پس اشتغال آنان به دفع نیروی سلطه حسد که مبادا بر آن‌ها به کفر حکم کند، مانع از درک غوامض علوم و اسرار حق (الحق) در بندگانش می‌شد. و رتبه ایمان به غیب صورت رسول و آنچه آورده بود، برایشان حاصل نشد، زیرا آنان شاهد او و صورت آنچه آورده بود، بودند. اما هنگامی که زمان ما فرا رسید و اوراقی نوشته شده به سیاهی بر سفیدی و اخباری منقول یافتیم و پذیرش ابتدایی بر آن‌ها را یافتیم که اگر خداوند ما را توفیق دهد، نمی‌توانیم آن را از نفوس خود دفع کنیم، دانستیم که نیروی نور ایمان آن را عطا کرده است. و هیچ تردیدی نیافتیم و هیچ آیه یا دلیلی بر صحت آنچه از قرآن مکتوب یا از اخبار منقول یافته بودیم، نخواستیم. پس به یقین دانستیم که این قوت ایمان را خداوند از روی عنایت به ما عطا کرده است. و ما در این حالت، مؤمن به غیبی بودیم که صحابه در آن درجه و قدمی نداشتند، همان‌گونه که ما نیز در ایمانی که بر آنچه سلطه حسد هنگام مشاهده می‌دهد، غلبه کند، قدمی نداشتیم. پس ما این قوت را با آن قوت مقابله کردیم و برابر شدیم، و برتری در علم باقی ماند، زیرا آن را از تجلی (التجلی) این شب مبارک گرفتیم که اهل ثلث آن به آن فائز شدند، در حالی که دو ثلث گذشته این شب در آن قدمی نداشتند.\n\n### [إن تجلى الله في الثلث الليل الأخير] (اینکه تجلی خداوند در ثلث آخر شب است)\n\nسپس تجلی (التجلی) او سبحانه در ثلث شب از این شب‌های جزئی که تجدید را می‌دهد، در این قول است که: «پروردگار ما هر شب در ثلث آخر آن به آسمان دنیا فرود می‌آید و می‌گوید: آیا توبه‌کننده‌ای هست؟ آیا آمرزش‌خواهی هست؟ آیا سائل و درخواست‌کننده‌ای هست؟ تا زمانی که فجر بشکافد.»\n\nپس ما با متقدمین در این نزول و آنچه عطا می‌کند، شریک هستیم، جز اینکه آن تجلی (التجلی) منقطع است. اما تجلی (التجلی) ثلث این شبی که ما در ثلث آخر آن هستیم، و آن از زمان وفات رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) تا روز قیامت است، هیچ یک از متقدمین در این ثلث با ما شریک نشدند. پس هنگامی که فجر آن، که فجر قیامت است، طلوع کند، تجلی (التجلی) قطع نمی‌شود، بلکه تجلی (التجلی) او برای ما متصل می‌گردد و پیوسته در برابر چشمان ما خواهد بود. پس ما میان تجلی (التجلی) دنیوی و اخروی، و عام و خاص، که نه منقطع است و نه محجوب، قرار داریم. در حالی که در شب‌های زمانی، طلوع فجر آن را محجوب می‌کند. پس ما آنچه را که آنان در این شب‌ها به دست آوردند، به دست آوردیم و به آنچه از تجلی (التجلی) ثلث این شب مبارک برای ما حاصل شد، فائز گشتیم، که نصیبی برای غیر اهل آن نیست. این جبرانی است برای دل‌هایشان به خاطر فقدان مشاهده رسول (صَلَّى اللهُ عَليهِ وسَلَّم)، و این برای آنان بهتر بود، زیرا نمی‌دانستند که احوالشان هنگام مشاهده چگونه خواهد بود، آیا حسد بر آنان غلبه می‌کرد یا آنان بر حسد غلبه می‌کردند. پس «وَكَفَى اللَّهُ الْمُؤْمِنِينَ الْقِتَالَ وَكَانَ اللَّهُ قَوِيًّا عَزِيزًا» (و خداوند مؤمنان را از جنگ کفایت کرد، و خداوند قوی و عزیز است).\n\nپس ای ولی، منزلت خود را از این صورت انسانی که محمد (صَلَّى اللهُ عَليهِ وسَلَّم) روح و نفس ناطقه (النفس الناطقة) آن است، بشناس. آیا تو از قوای آن هستی یا از محل‌های قوای آن؟ و اگر از قوای آن هستی، آیا بصر (بینایی) آنی یا سمع (شنوایی) آن، یا شم (بویایی) آن، یا لمس (لامسه) آن، یا طعم (چشایی) آن؟ به خدا سوگند، من دانستم که کدام یک از قوای این صورت هستم. حمد و سپاس از آنِ خداست بر این امر. و ای ولی، گمان مبر که اختصاص ما در منزلت از این صورت به منزله قوای حسی در انسان، بلکه در حیوان، نقص ما از منزلت قوای روحانی است. چنین مپندار، بلکه این قوا کامل‌ترین قوا هستند، زیرا اسم «الوهاب» (بخشنده) برای آن‌هاست، چون آن‌ها هستند که به قوای روحانی آنچه را که در آن تصرف می‌کنند و آنچه حیات علمی آن‌ها به واسطه آن است، از قوه خیال و فکر و حفظ و تصور و وهم و عقل، می‌بخشند. و همه این‌ها از مواد همین قوای حسی است. و به همین دلیل:\n\nخداوند متعال درباره بنده‌ای که او را دوست دارد، فرمود: «گوش او می‌شوم که با آن می‌شنود و چشم او می‌شوم که با آن می‌بیند.»\n\nو صورت محسوس را ذکر کرد و چیزی از قوای روحانی ذکر نکرد و خود را به منزلت آن‌ها پایین نیاورد، زیرا منزلت آن‌ها منزلت نیازمندی به حواس است، و حق (الحق) خود را به منزلت کسی که به غیر خود نیازمند است، پایین نمی‌آورد. و حواس نیازمند به خدا هستند نه به غیر او. پس او برای کسی فرود آمد که نیازمند اوست و هیچ کس را شریک او نساخته است. پس به آن‌ها غنا بخشید. از آن‌ها و درباره آن‌ها گرفته می‌شود، اما آن‌ها از سایر قوا جز از خدا نمی‌گیرند. پس شرافت و قدر حس را بشناس و بدان که آن عین حق (الحق) است. و به همین دلیل، نشأت آخرت کامل نمی‌شود مگر با وجود حس و محسوس، زیرا کامل نمی‌شود مگر به حق (الحق). پس قوای حسی، در حقیقت، خلفای خداوند در زمین این نشأت هستند.\n\nآیا نمی‌بینی که او سبحانه چگونه خود را به شنوا (سمیع)، بینا (بصیر)، متکلم، زنده (حی)، دانا (عالم)، توانا (قادر) و اراده‌کننده (مرید) بودن وصف کرده است؟ و همه این‌ها صفاتی هستند که در محسوس اثر دارند و انسان از خود احساس می‌کند که این قوا در او برپا هستند. و او سبحانه خود را به عاقل بودن، متفکر بودن یا متخیل بودن وصف نکرده است. و از قوای روحانی برای خود باقی نگذاشت مگر آنچه را که حس در آن مشارکت دارد، و آن حافظ و مصور است. زیرا حس در حفظ و تصویر اثر دارد. اگر این اشتراک نبود، حق (الحق) خود را به آن دو وصف نمی‌کرد. پس او حافظ و مصور است. این دو صفت، روحانی و حسی هستند. پس به آنچه تو را بر آن آگاه ساختیم، توجه کن تا دلت نشکند از اینکه تو را به منزلت قوای حسی پایین آوردم، به دلیل پستی حس نزد تو و شرافت عقل. پس تو را آگاه ساختم که تمام شرافت در حس است و تو امر و قدر خود را ندانسته‌ای. پس اگر خود را می‌دانستی، پروردگارت را می‌دانستی، همان‌گونه که پروردگارت تو را دانست و عالم را به علمش به نفس خود دانست، و تو صورت او هستی. پس ناگزیر باید در این علم با او شریک باشی و او را از علم خود به نفس خود بدانی. و این نکته‌ای است که از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) ظاهر شد:\n\nآنجا که فرمود: «مَن عَرَفَ نَفسَهُ فَقَد عَرَفَ رَبَّهُ» (هر کس خود را شناخت، پروردگارش را شناخت).\n\nزیرا امر در علم حق (الحق) به عالم، علم او به نفس خود است. و این نظیر قول خداوند متعال است: «سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنفُسِهِمْ» (به زودی آیات خود را در آفاق و در نفس‌هایشان به آنان نشان خواهیم داد). پس دو نشأت را ذکر کرد: نشأت صورت عالم با آفاق، و نشأت روح آن با قولش: «وَفِي أَنفُسِهِمْ». پس او یک انسان واحد است که دو نشأت دارد، «حَتَّى يَتَبَيَّنَ لَهُمْ» (تا برای بینندگان آشکار شود) «أَنَّهُ الْحَقُّ» (که او حق است)؛ یعنی آنچه بیننده دیده، حق (الحق) است و نه غیر آن. پس ای ولی، بنگر که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) چقدر با امتش مهربان بود و چه نیکو به آنان تعلیم داد و چه راه‌ها برایشان گشود. پس چه نیکو معلم و راهگشایی بود. خداوند ما را از کسانی قرار دهد که بر راه او گام نهادند تا به درجه او ملحق شوند. آمین به عزت او. اگر صاحب فطنت باشی، ما به آنچه امر بر آن است، اشاره کردیم، بلکه به آن تصریح نمودیم و در این راه، آنچه را که منکران اشاره ما در این مسئله، یعنی کورانی که «يَعْلَمُونَ ظَاهِرًا مِّنَ الْحَيَاةِ الدُّنْيَا وَهُمْ عَنِ الْآخِرَةِ هُمْ غَافِلُونَ» (ظاهری از زندگی دنیا را می‌دانند، در حالی که از آخرت غافلند)، به ما نسبت می‌دهند، تحمل کردیم. به خدا سوگند، اگر این قول نبود، ما بر آنان حکم به کوری در ظاهر زندگی دنیا و آخرت می‌کردیم، همان‌گونه که خداوند بر آنان حکم به عدم شنیدن کرد، با وجود اینکه می‌شنیدند، در قول خداوند متعال که نهی می‌کند: «وَلَا تَكُونُوا كَالَّذِينَ قَالُوا سَمِعْنَا وَهُمْ لَا يَسْمَعُونَ» (و مانند کسانی نباشید که گفتند شنیدیم، در حالی که نمی‌شنوند). با اینکه آنان شنیدند، خداوند سمع (شنوایی) را از آنان نفی کرد. و علم اینان به ظاهر زندگی نیز چنین است، تنها به آنچه حواسشان از امور محسوس درک می‌کند، نه غیر آن، زیرا حق (الحق) متعال، سمع و بصر آنان نیست. پس اکنون آنچه این منزل از علوم در بر دارد، ذکر می‌کنیم، ان‌شاءالله.\n\nاز جمله آن علوم، علم عطش عالم است که با آن، سیراب شدن از علم به خدا پذیرفته نمی‌شود. و در آن، علم استناد این علم که این عطش آن را داده است، به حضرت جمع (حضرة الجمع) که عین فرقه (عین الفرقة) در آن است، وجود دارد. و در آن، علم آنچه به واسطه ذکر حاصل می‌شود، هست: آیا آن علم، عین چیزی است که فراموش کرده یا مثل آن است نه عین آن؟ به دلیل شبهه‌ای در صورت. زیرا او به امری عالم بود، سپس به دلیل اقتضای نشأت خود آن را فراموش کرد و صورت علمش به آن معلوم برایش حفظ نشد، سپس بعد از آن به یاد آورد. پس آیا آنچه در ذکر خود مشاهده کرد، عین چیزی است که فراموش کرده بود یا مثل آن؟ زیرا زمان بر او متفاوت شده است، با وجود شباهت زمان‌ها به یکدیگر. تو می‌دانی که عین دیروز، عین امروز و عین فردا نیست، با وجود شباهت صورت آن به آن. پس علم ذکر از کدام قبیل است؟ اگر عین آن باشد، پس چه کسی آن را حفظ کرد تا به یاد آورد؟ و خزانه حفظ آن کجاست؟ آیا در خود فراموش‌کننده است و ما نمی‌دانیم، یا جای دیگری دارد که در زمان فراموشی در آن حفظ می‌شود؟ پس هنگامی که به یاد می‌آورد، عین تجلی (التجلی) آن علم برای اوست. پس حق (الحق) خزانه اوست و او حافظ آن و متجلی‌کننده آن است، حتی به واسطه ذکر این فراموش‌کننده. و اگر امر چنین نباشد، پس او ذاکر چیزی که فراموش کرده نیست، بلکه علم جدیدی را می‌آموزد که مماثل علم اول اوست. و تجدید تنها در تجلی (التجلی) رخ داده است که ذکر آنچه فراموش شده را به او عطا کرده است. و این مسئله‌ای شگفت‌انگیز در علم این است که بنده در اوقاتی پروردگارش را به دلیل مشغولیت به نفس خود یا چیزی از عالم فراموش می‌کند، سپس او را به یاد می‌آورد. و این منسی (فراموش شده) تجدید را نمی‌پذیرد، بلکه عین آن است. پس از اینجا علم ذکر آنچه فراموش کرده‌ای را می‌شناسی.\n\nو در آن، علم بداء (البدا) هست، و اینکه آیا این وصف بر خداوند محال است یا نه. و از اینجاست که کسانی که نسخ الهی در امور و شرایع را انکار کردند، انکار نمودند، و خلق بسیاری به انکار آن قائل شدند، همان‌گونه که خلق بسیاری به اثبات آن، نه از جهت بداء (البدا)، قائل شدند. و ما در علم نسخ، راهی میان دو راه را پیمودیم؛ نه قائل به بداء (البدا) شدیم و نه نسخ را نفی کردیم، بلکه آن را پایان مدت حکم در علم خدا قرار دادیم، زیرا هیچ حکمی از جانب خدا وارد نشده که ذکر شده باشد مؤبد است یا تا اجل معینی جاری است و سپس آن را پیش از رسیدن آن اجل برداشته باشی. به همین دلیل ما این روش را در آن پیمودیم.\n\nو در آن، علم کسی است که در غیر منزلت خود به صورت دیگری ظاهر شد، تا خود را شبیه یا مثال کسی قرار دهد که آن صورت از آن اوست تا ایجاد اشتباه کند. حکم خدا در مورد کسی که صفتش این است چیست و نعت (وصف) او که شایسته است بر او اطلاق شود، کدام است؟\n\nو در آن، علم حکمت در اموری است که تقدیم (پیش انداختن) می‌دهند و اموری که تأخیر (پس انداختن) می‌دهند، به حکم جزم یا به حکم اختیار. و در آن، علم منزلت کسانی است که اعتبار (عبرت گرفتن) می‌کنند و اینکه این لغزش از کجا به آنان راه یافته است، با وجود صحت اعتبار در ذات خود، زیرا در آن لغزشی نیست، بلکه لغزش در اعتبارکنندگان است و تمایز طبقات آنان در این امر. و این علمی گرانبهاست، زیرا هر اعتبارکننده‌ای، اعتبار را در جایگاه خود برپا نمی‌دارد. و آیا «مُعتَبَر» (آنچه عبرت گرفته می‌شود) که حق (الحق) آن را نصب کرده است، آیا آن را فقط برای اعتبار خاص نصب کرده است، به طوری که در ذات خود قراری نداشته باشد مگر تا زمانی که عبرت است، پس اگر صفت اعتبار از عالم از آن برداشته شود، وجودش نیز برداشته می‌شود؟ یا آن در ذات خود مقرر است و زائل نمی‌شود، چه اعتبارکننده آن را اعتبار کند یا نکند، یا اعتبار از عالم زائل شود، همان‌گونه که در آخرت هنگام اقامت در دو سرا (بهشت و جهنم) زائل می‌شود؟\n\nو در آن، علم انکار جاهل بر عالم است: از کجا بر او انکار کرده است؟ آیا از یک حضرت (حضرة) یا صفت وجودی در عین آن، یا از تخیلی که در خارج وجودی ندارد، بلکه در حضرت خیال (حضرة خیال) منکر است؟ زیرا انکار عالم بر جاهل، آنچه جاهل بر او انکار می‌کند، صورتش صورت انکار جاهل بر عالم نیست، اگرچه در انکار با هم مشترک باشند. و آیا در حقیقت در عالم چیزی هست که انکار شود یا نه؟ و انکار چیست و حقیقت آن بر چه چیزی است؟ آیا امری وجودی است یا یک نسبت؟\n\nو در آن، علم تنافس (رقابت) است: از کجا در عالم ظاهر شد و چرا جز در یک جنس ظاهر نمی‌شود؟ و آیا تشبه به اله از این قبیل است؟ اگر چنین است، پس جنس جامع میان خلق و حق (الحق) چیست؟ آیا صورتی است که انسان کامل (الإنسان الکامل) بر آن خلق شده، آن را به دست آورده است؟ یا این انسان جزئی با کسی رقابت نمی‌کند مگر با انسانی که پیوسته صورت حق (الحق) را در نفس خود حفظ می‌کند که سایه‌ای برای اوست؟ پس این انسان جزئی دوست دارد که به رتبه آن انسانی برسد که سایه صورت الهی است. یا آیا صورت حق (الحق) جز عین همین انسان نیست که ما از او به سایه تعبیر کردیم و حق (الحق) روح آن صورت است؟ پس حق (الحق) دارای صورت و روح خواهد بود، همان‌گونه که در آخرت تجلی (التجلی) می‌کند و انکار می‌شود و شناخته می‌شود. زیرا خداوند آن تجلی (التجلی) را بیهوده ذکر نکرده است، منظورم در ذکر پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) از آن در این حیات دنیاست. پس آن را ذکر نکرد مگر برای اینکه قلب‌ها را به طلب علم آن از خدا آگاه سازد.\n\nو در آن، علم خزانه‌های رحموت (الرحموت) است، نه رحمت (الرحمة). و در آن، علم رحمت (الرحمة) است که مستند به اعطای انعام است و به مقامی که به واسطه آن حکم غضب الهی از عالم برداشته شد، و به مقامی که خلق آنچه عالم را اصلاح می‌کند، از آنجاست. و منظورم از همه این‌ها، عالم تکلیف است. و از این مقام است که قائلان به وجوب رعایت اصلح در حق حق (الحق) سخن گفته‌اند.\n\nو در آن، علم ترقی در علم اسباب است: آیا پایان می‌یابد یا پایان نمی‌یابد؟ و آیا ترقی خود یک سبب است که در آن و به واسطه آن ترقی می‌شود؟ و در آن، علم فتنه‌ها و ملاحم معنوی است و اینکه غلبه و ظهور در آن‌ها از آنِ کیست و امر این فتنه‌ها تا کجا به پایان می‌رسد.\n\nو در آن، علم تشبه عالم به عالم و طبقات آن است. از جمله آن، تشبه ستوده است، مانند تشبه عالم تکلیف از ما به عالم تسبیح، که هر چیزی در عالم به حمد خدا تسبیح می‌گوید، و مانند تشبه انسان به کسی که در مکارم اخلاق بر او پیشی گرفته است. و از جمله آن، تشبه نکوهیده است. اما تشبه به حق (الحق)، آن تشبهی است که نزد بیشتر اهل الله مطلوب است، اما نزد ما صحیح نیست که به خدا تشبه شود. و هیچ حکیمی به آن قائل نشده است مگر کسی که معرفت (المعرفة) به امر آن‌گونه که در ذات خود هست، ندارد.\n\nو در آن، علم فرق میان قول خداوند متعال: «ثُمَّ نُفِخَ فِيهِ أُخْرَىٰ» (سپس بار دیگر در آن دمیده می‌شود) و قول خداوند متعال: «مَا لَهَا مِن فَوَاقٍ» (برای آن بازگشتی نیست) است. پس یکی را مفرد آورد و دیگری را مثنی. پس جایگاه تثنیه نسبت به جایگاه افراد چیست یا امر چگونه است؟\n\nو در آن، علم خاتمه در حال، پیش از وقوع آن است: آیا این خاتمه در حق کسی که به آن عالم است، هست یا نه؟ و آیا علم به آن از بشارت‌هایی است که خداوند درباره آن فرمود: «لَهُمُ الْبُشْرَىٰ فِي الْحَيَاةِ» (برای آنان در زندگی بشارت است)؟ یا برای این صورتی است و برای بشارت صورتی دیگر؟\n\nزیرا پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) گروهی را به بهشت بشارت داد و آنان پس از آن زمان طولانی زندگی کردند، برخلاف بشارت محتضر (کسی که در حال جان دادن است).\n\nو در آن، علم قوه حادثه و تجزیه آن در پدیده‌ها (محدثات) است. و آیا پدیده‌ای هست که تمام آن را گرفته باشد یا این تصور نمی‌شود؟ و مقدار آن از قوه الهی چقدر است؟ آیا جزئی از فلان مقدار جزء از آن است یا نه؟ زیرا محل قوه الهی، ممکنات به طور مطلق است و محل قوه حادثه، برخی از ممکنات است. پس اگر اجناس عالم ممکن را محدود کنی و آنچه را که قوه از ممکنات دارد نام ببری، به یقین مقدار آن را از قوه الهی خواهی دانست.\n\nو در آن، علم فرق میان تسخیر عام و تسخیر خاص است. و آیا اینکه حق (الحق) «كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ» (هر روز در کاری است) و «سَنَفْرُغُ لَكُمْ» (به زودی به شما خواهیم پرداخت)، آیا از علم تسخیر و باب آن است یا از حقیقتی دیگر؟ زیرا سید (سرور) به صورت حال، آنچه را که بنده به آن نیاز دارد، انجام می‌دهد. پس این یک تسخیر دقیق است که کمالی را در سید می‌بخشد. زیرا منزلت بنده این نیست که سید خود را تسخیر کند، و منزلت بنده این است که تحت تسخیر سید خود باشد، با دو حالت: تسخیر به امر سیدش، و تسخیر به نفس خود از ذات خود به دلیل بنده بودن. و گاهی برای غیر سید خود، از امثال سیدش و از امثال خود، به روش‌های مختلف تسخیر می‌شود. از جمله آن، تسخیر او برای آن غیر به امر سیدش است، و از جمله آن، به طریق مروت (جوانمردی) با کسی است که برای او تسخیر شده است، و از جمله آن، به عادت است، به دلیل همراهی تسخیر برای او از آن جهت که بنده است، و این برای او خوی شده و بر او حکم می‌کند، پس به حکم عادت برای غیر سید خود تسخیر می‌شود، نه به مروت و نه به امر سید.\n\nو در آن، علم نظر تمام عالم به این انسان است: آیا به او از جهت خلیفه بودنش می‌نگرند یا از جهت امانت‌هایی که نزد او دارند تا به آنان بازگرداند؟ پس او از جانب حق (الحق) به حکم جبر فرستاده شده است، نه به حکم اختیار، زیرا او در اصل جز برای تسبیح خالقش خلق نشده است.\n\nو در آن، علم چیزی است که عنایت الهی به واسطه آن بر بنده واقع می‌شود و آنچه آن اعتناء از منزلت و علم به او می‌بخشد. و در آن، علم اجمال و تفصیل است. و در آن، علم دقیقی است و آن این است که آدم (علیه السلام) شصت سال از عمر خود را به داوود بخشید، هنگامی که صورت او را در میان برادرانش دید و او را دوست داشت. پس داوود آن را پذیرفت. سپس آدم آنچه را بخشیده بود، انکار کرد. در آن هنگام دل داوود شکست. پس خداوند با ذکری که به آدم نداده بود، دل او را جبران کرد.\n\nپس درباره آدم فرمود: «إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً» (من در زمین جانشینی قرار خواهم داد) و او را به اسمش معین نکرد و میان ادات مخاطب و آنچه او را به آن شرافت بخشید، جمع نکرد. پس به او نگفت: «و تمام اسماء را به تو آموختم.» و درباره خلافت داوود فرمود: «يَا دَاوُودُ إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي الْأَرْضِ» (ای داوود، ما تو را در زمین خلیفه قرار دادیم)، پس او را نام برد. هنگامی که خداوند دانست که چنین مقام و اعتنایی، حسادت (نفاسة) نسبت به پدرش آدم را در او به ارث می‌گذارد، زیرا او به هر حال بشر است و از او آنچه از بشر سر می‌زند، سر خواهد زد. و قدر این امر را جز رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) ندانست:\n\nپس فرمود: «من فقط بشری هستم که خشمگین می‌شوم، همان‌گونه که بشر خشمگین می‌شود»؛ یعنی برای نفس خود و برای حق (الحق) غیر خود. «و راضی می‌شوم، همان‌گونه که بشر راضی می‌شود»؛ یعنی برای نفس خود و برای غیر خود. و این از تأدیب الهی بود که پروردگارش او را به آن ادب کرد، در آنچه به او وحی نمود و فرمود: «قُلْ إِنَّمَا أَنَا بَشَرٌ مِّثْلُكُمْ» (بگو من فقط بشری هستم مانند شما)؛ یعنی حکم بشریت در حکم آن در شما جاری است. پس هنگامی که خداوند اراده کرد داوود را ادب کند، به دلیل آنچه ذکر نام او توسط خدا به او از حسادت (نفاسة) نسبت به پدرش می‌داد، به ویژه که از پدرش در حق او آنچه از انکار گذشت، سر زده بود، به دلیل اینکه انسان «إِذَا مَسَّهُ الْخَيْرُ مَنُوعًا» (هنگامی که خیری به او رسد، بسیار منع‌کننده است). جز اینکه آدم آنچه را انکار کرد، انکار نکرد مگر به دلیل علمش به مرتبه خود، زیرا خداوند او را محل علم اسماء الهی قرار داده بود که فرشتگان با آن بر خدا ثنا نگفتند و پس از او جز به محمد (صَلَّى اللهُ عَليهِ وسَلَّم) داده نشد، و آن علمی است که به جوامع الکلم (جوامع کلمات) از آن کنایه شده است. پس آدم دانست که داوود در آن مدتی که از عمرش به او بخشیده بود، نمی‌تواند خدا را عبادت کند مگر به اندازه کمال خود، و او بدون شک در مرتبه از آدم پایین‌تر است، به دلیل سجده فرشتگان و علم آدم به اسماء. پس آدم خواست که آن عمری که به پسرش داوود (علیه السلام) بخشیده بود، برای خودش باشد تا در آن به عبادت خدا به اندازه علو مرتبه‌اش بر پسرش داوود و دیگران بپردازد، که داوود نمی‌توانست آن را انجام دهد. پس هنگامی که او در آن زمان معین به آن عبادت قیام کند، پاداش آنچه آن عبادت از مثل آدم می‌دهد را به پسرش داوود می‌بخشد. و اگر آن مدت را برای داوود می‌گذاشت، رتبه این جزا برایش حاصل نمی‌شد. و برای آدم (علیه السلام) از جانب خدا به دلیل این کار، رتبه جزای کسی که دیگری را بر خود مقدم داشته، حاصل شد، زیرا پاداشی مانند این برای او جاری می‌شود که اگر آن مدت را برای داوود ترک نمی‌کرد، حاصل نمی‌شد. پس همان‌گونه که او را در قبضه دوست داشت، هنگامی که از عمرش به او بخشید، به همان ترتیب از روی محبتش در آن بازگشت تا پاداش عملی را که در آن مدت از آدم سر می‌زند، به او بدهد، در حالی که داوود از این امر بی‌خبر بود. پس هنگامی که خداوند او را با ذکر نامش در خلافت جبران کرد، به دلیل آنچه ذکر کردیم از راه یافتن حسادت (نفاسة) که در طبع این نشأت است، به او فرمود: «وَلَا تَتَّبِعِ الْهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ اللَّهِ» (و از هویٰ (هوس) پیروی مکن که تو را از راه خدا گمراه سازد). پس او را برحذر داشت. و این حذر او را از شادی به آنچه خداوند با تعیین نامش به او عطا کرده بود، مشغول ساخت. اما شادی برای او حاصل شد و بهره خود را از آن گرفت، پیش از آنکه زمان «وَلَا تَتَّبِعِ الْهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ اللَّهِ» (و از هویٰ پیروی مکن که تو را از راه خدا گمراه سازد) فرا رسد، نه از خدا. پس به مراقبت از سبیل (راه) امر شد. سپس خداوند با او با ادب رفتار کرد، آنجا که به او فرمود: «إِنَّ الَّذِينَ يَضِلُّونَ عَن سَبِيلِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ بِمَا نَسُوا» (همانا کسانی که از راه خدا گمراه می‌شوند، به دلیل آنکه [روز حساب] را فراموش کردند، عذابی شدید دارند) و نفرمود: «اگر از راه خدا گمراه شوی، عذابی شدید برای توست.» و این علم شریفی است.\n\nو در این منزل، علم اصحاب کشف (الکشف) است که از حقیقت کشف (الکشف) نیست که مکاشف در هر صورتی آن را بداند، بلکه این به اندازه اراده حق (الحق) است. پس آنچه را بخواهد از او می‌پوشاند و او را بر آنچه بخواهد مطلع می‌سازد. پس از شأن مکاشف نیست که بصرش در هر صورتی که بر او تجلی (التجلی) می‌کند، نفوذ کند، بلکه آن صورتی که نمی‌داند چیست، در مقام کثافت صورت از ادراک حس بشری برای او برپا می‌شود، به دلیل آنچه در نفس آن صورت که بصر آن را درک کرده، خطور کرده است. و در وقت دیگر، کشف (الکشف) را به او می‌دهد، به واسطه آنچه آن شخص در قلب خود به آن سخن گفته است، و آن سخن بر خاطر است، از روی علم معین برای او و کشف (الکشف)، نه از روی زجر و نه حدس و نه موافقت.\n\nو در آن، علم آنچه رفق الهی با عالم به واسطه آن باقی می‌ماند، هست. و در آن، علم حکمت وجود عالم است. و در آن، علم اسباب نزول است. و در آن، علم وهب (بخشیدن) و کسب (به دست آوردن) است. و در آن، علم امری است که بنده در آن مقام سید خود را می‌گیرد. و در آن، علم رعایت اسبابی است که خیر را به صاحب نظر در آن‌ها عطا کرده است. و در آن، علم ابدال (الإبدال) است؛ یعنی علم صورتی که بَدَل (البدل) آن را بر صورت خود درک می‌کند، هر جا که بخواهد، با علم از جانب او. و منزلت او منزلت عیسی (علیه السلام) است در قولش: «وَالسَّلَامُ عَلَيَّ يَوْمَ وُلِدتُّ وَيَوْمَ أَمُوتُ وَيَوْمَ أُبْعَثُ حَيًّا» (و سلام بر من، روزی که زاده شدم و روزی که می‌میرم و روزی که زنده برانگیخته می‌شوم). و علم صورتی که حق (الحق) آن را به جای صورت کسی که از او برپا می‌شود، برپا می‌دارد، هر جا که حق (الحق) بخواهد، بدون علم از جانب کسی که از او برپا می‌شود. و منزلت او در آن، منزلت یحیی (علیه السلام) است در قول خداوند: «وَسَلَامٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوتُ وَيَوْمَ يُبْعَثُ حَيًّا» (و سلام بر او، روزی که زاده شد و روزی که می‌میرد و روزی که زنده برانگیخته می‌شود). و اینکه کدام یک از این دو مقام کامل‌تر و بالاتر است، و اینکه یحیی «لَمْ نَجْعَل لَّهُ مِن قَبْلُ سَمِيًّا» (برای او پیش از این همنامی قرار ندادیم) و اختصاص او به ذبح مرگ در روز قیامت.\n\nو در آن، علم این است که چه سببی انسان را به طلب انفراد به کامل‌ترین و بالاترین و برتری بر غیر خود می‌خواند. و در آن، علم رفع مقادیر است: آیا در نفس امر برداشته می‌شوند یا رفع آن‌ها صحیح نیست و تنها در حق کسی که در حق او برداشته می‌شوند، برداشته می‌شوند، در حالی که نزد خدا مقدر شده‌اند، به گونه‌ای که عالم از آن آگاه نیست؟ و در آن، علم این است که هر چیزی که انسان می‌داند، تنها تذکر است نه آغاز علم، و اینکه هر علمی نزد او هست، اما آن را فراموش کرده است. و در آن، علم صورت تسلط جن بر انس و انس بر جن است. و آیا تسلط جن بر انس ظاهری است یا باطنی، یا فقط در حق گروهی خاص ظاهری است و باطن معصوم است، یا امر چگونه است؟ و همچنین قول در تسلط انس بر جن، جز اینکه انس تسلطی ندارد مگر بر ظاهر جن، مگر کسی از انس که تروّحُن (روحانی) شود و معنای او لطیف گردد، به طوری که در لطیف‌تر از صور جن ظاهر شود، پس با ذات خود در باطن جن جریان یابد، همانند جریان جن در باطن انس. پس جنی او را نشناسد و خیال کند که آن از حکم نفس خود بر اوست، در حالی که آن حکم این انسان روحانی شده است. و من کسی را ندیدم که بر این نوع از علم آگاه سازد و خداوند متعال مرا بر آن مطلع ساخت. پس نمی‌دانم آیا کسی از پیشینیان از جنس من آن را دانسته و ذکر نکرده است یا نه.\n\nو در آن، علم دارویی است که انسان به واسطه آن، اثری را که جن در تسلط خود بر او گذاشته، از بین می‌برد. و در آن، علم آنچه پس از زوال این اثر از او بر او کشف (الکشف) می‌شود، هست. و در آن، علم صدور کثرت از واحد است. و آیا از واحد، احدیت کثرت صادر شده یا خود کثرت؟ و در آن، علم صادر از مصدر است که اجازه می‌دهد حکم مصدر را داشته باشد. اگر این ثابت شود، پس سرانجام عالم مکلف به سوی راحتی خواهد بود. زیرا حق (الحق) عالم را از روز یکشنبه تا روز جمعه صادر کرد و وارد روز ابد شد که روز شنبه است. و شنبه، راحتی است و آن هفتمین روز از روزهاست که پایانی ندارد. و هیچ خستگی (لغوب) در خلق آنچه خلق کرد، به خالق نرسید، اما روز شنبه روز فراغت از طبقات عالم بود. و خلق از جانب خدا در آنچه این عالم از احوالی که ابدش پایان نمی‌پذیرد و مدتش منقضی نمی‌شود، به آن نیاز دارد، باقی ماند.\n\nو در آن، علم نشأت فرشتگان است. و در آن، علم نشأت انسان و مرتبه او و آنچه از حضرت الهی (الحضرة الإلهية) برای اوست، هست. و اینکه تفاضل اشخاص این نوع به چه چیزی است؟ آیا به نشأت است یا به آنچه از اعراض می‌پذیرد؟ و در آن، علومی غیر از این نیز هست، اما ما مهم‌ترین‌ها را قصد کردیم تا قلب‌ها را بر آن آگاه سازیم. «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 7
}