{
  "id": 409,
  "title": {
    "ar": "الباب التاسع وأربعمائة في معرفة منازلة أسمائي حجاب عليك فإن رفعتها وصلت إلى",
    "en": "Chapter Four Hundred and Nine: Concerning the Knowledge of the Stations of My Names, which are a Veil upon you, for if you lift them, you will attain to...",
    "ur": "باب چار سو نو: میرے اسماء کی منازل (منازلة) کی معرفت کے بارے میں جو تم پر ایک حجاب ہے، پس اگر تم اسے اٹھا دو تو تم پہنچ جاؤ گے۔",
    "fa": "باب چهارصد و نهم در معرفت منازل اسم‌های من که حجابی بر تو هستند؛ پس اگر آن حجاب‌ها را برداری، به [من] می‌رسی."
  },
  "content": {
    "ar": "## «الباب التاسع وأربعمائة في معرفة منازلة أسمائي حجاب عليك فإن رفعتها وصلت إلى»\n\n\n> حجابك أسماء لنا ونعوت *** وأعياننا أكواننا فنقول‏\n\n\n> لنا الدولة الغراء ليست لغيرنا *** ولا غير إلا ربنا فنصول‏\n\n\n> على من فحقق ما تقول وإنما *** يقول بهذا ظالم وجهول‏\n\n\n> فكل مقال فيه غير مقيد *** فكل مقالاتي إليه تئول‏\n\n\n> فلا ترفع الأستار بيني وبينه *** فذاك وجود ما إليه سبيل‏\n\n\n### [إن الإنسان ضعيف فقير]\n\n\nاعلم أيدنا الله وإياك بروح منه أن الإنسان وإن كان في نفس الأمر عبدا ويجد في نفسه ما هو عليه من العجز والضعف والافتقار إلى أدنى الأشياء والتألم من قرصة البرغوث ويعرف هذا كله من نفسه ذوقا ومع هذا فإنه يظهر بالرياسة\nوالتقدم وكلما تمكن من التأثير في غيره فإنه يؤثر ويجد في نفسه طلب ذلك كله وحبه وذلك لأنه خلقه الله على صورته وله تعالى العزة والكبرياء والعظمة فسرت هذه الأحكام في العبد فإنها أحكام تتبع الصورة التي خلق عليها الإنسان وتستلزمها فرجال الله هم الذين لم يصرفهم خلقهم على الصورة عن الفقر والذلة والعبودية وإذا وجدوا هذا الأمر الذي اقتضاه خلقهم على الصورة ولا بد ظهروا به في المواطن التي عين الحق لهم أن يظهروا بذلك فيها كما فعل الحق الذي له هذه الصفة ذاتية نفسية فلا يظهر بها إلا في مواطن مخصوصة ويظهر بالنزول والتحبب إلى عباده حتى كأنه فقير إليهم في ذلك ويقيم نفسه مقامهم وإذا كان الحق بهذه الصفة أن ينزل إليكم في صوركم فأنتم أحق بهذا النعت أن لا تبرحوا فيه ولا تنظروا إلى ما تجدونه فيكم من قوة الصورة فذلك له لا لكم كما إن لكم ما نزل إليكم فيه لا له ولو لا إن أسماءه الحسنى قامت بكم واتصفتم بها ما تمكن لكم ذلك فردوا أسماءه على صورته لا عليكم وخذوا منه ما نزل لكم فيه فإن ذلك نعتكم وأسماؤكم فإنكم إذا فعلتم ذلك وصلتم إليه أي كنتم من أهل القربة فإن المقرب لا يبقى له القرب والجلوس مع الحق والتحدث معه تعالى اسما إلهيا من الأسماء المؤثرة في العالم ولا من أسماء التنزيه وإنما يدخل عليه بالذلة لشهود عزه وبالفقر لشهود غناه وبالتهيؤ لنفوذ قدرته فينخلع من كل الأسماء التي تعطيه أحكام الصورة التي خلق عليها هذا مذهب سادات أهل الطريق حتى قالوا في ذلك إن صادقين لا يصطحبان إنما يصطحب صادق وصديق ولهذا ما بعث رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بعثا قط ولو كان اثنين إلا قدم أحدهما وجعل الآخر تبعا وإن لم يكن كذلك فسد الأمر والنظام وهو متبع في ذلك حكم الأصل فإنه لو كان مع الله إله آخر لفسد الأمر والنظام كما قال لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا فمن أراد صحبة الحق فليصحبه بحقيقته وجبلته من ذله وافتقاره ومن أراد صحبة الخلق فليصحبه بما شرع له ربه لا بنفسه ولا بصورة ربه بل كما قلنا بما شرع له فيعطي كل ذي حق حقه فيكون عبدا في صورة حق أو حقا في صورة عبد كيفما كان لا حرج عليه ولما كان هذا كله مذهب أهل الله كشف الله لنا من زيادة العلم التي امتن الله بها علينا مع مشاركتنا إياهم فيما ذهبوا إليه إن الله أطلعنا على أن جميع ما يتسمى به العبد ويحق له النعت به وإطلاق الاسم عليه لا فرق بينه وبين ما ينعت به من الأسماء الإلهية فالكل أسماء إلهية فهو في كل ما يظهر به مما ذكروه مما تقتضيه العبودية عندهم والصورة ليس له وإنما ذلك لله وما له من نفسه سوى عينه وعينه ما استفادت صفة الوجود إلا منه تعالى فما سماه باسم إلا وهو له تعالى فإذا خرج العبد من جميع أسمائه كلها التي تقتضيها جبلته والصورة التي خلق عليها حتى لا يبقى منه سوى عينه بلا صفة ولا اسم سوى عينه حينئذ يكون عند الله من المقربين ووافقنا على هذا القول شيخنا أبو يزيد البسطامي حيث قال وأنا الآن لا صفة لي يعني لما أقامه الله في هذا المقام فصفات العبد كلها معارة من عند الله فهي لله حقيقة ونعتنا بها فقبلناها أدبا على علم أنها له لا لنا إذ من حقيقتنا عدم الاعتراض إنما هو التسليم الذاتي المحض لا التسليم الذي هو صفة له فإن ذلك له فإذا كان العبد ما عنده من ذاته سوى عينه بالضرورة يكون الحق جميع صفاته ويقول له أنت عبدي حقا فما سمع سامع في نفس الأمر إلا بالحق ولا أبصر إلا به ولا علم إلا به ولا حي ولا قدر ولا تحرك ولا سكن ولا أراد ولا قهر ولا أعطى ولا منع ولا ظهر عليه وعنه أمر ما هو عينه إلا وهو الحق لا العبد فما للعبد سوى عينه سواء علم ذلك أو جهله وما فاز العلماء إلا بعلمهم بهذا القدر في حق كل ما سوى الله لا أنهم صاروا كذا بعد أن لم يكونوا ف لِمِثْلِ هذا فَلْيَعْمَلِ الْعامِلُونَ وفي مثل هذا فَلْيَتَنافَسِ الْمُتَنافِسُونَ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 409: Concerning the Knowledge of the Descent of My Names as a Veil upon You, for if You Lift Them, You Will Reach Me\n\nYour veil consists of Names and Attributes (نعوت) belonging to Us,\nAnd Our essences (أعياننا) are Our universes (أكواننا), so We say:\n\nThe glorious dominion is Ours, not for any other,\nAnd there is no other except Our Lord, so We prevail\n\nOver whom? So verify what you say, for only\nAn oppressor and an ignorant one speaks thus.\n\nFor every saying in it is unrestricted,\nSo all my sayings return to Him.\n\nSo do not lift the curtains between Me and Him,\nFor that is an Existence (وجود) to which there is no path.\n\n### [Indeed, Man is Weak and Poor]\n\nKnow—may Allah support us and you with a Spirit from Him—that even though man is, in reality (في نفس الأمر), a servant (عبدا), and finds within himself the incapacity, weakness, and need (الافتقار) for the slightest things, and suffers pain from the bite of a flea, and knows all this about himself through direct experience (ذوقا), yet, despite this, he manifests leadership and precedence. Whenever he is able to influence another, he does so, and he finds within himself the desire and love for all of that.\n\nThis is because Allah created him upon His Form (صورته), and to Him belongs the Glory (العزة), the Grandeur (الكبرياء), and the Magnificence (العظمة). These rulings flowed into the servant, for they are rulings that follow and necessitate the Form (الصورة) upon which man was created.\n\nThe men of Allah (رجال الله) are those whose creation upon the Form did not divert them from poverty (الفقر), lowliness (الذلة), and servitude (العبودية). When they find this matter—which their creation upon the Form necessarily demands—they manifest it in the stations (المواطن) that The Real (الحق) has designated for them to manifest it in. This is just as The Real, to Whom this Attribute belongs essentially (ذاتية نفسية), does not manifest it except in specific stations. He manifests by descending and showing affection (التحبب) to His servants, to the extent that He seems needy of them in that manifestation, and He places Himself in their position.\n\nIf The Real possesses this attribute—that He descends to you in your forms—then you are more deserving of this description: that you should not depart from it, nor look at the power of the Form that you find within yourselves, for that belongs to Him, not to you. Just as what He descended to you in belongs to you, not to Him. Were it not that His Most Beautiful Names (أسماءه الحسنى) subsisted through you and you were characterized by them, that manifestation would not have been possible for you. Therefore, return His Names to His Form, not to yourselves, and take from Him that which descended to you in it, for that is your description and your names.\n\nFor if you do that, you will reach Him—meaning, you will be among the People of Nearness (أهل القربة). For the one brought near (المقرب) does not retain, through his nearness, his sitting with The Real, or his conversing with Him, any Divine Name (اسما إلهيا) from the Names that influence the World (العالم) nor from the Names of Transcendence (التنزيه). Rather, he approaches Him through lowliness due to witnessing His Glory, through poverty due to witnessing His Wealth, and through preparedness for the penetration of His Power (قدرته). Thus, he strips himself of all the Names that grant him the rulings of the Form upon which he was created.\n\nThis is the doctrine (مذهب) of the masters of the Path (أهل الطريق), to the extent that they said concerning this: \"Two truthful ones (صادقين) do not accompany each other; rather, a truthful one and a veracious one (صديق) accompany each other.\" For this reason, the Messenger of Allah (may Allah bless him and grant him peace) never sent out an expedition (بعثا) of two or more without appointing one as the leader and making the other a follower. If it were not so, the affair and the order (النظام) would be corrupted. In this, he followed the ruling of the Origin (الأصل). For if there were another god alongside Allah, the affair and the order would be corrupted, as He said: <<لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا>> (Had there been within them [i.e., the heavens and earth] gods besides Allah, they both would have been ruined).\n\nSo, whoever desires the companionship of The Real (صحبة الحق) should accompany Him with his reality and his innate nature (جبلته) of lowliness and need. And whoever desires the companionship of Creation (صحبة الخلق) should accompany them with what his Lord has legislated for him, not by his own self, nor by the Form of his Lord, but, as we said, by what has been legislated for him. Thus, he gives every possessor of a right his due. He will thus be a servant (عبدا) in the form of The Real (حق) or The Real in the form of a servant. However he is, there is no blame upon him.\n\nSince all of this is the doctrine of the People of Allah (أهل الله), Allah unveiled for us an increase in Knowledge (العلم) which He bestowed upon us, even while we share their doctrine. Allah informed us that everything by which the servant is named, and which he is entitled to be described by and have the name applied to him, there is no difference between it and the Divine Names (الأسماء الإلهية) by which he is described. For all are Divine Names. Therefore, in everything by which he manifests—of what they mentioned, which necessitates servitude (العبودية) according to them, and the Form (الصورة)—it does not belong to him; rather, that belongs to Allah.\n\nAnd what belongs to him from his self is only his fixed entity (عينه), and his fixed entity did not acquire the attribute of Existence (صفة الوجود) except from Him, the Exalted. Thus, whatever name he is called by, it belongs to Him, the Exalted. When the servant departs from all his names, which are necessitated by his innate nature and the Form upon which he was created, until nothing remains of him except his fixed entity without attribute or name other than his fixed entity, then he is among the Near Ones (المقربين) in the sight of Allah.\n\nOur Shaykh Abu Yazid al-Bistami agreed with us on this saying when he stated, \"And I now have no attribute,\" meaning when Allah established him in this station (المقام). Thus, all the attributes of the servant are borrowed from Allah; they belong to Allah in reality. We are described by them, and we accept them out of courtesy (أدبا), knowing that they are His, not ours, since our reality (حقيقتنا) is non-objection; it is pure essential submission (التسليم الذاتي المحض), not the submission that is an attribute belonging to Him, for that belongs to Him.\n\nTherefore, if the servant possesses nothing of his essence (ذاته) except his fixed entity, then The Real necessarily possesses all his attributes, and He says to him, \"You are truly My servant.\" In reality (في نفس الأمر), no hearer hears except by The Real (الحق), nor sees except by Him, nor knows except by Him, nor lives, nor is able, nor moves, nor rests, nor wills, nor conquers, nor gives, nor withholds. No matter appears upon or from him that is his fixed entity except that it is The Real, not the servant. The servant possesses nothing but his fixed entity, whether he knows this or is ignorant of it. The scholars only attained success through their knowledge of this measure concerning everything other than Allah, not that they became such after they were not. For <<لِمِثْلِ هذا فَلْيَعْمَلِ الْعامِلُونَ>> (For the like of this let the workers work), and for the like of this let the competitors compete. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر چار سو نو: میرے اسماء کے مقامات کی معرفت میں جو تمہارے لیے حجاب ہیں، پس اگر تم انہیں اٹھا دو تو تم (مجھ تک) پہنچ جاؤ گے۔\n\nتمہارا حجاب ہمارے اسماء اور صفات ہیں،\nاور ہماری اعیان (ذاتیں) ہماری اکوان (موجودات) ہیں، پس ہم کہتے ہیں۔\n\nشاندار سلطنت ہماری ہے، کسی اور کی نہیں،\nاور ہمارے رب کے سوا کوئی غیر نہیں، پس ہم غالب آتے ہیں۔\n\nکس پر؟ پس جو تم کہتے ہو اسے تحقیق کرو، کیونکہ\nیہ بات تو صرف ظالم اور جاہل ہی کہتا ہے۔\n\nپس ہر وہ قول جو اس میں غیر مقید ہے،\nمیرے تمام اقوال اسی کی طرف لوٹتے ہیں۔\n\nپس میرے اور اس کے درمیان پردے مت اٹھاؤ،\nکیونکہ وہ ایسا وجود (الوجود) ہے جس تک کوئی راستہ نہیں۔\n\n### [بے شک انسان کمزور اور محتاج ہے]\n\nاللہ تعالیٰ اپنی روح سے ہماری اور تمہاری تائید فرمائے، جان لو کہ انسان اگرچہ حقیقت میں ایک بندہ ہے اور وہ اپنے اندر عاجزی، کمزوری، ادنیٰ ترین چیزوں کی محتاجی (الافتقار)، اور مچھر کے کاٹنے سے تکلیف محسوس کرتا ہے، اور یہ سب کچھ اپنے نفس سے ذوقاً (ذوق) جانتا ہے، اس کے باوجود وہ سرداری اور برتری کے ساتھ ظاہر ہوتا ہے۔ اور جب بھی وہ دوسروں پر اثر انداز ہونے کی قدرت پاتا ہے تو اثر ڈالتا ہے اور اپنے اندر ان سب کی طلب اور محبت پاتا ہے۔ یہ اس لیے ہے کہ اللہ نے اسے اپنی صورت پر پیدا کیا ہے، اور اللہ تعالیٰ کے لیے ہی عزت، کبریائی اور عظمت ہے۔ پس یہ احکام بندے میں سرایت کر گئے، کیونکہ یہ ایسے احکام ہیں جو اس صورت کی پیروی کرتے ہیں جس پر انسان کو پیدا کیا گیا ہے اور اس کے لیے لازم ہیں۔\n\nپس اللہ کے رجال (مردان خدا) وہ ہیں جنہیں ان کی صورت پر تخلیق نے فقر، ذلت اور عبودیت (بندگی) سے نہیں پھیرا۔ اور جب وہ اس امر کو پاتے ہیں جو ان کی صورت پر تخلیق کا لازمی تقاضا ہے، تو وہ ان مقامات پر اس کے ساتھ ظاہر ہوتے ہیں جنہیں الحق (ذات حق) نے ان کے لیے مقرر کیا ہے کہ وہ ان میں اس کے ساتھ ظاہر ہوں۔ جیسا کہ الحق (ذات حق) کرتا ہے جس کے لیے یہ صفت ذاتی اور نفسی ہے، پس وہ اس کے ساتھ صرف مخصوص مقامات پر ہی ظاہر ہوتا ہے، اور وہ اپنے بندوں کی طرف نزول اور محبت کے ساتھ ظاہر ہوتا ہے، یہاں تک کہ گویا وہ اس میں ان کا محتاج ہے اور اپنے آپ کو ان کے مقام پر رکھتا ہے۔\n\nاور جب الحق (ذات حق) اس صفت کے ساتھ ہے کہ وہ تمہاری صورتوں میں تمہاری طرف نزول فرماتا ہے، تو تم اس صفت کے زیادہ حقدار ہو کہ اس سے جدا نہ ہو اور اس قوتِ صورت کی طرف نہ دیکھو جو تم اپنے اندر پاتے ہو، کیونکہ وہ اس (الحق) کے لیے ہے نہ کہ تمہارے لیے، جیسا کہ تمہارے لیے وہ ہے جس میں وہ تمہاری طرف نازل ہوا، نہ کہ اس کے لیے۔ اور اگر اس کے اسماء الحسنیٰ (حسنیٰ اسماء) تمہارے ساتھ قائم نہ ہوتے اور تم ان سے متصف نہ ہوتے تو تمہارے لیے یہ ممکن نہ ہوتا۔ پس اس کے اسماء کو اس کی صورت پر لوٹا دو نہ کہ اپنے اوپر، اور اس سے وہ لے لو جس میں وہ تمہارے لیے نازل ہوا ہے، کیونکہ وہ تمہاری صفت اور تمہارے اسماء ہیں۔ پس جب تم ایسا کرو گے تو تم اس تک پہنچ جاؤ گے، یعنی تم اہل قربت (قربت والے) میں سے ہو جاؤ گے۔\n\nکیونکہ مقرب (قربت یافتہ) کے لیے قرب اور الحق (ذات حق) کے ساتھ بیٹھنا اور اس سے ہم کلام ہونا، عالم میں مؤثر اسماء الٰہیہ میں سے کوئی الٰہی اسم یا اسماء تنزیہ (تنزیہ کے اسماء) باقی نہیں رکھتا۔ بلکہ وہ اس پر ذلت کے ساتھ داخل ہوتا ہے تاکہ اس کی عزت کا شہود (الشہود) کرے، اور فقر کے ساتھ تاکہ اس کے غنا کا شہود کرے، اور اس کی قدرت کے نفوذ کے لیے آمادگی کے ساتھ۔ پس وہ ان تمام اسماء سے الگ ہو جاتا ہے جو اسے اس صورت کے احکام دیتے ہیں جس پر وہ پیدا کیا گیا ہے۔ یہ سادات اہل طریق (طریقت کے سرداروں) کا مذہب ہے، یہاں تک کہ انہوں نے اس بارے میں کہا کہ دو صادق (سچے) ایک ساتھ نہیں رہ سکتے، بلکہ ایک صادق اور ایک صدیق (تصدیق کرنے والا) ہی ساتھ رہتے ہیں۔ اسی لیے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے کبھی بھی کوئی دستہ نہیں بھیجا، خواہ وہ دو ہی کیوں نہ ہوں، مگر یہ کہ آپ نے ان میں سے ایک کو امیر بنایا اور دوسرے کو تابع۔ اور اگر ایسا نہ ہوتا تو امر اور نظام بگڑ جاتا۔ اور آپ اس میں اصل کے حکم کی پیروی کر رہے تھے، کیونکہ اگر اللہ کے ساتھ کوئی اور معبود ہوتا تو امر اور نظام بگڑ جاتا، جیسا کہ اللہ تعالیٰ نے فرمایا:\n\n**لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا** (اگر آسمانوں اور زمین میں اللہ کے سوا اور معبود ہوتے تو وہ دونوں (آسمان و زمین) بگڑ جاتے۔)\n\nپس جو شخص الحق (ذات حق) کی صحبت چاہتا ہے تو اسے اپنی حقیقت اور اپنی جبلت (فطرت) کے ساتھ، یعنی اپنی ذلت اور محتاجی کے ساتھ اس کی صحبت اختیار کرنی چاہیے، اور جو شخص خلق (مخلوق) کی صحبت چاہتا ہے تو اسے اس چیز کے ساتھ صحبت اختیار کرنی چاہیے جو اس کے رب نے اس کے لیے مشروع کی ہے، نہ کہ اپنے نفس کے ساتھ اور نہ ہی اپنے رب کی صورت کے ساتھ، بلکہ جیسا کہ ہم نے کہا، اس چیز کے ساتھ جو اس کے لیے مشروع کی گئی ہے۔ پس وہ ہر حقدار کو اس کا حق دیتا ہے، تو وہ حق (ذات حق) کی صورت میں بندہ ہوتا ہے یا بندے کی صورت میں حق (ذات حق)، وہ جیسا بھی ہو، اس پر کوئی حرج نہیں۔\n\nاور چونکہ یہ سب کچھ اہل اللہ کا مذہب تھا، اللہ نے ہم پر علم کی اس زیادتی کا کشف (الکشف) فرمایا جس کا اس نے ہم پر احسان کیا، اس کے ساتھ کہ ہم ان کے اس مذہب میں شریک ہیں جس کی طرف وہ گئے ہیں، کہ اللہ نے ہمیں مطلع کیا ہے کہ وہ تمام چیزیں جن سے بندہ موسوم ہوتا ہے اور جن سے اس کا متصف ہونا اور اس پر نام کا اطلاق کرنا حق ہے، ان میں اور ان اسماء الٰہیہ میں کوئی فرق نہیں جن سے وہ متصف ہوتا ہے، پس سب کے سب اسماء الٰہیہ ہیں۔ لہٰذا وہ ہر اس چیز میں جس کے ساتھ وہ ظاہر ہوتا ہے، جس کا انہوں نے ذکر کیا ہے اور جو ان کے نزدیک عبودیت (بندگی) اور صورت کا تقاضا ہے، وہ اس کا نہیں ہے، بلکہ وہ اللہ کے لیے ہے۔ اور اس کے لیے اپنے نفس سے سوائے اس کی عین (ذات) کے کچھ نہیں، اور اس کی عین (ذات) نے صفتِ الوجود (ہستی کی صفت) اس کے سوا کسی سے حاصل نہیں کی، پس اس نے اسے جس نام سے بھی موسوم کیا، وہ اللہ تعالیٰ کے لیے ہے۔ پس جب بندہ اپنے تمام اسماء سے نکل جاتا ہے جو اس کی جبلت (فطرت) اور اس صورت کا تقاضا ہیں جس پر وہ پیدا کیا گیا ہے، یہاں تک کہ اس کی عین (ذات) کے سوا کچھ باقی نہیں رہتا، بغیر کسی صفت یا نام کے سوائے اس کی عین (ذات) کے، تب وہ اللہ کے نزدیک مقربین (قربت یافتہ) میں سے ہوتا ہے۔ اور ہمارے شیخ ابو یزید البسطامی نے اس قول پر ہماری موافقت کی، جہاں انہوں نے فرمایا: \"اور اب میری کوئی صفت نہیں ہے۔\" یعنی جب اللہ نے انہیں اس مقام پر قائم کیا۔ پس بندے کی تمام صفات اللہ کی طرف سے عاریت ہیں، لہٰذا وہ حقیقت میں اللہ کے لیے ہیں، اور ہم ان سے متصف ہوئے تو ہم نے انہیں ادب کے طور پر قبول کیا، اس علم کے ساتھ کہ وہ اس کے لیے ہیں نہ کہ ہمارے لیے، کیونکہ ہماری حقیقت اعتراض نہ کرنا ہے، بلکہ محض ذاتی تسلیم ہے، نہ کہ وہ تسلیم جو اس کی صفت ہے، کیونکہ وہ اس کے لیے ہے۔\n\nپس جب بندے کے پاس اپنی ذات سے سوائے اس کی عین (ذات) کے کچھ نہیں ہے، تو بالضرورت الحق (ذات حق) ہی اس کی تمام صفات ہوتا ہے اور اسے کہتا ہے: \"تو میرا حقیقی بندہ ہے۔\" پس حقیقت میں کسی سننے والے نے الحق (ذات حق) کے سوا کسی سے نہیں سنا، اور نہ ہی اس کے سوا کسی سے دیکھا، اور نہ ہی اس کے سوا کسی سے جانا، اور نہ ہی کوئی زندہ ہوا، نہ قدرت رکھی، نہ حرکت کی، نہ ساکن ہوا، نہ ارادہ کیا، نہ قہر کیا، نہ عطا کیا، نہ منع کیا، اور نہ ہی اس پر یا اس سے کوئی ایسا امر ظاہر ہوا جو اس کی عین (ذات) ہو، مگر وہ الحق (ذات حق) ہے نہ کہ بندہ۔ پس بندے کے لیے سوائے اس کی عین (ذات) کے کچھ نہیں، خواہ وہ اسے جانے یا نہ جانے۔ اور علماء نے صرف اسی قدر علم کے ذریعے فوز (کامیابی) حاصل کی ہے ہر اس چیز کے حق میں جو اللہ کے سوا ہے، نہ کہ وہ پہلے نہ تھے اور بعد میں ایسے ہو گئے۔ پس:\n\n**لِمِثْلِ هذا فَلْيَعْمَلِ الْعامِلُونَ** (تو ایسے ہی کے لیے عمل کرنے والوں کو عمل کرنا چاہیے)\n\nاور ایسے ہی میں:\n\n**فَلْيَتَنافَسِ الْمُتَنافِسُونَ** (مقابلہ کرنے والوں کو مقابلہ کرنا چاہیے)\n\nاور **وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔)",
    "fa": "باب چهارصد و نهم در معرفت منازل اسم‌های من که حجابی بر تو هستند؛ اگر آن‌ها را برداری، به من خواهی رسید.\n\nحجاب تو، اسم‌ها و نعت‌های (نعوت) ما هستند\nو اعیان (أعيان) ما، اکوان (أكوان) ما هستند، پس می‌گوییم:\n\nدولت درخشان از آن ماست، نه از آن دیگری\nو هیچ غیری جز پروردگار ما نیست، پس حمله می‌کنیم.\n\nبر چه کسی؟ پس آنچه می‌گویی را محقق کن، و همانا\nاین سخن را ستمگر و نادان می‌گوید.\n\nپس هر گفتاری که در آن غیر (غیر) مقید نباشد،\nهمه مقالات من به سوی او بازمی‌گردد.\n\nپس پرده‌ها را میان من و او بالا مبر،\nزیرا آن هستی (وجود) است که راهی به سوی آن نیست.\n\n### [همانا انسان ضعیف و فقیر است]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که انسان اگرچه در نفس‌الامر (نفس الأمر) بنده است و در وجود خود آنچه را که بر آن است از عجز، ضعف، نیاز به کوچک‌ترین چیزها و درد کشیدن از نیش یک کک می‌یابد و همه این‌ها را از خود به صورت ذوقی (ذوقاً) می‌شناسد؛ با این حال، به ریاست و پیشوایی تظاهر می‌کند و هرگاه بتواند در دیگری تأثیر بگذارد، تأثیر می‌گذارد و در خود طلب و محبت همه این‌ها را می‌یابد. این بدان سبب است که خداوند او را بر صورت (صورة) خود آفرید و برای او (حق تعالی) عزت، کبریا و عظمت است. پس این احکام در بنده جاری شده‌اند، زیرا آن‌ها احکامی هستند که از صورتی که انسان بر آن آفریده شده، تبعیت می‌کنند و لازمه آن هستند.\n\nپس مردان خدا کسانی هستند که آفرینش آن‌ها بر صورت (صورة)، ایشان را از فقر، ذلت و عبودیت (عبودية) بازنداشته است. و چون این امری را که آفرینش آن‌ها بر صورت اقتضا کرده است، بیابند (و ناگزیرند)، در مواطنی که حق (الحق) برایشان تعیین کرده است تا در آنجا به آن تظاهر کنند، ظاهر می‌شوند؛ همان‌گونه که حق (الحق) که این صفت برای او ذاتی و نفسی است، عمل می‌کند و جز در مواطن مخصوص به آن ظاهر نمی‌شود و با نزول و اظهار محبت به بندگانش ظاهر می‌شود، تا جایی که گویی در آن فقیر به آن‌هاست و خود را در مقام آن‌ها قرار می‌دهد. و چون حق (الحق) دارای این صفت است که در صورت‌های شما به سوی شما نازل شود، شما به این نعت سزاوارترید که از آن جدا نشوید و به آنچه از قوت صورت (صورة) در خود می‌یابید، ننگرید؛ زیرا آن قوت از آنِ اوست نه از آنِ شما، همان‌گونه که آنچه در آن به سوی شما نازل شده، از آنِ شماست نه از آنِ او. و اگر اسمای حسنای (أسماء الحسنى) او در شما قائم نمی‌شد و شما به آن‌ها متصف نمی‌گشتید، این امر برای شما ممکن نمی‌شد. پس اسم‌های او را به صورت (صورة) او بازگردانید، نه به خودتان، و آنچه را که در آن برای شما نازل شده است، از او بگیرید، زیرا آن نعت و اسم‌های شماست. اگر چنین کنید، به او خواهید رسید، یعنی از اهل قربت (قربة) خواهید بود.\n\nزیرا مقرب (المقرب) برایش قرب و همنشینی با حق (الحق) و سخن گفتن با او باقی نمی‌ماند، نه به عنوان اسم الهی (اسماً إلهياً) از اسم‌های مؤثر در عالم و نه از اسم‌های تنزیه (تنزيه). بلکه با ذلت (ذلة) به دلیل شهود (شهود) عزت او، و با فقر (فقر) به دلیل شهود غنای او، و با آمادگی برای نفوذ قدرت او بر او وارد می‌شود. پس از همه اسم‌هایی که احکام صورتی (صورة) را که بر آن آفریده شده به او می‌دهند، بیرون می‌آید. این مذهب سادات اهل طریق (أهل الطريق) است تا جایی که در این باره گفته‌اند: دو صادق با هم مصاحبت نمی‌کنند، بلکه یک صادق و یک صدیق با هم مصاحبت می‌کنند. به همین دلیل، رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) هرگز گروهی را اعزام نکرد، حتی اگر دو نفر بودند، مگر اینکه یکی را مقدم می‌داشت و دیگری را تابع قرار می‌داد. اگر چنین نبود، امر و نظام فاسد می‌شد. و او در این کار از حکم اصل تبعیت می‌کند، زیرا اگر با خداوند، اله دیگری بود، امر و نظام فاسد می‌شد، چنانکه فرمود: **لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا** (اگر در آسمان و زمین خدایانی جز الله می‌بود، قطعاً تباه می‌شدند). پس هر کس مصاحبت حق (الحق) را می‌خواهد، باید با حقیقت و جبلت خود که همان ذلت و افتقار اوست، با او مصاحبت کند. و هر کس مصاحبت خلق را می‌خواهد، باید با آنچه پروردگارش برای او تشریع کرده است، با او مصاحبت کند، نه با نفس خود و نه با صورت (صورة) پروردگارش، بلکه همان‌گونه که گفتیم، با آنچه برای او تشریع شده است. پس حق هر صاحب حقی را ادا می‌کند و در نتیجه، بنده در صورت حق (حق) یا حق در صورت بنده خواهد بود، هر طور که باشد، بر او حرجی نیست.\n\nو چون همه این‌ها مذهب اهل الله بود، خداوند از فزونی دانشی که بر ما منت نهاده است، برای ما کشف کرد، با وجود اینکه ما با ایشان در آنچه بدان رفته‌اند شریک هستیم، که خداوند ما را آگاه ساخت که میان هر آنچه بنده به آن نامیده می‌شود و سزاوار است که به آن نعت داده شود و اسم بر او اطلاق گردد، با آنچه از اسمای الهی (الأسماء الإلهية) به آن نعت داده می‌شود، تفاوتی نیست. پس همه، اسمای الهی هستند. بنابراین، هر آنچه بنده با آن ظاهر می‌شود از آنچه ذکر کردند و عبودیت (العبودية) و صورت (الصورة) نزد آن‌ها اقتضا می‌کند، از آنِ او نیست، بلکه آن از آنِ خداست. و آنچه از نفس خود دارد، جز عین (عينه) او نیست، و عین او صفت هستی (الوجود) را جز از او تعالی کسب نکرده است. پس او را به هیچ اسمی نام نبرده است مگر اینکه آن اسم از آنِ او تعالی است. پس هرگاه بنده از همه اسم‌های خود که جبلت و صورتی (الصورة) که بر آن آفریده شده اقتضا می‌کند، خارج شود، تا جایی که جز عین او بدون صفت و اسم باقی نماند، در آن هنگام نزد خداوند از مقربین (المقربين) خواهد بود. و شیخ ما ابویزید بسطامی با این قول ما موافق است، آنجا که گفت: «و من اکنون صفتی ندارم»، یعنی هنگامی که خداوند او را در این مقام قرار داد.\n\nپس همه صفات بنده عاریه‌ای از نزد خداوند است؛ آن‌ها در حقیقت از آنِ خدا هستند و ما به آن‌ها نعت داده شده‌ایم، پس آن‌ها را از روی ادب پذیرفتیم، با علم به اینکه آن‌ها از آنِ او هستند نه از آنِ ما؛ زیرا از حقیقت ما عدم اعتراض است، بلکه تسلیم ذاتی محض است، نه تسلیمی که صفتی برای او باشد، زیرا آن تسلیم از آنِ اوست. پس اگر بنده از ذات خود جز عین (عينه) خود را نداشته باشد، بالضروره حق (الحق) همه صفات او خواهد بود و به او می‌گوید: تو بنده حقیقی من هستی. پس هیچ شنونده‌ای در نفس‌الامر (نفس الأمر) نشنیده است مگر به حق (الحق)، و ندیده است مگر به او، و ندانسته است مگر به او، و زنده نبوده و قدرت نداشته و حرکت نکرده و ساکن نشده و اراده نکرده و قهر نکرده و عطا نکرده و منع نکرده و هیچ امری که عین او باشد، بر او و از او ظاهر نشده است، مگر اینکه آن حق (الحق) است نه بنده. پس بنده را جز عین (عينه) او نیست، چه این را بداند و چه نداند. و علما رستگار نشدند مگر به علمشان به همین اندازه در حق هر آنچه غیر خداست، نه اینکه پس از آنکه نبودند، چنین شدند. پس **لِمِثْلِ هذا فَلْيَعْمَلِ الْعامِلُونَ** (برای چنین چیزی باید عمل‌کنندگان عمل کنند) و در مثل این باید **فَلْيَتَنافَسِ الْمُتَنافِسُونَ** (رقابت‌کنندگان رقابت کنند). و **والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 2
}