{
  "id": 35,
  "title": {
    "ar": "الباب الخامس والثلاثون في معرفة هذا الشخص المحقق في منزل الأنفاس وأسراره بعد موته رضي الله عنه",
    "en": "Chapter Thirty-Five: Concerning the Gnosis (معرفة) of this Realized Person (الشخص المحقق) in the Station of the Breaths (منزل الأنفاس) and his Secrets after his Death, may Allah be pleased with him.",
    "ur": "باب پینتیسواں: اس محقق شخص کی معرفت میں جو منزلِ انفاس (منزل الأنفاس) اور اس کے اسرار میں ہے، اس کی وفات کے بعد رضی اللہ عنہ۔",
    "fa": "باب سی و پنجم در معرفت این شخص محقق در منزل انفاس (الأنفاس) و اسرار آن پس از مرگ او، رضی الله عنه"
  },
  "content": {
    "ar": "## (الباب الخامس والثلاثون في معرفة هذا الشخص المحقق في منزل الأنفاس وأسراره بعد موته رضي الله عنه)\n\n\n(بسم الله الرحمن الرحيم)\n\n\n> العبد من كان في حال الحياة به *** كحاله بعد موت الجسم والروح‏\n\n\n> والعبد من كان في حال الحجاب به *** نورا كإشراق ذات الأرض من يوح‏\n\n\n> فحالة الموت لا دعوى تصاحبها *** كما الحياة لها الدعوى بتصريح‏\n\n\n> في حق قوم وفي قوم تكون لهم *** تلك الدعاوي بإيماء وتلويح‏\n\n\n> فإن فهمت الذي قلناه قمت به *** وزنا تنزه عن نقص وترجيح‏\n> وكنت ممن تزكيه حقائقه *** ولا سبيل إلى طعن وتجريح‏\n\n\n> وإن جهلت الذي قلناه جئت إلى *** دار السؤال بصدر غير مشروح‏\n\n\n### [الإيمان والكشف‏]\n\n\nاعلم أيدك الله بروح القدس أن هذا الشخص المحقق في منزل الأنفاس أي شخص كان فإن حاله بعد موته يخالف سائر أحوال الموتى فلنذكر أولا حصر مآخذ أهل الله العلوم من الله كما قررناه في الباب قبل هذا ولنذكر ما لهم وآثار تلك المأخذ في ذواتهم فلنقل اعلم يا أخي أن علم أهل الله المأخوذ من الكشف إنه على صورة الايمان سواء فكل ما يقبله الايمان عليه يكون كشف أهل الله فإنه حق كله والمخبر به وهو النبي صلى الله عليه وسلم مخبر به عن كشف صحيح وذوات العلماء بالله تعالى تكون على صفة الشي‏ء الذي تأخذ منه العلم بالله أي شي‏ء كان‏\n\n\n### [الصفات النفسية والمعنوية]\n\n\nواعلم أن الصفات على نوعين صفات نفسية وصفات معنوية فالصفات المعنوية في الموصوف هي التي إذا رفعتها عن الذات الموصوفة بها لم ترتفع الذات التي كانت موصوفة بها والصفات النفسية هي التي إذا رفعتها عن الموصوف بها ارتفع الموصوف بها ولم يبق له عين في الوجود العيني ولا في الوجود العقلي حيث ما رفعتها ثم إنه ما من صفة نفسية للموصوف التي هي ليست بشي‏ء زائد على ذاته إلا ولها صفة نفسية بها يمتاز بعضها عن بعض فإنه قد تكون ذات الموصوف مركبة من صفتين نفسيتين إلى ما فوق ذلك وهي الحدود الذاتية وهنا باب مغلق لو فتحناه لظهر ما يذهب بالعقول ويزيل الثقة بالمعلوم وربما كان يؤول الأمر في ذلك إلى أن يكون السبب الأول من صفات نفس الممكنات كما أنك إذا جعلت السبب شرطا في وجود المشروط ورفعت الشرط ارتفع المشروط بلا شك ولا يلزم العكس فهذا يطرد ولا ينعكس فتركناه مقفلا لمن يجد مفتاحه فيفتحه‏\n\n\n### [العلوم الصحيح: المعرفة الصوفية]\n\n\nوإذا كان الأمر عندنا وعند كل عاقل بهذه المثابة فقد علمت إن الصفات معان لا تقوم بأنفسها وما لها ظهور إلا في عين الموصوف والصفات النفسية معان وهي عين الموصوف والمعاني لا تقوم بأنفسها فكيف تكون هي عين الموصوف لا غيره فيوصف الشي‏ء بنفسه وصار قائما بنفسه من حقيقته ألا يقوم بنفسه فإن كل موصوف هو مجموع صفاته النفسية والصفات لا تقوم بأنفسها وما ثم ذات غيرها تجمعها وتظهر وقد نبهتك على أمر عظيم لتعرف لما ذا يرجع علم العقلاء من حيث أفكارهم ويتبين لك أن العلم الصحيح لا يعطيه الفكر ولا ما قررته العقلاء من حيث أفكارهم وأن العلم الصحيح إنما هو ما يقذفه الله في قلب العالم وهو نور إلهي يختص به من يَشاءُ من عِبادِهِ من ملك ورسول ونبي وولي ومؤمن ومن لا كشف له لا علم له‏\n\n\n### [التعريف الإلهي بما تحيله العقول: «المتشابه» و«المعجزة»]\n\n\nولهذا جاءت الرسل والتعريف الإلهي بما تحيله العقول فتضطر إلى التأويل في بعضها لتقبله وتضطر إلى التسليم والعجز في أمور لا تقبل التأويل أصلا وغايته أن يقول له وجه لا يعلمه إلا الله لا تبلغه عقولنا وهذا كله تأنيس للنفس لا علم حتى لا ترد شيئا مما جاءت به النبوة هذا حال المؤمن العاقل وأما غير المؤمن فلا يقبل شيئا من ذلك وقد وردت أخبار كثيرة مما تحيلها العقول منها في الجناب العالي ومنها في الحقائق وانقلاب الأعيان فأما التي في الجناب العالي فما وصف الحق به نفسه في كتابه وعلى لسان رسله مما يجب الايمان به ولا يقبله العقل بدليله على ظاهره إلا إن تأوله بتأويل بعيد فإيمانه إنما هو بتأويله لا بالخبر ولم يكن له كشف إلهي كما كان للنبي فيعرف مراد الحق في ذلك الخبر فوصف نفسه سبحانه بالظرفية الزمانية والمكانية ووصفه بذلك رسوله صلى الله عليه وسلم وجميع الرسل وكلهم على لسان واحد في ذلك لأنهم يتكلمون عن إل واحد\n\n\n### [إله العقل وإله الإيمان والكشف‏]\n\n\nوالعقلاء أصحاب الأفكار اختلفت مقالاتهم في الله تعالى على قدر نظرهم فالإله الذي يعبد بالعقل مجردا عن الايمان كأنه بل هو إله موضوع بحسب ما أعطاه نظر ذلك العقل فاختلفت حقيقته بالنظر إلى كل عقل وتقابلت العقول وكل طائفة من أهل العقول تجهل الأخرى بالله وإن كانوا من النظار الإسلاميين المتأولين فكل طائفة تكفر الأخرى والرسل صلوات الله عليهم من آدم عليه السلام إلى محمد صلى الله عليه وسلم ما نقل عنهم اختلاف فيما ينسبونه إلى الله من النعوت بل كلهم على لسان واحد في ذلك والكتب التي جاءوا بها كلها تنطق في حق الله بلسان واحد ما اختلف منهم اثنان يصدق بعضهم بعضا مع طول الأزمان وعدم الاجتماع وما بينهم من الفرق المنازعين لهم من العقلاء ما اختل نظامهم وكذلك المؤمنون بهم على بصيرة المسلمون المسلمون الذين لم يدخلوا نفوسهم في تأويل فهم أحد رجلين إما رجل آمن وسلم وجعل علم ذلك إليه إلى أن مات وهو المقلد وإما\nرجل عمل بما علم من فروع الأحكام واعتقد الايمان بما جاءت به الرسل والكتب فكشف الله عن بصيرته وصيره ذا بصيرة في شأنه كما فعل بنبيه ورسوله صلى الله عليه وسلم وأهل عنايته فكاشف وأبصر ودعا إلى الله عز وجل على بصيرة كما قال الله تعالى في حق نبيه صلى الله عليه وسلم مخبرا له أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي وهؤلاء هم العلماء بالله العارفون وإن لم يكونوا رسلا ولا أنبياء فهم على بينة من ربهم في علمهم به وبما جاء من عنده‏\n\n\n### [المتشابهات: تأويلها أو التسليم بها]\n\n\nوكذلك وصف نفسه بكثير من صفات المخلوقين من المجي‏ء والإتيان والتجلي للأشياء والحدود والحجب والوجه والعين والأعين واليدين والرضي والكراهة والغضب والفرح والتبشبش وكل خبر صحيح ورد في كتاب وسنة والأخبار أكثر من أن تحصى مما لا يقبلها إلا مؤمن بها من غير تأويل أو بعض أرباب النظر من المؤمنين بتأويل أضطره إليه إيمانه فانظر مرتبة المؤمن ما أعزها ومرتبة أهل الكشف ما أعظمها حيث ألحقت أصحابها بالرسل والأنبياء عليهم السلام فيما خصوا به من العلم الإلهي لأن العلماء ورثة الأنبياء وما ورثوا دينارا ولا درهما بل ورثوا العلم‏\n\n\nيقول صلى الله عليه وسلم إنا معشر الأنبياء لا نورث ما تركنا صدقة\n\n\nفمن كان عنده شي‏ء من هذه الدنيا فليوقفه صدقة على من يراه من الأقربين إلى الله فهو النسب الحقيقي أو يزهد فيه ولا يترك شيئا يورث عنه إن أراد أن يلحق بهم ولا يرث أحدا فالحمد لله الذي أعطانا من هذا المقام الحظ الوافر فهذا بعض ما ورد علينا من الله عز وجل في الله تعالى من الأوصاف‏\n\n\n### [قلب الحقائق والمعجزات‏]\n\n\nوأما في قلب الحقائق فلا خلاف بين العقلاء في أنه لا يكون ودل دليل العقل القاصر من جهة فكره ونظره لا من جهة إيمانه وقبوله إذ لا أعقل من الرسل وأهل الله إن الأعيان لا تنقلب حقيقة في نفسها وإن الصفات والأعراض في مذهب من يقول إنها أعيان موجودة لا نقوم بأنفسها ولا بد لها من محل قائم بنفسه أو غير قائم بنفسه لكنه في قائم بنفسه ولا بد ومثال الأول السواد مثلا أو أي لون كان لا يقوم إلا بمحل يقال فيه لقيام السواد به أسود ومثال الثاني كالسواد المشرق مثلا فالسواد هو المشرق فإنه نعت له فهذا معنى قولي أو غير قائم بنفسه لكنه في قائم بنفسه وهذه مسألة خلاف بين النظار هل يقوم المعنى بالمعنى فمن قائل به ومانع من ذلك وقد ثبت أن جميع الأعمال كلها أعراض وإنها تفني ولا بقاء لها وإنه ليس لها عين موجودة بعد ذهابها ولا توصف بالانتقال وإن الموت إما عرض موجود في الميت في مذهب بعض النظار وإما نسبة افتراق بعد اجتماع وكذا جميع الأكوان في مذهب بعضهم وهو الصحيح الذي يقتضيه الدليل وعلى كل حال فإنه لا يقوم بنفسه‏\n\n\n### [مراتب العلماء في المتشابهات‏]\n\n\nووردت الأخبار النبوية بما يناقض هذا كله مع كوننا مجمعين على إن الأعمال أعراض أو نسب‏\n\n\nفقال الشارع وهو الصادق صاحب العلم الصحيح والكشف الصريح إن الموت يجاء به يوم القيامة في صورة كبش أملح يعرفه الناس ولا ينكره أحد فيذبح بين الجنة والنار روى أن يحيى عليه السلام هو الذي يضجعه ويذبحه بشفرة تكون في يده والناس ينظرون إليه‏\n\n\nوورد أيضا في الخبر أن عمل الإنسان يدخل معه في قبره في صورة حسنة أو قبيحة فيسأله صاحبه فيقول أنا عملك وأن مانع الزكاة يأتيه ماله شجاعا أقرع له زبيبتان‏\n\n\nوأمثال هذا في الشرع لا تحصى كثرة فأما المؤمنون فيؤمنون بهذا كله من غير تأويل وأما أهل النظر من أهل الايمان وغيرهم فيقولون حمل هذا على ظاهره محال عقلا وله تأويل فيتأولونه بحسب ما يعطيهم نظرهم فيه ثم يقولون أهل الايمان منهم عقيب تأويلهم والله أعلم يعني في ذلك التأويل الخاص الذي ذهب إليه هل هو المراد لله أم لا وأما حمله على ظاهره فمحال عندهم جملة واحدة والايمان إنما يتعلق بلفظ الشارع به خاصة هذا هو اعتقاد أهل الأفكار\n\n\n### [صفات الممكنات نسب وإضافات بينها وبين الحق‏]\n\n\nوبعد أن بينا لك هذه الأمور ومراتب الناس فيها فإنها من هذا الباب الذي نحن بصدده فاعلم أنه ما ثم إلا ذوات أوجدها الله تعالى فضلا منه عليها قائمة بأنفسها وكل ما وصفت به فنسب وإضافات بينها وبين الحق من حيث ما وصفت فإذا أوجد الموجد قيل فيه إنه قادر على الإيجاد ولو لا ذاك ما أوجد وإذا خصص الممكن بأمر دون غيره مما يجوز أن يقوم به قيل مريد ولو لا ذلك ما خصصه بهذا دون غيره وسبب هذا كله إنما تعطيه حقيقة الممكن فالممكنات أعطت هذه النسب فافهم إن كنت ذا لب ونظر إلهي وكشف رحماني‏\n\n\n### [مآخذ العلوم: مصادر المعرفة]\n\n\nوقد قررنا في الباب الذي قبل هذا أن مآخذ العلوم من طرق مختلفة وهي السمع والبصر والشم واللمس والطعم والعقل من حيث ضرورياته وهو ما يدركه بنفسه من غير قوة أخرى ومن حيث فكره الصحيح أيضا مما يرجع إلى طرق الحواس أو الضروريات والبديهيات‏\nلا غير فذلك يسمى علما والأمور العارضة الحاصل عنها العلوم أيضا ترجع إلى هذه الأصول لا تنفك عنها وإنما سميت عوارض من أجل أن العادة في إدراك الألوان إن اللمس لا يدركها وإنما يدركها البصر فإذا أدركها الأكمه باللمس وقد رأينا ذلك فقد عرض لحاسة اللمس ما ليس من حقيقتها في العادة أن تدركه وكذلك سائر الطرق إذا عرض لها درك ما ليس من شأنها في العادة أن يدرك بها يقال فيه عرض لها\n\n\n### [المعرفة الغير العادية والاقتدار الإلهي‏]\n\n\nوإنما فعل الله هذا تنبيها لنا أنه ما ثم حقيقة كما يزعم أهل النظر لا ينفذ فيها الاقتدار الإلهي بل تلك الحقيقة إنما هي بجعل الله لها على تلك الصورة وإنها ما أدركت الأشياء المربوط إدراكها بها من كونها بصرا ولا غير ذلك يقول الله بل بجعلنا فيدرك جميع العلوم كلها بحقيقة واحدة من هذه الحقائق إذا شاء الحق فلهذا قلنا عرض لها إدراك ما لم تجر العادة بإدراكها إياه فتعلم قطعا أنه عز وجل قد يكون مما يعرض لها أن تعلم وترى من ليس كمثله شي‏ء وإن كانت الإدراكات لم تدرك شيئا قط إلا ومثله أشياء كثيرة من جميع المدركات‏\n\n\n### [أولية الإدراك ونفي المثلية عن الله‏]\n\n\nولم ينف سبحانه عن إدراكه قوة من القوي التي خلقها إلا البصر فقال لا تُدْرِكُهُ الْأَبْصارُ فمنع ذلك شرعا وما قال لا يدركه السمع ولا العقل ولا غيرهما من القوي الموصوف بها الإنسان كما لم يقل أيضا إن غير البصر يدركه بل ترك الأمر مبهما وأظهر العوارض التي تعرض لهذه القوي في معرض التنبيه أنه ربما وضع ذلك في رؤيتنا من لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ كما رأينا أول مرئي وسمعنا أول مسموع وشممنا أول مشموم وطعمنا أول مطعوم ولمسنا أول ملموس وعقلنا أول معقول مما لم يكن له مثل عندنا وإن كان له أمثال في نفس الأمر ولكن في أولية الإدراك سر عجيب في نفي المماثلة له فقد أدرك المدرك من لا مثل له عنده فيقيسه عليه وكون ذلك المدرك يقبل لذاته المثل أو لا يقبله حكم آخر زائد على كونه مدركا لا يحتاج إليه في الإدراك إن كنت ذا فطنة\n\n\n### [التوسع الإلهي ونفي المثلية في الأعيان‏]\n\n\nبل نقول إن التوسع الإلهي يقتضي أن لا مثل في الأعيان الموجودة وأن المثلية أمر معقول متوهم فإنه لو كانت المثلية صحيحة ما امتاز شي‏ء عن شي‏ء مما يقال هو مثله فذلك الذي امتاز به الشي‏ء عن الشي‏ء هو عين ذلك الشي‏ء وما لم يمتاز به عن غيره فما هو إلا عين واحدة فإن قلت رأيناه مفترقا مفارقا ينفصل هذا عن هذا مع كونه يماثله في الحد والحقيقة يقال له أنت الغالط فإن الذي وقع به الانفصال هو المعبر عنه بأنه تلك العين وما لم يقع به الانفصال هو الذي توهمت أنه مثل وهذا من أغمض مسائل هذا الباب فما ثم مثل أصلا ولا يقدر على إنكار الأمثال ولكن بالحدود لا غير ولهذا انطلق المثلية من حيث الحقيقة الجامعة المعقولة لا الموجودة فالأمثال معقولة لا موجودة فنقول في الإنسان إنه حيوان ناطق بلا شك وأن زيدا ليس هو عين عمرو من حيث صورته وهو عين عمرو من حيث إنسانيته لا غيره أصلا وإذا لم يكن غيره في إنسانيته فليس مثله بل هو هو فإن حقيقة الإنسانية لا تتبعض بل هي في كل إنسان بعينها لا بجزئيتها فلا مثل لها وهكذا جميع الحقائق كلها فلم تصح المثلية إذا جعلتها غير عين المثل فزيد ليس مثل عمرو من حيث إنسانيته بل هو هو وليس زيد مثل عمرو في صورته فإن الفرقان بينهما ظاهر ولو لا الفارق لالتبس زيد بعمرو ولم تكن معرفة بالأشياء فما أدرك المدرك أي شي‏ء أدرك إلا من لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\n\n\n### [أصل الوجود: لا مثل له، العين الموجودة عنه: لا مثل لها]\n\n\nوذلك لأن الأصل الذي نرجع إليه في وجودنا وهو الله تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فلا يكون ما يوجد عنه إلا على حقيقة أنه لا مثل له فإنه كيف يخلق ما لا تعطيه صفته وحقيقته لا تقبل المثل فلا بد أن يكون كل جوهر فرد في العالم لا يقبل المثل إن كنت ذا فطنة ولب فإنه ليس في الإله حقيقة تقبل المثل فلو كان قبول المثل موجودا في العالم لاستند في وجوده من ذلك الوجه إلى غير حقيقة إلهية وما ثم موجد إلا الله ولا مثل له فما في الوجود شي‏ء له مثل بل كل موجود متميز عن غيره بحقيقة هو عليها في ذاته وهذا هو الذي يعطيه الكشف والعلم الإلهي الحق فإذا أطلقت المثل على الأشياء كما قد تقرر فاعلم أني أطلق ذلك عرفا قال تعالى أُمَمٌ أَمْثالُكُمْ أي كما انطلق عليكم اسم الأمة كذلك ينطلق اسم أمة على كل دابة وطائِرٍ يَطِيرُ بِجَناحَيْهِ وكما إن كل أمة وكل عين في الوجود ما سوى الحق تفتقر في إيجادها إلى موجد نقول بتلك النسبة في كل واحد إنه مثل للآخر في الافتقار إلى الله وبهذا يصح قطعا إن الله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ بزيادة الكاف أو بفرض المثل فإنك إذا عرفت أن كل محدث لا يقبل المثلية كما قررناه لك فالحق أولى بهذه الصفة فلم تبق المثلية الواردة في القرآن وغيره إلا في الافتقار إلى الله الموجد أعيان الأشياء\n\n\n### [علم أهل الله بالأشياء: المعرفة الصوفية: المعرفة الغير العادية]\n\n\nثم ارجع وأقول إن كل واحد من أهل الله لا يخلو أن يكون قد جعل الله علم هذا الشخص‏\nبالأشياء في جميع القوي أو في قوة بعينها كما قررنا إما في الشم وهو صاحب علم الأنفاس وإما في النظر فيقال هو صاحب نظر وإما في الضرب وهو من باب اللمس بطريق خاص ولذلك كني عن ذلك بوجود برد الأنامل فينسب صاحب تلك الصفة التي بها تحصل العلوم إليها فيقال هو صاحب كذا كما قررنا إن الصفة هي عين الموصوف في هذا الباب أعني الصفة النفسية فكما رجع المعنى الذي يقال فيه إنه لا يقوم بنفسه صورة قائمة بنفسها رجعت الصورة التي هي هذا العالم معنى لتحققه بذلك المعنى وتألفه به كما تألفت هذه المعاني فصار من تأليفها ذات قائمة بنفسها يقال فيها جسم وإنسان وفرس ونبات فافهم فيصير صاحب علم الذوق ذوقا وصاحب علم الشم شما ومعنى ذلك أنه يفعل في غيره ما يفعل الذوق فيه إن كان صاحب ذوق أو ما فعل الشم فيه إن كان صاحب شم فقد التحق في الحكم بمعناه وصار هو في نفسه معنى يدرك به المدرك الأشياء كما يدرك الرائي بالنظر في المرآة الأشياء التي لا يدركها في تلك الحالة إلا بالمرآة كان للشيخ أبي مدين ولد صغير من سوداء وكان أبو مدين صاحب نظر فكان هذا الصبي وهو ابن سبع سنين ينظر ويقول أرى في البحر في موضع صفته كذا وكذا سفنا وقد جرى فيها كذا وكذا فإذا كان بعد أيام وتجي‏ء تلك السفن إلى بجاية مدينة هذا الصبي التي كان فيها يوجد الأمر على ما قاله الصبي فيقال للصبي بما ذا ترى فيقول بعيني ثم يقول لا إنما أراه بقلبي ثم يقول لا إنما أراه بوالدي إذا كان حاضرا ونظرت إليه رأيت هذا الذي أخبركم به وإذا غاب عني لا أرى شيئا من ذلك‏\n\n\nورد في الخبر الصحيح عن الله تعالى في العبد الذي يتقرب إلى الله بالنوافل حتى بحبه يقول فإذا أحببته كنت سمعه الذي يسمع به وبصره الذي يبصر به‏\n\n\nالحديث فبه يسمع ويبصر ويتكلم ويبطش ويسعى فهذا معنى قولنا يرجع المحقق بمثل صورة معنى ما تحقق به فكان ينظر بأبيه كما ينظر الإنسان بعينه في المرآة فافهم وهكذا كل صاحب طريق من طرق هذه القوي وقد يجمع الكل واحد فيرى بكل قوة ويسمع بكل قوة ويشم بكل قوة وهو أتم الجماعة\n\n\n### [المحقق في منزل الأنفاس: أحواله وصفاته بعد موته‏]\n\n\nوأما أحوالهم بعد موتهم فعلى قدر ما كانوا عليه في الدنيا من التفرغ لأمر ما معين أو أمور مختلفة على قدر ما تحققوا به في التفرغ له وهم في الآخرة على قدر أحوالهم في الدنيا فمن كان في الدنيا عبدا محضا كان في الآخرة ملكا محضا ومن كان في الدنيا يتصف بالملك ولو في جوارحه أنها ملك له نقص من ملكه في الآخرة بقدر ما استوفاه في الدنيا ولو أقام العدل في ذلك وصرفه فيما أوجب الله عليه أن يصرفه فيه شرعا وهو يرى أنه مالك لذلك لغفلة طرأت منه فإن وبال ذلك يعود عليه ويؤثر فيه فلا أعز في الآخرة ممن بلغ في الدنيا غاية الذل في جناب الحق والحقيقة ولا أذل في الآخرة ممن بلغ في الدنيا غاية العزة في نفسه ولو كان مصفوعا في الدنيا ولا أريد بعز الدنيا أن يكون فيها ملكا إلا أن يكون صفته في نفسه العزة وكذلك الذلة وأما أن يكون في ظاهر الأمر ملكا أو غير ذلك فما نبالي في أي مقام وفي أي حال أقام الحق عبده في ظاهره وإنما المعتبر في ذلك حاله في نفسه‏\n\n\n### [الحياة النفسية بعد الموت‏]\n\n\nذكر عبد الكريم بن هوازن القشيري في بعض كتبه وغيره عن رجل من الناس أنه دفن رجلا من الصالحين فلما جعله في قبره نزع الكفن عن خده ووضع خده على التراب ففتح الميت عينيه وقال له يا هذا أ تذللني بين يدي من أعزني فتعجب من ذلك وخرج من القبر ورأيت أنا مثل هذا لعبد الله صاحبي الحبشي في قبره ورآه غاسله وقد هاب أن يغسله في حديث طويل ففتح عينيه في المغتسل وقال له اغسل فمن أحوالهم بعد الموت أنهم أحياء بالحياة النفسية التي بها يسبح كل شي‏ء ومن كانت له همة بمعبده في حال عبادته في حياته بحيث أن يكون يحفظها من الداخل فيها حتى لا يتغير عليه الحال إن كان صاحب نفس فإذا مات ودخل أحد بعده معبده ففعل فيه ما لا يليق بصاحبه الذي كان يعمره ظهرت فيه آية وهذا قد رويناه في حكاية عن أبي يزيد البسطامي كان له بيت يتعبد فيه يسمى بيت الأبرار فلما مات أبو يزيد بقي البيت محفوظا محترما لا يفعل فيه إلا ما يليق بالمساجد فاتفق أنه جاء رجل فبات فيه قيل وكان جنبا فاحترقت عليه ثيابه من غير نار معهودة ففر من البيت فما كان يدخله أحد فيفعل فيه ما لا يليق إلا رأى آية فيبقى أثر مثل هذا الشخص بعد موته يفعل مثل ما كان يفعله في حياته سواء وقد قال بعضهم وكان محبا في الصلاة يا رب إن كنت أذنت لأحد أن يصلي في قبره فاجعلني ذلك فرئي وهو يصلي في قبره وقد مر رسول الله صلى الله عليه وسلم ليلة إسرائه بقبر موسى عليه السلام فرآه وهو يصلي في قبره ثم عرج به إلى السماء وذكر الإسراء وما جرى له فيه مع الأنبياء\nورأى موسى في السماء السادسة وقد رآه وهو يصلي في قبره فمن أحوال هذا الشخص بعد موته مثل هذه الأشياء لا فرق في حقه بين حياته وموته فإنه كان في زمان حياته في الدنيا في صورة الميت حاله الموت فجعله الله في حال موته كمن حاله الحياة جزاء وفاقا ومن صفات صاحب هذا المقام في موته إذا نظر الناظر إلى وجهه وهو ميت يقول فيه حي وإذا نظر إلى مجس عروقه يقول فيه ميت فيحار الناظر فيه فإن الله جمع له بين الحياة والموت في حال حياته وموته وقد رأيت ذلك لوالدي رحمه الله يكاد إنا ما دفناه إلا على شك مما كان عليه في وجهه من صورة الأحياء ومما كان من سكون عروقه وانقطاع نفسه من صورة الأموات وكان قبل أن يموت بخمسة عشر يوما أخبرني بموته وأنه يموت يوم الأربعاء وكذلك كان فلما كان يوم موته وكان مريضا شديد المرض استوى قاعدا غير مستند وقال لي يا ولدي اليوم يكون الرحيل واللقاء فقلت له كتب الله سلامتك في سفرك هذا وبارك لك في لقائك ففرح بذلك وقال لي جزاك الله يا ولدي عني خيرا كل ما كنت أسمعه منك تقوله ولا أعرفه وربما كنت أنكر بعضه هو ذا أنا أشهده ثم ظهرت على جبينه لمعة بيضاء تخالف لون جسده من غير سوء له نور يتلألأ قشعر بها الوالد ثم إن تلك اللمعة انتشرت على وجهه إلى أن عمت بدنه فقبلته ووادعته وخرجت من عنده وقلت له أنا أسير إلى المسجد الجامع إلى أن يأتيني نعيك فقال لي رح ولا تترك أحدا يدخل علي وجمع أهله وبناته فلما جاء الظهر جاءني نعيه فجئت إليه فوجدته على حالة يشك الناظر فيه بين الحياة والموت وعلى تلك الحالة دفناه وكان له مشهد عظيم فسبحان من يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ فصاحب هذا المقام حياته وموته سواء وكل ما قدمناه في هذا الباب من العلم هو علم صاحب هذا المقام فإنه من علم الأنفاس ولهذا ذكرنا ما ذكرنا من ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Thirty-Five: Concerning the Gnosis of this Realized Person (الشخص المحقق) in the Station of the Breaths (منزل الأنفاس) and his Secrets after his Death.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.\n\nThe servant is he whose state during life, by Him,\nIs like his state after the death of the body and the spirit.\n\nAnd the servant is he whose state during the veil, by Him,\nIs a light like the illumination of the essence of the earth from Yūḥ.\n\nFor the state of death is not accompanied by claims,\nJust as life has claims explicitly stated.\n\nFor some people, and for others,\nThose claims are made by hint and allusion.\n\nIf you understand what we have said, you will establish it\nAs a measure purified from deficiency or preference.\n\nAnd you will be among those whose realities (حقائقه) purify them,\nAnd there is no way to slander or wound them.\n\nBut if you are ignorant of what we have said, you will come\nTo the Abode of Questioning with a breast not expanded.\n\n### [Faith (الإيمان) and Unveiling (الكشف)]\n\nKnow, may Allah support you with the Holy Spirit (روح القدس), that this Realized Person (الشخص المحقق) in the Station of the Breaths (منزل الأنفاس), whoever he may be, his state after his death differs from the states of all other deceased persons. Let us first mention the enumeration of the sources (مآخذ) from which the People of Allah (أهل الله) receive knowledge (العلوم) from Allah, as we established in the previous chapter. And let us mention what they possess and the effects of those sources upon their essences (ذواتهم).\n\nSo let us say: Know, O my brother, that the knowledge (علم) of the People of Allah, which is taken from Unveiling (الكشف), is exactly in the form of Faith (الإيمان). Everything that Faith accepts, the Unveiling of the People of Allah is upon that, for it is entirely The Real (الحق), and the one who reports it—who is the Prophet, peace and blessings be upon him—reports it based on a sound Unveiling. And the essences (ذوات) of the Gnostics of Allah (العلماء بالله) are upon the description of the thing from which they take the Knowledge of Allah, whatever that thing may be.\n\n### [Essential (النفسية) and Conceptual (المعنوية) Attributes]\n\nKnow that Attributes (الصفات) are of two types: essential attributes (صفات نفسية) and conceptual attributes (صفات معنوية). The conceptual attributes in the described entity are those which, if you remove them from the Essence (الذات) described by them, the Essence that was described by them does not cease to exist. The essential attributes are those which, if you remove them from the entity described by them, the described entity ceases to exist, and no entity (عين) remains for it, neither in concrete existence (الوجود العيني) nor in conceptual existence (الوجود العقلي), wherever you remove them.\n\nFurthermore, there is no essential attribute of the described entity—which is not something additional to its Essence (ذاته)—except that it has an essential attribute by which some of them are distinguished from others. For the Essence of the described entity may be composed of two essential attributes or more, and these are the essential definitions (الحدود الذاتية). Here is a closed door; if we were to open it, there would appear that which would take away the intellects and remove confidence in the known, and perhaps the matter would lead to the conclusion that the First Cause (السبب الأول) is from the essential attributes of the contingent things (الممكنات). Just as when you make the cause a condition for the existence of the conditioned, and you remove the condition, the conditioned is undoubtedly removed, but the reverse is not necessary. This holds true but does not reverse, so we have left it locked for whoever finds its key to open it.\n\n### [Sound Knowledge (العلوم الصحيح): Sufi Gnosis (المعرفة الصوفية)]\n\nSince the matter stands thus with us and with every rational person, you have known that Attributes (الصفات) are meanings (معان) that do not subsist by themselves, and they have no manifestation except in the entity (عين) of the described. And the essential attributes are meanings, and they are the very entity of the described. Meanings do not subsist by themselves, so how can they be the very entity of the described and nothing else, such that the thing is described by itself, and it becomes self-subsistent, contrary to its reality of not subsisting by itself? For every described entity is the totality of its essential attributes, and the attributes do not subsist by themselves, and there is no Essence (ذات) other than them that gathers and manifests them.\n\nI have alerted you to a great matter so that you may know why the knowledge of the rationalists (العقلاء) derived from their thoughts is rejected, and so that it becomes clear to you that sound Knowledge (العلم الصحيح) is not given by thought, nor by what the rationalists have established through their thoughts. Rather, sound Knowledge is only that which Allah casts into the heart of the knower, and it is a Divine Light (نور إلهي) with which He singles out whom He wills of His servants, whether angel, messenger, prophet, saint (ولي), or believer. And whoever has no Unveiling (كشف) has no Knowledge (علم).\n\n### [Divine Definition of What Intellects Deem Impossible: The Ambiguous (المتشابه) and the Miracle (المعجزة)]\n\nFor this reason, the Messengers came, and the Divine Definition (التعريف الإلهي) came with what the intellects deem impossible, forcing them to resort to interpretation (التأويل) in some matters in order to accept them. And they are forced to submit and admit incapacity regarding matters that do not accept interpretation at all. Their utmost recourse is to say: \"It has a meaning (وجه) that only Allah knows, which our intellects cannot reach.\" All of this is merely a comforting of the soul, not Knowledge, so that they do not reject anything brought by Prophethood. This is the state of the rational believer. As for the non-believer, he accepts none of that.\n\nMany reports have come down that the intellects deem impossible, some concerning the High Presence (الجناب العالي) and some concerning realities (الحقائق) and the transformation of entities (انقلاب الأعيان). As for those concerning the High Presence, they are what The Real (الحق) described Himself with in His Book and upon the tongues of His Messengers, which must be believed, but which the intellect does not accept based on its apparent meaning, unless it interprets it with a far-fetched interpretation. Thus, his faith is only through his interpretation, not through the report itself, and he did not possess a Divine Unveiling (كشف إلهي) as the Prophet did, enabling him to know the intent of The Real in that report. So He, glory be to Him, described Himself with temporal and spatial containment (الظرفية الزمانية والمكانية), and His Messenger, peace and blessings be upon him, and all the Messengers described Him thus. All of them speak with one tongue concerning this, because they speak on behalf of one God (إل واحد).\n\n### [The God of Intellect and the God of Faith and Unveiling (الكشف)]\n\nThe rationalists (العقلاء), the people of thought, differed in their statements concerning Allah, according to the extent of their speculation (نظرهم). The God who is worshipped purely by the intellect, divorced from Faith, is as if—nay, He is—a God posited according to what the speculation of that intellect yields. Thus, His Reality (حقيقته) differs according to the view of each intellect, and the intellects oppose one another, and every faction of the people of intellects is ignorant of the other concerning Allah. Even if they are Islamic speculators (النظار الإسلاميين) who resort to interpretation, every faction declares the other an unbeliever.\n\nThe Messengers, peace be upon them, from Adam, peace be upon him, to Muhammad, peace and blessings be upon him, no difference has been transmitted from them regarding the attributes (النعوت) they ascribe to Allah; rather, all of them speak with one tongue concerning this. And the Books they brought all speak concerning The Real (الحق) with one tongue; not two of them differed, confirming one another despite the length of time and lack of assembly, and despite the opposing factions of rationalists among them, their system was not disrupted.\n\nLikewise, the believers who follow them with insight (بصيرة)—the Muslims who have not involved themselves in interpretation—are one of two types of men: Either a man who believed and submitted, and left the knowledge of that matter to Him until he died—and this is the follower (المقلد). Or a man who acted upon what he knew of the subsidiary rulings (فروع الأحكام) and held the belief (اعتقد الإيمان) in what the Messengers and Books brought, so Allah unveiled his insight (بصيرته) and made him possess insight concerning his affair, just as He did with His Prophet and Messenger, peace and blessings be upon him, and the People of His Concern (أهل عنايته). So he received Unveiling and saw and called to Allah, the Mighty and Majestic, upon insight, as Allah the Almighty said concerning His Prophet, peace and blessings be upon him, informing him: <<أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي>> (I call unto Allah upon insight, I and whoever follows me). These are the Gnostics of Allah (العلماء بالله العارفون), and even if they are not Messengers or Prophets, they possess clear evidence (بينة) from their Lord concerning their knowledge of Him and of what came from Him.\n\n### [The Ambiguous (المتشابهات): Interpretation or Submission]\n\nLikewise, He described Himself with many attributes of creatures, such as coming (المجيء), approaching (الإتيان), Self-disclosure (التجلي) to things, limits (الحدود), veils (الحجب), the Face (الوجه), the Eye (العين), the Eyes (الأعين), the Two Hands (اليدين), pleasure (الرضي), dislike (الكراهة), wrath (الغضب), joy (الفرح), and smiling (التبشبش). Every sound report that came in the Book and the Sunnah—and these reports are too numerous to count—is accepted only by a believer without interpretation, or by some people of speculation (أرباب النظر) among the believers through an interpretation to which his faith compelled him.\n\nLook then at how precious is the rank of the believer, and how magnificent is the rank of the People of Unveiling (أهل الكشف), since their possessors are joined with the Messengers and Prophets, peace be upon them, in what they were singled out for concerning Divine Knowledge (العلم الإلهي). Because the scholars are the inheritors of the Prophets, and they did not inherit a dinar or a dirham, but rather they inherited Knowledge.\n\nThe Prophet, peace and blessings be upon him, says: \"We, the company of Prophets, do not leave inheritance; what we leave behind is charity (صدقة).\"\n\nSo whoever possesses anything of this world should dedicate it as charity to those he deems closest to Allah—for that is the true lineage—or he should renounce it and leave nothing to be inherited from him if he wishes to join them, and he should not inherit from anyone. Praise be to Allah, who granted us an abundant share of this station. This is part of what has come to us from Allah, the Mighty and Majestic, concerning the descriptions of Allah the Almighty.\n\n### [Transformation of Realities (قلب الحقائق) and Miracles (المعجزات)]\n\nAs for the transformation of realities, there is no disagreement among the rationalists that it does not occur. The proof of the limited intellect, derived from its thought and speculation—not from its faith and acceptance, for none are more rational than the Messengers and the People of Allah (أهل الله)—indicates that entities (الأعيان) do not truly transform in themselves.\n\nAnd that attributes (الصفات) and accidents (الأعراض), according to the school of thought that holds them to be existing entities (أعيان موجودة) that do not subsist by themselves but must have a locus (محل) that subsists by itself, or one that does not subsist by itself but is necessarily contained within one that does subsist by itself. An example of the first is blackness, for instance, or any color, which subsists only in a locus that is called \"black\" because the blackness subsists in it. An example of the second is shining blackness, for instance. The blackness is the shining, for it is an adjective (نعت) for it. This is the meaning of my statement: \"or one that does not subsist by itself but is necessarily contained within one that does subsist by itself.\" This is a point of dispute among the speculators (النظار): whether a meaning (المعنى) can subsist in a meaning. Some affirm it, and others deny it.\n\nIt has been established that all actions (الأعمال) are accidents (أعراض), that they perish and have no subsistence (بقاء), that they have no existing entity after their disappearance, and that they are not described by transference. And that death is either an accident existing in the deceased, according to the school of some speculators, or it is a relation (نسبة) of separation after conjunction—and likewise all existents (الأكوان) according to the school of others, which is the sound view required by the evidence. In any case, it does not subsist by itself.\n\n### [Ranks of Scholars Regarding the Ambiguous (المتشابهات)]\n\nProphetic reports have come down contradicting all of this, despite our consensus that actions are accidents or relations. The Lawgiver (الشارع)—who is the truthful one, possessing sound Knowledge (العلم الصحيح) and clear Unveiling (الكشف الصريح)—said that Death (الموت) will be brought on the Day of Resurrection in the form of a speckled ram (كبش أملح) that people will recognize and none will deny, and it will be slaughtered between Paradise and the Fire. It is narrated that John (Yahya), peace be upon him, is the one who will lay it down and slaughter it with a knife in his hand, while the people look on.\n\nIt is also reported that a person's deed (عمل) enters his grave with him in a beautiful or ugly form, and his companion asks him, and he says, \"I am your deed.\" And that the one who withheld Zakat (alms) will have his wealth come to him as a bald, venomous snake (شجاعا أقرع) with two black spots (زبيبتان).\n\nExamples of this in the Sacred Law (الشرع) are countless. As for the believers, they believe in all of this without interpretation. As for the people of speculation (أهل النظر), whether believers or not, they say that taking this literally is rationally impossible, and it must have an interpretation, so they interpret it according to what their speculation yields. Then the people of faith among them say, following their interpretation, \"And Allah knows best,\" meaning whether that specific interpretation they adopted is what Allah intended or not. But carrying it literally is absolutely impossible according to them. Faith, according to the people of thought (أهل الأفكار), relates only to the specific wording used by the Lawgiver.\n\n### [Attributes of Contingent Things are Relations and Attributions between them and The Real (الحق)]\n\nAfter we have clarified these matters for you and the ranks of people concerning them—for they belong to this chapter we are addressing—know that there are only Essences (ذوات) that Allah the Almighty brought into existence by His grace upon them, subsisting by themselves. And everything by which they are described consists of relations (نسب) and attributions (إضافات) between them and The Real (الحق) in respect to how they are described. Thus, when the originator brings something into existence, it is said of him that he is capable of originating, and were it not for that, he would not have originated. And when the contingent thing (الممكن) is specified by one matter rather than another that it is permissible for it to possess, it is said to be willing (مريد), and were it not for that, He would not have specified it with this rather than that. The cause of all this is only what the reality of the contingent thing yields. The contingent things gave rise to these relations. Understand this, if you possess intellect, Divine contemplation (نظر إلهي), and Merciful Unveiling (كشف رحماني).\n\n### [Sources of Knowledge (مآخذ العلوم)]\n\nWe established in the previous chapter that the sources of knowledge (مآخذ العلوم) come from different paths: hearing (السمع), sight (البصر), smell (الشم), touch (اللمس), taste (الطعم), and the intellect (العقل) in terms of its necessities (ضرورياته)—which is what it perceives by itself without another faculty—and also in terms of its sound thought, which refers back only to the paths of the senses or the necessities and self-evident truths (البديهيات). That is what is called Knowledge (علم).\n\nThe accidental matters (الأمور العارضة) from which knowledge results also refer back to these fundamentals and are inseparable from them. They are called accidents (عوارض) because the custom regarding the perception of colors is that touch does not perceive them; only sight perceives them. But if the blind person perceives them by touch—and we have seen this—then the sense of touch has experienced an accident (عرض) of perceiving what is not normally its reality to perceive. Likewise, when the other paths experience the perception of what is not normally their function to perceive, it is said that an accident has occurred to them.\n\n### [Extraordinary Gnosis and Divine Power (الاقتدار الإلهي)]\n\nAllah only did this to alert us that there is no reality, as the people of speculation claim, into which the Divine Power (الاقتدار الإلهي) does not penetrate. Rather, that reality is only by Allah's making it in that form, and those things whose perception is linked to them did not perceive things by virtue of being sight or anything else—Allah says—but by Our making. Thus, all knowledge can be perceived by a single reality among these realities if The Real wills. For this reason, we said that an accident occurred to it, allowing it to perceive what it is not accustomed to perceiving. So you know with certainty that He, the Mighty and Majestic, may cause it to be among the accidents that they know and see Him of whom <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (there is nothing like Him), even though the perceptions have never perceived anything except that there are many things like it among all perceptibles.\n\n### [The Primacy of Perception and the Negation of Likeness for Allah]\n\nHe, glory be to Him, did not negate any of the faculties He created from perceiving Him except sight, when He said: <<لا تُدْرِكُهُ الْأَبْصارُ>> (Vision comprehends Him not). So He forbade that legally (شرعا). He did not say that hearing, or the intellect, or other faculties with which man is described, do not perceive Him. Nor did He say that anything other than sight perceives Him; rather, He left the matter ambiguous. And He manifested the accidents that occur to these faculties in the context of alerting us that He might place the vision of Him of whom there is nothing like Him within our perception.\n\nJust as we saw the first thing seen, heard the first thing heard, smelled the first thing smelled, tasted the first thing tasted, touched the first thing touched, and intellectually grasped the first thing grasped—none of which had a like (مثل) in our view. Even if it has likes in reality, there is a strange secret in the primacy of perception (أولية الإدراك) regarding the negation of likeness (المماثلة) for Him. The perceiver has perceived Him who has no like in his view, so he measures Him against it. Whether that perceived thing accepts likeness by its essence or not is another ruling, additional to its being perceived, which is not needed for the perception itself, if you are discerning.\n\n### [Divine Expansion and the Negation of Likeness in Entities (الأعيان)]\n\nRather, we say that the Divine Expansion (التوسع الإلهي) necessitates that there is no like (مثل) among the existing entities (الأعيان الموجودة), and that likeness (المثلية) is a conceptual, imagined matter. For if likeness were true, nothing would be distinguished from anything else that is said to be like it. That by which a thing is distinguished from another is the very entity (عين) of that thing. And that by which it is not distinguished from another is nothing but a single entity. If you say, \"We saw it separated and distinct, this one separating from that one, despite its likeness in definition (الحد) and reality (الحقيقة),\" you will be told, \"You are mistaken.\" For that by which the separation occurred is what is expressed as being that entity, and that by which the separation did not occur is what you imagined to be the like.\n\nThis is one of the most obscure issues of this chapter. There is no like at all, and yet one cannot deny the existence of likenesses, but only through definitions (الحدود) and nothing else. For this reason, likeness is affirmed in terms of the comprehensive, conceptual reality, not the existing one. Likes are conceptual, not existent. Thus, we say concerning man that he is undoubtedly a rational animal, and that Zayd is not the very entity of Amr in terms of his form, yet he is the very entity of Amr in terms of his humanity, not another thing at all. If he is not other than him in his humanity, then he is not his like; rather, he is him. For the reality of humanity (حقيقة الإنسانية) is not divisible; rather, it is in every human being by its very entity, not by its partiality, so it has no like. And thus are all realities. Likeness is therefore not sound if you make it other than the very entity of the like. Zayd is not the like of Amr in terms of his humanity; rather, he is him. And Zayd is not the like of Amr in his form, for the distinction between them is manifest. Were it not for the distinguishing factor, Zayd would be confused with Amr, and there would be no knowledge of things. Thus, whatever the perceiver perceives, he perceives only Him of whom there is nothing like Him.\n\n### [The Origin of Existence: No Like, The Entity Existing from Him: No Like]\n\nThis is because the Origin (الأصل) to which we return in our existence, which is Allah the Almighty, there is nothing like Him. Therefore, what exists from Him can only be upon the reality that it has no like. For how can He create what His Attribute does not yield? And His Reality does not accept likeness. Therefore, every single atom (جوهر فرد) in the world must not accept likeness, if you possess discernment and intellect. For there is no reality in God that accepts likeness. If the acceptance of likeness existed in the world, its existence, from that perspective, would be based on a non-Divine reality. And there is no originator except Allah, and He has no like. Thus, there is nothing in existence that has a like; rather, every existent is distinguished from others by a reality upon which it subsists in its Essence (ذاته).\n\nThis is what Unveiling (الكشف) and true Divine Knowledge (العلم الإلهي الحق) yield. So, if I apply the term \"like\" (المثل) to things, as has been established, know that I apply it conventionally (عرفا). Allah the Almighty said: <<أُمَمٌ أَمْثالُكُمْ>> (Nations like unto you), meaning, just as the name *umma* (community) is applied to you, so too is the name *umma* applied to every beast and <<طائِرٍ يَطِيرُ بِجَناحَيْهِ>> (bird that flies with its two wings). And just as every nation and every entity (عين) in existence, other than The Real (الحق), is dependent upon an originator for its existence, we say, by that relation (نسبة), that each one is a like of the other in dependence upon Allah. By this, it is absolutely sound that Allah there is nothing like Him, whether by the addition of the *kāf* (in *ka-mithlihi*) or by the supposition of a like. For when you know that every originated thing (محدث) does not accept likeness, as we established for you, then The Real is more deserving of this attribute. Thus, the likeness mentioned in the Quran and elsewhere remains only in the context of dependence upon Allah, the Originator of the entities of things.\n\n### [The Knowledge of the People of Allah concerning Things: Extraordinary Gnosis]\n\nThen I return and say that every one of the People of Allah (أهل الله) is necessarily one whose knowledge of things Allah has placed either in all the faculties or in a specific faculty, as we established. Either in smell, and he is the possessor of the knowledge of the Breaths (علم الأنفاس); or in sight, and he is called the possessor of sight (صاحب نظر); or in striking (الضرب), which is a special type of touch, and for this reason, it is alluded to by the finding of the coolness of the fingertips (برد الأنامل). So the possessor of that attribute, by which knowledge is obtained, is attributed to it, and it is said, \"He is the possessor of such-and-such,\" just as we established that the Attribute (الصفة) is the very entity of the described in this chapter—meaning the essential attribute (الصفة النفسية).\n\nJust as the meaning (المعنى) that is said not to subsist by itself returned as a form subsisting by itself, so too the form that is this world returned as a meaning (معنى) due to its realization (تحققه) by that meaning and its composition (تألفه) with it. Just as these meanings were composed, and from their composition arose a self-subsisting Essence (ذات) that is called a body, a human, a horse, or a plant. Understand this. Thus, the possessor of the knowledge of taste becomes taste, and the possessor of the knowledge of smell becomes smell. The meaning of this is that he acts upon others as taste acts upon him, if he is a possessor of taste, or as smell acts upon him, if he is a possessor of smell. He has thus joined his meaning in ruling, and he himself has become a meaning by which the perceiver perceives things, just as the viewer perceives things in a mirror that he cannot perceive in that state except through the mirror.\n\nShaykh Abu Madyan had a young son by a black woman, and Abu Madyan was a possessor of sight (صاحب نظر). This boy, who was seven years old, would look and say, \"I see ships in the sea, in a place described as such-and-such, and such-and-such has happened to them.\" Then, after a few days, when those ships arrived at Bijaya, the city where the boy was, the matter would be found exactly as the boy had described. The boy would be asked, \"By what do you see?\" He would say, \"By my eye.\" Then he would say, \"No, I only see it with my heart.\" Then he would say, \"No, I only see it through my father. If he is present and I look at him, I see what I tell you. If he is absent from me, I see none of that.\"\n\nIt is reported in the sound *Hadith Qudsi* from Allah the Almighty concerning the servant who draws near to Allah through supererogatory acts until He loves him, that He says: \"When I love him, I am his hearing with which he hears, and his sight with which he sees.\" [The rest of] the *Hadith*: \"By Him he hears, sees, speaks, strikes, and walks.\" This is the meaning of our statement that the Realized Person (المحقق) returns in the likeness of the meaning by which he was realized. So he saw through his father, just as a person sees with his eye in a mirror. Understand this. And thus is every possessor of a path among these faculties. And one person may combine all of them, seeing with every faculty, hearing with every faculty, and smelling with every faculty, and he is the most complete of the group.\n\n### [The Realized Person in the Station of the Breaths: His States and Attributes after his Death]\n\nAs for their states after their death, they are according to what they were upon in the world, whether devoting themselves to a specific matter or to various matters, corresponding to the degree of their realization (تحققوا) in devoting themselves to it. And they are in the Hereafter according to their states in the world. Whoever was a pure servant (*abd mahd*) in the world will be a pure sovereign (*malik mahd*) in the Hereafter. And whoever in the world was characterized by sovereignty, even if only in his limbs, believing them to be his property, his sovereignty in the Hereafter will be diminished by the amount he appropriated in the world. Even if he established justice in that and spent it in what Allah obligated him to spend it on legally, yet he saw himself as the owner of it due to a lapse of heedlessness (غفلة) that overtook him, the consequence of that will return to him and affect him. Therefore, none is more honored in the Hereafter than he who reached the utmost humility (غاية الذل) in the presence of The Real (الحق) and Reality (الحقيقة) in the world. And none is more abased in the Hereafter than he who reached the utmost self-exaltation (غاية العزة في نفسه) in the world, even if he was outwardly slapped [and humiliated]. I do not mean by worldly exaltation that he should be a king in it, unless his attribute in his soul is self-exaltation—and likewise humility. As for whether he is outwardly a king or otherwise, we do not care in what station or state The Real placed His servant outwardly. What matters is his state within himself.\n\n### [Spiritual Life (الحياة النفسية) after Death]\n\nAbd al-Karim ibn Hawazin al-Qushayri mentioned in one of his books, and others too, concerning a man who buried a righteous person (الصالحين). When he placed him in his grave, he removed the shroud from his cheek and placed his cheek on the earth. The deceased opened his eyes and said to him, \"O man, do you humiliate me before Him who has honored me?\" The man was astonished and left the grave. I myself saw something similar happen to my companion, Abdullah the Abyssinian, in his grave. His washer saw him and hesitated to wash him—in a long story—so he opened his eyes in the washing place and said to him, \"Wash!\"\n\nAmong their states after death is that they are alive by the spiritual life (الحياة النفسية) by which everything glorifies [Allah]. And whoever had a spiritual resolve (همة) concerning his place of worship during his devotion in life, such that he guarded it from those who entered it so that his state would not be altered—if he was a possessor of soul (صاحب نفس)—if he dies and someone enters his place of worship after him and does something inappropriate for its former occupant, a sign (آية) will appear in it. We have narrated this in a story concerning Abu Yazid al-Bistami, who had a house of worship called the House of the Righteous (بيت الأبرار). When Abu Yazid died, the house remained guarded and respected, and nothing was done in it except what was appropriate for mosques. It happened that a man came and slept there—it is said he was in a state of major ritual impurity (*junub*)—and his clothes were burned upon him without any recognizable fire. He fled the house. Thereafter, no one entered it and did anything inappropriate without seeing a sign. Thus, the effect of such a person remains after his death, acting exactly as he acted during his life.\n\nSome of them, who loved prayer, said, \"O Lord, if You have permitted anyone to pray in his grave, make me that person.\" And he was seen praying in his grave. The Messenger of Allah, peace and blessings be upon him, passed by the grave of Moses, peace be upon him, on the night of his Ascension (الإسراء) and saw him praying in his grave. Then he ascended to heaven and mentioned the Ascension and what transpired with the Prophets therein. And he saw Moses in the Sixth Heaven, having already seen him praying in his grave. So, among the states of this person (الشخص المحقق) after his death are things like these. There is no difference in his case between his life and his death. For during his lifetime in the world, he was in the form of the deceased, in the state of death, so Allah made him, in his state of death, like one whose state is life, as a fitting recompense.\n\nAmong the attributes of the possessor of this station (المقام) in his death is that when the observer looks at his face while he is deceased, he says, \"He is alive.\" And when he feels his veins, he says, \"He is dead.\" The observer is thus perplexed concerning him. For Allah combined life and death for him in his state of life and his state of death. I saw this in my father, may Allah have mercy on him. We almost buried him in doubt, due to the appearance of the living on his face, and the stillness of his veins and cessation of his breath, which were the appearance of the dead. Fifteen days before he died, he informed me of his death and that he would die on a Wednesday, and so it was. When the day of his death arrived, and he was severely ill, he sat up straight without leaning and said to me, \"My son, today is the departure and the meeting.\" I said to him, \"May Allah decree safety for you in this journey of yours and bless your meeting.\" He rejoiced at this and said to me, \"May Allah reward you well on my behalf, my son. Everything I used to hear you say, which I did not know and sometimes denied, behold, I am now witnessing it.\" Then a white gleam appeared on his forehead, differing from the color of his body, without any harm to him—a light that glittered. My father shuddered at it. Then that gleam spread over his face until it covered his body. I kissed him, bade him farewell, and left him, saying, \"I will go to the Grand Mosque until your obituary reaches me.\" He said to me, \"Go, and do not let anyone enter upon me.\" He gathered his family and daughters. When the noon prayer came, his obituary reached me. I came to him and found him in a state that made the observer doubt between life and death. And in that state, we buried him. He had a magnificent funeral procession. Glory be to Him who singles out for His Mercy whom He wills. The life and death of the possessor of this station are the same. And all the knowledge we have presented in this chapter is the knowledge of the possessor of this station, for it is from the science of the Breaths (علم الأنفاس). For this reason, we mentioned what we mentioned concerning that. And Allah speaks the Truth, and He guides to the Way.",
    "ur": "(پینتیسواں باب: اس محقق شخص کی معرفت کے بیان میں جو منزلِ انفاس میں ہے اور اس کے موت کے بعد کے اسرار کے بیان میں، رضی اللہ عنہ)\n\n(شروع اللہ کے نام سے جو نہایت مہربان، رحم والا ہے)\n\nبندہ وہ ہے جو زندگی کی حالت میں اس (حق) کے ساتھ ہو،\nجیسا کہ اس کی حالت جسم اور روح کی موت کے بعد ہوتی ہے۔\n\nاور بندہ وہ ہے جو حجاب کی حالت میں اس (حق) کے ساتھ ہو،\nنور کی مانند، جیسے زمین کی ذات کا چمکنا (یوح) سے ہو۔\n\nپس موت کی حالت کے ساتھ کوئی دعویٰ نہیں ہوتا،\nجیسا کہ زندگی کے لیے صریح دعویٰ ہوتا ہے۔\n\nکچھ لوگوں کے حق میں، اور کچھ لوگوں میں،\nیہ دعوے اشارے اور کنایے سے ہوتے ہیں۔\n\nپس اگر تم نے وہ سمجھ لیا جو ہم نے کہا، تو تم اس کے ساتھ\nایسے وزن پر قائم ہو جاؤ گے جو کمی اور زیادتی سے پاک ہے۔\n\nاور تم ان لوگوں میں سے ہو جاؤ گے جن کی حقائق (حقائق) ان کی پاکیزگی کی گواہی دیتے ہیں،\nاور ان پر طعن و جرح کی کوئی گنجائش نہیں رہتی۔\n\nاور اگر تم نے وہ جہالت کی جو ہم نے کہا، تو تم\nسوال کے گھر (قبر) میں ایسے سینے کے ساتھ آؤ گے جو کشادہ نہ ہوگا۔\n\n### [ایمان اور کشف (الکشف)]\n\nجان لو، اللہ تمہیں روح القدس (روح القدس) سے تائید بخشے، کہ یہ محقق شخص (الشخص المحقق) جو منزل انفاس (منزل الأنفاس) میں ہے، خواہ وہ کوئی بھی شخص ہو، اس کی حالت اس کی موت کے بعد دیگر تمام مردوں کی حالتوں سے مختلف ہوتی ہے۔ پس ہم پہلے ان علوم کے ماخذوں کا احاطہ بیان کریں گے جو اہل اللہ کو اللہ کی طرف سے حاصل ہوتے ہیں، جیسا کہ ہم نے اس سے پچھلے باب میں طے کیا تھا، اور ہم ان کے لیے ان ماخذوں کے اثرات ان کی ذاتوں میں بیان کریں گے۔ پس ہم کہتے ہیں: اے میرے بھائی! جان لو کہ اہل اللہ کا وہ علم جو کشف (الکشف) سے حاصل ہوتا ہے، وہ بالکل ایمان (الإيمان) کی صورت پر ہوتا ہے۔ پس ہر وہ چیز جسے ایمان قبول کرتا ہے، اہل اللہ کا کشف (الکشف) بھی اسی پر ہوتا ہے، کیونکہ وہ سب حق ہے، اور اس کی خبر دینے والے، یعنی نبی صلی اللہ علیہ وسلم، صحیح کشف (الکشف) کے ذریعے اس کی خبر دیتے ہیں۔ اور اللہ تعالیٰ کے علماء کی ذاتیں اس شے کی صفت پر ہوتی ہیں جس سے وہ اللہ کا علم حاصل کرتے ہیں، خواہ وہ کوئی بھی شے ہو۔\n\n### [نفسانی اور معنوی صفات]\n\nاور جان لو کہ صفات دو قسم کی ہیں: صفات نفسیہ (الصفات النفسية) اور صفات معنویہ (الصفات المعنوية)۔ صفات معنویہ (الصفات المعنوية) موصوف میں وہ ہیں کہ اگر تم انہیں موصوف ذات (الذات) سے ہٹا دو تو وہ ذات جو ان سے موصوف تھی، ختم نہیں ہوتی۔ اور صفات نفسیہ (الصفات النفسية) وہ ہیں کہ اگر تم انہیں موصوف سے ہٹا دو تو موصوف ختم ہو جاتا ہے اور اس کا کوئی وجود عینی (الوجود العيني) یا وجود عقلی (الوجود العقلي) باقی نہیں رہتا، جہاں سے بھی تم انہیں ہٹاؤ۔ پھر یہ کہ موصوف کی کوئی بھی صفت نفسیہ ایسی نہیں ہے جو اس کی ذات پر کوئی زائد شے نہ ہو، مگر اس کے لیے ایک صفت نفسیہ ہوتی ہے جس سے وہ ایک دوسرے سے ممتاز ہوتی ہیں۔ کیونکہ موصوف کی ذات دو صفات نفسیہ سے لے کر اس سے اوپر تک مرکب ہو سکتی ہے، اور یہی حدود ذاتیہ (الحدود الذاتية) ہیں۔ اور یہاں ایک بند دروازہ ہے، اگر ہم اسے کھولیں تو ایسی چیزیں ظاہر ہوں گی جو عقلوں کو لے جائیں گی اور معلوم پر سے اعتماد ختم کر دیں گی۔ اور شاید اس کا نتیجہ یہ ہو کہ پہلا سبب ممکنات کی نفسانی صفات میں سے ہو، جیسا کہ اگر تم سبب کو مشروط کے وجود کے لیے شرط بناؤ اور شرط کو ہٹا دو تو مشروط بلا شک ختم ہو جاتا ہے، اور اس کا الٹ لازم نہیں آتا۔ پس یہ قاعدہ جاری ہوتا ہے لیکن منعکس نہیں ہوتا۔ لہٰذا ہم نے اسے اس شخص کے لیے بند چھوڑ دیا ہے جو اس کی چابی پا کر اسے کھولے۔\n\n### [صحیح علوم: صوفیانہ معرفت (المعرفۃ)]\n\nاور جب معاملہ ہمارے نزدیک اور ہر عاقل کے نزدیک اس مقام پر ہے، تو تم نے جان لیا کہ صفات معانی (المعاني) ہیں جو خود سے قائم نہیں ہوتیں، اور ان کا ظہور موصوف کی عین میں ہی ہوتا ہے۔ اور صفات نفسیہ (الصفات النفسية) معانی ہیں اور وہ عین موصوف ہیں۔ اور معانی خود سے قائم نہیں ہوتیں، تو وہ عین موصوف کیسے ہو سکتی ہیں، نہ کہ کوئی اور؟ پس شے اپنی ذات سے موصوف ہو جاتی ہے اور اپنی حقیقت سے خود قائم ہو جاتی ہے، حالانکہ وہ خود سے قائم نہیں ہوتی۔ کیونکہ ہر موصوف اپنی صفات نفسیہ کا مجموعہ ہوتا ہے، اور صفات خود سے قائم نہیں ہوتیں، اور وہاں کوئی دوسری ذات نہیں ہے جو انہیں جمع کرے اور ظاہر کرے۔ میں نے تمہیں ایک عظیم امر پر متنبہ کیا ہے تاکہ تم جان سکو کہ عقلمندوں کا علم ان کی فکروں کے لحاظ سے کیوں لوٹ جاتا ہے، اور تمہارے لیے یہ واضح ہو جائے کہ صحیح علم نہ تو فکر دیتی ہے اور نہ ہی وہ جو عقلمندوں نے اپنی فکروں کے لحاظ سے طے کیا ہے۔ بلکہ صحیح علم تو وہ ہے جو اللہ عالم کے دل میں ڈالتا ہے، اور وہ ایک نور الٰہی (نور إلهي) ہے جسے وہ اپنے بندوں میں سے جسے چاہتا ہے، اس کے لیے خاص کر دیتا ہے، خواہ وہ فرشتہ ہو، رسول ہو، نبی ہو، ولی ہو، یا مومن ہو۔ اور جس کے پاس کشف (الکشف) نہیں، اس کے پاس علم نہیں۔\n\n### [الٰہی تعریف جو عقلوں کو محال لگے: «متشابہ» اور «معجزہ»]\n\nاور اسی لیے رسول (الرسل) ایسی الٰہی تعریفات لے کر آئے جنہیں عقلیں محال سمجھتی ہیں، پس وہ مجبور ہو جاتی ہیں کہ ان میں سے بعض کی تاویل (التأويل) کریں تاکہ انہیں قبول کر سکیں، اور وہ ان امور میں تسلیم اور عاجزی پر مجبور ہو جاتی ہیں جو بالکل تاویل قبول نہیں کرتے۔ اور اس کی انتہا یہ ہوتی ہے کہ وہ کہتا ہے کہ اس کی کوئی ایسی صورت ہے جسے صرف اللہ ہی جانتا ہے، ہماری عقلیں وہاں تک نہیں پہنچ سکتیں۔ یہ سب نفس کو تسلی دینے کے لیے ہے، علم نہیں، تاکہ وہ نبوت کی لائی ہوئی کسی بھی چیز کو رد نہ کرے۔ یہ عاقل مومن کا حال ہے۔ لیکن غیر مومن ان میں سے کسی چیز کو قبول نہیں کرتا۔ اور بہت سی ایسی خبریں وارد ہوئی ہیں جنہیں عقلیں محال سمجھتی ہیں، ان میں سے کچھ جناب عالی (الجناب العالي) کے بارے میں ہیں اور کچھ حقائق (الحقائق) اور انقلاب اعیان (انقلاب الأعيان) کے بارے میں ہیں۔ جہاں تک جناب عالی کے بارے میں ہیں، تو وہ وہ ہیں جن سے حق (الحق) نے اپنے آپ کو اپنی کتاب میں اور اپنے رسولوں کی زبان پر موصوف کیا ہے، جن پر ایمان لانا واجب ہے، لیکن عقل اپنی دلیل کی بنا پر ان کے ظاہر کو قبول نہیں کرتی، مگر یہ کہ وہ ان کی بعید تاویل کرے۔ پس اس کا ایمان اس کی تاویل سے ہوتا ہے نہ کہ خبر سے۔ اور اس کے پاس ایسا کشف الٰہی نہیں تھا جیسا کہ نبی کے پاس تھا، تاکہ وہ اس خبر میں حق کی مراد کو جان سکے۔ پس اس (سبحانہ) نے اپنے آپ کو زمانی اور مکانی ظرفیت (الظرفية الزمانية والمكانية) سے موصوف کیا، اور اس کے رسول صلی اللہ علیہ وسلم اور تمام رسولوں نے بھی اسے اسی طرح موصوف کیا، اور وہ سب اس بارے میں ایک ہی زبان پر ہیں، کیونکہ وہ سب ایک ہی معبود کی طرف سے بات کرتے ہیں۔\n\n### [عقل کا معبود اور ایمان و کشف (الکشف) کا معبود]\n\nاور عقلمند، یعنی اہل فکر، اللہ تعالیٰ کے بارے میں اپنے نظریے کے مطابق مختلف اقوال رکھتے ہیں۔ پس وہ معبود جس کی عبادت عقل کے ذریعے کی جاتی ہے، ایمان سے مجرد ہو کر، گویا وہ ایک ایسا معبود ہے جو اس عقل کے نظریے کے مطابق وضع کیا گیا ہے۔ پس ہر عقل کے لحاظ سے اس کی حقیقت مختلف ہو گئی اور عقلیں ایک دوسرے کے مقابل آ گئیں۔ اور اہل عقول کا ہر گروہ دوسرے گروہ کو اللہ کے بارے میں جاہل سمجھتا ہے، اگرچہ وہ اسلامی نظریہ دان (النظار الإسلاميين) اور تاویل کرنے والے ہی کیوں نہ ہوں۔ پس ہر گروہ دوسرے کو کافر قرار دیتا ہے۔ اور رسولوں، آدم علیہ السلام سے لے کر محمد صلی اللہ علیہ وسلم تک، سے اللہ کی طرف منسوب صفات میں کوئی اختلاف نقل نہیں ہوا، بلکہ وہ سب اس بارے میں ایک ہی زبان پر ہیں۔ اور وہ کتابیں جو وہ لائے، وہ سب اللہ کے حق میں ایک ہی زبان میں بولتی ہیں، ان میں سے دو نے بھی اختلاف نہیں کیا، وہ ایک دوسرے کی تصدیق کرتے ہیں، باوجود طویل زمانوں کے اور اجتماع نہ ہونے کے۔ اور ان کے درمیان عقلمندوں میں سے جو مخالف فرقے تھے، ان کا نظام درہم برہم نہیں ہوا۔ اور اسی طرح وہ مومن جو بصیرت پر ان پر ایمان لائے، وہ مخلص مسلمان ہیں جنہوں نے اپنی جانوں کو تاویل میں نہیں ڈالا۔ پس وہ دو آدمیوں میں سے ایک ہیں: یا تو وہ شخص جس نے ایمان لایا اور تسلیم کیا اور اس کا علم اللہ کے سپرد کر دیا یہاں تک کہ وہ مر گیا، اور وہ مقلد (المقلد) ہے۔ یا وہ شخص جس نے احکام فرعیہ کے علم پر عمل کیا اور رسولوں اور کتابوں کی لائی ہوئی چیزوں پر ایمان کا اعتقاد رکھا، تو اللہ نے اس کی بصیرت (البصيرة) کھول دی اور اسے اس کے معاملے میں بصیرت والا بنا دیا، جیسا کہ اس نے اپنے نبی اور رسول صلی اللہ علیہ وسلم اور اپنے اہل عنایت کے ساتھ کیا۔ پس اس نے کشف (الکشف) کیا اور دیکھا اور اللہ عزوجل کی طرف بصیرت کے ساتھ دعوت دی، جیسا کہ اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کے حق میں خبر دیتے ہوئے فرمایا: **أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي** (میں اللہ کی طرف بصیرت کے ساتھ بلاتا ہوں، میں بھی اور وہ بھی جو میری پیروی کرتے ہیں)۔ اور یہی لوگ اللہ کے عالم عارف (العلماء بالله العارفون) ہیں، اگرچہ وہ رسول یا نبی نہ ہوں، وہ اپنے رب کی طرف سے اپنے علم میں اور اس کی طرف سے آئی ہوئی چیزوں میں واضح دلیل پر ہیں۔\n\n### [متشابہات: ان کی تاویل یا ان پر تسلیم]\n\nاور اسی طرح اس نے اپنے آپ کو مخلوقات کی بہت سی صفات سے موصوف کیا ہے، جیسے آنا، تشریف لانا، اشیاء پر تجلی (التجلی)، حدود (الحدود)، حجاب (الحجب)، وجہ (الوجه)، عین (العين)، آنکھیں (الأعين)، دو ہاتھ (الیدین)، رضا (الرضي)، کراہت (الکراهة)، غضب (الغضب)، فرح (الفرح)، اور تبشبش (خوش ہونا)۔ اور ہر وہ صحیح خبر جو کتاب اور سنت میں وارد ہوئی ہے، اور یہ خبریں اتنی زیادہ ہیں کہ شمار نہیں کی جا سکتیں، جنہیں صرف وہ مومن ہی قبول کرتا ہے جو بغیر تاویل کے ایمان لائے، یا بعض اہل نظر مومن جو ایسی تاویل کے ساتھ ایمان لاتے ہیں جس پر ان کے ایمان نے انہیں مجبور کیا۔ پس مومن کا مرتبہ دیکھو کتنا عزیز ہے، اور اہل کشف (الکشف) کا مرتبہ کتنا عظیم ہے، جہاں ان کے اصحاب کو رسولوں اور انبیاء علیہم السلام کے ساتھ اس الٰہی علم میں شامل کر دیا گیا جو ان کے لیے خاص تھا، کیونکہ علماء انبیاء کے وارث (ورثة الأنبياء) ہیں، اور انہوں نے نہ تو دینار و درہم وراثت میں پائے، بلکہ انہوں نے علم وراثت میں پایا۔\n\nنبی صلی اللہ علیہ وسلم فرماتے ہیں: **إنا معشر الأنبياء لا نورث ما تركنا صدقة** (ہم انبیاء کی جماعت وراثت میں کچھ نہیں چھوڑتے، جو کچھ ہم چھوڑتے ہیں وہ صدقہ ہوتا ہے۔)\n\nپس جس کے پاس اس دنیا کی کوئی چیز ہو، تو اسے چاہیے کہ وہ اسے صدقہ کے طور پر ان لوگوں کے لیے وقف کر دے جنہیں وہ اللہ کے زیادہ قریب دیکھتا ہے، کیونکہ یہی حقیقی نسبت ہے۔ یا وہ اس سے زہد اختیار کرے اور کوئی ایسی چیز نہ چھوڑے جو اس کی طرف سے وراثت میں ملے، اگر وہ ان (انبیاء) کے ساتھ ملنا چاہتا ہے، اور نہ ہی وہ کسی کا وارث بنے۔ پس تمام تعریفیں اللہ کے لیے ہیں جس نے ہمیں اس مقام سے وافر حصہ عطا فرمایا۔ پس یہ ان اوصاف میں سے کچھ ہیں جو اللہ تعالیٰ کے بارے میں ہم پر اللہ عزوجل کی طرف سے وارد ہوئے۔\n\n### [حقائق کا پلٹ جانا اور معجزات]\n\nاور جہاں تک حقائق (الحقائق) کے پلٹ جانے کا تعلق ہے، تو عقلمندوں کے درمیان اس میں کوئی اختلاف نہیں ہے کہ ایسا نہیں ہوتا۔ اور عقل قاصر کی دلیل، اس کی فکر اور نظر کی جہت سے، نہ کہ اس کے ایمان اور قبولیت کی جہت سے (کیونکہ رسولوں اور اہل اللہ سے زیادہ کوئی عاقل نہیں)، یہ ہے کہ اعیان (الأعيان) اپنی حقیقت میں نہیں پلٹتے۔ اور صفات اور اعراض (الصفات والأعراض) ان لوگوں کے مذہب میں جو کہتے ہیں کہ وہ موجود اعیان ہیں جو خود سے قائم نہیں ہوتیں، ان کے لیے ایک ایسا محل ضروری ہے جو خود سے قائم ہو یا خود سے قائم نہ ہو لیکن وہ خود سے قائم شے میں ہو۔ اور پہلی مثال جیسے سیاہی ہے، یا کوئی بھی رنگ، جو صرف ایک محل کے ساتھ قائم ہوتا ہے، جس کے بارے میں کہا جاتا ہے کہ سیاہی کے اس کے ساتھ قائم ہونے کی وجہ سے وہ کالا ہے۔ اور دوسری مثال جیسے چمکتی ہوئی سیاہی ہے۔ پس سیاہی ہی چمکتی ہوئی ہے، کیونکہ یہ اس کی صفت ہے۔ پس یہ میرے قول کا مطلب ہے: \"یا خود سے قائم نہ ہو لیکن وہ خود سے قائم شے میں ہو۔\" اور یہ نظریہ دانوں کے درمیان اختلافی مسئلہ ہے کہ کیا معنی معنی کے ساتھ قائم ہو سکتا ہے؟ پس کچھ اس کے قائل ہیں اور کچھ اس سے منع کرتے ہیں۔ اور یہ ثابت ہو چکا ہے کہ تمام اعمال اعراض ہیں اور وہ فنا ہو جاتے ہیں اور ان کے لیے بقا (البقاء) نہیں ہے، اور ان کے جانے کے بعد ان کا کوئی موجود عین نہیں ہوتا، اور انہیں انتقال سے موصوف نہیں کیا جاتا۔ اور موت (الموت) یا تو میت میں موجود ایک عرض ہے، بعض نظریہ دانوں کے مذہب میں، یا اجتماع کے بعد جدائی کی نسبت ہے۔ اور اسی طرح تمام اکوان بعض کے مذہب میں ہیں، اور یہی صحیح ہے جو دلیل کا تقاضا ہے۔ اور بہر حال، وہ خود سے قائم نہیں ہوتا۔\n\n### [متشابہات میں علماء کے مراتب]\n\nاور نبوی خبریں اس سب کے منافی وارد ہوئی ہیں، باوجود اس کے کہ ہم سب اس پر متفق ہیں کہ اعمال اعراض یا نسبتیں ہیں۔\n\nپس شارع (الشّارع)، جو صادق (الصادق) اور صحیح علم اور کشف صریح (الکشف الصریح) کا مالک ہے، نے فرمایا کہ موت کو قیامت کے دن ایک سفید و سیاہ مینڈھے (كبش أملح) کی صورت میں لایا جائے گا جسے لوگ پہچانیں گے اور کوئی اس کا انکار نہیں کرے گا، پھر اسے جنت اور جہنم کے درمیان ذبح کر دیا جائے گا۔ روایت ہے کہ یحییٰ علیہ السلام ہی اسے لٹائیں گے اور اپنے ہاتھ میں موجود چھری سے اسے ذبح کریں گے اور لوگ اسے دیکھ رہے ہوں گے۔\n\nاور خبر میں یہ بھی وارد ہوا ہے کہ انسان کا عمل اس کے ساتھ قبر میں ایک خوبصورت یا بدصورت صورت میں داخل ہوتا ہے، پس اس کا ساتھی اس سے پوچھتا ہے تو وہ کہتا ہے: \"میں تمہارا عمل ہوں۔\" اور زکوٰۃ نہ دینے والے کے پاس اس کا مال ایک گنجا سانپ (شجاعا أقرع) بن کر آئے گا جس کے دو زہریلے غدود ہوں گے۔\n\nاور اس طرح کی مثالیں شریعت میں کثرت سے ہیں جن کا شمار نہیں کیا جا سکتا۔ پس مومن تو ان سب پر بغیر تاویل کے ایمان لاتے ہیں، اور اہل ایمان میں سے اہل نظر اور دیگر لوگ کہتے ہیں کہ اس کو اس کے ظاہر پر محمول کرنا عقلی طور پر محال ہے، اور اس کی تاویل ہے۔ پس وہ اپنے نظریے کے مطابق اس کی تاویل کرتے ہیں۔ پھر اہل ایمان میں سے وہ لوگ اپنی تاویل کے بعد کہتے ہیں: \"واللہ اعلم\" (اور اللہ بہتر جانتا ہے)، یعنی اس خاص تاویل کے بارے میں جو انہوں نے اختیار کی ہے کہ کیا اللہ کی مراد یہی ہے یا نہیں؟ لیکن ان کے نزدیک اس کو اس کے ظاہر پر محمول کرنا کلی طور پر محال ہے۔ اور ایمان کا تعلق صرف شارع کے لفظ سے ہی ہوتا ہے۔ یہ اہل فکر کا عقیدہ ہے۔\n\n### [ممکنات کی صفات ان کے اور حق (الحق) کے درمیان نسبتیں اور اضافات ہیں]\n\nاور جب ہم نے تمہارے لیے ان امور اور ان میں لوگوں کے مراتب کو واضح کر دیا، کیونکہ یہ اسی باب سے متعلق ہیں جس پر ہم بات کر رہے ہیں، تو جان لو کہ وہاں صرف وہ ذوات (ذوات) ہیں جنہیں اللہ تعالیٰ نے اپنے فضل سے ان پر وجود بخشا ہے، جو خود سے قائم ہیں۔ اور ہر وہ چیز جس سے وہ موصوف ہیں، وہ ان کے اور حق (الحق) کے درمیان نسبتیں اور اضافات (نسب وإضافات) ہیں، اس لحاظ سے کہ وہ کس چیز سے موصوف ہیں۔ پس جب ایجاد کرنے والا (الموجد) وجود بخشتا ہے، تو اس کے بارے میں کہا جاتا ہے کہ وہ ایجاد پر قادر ہے، اور اگر ایسا نہ ہوتا تو وہ ایجاد نہ کرتا۔ اور جب ممکن کو کسی خاص امر کے ساتھ خاص کیا جاتا ہے، جو اس کے ساتھ قائم ہو سکتا ہے، تو کہا جاتا ہے کہ وہ ارادہ کرنے والا ہے، اور اگر ایسا نہ ہوتا تو وہ اسے کسی اور کے بجائے اس کے ساتھ خاص نہ کرتا۔ اور اس سب کا سبب صرف ممکن کی حقیقت (حقيقة الممكن) ہی دیتی ہے۔ پس ممکنات نے یہ نسبتیں دی ہیں۔ اگر تم عقل، الٰہی نظر اور رحمانی کشف (الکشف) والے ہو تو سمجھو۔\n\n### [علوم کے ماخذ: معرفت (المعرفۃ) کے مصادر]\n\nاور ہم نے اس سے پچھلے باب میں یہ طے کیا تھا کہ علوم کے ماخذ مختلف طریقوں سے ہیں، اور وہ ہیں: سننا (السمع)، دیکھنا (البصر)، سونگھنا (الشم)، چھونا (اللمس)، چکھنا (الطعم)، اور عقل (العقل) اس کی ضروریات (الضروريات) کے لحاظ سے، جو وہ کسی دوسری قوت کے بغیر خود سے ادراک کرتی ہے، اور اس کی صحیح فکر کے لحاظ سے بھی، جو حواس کے طریقوں یا ضروریات اور بدیہیات (البديهيات) کی طرف لوٹتی ہے، بس۔ پس اسے علم کہا جاتا ہے۔ اور وہ عارضی امور (العوارض) جن سے علوم حاصل ہوتے ہیں، وہ بھی انہی اصولوں کی طرف لوٹتے ہیں اور ان سے الگ نہیں ہوتے۔ اور انہیں عارضی امور (العوارض) اس لیے کہا گیا کہ رنگوں کے ادراک میں یہ عادت ہے کہ چھونے سے ان کا ادراک نہیں ہوتا، بلکہ دیکھنے سے ہوتا ہے۔ پس جب کسی نابینا نے چھونے سے ان کا ادراک کیا، اور ہم نے یہ دیکھا ہے، تو حاسہ لمس کے لیے وہ چیز عارضی طور پر پیش آئی جو عادت کے مطابق اس کی حقیقت میں نہیں ہے کہ وہ اس کا ادراک کرے۔ اور اسی طرح دیگر تمام طریقوں کے لیے جب کسی ایسی چیز کا ادراک پیش آئے جو عادت کے مطابق ان کے ذریعے ادراک کرنا ان کا کام نہیں ہے، تو کہا جاتا ہے کہ ان کے لیے یہ عارضی طور پر پیش آیا۔\n\n### [غیر معمولی معرفت (المعرفۃ) اور الٰہی اقتدار]\n\nاور اللہ نے یہ صرف ہمیں متنبہ کرنے کے لیے کیا ہے کہ وہاں کوئی ایسی حقیقت (الحقيقة) نہیں ہے جیسا کہ اہل نظر گمان کرتے ہیں، جس میں الٰہی اقتدار (الاقتدار الإلهي) نافذ نہ ہو، بلکہ وہ حقیقت تو اللہ کے اس کو اس صورت پر بنانے سے ہے۔ اور یہ کہ اس نے ان اشیاء کا ادراک نہیں کیا جن کا ادراک اس کے ساتھ مربوط ہے، اس لیے کہ وہ بصارت ہے یا کوئی اور چیز، بلکہ اللہ فرماتا ہے کہ یہ ہمارے بنانے سے ہے۔ پس تمام علوم کا ادراک ان حقائق میں سے کسی ایک حقیقت کے ذریعے ہو سکتا ہے، جب حق چاہے، اسی لیے ہم نے کہا کہ اس کے لیے اس چیز کا ادراک عارضی طور پر پیش آیا جس کے ادراک کی عادت نہیں تھی۔ پس تم یقیناً جان لو کہ وہ عزوجل ان چیزوں میں سے ہو سکتا ہے جو اس کے لیے عارضی طور پر پیش آئیں کہ وہ اسے جان لے اور دیکھ لے جس کی مثل کوئی شے نہیں ہے، اگرچہ ادراکات نے کبھی کسی ایسی چیز کا ادراک نہیں کیا جس کی بہت سی مثالیں نہ ہوں، تمام مدرکات (المدركات) میں۔\n\n### [ادراک کی اولیت اور اللہ سے مماثلت کی نفی]\n\nاور اس (سبحانہ) نے اپنے ادراک سے ان قوتوں میں سے کسی قوت کی نفی نہیں کی جو اس نے پیدا کی ہیں، سوائے بصارت کے، پس اس نے فرمایا: **لا تُدْرِكُهُ الْأَبْصارُ** (آنکھیں اس کا ادراک نہیں کر سکتیں)۔ پس اس نے شرعاً اس سے منع کر دیا۔ اور اس نے یہ نہیں کہا کہ اسے سماعت یا عقل یا انسان سے موصوف دیگر قوتیں ادراک نہیں کر سکتیں، بلکہ اس نے معاملے کو مبہم چھوڑ دیا اور ان قوتوں پر عارضی طور پر پیش آنے والے امور کو تنبیہ کے طور پر ظاہر کیا کہ شاید وہ ہماری رؤیت میں اس کو رکھ دے جس کی مثل کوئی شے نہیں ہے، جیسا کہ ہم نے پہلی دیکھی ہوئی شے کو دیکھا، پہلی سنی ہوئی شے کو سنا، پہلی سونگھی ہوئی شے کو سونگھا، پہلی چکھائی ہوئی شے کو چکھا، اور پہلی چھوئی ہوئی شے کو چھوا، اور پہلی معقول شے کو عقل سے جانا، جس کی ہمارے نزدیک کوئی مثال نہیں تھی، اگرچہ نفس الامر میں اس کی مثالیں موجود تھیں۔ لیکن ادراک کی اولیت (أولية الإدراك) میں اس کی مماثلت کی نفی میں ایک عجیب راز ہے۔ پس ادراک کرنے والے نے اس کا ادراک کیا جس کی اس کے نزدیک کوئی مثال نہیں تھی کہ وہ اس پر قیاس کرے۔ اور اس مدرک کا اپنی ذات کے لیے مثل کو قبول کرنا یا قبول نہ کرنا ایک دوسرا حکم ہے جو مدرک ہونے سے زائد ہے، اور ادراک میں اس کی ضرورت نہیں ہے، اگر تم صاحب فطانت ہو۔\n\n### [الٰہی وسعت اور اعیان میں مماثلت کی نفی]\n\nبلکہ ہم کہتے ہیں کہ الٰہی وسعت (التوسع الإلهي) کا تقاضا یہ ہے کہ موجود اعیان (الأعيان الموجودة) میں کوئی مثل نہ ہو، اور مثلیت (المثلية) ایک معقول، وہمی امر ہے۔ کیونکہ اگر مثلیت صحیح ہوتی تو کوئی شے کسی دوسری شے سے ممتاز نہ ہوتی جسے اس کی مثل کہا جاتا ہے۔ پس وہ چیز جس سے شے دوسری شے سے ممتاز ہوئی، وہ اس شے کی عین ہے۔ اور جس سے وہ دوسرے سے ممتاز نہیں ہوئی، تو وہ صرف ایک ہی عین ہے۔ اگر تم کہو کہ ہم نے اسے جدا، الگ ہوتے ہوئے دیکھا ہے، یہ اس سے جدا ہو رہا ہے، باوجود اس کے کہ وہ حد اور حقیقت (الحقيقة) میں اس کے مماثل ہے، تو اسے کہا جائے گا کہ تم غلطی پر ہو۔ کیونکہ جس چیز سے جدائی واقع ہوئی ہے، اسی کو اس عین سے تعبیر کیا جاتا ہے، اور جس سے جدائی واقع نہیں ہوئی، وہی ہے جسے تم نے مثل گمان کیا ہے۔ اور یہ اس باب کے سب سے گہرے مسائل میں سے ہے۔ پس وہاں اصلاً کوئی مثل نہیں ہے، اور نہ ہی کوئی امثال کا انکار کر سکتا ہے، لیکن صرف حدود کے ذریعے، اور اسی لیے مثلیت حقیقت جامعہ کے لحاظ سے جاری ہوئی جو معقول ہے نہ کہ موجود۔ پس امثال معقول ہیں، موجود نہیں۔ پس ہم انسان کے بارے میں کہتے ہیں کہ وہ بلا شک حیوان ناطق ہے، اور یہ کہ زید اپنی صورت کے لحاظ سے عین عمرو نہیں ہے، اور اپنی انسانیت کے لحاظ سے عین عمرو ہے، اصلاً کوئی اور نہیں۔ اور جب وہ اپنی انسانیت میں کوئی اور نہیں ہے، تو وہ اس کی مثل نہیں ہے، بلکہ وہ وہی ہے۔ کیونکہ انسانیت کی حقیقت تقسیم نہیں ہوتی، بلکہ وہ ہر انسان میں بعینہا موجود ہے، نہ کہ جزوی طور پر۔ پس اس کی کوئی مثل نہیں ہے۔ اور اسی طرح تمام حقائق ہیں۔ پس مثلیت صحیح نہیں ہوتی اگر تم اسے مثل کی عین کے علاوہ قرار دو۔ پس زید اپنی انسانیت کے لحاظ سے عمرو کی مثل نہیں ہے، بلکہ وہ وہی ہے۔ اور زید اپنی صورت میں عمرو کی مثل نہیں ہے، کیونکہ ان کے درمیان فرقان (فرق) ظاہر ہے۔ اور اگر فرق کرنے والی چیز نہ ہوتی تو زید عمرو کے ساتھ خلط ملط ہو جاتا اور اشیاء کی معرفت (المعرفۃ) نہ ہوتی۔ پس ادراک کرنے والے نے جس شے کا بھی ادراک کیا، وہ صرف اس کا ادراک کیا جس کی مثل کوئی شے نہیں ہے۔\n\n### [وجود (الوجود) کی اصل: اس کی کوئی مثل نہیں، اس سے موجود عین: اس کی کوئی مثل نہیں]\n\nاور یہ اس لیے ہے کہ وہ اصل جس کی طرف ہم اپنے وجود (الوجود) میں لوٹتے ہیں، یعنی اللہ تعالیٰ، **لَيْسَ كَمِثْلِهِ شَيْءٌ** (اس کی مثل کوئی شے نہیں ہے)، پس جو کچھ اس سے موجود ہوتا ہے وہ بھی اسی حقیقت پر ہوتا ہے کہ اس کی کوئی مثل نہیں ہے۔ کیونکہ وہ ایسی چیز کیسے پیدا کر سکتا ہے جو اس کی صفت نہ دے، اور اس کی حقیقت مثل کو قبول نہیں کرتی؟ پس ضروری ہے کہ عالم میں ہر جوہر فرد (الجوهر الفرد) مثل کو قبول نہ کرے، اگر تم صاحب فطانت اور عقل ہو۔ کیونکہ معبود میں کوئی ایسی حقیقت نہیں ہے جو مثل کو قبول کرے۔ پس اگر مثل کا قبول کرنا عالم میں موجود ہوتا تو وہ اس لحاظ سے اپنے وجود میں کسی غیر الٰہی حقیقت کی طرف منسوب ہوتا، حالانکہ اللہ کے سوا کوئی موجد نہیں ہے اور اس کی کوئی مثل نہیں ہے۔ پس وجود (الوجود) میں کوئی ایسی شے نہیں ہے جس کی مثل ہو، بلکہ ہر موجود اپنی ذات میں ایک حقیقت کے ذریعے دوسرے سے ممتاز ہے۔ اور یہی وہ چیز ہے جو کشف (الکشف) اور حق الٰہی علم دیتا ہے۔ پس اگر تم اشیاء پر مثل کا اطلاق کرتے ہو، جیسا کہ طے ہو چکا ہے، تو جان لو کہ میں یہ اطلاق عرف کے طور پر کرتا ہوں۔ اللہ تعالیٰ نے فرمایا: **أُمَمٌ أَمْثالُكُمْ** (تمہاری طرح کی امتیں)، یعنی جس طرح تم پر امت کا نام لاگو ہوتا ہے، اسی طرح ہر چوپائے اور **طائِرٍ يَطِيرُ بِجَناحَيْهِ** (پروں سے اڑنے والے پرندے) پر بھی امت کا نام لاگو ہوتا ہے۔ اور چونکہ ہر امت اور وجود میں ہر عین، سوائے حق (الحق) کے، اپنے ایجاد میں موجد کی محتاج ہے، ہم اسی نسبت سے ہر ایک کے بارے میں کہتے ہیں کہ وہ دوسرے کی مثل ہے اللہ کی محتاجی میں۔ اور اسی سے یہ قطعی طور پر صحیح ہوتا ہے کہ اللہ **لَيْسَ كَمِثْلِهِ شَيْءٌ** (اس کی مثل کوئی شے نہیں ہے)، خواہ کاف کی زیادتی کے ساتھ ہو یا مثل کے فرض کرنے سے۔ کیونکہ جب تم نے جان لیا کہ ہر محدث مثلیت کو قبول نہیں کرتا جیسا کہ ہم نے تمہارے لیے طے کیا ہے، تو حق (الحق) اولیٰ ہے اس صفت کا۔ پس قرآن وغیرہ میں وارد مثلیت صرف اللہ، جو اشیاء کے اعیان کا موجد ہے، کی محتاجی میں ہی باقی رہتی ہے۔\n\n### [اہل اللہ کا اشیاء کا علم: صوفیانہ معرفت (المعرفۃ): غیر معمولی معرفت]\n\nپھر میں لوٹ کر کہتا ہوں کہ اہل اللہ میں سے ہر ایک اس سے خالی نہیں ہوتا کہ اللہ نے اس شخص کا اشیاء کا علم تمام قوتوں میں یا کسی خاص قوت میں رکھا ہو، جیسا کہ ہم نے طے کیا ہے، یا تو سونگھنے (الشم) میں، اور وہ صاحب علم انفاس (علم الأنفاس) ہے۔ یا دیکھنے (النظر) میں، اور اسے صاحب نظر (صاحب نظر) کہا جاتا ہے۔ یا مارنے (الضرب) میں، اور یہ خاص طریقے سے چھونے (اللمس) کے باب سے ہے، اور اسی لیے اس سے انگلیوں کی ٹھنڈک (برد الأنامل) کے وجود سے کنایہ کیا گیا ہے۔ پس اس صفت کا مالک جس سے علوم حاصل ہوتے ہیں، اس کی طرف منسوب کیا جاتا ہے، اور کہا جاتا ہے کہ وہ فلاں کا مالک ہے، جیسا کہ ہم نے طے کیا کہ صفت اس باب میں عین موصوف ہے، یعنی صفت نفسیہ (الصفة النفسية)۔ پس جس طرح وہ معنی جس کے بارے میں کہا جاتا ہے کہ وہ خود سے قائم نہیں ہوتا، خود سے قائم صورت میں لوٹ آیا، اسی طرح وہ صورت جو یہ عالم ہے، معنی میں لوٹ آئی، اس معنی کے ساتھ اس کے متحقق ہونے اور اس سے مانوس ہونے کی وجہ سے، جیسا کہ یہ معانی مانوس ہو گئے، پس ان کے مانوس ہونے سے ایک خود سے قائم ذات بن گئی جسے جسم، انسان، گھوڑا اور نبات کہا جاتا ہے۔ پس سمجھو۔ پس صاحب علم ذوق (الذوق) ذوق بن جاتا ہے، اور صاحب علم شم (الشم) شم بن جاتا ہے۔ اور اس کا مطلب یہ ہے کہ وہ دوسرے میں وہی کرتا ہے جو ذوق اس میں کرتا ہے، اگر وہ صاحب ذوق ہے، یا جو شم اس میں کرتا ہے، اگر وہ صاحب شم ہے۔ پس وہ حکم میں اپنے معنی کے ساتھ ملحق ہو گیا اور وہ خود اپنے آپ میں ایک معنی بن گیا جس سے ادراک کرنے والا اشیاء کا ادراک کرتا ہے، جیسا کہ دیکھنے والا آئینے میں ان اشیاء کو دیکھتا ہے جن کا ادراک وہ اس حالت میں صرف آئینے کے ذریعے ہی کر سکتا ہے۔ شیخ ابو مدین کا ایک چھوٹا بیٹا تھا جو ایک سیاہ فام عورت سے تھا، اور ابو مدین صاحب نظر (صاحب نظر) تھے۔ یہ بچہ، جو سات سال کا تھا، دیکھتا اور کہتا: \"میں سمندر میں فلاں فلاں جگہ پر جہاز دیکھ رہا ہوں، اور ان میں فلاں فلاں واقعہ پیش آیا ہے۔\" پس جب کچھ دن گزر جاتے اور وہ جہاز اس بچے کے شہر بجایہ پہنچتے جہاں وہ تھا، تو معاملہ وہی ہوتا جو بچے نے کہا تھا۔ پس بچے سے پوچھا جاتا کہ تم کس چیز سے دیکھتے ہو؟ تو وہ کہتا: \"اپنی آنکھ سے۔\" پھر کہتا: \"نہیں، میں اسے اپنے دل سے دیکھتا ہوں۔\" پھر کہتا: \"نہیں، میں اسے اپنے والد کے ذریعے دیکھتا ہوں، جب وہ حاضر ہوتے ہیں اور میں ان کی طرف دیکھتا ہوں تو میں وہ دیکھتا ہوں جو میں تمہیں بتا رہا ہوں، اور جب وہ مجھ سے غائب ہوتے ہیں تو میں کچھ نہیں دیکھتا۔\"\n\nصحیح خبر میں اللہ تعالیٰ کی طرف سے اس بندے کے بارے میں وارد ہوا ہے جو نوافل کے ذریعے اللہ کا قرب حاصل کرتا ہے یہاں تک کہ وہ اس سے محبت کرتا ہے، تو وہ فرماتا ہے: **فإذا أحببته كنت سمعه الذي يسمع به وبصره الذي يبصر به** (پس جب میں اس سے محبت کرتا ہوں تو میں اس کا کان بن جاتا ہوں جس سے وہ سنتا ہے، اور اس کی آنکھ بن جاتا ہوں جس سے وہ دیکھتا ہے۔)\n\n(حدیث) پس وہ اسی سے سنتا ہے، دیکھتا ہے، بولتا ہے، پکڑتا ہے اور چلتا ہے۔ پس یہ ہمارے اس قول کا مطلب ہے کہ محقق (المحقق) اس معنی کی صورت کی مانند لوٹ آتا ہے جس سے وہ متحقق ہوا ہے۔ پس وہ اپنے والد کے ذریعے دیکھتا تھا، جیسا کہ انسان آئینے میں اپنی آنکھ سے دیکھتا ہے۔ پس سمجھو۔ اور اسی طرح ان قوتوں کے طریقوں میں سے ہر صاحب طریق کا حال ہے۔ اور کبھی ایک شخص ان سب کو جمع کر لیتا ہے، اور ہر قوت سے دیکھتا ہے، ہر قوت سے سنتا ہے، اور ہر قوت سے سونگھتا ہے، اور وہ جماعت میں سب سے کامل ہوتا ہے۔\n\n### [منزل انفاس (منزل الأنفاس) میں محقق: اس کے موت کے بعد کے احوال اور صفات]\n\nاور جہاں تک ان کی موت کے بعد کی حالتوں کا تعلق ہے، تو وہ اس قدر پر ہوتی ہیں جس پر وہ دنیا میں کسی خاص امر یا مختلف امور کے لیے فارغ ہوئے تھے، اس قدر پر جس سے وہ اس کے لیے فارغ ہونے میں متحقق ہوئے تھے۔ اور وہ آخرت میں اپنی دنیا کی حالتوں کے مطابق ہوں گے۔ پس جو دنیا میں خالص بندہ (العبد المحض) تھا، وہ آخرت میں خالص بادشاہ (الملك المحض) ہوگا۔ اور جو دنیا میں بادشاہت سے موصوف تھا، اگرچہ اپنے جوارح میں کہ وہ اس کی ملکیت ہیں، تو آخرت میں اس کی بادشاہت میں اتنی کمی ہو جائے گی جتنی اس نے دنیا میں پوری کر لی تھی، اگرچہ اس نے اس میں عدل قائم کیا ہو اور اسے اس چیز میں خرچ کیا ہو جس میں اللہ نے اسے شرعاً خرچ کرنے کا حکم دیا تھا، اور وہ یہ دیکھتا ہو کہ وہ اس کا مالک ہے، اپنی طرف سے طاری ہونے والی غفلت کی وجہ سے۔ پس اس کا وبال اس پر لوٹتا ہے اور اس پر اثر انداز ہوتا ہے۔ پس آخرت میں اس سے زیادہ عزیز کوئی نہیں جو دنیا میں حق (الحق) اور حقیقت کے جناب میں ذلت (الذل) کی انتہا کو پہنچا، اور آخرت میں اس سے زیادہ ذلیل کوئی نہیں جو دنیا میں اپنی ذات میں عزت (العزة) کی انتہا کو پہنچا، اگرچہ وہ دنیا میں تھپڑ کھاتا رہا ہو۔ اور دنیا کی عزت سے میری مراد یہ نہیں کہ وہ دنیا میں بادشاہ ہو، مگر یہ کہ اس کی صفت اس کی ذات میں عزت ہو، اور اسی طرح ذلت۔ اور جہاں تک ظاہری طور پر بادشاہ ہونے یا نہ ہونے کا تعلق ہے، تو ہمیں اس کی پرواہ نہیں کہ حق نے اپنے بندے کو ظاہری طور پر کس مقام اور کس حال میں رکھا ہے۔ بلکہ اس میں اعتبار اس کی اپنی ذات کی حالت کا ہے۔\n\n### [موت کے بعد نفسانی زندگی]\n\nعبد الکریم بن ہوازن القشیری نے اپنی بعض کتابوں میں اور دوسروں نے ایک شخص کے بارے میں ذکر کیا کہ اس نے ایک صالح شخص کو دفن کیا، پس جب اس نے اسے قبر میں رکھا تو اس کے گال سے کفن ہٹا دیا اور اس کا گال مٹی پر رکھ دیا۔ تو میت نے اپنی آنکھیں کھولیں اور اس سے کہا: \"اے شخص! کیا تم مجھے اس کے سامنے ذلیل کر رہے ہو جس نے مجھے عزت دی؟\" پس وہ اس پر حیران ہوا اور قبر سے باہر نکل آیا۔ اور میں نے اپنے حبشی ساتھی عبداللہ کے لیے بھی قبر میں ایسا ہی دیکھا، اور اس کے غسل دینے والے نے بھی اسے دیکھا، اور وہ اسے غسل دینے سے ڈر رہا تھا، ایک طویل حدیث میں۔ پس اس نے غسل خانے میں اپنی آنکھیں کھولیں اور اس سے کہا: \"غسل دو۔\" پس ان کی موت کے بعد کی حالتوں میں سے یہ ہے کہ وہ اس نفسانی زندگی (الحياة النفسية) کے ساتھ زندہ ہوتے ہیں جس سے ہر شے تسبیح کرتی ہے۔ اور جس کی اپنی عبادت گاہ میں اپنی عبادت کے دوران ایسی ہمت ہو کہ وہ اسے اندر سے محفوظ رکھے تاکہ اس پر حال تبدیل نہ ہو، اگر وہ صاحب نفس ہے، تو جب وہ مر جائے اور اس کے بعد کوئی اس کی عبادت گاہ میں داخل ہو اور اس میں ایسا کام کرے جو اس کے آباد کرنے والے کے لائق نہ ہو، تو اس میں کوئی نشانی ظاہر ہوتی ہے۔ اور یہ ہم نے ابو یزید بسطامی کے بارے میں ایک حکایت میں روایت کیا ہے، ان کا ایک گھر تھا جہاں وہ عبادت کرتے تھے جسے بیت الابرار (نیکوں کا گھر) کہا جاتا تھا۔ پس جب ابو یزید فوت ہو گئے تو وہ گھر محفوظ اور محترم رہا، اس میں صرف وہی کیا جاتا تھا جو مساجد کے لائق ہو۔ اتفاق سے ایک شخص آیا اور اس میں سویا، کہا جاتا ہے کہ وہ جنبی تھا، تو اس کے کپڑے بغیر کسی معلوم آگ کے جل گئے، پس وہ گھر سے بھاگ گیا۔ پس کوئی بھی اس میں داخل نہیں ہوتا اور ایسا کام نہیں کرتا جو اس کے لائق نہ ہو، مگر وہ کوئی نشانی دیکھتا ہے۔ پس اس شخص کا اثر اس کی موت کے بعد بھی باقی رہتا ہے، وہ وہی کرتا ہے جو وہ اپنی زندگی میں کرتا تھا۔ اور بعض نے کہا، اور وہ نماز سے محبت کرنے والا تھا: \"یا رب! اگر تو نے کسی کو اپنی قبر میں نماز پڑھنے کی اجازت دی ہے تو مجھے وہ بنا دے۔\" پس وہ اپنی قبر میں نماز پڑھتے ہوئے دیکھے گئے۔ اور رسول اللہ صلی اللہ علیہ وسلم معراج کی رات موسیٰ علیہ السلام کی قبر کے پاس سے گزرے تو آپ نے انہیں اپنی قبر میں نماز پڑھتے ہوئے دیکھا۔ پھر آپ کو آسمان پر چڑھایا گیا اور آپ نے معراج اور انبیاء کے ساتھ جو کچھ ہوا اس کا ذکر کیا۔ اور آپ نے موسیٰ کو چھٹے آسمان پر دیکھا، حالانکہ آپ نے انہیں اپنی قبر میں نماز پڑھتے ہوئے دیکھا تھا۔ پس اس شخص کی موت کے بعد کی حالتیں ایسی ہی ہوتی ہیں، اس کے حق میں اس کی زندگی اور موت میں کوئی فرق نہیں ہوتا۔ کیونکہ وہ دنیا میں اپنی زندگی کے زمانے میں میت کی صورت میں تھا، اس کی حالت موت تھی۔ پس اللہ نے اسے اس کی موت کی حالت میں اس شخص کی طرح بنا دیا جس کی حالت زندگی ہے، یہ بدلہ موافق ہے۔ اور اس مقام کے مالک کی موت کی صفات میں سے یہ ہے کہ جب دیکھنے والا اس کے چہرے کو دیکھتا ہے جب وہ مردہ ہوتا ہے تو کہتا ہے کہ وہ زندہ ہے، اور جب اس کی رگوں کے لمس کو دیکھتا ہے تو کہتا ہے کہ وہ مردہ ہے۔ پس دیکھنے والا اس میں حیران ہو جاتا ہے۔ کیونکہ اللہ نے اس کے لیے اس کی زندگی اور موت کی حالت میں زندگی اور موت کو جمع کر دیا۔ اور میں نے یہ اپنے والد (رحمہ اللہ) کے لیے دیکھا، قریب تھا کہ ہم نے انہیں دفن ہی شک کی حالت میں کیا، اس صورت کی وجہ سے جو ان کے چہرے پر زندہ لوگوں کی تھی، اور اس کی وجہ سے جو ان کی رگوں کے سکون اور سانس کے رک جانے سے مردہ لوگوں کی صورت تھی۔ اور مرنے سے پندرہ دن پہلے انہوں نے مجھے اپنی موت کی خبر دی تھی کہ وہ بدھ کے دن مریں گے۔ اور ایسا ہی ہوا۔ پس جب ان کی موت کا دن آیا، اور وہ شدید بیمار تھے، تو وہ بغیر سہارے کے سیدھے بیٹھ گئے اور مجھ سے کہا: \"اے میرے بیٹے! آج کوچ اور ملاقات کا دن ہے۔\" تو میں نے ان سے کہا: \"اللہ آپ کے اس سفر میں سلامتی لکھے اور آپ کی ملاقات میں برکت دے۔\" پس وہ اس پر خوش ہوئے اور مجھ سے کہا: \"اے میرے بیٹے! اللہ تمہیں میری طرف سے بہترین جزا دے۔ وہ سب کچھ جو میں تم سے سنتا تھا اور نہیں جانتا تھا، اور شاید بعض کا انکار بھی کرتا تھا، وہ اب میں دیکھ رہا ہوں۔\" پھر ان کی پیشانی پر ایک سفید چمک ظاہر ہوئی جو ان کے جسم کے رنگ سے مختلف تھی، بغیر کسی برائی کے، ایک نور چمک رہا تھا۔ والد صاحب کو اس سے کپکپی طاری ہوئی۔ پھر وہ چمک ان کے چہرے پر پھیل گئی یہاں تک کہ ان کے پورے بدن پر چھا گئی۔ پس میں نے انہیں بوسہ دیا اور الوداع کہا اور ان کے پاس سے نکل آیا اور ان سے کہا کہ میں جامع مسجد جا رہا ہوں یہاں تک کہ آپ کی موت کی خبر میرے پاس آئے۔ تو انہوں نے مجھ سے کہا: \"جاؤ اور کسی کو میرے پاس داخل نہ ہونے دینا۔\" اور انہوں نے اپنے اہل و عیال اور بیٹیوں کو جمع کیا۔ پس جب ظہر کا وقت آیا تو ان کی موت کی خبر میرے پاس آئی۔ پس میں ان کے پاس آیا تو انہیں ایسی حالت میں پایا کہ دیکھنے والا زندگی اور موت کے درمیان شک کرتا تھا۔ اور اسی حالت پر ہم نے انہیں دفن کیا، اور ان کا ایک عظیم مشہد تھا۔ پس پاک ہے وہ ذات جو **يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ** (اپنی رحمت کے لیے جسے چاہتا ہے خاص کر لیتا ہے)۔ پس اس مقام کے مالک کی زندگی اور موت برابر ہے۔ اور جو کچھ ہم نے اس باب میں علم کے بارے میں پیش کیا ہے، وہ اسی مقام کے مالک کا علم ہے، کیونکہ یہ علم انفاس (علم الأنفاس) میں سے ہے۔ اور اسی لیے ہم نے وہ ذکر کیا جو ہم نے ذکر کیا، اور اللہ **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "(باب سی و پنجم در معرفت این شخص محقق (الشخص المحقق) در منزل انفاس (منزل الأنفاس) و اسرار او پس از مرگش، رضی الله عنه)\n\nبه نام خداوند بخشنده مهربان\n\nبنده کسی است که حالش در زندگی با او، *** همانند حالش پس از مرگ جسم و روح باشد.\n\nو بنده کسی است که در حال حجاب با او، *** نوری باشد همچون تابش ذات زمین از (نور) یوح.\n\nپس حال مرگ، ادعایی همراه خود ندارد، *** چنانکه زندگی ادعای آشکار دارد.\n\nدر حق قومی (ادعا) و در حق قومی دیگر، *** آن ادعاها با اشاره و کنایه است.\n\nاگر آنچه گفتیم را فهمیدی، به آن قیام می‌کنی، *** وزنی که از نقص و ترجیح منزه است.\n\nو از کسانی خواهی بود که حقایقش او را تزکیه می‌کند، *** و راهی برای طعن و جرح (انتقاد) نیست.\n\nو اگر آنچه گفتیم را ندانستی، *** با سینه‌ای ناگشوده به سرای پرسش می‌آیی.\n\n### [ایمان و کشف (الکشف)]\n\nبدان، خداوند تو را به روح القدس تأیید کند، که این شخص محقق (الشخص المحقق) در منزل انفاس (منزل الأنفاس)، هر که باشد، حالش پس از مرگ با سایر احوال مردگان متفاوت است. پس ابتدا باید محدودیت‌های مآخذ علوم اهل الله (أهل الله) از جانب حق (الحق) را ذکر کنیم، همان‌طور که در باب پیشین مقرر کردیم، و سپس آنچه را که برای آنان است و آثار آن مآخذ در ذواتشان را بیان کنیم. پس می‌گوییم: ای برادر، بدان که علم اهل الله که از کشف (الکشف) گرفته شده، دقیقاً به صورت ایمان است. پس هر آنچه ایمان آن را می‌پذیرد، کشف اهل الله نیز بر آن است، زیرا تماماً حق است و خبردهنده آن، یعنی پیامبر (صلی الله علیه وسلم)، از کشف (الکشف) صحیح خبر داده است. و ذوات علمای بالله تعالی بر صفت آن چیزی است که علم را از آن می‌گیرند، هر چه که باشد.\n\n### [صفات نفسیه (الصفات النفسية) و معنویه (الصفات المعنوية)]\n\nو بدان که صفات بر دو نوع‌اند: صفات نفسیه (الصفات النفسية) و صفات معنویه (الصفات المعنوية). صفات معنویه در موصوف، آنهایی هستند که اگر آنها را از ذات موصوف برداری، ذاتی که بدان موصوف بوده، برداشته نمی‌شود. و صفات نفسیه (الصفات النفسية) آنهایی هستند که اگر آنها را از موصوف برداری، موصوف برداشته می‌شود و دیگر عینی برای آن نه در هستی عینی (الوجود العيني) و نه در هستی عقلی (الوجود العقلي) باقی نمی‌ماند، هر جا که آن را برداری. سپس، هیچ صفت نفسیه‌ای برای موصوف وجود ندارد که زائد بر ذات او نباشد، مگر اینکه صفت نفسیه‌ای داشته باشد که به واسطه آن، برخی از دیگری متمایز شوند. زیرا ممکن است ذات موصوف از دو صفت نفسیه یا بیشتر ترکیب شده باشد، و اینها حدود ذاتی (الحدود الذاتية) هستند. و اینجا بابی بسته است که اگر آن را بگشاییم، چیزی آشکار می‌شود که عقل‌ها را زایل می‌کند و اعتماد به معلوم را از بین می‌برد. و شاید امر در این باره به جایی بینجامد که سبب اول از صفات نفس ممکنات باشد، چنانکه اگر سبب را شرط وجود مشروط قرار دهی و شرط را برداری، مشروط بدون شک برداشته می‌شود، اما عکس آن لازم نیست. پس این (قاعده) جاری است و منعکس نمی‌شود. بنابراین، آن را قفل شده رها کردیم برای کسی که کلیدش را بیابد و آن را بگشاید.\n\n### [علم صحیح: معرفت صوفیانه]\n\nو چون امر نزد ما و نزد هر خردمندی بدین منزلت است، دانستی که صفات، معانی‌ای هستند که قائم به خود نیستند و ظهوری ندارند مگر در عین موصوف. و صفات نفسیه (الصفات النفسية) معانی‌ای هستند که عین موصوف‌اند، و معانی قائم به خود نیستند. پس چگونه می‌توانند عین موصوف باشند و نه غیر آن؟ در نتیجه، شیء به خودش وصف می‌شود و از حقیقت خود که قائم به خود نیست، قائم به خود می‌شود. زیرا هر موصوفی مجموع صفات نفسیه (الصفات النفسية) خود است، و صفات قائم به خود نیستند و ذاتی غیر از آنها نیست که آنها را جمع کند و ظاهر سازد. و من تو را بر امری عظیم آگاه ساختم تا بدانی چرا علم عقلا (العقلاء) از حیث افکارشان باز می‌گردد، و برایت روشن شود که علم صحیح را نه فکر می‌دهد و نه آنچه عقلا از حیث افکارشان مقرر کرده‌اند، بلکه علم صحیح همان نوری الهی است که خداوند در قلب عالم می‌افکند و آن نوری الهی است که هر که را بخواهد از بندگانش، از فرشته و رسول و نبی و ولی و مؤمن، به آن اختصاص می‌دهد. و کسی که کشف (الکشف) ندارد، علم ندارد.\n\n### [تعریف الهی به آنچه عقول آن را محال می‌دانند: «متشابه» و «معجزه»]\n\nو به همین دلیل، رسولان و تعریف الهی با آنچه عقول آن را محال می‌دانند، آمدند. پس (عقول) مجبور می‌شوند در برخی از آنها تأویل کنند تا آن را بپذیرند، و در اموری که اصلاً تأویل نمی‌پذیرند، مجبور به تسلیم و عجز می‌شوند. و نهایت کار این است که می‌گوید: «این وجهی دارد که جز خدا نمی‌داند و عقول ما به آن نمی‌رسد.» و این همه، انس دادن به نفس است نه علم، تا مبادا چیزی از آنچه نبوت آورده است را رد کند. این حال مؤمن خردمند است. اما غیر مؤمن، هیچ یک از اینها را نمی‌پذیرد. و اخبار بسیاری وارد شده که عقول آنها را محال می‌دانند، برخی در مورد جناب عالی (خداوند) و برخی در مورد حقایق و دگرگونی اعیان. اما آنچه در جناب عالی است، وصفی است که حق (الحق) خود را در کتابش و بر زبان رسولانش بدان وصف کرده است، که ایمان به آن واجب است و عقل با دلیل خود بر ظاهر آن نمی‌پذیرد، مگر اینکه آن را با تأویلی دور تأویل کند. پس ایمان او به تأویل آن است نه به خبر، و کشف الهی (الکشف الإلهي) برای او نبوده است، چنانکه برای پیامبر بوده، تا مراد حق (الحق) را در آن خبر بداند. پس خداوند سبحان خود را به ظرفیت زمانی و مکانی وصف کرده است، و رسولش (صلی الله علیه وسلم) و همه رسولان او را بدین وصف کرده‌اند، و همه آنها در این باره بر یک زبان‌اند، زیرا از خدای واحد سخن می‌گویند.\n\n### [خدای عقل و خدای ایمان و کشف (الکشف)]\n\nو خردمندان (العقلاء) صاحب افکار، سخنانشان در مورد خداوند تعالی به اندازه نظرشان متفاوت است. پس خدایی که با عقل، مجرد از ایمان، پرستیده می‌شود، گویی، بلکه او خدایی است که بر اساس آنچه نظر آن عقل به او داده، وضع شده است. پس حقیقت او با توجه به هر عقلی متفاوت شده و عقول در مقابل هم قرار گرفته‌اند. و هر طایفه‌ای از اهل عقول، دیگری را نسبت به خداوند جاهل می‌داند، حتی اگر از متفکران اسلامی تأویل‌کننده باشند. پس هر طایفه‌ای دیگری را تکفیر می‌کند. و رسولان، صلوات الله علیهم، از آدم (علیه السلام) تا محمد (صلی الله علیه وسلم)، اختلافی در آنچه به خداوند نسبت می‌دهند از صفات، از آنان نقل نشده است، بلکه همه در این باره بر یک زبان‌اند. و کتاب‌هایی که آورده‌اند، همه در حق خداوند به یک زبان سخن می‌گویند و دو نفر از آنان با هم اختلاف نکرده‌اند، بلکه یکدیگر را تصدیق می‌کنند، با وجود طول زمان‌ها و عدم اجتماع. و با وجود فرقه‌های متخاصم از عقلا که در میان آنها بوده‌اند، نظامشان مختل نشده است. و همچنین مؤمنان به آنان بر بصیرت، یعنی مسلمانان تسلیم شده‌ای که نفس خود را در تأویل وارد نکرده‌اند، دو دسته‌اند: یا مردی که ایمان آورده و تسلیم شده و علم آن را تا زمان مرگ به خدا واگذار کرده است، و او مقلد است؛ یا مردی که به آنچه از فروع احکام می‌دانسته عمل کرده و به آنچه رسولان و کتاب‌ها آورده‌اند، اعتقاد و ایمان داشته است، پس خداوند بصیرت او را گشوده و او را در کارش صاحب بصیرت (البصيرة) کرده است، چنانکه با پیامبر و رسولش (صلی الله علیه وسلم) و اهل عنایتش انجام داد. پس او کشف (کاشف) کرد و بصیرت یافت و بر بصیرت به سوی خداوند عز و جل دعوت کرد، چنانکه خداوند تعالی در حق پیامبرش (صلی الله علیه وسلم) خبر داده است: **أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي** (من و هر که از من پیروی کند، بر بصیرت به سوی خدا دعوت می‌کنیم). و اینان همان علمای بالله (العارفون) هستند، حتی اگر رسول یا نبی نباشند، زیرا در علمشان به خداوند و آنچه از نزد او آمده، بر حجتی روشن از پروردگارشان هستند.\n\n### [متشابهات: تأویل یا تسلیم به آنها]\n\nو همچنین (خداوند) خود را به بسیاری از صفات مخلوقات وصف کرده است، از آمدن، و اتیان، و تجلی (التجلی) برای اشیاء، و حدود، و حجاب‌ها، و وجه، و عین، و اعین، و دست‌ها، و خشنودی، و ناخشنودی، و غضب، و شادی، و خوشرویی. و هر خبر صحیحی که در کتاب و سنت وارد شده است، و این اخبار بیش از آن است که شمرده شود، چیزی است که جز مؤمن بدون تأویل، یا برخی از اهل نظر از مؤمنان با تأویلی که ایمانشان آنها را بدان مجبور کرده، آن را نمی‌پذیرند. پس بنگر به مرتبه مؤمن که چقدر عزیز است و مرتبه اهل کشف (أهل الکشف) که چقدر عظیم است، زیرا صاحبان خود را در آنچه به علم الهی (العلم الإلهي) اختصاص یافته‌اند، به رسولان و انبیا (علیهم السلام) ملحق کرده است، چرا که علما وارثان انبیا هستند و دینار و درهمی به ارث نبرده‌اند، بلکه علم را به ارث برده‌اند.\n\nپیامبر (صلی الله علیه وسلم) می‌فرماید: **إنا معشر الأنبياء لا نورث ما تركنا صدقة** (ما گروه پیامبران چیزی به ارث نمی‌گذاریم، آنچه بر جای می‌گذاریم صدقه است).\n\nپس هر کس چیزی از این دنیا نزد خود دارد، باید آن را به عنوان صدقه بر کسی که او را از نزدیکان به حق (الحق) می‌بیند، وقف کند، که این همان نسبت حقیقی است، یا نسبت به آن زهد ورزد و چیزی نگذارد که از او به ارث برده شود، اگر می‌خواهد به آنان ملحق شود و از کسی ارث نبرد. پس حمد خدایی را که ما را از این مقام بهره‌ای وافر عطا فرمود. این بخشی از اوصافی است که از جانب خداوند عز و جل در مورد خداوند تعالی بر ما وارد شده است.\n\n### [دگرگونی حقایق و معجزات]\n\nو اما در مورد دگرگونی حقایق (قلب الحقائق)، اختلافی بین عقلا نیست که این امر رخ نمی‌دهد. و دلیل عقل قاصر از جهت فکر و نظرش، نه از جهت ایمان و پذیرش او (زیرا هیچ کس خردمندتر از رسولان و اهل الله نیست)، دلالت دارد بر اینکه اعیان در حقیقت خود دگرگون نمی‌شوند، و اینکه صفات و اعراض، در مذهب کسی که می‌گوید آنها اعیان موجودی هستند که قائم به خود نیستند و حتماً باید محلی داشته باشند که قائم به خود باشد یا قائم به خود نباشد، اما در قائم به خود حتماً باید باشد. و مثال اول، مثلاً سیاهی یا هر رنگی است که جز به محلی که به واسطه قیام سیاهی در آن، سیاه نامیده می‌شود، قائم نیست. و مثال دوم، مانند سیاهی درخشان است، پس سیاهی همان درخشان است، زیرا نعت آن است. و این معنای سخن من است که گفتم: «یا قائم به خود نباشد، اما در قائم به خود حتماً باشد.» و این مسئله‌ای اختلافی بین متفکران است که آیا معنی به معنی قائم می‌شود یا خیر. برخی قائل به آن هستند و برخی منع می‌کنند. و ثابت شده است که همه اعمال، اعراض هستند و فانی می‌شوند و بقایی ندارند و پس از رفتنشان عینی موجود ندارند و به انتقال وصف نمی‌شوند. و اینکه مرگ یا عرضی است که در مرده موجود است، در مذهب برخی از متفکران، یا نسبتی از جدایی پس از اجتماع است. و همچنین همه اکوان در مذهب برخی از آنها، و این همان صحیح است که دلیل مقتضی آن است. و در هر حال، قائم به خود نیست.\n\n### [مراتب علما در متشابهات]\n\nو اخبار نبوی وارد شده که با همه اینها در تناقض است، با وجود اینکه ما اجماع داریم بر اینکه اعمال اعراض یا نسبت‌ها هستند.\n\nشارع، که صادق و صاحب علم صحیح و کشف صریح است، فرمود: «مرگ در روز قیامت به صورت قوچی ابلق آورده می‌شود که مردم آن را می‌شناسند و هیچ کس آن را انکار نمی‌کند، و بین بهشت و جهنم ذبح می‌شود.» روایت شده که یحیی (علیه السلام) او را می‌خواباند و با کاردی که در دست دارد ذبح می‌کند و مردم به او نگاه می‌کنند.\n\nو همچنین در خبر وارد شده است که عمل انسان در قبرش به صورت نیکو یا زشت با او وارد می‌شود و صاحبش از او می‌پرسد و او می‌گوید: «من عمل تو هستم.» و اینکه مال کسی که زکات نمی‌دهد، به صورت ماری نر و کچل با دو زبانه نزد او می‌آید.\n\nو امثال اینها در شرع بسیار است و قابل شمارش نیست. اما مؤمنان به همه اینها بدون تأویل ایمان می‌آورند. و اما اهل نظر از اهل ایمان و غیر ایشان می‌گویند: حمل این بر ظاهرش عقلاً محال است و تأویلی دارد. پس آن را بر اساس آنچه نظرشان به آنها می‌دهد، تأویل می‌کنند. سپس اهل ایمان از میان آنها پس از تأویلشان می‌گویند: «والله أعلم» (خداوند داناتر است)، یعنی در مورد آن تأویل خاصی که بدان رفته‌اند، آیا مراد خداوند است یا خیر. اما حمل آن بر ظاهرش نزد آنها به طور کلی محال است. و ایمان فقط به لفظ شارع تعلق می‌گیرد. این اعتقاد اهل افکار است.\n\n### [صفات ممکنات نسبت‌ها و اضافاتی بین آنها و حق (الحق) هستند]\n\nو پس از آنکه این امور و مراتب مردم در آنها را برایت بیان کردیم، زیرا آنها از همین بابی هستند که ما در صدد آنیم، بدان که جز ذواتی که خداوند آنها را به فضل خود ایجاد کرده و قائم به خود هستند، وجود ندارد. و هر آنچه بدان وصف شده‌اند، نسبت‌ها و اضافاتی بین آنها و حق (الحق) است از حیث آنچه بدان وصف شده‌اند. پس هنگامی که ایجادکننده، ایجاد کرد، گفته می‌شود که او بر ایجاد قادر است، و اگر این نبود، ایجاد نمی‌کرد. و هنگامی که ممکن را به امری خاص، نه غیر آن، که جایز است به آن قائم شود، اختصاص داد، گفته می‌شود که او مرید است، و اگر این نبود، آن را به این امر نه غیر آن اختصاص نمی‌داد. و سبب همه اینها را حقیقت ممکن می‌دهد. پس ممکنات این نسبت‌ها را داده‌اند. پس اگر صاحب خرد و نظر الهی و کشف رحمانی (الکشف الرحماني) هستی، بفهم.\n\n### [مآخذ علوم: منابع معرفت]\n\nو ما در باب پیشین مقرر کردیم که مآخذ علوم از راه‌های مختلفی است: شنیدن، دیدن، بوییدن، لمس کردن، چشیدن، و عقل از حیث ضروریاتش، که همان چیزی است که خود به خود و بدون نیروی دیگری درک می‌کند، و همچنین از حیث فکر صحیحش که به راه‌های حواس یا ضروریات و بدیهیات باز می‌گردد و نه غیر آن. پس آن را علم می‌نامند. و امور عارضی که علوم از آنها حاصل می‌شوند نیز به همین اصول باز می‌گردند و از آنها جدا نمی‌شوند. و اینها را عوارض نامیدند به این دلیل که عادت در درک رنگ‌ها این است که لمس آنها را درک نمی‌کند، بلکه فقط بصر آنها را درک می‌کند. پس اگر کور مادرزاد (الأکمَه) آنها را با لمس درک کند، و ما این را دیده‌ایم، برای حس لمس چیزی عارض شده که در عادت از حقیقت آن نیست که آن را درک کند. و همچنین سایر راه‌ها، اگر برای آنها درک چیزی عارض شود که در عادت شأن آنها نیست که با آن درک شود، گفته می‌شود که برای آن عارض شده است.\n\n### [معرفت غیر عادی و اقتدار الهی (الاقتدار الإلهي)]\n\nو خداوند این کار را انجام داد تا ما را آگاه سازد که حقیقتی وجود ندارد، چنانکه اهل نظر گمان می‌کنند، که اقتدار الهی (الاقتدار الإلهي) در آن نفوذ نکند، بلکه آن حقیقت فقط به جعل خداوند بر آن صورت است. و اینکه اشیایی که درکشان به آنها گره خورده است، به دلیل بصر بودن یا غیر آن، درک نشده‌اند، بلکه خداوند می‌گوید: «بلکه به جعل ما.» پس همه علوم با یک حقیقت از این حقایق درک می‌شوند، اگر حق (الحق) بخواهد. به همین دلیل گفتیم: برای آن عارض شده است که چیزی را درک کند که عادت بر درک آن جاری نبوده است. پس قطعاً می‌دانی که او عز و جل ممکن است از جمله چیزهایی باشد که برای آن عارض می‌شود که کسی را که **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست) را بداند و ببیند، اگرچه ادراکات هرگز چیزی را درک نکرده‌اند مگر اینکه امثال بسیاری از همه مدرکات داشته باشد.\n\n### [اولیت ادراک و نفی مثلیت از خداوند]\n\nو خداوند سبحان هیچ نیرویی از نیروهایی را که خلق کرده است، از ادراک خود نفی نکرده است، مگر بصر (دیدن). پس فرمود: **لا تُدْرِكُهُ الْأَبْصارُ** (چشم‌ها او را درک نمی‌کنند). پس این را شرعاً منع کرد. و نگفت که سمع یا عقل یا سایر نیروهایی که انسان بدانها وصف شده است، او را درک نمی‌کنند، بلکه امر را مبهم گذاشت و عوارضی را که برای این نیروها رخ می‌دهد، در معرض تنبیه آشکار ساخت که شاید آن را در رؤیت ما از کسی که **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست) قرار دهد، چنانکه اولین دیدنی را دیدیم، و اولین شنیدنی را شنیدیم، و اولین بوییدنی را بوییدیم، و اولین چشیدنی را چشیدیم، و اولین لمس‌شدنی را لمس کردیم، و اولین معقول را تعقل کردیم، که نزد ما مثلی نداشت، اگرچه در نفس الامر امثالی داشت. اما در اولیت ادراک، رازی عجیب در نفی مماثلت برای او وجود دارد. پس درک‌کننده کسی را درک کرده است که نزد او مثلی ندارد تا او را بر آن قیاس کند. و اینکه آن مدرک ذاتاً مثل را می‌پذیرد یا نمی‌پذیرد، حکمی دیگر است که زائد بر مدرک بودن است و در ادراک به آن نیازی نیست، اگر صاحب فطنت باشی.\n\n### [توسع الهی (التوسع الإلهي) و نفی مثلیت در اعیان]\n\nبلکه می‌گوییم که توسعه الهی (التوسع الإلهي) اقتضا می‌کند که در اعیان موجود، مثلی وجود نداشته باشد و مثلیت امری معقول و موهوم است. زیرا اگر مثلیت صحیح بود، هیچ شیئی از شیء دیگری که گفته می‌شود مثل آن است، متمایز نمی‌شد. پس آن چیزی که شیء به واسطه آن از شیء دیگر متمایز شده است، عین آن شیء است. و آنچه به واسطه آن از غیر خود متمایز نشده است، چیزی جز یک عین واحد نیست. اگر بگویی: «ما آن را جدا و مفارق دیدیم که این از آن جدا می‌شود، با وجود اینکه در حد و حقیقت با آن مماثل است»، به او گفته می‌شود: «تو در اشتباهی.» زیرا آنچه جدایی به واسطه آن رخ داده است، همان چیزی است که به آن «آن عین» تعبیر می‌شود. و آنچه جدایی به واسطه آن رخ نداده است، همان چیزی است که تو گمان کردی مثل است. و این از پیچیده‌ترین مسائل این باب است. پس اصلاً مثلی وجود ندارد. و نمی‌توان منکر امثال شد، اما فقط به واسطه حدود. و به همین دلیل، مثلیت از حیث حقیقت جامع معقول، نه موجود، جاری شده است. پس امثال معقول‌اند نه موجود. پس در مورد انسان می‌گوییم که او حیوان ناطق است بدون شک، و اینکه زید از حیث صورتش عین عمرو نیست، اما از حیث انسانیتش عین عمرو است و اصلاً غیر او نیست. و اگر در انسانیتش غیر او نباشد، پس مثل او نیست، بلکه او، اوست. زیرا حقیقت انسانیت تجزیه نمی‌پذیرد، بلکه در هر انسانی عیناً وجود دارد نه جزئاً. پس مثلی برای آن نیست. و همچنین همه حقایق. پس مثلیت صحیح نیست، اگر آن را غیر عین مثل قرار دهی. پس زید از حیث انسانیتش مثل عمرو نیست، بلکه او، اوست. و زید در صورتش مثل عمرو نیست، زیرا تفاوت بین آنها آشکار است. و اگر فارق (تفاوت‌گذار) نبود، زید با عمرو مشتبه می‌شد و معرفتی به اشیاء حاصل نمی‌شد. پس درک‌کننده، هر چه را که درک کرده است، جز کسی که **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست) درک نکرده است.\n\n### [اصل هستی (الوجود): مثل ندارد، عین موجود از او: مثل ندارد]\n\nو این بدان سبب است که اصلی که در هستی (الوجود) خود به آن باز می‌گردیم، یعنی خداوند تعالی، **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست). پس آنچه از او موجود می‌شود، جز بر این حقیقت نیست که مثلی ندارد. زیرا چگونه چیزی را خلق کند که صفت و حقیقتش آن را نمی‌دهد و مثلیت را نمی‌پذیرد؟ پس حتماً باید هر جوهر فردی در عالم، مثلیت را نپذیرد، اگر صاحب فطنت و خرد باشی. زیرا در ذات الهی حقیقتی که مثلیت را بپذیرد، وجود ندارد. پس اگر پذیرش مثل در عالم وجود داشت، وجودش از آن وجه به غیر حقیقت الهی مستند می‌شد. و جز خداوند ایجادکننده‌ای نیست و او مثلی ندارد. پس در هستی (الوجود) چیزی نیست که مثل داشته باشد، بلکه هر موجودی به حقیقتی که در ذات خود بر آن است، از غیر خود متمایز است. و این همان چیزی است که کشف (الکشف) و علم الهی حق (العلم الإلهي الحق) آن را می‌دهد. پس اگر مثلیت را بر اشیاء اطلاق کردم، چنانکه مقرر شده است، بدان که من آن را عرفاً اطلاق می‌کنم. خداوند تعالی می‌فرماید: **أُمَمٌ أَمْثالُكُمْ** (امت‌هایی مانند شما). یعنی همان‌طور که نام امت بر شما اطلاق شده است، نام امت بر هر جنبنده‌ای و **طائِرٍ يَطِيرُ بِجَناحَيْهِ** (پرنده‌ای که با دو بالش پرواز می‌کند) نیز اطلاق می‌شود. و همان‌طور که هر امتی و هر عینی در هستی (الوجود) به جز حق (الحق)، در ایجاد خود به ایجادکننده‌ای نیازمند است، ما به آن نسبت در مورد هر یک می‌گوییم که در نیازمندی به خداوند، مثل دیگری است. و به این ترتیب قطعاً صحیح است که خداوند **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست)، چه با افزودن کاف (تشبیه) باشد یا با فرض مثل. زیرا وقتی دانستی که هر محدَثی مثلیت را نمی‌پذیرد، چنانکه برایت مقرر کردیم، پس حق (الحق) به این صفت سزاوارتر است. پس مثلیتی که در قرآن و غیر آن وارد شده است، جز در نیازمندی به خداوند، که اعیان اشیاء را ایجاد کرده است، باقی نمی‌ماند.\n\n### [علم اهل الله (أهل الله) به اشیاء: معرفت صوفیانه: معرفت غیر عادی]\n\nسپس باز می‌گردم و می‌گویم که هیچ یک از اهل الله (أهل الله) نیست مگر اینکه خداوند علم این شخص را به اشیاء در همه نیروها یا در نیرویی خاص قرار داده باشد، چنانکه مقرر کردیم. یا در بوییدن (الشم) است و او صاحب علم انفاس (علم الأنفاس) است، یا در نظر (النظر) است و به او صاحب نظر گفته می‌شود، یا در ضرب (زدن) است که از باب لمس به طریق خاص است، و به همین دلیل از آن به وجود سردی سرانگشتان کنایه شده است. پس صاحب آن صفتی که علوم به واسطه آن حاصل می‌شود، به آن نسبت داده می‌شود و گفته می‌شود: «او صاحب فلان است»، چنانکه مقرر کردیم که صفت در این باب عین موصوف است، یعنی صفت نفسیه (الصفة النفسية). پس همان‌طور که معنایی که گفته می‌شود قائم به خود نیست، به صورت قائم به خود بازگشت، صورتی که این عالم است نیز به معنا بازگشت تا به واسطه آن معنی محقق شود و با آن الفت گیرد، چنانکه این معانی الفت گرفتند و از تألیف آنها ذاتی قائم به خود شد که به آن جسم و انسان و اسب و نبات گفته می‌شود. پس بفهم. پس صاحب علم ذوق، ذوق می‌شود، و صاحب علم شم، شم می‌شود. و معنای آن این است که در غیر خود همان کاری را می‌کند که ذوق در او می‌کند، اگر صاحب ذوق باشد، یا همان کاری را که شم در او کرده است، اگر صاحب شم باشد. پس در حکم به معنای خود ملحق شده و خود او در نفس خود معنایی شده است که درک‌کننده اشیاء را به واسطه آن درک می‌کند، چنانکه بیننده با نگاه در آینه، اشیایی را می‌بیند که در آن حال جز با آینه درک نمی‌کند. شیخ ابومدین فرزندی کوچک از کنیزی سیاه داشت، و ابومدین صاحب نظر بود. این کودک که هفت ساله بود، نگاه می‌کرد و می‌گفت: «در دریا در مکانی که صفتش چنین و چنان است، کشتی‌هایی می‌بینم و در آنها چنین و چنان رخ داده است.» پس از چند روز که آن کشتی‌ها به بجایه، شهر این کودک که در آن بود، می‌آمدند، امر بر همان بود که کودک گفته بود. پس به کودک گفته می‌شد: «با چه چیزی می‌بینی؟» می‌گفت: «با چشمم.» سپس می‌گفت: «نه، بلکه با قلبم می‌بینم.» سپس می‌گفت: «نه، بلکه با پدرم می‌بینم. اگر او حاضر باشد و به او نگاه کنم، این را که به شما خبر می‌دهم می‌بینم، و اگر از من غایب باشد، چیزی از آن نمی‌بینم.»\n\nدر خبر صحیح از خداوند تعالی در مورد بنده‌ای که با نوافل به خدا تقرب می‌جوید تا جایی که او را دوست می‌دارد، وارد شده است که می‌فرماید: **فإذا أحببته كنت سمعه الذي يسمع به وبصره الذي يبصر به** (پس چون او را دوست بدارم، گوش او می‌شوم که با آن می‌شنود و چشم او می‌شوم که با آن می‌بیند).\n\n(ادامه) حدیث: پس با او می‌شنود و می‌بیند و سخن می‌گوید و می‌گیرد و می‌کوشد. این معنای سخن ماست که شخص محقق (المحقق) به صورت معنایی که بدان محقق شده است، باز می‌گردد. پس او با پدرش می‌دید، چنانکه انسان با چشم خود در آینه می‌بیند. پس بفهم. و همچنین هر صاحب طریقی از راه‌های این قوا. و ممکن است یک نفر همه آنها را جمع کند و با هر نیرویی ببیند و با هر نیرویی بشنود و با هر نیرویی ببوید، و او کامل‌ترینِ جماعت است.\n\n### [شخص محقق (المحقق) در منزل انفاس (منزل الأنفاس): احوال و صفات او پس از مرگ]\n\nو اما احوال آنان پس از مرگشان، به اندازه آنچه در دنیا بر آن بوده‌اند از تفرغ برای امری معین یا امور مختلف است، به اندازه‌ای که در تفرغ برای آن محقق شده‌اند. و آنان در آخرت به اندازه احوالشان در دنیا هستند. پس کسی که در دنیا بنده محض بود، در آخرت پادشاه محض خواهد بود. و کسی که در دنیا به پادشاهی وصف می‌شد، حتی در جوارحش که آنها را ملک خود می‌دید، به اندازه آنچه در دنیا استیفا کرده است، از پادشاهی او در آخرت کاسته می‌شود. و اگرچه در آن عدل ورزیده و آن را در آنچه خداوند شرعاً بر او واجب کرده بود که صرف کند، صرف کرده باشد، اما به دلیل غفلتی که بر او عارض شده، خود را مالک آن می‌دیده است، پس وبال آن بر او باز می‌گردد و در او تأثیر می‌گذارد. پس در آخرت هیچ کس عزیزتر از کسی نیست که در دنیا به نهایت ذلت در جناب حق (الحق) و حقیقت رسیده باشد، و هیچ کس در آخرت ذلیل‌تر از کسی نیست که در دنیا به نهایت عزت در نفس خود رسیده باشد، حتی اگر در دنیا سیلی خورده باشد. و منظورم از عزت دنیا این نیست که در آن پادشاه باشد، مگر اینکه صفتش در نفس خود عزت باشد، و همچنین ذلت. اما اینکه در ظاهر امر پادشاه باشد یا غیر آن، ما اهمیت نمی‌دهیم که حق (الحق) بنده خود را در ظاهر در چه مقام و حالی قرار داده است، بلکه آنچه معتبر است، حال او در نفس خود است.\n\n### [حیات نفسیه (الحياة النفسية) پس از مرگ]\n\nعبدالکریم بن هوازن قشیری در برخی از کتاب‌هایش و دیگران نقل کرده‌اند که مردی، یکی از صالحین را دفن می‌کرد. هنگامی که او را در قبر گذاشت، کفن را از گونه‌اش کنار زد و گونه‌اش را بر خاک نهاد. میت چشمانش را باز کرد و به او گفت: «ای مرد، آیا مرا در برابر کسی که عزیزم داشته، خوار می‌کنی؟» پس او از این کار تعجب کرد و از قبر بیرون آمد. و من نیز مانند این را برای عبدالله، صاحب حبشی‌ام، در قبرش دیدم، و غسال او نیز آن را دید، در حالی که از غسل دادن او در حدیثی طولانی ترسیده بود. پس (میت) چشمانش را در غسالخانه باز کرد و به او گفت: «غسل بده.» پس از احوال آنان پس از مرگ این است که آنان با حیات نفسیه (الحياة النفسية) زنده‌اند، همان حیاتی که هر چیزی با آن تسبیح می‌گوید. و کسی که در حال عبادتش در زندگی، همتی به معبد خود داشته باشد، به طوری که آن را از ورود کسی حفظ کند تا حالش بر او تغییر نکند، اگر صاحب نفس باشد، هنگامی که می‌میرد و کسی پس از او وارد معبدش شود و در آن کاری کند که شایسته صاحب آن که آن را آباد می‌کرده نیست، نشانه‌ای در آن ظاهر می‌شود. و ما این را در حکایتی از ابویزید بسطامی روایت کرده‌ایم. او خانه‌ای داشت که در آن عبادت می‌کرد و آن را «بیت الابرار» (خانه نیکان) می‌نامید. پس از مرگ ابویزید، خانه محفوظ و محترم باقی ماند و در آن جز آنچه شایسته مساجد است، انجام نمی‌شد. اتفاق افتاد که مردی آمد و در آن خوابید. گفته شد که او جُنُب بود. پس لباس‌هایش بدون آتش معهود سوخت. او از خانه فرار کرد. پس هیچ کس وارد آن نمی‌شد و کاری نامناسب انجام نمی‌داد، مگر اینکه نشانه‌ای می‌دید. پس اثر چنین شخصی پس از مرگش باقی می‌ماند و همانند کاری که در زندگی‌اش می‌کرده، انجام می‌دهد. و برخی از آنان که عاشق نماز بودند، گفتند: «پروردگارا، اگر به کسی اجازه داده‌ای که در قبرش نماز بخواند، مرا آن شخص قرار ده.» پس او را دیدند که در قبرش نماز می‌خواند. و رسول خدا (صلی الله علیه وسلم) در شب معراج از کنار قبر موسی (علیه السلام) گذشت و او را دید که در قبرش نماز می‌خواند. سپس به آسمان عروج کرد و از معراج و آنچه بر او با انبیا گذشت، یاد کرد و موسی را در آسمان ششم دید، در حالی که او را در قبرش در حال نماز دیده بود. پس از احوال این شخص پس از مرگش، چنین چیزهایی است و در حق او بین زندگی و مرگش تفاوتی نیست. زیرا او در زمان زندگی‌اش در دنیا، در صورت مرده و حال مرگ بود. پس خداوند او را در حال مرگش مانند کسی قرار داد که حالش زندگی است، جزای وفاقاً. و از صفات صاحب این مقام در هنگام مرگش این است که اگر بیننده به چهره او در حال مرگ نگاه کند، می‌گوید: «زنده است.» و اگر به لمس رگ‌هایش نگاه کند، می‌گوید: «مرده است.» پس بیننده در مورد او متحیر می‌شود. زیرا خداوند برای او بین زندگی و مرگ در حال زندگی و مرگش جمع کرده است. و من این را برای پدرم (رحمه الله) دیدم. تقریباً ما او را دفن نکردیم مگر با شک، به دلیل صورتی که در چهره‌اش از زندگان بود و به دلیل سکون رگ‌ها و قطع نفسش که از صورت مردگان بود. و او پانزده روز قبل از مرگش به من خبر داد که می‌میرد و اینکه روز چهارشنبه می‌میرد، و چنین نیز شد. هنگامی که روز مرگش فرا رسید و او سخت بیمار بود، راست نشست بدون اینکه تکیه دهد و به من گفت: «ای فرزندم، امروز روز کوچ و دیدار است.» من به او گفتم: «خداوند سلامت تو را در این سفر نوشت و دیدارت را مبارک گرداند.» پس او شاد شد و به من گفت: «خداوند به تو جزای خیر دهد ای فرزندم. هر چه از تو می‌شنیدم که می‌گفتی و نمی‌دانستم و شاید برخی از آن را انکار می‌کردم، اکنون آن را شهود می‌کنم.» سپس بر پیشانی او لکه‌ای سفید ظاهر شد که با رنگ بدنش متفاوت بود، بدون اینکه بدی‌ای برای او باشد، نوری درخشان بود. پدرم از آن لرزید. سپس آن لکه بر چهره‌اش منتشر شد تا اینکه تمام بدنش را فرا گرفت. پس او را بوسیدم و با او وداع کردم و از نزدش بیرون آمدم و به او گفتم: «من به مسجد جامع می‌روم تا خبر مرگ تو به من برسد.» او به من گفت: «برو و نگذار کسی بر من وارد شود.» و خانواده و دخترانش را جمع کرد. هنگامی که ظهر فرا رسید، خبر مرگ او به من رسید. نزد او آمدم و او را در حالی یافتم که بیننده در مورد او بین زندگی و مرگ شک می‌کرد. و در همان حال او را دفن کردیم. و او مشهدی عظیم داشت. پس منزه است کسی که **يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ** (هر که را بخواهد به رحمت خود اختصاص می‌دهد). پس زندگی و مرگ صاحب این مقام یکسان است. و هر آنچه در این باب از علم پیش آوردیم، علم صاحب این مقام است، زیرا از علم انفاس (علم الأنفاس) است. و به همین دلیل آنچه را که ذکر کردیم، بیان نمودیم. و **الله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 6
}