{
  "id": 452,
  "title": {
    "ar": "الباب الثاني والخمسون وأربعمائة في معرفة منازلة كلامي كله موعظة لعبيدي لو اتعظوا",
    "en": "Chapter Four Hundred and Fifty-Two, Concerning the Knowledge of the Station of My Speech, all of which is an Admonition for My Servants, if they would take heed.",
    "ur": "باب نمبر چار سو باون (۴۵۲): اس نزول کی معرفت میں کہ \"میرا سارا کلام میرے بندوں کے لیے نصیحت ہے، کاش وہ نصیحت پکڑیں\"۔",
    "fa": "باب چهارصد و پنجاه و دوم در معرفت منزلتی که تمام کلام من موعظه‌ای برای بندگانم است اگر پند گیرند."
  },
  "content": {
    "ar": "## «الباب الثاني والخمسون وأربعمائة في معرفة منازلة كلامي كله موعظة لعبيدي لو اتعظوا»\n\n\n> مهما وعظت فعظ بعين كلامي *** فهو الموفي حق كل مقام‏\n\n\n> جمع العلوم قديمها وحديثها *** معناه إلا أنه بفدام‏\n\n\n> وفدامه ألفاظنا وحروفنا *** الجامعات لعين كل كلام‏\n\n\n> فنقول قال الله بالحرف الذي *** قال الأنام به بغير ملام‏\n\n\n> فترده أحلامنا بدليلها *** والكشف يأبى ما ترى أحلامي‏\n\n\n> والحكم للأمرين عند من ارتقى *** بمعارج الأرواح والأجسام‏\n> فانظر إليه منزها ومشبها *** والحكم للإقدام في الإقدام‏\n\n\n> علم الوجود ضياؤه وظلامه *** نور يمازجه كيان ظلام‏\n\n\n> ما إن رأيت ولا سمعت بمثله *** شمس تشاهد في حجاب غمام‏\n\n\n> إني حكمت على الزمان بمثل ما *** حكمت عليه مشارق الأيام‏\n\n\n> فالدهر محكوم عليه وحاكم *** مع كونه يسمو على الحكام‏\n\n\n> حكمت عليه شرائع ودلائل *** مع كونها من جملة الخدام‏\n\n\n> واعلم بأنك إن نظرت بعينه *** يبدو لك الإحكام في الأحكام‏\n\n\n### [الوعظ والأدب‏]\n\n\nقال الله تعالى لنبيه صَلَّى اللهُ عَليهِ وسَلَّم قُلْ إِنَّما أَعِظُكُمْ بِواحِدَةٍ فقال بعض السامعين سَواءٌ عَلَيْنا أَ وَعَظْتَ أَمْ لَمْ تَكُنْ من الْواعِظِينَ فاعتنى الله بأهل الايمان فقال وذَكِّرْ فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ فالتفت إلى القابل وما التفت إلى المعرض فلم يرتبط الوجود إلا بالمؤمن وهو سبحانه الْمُؤْمِنُ الْمُهَيْمِنُ على المؤمنين فجزاء الله عندنا على هذا الاعتناء العمل بما شرع والمبادرة لما به نهي وأمر اعتناء باعتناء وهو أحق بنا فإن اعتناءنا بالقبول يعود علينا نفعه لافتقارنا إلى ذلك النفع واعتناؤه بنا امتنان منه لأنه غني حميد بغناه فوعظنا بالحوادث الواقعة على خلاف الأغراض مما تنفر عنه طباعنا وذكرنا بأنا معرضون لحلولها بنا إلا أن يعصم الله في بعضها لا في كلها فإن منتهى الدوائر وأعظمها الموت ولا بد منه بأي وجه كان ولست أعني بالموت إلا الانتقال عن هذه الدار فإن الشهيد منتقل وإن لم يتصف بالموت هكذا أمرنا المؤدب أن نقول فإن لنا نصيبا من الأدب الإلهي الذي أدب به الله رسوله صَلَّى اللهُ عَليهِ وسَلَّم فليس أدب الله خاصا بأحد دون أحد فمن قبله سعد وكان ممن أدبه الله وانتمى إلى الله في الأدب وهو أحسن الأدب وقد نهانا أن نقول لمن يقتل في سبيل الله إنه ميت ولا نحسب أنه ميت بل هو حي عند ربه وفي إيماني يرزق وذكرنا تعالى بموعظته ذكرى حال إذ أصاب من قبلنا بوقوع تلك الدوائر عليهم‏\n\n\n> ألذ الفعل فعل القهر فانظر *** بعقلك إذا رأتك سنى الوجود\n\n\n> فكن لي إن تكن لي أنت كلي *** وإن لم فاعتبر فالجود جودي‏\n\n\n> لقد تبنا وما خفنا عقابا *** وقد أعني المجيد عن المجيد\n\n\n> فقل للمنكرين صحيح قولي *** لقد غبتم عن إحسان المجيد\n\n\nوذكر بأمور أخبر عنها في المستقبل عند الانتقال إلى الدار الآخرة تقع بالعباد مما يسر وقوعها ومما لا يسر ومما يوافق الغرض ويلائم الطبع ومما لا يلائم الطبع ولا يوافق الغرض ومما يدل على الكمال والنقص فذكر بالرغبة في ذلك والرهبة من ذلك وذكر بنفسه لما علم تعالى أن إفراط القرب حجاب عظيم عن القرب وقد قال إنه أقرب إلينا من حبل الوريد وحبل الوريد نعلم قربه ولا تراه أبصارنا كذلك قرب الحق منا نؤمن بقربه ولا تدركه أبصارنا فلذلك ذكر بنفسه لا لبعده لأنه حفيظ والحفظ يطلب القرب بلا شك فنحن بعينه وهو معنا حيثما كنا لا بل أينما كنا ونستغفر الله من عثرات اللسان وإن كان من عند الله فالأدب أولى ولا سيما فيما ينسب إلى الجناب الإلهي لا ينبغي للأديب إن يتكل على المعنى بل الأدب في مراعاة الألفاظ فإنه تعالى لم يعدل إلى لفظ دون غيره سدى فلا نعدل عنه فإن العدول عنه إلى مثله في المعنى تحريف بغير فائدة ويقنع العدو من الكبراء بهذا القدر فهي مزلة قدم ومكر خفي ورعونة نفس وإظهار مرتبة دنية يتخيل مظهرها أنها زلفى وإنها رتبة أسنى وأعلى فلما ذكر بنفسه ذكر أنه إليه يرجع الأمر كله لنعلم أن المرجع إليه فلا نقوم في شي‏ء نحتاج فيه إلى الاعتذار عنه أو نستحي منه عند المرجع إليه والعبد الصحيح العبودية مع الموافقة لا يكون له إدلال فكيف مع المخالفة ولما ذكر بنفسه أحال عباده على أنفسهم وقال لهم إن عرفتم نفوسكم عرفتموني‏\n\n\nفمن الأدب أن نرجع بالنظر إلى نفسي فإن نظرت فيه وتركت نفسي فما تأدبت وإذا لم أكن أديبا لم نكن من أهل البساط فحرمت المشاهدة فحرمت العلم الذي يعطيه الشهود\nفإني إن نظرت فيه حتى أعرفه فربما أعرفه المعرفة التي تليق بهذا النظر وليست المطلوبة فإن الذي طلب سبحانه أن نعرفه معرفة الارتباط به وتلك المعرفة التي عدل إليها من عدل لا تعطي الارتباط فلم تحصل الفائدة التي قصد الله بها عبده فالأديب يرجع بالنظر إلى نفسه عن أمر ربه فإذا عرف نفسه فكرا أو شهودا عرف ارتباطه بربه فعرف ربه تنزيها وتشبيها معرفة عقلية شرعية إلهية تامة كاملة غير ناقصة كما شاء الحق فإنه تعالى أبان لنا في هذه الإحالة عن أحسن الطرق والعلم به فتبين لنا أنه الحق وأنه على كل شي‏ء شهيد وقال في حق من عدل عن هذا النظر بالنظر فيه ابتداء أَلا إِنَّهُمْ في مِرْيَةٍ من لِقاءِ رَبِّهِمْ فلو رجعوا إلى ما دعاهم إليه من النظر في نفوسهم لم يكونوا في مرية من لقاء ربهم فإنهم يجدونه في عين نفوسهم ثم تمم وقال أَلا إِنَّهُ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ وأراد هنا شيئية الوجود لا شيئية الثبوت فإن الأمر هناك لا يتصف بالإحاطة فمن وقف مع ما ذكرناه كان ممن اتعظ فإن شاء أخذ بنصيبه من الورث فوعظ وإن شاء بقي في النظر على حاله بنفسه دائما فإن النفس بحر لا ساحل له لا يتناهى النظر فيها دنيا وآخرة وهي الدليل الأقرب فكلما ازداد نظر ازداد علما بها وكلما ازداد علما بها ازداد علما بربه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Four Hundred and Fifty-Two: Concerning the Knowledge of the Levels of My Speech, All of Which is an Admonition for My Servants, If Only They Would Heed It\n\nWhenever I admonish, then admonish with the very essence (عين) of My speech,\nFor it fulfills the right of every station (مقام).\nIts meaning gathers all knowledge, ancient and recent,\nExcept that it is veiled (بفدام).\nAnd its veil is our words and our letters,\nWhich gather the essence (عين) of all speech.\nSo we say, \"Allah spoke,\" using the very letter\nThat creatures speak with, without blame.\nOur intellects (أحلامنا) reject it based on their proofs,\nBut Unveiling (الكشف) refuses what my intellects perceive.\nYet the judgment belongs to both matters for him who ascends\nBy the ascensions (معارج) of the spirits and the bodies.\nSo look upon Him as Transcendent (منزها) and as Analogous (مشبها),\nAnd the judgment belongs to the advance within the advance.\nThe knowledge of Existence (الوجود) is its light and its darkness,\nA light mingled with the substance (كيان) of darkness.\nI have never seen nor heard of its like:\nA sun witnessed within the veil of a cloud.\nIndeed, I have judged Time (الزمان) with the same judgment\nThat the dawns of the days have judged it.\nThus, Time (الدهر) is judged and is a judge,\nEven while it rises above the judges.\nLaws (شرائع) and proofs (دلائل) have judged it,\nEven while they are among the servants.\nAnd know that if you look with His Eye,\nThe perfection (الإحكام) within the judgments (الأحكام) will become manifest to you.\n\n### [Admonition and Spiritual Discipline]\n\nAllah the Exalted said to His Prophet, may Allah bless him and grant him peace: <<قُلْ إِنَّما أَعِظُكُمْ بِواحِدَةٍ>> (Say: 'I admonish you concerning one thing only'). Then some of the listeners said: <<سَواءٌ عَلَيْنا أَ وَعَظْتَ أَمْ لَمْ تَكُنْ من الْواعِظِينَ>> (It is the same to us whether you admonish or are not among the admonishers). So Allah paid attention to the people of faith and said: <<وَذَكِّرْ فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ>> (And remind, for indeed the reminder benefits the believers).\n\nThus, He turned toward the receptive one and did not turn toward the one who turned away. Existence (الوجود) is therefore only connected to the believer, and He, glory be to Him, is the Giver of Security (المؤمن), the Guardian (المهيمن) over the believers. The recompense due to Allah from us for this attention is to act according to what He legislated and to hasten toward what He commanded and forbade—attention in return for attention. And He is more deserving of us. For our attention, which is acceptance, returns its benefit to us because of our need for that benefit. Whereas His attention toward us is a favor (امتنان) from Him, because He is the Rich (غني), the Praiseworthy (حميد) by virtue of His richness.\n\nThus, He admonished us through the events (الحوادث) that occur contrary to our aims, things that our natures recoil from. And He reminded us that we are exposed to their descent upon us, unless Allah grants protection (يعصم) in some of them, but not in all. For the limit of all cycles (الدوائر) and the greatest of them is death, and it is inevitable in whatever form it comes. I do not mean by death anything but the transition from this abode. For the martyr (الشهيد) is transitioning, even if he is not described as dead. This is how the Disciplinarian (المؤدب) commanded us to speak.\n\nFor we have a share of the Divine Discipline (الأدب الإلهي) with which Allah disciplined His Messenger, may Allah bless him and grant him peace. Allah’s discipline is not specific to one person over another. Whoever accepts it is made happy and becomes one of those whom Allah has disciplined, affiliating himself with Allah through discipline, which is the best discipline. He forbade us from saying that one who is killed in the path of Allah is dead, nor should we reckon him as dead; rather, he is alive with his Lord and is provided for, according to my faith. And the Exalted reminded us through His admonition, a reminder of the state when those cycles afflicted those who came before us.\n\nThe sweetest act is the act of Overpowering (القهر), so look\nWith your intellect when the light of Existence (الوجود) shows you.\nBe Mine, and if you are Mine, you are My totality,\nAnd if not, then reflect, for generosity (الجود) is My generosity.\nWe have repented, yet we did not fear punishment,\nAnd the Glorious One (المجيد) has enriched me beyond the glorious.\nSo say to those who deny my sound speech:\n\"You have been absent from the beneficence (إحسان) of the Glorious One.\"\n\nAnd He reminded us of matters He informed us about concerning the future, upon the transition to the Hereafter (الدار الآخرة), which will befall the servants—some of which are pleasing in their occurrence and some not pleasing; some that accord with one's aim and suit one's nature, and some that neither suit one's nature nor accord with one's aim; and some that indicate perfection and deficiency. Thus, He reminded us by inspiring desire for that and fear of that.\n\nAnd He reminded us of Himself, because the Exalted knew that the excess of proximity (إفراط القرب) is a great veil (حجاب) from proximity. He said that He is <<أَقْرَبُ إِلَيْنَا مِنْ حَبْلِ الْوَرِيدِ>> (closer to us than the jugular vein). We know the proximity of the jugular vein, yet our eyes do not see it. Likewise, we believe in the proximity of the Real (الحق) to us, yet our eyes do not perceive Him. Therefore, He reminded us of Himself not because of His distance, for He is a Preserver (حفيظ), and preservation undoubtedly requires proximity. Thus, we are in His Eye, and He is with us wherever we are—no, rather, wherever we are.\n\nWe seek Allah’s forgiveness for slips of the tongue, even if it comes from Allah, for discipline (الأدب) is more appropriate, especially concerning what is attributed to the Divine Presence (الجناب الإلهي). The disciplined person should not rely solely on the meaning; rather, discipline lies in observing the exact wording (الألفاظ). For the Exalted did not choose one word over another in vain, so we should not deviate from it. Deviating from it to a word similar in meaning is a distortion (تحريف) without benefit. The enemy among the great ones is satisfied with this much, for it is a slippery slope, a hidden deceit, a recklessness of the soul, and a display of a base rank whose exhibitor imagines it to be proximity (زلفى) and a higher, loftier rank.\n\nWhen He reminded us of Himself, He mentioned that <<إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (to Him returns the whole affair), so that we may know that the return is to Him, and thus we do not engage in anything for which we would need to apologize or feel shame when returning to Him. The servant whose servitude (العبودية) is sound, even when in agreement (with the Divine Will), does not boast; how then when in opposition?\n\nAnd when He reminded us of Himself, He referred His servants back to themselves, saying to them: \"If you know yourselves, you know Me.\"\n\nIt is part of discipline that we return our gaze to myself. If I look at Him (the Real) and abandon myself, I have not been disciplined. And if I am not disciplined, I am not among the People of the Carpet (أهل البساط), so I am deprived of Witnessing (المشاهدة), and thus deprived of the Knowledge (العلم) that Witnessing grants.\n\nFor if I look at Him until I know Him, perhaps I will know Him with a knowledge appropriate to that gaze, but it is not the knowledge sought. For what the Glorified One sought is that we know Him with the knowledge of our connection (الارتباط) to Him. And that knowledge to which those who deviated turned does not grant this connection, so the benefit that Allah intended for His servant is not achieved.\n\nThus, the disciplined person (الأديب) returns his gaze to himself, by the command of his Lord. When he knows himself, whether through contemplation (فكرا) or Witnessing (شهودا), he knows his connection to his Lord. He then knows his Lord as Transcendent (تنزيها) and Analogous (تشبيها)—a complete, perfect, and non-deficient knowledge that is intellectual, legal, and Divine, just as the Real (الحق) willed.\n\nFor the Exalted made clear to us through this referral the best paths and the knowledge of Him. Thus, it became clear to us that He is the Real and that He is <<عَلَى كُلِّ شَيْءٍ شَهِيدٌ>> (a Witness over all things). And concerning those who deviated from this gaze by looking at Him initially, He said: <<أَلَا إِنَّهُمْ فِي مِرْيَةٍ مِنْ لِقَاءِ رَبِّهِمْ>> (Unquestionably, they are in doubt concerning the meeting with their Lord). If they had returned to what He called them to—the contemplation of their own souls—they would not have been in doubt concerning the meeting with their Lord, for they would find Him in the very essence (عين) of their souls. Then He completed it by saying: <<أَلَا إِنَّهُ بِكُلِّ شَيْءٍ مُحِيطٌ>> (Unquestionably, He encompasses all things). And here, He intended the thingness of Existence (شيئية الوجود), not the thingness of the Fixed Entities (شيئية الثبوت), for the matter there [in the realm of the Fixed Entities] is not characterized by encompassing (الإحاطة).\n\nWhoever adheres to what we have mentioned is one who has heeded the admonition. If he wishes, he may take his share of the inheritance and admonish others; and if he wishes, he may remain perpetually in the contemplation of his own self. For the soul (النفس) is a sea without a shore; contemplation of it is endless, both in this world and the Hereafter. It is the closest proof. The more one contemplates, the more knowledge one gains of it, and the more knowledge one gains of it, the more knowledge one gains of his Lord. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو باون: اس معرفت میں کہ میرا سارا کلام میرے بندوں کے لیے نصیحت ہے، کاش وہ نصیحت حاصل کرتے۔\n\nجب بھی تم نصیحت کرو، میرے کلام کی اصل (عین) کے ساتھ نصیحت کرو،\nکیونکہ وہی ہر مقام کا حق پورا کرنے والا ہے۔\n\nاس کا معنی قدیم اور جدید تمام علوم کا مجموعہ ہے،\nمگر یہ ایک پردے (فدام) میں ہے۔\n\nاور اس کا پردہ ہمارے الفاظ اور ہمارے حروف ہیں،\nجو ہر کلام کی اصل (عین) کو جمع کرنے والے ہیں۔\n\nپس ہم کہتے ہیں کہ اللہ نے اسی حرف کے ساتھ فرمایا\nجس کے ساتھ لوگ بغیر کسی ملامت کے کہتے ہیں۔\n\nتو ہمارے عقلی دلائل اسے اپنے ثبوت کے ساتھ رد کر دیتے ہیں،\nاور (الکشف) کشف اس چیز کو قبول نہیں کرتا جو میرے عقلی دلائل دیکھتے ہیں۔\n\nاور حکم ان دونوں (عقل اور کشف) کے لیے ہے اس شخص کے نزدیک جو\nارواح اور اجسام کی سیڑھیوں کے ذریعے بلند ہوا۔\n\nپس اسے تنزیہ (منزہ) اور تشبیہ (مشابہ) دونوں طرح دیکھو،\nاور حکم (الإقدام) پیش قدمی میں پیش قدمی کے لیے ہے۔\n\nعلم الوجود (علم الوجود) اس کی روشنی اور اس کا اندھیرا ہے،\nایک ایسا نور جس میں تاریکی کا وجود (کیان ظلام) گھلا ملا ہے۔\n\nمیں نے نہ اس جیسا دیکھا اور نہ سنا،\nایک ایسا سورج جو بادل کے پردے میں دیکھا جاتا ہے۔\n\nمیں نے زمانے پر اسی طرح حکم لگایا جس طرح\nایام کے طلوع ہونے کی جگہوں نے اس پر حکم لگایا۔\n\nپس زمانہ (الدهر) وہ ہے جس پر حکم لگایا گیا ہے اور وہ حاکم بھی ہے،\nاس کے باوجود کہ وہ تمام حاکموں سے بلند ہے۔\n\nاس پر شریعتوں اور دلائل نے حکم لگایا،\nاس کے باوجود کہ وہ خود خادموں میں سے ہیں۔\n\nاور جان لو کہ اگر تم اس کی اصل (عین) کے ساتھ دیکھو گے\nتو تمہیں تمام احکام میں پختگی (الإحکام) نظر آئے گی۔\n\n### [الوعظ والأدب (نصیحت اور ادب)]\n\nاللہ تعالیٰ نے اپنے نبی صَلَّى اللهُ عَليهِ وسَلَّم سے فرمایا: قُلْ إِنَّما أَعِظُكُمْ بِواحِدَةٍ (کہہ دیجیے: میں تمہیں صرف ایک بات کی نصیحت کرتا ہوں)۔ [سبأ: 46] تو بعض سننے والوں نے کہا: سَواءٌ عَلَيْنا أَ وَعَظْتَ أَمْ لَمْ تَكُنْ من الْواعِظِينَ (ہمارے لیے برابر ہے، خواہ آپ نصیحت کریں یا نصیحت کرنے والوں میں سے نہ ہوں)۔ [الشعراء: 136] پس اللہ نے اہل ایمان کی طرف توجہ فرمائی اور کہا: وذَكِّرْ فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ (اور نصیحت کرتے رہو، کیونکہ نصیحت ایمان والوں کو فائدہ دیتی ہے)۔ [الذاریات: 55] پس اس نے قبول کرنے والے کی طرف التفات کیا اور منہ موڑنے والے کی طرف التفات نہیں کیا۔ لہٰذا (الوجود) ہستی کا تعلق صرف مومن کے ساتھ قائم ہوا، اور وہ سبحانہ و تعالیٰ الْمُؤْمِنُ الْمُهَيْمِنُ (مومن، نگہبان) ہے مومنوں پر۔\n\nپس اس توجہ (اعتناء) کے بدلے میں ہمارے نزدیک اللہ کا بدلہ یہ ہے کہ ہم اس پر عمل کریں جو اس نے مشروع کیا اور اس کی طرف تیزی سے بڑھیں جس سے اس نے منع کیا اور جس کا اس نے حکم دیا، یہ توجہ کے بدلے توجہ ہے۔ اور وہ ہم سے زیادہ حقدار ہے، کیونکہ قبول کرنے میں ہماری توجہ کا فائدہ ہم ہی کو پہنچتا ہے، اس لیے کہ ہم اس فائدے کے محتاج ہیں۔ اور اس کی ہم پر توجہ اس کی طرف سے احسان ہے، کیونکہ وہ اپنے غنا کے سبب غنی حمید ہے۔ پس اس نے ہمیں ان حادثات کے ذریعے نصیحت کی جو ہماری خواہشات کے خلاف واقع ہوتے ہیں اور جن سے ہماری طبیعتیں نفرت کرتی ہیں، اور ہمیں یاد دلایا کہ ہم ان کے ہم پر نازل ہونے کے خطرے سے دوچار ہیں، مگر یہ کہ اللہ بعض میں بچا لے، سب میں نہیں۔ کیونکہ تمام دائروں میں سب سے آخری اور سب سے بڑا موت ہے، اور وہ کسی بھی صورت میں ہو، اس سے مفر نہیں۔ اور موت سے میری مراد صرف اس دنیا سے انتقال ہے، کیونکہ شہید منتقل ہوتا ہے اگرچہ وہ موت سے متصف نہیں ہوتا۔ ہمارے مؤدب نے ہمیں یہی کہنے کا حکم دیا ہے، کیونکہ ہمیں اس (الأدب الإلهي) ادب الٰہی سے حصہ ملا ہے جس کے ذریعے اللہ نے اپنے رسول صَلَّى اللهُ عَليهِ وسَلَّم کو ادب سکھایا۔ پس اللہ کا ادب کسی ایک کے ساتھ خاص نہیں ہے، جو اسے قبول کرتا ہے وہ کامیاب ہوتا ہے اور ان لوگوں میں شامل ہو جاتا ہے جنہیں اللہ نے ادب سکھایا اور وہ ادب میں اللہ سے منسوب ہو جاتا ہے، اور یہ بہترین ادب ہے۔ اور اس نے ہمیں منع کیا ہے کہ ہم اس شخص کو جو اللہ کی راہ میں قتل ہو جائے، مردہ کہیں، اور نہ ہی ہم اسے مردہ گمان کریں، بلکہ وہ اپنے رب کے پاس زندہ ہے اور میرے ایمان میں اسے رزق دیا جاتا ہے۔ اور اللہ تعالیٰ نے اپنی نصیحت کے ذریعے ہمیں اس حال کی یاد دہانی کرائی جب ہم سے پہلے لوگوں کو ان دائروں کے ان پر واقع ہونے سے مصیبت پہنچی۔\n\nسب سے لذیذ فعل قہر کا فعل ہے، پس اپنی عقل سے دیکھو\nجب ہستی کی شان (سنى الوجود) تمہیں دیکھے۔\n\nپس میرے لیے ہو جاؤ، اگر تم میرے لیے ہو گئے تو تم میرے کُل ہو،\nاور اگر نہیں تو عبرت حاصل کرو، کیونکہ سخاوت (الجود) میری ہے۔\n\nہم نے توبہ کی اور ہم نے عذاب سے خوف نہیں کھایا،\nاور (المجید) مجید نے مجید سے بے نیاز کر دیا۔\n\nپس میرے صحیح قول کا انکار کرنے والوں سے کہہ دو\nکہ تم مجید کے احسان سے غائب رہے۔\n\nاور اس نے ان امور کے ذریعے یاد دلایا جن کی خبر اس نے مستقبل میں دی ہے، جب آخرت کی طرف انتقال ہو گا، جو بندوں پر واقع ہوں گے، ان میں سے جو خوشی کا باعث ہوں گے اور جو خوشی کا باعث نہیں ہوں گے، اور ان میں سے جو خواہش کے مطابق ہوں گے اور طبیعت کے موافق ہوں گے، اور ان میں سے جو طبیعت کے موافق نہیں ہوں گے اور خواہش کے مطابق نہیں ہوں گے، اور ان میں سے جو کمال اور نقص پر دلالت کریں گے۔ پس اس نے اس کی رغبت اور اس سے خوف کے ذریعے یاد دلایا۔ اور اس نے اپنی ذات کے ذریعے یاد دلایا، کیونکہ اللہ تعالیٰ نے جان لیا کہ قرب کی زیادتی قرب سے ایک عظیم پردہ ہے۔ اور اس نے فرمایا ہے کہ وہ ہماری شہ رگ سے بھی زیادہ قریب ہے (أقرب إلينا من حبل الوريد) [ق: 16]۔ اور ہم شہ رگ کے قرب کو جانتے ہیں لیکن ہماری آنکھیں اسے نہیں دیکھتیں، اسی طرح حق کا قرب ہم سے ہے، ہم اس کے قرب پر ایمان رکھتے ہیں لیکن ہماری آنکھیں اسے نہیں پا سکتیں۔ اسی لیے اس نے اپنی ذات کے ذریعے یاد دلایا، نہ کہ اس کی دوری کی وجہ سے، کیونکہ وہ حفیظ (نگہبان) ہے اور نگہبانی بلاشبہ قرب کا تقاضا کرتی ہے۔ پس ہم اس کی نگاہ میں ہیں اور وہ ہمارے ساتھ ہے جہاں کہیں بھی ہم ہوں، بلکہ جہاں کہیں بھی ہم ہوں۔ اور ہم زبان کی لغزشوں سے اللہ سے استغفار کرتے ہیں، اگرچہ یہ اللہ کی طرف سے ہو، لیکن ادب زیادہ اولیٰ ہے، خاص طور پر اس معاملے میں جو (الجناب الإلهي) جناب الٰہی سے منسوب ہو۔ ادیب کے لیے مناسب نہیں کہ وہ معنی پر بھروسہ کرے، بلکہ ادب الفاظ کی رعایت میں ہے۔ کیونکہ اللہ تعالیٰ نے کسی لفظ کو دوسرے لفظ کے مقابلے میں بے فائدہ نہیں چھوڑا، لہٰذا ہم اس سے انحراف نہ کریں۔ کیونکہ معنی میں اس کے مماثل کی طرف انحراف کرنا بغیر کسی فائدے کے تحریف ہے۔ اور بڑے لوگوں میں سے دشمن اسی قدر پر قناعت کر لیتا ہے، پس یہ قدم پھسلنے کی جگہ ہے، اور ایک پوشیدہ مکر ہے، اور نفس کی رعونت ہے، اور ایک پست مرتبے کا اظہار ہے جسے ظاہر کرنے والا گمان کرتا ہے کہ یہ قرب ہے اور یہ ایک بلند اور اعلیٰ مرتبہ ہے۔\n\nجب اس نے اپنی ذات کے ذریعے یاد دلایا تو اس نے یاد دلایا کہ تمام معاملہ اسی کی طرف لوٹتا ہے (إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ) [ہود: 123] تاکہ ہم جان لیں کہ مرجع اسی کی طرف ہے، پس ہم کسی ایسی چیز میں کھڑے نہ ہوں جس کے بارے میں ہمیں اس کے سامنے عذر پیش کرنے کی ضرورت ہو یا جس سے ہمیں اس کی طرف لوٹنے پر شرمندگی ہو۔ اور صحیح عبودیت والا بندہ موافقت کے ساتھ بھی ناز نہیں کرتا، تو مخالفت کے ساتھ کیسے کرے گا؟ اور جب اس نے اپنی ذات کے ذریعے یاد دلایا تو اس نے اپنے بندوں کو ان کی اپنی جانوں کی طرف متوجہ کیا اور ان سے کہا کہ اگر تم نے اپنی جانوں کو پہچان لیا تو تم نے مجھے پہچان لیا۔\n\nپس ادب یہ ہے کہ ہم نظر کو اپنی ذات کی طرف لوٹائیں، اگر میں نے اس میں نظر کی اور اپنی ذات کو چھوڑ دیا تو میں نے ادب حاصل نہیں کیا، اور جب میں ادیب نہیں ہوں گا تو میں اہل بساط میں سے نہیں ہوں گا، پس میں (المشاھدۃ) مشاہدہ سے محروم ہو جاؤں گا، پس میں اس علم سے محروم ہو جاؤں گا جو (الشہود) شہود عطا کرتا ہے۔\n\nکیونکہ اگر میں نے اس میں نظر کی یہاں تک کہ میں اسے پہچان لوں، تو شاید میں اسے وہ معرفت دوں جو اس نظر کے لائق ہے اور وہ مطلوبہ معرفت نہیں ہے۔ کیونکہ سبحانہ و تعالیٰ نے جو طلب کیا ہے وہ اس کے ساتھ (ارتباط) تعلق کی معرفت ہے، اور وہ معرفت جس کی طرف انحراف کرنے والے نے انحراف کیا، وہ تعلق عطا نہیں کرتی۔ پس وہ فائدہ حاصل نہیں ہوا جو اللہ نے اپنے بندے کے لیے مقصود رکھا تھا۔ پس ادیب اپنے رب کے حکم سے نظر کو اپنی ذات کی طرف لوٹاتا ہے۔ پس جب وہ اپنی ذات کو فکری طور پر یا (الشہود) شہود کے ذریعے پہچان لیتا ہے، تو وہ اپنے رب کے ساتھ اپنے تعلق کو پہچان لیتا ہے، پس وہ اپنے رب کو تنزیہ (تنزیہ) اور تشبیہ (تشبیہ) کے ساتھ پہچان لیتا ہے، ایک عقلی، شرعی، الٰہی، کامل اور مکمل معرفت، جو ناقص نہیں ہوتی، جیسا کہ حق نے چاہا۔ کیونکہ اس نے اس احالہ میں ہمیں اس کے بارے میں بہترین طریقوں اور علم سے آگاہ کر دیا۔ پس ہمارے لیے واضح ہو گیا کہ وہ (الحق) حق ہے اور وہ ہر چیز پر (شہید) گواہ ہے۔ اور اس نے اس شخص کے حق میں فرمایا جس نے اس نظر سے انحراف کیا اور ابتداء میں اس میں نظر کی: أَلا إِنَّهُمْ في مِرْيَةٍ من لِقاءِ رَبِّهِمْ (خبردار! بے شک وہ اپنے رب کی ملاقات کے بارے میں شک میں ہیں) [حم السجدة: 54]۔ اگر وہ اس چیز کی طرف لوٹتے جس کی طرف اس نے انہیں اپنی جانوں میں نظر کرنے کی دعوت دی تھی، تو وہ اپنے رب کی ملاقات کے بارے میں شک میں نہ ہوتے، کیونکہ وہ اسے اپنی جانوں کی اصل (عین) میں پاتے ہیں۔ پھر اس نے بات مکمل کی اور فرمایا: أَلا إِنَّهُ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ (خبردار! بے شک وہ ہر چیز پر محیط ہے) [حم السجدة: 54]۔ اور یہاں اس نے (شیئية الوجود) ہستی کی شیئیت مراد لی ہے نہ کہ (شیئية الثبوت) ثبوت کی شیئیت، کیونکہ وہاں معاملہ احاطہ سے متصف نہیں ہوتا۔ پس جو شخص اس پر قائم رہا جو ہم نے ذکر کیا، وہ ان لوگوں میں سے ہو گا جنہوں نے نصیحت حاصل کی۔ پھر اگر وہ چاہے تو وراثت میں سے اپنا حصہ لے کر نصیحت کرے، اور اگر چاہے تو ہمیشہ اپنی ذات کے ساتھ نظر میں اپنی حالت پر باقی رہے۔ کیونکہ نفس ایک ایسا سمندر ہے جس کا کوئی ساحل نہیں، دنیا اور آخرت میں اس میں نظر ختم نہیں ہوتی، اور وہ سب سے قریب ترین دلیل (الدليل الأقرب) ہے۔ پس جتنا زیادہ نظر بڑھتا ہے، اتنا ہی اس کے بارے میں علم بڑھتا ہے، اور جتنا زیادہ اس کے بارے میں علم بڑھتا ہے، اتنا ہی اپنے رب کے بارے میں علم بڑھتا ہے۔ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے) [الأحزاب: 4]۔",
    "fa": "باب چهارصد و پنجاه و دوم در معرفت منزلت کلام من که تماماً موعظه‌ای برای بندگانم است، اگر پند گیرند.\n\nهرگاه پند دادی، پس با عین کلام من پند ده،\nزیرا آن است که حق هر مقام (مقام) را به کمال می‌رساند.\n\nمعنای آن، گردآورنده علوم قدیم و جدید است،\nجز اینکه با پرده‌ای (فدام) پوشیده شده است.\n\nو پرده آن، الفاظ و حروف ما هستند،\nکه جامع عین هر کلامی می‌باشند.\n\nپس ما می‌گوییم «خداوند فرمود» با همان حرفی که\nمردمان بدون سرزنش (یا نقص) با آن سخن می‌گویند.\n\nپس عقول ما آن را با دلیل خود رد می‌کنند،\nدر حالی که کشف (کشف) آنچه را که عقول من می‌بیند، نمی‌پذیرد.\n\nو حکم برای هر دو امر است نزد کسی که\nبا معراج‌های ارواح و اجسام ارتقا یافته است.\nپس به او بنگر در حالی که منزه (تنزیه) و مشبه (تشبیه) است،\nو حکم از آنِ پیشروی در پیشروی است.\n\nعلم الوجود (هستی)، روشنایی و تاریکی آن است؛\nنوری که کیان تاریکی با آن آمیخته است.\n\nمن هرگز مانند آن را ندیده‌ام و نشنیده‌ام؛\nخورشیدی که در حجاب ابری مشاهده می‌شود.\n\nمن بر زمان حکم کردم به همان سان که\nمشرق‌های روزها بر آن حکم کردند.\n\nپس دهر (زمان) محکوم علیه و حاکم است،\nبا وجود اینکه بر حاکمان برتری دارد.\n\nشرایع و دلایل بر آن حکم کردند،\nبا وجود اینکه خودشان از جمله خادمان هستند.\n\nو بدان که اگر با چشم او بنگری،\nاستحکام (احکام) در احکام بر تو آشکار می‌شود.\n\n### [پند و ادب]\n\nخداوند متعال به پیامبرش (صلی الله علیه و سلم) فرمود: «قُلْ إِنَّما أَعِظُكُمْ بِواحِدَةٍ» (بگو: من فقط شما را به یک چیز پند می‌دهم). پس برخی از شنوندگان گفتند: «سَواءٌ عَلَيْنا أَ وَعَظْتَ أَمْ لَمْ تَكُنْ من الْواعِظِينَ» (برای ما یکسان است، چه پند دهی و چه از پنددهندگان نباشی). پس خداوند به اهل ایمان توجه کرد و فرمود: «وَذَكِّرْ فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ» (و تذکر ده، زیرا تذکر برای مؤمنان سودمند است). پس به پذیرنده روی آورد و به روی‌گردان توجهی نکرد. از این رو، الوجود (هستی) جز با مؤمن مرتبط نشد. و او سبحانه، «الْمُؤْمِنُ الْمُهَيْمِنُ» (ایمن‌بخش و مسلط) بر مؤمنان است.\n\nپس پاداش خداوند نزد ما در برابر این توجه، عمل به آنچه تشریع کرده و شتاب در انجام آنچه نهی و امر نموده است، یعنی توجه در برابر توجه. و او به ما سزاوارتر است، زیرا توجه ما به پذیرش، نفعش به خودمان بازمی‌گردد، چرا که ما به آن نفع نیازمندیم؛ اما توجه او به ما، منتی از جانب اوست، زیرا او به غنای خود، غنی و ستوده است.\n\nپس ما را با حوادثی که بر خلاف خواسته‌ها واقع می‌شوند و طبع ما از آن‌ها گریزان است، پند داد؛ و ما را متذکر ساخت که در معرض فرود آمدن آن‌ها بر خود هستیم، مگر اینکه خداوند در برخی از آن‌ها ما را حفظ کند، نه در همه آن‌ها. زیرا نهایت و بزرگترینِ این دایره‌ها (حوادث)، مرگ است و به هر روی که باشد، از آن گریزی نیست. و منظور من از مرگ، جز انتقال از این سرا نیست، زیرا شهید نیز منتقل می‌شود، هرچند به مرگ توصیف نشود. مؤدب (معلم) ما چنین امر کرده است که بگوییم، زیرا ما نیز بهره‌ای از ادب الهی داریم که خداوند پیامبرش (صلی الله علیه و سلم) را با آن ادب کرد. پس ادب خداوند خاص کسی دون دیگری نیست؛ هر کس آن را بپذیرد، سعادتمند می‌شود و از کسانی خواهد بود که خداوند او را ادب کرده و در ادب به خداوند منتسب شده است، و این بهترین ادب است. و ما را نهی کرده است از اینکه به کسی که در راه خدا کشته می‌شود، بگوییم مرده است و نباید او را مرده بپنداریم، بلکه او نزد پروردگارش زنده است و در ایمان من روزی داده می‌شود. و خداوند متعال ما را با پند خود، به یاد حال کسانی انداخت که پیش از ما بودند، هنگامی که آن دایره‌ها (حوادث) بر آنان واقع شد.\n\nلذت‌بخش‌ترین فعل، فعل قهر است، پس با عقل خود بنگر\nآنگاه که روشنایی الوجود (هستی) تو را ببیند.\n\nپس از آنِ من باش؛ اگر از آنِ من باشی، تو تمامیت من هستی؛\nو اگر نه، پس عبرت بگیر، زیرا جود (بخشش) از آنِ من است.\n\nما توبه کردیم و از عقاب نترسیدیم،\nو مجید (خداوند با شکوه) مرا از مجید (بنده با شکوه) بی‌نیاز ساخت.\n\nپس به منکرانِ سخن صحیح من بگو:\nشما از احسان مجید (خداوند با شکوه) غایب شده‌اید.\n\nو (خداوند) با اموری که در آینده هنگام انتقال به دار آخرت برای بندگان واقع می‌شود، تذکر داد؛ اموری که وقوعشان شادکننده است و اموری که شادکننده نیست؛ اموری که موافق هدف و سازگار با طبع است و اموری که نه سازگار با طبع است و نه موافق هدف؛ و اموری که دلالت بر کمال و نقص دارند. پس با رغبت به آن و ترس از آن تذکر داد، و با نفس خود تذکر داد، زیرا خداوند متعال می‌دانست که افراط در قرب، حجابی بزرگ از قرب است. و فرموده است که او از رگ گردن (حبل الورید) به ما نزدیک‌تر است. و ما نزدیکی رگ گردن را می‌دانیم، اما چشمان ما آن را نمی‌بیند. همچنین نزدیکی الحق (حق) به ما؛ ما به نزدیکی او ایمان داریم، اما چشمان ما او را درک نمی‌کند.\n\nبه همین دلیل، با نفس خود تذکر داد، نه به دلیل دوری‌اش، زیرا او حفیظ (نگهبان) است و نگهبانی بی‌شک مستلزم قرب است. پس ما در عین او هستیم و او با ماست هر جا که باشیم، بلکه هر کجا که باشیم. و از لغزش‌های زبان استغفار می‌کنیم، و اگرچه (این سخن) از جانب خدا باشد، اما ادب سزاوارتر است، به ویژه در آنچه به ساحت الهی نسبت داده می‌شود. شایسته نیست که ادیب (صاحب ادب) بر معنا تکیه کند، بلکه ادب در رعایت الفاظ است، زیرا خداوند متعال بیهوده به لفظی دون دیگری روی نیاورده است، پس ما نیز نباید از آن عدول کنیم. زیرا عدول از آن به لفظی مشابه در معنا، تحریفی بی‌فایده است و دشمن از بزرگان به همین مقدار قانع می‌شود. این لغزشگاه قدم و مکر پنهان و سبکی نفس و اظهار مرتبه‌ای پست است که نمایش‌دهنده آن گمان می‌کند که نزدیکی (زلفی) و مرتبه‌ای والاتر و بالاتر است.\n\nپس هنگامی که با نفس خود تذکر داد، یادآور شد که «إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ» (همه امور به سوی او بازگردانده می‌شود) تا بدانیم که بازگشت به سوی اوست، پس در هیچ کاری که نیاز به عذرخواهی یا شرمندگی از آن نزد بازگشت به او داشته باشیم، اقدام نکنیم. و بنده با عبودیت (عبودية) صحیح، حتی با موافقت (با امر الهی) نیز ناز و دلال ندارد، پس چگونه با مخالفت (ناز کند)؟ و هنگامی که با نفس خود تذکر داد، بندگانش را به خودشان ارجاع داد و به آن‌ها فرمود: اگر نفوس خود را بشناسید، مرا خواهید شناخت.\n\nپس از ادب است که با نظر به نفس خود بازگردیم. اگر در او (خدا) بنگرم و نفس خود را رها کنم، مؤدب نشده‌ام. و اگر ادیب نباشم، از اهل بساط (حضور) نخواهم بود، پس از مشاهده (مشاهدة) محروم می‌شوم و در نتیجه از علمی که شهود (شهود) می‌بخشد، محروم می‌گردم. زیرا اگر در او بنگرم تا او را بشناسم، چه بسا او را با معرفتی بشناسم که شایسته این نظر است، در حالی که آن معرفت مطلوب نیست. زیرا آنچه او سبحانه خواسته است که ما بشناسیم، معرفتِ ارتباط با اوست، و آن معرفتی که هر کس به آن عدول کرده، ارتباط را نمی‌بخشد، پس فایده‌ای که خداوند برای بنده‌اش قصد کرده، حاصل نمی‌شود.\n\nپس ادیب به امر پروردگارش، با نظر به نفس خود بازمی‌گردد. هنگامی که نفس خود را با فکر یا شهود (شهود) شناخت، ارتباط خود را با پروردگارش شناخت، پس پروردگارش را تنزیهاً و تشبیهاً شناخت؛ شناختی عقلی، شرعی، الهی، تام، کامل و بدون نقص، همان‌گونه که الحق (حق) خواسته است. زیرا او تعالی در این ارجاع، بهترین راه‌های شناخت و علم به خود را برای ما آشکار ساخت، پس برای ما روشن شد که او الحق (حق) است و او بر هر چیزی شهید (گواه) است. و در حق کسی که از این نظر (در نفس) عدول کرده و مستقیماً در او (خدا) نگریسته، فرمود: «أَلا إِنَّهُمْ في مِرْيَةٍ من لِقاءِ رَبِّهِمْ» (آگاه باشید که آنان در شک و تردید از لقای پروردگارشان هستند). پس اگر به آنچه خداوند آن‌ها را به آن فراخوانده بود، یعنی نظر در نفوس خود، بازمی‌گشتند، در شک از لقای پروردگارشان نبودند، زیرا او را در عین نفوس خود می‌یابند. سپس کامل کرد و فرمود: «أَلا إِنَّهُ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ» (آگاه باشید که او بر هر چیزی احاطه دارد). و در اینجا منظور، شیئیت الوجود (هستی) است نه شیئیت الثبوت (ثبوت)، زیرا امر در آنجا (عالم ثبوت) به احاطه متصف نمی‌شود.\n\nپس هر کس با آنچه ذکر کردیم توقف کند، از کسانی است که پند گرفته است. اگر بخواهد، بهره خود را از وراثت می‌گیرد و پند می‌دهد، و اگر بخواهد، همیشه در حال خود با نفسش باقی می‌ماند. زیرا نفس دریایی است بی‌ساحل که نظر در آن در دنیا و آخرت پایان نمی‌پذیرد، و آن نزدیک‌ترین دلیل است. هر چه نظر بیشتر شود، علم به آن بیشتر می‌شود، و هر چه علم به آن بیشتر شود، علم به پروردگارش بیشتر می‌شود. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}