{
  "id": 309,
  "title": {
    "ar": "الباب التاسع وثلاثمائة في معرفة منزل الملامية من الحضرة المحمدية",
    "en": "Chapter 309: On knowing the spiritual station (منزل) of the Malamiyya (الملامية) within the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو نو (۳۰۹): حضرة محمدیہ (الحضرة المحمدية) سے ملامیہ (اللامية) کے منزل کی معرفت (المعرفۃ) کے بیان میں۔",
    "fa": "باب سیصد و نهم در شناخت جایگاه ملامتیه (الْمَلامِيَّة) از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب التاسع وثلاثمائة في معرفة منزل الملامية من الحضرة المحمدية»\n\n\nوهذا مقام رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وأبي بكر الصديق رضي الله عنه وممن تحقق به من الشيوخ حمدون القصار وأبو سعيد الخراز وأبو يزيد البسطامي وكان في زماننا هذا أبو السعود بن الشبل وعبد القادر الجيلي ومحمد الأواني وصالح البربري وأبو عبد الله الشرفي ويوسف الشبربلى ويوسف بن تعز وابن جعدون الحناوي ومحمد بن قسوم وأبو عبد الله بن المجاهد وعبد الله بن تاخمست وأبو عبد الله المهدوي وعبد الله القطان وأبو العباس الحصار وما يضيق الكتاب عن ذكرهم‏\n\n\n> كل من أقسم بالخلق فما *** يلزم الحنث له مهما حنث‏\n\n\n> فأنا أقسم بالله الذي *** أسكن الأرواح أجداث الجثث‏\n\n\n> وبآيات الهدى من نوره *** إنه ما خلق الخلق عبث‏\n\n\n> وإذا لم يكن الأمر كما *** قلت يا سندي لا تكترث‏\n\n\n> خاب عقل عاهد الشرع على *** عقد ما قرره ثم نكث‏\n\n\n> أ ترى يحصد شخص زرع من *** بذر الحب ونقي وحرث‏\n\n\n> لا وحق الحق ما يملكه *** أخبر الروح به حين نفث‏\n\n\n> أودع الأرواح روحا واحدا *** بين زوجين نكاحا ثم بث‏\n\n\n> كتم السر الذي فيه له *** غيرة منه زمانا ثم بث‏\n\n\n> لم يسو الله في أحكامه *** حكمة ما بين شيخ وحدث‏\n\n\n> ثم إن جاء بحكم جامع *** لهما كان لأمر قد حدث‏\n\n\n> فكان بالطفل قد حل به *** هرم والشيخ قد حل الجدث‏\n\n\n> كان حيا ثم ميتا ثم من *** بعد موت عاد حيا فبعث‏\n\n\n### [أن رجال الله ثلاثة]\n\n\nاعلم وفقك الله أن رجال الله ثلاثة لا رابع لهم رجال غلب عليهم الزهد والتبتل والأفعال الطاهرة المحمودة كلها وطهروا أيضا بواطنهم من كل صفة مذمومة قد ذمها الشارع غير أنهم لا يرون شيئا فوق ما هم عليه من هذه الأعمال ولا معرفة لهم بالأحوال ولا المقامات ولا العلوم الوهبية اللدنية ولا الأسرار ولا الكشوف ولا شيئا مما يجده غيرهم فهؤلاء يقال لهم العباد وهؤلاء إذا جاء إليهم أحد يسألهم الدعاء ربما انتهره أحدهم أو يقول له أي شي‏ء أكون أنا حتى أدعو لك وما منزلتي حذرا أن يتطرق إليهم العجب وخوفا من غوائل النفس لئلا يدخله الرياء في ذلك وإن كان منهم أحد يشتغل بقراءة فكتابه مثل الرعاية للمحاسبي وما جرى مجراه والنصف الثاني فوق هؤلاء يرون الأفعال كلها لله وإنه لا فعل لهم أصلا فزال عنهم الرياء جملة واحدة وإذا سألتهم في شي‏ء مما يحذره أهل الطريق يقولون أَ غَيْرَ الله تَدْعُونَ إِنْ كُنْتُمْ صادِقِينَ ويقولون قُلِ الله ثُمَّ ذَرْهُمْ وهم مثل العباد في الجد والاجتهاد والورع والزهد والتوكل‏\nوغير ذلك غير أنهم مع ذلك يرون أن ثم شيئا فوق ما هم عليه من الأحوال والمقامات والعلوم والأسرار والكشوف والكرامات فتتعلق هممهم بنيلها فإذا نالوا شيئا من ذلك ظهروا به في العامة من الكرامات لأنهم لا يرون غير الله وهم أهل خلق وفتوة وهذا الصنف يسمى الصوفية وهم بالنظر إلى الطبقة الثالثة أهل رعونة وأصحاب نفوس وتلامذتهم مثلهم أصحاب دعاوى يشمرون على كل أحد من خلق الله ويظهرون الرئاسة على رجال الله والصنف الثالث رجال لا يزيدون على الصلوات الخمس إلا الرواتب لا يتميزون عن المؤمنين المؤدين فرائض الله بحالة زائدة يعرفون بها يمشون في الأسواق ويتكلمون مع الناس لا يبصر أحد من خلق الله واحدا منهم يتميزون عن العامة بشي‏ء زائد من عمل مفروض أو سنة معتادة في العامة قد انفردوا مع الله راسخين لا يتزلزلون عن عبوديتهم مع الله طرفة عين ولا يعرفون للرئاسة طعما لاستيلاء الربوبية على قلوبهم وذلتهم تحتها قد أعلمهم الله بالمواطن وما تستحقه من الأعمال والأحوال وهم يعاملون كل موطن بما يستحقه قد احتجبوا عن الخلق واستتروا عنهم بستر العوام فإنهم عبيد خالصون مخلصون لسيدهم مشاهدون إياه على الدوام في أكلهم وشربهم ويقظتهم ونومهم وحديثهم معه في الناس يضعون الأسباب مواضعها ويعرفون حكمتها حتى تراهم كأنهم الذي خلق كل شي‏ء مما تراهم من إثباتهم الأسباب وتحضيضهم عليها يفتقرون إلى كل شي‏ء لأن كل شي‏ء عندهم هو مسمى الله ولا يفتقر إليهم في شي‏ء لأنه ما ظهر عليهم من صفة الغني بالله ولا العزة به ولا أنهم من خواص الحضرة الإلهية أمر يوجب افتقار الأشياء إليهم وهم يرون كون الأشياء لا تفتقر إليهم ويفتقرون إليها كون الله قال للناس أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ فهم وإن استغنوا بالله فلا يظهرون بصفة يمكن أن يطلق عليهم منها الاسم الذي قد وصف الله نفسه به وهو الاسم الغني وأبقوا لأنفسهم ظاهرا وباطنا الاسم الذي سماهم الله به وهو الفقير وقد علموا من هذا أن الفقر لا يكون إلا إلى الله الغني ورأوا الناس قد افتقروا إلى الأسباب الموضوعة كلها وقد حجبتهم في العامة عن الله وهم على الحقيقة ما افتقروا في نفس الأمر إلا إلى من بيده قضاء حوائجهم وهو الله قالوا فهنا قد تسمى الله بكل ما يفتقر إليه في الحقيقة والله لا يفتقر إلى شي‏ء فلهذا افتقرت هذه الطائفة إلى الأشياء ولم تفتقر إليهم الأشياء وهم من الأشياء والله لا يفتقر إلى شي‏ء ويفتقر إليه كل شي‏ء فهؤلاء هم الملامية وهم أرفع الرجال وتلامذتهم أكبر الرجال يتقلبون في أطوار الرجولية وليس ثم من حاز مقام الفتوة والخلق مع الله دون غيره سوى هؤلاء فهم الذين حازوا جميع المنازل ورأوا أن الله قد احتجب عن الخلق في الدنيا وهم الخواص له فاحتجبوا عن الخلق لحجاب سيدهم فهم من خلف الحجاب لا يشهدون في الخلق سوى سيدهم فإذا كان في الدار الآخرة وتجلى الحق ظهر هؤلاء هناك لظهور سيدهم فمكانتهم في الدنيا مجهولة العين فالعباد متميزون عند العامة بتقشفهم وتبعدهم عن الناس وأحوالهم وتجنب معاشرتهم بالجسم فلهم الجزاء والصوفية متميزون عند العامة بالدعاوي وخرق العوائد من الكلام على الخواطر وإجابة الدعاء والأكل من الكون وكل خرق عادة لا يتحاشون من إظهار شي‏ء مما يؤدي إلى معرفة الناس به قربهم من الله فإنهم لا يشاهدون في زعمهم إلا الله وغاب عنهم علم كبير وهذا الحال الذي هم فيه قليل السلامة من المكر والاستدراج والملامية لا يتميزون عن أحد من خلق الله بشي‏ء فهم المجهولون حالهم حال العوام واختصوا بهذا الاسم لأمرين الواحد يطلق على تلامذتهم لكونهم لا يزالون يلومون أنفسهم في جنب الله ولا يخلصون لها عملا تفرح به تربية لهم لأن الفرح بالأعمال لا يكون إلا بعد القبول وهذا غائب عن التلامذة وأما الأكابر فيطلق عليهم في ستر أحوالهم ومكانتهم من الله حين رأوا الناس إنما وقعوا في ذم الأفعال واللؤم فيما بينهم فيها لكونهم لم يروا الأفعال من الله وإنما يرونها ممن ظهرت على يده فناطوا اللؤم والذم بها فلو كشف الغطاء ورأوا أن الأفعال لله لما تعلق اللؤم بمن ظهرت على يده وصارت الأفعال‏\n\n\nعندهم في هذه الحالة كلها شريفة حسنة وكذلك هذه الطائفة لو ظهرت مكانتهم من الله للناس لاتخذوهم آلهة فلما احتجبوا عن العامة بالعادة انطلق عليهم في العامة ما ينطلق على العامة من الملام فيما يظهر عنها مما يوجب ذلك وكان المكانة تلومهم حيث لم يظهروا عزتها وسلطانها فهذا سبب إطلاق هذا اللفظ في الاصطلاح عليهم وهي طريقة مخصوصة لا يعرفها كل أحد انفرد بها أهل الله وليس لهم في العامة حال يتميزون بها\n\n\n### [أن الحكيم من العباد هو الذي ينزل كل شي‏ء منزلته‏]\n\n\nواعلم أن الحكيم‏\nمن العباد هو الذي ينزل كل شي‏ء منزلته ولا يتعدى به مرتبته ويعطي كل ذي حق حقه لا يحكم في شي‏ء بغرضه ولا بهواه لا تؤثر فيه الأعراض الطارئة فينظر الحكيم إلى هذه الدار التي قد أسكنه الله فيها إلى أجل وينظر إلى ما شرع الله له من التصرف فيها من غير زيادة ولا نقصان فيجري على الأسلوب الذي قد أبين له ولا يضع من يده الميزان الذي قد وضع له في هذا الموطن فإنه إن وضعه جهل المقادير فأما يخسر في وزنه أو يطفف وقد ذم الله الحالتين وجعل تعالى للتطفيف حالة تخصه يحمد فيها التطفيف فيطفف هناك على علم فإنه رجحان الميزان ويكون مشكورا عند الله في تطفيفه فإذا علم هذا ولم يبرح الميزان من يديه لم يخط شيئا من حكمة الله في خلقه ويكون بذلك إمام وقته فأول ما يزن به الأحوال في هذا الموطن فإن اقتضى وزنه للحال إظهار الحق لعباده وتعريف الخلق به عرفهم وذلك في الموطن الذي لا يؤدي ذكره إلى أذى الله ورسوله فإن الله قد وصف نفسه بأنه يؤذي فقال إِنَّ الَّذِينَ يُؤْذُونَ الله وهذا الذي اقتضى له اسم الصبور والاسم الحليم وقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ليس شخص أصبر على أذى من الله‏\n\n\nوقد كذب وشتم‏\n\n\nأخبر الله بذلك في الصحيح من الخبر عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عن ربه فقال كذبني ابن آدم ولم يكن ينبغي له ذلك وشتمني ابن آدم ولم يكن ينبغي له ذلك‏\n\n\nوهذا القول إنما تكلم به الاسم اللطيف ولهذا أكسبه هذا اللطف في العتب في دار الدنيا ووقع به التعريف ليرجع المكذب عن تكذيبه والشاتم عن شتمه فإنه موطن الرجوع والقبول منه والآخرة وإن كانت موطن الرجوع ولكن ليست موطن قبول فمن الميزان أن لا يعرض الحكيم بذكر الله ولا بذكر رسوله ولا أحد ممن له قدر في الدين عند الله في الأماكن التي يعرفها هذا الحكيم إذا ذكر الله فيها أو رسوله أو أحدا ممن اعتنى الله به كالصحابة عند الشيعة فإن ذلك داع إلى ثلب المذكور وشتمه وإدخال الأذى في حقه ففي مثل هذا الموطن لا يذكره‏\n\n\nأ لا تراه صَلَّى اللهُ عَليهِ وسَلَّم قد نهانا أن نسافر بالقرآن الذي هو المصحف إلى أرض العدوفإنه يؤدي ذلك إلى التعرض لإهانته وعدم حرمته مما يطرأ عليه ممن لا يؤمن به فإنه عدو له وهذا مقام الملامي لا غيره فالشريعة كلها هي أحوال الملامية\n\n\nسألت عائشة أم المؤمنين رضي الله عنها عن خلق رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فقالت رضي الله عنها كان خلقه القرآن‏\n\n\nثم تلت قوله تعالى وإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ فالأصل الإلهي الذي استندت إليه هذه الطائفة هو ما ذكرناه من أن الحق سبحانه يجب لجلاله من التعظيم والكبرياء ما تستحقه الألوهة ومع هذا فانظر موطن الدنيا ما اقتضاه في حق الحق من دعوى العبيد فيها الربوبية ومنازعة الحق في كبريائه وعظمته فقال فرعون أَنَا رَبُّكُمُ الْأَعْلى‏ وتكبر وتجبر وسبب\n\n\nذلك أن الموطن اقتضى أن ينحجب الخلق عن الله إذ لو أشهدهم نفسه في الدنيا لبطل حكم القضاء والقدر الذي هو علم الله في خلقه بما يكون عنهم وفيهم فكان حجابه رحمة بهم وإبقاء عليهم فإن تجليه سبحانه يعطي بذاته القهر فلا يتمكن معه دعوى فلما كانت الألوهية تجري بحكم المواطن كان هذا الأصل الإلهي مشهود الملامية إذ كانوا حكماء علماء فقالوا نحن فروع هذا الأصل إذ كان لكل ما يكون في العالم أصل إلهي ولكن ما كل أصل إلهي يكون في حق العبد إذا اتصف به محمودا فإن الكبرياء أصل إلهي بلا شك ولكن إن اتصف به العبد وصير نفسه فرعا لهذا الأصل واستعمله باطنا فإنه مذموم بكل وجه بلا خلاف ولكن إن استعمله ظاهرا في موضع خاص قد عين له وأبيح له فيه استعماله صورة ظاهرة لا روح لها منه كان محمودا لنفس الصورة ولهذا رأت الطائفة أن خرق العوائد واجب سترها على الأولياء كما أن إظهارها واجب على الأنبياء لكونهم مشرعين لهم التحكم في النفوس والأموال والأهل فلا بد من دليل يدل على إن التحكم في ذلك لرب المال والنفس والأهل فإن الرسول من الجنس فلا يسلم له دعواه ما ليس له بأصل إلا بدليل قاطع وبرهان والذي ليس له التشريع ولا التحكم في العالم بوضع الأحكام فلأي شي‏ء يظهر خرق العوائد حين مكنه الله من ذلك ليجعلها دلالة له على قربه عنده لا لتعرف الناس ذلك منه فمتى أظهرها في العموم فلرعونة قامت به غلبت عليه نفسه فيها فهي إلى المكر والاستدراج أقرب منها إلى الكرامة فالملامية أصحاب العلم الصحيح في ذلك فهم الطبقة العليا وسادات الطريقة المثلى والمكانة الزلفى في العدوة الدنيا والعدوة القصوى ولهم اليد البيضاء في علم المواطن وأهلها وما تستحق أن تعامل به ولهم علم الموازين وأداء الحقوق وكان سلمان الفارسي من أجلهم قدرا وهو من أصحاب رسول الله ص‏\nفي هذا المقام وهو المقام الإلهي في الدنيا ويتضمن هذا المنزل من العلوم هذا العلم وهو علم الحكمة ويتضمن علم المواقف وعلم الحساب وعلم الظن وعلم الإهمال والفرق بينه وبين الإمهال الذي يطلبه الاسم الحكيم وعلم السابقة إلى المعاصي والمخالفات وهل يكون للإنسان المخالفة عين الموافقة وإن كانت فهل تثمر له هذه المخالفة بهذه المثابة وسرعته إلى فعلها قربة عند الله وهل تحجب المقرب ولا بد وإن سارع إليها عند مباشرة الفعل المخالف للحكم المشروع عن الحكم المشروع فيه أو لا يحجب وإما أن يكون قربة ذلك الفعل المخالف ولكن قد يكون مقربا لا قربة وهو علم كبير لا يعرفه من أهل طريقنا إلا قليل فإن غوره بعيد وميزانه خفي دقيق ما في الموازين أخفى منه والأكثر من أهل طريق الله ما شاهده ولا رآه وإن قيل له أنكره فما ظنك بعلماء الرسوم فما ظنك بالعامة وأما أكابر الحكماء من الفلاسفة فأنكروه جملة واحدة وسبب إنكارهم مع فضلهم وبعد غورهم إنهم لا يقولون بالاختصاص كما نقول نحن بل الأمور عندهم كلها مكتسبة بالاستعداد فمن هنا خفي عليهم هذا العلم وغيره مما يتعلق بالاختصاص ومن علوم هذا المنزل علم السبب الذي أدى القائلين إلى إنكار الدار الآخرة الحسية والمعنوية فإنهم طائفتان بلا شك طائفة تنكر الحس الأخروي وطائفة تنكره معنى وحسا ومن علومه علم أحوال الموت ولما ذا يرجع وما حقيقته وذبحه وصورته في عالم التمثيل كبشا أملح ومكان ذبحه ولمن تنتقل حياته إذا ذبح وعلم التجلي الموجب لكسوف الكواكب المعنوية والحسية وعلم حضرة الجمع بين العبد والرب ومن هذه الحضرة ظهر القائلون بالاتحاد والحلول فإنها حضرة علم تزل فيها الاقدام فإن الشبهة فيه قوية لا يقاومها دليل مركب وعلم الأسفار ولنا فيه جزء سميناه الأسفار عن نتائج الأسفار يتضمن من العلم الإلهي ونسبة هذا الحكم الإلهي إليه ومن العلم الكوني ونسبة هذا الحكم الإلهي معنى وحسا شيئا كثيرا ومن علوم هذا المنزل الإلهي أيضا لأي اسم إلهي ترجع الناس يوم القيامة وعلم السبب الذي لأجله يسأل العالم غيره عما يعمله وسبب جحد العالم ما يعلمه إذا سئل عن العلم به وعلم كشف الإنسان ما في نفس الملك وهل هو من علم الستر أو الظهور أو منه ما يكون من علم الستر بوجه ومن علم الظهور بوجه وعلم الأدب وعلم الاقتداء وعلم السبب الموجب لإيثار الدنيا على الآخرة مع ما فيها من الغموم والإنكار الحسية والمعنوية وعلم الرؤية في الدار الآخرة وهل هي جائزة أو محال سواء كانت رؤية بصيرة أو بصر وهل الرؤية محلها حقيقة الرائي أو العين المعتاد المعروف وهل الرؤية حكم أو معنى وجودي وهل هي عين الرائي أو غيره كالصفة له وعلم حال النفوس بعد الموت وعلم الآخرة المعجلة والدنيا المؤجلة وعلم الإقبال والإعراض وعلم الوعيد والتقرير وعلم الاقتدار وهذا القدر كاف في هذا المنزل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Nine: Concerning the Knowledge of the Station of the People of Blame (الملامية) within the Muhammadan Presence (الحضرة المحمدية).\n\nThis is the station (مقام) of the Messenger of Allah, peace and blessings be upon him, and of Abu Bakr al-Siddiq, may Allah be pleased with him, and of those masters (Shuyukh) who realized it, such as Hamdun al-Qassar, Abu Sa'id al-Kharraz, and Abu Yazid al-Bistami. In our time, this included Abu al-Su'ud ibn al-Shibl, Abd al-Qadir al-Jili, Muhammad al-Awani, Salih al-Barbari, Abu Abd Allah al-Sharafi, Yusuf al-Shabarbili, Yusuf ibn Ta'azz, Ibn Ja'dun al-Hannawi, Muhammad ibn Qassum, Abu Abd Allah ibn al-Mujahid, Abd Allah ibn Takhamast, Abu Abd Allah al-Mahdawi, Abd Allah al-Qattan, and Abu al-Abbas al-Hassar. The book would be too constrained to mention all of them.\n\n> Whoever swears by creation (الخلق), no breaking of the oath is binding upon him, however much he breaks it.\n>\n> So I swear by Allah, Who settled the spirits (الأرواح) in the graves of the bodies (الجثث),\n>\n> And by the signs of guidance (آيات الهدى) from His Light (نوره), that He did not create creation (الخلق) in vain (عبث).\n>\n> If the matter is not as I have said, O my support, then do not worry.\n>\n> Failed is the intellect that promised the Law (الشرع) to uphold what it decreed, and then broke the promise.\n>\n> Do you think a person who sowed the seed, purified it, and ploughed the earth will reap the harvest?\n>\n> No, by the Reality of the Real (حق الحق), he does not possess it. The Spirit (الروح) informed him of this when He breathed.\n>\n> He deposited a single Spirit (روحا واحدا) within the spirits, between two spouses, through a marriage, and then dispersed.\n>\n> He concealed the secret (السر) within it out of jealousy for a time, and then revealed.\n>\n> Allah did not equalize in His judgments the wisdom between an elder and a youth.\n>\n> Then, if He brings a comprehensive judgment for both, it is due to a matter that has occurred.\n>\n> So the child was afflicted by old age, and the elder was afflicted by the grave.\n>\n> He was living, then dead, and then after death, he returned alive and was resurrected.\n\n### [That the Men of Allah are Three]\n\nKnow, may Allah grant you success, that the Men of Allah (رجال الله) are three, and there is no fourth. [The first are] men dominated by asceticism (الزهد), devotion (التبتل), and all praiseworthy pure acts (الأفعال الطاهرة المحمودة). They have also purified their inner selves (بواطنهم) from every blameworthy quality condemned by the Lawgiver. However, they see nothing beyond the works they perform, and they have no gnosis (معرفة) of the spiritual states (الأحوال), the stations (المقامات), the divinely bestowed (الوهبية اللدنية) sciences (العلوم), the secrets (الأسرار), the unveilings (الكشوف), or anything that others experience. These are called the Devotees (العباد). If someone comes to them asking for prayer (Du'a), one of them might rebuke him or say, \"What am I that I should pray for you? What is my standing?\" This is out of caution against conceit ('Ujb) and fear of the soul's pitfalls, lest hypocrisy (Riya') enter into it. If one of them engages in reading, his book is like *Al-Ri'aya* by Al-Muhasibi and similar works.\n\nThe second half [of men] are above these. They see all actions (الأفعال) as belonging entirely to Allah, and that they have no action whatsoever. Thus, hypocrisy (الرياء) has vanished from them completely. If you ask them about something that the People of the Path (أهل الطريق) fear, they say: <<أَ غَيْرَ الله تَدْعُونَ إِنْ كُنْتُمْ صادِقِينَ>> (Do you call upon other than Allah, if you are truthful?) [Q. 6:40] and they say: <<قُلِ الله ثُمَّ ذَرْهُمْ>> (Say: Allah, then leave them) [Q. 6:91]. They are like the Devotees in diligence, striving, piety (الورع), asceticism (الزهد), reliance (التوكل), and other qualities. However, they also see that there is something above their current states (الأحوال), stations (المقامات), sciences, secrets, unveilings, and miracles (الكرامات). Their aspirations (هممهم) are attached to achieving these. When they achieve something, they display it publicly through miracles, because they see none other than Allah. They are people of character (خلق) and chivalry (فتوة). This category is called the Sufis (الصوفية). However, when viewed in relation to the third class, they are considered reckless (أهل رعونة) and possessors of souls (أصحاب نفوس), and their disciples are likewise boastful (أصحاب دعاوى), challenging everyone among Allah's creation and displaying leadership over the Men of Allah.\n\nThe third category consists of men who do not add to the five obligatory prayers (الصلوات الخمس) except the regular supererogatory ones (الرواتب). They are not distinguished from the believers who perform Allah’s obligations by any extra state (حالة زائدة) by which they might be known. They walk in the markets and speak with people. No one among Allah’s creation sees one of them distinguished from the common people (العامة) by any extra act, whether obligatory or a customary Sunna. They are secluded with Allah, firmly rooted, never wavering from their servitude ('Ubūdiyya) to Allah for the blink of an eye. They know no taste for leadership (الرئاسة) due to the mastery of Lordship (الربوبية) over their hearts and their humility beneath it. Allah has informed them of the stations (المواطن) and what they deserve in terms of actions and states, and they treat every station according to what it deserves. They have veiled themselves from creation and hidden from them by the veil of the common people (ستر العوام). They are pure, sincere servants (عبيد خالصون مخلصون) to their Master, witnessing (مشاهدون) Him constantly in their eating, drinking, waking, sleeping, and conversation with people. They place causes (الأسباب) in their proper places and know their wisdom, so much so that you see them as if they were the ones who created everything—due to their affirmation of causes and their encouragement of them. They are in need of everything because everything, in their view, is a referent of the Name of Allah (مسمى الله). Yet, nothing is in need of them, because no attribute of Self-Sufficiency (الغني بالله) or Might (العزة به) appears upon them, nor is there anything that suggests they are among the select of the Divine Presence (الحضرة الإلهية) that would necessitate things being in need of them. They see that things are not in need of them, while they are in need of things, because Allah said to mankind: <<أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ>> (It is you who are the poor [in need] of Allah, while Allah is the Self-Sufficient, the Praiseworthy) [Q. 35:15]. Thus, even if they are self-sufficient through Allah, they do not display an attribute from which the Name that Allah described Himself with—the Name *Al-Ghani* (The Self-Sufficient)—can be applied to them. They have kept for themselves, outwardly and inwardly, the Name Allah called them: *Al-Faqir* (The Poor/Needy). They have learned from this that poverty (الفقر) is only directed toward Allah, the Self-Sufficient (الغني). They saw that people are in need of all established causes (الأسباب الموضوعة), which in the common view veil them from Allah. In reality, however, they are only in need of the One in whose hand is the fulfillment of their needs, which is Allah. They said: Here, Allah is named by everything that is truly needed, while Allah is not in need of anything. Therefore, this group is in need of things, and things are not in need of them, even though they are from things. Allah is not in need of anything, and everything is in need of Him. These are the Malamiyya (الملامية). They are the most elevated of men, and their disciples are the greatest of men, revolving through the stages of manhood (الرجولية). No one has attained the station of Chivalry (الفتوة) and Character (الخلق) with Allah, to the exclusion of others, except these. They are the ones who have attained all the stations (المنازل) and have seen that Allah has veiled Himself from creation in this world, and they are His select ones (الخواص). So, they veiled themselves from creation because of the veil of their Master. They are behind the veil, witnessing none in creation except their Master. When the Hereafter arrives and the Real (الحق) manifests (تجلى), these will appear there due to the manifestation of their Master. Their status in this world is unknown to the eye. The Devotees (العباد) are distinguished among the common people by their austerity (تقشفهم), their distance from people, their states, and their avoidance of physical association, and they have their reward. The Sufis (الصوفية) are distinguished among the common people by their claims (الدعاوي) and the breaking of customs (خرق العوائد), such as speaking about inner thoughts (الخواطر), answering prayers, and eating from the cosmos. They do not hesitate to display anything that leads people to know their proximity to Allah, for they claim to witness none but Allah, and a great knowledge has escaped them. This state they are in is rarely safe from Divine Deception (المكر) and Gradual Enticement (الاستدراج). The Malamiyya (الملامية) are not distinguished from any of Allah’s creation by anything; their state is unknown, the same as the common people. They were given this name for two reasons: First, it is applied to their disciples because they constantly blame (يلومون) themselves in relation to Allah and do not perform any work purely for themselves to rejoice in—this is a form of spiritual training (تربية), because rejoicing in works only occurs after acceptance, and this is hidden from the disciples. As for the elders (الأكابر), the name is applied to them because of the concealment of their states and their standing with Allah. They saw that people only engage in blaming actions (ذم الأفعال) and finding fault (اللؤم) among themselves because they do not see actions as coming from Allah, but rather from the one through whom they appear. Thus, they attach blame and fault to that person. If the veil were lifted and they saw that actions belong to Allah, blame would not be attached to the one through whom they appeared, and all actions, in this state, would become noble and good. Likewise, if this group’s standing with Allah were revealed to people, they would take them as deities. Since they veiled themselves from the common people by custom, the blame that applies to the common people is applied to them for what appears from them that necessitates it. It is as if the station (المكانة) blames them for not displaying its might and sovereignty. This is the reason for applying this term in the technical usage (الاصطلاح) to them. It is a specific path (طريقة مخصوصة) that not everyone knows, reserved for the People of Allah (أهل الله), and they have no distinguishing state among the common people.\n\n### [That the Wise Man among the Devotees is He Who Places Everything in Its Proper Station]\n\nKnow that the Wise Man (الحكيم) among the Devotees (العباد) is he who places everything in its proper station (منزلته) and does not exceed its level (مرتبته). He gives every possessor of a right his due right. He does not judge anything based on his own purpose (غرضه) or desire (هواه). He is not affected by incidental occurrences (الأعراض الطارئة). The Wise Man looks at this abode (الدّار) where Allah has settled him until an appointed time, and he looks at what Allah has legislated for him regarding conduct within it, without addition or omission. He proceeds according to the method that has been made clear to him, and he does not put down the scale (الميزان) that has been set for him in this station (الموطن). For if he puts it down, he will be ignorant of the measures (المقادير), and he will either lose in his weighing or give short measure (يطفف). Allah has condemned both states. Yet, the Exalted has established a specific state for giving short measure (التطفيف) in which it is praised. He gives short measure there knowingly, for it is the tipping of the scale (رجحان الميزان), and he is thanked by Allah for his short measure. If he knows this and the scale never leaves his hand, he will not miss anything of Allah’s wisdom (حكمة الله) in His creation, and by this, he becomes the Imam of his time.\n\nThe first thing he weighs in this station are the spiritual states (الأحوال). If his weighing of the state necessitates revealing the Real (الحق) to His servants and making creation aware of Him, he informs them—but only in the station where mentioning it does not lead to harming Allah and His Messenger. For Allah has described Himself as being harmed, saying: <<إِنَّ الَّذِينَ يُؤْذُونَ الله>> (Indeed, those who harm Allah) [Q. 33:57]. This is what necessitated the Name *Al-Sabur* (The Patient) and the Name *Al-Halim* (The Forbearing). The Messenger of Allah, peace and blessings be upon him, said: \"No person is more patient concerning harm than Allah.\" He has been lied to and reviled. Allah informed us of this in the sound report (الصحيح من الخبر) from the Messenger of Allah, peace and blessings be upon him, reporting from his Lord, Who said: \"My servant lied about Me, and he ought not to have done so. My servant reviled Me, and he ought not to have done so.\" This statement was only spoken by the Name *Al-Latif* (The Subtle/Gentle), and this subtlety earned Him the rebuke in the worldly abode (دار الدنيا) and brought about the awareness, so that the liar might retract his lie and the reviler his reviling, for this is the station of return and acceptance from Him. Although the Hereafter is also a station of return, it is not a station of acceptance.\n\nPart of the weighing is that the Wise Man does not mention Allah, nor His Messenger, nor anyone who holds status in the religion with Allah, in places that this Wise Man knows that mentioning Allah, His Messenger, or anyone whom Allah has cared for—such as the Companions among the Shi'a—will lead to slandering and reviling the one mentioned and causing harm to his right. In such a station, he does not mention him. Do you not see that the Prophet, peace and blessings be upon him, forbade us from traveling with the Qur'an (which is the Mus'haf) to the land of the enemy, because that leads to its exposure to insult and lack of reverence from those who do not believe in it, for they are its enemies? This is the station of the Malamiyya (الملامي) and no other. The entire Sacred Law (الشريعة) consists of the states of the Malamiyya.\n\n'A'isha, the Mother of the Believers, may Allah be pleased with her, was asked about the character (خلق) of the Messenger of Allah, peace and blessings be upon him, and she replied, may Allah be pleased with her: \"His character was the Qur'an.\" Then she recited the verse: <<وَإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ>> (And indeed, you are upon a magnificent character) [Q. 68:4]. The Divine Principle (الأصل الإلهي) upon which this group relies is what we mentioned: that the Real (الحق), glory be to Him, necessitates, due to His Majesty (جلاله), the veneration and grandeur (الكبرياء) that Divinity (الألوهة) deserves. Despite this, look at what the worldly station (موطن الدنيا) necessitated regarding the Real: the claim of Lordship (الربوبية) by the servants therein, and the contention with the Real concerning His Grandeur and Magnificence. Thus, Pharaoh said: <<أَنَا رَبُّكُمُ الْأَعْلى‏>> (I am your Lord, the Most High) [Q. 79:24], and he became arrogant and tyrannical. The reason for this is that the station necessitated that creation be veiled from Allah, for if He had manifested Himself to them in this world, the ruling of Divine Decree (القضاء والقدر)—which is Allah’s knowledge of what will proceed from and happen to His creation—would have been nullified. Thus, His veiling was a mercy to them and a preservation of them, for His manifestation (تجليه), glory be to Him, inherently imparts overwhelming power (القهر), and no claim [of lordship] can stand alongside it.\n\nSince Divinity (الألوهية) proceeds according to the ruling of the stations (المواطن), this Divine Principle is witnessed by the Malamiyya, as they are wise men (حكماء) and knowers ('Ulama'). They said: \"We are the branches of this Principle.\" For everything that exists in the world has a Divine Principle (أصل إلهي), but not every Divine Principle is praiseworthy when the servant is characterized by it. Grandeur (الكبرياء) is undoubtedly a Divine Principle, but if the servant characterizes himself with it and makes himself a branch of this Principle, and uses it inwardly, it is blameworthy in every respect, without dispute. However, if he uses it outwardly in a specific, designated place where he is permitted to use it as an outward form (صورة ظاهرة) without a spirit (روح) from him, then it is praiseworthy for the sake of the form itself.\n\nFor this reason, this group saw that the concealment of the breaking of customs (خرق العوائد) is obligatory upon the saints (الأولياء), just as their manifestation is obligatory upon the Prophets, because the Prophets are lawgivers (مشرعين) who have authority over souls, wealth, and families. There must be evidence indicating that the authority over these belongs to the Lord of the wealth, soul, and family. Since the Messenger is of the same species [as humans], his claim to what is not inherently his cannot be accepted without decisive proof and demonstration. But for the one who does not have legislation (التشريع) or authority over the world by establishing laws, why should he display the breaking of customs when Allah has enabled him to do so? [He should not display it] to make it a sign for himself of his proximity to Allah, not for people to know it from him. Whenever he displays it publicly, it is due to a recklessness (رعونة) that has overcome him, in which his soul has prevailed, and it is closer to Divine Deception (المكر) and Gradual Enticement (الاستدراج) than to a miracle (الكرامة).\n\nThe Malamiyya are the possessors of the sound knowledge (العلم الصحيح) concerning this. They are the highest class (الطبقة العليا) and the masters of the most excellent path (الطريقة المثلى) and the closest station (المكانة الزلفى) in the near shore (العدوة الدنيا) and the far shore (العدوة القصوى). They have the clear hand (اليد البيضاء) in the knowledge of the stations (المواطن), their inhabitants, and what they deserve to be treated with. They possess the knowledge of the scales (الموازين) and the rendering of rights. Salman al-Farsi was one of the greatest in stature among them, and he was one of the Companions of the Messenger of Allah, peace be upon him, in this station.\n\nThis is the Divine Station (المقام الإلهي) in the world. This station encompasses the following sciences: the Science of Wisdom (علم الحكمة), the Science of Standings (علم المواقف), the Science of Reckoning (علم الحساب), the Science of Conjecture (علم الظن), the Science of Neglect (علم الإهمال) and the difference between it and the Granting of Respite (الإمهال) sought by the Name *Al-Hakim* (The Wise), the Science of Precedence in Sins and Transgressions (علم السابقة إلى المعاصي والمخالفات), and whether the transgression of the transgressor can be the very essence of conformity (عين الموافقة). If so, does this transgression, in this capacity, bear fruit for him? And is his swiftness to perform it a means of proximity (قربة) to Allah? And must the one brought near (المقرب), if he rushes to commit the act that violates the prescribed ruling, be veiled from the prescribed ruling at the moment of performing the act, or is he not veiled? Or perhaps that transgressive act is a means of proximity, yet he may be one brought near without the act being a means of proximity? This is a great science (علم كبير) that few among the People of our Path know, for its depth is distant and its scale is subtle and precise—there is nothing subtler among the scales. Most of the People of Allah’s Path have neither witnessed nor seen it, and if it is mentioned to them, they deny it. What then do you think of the scholars of outward forms (علماء الرسوم)? And what do you think of the common people? As for the great philosophers (أكابر الحكماء من الفلاسفة), they denied it entirely. The reason for their denial, despite their merit and deep insight, is that they do not affirm specialization (الاختصاص) as we do; rather, all matters, in their view, are acquired through preparedness (الاستعداد). From this perspective, this science and others related to specialization were hidden from them.\n\nAmong the sciences of this station is the knowledge of the reason that led those who deny the physical and spiritual Hereafter to their denial, for they are undoubtedly two groups: one group denies the physical aspect of the Hereafter, and another denies it both spiritually and physically. Among its sciences is the knowledge of the states of death, why it returns, what its reality is, its slaughter, and its image in the world of similitude (عالم التمثيل) as a speckled ram, the place of its slaughter, and to whom its life is transferred when it is slaughtered. And the knowledge of the Theophany (التجلي) that causes the eclipse of the spiritual and physical stars (الكواكب). And the knowledge of the Presence of Gathering (حضرة الجمع) between the servant and the Lord. From this Presence arose those who affirm Union (الاتحاد) and Indwelling (الحلول), for it is a Presence of knowledge where feet slip, as the ambiguity within it is strong and cannot be resisted by composite proof. And the Science of Journeys (علم الأسفار), concerning which we have a treatise called *Al-Asfar 'an Nata'ij al-Asfar* (The Journeys Concerning the Results of the Journeys), which contains much Divine Knowledge and the relation of this Divine Ruling to it, and much Cosmological Knowledge and the relation of this Divine Ruling to it, both spiritually and physically.\n\nAlso among the sciences of this Divine Station is the knowledge of which Divine Name people will return to on the Day of Resurrection. And the knowledge of the reason why the knower asks others about what he does. And the reason why the knower denies what he knows when asked about the knowledge of it. And the knowledge of man's unveiling of what is in the soul of the angel, and whether it is from the science of concealment (علم الستر) or manifestation (علم الظهور), or if some of it is from the science of concealment in one respect and from the science of manifestation in another. And the Science of Propriety (علم الأدب), the Science of Emulation (علم الاقتداء), and the knowledge of the reason that necessitates preferring the world (الدنيا) over the Hereafter, despite the sorrows and physical and spiritual denials contained within it. And the Science of Vision (الرؤية) in the Hereafter, and whether it is permissible or impossible, whether it is the vision of the inner eye (بصيرة) or the physical eye (بصر). And whether the locus of vision is the reality of the seer or the customary, known eye. And whether vision is a ruling or an existential meaning. And whether it is the very essence of the seer or something else, like an attribute of him. And the knowledge of the state of souls after death. And the knowledge of the hastened Hereafter and the deferred World. And the Science of Turning Towards and Turning Away (علم الإقبال والإعراض). And the Science of Threat and Confirmation (علم الوعيد والتقرير). And the Science of Power (علم الاقتدار). This much suffices for this station. <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way) [Q. 33:4].",
    "ur": "باب نمبر تین سو نو: حضرت محمدیہ (الحضرة المحمدية) میں ملامیہ (الملامية) کے مقام کی معرفت میں۔\n\nیہ رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر صدیق رضی اللہ عنہ کا مقام ہے، اور ان شیوخ میں سے جنہیں یہ مقام حاصل ہوا، حمدون القصار، ابو سعید الخراز، ابو یزید بسطامی شامل ہیں۔ اور ہمارے زمانے میں ابو السعود بن الشبل، عبدالقادر جیلی، محمد الاوانی، صالح البربری، ابو عبداللہ الشرفی، یوسف الشبربلی، یوسف بن تعز، ابن جعدون الحناوی، محمد بن قسوم، ابو عبداللہ بن المجاہد، عبداللہ بن تاخمست، ابو عبداللہ المہدوی، عبداللہ القطان، اور ابو العباس الحصار تھے۔ اور کتاب ان سب کے ذکر سے تنگ ہے۔\n\n> جس نے بھی مخلوق کی قسم کھائی، تو\n>\n> اس پر حنث لازم نہیں، خواہ وہ کتنی ہی قسمیں کھائے۔\n>\n> پس میں اس اللہ کی قسم کھاتا ہوں جس نے\n>\n> روحوں کو جسموں کے ڈھانچوں میں بسایا۔\n>\n> اور اس کے نور سے ہدایت کی آیات کی قسم،\n>\n> کہ اس نے مخلوق کو بے کار پیدا نہیں کیا۔\n>\n> اور اگر معاملہ ایسا نہ ہو جیسا\n>\n> میں نے کہا، اے میرے سہارے، تو غم نہ کر۔\n>\n> وہ عقل ناکام ہو گئی جس نے شریعت سے عہد کیا\n>\n> کہ جو طے ہوا اسے باندھے، پھر توڑ دیا۔\n>\n> کیا تم دیکھتے ہو کہ کوئی شخص ایسی کھیتی کاٹے گا\n>\n> جس نے بیج بویا، صاف کیا اور ہل چلایا؟\n>\n> نہیں، اور حق (الحق) کی قسم، وہ اس کا مالک نہیں\n>\n> روح نے اسے بتایا جب اس نے پھونکا۔\n>\n> اس نے روحوں میں ایک ہی روح ودیعت کی\n>\n> دو جوڑوں کے درمیان نکاح کے ذریعے، پھر پھیلا دیا۔\n>\n> اس نے وہ راز جو اس میں تھا، غیرت کی وجہ سے\n>\n> ایک زمانے تک چھپائے رکھا، پھر ظاہر کر دیا۔\n>\n> اللہ نے اپنے احکام میں حکمت کے لحاظ سے\n>\n> شیخ اور نوجوان کے درمیان برابری نہیں کی۔\n>\n> پھر اگر وہ کوئی ایسا حکم لائے جو دونوں کو شامل ہو\n>\n> تو وہ کسی ایسے معاملے کے لیے ہو گا جو پیش آیا ہو۔\n>\n> گویا بچے پر بڑھاپا طاری ہو گیا\n>\n> اور شیخ قبر میں جا بسا۔\n>\n> وہ زندہ تھا، پھر مردہ ہوا، پھر\n>\n> موت کے بعد دوبارہ زندہ ہوا اور اٹھایا گیا۔\n\n### [کہ اللہ کے مرد تین طرح کے ہیں]\n\nجان لو، اللہ تمہیں توفیق دے، کہ اللہ کے مرد تین ہیں، چوتھا کوئی نہیں۔ پہلے وہ مرد ہیں جن پر زہد، دنیا سے کنارہ کشی (التبتل)، اور تمام قابل تعریف پاکیزہ افعال غالب ہیں، اور انہوں نے اپنے باطن کو بھی ہر اس مذموم صفت سے پاک کر لیا ہے جس کی شارع نے مذمت کی ہے۔ لیکن وہ ان اعمال سے بڑھ کر کسی چیز کو نہیں دیکھتے جو وہ کر رہے ہیں، اور انہیں احوال (الأحوال)، مقامات (المقامات)، علوم وہبیہ لدنیہ (العلوم الوهبية اللدنية)، اسرار (الأسرار)، کشوف (الکشوف)، یا کسی بھی ایسی چیز کی معرفت نہیں جو دوسروں کو حاصل ہوتی ہے۔ انہیں عابدین (العباد) کہا جاتا ہے۔ جب کوئی ان کے پاس دعا کی درخواست لے کر آتا ہے تو شاید ان میں سے کوئی اسے جھڑک دے یا کہے کہ میں کیا ہوں کہ تمہارے لیے دعا کروں، اور میری کیا حیثیت ہے؟ یہ اس لیے کہ وہ عجب (عجب) کے داخل ہونے سے ڈرتے ہیں اور نفس کی آفتوں سے خوف کھاتے ہیں کہ کہیں اس میں ریاء داخل نہ ہو جائے۔ اور اگر ان میں سے کوئی مطالعہ میں مشغول ہو تو اس کی کتابیں المحاسبی کی *الرعایۃ* جیسی یا اس کے ہم پلہ ہوتی ہیں۔\n\nاور دوسرا طبقہ ان سے اوپر ہے، جو تمام افعال کو اللہ کے لیے دیکھتے ہیں اور یہ سمجھتے ہیں کہ ان کا اپنا کوئی فعل نہیں ہے، لہٰذا ان سے ریاء مکمل طور پر ختم ہو جاتا ہے۔ اور اگر تم ان سے کسی ایسی چیز کے بارے میں پوچھو جس سے اہل طریق ڈرتے ہیں، تو وہ کہتے ہیں: \"أَ غَيْرَ الله تَدْعُونَ إِنْ كُنْتُمْ صادِقِينَ\" (کیا تم اللہ کے سوا کسی اور کو پکارتے ہو، اگر تم سچے ہو؟) اور وہ کہتے ہیں: \"قُلِ الله ثُمَّ ذَرْهُمْ\" (کہہ دو: اللہ، پھر انہیں چھوڑ دو)۔ وہ عابدین کی طرح جدوجہد، اجتہاد، پرہیزگاری، زہد اور توکل میں ہوتے ہیں۔ لیکن اس کے ساتھ ساتھ وہ یہ بھی دیکھتے ہیں کہ ان کے موجودہ احوال، مقامات، علوم، اسرار اور کشوف و کرامات سے بڑھ کر بھی کوئی چیز ہے۔ چنانچہ ان کی ہمتیں انہیں حاصل کرنے میں لگ جاتی ہیں۔ جب وہ ان میں سے کچھ حاصل کر لیتے ہیں تو عام لوگوں میں کرامات کے ذریعے ظاہر ہوتے ہیں، کیونکہ وہ اللہ کے سوا کسی کو نہیں دیکھتے۔ اور وہ اہل خلق اور فتوّت (جوانمردی) ہوتے ہیں۔ اس صنف کو صوفیہ (الصوفية) کہا جاتا ہے۔ اور تیسرے طبقے کے مقابلے میں، وہ رعونت والے اور نفس والے ہوتے ہیں، اور ان کے شاگرد بھی ایسے ہی ہوتے ہیں، جو دعوے کرنے والے ہوتے ہیں، اللہ کی مخلوق میں سے ہر ایک پر اپنی برتری ظاہر کرتے ہیں اور اللہ کے مردوں پر اپنی سرداری دکھاتے ہیں۔\n\nاور تیسرا طبقہ وہ مرد ہیں جو پانچ نمازوں کے علاوہ صرف رواتب (سنتیں) ادا کرتے ہیں۔ وہ اللہ کے فرائض ادا کرنے والے مومنین سے کسی اضافی حالت کے ذریعے ممتاز نہیں ہوتے جس سے وہ پہچانے جائیں۔ وہ بازاروں میں چلتے ہیں اور لوگوں سے بات کرتے ہیں۔ اللہ کی مخلوق میں سے کوئی بھی انہیں کسی اضافی عمل، خواہ وہ فرض ہو یا عام سنت، کے ذریعے عام لوگوں سے ممتاز نہیں دیکھتا۔ وہ اللہ کے ساتھ راسخ (مضبوطی سے قائم) ہوتے ہیں، ایک پلک جھپکنے کے لیے بھی اللہ کے ساتھ اپنی عبودیت سے نہیں ڈگمگاتے۔ وہ سرداری کا ذائقہ نہیں جانتے کیونکہ ربوبیت ان کے دلوں پر غالب ہوتی ہے اور وہ اس کے تحت ذلیل ہوتے ہیں۔ اللہ نے انہیں مقامات (المواطن) اور ان کے مستحق اعمال و احوال سے آگاہ کر دیا ہے۔ وہ ہر مقام کے ساتھ اس کے حق کے مطابق معاملہ کرتے ہیں۔ انہوں نے مخلوق سے پردہ کر لیا ہے اور عام لوگوں کے پردے (ستر العوام) میں چھپ گئے ہیں۔ وہ اپنے آقا کے خالص اور مخلص بندے ہیں، جو انہیں ہر وقت اپنے کھانے، پینے، جاگنے، سونے اور لوگوں کے ساتھ بات چیت میں دیکھتے رہتے ہیں۔ وہ اسباب (الأسباب) کو ان کے مقامات پر رکھتے ہیں اور ان کی حکمت کو جانتے ہیں، یہاں تک کہ تم انہیں دیکھو گے تو گویا وہ ہی ہیں جنہوں نے ہر چیز کو پیدا کیا ہے، اسباب کے اثبات اور ان پر ترغیب دینے کی وجہ سے جو تم ان میں دیکھتے ہو۔ وہ ہر چیز کے محتاج ہیں کیونکہ ہر چیز ان کے نزدیک اللہ کا مسمیٰ ہے، اور کوئی چیز ان کی محتاج نہیں ہے، کیونکہ ان پر غنی باللہ (الغني بالله) یا عزت باللہ (العزة به) کی کوئی ایسی صفت ظاہر نہیں ہوتی، نہ ہی وہ حضرت الٰہیہ (الحضرة الإلهية) کے خواص میں سے ہیں، جو چیزوں کو ان کا محتاج بنائے۔ وہ دیکھتے ہیں کہ چیزیں ان کی محتاج نہیں ہیں اور وہ ان کے محتاج ہیں، کیونکہ اللہ نے لوگوں سے فرمایا: \"أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ\" (تم سب اللہ کے محتاج ہو، اور اللہ ہی غنی، تعریف کے لائق ہے)۔ لہٰذا، اگرچہ وہ اللہ کے ذریعے غنی ہیں، لیکن وہ ایسی صفت کے ساتھ ظاہر نہیں ہوتے جس سے ان پر وہ نام لاگو ہو سکے جس سے اللہ نے خود کو متصف کیا ہے، یعنی اسم الغنی (الغني)، اور انہوں نے اپنے لیے ظاہراً اور باطناً وہ نام باقی رکھا ہے جو اللہ نے انہیں دیا ہے، یعنی فقیر (الفقير)۔ اور انہوں نے اس سے یہ جان لیا ہے کہ فقر صرف اللہ غنی (الغني) کی طرف ہوتا ہے۔ اور انہوں نے دیکھا کہ لوگ تمام مقرر کردہ اسباب کے محتاج ہیں، اور عام لوگوں میں ان اسباب نے انہیں اللہ سے پردہ کر دیا ہے۔ حالانکہ حقیقت میں وہ صرف اسی کے محتاج ہیں جس کے ہاتھ میں ان کی حاجتوں کا پورا کرنا ہے، اور وہ اللہ ہے۔ انہوں نے کہا: پس یہاں اللہ ہر اس چیز سے موسوم ہوا جس کی حقیقت میں حاجت ہے، اور اللہ کسی چیز کا محتاج نہیں ہے۔ اسی لیے یہ گروہ چیزوں کا محتاج ہوا اور چیزیں ان کی محتاج نہیں ہوئیں، حالانکہ وہ چیزوں میں سے ہیں۔ اور اللہ کسی چیز کا محتاج نہیں اور ہر چیز اس کی محتاج ہے۔ پس یہی ملامیہ (الملامية) ہیں، اور یہ سب سے اعلیٰ مرد ہیں، اور ان کے شاگرد سب سے بڑے مرد ہیں۔ وہ رجولیت کے مختلف ادوار میں پلٹتے رہتے ہیں۔ اور ان کے سوا کوئی نہیں جس نے فتوّت (جوانمردی) اور خلق (کردار) کا مقام اللہ کے ساتھ حاصل کیا ہو۔ پس یہی وہ لوگ ہیں جنہوں نے تمام منازل حاصل کیں اور دیکھا کہ اللہ دنیا میں مخلوق سے پردہ میں ہے، اور یہ اس کے خواص ہیں۔ لہٰذا انہوں نے اپنے آقا کے پردے کی وجہ سے مخلوق سے پردہ کر لیا۔ پس وہ پردے کے پیچھے سے ہیں، مخلوق میں اپنے آقا کے سوا کسی کا مشاہدہ نہیں کرتے۔ جب آخرت میں حق (الحق) کا ظہور ہو گا، تو یہ لوگ وہاں اپنے آقا کے ظہور کی وجہ سے ظاہر ہوں گے۔ پس دنیا میں ان کا مقام آنکھوں سے اوجھل ہے۔ عابدین عام لوگوں میں اپنے تقشف اور لوگوں سے دوری اور اپنے احوال کے ذریعے ممتاز ہوتے ہیں، اور جسمانی طور پر ان کی صحبت سے اجتناب کرتے ہیں، پس ان کے لیے جزا ہے۔ اور صوفیہ عام لوگوں میں دعووں اور عادات کو توڑنے (خرق العوائد) کے ذریعے ممتاز ہوتے ہیں، جیسے خواطر (دل کے خیالات) پر بات کرنا، دعا کا قبول ہونا، اور کائنات سے کھانا، اور ہر وہ خرق عادت جسے وہ ظاہر کرنے سے نہیں ہچکچاتے، جو لوگوں کو اللہ کے ساتھ ان کی قربت کا علم دے۔ کیونکہ وہ اپنے گمان میں اللہ کے سوا کسی کا مشاہدہ نہیں کرتے، اور ان سے ایک بڑا علم غائب ہو گیا ہے۔ اور یہ حال جس میں وہ ہیں، مکر (مکر) اور استدراج (استدراج) سے کم ہی محفوظ ہے۔ اور ملامیہ (الملامية) اللہ کی مخلوق میں سے کسی سے بھی کسی چیز میں ممتاز نہیں ہوتے۔ پس وہ ایسے ہیں جن کا حال عام لوگوں جیسا ہونے کی وجہ سے نامعلوم ہے۔ اور انہیں یہ نام دو وجوہات کی بنا پر دیا گیا: ایک تو ان کے شاگردوں پر لاگو ہوتا ہے، کیونکہ وہ اللہ کے معاملے میں ہمیشہ اپنے نفس کو ملامت کرتے رہتے ہیں اور اس کے لیے کوئی ایسا عمل خالص نہیں کرتے جس پر وہ خوش ہوں، یہ ان کی تربیت کے لیے ہے۔ کیونکہ اعمال پر خوشی قبولیت کے بعد ہی ہوتی ہے، اور یہ شاگردوں سے غائب ہے۔ اور جہاں تک اکابر کا تعلق ہے، تو یہ نام ان پر ان کے احوال اور اللہ کے ساتھ ان کے مقام کو چھپانے کی وجہ سے لاگو ہوتا ہے، جب انہوں نے دیکھا کہ لوگ افعال کی مذمت اور آپس میں ان میں ملامت میں اس لیے پڑے ہیں کہ انہوں نے افعال کو اللہ کی طرف سے نہیں دیکھا، بلکہ اسے اس کی طرف سے دیکھا جس کے ہاتھ پر وہ ظاہر ہوئے، پس انہوں نے ملامت اور مذمت کو اس سے جوڑ دیا۔ اگر پردہ اٹھ جاتا اور وہ دیکھتے کہ افعال اللہ کے لیے ہیں، تو ملامت اس شخص سے متعلق نہ ہوتی جس کے ہاتھ پر وہ ظاہر ہوئے، اور اس حالت میں تمام افعال ان کے نزدیک شریف اور اچھے ہو جاتے۔ اسی طرح، اگر اس گروہ کا اللہ کے ساتھ مقام لوگوں پر ظاہر ہو جاتا تو لوگ انہیں معبود بنا لیتے۔ پس جب انہوں نے عادت کے ذریعے عام لوگوں سے پردہ کر لیا، تو عام لوگوں میں ان پر وہی ملامت لاگو ہوئی جو عام لوگوں پر ان چیزوں کے ظاہر ہونے پر لاگو ہوتی ہے جو اس کا سبب بنتی ہیں۔ اور گویا مقام انہیں ملامت کرتا ہے کہ انہوں نے اپنی عزت اور سلطنت کو ظاہر نہیں کیا۔ پس یہ اس اصطلاح کے ان پر اطلاق کا سبب ہے، اور یہ ایک مخصوص طریقہ ہے جسے ہر کوئی نہیں جانتا، یہ اللہ والوں کے لیے مخصوص ہے، اور عام لوگوں میں ان کی کوئی ایسی حالت نہیں ہے جس سے وہ ممتاز ہوں۔\n\n### [کہ عابدین میں سے حکیم وہ ہے جو ہر چیز کو اس کے مقام پر رکھتا ہے]\n\nاور جان لو کہ عابدین میں سے حکیم (الحكيم) وہ ہے جو ہر چیز کو اس کے مقام پر رکھتا ہے اور اسے اس کے مرتبے سے تجاوز نہیں کرنے دیتا، اور ہر حقدار کو اس کا حق دیتا ہے۔ وہ کسی چیز کے بارے میں اپنی غرض یا اپنی خواہش سے حکم نہیں لگاتا۔ اس پر عارضی عوارض اثر انداز نہیں ہوتے۔ حکیم اس دنیا کو دیکھتا ہے جس میں اللہ نے اسے ایک مدت کے لیے بسایا ہے، اور اس میں تصرف کے لیے اللہ نے جو کچھ اس کے لیے مشروع کیا ہے، اسے دیکھتا ہے، نہ زیادہ نہ کم۔ پس وہ اسی طریقے پر چلتا ہے جو اس کے لیے واضح کر دیا گیا ہے، اور وہ اس ترازو کو اپنے ہاتھ سے نہیں چھوڑتا جو اس کے لیے اس مقام پر رکھا گیا ہے۔ کیونکہ اگر وہ اسے چھوڑ دے گا تو وہ مقداروں سے ناواقف ہو جائے گا، یا تو اپنے وزن میں نقصان کرے گا یا کم تولے گا (يطفف)۔ اور اللہ نے دونوں حالتوں کی مذمت کی ہے۔ اور اللہ تعالیٰ نے کم تولنے (التطفيف) کے لیے ایک خاص حالت مقرر کی ہے جس میں کم تولنے کی تعریف کی جاتی ہے، پس وہ وہاں علم کے ساتھ کم تولتا ہے، کیونکہ یہ ترازو کا جھکاؤ (رجحان الميزان) ہے، اور وہ اپنے اس کم تولنے پر اللہ کے ہاں شکور ہوتا ہے۔ پس جب وہ یہ جان لے اور ترازو اس کے ہاتھ سے نہ چھوٹے، تو وہ اللہ کی حکمت میں اس کی مخلوق میں سے کسی چیز کو نہیں چھوڑتا، اور اس طرح وہ اپنے وقت کا امام ہوتا ہے۔\n\nسب سے پہلے وہ اس مقام پر احوال (الأحوال) کو تولتا ہے۔ اگر اس کا حال تولنے سے یہ تقاضا ہو کہ وہ حق (الحق) کو اپنے بندوں پر ظاہر کرے اور مخلوق کو اس کی معرفت کرائے، تو وہ انہیں معرفت کراتا ہے، لیکن صرف اس مقام پر جہاں اس کا ذکر اللہ اور اس کے رسول کو ایذا (أذى) نہ پہنچائے۔ کیونکہ اللہ نے خود کو ایذا پہنچائے جانے سے متصف کیا ہے، چنانچہ فرمایا: \"إِنَّ الَّذِينَ يُؤْذُونَ الله\" (بے شک وہ لوگ جو اللہ کو ایذا دیتے ہیں)۔ اور اسی چیز نے اسے اسم الصبور (صبر کرنے والا) اور اسم الحلیم (بردبار) کا تقاضا کیا۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"کوئی شخص اللہ سے زیادہ ایذا پر صبر کرنے والا نہیں ہے۔\"\n\nاور جھوٹ بولا گیا اور گالی دی گئی: اللہ نے اس کی خبر رسول اللہ صلی اللہ علیہ وسلم سے صحیح حدیث میں اپنے رب سے دی، چنانچہ فرمایا: \"ابن آدم نے مجھے جھٹلایا، اور اسے ایسا نہیں کرنا چاہیے تھا، اور ابن آدم نے مجھے گالی دی، اور اسے ایسا نہیں کرنا چاہیے تھا\"۔ اور یہ بات اسم اللطیف (لطیف نام) نے کہی، اور اسی لیے اس لطف نے اسے دنیا کے گھر میں عتاب میں شامل کیا، اور اس کے ذریعے تعریف واقع ہوئی تاکہ جھٹلانے والا اپنے جھٹلانے سے باز آ جائے اور گالی دینے والا اپنی گالی سے باز آ جائے، کیونکہ یہ رجوع اور قبولیت کا مقام ہے۔ اور اگرچہ آخرت بھی رجوع کا مقام ہے، لیکن وہ قبولیت کا مقام نہیں ہے۔\n\nاور ترازو میں سے یہ بھی ہے کہ حکیم اللہ کا ذکر، یا اس کے رسول کا ذکر، یا دین میں اللہ کے ہاں قدر رکھنے والے کسی شخص کا ذکر ان جگہوں پر نہ کرے جنہیں یہ حکیم جانتا ہے کہ اگر وہاں اللہ یا اس کے رسول یا کسی ایسے شخص کا ذکر کیا جائے جس پر اللہ نے توجہ دی ہو، جیسے شیعہ کے ہاں صحابہ، تو یہ مذکورہ شخص کی برائی کرنے اور اسے گالی دینے اور اس کے حق میں ایذا داخل کرنے کا سبب بنے گا۔ پس ایسے مقام پر وہ اس کا ذکر نہیں کرتا۔ کیا تم نہیں دیکھتے کہ نبی صلی اللہ علیہ وسلم نے ہمیں قرآن (جو کہ مصحف ہے) لے کر دشمن کی سرزمین کی طرف سفر کرنے سے منع فرمایا، کیونکہ اس سے اس کی بے عزتی اور بے حرمتی کا خطرہ ہوتا ہے، جو ان لوگوں کی طرف سے ہو سکتا ہے جو اس پر ایمان نہیں رکھتے، کیونکہ وہ اس کے دشمن ہیں۔ اور یہ مقام صرف ملامی (الملامي) کا ہے۔ پس پوری شریعت ہی ملامیہ (الملامية) کے احوال ہیں۔\n\nام المؤمنین عائشہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کے اخلاق کے بارے میں پوچھا گیا تو انہوں نے فرمایا: \"ان کا خلق قرآن تھا\"۔ پھر انہوں نے اللہ تعالیٰ کا یہ قول پڑھا: \"وَإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ\" (اور بے شک آپ عظیم اخلاق پر فائز ہیں)۔ پس وہ الٰہی اصل (الأصل الإلهي) جس پر اس گروہ نے بھروسہ کیا، وہ وہی ہے جو ہم نے ذکر کیا کہ حق سبحانہ (الحق سبحانه) کے جلال کے لیے وہ تعظیم اور کبریائی واجب ہے جس کی الوہیت مستحق ہے۔ اس کے باوجود، دنیا کے مقام کو دیکھو کہ اس نے حق کے حق میں کیا تقاضا کیا کہ بندے اس میں ربوبیت کا دعویٰ کریں اور حق کے ساتھ اس کی کبریائی اور عظمت میں جھگڑا کریں، چنانچہ فرعون نے کہا: \"أَنَا رَبُّكُمُ الْأَعْلى‏\" (میں تمہارا سب سے بڑا رب ہوں) اور تکبر اور سرکشی کی۔\n\nاور اس کا سبب یہ ہے کہ مقام نے یہ تقاضا کیا کہ مخلوق اللہ سے پردہ میں رہے، کیونکہ اگر وہ دنیا میں انہیں اپنا مشاہدہ کرا دیتا تو قضا و قدر (القضاء والقدر) کا حکم باطل ہو جاتا، جو کہ مخلوق کے بارے میں اللہ کا علم ہے کہ ان سے اور ان میں کیا ہو گا۔ پس اس کا پردہ ان کے لیے رحمت اور ان پر بقا کا سبب تھا۔ کیونکہ اس کی تجلی (التجلی) اپنی ذات سے قہر عطا کرتی ہے، لہٰذا اس کے ساتھ دعویٰ ممکن نہیں رہتا۔ چونکہ الوہیت مقامات کے حکم کے مطابق چلتی ہے، اس لیے یہ الٰہی اصل ملامیہ (الملامية) کے مشاہدے میں ہے، کیونکہ وہ حکیم اور عالم ہیں۔ انہوں نے کہا: ہم اس اصل کی شاخیں (فروع) ہیں، کیونکہ عالم میں ہونے والی ہر چیز کی ایک الٰہی اصل ہوتی ہے، لیکن ہر الٰہی اصل بندے کے حق میں جب وہ اس سے متصف ہو تو قابل تعریف نہیں ہوتی۔ بے شک کبریائی (الکبریاء) بلاشبہ ایک الٰہی اصل ہے، لیکن اگر بندہ اس سے متصف ہو جائے اور خود کو اس اصل کی شاخ بنا لے اور اسے باطنی طور پر استعمال کرے، تو وہ بلا اختلاف ہر لحاظ سے مذموم ہے۔ لیکن اگر وہ اسے ظاہری طور پر ایک خاص مقام پر استعمال کرے جو اس کے لیے مقرر کیا گیا ہو اور اسے اس میں ظاہری صورت کے طور پر استعمال کرنے کی اجازت ہو جس میں اس کی طرف سے کوئی روح نہ ہو، تو وہ صرف اس صورت کی وجہ سے قابل تعریف ہو گا۔\n\nاور اسی لیے اس گروہ نے دیکھا کہ خرق عادات (خرق العوائد) کو اولیاء (الأولياء) پر چھپانا واجب ہے، جیسا کہ انبیاء (الأنبياء) پر انہیں ظاہر کرنا واجب ہے، کیونکہ وہ شارع ہیں، انہیں نفوس، اموال اور اہل پر حکم چلانے کا اختیار ہے۔ لہٰذا ایک ایسی دلیل کا ہونا ضروری ہے جو یہ بتائے کہ ان چیزوں پر حکم چلانا مال، نفس اور اہل کے رب کا ہے۔ کیونکہ رسول اسی جنس سے ہے، لہٰذا اس کا دعویٰ جو اس کی اصل نہیں ہے، بغیر کسی قطعی دلیل اور برہان کے تسلیم نہیں کیا جائے گا۔ اور وہ شخص جسے تشریع (قانون سازی) کا اختیار نہیں ہے اور نہ ہی احکام وضع کر کے عالم پر حکم چلانے کا اختیار ہے، وہ خرق عادات کو کیوں ظاہر کرے، جب اللہ نے اسے اس کی قدرت دی ہے؟ تاکہ وہ اسے اللہ کے ہاں اپنی قربت کی دلیل بنائے، نہ کہ اس لیے کہ لوگ اس سے یہ جانیں۔ پس جب بھی وہ انہیں عام لوگوں میں ظاہر کرتا ہے، تو یہ اس رعونت کی وجہ سے ہوتا ہے جو اس میں پیدا ہو گئی ہے اور اس کے نفس نے اس پر غلبہ پا لیا ہے، لہٰذا یہ کرامت سے زیادہ مکر (مکر) اور استدراج (استدراج) کے قریب ہے۔ پس ملامیہ (الملامية) اس معاملے میں صحیح علم والے ہیں، وہ اعلیٰ طبقہ ہیں اور بہترین طریقہ (الطريقة المثلى) کے سردار ہیں، اور دنیا اور آخرت میں قربت (الزلفى) کے مقام پر فائز ہیں۔ اور انہیں مقامات (المواطن) اور ان کے اہل اور ان کے ساتھ کیے جانے والے سلوک کے علم میں ید بیضا (کامل مہارت) حاصل ہے۔ اور سلمان فارسی رضی اللہ عنہ ان میں سے عظیم قدر والے تھے، اور وہ رسول اللہ صلی اللہ علیہ وسلم کے اصحاب میں سے اس مقام پر تھے۔\n\nاور یہ مقام دنیا میں الٰہی مقام (المقام الإلهي) ہے۔ اور یہ منزل علوم میں سے اس علم کو شامل ہے، جو علم حکمت (علم الحكمة) ہے۔ اور یہ علم المواقف (علم المواقف)، علم الحساب (علم الحساب)، علم الظن (علم الظن)، علم الإهمال (علم الإهمال) اور اس کے اور امہال (الإمهال) کے درمیان فرق کو شامل کرتا ہے، جسے اسم الحکیم (الحكيم) طلب کرتا ہے۔ اور علم السابقة إلى المعاصی والمخالفات (گناہوں اور خلاف ورزیوں کی طرف سبقت کا علم)، اور کیا مخالف انسان کے لیے مخالفت عین موافقت ہو سکتی ہے؟ اور اگر ہو، تو کیا یہ مخالفت اس حیثیت سے اس کے لیے ثمر آور ہو گی؟ اور کیا اس کا اس کے فعل کی طرف تیزی سے بڑھنا اللہ کے ہاں قربت کا سبب ہو گا؟ اور کیا مقرب کو ضرور پردہ ہو گا، اگرچہ وہ مشروع حکم کے مخالف فعل کے ارتکاب کے وقت اس کی طرف تیزی سے بڑھے، یا اسے پردہ نہیں ہو گا؟ یا یہ کہ وہ مخالف فعل قربت کا سبب ہو، لیکن وہ مقرب ہو، نہ کہ قربت؟ اور یہ ایک بڑا علم ہے جسے ہمارے طریق کے اہل میں سے بہت کم لوگ جانتے ہیں، کیونکہ اس کی گہرائی بہت دور ہے اور اس کا ترازو پوشیدہ اور نازک ہے، ترازوؤں میں اس سے زیادہ پوشیدہ کوئی نہیں ہے۔ اور اللہ کے طریق کے اکثر اہل نے اسے نہ دیکھا ہے اور نہ ہی اس کا مشاہدہ کیا ہے۔ اور اگر انہیں بتایا جائے تو وہ اس کا انکار کرتے ہیں، تو تمہارا علماء رسوم کے بارے میں کیا خیال ہے؟ اور تمہارا عام لوگوں کے بارے میں کیا خیال ہے؟ اور جہاں تک فلاسفہ کے اکابر حکماء کا تعلق ہے، تو انہوں نے مکمل طور پر اس کا انکار کر دیا ہے۔ اور ان کے انکار کا سبب، ان کی فضیلت اور گہری بصیرت کے باوجود، یہ ہے کہ وہ اختصاص (الاختصاص) کے قائل نہیں ہیں جیسا کہ ہم کہتے ہیں، بلکہ ان کے نزدیک تمام امور استعداد (الاستعداد) کے ذریعے حاصل ہوتے ہیں۔ اسی وجہ سے یہ علم اور دیگر علوم جو اختصاص سے متعلق ہیں، ان پر پوشیدہ رہے۔\n\nاور اس الٰہی منزل کے علوم میں سے یہ بھی ہے کہ اس سبب کا علم جس نے قائلین کو آخرت حسی اور معنوی کے انکار پر مجبور کیا، کیونکہ وہ بلاشبہ دو گروہ ہیں: ایک گروہ آخرت کے حسی پہلو کا انکار کرتا ہے اور دوسرا معنوی اور حسی دونوں کا انکار کرتا ہے۔ اور اس کے علوم میں سے موت کے احوال کا علم ہے، اور وہ کیوں لوٹتی ہے، اور اس کی حقیقت کیا ہے، اور عالم تمثیل میں اس کا ذبح ہونا اور اس کی صورت ایک سفید و سیاہ مینڈھے کی شکل میں، اور اس کے ذبح ہونے کی جگہ، اور جب وہ ذبح ہو جائے تو اس کی حیات کس کی طرف منتقل ہوتی ہے۔ اور تجلی (التجلی) کا علم جو معنوی اور حسی ستاروں کے گہن کا سبب بنتا ہے۔ اور عبد اور رب کے درمیان جمع (الجمع) کی حضرت (حضرة الجمع) کا علم، اور اسی حضرت سے اتحاد (الاتحاد) اور حلول (الحلول) کے قائلین ظاہر ہوئے، کیونکہ یہ علم کی ایک ایسی حضرت ہے جہاں قدم ڈگمگا جاتے ہیں، کیونکہ اس میں شبہہ قوی ہے جس کا مقابلہ کوئی مرکب دلیل نہیں کر سکتی۔ اور اسفار (الأسفار) کا علم، اور اس بارے میں ہمارا ایک حصہ ہے جسے ہم نے *الأسفار عن نتائج الأسفار* (سفروں کے نتائج سے پردہ اٹھانا) نام دیا ہے، جو الٰہی علم اور اس الٰہی حکم کی اس سے نسبت، اور کونی علم اور اس الٰہی حکم کی معنوی اور حسی نسبت کے بارے میں بہت کچھ شامل ہے۔ اور اس الٰہی منزل کے علوم میں سے یہ بھی ہے کہ قیامت کے دن لوگ کس الٰہی نام کی طرف رجوع کریں گے۔ اور اس سبب کا علم جس کی وجہ سے عالم دوسرے سے اس کے عمل کے بارے میں پوچھتا ہے۔ اور عالم کے اپنے علم کا انکار کرنے کا سبب جب اس سے اس علم کے بارے میں پوچھا جائے۔ اور انسان کا فرشتہ کے نفس میں موجود چیز کو کشف کرنے کا علم، اور کیا یہ علم ستر (پردہ) میں سے ہے یا ظہور (ظاہر) میں سے، یا اس میں سے کچھ ستر کے علم میں سے ہوتا ہے اور کچھ ظہور کے علم میں سے۔ اور علم ادب (علم الأدب)، اور علم اقتداء (علم الاقتداء)، اور اس سبب کا علم جو دنیا کو آخرت پر ترجیح دینے کا سبب بنتا ہے، باوجود اس کے کہ اس میں حسی اور معنوی غم اور انکار ہیں۔ اور دار آخرت میں رؤیت (دیدار) کا علم، اور کیا یہ جائز ہے یا محال، خواہ وہ بصیرت کی رؤیت ہو یا بصر (آنکھ) کی رؤیت۔ اور کیا رؤیت کا محل رائی (دیکھنے والے) کی حقیقت ہے یا عام معروف آنکھ۔ اور کیا رؤیت ایک حکم ہے یا ایک وجودی معنی؟ اور کیا یہ رائی کی عین ذات ہے یا اس کی صفت کی طرح کوئی اور چیز؟ اور موت کے بعد نفوس کے حال کا علم۔ اور آخرت معجلہ (جلدی آنے والی) اور دنیا مؤجلہ (دیر سے آنے والی) کا علم۔ اور علم اقبال (توجہ) اور اعراض (روگردانی)۔ اور علم وعید (دھمکی) اور تقریر (تصدیق)۔ اور علم اقتدار (قدرت)۔ اور یہ مقدار اس منزل کے لیے کافی ہے۔ \"وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راہ دکھاتا ہے)۔",
    "fa": "«باب سیصد و نهم: در معرفت منزل ملامیه از حضرت محمدیه (الحضرة المحمدية)»\n\nاین مقام رسول خدا (صلی الله علیه و سلم) و ابوبکر صدیق (رضی الله عنه) است و از مشایخی که به آن تحقق یافتند، حمدون قصار، ابوسعید خراز و ابویزید بسطامی بودند. و در زمان ما ابوالسعود بن الشبل، عبدالقادر جیلی، محمد الاوانی، صالح البربری، ابوعبدالله الشرفی، یوسف الشبربلی، یوسف بن تعز، ابن جعدون الحناوی، محمد بن قسوم، ابوعبدالله بن المجاهد، عبدالله بن تاخمست، ابوعبدالله المهدوی، عبدالله القطان و ابوالعباس الحصار بودند، و کتاب از ذکر همه آنان تنگ می‌آید.\n\n> كل من أقسم بالخلق فما *** يلزم الحنث له مهما حنث‏\n> هر کس به خلق سوگند خورد، *** هرگز حنث (شکستن سوگند) بر او لازم نمی‌شود.\n\n> فأنا أقسم بالله الذي *** أسكن الأرواح أجداث الجثث‏\n> پس من سوگند می‌خورم به خدایی که *** ارواح را در گورهای جسدها جای داد.\n\n> وبآيات الهدى من نوره *** إنه ما خلق الخلق عبث‏\n> و به آیات هدایت از نور او، *** که او خلق را بیهوده نیافرید.\n\n> وإذا لم يكن الأمر كما *** قلت يا سندي لا تكترث‏\n> و اگر امر چنان که گفتم نبود، *** ای تکیه‌گاه من، باکی نداشته باش.\n\n> خاب عقل عاهد الشرع على *** عقد ما قرره ثم نكث‏\n> ناامید شد عقلی که با شریعت عهد بست *** بر آنچه مقرر کرد و سپس آن را شکست.\n\n> أ ترى يحصد شخص زرع من *** بذر الحب ونقي وحرث‏\n> آیا می‌بینی کسی که زراعت می‌کند، درو کند *** از بذری که کاشته، پاک کرده و شخم زده است؟\n\n> لا وحق الحق ما يملكه *** أخبر الروح به حين نفث‏\n> نه، به حق (الحق) سوگند، مالک آن نیست، *** روح هنگام دمیدن، او را از آن آگاه ساخت.\n\n> أودع الأرواح روحا واحدا *** بين زوجين نكاحا ثم بث‏\n> یک روح واحد را در ارواح به ودیعه نهاد، *** میان دو زوج، به ازدواج، سپس پراکنده ساخت.\n\n> كتم السر الذي فيه له *** غيرة منه زمانا ثم بث‏\n> سری را که در آن بود، از روی *** غیرت، زمانی پنهان داشت و سپس آشکار کرد.\n\n> لم يسو الله في أحكامه *** حكمة ما بين شيخ وحدث‏\n> خداوند در احکام خود، حکمت را *** میان پیر و جوان یکسان قرار نداد.\n\n> ثم إن جاء بحكم جامع *** لهما كان لأمر قد حدث‏\n> سپس اگر حکمی جامع برای *** هر دو آمد، به خاطر امری بود که رخ داده بود.\n\n> فكان بالطفل قد حل به *** هرم والشيخ قد حل الجدث‏\n> پس بر کودک پیری *** و بر شیخ گور فرود آمد.\n\n> كان حيا ثم ميتا ثم من *** بعد موت عاد حيا فبعث‏\n> زنده بود، سپس مرده، و سپس از *** پس مرگ دوباره زنده شد و برانگیخته گشت.\n\n### [اینکه مردان خدا سه دسته‌اند]\n\nبدان، خداوند تو را توفیق دهد، که مردان خدا سه دسته‌اند و چهارمی ندارند. دسته‌ای که زهد، انقطاع (تبتل) و همه افعال پاک و ستوده بر آنان غالب شده است، و همچنین باطن خود را از هر صفت نکوهیده‌ای که شارع آن را مذمت کرده، پاک نموده‌اند. با این حال، چیزی فراتر از این اعمالی که بر آن هستند نمی‌بینند و معرفتی به احوال، مقامات، علوم وهبی لدنی، اسرار، کشوف (الکشف) و هیچ یک از آنچه دیگران می‌یابند، ندارند. به اینان «عبّاد» (عابدان) گفته می‌شود. اینان اگر کسی نزدشان آید و از آنان طلب دعا کند، ممکن است یکی از آنان او را برنجاند یا بگوید: من چه کسی هستم که برای تو دعا کنم و منزلت من چیست؟ این کار را از ترس اینکه عُجب (خودپسندی) به آنان راه یابد و از بیم فتنه‌های نفس انجام می‌دهند تا ریا در آن داخل نشود. اگر یکی از آنان به مطالعه مشغول باشد، کتاب او مانند «الرعایة» محاسبی و نظایر آن است.\n\nو دسته دوم بالاتر از اینان هستند. آنان همه افعال را از آنِ خدا می‌بینند و اینکه اصلاً فعلی از خود ندارند، پس ریا به طور کلی از آنان زائل شده است. اگر در مورد چیزی که اهل طریقت از آن پرهیز می‌کنند، از آنان بپرسی، می‌گویند: «آیا غیر خدا را می‌خوانید اگر راستگویید؟» (أَ غَيْرَ الله تَدْعُونَ إِنْ كُنْتُمْ صادِقِينَ) و می‌گویند: «بگو: خدا، سپس رهایشان کن» (قُلِ الله ثُمَّ ذَرْهُمْ). آنان در جدیت، کوشش، ورع، زهد، توکل و غیره مانند عابدان هستند، با این تفاوت که در عین حال می‌بینند که چیزی فراتر از احوال، مقامات، علوم، اسرار، کشوف (الکشف) و کرامات کنونی‌شان وجود دارد. پس همت‌هایشان به سوی دستیابی به آن‌ها معطوف می‌شود. هنگامی که چیزی از آن را به دست می‌آورند، آن را در میان مردم به صورت کرامات آشکار می‌سازند، زیرا غیر خدا را نمی‌بینند و اهل خُلق و فتوّت هستند. این صنف «صوفیه» نامیده می‌شوند. آنان در مقایسه با طبقه سوم، اهل رعونت و صاحبان نفوس هستند و شاگردانشان نیز مانند خودشان، اهل ادعا هستند؛ بر هر کس از خلق خدا می‌تازند و بر مردان خدا ریاست می‌طلبند.\n\nو صنف سوم مردانی هستند که بر پنج نماز واجب، چیزی جز نوافل (رواتب) نمی‌افزایند. آنان با هیچ حالت اضافه‌ای که با آن شناخته شوند، از مؤمنانی که فرائض الهی را ادا می‌کنند، متمایز نیستند. در بازارها راه می‌روند و با مردم سخن می‌گویند. هیچ کس از خلق خدا، یکی از آنان را نمی‌بیند که با عمل واجبی یا سنت متداولی در میان مردم، از عوام متمایز باشد. آنان با خدا خلوت کرده‌اند، راسخ و استوارند و یک چشم بر هم زدن از عبودیت (بندگی) خود نسبت به خدا متزلزل نمی‌شوند و طعم ریاست را نمی‌شناسند، زیرا ربوبیت (پروردگاری) بر قلب‌هایشان مستولی شده و در ذلت تحت آن قرار دارند. خداوند آنان را از مواطن (جایگاه‌ها) و آنچه از اعمال و احوال که هر موطن سزاوار آن است، آگاه ساخته است و آنان با هر موطنی به آنچه سزاوار آن است، رفتار می‌کنند. آنان از خلق محجوب شده‌اند و با پوشش عوام از ایشان پنهان گشته‌اند، زیرا بندگانی خالص و مخلص برای سرور خود هستند و او را پیوسته در خوردن، نوشیدن، بیداری، خواب و گفتگوی خود با مردم مشاهده می‌کنند. اسباب را در جایگاه خود قرار می‌دهند و حکمت آن‌ها را می‌شناسند، تا جایی که از شدت اثبات اسباب و ترغیب به آن‌ها، گویی آنان همان کسی هستند که همه چیز را آفریده است. آنان به هر چیزی نیازمندند، زیرا هر چیزی نزد آنان مسمای خداست، و هیچ چیز به آنان نیازمند نیست، زیرا هیچ صفتی از غنای (بی‌نیازی) به خدا، یا عزت به او، یا اینکه آنان از خواص حضرت الهی (الحضرة الإلهية) هستند، بر آنان ظاهر نشده است که موجب نیازمندی اشیاء به ایشان شود. آنان می‌بینند که اشیاء به ایشان نیازمند نیستند و ایشان به اشیاء نیازمندند، زیرا خداوند به مردم فرموده است: «شما نیازمندان به سوی خدا هستید و خداست که بی‌نیاز و ستوده است» (أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ). پس آنان اگرچه به خدا بی‌نیاز شده‌اند، اما با صفتی ظاهر نمی‌شوند که بتوان از آن، نامی را که خداوند خود را به آن وصف کرده است، یعنی اسم «غنی»، بر آنان اطلاق کرد. و برای خود، ظاهراً و باطناً، نامی را که خدا بر آنان نهاده است، یعنی «فقیر»، باقی گذاشته‌اند. آنان از این دریافتند که فقر جز به سوی خدای غنی نیست. و دیدند که مردم به همه اسباب وضع شده نیازمندند و این اسباب در میان عوام، آنان را از خدا محجوب کرده است، در حالی که در حقیقت امر، جز به کسی که برآوردن نیازهایشان به دست اوست، یعنی خدا، نیازمند نیستند. گفتند: پس در اینجا، خداوند به هر آنچه در حقیقت به آن نیازمند است، نامیده شده است، و خداوند به هیچ چیز نیازمند نیست. به همین دلیل، این طایفه به اشیاء نیازمند شدند و اشیاء به آنان نیازمند نشدند، در حالی که آنان خود از اشیاء هستند. و خداوند به هیچ چیز نیازمند نیست و هر چیزی به او نیازمند است. پس اینان همان ملامیه هستند و آنان والاترین مردانند و شاگردانشان بزرگترین مردانند که در اطوار رجولیت (مردانگی) دگرگون می‌شوند. و جز اینان، کسی نیست که مقام فتوّت و خُلق با خدا را به تنهایی حائز شده باشد. پس آنان کسانی هستند که همه منازل را به دست آورده‌اند و دیده‌اند که خداوند در دنیا از خلق محجوب شده است و آنان خواص او هستند، پس به خاطر حجاب سرورشان، از خلق محجوب گشته‌اند. از پشت حجاب، در خلق جز سرور خود را مشاهده نمی‌کنند. پس هنگامی که در سرای آخرت، حق (الحق) تجلی (التجلی) کند، اینان نیز به دلیل ظهور سرورشان، در آنجا ظاهر می‌شوند. پس جایگاه آنان در دنیا ناشناخته است. عابدان نزد عوام به دلیل تقشف و دوری از مردم و احوالشان و پرهیز از معاشرت جسمانی، متمایز هستند و برایشان پاداش است. صوفیه نزد عوام به دلیل ادعاها و خرق عادات، از قبیل سخن گفتن از خواطر، اجابت دعا، و خوردن از کائنات، و هر خرق عادتی که از آشکار کردن آن ابایی ندارند و منجر به شناخت مردم از نزدیکی آنان به خدا می‌شود، متمایز هستند، زیرا به گمان خود جز خدا را مشاهده نمی‌کنند، در حالی که علم بزرگی از آنان غایب است و این حالی که در آن هستند، از مکر و استدراج (فریب تدریجی) کمتر در امان است. اما ملامیه با هیچ چیز از خلق خدا متمایز نیستند، پس آنان ناشناخته‌اند و حالشان حال عوام است. و به دو دلیل به این نام اختصاص یافته‌اند: اول اینکه بر شاگردانشان اطلاق می‌شود، زیرا آنان پیوسته نفس خود را در راه خدا ملامت می‌کنند و عملی را که به آن شاد شوند، برای نفس خالص نمی‌کنند، این تربیتی برای آنان است، زیرا شادی به اعمال جز پس از قبول نیست و این از شاگردان غایب است. و اما بر بزرگانشان به دلیل پوشاندن احوال و جایگاهشان نزد خدا اطلاق می‌شود، زیرا دیدند که مردم تنها به این دلیل در مذمت افعال و ملامت یکدیگر در آن واقع شده‌اند که افعال را از خدا ندیده‌اند، بلکه آن‌ها را از کسی می‌بینند که فعل بر دست او ظاهر شده است، پس ملامت و مذمت را به آن نسبت دادند. اگر پرده برداشته می‌شد و می‌دیدند که افعال از آنِ خداست، ملامت به کسی که فعل بر دست او ظاهر شده، تعلق نمی‌گرفت و در این حالت، همه افعال نزد آنان شریف و نیکو می‌شد. همچنین اگر جایگاه این طایفه نزد خدا برای مردم آشکار می‌شد، آنان را به خدایی می‌گرفتند. پس چون با عادت از عوام محجوب شدند، آنچه بر عوام از ملامت در مورد آنچه از آنان ظاهر می‌شود و موجب آن ملامت است، بر آنان نیز جاری می‌شود. و گویی آن جایگاه، آنان را ملامت می‌کند که چرا عزت و سلطنت خود را آشکار نساختند. پس این سبب اطلاق این لفظ در اصطلاح بر آنان است و این طریقی مخصوص است که هر کسی آن را نمی‌شناسد و اهل الله به آن منفرد شده‌اند و در میان عوام، حالی که با آن متمایز شوند، ندارند.\n\n### [اینکه حکیم از میان بندگان کسی است که هر چیزی را در جایگاه خود قرار می‌دهد]\n\nو بدان که حکیم (الحکیم) از میان بندگان کسی است که هر چیزی را در جایگاه خود قرار می‌دهد و از مرتبه‌اش تجاوز نمی‌کند و حق هر صاحب حقی را به او می‌دهد. در هیچ امری بر اساس غرض یا هوای نفس خود حکم نمی‌کند و عوارض ناگهانی در او تأثیر نمی‌گذارد. حکیم به این سرای که خداوند او را تا اجلی در آن ساکن کرده است، می‌نگرد و به آنچه خداوند برای تصرف در آن، بدون کم و کاست، برای او تشریع کرده است، نظر می‌کند. پس بر روشی که برایش آشکار شده است، عمل می‌کند و ترازویی را که در این موطن برای او نهاده شده، از دست نمی‌گذارد. زیرا اگر آن را بگذارد، اندازه‌ها را نادیده می‌گیرد و یا در وزن خود زیان می‌بیند یا کم‌فروشی (تطفیف) می‌کند. خداوند هر دو حالت را مذمت کرده است. و خداوند متعال برای کم‌فروشی حالتی مخصوص قرار داده که در آن کم‌فروشی ستوده می‌شود. پس در آنجا از روی علم کم‌فروشی می‌کند، زیرا آن، سنگینی ترازو است و در کم‌فروشی خود نزد خدا سپاسگزار خواهد بود. پس اگر این را دانست و ترازو از دستش جدا نشد، هیچ یک از حکمت خدا در خلقش را خطا نمی‌کند و بدین ترتیب امام زمان خود خواهد بود.\n\nپس اولین چیزی که در این موطن وزن می‌کند، احوال است. اگر وزن کردن حال، اقتضا کند که حق (الحق) را برای بندگانش آشکار سازد و خلق را به او بشناساند، این کار را می‌کند، و این در موطنی است که ذکر آن به آزار خدا و رسولش منجر نشود. زیرا خداوند خود را به آزار دیدن وصف کرده و فرموده است: «همانا کسانی که خدا را آزار می‌دهند» (إِنَّ الَّذِينَ يُؤْذُونَ الله). و این همان چیزی است که اسم صبور و اسم حلیم را برای او اقتضا کرده است. و رسول خدا (صلی الله علیه و سلم) فرمود: «هیچ کس شکیباتر از خدا بر آزار نیست» (ليس شخص أصبر على أذى من الله). و به او دروغ گفته شده و دشنام داده شده است. خداوند این را در خبر صحیح از رسول خدا (صلی الله علیه و سلم) از پروردگارش خبر داده است که فرمود: «فرزند آدم مرا تکذیب کرد و سزاوار او نبود و فرزند آدم مرا دشنام داد و سزاوار او نبود» (كذبني ابن آدم ولم يكن ينبغي له ذلك وشتمني ابن آدم ولم يكن ينبغي له ذلك). این سخن را تنها اسم لطیف بیان کرده است و به همین دلیل این لطف در عتاب در سرای دنیا را به او بخشیده و با آن، تعریف (شناساندن) واقع شده است تا تکذیب‌کننده از تکذیب خود و دشنام‌دهنده از دشنام خود بازگردد، زیرا این موطن، موطن بازگشت و قبول از اوست. و آخرت اگرچه موطن بازگشت است، اما موطن قبول نیست. از جمله موازین این است که حکیم در مکان‌هایی که می‌داند اگر خدا یا رسولش یا یکی از کسانی که نزد خدا در دین قدر و منزلتی دارند، مانند صحابه نزد شیعه، ذکر شوند، این ذکر منجر به عیب‌جویی و دشنام به مذکور و وارد کردن آزار به حق او می‌شود، از ذکر خدا یا رسولش یا آن شخص پرهیز کند. پس در چنین موطنی او را ذکر نمی‌کند.\n\nآیا نمی‌بینی که رسول خدا (صلی الله علیه و سلم) ما را از سفر بردن قرآن که همان مصحف است، به سرزمین دشمن نهی کرده است؟ زیرا این کار منجر به اهانت و بی‌حرمتی به آن می‌شود، از سوی کسی که به آن ایمان ندارد و دشمن آن است. و این مقام ملامی است و نه غیر او. پس شریعت تماماً احوال ملامیه است.\n\nعایشه، ام‌المؤمنین (رضی الله عنها)، از خُلق رسول خدا (صلی الله علیه و سلم) پرسید، پس او (رضی الله عنها) فرمود: «خُلق او قرآن بود.» سپس این آیه را تلاوت کرد: «و تو بر اخلاقی بزرگ هستی» (وإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ). پس اصل الهی که این طایفه به آن استناد کرده‌اند، همان است که ذکر کردیم؛ اینکه برای جلال حق (الحق) سبحانه، تعظیم و کبریا (بزرگی) که شایسته الوهیت است، واجب است. با این حال، به موطن دنیا بنگر که چه چیزی را در حق حق (الحق) اقتضا کرده است؛ از ادعای ربوبیت (پروردگاری) بندگان در آن و منازعه با حق در کبریا و عظمتش، چنانکه فرعون گفت: «من پروردگار برتر شما هستم» (أَنَا رَبُّكُمُ الْأَعْلى‏) و تکبر و گردنکشی کرد. و سبب آن این است که موطن اقتضا کرد که خلق از خدا محجوب شوند، زیرا اگر او خود را در دنیا به آنان می‌نمایاند، حکم قضا و قدر که همان علم خدا در خلقش به آنچه از آنان و در آنان خواهد بود، باطل می‌شد. پس حجاب او رحمتی برای آنان و ابقای ایشان بود، زیرا تجلی (التجلی) او سبحانه ذاتاً قهر را می‌بخشد و با آن، ادعایی ممکن نیست. پس چون الوهیت به حکم مواطن جاری می‌شود، این اصل الهی مشهود ملامیه بود، زیرا آنان حکیم و عالم بودند. پس گفتند: ما فروع این اصل هستیم، زیرا هر آنچه در عالم رخ می‌دهد، اصلی الهی دارد، اما هر اصل الهی در حق بنده، اگر به آن متصف شود، ستوده نیست. کبریا بدون شک اصلی الهی است، اما اگر بنده به آن متصف شود و خود را فرع این اصل قرار دهد و آن را باطناً به کار برد، بدون هیچ اختلافی از هر جهت مذموم است. اما اگر آن را ظاهراً در موضع خاصی که برای او تعیین شده و استفاده از آن به صورت ظاهری بی‌روح از جانب او مباح گشته، به کار برد، به خاطر خودِ صورت ستوده است. به همین دلیل، این طایفه دیدند که پنهان کردن خرق عادات بر اولیا واجب است، همان‌طور که آشکار کردن آن بر انبیا واجب است، زیرا آنان شارع هستند و بر نفوس، اموال و اهل، تسلط دارند. پس ناگزیر باید دلیلی باشد که نشان دهد تسلط بر آن، از آنِ پروردگار مال و نفس و اهل است. زیرا رسول از جنس بشر است، پس ادعای آنچه را که اصلی برای او نیست، جز با دلیل قاطع و برهان، از او پذیرفته نمی‌شود. و کسی که تشریع و تسلط بر عالم با وضع احکام را ندارد، چرا باید خرق عادات را هنگامی که خداوند او را بر آن توانا ساخته است، آشکار کند؟ تا آن را دلیلی بر نزدیکی خود نزد خدا قرار دهد، نه اینکه مردم آن را از او بشناسند. پس هرگاه آن را در میان عموم آشکار کند، به دلیل رعونتی است که در او برخاسته و نفسش بر او غلبه کرده است، و این به مکر و استدراج (فریب تدریجی) نزدیک‌تر است تا به کرامت. پس ملامیه صاحبان علم صحیح در این زمینه هستند. آنان طبقه بالا و سروران طریقت برتر و جایگاه نزدیک (زلفی) در کرانه دنیا و کرانه دور هستند. آنان در علم مواطن و اهل آن و آنچه سزاوار رفتار با آن است، ید بیضا (قدرت آشکار) دارند. سلمان فارسی از نظر قدر، از بزرگترین آنان بود و او از اصحاب رسول خدا (صلی الله علیه و سلم) در این مقام است، و این همان مقام الهی در دنیاست. این منزل از علوم، شامل این علم است که همان علم حکمت است. و شامل علم مواقف، علم حساب، علم ظن، علم اهمال (نادیده گرفتن) و فرق آن با امهال (مهلت دادن) که اسم حکیم آن را می‌طلبد، و علم سبقت به سوی معاصی و مخالفت‌هاست. و آیا مخالفت برای انسان می‌تواند عین موافقت باشد؟ و اگر چنین است، آیا این مخالفت با این مرتبه و سرعت او در انجام آن، نزد خدا برایش قربت (نزدیکی) به بار می‌آورد؟ و آیا مقرب را، اگرچه به سوی آن بشتابد، هنگام مباشرت فعل مخالف حکم مشروع، از حکم مشروع در آن محجوب می‌کند یا محجوب نمی‌کند؟ و یا اینکه آن فعل مخالف، قربت است، اما ممکن است مقرب باشد نه قربت؟ و این علم بزرگی است که جز اندکی از اهل طریقت ما آن را نمی‌شناسند، زیرا عمق آن دور و ترازوی آن پنهان و دقیق است و در میان موازین، پنهان‌تر از آن نیست. و بیشتر اهل راه خدا آن را مشاهده نکرده و ندیده‌اند و اگر به آنان گفته شود، آن را انکار می‌کنند، پس گمانت به علمای رسوم (ظاهر) چیست؟ و گمانت به عوام چیست؟ اما بزرگان حکما از فلاسفه، آن را به طور کلی انکار کرده‌اند. و سبب انکار آنان با وجود فضل و عمق نظرشان این است که آنان به اختصاص (ویژگی الهی) قائل نیستند، چنانکه ما می‌گوییم، بلکه امور نزد آنان تماماً با استعداد کسب می‌شوند. از این رو، این علم و سایر علوم مربوط به اختصاص، بر آنان پنهان مانده است. و از علوم این منزل، علم سببی است که قائلان به انکار سرای آخرت حسی و معنوی را به این امر کشانده است، زیرا آنان بدون شک دو طایفه‌اند: طایفه‌ای که حس اخروی را انکار می‌کند و طایفه‌ای که آن را معناً و حساً انکار می‌کند. و از علوم آن، علم احوال مرگ و اینکه چرا باز می‌گردد و حقیقت آن چیست، و ذبح آن و صورت آن در عالم تمثیل به شکل قوچی ابلق، و مکان ذبح آن، و اینکه حیاتش پس از ذبح به چه کسی منتقل می‌شود. و علم تجلی (التجلی) که موجب کسوف کواکب معنوی و حسی می‌شود. و علم حضرة جمع (الحضرة) میان بنده و پروردگار. و از این حضرت است که قائلان به اتحاد و حلول ظهور کرده‌اند، زیرا این حضرتی از علم است که در آن قدم‌ها می‌لغزد، چرا که شبهه در آن قوی است و دلیلی مرکب نمی‌تواند با آن مقابله کند. و علم اسفار (سفرها) که ما در آن جزئی داریم و آن را «الأسفار عن نتائج الأسفار» نامیده‌ایم که شامل بسیاری از علم الهی و نسبت این حکم الهی به آن، و از علم کونی و نسبت این حکم الهی معناً و حساً است. و از علوم این منزل الهی همچنین این است که مردم در روز قیامت به کدام اسم الهی باز می‌گردند. و علم سببی که به خاطر آن، عالم از غیر خود درباره آنچه انجام می‌دهد، سؤال می‌کند. و سبب انکار عالم آنچه را که می‌داند، هنگامی که از علم به آن سؤال می‌شود. و علم کشف (الکشف) انسان از آنچه در نفس فرشته است، و اینکه آیا این از علم ستر (پوشیدگی) است یا ظهور، یا بخشی از آن از علم ستر است به یک وجه و از علم ظهور به وجه دیگر. و علم ادب، و علم اقتدا (پیروی). و علم سببی که موجب ترجیح دنیا بر آخرت می‌شود، با وجود غم‌ها و انکار حسی و معنوی که در آن است. و علم رؤیت در سرای آخرت، و اینکه آیا جایز است یا محال، چه رؤیت بصیرت باشد یا بصر. و آیا محل رؤیت، حقیقت بیننده است یا چشم معتاد و شناخته شده. و آیا رؤیت حکم است یا معنای وجودی. و آیا عین بیننده است یا غیر او، مانند صفتی برای او. و علم حال نفوس پس از مرگ. و علم آخرت تعجیل شده و دنیای به تأخیر افتاده. و علم اقبال (روی آوردن) و اعراض (روی گرداندن). و علم وعید و تقریر. و علم اقتدار. و این مقدار در این منزل کافی است. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 4
}