{
  "id": 31,
  "title": {
    "ar": "الباب الحادي والثلاثون في معرفة أصول الركبان",
    "en": "Chapter Thirty-One: Concerning the Knowledge of the Principles of the Riders.",
    "ur": "اکتیسواں باب: سواروں کے اصولوں کی معرفت کے بیان میں",
    "fa": "باب سی و یکم در معرفت اصول سواران (الرکبان)"
  },
  "content": {
    "ar": "## (الباب الحادي والثلاثون في معرفة أصول الركبان)\n\n\n> حدب الدهر علينا وحنا *** ومضى في حكمه وما ونى‏\n\n\n> وعشقناه فغنينا عسى *** يطرب الدهر بإيقاع الغنا\n\n\n> نحن حكمناك في أنفسنا *** فاحكم إن شئت علينا أو لنا\n\n\n> ولقد كان له الحكم وما *** كان ذاك الحكم للدهر بنا\n\n\n> فشفيعي هو دهري والذي *** صرف الدهر كذا صرفنا\n\n\n> فركبنا نطلب الأصل الذي *** جعل السر لدينا علنا\n\n\n> فلنا منه الذي حركنا *** وله منا الذي سكننا\n\n\n> حركات الدهر فينا شهدت *** أنه قال له ما سكنا\n\n\n> فأنا العبد الذليل المجتبى *** وأنا حق وما الحق أنا\n\n\n### [التبري من الحركة]\n\n\nاعلم أيدك الله أن الأصول التي اعتمد عليها الركبان كثيرة منها التبري من الحركة إذا أقيموا فيها فلهذا ركبوا فهم الساكنون على مراكبهم المتحركون بتحريك مراكبهم فهم يقطعون ما أمروا بقطعه بغيرهم لا بهم فيصلون مستريحين مما تعطيه مشقة الحركة متبرءين من الدعوى التي تعطيها الحركة حتى لو افتخروا بقطع المسافات البعيدة في الزمان القليل لكان ذلك الفخر راجعا للمركب الذي قطع بهم تلك المسافة لا لهم فلهم التبري وما لهم الدعوى فهجيرهم لا حول ولا قوة إلا بالله وآيتهم وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ يقال لهم وما قطعتم هذه المسافات حين قطعتموها ولكن الركاب قطعتها فهم المحمولون فليس للعبد صولة لا بسلطان سيده وله الذلة والعجز والمهانة والضعف من نفسه ولما رأوا أن الله قد نبه بقوله تعالى ولَهُ ما سَكَنَ فأخلصه له علموا إن الحركة فيها الدعوى وأن السكون لا تشوبه دعوى فإنه نفي الحركة فقالوا إن الله قد أمرنا بقطع هذه المسافة المعنوية وجوب هذه المفاوز المهلكة إليه فإن نحن قطعناها بنفوسنا لم نأمن على نفوسنا من أن نتمدح بذلك في حضرة الاتصال فإنها مجبولة على الرعونة وطلب التقدم وحب الفخر فنكون من أهل النقص في ذلك المقام بقدر ما ينبغي أن نحترم به ذلك الجلال الأعظم‏\n\n\n### [الحوقلة نجب الأفراد]\n\n\nفلنتخذ ركابا نقطع به فإن أرادت الافتخار يكون الافتخار للركاب لا للنفوس فاتخذت من لا حول ولا قوة إلا بالله نجبا لما كانت النجب أصبر عن الماء والعلف من الأفراس وغيرها والطريق معطشة جدبة يهلك فيها من المراكب من ليس له مرتبة النجب فلهذا اتخذوها نجبا دون غيرها مما يصح أن يركب ولا يصح أن يقطع ذلك الحمد لله فإن هذا الذكر من خصائص الوصول ولا سبحان الله فإنه من خصائص التجلي ولا لا إله إلا الله فإنه من خصائص الدعاوي ولا الله أكبر فإنه من خصائص المفاضلة فتعين لا حول ولا قوة إلا بالله فإنه من خصائص الأعمال فعلا وقولا ظاهرا وباطنا لأنهم بالأعمال أمروا والسفر عمل قلبا وبدنا ومعنى وحسا وذلك مخصوص بلا حول ولا قوة إلا بالله فإنه بها يقولون لا إله إلا الله وبها نقول سبحان الله وغير ذلك من جميع الأقوال والأعمال‏\n\n\n### [ «السكون» مناط اختيار «الأفراد»]\n\n\nولما كان السكون عدم الحركة والعدم أصلهم لأنه قوله وقَدْ خَلَقْتُكَ من قَبْلُ ولَمْ تَكُ شَيْئاً يريد موجودا فاختاروا السكون على الحركة وهو الإقامة على الأصل فنبه سبحانه وتعالى في قوله ولَهُ ما سَكَنَ في اللَّيْلِ والنَّهارِ أن الخلق سلموا له العدم وادعوا له في الوجود فمن باب الحقائق عرى الحق خلقه في هذه الآية عن إضافة ما ادعوه لأنفسهم بقوله ولَهُ ما سَكَنَ في اللَّيْلِ والنَّهارِ أي ما ثبت والثبوت أمر وجودي عقلي لا عيني بل نسبي وهُوَ السَّمِيعُ الْعَلِيمُ يسمع‏\nدعواكم في نسبة ما هو له وقد نسبتموه إليكم عليم بأن الأمر على خلاف ما دعيتموه‏\n\n\n### [توحيد الحق بلسان الحق‏]\n\n\nومن أصولهم التوحيد بلسان بي يتكلم وبي يسمع وبي يبصر وهذا مقام لا يحصل إلا عن فروع الأعمال وهي النوافل فإن هذه الفروع تنتج المحبة الإلهية والمحبة تورث العبد أن يكون بهذه الصفة فتكون هذه الصفة أصلا لهذا الصف من العباد فيما يعلمونه ويحكمون به من أحكام الخضر وعلمه فهو أصل مكتسب وهو للخضر أصل عناية إلهية بالرحمة التي آتاه الله وعن تلك الرحمة كان له هذا العلم الذي طلب موسى عليه السلام أن يعلمه منه فإن تفطنت لهذا الأمر الذي أوردناه عرفت قدر ولاية هذه الملة المحمدية والأمة ومنزلتها وأن ثمرة زهرة فروع أصلها المشروع لها في العامة هي أصل الخضر الذي امتن الله تعالى على عبده موسى عليه السلام بلقائه وأدبه به فانتج للمحمدي فرع فرع فرع أصله ما هو أصل للخضر ومثل موسى عليه السلام يطلب منه أن يعلمه مما هو عليه من العلم فانظر منزلة هذا العارف المحمدي أين تميزت فكيف لك بما ينتجه الأصل الذي ترجع إليه هذه الفروع‏\n\n\n### [محبة الامتنان ومحبة الجزاء]\n\n\nقال رسول الله صلى الله عليه وسلم فيما يرويه عن ربه إن الله يقول ما تقرب إلي المتقربون بأحب إلي من أداء ما افترضته عليهم‏\n\n\nفهذا هو الأصل أداء الفرض ثم قال ولا يزال العبد يتقرب إلي بالنوافل وهو ما زاد على الفرائض ولكن من جنسها حتى تكون الفرائض أصلا لها مثل نوافل الخيرات من صلاة وزكاة وصوم وحج وذكر فهذا هو الفرع الأقرب إلى الأصل ثم ينتج له هذا العمل الذي هو نافلة محبة الله إياه وهي محبة خاصة جزاء ليست هي محبة الامتنان فإن محبة الامتنان الأصلية اشترك فيها جميع أهل السعادة عند الله تعالى وهي التي أعطت لهؤلاء التقرب إلى الله بنوافل الخيرات ثم إن هذه المحبة وهي الفرع الثاني الذي هو بمنزلة الزهرة أنتجت له أن يكون الحق سمعه وبصره ويده إلى غير ذلك وهذا هو الفرع الثالث وهو بمنزلة الثمرة التي تعقد عند الزهرة فعند ذلك يكون العبد يسمع بالحق وينطق به ويبصر به ويبطش به ويدرك به وهذا وحي خاص إلهي أعطاه هذا المقام ليس للملك فيه وساطة من الله ولهذا قال الخضر لموسى عليه السلام ما لَمْ تُحِطْ به خُبْراً فإن وحي الرسل إنما هو بالملك بين الله وبين رسوله فلا خبر له بهذا الذوق في عين إمضاء الحكم في عالم الشهادة فما تعود الإرسال لتشريع الأحكام الإلهية في عالم الشهادة إلا بواسطة الروح الذي ينزل به على قلبه أو في تمثله لم يعرف الرسول الشريعة إلا على هذا الوصف لا غير الشريعة فإن الرسول له قرب أداء الفرض والمحبة عليها من الله وما تنتج له تلك المحبة وله قرب النوافل ومحبتها وما يعطيه محبتها ولكن من العلم بالله لا من علم التشريع وإمضاء الحكم في عالم الشهادة فلم يحط به خبرا من هذا القبيل فهذا القدر هو الذي اختص به خضر دون موسى عليه السلام‏\n\n\n### [نبوة التعريف ونبوة التشريع‏]\n\n\nومن هذا الباب يحكم المحمدي الذي لم يتقدم له علم بالشريعة بوساطة النقل وقراءة الفقه والحديث ومعرفة الأحكام الشرعية فينطق صاحب هذا المقام بعلم الحكم المشروع على ما هو عليه في الشرع المنزل من هذه الحضرة وليس من الرسل وإنما هو تعريف إلهي وعصمة يعطيها هذا المقام ليس للرسالة فيه مدخل فهذا معنى قوله ما لَمْ تُحِطْ به خُبْراً فإن الرسول لا يأخذ هذا الحكم إلا بنزول الروح الأمين على قلبه أو بمثال في شاهده يتمثل له الملك رجلا ولما كانت النبوة قد منعت والرسالة كذلك بعد رسول الله صلى الله عليه وسلم كان التعريف لهذا الشخص بما هو الشرع المحمدي عليه في عالم الشهادة فلو كان في زمان التشريع كما كان زمان موسى لظهر الحكم من هذا الولي كما ظهر من الخضر من غير وساطة ملك بل من حضرة القرب فالرسول والنبي لهما حضرة القرب مثل ما لهذا وليس له التشريع منها بل التشريع لا يكون له لا بوساطة الملك الروح وما بقي إلا إذا حصل للنبي المتأخر من شرع المتقدم ما هو شرع له هل يحصل ذلك بوساطة الروح كسائر شرعه أو يحصل له كما حصل للخضر ولهذا الولي منا من حضرة الوحي فمذهبي أنه لا يحصل له إلا كما يحصل ما يختص به من الشرائع ذلك الرسول ولهذا ليصدق الثقة العدل في قوله ما لم تحط به خبرا وما يعرف له منازع ولا مخالف فيما ذكرناه من أهل طريقنا ولا وقفنا عليه غير أنه إن خالفنا فيه أحد من أهل طريقنا فلا يتصور فيه خلاف لنا إلا من أحد رجلين إما رجل من أهل الله التبس عليه الأمر وجعل التعريف الإلهي حكما فأجاز أن يكون النبي أو الرسول كذلك ولكن في هذه الأمة وأما في الزمان الأول فهو حكم لصاحبه ولا بد وهو تعريف للرسول بوساطة الملك أن هذا شرع‏\nلغيره قال تعالى لما ذكر الأنبياء أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ وما ذكر له هداهم إلا بالوحي بوساطة لروح والرجل الآخر رجل قاس الحكم على الأخبار وأما غير ذلك فلا يكون ومع هذا فلم يصل إلينا عن أحد منهم خلاف فيما ذكرناه ولا وفاق‏\n\n\n### [مشكلة الصفات والأسماء الإلهية]\n\n\nومن أصول هذه الطبقة أيضا أنه يتكلم بما به يسمع ولا يقول بذلك سواهم من حيث الذوق لكن قد يقول بذلك من يقول به من حيث الدليل العقلي فهؤلاء يأخذونه عن تجل إلهي وغيرهم يأخذه عن نظر صحيح موافق للأمر على ما هو عليه وهو الحق ووقوع الاختلاف في الطريق فهذا الطريق غير هذا الطريق وإن اتفقا في المنزل وهو الغاية فهو السميع لنفسه البصير لنفسه العالم لنفسه وهكذا كل ما تسميه به أو تصفه أو تنعته إن كنت ممن يسي‏ء الأدب مع الله حيث يطلق لفظ صفة على ما نسب إليه أو لفظ نعت فإنه ما أطلق على ذلك إلا لفظ اسم فقال سَبِّحِ اسْمَ رَبِّكَ وتَبارَكَ اسْمُ رَبِّكَ ولِلَّهِ الْأَسْماءُ الْحُسْنى‏ فَادْعُوهُ بِها وقال في حق المشركين قُلْ سَمُّوهُمْ وما قال صفوهم ولا أنعتوهم بل قال سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ فنزه نفسه عن الوصف لفظا ومعنى إن كنت من أهل الأدب والتفطن فهذا معنى قولي إن كنت ممن يسي‏ء الأدب مع الله‏\n\n\n### [مذهب الأشاعرة في الذات والصفات‏]\n\n\nوالمخالف لنا يقول إنه يعلم بعلم ويقدر بقدرة ويبصر ببصر وهكذا جميع ما يتسمى به إلا صفات التنزيه فإنه لا يتكلم فيها بهذا النوع كالغني وأشباهه إلا بعضهم فإنه جعل ذلك كله معاني قائمة بذات الله لا هي هو ولا هي غيره ولكن هي أعيان زائدة على ذاته والأستاذ أبو إسحاق جعل السبعة أصولا لا أعيانا زائدة على ذاته اتصفت بها ذاته وجعل كل اسم بحسب ما تعطيه دلالته فجعل صفات التنزيه كلها في جدول الاسم الحي وجعل الخبير والحسيب والعليم والمحصي وأخواته في جدول العلم وجعل الاسم الشكور في جدول الكلام وهكذا الحق الكل كل صفة من السبعة ما يليق بها من الأسماء بالمعنى كالخالق والرازق للقدرة وغير ذلك على هذا الأسلوب هذا مذهب الأستاذ وأجمع المتكلمون من الأشاعرة على إن ثم أمورا زائدة على الذات ونصبوا على ذلك أدلة ثم إنهم مع إجماعهم على الزائد لم يجدوا دليلا قاطعا على إن هذا الزائد على الذات هل هو عين واحدة لها أحكام مختلفة وإن كان زائدا لا بد من ذلك أو هل هذا الزائد أعيان متعددة لم يقل حاذقوهم في ذلك شيئا بل قال بعضهم يمكن أن يكون الأمر في نفسه يرجع إلى عين واحدة ويمكن أن يرجع إلى أعيان مختلفة إلا أنه زائد ولا بد ولا فائدة جاء بها هذا المتكلم إلا عدم التحكم فإن الذات إذا قبلت عينا واحدة زائدة جاز أن تقبل عيونا كثيرة زائدة على ذاتها فيكون القدماء لا يحصون كثرة وهو مذهب أبي بكر بن الطيب والخلاف في ذلك يطول وليس طريقنا على هذا بنى أعني في الرد عليهم ومنازعتهم لكن طريقنا تبيين مآخذ كل طائفة ومن أين انتحلته في نحلها وما تجلى لها وهل يؤثر ذلك في سعادتها أو لا يؤثر هذا حظ أهل طريق الله من العلم بالله فلا نشتغل بالرد على أحد من خلق الله بل ربما يقيم لهم العذر في ذلك للاتساع الإلهي فإن الله أقام العذر فيمن يدعو مع الله إلها آخر ببرهان يرى أنه دليل في زعمه فقال عز من قائل ومن يَدْعُ مَعَ الله إِلهاً آخَرَ لا بُرْهانَ لَهُ به‏\n\n\n### [الخير والشر ونسبتهما إلى الله‏]\n\n\nومن أصولهم الأدب مع الله تعالى فلا يسمونه إلا بما سمي به نفسه ولا يضيفون إليه إلا ما أضافه إلى نفسه كما قال تعالى ما أَصابَكَ من حَسَنَةٍ فَمِنَ الله وقال في السيئة وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ ثم قال قُلْ كُلٌّ من عِنْدِ الله قال ذلك في الأمرين إذا جمعتهما لا تقل من الله فراع اللفظ واعلم أن لجمع الأمر حقيقة تخالف حقيقة كل مفرد إذا انفرد ولم يجتمع مع غيره كسواد المداد بين العفص والزاج ففصل سبحانه بين ما يكون منه وبين ما يكون من عنده يقول تعالى في حق طائفة مخصوصة والله خَيْرٌ وأَبْقى‏ ببنية المفاضلة ولا مناسبة وقال في حق طائفة أخرى معينة صفتها وما عِنْدَ الله خَيْرٌ وأَبْقى‏ فما هو عنده ما هو عين ما هو منه ولا عين هويته فبين الطائفتين ما بين المنزلتين كما قيل لواحد ما تركت لأهلك قال الله ورسوله وقيل للآخر فقال نصف مالي فقال بينكما ما بين كلمتيكما يعني في المنزلة فإذا أخذ العبد من كل ما سواه جعله في الله خير وأبقى وإذا أخذه من وجه من العالم يقتضي الحجاب والبعد والذم جعله فيما عند الله خير وأبقى فميز المراتب ثم إنه سبحانه عرفنا بأهل الأدب ومنزلهم من العلم به فقال عن إبراهيم خليله أنه قال الَّذِي خَلَقَنِي فَهُوَ يَهْدِينِ والَّذِي هُوَ يُطْعِمُنِي ويَسْقِينِ ولم يقل يجوعني وإِذا مَرِضْتُ ولم يقل أمرضني فَهُوَ يَشْفِينِ فأضاف الشفاء إليه والمرض لنفسه وإن كان الكل من عنده ولكنه تعالى هو أدب رسله إذ كان‏\nالمرض لا تقبله النفوس بخلاف الموت فإن الفضلاء من العقلاء العارفين يطلبون الموت للتخلص من هذا الحبس وتطلبه الأنبياء للقاء الله الذي يتضمنه وكذلك أهل الله ولذلك ما خير نبي في الموت إلا اختاره لأن فيه لقاء الله فهو نعمة منه عليه ومنة والمرض شغل شاغل عن أداء ما أوجب الله على العبد أداءه من حقوق الله لإحساسه بالألم وهو في محل التكليف وما يحس بالألم إلا الروح الحيواني فيشغل الروح المدبر لجسده عما دعي إليه في هذه الدنيا فلهذا أضاف المرض إليه والشفاء والموت للحق كما فعل صاحب موسى عليه السلام في إضافة خرق السفينة إليه إذ جعل خرقها عيبا وأضاف قتل الغلام إليه وإلى ربه لما فيه من الرحمة بابويه وما ساءهما من ذلك أضافه إليه وأضاف إقامة الجدار إلى ربه لما فيه من الصلاح والخير فقال تعالى عن عبده خضر في خرق السفينة فَأَرَدْتُ أَنْ أَعِيبَها تنزيها أن يضيف إلى الجناب العالي ما ظاهره ذم في العرف والعادة وقال في إقامة الجدار لما جعل إقامته رحمة باليتيمين لما يصيبانه من الخير الذي هو الكنز فَأَرادَ رَبُّكَ يخبر موسى عليه السلام أَنْ يَبْلُغا أَشُدَّهُما ويَسْتَخْرِجا كَنزَهُما رَحْمَةً من رَبِّكَ وقال لموسى في حق الغلام إنه طبع كافرا والكفر صفة مذمومة قال تعالى ولا يَرْضى‏ لِعِبادِهِ الْكُفْرَ وأراد أن يخبره بأن الله يبدل أبويه خَيْراً مِنْهُ زَكاةً وأَقْرَبَ رُحْماً فأراد أن يضيف ما كان في المسألة من العيب في نظر موسى عليه السلام حيث جعله نكرا من المنكر وجعله نفسا زاكية قتلت بِغَيْرِ نَفْسٍ قال فَأَرَدْنا أَنْ يُبْدِلَهُما رَبُّهُما فأتى بنون الجمع فإن في قتله أمرين أمر يؤدي إلى الخير وأمر إلى غير ذلك في نظر موسى وفي مستقر العادة فما كان من خير في هذا الفعل فهو لله من حيث ضمير النون وما كان فيه من نكر في ظاهر الأمر وفي نظر موسى عليه السلام في ذلك الوقت كان للخضر من حيث ضمير النون فنون الجمع لها وجهان لما فيها من الجمع وجه إلى الخير به أضاف الأمر إلى الله ووجه إلى العيب به أضاف العيب إلى نفسه وجاء بهذه المسألة والواقعة في الوسط لا في الطرف بين السفينة والجدار ليكون ما فيها من عيب من جهة السفينة وما فيها من خير من جهة الجدار فلو كانت مسألة الغلام في الطرف ابتداء أو انتهاء لم تعط الحكمة أن يكون كل وجه مخلصا من غير أن يشوبه شي‏ء من الخير أو ضده فلو كان أولا وكانت السفينة وسط لم يصل ما في مسألة الغلام من الخير الذي له ولأبويه حتى يمر على حضرة مصيبة ظاهرا وهي السفينة وحينئذ يتصل بالخير الذي في الجدار ولو كان الجدار وسطا وتأخر حديث الغلام لم يصل عيب السفينة إلى الاتصال بعيب الغلام حتى يمر بخير ما في الجدار فيمر بغير المناسب ومن شأن الحضرات أن تقلب أعيان الأشياء أعني صفاتها إذا مرت بها فكانت مسألة الغلام وسطا فيلي وجه العيب جهة السفينة ويلي جهة الخير جهة الجدار واستقامت الحكمة فإن قلت فلم جمع بين الله وبين نفسه في ضمير النون أعني نون فأردنا وقال صلى الله عليه وسلم لما سمع بعض الخطباء وقد جمع بين الله تعالى ورسول الله صلى الله عليه وسلم في ضمير واحد في قوله ومن يعصهما بئس الخطيب أنت‏\n\n\nفاعلم أنه من الباب الذي قررناه وهو أنه لا يضاف إلى الحق إلا ما أضافه الحق إلى نفسه أو أمر به رسوله أو من آتاه علما من لدنه كالخضر المنصوص عليه فهذا من ذلك الباب فلما كان هذا الخطيب عريا من العلم اللدني ولم يكن رسول الله صلى الله عليه وسلم تقدم إليه في إباحة مثل هذا لهذا ذمه وقال بئس الخطيب أنت فإنه كان ينبغي له أن لا يجمع بين الحق والخلق في ضمير واحد إلا بإذن إلهي من رسول أو علم لدني ولم يكن واحد من هذين الأمرين عنده فلهذا ذمه رسول الله صلى الله عليه وسلم وقد قال رسول الله صلى الله عليه وسلم في حديث رويناه عنه في خطبة خطبها فذكر الله تعالى فيها وذكر نفسه صلى الله عليه وسلم ثم جمع بين ربه تعالى وبين نفسه فيها في ضمير واحد فقال من يُطِعِ الله ورَسُولَهُ فقد رشد ومن يعصهما فلا يضر إلا نفسه ولا يضر الله شيئا\n\n\nوما يَنْطِقُ صلى الله عليه وسلم عَنِ الْهَوى‏ إِنْ هُوَ إِلَّا وَحْيٌ يُوحى‏ وكذا قال الخضر وما فَعَلْتُهُ عَنْ أَمْرِي يعني جميع ما فعله من الأعمال وجميع ما قال من الأقوال في العبارة لموسى عليه السلام عن ذلك فافهم‏\n\n\n### [الركبان مرادون لا مريدون‏]\n\n\nفبهذا قد أبنت لك عن أصولهم ما فيه كفاية فالركبان هم المرادون المجذوبون المصونة أسرارهم في البيض فلا يتخللها هواء مثل القاصرات الطرف من الحور المقصورات في الخيام كَأَنَّهُنَّ بَيْضٌ مَكْنُونٌ‏\n\n\n### [صفات الركبان‏]\n\n\nومن صفاتهم أنهم لا يكشفون وجوههم عند النوم ولا ينامون إلا على ظهورهم لهم التلقي لا يتحركون إلا عن أمر إلهي ولا يسكنون إلا كذلك بإرادة إرادتهم ما يراد بهم ولما كان السكون أمرا عدميا لذلك‏\nقرنا به الإرادة دون الأمر ولما كان التحرك أمرا وجوديا لذلك قرنا به الأمر الإلهي إن فهمت وهم رضي الله عنهم لا يزاحمون ولا يزاحمون أكثر ما يجري على ألسنتهم ما شاء الله سخرت لهم السحاب لهم القدم الراسخة في علم الغيوب لهم في كل ليلة معراج روحاني بل في كل نومة من ليل أو نهار لهم استشراف على بواطن العالم فرأوا ملكوت السموات والأرض يقول الله تعالى وكَذلِكَ نُرِي إِبْراهِيمَ مَلَكُوتَ السَّماواتِ والْأَرْضِ ولِيَكُونَ من الْمُوقِنِينَ وقال في حق رسول الله صلى الله عليه وسلم سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ لَيْلًا من الْمَسْجِدِ الْحَرامِ إِلَى الْمَسْجِدِ الْأَقْصَى الَّذِي بارَكْنا حَوْلَهُ لِنُرِيَهُ من آياتِنا وهو عين إسرائه والعلماء ورثة الأنبياء أحوالهم الكتمان لو قطعوا إربا إربا ما عرف ما عندهم لهذا قال خضر ما فَعَلْتُهُ عَنْ أَمْرِي فالكتمان من أصولهم إلا أن يؤمروا بالإفشاء والإعلان والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Thirty-One: Concerning the Knowledge of the Principles of the Riders (أصول الركبان)\n\nTime (الدهر) bent over us and inclined,\nAnd proceeded in its decree without slackening.\n\nWe loved it, so we sang, hoping\nThat Time might be delighted by the rhythm of the song.\n\nWe have made you the judge over our souls,\nSo judge, if you wish, against us or for us.\n\nIndeed, the judgment belonged to Him, and\nThat judgment was not Time’s over us.\n\nSo my intercessor is my Time, and He who\nDisposed of Time thus disposed of us.\n\nSo we rode, seeking the Origin (الأصل) which\nMade the secret manifest within us.\n\nTo us belongs from Him that which moved us,\nAnd to Him belongs from us that which stilled us.\n\nThe movements of Time within us testified\nThat He said to it: \"What has stilled us?\"\n\nSo I am the humble, chosen servant,\nAnd I am The Real (الحق), yet The Real is not me.\n\n### The Disavowal of Movement\n\nKnow, may Allah support you, that the principles (أصول) upon which the Riders (الركبان) rely are numerous. Among them is the disavowal of movement (الحركة) when they are established within it. For this reason, they ride. They are the still ones (الساكنون) upon their mounts, moving only by the movement of their mounts. They traverse what they are commanded to traverse by means other than themselves, not by themselves. Thus, they arrive rested from the hardship that movement entails, disavowing the claim (الدعوى) that movement implies. Even if they were to boast of traversing great distances in little time, that pride would belong to the mount that traversed that distance with them, not to them. For them is the disavowal, and the claim is not theirs. Their constant refrain is: \"There is no power and no strength save in Allah (لا حول ولا قوة إلا بالله).\" And their sign is: <<وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللهَ رَمَى>> (And you threw not when you threw, but Allah threw). It is said to them: \"You did not traverse these distances when you traversed them, but the mounts traversed them.\" They are the carried ones. The servant has no might except by the authority of his Lord, and from himself, he possesses only lowliness, incapacity, humiliation, and weakness. When they saw that Allah drew attention to this by His saying, the Exalted: <<وَلَهُ مَا سَكَنَ>> (And to Him belongs what is still), and dedicated it solely to Him, they knew that movement involves a claim, while stillness (السكون) is untainted by any claim, for it is the negation of movement. So they said: \"Allah has commanded us to traverse this spiritual distance (المسافة المعنوية), necessitating the crossing of these perilous deserts (المفاوز) to reach Him. If we traverse them by our own souls, we are not safe from praising ourselves for it in the Presence of Connection (حضرة الاتصال), for the soul is naturally inclined toward recklessness, seeking precedence, and loving pride. Thus, we would be among the deficient in that station, to the extent that we ought to respect that Greatest Majesty (الجلال الأعظم).\"\n\n### The Hawqala is the Dromedary of the Individuals\n\nTherefore, let us take a mount by which we may traverse. If the mount desires to boast, the boasting belongs to the mount, not to the souls. So they took \"There is no power and no strength save in Allah (لا حول ولا قوة إلا بالله)\" as their noble dromedary (نجبا). This is because dromedaries (النجب) are more patient regarding water and fodder than horses and other animals, and the path is extremely thirst-inducing and barren, where mounts that do not possess the rank of the dromedary perish. For this reason, they adopted it as their dromedary, rather than other things that are suitable for riding but unsuitable for traversing that path. [They did not choose] *Alhamdulillah* (Praise be to Allah), for this remembrance (الذكر) is specific to the characteristics of Arrival (الوصول). Nor *Subhan Allah* (Glory be to Allah), for it is specific to the characteristics of Theophany (التجلي). Nor *La ilaha illa Allah* (There is no god but Allah), for it is specific to the characteristics of claims (الدعاوي). Nor *Allahu Akbar* (Allah is Greater), for it is specific to the characteristics of comparison (المفاضلة). Thus, \"There is no power and no strength save in Allah\" was designated, for it is specific to the characteristics of actions (الأعمال)—action and speech, outwardly and inwardly, because they were commanded to perform actions. The journey is an action of the heart, body, meaning, and sense, and this is specific to \"There is no power and no strength save in Allah,\" for it is by this that they say \"There is no god but Allah,\" and by this that we say \"Glory be to Allah,\" and all other sayings and actions.\n\n### Stillness is the Basis for the Choice of the Individuals\n\nSince stillness (السكون) is the absence of movement, and absence (العدم) is their origin, because of His saying: <<وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئاً>> (And I created you before, when you were nothing)—meaning, nothing existent—they chose stillness over movement, which is abiding by the Origin (الأصل). The Exalted drew attention, in His saying: <<وَلَهُ مَا سَكَنَ فِي اللَّيْلِ وَالنَّهَارِ>> (And to Him belongs what is still in the night and the day), that Creation (الخلق) surrendered non-existence (العدم) to Him, but claimed existence (الوجود) for themselves. From the perspective of Realities (الحقائق), The Real (الحق) stripped His creation in this verse of the attribution of what they claimed for themselves by His saying: <<وَلَهُ مَا سَكَنَ فِي اللَّيْلِ وَالنَّهَارِ>>—meaning, what is established (ما ثبت). Establishment (الثبوت) is a conceptual, existential matter, not an essential one, but a relative one. <<وَهُوَ السَّمِيعُ الْعَلِيمُ>> (And He is the All-Hearing, the All-Knowing). He hears your claims in attributing to yourselves what belongs to Him, and He is All-Knowing (العليم) that the matter is contrary to what you have claimed.\n\n### The Unification of The Real by the Tongue of The Real\n\nAmong their principles is Unification (التوحيد) by the tongue: \"By Me he speaks, by Me he hears, and by Me he sees.\" This is a station (مقام) that is only attained through the branches of actions (فروع الأعمال), which are the supererogatory acts (النوافل). These branches produce Divine Love (المحبة الإلهية), and Love grants the servant the quality of being thus. This quality then becomes a principle (أصل) for this class of servants regarding the knowledge (علم) they possess and the judgments they issue, such as the knowledge of Al-Khidr. For them, it is an acquired principle (أصل مكتسب), but for Al-Khidr, it is a principle of Divine Providence (عناية إلهية) through the Mercy (الرحمة) that Allah bestowed upon him. It was from that Mercy that he possessed this Knowledge (العلم) which Moses (عليه السلام) sought to learn from him. If you grasp this matter that we have presented, you will know the rank of the sainthood (ولاية) of this Muhammadan Community (الملة المحمدية) and its station, and that the fruit and flower of the branches whose origin is legislated for the common people is the very principle of Al-Khidr, by which Allah the Exalted favored His servant Moses (عليه السلام) by meeting him and being disciplined by him. Thus, for the Muhammadan, it produced a branch of a branch of a branch whose origin is what is the origin for Al-Khidr, and Moses (عليه السلام) sought to learn from him the knowledge he possessed. Look at the distinction of the station of this Muhammadan Gnostic (العارف المحمدي). How then can you grasp what is produced by the Origin to which these branches return?\n\n### The Love of Favor and the Love of Recompense\n\nThe Messenger of Allah (صلى الله عليه وسلم) said, relating from his Lord: <<إِنَّ اللهَ يَقُولُ مَا تَقَرَّبَ إِلَيَّ الْمُتَقَرِّبُونَ بِأَحَبَّ إِلَيَّ مِنْ أَدَاءِ مَا افْتَرَضْتُهُ عَلَيْهِمْ>> (Indeed, Allah says: 'My servants do not draw near to Me with anything more beloved to Me than the performance of what I have made obligatory upon them').\n\nThis is the Origin (الأصل): the performance of the obligatory duty (أداء الفرض). Then He said: \"And My servant continues to draw near to Me with supererogatory acts (النوافل),\" which are what is added to the obligatory duties, but are of the same kind—such as supererogatory acts of goodness (نوافل الخيرات) like prayer, charity, fasting, pilgrimage, and remembrance. This is the branch closest to the Origin. Then, this action, which is supererogatory, produces Allah's love for him, which is a special love of recompense (محبة خاصة جزاء), distinct from the love of favor (محبة الامتنان). The original love of favor is shared by all people of felicity (أهل السعادة) with Allah the Exalted, and it is what enabled them to draw near to Allah through supererogatory acts of goodness. Then, this Love, which is the second branch and is like the flower, produced for him that The Real (الحق) becomes his hearing, his sight, his hand, and so forth. This is the third branch, which is like the fruit that sets after the flower. At that point, the servant hears by The Real, speaks by Him, sees by Him, strikes by Him, and perceives by Him. This is a special Divine Revelation (وحي خاص إلهي) granted to him in this station; the Angel (الملك) has no mediation in it from Allah. For this reason, Al-Khidr said to Moses (عليه السلام): <<مَا لَمْ تُحِطْ بِهِ خُبْراً>> (That which you have not encompassed with knowledge). For the revelation of the Messengers (الرسل) is only through the Angel between Allah and His Messenger. Thus, the Messenger has no knowledge (خبر) of this direct tasting (الذوق) in the very act of executing judgment in the world of witnessing (عالم الشهادة). The sending of Messengers (الإرسال) for the legislation of Divine rulings in the world of witnessing only occurs through the mediation of the Spirit (الروح) that descends upon his heart, or through the Angel's representation of himself. The Messenger only knows the Law (الشريعة) in this manner, and not otherwise. The Messenger has the proximity of performing the obligatory duty and the love from Allah based on it, and what that love produces. He also has the proximity of the supererogatory acts and the love for them, and what the love for them grants him—but this is from the knowledge of Allah (العلم بالله), not from the knowledge of legislation (علم التشريع) and the execution of judgment in the world of witnessing. Thus, he did not encompass it with knowledge (لم يحط به خبرا) in this specific respect. This is the extent to which Al-Khidr was distinguished from Moses (عليه السلام).\n\n### Prophethood of Definition and Prophethood of Legislation\n\nIt is from this chapter that the Muhammadan Gnostic (المحمدي) judges, even if he has no prior knowledge of the Law (الشريعة) through transmission (النقل), the study of jurisprudence (الفقه) and Hadith, or knowledge of legal rulings (الأحكام الشرعية). The possessor of this station speaks with the knowledge of the legislated ruling exactly as it is in the revealed Law (الشرع المنزل) from this Presence (الحضرة). He is not one of the Messengers (الرسل); rather, it is a Divine Definition (تعريف إلهي) and an infallibility (عصمة) granted by this station, into which the Prophetic Mission (الرسالة) has no entry. This is the meaning of His saying: <<مَا لَمْ تُحِطْ بِهِ خُبْراً>> (That which you have not encompassed with knowledge). For the Messenger does not receive this ruling except by the descent of the Trustworthy Spirit (الروح الأمين) upon his heart, or by an example in his witnessing where the Angel represents himself as a man. Since Prophethood (النبوة) and the Prophetic Mission (الرسالة) were prevented after the Messenger of Allah (صلى الله عليه وسلم), the Definition (التعريف) for this person concerning what the Muhammadan Law is in the world of witnessing remains. If he had been in the time of legislation, as was the time of Moses, the ruling would have appeared from this Saint (الولي), just as it appeared from Al-Khidr, without the mediation of an Angel, but directly from the Presence of Proximity (حضرة القرب). The Messenger and the Prophet have the Presence of Proximity just as this person does, but legislation does not come to them from it. Rather, legislation only comes to them through the mediation of the Angel, the Spirit. The only remaining question is: If a later Prophet receives a law from a preceding Prophet that is also a law for him, does he receive it through the mediation of the Spirit, like the rest of his law, or does he receive it as Al-Khidr and this Saint among us received it, from the Presence of Revelation (حضرة الوحي)? My doctrine (مذهبي) is that he only receives it as he receives what is specific to his own laws. This is so that the trustworthy, just authority may be confirmed in his saying: \"That which you have not encompassed with knowledge.\" We know of no disputant or opponent among the people of our path regarding what we have mentioned, nor have we encountered one. However, if someone from our path were to oppose us in this, the opposition could only come from one of two types of men: Either a man of Allah (أهل الله) who confused the matter and made the Divine Definition a ruling, thus permitting that the Prophet or Messenger could receive it similarly, but only within this Community (الأمة)—whereas in the former time, it was necessarily a ruling for its possessor and a definition for the Messenger, through the mediation of the Angel, that this was a law for others. The second type of man is one who applies analogical reasoning (قاس الحكم) based on reports. Other than these two, there is no possibility. Despite this, no opposition or agreement regarding what we have mentioned has reached us from any of them.\n\n### The Problem of Divine Attributes and Names\n\nAmong the principles of this class (الطبقة) is also that they speak by that by which they hear, and no one else speaks by this from the perspective of direct tasting (الذوق). However, one who speaks by it from the perspective of rational proof (الدليل العقلي) may say it. These [Riders] take it from a Divine Theophany (تجل إلهي), while others take it from sound speculation (نظر صحيح) that conforms to the matter as it truly is, which is The Real (الحق). The difference lies in the path (الطريق). This path is different from that path, even if they agree on the destination, which is the goal. He is the Hearer for Himself, the Seer for Himself, the Knower for Himself, and so on, with everything by which you name Him, describe Him (تصفه), or characterize Him (تنعته)—if you are one of those who commit a breach of etiquette (يسيء الأدب) with Allah by applying the term \"attribute\" (صفة) or \"characterization\" (نعت) to what is ascribed to Him. For He only applied the term \"Name\" (اسم) to that, saying: <<سَبِّحِ اسْمَ رَبِّكَ>> (Glorify the Name of your Lord), and <<تَبَارَكَ اسْمُ رَبِّكَ>> (Blessed is the Name of your Lord), and <<وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَى فَادْعُوهُ بِهَا>> (And to Allah belong the Most Beautiful Names, so call upon Him by them). And concerning the polytheists, He said: <<قُلْ سَمُّوهُمْ>> (Say: Name them), and He did not say \"describe them\" or \"characterize them.\" Rather, He said: <<سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ>> (Glory be to your Lord, the Lord of Might, above what they describe). Thus, He purified Himself from the term \"description\" (الوصف), both in wording and meaning, if you are among the people of etiquette (الأدب) and discernment. This is the meaning of my saying: \"if you are one of those who commit a breach of etiquette with Allah.\"\n\n### The Doctrine of the Ash'aris concerning the Essence and Attributes\n\nThose who oppose us say that He knows by Knowledge (علم), wills by Power (قدرة), sees by Sight (بصر), and so on, with all that He names Himself, except for the attributes of transcendence (صفات التنزيه), which they do not discuss in this manner, such as Richness (الغني) and its likes. However, some of them made all of that meanings subsisting in the Divine Essence (الذات), which are neither the Essence itself nor other than it, but are entities (أعيان) added to His Essence. Master Abu Ishaq [al-Isfara'ini] made the seven [classical attributes] principles (أصول), not entities added to His Essence, by which His Essence is characterized. He made every Name (اسم) correspond to what its indication requires. Thus, he placed all the attributes of transcendence in the category of the Name *The Living* (الحي), and placed *The All-Aware* (الخبير), *The Reckoner* (الحسيب), *The All-Knowing* (العليم), *The Counter* (المحصي), and their sisters in the category of Knowledge (العلم). He placed the Name *The Thankful* (الشكور) in the category of Speech (الكلام), and so on. The truth is that every one of the seven attributes has the Names appropriate to it in meaning, such as *The Creator* (الخالق) and *The Provider* (الرازق) belonging to Power (القدرة), and so forth, following this method. This is the doctrine of the Master [Abu Ishaq]. The Ash'ari theologians (المتكلمون من الأشاعرة) unanimously agreed that there are matters added to the Essence (الذات), and they established proofs for this. Yet, despite their consensus on the added element (الزائد), they found no conclusive proof as to whether this addition to the Essence is a single entity (عين واحدة) with different rulings—though it must necessarily be an addition—or whether this addition consists of multiple entities (أعيان متعددة). Their most skilled scholars said nothing definitive about this, though some said it is possible that the matter itself returns to a single entity, and it is possible that it returns to different entities, but it must necessarily be an addition. The only benefit brought by this theologian is the absence of arbitrary control, for if the Essence accepts one added entity, it is permissible for it to accept many added entities to its Essence, such that the Eternals (القدماء) are countless in number. This is the doctrine of Abu Bakr ibn al-Tayyib [al-Baqillani]. The dispute over this is lengthy. Our path is not built upon this—I mean, in refuting them and disputing with them. Rather, our path is to clarify the sources (مآخذ) of every group, and from where they derived their doctrine, and what was unveiled (تجلى) to them, and whether that affects their felicity or not. This is the share of the people of Allah's path in the Knowledge of Allah (العلم بالله). We do not busy ourselves with refuting any of Allah's creation. Rather, we may even offer excuses for them due to the Divine Vastness (الاتساع الإلهي), for Allah offered an excuse for those who call upon another god alongside Allah, provided they have a proof that they believe to be evidence, as the Mighty Speaker said: <<وَمَنْ يَدْعُ مَعَ اللهِ إِلَهاً آخَرَ لَا بُرْهَانَ لَهُ بِهِ>> (And whoever calls upon another god alongside Allah, for which he has no proof).\n\n### Good and Evil and their Attribution to Allah\n\nAmong their principles is also proper etiquette (الأدب) with Allah the Exalted. They only name Him by what He named Himself, and they only attribute to Him what He attributed to Himself. As the Exalted said: <<مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللهِ>> (Whatever good befalls you is from Allah), and concerning evil (السيئة), He said: <<وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ>> (And whatever evil befalls you is from yourself). Then He said: <<قُلْ كُلٌّ مِنْ عِنْدِ اللهِ>> (Say: All is from Allah). He said this when combining the two matters; do not say \"from Allah.\" So observe the wording, and know that the reality of combining a matter differs from the reality of each singular matter when it is isolated and not combined with another—like the blackness of ink derived from gallnuts and vitriol. The Exalted separated what is *from Him* (منه) and what is *with Him* (من عنده). The Exalted says concerning a specific group: <<وَاللهُ خَيْرٌ وَأَبْقَى>> (And Allah is better and more lasting), using the comparative form, and there is no comparison [to Him]. And He said concerning another specific group and their quality: <<وَمَا عِنْدَ اللهِ خَيْرٌ وَأَبْقَى>> (And what is with Allah is better and more lasting). What is *with Him* is not the essence of what is *from Him*, nor the essence of His Identity (هويته). Thus, He distinguished between the two groups as He distinguished between the two stations. As it was said to one man: \"What have you left for your family?\" He replied: \"Allah and His Messenger.\" And it was said to another, who replied: \"Half of my wealth.\" It was said: \"Between the two of you is the distance between your two words,\" meaning in rank. When the servant takes everything other than Allah, he makes it \"better and more lasting in Allah.\" And when he takes it from an aspect of the world that necessitates veiling, distance, and blame, he makes it \"what is with Allah is better and more lasting.\" Thus, he distinguishes the Levels (المراتب). Furthermore, the Exalted informed us about the people of etiquette and their station in the Knowledge of Him, saying about His intimate friend Abraham (إبراهيم خليله) that he said: <<الَّذِي خَلَقَنِي فَهُوَ يَهْدِينِ * وَالَّذِي هُوَ يُطْعِمُنِي وَيَسْقِينِ>> (He who created me, He guides me, * And He who feeds me and gives me drink). He did not say \"makes me hungry.\" And <<وَإِذَا مَرِضْتُ>> (And when I am sick), and he did not say \"He makes me sick,\" <<فَهُوَ يَشْفِينِ>> (He heals me). So he attributed healing to Him and sickness to himself, even though all is from Him (من عنده). However, the Exalted disciplined His Messengers, since sickness is not accepted by souls, unlike death. For the virtuous among the wise Gnostics seek death to escape this prison, and the Prophets seek it for the encounter with Allah (لقاء الله) that it entails, as do the people of Allah. For this reason, no Prophet was given a choice regarding death except that he chose it, because it contains the encounter with Allah, and thus it is a favor and a grace from Him upon him. Sickness, however, is a preoccupation that distracts the servant from performing the rights of Allah that He has made obligatory, due to the sensation of pain. The servant is in the place of responsibility (التكليف), and only the animal spirit (الروح الحيواني) feels pain, distracting the spirit that governs his body from what he was called to in this world. For this reason, he attributed sickness to himself and healing and death to The Real (الحق), just as the companion of Moses (عليه السلام) did in attributing the scuttling of the ship to himself, since he made the scuttling a defect (عيبا), and attributed the killing of the boy to himself and to his Lord, due to the mercy it contained for his parents. What displeased them in that, he attributed to himself, and he attributed the setting up of the wall to his Lord, due to the righteousness and good it contained. The Exalted said, concerning His servant Al-Khidr regarding the scuttling of the ship: <<فَأَرَدْتُ أَنْ أَعِيبَهَا>> (So I intended to make it defective), in purification (تنزيها) from attributing to the High Presence (الجناب العالي) what is outwardly blameworthy in custom and habit. And concerning the setting up of the wall, since he made its setting up a mercy for the two orphans due to the good they would receive, which was the treasure (الكنز), He said: <<فَأَرَادَ رَبُّكَ>> (So your Lord intended)—informing Moses (عليه السلام)—<<أَنْ يَبْلُغَا أَشُدَّهُمَا وَيَسْتَخْرِجَا كَنزَهُما رَحْمَةً مِنْ رَبِّكَ>> (That they should reach their maturity and extract their treasure, as a mercy from your Lord). And He said to Moses concerning the boy, that he was created a disbeliever (كافرا), and disbelief is a blameworthy attribute. The Exalted said: <<وَلَا يَرْضَى لِعِبَادِهِ الْكُفْرَ>> (And He is not pleased with disbelief for His servants). And He intended to inform him that Allah would replace him for his parents with <<خَيْراً مِنْهُ زَكَاةً وَأَقْرَبَ رُحْماً>> (One better than him in purity and nearer to mercy). So, intending to attribute what was defective in the matter, in the view of Moses (عليه السلام)—who considered it a reprehensible act (نكرا) and the killing of an innocent soul (نفسا زاكية) without cause—He said: <<فَأَرَدْنَا أَنْ يُبْدِلَهُمَا رَبُّهُمَا>> (So We intended that their Lord should replace him for them). He used the plural pronoun \"We\" (نون الجمع). For in the killing there were two matters: one leading to good, and one leading to the opposite in the view of Moses and in common custom. Whatever good was in this action belongs to Allah, by virtue of the pronoun \"We.\" And whatever reprehensible aspect it had outwardly, and in the view of Moses at that time, belonged to Al-Khidr, by virtue of the pronoun \"We.\" The plural pronoun \"We\" (نون الجمع) thus has two faces, due to the combination it contains: one face toward the good, by which the matter is attributed to Allah, and one face toward the defect, by which the defect is attributed to himself. He placed this matter and incident in the middle, not at the end, between the ship and the wall, so that the defect in it would align with the side of the ship, and the good in it would align with the side of the wall. The wisdom was thus established. If you ask: Why did he combine Allah and himself in the plural pronoun \"We\" (نون) in <<فَأَرَدْنَا>> (So We intended), while the Prophet (صلى الله عليه وسلم), upon hearing a preacher combine Allah the Exalted and the Messenger of Allah (صلى الله عليه وسلم) in a single pronoun in his saying, \"And whoever disobeys them both (ومن يعصهما),\" said: \"What a bad preacher you are!\"\n\nKnow that this falls under the principle we established: that nothing is attributed to The Real (الحق) except what The Real attributed to Himself, or what His Messenger commanded, or what was given to one who received knowledge from His Presence (علما من لدنه), like Al-Khidr, who is explicitly mentioned. This is from that chapter. Since that preacher was devoid of Ladunni Knowledge (العلم اللدني) and the Messenger of Allah (صلى الله عليه وسلم) had not previously permitted such a thing, he censured him, saying: \"What a bad preacher you are!\" For he should not have combined The Real and Creation in a single pronoun except by Divine permission from a Messenger or by Ladunni Knowledge. Since he possessed neither of these two things, the Messenger of Allah (صلى الله عليه وسلم) censured him. Yet, the Messenger of Allah (صلى الله عليه وسلم) himself said in a sermon we narrated from him, in which he mentioned Allah the Exalted and mentioned himself (صلى الله عليه وسلم), and then combined his Lord the Exalted and himself in a single pronoun, saying: <<مَنْ يُطِعِ اللهَ وَرَسُولَهُ فَقَدْ رَشَدَ وَمَنْ يَعْصِهِمَا فَلَا يَضُرُّ إِلَّا نَفْسَهُ وَلَا يَضُرُّ اللهَ شَيْئاً>> (Whoever obeys Allah and His Messenger has been guided, and whoever disobeys them both harms only himself and does not harm Allah at all).\n\nAnd he (صلى الله عليه وسلم) <<وَمَا يَنْطِقُ عَنِ الْهَوَى * إِنْ هُوَ إِلَّا وَحْيٌ يُوحَى>> (Does not speak from [his own] desire, * It is nothing but a revelation revealed). Similarly, Al-Khidr said: <<وَمَا فَعَلْتُهُ عَنْ أَمْرِي>> (And I did not do it of my own accord)—meaning all the actions he performed and all the words he spoke in his explanation to Moses (عليه السلام) concerning them. So understand.\n\n### The Riders are Desired, not Desirers\n\nBy this, I have sufficiently clarified their principles for you. The Riders (الركبان) are the Desired ones (المرادون), the Divinely Attracted ones (المجذوبون), whose secrets (أسرارهم) are preserved in shells, so no air penetrates them, like the secluded, modest-eyed maidens (القاصرات الطرف من الحور) confined in tents: <<كَأَنَّهُنَّ بَيْضٌ مَكْنُونٌ>> (As if they were eggs carefully protected).\n\n### The Qualities of the Riders\n\nAmong their qualities is that they do not uncover their faces when sleeping, and they only sleep on their backs. They possess reception (التلقي). They do not move except by Divine command, and they do not rest except similarly, by a will that is willed for them (بإرادة إرادتهم ما يراد بهم). Since stillness (السكون) is a matter of non-existence (أمر عدمي), we coupled it with Will (الإرادة) rather than Command (الأمر). Since movement (التحرك) is a matter of existence (أمر وجودي), we coupled it with Divine Command (الأمر الإلهي)—if you understand. They (رضي الله عنهم) neither crowd others nor are they crowded. The phrase most often on their tongues is: \"What Allah willed (ما شاء الله).\" The clouds are subjugated to them. They possess the firm footing (القدم الراسخة) in the knowledge of the unseen realms (علم الغيوب). They have a spiritual ascension (معراج روحاني) every night, indeed, in every sleep, whether by night or day. They have an outlook upon the inner aspects of the World (بواطن العالم), seeing the dominion of the heavens and the earth. Allah the Exalted says: <<وَكَذَلِكَ نُرِي إِبْرَاهِيمَ مَلَكُوتَ السَّمَاوَاتِ وَالْأَرْضِ وَلِيَكُونَ مِنَ الْمُوقِنِينَ>> (And thus did We show Abraham the dominion of the heavens and the earth that he might be among the certain [in faith]). And concerning the Messenger of Allah (صلى الله عليه وسلم), He said: <<سُبْحَانَ الَّذِي أَسْرَى بِعَبْدِهِ لَيْلاً مِنَ الْمَسْجِدِ الْحَرَامِ إِلَى الْمَسْجِدِ الْأَقْصَى الَّذِي بَارَكْنَا حَوْلَهُ لِنُرِيَهُ مِنْ آيَاتِنَا>> (Exalted is He who took His servant by night from the Sacred Mosque to the Farthest Mosque, whose surroundings We have blessed, to show him some of Our signs). This is the very essence of his Night Journey (إسرائه). The scholars are the inheritors of the Prophets. Their state is concealment (الكتمان). Even if they were cut limb from limb, what they possess would not be known. For this reason, Al-Khidr said: <<مَا فَعَلْتُهُ عَنْ أَمْرِي>> (I did not do it of my own accord). Concealment is one of their principles, unless they are commanded to disclose and announce. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "(اکتیسواں باب: سواروں کے اصول کی معرفت میں)\n\nزمانہ ہم پر جھکا اور مہربان ہوا، اور اپنے حکم میں چلتا رہا اور سستی نہ کی۔\nاور ہم نے اس سے عشق کیا تو گیت گائے، شاید زمانہ گانے کی لے پر جھوم اٹھے۔\nہم نے تجھے اپنے نفسوں میں حاکم بنایا، تو اب حکم کر، چاہے ہمارے حق میں یا ہمارے خلاف۔\nاور حکم تو اسی کا تھا، اور وہ حکم زمانے کا ہم پر نہ تھا۔\nپس میرا شفیع میرا زمانہ ہے، اور جس نے زمانے کو یوں پھیرا، اسی نے ہمیں پھیرا۔\nتو ہم سوار ہوئے، اس اصل کی تلاش میں جس نے ہمارے پاس راز کو ظاہر کر دیا۔\nپس اس میں سے ہمیں وہ ملا جس نے ہمیں حرکت دی، اور اس کے لیے ہم میں سے وہ ہے جس نے ہمیں ساکن کیا۔\nزمانے کی حرکتیں ہم میں گواہ ہیں کہ اس نے اس سے کہا: جو کچھ ہم نے ساکن کیا ہے۔\nپس میں عاجز، چنا ہوا بندہ ہوں، اور میں ذات حق (الحق) ہوں، مگر ذات حق (الحق) میں نہیں ہوں۔\n\n### [حرکت سے براءت]\n\nاللہ تعالیٰ تمہاری تائید کرے، جان لو کہ وہ اصول جن پر سواروں (الرکبان) نے بھروسہ کیا ہے، بہت سے ہیں۔ ان میں سے ایک یہ ہے کہ جب انہیں حرکت میں لایا جائے تو وہ حرکت سے براءت (التبري) اختیار کرتے ہیں۔ اسی لیے وہ سوار ہوئے، پس وہ اپنی سواریوں پر ساکن ہیں، جو ان کی سواریوں کے چلانے سے حرکت کرتے ہیں۔ وہ اس مسافت کو کاٹتے ہیں جس کے کاٹنے کا انہیں حکم دیا گیا ہے، مگر اپنے ذریعے نہیں بلکہ اپنے غیر کے ذریعے۔ پس وہ حرکت کی مشقت سے حاصل ہونے والی تھکاوٹ سے راحت پاتے ہوئے پہنچتے ہیں، اور اس دعویٰ (الدعوى) سے براءت اختیار کرتے ہیں جو حرکت سے پیدا ہوتا ہے۔ یہاں تک کہ اگر وہ کم وقت میں لمبی مسافتیں طے کرنے پر فخر کریں تو وہ فخر اس سواری کی طرف لوٹے گا جس نے انہیں وہ مسافت طے کرائی، نہ کہ ان کی طرف۔ پس ان کے لیے براءت ہے اور ان کے لیے دعویٰ نہیں۔ ان کا ورد لا حول ولا قوة إلا بالله (اللہ کی مدد کے بغیر نہ کوئی طاقت ہے اور نہ کوئی قوت) ہے، اور ان کی آیت یہ ہے:\nوَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَىٰ\n(اور جب تم نے پھینکا تو تم نے نہیں پھینکا، بلکہ اللہ نے پھینکا)۔\nان سے کہا جاتا ہے کہ جب تم نے یہ مسافتیں طے کیں تو تم نے انہیں طے نہیں کیا، بلکہ سواریوں نے انہیں طے کیا، پس تم تو اٹھائے ہوئے ہو۔ لہٰذا بندے کے لیے اپنے آقا کے اختیار کے بغیر کوئی قوت نہیں، اور اس کے لیے اپنی ذات کی طرف سے ذلت، عجز، کمزوری اور ضعف ہے۔ اور جب انہوں نے دیکھا کہ اللہ تعالیٰ نے اپنے اس قول سے متنبہ فرمایا ہے:\nوَلَهُ مَا سَكَنَ\n(اور جو کچھ ساکن ہے وہ اسی کا ہے)\nتو انہوں نے اسے صرف اللہ کے لیے خالص کر دیا، اور جان لیا کہ حرکت میں دعویٰ (الدعوى) ہے اور سکون (السكون) میں کوئی دعویٰ شامل نہیں، کیونکہ یہ حرکت کی نفی ہے۔ پس انہوں نے کہا کہ اللہ نے ہمیں اس معنوی مسافت کو طے کرنے کا حکم دیا ہے، یعنی ان ہلاک کرنے والے بیابانوں کو اس کی طرف عبور کرنا۔ اگر ہم انہیں اپنے نفسوں کے ذریعے طے کریں گے تو ہم اپنے نفسوں کے بارے میں اس بات سے محفوظ نہیں رہیں گے کہ ہم مقام اتصال میں اس پر فخر کرنے لگیں، کیونکہ نفس رعونت، سبقت طلبی اور فخر کی محبت پر جبلت کیے گئے ہیں۔ پس ہم اس مقام میں اس قدر نقص والے ہو جائیں گے جس قدر اس جلال اعظم (الجلال الأعظم) کا احترام کرنا چاہیے۔\n\n### [حوقلہ (لا حول ولا قوة إلا بالله) افراد کے نجیب اونٹ]\n\nپس ہم ایک سواری اختیار کرتے ہیں جس کے ذریعے ہم مسافت طے کریں، تاکہ اگر وہ فخر کرنا چاہے تو فخر سواری کے لیے ہو نہ کہ نفسوں کے لیے۔ چنانچہ انہوں نے لا حول ولا قوة إلا بالله (اللہ کی مدد کے بغیر نہ کوئی طاقت ہے اور نہ کوئی قوت) کو نجیب اونٹ (نجباً) بنایا، کیونکہ نجیب اونٹ گھوڑوں اور دیگر سواریوں کے مقابلے میں پانی اور چارے پر زیادہ صبر کرنے والے ہوتے ہیں، اور راستہ بہت پیاسا کرنے والا اور خشک ہوتا ہے، جس میں وہ سواریاں ہلاک ہو جاتی ہیں جنہیں نجیب اونٹوں کا مرتبہ حاصل نہیں ہوتا۔ اسی لیے انہوں نے اسے نجیب اونٹ بنایا، نہ کہ کسی اور سواری کو جو سواری کے لیے تو درست ہو مگر اس مسافت کو طے کرنے کے لیے درست نہ ہو۔ الحمد لله (تمام تعریفیں اللہ کے لیے ہیں) نہیں، کیونکہ یہ ذکر وصول (الوصول) کی خصوصیات میں سے ہے، اور نہ سبحان الله (اللہ پاک ہے)، کیونکہ یہ ظہور الٰہی (التجلی) کی خصوصیات میں سے ہے، اور نہ لا إله إلا الله (اللہ کے سوا کوئی معبود نہیں)، کیونکہ یہ دعووں (الدعاوي) کی خصوصیات میں سے ہے، اور نہ اللہ أكبر (اللہ سب سے بڑا ہے)، کیونکہ یہ فضیلت دینے (المفاضلة) کی خصوصیات میں سے ہے۔ پس لا حول ولا قوة إلا بالله (اللہ کی مدد کے بغیر نہ کوئی طاقت ہے اور نہ کوئی قوت) متعین ہوا، کیونکہ یہ اعمال (الأعمال) کی خصوصیات میں سے ہے، خواہ وہ عمل ہو یا قول، ظاہر ہو یا باطن۔ اس لیے کہ انہیں اعمال کا حکم دیا گیا ہے، اور سفر دل اور بدن، معنی اور حس کے اعتبار سے عمل ہے۔ اور یہ لا حول ولا قوة إلا بالله کے ساتھ مخصوص ہے، کیونکہ اسی کے ذریعے وہ لا إله إلا الله کہتے ہیں، اور اسی کے ذریعے ہم سبحان الله اور دیگر تمام اقوال و اعمال کہتے ہیں۔\n\n### [افراد کے انتخاب کا مرکز 'سکون']\n\nاور چونکہ سکون (السكون) حرکت کا عدم ہے، اور عدم (العدم) ان کی اصل ہے، کیونکہ یہ اللہ کا قول ہے:\nوَقَدْ خَلَقْتُكَ مِن قَبْلُ وَلَمْ تَكُ شَيْئًا\n(حالانکہ میں نے تمہیں اس سے پہلے پیدا کیا تھا اور تم کوئی چیز نہ تھے)\nیعنی موجود نہ تھے۔ پس انہوں نے حرکت پر سکون کو ترجیح دی، اور یہ اصل پر قائم رہنا ہے۔ چنانچہ اللہ سبحانہ و تعالیٰ نے اپنے قول:\nوَلَهُ مَا سَكَنَ فِي اللَّيْلِ وَالنَّهَارِ\n(اور جو کچھ رات اور دن میں ساکن ہے وہ اسی کا ہے)\nمیں متنبہ فرمایا کہ مخلوق نے عدم (العدم) کو اس کے سپرد کر دیا اور وجود (الوجود) میں اس کے لیے دعویٰ کیا۔ پس حقائق (الحقائق) کے باب سے، ذات حق (الحق) نے اپنی مخلوق کو اس آیت میں اس چیز کی نسبت سے پاک کر دیا جس کا انہوں نے اپنے لیے دعویٰ کیا تھا، اپنے قول:\nوَلَهُ مَا سَكَنَ فِي اللَّيْلِ وَالنَّهَارِ\n(اور جو کچھ رات اور دن میں ساکن ہے وہ اسی کا ہے)\nکے ذریعے، یعنی جو ثابت ہوا۔ اور ثبوت ایک وجودی، عقلی امر ہے، نہ کہ عینی، بلکہ نسبی ہے۔\nوَهُوَ السَّمِيعُ الْعَلِيمُ\n(اور وہ سننے والا، جاننے والا ہے)\nوہ تمہارے دعوے کو سنتا ہے کہ تم اس چیز کو اپنی طرف منسوب کرتے ہو جو اس کی ہے، اور وہ جانتا ہے کہ معاملہ اس کے خلاف ہے جس کا تم نے دعویٰ کیا۔\n\n### [ذات حق کی توحید، لسان حق کے ذریعے]\n\nاور ان کے اصول میں سے توحید (التوحید) ہے اس زبان کے ذریعے جس سے وہ بولتا ہے، اور اس کان کے ذریعے جس سے وہ سنتا ہے، اور اس آنکھ کے ذریعے جس سے وہ دیکھتا ہے۔ اور یہ مقام صرف اعمال کے فروع (النوافل) سے حاصل ہوتا ہے، کیونکہ یہ فروع الٰہی محبت (المحبة الإلهية) پیدا کرتی ہیں، اور محبت بندے کو یہ وراثت دیتی ہے کہ وہ اس صفت سے متصف ہو جائے۔ پس یہ صفت بندوں کے اس گروہ کے لیے ایک اصل (أصل) بن جاتی ہے، اس علم کے بارے میں جو وہ جانتے ہیں اور خضر (علیہ السلام) کے احکام اور ان کے علم سے جو فیصلے کرتے ہیں۔ پس یہ ایک اکتسابی اصل (أصل مكتسب) ہے، اور خضر کے لیے یہ اس رحمت کے ذریعے الٰہی عنایت کی اصل ہے جو اللہ نے انہیں عطا کی، اور اسی رحمت سے انہیں وہ علم حاصل ہوا جسے موسیٰ (علیہ السلام) نے ان سے سیکھنے کی درخواست کی۔ اگر تم اس معاملے پر غور کرو جو ہم نے بیان کیا ہے تو تم اس محمدی ملت اور امت کی ولایت کے مقام اور مرتبے کو جان لو گے، اور یہ کہ اس کی اصل کے فروع کا پھل جو عام لوگوں کے لیے مشروع ہے، وہی خضر کی اصل ہے جس کے ذریعے اللہ تعالیٰ نے اپنے بندے موسیٰ (علیہ السلام) پر ان سے ملاقات اور ان کے ذریعے ادب سکھانے کا احسان فرمایا۔ پس محمدی عارف کے لیے اس اصل کا فرع، پھر فرع، پھر فرع پیدا ہوا جو خضر کے لیے اصل ہے۔ اور موسیٰ (علیہ السلام) جیسا پیغمبر ان سے یہ علم سیکھنے کی درخواست کرتا ہے جو ان کے پاس ہے۔ پس دیکھو کہ اس محمدی عارف کا مرتبہ کہاں ممتاز ہوا! تو پھر تمہارے لیے کیا ہوگا جو اس اصل سے پیدا ہوتا ہے جس کی طرف یہ فروع لوٹتے ہیں؟\n\n### [احسان کی محبت اور جزا کی محبت]\n\nرسول اللہ صلی اللہ علیہ وسلم نے اپنے رب سے روایت کرتے ہوئے فرمایا:\nإِنَّ اللَّهَ يَقُولُ مَا تَقَرَّبَ إِلَيَّ الْمُتَقَرِّبُونَ بِأَحَبَّ إِلَيَّ مِنْ أَدَاءِ مَا افْتَرَضْتُهُ عَلَيْهِمْ\n(اللہ تعالیٰ فرماتا ہے کہ متقی لوگ میرے نزدیک کسی ایسی چیز سے تقرب حاصل نہیں کرتے جو ان فرائض کی ادائیگی سے زیادہ محبوب ہو جو میں نے ان پر فرض کیے ہیں)۔\nپس یہ اصل ہے: فرض کی ادائیگی۔ پھر فرمایا:\nوَلَا يَزَالُ الْعَبْدُ يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ\n(اور میرا بندہ نوافل کے ذریعے مجھ سے قریب ہوتا رہتا ہے)\nاور نوافل وہ ہیں جو فرائض پر زیادہ ہیں، لیکن ان کی جنس سے ہیں۔ یہاں تک کہ فرائض ان کے لیے اصل بن جاتے ہیں، جیسے نماز، زکوٰۃ، روزہ، حج اور ذکر کے نوافل۔ پس یہ اصل کے قریب ترین فرع ہے۔ پھر یہ عمل جو کہ نفل ہے، اس کے لیے اللہ کی محبت پیدا کرتا ہے، اور یہ ایک خاص جزا کی محبت ہے، نہ کہ احسان کی محبت (محبة الامتنان)۔ کیونکہ اصل احسان کی محبت میں اللہ کے نزدیک تمام اہل سعادت شریک ہیں، اور یہی وہ محبت ہے جس نے ان لوگوں کو نوافل کے ذریعے اللہ کا قرب حاصل کرنے کی توفیق دی۔ پھر یہ محبت، جو کہ دوسرا فرع ہے اور پھول (زهرة) کے مرتبے میں ہے، اس کے لیے یہ نتیجہ پیدا کرتی ہے کہ ذات حق (الحق) اس کی سماعت، بصارت اور ہاتھ بن جاتا ہے، وغیرہ۔ اور یہ تیسرا فرع ہے، جو پھول کے ساتھ لگنے والے پھل (ثمرة) کے مرتبے میں ہے۔ اس وقت بندہ ذات حق (الحق) کے ذریعے سنتا ہے، اس کے ذریعے بولتا ہے، اس کے ذریعے دیکھتا ہے، اس کے ذریعے پکڑتا ہے اور اس کے ذریعے ادراک کرتا ہے۔ اور یہ ایک خاص الٰہی وحی ہے جو اسے یہ مقام عطا کرتی ہے، اس میں فرشتے کی کوئی وساطت نہیں ہوتی۔ اسی لیے خضر نے موسیٰ (علیہ السلام) سے کہا:\nمَا لَمْ تُحِطْ بِهِ خُبْرًا\n(جس کا تم احاطہ نہیں کر سکتے)۔\nکیونکہ رسولوں کی وحی اللہ اور رسول کے درمیان فرشتے کی وساطت سے ہوتی ہے۔ پس عالم شہادت میں حکم نافذ کرنے کے عین وقت میں اس ذوق کی کوئی خبر نہیں ہوتی۔ کیونکہ عالم شہادت میں الٰہی احکام کی تشریع کے لیے ارسال (رسالت) صرف اس روح کی وساطت سے ہوتا ہے جو اس کے دل پر نازل ہوتی ہے، یا اس کی تمثیل میں۔ رسول شریعت کو صرف اسی وصف پر جانتا ہے، نہ کہ شریعت کے علاوہ۔ کیونکہ رسول کو فرض کی ادائیگی کا قرب حاصل ہے اور اس پر اللہ کی طرف سے محبت حاصل ہے، اور جو کچھ وہ محبت پیدا کرتی ہے۔ اور اسے نوافل کا قرب حاصل ہے اور ان کی محبت حاصل ہے، اور جو کچھ اس کی محبت عطا کرتی ہے، لیکن یہ علم اللہ کے بارے میں ہوتا ہے، نہ کہ علم تشریع اور عالم شہادت میں حکم نافذ کرنے کے بارے میں۔ پس موسیٰ (علیہ السلام) نے اس قسم کی خبر کا احاطہ نہیں کیا تھا۔ پس یہ وہ مقدار ہے جو خضر کے لیے موسیٰ (علیہ السلام) کے مقابلے میں خاص تھی۔\n\n### [تعریف کی نبوت اور تشریع کی نبوت]\n\nاور اسی باب سے وہ محمدی عارف حکم لگاتا ہے جسے نقل، فقہ اور حدیث پڑھنے اور شرعی احکام کی معرفت کے ذریعے شریعت کا علم پہلے سے حاصل نہیں ہوتا۔ پس اس مقام کا حامل شخص اس الٰہی حضور سے نازل ہونے والی شریعت کے مطابق مشروع حکم کے علم کے ساتھ بولتا ہے، اور وہ رسولوں میں سے نہیں ہوتا۔ بلکہ یہ ایک الٰہی تعریف (تعریف إلهي) اور عصمت ہے جو یہ مقام عطا کرتا ہے، اس میں رسالت کا کوئی دخل نہیں۔ پس یہ اس قول کا معنی ہے:\nمَا لَمْ تُحِطْ بِهِ خُبْرًا\n(جس کا تم احاطہ نہیں کر سکتے)۔\nکیونکہ رسول یہ حکم صرف روح الامین کے اپنے دل پر نازل ہونے یا اس کے مشاہدے میں فرشتے کے انسان کی صورت میں متمثل ہونے سے حاصل کرتا ہے۔ اور چونکہ رسول اللہ صلی اللہ علیہ وسلم کے بعد نبوت اور رسالت دونوں روک دی گئی ہیں، اس لیے اس شخص کے لیے یہ تعریف (تعریف) اس بات کی ہوتی ہے کہ عالم شہادت میں محمدی شریعت کیا ہے۔ پس اگر وہ تشریع کے زمانے میں ہوتا، جیسا کہ موسیٰ کا زمانہ تھا، تو یہ حکم اس ولی سے ظاہر ہوتا جیسا کہ خضر سے ظاہر ہوا، بغیر کسی فرشتے کی وساطت کے، بلکہ قرب (القرب) کے حضور سے۔ پس رسول اور نبی کے لیے قرب کا حضور ہوتا ہے جیسا کہ اس ولی کے لیے ہے، لیکن ان کے لیے تشریع اس سے نہیں ہوتی، بلکہ تشریع ان کے لیے صرف روح (فرشتے) کی وساطت سے ہوتی ہے۔ اور صرف یہ باقی رہ گیا کہ اگر کسی متاخر نبی کو متقدم کی شریعت میں سے کوئی حکم حاصل ہو جو اس کے لیے بھی شریعت ہے، تو کیا وہ اسے روح کی وساطت سے حاصل کرے گا جیسا کہ اس کی باقی شریعت ہے، یا اسے ویسے ہی حاصل ہوگا جیسا کہ خضر اور ہمارے اس ولی کو حضور وحی سے حاصل ہوا؟ میرا مذہب یہ ہے کہ اسے صرف اسی طرح حاصل ہوگا جس طرح اس رسول کی خاص شریعتیں حاصل ہوتی ہیں۔ اور اسی لیے ثقہ عادل کا یہ قول سچا ہے: مَا لَمْ تُحِطْ بِهِ خُبْرًا (جس کا تم احاطہ نہیں کر سکتے)۔ اور ہمارے طریق کے اہل میں سے کوئی بھی اس بات میں جو ہم نے ذکر کی ہے، نہ تو کوئی اختلاف کرنے والا ہے اور نہ ہی کوئی مخالف، اور نہ ہی ہم اس پر مطلع ہوئے ہیں۔ البتہ اگر ہمارے طریق کے اہل میں سے کوئی اس میں ہماری مخالفت کرے تو اس میں ہماری مخالفت صرف دو آدمیوں میں سے کسی ایک سے متصور ہو سکتی ہے: یا تو وہ اہل اللہ میں سے کوئی شخص ہے جس پر معاملہ مشتبہ ہو گیا اور اس نے الٰہی تعریف (التعريف الإلهي) کو حکم بنا دیا، پس اس نے جائز قرار دیا کہ نبی یا رسول بھی ایسا ہی ہو، لیکن اس امت میں۔ اور پہلے زمانے میں تو یہ اس کے صاحب کے لیے حکم تھا اور لازمی تھا، اور رسول کے لیے فرشتے کی وساطت سے یہ تعریف تھی کہ یہ کسی اور کے لیے شریعت ہے۔ اللہ تعالیٰ نے جب انبیاء کا ذکر کیا تو فرمایا:\nأُولَٰئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ\n(یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی، پس تم ان کی ہدایت کی پیروی کرو)۔\nاور اس نے ان کی ہدایت کا ذکر صرف روح کی وساطت سے وحی کے ذریعے کیا۔ اور دوسرا شخص وہ ہے جس نے حکم کو اخبار پر قیاس کیا۔ اس کے علاوہ کوئی صورت نہیں ہو سکتی۔ اس کے باوجود، ہمیں ان میں سے کسی سے بھی اس بارے میں نہ تو کوئی اختلاف ملا ہے اور نہ ہی کوئی موافقت۔\n\n### [الٰہی صفات اور اسماء کا مسئلہ]\n\nاور اس طبقے کے اصول میں سے یہ بھی ہے کہ وہ اسی چیز کے ذریعے کلام کرتا ہے جس کے ذریعے وہ سنتا ہے، اور ذوق کے لحاظ سے ان کے سوا کوئی دوسرا یہ بات نہیں کہتا۔ لیکن عقلی دلیل کے لحاظ سے جو کوئی یہ کہتا ہے تو وہ کہہ سکتا ہے۔ پس یہ لوگ اسے ظہور الٰہی (تجلی إلهي) سے حاصل کرتے ہیں، اور دوسرے اسے صحیح نظر سے حاصل کرتے ہیں جو معاملے کے مطابق ہے جیسا کہ وہ ہے، اور یہی ذات حق (الحق) ہے۔ اور اختلاف راستے میں واقع ہوتا ہے۔ پس یہ راستہ اس راستے سے مختلف ہے، اگرچہ وہ منزل (جو کہ غایت ہے) میں متفق ہوں۔ پس وہ اپنے لیے سننے والا ہے، اپنے لیے دیکھنے والا ہے، اپنے لیے جاننے والا ہے، اور اسی طرح ہر وہ چیز جسے تم اس کا نام دیتے ہو یا اس کی صفت بیان کرتے ہو یا اس کی نعت بیان کرتے ہو، اگر تم ان لوگوں میں سے ہو جو اللہ کے ساتھ بے ادبی کرتے ہیں جہاں وہ اس کی طرف منسوب کی گئی چیز پر لفظ صفت یا لفظ نعت کا اطلاق کرتے ہیں۔ کیونکہ اس پر صرف لفظ اسم (اسم) کا اطلاق کیا گیا ہے۔ چنانچہ فرمایا:\nسَبِّحِ اسْمَ رَبِّكَ\n(اپنے رب کے نام کی تسبیح کرو)\nاور\nوَتَبَارَكَ اسْمُ رَبِّكَ\n(اور تمہارے رب کا نام بابرکت ہے)\nاور\nوَلِلَّهِ الْأَسْمَاءُ الْحُسْنَىٰ فَادْعُوهُ بِهَا\n(اور اللہ ہی کے لیے بہترین نام ہیں، پس تم اسے انہی کے ذریعے پکارو)۔\nاور مشرکوں کے حق میں فرمایا:\nقُلْ سَمُّوهُمْ\n(کہو، انہیں نام دو)\nاور یہ نہیں فرمایا کہ ان کی صفت بیان کرو یا ان کی نعت بیان کرو۔ بلکہ فرمایا:\nسُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ\n(تمہارا رب، عزت کا رب، ان چیزوں سے پاک ہے جو وہ بیان کرتے ہیں)۔\nپس اس نے اپنے آپ کو لفظاً اور معناً وصف سے پاک قرار دیا، اگر تم اہل ادب اور غور و فکر کرنے والوں میں سے ہو۔ پس یہ میرے اس قول کا معنی ہے کہ \"اگر تم ان لوگوں میں سے ہو جو اللہ کے ساتھ بے ادبی کرتے ہیں\"۔\n\n### [ذات اور صفات کے بارے میں اشاعرہ کا مذہب]\n\nاور ہمارا مخالف کہتا ہے کہ وہ علم کے ذریعے جانتا ہے، قدرت کے ذریعے قادر ہے، بصارت کے ذریعے دیکھتا ہے، اور اسی طرح ہر وہ چیز جس سے وہ نامزد ہوتا ہے، سوائے صفات تنزیہ کے۔ کیونکہ وہ ان میں اس نوعیت کی بات نہیں کرتے، جیسے غنی (الغني) اور اس جیسی صفات، سوائے ان میں سے بعض کے۔ کیونکہ اس نے ان سب کو ذات حق (ذات اللہ) کے ساتھ قائم معانی قرار دیا ہے، جو نہ تو وہ خود ہیں اور نہ ہی اس کے غیر ہیں، بلکہ وہ اس کی ذات پر زائد اعیان (أعيان زائدة) ہیں۔ اور استاد ابو اسحاق نے سات صفات کو اصول قرار دیا ہے، نہ کہ اس کی ذات پر زائد اعیان، جن سے اس کی ذات متصف ہے۔ اور ہر اسم کو اس کی دلالت کے مطابق قرار دیا ہے۔ پس اس نے تمام صفات تنزیہ کو اسم حی (الحي) کے جدول میں رکھا، اور الخبیر، الحسیب، العلیم، المحصی اور ان کی بہنوں کو علم کے جدول میں رکھا، اور اسم الشکور کو کلام کے جدول میں رکھا۔ اور اسی طرح ذات حق (الحق) نے ہر صفت کو سات میں سے وہ چیز دی جو اس کے لیے معنی کے لحاظ سے مناسب ہے، جیسے الخالق اور الرازق کو قدرت کے لیے، اور اسی طرح اس اسلوب پر۔ یہ استاد کا مذہب ہے۔ اور اشاعرہ متکلمین کا اس بات پر اجماع ہے کہ ذات پر زائد امور ہیں، اور انہوں نے اس پر دلائل قائم کیے ہیں۔ پھر وہ اس زائد پر اجماع کے باوجود کوئی قطعی دلیل نہیں پا سکے کہ کیا یہ ذات پر زائد چیز ایک ہی عین ہے جس کے مختلف احکام ہیں، اگرچہ اس کا زائد ہونا ضروری ہے، یا کیا یہ زائد چیزیں متعدد اعیان ہیں؟ ان کے ماہرین نے اس بارے میں کچھ نہیں کہا، بلکہ بعض نے کہا کہ ممکن ہے کہ معاملہ اپنی ذات میں ایک ہی عین کی طرف لوٹے، اور یہ بھی ممکن ہے کہ مختلف اعیان کی طرف لوٹے، مگر اس کا زائد ہونا ضروری ہے۔ اور اس متکلم نے کوئی فائدہ نہیں دیا سوائے عدمِ تحکم کے۔ کیونکہ اگر ذات ایک زائد عین کو قبول کرتی ہے تو جائز ہے کہ وہ اپنی ذات پر بہت سے زائد اعیان کو قبول کرے، تو قدماء کی کثرت بے شمار ہو جائے گی، اور یہ ابو بکر بن الطیب کا مذہب ہے۔ اور اس میں اختلاف طویل ہے، اور ہمارا طریقہ اس پر مبنی نہیں ہے، یعنی ان کی تردید اور ان سے جھگڑنے پر۔ بلکہ ہمارا طریقہ ہر گروہ کے مآخذ کو واضح کرنا ہے، اور اس نے اپنے مذہب کو کہاں سے لیا، اور اس پر کیا ظہور ہوا، اور کیا یہ اس کی سعادت پر اثر انداز ہوتا ہے یا نہیں؟ یہ اہل طریق اللہ کا اللہ کے علم میں حصہ ہے۔ پس ہم اللہ کی مخلوق میں سے کسی کی تردید میں مشغول نہیں ہوتے، بلکہ بعض اوقات ہم ان کے لیے الٰہی وسعت کی وجہ سے عذر قائم کرتے ہیں، کیونکہ اللہ نے اس شخص کے لیے عذر قائم کیا جو اللہ کے ساتھ کسی دوسرے معبود کو پکارتا ہے، اس دلیل کے ساتھ جسے وہ اپنے گمان میں دلیل سمجھتا ہے، چنانچہ اللہ عزوجل نے فرمایا:\nوَمَن يَدْعُ مَعَ اللَّهِ إِلَٰهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ\n(اور جو اللہ کے ساتھ کسی دوسرے معبود کو پکارتا ہے، جس کی اس کے پاس کوئی دلیل نہیں ہے)۔\n\n### [خیر اور شر اور ان کی اللہ کی طرف نسبت]\n\nاور ان کے اصول میں سے اللہ کے ساتھ ادب (الأدب) بھی ہے، پس وہ اسے صرف اسی نام سے پکارتے ہیں جس سے اس نے خود کو پکارا، اور اس کی طرف صرف وہی چیز منسوب کرتے ہیں جو اس نے خود اپنی طرف منسوب کی۔ جیسا کہ اللہ تعالیٰ نے فرمایا:\nمَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ\n(جو بھلائی تمہیں پہنچتی ہے وہ اللہ کی طرف سے ہے)۔\nاور برائی کے بارے میں فرمایا:\nوَمَا أَصَابَكَ مِن سَيِّئَةٍ فَمِن نَّفْسِكَ\n(اور جو برائی تمہیں پہنچتی ہے وہ تمہاری اپنی جان کی طرف سے ہے)۔\nپھر فرمایا:\nقُلْ كُلٌّ مِّنْ عِندِ اللَّهِ\n(کہو، سب کچھ اللہ کے پاس سے ہے)۔\nیہ دونوں امور کو جمع کرنے کی صورت میں کہا، یہ نہ کہو کہ \"من اللہ\" (اللہ کی طرف سے)۔ پس لفظ کا خیال رکھو، اور جان لو کہ امر کو جمع کرنے کی ایک حقیقت ہے جو ہر مفرد کی حقیقت سے مختلف ہے جب وہ اکیلا ہو اور کسی دوسرے کے ساتھ جمع نہ ہو، جیسے سیاہی کا سیاہ ہونا جو عقص اور زاج کے درمیان ہے۔ پس اللہ سبحانہ و تعالیٰ نے اس چیز کے درمیان فرق کیا جو اس کی طرف سے ہوتی ہے (منه) اور جو اس کے پاس سے ہوتی ہے (من عنده)۔ اللہ تعالیٰ ایک مخصوص گروہ کے حق میں فرماتا ہے:\nوَاللَّهُ خَيْرٌ وَأَبْقَىٰ\n(اور اللہ بہتر اور باقی رہنے والا ہے)\nیہ تفضیل (مفاضلہ) کے صیغے کے ساتھ ہے اور کوئی مناسبت نہیں ہے۔ اور ایک دوسرے مخصوص گروہ کے حق میں، جس کی صفت بیان کی گئی ہے، فرمایا:\nوَمَا عِندَ اللَّهِ خَيْرٌ وَأَبْقَىٰ\n(اور جو کچھ اللہ کے پاس ہے وہ بہتر اور باقی رہنے والا ہے)۔\nپس جو اس کے پاس ہے وہ عین وہ نہیں جو اس کی طرف سے ہے، اور نہ ہی عین اس کی ہویت ہے۔ پس دونوں گروہوں کے درمیان وہی فرق ہے جو دو مرتبوں کے درمیان ہے۔ جیسا کہ ایک شخص سے پوچھا گیا: تم نے اپنے اہل کے لیے کیا چھوڑا؟ اس نے کہا: اللہ اور اس کا رسول۔ اور دوسرے سے پوچھا گیا تو اس نے کہا: میرا آدھا مال۔ تو کہا گیا: تمہارے دونوں کلمات کے درمیان وہی فرق ہے جو تمہارے مرتبے میں ہے۔ پس جب بندہ ہر اس چیز کو لے جو اس کے سوا ہے، تو اسے اللہ میں بہتر اور باقی رہنے والا قرار دیتا ہے (خَيْرٌ وَأَبْقَىٰ)۔ اور جب وہ اسے عالم کے کسی ایسے پہلو سے لیتا ہے جو حجاب، دوری اور مذمت کا تقاضا کرتا ہے، تو اسے اس چیز میں بہتر اور باقی رہنے والا قرار دیتا ہے جو اللہ کے پاس ہے (عِندَ اللَّهِ خَيْرٌ وَأَبْقَىٰ)۔ پس اس نے مراتب کو ممتاز کیا۔ پھر اس نے سبحانہ و تعالیٰ نے ہمیں اہل ادب اور اللہ کے علم میں ان کے مرتبے سے آگاہ فرمایا، چنانچہ اپنے خلیل ابراہیم (علیہ السلام) کے بارے میں فرمایا کہ انہوں نے کہا:\nالَّذِي خَلَقَنِي فَهُوَ يَهْدِينِ * وَالَّذِي هُوَ يُطْعِمُنِي وَيَسْقِينِ\n(جس نے مجھے پیدا کیا، پس وہی مجھے ہدایت دیتا ہے، اور وہی مجھے کھلاتا اور پلاتا ہے)۔\nاور یہ نہیں کہا کہ مجھے بھوکا رکھتا ہے۔\nوَإِذَا مَرِضْتُ\n(اور جب میں بیمار ہوتا ہوں)\nاور یہ نہیں کہا کہ مجھے بیمار کرتا ہے۔\nفَهُوَ يَشْفِينِ\n(تو وہی مجھے شفا دیتا ہے)۔\nپس انہوں نے شفا کو اپنی طرف منسوب کیا اور بیماری کو اپنے نفس کی طرف، اگرچہ سب کچھ اللہ کے پاس سے ہے۔ لیکن اللہ تعالیٰ نے اپنے رسولوں کو ادب سکھایا، کیونکہ نفوس بیماری کو قبول نہیں کرتے، موت کے برعکس۔ کیونکہ عقلمند عارفوں میں سے فضلاء اس قید سے چھٹکارا پانے کے لیے موت طلب کرتے ہیں، اور انبیاء اس ملاقات کے لیے موت طلب کرتے ہیں جو اس میں شامل ہے، اور اسی طرح اہل اللہ بھی۔ اسی لیے کسی نبی کو موت میں اختیار نہیں دیا گیا مگر اس نے اسے چن لیا، کیونکہ اس میں اللہ سے ملاقات ہے، پس یہ اس کی طرف سے انعام اور احسان ہے۔ اور بیماری ایک مشغول کر دینے والی چیز ہے جو بندے کو اللہ کے حقوق میں سے اس کی ادائیگی سے روکتی ہے، کیونکہ وہ درد محسوس کرتا ہے، اور وہ تکلیف کی جگہ میں ہے۔ اور درد صرف حیوانی روح محسوس کرتی ہے، پس وہ اپنے جسم کو تدبیر کرنے والی روح کو اس چیز سے مشغول کر دیتی ہے جس کی طرف اسے اس دنیا میں بلایا گیا ہے۔ اسی لیے انہوں نے بیماری کو اپنی طرف منسوب کیا اور شفا اور موت کو ذات حق (الحق) کی طرف۔ جیسا کہ موسیٰ (علیہ السلام) کے ساتھی (خضر) نے کشتی کو عیب دار کرنے کی نسبت اپنی طرف کی، کیونکہ اس کا عیب دار کرنا ایک عیب تھا، اور لڑکے کو قتل کرنے کی نسبت اپنی طرف اور اپنے رب کی طرف کی، کیونکہ اس میں اس کے والدین کے لیے رحمت تھی، اور جو کچھ انہیں اس سے برا لگا اس کی نسبت اپنی طرف کی، اور دیوار کو قائم کرنے کی نسبت اپنے رب کی طرف کی، کیونکہ اس میں بھلائی اور خیر تھی، جو کہ خزانہ ہے، جس سے وہ دونوں یتیم فائدہ اٹھائیں گے۔ اللہ تعالیٰ نے اپنے بندے خضر کے بارے میں کشتی کو عیب دار کرنے کے بارے میں فرمایا:\nفَأَرَدتُّ أَنْ أَعِيبَهَا\n(تو میں نے چاہا کہ اسے عیب دار کر دوں)\nیہ تنزیہ کے لیے تھا کہ وہ اس بلند جناب کی طرف اس چیز کو منسوب کریں جس کا ظاہر عرف اور عادت میں مذمت ہے۔ اور دیوار کو قائم کرنے کے بارے میں فرمایا، جب اس کے قائم کرنے کو یتیموں کے لیے رحمت قرار دیا، اس خیر کی وجہ سے جو خزانہ ہے،\nفَأَرَادَ رَبُّكَ\n(تو تمہارے رب نے چاہا)\nوہ موسیٰ (علیہ السلام) کو خبر دے رہے ہیں کہ\nأَن يَبْلُغَا أَشُدَّهُمَا وَيَسْتَخْرِجَا كَنزَهُمَا رَحْمَةً مِّن رَّبِّكَ\n(کہ وہ دونوں اپنی جوانی کو پہنچیں اور اپنا خزانہ نکالیں، یہ تمہارے رب کی طرف سے رحمت ہے)۔\nاور لڑکے کے حق میں موسیٰ (علیہ السلام) سے کہا کہ وہ کافر پیدا ہوا تھا، اور کفر ایک مذموم صفت ہے۔ اللہ تعالیٰ نے فرمایا:\nوَلَا يَرْضَىٰ لِعِبَادِهِ الْكُفْرَ\n(اور وہ اپنے بندوں کے لیے کفر کو پسند نہیں کرتا)۔\nاور وہ انہیں یہ خبر دینا چاہتے تھے کہ اللہ ان کے والدین کو اس سے بہتر بدل دے گا،\nخَيْرًا مِّنْهُ زَكَاةً وَأَقْرَبَ رُحْمًا\n(جو پاکیزگی میں اس سے بہتر اور محبت میں زیادہ قریب ہو)۔\nپس وہ اس معاملے میں جو عیب تھا، موسیٰ (علیہ السلام) کی نظر میں، جہاں انہوں نے اسے ایک برا کام (نکر) قرار دیا اور اسے ایک پاکیزہ جان قرار دیا جسے بغیر کسی جان کے بدلے قتل کیا گیا، اس کی نسبت کرنا چاہتے تھے، تو انہوں نے کہا:\nفَأَرَدْنَا أَن يُبْدِلَهُمَا رَبُّهُمَا\n(تو ہم نے چاہا کہ ان کا رب انہیں اس سے بہتر بدل دے)۔\nپس وہ جمع کے نون کے ساتھ آئے (أردنا)، کیونکہ اس کے قتل میں دو پہلو تھے: ایک پہلو جو خیر کی طرف لے جاتا تھا، اور ایک پہلو جو موسیٰ کی نظر میں اور عام عادت میں اس کے علاوہ کی طرف لے جاتا تھا۔ پس اس فعل میں جو خیر تھا وہ اللہ کے لیے تھا، نون کے ضمیر کے لحاظ سے، اور جو کچھ اس میں ظاہر میں اور موسیٰ کی نظر میں اس وقت برا تھا، وہ خضر کے لیے تھا، نون کے ضمیر کے لحاظ سے۔ پس جمع کے نون کے دو پہلو ہیں، کیونکہ اس میں جمع ہے: ایک پہلو خیر کی طرف، جس سے انہوں نے امر کو اللہ کی طرف منسوب کیا، اور ایک پہلو عیب کی طرف، جس سے انہوں نے عیب کو اپنی طرف منسوب کیا۔ اور وہ اس مسئلے اور واقعے کو درمیان میں لائے، نہ کہ کنارے پر، کشتی اور دیوار کے درمیان، تاکہ اس میں جو عیب ہے وہ کشتی کی طرف ہو، اور جو خیر ہے وہ دیوار کی طرف ہو۔ اور حکمت درست ہو گئی۔ اگر تم کہو کہ انہوں نے نون کے ضمیر میں اللہ اور اپنے نفس کو کیوں جمع کیا، یعنی \"فأردنا\" (تو ہم نے چاہا) میں، جبکہ رسول اللہ صلی اللہ علیہ وسلم نے جب ایک خطیب کو سنا کہ اس نے اللہ تعالیٰ اور رسول اللہ صلی اللہ علیہ وسلم کو ایک ہی ضمیر میں جمع کیا، اپنے قول: \"ومن یعصھما\" (اور جو ان دونوں کی نافرمانی کرے) میں، تو فرمایا: \"تم بہت برے خطیب ہو\"؟\nتو جان لو کہ یہ اسی باب سے ہے جسے ہم نے مقرر کیا ہے، اور وہ یہ ہے کہ ذات حق (الحق) کی طرف صرف وہی چیز منسوب کی جائے جو ذات حق نے خود اپنی طرف منسوب کی ہو، یا اس کے رسول نے اس کا حکم دیا ہو، یا جسے اللہ نے اپنے پاس سے علم عطا کیا ہو، جیسے خضر جن کا نص موجود ہے۔ پس یہ اسی باب سے ہے۔ چونکہ یہ خطیب علم لدنی سے عاری تھا، اور رسول اللہ صلی اللہ علیہ وسلم نے اسے اس طرح کی اجازت نہیں دی تھی، اس لیے آپ نے اس کی مذمت کی اور فرمایا: \"تم بہت برے خطیب ہو\"۔ کیونکہ اسے چاہیے تھا کہ وہ ذات حق اور مخلوق کو ایک ہی ضمیر میں جمع نہ کرے، سوائے الٰہی اجازت کے، جو رسول یا علم لدنی سے ہو۔ اور اس کے پاس ان دونوں میں سے کوئی چیز نہیں تھی، اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے اس کی مذمت کی۔ اور رسول اللہ صلی اللہ علیہ وسلم نے ایک حدیث میں جو ہم نے ان سے روایت کی ہے، ایک خطبہ میں جو انہوں نے دیا، اس میں اللہ تعالیٰ کا ذکر کیا اور اپنا ذکر کیا، پھر اپنے رب تعالیٰ اور اپنے نفس کو ایک ہی ضمیر میں جمع کیا، اور فرمایا:\nمَن يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ رَشَدَ وَمَن يَعْصِهِمَا فَلَا يَضُرُّ إِلَّا نَفْسَهُ وَلَا يَضُرُّ اللَّهَ شَيْئًا\n(جو اللہ اور اس کے رسول کی اطاعت کرے گا وہ ہدایت پا گیا، اور جو ان دونوں کی نافرمانی کرے گا تو وہ صرف اپنا ہی نقصان کرے گا اور اللہ کو کوئی نقصان نہیں پہنچائے گا)۔\nاور وہ صلی اللہ علیہ وسلم اپنی خواہش سے نہیں بولتے،\nإِنْ هُوَ إِلَّا وَحْيٌ يُوحَىٰ\n(یہ تو صرف وحی ہے جو بھیجی جاتی ہے)۔\nاور اسی طرح خضر نے کہا:\nوَمَا فَعَلْتُهُ عَنْ أَمْرِي\n(اور میں نے یہ اپنے حکم سے نہیں کیا)\nیعنی جو کچھ بھی انہوں نے اعمال کیے اور جو کچھ بھی انہوں نے موسیٰ (علیہ السلام) سے اس بارے میں کلام میں کہا۔ پس سمجھو۔\n\n### [سوار مراد ہیں، مرید نہیں]\n\nاس طرح میں نے تمہیں ان کے اصول کے بارے میں کافی وضاحت کر دی ہے۔ پس سوار (الرکبان) وہ ہیں جو مراد (المرادون) ہیں، مجذوب (المجذوبون) ہیں، جن کے راز انڈوں میں محفوظ ہیں، جن میں ہوا داخل نہیں ہوتی، جیسے حور مقصورات (القاصرات الطرف من الحور المقصورات) خیموں میں،\nكَأَنَّهُنَّ بَيْضٌ مَّكْنُونٌ\n(گویا کہ وہ چھپائے ہوئے انڈے ہیں)۔\n\n### [سواروں کی صفات]\n\nاور ان کی صفات میں سے یہ ہے کہ وہ نیند کے وقت اپنے چہرے نہیں کھولتے، اور صرف اپنی پیٹھ پر سوتے ہیں۔ ان کے لیے تلقّی (التلقي) ہے، وہ صرف الٰہی حکم سے حرکت کرتے ہیں، اور اسی طرح سکون کرتے ہیں۔ ان کا ارادہ وہی ہے جو ان سے ارادہ کیا جاتا ہے۔ اور چونکہ سکون (السكون) ایک عدمی امر ہے، اس لیے ہم نے اسے ارادے کے ساتھ جوڑا، نہ کہ حکم کے ساتھ۔ اور چونکہ حرکت (التحرک) ایک وجودی امر ہے، اس لیے ہم نے اسے الٰہی حکم کے ساتھ جوڑا، اگر تم سمجھو۔ اور وہ رضی اللہ عنہم نہ تو دھکا دیتے ہیں اور نہ ہی انہیں دھکا دیا جاتا ہے۔ ان کی زبانوں پر زیادہ تر یہ جاری رہتا ہے: مَا شَاءَ اللَّهُ (جو اللہ چاہے)۔ ان کے لیے بادل مسخر کیے گئے ہیں۔ انہیں غیوب (الغيوب) کے علم میں راسخ قدم حاصل ہے۔ انہیں ہر رات روحانی معراج (معراج روحاني) حاصل ہوتا ہے، بلکہ دن یا رات کی ہر نیند میں۔ انہیں عالم کے باطن پر جھانکنے کا موقع ملتا ہے، پس انہوں نے آسمانوں اور زمین کی بادشاہت (ملکوت) کو دیکھا۔ اللہ تعالیٰ ابراہیم (علیہ السلام) کے حق میں فرماتا ہے:\nوَكَذَٰلِكَ نُرِي إِبْرَاهِيمَ مَلَكُوتَ السَّمَاوَاتِ وَالْأَرْضِ وَلِيَكُونَ مِنَ الْمُوقِنِينَ\n(اور اسی طرح ہم نے ابراہیم کو آسمانوں اور زمین کی بادشاہت (ملکوت) دکھائی تاکہ وہ یقین کرنے والوں میں سے ہو جائے)۔\nاور رسول اللہ صلی اللہ علیہ وسلم کے حق میں فرمایا:\nسُبْحَانَ الَّذِي أَسْرَىٰ بِعَبْدِهِ لَيْلًا مِّنَ الْمَسْجِدِ الْحَرَامِ إِلَى الْمَسْجِدِ الْأَقْصَى الَّذِي بَارَكْنَا حَوْلَهُ لِنُرِيَهُ مِنْ آيَاتِنَا\n(پاک ہے وہ ذات جو اپنے بندے کو رات کے وقت مسجد حرام سے مسجد اقصیٰ تک لے گئی، جس کے ماحول کو ہم نے برکت دی ہے، تاکہ ہم اسے اپنی کچھ نشانیاں دکھائیں)۔\nاور یہ عین ان کا اسراء (معراج) ہے۔ اور علماء انبیاء کے وارث ہیں۔ ان کے احوال کتمان (الكتمان) ہیں، اگر انہیں ٹکڑے ٹکڑے بھی کر دیا جائے تو بھی ان کے پاس جو کچھ ہے وہ معلوم نہیں ہوتا۔ اسی لیے خضر نے کہا:\nمَا فَعَلْتُهُ عَنْ أَمْرِي\n(میں نے یہ اپنے حکم سے نہیں کیا)۔\nپس کتمان ان کے اصول میں سے ہے، سوائے اس کے کہ انہیں افشاء اور اعلان کا حکم دیا جائے۔\nوَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\n(اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "(باب سی و یکم در معرفت اصول سواران)\n\nروزگار بر ما مهربانی کرد و خم شد *** و در حکم خود پیش رفت و سستی نکرد.\nو ما عاشق او شدیم و آواز خواندیم، باشد که *** روزگار از آهنگ این آواز به وجد آید.\nما تو را در جان‌های خود حاکم ساختیم *** پس اگر خواهی به سود ما یا به زیان ما حکم کن.\nو حکم از آن او بود و آن حکم *** برای روزگار بر ما نبود.\nپس شفیع من روزگار من است و آن کس که *** روزگار را گرداند، ما را نیز چنین گرداند.\nپس سوار شدیم تا اصلی را بجوییم که *** راز را نزد ما آشکار ساخت.\nپس از اوست آنچه ما را به حرکت درآورد *** و از ماست برای او آنچه ما را ساکن ساخت.\nحرکات روزگار در ما گواهی داد *** که او به آن (روزگار) گفت: «آنچه ما را ساکن ساخت.»\nپس من بنده خوار برگزیده‌ام *** و من حق (الحق) هستم، در حالی که حق (الحق) من نیستم.\n\n### [برائت جستن از حرکت]\n\nبدان، خداوند تو را تأیید کند، اصولی که سواران (الرکبان) بر آن‌ها تکیه کرده‌اند بسیار است. از جمله آن‌ها، برائت جستن از حرکت است هنگامی که در آن قرار داده می‌شوند؛ به همین دلیل سوار شدند. پس آنان ساکنانی هستند بر مرکب‌های خود که با حرکت دادن مرکب‌هایشان به حرکت درمی‌آیند. آن‌ها آنچه را که مأمور به پیمودن آن شده‌اند، به وسیله غیر خود می‌پیمایند نه به وسیله خودشان. پس در حالی که از مشقت حرکت آسوده‌اند، می‌رسند و از ادعایی که حرکت به همراه می‌آورد، برائت می‌جویند. حتی اگر به پیمودن مسافت‌های دور در زمان اندک افتخار کنند، این افتخار به مرکبی بازمی‌گردد که آن مسافت را با آن‌ها پیموده است، نه به خودشان. پس برائت از آنِ آن‌هاست و ادعا از آنِ آن‌ها نیست. ذکر همیشگی (هجیر) آن‌ها «لا حول ولا قوة إلا بالله» (هیچ نیرو و قوتی جز به یاری خداوند نیست) است و آیه آن‌ها این است: **«وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَى»** (و تو [ای پیامبر] آنگاه که تیر انداختی، تو نبودی که انداختی، بلکه خداوند انداخت) [انفال: ۱۷]. به آن‌ها گفته می‌شود: شما این مسافت‌ها را هنگامی که پیمودید، نپیمودید، بلکه مرکب‌ها آن‌ها را پیمودند؛ پس آن‌ها حمل‌شدگان هستند. بنده را شوکتی نیست مگر به سلطنت مولای خود، و ذلت و عجز و خواری و ضعف از آنِ نفس اوست. و چون دیدند که خداوند با این سخن خود آگاهانیده است: **«وَلَهُ مَا سَكَنَ»** (و آنچه ساکن شده از آنِ اوست) [انعام: ۱۳] و آن را خالص برای خود قرار داده است، دانستند که در حرکت، ادعا وجود دارد و سکون آلوده به ادعا نیست، زیرا سکون نفی حرکت است. پس گفتند: خداوند ما را به پیمودن این مسافت معنوی و عبور از این بیابان‌های هلاک‌کننده به سوی او امر کرده است. اگر ما این مسافت را با نفوس خود بپیماییم، از این ایمن نخواهیم بود که در محضر اتصال، به آن تفاخر کنیم، زیرا نفس بر حماقت، طلب پیشی و دوست داشتن فخر سرشته شده است. در نتیجه، به اندازه‌ای که باید آن جلال اعظم را احترام کنیم، در آن مقام دچار نقص خواهیم شد.\n\n### [ذکر حوقله (لا حول ولا قوة إلا بالله) مرکب‌های افراد]\n\nپس باید مرکبی برگزینیم که با آن مسافت را بپیماییم؛ اگر آن مرکب بخواهد افتخار کند، افتخار از آنِ مرکب خواهد بود نه از آنِ نفوس. پس آن‌ها «لا حول ولا قوة إلا بالله» (حوقله) را به عنوان شتران راهوار (نجب) برگزیدند، زیرا شتران راهوار در برابر آب و علف از اسب‌ها و دیگر حیوانات صبورترند، و راه، تشنه‌کننده و خشک است و هر مرکبی که مرتبه شتران راهوار را نداشته باشد، در آن هلاک می‌شود. به همین دلیل، آن را به عنوان شتر راهوار برگزیدند نه چیز دیگری که سوار شدن بر آن صحیح است اما پیمودن آن (مسافت) با آن صحیح نیست. (و نگفتند) «الحمد لله» (ستایش از آنِ خداست)، زیرا این ذکر از ویژگی‌های وصول است؛ و (نگفتند) «سبحان الله» (منزه است خدا)، زیرا این از ویژگی‌های تجلی (التجلی) است؛ و (نگفتند) «لا إله إلا الله» (هیچ معبودی جز خدا نیست)، زیرا این از ویژگی‌های ادعاهاست؛ و (نگفتند) «الله أكبر» (خدا بزرگ‌تر است)، زیرا این از ویژگی‌های برتری‌جویی است. پس «لا حول ولا قوة إلا بالله» (هیچ نیرو و قوتی جز به یاری خداوند نیست) تعیین شد، زیرا این ذکر از ویژگی‌های اعمال است، چه فعلی و چه قولی، چه ظاهری و چه باطنی؛ چون آن‌ها به اعمال امر شده‌اند و سفر، عملی است قلبی و بدنی، معنوی و حسی، و این مخصوص به «لا حول ولا قوة إلا بالله» است. زیرا آن‌ها با این ذکر، «لا إله إلا الله» می‌گویند و با آن «سبحان الله» و دیگر اقوال و اعمال را می‌گویند.\n\n### [«سکون» معیار انتخاب «افراد»]\n\nو چون سکون، عدمِ حرکت است و عدم، اصل آن‌هاست، زیرا خداوند می‌فرماید: **«وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئًا»** (و تو را پیش از این آفریدم، در حالی که چیزی نبودی) [مریم: ۹]، یعنی موجودی نبودی؛ پس آن‌ها سکون را بر حرکت برگزیدند که همان اقامت بر اصل است. پس خداوند سبحان و متعال در این سخن خود آگاهانید: **«وَلَهُ مَا سَكَنَ فِي اللَّيْلِ وَالنَّهَارِ»** (و آنچه در شب و روز آرام گرفته از آنِ اوست) [انعام: ۱۳]، که خلایق، عدم را به او تسلیم کردند و در وجود، برای خود ادعا کردند. پس از باب حقایق (الحقائق)، حق (الحق) در این آیه، خلق خود را از اضافه کردن آنچه برای خود ادعا کرده‌اند، برهنه ساخت، با این سخن خود: **«وَلَهُ مَا سَكَنَ فِي اللَّيْلِ وَالنَّهَارِ»**، یعنی آنچه ثابت شد. و ثبوت، امری وجودی و عقلی است، نه عینی، بلکه نسبی است. و **«وَهُوَ السَّمِيعُ الْعَلِيمُ»** (و او شنوای داناست) [انعام: ۱۳]. دعوای شما را در نسبت دادن آنچه از آنِ اوست و شما آن را به خود نسبت داده‌اید، می‌شنود؛ و داناست به اینکه امر بر خلاف آن چیزی است که شما ادعا کرده‌اید.\n\n### [توحید حق (الحق) به زبان حق (الحق)]\n\nو از اصول آن‌ها، توحید (توحید) به زبان «به وسیله من سخن می‌گوید، و به وسیله من می‌شنود، و به وسیله من می‌بیند» است. و این مقامی است که حاصل نمی‌شود مگر از فروع اعمال که همان نوافل هستند. زیرا این فروع، محبت الهی را نتیجه می‌دهند و محبت، این صفت را برای بنده به ارث می‌گذارد. پس این صفت، اصلی می‌شود برای این دسته از بندگان در آنچه می‌دانند و در احکام خضر و علم او حکم می‌کنند. پس این (صفت) اصلی اکتسابی است، در حالی که برای خضر، اصلِ عنایت الهی به واسطه رحمتی بود که خداوند به او عطا کرد. و از آن رحمت بود که این علم را داشت که موسی (علیه السلام) درخواست کرد تا از او بیاموزد. اگر به این امری که بیان کردیم پی ببری، قدر ولایت این ملت محمدی و امت او و منزلت آن را خواهی دانست، و اینکه ثمره شکوفه فروعِ اصلِ مشروع برای عموم، همان اصل خضر است که خداوند متعال بر بنده خود موسی (علیه السلام) با ملاقات او و ادب آموختن به او منت نهاد. پس برای محمدی، فرعِ فرعِ فرعی را نتیجه داد که اصل آن، همان چیزی است که اصل برای خضر است. و کسی مانند موسی (علیه السلام) از او می‌خواهد که از علمی که بر آن است، به او بیاموزد. پس بنگر که منزلت این عارف محمدی کجا متمایز شده است. پس چگونه است حال تو با آنچه اصلی که این فروع به آن بازمی‌گردند، نتیجه می‌دهد؟\n\n### [محبت امتنان و محبت جزا]\n\nرسول خدا (صلی الله علیه و سلم) در آنچه از پروردگارش روایت می‌کند، فرمود: «خداوند می‌فرماید: تقرب‌جویان به چیزی محبوب‌تر نزد من از انجام آنچه بر آنان واجب کرده‌ام، به من تقرب نجسته‌اند.»\n\nپس این همان اصل است: انجام فرایض. سپس فرمود: «و بنده پیوسته با نوافل به من تقرب می‌جوید»؛ و آن چیزی است که بر فرایض افزوده می‌شود، اما از جنس آن‌هاست، تا فرایض اصلی برای آن‌ها باشند؛ مانند نوافل خیرات از نماز و زکات و روزه و حج و ذکر. پس این، نزدیک‌ترین فرع به اصل است. سپس این عمل که نافله است، محبت خداوند به او را نتیجه می‌دهد، و این محبتی خاص و از باب جزا است، نه محبت امتنان (محبت از روی بخشش و لطف). زیرا در محبت امتنانِ اصلی، همه اهل سعادت نزد خداوند متعال شریک هستند، و این همان محبتی است که به این افراد، تقرب به خداوند با نوافل خیرات را بخشیده است. سپس این محبت که فرع دوم و به منزله شکوفه است، این را برای او نتیجه داد که حق (الحق) گوش و چشم و دست او باشد و غیره. و این فرع سوم است که به منزله میوه‌ای است که هنگام شکوفه بستن، منعقد می‌شود. در آن هنگام، بنده با حق (الحق) می‌شنود و با آن سخن می‌گوید و با آن می‌بیند و با آن می‌گیرد و با آن درک می‌کند. و این وحی خاص الهی است که این مقام را به او عطا کرده و فرشته (ملک) در آن واسطه‌ای از جانب خداوند نیست. به همین دلیل، خضر به موسی (علیه السلام) گفت: **«مَا لَمْ تُحِطْ بِهِ خُبْرًا»** (آنچه را که از آن آگاهی نداری) [کهف: ۶۸]. زیرا وحی رسولان تنها به واسطه فرشته بین خداوند و رسول اوست. پس رسول از این ذوق در عین اجرای حکم در عالم شهادت، خبری ندارد. زیرا ارسال (رسالت) برای تشریع احکام الهی در عالم شهادت، جز به واسطه روحی که بر قلب او نازل می‌شود یا در تمثل (تجسم) فرشته برای او، باز نمی‌گردد. رسول شریعت را جز بر این وصف نمی‌شناسد، نه غیر شریعت را. زیرا رسول، قربِ انجام فرض و محبتی که خداوند بر آن عطا می‌کند و آنچه آن محبت نتیجه می‌دهد را دارد؛ و همچنین قرب نوافل و محبت آن‌ها و آنچه محبت آن‌ها به او می‌بخشد را دارد، اما از علم به خداوند، نه از علم تشریع و اجرای حکم در عالم شهادت. پس از این قبیل، احاطه خبری نداشت. این مقدار همان چیزی است که خضر به تنهایی و بدون موسی (علیه السلام) به آن اختصاص یافت.\n\n### [نبوت تعریف و نبوت تشریع]\n\nو از این باب است که محمدی‌ای که پیش از این علمی به شریعت از طریق نقل و خواندن فقه و حدیث و معرفت احکام شرعی نداشته است، حکم می‌کند. پس صاحب این مقام با علم به حکم مشروع، بر اساس آنچه در شریعت نازل شده از این حضرة است، سخن می‌گوید. و او از رسولان نیست، بلکه این یک تعریف (تعریف) الهی و عصمتی است که این مقام به او می‌دهد و رسالت در آن دخالتی ندارد. پس این معنای سخن خضر است: **«مَا لَمْ تُحِطْ بِهِ خُبْرًا»**. زیرا رسول این حکم را جز با نزول روح‌الامین بر قلبش یا با مثالی در عالم شهادتش که فرشته به صورت مردی برای او تمثل می‌یابد، دریافت نمی‌کند. و چون نبوت و همچنین رسالت پس از رسول خدا (صلی الله علیه و سلم) ممنوع شده است، تعریف (تعریف) برای این شخص، همان چیزی است که شریعت محمدی در عالم شهادت بر آن است. پس اگر در زمان تشریع بود، همان‌گونه که زمان موسی بود، حکم از این ولی ظاهر می‌شد، همان‌گونه که از خضر ظاهر شد، بدون واسطه فرشته، بلکه از حضرة القرب (حضور قرب). پس رسول و نبی، حضرة القرب را دارند، همانند این ولی، اما تشریع از آنِ این حضرة نیست، بلکه تشریع جز با واسطه فرشته (روح) برای او حاصل نمی‌شود. و تنها این باقی می‌ماند که اگر برای نبی متأخر، از شریعت نبی متقدم، آنچه شریعت برای اوست، حاصل شود، آیا این به واسطه روح حاصل می‌شود، مانند سایر شریعت او، یا همان‌گونه که برای خضر و برای این ولی از ما، از حضرة الوحی (حضور وحی) حاصل شد؟ مذهب من این است که برای او حاصل نمی‌شود مگر همان‌گونه که آنچه از شرایع مختص به آن رسول است، حاصل می‌شود. و به همین دلیل است که باید سخن فرد مورد اعتماد و عادل در این باره که **«مَا لَمْ تُحِطْ بِهِ خُبْرًا»** تصدیق شود. و ما در آنچه ذکر کردیم، از اهل طریقت خود، منازع و مخالفی نمی‌شناسیم و بر آن وقوف نیافته‌ایم. جز اینکه اگر کسی از اهل طریقت ما با ما مخالفت کند، این مخالفت جز از یکی از دو نفر متصور نیست: یا مردی از اهل الله است که امر بر او مشتبه شده و تعریف الهی را حکم قرار داده است، پس جایز دانسته که نبی یا رسول نیز چنین باشد، اما در این امت. و اما در زمان اول، آن حکم برای صاحبش ضروری است و آن تعریف برای رسول به واسطه فرشته است که این شریعت برای غیر اوست. خداوند متعال هنگامی که پیامبران را ذکر کرد، فرمود: **«أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ»** (آنان کسانی هستند که خداوند هدایتشان کرده است، پس به هدایت آنان اقتدا کن) [انعام: ۹۰]. و هدایت آن‌ها را جز به وحی به واسطه روح ذکر نکرد. و مرد دیگر، کسی است که حکم را بر اخبار قیاس کرده است. و غیر از این، ممکن نیست. با این حال، از هیچ یک از آن‌ها، نه مخالفت و نه موافقتی در آنچه ذکر کردیم، به ما نرسیده است.\n\n### [مسئله صفات و اسماء الهی]\n\nو از اصول این طبقه نیز این است که او (خداوند) با آنچه می‌شنود، سخن می‌گوید. و جز آن‌ها کسی از حیث ذوق (عرفانی) این را نمی‌گوید، اما ممکن است کسی از حیث دلیل عقلی این را بگوید. پس اینان آن را از تجلی الهی (التجلی) می‌گیرند و دیگران آن را از نظر صحیح که موافق امر بر همان‌گونه که هست، می‌گیرند، و آن حق (الحق) است. و اختلاف در راه رخ می‌دهد؛ پس این راه غیر از آن راه است، اگرچه در منزل که همان هدف است، توافق دارند. پس او شنونده برای خود، بیننده برای خود، و دانا برای خود است. و همین‌طور هر آنچه او را به آن نام می‌بری یا وصف می‌کنی یا نعت می‌دهی، اگر از کسانی باشی که با خداوند سوء ادب می‌کنند، آنجا که لفظ صفت یا لفظ نعت را بر آنچه به او نسبت داده شده، اطلاق می‌کنی. زیرا بر آن جز لفظ اسم اطلاق نشده است. پس فرمود: **«سَبِّحِ اسْمَ رَبِّكَ»** (نام پروردگار خود را تسبیح کن) [اعلی: ۱] و **«تَبَارَكَ اسْمُ رَبِّكَ»** (نام پروردگار تو مبارک است) [الرحمن: ۷۸] و **«وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَى فَادْعُوهُ بِهَا»** (و برای خداوند نام‌های نیکوست، پس او را با آن‌ها بخوانید) [اعراف: ۱۸۰]. و در حق مشرکان فرمود: **«قُلْ سَمُّوهُمْ»** (بگو آن‌ها را نام ببرید) [رعد: ۳۳] و نگفت آن‌ها را وصف کنید یا نعت دهید، بلکه فرمود: **«سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ»** (منزه است پروردگار تو، پروردگار عزت، از آنچه وصف می‌کنند) [صافات: ۱۸۰]. پس خود را از وصف، لفظاً و معناً، منزه ساخت، اگر از اهل ادب و هوشیاری باشی. این معنای سخن من است که «اگر از کسانی باشی که با خداوند سوء ادب می‌کنند».\n\n### [مذهب اشاعره در ذات و صفات]\n\nو مخالف ما می‌گوید که او با علمی می‌داند، و با قدرتی تواناست، و با بصری می‌بیند. و همین‌طور است در مورد تمام آنچه به آن نامیده می‌شود، مگر صفات تنزیه (منزه بودن) که در مورد آن‌ها به این شیوه سخن نمی‌گوید، مانند غنی (بی‌نیاز) و امثال آن. مگر برخی از آن‌ها که همه این‌ها را معانی‌ای قائم به ذات خداوند دانسته‌اند که نه عین او هستند و نه غیر او، بلکه اعیانی (ذواتی) هستند که بر ذات او افزوده‌اند. و استاد ابواسحاق، هفت صفت را اصول قرار داد، نه اعیانی زائد بر ذات او که ذاتش به آن‌ها متصف شده باشد. و هر اسمی را بر حسب دلالتی که می‌دهد قرار داد. پس صفات تنزیه را همگی در جدول اسم «الحی» (زنده) قرار داد، و «الخبیر» (آگاه)، «الحسیب» (حسابگر)، «العلیم» (دانا) و خواهران آن‌ها را در جدول علم قرار داد، و اسم «الشکور» (سپاسگزار) را در جدول کلام قرار داد. و همین‌طور حق (الحق) هر صفت از این هفت صفت را با آنچه از اسماء به لحاظ معنا با آن تناسب دارد، مرتبط ساخت؛ مانند «الخالق» (آفریننده) و «الرازق» (روزی‌دهنده) برای قدرت، و غیره، بر این شیوه. این مذهب استاد است. و متکلمان اشاعره اجماع کردند بر اینکه اموری زائد بر ذات وجود دارد و بر آن ادله‌ای اقامه کردند. سپس آن‌ها با وجود اجماع بر امر زائد، دلیل قاطعی نیافتند بر اینکه آیا این امر زائد بر ذات، یک عین واحد است که احکام مختلفی دارد (اگرچه زائد بودن آن ضروری است)، یا اینکه این امر زائد، اعیان متعددی است. حاذقان آن‌ها در این باره چیزی نگفتند، بلکه برخی گفتند: ممکن است امر در نفس خود به یک عین واحد بازگردد و ممکن است به اعیان مختلف بازگردد، اما زائد بودن آن ضروری است. و فایده‌ای که این متکلم با خود آورده، جز عدم کنترل نیست. زیرا اگر ذات، یک عین واحد زائد را بپذیرد، جایز است که اعیان کثیره‌ای زائد بر ذات خود را بپذیرد، در نتیجه قدما (صفات ازلی) از نظر کثرت قابل شمارش نخواهند بود، و این مذهب ابوبکر بن الطیب است. و اختلاف در این باره به درازا می‌کشد. و راه ما بر این بنا نشده است، منظورم در رد بر آن‌ها و منازعه با آن‌ها نیست، بلکه راه ما تبیین مآخذ هر طایفه و این است که از کجا آن را در نحله خود پذیرفته‌اند و چه چیزی بر آن‌ها تجلی کرده است، و آیا این در سعادت آن‌ها تأثیر می‌گذارد یا خیر. این بهره اهل طریق الله از علم به خداوند است. پس ما به رد بر هیچ یک از خلق خدا نمی‌پردازیم، بلکه چه بسا برای آن‌ها در این باره عذر می‌آوریم، به دلیل وسعت الهی. زیرا خداوند برای کسی که با خداوند، معبود دیگری را می‌خواند، عذری اقامه کرده است، با برهانی که در گمان خود آن را دلیل می‌بیند. پس خداوند عز من قائل فرمود: **«وَمَنْ يَدْعُ مَعَ اللَّهِ إِلَهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ»** (و هر کس با خداوند، معبود دیگری را بخواند که برهانی برای آن ندارد) [مؤمنون: ۱۱۷].\n\n### [خیر و شر و نسبت دادن آن‌ها به خداوند]\n\nو از اصول آن‌ها، ادب با خداوند متعال است. پس او را جز به آنچه خود را نامیده، نمی‌نامند و جز آنچه خود به خویش نسبت داده، به او نسبت نمی‌دهند. چنانکه خداوند متعال فرمود: **«مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ»** (آنچه از نوی به تو رسد، از جانب خداست) [نساء: ۷۹]. و در مورد بدی فرمود: **«وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ»** (و آنچه از بدی به تو رسد، از جانب خود توست) [نساء: ۷۹]. سپس فرمود: **«قُلْ كُلٌّ مِنْ عِنْدِ اللَّهِ»** (بگو همه از نزد خداست) [نساء: ۷۸]. این را در مورد هر دو امر هنگامی که آن‌ها را جمع کنی، فرمود، نه اینکه بگویی «از خداست». پس لفظ را رعایت کن و بدان که جمعِ امر، حقیقتی دارد که با حقیقت هر مفردی که تنها باشد و با غیر خود جمع نشود، متفاوت است؛ مانند سیاهی مرکب بین مازو و زاج. پس خداوند سبحان بین آنچه از اوست و آنچه از نزد اوست، فرق گذاشت. در حق طایفه‌ای مخصوص می‌فرماید: **«وَاللَّهُ خَيْرٌ وَأَبْقَى»** (و خداوند بهتر و پایدارتر است) [طه: ۷۳]، با صیغه تفضیل و بدون تناسب. و در حق طایفه دیگری که صفتشان معین است، فرمود: **«وَمَا عِنْدَ اللَّهِ خَيْرٌ وَأَبْقَى»** (و آنچه نزد خداست بهتر و پایدارتر است) [قصص: ۶۰]. پس آنچه نزد اوست، عین آنچه از اوست و نه عین هویت اوست. پس بین دو طایفه، به اندازه تفاوت بین دو منزلت، فرق گذاشت. چنانکه به یکی گفته شد: برای خانواده‌ات چه گذاشتی؟ گفت: خدا و رسولش. و به دیگری گفته شد، گفت: نصف مالم. پس فرمود: بین شما دو نفر، به اندازه تفاوت بین دو کلام شماست، یعنی در منزلت. پس اگر بنده از هر آنچه غیر اوست بگیرد، آن را در «الله خیر و أبقی» قرار می‌دهد. و اگر آن را از وجهی از عالم بگیرد که مستلزم حجاب و دوری و مذمت است، آن را در «ما عند الله خیر و أبقی» قرار می‌دهد. پس مراتب را متمایز ساخت. سپس او سبحان، ما را با اهل ادب و منزلت آن‌ها از علم به خود آشنا ساخت. پس از ابراهیم خلیل خود فرمود که گفت: **«الَّذِي خَلَقَنِي فَهُوَ يَهْدِينِ * وَالَّذِي هُوَ يُطْعِمُنِي وَيَسْقِينِ»** (آن کس که مرا آفرید، پس او مرا هدایت می‌کند * و آن کس که او مرا می‌خوراند و سیراب می‌کند) [شعراء: ۷۸-۷۹]. و نگفت: مرا گرسنه می‌کند. و **«وَإِذَا مَرِضْتُ»** (و هنگامی که بیمار شوم) [شعراء: ۸۰] و نگفت: مرا بیمار کرد، **«فَهُوَ يَشْفِينِ»** (پس او مرا شفا می‌دهد) [شعراء: ۸۰]. پس شفا را به خود نسبت داد و بیماری را به نفس خود، اگرچه همه از نزد اوست. اما او تعالی رسولان خود را ادب آموخت، زیرا نفس‌ها بیماری را نمی‌پذیرند، بر خلاف مرگ. زیرا فاضلان از عقلا و عارفان، مرگ را برای رهایی از این زندان می‌طلبند، و انبیا آن را برای لقاء الله (دیدار خداوند) که در آن نهفته است، می‌طلبند، و همچنین اهل الله. به همین دلیل، هیچ پیامبری در مورد مرگ مخیر نشد مگر اینکه آن را انتخاب کرد، زیرا در آن لقاء الله است، پس آن نعمتی از جانب او و منتی بر اوست. و بیماری، مشغله‌ای است که بنده را از انجام حقوق الهی که خداوند بر او واجب کرده، باز می‌دارد، به دلیل احساس درد در حالی که در محل تکلیف است. و جز روح حیوانی درد را احساس نمی‌کند، پس روح مدبر جسد را از آنچه در این دنیا به آن فراخوانده شده، مشغول می‌سازد. به همین دلیل، بیماری را به خود نسبت داد و شفا و مرگ را به حق (الحق). همان‌گونه که یار موسی (علیه السلام) (خضر) در نسبت دادن سوراخ کردن کشتی به خود عمل کرد، زیرا سوراخ کردن آن را عیب قرار داد، و کشتن پسر را به خود و پروردگارش نسبت داد، به دلیل رحمتی که در آن برای والدینش بود، و آنچه از آن برای آن‌ها ناخوشایند بود را به خود نسبت داد. و برپا کردن دیوار را به پروردگارش نسبت داد، به دلیل صلاح و خیری که در آن بود. پس خداوند متعال از بنده خود خضر در مورد سوراخ کردن کشتی فرمود: **«فَأَرَدْتُ أَنْ أَعِيبَهَا»** (پس خواستم آن را معیوب سازم) [کهف: ۷۹]، برای تنزیه از اینکه به جناب عالی آنچه ظاهرش در عرف و عادت مذموم است، نسبت داده شود. و در مورد برپا کردن دیوار، چون برپا کردن آن را رحمتی برای دو یتیم قرار داد، به دلیل خیری که همان گنج بود و به آن می‌رسیدند، فرمود: **«فَأَرَادَ رَبُّكَ»** (پس پروردگار تو خواست) [کهف: ۸۲]، موسی (علیه السلام) را خبر می‌دهد که **«أَنْ يَبْلُغَا أَشُدَّهُمَا وَيَسْتَخْرِجَا كَنْزَهُمَا رَحْمَةً مِنْ رَبِّكَ»** (که به رشد برسند و گنج خود را بیرون آورند، رحمتی از جانب پروردگار تو). و در حق پسر به موسی گفت که او کافر سرشته شده بود، و کفر صفتی مذموم است. خداوند متعال فرمود: **«وَلَا يَرْضَى لِعِبَادِهِ الْكُفْرَ»** (و کفر را برای بندگانش نمی‌پسندد) [زمر: ۷]. و خواست به او خبر دهد که خداوند والدین او را به چیزی بهتر از او از نظر پاکی و نزدیک‌تر از نظر رحمت، تبدیل خواهد کرد. پس خواست آنچه در این مسئله از عیب در نظر موسی (علیه السلام) بود، آنجا که آن را منکری از منکرات و کشتن نفس پاک بدون جرمی قرار داد، به خود نسبت دهد. فرمود: **«فَأَرَدْنَا أَنْ يُبْدِلَهُمَا رَبُّهُمَا»** (پس خواستیم که پروردگارشان آن دو را [بهتر از او] تبدیل کند) [کهف: ۸۱]. پس نون جمع را آورد. زیرا در کشتن او دو امر وجود داشت: امری که به خیر می‌انجامید و امری که در نظر موسی و در عرف معمول، به غیر آن می‌انجامید. پس آنچه از خیر در این فعل بود، از حیث ضمیر نون، از آنِ خداوند بود، و آنچه از منکر در ظاهر امر و در نظر موسی (علیه السلام) در آن زمان بود، از حیث ضمیر نون، از آنِ خضر بود. پس نون جمع دو وجه دارد، به دلیل جمعی که در آن است: یک وجه به سوی خیر که امر را به خداوند نسبت داد، و یک وجه به سوی عیب که عیب را به خود نسبت داد. و این مسئله و واقعه را در وسط قرار داد، نه در طرف، بین کشتی و دیوار، تا آنچه از عیب در آن است از جهت کشتی باشد و آنچه از خیر در آن است از جهت دیوار باشد. اگر مسئله پسر در ابتدا یا انتها قرار می‌گرفت، حکمت اقتضا نمی‌کرد که هر وجهی خالص باشد بدون اینکه چیزی از خیر یا ضد آن با آن آمیخته شود. اگر در ابتدا بود و کشتی در وسط، خیر موجود در مسئله پسر که برای او و والدینش بود، به خیر موجود در دیوار نمی‌رسید مگر اینکه از حضرة مصیبت ظاهری که همان کشتی است، عبور کند و در آن هنگام به خیر موجود در دیوار متصل شود. و اگر دیوار در وسط بود و سخن از پسر به تأخیر می‌افتاد، عیب کشتی به اتصال با عیب پسر نمی‌رسید مگر اینکه از خیر موجود در دیوار عبور کند، پس از غیر مناسب عبور می‌کرد. و از شأن حضرات این است که اعیان اشیاء، یعنی صفات آن‌ها را، هنگامی که از آن‌ها عبور می‌کنند، دگرگون سازند. پس مسئله پسر در وسط بود، به طوری که وجه عیب به سمت کشتی و وجه خیر به سمت دیوار متمایل شد و حکمت استوار گشت. اگر بگویی: پس چرا در ضمیر نون، یعنی نون «فَأَرَدْنَا»، بین خداوند و خود جمع کرد؟ و رسول خدا (صلی الله علیه و سلم) هنگامی که شنید یکی از خطبا بین خداوند متعال و رسول خدا (صلی الله علیه و سلم) در یک ضمیر جمع کرد، در سخن خود که گفت: «و هر کس از آن دو نافرمانی کند»، فرمود: «چه خطیب بدی هستی!»\n\nپس بدان که این از همان بابی است که ما مقرر کردیم، و آن این است که به حق (الحق) جز آنچه حق (الحق) به خود نسبت داده یا رسولش به آن امر کرده یا کسی که خداوند از نزد خود به او علمی داده، مانند خضر که در نص آمده است، نسبت داده نمی‌شود. پس این (کار خضر) از آن باب است. اما چون این خطیب از علم لدنی (علم لدنی) عاری بود و رسول خدا (صلی الله علیه و سلم) پیش از آن به او اجازه چنین کاری را نداده بود، به همین دلیل او را مذمت کرد و فرمود: «چه خطیب بدی هستی!» زیرا شایسته بود که بین حق (الحق) و خلق در یک ضمیر جمع نکند، مگر با اذن الهی از رسول یا علم لدنی. و هیچ یک از این دو امر نزد او نبود. به همین دلیل رسول خدا (صلی الله علیه و سلم) او را مذمت کرد. در حالی که رسول خدا (صلی الله علیه و سلم) در حدیثی که از او روایت کرده‌ایم، در خطبه‌ای که ایراد کرد، خداوند متعال را در آن ذکر کرد و خود را نیز ذکر کرد، سپس بین پروردگار متعال و خود در آن خطبه در یک ضمیر جمع کرد و فرمود: «هر کس از خدا و رسولش اطاعت کند، هدایت یافته است، و هر کس از آن دو نافرمانی کند، جز به خود زیان نمی‌رساند و به خداوند هیچ زیانی نمی‌رساند.»\n\nو او (صلی الله علیه و سلم) **«وَمَا يَنْطِقُ عَنِ الْهَوَى * إِنْ هُوَ إِلَّا وَحْيٌ يُوحَى»** (و از روی هوی و هوس سخن نمی‌گوید * سخن او جز وحی‌ای که به او نازل می‌شود، نیست) [نجم: ۳-۴]. و همچنین خضر گفت: **«وَمَا فَعَلْتُهُ عَنْ أَمْرِي»** (و من آن را از پیش خود انجام ندادم) [کهف: ۸۲]، یعنی تمام آنچه از اعمال انجام داد و تمام آنچه از اقوال در بیان آن به موسی (علیه السلام) گفت. پس بفهم.\n\n### [سواران (الرکبان) مرادان هستند نه مریدان]\n\nپس با این، آنچه در اصول آن‌ها کفایت می‌کند را برای تو بیان کردم. سواران (الرکبان) همان مرادان (المرادون) و مجذوبان هستند که اسرارشان در تخم‌ها (پوسته) محفوظ است و هوایی به آن‌ها راه نمی‌یابد، مانند حوریان چشم‌فروهشته که در خیمه‌ها محصورند، **«كَأَنَّهُنَّ بَيْضٌ مَكْنُونٌ»** (گویی آن‌ها تخم‌های [شترمرغ] پوشیده شده [و محفوظ] هستند) [صافات: ۴۹].\n\n### [صفات سواران (الرکبان)]\n\nو از صفات آن‌ها این است که هنگام خواب چهره‌های خود را نمی‌پوشانند و جز بر پشت خود نمی‌خوابند. برای آن‌ها تلقی (دریافت) وجود دارد. حرکت نمی‌کنند مگر به امر الهی، و ساکن نمی‌شوند مگر به همین صورت، با اراده‌ای که اراده آن‌ها همان چیزی است که برایشان اراده شده است. و چون سکون امری عدمی بود، به همین دلیل اراده را به آن قرین ساختیم نه امر را. و چون حرکت امری وجودی بود، به همین دلیل امر الهی را به آن قرین ساختیم، اگر فهمیدی. و آن‌ها (رضی الله عنهم) نه مزاحمت می‌کنند و نه مورد مزاحمت قرار می‌گیرند. بیشتر آنچه بر زبانشان جاری می‌شود، «ما شاء الله» (آنچه خدا خواست) است. ابرها برایشان مسخر شده‌اند. آن‌ها قدم راسخ در علم غیوب دارند. برای آن‌ها در هر شب، معراج روحانی است، بلکه در هر خوابی از شب یا روز، بر بواطن عالم اشراف دارند و ملکوت آسمان‌ها و زمین را دیده‌اند. خداوند متعال می‌فرماید: **«وَكَذَلِكَ نُرِي إِبْرَاهِيمَ مَلَكُوتَ السَّمَاوَاتِ وَالْأَرْضِ وَلِيَكُونَ مِنَ الْمُوقِنِينَ»** (و این‌گونه ملکوت آسمان‌ها و زمین را به ابراهیم نشان دادیم تا از یقین‌کنندگان باشد) [انعام: ۷۵]. و در حق رسول خدا (صلی الله علیه و سلم) فرمود: **«سُبْحَانَ الَّذِي أَسْرَى بِعَبْدِهِ لَيْلًا مِنَ الْمَسْجِدِ الْحَرَامِ إِلَى الْمَسْجِدِ الْأَقْصَى الَّذِي بَارَكْنَا حَوْلَهُ لِنُرِيَهُ مِنْ آيَاتِنَا»** (منزه است آن کس که بنده‌اش را شبانه از مسجدالحرام به سوی مسجدالاقصی که اطراف آن را برکت دادیم، سیر داد تا از آیات خود به او نشان دهیم) [اسراء: ۱]. و این عین معراج اوست. و علما وارثان انبیا هستند. حال آن‌ها کتمان (پنهان‌کاری) است؛ اگر تکه‌تکه شوند، آنچه نزد آن‌هاست شناخته نمی‌شود. به همین دلیل خضر گفت: **«وَمَا فَعَلْتُهُ عَنْ أَمْرِي»**. پس کتمان از اصول آن‌هاست، مگر اینکه به افشا و اعلان امر شوند. و **«وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ»** (و خداوند حق را می‌گوید و او راه را می‌نمایاند) [احزاب: ۴]."
  },
  "page_count": 5
}