{
  "id": 188,
  "title": {
    "ar": "الباب الثامن والثمانون ومائة في معرفة مقام الرؤيا وهي المبشرات",
    "en": "Chapter One Hundred and Eighty-Eight: On the Knowledge of the Station of the Vision (مقام الرؤيا), which are the Glad Tidings (المبشرات).",
    "ur": "باب ایک سو اٹھاسیواں: رویا کے مقام کی معرفت کے بیان میں، اور یہ (رویا) ہی مبشرات ہیں۔",
    "fa": "باب صد و هشتاد و هشتم در معرفت مقام رؤیا که همان مژده‌دهندگان (المبشرات) است."
  },
  "content": {
    "ar": "## (الباب الثامن والثمانون ومائة في معرفة مقام الرؤيا وهي المبشرات)\n\n\n> بالصدق رؤيا الرجال الصادقين ومن *** يصاحب الضد لم تصدق له رؤيا\n\n\n> الصدق بالعدوة القصوى منازله *** وضده ضده بالعدوة الدنيا\n\n\n> هي النبوة إلا أنها قصرت *** عن نسخ شرع وهذي رتبة عليا\n\n\n> إني رأيت سيوفا للهوى انتضيت *** وفي يميني سيف للهوى دنيا\n\n\n> فما تركت لها عينا ولا أثرا *** بذلك السيف في الأخرى وفي الدنيا\n\n\n### [أن للإنسان حالتين حالة النوم وحالة اليقظة]\n\n\nاعلم أيدك الله أن للإنسان حالتين حالة تسمى النوم وحالة تسمى اليقظة وفي كلتا الحالتين قد جعل الله له إدراكا يدرك به الأشياء تسمى تلك الإدراكات في اليقظة حسا وتسمى في النوم حسا مشتركا فكل شي‏ء تبصره في اليقظة يسمى رؤية وكل ما تبصره في النوم يسمى رؤيا مقصورا وجميع ما يدركه الإنسان في النوم هو مما ضبطه الخيال في حال اليقظة من الحواس وهو على نوعين إما ما أدرك صورته في الحس وإما ما أدرك أجزاء صورته التي أدركها في النوم بالحس لا بد من ذلك فإن نقصه شي‏ء من إدراك الحواس في أصل خلقته فلم يدرك في اليقظة ذلك الأمر الذي فقد المعنى الحسي الذي يدركه به في أصل خلقته فلا يدركه في النوم أبدا فالأصل الحس والإدراك به في اليقظة والخيال تبع في ذلك وقد يتقوى الأمر على بعض الناس فيدركون في اليقظة ما كانوا يدركونه في النوم وذلك نادر وهو لأهل هذا الطريق من نبي وولي هكذا عرفناه فإذا علمت هذا\n\n\n### [خطاب الله تعالى أو كلام الله تعالى أنبيائه في حالة النوم أو اليقظة]\n\n\nفاعلم أيضا أن النبوة خطاب الله تعالى أو كلام الله تعالى كيفما شئت قلت لمن شاء من عباده في هاتين الحالتين من يقظة ومنام وهذا الخطاب الإلهي المسمى نبوة على ثلاثة أنواع نوع يسمى وحيا ونوع يسمعه كلامه من وَراءِ حِجابٍ ونوع بوساطة رسول فيوحي ذلك الرسول من ملك أو بشر بإذن الله ما يشاء لمن أرسله إليه وهو كلام الله إذ كان هذا الرسول إنما يترجم عن الله كما قال تعالى وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ أَوْ يُرْسِلَ رَسُولًا فالوحي منه ما يلقيه إلى قلوب عباده من غير واسطة فأسمعهم في قلوبهم حديثا لا يكيف سماعه ولا يأخذه حد ولا يصوره خيال ومع هذا يعقله ولا يدري كيف جاء ولا من أين جاء ولا ما سببه وقد يكلمه من وراء حجاب صورة ما يكلمه به وقد يكون الحجاب بشريته وقد يكون الحجاب كما كلم موسى من الشَّجَرَةِ ... من جانِبِ الطُّورِ الْأَيْمَنِ له لأنه لو كلمه من الأيسر الذي هو جهة قلبه ربما التبس عليه بكلام نفسه فجاءه الكلام من الجانب الذي لم تجر العادة أن تكلمه نفسه منه وقد يكلمه بوساطة رسول من ملك كقوله نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ يعني بالقرآن الذي هو كلام الله وقد يكون بوساطة بشر وهو قوله فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله فأضاف الكلام إلى الله وما سمعته الصحابة ولا هذا الأعرابي إلا من لسان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وليست النبوة بأمر زائد على الإخبار الإلهي بهذه الأقسام والقرآن خبر الله وهو النبوة كلها لأنه الجامع لجميع ما أراد الله أن يخبر به عباده وصح في الحديث أنه من حفظ القرآن فقد أدرجت النبوة بين جنبيه‏\n\n\nفإذا تقرر ما ذكرناه‏\n\n\n### [أن مبدأ الوحي الرؤيا الصادقة]\n\n\nفاعلم أن مبدأ الوحي الرؤيا الصادقة وهي لا تكون إلا في حال النوم‏\n\n\nقالت عائشة في الحديث الصحيح أول ما بدي‏ء به رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من الوحي الرؤيا الصادقة\n\n\nفكان لا يرى رؤيا إلا جاءت مثل فلق الصبح وسبب ذلك صدقه ص‏\n\n\nفإنه ثبت عنه أنه قال أصدقكم رؤيا أصدقكم حديثا\n\n\nفكان لا يحدث أحدا صَلَّى اللهُ عَليهِ وسَلَّم بحديث عن تزوير يزوره في نفسه بل يتحدث بما يدركه بإحدى قواه الحسية أو بكلها ما كان يحدث بالغرض ولا يقول ما لم يكن ولا ينطق في اليقظة عن شي‏ء يصوره في خياله مما لم ير لتلك الصورة بجملتها عينا في الحس فهذا سبب صدق رؤياه وإنما بدي‏ء الوحي بالرؤيا دون الحس لأن المعاني المعقولة أقرب إلى الخيال منها إلى الحس لأن الحس طرف أدنى والمعنى طرف أعلى وألطف والخيال بينهما والوحي معنى فإذا أراد المعنى أن ينزل إلى الحس فلا بد أن يعبر على حضرة الخيال قبل وصوله إلى الحس والخيال من حقيقته أن‏\nيصور كل ما حصل عنده في صورة المحسوس لا بد من ذلك فإن كان ورود ذلك الوحي الإلهي في حال النوم سمي رؤيا وإن كان في حال اليقظة سمي تخيلا أي خيل إليه فلهذا بدي‏ء الوحي بالخيال ثم بعد ذلك انتقل الخيال إلى الملك من خارج فكان يتمثل له الملك رجلا أو شخصا من الأشخاص المدركة بالحس فقد ينفرد هذا الشخص المراد بذلك الوحي بإدراك هذا الملك وقد يدركه الحاضرون معه فيلقي على سمعه حديث ربه وهو الوحي وتارة ينزل على قلبه صَلَّى اللهُ عَليهِ وسَلَّم فتأخذه البرحاء وهو المعبر عنه بالحال فإن الطبع لا يناسبه فلذلك يشتد عليه وينحرف له مزاج الشخص إلى أن يؤدي ما أوحى به إليه ثم يسرى عنه فيخبر بما قيل له وهذا كله موجود في رجال الله من الأولياء والذي اختص به النبي من هذا دون الولي الوحي بالتشريع فلا يشرع إلا النبي ولا يشرع إلا رسول خاصة فيحلل ويحرم ويبيح ويأتي بجميع ضروب الوحي والأولياء ليس لهم من هذا الأمر إلا الإخبار بصحة ما جاء به هذا الرسول وتعيينه حتى يكون هذا التابع على بصيرة فيما تعبده به ربه على لسان هذا الرسول إذ كان هذا الولي لم يدرك زمانه حتى يسمع منه كما سمع أصحابه فصار هذا الولي بهذا النوع من الخطاب بمنزلة الصاحب الذي سمع من لفظ رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ما شرع ولذلك جاء في القرآن أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي وهم هؤلاء الذين ذكرناهم فرب حديث صحيح من طريق رواية الثقات عندنا ليس بصحيح في نفس الأمر فنأخذه على طريق غلبة الظن لا على العلم وهذه الطائفة التي ذكرناها تأخذه من هذا الطريق فنكون من عدم صحة ذلك الخبر الصحيح عندنا على بصيرة أنه ليس بصحيح في نفس الأمر وبالعكس وهو أن يكون الحديث ضعيفا من أجل ضعف الطريق من وضاع فيه أو مدلس وهو في نفس الأمر صحيح فتدرك هذه الطائفة صحته فتكون فيه على بصيرة فهذا معنى قوله تعالى أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي وهم هؤلاء فهم ورثة الأنبياء لاشتراكهم في الخبر وانفراد الأنبياء بالتشريع قال تعالى يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ فجاء بمن وهي نكرة لِيُنْذِرَ يَوْمَ التَّلاقِ فجاء بما ليس بشرع ولا حكم بل بإنذار فقد يكون الولي بشيرا ونذيرا ولكن لا يكون مشرعا فإن الرسالة والنبوة بالتشريع قد انقطعت فلا رسول بعده ولا نبي أي لا مشرع ولا شريعة فاعلم ذلك فلنرجع إلى ما بوبنا عليه‏\n\n\nثبت عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أنه قال إن الرسالة والنبوة قد انقطعت فلا رسول بعدي ولا نبي قال فشق ذلك على الناس فقال لكن المبشرات فقالوا يا رسول الله وما المبشرات فقال رؤيا المسلم وهي جزء من أجزاء النبوة\n\n\nهذا حديث حسن صحيح من حديث أنس بن مالك حدثنا به إمام المقام بالحرم المكي الشريف تجاه الركن اليماني الذي فيه الحجر الأسود سنة أربع وستمائة شيخنا مكين الدين أبو شجاع زاهر بن رستم الأصفهاني البزار وغيره عن أبي الفتح عبد الملك بن أبي القاسم بن أبي سهل الكرخي الهروي قال أخبرني أبو عامر محمود بن القاسم الأزدي وأبو نصر عبد العزيز بن محمد الترياقي وأبو بكر أحمد بن أبي حاتم العورجي التاجر قالوا أخبرنا محمد بن عبد الجبار الجراحي قال أخبرنا أبو العباس محمد بن أحمد المحبوبي قال أخبرنا أبو عيسى محمد بن عيسى الترمذي قال حدثنا الحسن بن محمد الزعفراني حدثنا عفان بن مسلم حدثنا عبد الواحد حدثنا المختار بن فلفل حدثنا أنس بن مالك قال قال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وذكر هذا الحديث قال وفي الباب عن أبي هريرة وحذيفة وابن عباس وأم كرز\n\n\nفأخبر صَلَّى اللهُ عَليهِ وسَلَّم أن الرؤيا جزء من أجزاء النبوة\n\n\nفقد بقي للناس من النبوة هذا وغيره ومع هذا لا يطلق اسم النبوة ولا النبي إلا على المشرع خاصة فحجر هذا الاسم لخصوص وصف معين في النبوة وما حجر النبوة التي ليس فيها هذا الوصف الخاص وإن كان حجر الاسم فنتأدب ونقف حيث وقف صَلَّى اللهُ عَليهِ وسَلَّم بعد علمنا بما قال وما أطلق وما حجر فنكون على بينة من أمرنا وإذا علمت هذا فلنقل إن الرؤيا ثلاث منها بشرى وهي ما نحن بصدده في هذا الباب ورؤيا مما يحدث المرء به نفسه في اليقظة فيرتقم في خياله فإذا نام أدرك ذلك بالحس المشترك لأنه تصوره في يقظته فبقي مرتسما في خياله فإذا نام وانصرفت الحواس إلى خزانة الخيال أبصرت ذلك وسيأتي علم ذلك كله وصورته والرؤيا الثالثة من الشيطان وروينا في هذا حديثا صحيحا من حديث أبي عيسى الترمذي قال حدثنا نصر بن علي حدثنا عبد الوهاب الثقفي حدثنا أيوب عن محمد بن سيرين عن أبي هريرة قال قال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إذا اقترب الزمان لم تكد رؤيا المؤمن‏\nتكذب وأصدقهم رؤيا أصدقهم حديثا ورؤيا المسلم جزء من ستة وأربعين جزءا من النبوة والرؤيا ثلاث فالرؤيا الصالحة بشرى من الله تعالى ورؤيا من تحزين الشيطان ورؤيا مما يحدث الرجل به نفسه وإذا رأى أحدكم ما يكره فليقم وليتفل ولا يحدث به الناس‏\n\n\nالحديث وقال فيه حديث صحيح وفي حديث أبي قتادة عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إذا رأى أحدكم شيئا يكرهه فلينفث عن يساره ثلاث مرات وليستعذ بالله من شرها فإنها لا تضره‏\n\n\nوهو حديث حسن صحيح وفي الحديث الصحيح عن النبي صَلَّى اللهُ عَليهِ وسَلَّم أن رؤيا المسلم على رجل طائر ما لم يحدث بها فإذا حدث بها وقعت‏\n\n\n### [إن لله ملكا موكلا بالرؤيا يسمى الروح‏]\n\n\nفاعلم إن لله ملكا موكلا بالرؤيا يسمى الروح وهو دون السماء الدنيا وبيده صور الأجساد التي يدرك النائم فيها نفسه وغيره وصور ما يحدث من تلك الصور من الأكوان فإذا نام الإنسان أو كان صاحب غيبة أو فناء أو قوة إدراك لا يحجبه المحسوسات في يقظته عن إدراك ما بيد هذا الملك من الصور فيدرك هذا الشخص بقوته في يقظته ما يدركه النائم في نومه وذلك أن اللطيفة الإنسانية تنتقل بقواها من حضرة المحسوسات إلى حضرة الخيال المتصل بها الذي محله مقدم الدماغ فيفيض عليها ذلك الروح الموكل بالصور من الخيال المنفصل عن الأذن الإلهي ما يشاء الحق أن يريه هذا النائم أو الغائب أو الفاني أو القوي من المعاني متجسدة في الصور التي بيد هذا الملك فمنها ما يتعلق بالله وما يوصف به من الأسماء فيدرك الحق في صورة أو القرآن أو العلم أو الرسول الذي هو على شرعه فهنا يحدث للرائي ثلاث مراتب أو إحداهن المرتبة الواحدة أن تكون الصورة المدركة راجعة للمرئي بالنظر إلى منزلة ما من منازله وصفاته التي ترجع إليه فتلك رؤيا الأمر على ما هو عليه بما رجع إليه والمرتبة الثانية أن تكون الصورة المرئية راجعة إلى حال الرائي في نفسه والمرتبة الثالثة أن تكون الصورة المرئية راجعة إلى الحق المشروع والناموس الموضوع أي ناموس كان في تلك البقعة التي ترى تلك الصورة فيها في ولاة أمر ذلك الإقليم القائمين بناموسه وما ثم مرتبة رابعة سوى ما ذكرناه فالأولى وهي رجوع الصورة إلى عين المرئي فهي حسنة كاملة ولا بد لا تتصف بشي‏ء من القبح والنقص والمرتبتان الباقيتان قد تظهر الصورة فيهما بحسب الأحوال من الحسن والقبح والنقص والكمال فلينظر إن كان من تلك الصورة خطاب فبحسب ما يكون الخطاب يكون حاله وبقدر ما يفهم منه في رؤياه ولا يعول على التعبير في ذلك بعد الرجوع إلى عالم الحس إلا إن كان عالما بالتعبير أو يسأل عالما بذلك ولينظر أيضا حركته أعني حركة الرائي مع تلك الصورة من الأدب والاحترام أو غير ذلك فإن حاله بحسب ما يصدر منه في معاملته لتلك الصورة فإنها صورة حق بكل وجه وقد يشاهد الروح الذي بيده هذه الحضرة وقد لا يشاهده وما عدا هذه الصورة فليست إلا من الشيطان إن كان فيه تحزين أو مما يحدث المرء به نفسه في حال يقظته فلا يعول على ما يرى من ذلك ومع هذا وكونها لا يعول عليها إذا عبرت كان لها حكم ولا بد يحدث لها ذلك من قوة التعبير لا من نفسها وهو أن الذي يعبرها لا يعبرها حتى يصورها في خياله من المتكلم فقد انتقلت تلك الصورة عن المحل الذي كانت فيه حديث نفس أو تحزين شيطان إلى خيال العابر لها وما هي له حديث نفس فيحكم على صورة محققة ارتسمت في ذاته فيظهر لها حكم أحدثه حصول تلك الصورة في نفس العابر كما جاء في قصة يوسف مع الرجلين وكانا قد كذبا فيما صوراه فكان مما حدثا به أنفسهما فتخيلاه من غير رؤيا وهو أبعد في الأمر إذ لو كان رؤيا لكان أدخل في باب التعبير فلما قصاه على يوسف حصل في خيال يوسف عليه السلام صورة من ذلك لم يكن يوسف حدث بذلك نفسه فصارت حقا في حق يوسف وكأنه هو الرائي الذي رأى تلك الرؤيا لذلك الرجل وقاما له مقام الملك الذي بيده صور الرؤيا فلما عبر لهما رؤياهما قالا له أردنا اختبارك وما رأينا شيئا فقال يوسف قُضِيَ الْأَمْرُ الَّذِي فِيهِ تَسْتَفْتِيانِ فخرج الأمر في الحس كما عبر ثم إن الله تعالى إذا رأى أحد رؤيا فإن صاحبها له فيما رآه حظ من الخير والشر بحسب ما تقتضي رؤياه أو يكون الحظ في ناموس الوقت في ذلك الموضع وأما في الصورة المرئية فلا فيصور الله ذلك الحظ طائرا وهو ملك في صورة طائر كما يخلق من الأعمال صورا ملكية روحانية جسدية برزخية وإنما جعلها في صورة طائر لأنه يقال طار له سهمه بكذا والطائر الحظ قال الله عز وجل قالُوا طائِرُكُمْ مَعَكُمْ أي حظكم ونصيبكم معكم من الخير والشر وبجعل الرؤيا معلقة من رجل هذا الطائر وهي عين الطائر ولما كان الطائر إذا اقتنص شيئا من الصيد من الأرض‏\nإنما يأخذه برجله لأنه لا يد له وجناحه لا يتمكن له الأخذ به فلذلك علق الرؤيا برجله فهي المعلقة وهي عين الطائر فإذا عبرت سقطت لما قيلت له وعند ما تسقط ينعدم الطائر لأنه عين الرؤيا فينعدم بسقوطها ويتصور في عالم الحس بحسب الحال التي تخرج عليه تلك الرؤيا فترجع صورة الرؤيا عين الحال لا غير فتلك الحال إما عرض أو جوهر أو نسبة من ولاية أو غيرها هي عين صورة تلك الرؤيا وذلك الطائر ومنه خلقت هذه الحالة ولا بد سواء كانت جسما أو عرضا أو نسبة أعني تلك الصورة كما خلق آدم من تراب ونحن من ماء مهين حتى إذا دلت الرؤيا على وجود ولد فذلك الولد مخلوق من عين تلك الرؤيا ماء في صلب أبيه وإن كان الماء قد نزل في الرحم تصورت فيه تلك الرؤيا ولد فهو ولدا رؤيا وإن لم تتقدم له رؤيا فهو على أصل نشأته كما هو سائر الأولاد فاعلم ذلك فإنه سر عجيب وكشف صحيح وكل ولد يكون عن رؤيا ترى له تمييزا على غيره ويكون أقرب إلى الأرواح من غيره إن جعلت بالك هكذا تبصره وكل مخلوق من حالة أو عرض أو نسبة من ولاية أو غيرها يكون عن رؤيا يكون له ميز على من ليس عن رؤيا وانظر ذلك في رؤيا آمنة أم رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يبدلك صحة ما ذكرناه فكان صَلَّى اللهُ عَليهِ وسَلَّم عين رؤيا أمه ظهرت في ماء أبيه بتلك الصورة التي رأته أمه ولذلك كثرت المرائي فيه صَلَّى اللهُ عَليهِ وسَلَّم فتميز عن غيره ولا يعرف ما قلناه إلا أهل العلم بصورة الكشف وهو من أسرار الله في خلقه وإن أردت تأنيسا لما ذكرناه‏\n\n\n### [سر عجيب في علم الطبيعة]\n\n\nفانظر في علم الطبيعة إذا توحمت المرأة وهي حامل على شي‏ء خرج الولد يشبه ذلك الشي‏ء وإذا نظرت عند الجماع أو تخيل الرجل صورة عند الوقاع وإنزال الماء يكون الولد على خلق صورة ما تخيل ولذلك كانت الحكماء تأمر بتصوير صور الفضلاء من أكابر الحكماء في الأماكن بحيث تنظر إلى تلك الصورة المرأة عند الجماع والرجل فتنطبع في الخيال فتؤثر في الطبيعة فتخرج تلك القوة التي كانت عليها تلك الصورة في الولد الذي يكون من ذلك الماء وهو سر عجيب في علم الطبيعة وانظر في تكوين عيسى عليه السلام عن مشاهدة مريم جبريل في صورة بشر كيف جمع بين كونه روحا يحيي الموتى وبين كونه بشرا إذا كان الروح به تحيا الأجسام الطبيعية وأقوى من ذلك ما فعله السامري من قبضة أثر جبريل لما علم أن الروح تصحبه الحياة حيث حل فرمى ما قبضه في العجل فخار العجل بذلك الأثر المقبوض من وطء الروح ولو رماه في شكل فرس لصهل أو في شكل إنسان نطق فإن الاستعداد لما ظهر بالحياة إنما كان للقابل ومن هنا تعرف صورة الظاهر في المظاهر وأن المظاهر تعطي باستعدادها في الظاهر فيها ما يظهر به من الصور الحاملة والمحمولة ولهذا أظهر الله هذه الحكمة لتقف من ذلك على ما هو الأمر عليه ثم إن تسمية النبي صَلَّى اللهُ عَليهِ وسَلَّم لها بشرى ومبشرة لتاثيرها في بشرة الإنسان فإن الصورة البشرية تتغير بما يرد عليها في باطنها مما تتخيله من صورة تبصرها أو كلمة تسمعها إما بحزن أو فرح فيظهر لذلك أثر في البشرة لا بد من ذلك فإنه حكم طبيعي أودعه الله في الطبيعة فلا يكون إلا هكذا\n\n\n(تكملة) للرؤيا مكان ومحل وحال‏\n\n\nفحالها النوم وهو الغيبة عن المحسوسات الظاهرة الموجبة للراحة لأجل التعب الذي كانت عليه هذه النشأة في حال اليقظة من الحركة وإن كان في هواها قال تعالى وجَعَلْنا نَوْمَكُمْ سُباتاً يقول وجعلنا النوم لكم راحة تستريح به النفوس وهو على قسمين قسم انتقال وفيه بعض راحة أو نيل غرض أو زيادة تعب والقسم الآخر قسم راحة خاصة وهو النوم الخالص الصحيح الذي ذكر الله أنه جعله راحة لما تعبت فيه هذه الآلات والجوارح والأعضاء البدنية في حال اليقظة وجعل زمانه الليل وإن وقع بالنهار كما جعل النهار للمعاش وإن وقع بالليل ولكن الحكم للغالب فأما قسم الانتقال فهو النوم الذي يكون معه الرؤيا فتنقل هذه الآلات من ظاهر الحس إلى باطنه ليرى ما تقرر في خزانة الخيال الذي رفعت إليه الحواس ما أخذته من المحسوسات وما صورته القوة المصورة التي هي من بعض خدم هذه الخزانة لترى هذه النفس الناطقة التي ملكها الله هذه المدينة ما استقر في خزانتها كما جرت العادة في الملوك إذا دخلوا خزائنهم في أوقات خلواتهم ليطلعوا على ما فيها وعلى قدر ما كمل لهذه النشأة من الآلات التي هي الجوارح والخدام الذين هم القوي الحسية يكون الاختزان فثم خزانة كاملة لكمال الحياة وثم خزانة ناقصة كالأكمه فإنه لا ينتقل إلى خزانة خياله صور الألوان والخرس لا ينتقل إلى خزانة الخيال صور الأصوات ولا الحروف اللفظية هذا كله إذا عدمها في أصل نشأته وأما إذا طرأت عليه هذه الآفات فلا فإنه إذا انتقل بالنوم إلى‏\nباطن النشأة ودخل الخزانة وجد صور الألوان التي اختزنها فيها قبل طرق الآفة وكذلك كل ما أعطته قوة من قوى الحس الذين هم جباة هذه المملكة ولله تجل في هذه الخزانة في صورة طبيعية بصفات طبيعية مثل‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم رأيت ربي في صورة شاب‏\n\n\nوهو ما يراه النائم في نومه من المعاني في صور المحسوسات لأن الخيال هذه حقيقته أن يجسد ما ليس من شأنه أن يكون جسدا وذلك لأن حضرته تعطي ذلك وما ثم في طبقات العالم من يعطي الأمر على ما هو عليه سوى هذه الحضرة الخيالية فإنها تجمع بين النقيضين وفيها تظهر الحقائق على ما هي عليه لأن الحق في الأمور أن تقول في كل أمر تراه أو تدركه بأي قوة كان الإدراك إن ذلك الذي أدركته هو لا هو كما قال وما رَمَيْتَ إِذْ رَمَيْتَ فلا تشك في حال الرؤيا في الصورة التي تراها أنها عين ما قيل لك إنه هو وما تشك في التعبير إذا استيقظت أنه ليس هو ولا تشك في النظر الصحيح أن الأمر هو لا هو قيل لأبي سعيد الخراز بم عرفت الله قال بجمعه بين الضدين فكل عين متصفة بالوجود فهي لا هي فالعالم كله هو لا هو والحق الظاهر بالصورة هو لا هو فهو المحدود الذي لا يحد والمرئي الذي لا يرى وما ظهر هذا الأمر إلا في هذه الحضرة الخيالية في حال النوم أو الغيبوبة عن ظاهر المحسوسات بأي نوع كان وهي في النوم أتم وجودا وأعمه لأنه للعارفين والعامة وحال الغيبة والفناء والمحو وشبه ذلك ما عدا النوم لا يكون للعامة في الإلهيات فما أوجد الله شيئا من الكون على صورة الأمر على ما هو عليه في نفسه إلا هذه الحضرة فلها الحكم العام في الطرفين كما للممكن قبول النقيضين فيكون له ذلك ذوقا فإن الذي يستحيل عليه العدم وإن كان له العلم بالعدم لا يكون علمه ذاتيا وهو الذي يسمى ذوقا بخلاف الممكن فإن العدم له ذوق والذي يستحيل عليه الوجود والعلم به لا ذوق له في الوجود رأسا والممكن له في الوجود ذوق فأوجد الله هذه الحضرة الخيالية ليظهر فيها الأمر الذي هو الأصل على ما هو عليه‏\n\n\n### [النوم معبر]\n\n\nفاعلم أن الظاهر في المظاهر مظاهر الأعيان هو الوجود الحق وأنه ما هو لما ظهر به من الأشكال والنعوت التي أعيان الممكنات عليها وجعل هذه الحضرة كالجسر بين الشطين للعبور عليه من هذا الشط إلى هذا الشط فجعل النوم معبرا وجعل المشي عليه عبورا قال تعالى إِنْ كُنْتُمْ لِلرُّءْيا تَعْبُرُونَ وجعل إدراك ذلك في حالة تسمى راحة وهي النوم من حقيقة قوله ولَقَدْ خَلَقْنَا السَّماواتِ والْأَرْضَ وما بَيْنَهُما في سِتَّةِ أَيَّامٍ فأضاف العمل إليه وذكر في الخلق أنه بيديه وبأيد وبيده وبقوله ثم أعلمنا أنه وإن اتصف بالعمل إنه لم يؤثر فيه تعب فقال وما مَسَّنا من لُغُوبٍ وقال ولَمْ يَعْيَ بِخَلْقِهِنَّ فمن هذه الحقيقة ظهرت الأعمال العظيمة المحرجة المتعبة في النوم الذي هو راحة البدن أي الطبيعة مستريحة في هذه الحال من الحركات الحسية الظاهرة فهذا هو العمل العظيم في راحة من حيث لا يشعر إنه في راحة ولا سيما إذا رأى في النوم أمورا هائلة مفزعة فإذا استيقظ وجد الراحة فعلم أنه كان في راحة من حيث لا يشعر ومنهم من يعلم في النوم أنه في النوم والناس فيه على طبقات وإنما سمينا هذه الحالة بانتقال لأن المعاني تنتقل من تجريدها عن المواد إلى لباس المواد كظهور الحق في صور الأجسام والعلم في صورة اللبن وما أشبه ذلك والانتقال الثاني انتقال الحواس من الظاهر المحسوس إلى هذه الحضرة بالظاهر المحسوس ولكن له في هذه الحضرة ثبوته الذي له في حضرة اليقظة فإنه سريع التبدل في هذه الحضرة كما يتبدل في اليقظة في صور مختلفة في باطنه لا في ظاهره فباطنه في اليقظة هي هذه الحضرة وجعل الليل لباسا لها فإن الليل لا يعطي للناظر في نظرة سوى نفسه فهو يدرك ولا يدرك به فإنه غيب وظلمة والغيب والظلمة يدركان ولا يدرك بهما والضوء يدرك ويدرك به وهو حال اليقظة فلهذا تعبر الرؤيا ولا يعبر ما أدركه الحس فإذا ارتقى الإنسان في درج المعرفة علم أنه نائم في حال اليقظة المعهودة وأن الأمر الذي هو فيه رؤيا إيمانا وكشفا ولهذا ذكر الله أمورا واقعة في ظاهر الحس وقال فاعتبروا وقال إِنَّ في ذلِكَ لَعِبْرَةً أي جوزوا واعبروا مما ظهر لكم من ذلك إلى علم ما بطن به وما جاء له‏\n\n\nقال عليه السلام الناس نيام فإذا ماتوا انتبهوا\n\n\nولكن لا يشعرون ولهذا قلنا إيمانا وقد ذكرنا هذا المقام مستوفى في باب المعرفة من هذا الكتاب وقد تقدم وهو الباب السابع والسبعون ومائة فالوجود كله نوم ويقظته نوم فالوجود كله راحة والراحة رحمة ف وَسِعَتْ كُلَّ شَيْ‏ءٍ فإليها المال تقول الملائكة لله وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً وعِلْماً وهنا سر إن بحثت عليه انتهيت إليه وهو رحمته بالأسماء\nالحسنى في ظهور آثارها فمنتهى علمه منتهى رحمته ثم أرجع وأقول وإن حصل في الطريق تعب فهو تعب في راحة كالأجير يحمل التعب أو يستلذه لما يكون في نفسه من راحة الأجرة التي لأجل حصولها عمل فيحجبه عن التعب وجود راحة الأجرة فإذا قبضها دخل في راحة النوم بالليل فركدت جوارحه عن الحركة فوجد الراحة فانتقل من راحة الأجرة إلى راحة النوم فعلى التحقيق أن صور العالم للحق من الاسم الباطن صور الرؤيا للنائم والتعبير فيها كون تلك الصور أحواله فليس غيره كما أن صور الرؤيا أحوال الرائي لا غيره فما رأى إلا نفسه فهذا هو قوله إنه ما خلق السَّماواتِ والْأَرْضَ وما بَيْنَهُما إِلَّا بِالْحَقِّ وهو عينه وهو قوله في حق العارفين ويَعْلَمُونَ أَنَّ الله هُوَ الْحَقُّ الْمُبِينُ أي الظاهر فهو الواحد الكثير فمن اعتبر الرؤيا يرى أمرا هائلا ويتبين له ما لا يدركه من غير هذا الوجه ولهذا\n\n\nكان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إذا أصبح في أصحابه سألهم هل رأى أحد منكم رؤيا\n\n\nلأنها نبوة فكان يحب أن يشهدها في أمته والناس اليوم في غاية الجهل بهذه المرتبة التي كان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يعتني بها ويسأل كل يوم عنها والجهلاء في هذا الزمان إذا سمعوا بأمر وقع في النوم لم يرفعوا به رأسا وقالوا بالمنامات يريد أن يحكم هذا خيال وما هي إلا رؤيا فيستهونوا بالرائي إذا اعتمد عليها وهذا كله لجهله بمقامها وجهله بأنه في يقظته وتصرفه في رؤيا وفي منامه في رؤيا في رؤيا فهو كمن يرى أنه استيقظ في نومه وهو في منامه وهوقوله عليه السلام الناس نيام‏\n\n\nفما أعجب الأخبار النبوية لقد أبانت عن الحقائق على ما هي عليه وعظمت ما استهونه العقل القاصر فإنه ما صدر إلا من عظيم وهو الحق فهذا معنى قولنا في التقسيم إنه قسم الانتقال وأما القسم الآخر من النوم فهو قسم الراحة وهو النوم الذي لا يرى فيه رؤيا فهو لمجرد الراحة البدنية لا غير فهذا هو حال الرؤيا وبقي معرفة المكان والمحل فأما المحل فهو هذه النشأة العنصرية لا يكون للرؤيا محل غيرها فليس للملك رؤيا وإنما ذلك للنشأة العنصرية الحيوانية خاصة ومحلها في العلم الإلهي الاستحالات في صور التجلي فكل ما نحن فيه رؤيا الحق في راحة ارتفاع الإعياء والتعب لا غير وأما المكان فهو ما تحت مقعر فلك القمر خاصة وفي الآخرة ما تحت مقعر فلك الكواكب الثابتة وذلك لأن النوم قد يكون في جهنم في أوقات ولا سيما في المؤمنين من أهل الكبائر وما فوق فلك الكواكب فلا نوم\n\n\nوأعني به هذا النوم الكائن المعروف في العرف وأما الذي ذهبنا إليه أولا في معرفة حال النوم فذلك أمر آخر قد بيناه وصورة مكانه هكذا فانظر إلى ما صورناه في الهامش وهو هذا هذا صورة مكان الرؤيا وهو يشبه بالقرن وهو الصور أعلاه واسع وأسفله ضيق مقلوب النش‏ء فإن الذي يلي الرأس منه هو الأعلى وهو الأوسع والذي هو الأضيق منه هو الأسفل وهو الذي بعد عن الأصل فذلك القرن مكان الرؤيا فإذا خرج عن هذا الصور خرج عن مكان الرؤيا المعلومة في العرف فلا يرى بعد هذا رؤيا لأنه لا تقوم به صفة نوم فهو في راحة الأبد وهذا القدر كاف فيما نرومه من التعريف بمقام الرؤيا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ والذي سكتنا عنه عظيم لأن الفكر يعجز عن تصوره من أكثر الناس ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ كما إن أَكْثَرَ النَّاسِ لا يُؤْمِنُونَ وإلى العلم يرجع الفقه والعقل في قوله لا يَفْقَهُونَ ولا يَعْقِلُونَ انتهى الجزء السابع عشر ومائة\n\n",
    "en": "## Chapter One Hundred and Eighty-Eight: Concerning the Knowledge of the Station of the Vision (الرؤيا), which is the Glad Tidings (المبشرات)\n\nThe vision of the truthful men is by Truthfulness (الصدق);\nAnd he who accompanies the opposite shall have no truthful vision.\n\nTruthfulness has its stations in the Further Shore (العدوة القصوى),\nAnd its opposite has its opposite in the Nearer Shore (العدوة الدنيا).\n\nIt is Prophethood (النبوة), save that it falls short\nOf abrogating a Law, and this is a lofty degree.\n\nI saw swords drawn against passion (الهوى),\nAnd in my right hand was a sword against worldly passion.\n\nSo I left for it neither eye nor trace,\nWith that sword, in the Hereafter and in the world.\n\n### [Man has two states: Sleep and Wakefulness]\n\nKnow, may God aid you, that man has two states: a state called sleep (النوم) and a state called wakefulness (اليقظة). In both states, God has granted him a perception (إدراك) by which he perceives things. These perceptions are called 'sense' (حس) in wakefulness, and 'common sense' (حس مشترك) in sleep. Everything you see in wakefulness is called *ru'yah* (seeing), and everything you see in sleep is called *ru'ya* (vision).\n\nAll that man perceives in sleep is what the imaginative faculty (الخيال) recorded from the senses during wakefulness. This is of two types: either what he perceived its form through the sense, or what he perceived the parts of its form, which he perceived in sleep, through the sense. This is necessary, for if he lacks any sensory perception in his original creation, such that he did not perceive that thing in wakefulness—the sensory meaning by which he would perceive it in his original creation being lost—then he will never perceive it in sleep. The origin is the sense and perception through it in wakefulness, and the imaginative faculty (الخيال) is secondary to it.\n\nHowever, the matter may be strengthened for some people, such that they perceive in wakefulness what they used to perceive in sleep. This is rare, and it belongs to the people of this Path (الطريق), whether Prophet or Saint (ولي). This is how we have known it. When you have understood this,\n\n### [The Address of God or the Speech of God to His Prophets in the State of Sleep or Wakefulness]\n\nKnow also that Prophethood (النبوة) is the Address of God (خطاب الله تعالى) or the Speech of God (كلام الله تعالى)—whichever you prefer to call it—to whomever He wills among His servants in these two states: wakefulness and sleep. This Divine Address, called Prophethood, is of three types: a type called Revelation (وحي), a type where He hears His Speech from behind a veil (من وَراءِ حِجابٍ), and a type through the mediation of a messenger (رسول). This messenger, whether an angel or a human, reveals by God’s permission whatever the Real (الحق) wills to the one He sent him to. This is the Speech of God, since this messenger only translates on behalf of God, as He the Exalted said: <<وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِن وَرَاءِ حِجَابٍ أَوْ يُرْسِلَ رَسُولًا>> (It is not for any human being that God should speak to him except by revelation, or from behind a veil, or by sending a messenger).\n\nRevelation (الوحي) includes what He casts into the hearts of His servants without intermediary, so He makes them hear a discourse in their hearts whose hearing cannot be qualified, nor is it bound by definition, nor is it depicted by the imaginative faculty (الخيال). Yet, despite this, he comprehends it, without knowing how it came, or from where it came, or what caused it. He may also speak to him from behind a veil, which is the form of what He speaks to him. The veil may be his own humanity, or the veil may be as when He spoke to Moses from the tree... <<مِن جَانِبِ الطُّورِ الْأَيْمَنِ>> (from the right side of the Mount). [He spoke to him from the right side] because if He had spoken to him from the left side, which is the direction of his heart, it might have been confused with his own inner speech. Thus, the Speech came to him from the side from which it was not customary for his soul to speak to him. He may also speak to him through the mediation of an angelic messenger, as in His saying: <<نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَىٰ قَلْبِكَ>> (The Trustworthy Spirit brought it down upon your heart)—meaning the Quran, which is the Speech of God. It may also be through the mediation of a human, which is His saying: <<فَأَجِرْهُ حَتَّىٰ يَسْمَعَ كَلَامَ اللَّهِ>> (Grant him protection until he hears the Speech of God). He attributed the Speech to God, yet the Companions, nor this Bedouin, heard it except from the tongue of the Messenger of God, peace and blessings be upon him.\n\nProphethood is not an affair beyond the Divine Disclosure (الإخبار الإلهي) through these categories. The Quran is the Disclosure of God, and it is the entirety of Prophethood, for it is the compendium of all that God willed to disclose to His servants. It is confirmed in the Hadith that whoever memorizes the Quran has had Prophethood folded between his sides.\n\nIf what we have mentioned is established,\n\n### [The Beginning of Revelation is the Truthful Vision]\n\nThen know that the beginning of Revelation (الوحي) was the Truthful Vision (الرؤيا الصادقة), and this only occurs in the state of sleep.\n\nAisha said in the authentic Hadith: \"The first thing with which the Messenger of God, peace and blessings be upon him, was initiated into Revelation was the Truthful Vision.\"\n\nHe would not see a vision except that it came true like the break of dawn (فلق الصبح). The reason for this was his truthfulness (صدقه). It is confirmed from him that he said: \"The most truthful of you in vision is the most truthful of you in speech.\"\n\nHe, peace and blessings be upon him, would not speak to anyone with a fabricated discourse he invented in his soul, but rather he spoke based on what he perceived through one or all of his sensory faculties. He did not speak based on conjecture, nor did he say what was not, nor did he speak in wakefulness about anything he depicted in his imaginative faculty (الخيال) for which he had not seen the whole form in the sense (الحس). This is the reason for the truthfulness of his visions.\n\nRevelation began with the vision rather than the sense because the intelligible meanings (المعاني المعقولة) are closer to the imaginative faculty (الخيال) than to the sense (الحس), for the sense is the lower extreme, and the meaning is the higher, more subtle extreme, and the imaginative faculty is between them. Revelation is a meaning. If the meaning intends to descend to the sense, it must pass through the Presence of Imagination (حضرة الخيال) before reaching the sense. It is inherent in the reality of the imaginative faculty that it must depict everything that reaches it in the form of the sensible. If the arrival of that Divine Revelation occurs in the state of sleep, it is called a Vision (رؤيا). If it occurs in the state of wakefulness, it is called an Imagining (تخيلا), meaning it was imagined for him.\n\nFor this reason, Revelation began with the imaginative faculty, and then the imaginative faculty transitioned to the Angel from outside, so the Angel would appear to him in the form of a man or one of the sensible persons. Sometimes, the person intended by that Revelation perceives this Angel alone, and sometimes those present with him perceive him. The Angel then casts upon his hearing the discourse of his Lord, which is the Revelation. At other times, [the Revelation] descends upon his heart, peace and blessings be upon him, and he is seized by distress (البرحاء), which is what is expressed as the state (الحال), for his nature is not suited to it. Therefore, it becomes intense for him, and the person's temperament is disturbed until he conveys what was revealed to him. Then the state passes, and he informs [people] of what was said to him.\n\nAll of this is found among the men of God (رجال الله) among the Saints (الأولياء). What distinguishes the Prophet from the Saint in this matter is Revelation concerning legislation (التشريع). Only the Prophet legislates, and specifically only the Messenger legislates, so he permits and prohibits and makes lawful, and he brings all types of Revelation. The Saints have no part in this matter except to confirm the soundness of what this Messenger brought and to specify it, so that the follower may be upon clear insight (بصيرة) regarding what his Lord has commanded him through the tongue of this Messenger, since this Saint did not live in his time to hear from him as his Companions heard. Thus, this Saint, through this type of address, is in the position of the Companion who heard the legislated matter directly from the word of the Messenger of God, peace and blessings be upon him. For this reason, it came in the Quran: <<أَدْعُوا إِلَى اللهِ عَلَىٰ بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي>> (I call to God upon clear insight, I and those who follow me). These are the ones we have mentioned.\n\nMany a Hadith that is sound according to the transmission of trustworthy narrators is not sound in reality (في نفس الأمر). We accept it based on the preponderance of opinion, not on certain knowledge (العلم). This group we mentioned receives it through this path, so we are upon clear insight regarding the lack of soundness of that Hadith—which is sound according to us—that it is not sound in reality. And conversely, a Hadith may be weak due to a weak chain, because of a forger or a deceiver in it, yet it is sound in reality. This group perceives its soundness, and thus they are upon clear insight concerning it. This is the meaning of His saying, the Exalted: <<أَدْعُوا إِلَى اللهِ عَلَىٰ بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي>> (I call to God upon clear insight, I and those who follow me). They are the inheritors of the Prophets due to their sharing in the Disclosure (الخبر), while the Prophets are unique in legislation. The Exalted said: <<يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَىٰ مَن يَشَاءُ مِنْ عِبَادِهِ>> (He casts the Spirit by His command upon whomever He wills among His servants). He used *man* (whomever), which is indefinite, <<لِيُنذِرَ يَوْمَ التَّلَاقِ>> (that he may warn of the Day of Meeting). This came with something that is neither legislation nor ruling, but a warning. Thus, the Saint (الولي) may be a bearer of glad tidings (بشير) and a warner (نذير), but he cannot be a legislator, for the Messengership and Prophethood involving legislation have been cut off. There is no messenger after him, nor any prophet—meaning, no legislator and no new Law (شريعة). Know this. Let us return to the subject of our chapter.\n\nIt is confirmed from the Messenger of God, peace and blessings be upon him, that he said: \"Indeed, Messengership (الرسالة) and Prophethood (النبوة) have been cut off, so there is no messenger after me, nor any prophet.\" The narrator said: This was difficult for the people, so he said: \"But there remain the Glad Tidings (المبشرات).\" They asked, \"O Messenger of God, what are the Glad Tidings?\" He replied, \"The vision (رؤيا) of the Muslim, which is a part of the parts of Prophethood.\"\n\nThis is a sound and good Hadith, narrated by Anas ibn Malik. Our Shaykh, Makin al-Din Abu Shuja' Zahir ibn Rustam al-Isfahani al-Bazzar, and others, narrated it to us in the Holy Sanctuary of Mecca, facing the Yemeni Corner where the Black Stone is, in the year 604 AH, from Abu al-Fath Abd al-Malik ibn Abi al-Qasim ibn Abi Sahl al-Karkhi al-Harawi, who said: Abu Amir Mahmud ibn al-Qasim al-Azdi, Abu Nasr Abd al-Aziz ibn Muhammad al-Tiryaqi, and Abu Bakr Ahmad ibn Abi Hatim al-Awraji the merchant informed me, saying: Muhammad ibn Abd al-Jabbar al-Jarahi informed us, saying: Abu al-Abbas Muhammad ibn Ahmad al-Mahbubi informed us, saying: Abu Isa Muhammad ibn Isa al-Tirmidhi informed us, saying: Al-Hasan ibn Muhammad al-Za'farani narrated to us, saying: Affan ibn Muslim narrated to us, saying: Abd al-Wahid narrated to us, saying: Al-Mukhtar ibn Filfil narrated to us, saying: Anas ibn Malik narrated to us, saying: The Messenger of God, peace and blessings be upon him, said [and he mentioned this Hadith]. He said: And in this chapter, there are narrations from Abu Hurayrah, Hudhayfah, Ibn Abbas, and Umm Kurz.\n\nThus, he, peace and blessings be upon him, informed us that the Vision (الرؤيا) is a part of the parts of Prophethood.\n\nTherefore, this and other things remain for people from Prophethood. Yet, the name 'Prophethood' (النبوة) or 'Prophet' (النبي) is only applied specifically to the Legislator. This name was restricted due to a specific quality in Prophethood. But the Prophethood that does not contain this specific quality was not restricted, even if the name was restricted. So, we maintain proper conduct and stop where he, peace and blessings be upon him, stopped, after knowing what he said, what he released, and what he restricted, so that we may be upon clear evidence in our affair.\n\nIf you know this, let us say that Visions are three: one is Glad Tidings (بشرى), which is our subject in this chapter; a second is what a person talks to himself about in wakefulness, which then becomes imprinted in his imaginative faculty (الخيال), so when he sleeps, he perceives it through the common sense (الحس المشترك) because he pictured it in his wakefulness, and it remained imprinted in his imaginative faculty. When he sleeps and the senses turn toward the treasury of the imaginative faculty, they see that. The knowledge and form of all this will come later. The third vision is from Satan.\n\nWe have narrated an authentic Hadith concerning this from Abu Isa al-Tirmidhi, who said: Nasr ibn Ali narrated to us, saying: Abd al-Wahhab al-Thaqafi narrated to us, saying: Ayyub narrated from Muhammad ibn Sirin, from Abu Hurayrah, who said: The Messenger of God, peace and blessings be upon him, said: \"When time draws near, the vision of the believer will hardly ever lie. And the most truthful of them in vision is the most truthful of them in speech. The vision of the Muslim is one part of forty-six parts of Prophethood. And visions are three: the righteous vision (الرؤيا الصالحة) is glad tidings from God the Exalted; a vision is from the sorrowing of Satan; and a vision is from what a man talks to himself about. If one of you sees what he dislikes, let him stand up and spit, and let him not tell people about it.\"\n\nHe said concerning the Hadith: It is authentic. And in the authentic Hadith from Abu Qatadah, from the Messenger of God, peace and blessings be upon him: \"If one of you sees something he dislikes, let him spit to his left three times and seek refuge in God from its evil, for it will not harm him.\"\n\nThis is a sound and good Hadith. And in the authentic Hadith from the Prophet, peace and blessings be upon him, \"The vision of the Muslim is upon the leg of a bird, as long as he does not speak of it. If he speaks of it, it falls.\"\n\n### [God has an Angel entrusted with the Vision, called the Spirit]\n\nKnow that God has an Angel entrusted with the Vision (الرؤيا) called the Spirit (الروح). He is below the lowest heaven, and in his hand are the forms of the bodies (صور الأجساد) in which the sleeper perceives himself and others, and the forms of the events (الأكوان) that arise from those forms. When a person sleeps, or is in a state of absence (غيبة), or annihilation (فناء), or possesses a power of perception such that sensible things do not veil him in his wakefulness from perceiving the forms in the hand of this Angel, then this person perceives by his power in his wakefulness what the sleeper perceives in his sleep.\n\nThis is because the human subtlety (اللطيفة الإنسانية) moves with its faculties from the Presence of Sensible Things (حضرة المحسوسات) to the imaginative faculty (الخيال) connected to it, whose location is the front of the brain. That Spirit (الروح) entrusted with the forms then pours upon it, from the Separate Imagination (الخيال المنفصل) by Divine Permission, whatever the Real (الحق) wills to show this sleeper, or absent one, or annihilated one, or powerful one, of meanings embodied in the forms that are in the hand of this Angel.\n\nSome of these relate to God and the Names (الأسماء) by which He is described, so he perceives the Real (الحق) in a form, or the Quran, or Knowledge (العلم), or the Messenger who is upon His Law. Here, three ranks (مراتب) occur for the seer, or one of them:\n\n1.  The first rank is that the perceived form relates back to the object seen (المرئي) by considering one of its stations (منازل) or attributes (صفاته) that return to it. That is a vision of the matter as it is, according to what relates back to it.\n2.  The second rank is that the seen form relates back to the state of the seer himself.\n3.  The third rank is that the seen form relates back to the established Law (الحق المشروع) and the laid-down Norm (الناموس الموضوع)—whatever norm it may be—in that region where the form is seen, concerning the rulers of that region who uphold its norm.\n\nThere is no fourth rank besides what we have mentioned. The first rank, which is the return of the form to the essence of the object seen, is necessarily good and perfect; it is not characterized by any ugliness or deficiency. The remaining two ranks, the form may appear in them according to the circumstances, whether beautiful or ugly, deficient or perfect.\n\nLet him observe if there is an address (خطاب) from that form; its state will be according to the address, and according to what he understands from it in his vision. He should not rely on interpretation (التعبير) after returning to the world of sense, unless he is knowledgeable in interpretation or asks someone who is. He should also observe his movement—meaning the movement of the seer—with that form, whether of reverence and respect or otherwise, for his state is according to what issues from him in his interaction with that form, for it is a form of the Real (صورة حق) in every respect. He may witness the Spirit (الروح) who holds this Presence, or he may not witness him.\n\nAnything other than these forms is only from Satan, if it contains sorrowing, or from what the person talks to himself about in his state of wakefulness, so he should not rely on what he sees of that. Nevertheless, even though they should not be relied upon, if they are interpreted, they necessarily acquire a ruling (حكم). This arises from the power of the interpretation, not from the vision itself. This is because the interpreter does not interpret it until he pictures it in his imaginative faculty (الخيال) from the speaker. Thus, that form has moved from the place where it was (inner speech or satanic sorrowing) to the imaginative faculty of the interpreter, and it is not inner speech for him. He then judges based on a verified form that has been imprinted in his essence, and a ruling appears for it, brought about by the presence of that form in the soul of the interpreter.\n\nThis is like the story of Joseph with the two men, who had lied about what they pictured. It was something they had talked to themselves about and imagined, not a vision, which makes the matter even more remote [from truth]. If it had been a vision, it would have been more amenable to interpretation. But when they recounted it to Joseph, a form of it arose in Joseph’s imaginative faculty (الخيال) that Joseph had not talked to himself about. Thus, it became a reality (حقا) in relation to Joseph, as if he were the seer who saw that vision for that man. They stood in the place of the Angel who holds the forms of visions. When he interpreted their visions for them, they said to him, \"We only wanted to test you, and we saw nothing.\" Joseph replied: <<قُضِيَ الْأَمْرُ الَّذِي فِيهِ تَسْتَفْتِيَانِ>> (The matter concerning which you asked for a ruling has been decreed). And the matter came to pass in the sensible world just as he interpreted it.\n\nFurthermore, when God the Exalted shows someone a vision, the owner of the vision has a share (حظ) of good or evil in what he saw, according to what his vision requires, or the share may be in the norm (ناموس) of the time in that place, but not in the seen form itself. God then depicts that share as a bird (طائرا)—which is an Angel in the form of a bird—just as He creates forms of deeds that are angelic, spiritual, corporeal, and barzakhi (برزخية). He made it in the form of a bird because it is said, \"His lot (سهمه) flew for him with such-and-such,\" and the bird (*al-ta'ir*) is the lot. God Almighty said: <<قَالُوا طَائِرُكُمْ مَعَكُمْ>> (They said: Your lot is with you)—meaning your share and portion of good and evil is with you. He makes the vision suspended from the leg of this bird, and it is the very essence of the bird. Since the bird, when it catches prey from the ground, only takes it with its leg because it has no hand and cannot use its wing to grasp, the vision is therefore suspended from its leg. It is the suspended thing, and it is the essence of the bird. When it is interpreted, it falls to the one to whom it was told. When it falls, the bird ceases to exist, because it is the essence of the vision, and it ceases to exist with its falling. It then takes form in the world of sense (عالم الحس) according to the state (الحال) that the vision manifests. Thus, the form of the vision becomes the very essence of the state, nothing else. That state, whether it is an accident (عرض), a substance (جوهر), or a relationship (نسبة) of sainthood (ولاية) or otherwise, is the very form of that vision and that bird. And from it, this state was created, necessarily, whether that form was a body, an accident, or a relationship. Just as Adam was created from dust, and we are created from despised water, so too, if the vision indicates the existence of a child, that child is created from the very essence of that vision, as water in his father's loins. Even if the water has descended into the womb, that vision is pictured in it as a child, so he is a child of the vision. If no vision preceded him, he is upon his original creation, like all other children. Know this, for it is a wondrous secret and a true unveiling (كشف صحيح). Every child that results from a vision seen for him has a distinction over others and is closer to the spirits (الأرواح) than others, if you pay attention, you will see this. Every created thing—whether a state, an accident, or a relationship of sainthood or otherwise—that results from a vision has a distinction over that which is not from a vision. Look at the vision of Aminah, the mother of the Messenger of God, peace and blessings be upon him, and it will confirm the truth of what we have mentioned. He, peace and blessings be upon him, was the very essence of his mother's vision, which appeared in his father's water with the form she saw. For this reason, the visions concerning him, peace and blessings be upon him, were numerous, and he was distinguished from others. What we have said is known only to the people of knowledge concerning the form of Unveiling (الكشف), and it is one of God's secrets in His creation. If you desire confirmation for what we have mentioned,\n\n### [A Wondrous Secret in the Science of Nature]\n\nLook into the science of nature (علم الطبيعة): if a pregnant woman craves (توحمت) something, the child comes out resembling that thing. And if the man looks at or imagines a form during intercourse and the emission of water, the child will be created upon the form of what was imagined. For this reason, the sages (الحكماء) used to command that pictures of virtuous men (الفضلاء) among the great sages be placed in locations where the woman and the man would look at them during intercourse. The image would be imprinted in the imaginative faculty (الخيال), thus affecting the nature (الطبيعة), and that power which was upon that image would emerge in the child resulting from that water. This is a wondrous secret in the science of nature.\n\nLook also at the formation of Jesus, peace be upon him, resulting from Mary's witnessing Gabriel in the form of a human: how he combined being a Spirit (روح) who revives the dead and being a human, since the Spirit is that by which natural bodies are revived. Even stronger than that is what the Samaritan did with the handful of dust from the trace of Gabriel, when he knew that life accompanies the Spirit wherever it settles. He threw what he had grasped into the calf, and the calf lowed due to that grasped trace from the Spirit's step. Had he thrown it into the shape of a horse, it would have neighed, or into the shape of a human, it would have spoken. For the preparedness for the manifestation of life was only for the recipient. From this, you understand the form of the Manifest in the manifestations (المظاهر), and that the manifestations give, by their preparedness, what manifests in them of the forms that carry and are carried. For this reason, God manifested this wisdom, so that you may understand from it the reality of the matter.\n\nFurthermore, the Prophet, peace and blessings be upon him, named it *bushra* (glad tidings) and *mubashshirah* (harbinger) because of its effect on the human skin (*basharah*). The human form changes according to what comes upon its interior from the image it imagines, or a word it hears, whether through sorrow or joy, and an effect necessarily appears on the skin. This is a natural law that God deposited in nature, and it cannot be otherwise.\n\n(Supplement) The Vision (الرؤيا) has a place (مكان), a locus (محل), and a state (حال).\n\nIts state is sleep (النوم), which is absence from the manifest sensible things, necessitating rest due to the fatigue this existence (النشأة) experienced during wakefulness from movement, even if it was according to its desire. The Exalted said: <<وَجَعَلْنَا نَوْمَكُمْ سُبَاتًا>> (And We made your sleep repose). He means: We made sleep a rest for you, by which souls are refreshed. It is of two divisions: a division of transition (انتقال), which contains some rest, or attainment of a goal, or increased fatigue; and the other division is pure rest (راحة خاصة), which is the pure, sound sleep that God mentioned He made a rest for the bodily instruments, limbs, and organs that were fatigued during wakefulness. He made its time the night, even if it occurs during the day, just as He made the day for livelihood, even if it occurs at night, but the ruling is for the dominant state.\n\nAs for the division of transition, it is the sleep accompanied by the Vision (الرؤيا). In this, these instruments move from the manifest sense to its interior, so that the soul may see what is established in the treasury of the imaginative faculty (خزانة الخيال), to which the senses have conveyed what they took from sensible things, and what the formative power (القوة المصورة)—which is one of the servants of this treasury—has pictured. Thus, this rational soul (النفس الناطقة), to whom God has given dominion over this city [the body], sees what has settled in its treasury, just as is customary for kings when they enter their treasuries during their times of solitude to examine what is within them. The storage capacity depends on the completeness of the instruments of this existence, which are the limbs, and the servants, which are the sensory faculties. Thus, there is a complete treasury due to the completeness of life, and a deficient treasury, like the blind person, for the forms of colors do not transfer to his imaginative treasury, and the mute person, the forms of sounds and verbal letters do not transfer to the imaginative treasury. This is all if he lacked them in his original creation. However, if these afflictions occurred later, then no; for when he transitions by sleep to the interior of the existence and enters the treasury, he finds the forms of colors that he stored there before the affliction occurred, and likewise everything that any of the sensory faculties—who are the collectors of this kingdom—gave him.\n\nGod has a Theophany (تجلي) in this treasury in a natural form (صورة طبيعية) with natural attributes, such as His saying, peace and blessings be upon him: \"I saw my Lord in the form of a youth.\" This is what the sleeper sees in his sleep of meanings (المعاني) in the forms of sensible things, because the reality of the imaginative faculty (الخيال) is to embody what is not meant to be a body. This is because its Presence (حضرة) grants that, and there is nothing in the strata of the cosmos that grants the matter as it is, except this Imaginative Presence (الحضرة الخيالية), for it combines the two opposites. In it, the realities appear as they are, because the truth in matters is that you say concerning everything you see or perceive, by whatever faculty the perception occurred, that what you perceived is 'He, not He' (هو لا هو), as He said: <<وَمَا رَمَيْتَ إِذْ رَمَيْتَ>> (And you threw not when you threw). Therefore, do not doubt in the state of the vision that the form you see is the very essence of what you were told it is, and do not doubt upon waking that it is not Him. Yet, do not doubt in sound contemplation that the matter is 'He, not He.' Abu Sa'id al-Kharraz was asked, \"How did you know God?\" He replied, \"By His combining of the two opposites.\" Thus, every entity (عين) characterized by existence (الوجود) is 'He, not He.' The entire world (العالم) is 'He, not He.' And the Real (الحق) manifest in the form is 'He, not He.' He is the bounded that is not bounded, and the seen that is not seen. This matter only appears in this Imaginative Presence (الحضرة الخيالية) in the state of sleep or absence (غيبوبة) from manifest sensible things, by whatever means. Its existence is most complete and general in sleep, because it is for the Gnostics and the common people. The state of absence, annihilation (فناء), effacement (محو), and the like, excluding sleep, does not occur for the common people concerning Divine matters. God has not brought into existence anything in the cosmos upon the form of the matter as it is in itself, except this Presence. Thus, it has the general ruling in both extremes, just as the contingent (الممكن) accepts the two opposites, and this is a matter of tasting (ذوقا) for him. For the one for whom non-existence is impossible, even if he has knowledge of non-existence, his knowledge is not essential (ذاتيا), which is called tasting. In contrast, the contingent has a tasting of non-existence. And the one for whom existence is impossible and has knowledge of it has no tasting of existence whatsoever. The contingent has a tasting of existence. So God brought this Imaginative Presence into existence so that the matter which is the Origin (الأصل) might appear in it as it is.\n\n### [Sleep is a Crossing]\n\nKnow that the Manifest in the manifestations (مظاهر الأعيان) is the Real Existence (الوجود الحق), and that He is not what He appears to be in the forms and descriptions that the contingent entities (أعيان الممكنات) possess. He made this Presence like a bridge (جسر) between the two shores for crossing from this shore to that shore. He made sleep a crossing (معبرا) and made walking upon it a passage (عبورا). The Exalted said: <<إِن كُنتُمْ لِلرُّؤْيَا تَعْبُرُونَ>> (If you are interpreters of the vision). He made the perception of this in a state called rest (راحة), which is sleep, based on the reality of His saying: <<وَلَقَدْ خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ>> (And We certainly created the heavens and the earth and what is between them in six days). He attributed the work to Himself, and mentioned in the creation that it was by His two Hands, and by hands, and by His Hand, and by His Word. Then He informed us that even though He is characterized by work, fatigue did not affect Him, saying: <<وَمَا مَسَّنَا مِن لُّغُوبٍ>> (And no weariness touched Us). And He said: <<وَلَمْ يَعْيَ بِخَلْقِهِنَّ>> (And He was not wearied by their creation). From this reality, great, difficult, and tiring works appear in sleep, which is the rest of the body—meaning, nature is resting in this state from manifest sensory movements. This is the great work occurring in rest, from a perspective where one does not feel that he is in rest, especially if he sees terrifying and frightening things in sleep. When he wakes up, he finds rest, knowing that he was in rest without realizing it. Among them are those who know in sleep that they are sleeping, and people are of different ranks in this.\n\nWe only named this state 'transition' (انتقال) because meanings transition from their abstraction from matter to the clothing of matter, like the manifestation of the Real (الحق) in the forms of bodies, and Knowledge (العلم) in the form of milk, and similar things. The second transition is the transition of the senses from the manifest sensible to this Presence with the manifest sensible, but it has in this Presence the stability it has in the Presence of Wakefulness. It is quick to change in this Presence, just as it changes in wakefulness into different forms in its interior, not its exterior. Its interior in wakefulness is this Presence. He made the night a garment for it, for the night gives the observer nothing in his observation but himself. He perceives, but is not perceived by it, for it is the Unseen (غيب) and darkness (ظلمة). The Unseen and darkness perceive, but are not perceived by them. Light perceives and is perceived by it, and that is the state of wakefulness. For this reason, the vision is interpreted (تُعْبَر), but what the sense perceives is not interpreted.\n\nWhen man ascends in the degrees of Gnosis (المعرفة), he knows that he is sleeping in the customary state of wakefulness, and that the matter he is in is a vision, both by faith and by unveiling (كشفا). For this reason, God mentioned matters occurring in the manifest sense and said: <<فَاعْتَبِرُوا>> (So take heed/cross over), and He said: <<إِنَّ فِي ذَلِكَ لَعِبْرَةً>> (Indeed, in that is a lesson/crossing), meaning: pass over and cross from what has appeared to you of that to the knowledge of what is hidden by it and what it came for.\n\nHe, peace be upon him, said: \"People are asleep, and when they die, they awaken.\"\n\nBut they do not perceive [this now], and for this reason, we said 'by faith.' We have already covered this station fully in the Chapter on Gnosis (باب المعرفة) in this book, which preceded it, Chapter One Hundred and Seventy-Seven. The entire existence (الوجود) is sleep, and its wakefulness is sleep. Thus, the entire existence is rest (راحة), and rest is Mercy (رحمة). <<وَسِعَتْ كُلَّ شَيْءٍ>> (It encompasses everything). To it is the ultimate return. The angels say to God: <<وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وَعِلْمًا>> (You encompass everything in Mercy and Knowledge). Here is a secret: if you investigate it, you will reach it, which is His Mercy through the Beautiful Names (الأسماء الحسنى) in the manifestation of their effects. The limit of His Knowledge is the limit of His Mercy.\n\nThen I return and say: Even if fatigue occurs on the path, it is fatigue within rest, like the hired worker who bears the fatigue or finds pleasure in it because of the rest of the wage (الأجرة) that is in his soul, for the sake of which he works. The presence of the rest of the wage veils him from the fatigue. When he receives it, he enters the rest of sleep at night, and his limbs settle from movement, and he finds rest. Thus, he transitions from the rest of the wage to the rest of sleep.\n\nIn reality, the forms of the world (صور العالم) for the Real (الحق) from the Inner Name (الاسم الباطن) are like the forms of the vision (صور الرؤيا) for the sleeper, and the interpretation (التعبير) in them is that those forms are his states (أحواله). It is none other than him, just as the forms of the vision are the states of the seer, none other than him. He saw nothing but himself. This is His saying that He created not <<السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ>> (the heavens and the earth and what is between them except with the Truth/The Real), and that is His very essence. And it is His saying concerning the Gnostics: <<وَيَعْلَمُونَ أَنَّ اللَّهَ هُوَ الْحَقُّ الْمُبِينُ>> (And they know that God is the Manifest Truth/The Real). Thus, He is the One who is Many.\n\nWhoever interprets the vision sees a tremendous matter and discerns what he would not perceive through any other means. For this reason, the Messenger of God, peace and blessings be upon him, when he awoke among his Companions, would ask them: \"Did any of you see a vision?\" Because it is Prophethood, he loved to witness it in his Community. People today are in extreme ignorance concerning this rank, which the Messenger of God, peace and blessings be upon him, cared about and asked about every day. The ignorant people of this time, when they hear of an event that occurred in sleep, do not pay attention to it and say, \"He wants to rule by dreams (بالمنامات). This is just imagination.\" But it is only a vision (رؤيا). They belittle the seer if he relies upon it. All of this is due to their ignorance of its station and their ignorance that he is in his wakefulness and his activity within a vision, and in his sleep, he is in a vision within a vision. He is like one who sees that he has woken up in his sleep while he is still sleeping. This is His saying, peace be upon him: \"People are asleep.\"\n\nHow wondrous are the prophetic disclosures! They have clarified the realities as they are and magnified what the deficient intellect belittled, for it issued only from the Magnificent, who is the Real (الحق). This is the meaning of our saying in the division that it is the division of transition. As for the other division of sleep, it is the division of rest (الراحة), which is sleep in which no vision is seen. It is solely for bodily rest, nothing else.\n\nThis is the state of the Vision. There remains the knowledge of the place (مكان) and the locus (محل). As for the locus (محل), it is this elemental existence (النشأة العنصرية). The vision has no locus other than it. The Angel has no vision. Rather, that belongs specifically to the animal elemental existence. Its locus in Divine Knowledge is the transformations (الاستحالات) in the forms of Theophany (التجلي). Everything we are in is the vision of the Real (رؤيا الحق) in the rest of the removal of exhaustion and fatigue, nothing else.\n\nAs for the place (مكان), it is specifically what is beneath the concave surface of the sphere of the Moon. In the Hereafter, it is what is beneath the concave surface of the sphere of the Fixed Stars. This is because sleep may occur in Hell at times, especially for the believers who committed major sins. Above the sphere of the Fixed Stars, there is no sleep.\n\nI mean by this the known sleep that occurs in common usage. As for what we first intended in the knowledge of the state of sleep, that is another matter which we have explained. The form of its place is thus: Look at what we have pictured in the margin, which is this. This is the form of the place of the Vision (الرؤيا). It resembles a horn (القرن), which is the Trumpet (الصور). Its top is wide and its bottom is narrow, inverted from the creation. For what is next to the head is the highest and widest part, and the narrowest part is the lowest, which is furthest from the origin. That horn is the place of the Vision. If one exits this Trumpet, he exits the place of the Vision known in common usage, and he sees no vision after this, because the attribute of sleep does not subsist in him. He is in eternal rest. This much is sufficient for what we seek in defining the station of the Vision. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And God speaks the Truth, and He guides to the way). What we have remained silent about is immense, because thought is incapable of picturing it for most people, <<وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ>> (but most people do not know), just as <<أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ>> (most people do not believe). And to Knowledge (العلم) returns jurisprudence (الفقه) and intellect (العقل) in His saying: <<لَا يَفْقَهُونَ>> (they do not understand) and <<لَا يَعْقِلُونَ>> (they do not reason). End of Part One Hundred and Seventeen.",
    "ur": "(باب ایک سو اٹھاسی: رؤیا کے مقام کی معرفت میں، جو کہ مبشرات ہیں)\n\nسچے لوگوں کی رؤیا سچائی کے ساتھ ہوتی ہے، اور جو شخص\nضد (جھوٹ) کی صحبت اختیار کرے اس کی رؤیا سچی نہیں ہوتی۔\nسچائی کے ٹھکانے دور کی جانب (عدوۃ القصویٰ) میں ہیں،\nاور اس کی ضد (جھوٹ) کے ٹھکانے قریب کی جانب (عدوۃ الدنیا) میں ہیں۔\nیہ (رؤیا) نبوت ہی ہے، مگر یہ شریعت کو منسوخ کرنے سے قاصر ہے،\nاور یہ ایک بلند مرتبہ ہے۔\nمیں نے دیکھا کہ خواہشات کے لیے تلواریں کھینچی گئیں،\nاور میرے دائیں ہاتھ میں خواہشات کے لیے ایک دنیاوی تلوار تھی۔\nپس میں نے اس تلوار کے ذریعے آخرت اور دنیا میں\nاس (خواہش) کا کوئی نشان یا اثر باقی نہ چھوڑا۔\n\n[کہ انسان کے لیے دو حالتیں ہیں: نیند کی حالت اور بیداری کی حالت]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ انسان کے لیے دو حالتیں ہیں: ایک حالت جسے نیند کہتے ہیں اور ایک حالت جسے بیداری کہتے ہیں۔ اللہ تعالیٰ نے دونوں حالتوں میں اس کے لیے ایک ادراک رکھا ہے جس کے ذریعے وہ اشیاء کو محسوس کرتا ہے۔ بیداری میں ان ادراکات کو حس (الحس) کہا جاتا ہے، اور نیند میں انہیں حس مشترک (الحس المشترک) کہا جاتا ہے۔ پس ہر وہ چیز جسے آپ بیداری میں دیکھتے ہیں، رؤیت (الرؤیۃ) کہلاتی ہے، اور ہر وہ چیز جسے آپ نیند میں دیکھتے ہیں، رؤیا (الرؤیا) کہلاتی ہے۔ انسان نیند میں جو کچھ بھی ادراک کرتا ہے، وہ ان چیزوں میں سے ہوتا ہے جنہیں خیال (الخیال) نے بیداری کی حالت میں حواس (الحواس) سے محفوظ کیا ہوتا ہے۔ اور یہ دو قسموں پر ہوتا ہے: یا تو وہ جس کی صورت کا ادراک حس میں کیا گیا ہو، یا وہ جس کے اجزاء کی صورت کا ادراک حس کے ذریعے کیا گیا ہو جسے وہ نیند میں ادراک کرتا ہے۔ یہ ضروری ہے، کیونکہ اگر اس کی اصل خلقت میں حواس کے ادراک میں کوئی کمی ہو، اور وہ بیداری میں اس چیز کا ادراک نہ کر سکے جس کا حسی معنیٰ مفقود ہو جس کے ذریعے وہ اسے اپنی اصل خلقت میں ادراک کرتا، تو وہ اسے نیند میں بھی کبھی ادراک نہیں کر سکتا۔ پس اصل حس ہے اور بیداری میں اس کے ذریعے ادراک کرنا ہے، اور خیال (الخیال) اس کا تابع ہے۔ اور بعض لوگوں پر یہ معاملہ قوی ہو جاتا ہے تو وہ بیداری میں بھی وہی ادراک کرتے ہیں جو وہ نیند میں ادراک کرتے تھے، لیکن یہ نادر ہے اور یہ اس طریق کے اہل (نبی اور ولی) کے لیے ہے۔ ہم نے اسے اسی طرح جانا ہے۔ جب آپ یہ جان چکے۔\n\n[اللہ تعالیٰ کا اپنے انبیاء سے نیند یا بیداری کی حالت میں خطاب یا کلام]\n\nتو یہ بھی جان لیجیے کہ نبوت (النبوۃ) اللہ تعالیٰ کا خطاب یا اللہ تعالیٰ کا کلام ہے، جیسا آپ چاہیں اسے کہہ لیں، جو وہ اپنے بندوں میں سے جس سے چاہتا ہے ان دو حالتوں میں کرتا ہے: بیداری اور نیند۔ اور یہ الٰہی خطاب جسے نبوت کہا جاتا ہے، تین اقسام پر ہے: ایک قسم جسے وحی (الوحی) کہتے ہیں، ایک قسم جسے وہ پردے کے پیچھے سے کلام کرتے ہوئے سنتا ہے (من وَراءِ حِجابٍ)، اور ایک قسم رسول (الرسول) کے واسطے سے ہوتی ہے۔ پس وہ رسول، خواہ فرشتہ ہو یا بشر، اللہ کے اذن سے اس شخص کی طرف وحی کرتا ہے جس کی طرف اسے بھیجا گیا ہے، اور یہ اللہ کا کلام ہوتا ہے کیونکہ یہ رسول اللہ کی طرف سے ترجمانی کرتا ہے۔ جیسا کہ اللہ تعالیٰ نے فرمایا: وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِن وَرَاءِ حِجَابٍ أَوْ يُرْسِلَ رَسُولًا (اور کسی بشر کے لیے یہ ممکن نہیں کہ اللہ اس سے کلام کرے مگر وحی کے ذریعے یا پردے کے پیچھے سے یا وہ کوئی رسول بھیجے) [42:51]۔\nوحی میں سے وہ ہے جو اللہ بغیر کسی واسطے کے اپنے بندوں کے دلوں میں ڈالتا ہے، پس وہ اپنے دلوں میں ایک ایسی بات سنتے ہیں جس کے سننے کی کیفیت بیان نہیں کی جا سکتی، نہ اس کی کوئی حد ہوتی ہے اور نہ خیال اسے صورت دے سکتا ہے۔ اس کے باوجود وہ اسے سمجھتے ہیں اور نہیں جانتے کہ یہ کیسے آیا، کہاں سے آیا اور اس کا سبب کیا ہے۔ اور کبھی وہ پردے کے پیچھے سے اس صورت میں کلام کرتا ہے جس میں وہ اس سے کلام کرتا ہے۔ اور کبھی پردہ اس کی بشریت ہوتی ہے، اور کبھی پردہ وہ ہوتا ہے جیسا کہ موسیٰ علیہ السلام سے درخت سے کلام کیا گیا: مِن جَانِبِ الطُّورِ الْأَيْمَنِ (طور کے دائیں جانب سے) [19:52]، کیونکہ اگر وہ بائیں جانب سے کلام کرتا جو اس کے دل کی سمت ہے، تو شاید اسے اپنے نفس کے کلام سے التباس ہو جاتا۔ پس کلام اس جانب سے آیا جہاں سے اس کے نفس کے کلام کرنے کی عادت نہیں تھی۔ اور کبھی وہ رسول کے واسطے سے کلام کرتا ہے، جو فرشتہ ہوتا ہے، جیسا کہ اس کا قول ہے: نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَىٰ قَلْبِكَ (اسے روح الامین نے آپ کے قلب پر نازل کیا) [26:193-194]، یعنی قرآن کے ذریعے جو اللہ کا کلام ہے۔ اور کبھی یہ واسطہ بشر ہوتا ہے، اور یہ اس کا قول ہے: فَأَجِرْهُ حَتَّىٰ يَسْمَعَ كَلَامَ اللَّهِ (پس اسے پناہ دو تاکہ وہ اللہ کا کلام سن لے) [9:6]۔ پس اس نے کلام کو اللہ کی طرف منسوب کیا، حالانکہ صحابہ اور اس اعرابی نے اسے رسول اللہ صلی اللہ علیہ وسلم کی زبان سے ہی سنا تھا۔\nاور نبوت ان اقسام کے ذریعے الٰہی خبر دینے سے کوئی زائد امر نہیں ہے۔ اور قرآن اللہ کی خبر ہے اور وہ پوری نبوت ہے، کیونکہ وہ ان تمام چیزوں کا جامع ہے جن کی خبر اللہ نے اپنے بندوں کو دینا چاہی۔ اور حدیث میں ثابت ہے کہ جس نے قرآن حفظ کر لیا، اس کے پہلوؤں کے درمیان نبوت سمو دی گئی۔\n\nجب یہ بات ثابت ہو گئی جو ہم نے ذکر کی:\n\n[کہ وحی کی ابتدا رؤیا صادقہ ہے]\n\nتو جان لیجیے کہ وحی کی ابتدا رؤیا صادقہ (سچا خواب) سے ہوئی، اور یہ صرف نیند کی حالت میں ہوتی ہے۔\nعائشہ رضی اللہ عنہا نے صحیح حدیث میں فرمایا: أَوَّلُ مَا بُدِئَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الْوَحْيِ الرُّؤْيَا الصَّادِقَةُ (رسول اللہ صلی اللہ علیہ وسلم پر وحی کی ابتدا رؤیا صادقہ سے ہوئی)۔\nآپ صلی اللہ علیہ وسلم جو بھی رؤیا دیکھتے وہ صبح کی روشنی کی طرح ظاہر ہو جاتی۔ اور اس کا سبب آپ صلی اللہ علیہ وسلم کی سچائی تھی۔\nکیونکہ آپ سے یہ ثابت ہے کہ آپ نے فرمایا: أَصْدَقُكُمْ رُؤْيَا أَصْدَقُكُمْ حَدِيثًا (تم میں سب سے سچی رؤیا اس کی ہوتی ہے جو تم میں سب سے سچا ہو۔)\nپس آپ صلی اللہ علیہ وسلم کسی سے بھی ایسی بات نہیں کرتے تھے جو آپ نے اپنے نفس میں گھڑی ہو، بلکہ آپ وہی بات کرتے تھے جو آپ اپنے حسی قویٰ میں سے کسی ایک یا سب کے ذریعے ادراک کرتے تھے۔ آپ صلی اللہ علیہ وسلم نہ تو غرض سے بات کرتے تھے اور نہ وہ کہتے تھے جو نہیں ہوا، اور نہ ہی بیداری میں کسی ایسی چیز کے بارے میں بات کرتے تھے جسے آپ نے اپنے خیال میں صورت دی ہو اور اس کی مجموعی صورت کو حس میں نہ دیکھا ہو۔ یہی آپ کی رؤیا کی سچائی کا سبب تھا۔\nاور وحی کی ابتدا رؤیا سے ہوئی نہ کہ حس سے، کیونکہ معقول معانی (المعانی المعقولۃ) خیال (الخیال) سے زیادہ قریب ہیں بہ نسبت حس کے، کیونکہ حس ادنیٰ طرف ہے اور معنیٰ اعلیٰ اور لطیف طرف ہے۔ اور خیال ان دونوں کے درمیان ہے۔ اور وحی ایک معنیٰ ہے۔ پس جب معنیٰ حس کی طرف نازل ہونا چاہتا ہے تو حس تک پہنچنے سے پہلے اسے لازماً حضرۃ الخیال (خیال کی موجودگی) سے گزرنا پڑتا ہے۔ اور خیال کی حقیقت یہ ہے کہ وہ ہر اس چیز کو جو اس کے پاس آتی ہے، محسوس کی صورت میں ڈھال دیتا ہے، یہ ضروری ہے۔ پس اگر اس الٰہی وحی کا ورود نیند کی حالت میں ہو تو اسے رؤیا کہا جاتا ہے، اور اگر بیداری کی حالت میں ہو تو اسے تخیل (خیال میں ڈالنا) کہا جاتا ہے، یعنی اسے خیال میں ڈالا گیا۔\nاسی لیے وحی کی ابتدا خیال سے ہوئی، پھر اس کے بعد خیال باہر سے فرشتہ کی طرف منتقل ہوا، پس فرشتہ آپ کے لیے ایک مرد یا محسوسات میں سے کسی شخص کی صورت میں متمثل ہوتا تھا۔ کبھی اس وحی کا ادراک صرف وہی شخص کرتا تھا جس کے لیے وہ وحی مقصود ہوتی تھی، اور کبھی اس کے پاس موجود لوگ بھی اسے ادراک کر لیتے تھے۔ پس وہ آپ کے کان میں آپ کے رب کی بات ڈالتا تھا، جو کہ وحی ہے۔ اور کبھی وہ آپ صلی اللہ علیہ وسلم کے قلب پر نازل ہوتی تھی، تو آپ پر برحاء (شدید کیفیت) طاری ہو جاتی تھی، جسے حال (الحال) سے تعبیر کیا جاتا ہے۔ چونکہ طبع اس کے موافق نہیں ہوتی، اس لیے یہ آپ پر شدید ہوتی تھی اور شخص کا مزاج اس سے منحرف ہو جاتا تھا، یہاں تک کہ آپ اس وحی کو پہنچا دیتے جو آپ پر نازل کی گئی تھی، پھر وہ کیفیت آپ سے دور ہو جاتی اور آپ اس بات کی خبر دیتے جو آپ سے کہی گئی تھی۔\nاور یہ سب کچھ اللہ کے اولیاء میں موجود ہے، لیکن جو چیز نبی کو ولی سے ممتاز کرتی ہے وہ تشریع (شریعت سازی) کے ساتھ وحی ہے۔ شریعت صرف نبی ہی بناتا ہے، اور خاص طور پر رسول ہی شریعت بناتا ہے، پس وہ حلال و حرام کرتا ہے، مباح کرتا ہے اور وحی کی تمام اقسام لاتا ہے۔ اور اولیاء کے لیے اس معاملے میں صرف یہ ہے کہ وہ اس رسول کی لائی ہوئی چیز کی صحت کی خبر دیتے ہیں اور اس کی تعیین کرتے ہیں، تاکہ یہ پیروکار اس چیز میں بصیرت پر ہو جس کی عبادت اس کے رب نے اس رسول کی زبان پر اس کے لیے مقرر کی ہے۔ چونکہ اس ولی نے اس رسول کا زمانہ نہیں پایا کہ وہ اس سے سنتا جیسا کہ اس کے صحابہ نے سنا، لہٰذا یہ ولی اس قسم کے خطاب کے ذریعے اس صحابی کے مقام پر آ جاتا ہے جس نے رسول اللہ صلی اللہ علیہ وسلم کے لفظ سے وہ شریعت سنی جو آپ نے مقرر فرمائی۔ اسی لیے قرآن میں آیا ہے: أَدْعُوا إِلَى اللَّهِ عَلَىٰ بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي (میں اللہ کی طرف بصیرت کے ساتھ بلاتا ہوں، میں بھی اور وہ بھی جو میری پیروی کرتے ہیں) [12:108]، اور وہ یہی لوگ ہیں جن کا ہم نے ذکر کیا۔\nبسا اوقات کوئی حدیث جو ہمارے نزدیک ثقہ راویوں کی روایت کے ذریعے صحیح ہوتی ہے، نفس الامر میں صحیح نہیں ہوتی، تو ہم اسے غلبہ ظن کے طریقے پر لیتے ہیں نہ کہ علم کے طریق پر۔ اور یہ طائفہ (اولیاء) جسے ہم نے ذکر کیا، اسے اسی طریق سے لیتا ہے، پس ہم اس خبر کی عدم صحت کے بارے میں بصیرت پر ہوتے ہیں جو ہمارے نزدیک صحیح ہے کہ وہ نفس الامر میں صحیح نہیں ہے۔ اور اس کے برعکس بھی ہوتا ہے، یعنی حدیث ضعیف ہو کیونکہ اس کی سند میں کوئی وضاع (جھوٹا راوی) یا مدلس ہو، حالانکہ وہ نفس الامر میں صحیح ہوتی ہے، تو یہ طائفہ اس کی صحت کا ادراک کر لیتا ہے اور اس میں بصیرت پر ہوتا ہے۔ پس یہی اللہ تعالیٰ کے اس قول کا معنیٰ ہے: أَدْعُوا إِلَى اللَّهِ عَلَىٰ بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي (میں اللہ کی طرف بصیرت کے ساتھ بلاتا ہوں، میں بھی اور وہ بھی جو میری پیروی کرتے ہیں)۔ اور یہ لوگ انبیاء کے وارث ہیں کیونکہ وہ خبر میں شریک ہیں، جبکہ انبیاء تشریع میں منفرد ہیں۔\nاللہ تعالیٰ نے فرمایا: يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَىٰ مَن يَشَاءُ مِنْ عِبَادِهِ (وہ اپنے حکم سے روح کو اپنے بندوں میں سے جس پر چاہتا ہے نازل کرتا ہے) [40:15]۔ یہاں \"مَن\" (جو) نکرہ (عام) آیا ہے، لِيُنذِرَ يَوْمَ التَّلَاقِ (تاکہ وہ ملاقات کے دن سے ڈرائے)۔ پس یہ ایسی چیز لایا جو نہ شریعت ہے اور نہ حکم، بلکہ صرف انذار (ڈرانا) ہے۔ پس ولی بشیر (خوشخبری دینے والا) اور نذیر (ڈرانے والا) ہو سکتا ہے، لیکن وہ مشرع (شریعت بنانے والا) نہیں ہو سکتا، کیونکہ رسالت اور نبوت بالتشریع منقطع ہو چکی ہے۔ پس آپ کے بعد نہ کوئی رسول ہے اور نہ کوئی نبی، یعنی نہ کوئی مشرع ہے اور نہ کوئی شریعت۔ یہ جان لیجیے۔ اب ہم اس موضوع کی طرف لوٹتے ہیں جس پر ہم نے باب قائم کیا ہے۔\n\nرسول اللہ صلی اللہ علیہ وسلم سے ثابت ہے کہ آپ نے فرمایا: إِنَّ الرِّسَالَةَ وَالنُّبُوَّةَ قَدِ انْقَطَعَتْ فَلَا رَسُولَ بَعْدِي وَلَا نَبِيَّ (رسالت اور نبوت منقطع ہو چکی ہے، میرے بعد نہ کوئی رسول ہے اور نہ کوئی نبی)۔ راوی نے کہا: لوگوں پر یہ بات شاق گزری، تو آپ نے فرمایا: لَكِنِ الْمُبَشِّرَاتُ (لیکن مبشرات باقی ہیں)۔ لوگوں نے پوچھا: یا رسول اللہ! مبشرات کیا ہیں؟ آپ نے فرمایا: رُؤْيَا الْمُسْلِمِ وَهِيَ جُزْءٌ مِنْ أَجْزَاءِ النُّبُوَّةِ (مسلمان کی رؤیا، اور یہ نبوت کے اجزاء میں سے ایک جزو ہے۔)\n\nیہ انس بن مالک رضی اللہ عنہ کی ایک حدیث حسن صحیح ہے، جسے ہمیں مکہ مکرمہ میں رکن یمانی کے سامنے، جہاں حجر اسود ہے، سن ۶۰۴ھ میں ہمارے شیخ مکین الدین ابو شجاع زاہر بن رستم الاصفہانی البزار اور دیگر نے ابو الفتح عبد الملک بن ابی القاسم بن ابی سہل الکرخی الہروی سے روایت کیا، انہوں نے کہا کہ مجھے ابو عامر محمود بن القاسم الازدی اور ابو نصر عبد العزیز بن محمد التریّاقی اور ابو بکر احمد بن ابی حاتم العورجی التاجر نے خبر دی، انہوں نے کہا کہ ہمیں محمد بن عبد الجبار الجراحی نے خبر دی، انہوں نے کہا کہ ہمیں ابو العباس محمد بن احمد المحبوبی نے خبر دی، انہوں نے کہا کہ ہمیں ابو عیسیٰ محمد بن عیسیٰ الترمذی نے خبر دی، انہوں نے کہا کہ ہمیں الحسن بن محمد الزعفرانی نے حدیث بیان کی، انہوں نے کہا کہ ہمیں عفان بن مسلم نے حدیث بیان کی، انہوں نے کہا کہ ہمیں عبد الواحد نے حدیث بیان کی، انہوں نے کہا کہ ہمیں المختار بن فلفل نے حدیث بیان کی، انہوں نے کہا کہ ہمیں انس بن مالک نے حدیث بیان کی، انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اور یہ حدیث ذکر کی۔ امام ترمذی نے کہا: اس باب میں ابو ہریرہ، حذیفہ، ابن عباس اور ام کرز سے بھی روایات ہیں۔\n\nپس آپ صلی اللہ علیہ وسلم نے خبر دی کہ رؤیا نبوت کے اجزاء میں سے ایک جزو ہے۔\nلہٰذا لوگوں کے لیے نبوت میں سے یہ اور دیگر چیزیں باقی رہ گئیں، اس کے باوجود نبوت اور نبی کا نام صرف مشرع (شریعت بنانے والے) پر ہی بولا جاتا ہے۔ پس یہ نام نبوت میں ایک مخصوص صفت کی خصوصیت کی وجہ سے محدود کر دیا گیا، اور اس نبوت کو محدود نہیں کیا گیا جس میں یہ خاص صفت نہیں ہے۔ اگرچہ نام محدود کر دیا گیا ہے، ہم ادب اختیار کرتے ہیں اور وہیں رکتے ہیں جہاں آپ صلی اللہ علیہ وسلم رکے، یہ جاننے کے بعد کہ آپ نے کیا فرمایا، کیا عام کیا اور کیا محدود کیا۔ پس ہم اپنے معاملے میں بصیرت پر ہیں۔\nجب آپ یہ جان چکے، تو ہم کہتے ہیں کہ رؤیا تین طرح کی ہوتی ہے: ایک بشریٰ (خوشخبری) ہے، جس کے بارے میں ہم اس باب میں بات کر رہے ہیں۔ دوسری رؤیا وہ ہے جو آدمی بیداری میں اپنے دل میں سوچتا ہے، پس وہ اس کے خیال میں نقش ہو جاتی ہے، اور جب وہ سوتا ہے تو حس مشترک (الحس المشترک) کے ذریعے اسے ادراک کرتا ہے، کیونکہ اس نے اسے بیداری میں تصور کیا تھا، پس وہ اس کے خیال میں مرتسم (نقش) رہ گیا۔ جب وہ سوتا ہے اور حواس خیال کے خزانے کی طرف متوجہ ہوتے ہیں تو وہ اسے دیکھتے ہیں۔ اس سب کا علم اور اس کی صورت آگے آئے گی۔ اور تیسری رؤیا شیطان کی طرف سے ہوتی ہے۔\nاور ہم نے اس بارے میں ایک صحیح حدیث روایت کی ہے، جسے ابو عیسیٰ ترمذی نے روایت کیا، انہوں نے کہا کہ ہمیں نصر بن علی نے حدیث بیان کی، انہوں نے کہا کہ ہمیں عبد الوہاب الثقفی نے حدیث بیان کی، انہوں نے کہا کہ ہمیں ایوب نے محمد بن سیرین سے، انہوں نے ابو ہریرہ رضی اللہ عنہ سے روایت کیا، انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: إِذَا اقْتَرَبَ الزَّمَانُ لَمْ تَكَدْ رُؤْيَا الْمُؤْمِنِ تَكْذِبُ وَأَصْدَقُهُمْ رُؤْيَا أَصْدَقُهُمْ حَدِيثًا وَرُؤْيَا الْمُسْلِمِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ وَالرُّؤْيَا ثَلَاثٌ فَالرُّؤْيَا الصَّالِحَةُ بُشْرَى مِنَ اللَّهِ تَعَالَى وَرُؤْيَا مِنْ تَحْزِينِ الشَّيْطَانِ وَرُؤْيَا مِمَّا يُحَدِّثُ الرَّجُلُ بِهِ نَفْسَهُ وَإِذَا رَأَى أَحَدُكُمْ مَا يَكْرَهُ فَلْيَقُمْ وَلْيَتْفُلْ وَلَا يُحَدِّثْ بِهِ النَّاسَ (جب زمانہ قریب ہو جائے گا تو مومن کی رؤیا جھوٹی نہیں ہو گی، اور تم میں سب سے سچی رؤیا اس کی ہو گی جو تم میں سب سے سچا ہو۔ مسلمان کی رؤیا نبوت کے چھیالیس حصوں میں سے ایک حصہ ہے۔ اور رؤیا تین طرح کی ہوتی ہے: رؤیا صالحہ اللہ تعالیٰ کی طرف سے خوشخبری ہوتی ہے، اور ایک رؤیا شیطان کی طرف سے غمگین کرنے والی ہوتی ہے، اور ایک رؤیا وہ ہوتی ہے جو آدمی اپنے دل میں سوچتا ہے۔ اور جب تم میں سے کوئی ناپسندیدہ چیز دیکھے تو اسے چاہیے کہ کھڑا ہو جائے اور تھتکارے اور لوگوں کو اس کے بارے میں نہ بتائے۔)\nاور آپ نے فرمایا کہ یہ حدیث صحیح ہے۔ اور ابو قتادہ کی حدیث میں رسول اللہ صلی اللہ علیہ وسلم سے مروی ہے: إِذَا رَأَى أَحَدُكُمْ شَيْئًا يَكْرَهُهُ فَلْيَنْفُثْ عَنْ يَسَارِهِ ثَلَاثَ مَرَّاتٍ وَلْيَسْتَعِذْ بِاللَّهِ مِنْ شَرِّهَا فَإِنَّهَا لَا تَضُرُّهُ (جب تم میں سے کوئی ناپسندیدہ چیز دیکھے تو اسے چاہیے کہ بائیں طرف تین بار تھتکارے اور اللہ سے اس کے شر سے پناہ مانگے، تو وہ اسے نقصان نہیں دے گی۔) اور یہ حدیث حسن صحیح ہے۔\nاور صحیح حدیث میں نبی صلی اللہ علیہ وسلم سے مروی ہے کہ: أَنَّ رُؤْيَا الْمُسْلِمِ عَلَى رِجْلِ طَائِرٍ مَا لَمْ يُحَدِّثْ بِهَا فَإِذَا حَدَّثَ بِهَا وَقَعَتْ (مسلمان کی رؤیا پرندے کے پاؤں پر ہوتی ہے جب تک وہ اسے بیان نہ کرے، اور جب وہ اسے بیان کر دیتا ہے تو وہ واقع ہو جاتی ہے۔)\n\n[بے شک اللہ کا ایک فرشتہ ہے جو رؤیا پر مقرر ہے جسے روح کہتے ہیں]\n\nجان لیجیے کہ اللہ کا ایک فرشتہ ہے جو رؤیا پر مقرر ہے جسے روح (الروح) کہتے ہیں۔ وہ آسمان دنیا سے نیچے ہے اور اس کے ہاتھ میں ان اجسام کی صورتیں ہیں جن میں سونے والا اپنے آپ کو اور دوسروں کو ادراک کرتا ہے، اور ان صورتوں سے پیدا ہونے والے اکوان (موجودات) کی صورتیں بھی اس کے ہاتھ میں ہیں۔ پس جب انسان سوتا ہے، یا وہ صاحب غیبت (غائب رہنے والا) ہوتا ہے، یا فنا (الفناء) کی حالت میں ہوتا ہے، یا اس میں ادراک کی اتنی قوت ہوتی ہے کہ محسوسات اسے بیداری میں ادراک سے نہیں روکتے جو اس فرشتے کے ہاتھ میں ہیں، تو یہ شخص اپنی قوت کے ذریعے بیداری میں وہی ادراک کرتا ہے جو سونے والا نیند میں ادراک کرتا ہے۔\nاور یہ اس طرح ہوتا ہے کہ لطیفہ انسانیہ (اللطیفۃ الإنسانیۃ) اپنی قوتوں کے ساتھ محسوسات کی حضرۃ (موجودگی) سے اس سے متصل خیال (الخیال) کی حضرۃ کی طرف منتقل ہو جاتا ہے، جس کا محل دماغ کے اگلے حصے میں ہے۔ پس وہ روح جو صورتوں پر مقرر ہے، الٰہی اذن سے منفصل خیال (الخیال المنفصل) سے اس پر فیضان کرتا ہے، جو کچھ ذات حق (الحق) اس سونے والے، یا غائب، یا فانی، یا قوی شخص کو معانی میں سے دکھانا چاہتا ہے، جو اس فرشتے کے ہاتھ میں موجود صورتوں میں مجسم ہوتے ہیں۔\nان میں سے کچھ کا تعلق اللہ سے ہوتا ہے اور ان اسماء سے ہوتا ہے جن سے وہ متصف ہے، پس وہ ذات حق (الحق) کو کسی صورت میں، یا قرآن کو، یا علم کو، یا اس رسول کو جو اس کی شریعت پر ہے، ادراک کرتا ہے۔ یہاں دیکھنے والے کے لیے تین مراتب یا ان میں سے کوئی ایک مرتبہ ظاہر ہوتی ہے:\nپہلی مرتبہ یہ ہے کہ ادراک کی گئی صورت مرئی (المرئی - دیکھی جانے والی ذات) کی طرف لوٹتی ہے، اس کے کسی مقام یا صفات کے لحاظ سے جو اس کی طرف لوٹتی ہیں۔ پس یہ رؤیا امر کو اسی طرح دیکھنا ہے جیسا کہ وہ اس کی طرف لوٹتا ہے۔\nدوسری مرتبہ یہ ہے کہ دیکھی گئی صورت خود دیکھنے والے کے حال کی طرف لوٹتی ہے۔\nتیسری مرتبہ یہ ہے کہ دیکھی گئی صورت حق مشروع (شریعت) اور ناموس موضوع (قانون) کی طرف لوٹتی ہے، خواہ وہ ناموس اس علاقے کا کوئی بھی ہو جہاں وہ صورت دیکھی گئی ہے، اس علاقے کے حکمرانوں کے بارے میں جو اس ناموس پر قائم ہیں۔\nان مذکورہ مراتب کے علاوہ کوئی چوتھی مرتبہ نہیں ہے۔\nپہلی مرتبہ، یعنی صورت کا مرئی کی ذات کی طرف لوٹنا، وہ لازماً حسن اور کامل ہوتی ہے، اور وہ کسی بھی برائی یا نقص سے متصف نہیں ہوتی۔\nباقی دو مراتب میں صورت احوال کے مطابق حسن و قبح، نقص اور کمال کے ساتھ ظاہر ہو سکتی ہے۔\nپس اسے دیکھنا چاہیے کہ اگر اس صورت میں کوئی خطاب ہو تو اس خطاب کے مطابق اس کا حال ہو گا، اور اس کے مطابق جو وہ اپنی رؤیا میں سمجھتا ہے۔ اور اسے حس کی دنیا میں لوٹنے کے بعد تعبیر پر بھروسہ نہیں کرنا چاہیے، مگر یہ کہ وہ خود تعبیر کا عالم ہو یا کسی عالم سے پوچھے جو اس کا علم رکھتا ہو۔\nاور اسے اپنی حرکت پر بھی غور کرنا چاہیے، یعنی دیکھنے والے کی اس صورت کے ساتھ حرکت، خواہ وہ ادب و احترام کی ہو یا اس کے علاوہ ہو۔ کیونکہ اس کا حال اس کے اس عمل کے مطابق ہو گا جو وہ اس صورت کے ساتھ کرتا ہے، کیونکہ وہ ہر لحاظ سے حق کی صورت ہے۔ اور کبھی وہ اس روح کو دیکھتا ہے جس کے ہاتھ میں یہ حضرۃ ہے، اور کبھی نہیں دیکھتا۔\nاور ان صورتوں کے علاوہ جو کچھ بھی ہے، اگر اس میں غمگین کرنا ہو تو وہ صرف شیطان کی طرف سے ہے، یا وہ جو آدمی بیداری میں اپنے دل میں سوچتا ہے۔ پس اس پر بھروسہ نہیں کرنا چاہیے جو وہ اس میں دیکھتا ہے۔\nاس کے باوجود، اگرچہ ان پر بھروسہ نہیں کیا جاتا، جب ان کی تعبیر کی جاتی ہے تو ان کا ایک حکم ہوتا ہے، اور یہ حکم تعبیر کی قوت سے پیدا ہوتا ہے نہ کہ خود رؤیا سے۔ وہ اس طرح کہ تعبیر کرنے والا اس کی تعبیر نہیں کرتا جب تک کہ وہ اسے اپنے خیال میں متکلم کی صورت میں نہ ڈھال لے۔ پس وہ صورت اس محل سے منتقل ہو گئی جہاں وہ حدیث نفس یا شیطان کا غمگین کرنا تھی، اور تعبیر کرنے والے کے خیال میں آ گئی، اور وہ اس کے لیے حدیث نفس نہیں ہے۔ پس وہ ایک محقق صورت پر حکم لگاتا ہے جو اس کی ذات میں مرتسم ہوئی ہے، تو اس کے لیے ایک حکم ظاہر ہوتا ہے جو اس صورت کے تعبیر کرنے والے کے نفس میں آنے سے پیدا ہوا، جیسا کہ یوسف علیہ السلام کے قصے میں دو آدمیوں کے ساتھ ہوا، حالانکہ انہوں نے جو کچھ بیان کیا تھا وہ جھوٹ تھا، اور وہ ان چیزوں میں سے تھا جو انہوں نے اپنے دل میں سوچی تھیں، پس انہوں نے اسے رؤیا کے بغیر تخیل کیا، اور یہ معاملہ میں زیادہ دور کی بات ہے، کیونکہ اگر وہ رؤیا ہوتی تو تعبیر کے باب میں زیادہ داخل ہوتی۔ پس جب انہوں نے یوسف علیہ السلام کو اپنا قصہ سنایا، تو یوسف علیہ السلام کے خیال میں اس کی ایک صورت پیدا ہوئی، حالانکہ یوسف نے خود اس بارے میں نہیں سوچا تھا۔ پس وہ یوسف کے حق میں حق بن گئی، گویا وہی وہ دیکھنے والا تھا جس نے اس آدمی کے لیے وہ رؤیا دیکھی تھی، اور وہ دونوں یوسف کے لیے اس فرشتے کے مقام پر کھڑے ہو گئے جس کے ہاتھ میں رؤیا کی صورتیں ہیں۔ پس جب یوسف نے ان کی رؤیا کی تعبیر کی تو انہوں نے کہا کہ ہم نے تو آپ کو آزمانا چاہا تھا اور ہم نے کچھ نہیں دیکھا تھا۔ تو یوسف نے فرمایا: قُضِيَ الْأَمْرُ الَّذِي فِيهِ تَسْتَفْتِيَانِ (جس امر کے بارے میں تم دونوں پوچھ رہے تھے وہ طے ہو چکا) [12:41]۔ پس وہ امر حس کی دنیا میں اسی طرح ظاہر ہوا جیسا کہ تعبیر کیا گیا تھا۔\nپھر جب اللہ تعالیٰ کسی کو کوئی رؤیا دکھاتا ہے، تو دیکھنے والے کے لیے اس میں خیر و شر کا ایک حصہ (حظ) ہوتا ہے، اس کے مطابق جو اس کی رؤیا تقاضا کرتی ہے، یا وہ حصہ اس جگہ کے وقتی ناموس (قانون) میں ہوتا ہے، لیکن دیکھی گئی صورت میں نہیں ہوتا۔ پس اللہ اس حصے کو ایک پرندے کی صورت میں ڈھال دیتا ہے، جو ایک فرشتہ ہوتا ہے پرندے کی صورت میں، جیسا کہ وہ اعمال سے ملکی، روحانی، جسمانی، برزخی صورتیں پیدا کرتا ہے۔ اور اسے پرندے کی صورت میں اس لیے بنایا کہ کہا جاتا ہے کہ اس کا تیر فلاں چیز کے ساتھ اڑا (یعنی اس کا حصہ نکلا)، اور طائر (پرندہ) سے مراد حصہ (الحظ) ہے۔ اللہ عزوجل نے فرمایا: قَالُوا طَائِرُكُمْ مَعَكُمْ (انہوں نے کہا تمہارا طائر (نصیب) تمہارے ساتھ ہے) [36:19]، یعنی تمہارا حصہ اور نصیب تمہارے ساتھ ہے، خواہ خیر ہو یا شر۔\nاور رؤیا کو اس پرندے کے پاؤں سے لٹکا دیا جاتا ہے، اور وہ پرندے کی عین ذات ہوتی ہے۔ اور چونکہ پرندہ جب زمین سے کوئی شکار پکڑتا ہے تو اسے اپنے پاؤں سے پکڑتا ہے، کیونکہ اس کے ہاتھ نہیں ہوتے اور وہ اپنے پروں سے پکڑ نہیں سکتا، اس لیے رؤیا کو اس کے پاؤں سے لٹکا دیا گیا، پس وہ لٹکی ہوئی ہے اور وہ پرندے کی عین ذات ہے۔ پس جب اس کی تعبیر کی جاتی ہے تو وہ گر جاتی ہے کیونکہ اسے بیان کر دیا گیا ہے۔ اور جب وہ گرتی ہے تو پرندہ معدوم ہو جاتا ہے کیونکہ وہ رؤیا کی عین ذات ہے، پس وہ اس کے گرنے سے معدوم ہو جاتا ہے اور عالم حس (الحس) میں اس حال کے مطابق صورت اختیار کر لیتا ہے جس پر وہ رؤیا ظاہر ہوتی ہے۔ پس رؤیا کی صورت عین حال بن جاتی ہے، اور کچھ نہیں۔ پس وہ حال، خواہ وہ عرض ہو یا جوہر، یا ولایت (الولایۃ) کی کوئی نسبت ہو یا کوئی اور چیز، وہ اس رؤیا اور اس پرندے کی عین صورت ہوتی ہے، اور اسی سے یہ حالت پیدا ہوئی ہے، یہ ضروری ہے۔ خواہ وہ صورت جسم ہو یا عرض یا نسبت، جیسا کہ آدم کو مٹی سے پیدا کیا گیا اور ہمیں حقیر پانی سے۔\nیہاں تک کہ اگر رؤیا کسی بچے کے وجود پر دلالت کرے، تو وہ بچہ اس رؤیا کی عین ذات سے پیدا ہوتا ہے، جو اس کے باپ کی صلب میں پانی کی صورت میں ہوتی ہے۔ اور اگر پانی رحم میں نازل ہو چکا ہو، تو وہ رؤیا اس میں بچے کی صورت اختیار کر لیتی ہے، پس وہ رؤیا کا بچہ ہوتا ہے۔ اور اگر اس سے پہلے کوئی رؤیا نہ دیکھی گئی ہو، تو وہ اپنی اصل نشو و نما پر ہوتا ہے جیسا کہ دوسرے بچے ہوتے ہیں۔ یہ جان لیجیے، کیونکہ یہ ایک عجیب راز اور صحیح کشف (الکشف) ہے۔\nاور ہر وہ بچہ جو کسی رؤیا کے نتیجے میں ہوتا ہے جو اس کے لیے دیکھی گئی ہو، اسے دوسروں پر ایک امتیاز حاصل ہوتا ہے، اور وہ دوسروں کی نسبت ارواح (الأرواح) سے زیادہ قریب ہوتا ہے۔ اگر آپ اس پر غور کریں گے تو آپ اسے اسی طرح دیکھیں گے۔ اور ہر وہ مخلوق، خواہ وہ حالت ہو یا عرض یا ولایت کی نسبت یا کوئی اور چیز، جو رؤیا کے نتیجے میں ہو، اسے اس پر امتیاز حاصل ہوتا ہے جو رؤیا کے نتیجے میں نہیں ہوتی۔\nاور اس کی مثال رسول اللہ صلی اللہ علیہ وسلم کی والدہ آمنہ کی رؤیا میں دیکھیے، یہ آپ کو اس بات کی صحت بدل کر دکھا دے گا جو ہم نے ذکر کی۔ پس آپ صلی اللہ علیہ وسلم اپنی والدہ کی رؤیا کی عین ذات تھے جو آپ کے والد کے پانی میں اس صورت کے ساتھ ظاہر ہوئی جو آپ کی والدہ نے دیکھی تھی۔ اسی لیے آپ صلی اللہ علیہ وسلم کے بارے میں رؤیا کی کثرت ہوئی، پس آپ دوسروں سے ممتاز ہوئے۔ اور جو بات ہم نے کہی ہے اسے صرف اہل علم ہی جانتے ہیں جو کشف (الکشف) کی صورت سے واقف ہیں، اور یہ اللہ کے رازوں میں سے ہے جو اس نے اپنی مخلوق میں رکھے ہیں۔\n\n[علمِ طبیعت میں ایک عجیب راز]\n\nاگر آپ اس بات کی تائید چاہتے ہیں جو ہم نے ذکر کی، تو علمِ طبیعت (علم الطبیعۃ) میں دیکھیے کہ جب حاملہ عورت کسی چیز کی خواہش کرتی ہے (توحمت)، تو بچہ اس چیز سے مشابہت رکھتا ہوا پیدا ہوتا ہے۔ اور جب جماع کے وقت عورت کسی صورت کو دیکھتی ہے یا مرد جماع اور پانی کے انزال کے وقت کسی صورت کا تصور کرتا ہے، تو بچہ اس صورت کی تخلیق پر ہوتا ہے جس کا تصور کیا گیا۔ اسی لیے حکماء فضلاء اور بڑے حکماء کی صورتوں کو ایسی جگہوں پر بنانے کا حکم دیتے تھے جہاں جماع کے وقت عورت اور مرد کی نظر اس صورت پر پڑے، تاکہ وہ خیال میں نقش ہو جائے اور طبیعت میں اثر کرے، پس وہ قوت جو اس صورت میں تھی، اس بچے میں ظاہر ہو جو اس پانی سے پیدا ہوتا ہے۔ اور یہ علمِ طبیعت میں ایک عجیب راز ہے۔\nاور عیسیٰ علیہ السلام کی تخلیق میں دیکھیے کہ مریم نے جبرئیل کو بشر کی صورت میں دیکھا، تو کس طرح ان میں روح (الروح) کا ہونا جو مردوں کو زندہ کرتی ہے اور بشر کا ہونا جمع ہو گیا، کیونکہ روح کے ذریعے ہی طبعی اجسام زندہ ہوتے ہیں۔\nاور اس سے بھی زیادہ قوی وہ ہے جو سامری نے جبرئیل کے قدموں کے نشان کی مٹھی بھر مٹی سے کیا، جب اسے معلوم ہوا کہ روح جہاں بھی حلول کرتی ہے زندگی اس کے ساتھ ہوتی ہے۔ پس اس نے جو کچھ پکڑا تھا اسے بچھڑے میں ڈال دیا، تو بچھڑا اس پکڑے ہوئے اثر سے آواز نکالنے لگا جو روح کے قدموں کے نشان سے تھا۔ اگر وہ اسے گھوڑے کی شکل میں ڈالتا تو وہ ہنہناتا، یا اگر انسان کی شکل میں ڈالتا تو وہ بولتا۔ کیونکہ زندگی کے ساتھ ظاہر ہونے کا استعداد صرف قبول کرنے والے میں تھا۔ اور یہاں سے آپ مظاہر میں ظاہر ہونے والی صورت کو پہچانتے ہیں، اور یہ کہ مظاہر اپنے استعداد کے مطابق اس میں ظاہر ہونے والی چیز کو وہ صورتیں دیتے ہیں جو حامل اور محمول ہوتی ہیں۔ اور اسی لیے اللہ نے یہ حکمت ظاہر کی تاکہ آپ اس سے اس امر پر واقف ہوں جو حقیقت میں ہے۔\nپھر نبی صلی اللہ علیہ وسلم نے رؤیا کو بشریٰ (خوشخبری) اور مبشرہ (خوشخبری دینے والی) اس لیے کہا کہ یہ انسان کے بشرہ (جلد/ظاہری حالت) پر اثر انداز ہوتی ہے۔ کیونکہ انسانی صورت اس چیز سے بدل جاتی ہے جو اس کے باطن میں اس صورت کے تصور سے وارد ہوتی ہے جسے وہ دیکھتا ہے یا اس کلمے سے جسے وہ سنتا ہے، خواہ وہ غم ہو یا خوشی۔ پس اس کا اثر بشرہ پر لازماً ظاہر ہوتا ہے، کیونکہ یہ ایک طبعی حکم ہے جسے اللہ نے طبیعت میں ودیعت کیا ہے، پس یہ اسی طرح ہوتا ہے۔\n\n(تکملہ) رؤیا کے لیے ایک مکان، ایک محل اور ایک حال ہے\n\nاس کا حال (الحال) نیند (النوم) ہے، جو ظاہری محسوسات سے غیبت ہے، جو راحت کا موجب ہے اس تھکاوٹ کی وجہ سے جو یہ نشأۃ (تخلیق) بیداری کی حالت میں حرکت کی وجہ سے اٹھاتی ہے، اگرچہ وہ اس کی خواہش میں ہو۔ اللہ تعالیٰ نے فرمایا: وَجَعَلْنَا نَوْمَكُمْ سُبَاتًا (اور ہم نے تمہاری نیند کو راحت بنایا) [78:9]۔ یعنی ہم نے نیند کو تمہارے لیے راحت بنایا جس سے نفوس آرام پاتے ہیں۔\nاور یہ دو قسموں پر ہے: ایک قسم انتقال (انتقال) کی ہے، جس میں کچھ راحت یا کسی مقصد کا حصول یا مزید تھکاوٹ ہوتی ہے۔ اور دوسری قسم خالص راحت (راحۃ خالصۃ) کی ہے، اور وہ خالص اور صحیح نیند ہے جسے اللہ نے راحت بنایا اس تھکاوٹ کے بدلے جو یہ آلات اور جوارح اور بدنی اعضاء بیداری کی حالت میں اٹھاتے ہیں۔ اور اس کا وقت رات کو مقرر کیا، اگرچہ وہ دن میں بھی واقع ہو، جیسا کہ دن کو معاش کے لیے مقرر کیا، اگرچہ وہ رات میں بھی واقع ہو، لیکن حکم غالب کا ہوتا ہے۔\nجہاں تک انتقال کی قسم کا تعلق ہے، تو وہ وہ نیند ہے جس کے ساتھ رؤیا ہوتی ہے۔ پس یہ آلات ظاہر حس سے باطن کی طرف منتقل ہوتے ہیں تاکہ وہ دیکھیں جو خیال کے خزانے میں مقرر ہے، جہاں حواس نے محسوسات سے جو کچھ لیا تھا اسے جمع کیا تھا، اور جو کچھ قوت مصورہ (تصویر بنانے والی قوت) نے صورت دی تھی، جو اس خزانے کے خادموں میں سے ہے۔ تاکہ یہ نفس ناطقہ (النفس الناطقۃ)، جسے اللہ نے اس شہر کا مالک بنایا ہے، وہ دیکھے جو اس کے خزانے میں جمع ہوا ہے، جیسا کہ بادشاہوں کی عادت ہے کہ وہ اپنی خلوت کے اوقات میں اپنے خزانوں میں داخل ہوتے ہیں تاکہ دیکھیں کہ ان میں کیا ہے۔\nاور جس قدر اس نشأۃ کے لیے آلات (جو جوارح ہیں) اور خادم (جو حسی قویٰ ہیں) کامل ہوتے ہیں، اسی قدر ذخیرہ اندوزی ہوتی ہے۔ پس ایک کامل زندگی کے لیے کامل خزانہ ہوتا ہے، اور ایک ناقص خزانہ ہوتا ہے، جیسے نابینا کا۔ کیونکہ اس کے خیال کے خزانے میں رنگوں کی صورتیں منتقل نہیں ہوتیں، اور گونگے کے لیے آوازوں کی صورتیں اور لفظی حروف خیال کے خزانے میں منتقل نہیں ہوتے۔ یہ سب تب ہوتا ہے جب وہ انہیں اپنی اصل نشو و نما میں کھو دیتا ہے۔ لیکن اگر یہ آفات اس پر بعد میں طاری ہوں تو ایسا نہیں ہوتا۔ کیونکہ جب وہ نیند کے ذریعے نشأۃ کے باطن میں منتقل ہوتا ہے اور خزانے میں داخل ہوتا ہے، تو وہ رنگوں کی صورتیں پاتا ہے جو اس نے آفت آنے سے پہلے اس میں ذخیرہ کی تھیں، اور اسی طرح ہر وہ چیز جو اسے حسی قویٰ میں سے کسی قوت نے دی ہو، جو اس مملکت کے جمع کرنے والے ہیں۔\nاور اللہ کا اس خزانے میں ایک ظہور (تجلی) ہوتا ہے، ایک طبعی صورت میں طبعی صفات کے ساتھ، جیسے آپ صلی اللہ علیہ وسلم کا قول ہے: رَأَيْتُ رَبِّي فِي صُورَةِ شَابٍّ (میں نے اپنے رب کو ایک نوجوان کی صورت میں دیکھا)۔\nاور یہ وہ ہے جو سونے والا اپنی نیند میں معانی کو محسوسات کی صورتوں میں دیکھتا ہے، کیونکہ خیال (الخیال) کی حقیقت یہ ہے کہ وہ اس چیز کو مجسم کر دیتا ہے جس کا مجسم ہونا اس کے شایان شان نہیں ہوتا۔ اور یہ اس لیے کہ اس کی حضرۃ (موجودگی) یہ عطا کرتی ہے۔ اور عالم کی طبقات میں کوئی ایسی چیز نہیں جو امر کو اسی طرح عطا کرے جیسا کہ وہ ہے، سوائے اس خیالی حضرۃ کے، کیونکہ یہ دو متضاد چیزوں کو جمع کرتی ہے، اور اسی میں حقائق اسی طرح ظاہر ہوتے ہیں جیسے وہ ہیں۔ کیونکہ امور میں حق یہ ہے کہ آپ ہر اس امر کے بارے میں جو آپ دیکھتے ہیں یا کسی بھی قوت سے ادراک کرتے ہیں، یہ کہیں کہ جو آپ نے ادراک کیا وہ ہے اور وہ نہیں ہے۔ جیسا کہ اس نے فرمایا: وَمَا رَمَيْتَ إِذْ رَمَيْتَ (اور جب تم نے پھینکا تو تم نے نہیں پھینکا) [8:17]۔\nپس رؤیا کی حالت میں اس صورت میں شک نہ کریں جو آپ دیکھتے ہیں کہ وہ عین وہی ہے جو آپ سے کہا گیا کہ وہ ہے۔ اور جب آپ بیدار ہوں تو تعبیر میں شک نہ کریں کہ وہ نہیں ہے۔ اور صحیح نظر میں شک نہ کریں کہ امر وہ ہے اور وہ نہیں ہے۔\nابو سعید الخراز سے پوچھا گیا: تم نے اللہ کو کیسے پہچانا؟ انہوں نے کہا: بِجَمْعِهِ بَيْنَ الضِّدَّيْنِ (اس کے دو متضاد چیزوں کو جمع کرنے سے)۔ پس ہر وہ ذات جو وجود سے متصف ہے، وہ ہے اور وہ نہیں ہے۔ پس سارا عالم ہے اور نہیں ہے۔ اور صورت کے ذریعے ظاہر ہونے والا حق ہے اور نہیں ہے۔ پس وہ محدود ہے جو محدود نہیں کیا جاتا، اور وہ مرئی ہے جو دیکھا نہیں جاتا۔ اور یہ امر صرف اسی خیالی حضرۃ میں ظاہر ہوا ہے، خواہ نیند کی حالت میں ہو یا ظاہری محسوسات سے غیبوبت کی حالت میں، خواہ وہ کسی بھی نوعیت کی ہو۔ اور نیند میں یہ وجود زیادہ کامل اور عام ہوتا ہے، کیونکہ یہ عارفین اور عام لوگوں دونوں کے لیے ہے۔ اور غیبت، فنا (الفناء)، محو (المحو) اور اس جیسی حالتیں، نیند کے علاوہ، الٰہیات میں عام لوگوں کے لیے نہیں ہوتیں۔\nپس اللہ نے کائنات میں کوئی چیز امر کی صورت پر پیدا نہیں کی جیسا کہ وہ اپنے نفس میں ہے، سوائے اس حضرۃ کے۔ پس اس کے لیے دونوں اطراف میں عام حکم ہے، جیسا کہ ممکن (الممکن) کے لیے دو متضاد چیزوں کو قبول کرنے کی صلاحیت ہے۔ پس اسے یہ ذوقاً حاصل ہوتا ہے۔ کیونکہ جس پر عدم محال ہے، اگرچہ اسے عدم کا علم ہو، لیکن اس کا علم ذاتی نہیں ہوتا، جسے ذوق (الذوق) کہا جاتا ہے۔ بخلاف ممکن کے، کہ عدم اس کے لیے ذوق ہے، اور جس پر وجود محال ہے اور اس کا علم بھی، اسے وجود میں سرے سے کوئی ذوق نہیں ہوتا۔ اور ممکن کو وجود میں ذوق حاصل ہے۔ پس اللہ نے یہ خیالی حضرۃ پیدا کی تاکہ اس میں وہ امر ظاہر ہو جو اصل ہے، جیسا کہ وہ ہے۔\n\n[نیند ایک گزرگاہ ہے]\n\nجان لیجیے کہ مظاہر میں ظاہر ہونے والا، جو اعیان (الأعیان) کے مظاہر ہیں، وہ وجود حق (الوجود الحق) ہے، اور وہ وہ نہیں ہے جو ان اشکال اور صفات کے ذریعے ظاہر ہوا جن پر ممکنات کی اعیان ہیں۔ اور اس حضرۃ کو دو کناروں کے درمیان ایک پل کی طرح بنایا تاکہ اس کنارے سے اس کنارے تک عبور کیا جا سکے۔ پس اس نے نیند کو معبر (گزرگاہ) بنایا، اور اس پر چلنے کو عبور (گزرنا) بنایا۔ اللہ تعالیٰ نے فرمایا: إِن كُنتُمْ لِلرُّؤْيَا تَعْبُرُونَ (اگر تم رؤیا کی تعبیر کر سکتے ہو) [12:43]۔\nاور اس نے اس کا ادراک ایک ایسی حالت میں رکھا جسے راحت (الراحۃ) کہتے ہیں، جو کہ نیند ہے، اس کے اس قول کی حقیقت سے: وَلَقَدْ خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ (اور ہم نے آسمانوں اور زمین کو اور جو کچھ ان کے درمیان ہے چھ دنوں میں پیدا کیا) [50:38]۔ پس اس نے عمل کو اپنی طرف منسوب کیا، اور تخلیق میں ذکر کیا کہ وہ اپنے دونوں ہاتھوں سے اور ہاتھوں سے اور اپنے ہاتھ سے اور اپنے قول سے ہے۔ پھر ہمیں خبر دی کہ اگرچہ وہ عمل سے متصف ہے، لیکن اس پر تھکاوٹ کا اثر نہیں ہوا، پس فرمایا: وَمَا مَسَّنَا مِن لُّغُوبٍ (اور ہمیں کوئی تھکاوٹ نہیں چھوئی) [50:38]، اور فرمایا: وَلَمْ يَعْيَ بِخَلْقِهِنَّ (اور وہ ان کی تخلیق سے نہیں تھکا) [50:15]۔\nپس اسی حقیقت سے نیند میں عظیم، مشکل اور تھکا دینے والے اعمال ظاہر ہوئے، جو کہ بدن کی راحت ہے، یعنی طبیعت اس حالت میں ظاہری حسی حرکات سے آرام کر رہی ہوتی ہے۔ پس یہ عظیم عمل ہے اس راحت میں جہاں اسے شعور نہیں ہوتا کہ وہ راحت میں ہے، خاص طور پر جب وہ نیند میں خوفناک اور ڈرا دینے والے امور دیکھتا ہے۔ جب وہ بیدار ہوتا ہے تو راحت پاتا ہے، پس اسے معلوم ہوتا ہے کہ وہ راحت میں تھا جہاں اسے شعور نہیں تھا۔ اور ان میں سے کچھ ایسے ہیں جو نیند میں جانتے ہیں کہ وہ سو رہے ہیں، اور لوگ اس میں مختلف طبقات پر ہیں۔\nاور ہم نے اس حالت کو انتقال (انتقال) اس لیے کہا کہ معانی اپنے مواد سے تجرید (خالی ہونے) سے مواد کا لباس پہننے کی طرف منتقل ہوتے ہیں، جیسے حق کا اجسام کی صورتوں میں ظاہر ہونا، اور علم کا دودھ کی صورت میں، اور اس جیسی چیزیں۔ اور دوسرا انتقال حواس کا ظاہری محسوس سے اس حضرۃ کی طرف ظاہری محسوس کے ساتھ منتقل ہونا ہے، لیکن اس حضرۃ میں اس کا وہی ثبوت ہوتا ہے جو اسے بیداری کی حضرۃ میں ہوتا ہے۔ کیونکہ وہ اس حضرۃ میں تیزی سے بدلتا ہے، جیسا کہ وہ بیداری میں اپنے باطن میں مختلف صورتوں میں بدلتا ہے نہ کہ اپنے ظاہر میں۔ پس بیداری میں اس کا باطن یہی حضرۃ ہے۔\nاور رات کو اس کے لیے لباس بنایا گیا ہے، کیونکہ رات دیکھنے والے کو اس کے دیکھنے میں صرف اس کا نفس ہی عطا کرتی ہے۔ پس وہ ادراک کرتا ہے لیکن اس کے ذریعے ادراک نہیں کیا جاتا، کیونکہ وہ غیب اور تاریکی ہے۔ اور غیب اور تاریکی ادراک کرتے ہیں لیکن ان کے ذریعے ادراک نہیں کیا جاتا۔ اور روشنی ادراک کرتی ہے اور اس کے ذریعے ادراک کیا جاتا ہے، اور یہ بیداری کی حالت ہے۔ اسی لیے رؤیا کی تعبیر کی جاتی ہے اور اس کی تعبیر نہیں کی جاتی جسے حس نے ادراک کیا ہو۔\nپس جب انسان معرفت کے درجات میں ترقی کرتا ہے تو وہ جان لیتا ہے کہ وہ اپنی معمول کی بیداری کی حالت میں سویا ہوا ہے، اور جس امر میں وہ ہے وہ ایمان اور کشف (الکشف) کے لحاظ سے رؤیا ہے۔ اسی لیے اللہ نے ظاہری حس میں واقع ہونے والے امور کا ذکر کیا اور فرمایا: فَاعْتَبِرُوا (پس عبرت حاصل کرو) [59:2]، اور فرمایا: إِنَّ فِي ذَلِكَ لَعِبْرَةً (بے شک اس میں عبرت ہے) [3:13]، یعنی جو کچھ تمہارے لیے ظاہر ہوا ہے اس سے گزر کر اس علم کی طرف عبور کرو جو اس کے باطن میں ہے اور جس کے لیے وہ آیا ہے۔\nآپ صلی اللہ علیہ وسلم نے فرمایا: النَّاسُ نِيَامٌ فَإِذَا مَاتُوا انْتَبَهُوا (لوگ سوئے ہوئے ہیں، جب وہ مریں گے تو بیدار ہوں گے۔)\nلیکن انہیں شعور نہیں ہوتا، اور اسی لیے ہم نے کہا کہ یہ ایمان کے لحاظ سے ہے۔ اور ہم نے اس مقام کو اس کتاب میں معرفت کے باب میں مکمل طور پر بیان کیا ہے، جو باب ایک سو ستترواں ہے۔\nپس سارا وجود نیند ہے، اور اس کی بیداری بھی نیند ہے۔ پس سارا وجود راحت ہے، اور راحت رحمت ہے۔ پس وَسِعَتْ كُلَّ شَيْءٍ (ہر چیز کو گھیر لیا ہے) [40:7]، پس اسی کی طرف انجام ہے۔ فرشتے اللہ سے کہتے ہیں: وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وَعِلْمًا (تو نے ہر چیز کو رحمت اور علم سے گھیر لیا ہے) [40:7]۔ اور یہاں ایک راز ہے، اگر آپ اس پر غور کریں گے تو اس تک پہنچ جائیں گے، اور وہ اس کے اسماء حسنیٰ پر ان کے آثار کے ظہور میں اس کی رحمت ہے۔ پس اس کے علم کی انتہا اس کی رحمت کی انتہا ہے۔\nپھر میں لوٹ کر کہتا ہوں کہ اگر اس راستے میں تھکاوٹ بھی ہو تو وہ راحت میں تھکاوٹ ہے، جیسے مزدور جو تھکاوٹ اٹھاتا ہے یا اسے لذت بخش سمجھتا ہے اس اجرت کی راحت کی وجہ سے جو اس کے نفس میں ہوتی ہے، جس کے حصول کے لیے وہ کام کرتا ہے۔ پس اجرت کی راحت کا وجود اسے تھکاوٹ سے روکتا ہے۔ جب وہ اجرت وصول کر لیتا ہے تو رات کو نیند کی راحت میں داخل ہو جاتا ہے، پس اس کے جوارح حرکت سے رک جاتے ہیں اور وہ راحت پاتا ہے۔ پس وہ اجرت کی راحت سے نیند کی راحت کی طرف منتقل ہو جاتا ہے۔\nپس تحقیق کے مطابق، عالم کی صورتیں ذات حق (الحق) کے لیے اسم باطن (الاسم الباطن) کی طرف سے، سونے والے کے لیے رؤیا کی صورتوں کی مانند ہیں، اور ان میں تعبیر یہ ہے کہ وہ صورتیں اس کے احوال ہیں۔ پس وہ اس کے سوا کچھ نہیں، جیسا کہ رؤیا کی صورتیں دیکھنے والے کے احوال ہیں، اور کچھ نہیں۔ پس اس نے اپنے آپ کے سوا کچھ نہیں دیکھا۔\nپس یہی اس کا قول ہے کہ اس نے آسمانوں اور زمین کو اور جو کچھ ان کے درمیان ہے، إِلَّا بِالْحَقِّ (مگر حق کے ساتھ) [15:85] پیدا نہیں کیا، اور وہ اس کی عین ذات ہے۔ اور عارفین کے حق میں اس کا قول ہے: وَيَعْلَمُونَ أَنَّ اللَّهَ هُوَ الْحَقُّ الْمُبِينُ (اور وہ جانتے ہیں کہ اللہ ہی حق مبین ہے) [24:25]، یعنی ظاہر ہونے والا۔ پس وہ واحد ہے جو کثیر ہے۔\nپس جو شخص رؤیا میں عبرت حاصل کرتا ہے، وہ ایک خوفناک امر دیکھتا ہے اور اس کے لیے وہ چیز واضح ہو جاتی ہے جسے وہ اس طریقے کے بغیر ادراک نہیں کر سکتا۔ اسی لیے:\nرسول اللہ صلی اللہ علیہ وسلم جب صبح کرتے تو اپنے صحابہ سے پوچھتے: هَلْ رَأَى أَحَدٌ مِنْكُمْ رُؤْيَا (کیا تم میں سے کسی نے کوئی رؤیا دیکھی ہے؟)\nکیونکہ یہ نبوت ہے، پس آپ چاہتے تھے کہ اسے اپنی امت میں دیکھیں، اور آج کل لوگ اس مرتبے سے انتہائی جہالت میں ہیں جس کا رسول اللہ صلی اللہ علیہ وسلم خیال رکھتے تھے اور ہر روز اس کے بارے میں پوچھتے تھے۔ اور اس زمانے کے جاہل لوگ جب نیند میں واقع ہونے والے کسی امر کے بارے میں سنتے ہیں تو اس کی طرف توجہ نہیں کرتے اور کہتے ہیں کہ یہ تو منامات ہیں، یہ تو خیال ہے، حالانکہ وہ رؤیا ہوتی ہے۔ پس وہ دیکھنے والے کو حقیر سمجھتے ہیں اگر وہ اس پر بھروسہ کرتا ہے۔ اور یہ سب اس کے مقام سے جہالت کی وجہ سے ہے، اور اس جہالت کی وجہ سے کہ وہ اپنی بیداری میں بھی رؤیا میں ہے، اور اپنی نیند میں رؤیا کے اندر رؤیا میں ہے۔ پس وہ اس شخص کی طرح ہے جو نیند میں دیکھے کہ وہ بیدار ہو گیا ہے، حالانکہ وہ اپنی نیند میں ہے۔ اور یہی آپ صلی اللہ علیہ وسلم کا قول ہے: النَّاسُ نِيَامٌ (لوگ سوئے ہوئے ہیں)۔\nنبوی خبریں کتنی عجیب ہیں! انہوں نے حقائق کو اسی طرح واضح کر دیا جیسا کہ وہ ہیں، اور اس چیز کو عظمت بخشی جسے قاصر عقل نے حقیر سمجھا۔ کیونکہ یہ صرف ایک عظیم ذات سے صادر ہوا ہے، اور وہ ذات حق (الحق) ہے۔\nپس یہی ہمارے اس تقسیم کا معنیٰ ہے کہ یہ انتقال کی قسم ہے۔\nجہاں تک نیند کی دوسری قسم کا تعلق ہے، تو وہ راحت کی قسم ہے، اور وہ وہ نیند ہے جس میں کوئی رؤیا نہیں دیکھی جاتی۔ پس وہ صرف بدنی راحت کے لیے ہے، اور کچھ نہیں۔\nپس یہ رؤیا کا حال ہے۔ اور اب مکان (المکان) اور محل (المحل) کی معرفت باقی ہے۔\nجہاں تک محل کا تعلق ہے، تو وہ یہی عنصری نشأۃ (النشأۃ العنصریۃ) ہے۔ رؤیا کا اس کے علاوہ کوئی محل نہیں ہوتا۔ پس فرشتے کے لیے رؤیا نہیں ہوتی، بلکہ یہ خاص طور پر عنصری حیوانی نشأۃ کے لیے ہے۔ اور اس کا محل علم الٰہی میں ظہور الٰہی (التجلی) کی صورتوں میں استحالات (تبدیلیاں) ہیں۔ پس جو کچھ ہم میں ہے وہ حق کی رؤیا ہے، جو اعیاء اور تھکاوٹ کے رفع ہونے کی راحت میں ہے، اور کچھ نہیں۔\nاور جہاں تک مکان کا تعلق ہے، تو وہ خاص طور پر فلک قمر (فلك القمر) کے مقعر کے نیچے ہے۔ اور آخرت میں فلک کواکب ثابتہ (فلك الكواكب الثابتة) کے مقعر کے نیچے ہے۔ اور اس کی وجہ یہ ہے کہ نیند جہنم میں بھی بعض اوقات ہو سکتی ہے، خاص طور پر کبیرہ گناہوں کے مرتکب مومنوں کے لیے۔ اور کواکب کے فلک سے اوپر کوئی نیند نہیں ہے۔\nاور میری مراد اس سے وہ نیند ہے جو عرف میں جانی جاتی ہے۔ اور جہاں تک اس نیند کے حال کی معرفت کا تعلق ہے جس کی طرف ہم پہلے گئے تھے، تو وہ ایک اور امر ہے جسے ہم بیان کر چکے ہیں۔\nاور اس کے مکان کی صورت یوں ہے: (یہاں حاشیہ میں جو صورت بنائی گئی ہے وہ یہ ہے) یہ رؤیا کے مکان کی صورت ہے، اور یہ صور (قرن/سینگ) سے مشابہت رکھتی ہے۔ اس کا اوپر کا حصہ کشادہ ہے اور نیچے کا حصہ تنگ ہے، جو نشأۃ کے الٹ ہے۔ کیونکہ جو حصہ سر کے قریب ہے وہ اوپر والا ہے اور وہ زیادہ کشادہ ہے، اور جو حصہ اس سے تنگ ہے وہ نیچے والا ہے اور وہ اصل سے دور ہے۔ پس وہ صور (قرن) رؤیا کا مکان ہے۔ پس جب وہ اس صور سے باہر نکلتا ہے تو وہ عرف میں معلوم رؤیا کے مکان سے باہر نکل جاتا ہے، پس اس کے بعد وہ رؤیا نہیں دیکھتا، کیونکہ اس میں نیند کی صفت قائم نہیں رہتی، پس وہ ابدی راحت میں ہوتا ہے۔\nاور یہ مقدار اس تعریف کے لیے کافی ہے جو ہم رؤیا کے مقام کے بارے میں چاہتے ہیں۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے) [33:4]۔ اور جس چیز کے بارے میں ہم خاموش رہے وہ عظیم ہے، کیونکہ اکثر لوگوں کے لیے فکر اس کا تصور کرنے سے عاجز ہے۔ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ (لیکن اکثر لوگ نہیں جانتے) [12:21]، جیسا کہ إِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ (اکثر لوگ ایمان نہیں لاتے) [11:17]۔ اور علم کی طرف ہی فقہ اور عقل لوٹتی ہے، اس کے قول میں: لَا يَفْقَهُونَ (وہ نہیں سمجھتے) اور لَا يَعْقِلُونَ (وہ عقل نہیں کرتے)۔\n(جلد ایک سو سترہواں ختم ہوا)",
    "fa": "باب صد و هشتاد و هشتم در معرفت مقام رؤیا که همان مژده‌دهنده‌ها (المبشرات) است.\n\nبه صدق است رؤیای مردان صادق، و هر که با ضد همراه شود، رؤیایش صادق نباشد.\n\nصدق، منازلش در کرانه دورتر (العدوة القصوى) است و ضدش، ضد اوست در کرانه نزدیک‌تر (العدوة الدنيا).\n\nرؤیا همان نبوت است، جز اینکه از نسخ شریعت قاصر است، و این مرتبه‌ای والاست.\n\nمن شمشیرهایی را دیدم که برای هوس از نیام کشیده شده‌اند، و در دست راستم شمشیری برای هوس دنیا بود.\n\nپس نه چشمی و نه اثری برای آن باقی گذاشتم، با آن شمشیر در آخرت و در دنیا.\n\n### [انسان دو حالت دارد: حالت خواب و حالت بیداری]\n\nخداوند تو را یاری کند، بدان که انسان دو حالت دارد: حالتی که خواب نامیده می‌شود و حالتی که بیداری نامیده می‌شود. در هر دو حالت، خداوند برای او ادراکی قرار داده است که به وسیله آن اشیا را درک می‌کند. این ادراکات در بیداری «حس» نامیده می‌شود و در خواب «حس مشترک» نامیده می‌شود. هر آنچه در بیداری می‌بینی، «رؤیت» نامیده می‌شود و هر آنچه در خواب می‌بینی، «رؤیا» (رؤيا مقصور) نامیده می‌شود. تمام آنچه انسان در خواب درک می‌کند، از چیزهایی است که خیال (الخيال) در حالت بیداری از حواس ضبط کرده است. و این بر دو نوع است: یا صورتی است که در حس درک شده، یا اجزای صورتی است که در خواب درک شده و در حس نیز درک شده است؛ این ضروری است. اگر در اصل خلقتش چیزی از ادراک حواس کم باشد، و آن امر را که فاقد معنای حسی است در بیداری درک نکند، هرگز آن را در خواب نیز درک نخواهد کرد. پس اصل، حس و ادراک به وسیله آن در بیداری است و خیال (الخيال) در این امر تابع است. و گاهی این امر بر برخی افراد تقویت می‌شود و آنچه را که در خواب درک می‌کردند، در بیداری نیز درک می‌کنند، و این نادر است و مخصوص اهل این طریق از پیامبر و ولی است. ما این‌گونه آن را شناخته‌ایم. پس چون این را دانستی...\n\n### [خطاب خداوند متعال یا کلام خداوند متعال به پیامبرانش در حالت خواب یا بیداری]\n\nپس همچنین بدان که نبوت، خطاب خداوند متعال یا کلام خداوند متعال است، هر طور که بخواهی بگویی، به هر یک از بندگانش که بخواهد، در این دو حالت بیداری و خواب. و این خطاب الهی که نبوت نامیده می‌شود، بر سه نوع است: نوعی که «وحی» نامیده می‌شود، نوعی که کلام او را از وَراءِ حِجابٍ (پشت پرده) می‌شنود، و نوعی که به واسطه رسول است. پس آن رسول، خواه فرشته باشد یا بشر، به اذن خداوند آنچه را که می‌خواهد به کسی که به سویش فرستاده شده، وحی می‌کند. و این کلام خداست، زیرا این رسول تنها از جانب خدا ترجمه می‌کند، چنانکه خداوند متعال می‌فرماید: وَ ما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ مِنْ وَراءِ حِجابٍ أَوْ يُرْسِلَ رَسُولًا (و هیچ بشری را نرسد که خدا با او سخن گوید مگر به وحی، یا از پشت پرده، یا رسولی بفرستد). پس وحی، برخی از آن چیزی است که خداوند بدون واسطه به قلب بندگانش القا می‌کند، و در قلب‌هایشان سخنی را می‌شنواند که کیفیت شنیدن آن وصف نمی‌شود و حدی آن را در بر نمی‌گیرد و خیال (الخيال) آن را صورت نمی‌دهد، با این حال آن را تعقل می‌کند و نمی‌داند چگونه آمد و از کجا آمد و سبب آن چیست. و گاهی از پشت پرده با او سخن می‌گوید، که صورت آنچه با او سخن می‌گوید، حجاب است. و گاهی حجاب، بشریت خود اوست. و گاهی حجاب، مانند آن است که با موسی از الشَّجَرَةِ (درخت) ... مِنْ جانِبِ الطُّورِ الْأَيْمَنِ (از جانب راست کوه طور) با او سخن گفت، زیرا اگر از سمت چپ که جهت قلب اوست با او سخن می‌گفت، شاید با کلام نفسش مشتبه می‌شد. پس کلام از سمتی به او رسید که عادت بر آن جاری نبود که نفسش از آنجا با او سخن بگوید. و گاهی به واسطه رسولی از فرشتگان با او سخن می‌گوید، مانند قول خداوند: نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ (روح‌الامین آن را بر قلب تو نازل کرد)، یعنی قرآن را که کلام خداست. و گاهی به واسطه بشر است، و آن قول خداوند است: فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله (پس او را پناه ده تا کلام خدا را بشنود). پس کلام را به خدا نسبت داد، در حالی که صحابه و این اعرابی آن را جز از زبان رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) نشنیدند. و نبوت امری زائد بر اخبار الهی با این اقسام نیست. و قرآن خبر خداست و تمام نبوت است، زیرا جامع تمام چیزهایی است که خداوند خواسته است بندگانش را از آن باخبر سازد. و در حدیث صحیح آمده است که هر کس قرآن را حفظ کند، نبوت در میان دو پهلویش گنجانده شده است.\n\nپس چون آنچه ذکر کردیم مقرر شد...\n\n### [آغاز وحی، رؤیای صادقه است]\n\nپس بدان که آغاز وحی، رؤیای صادقه است و آن جز در حالت خواب رخ نمی‌دهد.\n\nعایشه در حدیث صحیح گفت: «أول ما بدي‏ء به رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من الوحي الرؤيا الصادقة» (نخستین چیزی که وحی با آن بر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آغاز شد، رؤیای صادقه بود).\n\nو هیچ رؤیایی نمی‌دید مگر اینکه مانند سپیده صبح آشکار می‌شد. و سبب آن، صدق (راستی) او (صَلَّى اللهُ عَليهِ وسَلَّم) بود.\n\nزیرا از او ثابت شده است که فرمود: «أصدقكم رؤيا أصدقكم حديثا» (راستگوترین شما در سخن، راستگوترین شما در رؤیاست).\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) با هیچ کس سخنی نمی‌گفت که از ساختگی‌های نفسش باشد، بلکه با آنچه به وسیله یکی از قوای حسی یا تمام آن‌ها درک می‌کرد، سخن می‌گفت. او از روی گمان سخن نمی‌گفت و چیزی را که نبود نمی‌گفت و در بیداری از چیزی که در خیالش صورت می‌داد و در حس، عین آن صورت را ندیده بود، سخن نمی‌گفت. این سبب صدق رؤیای او بود. و وحی به رؤیا آغاز شد نه به حس، زیرا معانی معقول به خیال (الخيال) نزدیک‌ترند تا به حس؛ چرا که حس طرف پایین‌تر و معنی طرف بالاتر و لطیف‌تر است و خیال در میان آن دو قرار دارد، و وحی یک معنی است. پس اگر معنی بخواهد به حس نازل شود، ناگزیر باید قبل از رسیدن به حس، از حضرت خیال عبور کند. و از حقیقت خیال این است که هر آنچه نزد او حاصل شود را در صورت محسوس تصویر کند؛ این ضروری است. پس اگر ورود آن وحی الهی در حالت خواب باشد، «رؤیا» نامیده می‌شود، و اگر در حالت بیداری باشد، «تخیل» نامیده می‌شود، یعنی به او تخیل شد. به همین دلیل، وحی با خیال آغاز شد، سپس خیال به فرشته از خارج منتقل شد، و فرشته به صورت مردی یا شخصی از اشخاص محسوس متمثل می‌شد. گاهی این شخص که وحی برای اوست، به تنهایی این فرشته را درک می‌کند و گاهی حاضران با او نیز آن را درک می‌کنند، و فرشته سخن پروردگارش را که همان وحی است، بر گوش او القا می‌کند. و گاهی بر قلب او (صَلَّى اللهُ عَليهِ وسَلَّم) نازل می‌شود و او را برحاء (سختی و حالت) فرا می‌گیرد، که از آن به «حال» تعبیر می‌شود، زیرا طبع با آن سازگار نیست. به همین دلیل بر او سخت می‌آید و مزاج شخص منحرف می‌شود تا زمانی که آنچه به او وحی شده را ادا کند، سپس از او رفع می‌شود و آنچه به او گفته شده را خبر می‌دهد. و این همه در مردان خدا از اولیا نیز موجود است. و آنچه پیامبر را در این امر از ولی متمایز می‌کند، وحی تشریعی است. پس جز پیامبر تشریع نمی‌کند، و جز رسول به طور خاص تشریع نمی‌کند، که حلال و حرام می‌کند و مباح می‌سازد و تمام انواع وحی را می‌آورد. و اولیا از این امر جز اخبار به صحت آنچه این رسول آورده و تعیین آن، بهره‌ای ندارند، تا این تابع بر بصیرت (البصيرة) باشد در آنچه پروردگارش او را به واسطه زبان این رسول مکلف کرده است، زیرا این ولی زمان او را درک نکرده تا از او بشنود، چنانکه اصحابش شنیدند. پس این ولی با این نوع از خطاب، به منزله صاحبی است که از لفظ رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آنچه را که تشریع شده شنیده است. و به همین دلیل در قرآن آمده است: أَدْعُوا إِلَى اللهِ عَلى‏ بَصِيرَةٍ أَنَا وَ مَنِ اتَّبَعَنِي (من و هر که از من پیروی کند، با بصیرت به سوی خدا دعوت می‌کنیم). و آنان همین کسانی هستند که ذکر کردیم. چه بسا حدیثی که از طریق روایت ثقات نزد ما صحیح است، اما در نفس‌الامر صحیح نیست، و ما آن را از طریق غلبه ظن می‌پذیریم نه از روی علم. و این طایفه‌ای که ذکر کردیم، آن را از این طریق می‌پذیرند، پس ما نسبت به عدم صحت آن خبر صحیح نزد خود، بر بصیرت هستیم که در نفس‌الامر صحیح نیست. و برعکس آن نیز هست: حدیثی ضعیف باشد به دلیل ضعف طریق، از کسی که در آن وضع کرده یا تدلیس نموده، در حالی که در نفس‌الامر صحیح است. این طایفه صحت آن را درک می‌کنند و در آن بر بصیرت هستند. پس این معنای قول خداوند متعال است: أَدْعُوا إِلَى اللهِ عَلى‏ بَصِيرَةٍ أَنَا وَ مَنِ اتَّبَعَنِي (من و هر که از من پیروی کند، با بصیرت به سوی خدا دعوت می‌کنیم). پس آنان وارثان انبیا هستند، به دلیل اشتراکشان در خبر و انفراد انبیا در تشریع. خداوند متعال می‌فرماید: يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلى‏ مَنْ يَشاءُ مِنْ عِبادِهِ لِيُنْذِرَ يَوْمَ التَّلاقِ (روح را به فرمان خود بر هر که از بندگانش بخواهد القا می‌کند تا [مردم را] از روز ملاقات بترساند). پس «مَن» (هر که) را به صورت نکره آورد تا انذار کند، نه تشریع و حکم. پس ولی می‌تواند بشارت‌دهنده و بیم‌دهنده باشد، اما مشرّع نیست. زیرا رسالت و نبوت تشریعی قطع شده است، پس نه رسولی بعد از اوست و نه پیامبری، یعنی نه مشرّعی و نه شریعتی. این را بدان. حال به آنچه برای آن باب گشودیم بازگردیم.\n\nاز رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) ثابت شده است که فرمود: «إن الرسالة والنبوة قد انقطعت فلا رسول بعدي ولا نبي» (رسالت و نبوت قطع شده است، پس نه رسولی بعد از من است و نه پیامبری). راوی می‌گوید: این بر مردم گران آمد. پس فرمود: «لكن المبشرات» (اما مژده‌دهنده‌ها). گفتند: ای رسول خدا، مژده‌دهنده‌ها چیست؟ فرمود: «رؤيا المسلم وهي جزء من أجزاء النبوة» (رؤیای مسلمان، و آن جزئی از اجزای نبوت است).\n\nاین حدیثی حسن و صحیح است از حدیث انس بن مالک که امام مقام در حرم مکی شریف، روبروی رکن یمانی که حجرالاسود در آن است، در سال ششصد و چهار، شیخ ما مکین‌الدین ابوشجاع زاهر بن رستم اصفهانی بزاز و دیگران برای ما روایت کردند... [سند حدیث]... از انس بن مالک که گفت: رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود... و این حدیث را ذکر کرد. و گفت: در این باب از ابوهریره، حذیفه، ابن عباس و ام کرز نیز روایت شده است.\n\nپس او (صَلَّى اللهُ عَليهِ وسَلَّم) خبر داد که رؤیا جزئی از اجزای نبوت است.\n\nپس برای مردم از نبوت، این و غیر این باقی مانده است، با این حال، نام نبوت و نبی جز بر مشرّع به طور خاص اطلاق نمی‌شود. پس این نام برای خصوص وصف معینی در نبوت محدود شد، اما نبوتی که این وصف خاص را ندارد، محدود نشده است، اگرچه نام آن محدود شده است. پس ما ادب نگه می‌داریم و در جایی که او (صَلَّى اللهُ عَليهِ وسَلَّم) توقف کرد، توقف می‌کنیم، پس از آنکه دانستیم چه گفت و چه را اطلاق کرد و چه را محدود ساخت، تا بر بینه از امر خود باشیم. و چون این را دانستی، بگوییم که رؤیا سه نوع است: یکی بشارت است، که موضوع بحث ما در این باب است؛ و رؤیایی که از آنچه فرد در بیداری با خود حدیث نفس می‌کند، ناشی می‌شود و در خیالش نقش می‌بندد، پس چون بخوابد، آن را با حس مشترک درک می‌کند، زیرا در بیداری آن را تصور کرده و در خیالش مرتسم مانده است. پس چون بخوابد و حواس به خزانه‌ی خیال بازگردند، آن را می‌بیند. و علم و صورت تمام این‌ها خواهد آمد. و رؤیای سوم از شیطان است. و در این باره حدیث صحیحی را از حدیث ابوعیسی ترمذی روایت کردیم که گفت: ... [سند حدیث]... از ابوهریره که گفت: رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «إذا اقترب الزمان لم تكد رؤيا المؤمن تكذب وأصدقهم رؤيا أصدقهم حديثا ورؤيا المسلم جزء من ستة وأربعين جزءا من النبوة والرؤيا ثلاث فالرؤيا الصالحة بشرى من الله تعالى ورؤيا من تحزين الشيطان ورؤيا مما يحدث الرجل به نفسه وإذا رأى أحدكم ما يكره فليقم وليتفل ولا يحدث به الناس» (چون زمان نزدیک شود، رؤیای مؤمن تقریباً دروغ نمی‌شود، و راستگوترین شما در رؤیا، راستگوترین شما در سخن است. و رؤیای مسلمان جزئی از چهل و شش جزء نبوت است. و رؤیا سه نوع است: رؤیای صالح، بشارتی از خداوند متعال است؛ و رؤیایی از غمگین ساختن شیطان؛ و رؤیایی از آنچه مرد با خود حدیث نفس می‌کند. و اگر یکی از شما چیزی را دید که ناخوش داشت، برخیزد و آب دهان بیندازد و آن را برای مردم بازگو نکند).\n\nو در آن گفت: حدیث صحیح است. و در حدیث ابی قتاده از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آمده است: «إذا رأى أحدكم شيئا يكرهه فلينفث عن يساره ثلاث مرات وليستعذ بالله من شرها فإنها لا تضره» (اگر یکی از شما چیزی را دید که ناخوش داشت، سه بار به سمت چپ خود فوت کند و از شر آن به خدا پناه ببرد، که به او ضرر نمی‌رساند).\n\nو آن حدیثی حسن و صحیح است. و در حدیث صحیح از پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) آمده است که: «أن رؤيا المسلم على رجل طائر ما لم يحدث بها فإذا حدث بها وقعت» (رؤیای مسلمان بر پای پرنده‌ای است، تا زمانی که آن را بازگو نکند. پس چون بازگو کند، واقع می‌شود).\n\n### [خداوند فرشته‌ای موکل بر رؤیا دارد که روح نامیده می‌شود]\n\nپس بدان که خداوند فرشته‌ای موکل بر رؤیا دارد که «روح» نامیده می‌شود و او زیر آسمان دنیاست. و در دست او صور اجسادی است که شخص خوابیده خود و دیگران را در آن‌ها درک می‌کند، و صور آنچه از آن صور از اکوان (هستی‌ها) حادث می‌شود. پس چون انسان بخوابد، یا صاحب غیبت (غیبت از حس) یا فنا (الفناء) باشد، یا دارای نیروی ادراکی باشد که محسوسات در بیداری او را از درک آنچه در دست این فرشته از صور است، محجوب نسازد، این شخص با نیروی خود در بیداری، آنچه را که شخص خوابیده در خوابش درک می‌کند، درک می‌نماید. و این بدان سبب است که لطیفه انسانی با قوای خود از حضرت محسوسات به حضرت خیال (الخيال) متصل به آن منتقل می‌شود که جایگاهش جلوی مغز است. پس آن روح موکل بر صور، از خیال منفصل، به اذن الهی، آنچه را که حق (الحق) می‌خواهد به این شخص خوابیده یا غایب یا فانی یا قوی نشان دهد، از معانی که در صور در دست این فرشته متجسد شده‌اند، بر او افاضه می‌کند. برخی از این صور به خداوند و آنچه با آن از اسماء وصف می‌شود، تعلق دارد. پس حق (الحق) را در صورتی یا قرآن یا علم یا رسولی که بر شریعت اوست، درک می‌کند. در اینجا برای بیننده سه مرتبه یا یکی از آن‌ها رخ می‌دهد: مرتبه اول این است که صورت درک شده، با توجه به منزلی از منازل و صفات مرئی که به او بازمی‌گردد، به خود مرئی بازگردد. پس آن رؤیای امر بر همان حالتی است که به او بازگشته است. مرتبه دوم این است که صورت مرئی به حال خود بیننده در نفسش بازگردد. مرتبه سوم این است که صورت مرئی به حق مشروع و ناموس (الناموس) وضع شده بازگردد، یعنی هر ناموسی که در آن منطقه وجود دارد، در مورد والیان امر آن اقلیم که به ناموس آن قیام کرده‌اند. و مرتبه چهارمی جز آنچه ذکر کردیم، وجود ندارد. مرتبه اول، یعنی بازگشت صورت به عین مرئی، نیکو و کامل است و ناگزیر به هیچ زشتی و نقصی متصف نمی‌شود. اما دو مرتبه باقی‌مانده، صورت در آن‌ها ممکن است بر حسب احوال، از زیبایی و زشتی و نقص و کمال ظاهر شود. پس باید بنگرد که اگر از آن صورت خطابی بود، حال او بر حسب آن خطاب خواهد بود و به اندازه‌ای که در رؤیایش از آن می‌فهمد. و پس از بازگشت به عالم حس، نباید بر تعبیر در آن اعتماد کند، مگر اینکه خود عالم به تعبیر باشد یا از عالمی در این باره بپرسد. و همچنین باید به حرکت خود، یعنی حرکت بیننده با آن صورت، از ادب و احترام یا غیر آن بنگرد، زیرا حال او بر حسب آنچه از او در تعامل با آن صورت صادر می‌شود، خواهد بود، چرا که آن صورت حق (الحق) است از هر جهت. و گاهی روح (الروح) که این حضرت در دست اوست، مشاهده می‌شود و گاهی مشاهده نمی‌شود. و غیر از این صورت، چیزی جز از شیطان نیست، اگر در آن غمگین ساختن باشد، یا از آنچه فرد در حالت بیداری با خود حدیث نفس می‌کند. پس نباید بر آنچه از این‌ها می‌بیند، اعتماد کند. با این حال، با وجود اینکه نباید بر آن‌ها اعتماد کرد، اگر تعبیر شوند، حکمی خواهند داشت و این حکم ناگزیر از نیروی تعبیر حادث می‌شود، نه از خود رؤیا. و آن این است که کسی که آن را تعبیر می‌کند، آن را تعبیر نمی‌کند مگر اینکه آن را در خیال خود از متکلم تصویر کند. پس آن صورت از محلی که حدیث نفس یا غمگین ساختن شیطان بود، به خیال تعبیرکننده منتقل شده است، و آن برای او حدیث نفس نیست. پس بر صورتی محقق حکم می‌کند که در ذات او نقش بسته است، و برای آن حکمی ظاهر می‌شود که حصول آن صورت در نفس تعبیرکننده ایجاد کرده است، چنانکه در داستان یوسف با آن دو مرد آمد. آن دو در آنچه تصویر کردند، دروغ گفته بودند و آن از چیزهایی بود که با خود حدیث نفس کرده بودند و آن را تخیل کرده بودند، نه اینکه رؤیا دیده باشند. و این در امر دورتر است، زیرا اگر رؤیا بود، بیشتر در باب تعبیر وارد می‌شد. اما وقتی آن را برای یوسف تعریف کردند، صورتی از آن در خیال یوسف (علیه السلام) حاصل شد که یوسف خود آن را حدیث نفس نکرده بود. پس در حق یوسف حق شد، و گویی او بیننده‌ای بود که آن رؤیا را برای آن مرد دیده است. و آن دو مرد برای یوسف به منزله فرشته‌ای شدند که صور رؤیا در دست اوست. پس چون یوسف رؤیایشان را تعبیر کرد، گفتند: ما قصد آزمایش تو را داشتیم و چیزی ندیده بودیم. یوسف گفت: قُضِيَ الْأَمْرُ الَّذِي فِيهِ تَسْتَفْتِيانِ (آن امری که درباره‌اش سؤال می‌کردید، حکم شد). پس آن امر در حس، همان‌گونه که تعبیر شد، خارج گشت. سپس، هرگاه خداوند متعال ببیند که کسی رؤیایی دیده است، صاحب آن رؤیا در آنچه دیده، بهره‌ای از خیر و شر دارد، بر حسب آنچه رؤیایش اقتضا می‌کند، یا بهره در ناموس (الناموس) زمان در آن مکان است، اما نه در صورت مرئی. پس خداوند آن بهره را به صورت پرنده‌ای تصویر می‌کند، که فرشته‌ای است در صورت پرنده، چنانکه از اعمال، صور ملکی، روحانی، جسمانی و برزخی خلق می‌کند. و آن را در صورت پرنده قرار داد، زیرا گفته می‌شود: سهم او به فلان چیز پرید (طار له سهمه بکذا). و طائر (پرنده) همان بهره و نصیب است. خداوند عز و جل می‌فرماید: قالُوا طائِرُكُمْ مَعَكُمْ (گفتند: طائر شما با شماست)، یعنی بهره و نصیب شما از خیر و شر با شماست. و رؤیا را از پای این پرنده آویزان می‌کند، و آن عین پرنده است. و چون پرنده اگر چیزی را از زمین شکار کند، آن را با پایش می‌گیرد، زیرا دست ندارد و با بالش نمی‌تواند بگیرد، به همین دلیل رؤیا را به پایش آویزان کرد. پس آن آویزان است و عین پرنده است. پس چون تعبیر شود، سقوط می‌کند، به دلیل آنچه برایش گفته شده است. و هنگام سقوط، پرنده معدوم می‌شود، زیرا عین رؤیاست. پس با سقوط آن معدوم می‌شود و در عالم حس بر حسب حالی که آن رؤیا بر آن خارج می‌شود، صورت می‌پذیرد. پس صورت رؤیا عین آن حال می‌شود و نه غیر آن. و آن حال یا عرض است یا جوهر یا نسبتی از ولایت یا غیر آن، که عین صورت آن رؤیا و آن پرنده است. و این حالت از آن خلق شده است، خواه جسم باشد یا عرض یا نسبت، یعنی آن صورت، چنانکه آدم از خاک و ما از آبی ناچیز خلق شدیم. تا جایی که اگر رؤیا بر وجود فرزندی دلالت کند، آن فرزند از عین آن رؤیا، آبی در صلب پدرش خلق شده است. و اگر آب در رحم نازل شده باشد، آن رؤیا در آن به صورت فرزند تصویر می‌شود، پس او فرزند رؤیاست. و اگر رؤیایی برای او پیشی نگرفته باشد، بر اصل نشأت خود است، مانند سایر فرزندان. این را بدان، که رازی شگفت و کشفی صحیح است. و هر فرزندی که از رؤیایی که برای او دیده می‌شود، به وجود آید، بر دیگران تمایزی دارد و به ارواح نزدیک‌تر است، اگر این را در نظر بگیری. و هر مخلوقی از حالت یا عرض یا نسبتی از ولایت یا غیر آن که از رؤیا باشد، بر کسی که از رؤیا نیست، مزیتی دارد. و این را در رؤیای آمنه، مادر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) بنگر تا صحت آنچه ذکر کردیم، برایت آشکار شود. پس او (صَلَّى اللهُ عَليهِ وسَلَّم) عین رؤیای مادرش بود که در آب پدرش با آن صورتی که مادرش دیده بود، ظاهر شد. به همین دلیل، مرائی (رؤیاها) در مورد او (صَلَّى اللهُ عَليهِ وسَلَّم) زیاد شد و از دیگران متمایز گشت. و آنچه ما گفتیم را جز اهل علم به صورت کشف (الکشف) نمی‌دانند، و آن از اسرار خداوند در خلق اوست. و اگر برای آنچه ذکر کردیم، تأییدی می‌خواهی...\n\n### [رازی شگفت در علم طبیعت]\n\nپس در علم طبیعت بنگر که اگر زن حامله‌ای بر چیزی ویار کند، فرزند شبیه آن چیز خارج می‌شود. و اگر هنگام جماع بنگرد یا مرد هنگام نزدیکی و انزال آب، صورتی را تخیل کند، فرزند بر خلقت صورت آنچه تخیل شده، خواهد بود. به همین دلیل، حکما امر می‌کردند که صور فضلا از بزرگان حکما در مکان‌هایی تصویر شود، به طوری که زن و مرد هنگام جماع به آن صورت بنگرند، تا در خیال نقش بندد و در طبیعت تأثیر کند، و آن نیرویی که آن صورت بر آن بود، در فرزندی که از آن آب به وجود می‌آید، خارج شود. و این رازی شگفت در علم طبیعت است. و در تکوین عیسی (علیه السلام) بنگر که چگونه از مشاهده مریم، جبرئیل را در صورت بشر، جمع کرد بین روح بودن که مردگان را زنده می‌کند و بشر بودن، زیرا روح است که اجسام طبیعی به وسیله آن زنده می‌شوند. و قوی‌تر از آن، کاری است که سامری انجام داد، از گرفتن مشتی از اثر جبرئیل، هنگامی که دانست روح هر جا حلول کند، حیات همراه اوست. پس آنچه را که گرفته بود، در گوساله انداخت، و گوساله به واسطه آن اثر گرفته شده از جای پای روح، صدا کرد. و اگر آن را در شکل اسب می‌انداخت، شیهه می‌کشید، یا در شکل انسان، سخن می‌گفت. زیرا استعداد برای آنچه با حیات ظاهر شد، تنها برای پذیرنده بود. و از اینجا صورت ظاهر در مظاهر را می‌شناسی، و اینکه مظاهر با استعداد خود در آنچه در آن‌ها ظاهر می‌شود، آنچه را که با آن ظاهر می‌شود، از صور حامل و محمول، می‌دهند. و به همین دلیل خداوند این حکمت را آشکار ساخت تا از آن بر آنچه امر بر آن است، واقف شوی. سپس، نامیدن رؤیا توسط پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) به «بشری» و «مبشره» به دلیل تأثیر آن در پوست (بشره) انسان است. زیرا صورت بشری با آنچه در باطنش بر او وارد می‌شود، از صورتی که می‌بیند یا کلمه‌ای که می‌شنود، خواه با حزن یا فرح، تغییر می‌کند. و ناگزیر اثری از آن در بشره ظاهر می‌شود، زیرا این حکم طبیعی است که خداوند در طبیعت به ودیعه نهاده است و جز این نمی‌شود.\n\n(تکمله) رؤیا مکان، محل و حال دارد.\n\nحال آن، خواب است، که همان غیبت از محسوسات ظاهری است که موجب راحتی می‌شود، به دلیل خستگی‌ای که این نشأه در حالت بیداری از حرکت بر آن بوده است، حتی اگر در هوای نفسش باشد. خداوند متعال می‌فرماید: وَ جَعَلْنا نَوْمَكُمْ سُباتاً (و خواب شما را مایه آرامش قرار دادیم). می‌گوید: و خواب را برای شما راحتی قرار دادیم که نفوس با آن استراحت کنند. و آن بر دو بخش است: بخشی که انتقال است و در آن مقداری راحتی یا رسیدن به مقصود یا افزایش خستگی وجود دارد. و بخش دیگر، بخش راحتی خاص است، که همان خواب خالص و صحیح است که خداوند ذکر کرده که آن را راحتی قرار داده برای آنچه این آلات و جوارح و اعضای بدنی در حالت بیداری در آن خسته شده‌اند. و زمان آن را شب قرار داد، اگرچه در روز نیز واقع شود، چنانکه روز را برای معاش قرار داد، اگرچه در شب نیز واقع شود، اما حکم برای غالب است. اما بخش انتقال، همان خوابی است که رؤیا با آن همراه است. پس این آلات از حس ظاهر به باطن آن منتقل می‌شوند تا آنچه در خزانه‌ی خیال (الخيال) مقرر شده است را ببینند. خیالی که حواس، آنچه را از محسوسات گرفته‌اند، به آن بالا برده‌اند، و آنچه قوه مصوره که از خادمان این خزانه است، صورت داده است، تا این نفس ناطقه که خداوند مالک این شهر (بدن) قرار داده، آنچه در خزانه‌اش مستقر شده را ببیند، چنانکه عادت پادشاهان است که در اوقات خلوت خود وارد خزانه‌هایشان می‌شوند تا از آنچه در آن‌هاست مطلع شوند. و به اندازه‌ای که این نشأه از آلات (که همان جوارح هستند) و خادمان (که همان قوای حسی هستند) کامل شده باشد، ذخیره‌سازی صورت می‌گیرد. پس خزانه‌ای کامل برای کمال حیات وجود دارد و خزانه‌ای ناقص، مانند شخص کور مادرزاد، زیرا صور رنگ‌ها به خزانه‌ی خیال او منتقل نمی‌شود، و شخص لال، صور صداها و حروف لفظی به خزانه‌ی خیال او منتقل نمی‌شود. این همه در صورتی است که در اصل نشأت خود فاقد آن‌ها باشد. اما اگر این آفات بر او عارض شوند، چنین نیست. زیرا اگر با خواب به باطن نشأه منتقل شود و وارد خزانه گردد، صور رنگ‌هایی را که قبل از عارض شدن آفت در آن ذخیره کرده بود، می‌یابد. و همچنین هر آنچه را که نیرویی از قوای حس که جباة (جمع‌کنندگان مالیات) این مملکت هستند، به او داده است. و خداوند در این خزانه در صورتی طبیعی با صفات طبیعی تجلی (التجلی) می‌کند، مانند:\n\nقول او (صَلَّى اللهُ عَليهِ وسَلَّم): «رأيت ربي في صورة شاب» (پروردگارم را در صورت جوانی دیدم).\n\nو آن چیزی است که شخص خوابیده در خواب خود از معانی در صور محسوسات می‌بیند، زیرا حقیقت خیال (الخيال) این است که آنچه شأنش جسم بودن نیست را متجسد سازد. و این بدان سبب است که حضرت خیال این را می‌دهد. و در طبقات عالم، جز این حضرت خیالی، کسی نیست که امر را بر همان حالتی که هست، بدهد، زیرا این حضرت بین دو نقیض جمع می‌کند و حقایق در آن بر همان حالتی که هستند، ظاهر می‌شوند. زیرا حق (الحق) در امور این است که در هر امری که می‌بینی یا با هر نیرویی که ادراک می‌کنی، بگویی: آنچه درک کردی، اوست و او نیست، چنانکه فرمود: وَ ما رَمَيْتَ إِذْ رَمَيْتَ (و چون تیر انداختی، تو نیانداختی). پس در حالت رؤیا در صورتی که می‌بینی، شک نکن که عین همان چیزی است که به تو گفته شده اوست، و در تعبیر، وقتی بیدار شدی، شک نکن که او نیست. و در نظر صحیح شک نکن که امر، اوست و او نیست. از ابوسعید خراز پرسیدند: خدا را به چه شناختی؟ گفت: به جمع کردن بین دو ضد. پس هر عینی که متصف به وجود (الوجود) است، اوست و او نیست. پس عالم همه اوست و او نیست. و حق (الحق) که به صورت ظاهر شده، اوست و او نیست. پس او محدود است که حد ندارد، و مرئی است که دیده نمی‌شود. و این امر جز در این حضرت خیالی، در حالت خواب یا غیبت از محسوسات ظاهری به هر نوعی که باشد، ظاهر نشده است. و در خواب وجود آن کامل‌تر و عام‌تر است، زیرا برای عارفان و عامه است، در حالی که حال غیبت و فنا (الفناء) و محو و مانند آن، جز برای عامه در الهیات نیست. پس خداوند هیچ چیزی از کون را بر صورت امر بر همان حالتی که در نفس خود هست، نیافریده است، مگر این حضرت. پس حکم عام در دو طرف برای آن است، چنانکه برای ممکن، پذیرش دو نقیض است. و این برای او به صورت ذوق (تجربه) حاصل می‌شود. زیرا کسی که عدم بر او محال است، اگرچه علم به عدم دارد، اما علم او ذاتی نیست، و آن را «ذوق» نمی‌نامند. بر خلاف ممکن، که عدم برای او ذوق است. و کسی که وجود بر او محال است، علم به آن ندارد و اصلاً ذوقی در وجود ندارد. و ممکن در وجود ذوق دارد. پس خداوند این حضرت خیالی را آفرید تا امری که اصل است، در آن بر همان حالتی که هست، ظاهر شود.\n\n### [خواب، معبر است]\n\nپس بدان که ظاهر در مظاهر اعیان، همان وجود حق (الوجود الحق) است، و او آن چیزی نیست که به واسطه اشکال و نعوت (اوصاف) اعیان ممکنات ظاهر شده است. و این حضرت را مانند پلی بین دو ساحل قرار داد تا از این ساحل به آن ساحل عبور شود. پس خواب را «معبر» (محل عبور) قرار داد و راه رفتن بر آن را «عبور» نامید. خداوند متعال می‌فرماید: إِنْ كُنْتُمْ لِلرُّءْيا تَعْبُرُونَ (اگر شما تعبیر رؤیا می‌کنید). و درک آن را در حالتی قرار داد که «راحت» نامیده می‌شود، یعنی خواب، از حقیقت قول او: وَ لَقَدْ خَلَقْنَا السَّماواتِ وَ الْأَرْضَ وَ ما بَيْنَهُما فِي سِتَّةِ أَيَّامٍ (و به راستی آسمان‌ها و زمین و آنچه میان آن دو است را در شش روز آفریدیم). پس عمل را به خود نسبت داد و در خلقت ذکر کرد که با دو دست او و با دست‌ها و با دست اوست و با قول اوست. سپس به ما خبر داد که اگرچه به عمل متصف است، اما خستگی در او تأثیر نکرده است، و فرمود: وَ ما مَسَّنا مِنْ لُغُوبٍ (و هیچ خستگی به ما نرسید). و فرمود: وَ لَمْ يَعْيَ بِخَلْقِهِنَّ (و از آفرینش آن‌ها خسته نشد). پس از این حقیقت، اعمال عظیم و دشوار و خسته‌کننده در خواب که راحتی بدن است، ظاهر شد. یعنی طبیعت در این حال از حرکات حسی ظاهری آسوده است. پس این همان عمل عظیم در راحتی است، از آن جهت که شخص احساس نمی‌کند که در راحتی است، به ویژه اگر در خواب امور هولناک و ترسناک ببیند. پس چون بیدار شود، راحتی را می‌یابد و می‌داند که در راحتی بوده است، از آن جهت که احساس نمی‌کرده است. و برخی از آنان در خواب می‌دانند که در خواب هستند، و مردم در این باره بر طبقاتی هستند. و ما این حالت را «انتقال» نامیدیم، زیرا معانی از تجرید خود از مواد، به پوشیدن مواد منتقل می‌شوند، مانند ظهور حق (الحق) در صور اجسام و علم در صورت شیر و مانند آن. و انتقال دوم، انتقال حواس از محسوس ظاهر به این حضرت با محسوس ظاهر است، اما برای آن در این حضرت ثباتی است که در حضرت بیداری دارد. زیرا در این حضرت سریع‌التبدل است، چنانکه در بیداری در باطن خود به صور مختلف تبدیل می‌شود، نه در ظاهرش. پس باطن او در بیداری، همین حضرت است. و شب را لباس آن قرار داد، زیرا شب برای بیننده در نگاهش جز نفس خود را نمی‌دهد. پس درک می‌کند و با آن درک نمی‌شود، زیرا غیب و ظلمت است. و غیب و ظلمت درک می‌شوند و با آن‌ها درک نمی‌شود. و نور درک می‌کند و با آن درک می‌شود، و آن حال بیداری است. به همین دلیل رؤیا تعبیر می‌شود و آنچه حس درک کرده، تعبیر نمی‌شود. پس اگر انسان در درجات معرفت (المعرفة) بالا رود، می‌داند که در حال بیداری معهود، خوابیده است و امری که در آن است، رؤیاست، چه از روی ایمان و چه از روی کشف (الکشف). و به همین دلیل خداوند اموری را که در ظاهر حس واقع شده، ذکر کرد و فرمود: فَاعْتَبِرُوا (پس عبرت بگیرید). و فرمود: إِنَّ فِي ذلِكَ لَعِبْرَةً (به راستی در آن عبرتی است)، یعنی بگذرید و عبور کنید از آنچه از آن برای شما ظاهر شده است، به علم آنچه به واسطه آن پنهان شده و برای آن آمده است.\n\nپیامبر (علیه السلام) فرمود: «الناس نيام فإذا ماتوا انتبهوا» (مردم خوابند، پس چون بمیرند، بیدار می‌شوند).\n\nاما احساس نمی‌کنند، و به همین دلیل گفتیم از روی ایمان. و ما این مقام را به طور کامل در باب معرفت (المعرفة) این کتاب ذکر کرده‌ایم و پیش از این آمده است، که باب صد و هفتاد و هفتم است. پس وجود (الوجود) همه خواب است و بیداری آن نیز خواب است. پس وجود همه راحتی است و راحتی، رحمت است. پس وَسِعَتْ كُلَّ شَيْ‏ءٍ (همه چیز را فرا گرفته است). پس بازگشت به سوی آن است. فرشتگان به خداوند می‌گویند: وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً وَ عِلْماً (همه چیز را از نظر رحمت و علم فرا گرفته‌ای). و در اینجا رازی است که اگر در آن بحث کنی، به آن می‌رسی، و آن رحمت او به واسطه اسماء الحسنی در ظهور آثار آن‌هاست. پس نهایت علم او، نهایت رحمت اوست. سپس باز می‌گردم و می‌گویم: اگر در این راه خستگی حاصل شود، خستگی در راحتی است، مانند کارگری که خستگی را تحمل می‌کند یا از آن لذت می‌برد، به دلیل راحتی مزد که در نفس اوست و برای به دست آوردن آن کار می‌کند. پس وجود راحتی مزد، او را از خستگی محجوب می‌سازد. پس چون آن را بگیرد، شب هنگام وارد راحتی خواب می‌شود و جوارحش از حرکت باز می‌ایستند و راحتی را می‌یابد. پس از راحتی مزد به راحتی خواب منتقل می‌شود. پس بر تحقیق، صور عالم برای حق (الحق) از اسم باطن، صور رؤیا برای شخص خوابیده است، و تعبیر در آن‌ها این است که آن صور، احوال او هستند و نه غیر او، چنانکه صور رؤیا احوال بیننده است و نه غیر او. پس او جز نفس خود را ندیده است. و این همان قول اوست که: او آسمان‌ها و زمین و آنچه میان آن دو است را جز بِالْحَقِّ (به حق) نیافریده است، و آن عین اوست. و این همان قول او در حق عارفان است: وَ يَعْلَمُونَ أَنَّ الله هُوَ الْحَقُّ الْمُبِينُ (و می‌دانند که خداوند همان حق آشکار است). یعنی ظاهر. پس او واحد کثیر است. پس هر کس رؤیا را تعبیر کند، امری هولناک می‌بیند و برای او چیزی آشکار می‌شود که از غیر این وجه درک نمی‌کند. و به همین دلیل...\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) هرگاه صبح می‌کرد، از اصحابش می‌پرسید: «هل رأى أحد منكم رؤيا» (آیا کسی از شما رؤیایی دیده است؟).\n\nزیرا آن نبوت بود. پس دوست داشت آن را در امت خود مشاهده کند. و مردم امروز در نهایت جهل نسبت به این مرتبه هستند که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به آن اهمیت می‌داد و هر روز درباره آن می‌پرسید. و جاهلان در این زمان، اگر خبری را بشنوند که در خواب رخ داده است، به آن توجهی نمی‌کنند و می‌گویند: «این‌ها منامات است، این خیال است.» و رؤیا را سبک می‌شمارند اگر بیننده بر آن اعتماد کند. و این همه به دلیل جهل آن‌ها به مقام رؤیا و جهلشان به این است که او در بیداری و تصرفش در رؤیاست و در خوابش در رؤیایی در رؤیاست. پس او مانند کسی است که می‌بیند در خوابش بیدار شده، در حالی که در خواب است. و این همان قول او (علیه السلام) است: «الناس نيام» (مردم خوابند).\n\nچه شگفت‌انگیز است اخبار نبوی! حقایق را بر همان حالتی که هستند، آشکار ساخت و آنچه را که عقل قاصر سبک شمرده بود، بزرگ داشت. زیرا آن جز از عظیمی که همان حق (الحق) است، صادر نشده است. پس این معنای قول ما در تقسیم است که آن بخش انتقال است. اما بخش دیگر خواب، بخش راحتی است، و آن خوابی است که در آن رؤیایی دیده نمی‌شود. پس آن صرفاً برای راحتی بدنی است و نه غیر آن. پس این حال رؤیاست. و معرفت مکان و محل باقی ماند. اما محل، همین نشأه عنصری است. رؤیا محلی جز این ندارد. پس فرشته رؤیا ندارد، بلکه این مخصوص نشأه عنصری حیوانی است. و محل آن در علم الهی، استحالات در صور تجلی (التجلی) است. پس هر آنچه ما در آن هستیم، رؤیای حق (الحق) در راحتی رفع خستگی و تعب است و نه غیر آن. و اما مکان، آن زیر مقعر فلک قمر به طور خاص است. و در آخرت، زیر مقعر فلک کواکب ثابته است. و این بدان سبب است که خواب ممکن است در جهنم در اوقاتی رخ دهد، به ویژه در مورد مؤمنان اهل کبائر. و بالای فلک کواکب، خوابی نیست.\n\nو منظورم از آن، این خواب موجود و شناخته شده در عرف است. اما آنچه ما در ابتدا در معرفت حال خواب به آن پرداختیم، امری دیگر است که آن را بیان کردیم. و صورت مکان آن این‌گونه است: [اشاره به تصویر در حاشیه] این صورت مکان رؤیاست و شبیه شاخ است، که بالای آن پهن و پایین آن باریک است، و نشأت آن وارونه است. زیرا آنچه نزدیک سر است، بالاتر و پهن‌تر است، و آنچه باریک‌تر است، پایین‌تر است و از اصل دور شده است. پس آن شاخ، مکان رؤیاست. پس چون از این صور خارج شود، از مکان رؤیای معلوم در عرف خارج می‌شود و پس از آن رؤیایی نمی‌بیند، زیرا صفت خواب بر او قائم نمی‌شود. پس او در راحتی ابدی است. و این مقدار در آنچه از تعریف مقام رؤیا می‌خواهیم، کافی است. وَ اللهُ يَقُولُ الْحَقَّ وَ هُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند). و آنچه از آن سکوت کردیم، عظیم است، زیرا فکر اکثر مردم از تصور آن عاجز است، وَ لكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ (ولی بیشتر مردم نمی‌دانند)، چنانکه أَكْثَرَ النَّاسِ لا يُؤْمِنُونَ (بیشتر مردم ایمان نمی‌آورند). و فقه و عقل در قول او: لا يَفْقَهُونَ وَ لا يَعْقِلُونَ (نمی‌فهمند و تعقل نمی‌کنند)، به علم بازمی‌گردد. پایان جزء صد و هفدهم."
  },
  "page_count": 6
}