{
  "id": 290,
  "title": {
    "ar": "الباب التسعون ومائتان في معرفة منزل تقرير النعم من الحضرة الموسوية",
    "en": "Chapter Two Hundred and Ninety: Concerning the Gnosis of the Station of the Affirmation of Blessings from the Mosaic Presence (الحضرة الموسوية)",
    "ur": "باب دو سو نوے: موسوی حضور (الحضرة الموسوية) سے نعمتوں کے اقرار کی منزل کی معرفت (المعرفۃ) کا بیان",
    "fa": "باب دویست و نودم در معرفت منزل تثبیت نعمت‌ها از حضرت موسوی."
  },
  "content": {
    "ar": "## «الباب التسعون ومائتان في معرفة منزل تقرير النعم من الحضرة الموسوية»\n\n\n> بالقول نشرح ذات القول فاعتبروا *** في شرح ما هو في التحقيق مشروح‏\n\n\n> أن الأسامي للمعنى مفاتيح *** وفي العبارات تعديل وتجريح‏\n\n\n> لا يحصل الشوق للملقى إليه إذا *** ما لم يكن منك للإلقاء تلويح‏\n\n\n> فاكشف معارف أهل الله في حجب *** لا يحكمنك تبيين وتصريح‏\n\n\n> وأنطق بما تغتذي به النفوس ولا *** تنطق بما يغتذي بعلمه الروح‏\n\n\n> فالروح يكتم ما يلقى إليه كما *** تبدي النفوس الذي تجري به الريح‏\n\n\n> إن النفوس بما تهواه ناطقة *** والروح إن زل بالتصريح مجروح‏\n\n\n### [إبطال النعمة بالمن والأذى‏]\n\n\nاعلم أيدك الله وإيانا أن المنعم إذا أبطل نعمته بالمن والأذى لا يكون مشكورا عند الله على ذلك وإن شكره المنعم عليه لمعرفته بذله وفقره إليه فمن مكارم الأخلاق أن لا يمن المنعم بما أنعم به على المنعم عليه ولا سيما مع شكره على ذلك فإذا احتاج المنعم عليه لأمر وأظهر الذلة والافتقار إلى المنعم في طلب ذلك الأمر الذي مست الحاجة فيه إليه وذلك الأمر عند المنعم عليه في النعمة التي أنعم بها المنعم عليه فللمنعم عند ذلك أن يعرفه بما أنعم به عليه ويقرره على ذلك وأن الذي طلب منه موجود في نفس نعمته فلما ذا يفتقر في غيره موضع الافتقار حينئذ يجوز للمنعم أن يذكر للمنعم عليه نعمته عليه كرجل وهب رجلا ألف دينار إنعاما عليه ثم رآه يفتقر إلى ثوب يلبسه ومركب يركبه وأهل يأنس إليه وقد نسي أو جهل إن إرادة المنعم فيما أنعم به عليه إن ينال جميع ما سأله من تلك النعمة فللمنعم عند ذلك أن يعرفه بأن جميع ما تسألني فيه تصل إليه بما وهبتك إياه من المال فلما ذا تستعجل الذلة ففي مثل هذا الموطن يجب التقرير بالنعم على وجه التعليم والتنبيه لا على المن والأذى إلا إن من مكارم الأخلاق إذا قرره على ما أنعم به عليه إن لا يخيب سؤاله إما بعطاء في الوقت وإما بوعد فيبسطه بعد انقباضه لما حصل عنده من الخجل تخلقا إلهيا\n\n\n### [تقرير النعم‏]\n\n\nفاعلم إن هذا المنزل يتضمن تقرير النعم على ما ذكرت لك ويتضمن علم التشريح الذي تعرفه الأطباء من أهل الحكمة والتشريح الإلهي التي تتضمنه الصورة التي اختص بها هذا الشخص الإنساني من كونه مخلوقا على صورة العالم وعلى صورة الحق فعلم تشريحه من جانب العالم علمك بما فيه من حقائق الأكوان كلها علوها وسفلها طيبها وخبيثها نورها وظلمتها على التفصيل وقد تكلم في هذا العلم أبو حامد وغيره وبينه فهذا هو علم التشريح في طريقنا وأما علم التشريح الثاني فهو إن تعلم ما في هذه الصورة الإنسانية من الأسماء الإلهية والنسب الربانية ويعلم هذا من يعرف التخلق بالأسماء وما ينتجه التخلق بها من المعارف الإلهية وهذا أيضا قد تكلم فيه رجال الله في شرح أسماء الله كأبي حامد الغزالي وأبي الحكم عبد السلام بن برجان الإشبيلي وأبي بكر بن عبد الله المغافري وأبي القاسم القشيري ويتضمن هذا المنزل التكليف ورفعه من حيث ما فيه من المشقة لا من حيث ترك العمل‏\n\n\n### [إن الله أمرنا بالإيمان به وبرسله‏]\n\n\nفاعلم إن الله تعالى أمر عباده بالإيمان به وبما أنزل عليهم على أيدي رسله وجعل مع الايمان إلزاما من المعاني أمرهم الله تعالى أن يحملوها كلها في بواطنهم حملا معنويا وجعل محلها القلوب وعين أمورا عملية أنزلها على ظواهرهم وحملها جوارحهم مما فيه كلفة حسية من عمل الأيدي والأرجل ومما لا يعمل إلا بالأبدان كالصلاة والجهاد ومما لا كلفة فيه حسية كغض البصر عن المحرمات والنظر في الآيات ليؤدي ذلك النظر إلى الاعتبار وتنزيه السمع عن سماع الغيبة والإصغاء إلى الحديث الحسن فمثل هذا لا كلفة فيه حسية وإنما كلفته نفسية فإن فيها ترك الغرض‏\nوهو مما يشق على النفس وإذا أقيمت هذه الحضرة التي في هذا المنزل ممثلة في صور حسية يقام له توابيت على يمينه وتوابيت على يساره فالتوابيت التي على يمينه مملوءة درا وياقوتا وأحجارا نفيسة وحللا ومسكا وطيبا ومنها توابيت كبار وصغار وقيل له لا بد لك من حمل هذا إلى موضع معين إلى دار حسنة وروضة مورقة وقيل له إذا أوصلت هذه الأحمال إلى هذه الروضة كان أجرك عليها وعلى ما آلمك من ثقلها ما تحوي عليه هذه التوابيت كلها ولك هذه الدار التي وصلتها بجميع ما تحوي عليه من الملك وهي خمسة أنواع من التوابيت منها توابيت الأمر الواجب وتوابيت الأمر المندوب وتوابيت الأمر المبيح من حيث الايمان به وتوابيت النهي الواجب وتوابيت النهي المكروه ومن هذه التوابيت ما يختص بك ومنها توابيت تتعلق بغيرك وكلفت أنت حملها فكل خطاب شرعي يختص بذاتك لا تتعدى بالعمل فيه إلى غيرك فهو المختص بك وكل خطاب شرعي يختص بذاتك وتتعدى في العمل به إلى غيرك فذلك الذي يتعلق بغيرك وكلفت أنت حمله كالسعي على العيال وتعليم الجاهل وإرشاد الضال والنصيحة لله ولرسوله ولأئمة المسلمين وعامتهم فهذه توابيت أصحاب اليمين فكما حملت ما هو لك ولغيرك في الدنيا كان لك أجرك وأجر غيرك في الآخرة ولا ينقص الغير من أجره شيئا إن كان مؤمنا وإن لم يكن مؤمنا مثل التكليف الذي يتعلق بك في معاملة أهل الذمة فلك أجرهم لو كانوا مؤمنين ولا أجر لهم ولهذا قيد النبي صلى الله عليه وسلم هذا الأمر بالعمل‏\n\n\nفقال من سن سنة حسنة فله أجرها وأجر من عمل بها إلى يوم القيامة\n\n\nفالمؤمن لا ينقصه من أجره الأخروي شي‏ء والذمي يعطى أجره في الدنيا إما بمنفعة معجلة أو دفع مضرة معجلة يكون ذلك لهذا العامل في الآخرة محققا وقد يجمع له بين الدنيا والآخرة فيرى العامل ما تحمل تلك التوابيت من الأشياء النفيسة ومالها وقد حصل له البشرى بأنها له ملك إذا حملها بحيث يفنى في حبها والتعشق بها فيهون عليه حملها ويخف لحمل الهمة إياها فلا يجد فيها مشقة وهو حال تلذذه بالأذى وبما يحسن لأهل الذمة وآخر ينظر إلى ثقلها وهو المؤمن الذي لا كشف عنده إلا مجرد تصديق الخبر فيجدها ثقيلة المحمل فمنهم من يحملها بمشقة وكلفة لغلبة التصديق بما فيها وللحرص الشديد والطمع في أخذها وملكها لكون الآمر يحملها قال له هي لك في أجر حملك ومنهم من ثقلت عليه فأخرج منها جملة طرحها في الأرض ليخف عنه الثقل الذي يجده فلما خف حمله ببعض ما طرح منها حمل ما بقي وكلما طرحه من ذلك عاد ذلك المطروح حديدا ورصاصا ونحاسا وزيد في التوابيت التي على شماله والتوابيت التي أقيمت له على شماله كلها مملوءة حديدا ونحاسا وقطرانا وآنكا وشبه ذلك مما يثقل وتكره رائحته وقيل له هذه التوابيت يحملها على ظهرك على ترتيب ما قررناه في توابيت اليمين وتوصلها إلى دار ذات لهب وزمهرير وما تحوي عليه هذه التوابيت ملكك وهذا قوله تعالى ولَيَحْمِلُنَّ أَثْقالَهُمْ وأَثْقالًا مَعَ أَثْقالِهِمْ وقوله صلى الله عليه وسلم من سن سنة سيئة فله وزرها ووزر من عمل بها إلى يوم القيامة\n\n\nوإن لم يحضر للمكاشف في هذا المنزل صورا نزلت على قلبه معاني مجردة عن المواد وعرف تفاصيلها والحق كل شي‏ء منها بمقامه ومحله ولم يجد لذلك كلفة ولا مشقة لأنه لا غرض له مع إرادة سيده منه فهو في عالم الانفساح والانشراح وإن ضعفت أجسامهم عن حمل بعض ما كلفوه فقد أمر أن لا يحمل إلا وسع نفسه النفس هنا عبارة عن إكمال الحس لأن النفس المعنوية لا كلفة عليها إلا إذا كانت صاحبة غرض فكلفت بما لا غرض لها فيه فلهذا لم يعذر الإنسان من حيث نفسه ويعذر من حيث حسه لخروج ذلك عن طاقته في المعهود ويتعلق بهذا المنزل طرف من العلم بنش‏ء الملائكة وإنهم من عالم الطبيعة مخلوقون مثل الأناسي غير إنهم ألطف كما إن الجن ألطف من الإنسان مع كونهم من نار من مارجها والنار من عالم الطبيعة ومع هذا فهم روحانيون يتشكلون ويتمثلون فلو كانت الطبيعة لا تقبل ذلك لما قبله عالم الجن وكيف ينكر ذلك ومعلوم قطعا إن الإنسان من عالم الطبيعة الكثيفة وفيه منها خزانة الخيال في مقدم دماغه يتخيل بها ما شاء من المحالات فكيف من الممكنات فكذلك الملائكة عليهم السلام من عالم الطبيعة وهم عمار الأفلاك والسموات وقد عرفك الله أنه اسْتَوى‏ إِلَى السَّماءِ وهِيَ دُخانٌ فَسَوَّاهُنَّ سَبْعَ سَماواتٍ وجعل أهلها منها وهو قوله وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها ولا خلاف إن الدخان من الطبيعة وإن كانت الملائكة أجساما نورية كما إن الجن أجسام نارية ولو لم يكن النور طبيعيا لما وصف بالإحراق كما توصف النار بالتجفيف والذهاب بالرطوبات وهذا كله‏\nمن صفات الطبيعة ثم إن الله قد أخبر عن الملإ الأعلى أنهم يختصمون والخصام من الطبيعة لأنها مجموع أضداد والمنازعة والمخالفة هي عين الخصام ولا يكون إلا بين الضدين ومن هذا الباب قولهم أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها ويَسْفِكُ الدِّماءَ هذا من طبيعتهم وغيرتهم على الجناب الإلهي فلو وقفوا مع روحانيتهم لم يقولوا مثل هذا حين قال لهم الله إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً بل كان جوابهم من حيث ما فيهم من السر الإلهي أن يقولوا ذلك إليك سبحانك تفعل ما تريد ونحن العبيد تحت أمرك بالطاعة لمن أمرتنا بطاعته فبالذي وقع من الإنسان من الفساد وغيره مما يقتضيه عالم الطبع به بعينه وقع الاعتراض من الملائكة فرأوه في غيرهم ولم يروه في نفوسهم وذلك لما قررناه من أن التعشق بالغرض يحول بين صاحبه وبين فعل ما ينبغي له أن يفعله ولهذا قال لهم الله تعالى إِنِّي أَعْلَمُ ما لا تَعْلَمُونَ ثم أراهم الله شرفه عليهم بما خصه به من علم الأسماء الإلهية التي خلق المشار إليهم بها وجهلتها الملائكة فكأنه يقول سبحانه أجعل علمي حيث شئت من خلقي أكرمه بذلك فمن هنا تعلم ما ذكرناه وسيأتي العلم بهذا الأمر محققا مستوفى في منزله الخاص به فإن علوم هذه المنازل على قسمين منها علوم مختصة بالمنزل لا توجد في غيره ومنها علوم يكون منها في كل منزل طرف‏\n\n\n### [القلب محل السعة الإلهية]\n\n\nواعلم أن القلب وإن كان محل السعة الإلهية فإن الصدر محل السعة القلبية إذ كان إنما سمي صدرا لصدوره ولهذا قال ولكِنْ تَعْمَى الْقُلُوبُ الَّتِي في الصُّدُورِ فإن القلب في حال الورود يضيق لما يقتضيه من الجلال والهيبة وما يعطيه القرب الإلهي والتجلي وإذا صدر اتسع وانفسح لأنه كون وهو صادر إلى الكون فينفسح للمناسبة وتتسع أشعة نوره بانبساطها على الأكوان ويبتهج بكونه خص بهذا التعريف الإلهي على أبناء جنسه ولهذا إذا عرض له عارض يقبضه في غير محل القبض ينبهه الحق يذكره ما أنعم الله به عليه ليتذكر النعمة الإلهية عليه فيحول بينه وبين ما كان عليه من الضيق فهو في الظاهر من إلهي وفي المعنى رحمة بهذا القلب فمن هنا يقرر الحق عبده على ما متن به عليه فإن قلت فإن الله قد ذكر أنه يمن على عباده قلنا إنما جاء هذا لما امتنوا على رسول الله صلى الله عليه وسلم بإسلامهم فقال الله له قل لهم يا محمد بَلِ الله يَمُنُّ عَلَيْكُمْ أَنْ هَداكُمْ لِلْإِيمانِ أي إذا دخلتم في حضرة المن فالمن لله لا لكم فهو من علم التطابق لم يقصد به المن فما كان الله ليقول في المن ما قال ويكون منه كما\n\n\nقال صلى الله عليه وسلم ما كان الله لينهاكم عن الربا ويأخذه منكم‏\n\n\nوما كان الله ليدلكم على مكارم الأخلاق من العفو والصفح ويفعل معكم خلافه فإذا وقع منكم من سفساف الأخلاق ما وقع رد الحق سبحانه أعمالكم عليكم لا أنه عاملكم بها من نفسه وإنما أعمالكم لم تتعداكم فلله المنة التي هي النعمة والامتنان الذي هو إعطاء المنة لا المن سبحانه وتعالى وإذا أراد الله تعالى رفعة عبده عند خلقه ذكر لعباده منزلته عنده إما بالتعريف وإما بأن يظهر على يده وفي حاله ما لا يمكن أن يكون إلا للمقرب من عباده فتنطلق له الألسنة وتنطق بعلو مرتبته عند سيده مثل فتحه صلى الله عليه وسلم باب الشفاعة يوم القيامة الذي اختص به على سائر الرسل والأنبياء فيعلو مناره في ذلك الموطن على كل أحد وهنالك تطلب الرئاسة والعلو وأما في الدنيا فلا يبالي العارف كيف أصبح ولا أمسى عند الناس لأنهم في محل الحجاب وهو في موطن التكليف فكل إنسان مشغول بنفسه مطلوب بأداء ما كلف به من العمل ومما يتضمن هذا المنزل علم التنكير وهو التجلي العام وعلم التعريف وهو التجلي الخاص وهو مندرج في العام كالاسم الرب إذا تجلى فيه الحق لعباده فإنه تجل عام وإذا تجلى في مثل قوله فَوَ رَبِّكَ فهو تجل خاص وإن كانت التجليات من الربوبية ولكن بينهما تباين فإن الحال التي لك مع الملك في مجلس العامة ليس هو الحال التي لك معه إذا انفردت به فلهذا مقام وعلم خاص ولهذا مقام وعلم خاص والتجلي العام أكثر علما وأنفع والتجلي الخاص أعظم قربة\n\n\n### [المعرفة أصل الأمور كلها]\n\n\nواعلم أن أصل الأمور كلها المعرفة عندنا والنكرة عرض طارئ فإذا عرض وقع الإبهام والإشكال فالعارف من عرفه في حال التنكير فهو نكرة في العموم وعند هذا هو معرفة في النكرة إذا قال القائل كلمت اليوم رجلا فرجل هنا نكرة وهو عند من كلمه معرفة بالتعيين في حال الحكم عليه بالنكرة فالذي يشاهد العارف من الحق في حال النكرة والإنكار من العالم هو عين المعرفة عنده لكونه أبقاه على الإطلاق الذي يستحقه في حال تقيده به العقائد فيجهله العامة في التنكير وهو مقام‏\nعظيم الفائدة للعارفين‏\n\n\n### [عدم التمكن العارف أن يسأل من الحق تعالى‏]\n\n\nواعلم أن العارف في هذا المنزل لا يتمكن له أن يسأل الحق في أمر إلا من الوجه الأخص لا من الوجه الأعم ولا يصح له سؤال الحق في أمر هو فيه لأنه شغل عما يستحقه ذلك الأمر من الأدب فإذا وفاه حقه حسا كان مما يتعلق بالعبادات البدنية أو معنى كان مما يتعلق بالعبادات القلبية وأراد الحق أن ينقله من تلك العبادة لم يعرف العارف مراد الحق فيه لأي مرتبة ينقله هل ينقله إلى واجب آخر أو مندوب أو مباح أو مكروه أو محظور فيبقى واقفا بين المقام الذي فرغ منه وبين الأمر الذي إليه في علم الله ينتقل فعند ذلك يأتيه رسول من الله مظهر في سره يقول له إن الله قد أمرك أن تتضرع إليه وترغبه وتسأله في هذا الأمر الذي ينقلك إليه إن كانت بقيت لك حياة فليكن من الواجبات وهو المراد فإن لم يكن فمن المندوبات فإن لم تسبق العناية بالإجابة فمن المباحات فإن لم يكن ورأيت لوائح تبرق إليك من خلف حجاب الخذلان وتعلم أنك تنتقل إلى محظور أو مكروه فاسأل من الله الحضور معه في ذلك الأمر الذي تنتقل إليه وأسأله أن يجعل فيك من الكراهة لذلك الأمر ولا يحول بينك وبين معرفتك بأنه شي‏ء يسوءك فعله وأن العلم الإلهي لا يتبدل فيك بوقوعه منك حتى أنه إذا وقع منك وأنت على هذه الحالة لم يبق حكم للمعصية فيك جملة وكان الحكم في ذلك للقدر فإذا توجهت العقوبة على من هذه حالته لما تطلبه المخالفة من وجه من وجوهها توجه العفو والغفور والرحيم وهم الأسماء التي تطلبها المخالفة ويعتضدون بالأسماء التي تطلبها الكراهة التي كانت فيك لذلك الفعل والايمان بالقدر السابق فيها ويد الله مع الجماعة فتكون الغلبة والحكم لهؤلاء الأسماء التي تعطيه السعادة والخير مع وقوع المعصية وتكون معصيته بحضوره فيها مع الله حية ذات روح إلهي يستغفر له إلى يوم القيامة ويبدل الله سيئها حسنا كما بدل عقوبتها مثوبة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Ninety: On the Knowledge of the Station of Affirming Blessings from the Mosaic Presence.\n\nWe explain the Essence of the saying through the saying, so reflect\nIn the explanation of that which is already explained in verification.\n\nFor the Names (الأسامي) are keys to the meaning,\nAnd in expressions there is adjustment and injury.\n\nLonging will not arise for the one to whom the message is cast\nUnless there is a hint from you regarding the casting.\n\nSo unveil the gnosis (معارف) of the People of Allah (أهل الله) within veils,\nLet no clarification or explicit statement govern you.\n\nAnd speak that by which the souls (النفوس) are nourished,\nBut do not speak that by which the spirit (الروح) is nourished through its knowledge.\n\nFor the spirit conceals what is cast upon it, just as\nThe souls reveal that which the wind carries.\n\nIndeed, the souls speak of what they desire,\nBut the spirit, if it errs by explicit statement, is wounded.\n\n### [Invalidating the Blessing through Obligation and Injury]\n\nKnow—may Allah support us and you—that if the Bestower (المنعم) invalidates His blessing by reminding the recipient of the favor (المن) or causing injury (الأذى), He is not thanked by Allah for that, even if the recipient (المنعم عليه) thanks Him due to the recipient’s knowledge of his own lowliness and need for Him. It is among the noble ethics that the Bestower should not remind the recipient of the favor bestowed, especially when the recipient is already grateful for it.\n\nHowever, if the recipient is in need of something and expresses humility and destitution to the Bestower in seeking that matter—which the recipient believes is contained within the blessing already granted by the Bestower—then the Bestower is entitled to inform him of what was bestowed and affirm it (يقرره على ذلك), clarifying that what he seeks is already present within the blessing itself. Why, then, does he express need in a place other than the point of need?\n\nIn this instance, it is permissible for the Bestower to remind the recipient of the blessing bestowed upon him. This is like a man who gifted another a thousand dinars as a favor, and then saw him expressing need for a garment to wear, a mount to ride, or a family to keep company with, having forgotten or being ignorant that the Bestower’s intention in granting the blessing was that the recipient should obtain all that he asked for from that very blessing.\n\nThe Bestower is then entitled to inform him that everything he is asking for can be attained through the wealth already gifted to him. Why does he hasten to display humility? In such a situation, the affirmation of blessings (التقرير بالنعم) is necessary, serving as instruction (التعليم) and notification (التنبيه), not as obligation or injury. Nevertheless, it is among the noble ethics that, even when affirming the blessing, the Bestower should not disappoint the recipient’s request, either by giving immediately or by promising a future gift, thereby expanding his state after the contraction caused by the shame he felt, in imitation of the Divine ethics (تخلقا إلهيا).\n\n### [Affirming Blessings]\n\nKnow that this Station (المنزل) encompasses the affirmation of blessings, as I have mentioned to you, and it encompasses the science of anatomy (علم التشريح) known to physicians among the people of wisdom, as well as the Divine Anatomy (التشريح الإلهي) contained within the form specific to this human individual (الشخص الإنساني)—namely, his creation upon the image of the Cosmos (العالم) and the image of The Real (الحق).\n\nThe knowledge of his anatomy from the side of the Cosmos is your knowledge of all the realities of the existent things (الأكوان) within him, both high and low, good and corrupt, light and darkness, in detail. Abu Hamid [al-Ghazali] and others have spoken on this science and clarified it. This is the science of anatomy in our path.\n\nAs for the second science of anatomy, it is that you know the Divine Names (الأسماء الإلهية) and the Lordly Relations (النسب الربانية) contained within this human form. This is known by whoever understands ethical transformation through the Names (التخلق بالأسماء) and the Divine Gnosis (المعارف الإلهية) produced by that transformation. This, too, has been discussed by the men of Allah in their explanations of the Names of Allah, such as Abu Hamid al-Ghazali, Abu al-Hakam Abd al-Salam ibn Barjān al-Ishbīlī, Abu Bakr ibn Abd Allah al-Maghāfirī, and Abu al-Qasim al-Qushayrī.\n\nThis Station also encompasses the Divine Mandate (التكليف) and its removal, specifically in terms of the difficulty (المشقة) involved, not in terms of abandoning the action.\n\n### [Indeed, Allah Commanded Us to Believe in Him and His Messengers]\n\nKnow that Allah the Exalted commanded His servants to believe in Him and in what He revealed to them through His Messengers. Along with belief, He imposed certain conceptual burdens (المعاني) which He commanded them to carry conceptually within their inner beings (بواطنهم), making the hearts (القلوب) their locus. He also specified practical matters (أمورا عملية) which He imposed upon their outer beings (ظواهرهم) and which their limbs carry, including those involving physical difficulty, such as the acts of the hands and feet, and those performed only by the bodies, such as prayer (الصلاة) and struggle (الجهاد).\n\nAnd there are those that involve no physical difficulty, such as lowering the gaze from forbidden things and reflecting upon the signs (الآيات) so that such reflection leads to consideration (الاعتبار), and purifying the hearing from listening to backbiting and inclining to good speech. Such acts involve no physical difficulty; rather, their difficulty is psychological (نفسية), for they involve abandoning self-interest (ترك الغرض), which is difficult for the soul.\n\nIf this Presence (الحضرة) contained within this Station were to be represented in sensory images, coffins (توابيت) would be set up for him on his right and coffins on his left. The coffins on his right would be filled with pearls, rubies, precious stones, fine garments, musk, and perfume. Among them would be large and small coffins. He would be told: \"You must carry this to a specific place, to a beautiful house and a verdant garden.\" He would be told: \"If you deliver these loads to this garden, your reward for them and for the pain caused by their weight will be all that these coffins contain, and this house you have reached, with all the dominion it holds.\"\n\nThese coffins are of five types: coffins of the Obligatory Command (الأمر الواجب), coffins of the Recommended Command (الأمر المندوب), coffins of the Permissible Command (from the perspective of belief in it), coffins of the Obligatory Prohibition (النهي الواجب), and coffins of the Disliked Prohibition (النهي المكروه). Some of these coffins pertain specifically to you, and some pertain to others, but you are mandated to carry them.\n\nEvery legal address (خطاب شرعي) specific to your own person, where the action does not extend to others, is specific to you. Every legal address specific to your own person, where the action extends to others, is that which relates to others and which you are mandated to carry, such as providing for one’s dependents, teaching the ignorant, guiding the misguided, and offering sincere advice to Allah, His Messenger, the leaders of the Muslims, and their common folk. These are the coffins of the Companions of the Right Hand (أصحاب اليمين). Just as you carried what was for you and for others in this world, you will have your reward and the reward of others in the Hereafter, and the other person’s reward will not be diminished at all if he is a believer. If he is not a believer—such as the mandate related to your dealings with the People of the Covenant (أهل الذمة)—you receive their reward had they been believers, but they receive no reward.\n\nFor this reason, the Prophet, peace and blessings be upon him, qualified this matter with action, saying:\n«مَنْ سَنَّ سُنَّةً حَسَنَةً فَلَهُ أَجْرُهَا وَأَجْرُ مَنْ عَمِلَ بِهَا إِلَى يَوْمِ الْقِيَامَةِ» (Whoever establishes a good precedent will have its reward and the reward of whoever acts upon it until the Day of Resurrection.)\n\nThe believer’s reward in the Hereafter is not diminished at all, while the person of the covenant (الذمي) is given his reward in this world, either through an immediate benefit or the warding off of an immediate harm, which is realized for the worker in the Hereafter. Sometimes, both this world and the Hereafter are combined for him.\n\nThe worker sees the precious things and the wealth contained in those coffins, and he has received the good news that they will be his possession if he carries them. He becomes annihilated in the love and passion for them (يفنى في حبها), making the burden easy for him. It becomes light due to the high spiritual resolve (الهمة) carrying it, and he finds no difficulty in it. This is the state of finding pleasure in the pain and in the good deeds done for the People of the Covenant.\n\nAnother person looks at the weight—this is the believer who has no unveiling (كشف) but merely the confirmation of the report (تصديق الخبر)—and finds the load heavy. Some carry it with difficulty and effort due to the overwhelming confirmation of what is inside and the intense eagerness and desire to take and possess it, because the Commander who mandated the carrying told him: \"It is yours as the reward for your carrying.\"\n\nOthers find it too heavy, so they take out a portion and throw it on the ground to lighten the weight they feel. When his load is lightened by some of what he discarded, he carries what remains. Everything he discarded returns as iron, lead, and copper, and is added to the coffins on his left.\n\nThe coffins set up for him on his left are all filled with iron, copper, tar, tin, and similar things that are heavy and have a repulsive odor. He is told: \"You must carry these coffins on your back, arranged according to the order we established for the coffins of the Right Hand, and deliver them to a house of flame and extreme cold (زمهرير). All that these coffins contain is your possession.\" This is the meaning of the Exalted’s saying: <<وَلَيَحْمِلُنَّ أَثْقَالَهُمْ وَأَثْقَالًا مَعَ أَثْقَالِهِمْ>> (And they will surely carry their own burdens and other burdens along with their own burdens), and the Prophet’s saying, peace and blessings be upon him:\n«مَنْ سَنَّ سُنَّةً سَيِّئَةً فَلَهُ وِزْرُهَا وَوِزْرُ مَنْ عَمِلَ بِهَا إِلَى يَوْمِ الْقِيَامَةِ» (Whoever establishes a bad precedent will have its burden and the burden of whoever acts upon it until the Day of Resurrection.)\n\nIf the Gnostic (المكاشف) in this Station does not experience sensory images, meanings (معاني) descend upon his heart, stripped of material forms. He knows their details and attaches everything to its proper station and place, finding no difficulty or hardship in it, because he has no self-interest (غرض) apart from his Master’s will. He is in the world of expansion (الانفساح) and relief (الانشراح).\n\nEven if their bodies weaken from carrying some of what they are mandated, they are commanded only to carry what their soul (النفس) can bear. The soul here refers to the completion of the senses (إكمال الحس), because the spiritual soul (النفس المعنوية) has no difficulty unless it possesses self-interest, and is mandated with something in which it has no interest. For this reason, man is not excused regarding his soul, but he is excused regarding his senses, as that may exceed his capacity according to common experience.\n\nThis Station also relates to a part of the knowledge concerning the origin of the Angels (الملائكة), and that they are created from the world of Nature (عالم الطبيعة) like human beings, except that they are subtler, just as the Jinn are subtler than humans, despite being created from smokeless fire (مَارِجِهَا), and fire is from the world of Nature. Despite this, they are spiritual beings (روحانيون) who can take shape and form (يتشكلون ويتمثلون). If Nature did not accept this, the world of the Jinn would not accept it. How can this be denied when it is certainly known that man is from the dense world of Nature, and he possesses within it the treasury of Imagination (الخيال) in the front of his brain, by which he can imagine whatever impossibilities he wishes, let alone possibilities?\n\nSimilarly, the Angels, peace be upon them, are from the world of Nature, and they are the inhabitants of the spheres and the heavens. Allah informed you that He <<اسْتَوَى إِلَى السَّمَاءِ وَهِيَ دُخَانٌ فَسَوَّاهُنَّ سَبْعَ سَمَاوَاتٍ>> (turned to the heaven while it was smoke, and fashioned them into seven heavens), and He made their inhabitants from it, which is His saying: <<وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (and inspired in each heaven its command). There is no disagreement that smoke is from Nature, even if the Angels are luminous bodies (أجساما نورية), just as the Jinn are fiery bodies. If light were not natural, it would not be described by burning, just as fire is described by drying and removing moisture. All of this is from the attributes of Nature.\n\nFurthermore, Allah informed us that the Highest Assembly (الملأ الأعلى) dispute (يختصمون), and disputation is from Nature, because Nature is a collection of opposites (مجموع أضداد), and contention and opposition are the very essence of disputation, which only occurs between opposites. From this category is their saying: <<أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ الدِّمَاءَ>> (Will You place upon it one who causes corruption therein and sheds blood?). This arose from their nature and their jealousy for the Divine Presence (الجناب الإلهي). Had they remained solely with their spirituality (روحانيتهم), they would not have said this when Allah told them: <<إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً>> (Indeed, I am going to place a vicegerent on the earth). Rather, their answer, based on the Divine Secret (السر الإلهي) within them, should have been: \"That is up to You, glory be to You. You do what You will, and we are servants under Your command, obedient to whomever You command us to obey.\"\n\nThus, the objection of the Angels occurred precisely because of the corruption and other things that the world of Nature necessitates, which occurred from man. They saw it in others but did not see it in themselves. This is due to what we established: that attachment to self-interest (التعشق بالغرض) prevents its possessor from doing what he ought to do. For this reason, Allah the Exalted said to them: <<إِنِّي أَعْلَمُ مَا لَا تَعْلَمُونَ>> (Indeed, I know that which you do not know). Then Allah showed them His honor over them by granting Adam the exclusive knowledge of the Divine Names (علم الأسماء الإلهية) by which the referred-to beings were created, and which the Angels were ignorant of. It is as if He, glory be to Him, was saying: \"I place My knowledge wherever I will among My creation, thereby honoring him.\" From this, you understand what we have mentioned. The knowledge of this matter will come fully verified and exhaustive in its own specific Station, for the sciences of these Stations are of two types: sciences specific to the Station that are not found elsewhere, and sciences of which a portion is found in every Station.\n\n### [The Heart is the Locus of Divine Expansion]\n\nKnow that although the Heart (القلب) is the locus of Divine Expansion (السعة الإلهية), the Breast/Chest (الصدر) is the locus of the heart’s expansion (السعة القلبية), since it was named *ṣadr* (breast) because of the heart’s issuing forth (لصدوره). For this reason, He said: <<وَلَكِن تَعْمَى الْقُلُوبُ الَّتِي فِي الصُّدُورِ>> (But the hearts which are in the breasts are blinded).\n\nWhen the Divine Influx (الورود) occurs, the heart contracts (يضيق) due to the Majesty (الجلال) and Awe (الهيبة) it necessitates, and what Divine Proximity and Theophany (التجلي) bestow. When it issues forth (صدر), it expands and opens up (اتسع وانفسح), because it is a cosmos (كون) issuing forth into the cosmos, so it expands due to suitability (المناسبة). The rays of its light expand by spreading over the existent things (الأكوان), and it rejoices in being singled out for this Divine definition (التعريف الإلهي) over its peers.\n\nFor this reason, if an obstacle occurs that causes it to contract in an inappropriate place of contraction, The Real (الحق) alerts it by reminding it of what Allah has bestowed upon it, so that it recalls the Divine blessing (النعمة الإلهية) upon it, thereby preventing the state of constriction it was in. This is outwardly an act of Divine affirmation (إلهي), but in meaning, it is mercy upon this heart. From this perspective, The Real affirms His servant regarding what He has bestowed upon him.\n\nIf you say that Allah has mentioned that He confers favor (يمن) upon His servants, we reply that this only occurred when they claimed favor upon the Messenger of Allah, peace and blessings be upon him, by their acceptance of Islam. So Allah said to him: Say to them, O Muhammad, <<بَلِ اللَّهُ يَمُنُّ عَلَيْكُمْ أَنْ هَدَاكُمْ لِلْإِيمَانِ>> (Rather, Allah confers favor upon you that He has guided you to the faith). That is, if you enter the Presence of Obligation (حضرة المن), the favor belongs to Allah, not to you. This is from the science of correspondence (علم التطابق); it was not intended as an act of obligation (المن).\n\nAllah would not say concerning obligation what He said, and then act upon it Himself, just as the Prophet, peace and blessings be upon him, said:\n«مَا كَانَ اللَّهُ لِيَنْهَاكُمْ عَنِ الرِّبَا وَيَأْخُذَهُ مِنْكُمْ» (Allah would not forbid you from usury and then take it from you.)\n\nNor would Allah guide you to noble ethics, such as pardon and forgiveness, and then act contrary to them with you. If lowly ethics (سفساف الأخلاق) occur from you, The Real, glory be to Him, returns your deeds back to you; it is not that He deals with you based on them from His Essence (من نفسه). Rather, your deeds do not extend beyond you. To Allah belongs the favor (المنة), which is the blessing (النعمة), and the conferring of favor (الامتنان), which is the giving of the favor, not the obligation (المن), glory and exaltedness be to Him.\n\nWhen Allah wills the elevation of His servant among His creation, He mentions the servant’s station with Him to His servants, either through direct knowledge (التعريف) or by manifesting through his hand and in his state that which can only belong to His closest servants (المقرب). Then tongues are loosened for him and speak of the loftiness of his rank with his Master, such as the Prophet’s opening of the door of intercession (الشفاعة) on the Day of Resurrection, which is exclusive to him among all Messengers and Prophets. His beacon rises in that station above everyone else. It is there that leadership and elevation are sought. As for this world, the Gnostic (العارف) does not care how he fares among people, because they are in the place of veiling (الحجاب) while he is in the station of the Divine Mandate. Every person is preoccupied with himself, required to fulfill the work he is mandated to perform.\n\nAmong what this Station encompasses is the science of Indefiniteness (علم التنكير), which is the General Theophany (التجلي العام), and the science of Definiteness (علم التعريف), which is the Specific Theophany (التجلي الخاص). The specific is subsumed within the general, such as when the Name *al-Rabb* (The Lord) discloses itself to His servants—that is a general Theophany. But when it discloses itself in a phrase like <<فَوَرَبِّكَ>> (By your Lord), it is a specific Theophany. Although all Theophanies stem from Lordship (الربوبية), there is a distinction between them. The state you have with the king in a public assembly is not the same as the state you have with him when you are alone with him. Thus, the former has a specific station and knowledge, and the latter has a specific station and knowledge. The General Theophany contains more knowledge and benefit, while the Specific Theophany grants greater proximity.\n\n### [Gnosis is the Origin of All Matters]\n\nKnow that the origin of all matters, according to us, is Gnosis (المعرفة), and Indefiniteness (النكرة) is an accidental occurrence (عرض طارئ). When it occurs, ambiguity and confusion arise. The Gnostic (العارف) is the one who knows The Real (الحق) even in the state of indefiniteness. Thus, it is indefinite in generality, but in this context, it is definite within the indefiniteness. When someone says, \"I spoke to a man (رجل) today,\" *rajul* (man) is indefinite here, but to the one who spoke to him, he is definite by designation, even while being judged as indefinite.\n\nWhat the Gnostic witnesses of The Real in the state of indefiniteness and denial (الإنكار) from the Cosmos is, for him, the very essence of Gnosis, because it preserves The Real upon the Absolute (الإطلاق) state that He deserves, even while creeds (العقائد) restrict Him. Thus, the common people are ignorant of Him in the state of indefiniteness, but this is a station of immense benefit for the Gnostics.\n\n### [The Gnostic’s Inability to Ask The Real]\n\nKnow that the Gnostic (العارف) in this Station is unable to ask The Real for anything except from the most specific aspect (الوجه الأخص), not the general aspect. It is not proper for him to ask The Real for something he is currently engaged in, because that distracts him from the spiritual etiquette (الأدب) that the matter requires.\n\nIf he fulfills its due—whether physically, related to bodily worship, or conceptually, related to spiritual worship—and The Real wishes to move him from that worship, the Gnostic does not know The Real’s intention regarding which level He is moving him to: whether to another obligatory act, a recommended act, a permissible act, a disliked act, or a prohibited act. He remains standing between the station he has completed and the matter to which he is transitioning in Allah’s knowledge.\n\nAt that point, a messenger from Allah appears in his secret heart (سره) and says to him: \"Allah has commanded you to supplicate to Him, desire Him, and ask Him concerning this matter to which He is moving you. If there remains life for you, let it be from the Obligatory acts (الواجبات)—this is the intended goal. If not, then from the Recommended acts (المندوبات). If Divine Providence (العناية) does not precede the answer, then from the Permissible acts (المباحات).\"\n\nIf none of these occur, and you see signs flashing to you from behind the veil of abandonment (حجاب الخذلان), and you know that you are transitioning to a prohibited (محظور) or disliked (مكروه) act, then ask Allah for Presence (الحضور) with Him in that matter to which you are transitioning. Ask Him to place within you a dislike (الكراهة) for that matter, and not to prevent you from knowing that it is something whose performance displeases you, and that the Divine Knowledge (العلم الإلهي) will not change within you due to its occurrence from you.\n\nThus, even if it occurs from you while you are in this state, the ruling of disobedience (المعصية) is entirely lifted from you, and the ruling in that case belongs to Divine Decree (القدر). If punishment were to be directed toward one in this state—as transgression demands punishment from one of its aspects—then forgiveness (العفو), the All-Forgiving (الغفور), and the All-Merciful (الرحيم) would be directed toward him. These are the Names that transgression calls for, and they are supported by the Names called for by the dislike that was within you for that action, and by the belief in the Preceding Decree. The Hand of Allah is with the community (الجماعة), so the dominance and ruling belong to these Names, which grant him felicity and goodness despite the occurrence of the disobedience. His disobedience, due to his Presence with Allah within it, becomes a living act possessing a Divine spirit (روح إلهي) that seeks forgiveness for him until the Day of Resurrection, and Allah replaces his bad deed with a good one, just as He replaced its punishment with reward. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).",
    "ur": "باب نمبر دو سو نوے: حضرت موسیٰ کے مقام (الحضرة الموسوية) سے نعمتوں کے اقرار (تقرير النعم) کے منزل کی معرفت میں۔\n\nہم قول کے ذریعے قول کی ذات کی شرح کرتے ہیں، پس غور کرو\nاس شرح میں جو حقیقت میں پہلے ہی مشروح ہے۔\nکہ نام (الأسامي) معنی کی چابیاں ہیں،\nاور عبارات میں ترمیم (تعديل) اور تنقید (تجريح) ہوتی ہے۔\nجس کی طرف القا کیا گیا ہے، اسے شوق حاصل نہیں ہوتا\nجب تک کہ تمہاری طرف سے القا کے لیے کوئی اشارہ (تلويح) نہ ہو۔\nپس اہل اللہ کی معرفتوں (معارف) کو پردوں میں ظاہر کرو،\nتمہیں وضاحت (تبيين) اور صراحت (تصريح) پر حکم نہیں چلانا چاہیے۔\nاور اس چیز کے بارے میں بولو جس سے نفوس (النفوس) غذا حاصل کرتے ہیں،\nاور اس چیز کے بارے میں مت بولو جس کے علم سے روح (الروح) غذا حاصل کرتی ہے۔\nکیونکہ روح اس چیز کو چھپاتی ہے جو اس کی طرف القا کی جاتی ہے،\nجیسے نفوس اس چیز کو ظاہر کرتے ہیں جسے ہوا چلاتی ہے۔\nبے شک نفوس اس چیز کے ساتھ بولتے ہیں جس کی وہ خواہش کرتے ہیں،\nاور روح اگر صراحت (تصريح) سے پھسل جائے تو مجروح ہو جاتی ہے۔\n\n### [احسان جتلانے اور تکلیف دینے سے نعمت کو باطل کرنا]\n\nاللہ تعالیٰ ہمیں اور آپ کو تائید بخشے، جان لو کہ جب انعام کرنے والا (المنعم) احسان جتا کر (المن) اور تکلیف دے کر (الأذى) اپنی نعمت کو باطل کر دیتا ہے، تو وہ اللہ کے نزدیک اس پر شکر گزار نہیں ٹھہرتا، اگرچہ جس پر انعام کیا گیا (المنعم عليه) وہ اپنی ذلت اور انعام کرنے والے کی طرف اپنی محتاجی کی معرفت (المعرفۃ) کی وجہ سے اس کا شکر ادا کرے۔ پس اخلاق کی خوبیوں میں سے یہ ہے کہ انعام کرنے والا اس نعمت پر احسان نہ جتائے جو اس نے انعام پانے والے پر کی ہے، خاص طور پر جب وہ اس پر شکر گزار ہو۔\n\nلیکن اگر انعام پانے والے کو کسی چیز کی ضرورت ہو اور وہ انعام کرنے والے کے سامنے اس چیز کے حصول کے لیے ذلت اور محتاجی کا اظہار کرے جس کی اسے شدید ضرورت ہے، اور وہ چیز انعام پانے والے کے نزدیک اس نعمت میں موجود ہو جو انعام کرنے والے نے اسے دی تھی، تو اس وقت انعام کرنے والے کو یہ حق ہے کہ وہ اسے یاد دلائے کہ اس نے اس پر کیا انعام کیا تھا اور اسے اس کا اقرار کرائے (ويقرره على ذلك)، اور یہ کہ جو چیز اس نے مانگی ہے وہ اس کی دی ہوئی نعمت میں ہی موجود ہے۔ پھر وہ کسی اور جگہ محتاجی کیوں ظاہر کر رہا ہے؟ اس وقت انعام کرنے والے کے لیے جائز ہے کہ وہ انعام پانے والے کو اپنی نعمت یاد دلائے۔ جیسے ایک شخص نے دوسرے کو بطور انعام ایک ہزار دینار دیے، پھر اسے دیکھا کہ وہ پہننے کے لیے کپڑے، سواری کے لیے مرکب، اور انس حاصل کرنے کے لیے اہل و عیال کا محتاج ہے۔ حالانکہ وہ بھول گیا یا اسے علم نہیں کہ انعام کرنے والے کا ارادہ اس نعمت کے ذریعے یہ تھا کہ وہ ان تمام چیزوں کو حاصل کر لے جن کا وہ سوال کر رہا ہے۔ پس اس وقت انعام کرنے والے کو حق ہے کہ وہ اسے آگاہ کرے کہ تم جو کچھ مجھ سے مانگ رہے ہو، وہ سب تمہیں اس مال سے مل سکتا ہے جو میں نے تمہیں ہبہ کیا ہے۔ پھر تم ذلت میں کیوں جلدی کر رہے ہو؟ ایسے موقع پر نعمتوں کا اقرار کرانا (التقرير بالنعم) تعلیم اور تنبیہ کے طور پر واجب ہے، نہ کہ احسان جتلانے اور تکلیف دینے کے طور پر۔ البتہ، اخلاق کی خوبیوں میں سے یہ ہے کہ جب وہ اسے دی گئی نعمت کا اقرار کرا لے، تو اس کی درخواست کو رد نہ کرے، یا تو اسی وقت عطا کر کے یا وعدہ کر کے، تاکہ شرمندگی کی وجہ سے جو انقباض (تنگی) اسے ہوئی تھی، وہ کشادگی میں بدل جائے، یہ ایک الٰہی اخلاق (تخلقا إلهيا) ہے۔\n\n### [نعمتوں کا اقرار کرانا]\n\nپس جان لو کہ یہ منزل نعمتوں کے اقرار کرانے (تقرير النعم) کو شامل ہے جیسا کہ میں نے آپ کو بتایا، اور یہ حکمت والے اطباء کا معلوم کردہ علم تشریح (علم التشريح) کو بھی شامل ہے، اور اس الٰہی تشریح (التشريح الإلهي) کو بھی شامل ہے جو اس انسانی صورت (الصورة الإنسانية) میں مضمر ہے جس کے ساتھ یہ شخص مختص کیا گیا ہے، یعنی اس کا عالم کی صورت پر اور ذات حق (الحق) کی صورت پر مخلوق ہونا۔ پس عالم کی جانب سے اس کی تشریح کا علم یہ ہے کہ آپ اس میں موجود تمام اکوان (حقائق الأكوان) کی حقیقتوں کو جانیں، ان کے علوی اور سفلی، پاکیزہ اور خبیث، نور اور ظلمت کو تفصیل کے ساتھ جانیں۔ اور اس علم کے بارے میں ابو حامد (غزالی) اور دیگر نے کلام کیا ہے اور اسے واضح کیا ہے۔ پس یہ ہمارے طریقہ میں علم تشریح ہے۔\n\nاور جہاں تک دوسرے علم تشریح کا تعلق ہے، تو وہ یہ ہے کہ آپ جانیں کہ اس انسانی صورت میں کون کون سے الٰہی اسماء (الأسماء الإلهية) اور ربانی نسبتیں (النسب الربانية) موجود ہیں۔ اور یہ علم وہی جانتا ہے جو اسماء کے ساتھ متخلق ہونے (التخلق بالأسماء) کو جانتا ہے اور یہ جانتا ہے کہ اس تخلق سے کون سی الٰہی معرفتیں (المعارف الإلهية) پیدا ہوتی ہیں۔ اس پر بھی اللہ کے بندوں نے اللہ کے اسماء کی شرح میں کلام کیا ہے، جیسے ابو حامد الغزالی، ابو الحکم عبد السلام بن برجان الاشبیلی، ابو بکر بن عبد اللہ المغافری، اور ابو القاسم القشیری۔ اور یہ منزل تکلیف (التكليف) اور اس کے رفع کو بھی شامل ہے، اس مشقت کے لحاظ سے جو اس میں ہے، نہ کہ عمل کو ترک کرنے کے لحاظ سے۔\n\n### [بے شک اللہ نے ہمیں اپنے اور اپنے رسولوں پر ایمان لانے کا حکم دیا]\n\nپس جان لو کہ اللہ تعالیٰ نے اپنے بندوں کو اپنے اوپر اور اس چیز پر ایمان لانے کا حکم دیا جو اس نے اپنے رسولوں کے ذریعے ان پر نازل کی، اور ایمان کے ساتھ کچھ معانی کو لازم قرار دیا جنہیں اللہ تعالیٰ نے انہیں حکم دیا کہ وہ ان سب کو اپنے باطن میں معنوی طور پر اٹھائیں، اور ان کا محل قلوب کو بنایا۔ اور کچھ عملی امور مقرر کیے جو ان کے ظاہر پر نازل کیے اور ان کے جوارح (اعضاء) کو ان کا بوجھ اٹھایا، ان میں سے وہ جن میں ہاتھوں اور پیروں کے عمل کی حسی مشقت (كلفة حسية) ہے، اور وہ جو صرف جسموں کے ذریعے ہی کیے جا سکتے ہیں جیسے نماز اور جہاد۔ اور ان میں سے وہ جن میں کوئی حسی مشقت نہیں ہے، جیسے حرام چیزوں سے نگاہیں نیچی رکھنا اور آیات میں غور کرنا تاکہ یہ غور و فکر عبرت کی طرف لے جائے، اور کانوں کو غیبت سننے سے پاک رکھنا اور اچھی بات کی طرف کان لگانا۔ ایسی چیزوں میں کوئی حسی مشقت نہیں ہے، بلکہ ان کی مشقت صرف نفسانی (نفسية) ہے، کیونکہ ان میں غرض کو ترک کرنا شامل ہے، اور یہ نفس پر شاق گزرتا ہے۔\n\nاور جب اس منزل میں موجود اس حضور (الحضرة) کو حسی صورتوں میں مجسم کر کے کھڑا کیا جاتا ہے، تو اس کے دائیں جانب تابوت (صندوق) رکھے جاتے ہیں اور بائیں جانب تابوت۔ دائیں جانب کے تابوت در، یاقوت، قیمتی پتھر، عمدہ لباس، مشک اور خوشبو سے بھرے ہوتے ہیں، اور ان میں سے کچھ بڑے اور کچھ چھوٹے تابوت ہوتے ہیں۔ اور اس شخص سے کہا جاتا ہے کہ تمہیں یہ بوجھ ایک مخصوص جگہ، ایک خوبصورت گھر اور سرسبز و شاداب باغ تک لے جانا ضروری ہے۔ اور اس سے کہا جاتا ہے کہ جب تم یہ بوجھ اس باغ تک پہنچا دو گے، تو اس پر اور اس کے بوجھ کی وجہ سے تمہیں جو تکلیف پہنچی ہے، اس پر تمہارا اجر وہ سب کچھ ہوگا جو ان تابوتوں میں موجود ہے، اور یہ گھر بھی تمہارا ہوگا جہاں تم پہنچے ہو، اس میں موجود تمام ملکیت کے ساتھ۔\n\nیہ تابوت پانچ قسم کے ہیں: واجب امر کے تابوت، مستحب امر کے تابوت، مباح امر کے تابوت (ایمان کے لحاظ سے)، واجب نہی (منع) کے تابوت، اور مکروہ نہی کے تابوت۔ ان تابوتوں میں سے کچھ وہ ہیں جو صرف تم سے متعلق ہیں، اور کچھ وہ ہیں جو تمہارے علاوہ دوسروں سے متعلق ہیں اور تمہیں ان کا بوجھ اٹھانے کا مکلف کیا گیا ہے۔ پس ہر وہ شرعی خطاب جو تمہاری ذات سے مختص ہے اور تم اس پر عمل کرنے میں دوسروں کی طرف متعدی نہیں ہوتے، وہ تمہارے ساتھ مختص ہے۔ اور ہر وہ شرعی خطاب جو تمہاری ذات سے مختص ہے اور تم اس پر عمل کرنے میں دوسروں کی طرف متعدی ہوتے ہو، وہ دوسروں سے متعلق ہے اور تمہیں اس کا بوجھ اٹھانے کا مکلف کیا گیا ہے، جیسے اہل و عیال پر خرچ کرنا، جاہل کو تعلیم دینا، گمراہ کی رہنمائی کرنا، اور اللہ، اس کے رسول، مسلمانوں کے ائمہ اور عام لوگوں کے لیے نصیحت کرنا۔ یہ دائیں ہاتھ والوں کے تابوت ہیں۔ پس جس طرح تم نے دنیا میں وہ بوجھ اٹھایا جو تمہارا اور دوسروں کا تھا، اسی طرح آخرت میں تمہارا اجر اور دوسروں کا اجر بھی تمہارے لیے ہوگا، اور دوسرے کے اجر میں کوئی کمی نہیں ہوگی اگر وہ مومن ہے۔ اور اگر وہ مومن نہیں ہے، جیسے اہل ذمہ کے ساتھ تمہارے معاملات سے متعلق تکلیف، تو اگر وہ مومن ہوتے تو تمہیں ان کا اجر ملتا، لیکن انہیں کوئی اجر نہیں ملے گا۔ اسی لیے نبی اکرم صلی اللہ علیہ وسلم نے اس امر کو عمل کے ساتھ مقید فرمایا:\n\n**حدیث:**\n> من سن سنة حسنة فله أجرها وأجر من عمل بها إلى يوم القيامة\n**ترجمہ:** \"جس نے کوئی اچھا طریقہ (سنت حسنة) جاری کیا، تو اسے اس کا اجر ملے گا اور ان لوگوں کا اجر بھی جو قیامت تک اس پر عمل کریں گے۔\"\n\nپس مومن کے اخروی اجر میں کوئی کمی نہیں کی جائے گی، اور ذمی کو اس کا اجر دنیا میں دیا جائے گا، یا تو فوری فائدے کی صورت میں یا فوری نقصان کو دور کرنے کی صورت میں، اور یہ سب اس عامل کے لیے آخرت میں یقینی ہوگا۔ اور بعض اوقات اس کے لیے دنیا اور آخرت دونوں کو جمع کر دیا جاتا ہے۔ عامل دیکھتا ہے کہ ان تابوتوں میں کیا قیمتی اشیاء اور مال ہے، اور اسے یہ خوشخبری مل چکی ہوتی ہے کہ یہ سب اس کی ملکیت ہے اگر وہ انہیں اٹھا لے، جس کی وجہ سے وہ ان کی محبت اور عشق میں فنا (فناء) ہو جاتا ہے، تو ان کا بوجھ اٹھانا اس کے لیے آسان ہو جاتا ہے اور ہمت کے اٹھانے کی وجہ سے وہ ہلکا ہو جاتا ہے، اور اسے اس میں کوئی مشقت محسوس نہیں ہوتی۔ یہ اس حال میں ہوتا ہے جب وہ تکلیف سے لذت حاصل کر رہا ہوتا ہے اور اس چیز سے بھی جو اہل ذمہ کے لیے بہتر ہے۔\n\nاور دوسرا شخص ان کے بوجھ کو دیکھتا ہے، اور وہ وہ مومن ہے جسے صرف خبر کی تصدیق کے سوا کوئی کشف (الکشف) حاصل نہیں ہوتا، تو وہ انہیں اٹھانے میں بھاری محسوس کرتا ہے۔ ان میں سے کچھ ایسے ہیں جو ان کو بڑی مشقت اور تکلیف سے اٹھاتے ہیں، کیونکہ ان میں موجود چیزوں کی تصدیق غالب ہوتی ہے اور انہیں حاصل کرنے اور ان کا مالک بننے کی شدید حرص اور لالچ ہوتی ہے، کیونکہ حکم دینے والے نے کہا ہے کہ یہ تمہارے بوجھ اٹھانے کے اجر میں تمہارے لیے ہیں۔ اور ان میں سے کچھ ایسے ہیں جن پر یہ بوجھ بھاری ہو جاتا ہے، تو وہ اس میں سے ایک حصہ نکال کر زمین پر پھینک دیتے ہیں تاکہ انہیں محسوس ہونے والا بوجھ ہلکا ہو جائے۔ جب وہ اس میں سے کچھ پھینکنے سے ہلکا ہو جاتا ہے، تو وہ باقی کو اٹھا لیتے ہیں۔ اور جو کچھ بھی وہ پھینکتے ہیں، وہ پھینکی ہوئی چیز لوہا، سیسہ اور تانبا بن کر ان تابوتوں میں شامل ہو جاتی ہے جو ان کے بائیں جانب رکھے گئے ہیں۔\n\nاور جو تابوت ان کے بائیں جانب رکھے گئے ہیں، وہ سب لوہے، تانبے، تارکول اور سیسے جیسی بھاری اور بدبودار چیزوں سے بھرے ہوئے ہیں۔ اور اس سے کہا جاتا ہے کہ تمہیں یہ تابوت اپنی پیٹھ پر اٹھا کر اسی ترتیب سے لے جانے ہیں جو ہم نے دائیں جانب کے تابوتوں میں مقرر کی تھی، اور انہیں ایک ایسے گھر تک پہنچانا ہے جو شعلوں اور ٹھنڈک (زمہریر) والا ہے۔ اور جو کچھ ان تابوتوں میں ہے وہ تمہاری ملکیت ہے۔ یہ اللہ تعالیٰ کا قول ہے:\n**قرآنی آیت:**\n> ولَيَحْمِلُنَّ أَثْقالَهُمْ وأَثْقالًا مَعَ أَثْقالِهِمْ\n**ترجمہ:** \"اور وہ ضرور اپنے بوجھ اٹھائیں گے اور اپنے بوجھوں کے ساتھ مزید بوجھ بھی اٹھائیں گے۔\" (العنكبوت: 13)\n\nاور یہ نبی اکرم صلی اللہ علیہ وسلم کا قول ہے:\n**حدیث:**\n> من سن سنة سيئة فله وزرها ووزر من عمل بها إلى يوم القيامة\n**ترجمہ:** \"جس نے کوئی برا طریقہ (سنت سيئة) جاری کیا، تو اس پر اس کا گناہ ہوگا اور ان لوگوں کا گناہ بھی جو قیامت تک اس پر عمل کریں گے۔\"\n\nاور اگر مکاشفہ (المكاشف) رکھنے والے کے لیے اس منزل میں کوئی حسی صورتیں حاضر نہ ہوں، تو اس کے دل پر مواد سے پاک معانی نازل ہوتے ہیں، اور وہ ان کی تفصیلات کو جان لیتا ہے اور ہر چیز کو اس کے مقام اور محل سے جوڑ دیتا ہے، اور اسے اس میں کوئی مشقت یا تکلیف محسوس نہیں ہوتی، کیونکہ اس کی اپنے آقا کے ارادے کے ساتھ کوئی غرض نہیں ہوتی۔ پس وہ کشادگی اور شرح صدر کے عالم میں ہوتا ہے۔ اگرچہ ان کے جسم ان بعض چیزوں کا بوجھ اٹھانے سے کمزور ہو جائیں جن کا انہیں مکلف کیا گیا ہے، لیکن انہیں حکم دیا گیا ہے کہ وہ صرف اپنی نفس (النفس) کی وسعت کے مطابق ہی بوجھ اٹھائیں۔ یہاں نفس سے مراد حس کو مکمل کرنا ہے، کیونکہ معنوی نفس (النفس المعنوية) پر کوئی مشقت نہیں ہوتی، مگر جب وہ صاحب غرض ہو، تو اسے ایسی چیز کا مکلف کیا جاتا ہے جس میں اس کی کوئی غرض نہ ہو۔ اسی لیے انسان کو اس کے نفس کے لحاظ سے معذور نہیں سمجھا جاتا، لیکن اس کے حس کے لحاظ سے معذور سمجھا جاتا ہے، کیونکہ وہ معمول کے مطابق اس کی طاقت سے باہر ہوتا ہے۔\n\nاور اس منزل سے فرشتوں کی پیدائش کے علم کا ایک حصہ متعلق ہے، اور یہ کہ وہ عالم طبیعت سے مخلوق ہیں، انسانوں کی طرح، مگر وہ زیادہ لطیف ہیں، جیسے جن انسان سے زیادہ لطیف ہیں، باوجود اس کے کہ وہ آگ سے، اس کے شعلے سے پیدا ہوئے ہیں، اور آگ عالم طبیعت سے ہے۔ اس کے باوجود وہ روحانی ہیں، جو شکلیں بدلتے ہیں اور تمثل اختیار کرتے ہیں۔ اگر طبیعت اس کو قبول نہ کرتی تو عالم جن اسے قبول نہ کرتا۔ اور اس کا انکار کیسے کیا جا سکتا ہے، جبکہ یہ قطعی طور پر معلوم ہے کہ انسان کثیف عالم طبیعت سے ہے، اور اس میں اس کا ایک حصہ دماغ کے اگلے حصے میں خیال کا خزانہ ہے، جس کے ذریعے وہ جو چاہے محالات کا بھی تصور کر لیتا ہے، تو ممکنات کا کیوں نہیں؟ اسی طرح فرشتے علیہم السلام بھی عالم طبیعت سے ہیں، اور وہ افلاک اور آسمانوں کے آباد کرنے والے ہیں۔ اور اللہ نے آپ کو آگاہ کیا ہے کہ:\n**قرآنی آیت:**\n> اسْتَوى‏ إِلَى السَّماءِ وهِيَ دُخانٌ فَسَوَّاهُنَّ سَبْعَ سَماواتٍ\n**ترجمہ:** \"پھر وہ آسمان کی طرف متوجہ ہوا اور وہ دھواں تھا، پس اس نے انہیں سات آسمان بنا دیے۔\" (فصلت: 11)\n\nاور اس نے ان کے رہنے والوں کو بھی اسی سے بنایا، اور یہ اس کا قول ہے:\n**قرآنی آیت:**\n> وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها\n**ترجمہ:** \"اور اس نے ہر آسمان میں اس کا حکم وحی کیا۔\" (فصلت: 12)\n\nاور اس میں کوئی اختلاف نہیں کہ دھواں طبیعت سے ہے، اگرچہ فرشتے نوری اجسام ہیں، جیسے جن ناری اجسام ہیں۔ اور اگر نور طبعی نہ ہوتا تو اسے جلانے کی صفت سے موصوف نہ کیا جاتا، جیسے آگ کو خشک کرنے اور رطوبتوں کو زائل کرنے سے موصوف کیا جاتا ہے۔ اور یہ سب طبیعت کی صفات ہیں۔\n\nپھر اللہ نے ملأ اعلیٰ (فرشتوں) کے بارے میں خبر دی ہے کہ وہ جھگڑتے ہیں (يختصمون)، اور جھگڑا (الخصام) طبیعت سے ہے، کیونکہ طبیعت اضداد کا مجموعہ ہے، اور تنازع اور اختلاف ہی جھگڑا ہے۔ اور یہ صرف دو ضدوں کے درمیان ہی ہوتا ہے۔ اسی باب سے ان کا یہ قول ہے:\n**قرآنی آیت:**\n> أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها ويَسْفِكُ الدِّماءَ\n**ترجمہ:** \"کیا تو اس میں ایسے لوگوں کو بنائے گا جو اس میں فساد کریں گے اور خون بہائیں گے؟\" (البقرة: 30)\n\nیہ ان کی طبیعت اور جناب الٰہی پر ان کی غیرت کی وجہ سے تھا۔ اگر وہ اپنی روحانیت پر قائم رہتے تو جب اللہ نے ان سے کہا:\n**قرآنی آیت:**\n> إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً\n**ترجمہ:** \"بے شک میں زمین میں ایک خلیفہ بنانے والا ہوں۔\" (البقرة: 30)\n\nتو وہ ایسی بات نہ کہتے، بلکہ ان کا جواب اس الٰہی راز (السر الإلهي) کی رو سے جو ان میں تھا، یہ ہونا چاہیے تھا کہ وہ کہتے کہ یہ آپ کا کام ہے، آپ پاک ہیں، آپ جو چاہتے ہیں کرتے ہیں، اور ہم آپ کے حکم کے تحت بندے ہیں، اس کی اطاعت کرتے ہیں جس کی اطاعت کا آپ ہمیں حکم دیتے ہیں۔ پس جس فساد اور دیگر چیزوں کی وجہ سے انسان سے وہ چیزیں واقع ہوئیں جن کا عالم طبع تقاضا کرتا ہے، اسی وجہ سے فرشتوں کی طرف سے اعتراض واقع ہوا۔ انہوں نے اسے دوسروں میں دیکھا اور اپنے نفوس میں نہیں دیکھا۔ اور یہ اس وجہ سے ہے جو ہم نے مقرر کیا کہ غرض سے عشق (التعشق بالغرض) اپنے صاحب اور اس فعل کے درمیان رکاوٹ بن جاتا ہے جو اسے کرنا چاہیے۔ اسی لیے اللہ تعالیٰ نے ان سے فرمایا:\n**قرآنی آیت:**\n> إِنِّي أَعْلَمُ ما لا تَعْلَمُونَ\n**ترجمہ:** \"بے شک میں وہ جانتا ہوں جو تم نہیں جانتے۔\" (البقرة: 30)\n\nپھر اللہ نے انہیں ان پر اپنی فضیلت دکھائی، اس علم الاسماء الٰہیہ (علم الأسماء الإلهية) کے ذریعے جو اس نے ان لوگوں کے ساتھ خاص کیا جن کی طرف اشارہ کیا گیا تھا، اور فرشتے اس سے ناواقف تھے۔ گویا وہ سبحانہ و تعالیٰ فرما رہا ہے کہ میں اپنا علم اپنی مخلوق میں جہاں چاہتا ہوں رکھتا ہوں اور اس کے ذریعے اسے عزت دیتا ہوں۔ پس یہاں سے آپ وہ جان لیں گے جو ہم نے ذکر کیا، اور اس امر کا علم مکمل اور مستوفی طور پر اس کی خاص منزل میں آئے گا۔ کیونکہ ان منازل کے علوم دو قسم کے ہیں: ان میں سے کچھ علوم وہ ہیں جو منزل کے ساتھ مختص ہیں اور کسی اور میں نہیں پائے جاتے، اور کچھ علوم وہ ہیں جن کا ایک حصہ ہر منزل میں ہوتا ہے۔\n\n### [قلب الٰہی وسعت کا محل ہے]\n\nاور جان لو کہ اگرچہ قلب (القلب) الٰہی وسعت (السعة الإلهية) کا محل ہے، لیکن سینہ (الصدر) قلبی وسعت کا محل ہے، کیونکہ اسے صدر (سینہ) اس لیے کہا گیا کہ وہ صادر (جاری) ہوتا ہے۔ اسی لیے اللہ نے فرمایا:\n**قرآنی آیت:**\n> ولكِنْ تَعْمَى الْقُلُوبُ الَّتِي في الصُّدُورِ\n**ترجمہ:** \"لیکن وہ دل اندھے ہو جاتے ہیں جو سینوں میں ہیں۔\" (الحج: 46)\n\nکیونکہ قلب ورود (آنے) کی حالت میں تنگ ہو جاتا ہے، اس جلال اور ہیبت کے تقاضے کی وجہ سے جو قرب الٰہی (القرب الإلهي) اور ظہور الٰہی (التجلی) عطا کرتا ہے۔ اور جب وہ صادر (جاری) ہوتا ہے تو کشادہ اور وسیع ہو جاتا ہے، کیونکہ وہ کون (وجود) ہے اور کون کی طرف صادر ہو رہا ہے، تو مناسبت کی وجہ سے کشادہ ہو جاتا ہے، اور اس کے نور کی شعاعیں اکوان (الأكوان) پر پھیلنے سے وسیع ہو جاتی ہیں، اور وہ اس بات پر خوش ہوتا ہے کہ اسے اپنے ہم جنسوں پر اس الٰہی تعریف (التعريف الإلهي) کے ساتھ خاص کیا گیا۔ اسی لیے جب اسے کوئی عارض لاحق ہوتا ہے جو اسے تنگی کے محل کے علاوہ کسی اور جگہ تنگ کرتا ہے، تو ذات حق (الحق) اسے تنبیہ کرتی ہے، اسے یاد دلاتی ہے کہ اللہ نے اس پر کیا انعام کیا ہے، تاکہ وہ اپنے اوپر کی گئی الٰہی نعمت کو یاد کرے، اور یہ چیز اس تنگی کے درمیان حائل ہو جائے جس میں وہ تھا۔ پس یہ ظاہر میں تو الٰہی ہے، لیکن معنی میں اس قلب کے لیے رحمت ہے۔\n\nپس یہاں سے ذات حق (الحق) اپنے بندے کو اس چیز کا اقرار کراتی ہے جس سے اس نے اس پر احسان کیا۔ اگر آپ کہیں کہ اللہ نے تو ذکر کیا ہے کہ وہ اپنے بندوں پر احسان جتاتا ہے (يمن)، تو ہم کہیں گے کہ یہ صرف اس لیے آیا جب انہوں نے اپنے اسلام لانے پر رسول اللہ صلی اللہ علیہ وسلم پر احسان جتایا، تو اللہ نے آپ سے فرمایا:\n**قرآنی آیت:**\n> قُلْ لَا تَمُنُّوا عَلَيَّ إِسْلَامَكُمْ بَلِ الله يَمُنُّ عَلَيْكُمْ أَنْ هَداكُمْ لِلْإِيمانِ\n**ترجمہ:** \"کہہ دیجیے کہ مجھ پر اپنے اسلام کا احسان نہ جتاؤ، بلکہ اللہ تم پر احسان کرتا ہے کہ اس نے تمہیں ایمان کی ہدایت دی۔\" (الحجرات: 17)\n\nیعنی جب تم احسان جتلانے (المن) کے مقام میں داخل ہوئے، تو احسان اللہ کے لیے ہے نہ کہ تمہارے لیے۔ پس یہ علم التطابق (مطابقت کا علم) سے ہے، اس سے احسان جتلانا مقصود نہیں تھا۔ اللہ ایسا نہیں کر سکتا کہ وہ احسان جتلانے کے بارے میں وہ کہے جو اس نے کہا، اور پھر خود بھی ایسا کرے، جیسا کہ:\n**حدیث:**\n> قال صلى الله عليه وسلم ما كان الله لينهاكم عن الربا ويأخذه منكم‏\n**ترجمہ:** نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"اللہ ایسا نہیں کر سکتا کہ وہ تمہیں سود سے منع کرے اور پھر خود تم سے سود لے۔\"\n\nاور اللہ ایسا نہیں کر سکتا کہ وہ تمہیں عفو و درگزر جیسی اخلاقی خوبیوں کی طرف رہنمائی کرے اور تمہارے ساتھ اس کے خلاف عمل کرے۔ پس جب تم سے اخلاق کی کمزوریاں واقع ہوتی ہیں، تو ذات حق سبحانہ و تعالیٰ تمہارے اعمال کو تم پر لوٹا دیتا ہے، نہ کہ وہ اپنی طرف سے تمہارے ساتھ ان کا معاملہ کرتا ہے۔ بلکہ تمہارے اعمال تم سے آگے نہیں بڑھے۔ پس اللہ کے لیے منت (المنة) ہے جو کہ نعمت ہے، اور امتنان (الامتنان) ہے جو کہ منت کا عطا کرنا ہے، نہ کہ احسان جتلانا (المن)، وہ پاک اور بلند ہے۔\n\nاور جب اللہ تعالیٰ اپنے بندے کی رفعت کو اپنی مخلوق کے سامنے چاہتا ہے، تو وہ اپنے بندوں کے سامنے اس کے مقام کا ذکر کرتا ہے، یا تو تعریف (التعريف) کے ذریعے، یا یہ کہ اس کے ہاتھ پر اور اس کی حالت میں وہ چیزیں ظاہر کرتا ہے جو صرف اس کے مقرب بندوں کے لیے ہی ممکن ہیں۔ تو زبانیں اس کے لیے کھل جاتی ہیں اور اس کے آقا کے نزدیک اس کے بلند مرتبے کا اظہار کرتی ہیں، جیسے قیامت کے دن آپ صلی اللہ علیہ وسلم کا شفاعت کا دروازہ کھولنا، جو آپ کے لیے تمام رسولوں اور انبیاء پر خاص کیا گیا، تو اس موقع پر آپ کا منارہ ہر ایک سے بلند ہو جاتا ہے۔ اور وہاں ریاست اور بلندی کی طلب کی جاتی ہے۔ لیکن دنیا میں عارف کو اس بات کی پرواہ نہیں ہوتی کہ وہ لوگوں کے نزدیک صبح کس حال میں ہوا اور شام کس حال میں، کیونکہ وہ حجاب کے محل میں ہیں اور وہ تکلیف (التكليف) کے مقام میں ہے۔ ہر انسان اپنے نفس میں مشغول ہے اور اس عمل کی ادائیگی کا مطلوب ہے جس کا اسے مکلف کیا گیا ہے۔\n\nاور اس منزل میں علم التنکیر (نکرہ کا علم) شامل ہے جو کہ ظہور الٰہی عام (التجلي العام) ہے، اور علم التعریف (معرفہ کا علم) شامل ہے جو کہ ظہور الٰہی خاص (التجلي الخاص) ہے۔ اور یہ خاص عام میں شامل ہے، جیسے اسم الرب (رب کا نام) جب ذات حق اس میں اپنے بندوں پر ظہور (التجلی) فرماتا ہے، تو یہ ایک عام ظہور (تجل عام) ہے۔ اور جب وہ اس طرح کے قول میں ظہور فرماتا ہے:\n**قرآنی آیت:**\n> فَوَ رَبِّكَ\n**ترجمہ:** \"پس تیرے رب کی قسم\" (الحجر: 92)\n\nتو یہ ایک خاص ظہور (تجل خاص) ہے۔ اگرچہ تمام تجلیات ربوبیت سے ہیں، لیکن ان کے درمیان فرق ہے۔ کیونکہ جو حال تمہارا بادشاہ کے ساتھ عام مجلس میں ہوتا ہے، وہ اس حال جیسا نہیں ہوتا جو تمہارا اس کے ساتھ تنہائی میں ہوتا ہے۔ پس اس مقام کا ایک خاص علم ہے اور اس مقام کا ایک خاص علم ہے۔ اور ظہور عام (التجلي العام) زیادہ علم والا اور زیادہ نفع بخش ہے، اور ظہور خاص (التجلي الخاص) قربت میں زیادہ عظیم ہے۔\n\n### [معرفت تمام امور کی اصل ہے]\n\nاور جان لو کہ ہمارے نزدیک تمام امور کی اصل معرفت (المعرفة) ہے، اور نکرہ (التنکیر) ایک عارضی امر ہے جو لاحق ہوتا ہے۔ جب یہ لاحق ہوتا ہے تو ابہام اور اشکال پیدا ہوتا ہے۔ پس عارف وہ ہے جو اسے نکرہ (تنکیر) کی حالت میں بھی پہچان لے۔ پس یہ عموم میں نکرہ ہے، اور اس وقت یہ نکرہ میں معرفت ہے۔ جب کوئی کہنے والا کہتا ہے کہ \"میں نے آج ایک آدمی سے بات کی\" (كلمت اليوم رجلا)، تو یہاں \"رجل\" (آدمی) نکرہ ہے، لیکن جس نے اس سے بات کی ہے، اس کے نزدیک وہ تعین کے ساتھ معرفہ ہے، جبکہ اس پر نکرہ کا حکم لگایا جا رہا ہے۔ پس عارف عالم کی طرف سے نکرہ اور انکار کی حالت میں ذات حق (الحق) کا جو مشاہدہ کرتا ہے، وہ اس کے نزدیک عین معرفت (المعرفة) ہے، کیونکہ اس نے اسے اس اطلاق پر باقی رکھا ہے جس کا وہ مستحق ہے، جبکہ عقائد اسے مقید کر دیتے ہیں۔ پس عام لوگ اسے نکرہ میں جہالت سمجھتے ہیں، اور یہ عارفین کے لیے بہت فائدے کا مقام ہے۔\n\n### [عارف کا ذات حق سے سوال کرنے پر قادر نہ ہونا]\n\nاور جان لو کہ اس منزل میں عارف کے لیے یہ ممکن نہیں ہوتا کہ وہ ذات حق (الحق) سے کسی معاملے میں سوال کرے، مگر صرف خاص پہلو (الوجه الأخص) سے، عام پہلو (الوجه الأعم) سے نہیں۔ اور اس کے لیے یہ بھی درست نہیں کہ وہ ذات حق سے کسی ایسے معاملے میں سوال کرے جس میں وہ خود مشغول ہو، کیونکہ وہ اس ادب سے غافل ہو جاتا ہے جس کا وہ معاملہ مستحق ہے۔ پس جب وہ اس کا حق ادا کر دیتا ہے، خواہ حسی طور پر ہو جو بدنی عبادات سے متعلق ہو، یا معنوی طور پر ہو جو قلبی عبادات سے متعلق ہو، اور ذات حق اسے اس عبادت سے منتقل کرنا چاہے، تو عارف کو یہ معلوم نہیں ہوتا کہ ذات حق اسے کس مرتبے کی طرف منتقل کرنا چاہتی ہے، کیا وہ اسے کسی دوسرے واجب، یا مستحب، یا مباح، یا مکروہ، یا ممنوع کی طرف منتقل کرے گا؟ پس وہ اس مقام کے درمیان ٹھہرا رہتا ہے جس سے وہ فارغ ہوا ہے اور اس امر کے درمیان جس کی طرف وہ اللہ کے علم میں منتقل ہونے والا ہے۔\n\nاس وقت اس کے باطن میں اللہ کی طرف سے ایک رسول ظاہر ہوتا ہے جو اسے کہتا ہے کہ اللہ نے تمہیں حکم دیا ہے کہ تم اس معاملے میں اس سے تضرع کرو، اس کی رغبت کرو اور اس سے سوال کرو جس کی طرف وہ تمہیں منتقل کر رہا ہے: اگر تمہاری زندگی باقی ہے تو وہ واجبات میں سے ہو، اور یہی مراد ہے۔ اگر ایسا نہ ہو تو مستحبات میں سے ہو۔ اگر عنایت پہلے سے ہی قبولیت کے ساتھ سبقت نہ لے گئی ہو تو مباحات میں سے ہو۔ اور اگر ایسا نہ ہو اور تم دیکھو کہ محرومی کے پردے کے پیچھے سے تمہاری طرف روشنی کی جھلکیاں آ رہی ہیں، اور تم جان لو کہ تم کسی ممنوع (محظور) یا مکروہ کی طرف منتقل ہونے والے ہو، تو اللہ سے اس معاملے میں اس کے ساتھ حضور (الحضور) کا سوال کرو جس کی طرف تم منتقل ہو رہے ہو، اور اس سے سوال کرو کہ وہ تمہارے اندر اس معاملے کے لیے کراہت (ناپسندیدگی) پیدا کر دے، اور تمہارے اور تمہاری اس معرفت کے درمیان حائل نہ ہو کہ یہ ایک ایسا فعل ہے جو تمہیں برا لگتا ہے۔ اور یہ کہ الٰہی علم تمہارے اندر اس کے واقع ہونے سے تبدیل نہیں ہوتا، یہاں تک کہ اگر وہ تم سے اس حالت میں واقع ہو جائے، تو تم میں معصیت کا حکم بالکل باقی نہیں رہتا، اور اس میں حکم تقدیر (القدر) کا ہوتا ہے۔\n\nپس جب اس شخص پر سزا کا رخ کیا جاتا ہے، جیسا کہ مخالفت اپنے کسی پہلو سے اس کا تقاضا کرتی ہے، تو عفو، غفور اور رحیم (الرحيم) کا رخ کیا جاتا ہے، اور یہ وہ اسماء ہیں جن کا مخالفت تقاضا کرتی ہے، اور وہ ان اسماء سے مدد حاصل کرتے ہیں جو اس فعل کے لیے تمہارے اندر موجود کراہت کا تقاضا کرتے ہیں، اور اس میں سابقہ تقدیر پر ایمان کا تقاضا کرتے ہیں۔ اور \"اللہ کا ہاتھ جماعت کے ساتھ ہے\" (ید اللہ مع الجماعة)، پس ان اسماء کی غالبیت اور حکم ہوتا ہے جو اسے معصیت کے واقع ہونے کے باوجود سعادت اور خیر عطا کرتے ہیں۔ اور اس کی معصیت، اس میں اللہ کے ساتھ اس کے حضور کی وجہ سے، ایک زندہ اور الٰہی روح والی ہوتی ہے جو قیامت تک اس کے لیے استغفار کرتی ہے، اور اللہ اس کی برائیوں کو نیکیوں سے بدل دیتا ہے، جیسا کہ اس نے اس کی سزا کو ثواب سے بدل دیا۔\n**قرآنی آیت:**\n> والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n**ترجمہ:** \"اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔\" (الاحزاب: 4)",
    "fa": "باب دویست و نودم: در معرفت منزل اقرار به نعمت‌ها از حضرت موسوی\n\nبا گفتار، ذات گفتار را شرح می‌دهیم، پس در شرح آنچه در حقیقت شرح داده شده است، عبرت بگیرید.\nکه نام‌ها کلیدهای معنا هستند، و در عبارات، تعدیل و جرح (نقد) وجود دارد.\nاگر از جانب تو برای القاء، اشاره‌ای نباشد، شوقی برای کسی که به او القاء می‌شود، حاصل نمی‌گردد.\nپس معارف اهل الله را در پرده‌ها آشکار کن، مبادا که تبیین و تصریح بر تو حکم کند (تو را محدود سازد).\nو به آنچه نفوس از آن تغذیه می‌کنند سخن بگو، و به آنچه روح از علم آن تغذیه می‌کند، سخن مگو.\nزیرا روح آنچه به او القاء می‌شود را پنهان می‌دارد، همان‌گونه که نفوس آنچه را باد به جریان می‌اندازد، آشکار می‌سازند.\nهمانا نفوس به آنچه دوست دارند گویا هستند، و روح اگر با تصریح بلغزد، مجروح می‌شود.\n\n### [باطل کردن نعمت به وسیله منت و آزار]\n\nبدان، خداوند ما و شما را تأیید کند، که اگر نعمت‌دهنده، نعمت خود را با منت و آزار باطل سازد، نزد خداوند بر آن شکرگزار شمرده نمی‌شود، هرچند که نعمت‌گیرنده به دلیل معرفتش به خواری و فقر خود در برابر او، شکرش را به جا آورد. از مکارم اخلاق این است که نعمت‌دهنده بر آنچه به نعمت‌گیرنده بخشیده، منت نگذارد، به ویژه هنگامی که او شکر آن را به جا آورده است. پس اگر نعمت‌گیرنده به امری نیاز پیدا کند و در طلب آن امر که نیازش به آن ضروری شده است، خواری و فقر خود را نزد نعمت‌دهنده آشکار سازد، و آن امر نزد نعمت‌گیرنده در همان نعمتی باشد که نعمت‌دهنده به او بخشیده است، در این هنگام، نعمت‌دهنده حق دارد که او را به نعمتی که به وی داده است آگاه سازد و او را بر آن اقرار دهد، و بگوید آنچه طلب می‌کند در نفس نعمت او موجود است. پس چرا در غیر موضع فقر، اظهار فقر می‌کند؟ در چنین موقعیتی، برای نعمت‌دهنده جایز است که نعمت خود را به نعمت‌گیرنده یادآوری کند؛ مانند مردی که هزار دینار به کسی بخشیده است، سپس او را می‌بیند که به لباسی برای پوشیدن، مرکبی برای سوار شدن، و خانواده‌ای برای انس گرفتن نیازمند است، در حالی که فراموش کرده یا نادان است که اراده نعمت‌دهنده از نعمتی که به او داده، این بوده است که تمام آنچه را می‌خواهد از همان نعمت به دست آورد. در این هنگام، نعمت‌دهنده حق دارد او را آگاه سازد که تمام آنچه از من می‌خواهی، با مالی که به تو بخشیده‌ام، به آن می‌رسی. پس چرا در اظهار خواری شتاب می‌کنی؟ در چنین موطنی، اقرار به نعمت‌ها بر وجه تعلیم و تنبیه واجب است، نه بر وجه منت و آزار. مگر اینکه از مکارم اخلاق این است که اگر او را بر نعمتی که به وی داده اقرار داد، درخواستش را رد نکند؛ یا با بخششی در همان لحظه، یا با وعده‌ای، تا خجالتی که به او دست داده است، با گشایش برطرف شود، و این تخلق (تخلق) الهی است.\n\n### [اقرار به نعمت‌ها]\n\nپس بدان که این منزل، متضمن اقرار به نعمت‌هاست، همان‌گونه که برایت ذکر کردم، و متضمن علم تشریح است که پزشکان از اهل حکمت آن را می‌شناسند، و نیز تشریح الهی که در صورتی که این شخص انسانی به آن اختصاص یافته، نهفته است؛ از این جهت که او بر صورت عالم و بر صورت حق (الحق) آفریده شده است. پس علم تشریح او از جانب عالم، همان علم تو به حقایق (حقائق) تمام اکوان (هستی‌ها)، اعم از علوی و سفلی، پاک و ناپاک، نور و ظلمت، به تفصیل است. ابوحامد و دیگران در این علم سخن گفته و آن را تبیین کرده‌اند. این است علم تشریح در طریقه ما. اما علم تشریح دوم، این است که آنچه در این صورت انسانی از اسماء الهی و نسبت‌های ربانی وجود دارد را بدانی. این علم را کسی می‌داند که تخلق (تخلق) به اسماء و آنچه این تخلق از معارف الهی (المعرفة) به بار می‌آورد را بشناسد. در این باره نیز رجال الله در شرح اسماء الله سخن گفته‌اند، مانند ابوحامد غزالی، ابوالحکم عبدالسلام بن برجان اشبیلی، ابوبکر بن عبدالله مغافری، و ابوالقاسم قشیری. این منزل همچنین متضمن تکلیف و رفع آن است، از حیث مشقتی که در آن است، نه از حیث ترک عمل.\n\n### [همانا خداوند ما را به ایمان به خود و رسولانش امر کرده است]\n\nپس بدان که خداوند متعال بندگانش را به ایمان به خود و به آنچه بر دست رسولانش بر آنان نازل کرده، امر فرموده است. و همراه با ایمان، الزاماتی از معانی قرار داده که خداوند به آنان امر کرده است تا همه آن‌ها را در بواطن خود به صورت معنوی حمل کنند و محل آن را قلب‌ها قرار داده است. و اموری عملی را تعیین کرده که بر ظواهر آنان نازل شده و جوارحشان آن را حمل می‌کنند؛ از جمله اموری که در آن مشقت حسی وجود دارد، مانند عمل دست‌ها و پاها، و آنچه جز با بدن‌ها انجام نمی‌شود، مانند نماز و جهاد؛ و از جمله اموری که در آن مشقت حسی نیست، مانند فرو بستن چشم از محرمات و نظر کردن در آیات برای اینکه آن نظر به عبرت و تنزیه گوش از شنیدن غیبت و گوش سپردن به سخن نیکو منجر شود. چنین امری مشقت حسی ندارد، بلکه مشقت آن نفسانی است، زیرا در آن ترک غرض وجود دارد. و این بر نفس دشوار است.\n\nو هنگامی که این حضرت (حضرة) که در این منزل است، به صورت‌های حسی تمثیل داده شود، تابوت‌هایی در سمت راست و تابوت‌هایی در سمت چپ او برپا می‌شود. تابوت‌های سمت راست پر از دُر، یاقوت، سنگ‌های نفیس، جامه‌ها، مُشک و عطر است. برخی از این تابوت‌ها بزرگ و برخی کوچک هستند. و به او گفته می‌شود: ناگزیر باید این بارها را به مکانی معین، به خانه‌ای زیبا و باغی سرسبز برسانی. و به او گفته می‌شود: اگر این بارها را به این باغ رساندی، پاداش تو در برابر آن و در برابر آزاری که از سنگینی آن به تو رسیده، تمام محتویات این تابوت‌ها خواهد بود، و این خانه‌ای که به آن رسیده‌ای، با تمام آنچه از مُلک در بر دارد، از آن توست. این تابوت‌ها پنج نوع هستند: تابوت‌های امر واجب، تابوت‌های امر مستحب، تابوت‌های امر مباح (از حیث ایمان به آن)، تابوت‌های نهی واجب، و تابوت‌های نهی مکروه. برخی از این تابوت‌ها مختص به تو هستند و برخی به دیگری تعلق دارند و تو مکلف به حمل آن‌ها شده‌ای. هر خطاب شرعی که مختص ذات تو باشد و در عمل به آن به دیگری تعدی نکنی، مختص به توست. و هر خطاب شرعی که مختص ذات تو باشد و در عمل به آن به دیگری تعدی کنی، آن است که به دیگری تعلق دارد و تو مکلف به حمل آن شده‌ای؛ مانند تلاش برای تأمین معاش خانواده، تعلیم جاهل، ارشاد گمراه، و نصیحت برای خدا، رسولش، پیشوایان مسلمانان و عموم آنان. این‌ها تابوت‌های اصحاب یمین هستند. همان‌گونه که آنچه برای تو و برای دیگری در دنیا بود را حمل کردی، پاداش تو و پاداش دیگری در آخرت برای تو خواهد بود، و از پاداش دیگری چیزی کم نمی‌شود، اگر مؤمن باشد. و اگر مؤمن نباشد، مانند تکلیفی که در معامله با اهل ذمه به تو تعلق می‌گیرد، اگر مؤمن بودند، پاداش آن‌ها برای تو بود، در حالی که برای آن‌ها پاداشی نیست. به همین دلیل، پیامبر (صلی الله علیه و سلم) این امر را به عمل مقید کرد و فرمود:\n\n> «مَنْ سَنَّ سُنَّةً حَسَنَةً فَلَهُ أَجْرُهَا وَأَجْرُ مَنْ عَمِلَ بِهَا إِلَى يَوْمِ الْقِيَامَةِ»\n> (هر کس سنت نیکویی بگذارد، پاداش آن و پاداش هر کس که تا روز قیامت به آن عمل کند، برای اوست.)\n\nپس، از پاداش اخروی مؤمن چیزی کم نمی‌شود، و ذمی پاداش خود را در دنیا دریافت می‌کند، یا به صورت منفعتی زودرس یا دفع ضرری زودرس، که این برای عامل در آخرت محقق می‌شود. و گاهی دنیا و آخرت برای او جمع می‌شود. عامل می‌بیند که آن تابوت‌ها چه اشیاء نفیس و اموالی را در بر دارند، و به او مژده داده شده است که اگر آن‌ها را حمل کند، مالک آن‌ها خواهد بود. به طوری که در محبت و عشق به آن‌ها فانی می‌شود (الفناء)، و حمل آن‌ها بر او آسان می‌گردد و به دلیل همت بلند، سبک می‌شود، و در آن مشقتی نمی‌یابد. این حال، همان لذت بردن از آزار و آنچه برای اهل ذمه نیکوست، می‌باشد. و دیگری به سنگینی آن نگاه می‌کند، و او مؤمنی است که کشف (الکشف) ندارد، جز صرف تصدیق خبر، و آن را سنگین‌بار می‌یابد. برخی از آنان به دلیل غلبه تصدیق به آنچه در آن است و حرص شدید و طمع در گرفتن و مالک شدن آن، با مشقت و زحمت آن را حمل می‌کنند، زیرا فرمان‌دهنده که آن را حمل می‌کند، به او گفته است: این به عنوان پاداش حمل تو، از آن توست. و برخی دیگر بر او سنگین می‌آید، پس مقداری از آن را بیرون می‌آورد و بر زمین می‌اندازد تا سنگینی‌ای که احساس می‌کند، از او کاسته شود. هنگامی که بارش با انداختن بخشی از آن سبک شد، باقی‌مانده را حمل می‌کند. و هر آنچه را که انداخته است، به آهن، سرب و مس تبدیل می‌شود و به تابوت‌هایی که در سمت چپ اوست، اضافه می‌گردد. و تابوت‌هایی که در سمت چپ او برپا شده‌اند، همگی پر از آهن، مس، قیر، آنک (سرب سیاه) و مانند آن هستند که سنگین‌اند و بوی ناخوشایند دارند. و به او گفته می‌شود: این تابوت‌ها را بر پشت خود حمل کن، به ترتیبی که در تابوت‌های سمت راست مقرر کردیم، و آن‌ها را به خانه‌ای که دارای شعله و سرمای شدید (زمهرير) است، برسان، و محتویات این تابوت‌ها ملک توست. و این همان قول خداوند متعال است:\n\n> «وَلَيَحْمِلُنَّ أَثْقَالَهُمْ وَأَثْقَالًا مَعَ أَثْقَالِهِمْ»\n> (و قطعاً بارهای خود و بارهای دیگری را همراه بارهای خود حمل خواهند کرد.)\n\nو قول پیامبر (صلی الله علیه و سلم):\n\n> «مَنْ سَنَّ سُنَّةً سَيِّئَةً فَلَهُ وِزْرُهَا وَوِزْرُ مَنْ عَمِلَ بِهَا إِلَى يَوْمِ الْقِيَامَةِ»\n> (هر کس سنت بدی بگذارد، گناه آن و گناه هر کس که تا روز قیامت به آن عمل کند، برای اوست.)\n\nو اگر برای مکاشف (صاحب کشف) در این منزل، صورت‌هایی حاضر نشود، معانی مجرد از مواد بر قلبش نازل می‌شود و جزئیات آن را می‌شناسد و حق هر چیزی را به مقام و محل آن ملحق می‌سازد، و برای آن زحمت و مشقتی نمی‌یابد، زیرا او با اراده مولای خود غرضی ندارد. پس او در عالم گشایش و انشراح است. و اگرچه اجسامشان از حمل برخی از آنچه مکلف شده‌اند، ضعیف باشد، اما امر شده است که جز به اندازه وسع نفس خود حمل نکند. نفس در اینجا عبارت است از کمال حس، زیرا نفس معنوی مشقتی ندارد، مگر زمانی که صاحب غرض باشد و به آنچه غرضی در آن ندارد، مکلف شود. به همین دلیل، انسان از حیث نفس خود معذور نیست، اما از حیث حس خود معذور است، زیرا آن از طاقت معمول او خارج است. و به این منزل، بخشی از علم به نشأت گرفتن فرشتگان (الملائكة) تعلق دارد، و اینکه آن‌ها از عالم طبیعت آفریده شده‌اند، مانند انسان‌ها، جز اینکه لطیف‌ترند، همان‌گونه که جن از انسان لطیف‌تر است، با وجود اینکه از آتش و آمیزه‌ای از آن است، و آتش از عالم طبیعت است. با این حال، آن‌ها روحانی هستند که شکل می‌گیرند و تمثل می‌یابند. اگر طبیعت این را نمی‌پذیرفت، عالم جن نیز آن را نمی‌پذیرفت. و چگونه این انکار شود، در حالی که قطعاً معلوم است که انسان از عالم طبیعت کثیف است و در او خزانه‌ای از خیال در جلوی مغزش وجود دارد که با آن هر محالی را که بخواهد تخیل می‌کند، چه رسد به ممکنات؟ همچنین فرشتگان (علیهم السلام) از عالم طبیعت هستند و آن‌ها آبادکنندگان افلاک و آسمان‌ها می‌باشند. خداوند به تو شناسانده است که:\n\n> «اسْتَوَى إِلَى السَّمَاءِ وَهِيَ دُخَانٌ فَسَوَّاهُنَّ سَبْعَ سَمَاوَاتٍ»\n> (به سوی آسمان که دودی بود توجه کرد، پس آن‌ها را به صورت هفت آسمان سامان داد.)\n\nو اهل آن را از آن قرار داد، و این همان قول اوست:\n\n> «وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا»\n> (و در هر آسمانی امر آن را وحی کرد.)\n\nو اختلافی نیست که دود از طبیعت است، هرچند فرشتگان اجسامی نورانی باشند، همان‌گونه که جن اجسامی ناری هستند. و اگر نور طبیعی نبود، به سوزاندن وصف نمی‌شد، همان‌گونه که آتش به خشک کردن و از بین بردن رطوبات وصف می‌شود. و این همه از صفات طبیعت است.\n\nسپس خداوند از ملأ اعلی خبر داده است که آن‌ها با یکدیگر خصومت می‌کنند، و خصومت از طبیعت است، زیرا طبیعت مجموع اضداد است، و منازعه و مخالفت عین خصومت است و جز بین دو ضد رخ نمی‌دهد. از همین باب است قول آن‌ها:\n\n> «أَتَجْعَلُ فِيهَا مَنْ يُفْسِدُ فِيهَا وَيَسْفِكُ الدِّمَاءَ»\n> (آیا در آن کسی را قرار می‌دهی که در آن فساد کند و خون‌ها بریزد؟)\n\nاین از طبیعت و غیرت آن‌ها بر ساحت الهی است. اگر آن‌ها بر روحانیت خود توقف می‌کردند، هنگامی که خداوند به آن‌ها فرمود:\n\n> «إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً»\n> (من در زمین جانشینی قرار می‌دهم.)\n\nچنین نمی‌گفتند، بلکه پاسخشان از حیث سرّ الهی که در آن‌هاست، این بود که بگویند: این به تو باز می‌گردد، منزهی تو، هر چه بخواهی انجام می‌دهی، و ما بندگان تحت امر تو هستیم و از کسی که ما را به اطاعت او امر کنی، اطاعت می‌کنیم. پس به همان دلیلی که فساد و غیره از انسان رخ داد که عالم طبع مقتضی آن است، اعتراض از فرشتگان واقع شد. آن‌ها آن را در دیگری دیدند و در نفس خود ندیدند، و این به دلیل همان چیزی است که مقرر کردیم که عشق به غرض، میان صاحبش و انجام آنچه شایسته است انجام دهد، حائل می‌شود. به همین دلیل خداوند به آن‌ها فرمود:\n\n> «إِنِّي أَعْلَمُ مَا لَا تَعْلَمُونَ»\n> (من چیزی را می‌دانم که شما نمی‌دانید.)\n\nسپس خداوند شرافت او (انسان) را بر آن‌ها نشان داد، با علمی که به اسماء الهی (الأسماء الإلهية) اختصاص داده بود، که مشارالیهم (انسان) با آن‌ها آفریده شده بود و فرشتگان از آن جاهل بودند. گویی سبحانه می‌فرماید: علم خود را هر جا که بخواهم از خلقم قرار می‌دهم و او را با آن گرامی می‌دارم. از اینجا آنچه را ذکر کردیم می‌آموزی، و علم به این امر به طور محقق و کامل در منزل خاص خود خواهد آمد، زیرا علوم این منازل بر دو بخش است: علومی که مختص به منزل است و در جای دیگر یافت نمی‌شود، و علومی که بخشی از آن در هر منزلی وجود دارد.\n\n### [قلب، محل گشایش الهی است]\n\nو بدان که اگرچه قلب محل سعه الهی است، اما سینه (صدر) محل سعه قلبی است، زیرا سینه به دلیل صدور (بیرون آمدن) نامیده شده است. به همین دلیل فرمود:\n\n> «وَلَكِنْ تَعْمَى الْقُلُوبُ الَّتِي فِي الصُّدُورِ»\n> (بلکه دل‌هایی که در سینه‌هاست کور می‌شود.)\n\nزیرا قلب در حال ورود، به دلیل آنچه جلال و هیبت اقتضا می‌کند و آنچه قرب الهی و تجلی (التجلی) می‌بخشد، تنگ می‌شود. و هنگامی که صادر می‌شود، گشاده و منبسط می‌گردد، زیرا او کَون است و به سوی کَون صادر می‌شود، پس به دلیل مناسبت، منبسط می‌گردد و شعاع‌های نورش با انبساط بر اکوان گسترش می‌یابد و به اینکه به این تعریف الهی بر ابناء جنس خود اختصاص یافته، شادمان می‌شود. به همین دلیل، اگر عارضه‌ای به او دست دهد که او را در غیر محل قبض، منقبض سازد، حق (الحق) او را تنبیه می‌کند و نعمتی را که خداوند بر او ارزانی داشته، یادآوری می‌کند تا نعمت الهی بر خود را به یاد آورد و میان او و تنگی‌ای که در آن بوده، حائل شود. پس این در ظاهر از جانب الهی است و در معنا رحمتی به این قلب است. از اینجاست که حق (الحق) بنده خود را بر آنچه به او منت نهاده، اقرار می‌دهد. اگر بگویی: خداوند ذکر کرده است که بر بندگانش منت می‌گذارد؟ می‌گوییم: این تنها زمانی آمده است که آنان بر رسول خدا (صلی الله علیه و سلم) به واسطه اسلام آوردنشان منت نهادند، پس خداوند به او فرمود: به آنان بگو ای محمد:\n\n> «بَلِ اللَّهُ يَمُنُّ عَلَيْكُمْ أَنْ هَدَاكُمْ لِلْإِيمَانِ»\n> (بلکه خداوند بر شما منت می‌گذارد که شما را به ایمان هدایت کرد.)\n\nیعنی اگر وارد حضرت (حضرة) منت شدید، منت از آن خداست نه از آن شما. پس این از علم تطابق است و قصد منت از آن نبوده است. خداوند چنین نبوده است که در مورد منت چیزی بگوید و خود آن را انجام دهد، همان‌گونه که پیامبر (صلی الله علیه و سلم) فرمود:\n\n> «مَا كَانَ اللَّهُ لِيَنْهَاكُمْ عَنِ الرِّبَا وَيَأْخُذَهُ مِنْكُمْ»\n> (خداوند چنین نبوده است که شما را از ربا نهی کند و خود آن را از شما بگیرد.)\n\nو خداوند چنین نبوده است که شما را به مکارم اخلاق از عفو و گذشت راهنمایی کند و با شما خلاف آن را انجام دهد. پس اگر از شما سفساف (پستی) اخلاق رخ داد، حق سبحانه اعمال شما را به خودتان بازگرداند، نه اینکه از جانب خود با شما به آن عمل کرده باشد، بلکه اعمال شما از شما فراتر نرفت. پس منت (المنة) که همان نعمت است، و امتنان که همان اعطای منت است، از آن خداست، نه منت (المن) [به معنای آزاردهنده]، منزه و متعالی است. و هنگامی که خداوند بخواهد بنده خود را نزد خلقش رفعت دهد، منزلت او را نزد خود به بندگانش یادآوری می‌کند؛ یا با تعریف، یا با آشکار ساختن آنچه جز برای مقربان از بندگانش ممکن نیست، بر دست او و در حال او. پس زبان‌ها برای او گشوده می‌شود و به علو مرتبه او نزد مولایش سخن می‌گویند، مانند گشودن باب شفاعت توسط پیامبر (صلی الله علیه و سلم) در روز قیامت که به آن بر سایر رسولان و انبیاء اختصاص یافت، و منار او در آن موطن بر همگان بلند می‌شود. در آنجا ریاست و علو طلب می‌شود، اما در دنیا، عارف باکی ندارد که نزد مردم چگونه صبح یا شام کرده است، زیرا آن‌ها در محل حجاب هستند و او در موطن تکلیف است. پس هر انسانی مشغول به نفس خود است و مطلوب به انجام آنچه به آن مکلف شده است. و از جمله آنچه این منزل در بر دارد، علم تنکیر (نکره بودن) است که همان تجلی (التجلی) عام است، و علم تعریف (معرفه بودن) که همان تجلی خاص است، و این در عام مندرج است؛ مانند اسم رب (الرب) که حق (الحق) در آن بر بندگانش تجلی می‌کند، که تجلی عام است، و هنگامی که در مانند قول او:\n\n> «فَوَرَبِّكَ»\n> (پس سوگند به پروردگارت)\n\nتجلی می‌کند، تجلی خاص است. اگرچه تجلیات از ربوبیت هستند، اما میان آن‌ها تفاوت وجود دارد. زیرا حالی که تو با پادشاه در مجلس عمومی داری، همان حالی نیست که با او در خلوت داری. پس برای این مقام و علم خاصی است و برای آن مقام و علم خاصی. و تجلی عام از نظر علم بیشتر و نافع‌تر است، و تجلی خاص از نظر قربت عظیم‌تر است.\n\n### [معرفت (المعرفة) اصل همه امور است]\n\nو بدان که اصل همه امور نزد ما معرفت (المعرفة) است، و نکره (تنکیر) عارضی است که طاری می‌شود. و هنگامی که عارض شود، ابهام و اشکال رخ می‌دهد. پس عارف کسی است که او را در حال تنکیر (نکره بودن) شناخته است. پس او در عموم نکره است، و در این حال، نزد عارف، معرفه در نکره است. هنگامی که گوینده می‌گوید: امروز با مردی سخن گفتم، «مرد» در اینجا نکره است، در حالی که نزد کسی که با او سخن گفته، در حال حکم کردن به نکره بودن، با تعیین، معرفه است. پس آنچه عارف از حق (الحق) در حال نکره بودن و انکار از عالم مشاهده می‌کند، عین معرفت (المعرفة) نزد اوست، زیرا او را بر اطلاقی که شایسته آن است، باقی گذاشته است، در حالی که عقاید او را مقید می‌سازند. پس عوام او را در تنکیر جاهل می‌دانند، و این مقامی است که برای عارفان فایده‌ای عظیم دارد.\n\n### [عدم توانایی عارف در درخواست از حق تعالی]\n\nو بدان که عارف در این منزل نمی‌تواند در امری از حق (الحق) سؤال کند، مگر از وجه اخص، نه از وجه اعم. و برای او صحیح نیست که در امری که در آن است، از حق سؤال کند، زیرا او از آنچه آن امر از ادب شایسته آن است، مشغول شده است. پس اگر حق آن را به طور حسی ادا کند، که مربوط به عبادات بدنی است، یا به طور معنوی، که مربوط به عبادات قلبی است، و حق بخواهد او را از آن عبادت منتقل سازد، عارف مراد حق را در آن نمی‌داند که به کدام مرتبه او را منتقل می‌کند؛ آیا او را به واجب دیگری منتقل می‌کند، یا مستحب، یا مباح، یا مکروه، یا محظور؟ پس او میان مقامی که از آن فارغ شده و امری که در علم خدا به سوی آن منتقل می‌شود، متوقف می‌ماند. در این هنگام، رسولی از جانب خدا به او می‌آید که در سرّ او ظاهر می‌شود و به او می‌گوید: خداوند به تو امر کرده است که به سوی او تضرع کنی و او را ترغیب نمایی و در مورد این امری که تو را به آن منتقل می‌کند، از او سؤال کنی. اگر برای تو حیاتی باقی مانده است، پس بگذار از واجبات باشد، و این همان مراد است. اگر نبود، پس از مستحبات باشد. اگر عنایت به اجابت سبقت نگرفت، پس از مباحات باشد. اگر نبود و نشانه‌هایی را دیدی که از پشت حجاب خذلان به سوی تو می‌درخشد و می‌دانی که به محظور یا مکروهی منتقل می‌شوی، پس از خداوند حضور با او را در آن امری که به آن منتقل می‌شوی، بخواه، و از او بخواه که در تو نسبت به آن امر کراهت قرار دهد و میان تو و معرفتت به اینکه انجام آن برای تو ناخوشایند است، حائل نشود. و اینکه علم الهی با وقوع آن از تو، در تو دگرگون نشود، تا جایی که اگر از تو واقع شد و تو بر این حالت بودی، حکم معصیت به کلی در تو باقی نماند و حکم در آن برای قدر باشد. پس اگر عقوبت بر کسی که حالش چنین است، به دلیل مخالفت از یکی از وجوه آن، متوجه شود، عفو، غفور و رحیم متوجه می‌شوند، و آن‌ها اسم‌هایی هستند که مخالفت آن‌ها را می‌طلبد، و با اسم‌هایی که کراهت تو نسبت به آن فعل و ایمان به قدر سابق در آن را می‌طلبند، یاری می‌جوینند. و دست خدا با جماعت است. پس غلبه و حکم برای این اسم‌ها خواهد بود که سعادت و خیر را به او می‌دهند، با وجود وقوع معصیت. و معصیت او با حضورش در آن همراه با خدا، زنده و دارای روح الهی است که تا روز قیامت برای او استغفار می‌کند و خداوند بدی آن را به نیکی تبدیل می‌کند، همان‌گونه که عقوبت آن را به پاداش تبدیل کرد.\n\n> «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ»\n> (و خداوند حق را می‌گوید و او راه را هدایت می‌کند.)"
  },
  "page_count": 4
}