{
  "id": 321,
  "title": {
    "ar": "الباب الأحد والعشرون وثلاثمائة في معرفة منزل من فرق بين عالم الشهادة وعالم الغيب وهو من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Twenty-One: On the Gnosis (معرفة) of the Station (منزل) of him who distinguishes between the World of Witnessing (عالم الشهادة) and the World of the Unseen (عالم الغيب), and who belongs to the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو اکیس: اس شخص کی منزل کی معرفت میں جو عالمِ شہادت اور عالمِ غیب کے درمیان فرق کرتا ہے، اور وہ الحضرة المحمدیۃ (الحضرة المحمدية) سے ہے۔",
    "fa": "باب سیصد و بیست و یکم در شناخت منزل کسی که میان عالم شهود و عالم غیب فرق گذاشت، و او از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب الأحد والعشرون وثلاثمائة في معرفة منزل من فرق بين عالم الشهادة وعالم الغيب وهو من الحضرة المحمدية»\n\n\n> للعقل نور وللإيمان أنوار *** إن البصائر للابصار أبصار\n\n\n> العين والسمع والإحساس أجمعه *** للعقل في الكسب أعوان وأنصار\n\n\n> بالعين تبصر علم الغيب لا بحجى *** لا يحجبنك أوهام وأفكار\n\n\n> من لم يحصل علوم الغيب عن بصر *** فإنها خلف ستر الصون أبكار\n\n\n> قالوا اعتبر أن في الأكوان معرفة *** الدار تجهل رب الدار يا دار\n\n\n### [أن الوجود مقسم بين عابد ومعبود]\n\n\nاعلم أيها الولي الحميم أن الوجود مقسم بين عابد ومعبود فالعابد كل ما سوى الله تعالى وهو العالم المعبر عنه والمسمى عبدا والمعبود هو المسمى الله وما في الوجود إلا ما ذكرناه فكل ما سوى الله عبد لله ما خلق ويخلق وفيما ذكرناه أسرار عظيمة تتعلق بباب المعرفة بالله وتوحيده وبمعرفة العالم ورتبته وبين العلماء في هذه المسألة من الخلاف ما لا يرتفع أبدا ولا يتحقق فيه قدم يثبت عليه ولهذا قدر الله السعادة لعباده بالإيمان وفي العلم بتوحيد الله خاصة ما ثم طريق إلى السعادة إلا هذان فالإيمان متعلقة الخبر الذي جاءت به الرسل من عند الله وهو تقليد محض نقبله سواء علمناه أو لم نعلمه والعلم ما أعطاه النظر العقلي أو الكشف الإلهي وإن لم يكن هذا العلم يحصل ضرورة حتى لا تقدح فيه الشبه عند العالم به وإلا فليس بعلم‏\n\n\n### [العالم عالمان عالم الغيب وعالم الشهادة]\n\n\nثم نقول والعالم عالمان ما ثم ثالث عالم يدركه الحس وهو المعبر عنه بالشهادة وعالم لا يدركه الحس وهو المعبر عنه بعالم الغيب فإن كان مغيبا في وقت وظهر في وقت للحس فلا يسمى ذلك غيبا وإنما الغيب ما لا يمكن أن يدركه الحس لكن يعلم بالعقل إما بالدليل القاطع وإما بالخبر الصادق وهو إدراك الايمان فالشهادة مدركها الحس وهو طريق إلى العلم ما هو عين العلم وذلك يختص بكل ما سوى الله ممن له إدراك حسي والغيب مدركه العلم عينه وفيما ذكرناه تاهت العقول وحارت الألباب ثم إن الإنسان إذا دخل هذه الطريقة التي نحن عليها وأراد أن يتميز في علمائها وساداتها فينبغي له أن لا يقيد نفسه إلا بالله وحده وهو التقييد الذاتي له الذي لا يصح له الانفكاك عنه جملة واحدة وهي عبودية لا تقبل الحرية بوجه من الوجوه وملك لا يقبل الزوال وإذا لم يقيد الإنسان نفسه إلا بما هو مقيد به في ذاته وهو كما قلنا تقييده بالله الذي خَلَقَهُ فَقَدَّرَهُ ثُمَّ السَّبِيلَ يَسَّرَهُ فينبغي له إذ كانت له هذه المرتبة ولا بد أن لا يقف بنفسه إلا في البرزخ وهو المقام المتوهم الذي لا وجود له إلا في الوهم بين عالم الشهادة والغيب بحيث أن لا يخرج شي‏ء من الغيب المغيب الذي يتصف في وقت بالشهادة لا بالغيب الذي لا يستحيل عليه إن يكون شهادة بوجه من الوجوه إلا وهذا الواقف يعلمه فإذا برز إلى عالم الشهادة وأدركه فلا يخلو إما أن يبقى في عالم الشهادة أو لا يبقى كالأعراض فإن لم يبق فلا بد أن يفارق الشهادة وإذا فارق الشهادة فإنه يدخل إلى الغيب الذي لا يمكن أن يدرك أبدا شهادة ولا يكون له رجوع بعد ظهوره إلى الغيب الذي خرج منه لأن مقام الغيب الذي خرج منه هو الغيب الإمكانى والذي انتقل إليه بعد حصوله في الشهادة الغيب المحالي فذلك الغيب المحالي لا يظهر عنه أبدا شي‏ء يتصف بالشهادة ولما لم يكن هذا الذي انتقل إليه يتصف بالشهادة وقتا ما أو حالا ما لذلك دخل في ذلك الغيب ولم يرجع إلى الغيب الذي خرج منه وإذا وقف الإنسان في هذا المقام وتحقق به أخذه الحق وأوقفه بينه وبين كل ما سواه من نفسه ومن غيره أعني من نفس العبد فيرى نفسه وعينه وهو خارج عنها في ذلك المقام الذي أوقفه ويراها مع من سواه من العالم وهو عينه كما رأى آدم نفسه وذريته في قبضة الحق وهو خارج عن قبضة الحق التي رأى نفسه فيها في حال رؤيته نفسه خارجا عنها كما ورد في الخبر الإلهي فإذا وقف في هذا المقام وهو أرفع مقامات الكشف وكل مقام فهو دونه وهذا كان مقام الصديق رضي الله عنه الذي فضل به على من شهد له رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أنه فضل عليه إما من الحاضرين أو من الأمة لا يدري أي ذلك أراد صَلَّى اللهُ عَليهِ وسَلَّم إلا من جاءه الخبر الصدق في كشفه لا غير فإذا وقف في هذا المقام استشرف على الغيبين الغيب الذي يوجد منه الكائنات والغيب الذي ينتقل إليه بعض الكائنات بعد اتصافها بالشهادة وهذه‏\nمسألة جليلة القدر لا يعلمها كثير من الناس أعني هذه الأمور التي خرجت من الغيب إلى الشهادة ثم انتقلت إلى الغيب وهي الأعراض الكونية هل هي أمور وجودية عينية أو هي أحوال لا تتصف بالعدم ولا بالوجود ولكن تعقل فهي نسب وهي من الأسرار التي حار الخلق فيها ليست هي الله ولا لها وجود عيني فتكون من العالم أو تكون مما سوى الله فهي حقائق معقولة إذا نسبتها إلى الله عز وجل قبلها ولم تستحل عليه وإذا نسبتها إلى العالم قبلها ولم تستحل عليه ثم إنها تنقسم إلى قسمين في حق الله فمنها ما يستحيل نسبته إلى الله فلا تنسب إليه ومنها ما لا تستحيل عليه فالذي لا يستحيل على الله يقبله العالم كله إلا نسبة الإطلاق فإن العالم لا يقبله ونسبة التقييد يقبله العالم ولا يقبله الله وهذه الحقائق المعقولة لها الإطلاق الذي لا يكون لسواها فيقبلها الحق والعالم وليست من الحق ولا من العالم ولا هي موجودة ولا يمكن أن ينكر العقل العالم بها فمن هنا وقعت الحيرة وعظم الخطب وافترق الناس وحارت الحيرات فلا يعلم ذلك إلا الله ومن أطلعه الله على ذلك وذلك هو الغيب الصحيح الذي لا يوجد منه شي‏ء فيكون شهادة ولا ينتقل إليه بعد الشهادة وما هو محال فيكون عدما محضا ولا هو واجب الوجود فيكون وجودا محضا ولا هو ممكن يستوي طرفاه بين الوجود والعدم وما هو غير معلوم بل هو معقول معلوم فلا يعرف له حد ولا هو عابد ولا معبود وكان إطلاق الغيب عليه أولى من إطلاق الشهادة لكونه لا عين له يجوز أن تشهد وقتا ما فهذا هو الغيب الذي انفرد الحق به سبحانه حيث قال عالِمُ الْغَيْبِ وما قرنه بالشهادة فَلا يُظْهِرُ عَلى‏ غَيْبِهِ أَحَداً والغيب الذي قرنه بالشهادة هو الذي يقابل الشهادة فوصف الحق نفسه بعلم المتقابلين فقال عالِمُ الْغَيْبِ والشَّهادَةِ هذا هو المراد هنا وإن اشترك هذا مع الغيب في الاسمية فإن قلت فما فائدة الاستثناء في قوله إِلَّا من ارْتَضى‏ من رَسُولٍ قلنا تدبر ما هو الغيب الذي اطلع عليه الرسل وبما ذا ربطه فتعلم إن ذلك علم التكليف الذي غاب عنه العباد ولهذا جعل له الملائكة رصدا حذرا من الشياطين أن تلقي إليه ما ينقله إلى الخلق ويعمل به في نفسه من التكليف الذي جعله الله طريقا إلى سعادة العباد من أمر ونهي لِيَعْلَمَ أَنْ قَدْ أَبْلَغُوا رِسالاتِ رَبِّهِمْ فكأنه مستثنى منقطع أي انقطع هذا الغيب من ذلك الغيب انقطاعا حقيقيا لا انقطاع جزء من كل لما وقع الاشتراك في لفظة الغيب لذلك قلنا مستثنى ولما خالفه في الحقيقة قلنا منقطع بخلاف المستثنى المتصل فإنه أيضا منقطع ولكن بالحال لا بالذات تقول في المتصل ما في الدار إنسان إلا زيدا فهذا المستثنى متصل لأنه إنسان قد فارق غيره من الأناسي بحالة كونه في الدار لا بحقيقته إذ لم يكن في الدار إنسان إلا هو فالانقطاع في الحال لا غير فإذا قلت ما في الدار إنسان إلا حمارا فهذا منقطع بالحقيقة والحال فكذلك الغيب الذي يطلع عليه الرسل بالرصد من الملائكة من أجل المردة من الشياطين هو الرسالة التي يبلغونها عن الله ولهذا قال لِيَعْلَمَ أَنْ قَدْ أَبْلَغُوا رِسالاتِ رَبِّهِمْ فأضاف الرسالة إلى قوله ربهم لما علموا إن الشياطين لم تلق إليهم أعني إلى الرسل شيئا فتيقنوا إن تلك رسالة من الله لا من غيره وهل هذا القدر الذي عبر عنه في هذه السورة المعينة في قوله إِلَّا من ارْتَضى‏ من رَسُولٍ هل ذلك الإعلام لهذا الرسول بوساطة الملك أو لم يكن في هذا الوحي الخاص ملك وهو الأظهر والأوجه والأولى وتكون الملائكة تحف أنوارها برسول الله صَلَّى اللهُ عَليهِ وسَلَّم كالهالة حول القمر والشياطين من ورائها لا تجد سبيلا إلى هذا الرسول حتى يظهر الله له في إعلامه ذلك من الوحي ما شاء ولكن من علم التكليف الذي غاب عنه وعن العباد علمه خلافا لمخالفي أهل الحق في ذلك إذ يرون أن العبد يعلم بعض‏\n\n\nالقربات إلى الله بعقله لا كلها وهذا القول لا يصح منه شي‏ء فلا يعلم القربة إلى الله التي تعطي سعادة الأبد للعبد إلا من يعلم ما في نفس الحق ولا يعلم ذلك أحد من خلق الله إلا بإعلام الله كما قال ولا يُحِيطُونَ بِشَيْ‏ءٍ من عِلْمِهِ إِلَّا بِما شاءَ فليس‏\n\n\nفي كتابنا هذا ولا في غيره أصعب من تصور هذه المسألة على كل طائفة\n\n\n### [إن الله إذا أوقف العبد علم أنه معتنى به‏]\n\n\nواعلم أن العبد إذا أوقفه الحق تعالى كما قلنا بين الله وبين كل ما سواه وهذه بينية إله وعبد لا بينية حد فإن الله يتعالى جده أن يعلم حده فإذا وقف العبد في هذا المقام علم أنه معتنى به حيث شغله الله تعالى بمطالعة الانفعالات عنه وإيجاد الأعيان من قدرته تعالى واتصافها بالوجود في حضرة إمكانها ما أخرجها منها ولا حال بينها وبين موطنها لكنه كساها خلعة الوجود فاتصفت به بعد أن كانت موصوفة بالعدم مع ثبوت العين في الحالين وبقي الكلام في ذلك الوجود الذي كساه الحق لهذا الممكن ولم يخرجه عن موطنه ما هو ذلك الوجود هل كان معدوما ووجد فالوجود لا يكون عدما\nولا موجودا وإن كان معدوما فما حضرته إن كانت الإمكان فلا فرق بينه وبين هذه العين التي خلع عليها الوجود فإن الوجود من حيث ما هو معدوم في هذه الحضرة محتاج إلى وجود وهذا يتسلسل ويؤدي إلى محال وهو أن لا توجد هذه العين وقد وجدت وما خرجت هذه العين عن حضرة الإمكان فكيف الأمر\n\n\n### [إن الوجود كالصورة التي في المرآة]\n\n\nفاعلم إن الوجود لهذه العين كالصورة التي في المرآة ما هي عين الرائي ولا غير عين الرائي ولكن المحل المرئي فيه به وبالناظر المنجلي فيه ظهرت هذه الصورة فهي مرآة من حيث ذاتها والناظر ناظر من حيث ذاته والصورة الظاهرة تتنوع بتنوع العين الظاهرة فيها كالمرآة إذا كانت تؤخذ طولا ترى الصورة على طولها والناظر في نفسه على غير تلك الصورة من وجه وعلى صورته من وجه فلما رأينا المرآة لها حكم في الصورة بذاتها ورأينا الناظر يخالف تلك الصورة من وجه علمنا إن الناظر في ذاته ما أثرت فيه ذات المرآة ولما لم يتأثر ولم تكن تلك الصورة هي عين المرآة ولا عين الناظر وإنما ظهرت من حكم التجلي للمرآة علمنا الفرق بين الناظر وبين المرآة وبين الصورة الظاهرة في المرآة التي هي غيب فيها ولهذا إذا رؤي الناظر يبعد عن المرآة يرى تلك الصورة تبعد في باطن المرآة وإذا قرب قربت وإذا كانت في سطحها على الاعتدال ورفع الناظر يده اليمنى رفعت الصورة اليد اليسرى تعرفه أني وإن كنت من تجليك وعلى صورتك فما أنت أنا ولا أنا أنت فإن عقلت ما نبهناك عليه فقد علمت من أين اتصف العبد بالوجود ومن هو الموجود ومن أين اتصف بالعدم ومن هو المعدوم ومن خاطب ومن سمع ومن عمل ومن كلف وعلمت من أنت ومن ربك وأين منزلتك وأنك المفتقر إليه سبحانه وهو الغني عنك بذاته قال بعض الرجال ما في الجبة إلا الله وأراد هذا المقام يريد أنه ما في الوجود إلا الله كما لو قلت ما في المرآة إلا من تجلى لها لصدقت مع علمك أنه ما في المرآة شي‏ء أصلا ولا في الناظر من المرآة شي‏ء مع إدراك التنوع والتأثر في عين الصورة من المرآة وكون الناظر على ما هو عليه لم يتأثر فسبحان من ضرب الأمثال وأبرز الأعيان دلالة عليه أنه لا يشبهه شي‏ء ولا يشبه شيئا وليس في الوجود إلا هو ولا يستفاد الوجود إلا منه ولا يظهر لموجود عين إلا بتجليه فالمرآة حضرة الإمكان والحق الناظر فيها والصورة أنت بحسب إمكانيتك فأما ملك وإما فلك وإما إنسان وإما فرس مثل الصورة في المرآة بحسب ذات المرآة من الهيئة في الطول والعرض والاستدارة واختلاف أشكالها مع كونها مرآة في كل حال كذلك الممكنات مثل الأشكال في الإمكان والتجلي الإلهي يكسب الممكنات الوجود والمرآة تكسبها الأشكال فيظهر الملك والجوهر والجسم والعرض والإمكان هو هو لا يخرج عن حقيقته وأوضح من هذا البيان في هذه المسألة لا يمكن إلا بالتصريح فقل في العالم ما تشاء وانسبه إلى من تشاء بعد وقوفك على هذه الحقيقة كشفا وعلما فإن وقفت عن إطلاق أمر تعطيك الحقيقة إطلاقه فما تتوقف إلا شرعا أدبا مع الله الذي له التحجير عليك فاعتمد على الأدب الإلهي وتقرب إلى الله بما أمرك أن تتقرب إليه به حتى يكشف لك عنك فتعرف نفسك فتعرف ربك وتعرف من أنت ومن هو والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ وفي هذا المنزل علم الوجهين وعلم الحضرة التي يكون فيها عين الصدق من عين الكذب وعلم ما يستتر به العبد مما يكون فيه شقاؤه وعلم اختلاف الأحوال وعلم الختم وعلم العدد وخواصه وعلم التشبيه وعلم الإنسان من حيث طبيعته لا غير وعلم السوابق واللواحق وعلم الأرزاق والخزائن وعلم الحجب المانعة وعلم التمليك وعلم الجود المتوجه وعلم اتفاق الوكيل من مال موكله وتصرفه فيه تصرف المالك مع كون المال ليس له وعلم التمني وعلم القضاء والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ وأقول سبحانك اللهم وبحمدك لا إله إلا أنت أستغفرك وأتوب إليك‏\n\n",
    "en": "Chapter Three Hundred and Twenty-One: Concerning the knowledge of the station of one who distinguishes between the World of Witnessing and the World of the Unseen, and this station is from the Muhammadan Presence (الحضرة المحمدية).\n\nThe intellect possesses a light, and faith possesses lights;\nTruly, the inner visions (البصائر) are the sights for the outer perceptions (الأبصار).\n\nThe eye, hearing, and all sensation combined\nAre helpers and supporters for the intellect in its acquisition [of knowledge].\n\nWith the eye [of the heart] you perceive the knowledge of the Unseen (علم الغيب), not merely by reason (حجى);\nLet not illusions (أوهام) and thoughts (أفكار) veil you.\n\nWhoever does not attain the sciences of the Unseen (علوم الغيب) through [inner] sight,\nThose sciences remain virgins behind the veil of preservation.\n\nThey said: Reflect that in the existent things (الأكوان) there is Gnosis (معرفة).\nO dwelling, you are ignorant of the Lord of the dwelling!\n\n### That Existence is divided between Worshipper and Worshipped\n\nKnow, O intimate friend (الولي الحميم), that Existence (الوجود) is divided between a worshipper (عابد) and the Worshipped (معبود). The worshipper is everything other than Allah the Exalted—that is, the World (العالم), which is expressed and named as the servant (عبد). The Worshipped is He who is named Allah. There is nothing in Existence (الوجود) except what We have mentioned. Thus, everything other than Allah is a servant (عبد) to Allah, whether created or being created. In what We have mentioned are tremendous secrets related to the door of Gnosis of Allah (المعرفة بالله) and His Unity (توحيده), and to the knowledge of the World (العالم) and its degree (رتبته). Among scholars, there is a disagreement regarding this issue that will never be resolved, nor can a firm footing be established upon it. For this reason, Allah decreed felicity (السعادة) for His servants through Faith (الإيمان). Regarding the knowledge of Allah’s Unity (توحيد الله) specifically, there is no path to felicity except these two. Faith (الإيمان) relates to the report (الخبر) brought by the Messengers from Allah, and it is pure imitation (تقليد محض) that we accept, whether we understand it or not. Knowledge (العلم) is what is granted by rational speculation (النظر العقلي) or Divine Unveiling (الكشف الإلهي). If this knowledge is not attained necessarily, such that doubts (الشبه) cannot undermine the one who possesses it, then it is not [true] knowledge.\n\n### The World is two worlds: the World of the Unseen and the World of Witnessing\n\nWe then say: The World (العالم) consists of two worlds, and there is no third. A world perceived by the senses (الحس), which is expressed as Witnessing (الشهادة), and a world not perceived by the senses, which is expressed as the World of the Unseen (عالم الغيب). If something is hidden (مغيب) at one time and appears to the senses at another, it is not called the Unseen (غيب). Rather, the Unseen is that which the senses cannot possibly perceive, but which is known by the intellect (العقل), either through decisive proof (الدليل القاطع) or through the truthful report (الخبر الصادق)—which is the apprehension of Faith (إدراك الايمان). The object of Witnessing (الشهادة) is sensory perception (الحس), and this is a path to knowledge, not knowledge itself. This applies to everything other than Allah that possesses sensory perception. The object of the Unseen (الغيب) is knowledge itself (العلم عينه). In what We have mentioned, intellects have strayed and minds have been bewildered. Furthermore, when a human being enters this Path (الطريقة) upon which we stand, and wishes to distinguish himself among its scholars and masters, he should restrict himself only to Allah alone. This is his essential restriction (التقييد الذاتي) from which he cannot entirely separate himself. It is a servitude (عبودية) that accepts no freedom whatsoever, and a dominion that accepts no cessation. If the human being restricts himself only by that which he is essentially restricted—which, as We said, is his restriction by Allah Who created him, then proportioned him, then eased the way for him—then, since this degree (المرتبة) is necessarily his, he must not stand except in the Isthmus (البرزخ). This is the imagined station (المقام المتوهم) that has no existence except in imagination (الوهم), situated between the World of Witnessing (عالم الشهادة) and the World of the Unseen (عالم الغيب). The condition is that nothing emerges from the hidden Unseen (الغيب المغيب)—which is sometimes described as Witnessing, not from the Unseen that cannot possibly become Witnessing in any way—unless this one standing [in the Isthmus] knows it. When it emerges into the World of Witnessing and is perceived, it either remains in the World of Witnessing or it does not remain, like the accidents (الأعراض). If it does not remain, it must depart from Witnessing. When it departs from Witnessing, it enters into the Unseen (الغيب) which can never be perceived as Witnessing, nor does it return, after its manifestation, to the Unseen from which it emerged. This is because the station of the Unseen from which it emerged is the Possible Unseen (الغيب الإمكاني), while the Unseen to which it transfers after its presence in Witnessing is the Impossible Unseen (الغيب المحالي). That Impossible Unseen never manifests anything that can be described as Witnessing. Since that to which it transferred is never described as Witnessing at any time or state, it entered into that Unseen and did not return to the Unseen from which it emerged. When the human being stands in this station (المقام) and is realized therein, the Real (الحق) takes him and stations him between Himself and everything other than Him, both from his own self and from others—meaning, from the servant’s own self. Thus, he sees his self and his essence (عينه) while being outside of it in that station where the Real stationed him. He sees it along with the rest of the World (العالم) which is his very essence (عينه), just as Adam saw himself and his progeny in the grasp of the Real (قبضة الحق) while he was outside the grasp of the Real in which he saw himself, as mentioned in the Divine Report (الخبر الإلهي). When he stands in this station—which is the highest of the stations of Unveiling (مقامات الكشف), and every other station is below it—and this was the station of the Veracious One (الصديق) [Abu Bakr], by which he was favored over those whom the Messenger of Allah (peace and blessings be upon him) testified were favored over him, whether they were present or from the Community (الأمة)—only the one to whom the truthful report comes in his own unveiling (كشفه) knows which of these the Prophet intended. When he stands in this station, he overlooks the two Unseens: the Unseen from which existent things (الكائنات) emerge, and the Unseen to which some existent things transfer after being described by Witnessing. This is a matter of great import (مسألة جليلة القدر) that many people do not know—I mean these matters which emerged from the Unseen into Witnessing and then transferred back to the Unseen, namely the cosmic accidents (الأعراض الكونية). Are they existent, essential matters (أمور وجودية عينية), or are they states (أحوال) that are described neither by non-existence (العدم) nor by existence (الوجود), but are intelligible? They are relations (نسب) and are among the secrets that have bewildered creation. They are not Allah, nor do they have essential existence (وجود عيني) such that they would be part of the World (العالم) or part of what is other than Allah. Rather, they are intelligible realities (حقائق معقولة). If you relate them to Allah the Mighty and Majestic, He accepts them and they are not impossible for Him. If you relate them to the World, it accepts them and they are not impossible for it. Furthermore, they are divided into two categories regarding Allah: some are impossible to relate to Allah, so they are not related to Him; and some are not impossible for Him. That which is not impossible for Allah is accepted by the entire World, except for the relation of absolute freedom (الإطلاق), for the World does not accept it. The relation of restriction (التقييد) is accepted by the World but not by Allah. These intelligible realities (الحقائق المعقولة) possess the absolute freedom (الإطلاق) that nothing else possesses, and thus the Real (الحق) and the World accept them, yet they are neither from the Real nor from the World, nor are they existent. Yet, the intellect cannot deny the World that possesses them. It is from this point that confusion arose, the matter became grave, people diverged, and perplexities multiplied. None knows this except Allah and the one whom Allah informs of it. That is the true Unseen (الغيب الصحيح) from which nothing emerges to become Witnessing, nor does anything transfer to it after Witnessing. It is not impossible (محال) so as to be pure non-existence (عدما محضا), nor is it Necessary of Existence (واجب الوجود) so as to be pure existence (وجودا محضا), nor is it possible (ممكن) whose two sides (existence and non-existence) are equal. Yet, it is not unknown; rather, it is intelligible and known (معقول معلوم). No limit is known for it, nor is it a worshipper (عابد) nor the Worshipped (معبود). Applying the term Unseen (الغيب) to it is more appropriate than applying the term Witnessing (الشهادة), because it has no essence (عين) that could possibly be witnessed at any time. This is the Unseen with which the Real (الحق), glory be to Him, is uniquely characterized, where He said: <<عالِمُ الْغَيْبِ>> (Knower of the Unseen), and He did not couple it with Witnessing: <<فَلا يُظْهِرُ عَلى‏ غَيْبِهِ أَحَداً>> (He does not disclose His Unseen to anyone). The Unseen that He coupled with Witnessing is that which is opposite to Witnessing. Thus, the Real described Himself as knowing the two opposites, saying: <<عالِمُ الْغَيْبِ والشَّهادَةِ>> (Knower of the Unseen and the Witnessing). This is what is intended here, even though this shares the name 'Unseen' with the former. If you ask, \"What is the benefit of the exception in His saying: <<إِلَّا من ارْتَضى‏ من رَسُولٍ>> (Except for a messenger whom He has approved)?\" We say: Reflect upon what the Unseen is that the Messengers are informed of, and with what He connected it. You will then know that it is the knowledge of religious obligation (علم التكليف) that is hidden from the servants. For this reason, He appointed guardian angels (رصدا) over it, fearing that the devils might cast something to the Messenger that he would convey to creation and act upon himself, concerning the religious obligations that Allah made a path to the felicity of the servants, consisting of command and prohibition, <<لِيَعْلَمَ أَنْ قَدْ أَبْلَغُوا رِسالاتِ رَبِّهِمْ>> (So that He may know that they have conveyed the messages of their Lord). It is as if this is a discontinuous exception (مستثنى منقطع)—meaning, this Unseen is truly disconnected from that [other] Unseen, not a part disconnected from a whole. Because the term 'Unseen' is shared, We said 'exception' (مستثنى), and because it differs in reality, We said 'discontinuous' (منقطع), unlike the continuous exception (المستثنى المتصل), which is also disconnected, but by state, not by essence (بالحال لا بالذات). You say in the continuous exception: \"There is no man in the house except Zayd.\" This exception is continuous because Zayd is a man who has separated himself from other men by the state of being in the house, not by his reality, since he was the only man in the house. Thus, the disconnection is only in the state. If you say, \"There is no man in the house except a donkey,\" this is discontinuous by reality and state. Similarly, the Unseen that the Messengers are informed of, guarded by angels against the rebellious devils, is the Message (الرسالة) they convey from Allah. For this reason, He said: <<لِيَعْلَمَ أَنْ قَدْ أَبْلَغُوا رِسالاتِ رَبِّهِمْ>> (So that He may know that they have conveyed the messages of their Lord), attributing the message to \"their Lord\" because they knew that the devils had cast nothing to them—meaning, to the Messengers—and thus they were certain that it was a message from Allah and not from another. Is this measure, expressed in this specific verse <<إِلَّا من ارْتَضى‏ من رَسُولٍ>> (Except for a messenger whom He has approved), an informing of this Messenger through the mediation of an angel, or was there no angel in this specific revelation (الوحي الخاص)? The latter is the more apparent, preferable, and appropriate view. The angels would then surround the Messenger of Allah (peace and blessings be upon him) with their lights, like a halo around the moon, and the devils would be behind them, finding no way to reach this Messenger until Allah reveals to him, in that informing, whatever He wills. However, this is from the knowledge of religious obligation (علم التكليف) that was hidden from him and from the servants—contrary to those who oppose the People of the Real (أهل الحق), who believe that the servant knows some acts of proximity (القربات) to Allah by his intellect, but not all of them. This opinion is entirely unsound. The act of proximity to Allah that grants eternal felicity (سعادة الأبد) to the servant is known only by one who knows what is in the Essence of the Real (نفس الحق), and none of Allah’s creation knows that except by Allah’s informing, as He said: <<ولا يُحِيطُونَ بِشَيْ‏ءٍ من عِلْمِهِ إِلَّا بِما شاءَ>> (And they encompass nothing of His knowledge except what He wills). There is nothing in this book of ours, nor in any other, more difficult for every faction to conceive than this issue.\n\n### When Allah stations the servant, he knows that he is cared for\n\nKnow that when the Real (الحق تعالى) stations the servant, as We said, between Allah and everything other than Him—and this is an intermediacy of God and servant (بينية إله وعبد), not an intermediacy of limit (حد), for Allah’s majesty is too exalted for His limit to be known—when the servant stands in this station, he knows that he is cared for, since Allah the Exalted occupies him with contemplating the effects (الانفعالات) proceeding from Him, and the bringing forth of the Entities (الأعيان) from His power (قدرته تعالى), and their being described by Existence (الوجود) in the Presence of their Possibility (حضرة إمكانها). He did not remove them from that Presence, nor did He intervene between them and their abode, but He clothed them in the robe of Existence (خلعة الوجود). Thus, they were described by Existence after having been described by non-existence (العدم), while the Entity (العين) remained fixed (ثابتة) in both states. The discussion remains concerning that Existence (الوجود) with which the Real clothed this possible thing (الممكن) without removing it from its abode: What is that Existence? Was it non-existent and then found? Existence (الوجود) cannot be non-existence (عدما) nor existent (موجودا). If it was non-existent, what is its Presence (حضرة)? If it is Possibility (الإمكان), then there is no difference between it and this Entity (العين) upon which Existence was bestowed. For Existence, insofar as it is non-existent in this Presence, requires existence, and this leads to an infinite regress (تسلسل) and results in an impossibility (محال)—namely, that this Entity should not exist, yet it has existed, and this Entity has not departed from the Presence of Possibility. How is this matter to be understood?\n\n### Existence is like the image in the mirror\n\nKnow that Existence (الوجود) for this Entity (العين) is like the image (الصورة) in the mirror (المرآة). It is neither the essence of the viewer (عين الرائي) nor other than the essence of the viewer. Rather, the locus (المحل) in which the image is seen, by means of the viewer and the one who manifests (المنجلي) therein, is where this image appeared. The mirror is a mirror by virtue of its essence (ذاتها), and the viewer is a viewer by virtue of his essence. The manifest image (الصورة الظاهرة) varies according to the variation of the eye (العين) manifesting in it. For instance, if the mirror is taken lengthwise, the image is seen lengthwise, while the viewer himself is of a different form in one respect, and of his own form in another respect. When we saw that the mirror has a ruling over the image by its own essence, and we saw that the viewer differs from that image in one respect, we knew that the essence of the mirror did not affect the viewer in his essence. Since the viewer was not affected, and since that image was neither the essence of the mirror nor the essence of the viewer, but rather appeared from the ruling of the Theophany (التجلي) upon the mirror, we knew the difference between the viewer, the mirror, and the image appearing in the mirror, which is Unseen (غيب) within it. For this reason, if the viewer is seen moving away from the mirror, that image is seen moving away within the mirror’s interior; and if he approaches, it approaches. If the mirror is on a level surface, and the viewer raises his right hand, the image raises its left hand, informing him: \"Although I am from your Theophany (تجليك) and upon your form, you are not me, nor am I you.\" If you have understood what We have drawn your attention to, you have known from where the servant (العبد) is described by Existence (الوجود), and Who the Existent (الموجود) is; and from where he is described by non-existence (العدم), and Who the non-existent (المعدوم) is; and who addressed, who heard, who acted, and who was obligated. You have known who you are, and who your Lord is, and where your station (منزلتك) is, and that you are the one in need of Him, glory be to Him, and He is the One Who is Self-Sufficient (الغني) from you by His Essence (بذاته). Some men said, \"There is nothing in the cloak (الجبة) except Allah,\" intending this station (المقام). He meant that there is nothing in Existence (الوجود) except Allah. If you were to say, \"There is nothing in the mirror except the one who manifests to it,\" you would speak truly, even while knowing that there is nothing in the mirror at all, nor is there anything of the mirror in the viewer, alongside the apprehension of variation and effect in the essence of the image due to the mirror, while the viewer remains as he is, unaffected. Glory be to Him Who strikes the similitudes (الأمثال) and brings forth the Entities (الأعيان) as a sign that nothing resembles Him and He resembles nothing, and there is nothing in Existence (الوجود) except Him, and Existence is not derived except from Him, and no entity (عين) appears to an existent thing except through His Theophany (بتجليه). The mirror is the Presence of Possibility (حضرة الإمكان), and the Real (الحق) is the Viewer in it, and the image is you, according to your possibility (إمكانيتك)—whether an angel, a celestial sphere, a human, or a horse—just like the image in the mirror according to the mirror’s essence (ذات المرآة) in terms of shape, length, width, circularity, and the variation of its forms, while remaining a mirror in every state. Likewise, the possible things (الممكنات) are like the shapes in Possibility (الإمكان), and the Divine Theophany (التجلي الإلهي) grants the possible things Existence (الوجود), just as the mirror grants them shapes. Thus, the angel, the substance (الجوهر), the body (الجسم), and the accident (العرض) appear, while Possibility (الإمكان) remains itself, never departing from its reality (حقيقته). A clearer explanation than this regarding this issue is impossible except through explicit declaration. So, say whatever you wish about the World (العالم) and attribute it to whomever you wish, after having stood upon this Reality (الحقيقة) through unveiling (كشفا) and knowledge (علما). If you refrain from declaring something that the Reality grants you the right to declare, you only refrain out of religious propriety (شرعا أدبا) toward Allah, Who has imposed restriction upon you. Rely upon Divine Propriety (الأدب الإلهي) and draw near to Allah by what He commanded you to draw near to Him with, until He unveils you to yourself, so that you know yourself, and thus know your Lord, and know who you are and Who He is. <<وَاللهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way). In this station (المنزل) is the knowledge of the two aspects (علم الوجهين), the knowledge of the Presence (الحضرة) in which the essence of truth (عين الصدق) is distinguished from the essence of falsehood (عين الكذب), the knowledge of what the servant conceals that leads to his misery (شقاؤه), the knowledge of the variation of states (اختلاف الأحوال), the knowledge of the seal (علم الختم), the knowledge of number and its properties, the knowledge of similitude (علم التشبيه), the knowledge of the human being solely from the perspective of his nature (طبيعته), the knowledge of antecedents (السوابق) and consequents (اللواحق), the knowledge of provisions (الأرزاق) and treasuries (الخزائن), the knowledge of the preventing veils (الحجب المانعة), the knowledge of ownership (علم التمليك), the knowledge of directed Generosity (علم الجود المتوجه), the knowledge of the agreement of the agent (الوكيل) regarding his client’s property and his disposal of it as an owner, despite the property not belonging to him, the knowledge of wishing (علم التمني), and the knowledge of Divine Decree (علم القضاء). <<وَالْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ>> (And praise be to Allah, Lord of the Worlds). And I say: Glory be to You, O Allah, and with Your praise. There is no god but You. I seek Your forgiveness and repent to You.",
    "ur": "باب نمبر تین سو اکیس: اس منزل کی معرفت میں جو عالمِ شہادت اور عالمِ غیب کے درمیان فرق کرتی ہے، اور یہ منزل الحضرۃ المحمدیۃ (الحضرة المحمدية) سے ہے۔\n\nعقل کے لیے ایک نور ہے اور ایمان کے لیے کئی انوار ہیں\nبیشک بصیرتیں (باطنی آنکھیں) ظاہری آنکھوں کے لیے بھی آنکھیں ہیں۔\n\nآنکھ، کان اور تمام تر احساسات\nکسب (حصول علم) میں عقل کے مددگار اور معاون ہیں۔\n\nتم (باطنی) آنکھ سے علمِ غیب کا مشاہدہ کرتے ہو، نہ کہ عقل سے\nتمہیں اوہام اور افکار حجاب میں نہ ڈالیں۔\n\nجس نے بصارت (باطنی مشاہدہ) کے ذریعے علومِ غیب حاصل نہیں کیے،\nتو وہ (علوم) پردۂ حفاظت کے پیچھے کنواریوں کی طرح ہیں۔\n\nانہوں نے کہا: غور کر کہ کائنات میں معرفت ہے۔\nاے گھر! تو گھر کے رب سے ناواقف ہے۔\n\n### [کہ الوجود (الوجود) عابد اور معبود کے درمیان تقسیم ہے]\n\nجان لو اے ولیِ حمیم! کہ الوجود (الوجود) عابد اور معبود کے درمیان تقسیم ہے۔ عابد وہ سب کچھ ہے جو اللہ تعالیٰ کے سوا ہے، اور یہی عالم ہے جسے عبد (بندہ) سے تعبیر کیا جاتا ہے اور اسی نام سے پکارا جاتا ہے۔ اور معبود وہ ہے جسے اللہ کے نام سے پکارا جاتا ہے۔ اور الوجود (الوجود) میں اس کے سوا کچھ نہیں جو ہم نے ذکر کیا۔ پس اللہ کے سوا ہر چیز اللہ کی عبد ہے، جو اس نے پیدا کی اور پیدا کرتا ہے۔\n\nجو کچھ ہم نے ذکر کیا ہے اس میں عظیم اسرار ہیں جو اللہ کی المعرفۃ (المعرفة) اور اس کی توحید کے باب سے، اور عالم اور اس کے مرتبے کی معرفت سے متعلق ہیں۔ اس مسئلے میں علماء کے درمیان ایسا اختلاف ہے جو کبھی ختم نہیں ہو سکتا، اور نہ ہی اس میں کوئی ایسا قدم ثابت ہو سکتا ہے جس پر ٹھہرا جا سکے۔ اسی لیے اللہ نے اپنے بندوں کے لیے ایمان کے ذریعے سعادت مقدر فرمائی، اور خاص طور پر اللہ کی توحید کے علم میں۔ سعادت کا راستہ صرف یہی دو ہیں۔\n\nایمان کا تعلق اس خبر سے ہے جو رسول اللہ کی طرف سے لائے، اور یہ محض تقلید ہے جسے ہم قبول کرتے ہیں، خواہ ہم اسے جانیں یا نہ جانیں۔ اور علم وہ ہے جو عقلی نظر یا الٰہی الکشف (الکشف) سے حاصل ہوتا ہے۔ اور اگر یہ علم یقینی طور پر حاصل نہ ہو، یہاں تک کہ اس کے جاننے والے کے نزدیک شبہات اس میں رخنہ نہ ڈال سکیں، تو وہ علم نہیں ہے۔\n\n### [عالم دو ہیں: عالمِ غیب اور عالمِ شہادت]\n\nپھر ہم کہتے ہیں کہ عالم دو ہیں، تیسرا عالم نہیں ہے۔ ایک وہ عالم جسے حس (حس) ادراک کرتی ہے، اور اسے عالمِ شہادت سے تعبیر کیا جاتا ہے۔ اور دوسرا وہ عالم جسے حس ادراک نہیں کرتی، اور اسے عالمِ غیب سے تعبیر کیا جاتا ہے۔\n\nاگر کوئی چیز کسی وقت غائب ہو اور کسی وقت حس کے لیے ظاہر ہو جائے تو اسے غیب نہیں کہا جاتا۔ غیب تو وہ ہے جسے حس ادراک نہ کر سکے، لیکن اسے عقل کے ذریعے جانا جائے، یا تو دلیلِ قاطع سے یا خبرِ صادق سے، اور یہی ایمان کا ادراک ہے۔ عالمِ شہادت کا مدرک حس ہے، اور یہ علم کا راستہ ہے، نہ کہ عینِ علم۔ اور یہ (حس) اللہ کے سوا ہر اس چیز کے ساتھ خاص ہے جسے حسی ادراک حاصل ہے۔ اور غیب کا مدرک عینِ علم ہے۔\n\nجو کچھ ہم نے ذکر کیا ہے اس میں عقلیں گم ہو گئیں اور دل حیران ہو گئے۔\n\nپھر جب انسان اس طریقے میں داخل ہوتا ہے جس پر ہم ہیں، اور وہ اس کے علماء اور سادات میں ممتاز ہونا چاہتا ہے، تو اسے چاہیے کہ وہ اپنے آپ کو صرف اللہ واحد کے ساتھ مقید کرے، اور یہی اس کی ذاتی تقیید ہے جس سے وہ کلی طور پر آزاد نہیں ہو سکتا۔ یہ ایسی عبودیت ہے جو کسی بھی صورت میں آزادی قبول نہیں کرتی، اور ایسی ملکیت ہے جو زوال قبول نہیں کرتی۔\n\nاور جب انسان اپنے آپ کو صرف اسی چیز کے ساتھ مقید کرتا ہے جس کے ساتھ وہ اپنی ذات میں مقید ہے، اور جیسا کہ ہم نے کہا، یہ اس اللہ کے ساتھ اس کی تقیید ہے جس نے اسے خَلَقَهُ فَقَدَّرَهُ ثُمَّ السَّبِيلَ يَسَّرَهُ (اسے پیدا کیا، پھر اسے اندازہ دیا، پھر راستہ آسان کر دیا)۔\n\nپس جب اس کا یہ مرتبہ ہے، اور یہ ضروری ہے، تو اسے چاہیے کہ وہ اپنے آپ کو برزخ کے سوا کہیں نہ ٹھہرائے۔ برزخ وہ وہمی مقام ہے جس کا وجود صرف وہم میں ہے، عالمِ شہادت اور عالمِ غیب کے درمیان۔ اس طرح کہ کوئی بھی چیز اس غیبِ مغیب سے باہر نہ نکلے جو کسی وقت شہادت سے متصف ہوتا ہے، نہ کہ اس غیب سے جس پر کسی بھی صورت میں شہادت ہونا محال ہے، مگر یہ کہ یہ ٹھہرنے والا (سالک) اسے جانتا ہو۔\n\nپس جب وہ عالمِ شہادت میں ظاہر ہو اور اسے ادراک کرے، تو یا تو وہ عالمِ شہادت میں باقی رہے گا یا باقی نہیں رہے گا، جیسے کہ اعراض (عارضی صفات)۔ اگر وہ باقی نہیں رہتا تو اسے شہادت سے جدا ہونا ضروری ہے۔ اور جب وہ شہادت سے جدا ہوتا ہے تو وہ اس غیب میں داخل ہو جاتا ہے جسے کبھی بھی شہادت کے طور پر ادراک نہیں کیا جا سکتا، اور ظہور کے بعد اس کے لیے اس غیب کی طرف واپسی نہیں ہوتی جہاں سے وہ نکلا تھا۔\n\nکیونکہ جس غیب سے وہ نکلا تھا وہ غیبِ امکانی تھا، اور جس غیب کی طرف وہ شہادت میں حاصل ہونے کے بعد منتقل ہوا وہ غیبِ محالی (محال غیب) ہے۔ وہ غیبِ محالی کبھی بھی کوئی ایسی چیز ظاہر نہیں کرتا جو شہادت سے متصف ہو۔ اور چونکہ جس چیز کی طرف وہ منتقل ہوا وہ کسی وقت یا کسی حال میں شہادت سے متصف نہیں ہوتی، اس لیے وہ اس غیب میں داخل ہو گیا اور اس غیب کی طرف واپس نہیں لوٹا جہاں سے وہ نکلا تھا۔\n\nاور جب انسان اس مقام پر ٹھہرتا ہے اور اس سے متحقق ہو جاتا ہے، تو الحق (الحق) اسے لے لیتا ہے اور اسے اپنے اور اپنے سوا ہر چیز کے درمیان کھڑا کر دیتا ہے، خواہ وہ اس کی اپنی ذات ہو یا اس کے غیر۔ میرا مطلب ہے بندے کی اپنی ذات۔ پس وہ اپنی ذات اور اپنی آنکھ کو دیکھتا ہے جبکہ وہ اس مقام سے باہر ہے جہاں اسے کھڑا کیا گیا، اور وہ اسے عالم کے ساتھ دیکھتا ہے جبکہ وہ عینِ عالم ہے، جیسا کہ آدم علیہ السلام نے اپنی ذات اور اپنی ذریت کو الحق (الحق) کی مٹھی میں دیکھا، جبکہ وہ الحق (الحق) کی اس مٹھی سے باہر تھے جس میں انہوں نے اپنی ذات کو دیکھا تھا، جیسا کہ خبرِ الٰہی میں وارد ہے۔\n\nپس جب وہ اس مقام پر ٹھہرتا ہے، جو الکشف (الکشف) کے مقامات میں سب سے بلند ہے، اور ہر مقام اس سے نیچے ہے، تو یہ صدیق رضی اللہ عنہ کا مقام تھا، جس کی وجہ سے وہ ان لوگوں پر فضیلت لے گئے جن کے بارے میں رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے گواہی دی کہ انہوں نے ان پر فضیلت حاصل کی ہے، خواہ وہ حاضرین میں سے ہوں یا امت میں سے۔ یہ معلوم نہیں کہ آپ صَلَّى اللهُ عَليهِ وسَلَّم کا اشارہ کس طرف تھا، مگر صرف اس شخص کو جس کے الکشف (الکشف) میں خبرِ صادق آئی ہو۔\n\nجب وہ اس مقام پر ٹھہرتا ہے تو وہ دونوں غیبوں پر جھانکتا ہے: وہ غیب جس سے کائنات وجود میں آتی ہے، اور وہ غیب جس کی طرف بعض کائنات شہادت سے متصف ہونے کے بعد منتقل ہو جاتی ہیں۔\n\nیہ ایک عظیم الشان مسئلہ ہے جسے بہت سے لوگ نہیں جانتے۔ میرا مطلب ہے وہ امور جو غیب سے شہادت کی طرف نکلے، پھر غیب کی طرف منتقل ہو گئے، اور وہ اعراضِ کونیہ (عارضی صفات) ہیں۔ کیا وہ وجودی عینی امور ہیں، یا وہ ایسی احوال ہیں جو نہ عدم سے متصف ہوتی ہیں اور نہ الوجود (الوجود) سے، لیکن وہ معقول ہیں؟ پس وہ نسبتیں ہیں، اور یہ ان اسرار میں سے ہیں جن میں مخلوق حیران ہو گئی۔\n\nوہ نہ تو اللہ ہیں اور نہ ہی ان کا کوئی عینی وجود ہے کہ وہ عالم میں سے ہوں یا اللہ کے سوا کسی چیز میں سے ہوں۔ پس وہ معقول حقائق ہیں کہ اگر تم انہیں اللہ عزوجل کی طرف منسوب کرو تو وہ انہیں قبول کرتا ہے اور وہ اس پر محال نہیں ہوتیں، اور اگر تم انہیں عالم کی طرف منسوب کرو تو وہ انہیں قبول کرتا ہے اور وہ اس پر محال نہیں ہوتیں۔\n\nپھر وہ اللہ کے حق میں دو حصوں میں تقسیم ہوتی ہیں: ان میں سے کچھ ایسی ہیں جن کی نسبت اللہ کی طرف محال ہے، لہٰذا وہ اس کی طرف منسوب نہیں کی جاتیں، اور کچھ ایسی ہیں جو اس پر محال نہیں ہیں۔ جو اللہ پر محال نہیں ہیں، عالم ان سب کو قبول کرتا ہے سوائے نسبتِ اطلاق کے، کیونکہ عالم اسے قبول نہیں کرتا۔ اور نسبتِ تقیید کو عالم قبول کرتا ہے اور اللہ قبول نہیں کرتا۔\n\nان معقول حقائق کے لیے وہ اطلاق ہے جو ان کے سوا کسی کے لیے نہیں، پس الحق (الحق) اور عالم انہیں قبول کرتے ہیں، حالانکہ وہ نہ الحق (الحق) میں سے ہیں اور نہ عالم میں سے، اور نہ ہی وہ موجود ہیں، اور نہ ہی عقل ان کے جاننے والے کا انکار کر سکتی ہے۔ یہیں سے حیرت واقع ہوئی، معاملہ سنگین ہوا، لوگ بٹ گئے، اور حیرتیں حیران ہو گئیں! اسے صرف اللہ جانتا ہے اور وہ جسے اللہ اس پر مطلع کرے۔\n\nاور یہی وہ صحیح غیب ہے جس سے کوئی چیز وجود میں نہیں آتی کہ وہ شہادت بن جائے، اور نہ ہی شہادت کے بعد اس کی طرف منتقل ہوتی ہے۔ اور نہ ہی وہ محال ہے کہ وہ محض عدم ہو، اور نہ ہی وہ واجب الوجود ہے کہ وہ محض الوجود (الوجود) ہو، اور نہ ہی وہ ممکن ہے جس کے دونوں پہلو (وجود اور عدم) برابر ہوں، اور نہ ہی وہ غیر معلوم ہے، بلکہ وہ معقول اور معلوم ہے۔ اس کی کوئی حد معلوم نہیں، اور نہ ہی وہ عابد ہے اور نہ معبود۔ اور اس پر غیب کا اطلاق شہادت کے اطلاق سے زیادہ اولیٰ ہے، کیونکہ اس کی کوئی عین نہیں ہے جو کسی وقت مشہود ہو سکے۔\n\nپس یہی وہ غیب ہے جس کے ساتھ الحق (الحق) سبحانہ منفرد ہے، جہاں اس نے فرمایا: عَالِمُ الْغَيْبِ (غیب کا جاننے والا)، اور اسے شہادت کے ساتھ نہیں ملایا۔ فَلا يُظْهِرُ عَلى‏ غَيْبِهِ أَحَداً (پس وہ اپنے غیب پر کسی کو مطلع نہیں کرتا)۔\n\nاور وہ غیب جسے اس نے شہادت کے ساتھ ملایا ہے، وہ ہے جو شہادت کے مقابل ہے۔ پس الحق (الحق) نے اپنی ذات کو متقابلین کے علم سے متصف کیا، اور فرمایا: عَالِمُ الْغَيْبِ وَالشَّهَادَةِ (غیب اور شہادت کا جاننے والا)۔ یہاں یہی مراد ہے، اگرچہ یہ (غیب) اسم میں اس (پہلے غیب) کے ساتھ شریک ہے۔\n\nاگر تم کہو کہ اس کے قول إِلَّا مَنِ ارْتَضَىٰ مِن رَّسُولٍ (سوائے اس رسول کے جسے وہ پسند کر لے) میں استثناء کا کیا فائدہ ہے؟\n\nہم کہیں گے: غور کرو کہ وہ کون سا غیب ہے جس پر رسولوں کو مطلع کیا گیا، اور اسے کس چیز سے جوڑا گیا، تو تم جان لو گے کہ وہ علمِ تکلیف ہے جو بندوں سے غائب تھا۔ اور اسی لیے اس نے اس پر فرشتے نگہبان مقرر کیے، شیاطین سے بچاؤ کے لیے، تاکہ وہ ان (رسولوں) کی طرف کوئی ایسی چیز نہ ڈال دیں جو وہ مخلوق تک پہنچا دیں اور خود بھی اس پر عمل کریں، اس تکلیف میں سے جسے اللہ نے بندوں کی سعادت کا راستہ بنایا ہے، امر و نہی کی صورت میں، لِيَعْلَمَ أَن قَدْ أَبْلَغُوا رِسَالَاتِ رَبِّهِمْ (تاکہ وہ جان لے کہ انہوں نے اپنے رب کے پیغامات پہنچا دیے ہیں)۔\n\nتو گویا یہ استثناء منقطع ہے، یعنی یہ غیب اس غیب سے حقیقی طور پر منقطع ہے، نہ کہ کل کے ایک جزو کا انقطاع، چونکہ لفظِ غیب میں اشتراک واقع ہوا، اس لیے ہم نے اسے مستثنیٰ کہا، اور چونکہ وہ حقیقت میں اس سے مختلف ہے، اس لیے ہم نے اسے منقطع کہا۔ برخلاف مستثنیٰ متصل کے، وہ بھی منقطع ہوتا ہے لیکن حال کے اعتبار سے، نہ کہ ذات کے اعتبار سے۔ تم متصل میں کہتے ہو: \"گھر میں کوئی انسان نہیں سوائے زید کے۔\" یہ مستثنیٰ متصل ہے کیونکہ وہ انسان ہے جو دوسرے انسانوں سے اس حال کی وجہ سے جدا ہوا کہ وہ گھر میں تھا، نہ کہ اپنی حقیقت کی وجہ سے، کیونکہ گھر میں اس کے سوا کوئی انسان نہیں تھا۔ پس انقطاع حال میں ہے، اور بس۔ لیکن اگر تم کہو: \"گھر میں کوئی انسان نہیں سوائے گدھے کے،\" تو یہ حقیقت اور حال دونوں کے اعتبار سے منقطع ہے۔\n\nاسی طرح وہ غیب جس پر رسولوں کو فرشتوں کی نگہبانی کے ذریعے مطلع کیا جاتا ہے، شیاطین کے سرکشوں کی وجہ سے، وہ رسالت ہے جو وہ اللہ کی طرف سے پہنچاتے ہیں۔ اور اسی لیے فرمایا: لِيَعْلَمَ أَن قَدْ أَبْلَغُوا رِسَالَاتِ رَبِّهِمْ (تاکہ وہ جان لے کہ انہوں نے اپنے رب کے پیغامات پہنچا دیے ہیں)۔ اس نے رسالت کو اپنے قول \"ربهم\" (ان کے رب) کی طرف منسوب کیا، جب انہیں معلوم ہو گیا کہ شیاطین نے ان کی طرف کوئی چیز نہیں ڈالی، یعنی رسولوں کی طرف۔ پس انہیں یقین ہو گیا کہ یہ رسالت اللہ کی طرف سے ہے، نہ کہ کسی اور کی۔\n\nاور کیا یہ مقدار جس کا اظہار اس مخصوص سورت میں اس کے قول إِلَّا مَنِ ارْتَضَىٰ مِن رَّسُولٍ میں کیا گیا ہے، کیا یہ اطلاع اس رسول کو فرشتے کے واسطے سے ہے یا اس خاص وحی میں کوئی فرشتہ نہیں تھا؟ اور یہی زیادہ ظاہر، زیادہ مناسب اور اولیٰ ہے۔ اور فرشتے اپنی انوار سے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کو گھیرے ہوئے ہوتے ہیں، جیسے چاند کے گرد ہالہ ہوتا ہے، اور شیاطین ان کے پیچھے ہوتے ہیں، انہیں اس رسول تک کوئی راستہ نہیں ملتا، یہاں تک کہ اللہ اس وحی میں جو چاہے اسے ظاہر کر دے۔ لیکن یہ علمِ تکلیف میں سے ہے جو اس سے اور بندوں سے غائب تھا۔\n\nیہ اہل الحق (اہلِ حق) کے مخالفین کے خلاف ہے، کیونکہ وہ سمجھتے ہیں کہ بندہ اللہ کی بعض قربتوں کو اپنی عقل سے جان لیتا ہے، سب کو نہیں۔ اور یہ قول بالکل صحیح نہیں ہے۔ اللہ کی وہ قربت جو بندے کو ابدی سعادت دیتی ہے، اسے صرف وہی جانتا ہے جو الحق (الحق) کی ذات میں موجود چیز کو جانتا ہو، اور اللہ کی مخلوق میں سے کوئی بھی اسے نہیں جانتا مگر اللہ کے بتانے سے، جیسا کہ اس نے فرمایا: وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ (اور وہ اس کے علم میں سے کسی چیز کا احاطہ نہیں کر سکتے مگر جتنا وہ چاہے)۔\n\nاس مسئلے کا تصور کرنا ہماری اس کتاب میں یا کسی اور کتاب میں کسی بھی گروہ کے لیے سب سے زیادہ مشکل ہے۔\n\n### [بندہ جب الحق (الحق) کے سامنے کھڑا ہوتا ہے تو جانتا ہے کہ اس پر خاص توجہ دی گئی ہے]\n\nاور جان لو کہ جب الحق (الحق) تعالیٰ بندے کو کھڑا کرتا ہے، جیسا کہ ہم نے کہا، اللہ اور اس کے سوا ہر چیز کے درمیان، اور یہ الٰہ اور عبد کی بینِیۃ (درمیانی حالت) ہے، نہ کہ حد کی بینِیۃ، کیونکہ اللہ کی شان اس سے بلند ہے کہ اس کی حد معلوم کی جائے۔\n\nپس جب بندہ اس مقام پر ٹھہرتا ہے، تو وہ جانتا ہے کہ اس پر خاص توجہ دی گئی ہے، کیونکہ اللہ تعالیٰ نے اسے اپنے سے ہونے والے انفعالات (رد عمل) کے مطالعے میں، اور اپنی قدرت سے اعیان (ثابت حقیقتیں) کے وجود میں لانے میں، اور ان کے امکان کی حضرۃ میں الوجود (الوجود) سے متصف ہونے میں مشغول کر دیا، حالانکہ اس نے انہیں اس (حضرۃ) سے باہر نہیں نکالا اور نہ ہی ان کے اور ان کے ٹھکانے کے درمیان کوئی رکاوٹ ڈالی، لیکن اس نے انہیں الوجود (الوجود) کا خلعت پہنایا، پس وہ عدم سے موصوف ہونے کے بعد اس سے متصف ہو گئیں، جبکہ عین (حقیقت) دونوں حالتوں میں ثابت رہی۔\n\nاور بات اس الوجود (الوجود) کے بارے میں باقی رہتی ہے جسے الحق (الحق) نے اس ممکن کو پہنایا، اور اسے اس کے ٹھکانے سے باہر نہیں نکالا۔ وہ الوجود (الوجود) کیا ہے؟ کیا وہ معدوم تھا اور پھر موجود ہو گیا؟ تو الوجود (الوجود) نہ تو عدم ہو سکتا ہے اور نہ موجود۔ اور اگر وہ معدوم تھا تو اس کی حضرۃ کیا ہے؟ اگر وہ امکان ہے، تو اس میں اور اس عین میں کوئی فرق نہیں جس پر الوجود (الوجود) کا خلعت پہنایا گیا۔ کیونکہ الوجود (الوجود)، اس لحاظ سے کہ وہ اس حضرۃ میں معدوم ہے، وجود کا محتاج ہے۔ اور یہ تسلسل کا باعث بنے گا اور محال کی طرف لے جائے گا، اور وہ یہ ہے کہ یہ عین موجود نہ ہو، حالانکہ وہ موجود ہو چکی ہے۔ اور یہ عین حضرۃِ امکان سے باہر نہیں نکلی، تو پھر معاملہ کیا ہے؟\n\n### [الوجود (الوجود) اس صورت کی مانند ہے جو آئینے میں ہے]\n\nپس جان لو کہ اس عین کے لیے الوجود (الوجود) اس صورت (تصویر) کی مانند ہے جو آئینے میں ہوتی ہے۔ وہ نہ تو عینِ دیکھنے والے کی ذات ہے اور نہ ہی عینِ دیکھنے والے کے غیر کی ذات، لیکن جس محل میں اسے دیکھا گیا، اس کے ذریعے اور اس میں متجلی ہونے والے ناظر کے ذریعے یہ صورت ظاہر ہوئی۔\n\nپس وہ (آئینہ) اپنی ذات کے لحاظ سے آئینہ ہے، اور ناظر اپنی ذات کے لحاظ سے ناظر ہے۔ اور ظاہر ہونے والی صورت اس عین کے تنوع سے متنوع ہوتی ہے جو اس میں ظاہر ہوتی ہے، جیسے کہ اگر آئینہ لمبائی میں لیا جائے تو صورت لمبائی میں نظر آتی ہے، حالانکہ ناظر اپنی ذات میں ایک لحاظ سے اس صورت کے خلاف ہے اور ایک لحاظ سے اپنی صورت پر ہے۔\n\nجب ہم نے دیکھا کہ آئینہ اپنی ذات سے صورت میں حکم رکھتا ہے، اور ہم نے دیکھا کہ ناظر ایک لحاظ سے اس صورت سے مختلف ہے، تو ہم نے جان لیا کہ ناظر کی ذات میں آئینے کی ذات نے اثر نہیں ڈالا۔ اور چونکہ وہ متاثر نہیں ہوا، اور وہ صورت نہ تو عینِ آئینہ تھی اور نہ عینِ ناظر، بلکہ وہ آئینے کے لیے التجلی (التجلي) کے حکم سے ظاہر ہوئی، تو ہم نے ناظر اور آئینے کے درمیان اور آئینے میں ظاہر ہونے والی صورت کے درمیان فرق جان لیا، جو کہ آئینے میں غیب ہے۔\n\nاور اسی لیے جب ناظر کو آئینے سے دور ہوتے ہوئے دیکھا جاتا ہے تو وہ صورت آئینے کے باطن میں دور ہوتی ہوئی نظر آتی ہے، اور جب وہ قریب ہوتا ہے تو وہ قریب آتی ہے۔ اور جب وہ اعتدال کے ساتھ اس کی سطح پر ہو اور ناظر اپنا دایاں ہاتھ اٹھائے تو صورت بایاں ہاتھ اٹھاتی ہے، جو اسے بتاتی ہے کہ \"اگرچہ میں تیرے التجلی (التجلي) سے ہوں اور تیری صورت پر ہوں، لیکن تو میں نہیں ہے اور میں تو نہیں ہوں۔\"\n\nاگر تم نے وہ سمجھ لیا جس پر ہم نے تمہیں متنبہ کیا ہے، تو تم نے جان لیا کہ عبد کس طرح الوجود (الوجود) سے متصف ہوا، اور موجود کون ہے، اور کس طرح وہ عدم سے متصف ہوا، اور معدوم کون ہے، اور کس نے مخاطب کیا، اور کس نے سنا، اور کس نے عمل کیا، اور کسے مکلف کیا گیا، اور تم نے جان لیا کہ تم کون ہو اور تمہارا رب کون ہے، اور تمہاری منزل کہاں ہے، اور یہ کہ تم اس کے محتاج ہو سبحانہ، اور وہ اپنی ذات سے تم سے بے نیاز ہے۔\n\nبعض رجال نے کہا: \"جبہ میں اللہ کے سوا کوئی نہیں،\" اور اس سے ان کا اشارہ اسی مقام کی طرف تھا، وہ یہ چاہتے تھے کہ الوجود (الوجود) میں اللہ کے سوا کوئی نہیں، جیسا کہ اگر تم کہو: \"آئینے میں اس کے سوا کوئی نہیں جو اس کے لیے متجلی ہوا،\" تو تم سچ کہو گے، اس علم کے باوجود کہ آئینے میں اصلاً کوئی چیز نہیں ہے، اور نہ ہی ناظر میں آئینے کی طرف سے کوئی چیز ہے۔ اس کے باوجود کہ آئینے سے عینِ صورت میں تنوع اور تاثر کا ادراک ہوتا ہے، اور ناظر اپنی حالت پر رہتا ہے، متاثر نہیں ہوتا۔\n\nپاک ہے وہ ذات جس نے مثالیں بیان کیں اور اعیان (ثابت حقیقتیں) کو ظاہر کیا، اس بات کی دلیل کے طور پر کہ کوئی چیز اس کے مشابہ نہیں اور نہ وہ کسی چیز کے مشابہ ہے، اور الوجود (الوجود) میں اس کے سوا کوئی نہیں، اور الوجود (الوجود) صرف اسی سے حاصل ہوتا ہے، اور کسی موجود کی عین صرف اس کے التجلی (التجلي) سے ظاہر ہوتی ہے۔\n\nپس آئینہ حضرۃِ امکان (امکان) ہے، اور الحق (الحق) اس میں ناظر ہے، اور صورت تم ہو تمہاری امکانیت کے مطابق، خواہ تم فرشتہ ہو، یا فلک، یا انسان، یا گھوڑا۔ یہ آئینے میں صورت کی طرح ہے، جو آئینے کی ذات کے مطابق ہوتی ہے، لمبائی، چوڑائی، گولائی اور اس کی مختلف اشکال میں، حالانکہ وہ ہر حال میں آئینہ ہی رہتا ہے۔\n\nاسی طرح ممکنات امکان میں اشکال کی مانند ہیں، اور التجلی (التجلي) الٰہی ممکنات کو الوجود (الوجود) عطا کرتا ہے، اور آئینہ انہیں اشکال عطا کرتا ہے۔ پس فرشتہ، جوہر، جسم اور عرض ظاہر ہوتے ہیں، اور امکان اپنی حقیقت سے باہر نہیں نکلتا۔ اس مسئلے میں اس بیان سے زیادہ واضح بیان صرف تصریح کے ذریعے ہی ممکن ہے۔\n\nپس تم عالم کے بارے میں جو چاہو کہو، اور اسے جس کی طرف چاہو منسوب کرو، اس حقیقت پر الکشف (الکشف) اور علم کے ذریعے ٹھہرنے کے بعد۔ اگر تم کسی ایسے امر کے اطلاق سے رکتے ہو جس کا اطلاق حقیقت تمہیں دیتی ہے، تو تم صرف شرعاً رکتے ہو، اس اللہ کے ساتھ ادب کی وجہ سے جس نے تم پر پابندی لگائی ہے۔\n\nپس الٰہی ادب پر بھروسہ کرو اور اللہ سے اس چیز کے ذریعے قربت حاصل کرو جس کا اس نے تمہیں حکم دیا ہے، یہاں تک کہ وہ تمہارے لیے تمہاری ذات سے پردہ ہٹا دے، پس تم اپنی ذات کو پہچانو، پھر اپنے رب کو پہچانو، اور جانو کہ تم کون ہو اور وہ کون ہے۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔\n\nاور اس منزل میں علمِ وجہین (دو پہلوؤں کا علم)، اور اس حضرۃ کا علم ہے جس میں عینِ صدق عینِ کذب سے ہوتی ہے، اور اس چیز کا علم ہے جس سے بندہ پردہ کرتا ہے جس میں اس کی شقاوت ہوتی ہے، اور احوال کے اختلاف کا علم، اور ختم (مہر) کا علم، اور عدد اور اس کی خصوصیات کا علم، اور تشبیہ کا علم، اور انسان کا علم صرف اس کی طبیعت کے لحاظ سے، اور سوابق (پہلے آنے والی چیزوں) اور لواحق (بعد میں آنے والی چیزوں) کا علم، اور رزق اور خزانوں کا علم، اور مانع پردوں کا علم، اور تملیک (ملکیت دینے) کا علم، اور متوجہ جود (سخاوت) کا علم، اور وکیل کا اپنے موکل کے مال میں تصرف کا علم، اور اس میں مالک کی طرح تصرف کرنا، حالانکہ مال اس کا نہیں ہے، اور تمنا کا علم، اور قضا کا علم۔ وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (اور تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے)۔\n\nاور میں کہتا ہوں: سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ (اے اللہ! تو پاک ہے اور تیری ہی تعریف ہے، تیرے سوا کوئی معبود نہیں، میں تجھ سے مغفرت طلب کرتا ہوں اور تیری طرف توبہ کرتا ہوں)۔",
    "fa": "«باب سیصد و بیست و یکم: در معرفت منزل کسی که میان عالم شهود (عالم الشهادة) و عالم غیب (عالم الغيب) فرق می‌گذارد، و او از حضرت محمدیه (الحضرة المحمدية) است»\n\nخرد را نوری است و ایمان را انوار *** همانا بصیرت‌ها برای دیده‌ها، دیدگانند\nچشم و گوش و همه احساسات *** برای خرد در کسب (معرفت) یاور و پشتیبانند\nبا چشم، علم غیب را می‌بینی نه با عقل *** مبادا اوهام و افکار تو را محجوب سازند\nهر کس علوم غیب را از طریق بصیرت (بصر) به دست نیاورد *** همانا آن علوم پشت پرده عصمت، دوشیزگانند (بکارند)\nگفتند: در هستی‌ها (الأکوان) معرفتی را در نظر بگیر *** ای خانه، تو پروردگار خانه را نمی‌شناسی.\n\n### [اینکه هستی (الوجود) میان عابد و معبود تقسیم شده است]\n\nای ولیّ صمیمی، بدان که هستی (الوجود) میان عابد و معبود تقسیم شده است. عابد هر آنچه غیر از خدای تعالی است، و آن همان عالم است که از آن تعبیر می‌شود و بنده (عبد) نامیده می‌شود؛ و معبود همان است که الله نامیده می‌شود. و در هستی جز آنچه ذکر کردیم، نیست. پس هر آنچه غیر از خداست، بنده خداست، چه خلق شده باشد و چه خلق شود. و در آنچه ذکر کردیم، اسرار عظیمی نهفته است که به باب معرفت (المعرفة) به خدا و توحید او، و به معرفت عالم و مرتبه آن مربوط می‌شود. و میان علما در این مسئله اختلافی است که هرگز برطرف نمی‌شود و قدمی در آن محقق نمی‌گردد که بتوان بر آن ثابت ماند. و به همین دلیل، خداوند سعادت را برای بندگانش به ایمان مقدر فرموده است. و در علم به توحید خدا به طور خاص، راهی به سوی سعادت جز این دو نیست. ایمان مربوط به خبری است که رسولان از جانب خدا آورده‌اند و آن تقلیدی محض است که آن را می‌پذیریم، چه آن را بدانیم و چه ندانیم. و علم آن چیزی است که نظر عقلی یا کشف الهی (الکشف الإلهي) آن را عطا کند، مشروط بر اینکه این علم به صورت ضروری حاصل شود تا شبهات در نزد عالم به آن خللی وارد نکند، وگرنه علم نیست.\n\n### [عالم دو عالم است: عالم غیب و عالم شهود]\n\nسپس می‌گوییم: عالم دو عالم است و سومی وجود ندارد. عالمی که حس آن را درک می‌کند و از آن به شهود (الشهادة) تعبیر می‌شود، و عالمی که حس آن را درک نمی‌کند و از آن به عالم غیب (عالم الغيب) تعبیر می‌شود. اگر چیزی در زمانی غایب باشد و در زمانی برای حس ظاهر شود، آن را غیب نمی‌نامند. غیب تنها چیزی است که حس نمی‌تواند آن را درک کند، اما با عقل دانسته می‌شود، یا از طریق دلیل قاطع و یا از طریق خبر صادق، که همان ادراک ایمان است. مدرَکِ شهود، حس است و آن راهی به سوی علم است، نه عین علم. و این (شهود) مختص به هر چیزی غیر از خداست که دارای ادراک حسی است. و مدرَکِ غیب، عین علم است. در آنچه ذکر کردیم، عقل‌ها سرگشته و خردها حیران شده‌اند. سپس، اگر انسان وارد این طریقه شود که ما بر آن هستیم و بخواهد در میان علمای آن و بزرگانش متمایز گردد، شایسته است که خود را جز به خدای یگانه مقید نسازد. و این همان تقیید ذاتی اوست که رهایی کامل از آن برایش صحیح نیست. و این بندگی‌ای است که آزادی را به هیچ وجه نمی‌پذیرد، و مُلکی است که زوال نمی‌پذیرد. و اگر انسان خود را جز به آنچه ذاتاً به آن مقید است، مقید نسازد، و آن چنان که گفتیم، تقیید او به خدایی است که خَلَقَهُ فَقَدَّرَهُ ثُمَّ السَّبِيلَ يَسَّرَهُ (او را آفرید و اندازه‌اش داد، سپس راه را آسان نمود)، پس شایسته است که چون این مرتبه را دارد و ناگزیر است، خود را جز در برزخ (البرزخ) متوقف نسازد. و برزخ همان مقام موهومی است که وجودی جز در وهم ندارد، و میان عالم شهود و غیب قرار دارد؛ به گونه‌ای که هیچ چیز از غیب پنهان که در زمانی به شهود متصف می‌شود (نه غیبی که محال است به هیچ وجه شهود گردد) خارج نمی‌شود، مگر اینکه این شخصِ ایستاده (در برزخ) آن را می‌داند. پس هنگامی که به عالم شهود آشکار شد و حس آن را درک کرد، یا در عالم شهود باقی می‌ماند یا باقی نمی‌ماند، مانند اعراض. اگر باقی نماند، ناگزیر از شهود جدا می‌شود. و هنگامی که از شهود جدا شد، وارد غیبی می‌شود که هرگز نمی‌تواند به صورت شهود درک شود و پس از ظهورش بازگشتی به غیبی که از آن خارج شده، ندارد. زیرا مقام غیبی که از آن خارج شده، غیب امکانی است، و غیبی که پس از حصول در شهود به آن منتقل شده، غیب محالی است. از آن غیب محالی هرگز چیزی که متصف به شهود باشد، ظاهر نمی‌شود. و چون این چیزی که به آن منتقل شده، در هیچ زمان یا حالی متصف به شهود نمی‌شود، به همین دلیل وارد آن غیب شده و به غیبی که از آن خارج شده، باز نمی‌گردد. و هنگامی که انسان در این مقام توقف کند و به آن متحقق شود، حق (الحق) او را می‌گیرد و میان خود و هر آنچه غیر اوست، از نفس خود و از غیر خود، متوقف می‌سازد؛ یعنی میان نفس بنده. پس نفس و عین خود را می‌بیند در حالی که در آن مقامی که حق او را متوقف ساخته، از آن خارج است. و آن را همراه با غیر خود از عالم می‌بیند، در حالی که عین اوست، همان‌گونه که آدم نفس و ذریه خود را در قبضه حق دید، در حالی که خود از قبضه حقی که نفسش را در آن دید، خارج بود، چنان که در خبر الهی آمده است. پس هنگامی که در این مقام توقف کند، که والاترین مقامات کشف (الکشف) است و هر مقامی پایین‌تر از آن است، این مقام، مقام صدیق (ابوبکر) بود که به واسطه آن بر کسی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) شهادت داد که بر او برتری یافته، فضیلت یافت؛ خواه از حاضران باشد یا از امت، معلوم نیست که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) کدام یک را اراده کرده است، مگر برای کسی که خبر صادق در کشفش به او رسیده باشد و نه غیر آن. پس هنگامی که در این مقام توقف کند، بر دو غیب مشرف می‌شود: غیبی که کائنات از آن به وجود می‌آیند، و غیبی که برخی از کائنات پس از اتصاف به شهود به آن منتقل می‌شوند. و این مسئله‌ای است بس عظیم که بسیاری از مردم آن را نمی‌دانند؛ یعنی این اموری که از غیب به شهود خارج شده و سپس به غیب منتقل شده‌اند، که همان اعراض کونی هستند، آیا آنها امور وجودی عینی هستند یا احوالی هستند که نه به عدم متصف می‌شوند و نه به وجود، بلکه معقولند؟ پس آنها نسبت‌هایی هستند و از اسراری می‌باشند که خلق در آن حیران شده‌اند. آنها نه خدا هستند و نه وجود عینی دارند که از عالم باشند یا از ما سوی الله. بلکه حقایقی معقولند که اگر آنها را به خدای عز و جل نسبت دهی، می‌پذیرد و بر او محال نیست، و اگر آنها را به عالم نسبت دهی، می‌پذیرد و بر آن محال نیست. سپس این حقایق در حق خدا به دو بخش تقسیم می‌شوند: بخشی که نسبت دادن آن به خدا محال است، پس به او نسبت داده نمی‌شود، و بخشی که بر او محال نیست. آنچه بر خدا محال نیست، عالم همه آن را می‌پذیرد، مگر نسبت اطلاق را، که عالم آن را نمی‌پذیرد. و نسبت تقیید را عالم می‌پذیرد و خدا نمی‌پذیرد. و این حقایق معقول، دارای اطلاقی هستند که برای غیر آنها نیست، پس حق و عالم آن را می‌پذیرند، در حالی که نه از حق هستند و نه از عالم، و نه موجودند. و عقل نمی‌تواند عالم به آنها را انکار کند. از اینجاست که حیرت واقع شده و کار بزرگ گشته و مردم متفرق شده‌اند و حیرت‌ها سرگردان گشته‌اند. و این را جز خدا و کسی که خدا او را مطلع ساخته، نمی‌داند. و آن همان غیب صحیح است که چیزی از آن به وجود نمی‌آید که شهود باشد، و پس از شهود نیز به آن منتقل نمی‌شود. و نه محال است که عدم محض باشد، و نه واجب الوجود است که وجود محض باشد، و نه ممکن است که دو طرف آن (وجود و عدم) مساوی باشد. و نه مجهول است، بلکه معقول و معلوم است. و حدی برای آن شناخته نمی‌شود، و نه عابد است و نه معبود. و اطلاق غیب بر آن سزاوارتر از اطلاق شهود است، زیرا عینی ندارد که جایز باشد در زمانی مشاهده شود. پس این همان غیبی است که حق (سبحانه) به آن منفرد است، آنجا که فرمود: عالِمُ الْغَيْبِ (دانای غیب) و آن را به شهود قرین نساخت: فَلا يُظْهِرُ عَلى‏ غَيْبِهِ أَحَداً (پس هیچ کس را بر غیب خود آگاه نمی‌سازد). و غیبی که آن را به شهود قرین ساخت، همان است که مقابل شهود قرار می‌گیرد. پس حق، خود را به علم متقابلین وصف نمود و فرمود: عالِمُ الْغَيْبِ والشَّهادَةِ (دانای غیب و شهود). مراد در اینجا این است، هرچند که این (غیب) در اسم با آن (غیب اول) مشترک باشد. اگر بگویی: فایده استثنا در قول او: إِلَّا من ارْتَضى‏ من رَسُولٍ (مگر کسی را که از رسولان برگزیده است) چیست؟ می‌گوییم: درنگ کن که رسولان بر چه غیبی مطلع شدند و آن را به چه چیزی ربط داد. آنگاه خواهی دانست که آن، علم تکلیف است که از بندگان غایب بوده است. و به همین دلیل، فرشتگان را برای آن نگهبان قرار داد تا از شیاطین حذر کنند که مبادا چیزی به رسول القا کنند که او آن را به خلق منتقل سازد و خود به آن عمل کند، از تکلیفی که خدا آن را راهی به سوی سعادت بندگان قرار داده است، از امر و نهی، لِيَعْلَمَ أَنْ قَدْ أَبْلَغُوا رِسالاتِ رَبِّهِمْ (تا بداند که پیام‌های پروردگارشان را رسانده‌اند). پس گویی این استثنا، منقطع است؛ یعنی این غیب از آن غیب انقطاعی حقیقی دارد، نه انقطاع جزء از کل. چون در لفظ غیب اشتراک واقع شد، گفتیم مستثنی است، و چون در حقیقت با آن مخالف است، گفتیم منقطع است. برخلاف مستثنای متصل، که آن نیز منقطع است، اما به حال نه به ذات. در متصل می‌گویی: «ما در خانه انسانی نیست جز زید». این مستثنا متصل است، زیرا او انسانی است که به حالت بودن در خانه از دیگر انسان‌ها جدا شده است، نه به حقیقتش، چرا که در خانه جز او انسانی نبوده است. پس انقطاع در حال است و نه غیر آن. اما اگر بگویی: «ما در خانه انسانی نیست جز الاغ»، این منقطع به حقیقت و حال است. همچنین غیبی که رسولان به واسطه نگهبانی فرشتگان از شر شیاطین سرکش بر آن مطلع می‌شوند، همان رسالتی است که از جانب خدا ابلاغ می‌کنند. و به همین دلیل فرمود: لِيَعْلَمَ أَنْ قَدْ أَبْلَغُوا رِسالاتِ رَبِّهِمْ (تا بداند که پیام‌های پروردگارشان را رسانده‌اند). پس رسالت را به قول خود «ربهم» (پروردگارشان) اضافه کرد، زیرا دانستند که شیاطین چیزی به آنها (رسولان) القا نکرده‌اند، پس یقین کردند که آن رسالت از جانب خداست و نه از غیر او. و آیا این مقداری که در این سوره معین در قول او: إِلَّا من ارْتَضى‏ من رَسُولٍ (مگر کسی را که از رسولان برگزیده است) از آن تعبیر شده، آیا آن آگاه‌سازی به این رسول به واسطه فرشته بوده است یا در این وحی خاص فرشته‌ای نبوده است؟ و دومی (نبود فرشته) آشکارتر، موجه‌تر و سزاوارتر است. و فرشتگان انوار خود را مانند هاله‌ای دور ماه، اطراف رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) احاطه می‌کنند و شیاطین از پشت سر راهی به این رسول نمی‌یابند تا اینکه خدا در آن آگاه‌سازی از وحی، آنچه را بخواهد برای او آشکار سازد، اما از علم تکلیف که از او و از بندگان غایب بوده است. این برخلاف مخالفان اهل حق در این مسئله است، زیرا آنها معتقدند که بنده برخی از قربات به خدا را با عقل خود می‌داند، نه همه آنها را. و این قول هیچ بخشی از آن صحیح نیست. پس قربتی به خدا که سعادت ابدی را به بنده عطا کند، جز کسی که آنچه در نفس حق است را می‌داند، نمی‌داند. و هیچ کس از خلق خدا آن را نمی‌داند مگر به آگاه‌سازی خدا، چنان که فرمود: ولا يُحِيطُونَ بِشَيْ‏ءٍ من عِلْمِهِ إِلَّا بِما شاءَ (و به چیزی از علم او احاطه نمی‌یابند مگر به آنچه او بخواهد). پس در این کتاب ما و نه در غیر آن، چیزی دشوارتر از تصور این مسئله برای هر طایفه‌ای نیست.\n\n### [اگر خداوند بنده را متوقف سازد، می‌داند که مورد عنایت است]\n\nو بدان که هنگامی که حق تعالی بنده را متوقف سازد، چنان که گفتیم، میان خدا و هر آنچه غیر اوست، و این بینیت، بینیت اله و بنده است، نه بینیت حد، زیرا جلال خدا برتر از آن است که حد او دانسته شود. پس هنگامی که بنده در این مقام توقف کند، می‌داند که مورد عنایت است، زیرا خدای تعالی او را به مطالعه انفعالات از خود و ایجاد اعیان از قدرت خود و متصف شدن آنها به هستی (الوجود) در حضرت امکانشان مشغول ساخته است، در حالی که آنها را از آن خارج نکرده و میان آنها و موطنشان حائل نشده است، بلکه بر آنها خلعت هستی پوشانده است، پس پس از آنکه به عدم موصوف بودند، با ثبوت عین در هر دو حال، به هستی متصف شدند. و سخن در آن هستی (الوجود) باقی می‌ماند که حق بر این ممکن پوشانده است و آن را از موطنش خارج نکرده است. آن هستی چیست؟ آیا معدوم بوده و سپس موجود شده است؟ هستی نه معدوم است و نه موجود. و اگر معدوم بوده، پس حضرت آن چیست؟ اگر امکان باشد، فرقی میان آن و این عینی که خلعت هستی بر آن پوشانده شده، نیست. زیرا هستی از آن جهت که در این حضرت معدوم است، نیازمند به وجود است، و این تسلسل می‌یابد و به محال می‌انجامد، و آن اینکه این عین موجود نشود، در حالی که موجود شده است و این عین از حضرت امکان خارج نشده است، پس امر چگونه است؟\n\n### [همانا هستی (الوجود) مانند صورتی است که در آینه است]\n\nپس بدان که هستی (الوجود) برای این عین، مانند صورتی است که در آینه است؛ نه عین بیننده است و نه غیر عین بیننده. بلکه محل دیده شده، به واسطه آن و به واسطه ناظرِ متجلی شده در آن، این صورت ظاهر گشته است. پس آینه از حیث ذات خود، آینه است و ناظر از حیث ذات خود، ناظر است. و صورت ظاهر شده، با تنوع عین ظاهر شده در آن، متنوع می‌شود. مانند آینه‌ای که اگر به صورت طولی گرفته شود، صورت را به طول آن می‌بینی، در حالی که ناظر در نفس خود از جهتی بر غیر آن صورت است و از جهتی بر صورت خود است. پس هنگامی که دیدیم آینه به ذات خود در صورت حکم دارد، و دیدیم که ناظر از جهتی با آن صورت مخالف است، دانستیم که ذات آینه در ناظر تأثیر نکرده است. و چون تأثیر نکرده و آن صورت نه عین آینه است و نه عین ناظر، بلکه از حکم تجلی (التجلی) برای آینه ظاهر شده است، فرق میان ناظر و آینه و صورت ظاهر شده در آینه را که غیب در آن است، دانستیم. و به همین دلیل، اگر دیده شود که ناظر از آینه دور می‌شود، آن صورت را می‌بینی که در باطن آینه دور می‌شود، و اگر نزدیک شود، نزدیک می‌شود. و اگر در سطح آن به اعتدال باشد و ناظر دست راست خود را بالا ببرد، صورت دست چپ را بالا می‌برد، و این به او می‌شناساند که: «اگرچه من از تجلی تو و بر صورت تو هستم، اما تو من نیستی و من تو نیستم.» پس اگر آنچه را که به تو تذکر دادیم، تعقل کنی، خواهی دانست که بنده از کجا به هستی (الوجود) متصف شده است و موجود کیست، و از کجا به عدم متصف شده است و معدوم کیست، و چه کسی مخاطب قرار داده و چه کسی شنیده و چه کسی عمل کرده و چه کسی مکلف شده است. و خواهی دانست که تو کیستی و پروردگارت کیست و منزلت تو کجاست، و اینکه تو نیازمند به او (سبحانه) هستی و او به ذات خود از تو بی‌نیاز است. برخی از مردان گفته‌اند: «ما در جبه (خرقه) جز خدا نیست» و مرادشان این مقام بوده است. یعنی در هستی (الوجود) جز خدا نیست، همان‌گونه که اگر بگویی: «در آینه جز کسی که بر آن تجلی کرده، نیست»، راست گفته‌ای، با علم به اینکه اصلاً در آینه چیزی نیست و در ناظر نیز از آینه چیزی نیست، با وجود درک تنوع و تأثر در عین صورت از آینه، و اینکه ناظر بر همان حال خود باقی مانده و تأثیری نپذیرفته است. پس منزه است کسی که مثال‌ها زد و اعیان را به عنوان دلالت بر خود آشکار ساخت که هیچ چیز شبیه او نیست و او شبیه هیچ چیز نیست، و در هستی جز او نیست، و هستی جز از او به دست نمی‌آید، و عینی برای موجودی ظاهر نمی‌شود مگر به تجلی او. پس آینه، حضرت امکان (الإمكان) است، و حق، ناظر در آن است، و صورت، تو هستی بر حسب امکانت؛ یا فرشته‌ای، یا فلکی، یا انسانی، یا اسبی. مانند صورت در آینه بر حسب ذات آینه از هیئت در طول و عرض و استداره و اختلاف اشکال آن، با وجود اینکه در هر حال آینه است. همچنین ممکنات مانند اشکال در امکان هستند، و تجلی الهی (التجلي الإلهي) هستی را به ممکنات می‌بخشد. و آینه اشکال را به آنها می‌بخشد. پس فرشته و جوهر و جسم و عرض ظاهر می‌شود، در حالی که امکان همان امکان است و از حقیقت خود خارج نمی‌شود. و بیانی واضح‌تر از این در این مسئله ممکن نیست، مگر با تصریح. پس در عالم هر چه می‌خواهی بگو و آن را به هر کس می‌خواهی نسبت بده، پس از آنکه بر این حقیقت از طریق کشف (الکشف) و علم وقوف یافتی. اگر از اطلاق امری که حقیقت به تو اجازه اطلاق آن را می‌دهد، توقف کردی، توقف تو تنها شرعی و از روی ادب با خدایی است که محدود کردن بر تو از جانب اوست. پس بر ادب الهی تکیه کن و به خدا با آنچه به تو امر کرده است که به او تقرب جویی، تقرب بجوی تا از تو برایت کشف کند، پس خودت را بشناسی و پروردگارت را بشناسی و بدانی که تو کیستی و او کیست. و خداوند الْحَقَّ (حق) را می‌گوید و او راه را هدایت می‌کند. و در این منزل، علم دو وجه، و علم حضرتی که عین صدق از عین کذب در آن است، و علم آنچه بنده خود را با آن می‌پوشاند که در آن شقاوت اوست، و علم اختلاف احوال، و علم ختم، و علم عدد و خواص آن، و علم تشبیه، و علم انسان از حیث طبیعتش و نه غیر آن، و علم سوابق و لواحق، و علم روزی‌ها و خزانه‌ها، و علم حجاب‌های مانع، و علم تملیک، و علم جود متوجه، و علم توافق وکیل از مال موکلش و تصرف او در آن مانند تصرف مالک، با وجود اینکه مال از آن او نیست، و علم آرزو، و علم قضا وجود دارد. و الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ (ستایش از آن خداست که پروردگار جهانیان است). و می‌گویم: سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ (منزهی تو ای خدا و به ستایش تو، معبودی جز تو نیست، از تو آمرزش می‌طلبم و به سوی تو توبه می‌کنم)."
  },
  "page_count": 3
}