{
  "id": 546,
  "title": {
    "ar": "الباب السادس والأربعون وخمسمائة في معرفة حال قطب كان هجيره ومنزله فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا",
    "en": "Chapter Five Hundred and Forty-Six: Concerning the knowledge of the state of a Pole (قطب) whose constant preoccupation and spiritual station was: <<So turn away from whoever turns away from Our remembrance>>.",
    "ur": "باب پانچ سو چھیالیس: ایک قطب (قطب) کے حال کی معرفت میں جس کا روزمرہ کا معمول اور ٹھکانہ یہ تھا: \"پس آپ اس شخص سے منہ پھیر لیں جو ہمارے ذکر سے منہ پھیرتا ہے\" (فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا)",
    "fa": "باب پانصد و شصت و ششم در معرفت حال قطبی که ورد و منزلش این بود: «پس روی بگردان از کسی که از یاد ما روی برتافت.»"
  },
  "content": {
    "ar": "## «الباب السادس والأربعون وخمسمائة في معرفة حال قطب كان هجيره ومنزله فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا»\n\n\n> ما أجهل المتولي *** بمن إليه تولى‏\n\n\n> فلو رآه رآه *** من كان عنه تدلى‏\n\n\n> ولو رآه ابتداء *** عين عينه ما تولى‏\n\n\n> ما ثم عين سواه *** فهو الذي قد تولى‏\n\n\n> فمن يذوق عذابا *** منه إذا ما تولى‏\n\n\n> من أعجب القول عندي *** نوله ما تولى‏\n\n\n> إذا وليت أمورا *** ولاكها فتولى‏\n\n\n### [إن لله القرب المفرط من العبد]\n\n\nقال الله تعالى نُوَلِّهِ ما تَوَلَّى اعلم أيدنا الله وإياك بِرُوحٍ مِنْهُ أن التولي عن الذكر المضاف إلى الله ما أطلق الله الإعراض عنه على الانفراد بل ضم إليه قوله ولَمْ يُرِدْ إِلَّا الْحَياةَ الدُّنْيا فبالمجموع أمر الحق تعالى نبيه صَلَّى اللهُ عَليهِ وسَلَّم إذا وقع بالإعراض عنه فينتج للعارف هذا الذكر خلاف المفهوم منه في العموم فإن الله له القرب المفرط من العبد سبحانه وتعالى كما قال ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ والحياة الدنيا ليس إلا نعيم العبد بربه على غاية القرب الذي يليق بجلاله ولم يكن مراد المذكر بالذكر إلا أن يدعو الغافل عن الله فإذا جاء الذاكر ودعا بالذكر فسمعه هذا المدعو وكان معتنى به فشاهد المذكور عند الذكر في حياته الدنيا أمر الله هذا المذكر أن يعرض عن هذا المذكور لئلا يشغله بالذكر عن شهود مذكوره والنعيم به فقال الحق يخاطبه فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا لأن الذكر لا يكون إلا مع الغيبة ولَمْ يُرِدْ إِلَّا الْحَياةَ الدُّنْيا وهي نعيم القرب وهذا من باب الإشارة لمن هو في هذا المقام لا من باب التفسير ثم تمم وقال ذلِكَ مَبْلَغُهُمْ من الْعِلْمِ ذم في التفسير ثناء من باب الإشارة على هذا الشخص وتنبيها على رتبته في العلم بالله فأما ما فيه من الثناء عليه أنه في حال شهوده للحق في مقام القرب فلا يقدر لفنائه على القيام بما يطلبه به الذكر من التكليف فكان المذكر ينفخ في غير ضرم لأنه لا يجد قابلا فأمر بالإعراض عنه لما في ذلك الذكر بهذه الحالة من سوء الأدب في الظاهر مع الذكر فلو كان هذا السامع عنده من القوة أن يشهد الحق في كل شي‏ء لشهده في الذكر فلم يكن الحق يأمر المذكر بالإعراض عنه ولا كان يتولى السامع فهذا بعض رتبته في هذه الآية وذلك مبلغه من العلم فإذا أنتج لهذا الذاكر هذا الذكر ما ذكرناه فهو صاحبه وإن فقد هذا الذي ذكرناه وأخذه على طريق الذم فليس هو بصاحب هجير فإن الذم في هذا الذكر هو المفهوم الأول فما زال مما هم عليه عامة الناس في الفهم ولا بد أن يكون لصاحب الهجير خصوص وصف يتميز به وهو ما ذكرناه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Five Hundred and Forty-Six: Concerning the Knowledge of the State of a Pole Whose Constant Companion and Dwelling Was: <<فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا>> (So turn away from him who turns away from Our remembrance)\n\nHow ignorant is the one who turns away\nFrom Him towards Whom he is turning.\n\nIf he were to see Him, he would be seen\nBy the one who was suspended from Him.\n\nAnd if he saw Him from the beginning,\nThe very essence of his eye would not turn away.\n\nThere is no essence (عين) there but Him;\nHe is the one who has turned away.\n\nSo who tastes punishment\nFrom Him when he turns away?\n\nOne of the most astonishing sayings to me is:\n\"We shall let him take charge of what he has taken charge of.\"\n\nIf you take charge of affairs,\nHe puts you in charge of them, so take charge.\n\n### [Indeed, Allah possesses excessive Closeness to the servant]\n\nAllah the Exalted said: <<نُوَلِّهِ ما تَوَلَّى>> (We shall let him take charge of what he has taken charge of). Know—may Allah support us and you with a Spirit (روح) from Him—that the turning away (التولي) from the Remembrance (الذكر) attributed to Allah was not commanded by Allah to be turned away from (الإعراض عنه) in isolation. Rather, He joined it with His saying: <<ولَمْ يُرِدْ إِلَّا الْحَياةَ الدُّنْيا>> (and desired nothing but the life of this world).\n\nIt is by this combination that the Real (الحق) commanded His Prophet (PBUH) to turn away from him when this turning away occurred. This Remembrance yields for the Gnostic (العارف) a meaning contrary to what is generally understood. For Allah, Exalted is He, possesses excessive Closeness (القرب المفرط) to the servant, as He said: <<ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ>> (And We are nearer to him than the jugular vein).\n\nAnd the life of this world (الحياة الدنيا) is nothing but the servant's enjoyment (نعيم) of his Lord at the utmost degree of Closeness (القرب) befitting His Majesty. The intention of the one reminding (المذكر) through the Remembrance was only to call the one who is heedless (الغافل) of Allah. So, when the rememberer (الذاكر) came and called through the Remembrance, and this called person heard it, and he was attentive, and he witnessed (شاهد) the One Remembered (المذكور) during the Remembrance in his worldly life, Allah commanded this rememberer to turn away from this person being reminded, lest he distract him with the Remembrance from witnessing the One Remembered and enjoying Him.\n\nThus, the Real said, addressing him: <<فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا>> (So turn away from him who turns away from Our remembrance), because Remembrance only occurs in the state of absence (الغيبة), while <<ولَمْ يُرِدْ إِلَّا الْحَياةَ الدُّنْيا>> (and desired nothing but the life of this world) refers to the enjoyment of Closeness (نعيم القرب). This is by way of allusion (الإشارة) for one who is in this spiritual station (المقام), not by way of exegesis (التفسير).\n\nThen He completed it by saying: <<ذلِكَ مَبْلَغُهُمْ من الْعِلْمِ>> (That is the extent of their knowledge). What is censure (ذم) in the exegesis is praise (ثناء) by way of allusion regarding this person, serving as an alert to his rank (رتبته) in the Knowledge (العلم) of Allah. As for the praise contained therein, it is that in his state of witnessing the Real in the station of Closeness, due to his annihilation (فنائه), he is unable to fulfill the religious obligations (التكليف) demanded by the Remembrance. Thus, the one reminding was blowing into something that would not catch fire because he found no recipient. Therefore, he was commanded to turn away from him, due to the apparent lack of proper spiritual etiquette (سوء الأدب في الظاهر) involved in the Remembrance in this state.\n\nIf this listener possessed the strength to witness the Real in everything, he would have witnessed Him in the Remembrance. In that case, the Real would not have commanded the reminder to turn away from him, nor would the listener have turned away. This is part of his rank in this verse, and that is the extent of his Knowledge.\n\nTherefore, if this Remembrance yields for this rememberer what we have mentioned, then he is its companion. But if he lacks what we have mentioned and takes it according to the path of censure, then he is not the companion of the constant companion (صاحب هجير). For the censure in this Remembrance is the primary understanding, which is what the common people rely upon in their comprehension. The companion of the constant companion must necessarily possess a specific distinguishing characteristic, which is what we have mentioned. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب پانچ سو چھیالیس: اس قطب کے حال کی معرفت میں جس کا مستقل ورد اور ٹھکانہ یہ تھا: \"سو آپ اس سے منہ پھیر لیں جو ہمارے ذکر سے منہ پھیرتا ہے\" (قرآن ۵۳:۲۹).\n\nوہ شخص کتنا جاہل ہے جو اس سے منہ موڑتا ہے\nجس کی طرف وہ خود متوجہ ہوا ہے۔\n\nاگر وہ اسے دیکھتا، تو اسے وہ دیکھتا\nجو اس سے قریب ہوا تھا۔\n\nاور اگر وہ اسے ابتداء میں ہی دیکھ لیتا،\nتو اس کی عین ذات کبھی منہ نہ موڑتی۔\n\nوہاں اس کے سوا کوئی ذات نہیں،\nپس وہی ہے جو متوجہ ہوا ہے۔\n\nتو پھر کون اس سے عذاب چکھے گا\nجب وہ منہ موڑے گا؟\n\nمیرے نزدیک سب سے عجیب قول یہ ہے\nکہ ہم اسے وہی دے دیں جس کی طرف وہ متوجہ ہوا۔\n\nجب تو نے معاملات کی ولایت سنبھالی،\nتو اس نے تجھے ولایت دی، پس تو متوجہ ہو جا۔\n\n### [بے شک اللہ کے لیے بندے سے انتہائی قرب ہے]\n\nاللہ تعالیٰ نے فرمایا: \"ہم اسے اسی طرف پھیر دیں گے جس طرف وہ خود پھرا\" (قرآن ۴:۱۱۵).\n\nجان لو، اللہ ہمیں اور تمہیں اپنی طرف سے ایک روح کے ذریعے تائید بخشے، کہ اللہ کی طرف منسوب ذکر سے منہ موڑنے کے بارے میں اللہ نے صرف اعراض (منہ موڑنے) کا حکم تنہا نہیں دیا، بلکہ اس کے ساتھ اپنا یہ قول بھی شامل کیا: \"اور اس نے دنیا کی زندگی کے سوا کچھ ارادہ نہ کیا ہو\" (قرآن ۵۳:۲۹). پس مجموعی طور پر حق تعالیٰ (الحق) نے اپنے نبی صلی اللہ علیہ وسلم کو حکم دیا کہ جب یہ اعراض واقع ہو، تو عارف کے لیے یہ ذکر (آیت کا حکم) عام مفہوم کے برعکس نتیجہ دیتا ہے۔ کیونکہ اللہ سبحانہ و تعالیٰ کو بندے سے انتہائی قرب (القرب المفرط) حاصل ہے، جیسا کہ اس نے فرمایا: \"اور ہم اس کی شہ رگ سے بھی زیادہ قریب ہیں\" (قرآن ۵۰:۱۶). اور حیات دنیا (الحياة الدنيا) اس کے سوا کچھ نہیں کہ بندہ اپنے رب کے ساتھ اس انتہائی قرب پر نعمت حاصل کرے جو اس کے جلال کے لائق ہے۔\n\nاور ذکر کرنے والے (المذکر) کا ذکر سے مقصد صرف یہ ہوتا ہے کہ وہ اللہ سے غافل شخص کو دعوت دے۔ پس جب ذاکر آیا اور ذکر کے ذریعے دعوت دی، اور اس مدعو نے اسے سنا اور وہ اس پر توجہ دینے والا تھا، اور اس نے ذکر کے وقت اپنی حیات دنیا (الحياة الدنيا) میں مذکور (اللہ) کا مشاہدہ (الشہود) کر لیا، تو اللہ نے اس ذاکر کو حکم دیا کہ وہ اس مذکور (شخص) سے اعراض کرے، تاکہ وہ اسے ذکر کے ذریعے اپنے مذکور (اللہ) کے شہود (الشہود) اور اس سے نعمت حاصل کرنے سے مشغول نہ کر دے۔ پس حق (الحق) نے اسے مخاطب کرتے ہوئے فرمایا: \"سو آپ اس سے منہ پھیر لیں جو ہمارے ذکر سے منہ پھیرتا ہے\" (قرآن ۵۳:۲۹). کیونکہ ذکر (الذکر) غیبت (عدم موجودگی) کے ساتھ ہی ہوتا ہے۔ \"اور اس نے دنیا کی زندگی کے سوا کچھ ارادہ نہ کیا ہو\" (قرآن ۵۳:۲۹)، اور یہ (حیات دنیا) قرب (القرب) کی نعمت ہے۔ اور یہ اس شخص کے لیے اشارہ (الإشارة) کے باب سے ہے جو اس مقام پر ہے، نہ کہ تفسیر کے باب سے۔\n\nپھر بات مکمل کی اور فرمایا: \"یہ ان کے علم کی انتہا ہے\" (قرآن ۵۳:۳۰). تفسیر میں یہ مذمت ہے، لیکن اشارہ (الإشارة) کے باب سے یہ اس شخص کی تعریف ہے، اور اللہ کے علم (العلم باللہ) میں اس کے مرتبے پر تنبیہ ہے۔ جہاں تک اس میں اس کی تعریف کا تعلق ہے، وہ یہ ہے کہ وہ قرب (القرب) کے مقام پر حق (الحق) کے شہود (الشہود) کی حالت میں ہے، پس وہ اپنی فنا (الفناء) کی وجہ سے ان تکالیف کو پورا کرنے پر قادر نہیں جو ذکر (الذکر) اس سے طلب کرتا ہے۔ پس گویا ذاکر غیر سلگتی لکڑی میں پھونک رہا تھا، کیونکہ اسے کوئی قبول کرنے والا نہیں ملا۔ لہٰذا اسے اعراض (منہ موڑنے) کا حکم دیا گیا، کیونکہ اس حالت میں ذکر کرنا ظاہری طور پر ذکر کے ساتھ سوءِ ادب ہے۔ اگر اس سننے والے میں اتنی قوت ہوتی کہ وہ ہر چیز میں حق (الحق) کا شہود (الشہود) کر سکتا، تو وہ اسے ذکر میں بھی دیکھتا۔ تو نہ حق ذاکر کو اس سے اعراض کا حکم دیتا اور نہ ہی سننے والا منہ موڑتا۔ پس یہ اس آیت میں اس کے مرتبے کا کچھ حصہ ہے، اور یہی اس کے علم (العلم) کی انتہا ہے۔\n\nپس اگر اس ذاکر کے لیے اس ذکر نے وہ نتیجہ پیدا کیا جو ہم نے بیان کیا، تو وہی اس کا ساتھی ہے۔ اور اگر اس نے وہ کھو دیا جو ہم نے بیان کیا اور اسے مذمت کے طریقے پر لیا، تو وہ اس مستقل ورد (ہجیر) کا ساتھی نہیں ہے۔ کیونکہ اس ذکر میں مذمت پہلا مفہوم ہے، اور یہ عام لوگوں کی فہم سے باہر نہیں ہے۔ اور صاحب ہجیر (مستقل ورد والے) کے لیے ایک خاص وصف ہونا ضروری ہے جس سے وہ ممتاز ہو، اور وہ وہی ہے جو ہم نے بیان کیا۔ اور اللہ حق (الحق) فرماتا ہے اور وہی سیدھے راستے کی رہنمائی کرتا ہے (قرآن ۳۳:۴).",
    "fa": "باب پانصد و چهل و ششم در شناخت حال قطبی که ورد و منزلگاه او این آیه بود: «پس روی بگردان از کسی که از یاد ما روی برتافت.»\n\nچه نادان است آن روی‌گردان (المتولي) *** از کسی که به سوی او روی آورده است (تولى).\nاگر او را می‌دید، او را می‌دید *** کسی که از او آویخته شده بود.\nو اگر او را از ابتدا می‌دید *** عینِ عینِ او روی برنمی‌تافت.\nآنجا چشمی جز او نیست *** پس اوست که روی برتافته است.\nپس چه کسی عذابی می‌چشد *** از او، هنگامی که روی برمی‌تابد؟\nاز شگفت‌ترین سخنان نزد من این است *** که او را به آنچه روی آورده واگذاریم.\nاگر اموری را بر عهده گرفتی *** او تو را بر آن گماشت، پس روی برتاب.\n\n### [همانا خداوند را نهایت نزدیکی به بنده است]\n\nخداوند متعال می‌فرماید: «نُوَلِّهِ ما تَوَلَّى» (او را به آنچه روی آورده واگذاریم). بدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که روی برتافتن (التولي) از ذکری که به خداوند نسبت داده شده است، خداوند امر به اعراض (روی گرداندن) از آن را به تنهایی مطلق نکرده است، بلکه این امر را به سخن خود ضمیمه کرده است: «وَلَمْ يُرِدْ إِلَّا الْحَياةَ الدُّنْيا» (و جز زندگی دنیا را نخواسته است). پس با این مجموع، حق تعالی پیامبرش (صلی الله علیه و سلم) را امر فرمود که اگر اعراض (روی گرداندن) واقع شد، از او روی بگرداند. در نتیجه، این ذکر برای عارف، معنایی خلاف مفهوم عمومی آن به بار می‌آورد؛ زیرا خداوند سبحانه و تعالی نهایت نزدیکی (القرب المفرط) را به بنده دارد، چنانکه فرمود: «وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ» (و ما از رگ گردن به او نزدیک‌تریم). و زندگی دنیا (الحياة الدنيا) چیزی نیست جز بهره‌مندی بنده از پروردگارش در نهایت قربی که شایسته جلال اوست. و مراد ذاکر (یادکننده) از ذکر، جز این نبوده است که غافل از خدا را فراخواند. پس هنگامی که ذاکر آمد و با ذکر دعوت کرد و این مدعو (فراخوانده شده) آن را شنید و مورد توجه قرار گرفت، و در زندگی دنیای خود، مذکور (آنکه یاد می‌شود) را هنگام ذکر مشاهده کرد، خداوند به این ذاکر امر فرمود که از این مذکور روی بگرداند تا مبادا او را با ذکر از شهود (الشهود) مذکور و بهره‌مندی از او مشغول سازد. پس حق (الحق) در خطاب به او فرمود: «فَأَعْرِضْ عَنْ مَنْ تَوَلَّى عَنْ ذِكْرِنَا» (پس روی بگردان از کسی که از یاد ما روی برتافت)، زیرا ذکر جز با غیبت (غیبت از شهود) حاصل نمی‌شود، و «وَلَمْ يُرِدْ إِلَّا الْحَياةَ الدُّنْيا» (و جز زندگی دنیا را نخواسته است)، که آن همان نعیم قرب (بهره‌مندی از نزدیکی) است. و این از باب اشاره (الإشارة) است برای کسی که در این مقام قرار دارد، نه از باب تفسیر.\n\nسپس کامل کرد و فرمود: «ذَلِكَ مَبْلَغُهُمْ مِنَ الْعِلْمِ» (این نهایت دانش آنهاست). این آیه که در تفسیر (ظاهری) نکوهش است، از باب اشاره (الإشارة) ستایشی است بر این شخص و تنبیهی است بر مرتبه او در علم به خداوند. اما آنچه در این آیه از ستایش او وجود دارد این است که او در حال شهود (الشهود) حق (الحق) در مقام قرب (نزدیکی) است و به دلیل فنای (الفناء) خود، قادر به انجام تکالیفی که ذکر از او می‌طلبد نیست. پس ذاکر در جایی می‌دمید که آتش‌گیره‌ای نبود، زیرا پذیرنده‌ای نمی‌یافت. از این رو، به ذاکر امر شد که از او روی بگرداند، چرا که در این حالت، ذکر گفتن با سوء ادب ظاهری همراه است. اگر این شنونده چنان قدرتی داشت که حق را در هر چیزی مشاهده کند، او را در ذکر نیز مشاهده می‌کرد؛ در این صورت، نه حق به ذاکر امر به اعراض می‌کرد و نه شنونده روی برمی‌تافت. این بخشی از مرتبه او در این آیه است و این نهایت دانش اوست. پس اگر این ذکر برای این ذاکر، آنچه را که بیان کردیم به بار آورد، او صاحب آن است؛ و اگر آنچه را ذکر کردیم فاقد باشد و آن را از طریق نکوهش (ذم) بگیرد، پس او صاحب این ورد (هجیر) نیست. زیرا نکوهش در این ذکر، همان مفهوم اولیه‌ای است که عموم مردم در فهم خود بر آن هستند و از آن فراتر نرفته‌اند. و ناگزیر، صاحب ورد باید دارای وصف خاصی باشد که با آن متمایز شود، و آن همان است که ذکر کردیم. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 1
}