{
  "id": 518,
  "title": {
    "ar": "الباب الثامن عشر وخمسمائة في معرفة حال قطب كان منزله حَتَّى إِذا فُزِّعَ عَنْ قُلُوبِهِمْ قالُوا ما ذا قالَ رَبُّكُمْ قالُوا الْحَقَّ وهُوَ الْعَلِيُّ الْكَبِيرُ",
    "en": "Chapter Five Hundred and Eighteen: Concerning the knowledge of the spiritual state of a Pole (قطب) whose station was [defined by the verse]: <<حَتَّى إِذا فُزِّعَ عَنْ قُلُوبِهِمْ قالُوا ما ذا قالَ رَبُّكُمْ قالُوا الْحَقَّ وهُوَ الْعَلِيُّ الْكَبِيرُ>> (Until, when terror is removed from their hearts, they say, 'What did your Lord say?' They say, 'The Truth (الحق),' and He is the Exalted, the Great (العلي الكبير)).",
    "ur": "باب پانچ سو اٹھارہ (۵۱۸) قطب (Quṭb) کے حال کی معرفت (Ma'rifah) کے بیان میں جس کا روحانی مقام (منزل) یہ تھا: \"یہاں تک کہ جب ان کے دلوں سے گھبراہٹ دور کر دی جاتی ہے، تو وہ کہتے ہیں کہ تمہارے رب نے کیا فرمایا؟ وہ جواب دیتے ہیں کہ حق (الحق) فرمایا، اور وہ بلند و بالا، سب سے بڑا ہے\" (حَتَّى إِذا فُزِّعَ عَنْ قُلُوبِهِمْ قالُوا ما ذا قالَ رَبُّكُمْ قالُوا الْحَقَّ وهُوَ الْعَلِيُّ الْكَبِيرُ)۔",
    "fa": "باب پانصد و هجدهم در معرفت حال قطبی که منزلگاهش این بود: «تا چون هراس از دل‌هایشان برداشته شود، گویند: پروردگارتان چه گفت؟ گویند: حق را، و اوست بلندمرتبه بزرگ» (حَتَّى إِذا فُزِّعَ عَنْ قُلُوبِهِمْ قالُوا ما ذا قالَ رَبُّكُمْ قالُوا الْحَقَّ وهُوَ الْعَلِيُّ الْكَبِيرُ)."
  },
  "content": {
    "ar": "## «الباب الثامن عشر وخمسمائة في معرفة حال قطب كان منزله حَتَّى إِذا فُزِّعَ عَنْ قُلُوبِهِمْ قالُوا ما ذا قالَ رَبُّكُمْ قالُوا الْحَقَّ وهُوَ الْعَلِيُّ الْكَبِيرُ»\n\n\n> جزاء من أصعق في حاله *** جزاؤه الجهل بمن أصعقه‏\n\n\n> لو أنه يثبت في حاله *** ما استفهم الكون الذي حققه‏\n\n\n> وهو الذي قيده وحيه *** وهو الذي من قيده أطلقه‏\n\n\n> ما أنور السر الذي قد أتى *** منه إلى القلب وما أشرقه‏\n\n\n> وهو على مقداره محكم *** لا زائد يدريه من طبقه‏\n\n\n### [أن لله ملائكة لهم أرواح في أنوار]\n\n\nاعلم أيدنا الله وإياك بِرُوحٍ مِنْهُ أن الملائكة أرواح في أنوار وأنها أولو أجنحة فإذا تكلم الله بالوحي على صورة خاصة وتعلقت به أسماعهم كأنه سلسلة على صفوان ضربت الملائكة بأجنحتها خضعانا لهذا التشبيه فتصعق حتى إذا فزع الله عن قلوبهم وهو إفاقتهم من صعقهم قالوا ما ذا يقول بعضهم لبعض فيقول بعضهم ربكم أعلاما بأن كلامه عين ذاته فيقول بعضهم لهذا القائل الحق أي الحق بقول وهُوَ الْعَلِيُّ الْكَبِيرُ عن هذا التشبيه ولكن هكذا نسمع‏\n\n\n> فمن السمع أتينا *** فهو منا وهو فينا\n\n\n> أورث القلب بما *** أوحى به داء دفينا\n\n\n> لم يكن ذلك منه *** بل من الفهم دهينا\n\n\n> وكذا كل سميع *** من جميع المؤمنينا\n\n\n> فإذا صير ليثا *** نفسه كنت عرينا\n\n\n> لم يسعه غير قلبي *** هكذا جاء يقينا\n\n\n> كل صورة تجلى *** لي بها حينا فحينا\n\n\n> فأنا أظهر فيها *** عندكم صبحا مبينا\n\n\n> وهو الغني حقا *** عن جميع العالمينا\n\n\n> فإذا رأيت نفسي *** لم أرى إلا المتينا لا يرى باسم سواه‏\n\n\nفي عيون الناظرينا\n\n\nومن علم أن للملائكة قلوبا أو علم القلوب ما هي علم إن الله تعالى ما أسمعهم في الوحي الذي أصعقهم إلا ما يناسب من الوحي كُلَّ يَوْمٍ هُوَ في شَأْنٍ ويُقَلِّبُ الله اللَّيْلَ والنَّهارَ فمن فزع الله عن قلبه رأى حقيقة انقلابه في الصور وتحوله فيها فعلم إن العالم كله في كل نفس في تحول وانقلاب فعلم من ذلك أن ذلك للشئون التي هو الحق فيها فهو المحول القلب في الليل والنهار بما يقلبها وفي السماء بما يوحي فيها وفي الأرض بما يقدر فيها وفيما بينهما بما ينزل فيه وفينا بما نكون عليه وهو معنا أينما كنا فنتحول لتحوله ونتقلب لتقلبه فإن من أسمائه الدهر ونستغني به لغناه وأما علمنا بتفاضل بعض‏\n\n\nالملائكة في العلم بالله على بعض فلما ورد في هذا الذكر من الاستفهام في قول من قال منهم ما ذا وهو قولهم وما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ في العلم بالله وأما رفع التهمة عنهم فيما بينهم وتصديق بعضهم بعضا وانصباغ بعضهم بما عند بعض مما يكون عليه ذلك البعض من صورة العلم بالله فيفيد بعضهم بعضا فمن قوله عنهم قالُوا الْحَقَّ ابتداء ولم ينازعوا عند ما قال لهم المسئول ربكم ثم أقيموا في لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فلم يروه إلا في الهوية وهي ما غاب عنهم من الحق في عين ما تجلى وتلك الهوية هي روح صورة ما تجلى فنسبوا إليها أعني إلى الهوية من لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ العلو عن التقييد والكبرياء عن الحصر فقالوا بل قال عن نفسه وهو المعلوم عندنا الذي أعطاه الكشف عند قولهم ما ذا قالَ رَبُّكُمْ قالُوا الْحَقَّ إلى هنا انتهى كلام الملائكة فقال الله وهُوَ الْعَلِيُّ الْكَبِيرُ كما قال لنا لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فقدم ما أخر في خطاب الملائكة وهُوَ السَّمِيعُ الْبَصِيرُ فأخر عندنا ما قدم في خطاب الملائكة فنهاية ما خاطب به الملائكة بدايتنا وبداية ما خاطبنا به وعرفنا من قول الملائكة\nفيه نهايتنا\n\n\n> قلنا مثل ما لهم *** ولهم مثل ما لنا\n\n\n> فانظروا في كلامه *** تجدوه مبينا\n\n\n> فبه قد أسرنا *** وبه الحق أعلنا\n\n\n> فإذا لم تكن عليما *** به كنت مؤمنا\n\n\n> وإذا ما علمته *** لم تزل عالما بنا\n\n\nفلما شرك الله بيننا وبين ملائكته في العجز عن معرفته زدنا عليهم بالصورة ولحقناهم في الظاهر بما يظهر به من الصور في النشأة الآخرة في ظواهرنا كما نظهر بها اليوم في بواطننا فنكون على نشأتهم في الآخرة وليست للملائكة آخرة فإنهم لا يموتون فيبعثون ولكن صعق وإفاقة وهو حال لا يزال عليه الممكن في التجلي الإجمالي دنيا وآخرة والإجمال هناك في الملائكة عين المتشابه عندنا ولهذا يسمعون الوحي كأنه سلسلة على صفوان فعند الإفاقة يقع التفصيل الذي هو نظير المحكم فينا فالأمر فينا وفيهم بين آيات متشابهات وآيات محكمات فعم الابتلاء والفتنة بالإجمال والمتشابه الملأين الملإ الأعلى والملإ الأنزل فمثل هذا العلم فمثل هذا العلم ينتجه هذا الذكر والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 518: Concerning the Knowledge of the State of a Pole (قطب) Whose Station Was: <<Until when fear is removed from their hearts, they say, 'What did your Lord say?' They say, 'The Truth.' And He is the Most High, the Grand.>>\n\nThe recompense of one struck senseless in his state / is his ignorance of the One who struck him senseless.\nIf he were to remain firm in his state / the cosmos that realized him would not question him.\nHe is the one whose Revelation (وحي) bound him / and He is the one who released him from his bond.\nHow luminous is the secret that came / from Him to the heart, and how it shone!\nAnd it is firmly established according to its measure / no excess knows it, save the one who applies it.\n\n### [That Allah has angels whose spirits are in lights (أنوار)]\n\nKnow—may Allah support us and you with <<a spirit from Him>>—that the angels are spirits in lights (أنوار) and that they are possessors of wings. When Allah speaks the Revelation (الوحي) in a specific form, and their hearing attaches to it, as if it were a chain upon a smooth rock, the angels strike their wings in submission to this similitude, and they swoon (تصعق). Until when Allah removes the fear from their hearts (حتى إذا فزع الله عن قلوبهم)—which is their recovery (إفاقتهم) from their swoon (صعقهم)—they say, \"What does He say?\" Some of them say to others, \"Your Lord,\" indicating that His speech is the very Essence (عين ذاته) of the Real (الحق). Then some say to this speaker, \"The Truth (الحق),\" meaning, the Truth by saying, <<And He is the Most High, the Grand>> (وَهُوَ الْعَلِيُّ الْكَبِيرُ) concerning this similitude. But this is how we hear.\n\nFrom hearing we came / so He is from us and He is in us.\nHe bequeathed to the heart, by what / He revealed, a hidden ailment.\nThat was not from Him / but from the understanding we were afflicted.\nAnd thus is every hearer / among all the believers.\nIf He makes Himself a lion / I become the den.\nNothing contained Him but my heart / thus it came with certainty.\nIn every form He manifests (تجلى) / to me time after time.\nSo I appear in them / to you as a clear morning.\nAnd He is truly the Rich (الغني) / beyond all the worlds (العالمين).\nSo when I see myself / I see only the Firm One (المتين). He is not seen by a Name other than His / in the eyes of the beholders.\n\nWhoever knows that the angels have hearts, or knows what hearts are, knows that Allah the Exalted did not cause them to hear in the Revelation (الوحي) that struck them senseless (أصعقهم) anything but what is appropriate to the Revelation: <<Every day He is in [some] affair (شَأْنٍ)>> (Q 55:29), and <<Allah alternates the night and the day>> (Q 24:44).\n\nThus, whoever has the fear removed from his heart (فزع الله عن قلبه) sees the reality of its reversal (انقلابه) in the forms and its transformation (تحوله) within them. He therefore knows that the entire World (العالم) is in transformation and reversal in every breath. From this, he knows that this is due to the Affairs (الشئون) in which the Real (الحق) is present. He is the One who transforms the heart (المحول القلب) in the night and the day by what He alternates in them, and in the heaven by what He reveals therein, and in the earth by what He decrees therein, and in what is between them by what descends therein, and in us by the state we are upon. He is with us wherever we are, so we transform according to His transformation and reverse according to His reversal, for verily, one of His Names (أسماء) is Time (الدهر). And we are made rich through Him due to His richness.\n\nAs for our knowledge of the superiority of some angels over others in the Knowledge (العلم) of Allah, this is due to the questioning that occurred in this mention, in the saying of those among them who said, \"What?\"—which corresponds to their saying, <<And there is none of us except that he has a known station (مَقامٌ مَعْلُومٌ)>> (Q 37:164) in the Knowledge of Allah.\n\nAs for the removal of suspicion among them, the confirmation of one another, and the coloring of some of them by what is with others—from the form of the Knowledge of Allah that that other is upon, so that they benefit one another—this is derived from His saying about them, <<They said, 'The Truth (الحق)'>> initially, and they did not dispute when the questioned ones said to them, \"Your Lord.\"\n\nThen they were established in <<There is nothing like unto Him>> (Q 42:11), and they did not see Him except in the Ipseity (الهوية), which is what was hidden from them of the Real (الحق) within the very thing that manifested (تجلى). That Ipseity (الهوية) is the spirit of the form that manifested. They attributed to it—meaning, to the Ipseity, derived from <<There is nothing like unto Him>>—the transcendence (العلو) above limitation (التقييد) and the Grandeur (الكبرياء) above confinement (الحصر). So they said, \"Rather, He spoke about Himself,\" and this is what is known to us, which Unveiling (الكشف) granted them when they said, <<What did your Lord say? They said, 'The Truth.'>> The speech of the angels ends here.\n\nThen Allah said, <<And He is the Most High, the Grand>> (وَهُوَ الْعَلِيُّ الْكَبِيرُ), just as He said to us, <<There is nothing like unto Him>> (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ). Thus, He presented what He deferred in the address to the angels, <<And He is the All-Hearing, the All-Seeing>> (وَهُوَ السَّمِيعُ الْبَصِيرُ). And He deferred for us what He presented in the address to the angels. Therefore, the end of what He addressed to the angels is our beginning, and the beginning of what He addressed to us and made known to us through the angels' saying concerning Him is our end.\n\nWe said what they said / and they have what we have.\nSo look into His speech / you will find it clear.\nBy Him we were made secret / and by Him the Real (الحق) was made manifest.\nIf you are not knowing (عليما) / of Him, you are a believer (مؤمنا).\nAnd when you know Him / you will not cease to be knowing of us.\n\nSince Allah made us and His angels partners in the incapacity (العجز) to know Him (معرفته), we surpassed them by the form (الصورة) and joined them outwardly by the forms (الصور) through which He manifests in the Next Life (النشأة الآخرة) in our outward aspects, just as we manifest through them today in our inward aspects. Thus, we will be upon their mode of existence (نشأتهم) in the Next Life. The angels, however, do not have a Next Life (آخرة), for they do not die and then get resurrected, but rather they experience swooning (صعق) and recovery (إفاقة). This is a state (حال) that the contingent being (الممكن) remains upon in the comprehensive Theophany (التجلي الإجمالي), both in this world (دنيا) and the Next Life (آخرة).\n\nThe comprehensiveness (الإجمال) there, in the angels, is the very essence of the ambiguous (المتشابه) for us. This is why they hear the Revelation (الوحي) as if it were a chain upon a smooth rock. Upon recovery (الإفاقة), the detailed explanation (التفصيل) occurs, which is the counterpart of the decisive (المحكم) for us. Therefore, the matter concerning us and them lies between ambiguous verses (آيات متشابهات) and decisive verses (آيات محكمات). The trial (الابتلاء) and the temptation (الفتنة) through the comprehensive (الإجمال) and the ambiguous (المتشابه) encompass both hosts: the Highest Host (الملإ الأعلى) and the Lowest Host (الملإ الأنزل). Such knowledge is produced by this remembrance. And <<Allah says the Truth, and He guides to the way>> (Q 33:4).",
    "ur": "باب نمبر پانچ سو اٹھارہ قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"یہاں تک کہ جب ان کے دلوں سے گھبراہٹ دور کی جاتی ہے، تو وہ کہتے ہیں کہ تمہارے رب نے کیا فرمایا؟ وہ کہتے ہیں: حق (سچ) فرمایا، اور وہی بلند، بڑا ہے\" (سورۃ سبا، ۳۴:۲۳)۔\n\nجو شخص اپنے حال میں بے ہوش ہو جائے،\nاس کی جزا یہ ہے کہ وہ اس ذات سے ناواقف رہے جس نے اسے بے ہوش کیا۔\n\nاگر وہ اپنے حال میں ثابت قدم رہتا،\nتو وہ اس کائنات سے سوال نہ کرتا جس نے اسے حقیقت بخشی۔\n\nوہی ہے جس کے وحی نے اسے مقید کیا،\nاور وہی ہے جس نے اسے اس قید سے آزاد کیا۔\n\nوہ راز کتنا روشن ہے جو اس کی طرف سے دل میں آیا،\nاور اس نے اسے کتنا منور کر دیا۔\n\nاور وہ اپنی مقدار پر محکم (مضبوط) ہے،\nکوئی اضافی چیز اسے نہیں جانتا جو اس پر عمل کرے۔\n\n### [بے شک اللہ کے فرشتے ہیں جن کی ارواح انوار میں ہیں]\n\nجان لو، اللہ ہمیں اور تمہیں اپنی طرف سے روح کے ذریعے تائید بخشے، کہ فرشتے انوار میں ارواح ہیں اور وہ پروں والے ہیں۔ پس جب اللہ تعالیٰ وحی کے ذریعے کسی خاص صورت میں کلام فرماتا ہے اور ان کے کان اس سے متعلق ہو جاتے ہیں، گویا کہ وہ کسی چکنی چٹان پر زنجیر کی آواز ہو، تو فرشتے اس تشبیہ کے سامنے عاجزی کرتے ہوئے اپنے پر مارتے ہیں اور بے ہوش ہو جاتے ہیں۔ یہاں تک کہ جب اللہ ان کے دلوں سے گھبراہٹ دور کرتا ہے (جو کہ ان کا بے ہوشی سے افاقہ ہے)، تو وہ آپس میں کہتے ہیں: کیا کہا گیا؟ ان میں سے بعض کہتے ہیں: تمہارے رب نے (کہا)، یہ اس بات کا اعلان ہے کہ اس کا کلام عین اس کی ذات ہے۔ پھر ان میں سے بعض اس کہنے والے سے کہتے ہیں: الحق (سچ) فرمایا، یعنی قول میں الحق (سچ) فرمایا، اور وہ اس تشبیہ سے العلی (بلند) اور الکبیر (بڑا) ہے، لیکن ہم اسی طرح سنتے ہیں۔\n\nپس ہم سننے سے آئے ہیں،\nوہ ہم میں سے ہے اور ہم میں ہے۔\n\nاس نے دل کو اس وحی کے ذریعے جو اس نے کی،\nایک پوشیدہ بیماری ورثے میں دی۔\n\nیہ اس کی طرف سے نہیں تھا،\nبلکہ یہ ہمارے فہم کی کمزوری کی وجہ سے تھا۔\n\nاور اسی طرح ہر سننے والا،\nتمام مؤمنین میں سے۔\n\nپس جب وہ خود کو شیر بنا لیتا ہے،\nتو میں اس کی کچھار بن جاتا ہوں۔\n\nمیرے دل کے سوا کوئی چیز اسے سما نہیں سکتی،\nیقیناً یہی آیا ہے۔\n\nہر وہ صورت جس میں وہ مجھ پر وقتاً فوقتاً التجلی (ظہور الٰہی) فرماتا ہے۔\n\nپس میں تمہارے سامنے اس میں ایک واضح صبح کی طرح ظاہر ہوتا ہوں۔\n\nاور وہ تمام جہانوں سے حقیقتاً الغنی (بے نیاز) ہے۔\n\nپس جب میں اپنے آپ کو دیکھتا ہوں،\nتو میں صرف المتین (مضبوط) کو دیکھتا ہوں، جو اس کے سوا کسی نام سے نہیں دیکھا جاتا۔\n\nدیکھنے والوں کی آنکھوں میں۔\n\nاور جس نے یہ جان لیا کہ فرشتوں کے دل ہوتے ہیں، یا یہ جان لیا کہ دل کیا ہیں، تو وہ جان لے گا کہ اللہ تعالیٰ نے انہیں اس وحی میں جو انہیں بے ہوش کر دیتی ہے، صرف وہی سنایا جو وحی کے اس پہلو سے مناسبت رکھتا ہے کہ \"ہر دن وہ ایک نئی شان میں ہے\" (الرحمن، ۵۵:۲۹)۔ اور \"اللہ رات اور دن کو بدلتا رہتا ہے\" (النور، ۲۴:۴۴)۔ پس جس کے دل سے اللہ گھبراہٹ دور کرتا ہے، وہ صورتوں میں اس کے پلٹنے اور ان میں اس کے بدلنے کی حقیقت کو دیکھتا ہے۔ چنانچہ وہ جان لیتا ہے کہ پوری کائنات ہر سانس میں تحول (بدلاؤ) اور انقلاب (پلٹاؤ) میں ہے۔ پس اس سے وہ جان لیتا ہے کہ یہ ان شؤون (شانوں) کی وجہ سے ہے جن میں وہ الحق (ذات حق) موجود ہے۔ پس وہی ہے جو رات اور دن کو بدلتا ہے، آسمان میں اس وحی کے ذریعے جو وہ اس میں کرتا ہے، زمین میں اس تقدیر کے ذریعے جو وہ اس میں مقرر کرتا ہے، اور ان دونوں کے درمیان اس چیز کے ذریعے جو وہ نازل کرتا ہے، اور ہم میں اس حال کے ذریعے جس پر ہم ہوتے ہیں۔ اور وہ ہمارے ساتھ ہے جہاں کہیں بھی ہم ہوں۔ پس ہم اس کے تحول کے لیے تحول کرتے ہیں اور اس کے تقلب کے لیے تقلب کرتے ہیں۔ کیونکہ اس کے ناموں میں سے ایک الدھر (زمانہ) ہے۔ اور ہم اس کی بے نیازی (غنی) کی وجہ سے اس کے ذریعے بے نیاز ہوتے ہیں۔ جہاں تک ہمارا بعض فرشتوں کے علم باللہ میں بعض پر فضیلت جاننے کا تعلق ہے، تو یہ اس ذکر میں وارد ہونے والے استفہام کی وجہ سے ہے، ان کے اس قول میں جنہوں نے کہا: \"کیا کہا گیا؟\" اور یہ ان کا قول ہے کہ \"ہم میں سے کوئی نہیں مگر اس کا ایک معلوم مقام ہے\" (الصافات، ۳۷:۱۶۴) علم باللہ میں۔\n\nاور جہاں تک ان کے درمیان سے تہمت کا اٹھ جانا، اور ایک دوسرے کی تصدیق کرنا، اور بعض کا اس چیز سے رنگین ہو جانا جو بعض کے پاس علم باللہ کی صورت میں ہوتی ہے، جس سے وہ ایک دوسرے کو فائدہ پہنچاتے ہیں، تو یہ ان کے اس قول سے ہے جو اللہ نے ان کے بارے میں فرمایا: \"انہوں نے کہا: الحق (سچ)\" ابتداء میں، اور جب ان سے سوال کرنے والے نے کہا: \"تمہارا رب\"، تو انہوں نے کوئی اختلاف نہیں کیا۔ پھر انہیں \"اس کی مثل کوئی چیز نہیں\" (الشوریٰ، ۴۲:۱۱) کے مقام پر قائم کیا گیا، پس انہوں نے اسے صرف ہویت (Huwiyyah - مطلق ذات) میں دیکھا، اور ہویت (Huwiyyah) وہ ہے جو الحق (ذات حق) کی طرف سے ان سے غائب ہو گئی عین اس چیز میں جو التجلی (ظہور الٰہی) ہوئی، اور وہ ہویت (Huwiyyah) اس صورت کی روح ہے جس کا التجلی (ظہور الٰہی) ہوا۔ پس انہوں نے اس کی طرف، یعنی ہویت (Huwiyyah) کی طرف، \"اس کی مثل کوئی چیز نہیں\" (الشوریٰ، ۴۲:۱۱) سے تقیید سے بلندی (علو) اور حصر سے کبریائی (الکبریاء) کی نسبت دی۔ پس انہوں نے کہا: بلکہ اس نے اپنے بارے میں فرمایا، اور یہی وہ معلوم (علم) ہے جو ہمیں کشف (الکشف) نے دیا جب انہوں نے کہا: \"تمہارے رب نے کیا فرمایا؟ انہوں نے کہا: الحق (سچ)\"۔ یہاں فرشتوں کا کلام ختم ہوا۔ پھر اللہ نے فرمایا: \"اور وہی بلند، بڑا ہے\" (العلی الکبیر)، جیسا کہ اس نے ہم سے فرمایا: \"اس کی مثل کوئی چیز نہیں\" (الشوریٰ، ۴۲:۱۱)۔ پس اس نے وہ چیز مقدم کی جو فرشتوں کے خطاب میں مؤخر تھی، اور \"وہی سننے والا، دیکھنے والا ہے\" (السمیع البصیر)۔ پس اس نے ہمارے پاس وہ چیز مؤخر کی جو فرشتوں کے خطاب میں مقدم تھی۔ لہٰذا، جس چیز سے اس نے فرشتوں کو مخاطب کیا اس کی انتہا ہماری ابتدا ہے، اور جس چیز سے اس نے ہمیں مخاطب کیا اور فرشتوں کے قول سے ہمیں اس کے بارے میں جو معرفت (المعرفۃ) ہوئی، وہ ہماری انتہا ہے۔\n\nہم نے وہی کہا جو ان کے لیے ہے،\nاور ان کے لیے وہی ہے جو ہمارے لیے ہے۔\n\nپس تم اس کے کلام میں غور کرو،\nتم اسے واضح پاؤ گے۔\n\nپس اسی کے ذریعے ہم نے راز رکھا،\nاور اسی کے ذریعے ہم نے الحق (ذات حق) کا اعلان کیا۔\n\nپس اگر تم اس کے بارے میں عالم (جاننے والے) نہیں ہو،\nتو تم مؤمن (ایمان لانے والے) ہو۔\n\nاور جب تم اسے جان لیتے ہو،\nتو تم ہمیشہ ہمیں جاننے والے رہتے ہو۔\n\nپس جب اللہ نے ہمارے اور اپنے فرشتوں کے درمیان اس کی معرفت (المعرفۃ) کے عجز میں شراکت قائم کر دی، تو ہم صورت کے لحاظ سے ان پر بڑھ گئے، اور ہم ظاہر میں ان سے جا ملے ان صورتوں کے ذریعے جن میں وہ آخرت کی نشأت میں ظاہر ہوتا ہے، ہمارے ظواہر میں، جیسا کہ ہم آج اپنے باطنوں میں ان کے ذریعے ظاہر ہوتے ہیں۔ پس ہم آخرت میں ان کی نشأت پر ہوں گے، لیکن فرشتوں کے لیے کوئی آخرت نہیں ہے، کیونکہ وہ مرتے نہیں کہ دوبارہ اٹھائے جائیں، بلکہ یہ بے ہوشی (صعق) اور افاقہ ہے، اور یہ وہ حال ہے جس پر ممکن (مخلوق) اجمالی التجلی (ظہور الٰہی) میں دنیا اور آخرت میں ہمیشہ رہتا ہے۔ اور وہاں فرشتوں میں اجمال (اجمالی کیفیت) عین ہمارے ہاں متشابہ (آیات متشابہات) ہے۔ اسی لیے وہ وحی کو سنتے ہیں گویا کہ وہ کسی چکنی چٹان پر زنجیر کی آواز ہو۔ پس افاقے کے وقت وہ تفصیل واقع ہوتی ہے جو ہمارے ہاں محکم (آیات محکمات) کے مماثل ہے۔ پس ہم میں اور ان میں معاملہ آیات متشابہات اور آیات محکمات کے درمیان ہے۔ چنانچہ اجمال اور متشابہ کے ذریعے آزمائش اور فتنہ دونوں جہانوں (الملأین) یعنی ملأ اعلیٰ (عالم بالا) اور ملأ انزل (عالم اسفل) میں عام ہے۔ پس ایسا علم، ایسا علم یہ ذکر پیدا کرتا ہے۔ اور \"اللہ حق (سچ) فرماتا ہے اور وہی راستہ دکھاتا ہے\" (الاحزاب، ۳۳:۴)۔",
    "fa": "باب پانصد و هجدهم در معرفت حال قطبی که منزل او این آیه بود: «تا هنگامی که ترس از دل‌هایشان برطرف شود، می‌گویند: پروردگارتان چه گفت؟ می‌گویند: حق را گفت، و او بلندمرتبه و بزرگ است.» (سوره سبأ، آیه ۲۳)\n\nجزای کسی که در حال خود مدهوش (صعق) شد، *** ندانستن کسی است که او را مدهوش ساخت.\nاگر او در حال خود ثابت می‌ماند، *** از هستی‌ای که او را محقق ساخت، پرسشی نمی‌کرد.\nاو کسی است که وحی‌اش او را مقید ساخت، *** و او کسی است که او را از قیدش رها کرد.\nچه نورانی است آن سِرّی که از او *** به قلب آمد و چه درخشانش ساخت!\nو آن (سِرّ) بر اندازه خود محکم است، *** هیچ افزایشی را کسی که آن را درک کند، نمی‌فهمد.\n\n[درباره اینکه خداوند فرشتگانی دارد که ارواحشان در انوار است]\n\nبدان، خداوند ما و تو را به روحی از جانب خود تأیید کند، که فرشتگان ارواحی در انوار هستند و بالدارند. هنگامی که خداوند با وحی به صورتی خاص سخن می‌گوید و گوش‌های فرشتگان به آن تعلق می‌گیرد، گویی زنجیری است بر سنگ صاف (صفوان) که فرشتگان از سر خضوع برای این تشبیه، بال‌های خود را می‌زنند و مدهوش (صعق) می‌شوند. تا هنگامی که خداوند ترس را از دل‌هایشان برطرف سازد (که همان به هوش آمدنشان از صعق است)، می‌گویند: برخی از شما به برخی دیگر چه می‌گوید؟ برخی می‌گویند: پروردگارتان (گفت)، تا اعلام کنند که کلام او عین ذات اوست. برخی دیگر به این گوینده می‌گویند: حق را (گفت)، یعنی حق (الحق) را به گفتار گفت، و او (الحق) از این تشبیه بلندمرتبه و بزرگ (العلی الکبیر) است، اما ما این‌گونه می‌شنویم.\n\nپس ما از شنیدن آمدیم، *** او از ماست و در ماست.\nبه واسطه آنچه وحی کرد، *** دردی پنهان را به قلب به ارث داد.\nآن (درد) از جانب او نبود، *** بلکه از فهم ما بود که به خطا رفتیم.\nو همچنین است حال هر شنونده‌ای *** از میان همه مؤمنان.\nپس اگر او خود را شیری گرداند، *** من بیشه‌اش خواهم بود.\nجز قلب من او را در بر نمی‌گیرد، *** این‌گونه به یقین آمده است.\nدر هر صورتی که لحظه به لحظه *** بر من تجلی (التجلی) می‌کند.\nپس من در آن صورت‌ها *** نزد شما چون صبحی آشکار ظاهر می‌شوم.\nو او به حق از همه جهانیان بی‌نیاز است.\nپس هنگامی که خود را می‌بینم، *** جز متین (استوار) را نمی‌بینم، که به نامی جز او دیده نمی‌شود\nدر چشمان بینندگان.\n\nو کسی که بداند فرشتگان قلب‌هایی دارند، یا بداند قلب‌ها چه هستند، می‌داند که خداوند متعال در وحی‌ای که آنان را مدهوش ساخت، چیزی به آنان نشنواند مگر آنچه که مناسب وحی «هر روز او در کاری است» (کُلَّ یَوْمٍ هُوَ فِی شَأْنٍ) و «خداوند شب و روز را دگرگون می‌سازد» (وَیُقَلِّبُ اللَّهُ اللَّیْلَ وَالنَّهَارَ) باشد. پس کسی که خداوند ترس را از قلبش برطرف سازد، حقیقت دگرگونی (انقلاب) و تحول او را در صور می‌بیند. پس می‌داند که تمام عالم در هر نَفَس در حال تحول و دگرگونی است. از این رو می‌داند که این تحول به خاطر شئون (امور) است که حق (الحق) در آن‌هاست. پس اوست که قلب را در شب و روز با دگرگون ساختن آن‌ها، و در آسمان با آنچه در آن وحی می‌کند، و در زمین با آنچه در آن مقدر می‌سازد، و در میان آن دو با آنچه در آن نازل می‌کند، و در ما با آنچه بر آن هستیم، دگرگون می‌سازد. و او با ماست هر کجا که باشیم، پس ما به خاطر تحول او متحول می‌شویم و به خاطر تقلب او متقلب می‌گردیم، زیرا یکی از نام‌های او دهر (زمان) است، و ما به واسطه بی‌نیازی او بی‌نیاز می‌شویم. و اما علم ما به برتری برخی فرشتگان بر برخی دیگر در علم به خداوند، به دلیل استفهامی است که در این ذکر آمده، در سخن کسی که از آنان گفت: «چه؟» و این همان سخن آنان است که: «و هیچ یک از ما نیست مگر اینکه برای او مقامی معلوم است» (وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ) در علم به خداوند.\n\nو اما رفع تهمت از میان آنان و تصدیق برخی از آنان نسبت به برخی دیگر، و رنگ گرفتن برخی از آنان به آنچه نزد دیگری است از صورت علم به خداوند، به طوری که برخی به برخی دیگر فایده می‌رسانند، از این سخن خداوند درباره آنان است که در ابتدا گفتند: «حق را گفتند» (قَالُوا الْحَقَّ)، و هنگامی که مسئول به آنان گفت: «پروردگارتان»، نزاعی نکردند. سپس در «چیزی مانند او نیست» (لَیْسَ کَمِثْلِهِ شَیْءٌ) اقامت گزیدند و او را ندیدند مگر در هویت (الهویة)، و هویت همان چیزی است که از حق (الحق) در عین آنچه تجلی (التجلی) کرده، از آنان غایب شده است. و آن هویت (الهویة) روح صورت چیزی است که تجلی کرده است. پس علو از تقیید و کبریا (بزرگی) از حصر را به آن هویت (الهویة) نسبت دادند، از باب «چیزی مانند او نیست». پس گفتند: بلکه او از خود سخن گفت، و این همان معلوم نزد ماست که کشف (الکشف) آن را به ما عطا کرد، هنگامی که گفتند: «پروردگارتان چه گفت؟ گفتند: حق را گفت.» سخن فرشتگان تا اینجا پایان یافت. پس خداوند فرمود: «و او بلندمرتبه و بزرگ است» (وَهُوَ الْعَلِیُّ الْکَبِیرُ)، همان‌گونه که به ما فرمود: «چیزی مانند او نیست». پس آنچه را که در خطاب فرشتگان مؤخر ساخت، مقدم داشت، و «او شنوا و بیناست» (وَهُوَ السَّمِیعُ الْبَصِیرُ) را که در خطاب فرشتگان مقدم داشت، نزد ما مؤخر ساخت. پس نهایت آنچه خداوند با فرشتگان خطاب کرد، آغاز ماست، و آغاز آنچه خداوند با ما خطاب کرد و از سخن فرشتگان درباره او به ما شناساند، نهایت ماست.\n\nما همانند آنچه آنان دارند گفتیم، *** و آنان همانند آنچه ما داریم.\nپس در کلام او بنگرید، *** آن را آشکار خواهید یافت.\nپس به واسطه او اسیر شدیم، *** و به واسطه او حق (الحق) را آشکار ساختیم.\nپس اگر به او دانا نباشی، *** مؤمن خواهی بود.\nو هنگامی که او را دانستی، *** پیوسته عالم به ما خواهی بود.\n\nپس چون خداوند ما و فرشتگانش را در ناتوانی از معرفت (المعرفة) خود شریک ساخت، ما به واسطه صورت (جسم) بر آنان فزونی یافتیم و در ظاهر به آنچه از صور در نشأت آخرت در ظواهر ما ظاهر می‌شود، به آنان ملحق شدیم، همان‌گونه که امروز در بواطن خود به آن صور ظاهر می‌شویم. پس در آخرت بر نشأت آنان خواهیم بود. و فرشتگان آخرتی ندارند، زیرا نمی‌میرند که برانگیخته شوند، بلکه صعق (مدهوشی) و افاقه (به هوش آمدن) دارند، و این حالی است که ممکن (مخلوق) در تجلی (التجلی) اجمالی، در دنیا و آخرت، پیوسته بر آن است. و اجمال در آنجا (در فرشتگان) عین متشابه نزد ماست. به همین دلیل است که وحی را می‌شنوند گویی زنجیری است بر سنگ صاف. پس هنگام افاقه، تفصیلی رخ می‌دهد که نظیر محکمات در ماست. بنابراین، امر در ما و در آنان میان آیات متشابه و آیات محکم است. پس ابتلا و فتنه به واسطه اجمال و متشابه، هر دو گروه (ملأ اعلی و ملأ اسفل) را فرا گرفت. چنین علمی را این ذکر (آیه) نتیجه می‌دهد، و «خداوند حق را می‌گوید و او راه را هدایت می‌کند.» (وَاللَّهُ یَقُولُ الْحَقَّ وَهُوَ یَهْدِی السَّبِیلَ)"
  },
  "page_count": 2
}