{
  "id": 46,
  "title": {
    "ar": "الباب السادس والأربعون في معرفة العلم القليل ومن حصله من الصالحين",
    "en": "Chapter Forty-Six: Concerning the knowledge of the Little Knowledge and those among the righteous who attained it.",
    "ur": "چھالیسواں باب: علم قلیل کی معرفت میں اور یہ کہ صالحین میں سے کس نے اسے حاصل کیا",
    "fa": "باب چهل و ششم در معرفت علم اندک و کسانی از صالحان که آن را به دست آورده‌اند"
  },
  "content": {
    "ar": "## (الباب السادس والأربعون في معرفة العلم القليل ومن حصله من الصالحين)\n\n\n> العلم بالأشياء علم واحد *** والكثر في المعلوم لا في ذاته‏\n\n\n> والأشعري يرى ويزعم أنه *** متعدد في ذاته وصفاته‏\n\n\n> إن الحقيقة قد أبت ما قاله *** ولو أنه من فكره وهباته‏\n\n\n> الحق أبلج لا خفاء بأنه *** متوحد في عينه وسماته‏\n\n\n### [وحدة العلم وكثرة المعلومات‏]\n\n\nقال الله عز وجل وما أُوتِيتُمْ من الْعِلْمِ إِلَّا قَلِيلًا فكان شيخنا أبو مدين يقول إذا سمع من يتلو هذه الآية القليل أعطيناه ما هو لنا بل هو معار عندنا والكثير منه لم نصل إليه فنحن الجاهلون على الدوام وقال من هذا الباب خضر لموسى عليه السلام لما رأى الطائر الذي وقع على حرف السفينة ونقر في البحر بمنقاره أ تدري ما يقول هذا الطائر في نقرة في الماء قال موسى عليه السلام لا أدري قال يا موسى يقول هذا الطائر ما نقص علمي وعلمك من علم الله إلا ما نقص من هذا البحر منقاري‏\n\n\nوالمراد المعلومات بذلك لا العلم فإن العلم لو تعدد أدى أن يدخل في الوجود ما لا يتناهى وهو محال فإن المعلومات لا نهاية لها فلو كان لكل معلوم علم لزم ما قلناه ومعلوم أن الله يعلم ما لا يتناهى فعلمه واحد فلا بد أن يكون للعلم عين واحدة لأنه لا يتعلق بالمعلوم حتى يكون موجودا وما هو ذلك العلم هل هو ذات العالم أو أمر زائد في ذلك خلاف بين النظار في علم الحق سبحانه ومعلوم أن علم الله متعلق بما لا يتناهى فبطل أن يكون لكل معلوم علم وسواء زعمت أن العلم عين ذات العالم أو صفة زائدة على ذاته إلا أن تكون ممن يقول في الصفات إنها نسب وإن كنت ممن يقول إن العلم نسبة خاصة فالنسب لا تتصف بالوجود نعم ولا بالعدم كالأحوال فيمكن على هذا أن يكون لكل معلوم علم وقد علمنا إن المعلومات لا تتناهى فالنسب لا تتناهى ولا يلزم من ذلك محال كحدوث التعلقات عند ابن الخطيب والاسترسال عند إمام الحرمين وبعد أن فهمت ما قررناه في هذه المسألة فقل بعد ذلك ما شئت من نسبة الكثرة للعلم والقلة فما وصف الله العلم بالقلة إلا العلم الذي أعطى الله عباده وهو قوله وما أُوتِيتُمْ أي أعطيتم فجعله هبة وقال في حق عبده خضر وعَلَّمْناهُ من لَدُنَّا عِلْماً وقال علم القرآن فهذا كله يدلك على أنه نسبة لأن الواحد في ذاته لا يتصف بالقلة ولا بالكثرة لأنه لا يتعدد وبهذا نقول إن الواحد ليس بعدد وإن كان العدد منه ينشأ أ لا ترى أن العالم وإن استند إلى الله ولم يلزم أن يكون الله من العالم كذلك الواحد وإن نشأ منه العدد فإنه لا يكون بهذا من العدد فالوحدة للواحد نعت نفسي لا يقبل العدد وإن أضيف إليه فإن كان العلم نسبة فإطلاق القلة والكثرة عليه إطلاق حقيقي وإن كان غير ذلك فإطلاق القلة والكثرة عليه إطلاق مجازي وكلام العرب مبني على الحقيقة والمجاز عند الناس وإن كنا قد خالفناهم في هذه المسألة بالنظر إلى القرآن فإنا ننفي أن يكون في القرآن مجاز بل في كلام العرب وليس هذا موضع شرح هذه المسألة\n\n\n### [العلم الوهبي والعلم الكسبي‏]\n\n\nوالذي يتعلق بهذا الباب علم‏\nالوهب لا علم الكسب فإنه لو أراد الله العلم المكتسب لم يقل أُوتِيتُمْ بل كان يقول أوتيتم الطريق إلى تحصيله لا هو وكان يقول في خضر وعَلَّمْناهُ طريق اكتساب العلوم لم يقل شيئا من هذا ونحن نعلم أن ثم علما اكتسبناه من أفكارنا ومن حواسنا وثم علما لم نكتسبه بشي‏ء من عندنا بل هبة من الله عز وجل أنزله في قلوبنا وعلى أسرارنا فوجدناه من غير سبب ظاهر وهي مسألة دقيقة فإن أكثر الناس يتخيلون أن العلوم الحاصلة عن التقوى علوم وهب وليست كذلك وإنما هي علوم مكتسبة بالتقوى فإن التقوى جعلها الله طريقا إلى حصول هذا العلم فقال إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً وقال واتَّقُوا الله ويُعَلِّمُكُمُ الله كما جعل الفكر الصحيح سببا لحصول العلم لكن بترتيب المقدمات كما جعل البصر سببا لحصول العلم بالمبصرات والعلم الوهبي لا يحصل عن سبب بل من لدنه سبحانه فاعلم ذلك حتى لا تختلط عليك حقائق الأسماء الإلهية فإن الوهاب هو الذي تكون أعطياته على هذا الحد بخلاف الاسم الإلهي الكريم والجواد والسخي فإنه من لا يعرف حقائق الأمور لا يعرف حقائق الأسماء الإلهية ومن لا يعرف حقائق الأسماء الإلهية لا يعرف تنزيل الثناء على الوجه اللائق به فلهذا نبهتك لتنتبه فلا تكونن من الجاهلين‏\n\n\n### [النبوات كلها علوم وهبية لا مكتسبة]\n\n\nفالنبوات كلها علوم وهبية لأن النبوة ليست مكتسبة فالشرائع كلها من علوم الوهب عند أهل الإسلام الذين هم أهله وأريد بالاكتساب في العلوم ما يكون للعبد فيه تعمل كما إن الوهب ما ليس للعبد فيه تعمل وإنما قلنا هذا من أجل الاستعدادات التي جعلت العالم يقبل هذا العلم الوهبي والكسبي فإنه لا بد من الاستعداد فإن وجد بعض الاستعدادات مما يتعمل الإنسان في تحصيلها كان العلم الحاصل عنها مكتسبا كمن عمل بما علم فأورثه الله علم ما لم يكن يعلم وأشباه ذلك فالشرائع كلها علوم وهبية وممن حصل علوم وهب مما ليس بشرع جماعة قليلة من الأولياء منهم الخضر على التعيين فإنه قال من لدنه والذي عرفناه من الأنبياء عليهم السلام آدم والياس وزكريا ويحيى وعيسى وإدريس وإسماعيل وإن كان قد حصله جميع الأنبياء عليهم السلام ولكن ما ذكرنا منهم إلا من حصل لنا التعريف به وسموا لنا من الوجه الذي نأخذ عن الله تعالى منه فلهذا سمينا هؤلاء ولم نذكر غيرهم فأما قوله تعالى وما أُوتِيتُمْ من الْعِلْمِ إِلَّا قَلِيلًا فليس بنص في الوهب ولكن له وجهان وجه يطلبه أوتيتم ووجه يطلبه قليلا من الاستقلال أي ما أعطيتم من العلم إلا ما تستقلون نجمله وما لا تطيقونه ما أعطيناكموه فإنكم ما تستقلون به فيدخل في هذا العطاء علوم النظر فإنها علوم تستقل العقول بإدراكها\n\n\n### [العلم المحدث وتعلقه بما لا يتناهي من المعلومات‏]\n\n\nواختلف أصحابنا في العلم المحدث هل يتعلق بما لا يتناهى من المعلومات أم لا فمن منع أن تعرف ذات الله منع من ذلك ومن لم يمنع من ذلك لم يمنع حصوله ولكن ما نقل إلينا إنه حصل لأحد في الدنيا وما أدري في الآخرة ما يكون فإنا قد علمنا أن محمدا صلى الله عليه وسلم قد علم علم الأولين والآخرين وقد قال صلى الله عليه وسلم عن نفسه إنه يحمد الله غدا يوم القيامة بمحامد عند ما يطلب من الله عز وجل فتح باب الشفاعة أخبر أن الله تعالى يعلمه إياها في ذلك الوقت لا يعلمها الآن فلو علمها غيره لم يصدق‏\n\n\nقوله علمت علم الأولين والآخرين‏\n\n\nوهو صلى الله عليه وسلم الصادق في قوله فحصل من هذا إن أحدا لم يتعلق علمه بما لا يتناهى ولهذا ما تكلم الناس إلا في إمكانه هل يمكن أم لا وما كل ممكن واقع ووقوع الممكنات من المسائل المغلقة وكيف يكون ثم ممكن ولا يقع وهو المعقول عندنا في كل وقت فإن ترجيح أحد الممكنين أو الممكنات يمنع من وقوع ما ليس بمرجح في الحال فإن كان الذي لم يقع في الوجود من الممكنات مرجحا عدم وقوعه في الوجود فيكون عدمه مرجحا فقد وقع الممكن فإنه لا يلزم فيه من حيث الإمكان إلا اتصافه بكونه مرجحا سواء ترجح عدمه أو وجوده وإذا كان كذلك فقد وقع كل ممكن بلا شك وإن لم تتناه الممكنات فإن الترجيح ينسحب عليها وهي مسألة دقيقة فإن الممكنات وإن كانت لا تتناهى وهي معدومة فإنها عندنا مشهودة للحق عز وجل من كونه يرى فإنا لا نعلل الرؤية بالوجود وإنما نعلل الرؤية للأشياء بكون المرئي مستعد القبول تعلق الرؤية به سواء كان معدوما أو موجودا وكل ممكن مستعد للرؤية فالممكنات وإن لم تتناه فهي مرئية لله عز وجل لا من حيث نسبة العلم بل من نسبة خري تسمى رؤية كانت ما كانت قال تعالى أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏ ولم يقل هنا أ لم يعلم بأن الله يعلم وقال تَجْرِي بِأَعْيُنِنا أي بحيث نراها وقال أيضا لموسى وهارون إِنَّنِي مَعَكُما أَسْمَعُ وأَرى‏ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء الرابع والعشرون‏\n(بسم الله الرحمن الرحيم)\n\n",
    "en": "## The Forty-Sixth Chapter concerning the Knowledge of the Little (Knowledge) and those among the Righteous who attained it.\n\nKnowledge of things is a single Knowledge,\nBut the multiplicity resides in the known object, not in its Essence (ذاته).\n\nThe Ash'ari sees and claims that it\nIs multiple in its Essence (ذاته) and its Attributes (صفاته).\n\nIndeed, the Reality (الحقيقة) rejects what he has said,\nEven if it stems from his thought and gifts.\n\nThe Real (الحق) is manifest; there is no obscurity\nThat He is unified in His very Being (عينه) and His characteristics (سماته).\n\n### [The Unity of Knowledge and the Multiplicity of Known Objects]\n\nAllah, the Mighty and Majestic, said: <<وَمَا أُوتِيتُم مِّنَ الْعِلْمِ إِلَّا قَلِيلًا>> (And you have not been given of Knowledge except a little). Our Shaykh, Abu Madyan, used to say when he heard someone recite this verse: \"The little [Knowledge] we were given is not truly ours; rather, it is merely borrowed by us. And the great deal of it we have not reached, so we are perpetually the ignorant ones.\"\n\nRelated to this topic is what Khidr said to Moses (peace be upon him) when he saw the bird that landed on the edge of the ship and dipped its beak into the sea: \"Do you know what this bird says with its dipping into the water?\" Moses (peace be upon him) said, \"I do not know.\" Khidr said, \"O Moses, this bird says: 'My knowledge and your knowledge, compared to the Knowledge of Allah, is only what my beak has diminished from this sea.'\"\n\nWhat is meant by that [statement] is the known objects (المعلومات), not Knowledge (العلم) itself. For if Knowledge were multiple, it would necessitate the entry into Existence (الوجود) of what is infinite, which is impossible. Since the known objects are endless, if there were a distinct Knowledge for every known object, the aforementioned impossibility would follow. It is known that Allah knows what is infinite, so His Knowledge is one. Therefore, Knowledge must have a single Essence (عين واحدة), because it does not relate to the known object until the known object exists. What is that Knowledge? Is it the Essence (ذات) of the Knower, or is it an attribute added to it? This is a point of dispute among the speculative theologians (النظار) regarding the Knowledge of the Real (الحق), glory be to Him.\n\nIt is known that Allah’s Knowledge relates to what is infinite, thus invalidating the notion that there is a distinct Knowledge for every known object. This holds true whether you claim that Knowledge is the very Essence (عين ذات) of the Knower or an Attribute (صفة) added to His Essence (ذاته). This is unless you are among those who say that the Attributes (الصفات) are relations (نسب). If you are among those who say that Knowledge is a specific relation, then relations are not characterized by Existence (الوجود), nor by non-existence, like the states (الأحوال). On this basis, it is possible that there is a distinct Knowledge for every known object. Since we know that the known objects are infinite, the relations are also infinite, and this does not necessitate an impossibility, such as the origination of relations (التعلقات) according to Ibn al-Khatib, or the endless continuation (الاسترسال) according to the Imam of the Two Sanctuaries (Imam al-Haramayn).\n\nAfter you have understood what we have established regarding this issue, then say what you wish concerning the attribution of multiplicity or paucity to Knowledge. Allah only described Knowledge as little when referring to the Knowledge He granted to His servants, which is His saying: <<وَمَا أُوتِيتُمْ>> (And you have not been given), meaning, you have been granted. Thus, He made it a gift (هبة). And concerning His servant Khidr, He said: <<وَعَلَّمْنَاهُ مِن لَّدُنَّا عِلْمًا>> (And We taught him Knowledge from Our Presence). And He said: \"Knowledge of the Qur'an.\" All this indicates to you that it is a relation (نسبة), because the One (الواحد) in His Essence (ذاته) is not characterized by paucity or multiplicity, for He does not multiply. Based on this, we say that the One is not a number, even though number originates from Him. Do you not see that the world (العالم), although it relies upon Allah, it does not necessitate that Allah is part of the world? Likewise, even though number originates from the One, the One is not thereby part of the number. Unity (الوحدة) is an essential characteristic (نعت نفسي) of the One that does not accept number, even if number is attributed to it. If Knowledge is a relation, then applying paucity and multiplicity to it is a literal application (إطلاق حقيقي). If it is otherwise, then applying paucity and multiplicity to it is a metaphorical application (إطلاق مجازي). The speech of the Arabs is based on the literal (الحقيقة) and the metaphorical (المجاز), according to people, although we differ with them on this matter when considering the Qur'an, for we deny that there is metaphor (مجاز) in the Qur'an; rather, it is in the speech of the Arabs. However, this is not the place to elaborate on this issue.\n\n### [Gifted Knowledge (العلم الوهبي) and Acquired Knowledge (العلم الكسبي)]\n\nWhat relates to this chapter is Gifted Knowledge (علم الوهب), not Acquired Knowledge (علم الكسب). For if Allah had intended acquired knowledge, He would not have said <<أُوتِيتُمْ>> (you have been given); rather, He would have said, \"You have been given the path to its attainment,\" not the knowledge itself. And concerning Khidr, He would have said, \"We taught him the path to acquiring knowledge,\" but He said none of this. We know that there is knowledge we acquire through our thoughts and our senses, and there is knowledge we did not acquire through any effort on our part, but rather it is a gift (هبة) from Allah, the Mighty and Majestic, which He sends down into our hearts and upon our innermost secrets (أسرارنا), and we find it without any apparent cause. This is a subtle issue, for most people imagine that the knowledge resulting from piety (التقوى) is Gifted Knowledge (علوم وهب), but this is not the case. Rather, it is knowledge acquired through piety, for Allah made piety a path to the attainment of this knowledge. He said: <<إِن تَتَّقُوا اللَّهَ يَجْعَل لَّكُمْ فُرْقَانًا>> (If you fear Allah, He will grant you a Criterion [Furqan]), and He said: <<وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ>> (And fear Allah, and Allah teaches you). Just as sound thought is made a cause for the attainment of knowledge, but through the arrangement of premises, so too is sight made a cause for the attainment of knowledge of visible things.\n\nGifted Knowledge (العلم الوهبي) is not attained through a cause, but rather directly from His Presence (من لدنه), glory be to Him. Know this so that the realities of the Divine Names (حقائق الأسماء الإلهية) do not become confused for you. For *al-Wahhab* (The Giver of Gifts) is the One whose bestowals are of this nature, unlike the Divine Names *al-Karim* (The Generous), *al-Jawwad* (The Bountiful), and *al-Sakhi* (The Munificent). Indeed, whoever does not know the realities of things does not know the realities of the Divine Names, and whoever does not know the realities of the Divine Names does not know how to apply praise in the manner befitting Him. For this reason, I have alerted you, so pay attention, and do not be among the ignorant.\n\n### [All Prophecies are Gifted Knowledge, not Acquired]\n\nAll prophecies (النبوات) are Gifted Knowledge (علوم وهبية) because prophecy is not acquired. Thus, all Divine Laws (الشرائع) are from the sciences of the Gift (علوم الوهب) according to the People of Islam who are truly its adherents. By acquisition (الاكتساب) in knowledge, I mean that in which the servant has an active role (تعمل). Just as the Gift (الوهب) is that in which the servant has no active role. We only stated this because of the predispositions (الاستعدادات) that make the world (العالم) receptive to both Gifted Knowledge and Acquired Knowledge (الكسبي). For predisposition is necessary. If some predispositions are found that a human actively works to attain, then the resulting knowledge is acquired, such as one who acts upon what he knows, and Allah grants him knowledge of what he did not know, and similar cases. Thus, all Divine Laws are Gifted Knowledge.\n\nAmong those who attained Gifted Knowledge (علوم وهب) that is not part of a Divine Law (شرع) is a small group of the Friends of Allah (الأولياء), specifically Khidr, for he said [it was] \"from His Presence (من لدنه).\" And among the Prophets (peace be upon them) whom we know [to have attained it] are Adam, Elias, Zachariah, John, Jesus, Idris, and Ishmael. Although all the Prophets (peace be upon them) attained it, we only mention those whom we have been specifically informed about and whose names were given to us through the channel from which we receive from Allah, the Exalted. For this reason, we named these and did not mention others. As for His saying, the Exalted: <<وَمَا أُوتِيتُمْ مِنَ الْعِلْمِ إِلَّا قَلِيلًا>> (And you have not been given of Knowledge except a little), this is not an explicit text concerning the Gift (الوهب), but it has two aspects: one aspect demanded by the word *ūtītum* (you have been given), and one aspect demanded by the word *qalīlan* (a little) concerning independence (الاستقلال). That is, you have only been given of Knowledge what you can independently manage in its totality, and what you cannot bear, We have not given you. For you are not independent in managing it. Into this bestowal enters the sciences of speculation (علوم النظر), for they are sciences that the intellects are independent in perceiving.\n\n### [Originated Knowledge (العلم المحدث) and its Relation to Infinite Known Objects]\n\nOur companions differed concerning whether Originated Knowledge (العلم المحدث) relates to infinite known objects (المعلومات) or not. Whoever denied the possibility of knowing the Essence (ذات) of Allah denied this possibility. And whoever did not deny that possibility did not deny its attainment. However, it has not been transmitted to us that anyone attained it in this world, and I do not know what will happen in the Hereafter. We know that Muhammad (may Allah bless him and grant him peace) knew the knowledge of the first and the last. He (may Allah bless him and grant him peace) said concerning himself that tomorrow, on the Day of Resurrection, when he seeks from Allah, the Mighty and Majestic, the opening of the door of intercession, he will praise Allah with praises that Allah will teach him at that time, which he does not know now. If someone else knew them, his saying, \"I know the knowledge of the first and the last,\" would not be true, yet he (may Allah bless him and grant him peace) is truthful in his statement. From this, it follows that no one's knowledge relates to the infinite. For this reason, people only discussed its possibility: Is it possible or not? Not every possible thing occurs. The occurrence of possible things (الممكنات) is among the intricate issues. How can something be possible and yet not occur? This is what is intelligible to us at all times. For the preference (ترجيح) of one of the two possibilities, or the possible things, prevents the occurrence of what is not currently preferred. If that which has not occurred in Existence (الوجود) among the possible things has its non-occurrence in Existence preferred, then its non-existence is preferred, and thus the possible thing has occurred. For, in terms of possibility (الإمكان), it is only required to be characterized by being preferred, whether its non-existence or its existence is preferred. If this is the case, then every possible thing has undoubtedly occurred, even if the possible things are infinite, for the preference extends over them. This is a subtle issue.\n\nFor even though the possible things are infinite and non-existent (معدومة), they are witnessed (مشهودة) by the Real (الحق), the Mighty and Majestic, by virtue of His seeing. We do not condition vision (الرؤية) upon existence; rather, we condition the vision of things upon the seen object being prepared to accept the relation of vision to it, whether it is non-existent or existent. Every possible thing is prepared for vision. Thus, even if the possible things are infinite, they are seen (مرئية) by Allah, the Mighty and Majestic, not through the relation of Knowledge (العلم), but through another relation called Vision (رؤية), whatever its nature may be. The Exalted said: <<أَلَمْ يَعْلَم بِأَنَّ اللَّهَ يَرَى>> (Does he not know that Allah sees?), and He did not say here, \"Does he not know that Allah knows?\" And He said: <<تَجْرِي بِأَعْيُنِنَا>> (Sailing under Our eyes), meaning, in a way that We see it. And He also said to Moses and Aaron: <<إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَى>> (Indeed, I am with you both; I hear and I see). And Allah speaks the Truth (الحق), and He guides to the Way (السبيل).\n\n[End of the Twenty-Fourth Section]\n\n[In the Name of Allah, the Most Compassionate, the Most Merciful]",
    "ur": "باب چھیالیسواں: علم قلیل کی معرفت میں اور ان صالحین کے بیان میں جنہوں نے اسے حاصل کیا\n\nاشیاء کا علم ایک ہی علم ہے، اور کثرت معلومات میں ہے نہ کہ اس کی ذات میں۔\nاور اشعری یہ رائے رکھتے ہیں اور دعویٰ کرتے ہیں کہ وہ (علم) اپنی ذات اور صفات میں متعدد ہے۔\nحقیقت نے اس بات کو رد کر دیا ہے جو اس نے کہی، اگرچہ وہ اس کی فکر اور اس کی عطا کردہ چیزوں میں سے ہو۔\nحق (الحق) واضح ہے، اس میں کوئی پوشیدگی نہیں کہ وہ اپنی اصل اور اپنی علامات میں یکتا ہے۔\n\n[علم کی وحدت اور معلومات کی کثرت]\n\nاللہ عزوجل نے فرمایا: \"اور تمہیں علم میں سے بہت تھوڑا ہی دیا گیا ہے\" (وَمَا أُوتِيتُم مِّنَ الْعِلْمِ إِلَّا قَلِيلًا)۔ چنانچہ ہمارے شیخ ابو مدین (رحمہ اللہ) جب کسی کو یہ آیت تلاوت کرتے سنتے تو فرماتے: \"جو قلیل ہمیں عطا کیا گیا ہے وہ ہمارا نہیں، بلکہ ہمارے پاس عاریت (عارضی) ہے، اور ہم اس کے کثیر حصے تک نہیں پہنچ پائے، لہٰذا ہم ہمیشہ جاہل ہیں۔\"\n\nاور اسی باب سے خضر (علیہ السلام) کا موسیٰ (علیہ السلام) سے کہنا ہے، جب انہوں نے ایک پرندے کو دیکھا جو کشتی کے کنارے پر بیٹھا اور اپنی چونچ سے سمندر میں چونچ ماری۔ (خضر نے کہا:) \"کیا تم جانتے ہو کہ یہ پرندہ پانی میں چونچ مار کر کیا کہہ رہا ہے؟\" موسیٰ (علیہ السلام) نے فرمایا: \"میں نہیں جانتا۔\" خضر نے کہا: \"اے موسیٰ! یہ پرندہ کہہ رہا ہے کہ میرے اور تمہارے علم نے اللہ کے علم میں سے اتنا ہی کم کیا ہے جتنا میری چونچ نے اس سمندر میں سے کم کیا ہے۔\"\n\nاس سے مراد معلومات (المعلومات) ہیں نہ کہ علم (العلم)، کیونکہ اگر علم (العلم) متعدد ہوتا تو اس کا نتیجہ یہ نکلتا کہ ہستی (الوجود) میں ایسی چیزیں داخل ہو جاتیں جن کی کوئی انتہا نہیں، اور یہ محال ہے۔ چونکہ معلومات کی کوئی انتہا نہیں، اگر ہر معلوم کے لیے ایک علم ہوتا تو وہی لازم آتا جو ہم نے کہا۔ اور یہ معلوم ہے کہ اللہ لامتناہی چیزوں کو جانتا ہے، لہٰذا اس کا علم (العلم) واحد ہے۔\n\nلہٰذا علم (العلم) کی ایک ہی اصل (عین واحدۃ) ہونی چاہیے، کیونکہ وہ معلوم سے متعلق نہیں ہوتا جب تک کہ وہ موجود نہ ہو۔ اور وہ علم کیا ہے؟ کیا وہ عالم کی ذات ہے یا کوئی زائد امر؟ اس بارے میں ذات حق (الحق) کے علم کے متعلق نظریہ دانوں میں اختلاف ہے۔\n\nیہ معلوم ہے کہ اللہ کا علم لامتناہی چیزوں سے متعلق ہے، لہٰذا ہر معلوم کے لیے ایک علم کا ہونا باطل ہے۔ اور یہ برابر ہے کہ تم یہ دعویٰ کرو کہ علم عالم کی ذات کی اصل ہے یا اس کی ذات پر زائد صفت ہے، سوائے اس کے کہ تم ان لوگوں میں سے ہو جو صفات کو نسبتیں (نسب) کہتے ہیں۔ اور اگر تم ان لوگوں میں سے ہو جو کہتے ہیں کہ علم ایک خاص نسبت (نسبۃ خاصۃ) ہے، تو نسبتیں نہ تو وجود (الوجود) سے متصف ہوتی ہیں اور نہ ہی عدم سے، جیسے کہ احوال (States)۔ اس صورت میں یہ ممکن ہے کہ ہر معلوم کے لیے ایک علم ہو۔ اور ہم جانتے ہیں کہ معلومات لامتناہی ہیں، لہٰذا نسبتیں لامتناہی ہوں گی، اور اس سے کوئی محال لازم نہیں آتا، جیسا کہ ابن الخطیب کے نزدیک تعلقات کا حادث ہونا اور امام الحرمین کے نزدیک استرسال (تسلسل)۔\n\nجب تم اس مسئلے میں ہماری مقرر کردہ بات کو سمجھ چکے ہو، تو اس کے بعد تم علم (العلم) کے لیے کثرت یا قلت کی نسبت کے بارے میں جو چاہو کہو۔ اللہ نے علم کو قلت سے متصف نہیں کیا مگر اس علم کو جو اس نے اپنے بندوں کو عطا کیا، اور یہی اس کا قول ہے: \"وَمَا أُوتِيتُمْ\" (یعنی تمہیں عطا کیا گیا)۔ پس اس نے اسے ہبہ (عطا) قرار دیا۔ اور اپنے بندے خضر کے حق میں فرمایا: \"اور ہم نے اسے اپنے پاس سے ایک علم سکھایا تھا\" (وَعَلَّمْنَاهُ مِن لَّدُنَّا عِلْمًا)۔ اور فرمایا: \"قرآن کا علم\" (عِلْمَ الْقُرْآنِ)۔\n\nیہ سب تمہیں اس بات کی طرف رہنمائی کرتا ہے کہ یہ ایک نسبت ہے، کیونکہ جو اپنی ذات میں واحد ہے وہ قلت یا کثرت سے متصف نہیں ہوتا، کیونکہ وہ متعدد نہیں ہوتا۔ اور اسی بنا پر ہم کہتے ہیں کہ واحد (الواحد) عدد نہیں ہے، اگرچہ عدد اسی سے پیدا ہوتا ہے۔ کیا تم نہیں دیکھتے کہ عالم اگرچہ اللہ پر منحصر ہے، لیکن یہ لازم نہیں آتا کہ اللہ عالم میں سے ہو؟ اسی طرح واحد (الواحد) اگرچہ عدد کو جنم دیتا ہے، لیکن وہ اس وجہ سے عدد میں سے نہیں ہوتا۔ پس وحدت (الوحدۃ) واحد کے لیے ایک ذاتی صفت (نعت نفسی) ہے جو عدد کو قبول نہیں کرتی، اگرچہ اسے اس کی طرف منسوب کیا جائے۔\n\nاگر علم ایک نسبت ہے، تو اس پر قلت اور کثرت کا اطلاق حقیقی اطلاق ہے، اور اگر وہ اس کے علاوہ ہے، تو اس پر قلت اور کثرت کا اطلاق مجازی اطلاق ہے۔ اور لوگوں کے نزدیک عربوں کا کلام حقیقت اور مجاز پر مبنی ہے، اگرچہ ہم نے قرآن کے نقطہ نظر سے اس مسئلے میں ان سے اختلاف کیا ہے، کیونکہ ہم قرآن میں مجاز ہونے کی نفی کرتے ہیں، بلکہ وہ عربوں کے کلام میں ہے۔ اور یہ اس مسئلے کی وضاحت کا مقام نہیں ہے۔\n\n[علم وہبی اور علم کسبی]\n\nاور جو چیز اس باب سے متعلق ہے وہ علم وہبی (العلم الوهبي) ہے نہ کہ علم کسبی (العلم الكسبي)، کیونکہ اگر اللہ کا ارادہ علم مکتسب (حاصل کردہ) ہوتا تو وہ \"أُوتِيتُمْ\" (تمہیں دیا گیا) نہ فرماتا، بلکہ وہ کہتا کہ تمہیں اس کے حصول کا راستہ دیا گیا ہے نہ کہ وہ علم۔ اور خضر کے بارے میں وہ کہتا کہ \"ہم نے اسے علوم کے کسب کرنے کا راستہ سکھایا\"، لیکن اس نے ایسا کچھ نہیں کہا۔\n\nاور ہم جانتے ہیں کہ ایک علم وہ ہے جو ہم نے اپنی فکروں اور اپنے حواس سے حاصل کیا ہے، اور ایک علم وہ ہے جو ہم نے اپنی طرف سے کسی چیز کے ذریعے حاصل نہیں کیا، بلکہ وہ اللہ عزوجل کی طرف سے ایک ہبہ (عطا) ہے جسے اس نے ہمارے دلوں اور ہمارے باطن (أسرارنا) میں نازل کیا، اور ہم نے اسے کسی ظاہری سبب کے بغیر پایا۔\n\nیہ ایک دقیق مسئلہ ہے، کیونکہ اکثر لوگ یہ خیال کرتے ہیں کہ تقویٰ سے حاصل ہونے والے علوم، علوم وہبی ہیں، حالانکہ ایسا نہیں ہے۔ بلکہ وہ تقویٰ کے ذریعے حاصل کیے گئے علوم مکتسبہ (حاصل کردہ) ہیں۔ کیونکہ اللہ نے تقویٰ کو اس علم کے حصول کا راستہ بنایا ہے، چنانچہ فرمایا: \"اگر تم اللہ سے ڈرو گے تو وہ تمہارے لیے فرقان (حق و باطل میں تمیز) پیدا کر دے گا\" (إِن تَتَّقُوا اللَّهَ يَجْعَل لَّكُمْ فُرْقَانًا)۔ اور فرمایا: \"اور اللہ سے ڈرو، اور اللہ تمہیں سکھاتا ہے\" (وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ)۔\n\nجس طرح صحیح فکر کو مقدمات کی ترتیب کے ذریعے علم کے حصول کا سبب بنایا گیا ہے، اسی طرح بصارت کو مبصرات کے علم کے حصول کا سبب بنایا گیا ہے۔ اور علم وہبی (العلم الوهبي) کسی سبب سے حاصل نہیں ہوتا، بلکہ وہ سبحانہ کی طرف سے ہوتا ہے (مِن لَّدُنْهُ)۔ یہ جان لو تاکہ تم پر اسماء الٰہیہ (الأسماء الإلهية) کی حقیقتیں خلط نہ ہو جائیں۔ کیونکہ الوہاب (الوهاب) وہ ہے جس کی عطائیں اس حد پر ہوں، بخلاف اسم الٰہی الکریم (الکریم)، الجواد (الجواد) اور السخی (السخی) کے۔ پس جو شخص امور کی حقیقتوں کو نہیں جانتا، وہ اسماء الٰہیہ کی حقیقتوں کو نہیں جانتا، اور جو اسماء الٰہیہ کی حقیقتوں کو نہیں جانتا، وہ اس کی تعریف کو اس کے شایان شان طریقے پر نازل کرنا نہیں جانتا۔ اسی لیے میں نے تمہیں متنبہ کیا ہے تاکہ تم ہوشیار ہو جاؤ اور جاہلوں میں سے نہ ہو۔\n\n[نبوتیں سب کی سب علوم وہبی ہیں نہ کہ کسبی]\n\nپس تمام نبوتیں علوم وہبی (علوم وهبية) ہیں، کیونکہ نبوت کسبی (حاصل کردہ) نہیں ہے۔ لہٰذا تمام شرائع اہل اسلام کے نزدیک، جو اس کے اہل ہیں، علوم وہب میں سے ہیں۔ اور علوم میں کسب (اكتساب) سے میری مراد وہ ہے جس میں بندے کا عمل دخل ہو، جیسا کہ وہب (عطا) وہ ہے جس میں بندے کا کوئی عمل دخل نہ ہو۔\n\nہم نے یہ بات ان استعدادات (استعدادات) کی وجہ سے کہی ہے جو عالم کو اس علم وہبی اور کسبی کو قبول کرنے کے قابل بناتی ہیں۔ کیونکہ استعداد (استعداد) کا ہونا ضروری ہے۔ اگر کچھ ایسی استعدادات پائی جائیں جن کے حصول میں انسان عمل کرتا ہے، تو ان سے حاصل ہونے والا علم مکتسب (حاصل کردہ) ہوتا ہے، جیسے وہ شخص جس نے اپنے علم پر عمل کیا تو اللہ نے اسے اس علم کا وارث بنا دیا جو وہ نہیں جانتا تھا، اور اسی طرح کی مثالیں۔\n\nپس تمام شرائع علوم وہبی ہیں۔ اور ان لوگوں میں سے جنہوں نے علوم وہب حاصل کیے جو شریعت نہیں ہیں، اولیاء کی ایک چھوٹی جماعت ہے، جن میں خضر (علیہ السلام) خاص طور پر شامل ہیں، کیونکہ انہوں نے کہا تھا: \"مِن لَّدُنْهُ\" (اپنے پاس سے)۔ اور جن انبیاء (علیہم السلام) کو ہم نے پہچانا ہے وہ آدم، الیاس، زکریا، یحییٰ، عیسیٰ، ادریس اور اسماعیل ہیں، اگرچہ تمام انبیاء (علیہم السلام) نے اسے حاصل کیا ہے، لیکن ہم نے ان میں سے صرف ان کا ذکر کیا ہے جن کی معرفت (المعرفۃ) ہمیں حاصل ہوئی اور جن کا نام ہمیں اس ذریعے سے بتایا گیا جس سے ہم اللہ تعالیٰ سے لیتے ہیں۔ اسی لیے ہم نے ان کا نام لیا اور دوسروں کا ذکر نہیں کیا۔\n\nجہاں تک اللہ تعالیٰ کے قول \"اور تمہیں علم میں سے بہت تھوڑا ہی دیا گیا ہے\" (وَمَا أُوتِيتُم مِّنَ الْعِلْمِ إِلَّا قَلِيلًا) کا تعلق ہے، تو یہ وہب (عطا) کے بارے میں نص نہیں ہے، بلکہ اس کے دو پہلو ہیں۔ ایک پہلو \"أُوتِيتُمْ\" (تمہیں دیا گیا) کا متقاضی ہے، اور دوسرا پہلو \"قَلِيلًا\" (تھوڑا) کا متقاضی ہے، یعنی استقلال (خود مختاری) کے لحاظ سے۔ یعنی تمہیں علم میں سے صرف وہی دیا گیا ہے جس پر تم خود مختار ہو سکتے ہو، اور جو تمہاری طاقت سے باہر ہے وہ ہم نے تمہیں نہیں دیا۔ اس عطا میں علوم نظری (علوم النظر) بھی شامل ہیں، کیونکہ یہ وہ علوم ہیں جن کے ادراک پر عقلیں خود مختار ہوتی ہیں۔\n\n[علم محدث اور معلومات کی لامتناہیت سے اس کا تعلق]\n\nاور ہمارے اصحاب نے علم محدث (العلم المحدث) کے بارے میں اختلاف کیا ہے کہ کیا وہ معلومات کی لامتناہیت سے متعلق ہو سکتا ہے یا نہیں؟ جس نے ذات حق (الحق) کی معرفت (المعرفۃ) سے منع کیا، اس نے اس سے بھی منع کیا، اور جس نے اس سے منع نہیں کیا، اس نے اس کے حصول سے منع نہیں کیا۔ لیکن ہمیں یہ بات منتقل نہیں ہوئی کہ دنیا میں کسی کو یہ حاصل ہوا ہو، اور میں نہیں جانتا کہ آخرت میں کیا ہوگا۔\n\nہم جانتے ہیں کہ محمد صلی اللہ علیہ وسلم کو اولین و آخرین کا علم عطا کیا گیا ہے۔ اور آپ صلی اللہ علیہ وسلم نے قیامت کے دن اپنے بارے میں فرمایا کہ جب آپ اللہ عزوجل سے شفاعت کا دروازہ کھولنے کی درخواست کریں گے تو آپ ایسی تعریفوں (محامد) کے ساتھ اللہ کی حمد کریں گے جو اللہ تعالیٰ آپ کو اسی وقت سکھائے گا، آپ کو وہ ابھی معلوم نہیں ہیں۔ اگر وہ علم کسی اور کو معلوم ہوتا تو آپ کا یہ قول سچا نہ ہوتا: \"میں نے اولین و آخرین کا علم جان لیا ہے۔\" حالانکہ آپ صلی اللہ علیہ وسلم اپنے قول میں سچے ہیں۔\n\nپس اس سے یہ نتیجہ نکلا کہ کسی کا علم بھی لامتناہی چیزوں سے متعلق نہیں ہوا۔ اور اسی وجہ سے لوگوں نے صرف اس کے امکان (امکان) کے بارے میں بات کی ہے کہ کیا یہ ممکن ہے یا نہیں؟ اور ہر ممکن چیز واقع نہیں ہوتی۔ اور ممکنات کا وقوع ان مسائل میں سے ہے جو بند ہیں (مغلقہ)۔\n\nاور یہ کیسے ہو سکتا ہے کہ کوئی ممکن چیز ہو اور وہ واقع نہ ہو، حالانکہ یہ ہمارے نزدیک ہر وقت معقول ہے۔ کیونکہ دو ممکنات یا ممکنات میں سے کسی ایک کو ترجیح دینا اس چیز کے وقوع کو روکتا ہے جسے فی الحال ترجیح نہیں دی گئی ہے۔ اگر وجود میں نہ آنے والی ممکنات کو وجود میں نہ آنے کی ترجیح دی گئی ہے، تو اس کا عدم مرجح (ترجیح یافتہ) ہو گیا ہے۔ پس ممکن واقع ہو گیا، کیونکہ امکان کے لحاظ سے اس میں صرف یہ لازم ہے کہ وہ مرجح ہونے کی صفت سے متصف ہو، خواہ اس کے عدم کو ترجیح دی جائے یا اس کے وجود کو۔ اور جب ایسا ہے، تو ہر ممکن چیز بلاشبہ واقع ہو چکی ہے، اگرچہ ممکنات لامتناہی نہ ہوں، کیونکہ ترجیح ان سب پر لاگو ہوتی ہے۔\n\nیہ ایک دقیق مسئلہ ہے، کیونکہ ممکنات اگرچہ لامتناہی ہیں اور معدوم ہیں، لیکن وہ ہمارے نزدیک ذات حق (الحق عز وجل) کے لیے مشہود (شہود) ہیں، اس اعتبار سے کہ وہ دیکھتا ہے۔ کیونکہ ہم رؤیت (دیکھنے) کی علت وجود (الوجود) کو نہیں ٹھہراتے، بلکہ ہم اشیاء کے لیے رؤیت کی علت یہ ٹھہراتے ہیں کہ مرئی (دیکھی جانے والی چیز) رؤیت کے تعلق کو قبول کرنے کے لیے مستعد ہو، خواہ وہ معدوم ہو یا موجود۔ اور ہر ممکن چیز رؤیت کے لیے مستعد ہے۔ پس ممکنات اگرچہ لامتناہی ہیں، وہ اللہ عزوجل کے لیے مرئی ہیں، نہ کہ علم (العلم) کی نسبت سے، بلکہ ایک دوسری نسبت سے جسے رؤیت (رؤية) کہا جاتا ہے، خواہ وہ کچھ بھی ہو۔\n\nاللہ تعالیٰ نے فرمایا: \"کیا اسے معلوم نہیں کہ اللہ دیکھ رہا ہے؟\" (أَلَمْ يَعْلَم بِأَنَّ اللَّهَ يَرَىٰ)۔ اور یہاں یہ نہیں فرمایا کہ \"کیا اسے معلوم نہیں کہ اللہ جانتا ہے؟\" اور فرمایا: \"وہ ہماری آنکھوں کے سامنے چلتی تھی\" (تَجْرِي بِأَعْيُنِنَا) یعنی اس طرح کہ ہم اسے دیکھتے ہیں۔ اور موسیٰ اور ہارون سے بھی فرمایا: \"میں تمہارے ساتھ ہوں، سنتا اور دیکھتا ہوں\" (إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَىٰ)۔\n\nاور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔ چوبیسواں حصہ مکمل ہوا۔\n\n(شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے)",
    "fa": "(باب چهل و ششم در معرفت علم اندک و کسانی از صالحان که آن را به دست آورده‌اند)\n\nعلم به اشیاء، علمی واحد است\nو کثرت در معلوم است نه در ذات آن (والكثر في المعلوم لا في ذاته‏)\nاشعری می‌بیند و گمان می‌برد که\nعلم در ذات و صفاتش متعدد است (متعدد في ذاته وصفاته‏)\nحقیقت آنچه را او گفته است رد می‌کند\nهرچند که از فکر و عطایای او باشد (ولو أنه من فكره وهباته‏)\nحق (الحق) آشکار است و پنهانی نیست که\nدر عین و نشانه‌هایش یگانه است (متوحد في عينه وسماته‏)\n\n[وحدت علم و کثرت معلومات]\n\nخداوند عز و جل فرمود: «و جز اندکی از علم به شما داده نشده است» (وَمَا أُوتِيتُم مِّنَ الْعِلْمِ إِلَّا قَلِيلًا). شیخ ما ابومدین هرگاه می‌شنید کسی این آیه را تلاوت می‌کند، می‌فرمود: «آن اندکی که به ما داده شده، از آنِ ما نیست، بلکه نزد ما عاریه است؛ و به بسیاری از آن نرسیده‌ایم، پس ما پیوسته جاهلیم.» و از همین باب است که خضر به موسی علیه السلام گفت، هنگامی که پرنده‌ای را دید که بر لبه کشتی نشست و با منقارش در دریا نوک زد: «آیا می‌دانی این پرنده در نوک زدنش به آب چه می‌گوید؟» موسی علیه السلام گفت: «نمی‌دانم.» خضر گفت: «ای موسی، این پرنده می‌گوید: علم من و علم تو از علم خدا نکاسته است مگر به اندازه‌ای که منقارم از این دریا کاسته است.»\n\nمنظور از آن [سخن پرنده] معلومات است نه علم؛ زیرا اگر علم متعدد باشد، منجر به این می‌شود که در هستی (الوجود) چیزی نامتناهی وارد شود، و این محال است. معلومات پایان ندارند، پس اگر برای هر معلومی علمی وجود داشت، آنچه گفتیم لازم می‌آمد. و معلوم است که خداوند آنچه را که نامتناهی است می‌داند، پس علم او واحد است. بنابراین، علم باید عین واحدی داشته باشد، زیرا علم به معلوم تعلق نمی‌گیرد مگر آنکه موجود باشد. و آن علم چیست؟ آیا ذات عالم است یا امری زائد؟ در این باره میان متفکران در مورد علم حق (الحق) سبحانه اختلاف است. و معلوم است که علم خدا به آنچه نامتناهی است تعلق دارد، پس باطل است که برای هر معلومی علمی وجود داشته باشد. و فرقی نمی‌کند که گمان بری علم عین ذات عالم است یا صفتی زائد بر ذات او، مگر آنکه از کسانی باشی که در مورد صفات می‌گویند آن‌ها نسبت‌ها (النسب) هستند. و اگر از کسانی باشی که می‌گویند علم یک نسبت خاص است، نسبت‌ها به وجود متصف نمی‌شوند، و نه به عدم، مانند احوال. بر این اساس ممکن است که برای هر معلومی علمی وجود داشته باشد. و ما می‌دانیم که معلومات نامتناهی هستند، پس نسبت‌ها نامتناهی‌اند و از این امر محالی لازم نمی‌آید، مانند حدوث تعلقات نزد ابن الخطیب و استرسال نزد امام الحرمین. و پس از آنکه آنچه را در این مسئله مقرر کردیم فهمیدی، پس از آن هر چه می‌خواهی از نسبت کثرت و قلت به علم بگو. خداوند علم را به قلت وصف نکرده است مگر علمی را که به بندگانش عطا کرده است، و آن قول اوست: «وَمَا أُوتِيتُم» یعنی عطا شدید، پس آن را هبه قرار داد. و در حق بنده خود خضر فرمود: «وَعَلَّمْنَاهُ مِن لَّدُنَّا عِلْمًا» (و از نزد خود علمی به او آموختیم). و فرمود: «علم القرآن». این همه دلالت می‌کند بر اینکه علم یک نسبت است، زیرا واحد در ذات خود به قلت و کثرت متصف نمی‌شود، چون تعدد نمی‌پذیرد. و به همین دلیل می‌گوییم که واحد عدد نیست، هرچند که عدد از آن نشأت می‌گیرد. آیا نمی‌بینی که عالم اگرچه به خدا استناد دارد، اما لازم نمی‌آید که خدا جزئی از عالم باشد؟ همچنین واحد اگرچه عدد از آن نشأت می‌گیرد، اما به این سبب جزئی از عدد نمی‌شود. وحدت برای واحد، نعت نفسی است که عدد را نمی‌پذیرد، هرچند به آن اضافه شود. پس اگر علم یک نسبت باشد، اطلاق قلت و کثرت بر آن اطلاقی حقیقی است، و اگر غیر از این باشد، اطلاق قلت و کثرت بر آن اطلاقی مجازی است. و کلام عرب نزد مردم بر حقیقت و مجاز بنا شده است، هرچند ما در این مسئله با نظر به قرآن با آن‌ها مخالفت کرده‌ایم، زیرا ما نفی می‌کنیم که در قرآن مجاز باشد، بلکه مجاز در کلام عرب است. و این جایگاه شرح این مسئله نیست.\n\n[علم وهبی (عطایی) و علم کسبی (اکتسابی)]\n\nآنچه به این باب تعلق دارد، علم وهبی (عطایی) است نه علم کسبی (اکتسابی). زیرا اگر خداوند علم اکتسابی را اراده می‌کرد، نمی‌فرمود: «أُوتِيتُمْ» (به شما داده شد)، بلکه می‌فرمود: «به شما راه دستیابی به آن داده شد، نه خود آن.» و در مورد خضر می‌فرمود: «و راه کسب علوم را به او آموختیم.» اما هیچ یک از این‌ها را نگفته است. و ما می‌دانیم که علمی هست که آن را از افکار و حواس خود کسب کرده‌ایم، و علمی هست که آن را با هیچ چیز از جانب خود کسب نکرده‌ایم، بلکه هبه‌ای از جانب خداوند عز و جل است که آن را در قلب‌ها و بر اسرار ما نازل کرده است، و ما آن را بدون سبب ظاهری یافته‌ایم. و این مسئله‌ای دقیق است، زیرا بیشتر مردم تصور می‌کنند که علوم حاصل از تقوا، علوم وهبی هستند، در حالی که چنین نیستند، بلکه علوم اکتسابی به واسطه تقوا هستند. زیرا خداوند تقوا را راهی برای حصول این علم قرار داده است، چنانکه فرمود: «إِن تَتَّقُوا اللَّهَ يَجْعَل لَّكُمْ فُرْقَانًا» (اگر از خدا پروا کنید، برای شما [نیروی] تشخیص قرار می‌دهد). و فرمود: «وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ» (و از خدا پروا کنید و خدا به شما می‌آموزد). همان‌طور که فکر صحیح را سبب حصول علم قرار داده است، اما با ترتیب مقدمات، چنانکه بینایی را سبب حصول علم به دیدنی‌ها قرار داده است. و علم وهبی (عطایی) از سببی حاصل نمی‌شود، بلکه از نزد او سبحانه است. این را بدان تا حقایق اسماء الهی بر تو مشتبه نشود، زیرا وهاب کسی است که عطایایش بر این حد باشد، برخلاف اسم‌های الهی کریم، جواد و سخی. کسی که حقایق امور را نمی‌شناسد، حقایق اسماء الهی را نمی‌شناسد، و کسی که حقایق اسماء الهی را نمی‌شناسد، نمی‌تواند ثنا را به وجه شایسته بر او نازل کند. به همین دلیل تو را آگاه ساختم تا بیدار شوی و از جاهلان نباشی.\n\n[نبوت‌ها همگی علوم وهبی (عطایی) هستند نه اکتسابی]\n\nپس نبوت‌ها همگی علوم وهبی (عطایی) هستند، زیرا نبوت اکتسابی نیست. بنابراین، شرایع همگی از علوم وهبی نزد اهل اسلام که شایسته آن هستند، می‌باشند. و منظور من از اکتساب در علوم، آن چیزی است که بنده در آن تلاش و عمل داشته باشد، همان‌طور که وهب (عطا) آن چیزی است که بنده در آن تلاشی ندارد. و ما این را به خاطر استعدادهایی گفتیم که عالم را پذیرای این علم وهبی و کسبی می‌سازد، زیرا وجود استعداد ضروری است. اگر برخی از استعدادها که انسان در تحصیل آن‌ها تلاش می‌کند، یافت شود، علم حاصل از آن‌ها اکتسابی خواهد بود، مانند کسی که به آنچه می‌داند عمل کند و خداوند علم آنچه را نمی‌دانست به او به ارث دهد و امثال آن. پس شرایع همگی علوم وهبی هستند. و از کسانی که علوم وهبی غیر شرعی را به دست آورده‌اند، گروه اندکی از اولیاء هستند که از جمله آن‌ها خضر به طور مشخص است، زیرا او گفت: «مِن لَّدُنَّا» (از نزد ما). و از پیامبران علیهم السلام کسانی که ما شناختیم آدم، الیاس، زکریا، یحیی، عیسی، ادریس و اسماعیل هستند. اگرچه همه پیامبران علیهم السلام آن را به دست آورده‌اند، اما ما تنها کسانی را ذکر کردیم که تعریف آن‌ها برای ما حاصل شده و از وجهی که ما از خداوند متعال از آن می‌گیریم، برای ما نام برده شده‌اند. به همین دلیل این‌ها را نام بردیم و دیگران را ذکر نکردیم. اما قول خداوند متعال: «وَمَا أُوتِيتُم مِّنَ الْعِلْمِ إِلَّا قَلِيلًا» (و جز اندکی از علم به شما داده نشده است)، نص صریح در وهب (عطا) نیست، بلکه دو وجه دارد: وجهی که «أُوتِيتُمْ» (به شما داده شد) آن را می‌طلبد، و وجهی که «قَلِيلًا» (اندک) آن را از جهت استقلال می‌طلبد؛ یعنی ما به شما از علم ندادیم مگر آنچه را که خودتان به طور کامل درک می‌کنید و آنچه را که طاقت ندارید، به شما نداده‌ایم. زیرا شما به آن استقلال ندارید. در این عطا، علوم نظری نیز وارد می‌شوند، زیرا آن‌ها علومی هستند که عقول به درک آن‌ها استقلال دارند.\n\n[علم حادث و تعلق آن به معلومات نامتناهی]\n\nاصحاب ما در این باره اختلاف کرده‌اند که آیا علم حادث به معلومات نامتناهی تعلق می‌گیرد یا خیر. کسی که معرفت ذات خدا را منع کرده، این امر را نیز منع کرده است، و کسی که آن را منع نکرده، حصول آن را نیز منع نکرده است. اما به ما نقل نشده است که برای کسی در دنیا حاصل شده باشد، و نمی‌دانم در آخرت چه خواهد بود. ما می‌دانیم که محمد صلی الله علیه وسلم علم اولین و آخرین را دانسته است، و خود آن حضرت صلی الله علیه وسلم فرموده است که فردا روز قیامت، هنگامی که از خداوند عز و جل درخواست گشایش باب شفاعت می‌کند، خدا را با ستایش‌هایی حمد می‌گوید که خداوند در آن زمان به او می‌آموزد و اکنون آن‌ها را نمی‌داند. اگر دیگری آن‌ها را می‌دانست، قول او که فرمود: «علم اولین و آخرین را دانستم» صادق نبود. و او صلی الله علیه وسلم در گفتار خود صادق است. پس از این نتیجه می‌شود که علم هیچ کس به معلومات نامتناهی تعلق نگرفته است. و به همین دلیل مردم تنها درباره امکان آن سخن گفته‌اند که آیا ممکن است یا خیر. و هر ممکنی واقع نمی‌شود. و وقوع ممکنات از مسائل پیچیده است. چگونه ممکن است چیزی ممکن باشد و واقع نشود؟ این چیزی است که نزد ما در هر زمان معقول است؛ زیرا ترجیح یکی از دو ممکن یا ممکنات، مانع از وقوع چیزی می‌شود که در حال حاضر مرجح نیست. اگر آن ممکنی که در هستی (الوجود) واقع نشده است، عدم وقوعش در هستی مرجح باشد، پس عدم آن مرجح شده است، و در این صورت ممکن واقع شده است. زیرا از حیث امکان، لازم نیست مگر متصف بودن به مرجح بودن، خواه عدم آن ترجیح یابد یا وجود آن. و اگر چنین باشد، پس هر ممکنی بدون شک واقع شده است، حتی اگر ممکنات نامتناهی باشند، زیرا ترجیح بر آن‌ها نیز جاری می‌شود. و این مسئله‌ای دقیق است؛ زیرا ممکنات اگرچه نامتناهی و معدوم هستند، اما نزد ما برای حق (الحق) عز و جل مشهودند، از آن جهت که او می‌بیند. ما رؤیت را به وجود تعلیل نمی‌کنیم، بلکه رؤیت اشیاء را به این تعلیل می‌کنیم که مرئی مستعد پذیرش تعلق رؤیت به آن باشد، خواه معدوم باشد یا موجود. و هر ممکنی مستعد رؤیت است. پس ممکنات اگرچه نامتناهی‌اند، برای خداوند عز و جل مرئی هستند، نه از جهت نسبت علم، بلکه از نسبت دیگری که رؤیت نامیده می‌شود، هر چه که باشد. خداوند متعال فرمود: «أَلَمْ يَعْلَم بِأَنَّ اللَّهَ يَرَىٰ» (آیا ندانسته است که خدا می‌بیند؟). و در اینجا نگفت: «آیا ندانسته است که خدا می‌داند؟» و فرمود: «تَجْرِي بِأَعْيُنِنَا» (زیر نظر ما روان است)، یعنی به گونه‌ای که ما آن‌ها را می‌بینیم. و همچنین به موسی و هارون فرمود: «إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَىٰ» (من با شما هستم، می‌شنوم و می‌بینم). و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند.\nپایان جزء بیست و چهارم.\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 3
}