{
  "id": 520,
  "title": {
    "ar": "الباب الموفي عشرين وخمسمائة في معرفة حال قطب كان منزله إِنَّما يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ",
    "en": "Chapter 520: Concerning the Knowledge of the State of a Pole (قطب) Whose Station (منزل) Was <<إِنَّما يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ>> (Only those who listen will respond).",
    "ur": "پانچ سو بیسواں باب، ایک قطب (قطب) کے حال کی معرفت میں جس کا روحانی مقام یہ تھا: إِنَّما يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ (صرف وہی لوگ جواب دیتے ہیں جو سنتے ہیں)۔",
    "fa": "باب پانصد و بیستم در معرفت حال قطبی که منزل او [آیه] «تنها کسانی [دعوت را] می‌پذیرند که می‌شنوند» بود."
  },
  "content": {
    "ar": "## «الباب الموفي عشرين وخمسمائة في معرفة حال قطب كان منزله إِنَّما يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ»\n\n\n> إني أغار على قلبي فاسأله *** أن لا يزاحمه خلق من البشر\n\n\n> فيه فإن لنا قلبا يهيم به *** في كل حال من التنزيه والصور\n\n\n> لما سمعت نداء الحق من قبلي *** أجبته حذرا من حاكم الغير\n\n\n> فقلت ما ذا فقال الحق قلت له *** ما ذا تريد فقال احذر من الحذر\n\n\n> فعشت في طيب نفس حيث كنت فما *** أخاف من وقع آفات ولا ضرر\n\n\n### [من مات بغير توبة]\n\n\nاعلم أيدنا الله وإياك بِرُوحٍ مِنْهُ أن هذا الذكر لما وفقنا الله تعالى لاستعماله بإشبيلية من بلاد الأندلس سنة ست وثمانين وخمسمائة بقينا فيه ثلاثة أيام فرأينا له بركة في تلك الأيام وكنا به ثلاثة أنا وعبد الله النزهوني قاضي شرف وكان عبدا صالحا ضابطا فقيها وشخصا ثالثا من أهل البلد فجعل علة الإجابة السماع لا من قال إنه سمع وهو لم يسمع كما قال تعالى ينهانا أن نكون مثل هؤلاء فقال ولا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ فالسمع في هذا الذكر هو عين العقل لما أدركته الأذن يسمعها من الذي جاء به المترجم عن الله تعالى وهو الرسول صَلَّى اللهُ عَليهِ وسَلَّم الذي لا ينطق عن الهوى فإذا علم ما سمع كان بحسب ما علم فإن العلم حاكم قاهر في حكمه لا بد من ذلك وإن لم يكن كذلك فليس بعلم فما عصى الله قط عالم يعلم بالمؤاخذة على إتيانه المعصية ولا بد من العلم بكونها معصية في الحكم الإلهي وذلك حظ المؤمن وليس إلا رجلان قائل بإنفاذ الوعيد فيمن مات على غير توبة وقائل بغير إنفاذ الوعيد فيمن مات على غير توبة بل هو في مشيئة الله إن شاء غفر وإن شاء آخذ وما ثم مؤمن ثالث لهذين وكلاهما ليس بعالم بالمؤاخذة في حق شخص حي ما لم يمت فإن القائل بإنفاذ الوعيد يقول بإنفاذه فيمن مات ولم يتب وهو يرجو التوبة ما لم يمت فليس بعالم بالمؤاخذة على هذه المعصية فإنه لا يعلم أنه يموت على توبة أو على غير توبة والذي لا يقول بإنفاذ الوعيد لا يعلم ما في مشيئة الحق فما عصى إلا من ليس بعالم بالمؤاخذة وأما من كشف له عن المقدور قبل وقوعه فقد علم ما له وعليه ومن له هذا الحال وهذا المقام فقد غفر الله له ما تقدم من ذنبه وما تأخر وقد كان ممن سمع قول الله له إيمانا أو عيانا\n\n\nاعمل ما شئت فقد غفرت لك‏\n\n\nوهذا ثابت شرعا وهنا سر لمن بحث عليه وهو أنه من هذه حالته فما عصى الله لأنه ما عمل إلا ما أبيح له من العمل والثاني المغفور له فقد سبقت المغفرة ذنبه فما أبصر ذنبه إلا ممحوا بخير عظيم يقابل ذلك الذنب فعلى كل حال وإن جرى عليه لسان ذنب ومعصية فما جرى عليه حكم ذلك وليس المعتبر إلا جريان الحكم على فاعل تلك المعصية فما عصى الله عالم بالمؤاخذة وقد دعانا الله لما خلقنا له من عبادته فسمعنا ولما سمعنا استجبنا فأخبر الله عنه بسرعة الإجابة لما ذكرها ببنية الاستفعال وفي هذا الذكر شمول رحمة الله بخلقه فأخبر أنه ما استجاب إلا من سمع فوجد العذر من لم يسمع كما وجد العذر من لم تبلغه الدعوة الإلهية فحكمه حكم من لم يبعث الله إليه رسولا وهو تعالى يقول وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا وما هو رسول لمن أرسل إليه حتى يؤدي رسالته فإذا سمع المرسل إليه أجاب ولا بد كما أخبر الله تعالى عنه لما جاء به هذا الرسول في رسالته فإذا رأينا من لم يجب علمنا بأخبار الله أنه ما سمع فأقام الله له حجة يحتج بها يَوْمَ يَجْمَعُ الله الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ فتقول الرسل عليه السلام لا عِلْمَ لَنا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ فعلمنا من قولهم إن العلم بالإجابة من علوم الغيب فعلمنا إن السماع غيب فلا يعلم من أجاب إلا من هويته غيب وليس إلا الله وما أقام الله العذر عن عباده إلا وفي نفسه أن يرحمهم فرحم بعض الناس بما أسمعهم ف اسْتَجابُوا لِرَبِّهِمْ وأَقامُوا الصَّلاةَ التي حكم الله فيها بالقسمة بينه وبين عبده ومن لم يستجب اعتذر الله عنه بأنه لم يسمع وهذا من حكم الغيرة الإلهية على الألوهة أن يقاومها أحد من عبادها بخلاف ما دعت إليه إذ لو علم أنهم سمعوا وما استجابوا لعظمهم في أعين الناس وجعلهم في مقام المقاومة له يعني لما علم السابق علمه فيهم أنه لَوْ أَسْمَعَهُمْ لَتَوَلَّوْا وهُمْ مُعْرِضُونَ فستر علمه فيهم بأن قال ولا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ وقال ولو شاء الله لأسمعهم فأكذبهم في قولهم سمعنا فقال إِنَّما يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ فلو سمعوا استجابوا فإن الله أعز وأجل من أن يقاومه مخلوق أ لا تراه يقول في حق من سمع من النصارى وإِذا سَمِعُوا ما أُنْزِلَ إِلَى الرَّسُولِ‏\nفوصفهم بأنهم يسمعون ثم ذكر ما كان منهم حين سمعوا فقال تَرى‏ أَعْيُنَهُمْ تَفِيضُ من الدَّمْعِ مِمَّا عَرَفُوا من الْحَقِّ فأخبر أنهم آمنوا وأخبر أنه تعالى أثابهم على إيمانهم بما ذكر في الآيات فلا تقل فيمن لم يجب أنه سمع فتخالف الله فيما أخبر عنهم وقد أخبر الله تعالى عنهم إن بهم صمما وأخبر عنهم أنهم قالوا في آذانِنا وَقْرٌ فطابق قولهم في آذانِنا وَقْرٌ قول الله إنهم صم فلم يسمعوا فلم يرجعوا فإنهم لم يعقلوا ما سمعته آذانهم وما سمع من سمع منهم إلا دعاء ونداء وهو قوله يا فلان وما سمع أكثر من ذلك فما أعظم رحمة الله بعباده وهم لا يشعرون بل رأيت جماعة ممن ينازعون في اتساع رحمة الله وإنها مقصورة على طائفة خاصة فحجروا وضيقوا ما وسع الله فلو إن الله لا يرحم أحدا من خلقه لحرم رحمته من يقول بهذا ولكن أبي الله إلا شمول الرحمة فمنا من يأخذها بطريق الوجوب وهم الذين يَتَّقُونَ ويُؤْتُونَ الزَّكاةَ الذين يؤمنون ويَتَّبِعُونَ الرَّسُولَ النَّبِيَّ الْأُمِّيَّ ومنا من يأخذها بطريق الامتنان من عين المنة والفضل الإلهي وو الله ما أنا بحمد الله ممن يحب التشفي والانتقام من عباد الله بل خلقني الله رحمة وجعلني وارث رحمة لمن قيل له وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ وما خص مؤمنا من غيره وتحقق ذلك في وضع الجزية على أهل الكتاب وما كان السبب في إنزال هذه الآية إلا دعاءه بالمؤاخذة الإلهية على المشركين من رعل وذكوان وعصية وإذا كان هذا عتبة لرسوله صَلَّى اللهُ عَليهِ وسَلَّم في حق المشرك الذي أخبر أنه لا يغفر له فكيف الأمر في غير المشرك وإن لم يؤمن فافتح عين فهمك لما تقرأه وقُلْ رَبِّ زِدْنِي عِلْماً وهو أن يزيدك في فهمك فكلما كررت تلاوة زدت علما لم يكن عندك وكلما نظرت واعتبرت تزيد علما والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Five Hundred and Twenty: Concerning the Knowledge of the State of a Pole (قطب) Whose Station Was: <<Only those who listen respond>>\n\nI am jealous over my heart, so ask it\nThat no creature of humankind should crowd it.\nFor in it, we have a heart that is passionately devoted to Him\nIn every state, whether of transcendence (تنزيه) or of forms (صور).\nWhen I heard the call of the Real (الحق) from my direction,\nI answered it, fearing the judgment of the Other.\nSo I said, \"What is it?\" And the Real said, \"I said to you,\n'What do you desire?'\" He replied, \"Beware of caution (حذر).\"\nSo I lived in contentment wherever I was, and thus\nI fear neither the occurrence of calamities nor harm.\n\n### [Concerning those who die without repentance]\n\nKnow, may Allah support us and you with a Spirit from Him (بِرُوحٍ مِنْهُ), that when Allah the Exalted granted us success in using this remembrance (ذكر) in Seville (إشبيلية) in the lands of Al-Andalus in the year 586 AH, we remained engaged in it for three days. We saw a blessing (بركة) from it during those days. There were three of us: myself, Abdullah al-Nuzhuni (the Qadi of Sharaf, who was a righteous, precise, and learned servant), and a third person from the people of the city.\n\nHe (Allah) made the cause of the response (الإجابة) to be hearing (السماع), not the one who merely claimed he heard while he did not truly hear. As the Exalted said, forbidding us from being like them: <<And do not be like those who say, 'We hear,' while they do not hear>> (ولا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ). Hearing (السمع) in this remembrance (ذكر) is the very essence of the intellect (عين العقل) when the ear perceives it, hearing it from the one who brought it, the translator (المترجم) on behalf of Allah the Exalted, who is the Messenger (صَلَّى اللهُ عَليهِ وسَلَّم) who does not speak out of caprice.\n\nIf he knows what he heard, it will be according to what he knows, for knowledge (العلم) is a ruling, overwhelming judge (حاكم قاهر) in its judgment; this is necessary. If it is not so, then it is not knowledge. No scholar (عالم) who knows the accountability (المؤاخذة) for committing a sin (المعصية) ever disobeys Allah. It is necessary to have knowledge of its being a sin according to the Divine ruling (الحكم الإلهي). This is the portion (حظ) of the believer.\n\nThere are only two types of men: one who affirms the execution of the threat (إنفاذ الوعيد) against whoever dies without repentance (توبة), and one who denies the execution of the threat against whoever dies without repentance, holding instead that the matter is subject to Allah's Will (مشيئة الله): if He wills, He forgives, and if He wills, He holds accountable (آخذ). There is no third believer besides these two. Neither of them is truly knowledgeable about the accountability (المؤاخذة) regarding a living person until he dies. For the one who affirms the execution of the threat says it applies to the one who died and did not repent, yet he hopes for repentance as long as he is alive. Thus, he is not knowledgeable about the accountability for this specific sin, because he does not know whether the person will die upon repentance or without repentance. And the one who denies the execution of the threat does not know what is in the Will of the Real (مشيئة الحق). Therefore, only he who is not knowledgeable of the accountability disobeys.\n\nAs for the one to whom the decreed destiny (المقدور) is unveiled (كشف) before its occurrence, he has known what is for him and what is against him. Whoever possesses this state (حال) and this station (مقام), Allah has forgiven him what preceded of his sin and what followed. He was among those who heard the saying of Allah to him, whether through faith (إيمانا) or direct witnessing (عيانا): <<Do what you will, for I have forgiven you.>> This is legally established (ثابت شرعا). Herein lies a secret (سر) for the one who seeks it: that whoever is in this state has not disobeyed Allah, because he only performed what was permissible (أبيح له) for him to perform. The second forgiven person is one whose forgiveness preceded his sin. He only perceives his sin as being erased by a great good (خير عظيم) that counterbalances that sin. In any case, even if the tongue of sin and disobedience runs against him, the ruling (حكم) of that sin does not run against him. The only thing considered is the running of the ruling upon the perpetrator of that disobedience. No scholar (عالم) who knows the accountability disobeys Allah.\n\nAllah called us to His worship (عبادته), for which He created us, and we heard. When we heard, we responded (استجبنا). Allah informed about the speed of the response (الإجابة) when He mentioned it using the *istif'al* form. In this remembrance (ذكر) is the comprehensiveness of Allah's mercy (رحمة الله) toward His creation (خلقه). He informed that only those who heard responded (ما استجاب إلا من سمع). Thus, the one who did not hear found an excuse (عذر), just as the one whom the Divine call (الدعوة الإلهية) did not reach found an excuse. His ruling is the ruling of one to whom Allah did not send a Messenger (رسول). And He the Exalted says: <<And We would never punish until We had sent a messenger>> (وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا). He is not a Messenger to the one he is sent to until he conveys his message. When the one sent to hears, he must respond, as Allah the Exalted informed concerning what this Messenger brought in his message. If we see someone who did not respond, we know, based on Allah's information, that he did not hear. Allah establishes a proof (حجة) for him, by which he argues on the Day when Allah gathers the Messengers (الرسل) and says: <<What was the response you received?>> (ما ذا أُجِبْتُمْ). The Messengers (عليه السلام) will say: <<We have no knowledge; indeed, You are the Knower of the unseen (عَلَّامُ الْغُيُوبِ)>> (لا عِلْمَ لَنا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ). We learned from their saying that the knowledge of the response is from the knowledge of the Unseen (علوم الغيب). Thus, we know that hearing (السماع) is Unseen (غيب). Therefore, no one knows who responded except the one whose identity (هويته) is Unseen, and that is none but Allah.\n\nAllah did not establish an excuse (عذر) for His servants except that He intended in His Essence (في نفسه) to have mercy upon them. He had mercy upon some people by making them hear, so <<they responded to their Lord and established the prayer>> (ف اسْتَجابُوا لِرَبِّهِمْ وأَقامُوا الصَّلاةَ), in which Allah decreed the division (القسمة) between Himself and His servant. As for the one who did not respond, Allah excused him by saying that he did not hear. This is part of the ruling of Divine Jealousy (الغيرة الإلهية) over the Godhead (الألوهة), that none of His servants should resist Him (يقاومها) by acting contrary to what He called them to. If He had known that they heard and did not respond, He would have magnified them in the eyes of people and placed them in the station of resistance to Him. Meaning, because His prior knowledge (علم السابق) concerning them was that <<Had Allah made them hear, they would have turned away, while they were refusing>> (لَوْ أَسْمَعَهُمْ لَتَوَلَّوْا وهُمْ مُعْرِضُونَ). So He veiled His knowledge concerning them by saying: <<And do not be like those who say, 'We hear,' while they do not hear>> (ولا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ). And He said: <<And if Allah had willed, He could have made them hear.>> He thus refuted their claim, \"We hear,\" by saying: <<Only those who listen respond>> (إِنَّما يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ). If they had heard, they would have responded, for Allah is too Mighty and too Glorious for any creature (مخلوق) to resist Him.\n\nDo you not see that He says concerning those Christians who heard: <<And when they hear what has been revealed to the Messenger...>> (وإِذا سَمِعُوا ما أُنْزِلَ إِلَى الرَّسُولِ‏)? He described them as hearing, then mentioned what happened to them when they heard, saying: <<You see their eyes overflowing with tears because of what they have recognized of the Truth (الحق)>> (تَرى‏ أَعْيُنَهُمْ تَفِيضُ من الدَّمْعِ مِمَّا عَرَفُوا من الْحَقِّ). He informed that they believed, and He informed that He the Exalted rewarded them for their faith, as mentioned in the verses. Therefore, do not say concerning one who did not respond that he heard, lest you contradict Allah in what He informed about them. Allah informed that they suffer from deafness (صمما), and He informed that they said: <<In our ears is a heaviness (وقر)>> (في آذانِنا وَقْرٌ). Their saying, \"In our ears is a heaviness,\" corresponds to Allah's saying that they are deaf, meaning they did not hear, so they did not return. They did not comprehend what their ears heard. And what those who did hear among them heard was only a call and a summons, which is His saying, \"O so-and-so,\" and they heard no more than that. How immense is Allah's mercy toward His servants, yet they do not perceive it! Rather, I have seen a group of people who dispute the vastness of Allah's mercy, claiming it is restricted to a specific group. Thus, they restrict and narrow what Allah has made vast. If Allah did not have mercy on any of His creation, He would deny His mercy to the one who says this. But Allah refused anything except the comprehensiveness of Mercy (شمول الرحمة).\n\nSome of us receive it through the path of obligation (طريق الوجوب)—these are those who <<fear Allah (يَتَّقُونَ) and give the purification tax (يُؤْتُونَ الزَّكاةَ)>>, those who believe and <<follow the Messenger, the unlettered Prophet (النَّبِيَّ الْأُمِّيَّ)>>. And some of us receive it through the path of favor (الامتنان), from the very essence of Divine Grace and Bounty (الفضل الإلهي). By Allah, I am not, praise be to Allah, among those who love to seek vengeance (التشفي) and retribution against Allah's servants. Rather, Allah created me as a mercy and made me an heir of the mercy of the one to whom it was said: <<And We have not sent you except as a mercy to the worlds (لِلْعالَمِينَ)>> (وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ). He did not distinguish a believer from a non-believer. This was confirmed in the imposition of the *jizya* (poll tax) upon the People of the Book. The reason for the revelation of this verse was nothing other than the Prophet's prayer for Divine accountability (المؤاخذة الإلهية) upon the polytheists of Ri'l, Dhakwan, and Usayya. If this was a rebuke (عتبة) to His Messenger (صَلَّى اللهُ عَليهِ وسَلَّم) concerning the polytheist (المشرك)—whom He informed that He does not forgive—then what is the matter concerning the non-polytheist, even if he does not believe? Open the eye of your understanding (فهمك) to what you read and say: <<My Lord, increase me in knowledge (عِلْماً)>> (قُلْ رَبِّ زِدْنِي عِلْماً). This means that He should increase you in your understanding. Every time you repeat the recitation, you increase in knowledge that you did not possess before. Every time you reflect and consider, you increase in knowledge. And Allah <<speaks the Truth and guides to the Way>> (يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏).",
    "ur": "## باب نمبر پانچ سو بیس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"بیشک وہی لوگ قبول کرتے ہیں جو سنتے ہیں\" (إِنَّما يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ)\n\nمیں اپنے دل پر غیرت کھاتا ہوں، پس اس سے سوال کر *** کہ کوئی مخلوق اس میں آ کر ہجوم نہ کرے\nکیونکہ ہمارے لیے ایک دل ہے جو اس (ذات حق) میں سرگرداں رہتا ہے *** تنزیہ (پاکیزگی) اور صورتوں (تجلیات) کی ہر حالت میں\nجب میں نے اپنے رب کی طرف سے نداء حق (ذات حق کی پکار) سنی *** تو میں نے غیر کے حاکم ہونے کے خوف سے اسے قبول کیا\nمیں نے کہا: \"کیا؟\" تو الحق (ذات حق) نے فرمایا۔ میں نے اس سے کہا: *** \"آپ کیا چاہتے ہیں؟\" تو اس نے فرمایا: \"حذر (احتیاط) سے بھی احتیاط کر\"\nپس میں جہاں بھی رہا، اطمینانِ نفس میں زندگی بسر کی، لہٰذا *** میں کسی آفت یا نقصان کے واقع ہونے سے نہیں ڈرتا۔\n\n### [وہ جو توبہ کے بغیر مر گیا]\n\nجان لو، اللہ تعالیٰ اپنی روح (بِرُوحٍ مِنْهُ) کے ذریعے ہماری اور تمہاری تائید فرمائے، کہ جب اللہ تعالیٰ نے ہمیں اندلس کے شہر اشبیلیہ میں سنہ ۵۸۶ ہجری میں اس ذکر کے استعمال کی توفیق بخشی، تو ہم اس میں تین دن تک مشغول رہے اور ان دنوں میں ہم نے اس کی برکت دیکھی۔ ہم اس میں تین لوگ تھے: میں، عبداللہ النزہونی (جو قاضی شرف تھے اور ایک نیک، ضابطہ پسند اور فقیہ بندے تھے)، اور ایک تیسرا شخص جو اسی شہر کا رہنے والا تھا۔\n\nپس (اللہ نے) قبولیت (اجابت) کی علت سننا (السماع) قرار دیا، نہ کہ اس شخص کو جو کہے کہ اس نے سنا حالانکہ اس نے نہیں سنا، جیسا کہ اللہ تعالیٰ نے ہمیں ان لوگوں جیسا ہونے سے منع کرتے ہوئے فرمایا: \"اور تم ان لوگوں کی طرح نہ ہو جاؤ جنہوں نے کہا کہ ہم نے سنا، حالانکہ وہ نہیں سنتے تھے\" (ولا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ). پس اس ذکر میں سننا (السمع) عین عقل ہے، جب کان اسے اس ذات سے سنتے ہیں جو اللہ تعالیٰ کی طرف سے ترجمانی کرنے والا ہے، اور وہ رسول صلی اللہ علیہ وسلم ہیں جو اپنی خواہش سے کلام نہیں کرتے۔ جب وہ شخص جو کچھ سنتا ہے اسے جان لیتا ہے، تو وہ اس علم کے مطابق ہوتا ہے جو اسے حاصل ہوا، کیونکہ علم اپنے حکم میں غالب اور قاہر حاکم ہے، یہ ضروری ہے۔ اگر ایسا نہ ہو تو وہ علم نہیں ہے۔\n\nپس اللہ کی نافرمانی کبھی بھی ایسے عالم نے نہیں کی جو گناہ کے ارتکاب پر مؤاخذہ (پکڑ) کو جانتا ہو۔ اور الٰہی حکم میں اس (فعل) کا گناہ ہونا ضروری ہے۔ اور یہ مؤمن کا حصہ ہے۔ اور یہاں صرف دو ہی طرح کے لوگ ہیں: ایک وہ جو کہتا ہے کہ جو شخص توبہ کے بغیر مر گیا، اس پر وعید (عذاب کا وعدہ) نافذ ہو گا، اور دوسرا وہ جو کہتا ہے کہ جو شخص توبہ کے بغیر مر گیا، اس پر وعید نافذ نہیں ہو گی، بلکہ وہ اللہ کی مشیت میں ہے، اگر چاہے تو معاف کر دے اور اگر چاہے تو مؤاخذہ کرے۔ اور ان دونوں کے علاوہ کوئی تیسرا مؤمن نہیں ہے۔\n\nاور یہ دونوں ہی زندہ شخص کے حق میں مؤاخذہ کے عالم نہیں ہیں جب تک کہ وہ مر نہ جائے۔ کیونکہ وعید کے نفاذ کا قائل کہتا ہے کہ یہ اس شخص پر نافذ ہو گی جو مر گیا اور توبہ نہیں کی، جبکہ وہ شخص جب تک زندہ ہے توبہ کی امید رکھتا ہے۔ پس وہ اس گناہ پر مؤاخذہ کا عالم نہیں ہے، کیونکہ وہ نہیں جانتا کہ وہ توبہ پر مرے گا یا بغیر توبہ کے۔ اور جو وعید کے نفاذ کا قائل نہیں ہے، وہ ذات حق (الحق) کی مشیت میں موجود چیز کو نہیں جانتا۔\n\nپس نافرمانی صرف اسی نے کی جو مؤاخذہ کا عالم نہیں ہے۔ اور جس شخص کے لیے مقدر (المقدور) کا وقوع سے پہلے کشف (الکشف) کر دیا گیا، اس نے جان لیا کہ اس کے لیے کیا ہے اور اس کے خلاف کیا ہے۔ اور جس شخص کو یہ حال اور یہ مقام حاصل ہو گیا، تو اللہ نے اس کے اگلے پچھلے گناہ معاف کر دیے۔ اور وہ ان لوگوں میں سے تھا جس نے اللہ کا یہ قول سنا، خواہ ایمان کے ذریعے یا عیان (مشاہدہ) کے ذریعے:\n\n\"جو چاہے کر، میں نے تجھے بخش دیا ہے۔\" (اعمل ما شئت فقد غفرت لك‏)\n\nاور یہ شرعی طور پر ثابت ہے۔ اور یہاں ایک راز ہے اس شخص کے لیے جو اس کی تحقیق کرے، اور وہ یہ ہے کہ جس کی یہ حالت ہو، اس نے اللہ کی نافرمانی نہیں کی، کیونکہ اس نے صرف وہی عمل کیا جو اس کے لیے مباح کر دیا گیا تھا۔ اور دوسرا وہ شخص جس کی مغفرت ہو چکی ہے، تو مغفرت اس کے گناہ سے پہلے ہو چکی ہے۔ پس وہ اپنے گناہ کو نہیں دیکھتا مگر اس عظیم خیر کے ذریعے مٹا ہوا جو اس گناہ کے مقابل ہے۔ پس بہر حال، اگرچہ اس پر گناہ اور معصیت کا لفظ جاری ہو، لیکن اس پر اس کا حکم جاری نہیں ہوا۔ اور معتبر صرف اس معصیت کے فاعل پر حکم کا جاری ہونا ہے۔\n\nپس مؤاخذہ کا عالم اللہ کی نافرمانی نہیں کرتا۔ اور اللہ نے ہمیں اس عبادت کے لیے بلایا جس کے لیے اس نے ہمیں پیدا کیا، تو ہم نے سنا، اور جب ہم نے سنا تو ہم نے قبول کیا۔ پس اللہ نے قبولیت کی تیزی کے بارے میں خبر دی جب اس نے اسے استفعال (طلب) کے صیغے میں ذکر کیا۔ اور اس ذکر میں اللہ کی مخلوق پر رحمت کا شمول ہے۔ پس اس نے خبر دی کہ صرف اسی نے قبول کیا جس نے سنا۔ پس جس نے نہیں سنا، اس کے لیے عذر پایا گیا، جیسا کہ اس شخص کے لیے عذر پایا گیا جسے دعوتِ الٰہیہ نہیں پہنچی۔ پس اس کا حکم اس شخص کا حکم ہے جس کی طرف اللہ نے کوئی رسول نہیں بھیجا۔ اور وہ (اللہ) تعالیٰ فرماتا ہے: \"اور ہم عذاب دینے والے نہیں ہیں جب تک کہ ہم کوئی رسول نہ بھیج دیں\" (وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا).\n\nاور وہ اس شخص کے لیے رسول نہیں ہے جس کی طرف اسے بھیجا گیا جب تک کہ وہ اپنا پیغام نہ پہنچا دے۔ پس جب مرسل الیہ (جس کی طرف بھیجا گیا) سنتا ہے، تو وہ ضرور قبول کرتا ہے، جیسا کہ اللہ تعالیٰ نے اس کے بارے میں خبر دی جو یہ رسول اپنے پیغام میں لایا۔ پس جب ہم کسی ایسے شخص کو دیکھتے ہیں جس نے قبول نہیں کیا، تو ہم اللہ کی خبروں سے جانتے ہیں کہ اس نے نہیں سنا۔ پس اللہ نے اس کے لیے ایک حجت قائم کر دی جس سے وہ قیامت کے دن دلیل پکڑے گا، \"جس دن اللہ رسولوں کو جمع کرے گا، پھر فرمائے گا: تمہیں کیا جواب دیا گیا؟\" (يَوْمَ يَجْمَعُ الله الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ) تو رسول علیہم السلام کہیں گے: \"ہمیں کوئی علم نہیں، بیشک تو ہی غیبوں کا جاننے والا ہے\" (لا عِلْمَ لَنا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ).\n\nپس ہم نے ان کے قول سے جانا کہ قبولیت (اجابت) کا علم علومِ غیب میں سے ہے۔ پس ہم نے جانا کہ سننا (السماع) غیب ہے۔ لہٰذا جس نے قبول کیا اسے صرف وہی جانتا ہے جس کی ہویت (حقیقت) غیب ہے، اور وہ صرف اللہ ہے۔ اور اللہ نے اپنے بندوں کی طرف سے عذر صرف اس لیے قائم کیا کہ اس کے نفس میں ان پر رحم کرنا تھا۔ پس اس نے بعض لوگوں پر رحم کیا اس چیز کے ذریعے جو اس نے انہیں سنائی، تو انہوں نے \"اپنے رب کی پکار کو قبول کیا اور نماز قائم کی\" (اسْتَجابُوا لِرَبِّهِمْ وأَقامُوا الصَّلاةَ) جس میں اللہ نے اپنے اور اپنے بندے کے درمیان تقسیم کا حکم دیا ہے۔ اور جس نے قبول نہیں کیا، اللہ نے اس کی طرف سے یہ عذر پیش کیا کہ اس نے نہیں سنا۔ اور یہ الوہیت (الوہۃ) پر غیرتِ الٰہیہ (الغيرة الإلهية) کے حکم میں سے ہے کہ اس کا کوئی بندہ اس چیز کے خلاف مزاحمت کرے جس کی طرف اس نے بلایا ہے۔\n\nکیونکہ اگر یہ معلوم ہو جاتا کہ انہوں نے سنا اور قبول نہیں کیا، تو وہ لوگوں کی نظروں میں بڑے ہو جاتے اور اللہ کے مقابلے میں مزاحمت کے مقام پر آ جاتے (یعنی جب اللہ نے ان کے بارے میں اپنے سابق علم میں جان لیا کہ) \"اگر وہ انہیں سناتا تو بھی وہ منہ پھیر کر پلٹ جاتے\" (لَوْ أَسْمَعَهُمْ لَتَوَلَّوْا وهُمْ مُعْرِضُونَ). پس اللہ نے ان کے بارے میں اپنے علم کو چھپا دیا یہ فرما کر: \"اور تم ان لوگوں کی طرح نہ ہو جاؤ جنہوں نے کہا کہ ہم نے سنا، حالانکہ وہ نہیں سنتے تھے\" (ولا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ). اور فرمایا: \"اور اگر اللہ چاہتا تو انہیں سنا دیتا۔\" پس اس نے ان کے اس قول کو جھٹلا دیا کہ \"ہم نے سنا\"، اور فرمایا: \"بیشک وہی لوگ قبول کرتے ہیں جو سنتے ہیں\" (إِنَّما يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ).\n\nپس اگر وہ سنتے تو ضرور قبول کرتے، کیونکہ اللہ اس سے کہیں زیادہ عزت والا اور جلال والا ہے کہ کوئی مخلوق اس کی مزاحمت کرے۔ کیا تم نہیں دیکھتے کہ وہ ان نصاریٰ کے حق میں جنہوں نے سنا، فرماتا ہے: \"اور جب وہ سنتے ہیں جو رسول پر نازل کیا گیا\" (وإِذا سَمِعُوا ما أُنْزِلَ إِلَى الرَّسُولِ). پس اس نے ان کی صفت بیان کی کہ وہ سنتے ہیں، پھر اس نے ذکر کیا کہ جب انہوں نے سنا تو ان کا کیا حال ہوا، پس فرمایا: \"تم ان کی آنکھوں کو دیکھو گے کہ حق (الحق) کو پہچاننے کے سبب آنسوؤں سے بہہ رہی ہیں\" (تَرى‏ أَعْيُنَهُمْ تَفِيضُ من الدَّمْعِ مِمَّا عَرَفُوا من الْحَقِّ). پس اس نے خبر دی کہ وہ ایمان لے آئے، اور خبر دی کہ اللہ تعالیٰ نے ان کے ایمان پر انہیں ثواب دیا جو آیات میں مذکور ہے۔\n\nپس تم اس شخص کے بارے میں یہ مت کہو جس نے قبول نہیں کیا کہ اس نے سنا، ورنہ تم اللہ کی اس خبر کی مخالفت کرو گے جو اس نے ان کے بارے میں دی ہے۔ اور اللہ تعالیٰ نے ان کے بارے میں خبر دی ہے کہ وہ بہرے ہیں، اور ان کے بارے میں خبر دی کہ انہوں نے کہا: \"ہمارے کانوں میں بوجھ ہے\" (في آذانِنا وَقْرٌ). پس ان کا یہ قول کہ \"ہمارے کانوں میں بوجھ ہے\" (في آذانِنا وَقْرٌ)، اللہ کے اس قول کے مطابق ہے کہ وہ بہرے ہیں، لہٰذا انہوں نے نہیں سنا، پس وہ رجوع نہیں ہوئے۔ کیونکہ انہوں نے وہ نہیں سمجھا جو ان کے کانوں نے سنا۔ اور جس نے ان میں سے سنا بھی، تو اس نے صرف پکار اور نداء سنی، اور وہ اللہ کا یہ قول ہے: \"اے فلاں!\" اور اس سے زیادہ کچھ نہیں سنا۔\n\nپس اللہ کی اپنے بندوں پر رحمت کتنی عظیم ہے، حالانکہ وہ شعور نہیں رکھتے۔ بلکہ میں نے ایک جماعت کو دیکھا جو اللہ کی رحمت کی وسعت میں جھگڑتے ہیں اور کہتے ہیں کہ یہ ایک خاص گروہ تک محدود ہے۔ پس انہوں نے اس چیز کو محدود اور تنگ کر دیا جسے اللہ نے وسیع کیا ہے۔ اگر اللہ اپنی مخلوق میں سے کسی پر رحم نہ کرتا تو جو شخص یہ کہتا ہے وہ خود اس رحمت سے محروم ہو جاتا، لیکن اللہ نے رحمت کے شمول (جامعیت) کے سوا کسی چیز کو قبول نہیں کیا۔ پس ہم میں سے کچھ وہ ہیں جو اسے وجوب (لازمی حق) کے طریقے سے حاصل کرتے ہیں، اور وہ وہ لوگ ہیں جو \"تقویٰ اختیار کرتے ہیں اور زکوٰۃ دیتے ہیں\" (يَتَّقُونَ ويُؤْتُونَ الزَّكاةَ)، جو ایمان لاتے ہیں اور \"رسول، نبی اُمی کی پیروی کرتے ہیں\" (وَيَتَّبِعُونَ الرَّسُولَ النَّبِيَّ الْأُمِّيَّ). اور ہم میں سے کچھ وہ ہیں جو اسے احسان (امتنان) کے طریقے سے، عین فضلِ الٰہی اور بخشش کے ذریعے حاصل کرتے ہیں۔\n\nاور اللہ کی قسم، میں بحمد اللہ ان لوگوں میں سے نہیں ہوں جو اللہ کے بندوں سے بدلہ لینے یا انتقام لینے کو پسند کرتے ہیں۔ بلکہ اللہ نے مجھے رحمت کے طور پر پیدا کیا اور مجھے اس ذات کی رحمت کا وارث بنایا جس کے بارے میں کہا گیا: \"اور ہم نے آپ کو تمام جہانوں کے لیے رحمت بنا کر ہی بھیجا ہے\" (وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ). اور اس (رحمت) نے مؤمن کو غیر مؤمن سے خاص نہیں کیا۔ اور اس کی تصدیق اہل کتاب پر جزیہ عائد کرنے میں ہوتی ہے۔ اور اس آیت کے نازل ہونے کا سبب صرف یہ تھا کہ آپ صلی اللہ علیہ وسلم نے رعل، ذکوان اور عصیہ کے مشرکین پر الٰہی مؤاخذہ کی دعا کی تھی۔ اور جب یہ (آیت) آپ صلی اللہ علیہ وسلم کے لیے مشرک کے حق میں عتاب تھی، جس کے بارے میں خبر دی گئی کہ اسے معاف نہیں کیا جائے گا، تو غیر مشرک کا کیا معاملہ ہو گا، اگرچہ وہ ایمان نہ لایا ہو؟\n\nپس جو کچھ تم پڑھتے ہو اس کے لیے اپنی فہم کی آنکھ کھولو اور کہو: \"اے میرے رب! مجھے علم میں بڑھا دے\" (قُلْ رَبِّ زِدْنِي عِلْماً). اور وہ یہ ہے کہ وہ تمہاری فہم میں اضافہ کرے۔ پس جب بھی تم تلاوت کو دہراؤ گے، تمہارے علم میں اضافہ ہو گا جو پہلے تمہارے پاس نہیں تھا۔ اور جب بھی تم غور و فکر کرو گے اور عبرت حاصل کرو گے، تمہارے علم میں اضافہ ہو گا۔ اور اللہ \"حق (الحق) فرماتا ہے اور وہی سیدھے راستے کی رہنمائی کرتا ہے\" (يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ).",
    "fa": "باب پانصد و بیستم در معرفت حال قطبی که منزل او این آیه بود: «تنها کسانی [دعوت را] می‌پذیرند که می‌شنوند» (إِنَّما يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ).\n\nمن بر قلبم غیرت می‌ورزم، پس از او بخواه *** که هیچ مخلوقی از بشر با آن مزاحمت نکند\n\nزیرا ما قلبی داریم که در آن، در هر حالتی *** از تنزیه و صور (تجلیات)، به او (حق) شیفته و سرگشته است\n\nچون ندای حق (الحق) را از پیش خود شنیدم *** از ترس حاکم غیر (دیگری) او را اجابت کردم\n\nگفتم: «چه؟» پس حق (الحق) گفت. به او گفتم: «چه می‌خواهی؟» *** گفت: «از حذر (احتیاط) حذر کن.»\n\nپس در هر کجا که بودم، در خوشی نفس زندگی کردم *** و از وقوع آفات و هیچ ضرری نمی‌ترسم.\n\n### [کسی که بدون توبه بمیرد]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که چون خداوند متعال ما را به استفاده از این ذکر در اشبیلیه از سرزمین‌های اندلس در سال پانصد و هشتاد و شش (۵۸۶ق) موفق ساخت، سه روز در آن ماندیم و برکتی برای آن در آن ایام دیدیم. ما سه نفر بودیم: من، عبدالله النزهونی (قاضی شرف که بنده‌ای صالح، ضابط و فقیه بود) و شخص سومی از اهالی آن شهر. پس، علت اجابت را شنیدن قرار داد، نه کسی که می‌گوید شنیده در حالی که نشنیده است؛ چنانکه خدای تعالی ما را از اینکه مانند آنان باشیم نهی می‌کند و می‌فرماید: «و مانند کسانی نباشید که گفتند شنیدیم، در حالی که نمی‌شنوند» (وَلا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ).\n\nپس، سمع (شنیدن) در این ذکر، عین عقل است، زیرا آنچه گوش درک می‌کند، آن را از کسی می‌شنود که مترجم از جانب خدای تعالی است، و او رسول (صَلَّى اللهُ عَليهِ وسَلَّم) است که از روی هوی سخن نمی‌گوید. پس اگر آنچه را شنید، بداند، بر اساس دانشی است که یافته است؛ زیرا علم (معرفت) در حکم خود حاکمی قاهر است و این امر ضروری است. اگر چنین نباشد، علم نیست. هرگز عالمی که به مؤاخذه بر ارتکاب معصیت آگاه باشد، خدا را نافرمانی نکرده است. و ناگزیر باید به معصیت بودن آن در حکم الهی علم داشت، و این بهره مؤمن است.\n\nو جز دو مرد نیستند: یکی قائل به اجرای وعید (تهدید الهی) در مورد کسی که بدون توبه بمیرد، و دیگری قائل به عدم اجرای وعید در مورد کسی که بدون توبه بمیرد، بلکه او در مشیت (اراده) خداوند است؛ اگر بخواهد می‌آمرزد و اگر بخواهد مؤاخذه می‌کند. و مؤمن سومی برای این دو وجود ندارد. و هیچ‌یک از این دو، عالم به مؤاخذه در حق شخص زنده نیستند تا زمانی که نمیرد. زیرا قائل به اجرای وعید می‌گوید که وعید در مورد کسی که مرده و توبه نکرده اجرا می‌شود، در حالی که او تا قبل از مرگ امید توبه دارد. پس او عالم به مؤاخذه بر این معصیت نیست، زیرا نمی‌داند که آیا با توبه می‌میرد یا بدون توبه. و کسی که قائل به اجرای وعید نیست، نمی‌داند که در مشیت (اراده) حق (الحق) چیست. پس نافرمانی نکرده است مگر کسی که عالم به مؤاخذه نیست.\n\nاما کسی که کشف (الکشف) از مقدرات قبل از وقوع برایش حاصل شده باشد، آنچه به نفع و ضرر اوست را دانسته است. و کسی که این حال و این مقام را دارد، خداوند گناهان گذشته و آینده او را آمرزیده است. و او از کسانی بوده که قول خداوند را به او، از روی ایمان یا شهود (عیاناً)، شنیده است:\n\n«هر چه می‌خواهی انجام ده، که تو را آمرزیدم.» (اعمل ما شئت فقد غفرت لك‏)\n\nو این از نظر شرعی ثابت است. و در اینجا رازی است برای کسی که در پی آن باشد، و آن این است که کسی که حالش چنین باشد، خدا را نافرمانی نکرده است، زیرا جز آنچه برایش مباح شده، عملی انجام نداده است. و اما شخص دوم که آمرزیده شده، مغفرت بر گناه او سبقت گرفته است، پس گناه خود را نمی‌بیند مگر محو شده با خیر عظیمی که در مقابل آن گناه قرار می‌گیرد. پس در هر حال، اگرچه زبان گناه و معصیت بر او جاری شود، حکم آن بر او جاری نشده است. و معیار، تنها جاری شدن حکم بر فاعل آن معصیت است. پس عالمی که به مؤاخذه آگاه باشد، خدا را نافرمانی نکرده است.\n\nخداوند ما را برای عبادتی که برای آن آفریده، فراخواند، پس شنیدیم، و چون شنیدیم، اجابت کردیم. پس خداوند از سرعت اجابت خبر داد، آنگاه که آن را با صیغه استفعال (یستجیب) ذکر کرد. و در این ذکر، شمول رحمت خداوند بر خلقش وجود دارد. پس خبر داد که اجابت نمی‌کند مگر کسی که شنیده باشد. پس برای کسی که نشنیده، عذری یافت می‌شود، همان‌گونه که برای کسی که دعوت الهی به او نرسیده، عذری یافت می‌شود. پس حکم او، حکم کسی است که خداوند رسولی به سویش نفرستاده است، و خدای تعالی می‌فرماید: «و ما عذاب‌کننده نبودیم تا اینکه رسولی بفرستیم» (وَما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا). و او رسول برای کسی که به سویش فرستاده شده، نیست تا زمانی که رسالت خود را ادا کند. پس اگر فرستاده شده بشنود، ناگزیر اجابت می‌کند، چنانکه خداوند متعال از آنچه این رسول در رسالتش آورده، خبر داده است.\n\nپس اگر کسی را دیدیم که اجابت نکرده است، به واسطه اخبار خداوند می‌دانیم که او نشنیده است. پس خداوند حجتی برای او اقامه کرده که در روزی که خداوند رسولان را جمع می‌کند، به آن احتجاج کند و می‌فرماید: «چه پاسخی به شما داده شد؟» (ما ذا أُجِبْتُمْ). پس رسولان (علیهم السلام) می‌گویند: «ما را دانشی نیست، همانا تو خود دانای غیب‌هایی» (لا عِلْمَ لَنا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ). پس از قول آنان دانستیم که علم به اجابت از علوم غیب است. پس دانستیم که سمع (شنیدن) غیب است، و کسی که اجابت کرده را نمی‌داند مگر کسی که هویتش غیب است، و او جز خداوند نیست.\n\nو خداوند عذر بندگانش را اقامه نکرده است مگر آنکه در ذات خود قصد رحمت آنان را داشته است. پس برخی از مردم را با آنچه به آنان شنواند، مورد رحمت قرار داد، پس «پروردگارشان را اجابت کردند و نماز را برپا داشتند» (اسْتَجابُوا لِرَبِّهِمْ وأَقامُوا الصَّلاةَ) که خداوند در آن به تقسیم بین خود و بنده‌اش حکم کرده است. و کسی که اجابت نکرد، خداوند از او عذرخواهی کرد به اینکه او نشنیده است. و این از حکم غیرت الهی (الغيرة الإلهية) بر الوهیت است که هیچ‌یک از بندگانش با او مخالفت کند، برخلاف آنچه او دعوت کرده است. زیرا اگر می‌دانست که آنان شنیده‌اند و اجابت نکرده‌اند، آنان را در چشم مردم بزرگ می‌کرد و در مقام مقاومت با خود قرار می‌داد. یعنی چون علم سابق او در مورد آنان می‌دانست که «اگر به آنان می‌شنواند، روی برمی‌گرداندند در حالی که اعراض‌کنندگان هستند» (لَوْ أَسْمَعَهُمْ لَتَوَلَّوْا وهُمْ مُعْرِضُونَ)، علم خود را در مورد آنان پوشاند به اینکه فرمود: «و مانند کسانی نباشید که گفتند شنیدیم، در حالی که نمی‌شنوند» (وَلا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ). و فرمود: «و اگر خدا می‌خواست، به آنان می‌شنواند.» پس آنان را در قولشان که «شنیدیم» تکذیب کرد و فرمود: «تنها کسانی [دعوت را] می‌پذیرند که می‌شنوند» (إِنَّما يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ). پس اگر می‌شنیدند، اجابت می‌کردند، زیرا خداوند عزیزتر و والاتر از آن است که مخلوقی با او مقاومت کند.\n\nآیا نمی‌بینی که در حق کسانی از نصاری که شنیدند، می‌فرماید: «و چون آنچه را بر رسول نازل شده بشنوند» (وَإِذا سَمِعُوا ما أُنْزِلَ إِلَى الرَّسُولِ). پس آنان را به شنیدن وصف کرد، سپس آنچه را که هنگام شنیدن از آنان سر زد، ذکر کرد و فرمود: «می‌بینی که چشمانشان از اشک لبریز می‌شود، به سبب آنچه از حق (الحق) شناخته‌اند» (تَرى‏ أَعْيُنَهُمْ تَفِيضُ من الدَّمْعِ مِمَّا عَرَفُوا من الْحَقِّ). پس خبر داد که آنان ایمان آوردند و خبر داد که خدای تعالی آنان را به سبب ایمانشان، به آنچه در آیات ذکر شده، پاداش داد. پس در مورد کسی که اجابت نکرده، مگو که شنیده است، که در این صورت با خداوند در آنچه از آنان خبر داده، مخالفت کرده‌ای.\n\nو خداوند متعال از آنان خبر داده که در آنان کری است، و خبر داده که آنان گفتند: «در گوش‌های ما سنگینی است» (فِي آذانِنا وَقْرٌ). پس قول آنان که «در گوش‌های ما سنگینی است» با قول خداوند که آنان کر هستند، مطابقت دارد. پس نشنیدند و بازنگشتند، زیرا آنچه را گوش‌هایشان شنید، تعقل نکردند. و کسی که از آنان شنید، جز دعا و ندا نشنید، و آن قول اوست: «ای فلان»، و بیش از آن نشنید. پس رحمت خداوند بر بندگانش چقدر عظیم است، در حالی که آنان نمی‌دانند.\n\nبلکه من جماعتی را دیدم که در گستردگی رحمت خداوند منازعه می‌کنند و می‌گویند که آن محدود به طایفه‌ای خاص است. پس آنچه را خداوند گسترده ساخته، محدود و تنگ کردند. اگر خداوند هیچ‌یک از خلقش را رحم نمی‌کرد، کسی که این را می‌گوید از رحمت او محروم می‌شد. اما خداوند جز شمول رحمت را نخواسته است. پس برخی از ما آن را از طریق وجوب می‌گیرند، و آنان کسانی هستند که «تقوا پیشه می‌کنند و زکات می‌دهند» (يَتَّقُونَ ويُؤْتُونَ الزَّكاةَ)، کسانی که ایمان می‌آورند و «از رسول، پیامبر امی، پیروی می‌کنند» (يَتَّبِعُونَ الرَّسُولَ النَّبِيَّ الْأُمِّيَّ). و برخی از ما آن را از طریق امتنان (بخشندگی) از عین منت و فضل الهی می‌گیرند.\n\nو به خدا سوگند، من به حمد خدا از کسانی نیستم که انتقام و تشفی از بندگان خدا را دوست دارند، بلکه خداوند مرا رحمتی آفرید و وارث رحمت کسی قرار داد که به او گفته شد: «و تو را نفرستادیم مگر رحمتی برای جهانیان» (وَما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ). و مؤمنی را از غیر مؤمن جدا نساخت. و این امر در وضع جزیه بر اهل کتاب محقق شد. و سبب نزول این آیه جز دعای او (پیامبر) به مؤاخذه الهی بر مشرکان از رعل و ذکوان و عُصَیّه نبود. و اگر این عتابی برای رسولش (صَلَّى اللهُ عَليهِ وسَلَّم) در حق مشرکی باشد که خبر داده شده که آمرزیده نمی‌شود، پس حال در مورد غیر مشرک، اگرچه ایمان نیاورده باشد، چگونه است؟\n\nپس چشم فهم خود را برای آنچه می‌خوانی باز کن و بگو: «پروردگارا، علم مرا زیاد کن» (قُلْ رَبِّ زِدْنِي عِلْماً)، و آن این است که فهم تو را زیاد کند. پس هرگاه تلاوت را تکرار کنی، بر دانشی که نداشتی افزوده می‌شود، و هرگاه نظر کنی و عبرت بگیری، بر دانشت افزوده می‌شود. و خداوند «حق (الحق) را می‌گوید و راه را هدایت می‌کند» (يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}