{
  "id": 460,
  "title": {
    "ar": "الباب الستون وأربعمائة في معرفة منازلة الإسلام والايمان والإحسان الأول والثاني",
    "en": "Chapter Four Hundred and Sixty, Concerning the Knowledge of the Stations (منازلة) of Islam (الإسلام), Faith (الإيمان), and Spiritual Excellence (الإحسان), the First and the Second.",
    "ur": "باب چار سو ساٹھ، اسلام (الإسلام)، ایمان (الإيمان)، اور احسان (الإحسان) کے پہلے اور دوسرے منازل کی معرفت کے بیان میں۔",
    "fa": "باب چهارصد و شصتم در معرفت منازل اسلام و ایمان و احسان اول و دوم"
  },
  "content": {
    "ar": "## «الباب الستون وأربعمائة في معرفة منازلة الإسلام والايمان والإحسان الأول والثاني»\n\n\n> علمت أني هممت *** ولكن ما فهمت‏\n\n\n> مراد الله فيه *** لكونى ما شهدت‏\n\n\n> فإسلام تبدي *** بقولي قد سلمت‏\n\n\n> به من كل سوء *** به أيضا نعمت‏\n\n\n> وإيمان خفي *** ولكن ما كتمت‏\n\n\n> وإحسان أراه *** بتشبيه فقلت‏\n\n\n> تعالى عن شهودي *** لأني قد جهلت‏\n\n\n> بأن الحق فيه *** وحقا ما قصدت‏\n\n\n> وعلمي شاهد لي *** بأني قد شهدت‏\n\n\n### [الفرق بين الإسلام والإيمان والإحسان‏]\n\n\nقال الله تعالى قالَتِ الْأَعْرابُ آمَنَّا قُلْ لَمْ تُؤْمِنُوا ولكِنْ قُولُوا أَسْلَمْنا وقال هَلْ جَزاءُ الْإِحْسانِ إِلَّا الْإِحْسانُ وورد في الخبر الصحيح الفرق بين الايمان والإسلام والإحسان فالإسلام عمل والايمان تصديق والإحسان رؤية أو كالرؤية\n\n\nفالإسلام انقياد والايمان اعتقاد والإحسان إشهاد فمن جمع هذه النعوت وظهرت عليه أحكامها عم تجلى الحق له في كل صورة فلا ينكره حيث تجلى ولا يظهره في الموطن الذي يحب أن يخفى فيه فيساعد الحق لعلمه بإرادته لعلمه بالمواطن وما يستحقه فما أشرف هذه المنزلة لمن تدلى عليها من شرف فهو المؤمن للمؤمن والمحسن للمحسن وهو المسلم للسلام فإن الحق إذا فعل ما يريده منه العبد فقد انقاد له فيقول العبد رب اغفر لي فيغفر له لأنه صادق في‏\n\n\nقوله هل من مستغفر فاغفر له‏\n\n\nفلقد فات الناس خير كثير لجهلهم وما توغلوا فيه من تنزيه الحق حتى أكذبوه ولهذا قال يا أَهْلَ الْكِتابِ لا تَغْلُوا في دِينِكُمْ ولا تَقُولُوا عَلَى الله إِلَّا الْحَقَّ وليس الحق إلا ما قاله عن نفسه فلو لا ما علم إن العالم بعلمه ما قال لهم‏\nولا تَقُولُوا عَلَى الله إِلَّا الْحَقَّ فحاجة الحق في نفسه إلى ظهوره أعظم من حاجة المظهر له إلى إظهاره فإن الحق قد حجر علينا إظهار الحق في مواطن كالغيبة والنميمة وكتم الأسرار وكلها حق ممنوع الظهور في الكون القولي لا في عينه من حيث هو صفة لمن قام به فهو الظاهر الخفي فالإحسان من الحق رؤية ومن العبد كأنه والايمان من الحق والخلق على حقيقته وكذلك الإسلام عند العارفين به غير أنه لا يقال في الحق إنه مسلم فما كل ما يدري يقال ولا كل ما يشهد يذاع صدور الأحرار قبور الأسرار والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Four Hundred and Sixty: Concerning the Knowledge of the Stations of Islam, Iman, and Ihsan, the First and the Second\n\n> I knew that I intended,\n> But I did not understand\n> The intent of Allah concerning it,\n> Because I did not witness.\n> So Islam manifested\n> Through my saying, \"I have submitted,\"\n> Through it [I am safe] from every evil,\n> And through it, I also found bliss.\n> And Faith (Iman) is hidden,\n> But I did not conceal it.\n> And Excellence (Ihsan) I see it\n> Through similitude, so I said:\n> He is exalted beyond my witnessing,\n> Because I was ignorant\n> That The Real (الحق) is in it,\n> And truly I did not intend [it].\n> But my Knowledge (علمي) bears witness for me\n> That I have indeed witnessed.\n\n### [The Distinction between Islam, Iman, and Ihsan]\n\nAllah the Exalted said: <<قَالَتِ الْأَعْرَابُ آمَنَّا قُل لَّمْ تُؤْمِنُوا وَلَكِن قُولُوا أَسْلَمْنَا>> (The Bedouins say, \"We have believed.\" Say, \"You have not believed; but say, 'We have submitted [Islam].'\") [Quran 49:14]. And He said: <<هَلْ جَزَاءُ الْإِحْسَانِ إِلَّا الْإِحْسَانُ>> (Is the reward for excellence [Ihsan] anything but excellence?) [Quran 55:60].\n\nThe authentic tradition established the distinction between Faith (الإيمان), Submission (الإسلام), and Excellence (الإحسان): Islam is action (عمل), Iman is affirmation/verification (تصديق), and Ihsan is vision (رؤية) or like vision (كالرؤية).\n\nThus, Islam is compliance (انقياد), Iman is conviction (اعتقاد), and Ihsan is witnessing (إشهاد). Whoever gathers these descriptions (نعوت) and upon whom their rulings (أحكامها) become manifest, the Theophany (تجلى) of The Real (الحق) becomes universal for him in every form. He does not deny Him where He manifests, nor does he reveal Him in the station where He loves to be concealed. Thus, he assists The Real due to his knowledge of His Will (إرادته), derived from his knowledge of the stations (المواطن) and what each deserves. How noble is this station (المنزلة) for the one who descends upon it from a place of honor! He is the Believer (المؤمن) for the Believer, the Excellent One (المحسن) for the Excellent One, and the Submitter (المسلم) for Peace (السلام).\n\nFor when The Real does what He wills through the servant, the servant has indeed complied with Him. The servant then says, \"My Lord, forgive me,\" and He forgives him because the servant is truthful in His saying: \"Is there any seeker of forgiveness that I may forgive him?\"\n\nIndeed, much good has escaped people due to their ignorance and their excessive immersion in the transcendence (تنزيه) of The Real, to the point that they deny Him. For this reason, He said: <<يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ وَلَا تَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ>> (O People of the Scripture, do not exceed limits in your religion, nor say about Allah except the truth.) [Quran 4:171]. And the truth (الحق) is only what He has said about Himself. Were it not for what He knew—that the world knows Him through His Knowledge (علم)—He would not have said to them: <<وَلَا تَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ>> (Nor say about Allah except the truth).\n\nThe need of The Real (الحق) in His Essence (الذات) for His manifestation (ظهوره) is greater than the need of the one who manifests Him (المظهر له) to manifest Him. For The Real has restricted us from manifesting the truth (الحق) in certain stations, such as backbiting (الغيبة), slander (النميمة), and concealing secrets (كتم الأسرار). All of these are truth whose manifestation is forbidden in the verbal cosmos (الكون القولي), though not in its essence (عينه) insofar as it is an Attribute (صفة) of the one who possesses it. Thus, He is the Manifest (الظاهر) and the Hidden (الخفي).\n\nTherefore, Ihsan (Excellence) is vision (رؤية) from The Real, and from the servant, it is \"as if\" (كأنه). And Iman (Faith) is upon its reality (حقيقته) from The Real and from Creation (الخلق). Likewise is Islam (Submission) according to those who possess Gnosis (العارفين), except that it is not said of The Real that He is a Submitter (مسلم). Not everything that is known (يدري) is spoken, nor is everything that is witnessed (يشهد) broadcast. The breasts of the free are the tombs of secrets. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (says the truth, and He guides to the way.) [Quran 33:4].",
    "ur": "**باب چار سو ساٹھ: اسلام، ایمان، اور احسانِ اول و ثانی کے مقامات کی معرفت (Ma'rifah) میں**\n\nمیں نے جان لیا کہ میں نے ارادہ کیا، لیکن میں سمجھ نہ سکا\nاس میں اللہ کی مراد کو، کیونکہ میں نے شہود (Shuhūd) نہ کیا\n\nپس اسلام ظاہر ہوا، میرے اس قول سے کہ میں نے سلامتی اختیار کر لی\nاس کے ذریعے ہر برائی سے، اور اس کے ذریعے میں نے نعمت بھی پائی\n\nاور ایمان پوشیدہ ہے، لیکن میں نے اسے چھپایا نہیں\nاور احسان (الإحسان) جسے میں تشبیہ کے ساتھ دیکھتا ہوں، تو میں نے کہا\n\nوہ میرے شہود (Shuhūd) سے بلند ہے، کیونکہ میں نے جہالت کی\nکہ ذات حق (الحق) اس میں ہے، اور میں نے سچائی سے ارادہ نہیں کیا\n\nاور میرا علم میرے لیے گواہ ہے، کہ میں نے شہود (Shuhūd) کیا\n\n***\n\n**[اسلام، ایمان اور احسان (الإحسان) کے درمیان فرق]**\n\nاللہ تعالیٰ نے فرمایا: **\"اعراب (دیہاتیوں) نے کہا کہ ہم ایمان لائے۔ کہہ دیجیے کہ تم ایمان نہیں لائے، بلکہ یوں کہو کہ ہم نے اسلام قبول کیا (أَسْلَمْنا)\"** (الحجرات: ۱۴)۔ اور فرمایا: **\"احسان (الإحسان) کا بدلہ احسان (الإحسان) کے سوا کچھ نہیں\"** (الرحمن: ۶۰)۔\n\nاور صحیح حدیث میں ایمان، اسلام اور احسان (الإحسان) کے درمیان فرق بیان ہوا ہے: پس اسلام (الإسلام) عمل ہے، اور ایمان (الإيمان) تصدیق ہے، اور احسان (الإحسان) رؤیت (دیکھنا) ہے یا رؤیت کی مانند ہے۔\n\nپس اسلام (الإسلام) انقیاد (Submission) ہے، اور ایمان (الإيمان) اعتقاد (Belief) ہے، اور احسان (الإحسان) اشہاد (Witnessing) ہے۔ پس جس شخص نے ان صفات کو جمع کر لیا اور ان کے احکام اس پر ظاہر ہو گئے، تو ذات حق (الحق) کا ظہور الٰہی (التجلی) اس کے لیے ہر صورت میں عام ہو جاتا ہے۔ چنانچہ وہ ذات حق (الحق) کا انکار نہیں کرتا جہاں بھی وہ تجلی (Al-Tajallī) فرمائے، اور نہ ہی اسے اس مقام پر ظاہر کرتا ہے جہاں وہ پوشیدہ رہنا پسند فرماتا ہے۔\n\nپس وہ ذات حق (الحق) کی مدد کرتا ہے، کیونکہ وہ اس کے ارادے کو جانتا ہے، اور مقامات اور ان کے استحقاق کو جانتا ہے۔ پس یہ کتنا شرف والا مقام ہے اس شخص کے لیے جو شرف کے ساتھ اس پر نازل ہوا ہو۔ پس وہ مومن کے لیے مومن ہے، اور محسن کے لیے محسن ہے، اور وہ سلامتی کے لیے مسلم ہے۔ کیونکہ جب ذات حق (الحق) وہ کام کرتا ہے جو بندہ اس سے چاہتا ہے، تو بندہ اس کے لیے منقاد ہو جاتا ہے۔ پس بندہ کہتا ہے: \"اے میرے رب! مجھے بخش دے\"، تو وہ اسے بخش دیتا ہے، کیونکہ وہ اپنے اس قول میں سچا ہے: \"کیا کوئی مغفرت چاہنے والا ہے کہ میں اسے بخش دوں؟\"\n\nلوگوں سے بہت سی بھلائی فوت ہو گئی، ان کی جہالت کی وجہ سے اور اس تنزیہہ (Tanzīh) کی وجہ سے جس میں وہ ذات حق (الحق) کے بارے میں بہت گہرائی میں چلے گئے، یہاں تک کہ انہوں نے اسے جھٹلا دیا۔ اسی لیے اللہ نے فرمایا: **\"اے اہلِ کتاب! اپنے دین میں غلو نہ کرو اور اللہ پر حق (الحق) کے سوا کچھ نہ کہو\"** (النساء: ۱۷۱)۔ اور حق (الحق) وہی ہے جو اس نے اپنے بارے میں خود کہا ہے۔ اگر وہ یہ نہ جانتا کہ عالم اس کے علم کے ساتھ ہے، تو وہ ان سے یہ نہ کہتا: **\"اور اللہ پر حق (الحق) کے سوا کچھ نہ کہو\"**۔\n\nپس ذات حق (الحق) کو اپنی ذات میں ظاہر ہونے کی ضرورت، اس شخص کی ضرورت سے کہیں زیادہ ہے جو اسے ظاہر کرتا ہے۔ کیونکہ ذات حق (الحق) نے ہمیں بعض مقامات پر حق (الحق) کو ظاہر کرنے سے منع کیا ہے، جیسے غیبت، چغلی، اور رازوں کو چھپانا۔ یہ سب حق (الحق) ہیں جن کا ظہور قولی کائنات میں ممنوع ہے، نہ کہ ان کی اصل میں، اس حیثیت سے کہ وہ اس شخص کی صفت ہیں جس کے ساتھ وہ قائم ہیں۔ پس وہ (ذات حق) الظاہر الخفی (الظاہر الخفي) ہے۔\n\nپس احسان (الإحسان) ذات حق (الحق) کی طرف سے رؤیت (دیکھنا) ہے، اور بندے کی طرف سے \"گویا کہ\" (کأنه) ہے۔ اور ایمان (الإيمان) ذات حق (الحق) اور مخلوق کی طرف سے اپنی حقیقت پر ہے۔ اور اسی طرح اسلام (الإسلام) بھی اس کے عارفین (Ārifīn) کے نزدیک اپنی حقیقت پر ہے۔ البتہ ذات حق (الحق) کے بارے میں یہ نہیں کہا جاتا کہ وہ مسلم ہے۔ پس ہر وہ چیز جو جانی جاتی ہے، کہی نہیں جاتی، اور ہر وہ چیز جس کا شہود (Shuhūd) کیا جاتا ہے، پھیلائی نہیں جاتی۔ آزاد لوگوں کے سینے رازوں کی قبریں ہیں۔ اور اللہ **\"حق (الحق) فرماتا ہے اور وہی راہ دکھاتا ہے\"** (الاحزاب: ۴)۔",
    "fa": "باب چهارصد و شصتم در معرفت منازل اسلام، ایمان و احسان اول و دوم\n\nدانستم که قصد کردم *** ولی درنیافتم\nمراد حق (الحق) را در آن *** زیرا که شهود (الشهود) نکردم\nپس اسلام (الإسلام) آشکار شد *** با گفتارم که تسلیم شدم\nبه واسطه آن از هر بدی *** و به واسطه آن نیز نعمت یافتم\nو ایمان (الإيمان) پنهان است *** ولی کتمان نکردم\nو احسان (الإحسان) را می‌بینم *** با تشبیه، پس گفتم\nاو (حق) برتر از شهود (الشهود) من است *** زیرا که نادان بودم\nبه اینکه حق (الحق) در آن است *** و به راستی قصد نکردم\nو علم من برایم گواه است *** که من شهود (الشهود) کرده‌ام.\n\n[تفاوت میان اسلام، ایمان و احسان]\n\nخداوند متعال فرمود: «قَالَتِ الْأَعْرَابُ آمَنَّا قُلْ لَمْ تُؤْمِنُوا وَلَكِنْ قُولُوا أَسْلَمْنَا» (اعراب بادیه‌نشین گفتند: ایمان آوردیم. بگو: ایمان نیاورده‌اید، بلکه بگویید: اسلام آوردیم [تسلیم شدیم]). و فرمود: «هَلْ جَزَاءُ الْإِحْسَانِ إِلَّا الْإِحْسَانُ» (آیا پاداش احسان جز احسان است؟). و در خبر صحیح (حدیث) تفاوت میان ایمان (الإيمان)، اسلام (الإسلام) و احسان (الإحسان) وارد شده است. پس اسلام عمل است، و ایمان تصدیق است، و احسان رؤیت یا مانند رؤیت است.\n\nپس اسلام (الإسلام) انقیاد (گردن نهادن) است، و ایمان (الإيمان) اعتقاد است، و احسان (الإحسان) اِشهاد (به شهود رساندن) است. پس هر کس این صفات را جمع کند و احکام آن‌ها بر او آشکار شود، تجلی حق (تجلی الحق) در هر صورتی برای او فراگیر می‌شود. پس آن را (حق را) در جایی که تجلی (التجلی) کرده است انکار نمی‌کند، و در موطنی که حق دوست دارد در آن پنهان بماند، آن را آشکار نمی‌سازد. پس حق (الحق) را یاری می‌کند، به سبب علمش به اراده حق، و به سبب علمش به مواطن و آنچه شایسته آن است. چه شریف است این منزلت برای کسی که از شرف بر آن فرود آید؛ پس او مؤمن برای مؤمن است و محسن برای محسن، و او تسلیم‌شونده (المسلم) برای سلام (السلام) است. زیرا حق (الحق) هنگامی که آنچه را بنده از او می‌خواهد انجام دهد، در واقع به بنده انقیاد کرده است. پس بنده می‌گوید: پروردگارا مرا بیامرز. و حق او را می‌آمرزد، زیرا بنده در گفتار خود صادق است که: «آیا استغفارکننده‌ای هست تا او را بیامرزم؟»\n\nبه راستی خیر بسیاری از مردم فوت شد، به سبب جهلشان و به سبب غوطه‌ور شدنشان در تنزیه حق (الحق) تا جایی که او را تکذیب کردند. و به همین دلیل فرمود: «يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ وَلَا تَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ» (ای اهل کتاب، در دین خود غلو نکنید و درباره خدا جز حق نگویید). و حق (الحق) نیست مگر آنچه او (خداوند) درباره خود گفته است. اگر نمی‌دانست که عالم به علم اوست، به آنان نمی‌گفت: «وَلَا تَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ». پس نیاز حق (الحق) در ذات خود به ظهورش، بزرگ‌تر از نیاز آشکارکننده او به آشکار ساختن اوست. زیرا حق (الحق) اظهار حق را در مواطنی بر ما ممنوع کرده است، مانند غیبت، سخن‌چینی و کتمان اسرار. و همه این‌ها حق (الحق) است که ظهورش در عالم قولی (گفتاری) ممنوع شده است، نه در عین آن از آن جهت که صفتی است برای کسی که به آن قائم است. پس او (حق) الظاهر الخفی (آشکار پنهان) است.\n\nپس احسان (الإحسان) از جانب حق (الحق) رؤیت است، و از جانب بنده «کأنه» (گویی که). و ایمان (الإيمان) از جانب حق و خلق بر حقیقت خود است، و همچنین اسلام (الإسلام) نزد عارفان به آن؛ جز اینکه درباره حق (الحق) گفته نمی‌شود که او مسلم (تسلیم‌شونده) است. پس نه هر آنچه دانسته می‌شود، گفته می‌شود؛ و نه هر آنچه شهود (الشهود) می‌شود، فاش می‌گردد. سینه‌های آزادگان، گورهای اسرار است. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}