{
  "id": 318,
  "title": {
    "ar": "الباب الثامن عشر وثلاثمائة في معرفة منزل نسخ الشريعة المحمدية وغير المحمدية بالأغراض النفسية عافانا الله وإياكم من ذلك بمنه",
    "en": "Chapter Three Hundred and Eighteen: Concerning the Knowledge of the Station (منزل) of the Abrogation (نسخ) of the Divine Law (الشريعة)—both the Muhammadan and the non-Muhammadan—by means of Egoistic Purposes (الأغراض النفسية). May Allah protect us and you from that by His grace.",
    "ur": "باب تین سو اٹھارہ: شریعت محمدیہ اور غیر محمدیہ کے نسخ (نسخ) کے مقام (منزل) کی معرفت کے بیان میں، جو نفسانی اغراض (الأغراض النفسية) کے سبب ہوتا ہے۔ اللہ تعالیٰ ہمیں اور آپ کو اپنے فضل سے اس سے عافیت عطا فرمائے۔",
    "fa": "باب سیصد و هجدهم در معرفت منزل نسخ شریعت محمدیه و غیر محمدیه به اغراض نفسانی؛ خداوند ما و شما را به فضل خود از آن عافیت بخشد."
  },
  "content": {
    "ar": "## «الباب الثامن عشر وثلاثمائة في معرفة منزل نسخ الشريعة المحمدية وغير المحمدية بالأغراض النفسية عافانا الله وإياكم من ذلك بمنه»\n\n\n> أنا إن فارقت نفسي قام لي *** مثلها في الحسن من غير البشر\n\n\n> ذات حسن وبهاء وسنا *** ليس منها بدليل الشرع شر\n\n\n> فكان الشمس في ذاك السنا *** وكان الشهد في ذلك الأثر\n\n\n> من رأى الشبل إلى جانبه *** أسد عن ناب شدقيه كشر\n\n\n> حذرا منه على أشباله *** طالبا كل خؤون وأشر\n\n\n> صار يستعذب في مرضاته *** صبر الصبر ويستحلي العشر\n> فلتترجم بكلام حسن *** لا تكن ممن هذي ثم فشر\n\n\n> لا يرى الحق عبيد لم يكن *** يبصر المعنى من الحرف نشر\n\n\n> فإذا أبصره قام به *** ورأى الكون فقيرا فنشر\n\n\n> رحمة الله على عالمه *** ودعا الخلق إليه وحشر\n\n\n### [إن الله قد حرم أعراض المسلمين‏]\n\n\nاعلم أيها الولي الحميم أنا روينا في هذا الباب عن عبد الله بن عباس رضي الله عنهما إن رجلا أصاب من عرضه فجاء إليه يستحله من ذلك فقال له يا ابن عباس إني قد نلت منك فاجعلني في حل من ذلك فقال أعوذ بالله أن أحل ما حرم الله إن الله قد حرم أعراض المسلمين فلا أحلها ولكن غفر الله لك فانظر ما أعجب هذا التصريف وما أحسن العلم ومن هذا الباب حلف الإنسان على ما أبيح له فعله أن لا يفعله أو يفعله ففرض الله تحلة الايمان وهو من باب الاستدراج والمكر الإلهي إلا لمن عصمه الله بالتنبيه عليه فما ثم شارع إلا الله تعالى قال الله تعالى لنبيه صَلَّى اللهُ عَليهِ وسَلَّم لِتَحْكُمَ بَيْنَ النَّاسِ بِما أَراكَ الله ولم يقل بما رأيت بل عتبة سبحانه وتعالى لما حرم على نفسه باليمين في قضية عائشة وحفصة فقال تعالى يا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ ما أَحَلَّ الله لَكَ تَبْتَغِي مَرْضاتَ أَزْواجِكَ فكان هذا مما أرته نفسه فهذا يدلك أن قوله تعالى بِما أَراكَ الله إنه ما يوحي به إليه لا ما يراه في رأيه فلو كان الدين بالرأي لكان رأى النبي صَلَّى اللهُ عَليهِ وسَلَّم أولى من رأى كل ذي رأى فإذا كان هذا حال النبي صَلَّى اللهُ عَليهِ وسَلَّم فيما أرته نفسه فكيف رأى من ليس بمعصوم ومن الخطاء أقرب إليه من الإصابة فدل إن الاجتهاد الذي ذكره رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إنما هو طلب الدليل على تعيين الحكم في المسألة الواقعة لا في تشريع حكم في النازلة فإن ذلك شرع لم يأذن به الله ولقد أخبرني القاضي عبد الوهاب الأزدي الإسكندري بمكة سنة تسع وتسعين وخمسمائة قال رأيت رجلا من الصالحين بعد موته في المنام فسألته ما رأيت فذكر أشياء منها قال ولقد رأيت كتبا موضوعة وكتبا مرفوعة فسألت ما هذه الكتب المرفوعة فقيل لي هذه كتب الحديث فقلت وما هذه الكتب الموضوعة فقيل لي هذه كتب الرأي حتى يسأل عنها أصحابها فرأيت الأمر فيه شدة\n\n\n### [أن الشريعة هي المحجة البيضاء محجة السعداء]\n\n\nاعلم وفقك الله أن الشريعة هي المحجة البيضاء محجة السعداء وطريق السعادة من مشى عليها نجا ومن تركها هلك‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لما نزل عليه قوله تعالى وأَنَّ هذا صِراطِي مُسْتَقِيماً خط رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الأرض خط وخطا خطوطا عن جانبي الخط يمينا وشمالا ثم وضع أصبعه على الخط وقال تاليا وأَنَّ هذا صِراطِي مُسْتَقِيماً فَاتَّبِعُوهُ ولا تَتَّبِعُوا السُّبُلَ وأشار إلى تلك الخطوط التي خطها عن يمين الخط ويساره فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ وأشار إلى الخط المستقيم‏\n\n\nولقد أخبرني بمدينة سلا مدينة بالمغرب على شاطئ البحر المحيط يقال لها منقطع التراب ليس وراءها أرض رجل من الصالحين الأكابر من عامة الناس قال رأيت في النوم محجة بيضاء مستوية عليها نور سهلة ورأيت عن يمين تلك المحجة وشمالها خنادق وشعابا وأودية كلها شوك لا تنسلك لضيقها وتوعر مسالكها وكثرة شوكها والظلمة التي فيها ورأيت جميع الناس يخبطون فيها عشواء ويتركون المحجة البيضاء السهلة وعلى المحجة رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ونفر قليل معه يسير وهو ينظر إلى من خلفه وإذا في الجماعة متأخر عنها لكنه عليها الشيخ أبو إسحاق إبراهيم بن قرقور المحدث كان سيدا فاضلا في الحديث اجتمعت بابنه فكان يفهم عن النبي صَلَّى اللهُ عَليهِ وسَلَّم أنه يقول له ناد في الناس بالرجوع إلى الطريق فكان ابن قرقور يرفع صوته ويقول في ندائه ولا من داع ولا من مستدع هلموا إلى الطريق هلموا قال فلا يجيبه أحد ولا يرجع إلى الطريق أحد\n\n\n### [لما غلبت الأهواء على النفوس تركوا المحجة البيضاء]\n\n\nواعلم أنه لما غلبت الأهواء على النفوس وطلبت العلماء المراتب عند الملوك تركوا المحجة البيضاء وجنحوا إلى التأويلات البعيدة ليمشوا أغراض الملوك فيما لهم فيه هوى نفس ليستندوا في ذلك إلى أمر شرعي مع كون الفقيه ربما لا يعتقد ذلك ويفتي به وقد رأينا منهم جماعة على هذا من قضاتهم وفقهائهم ولقد أخبرني الملك الظاهر غازي ابن الملك الناصر صلاح الدين يوسف بن أيوب وقد وقع بيني وبينه في مثل هذا كلام فنادى بمملوك وقال جئني بالحرمدان فقلت له ما شأن الحرمدان قال أنت تنكر على ما يجري في بلدي ومملكتي من المنكرات والظلم وأنا والله أعتقد مثل ما تعتقد أنت فيه من أن ذلك كله منكر ولكن والله يا سيدي ما منه منكر\nإلا بفتوى فقيه وخط يده عندي بجواز ذلك فعليهم لعنة الله ولقد أفتاني فقيه هو فلان وعين لي أفضل فقيه عنده في بلده في الدين والتقشف بأنه لا يجب على صوم شهر رمضان هذا بعينه بل الواجب على شهر في السنة والاختيار لي فيه أي شهر شئت من شهور السنة قال السلطان فلعنته في باطني ولم أظهر له ذلك وهو فلان وسماه لي رحم الله جميعهم فلتعلم إن الشيطان قد مكنه الله من حضرة الخيال وجعل له سلطانا فيها فإذا رأى الفقيه يميل إلى هوى يعرف أنه يردي عند الله زين له سوء عمله بتأويل غريب يمهد له فيه وجها يحسنه في نظره ويقول له إن الصدر الأول قد دانوا الله بالرأي وقاس العلماء في الأحكام واستنبطوا العلل للأشياء وطردوها وحكموا في المسكوت عنه بما حكموا به في المنصوص عليه للعلة الجامعة بينهما والعلة من استنباطه فإذا مهد له هذه السبيل جنح إلى نيل هواه وشهوته بوجه شرعي في زعمه فلا يزال هكذا فعله في كل ماله أو لسلطانه فيه هوى نفس ويرد الأحاديث النبوية ويقول لو أن هذا الحديث يكون صحيحا وإن كان صحيحا يقول لو لم يكن له خبر آخر يعارضه وهو ناسخ له لقال به الشافعي إن كان هذا الفقيه شافعيا أو لقال به أبو حنيفة إن كان الرجل حنفيا وهكذا أقوال أتباع هؤلاء الأئمة كلهم ويرون أن الحديث والأخذ به مضلة وأن الواجب تقليد هؤلاء الأئمة وأمثالهم فيما حكموا به وإن عارضت أقوالهم الأخبار النبوية فالأولى الرجوع إلى أقاويلهم وترك الأخذ بالأخبار والكتاب والسنة فإذا قلت لهم قد روينا عن الشافعي رضي الله عنه أنه قال إذا أتاكم الحديث يعارض قولي فاضربوا بقولي الحائط وخذوا بالحديث فإن مذهبي الحديث وقد روينا عن أبي حنيفة أنه قال لأصحابه حرام على كل من أفتى بكلامي ما لم يعرف دليلي وما روينا شيئا من هذا عن أبي حنيفة إلا من طريق الحنفيين ولا عن الشافعي إلا من طريق الشافعية وكذلك المالكية والحنابلة فإذا ضايقتهم في مجال الكلام هربوا وسكتوا وقد جرى لنا هذا معهم مرارا بالمغرب وبالمشرق فما منهم أحد على مذهب من يزعم أنه على مذهبه فقد انتسخت الشريعة بالأهواء وإن كانت الأخبار موجودة مسطرة في الكتب الصحاح وكتب التواريخ بالتجريح والتعديل موجودة والأسانيد محفوظة مصونة من التغيير والتبديل ولكن إذا ترك العمل بها واشتغل الناس بالرأي ودانوا أنفسهم بفتاوى المتقدمين مع معارضة الأخبار الصحاح لها فلا فرق بين عدمها ووجودها إذ لم يبق لها حكم عندهم وأي نسخ أعظم من هذا وإذا قلت لأحدهم في ذلك شيئا يقول لك هذا هو المذهب وهو والله كاذب فإن صاحب المذهب قال له إذا عارض الخبر كلامي فخذ بالحديث واترك كلامي في الحش فإن مذهبي الحديث فلو أنصف لكان على مذهب الشافعي من ترك كلام الشافعي للحديث المعارض فالله يأخذ بيد الجميع وبعد أن تبين ما قررناه‏\n\n\n### [إن الإنسان إذا زهد في غرضه أقام له الحق عوضا من صورة نفسه صورة هداية إلهية]\n\n\nفاعلم إن الإنسان إذا زهد في غرضه ورغب عن نفسه وآثر ربه أقام له الحق عوضا من صورة نفسه صورة هداية إلهية حقا من عند حق حتى يرفل في غلائل النور وهي شريعة نبيه ورسالة رسوله فيلقي إليه من ربه ما يكون فيه سعادته فمن الناس من يراها على صورة نبيه ومنهم من يراها على صورة حاله فإذا تجلت له في صورة نبيه فليكن عين فهمه فيما تلقي إليه تلك الصورة لا غير فإن الشيطان لا يتمثل على صورة نبي أصلا فتلك حقيقة ذلك النبي وروحه أو صورة ملك مثله عالم من الله بشريعته فما قال له فهو ذاك ونحن قد أخذنا عن مثل هذه الصورة أمورا كثيرة من الأحكام الشرعية لم نكن نعرفها من جهة العلماء ولا من الكتب فلما عرضت ما خاطبتني به تلك الصورة من الأحكام الشرعية على بعض علماء بلادنا ممن جمع بين الحديث والمذاهب فأخبرني بجميع ما أخبرته به أنه روى في الصحيح عن النبي صَلَّى اللهُ عَليهِ وسَلَّم ما غادر حرفا واحدا وكان يتعجب من ذلك حتى أنه من جملة ذلك رفع اليدين في الصلاة في كل خفض ورفع ولا يقول بذلك أهل بلادنا جملة واحدة وليس عندنا من يفعل ذلك ولا رأيته فلما عرضته على محمد بن علي بن الحاج وكان من المحدثين روى لي فيه حديثا صحيحا عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ذكره مسلم ووقفت عليه بعد ذلك في صحيح مسلم لما طالعت الأخبار ورأيت بعد ذلك أن فيه رواية عن مالك بن أنس رواها ابن وهب وذكر أبو عيسى الترمذي هذا الحديث وقال وبه يقول مالك والشافعي وكذا اتفق لي في\n\n\nالأخذ من صورة نبيي صَلَّى اللهُ عَليهِ وسَلَّم ما يعرض علي من الأحكام المشروعة التي لم يكن لنا علم بها وأما إذا ظهرت له على غير صورة رسوله فتلك الصورة\nراجعة إلى حاله لا بد من ذلك أو إلى منزلة الشرع في ذلك الوقت في ذلك الموضع الذي رآه فيه مثل الرؤيا سواء إلا إن هذا الإنسان يراها في اليقظة والعامة ترى ذلك في النوم فلا يأخذ عن تلك الصورة إذا تجلت بهذه المثابة شيئا من الأحكام المشروعة وكل ما أتى به من العلوم والأسرار مما عدا التحليل والتحريم فلا تحجير عليه فيما يأخذه منها لا في العقائد ولا في غيرها فإن الحضرة الإلهية تقبل جميع العقائد إلا الشرك فإنها لا تقبله فإن الشريك عدم محض والوجود المطلق لا يقبل العدم والشريك لا شك أنه خارج عن شريكه بخلاف ما يعتقد فيه مما يتصف به الموصوف في نفسه فلهذا قلنا لا يقبل الشريك لأنه ما ثم شريك حتى يقبل وإن كان قد جاء في قوله تعالى ومن يَدْعُ مَعَ الله إِلهاً آخَرَ لا بُرْهانَ لَهُ به فافهم هذه الإشارة فإن الشبهة تأتي في صورة البرهان فهذا ذم للمقلدة لا لأصحاب النظر وإن أخطئوا\n\n\n### [أن الغرض هو عين الإرادة]\n\n\nثم اعلم أن الغرض هو عين الإرادة إلا أنه إرادة للنفس بها تعشق وهوى فثبتت فسميت غرضا إذا كان الغرض هو الإشارة التي تنصبها الرماة للمناضلة ولما كانت السهام من الرماة تقصدها وهي ثابتة لا تزول سميت الإرادة التي بهذه المثابة غرضا لثبوتها في نفس من قامت به لتعشقه بذلك الأمر ولا يبالي من سهام أقوال الناس فيه لذلك وسواء كان ذلك الغرض محمودا أو مذموما لكنهم اصطلحوا على أنه إذا قيل فيه غرض نفسي ونسبوه إلى النفس أن يكون مذموما وإذا عرى عن هذه النسبة قد يكون محمودا وقد يكون مذموما ولهذا وصف الحق بأن له إرادة ولم يتصف بأن له غرضا لأن الغرض الغالب عليه تعلق الذم به وهو عرض يعرض للنفس فأعجم القضاء والقدر عينه فسمي غرضا لما ذكرناه لما يقوم بصاحبه من اللجاج في إمضائه وهو عين العلة التي لأجلها كان وقوع ذلك الفعل أو تركه إن كان الغرض تركه والعلة مرض والأغراض أمراض النفوس وإنما قلنا بأنه أمر يعرض للنفس لأن النفس إنما خلق لها الإرادة لتريد بها ما أراد الله أن تأتيه من الأمور أو تتركه على ما حد لها الشارع فالأصل هو ما ذكرناه فلما عرض لهذه الإرادة تعشق نفسي بهذا الأمر ولم تبال من حكم الشرع فيه بالفعل أو الترك حتى لو صادف الأمر الشرعي بإمضائه لم يكن بالقصد منه وإنما وقع له بالاتفاق كون الشارع أمره به ففعله صاحب هذه الصفة لغرضه لا لحكم الشارع فلهذا لم يحمده الله على فعله إلا إن سأل قبل إمضاء الغرض هل للشرع في إمضائه حكم يحمد فيفتيه المفتي بأن الشارع قد حكم فيه بالإباحة أو بالندب أو بالوجوب فيمضيه عند ذلك فيكون حكما شرعيا وافق هوى نفس فيكون مأجورا عليه والأول ليس كذلك فإن الأول هوى نفس وغرض وافق حكم شرع محمود فلم يمضه للشرع على طريق القربة فخسر فانظر يا ولي في أغراضك النفسية إذا عرضت لك ما حكمها في الشرع فإذا حكم عليك الشرع بالفعل فافعله أو بالترك فاتركه فإن غلب عليك بعد السؤال ومعرفتك بحكم الشرع فيه بالترك ولم تتركه واعتقدت إنك مخطئ في ذلك فأنت مأجور من وجوه من بحثك وسؤالك عن حكم الشرع فيه قبل إمضائه ومن اعتقادك أولا في الشرع حتى سألت عن حكمه في ذلك الأمر ومن اعتقادك بعد العلم بأنه حرام يجب تركه ومن استنادك إلى أن الله غفور رحيم يعفو ويصفح بطريق حسن الظن بالله ومن كونك لم تقصد انتهاك حرمة الله ومن كونك معتقد السابق القضاء والقدر فيك بإمضاء هذا الأمر كمسألة موسى مع آدم عليه السلام فهذه وجوه كثيرة أنت مأجور من جهتها في عين معصيتك وأنت مأثوم فيها من وجه واحد وهو عين إمضاء ذلك الأمر الذي هو هوى نفسك وإن زاد إلى تلك الوجوه إنك يسوؤك ذلك الأمر كما\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم المؤمن من سرته حسنته وساءته سيئته‏\n\n\nفبخ على بخ وهذا كله إنما جعله الله للمؤمن إرغاما للشيطان الذي يزين للإنسان سوء عمله فإن الشيطان يأمر بالفحشاء فوعد الله بالمغفرة وهي الستر الذي يجعله الله بين المؤمن العاصي وبين الكفر الذي يرديه عند وقوع المعصية فيعتقد أنها معصية ولا يبيح ما حرم الله وذلك من بركة ذلك الستر ثم ثم مغفرة أخرى وهو ستر خلف سترين ستر عليه في الدنيا لم يمض فيه حد الله المشروع في تلك المعصية وإن ستر عليه في الآخرة لم يعاقبه عليها فالستر الأول محقق في الوقت قال تعالى والله يَعِدُكُمْ مَغْفِرَةً مِنْهُ وفَضْلًا فهذه المغفرة لأمره بالفحشاء والفضل لما وعد به الشيطان من الفقر في قوله تعالى الشَّيْطانُ يَعِدُكُمُ الْفَقْرَ ويَأْمُرُكُمْ بِالْفَحْشاءِ فأراح الله المؤمن حيث ناب عنه الحق سبحانه في مدافعة ما أراد الشيطان إمضائه في المؤمن فدفع الله عن عبده المؤمن وعدا إلهيا دفع‏\nبه وعدا شيطانيا والله لا يقاوم ولا يغالب فالمغفرة متحققة والفضل متحقق وباء الشيطان بالخسران المبين ولهذه الحقيقة أمرنا الله أن نتخذه وكيلا في أمورنا فيكون الحق هو الذي يتولى بنفسه دفع مضار هذه الأمور عن المؤمنين وما غرض الشيطان المعصية لعينها وإنما غرضه إن يعتاد العبد طاعة الشيطان فيستدرجه حتى يأمره بالشرك الذي فيه شقاوة الأبد وذلك لا يكون إلا برفع الستر الاعتصامي الحائل بين العبد والشرك والله تعالى يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 318: On the Knowledge of the Station of the Abrogation of the Muhammadan and Non-Muhammadan Law by Means of Selfish Desires—May Allah Grant Us and You Refuge from That by His Grace\n\nIf I depart from my self, there arises for me\nIts like in beauty, but not among humankind.\n\nAn essence of beauty, splendor, and light,\nFrom which, by the proof of the Law, there is no evil.\n\nIt was like the sun in that light,\nAnd like honey in that trace.\n\nWhoever sees the cub beside him,\nA lion bares its fangs from its jaws,\n\nWary of it, protecting its cubs,\nSeeking every treacherous and wicked one.\n\nHe begins to find sweet, in seeking its pleasure,\nThe patience of patience, and finds the bitter sweet.\n\nSo let it be translated with beautiful speech,\nDo not be among those who babble and then distort.\n\nThe servants do not see The Real (الحق) unless\nThey spread the meaning from the letter.\n\nAnd when he perceives it, he rises by it,\nAnd sees the cosmos as poor, and then spreads [the bounty].\n\nThe mercy of Allah upon its knower,\nAnd he called creation to Him and gathered [them].\n\n### [Indeed Allah Has Forbidden the Honor of Muslims]\n\nKnow, O intimate friend (الولي الحميم), that we have related in this chapter, on the authority of Abdullah ibn Abbas (may Allah be pleased with them both), that a man had wronged his honor. He came to him seeking absolution for that, saying: \"O Ibn Abbas, I have wronged you, so absolve me of it.\" He replied: \"I seek refuge in Allah from making lawful what Allah has forbidden. Indeed, Allah has forbidden the honor of Muslims, so I shall not make it lawful. But may Allah forgive you.\" Look at how wondrous this disposition (التصريف) is, and how excellent is this Knowledge (العلم).\n\nRelated to this chapter is the case of a person swearing an oath concerning something permissible for him to do—that he will not do it, or that he will do it. Allah has mandated the expiation of oaths. This falls under the category of gradual enticement (الاستدراج) and Divine Cunning (المكر الإلهي), except for those whom Allah protects by alerting them to it. For there is no Lawgiver (شارع) except Allah, the Exalted. Allah, the Exalted, said to His Prophet (peace and blessings be upon him): <<لِتَحْكُمَ بَيْنَ النَّاسِ بِما أَراكَ الله>> (That you may judge between the people by what Allah has shown you). He did not say, \"by what you have seen.\" Rather, He, Glory be to Him, admonished him when he forbade something upon himself by oath in the matter concerning Aisha and Hafsa, saying, the Exalted: <<يا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ ما أَحَلَّ الله لَكَ تَبْتَغِي مَرْضاتَ أَزْواجِكَ>> (O Prophet, why do you prohibit what Allah has made lawful for you, seeking the pleasure of your wives?).\n\nThis was something his own self (نفسه) showed him. This indicates to you that His saying, the Exalted, <<بِما أَراكَ الله>> (by what Allah has shown you), refers to what He reveals to him, not what he sees through his own opinion. If religion were based on opinion, the opinion of the Prophet (peace and blessings be upon him) would be more worthy than the opinion of every person of opinion. If this is the state of the Prophet (peace and blessings be upon him) regarding what his self showed him, then what about the opinion of one who is not infallible, and for whom error is closer than correctness?\n\nThis proves that the independent legal reasoning (الاجتهاد) mentioned by the Messenger of Allah (peace and blessings be upon him) is merely the search for evidence to specify the ruling in an existing matter, not the legislation of a ruling for a new incident. For that would be legislation (شرع) unauthorized by Allah.\n\nThe Qadi Abdul Wahhab al-Azdi al-Iskandari informed me in Mecca in the year 599 AH (1202 CE), saying: \"I saw a righteous man after his death in a dream, and I asked him what he had seen. He mentioned several things, among which he said: 'I saw books laid down (موضوعة) and books raised up (مرفوعة).' I asked, 'What are these raised-up books?' I was told, 'These are the books of Hadith.' I asked, 'And what are these laid-down books?' I was told, 'These are the books of Opinion (الرأي), until their authors are questioned about them.' I saw that the matter was severe.\"\n\n### [That the Law is the Clear White Path, the Path of the Fortunate]\n\nKnow, may Allah grant you success, that the Law (الشريعة) is the Clear White Path (المحجة البيضاء), the path of the fortunate. It is the way of felicity: whoever walks upon it is saved, and whoever abandons it is ruined.\n\nThe Messenger of Allah (peace and blessings be upon him) said, when the saying of the Exalted was revealed to him: <<وأَنَّ هذا صِراطِي مُسْتَقِيماً>> (And that this is My path, straight), the Messenger of Allah (peace and blessings be upon him) drew a line on the ground, and drew lines on both sides of that line, to the right and the left. Then he placed his finger on the main line and recited: <<وأَنَّ هذا صِراطِي مُسْتَقِيماً فَاتَّبِعُوهُ ولا تَتَّبِعُوا السُّبُلَ>> (And that this is My path, straight, so follow it; and do not follow the [other] ways). He pointed to the lines he had drawn to the right and left of the main line: <<فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ>> (Lest they disperse you from His way). And he pointed to the straight line.\n\nA man from the great righteous common folk informed me in the city of Salé, a city in the Maghreb on the shore of the Atlantic Ocean, which is called the \"End of the Land\" because there is no land beyond it. He said: \"I saw in a dream a level White Path (محجة بيضاء) upon which was light, and it was easy. I saw to the right and left of that path trenches, ravines, and valleys, all full of thorns, impassable due to their narrowness, the ruggedness of their tracks, the abundance of their thorns, and the darkness within them. I saw all the people stumbling blindly within them, abandoning the easy White Path. Upon the Path was the Messenger of Allah (peace and blessings be upon him) and a small group walking with him. He was looking at those behind him. Among the group, lagging behind but still upon the Path, was Shaykh Abu Ishaq Ibrahim ibn Qurqur, the traditionist (المحدث), who was a virtuous master in Hadith. I met his son, and he understood from the Prophet (peace and blessings be upon him) that he was telling him: 'Call out to the people to return to the Path.' So Ibn Qurqur raised his voice and called out, though there was no caller and no one being called: 'Come to the Path! Come!' He said: 'But no one answered him, and no one returned to the Path.'\"\n\n### [When Desires Overcame the Souls, They Abandoned the Clear White Path]\n\nKnow that when selfish desires (الأهواء) overcame the souls (النفوس) and the scholars sought ranks with the kings, they abandoned the Clear White Path and inclined toward far-fetched interpretations (التأويلات البعيدة) in order to facilitate the aims of the kings concerning their personal desires (هوى نفس). They did this so they could rely on a legal matter, even though the jurist (الفقيه) might not believe in that ruling himself yet still issue the fatwa. We have seen a group of them—among their judges and jurists—acting in this manner.\n\nAl-Malik al-Zahir Ghazi, the son of Al-Malik al-Nasir Salah al-Din Yusuf ibn Ayyub, informed me—and a discussion had taken place between us regarding this very matter—that he called a servant and said: \"Bring me the inkwell (الحرمدان).\" I asked him, \"What is the matter with the inkwell?\" He said: \"You denounce the reprehensible acts (المنكرات) and injustice that occur in my country and kingdom. By Allah, I believe exactly as you do that all of it is reprehensible. But, by Allah, my master, there is no reprehensible act among them except by the fatwa of a jurist, with his signature in my possession permitting it. May the curse of Allah be upon them! A certain jurist—and he named the most virtuous jurist he had in his city regarding religion and asceticism—issued a fatwa to me that I am not obligated to fast this specific month of Ramadan. Rather, the obligation upon me is one month per year, and I have the choice of which month of the year I wish to fast.\" The Sultan said: \"I cursed him inwardly, but I did not reveal it to him.\" And he named him for me. May Allah have mercy on all of them.\n\nKnow that Allah has granted the Devil (الشيطان) power over the Presence of Imagination (حضرة الخيال) and given him authority within it. When the Devil sees a jurist inclining toward a desire that he knows will lead to ruin before Allah, he beautifies his evil deed for him through a strange interpretation, paving a way for him that makes it appear good in his sight. He tells him that the early generations worshipped Allah through opinion (الرأي), and that scholars used analogy (قاس) in rulings, derived the operative causes (العلل) for things and applied them universally, and ruled on matters left silent with the same ruling as those explicitly mentioned due to the common operative cause—and that cause is derived by his own deduction. When this path is paved for him, he inclines toward achieving his desire and lust by what he claims is a legal means. He continues this action in everything in which he or his ruler has a personal desire.\n\nHe rejects the Prophetic narrations and says: \"Even if this Hadith were authentic,\" and even if it were authentic, he says: \"If there were not another narration contradicting it, which abrogates it, Al-Shafi'i would have adopted it,\" if this jurist is Shafi'i. Or, \"Abu Hanifa would have adopted it,\" if the man is Hanafi. And so are the sayings of all the followers of these Imams. They believe that the Hadith and acting upon it is a source of misguidance, and that the obligation is to imitate (تقليد) these Imams and their likes in what they have ruled, even if their sayings contradict the Prophetic narrations. They hold that it is preferable to return to their sayings and abandon acting upon the narrations, the Book, and the Sunna.\n\nIf you say to them: \"We have related from Al-Shafi'i (may Allah be pleased with him) that he said: 'If a Hadith comes to you contradicting my saying, throw my saying against the wall and adopt the Hadith, for my school (مذهبي) is the Hadith.' And we have related from Abu Hanifa that he said to his companions: 'It is forbidden for anyone who issues a fatwa based on my words without knowing my evidence.'\" We have not related anything of this from Abu Hanifa except through the Hanafis, nor from Al-Shafi'i except through the Shafi'is, and likewise the Malikis and Hanbalis.\n\nIf you press them in the field of discussion, they flee and fall silent. This has happened to us repeatedly in the Maghreb and the Mashriq. None of them truly follows the school of the one whose school he claims to follow. Thus, the Law (الشريعة) has been abrogated (انتسخت) by desires (الأهواء), even though the narrations are extant, recorded in the authentic books, and the books of history concerning authentication and disparagement (التجريح والتعديل) are available, and the chains of transmission (الأسانيد) are preserved and protected from alteration and substitution. However, when acting upon them is abandoned, and people occupy themselves with opinion and commit themselves to the fatwas of the predecessors despite the authentic narrations contradicting them, there is no difference between their non-existence and their existence, since they no longer hold any ruling authority for them. What abrogation (نسخ) is greater than this?\n\nIf you say anything to one of them about this, he tells you: \"This is the school.\" By Allah, he is lying, for the founder of the school told him: \"If a narration contradicts my words, adopt the Hadith and leave my words in the latrine, for my school is the Hadith.\" If he were fair, he would be following the school of Al-Shafi'i by abandoning Al-Shafi'i's words for the contradicting Hadith. May Allah take the hand of all. Now that what we have established is clear...\n\n### [That When Man Renounces His Aim, The Real Establishes for Him, in Place of the Image of His Self, an Image of Divine Guidance]\n\nKnow that when a person renounces his aim (غرضه), turns away from his self (نفسه), and prefers his Lord, The Real (الحق) establishes for him, in place of the image of his self, an image of true Divine Guidance (هداية إلهية) from The Real, so that he may walk in the robes of light—which is the Law (شريعة) of His Prophet and the message of His Messenger. Thus, his Lord casts upon him that which contains his felicity.\n\nAmong people, some see this guidance in the form of their Prophet, and some see it in the form of their own spiritual state (حاله). If it manifests (تجلت) to him in the form of his Prophet, then the focus of his understanding must be solely on what that image conveys to him, and nothing else. For the Devil never takes the form of a Prophet. That image is either the Reality (حقيقة) and Spirit of that Prophet, or the image of an angel like him, who knows the Law from Allah. Whatever it tells him is the truth.\n\nWe have taken many matters of legal rulings (الأحكام الشرعية) from such an image, rulings we did not know through scholars or books. When I presented the legal rulings that image addressed me with to some scholars in our lands—those who combined Hadith and the schools of jurisprudence—he informed me that everything I told him was narrated in the authentic collections on the authority of the Prophet (peace and blessings be upon him), without missing a single letter. He was astonished by this. Among these rulings was the raising of the hands in prayer during every lowering and raising, a practice not universally accepted by the people of our lands, and I had not seen anyone among us perform it. When I presented it to Muhammad ibn Ali ibn al-Hajj, who was a traditionist, he narrated to me an authentic Hadith about it from the Messenger of Allah (peace and blessings be upon him), which Muslim mentioned. I later found it in *Sahih Muslim* when I consulted the narrations. I also saw afterward that it contained a narration from Malik ibn Anas, related by Ibn Wahb, and Abu Isa al-Tirmidhi mentioned this Hadith and said: \"Malik and Al-Shafi'i hold this opinion.\" Similarly, I was granted, through receiving from the image of my Prophet (peace and blessings be upon him), prescribed rulings (الأحكام المشروعة) of which we had no prior knowledge.\n\nHowever, if it appears to him in a form other than that of his Messenger, that image necessarily relates back to his own spiritual state, or to the station of the Law at that time and in that place where he saw it, exactly like a dream (الرؤيا). The difference is that this person sees it while awake, whereas the common people see it in sleep. Therefore, he should not take any prescribed rulings from that image if it manifests in this manner. But regarding all the sciences and secrets (العلوم والأسرار) that come to him, excluding what is lawful (التحليل) and unlawful (التحريم), there is no restriction on what he takes from it, neither in matters of creed (العقائد) nor otherwise.\n\nFor the Divine Presence (الحضرة الإلهية) accepts all creeds except polytheism (الشرك), which it does not accept. This is because the partner (الشريك) is pure non-existence (عدم محض), and Absolute Being (الوجود المطلق) does not accept non-existence. The partner is undoubtedly external to its co-partner, unlike what is believed about the attributes with which the Described One is characterized in Himself. This is why we said the partner is not accepted, because there is no partner there to be accepted, even though it came in His saying, the Exalted: <<ومن يَدْعُ مَعَ الله إِلهاً آخَرَ لا بُرْهانَ لَهُ به>> (And whoever invokes, besides Allah, another deity for which he has no proof). Understand this indication, for doubt (الشبهة) comes in the form of proof (البرهان). This is a condemnation of those who blindly imitate (المقلدة), not of those who use intellectual scrutiny (أصحاب النظر), even if they err.\n\n### [That the Aim is the Essence of the Will]\n\nThen know that the aim (الغرض) is the very essence of the Will (الإرادة), except that it is a will belonging to the self (النفس) through which it has passion and desire (هوى). When this will becomes fixed, it is called an aim, since the aim is the target set up by archers for competition. Because the arrows of the archers are directed toward it, and it is fixed and does not move, the will that is of this nature is called an aim due to its fixity in the soul of the one in whom it resides, causing him to be passionately devoted to that matter, heedless of the arrows of people's words concerning it. Whether that aim is praiseworthy or blameworthy, they have conventionally agreed that when it is called a \"selfish aim\" (غرض نفسي) and attributed to the self, it is blameworthy. If it is stripped of this attribution, it may be praiseworthy or blameworthy.\n\nFor this reason, The Real is described as having Will but is not described as having an aim, because the predominant association with the aim is blameworthiness. It is an accident (عرض) that occurs to the self. Divine Decree and Destiny (القضاء والقدر) made it manifest, and it was named an aim for what we mentioned: the persistence (اللجاج) of its possessor in carrying it out. It is the very operative cause (العلة) for the occurrence of that action, or its abandonment if the aim is to abandon it. The operative cause is a sickness, and aims are the sicknesses of the souls.\n\nWe only said that it is a matter that occurs to the self because the Will was created for the self so that it might will through it the matters Allah willed it to undertake or abandon, according to what the Lawgiver (الشارع) defined for it. The origin is what we mentioned. But when this Will was affected by a selfish passion for this matter, it became heedless of the ruling of the Law concerning the action or abandonment. Even if the legal command coincided with its execution, it was not done with the intention of fulfilling the command; rather, it occurred by coincidence that the Lawgiver commanded it. The person possessing this characteristic performed it for his aim, not for the ruling of the Lawgiver. Therefore, Allah does not praise him for his action, unless he asks, before executing the aim, whether the Law has a praiseworthy ruling concerning its execution. If the jurist (المفتي) then issues a fatwa that the Lawgiver has ruled it permissible (الإباحة), recommended (الندب), or obligatory (الوجوب), and he executes it based on that, then it becomes a legal ruling that coincided with a personal desire (هوى نفس), and he is rewarded for it. The former case is not like this, for the former was a personal desire and aim that coincided with a praiseworthy legal ruling, but he did not execute it for the sake of the Law as an act of proximity (القربة), and thus he lost.\n\nSo look, O friend (ولي), at your selfish aims when they occur to you, and what their ruling is in the Law. If the Law rules upon you to act, then act; or to abandon, then abandon. If, after asking and knowing the ruling of the Law concerning its abandonment, it overcomes you and you do not abandon it, yet you believe that you are mistaken in doing so, then you are rewarded from several aspects: from your research and asking about the ruling of the Law before executing it; from your initial belief in the Law, which led you to ask about its ruling concerning that matter; from your belief, after knowing, that it is forbidden and must be abandoned; from your reliance on the fact that Allah is Forgiving and Merciful, Who pardons and overlooks, by way of having good expectation of Allah; from the fact that you did not intend to violate the sanctity of Allah; and from your belief in the pre-existing Divine Decree and Destiny (القضاء والقدر) concerning your execution of this matter, like the issue of Moses with Adam (peace be upon them). These are many aspects for which you are rewarded, even in the very act of your disobedience. Yet you are sinful in one aspect, which is the very execution of that matter which is your personal desire. And if you add to those aspects that the matter grieves you, as the Messenger of Allah (peace and blessings be upon him) said: \"The believer is he whose good deed pleases him and whose evil deed grieves him.\"\n\nBravo! Bravo! All of this Allah has established for the believer as a humiliation for the Devil, who beautifies the evil deed for man. Indeed, the Devil commands immorality (الفحشاء), so Allah promised forgiveness (المغفرة), which is the veil (الستر) that Allah places between the disobedient believer and the disbelief (الكفر) that would ruin him. When the disobedience occurs, he believes it is disobedience and does not make lawful what Allah has forbidden—and that is due to the blessing of that veil. Then there is another forgiveness, which is a veil behind two veils: a veil upon him in this world, where the prescribed penalty (حد) of Allah for that disobedience is not carried out; and a veil upon him in the Hereafter, where He does not punish him for it. The first veil is realized immediately. The Exalted said: <<والله يَعِدُكُمْ مَغْفِرَةً مِنْهُ وفَضْلًا>> (But Allah promises you forgiveness from Him and bounty). This forgiveness relates to the Devil's command of immorality, and the bounty (الفضل) relates to what the Devil promises of poverty, in His saying, the Exalted: <<الشَّيْطانُ يَعِدُكُمُ الْفَقْرَ ويَأْمُرُكُمْ بِالْفَحْشاءِ>> (Satan promises you poverty and commands you to immorality). Thus, Allah grants ease to the believer, as The Real, Glory be to Him, acts on his behalf in repelling what the Devil intended to execute in the believer. Allah repelled a satanic promise from His believing servant with a Divine promise. Allah cannot be resisted or overcome. Thus, forgiveness is realized, and bounty is realized, and the Devil returns with manifest loss. Because of this Reality (الحقيقة), Allah commanded us to take Him as a Trustee (وكيلا) in our affairs, so that The Real Himself undertakes the repulsion of the harms of these matters from the believers. The Devil's aim is not disobedience for its own sake; rather, his aim is for the servant to become accustomed to obeying the Devil, so he gradually entices him until he commands him to polytheism (الشرك), which entails eternal wretchedness. That only occurs by the removal of the protective veil (الستر الاعتصامي) that stands between the servant and polytheism. And Allah, the Exalted, <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (Says the Truth, and He guides to the way.)",
    "ur": "باب نمبر تین سو اٹھارہ: نفسانی اغراض کے ذریعے شریعت محمدیہ اور غیر محمدیہ کے منسوخ ہونے کے مقام کی معرفت میں۔ اللہ تعالیٰ ہمیں اور آپ کو اپنے فضل سے اس سے محفوظ رکھے۔\n\nمیں اگر اپنے نفس سے جدا ہو جاؤں، تو میرے لیے\nاس کے جیسا حسن میں کوئی غیر بشری (ہستی) کھڑی ہو جاتی ہے۔\n\nوہ حسن، چمک اور نور کی حامل ہے،\nشرعی دلیل کی رو سے اس میں کوئی برائی نہیں۔\n\nپس وہ اس نور میں سورج کی مانند ہے،\nاور اس اثر میں شہد کی مانند ہے۔\n\nجس نے شیر کے بچے کو اپنے پہلو میں دیکھا،\nایک شیر اپنے جبڑوں کے دانت نکالے ہوئے ہے۔\n\nاپنے بچوں کی خاطر اس سے ڈرتا ہے،\nہر خائن اور شریر کی تلاش میں ہے۔\n\nوہ اس کی رضا میں صبر کی تلخی کو میٹھا سمجھتا ہے\nاور سختی کو شیریں جانتا ہے۔\n\nپس اسے اچھے کلام میں ترجمہ کر،\nان لوگوں میں سے نہ بن جو بکواس کرتے ہیں اور پھر بگاڑتے ہیں۔\n\nوہ بندے ذات حق (الحق) کو نہیں دیکھتے\nجو حرف سے معنی کو ظاہر ہوتے ہوئے نہیں دیکھتے۔\n\nپس جب وہ اسے دیکھتا ہے تو اس کے ساتھ قائم ہو جاتا ہے،\nاور کائنات کو فقیر دیکھتا ہے تو (علم) پھیلاتا ہے۔\n\nاللہ کی رحمت اس کے عالم پر ہو،\nاور اس نے مخلوق کو اس کی طرف بلایا اور جمع کیا۔\n\n### [بیشک اللہ نے مسلمانوں کی عزتوں کو حرام قرار دیا ہے]\n\nاے میرے ولی دوست! جان لے کہ ہم نے اس باب میں عبداللہ بن عباس رضی اللہ عنہما سے روایت کی ہے کہ ایک شخص نے کسی کی عزت پر حملہ کیا (اس کی غیبت کی یا اسے برا بھلا کہا)، پھر وہ ابن عباس کے پاس آیا اور ان سے اس کی حلت طلب کی (کہ وہ اسے معاف کر دیں)۔ اس نے کہا: اے ابن عباس! میں نے آپ کی عزت پر حملہ کیا ہے، پس مجھے اس سے حلال کر دیجیے۔ تو انہوں نے فرمایا: میں اللہ کی پناہ مانگتا ہوں کہ میں اس چیز کو حلال کروں جسے اللہ نے حرام کیا ہے۔ بیشک اللہ نے مسلمانوں کی عزتوں کو حرام قرار دیا ہے، لہٰذا میں انہیں حلال نہیں کروں گا، لیکن اللہ آپ کو معاف کرے۔\n\nپس دیکھو یہ کیسا عجیب تصرف ہے اور علم کتنا عمدہ ہے۔ اور اسی باب سے یہ مسئلہ بھی ہے کہ انسان کسی مباح فعل کو نہ کرنے یا کرنے کی قسم کھا لے، تو اللہ نے قسموں کا کفارہ فرض کیا ہے۔ یہ تدریجی گرفت اور الٰہی تدبیر (الاستدراج والمکر الإلهي) کے باب سے ہے، سوائے اس شخص کے جسے اللہ نے اس پر تنبیہ کر کے محفوظ رکھا ہو۔\n\nپس وہاں اللہ تعالیٰ کے سوا کوئی شارع نہیں ہے۔ اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم سے فرمایا:\n**لِتَحْكُمَ بَيْنَ النَّاسِ بِما أَراكَ الله**\n(تاکہ آپ لوگوں کے درمیان اس کے مطابق فیصلہ کریں جو اللہ نے آپ کو دکھایا ہے)۔\n\nاور یہ نہیں فرمایا کہ \"بما رأيت\" (جو آپ نے اپنی رائے سے دیکھا)۔ بلکہ اللہ سبحانہ و تعالیٰ نے آپ پر عتاب فرمایا جب آپ نے عائشہ اور حفصہ کے معاملے میں قسم کھا کر اپنے اوپر کسی چیز کو حرام کر لیا تھا، تو اللہ تعالیٰ نے فرمایا:\n**يا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ ما أَحَلَّ الله لَكَ تَبْتَغِي مَرْضاتَ أَزْواجِكَ**\n(اے نبی! آپ اس چیز کو کیوں حرام کرتے ہیں جو اللہ نے آپ کے لیے حلال کی ہے؟ آپ اپنی بیویوں کی خوشنودی چاہتے ہیں)۔\n\nپس یہ وہ چیز تھی جو آپ کے نفس نے آپ کو دکھائی تھی۔ یہ آپ کو بتاتا ہے کہ اللہ تعالیٰ کا قول **بِما أَراكَ الله** سے مراد وہ ہے جو وہ آپ کی طرف وحی کرتا ہے، نہ کہ وہ جو آپ اپنی رائے میں دیکھتے ہیں۔ اگر دین رائے (اجتہاد) سے ہوتا تو نبی صلی اللہ علیہ وسلم کی رائے ہر صاحب رائے کی رائے سے زیادہ اولیٰ ہوتی۔\n\nپس جب نبی صلی اللہ علیہ وسلم کا حال یہ تھا اس چیز میں جو آپ کے نفس نے آپ کو دکھائی، تو اس شخص کی رائے کا کیا حال ہو گا جو معصوم نہیں ہے اور جس کے لیے خطا، درستگی سے زیادہ قریب ہے؟\n\nپس اس سے یہ ثابت ہوا کہ رسول اللہ صلی اللہ علیہ وسلم نے جس اجتہاد کا ذکر فرمایا ہے، وہ صرف پیش آنے والے مسئلے میں حکم کے تعین کے لیے دلیل کی تلاش ہے، نہ کہ کسی نئے واقعے میں حکم کی تشریع (قانون سازی) کرنا۔ کیونکہ یہ ایسی شریعت سازی ہے جس کی اللہ نے اجازت نہیں دی۔\n\nاور مجھے قاضی عبدالوہاب الازدی الاسکندری نے مکہ میں ۵۹۹ھ میں خبر دی، انہوں نے کہا: میں نے ایک نیک آدمی کو اس کی وفات کے بعد خواب میں دیکھا، تو میں نے اس سے پوچھا کہ تم نے کیا دیکھا؟ تو اس نے کئی چیزیں ذکر کیں، ان میں سے یہ بھی کہا: میں نے کچھ کتابیں رکھی ہوئی اور کچھ کتابیں اٹھائی ہوئی دیکھیں۔ میں نے پوچھا کہ یہ اٹھائی ہوئی کتابیں کیا ہیں؟ تو مجھے بتایا گیا کہ یہ حدیث کی کتابیں ہیں۔ میں نے پوچھا کہ یہ رکھی ہوئی کتابیں کیا ہیں؟ تو مجھے بتایا گیا کہ یہ رائے (اجتہاد) کی کتابیں ہیں، یہاں تک کہ ان کے مصنفین سے ان کے بارے میں سوال کیا جائے گا۔ تو میں نے اس معاملے میں سختی دیکھی۔\n\n### [بیشک شریعت محجۃ البیضاء (روشن شاہراہ) ہے، جو سعادت مندوں کی شاہراہ ہے]\n\nاللہ آپ کو توفیق دے، جان لیجیے کہ شریعت محجۃ البیضاء (روشن شاہراہ) ہے، جو سعادت مندوں کی شاہراہ ہے، اور سعادت کا راستہ ہے۔ جو اس پر چلا وہ نجات پا گیا اور جو اسے چھوڑ گیا وہ ہلاک ہو گیا۔\n\nجب رسول اللہ صلی اللہ علیہ وسلم پر اللہ تعالیٰ کا یہ قول نازل ہوا: **وَأَنَّ هَذَا صِرَاطِي مُسْتَقِيمًا** (اور یہ کہ یہی میرا سیدھا راستہ ہے)، تو رسول اللہ صلی اللہ علیہ وسلم نے زمین پر ایک خط کھینچا اور اس خط کے دائیں اور بائیں جانب کچھ خطوط کھینچے۔ پھر آپ نے اپنی انگلی اس (سیدھے) خط پر رکھی اور یہ آیت تلاوت فرمائی:\n**وَأَنَّ هَذَا صِرَاطِي مُسْتَقِيمًا فَاتَّبِعُوهُ وَلَا تَتَّبِعُوا السُّبُلَ**\n(اور یہ کہ یہی میرا سیدھا راستہ ہے، سو اس کی پیروی کرو، اور دوسرے راستوں کی پیروی نہ کرو)۔\nاور آپ نے ان خطوط کی طرف اشارہ کیا جو آپ نے دائیں اور بائیں کھینچے تھے:\n**فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ**\n(ورنہ وہ تمہیں اس کے راستے سے بھٹکا دیں گے)۔ اور آپ نے سیدھے خط کی طرف اشارہ کیا۔\n\nاور مجھے سلا شہر میں، جو مغرب میں بحر اوقیانوس کے کنارے پر واقع ہے اور جسے \"منقطع التراب\" (زمین کا اختتام) کہا جاتا ہے کیونکہ اس کے آگے کوئی زمین نہیں ہے، ایک بڑے نیک آدمی نے جو عام لوگوں میں سے تھے، خبر دی، انہوں نے کہا: میں نے خواب میں ایک روشن، ہموار اور آسان شاہراہ (محجۃ بیضاء) دیکھی جس پر نور تھا۔ اور میں نے اس شاہراہ کے دائیں اور بائیں جانب خندقیں، گھاٹیاں اور وادیاں دیکھیں جو سب کانٹوں سے بھری ہوئی تھیں، اور ان کی تنگی، راستوں کی دشواری، کانٹوں کی کثرت اور ان میں موجود اندھیرے کی وجہ سے ان میں داخل ہونا ممکن نہ تھا۔ اور میں نے دیکھا کہ تمام لوگ اندھوں کی طرح ان میں بھٹک رہے ہیں اور اس آسان اور روشن شاہراہ کو چھوڑ رہے ہیں۔ اور اس شاہراہ پر رسول اللہ صلی اللہ علیہ وسلم اور آپ کے ساتھ چند لوگ چل رہے تھے، اور آپ پیچھے والوں کو دیکھ رہے تھے۔ اور اگرچہ وہ جماعت پیچھے تھی لیکن وہ شاہراہ پر ہی تھی، ان میں شیخ ابو اسحاق ابراہیم بن قرقور محدث بھی تھے، جو حدیث میں ایک فاضل سردار تھے۔ میں ان کے بیٹے سے ملا تھا، وہ نبی صلی اللہ علیہ وسلم سے یہ سمجھتے تھے کہ آپ ان سے فرما رہے ہیں: لوگوں میں راستے کی طرف لوٹنے کا اعلان کرو۔ تو ابن قرقور اپنی آواز بلند کرتے اور اپنے اعلان میں کہتے، حالانکہ نہ کوئی بلانے والا تھا اور نہ کوئی بلایا جانے والا: راستے کی طرف آؤ! راستے کی طرف آؤ! انہوں نے کہا: مگر نہ کوئی انہیں جواب دیتا اور نہ کوئی راستے کی طرف لوٹتا۔\n\n### [جب نفسوں پر خواہشات غالب آ گئیں تو انہوں نے محجۃ البیضاء کو چھوڑ دیا]\n\nجان لیجیے کہ جب نفسوں پر خواہشات غالب آ گئیں اور علماء نے بادشاہوں کے ہاں مراتب طلب کیے، تو انہوں نے محجۃ البیضاء کو چھوڑ دیا اور دور کی تاویلات (تفسیریں) کی طرف مائل ہو گئے تاکہ وہ بادشاہوں کے ان اغراض کو پورا کر سکیں جن میں ان کی نفسانی خواہش شامل تھی، تاکہ وہ اس کے لیے شرعی امر کا سہارا لے سکیں۔ حالانکہ فقیہ خود شاید اس پر اعتقاد نہ رکھتا ہو اور پھر بھی اس کا فتویٰ دے دیتا ہو۔ ہم نے ان کے قاضیوں اور فقہاء میں سے ایک جماعت کو اس حال پر دیکھا ہے۔\n\nاور مجھے ملک الظاہر غازی بن الملک الناصر صلاح الدین یوسف بن ایوب نے خبر دی، جب میرے اور ان کے درمیان اس طرح کے معاملے میں بات ہوئی، تو انہوں نے ایک غلام کو آواز دی اور کہا: میرے لیے حرمدان (دوات) لاؤ۔ میں نے ان سے پوچھا: حرمدان کا کیا معاملہ ہے؟ انہوں نے کہا: آپ میرے ملک اور میری سلطنت میں ہونے والی برائیوں اور ظلم پر اعتراض کرتے ہیں، اور اللہ کی قسم! میں بھی وہی اعتقاد رکھتا ہوں جو آپ رکھتے ہیں کہ یہ سب منکر ہے، لیکن اللہ کی قسم، اے میرے آقا! ان میں سے کوئی منکر ایسا نہیں ہے\n\nمگر کسی فقیہ کے فتوے اور اس کے ہاتھ کی تحریر سے جو میرے پاس اس کے جواز کے لیے موجود ہے۔ پس ان پر اللہ کی لعنت ہو۔ اور ایک فقیہ نے مجھے فتویٰ دیا، اور انہوں نے اپنے ملک کے سب سے افضل، دیندار اور متقی فقیہ کا نام لیا، کہ مجھ پر یہی رمضان کا روزہ رکھنا واجب نہیں، بلکہ مجھ پر سال میں کوئی ایک مہینہ روزہ رکھنا واجب ہے، اور مجھے اختیار ہے کہ میں سال کے جس مہینے کو چاہوں منتخب کر لوں۔ سلطان نے کہا: میں نے اپنے باطن میں اسے لعنت کی، لیکن ظاہر نہیں کیا، اور وہ فلاں شخص تھا۔ انہوں نے مجھے اس کا نام بتایا۔ اللہ ان سب پر رحم فرمائے۔\n\nپس آپ کو معلوم ہونا چاہیے کہ شیطان کو اللہ نے حضرة الخيال (تخیل کی دنیا) پر قدرت دی ہے اور اسے وہاں سلطنت عطا کی ہے۔ پس جب وہ کسی فقیہ کو کسی ایسی خواہش کی طرف مائل دیکھتا ہے جسے وہ جانتا ہے کہ وہ اللہ کے نزدیک ہلاک کرنے والی ہے، تو وہ اس کے برے عمل کو ایک عجیب تاویل کے ذریعے مزین کر دیتا ہے، جس میں وہ اس کے لیے ایک ایسا پہلو ہموار کرتا ہے جو اس کی نظر میں اسے اچھا لگے، اور اسے کہتا ہے کہ پہلے زمانے کے لوگوں نے رائے (اجتہاد) کے ذریعے اللہ کی بندگی کی، اور علماء نے احکام میں قیاس کیا، اور چیزوں کی علتیں نکالیں اور انہیں جاری کیا، اور خاموش چھوڑے گئے مسائل میں وہی حکم لگایا جو منصوص مسائل میں لگایا گیا تھا، جامع علت کی وجہ سے، اور علت تو اس کا اپنا استنباط ہے۔\n\nپس جب شیطان اس کے لیے یہ راستہ ہموار کر دیتا ہے، تو وہ اپنے گمان میں شرعی پہلو سے اپنی خواہش اور شہوت کو پورا کرنے کی طرف مائل ہو جاتا ہے۔ اور وہ ہمیشہ ایسا ہی کرتا ہے ہر اس معاملے میں جس میں اس کی یا اس کے سلطان کی نفسانی خواہش شامل ہو۔ اور وہ احادیث نبویہ کو رد کرتا ہے اور کہتا ہے کہ اگر یہ حدیث صحیح بھی ہو، اور اگر صحیح ہو بھی، تو کہتا ہے کہ اگر اس کے مقابلے میں کوئی دوسری خبر نہ ہوتی جو اس کی معارض ہو اور اسے منسوخ کر دے، تو شافعی اس پر عمل کرتے (اگر وہ فقیہ شافعی ہو)، یا ابو حنیفہ اس پر عمل کرتے (اگر وہ حنفی ہو)۔ اور اسی طرح ان ائمہ کے پیروکاروں کے اقوال ہیں۔\n\nاور وہ سمجھتے ہیں کہ حدیث اور اس پر عمل کرنا گمراہی ہے، اور یہ کہ واجب ہے کہ ان ائمہ اور ان جیسے لوگوں کی تقلید کی جائے ان کے فیصلوں میں، خواہ ان کے اقوال احادیث نبویہ کے معارض ہی کیوں نہ ہوں۔ پس اولیٰ یہ ہے کہ ان کے اقوال کی طرف رجوع کیا جائے اور اخبار (احادیث)، کتاب اور سنت کو چھوڑ دیا جائے۔\n\nپس جب آپ ان سے کہیں کہ ہم نے شافعی رضی اللہ عنہ سے روایت کی ہے کہ انہوں نے فرمایا: جب تمہارے پاس کوئی حدیث آئے جو میرے قول کے معارض ہو، تو میرے قول کو دیوار پر مارو اور حدیث پر عمل کرو، کیونکہ میرا مذہب حدیث ہے۔ اور ہم نے ابو حنیفہ سے روایت کی ہے کہ انہوں نے اپنے اصحاب سے فرمایا: ہر اس شخص پر حرام ہے جو میرے کلام سے فتویٰ دے جب تک کہ وہ میری دلیل نہ جان لے۔\n\nاور ہم نے ابو حنیفہ سے یہ چیز حنفیوں کے ذریعے ہی روایت کی ہے، اور شافعی سے شافعیوں کے ذریعے ہی، اور اسی طرح مالکیہ اور حنابلہ سے۔ پس جب آپ انہیں بحث کے میدان میں تنگ کرتے ہیں تو وہ بھاگ جاتے ہیں اور خاموش ہو جاتے ہیں۔ اور یہ ہمارے ساتھ مغرب اور مشرق میں کئی بار ہو چکا ہے۔ پس ان میں سے کوئی بھی اس مذہب پر نہیں ہے جس پر ہونے کا وہ دعویٰ کرتا ہے۔\n\nپس شریعت خواہشات کے ذریعے منسوخ ہو چکی ہے، اگرچہ اخبار (احادیث) صحیح کتابوں میں لکھی ہوئی موجود ہیں، اور جرح و تعدیل کی تاریخ کی کتابیں موجود ہیں، اور اسانید محفوظ اور تبدیلی سے پاک ہیں۔ لیکن جب ان پر عمل کرنا چھوڑ دیا جائے اور لوگ رائے (اجتہاد) میں مشغول ہو جائیں اور صحیح احادیث کے معارض ہونے کے باوجود متقدمین کے فتووں سے اپنے آپ کو پابند کر لیں، تو ان کا نہ ہونا اور ہونا برابر ہے، کیونکہ ان کے نزدیک ان کا کوئی حکم باقی نہیں رہا۔ اور اس سے بڑی نسخ کیا ہو سکتی ہے؟\n\nاور جب آپ ان میں سے کسی سے اس بارے میں کچھ کہتے ہیں، تو وہ آپ سے کہتا ہے کہ یہ مذہب ہے۔ حالانکہ اللہ کی قسم! وہ جھوٹا ہے، کیونکہ صاحب مذہب نے اسے کہا تھا کہ اگر خبر میرے کلام کے معارض ہو تو حدیث پر عمل کرو اور میرے کلام کو کوڑے دان میں پھینک دو، کیونکہ میرا مذہب حدیث ہے۔ پس اگر وہ انصاف کرتا تو وہ شافعی کے مذہب پر ہوتا جو معارض حدیث کے لیے شافعی کے کلام کو چھوڑ دیتا ہے۔ اللہ سب کی رہنمائی فرمائے۔ اور جو کچھ ہم نے بیان کیا ہے، اس کے واضح ہونے کے بعد:\n\n### [بیشک جب انسان اپنی غرض سے بے رغبتی اختیار کرتا ہے تو ذات حق اس کے نفس کی صورت کے بدلے اسے ہدایت الٰہی کی صورت عطا فرماتا ہے]\n\nپس جان لیجیے کہ جب انسان اپنی غرض سے بے رغبتی اختیار کرتا ہے، اپنے نفس سے منہ موڑتا ہے اور اپنے رب کو ترجیح دیتا ہے، تو ذات حق (الحق) اس کے نفس کی صورت کے بدلے اسے ہدایت الٰہی کی ایک حقیقی صورت عطا فرماتا ہے جو حق کی طرف سے ہوتی ہے، یہاں تک کہ وہ نور کی چادروں میں ملبوس ہو جاتا ہے، اور یہ اس کے نبی کی شریعت اور اس کے رسول کا پیغام ہے۔ پس اس کا رب اس کی طرف وہ چیز القا کرتا ہے جس میں اس کی سعادت ہوتی ہے۔\n\nپس لوگوں میں سے کچھ اسے اپنے نبی کی صورت میں دیکھتے ہیں، اور کچھ اسے اپنے حال کی صورت میں دیکھتے ہیں۔ پس اگر وہ صورت اسے اپنے نبی کی صورت میں ظاہر ہو، تو اس کی فہم کا مرکز صرف وہی ہونا چاہیے جو وہ صورت اسے القا کرے، اور کچھ نہیں۔ کیونکہ شیطان کبھی بھی نبی کی صورت اختیار نہیں کر سکتا۔ پس وہ اس نبی کی حقیقت اور اس کی روح ہوتی ہے، یا اس کے جیسا کوئی فرشتہ ہوتا ہے جو اللہ کی طرف سے اس کی شریعت کا عالم ہوتا ہے۔ پس جو کچھ وہ اسے کہے، وہی حکم ہے۔\n\nاور ہم نے ایسی صورت سے شرعی احکام میں بہت سی چیزیں حاصل کی ہیں جنہیں ہم علماء یا کتابوں کے ذریعے نہیں جانتے تھے۔ پس جب میں نے ان شرعی احکام کو جو اس صورت نے مجھ سے مخاطب کیے تھے، اپنے ملک کے بعض علماء پر پیش کیا جو حدیث اور مذاہب دونوں کے جامع تھے، تو انہوں نے مجھے بتایا کہ وہ سب کچھ جو میں نے انہیں بتایا تھا، صحیح میں نبی صلی اللہ علیہ وسلم سے روایت ہوا ہے، اور انہوں نے ایک حرف بھی نہیں چھوڑا۔ اور وہ اس پر تعجب کرتے تھے۔ یہاں تک کہ ان میں سے ایک مسئلہ نماز میں ہر جھکنے اور اٹھنے پر ہاتھ اٹھانا تھا، اور ہمارے ملک کے لوگ مجموعی طور پر اس کے قائل نہیں ہیں، اور نہ ہی ہمارے ہاں کوئی ایسا کرنے والا ہے اور نہ میں نے اسے دیکھا ہے۔ پس جب میں نے اسے محمد بن علی بن الحاج پر پیش کیا، جو محدثین میں سے تھے، تو انہوں نے مجھے اس بارے میں رسول اللہ صلی اللہ علیہ وسلم سے ایک صحیح حدیث روایت کی جسے مسلم نے ذکر کیا ہے۔ اور میں نے بعد میں جب اخبار (احادیث) کا مطالعہ کیا تو صحیح مسلم میں اسے پایا۔ اور میں نے اس کے بعد دیکھا کہ اس میں مالک بن انس سے بھی روایت ہے جسے ابن وہب نے روایت کیا ہے، اور ابو عیسیٰ ترمذی نے اس حدیث کو ذکر کیا اور کہا کہ مالک اور شافعی بھی اسی کے قائل ہیں۔\n\nاور اسی طرح میرے نبی صلی اللہ علیہ وسلم کی صورت سے احکام مشروعہ حاصل کرنے کا معاملہ پیش آیا جن کا ہمیں علم نہیں تھا۔\n\nلیکن اگر وہ صورت رسول کی صورت کے علاوہ کسی اور صورت میں ظاہر ہو، تو وہ صورت لازمی طور پر اس کے حال کی طرف راجع ہوتی ہے، یا اس وقت اس جگہ پر شرع کے مقام کی طرف، جہاں اس نے اسے دیکھا، بالکل خواب کی طرح، سوائے اس کے کہ یہ شخص اسے بیداری میں دیکھتا ہے اور عام لوگ اسے نیند میں دیکھتے ہیں۔ پس جب وہ صورت اس طرح ظاہر ہو تو اس سے شرعی احکام میں سے کچھ بھی نہیں لیا جائے گا۔ اور جو کچھ بھی وہ علوم اور اسرار میں سے لائے، سوائے تحلیل (حلال کرنا) اور تحریم (حرام کرنا) کے، تو اسے اس سے حاصل کرنے میں کوئی رکاوٹ نہیں ہے، نہ عقائد میں اور نہ ہی کسی اور چیز میں۔\n\nکیونکہ حضرة الإلهية (الٰہی حضور) تمام عقائد کو قبول کرتی ہے، سوائے شرک کے، کیونکہ وہ اسے قبول نہیں کرتی۔ بیشک شریک عدم محض (محض نیستی) ہے، اور الوجود المطلق (مطلق ہستی) عدم کو قبول نہیں کرتا۔ اور شریک بلاشبہ اپنے شریک سے خارج ہوتا ہے، برخلاف اس کے جو اس کے بارے میں اعتقاد رکھا جاتا ہے جو موصوف خود اپنی ذات میں متصف ہوتا ہے۔ اسی لیے ہم نے کہا کہ وہ شریک کو قبول نہیں کرتا، کیونکہ وہاں کوئی شریک ہے ہی نہیں جسے قبول کیا جائے۔ اگرچہ اللہ تعالیٰ کے اس قول میں آیا ہے:\n**وَمَن يَدْعُ مَعَ اللَّهِ إِلَهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ**\n(اور جو شخص اللہ کے ساتھ کسی دوسرے معبود کو پکارے جس کے لیے اس کے پاس کوئی دلیل نہیں ہے)۔\n\nپس اس اشارے کو سمجھو، کیونکہ شبہ برہان (دلیل) کی صورت میں آتا ہے۔ پس یہ مقلدین کی مذمت ہے، نہ کہ اہل نظر کی، اگرچہ وہ خطا کر جائیں۔\n\n### [بیشک غرض عین ارادہ ہے]\n\nپھر جان لیجیے کہ غرض (الغرض) عین ارادہ (الإرادة) ہے، مگر یہ نفس کا ارادہ ہے جس میں عشق اور خواہش شامل ہوتی ہے۔ پس جب وہ ثابت ہو جاتی ہے تو اسے غرض کہا جاتا ہے، کیونکہ غرض وہ نشانہ ہے جسے تیر انداز مقابلے کے لیے نصب کرتے ہیں۔ اور چونکہ تیر اندازوں کے تیر اسی کا قصد کرتے ہیں اور وہ ثابت ہوتا ہے، زائل نہیں ہوتا، اس لیے اس طرح کے ارادے کو غرض کہا گیا، اس کے اس شخص کے نفس میں ثابت ہونے کی وجہ سے جس میں وہ قائم ہوتا ہے، تاکہ وہ اس چیز سے عشق کرے اور اس کے بارے میں لوگوں کے اقوال کے تیروں کی پرواہ نہ کرے۔\n\nاور یہ غرض خواہ محمود (قابل تعریف) ہو یا مذموم (قابل مذمت)۔ لیکن انہوں نے اس پر اتفاق کیا ہے کہ جب اسے غرض نفسی (نفسانی غرض) کہا جائے اور اسے نفس کی طرف منسوب کیا جائے تو وہ مذموم ہوتی ہے۔ اور جب یہ نسبت سے خالی ہو تو کبھی محمود ہو سکتی ہے اور کبھی مذموم۔\n\nاسی لیے حق تعالیٰ کو ارادہ سے متصف کیا گیا ہے، لیکن غرض سے متصف نہیں کیا گیا، کیونکہ غرض پر غالب طور پر مذمت کا تعلق ہوتا ہے، اور یہ ایک عَرَض ہے جو نفس کو لاحق ہوتا ہے۔ پس قضا و قدر (القضاء والقدر) نے اس کی حقیقت کو پوشیدہ کر دیا، اور اسے غرض کہا گیا اس لجاجت کی وجہ سے جو اسے نافذ کرنے میں اس کے صاحب میں قائم ہوتی ہے۔ اور یہ عین وہ علت ہے جس کی وجہ سے وہ فعل واقع ہوا یا ترک ہوا، اگر غرض اس کا ترک کرنا ہو۔ اور علت بیماری ہے، اور اغراض (خواہشات) نفوس کی بیماریاں ہیں۔\n\nہم نے اسے ایک ایسا امر اس لیے کہا جو نفس کو لاحق ہوتا ہے، کیونکہ نفس کو ارادہ اس لیے پیدا کیا گیا ہے تاکہ وہ اس کے ذریعے ان امور کا ارادہ کرے جنہیں اللہ نے اس سے کرنے کا ارادہ کیا ہے یا انہیں ترک کرنے کا، جیسا کہ شارع نے اس کے لیے حد مقرر کی ہے۔ پس اصل وہی ہے جو ہم نے ذکر کیا۔\n\nپس جب اس ارادے کو اس امر کے ساتھ ایک نفسانی عشق لاحق ہوا اور اس نے اس میں شرع کے حکم کی پرواہ نہ کی، خواہ وہ فعل ہو یا ترک، یہاں تک کہ اگر وہ شرعی امر اس کے نفاذ کے موافق بھی ہو جائے، تو وہ اس کے قصد سے نہیں ہوتا، بلکہ یہ اتفاق سے واقع ہوتا ہے کہ شارع نے اس کا حکم دیا ہے۔ پس اس صفت کا حامل شخص اسے اپنی غرض کے لیے کرتا ہے، نہ کہ شارع کے حکم کے لیے۔ اسی لیے اللہ اسے اس کے فعل پر تعریف نہیں کرتا، سوائے اس کے کہ وہ غرض کو نافذ کرنے سے پہلے سوال کرے کہ کیا شرع میں اس کے نفاذ کا کوئی ایسا حکم ہے جو قابل تعریف ہو؟ تو مفتی اسے فتویٰ دے کہ شارع نے اس میں اباحت (جائز ہونا)، یا ندب (مستحب ہونا)، یا وجوب (فرض ہونا) کا حکم دیا ہے۔ تب وہ اسے نافذ کرتا ہے، تو یہ شرعی حکم ہوتا ہے جو نفسانی خواہش کے موافق ہو گیا، تو وہ اس پر ماجور (اجر پانے والا) ہوتا ہے۔\n\nاور پہلا معاملہ ایسا نہیں ہے، کیونکہ پہلا نفسانی خواہش اور غرض ہے جو ایک محمود شرعی حکم کے موافق ہو گئی، لیکن اس نے اسے قربت (قرب الٰہی) کے طریقے پر شرع کے لیے نافذ نہیں کیا، تو وہ خسارے میں رہا۔\n\nپس اے میرے ولی! اپنی نفسانی اغراض میں غور کر جب وہ تجھے پیش آئیں کہ شرع میں ان کا کیا حکم ہے؟ پس اگر شرع تجھے فعل کا حکم دے تو اسے کر، یا ترک کا حکم دے تو اسے چھوڑ دے۔\n\nاگر سوال کرنے اور شرع کے حکم کو جاننے کے بعد بھی تجھ پر ترک کا حکم غالب آ جائے اور تو اسے ترک نہ کرے، لیکن یہ اعتقاد رکھے کہ تو اس میں خطا پر ہے، تو تو کئی وجوہ سے ماجور ہے: تیری تحقیق اور غرض کو نافذ کرنے سے پہلے شرع کے حکم کے بارے میں تیرے سوال کی وجہ سے؛ اور شرع میں تیرے پہلے اعتقاد کی وجہ سے، یہاں تک کہ تو نے اس امر میں اس کے حکم کے بارے میں سوال کیا؛ اور علم کے بعد تیرے اس اعتقاد کی وجہ سے کہ یہ حرام ہے اور اسے ترک کرنا واجب ہے؛ اور اللہ کے غفور و رحیم ہونے پر تیرے حسن ظن کی وجہ سے کہ وہ معاف کر دے گا اور درگزر کرے گا؛ اور اس وجہ سے کہ تو نے اللہ کی حرمت کو پامال کرنے کا قصد نہیں کیا؛ اور اس وجہ سے کہ تو اس امر کو نافذ کرنے میں اپنے بارے میں سابق قضا و قدر کا اعتقاد رکھتا ہے، جیسا کہ موسیٰ علیہ السلام کا آدم علیہ السلام کے ساتھ معاملہ تھا۔\n\nپس یہ بہت سی وجوہ ہیں جن کی بنا پر تو اپنی عین معصیت میں ماجور ہے، اور تو اس میں ایک ہی وجہ سے گنہگار ہے، اور وہ اس امر کا نفاذ ہے جو تیری نفسانی خواہش ہے۔ اور اگر ان وجوہ میں یہ بھی شامل ہو جائے کہ وہ امر تجھے برا لگے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n**المؤمن من سرته حسنته وساءته سيئته**\n(مومن وہ ہے جسے اس کی نیکی خوش کرے اور اس کی برائی اسے غمگین کرے)۔\n\nتو کیا ہی خوب! کیا ہی خوب!\n\nاور یہ سب کچھ اللہ نے مومن کے لیے شیطان کو ذلیل کرنے کے لیے رکھا ہے جو انسان کے برے عمل کو مزین کرتا ہے۔ بیشک شیطان فحشاء (برائی) کا حکم دیتا ہے۔ پس اللہ نے مغفرت کا وعدہ کیا ہے، اور وہ پردہ پوشی ہے جسے اللہ گناہگار مومن اور اس کفر کے درمیان رکھتا ہے جو گناہ کے وقت اسے ہلاک کر سکتا ہے۔ پس وہ اعتقاد رکھتا ہے کہ یہ گناہ ہے اور اللہ کی حرام کردہ چیز کو حلال نہیں کرتا، اور یہ اس پردہ پوشی کی برکت سے ہے۔\n\nپھر ایک اور مغفرت ہے، اور وہ دو پردوں کے پیچھے ایک پردہ ہے۔ ایک پردہ دنیا میں اس پر ڈالا گیا کہ اس گناہ میں اس پر اللہ کی مقرر کردہ حد نافذ نہیں کی گئی، اور اگر آخرت میں اس پر پردہ ڈالا گیا تو اسے اس پر سزا نہیں دی جائے گی۔\n\nپس پہلا پردہ اسی وقت متحقق ہے، اللہ تعالیٰ فرماتا ہے:\n**وَاللَّهُ يَعِدُكُم مَّغْفِرَةً مِّنْهُ وَفَضْلًا**\n(اور اللہ تم سے اپنی طرف سے مغفرت اور فضل کا وعدہ کرتا ہے)۔\n\nپس یہ مغفرت شیطان کے فحشاء کے حکم کے مقابلے میں ہے، اور فضل اس کے فقر کے وعدے کے مقابلے میں ہے، جیسا کہ اللہ تعالیٰ کے قول میں ہے:\n**الشَّيْطَانُ يَعِدُكُمُ الْفَقْرَ وَيَأْمُرُكُم بِالْفَحْشَاءِ**\n(شیطان تمہیں فقر کا وعدہ دیتا ہے اور تمہیں فحشاء کا حکم دیتا ہے)۔\n\nپس اللہ نے مومن کو راحت دی، جہاں ذات حق سبحانہ نے خود اس چیز کے دفاع کی ذمہ داری لی جسے شیطان مومن میں نافذ کرنا چاہتا تھا۔ پس اللہ نے اپنے مومن بندے سے ایک الٰہی وعدے کے ذریعے ایک شیطانی وعدے کو دور کر دیا۔ اور اللہ کا مقابلہ نہیں کیا جا سکتا اور نہ ہی اس پر غلبہ پایا جا سکتا۔ پس مغفرت متحقق ہے اور فضل متحقق ہے، اور شیطان کھلے خسارے کے ساتھ لوٹا۔\n\nاور اسی حقیقت کی وجہ سے اللہ نے ہمیں حکم دیا کہ ہم اسے اپنے معاملات میں وکیل (کارساز) بنائیں، تاکہ حق تعالیٰ خود مومنوں سے ان امور کے نقصانات کو دور کرنے کی ذمہ داری لے۔ اور شیطان کا مقصد صرف گناہ نہیں ہے، بلکہ اس کا مقصد یہ ہے کہ بندہ شیطان کی اطاعت کا عادی ہو جائے تاکہ وہ اسے تدریجاً شرک کی طرف لے جائے جس میں ابدی بدبختی ہے۔ اور یہ اس وقت تک نہیں ہو سکتا جب تک کہ بندے اور شرک کے درمیان حائل عصمت کا پردہ (الستر الاعتصامي) اٹھا نہ دیا جائے۔ اور اللہ تعالیٰ **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و هجدهم: در معرفت منزل نسخ شریعت محمدیه و غیر محمدیه به واسطه اغراض نفسانی (الأغراض النفسية)؛ خداوند ما و شما را به فضل خود از آن عافیت بخشد.\n\nاگر من از نفس خود جدا شوم،\nهمانندش در زیبایی، از غیر بشر، برایم برپا می‌شود.\n\nذاتی است دارای حُسن و بها و فروغ (سنا)،\nکه به دلیل شرع، هیچ شری در آن نیست.\n\nپس در آن فروغ (سنا) همچون خورشید بود،\nو در آن اثر، همچون شهد بود.\n\nهر که بچه شیر را در کنارش ببیند،\nشیری که دندان‌هایش را از دهان بیرون کشیده است،\n\nاز روی ترس بر بچه‌هایش،\nدر جستجوی هر خیانتکار و بدکاری است.\n\nدر راه رضایت او،\nصبرِ صبر را شیرین می‌یابد و تلخی را گوارا می‌شمارد.\n\nپس با کلام نیکو ترجمه کن،\nمبادا از کسانی باشی که بیهوده سخن می‌گویند و سپس دروغ می‌بافند.\n\nبندگان، حق (الحق) را نمی‌بینند، مگر آنکه\nمعنا را از حرف منتشر سازند.\n\nپس چون آن را ببیند، به آن قیام کند،\nو کائنات را فقیر ببیند و منتشر سازد.\n\nرحمت خدا بر عالم او باد،\nو خلق را به سوی او خواند و محشور ساخت.\n\n### [همانا خداوند آبروی مسلمانان را حرام کرده است]\n\nای دوست صمیمی، بدان که ما در این باب از عبدالله بن عباس رضی الله عنهما روایت کرده‌ایم که مردی به آبروی او دست درازی کرده بود و نزد او آمد تا از این بابت حلالیت بطلبد. به او گفت: ای ابن عباس، من به تو بدی رسانده‌ام، مرا حلال کن. ابن عباس گفت: پناه می‌برم به خدا از اینکه چیزی را که خدا حرام کرده است، حلال کنم. همانا خداوند آبروی مسلمانان را حرام کرده است، پس من آن را حلال نمی‌کنم، اما خداوند تو را بیامرزد. بنگر که این تصریف چقدر شگفت‌انگیز است و این علم چقدر نیکوست.\n\nاز همین باب است سوگند خوردن انسان بر کاری که انجام دادنش برای او مباح است، مبنی بر اینکه آن را انجام ندهد یا انجام دهد. پس خداوند کفاره قسم (تحلة الايمان) را واجب کرد، و این از باب استدراج و مکر الهی است، مگر برای کسی که خداوند او را با آگاه ساختن معصوم بدارد. زیرا در آنجا شارعی جز خدای تعالی نیست. خداوند متعال به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «لِتَحْكُمَ بَيْنَ النَّاسِ بِما أَراكَ الله» (تا میان مردم به آنچه خداوند به تو نشان داده حکم کنی). و نفرمود: «به آنچه خودت دیدی». بلکه خداوند سبحان او را مورد عتاب قرار داد، هنگامی که در قضیه عایشه و حفصه چیزی را با سوگند بر خود حرام کرد و فرمود: «يا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ ما أَحَلَّ الله لَكَ تَبْتَغِي مَرْضاتَ أَزْواجِكَ» (ای پیامبر، چرا چیزی را که خداوند بر تو حلال کرده، به خاطر جلب رضایت همسرانت بر خود حرام می‌کنی؟). این از چیزهایی بود که نفسش به او نشان داده بود.\n\nاین امر به تو نشان می‌دهد که منظور از قول خداوند متعال «بِما أَراكَ الله» (به آنچه خداوند به تو نشان داده) همان چیزی است که به او وحی می‌شود، نه آنچه در رأی خود می‌بیند. اگر دین بر اساس رأی بود، رأی پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) از رأی هر صاحب رأیی سزاوارتر بود. حال که حال پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در آنچه نفسش به او نشان داده چنین است، پس رأی کسی که معصوم نیست و خطا به او نزدیک‌تر از صواب است، چگونه خواهد بود؟\n\nپس این دلالت می‌کند که اجتهادی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) ذکر کرده است، تنها طلب دلیل برای تعیین حکم در مسئله‌ای است که واقع شده، نه تشریع حکمی جدید در آن واقعه. زیرا این تشریع، اذن الهی ندارد.\n\nقاضی عبدالوهاب ازدی اسکندری در مکه در سال پانصد و نود و نه به من خبر داد و گفت: مردی از صالحان را پس از مرگش در خواب دیدم. از او پرسیدم چه دیدی؟ او چیزهایی را ذکر کرد و گفت: کتاب‌هایی را دیدم که کنار گذاشته شده بودند (موضوعة) و کتاب‌هایی را دیدم که بالا برده شده بودند (مرفوعة). پرسیدم این کتاب‌های بالا برده شده چیست؟ گفته شد: اینها کتاب‌های حدیث هستند. گفتم: و این کتاب‌های کنار گذاشته شده چیست؟ گفته شد: اینها کتاب‌های رأی هستند تا صاحبانشان درباره آنها مورد سؤال قرار گیرند. دیدم که امر در آن سخت است.\n\n### [اینکه شریعت همان راه روشن (المحجة البيضاء)، راه سعادتمندان است]\n\nبدان، خداوند تو را توفیق دهد، که شریعت همان راه روشن (المحجة البيضاء)، راه سعادتمندان و طریق خوشبختی است. هر کس بر آن گام نهد، نجات یابد و هر کس آن را ترک کند، هلاک شود.\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) هنگامی که این قول خداوند متعال بر او نازل شد: «وأَنَّ هذا صِراطِي مُسْتَقِيماً» (و همانا این راه مستقیم من است)، خطی بر زمین کشید و خطوطی را در دو طرف آن خط، راست و چپ، کشید. سپس انگشت خود را بر خط مستقیم گذاشت و این آیه را تلاوت کرد: «وأَنَّ هذا صِراطِي مُسْتَقِيماً فَاتَّبِعُوهُ ولا تَتَّبِعُوا السُّبُلَ» (و همانا این راه مستقیم من است، پس از آن پیروی کنید و از راه‌های دیگر پیروی نکنید). و به آن خطوطی که در سمت راست و چپ خط مستقیم کشیده بود، اشاره کرد و فرمود: «فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ» (که شما را از راه او پراکنده می‌سازد). و به خط مستقیم اشاره کرد.\n\nمردی از صالحان بزرگ از عامه مردم، در شهر سلا (شهری در مغرب بر ساحل اقیانوس که به آن «منقطع التراب» می‌گویند و پشت آن زمینی نیست) به من خبر داد و گفت: در خواب راهی روشن (محجة بيضاء)، هموار و نورانی دیدم که آسان بود. و در سمت راست و چپ آن راه، خندق‌ها، دره‌ها و رودهایی دیدم که همگی خارزار بودند و به دلیل تنگی، ناهمواری مسیرها، فراوانی خار و تاریکی موجود در آنها، قابل عبور نبودند. و دیدم که همه مردم کورکورانه در آن خندق‌ها سرگردانند و راه روشن و آسان را رها کرده‌اند. و بر آن راه روشن، رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) و عده‌ای اندک همراه او در حرکت بودند. او به پشت سر خود نگاه می‌کرد و در میان آن جماعت، شیخ ابواسحاق ابراهیم بن قرقور محدث را دیدم که عقب‌تر از پیامبر بود اما بر همان راه قرار داشت. او سیدی فاضل در حدیث بود. من با پسرش ملاقات کردم. او از پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) می‌فهمید که به او می‌گوید: در میان مردم ندا کن که به راه بازگردند. پس ابن قرقور صدای خود را بلند می‌کرد و در ندای خود می‌گفت، در حالی که نه دعوت‌کننده‌ای بود و نه دعوت‌شونده‌ای: «بیایید به راه، بیایید!» گفت: اما هیچ کس به او پاسخ نمی‌داد و هیچ کس به راه بازنمی‌گشت.\n\n### [چون هواهای نفسانی بر نفوس غلبه کرد، راه روشن را ترک کردند]\n\nبدان که چون هواهای نفسانی (الأهواء) بر نفوس غلبه کرد و علما در پی کسب مقام نزد پادشاهان برآمدند، راه روشن (المحجة البيضاء) را ترک کردند و به تأویلات دور از ذهن روی آوردند تا اغراض پادشاهان را در آنچه هوای نفس داشتند، پیش ببرند و در این کار به امری شرعی استناد کنند، در حالی که چه بسا خود فقیه آن را باور نداشت اما بر اساس آن فتوا می‌داد. ما گروهی از قضات و فقهای آنها را بر این حال دیده‌ایم.\n\nملک الظاهر غازی، پسر ملک الناصر صلاح الدین یوسف بن ایوب، به من خبر داد. در مورد چنین مسائلی بین من و او سخنی در گرفت. او مملوکی را صدا زد و گفت: «حرمدان (جعبه مخصوص نگهداری اسناد) را برایم بیاور.» به او گفتم: «حرمدان چه ربطی دارد؟» گفت: «تو بر منکراتی که در کشور و قلمرو من رخ می‌دهد، خرده می‌گیری. به خدا سوگند، من نیز همان اعتقادی را دارم که تو داری، مبنی بر اینکه همه اینها منکر است. اما به خدا سوگند، ای سرورم، هیچ منکری از اینها نیست، مگر با فتوای فقیهی و خط دست او که نزد من است و جواز آن را داده است. لعنت خدا بر آنان باد.»\n\nو به راستی فقیهی به من فتوا داد – و او بهترین فقیه متقی در کشورش بود – که روزه ماه رمضان بر من واجب نیست، بلکه واجب بر من یک ماه در سال است و اختیار دارم هر ماهی از سال را که بخواهم انتخاب کنم. سلطان گفت: «من در باطن خود او را لعنت کردم و آن را آشکار نساختم.» و او فلان شخص بود و نامش را برایم برد. خداوند همه آنها را رحمت کند.\n\nپس بدان که شیطان را خداوند بر ساحت خیال (حضرة الخيال) مسلط کرده و برای او در آنجا سلطانی قرار داده است. هنگامی که می‌بیند فقیه به هوایی متمایل است که می‌داند نزد خدا او را به هلاکت می‌اندازد، عمل بد او را با تأویلی غریب برایش زینت می‌دهد و راهی را برایش هموار می‌سازد که آن را در نظرش نیکو جلوه دهد و به او می‌گوید: «پیشینیان (الصدر الأول) با رأی، خدا را عبادت کردند و علما در احکام قیاس کردند و برای امور، علت‌ها استنباط کردند و آنها را تعمیم دادند و در مورد مسکوت‌عنه (آنچه حکمش ذکر نشده) همان حکمی را دادند که در مورد منصوص‌علیه (آنچه حکمش ذکر شده) داده بودند، به دلیل علت مشترک بین آنها، و علت نیز از استنباط خود اوست.»\n\nپس چون این راه را برایش هموار ساخت، به بهانه شرعی در گمان خود، به سوی نیل به هوای نفس و شهوتش متمایل می‌شود. و پیوسته کار او در هر آنچه خود یا سلطانش در آن هوای نفس دارد، چنین است. او احادیث نبوی را رد می‌کند و می‌گوید: «اگر این حدیث صحیح باشد، و اگر صحیح هم باشد، می‌گوید: اگر خبر دیگری که با آن معارضه کند و ناسخ آن باشد، وجود نداشت، شافعی به آن عمل می‌کرد.» اگر این فقیه شافعی باشد، یا می‌گوید: «ابوحنیفه به آن عمل می‌کرد.» اگر حنفی باشد. و همین‌طور اقوال پیروان این ائمه همگی چنین است.\n\nآنان بر این باورند که حدیث و عمل به آن گمراهی است و واجب، تقلید از این ائمه و امثال آنها در احکامی است که صادر کرده‌اند، حتی اگر اقوالشان با اخبار نبوی معارضه داشته باشد. پس رجوع به اقوال آنان و ترک عمل به اخبار، کتاب و سنت، اولی است.\n\nاگر به آنها بگویی: «ما از شافعی (رضی الله عنه) روایت کرده‌ایم که فرمود: هرگاه حدیثی به شما رسید که با قول من معارضه داشت، قول مرا به دیوار بزنید و به حدیث عمل کنید، زیرا مذهب من حدیث است.» و از ابوحنیفه روایت کرده‌ایم که به اصحابش فرمود: «حرام است بر هر کس که به کلام من فتوا دهد، مگر آنکه دلیل مرا بداند.» و ما هیچ یک از اینها را از ابوحنیفه روایت نکرده‌ایم مگر از طریق حنفیان، و نه از شافعی مگر از طریق شافعیان، و همچنین مالکیان و حنبلیان.\n\nپس چون در میدان سخن بر آنان تنگ بگیری، فرار می‌کنند و سکوت می‌نمایند. این امر بارها برای ما در مغرب و مشرق با آنان رخ داده است. هیچ یک از آنان بر مذهب کسی که ادعا می‌کند پیرو اوست، نیست. پس شریعت به واسطه هواهای نفسانی نسخ شده است، هرچند که اخبار موجود و در کتب صحیح و کتب تاریخ با جرح و تعدیل موجود و اسانید محفوظ و مصون از تغییر و تبدیل هستند. اما چون عمل به آنها ترک شود و مردم به رأی مشغول شوند و خود را با فتاوای متقدمین، با وجود معارضه اخبار صحیح با آنها، متدین سازند، فرقی بین عدم و وجود آنها نیست، زیرا دیگر حکمی نزد آنان ندارد. و چه نسخ (ابطالی) بزرگ‌تر از این؟\n\nو اگر در این باره به یکی از آنان چیزی بگویی، به تو می‌گوید: «این مذهب است.» و به خدا سوگند که او دروغ می‌گوید، زیرا صاحب مذهب به او گفته است: «اگر خبر با کلام من معارضه داشت، حدیث را بگیر و کلام مرا در زباله‌دان رها کن، زیرا مذهب من حدیث است.» اگر او انصاف داشت، بر مذهب شافعی بود که کلام شافعی را به خاطر حدیث معارض ترک می‌کرد. خداوند دست همگان را بگیرد. و پس از آنکه آنچه را مقرر کردیم روشن شد:\n\n### [اینکه انسان هرگاه از غرض خود زهد ورزد، حق (الحق) به جای صورت نفس او، صورت هدایت الهی را برایش برپا می‌دارد]\n\nپس بدان که انسان هرگاه از غرض خود زهد ورزد و از نفس خود روی گرداند و پروردگارش را برگزیند، حق (الحق) به جای صورت نفس او، صورت هدایت الهی را که حقیقتی از جانب حق است، برایش برپا می‌دارد تا در جامه‌های نور که همان شریعت پیامبر و رسالت رسول اوست، غرق شود. پس پروردگارش چیزی را به او القا می‌کند که سعادتش در آن است.\n\nبرخی از مردم آن را به صورت پیامبرشان می‌بینند و برخی به صورت حال خود. اگر این هدایت در صورت پیامبر بر او تجلی کرد، باید تمام فهم او متوجه چیزی باشد که آن صورت به او القا می‌کند و نه چیز دیگر، زیرا شیطان هرگز به صورت پیامبر در نمی‌آید. پس آن صورت، حقیقت و روح آن پیامبر است، یا صورت فرشته‌ای مانند او که از جانب خدا به شریعت او عالم است. پس هر چه به او بگوید، همان است.\n\nما از چنین صورتی امور بسیاری از احکام شرعی را دریافت کرده‌ایم که از طریق علما و کتب نمی‌دانستیم. هنگامی که آنچه را آن صورت از احکام شرعی به من خطاب کرده بود، بر برخی از علمای دیارمان که جامع حدیث و مذاهب بودند، عرضه کردم، او به من خبر داد که تمام آنچه را به او گفته بودم، در صحیح از پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) روایت شده است و حتی یک حرف را جا نینداخت. او از این امر تعجب می‌کرد. از جمله آن احکام، بالا بردن دست‌ها در نماز در هر پایین رفتن و بالا آمدن بود. اهل دیار ما به طور کلی به این حکم قائل نیستند و کسی را ندیدم که این کار را انجام دهد. هنگامی که آن را بر محمد بن علی بن الحاج که از محدثین بود عرضه کردم، او حدیث صحیحی از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در این باره برایم روایت کرد که مسلم آن را ذکر کرده است. پس از آن، هنگامی که اخبار را مطالعه کردم، در صحیح مسلم آن را یافتم. و پس از آن دیدم که در آن روایتی از مالک بن انس وجود دارد که ابن وهب آن را روایت کرده است. و ابوعیسی ترمذی این حدیث را ذکر کرده و گفته است که مالک و شافعی نیز به آن قائل هستند.\n\nهمچنین برای من در گرفتن احکام مشروعی که از آنها آگاهی نداشتیم، از صورت پیامبرم (صَلَّى اللهُ عَليهِ وسَلَّم) چنین اتفاقی افتاد.\n\nاما اگر آن هدایت بر صورتی غیر از صورت رسول بر او ظاهر شد، آن صورت ناگزیر به حال او باز می‌گردد، یا به منزلت شرع در آن زمان و در آن مکانی که آن را دیده است، مانند رؤیا. با این تفاوت که این شخص آن را در بیداری می‌بیند و عامه مردم آن را در خواب می‌بینند. پس نباید از آن صورت، اگر به این شکل تجلی کرد، هیچ یک از احکام مشروع را بگیرد. اما هر آنچه از علوم و اسرار به دست آورد، به جز تحلیل و تحریم، در گرفتن آن هیچ منعی نیست، نه در عقاید و نه در غیر آن.\n\nزیرا حضرت الهی (الحضرة الإلهية) همه عقاید را می‌پذیرد، مگر شرک را، زیرا آن را نمی‌پذیرد. چرا که شریک، عدم محض است و وجود مطلق (الوجود المطلق) عدم را نمی‌پذیرد. و شکی نیست که شریک از شریک خود خارج است، برخلاف آنچه در مورد موصوف در ذات خود اعتقاد می‌شود و به آن متصف می‌گردد. به همین دلیل گفتیم شریک را نمی‌پذیرد، زیرا شریکی وجود ندارد که پذیرفته شود، هرچند در قول خداوند متعال آمده است: «ومن يَدْعُ مَعَ الله إِلهاً آخَرَ لا بُرْهانَ لَهُ به» (و هر کس با خدا معبود دیگری را بخواند که هیچ برهانی بر آن ندارد). پس این اشاره را بفهم، زیرا شبهه در صورت برهان می‌آید. این نکوهش برای مقلدان است، نه برای صاحبان نظر، حتی اگر خطا کنند.\n\n### [اینکه غرض (الغرض) عین اراده است]\n\nسپس بدان که غرض (الغرض) عین اراده (الإرادة) است، جز اینکه اراده‌ای است برای نفس که با آن عشق و هوای نفس دارد. پس ثابت شد و غرض نامیده شد. زیرا غرض همان نشانه‌ای است که تیراندازان برای مسابقه نصب می‌کنند. و چون تیرها از سوی تیراندازان آن را قصد می‌کنند و آن ثابت است و زایل نمی‌شود، اراده‌ای که به این شکل ثابت است، غرض نامیده شد، به دلیل ثبوتش در نفس کسی که آن در او قائم شده تا به آن امر عشق ورزد و از تیرهای اقوال مردم در مورد آن باکی نداشته باشد.\n\nو فرقی نمی‌کند که آن غرض ستوده باشد یا نکوهیده. اما آنان اصطلاح کرده‌اند که هرگاه گفته شود «غرض نفسانی» و به نفس نسبت داده شود، نکوهیده باشد. و اگر از این نسبت عاری باشد، ممکن است ستوده یا نکوهیده باشد. به همین دلیل، حق (الحق) به اراده (إرادة) توصیف شده است، اما به غرض (غرض) متصف نشده است، زیرا غرض غالباً با تعلق نکوهش همراه است و عَرَضی است که برای نفس پیش می‌آید. پس قضا و قدر آن را کور کرد و به دلیل آنچه ذکر کردیم، غرض نامیده شد، به خاطر اصرار صاحبش بر اجرای آن. و آن عین علتی است که به خاطر آن، وقوع آن فعل یا ترک آن (اگر غرض، ترک آن باشد) صورت گرفته است. و علت، بیماری است و اغراض، بیماری‌های نفوس هستند.\n\nما گفتیم که غرض امری است که برای نفس پیش می‌آید، زیرا اراده برای نفس خلق شده است تا به وسیله آن، آنچه را خداوند خواسته است از امور انجام دهد یا ترک کند، بر اساس آنچه شارع برایش تعیین کرده است. پس اصل همان است که ذکر کردیم.\n\nاما هنگامی که به این اراده، عشق نفسانی به آن امر عارض شد و از حکم شرع در انجام یا ترک آن باکی نداشت، حتی اگر آن امر شرعی با اجرای آن موافق بود، این موافقت از روی قصد شرعی نبود، بلکه به طور اتفاقی رخ داد که شارع به آن امر کرده است. پس صاحب این صفت آن را به خاطر غرض خود انجام داد، نه به خاطر حکم شارع. به همین دلیل، خداوند او را بر فعلش ستایش نمی‌کند، مگر اینکه پیش از اجرای غرض سؤال کند که آیا شرع در اجرای آن حکمی دارد که ستوده باشد؟ و مفتی به او فتوا دهد که شارع در آن به اباحه، یا ندب، یا وجوب حکم کرده است. در این صورت، او آن را اجرا می‌کند و این حکم شرعی خواهد بود که با هوای نفس موافق شده است و در نتیجه مأجور خواهد بود.\n\nاما حالت اول چنین نیست، زیرا حالت اول هوای نفس و غرضی است که با حکم شرعی ستوده موافق شده، اما او آن را به خاطر شرع و به طریق قربت انجام نداده است، پس زیانکار شده است.\n\nپس ای دوست من، در اغراض نفسانی خود بنگر، هنگامی که برایت پیش می‌آید، حکم آنها در شرع چیست؟ اگر شرع بر تو حکم به فعل کرد، آن را انجام ده، و اگر به ترک حکم کرد، آن را ترک کن.\n\nاگر پس از سؤال و دانستن حکم شرع، هوای نفس بر تو غلبه کرد و آن را ترک نکردی، اما اعتقاد داشتی که در این کار خطا کرده‌ای، تو از جهات بسیاری مأجور هستی: از جهت جستجو و سؤال از حکم شرع پیش از اجرای آن، و از جهت اعتقاد اولیه‌ات به شرع که باعث شد از حکم آن امر سؤال کنی، و از جهت اعتقادت پس از علم به اینکه آن حرام است و باید ترک شود، و از جهت استناد به اینکه خداوند آمرزنده و مهربان است و با حسن ظن به خدا عفو و گذشت می‌کند، و از جهت اینکه قصد هتک حرمت خدا را نداشتی، و از جهت اعتقاد به قضا و قدر سابق در مورد خودت مبنی بر اجرای این امر، مانند مسئله موسی با آدم (علیهما السلام).\n\nاینها جهات بسیاری است که تو از جهت آنها در عین معصیتت مأجور هستی، و از یک جهت در آن گناهکار هستی، و آن همان اجرای آن امری است که هوای نفس توست. و اگر بر آن جهات اضافه شود که آن امر تو را ناراحت می‌کند، چنانکه رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «المؤمن من سرته حسنته وساءته سيئته» (مؤمن کسی است که کار نیکش او را شاد کند و کار بدش او را اندوهگین سازد).\n\nپس آفرین بر آفرین! و خداوند همه اینها را برای مؤمن قرار داده است تا شیطان را که عمل بد انسان را برایش زینت می‌دهد، خوار سازد. زیرا شیطان به فحشا امر می‌کند. پس خداوند وعده مغفرت (آمرزش) داده است، و آن همان پرده‌ای (ستر) است که خداوند بین مؤمن گناهکار و کفر که او را به هلاکت می‌اندازد، قرار می‌دهد. پس مؤمن هنگام وقوع معصیت، اعتقاد دارد که آن معصیت است و آنچه را خدا حرام کرده، حلال نمی‌شمارد. و این از برکت آن پرده است.\n\nسپس مغفرت دیگری نیز هست، و آن پرده‌ای است پشت دو پرده: پرده‌ای که در دنیا بر او کشیده شده و حد شرعی آن معصیت بر او اجرا نشده است، و پرده‌ای که در آخرت بر او کشیده می‌شود و به خاطر آن مجازات نمی‌شود. پرده اول در همین زمان محقق است. خداوند متعال می‌فرماید: «والله يَعِدُكُمْ مَغْفِرَةً مِنْهُ وفَضْلًا» (و خداوند به شما وعده آمرزش از جانب خود و فضل می‌دهد). این مغفرت برای مقابله با امر شیطان به فحشا است، و فضل برای مقابله با وعده شیطان به فقر است، در آنجا که می‌فرماید: «الشَّيْطانُ يَعِدُكُمُ الْفَقْرَ ويَأْمُرُكُمْ بِالْفَحْشاءِ» (شیطان به شما وعده فقر می‌دهد و شما را به فحشا امر می‌کند).\n\nپس خداوند مؤمن را آسوده ساخت، زیرا حق سبحانه خود دفاع از آنچه شیطان می‌خواست در مؤمن اجرا کند، بر عهده گرفت. پس خداوند با وعده‌ای الهی، وعده‌ای شیطانی را از بنده مؤمن خود دفع کرد. و خداوند مقاومت‌ناپذیر و مغلوب‌نشدنی است. پس مغفرت محقق است و فضل محقق است و شیطان با زیان آشکار بازگشت.\n\nبه خاطر همین حقیقت، خداوند به ما امر کرده است که او را در امورمان وکیل بگیریم. پس حق (الحق) خود متولی دفع مضرات این امور از مؤمنان می‌شود. و غرض شیطان، خود معصیت نیست، بلکه غرض او این است که بنده به اطاعت شیطان عادت کند تا او را به تدریج به شرک بکشاند که در آن شقاوت ابدی است. و این جز با برداشته شدن پرده عصمت (الستر الاعتصامي) که حائل بین بنده و شرک است، رخ نمی‌دهد. و خداوند متعال «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 5
}