{
  "id": 288,
  "title": {
    "ar": "الباب الثامن والثمانون ومائتان في معرفة منزل التلاوة الأولى من الحضرة الموسوية",
    "en": "Chapter Two Hundred and Eighty-Eight: Concerning the Gnosis of the Station (منزل) of the First Recitation from the Mosaic Presence (الحضرة الموسوية).",
    "ur": "باب دو سو اٹھاسی: موسوی حضور (الحضرة الموسوية) سے پہلی تلاوت (التلاوة الأولى) کے منزل کی معرفت میں",
    "fa": "باب دویست و هشتاد و هشتم در معرفت منزل تلاوت اولی از حضرت موسوی."
  },
  "content": {
    "ar": "## «الباب الثامن والثمانون ومائتان في معرفة منزل التلاوة الأولى من الحضرة الموسوية»\n\n\n> كن للاله كبسم الله للبشر *** من اسمه الرب رب الروح والصور\n\n\n> فالخلق والأمر والتكوين أجمعه *** له فلا فرق بين العقل والحجر\n\n\n> كالزاهد المتعالي في غناه به *** فلا يميز بين العين والمدر\n\n\n> والعارف المتعالي في نزاهته *** له التميز بين العين والبصر\n\n\n> إذ الرجوع إلى التحقيق شيمة من *** يرى المنازل في الأعلام والسور\n\n\n### [أول ما أمر الله به عبده الأدب‏]\n\n\nأول ما أمر الله به عبده الجمع وهو الأدب وهو مشتق من المأدبة وهو الاجتماع على الطعام كذلك الأدب عبارة عن جماع الخير كله‏\n\n\nقال صلى الله عليه وسلم إن الله أدبني أي جمع في جميع الخيرات لأنه قال فحسن أدبي‏\n\n\nأي جعلني محلا لكل حسن فقيل للإنسان اجمع الخيرات فإن الله جعل في الدنيا عبده عاملا جابيا يجبي له سبحانه جميع ما رسم له فهو في الدنيا يجمع ذلك فما خلقه الله إلا للجمع فإن جمع ما أمر بجمعه وجباه كان سعيدا ووهبه الحق جميع ما جباه وأنعم عليه فكانت أجرته عين ما جمعه مع الثناء الإلهي الحسن عليه بالأمانة والعدل وعدم الظلم والخيانة وإن كان عبد سوء خان في أمانته فأعطاها غير أهلها وجمع ما لم يؤمر بجمعه مما نهي عنه إن يدخل فيه نفسه وترك جمع ما أمر بجمعه فلما انقلب إلى سيده وحصل في ديوان المحاسبة وقعد أهل الديوان يحاسبونه ورأى شدة الهول في حسابه وحساب غيره ورأى الأمناء الذين جبوا على حد ما رسم لهم قد سعدوا وآمنوا كثر عليه الغم والحزن فمنهم من عفي عنه وخلى سبيله لشفاعة شافع ومنهم من لم يكن له شفيع فعذب وعصر فمن عرف ما خلق له وعمل عليه استراح راحة الأبد مع أنه في نفسه في زمان جبايته على حذر وخطر وإن كان هذا فأحسن ما جمعه الإنسان في حياته العلم بالله والتخلق بأسمائه والوقوف عند ما تقتضيه عبوديته وأن يوفي ما تستحقه مرتبة سيده من امتثال أوامره ومنزل هذا الأمر من الأسماء الإلهية الاسم الرب وقد نعت الله سبحانه هذا الاسم بالعظمة والكرم والعلو في مواضع من كتابه العزيز وذكر ما جعل تحت حكمه وبيده من الأمور وجعل للباء في هذا المنزل سلطانا عظيما حيث جعلها واسطة\nبين الله وعبده فإن الله تعالى قال لعبده سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى فأمره بتنزيهه فقال له العبد مقالة حال بما نسبحه فقال فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ أي لا تنزهه إلا بأسمائه لا بشي‏ء من أكوانه وأسماؤه لا تعرف إلا منه عندنا وإن كانت هذه المسألة مسألة خلاف بين علماء الرسوم فإذا لم تعرف أسماؤه إلا منه ولا ينزه إلا بها فكان العبد ناب مناب الحق في الثناء عليه بما أثنى هو على نفسه لا بما أحدثه العبد من نظره وأي شرف أعظم من شرف من ناب مناب الحق في الثناء عليه والمعرفة به فكان الحق استخلف عبده عليه في هذه الرتبة فلو إن المثنى على الله بأسمائه يعرف قدر هذه المنزلة التي أنزله الله فيها لفنى عن وجوده فرحا بما هو عليه ثم لا يخلو العبد في هذا الثناء إما أن يثني على الله بأسماء التنزيه أو بأسماء الأفعال فالمتقدم عندنا من جهة الكشف أن تبتدئ بأسماء التنزيه وبالنظر العقلي بأسماء الأفعال فلا بد من مشاهدة المفعولات فأول مفعول أشاهده الأقرب إلي وهو نفسي فأثنى عليه بأسماء فعله بي وفي وكلما رمت أن أنتقل من نفسي إلى غيري اطلعت على حادث آخر أحدثه في نفسي بطلب يطلب مني الثناء عليه به فلا أزال كذلك أبد الأبد دنيا وآخرة ولا يكون إلا هكذا فانظر ما يبقى علي من منازل الثناء على الله من مشاهدة ما سواى من المخلوقين وهذا المشهد يطلب لا أحصي ثناء عليك أنت كما أثنيت على نفسك ولهذا التتميم قال الصديق العجز عن درك الإدراك إدراك وبعد الفراغ مني ومن المخلوقين حينئذ أشرع في الثناء عليه بأسماء التنزيه والفراغ من نفسي محال فالوصول إلى مشاهدة الأكوان بالفراغ من الأكوان محال فالوصول إلى أسماء التنزيه محال فإذا رأيت أحدا من العامة أو ممن يدعي المعرفة بالله يثني على الله بأسماء التنزيه على طريق المشاهدة أو بأسماء الأفعال من حيث ما هي متعلقة بغيره‏\n\n\n### [من عمى عن نفسه‏]\n\n\nفاعلم أنه ما عرف نفسه ولا شاهدها ولا أحس بآثار الحق فيه ومن عمي عن نفسه التي هي أقرب إليه فهو على الحقيقة عن غيره أعمى وأضل سبيلا قال تعالى ومن كانَ في هذِهِ أَعْمى‏ يعني في الدنيا وسماها دنيا لأنها أقرب إلينا من الآخرة قال تعالى إِذْ أَنْتُمْ بِالْعُدْوَةِ الدُّنْيا يريد القريبة وهُمْ بِالْعُدْوَةِ الْقُصْوى‏ يعني البعيدة فَهُوَ في الْآخِرَةِ أَعْمى‏ وأَضَلُّ سَبِيلًا ثم لتعلم أنك من جملة أسمائه بل من أكملها اسما حتى إن بعض الشيوخ وهو أبو يزيد البسطامي سأله بعض الناس عن اسم الله الأعظم فقال أروني الأصغر حتى أريكم الأعظم أسماء الله كلها عظيمة فاصدق وخذ أي اسم إلهي شئت ولقيت الشيخ أبا أحمد بن سيد بون بمرسية وسأله إنسان عن اسم الله الأعظم فرماه بحصاة يشير إليه إنك اسم الله الأعظم وذلك أن الأسماء وضعت للدلالة فقد يمكن فيها الاشتراك وأنت أدل دليل على الله وأكبره فلك إن تسبحه بك فإن قلت وهكذا في جميع الأكوان قلنا نعم إلا إنك أكمل دليل عليه وأعظمه من جميع الأكوان لكونه سبحانه خلقك على صورته وجمع لك بين يديه ولم يقل ذلك عن غيرك من الموجودات فإن قلت فقد وصف نفسه بالعظمة قلنا وقد وصفك بالعظمة وندبك إلى تعظيمه فقال ومن يُعَظِّمْ شَعائِرَ الله فَإِنَّها من تَقْوَى الْقُلُوبِ وأنت أعظم الشعائر فيتضمن قوله تعالى فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ إن تنزهه بوجودك وبالنظر في ذاتك فتطلع على ما أخفاه فيك من قرة أعين فأنت اسمه العظيم ومن كونك على صورته ثبتت العلاقة بينك وبينه فقال يُحِبُّهُمْ ويُحِبُّونَهُ والمحبة علاقة بين المحب والمحبوب ولم يجعلها إلا في المؤمنين من عباده ولا خفاء إن الشكل يألف شكله وهو الإنسان الكامل الذي لا يماثل في لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ ولك حرف لام ألف من الصورة فإنه يلتبس على الناظر أي الفخذين هو اللام وأيهما هو الألف للمشابهة في لآ تداخل كل واحد منهما على صاحبه ولهذا كان لام الألف من جملة الحروف وإن كان مركبا من ذاتين موجودتين في العلم غير مفترقتين في الشكل ولهذا وقع الإشكال في أفعالنا لنا أو لله فلا يتخلص في ذلك دليل يعول عليه فالألف لها الأحدية في المرتبة والأول من العدد واللام لها المرتبة الثالثة من أول مراتب العقد والثلاثة هي أول الأفراد فقد ظهر التناسب بين الأحد والفرد من حيث الوترية فهو أول في الأحدية والإنسان الكامل أول في الفردية فاعلم ذلك ولهذا جاء في نشأة الإنسان أنه علقة من العلاقة والعلقية في ثالث مرتبة من أطوار خلقته فهي في الفردية المناسبة له من جهة اللام في مراتب العدد قال تعالى خَلَقْنَا الْإِنْسانَ من سُلالَةٍ من طِينٍ وهذه‏\nأول مرتبة ثُمَّ جَعَلْناهُ نُطْفَةً في قَرارٍ مَكِينٍ هدى ثانية ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً وهي المرتبة الفردية ولها الجمع والإنسان محل الجمع لصورة الحضرة الإلهية ولصورة العالم الكبير ولهذا كان الإنسان وجوده بين الحق والعالم الكبير وانفصل جميع المولدات ما سوى الإنسان عن وجود الإنسان بأن جميع المولدات ما عداه موجودون عن العالم فهو عن أم بغير أب كوجود عيسى بن مريم صلوات الله عليه وإنما نبهناك على هذا لئلا تقول إن جميع المولدات وجدوا بين الله والعالم وما كان الأمر كذلك وإلا فلا فائدة لقوله خلق آدم على صورته ولو كانت الصورة ما يتوهمه بعض أصحابنا بل شيوخنا من كونه ذاتا وسبع صفات فإن ذلك ليس بصحيح فإن الحيوان معلوم أن له ذاتا وأنه حي عالم مريد قادر متكلم سميع بصير فكان يبطل اختصاص الإنسان بالصورة وإنما جاءت على جهة التشريف له فلم يبق إلا أن تكون الصورة غير ما ذكروه فإن منعت العلم عن الحيوان كابرت الحس فإن الحيوان مفطور على العلم وأنه يوحى إليه كما قال وأَوْحى‏ رَبُّكَ إِلَى النَّحْلِ فإن نازعت في الكلام قلنا لك كلامه من جنس ما يليق بمزاجه وأما المكاشف فلا يحتاج معه إلى هذا فإنه يرى ما نرى ويعلم ما نعلم فإن قلت فكلامنا هو الحقيقة قلنا فالكلام الذي تثبته لنفسك إن أردت به الأصوات والحروف المركبة فكلام الله عندك على خلاف هذا ليس بصوت ولا حرف إن كنت أشعريا وإن كنت معتزليا فالكلام لمن خلقه وإن كان الكلام عندك عبارة عن كلام النفس فذلك موجود في الحيوان فصوت السنور إذا طلب ما يأكل خلاف صوته إذا طلب ما ينكح فقد أعرب بصوته عما حدثته به نفسه فإن قلت إن ذلك الذي في النفس إرادة وليس بكلام قلنا وكذلك الإنسان الذي في نفسه إرادة وليس بكلام فإن قلت ما استدل به أبو إسحاق الأسفراييني الأستاذ من حديث النفس بما مضى وما مضى لا يكون مرادا إذن فليست إرادة أعني ذلك الذي في النفس قلنا ذلك هو العلم بما قد مضى والتبس عليك ولا دليل لهم على كلام النفس أوضح من هذا وهو مدخول كما رأيت فخرج من هذا أن قوله صلى الله عليه وسلم على صورته لا يريد ما ذكره أصحابنا من الذات والصفات وكل الجماعة على ذلك فابحث على هذا الكنز حتى يفتح الله عليك به كما فتح به على من شاء من خلقه في قوله يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ ومما يختص به هذا المنزل من العلوم أيضا إن الله لما خلق العقل الأول أعطاه من العلم ما حصل له به الشرف على من هو دونه ومع هذا ما قال فيه إنه مخلوق على الصورة مع أنه\n\n\nمفعول إبداعي كما هي النفس مفعول انبعاثي فلما خلق الله الإنسان الكامل أعطاه مرتبة العقل الأول وعلمه ما لم يعلمه العقل من الحقيقة الصورية التي هي الوجه الخاص له من جانب الحق وبها زاد على جميع المخلوقات وبها كان المقصود من العالم فلم تظهر صورة موجود إلا بالإنسان والعقل الأول على عظمه جزء من الصورة وكل موجود مما عدا الإنسان إنما هو في البعضية ولهذا ما طغى أحد من الخلائق ما طغى الإنسان وعلا في وجوده فادعى الربوبية وأكبر العصاة إبليس وهو الذي يقول إِنِّي أَخافُ الله رَبَّ الْعالَمِينَ عند ما يكفر الإنسان إذا وسوس في صدره بالكفر وما ادعى قط الربوبية وإنما تكبر على آدم لا على الله فلو لا كمال الصورة في الإنسان ما ادعى الربوبية فطوبى لمن كان على صورة تقتضي له هذه المنزلة من العلو ولم تؤثر فيه ولا أخرجته من عبوديته فتلك العصمة التي حبانا الله بالحظ الوافر منها في وقتنا هذا فالله يبقيها علينا فيما بقي من عمرنا إلى أن نقبض عليها أنا وجميع إخواننا ومحبينا بمنه لا رب غيره ومن هذا المنزل تعرف عقوبة من لم يعرف قدره وجاز حده واحتجب بالصورة عما أراد الحق منه في خلقه بما أخبر به في شريعته فقال وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ ثم لتعلم إن علم القربة في هذا المنزل من وقف عليه وشاهده كان على بينة من ربه فيما يتقرب إليه به وهو ما نبهناك عليه ومما يتضمنه هذا المنزل خاصة علم الجمع بين التقدير\n\n\nوالإيجاد ولا تجد ذلك في منزل من المنازل مفصلا لا واسطة بينهما إذ كان التقدير يتقدم الإيجاد في نفس الأمر في عالم الزمان ولهذا قيل وبعض الناس يخلق ثم لا يفري‏\n\n\n### [أنه لم يكن في الأزل شي‏ء يقدر به ما يكون في الأبد إلا الهو]\n\n\nفاعلم أنه لم يكن في الأزل شي‏ء يقدر به ما يكون في الأبد إلا الهو فأراد الهو أن يرى نفسه رؤية كمالية تكون لها ويزول في حقه حكم الهو فنظر في الأعيان الثابتة فلم يرعينا يعطي النظر إليها هذه الرتبة الأنانة إلا عين الإنسان الكامل فقدرها عليه وقابلها به فوافقت إلا حقيقة واحدة نقصت عنه وهي وجودها لنفسها فأوجدها لنفسها فتطابقت‏\nالصورتان من جميع الوجوه وقد كان قدر تلك العين على كل ما أوجده قبل وجود الإنسان من عقل ونفس وهباء وجسم وفلك وعنصر ومولد فلم يعط شي‏ء منها رتبة كمالية إلا الوجود الإنساني وسماه إنسانا لأنه آنس الرتبة الكمالية فوقع بما رآه الإنس له فسماه إنسانا مثل عمران فالألف والنون فيه زائدتان في اللسان العربي فإن قلت فلما ذا ينصرف وعمران لا ينصرف قلنا في عمران علتان وهما اللتان منعتاه من الصرف وهما الزيادة والتعريف أعني تعريف العلمية والإنسان ليس كذلك فإن فيه علة واحدة وهي الزيادة وما لفظ الإنسان للإنسان اسم علم وإنما تعريفه إذا سمي بآدم فلما سمي بآدم لم ينصرف للتعريف والوزن وإنما سمي باسم معلول بعلة تمنعه من الصرف الذي هو التصرف في جميع المراتب ليعلم في صورته الإلهية أنه مقهور ممنوع عبد ذليل مفتقر إذ كانت الصورة الإلهية تعطيه التصرف في جميع المراتب ولهذا سمي بإنسان فرفع وخفض ونصب وما ثم في الأسماء مرتبة أخرى فهو إنسان من حيث الصورة ومنها يتصرف في المراتب كلها ومنع الصرف من حيث هو في قبضة موجدة ملك يبقيه ما شاء ويعدمه إن شاء فبالصورة نال الخلافة والتصريف واسم الإنسانية فمن إنسانيته ثبت أنه غير يؤنس به ومن الخلافة ثبت أنه عبد فقير ما له قوة من استخلفه بل الخلافة خلعت عليه يزيلها متى شاء ويجعلها على غيره كما قد وقع ولهذا قال تعالى هُوَ الَّذِي جَعَلَكُمْ خَلائِفَ في الْأَرْضِ وهي محل الخفض إذ الخفض لا يليق بالجناب العالي فلهذا أقام له نائبا فيه ليعلم أنه عبد فلو استخلف الإنسان في السماء مع وجوده على الصورة لم يشاهد عبوديته في رفعته للصورة والمكان والمكانة فربما طغى ولو طغى ما وقع الأنس به ولهذا من زاحم قصم‏\n\n\nقال الله الكبرياء ردائي والعظمة إزاري من نازعني واحدا منهما قصمته‏\n\n\nفالعبد صغير في كبرياء الحق فإن هذا الكبرياء الإلهي ألبسه الصغار وهو حقير في عظمة الحق فإن هذه العظمة الإلهية ألبسته الحقارة فالصغار رداء العبد والحقارة إزاره فمن نازعه من الأناسي واحدة منهما أي طلب مشاركته فيهما عصم لا قصم ورحم ما حرم ولهذا خلق فتأمل أيها الإنسان لم سماك إنسانا وتأمل لم سماك خليفة وتأمل لم سماك آدم في أول صورة ظهرت ولا تتعد ما تعطيه حقيقة هذه الأسماء ولا تغب عنك فتكون من المفلحين ولهذا ختم الاستخلاف الكامل باسم منصرف وهو محمد صلى الله عليه وسلم ليجبر به ما منع آدم من التصريف فإنه ما منع إلا لعلة قامت به وهو أول في هذا النوع فعصم باسم غير منصرف ليعلم أنه تحت الحجر مقهور لا ينصرف ولا يتصرف إلا فيما حد له ثم بعد ذلك أعطى التصريف جماعة من الخلفاء كنوح وشيث وشعيب وصالح ومحمد وهود ولوط وغيرهم لأنه أمن بالأول وقوع ما كان يحذر ثم إنه تخلل هؤلاء الخلفاء أسماء لا تنصرف كإدريس وإبراهيم وإسماعيل وإسحاق ويعقوب وسليمان وداود تنبيها للإنسان إذا سلك طريق الله ثم عاد بعد قطع الأسباب والاعتماد على الله إلى القول بالأسباب والوقوف عندها لكون الحق وضعها وربط الأمور بها وحاله الاعتماد على الله والطبع من عادته الألفة ويسرق صاحبه إلى الركون لمألوفه كما قلنا لأنه إنسان يأنس بمألوفه فربما يتخلله اعتماد على السبب فيضعف اعتماده على الله تعالى فيتفقد نفسه بقطع الأسباب وقتا بعد وقت كما فعل الله بأسماء الخلائف وقتا دعاهم باسم يقتضي لهم التصريف ووقتا دعاهم باسم يمنعهم التصريف تعليما لهم لئلا يقعوا في محظور محذور قال تعالى عَلَّمَ الْإِنْسانَ ما لَمْ يَعْلَمْ فلهذا كانت هذه الأسماء التي تمنع الصرف في بعض الخلفاء وأما الذين أعطوا التصريف فهم على قسمين منهم من أعطى التصريف ظاهرا ومعنى وهو التصريف الكامل فلهم الاسم الكامل مثل محمد وصالح وشعيب وكل اسم منصرف ظاهر لواحد من هؤلاء الخلفاء والقسم الآخر أعطى التصريف معنى لا ظاهرا فليست له علة تمنعه من الصرف في المعنى وكان آخره حرف علة منعه ذلك الحرف من التصرف في الظاهر فكان مقصورا وسمي ذلك الاسم مقصورا كموسى وعيسى ويحيى فقصروا على المعنى دون الظاهر وسميت هذه بالمقصورة أي قصرت عن درجة التصرف في الظاهر وحبست عنه ومنه حور مقصورات في الخيام وإنما قصر من قصر منهم صيانة لا سجنا فصانوا مثل هؤلاء كما صين من لم ينصرف من الأسماء عناية ثم إن الله تعالى لما أراد أن لا يحجبهم عنهم طبا في حقهم لما يعلم ما تقتضيه هذه النشأة من العلل إذ كان الكمال لا يطاق حكمه إلا بالعناية الإلهية فكان من العناية الإلهية بهم إن أجرى عليهم الأسماء النواقص‏\nليعلموا أنهم في مرتبة النقص وهو كمالهم عن الكمال الإلهي فقال والَّذِي جاءَ بِالصِّدْقِ وصَدَّقَ به يعني محمدا صلى الله عليه وسلم فكنى عنه بالذي جاء بالصدق والذي من الأسماء النواقص ولما علم إن العبد المقرب يتألم بظهور نقصه ويخاف من الحاقة بالعدم ورجوعه إلى أصله آنسه سبحانه من باب اللطف والكرم فسمى سبحانه نفسه بالأسماء النواقص فقال هُوَ الَّذِي خَلَقَكُمْ وقال هُوَ الَّذِي أَنْزَلَ من السَّماءِ وليس في القرآن لله تعالى أكثر من الأسماء النواقص فكان ذلك تأمينا للخلفاء فإنهم قاطعون بأن الحق ليس له مرتبة النقص ولا يقبلها ومع ذلك قد جرت عليه الأسماء النواقص فلو أثرت الأسماء لذاتها في المسمى لأثرت في الله وهي غير مؤثرة فيه إذا فنرجو أنها لا تؤثر فينا تأثير العدم ولكن كمالنا في أن تؤثر فينا تأثير وقوفنا مع عجزنا وفقرنا وهذا الباب الذي فتحناه علينا في هذا المنزل باب واسع لا يتسع الوقت لا يراد بعض ما يعطيه فليكف هذا القدر منه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى السفر التاسع عشر من الفتوح المكي والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ‏\n\n",
    "en": "Chapter Two Hundred and Eighty-Eight: Concerning the Knowledge of the Station of the First Recitation from the Mosaic Presence\n\nBe for the God like *Bismillah* (In the Name of God) is for humanity,\nFrom His Name, the Lord (الرب), is the Lord of the Spirit and the Forms.\n\nSo Creation (الخلق), the Command (الأمر), and the bringing into existence (التكوين), all of it,\nBelong to Him; thus, there is no difference between the Intellect and the stone.\n\nLike the ascetic (الزاهد) who is exalted in his richness through Him,\nHe does not distinguish between the spring and the clod of earth.\n\nBut the Gnostic (العارف) who is exalted in his transcendence (نزاهة),\nFor him is the distinction between the spring and the sight.\n\nSince the return to verification (التحقيق) is the characteristic of one who\nSees the stations (المنازل) in the signs and the forms.\n\n### The First Thing God Commanded His Servant: Proper Conduct\n\nThe first thing God commanded His servant is gathering (الجمع), which is proper conduct (الأدب). It is derived from *al-ma'duba* (a banquet), which is gathering over food. Likewise, *al-Adab* is an expression for the totality of all goodness.\n\nThe Prophet (peace and blessings be upon him) said: \"Indeed, Allah disciplined me (أدبني),\" meaning He gathered all good things within me, because he said: \"and He perfected my discipline (أدبي).\" That is, He made me a locus for every beautiful thing.\n\nSo it was said to humanity: Gather the good things, for God made His servant in this world an agent, a collector (جابياً), who collects for Him, the Glorified, everything He has prescribed for him. Thus, he gathers that in this world, for God created him only for gathering (الجمع). If he gathers what he was commanded to gather and collects it, he will be felicitous, and the Real (الحق) will bestow upon him all that he collected and favor him. His reward will be the very thing he collected, along with the beautiful Divine praise upon him for his trustworthiness, justice, and freedom from oppression and betrayal.\n\nBut if he was a wicked servant, he betrayed his trust and gave it to those undeserving. He gathered what he was not commanded to gather, things he was forbidden from involving himself in, and abandoned gathering what he was commanded to gather. When he returned to his Master and arrived at the register of accountability, and the people of the register sat to reckon with him, and he saw the severity of the terror in his reckoning and the reckoning of others, and he saw the trustworthy ones who collected exactly what was prescribed for them having achieved felicity and security, grief and sorrow overwhelmed him. Among them are those who were forgiven and released due to the intercession of an intercessor, and among them are those who had no intercessor, so they were tormented and pressed.\n\nWhoever knew what he was created for and acted upon it attained eternal rest, although, in himself, during the time of his collection, he was in caution and danger.\n\nIf this is the case, then the best thing a human gathers in his life is Knowledge (العلم) of God, the assumption of His Names (الأسماء) as character traits (التخلق), standing firm upon what his servitude (عبوديته) demands, and fulfilling what the degree of his Master deserves, which is the compliance with His commands.\n\nThe station (منزل) of this command among the Divine Names (الأسماء الإلهية) is the Name *al-Rabb* (the Lord). God, the Glorified, has described this Name with Greatness (العظمة), Generosity (الكرم), and Loftiness (العلو) in several places in His Noble Book, and He mentioned the affairs He placed under its rule and in its hand. He gave the letter *Ba'* (ب) in this station a tremendous authority, since He made it an intermediary between God and His servant.\n\nFor God Almighty said to His servant: <<سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى>> (Glorify the Name of your Lord, the Most High). So He commanded him to declare His transcendence (تنزيهه). The servant responded with a statement of state: \"With what shall we glorify Him?\" Then He said: <<فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ>> (So glorify with the Name of your Lord, the Magnificent). Meaning, do not declare His transcendence except through His Names, not through anything of His created things (أكوانه).\n\nAnd His Names are not known except from Him, according to us, even though this issue is a matter of dispute among the scholars of external forms (علماء الرسوم). If His Names are not known except from Him, and He is not declared transcendent except through them, then the servant acted as the deputy of the Real (الحق) in praising Him with what He Himself praised Himself, not with what the servant innovated from his own speculation. And what honor is greater than the honor of one who acts as the deputy of the Real in praising Him and knowing Him (المعرفة)? It is as if the Real appointed His servant as His vicegerent over Him in this degree. If the one who praises God with His Names knew the worth of this station in which God has placed him, he would undergo annihilation (فناء) from his existence out of joy for what he possesses.\n\nFurthermore, the servant, in this praise, must either praise God with the Names of Transcendence (أسماء التنزيه) or with the Names of Acts (أسماء الأفعال). What is prioritized according to us, from the perspective of Unveiling (الكشف), is that you begin with the Names of Transcendence, and from the perspective of rational speculation, with the Names of Acts. Thus, one must witness the effects (المفعولات). The first effect I witness is the one closest to me, which is my own self (نفسي). So I praise Him with the Names of His Act concerning me, within me, and in everything. And whenever I intend to move from myself to another, I am informed of another event He has brought into existence within my self, demanding that I praise Him through it. I remain thus eternally, in this world and the Hereafter, and it cannot be otherwise. Look then at what remains for me of the stations of praising God, apart from witnessing what is other than me among the created things. This witnessing demands the saying: \"I cannot enumerate Your praise; You are as You have praised Yourself.\" And for this completion, al-Siddiq (Abu Bakr) said: \"Inability to grasp the grasp is itself a grasp.\"\n\nAnd after being free from myself and from the created things, only then do I begin to praise Him with the Names of Transcendence. But freedom from my self is impossible. So, reaching the witnessing of the created things (الأكوان) by being free from the created things is impossible. Therefore, reaching the Names of Transcendence is impossible.\n\nSo, if you see anyone among the common people or those who claim Gnosis (المعرفة) of God praising God with the Names of Transcendence by way of witnessing, or with the Names of Acts as they relate to something other than himself...\n\n### He Who is Blind to Himself\n\nKnow that he has not known his self, nor witnessed it, nor perceived the traces of the Real (الحق) within it. And whoever is blind to his self, which is closest to him, is truly blinder and further astray from the path concerning anything else. He Almighty said: <<وَمَن كَانَ فِي هَذِهِ أَعْمَىٰ>> (And whoever is blind in this [world]). Meaning, in the world (الدنيا), and He named it *dunya* because it is closer to us than the Hereafter (الآخرة). He Almighty said: <<إِذْ أَنتُم بِالْعُدْوَةِ الدُّنْيَا>> (When you were on the nearer side), meaning the near side, <<وَهُمْ بِالْعُدْوَةِ الْقُصْوَىٰ>> (And they were on the farther side), meaning the distant side. <<فَهُوَ فِي الْآخِرَةِ أَعْمَىٰ وَأَضَلُّ سَبِيلًا>> (He will be in the Hereafter blinder and further astray from the path).\n\nThen know that you are among the totality of His Names, indeed, among the most perfect of them as a Name. So much so that one of the Shaykhs, Abu Yazid al-Bistami, was asked by some people about the Greatest Name of God (الاسم الأعظم), and he replied: \"Show me the smallest Name, and I will show you the Greatest Name.\" All of God's Names are magnificent, so be truthful and take whichever Divine Name you wish. I met Shaykh Abu Ahmad ibn Sayyid Bun in Murcia, and a man asked him about the Greatest Name of God. He threw a pebble at him, indicating: \"You are the Greatest Name of God.\" This is because the Names were established for indication (الدلالة), and they may share in meaning. And you are the most indicative and greatest proof (دليل) of God. Therefore, you have the right to glorify Him through yourself.\n\nIf you say, \"Is it thus for all created things (الأكوان)?\" We say, \"Yes, except that you are the most perfect and greatest proof of Him among all created things, because He, the Glorified, created you upon His Form (صورته).\" And He gathered you between His two Hands, and He did not say that concerning any other existing thing besides you.\n\nIf you say, \"He described Himself with Greatness,\" we say, \"He also described you with greatness and urged you to magnify Him.\" He said: <<وَمَن يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِن تَقْوَى الْقُلُوبِ>> (And whoever magnifies the sacred symbols (شعائر) of Allah, it is indeed from the piety of the hearts). And you are the greatest of the sacred symbols. Thus, His saying <<فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ>> (So glorify with the Name of your Lord, the Magnificent) implies that you declare His transcendence through your existence and by looking into your own essence (ذاتك). Thereby you become informed of the delight of the eyes (قرة أعين) that He concealed within you. So you are His Magnificent Name.\n\nAnd from your being upon His Form, the relationship (العلاقة) between you and Him is established. He said: <<يُحِبُّهُمْ وَيُحِبُّونَهُ>> (He loves them, and they love Him). And love is a relationship between the lover and the beloved. And He did not place it except in the believers among His servants. And it is no secret that a form is familiar with its like. And this is the Perfect Human (الإنسان الكامل), who is not comparable in the sense of <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like Him).\n\nAnd you have the letter *Lam-Alif* (لا) from the Form. For it is confusing to the observer which of the two thighs is the *Lam* and which is the *Alif*, due to the similarity in that neither one intrudes upon the other. For this reason, *Lam-Alif* is counted among the letters, even though it is composed of two essences (ذاتين) existing in Knowledge (العلم) but not separated in form. And for this reason, the ambiguity (الإشكال) arose concerning whether our acts belong to us or to God. And no reliable proof can resolve this.\n\nThe *Alif* has the Oneness (الأحدية) in degree and is the first of the numbers. The *Lam* has the third degree from the first degrees of the knot (العقد). And three is the first of the odd numbers (الأفراد). Thus, the correspondence (التناسب) between the One (الأحد) and the Odd (الفرد) has appeared, from the perspective of oddness (الوترية). So He is the first in Oneness, and the Perfect Human (الإنسان الكامل) is the first in Oddness (الفردية). Know this.\n\nFor this reason, it came in the genesis of humanity that he is a clot (*'alaqa*) from the relationship (*al-'alaqa*). And the state of being a clot is the third degree among the stages of his creation. So it is in the Oddness appropriate to him from the perspective of the *Lam* in the degrees of number. He Almighty said: <<خَلَقْنَا الْإِنسَانَ مِن سُلَالَةٍ مِّن طِينٍ>> (We created man from an extract of clay). This is the first degree. <<ثُمَّ جَعَلْنَاهُ نُطْفَةً فِي قَرَارٍ مَّكِينٍ>> (Then We placed him as a drop of sperm in a firm lodging). This is the second. <<ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً>> (Then We created the drop of sperm into a clinging clot). And this is the odd degree, and it possesses gathering (الجمع).\n\nAnd the human is the locus of gathering (محل الجمع) for the form of the Divine Presence (الحضرة الإلهية) and for the form of the Great World (العالم الكبير). For this reason, the existence of the human is between the Real (الحق) and the Great World. And all generated things (المولدات) other than the human are separated from the existence of the human, in that all generated things besides him exist from the World, so they are from a mother without a father, like the existence of Jesus son of Mary (peace be upon him). We only alerted you to this so that you do not say that all generated things exist between God and the World. The matter is not so, otherwise there would be no benefit in His saying: \"He created Adam upon His Form.\"\n\nEven if the Form were what some of our companions—indeed, some of our Shaykhs—imagine it to be: an Essence (ذات) and seven Attributes (صفات), that is not correct. For it is known that the animal has an essence, and that it is living, knowing, willing, powerful, speaking, hearing, and seeing. Thus, the exclusivity of the human to the Form would be invalidated. Rather, it came as a means of honoring him. So, it remains that the Form must be other than what they mentioned. If you deny knowledge (العلم) to the animal, you contradict sensory perception. For the animal is naturally disposed to knowledge, and revelation (وحي) is sent to it, as He said: <<وَأَوْحَىٰ رَبُّكَ إِلَى النَّحْلِ>> (And your Lord inspired the bee). If you dispute the matter of speech (الكلام), we say to you that its speech is of the kind appropriate to its temperament. As for the one who receives Unveiling (المكاشف), there is no need for this argument with him, for he sees what we see and knows what we know.\n\nIf you say, \"Then our speech is the Reality,\" we say: If by the speech you affirm for yourself you mean composed sounds and letters, then the Speech of God, according to you, is contrary to this—it is neither sound nor letter—if you are an Ash'ari. And if you are a Mu'tazili, then the speech belongs to the one who created it. And if speech, according to you, is an expression of inner speech (كلام النفس), then that exists in the animal. For the sound of the cat when it seeks food is different from its sound when it seeks mating. Thus, it has expressed with its sound what its inner self communicated to it. If you say that what is in the self is Will (إرادة) and not speech, we say: Likewise, what is in the human self is Will and not speech. If you cite what the Master Abu Ishaq al-Asfara'ini used as proof concerning inner speech regarding what has passed, and what has passed cannot be willed, then it is not Will—meaning that which is in the self. We say: That is knowledge (العلم) of what has already passed, and it has become confused for you. And they have no clearer proof for inner speech than this, and it is flawed, as you have seen.\n\nIt follows from this that his saying (peace and blessings be upon him), \"upon His Form,\" does not mean what our companions mentioned concerning the Essence and the Attributes. And the entire group agrees on this. So search for this treasure until God opens it up for you, just as He opened it up for whomever He willed among His creation, in His saying: <<يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَىٰ مَن يَشَاءُ مِنْ عِبَادِهِ>> (He casts the Spirit (الروح) by His command upon whomever He wills of His servants).\n\nAnd among the sciences specific to this station (منزل) is also that when God created the First Intellect (العقل الأول), He gave it knowledge (العلم) by which it attained honor over those below it. Yet, despite this, He did not say concerning it that it was created upon the Form, even though it is an act of origination, just as the Soul (النفس) is an act of emanation. When God created the Perfect Human (الإنسان الكامل), He gave him the degree of the First Intellect, and He taught him what the Intellect did not know concerning the formal Reality (الحقيقة الصورية), which is the specific Face (الوجه الخاص) belonging to him from the side of the Real (الحق). And by this, he surpassed all created things, and by this, he was the intended purpose of the World (العالم). Thus, the form of no existing thing appeared except through the human. And the First Intellect, despite its magnitude, is only a part of the Form. And every existing thing other than the human is only in partiality (البعضية).\n\nFor this reason, none of the creatures transgressed as the human transgressed, rising in his existence and claiming Lordship (الربوبية). And the greatest of the disobedient is Iblis, who says <<إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ>> (Indeed, I fear Allah, Lord of the worlds) when the human disbelieves after he whispers disbelief into his breast. And he never claimed Lordship; rather, he was arrogant toward Adam, not toward God. Were it not for the perfection of the Form in the human, he would not have claimed Lordship. Blessed is he who is upon a Form that necessitates this station of loftiness for him, yet it did not affect him or remove him from his servitude (عبوديته). That is the infallibility (العصمة) with which God has favored us with an abundant share in this time of ours. May God preserve it for us throughout the remainder of our lives until we grasp it—I and all our brethren and lovers—by His grace, for there is no Lord but Him.\n\nAnd from this station, one knows the punishment of him who did not know his worth and exceeded his limit, and who was veiled by the Form from what the Real intended for him in his creation, as He informed in His Law (شريعته), saying: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except to worship Me).\n\nThen know that the knowledge of proximity (القربة) in this station—whoever stands upon it and witnesses it—will be upon clear evidence from his Lord concerning that by which he draws near to Him, which is what we have alerted you to. And among what this station specifically encompasses is the knowledge of gathering (الجمع) between Pre-determination (التقدير) and Bringing into Existence (الإيجاد). And you will not find this detailed in any other station, with no intermediary between the two, since Pre-determination precedes Bringing into Existence in the reality of the matter in the world of time. For this reason, it was said: \"And some people create, but then do not cut (i.e., do not execute the plan).\"\n\n### That Nothing in Eternity Could Predetermine What Would Be in Perpetuity Except the He-ness\n\nKnow that there was nothing in pre-eternity (الأزل) by which what would be in perpetuity (الأبد) could be pre-determined, except the He-ness (الهو). So the He-ness desired to see Itself with a perfect vision that would belong to It, and that the ruling of the He-ness would vanish concerning It. So It looked into the Fixed Entities (الأعيان الثابتة) but did not see any entity whose contemplation would grant It this degree of I-ness (الأنانة), except the entity of the Perfect Human (الإنسان الكامل). So It pre-determined it upon him and matched it with him, and it corresponded, except for one reality that was lacking in him, which was his existence for himself. So It brought him into existence for himself, and the two forms corresponded in all respects.\n\nAnd It had already pre-determined that entity upon everything It brought into existence before the existence of the human: Intellect, Soul, Mist (هباء), body, sphere, element, and generated thing. But none of them was given a perfect degree except the human existence (الوجود الإنساني). And It named him *Insan* (human) because he was familiar with (*anasa*) the perfect degree, so the familiarity (الإنس) that he saw occurred for him, and It named him *Insan*, like *Imran*. The *Alif* and the *Nun* in it are augmentative in the Arabic language.\n\nIf you say, \"Then why is it fully inflected (*yansarif*), while *Imran* is not fully inflected (*la yansarif*)?\" We say: In *Imran* there are two defects which prevent its full inflection: augmentation and definition, meaning the definition of being a proper noun (العلمية). And *Insan* is not like that, for it has only one defect, which is augmentation. The word *Insan* is not a proper noun for the human; rather, its definition occurs when he is named *Adam*. When he was named *Adam*, he was not fully inflected due to definition and measure. He was only named with a name defective due to a cause that prevents its full inflection (الصرف), which is the ability to dispose (التصرف) in all degrees. This is so that it may be known, despite his Divine Form (الصورة الإلهية), that he is subjugated (مقهور), restricted, a humble servant, and needy. Since the Divine Form grants him the ability to dispose in all degrees, for this reason, he was named *Insan*, so he was raised, lowered, and given the accusative. And there is no other degree in the Names. So he is *Insan* from the perspective of the Form, and from it he disposes in all degrees. And he was prevented from full inflection from the perspective that he is in the grasp of his Creator, a King who preserves him as He wills and annihilates him if He wills.\n\nBy the Form, he attained the Vicegerency (الخلافة) and the power of disposal (التصريف), and the name of humanity (الإنسانية). From his humanity, it is established that he is an 'other' with whom familiarity is sought. And from the Vicegerency, it is established that he is a poor servant who has no power from the One who appointed him as vicegerent. Rather, the Vicegerency was bestowed upon him as a robe of honor, which He removes whenever He wills and places upon another, as has occurred. For this reason, He Almighty said: <<هُوَ الَّذِي جَعَلَكُمْ خَلَائِفَ فِي الْأَرْضِ>> (It is He who has made you vicegerents upon the earth). And the earth is the locus of lowering (الخفض), since lowering is not appropriate for the Exalted Presence. For this reason, He established a deputy for Him therein, so that it may be known that he is a servant. If the human had been appointed vicegerent in the heaven, despite his existence upon the Form, he would not have witnessed his servitude in his loftiness due to the Form, the place, and the status. So perhaps he would have transgressed, and if he had transgressed, familiarity (الأنس) with him would not have occurred. For this reason, whoever contends is broken.\n\nGod said: \"Pride (الكبرياء) is My cloak, and Magnificence (العظمة) is My wrapper. Whoever contends with Me concerning either of them, I shall break him.\"\n\nSo the servant is small within the Pride of the Real, for this Divine Pride clothed him in smallness. And he is contemptible within the Magnificence of the Real, for this Divine Magnificence clothed him in contemptibility. So smallness is the servant's cloak, and contemptibility is his wrapper. Whoever among mankind contends with him concerning either of them—meaning, seeks partnership in them—is protected (عصم), not broken (قصم), and is shown mercy for what was forbidden. For this he was created. So reflect, O human, why He named you *Insan*. And reflect why He named you *Khalifa* (Vicegerent). And reflect why He named you *Adam* in the first form that appeared. And do not transgress what the reality (حقيقة) of these Names grants you, and do not be absent from yourself, so that you may be among the successful.\n\nFor this reason, the perfect Vicegerency (الاستخلاف الكامل) was sealed with a fully inflected name (*munsarif*), which is Muhammad (peace and blessings be upon him), to mend through him what Adam was prevented from in terms of disposal (التصريف). For he was prevented only due to a defect that arose in him, and he was the first in this type. So he was protected by a non-fully inflected name (*غير منصرف*) so that it might be known that he is under restriction (الحجر), subjugated, unable to be fully inflected or to dispose except within what was limited for him.\n\nThen after that, He granted the power of disposal (التصريف) to a group of vicegerents, such as Noah, Seth, Shu'ayb, Salih, Muhammad, Hud, Lot, and others, because He was secured by the first (Adam) from the occurrence of what He feared. Then, interspersed among these vicegerents were non-fully inflected names, such as Idris, Abraham, Ishmael, Isaac, Jacob, Solomon, and David. This is an alert to the human: if he traverses the path of God, then returns—after cutting off means (الأسباب) and relying solely on God—to affirming the means and stopping at them, because the Real established them and linked affairs to them, while his state is reliance upon God. And the nature (الطبع) is accustomed to familiarity (الألفة) and secretly leads its possessor to rely on what he is familiar with, as we said, because he is *Insan* (human) who finds familiarity (*ya'nas*) with what he knows. So perhaps reliance upon the means intermingles with him, and his reliance upon God Almighty weakens. So he examines his self by cutting off the means from time to time, just as God did with the names of the vicegerents, calling them at one time by a name that necessitated disposal for them, and at another time by a name that prevented disposal, teaching them so that they would not fall into a forbidden danger. He Almighty said: <<عَلَّمَ الْإِنسَانَ مَا لَمْ يَعْلَمْ>> (He taught man what he did not know). For this reason, these names that prevent full inflection were found in some of the vicegerents.\n\nAs for those who were given the power of disposal (التصريف), they are of two divisions. Among them are those who were given disposal outwardly and inwardly, which is the complete disposal. They have the complete name, such as Muhammad, Salih, and Shu'ayb, and every outwardly fully inflected name belonging to one of these vicegerents. The other division was given disposal inwardly, not outwardly. So he has no defect that prevents his full inflection in meaning. But his ending was a weak letter that prevented him from disposal outwardly, so he was restricted (*maqsura*). And that name was called restricted, like Moses, Jesus, and John. So they were restricted to the inward meaning, without the outward. And these were called the restricted ones, meaning they were restricted from the degree of outward disposal and held back from it. And from this is <<حُورٌ مَّقْصُورَاتٌ فِي الْخِيَامِ>> (Houri restricted in pavilions). And those who were restricted were restricted for preservation, not for imprisonment. So they preserved such individuals, just as those names that were not fully inflected were preserved by Divine care (عناية).\n\nThen, when God Almighty desired not to veil them from themselves—out of kindness toward them, knowing the defects (العلل) that this genesis (النشأة) necessitates, since the ruling of perfection (الكمال) cannot be endured except through Divine Care (العناية الإلهية)—it was part of the Divine Care for them that He applied the deficient Names (الأسماء النواقص) to them. So that they might know that they are in the degree of deficiency, which is their perfection relative to the Divine Perfection. He said: <<وَالَّذِي جَاءَ بِالصِّدْقِ وَصَدَّقَ بِهِ>> (And he who brought the truth and believed in it). Meaning Muhammad (peace and blessings be upon him). So He referred to him by \"he who brought the truth,\" and *al-ladhi* (he who) is one of the deficient Names.\n\nAnd when He knew that the servant brought near (العبد المقرب) suffers pain from the manifestation of his deficiency and fears being joined to non-existence (العدم) and returning to his origin, He, the Glorified, comforted him out of kindness and generosity. So He, the Glorified, named Himself with the deficient Names, saying: <<هُوَ الَّذِي خَلَقَكُمْ>> (It is He who created you). And He said: <<هُوَ الَّذِي أَنزَلَ مِنَ السَّمَاءِ>> (It is He who sent down from the sky). And there are no more deficient Names applied to God Almighty in the Quran than these. This served as an assurance for the vicegerents. For they are certain that the Real does not possess the degree of deficiency and does not accept it. Yet, despite that, the deficient Names have been applied to Him. If the Names inherently affected the Named, they would have affected God, but they are not effective in Him. Therefore, we hope that they will not affect us with the effect of non-existence. But our perfection lies in their affecting us with the effect of our standing firm with our incapacity (عجزنا) and our poverty (فقرنا).\n\nAnd this door which we have opened for ourselves in this station is a vast door, and time is insufficient to present even some of what it grants. So let this much suffice from it. And God <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).\n\nThe nineteenth journey (السفر) of *Al-Futuhat al-Makkiyya* is concluded. <<وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ>> (And praise be to God, Lord of the worlds).",
    "ur": "باب نمبر دو سو اٹھاسی: حضرت موسویہ (الحضرة الموسوية) میں پہلی تلاوت کے مقام کی معرفت میں\n\nذات حق کے لیے ایسے ہو جاؤ جیسے انسانوں کے لیے بسم اللہ\nجس کے نام سے رب (الرب) روح اور صورتوں کا رب ہے\nپس خلق، امر اور تمام تکوین اسی کے لیے ہے\nلہٰذا عقل اور پتھر میں کوئی فرق نہیں\nجیسے وہ زاہد جو اپنے غنا (بے نیازی) میں اس کے ساتھ بلند ہے\nوہ چشمے اور مٹی میں تمیز نہیں کرتا\nاور وہ عارف جو اپنی نزاہت میں بلند ہے\nاس کے لیے چشمے اور بصارت میں تمیز ہے\nکیونکہ تحقیق کی طرف رجوع کرنا اس شخص کی خصلت ہے\nجو نشانات اور سورتوں میں منازل کو دیکھتا ہے۔\n\n### [پہلی چیز جس کا اللہ نے اپنے بندے کو حکم دیا وہ ادب ہے]\n\nپہلی چیز جس کا اللہ نے اپنے بندے کو حکم دیا وہ جمع (الجمع) ہے، اور یہی ادب (الأدب) ہے۔ یہ مأدبہ (ضیافت) سے مشتق ہے، جو کھانے پر جمع ہونے کو کہتے ہیں۔ اسی طرح ادب (الأدب) تمام خیر کے مجموعے کا نام ہے۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"بیشک اللہ نے مجھے ادب سکھایا\" یعنی مجھ میں تمام خیرات کو جمع کر دیا، کیونکہ آپ نے فرمایا: \"پس میرا ادب اچھا کر دیا\"۔ یعنی مجھے ہر حسن کا محل بنا دیا۔ لہٰذا انسان سے کہا گیا کہ خیرات کو جمع کرو، کیونکہ اللہ نے دنیا میں اپنے بندے کو عامل اور جابی (محصول جمع کرنے والا) بنایا ہے جو اس کے لیے وہ سب کچھ جمع کرتا ہے جو اس کے لیے مقرر کیا گیا ہے۔ پس وہ دنیا میں اسے جمع کرتا ہے۔ اللہ نے اسے جمع کرنے کے لیے ہی پیدا کیا ہے۔ اگر وہ اس چیز کو جمع کر لے جس کے جمع کرنے کا اسے حکم دیا گیا تھا اور اسے وصول کر لے، تو وہ سعید ہو گا اور ذات حق (الحق) اسے وہ سب کچھ عطا کر دے گا جو اس نے جمع کیا تھا اور اس پر انعام کرے گا۔ پس اس کی اجرت وہی ہو گی جو اس نے جمع کیا، ساتھ ہی امانت، عدل اور ظلم و خیانت سے پاک ہونے پر اس کی الٰہی تعریف بھی ہو گی۔\n\nاور اگر وہ برا بندہ ہوا، تو اس نے اپنی امانت میں خیانت کی اور اسے غیر مستحق لوگوں کو دے دیا، اور وہ چیزیں جمع کیں جن کے جمع کرنے کا حکم نہیں دیا گیا تھا اور جن سے منع کیا گیا تھا کہ وہ ان میں خود کو داخل کرے، اور اس نے وہ جمع کرنا چھوڑ دیا جس کے جمع کرنے کا اسے حکم دیا گیا تھا۔ جب وہ اپنے آقا کی طرف پلٹا اور محاسبے کے دفتر (دیوان) میں حاضر ہوا، اور اہل دیوان اس کا حساب لینے بیٹھے، اور اس نے اپنے اور دوسروں کے حساب میں ہولناکی کی شدت دیکھی، اور ان امانت داروں کو دیکھا جنہوں نے مقررہ حد کے مطابق جمع کیا تھا، وہ کامیاب اور محفوظ ہو گئے تھے، تو اس پر غم اور حزن بڑھ گیا۔ ان میں سے کچھ ایسے تھے جنہیں شفاعت کرنے والے کی شفاعت سے معاف کر دیا گیا اور ان کا راستہ چھوڑ دیا گیا، اور کچھ ایسے تھے جن کا کوئی شفیع نہ تھا، تو انہیں عذاب دیا گیا اور نچوڑا گیا۔\n\nپس جس نے جان لیا کہ وہ کس لیے پیدا کیا گیا ہے اور اس پر عمل کیا، اسے ابدی راحت ملی، اگرچہ وہ خود اپنے جمع کرنے کے زمانے میں خوف اور خطرے میں رہا۔ اگر یہ معاملہ ہے، تو انسان نے اپنی زندگی میں جو بہترین چیز جمع کی ہے وہ اللہ کی معرفت (العلم باللہ)، اس کے اسماء کے ساتھ تخلق (التخلق بأسمائه)، اور اپنی عبودیت (عبودیتہ) کے تقاضوں پر قائم رہنا ہے، اور اپنے آقا کے مرتبے کے حقوق کو اس کے اوامر کی تعمیل سے پورا کرنا ہے۔\n\nاور اس امر کا مقام اسماء الٰہیہ میں اسم رب (الرب) ہے۔ اللہ سبحانہ و تعالیٰ نے اس اسم کو اپنی کتاب عزیز میں کئی مقامات پر عظمت، کرم اور علو سے متصف کیا ہے، اور ان امور کا ذکر کیا ہے جو اس کے حکم کے تحت اور اس کے ہاتھ میں ہیں۔ اور اس مقام میں حرف باء (ب) کو ایک عظیم سلطنت دی ہے، کیونکہ اس نے اسے اللہ اور اس کے بندے کے درمیان واسطہ بنایا ہے۔ اللہ تعالیٰ نے اپنے بندے سے فرمایا: سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَىٰ (اپنے رب اعلیٰ کے نام کی تسبیح کرو)۔ پس اس نے اسے تنزیہ (پاکیزگی بیان کرنے) کا حکم دیا۔ تو بندے نے حال کی زبان سے کہا کہ ہم کس چیز کے ساتھ اس کی تسبیح کریں؟ تو اللہ نے فرمایا: فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ (پس اپنے رب عظیم کے نام کی تسبیح کرو)۔ یعنی اس کی تنزیہ صرف اس کے اسماء کے ذریعے کرو، نہ کہ اس کی کسی مخلوق کے ذریعے۔ اور ہمارے نزدیک اس کے اسماء کی معرفت صرف اسی کی طرف سے ہوتی ہے، اگرچہ یہ مسئلہ علماء رسوم کے درمیان اختلافی ہے۔\n\nپس جب اس کے اسماء کی معرفت صرف اسی کی طرف سے ہو سکتی ہے اور اس کی تنزیہ صرف ان اسماء کے ذریعے کی جا سکتی ہے، تو بندہ ذات حق (الحق) کی طرف سے اس کی ثنا کرنے میں اس کا نائب بن گیا، اس چیز کے ساتھ جس کی ثنا اس نے خود کی ہے، نہ کہ اس چیز کے ساتھ جو بندے نے اپنے غور و فکر سے ایجاد کی ہو۔ اور اس شرف سے بڑھ کر اور کیا شرف ہو سکتا ہے کہ کوئی ذات حق (الحق) کی ثنا اور معرفت میں اس کا نائب بن جائے؟ پس ذات حق (الحق) نے اس مرتبے میں اپنے بندے کو اپنا خلیفہ بنا دیا۔ اگر اللہ کی ثنا اس کے اسماء کے ذریعے کرنے والا اس منزلت کی قدر جان لے جس میں اللہ نے اسے اتارا ہے، تو وہ اس پر خوشی سے اپنے وجود سے فنا (الفناء) ہو جائے۔\n\nپھر بندہ اس ثنا میں یا تو اللہ کی ثنا اسماء تنزیہ (Transcendence) کے ذریعے کرتا ہے یا اسماء افعال (Actions) کے ذریعے۔ ہمارے نزدیک کشف (الکشف) کی رو سے مقدم یہ ہے کہ اسماء تنزیہ سے ابتدا کی جائے، اور عقلی نظر کی رو سے اسماء افعال سے۔ پس مفعولات کا مشاہدہ ضروری ہے۔ پہلا مفعول جس کا میں مشاہدہ کرتا ہوں وہ میرے سب سے قریب ہے، یعنی میری اپنی ذات۔ پس میں اس کی ثنا اس کے ان اسماء فعل کے ذریعے کرتا ہوں جو اس نے مجھ میں اور مجھ پر کیے ہیں۔ اور جب بھی میں اپنی ذات سے کسی دوسرے کی طرف منتقل ہونے کا ارادہ کرتا ہوں، تو میں ایک اور حادثے پر مطلع ہوتا ہوں جو وہ مجھ میں پیدا کرتا ہے، جس کے ذریعے وہ مجھ سے اپنی ثنا کا مطالبہ کرتا ہے۔ پس میں ہمیشہ اسی طرح ابد الآباد تک، دنیا اور آخرت میں، رہوں گا، اور ایسا ہی ہونا ہے۔ پس غور کرو کہ مجھ پر اللہ کی ثنا کے کتنے مقامات باقی رہ جاتے ہیں جو میرے علاوہ مخلوقات کے مشاہدے سے متعلق ہیں۔ اور یہ مشاہدہ اس بات کا تقاضا کرتا ہے کہ: لَا أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ (میں تیری ثنا کا احاطہ نہیں کر سکتا، تو ویسا ہی ہے جیسا تو نے خود اپنی ثنا کی)۔ اور اسی تکمیل کے لیے صدیق اکبر رضی اللہ عنہ نے فرمایا: العجز عن درك الإدراك إدراك (ادراک کے ادراک سے عاجز ہونا ہی ادراک ہے)۔\n\nاور جب میں اپنی ذات اور مخلوقات سے فارغ ہو جاؤں گا، تب میں اسماء تنزیہ کے ذریعے اس کی ثنا شروع کروں گا۔ اور اپنی ذات سے فارغ ہونا محال ہے۔ پس اکوان (مخلوقات) سے فارغ ہو کر اکوان کا مشاہدہ کرنا محال ہے۔ پس اسماء تنزیہ تک پہنچنا محال ہے۔ لہٰذا جب تم کسی عام شخص کو یا کسی ایسے شخص کو جو اللہ کی معرفت (المعرفۃ) کا دعویٰ کرتا ہو، دیکھو کہ وہ مشاہدے کے طریقے پر اسماء تنزیہ کے ذریعے اللہ کی ثنا کر رہا ہے، یا اسماء افعال کے ذریعے اس حیثیت سے کہ وہ دوسروں سے متعلق ہیں (نہ کہ خود سے)...\n\n### [جو اپنی ذات سے اندھا ہو گیا]\n\nتو جان لو کہ اس نے نہ تو اپنی ذات کو پہچانا اور نہ ہی اس کا مشاہدہ کیا، اور نہ ہی اس میں ذات حق (الحق) کے آثار کو محسوس کیا۔ اور جو شخص اپنی ذات سے اندھا ہو گیا جو اس کے سب سے قریب ہے، تو وہ حقیقت میں دوسروں سے زیادہ اندھا اور زیادہ گمراہ ہے۔ اللہ تعالیٰ نے فرمایا: وَمَنْ كَانَ فِي هَذِهِ أَعْمَىٰ (اور جو شخص اس دنیا میں اندھا رہا) یعنی دنیا میں، اور اسے دنیا (الدنيا) اس لیے کہا گیا کہ یہ آخرت سے ہمارے زیادہ قریب ہے۔ اللہ تعالیٰ نے فرمایا: إِذْ أَنْتُمْ بِالْعُدْوَةِ الدُّنْيَا (جب تم قریب کی جانب تھے) یعنی قریبی کنارے پر وَهُمْ بِالْعُدْوَةِ الْقُصْوَىٰ (اور وہ دور کی جانب تھے) یعنی دور کے کنارے پر فَهُوَ فِي الْآخِرَةِ أَعْمَىٰ وَأَضَلُّ سَبِيلًا (تو وہ آخرت میں بھی اندھا اور زیادہ گمراہ ہو گا)۔\n\nپھر تمہیں معلوم ہونا چاہیے کہ تم اس کے اسماء میں سے ہو، بلکہ اس کے اسماء میں سب سے کامل اسم ہو۔ یہاں تک کہ بعض شیوخ، جیسے ابو یزید بسطامی، سے کسی نے اسم اعظم (الاسم الأعظم) کے بارے میں پوچھا تو انہوں نے فرمایا: \"مجھے اصغر دکھاؤ تاکہ میں تمہیں اعظم دکھاؤں۔\" اللہ کے تمام اسماء عظیم ہیں۔ پس سچائی اختیار کرو اور جو اسم الٰہی چاہو لے لو۔\n\nمیں مرسیہ میں شیخ ابو احمد بن سید بون سے ملا۔ ایک شخص نے ان سے اسم اعظم (الاسم الأعظم) کے بارے میں پوچھا تو انہوں نے اسے ایک کنکری ماری، یہ اشارہ کرتے ہوئے کہ تم ہی اللہ کا اسم اعظم ہو۔ یہ اس لیے کہ اسماء دلالت کے لیے وضع کیے گئے ہیں، اور ان میں اشتراک ممکن ہے۔ اور تم اللہ پر سب سے زیادہ دلالت کرنے والے اور سب سے بڑے دلیل ہو۔ لہٰذا تمہارے لیے جائز ہے کہ تم اپنی ذات کے ذریعے اس کی تسبیح کرو۔ اگر تم کہو کہ کیا تمام اکوان (مخلوقات) کا یہی حال ہے؟ تو ہم کہیں گے: ہاں، مگر تم تمام اکوان میں اس پر سب سے کامل اور سب سے عظیم دلیل ہو، کیونکہ اس نے تمہیں اپنی صورت (صورته) پر پیدا کیا اور تمہیں اپنے دونوں ہاتھوں کے درمیان جمع کیا۔ اور یہ بات اس نے تمہارے علاوہ کسی اور موجود کے بارے میں نہیں کہی۔\n\nاگر تم کہو کہ اس نے خود کو عظمت سے متصف کیا ہے، تو ہم کہیں گے کہ اس نے تمہیں بھی عظمت سے متصف کیا ہے اور تمہیں اس کی تعظیم کی طرف بلایا ہے، چنانچہ فرمایا: وَمَنْ يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِنْ تَقْوَى الْقُلُوبِ (اور جو شخص اللہ کی نشانیوں کی تعظیم کرتا ہے تو یہ دلوں کے تقویٰ میں سے ہے)۔ اور تم سب سے عظیم شعائر میں سے ہو۔ پس اللہ تعالیٰ کا فرمان فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ (پس اپنے رب عظیم کے نام کی تسبیح کرو) اس بات کو شامل ہے کہ تم اپنے وجود کے ذریعے اور اپنی ذات میں غور و فکر کے ذریعے اس کی تنزیہ کرو، تو تم اس چیز پر مطلع ہو جاؤ گے جو اس نے تم میں آنکھوں کی ٹھنڈک کے طور پر چھپا رکھی ہے۔ پس تم ہی اس کا اسم عظیم ہو۔\n\nاور تمہاری اس کی صورت پر ہونے کی وجہ سے تمہارے اور اس کے درمیان تعلق (العلاقة) ثابت ہوا، چنانچہ فرمایا: يُحِبُّهُمْ وَيُحِبُّونَهُ (وہ ان سے محبت کرتا ہے اور وہ اس سے محبت کرتے ہیں)۔ اور محبت محب اور محبوب کے درمیان ایک تعلق ہے، اور اس نے اسے صرف اپنے مومن بندوں میں رکھا ہے۔ اس میں کوئی پوشیدگی نہیں کہ شکل اپنی شکل سے الفت رکھتی ہے، اور وہ انسان کامل (الإنسان الکامل) ہے جس کی کوئی مثال نہیں لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثل کوئی چیز نہیں)۔\n\nاور تمہاری صورت میں حرف لام الف (لآ) موجود ہے، کیونکہ دیکھنے والے پر یہ التباس ہوتا ہے کہ دونوں رانوں میں سے کون سی لام ہے اور کون سا الف ہے، کیونکہ لآ میں مشابہت ہے اور ان میں سے کوئی بھی دوسرے پر غالب نہیں آتا۔ اسی لیے لام الف حروف میں سے ہے، اگرچہ یہ دو موجودہ ذاتوں سے مرکب ہے جو علم میں موجود ہیں لیکن شکل میں جدا نہیں ہیں۔ اسی لیے ہمارے افعال میں یہ اشکال پیدا ہوتا ہے کہ وہ ہمارے لیے ہیں یا اللہ کے لیے؟ اور اس میں کوئی قابل اعتماد دلیل نہیں ملتی۔\n\nالف (الألف) کے لیے مرتبے میں احدیت (الأحدية) ہے اور عدد میں اولیت ہے۔ اور لام (اللام) کے لیے عقد کے پہلے مراتب میں سے تیسرا مرتبہ ہے۔ اور تین (الثلاثة) پہلا طاق عدد ہے۔ پس احد (الأحد) اور فرد (الفرد) کے درمیان وتر ہونے کی حیثیت سے مناسبت ظاہر ہوئی۔ پس وہ احدیت میں اول ہے اور انسان کامل (الإنسان الکامل) فردیت (الفردية) میں اول ہے۔ پس یہ جان لو۔\n\nاسی لیے انسان کی نشأت میں آیا ہے کہ وہ علقہ (خون کا لوتھڑا) ہے جو تعلق (العلاقة) سے ہے۔ اور علقیت اس کی تخلیق کے اطوار میں تیسرے مرتبے پر ہے، پس یہ فردیت میں ہے جو عدد کے مراتب میں لام کی جہت سے اس کے لیے مناسب ہے۔ اللہ تعالیٰ نے فرمایا: خَلَقْنَا الْإِنْسَانَ مِنْ سُلَالَةٍ مِنْ طِينٍ (ہم نے انسان کو مٹی کے خلاصے سے پیدا کیا) اور یہ پہلا مرتبہ ہے۔ ثُمَّ جَعَلْنَاهُ نُطْفَةً فِي قَرَارٍ مَكِينٍ (پھر ہم نے اسے ایک محفوظ جگہ میں نطفہ بنا دیا) یہ دوسرا ہے۔ ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً (پھر ہم نے نطفے کو لوتھڑا بنا دیا) اور یہ فردی مرتبہ ہے، اور اس کے لیے جمع (الجمع) ہے۔ اور انسان الٰہی حضرت (الحضرة الإلهية) کی صورت اور عالم کبیر (العالم الکبیر) کی صورت کا محل جمع ہے۔\n\nاسی لیے انسان کا وجود ذات حق (الحق) اور عالم کبیر کے درمیان ہے۔ اور انسان کے علاوہ تمام مولدات (پیدا ہونے والی چیزیں) انسان کے وجود سے جدا ہو گئیں، کیونکہ انسان کے علاوہ تمام مولدات عالم سے موجود ہوئے ہیں، پس وہ بغیر باپ کے ماں سے ہیں، جیسے عیسیٰ بن مریم صلوات اللہ علیہ کا وجود۔ ہم نے تمہیں اس پر اس لیے متنبہ کیا تاکہ تم یہ نہ کہو کہ تمام مولدات اللہ اور عالم کے درمیان موجود ہوئے، حالانکہ معاملہ ایسا نہیں تھا۔ ورنہ اللہ کے اس قول کا کوئی فائدہ نہ ہوتا کہ اس نے آدم کو اپنی صورت پر پیدا کیا۔\n\nاور اگر صورت وہی ہوتی جو ہمارے بعض اصحاب، بلکہ ہمارے شیوخ، گمان کرتے ہیں کہ وہ ذات اور سات صفات ہیں، تو یہ صحیح نہیں ہے، کیونکہ یہ معلوم ہے کہ حیوان کی ایک ذات ہے اور وہ زندہ، عالم، ارادہ رکھنے والا، قادر، متکلم، سننے والا، دیکھنے والا ہے۔ تو اس صورت میں انسان کی صورت کے ساتھ خصوصیت باطل ہو جاتی۔ یہ خصوصیت صرف اس کی تشریف (عزت افزائی) کے لیے آئی ہے۔ پس اس کے علاوہ کوئی صورت باقی نہیں رہتی جو انہوں نے ذکر کی ہے۔ اگر تم حیوان سے علم کی نفی کرو گے تو تم حس (احساس) کا مقابلہ کرو گے، کیونکہ حیوان علم پر فطرت کیا گیا ہے اور اس کی طرف وحی کی جاتی ہے، جیسا کہ فرمایا: وَأَوْحَىٰ رَبُّكَ إِلَى النَّحْلِ (اور آپ کے رب نے شہد کی مکھی کو وحی کی)۔ اگر تم کلام میں جھگڑا کرو تو ہم کہیں گے کہ اس کا کلام اس کی مزاج کے لائق جنس سے ہے۔\n\nلیکن مکاشف (الکاشف) کے ساتھ اس کی ضرورت نہیں، کیونکہ وہ وہی دیکھتا ہے جو ہم دیکھتے ہیں اور وہی جانتا ہے جو ہم جانتے ہیں۔ اگر تم کہو کہ ہمارا کلام ہی حقیقت ہے، تو ہم کہیں گے کہ وہ کلام جو تم اپنے لیے ثابت کرتے ہو، اگر اس سے تمہاری مراد مرکب آوازیں اور حروف ہیں، تو تمہارے نزدیک اللہ کا کلام اس کے خلاف ہے، وہ نہ آواز ہے اور نہ حرف، اگر تم اشعری ہو، اور اگر تم معتزلی ہو تو کلام اس کا ہے جس نے اسے پیدا کیا۔ اور اگر تمہارے نزدیک کلام سے مراد کلام نفس (کلام نفسی) ہے، تو وہ حیوان میں بھی موجود ہے۔ بلی کی آواز جب وہ کھانے کی چیز مانگتی ہے، اس کی آواز سے مختلف ہوتی ہے جب وہ جفتی کے لیے مانگتی ہے۔ پس اس نے اپنی آواز سے اس چیز کا اظہار کیا جو اس کے نفس میں پیدا ہوئی تھی۔\n\nاگر تم کہو کہ جو نفس میں ہے وہ ارادہ (إرادة) ہے، کلام نہیں، تو ہم کہیں گے کہ اسی طرح انسان کے نفس میں جو ہے وہ ارادہ ہے، کلام نہیں۔ اگر تم کہو کہ استاد ابو اسحاق اسفرائینی نے کلام نفس پر جو دلیل دی ہے کہ جو گزر چکا ہے وہ مراد نہیں ہو سکتا، لہٰذا وہ ارادہ نہیں ہے، یعنی جو نفس میں ہے، تو ہم کہیں گے کہ وہ گزرے ہوئے کا علم ہے اور تم پر التباس ہو گیا ہے۔ اور ان کے پاس کلام نفس پر اس سے زیادہ واضح کوئی دلیل نہیں ہے، اور جیسا کہ تم نے دیکھا کہ یہ بھی کمزور ہے۔\n\nپس اس سے یہ نتیجہ نکلا کہ نبی اکرم صلی اللہ علیہ وسلم کا فرمان \"على صورته\" (اپنی صورت پر) سے مراد وہ نہیں ہے جو ہمارے اصحاب نے ذات اور صفات کا ذکر کیا ہے، اور تمام جماعت اسی پر ہے۔ پس اس خزانے کو تلاش کرو یہاں تک کہ اللہ تم پر اسے کھول دے، جیسا کہ اس نے اپنی مخلوق میں سے جسے چاہا اس پر کھولا، جیسا کہ اس کے قول میں ہے: يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَىٰ مَنْ يَشَاءُ مِنْ عِبَادِهِ (وہ اپنے بندوں میں سے جس پر چاہتا ہے اپنے حکم سے روح نازل کرتا ہے)۔\n\nاور ان علوم میں سے جو اس مقام کے ساتھ خاص ہیں، یہ بھی ہے کہ جب اللہ نے عقل اول (العقل الأول) کو پیدا کیا تو اسے وہ علم عطا کیا جس سے اسے اپنے سے کم تر پر شرف حاصل ہوا، اس کے باوجود اس کے بارے میں یہ نہیں فرمایا کہ وہ صورت پر مخلوق ہے۔ حالانکہ وہ مفعول ابداعی ہے، جیسے نفس مفعول انبعاثی ہے۔\n\nپھر جب اللہ نے انسان کامل (الإنسان الکامل) کو پیدا کیا تو اسے عقل اول کا مرتبہ عطا کیا اور اسے وہ علم سکھایا جو عقل کو معلوم نہ تھا، یعنی صوری حقیقت (الحقيقة الصورية) جو ذات حق (الحق) کی طرف سے اس کا خاص چہرہ (الوجه الخاص) ہے۔ اور اسی کی وجہ سے وہ تمام مخلوقات سے بڑھ گیا، اور اسی کی وجہ سے وہ عالم کا مقصود تھا۔ پس کوئی موجود صورت میں ظاہر نہ ہوا مگر انسان کے ذریعے۔ اور عقل اول اپنی عظمت کے باوجود صورت کا ایک جزو ہے۔ اور انسان کے علاوہ ہر موجود جزویت میں ہے۔\n\nاسی لیے کسی مخلوق نے اتنی سرکشی نہیں کی جتنی انسان نے کی اور اپنے وجود میں اتنا بلند ہوا کہ اس نے ربوبیت کا دعویٰ کر دیا۔ اور سب سے بڑا نافرمان ابلیس ہے، اور وہ وہی ہے جو کہتا ہے: إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ (میں اللہ سے ڈرتا ہوں جو تمام جہانوں کا رب ہے) جب وہ انسان کو کفر کا وسوسہ ڈالتا ہے۔ اور اس نے کبھی ربوبیت کا دعویٰ نہیں کیا، بلکہ صرف آدم پر تکبر کیا۔ اگر انسان میں صورت کی کاملیت نہ ہوتی تو وہ ربوبیت کا دعویٰ نہ کرتا۔\n\nپس خوشخبری ہے اس شخص کے لیے جو ایسی صورت پر ہو جو اسے یہ بلند مرتبہ عطا کرتی ہے، لیکن اس صورت نے اس پر اثر نہ کیا اور اسے اس کی عبودیت (عبودیتہ) سے باہر نہ نکالا۔ یہی وہ عصمت (العصمة) ہے جس کا وافر حصہ اللہ نے ہمیں اس وقت عطا کیا ہے۔ پس اللہ اسے ہماری باقی ماندہ عمر میں ہم پر باقی رکھے یہاں تک کہ ہم اس پر قبض کیے جائیں، میں اور میرے تمام بھائی اور محبین، اپنے فضل سے، اس کے سوا کوئی رب نہیں۔\n\nاور اسی مقام سے اس شخص کی سزا معلوم ہوتی ہے جس نے اپنی قدر نہ پہچانی اور اپنی حد سے تجاوز کیا، اور اس صورت کے ذریعے اس چیز سے پردہ کر لیا جو ذات حق (الحق) نے اس کی تخلیق میں اس سے چاہی تھی، جیسا کہ اس نے اپنی شریعت میں خبر دی: وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ (اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا)۔\n\nپھر تمہیں معلوم ہونا چاہیے کہ اس مقام میں قربت (القربۃ) کا علم یہ ہے کہ جو شخص اس پر مطلع ہو جائے اور اس کا مشاہدہ کرے، وہ اپنے رب کی طرف سے اس چیز کے بارے میں واضح دلیل پر ہو گا جس کے ذریعے وہ اس کا قرب حاصل کرتا ہے، اور وہ وہی ہے جس پر ہم نے تمہیں متنبہ کیا ہے۔\n\nاور خاص طور پر اس مقام میں تقدیر (التقدیر) اور ایجاد (الإیجاد) کے درمیان جمع کرنے کا علم شامل ہے۔ اور تم اسے کسی بھی مقام میں تفصیل سے نہیں پاؤ گے جس میں ان دونوں کے درمیان کوئی واسطہ نہ ہو، کیونکہ تقدیر عالم زمان میں نفس الامر میں ایجاد سے مقدم ہوتی ہے۔ اسی لیے کہا گیا ہے کہ بعض لوگ خلق کرتے ہیں مگر کاٹتے نہیں (یعنی تقدیر کرتے ہیں مگر ایجاد نہیں کرتے)۔\n\n### [یہ کہ ازل میں کوئی چیز نہ تھی جس سے ابد میں ہونے والی چیز کی تقدیر کی جائے سوائے الہو کے]\n\nپس جان لو کہ ازل میں کوئی چیز نہ تھی جس سے ابد میں ہونے والی چیز کی تقدیر کی جائے سوائے الہو (الہو) کے۔ پس الہو نے چاہا کہ وہ اپنے آپ کو ایک کمالی رؤیت (رؤية كمالية) کے ساتھ دیکھے جو اس کے لیے ہو اور اس کے حق میں الہو (غیب مطلق) کا حکم زائل ہو جائے۔ پس اس نے اعیان ثابتہ (الأعیان الثابتۃ) میں نظر ڈالی، تو اسے کوئی ایسی عین نظر نہ آئی جو اس نظر سے انانیت (I-ness) کا یہ مرتبہ عطا کرے سوائے انسان کامل (الإنسان الکامل) کی عین کے۔ پس اس نے اس کی تقدیر کی اور اس کا مقابلہ اس سے کیا۔ تو وہ موافق آئی، سوائے ایک حقیقت کے جو اس سے کم تھی، اور وہ اس کا اپنے لیے وجود تھا۔ پس اس نے اسے اس کے لیے موجود کیا، تو دونوں صورتیں تمام وجوہ سے مطابقت کر گئیں۔\n\nاور اس نے اس عین کی تقدیر ہر اس چیز پر کی تھی جسے اس نے انسان کے وجود سے پہلے موجود کیا تھا، جیسے عقل، نفس، ہباء، جسم، فلک، عنصر اور مولد۔ لیکن ان میں سے کسی نے بھی کمالی مرتبہ عطا نہ کیا سوائے انسانی وجود کے۔ اور اس نے اسے انسان (إنسان) نام دیا کیونکہ اس نے کمالی مرتبے سے انس (آنس - الفت) حاصل کیا۔ پس جو انس اس نے اس میں دیکھا، اس کی وجہ سے اس کا نام انسان پڑا۔ جیسے عمران (عمران)۔ پس اس میں الف اور نون عربی زبان میں زائد ہیں۔\n\nاگر تم کہو کہ پھر یہ منصرف (fully declinable) کیوں ہے اور عمران (عمران) غیر منصرف (partially declinable) کیوں ہے؟ تو ہم کہیں گے کہ عمران میں دو علتیں ہیں جنہوں نے اسے صرف (تصرف) سے روکا ہے، اور وہ زیادتی اور تعریف ہیں، یعنی علمیت کی تعریف۔ اور انسان ایسا نہیں ہے، کیونکہ اس میں ایک ہی علت ہے اور وہ زیادتی ہے۔ اور انسان کا لفظ انسان کے لیے اسم علم نہیں ہے، بلکہ اس کی تعریف تب ہوتی ہے جب اسے آدم (آدم) نام دیا جائے۔ پس جب اسے آدم نام دیا گیا تو وہ تعریف اور وزن کی وجہ سے غیر منصرف ہو گیا، اور اسے ایسے نام سے موسوم کیا گیا جو ایک ایسی علت سے معلول ہے جو اسے صرف (تصرف) سے روکتی ہے، جو تمام مراتب میں تصرف ہے۔ تاکہ اس کی الٰہی صورت میں یہ معلوم ہو جائے کہ وہ مقہور، ممنوع، عبد، ذلیل، محتاج ہے۔ کیونکہ الٰہی صورت اسے تمام مراتب میں تصرف عطا کرتی ہے۔ اسی لیے اسے انسان نام دیا گیا، پس وہ رفع، خفض اور نصب ہوا، اور اسماء میں کوئی دوسرا مرتبہ نہیں ہے۔ پس وہ صورت کے لحاظ سے انسان ہے، اور اسی سے وہ تمام مراتب میں تصرف کرتا ہے۔ اور اسے صرف سے روکا گیا اس حیثیت سے کہ وہ اپنے موجد کی گرفت میں ہے، جو ایک ایسا بادشاہ ہے جو اسے جب تک چاہے باقی رکھے اور جب چاہے معدوم کر دے۔\n\nپس صورت کے ذریعے اس نے خلافت (الخلافۃ) اور تصرف حاصل کیا، اور انسانیت (الإنسانیۃ) کا نام۔ پس اس کی انسانیت سے یہ ثابت ہوا کہ وہ ایک غیر ہے جس سے انس حاصل کیا جاتا ہے۔ اور خلافت سے یہ ثابت ہوا کہ وہ ایک فقیر بندہ ہے، جسے اپنے خلیفہ بنانے والے کی طرف سے کوئی قوت نہیں ملی، بلکہ خلافت اسے پہنائی گئی ہے، جسے وہ جب چاہے زائل کر دے اور کسی دوسرے پر رکھ دے، جیسا کہ ہو چکا ہے۔ اسی لیے اللہ تعالیٰ نے فرمایا: هُوَ الَّذِي جَعَلَكُمْ خَلَائِفَ فِي الْأَرْضِ (وہی ہے جس نے تمہیں زمین میں خلیفہ بنایا)۔ اور زمین (الأرض) خفض (پستی) کا محل ہے، کیونکہ خفض بلند جناب کے لائق نہیں۔ اسی لیے اس نے اس میں اپنا نائب مقرر کیا تاکہ یہ معلوم ہو جائے کہ وہ بندہ ہے۔ اگر انسان کو آسمان میں خلیفہ بنایا جاتا، اس کے صورت پر ہونے کے باوجود، تو وہ صورت اور مکان کی بلندی میں اپنی عبودیت کا مشاہدہ نہ کر پاتا، تو شاید وہ سرکشی کرتا۔ اور اگر وہ سرکشی کرتا تو اس سے انس نہ ہوتا۔ اسی لیے جو کوئی مزاحمت کرتا ہے وہ توڑ دیا جاتا ہے۔\n\nاللہ تعالیٰ نے فرمایا: الكبرياء ردائي والعظمة إزاري من نازعني واحدا منهما قصمته (کبریائی میری چادر ہے اور عظمت میرا تہبند ہے۔ جو کوئی ان میں سے کسی ایک میں بھی مجھ سے جھگڑا کرے گا، میں اسے توڑ ڈالوں گا)۔\n\nپس بندہ ذات حق (الحق) کی کبریائی میں چھوٹا ہے، کیونکہ یہ الٰہی کبریائی اسے صغار (چھوٹا پن) کا لباس پہناتی ہے۔ اور وہ ذات حق (الحق) کی عظمت میں حقیر ہے، کیونکہ یہ الٰہی عظمت اسے حقارت کا لباس پہناتی ہے۔ پس صغار بندے کی چادر ہے اور حقارت اس کا تہبند ہے۔ پس انسانوں میں سے جو کوئی ان دونوں میں سے کسی ایک میں بھی اس سے جھگڑا کرے گا، یعنی ان میں شرکت کا مطالبہ کرے گا، تو اسے عصمت (حفاظت) دی جائے گی، توڑا نہیں جائے گا، اور اسے رحم کیا جائے گا جس سے وہ محروم رہا۔ اور اسی لیے اسے پیدا کیا گیا۔\n\nپس اے انسان! غور کر کہ اس نے تجھے انسان کیوں کہا، اور غور کر کہ اس نے تجھے خلیفہ کیوں کہا، اور غور کر کہ پہلی صورت میں ظاہر ہونے پر اس نے تجھے آدم کیوں کہا۔ اور ان اسماء کی حقیقت جو تقاضا کرتی ہے اس سے تجاوز نہ کر، اور یہ تجھ سے غائب نہ ہوں، تاکہ تو کامیاب ہونے والوں میں سے ہو جائے۔\n\nاسی لیے کامل خلافت کا اختتام ایک منصرف نام پر ہوا، اور وہ محمد صلی اللہ علیہ وسلم ہیں، تاکہ اس کے ذریعے اس کمی کو پورا کیا جائے جو آدم کو تصرف سے روکا گیا تھا۔ کیونکہ اسے صرف ایک علت کی وجہ سے روکا گیا تھا جو اس میں قائم تھی، اور وہ اس نوع میں اول تھے۔ پس اسے ایک غیر منصرف نام سے عصمت دی گئی تاکہ یہ معلوم ہو جائے کہ وہ حجر (پابندی) کے تحت مقہور ہے، اور وہ صرف اسی میں تصرف کر سکتا ہے جس کی حد اس کے لیے مقرر کی گئی ہے۔\n\nپھر اس کے بعد خلفاء کی ایک جماعت کو تصرف عطا کیا گیا، جیسے نوح، شیث، شعیب، صالح، محمد، ہود اور لوط وغیرہ، کیونکہ پہلے خلیفہ کے ذریعے اس چیز کا وقوع محفوظ ہو گیا جس سے ڈر تھا۔ پھر ان خلفاء کے درمیان ایسے اسماء بھی آئے جو غیر منصرف ہیں، جیسے ادریس، ابراہیم، اسماعیل، اسحاق، یعقوب، سلیمان اور داؤد۔ یہ انسان کو تعلیم دینے کے لیے ہے کہ جب وہ اللہ کے راستے پر چلے، پھر اسباب کو ترک کرنے اور اللہ پر بھروسہ کرنے کے بعد اسباب کو اختیار کرنے اور ان پر رکنے کی طرف لوٹے، کیونکہ ذات حق (الحق) نے انہیں وضع کیا ہے اور امور کو ان سے جوڑ دیا ہے، حالانکہ اس کا حال اللہ پر بھروسہ کرنا ہے۔ اور طبع کی عادت الفت ہے، اور وہ اپنے ساتھی کو اس چیز پر بھروسہ کرنے کی طرف کھینچتی ہے جس سے اسے الفت ہے، جیسا کہ ہم نے کہا، کیونکہ وہ انسان ہے جو اپنی مانوس چیز سے انس رکھتا ہے۔ پس شاید اس کے اندر سبب پر بھروسہ آ جائے، تو اللہ پر اس کا بھروسہ کمزور ہو جائے۔ پس وہ وقتاً فوقتاً اسباب کو ترک کر کے اپنی جان کا جائزہ لیتا ہے، جیسا کہ اللہ نے خلفاء کے اسماء کے ساتھ کیا، ایک وقت انہیں ایسے نام سے پکارا جو ان کے لیے تصرف کا تقاضا کرتا تھا، اور ایک وقت انہیں ایسے نام سے پکارا جو انہیں تصرف سے روکتا تھا، تاکہ انہیں تعلیم دی جائے کہ وہ کسی ممنوع اور خوفناک چیز میں نہ پڑیں۔ اللہ تعالیٰ نے فرمایا: عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ (اس نے انسان کو وہ سکھایا جو وہ نہیں جانتا تھا)۔\n\nاسی لیے یہ اسماء جو صرف سے روکتے ہیں بعض خلفاء میں پائے گئے۔ اور جنہیں تصرف عطا کیا گیا، وہ دو قسموں پر ہیں: ان میں سے کچھ وہ ہیں جنہیں ظاہری اور معنوی دونوں طرح کا تصرف عطا کیا گیا، اور یہ کامل تصرف ہے۔ ان کے لیے کامل اسم ہے، جیسے محمد، صالح، شعیب، اور ہر وہ اسم جو ان خلفاء میں سے کسی ایک کے لیے ظاہری طور پر منصرف ہے۔ دوسری قسم وہ ہے جنہیں صرف معنوی تصرف عطا کیا گیا، ظاہری نہیں، پس ان میں کوئی ایسی علت نہیں تھی جو انہیں معنی میں صرف سے روکتی، لیکن ان کے آخر میں حرف علت تھا جس نے انہیں ظاہر میں تصرف سے روک دیا، پس وہ مقصور (Restricted) ہو گئے، اور اس اسم کو مقصور کہا گیا، جیسے موسیٰ، عیسیٰ اور یحییٰ۔ پس وہ ظاہر کے بجائے معنی پر مقصور ہو گئے، اور انہیں مقصورہ کہا گیا، یعنی انہیں ظاہر میں تصرف کے درجے سے روک دیا گیا اور اس سے محبوس کر دیا گیا۔ اور اسی میں سے ہے: حُورٌ مَقْصُورَاتٌ فِي الْخِيَامِ (خیموں میں روکی ہوئی حوریں)۔\n\nاور ان میں سے جسے مقصور کیا گیا، وہ حفاظت کے لیے تھا نہ کہ قید کے لیے۔ پس ان کی حفاظت کی گئی، جیسا کہ ان اسماء کی حفاظت کی گئی جو عنایت کی وجہ سے غیر منصرف تھے۔\n\nپھر اللہ تعالیٰ نے جب چاہا کہ وہ ان سے پردہ نہ کریں، تو ان کے حق میں لطف فرمایا، کیونکہ وہ جانتا تھا کہ یہ نشأت کن علتوں کا تقاضا کرتی ہے، کیونکہ کمال کا حکم صرف الٰہی عنایت سے ہی برداشت کیا جا سکتا ہے۔ پس ان پر الٰہی عنایت یہ تھی کہ اس نے ان پر ناقص اسماء (الأسماء النواقص) جاری کیے، تاکہ وہ جان لیں کہ وہ نقص کے مرتبے میں ہیں، اور یہی ان کا الٰہی کمال سے کمال ہے۔ چنانچہ فرمایا: وَالَّذِي جَاءَ بِالصِّدْقِ وَصَدَّقَ بِهِ (اور جو سچائی لایا اور جس نے اس کی تصدیق کی) یعنی محمد صلی اللہ علیہ وسلم۔ پس اس نے ان کے لیے \"الذی\" (الذي) سے کنایہ کیا، اور الذی ناقص اسماء میں سے ہے۔\n\nاور جب اس نے جان لیا کہ مقرب بندہ اپنے نقص کے ظاہر ہونے سے تکلیف محسوس کرتا ہے اور معدوم ہونے اور اپنی اصل کی طرف لوٹنے سے ڈرتا ہے، تو اس نے لطف و کرم کے باب سے اسے انس دیا، چنانچہ اس نے خود کو ناقص اسماء سے موسوم کیا، چنانچہ فرمایا: هُوَ الَّذِي خَلَقَكُمْ (وہی ہے جس نے تمہیں پیدا کیا) اور فرمایا: هُوَ الَّذِي أَنْزَلَ مِنَ السَّمَاءِ (وہی ہے جس نے آسمان سے نازل کیا)۔ اور قرآن میں اللہ تعالیٰ کے لیے ناقص اسماء سے زیادہ کوئی اسم نہیں ہے۔ پس یہ خلفاء کے لیے اطمینان کا باعث تھا، کیونکہ وہ یقین رکھتے ہیں کہ ذات حق (الحق) کے لیے نقص کا کوئی مرتبہ نہیں ہے اور وہ اسے قبول نہیں کرتا، اس کے باوجود اس پر ناقص اسماء جاری ہوئے ہیں۔ پس اگر اسماء اپنی ذات کی وجہ سے مسمیٰ میں اثر کرتے، تو وہ اللہ میں اثر کرتے، حالانکہ وہ اس میں غیر مؤثر ہیں۔ لہٰذا ہم امید کرتے ہیں کہ وہ ہم میں عدم کا اثر نہیں کریں گے، بلکہ ہمارا کمال اس میں ہے کہ وہ ہم میں ہماری عاجزی اور فقر پر قائم رہنے کا اثر کریں۔\n\nاور یہ باب جو ہم نے اس مقام میں کھولا ہے، ایک وسیع باب ہے، اور وقت اس کے بعض تقاضوں کو بیان کرنے کے لیے کافی نہیں ہے۔ پس یہ مقدار کافی ہے۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔\n\nالفتوحات المکیہ (الفتوحات المکیہ) کا انیسواں سفر مکمل ہوا۔ وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (اور تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے)۔",
    "fa": "باب دویست و هشتاد و هشتم در معرفت منزل تلاوت اولی از حضرت موسوی\n\nبرای خداوند باش، همچون «بسم الله» برای بشر *** که از نام اوست، رب (پروردگار) روح و صورت‌ها.\nپس خلق و امر و آفرینش همگی *** از آن اوست، و فرقی میان عقل و سنگ نیست.\nهمچون زاهدی که در بی‌نیازی به او متعالی است *** و میان چشمه (آب) و کلوخ تمایزی نمی‌نهد.\nو عارف متعالی در تنزیه (نزاهت) خود *** برای او تمایز میان چشمه و بینایی (بصر) است.\nزیرا بازگشت به تحقیق، خصلت کسی است *** که منازل را در نشانه‌ها و حصارها می‌بیند.\n\n### [اولین چیزی که خداوند به بنده خود امر کرد، ادب است]\n\nاولین چیزی که خداوند به بنده خود امر کرد، جمع (الجمع) است و آن همان ادب است. و ادب مشتق از مأدبه (مهمانی) است که به معنای اجتماع بر طعام است. همچنین ادب عبارت است از جامعیت تمام خیر.\n\nپیامبر (صلی الله علیه و سلم) فرمود: «إن الله أدبني» (همانا خداوند مرا ادب آموخت)، یعنی مرا در تمام خیرات جمع کرد، زیرا فرمود: «فحسن أدبي» (پس ادب مرا نیکو گردانید).\n\nیعنی مرا محل هر نیکی قرار داد. پس به انسان گفته شد: خیرات را جمع کن، زیرا خداوند بنده خود را در دنیا عاملی جابیه (جمع‌آورنده) قرار داده است که تمام آنچه برای او ترسیم شده است را برای حق (سبحانه) جمع‌آوری کند. پس او در دنیا مشغول جمع کردن آن است. خداوند او را جز برای جمع نیافریده است. اگر آنچه را که به جمع آن امر شده بود، جمع کند و گرد آورد، سعادتمند خواهد بود و حق (خداوند) تمام آنچه را که جمع کرده است به او می‌بخشد و بر او انعام می‌کند. پس پاداش او عین همان چیزی است که جمع کرده، همراه با ثنای نیکوی الهی بر او به خاطر امانت‌داری، عدالت، و دوری از ظلم و خیانت.\n\nو اگر بنده بدی باشد، در امانت خود خیانت می‌کند و آن را به غیر اهلش می‌دهد و آنچه را که به جمع آن امر نشده بود (از آنچه نهی شده بود که خود را در آن وارد کند) جمع می‌کند و جمع آنچه را که به آن امر شده بود، ترک می‌نماید. پس هنگامی که به سوی سرور خود بازگردد و در دیوان محاسبه حاضر شود و اهل دیوان به محاسبه او بنشینند، و شدت هول در حساب خود و حساب دیگران را ببیند، و امینانی را ببیند که بر اساس آنچه برایشان ترسیم شده بود جمع‌آوری کردند و سعادتمند و ایمن شدند، غم و اندوه بر او فزونی می‌یابد. پس برخی از آنان به شفاعت شفاعت‌کننده‌ای بخشیده شده و رها می‌شوند، و برخی دیگر شفیعی ندارند، پس عذاب می‌شوند و در فشار قرار می‌گیرند.\n\nپس هر کس بداند برای چه آفریده شده و بر اساس آن عمل کند، به آسایش ابدی دست می‌یابد، هرچند که در زمان جمع‌آوری خود، در بیم و خطر باشد. با این حال، بهترین چیزی که انسان در زندگی خود جمع می‌کند، علم به خداوند، تخلق به اسماء او، و توقف در آنچه عبودیت او اقتضا می‌کند، و وفای به آنچه مرتبه سرور او از امتثال اوامرش مستحق است، می‌باشد. منزل این امر از اسماء الهی، اسم «رب» است. خداوند (سبحانه) این اسم را در مواضعی از کتاب عزیز خود به عظمت، کرم و علو وصف کرده است و آنچه را که تحت حکم و در دست او قرار داده است، ذکر نموده است.\n\nو برای حرف «باء» در این منزل سلطانی عظیم قرار داده است، زیرا آن را واسطه‌ای میان خداوند و بنده او قرار داده است. زیرا خداوند متعال به بنده خود فرمود: سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى (پروردگار والای خود را تسبیح گوی). پس او را به تنزیه امر کرد. بنده با زبان حال پرسید: با چه چیزی او را تسبیح گوییم؟ خداوند فرمود: فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ (پس پروردگار بزرگ خود را تسبیح گوی). یعنی او را جز با اسماء او تنزیه مکن، نه با چیزی از اکوان او. و اسماء او نزد ما جز از طریق خودش شناخته نمی‌شوند، هرچند این مسئله، مسئله اختلافی میان علمای رسوم (ظاهر) باشد.\n\nپس اگر اسماء او جز از طریق خودش شناخته نشوند و جز با آن‌ها تنزیه نشود، بنده در ثنا گفتن بر حق (الحق) به آنچه خود حق بر خویش ثنا گفته است، جانشین حق شده است، نه به آنچه بنده از نظر خود ابداع کرده است. و چه شرافتی بزرگ‌تر از شرافت کسی است که در ثنا و معرفت (المعرفة) حق، جانشین او شده است؟ پس حق (خداوند) بنده خود را در این رتبه بر خویشتن خلیفه قرار داده است. اگر ثناگوی خداوند به اسماء او، قدر این منزلتی را که خداوند او را در آن جای داده است، می‌دانست، از شدت شادی به آنچه بر آن است، از هستی خود فانی می‌شد (الفناء).\n\nسپس بنده در این ثنا گفتن، یا بر خداوند به اسماء تنزیه (منزه بودن) ثنا می‌گوید یا به اسماء افعال. نزد ما از جهت کشف (الکشف)، مقدم آن است که با اسماء تنزیه آغاز کنی، و از جهت نظر عقلی، با اسماء افعال. پس ناگزیر از مشاهده مفعولات هستی. اولین مفعولی که مشاهده می‌کنم، نزدیک‌ترین به من است و آن نفس من است. پس بر او به اسماء فعلش در من و درباره من ثنا می‌گویم. و هرگاه بخواهم از نفس خود به دیگری منتقل شوم، بر حادث دیگری مطلع می‌شوم که آن را در نفس من ایجاد کرده است، با طلبی که از من می‌خواهد تا بر او ثنا گویم. پس پیوسته چنین خواهم بود تا ابدالآباد، دنیا و آخرت، و جز این نخواهد بود.\n\nپس بنگر چه چیزی از منازل ثنا بر خداوند، از مشاهده غیر من از مخلوقات، بر من باقی می‌ماند. و این مشهد می‌طلبد که بگویم: «لا أحصي ثناء عليك أنت كما أثنيت على نفسك» (نمی‌توانم ثنای تو را بشمارم، تو آن‌گونه‌ای که خود بر خویش ثنا گفته‌ای). و به همین دلیل برای تکمیل این معنا، صدیق (ابوبکر) فرمود: «العجز عن درك الإدراك إدراك» (ناتوانی از درک، خود درک است). و پس از فراغت از خود و از مخلوقات، آنگاه شروع به ثنا گفتن بر او با اسماء تنزیه می‌کنم. و فراغت از نفس من محال است. پس رسیدن به مشاهده اکوان با فراغت از اکوان محال است. پس رسیدن به اسماء تنزیه محال است. اگر کسی از عوام یا مدعیان معرفت (المعرفة) به خداوند را دیدی که بر خداوند به اسماء تنزیه از طریق مشاهده، یا به اسماء افعال از حیث تعلق آن‌ها به غیر او، ثنا می‌گوید...\n\n### [کسی که از نفس خود کور شد]\n\nبدان که او نفس خود را نشناخته و آن را مشاهده نکرده و آثار حق (الحق) را در آن حس نکرده است. و کسی که از نفس خود که نزدیک‌ترین چیز به اوست، کور باشد، در حقیقت از غیر خود کورتر و گمراه‌تر است. خداوند متعال می‌فرماید: وَمَن كَانَ فِي هَذِهِ أَعْمَىٰ (و هر کس در این [دنیا] کور باشد). یعنی در دنیا، و آن را دنیا نامید زیرا به ما نزدیک‌تر از آخرت است. خداوند متعال می‌فرماید: إِذْ أَنتُمْ بِالْعُدْوَةِ الدُّنْيَا (آنگاه که شما در کناره نزدیک‌تر بودید) یعنی نزدیک، وَهُمْ بِالْعُدْوَةِ الْقُصْوَىٰ (و آنان در کناره دورتر بودند). یعنی دور. فَهُوَ فِي الْآخِرَةِ أَعْمَىٰ وَأَضَلُّ سَبِيلًا (پس او در آخرت کورتر و گمراه‌تر است).\n\nسپس بدان که تو از جمله اسماء او هستی، بلکه کامل‌ترین اسم او هستی. تا جایی که برخی از شیوخ، مانند ابویزید بسطامی، وقتی کسی از او درباره اسم اعظم خداوند پرسید، گفت: اسم اصغر را به من نشان دهید تا اسم اعظم را به شما نشان دهم. تمام اسماء خداوند عظیم هستند. پس راستگو باش و هر اسم الهی را که می‌خواهی برگیر. و شیخ ابواحمد بن سید بون را در مرسیه ملاقات کردم و انسانی از او درباره اسم اعظم خداوند پرسید، او سنگی به سمتش پرتاب کرد، که اشاره می‌کرد تو اسم اعظم خداوند هستی. و این بدان سبب است که اسماء برای دلالت وضع شده‌اند و ممکن است در آن‌ها اشتراک وجود داشته باشد، اما تو دلالت‌کننده‌ترین و بزرگ‌ترین دلیل بر خداوند هستی. پس تو می‌توانی او را با وجود خود تسبیح گویی.\n\nاگر بگویی: آیا در مورد تمام اکوان نیز چنین است؟ می‌گوییم: بله، مگر اینکه تو کامل‌ترین و عظیم‌ترین دلیل بر او از میان تمام اکوان هستی، زیرا او (سبحانه) تو را بر صورت خود آفرید و تو را میان دو دست خود جمع کرد، و این را درباره هیچ موجود دیگری نگفت. اگر بگویی: او خود را به عظمت وصف کرده است، می‌گوییم: او تو را نیز به عظمت وصف کرده و تو را به تعظیم خود فراخوانده است و فرموده است: وَمَن يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِن تَقْوَى الْقُلُوبِ (و هر کس شعائر الهی را بزرگ دارد، این از پرهیزگاری دل‌هاست). و تو عظیم‌ترین شعائر هستی. پس قول خداوند متعال: فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ (پس پروردگار بزرگ خود را تسبیح گوی) متضمن این است که او را با وجود خود و با نظر در ذات خود تنزیه کنی، پس بر آنچه در تو از نور چشم‌ها پنهان کرده است، مطلع شوی. پس تو اسم عظیم او هستی. و از آنجا که تو بر صورت او هستی، رابطه میان تو و او ثابت شده است، و فرموده است: يُحِبُّهُمْ وَيُحِبُّونَهُ (او آن‌ها را دوست دارد و آن‌ها نیز او را دوست دارند). و محبت رابطه‌ای میان محب و محبوب است، و آن را جز در مؤمنان از بندگانش قرار نداد. و پنهان نیست که شکل، با شکل خود الفت می‌گیرد. و او (انسان کامل) همان انسان کاملی (الإنسان الکامل) است که در لَيْسَ كَمِثْلِهِ شَيْءٌ (چیزی مانند او نیست) بی‌همتاست. و تو حرف «لام الف» را از صورت داری، زیرا بر بیننده مشتبه می‌شود که کدام یک از دو ران، «لام» است و کدام یک «الف»، به دلیل شباهت در هم‌آمیختگی هر یک از آن‌ها با دیگری. و به همین دلیل، «لام الف» از جمله حروف است، هرچند که از دو ذات موجود در علم ترکیب شده که در شکل از هم جدا نیستند. و به همین دلیل، اشکال در افعال ما، که آیا از ماست یا از خدا، رخ داده است، و در این باره دلیلی که بتوان بر آن تکیه کرد، وجود ندارد. «الف» در مرتبه، احدیت (الأحدية) و اول عدد را دارد، و «لام» مرتبه سوم از اولین مراتب عقد را دارد. و سه، اولین فرد (الأفراد) است. پس تناسب میان احد و فرد از حیث وتریت (فرد بودن) آشکار شد. پس او (حق) در احدیت اول است و انسان کامل (الإنسان الکامل) در فردیت اول است. این را بدان. و به همین دلیل در نشأت انسان آمده است که او علقه (خون بسته) است، و علقه در سومین مرتبه از اطوار خلقت اوست. پس او در فردیتی است که از جهت «لام» در مراتب عدد، با او مناسبت دارد. خداوند متعال می‌فرماید: خَلَقْنَا الْإِنسَانَ مِن سُلَالَةٍ مِّن طِينٍ (انسان را از عصاره‌ای از گِل آفریدیم)، و این اولین مرتبه است. ثُمَّ جَعَلْنَاهُ نُطْفَةً فِي قَرَارٍ مَّكِينٍ (سپس او را نطفه‌ای در قرارگاهی استوار قرار دادیم)، این دومین مرتبه است. ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً (سپس نطفه را به صورت علقه درآوردیم)، و این مرتبه فردی است و جمع (الجمع) از آن اوست. و انسان محل جمع برای صورت حضرت الهی و برای صورت عالم کبیر است. و به همین دلیل، وجود انسان میان حق (الحق) و عالم کبیر است. و تمام مولدات (موجودات متولد شده) به جز انسان، از وجود انسان جدا شدند، زیرا تمام مولدات به جز او، از عالم موجود شده‌اند. پس او (انسان) از مادری بدون پدر است، مانند وجود عیسی بن مریم (صلوات الله علیه). ما تو را بر این امر آگاه ساختیم تا نگویی که تمام مولدات میان خداوند و عالم موجود شده‌اند، زیرا امر چنین نبوده است. وگرنه، فایده‌ای برای قول او (پیامبر) که «آدم را بر صورت خود آفرید» وجود نداشت. و اگر صورت (الصورة) همان چیزی باشد که برخی از اصحاب ما، بلکه شیوخ ما، گمان می‌کنند که ذات و هفت صفت است، این صحیح نیست. زیرا معلوم است که حیوان دارای ذات است و زنده، دانا، مرید، توانا، متکلم، شنوا و بینا است. در این صورت، اختصاص انسان به صورت باطل می‌شد. صورت تنها به جهت تشریف (بزرگداشت) برای او آمده است. پس باقی نمی‌ماند جز اینکه صورت غیر از آن چیزی باشد که ذکر کردند. اگر علم را از حیوان منع کنی، با حس مقابله کرده‌ای، زیرا حیوان بر علم سرشته شده است و به او وحی می‌شود، چنانکه فرمود: وَأَوْحَىٰ رَبُّكَ إِلَى النَّحْلِ (و پروردگار تو به زنبور عسل وحی کرد). اگر در کلام منازعه کنی، می‌گوییم: کلام او از جنسی است که با مزاجش سازگار است. اما مکاشف (اهل کشف) نیازی به این بحث‌ها ندارد، زیرا او آنچه را ما می‌بینیم، می‌بیند و آنچه را ما می‌دانیم، می‌داند. اگر بگویی: پس کلام ما حقیقت است؟ می‌گوییم: اگر منظور تو از کلامی که برای خود ثابت می‌کنی، اصوات و حروف مرکب باشد، پس کلام خداوند نزد تو بر خلاف این است، نه صوت است و نه حرف، اگر اشعری باشی. و اگر معتزلی باشی، کلام از آن کسی است که آن را آفریده است. و اگر کلام نزد تو عبارت از کلام نفس باشد، این در حیوان نیز موجود است. صدای گربه هنگامی که غذا می‌خواهد، با صدای او هنگامی که جفت می‌خواهد، متفاوت است. پس او با صدای خود، آنچه را که نفسش برای او حادث کرده است، بیان می‌کند. اگر بگویی: آنچه ابواسحاق اسفرايینی، استاد، با حدیث نفس استدلال کرده است، مربوط به گذشته است، و گذشته نمی‌تواند مراد باشد، پس آن اراده نیست، یعنی آنچه در نفس است. می‌گوییم: آن علم به گذشته است و بر تو مشتبه شده است. و آن‌ها دلیلی بر کلام نفس واضح‌تر از این ندارند، و همان‌طور که دیدی، این دلیل نیز مخدوش است. پس از این نتیجه می‌شود که قول پیامبر (صلی الله علیه و سلم) «بر صورت او» منظور آن چیزی نیست که اصحاب ما از ذات و صفات ذکر کرده‌اند، و تمام این جماعت بر این عقیده‌اند. پس در جستجوی این گنج باش تا خداوند آن را بر تو بگشاید، همان‌طور که بر هر کس از خلقش که خواست، گشود، در قول او: يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَىٰ مَن يَشَاءُ مِنْ عِبَادِهِ (روح را به فرمان خود بر هر کس از بندگانش که بخواهد، القا می‌کند). و از جمله علومی که به این منزل اختصاص دارد، این است که خداوند هنگامی که عقل اول را آفرید، از علم به او چیزی عطا کرد که به واسطه آن بر مادون خود شرف یافت. با این حال، درباره او نگفت که بر صورت آفریده شده است، با اینکه او مفعول ابداعی است، همان‌طور که نفس مفعول انبعاثی است. هنگامی که خداوند انسان کامل (الإنسان الکامل) را آفرید، مرتبه عقل اول را به او عطا کرد و آنچه را که عقل از حقیقت صوریه (حقیقت صوری) نمی‌دانست، به او آموخت؛ حقیقتی که وجه خاص او از جانب حق (الحق) است. و به واسطه آن بر تمام مخلوقات برتری یافت و مقصود عالم به واسطه او بود. هیچ صورت موجودی جز به واسطه انسان ظاهر نشد. و عقل اول با عظمتش، جزئی از صورت است. و هر موجودی غیر از انسان، تنها در جزئیت است. و به همین دلیل، هیچ یک از خلایق به اندازه انسان طغیان نکرد و در وجود خود بالا نرفت تا ادعای ربوبیت کند. و بزرگ‌ترین عاصیان، ابلیس است، و او کسی است که می‌گوید: إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ (من از خداوند، پروردگار جهانیان، می‌ترسم) هنگامی که انسان را به کفر وسوسه می‌کند. و او هرگز ادعای ربوبیت نکرد، بلکه تنها بر آدم تکبر ورزید، نه بر خداوند. اگر کمال صورت در انسان نبود، ادعای ربوبیت نمی‌کرد. خوشا به حال کسی که بر صورتی است که این منزلت علو را برای او اقتضا می‌کند، اما در او تأثیر نکرده و او را از عبودیتش خارج نساخته است. این همان عصمتی است که خداوند در این زمان، ما را از بهره وافر آن برخوردار ساخته است. پس خداوند آن را بر ما در باقی‌مانده عمرمان تا زمانی که من و تمام برادران و دوستانمان بر آن قبض شویم، به فضل خود باقی بدارد، که پروردگاری جز او نیست. و از این منزل، عقوبت کسی شناخته می‌شود که قدر خود را نشناخت و از حد خود تجاوز کرد و به واسطه صورت، از آنچه حق (الحق) در آفرینش او اراده کرده بود، محجوب ماند، چنانکه در شریعت خود خبر داده و فرموده است: وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ (و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند). سپس بدان که علم قربت (القربة) در این منزل، برای کسی که بر آن وقوف یابد و آن را مشاهده کند، دلیلی روشن از جانب پروردگارش است در آنچه با آن به او تقرب می‌جوید، و آن همان چیزی است که تو را بر آن آگاه ساختیم. و از جمله آنچه این منزل به طور خاص در بر می‌گیرد، علم جمع میان تقدیر و ایجاد است. و این را در هیچ منزلی به تفصیل نمی‌یابی که واسطه‌ای میان آن دو نباشد، زیرا تقدیر در نفس‌الامر در عالم زمان بر ایجاد مقدم است. و به همین دلیل گفته شده است: «و برخی از مردم خلق می‌کنند، اما نمی‌بُرند (اجرا نمی‌کنند)».\n\n### [اینکه در ازل چیزی نبود که آنچه در ابد خواهد بود با آن تقدیر شود، مگر «هو»]\n\nپس بدان که در ازل چیزی نبود که آنچه در ابد خواهد بود با آن تقدیر شود، مگر «هو» (اشاره به ذات الهی). پس «هو» اراده کرد که خود را به رؤیتی کمالی ببیند که از آنِ او باشد و حکم «هو» در حق او زائل شود. پس در اعیان ثابته (الأعیان الثابتة) نظر کرد و هیچ عینی را ندید که نظر به آن، این رتبه انانیت (الأنانة) را بدهد، مگر عین انسان کامل (الإنسان الکامل). پس آن را بر او تقدیر کرد و او را مقابل آن قرار داد. پس موافقت کرد، مگر یک حقیقت که از او ناقص بود، و آن وجودش برای خودش بود. پس آن را برای خودش ایجاد کرد، و دو صورت از تمام وجوه با هم منطبق شدند. و او (حق) آن عین را بر هر آنچه پیش از وجود انسان ایجاد کرده بود، از عقل و نفس و هباء (ماده اولیه) و جسم و فلک و عنصر و مولد، تقدیر کرده بود. اما هیچ یک از آن‌ها رتبه کمالی را نداد، مگر وجود انسانی. و او را «انسان» نامید، زیرا با رتبه کمالی انس گرفت. پس به واسطه انسی که در او دید، او را «انسان» نامید، مانند «عمران». پس الف و نون در آن در زبان عربی زائد هستند. اگر بگویی: پس چرا «انسان» منصرف (صرف‌پذیر) است و «عمران» منصرف نیست؟ می‌گوییم: در «عمران» دو علت وجود دارد که مانع صرف آن شده‌اند، و آن دو عبارتند از: زیادت و تعریف، یعنی تعریف علمیت. و «انسان» چنین نیست، زیرا در آن یک علت وجود دارد و آن زیادت است. و لفظ «انسان» برای انسان اسم عَلَم نیست، بلکه تعریف آن هنگامی است که به «آدم» نامیده شود. پس هنگامی که به «آدم» نامیده شد، به دلیل تعریف و وزن، منصرف نشد. و او به اسمی نامیده شد که معلول به علتی است که مانع صرف آن می‌شود، که همان تصرف در تمام مراتب است، تا در صورت الهی خود بداند که مقهور، ممنوع، بنده و ذلیل و نیازمند است. زیرا صورت الهی به او تصرف در تمام مراتب را می‌دهد. و به همین دلیل به «انسان» نامیده شد، پس رفع و خفض و نصب داده شد، و مرتبه دیگری در اسماء نیست. پس او از حیث صورت، «انسان» است و از آنجا در تمام مراتب تصرف می‌کند. و از حیث اینکه در قبضه موجد خود است، از صرف منع شد؛ پادشاهی که او را تا هر زمان که بخواهد باقی می‌دارد و اگر بخواهد او را معدوم می‌کند. پس به واسطه صورت، به خلافت و تصریف (تصرف) دست یافت، و اسم انسانیت. پس از انسانیت او ثابت شد که او غیری است که با او انس گرفته می‌شود. و از خلافت ثابت شد که او بنده‌ای فقیر است که قدرتی از جانب کسی که او را خلیفه کرده، ندارد، بلکه خلافت بر او خلع شده است و هر زمان که بخواهد آن را زائل می‌کند و بر دیگری قرار می‌دهد، چنانکه واقع شده است. و به همین دلیل خداوند متعال فرمود: هُوَ الَّذِي جَعَلَكُمْ خَلَائِفَ فِي الْأَرْضِ (او کسی است که شما را در زمین جانشین قرار داد). و زمین محل خفض (پستی) است، زیرا خفض شایسته جناب عالی نیست. به همین دلیل، نایبی برای او در آنجا قرار داد تا دانسته شود که او بنده است. اگر انسان را در آسمان با وجود صورتش خلیفه می‌کرد، عبودیت خود را در رفعت صورت و مکان و مکانت مشاهده نمی‌کرد، و چه بسا طغیان می‌کرد. و اگر طغیان می‌کرد، انس با او واقع نمی‌شد. و به همین دلیل، هر کس مزاحمت کند، درهم شکسته می‌شود.\n\nخداوند فرمود: «الکبریاء ردائي والعظمة إزاري من نازعني واحدا منهما قصمته» (کبریا ردای من است و عظمت ازار من؛ هر کس در یکی از آن دو با من ستیزه کند، او را درهم می‌شکنم).\n\nپس بنده در کبرای حق (الحق) کوچک است، زیرا این کبرای الهی، کوچکی را بر او پوشانده است. و او در عظمت حق حقیر است، زیرا این عظمت الهی، حقارت را بر او پوشانده است. پس کوچکی ردای بنده و حقارت ازار اوست. پس هر کس از انسان‌ها در یکی از آن دو با او ستیزه کند، یعنی طلب مشارکت در آن‌ها کند، عصمت می‌یابد نه اینکه درهم شکسته شود، و مورد رحمت قرار می‌گیرد نه اینکه محروم شود. و او برای همین آفریده شده است. پس ای انسان، تأمل کن که چرا تو را «انسان» نامید، و تأمل کن که چرا تو را «خلیفه» نامید، و تأمل کن که چرا تو را «آدم» در اولین صورتی که ظاهر شدی، نامید. و از آنچه حقیقت این اسماء به تو می‌دهد، تجاوز مکن و از آن غافل مشو تا از رستگاران باشی. و به همین دلیل، استخلاف کامل با اسم منصرف (صرف‌پذیر) یعنی محمد (صلی الله علیه و سلم) ختم شد، تا آنچه از تصریف (تصرف) از آدم منع شده بود، جبران شود. زیرا او (آدم) منع نشد مگر به علتی که در او بود، و او در این نوع اول بود. پس با اسم غیر منصرف (صرف‌ناپذیر) عصمت یافت تا دانسته شود که او تحت حجر (محدودیت) و مقهور است و جز در آنچه برای او حد گذاشته شده، منصرف و متصرف نمی‌شود. سپس پس از آن، تصریف به گروهی از خلفا مانند نوح، شیث، شعیب، صالح، محمد، هود، لوط و دیگران داده شد، زیرا با اولی (آدم) ایمنی حاصل شد از وقوع آنچه از آن بیم داشت. سپس در میان این خلفا، اسم‌هایی غیر منصرف مانند ادریس، ابراهیم، اسماعیل، اسحاق، یعقوب، سلیمان و داوود قرار گرفت. این برای آگاه ساختن انسان است که اگر راه خدا را بپیماید و سپس پس از قطع اسباب و اعتماد بر خداوند، به قول به اسباب و توقف در آن‌ها بازگردد، به دلیل اینکه حق (الحق) آن‌ها را وضع کرده و امور را به آن‌ها مرتبط ساخته است، در حالی که حال او اعتماد بر خداوند است و طبع انسان عادت به الفت دارد و صاحب خود را به سوی تکیه بر مأنوس خود می‌کشاند، همان‌طور که گفتیم، زیرا او انسان است و با مأنوس خود انس می‌گیرد. پس چه بسا در او تکیه بر سبب نفوذ کند و اعتمادش بر خداوند متعال ضعیف شود. پس او باید نفس خود را با قطع اسباب، گاهی پس از گاهی، مورد بازرسی قرار دهد، همان‌طور که خداوند با اسماء خلفا چنین کرد؛ گاهی آن‌ها را با اسمی خواند که تصریف را برایشان اقتضا می‌کرد و گاهی با اسمی که آن‌ها را از تصریف منع می‌کرد، تا به آن‌ها بیاموزد که در محظور بیمناک واقع نشوند. خداوند متعال می‌فرماید: عَلَّمَ الْإِنسَانَ مَا لَمْ يَعْلَمْ (به انسان آنچه را نمی‌دانست، آموخت). به همین دلیل، این اسماء که مانع صرف هستند، در برخی از خلفا وجود داشتند. اما کسانی که تصریف به آن‌ها داده شد، بر دو دسته‌اند: دسته‌ای که تصریف ظاهری و معنوی به آن‌ها داده شد، و آن تصریف کامل است. پس آن‌ها اسم کامل دارند، مانند محمد، صالح، شعیب، و هر اسم منصرف ظاهری برای یکی از این خلفا. دسته دیگر، تصریف معنوی به آن‌ها داده شد نه ظاهری. پس آن‌ها علتی نداشتند که در معنی مانع صرف شود، اما آخر اسمشان حرف عله بود که آن حرف، آن‌ها را از تصرف در ظاهر منع کرد. پس مقصور (کوتاه شده) بودند و آن اسم، مقصور نامیده شد، مانند موسی، عیسی و یحیی. پس آن‌ها بر معنی مقصور شدند نه ظاهر. و این‌ها «مقصوره» نامیده شدند، یعنی از درجه تصرف در ظاهر کوتاه شدند و از آن بازداشته شدند. و از همین قبیل است: حُورٌ مَّقْصُورَاتٌ فِي الْخِيَامِ (حوریانی که در خیمه‌ها محصورند). و هر کس از آن‌ها که مقصور شد، به جهت صیانت بود نه زندان. پس مانند این افراد صیانت شدند، همان‌طور که اسماء غیر منصرف به جهت عنایت صیانت شدند. سپس خداوند متعال هنگامی که اراده کرد که آن‌ها را از خودشان محجوب نسازد، از باب لطف در حق آن‌ها، زیرا می‌دانست که این نشأت (خلقت) چه عللی را اقتضا می‌کند، چرا که حکم کمال جز با عنایت الهی قابل تحمل نیست، از جمله عنایت الهی به آن‌ها این بود که اسماء نواقص (ناقص) را بر آن‌ها جاری ساخت، تا بدانند که در مرتبه نقص هستند، و این کمال آن‌ها از کمال الهی است. پس فرمود: وَالَّذِي جَاءَ بِالصِّدْقِ وَصَدَّقَ بِهِ (و کسی که صدق آورد و آن را تصدیق کرد)، یعنی محمد (صلی الله علیه و سلم). پس با «الذی جاء بالصدق» از او کنایه آورد، و «الذی» از اسماء نواقص است. و چون دانست که بنده مقرب از ظهور نقص خود متألم می‌شود و از پیوستن به عدم و بازگشت به اصل خود می‌ترسد، او (سبحانه) از باب لطف و کرم با او انس گرفت. پس خود (سبحانه) را با اسماء نواقص نامید و فرمود: هُوَ الَّذِي خَلَقَكُمْ (او کسی است که شما را آفرید) و فرمود: هُوَ الَّذِي أَنزَلَ مِنَ السَّمَاءِ (او کسی است که از آسمان نازل کرد). و در قرآن برای خداوند متعال بیش از اسماء نواقص نیست. پس این امر، تأمینی برای خلفا بود، زیرا آن‌ها یقین دارند که حق (الحق) مرتبه نقص را ندارد و آن را نمی‌پذیرد، با این حال اسماء نواقص بر او جاری شده است. پس اگر اسماء به ذات خود در مسمی تأثیر می‌گذاشتند، در خداوند تأثیر می‌گذاشتند، در حالی که در او بی‌تأثیرند. بنابراین، ما امید داریم که در ما نیز تأثیر عدم نگذارند، بلکه کمال ما در این است که در ما تأثیر وقوف بر عجز و فقر ما را بگذارند. و این بابی که در این منزل بر خود گشودیم، بابی وسیع است که وقت برای اراده برخی از آنچه می‌دهد، گنجایش ندارد. پس همین مقدار از آن کافی است. وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند). سفر نوزدهم از فتوحات مکیه به پایان رسید. وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (و ستایش از آن خداوند، پروردگار جهانیان است)."
  },
  "page_count": 5
}