{
  "id": 552,
  "title": {
    "ar": "الباب الثاني والخمسون وخمسمائة في معرفة حال قطب كان منزله ولَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جاؤُكَ الآية",
    "en": "Chapter Five Hundred and Fifty-Two: Concerning the Knowledge of the State of a Pole (قطب) Whose Station (منزله) Was [the meaning of] the Verse: \"And if, when they wronged themselves, they had come to you...\" (وَلَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جاؤُكَ الآية)",
    "ur": "باب پانچ سو باون (۵۵۲): ایک قطب (قطب) کے حال کی معرفت میں جس کا منزل یہ تھا: \"اور اگر وہ جب اپنی جانوں پر ظلم کر بیٹھیں تو آپ کے پاس آئیں...\" (وَلَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جاؤُكَ الآية)",
    "fa": "باب پانصد و پنجاه و دوم در معرفت حال قطبی که منزل او این آیه بود: «و اگر آنان هنگامی که بر خود ستم کردند، نزد تو می‌آمدند...» (وَلَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جاؤُكَ الآية)"
  },
  "content": {
    "ar": "## «الباب الثاني والخمسون وخمسمائة في معرفة حال قطب كان منزله ولَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جاؤُكَ الآية»\n\n\n> من كان مثل أبيه في تصرفه *** يأتي إلى الحق مهما نفسه ظلما\n\n\n> واستغفر الله مما قد عصاه به *** وزاد قدرا على مقداره وسما\n\n\n> ثم اجتباه بما قد خصه وهدى *** من الرجوع عليه بالذي حكما\n\n\n> للشرع فيه موازين معدلة *** يقضي بها صاحب الحق الذي علما\n\n\n> في حالة العدل والإحسان يطلبها *** منه ويخرج بالإحسان من فهما\n\n\n### [الظالم نفسه والظالم لنفسه‏]\n\n\nقال الله تعالى مخبرا عن آدم عليه السلام رَبَّنا ظَلَمْنا أَنْفُسَنا فالظالم نفسه لا الظالم لنفسه هو الذي يرجع إلى ربه‏\nفإن الظالم لنفسه ما خرج عن ربه حتى يرجع إليه فإنه من المصطفين فالظالم نفسه يجي‏ء للحق المشروع له الذي ظهر الرسول في حياته بصورته ولذلك كان يقال له رسول الله في التعريف ما كان يقال له محمد فقط وكذلك أخبر الله في قوله مُحَمَّدٌ رَسُولُ الله وقال ولكِنْ رَسُولَ الله وخاتَمَ النَّبِيِّينَ فإذا جاء الظالم إلى الحق المشروع الذي بأيدينا اليوم فإن تجسد له في الصورة المحمدية فيعلم أنه من أصحاب هذا الذكر إما في النوم أو في اليقظة كيف كان وإن لم يتجسد له فما هو ذلك الرجل فإذا تجسد له فلا يخلو أن يستغفر الله هذا الظالم نفسه أو لا يستغفر الله فإن استغفر الله ولم ير صورة الرسول تستغفر له فإنه بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ فيعلم عند ذلك أنه ما استغفر الله فإن استغفاره الله في ذلك الموطن يذكر النبي صَلَّى اللهُ عَليهِ وسَلَّم بالاستغفار لله في حقه فيجد الله عند ذلك تَوَّاباً رَحِيماً وقد ظلمت نفسي وجئت إلى قبره صَلَّى اللهُ عَليهِ وسَلَّم فرأيت الأمر على ما ذكرته وقضى الله حاجتي وانصرفت ولم يكن قصدي في ذلك المجي‏ء إلى الرسول إلا هذا الهجير وهكذا تلوته عليه صَلَّى اللهُ عَليهِ وسَلَّم في زيارتي إياه عند قبره فكان القبول وانصرفت وذلك في سنة إحدى وستمائة فقد أعلمتك كيف يجي‏ء الظالم نفسه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 552: In the Knowledge of the State of a Pole Whose Station Was [the verse] <<وَلَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جاؤُكَ الآية>> (And if, when they wronged themselves, they had come to you... the verse)\n\n> Whoever is like his father in his conduct,\n> Comes to The Real (الحق) whenever his soul wrongs itself.\n> And seeks Allah's forgiveness for what he disobeyed Him with,\n> And increased in stature beyond his measure and ascended.\n> Then He chose him with what He specified for him and guided,\n> By returning to Him through that which He decreed.\n> For the Sacred Law (الشرع) contains balanced scales,\n> By which the possessor of The Real (الحق), who possesses Knowledge (العلم), judges.\n> He seeks them in the state of justice (العدل) and spiritual excellence (الإحسان) from Him,\n> And whoever understands departs with spiritual excellence (الإحسان).\n\n### [The one who wronged himself (الظالم نفسه) and the one who is wronging himself (الظالم لنفسه)]\n\nAllah the Exalted said, informing about Adam (peace be upon him): <<رَبَّنا ظَلَمْنا أَنْفُسَنا>> (Our Lord, we have wronged ourselves). Thus, the one who wronged himself (الظالم نفسه), not the one who is wronging himself (الظالم لنفسه), is the one who returns to his Lord.\n\nFor the one who is wronging himself (الظالم لنفسه) has not departed from his Lord such that he needs to return to Him, for he is among the chosen ones (المصطفين). The one who wronged himself (الظالم نفسه) comes to the prescribed Reality (الحق المشروع) that appeared to the Messenger in his lifetime in his form. For this reason, he was called the Messenger of Allah (رسول الله) in definition, and not merely Muhammad. Likewise, Allah informed in His saying: <<مُحَمَّدٌ رَسُولُ الله>> (Muhammad is the Messenger of Allah), and He said: <<ولكِنْ رَسُولَ الله وخاتَمَ النَّبِيِّينَ>> (But the Messenger of Allah and the Seal of the Prophets).\n\nTherefore, if the wrongdoer (الظالم) comes to the prescribed Reality (الحق المشروع) that is in our hands today, and it is embodied for him in the Muhammadan Form (الصورة المحمدية), then he knows that he is one of the people of this Remembrance (الذكر), whether in sleep or in wakefulness, however that may occur. But if it is not embodied for him, then he is not that man.\n\nIf it is embodied for him, this one who wronged himself (الظالم نفسه) must either seek Allah’s forgiveness or not seek Allah’s forgiveness. If he seeks Allah’s forgiveness but does not see the form of the Messenger seeking forgiveness for him—for He is <<بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ>> (to the believers Kind and Merciful)—then he knows at that point that he has not truly sought Allah’s forgiveness. For his seeking Allah’s forgiveness in that station causes the Prophet (PBUH) to remember seeking forgiveness from Allah on his behalf, and he finds Allah at that point <<تَوَّاباً رَحِيماً>> (Accepting of repentance, Merciful).\n\nI myself wronged my soul and came to his grave (PBUH), and I saw the matter exactly as I have mentioned. Allah fulfilled my need, and I departed. My intention in coming to the Messenger was nothing but this recitation (الهجير). And thus I recited it to him (PBUH) during my visit to him at his grave, and there was acceptance, and I departed. That occurred in the year 601 AH.\n\nThus, I have informed you how the one who wronged himself (الظالم نفسه) comes. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (says the Truth and guides to the way).",
    "ur": "باب نمبر ۵۵۲: اس قطب کے حال کی معرفت میں جس کا مقام یہ آیت تھی: \"اور اگر وہ جب اپنی جانوں پر ظلم کر بیٹھے تھے تو آپ کے پاس آ جاتے...\" (وَلَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جاؤُكَ الآية)\n\nجو شخص اپنے تصرف میں اپنے باپ (آدم) جیسا ہو،\nوہ ذات حق (الحق) کی طرف آتا ہے جب بھی وہ اپنی ذات پر ظلم کرتا ہے۔\n\nاور اللہ سے اس چیز کی مغفرت طلب کرتا ہے جس سے اس نے نافرمانی کی،\nاور اپنے مقام سے بڑھ کر قدر و منزلت میں بلند ہو جاتا ہے۔\n\nپھر اللہ اسے چن لیتا ہے اس چیز کے ذریعے جو اس کے لیے خاص کی اور ہدایت دی،\nاس حکم کے ساتھ اس کی طرف رجوع کرنے سے۔\n\nشریعت (الشرع) میں اس کے لیے عدل کے ترازو ہیں،\nجن کے ذریعے صاحب حق (الحق) فیصلہ کرتا ہے جو وہ جانتا ہے۔\n\nوہ (قطب) عدل اور احسان کی حالت میں ان (ترازوؤں) کو اس سے طلب کرتا ہے،\nاور جو شخص سمجھتا ہے وہ احسان کے ذریعے باہر نکلتا ہے۔\n\n### [اپنی ذات پر ظلم کرنے والا اور اپنی ذات کے لیے ظلم کرنے والا]\n\nاللہ تعالیٰ نے آدم علیہ السلام کے بارے میں خبر دیتے ہوئے فرمایا: \"اے ہمارے رب! ہم نے اپنی جانوں پر ظلم کیا\" (رَبَّنا ظَلَمْنا أَنْفُسَنا)۔ پس اپنی ذات پر ظلم کرنے والا (الظالم نفسه)، نہ کہ اپنی ذات کے لیے ظلم کرنے والا (الظالم لنفسه)، وہ ہے جو اپنے رب کی طرف رجوع کرتا ہے۔\n\nکیونکہ اپنی ذات کے لیے ظلم کرنے والا (الظالم لنفسه) اپنے رب سے باہر نہیں نکلا کہ وہ اس کی طرف رجوع کرے، کیونکہ وہ چنے ہوئے لوگوں میں سے ہے۔ پس اپنی ذات پر ظلم کرنے والا (الظالم نفسه) اس مشروع حق کی طرف آتا ہے جس میں رسول (الرسول) اپنی صورت میں اس کی زندگی میں ظاہر ہوئے، اور اسی لیے تعارف میں انہیں رسول اللہ کہا جاتا تھا، صرف محمد نہیں کہا جاتا تھا۔ اسی طرح اللہ نے اپنے اس قول میں خبر دی: \"محمد اللہ کے رسول ہیں\" (مُحَمَّدٌ رَسُولُ الله) اور فرمایا: \"بلکہ وہ اللہ کے رسول اور آخری نبی ہیں\" (ولكِنْ رَسُولَ الله وخاتَمَ النَّبِيِّينَ)۔\n\nپس جب ظالم اس مشروع حق کی طرف آتا ہے جو آج ہمارے ہاتھوں میں ہے، اگر وہ (حق) اس کے لیے محمدی صورت میں مجسم ہو جائے، تو وہ جان لیتا ہے کہ وہ اس ذکر کے اصحاب میں سے ہے، خواہ خواب میں ہو یا بیداری میں، جیسے بھی ہو۔ اور اگر وہ مجسم نہ ہو تو وہ شخص (مطلوبہ) نہیں ہے۔ اور جب وہ اس کے لیے مجسم ہو جائے، تو یہ بات خالی نہیں ہوتی کہ یہ اپنی ذات پر ظلم کرنے والا (الظالم نفسه) اللہ سے استغفار کرے یا اللہ سے استغفار نہ کرے۔\n\nپس اگر وہ اللہ سے استغفار کرے اور رسول (الرسول) کی صورت کو اپنے لیے استغفار کرتے ہوئے نہ دیکھے، تو بے شک وہ \"مؤمنوں پر بہت مہربان، نہایت رحم کرنے والے ہیں\" (بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ)۔ تب وہ جان لیتا ہے کہ اس نے اللہ سے (صحیح طور پر) استغفار نہیں کیا۔ کیونکہ اس مقام پر اس کا اللہ سے استغفار کرنا، نبی صلی اللہ علیہ وسلم کو ان کے حق میں اللہ سے استغفار کرنے کے ذریعے یاد دلاتا ہے، تب وہ اللہ کو \"بہت توبہ قبول کرنے والا، نہایت رحم کرنے والا\" (تَوَّاباً رَحِيماً) پاتا ہے۔\n\nاور میں نے اپنی ذات پر ظلم کیا اور آپ صلی اللہ علیہ وسلم کی قبر پر آیا، تو میں نے معاملہ اسی طرح پایا جیسا کہ میں نے ذکر کیا ہے۔ اور اللہ نے میری حاجت پوری کی اور میں واپس لوٹ آیا۔ اور رسول (الرسول) کے پاس آنے میں میرا مقصد اس ہجیر (سفر) کے سوا کچھ نہ تھا۔ اور اسی طرح میں نے آپ صلی اللہ علیہ وسلم کی قبر پر آپ کی زیارت کے دوران یہ (آیت) آپ پر تلاوت کی، تو قبولیت ہوئی اور میں واپس لوٹ آیا۔ اور یہ واقعہ ۶۰۱ ہجری میں پیش آیا۔ پس میں نے تمہیں بتا دیا کہ اپنی ذات پر ظلم کرنے والا (الظالم نفسه) کس طرح آتا ہے۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و پنجاه و دوم در معرفت حال قطبی که منزل او آیه «وَلَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جاؤُكَ» (و اگر آنان هنگامی که بر خود ستم کردند، نزد تو می‌آمدند...) بود.\n\nهر کس در تصرف خود مانند پدرش باشد،\nهرگاه بر نفس خود ستم کند، نزد حق (الحق) می‌آید.\n\nو از آنچه با آن نافرمانی خدا کرده است، آمرزش می‌طلبد؛\nو بر قدر و منزلت خود می‌افزاید و بالا می‌رود.\n\nسپس خداوند او را به آنچه مخصوصش گردانیده و هدایت کرده، برمی‌گزیند؛\nاز بازگشت به سوی او با آنچه حکم کرده است.\n\nبرای شریعت در آن میزان‌های عادلانه‌ای است\nکه صاحب حق (الحق) که داناست، با آن‌ها حکم می‌کند.\n\nدر حالت عدل و احسان (الإحسان)، آن را از او می‌طلبد\nو هر کس که فهمید، با احسان (الإحسان) خارج می‌شود.\n\n### [ستم‌کننده بر نفس خود و ستم‌کننده برای نفس خود]\n\nخداوند متعال در خبر دادن از آدم (علیه السلام) فرمود: «رَبَّنا ظَلَمْنا أَنْفُسَنا» (پروردگارا، ما بر خود ستم کردیم). پس ستم‌کننده بر نفس خود (الظالم نفسه)، نه ستم‌کننده برای نفس خود (الظالم لنفسه)، کسی است که به سوی پروردگارش باز می‌گردد.\n\nزیرا ستم‌کننده برای نفس خود (الظالم لنفسه) از پروردگارش خارج نشده است تا بخواهد به سوی او بازگردد، چرا که او از برگزیدگان (المصطفین) است. اما ستم‌کننده بر نفس خود (الظالم نفسه) به سوی حق (الحق) مشروعی می‌آید که رسول (صلی الله علیه و سلم) در زندگی او با صورت خود ظاهر شده است. به همین دلیل در تعریف، به او «رسول الله» گفته می‌شد و تنها «محمد» گفته نمی‌شد. همچنین خداوند در کلام خود خبر داده است: «مُحَمَّدٌ رَسُولُ الله» (محمد فرستاده خداست) و فرموده است: «ولكِنْ رَسُولَ الله وخاتَمَ النَّبِيِّينَ» (بلکه فرستاده خدا و خاتم پیامبران است).\n\nپس اگر ستمکار به سوی حق (الحق) مشروعی که امروز در دست ماست بیاید، اگر آن حق در صورت محمدیه برای او تجسد یابد، می‌داند که او از اصحاب این ذکر است، خواه در خواب باشد یا در بیداری، به هر صورتی که باشد. و اگر برای او تجسد نیابد، پس او آن مرد نیست.\n\nپس اگر برای او تجسد یافت، این ستم‌کننده بر نفس خود (الظالم نفسه) یا از خدا آمرزش می‌طلبد یا نمی‌طلبد. اگر از خدا آمرزش طلبید و صورت رسول را ندید که برای او آمرزش می‌طلبد، پس او «بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ» (نسبت به مؤمنان بسیار مهربان و رحیم است). در این صورت می‌داند که از خدا آمرزش نخواسته است. زیرا آمرزش خواستن او از خدا در آن موطن، پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) را به یاد استغفار برای خدا در حق او می‌آورد، و در آن هنگام خداوند را «تَوَّاباً رَحِيماً» (بسیار توبه‌پذیر و مهربان) می‌یابد.\n\nو من بر نفس خود ستم کردم و نزد قبر او (صَلَّى اللهُ عَليهِ وسَلَّم) آمدم و امر را بر همان گونه که ذکر کردم دیدم. و خداوند حاجت مرا برآورد و بازگشتم. و قصد من از آمدن نزد رسول (صلی الله علیه و سلم) جز این هدف نبود. و بدین سان آن را در زیارتم نزد قبرش بر او (صَلَّى اللهُ عَليهِ وسَلَّم) تلاوت کردم، پس پذیرش حاصل شد و بازگشتم. و این در سال ششصد و یکم بود. پس به تو آگاهاندم که چگونه ستم‌کننده بر نفس خود (الظالم نفسه) می‌آید. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}