{
  "id": 189,
  "title": {
    "ar": "أبواب الأحوال) (الباب التاسع والثمانون ومائة في السالك والسلوك",
    "en": "Chapter One Hundred and Eighty-Nine of the Chapters concerning the Spiritual States (أبواب الأحوال): Concerning the Traveler (السالك) and the Spiritual Journey (السلوك).",
    "ur": "ابوابِ احوال (أبواب الأحوال)\nباب ایک سو نواسی: سالک (السالك) اور سلوک (السلوك) کے بیان میں۔",
    "fa": "باب‌های احوال) (باب صد و هشتاد و نهم در سالک و سلوک"
  },
  "content": {
    "ar": "(أبواب الأحوال) (الباب التاسع والثمانون ومائة في السالك والسلوك)\n\n\n> إن السلوك هو الطريق الأقوم *** فإذا استقمت فأنت فيه السالك‏\n\n\n> اشتق من سلك اللآلي لفظه *** فحسامه عضب المضارب باتك‏\n\n\n> لا تمنعنك عن السلوك مضايق *** من خلفهن أرائك ودرانك‏\n\n\n> لا يسلكن لغاية ونهاية *** طرق المحال بمثبتيها فاتك‏\n\n\n### [أن السلوك انتقال من منزل عبادة إلى منزل عبادة بالمعنى‏]\n\n\nاعلم وفقك الله أن السلوك انتقال من منزل عبادة إلى منزل عبادة بالمعنى وانتقال بالصورة من عمل مشروع على طريق‏\nالقربة إلى الله إلى عمل مشروع بطريق القربة إلى الله بفعل وترك فمن فعل إلى فعل أو من ترك إلى ترك أو من فعل إلى ترك أو من ترك إلى فعل وما ثم خامس للصورة وانتقال بالعلم من مقام إلى مقام ومن اسم إلى اسم ومن تجل إلى تجل ومن نفس إلى نفس والمنتقل هو السالك وهو صاحب مجاهدات بدنية ورياضات نفسية قد أخذ نفسه بتهذيب الأخلاق وحكم على طبيعته بالقدر الذي يحتاج إليه من الغذاء الذي يكون به قوام مزاجها واعتدالها ولا يلتفت إلى جوع العادة والراحة المعتادة فإن الله ما كلف نَفْساً إِلَّا وُسْعَها فإذا بذلت الوسع في طاعة الله لم يقم عليها حجة غير\n\n\n### [إن السالكين على أربعة أقسام‏]\n\n\nإن السالكين في سلوكهم على أربعة أقسام منهم سالك يسلك بربه وسالك يسلك بنفسه وسالك يسلك بالمجموع وسالك لأسألك فيتنوع السلوك بحسب قصد السالك ورتبته في العلم بالله فأما السالك الذي يسلك بربه فهو الذي يكون الحق سمعه وبصره وجميع قواه فإن عينه ثابتة ولهذا أعاد الضمير عليه لوجوده في‏\n\n\nقوله كنت سمعه‏\n\n\nفهذه الهاء هي عينك الذي الحق سمعها وبصرها وما سلكت إلا بهذه القوي وهذه القوي قد أخبر الحق أنه لما أحبك كان سمعك وبصرك فهو قواك فبه سلكت في طاعته التي أمرك بأن تعمل نفسك فيها وتحلى ذاتك بها وهي زينة الله وهو سبحانه الجميل والزينة جمال فهو جمال هذا السالك فزينته ربه فبه يسمع وبه يبصر وبه يسلك ولا مانع من ذلك ولهذا قال قُلْ من حَرَّمَ زِينَةَ الله الَّتِي أَخْرَجَ لِعِبادِهِ لما أحبهم حين تقربوا إليه بنوافل الخيرات زينهم به فكان قواهم التي سلكوا بها ما كلفهم من الأعمال وهو قوله وإِيَّاكَ نَسْتَعِينُ وهي كلمة تطلبها المجازاة فاستعانوا بالله على عبادته بأن كان قواهم كما أنه بوجود أعيانهم وإن كان وجودهم قد استفادوه منه لم يتمكن خلق الأعمال التي هي محاب الله إلا في وجود أعيانهم فحصل لديهم ضرب من الإعانة على إيجاد الأعمال التي لا تقوم بنفسها فلما عملوا بها وما زالوا يطلبون الاستعانة منه على ذلك جَزاءً وِفاقاً أعانهم بنفسه بأن قال لهم بي تسمعون وتبصرون وتبطشون وغير ذلك من القوي التي هم عليها ليست غير الحق بأخبار الحق والناس في عماية لا يعرفون من هذه صورته فكثيرا ما يسيئون الأدب على من هذه صفته فتكون إساءة ذلك الأدب مع الله فالاحتياط تعظيم عباد الله فإنه ما من شخص إلا ويمكن أن يكون هو ذلك العبد فإن الأمر غيب ما هو بمحسوس حتى يتميز إلا عند أهله فوجب مراعاة كل مؤمن على كل مكلف فإنه إذا فعل ذلك أحرز الأمر واستبرأ لنفسه ولا يقال له لم فعلت كذا فإنه قصد جميل فإن وافق محله وإلا فقد وفي الأمر حقه لقصده احترام الجناب الإلهي لما دخل في المسألة من الإمكان لكل شخص شخص وهذا لا يكون إلا للادباء من أهل الله والقسم الآخر السالك بنفسه وهو المتقرب إلى ربه ابتداء بالفرائض ونوافل الخيرات الموجبين لمحبة الحق من أتى بهما لتحصيل المحبتين فهو يجهد فيما كلفه الحق ويبذل استطاعته وقوته فيما أمره به ربه ونهاه من عبادة ربه في قوله فَاتَّقُوا الله ما اسْتَطَعْتُمْ واتَّقُوا الله حَقَّ تُقاتِهِ ولا تَمُوتُنَّ إِلَّا وأَنْتُمْ مُسْلِمُونَ وإن كانوا قد سمعوا هذا الخبر الإلهي واعتقدوه إيمانا به ولكن ما حصل لهم هذا ذوقا فيكون الحق قواهم فهم سالكون بنفوسهم في جميع مراتب السلوك من حال وعمل ومقام واسم وتجل وما يصح فيه الانتقال من أمر إلى أمر وهذا هو سلوك الأدباء من أهل الله وذلك أن الله كلف عباده فعلموا إن ثم حقيقة تقتضي أن تكون المخاطبة بالتكليف وما ثم إلا هم فيعلمون أنهم المرادون وإن لم يتعين عندهم بأي حقيقة توجه عليهم الخطاب فيسلكون بنفوسهم في العموم مع علمهم بأن الأمر لا بد فيه من نسبة خاصة أو عين موجودة تستحق التكليف فيبذلون المجهود ويوفون بالعقود وإن جهلوا المقصود إلى أن يفتح الله لهم كما فتح لمن سلك بربه وأما السالك بالمجموع فهو السالك بعد أن ذاق كون الحق سمعه وبصره وعلم سلوكه أولا بنفسه على الجملة من غير شهود نفسه على التعيين فلما علم أن الحق سمعه وعلم أن السامع بالسمع ما هو عين السمع ورأى ثبوت هذا الضمير وعاين على من عاد فعلم أن نفسه وعينه هي السميعة بالله والناظرة بالله والمتحركة بالله والساكنة بالله وإنها المخاطبة بالسلوك والانتقال فسلك بالمجموع وأما القسم الرابع وهو سالك لأسألك فهو إنه رأى نفسه لم تستقل بالسلوك ما لم يكن الحق صفة لها ولا تستقل الصفة بالسلوك ما لم تكن نفس المكلف موجودة\nويكون كالمحل لها فيبدو له أنه سالك بالمجموع فإذا تبين له أن بالمجموع ظهر السلوك بأن له أن المظهر لا وجود له عينا وأن الظاهر تقيد بحكم استعداد المظهر ورأى الحق يقول وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ وكذلك لو قال وما رمى لصح كما صح في الطرف الأول فمن وقف على هذا العلم من نفسه علم أنه سالك لأسألك‏\n\n\n### [إن السالكين على مراتب‏]\n\n\nثم اعلم أن السالكين الذين ذكرناهم على مراتب فمنهم السالك منه إليه ومنهم السالك منه إليه فيه ومنهم السالك منه إليه فيه به ومنهم السالك منه لا فيه ولا إليه ومنهم السالك إليه لا منه ولا فيه ومنهم السالك لا منه ولا إليه ولا فيه وهو موصوف بالسلوك وبأنه سالك ومنهم السالك من غير سفر ومنهم السالك المسافر وهو في الباب الذي يلي هذا الباب فكل مسافر سالك وما كل سالك مسافر كما سنذكره إن شاء الله بعد هذا الباب في باب المسافر وأنواع السلوك كثيرة وما ذكرنا منها إلا القليل فأما السالك منه إليه فهو المنتقل من تجل إلى تجل وأما السالك إليه منه فيه فهو السالك من اسم إلهي إلى اسم إلهي في اسم إلهي وأما السالك منه إليه فيه به فهو السالك باسم إلهي من اسم إلى اسم في اسم وأما السالك منه لا فيه ولا إليه فهو الذي خرج من عند الله في الكون إلى الكون وأما السالك إليه لا منه ولا فيه فهو الفار إليه في الكون من الكون كفرار موسى عليه السلام وأما السالك لا منه ولا فيه ولا إليه فهو المنتقل في الأعمال الصالحة من الدنيا إلى الآخرة وهم الزهاد غير العارفين وكلما ذكرناه قد يكون على التقسيم الذي تقدم في حرف الباء من أنه سلك بربه أو بنفسه إلى نهاية التقسيم فيه وللسلوك مراتب وأسرار يطول النظر فيها ويخرجنا عن المقصود في هذا الكتاب من الاقتصاد والاقتصار على الضروري من العلم الذي يحتاج إليه أهل طريق الله أن يبينه لهم من فتح عليه به من أمثالنا وهذا الكتاب مع طوله واتساعه وكثرة فصوله وأبوابه ما استوفينا فيه خاطرا واحدا من خواطرنا في الطريق فكيف الطريق ولا أخللنا بشي‏ء من الأصول التي يعول عليها في الطريق فحصرناها مختصرة العبارة بين إيماء وإيضاح‏\n\n",
    "en": "(Chapters on Spiritual States) (Chapter One Hundred and Eighty-Nine: Concerning the Wayfarer and the Wayfaring)\n\nIndeed, the Wayfaring (السلوك) is the most upright Path,\nSo if you become upright, you are the Wayfarer (السالك) upon it.\nIts word is derived from the threading of pearls (سلك اللآلي),\nFor its sword is a sharp, cutting blade in the striking places.\nLet not difficulties prevent you from the Wayfaring,\nBehind which lie couches and resting places.\nLet him not travel toward a goal or an end,\nThe paths of the impossible (طرق المحال) with those who affirm them, for he is a destroyer.\n\n### [The Wayfaring is a transition from a station of worship to a station of worship in meaning]\n\nKnow, may Allah grant you success, that the Wayfaring (السلوك) is a transition from a station (منزل) of worship (عبادة) to a station of worship in meaning, and a transition in form from a prescribed action undertaken as a means of drawing near (قربة) to Allah, to another prescribed action undertaken as a means of drawing near to Allah, through doing or abstaining. Thus, it is from action to action, or from abstention to abstention, or from action to abstention, or from abstention to action. There is no fifth possibility for the form.\n\nAnd it is a transition in Knowledge (العلم) from a spiritual station (مقام) to a station, from a Name (اسم) to a Name, from a Theophany (تجل) to a Theophany, and from a soul (نفس) to a soul. The one who transitions is the Wayfarer (السالك), and he is the master of physical struggles (مجاهدات بدنية) and spiritual disciplines (رياضات نفسية). He has taken charge of his soul by refining its character (تهذيب الأخلاق) and has governed his nature with only the amount of sustenance necessary for the stability and balance of its temperament. He pays no heed to habitual hunger or customary comfort, for Allah has not burdened a soul except with its capacity (وُسْعَها). If he expends his capacity in obedience to Allah, no argument can be raised against him other than...\n\n### [Indeed, the Wayfarers are of four types]\n\nThe Wayfarers (السالكين) in their wayfaring are of four types: a Wayfarer who journeys by means of his Lord (بربه), a Wayfarer who journeys by means of his self (بنفسه), a Wayfarer who journeys by means of the totality (بالمجموع), and a Wayfarer who journeys so that I may ask you (لأسألك). The Wayfaring thus varies according to the Wayfarer’s intention and his degree (رتبته) in the Knowledge of Allah.\n\nAs for the Wayfarer who journeys by means of his Lord, he is the one whose hearing, sight, and all faculties (قواه) are The Real (الحق). His entity (عينه) is established, and for this reason, the pronoun refers back to him due to his existence in the saying [of the Hadith Qudsi]: \"I was his hearing.\" This pronoun is your entity whose hearing and sight The Real became. He only journeys by means of these faculties, and The Real informed us that when He loved you, He became your hearing and your sight; thus, He is your faculties. By Him, you journeyed in His obedience, in which He commanded you to employ your self and adorn your Essence (ذاتك) with it. This is the adornment (زينة) of Allah, and He, glory be to Him, is The Beautiful (الجميل), and adornment is beauty; thus, He is the beauty of this Wayfarer. His adornment is his Lord. By Him, he hears, by Him, he sees, and by Him, he journeys, and there is no impediment to this.\n\nFor this reason, He said: <<قُلْ من حَرَّمَ زِينَةَ الله الَّتِي أَخْرَجَ لِعِبادِهِ>> (Say: Who has forbidden the adornment of Allah which He has produced for His servants?). When He loved them, as they drew near to Him through supererogatory good deeds (نوافل الخيرات), He adorned them with Himself, so He became the faculties by which they performed the duties He assigned them. This is His saying: <<وإِيَّاكَ نَسْتَعِينُ>> (And You alone we ask for help). This is a word that demands recompense. They sought help from Allah for their worship by Him becoming their faculties. Just as the creation of actions that are beloved to Allah could only take place in the existence of their entities (أعيانهم)—even though their existence was derived from Him—a form of assistance was granted to them for the creation of actions that cannot subsist by themselves. When they performed these actions, and continually sought His assistance for them, as a fitting recompense (جَزاءً وِفاقاً), He assisted them with Himself by saying to them: \"By Me you hear, and you see, and you strike,\" and other such faculties upon which they subsist, which are none other than The Real, according to the reports of The Real. People are in blindness; they do not know who possesses this form. They often behave disrespectfully toward one who possesses this attribute, and that disrespect is directed toward Allah. Caution requires the veneration of Allah's servants, for there is no person who cannot potentially be that servant. The matter is unseen (غيب); it is not perceptible so as to be distinguished, except by those who possess it. Therefore, it is obligatory for every responsible person (مكلف) to respect every believer. If he does this, he secures the matter and clears himself of blame. He will not be asked, \"Why did you do such-and-such?\" because his intention was beautiful. If it corresponds to its proper place, well and good; otherwise, he has fulfilled the right of the matter due to his intention to respect the Divine Presence, given the possibility that this state may apply to any individual. This is only achieved by the refined ones (الادباء) among the People of Allah.\n\nThe other type is the Wayfarer who journeys by means of his self. He is the one who initially draws near to his Lord through obligatory duties (الفرائض) and supererogatory good deeds (نوافل الخيرات), which necessitate the love of The Real for whoever performs them to attain both loves. He strives in what The Real has assigned him and expends his capacity and strength in what his Lord has commanded and forbidden him concerning the worship of his Lord, as in His saying: <<فَاتَّقُوا الله ما اسْتَطَعْتُمْ>> (So fear Allah as much as you are able) and <<واتَّقُوا الله حَقَّ تُقاتِهِ ولا تَمُوتُنَّ إِلَّا وأَنْتُمْ مُسْلِمُونَ>> (And fear Allah with the fear due to Him, and do not die except as Muslims). Although they have heard this Divine report and believed in it with faith, they have not attained this through direct experience (ذوقا) such that The Real becomes their faculties. Thus, they journey by means of their selves (نفوسهم) through all the levels (مراتب) of Wayfaring, including spiritual state (حال), action (عمل), station (مقام), Name (اسم), Theophany (تجل), and whatever transition from one matter to another is valid. This is the Wayfaring of the refined ones among the People of Allah. This is because Allah assigned duties to His servants, and they knew that there is a Reality (حقيقة) that necessitates the address of the assignment, and there is none there but themselves. Thus, they know that they are the intended ones, even if it is not determined for them by which Reality the address is directed toward them. So they journey by means of their selves in generality, while knowing that the matter necessarily involves a specific relation or an existing entity (عين موجودة) that deserves the assignment. They expend effort and fulfill the covenants, even if they are ignorant of the intended goal, until Allah grants them an opening, just as He granted an opening to the one who journeys by means of his Lord.\n\nAs for the Wayfarer who journeys by means of the totality (بالمجموع), he is the Wayfarer who, after having tasted (ذاق) that The Real is his hearing and sight, and having known his Wayfaring initially by means of his self generally, without witnessing his self specifically, then knew that The Real is his hearing. He knew that the one who hears by means of the hearing is not the hearing itself. He saw the establishment of this pronoun and witnessed to whom it returned. Thus, he knew that his self and his entity (عينه) are the ones who hear by Allah, see by Allah, move by Allah, and rest by Allah, and that it is his self that is addressed with the Wayfaring and the transition. Therefore, he journeys by means of the totality.\n\nAs for the fourth type, the Wayfarer who journeys so that I may ask you (لأسألك), he is the one who saw that his self cannot be independent in the Wayfaring unless The Real is an Attribute (صفة) for it, and the Attribute cannot be independent in the Wayfaring unless the self of the responsible person (المكلف) exists and acts as a locus (المحل) for it. It appears to him that he is journeying by means of the totality. When it becomes clear to him that the Wayfaring is manifested by means of the totality, it is revealed to him that the manifestor (المظهر) has no essential existence (وجود له عينا), and that the manifested (الظاهر) is restricted by the ruling of the manifestor’s preparedness. He sees The Real saying: <<وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏>> (And you did not throw when you threw, but Allah threw). Likewise, if He had said, \"And He did not throw,\" it would be correct, just as it is correct in the first part [of the verse]. Whoever attains this Knowledge (العلم) concerning his self knows that he is a Wayfarer so that I may ask you.\n\n### [Indeed, the Wayfarers are of Levels]\n\nThen know that the Wayfarers (السالكين) whom we have mentioned are of levels (مراتب). Among them is the Wayfarer from Him to Him (منه إليه), and the Wayfarer from Him to Him within Him (منه إليه فيه), and the Wayfarer from Him to Him within Him by Him (منه إليه فيه به), and the Wayfarer from Him, but not within Him nor to Him (منه لا فيه ولا إليه), and the Wayfarer to Him, but not from Him nor within Him (إليه لا منه ولا فيه), and the Wayfarer neither from Him, nor within Him, nor to Him (لا منه ولا إليه ولا فيه), yet he is described by Wayfaring and as being a Wayfarer. Among them is the Wayfarer without travel (سفر), and among them is the Traveling Wayfarer (المسافر), who is discussed in the chapter immediately following this one. Every traveler is a Wayfarer, but not every Wayfarer is a traveler, as we shall mention, Allah willing, after this chapter in the chapter on the Traveler.\n\nThe types of Wayfaring are numerous, and we have mentioned only a few of them. As for the Wayfarer from Him to Him (منه إليه), he is the one who transitions from one Theophany (تجل) to another Theophany. As for the Wayfarer to Him from Him within Him (إليه منه فيه), he is the Wayfarer from a Divine Name (اسم إلهي) to a Divine Name within a Divine Name. As for the Wayfarer from Him to Him within Him by Him (منه إليه فيه به), he is the Wayfarer by means of a Divine Name, from a Name to a Name within a Name. As for the Wayfarer from Him, but not within Him nor to Him (منه لا فيه ولا إليه), he is the one who emerged from the presence of Allah into the cosmos (الكون) and journeys within the cosmos. As for the Wayfarer to Him, but not from Him nor within Him (إليه لا منه ولا فيه), he is the one who flees to Him within the cosmos away from the cosmos, like the flight of Moses, peace be upon him. As for the Wayfarer neither from Him, nor within Him, nor to Him (لا منه ولا فيه ولا إليه), he is the one who transitions through righteous deeds from the world (الدنيا) to the Hereafter (الآخرة), and these are the ascetics (الزهاد) who are not Gnostics (العارفين).\n\nEverything we have mentioned may also be subject to the preceding classification concerning the letter Bā’ [the preposition *bi*], whether he journeys by means of his Lord (بربه) or by means of his self (بنفسه), up to the end of that classification. Wayfaring has levels and secrets that would require lengthy consideration and would divert us from the intended purpose of this book, which is conciseness and restriction to the essential Knowledge (العلم) that the People of Allah’s Path require to be clarified for them by those among us to whom it has been unveiled. Despite the length, breadth, and numerous chapters and sections of this book, we have not exhausted even a single thought (خاطرا) of our thoughts concerning the Path—let alone the Path itself. Yet, we have not neglected any of the fundamental principles (الأصول) relied upon in the Path, having confined them in concise expression, oscillating between allusion (إيماء) and clarification (إيضاح).",
    "ur": "(احوال کے ابواب) (باب ایک سو نواسی: سالک اور سلوک کے بیان میں)\n\nبیشک سلوک (السلوك) ہی سب سے سیدھا راستہ (الطريق الأقوم) ہے۔\nپس جب تم سیدھے ہو جاؤ تو تم ہی اس میں سالک (السالك) ہو۔\nاس کا لفظ موتیوں کی لڑی (سلك اللآلي) سے مشتق ہے،\nپس اس کی تلوار تیز دھار اور کاٹنے والی ہے۔\nتنگیوں کو تمہیں سلوک (السلوك) سے نہ روکنے دو،\nجن کے پیچھے تخت اور مسندیں ہیں۔\nکسی غایت اور انتہا کے لیے،\nمحال کے راستوں پر ان کے ثابت کرنے والوں کے ساتھ سفر نہ کرو۔\n\n### [سلوک کا معنی کے اعتبار سے ایک منزلِ عبادت سے دوسری منزلِ عبادت کی طرف منتقل ہونا ہے]\n\nاللہ تمہیں توفیق دے، جان لو کہ سلوک (السلوك) معنی کے اعتبار سے ایک منزلِ عبادت سے دوسری منزلِ عبادت کی طرف منتقل ہونا ہے، اور صورت کے اعتبار سے قربتِ الٰہی (القربة إلى الله) کے راستے پر ایک مشروع عمل سے دوسرے مشروع عمل کی طرف منتقل ہونا ہے، جو فعل اور ترک کے ذریعے ہوتا ہے۔ پس یا تو فعل سے فعل کی طرف، یا ترک سے ترک کی طرف، یا فعل سے ترک کی طرف، یا ترک سے فعل کی طرف۔ اور صورت کے لیے پانچویں قسم نہیں ہے۔ اور یہ علم کے ذریعے ایک مقام سے دوسرے مقام کی طرف، ایک اسم (اسم) سے دوسرے اسم کی طرف، ایک تجلی (التجلی) سے دوسری تجلی (التجلی) کی طرف، اور ایک نفس سے دوسرے نفس کی طرف منتقل ہونا ہے۔ اور منتقل ہونے والا ہی سالک (السالك) ہے، جو بدنی مجاہدات اور نفسانی ریاضتوں کا حامل ہوتا ہے۔ اس نے اپنے نفس کو اخلاق کی تہذیب پر لگایا ہے اور اپنی طبیعت پر صرف اتنی غذا کے ساتھ حکم لگایا ہے جس کی اس کے مزاج کے قیام اور اعتدال کے لیے ضرورت ہو۔ اور وہ عادت کی بھوک اور معمول کے آرام کی طرف توجہ نہیں دیتا، کیونکہ اللہ تعالیٰ نے کسی جان کو اس کی طاقت سے زیادہ تکلیف نہیں دی:\n**لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا** (اللہ کسی جان کو اس کی طاقت سے زیادہ تکلیف نہیں دیتا)۔\nپس جب اس نے اللہ کی اطاعت میں اپنی طاقت صرف کر دی، تو اس پر کوئی حجت قائم نہیں ہوتی۔\n\n### [سالکین چار قسموں پر ہیں]\n\nسالکین (السالكين) اپنے سلوک (السلوك) میں چار قسموں پر ہیں: ان میں سے ایک سالک (سالك) وہ ہے جو اپنے رب کے ذریعے سلوک کرتا ہے، ایک سالک وہ ہے جو اپنے نفس کے ذریعے سلوک کرتا ہے، ایک سالک وہ ہے جو مجموعے کے ذریعے سلوک کرتا ہے، اور ایک سالک وہ ہے جو \"لأسألك\" (تاکہ میں تجھ سے سوال کروں) کے ذریعے سلوک کرتا ہے۔ پس سلوک سالک کے ارادے اور اللہ کی معرفت (المعرفۃ) میں اس کے مرتبے کے مطابق مختلف ہوتا ہے۔\n\nجہاں تک اس سالک کا تعلق ہے جو اپنے رب کے ذریعے سلوک کرتا ہے، تو وہ وہ ہے جس کا کان، آنکھ اور تمام قوتیں ذات حق (الحق) ہوتی ہیں۔ کیونکہ اس کی عین (ذات) ثابت ہے، اور اسی لیے ضمیر کو اس پر لوٹایا گیا ہے، اس کے وجود کی بنا پر، جیسا کہ اس کے قول میں ہے:\n**\"كنت سمعه\"** (میں اس کا کان ہو جاتا ہوں)۔\nپس یہ ضمیر (هاء) تمہاری وہ عین ہے جس کا کان اور آنکھ ذات حق (الحق) ہے۔ اور تم نے ان قوتوں کے بغیر سلوک نہیں کیا، اور ذات حق (الحق) نے خبر دی ہے کہ جب اس نے تم سے محبت کی تو وہ تمہارا کان اور تمہاری آنکھ بن گیا، پس وہ تمہاری قوتیں ہے۔ پس تم نے اسی کے ذریعے اس کی اطاعت میں سلوک کیا جس کا اس نے تمہیں حکم دیا کہ تم اپنے نفس کو اس میں مشغول کرو اور اپنی ذات کو اس سے آراستہ کرو، اور یہی اللہ کی زینت ہے۔ اور وہ سبحانہ الجمیل (خوبصورت) ہے، اور زینت جمال ہے، پس وہ اس سالک کا جمال ہے۔ پس اس کی زینت اس کا رب ہے، وہ اسی کے ذریعے سنتا ہے، اسی کے ذریعے دیکھتا ہے، اور اسی کے ذریعے سلوک کرتا ہے۔ اور اس میں کوئی رکاوٹ نہیں ہے۔ اسی لیے اس نے فرمایا:\n**قُلْ مَنْ حَرَّمَ زِينَةَ اللَّهِ الَّتِي أَخْرَجَ لِعِبَادِهِ** (کہو، کس نے اللہ کی اس زینت کو حرام کیا جو اس نے اپنے بندوں کے لیے نکالی؟)۔\nجب اس نے ان سے محبت کی، جب وہ نوافلِ خیرات کے ذریعے اس کی طرف قریب ہوئے، تو اس نے انہیں اپنے ذریعے مزین کیا، پس وہ ان کی قوتیں بن گیا جن کے ذریعے انہوں نے ان اعمال میں سلوک کیا جن کا انہیں مکلف بنایا گیا تھا۔ اور یہی اس کا قول ہے:\n**وَإِيَّاكَ نَسْتَعِينُ** (اور ہم تجھ ہی سے مدد مانگتے ہیں)۔\nیہ وہ کلمہ ہے جو بدلے کا تقاضا کرتا ہے۔ پس انہوں نے اللہ کی عبادت پر اللہ سے مدد مانگی، اس طرح کہ وہ ان کی قوتیں بن گیا۔ جیسا کہ ان کی اعیان (ذوات) کے وجود کے ساتھ، اگرچہ انہوں نے اپنا وجود اسی سے حاصل کیا ہے، اللہ کے پسندیدہ اعمال کی تخلیق ان کی اعیان کے وجود کے بغیر ممکن نہیں ہوئی۔ پس انہیں اعمال کو وجود میں لانے پر ایک طرح کی مدد حاصل ہوئی جو بذات خود قائم نہیں ہو سکتے۔ پس جب انہوں نے ان اعمال کو کیا اور مسلسل اس سے مدد طلب کرتے رہے، تو **جَزَاءً وِفَاقًا** (مناسب بدلے کے طور پر)، اس نے خود ان کی مدد کی، یہ کہہ کر کہ تم میرے ذریعے سنتے ہو، دیکھتے ہو، اور پکڑتے ہو، اور دیگر قوتیں جن پر وہ قائم ہیں، وہ ذات حق (الحق) کے سوا کچھ نہیں ہیں، یہ ذات حق (الحق) کی خبر کے مطابق ہے۔ اور لوگ غفلت میں ہیں، وہ نہیں جانتے کہ یہ صورت کس کی ہے۔ پس وہ اکثر اس شخص کے ساتھ بدتمیزی کرتے ہیں جس کی یہ صفت ہو، اور یہ بدتمیزی اللہ کے ساتھ بدتمیزی ہوتی ہے۔ لہٰذا احتیاط یہ ہے کہ اللہ کے بندوں کی تعظیم کی جائے، کیونکہ کوئی بھی شخص ایسا نہیں ہے جو وہ بندہ نہ ہو سکتا ہو۔ کیونکہ یہ معاملہ غیب ہے، محسوس نہیں ہے کہ وہ ممتاز ہو جائے، سوائے اس کے اہل کے نزدیک۔ پس ہر مکلف پر لازم ہے کہ وہ ہر مومن کا خیال رکھے، کیونکہ جب وہ ایسا کرے گا تو اس نے معاملے کو محفوظ کر لیا اور اپنے نفس کو بری کر لیا۔ اور اس سے یہ نہیں کہا جائے گا کہ تم نے ایسا کیوں کیا، کیونکہ اس کا ارادہ نیک تھا۔ اگر وہ اپنے محل کے مطابق ہوا تو ٹھیک، ورنہ اس نے اپنے ارادے سے جنابِ الٰہی کے احترام کا حق ادا کر دیا، کیونکہ اس مسئلے میں ہر شخص کے لیے امکان شامل ہے۔ اور یہ صرف اہل اللہ کے باادب لوگوں کو ہی حاصل ہوتا ہے۔\n\nاور دوسری قسم وہ سالک (سالك) ہے جو اپنے نفس کے ذریعے سلوک کرتا ہے، اور وہ وہ ہے جو ابتداءً فرائض اور نوافلِ خیرات کے ذریعے اپنے رب کا قرب حاصل کرتا ہے، جو ذات حق (الحق) کی محبت کو واجب کرتے ہیں، جو ان دونوں کو دو محبتوں کے حصول کے لیے لاتا ہے۔ پس وہ اس میں کوشش کرتا ہے جس کا ذات حق (الحق) نے اسے مکلف بنایا، اور اپنی طاقت اور قوت کو اس میں صرف کرتا ہے جس کا اس کے رب نے اسے حکم دیا اور جس سے منع کیا، جیسا کہ اس کے رب کی عبادت کے بارے میں اس کا قول ہے:\n**فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ** (پس اللہ سے ڈرو جہاں تک تم طاقت رکھو)\nاور **اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ** (اور اللہ سے ڈرو جیسا کہ اس سے ڈرنے کا حق ہے، اور ہرگز نہ مرو مگر اس حال میں کہ تم مسلمان ہو)۔\nاگرچہ انہوں نے یہ خبرِ الٰہی سنی اور اس پر ایمان کے طور پر اعتقاد رکھا، لیکن انہیں یہ ذوقاً حاصل نہیں ہوا کہ ذات حق (الحق) ان کی قوتیں بن جائے۔ پس وہ اپنے نفوس کے ذریعے سلوک کرتے ہیں، سلوک (السلوك) کے تمام مراتب میں، خواہ وہ حال ہو، عمل ہو، مقام ہو، اسم (اسم) ہو، یا تجلی (التجلی) ہو، اور ہر وہ چیز جس میں ایک امر سے دوسرے امر کی طرف منتقل ہونا صحیح ہو۔ اور یہ اہل اللہ کے باادب لوگوں کا سلوک ہے۔ یہ اس لیے ہے کہ اللہ نے اپنے بندوں کو مکلف بنایا، پس انہوں نے جانا کہ وہاں ایک حقیقت ہے جو تکلیف کے ساتھ مخاطب ہونے کا تقاضا کرتی ہے، اور وہاں ان کے سوا کوئی نہیں ہے۔ پس وہ جانتے ہیں کہ وہی مراد ہیں، اگرچہ ان کے نزدیک یہ متعین نہ ہو کہ کس حقیقت کے ذریعے ان پر خطاب متوجہ ہوا ہے۔ پس وہ اپنے نفوس کے ذریعے عموم میں سلوک کرتے ہیں، اس علم کے ساتھ کہ اس معاملے میں ایک خاص نسبت یا ایک موجود عین (ذات) کا ہونا ضروری ہے جو تکلیف کی مستحق ہو۔ پس وہ کوشش کرتے ہیں اور معاہدوں کو پورا کرتے ہیں، اگرچہ وہ مقصود سے ناواقف ہوں، یہاں تک کہ اللہ ان پر کشف (الکشف) فرمائے جیسا کہ اس پر کشف فرمایا جس نے اپنے رب کے ذریعے سلوک کیا۔\n\nاور جہاں تک مجموعے کے ذریعے سلوک کرنے والے سالک (السالك بالمجموع) کا تعلق ہے، تو وہ وہ سالک ہے جس نے یہ ذوق حاصل کر لیا کہ ذات حق (الحق) اس کا کان اور آنکھ ہے، اور وہ جانتا ہے کہ اس کا سلوک پہلے اپنے نفس کے ذریعے اجمالی طور پر تھا، بغیر کسی خاص تعین کے اپنے نفس کے شہود (الشہود) کے۔ پس جب اس نے جانا کہ ذات حق (الحق) اس کا کان ہے، اور یہ بھی جانا کہ کان کے ذریعے سننے والا عینِ کان نہیں ہے، اور اس نے اس ضمیر کے ثبوت کو دیکھا اور مشاہدہ کیا کہ وہ کس پر لوٹتا ہے، تو اس نے جانا کہ اس کا نفس اور اس کی عین (ذات) ہی اللہ کے ذریعے سننے والی، اللہ کے ذریعے دیکھنے والی، اللہ کے ذریعے حرکت کرنے والی اور اللہ کے ذریعے ساکن رہنے والی ہے، اور یہ کہ وہی سلوک (السلوك) اور انتقال کی مخاطب ہے۔ پس اس نے مجموعے کے ذریعے سلوک کیا۔\n\nاور جہاں تک چوتھی قسم کا تعلق ہے، جو سالک \"لأسألك\" (تاکہ میں تجھ سے سوال کروں) ہے، تو وہ یہ ہے کہ اس نے دیکھا کہ اس کا نفس سلوک (السلوك) کے لیے خود کفیل نہیں ہو سکتا جب تک کہ ذات حق (الحق) اس کی صفت نہ ہو، اور نہ ہی صفت سلوک کے لیے خود کفیل ہو سکتی ہے جب تک کہ مکلف کا نفس موجود نہ ہو اور اس کے لیے محل کی مانند نہ ہو۔ پس اسے ظاہر ہوتا ہے کہ وہ مجموعے کے ذریعے سلوک کر رہا ہے۔ پھر جب اس پر واضح ہو جاتا ہے کہ مجموعے کے ذریعے سلوک ظاہر ہوا ہے، تو اس پر یہ منکشف ہوتا ہے کہ مظہر (ظاہر کرنے والے) کا عینی وجود (الوجود) نہیں ہے، اور ظاہر ہونے والا مظہر کی استعداد کے حکم سے مقید ہے۔ اور اس نے ذات حق (الحق) کو یہ فرماتے ہوئے دیکھا:\n**وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَىٰ** (اور جب تم نے پھینکا تو تم نے نہیں پھینکا، بلکہ اللہ نے پھینکا)۔\nاور اسی طرح اگر وہ کہتا \"اور اس نے نہیں پھینکا\" تو بھی صحیح ہوتا، جیسا کہ پہلے حصے میں صحیح ہوا۔ پس جو شخص اپنے نفس سے اس علم پر واقف ہوا، وہ جانتا ہے کہ وہ سالک \"لأسألك\" ہے۔\n\n### [سالکین مراتب پر ہیں]\n\nپھر جان لو کہ جن سالکین (السالكين) کا ہم نے ذکر کیا ہے وہ مراتب پر ہیں: ان میں سے ایک سالک (سالك) وہ ہے جو \"منہ إلیہ\" (اس سے اس کی طرف) سلوک کرتا ہے، اور ان میں سے ایک وہ ہے جو \"منہ إلیہ فیہ\" (اس سے اس کی طرف، اس میں) سلوک کرتا ہے، اور ان میں سے ایک وہ ہے جو \"منہ إلیہ فیہ بہ\" (اس سے اس کی طرف، اس میں، اس کے ذریعے) سلوک کرتا ہے، اور ان میں سے ایک وہ ہے جو \"منہ لا فیہ ولا إلیہ\" (اس سے، نہ اس میں اور نہ اس کی طرف) سلوک کرتا ہے، اور ان میں سے ایک وہ ہے جو \"إلیہ لا منہ ولا فیہ\" (اس کی طرف، نہ اس سے اور نہ اس میں) سلوک کرتا ہے، اور ان میں سے ایک وہ ہے جو \"لا منہ ولا إلیہ ولا فیہ\" (نہ اس سے، نہ اس کی طرف اور نہ اس میں) سلوک کرتا ہے، اور وہ سلوک (السلوك) اور سالک (سالك) ہونے کے ساتھ موصوف ہے۔ اور ان میں سے ایک وہ ہے جو بغیر سفر کے سالک ہے، اور ان میں سے ایک وہ ہے جو مسافر سالک ہے، اور اس کا ذکر اس باب کے بعد والے باب میں ہے۔ پس ہر مسافر سالک ہوتا ہے، لیکن ہر سالک مسافر نہیں ہوتا، جیسا کہ ہم ان شاء اللہ اس باب کے بعد مسافر کے باب میں ذکر کریں گے۔\n\nاور سلوک (السلوك) کی اقسام بہت ہیں، اور ہم نے ان میں سے صرف تھوڑا سا ذکر کیا ہے۔\n\nجہاں تک سالک \"منہ إلیہ\" (اس سے اس کی طرف) کا تعلق ہے، تو وہ ایک تجلی (التجلی) سے دوسری تجلی (التجلی) کی طرف منتقل ہونے والا ہے۔\n\nاور جہاں تک سالک \"إلیہ منہ فیہ\" (اس کی طرف، اس سے، اس میں) کا تعلق ہے، تو وہ ایک اسمِ الٰہی سے دوسرے اسمِ الٰہی کی طرف، ایک اسمِ الٰہی میں سلوک کرنے والا ہے۔\n\nاور جہاں تک سالک \"منہ إلیہ فیہ بہ\" (اس سے اس کی طرف، اس میں، اس کے ذریعے) کا تعلق ہے، تو وہ ایک اسمِ الٰہی کے ذریعے ایک اسم سے دوسرے اسم کی طرف، ایک اسم میں سلوک کرنے والا ہے۔\n\nاور جہاں تک سالک \"منہ لا فیہ ولا إلیہ\" (اس سے، نہ اس میں اور نہ اس کی طرف) کا تعلق ہے، تو وہ وہ ہے جو کون (کائنات) میں اللہ کے پاس سے کون کی طرف نکلا۔\n\nاور جہاں تک سالک \"إلیہ لا منہ ولا فیہ\" (اس کی طرف، نہ اس سے اور نہ اس میں) کا تعلق ہے، تو وہ کون (کائنات) میں کون سے اس کی طرف بھاگنے والا ہے، جیسے موسیٰ علیہ السلام کا بھاگنا۔\n\nاور جہاں تک سالک \"لا منہ ولا فیہ ولا إلیہ\" (نہ اس سے، نہ اس کی طرف اور نہ اس میں) کا تعلق ہے، تو وہ نیک اعمال میں دنیا سے آخرت کی طرف منتقل ہونے والے ہیں، اور وہ غیر عارف زاہد ہیں۔\n\nاور جو کچھ بھی ہم نے ذکر کیا ہے، وہ اس تقسیم پر ہو سکتا ہے جو حرف باء (ب) میں گزر چکی ہے کہ آیا اس نے اپنے رب کے ذریعے سلوک کیا یا اپنے نفس کے ذریعے، یہاں تک کہ اس میں تقسیم کی انتہا ہو جائے۔ اور سلوک (السلوك) کے مراتب اور اسرار ہیں جن پر غور و فکر طویل ہو جائے گا اور ہمیں اس کتاب میں ہمارے مقصود سے ہٹا دے گا، جو کہ علم کے اس ضروری حصے پر کفایت اور اختصار ہے جس کی اہل طریقِ اللہ کو ضرورت ہے کہ ہمارے جیسے لوگ جن پر یہ کشف (الکشف) ہوا ہے، وہ ان کے لیے بیان کریں۔ اور یہ کتاب اپنی طوالت، وسعت اور ابواب و فصول کی کثرت کے باوجود، ہم نے اس میں طریق کے بارے میں اپنے ایک بھی خیال کو پورا نہیں کیا، تو خود طریق کا کیا حال ہو گا! اور ہم نے ان اصولوں میں سے کسی کو بھی نہیں چھوڑا جن پر طریق میں بھروسہ کیا جاتا ہے، پس ہم نے انہیں اشارے اور وضاحت کے درمیان مختصر عبارت میں محدود کر دیا ہے۔",
    "fa": "(ابواب احوال) (باب صد و هشتاد و نهم در سالک و سلوک)\n\nهمانا سلوک (السلوك) راست‌ترین راه است، پس اگر استقامت ورزی، تو در آن سالک (السالک) هستی.\n\nلفظ آن از رشته کردن مرواریدها مشتق شده است، پس شمشیرش در ضربه‌ها برنده و قاطع است.\n\nتنگی‌ها و سختی‌ها تو را از سلوک (السلوك) باز ندارند، که در پسِ آن‌ها تخت‌ها و پرده‌ها (آسایش‌ها) قرار دارند.\n\nراه‌های محال را برای رسیدن به غایت و نهایت نپیماید، که با کسانی که آن‌ها را ثابت می‌دانند، نابودکننده است.\n\n### [اینکه سلوک (السلوك) انتقال از منزل عبادتی به منزل عبادتی دیگر از نظر معناست]\n\nبدان، خداوند تو را موفق بدارد، که سلوک (السلوك) انتقال از منزل عبادتی به منزل عبادتی دیگر از نظر معناست، و انتقال از نظر صورت، از عملی مشروع در طریق قربت به سوی خدا، به عملی مشروع دیگر در طریق قربت به سوی خدا، با انجام دادن و ترک کردن است. پس یا از فعلی به فعلی، یا از ترکی به ترکی، یا از فعلی به ترکی، یا از ترکی به فعلی است؛ و صورت پنجمی در کار نیست. و انتقال از نظر علم، از مقامی به مقامی، و از اسمی به اسمی، و از تجلی (التجلی) به تجلی (التجلی) دیگر، و از نفسی به نفسی دیگر است.\n\nو انتقال یابنده همان سالک (السالک) است که صاحب مجاهدات بدنی و ریاضت‌های نفسانی است؛ کسی که نفس خود را به تهذیب اخلاق واداشته و بر طبیعت خود به اندازه‌ای حکم کرده که به آن مقدار از غذا نیاز دارد تا قوام و اعتدال مزاجش حفظ شود. و به گرسنگی عادتی و آسایش معمول توجه نمی‌کند، زیرا خداوند هیچ کس را جز به اندازه توانش تکلیف نمی‌کند (لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا). پس اگر نهایت توان خود را در طاعت خدا به کار برد، حجتی بر او باقی نمی‌ماند، جز...\n\n### [همانا سالکان (السالکين) بر چهار دسته‌اند]\n\nسالکان (السالکين) در سلوک (السلوك) خود بر چهار دسته‌اند: از جمله آنان سالکی است که به واسطه پروردگارش سلوک (السلوك) می‌کند، سالکی که به واسطه نفس خود سلوک (السلوك) می‌کند، سالکی که به واسطه مجموع سلوک (السلوك) می‌کند، و سالکی که «لِأَسْأَلُكَ» (برای اینکه از تو بپرسم) سلوک (السلوك) می‌کند. پس سلوک (السلوك) بر حسب قصد سالک (السالک) و مرتبه او در معرفت (المعرفة) به خدا متنوع می‌شود.\n\nاما سالکی که به واسطه پروردگارش سلوک (السلوك) می‌کند، کسی است که حق (الحق) گوش و چشم و تمامی قوای اوست، زیرا عین او ثابت است. به همین دلیل ضمیر را به او بازگردانده است، به دلیل وجودش در این سخن [خداوند]: «من گوش او بودم».\n\nپس این ضمیر «هاء» همان عین توست که حق (الحق) گوش و چشم آن است، و تو سلوک (السلوك) نکردی مگر به واسطه این قوا. و حق (الحق) خبر داده است که این قوا، هنگامی که تو را دوست داشت، گوش و چشم تو بود، پس او قوای توست. پس به واسطه او در طاعتش سلوک (السلوك) کردی؛ طاعتی که تو را امر کرد تا نفس خود را در آن به کار اندازی و ذات خود را به آن بیارایی، و آن زینت خداست. و او سبحانه جمیل است و زینت، جمال است، پس او جمال این سالک (السالک) است. پس زینت او پروردگارش است، به واسطه او می‌شنود و به واسطه او می‌بیند و به واسطه او سلوک (السلوك) می‌کند و مانعی از این نیست. و به همین دلیل فرمود: بگو چه کسی زینت خدا را که برای بندگانش پدید آورده، حرام کرده است؟ (قُلْ مَنْ حَرَّمَ زِينَةَ اللَّهِ الَّتِي أَخْرَجَ لِعِبَادِهِ). هنگامی که آنان را دوست داشت، زمانی که با نوافل خیرات به او تقرب جستند، آنان را به واسطه خود زینت داد، پس او قوای آنان بود که با آن در اعمالی که مکلف شده بودند، سلوک (السلوك) کردند. و این همان سخن اوست: و تنها از تو یاری می‌جوییم (وَإِيَّاكَ نَسْتَعِينُ).\n\nو این کلمه‌ای است که پاداش را می‌طلبد. پس آنان در عبادت خود از خدا یاری جستند، به این صورت که او قوای آنان بود. همان‌طور که با وجود اعیانشان – اگرچه وجودشان را از او کسب کرده‌اند – خلق اعمالی که محبوب خداست، جز در وجود اعیانشان ممکن نمی‌شد. پس نوعی یاری برای ایجاد اعمالی که به خودی خود قوام ندارند، برایشان حاصل شد. هنگامی که به آن عمل کردند و پیوسته از او برای آن یاری می‌طلبیدند، به عنوان پاداشی موافق (جَزَاءً وِفَاقًا)، خود او یاری‌شان داد، به این صورت که به آنان فرمود: به واسطه من می‌شنوید و می‌بینید و قدرت به کار می‌برید و دیگر قوایی که بر آن هستند، که به خبر حق (الحق)، غیر از حق (الحق) نیستند.\n\nو مردم در جهل و کوری هستند و کسی را که صورتش این‌گونه است، نمی‌شناسند. پس چه بسا که نسبت به کسی که این صفت را دارد، سوء ادب ورزند، و این سوء ادب در واقع با خداست. پس احتیاط در تعظیم بندگان خداست، زیرا هیچ شخصی نیست مگر اینکه ممکن است او همان بنده باشد. چرا که این امر غیب است و محسوس نیست تا متمایز شود، مگر نزد اهلش. پس رعایت حال هر مؤمنی بر هر مکلفی واجب است. زیرا اگر چنین کند، امر را حفظ کرده و خود را تبرئه نموده است و به او گفته نمی‌شود چرا چنین کردی؟ زیرا قصد او زیباست. اگر با محلش موافق باشد [که چه بهتر]، وگرنه به دلیل قصدش برای احترام به ساحت الهی – به خاطر امکان شمول این مسئله بر هر فردی – حق امر را ادا کرده است. و این جز برای ادبای از اهل الله میسر نیست.\n\nو بخش دیگر، سالکی است که به واسطه نفس خود سلوک (السلوك) می‌کند. و او کسی است که در ابتدا با فرائض و نوافل خیرات به پروردگارش تقرب می‌جوید؛ آن فرائض و نوافلی که موجب محبت حق (الحق) می‌شوند، برای کسی که آن‌ها را برای تحصیل دو محبت (محبت خدا و محبت بنده) به جا آورد. پس او در آنچه حق (الحق) او را مکلف کرده، تلاش می‌کند و توان و نیروی خود را در آنچه پروردگارش او را امر و نهی کرده، از عبادت پروردگارش، به کار می‌برد؛ در سخن او: تا آنجا که می‌توانید از خدا پروا کنید (فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ) و آن‌گونه که شایسته پروا کردن از اوست، پروا کنید (وَاتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ) و نمیرید مگر در حالی که مسلمان باشید (وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ).\n\nو اگرچه این خبر الهی را شنیده‌اند و از روی ایمان به آن اعتقاد دارند، اما این امر به صورت ذوق (تجربه مستقیم) برایشان حاصل نشده است که حق (الحق) قوای آنان باشد. پس آنان با نفوس خود در تمامی مراتب سلوک (السلوك) – از حال و عمل و مقام و اسم و تجلی (التجلی) و هر آنچه انتقال از امری به امر دیگر در آن صحیح است – سلوک (السلوك) می‌کنند. و این همان سلوک (السلوك) ادبای از اهل الله است. زیرا خداوند بندگانش را مکلف کرد و آنان دانستند که حقیقتی وجود دارد که اقتضا می‌کند مخاطب تکلیف باشد، و جز آنان کسی در آنجا نیست. پس می‌دانند که مراد [خداوند] آنان هستند، اگرچه برایشان معین نشده باشد که خطاب به واسطه کدام حقیقت متوجه آنان شده است. پس با نفوس خود در عموم سلوک (السلوك) می‌کنند، با علم به اینکه این امر ناگزیر نیازمند نسبت خاص یا عین موجودی است که مستحق تکلیف باشد. پس نهایت تلاش را به کار می‌برند و به عهدها وفا می‌کنند، اگرچه مقصود را ندانند، تا زمانی که خداوند برایشان بگشاید، همان‌طور که برای کسی که به واسطه پروردگارش سلوک (السلوك) کرد، گشود.\n\nو اما سالکی که به واسطه مجموع سلوک (السلوك) می‌کند، او سالکی است که پس از چشیدن اینکه حق (الحق) گوش و چشم اوست، و دانستن سلوک (السلوك) اولیه خود به واسطه نفسش به صورت کلی و بدون شهود (الشهود) نفس خود به صورت معین، هنگامی که دانست که حق (الحق) گوش اوست و دانست که شنونده به واسطه گوش، عین گوش نیست، و ثبوت این ضمیر را دید و مشاهده کرد که به چه کسی باز می‌گردد، پس دانست که نفس و عین اوست که شنونده به واسطه خدا، بیننده به واسطه خدا، متحرک به واسطه خدا و ساکن به واسطه خداست، و اوست که مخاطب به سلوک (السلوك) و انتقال است. پس به واسطه مجموع سلوک (السلوك) کرد.\n\nو اما بخش چهارم، که سالک (السالک) «لِأَسْأَلُكَ» است، او کسی است که دید نفسش به تنهایی برای سلوک (السلوك) کفایت نمی‌کند، مگر آنکه حق (الحق) صفتی برای آن باشد؛ و صفت نیز به تنهایی برای سلوک (السلوك) کفایت نمی‌کند، مگر آنکه نفس مکلف موجود باشد و مانند محلی برای آن باشد. پس برای او آشکار می‌شود که او به واسطه مجموع سلوک (السلوك) می‌کند. اما هنگامی که برایش روشن شد که سلوک (السلوك) به واسطه مجموع ظاهر شده است، برایش آشکار می‌شود که مظهر از نظر عین وجودی ندارد و ظاهر مقید به حکم استعداد مظهر است. و حق (الحق) را دید که می‌فرماید: و تو پرتاب نکردی آنگاه که پرتاب کردی، بلکه خدا پرتاب کرد (وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَىٰ). و همچنین اگر می‌فرمود «و پرتاب نکرد» نیز صحیح بود، همان‌طور که در طرف اول صحیح بود. پس هر کس از نفس خود بر این علم وقوف یابد، می‌داند که او سالک (السالک) «لِأَسْأَلُكَ» است.\n\n### [همانا سالکان (السالکين) بر مراتب هستند]\n\nسپس بدان که سالکان (السالکين) که ذکر کردیم، بر مراتبی هستند: از جمله آنان سالکی است که «از او به سوی او» سلوک (السلوك) می‌کند، و سالکی که «از او به سوی او در او» سلوک (السلوك) می‌کند، و سالکی که «از او به سوی او در او به واسطه او» سلوک (السلوك) می‌کند، و سالکی که «از او، نه در او و نه به سوی او» سلوک (السلوك) می‌کند، و سالکی که «به سوی او، نه از او و نه در او» سلوک (السلوك) می‌کند، و سالکی که «نه از او و نه به سوی او و نه در او» سلوک (السلوك) می‌کند، و او به سلوک (السلوك) و سالک (السالک) بودن توصیف می‌شود.\n\nو از جمله آنان سالکی است که بدون سفر سلوک (السلوك) می‌کند، و سالکی که مسافر است، و این [نوع] در بابی است که پس از این باب می‌آید. پس هر مسافری سالک (السالک) است، اما هر سالکی مسافر نیست، همان‌طور که ان‌شاءالله پس از این باب، در باب مسافر، آن را ذکر خواهیم کرد.\n\nو انواع سلوک (السلوك) بسیار است و ما جز اندکی از آن را ذکر نکردیم. اما سالکی که «از او به سوی او» سلوک (السلوك) می‌کند، او کسی است که از تجلی (التجلی) به تجلی (التجلی) دیگر منتقل می‌شود. و اما سالکی که «به سوی او از او در او» سلوک (السلوك) می‌کند، او سالکی است که از اسم الهی به اسم الهی دیگر، در اسم الهی سلوک (السلوك) می‌کند. و اما سالکی که «از او به سوی او در او به واسطه او» سلوک (السلوك) می‌کند، او سالکی است که به واسطه اسم الهی، از اسمی به اسمی دیگر، در اسمی سلوک (السلوك) می‌کند. و اما سالکی که «از او، نه در او و نه به سوی او» سلوک (السلوك) می‌کند، او کسی است که از نزد خدا در کَون (جهان) به سوی کَون (جهان) خارج شده است. و اما سالکی که «به سوی او، نه از او و نه در او» سلوک (السلوك) می‌کند، او کسی است که در کَون (جهان) از کَون (جهان) به سوی او می‌گریزد، مانند گریختن موسی علیه السلام. و اما سالکی که «نه از او و نه در او و نه به سوی او» سلوک (السلوك) می‌کند، او کسی است که در اعمال صالحه از دنیا به آخرت منتقل می‌شود، و آنان زاهدان غیر عارف (المعرفة) هستند.\n\nو هر آنچه ذکر کردیم، ممکن است بر تقسیم‌بندی‌ای باشد که پیش‌تر در حرف «باء» آمد، مبنی بر اینکه آیا به واسطه پروردگارش سلوک (السلوك) کرده یا به واسطه نفسش، تا پایان تقسیم‌بندی در آن. و سلوک (السلوك) دارای مراتب و اسراری است که بحث در آن‌ها طولانی می‌شود و ما را از مقصود این کتاب که ایجاز و اکتفا به علم ضروری است، خارج می‌سازد؛ علمی که اهل طریق خدا نیاز دارند تا کسی از امثال ما که این علم بر او گشوده شده، آن را برایشان بیان کند.\n\nو این کتاب، با وجود طولانی بودن، وسعت و کثرت فصول و ابوابش، ما حتی یک خاطر از خواطرمان در این طریق را به طور کامل در آن بیان نکرده‌ایم، پس طریق چگونه خواهد بود؟ اما هیچ یک از اصول اساسی که در این طریق بر آن‌ها تکیه می‌شود را فروگذار نکرده‌ایم، بلکه آن‌ها را با عبارتی مختصر، بین اشاره و توضیح، محصور ساخته‌ایم."
  },
  "page_count": 3
}