{
  "id": 169,
  "title": {
    "ar": "الباب التاسع والستون ومائة في معرفة مقام ترك الأدب وأسراره",
    "en": "Chapter One Hundred and Sixty-Nine, concerning the Gnosis (معرفة) of the Station (مقام) of Abandoning Spiritual Propriety (ترك الأدب) and its Secrets (أسراره).",
    "ur": "باب ایک سو انہتر: مقام ترک الأدب (ترك الأدب) اور اس کے اسرار کی معرفت (المعرفۃ) کے بیان میں۔",
    "fa": "باب صد و شصت و نهم در معرفت مقام ترک ادب و اسرار آن"
  },
  "content": {
    "ar": "## «الباب التاسع والستون ومائة في معرفة مقام ترك الأدب وأسراره»\n\n\n> أضف الأمور إلى الإله جميعها *** وإذا فعلت فلا يقال أديب‏\n\n\n> نسب الخليل إليه علة نفسه *** وشفاءها لله وهو مصيب‏\n\n\n> وكذاك أستاذ المكلم عند ما *** خرق السفينة والجدار عجيب‏\n\n\n> فالعبد إن نظر الأمور بنفسه *** تبصره يخطئ تارة ويصيب‏\n\n\n> فانظر بربك في الأمور فإنه *** فيها فتحضر تارة وتغيب‏\n\n\nقال تعالى آمرا قُلْ كُلٌّ من عِنْدِ الله فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً في معرض الذم لهم أي هو الذي حسن الحسن وقبح القبيح وقال تعالى مخبرا كُلًّا نُمِدُّ هؤُلاءِ وهَؤُلاءِ من عَطاءِ رَبِّكَ وذكر المذموم والمحمود وقال تعالى فَأَلْهَمَها فُجُورَها وتَقْواها ذلك الأول في الباطن فإنه في الإرادة وهذا في الظاهر إذ لا يعتبر إلا بعد الوقوع فالتارك للأدب أديب من حيث لا يعلم فإنه مع الكشف وبحكمه لا مع الذي هم المحجوبون فيه فهو يعاين علم الله في جريان المقادير قبل وقوعها فيبادر إليها فينطلق عليه بلسان الموطن أنه غير أديب مع الحق فإنه مخالف بل هذا هو غاية الأدب مع الحق ولكن أكثر الناس لا يشعرون ومنهم من يقام في الإدلال كعبد القادر الجيلي ببغداد سيد وقته ومنهم من يكون وقته في ذلك كنت سمعه وبصره والأدب يستدعي الغير وثم مقام يفني الأغيار فيزول الأدب لأنه ما ثم مع من وأما بلسان عامة الطريق وخواص أكثرهم فإن مقام ترك الأدب مع الحقيقة هو الواقع المشروع في العموم والخصوص وهو مقام جليل لا يقف معه إلا الذكران من أهل الله وفحول أصحاب المقامات لا أصحاب الأحوال والقرآن كله نزل في هذا المقام إلا آيات مفردات قد ذكرناها في أول الباب وما يحار في هذا المقام إلا رجلان مكاشف به ومشاهد له فالحقيقة تطلبه والحق الموضوع يطلبه والأدب مع أحدهما ترك الأدب مع الآخر وحصلت أنت في مقام الترجيح وليس لك ذلك فمن الرجال من يترك أدب الحق الموضوع من اعتقاده وباطنه ويترك أدب الحقيقة من ظاهره ويكون أديبا مع الحق في ظاهره غير أديب مع الحقيقة في ظاهره ويكون أديبا مع الحقيقة في باطنه غير أديب مع الحق في باطنه لما رأوا أن النجاة في ذلك والسعادة وإن عكس الأمر شقاء فهو يطرد ولا ينعكس وثم طائفة تقول إن الأدب مع الحق الذي هو الشرع أدب مع الحقيقة فمن تركه هنا تركه هنا ولا يعرفون من وجه وذلك لأن الحق المشروع بين الأمر الذي لأجله حكم بالمنع فقال ومن غيرته حرم الفواحش لا أنه جعلها فواحش بالتحريم وهذا المذهب أدخل في باب الحكمة ومذهب المخالف أدخل في أحدية العين ولهذا المقام رجال ولمخالفه رجال وبالجملة فهو موضع حيرة لا يخلص لهؤلاء من جميع الوجوه ولا لهؤلاء من جميع الوجوه فإن الإخبارات الإلهية أكثرها تعارض الأدلة العقلية في هذا الباب وأية حيرة أعظم من هذه الحيرة وهذا هو المتشابه الذي ينبغي أن يقول فيه من لم يطلعه الله على العلم به آمنا به كُلٌّ من عِنْدِ رَبِّنا ولكن ما يتذكر ذلك إِلَّا أُولُوا الْأَلْبابِ وهم الآخذون بلب العقل لا بقشره والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 169: On the Knowledge of the Station of Abandoning Propriety and its Secrets\n\nAttribute all affairs entirely to the Divine,\nAnd if you do so, you will not be called one of propriety.\n\nThe Intimate Friend (Al-Khalil) attributed his own sickness to Him,\nAnd its cure to Allah, and he was correct.\n\nAnd likewise, the master of the one spoken to (Moses) when\nHe pierced the ship and repaired the wall—it is wondrous.\n\nFor the servant, if he views affairs through himself,\nYou see him err sometimes and be correct sometimes.\n\nSo look by your Lord in the affairs, for He is\nIn them, so you are present sometimes and absent sometimes.\n\nAllah the Exalted said, commanding: <<قُلْ كُلٌّ من عِنْدِ الله>> (Say, \"All is from Allah\") <<فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً>> (So what is wrong with these people that they hardly understand any statement?) [Quran 4:78]. This is in the context of blaming them, meaning: He is the One Who made the good good and the ugly ugly. And Allah the Exalted said, informing: <<كُلًّا نُمِدُّ هؤُلاءِ وهَؤُلاءِ من عَطاءِ رَبِّكَ>> (We extend to all—to these and to those—from the gift of your Lord) [Quran 17:20]. And He mentioned the blameworthy and the praiseworthy. And Allah the Exalted said: <<فَأَلْهَمَها فُجُورَها وتَقْواها>> (And inspired it [the soul] with its wickedness and its righteousness) [Quran 91:8]. That first [statement, \"All is from Allah\"] is related to the inner reality (الباطن), for it concerns the Divine Will (الإرادة). And this [second statement, concerning wickedness and righteousness] is related to the outer manifestation (الظاهر), since it is only considered after the occurrence.\n\nThus, the one who abandons propriety (ترك الأدب) is, in fact, a person of propriety (*adib*) from a perspective he does not know. For he acts according to Unveiling (الكشف) and its ruling, not according to that which the veiled ones (المحجوبون) are concerned with. He witnesses the Knowledge (العلم) of Allah in the flow of the Divine Decrees (المقادير) before their occurrence, so he hastens to them. Thus, the tongue of the common place speaks against him, saying that he lacks propriety (*adab*) with The Real (الحق), for he appears to be in opposition. Rather, this [abandonment of conventional *adab*] is the ultimate degree of propriety with The Real, but most people do not perceive it.\n\nAmong them are those who are established in the station of Intimate Confidence (الإدلال), such as Abd al-Qadir al-Jilani in Baghdad, the master of his time. And among them are those whose time (وقته) in this matter is defined by the saying: \"I am his hearing and his sight.\" Propriety (*Adab*) necessitates the existence of the Other (الغير). But there is a station (مقام) that annihilates all others (الأغيار), so propriety vanishes, because there is no \"with whom\" remaining. However, according to the language of the general practitioners of the Path (الطريق) and the elite among most of them, the station of abandoning propriety with the Reality (الحقيقة) is the established and sanctioned reality (الواقع المشروع) in both general and specific contexts. It is a glorious station (مقام جليل) that is only attained by the men (الذكران) among the People of Allah (أهل الله) and the champions (فحول) among the possessors of Stations (أصحاب المقامات), not the possessors of States (أصحاب الأحوال). The entire Quran was revealed concerning this station, except for isolated verses which we mentioned at the beginning of the chapter.\n\nOnly two types of men are perplexed in this station: the one to whom it is unveiled (مكاشف به) and the one who witnesses it (مشاهد له). The Reality (الحقيقة) demands it, and the Established Law (الحق الموضوع) demands it. Propriety with one of them means abandoning propriety with the other. And you find yourself in the station of preference (الترجيح), yet you do not possess the right to make that choice. Among men, there are those who abandon the propriety of the Established Law (الحق الموضوع) in their belief and inner being (باطنه), and abandon the propriety of the Reality (الحقيقة) in their outer manifestation (ظاهره). And there are those who are proper with The Real (الحق) in their outer manifestation but improper with the Reality in their outer manifestation; and proper with the Reality in their inner being but improper with The Real in their inner being. This is because they saw that salvation (النجاة) and felicity (السعادة) lay therein, and that reversing the matter leads to wretchedness. Thus, it is followed but not reversed.\n\nThere is a group (طائفة) that says that propriety with The Real, which is the Sacred Law (الشرع), is propriety with the Reality. So whoever abandons it here, abandons it there. They do not know the perspective [of the other group]. That is because the Sanctioned Law (الحق المشروع) clarifies the reason for which prohibition was decreed. Thus, He said, \"And out of His jealousy, He forbade indecencies,\" not that He made them indecencies merely by prohibiting them. This doctrine is more aligned with the domain of Wisdom (الحكمة), while the doctrine of the opposition is more aligned with the Oneness of the Essence (أحدية العين). This station has its men, and its opposite has its men. In summary, it is a place of perplexity (حيرة) from which neither group is entirely free in all respects. For most of the Divine Communications (الإخبارات الإلهية) contradict the rational proofs (الأدلة العقلية) in this chapter. And what perplexity is greater than this perplexity?\n\nThis is the ambiguous matter (المتشابه) concerning which one whom Allah has not informed of its knowledge ought to say: \"We believe in it; <<كُلٌّ من عِنْدِ رَبِّنا>> (all is from our Lord)\" [Quran 3:7]. But none will remember this <<إِلَّا أُولُوا الْأَلْبابِ>> (except those of understanding) [Quran 3:7]—who are those who grasp the core of the intellect (لب العقل), not its husk. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way) [Quran 33:4].",
    "ur": "باب ایک سو انسٹھ: مقامِ ترکِ ادب (ادب کو چھوڑ دینے کا مقام) اور اس کے اسرار کی معرفت میں\n\nتمام معاملات کو اللہ کی طرف منسوب کر دو،\nاور جب تم ایسا کرو گے تو تمہیں مؤدب نہیں کہا جائے گا۔\n\nخلیل (ابراہیم علیہ السلام) نے اپنی بیماری اور اس کی شفا کو اللہ کی طرف منسوب کیا،\nاور وہ درست تھے۔\n\nاور اسی طرح کلیم (موسیٰ علیہ السلام) کے استاد (خضر علیہ السلام) کا\nکشتی کو توڑنا اور دیوار بنانا بھی عجیب ہے۔\n\nپس اگر بندہ معاملات کو اپنی ذات کی نظر سے دیکھے گا،\nتو تم اسے دیکھو گے کہ وہ کبھی غلطی کرتا ہے اور کبھی درست ہوتا ہے۔\n\nلہٰذا اپنے رب کی نظر سے معاملات کو دیکھو، کیونکہ وہ ان میں موجود ہے،\nپس تم کبھی حاضر ہوتے ہو اور کبھی غائب۔\n\nاللہ تعالیٰ نے حکم دیتے ہوئے فرمایا: **قُلْ كُلٌّ من عِنْدِ الله فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً** (کہہ دو کہ سب کچھ اللہ ہی کی طرف سے ہے، تو ان لوگوں کو کیا ہو گیا ہے کہ کوئی بات سمجھنے کے قریب بھی نہیں آتے؟)۔ یہ آیت ان کی مذمت کے ضمن میں ہے، یعنی وہی ہے جس نے حسن کو حسن بنایا اور قبیح کو قبیح بنایا۔\n\nاور اللہ تعالیٰ نے خبر دیتے ہوئے فرمایا: **كُلًّا نُمِدُّ هؤُلاءِ وهَؤُلاءِ من عَطاءِ رَبِّكَ** (ہم ان کو اور ان کو سب کو تیرے رب کے عطیے سے مدد دیتے ہیں)۔ اور اس میں مذموم اور محمود دونوں کا ذکر کیا۔\n\nاور اللہ تعالیٰ نے فرمایا: **فَأَلْهَمَها فُجُورَها وتَقْواها** (پھر اسے اس کی بدکاری اور پرہیزگاری کا الہام کیا)۔ یہ پہلی بات (کُلٌّ من عِنْدِ الله) باطن میں ہے، کیونکہ یہ ارادے میں ہے، اور یہ دوسری بات (فَأَلْهَمَها) ظاہر میں ہے، کیونکہ اس کا اعتبار وقوع کے بعد ہی ہوتا ہے۔\n\nپس ادب کو ترک کرنے والا (تارک الأدب) اس لحاظ سے مؤدب ہے جہاں سے وہ نہیں جانتا، کیونکہ وہ کشف (الکشف) کے ساتھ اور اس کے حکم کے مطابق ہوتا ہے، نہ کہ اس چیز کے ساتھ جس میں وہ لوگ ہیں جو محجوب ہیں۔ وہ (تارک الأدب) مقدرات کے جاری ہونے میں اللہ کے علم کا مشاہدہ کرتا ہے اس سے پہلے کہ وہ واقع ہوں، پس وہ ان کی طرف سبقت کرتا ہے۔ چنانچہ اس پر اس مقام کی زبان سے یہ بات لاگو ہوتی ہے کہ وہ حق (الحق) کے ساتھ غیر مؤدب ہے، کیونکہ وہ بظاہر مخالفت کر رہا ہے، بلکہ یہ تو حق (الحق) کے ساتھ ادب کی انتہا ہے، لیکن اکثر لوگ اس سے واقف نہیں ہوتے۔\n\nاور ان میں سے بعض کو ادلال (ناز و بے نیازی) کے مقام پر قائم کیا جاتا ہے، جیسے بغداد میں عبد القادر جیلانی، جو اپنے وقت کے سردار تھے۔ اور ان میں سے بعض کا وقت اس میں ہوتا ہے کہ \"میں اس کا کان اور اس کی آنکھ بن جاتا ہوں\" (اشارہ حدیث قدسی کی طرف)۔ اور ادب غیر (دوسرے کی موجودگی) کا تقاضا کرتا ہے، اور وہاں ایک ایسا مقام ہے جو اغیار (غیروں) کو فنا (الفناء) کر دیتا ہے، پس ادب زائل ہو جاتا ہے، کیونکہ وہاں کوئی نہیں ہے جس کے ساتھ ادب کیا جائے۔\n\nلیکن عام سالکینِ طریقت اور ان میں سے اکثر خواص کی زبان میں، حقیقت (الحقیقۃ) کے ساتھ ترکِ ادب کا مقام ہی وہ مقام ہے جو عموم اور خصوص میں واقع اور مشروع ہے۔ اور یہ ایک جلیل القدر مقام ہے جس پر صرف اہلِ اللہ میں سے مردانِ کار (الذکران) اور اصحابِ مقامات کے شہسوار ہی قائم ہوتے ہیں، نہ کہ اصحابِ احوال۔ اور پورا قرآن اسی مقام میں نازل ہوا ہے، سوائے چند انفرادی آیات کے جن کا ذکر ہم نے باب کے شروع میں کیا ہے۔ اور اس مقام میں صرف دو طرح کے لوگ حیران ہوتے ہیں: ایک وہ جس پر اس کا کشف (الکشف) ہوا ہو، اور دوسرا وہ جو اس کا مشاہدہ (الشہود) کر رہا ہو۔\n\nپس حقیقت (الحقیقۃ) اسے طلب کرتی ہے اور حقِ موضوع (وہ حق جو شریعت میں مقرر ہے) اسے طلب کرتا ہے۔ اور ان میں سے ایک کے ساتھ ادب دوسرے کے ساتھ ترکِ ادب ہے۔ اور تم ترجیح (ایک کو دوسرے پر فوقیت دینے) کے مقام پر آ گئے ہو، حالانکہ تمہیں اس کا حق نہیں ہے۔ پس بعض مردانِ حق وہ ہیں جو اپنے اعتقاد اور باطن میں حقِ موضوع (شریعت) کا ادب ترک کر دیتے ہیں، اور اپنے ظاہر میں حقیقت (الحقیقۃ) کا ادب ترک کر دیتے ہیں۔ اور وہ اپنے ظاہر میں حق (الحق) کے ساتھ مؤدب ہوتے ہیں، لیکن حقیقت (الحقیقۃ) کے ساتھ اپنے ظاہر میں غیر مؤدب ہوتے ہیں۔ اور وہ اپنے باطن میں حقیقت (الحقیقۃ) کے ساتھ مؤدب ہوتے ہیں، لیکن حق (الحق) کے ساتھ اپنے باطن میں غیر مؤدب ہوتے ہیں، کیونکہ انہوں نے دیکھا کہ نجات اور سعادت اسی میں ہے، اور اگر معاملہ الٹ دیا جائے تو وہ شقاوت ہے۔ پس یہ قاعدہ جاری ہوتا ہے اور الٹا نہیں ہوتا۔\n\nاور ایک گروہ کہتا ہے کہ حق (الحق) کے ساتھ ادب، جو کہ شریعت ہے، حقیقت (الحقیقۃ) کے ساتھ بھی ادب ہے۔ پس جو اسے یہاں ترک کرتا ہے وہ اسے وہاں بھی ترک کرتا ہے۔ اور وہ اس کی ایک جہت کو نہیں جانتے۔ اور یہ اس لیے ہے کہ حقِ مشروع (شریعت) نے اس امر کو واضح کیا ہے جس کی وجہ سے منع کا حکم دیا گیا، چنانچہ فرمایا: \"اور اس کی غیرت کی وجہ سے اس نے فواحش کو حرام کیا\"، نہ یہ کہ اس نے تحریم کے ذریعے انہیں فواحش بنا دیا۔ اور یہ مسلک بابِ حکمت میں زیادہ داخل ہے، جبکہ مخالف کا مسلک احدیۃ العین (وحدتِ ذات) میں زیادہ داخل ہے۔\n\nاور اس مقام کے لیے بھی رجال (مردانِ حق) ہیں اور اس کے مخالف کے لیے بھی رجال ہیں۔ اور خلاصہ یہ ہے کہ یہ حیرت کا مقام ہے، نہ تو ان لوگوں کے لیے تمام پہلوؤں سے خلاصی ہے اور نہ ان لوگوں کے لیے تمام پہلوؤں سے خلاصی ہے۔ کیونکہ اس باب میں اکثر الٰہی خبریں عقلی دلائل سے متعارض ہوتی ہیں۔ اور اس حیرت سے بڑھ کر اور کون سی حیرت ہو سکتی ہے؟ اور یہی وہ متشابہ ہے جس کے بارے میں اس شخص کو، جسے اللہ نے اس کے علم پر مطلع نہیں کیا، یہ کہنا چاہیے: **آمَنَّا بِهِ كُلٌّ مِّنْ عِندِ رَبِّنَا** (ہم اس پر ایمان لائے، یہ سب ہمارے رب کی طرف سے ہے)۔ لیکن یہ بات **إِلَّا أُولُوا الْأَلْبَابِ** (صرف عقل والے ہی) یاد رکھتے ہیں، اور وہ وہ لوگ ہیں جو عقل کے مغز کو لیتے ہیں نہ کہ اس کے چھلکے کو۔ اور اللہ حق (الحق) فرماتا ہے اور وہی سیدھے راستے کی طرف ہدایت دیتا ہے۔",
    "fa": "باب صد و شصت و نهم در معرفت مقام ترک ادب و اسرار آن\n\nهمه امور را به سوی خداوند نسبت ده، *** و اگر چنین کردی، تو را ادیب (باادب) نخواهند خواند.\nخلیل (ابراهیم) بیماری خود و شفای آن را به خدا نسبت داد، *** و او بر حق بود.\nو همچنین استاد کلیم (موسی) هنگامی که *** کشتی را سوراخ کرد و دیوار را برپا ساخت، شگفت‌انگیز است.\nپس بنده اگر به امور با نفس خود بنگرد، *** او را می‌بینی که گاه خطا می‌کند و گاه صواب.\nپس به پروردگارت در امور بنگر، زیرا او *** در آن امور است، پس گاه حاضر می‌شوی و گاه غایب.\n\nخداوند متعال امرکنان می‌فرماید: «بگو: همه از جانب خداست. پس این قوم را چه شده که نزدیک نیست سخنی را بفهمند؟» (قُلْ كُلٌّ من عِنْدِ الله فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً) در مقام مذمت ایشان؛ یعنی اوست که نیکو را نیکو و زشت را زشت گردانیده است. و خداوند متعال خبردهنده می‌فرماید: «هر یک از اینان و آنان را از عطای پروردگارت مدد می‌رسانیم.» (كُلًّا نُمِدُّ هؤُلاءِ وهَؤُلاءِ من عَطاءِ رَبِّكَ) و مذموم و محمود را ذکر کرد. و خداوند متعال می‌فرماید: «سپس فجور و تقوای آن را به او الهام کرد.» (فَأَلْهَمَها فُجُورَها وتَقْواها)\n\nآن اول (آیات پیشین) در باطن است، زیرا مربوط به اراده (الهی) است، و این (آیه اخیر) در ظاهر است، زیرا جز پس از وقوع مورد اعتبار قرار نمی‌گیرد. پس کسی که ترک ادب می‌کند، از آن حیث که نمی‌داند، خود ادیب است؛ زیرا او همراه با کشف (الکشف) و حکم آن است، نه همراه با آنچه که محجوبان در آن هستند. او علم خداوند را در جریان مقدرات (المقادير) پیش از وقوعشان مشاهده می‌کند، پس به سوی آن‌ها می‌شتابد. آنگاه زبان موطن (مردم عادی) بر او جاری می‌شود که او با حق (الحق) بی‌ادب است، زیرا مخالف است. در حالی که این نهایت ادب با حق است، اما بیشتر مردم درک نمی‌کنند.\n\nو برخی از ایشان در مقام ادلال (ناز و دلبری) اقامه می‌شوند، مانند عبدالقادر گیلانی در بغداد که سید وقت خود بود. و برخی دیگر وقتشان در آن است که «من گوش و چشم او هستم» (اشاره به حدیث قدسی). و ادب مستلزم وجود غیر است، و در آنجا مقامی است که اغیار (غیرها) را فانی می‌کند (الفناء)، پس ادب از میان می‌رود، زیرا در آنجا «با چه کسی» وجود ندارد. اما به زبان عامه اهل طریقت و خواصِ بیشتر ایشان، مقام ترک ادب با حقیقت (الحقيقة) همان واقع مشروع در عموم و خصوص است. و آن مقامی بزرگ است که جز مردان (الذکران) از اهل الله و فحول صاحبان مقامات (المقامات) - نه صاحبان احوال (الأحوال) - در آن توقف نمی‌کنند. و تمام قرآن در این مقام نازل شده است، مگر آیات منفردی که در ابتدای باب ذکر کردیم.\n\nو در این مقام متحیر نمی‌شود مگر دو مرد: کسی که کشف (الکشف) بر او حاصل شده و کسی که شاهد (الشهود) آن است. پس حقیقت (الحقيقة) او را می‌طلبد و حق وضع شده (الحق الموضوع) او را می‌طلبد. و ادب با یکی از آن دو، ترک ادب با دیگری است، و تو در مقام ترجیح قرار گرفته‌ای، در حالی که این حق تو نیست.\n\nپس برخی از مردان هستند که ادب حق وضع شده (الحق الموضوع) را از اعتقاد و باطن خود ترک می‌کنند و ادب حقیقت (الحقيقة) را از ظاهر خود ترک می‌کنند. و در ظاهر خود با حق (الحق) ادیب هستند و با حقیقت (الحقيقة) در ظاهر خود بی‌ادب، و در باطن خود با حقیقت ادیب هستند و با حق در باطن خود بی‌ادب؛ زیرا دیده‌اند که نجات و سعادت در این است، و اگر امر برعکس شود، شقاوت است. پس این قاعده جاری است و برعکس نمی‌شود.\n\nو گروهی دیگر می‌گویند که ادب با حق (الحق) که همان شریعت (الشرع) است، ادب با حقیقت (الحقيقة) است. پس هر کس آن را در اینجا ترک کند، در آنجا نیز ترک کرده است. و اینان از یک جهت آگاه نیستند. و این بدان سبب است که حق مشروع (الحق المشروع) امری را بیان کرده که به خاطر آن حکم به منع داده است، و فرموده: «و از غیرت اوست که فواحش را حرام کرده است»، نه اینکه با تحریم، آن‌ها را فاحشه قرار داده باشد. و این مذهب بیشتر در باب حکمت وارد است، و مذهب مخالف بیشتر در احدیت عین (أحدية العين) وارد است. و برای این مقام مردانی هستند و برای مخالف آن نیز مردانی.\n\nو در مجموع، این موضع حیرت است که نه برای این گروه از همه جهات رهایی است و نه برای آن گروه از همه جهات. زیرا بیشتر اخبارات الهی در این باب با ادله عقلی تعارض دارند، و چه حیرتی بزرگ‌تر از این حیرت؟ و این همان متشابه است که شایسته است کسی که خداوند او را بر علم آن آگاه نساخته، در مورد آن بگوید: «به آن ایمان آوردیم، همه از جانب پروردگار ماست.» (آمَنَّا بِهِ كُلٌّ من عِنْدِ رَبِّنا) اما جز صاحبان خرد (أُولُوا الْأَلْبابِ) متذکر نمی‌شوند، و ایشان کسانی هستند که مغز عقل را می‌گیرند نه پوست آن را. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند. (وَهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 1
}