{
  "id": 426,
  "title": {
    "ar": "الباب السادس والعشرون وأربعمائة في معرفة منازلة السر الذي قال منه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حين استفهم عن رؤية ربه فقيل له رأيت ربك في ليلة الإسراء فقال نور إني أراه",
    "en": "Chapter Four Hundred and Twenty-Six: Concerning the Gnosis of the Stations of the Secret (السر) from which the Messenger of Allah (peace and blessings be upon him) spoke when he was questioned about the vision of his Lord, and it was said to him, \"Did you see your Lord on the Night of the Night Journey (الإسراء)?\" and he replied: \"Light, how could I see Him?\" (نور إني أراه).",
    "ur": "باب چار سو چھبیس: اس راز (السر) کے منازل (منازل) کی معرفت میں جس کے بارے میں رسول اللہ صلی اللہ علیہ وسلم نے تب فرمایا جب آپ سے اپنے رب کی رؤیت (رؤية) کے بارے میں استفسار کیا گیا، اور آپ سے پوچھا گیا کہ کیا آپ نے شبِ اسراء (الإسراء) میں اپنے رب کو دیکھا؟ تو آپ نے جواب دیا: \"نور (نور)، میں اسے دیکھتا ہوں۔\"",
    "fa": "باب چهارصد و بیست و ششم در معرفت منازل سِرّی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) از آن سخن گفت، هنگامی که درباره رؤیت پروردگارش سؤال شد و به او گفته شد: آیا پروردگارت را در شب اسراء دیدی؟ پس فرمود: نوری است که آن را می‌بینم."
  },
  "content": {
    "ar": "## «الباب السادس والعشرون وأربعمائة في معرفة منازلة السر الذي قال منه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حين استفهم عن رؤية ربه فقيل له رأيت ربك في ليلة الإسراء فقال نور إني أراه»\n\n\n> النور كيف يراه الظل وهو به *** قد قام في الكون عينا في تجليه‏\n\n\n> فإن تحلى بنعت النور كان له *** حكم التجلي ولكن في تحلئة\n\n\n> الروح ظل وعين الجسم يبديه *** من نور ذات يراه في تدليه‏\n\n\n> وليس يدري الذي قلناه غير فتى *** ذي خلوة فيراه في تخلية\n\n\n> وقد يراه الذي ولى بصورته *** عنه فبان له لدى توليه‏\n\n\n### [حجاب النورية والظلمية]\n\n\nقال الله عز وجل الله نُورُ السَّماواتِ والْأَرْضِ فمن النور من يدرك به ولا يدرك في نفسه فهو حجاب عليك عن نفسه وأنت والعلم حجاب عليك وقوله صَلَّى اللهُ عَليهِ وسَلَّم إن لله سبعين ألف حجاب أو سبعين حجابا الشك مني من نور وظلمة\nالحديث فحجاب النور من هذه الحجب واحد والظلم الحجابية ما بقي من هذا العدد فهو عين الحجاب عليك وهو المحتجب فيه فبنفسه احتجب فالنور لا يرى أبدا والظلمة وإن حجبت فإنها مرئية للمناسبة التي بينها وبين الرائي فإنه ما ثم ظلمة وجودية إلا ظلمة الأكوان وكان صَلَّى اللهُ عَليهِ وسَلَّم يسأل الله في دعائه أن يجعله نورا\n\n\nلما علم إن الله هو النور وعلم إن النور الأدنى يندرج في النور الأعلى وعلم إن الحق هو جميع ما يكون به العبد عبدا من جميع الوجوه وأنه من حيث هويته لا نعت له ولا صفة فعلم إن نسبة النعتية إليه والصفة ما هو غير الحق لا من حيث صفة الحق بل من هويته ولا يذكر العبد بهويته وإنما يذكر بما يقوم به من الصفات وليست إلا هوية الحق ف\n\n\nقوله واجعلني نورا\n\n\nواجعلني أنت وأنت‏\n\n\nلا يكون بالجعل فقال له أقمني في علم شهود أني أنت حتى أتميز عن غيري من هويات العالم فأعلمهم وأعلم من أنا وهم لا يعلمون وإذا كان الأمر على هذا فما اندرج نور في نور وإنما هو نور واحد في عين صورة خلق فانظر ما أعجب هذا الاسم فالخلق ظلمة ولا يقف للنور فإنه ينفرها والظلمة لا ترى النور وما ثم نور إلا النور الحق فلهذا\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم نور إني أراه‏\n\n\nفإنه ما رآه مني إلا هويته وظلمتي لا تدركه وهذا سر خفي عن إدراك الأدلة النظرية وعن إدراك الشهود في الصور وهو من أسنى العلوم الإلهية الواضحة فلم يدركها من العبد إلا هو فهو العلم والعالم والمعلوم في هذه المسألة ولما فصل الإضافة إلى السموات وهو ما غاب من القوي وعلا وإلى الأرض وهو ما ظهر من القوي الحسية ودنا قال الله تعالى إنه عين نفورها عن ذاتها فلم يشهد إلا هو فهو عين السموات والأرض ولم نقل كما قال فيه المفسر معناه منور أو هاد فذلك له اسم خاص وهو الهادي الذي هداهم لإباية حمل الأمانة وإلى الإتيان بالطاعة لأمره فهو من باب إجابة الأسماء للأسماء إذا دعا بعضها بعضا فذلك علم آخر إلهي وأما هنا فما قال إلا أنه نور السموات والأرض والنور النفور ويؤيد ذلك التشبيه بالمصباح على الوصف الخاص فإن مثل هذا النور المصباحي ينفر ظلمة الليل بل هو عين نفور ظلمة الليل مع بقاء الليل ليلا فإنه ليس من شرط وجود الليل وجود الظلمة وإنما عين الليل غروب الشمس إلى حين طلوعها سواء أعقب المحل نور آخر سوى نور الشمس أو ظلمة فوقع الغلط في ماهية الليل ما هي ولهذا قال والليل إذا سجي فلو كان عين الليل عين الظلمة ما نعته بأنه أظلم فقد يكون الليل ولا ظلمة كما أنه قد يكون النهار ولا ضوء فإن النهار ليس إلا زمان طلوع الشمس إلى غروبها وإن طلعت مكسوفة فلا يزول الحكم عن كون النهار موجودا فإن قيل ما سمي النهار نهارا إلا لاتساع الضوء فيه قلنا وإن كان فلا يقدح فيما ذهبنا إليه من ماهية النهار فإن ذلك الكسوف أمر عارض لا يقدح في طلوع الشمس ولو أظلمت في نفسها فكيف وعلة الكسوف لها معلوم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Four Hundred and Twenty-Six: Concerning the Knowledge of the Station of the Secret about which the Messenger of Allah (PBUH) spoke when asked about the vision of his Lord, and he was asked, \"Did you see your Lord on the Night of the Ascension (الإسراء)?\" and he replied, \"A Light, indeed I see Him.\"\n\nHow can the Light be seen by the shadow, when the shadow stands by the Light / as an essence in the cosmos (الكون) through its Theophany (التجلي)?\n\nIf it is adorned with the attribute of the Light, it will possess / the ruling of the Theophany, but only within the adornment itself.\n\nThe Spirit (الروح) is a shadow, and the essence of the body manifests it / from the Light of an Essence (الذات) which it sees in its descent.\n\nNo one knows what we have stated except a youth / who possesses spiritual retreat (خلوة), seeing it in isolation.\n\nAnd he who turns away may see it in its form / away from himself, so it becomes manifest to him upon his turning away.\n\n### [The Veil of Luminosity and Darkness]\n\nAllah Almighty said: <<الله نُورُ السَّماواتِ والْأَرْضِ>> (Allah is the Light of the heavens and the earth). So, from the Light (النور), there is that by which one perceives, but which is not perceived in itself. This is a veil (حجاب) over you from itself, and you, along with Knowledge (العلم), are a veil over yourself. Concerning his saying (PBUH): \"Indeed, Allah has seventy thousand veils, or seventy veils—the doubt is mine—of Light and Darkness...\" (the Hadith). The veil of Light (حجاب النور) among these veils is one, and the veiling darkness (الظلم الحجابية) is the remainder of this number. This remainder is the very essence of the veil (عين الحجاب) over you, and it is that within which the veiling occurs. Thus, He veiled Himself by Himself. Therefore, the Light is never seen. And Darkness (الظلمة), even though it veils, is visible due to the suitability (المناسبة) between it and the viewer, for there is no existential darkness except the darkness of the created things (الأكوان). The Prophet (PBUH) used to ask Allah in his supplication to make him Light.\n\nThis was because he knew that Allah is the Light, and he knew that the lower light (النور الأدنى) is subsumed within the higher light (النور الأعلى). He also knew that The Real (الحق) is everything by which the servant becomes a servant in all respects, and that The Real, in terms of His Ipseity (هويته), has neither attribute (نعت) nor quality (صفة). Thus, he knew that the attribution of qualities and attributes to Him is nothing other than The Real, not in terms of the attribute of The Real, but from His Ipseity. The servant is not mentioned by his Ipseity, but rather by the attributes that subsist in him, and these attributes are nothing other than the Ipseity of The Real.\n\nTherefore, his saying, \"And make me Light,\" means \"Make me You,\" and You cannot be made by an act of making. So, he was saying to Him: \"Establish me in the knowledge of witnessing (علم شهود) that I am You, so that I may be distinguished from the other Ipseities (هويات) of the cosmos (العالم). Then I will know them, and I will know who I am, while they do not know.\" If the matter is thus, then no light is subsumed within another light; rather, it is one single Light (نور واحد) in the very essence of a created form. Look at how wondrous this Name is! Creation (الخلق) is darkness and cannot stand against the Light, for the Light repels it. Darkness does not see the Light, and there is no light whatsoever except the Light of The Real (النور الحق). For this reason, the Prophet (PBUH) said: \"A Light, indeed I see Him.\" For what he saw of Him was only His Ipseity, and my darkness cannot perceive Him. This is a secret hidden from the perception of theoretical proofs (الأدلة النظرية) and from the perception of witnessing (الشهود) in forms. Yet, it is among the clearest and most sublime Divine Sciences (العلوم الإلهية). Thus, none of the servant perceived it except Him (The Real). Therefore, He is the Knowledge (العلم), the Knower (العالم), and the Known (المعلوم) in this matter.\n\nWhen He specified the attribution to the heavens—which is what is hidden of the powers and is elevated—and to the earth—which is what is manifest of the sensory powers and is near—Allah Almighty said that He is the very essence of their repulsion (نفورها) from their own essences (ذاتها). Thus, nothing is witnessed except Him, and He is the very essence (عين) of the heavens and the earth. We do not say, as the exegete said concerning it, that its meaning is \"Illuminator\" or \"Guide.\" For that has a specific Name, which is The Guide (الهادي), Who guided them to refuse the bearing of the Trust (الأمانة) and to perform obedience to His command. That falls under the category of the Names responding to the Names when some call upon others, and that is another Divine Science. But here, He only said that He is the Light of the heavens and the earth, and the Light is the Repeller (النور النفور). This is supported by the simile of the lamp (المصباح) based on the specific description. For the like of this lamp-light repels the darkness of the night; indeed, it is the very essence of the repulsion of the night's darkness, even while the night remains night. For the existence of darkness is not a condition for the existence of night. Rather, the essence of night is the time from the setting of the sun until its rising, regardless of whether the location is followed by another light besides the sun's light, or by darkness. Thus, an error occurred regarding what the quiddity (ماهية) of the night is. For this reason, He said: <<والليل إذا سجي>> (And the night when it covers). If the essence of the night were the essence of darkness, He would not have described it as covering. So, night may exist without darkness, just as day may exist without light. For the day is nothing but the time from the rising of the sun until its setting. Even if it rises eclipsed, the ruling that the day exists is not removed. If it is said that the day is only named *nahār* (day) because of the expansion of light within it, we reply: Even if that were the case, it does not invalidate our understanding of the quiddity of the day. For that eclipse is an accidental matter (أمر عارض) that does not invalidate the rising of the sun, even if the sun itself were darkened. How much more so when the cause of the eclipse is known to it? <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks The Truth (الحق), and He guides to the way).",
    "ur": "باب نمبر چار سو چھبیس: اس راز کے مقامات کی معرفت میں جس کے بارے میں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب آپ سے اپنے رب کے دیدار کے بارے میں پوچھا گیا، تو آپ سے کہا گیا: کیا آپ نے شبِ معراج اپنے رب کو دیکھا؟ تو آپ نے فرمایا: \"نور ہے، میں اسے دیکھتا ہوں۔\"\n\nنور کو سایہ کیسے دیکھ سکتا ہے، جبکہ وہ (سایہ) اسی (نور) کے ذریعے کائنات میں اپنے ظہور الٰہی (التجلی) میں قائم ہے۔\nپس اگر وہ (سایہ) نور کی صفت سے متصف ہو جائے، تو اس کے لیے ظہور الٰہی (التجلی) کا حکم ہوگا، لیکن یہ ایک خاص صفت کے ساتھ ہوگا۔\nروح سایہ ہے اور جسم کی حقیقت اسے ظاہر کرتی ہے، اس نورِ ذات سے جسے وہ اپنے نزول میں دیکھتا ہے۔\nاور جو کچھ ہم نے کہا ہے، اسے خلوت نشین جوان کے سوا کوئی نہیں جانتا، جو اسے خلوت (تخلیہ) میں دیکھتا ہے۔\nاور کبھی اسے وہ شخص بھی دیکھ لیتا ہے جو اپنی صورت کے ساتھ اس سے منہ موڑ لیتا ہے، تو وہ (نور) اس کے منہ موڑنے کے وقت اس پر ظاہر ہو جاتا ہے۔\n\n### [نوری اور ظلمتی حجاب]\n\nاللہ عز وجل نے فرمایا: \"اللَّهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ\" (اللہ آسمانوں اور زمین کا نور ہے)۔ پس نور میں سے وہ ہے جس کے ذریعے ادراک کیا جاتا ہے، لیکن وہ بذاتِ خود ادراک نہیں کیا جاتا۔ لہٰذا وہ (نور) تم پر تمہاری اپنی ذات سے حجاب ہے، اور تم اور علم تم پر حجاب ہیں۔ اور آپ صلی اللہ علیہ وسلم کا یہ فرمان کہ: \"بے شک اللہ کے ستر ہزار حجاب ہیں یا ستر حجاب ہیں (شک مجھ سے ہے) نور اور ظلمت کے\" (حدیث)۔ پس ان حجابات میں سے نور کا حجاب ایک ہے، اور باقی ماندہ تعداد ظلمتی حجابات کی ہے، جو تم پر عین حجاب ہیں اور جس میں وہ (ذات حق) محتجب ہے۔ پس اس نے اپنی ذات سے پردہ کیا ہے۔ لہٰذا نور کبھی نہیں دیکھا جاتا، اور ظلمت اگرچہ حجاب ہے، لیکن وہ دیکھنے والے اور اس کے درمیان موجود مناسبت کی وجہ سے مرئی ہے۔ کیونکہ وجودی ظلمت صرف اکوان (کائناتوں) کی ظلمت ہے۔ اور آپ صلی اللہ علیہ وسلم اپنی دعا میں اللہ سے سوال کرتے تھے کہ آپ کو نور بنا دے۔\n\nجب آپ نے جان لیا کہ اللہ ہی نور ہے، اور جان لیا کہ ادنیٰ نور اعلیٰ نور میں شامل ہو جاتا ہے، اور جان لیا کہ ذات حق (الحق) وہ سب کچھ ہے جس کے ذریعے بندہ ہر لحاظ سے بندہ بنتا ہے، اور یہ کہ اپنی ہویت (ھویۃ) کے اعتبار سے اس کی کوئی نعت یا صفت نہیں ہے، تو آپ نے جان لیا کہ اس کی طرف نعت اور صفت کی نسبت وہ ہے جو ذات حق (الحق) کے علاوہ ہے، نہ کہ ذات حق (الحق) کی صفت کے لحاظ سے، بلکہ اس کی ہویت (ھویۃ) کے لحاظ سے۔ اور بندے کا ذکر اس کی ہویت (ھویۃ) سے نہیں کیا جاتا، بلکہ ان صفات سے کیا جاتا ہے جو اس کے ساتھ قائم ہیں، اور وہ صفات ذات حق (الحق) کی ہویت (ھویۃ) کے سوا کچھ نہیں ہیں۔ پس آپ کا یہ فرمان: \"اور مجھے نور بنا دے\" (واجعلني نورا)، یعنی \"مجھے تو بنا دے\"، اور تو (ذات حق) جعل (بنائے جانے) سے نہیں ہوتا۔ پس آپ نے فرمایا: مجھے اس علمِ شہود (الشہود) میں قائم کر دے کہ میں تو ہی ہوں، تاکہ میں عالم کی دیگر ہویات (ھویات) سے ممتاز ہو جاؤں، پس میں انہیں جانوں اور جانوں کہ میں کون ہوں، جبکہ وہ نہیں جانتے۔ اور جب معاملہ اس طرح ہے، تو کوئی نور کسی نور میں شامل نہیں ہوا، بلکہ وہ ایک ہی نور ہے جو خلق کی صورت کی حقیقت میں ہے۔ پس دیکھو یہ اسم کتنا عجیب ہے۔ خلق ظلمت ہے اور نور کے سامنے ٹھہر نہیں سکتی، کیونکہ نور اسے بھگا دیتا ہے، اور ظلمت نور کو نہیں دیکھتی۔ اور ذات حق (الحق) کے نور کے سوا کوئی نور نہیں ہے۔ اسی لیے\n\nآپ صلی اللہ علیہ وسلم نے فرمایا: \"نور ہے، میں اسے دیکھتا ہوں\" (نور إني أراه)۔ کیونکہ آپ نے مجھ میں سے صرف میری ہویت (ھویۃ) کو دیکھا، اور میری ظلمت اس کا ادراک نہیں کر سکتی۔ اور یہ ایک ایسا راز ہے جو نظری دلائل کے ادراک سے اور صورتوں میں شہود (الشہود) کے ادراک سے پوشیدہ ہے۔ اور یہ واضح علومِ الٰہیہ میں سے سب سے اعلیٰ ہے۔ پس بندے میں سے اس کا ادراک اس (ذات حق) کے سوا کسی نے نہیں کیا۔ لہٰذا اس مسئلے میں وہی علم، عالم اور معلوم ہے۔ اور جب اس نے اضافت کو آسمانوں کی طرف الگ کیا، جو کہ قویٰ (قوتوں) میں سے غائب اور بلند ہیں، اور زمین کی طرف الگ کیا، جو کہ حسی قویٰ میں سے ظاہر اور قریب ہیں، تو اللہ تعالیٰ نے فرمایا کہ وہ (نور) ان (آسمانوں اور زمین) کا اپنی ذات سے نفور (بھاگنے) کی حقیقت ہے۔ پس اس (ذات حق) کے سوا کسی کا شہود (الشہود) نہیں ہوا، لہٰذا وہ آسمانوں اور زمین کی حقیقت ہے۔ اور ہم نے یہ نہیں کہا جیسا کہ مفسر نے اس کے بارے میں کہا کہ اس کا مطلب منور کرنے والا یا ہدایت دینے والا ہے، کیونکہ اس کے لیے ایک خاص اسم ہے، اور وہ ہے \"الہادی\" (ہدایت دینے والا)، جس نے انہیں امانت اٹھانے سے انکار کرنے کی طرف اور اس کے حکم کی اطاعت کرنے کی طرف ہدایت دی۔ پس یہ اسماء کا اسماء کو جواب دینے کے باب سے ہے جب وہ ایک دوسرے کو پکارتے ہیں، اور یہ ایک دوسرا علمِ الٰہی ہے۔ لیکن یہاں تو اس نے صرف یہ کہا کہ وہ آسمانوں اور زمین کا نور ہے، اور نور نفور (بھاگنے والا) ہے۔ اور اس کی تائید خاص وصف کے ساتھ چراغ (مصباح) کی تشبیہ سے ہوتی ہے، کیونکہ اس طرح کا چراغی نور رات کی ظلمت کو بھگا دیتا ہے، بلکہ وہ رات کی ظلمت کے بھاگنے کی عین حقیقت ہے، باوجود اس کے کہ رات رات ہی رہتی ہے۔ کیونکہ رات کے وجود کی شرط ظلمت کا وجود نہیں ہے، بلکہ رات کی حقیقت سورج کے غروب ہونے سے لے کر اس کے طلوع ہونے تک کا وقت ہے، خواہ اس جگہ سورج کے نور کے علاوہ کوئی دوسرا نور ہو یا ظلمت ہو۔ پس رات کی ماہیت کیا ہے، اس میں غلطی واقع ہوئی ہے۔ اسی لیے اللہ نے فرمایا: \"وَاللَّيْلِ إِذَا سَجَىٰ\" (اور رات کی قسم جب وہ چھا جائے)۔ اگر رات کی حقیقت عین ظلمت ہوتی، تو وہ اسے اندھیرا ہونے کی صفت سے متصف نہ کرتا۔ پس رات ہو سکتی ہے اور ظلمت نہ ہو، جیسا کہ دن ہو سکتا ہے اور روشنی نہ ہو۔ کیونکہ دن صرف سورج کے طلوع ہونے سے لے کر غروب ہونے تک کا وقت ہے، اور اگر وہ گرہن زدہ (مکسوف) ہو کر طلوع ہو، تب بھی دن کے موجود ہونے کا حکم زائل نہیں ہوتا۔ اگر کہا جائے کہ دن کو دن صرف اس لیے کہا جاتا ہے کہ اس میں روشنی پھیلی ہوتی ہے، تو ہم کہیں گے کہ اگرچہ ایسا ہے، لیکن یہ ہماری بیان کردہ دن کی ماہیت میں کوئی نقص پیدا نہیں کرتا، کیونکہ وہ گرہن ایک عارضی امر ہے جو سورج کے طلوع ہونے میں نقص پیدا نہیں کرتا، خواہ وہ بذاتِ خود تاریک ہو جائے، تو پھر کیسے (جبکہ گرہن کی علت معلوم ہے)۔ \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و بیست و ششم در معرفت جایگاه‌های (منازل) سِرّی که رسول خدا (صلی الله علیه و سلم) از آن سخن گفت، هنگامی که درباره رؤیت پروردگارش پرسیده شد و به او گفته شد: آیا پروردگارت را در شب معراج دیدی؟ فرمود: «نور است، من او را می‌بینم» (نور إني أراه).\n\nچگونه سایه، نور را ببیند، در حالی که سایه به واسطه نور در هستی (الکون) به صورت عین (حقیقت) در تجلی (التجلی) آن برپا شده است؟\n\nپس اگر [سایه] به وصف نور آراسته شود، حکم تجلی (التجلی) برای او خواهد بود، اما در آراستگی [به آن].\n\nروح سایه است و عین جسم آن را آشکار می‌سازد، از نور ذاتی که آن را در فرود آمدنش می‌بیند.\n\nو آنچه گفتیم را نمی‌داند مگر جوانی که صاحب خلوت است و آن را در تخلیه (تخلیة) می‌بیند.\n\nو چه بسا کسی که با صورت خود از آن روی برگردانده، آن را ببیند، پس هنگام روی برگرداندن برایش آشکار شود.\n\n### [حجاب نوری و ظلمانی]\n\nخداوند عز و جل فرمود: «اللَّهُ نُورُ السَّماواتِ وَالْأَرْضِ» (خداوند نور آسمان‌ها و زمین است). پس از نور، کسی است که به واسطه آن درک می‌شود اما خودش درک نمی‌شود؛ پس آن حجابی است بر تو از خودش، و تو و علم، حجابی بر تو هستید. و سخن پیامبر (صلی الله علیه و سلم) که فرمود: «إن لله سبعين ألف حجاب أو سبعين حجابا الشك مني من نور وظلمة» (همانا برای خداوند هفتاد هزار حجاب یا هفتاد حجاب است – شک از من است – از نور و ظلمت)؛ پس حجاب نور از این حجاب‌ها یکی است و ظلمت‌های حجاب‌ساز، باقی‌مانده این عدد هستند. پس آن [ظلمت] عین حجاب بر توست و او [حق] در آن محتجب شده است. پس به واسطه خودش محتجب شد. نور هرگز دیده نمی‌شود، اما ظلمت اگرچه حجاب است، به دلیل مناسبتی که میان آن و بیننده وجود دارد، مرئی است؛ زیرا هیچ ظلمت وجودی (وجودية) نیست مگر ظلمت کائنات (الأکوان). و پیامبر (صلی الله علیه و سلم) در دعای خود از خداوند می‌خواست که او را نور قرار دهد.\n\nچون دانست که خداوند همان نور است و دانست که نور پایین‌تر (الأدنى) در نور بالاتر (الأعلى) مندرج می‌شود، و دانست که حق (الحق) تمام آن چیزی است که بنده به واسطه آن از جمیع وجوه، بنده می‌شود، و اینکه او از حیث هویتش (هویته) هیچ نعت و صفتی ندارد، پس دانست که نسبت نعت و صفت به او، چیزی است که غیر حق نیست، نه از حیث صفت حق، بلکه از هویت اوست. و بنده به هویتش ذکر نمی‌شود، بلکه به صفاتی که به او قائم است ذکر می‌شود، و آن صفات چیزی جز هویت حق (هوية الحق) نیست.\n\nپس سخن او [پیامبر] که فرمود: «و مرا نور قرار ده» (واجعلني نورا)، یعنی «مرا تو قرار ده»، در حالی که تو (أنت) با جعل (قرار دادن) حاصل نمی‌شود. پس [پیامبر] به خداوند گفت: مرا در علم شهود (شهود) برپا دار که من تو هستم، تا از سایر هویت‌های عالم متمایز شوم، پس من آنان را بشناسم و بدانم که من کیستم، در حالی که آنان نمی‌دانند. و اگر امر بر این باشد، نوری در نور دیگر مندرج نشده است، بلکه آن یک نور واحد است در عین صورت خلق. پس بنگر که این اسم چقدر شگفت‌انگیز است. خلق ظلمت است و در برابر نور نمی‌ایستد، زیرا نور آن را می‌راند. و ظلمت، نور را نمی‌بیند. و هیچ نوری در آنجا نیست مگر نور حق (النور الحق). به همین دلیل:\n\nپیامبر (صلی الله علیه و سلم) فرمود: «نور است، من او را می‌بینم» (نور إني أراه). زیرا آنچه از من دیده، جز هویت (هویته) او نبوده است و ظلمت من او را درک نمی‌کند. و این سِرّی است که از درک ادله نظری و از درک شهود (الشهود) در صور پنهان است، و از والاترین علوم الهی آشکار است. پس هیچ کس از بنده آن را درک نکرده مگر خود او [حق]. پس او در این مسئله، علم و عالم و معلوم است. و هنگامی که اضافه [نور] را به آسمان‌ها که همان قوای غایب و برتر هستند، و به زمین که همان قوای حسی آشکار و نزدیک هستند، جدا کرد، خداوند متعال فرمود که آن [نور] عین رمیدن [ظلمت] از ذات خود است. پس جز او را شهود (یشهد) نکرد، بنابراین او عین آسمان‌ها و زمین است. و ما نگفتیم، چنانکه مفسر در مورد آن گفته است، که معنای آن «منوّر» یا «هادی» است؛ زیرا برای آن [معنا] اسم خاصی وجود دارد و آن «الهادی» است که آنان را به سر باز زدن از حمل امانت و به انجام طاعت امرش هدایت کرد. پس این از باب اجابت اسامی برای اسامی است، هنگامی که برخی از آن‌ها برخی دیگر را می‌خوانند، و این خود علم الهی دیگری است. اما در اینجا، [خداوند] جز این نگفته است که او نور آسمان‌ها و زمین است، و نور، رمنده است. و این امر را تشبیه به چراغ (المصباح) بر وصف خاص تأیید می‌کند؛ زیرا چنین نور چراغی، ظلمت شب را می‌راند، بلکه عین رمیدن ظلمت شب است، با وجود اینکه شب، شب باقی می‌ماند. زیرا شرط وجود شب، وجود ظلمت نیست، بلکه عین شب، غروب خورشید تا هنگام طلوع آن است، چه آن مکان را نور دیگری غیر از نور خورشید فرا گیرد یا ظلمت. پس اشتباه در ماهیت شب رخ داده است که چیست. و به همین دلیل فرمود: «وَاللَّيْلِ إِذَا سَجَى» (سوگند به شب هنگامی که آرام گیرد). پس اگر عین شب، عین ظلمت بود، آن را به تاریک شدن وصف نمی‌کرد. پس ممکن است شب باشد و ظلمتی نباشد، همان‌طور که ممکن است روز باشد و نوری نباشد. زیرا روز چیزی نیست جز زمان طلوع خورشید تا غروب آن، و اگر خورشید کسوف کرده باشد، حکم وجود روز از بین نمی‌رود. اگر گفته شود که روز، روز نامیده نشده مگر به دلیل گسترش نور در آن، می‌گوییم: اگرچه چنین باشد، اما به ماهیت روز که ما به آن معتقدیم، خدشه‌ای وارد نمی‌کند؛ زیرا آن کسوف امری عارضی است که به طلوع خورشید خدشه وارد نمی‌کند، حتی اگر [خورشید] در ذات خود تاریک شود. پس چگونه [چنین نباشد] در حالی که علت کسوف برای آن معلوم است. «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 2
}