{
  "id": 180,
  "title": {
    "ar": "الباب الثمانون ومائة في معرفة مقام الشوق والاشتياق وهو من نعوت المحبين العشاق",
    "en": "Chapter One Hundred and Eighty: Concerning the Gnosis of the Station (مقام) of Longing (الشوق) and Yearning (الاشتياق), which is among the Qualities of the Lovers (المحبين) and the Ardent Devotees (العشاق)",
    "ur": "باب ایک سو اسی (۱۸۰): مقامِ شوق اور اشتیاق کی معرفت کے بیان میں، اور یہ محبینِ عشاق کی صفات میں سے ہے۔",
    "fa": "باب صد و هشتادم در معرفت مقام شوق و اشتیاق، و آن از اوصاف محبان و عشاق است."
  },
  "content": {
    "ar": "### (الباب الثمانون ومائة في معرفة مقام الشوق والاشتياق وهو من نعوت المحبين العشاق)\n> شوق بتحصيل الوصال يزول *** والاشتياق مع الوصال يكون‏\n\n\n> إن التخيل للفراق يديمه *** عند اللقاء فربه مغبون‏\n\n\n> من قال هون صعبة قلنا له *** ما كل صعب في الوجود يهون‏\n\n\n> هو من صفات العشق لا من غيره *** والعشق داء في القلوب دفين‏\n\n\n> ما حكم هذا النعت إلا هاهنا *** وهناك يذهب عينه ويبين‏\n\n\nيقول بعض العشاق‏\n\n\n> فأبكى إن نأوا شوقا إليهم *** وأبكي إن دنوا خوف الفراق‏\n\n\n### [الاشتياق حركة يجدها المحب عند اجتماعه بمحبوبه فرحا به‏]\n\n\nالشوق يسكن باللقاء فإنه هبوب القلب إلى غائب فإذا ورد سكن والاشتياق حركة يجدها المحب عند اجتماعه بمحبوبه فرحا به لا يقدر يبلغ غاية وجده فيه فلو بلغ سكن لأنه لا يشبع منه فإن الحس لا يفي بما يقوم في النفس من تعلقها بالمحبوب فهو كشارب ماء البحر كلما ازداد شربا ازداد عطشا\n\n\nقال عليه السلام منهومان لا يشبعان طالب علم وطالب دنيا\n\n\nمن حيث ما هو محب في تحصيل كل واحد منهما وما للعلم غاية ينتهي إليها فلهذا لا يشبع وكذلك الدنيا فإنها مشتهي النفوس والشهوة تطلبها وقد تجلى ذلك المشتهي في صورة قريبة تسمى دنيا فتعلقت الشهوة بها ثم تنتقل إلى الآخرة في الجنة فتتبعها الشهوة فلا تشبع أبدا لأنها صورة لا يتناهى أمدها ولو لا الشهوة ما طابت الجنة فالشوق ما سكن والاشتياق ما بقي ولنا في هذا الباب‏\n\n\n> ليس يصفو عيش من ذاق الهوى *** دون أن يلقى الذي يعشقه‏\n\n\n> فإذا أبصره يكمه *** ذلك المعنى الذي يقلقه‏\n\n\n> وهو معنى حكمه مختلف *** عند من يعرف ما أطلقه‏\n\n\n### [متعلق الشوق ليس بحاضر إنما متعلقة غائب غير مشهود له في الحال‏]\n\n\nولما كان الحب لا يتعلق إلا بمعدوم كما قدمناه في باب المحبة كذلك الشوق لا يصح أن يتعلق بحاضر وإنما متعلقة غائب غير مشهود له في الحال ولذا كان الشوق من أوصاف المحبة ولهذا يطرد وينعكس فيقال كل محب مشتاق وكل مشتاق محب ومن ليس بمشتاق فليس بمحب ومن ليس بمحب فليس بمشتاق وقد ورد خبر لا علم لي بصحته إن الله تعالى ذكر المشتاقين إليه وقال عن نفسه إنه أشد شوقا إليهم‏\n\n\nكما يليق بجلاله فشوقه إليهم أن ينيلهم الراحة بلقاء من اشتاقوا إليه والوقت المقدر الذي لا يتبدل لم يصل فلا بد من تأخر وجود ما وقع الشوق الإلهي إليه هذا إن صح الخبر ولا علم لي به لا من الكشف ولا من رواية صحيحة إلا أنه مذكور مشهور وقد اتصفت الجنة بالاشتياق إلى علي وسلمان وعمار وبلال وتكلم الناس في ذلك من حيث اشتقاق أسماء هؤلاء من العلو والسلامة والعمران والاستبلال ولكن ما هو محقق فإن الشوق أمر ذوقي ولو خطر لي هذا الخبر حين رأيت الجنة لسألتها عن شوقها لهؤلاء دون غيرهم فإنها أعرف بالسبب الذي أداها إلى الشوق لهؤلاء الأربعة وكذلك النبي صَلَّى اللهُ عَليهِ وسَلَّم قد رأيته مرارا وسألته عن أشياء وما خطر لي أن أسأله عن شوق الجنة لهؤلاء بل شغلني ما كان أهم علي منه والشوق علم ذوق يعرفه كل مشتاق من نفسه‏\n\n",
    "en": "Chapter One Hundred and Eighty: Concerning the Knowledge of the Station (Maqām) of Longing (Shawq) and Intense Yearning (Ishtiyāq), which is among the characteristics (Nu'ūt) of the Loving Devotees ('Ushshāq).\n\nLonging (Shawq) ceases upon the attainment of Union (Wisāl),\nWhile Intense Yearning (Ishtiyāq) occurs alongside Union.\n\nIndeed, the imagination (takhayyul) of separation sustains it\nEven during the meeting; thus, its possessor is fortunate.\n\nTo him who says, \"Make the difficult easy,\" we reply:\nNot every difficulty in Existence (al-Wujūd) is made easy.\n\nIt is among the attributes of Passionate Love ('Ishq), not of anything else,\nAnd Passionate Love is a hidden ailment within the hearts.\n\nThe ruling of this characteristic (na't) is only here [in this world],\nAnd there [in the Hereafter], its essence departs and becomes manifest.\n\nSome of the Loving Devotees ('Ushshāq) say:\n\nI weep if they depart, out of longing (shawq) for them,\nAnd I weep if they draw near, out of fear of separation.\n\n[Intense Yearning (Ishtiyāq) is a movement found by the Lover (al-Muhibb) during his union with his Beloved, rejoicing in Him.]\n\nLonging (Shawq) is calmed by the meeting, for it is the heart’s yearning toward an absent one; thus, when the absent one arrives, the longing ceases. Intense Yearning (Ishtiyāq) is a movement found by the Lover (al-Muhibb) during his union with his Beloved, rejoicing in Him, yet unable to reach the limit of his finding (wajd) in Him. If he were to reach that limit, the yearning would cease, because he is never satiated by Him. The senses (al-Hiss) cannot fulfill the attachment that resides in the soul (al-Nafs) toward the Beloved. Thus, he is like one who drinks seawater: the more he drinks, the thirstier he becomes.\n\nThe Prophet, peace be upon him, said: Two greedy ones are never satiated: the seeker of Knowledge ('Ilm) and the seeker of the world (Dunyā).\n\nThis is because he is a lover (muhibb) in the acquisition of each of them. Since Knowledge ('Ilm) has no limit to which it ends, the seeker is never satiated. Likewise is the world (Dunyā), for it is the object of the soul’s desires (mushtahā al-nufūs), and desire (shahwa) seeks it. That desired object has manifested (tajallā) in a near form called the world (Dunyā), and desire became attached to it. Then it transfers to the Hereafter in Paradise (al-Janna), and desire follows it, never to be satiated, because it is a form whose duration is endless. Were it not for desire, Paradise would not be pleasant. Thus, Longing (Shawq) has not ceased, and Intense Yearning (Ishtiyāq) has not departed. We have written the following concerning this chapter:\n\nThe life of one who tastes Passionate Love (al-Hawā) is not pure\nUnless he meets the one he passionately loves ('ashiquhu).\n\nBut when he beholds Him, that meaning which troubles him\nIs concealed.\n\nAnd it is a meaning whose ruling differs\nAccording to him who knows what it has released.\n\n[The object of Longing (Shawq) is not present; rather, its object is absent and not witnessed (mashhūd) in the current state.]\n\nSince Love (al-Hubb) only relates to that which is non-existent (ma'dūm), as we established in the Chapter on Love, likewise, Longing (Shawq) cannot properly relate to that which is present. Rather, its object is absent, not witnessed (mashhūd) in the current state. For this reason, Longing (Shawq) is one of the attributes of Love (al-Mahabba). Therefore, the relationship is direct and inverse: every lover (muhibb) is one who longs (mushtāq), and every one who longs is a lover. He who does not long is not a lover, and he who is not a lover is not one who longs.\n\nA report has been transmitted—though I have no knowledge of its authenticity—that Allah the Exalted mentioned those who long for Him (al-mushtāqīn), and said of Himself that He longs for them even more intensely.\n\nThis longing is as befits His Majesty (Jalāl). His longing for them is that He grants them rest through the meeting with the One for whom they long. However, the appointed time (al-waqt al-muqaddar), which cannot be changed, has not yet arrived. Therefore, the existence of that toward which the Divine Longing (al-Shawq al-Ilāhī) is directed must necessarily be delayed. This is provided the report is authentic, though I have no knowledge of it, neither through Unveiling (Kashf) nor through a sound narration (riwāya sahīha); it is merely mentioned and well-known.\n\nFurthermore, Paradise (al-Janna) has been described as intensely yearning (ishtiyāq) for Ali, Salman, Ammar, and Bilal. People have discussed this based on the derivation of their names from the concepts of loftiness (al-'uluw), soundness (al-salāma), flourishing (al-'umrān), and refreshment (al-istiblāl). However, this is not verified, for Longing (Shawq) is a matter of direct spiritual experience (dhawqī). Had this report occurred to me when I saw Paradise, I would have asked it about its yearning for these four specifically, rather than others, for Paradise would know best the reason that led it to yearn for these four. Likewise, I have seen the Prophet, peace and blessings be upon him, many times and asked him about various matters, but it never occurred to me to ask him about Paradise’s longing for these individuals. Rather, I was preoccupied with what was more important to me than that. Longing (Shawq) is a knowledge of direct spiritual experience (dhawq) that every one who longs knows within himself.",
    "ur": "(باب ایک سو اسی: مقامِ شوق اور اشتیاق کی معرفت میں، اور یہ محبینِ عشاق کی صفات میں سے ہے)\n\nشوق وصال کے حصول سے زائل ہو جاتا ہے\nاور اشتیاق وصال کے ساتھ ہوتا ہے\n\nبے شک فراق کا تصور اسے (اشتیاق کو) ملاقات کے وقت بھی باقی رکھتا ہے، پس اس کا رب (یعنی دل) خسارے میں ہے\n\nجس نے کہا کہ مشکل کو آسان کر، ہم نے اسے کہا:\nہستی (الوجود) میں ہر مشکل آسان نہیں ہوتی\n\nیہ عشق کی صفات میں سے ہے، کسی اور کی نہیں\nاور عشق دلوں میں چھپی ہوئی ایک بیماری ہے\n\nاس صفت کا حکم صرف یہیں (دنیا میں) ہے\nاور وہاں (آخرت میں) اس کی حقیقت زائل ہو جائے گی اور ظاہر ہو جائے گی\n\n(بعض عشاق کہتے ہیں)\nپس میں روتا ہوں اگر وہ دور ہوں، ان کے شوق میں\nاور میں روتا ہوں اگر وہ قریب ہوں، فراق کے خوف سے\n\n***\n\n### [اشتیاق ایک حرکت ہے جسے محب اپنے محبوب سے ملنے پر خوشی کے ساتھ پاتا ہے]\n\nشوق ملاقات سے ساکن ہو جاتا ہے، کیونکہ یہ غائب کی طرف دل کا جھکاؤ ہے۔ جب وہ (غائب) حاضر ہو جاتا ہے تو شوق ساکن ہو جاتا ہے۔ اور اشتیاق ایک حرکت ہے جسے محب (المحب) اپنے محبوب (المحبوب) سے ملنے پر خوشی کے ساتھ پاتا ہے، کیونکہ وہ اپنے وجد کی انتہا کو نہیں پہنچ سکتا۔ اگر وہ انتہا کو پہنچ جاتا تو ساکن ہو جاتا، لیکن وہ اس سے سیر نہیں ہوتا۔ کیونکہ حواس اس چیز کو پورا نہیں کر سکتے جو نفس میں محبوب سے تعلق کی وجہ سے قائم ہے۔ پس یہ سمندر کا پانی پینے والے کی طرح ہے کہ جتنا زیادہ پیتا ہے، اتنا ہی زیادہ پیاسا ہوتا ہے۔\n\nآپ صلی اللہ علیہ وسلم نے فرمایا: \"دو حریص ہیں جو سیر نہیں ہوتے: طالب علم اور طالب دنیا۔\" (منهومان لا يشبعان طالب علم وطالب دنيا)\n\nیہ اس لحاظ سے ہے کہ وہ دونوں ان میں سے ہر ایک کے حصول میں محب ہیں۔ اور علم کی کوئی انتہا نہیں ہے جہاں وہ ختم ہو جائے، اسی لیے وہ سیر نہیں ہوتا۔ اور اسی طرح دنیا بھی، کیونکہ یہ نفوس کی مشتہیٰ ہے اور شہوت اسے طلب کرتی ہے۔ اور وہ مشتہیٰ ایک قریبی صورت میں ظاہر ہوا جسے دنیا کہا جاتا ہے، پس شہوت اس سے متعلق ہو گئی۔ پھر وہ آخرت میں جنت کی طرف منتقل ہو جاتی ہے، تو شہوت اس کا پیچھا کرتی ہے اور کبھی سیر نہیں ہوتی، کیونکہ یہ ایک ایسی صورت ہے جس کی مدت لامتناہی ہے۔ اگر شہوت نہ ہوتی تو جنت لذیذ نہ ہوتی۔ پس شوق ساکن نہیں ہوا اور اشتیاق باقی رہا۔ اور اس باب میں ہمارا شعر ہے:\n\nاس شخص کی زندگی پاکیزہ نہیں ہوتی جس نے عشق کا ذائقہ چکھا\nجب تک کہ وہ اس سے نہ ملے جس سے وہ عشق کرتا ہے\n\nاور جب وہ اسے دیکھتا ہے تو وہ معنی اسے خاموش کر دیتا ہے\nجو اسے بے چین کرتا تھا\n\nاور یہ ایک ایسا معنی ہے جس کا حکم مختلف ہے\nاس شخص کے نزدیک جو جانتا ہے کہ اس نے کیا کہا ہے\n\n***\n\n### [شوق کا متعلق حاضر نہیں ہوتا، بلکہ اس کا متعلق غائب ہوتا ہے جو فی الحال مشہود نہیں ہے]\n\nاور چونکہ محبت صرف معدوم سے متعلق ہوتی ہے، جیسا کہ ہم نے باب المحبت میں بیان کیا ہے، اسی طرح شوق کا تعلق حاضر سے درست نہیں ہے۔ بلکہ اس کا متعلق غائب ہوتا ہے جو فی الحال مشہود نہیں ہے۔ اسی لیے شوق محبت کی صفات میں سے ہے۔ اور اسی وجہ سے یہ طرد و عکس (منطقی طور پر) درست ہے، پس کہا جاتا ہے کہ ہر محب مشتاق ہے، اور ہر مشتاق محب ہے۔ اور جو مشتاق نہیں وہ محب نہیں، اور جو محب نہیں وہ مشتاق نہیں۔\n\nاور ایک خبر وارد ہوئی ہے جس کی صحت کا مجھے علم نہیں، کہ اللہ تعالیٰ نے اپنے مشتاقوں کا ذکر کیا اور اپنے بارے میں فرمایا کہ وہ ان سے شدید تر شوق رکھتا ہے۔ جیسا کہ اس کی جلالت کے لائق ہے۔ پس اس کا ان سے شوق یہ ہے کہ وہ انہیں اس ملاقات کے ذریعے راحت عطا کرے جس کے وہ مشتاق ہیں، اور وہ مقررہ وقت جو تبدیل نہیں ہو سکتا، ابھی نہیں آیا۔ لہٰذا اس چیز کے وجود میں تاخیر ضروری ہے جس کی طرف شوقِ الٰہی واقع ہوا ہے۔ یہ تب ہے جب یہ خبر صحیح ہو، اور مجھے اس کا علم نہیں، نہ کشف (الکشف) سے اور نہ ہی کسی صحیح روایت سے، مگر یہ مذکور اور مشہور ہے۔\n\nاور جنت کو علی، سلمان، عمار اور بلال کے لیے اشتیاق (الاشتیاق) کی صفت سے متصف کیا گیا ہے۔ اور لوگوں نے اس بارے میں ان ناموں کے اشتقاق (جیسے علو، سلامتی، عمران، اور استبلال) کے لحاظ سے بات کی ہے، لیکن یہ محقق نہیں ہے۔ کیونکہ شوق ایک ذوقی (الذوق) امر ہے، اور اگر یہ خبر مجھے اس وقت یاد آتی جب میں نے جنت کو دیکھا تھا، تو میں اس سے پوچھتا کہ اسے ان چاروں کے لیے شوق کیوں ہے، دوسروں کے لیے کیوں نہیں؟ کیونکہ وہ اس سبب کو زیادہ جانتی ہے جو اسے ان چاروں کے شوق کی طرف لے گیا۔ اور اسی طرح میں نے نبی صلی اللہ علیہ وسلم کو کئی بار دیکھا اور ان سے کئی چیزوں کے بارے میں پوچھا، لیکن مجھے یہ خیال نہیں آیا کہ میں ان سے جنت کے ان لوگوں کے لیے شوق کے بارے میں پوچھوں، بلکہ مجھے اس چیز نے مشغول رکھا جو میرے لیے اس سے زیادہ اہم تھی۔ اور شوق ایک ذوقی علم ہے جسے ہر مشتاق اپنے نفس سے جانتا ہے۔",
    "fa": "باب صد و هشتادم در معرفت مقام شوق و اشتیاق (الاشتياق)، و آن از صفات محبان (المحبين) و عشاق است.\n\nشوق (الشوق) با به دست آوردن وصال (الوصال) از بین می‌رود *** و اشتیاق (الاشتياق) همراه با وصال (الوصال) باقی می‌ماند.\n\nتصور فراق آن را پایدار می‌سازد *** پس در هنگام دیدار، صاحبش زیانکار است (مغبون).\n\nبه کسی که گفت سختی را آسان کن، گفتیم *** هر سختی در هستی (الوجود) آسان نمی‌شود.\n\nاین (اشتیاق) از صفات عشق است نه از غیر آن *** و عشق دردی پنهان در دل‌هاست.\n\nحکم این صفت جز در اینجا (دنیا) جاری نیست *** و در آنجا (آخرت) عینیتش از بین می‌رود و آشکار می‌شود.\n\nبرخی از عشاق می‌گویند:\n\nپس اگر دور شوند، از شوق به آن‌ها می‌گریم *** و اگر نزدیک شوند، از ترس فراق می‌گریم.\n\n### [اشتیاق (الاشتياق) حرکتی است که محب (المحب) هنگام اجتماع با محبوبش (محبوبه) از سر شادی آن را می‌یابد]\n\nشوق (الشوق) با دیدار آرام می‌گیرد، زیرا شوق، حرکت قلب به سوی غایب است؛ پس چون وارد شود، آرام می‌گیرد. اما اشتیاق (الاشتياق) حرکتی است که محب (المحب) هنگام اجتماع با محبوبش (محبوبه) از سر شادی آن را می‌یابد، زیرا نمی‌تواند به نهایت وجد (یافتن) خود در او برسد. اگر به آن نهایت می‌رسید، آرام می‌گرفت، چون از او سیر نمی‌شود. حس نمی‌تواند آنچه را که از تعلق نفس به محبوب (المحبوب) در درون برپا می‌شود، کفایت کند. او مانند نوشنده آب دریاست که هر چه بیشتر بنوشد، تشنه‌تر می‌شود.\n\nپیامبر (صلی الله علیه و سلم) فرمود: «مَنْهُومَانِ لَا يَشْبَعَانِ طَالِبُ عِلْمٍ وَطَالِبُ دُنْيَا» (دو حریص سیر نمی‌شوند: طالب علم و طالب دنیا).\n\nاز آن جهت که او محب (محب) در به دست آوردن هر یک از آن دو است. و علم را غایتی نیست که به آن منتهی شود، از این رو سیر نمی‌شود. و همچنین دنیا، زیرا آن مشتهی نفوس است و شهوت آن را می‌طلبد. و آن مشتهی در صورتی نزدیک که دنیا نامیده می‌شود، تجلی (التجلی) کرده است، پس شهوت به آن تعلق یافته است. سپس به آخرت در بهشت منتقل می‌شود و شهوت آن را دنبال می‌کند و هرگز سیر نمی‌شود، زیرا آن صورتی است که مدت آن پایان نمی‌پذیرد. اگر شهوت نبود، بهشت خوشایند نمی‌شد. پس شوق (الشوق) آرام نگرفته و اشتیاق (الاشتياق) باقی مانده است. و ما در این باب داریم:\n\nزندگی کسی که طعم عشق را چشیده، صاف نمی‌شود *** مگر آنکه کسی را که عاشق اوست، ملاقات کند.\n\nو چون او را ببیند، آن معنایی که او را بی‌قرار می‌سازد *** پنهان می‌شود.\n\nو آن معنایی است که حکمش متفاوت است *** نزد کسی که می‌داند چه چیزی آن را رها کرده است.\n\n### [متعلق شوق (الشوق) حاضر نیست، بلکه متعلق آن غایبی است که در حال حاضر مشهود نیست]\n\nو از آنجا که حب (الحب) جز به معدوم (نابود/غایب) تعلق نمی‌گیرد، چنانکه در باب محبت (المحبة) بیان کردیم، همچنین شوق (الشوق) صحیح نیست که به حاضر تعلق گیرد، بلکه متعلق آن غایبی است که در حال حاضر مشهود نیست. و به همین دلیل شوق از اوصاف محبت است و به همین جهت طرد و عکس می‌شود (منعکس می‌گردد)؛ پس گفته می‌شود: هر محبی مشتاق است و هر مشتاقی محب است. و کسی که مشتاق نیست، محب نیست، و کسی که محب نیست، مشتاق نیست. و خبری وارد شده است که من از صحت آن اطلاعی ندارم، مبنی بر اینکه خداوند متعال مشتاقان به سوی خود را یاد کرده و درباره خود فرموده است که او شدیدترین شوق را به سوی آنان دارد،\n\nآن‌گونه که شایسته جلال اوست. پس شوق او به آنان این است که با دیدار کسی که مشتاق او هستند، به آنان آسایش بخشد، و چون وقت مقدر که تغییر نمی‌کند، نرسیده است، ناگزیر وجود آنچه شوق الهی به آن تعلق گرفته، به تأخیر می‌افتد. این در صورتی است که خبر صحیح باشد، و من نه از طریق کشف (الکشف) و نه از طریق روایت صحیح، اطلاعی از آن ندارم، جز اینکه مذکور و مشهور است. و بهشت (الجنة) به اشتیاق (الاشتياق) به علی، سلمان، عمار و بلال متصف شده است. و مردم در این باره از جهت اشتقاق نام‌های اینان از علو (بلندی)، سلامت، عمران (آبادانی) و استبلال (تر شدن/آسودگی) سخن گفته‌اند. اما این محقق نیست، زیرا شوق (الشوق) امری ذوقی است. اگر این خبر هنگام دیدن بهشت به ذهنم خطور می‌کرد، از آن درباره شوقش به این افراد و نه دیگران می‌پرسیدم، زیرا بهشت به سببی که او را به شوق این چهار نفر کشانده، آگاه‌تر است. همچنین پیامبر (صلی الله علیه و سلم) را بارها دیده‌ام و از ایشان درباره چیزهایی پرسیده‌ام، اما به ذهنم خطور نکرد که درباره شوق بهشت به این افراد بپرسم، بلکه آنچه برایم مهم‌تر بود، مرا مشغول ساخت. و شوق، علم ذوقی است که هر مشتاقی آن را از درون خود می‌شناسد."
  },
  "page_count": 2
}