{
  "id": 200,
  "title": {
    "ar": "الباب الموفي مائتين في حال الوصل",
    "en": "Chapter Two Hundred: Concerning the Spiritual State (حال) of Union (الوصل)",
    "ur": "باب نمبر دو سو میں وصل (الوصل) کا حال",
    "fa": "باب دویست و یکم در بیان حال وصل"
  },
  "content": {
    "ar": "## «الباب الموفي مائتين في حال الوصل»\n\n\n> لو فاتنا ما فات لم تك صورة *** والوصل فينا درك ذاك الفائت‏\n\n\n> ما فات إلا كوننا لم نبغه *** فإذا ابتغينا كان ثبت الثابت‏\n\n\n> وبه تفاضلت الرجال فمنهم *** حي وذاك الحي عين المائت‏\n\n\n> والميت منا ليس يعرف موته *** والناطق المعصوم عين الصامت‏\n\n\n### [أن الوصل إدراك الفائت وهو إدراك السالف من أنفاسك‏]\n\n\nاعلم أن الوصل في اصطلاح القوم إدراك الفائت وهو إدراك السالف من أنفاسك وهو قوله تعالى يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ والعلة في ذلك أن كل حال له نفس يتضمن ذلك النفس جميع ما سلف من أنفاس ذلك المتنفس من حيث ما كانت عليه تلك الأنفاس من الأحكام فله فائدة المجموع وما يتميز به من غيره وهو قول الطائفة لو أن شخصا أقبل على الله دائما ثم أعرض عنه طرفة عين كان ما فاته في تلك اللحظة أكثر مما ناله وهذه المسألة حيرت العارفين بالوصل إذا صح لم يعقبه الفصل هذا هو الحق فإن الحق سبحانه لا يقبل وصله الانفصال ولا تجلى لشي‏ء ثم انحجب عنه لأن العالم بما هو به عالم لا يكون بخلاف حكم علمه فالحق مع الكون في حال الوصل دائما وبهذا كان إلها وهو قوله تعالى وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ أي على أي حال كنتم من عدم ووجود وكيفيات فهكذا هو في نفس الأمر والذي يحصل لأهل العناية من أهل الله أن يطلعهم الله ويكشف عن بصائرهم حتى يشهدوا هذه المعية وذلك هو المعبر عنه بالوصل أعني شهود هذا العارف فقد اتصل العارف بشهود ما هو الأمر عليه فلا يتمكن أن ينقلب هذا الوصل فصلا كما لا ينقلب العلم جهلا فإنه يعطيك هذا المشهد الكيفية فيه على ما هي عليه فهذا يا أخي معنى الوصل عند الطائفة في اصطلاحهم جعلنا الله وإياكم من أهل الوصل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Had what passed us by truly passed, there would be no form,\nAnd Union (الوصل) within us is the realization of that which was missed.\n\nIt only passed because we did not desire it,\nBut when we seek it, the established reality of the established becomes manifest.\n\nBy this, men are distinguished, and among them is\nThe living, and that living one is the very essence (عين) of the dead.\n\nAnd the dead among us does not recognize his death,\nAnd the infallible speaker (الناطق المعصوم) is the very essence of the silent one.\n\n### [That Union (الوصل) is the realization of what was missed, which is the realization of the past moments of your breaths]\n\nKnow that Union (الوصل), in the technical usage (اصطلاح) of the People (القوم), is the realization of what was missed, which is the realization of the past moments of your breaths (أنفاسك). This is related to His saying, the Exalted: <<يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ>> (Allah substitutes their evil deeds with good deeds). The reason for this is that every spiritual state (حال) possesses a breath (نفس) that encompasses all the preceding breaths of that person, including the effects (الأحكام) those breaths carried. Thus, it holds the benefit of the totality (المجموع) and what distinguishes it from everything else. This is the saying of the Group (الطائفة): If a person were constantly devoted to Allah, then turned away from Him for the blink of an eye, what he missed in that moment would be greater than what he had attained.\n\nThis issue has perplexed the Gnostics (العارفين) concerning Union: If Union is truly established, separation (الفصل) cannot follow it. This is the Reality (الحق). For The Real (الحق), glory be to Him, does not admit separation after His Union, nor does He disclose Himself (تجلى) to anything and then become veiled from it. Because the cosmos (العالم), in its very nature, cannot contradict the ruling (حكم) of His Knowledge (العلم). Therefore, The Real is always with existence (الكون) in the state of Union (الوصل). By this, He is God (إلها), and this is His saying, the Exalted: <<وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ>> (And He is with you wherever you are). That is, in whatever state you may be—of non-existence (عدم), existence (وجود), or modalities (كيفيات)—this is how He is in the reality of the matter (في نفس الأمر).\n\nWhat is granted to the People of Divine Care (أهل العناية) among the People of Allah (أهل الله) is that Allah informs them and unveils their inner sight (بصائرهم) until they witness this Companionship (المعية). And that is what is expressed by the term Union (الوصل)—meaning the witnessing (شهود) of this Gnostic (العارف). The Gnostic has thus achieved Union (اتصل) through the witnessing of the reality as it truly is (ما هو الأمر عليه), so it is impossible for this Union to revert to separation (فصلا), just as Knowledge (العلم) cannot revert to ignorance (جهلا). For this witnessed state (المشهد) grants you the modality (الكيفية) of the matter exactly as it is. So this, my brother, is the meaning of Union (الوصل) according to the Group (الطائفة) in their technical usage (اصطلاحهم). May Allah make us and you among the People of Union (أهل الوصل). And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth and guides to the Way).",
    "ur": "باب نمبر دو سو: حالِ وصل (الوصل) کے بیان میں\n\nاگر ہم سے جو کچھ فوت ہوا، وہ فوت نہ ہوتا تو کوئی صورت نہ ہوتی،\nاور وصل (الوصل) ہمارے اندر اسی فوت شدہ چیز کا ادراک ہے۔\n\nوہ فوت نہیں ہوا مگر اس لیے کہ ہم نے اسے طلب نہیں کیا؛\nپس جب ہم اسے طلب کرتے ہیں تو وہ ثابت کا ثبوت بن جاتا ہے۔\n\nاور اسی سے مردانِ حق میں فضیلت پیدا ہوتی ہے، پس ان میں سے کوئی زندہ ہے\nاور وہ زندہ ہی عین مردہ ہے۔\n\nاور ہم میں سے مردہ اپنی موت کو نہیں جانتا،\nاور ناطقِ معصوم (بولنے والا جو خطا سے پاک ہے) عین صامت (خاموش) ہے۔\n\n[کہ وصل (الوصل) فوت شدہ چیز کا ادراک ہے، اور یہ تمہارے گزرے ہوئے انفاس (لمحات) کا ادراک ہے]\n\nجان لو کہ صوفیاء (القوم) کی اصطلاح میں وصل (الوصل) فوت شدہ چیز کا ادراک ہے، اور یہ تمہارے گزرے ہوئے انفاس (لمحات) کا ادراک ہے۔ اور یہی اللہ تعالیٰ کا یہ فرمان ہے:\n**يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ**\n(اللہ ان کی برائیوں کو نیکیوں سے بدل دیتا ہے)۔\nاس کی وجہ یہ ہے کہ ہر حال کا ایک نفس (لمحہ) ہوتا ہے، اور وہ نفس اس سانس لینے والے کے تمام گزرے ہوئے انفاس (لمحات) کو اپنے اندر شامل رکھتا ہے، اس لحاظ سے کہ ان انفاس پر کیا احکام جاری تھے۔ پس اسے مجموعے کا فائدہ حاصل ہوتا ہے اور وہ اس چیز کا بھی فائدہ حاصل کرتا ہے جو اسے دوسروں سے ممتاز کرتی ہے۔\nاور یہی اس گروہ (الطائفة) کا قول ہے کہ اگر کوئی شخص ہمیشہ اللہ کی طرف متوجہ رہے، پھر ایک پلک جھپکنے کے برابر بھی اس سے اعراض کرے، تو جو کچھ اس لمحے میں اس سے فوت ہوا، وہ اس سے کہیں زیادہ ہے جو اس نے حاصل کیا۔\nیہ مسئلہ ان عارفین (العارفین) کو حیران کر دیتا ہے کہ اگر وصل (الوصل) صحیح ہو جائے تو اس کے بعد فصل (الفصل) نہیں آتا۔ یہی حق (الحق) ہے۔ کیونکہ ذات حق (الحق) سبحانہ اپنے وصل (الوصل) میں انفصال (الانفصال) کو قبول نہیں کرتی، اور نہ ہی وہ کسی چیز پر ظہور الٰہی (التجلی) فرماتی ہے اور پھر اس سے پردہ پوش ہو جاتی ہے، کیونکہ عالم جس حالت میں ہے، وہ اپنے علم کے حکم کے خلاف نہیں ہو سکتا۔\nپس ذات حق (الحق) ہمیشہ کون (وجود) کے ساتھ حالِ وصل (الوصل) میں رہتی ہے، اور اسی وجہ سے وہ الٰہ ہے۔ اور یہی اللہ تعالیٰ کا یہ فرمان ہے:\n**وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ**\n(اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)۔\nیعنی تم عدم (نہ ہونا) اور وجود (ہونا) اور کیفیات میں سے جس حال پر بھی ہو۔ پس نفسِ امر میں حقیقت یہی ہے۔\nاور اہل اللہ میں سے اہل عنایت کو جو کچھ حاصل ہوتا ہے وہ یہ ہے کہ اللہ انہیں مطلع کرتا ہے اور ان کی بصیرتوں سے کشف (الکشف) ہٹا دیتا ہے، یہاں تک کہ وہ اس معیت (ساتھ ہونے) کا شہود (الشهود) کرتے ہیں۔ اور اسی کو وصل (الوصل) سے تعبیر کیا جاتا ہے، یعنی اس عارف (العارف) کا شہود (الشهود)۔\nپس عارف (العارف) نے اس چیز کے شہود (الشهود) کے ذریعے اتصال حاصل کر لیا جو امر (حقیقت) ہے۔ لہٰذا یہ وصل (الوصل) فصل (الفصل) میں تبدیل نہیں ہو سکتا، جیسے علم جہل میں تبدیل نہیں ہو سکتا۔ کیونکہ یہ مشہد تمہیں کیفیت اسی طرح عطا کرتا ہے جس طرح وہ حقیقت میں ہے۔\nپس اے میرے بھائی! صوفیاء (الطائفة) کی اصطلاح میں وصل (الوصل) کا یہی معنی ہے۔ اللہ ہمیں اور آپ کو اہل وصل (الوصل) میں سے بنائے۔\n**والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏**\n(اور اللہ حق فرماتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے)۔",
    "fa": "باب دویست در بیان حال وصل\n\nاگر آنچه از دست رفت، از ما فوت می‌شد، صورتی وجود نداشت؛ و وصل (الوصل) در ما، درک همان امر از دست رفته است.\n\nچیزی فوت نشد مگر آنکه ما آن را نخواستیم؛ پس اگر آن را بخواهیم، ثابتِ ثابت خواهد بود.\n\nو به واسطه آن، مردان (سالکان) بر یکدیگر برتری یافتند؛ پس برخی از آنان زنده‌اند و آن زنده، عین مرده است.\n\nو مرده از ما، مرگ خود را نمی‌شناسد؛ و ناطق معصوم، عین صامت (خاموش) است.\n\n[اینکه وصل، درک امر از دست رفته است و آن درک گذشته از نَفَس‌های توست]\n\nبدان که وصل (الوصل) در اصطلاح طایفه (القوم)، درک امر از دست رفته است؛ و آن درک گذشته از نَفَس‌های توست. و این همان قول خداوند متعال است: «يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ» (خداوند بدی‌هایشان را به نیکی‌ها تبدیل می‌کند). و علت این امر آن است که هر حالی نَفَسی دارد که آن نَفَس شامل تمام نَفَس‌های گذشته آن شخصِ نَفَس‌کشنده است، از حیث احکامی که آن نَفَس‌ها بر آن بوده‌اند. پس برای او فایده مجموع و آنچه که به واسطه آن از غیر متمایز می‌شود، حاصل است. و این همان قول طایفه (الطائفة) است که: اگر شخصی همواره رو به سوی حق (الحق) داشته باشد، سپس به اندازه یک چشم بر هم زدن از او روی برگرداند، آنچه در آن لحظه از دست داده، بیشتر از آن چیزی است که به دست آورده است.\n\nو این مسئله عارفان (العارفين) را به حیرت افکنده است که: اگر وصل (الوصل) صحیح باشد، جدایی (الفصل) به دنبال آن نمی‌آید. این همان حق (الحق) است؛ زیرا حق سبحانه وصل خود را جدایی‌پذیر نمی‌داند و برای چیزی تجلی (التجلی) نمی‌کند که سپس از آن محجوب شود. چرا که عالم، با آنچه که به واسطه آن عالم است، نمی‌تواند برخلاف حکم علم خود باشد. پس حق (الحق) همواره با کَوْن (هستی) در حال وصل (الوصل) است. و به واسطه همین، او إله (معبود) بود. و این همان قول خداوند متعال است: «وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ» (و او با شماست هر کجا که باشید)؛ یعنی بر هر حالی که باشید، از نیستی و هستی (الوجود) و کیفیات.\n\nپس در نفسِ امر (واقعیت)، چنین است. و آنچه برای اهل عنایت از اهل الله حاصل می‌شود، این است که خداوند آنان را آگاه می‌سازد و از بصیرت‌هایشان پرده برمی‌دارد تا این معیت (همراهی) را شهود (الشهود) کنند. و این همان چیزی است که از آن به وصل (الوصل) تعبیر می‌شود؛ یعنی شهود (الشهود) این عارف. پس عارف به واسطه شهود آنچه امر بر آن است، متصل شده است. بنابراین، ممکن نیست که این وصل (الوصل) به جدایی (فصل) تبدیل شود، همان‌گونه که علم به جهل تبدیل نمی‌شود. زیرا این مشهد، کیفیت را در آن، آن‌گونه که هست، به تو می‌دهد. پس ای برادر من، این معنای وصل (الوصل) نزد طایفه (الطائفة) در اصطلاح آنان است. خداوند ما و شما را از اهل وصل قرار دهد. و «والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 1
}