{
  "id": 456,
  "title": {
    "ar": "الباب السادس والخمسون وأربعمائة في معرفة منازلة من تحرك عند سماع كلامي فقد سمع يريد الوجد الذي يعطي الوجود",
    "en": "Chapter Four Hundred and Fifty-Six: Concerning the Gnosis of the Spiritual Station of him who is stirred upon hearing My Word, for he has truly heard, seeking the Ecstasy (الوجد) that bestows Being (الوجود).",
    "ur": "باب چار سو چھپن: اس شخص کی منزلہ (منزلة) کی معرفت (معرفة) میں جو میرے کلام کو سن کر متحرک ہوا، تو اس نے سن لیا، وہ اس وجد (الوجد) کا ارادہ کرتا ہے جو الوجود (الوجود) عطا کرتا ہے۔",
    "fa": "باب چهارصد و پنجاه و ششم در معرفت مقام کسی که هنگام شنیدن کلام من به حرکت درآید، پس به راستی شنیده است؛ که مراد از آن، وجدی (وجد) است که هستی (وجود) می‌بخشد."
  },
  "content": {
    "ar": "## «الباب السادس والخمسون وأربعمائة في معرفة منازلة من تحرك عند سماع كلامي فقد سمع يريد الوجد الذي يعطي الوجود»\n\n\n> لو لا سماع كلام الله ما برزت *** أعياننا وسعت منه على قدم‏\n\n\n> إلى الوجود ولو لا السمع ما رجعت *** على مدارجها لحالة العدم‏\n\n\n> فنحن في برزخ والحق يشهدنا *** بين الحدوث وبين الحكم بالقدم‏\n\n\n> ليس التكون ممن لا كلام له *** إن التكون عن قصد وعن كلم‏\n\n\n### [الكلام مشتق من الكلم وهو الجرح‏]\n\n\nقال الله تعالى إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ يعني حكم مما توجه عليه أمر كن كان ما كان فيعدم به ويوجد فليس متعلقة إلا الأثر ولهذا سماه في اللسان العربي كلاما مشتقا من الكلم وهو الجرح وهو أثر في المجروح فلما وجد الأثر سمي ما وجد عنه كلاما كان ما كان فافهم والحركة انتقال من حال إلى حال أي من حال يكون عليه السامع إلى حال يعطيه سماعه عند كلام المتكلم وهو فيه بحسب فهمه فهو مجبور على الحركة ولهذا لا تسلم الصوفية حركة الوجد الذي يبقى معه الإحساس بمن في المجلس حتى تسلم له حركته بالله فمهما أحس تعين عليه أن يجلس إلا أن يعرف الحاضرين بأنه متواجد لا صاحب وجد فيسلم له ذلك ولكن لا تحمد هذه الحالة عندهم على كل حال لأنهم يكرهون الحركة في الأصل بنفس المتحرك ويحمدونها بالمحرك فأصل السماع الذي يقول به أهل الطريق شريف‏\nوهو يسرى في كل شي‏ء فلا يختص به حال إيقاع وغناء على طريق خاص طبيعي فإن الوزن الطبيعي إنما يؤثر فيما تركب من الطبيعة على مزاج خاص لا يشترط في حركة الطبع الفهم بخلاف حركة النفوس العقلية وإن كان للطبيعة فيها أثر في أصل وجودها ولكن ليست لها في النفوس العاقلة تلك القوة إلا بالفهم فلا يحركه إلا الفهم أ لا ترى الكائنات ما ظهرت ولا تكونت إلا بالفهم لا بعدم الفهم لأنها فهمت معنى كُنْ فتكونت ولهذا قال فَيَكُونُ يعني ذلك الشي‏ء لأنه فهم عند السماع ما أراد بقوله كن فبادر لفهمه دون غير التكوين من الحالات فما سميت هذه الحركة بالوجد إلا لحصول الوجود عندها أعني وجود الحكم سواء كان بعين أو بلا عين فإنه عين في نفسه هذا الكائن ثم إن الحق أعطى هذه الصفة لعباده وجعل نفسه سامعا وأقام نفسه محلا لتكوين ما يطلبه منه العبد في سؤاله سماه إجابة وجعل ذلك بلفظ الأمر كما جعل كُنْ ليريه أن الحقائق لا نفسها تكون أحكامها ما هي بجعل جاعل لمن عقل وعلم الأمور على ما هي عليه فإن العلم بهذا النوع من العلوم المختزنة عن أكثر الناس بل يحرم كشفها لهم من العارف بها لما يؤدي إلى إنكار الحق مع علمهم بأن المعاني توجب أحكامها لمن قامت به عقلا يريدون أن ذلك لذاتها ولهذا تمكن المتكلم بالرد على من يقول بالإرادة الحادثة لا في محل وأما كلام الله من الشجرة لموسى فهو عند بعضهم دليل على أن الكلام ينسب لمن خلقه كما تقول الطائفة الأخرى إن السمع تعلق بالمناسب وهو الخطاب من الشجرة وليس إلا كلام الله كما قال فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله ومعلوم بما ذا تعلق السمع منه وهؤلاء القائلون بأن المتكلم من قامت به صفة الكلام وأهل الكشف الذين يرون أن الوجود لله بكل صورة جعلوا الشجرة هي صورة المتكلم كما كان الحق لسان العبد وسمعه وبصره بهويته لا بصفته كما يظهر في صورة تنكر وتتحول إلى صورة تعرف وهو هو لا غيره إذ لا غير فما تكلم من الشجرة إلا الحق فالحق صورة شجرة وما سمع من موسى إلا الحق فالحق صورة موسى من حيث هو سامع كما هو الشجرة من حيث هو متكلم والشجرة شجرة وموسى موسى لا حلول لأن الشي‏ء لا يحل في ذاته فإن الحلول يعطي ذاتين وهنا إنما هو حكمان‏\n\n\n> فالحس يشهد ما الأفكار تنكره *** والعقل يعلم ما الإحساس يرمى به‏\n\n\n> فانظر إليه ترى في صوره عجبا *** وانظر إلى حكمه في حسن ترتيبه‏\n\n\n> تراه عين الذي يراه من كثب *** وليس يدريه من يدريه إلا به‏\n\n\nفانظر إلى هذه النكت الإلهية في هذه المنازلات ما أخصرها وما أعطاها للأمور على ما هي عليه في إيجاز والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Four Hundred and Fifty-Six: Concerning the Knowledge of the Spiritual Station of Him Who Moves Upon Hearing My Speech, for He Has Truly Heard, Desiring the Ecstasy (الوجد) That Grants Existence (الوجود)\n\nHad it not been for the hearing of Allah’s speech, our Fixed Entities (أعياننا) would not have manifested, and they strove forth from it upon a foundation\nToward Existence (الوجود); and were it not for the hearing, they would not have returned upon their paths to the state of non-existence (العدم).\nThus, we are in an Isthmus (برزخ), and the Real (الحق) witnesses us, situated between origination (حدوث) and the judgment of pre-eternity (قدم).\nFormation (تكون) does not proceed from one who lacks speech; rather, formation arises from intention and from a Word (كلم).\n\n### [Speech (الكلام) is derived from *al-kalm*, which means the wound (الجرح)]\n\nAllah the Exalted said: <<إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ>> (Indeed, Our word to a thing, when We intend it, is only that We say to it, \"Be!\" and it is). This means the decree (حكم) that the command \"Be!\" (كن) is directed toward—it was what it was, and by it, it is annihilated and brought into existence. Thus, its connection is only to the effect (الأثر). For this reason, in the Arabic language, He named it *kalām* (speech), derived from *al-kalm*, which is the wound (الجرح)—and the wound is an effect upon the wounded. So when the effect was found, that from which it was found was named *kalām*, whatever it may have been. Understand this.\n\nMovement (الحركة) is a transition from one state (حال) to another—that is, from the state the hearer is in to the state granted to him by his hearing the speaker's speech. He is in this state according to his understanding (فهم), and thus he is compelled (مجبور) to move. For this reason, the Sufis (الصوفية) do not accept the movement of Ecstasy (وجد) in which the awareness of those present in the assembly remains, until his movement is entirely surrendered to Allah (حركته بالله). Therefore, whenever he retains awareness, it is incumbent upon him to sit down, unless he informs those present that he is merely simulating ecstasy (*mutawājid*) and is not a true possessor of Ecstasy (*ṣāḥib wajd*). In that case, it is accepted from him. However, this state is not praised by them in all circumstances, because they fundamentally dislike movement originating from the mover himself, but they praise it when it originates from the Mover (المحرك). Thus, the principle of Spiritual Audition (السماع) affirmed by the People of the Path (أهل الطريق) is noble.\n\nAnd this [principle] flows through everything; it is not restricted to the state of rhythmic performance or singing according to a specific natural method. For natural rhythm (الوزن الطبيعي) only affects that which is composed of nature (الطبيعة) upon a specific temperament. Understanding (الفهم) is not a prerequisite for the movement of nature, unlike the movement of the rational souls (النفوس العقلية). Although nature has an effect on the original existence of the rational souls, it does not possess that same power over them unless through understanding. Thus, nothing moves the rational soul except understanding. Do you not see that the existent things (الكائنات) did not appear or become formed except through understanding, not through the absence of understanding? This is because they understood the meaning of \"Be!\" (كن) and thus became formed. For this reason, He said, <<فَيَكُونُ>> (and it is)—meaning that thing [comes into existence]—because upon hearing, it understood what He intended by His saying \"Be!\" (كن), and it hastened to its understanding, setting aside all other states of formation. This movement was only named Ecstasy (وجد) because Existence (الوجود) occurs simultaneously with it—meaning the existence of the decree (وجود الحكم), whether it is with a concrete entity (عين) or without an entity, for this existent thing is an entity in itself.\n\nFurthermore, the Real (الحق) granted this attribute [of understanding/hearing] to His servants, and He made Himself the Hearer, establishing Himself as the locus for the formation of what the servant requests from Him in his supplication, which He calls the Answer (إجابة). And He made that [answer] by the word of command, just as He made \"Be!\" (كن), in order to show him who possesses intellect and knows things as they truly are that the Realities (الحقائق) themselves bring forth their own decrees, and they are not made by any maker. Indeed, the knowledge of this type of science is hidden from most people; rather, the Gnostic (العارف) is forbidden from unveiling it to them, because it leads to the denial of the Real (إنكار الحق), even though they know intellectually that the meanings necessitate their own decrees for the one in whom they subsist. They intend that this is due to the Essence (ذات). For this reason, the theologian (*mutakallim*) is able to refute those who affirm an originated Will (الإرادة الحادثة) that does not subsist in a locus.\n\nAs for Allah’s speech to Moses from the tree, some consider it proof that the speech is attributed to the one who created it. Another group says that the hearing (السمع) was connected to the appropriate locus, which was the address from the tree, and yet it was nothing but the Speech of Allah, as He said: <<فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله>> (Grant him protection until he hears the Speech of Allah). And it is known to what the hearing was connected in that instance. Those who hold that the speaker is the one in whom the attribute of speech subsists, and the People of Unveiling (أهل الكشف) who see that Existence (الوجود) belongs to Allah in every form, made the tree the form of the Speaker, just as the Real (الحق) was the tongue, hearing, and sight of the servant—by His Identity (هوية), not by His Attribute (صفة). Just as He appears in a form that is denied and transforms into a form that is recognized, and He is He, none other, for there is no other. Thus, none spoke from the tree except the Real, so the Real is the form of the tree. And none heard from Moses except the Real, so the Real is the form of Moses insofar as he is the hearer, just as He is the tree insofar as He is the speaker. Yet the tree is the tree, and Moses is Moses. There is no indwelling (حلول), because a thing does not indwell in its own Essence (ذات). Indwelling implies two essences (ذاتين), whereas here there are only two decrees (حكمان).\n\nSensation (الحس) witnesses what thoughts deny, and the Intellect (العقل) knows what Sensation rejects.\nLook upon Him, and you will see wonder in His forms; and look upon His decree in the beauty of its arrangement.\nYou see Him as the very Entity (عين) of the one who sees Him closely, yet no one comprehends Him except through Him.\n\nLook then at these Divine subtleties (نكت إلهية) in these spiritual stations (منازلات)—how concise they are, and how they grant things their true nature in brevity. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو چھپن: ان منازل کی معرفت میں جو میرے کلام کو سن کر حرکت میں آتے ہیں، پس انہوں نے سنا، جس سے مراد وہ وجد ہے جو الوجود (ہستی) عطا کرتا ہے۔\n\nاگر اللہ کے کلام کا سننا نہ ہوتا تو ہماری اعیان (حقیقتیں) ظاہر نہ ہوتیں اور نہ ہی وہ اس سے قدیم (ازلی) بنیاد پر وسعت پاتیں۔\nالوجود (ہستی) کی طرف، اور اگر سننا نہ ہوتا تو وہ اپنی منازل پر عدم کی حالت کی طرف واپس نہ لوٹتیں۔\nپس ہم برزخ میں ہیں اور الحق (ذات حق) ہمیں حدوث (نئی پیدائش) اور قدم (ازلیت) کے حکم کے درمیان دیکھ رہا ہے۔\nتکون (وجود میں آنا) اس سے نہیں ہوتا جس کا کوئی کلام نہ ہو، بے شک تکون قصد اور کلم (بات) سے ہوتا ہے۔\n\n[کلام، کلم سے مشتق ہے اور کلم کے معنی زخم کے ہیں]\n\nاللہ تعالیٰ نے فرمایا: \"ہمارا قول تو کسی چیز کے لیے جب ہم اس کا ارادہ کرتے ہیں تو یہی ہوتا ہے کہ ہم اسے کہیں 'ہو جا' (كُنْ) تو وہ ہو جاتی ہے (فَيَكُونُ)\" (النحل: ۴۰)۔ یعنی یہ ایک حکم ہے جو 'کُن' (ہو جا) کے امر کی طرف متوجہ ہوا، جو کچھ تھا وہ ہوا، پس اس سے معدوم بھی ہوتا ہے اور موجود بھی۔ لہٰذا اس کا تعلق صرف اثر سے ہے۔ اسی لیے عربی زبان میں اسے کلام کہا گیا ہے، جو کلم سے مشتق ہے، اور کلم کے معنی زخم کے ہیں، اور یہ مجروح (جسے زخم لگا) میں ایک اثر ہوتا ہے۔ پس جب اثر پایا گیا تو جس چیز سے وہ اثر پیدا ہوا اسے کلام کہا گیا، جو کچھ بھی وہ تھا۔ پس سمجھو۔\n\nاور حرکت ایک حال سے دوسرے حال کی طرف منتقل ہونا ہے، یعنی اس حال سے جس پر سامع ہوتا ہے، اس حال کی طرف جو اسے متکلم کے کلام کو سن کر حاصل ہوتا ہے، اور یہ اس کی فہم کے مطابق ہوتا ہے۔ پس وہ حرکت پر مجبور ہے۔ اسی لیے صوفیاء اس وجد کی حرکت کو تسلیم نہیں کرتے جس کے ساتھ مجلس میں موجود لوگوں کا احساس باقی رہے، جب تک کہ اس کی حرکت اللہ کے ذریعے تسلیم نہ ہو جائے۔ پس جب بھی وہ (لوگوں کا) احساس کرے تو اس پر لازم ہے کہ وہ بیٹھ جائے، مگر یہ کہ وہ حاضرین کو بتا دے کہ وہ متواجد (وجد لانے کی کوشش کرنے والا) ہے نہ کہ صاحب وجد (جس پر وجد طاری ہو گیا)۔ تب اسے یہ اجازت مل جاتی ہے۔ لیکن یہ حالت ان کے نزدیک ہر حال میں قابل تعریف نہیں ہے، کیونکہ وہ اصل میں متحرک (حرکت کرنے والے) کی ذات سے حرکت کو ناپسند کرتے ہیں اور محرک (حرکت دینے والے) کی وجہ سے اسے پسند کرتے ہیں۔ پس سماع کی اصل، جس کا اہل طریق ذکر کرتے ہیں، شریف ہے۔\n\nاور یہ (سماع) ہر چیز میں سرایت کرتا ہے، لہٰذا یہ کسی خاص طبعی طریقے پر تال اور گانے کی حالت کے ساتھ مخصوص نہیں ہے۔ کیونکہ طبعی وزن صرف ان چیزوں پر اثر انداز ہوتا ہے جو خاص مزاج پر طبیعت سے مرکب ہوئی ہوں، اور طبع کی حرکت میں فہم شرط نہیں ہے، برخلاف عقلی نفوس کی حرکت کے۔ اگرچہ ان کے اصل الوجود (ہستی) میں طبیعت کا اثر ہوتا ہے، لیکن عاقل نفوس میں طبیعت کے لیے وہ قوت نہیں ہوتی مگر فہم کے ذریعے۔ پس اسے صرف فہم ہی حرکت دیتا ہے۔ کیا تم نہیں دیکھتے کہ کائنات نہ ظاہر ہوئیں اور نہ ہی وجود میں آئیں مگر فہم کے ذریعے، نہ کہ فہم کے نہ ہونے سے؟ کیونکہ انہوں نے 'کُن' (ہو جا) کا معنی سمجھا، پس وہ وجود میں آ گئیں۔ اسی لیے (اللہ نے) فرمایا: \"فَيَكُونُ\" (تو وہ ہو جاتی ہے)، یعنی وہ چیز، کیونکہ اس نے سماع کے وقت وہ سمجھ لیا جو اللہ نے 'کُن' کہنے سے ارادہ کیا تھا، پس وہ تکوین (وجود میں آنے) کی دیگر حالتوں کے بجائے اپنے فہم کی طرف لپکی۔ اور اس حرکت کو وجد کا نام صرف اس لیے دیا گیا کہ اس کے وقت الوجود (ہستی) حاصل ہوتا ہے، یعنی حکم کا وجود، خواہ وہ عین (حقیقت) کے ساتھ ہو یا بلا عین، کیونکہ یہ موجود (کائن) اپنی ذات میں عین ہے۔\n\nپھر یہ کہ الحق (ذات حق) نے یہ صفت اپنے بندوں کو عطا کی اور اپنی ذات کو سامع (سننے والا) بنایا اور اپنی ذات کو اس چیز کے وجود میں لانے کا محل بنایا جو بندہ اپنے سوال میں اس سے طلب کرتا ہے، جسے اس نے اجابت (قبولیت) کا نام دیا۔ اور اس (اجابت) کو امر کے لفظ کے ساتھ بنایا، جیسا کہ 'کُن' (ہو جا) کو بنایا، تاکہ اسے دکھائے کہ حقائق کے احکام خود ان کی ذات سے ہوتے ہیں، نہ کہ کسی بنانے والے کے بنانے سے، اس شخص کے لیے جو عقل رکھتا ہو اور امور کو ان کی اصل حالت پر جانتا ہو۔ کیونکہ اس قسم کا علم اکثر لوگوں سے پوشیدہ رکھا گیا ہے، بلکہ عارف (جاننے والے) کے لیے ان پر اس کا کشف (الکشف) کرنا حرام ہے، کیونکہ یہ الحق (ذات حق) کے انکار کی طرف لے جاتا ہے، باوجود اس کے کہ وہ جانتے ہیں کہ معانی عقلی طور پر اس شخص کے لیے اپنے احکام کو واجب کرتے ہیں جس میں وہ قائم ہوں۔ وہ یہ چاہتے ہیں کہ یہ (احکام) ان کی ذات کے لیے ہوں، اور اسی وجہ سے متکلم (اہل کلام) اس شخص پر رد کرنے کے قابل ہوا جو ارادہ حادثہ (نئے ارادے) کا قائل ہے جو کسی محل (جگہ) میں نہیں ہوتا۔\n\nاور جہاں تک موسیٰ علیہ السلام کے لیے درخت سے اللہ کے کلام کا تعلق ہے، تو بعض کے نزدیک یہ اس بات کی دلیل ہے کہ کلام کی نسبت اس کی طرف کی جاتی ہے جس نے اسے پیدا کیا، جیسا کہ دوسرا گروہ کہتا ہے کہ سننا مناسب چیز سے متعلق ہوا، اور وہ درخت سے خطاب تھا، اور یہ اللہ کے کلام کے سوا کچھ نہیں تھا، جیسا کہ اللہ نے فرمایا: \"پس اسے پناہ دے تاکہ وہ اللہ کا کلام سنے (كَلامَ الله)\" (التوبہ: ۶)۔ اور یہ معلوم ہے کہ اس سے سننا کس چیز سے متعلق ہوا، اور یہ کہنے والے کہ متکلم وہ ہے جس میں صفت کلام قائم ہو، اور اہل الکشف (کشف) جو یہ دیکھتے ہیں کہ الوجود (ہستی) ہر صورت میں اللہ کے لیے ہے، انہوں نے درخت کو متکلم کی صورت قرار دیا۔ جیسا کہ الحق (ذات حق) بندے کی زبان، اس کا سننا اور اس کی بصارت ہوتا ہے، اپنی ہویت (ذات) کے ساتھ نہ کہ اپنی صفت کے ساتھ، جیسا کہ وہ ایک ایسی صورت میں ظاہر ہوتا ہے جسے پہچانا نہیں جاتا اور پھر ایک ایسی صورت میں بدل جاتا ہے جسے پہچانا جاتا ہے، اور وہ وہی ہے، کوئی دوسرا نہیں، کیونکہ کوئی دوسرا ہے ہی نہیں۔ پس درخت سے الحق (ذات حق) کے سوا کسی نے کلام نہیں کیا، لہٰذا الحق (ذات حق) درخت کی صورت ہے۔ اور موسیٰ علیہ السلام نے الحق (ذات حق) کے سوا کسی کو نہیں سنا، لہٰذا الحق (ذات حق) موسیٰ علیہ السلام کی صورت ہے اس حیثیت سے کہ وہ سامع ہیں، جیسا کہ وہ متکلم ہونے کی حیثیت سے درخت ہیں۔ اور درخت درخت ہے اور موسیٰ موسیٰ ہیں۔ یہ حلول نہیں ہے، کیونکہ کوئی چیز اپنی ہی ذات میں حلول نہیں کرتی۔ حلول دو ذاتیں دیتا ہے، جبکہ یہاں صرف دو حکم ہیں۔\n\nپس حس اس کی گواہی دیتی ہے جس کا افکار انکار کرتے ہیں، اور عقل وہ جانتی ہے جسے احساس رد کرتا ہے۔\nپس اس کی طرف دیکھو، تم اس کی صورتوں میں عجائبات دیکھو گے، اور اس کے حکم کو اس کی بہترین ترتیب میں دیکھو۔\nتم اسے اس کی عین (حقیقت) دیکھو گے جو اسے قریب سے دیکھتا ہے، اور جو اسے جانتا ہے وہ اسے اس کے بغیر نہیں جانتا۔\n\nپس ان منازل میں ان الٰہی نکات کو دیکھو، یہ کتنے مختصر ہیں اور کس قدر اختصار کے ساتھ امور کو ان کی اصل حالت پر بیان کرتے ہیں۔ اور اللہ الحق (ذات حق) فرماتا ہے اور وہی راہ دکھاتا ہے۔ (الأحزاب: ۴)",
    "fa": "باب چهارصد و پنجاه و ششم در معرفت منزلتی که هر کس هنگام شنیدن کلام من به حرکت درآید، پس شنیده است؛ مراد، وجدی است که هستی (الوجود) می‌بخشد.\n\nاگر شنیدن کلام حق نبود، اعیان ما آشکار نمی‌شد و از آن بر قدمی (پایه‌ای) به سوی هستی (الوجود) نمی‌شتافت.\nو اگر شنیدن نبود، بر مدارج خود به سوی حالت نیستی (العدم) باز نمی‌گشت.\nپس ما در برزخ هستیم و حق (الحق) ما را میان حدوث و میان حکم به قدم (ازلیت) مشاهده می‌کند.\nتکوّن (پدید آمدن) از کسی که کلامی ندارد، نیست؛ همانا تکوّن از قصد و از کلمه (کلام) است.\n\n[کلام (الکلام) مشتق از کَلْم (الکلم) به معنای جراحت است]\n\nخداوند متعال می‌فرماید: «إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ» (همانا سخن ما به چیزی، چون اراده‌اش کنیم، این است که به آن بگوییم: باش، پس می‌شود). یعنی حکمی که امر «کُن» (باش) متوجه آن شده است، آنچه بوده، بوده است؛ پس به واسطه آن معدوم می‌شود و موجود می‌گردد. بنابراین، تعلق آن جز به اثر نیست. به همین دلیل، در زبان عربی آن را کلام (الکلام) نامیده‌اند که مشتق از کَلْم (الکلم) به معنای جراحت است؛ و جراحت اثری است در مجروح. پس چون اثر یافت شد، آنچه از آن یافت شده، کلام نامیده شد، هر چه که بوده است؛ پس بفهم. و حرکت، انتقال از حالی به حال دیگر است؛ یعنی از حالی که شنونده بر آن است، به حالی که شنیدن کلام متکلم به او می‌بخشد، و این حالت بر اساس فهم اوست. پس او مجبور به حرکت است. به همین دلیل، صوفیه حرکت وجدی را که در آن احساس به حاضران در مجلس باقی می‌ماند، نمی‌پذیرند، مگر آنکه حرکت او به واسطه حق (بالله) پذیرفته شود. پس هرگاه احساس (به غیر) کند، بر او واجب است که بنشیند، مگر آنکه حاضران را آگاه سازد که او متواجد (متواجد) است نه صاحب وجد (صاحب وجد). در این صورت، آن را می‌پذیرند. اما این حالت نزد آنان در هر حال ستوده نیست، زیرا آنان در اصل، حرکت را به نفسِ متحرک ناپسند می‌دانند و آن را به واسطه محرِّک (حق) می‌ستایند.\n\nپس اصل سماع (السماع) که اهل طریقت به آن قائل‌اند، شریف است و در هر چیزی جاری می‌شود و به حالت خاصی از وزن و غنای طبیعی محدود نمی‌گردد. زیرا وزن طبیعی تنها در آنچه از طبیعت بر مزاجی خاص ترکیب یافته، تأثیر می‌گذارد و در حرکت طبع، فهم شرط نیست؛ برخلاف حرکت نفوس عقلیه. اگرچه طبیعت در اصل وجود نفوس عقلیه اثر دارد، اما در آنها آن قوت را ندارد مگر به واسطه فهم. پس جز فهم، آن را به حرکت درنمی‌آورد. آیا نمی‌بینی که کائنات جز با فهم، نه با عدم فهم، ظاهر و متکوّن نشدند؟ زیرا آنها معنای «کُن» (باش) را فهمیدند و متکوّن شدند. به همین دلیل فرمود: «فَيَكُونُ» (پس می‌شود)، یعنی آن شیء (متکوّن می‌شود)، زیرا هنگام شنیدن، آنچه را که حق با «کُن» اراده کرده بود، فهمید و به فهم خود مبادرت ورزید، نه به غیر تکوین از حالات. و این حرکت، وجد (الوجد) نامیده نشد مگر به دلیل حصول هستی (الوجود) در هنگام آن؛ منظورم وجود حکم است، خواه با عین (وجود خارجی) باشد یا بدون عین، زیرا این کائن (موجود) در نفس خود عین است.\n\nسپس حق (الحق) این صفت را به بندگانش عطا کرد و خود را شنونده قرار داد و خویشتن را محل تکوین آنچه بنده در درخواستش از او می‌طلبد، ساخت و آن را اجابت نامید. و این را با لفظ امر قرار داد، همان‌گونه که «کُن» را قرار داد، تا به او نشان دهد که حقایق، احکامشان به خودی خود نیست، بلکه برای کسی که تعقل کند و امور را آن‌گونه که هستند بداند، به جعل جاعل نیست. زیرا علم به این نوع از علوم، از بیشتر مردم پنهان است، بلکه عارف به آن، کشف این علوم را بر آنان حرام می‌داند، چرا که منجر به انکار حق (الحق) می‌شود، با وجود آنکه می‌دانند معانی، احکام خود را بر کسی که به او قائم شده‌اند، عقلاً واجب می‌سازند؛ آنان می‌خواهند بگویند که این احکام ذاتی آن معانی است. و به همین دلیل، متکلم توانست بر کسی که قائل به اراده حادثه بدون محل است، رد کند. و اما کلام خداوند از درخت برای موسی (ع)، نزد برخی دلیل بر آن است که کلام به کسی که آن را خلق کرده، نسبت داده می‌شود؛ همان‌گونه که طایفه دیگر می‌گویند: شنیدن به امر مناسب تعلق گرفت و آن خطاب از درخت بود و جز کلام خدا نبود، چنانکه فرمود: «فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله» (پس او را پناه ده تا کلام خدا را بشنود). و معلوم است که شنیدن از آن به چه چیزی تعلق گرفت. و این قائلان که می‌گویند متکلم کسی است که صفت کلام به او قائم شده است، و اهل کشف (الکشف) که می‌بینند هستی (الوجود) در هر صورتی از آنِ خداست، درخت را صورت متکلم قرار دادند، همان‌گونه که حق (الحق) زبان بنده و گوش و چشم او بود، به هویتش نه به صفتش. همان‌گونه که در صورتی ظاهر می‌شود که انکار می‌گردد و به صورتی تبدیل می‌شود که شناخته می‌شود، و او همان است و غیر او نیست، زیرا غیری وجود ندارد. پس جز حق (الحق) از درخت سخن نگفت؛ بنابراین حق، صورت درخت است. و جز حق از موسی نشنید؛ بنابراین حق، صورت موسی است از آن جهت که شنونده است، همان‌گونه که از آن جهت که متکلم است، صورت درخت است. و درخت، درخت است و موسی، موسی؛ حلولی (الحلول) در کار نیست، زیرا شیء در ذات خود حلول نمی‌کند. حلول مستلزم دو ذات است، در حالی که در اینجا تنها دو حکم (دو تجلی) وجود دارد.\n\nپس حس، آنچه را که افکار انکار می‌کنند، شهود می‌کند؛ و عقل، آنچه را که احساس به آن متهم می‌شود، می‌داند.\nپس به او بنگر تا در صورت‌هایش شگفتی ببینی؛ و به حکم او در حُسن ترتیبش نظر کن.\nاو را عین کسی می‌بینی که او را از نزدیک می‌بیند؛ و کسی که او را درک می‌کند، جز به واسطه او، درکش نمی‌کند.\n\nپس به این نکات الهی در این منازل بنگر؛ چه مختصرند و چه نیکو امور را آن‌گونه که هستند، در ایجاز بیان کرده‌اند. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 2
}