{
  "id": 55,
  "title": {
    "ar": "الباب الخامس والخمسون في معرفة الخواطر الشيطانية",
    "en": "Chapter Fifty-Five: On the Knowledge of Diabolical Suggestions (الخواطر الشيطانية)",
    "ur": "پچپنواں باب شیطانی خواطر کی معرفت میں",
    "fa": "باب پنجاه و پنجم در معرفت خواطر شیطانی"
  },
  "content": {
    "ar": "## (الباب الخامس والخمسون في معرفة الخواطر الشيطانية)\n\n\n> لو أن الله يفهمنا *** الذي فيها من الحكم‏\n\n\n> رأيت الأمر يعلو عن *** مجال الفكر والهمم‏\n\n\n> يدق فليس تظهره *** إليك جوامع الكلم‏\n\n\n### [الخواطر أربعة لا خامس لها]\n\n\nالخواطر أربعة لا خامس لها خاطر رباني وخاطر ملكي وخاطر نفسي وخاطر شيطاني ولا خامس هناك وقد ذكرنا معرفة الخواطر في هذا الكتاب وفي بعض كتبنا فلنذكر في هذا الباب الخاطر الشيطاني خاصة\n\n\n### [أقسام الشياطين‏]\n\n\nاعلم أن الشياطين قسمان قسم معنوي وقسم حسي ثم القسم الحسي من ذلك على قسمين شيطاني إنسي وشيطاني جني يقول الله عز وجل شَياطِينَ الْإِنْسِ والْجِنِّ يُوحِي بَعْضُهُمْ إِلى‏ بَعْضٍ زُخْرُفَ الْقَوْلِ غُرُوراً ولَوْ شاءَ رَبُّكَ ما فَعَلُوهُ فَذَرْهُمْ وما يَفْتَرُونَ فجعلهم أهل افتراء على الله وحدث فيما بينهما في الإنسان شيطان معنوي وذلك أن شيطان الجن والإنس إذا ألقى من ألقى منهم في قلب الإنسان أمرا ما يبعده عن الله به فقد يلقي أمرا خاصا وهو خصوص مسألة بعينها وقد يلقي أمرا عاما ويتركه فإن كان أمرا عاما فتح له في ذلك طريقا إلى أمور لا يفطن لها الجني ولا الإنسي تتفقه فيه النفس وتستنبط من تلك الشبه أمورا إذا تكلم بها تعلم إبليس الغواية فتلك الوجوه التي تنفتح له في ذلك الأسلوب العام الذي ألقاه إليه أو لا شيطان الإنس أو شيطان الجن تسمى الشياطين المعنوية لأن كل واحد من شياطين الإنس والجن يجهلون ذلك وما قصدوه على التعيين وإنما أرادوا بالقصد الأول فتح هذا الباب عليه لأنهم علموا إن في قوته وفطنته‏\nأن يدقق النظر فيه فينقدح له من المعاني المهلكة ما لا يقدر على ردها بعد ذلك وسبب ذلك الأصل الأول فإنه اتخذه أصلا صحيحا وعول عليه فلا يزل التفقه فيه يسرقه حتى خرج به عن ذلك الأصل‏\n\n\n### [مداخل الشيطان في نفوس الالم‏]\n\n\n### [الغلو في حب آل البيت‏]\n\n\nوعلى هذا جرى أهل البدع والأهواء فإن الشياطين ألقت إليهم أصلا صحيحا لا يشكون فيه ثم طرأت عليهم التلبيسات من عدم الفهم حتى ضلوا فينسب ذلك إلى الشيطان بحكم الأصل ولو علموا إن الشيطان في تلك المسائل تلميذ له يتعلم منه وأكثر ما ظهر ذلك في الشيعة ولا سيما في الإمامية منهم فدخلت عليهم شياطين الجن أولا بحب أهل البيت واستفراغ الحب فيهم ورأوا أن ذلك من أسنى القربات إلى الله وكذلك هو لو وقفوا ولا يزيدون عليه إلا أنهم تعدوا من حب أهل البيت إلى طريقين منهم من تعدى إلى بغض الصحابة وسبهم حيث لم يقدموهم وتخيلوا أن أهل البيت أولى بهذه المناصب الدنيوية فكان منهم ما قد عرف واستفاض وطائفة زادت إلى سب الصحابة القدح في رسول الله صلى الله عليه وسلم وفي جبريل عليه السلام وفي الله جل جلاله حيث لم ينصوا على رتبتهم وتقديمهم في الخلافة للناس حتى أنشد بعضهم‏\n\n\nما كان من بعث الأمين أمينا\n\n\nوهذا كله واقع من أصل صحيح وهو حب أهل البيت أنتج في نظرهم فاسدا فضلوا وأضلوا فانظر ما أدى إليه الغلو في الدين أخرجهم عن الحد فانعكس أمرهم إلى الضد قال تعالى يا أَهْلَ الْكِتابِ لا تَغْلُوا في دِينِكُمْ غَيْرَ الْحَقِّ ولا تَتَّبِعُوا أَهْواءَ قَوْمٍ قَدْ ضَلُّوا من قَبْلُ وأَضَلُّوا كَثِيراً وضَلُّوا عَنْ سَواءِ السَّبِيلِ‏\n\n\n### [الوضع في الحديث‏]\n\n\nوطائفة ألفت إليهم الشياطين أصلا صحيحا لا يشكون فيه‏\n\n\nإن النبي صلى الله عليه وسلم قال من سن سنة حسنة فله أجرها وأجر من عمل بها\n\n\nثم تركتهم بعد ما حببت إليهم العمل على هذا فجعل بعض الناس لحرصه على الخير يتفقه لكونه يريد تحصيل أجور من عمل بها فإذا سن سنة حسنة يخاف إذا نسبها إلى نفسه لا تقبل منه فيضع لأجل قبولها حديثا عن رسول الله صلى الله عليه وسلم في ذلك ويتأول أن ذلك داخل في حكم قوله من سن سنة حسنة فأجاز الكذب على رسول الله صلى الله عليه وسلم وأن يقول عليه صلى الله عليه وسلم ما لم يقله ولا فاه به لسانه ويرى أن ذلك خير فإن الأصول تعضده فإذا أخطر له الملك‏\n\n\nقوله صلى الله عليه وسلم من كذب علي متعمدا فليتبوأ مقعده من النار\n\n\nوأخطر له أيضا\n\n\nقوله صلى الله عليه وسلم ليس كذب علي ككذب على أحد من كذب علي متعمدا فليتبوأ مقعده من النار\n\n\nيتأول ذلك كله بإلقاء الشيطان في خاطره فيقول له إنما ذلك إذا دعا إلى ضلالة وأنا ما سننت إلا خيرا فهو مأجور بالضرورة من كونه سن سنة حسنة ومأزور من كونه كذب على رسول الله صلى الله عليه وسلم وقال عنه إنه صرح بما لم يقله صلى الله عليه وسلم‏\n\n\n### [استعجال الرئاسة، لأهل الخلوات والرياضات‏]\n\n\nوكذلك إن كان من أهل الخلوات والرياضات واستعجل الرئاسة من قبل أن يفتح الله عليه بابا من أبواب عبوديته فيلزم طريق الصدق ولا يقف مع رسول الله صلى الله عليه وسلم مثل ما وقف الأول وأنه يجري إلى الافتراء على الله فينسب ذلك الذي سنه إلى الله تعالى ويتأول أنه لا فاعل إلا الله وأنه تعالى المنطق عباده ويصير من وقته لذلك أشعر يا مجبورا ويقول هذا كله خير فإني ما قصدت إلا أن أعضد تلك السنة الحسنة فلم أر أشد في تقويتها من أني أسندها إلى الله تعالى كما هي في نفس الأمر خلق الله تعالى أجراها الله على لساني هذا كله يحدث به نفسه لا يقول ذلك لأحد فإذا كان مع الناس يريهم أن ذلك جاءه من عند الله كما يجي‏ء لأولياء الله على تلك الطريق فإذا أخطر له الملك قول الله تعالى ومن أَظْلَمُ مِمَّنِ افْتَرى‏ عَلَى الله كَذِباً أَوْ قالَ أُوحِيَ إِلَيَّ ولَمْ يُوحَ إِلَيْهِ شَيْ‏ءٌ ومن قالَ سَأُنْزِلُ مِثْلَ ما أَنْزَلَ الله يتأول ذلك مع نفسه ويقول ما أنا مخاطب بهذه الآية وإنما خوطب بها أهل الدعوى الذين ينسبون الفعل إلى أنفسهم فإنه قال افترى فنسب فعل الافتراء إلى هذا القائل وأنا أقول إن الأفعال كلها لله تعالى لا إلي فهو الذي قال على لساني‏\n\n\nأ لا ترى النبي صلى الله عليه وسلم قال في الصلاة إن الله قال على لسان عبده سمع الله لمن حمده‏\n\n\nفكذلك هذا ثم قال أَوْ قالَ أُوحِيَ إِلَيَّ فأضاف القول إليه وكذلك قوله إلي ومن أنا حتى أقول إلي إذ الله هو المتكلم وهو السميع ثم قال سَأُنْزِلُ مِثْلَ ما أَنْزَلَ الله وما أقول أنا ذلك بل الإنزال كله من الله فإذا تفقه في نفسه في هذا كله افْتَرى‏ عَلَى الله كَذِباً وزُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَناً\n\n\n### [الشيطان لا يأتي إلى الإنسان إلا بما هو الغالب عليه‏]\n\n\nفهذا أصل صحيح لهاتين الطائفتين قد ألقاه الشيطان إليهما وتركه عندهما وبقي يتفقه في ذلك فقها نفسيا فإن لم يكن الإنسان على بصيرة وتمييز من خواطره حتى يفرق بين إلقاء الشيطان وإن كان خيرا وبين إلقاء الملك والنفس ويميز بينهما ميزا صحيحا وإلا فلا يفعل فإنه لا يفلح أبدا فإن الشيطان‏\nلا يأتي إلى كل طائفة إلا بما هو الغالب عليها وليس غرضه من الصالحين إلا أن يجهلوه في الأخذ عنه فإذا جهلوه ونسبوا ذلك إلى الله ولم يعرفوا على أي طريق وصل إليهم كأنه قنع منهم بهذا القدر من الجهل وعرف أنهم تحت سلطانه فلا يزال يستدرجه في خيريته حتى يتمكن منه في تصديق خواطره وأنها من الله فيسلخه من دينه كما تنسلخ الحية من جلدها أ لا ترى صورة الجلد المسلوخ منها على صورة الحية كذلك هذا الأمر\n\n\n### [العلم والإيمان ولكن السعادة في الإيمان‏]\n\n\nجاء إبليس إلى عيسى عليه السلام في صورة شخص شيخ في ظاهر الحس لأن الشيطان ليس له إلى باطن الأنبياء عليهم السلام من سبيل فخواطر الأنبياء عليهم السلام كلها إما ربانية أو ملكية أو نفسية لا حظ للشيطان في قلوبهم ومن يحفظ من الأولياء في علم الله يكون بهذه المثابة في العصمة مما يلقى لا في العصمة من وصوله إليه فالولي المعتنى به على علامة من الله فيما يلقي إليه الشيطان وسبب ذلك أنه ليس بمشرع والأنبياء مشرعون فلذلك عصمت بواطنهم‏\n\n\nفقال لعيسى عليه السلام يا عيسى قل لا إله إلا الله ورضي منه أن يطيع أمره في هذا القدر فقال عيسى عليه السلام أقولها لا لقولك لا إله إلا الله فرجع خاسئا\n\n\nومن هنا تعلم الفرق بين العلم بالشي‏ء وبين الايمان به وأن السعادة في الايمان وهو أن تقول ما تعلمه وما قلته لقول رسولك الأول الذي هو موسى عليه السلام لقول هذا الرسول الثاني الذي هو محمد صلى الله عليه وسلم لا لعلمك ولا للقول الأول فحينئذ لك يشهد بالإيمان ومالك السعادة وإذا قلت ذلك لا لقوله وأظهرت أنك قلت ذلك لقوله كنت منافقا قال تعالى يا أَيُّهَا الَّذِينَ آمَنُوا يريد أهل الكتاب حيث قالوا ما قالوه لأمر نبيهم عيسى أو موسى أو من كان من أهل الايمان بذلك من الكتب المتقدمة ولهذا قال لهم يا أَيُّهَا الَّذِينَ آمَنُوا ثم قال لهم آمَنُوا بأنبيائي قولوا لا إله إلا الله لقول محمد صلى الله عليه وسلم لا لعلمكم بذلك ولا لإيمانكم بنبيكم الأول فتجمعوا بين الإيمانين فيكون لكم أجران‏\n\n\n### [الفرق بين ما هو من عند الله وبين طريق الملك والنفس والشيطان‏]\n\n\nفيقنع الشيطان من الإنسان أن يلبس عليه بهذا القدر فلا يفرق بين ما هو من عند الله من حيث ما هو من عند الله ولا بين طريق الملك والنفس والشيطان فالله يجعل لك علامة تعرف بها مراتب خواطرك ومما تعرف به الخواطر الشيطانية وإن كانت في لطاعة بعدم الثبوت على الأمر الواحد وسرعة الاستبدال من خاطر بأمر ما إلى خاطر بأمر آخر فإنه حريص وهو مخلوق من لهب النار ولهب النار سريع الحركة فأصل إبليس عدم البقاء على حالة واحدة في أصل نشأته فهو بحكم أصله والإنسان له الثبوت فإنه من التراب فله البرد واليبس فهو ثابت في شغله وكذلك الخواطر النفسية ثابتة ما لم يزلزلها الملك أو الشيطان ومتعلق أصل الخواطر الشيطانية إنما هو المحظور فعلا كان أو تركا ثم يليه المكروه فعلا كان أو تركا فالأول في العامة والثاني في العباد من العامة وقد يتعلق بالمباح في حق المبتدي من أهل طريق الله ويأتي بالمندوب في حق المتوسطين من أهل الله أصحاب السماع فإنه يستدرج كل طائفة من حيث ما هو الغالب عليها فإنه عالم بمواقع المكر والاستدراج ويأتي العارفين بالواجبات فلا يزال بهم حتى نووا مع الله فعل أمر ما من الطاعات وهو في نفس الأمر عهد يعهده مع الله فإذا استوثق منه في ذلك وعزم وما بقي إلا الفعل أقام له عبادة أخرى أفضل منها شرعا فيرى العارف أن يقطع زمانه بالأولى فيترك الأول ويشرع في الثاني فيفرح إبليس حيث جعله ينقض عهد الله من بعد ميثاقه والعارف لا خبر له بذلك فلو عرف من أول أن ذلك من الشيطان عرف كيف يرده وكيف يأخذه كما فعل عيسى عليه السلام وكل متمكن من أهل الله من ورثة الأنبياء فيراها مع كونها حسنة هي خواطر شيطانية وكذا جاء للمنافق من أهل الكتاب قال له أ لم تعلم أن نبيك قد بشر بهذا الرجل وقد علمت أنه هو والنبوة تجمعهما فقل له أنك رسول الله لقول نبيك لا لقوله ولا فرق بينهما فيقول المنافق عند ذلك أنك رسول الله فأكذبهم الله فقال تعالى إِذا جاءَكَ الْمُنافِقُونَ قالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ الله على ما قررهم الشيطان فقال الله والله يَعْلَمُ إِنَّكَ لَرَسُولُهُ والله يَشْهَدُ إِنَّ الْمُنافِقِينَ لَكاذِبُونَ في أنهم قالوا ذلك لقولك لا في قولهم أنك رسول الله ولو أراد ذلك كان نفيا لرسالته صلى الله عليه وسلم‏\n\n\n### [الميزان الذي يعرف به الخاطر الشيطاني من غيره‏]\n\n\nفقد أعلمتك بمداخل الشيطان إلى نفوس العالم لتحذره وتسأل الله أن يعطيك علامة تعرفه بها وقد أعطاك الله في العامة ميزان الشريعة وميز لك بين فرائضه ومندوباته ومباحة ومحظوره ومكروهه ونص على ذلك في كتابه وعلى لسان رسوله فإذا خطر لك خاطر في محظور أو مكروه فتعلم أنه من الشيطان بلا شك وإذا خطر لك خاطر في مباح فتعلم أنه من النفس بلا شك فخاطر الشيطان بالمحظور\nوالمكروه اجتنبه فعلا كان أو تركا والمباح أنت مخير فيه فإن غلب عليك طلب الأرباح فاجتنب المباح واشتغل بالواجب أو المندوب غير أنك إذا تصرفت في المباح فتصرف فيه على حضور أنه مباح وأن الشارع لو لا ما أباحه لك ما تصرفت فيه فتكون مأجورا في مباحك لا من حيث كونه مباحا إلا من حيث إيمانك به أنه شرع من عند الله فإن الحكم لا ينتقل بعد موت رسول الله صلى الله عليه وسلم فإن الحكم هو عين الشرع وقد سد ذلك الباب فالمباح مباح لا يكون واجبا ولا محظورا أبدا وكذلك كل واحد من الأحكام وإن خطر لك خاطر في فرض فقم إليه بلا شك فإنه من الملك وإذا خطر لك خاطر في مندوب فاحفظ أول الخاطر فإنه قد يكون من إبليس فأثبت عليه فإذا خطر لك أن تتركه لمندوب آخر هو أعلى منه وأولى فلا تعدل عن الأول وأثبت عليه واحفظ الثاني وافعل الأول ولا بد فإذا فرغت منه اشرع في الثاني فافعله أيضا فإن الشيطان يرجع خاسئا بلا شك حيث لم يتفق له مقصوده وبهذا الدواء يذهب مرض الشيطان من نفسك وتكون عمري المقام ما يلقاك الشيطان في فج إلا سلك فجا غير فجك إذا عاملته بمثل هذا فحافظ على ما نبهتك عليه فإن الله قد أثنى على الذين يُسارِعُونَ في الْخَيْراتِ وهُمْ لَها سابِقُونَ ويكفي هذا القدر والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Fifty-Five: Concerning the Knowledge of Satanic Suggestions\n\nIf only Allah would grant us understanding\nOf the wisdom contained within them,\nYou would see the matter transcend\nThe scope of thought and aspirations.\nIt is too subtle to be revealed to you\nBy the comprehensive words (جوامع الكلم).\n\n### [The Four Suggestions]\n\nSuggestions (الخواطر) are four, and there is no fifth: a Divine suggestion (خاطر رباني), an Angelic suggestion (خاطر ملكي), an Egoic suggestion (خاطر نفسي), and a Satanic suggestion (خاطر شيطاني). There is no fifth. We have already mentioned the knowledge of the Suggestions in this book and in some of our other writings, so in this chapter, we shall specifically mention the Satanic suggestion.\n\n### [Divisions of the Devils]\n\nKnow that the devils (الشياطين) are of two divisions: a subtle division (قسم معنوي) and a corporeal division (قسم حسي). The corporeal division is further divided into two types: human devils (شيطاني إنسي) and jinn devils (شيطاني جني). Allah, the Mighty and Majestic, says: <<شَياطِينَ الْإِنْسِ والْجِنِّ يُوحِي بَعْضُهُمْ إِلى‏ بَعْضٍ زُخْرُفَ الْقَوْلِ غُرُوراً ولَوْ شاءَ رَبُّكَ ما فَعَلُوهُ فَذَرْهُمْ وما يَفْتَرُونَ>> (Devils among mankind and jinn, inspiring one another with flowery speech by way of delusion. And had your Lord willed, they would not have done it, so leave them and that which they invent). Thus, He made them people who invent falsehoods against Allah.\n\nFurthermore, there arises within the human being a subtle devil (شيطان معنوي). This occurs when a devil from the jinn or mankind casts a matter into the human heart that distances him from Allah. This casting may be a specific matter, relating to a particular issue, or it may be a general matter which the devil then leaves. If it is a general matter, it opens a path for the person toward issues that neither the jinn nor the human devil notices. The soul (النفس) then engages in subtle reasoning (تتفقه) regarding it, deriving from those ambiguities (الشبه) matters which, if spoken, would teach Iblis himself how to lead astray. These facets that open up for the person through that general approach, which was initially cast by the human devil or the jinn devil, are called the subtle devils (الشياطين المعنوية). This is because the individual devils among mankind and jinn are ignorant of these subsequent derivations and did not intend them specifically. Their primary intention was merely to open this door for the person, knowing that his intellectual power and acumen would allow him to scrutinize the matter deeply, leading to the emergence of destructive meanings (المعاني المهلكة) that he would be unable to reject afterward. The cause of this is the initial premise (الأصل الأول), which he adopted as a sound principle and relied upon. The subtle reasoning (التفقه) regarding it continues to steal him away until he is led astray from that original principle.\n\n### [The Devil's Entrances into the Souls of the Learned]\n\n### [Exaggeration in the Love of the Prophet's Family]\n\nThe People of Innovation and Caprice (أهل البدع والأهواء) proceed according to this pattern. The devils cast a sound principle (أصلا صحيحا) to them, about which they have no doubt. Then, delusions (التلبيسات) arise due to a lack of understanding, leading them astray. This deviation is attributed to the devil by virtue of the original premise, even though, had they known, the devil in those subsequent issues is merely a student learning from them.\n\nThis phenomenon is most evident among the Shi’a, especially the Imamiyya among them. The jinn devils first approached them through the love of the Prophet’s Family (آل البيت) and the complete devotion of love to them, seeing this as one of the highest acts of proximity (القربات) to Allah. This is indeed true, had they stopped there and not exceeded it. However, they transgressed from the love of the Prophet’s Family into two paths:\n\nOne group transgressed into hating and reviling the Companions (الصحابة) because they did not give precedence to the Family, imagining that the Family was more deserving of these worldly positions. Their actions in this regard are well-known and widespread.\n\nAnother faction went further than reviling the Companions, extending their criticism to the Messenger of Allah (peace and blessings be upon him), to Gabriel (peace be upon him), and to Allah, Glorious is His Majesty, for not explicitly designating their rank and their precedence in the Caliphate for the people. One of them even recited:\n\nما كان من بعث الأمين أمينا\n(The sending of the Trustworthy One was not trustworthy.)\n\nAll of this stems from a sound principle—the love of the Prophet’s Family—which produced a corrupt outcome in their view, leading them astray and causing others to stray. Observe what exaggeration (الغلو) in religion leads to: it removes them from the proper limit, and their affair is inverted to the opposite. Allah the Exalted says: <<يا أَهْلَ الْكِتابِ لا تَغْلُوا في دِينِكُمْ غَيْرَ الْحَقِّ ولا تَتَّبِعُوا أَهْواءَ قَوْمٍ قَدْ ضَلُّوا من قَبْلُ وأَضَلُّوا كَثِيراً وضَلُّوا عَنْ سَواءِ السَّبِيلِ>> (O People of the Scripture, do not exceed the limits in your religion beyond the truth, nor follow the desires of a people who went astray before, and led many astray, and strayed from the straight path).\n\n### [Fabrication of Hadith]\n\nAnother group had a sound principle cast to them by the devils, about which they had no doubt:\n\nThe Prophet (peace and blessings be upon him) said: \"Whoever institutes a good practice (سن سنة حسنة) will have its reward and the reward of whoever acts upon it.\"\n\nThe devils then left them after making them love acting upon this principle. Some people, due to their eagerness for good, engage in subtle reasoning (يتفقه) because they desire to acquire the rewards of those who act upon it. If they institute a good practice, they fear that if they attribute it to themselves, it will not be accepted. Therefore, for the sake of its acceptance, they fabricate a hadith (يضع لأجل قبولها حديثا) attributed to the Messenger of Allah (peace and blessings be upon him) concerning it. They interpret this as falling under the ruling of his saying, \"Whoever institutes a good practice.\"\n\nThus, they permit lying against the Messenger of Allah (peace and blessings be upon him) and saying that he (peace and blessings be upon him) declared something he never said or uttered. They view this as good, since the fundamental principles support them.\n\nIf the Angel (الملك) suggests to them the Prophet’s saying:\n\n\"Whoever deliberately lies about me, let him take his seat in the Fire.\"\n\nAnd also suggests to them his saying:\n\n\"Lying about me is not like lying about anyone else. Whoever deliberately lies about me, let him take his seat in the Fire.\"\n\nThey interpret all of this through the devil’s casting into their suggestion (خاطره). The devil tells him: \"That applies only if one calls to misguidance, but I have only instituted good.\" Thus, he is necessarily rewarded for instituting a good practice (سن سنة حسنة) and burdened with sin for lying against the Messenger of Allah (peace and blessings be upon him) and claiming that he explicitly stated what he (peace and blessings be upon him) did not say.\n\n### [Haste for Leadership among the People of Retreats and Spiritual Disciplines]\n\nSimilarly, if a person belongs to the people of spiritual retreats (الخلوات) and disciplines (الرياضات) and hastens toward leadership (الرئاسة) before Allah opens a door of servitude (عبوديته) for him, he must adhere to the path of sincerity (الصدق).\n\nIf he does not stop where the first group stopped, he proceeds to invent falsehoods against Allah (الافتراء على الله). He attributes the practice he instituted to Allah the Exalted, interpreting that there is no doer (فاعل) but Allah, and that He is the One Who makes His servants speak. At that moment, he becomes a poet who feels compelled (أشعر يا مجبورا), and he says, \"All of this is good, for my only intention was to support that good practice (السنة الحسنة). I saw nothing stronger in reinforcing it than attributing it to Allah the Exalted, as it is in reality (في نفس الأمر)—Allah’s creation, which Allah caused to flow upon my tongue.\"\n\nHe says all of this to himself; he does not say it to anyone else. But when he is with people, he shows them that this came to him from Allah, just as it comes to the Friends of Allah (أولياء الله) through that path.\n\nIf the Angel suggests to him the saying of Allah the Exalted: <<ومن أَظْلَمُ مِمَّنِ افْتَرى‏ عَلَى الله كَذِباً أَوْ قالَ أُوحِيَ إِلَيَّ ولَمْ يُوحَ إِلَيْهِ شَيْ‏ءٌ ومن قالَ سَأُنْزِلُ مِثْلَ ما أَنْزَلَ الله>> (And who is more unjust than one who invents a lie about Allah or says, \"It has been revealed to me,\" while nothing has been revealed to him, or one who says, \"I will reveal [something] like what Allah has revealed\"), he interprets this to himself, saying: \"I am not addressed by this verse. Rather, it addresses those who claim agency (أهل الدعوى) and attribute the act to themselves, for He said 'invents a lie' (افترى), attributing the act of invention to the speaker. But I say that all acts belong to Allah the Exalted, not to me. He is the One Who spoke through my tongue.\"\n\n\"Do you not see that the Prophet (peace and blessings be upon him) said concerning the prayer (الصلاة) that Allah spoke through the tongue of His servant, 'Allah hears the one who praises Him' (سمع الله لمن حمده)?\"\n\n\"It is the same here.\" Then he continues: \"Or says, 'It has been revealed to me' (أَوْ قالَ أُوحِيَ إِلَيَّ), attributing the saying to himself, and likewise the phrase 'to me' (إلي). Who am I to say 'to me,' since Allah is the Speaker and the Hearer?\" Then he says: \"Or one who says, 'I will reveal [something] like what Allah has revealed' (سَأُنْزِلُ مِثْلَ ما أَنْزَلَ الله). I do not say that, for all revelation (الإنزال) is from Allah.\"\n\nWhen he engages in this subtle reasoning (تفقه) within himself regarding all this, he has <<افْتَرى‏ عَلَى الله كَذِباً>> (invented a lie about Allah), and <<زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَناً>> (the evil of his deed was made fair-seeming to him, so he saw it as good).\n\n### [The Devil Only Approaches a Person Through What Dominates Him]\n\nThis is a sound principle (أصل صحيح) that the devil cast to these two groups, leaving it with them, and then the person engaged in egoic subtle reasoning (فقها نفسيا) regarding it.\n\nIf a person lacks insight and discernment regarding his suggestions (خواطره) such that he cannot correctly distinguish between the casting of the devil—even if it appears good—and the casting of the Angel and the Ego (النفس), he will never succeed.\n\nThe devil only approaches each group through what dominates them. His goal with the righteous is merely that they remain ignorant of taking from him. If they are ignorant of him and attribute that suggestion to Allah, not knowing the path by which it reached them, it is as if he is satisfied with this degree of ignorance from them. He knows they are under his dominion. He continues to lure (يستدرجه) them through their goodness until he gains control over them by making them believe their suggestions are from Allah. He then strips them of their religion, just as the snake sheds its skin. Do you not see that the image of the shed skin resembles the snake? The matter is likewise.\n\n### [Knowledge and Faith, but Felicity is in Faith]\n\nIblis came to Jesus (peace be upon him) in the form of an old man, visible to the external senses, because the devil has no access to the inner being (باطن) of the Prophets (peace be upon them). The suggestions (خواطر) of the Prophets are all either Divine (ربانية), Angelic (ملكية), or Egoic (نفسية); the devil has no share in their hearts.\n\nAny Friend of Allah (ولي) whom Allah preserves in His Knowledge is likewise protected from what is cast to him, though not protected from its arrival. The protected Friend (الولي المعتنى به) has a sign from Allah regarding what the devil casts to him. The reason for this is that the Friend is not a lawgiver (مشرع), whereas the Prophets are lawgivers, and thus their inner beings are protected.\n\nThe old man said to Jesus (peace be upon him): \"O Jesus, say, 'There is no god but Allah.'\" He was satisfied that Jesus would obey his command in this much. Jesus (peace be upon him) replied: \"I say it, but not because of your saying, 'There is no god but Allah.'\" Iblis retreated, defeated (خاسئا).\n\nFrom this, you learn the difference between knowledge of a thing (العلم بالشي‏ء) and faith in it (الإيمان به), and that felicity (السعادة) lies in faith. Faith means that you say what you know, and that you say it because of the saying of your first Messenger, who was Moses (peace be upon him), or because of the saying of this second Messenger, who is Muhammad (peace and blessings be upon him)—not because of your knowledge, nor because of the first saying.\n\nOnly then will you be witnessed as having faith (الإيمان), and felicity will be yours. If you say it, but not because of his saying, yet you pretend that you said it because of his saying, you are a hypocrite (منافق).\n\nAllah the Exalted says: <<يا أَيُّهَا الَّذِينَ آمَنُوا>> (O you who have believed). This refers to the People of the Scripture (أهل الكتاب) when they said what they said based on the command of their Prophet, Jesus or Moses, or whoever belonged to the people of faith through the previous scriptures. That is why He addressed them: <<يا أَيُّهَا الَّذِينَ آمَنُوا>> (O you who have believed). Then He told them: \"Believe in My Prophets! Say, 'There is no god but Allah,' because of the saying of Muhammad (peace and blessings be upon him), not because of your knowledge of it, nor because of your faith in your first Prophet. Thus, you will combine the two faiths, and you will have two rewards.\"\n\n### [The Difference Between What is from Allah and the Path of the Angel, the Ego, and the Devil]\n\nThe devil is satisfied with confusing a person to this extent, so that he does not distinguish between what is from Allah, in the sense that it is truly from Allah, and the path of the Angel, the Ego, and the Devil.\n\nMay Allah grant you a sign by which you may know the levels (مراتب) of your suggestions.\n\nOne way you recognize Satanic suggestions (الخواطر الشيطانية), even if they relate to obedience (الطاعة), is by the lack of persistence (عدم الثبوت) on a single matter and the rapid replacement of one suggestion with another. This is because he (the devil) is eager, and he is created from the flame of fire (لهب النار), and the flame of fire is swift in movement. The origin of Iblis is the lack of remaining in a single state in his original creation (أصل نشأته). He acts according to his origin.\n\nThe human being, however, possesses persistence (الثبوت), for he is made of earth (التراب), which has coldness and dryness, making him stable in his work. Likewise, the Egoic suggestions (الخواطر النفسية) are stable unless the Angel or the Devil shakes them.\n\nThe primary concern of Satanic suggestions is the prohibited (المحظور), whether an act or an omission, followed by the disliked (المكروه), whether an act or an omission. The first applies to the common people (العامة), and the second to the devout among the common people.\n\nIt may also relate to the permissible (المباح) for the beginner among the people of Allah’s path, and it may bring forth the recommended (المندوب) for the intermediate people of Allah, the people of audition (أصحاب السماع). This is because he lures (يستدرج) every group through what dominates them, for he is knowledgeable of the points of deception (المكر) and enticement (الاستدراج).\n\nHe approaches the Gnostics (العارفين) with obligations (الواجبات). He persists with them until they intend with Allah to perform a certain act of obedience (الطاعات), which is, in reality, a covenant (عهد) they make with Allah. Once he is certain of their commitment and resolve, and only the action remains, he presents them with another act of worship that is legally superior (أفضل منها شرعا). The Gnostic then sees that he should spend his time on the superior act, so he abandons the first and begins the second.\n\nIblis rejoices because he caused the Gnostic to break his covenant with Allah after its confirmation (ميثاقه). The Gnostic has no knowledge of this. If he had known from the beginning that it was from the devil, he would have known how to reject it and how to accept it, just as Jesus (peace be upon him) did. Every established person among the people of Allah, the inheritors of the Prophets, recognizes such suggestions as Satanic, even though they are good.\n\nSimilarly, the devil came to the hypocrite among the People of the Scripture and said to him: \"Do you not know that your Prophet gave glad tidings of this man? You know that he is the one, and prophethood unites them. Say to him, 'You are the Messenger of Allah,' because of the saying of your Prophet, not because of his saying. There is no difference between them.\"\n\nThe hypocrite then says, \"You are the Messenger of Allah.\" Allah gave the lie to them, saying: <<إِذا جاءَكَ الْمُنافِقُونَ قالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ الله>> (When the hypocrites come to you, they say, \"We bear witness that you are indeed the Messenger of Allah\")—based on what the devil established for them. Then Allah said: <<والله يَعْلَمُ إِنَّكَ لَرَسُولُهُ والله يَشْهَدُ إِنَّ الْمُنافِقِينَ لَكاذِبُونَ>> (And Allah knows that you are indeed His Messenger, and Allah bears witness that the hypocrites are surely liars)—in their claim that they said it because of your saying, not in their statement that you are the Messenger of Allah. Had He intended the latter, it would have been a denial of his prophethood (peace and blessings be upon him).\n\n### [The Balance by Which the Satanic Suggestion is Distinguished from Others]\n\nI have informed you of the devil’s entrances into the souls of the learned so that you may beware of him and ask Allah to grant you a sign by which you may recognize him.\n\nAllah has already given you, for the common people, the balance of the Sacred Law (ميزان الشريعة). He has distinguished for you between its obligations (فرائضه), recommendations (مندوباته), permissibilities (مباحة), prohibitions (محظوره), and dislikes (مكروهه), and He has explicitly stated this in His Book and upon the tongue of His Messenger.\n\nIf a suggestion (خاطر) occurs to you regarding a prohibited or disliked matter, know without doubt that it is from the devil.\n\nIf a suggestion occurs to you regarding a permissible matter (مباح), know without doubt that it is from the Ego (النفس).\n\nAvoid the devil’s suggestion concerning the prohibited and the disliked, whether it is an act or an omission.\n\nYou have a choice regarding the permissible. If the pursuit of profits (طلب الأرباح) dominates you, avoid the permissible and occupy yourself with the obligatory (الواجب) or the recommended (المندوب).\n\nHowever, if you engage in the permissible, do so with the awareness that it is permissible, and that had the Lawgiver (الشارع) not permitted it for you, you would not engage in it. Thus, you will be rewarded for your permissible act, not because it is permissible, but because of your faith that it is a law (شرع) from Allah.\n\nThe ruling (الحكم) does not change after the death of the Messenger of Allah (peace and blessings be upon him), for the ruling is the essence of the Law (عين الشرع), and that door has been closed. The permissible remains permissible; it can never become obligatory or prohibited. Likewise for every other ruling.\n\nIf a suggestion occurs to you regarding an obligation (فرض), proceed to it without doubt, for it is from the Angel.\n\nIf a suggestion occurs to you regarding a recommended act (مندوب), pay attention to the beginning of the suggestion, for it may be from Iblis. Persist in the first act. If a suggestion occurs to you to abandon it for another recommended act that is higher or more worthy, do not deviate from the first. Persist in it, keep the second in mind, and perform the first necessarily. When you finish it, then begin the second and perform it as well.\n\nThe devil will retreat, defeated (خاسئا), without doubt, since his objective was not achieved. By this remedy, the sickness of the devil will depart from your soul, and you will be constant in your station (عمري المقام). The devil will not encounter you on any path except that he will take a different path than yours, if you deal with him in this manner.\n\nGuard what I have alerted you to, for Allah has praised those <<يُسارِعُونَ في الْخَيْراتِ وهُمْ لَها سابِقُونَ>> (who hasten to good deeds, and they are the foremost in them). This much suffices. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "## (باب پچپن: شیطانی خطرات کی معرفت میں)\n\nکاش اللہ ہمیں سمجھا دیتا\nوہ حکمتیں جو ان (خطرات) میں پوشیدہ ہیں\nتو تم دیکھتے کہ یہ معاملہ بلند ہے\nفکر اور ہمتوں کی رسائی سے\nیہ اتنا باریک ہے کہ اسے ظاہر نہیں کر سکتیں\nتمہاری طرف جامع کلمات (جوامع الکلم)\n\n### [خطرات چار ہیں، پانچواں نہیں]\n\nخطرات چار ہیں، پانچواں نہیں: ربانی خاطر، ملکی خاطر، نفسانی خاطر، اور شیطانی خاطر۔ پانچواں کوئی نہیں ہے۔ ہم نے اس کتاب میں اور اپنی بعض دیگر کتب میں خطرات کی معرفت کا ذکر کیا ہے۔ لہٰذا، ہم اس باب میں خاص طور پر شیطانی خاطر کا ذکر کریں گے۔\n\n### [شیطانوں کی اقسام]\n\nجان لو کہ شیطان دو قسم کے ہیں: ایک قسم معنوی (غیر محسوس) اور دوسری قسم حسی (محسوس)۔ پھر حسی قسم کی مزید دو اقسام ہیں: شیطانی انسان (شيطاني إنسي) اور شیطانی جن (شيطاني جني)۔ اللہ عزوجل فرماتا ہے:\n**شَياطِينَ الْإِنْسِ والْجِنِّ يُوحِي بَعْضُهُمْ إِلى‏ بَعْضٍ زُخْرُفَ الْقَوْلِ غُرُوراً ولَوْ شاءَ رَبُّكَ ما فَعَلُوهُ فَذَرْهُمْ وما يَفْتَرُونَ**\n(انسانوں اور جنوں کے شیطان، جن میں سے بعض دوسروں کو دھوکے کے لیے خوشنما باتیں سجھاتے ہیں، اور اگر تمہارا رب چاہتا تو وہ ایسا نہ کرتے، لہٰذا انہیں اور ان کے بہتان کو چھوڑ دو۔)\nپس اللہ نے انہیں اللہ پر بہتان باندھنے والا گروہ قرار دیا۔ اور ان دونوں (جن و انس) کے درمیان انسان میں ایک معنوی شیطان پیدا ہوتا ہے۔ وہ اس طرح کہ جب جن یا انسان کا کوئی شیطان کسی انسان کے دل میں کوئی ایسا معاملہ ڈالتا ہے جو اسے اللہ سے دور کر دے، تو کبھی وہ کوئی خاص معاملہ ڈالتا ہے جو کسی مخصوص مسئلے سے متعلق ہوتا ہے، اور کبھی وہ کوئی عام معاملہ ڈال کر اسے چھوڑ دیتا ہے۔ اگر وہ معاملہ عام ہو، تو وہ اس کے لیے ایسے امور کی طرف راستہ کھول دیتا ہے جنہیں نہ جن سمجھ پاتا ہے اور نہ انسان۔ اس میں نفس گہرائی میں جاتا ہے (تتفقه فيه النفس) اور ان شبہات سے ایسے امور اخذ کرتا ہے کہ جب وہ ان کے بارے میں بات کرتا ہے تو ابلیس بھی گمراہی کا علم سیکھتا ہے۔ پس وہ پہلو جو اس عام اسلوب میں اس کے لیے کھلتے ہیں جو اسے پہلے شیطانی انسان یا شیطانی جن نے ڈالا تھا، انہیں معنوی شیطان کہا جاتا ہے، کیونکہ شیطانی انسان اور جن میں سے ہر ایک اس سے ناواقف ہوتا ہے اور انہوں نے اس کا خاص طور پر ارادہ نہیں کیا ہوتا۔ بلکہ ان کا پہلا مقصد صرف اس دروازے کو کھولنا ہوتا ہے، کیونکہ وہ جانتے تھے کہ اس کی قوت اور ذہانت میں یہ صلاحیت ہے کہ وہ اس میں گہرائی سے غور کرے گا، تو اس کے لیے ہلاک کر دینے والے ایسے معانی پیدا ہوں گے جنہیں وہ بعد میں رد نہیں کر سکے گا۔ اور اس کی وجہ وہ پہلا اصل (بنیاد) ہے، کیونکہ اس نے اسے ایک صحیح بنیاد سمجھا اور اس پر بھروسہ کیا، تو اس میں گہرائی میں جانا (التفقه) اسے مسلسل چوری کرتا رہتا ہے یہاں تک کہ وہ اس اصل سے بھی باہر نکل جاتا ہے۔\n\n### [شیطان کے اہل علم کے نفوس میں داخل ہونے کے راستے]\n\n### [آل بیت کی محبت میں غلو]\n\nاہل بدعت اور اہل خواہشات کا یہی حال ہے۔ شیطانوں نے ان کے سامنے ایک صحیح بنیاد ڈالی جس میں انہیں کوئی شک نہیں تھا، پھر فہم کی کمی کی وجہ سے ان پر فریب (تلبيسات) طاری ہوئے یہاں تک کہ وہ گمراہ ہو گئے۔ پس اس گمراہی کو اصل (بنیاد) کے حکم کی وجہ سے شیطان کی طرف منسوب کیا جاتا ہے، حالانکہ اگر وہ جانتے تو ان مسائل میں شیطان ان کا شاگرد ہوتا جو ان سے سیکھتا۔ اور یہ سب سے زیادہ شیعہ میں ظاہر ہوا، خاص طور پر ان میں سے امامیہ فرقے میں۔ ان پر سب سے پہلے جنوں کے شیطان اہل بیت کی محبت کے ذریعے داخل ہوئے اور ان کی محبت کو حد سے زیادہ بھر دیا۔ انہوں نے دیکھا کہ یہ اللہ کے قریب ہونے کا بہترین ذریعہ ہے، اور یہ ایسا ہی ہے اگر وہ وہیں رک جاتے اور اس سے آگے نہ بڑھتے۔ لیکن انہوں نے اہل بیت کی محبت سے دو راستے اختیار کیے: ان میں سے بعض صحابہ سے بغض اور انہیں برا بھلا کہنے کی طرف بڑھ گئے، کیونکہ انہوں نے اہل بیت کو آگے نہیں بڑھایا، اور انہوں نے یہ خیال کیا کہ اہل بیت ان دنیاوی مناصب کے زیادہ حقدار تھے۔ پس ان سے وہ کچھ ہوا جو معروف اور مشہور ہے۔ اور ایک گروہ نے صحابہ کو برا بھلا کہنے کے ساتھ ساتھ رسول اللہ صلی اللہ علیہ وسلم، جبرائیل علیہ السلام، اور اللہ جل جلالہ پر بھی طعن کیا، کیونکہ انہوں نے ان کے مرتبے اور لوگوں پر خلافت میں ان کی تقدیم کی صراحت نہیں کی۔ یہاں تک کہ ان میں سے بعض نے یہ شعر پڑھا:\n\n**ما كان من بعث الأمين أمينا**\n(امین کو بھیجنے میں امین (جبرائیل) نے امانت کا حق ادا نہیں کیا)\n\nیہ سب ایک صحیح بنیاد سے واقع ہوا، یعنی اہل بیت کی محبت، جس نے ان کی نظر میں ایک فاسد نتیجہ پیدا کیا، تو وہ خود بھی گمراہ ہوئے اور دوسروں کو بھی گمراہ کیا۔ پس دیکھو کہ دین میں غلو (حد سے تجاوز) کس چیز تک لے گیا، اس نے انہیں حد سے باہر نکال دیا، تو ان کا معاملہ الٹ کر ضد کی طرف چلا گیا۔ اللہ تعالیٰ فرماتا ہے:\n**يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ غَيْرَ الْحَقِّ وَلَا تَتَّبِعُوا أَهْوَاءَ قَوْمٍ قَدْ ضَلُّوا مِنْ قَبْلُ وَأَضَلُّوا كَثِيرًا وَضَلُّوا عَنْ سَوَاءِ السَّبِيلِ**\n(اے اہلِ کتاب! اپنے دین میں ناحق غلو نہ کرو، اور نہ ان لوگوں کی خواہشات کی پیروی کرو جو پہلے گمراہ ہو چکے اور بہت سے لوگوں کو گمراہ کر چکے اور سیدھے راستے سے بھٹک گئے۔)\n\n### [حدیث گھڑنا]\n\nاور ایک گروہ ایسا ہے جس کے سامنے شیطانوں نے ایک صحیح بنیاد ڈالی جس میں انہیں کوئی شک نہیں تھا:\nکہ نبی صلی اللہ علیہ وسلم نے فرمایا:\n**من سن سنة حسنة فله أجرها وأجر من عمل بها**\n(جس نے کوئی اچھا طریقہ جاری کیا تو اسے اس کا اجر ملے گا اور ان لوگوں کا اجر بھی جو اس پر عمل کریں گے۔)\nپھر شیطانوں نے انہیں چھوڑ دیا جب انہوں نے اس پر عمل کرنے کی محبت ان کے دلوں میں ڈال دی۔ پس بعض لوگ نیکی کی حرص کی وجہ سے گہرائی میں جاتے ہیں (يتفقه) کیونکہ وہ ان لوگوں کا اجر حاصل کرنا چاہتے ہیں جو اس پر عمل کریں۔ جب وہ کوئی اچھا طریقہ جاری کرتے ہیں، تو انہیں خوف ہوتا ہے کہ اگر وہ اسے اپنی طرف منسوب کریں گے تو وہ قبول نہیں کیا جائے گا، لہٰذا اس کی قبولیت کی خاطر وہ رسول اللہ صلی اللہ علیہ وسلم کی طرف ایک حدیث گھڑ دیتے ہیں، اور وہ یہ تاویل کرتے ہیں کہ یہ ان کے اس فرمان کے حکم میں داخل ہے: \"جس نے کوئی اچھا طریقہ جاری کیا\"۔ پس انہوں نے رسول اللہ صلی اللہ علیہ وسلم پر جھوٹ بولنے کو جائز قرار دیا، اور یہ کہ وہ صلی اللہ علیہ وسلم کی طرف وہ بات منسوب کریں جو آپ نے نہیں کہی اور نہ آپ کی زبان مبارک سے نکلی۔ اور وہ سمجھتے ہیں کہ یہ خیر ہے، کیونکہ اصول ان کی تائید کرتے ہیں۔ جب فرشتہ انہیں یہ خاطر ڈالتا ہے:\nآپ صلی اللہ علیہ وسلم کا فرمان:\n**من كذب علي متعمدا فليتبوأ مقعده من النار**\n(جس نے جان بوجھ کر مجھ پر جھوٹ بولا، وہ اپنا ٹھکانہ جہنم میں بنا لے۔)\nاور انہیں یہ خاطر بھی ڈالتا ہے:\nآپ صلی اللہ علیہ وسلم کا فرمان:\n**ليس كذب علي ككذب على أحد من كذب علي متعمدا فليتبوأ مقعده من النار**\n(مجھ پر جھوٹ بولنا کسی اور پر جھوٹ بولنے جیسا نہیں ہے۔ جس نے جان بوجھ کر مجھ پر جھوٹ بولا، وہ اپنا ٹھکانہ جہنم میں بنا لے۔)\nتو وہ شیطان کے دل میں ڈالے ہوئے خاطر کے ذریعے ان سب کی تاویل کرتا ہے، اور اسے کہتا ہے: یہ تو اس وقت ہے جب کوئی گمراہی کی طرف بلائے، اور میں نے تو صرف خیر جاری کیا ہے۔ پس وہ اچھا طریقہ جاری کرنے کی وجہ سے یقیناً ماجور ہے، اور رسول اللہ صلی اللہ علیہ وسلم پر جھوٹ بولنے اور آپ کی طرف وہ بات منسوب کرنے کی وجہ سے مازور ہے جو آپ صلی اللہ علیہ وسلم نے نہیں کہی۔\n\n### [خلوت اور ریاضت والوں کا جلد بازی میں ریاست طلب کرنا]\n\nاسی طرح اگر وہ خلوت اور ریاضت کرنے والوں میں سے ہو اور اللہ کی بندگی کے دروازوں میں سے کوئی دروازہ کھلنے سے پہلے ہی ریاست (سرداری) کی جلدی کرے، تو وہ سچائی کے راستے پر قائم رہے گا اور پہلے شخص کی طرح رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نہیں رکے گا، بلکہ وہ اللہ پر بہتان باندھنے کی طرف بڑھ جائے گا، اور اس طریقے کو جو اس نے جاری کیا ہے، اللہ تعالیٰ کی طرف منسوب کرے گا، اور یہ تاویل کرے گا کہ اللہ کے سوا کوئی فاعل نہیں ہے، اور یہ کہ وہی اپنے بندوں کو گویائی عطا کرتا ہے۔ اور وہ اسی وقت سے مجبور شاعر بن جائے گا اور کہے گا کہ یہ سب خیر ہے، کیونکہ میرا مقصد صرف اس اچھے طریقے کی تائید کرنا تھا، اور میں نے اس کی تقویت کے لیے اس سے زیادہ مؤثر کوئی چیز نہیں دیکھی کہ میں اسے اللہ تعالیٰ کی طرف منسوب کر دوں، جیسا کہ وہ حقیقت میں ہے۔ یہ سب وہ اپنے دل میں کہتا ہے، کسی سے نہیں کہتا۔ لیکن جب وہ لوگوں کے ساتھ ہوتا ہے، تو انہیں دکھاتا ہے کہ یہ اس کے پاس اللہ کی طرف سے آیا ہے، جیسا کہ اولیاء اللہ کے پاس اس طریقے سے آتا ہے۔ جب فرشتہ اسے اللہ تعالیٰ کا یہ قول خاطر ڈالتا ہے:\n**وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَى عَلَى اللَّهِ كَذِبًا أَوْ قَالَ أُوحِيَ إِلَيَّ وَلَمْ يُوحَ إِلَيْهِ شَيْءٌ وَمَنْ قَالَ سَأُنْزِلُ مِثْلَ مَا أَنْزَلَ اللَّهُ**\n(اور اس شخص سے بڑا ظالم کون ہو گا جو اللہ پر جھوٹ باندھے یا کہے کہ مجھ پر وحی کی گئی ہے حالانکہ اس پر کوئی چیز وحی نہیں کی گئی، اور جو کہے کہ میں بھی ویسی ہی چیز نازل کروں گا جیسی اللہ نے نازل کی ہے۔)\nتو وہ اپنے دل میں اس کی تاویل کرتا ہے اور کہتا ہے: میں اس آیت کا مخاطب نہیں ہوں، بلکہ اس کے مخاطب وہ دعویدار ہیں جو فعل کو اپنی طرف منسوب کرتے ہیں۔ کیونکہ اللہ نے فرمایا: **افترى** (اس نے بہتان باندھا)، تو اس نے بہتان باندھنے کے فعل کو اس کہنے والے کی طرف منسوب کیا۔ اور میں تو کہتا ہوں کہ تمام افعال اللہ تعالیٰ کے لیے ہیں، میرے لیے نہیں، وہی ہے جس نے میری زبان پر یہ بات کہی۔\nکیا تم نہیں دیکھتے کہ نبی صلی اللہ علیہ وسلم نے نماز میں فرمایا کہ اللہ نے اپنے بندے کی زبان پر کہا: **سمع الله لمن حمده** (اللہ نے سن لیا جس نے اس کی تعریف کی)۔\nتو یہ بھی اسی طرح ہے۔ پھر اللہ نے فرمایا: **أَوْ قَالَ أُوحِيَ إِلَيَّ** (یا اس نے کہا کہ میری طرف وحی کی گئی)، تو اس نے قول کو اس کی طرف منسوب کیا۔ اور اسی طرح اس کا قول **إِلَيَّ** (میری طرف)۔ اور میں کون ہوں کہ کہوں **إِلَيَّ**، جبکہ اللہ ہی متکلم ہے اور وہی سمیع ہے۔ پھر فرمایا: **سَأُنْزِلُ مِثْلَ مَا أَنْزَلَ اللَّهُ** (میں بھی ویسی ہی چیز نازل کروں گا جیسی اللہ نے نازل کی)، اور میں یہ نہیں کہتا، بلکہ سارا نزول اللہ کی طرف سے ہے۔ پس جب وہ اپنے نفس میں ان سب کی گہرائی میں جاتا ہے، تو وہ **افْتَرَى عَلَى اللَّهِ كَذِبًا** (اللہ پر جھوٹ باندھتا ہے) اور **زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَنًا** (اس کے لیے اس کا برا عمل مزین کر دیا جاتا ہے، تو وہ اسے اچھا سمجھتا ہے)۔\n\n### [شیطان انسان کے پاس صرف وہی لے کر آتا ہے جو اس پر غالب ہو]\n\nپس یہ ان دونوں گروہوں کے لیے ایک صحیح بنیاد ہے جو شیطان نے ان کے سامنے ڈالی اور ان کے پاس چھوڑ دی، اور وہ اس میں نفسانی فقہ (گہرائی میں جانا) کرتا رہا۔ اگر انسان اپنے خطرات کے بارے میں بصیرت اور تمیز نہ رکھتا ہو، یہاں تک کہ وہ شیطان کے القاء کو، اگرچہ وہ خیر ہی ہو، اور فرشتہ اور نفس کے القاء کو صحیح طور پر پہچان کر ان میں فرق نہ کر سکے، تو وہ کبھی کامیاب نہیں ہو سکتا۔ کیونکہ شیطان ہر گروہ کے پاس صرف وہی لے کر آتا ہے جو اس پر غالب ہوتا ہے۔ اور صالحین سے اس کا مقصد صرف یہ ہے کہ وہ اس سے لینے میں ناواقف رہیں۔ جب وہ ناواقف رہتے ہیں اور اسے اللہ کی طرف منسوب کرتے ہیں اور یہ نہیں جانتے کہ یہ ان تک کس راستے سے پہنچا، تو گویا وہ ان کی اس قدر جہالت پر قناعت کر لیتا ہے اور جان لیتا ہے کہ وہ اس کے تسلط میں ہیں۔ پس وہ اسے اس کی نیکی میں مسلسل بہکاتا رہتا ہے یہاں تک کہ وہ اس کے خطرات کو اللہ کی طرف سے سمجھنے میں اس پر قابو پا لیتا ہے، تو اسے اس کے دین سے اس طرح نکال دیتا ہے جیسے سانپ اپنی کھال سے نکل جاتا ہے۔ کیا تم نہیں دیکھتے کہ سانپ کی اتری ہوئی کھال بھی سانپ کی شکل پر ہوتی ہے؟ یہ معاملہ بھی اسی طرح ہے۔\n\n### [علم اور ایمان، لیکن سعادت ایمان میں ہے]\n\nابلیس حضرت عیسیٰ علیہ السلام کے پاس ایک بوڑھے شخص کی صورت میں آیا، ظاہری حس میں، کیونکہ شیطان کو انبیاء علیہم السلام کے باطن تک کوئی راستہ نہیں ملتا۔ پس انبیاء علیہم السلام کے تمام خطرات یا تو ربانی ہوتے ہیں یا ملکی یا نفسانی، شیطان کا ان کے دلوں میں کوئی حصہ نہیں ہوتا۔ اور جو اولیاء اللہ کے علم میں محفوظ ہوتے ہیں، وہ اس مرتبے پر ہوتے ہیں کہ جو کچھ ڈالا جاتا ہے اس سے معصوم ہوتے ہیں، نہ کہ اس کے ان تک پہنچنے سے۔ پس وہ ولی جس پر اللہ کی طرف سے توجہ ہوتی ہے، اس کے لیے ایک علامت ہوتی ہے جو شیطان اس پر ڈالتا ہے۔ اور اس کی وجہ یہ ہے کہ وہ شریعت لانے والا نہیں ہے، جبکہ انبیاء شریعت لانے والے ہیں، اسی لیے ان کے باطن معصوم رکھے گئے۔\n\nابلیس نے عیسیٰ علیہ السلام سے کہا: اے عیسیٰ! کہو **لا إله إلا الله** (اللہ کے سوا کوئی معبود نہیں)۔ اور وہ اس بات پر راضی ہو گیا کہ وہ اس کے حکم کی اطاعت صرف اس قدر میں کر لیں۔ عیسیٰ علیہ السلام نے فرمایا: میں اسے کہتا ہوں، لیکن تمہارے کہنے پر نہیں کہتا۔ پس وہ ذلیل ہو کر واپس چلا گیا۔\n\nاور یہاں سے تم علم اور ایمان کے درمیان فرق جان سکتے ہو، اور یہ کہ سعادت ایمان میں ہے۔ اور وہ یہ ہے کہ تم وہ کہو جو تم جانتے ہو، اور جو تم نے کہا ہے وہ اپنے پہلے رسول (موسیٰ علیہ السلام) کے قول کی وجہ سے نہیں، اور نہ ہی اس دوسرے رسول (محمد صلی اللہ علیہ وسلم) کے قول کی وجہ سے، بلکہ تمہارے علم کی وجہ سے بھی نہیں اور نہ ہی پہلے قول کی وجہ سے۔ تب ہی تمہارے لیے ایمان کی گواہی دی جائے گی اور تمہیں سعادت حاصل ہو گی۔ اور اگر تم اسے اس کے قول کی وجہ سے نہ کہو اور یہ ظاہر کرو کہ تم نے اسے اس کے قول کی وجہ سے کہا ہے، تو تم منافق ہو گے۔ اللہ تعالیٰ فرماتا ہے: **يَا أَيُّهَا الَّذِينَ آمَنُوا** (اے ایمان والو!)، اس سے مراد اہل کتاب ہیں، جب انہوں نے وہ بات کہی جو انہوں نے اپنے نبی عیسیٰ یا موسیٰ یا متقدمہ کتب کے ذریعے ایمان لانے والوں کے حکم پر کہی تھی۔ اسی لیے اللہ نے ان سے فرمایا: **يَا أَيُّهَا الَّذِينَ آمَنُوا** (اے ایمان والو!)، پھر ان سے فرمایا: میرے نبیوں پر ایمان لاؤ، کہو **لا إله إلا الله** (اللہ کے سوا کوئی معبود نہیں) محمد صلی اللہ علیہ وسلم کے قول کی وجہ سے، نہ کہ تمہارے اس علم کی وجہ سے اور نہ ہی تمہارے پہلے نبی پر ایمان کی وجہ سے، تاکہ تم دونوں ایمانوں کو جمع کر لو اور تمہیں دوہرا اجر ملے۔\n\n### [جو اللہ کی طرف سے ہے اور جو فرشتہ، نفس اور شیطان کے راستے سے ہے، ان میں فرق]\n\nشیطان انسان سے اس قدر پر قناعت کر لیتا ہے کہ وہ اس پر التباس ڈال دے، تو وہ اس میں فرق نہیں کر پاتا کہ کون سی چیز اللہ کی طرف سے ہے، اور کون سی فرشتہ، نفس اور شیطان کے راستے سے ہے۔ پس اللہ تمہارے لیے ایک علامت مقرر کرتا ہے جس سے تم اپنے خطرات کے مراتب کو پہچان سکو۔ اور جن چیزوں سے تم شیطانی خطرات کو پہچان سکتے ہو، اگرچہ وہ اطاعت میں ہی ہوں، وہ یہ ہے کہ ایک ہی امر پر ثابت قدمی نہ ہو اور ایک خاطر سے دوسرے خاطر کی طرف تیزی سے بدل جانا۔ کیونکہ وہ حریص ہے اور آگ کے شعلے سے پیدا کیا گیا ہے، اور آگ کا شعلہ تیز حرکت والا ہوتا ہے۔ پس ابلیس کی اصل اس کی پیدائش کی بنیاد میں ایک حالت پر باقی نہ رہنا ہے۔ وہ اپنی اصل کے حکم میں ہے۔ اور انسان میں ثبات ہے، کیونکہ وہ مٹی سے ہے، تو اس میں ٹھنڈک اور خشکی ہے، لہٰذا وہ اپنے کام میں ثابت قدم رہتا ہے۔ اسی طرح نفسانی خطرات بھی ثابت رہتے ہیں جب تک کہ انہیں فرشتہ یا شیطان متزلزل نہ کرے۔ اور شیطانی خطرات کی اصل کا تعلق صرف محظور (حرام) سے ہوتا ہے، خواہ وہ فعل ہو یا ترک۔ پھر اس کے بعد مکروہ (ناپسندیدہ) سے، خواہ وہ فعل ہو یا ترک۔ پہلا عام لوگوں میں ہوتا ہے اور دوسرا عام لوگوں میں سے عبادت گزاروں میں۔ اور یہ اللہ کے راستے کے مبتدی کے حق میں مباح سے بھی متعلق ہو سکتا ہے، اور اہل اللہ میں سے متوسطین، یعنی سماع (سننے) والوں کے حق میں مستحب (مندوب) کے ساتھ بھی آ سکتا ہے۔ کیونکہ وہ ہر گروہ کو اس چیز کے ذریعے بہکاتا ہے جو ان پر غالب ہوتی ہے، کیونکہ وہ مکر اور تدریج کے مواقع کو جانتا ہے۔ اور وہ عارفین کے پاس واجبات کے ذریعے آتا ہے، اور ان کے ساتھ لگا رہتا ہے یہاں تک کہ وہ اللہ کے ساتھ کسی طاعت کے فعل کی نیت کر لیتے ہیں، اور یہ حقیقت میں ایک عہد ہوتا ہے جو وہ اللہ سے کرتے ہیں۔ جب وہ اس میں ان سے پختہ عہد لے لیتا ہے اور وہ عزم کر لیتے ہیں اور صرف فعل باقی رہ جاتا ہے، تو وہ ان کے لیے شرعاً اس سے بہتر کوئی دوسری عبادت کھڑی کر دیتا ہے۔ تو عارف یہ دیکھتا ہے کہ وہ اپنا وقت بہتر چیز میں صرف کرے، تو وہ پہلی کو چھوڑ دیتا ہے اور دوسری میں مشغول ہو جاتا ہے۔ پس ابلیس خوش ہوتا ہے کہ اس نے اسے پختہ عہد کے بعد اللہ کا عہد توڑنے پر مجبور کر دیا۔ اور عارف کو اس کی خبر نہیں ہوتی۔ اگر وہ شروع سے جان لیتا کہ یہ شیطان کی طرف سے ہے، تو وہ جان لیتا کہ اسے کیسے رد کرنا ہے اور کیسے قبول کرنا ہے، جیسا کہ عیسیٰ علیہ السلام نے کیا۔ اور ہر وہ شخص جو اہل اللہ میں سے انبیاء کے ورثاء میں سے ہے، وہ اسے شیطانی خاطر سمجھتا ہے، اگرچہ وہ اچھی ہی ہو۔ اور اسی طرح اہل کتاب کے منافق کے پاس آیا، اور اس سے کہا: کیا تم نہیں جانتے کہ تمہارے نبی نے اس شخص (محمد صلی اللہ علیہ وسلم) کی بشارت دی تھی؟ اور تم جانتے ہو کہ وہ وہی ہیں، اور نبوت ان دونوں کو جمع کرتی ہے، تو تم ان سے کہو کہ آپ اللہ کے رسول ہیں، اپنے نبی کے قول کی وجہ سے، نہ کہ ان کے قول کی وجہ سے، اور ان دونوں میں کوئی فرق نہیں ہے۔ تو منافق اس وقت کہتا ہے کہ آپ اللہ کے رسول ہیں۔ پس اللہ نے انہیں جھٹلایا اور فرمایا:\n**إِذَا جَاءَكَ الْمُنَافِقُونَ قَالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ اللَّهِ**\n(جب منافق تمہارے پاس آتے ہیں تو کہتے ہیں کہ ہم گواہی دیتے ہیں کہ آپ یقیناً اللہ کے رسول ہیں) اس پر جو شیطان نے انہیں سکھایا تھا۔ تو اللہ نے فرمایا:\n**وَاللَّهُ يَعْلَمُ إِنَّكَ لَرَسُولُهُ وَاللَّهُ يَشْهَدُ إِنَّ الْمُنَافِقِينَ لَكَاذِبُونَ**\n(اور اللہ جانتا ہے کہ آپ یقیناً اس کے رسول ہیں، اور اللہ گواہی دیتا ہے کہ منافق جھوٹے ہیں) اس بات میں کہ انہوں نے یہ آپ کے قول کی وجہ سے کہا، نہ کہ ان کے اس قول میں کہ آپ اللہ کے رسول ہیں۔ اگر اللہ کا ارادہ یہ ہوتا تو یہ آپ صلی اللہ علیہ وسلم کی رسالت کی نفی ہوتی۔\n\n### [وہ میزان جس سے شیطانی خاطر کو دوسرے سے پہچانا جاتا ہے]\n\nمیں نے تمہیں عالم کے نفوس میں شیطان کے داخل ہونے کے راستے بتا دیے ہیں تاکہ تم اس سے بچو اور اللہ سے سوال کرو کہ وہ تمہیں کوئی علامت عطا کرے جس سے تم اسے پہچان سکو۔ اور اللہ نے عام لوگوں میں تمہیں شریعت کا میزان عطا کیا ہے، اور تمہارے لیے اس کے فرائض، مستحبات (مندوبات)، مباحات، محظورات (حرام) اور مکروہات میں فرق واضح کر دیا ہے، اور اس کی صراحت اپنی کتاب میں اور اپنے رسول کی زبان پر کر دی ہے۔ پس جب تمہارے دل میں محظور یا مکروہ کا خاطر آئے، تو بلا شک جان لو کہ یہ شیطان کی طرف سے ہے۔ اور جب تمہارے دل میں مباح کا خاطر آئے، تو بلا شک جان لو کہ یہ نفس کی طرف سے ہے۔ پس شیطان کے محظور اور مکروہ خاطر سے بچو، خواہ وہ فعل ہو یا ترک۔ اور مباح میں تمہیں اختیار ہے۔ اگر تم پر نفع حاصل کرنے کا غلبہ ہو، تو مباح سے بچو اور واجب یا مستحب میں مشغول ہو جاؤ۔ البتہ، جب تم مباح میں تصرف کرو، تو اس میں اس حضور کے ساتھ تصرف کرو کہ یہ مباح ہے اور اگر شارع (شریعت لانے والے) نے اسے تمہارے لیے مباح نہ کیا ہوتا تو تم اس میں تصرف نہ کرتے۔ پس تمہیں اپنے مباح میں اجر ملے گا، نہ اس حیثیت سے کہ وہ مباح ہے، بلکہ اس حیثیت سے کہ تم اس پر ایمان رکھتے ہو کہ یہ اللہ کی طرف سے ایک شرع ہے۔ کیونکہ رسول اللہ صلی اللہ علیہ وسلم کی وفات کے بعد حکم منتقل نہیں ہوتا، کیونکہ حکم ہی عین شرع ہے۔ اور وہ دروازہ بند ہو چکا ہے۔ پس مباح مباح ہی رہے گا، وہ کبھی واجب یا محظور نہیں ہو سکتا۔ اور اسی طرح ہر ایک حکم ہے۔ اور اگر تمہارے دل میں فرض کا خاطر آئے، تو بلا شک اس کی طرف اٹھ کھڑے ہو، کیونکہ یہ فرشتہ کی طرف سے ہے۔ اور جب تمہارے دل میں مستحب (مندوب) کا خاطر آئے، تو پہلے خاطر کو محفوظ رکھو، کیونکہ وہ ابلیس کی طرف سے ہو سکتا ہے۔ پس اس پر ثابت قدم رہو۔ پھر اگر تمہارے دل میں یہ خاطر آئے کہ تم اسے چھوڑ کر کسی دوسرے مستحب کی طرف جاؤ جو اس سے اعلیٰ اور بہتر ہو، تو پہلے سے انحراف نہ کرو اور اس پر ثابت قدم رہو، اور دوسرے کو محفوظ رکھو اور پہلے کو ضرور کرو۔ جب تم اس سے فارغ ہو جاؤ، تو دوسرے میں مشغول ہو جاؤ اور اسے بھی کرو۔ کیونکہ شیطان بلا شک ذلیل ہو کر واپس چلا جائے گا، جب اس کا مقصد پورا نہیں ہو گا۔ اور اسی علاج سے تمہارے نفس سے شیطان کی بیماری دور ہو جائے گی، اور تم عمر بھر اس مقام پر رہو گے کہ شیطان تمہیں کسی راستے میں نہیں ملے گا مگر وہ تمہارے راستے کے علاوہ کوئی اور راستہ اختیار کرے گا، جب تم اس کے ساتھ ایسا معاملہ کرو گے۔ پس جس چیز پر میں نے تمہیں متنبہ کیا ہے اس کی حفاظت کرو، کیونکہ اللہ نے ان لوگوں کی تعریف کی ہے جو **يُسَارِعُونَ فِي الْخَيْرَاتِ وَهُمْ لَهَا سَابِقُونَ** (نیکیوں میں جلدی کرتے ہیں اور وہ ان میں سبقت لے جانے والے ہیں)۔ اور یہ مقدار کافی ہے، اور **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "(باب پنجاه و پنجم در معرفت خواطر شیطانی)\n\nاگر خداوند ما را بفهماند\nآنچه از حکمت‌ها در آن است،\nامر را فراتر از\nمیدان فکر و همت‌ها خواهی دید.\nآنقدر دقیق است که\nجوامع کلم (سخنان جامع) آن را بر تو آشکار نمی‌سازد.\n\n### [خواطر چهارند و پنجمی ندارند]\n\nخواطر چهارند و پنجمی ندارند: خاطر ربانی، خاطر ملکی، خاطر نفسی و خاطر شیطانی. پنجمی در کار نیست. ما معرفت خواطر را در این کتاب و در برخی از کتب دیگرمان ذکر کرده‌ایم، پس در این باب به طور خاص خاطر شیطانی را ذکر می‌کنیم.\n\n### [اقسام شیاطین]\n\nبدان که شیاطین دو قسم‌اند: قسم معنوی و قسم حسی. سپس قسم حسی خود بر دو بخش است: شیطانی انسی و شیطانی جنی. خداوند عز و جل می‌فرماید: **شَياطِينَ الْإِنْسِ والْجِنِّ يُوحِي بَعْضُهُمْ إِلى‏ بَعْضٍ زُخْرُفَ الْقَوْلِ غُرُوراً ولَوْ شاءَ رَبُّكَ ما فَعَلُوهُ فَذَرْهُمْ وما يَفْتَرُونَ** (شیاطین انس و جن، که برخی از آنان سخنان آراسته و فریبنده را به برخی دیگر القا می‌کنند، و اگر پروردگار تو می‌خواست، چنین نمی‌کردند؛ پس آنان را با آنچه افترا می‌بندند، واگذار). پس خداوند آنان را اهل افترا بر خدا قرار داد. و در میان این دو (شیطان جن و انس)، در وجود انسان، شیطان معنوی پدید آمد. این بدان سبب است که وقتی شیطان جن و انس امری را در قلب انسان القا می‌کند که او را از خدا دور می‌سازد، گاهی امری خاص و مشخص را القا می‌کند و گاهی امری عام را القا کرده و او را رها می‌سازد. اگر امر عام باشد، راهی را به سوی اموری برای او می‌گشاید که نه جنی و نه انسی به آن پی نمی‌برد. نفس در آن تفقه می‌کند و از آن شبهات، اموری را استنباط می‌نماید که اگر با آن‌ها سخن بگوید، ابلیس غوایت را از او می‌آموزد. پس آن وجوهی که در آن اسلوب عام که شیطان انس یا شیطان جن در ابتدا به او القا کرده، برایش گشوده می‌شود، شیاطین معنوی نامیده می‌شوند؛ زیرا هر یک از شیاطین انس و جن نسبت به آن جاهل‌اند و آن را به طور معین قصد نکرده‌اند، بلکه قصد اولیه‌شان گشودن این باب بر روی او بوده است، زیرا می‌دانستند که در قوت و فطانت اوست که در آن دقیق شود و معانی مهلکی برایش پدید آید که پس از آن قادر به رد آن‌ها نباشد. و سبب این امر، همان اصل اول است؛ زیرا او آن را اصلی صحیح پنداشته و بر آن اعتماد کرده است، پس تفقه در آن پیوسته او را می‌رباید تا جایی که از آن اصل خارج می‌شود.\n\n### [راه‌های نفوذ شیطان در نفوس عالمان]\n\n### [غلو (افراط) در محبت اهل بیت]\n\nاهل بدعت و هواها نیز بر همین منوال عمل کرده‌اند. شیاطین اصلی صحیح را به آنان القا کردند که در آن شک نداشتند، سپس به دلیل سوء فهم، تلبیسات (فریب‌ها) بر آنان عارض شد تا گمراه گشتند. این گمراهی به حکم اصل، به شیطان نسبت داده می‌شود، در حالی که اگر می‌دانستند، شیطان در این مسائل شاگرد اوست و از او می‌آموزد. این امر بیشتر در شیعه، به ویژه در میان امامیه، ظاهر شده است. شیاطین جن ابتدا از طریق محبت اهل بیت و افراط در این محبت بر آنان وارد شدند و دیدند که این از والاترین قربات به سوی خداست. و همین‌طور هم هست، اگر در آنجا توقف می‌کردند و از آن فراتر نمی‌رفتند. اما آنان از محبت اهل بیت به دو راه تجاوز کردند: گروهی از آنان به بغض صحابه و دشنام دادن به آنان روی آوردند، زیرا آنان را مقدم نداشتند و تصور کردند که اهل بیت برای این مناصب دنیوی سزاوارترند، پس آنچه از آنان سر زد که شناخته و شایع است. و گروهی دیگر علاوه بر دشنام به صحابه، به قدح در رسول خدا (صلی الله علیه و سلم) و جبرئیل (علیه السلام) و در حق جل جلاله پرداختند، زیرا بر رتبه و تقدم آنان در خلافت برای مردم تصریح نکرده بودند، تا جایی که برخی از آنان چنین سرودند:\n\n**شعر:**\nما كان من بعث الأمين أمينا\n(فرستادن امین، امین نبود)\n\nو این همه از یک اصل صحیح، یعنی محبت اهل بیت، ناشی شد که در نظر آنان نتیجه‌ای فاسد به بار آورد، پس گمراه شدند و گمراه کردند. پس بنگر که غلو (افراط) در دین به کجا انجامید؛ آنان را از حد خارج ساخت و امرشان به ضد منعکس شد. خداوند متعال می‌فرماید: **يا أَهْلَ الْكِتابِ لا تَغْلُوا في دِينِكُمْ غَيْرَ الْحَقِّ ولا تَتَّبِعُوا أَهْواءَ قَوْمٍ قَدْ ضَلُّوا من قَبْلُ وأَضَلُّوا كَثِيراً وضَلُّوا عَنْ سَواءِ السَّبِيلِ** (ای اهل کتاب، در دین خود به ناحق غلو نکنید و از هوس‌های قومی پیروی نکنید که پیش از این گمراه شدند و بسیاری را گمراه کردند و از راه راست منحرف گشتند).\n\n### [وضع (جعل) حدیث]\n\nو گروهی دیگر، شیاطین اصلی صحیح را به آنان القا کردند که در آن شک نداشتند:\n\n**حدیث:**\nإن النبي صلى الله عليه وسلم قال: من سن سنة حسنة فله أجرها وأجر من عمل بها\n(پیامبر (صلی الله علیه و سلم) فرمود: هر کس سنت نیکویی را بنا نهد، پاداش آن و پاداش هر کس که به آن عمل کند، برای اوست.)\n\nسپس آنان را رها کردند، پس از آنکه عمل بر اساس این اصل را برایشان محبوب ساختند. برخی از مردم به دلیل حرص بر خیر، به تفقه پرداختند، زیرا می‌خواستند پاداش کسانی را که به آن عمل می‌کنند، به دست آورند. پس اگر سنت نیکویی را بنا می‌نهاد، می‌ترسید که اگر آن را به خود نسبت دهد، پذیرفته نشود. بنابراین، برای پذیرش آن، حدیثی از رسول خدا (صلی الله علیه و سلم) در آن باره جعل می‌کرد و تأویل می‌نمود که این در حکم فرموده او داخل است: «من سن سنة حسنة». پس دروغ بستن بر رسول خدا (صلی الله علیه و سلم) و گفتن آنچه را که او نگفته و زبانش به آن نچرخانده، جایز شمرد و این را خیر می‌دید، زیرا اصول از او حمایت می‌کردند. پس اگر ملک (فرشته) به او خاطر می‌انداخت:\n\n**حدیث:**\nقوله صلى الله عليه وسلم: من كذب علي متعمدا فليتبوأ مقعده من النار\n(فرموده او (صلی الله علیه و سلم): هر کس عمداً بر من دروغ بندد، جایگاه خود را در آتش آماده سازد.)\n\nو همچنین به او خاطر می‌انداخت:\n\n**حدیث:**\nقوله صلى الله عليه وسلم: ليس كذب علي ككذب على أحد من كذب علي متعمدا فليتبوأ مقعده من النار\n(فرموده او (صلی الله علیه و سلم): دروغ بستن بر من مانند دروغ بستن بر هیچ کس دیگری نیست. هر کس عمداً بر من دروغ بندد، جایگاه خود را در آتش آماده سازد.)\n\nاو همه این‌ها را با القای شیطان در خاطرش تأویل می‌کرد و به خود می‌گفت: این‌ها تنها در صورتی است که به گمراهی دعوت کند، در حالی که من جز خیری را بنا ننهاده‌ام. پس او به ضرورت، به دلیل بنا نهادن سنت حسنه مأجور است و به دلیل دروغ بستن بر رسول خدا (صلی الله علیه و سلم) و نسبت دادن آنچه او نگفته، مأزور است.\n\n### [شتاب در ریاست، برای اهل خلوت‌ها و ریاضت‌ها]\n\nهمچنین اگر کسی از اهل خلوت‌ها و ریاضت‌ها باشد و پیش از آنکه خداوند دری از درهای عبودیت خود را بر او بگشاید، در ریاست شتاب کند، راه صدق را رها می‌کند و مانند آن شخص اول، با رسول خدا (صلی الله علیه و سلم) توقف نمی‌کند، بلکه به افترا بر خدا می‌پردازد و آنچه را که بنا نهاده، به خداوند متعال نسبت می‌دهد و تأویل می‌کند که فاعلی جز خدا نیست و اوست که بندگانش را به سخن می‌آورد. و از همان لحظه، خود را شاعری مجبور می‌پندارد و می‌گوید: این همه خیر است، زیرا من قصدی جز تقویت آن سنت حسنه نداشته‌ام و برای تقویت آن، چیزی شدیدتر از این ندیدم که آن را به خداوند متعال نسبت دهم، همان‌طور که در نفس‌الامر (واقعیت) چنین است و خداوند آن را بر زبان من جاری ساخته است. او همه این‌ها را با خود می‌گوید و به کسی نمی‌گوید. اما وقتی با مردم است، به آنان نشان می‌دهد که این از جانب خدا به او رسیده است، همان‌طور که برای اولیای خدا از آن طریق می‌آید. پس اگر ملک (فرشته) به او خاطر می‌انداخت، فرموده خداوند متعال را: **ومن أَظْلَمُ مِمَّنِ افْتَرى‏ عَلَى الله كَذِباً أَوْ قالَ أُوحِيَ إِلَيَّ ولَمْ يُوحَ إِلَيْهِ شَيْ‏ءٌ ومن قالَ سَأُنْزِلُ مِثْلَ ما أَنْزَلَ الله** (و کیست ستمکارتر از آن کس که بر خدا دروغ بندد یا بگوید: به من وحی شده است، در حالی که چیزی به او وحی نشده باشد، و کسی که بگوید: من نیز مانند آنچه خدا نازل کرده، نازل خواهم کرد؟)، او این را با خود تأویل می‌کند و می‌گوید: من مخاطب این آیه نیستم، بلکه مخاطب آن، اهل ادعاهایی هستند که فعل را به خود نسبت می‌دهند؛ زیرا خداوند فرمود: **افترى** (افترا بست)، و فعل افترا را به این گوینده نسبت داد، در حالی که من می‌گویم همه افعال از آن خداست، نه از آن من. اوست که بر زبان من سخن گفته است.\n\nآیا نمی‌بینی که پیامبر (صلی الله علیه و سلم) در نماز فرمود: «خداوند بر زبان بنده‌اش گفت: **سمع الله لمن حمده** (خداوند سخن کسی را که او را ستایش کند، شنید)»؟\n\nپس این نیز همان‌گونه است. سپس می‌گوید: **أَوْ قالَ أُوحِيَ إِلَيَّ** (یا گفت: به من وحی شده است)، و این قول را به او نسبت داد. و همچنین فرموده او: **إِلَيَّ** (به من). من کیستم که بگویم به من؟ زیرا خداست که متکلم و شنواست. سپس فرمود: **سَأُنْزِلُ مِثْلَ ما أَنْزَلَ الله** (من نیز مانند آنچه خدا نازل کرده، نازل خواهم کرد). و من چنین نمی‌گویم، بلکه همه انزال‌ها از جانب خداست. پس وقتی در نفس خود در این همه تفقه می‌کند، **افْتَرى‏ عَلَى الله كَذِباً وزُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَناً** (بر خدا دروغ بسته و عمل بدش برای او آراسته شده و آن را نیکو می‌بیند).\n\n### [شیطان جز با آنچه بر انسان غالب است، به سوی او نمی‌آید]\n\nپس این اصلی صحیح است که شیطان آن را به این دو گروه القا کرده و نزد آنان رها ساخته است، و سپس آنان به تفقه نفسی در آن پرداختند. اگر انسان بر بصیرت و تمییز (تشخیص) خواطر خود نباشد تا میان القای شیطان، هرچند خیر باشد، و میان القای ملک و نفس، تمییز صحیحی قائل شود، هرگز رستگار نخواهد شد. زیرا شیطان جز با آنچه بر هر گروه غالب است، به سوی آنان نمی‌آید. و هدف او از صالحان جز این نیست که در اخذ از او جاهل باشند. پس اگر جاهل باشند و آن را به خدا نسبت دهند و ندانند از چه طریقی به آنان رسیده است، گویی به همین مقدار جهل از آنان قانع می‌شود و می‌داند که آنان تحت سلطه او هستند. پس پیوسته او را در خیرخواهی‌اش استدراج (فریب تدریجی) می‌کند تا در تصدیق خواطرش که از جانب خداست، بر او مسلط شود و او را از دینش بیرون کشد، همان‌طور که مار از پوست خود بیرون می‌آید. آیا نمی‌بینی که صورت پوست کنده شده شبیه مار است؟ این امر نیز چنین است.\n\n### [علم و ایمان، اما سعادت در ایمان است]\n\nابلیس در ظاهر حسی به صورت پیرمردی نزد عیسی (علیه السلام) آمد، زیرا شیطان به باطن انبیا (علیهم السلام) راهی ندارد. خواطر انبیا (علیهم السلام) همگی یا ربانی یا ملکی یا نفسی هستند و شیطان در قلب آنان بهره‌ای ندارد. و هر ولی‌ای که در علم خدا محفوظ باشد، در این عصمت (حفظ) از آنچه القا می‌شود، در این مرتبه است، نه در عصمت از رسیدن آن به او. ولی‌ای که مورد عنایت است، علامتی از جانب خدا دارد در مورد آنچه شیطان به او القا می‌کند. و سبب این امر آن است که او شارع (قانون‌گذار) نیست، در حالی که انبیا شارع هستند، به همین دلیل بواطن آنان معصوم شده است.\n\nابلیس به عیسی (علیه السلام) گفت: ای عیسی، بگو: لا إله إلا الله (هیچ معبودی جز خدا نیست). و ابلیس به همین مقدار که او امرش را اطاعت کند، راضی بود. عیسی (علیه السلام) فرمود: آن را می‌گویم، اما نه به خاطر سخن تو. پس ابلیس با خواری بازگشت.\n\nاز اینجا تفاوت میان علم به چیزی و ایمان به آن را می‌آموزی، و اینکه سعادت در ایمان است. و آن این است که آنچه را می‌دانی، بگویی، و آنچه را گفتی، به خاطر سخن رسول اولت که موسی (علیه السلام) است، یا به خاطر سخن این رسول دومت که محمد (صلی الله علیه و سلم) است، بگویی، نه به خاطر علم خودت و نه به خاطر قول اول. در این صورت است که برای تو به ایمان شهادت داده می‌شود و سعادت از آن توست. و اگر آن را بگویی، اما نه به خاطر قول او، و وانمود کنی که به خاطر قول او گفته‌ای، منافق خواهی بود. خداوند متعال می‌فرماید: **يا أَيُّهَا الَّذِينَ آمَنُوا** (ای کسانی که ایمان آورده‌اید)، منظورش اهل کتاب است، زیرا آنان آنچه را گفتند، به امر پیامبرشان عیسی یا موسی یا هر کس از اهل ایمان به آن از کتب پیشین بود. به همین دلیل به آنان فرمود: **يا أَيُّهَا الَّذِينَ آمَنُوا**، سپس به آنان فرمود: به پیامبران من ایمان بیاورید، بگویید: لا إله إلا الله، به خاطر سخن محمد (صلی الله علیه و سلم)، نه به خاطر علم خودتان به آن و نه به خاطر ایمان به پیامبر اولتان. پس دو ایمان را جمع کنید تا دو پاداش داشته باشید.\n\n### [تفاوت میان آنچه از جانب خداست و راه ملک و نفس و شیطان]\n\nشیطان به همین مقدار قانع می‌شود که بر انسان تلبیس کند و او را فریب دهد تا میان آنچه از جانب خداست، از حیث اینکه از جانب خداست، و میان راه ملک و نفس و شیطان، تفاوتی قائل نشود. پس خداوند برای تو علامتی قرار می‌دهد که با آن مراتب خواطرت را بشناسی. و از جمله چیزهایی که با آن خواطر شیطانی را می‌شناسی، حتی اگر در طاعت باشد، عدم ثبات بر یک امر واحد و سرعت جایگزینی از خاطری به امری دیگر است؛ زیرا او حریص است و از شعله آتش آفریده شده و شعله آتش سریع‌الحرکه است. پس اصل ابلیس، عدم بقا بر یک حالت واحد در اصل نشأت اوست، و او به حکم اصل خود عمل می‌کند. اما انسان ثبات دارد، زیرا از تراب (خاک) است و دارای سردی و خشکی است، پس در کار خود ثابت است. همچنین خواطر نفسی نیز ثابت‌اند، مگر اینکه ملک یا شیطان آن‌ها را متزلزل سازد. و متعلق اصلی خواطر شیطانی، محظور (حرام) است، چه فعل باشد و چه ترک. سپس مکروه در پی آن می‌آید، چه فعل باشد و چه ترک. اولی در مورد عوام است و دومی در مورد عابدان از عوام. و گاهی در حق مبتدی از اهل راه خدا به مباح تعلق می‌گیرد و در حق متوسطین از اهل الله، یعنی اصحاب سماع، به مندوب (مستحب) می‌آید. زیرا او هر گروهی را از حیث آنچه بر آنان غالب است، استدراج می‌کند، چون به مواضع مکر و استدراج آگاه است. و نزد عارفان با واجبات می‌آید و پیوسته با آنان می‌ماند تا اینکه نیت انجام امری از طاعات را با خدا می‌کنند، و این در نفس‌الامر (واقعیت) عهدی است که با خدا می‌بندند. پس وقتی از این امر مطمئن شد و عزم جزم کرد و تنها فعل باقی ماند، عبادت دیگری را که شرعاً افضل از آن است، برای او برپا می‌دارد. عارف می‌بیند که بهتر است زمان خود را با اولی بگذراند، پس اولی را ترک می‌کند و دومی را آغاز می‌کند. ابلیس شاد می‌شود، زیرا او را وادار کرده است که عهد خدا را پس از پیمان بستن بشکند، در حالی که عارف از این امر بی‌خبر است. اگر از ابتدا می‌دانست که این از شیطان است، می‌دانست چگونه آن را رد کند و چگونه آن را بپذیرد، همان‌طور که عیسی (علیه السلام) انجام داد. و هر کس از اهل الله که از ورثه انبیا باشد و متمکن باشد، آن را با وجود نیکو بودنش، خاطر شیطانی می‌بیند. همچنین برای منافق از اهل کتاب آمد و به او گفت: آیا نمی‌دانی که پیامبرت به این مرد بشارت داده است؟ و تو می‌دانی که او همان است و نبوت هر دوی شما را جمع می‌کند. پس به او بگو: تو رسول خدایی، به خاطر سخن پیامبرت، نه به خاطر سخن او. و تفاوتی میان این دو نیست. پس منافق در آن هنگام می‌گوید: تو رسول خدایی. خداوند آنان را تکذیب کرد و فرمود: **إِذا جاءَكَ الْمُنافِقُونَ قالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ الله** (هنگامی که منافقان نزد تو آیند، می‌گویند: ما شهادت می‌دهیم که تو قطعاً رسول خدایی)، بر اساس آنچه شیطان برایشان مقرر کرده بود. خداوند فرمود: **والله يَعْلَمُ إِنَّكَ لَرَسُولُهُ والله يَشْهَدُ إِنَّ الْمُنافِقِينَ لَكاذِبُونَ** (و خدا می‌داند که تو قطعاً رسول او هستی، و خدا شهادت می‌دهد که منافقان دروغگویند)، در اینکه آنان این را به خاطر سخن تو گفتند، نه در قولشان که تو رسول خدایی. و اگر منظور این بود، نفی رسالت او (صلی الله علیه و سلم) بود.\n\n### [ترازویی که با آن خاطر شیطانی از غیر آن شناخته می‌شود]\n\nمن تو را از راه‌های نفوذ شیطان به نفوس عالمان آگاه ساختم تا از او حذر کنی و از خدا بخواهی که علامتی به تو دهد تا او را بشناسی. خداوند در مورد عوام، میزان (ترازوی) شریعت را به تو داده و میان فرایض، مندوبات (مستحبات)، مباحات، محظورات (حرام‌ها) و مکروهات تمییز قائل شده و بر آن در کتاب خود و بر زبان رسولش تصریح کرده است. پس اگر خاطری در محظور یا مکروه به تو خطور کرد، بدان که بدون شک از شیطان است. و اگر خاطری در مباح به تو خطور کرد، بدان که بدون شک از نفس است.\n\nاز خاطر شیطان در محظور و مکروه، چه فعل باشد و چه ترک، اجتناب کن. و در مباح مخیری. اگر طلب أرباح (سودها) بر تو غالب شد، از مباح اجتناب کن و به واجب یا مندوب مشغول شو. با این حال، اگر در مباح تصرف کردی، با حضور قلب تصرف کن که این مباح است و اگر شارع آن را برای تو مباح نکرده بود، در آن تصرف نمی‌کردی. در این صورت، در مباح خود مأجور خواهی بود، نه از حیث اینکه مباح است، بلکه از حیث ایمانت به اینکه آن شریعتی از جانب خداست. زیرا حکم پس از وفات رسول خدا (صلی الله علیه و سلم) منتقل نمی‌شود، چرا که حکم عین شرع است و آن باب بسته شده است. مباح، مباح است و هرگز واجب یا محظور نمی‌شود. و همچنین هر یک از احکام دیگر.\n\nو اگر خاطری در فرض به تو خطور کرد، بدون شک به سوی آن برخیز، زیرا آن از ملک است. و اگر خاطری در مندوب به تو خطور کرد، ابتدای خاطر را حفظ کن، زیرا ممکن است از ابلیس باشد. پس بر آن ثابت بمان. اگر به تو خطور کرد که آن را برای مندوب دیگری که بالاتر و سزاوارتر است، ترک کنی، از اولی روی مگردان و بر آن ثابت بمان و دومی را حفظ کن و اولی را حتماً انجام بده. پس از فراغت از آن، دومی را آغاز کن و آن را نیز انجام بده. در این صورت، شیطان بدون شک با خواری باز می‌گردد، زیرا به مقصود خود نرسیده است. و با این درمان، بیماری شیطان از نفس تو می‌رود و تو عمری پایدار خواهی بود. شیطان در هیچ راهی با تو روبرو نمی‌شود، مگر اینکه راهی غیر از راه تو را در پیش می‌گیرد، اگر با او چنین رفتاری کنی. پس بر آنچه تو را بدان آگاه ساختم، محافظت کن، زیرا خداوند کسانی را ستوده است که **يُسارِعُونَ في الْخَيْراتِ وهُمْ لَها سابِقُونَ** (در کارهای خیر شتاب می‌کنند و در آن پیشتازند). و این مقدار کافی است. و **والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را می‌نمایاند)."
  },
  "page_count": 4
}