{
  "id": 549,
  "title": {
    "ar": "الباب التاسع والأربعون وخمسمائة في معرفة حال قطب كان منزله أَمَّا من اسْتَغْنى‏ فَأَنْتَ لَهُ تَصَدَّى",
    "en": "Chapter Five Hundred and Forty-Nine: Concerning the Knowledge of the State of a Pole (قطب) whose Spiritual Station (منزل) was: <<أَمَّا من اسْتَغْنى‏ فَأَنْتَ لَهُ تَصَدَّى>> (As for him who considers himself self-sufficient, to him you attend).",
    "ur": "باب پانچ سو انچاس (۵۴۹): ایک قطب (Qutb) کے حال کی معرفت (Ma'rifa) کے بیان میں، جس کا روحانی منزل (Manzil) یہ تھا: \"أَمَّا من اسْتَغْنى‏ فَأَنْتَ لَهُ تَصَدَّى\" (اور جو شخص بے پرواہی کرتا ہے، تو تم اس کی طرف متوجہ ہوتے ہو)۔",
    "fa": "باب پانصد و چهل و نهم در معرفت حال قطبی (قطب) که منزل او: «أَمَّا من اسْتَغْنى‏ فَأَنْتَ لَهُ تَصَدَّى» (اما آن کس که بی‌نیازی می‌جوید، تو به او روی می‌آوری) بود."
  },
  "content": {
    "ar": "## «الباب التاسع والأربعون وخمسمائة في معرفة حال قطب كان منزله أَمَّا من اسْتَغْنى‏ فَأَنْتَ لَهُ تَصَدَّى»\n\n\n> إذا تجلت صفات الحق في أحد *** يعظم الكشف ذاك الواحد الأحدا\n> ولو يعاتبه فيه منزهه *** فإنه يقبل العتب الذي وردا\n\n\n> فإنه عالم بما به وردا *** وعالم بالذي في عتبة قصدا\n\n\n> إن الأمور إذا انسدت مسالكها *** فليس يفتحها إلا الذي وجدا\n\n\n> لو لا الصفات التي في خلقه ظهرت *** لما عشقت بها مالا ولا ولدا\n\n\n> ولا اتخذت وجود الأهل لي سكنا *** ولا الملوك ولا الأسباب لي سندا\n\n\n> هذي المطالب قد عزت مطالبها *** وليس يعرفها إلا الذي شهدا\n\n\n### [الفرق بين ما يستحقه الكون من الصفات وبين ما تستحقه الذات من الصفات‏]\n\n\nاعلم أيدنا الله وإياك بِرُوحٍ مِنْهُ أن الله لما فرق بين ما يستحقه الكون من الصفات وبين ما تستحقه الذات من الصفات أو الجناب الإلهي عظم عند العارفين بذلك نعت الحق فحيثما رأوه مالوا إليه ابتداء لعزته كلما بدا لهم فإذا عوتب العارف في ذلك قبل العتب هنالك خاصة ولم يطرده فمتى تجلى له نعت إلهي مثل ذلك أيضا تصدى له وعظمه فإن عوتب كان حاله فيه مثل الحال الأول فإن طرد العتب في كل نعت من نفسه فليس هو صاحب ذوق وإنما هو صاحب قياس في الطريق فلا يتميز في عبيد الاختصاص أبدا فإنه إذا طرد ذلك عامل نعت الحق بما لا يجب وهنا زلت أقدام طائفة من المتشرعين ولم يكن ينبغي لهم ذلك فإن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قد نبه على ما قلناه وجعلني أن أحتج به على ما قررناه وهوقوله صَلَّى اللهُ عَليهِ وسَلَّم إذا آتاكم كريم قوم فأكرموه‏\n\n\nوقال عز وجل لا يَنْهاكُمُ الله عَنِ الَّذِينَ لَمْ يُقاتِلُوكُمْ في الدِّينِ ولَمْ يُخْرِجُوكُمْ من دِيارِكُمْ أَنْ تَبَرُّوهُمْ وتُقْسِطُوا إِلَيْهِمْ‏\n\n\n### [الفقراء إلى الله‏]\n\n\nواعلم أن الملك العزيز في قومه ما جاء إليك ولا نزل عليك إلا وقد ترك جبروته خلف ظهره أو كان جبروتك عنده أعظم من جبروته فعلى كل حال قد نزل إليك فأنزله أنت\n\n\nمنزلته من نفسه التي يسر بها تكن حكيما وما عاتب الله نبيه في الأعمى والأعبد إلا بحضور الطائفتين فبالمجموع وقع العتب وبه أقول لا مع الانفراد فتعظيم الملوك والرؤساء من تعظيم ربك وتعظيم الفقراء جبر لا غير لانكسارهم في فقرهم فإن كان الفقراء من فقراء الطريق فليس ذلك بجبر عنده فإنه لا يزول عنه فقره وانكساره بتعظيمك وقبولك وإقبالك فإن المشهود له إنما هو ربه وإنما الجبر إنما هو للفقراء من الله فالذاكر بهذا الذكر لا يزال معظما صفة الحق ظهرت على أي محل ظهرت وإن عوتب اقتصر على الشخص دون غيره فتنبه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Five Hundred and Forty-Nine: Concerning the knowledge of the state of a Pole (Qutb) whose station was: <<As for him who considers himself self-sufficient, to him you attend>>\n\nWhen the Attributes (الصفات) of the Real (الحق) are manifested (تجلى) in someone,\nThat unique, singular one magnifies the Unveiling (الكشف).\nAnd even if the one who declares His transcendence (منزهه) reproaches him concerning it,\nHe accepts the reproach that has come.\n\nFor he knows what has come to him through it,\nAnd he knows what is intended in the reproach.\n\nIndeed, when affairs have their paths blocked,\nNone opens them save the one who has found [the way].\n\nWere it not for the Attributes (الصفات) that appeared in His creation (خلقه),\nI would not have loved wealth or children through them.\n\nNor would I have taken the existence of family as a dwelling for me,\nNor kings, nor means (الأسباب) as a support for me.\n\nThese demands—their seekers are rare,\nAnd none knows them save the one who has witnessed (شهدا).\n\n***\n\n### [The Distinction between the Attributes (الصفات) deserved by the Cosmos (الكون) and the Attributes deserved by the Essence (الذات)]\n\nKnow—may Allah support us and you with a Spirit from Him—that when Allah distinguished between the Attributes (الصفات) deserved by the Cosmos (الكون) and the Attributes deserved by the Essence (الذات) or the Divine Presence (الجناب الإلهي), the description (نعت) of the Real (الحق) became magnified in the eyes of the Gnostics (العارفين) who understood this. Wherever they saw it, they inclined toward it immediately, due to its majesty, whenever it appeared to them.\n\nIf the Gnostic is then reproached concerning this, he accepts the reproach specifically at that point and does not reject it. Whenever a similar Divine description (نعت إلهي) is manifested (تجلى) to him, he attends to it and magnifies it. If he is reproached, his state concerning it is like the first state. If he rejects the reproach in every description (نعت) from his own self, then he is not a person of direct spiritual experience (ذوق), but rather a person of analogy (قياس) on the Path. Thus, he will never be distinguished among the servants of specialization (عبيد الاختصاص). For if he rejects that, he treats the description of the Real (نعت الحق) in a manner that is not proper. It is here that the feet of a group of those adhering strictly to the Law (المتشرعين) have slipped, and this ought not to have happened to them.\n\nFor the Messenger of Allah, may Allah bless him and grant him peace, has drawn attention to what we have stated, and he has allowed me to use it as evidence for what we have established, which is his saying, may Allah bless him and grant him peace: \"When the noble one (كريم) of a people comes to you, honor him.\"\n\nAnd He, the Mighty and Majestic, said: <<Allah does not forbid you from those who do not fight you because of religion and do not expel you from your homes—from being righteous toward them and acting justly toward them>> (Quran 60:8).\n\n***\n\n### [The Poor unto Allah (الفقراء إلى الله)]\n\nKnow that the mighty king (الملك العزيز) among his people did not come to you or descend upon you unless he had left his might (جبروت) behind him, or unless your might was greater than his in his view. In any case, he has descended to you, so you should place him in the station (منزلة) he holds in his own soul, which pleases him, and you will be wise.\n\nAllah only reproached His Prophet concerning the blind man and the wealthy man (الأعمى والأعبد) due to the presence of both groups. The reproach occurred because of the combination, and this is what I affirm, not when they are separate.\n\nTherefore, the magnification of kings and rulers is part of the magnification of your Lord. And the magnification of the poor (الفقراء) is merely a compensation (جبر) for their brokenness (انكسارهم) in their poverty. However, if the poor are among the poor of the Path (فقراء الطريق), then that is not a compensation in his view, for his poverty and brokenness will not be removed by your magnification, acceptance, or attention. For what he witnesses (المشهود له) is only his Lord. Compensation (الجبر) is only for those who are poor *from* Allah [i.e., those who are poor in the worldly sense].\n\nThus, the one who remembers through this remembrance (الذاكر) constantly magnifies the Attribute (صفة) of the Real (الحق), regardless of the locus upon which it appears. And if he is reproached, he restricts the blame to the person, not to the Attribute. Be aware of this. And Allah <<says the truth, and He guides to the way>> (Quran 33:4).",
    "ur": "باب نمبر پانچ سو انچاس: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"لیکن جو بے پرواہی کرتا ہے، تو آپ اس کی طرف متوجہ ہوتے ہیں\" (سورۃ عبس، ۸۰:۵-۶)\n\nجب ذات حق (الحق) کی صفات کسی میں ظہور الٰہی (التجلی) کرتی ہیں،\nتو وہ یکتا و اکیلا شخص کشف (الکشف) کو عظیم بنا دیتا ہے۔\nاور اگر اسے اس میں کوئی تنزیہہ کا قائل ملامت کرے،\nتو وہ اس ملامت کو قبول کر لیتا ہے جو اس پر وارد ہوئی۔\n\nکیونکہ وہ جانتا ہے کہ اس پر کیا وارد ہوا،\nاور وہ یہ بھی جانتا ہے کہ اس ملامت میں کیا مقصود ہے۔\n\nبے شک جب معاملات کی راہیں بند ہو جاتی ہیں،\nتو انہیں صرف وہی کھولتا ہے جو (اندر) موجود ہے۔\n\nاگر وہ صفات نہ ہوتیں جو اس کی مخلوق میں ظاہر ہوئیں،\nتو میں ان کے ذریعے نہ مال سے عشق کرتا اور نہ اولاد سے۔\n\nاور نہ میں اہل کے وجود کو اپنے لیے ٹھکانہ بناتا،\nاور نہ بادشاہوں کو اور نہ اسباب کو اپنا سہارا بناتا۔\n\nیہ وہ مطالب ہیں جن کے طلبگار کمیاب ہیں،\nاور انہیں صرف وہی جانتا ہے جس نے شہود (الشہود) کیا۔\n\n***\n\n### صفات کے اس فرق کے بیان میں جو کائنات (الکون) کے لیے مستحق ہیں اور جو ذات (الذات) کے لیے مستحق ہیں۔\n\nجان لو، اللہ ہمیں اور آپ کو اپنی طرف سے روح کے ذریعے تائید بخشے، کہ جب اللہ نے ان صفات میں فرق کیا جو کائنات (الکون) کے لیے مستحق ہیں اور ان صفات میں جو ذات (الذات) یا جناب الٰہی کے لیے مستحق ہیں، تو عارفین کے نزدیک ذات حق (الحق) کی صفت عظیم ہو گئی، چنانچہ جب بھی انہوں نے اسے دیکھا، وہ اس کی عظمت کی وجہ سے فوراً اس کی طرف مائل ہو گئے جب بھی وہ ان کے سامنے ظاہر ہوا۔ پس جب عارف کو اس بارے میں ملامت کی جاتی ہے، تو وہ خاص طور پر وہاں ملامت قبول کر لیتا ہے اور اسے رد نہیں کرتا۔ چنانچہ جب بھی اس کے لیے اسی طرح کی کوئی الٰہی صفت ظہور الٰہی (التجلی) کرتی ہے، تو وہ اس کی طرف متوجہ ہوتا ہے اور اسے عظیم جانتا ہے۔ اگر اسے ملامت کی جائے تو اس میں اس کا حال پہلے حال جیسا ہی ہوتا ہے۔ لیکن اگر وہ اپنے نفس کی ہر صفت میں ملامت کو رد کرتا ہے، تو وہ صاحب ذوق نہیں ہے، بلکہ وہ طریقت میں قیاس کرنے والا ہے، لہٰذا وہ کبھی بھی اختصاص والے بندوں میں ممتاز نہیں ہو سکتا۔ کیونکہ جب وہ اسے رد کرتا ہے، تو وہ ذات حق (الحق) کی صفت کے ساتھ ایسا معاملہ کرتا ہے جو واجب نہیں ہے۔ اور یہیں پر شریعت پر عمل کرنے والوں کی ایک جماعت کے قدم پھسل گئے، اور انہیں ایسا نہیں کرنا چاہیے تھا۔ کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے اس بات پر تنبیہ فرمائی ہے جو ہم نے کہی ہے، اور آپ صلی اللہ علیہ وسلم نے مجھے اس بات پر دلیل پیش کرنے کا موقع دیا ہے جو ہم نے طے کی ہے، اور وہ آپ صلی اللہ علیہ وسلم کا یہ فرمان ہے:\n\n**\"إذا آتاكم كريم قوم فأكرموه‏\"**\n\"جب تمہارے پاس کسی قوم کا معزز شخص آئے تو اس کی عزت کرو۔\"\n\nاور اللہ عزوجل نے فرمایا:\n\n**\"لا يَنْهاكُمُ الله عَنِ الَّذِينَ لَمْ يُقاتِلُوكُمْ في الدِّينِ ولَمْ يُخْرِجُوكُمْ من دِيارِكُمْ أَنْ تَبَرُّوهُمْ وتُقْسِطُوا إِلَيْهِمْ‏\"**\n\"اللہ تمہیں ان لوگوں سے منع نہیں کرتا جنہوں نے تم سے دین کے معاملے میں جنگ نہیں کی اور نہ تمہیں تمہارے گھروں سے نکالا کہ تم ان کے ساتھ نیکی کرو اور ان کے ساتھ انصاف کرو۔\" (سورۃ الممتحنہ، ۶۰:۸)\n\n***\n\n### اللہ کے محتاج (فقراء)\n\nاور جان لو کہ اپنی قوم کا معزز بادشاہ تمہارے پاس نہیں آیا اور نہ ہی تمہارے پاس اترا ہے مگر یہ کہ اس نے اپنا جلال (جبروت) اپنی پشت کے پیچھے چھوڑ دیا ہو، یا تمہارا جلال اس کے نزدیک اس کے جلال سے زیادہ عظیم ہو۔ بہر حال، وہ تمہارے پاس اترا ہے، لہٰذا تم اسے اس کے نفس کے اس مقام پر رکھو جس سے وہ خوش ہوتا ہے، تب تم حکیم بنو گے۔ اور اللہ نے اپنے نبی کو نابینا اور غلاموں کے معاملے میں ملامت نہیں کی مگر دونوں گروہوں کی موجودگی میں۔ پس ملامت مجموعے کی وجہ سے ہوئی، اور میں اسی کے ساتھ کہتا ہوں، نہ کہ انفراد کے ساتھ۔ پس بادشاہوں اور سرداروں کی تعظیم تمہارے رب کی تعظیم میں سے ہے، اور فقراء کی تعظیم محض دلجوئی (جبر) ہے، ان کی فقر میں انکساری کی وجہ سے۔ لیکن اگر فقراء طریقت کے فقراء میں سے ہیں، تو ان کے نزدیک یہ دلجوئی نہیں ہے، کیونکہ تمہاری تعظیم، قبولیت اور توجہ سے ان کا فقر اور انکسار زائل نہیں ہوتا۔ کیونکہ جس کا شہود (الشہود) کیا گیا ہے وہ صرف ان کا رب ہے۔ اور دلجوئی (جبر) صرف ان فقراء کے لیے ہے جو اللہ کی طرف سے ہیں۔ پس اس ذکر کے ساتھ ذکر کرنے والا ہمیشہ ذات حق (الحق) کی صفت کی تعظیم کرتا ہے، خواہ وہ کسی بھی مقام پر ظاہر ہو۔ اور اگر اسے ملامت کی جائے تو وہ صرف شخص پر اکتفا کرتا ہے، نہ کہ کسی اور پر۔ پس ہوشیار ہو جاؤ۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔\n\n**\"والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\"**\n\"اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔\" (سورۃ الاحزاب، ۳۳:۴)",
    "fa": "باب پانصد و چهل و نهم در معرفت حال قطبی که منزل او این آیه بود: «اما کسی که خود را بی‌نیاز می‌داند، تو به او روی می‌آوری.» (أَمَّا من اسْتَغْنى‏ فَأَنْتَ لَهُ تَصَدَّى)\n\nهرگاه صفات حق (الحق) در کسی تجلی (التجلی) کند،\nآن یگانه احد، کشف (الکشف) را بزرگ می‌دارد.\nو اگر منزّه او، وی را در آن سرزنش کند،\nاو سرزنش وارد شده را می‌پذیرد.\n\nزیرا او به آنچه بر او وارد شده داناست،\nو به آنچه در سرزنش قصد شده نیز داناست.\n\nاگر کارها راه‌هایشان بسته شود،\nجز آنکه [آن را] یافته است، نمی‌گشاید.\n\nاگر صفاتی که در خلق او آشکار شده نبود،\nمن به واسطه آن صفات، نه مال و نه فرزندی را دوست نمی‌داشتم.\n\nو نه وجود خانواده را برای خود سکنی می‌گرفتم،\nو نه پادشاهان و نه اسباب را برای خود تکیه‌گاه.\n\nاین خواسته‌ها، طالبانشان عزیز شده‌اند،\nو جز کسی که شهود (الشهود) کرده است، آن‌ها را نمی‌شناسد.\n\n[تفاوت میان آنچه هستی (الکون) سزاوار آن است از صفات، و آنچه ذات سزاوار آن است از صفات]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، هنگامی که خداوند میان آنچه هستی (الکون) سزاوار آن است از صفات، و آنچه ذات یا جناب الهی سزاوار آن است از صفات، تفاوت نهاد؛ در نزد عارفان (العارفین) نعت حق (الحق) بزرگ داشته شد. پس هر جا آن را دیدند، به دلیل عزتش، هرگاه برایشان آشکار شد، فوراً به سوی آن متمایل شدند. و اگر عارف در این باره سرزنش شود، آن سرزنش را به طور خاص می‌پذیرد و آن را رد نمی‌کند. پس هرگاه نعت الهی دیگری مانند آن بر او تجلی (التجلی) کند، باز هم به آن روی می‌آورد و آن را بزرگ می‌دارد. اگر سرزنش شود، حال او در آن مانند حال اول خواهد بود. اگر کسی سرزنش را در هر نعت از جانب نفس خود رد کند، او صاحب ذوق نیست، بلکه صاحب قیاس در طریقت است و هرگز در میان بندگان اختصاصی (عبید الاختصاص) متمایز نمی‌شود. زیرا اگر آن را رد کند، با نعت حق (الحق) به گونه‌ای رفتار کرده که شایسته نیست. و در اینجا پای گروهی از متشرعان لغزیده است و این برای آنان شایسته نبود. زیرا رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) بر آنچه گفتیم تنبیه کرده و مرا واداشته است که با آن بر آنچه مقرر کردیم احتجاج کنم، و آن فرموده ایشان است: «هرگاه بزرگ قومی نزد شما آمد، او را گرامی بدارید.» (إذا آتاكم كريم قوم فأكرموه)\n\nو خداوند عز و جل فرمود: «خداوند شما را از کسانی که در [امر] دین با شما نجنگیده‌اند و شما را از دیارهایتان بیرون نکرده‌اند، باز نمی‌دارد که با آنان نیکی کنید و با ایشان به عدالت رفتار نمایید.» (لا يَنْهاكُمُ الله عَنِ الَّذِينَ لَمْ يُقاتِلُوكُمْ في الدِّينِ ولَمْ يُخْرِجُوكُمْ من دِيارِكُمْ أَنْ تَبَرُّوهُمْ وتُقْسِطُوا إِلَيْهِمْ‏)\n\n[فقیران به سوی خدا]\n\nو بدان که پادشاه عزیز در میان قومش نزد تو نیامده و بر تو فرود نیامده، مگر آنکه جبروت خود را پشت سر نهاده است، یا جبروت تو نزد او از جبروت خودش بزرگ‌تر بوده است. در هر حال، او بر تو فرود آمده است، پس تو او را در منزلتی که خود از آن خشنود است، فرود آور تا حکیم باشی. و خداوند پیامبرش را در مورد نابینا و بندگان سرزنش نکرد، مگر با حضور هر دو گروه. پس سرزنش به سبب مجموع واقع شد و من نیز به همین قائل هستم، نه به سبب انفراد. بزرگداشت پادشاهان و رؤسا از تعظیم پروردگار توست، و بزرگداشت فقرا صرفاً جبران است به دلیل شکستگی آنان در فقرشان. اما اگر فقرا از فقیران طریقت باشند، این بزرگداشت نزد او جبران نیست، زیرا فقر و شکستگی او با بزرگداشت، پذیرش و روی آوردن تو از او زائل نمی‌شود. زیرا آنچه برای او مشهود است، پروردگار اوست. و جبران تنها برای فقیران از جانب خداست. پس کسی که به این ذکر مشغول است، همواره صفت حق (الحق) را بزرگ می‌دارد، بر هر محلی که ظاهر شود. و اگر سرزنش شود، تنها به شخص اکتفا می‌کند نه به غیر او. پس آگاه باش. و خداوند حق (الحق) را می‌گوید و اوست که راه را هدایت می‌کند. (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏)"
  },
  "page_count": 2
}