{
  "id": 126,
  "title": {
    "ar": "الباب السادس والعشرون ومائة في معرفة مقام المراقبة",
    "en": "Chapter One Hundred and Twenty-Six: Concerning the Knowledge (معرفة) of the Spiritual Station (مقام) of Vigilance (المراقبة)",
    "ur": "ایک سو چھبیسواں باب: مقام المراقبة (المراقبة) کی معرفت (المعرفة) کے بیان میں",
    "fa": "باب صد و بیست و ششم در معرفت مقام مراقبه"
  },
  "content": {
    "ar": "## (الباب السادس والعشرون ومائة في معرفة مقام المراقبة)\n\n\n> كن رقيبا عليه في كل شأن *** فهو سبحانه عليك رقيب‏\n\n\n> في حضور وغيبة لشئون *** ولذا لي في كل حال نصيب‏\n\n\n> فإذا ما أتى أوان فراغ *** لا أبالي وإن ذا لعجيب‏\n\n\n### [مراقبة الوجود مراقبة الحق خلقه لحفظ الوجود عليه‏]\n\n\nالمراقبة نعت إلهي لنا فيه شرب قال تعالى وكانَ الله عَلى‏ كُلِّ شَيْ‏ءٍ رَقِيباً وهو قوله ولا يَؤُدُهُ حِفْظُهُما يعني السموات وهو العالم الأعلى والأرض وهو العالم الأسفل وما ثم إلا أعلى وأسفل وهو على قسمين عالم قائم بنفسه وعالم غير قائم بنفسه فالقائم بنفسه جواهر وأجسام وغير القائم بنفسه أكوان وألوان وهي الصفات والأعراض فعالم الأجسام والجواهر لا بقاء لهما إلا بإيجاد الأعراض فيهما فمتى لم يوجد فيهما العرض الذي به يكون بقاؤها ووجودها تنعدم ولا شك أن الأعراض تنعدم في الزمان الثاني من زمان وجودها فلا يزال الحق مراقبا لعالم الأجسام والجواهر العلوية والسفلية كلما انعدم منها عرض به وجوده خلق في ذلك الزمان عرضا مثله أو ضده يحفظه به من العدم في كل زمان فهو خلاق على الدوام والعالم مفتقر إليه تعالى على الدوام افتقارا ذاتيا من عالم الأعراض والجواهر فهذه مراقبة الحق خلقه لحفظ الوجود عليه وهذه هي الشئون التي عبر عنها في كتابه إنه كل يوم في شأن‏\n\n\n### [مراقبة كمال الوجود مراقبة الحق عباده فيما كلفهم به ورسم لهم من حدوده‏]\n\n\nومراقبة أخرى للحق في عباده وهي نظره إليهم فيما كلفهم من أوامره ونواهيه ورسم لهم من حدوده وهذه مراقبة كبرياء ووعيد فمنهم من وكل بهم من يحصي عليهم جميع ما يفعلونه مثل قوله ما يَلْفِظُ من قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ ومثل قوله كِراماً كاتِبِينَ يَعْلَمُونَ ما تَفْعَلُونَ وقوله سَنَكْتُبُ ما قالُوا وكُلَّ شَيْ‏ءٍ أَحْصَيْناهُ في إِمامٍ مُبِينٍ وما الله بِغافِلٍ عَمَّا تَعْمَلُونَ فهذه مراقبة الحق‏\n\n\n### [المراقبة التي لا تصح من العبد]\n\n\nوأما مراقبة العبد فهي على ثلاثة أقسام الواحد منها لا يصح والاثنان يصح وجودهما من العبد أما المراقبة التي لا تصح فهي مراقبة\nالعبد ربه ولا يعلم ذاته ولا نسبته إلى العالم فلا يتصور وجود هذه المراقبة لأنها موقوفة على العلم بذات المراقب بفتح القاف وثم طائفة أخرى قالت بصحة تلك المراقبة فإن الشرع قد حدد كما ينبغي لجلاله فهو معنا أينما كنا وهو عَلَى الْعَرْشِ اسْتَوى‏ وهو في الأرض يعلم سرنا وجهرنا وهو في السماء كذلك وينزل إليها وهو الظاهر في عين كل مظهر من الممكنات فقد علمنا هذا القدر منه فنراقبه على هذا الحد فمراقبتنا للأشياء هي عين مراقبتنا إياه لأنه الظاهر من كل شي‏ء فمن الناس من قال ما رأيت شيئا إلا رأيت الله قبله يعني المراقبة وآخر بعده وآخر معه أو آخر فيه فمثل هؤلاء يصححون هذه المراقبة\n\n\n### [مراقبة الحياء]\n\n\nوالمراقبة الثانية مراقبة الحياء من قوله أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏ فهو يراقب رؤيته وهي تراقبه فهو يرقب مراقبة الحق إياه فهذه مراقبة المراقبة وهي مشروعة\n\n\n### [مراقبة العبد قلبه ونفسه‏]\n\n\nوالمراقبة الثالثة هي أن يراقب قلبه ونفسه الظاهرة والباطنة ليرى آثار ربه فيها فيعمل بحسب ما يراه من آثار ربه وكذلك في الموجودات الخارجة عنه يرقبها ليرى آثار ربه فيها منها وهو قوله سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ ولهذه المراقبة تعلق بالحق إذ لا فاعل إلا الحق‏\n\n\n### [المراقبة دوام المراعاة للموازين الشرعية الخمسة]\n\n\nوالمراقبة دوام المراعاة بحيث أن لا يتخللها وقت لا يكون العبد فيه مراقبا فاعلم ذلك وتحققه تعلم شئون ربك في نفسك وما يدركه من الموجودات بصرك وما يصل إليه فكرك وعقلك وما يشهدك في مشاهدتك وما تطلع عليه من الغيوب في كونك أو حيث كان ومن هنا تعرف خواطرك وللمراقبة جاءت الموازين الشرعية وهي خمسة موازين الفرض والندب والإباحة والحظر والكراهة\n\n\n### [درجات المراقبة عند العارفين‏]\n\n\nوللمراقبة درجات عند أرباب الأنس والوصال من العارفين ومبلغها سبع مائة درجة وأربع وسبعون درجة وعند أرباب الأدب من العارفين ثلاث مائة درجة وتسع وسبعون درجة وعند الملامية من أهل الأنس سبعمائة وثلاث وأربعون درجة وعند الأدباء منهم ثمان وأربعون وثلاثمائة درجة ولها نسب إلى العوالم منها إلى عالم الملك نسبتان وإلى عالم الملكوت نسبة واحدة عند الأدباء من الطائفتين وثلاث نسب عند أهل الأنس إلى عالم الجبروت‏\n\n\n### [واقعة برزخى وقعت لابن عربى ليلة تقييد هذا الباب‏]\n\n\nواعلموا أن الله تعالى أطلعني في ليلة تقييدي هذا الباب على أمر لم يكن عندي في واقعة وقعت لي برزخية قيل لي فيها أ لم تسمع أن الدنيا أم رقوب قلت نعم قيل لي فاجعل لها فصلا في هذا الباب فاستخرت الله على ذلك‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إن للدنيا أبناء\n\n\nوإذا كان لها أبناء فهي أم لهؤلاء الأبناء ومن عادة الأم أن ترقب أبناءها لأنها المربية لهم ولها عليهم حنو الأمومة والحذر عليهم إن تؤثر فيهم ضرتها وهي الآخرة فيميلون إليها فتحفظهم من مشاهدة خير الآخرة فتشتد مراقبتها لأحوالهم‏\n\n\n### [الدنيا هي الدار الأولى؟ القريبة إلينا الحفيظة علينا الرحيمة بنا]\n\n\nثم لتعلموا إن الدنيا هي الدار الأولى القريبة إلينا نشأنا فيها وما رأينا سواها فهي المشهودة وهي الحفيظة علينا والرحيمة بنا فيها عملنا الأعمال المقربة إلى الله وفيها ظهرت شرائع الله وهي الدار الجامعة لجميع الأسماء الإلهية فظهرت فيها آلاء الجنان وآلام النار ففيها العافية والمرض وفيها السرور والحزن وفيها السر والعلن وما في الآخرة أمر إلا وفيها منه مثل وهي الأمنية الطائعة لله أودعها الله أمانات لعباده لتؤديها إليهم وهذا هو الذي جعلها ترقب أحوال أبنائها ما يفعلون بتلك الأمانات التي أدتها إليهم هل يعاملونها بما تستحق كل أمانة لما وضعت له فمنها أمانة توافق غرض نفوس الأبناء فترقبهم هل يشكرون الله على ما أولاهم من ذلك على يديها ومنها أمانات لا توافق أغراضهم فترقب أحوالهم هل يقبلونها بالرضى والتسليم لكونها هدية من الله فيقولون في الأولى الحمد لله المنعم المفضل ويقولون فيما لا يوافق الغرض الحمد لله على كل حال فيكونون من الحامدين في السراء والضراء فتعطيهم الدنيا هذه الأمانات نقية طاهرة من الشوب‏\n\n\n### [أمزجة الأبناء الدنيا هي كالبقاع للماء وكالأوعية لما يجعل فيها من غذاء]\n\n\nفبعض أمزجة الأبناء الذين هم كالبقعة للماء والأوعية لما يجعل فيها فيؤثر مزاج تلك البقعة في الماء فإن الماء كله طيب عذب في أصله وهو المطر فإذا حصل في بقع الأرض وهي مختلفة البقاع في المزاج ظهر العذب في المزاج الحسن فأبقاه على أصله كما ورد طاهرا نظيفا وزاده من مزاجه طيبا وحلاوة زائدة على ما كان عليه وهو الماء النمير وبقعة أخرى جعلته ملحا أجاجا وبقعة أخرى جعلته قعاما مرا فأثر في الحال النقي هذه الأوعية والشرع إنما تعلق بأفعال الأبناء لا بالأم بل قال وبِالْوالِدَيْنِ إِحْساناً وبما قال فَلا تَقُلْ لَهُما أُفٍّ ولا تَنْهَرْهُما وقُلْ لَهُما قَوْلًا كَرِيماً واخْفِضْ لَهُما جَناحَ الذُّلِّ من الرَّحْمَةِ وقُلْ رَبِّ ارْحَمْهُما كَما رَبَّيانِي صَغِيراً فما أوصى الله تعالى بهذه الأمور إلا لعلمه بأنه في الأبناء من يصدر منهم مثل هذه الأفعال فأمرهم إن يراقبوا هذه الأحكام في‏\nأفعالهم حتى يأتوا منها ما أمرهم الله والدنيا شفيقة عليهم حدبة كثيرة الحنو خائفة أن تأخذهم الضرة الآخرة منها فإن الدار في هذا الوقت للدنيا والحكم لها ولا ينبغي أن تعزل عنها كما إن الدار الآخرة لا تتعرض لها الدار الدنيا إذا انتقل الناس إليها فالدنيا أنصف من الآخرة في الحكم فإنها في دار سلطانها وإذا جاءت الآخرة وكان يومها لا تعترض الدنيا ولا تزاحم الآخرة فما أنصف أحد من الناس‏\n\n\n### [ما أنصف الدنيا أحد ذمت باساءة المسي‏ء فيها ولم تحمد بإحسان المحسن فيها]\n\n\nقال قتادة ما أنصف الدنيا أحد ذمت بإساءة المسي‏ء فيها ولم تحمد بإحسان المحسن فيها فلو كانت بذاتها تعطي القبح والسوء ما تمكن أن يكون فيها نبي مرسل ولا عبد صالح كيف والله قد وصفها بالطاعة فقال إن علوها وسفلها قالا أَتَيْنا طائِعِينَ وقال أَنَّ الْأَرْضَ يَرِثُها عِبادِيَ الصَّالِحُونَ والصالح لا يرث إلا المال الصالح الذي يجوز له التصرف فيه فإنه عبد صالح ولم يقل إن جميع العباد يرثها فدل إن تركتها كان كسبا صالحا فورثه عباد الله الصالحون‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إذا قال أحدكم لعن الله الدنيا قالت الدنيا لعن الله أعصانا لربه‏\n\n\nفهذا ابن عاق لها كيف لعنها وصرح باسمها والدنيا من حنوها على أبنائها لم تقدر أن تلعن ولدها فقالت لعن الله أعصانا لربه وما قدرت إن تسميه باسمه فهذا حنو الأم وشفقتها على ولدها\n\n\n### [الدنيا نعمت مطية المؤمن عليها يبلغ الخير وبها ينجو من الشر]\n\n\nفيا عجبا فينا لم نقف عند ما أمرنا الله به من طاعته ولا وفقنا ولا وفينا ما رأيناه من أخلاق هذه الأم وحنوها علينا ومحبتها وقال النبي صَلَّى اللهُ عَليهِ وسَلَّم نعمت مطية المؤمن عليها يبلغ الخير وبها ينجو من الشر\n\n\nفوصفها بأن حذرها على أبنائها تذكرهم بالشرور وتهرب بهم منها وتزين لهم الخير وتشوقهم إليه فهي تسافر بهم وتحملهم من موطن الشر إلى موطن الخير وذلك لشدة مراقبتها إلى ما أنزل الله فيها من الأوامر الإلهية المسماة شرائع فتحب إن يقوم بها أبناؤها ليسعدوا فهذا صَلَّى اللهُ عَليهِ وسَلَّم قد وصفها بأحسن الصفات وجعلها محلا للخيرات فينبغي لأهل المراقبة أن يكون بدؤهم في الدخول لاكتساب هذه الصفة أن يرقبوا أحوال أمهم لأن الطفل لا يفتح عينيه إلا على أمه فلا يبصر غيرها فيحبها طبعا ويميل إليها أكثر مما يميل إلى أبيه لأنه لا يعقل سوى من يربيه وبأفعالها ينبغي يقتدى‏\n\n\n### [لما ذا تغار الدنيا من الآخرة]\n\n\nفإن قلت فلما ذا تغار من الآخرة قلنا لما كان الحكم لها وهي من الطاعة بهذه المثابة وليس للآخرة هنا سلطان والذي في الآخرة هو في الدنيا من اللذات والآلام فالداران متساويتان فيصعب عليها أن يكون أبناؤها ينسبون إلى الآخرة وما ولدتهم ولا تعبت في تربيتهم وبعد هذا كله فإن الناس نسبوا ما كانوا عليه من أحوال الشرور التي عينها الشارع إلى الدنيا وهي أحوالهم ما هي أحوال الدنيا لأن الشر هو فعل المكلف ما هو الدنيا ونسبوا ما كانوا عليه من أحوال الخير ومرضاة الله التي عينها الشارع للآخرة وهي أحوالهم ما هي أحوال الآخرة لأن الخير هو فعل المكلف ما هو الآخرة فللدنيا أجر المصيبة التي أصيبت في أولادها ومن أولادها فمن عرف الدنيا بهذه المثابة فقد عرفها ومن لم يعرفها بهذه المثابة وجهلها مع كونه فيها مشاهدا لأحوالها شرعا وعقلا فهو بالآخرة أجهل حيث ما ذاق لها طعما\n\n\n### [الغلط الذي يطرأ لأهل الطريق في كشفهم‏]\n\n\nوهنا يطرأ غلط لأهل طريق الله في كشفهم إذ لو تيقنوا في هذه الدار وطولعوا بأحوال الآخرة فليست تلك الآخرة على الحقيقة وإنما هي الدنيا أظهرها الله لهم في عالم البرزخ بعين الكشف أو النوم في صورة ما جهلوه منها في اليقظة فإنهم غير عارفين منها ما ذكرناه فيقولون رأينا الجنة والنار والقيامة ويذكرون الرؤيا التي رأوها وأين الدار من الدار وأين الاتساع من الاتساع فذلك الذي رأوه حال الدنيا التي خلقها الله عليها من الخير والطاعة والعدل في الحكومة والنصيحة والوعظ والتذكرة\n\n\n### [قيامة الدنيا وجنتها ونارها]\n\n\nفإنه معلوم أن القيامة ما هي الآن موجودة فإذا رؤيت في الحياة الدنيا فما هي إلا قيامة الدنيا وجنة الدنيا ونار الدنيا وأن الجنة والنار جاءتا خادمتين للدنيا\n\n\nإذ قال صَلَّى اللهُ عَليهِ وسَلَّم بل رؤي في صلاة الكسوف يتقدم في قبلته ثم تأخر تأخرا كثيرا ومد يده حين تقدم فسئل عن ذلك أني رأيت النار حين رأيتمونى تأخرت مخافة أن يصيبني من لفحها ورأيت الجنة حين تقدمت وحين مددت يدي لأقطف منها قطفا ولو خرجت به إليكم لأكلتم منه ما بقيت وذكر أنه رأى في النار صاحبة الهرة وعمرو بن لحي الذي سيب السوائب‏\n\n\nوذلك كله في حال الصلاة في يقظته وما قال رأيت الآخرة ولا جنة الآخرة ولا نارها بل قال في عرض هذا الحائط والحائط من الدار الدنيا ولذا\n\n\nقال عليه السلام مثلت لي الجنة في عرض الحائط\n\n\nولم يقل هي وقال رأيت الجنة ولم يصفها وذكر التمثيل وتمثل الشي‏ء ما هو عين الشي‏ء بل هو شبهه وقال مثلت لي كما قال في جبريل عليه السلام فَتَمَثَّلَ لَها بَشَراً سَوِيًّا أ ترى كان‏\nغير جبريل لا والله إلا جبريل فما رآهما إلا في الدنيا في دارها وحياتها وقال متمدحا ولِلَّهِ مُلْكُ السَّماواتِ والْأَرْضِ وهما للدار الدنيا\n\n\n### [الزيادة التي تزيد بها الدنيا على الآخرة]\n\n\nوقد قررنا أنه كل ما في الآخرة هو في الدنيا فمنه ما عرفناه ومنه ما لم نعرفه بل في الدنيا من الزيادة ما ليست في الآخرة فالدنيا أكمل في النشأة ولو لا التكليف وعدم حصول كل الأغراض لم تزنها الآخرة فإن قلت فما الزيادة التي تزيد بها الدنيا على الآخرة قلنا الآخرة دار تمييز والدار الدنيا دار تمييز واختلاط فأهل النار مميزون وأهل الجنة مميزون فأهل الجنة في الجنة وأهل النار في النار يَعْرِفُونَ كُلًّا بِسِيماهُمْ والدار الدنيا فيها ما في الآخرة من التمييز لكن لا يعم فإنه قد علمنا في الدنيا بإعلام الله أن الرسل والأنبياء ومن عينته الرسل بالبشرى أنه سعيد يقول الله لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا وفي الْآخِرَةِ فهذا عموم الدنيا فما ينقلب أحد من أهل السعادة إلى الآخرة حتى يبشر في الدنيا ولو نفس واحد فيحصل المقصود ومن عينته الرسل بالبشرى أنه شقي فقد تميز بالشقاء يقول سبحانه فَبَشِّرْهُمْ بِعَذابٍ أَلِيمٍ وسكت عن أكثر الناس فلم يعين منهم أحدا وظهرت صفات الأشقياء في الآخرة في هذه الدار على السعداء من الحزن والبلاء والبكاء والذلة والخشوع وظهرت صفات السعداء في الآخرة في هذه الدار من الخير والنعمة والتفكه والوصول إلى نيل الأغراض ونفوذ الأوامر على الأشقياء من أهل النار إذ هذه النشأة تعطي أن يكون لها حظ ونصيب من هذه الصفات فمنهم من تجمع له في الدار الواحدة ومنهم من تكون له في الدارين فيظهر المؤمن بصفة الكافر حتى يختم له بالإيمان ويظهر الكافر بصفة المؤمن حتى يختم له بالكفر ثم إن الله قد شرك السعيد والشقي في إطلاق الايمان والكفر وهذان اللفظان معلومان فأكثر الناس ما يطلق الايمان إلا على المؤمن بالله ولا الكافر إلا على الكافر بالله والله يقول والَّذِينَ آمَنُوا بِالْباطِلِ فسماهم مؤمنين وكَفَرُوا بِاللَّهِ فقد أعطت الدنيا ما أعطت الآخرة وهذه الزيادة التي لا تكون في الآخرة والتشريع لا يكون في الآخرة إلا في موطن واحد حين يُدْعَوْنَ إِلَى السُّجُودِ ليرجح بتلك السجدة ميزان أصحاب الأعراف والناس لا يشعرون‏\n\n\n### [وجود الحق في الدنيا في الإنسان أكمل منه في الآخرة]\n\n\nولما أوردناه يقول بعض أهل الله ولا أزكي على الله أحدا إن وجود الحق في الدنيا في الإنسان أكمل منه في الآخرة وقد رأينا من ذهب إلى هذا وشافهنا به في مجالس وجعل دليله الخلافة فالإنسان في الدنيا أكمل في الصفات الأسمائية منه في الآخرة بلا شك لأنه يظهر بالإنعام والانتقام ولا يكون له ذلك في الآخرة فإنه لا إنعام له على أحد ولا انتقام وإن شفع فبإذن فالإنعام لمن أذن وأما في الجنة والنار بعد ذبح الموت فلا بل في القيامة يكون من ذلك طرف انتقام لحكمة ذكرناها في هذا الكتاب مثل‏\n\n\nقوله عليه السلام فسحقا سحقا\n\n\nفراقبوا الله هنا عباد الله مراقبة الدنيا أبناءها فهي الأم الرقوب وكونوا على أخلاق أمكم تسعدوا\n\n",
    "en": "## Chapter One Hundred and Twenty-Six: On the Knowledge of the Station of Vigilance (مقام المراقبة)\n\nBe vigilant over Him in every affair,\nFor He, Glory be to Him, is vigilant over you.\nIn presence and absence concerning affairs,\nAnd thus I have a share in every state.\nAnd when the time of emptiness arrives,\nI do not care, and indeed that is wondrous.\n\n### [The Vigilance of Existence: The Vigilance of the Real over His Creation for the Preservation of Existence upon it]\n\nVigilance (المراقبة) is a Divine attribute (نعت إلهي) in which we have a share, for the Exalted said: <<وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ رَقِيبًا>> (And Allah is ever a Watcher over all things). This is also His saying: <<وَلَا يَئُودُهُ حِفْظُهُمَا>> (And the preservation of both [the heavens and the earth] does not weary Him). The heavens (السموات) are the Higher World (العالم الأعلى), and the earth (الأرض) is the Lower World (العالم الأسفل). There is nothing but higher and lower.\n\nExistence (الوجود) is of two divisions: a world subsisting by itself (قائم بنفسه) and a world not subsisting by itself (غير قائم بنفسه). That which subsists by itself consists of substances (جواهر) and bodies (أجسام). That which does not subsist by itself consists of occurrences (أكوان) and colors (ألوان), which are the Attributes (الصفات) and accidents (الأعراض).\n\nThe world of bodies and substances has no subsistence (بقاء) except through the creation of accidents within them. Whenever the accident by which their subsistence and existence are maintained is not created within them, they cease to exist. There is no doubt that accidents cease to exist in the second moment of their existence.\n\nThus, the Real (الحق) remains perpetually vigilant over the world of higher and lower bodies and substances. Whenever an accident necessary for its existence ceases, He creates in that moment an accident like it or its opposite to preserve it from non-existence in every moment. Therefore, He is the Creator continuously (خلاق على الدوام). The World (العالم) is perpetually dependent upon Him, an essential dependence (افتقارا ذاتيا) encompassing the world of accidents and substances.\n\nThis is the vigilance of the Real over His creation for the preservation of existence upon it. These are the affairs (الشئون) expressed in His Book: <<إِنَّهُ كُلَّ يَوْمٍ فِي شَأْنٍ>> (Indeed, every day He is in [some] affair).\n\n### [The Vigilance of the Perfection of Existence: The Vigilance of the Real over His Servants concerning what He has obligated them and the limits He has prescribed for them]\n\nThere is another vigilance of the Real over His servants, which is His observation of them concerning the commands and prohibitions He has obligated them with, and the limits He has prescribed for them. This is a vigilance of Majesty (كبرياء) and warning (وعيد).\n\nFor some of them, He has appointed those who enumerate all that they do, such as His saying: <<مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ>> (Not a word does he utter except that there is a watcher [raqīb] ready [atīd] with him). And His saying: <<كِرَامًا كَاتِبِينَ يَعْلَمُونَ مَا تَفْعَلُونَ>> (Noble recorders, who know what you do). And His saying: <<سَنَكْتُبُ مَا قَالُوا وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ فِي إِمَامٍ مُبِينٍ>> (We will record what they said, and We have enumerated all things in a clear register [imām mubīn]). And His saying: <<وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ>> (And Allah is not unaware of what you do). This is the vigilance of the Real.\n\n### [The Vigilance that is not Valid for the Servant]\n\nAs for the servant’s vigilance (مراقبة العبد), it is of three types: one is invalid, and two are valid for the servant.\n\nThe vigilance that is invalid is the servant’s vigilance over his Lord, while he does not know His Essence (ذاته) or His relation (نسبته) to the World. The existence of this vigilance is inconceivable because it depends on the knowledge of the Essence of the one being watched (المراقب).\n\nHowever, another group (طائفة أخرى) affirmed the validity of this vigilance, arguing that the Law (الشرع) has defined Him as befits His Majesty. He is with us wherever we are, and He <<عَلَى الْعَرْشِ اسْتَوَى>> (is established upon the Throne), and He is on Earth, knowing our secret and open deeds, and He is in the Heaven likewise, and descends to it. He is the Manifest (الظاهر) in the locus of manifestation (عين كل مظهر) of all possibilities.\n\nSince we know this much of Him, we observe Him within this limit. Our vigilance over things is identical to our vigilance over Him, because He is the Manifest from everything. Some people said, \"I did not see a thing except that I saw Allah before it\"—meaning the vigilance—and others said, \"after it,\" others \"with it,\" or \"in it.\" Such people validate this type of vigilance.\n\n### [The Vigilance of Shame]\n\nThe second type of vigilance is the vigilance of shame (مراقبة الحياء), based on the saying: <<أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَى>> (Does he not know that Allah sees?). The servant observes His seeing, and His seeing observes the servant. Thus, the servant observes the Real’s vigilance over him. This is the vigilance of vigilance (مراقبة المراقبة), and it is sanctioned (مشروعة).\n\n### [The Vigilance of the Servant over His Heart and Soul]\n\nThe third type of vigilance is that the servant observes his heart and his soul (نفسه), both outer and inner (الظاهرة والباطنة), to see the traces of his Lord (آثار ربه) within them, and acts according to what he sees of the traces of his Lord. Likewise, he observes external existents (الموجودات الخارجة عنه) to see the traces of his Lord in them. This is related to His saying: <<سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ>> (We will show them Our signs in the horizons and within themselves). This vigilance is connected to the Real, since there is no agent (فاعل) except the Real.\n\n### [Vigilance is the Continuous Observance of the Five Legal Standards]\n\nVigilance is the continuous observance (دوام المراعاة) such that no moment passes without the servant being vigilant. Know this and verify it, and you will know the affairs of your Lord in yourself, in what your sight perceives of existents, what your thought and intellect reach, what He makes you witness in your contemplation (مشاهدتك), and what you discover of the unseen (الغيوب) in your being or wherever it may be. From this, you recognize your passing thoughts (خواطرك).\n\nThe legal standards (الموازين الشرعية) were established for vigilance, and they are five standards: the Obligatory (الفرض), the Recommended (الندب), the Permissible (الإباحة), the Forbidden (الحظر), and the Disliked (الكراهة).\n\n### [The Degrees of Vigilance according to the Gnostics]\n\nVigilance has degrees among the People of Intimacy and Union (أرباب الأنس والوصال) among the Gnostics (العارفين), reaching 774 degrees. Among the People of Propriety/Etiquette (أرباب الأدب) among the Gnostics, there are 379 degrees. Among the Malamiyya (الملامية) of the People of Intimacy, there are 743 degrees. Among the People of Propriety among them, there are 348 degrees.\n\nIt has relations (نسب) to the Worlds (العوالم): two relations to the World of Dominion (عالم الملك), one relation to the World of Sovereignty (عالم الملكوت) for the People of Propriety of both groups, and three relations to the World of Compulsion (عالم الجبروت) for the People of Intimacy.\n\n### [A Barzakhian Event that Occurred to Ibn Arabi on the Night of Recording this Chapter]\n\nKnow that Allah informed me, on the night I recorded this chapter, of a matter I did not previously possess, in a *barzakhian* (برزخية) event that occurred to me. I was asked: \"Have you not heard that the World (الدنيا) is a vigilant mother (أم رقوب)?\" I said, \"Yes.\" I was told: \"Then dedicate a section to her in this chapter.\" I sought guidance from Allah concerning this.\n\nThe Messenger of Allah (peace and blessings be upon him) said: \"Indeed, the World has children.\"\n\nIf she has children, she is a mother (أم) to these children. It is the mother's custom to watch over her children because she is their nurturer. She has maternal tenderness (حنو الأمومة) and fears for them that her co-wife—the Hereafter (الآخرة)—might influence them, causing them to incline toward it. She guards them from witnessing the good of the Hereafter, thus intensifying her vigilance over their states.\n\n### [Is the World the First Abode? The One Close to Us, the Guardian over Us, the Merciful to Us]\n\nThen know that the World is the first abode (الدار الأولى), close to us. We grew up in it and have seen nothing else. It is the witnessed abode, the guardian (الحفيظة) over us, and the merciful (الرحيمة) to us. In it, we performed deeds that draw us near to Allah. In it, Allah's laws (شرائع) appeared. It is the abode that gathers all the Divine Names (الأسماء الإلهية). The blessings of the Gardens (آلاء الجنان) and the pains of the Fire (آلام النار) appeared in it. It contains health and sickness, joy and sorrow, secret and open. There is nothing in the Hereafter except that there is a likeness of it here.\n\nShe is the obedient wish (الأمنية الطائعة) of Allah. Allah entrusted her with trusts (أمانات) for His servants to deliver to them. This is what causes her to watch over the states of her children: what they do with those trusts that she delivered to them. Do they treat each trust as it deserves, for the purpose for which it was placed?\n\nSome trusts align with the desires of the children's souls. She watches if they thank Allah for what He bestowed upon them through her hands. Other trusts do not align with their desires. She watches their states to see if they accept them with contentment and submission (الرضى والتسليم), seeing them as a gift from Allah. In the first case, they say, \"Praise be to Allah, the Benefactor, the Gracious.\" In the case of what does not align with their desire, they say, \"Praise be to Allah in every state.\" Thus, they are among the thankful in ease and hardship. The World gives them these trusts pure and untainted.\n\n### [The Temperaments of the Children: The World is like Patches of Ground for Water and Vessels for Food Placed in Them]\n\nThe temperaments (أمزجة) of the children are like patches of ground (البقعة) for water or vessels (الأوعية) for food placed in them. The temperament of that patch affects the water. All water is originally good and sweet (the rain). But when it settles in the patches of the earth, which differ in temperament, the sweet water appears in the good-tempered ground, preserving its origin as pure and clean, and adding to it a goodness and sweetness beyond what it was—that is the flowing sweet water (الماء النمير). Another patch makes it salty and bitter (ملحا أجاجا). Another makes it foul and bitter (قعاما مرا). These vessels affect the pure state.\n\nThe Law relates only to the actions of the children, not the Mother. Rather, He said: <<وَبِالْوَالِدَيْنِ إِحْسَانًا>> (And to parents, good treatment). And He said: <<فَلَا تَقُلْ لَهُمَا أُفٍّ وَلَا تَنْهَرْهُمَا وَقُلْ لَهُمَا قَوْلًا كَرِيمًا>> (So do not say to them [even] 'uff' and do not repel them but speak to them a noble word). And: <<وَاخْفِضْ لَهُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحْمَةِ وَقُلْ رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا>> (And lower to them the wing of humility out of mercy and say, \"My Lord, have mercy upon them as they nurtured me when I was small\").\n\nAllah commanded these things only because He knew that such actions would issue from the children. He commanded them to observe these rulings in their actions so that they might perform what Allah commanded them.\n\nThe World is compassionate (شفيقة) toward them, tender (حدبة), full of affection, fearing that the co-wife, the Hereafter, might take them from her. For the dominion (الدار) belongs to the World at this time, and the ruling (الحكم) is hers, and she should not be dismissed from it, just as the World does not interfere with the Hereafter when people transition to it. The World is more just (أنصف) than the Hereafter in judgment, for she is in the abode of her sovereignty. When the Hereafter comes, and it is her day, the World does not object or compete with the Hereafter. No one among mankind has been fair to the World.\n\n### [No One Has Been Fair to the World: She is Blamed for the Evil of the Evildoer in Her, and Not Praised for the Good of the Doer of Good in Her]\n\nQatada said: No one has been fair to the World. She is blamed for the evil of the evildoer in her, and not praised for the good of the doer of good in her. If she inherently gave ugliness and evil, no Messenger Prophet or righteous servant could exist in her. How could this be, when Allah described her as obedient, saying that her high and low parts said: <<أَتَيْنَا طَائِعِينَ>> (We came willingly/obediently)? And He said: <<أَنَّ الْأَرْضَ يَرِثُهَا عِبَادِيَ الصَّالِحُونَ>> (Indeed, the earth will be inherited by My righteous servants). The righteous only inherits righteous wealth over which he is permitted to dispose. Since He did not say that *all* servants inherit it, this indicates that what she leaves behind was a righteous gain, which Allah's righteous servants inherited.\n\nThe Messenger of Allah (peace and blessings be upon him) said: \"If one of you says, 'May Allah curse the World,' the World says, 'May Allah curse the one among us who is most disobedient to his Lord.'\"\n\nThis is a disobedient son cursing her and stating her name explicitly. Yet, the World, out of her tenderness for her children, could not curse her child, so she said, \"May Allah curse the one among us who is most disobedient to his Lord,\" and could not name him. This is the tenderness and compassion of the mother for her child.\n\n### [The World is the Excellent Mount of the Believer; upon it he attains good and by it he escapes evil]\n\nHow astonishing it is that we neither adhere to what Allah commanded us of obedience nor fulfill what we have seen of the character, tenderness, and love of this Mother toward us! The Prophet (peace and blessings be upon him) said: \"The World is the excellent mount (نعمت مطية) of the believer; upon it he attains good and by it he escapes evil.\"\n\nHe described her vigilance: her caution over her children reminds them of evils and helps them flee from them. She beautifies good for them and makes them yearn for it. She travels with them and carries them from the place of evil to the place of good. This is due to her intense vigilance over the Divine commands (الأوامر الإلهية) called the Law (شرائع) that Allah revealed in her. She desires her children to uphold them so they may be felicitous.\n\nThus, the Prophet (peace and blessings be upon him) described her with the best attributes and made her a locus for good things. It is fitting for the People of Vigilance (أهل المراقبة) that their beginning in acquiring this attribute should be to observe the states of their Mother, because a child opens his eyes only upon his mother and sees no one else. He loves her naturally and inclines toward her more than his father, because he only comprehends the one who nurtures him. Her actions should be emulated.\n\n### [Why Does the World Envy the Hereafter]\n\nIf you ask, \"Why does she envy the Hereafter?\" We reply: Because the ruling belongs to her, and she is so obedient, while the Hereafter has no sovereignty here. What is in the Hereafter—of pleasures and pains—is also in the World. The two abodes are equal (متساويتان). It is difficult for her that her children attribute themselves to the Hereafter, which neither bore them nor labored in raising them.\n\nAfter all this, people attribute the states of evil (which the Law defines) to the World, when those states are their own actions, not the World's. Evil is the act of the responsible agent (المكلف), not the World. And they attribute the states of good and Allah's pleasure (which the Law defines) to the Hereafter, when those states are their own actions, not the Hereafter's. Good is the act of the responsible agent, not the Hereafter.\n\nThe World deserves the reward for the calamity (أجر المصيبة) she suffers in and from her children. Whoever knows the World in this manner has truly known her. Whoever is ignorant of her, despite witnessing her states legally and intellectually while being in her, is even more ignorant of the Hereafter, having tasted nothing of it.\n\n### [The Error that Occurs to the People of the Path in their Unveiling]\n\nHere, an error occurs for the People of the Path (أهل طريق الله) in their unveiling (كشفهم). If they attain certainty in this abode and are shown the states of the Hereafter, that is not the Hereafter in reality. It is only the World that Allah manifests to them in the World of the Isthmus (عالم البرزخ) through the eye of unveiling (عين الكشف) or sleep, in the form of what they were ignorant of during wakefulness. Since they do not know the World as we described, they say: \"We saw Paradise, Hell, and the Resurrection (القيامة).\" They describe the vision they saw. But where is that abode compared to this abode? Where is that vastness compared to this vastness? What they saw was the state of the World that Allah created upon goodness, obedience, justice in governance, sincerity, admonition, and remembrance.\n\n### [The Resurrection, Paradise, and Hell of the World]\n\nIt is known that the Resurrection does not exist now. If it is seen in this life, it is only the Resurrection of the World, the Paradise of the World, and the Hell of the World. Indeed, Paradise and Hell came as servants (خادمتين) to the World.\n\nThe Prophet (peace and blessings be upon him) was seen advancing in his prayer during the solar eclipse, then retreating greatly, and extending his hand when he advanced. When asked about this, he said: \"I saw the Fire when you saw me retreat, fearing that its heat might touch me. And I saw Paradise when I advanced, and when I extended my hand to pluck a cluster from it. Had I brought it out to you, you would have eaten from it as long as you remained.\" He mentioned seeing the woman of the cat and Amr ibn Luhayy (who introduced the practice of setting loose sacrificial animals) in the Fire.\n\nThis all happened during prayer in his wakefulness. He did not say, \"I saw the Hereafter,\" or \"the Paradise of the Hereafter,\" or \"its Fire.\" Rather, he said: \"in the breadth of this wall,\" and the wall belongs to the World. Thus, he said: \"Paradise was represented (مثلت لي) to me in the breadth of the wall.\"\n\nHe did not say *it is* Paradise. He said, \"I saw Paradise,\" but mentioned representation (التمثيل). The representation of a thing is not the thing itself, but its likeness (شبهه). He said, \"It was represented to me,\" just as he said concerning Gabriel (peace be upon him): <<فَتَمَثَّلَ لَهَا بَشَرًا سَوِيًّا>> (And he appeared to her as a man in all respects). Was it anyone other than Gabriel? No, by Allah, only Gabriel. So, he only saw them in the World, in its abode and life.\n\nAllah praises Himself: <<وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ>> (And to Allah belongs the dominion of the heavens and the earth), and both belong to the World.\n\n### [The Excess by which the World Exceeds the Hereafter]\n\nWe have established that everything in the Hereafter is in the World—some known, some unknown. Moreover, the World has an excess (زيادة) that the Hereafter lacks. The World is more complete (أكمل) in its origination (النشأة). Were it not for the burden of obligation (التكليف) and the lack of attainment of all desires, the Hereafter would not outweigh it.\n\nIf you ask, \"What is the excess by which the World exceeds the Hereafter?\" We reply: The Hereafter is the abode of distinction/separation (دار تمييز). The World is the abode of distinction *and* mixture (اختلاط). The people of the Fire are distinguished, and the people of the Garden are distinguished. <<يَعْرِفُونَ كُلًّا بِسِيمَاهُمْ>> (They will know each by their marks).\n\nThe World contains the distinction found in the Hereafter, but it is not comprehensive. We know in the World, by Allah's notification, that the Messengers, Prophets, and those designated by the Messengers with good tidings are felicitous. Allah says: <<لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ>> (For them are good tidings in the worldly life and in the Hereafter). This is the comprehensiveness of the World. No person of felicity transitions to the Hereafter until he is given good tidings in the World, even if only one soul, thus achieving the intended purpose.\n\nThose designated by the Messengers as wretched (شقي) are distinguished by wretchedness. The Exalted says: <<فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ>> (So give them tidings of a painful punishment). He remained silent about most people, not designating anyone.\n\nThe attributes of the wretched in the Hereafter appear in this abode upon the felicitous (such as sorrow, affliction, weeping, humiliation, and reverence). And the attributes of the felicitous in the Hereafter appear in this abode upon the wretched people of the Fire (such as goodness, blessing, enjoyment, attainment of desires, and execution of commands). This origination requires a share and portion of these attributes. Some have them combined in one abode, and some have them in both abodes.\n\nThe believer may appear with the attributes of the disbeliever until he is sealed with faith, and the disbeliever may appear with the attributes of the believer until he is sealed with disbelief. Furthermore, Allah has shared the felicitous and the wretched in the application of the terms 'faith' (الإيمان) and 'disbelief' (الكفر). These two terms are known, yet most people apply 'faith' only to the believer in Allah and 'disbelief' only to the disbeliever in Allah. But Allah says: <<وَالَّذِينَ آمَنُوا بِالْبَاطِلِ>> (And those who believed in falsehood), calling them believers, and <<وَكَفَرُوا بِاللَّهِ>> (and disbelieved in Allah).\n\nThus, the World gives what the Hereafter gives, plus this excess which is not found in the Hereafter. Legislation (التشريع) does not occur in the Hereafter, except in one instance: when they are called to prostrate (يُدْعَوْنَ إِلَى السُّجُودِ), so that the scale of the People of the Heights (أصحاب الأعراف) may be tipped by that single prostration, though people are unaware.\n\n### [The Existence of the Real in the World within the Human is More Complete than in the Hereafter]\n\nBased on what we presented, some of the People of Allah—and I do not purify anyone before Allah—say that the existence of the Real (وجود الحق) in the human in the World is more complete than in the Hereafter. We have seen those who hold this view and spoke with them directly in gatherings. They use the Vicegerency (الخلافة) as their proof.\n\nThe human in the World is undoubtedly more complete in the attributive Names (الصفات الأسمائية) than in the Hereafter, because he manifests through both bestowal of grace (الإنعام) and vengeance (الانتقام). He does not have this capacity in the Hereafter, as he has no power of bestowal or vengeance over anyone. If he intercedes, it is by permission, so the bestowal belongs to the one who gave permission. In Paradise and Hell, after the slaughtering of Death, this is not the case. However, in the Resurrection, there is a degree of vengeance for a wisdom we mentioned elsewhere in this book, such as the Prophet's saying: \"Away with them! Away with them!\" (فسحقا سحقا).\n\nTherefore, O servants of Allah, observe vigilance here—the vigilance of the World over her children, for she is the vigilant Mother (الأم الرقوب). Be upon the character of your Mother, and you shall be felicitous.",
    "ur": "(باب ایک سو چھبیس: مقامِ مراقبہ (المراقبة) کی معرفت میں)\n\nتو ہر شان میں اس پر نگہبان رہ *** وہ سبحانہ تجھ پر نگہبان (رقیب) ہے\nحضور اور غیبت میں معاملات کے لیے *** اسی لیے ہر حال میں میرا حصہ ہے\nپس جب فراغت کا وقت آتا ہے *** تو میں پرواہ نہیں کرتا، اور یہ عجیب ہے\n\n[ہستی (الوجود) کا مراقبہ: ذات حق (الحق) کا اپنی مخلوق پر مراقبہ تاکہ ہستی (الوجود) کو محفوظ رکھا جا سکے]\n\nمراقبہ (المراقبة) ایک الٰہی صفت ہے جس میں ہمارا حصہ ہے۔ اللہ تعالیٰ فرماتا ہے: \"وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ رَقِيبًا\" (اور اللہ ہر چیز پر نگہبان (رقیب) ہے)۔ اور یہ اس کا قول ہے: \"وَلَا يَئُودُهُ حِفْظُهُمَا\" (اور ان دونوں کی حفاظت اسے تھکاتی نہیں) یعنی آسمان جو کہ عالمِ بالا ہے، اور زمین جو کہ عالمِ اسفل ہے، اور وہاں بالا اور اسفل کے سوا کچھ نہیں۔ یہ دو قسموں پر ہے: ایک عالم جو بذاتِ خود قائم ہے، اور ایک عالم جو بذاتِ خود قائم نہیں ہے۔ جو بذاتِ خود قائم ہے وہ جواہر (الجواهر) اور اجسام ہیں، اور جو بذاتِ خود قائم نہیں ہے وہ اکوان (وجودات) اور الوان (رنگ) ہیں، جو کہ صفات اور اعراض (الأعراض) ہیں۔ اجسام اور جواہر کا عالم ان میں اعراض (الأعراض) کے پیدا کیے جانے کے بغیر باقی نہیں رہ سکتا۔ پس جب ان میں وہ عرض پیدا نہیں ہوتا جس سے ان کا بقا اور وجود ہوتا ہے، تو وہ معدوم ہو جاتے ہیں۔ اور اس میں کوئی شک نہیں کہ اعراض (الأعراض) اپنے وجود کے وقت کے دوسرے لمحے میں معدوم ہو جاتے ہیں۔ پس ذات حق (الحق) ہمیشہ اجسام اور جواہر کے عالمِ علوی اور سفلی پر نگہبان (مراقب) رہتا ہے۔ جب بھی ان میں سے کوئی عرض جس سے اس کا وجود ہے، معدوم ہوتا ہے، تو وہ اسی وقت اس جیسا یا اس کے برعکس کوئی عرض پیدا کر دیتا ہے، جس سے وہ اسے ہر وقت عدم (العدم) سے محفوظ رکھتا ہے۔ پس وہ ہمیشہ خلاق (پیدا کرنے والا) ہے۔ اور عالم ہمیشہ ذات حق (الحق) کا محتاج ہے، یہ اعراض (الأعراض) اور جواہر (الجواهر) کے عالم کی طرف سے ایک ذاتی احتیاج ہے۔ یہ ذات حق (الحق) کا اپنی مخلوق پر مراقبہ (المراقبة) ہے تاکہ ہستی (الوجود) کو محفوظ رکھا جا سکے۔ اور یہی وہ شانیں (الشئون) ہیں جن کا اظہار اس نے اپنی کتاب میں کیا ہے: \"إِنَّهُ كُلَّ يَوْمٍ فِي شَأْنٍ\" (بیشک وہ ہر دن ایک نئی شان میں ہے)۔\n\n[کمالِ ہستی (الوجود) کا مراقبہ: ذات حق (الحق) کا اپنے بندوں پر ان احکام اور حدود کے بارے میں مراقبہ جن کا انہیں مکلف بنایا گیا ہے]\n\nاور ذات حق (الحق) کا اپنے بندوں پر ایک دوسرا مراقبہ (المراقبة) بھی ہے، اور وہ یہ ہے کہ وہ ان احکام اور نواہی کے بارے میں ان پر نظر رکھتا ہے جن کا انہیں مکلف بنایا گیا ہے اور جو حدود ان کے لیے مقرر کی گئی ہیں۔ یہ کبریائی اور وعید کا مراقبہ ہے۔ پس ان میں سے کچھ ایسے ہیں جن پر اس نے ایسے نگہبان مقرر کیے ہیں جو ان کے تمام افعال کو شمار کرتے ہیں، جیسا کہ اس کا قول ہے: \"مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ\" (وہ کوئی بات منہ سے نہیں نکالتا مگر اس کے پاس ایک نگہبان (رقیب) تیار بیٹھا ہوتا ہے)۔ اور جیسا کہ اس کا قول ہے: \"كِرَامًا كَاتِبِينَ * يَعْلَمُونَ مَا تَفْعَلُونَ\" (عزت والے لکھنے والے ہیں، جو جانتے ہیں جو تم کرتے ہو)۔ اور اس کا قول: \"سَنَكْتُبُ مَا قَالُوا\" (ہم لکھ لیں گے جو انہوں نے کہا) اور \"وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ فِي إِمَامٍ مُبِينٍ\" (اور ہم نے ہر چیز کو ایک واضح امام (لوح محفوظ) میں شمار کر رکھا ہے)۔ اور \"وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ\" (اور اللہ اس سے غافل نہیں جو تم کرتے ہو)۔ پس یہ ذات حق (الحق) کا مراقبہ (المراقبة) ہے۔\n\n[وہ مراقبہ (المراقبة) جو بندے کی طرف سے درست نہیں]\n\nاور جہاں تک بندے کے مراقبہ (المراقبة) کا تعلق ہے، تو وہ تین اقسام پر ہے۔ ان میں سے ایک درست نہیں ہے، اور دو کا بندے کی طرف سے وجود درست ہے۔ وہ مراقبہ (المراقبة) جو درست نہیں ہے، وہ بندے کا اپنے رب کا مراقبہ (المراقبة) کرنا ہے جبکہ وہ اس کی ذات اور عالم سے اس کی نسبت کو نہیں جانتا۔ پس اس مراقبہ (المراقبة) کا تصور ممکن نہیں، کیونکہ یہ مراقب (بفتح القاف) کی ذات کے علم پر موقوف ہے۔ اور پھر ایک دوسرا گروہ ہے جس نے اس مراقبہ (المراقبة) کی صحت کا قائل ہوا ہے۔ (ان کا کہنا ہے کہ) شریعت نے اس کی حد مقرر کر دی ہے جیسا کہ اس کی جلالت کے شایانِ شان ہے۔ پس وہ ہمارے ساتھ ہے جہاں بھی ہم ہوں، اور وہ \"عَلَى الْعَرْشِ اسْتَوَى\" (عرش پر مستوی ہے)۔ اور وہ زمین میں ہے، ہمارے راز اور ہمارے ظاہر کو جانتا ہے، اور وہ آسمان میں بھی اسی طرح ہے۔ اور وہ اس کی طرف نازل ہوتا ہے۔ اور وہ ممکنات کے ہر مظہر کی آنکھ میں ظاہر (الظاہر) ہے۔ پس ہم نے اس کی اس قدر کو جان لیا ہے، لہٰذا ہم اس حد پر اس کا مراقبہ (المراقبة) کرتے ہیں۔ پس ہمارا اشیاء کا مراقبہ (المراقبة) کرنا ہی درحقیقت اس کا مراقبہ (المراقبة) کرنا ہے، کیونکہ وہ ہر چیز سے ظاہر (الظاہر) ہے۔ پس بعض لوگ کہتے ہیں: \"میں نے کوئی چیز نہیں دیکھی مگر اللہ کو اس سے پہلے دیکھا\" یعنی مراقبہ (المراقبة) کے وقت، اور دوسرے نے کہا: \"اس کے بعد\"، اور تیسرے نے کہا: \"اس کے ساتھ\"، یا چوتھے نے کہا: \"اس میں\"۔ پس ایسے لوگ اس مراقبہ (المراقبة) کو درست قرار دیتے ہیں۔\n\n[حیا کا مراقبہ (المراقبة)]\n\nاور دوسرا مراقبہ (المراقبة) حیا کا مراقبہ (المراقبة) ہے، جو اس کے قول سے ماخوذ ہے: \"أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَى\" (کیا اسے معلوم نہیں کہ اللہ دیکھ رہا ہے؟)۔ پس وہ اس کے دیکھنے کا مراقبہ (المراقبة) کرتا ہے، اور وہ (رؤیت) اس کا مراقبہ (المراقبة) کرتی ہے۔ پس وہ ذات حق (الحق) کے اپنے اوپر مراقبہ (المراقبة) کا مراقبہ (المراقبة) کرتا ہے۔ پس یہ مراقبہ (المراقبة) کا مراقبہ (المراقبة) ہے، اور یہ مشروع ہے۔\n\n[بندے کا اپنے قلب اور نفس کا مراقبہ (المراقبة)]\n\nاور تیسرا مراقبہ (المراقبة) یہ ہے کہ بندہ اپنے قلب اور اپنے ظاہر و باطن نفس کا مراقبہ (المراقبة) کرے تاکہ وہ ان میں اپنے رب کے آثار کو دیکھے، اور پھر اپنے رب کے آثار کے مطابق عمل کرے۔ اسی طرح وہ اپنے سے باہر موجودات کا بھی مراقبہ (المراقبة) کرتا ہے تاکہ ان میں اپنے رب کے آثار کو دیکھے، اور یہ اس کا قول ہے: \"سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ\" (ہم انہیں اپنی نشانیاں آفاق میں اور خود ان کی جانوں میں دکھائیں گے)۔ اور اس مراقبہ (المراقبة) کا تعلق ذات حق (الحق) سے ہے، کیونکہ ذات حق (الحق) کے سوا کوئی فاعل نہیں۔\n\n[مراقبہ (المراقبة) پانچ شرعی میزانوں کی دائمی رعایت کا نام ہے]\n\nاور مراقبہ (المراقبة) دائمی رعایت کا نام ہے، اس طرح کہ کوئی وقت ایسا نہ گزرے جب بندہ مراقب (نگہبان) نہ ہو۔ پس یہ جان لو اور اس کی حقیقت کو پہچان لو، تاکہ تم اپنے نفس میں اپنے رب کی شانوں (الشئون) کو جان سکو، اور ان موجودات کو جان سکو جنہیں تمہاری بصارت پاتی ہے، اور جن تک تمہاری فکر اور عقل پہنچتی ہے، اور جو تمہارے مشاہدے میں تمہیں دکھایا جاتا ہے، اور جن غیوب پر تم اپنی کائنات میں یا جہاں بھی ہو، مطلع ہوتے ہو۔ اور یہیں سے تم اپنے خواطر (خیالات) کو پہچانتے ہو۔ اور مراقبہ (المراقبة) کے لیے ہی شرعی میزانیں آئی ہیں، اور وہ پانچ میزانیں ہیں: فرض، ندب (مستحب)، اباحت (جائز)، حظر (حرام)، اور کراہت (مکروہ)۔\n\n[عارفین کے نزدیک مراقبہ (المراقبة) کے درجات]\n\nاور عارفین میں سے اہلِ اُنس اور وصال کے نزدیک مراقبہ (المراقبة) کے درجات ہیں، اور ان کی تعداد سات سو چوہتر (۷۷۴) درجے ہے۔ اور عارفین میں سے اہلِ ادب کے نزدیک تین سو اناسی (۳۷۹) درجے ہیں۔ اور اہلِ اُنس میں سے ملامیہ کے نزدیک سات سو تینتالیس (۷۴۳) درجے ہیں۔ اور ان میں سے ادباء کے نزدیک تین سو اڑتالیس (۳۴۸) درجے ہیں۔ اور اس کے عوالم سے نسبتیں ہیں: عالمِ ملک سے دو نسبتیں، اور عالمِ ملکوت سے ایک نسبت دونوں گروہوں کے ادباء کے نزدیک، اور اہلِ اُنس کے نزدیک عالمِ جبروت سے تین نسبتیں۔\n\n[ایک برزخی واقعہ جو ابن عربی کو اس باب کی تحریر کی رات پیش آیا]\n\nاور جان لو کہ اللہ تعالیٰ نے مجھے اس باب کو قلمبند کرنے کی رات ایک ایسے امر پر مطلع کیا جو میرے پاس نہیں تھا۔ یہ ایک برزخی واقعہ تھا جو مجھے پیش آیا، جس میں مجھ سے کہا گیا: \"کیا تم نے نہیں سنا کہ دنیا 'اُمّ رَقُوب' (نگہبان ماں) ہے؟\" میں نے کہا: \"ہاں۔\" مجھ سے کہا گیا: \"پس اس کے لیے اس باب میں ایک فصل بناؤ۔\" چنانچہ میں نے اس پر اللہ سے استخارہ کیا۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"بیشک دنیا کے بیٹے ہیں۔\"\n\nاور جب اس کے بیٹے ہیں تو وہ ان بیٹوں کی ماں ہے۔ اور ماں کی عادت ہے کہ وہ اپنے بیٹوں پر نگہبان (مراقب) رہتی ہے کیونکہ وہ ان کی پرورش کرنے والی ہے۔ اور اس کے لیے ان پر مامتا کی شفقت ہوتی ہے اور وہ ان کے بارے میں محتاط رہتی ہے کہ کہیں اس کی سوکن یعنی آخرت ان پر اثر انداز نہ ہو جائے اور وہ اس کی طرف مائل ہو جائیں۔ پس وہ انہیں آخرت کی بھلائی کے مشاہدے سے محفوظ رکھتی ہے، اور ان کے حالات پر اس کا مراقبہ (المراقبة) سخت ہو جاتا ہے۔\n\n[دنیا کیا ہے؟ وہ پہلی منزل جو ہمارے قریب ہے، ہم پر نگہبان اور ہم پر رحم کرنے والی ہے]\n\nپھر تمہیں معلوم ہونا چاہیے کہ دنیا وہ پہلی منزل ہے جو ہمارے قریب ہے۔ ہم اسی میں پروان چڑھے اور اس کے سوا کچھ نہیں دیکھا۔ پس یہ مشہود (دیکھی ہوئی) ہے، اور یہ ہم پر نگہبان (حفیظہ) اور ہم پر رحم کرنے والی ہے۔ اسی میں ہم نے اللہ کے قریب کرنے والے اعمال کیے، اور اسی میں اللہ کی شریعتیں ظاہر ہوئیں۔ اور یہ وہ منزل ہے جو تمام الٰہی اسماء کو جمع کرنے والی ہے۔ پس اس میں جنت کی نعمتیں اور دوزخ کے دکھ ظاہر ہوئے۔ پس اس میں عافیت اور بیماری ہے، اس میں خوشی اور غم ہے، اس میں راز اور اعلان ہے۔ اور آخرت میں کوئی امر ایسا نہیں مگر اس میں اس کی مثال موجود ہے۔ اور یہ اللہ کی فرمانبردار امانت دار ہے، اللہ نے اس میں اپنے بندوں کے لیے امانتیں رکھی ہیں تاکہ وہ انہیں ان تک پہنچا دے۔ اور یہی وہ چیز ہے جس نے اسے اپنے بیٹوں کے حالات پر نگہبان (مراقب) بنا دیا ہے کہ وہ ان امانتوں کے ساتھ کیا کرتے ہیں جو اس نے انہیں پہنچائی ہیں؟ کیا وہ ہر امانت کے ساتھ اس کے شایانِ شان سلوک کرتے ہیں جس کے لیے وہ رکھی گئی تھی؟ پس ان میں سے کچھ امانتیں ایسی ہیں جو بیٹوں کے نفوس کی غرض کے موافق ہوتی ہیں، تو وہ ان پر نگہبان (مراقب) رہتی ہے کہ کیا وہ اس پر اللہ کا شکر ادا کرتے ہیں جو اس نے اس کے ہاتھوں انہیں عطا کیا؟ اور ان میں سے کچھ امانتیں ایسی ہیں جو ان کی اغراض کے موافق نہیں ہوتیں، تو وہ ان کے حالات پر نگہبان (مراقب) رہتی ہے کہ کیا وہ انہیں اللہ کی طرف سے تحفہ سمجھ کر رضامندی اور تسلیم کے ساتھ قبول کرتے ہیں؟ پس وہ پہلی صورت میں کہتے ہیں: \"الحمد لله المنعم المفضل\" (تمام تعریفیں اللہ کے لیے ہیں جو انعام کرنے والا اور فضل کرنے والا ہے)، اور جو ان کی غرض کے موافق نہیں ہوتا اس میں کہتے ہیں: \"الحمد لله على كل حال\" (ہر حال میں اللہ کے لیے تعریف ہے)۔ پس وہ خوشحالی اور تنگی دونوں میں حمد کرنے والوں میں سے ہوتے ہیں۔ تب دنیا انہیں یہ امانتیں پاک صاف اور آلودگی سے مبرا ہو کر دیتی ہے۔\n\n[دنیا کے بیٹوں کے مزاج: دنیا پانی کے لیے زمین کے ٹکڑوں کی مانند ہے اور غذا کے لیے برتنوں کی مانند ہے]\n\nپس بیٹوں کے بعض مزاج ایسے ہیں جو پانی کے لیے زمین کے ٹکڑوں کی مانند ہیں اور غذا کے لیے برتنوں کی مانند ہیں، پس اس ٹکڑے کا مزاج پانی پر اثر انداز ہوتا ہے۔ کیونکہ پانی اپنی اصل میں سارا کا سارا پاکیزہ اور میٹھا ہوتا ہے، جو کہ بارش ہے۔ پس جب وہ زمین کے ٹکڑوں میں پڑتا ہے، اور یہ ٹکڑے مزاج میں مختلف ہوتے ہیں، تو میٹھا پانی اچھے مزاج والے ٹکڑے میں ظاہر ہوتا ہے، پس وہ اسے اس کی اصل پر باقی رکھتا ہے جیسا کہ وہ پاک صاف آیا تھا، اور اپنے مزاج سے اس میں مزید پاکیزگی اور مٹھاس کا اضافہ کرتا ہے، اور وہ \"آبِ نمیر\" (شیریں پانی) ہے۔ اور ایک دوسرا ٹکڑا اسے کھارا اور کڑوا بنا دیتا ہے، اور ایک اور ٹکڑا اسے کڑوا زہر بنا دیتا ہے۔ پس ان برتنوں نے پاکیزہ حال پر اثر ڈالا۔ اور شریعت کا تعلق بیٹوں کے افعال سے ہے نہ کہ ماں سے، بلکہ اس نے کہا: \"وَبِالْوَالِدَيْنِ إِحْسَانًا\" (اور والدین کے ساتھ احسان کرو)۔ اور اس نے کہا: \"فَلَا تَقُلْ لَهُمَا أُفٍّ وَلَا تَنْهَرْهُمَا وَقُلْ لَهُمَا قَوْلًا كَرِيمًا\" (پس انہیں اُف بھی نہ کہو اور نہ انہیں جھڑکو، اور ان سے نرم بات کہو)۔ اور \"وَاخْفِضْ لَهُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحْمَةِ وَقُلْ رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا\" (اور ان کے لیے عاجزی کا بازو رحمت سے جھکا دو اور کہو: اے میرے رب! ان دونوں پر رحم فرما جیسا کہ انہوں نے مجھے بچپن میں پالا)۔ پس اللہ تعالیٰ نے ان امور کی وصیت صرف اس لیے کی کہ وہ جانتا تھا کہ بیٹوں میں سے ایسے لوگ ہوں گے جن سے ایسے افعال سرزد ہوں گے۔ پس اس نے انہیں حکم دیا کہ وہ اپنے افعال میں ان احکام کا مراقبہ (المراقبة) کریں تاکہ وہ ان میں سے وہی لائیں جس کا اللہ نے انہیں حکم دیا ہے۔ اور دنیا ان پر شفیق ہے، بہت زیادہ مہربان ہے، بہت زیادہ شفقت کرنے والی ہے، اس خوف سے کہ کہیں اس کی سوکن یعنی آخرت انہیں اس سے چھین نہ لے۔ کیونکہ اس وقت یہ گھر دنیا کا ہے اور حکم اسی کا ہے۔ اور اسے اس سے الگ نہیں کیا جانا چاہیے، جیسا کہ جب لوگ آخرت کی طرف منتقل ہو جاتے ہیں تو دنیا کا گھر اس میں مداخلت نہیں کرتا۔ پس دنیا حکم میں آخرت سے زیادہ منصف ہے، کیونکہ وہ اپنی سلطنت کے گھر میں ہے۔ اور جب آخرت آتی ہے اور اس کا دن ہوتا ہے تو دنیا نہ تو اعتراض کرتی ہے اور نہ ہی آخرت سے مقابلہ کرتی ہے۔ پس لوگوں میں سے کسی نے بھی انصاف نہیں کیا۔\n\n[کسی نے دنیا کے ساتھ انصاف نہیں کیا، اس میں برائی کرنے والے کی برائی کی وجہ سے اس کی مذمت کی گئی اور اس میں احسان کرنے والے کے احسان کی وجہ سے اس کی تعریف نہیں کی گئی]\n\nقتادہ نے کہا: \"کسی نے دنیا کے ساتھ انصاف نہیں کیا، اس میں برائی کرنے والے کی برائی کی وجہ سے اس کی مذمت کی گئی اور اس میں احسان کرنے والے کے احسان کی وجہ سے اس کی تعریف نہیں کی گئی\"۔ پس اگر وہ بذاتِ خود قباحت اور برائی دیتی، تو اس میں کوئی نبی مرسل یا کوئی نیک بندہ موجود نہ ہو سکتا تھا۔ کیسے؟ جبکہ اللہ نے اسے اطاعت گزار قرار دیا، پس اس نے فرمایا کہ اس کے بالا اور اسفل نے کہا: \"أَتَيْنَا طَائِعِينَ\" (ہم فرمانبردار ہو کر آئے)۔ اور اس نے فرمایا: \"أَنَّ الْأَرْضَ يَرِثُهَا عِبَادِيَ الصَّالِحُونَ\" (بیشک زمین کے وارث میرے نیک بندے ہوں گے)۔ اور نیک بندہ صرف نیک مال کا وارث ہوتا ہے جس میں اسے تصرف کی اجازت ہو۔ کیونکہ وہ نیک بندہ ہے۔ اور یہ نہیں فرمایا کہ تمام بندے اس کے وارث ہوں گے۔ پس اس سے معلوم ہوا کہ اس کا ترکہ ایک نیک کمائی تھی، پس اللہ کے نیک بندے اس کے وارث ہوئے۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"جب تم میں سے کوئی کہتا ہے کہ اللہ دنیا پر لعنت کرے، تو دنیا کہتی ہے: اللہ اس پر لعنت کرے جو اپنے رب کا سب سے زیادہ نافرمان ہے۔\"\n\nپس یہ اس کا نافرمان بیٹا ہے، اس نے کیسے اس پر لعنت کی اور اس کا نام لے کر صراحت کی۔ اور دنیا نے اپنے بیٹوں پر شفقت کی وجہ سے اپنے بیٹے پر لعنت نہیں کر سکی، بلکہ اس نے کہا: \"اللہ اس پر لعنت کرے جو اپنے رب کا سب سے زیادہ نافرمان ہے،\" اور وہ اس کا نام لے کر پکار نہیں سکی۔ پس یہ ماں کی شفقت اور اپنے بیٹے پر مہربانی ہے۔\n\n[دنیا مومن کی بہترین سواری ہے، جس پر وہ بھلائی کو پہنچتا ہے اور جس کے ذریعے وہ برائی سے نجات پاتا ہے]\n\nپس ہم پر تعجب ہے کہ ہم نے اس پر عمل نہیں کیا جس کا اللہ نے ہمیں اس کی اطاعت میں حکم دیا، اور نہ ہی ہم نے اس ماں کے اخلاق اور ہم پر اس کی شفقت اور محبت کا حق ادا کیا جو ہم نے دیکھی۔ اور نبی صلی اللہ علیہ وسلم نے فرمایا: \"دنیا مومن کی بہترین سواری ہے، جس پر وہ بھلائی کو پہنچتا ہے اور جس کے ذریعے وہ برائی سے نجات پاتا ہے۔\"\n\nپس آپ صلی اللہ علیہ وسلم نے اس کی صفت بیان کی کہ اس کا اپنے بیٹوں پر احتیاط انہیں برائیوں سے یاد دلاتی ہے اور انہیں ان سے بھگا لے جاتی ہے، اور ان کے لیے بھلائی کو مزین کرتی ہے اور انہیں اس کی طرف راغب کرتی ہے۔ پس وہ انہیں سفر کراتی ہے اور انہیں برائی کے مقام سے بھلائی کے مقام تک لے جاتی ہے۔ اور یہ اس کے شدید مراقبہ (المراقبة) کی وجہ سے ہے ان الٰہی احکام پر جو اس میں نازل کیے گئے ہیں جنہیں شرائع کہا جاتا ہے۔ پس وہ چاہتی ہے کہ اس کے بیٹے ان پر عمل کریں تاکہ وہ کامیاب ہو جائیں۔ پس آپ صلی اللہ علیہ وسلم نے اسے بہترین صفات سے متصف کیا اور اسے خیرات کا محل قرار دیا۔ پس اہلِ مراقبہ (المراقبة) کے لیے ضروری ہے کہ وہ اس صفت کو حاصل کرنے کے لیے اپنے داخلے کا آغاز اپنی ماں کے حالات کا مراقبہ (المراقبة) کرنے سے کریں، کیونکہ بچہ اپنی آنکھیں صرف اپنی ماں پر کھولتا ہے، پس وہ اس کے سوا کسی کو نہیں دیکھتا۔ پس وہ طبعاً اس سے محبت کرتا ہے اور اپنے باپ کی نسبت اس کی طرف زیادہ مائل ہوتا ہے، کیونکہ وہ صرف اسی کو سمجھتا ہے جو اس کی پرورش کرتا ہے۔ اور اس کے افعال کی پیروی کرنا چاہیے۔\n\n[دنیا آخرت سے کیوں حسد کرتی ہے؟]\n\nاگر تم کہو کہ وہ آخرت سے کیوں حسد کرتی ہے؟ تو ہم کہیں گے: چونکہ حکم اسی کا ہے اور وہ اطاعت میں اس مقام پر ہے، اور آخرت کا یہاں کوئی اختیار نہیں ہے۔ اور جو کچھ آخرت میں ہے وہ لذات اور آلام کی صورت میں دنیا میں بھی موجود ہے۔ پس دونوں منزلیں برابر ہیں۔ لہٰذا اس پر یہ بات گراں گزرتی ہے کہ اس کے بیٹوں کی نسبت آخرت کی طرف کی جائے، حالانکہ اس نے انہیں جنم نہیں دیا اور نہ ہی ان کی پرورش میں مشقت اٹھائی۔ اور اس سب کے بعد، لوگوں نے ان شرور کے حالات کو جو شارع نے مقرر کیے ہیں، دنیا کی طرف منسوب کر دیا، حالانکہ وہ ان کے اپنے حالات ہیں، دنیا کے حالات نہیں۔ کیونکہ شر مکلف کا فعل ہے، دنیا کا نہیں۔ اور انہوں نے ان خیر کے حالات اور اللہ کی رضا کو جو شارع نے مقرر کیے ہیں، آخرت کی طرف منسوب کر دیا، حالانکہ وہ ان کے اپنے حالات ہیں، آخرت کے حالات نہیں۔ کیونکہ خیر مکلف کا فعل ہے، آخرت کا نہیں۔ پس دنیا کو اس مصیبت کا اجر ملے گا جو اسے اپنے بیٹوں میں اور اپنے بیٹوں کی طرف سے پہنچی ہے۔ پس جس نے دنیا کو اس مقام پر پہچانا، اس نے اسے پہچانا۔ اور جس نے اسے اس مقام پر نہیں پہچانا اور اس سے ناواقف رہا، باوجود اس کے کہ وہ اس میں ہے اور شرعاً و عقلاً اس کے حالات کا مشاہدہ کر رہا ہے، تو وہ آخرت سے زیادہ ناواقف ہے، کیونکہ اس نے اس کا ذائقہ نہیں چکھا۔\n\n[وہ غلطی جو اہلِ طریق کو ان کے کشف (الکشف) میں پیش آتی ہے]\n\nاور یہاں اہلِ طریق اللہ کو ان کے کشف (الکشف) میں ایک غلطی پیش آتی ہے۔ جب وہ اس دنیا میں یقین کی حالت میں ہوتے ہیں اور انہیں آخرت کے حالات دکھائے جاتے ہیں، تو وہ حقیقت میں آخرت نہیں ہوتی، بلکہ وہ دنیا ہی ہوتی ہے جسے اللہ نے ان کے لیے عالمِ برزخ میں کشف (الکشف) کی آنکھ سے یا نیند میں اس صورت میں ظاہر کیا ہے جسے وہ بیداری میں نہیں جان پائے۔ کیونکہ وہ اس سے واقف نہیں ہیں جو ہم نے بیان کیا ہے۔ پس وہ کہتے ہیں: \"ہم نے جنت اور دوزخ اور قیامت دیکھی،\" اور وہ اس رؤیا کا ذکر کرتے ہیں جو انہوں نے دیکھی۔ اور کہاں ایک گھر دوسرے گھر کے برابر ہے؟ اور کہاں ایک وسعت دوسری وسعت کے برابر ہے؟ پس جو کچھ انہوں نے دیکھا وہ دنیا کا حال ہے جسے اللہ نے خیر، اطاعت، حکومت میں عدل، نصیحت اور تذکرہ پر پیدا کیا ہے۔\n\n[دنیا کی قیامت، اس کی جنت اور اس کی دوزخ]\n\nکیونکہ یہ معلوم ہے کہ قیامت ابھی موجود نہیں ہے۔ پس جب وہ دنیا کی زندگی میں دیکھی جاتی ہے، تو وہ دنیا کی قیامت، دنیا کی جنت اور دنیا کی دوزخ کے سوا کچھ نہیں۔ اور جنت اور دوزخ دنیا کی خادمہ بن کر آئی ہیں۔\n\nکیونکہ نبی صلی اللہ علیہ وسلم کو کسوف کی نماز میں دکھایا گیا، آپ قبلے کی طرف آگے بڑھے، پھر بہت پیچھے ہٹے، اور جب آگے بڑھے تو اپنا ہاتھ بڑھایا۔ جب آپ سے اس بارے میں پوچھا گیا تو آپ نے فرمایا: \"میں نے دوزخ کو دیکھا جب تم نے مجھے پیچھے ہٹتے ہوئے دیکھا، اس خوف سے کہ کہیں اس کی لپٹ مجھے نہ لگ جائے، اور میں نے جنت کو دیکھا جب میں آگے بڑھا اور جب میں نے اپنا ہاتھ بڑھایا تاکہ اس میں سے ایک خوشہ توڑ لوں۔ اگر میں اسے تمہارے پاس لے آتا تو تم اسے کھاتے جب تک تم باقی رہتے۔\" اور آپ نے ذکر کیا کہ آپ نے دوزخ میں بلی والی عورت کو اور عمرو بن لُحَی کو دیکھا جس نے سائبہ (آزاد چھوڑے ہوئے جانور) کو آزاد کیا تھا۔\n\nاور یہ سب کچھ آپ کی بیداری میں نماز کی حالت میں تھا۔ اور آپ نے یہ نہیں فرمایا کہ میں نے آخرت کو دیکھا، نہ آخرت کی جنت کو اور نہ اس کی دوزخ کو، بلکہ آپ نے فرمایا: \"اس دیوار کے عرض میں\"۔ اور دیوار دنیا کے گھر کا حصہ ہے۔ اور اسی لیے\n\nآپ صلی اللہ علیہ وسلم نے فرمایا: \"میرے لیے جنت کو دیوار کے عرض میں مثال دی گئی\"۔\n\nاور یہ نہیں فرمایا کہ وہ وہی ہے۔ اور آپ نے فرمایا: \"میں نے جنت کو دیکھا\" اور اس کی صفت بیان نہیں کی، اور تمثیل کا ذکر کیا۔ اور کسی چیز کی تمثیل اس چیز کی عین نہیں ہوتی، بلکہ وہ اس کی مشابہت ہوتی ہے۔ اور آپ نے فرمایا: \"میرے لیے مثال دی گئی\" جیسا کہ آپ نے جبرائیل علیہ السلام کے بارے میں فرمایا: \"فَتَمَثَّلَ لَهَا بَشَرًا سَوِيًّا\" (پس وہ اس کے سامنے ایک مکمل انسان کی صورت میں ظاہر ہوا)۔ کیا تم سمجھتے ہو کہ وہ جبرائیل کے علاوہ کوئی اور تھا؟ نہیں، اللہ کی قسم! وہ صرف جبرائیل تھا۔ پس آپ نے ان دونوں کو دنیا میں، اس کے گھر اور اس کی زندگی میں ہی دیکھا۔ اور اللہ نے اپنی تعریف کرتے ہوئے فرمایا: \"وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ\" (اور آسمانوں اور زمین کی بادشاہت اللہ ہی کے لیے ہے)، اور یہ دونوں دنیا کے گھر کے لیے ہیں۔\n\n[وہ زیادتی جو دنیا کو آخرت پر حاصل ہے]\n\nاور ہم یہ طے کر چکے ہیں کہ جو کچھ آخرت میں ہے وہ سب دنیا میں موجود ہے، پس اس میں سے کچھ ہم نے جان لیا ہے اور کچھ نہیں جانا۔ بلکہ دنیا میں وہ زیادتی ہے جو آخرت میں نہیں ہے۔ پس دنیا نشأت (پیدائش) میں زیادہ کامل (أكمل) ہے۔ اور اگر تکلیف (مکلف ہونا) اور تمام اغراض کا حاصل نہ ہونا نہ ہوتا، تو آخرت اس کا وزن نہ کر پاتی۔ اگر تم کہو کہ وہ کون سی زیادتی ہے جو دنیا کو آخرت پر حاصل ہے؟ تو ہم کہیں گے: آخرت تمییز (امتیاز) کا گھر ہے، جبکہ دنیا کا گھر تمییز اور اختلاط (ملاوٹ) کا گھر ہے۔ پس اہلِ دوزخ ممتاز ہیں اور اہلِ جنت ممتاز ہیں۔ پس اہلِ جنت جنت میں ہیں اور اہلِ دوزخ دوزخ میں ہیں۔ \"يَعْرِفُونَ كُلًّا بِسِيمَاهُمْ\" (وہ ہر ایک کو ان کی نشانیوں سے پہچانیں گے)۔ اور دنیا کے گھر میں وہ تمییز ہے جو آخرت میں ہے، لیکن یہ عام نہیں ہے۔ کیونکہ ہم نے دنیا میں اللہ کے بتانے سے جان لیا ہے کہ رسول اور انبیاء اور جنہیں رسولوں نے خوشخبری دی ہے، وہ سعید (خوش بخت) ہیں۔ اللہ فرماتا ہے: \"لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ\" (ان کے لیے دنیا کی زندگی میں اور آخرت میں خوشخبری ہے)۔ پس یہ دنیا کا عموم ہے۔ پس اہلِ سعادت میں سے کوئی بھی آخرت کی طرف منتقل نہیں ہوتا جب تک کہ اسے دنیا میں خوشخبری نہ دے دی جائے، خواہ ایک ہی نفس ہو۔ پس مقصود حاصل ہو جاتا ہے۔ اور جنہیں رسولوں نے خوشخبری دی ہے کہ وہ شقی (بد بخت) ہیں، وہ شقاوت کے ساتھ ممتاز ہو چکے ہیں۔ اللہ سبحانہ فرماتا ہے: \"فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ\" (پس انہیں دردناک عذاب کی خوشخبری دو)۔ اور اس نے اکثر لوگوں کے بارے میں خاموشی اختیار کی، ان میں سے کسی کو متعین نہیں کیا۔ اور آخرت میں اشقیاء کی صفات اس دنیا میں سعداء پر ظاہر ہوئیں، جیسے غم، بلا، رونا، ذلت اور خشوع۔ اور آخرت میں سعداء کی صفات اس دنیا میں اہلِ دوزخ میں سے اشقیاء پر ظاہر ہوئیں، جیسے خیر، نعمت، تفریح، اغراض کے حصول تک رسائی، اور احکام کا نفاذ۔ کیونکہ یہ نشأت (پیدائش) یہ تقاضا کرتی ہے کہ اسے ان صفات میں سے حصہ اور نصیب حاصل ہو۔ پس ان میں سے کچھ ایسے ہیں جن کے لیے یہ سب ایک ہی گھر میں جمع ہو جاتا ہے، اور کچھ ایسے ہیں جن کے لیے یہ دونوں گھروں میں ہوتا ہے۔ پس مومن کافر کی صفت کے ساتھ ظاہر ہوتا ہے یہاں تک کہ اس کا خاتمہ ایمان پر ہوتا ہے، اور کافر مومن کی صفت کے ساتھ ظاہر ہوتا ہے یہاں تک کہ اس کا خاتمہ کفر پر ہوتا ہے۔ پھر اللہ نے سعید اور شقی کو ایمان اور کفر کے اطلاق میں شریک کر دیا ہے، اور یہ دونوں الفاظ معلوم ہیں۔ پس اکثر لوگ ایمان کا اطلاق صرف اللہ پر ایمان لانے والے پر کرتے ہیں اور کافر کا اطلاق صرف اللہ کا انکار کرنے والے پر کرتے ہیں۔ جبکہ اللہ فرماتا ہے: \"وَالَّذِينَ آمَنُوا بِالْبَاطِلِ\" (اور وہ لوگ جو باطل پر ایمان لائے)، پس اس نے انہیں مومن کہا، اور \"وَكَفَرُوا بِاللَّهِ\" (اور انہوں نے اللہ کا انکار کیا)۔ پس دنیا نے وہ کچھ دیا جو آخرت نے دیا، اور یہ وہ زیادتی ہے جو آخرت میں نہیں ہوگی۔ اور تشریع (قانون سازی) آخرت میں نہیں ہوگی، سوائے ایک مقام کے، جب \"يُدْعَوْنَ إِلَى السُّجُودِ\" (انہیں سجدہ کرنے کے لیے بلایا جائے گا)، تاکہ اس سجدے سے اصحابِ اعراف کا میزان بھاری ہو جائے، اور لوگ اس سے بے خبر ہیں۔\n\n[انسان میں ذات حق (الحق) کا وجود دنیا میں آخرت کی نسبت زیادہ کامل ہے]\n\nاور جو کچھ ہم نے بیان کیا ہے، اس کی بنا پر بعض اہلِ اللہ کہتے ہیں—اور میں اللہ پر کسی کو پاک نہیں ٹھہراتا—کہ انسان میں ذات حق (الحق) کا وجود (الوجود) دنیا میں آخرت کی نسبت زیادہ کامل (أكمل) ہے۔ اور ہم نے ایسے لوگوں کو دیکھا ہے جو اس طرف گئے اور ہم نے مجالس میں ان سے براہِ راست بات کی، اور انہوں نے اپنی دلیل خلافت کو بنایا۔ پس انسان دنیا میں اسمائی صفات میں آخرت کی نسبت بلا شک زیادہ کامل (أكمل) ہے، کیونکہ وہ انعام اور انتقام دونوں کے ساتھ ظاہر ہوتا ہے، اور آخرت میں اس کے لیے یہ نہیں ہوگا۔ کیونکہ وہ کسی پر انعام نہیں کرے گا اور نہ ہی انتقام لے گا، اور اگر وہ شفاعت کرے گا تو اجازت سے۔ پس انعام اس کے لیے ہے جسے اجازت دی گئی ہو۔ اور جہاں تک جنت اور دوزخ کا تعلق ہے، موت کو ذبح کرنے کے بعد، تو وہاں نہیں، بلکہ قیامت میں اس کا ایک حصہ انتقام کا ہوگا، ایک حکمت کی بنا پر جسے ہم نے اس کتاب میں ذکر کیا ہے، جیسا کہ\n\nآپ صلی اللہ علیہ وسلم کا قول: \"پس دوری ہو، دوری ہو\" (فسحقاً سحقاً)۔\n\nپس اے اللہ کے بندو! یہاں اللہ کا مراقبہ (المراقبة) کرو، دنیا کے اپنے بیٹوں کے مراقبہ (المراقبة) کی طرح، کیونکہ وہ نگہبان ماں (الأم الرقوب) ہے۔ اور اپنی ماں کے اخلاق پر رہو تاکہ تم کامیاب ہو جاؤ۔",
    "fa": "باب صد و بیست و ششم در معرفت مقام مراقبه\n\nدر هر کاری مراقب او باش، زیرا او سبحانه بر تو مراقب است.\nدر حضور و غیبت امور، از این رو مرا در هر حالی نصیبی است.\nپس چون زمان فراغت فرا رسد، باکی ندارم، و این شگفتی است.\n\n### مراقبه هستی (الوجود): مراقبه حق (الحق) بر خلقش برای حفظ هستی (الوجود) بر آنان\n\nمراقبه صفتی الهی است که ما را در آن بهره‌ای است. خداوند متعال می‌فرماید: (وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ رَقِيبًا) [و خداوند بر هر چیزی مراقب است]. و این همان قول اوست: (وَلَا يَئُودُهُ حِفْظُهُمَا) [و نگهداری آن دو (آسمان‌ها و زمین) او را خسته نمی‌کند]؛ یعنی آسمان‌ها که عالم بالا است و زمین که عالم پایین است، و جز بالا و پایین چیزی نیست. و این عالم بر دو قسم است: عالمی که قائم به ذات خود است و عالمی که قائم به ذات خود نیست. آنچه قائم به ذات خود است، جواهر و اجسام هستند، و آنچه قائم به ذات خود نیست، کَوْن‌ها و رنگ‌ها هستند که همان صفات و اعراض می‌باشند.\n\nپس عالم اجسام و جواهر بقایی ندارند مگر با ایجاد اعراض در آن‌ها. هرگاه عرضی که بقا و هستی آن‌ها به آن است، در آن‌ها ایجاد نشود، معدوم می‌شوند. و شکی نیست که اعراض در زمان دوم از زمان وجودشان معدوم می‌گردند. پس حق (الحق) پیوسته مراقب عالم اجسام و جواهر علوی و سفلی است؛ هرگاه عرضی که وجود آن‌ها به آن است، از آن‌ها معدوم شود، در همان زمان عرضی مانند آن یا ضد آن را خلق می‌کند تا به وسیله آن، آن‌ها را در هر زمانی از نیستی حفظ کند. پس او پیوسته خلاق است و عالم نیز پیوسته به او تعالی نیازمند است، نیازمندی ذاتی از جهت عالم اعراض و جواهر. این است مراقبه حق (الحق) بر خلقش برای حفظ هستی (الوجود) بر آنان. و این‌ها همان شئونی هستند که در کتابش از آن‌ها تعبیر کرده است: (إِنَّهُ كُلَّ يَوْمٍ فِي شَأْنٍ) [او هر روز در کاری است].\n\n### مراقبه کمال هستی (الوجود): مراقبه حق (الحق) بر بندگانش در آنچه مکلفشان کرده و حدودی که برایشان تعیین نموده است\n\nو مراقبه دیگری برای حق (الحق) در مورد بندگانش وجود دارد، و آن نظر او به ایشان است در آنچه از اوامر و نواهی مکلفشان کرده و حدودی که برایشان تعیین نموده است. این مراقبه، مراقبه کبریا و تهدید است. پس بر برخی از آنان کسانی را گماشته است که تمام کارهایشان را ثبت می‌کنند، مانند این قول او: (مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ) [هیچ سخنی بر زبان نمی‌آورد مگر اینکه نزد او نگهبانی آماده است] و مانند این قول او: (كِرَامًا كَاتِبِينَ * يَعْلَمُونَ مَا تَفْعَلُونَ) [نویسندگانی بزرگوار که می‌دانند چه می‌کنید] و قول او: (سَنَكْتُبُ مَا قَالُوا وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ فِي إِمَامٍ مُبِينٍ) [آنچه را گفتند خواهیم نوشت و هر چیزی را در لوح محفوظ (امام مبین) برشمرده‌ایم] و (وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ) [و خداوند از آنچه می‌کنید غافل نیست]. پس این مراقبه حق (الحق) است.\n\n### مراقبه‌ای که از بنده صحیح نیست\n\nاما مراقبه بنده بر سه قسم است؛ یکی از آن‌ها صحیح نیست و دو قسم دیگر وجودشان از بنده صحیح است. اما مراقبه‌ای که صحیح نیست، مراقبه بنده بر پروردگارش است در حالی که ذات او و نسبت او به عالم را نمی‌داند. وجود این مراقبه قابل تصور نیست، زیرا متوقف بر علم به ذات مراقَب (با فتح قاف) است. اما گروه دیگری صحت این مراقبه را پذیرفته‌اند، زیرا شرع آن را به گونه‌ای که شایسته جلال اوست، محدود کرده است. پس او هر کجا که باشیم با ماست و (عَلَى الْعَرْشِ اسْتَوَى) [بر عرش استیلا یافت] و در زمین است و راز و آشکار ما را می‌داند و در آسمان نیز چنین است و به سوی آن فرود می‌آید. و او در عین هر مظهر از ممکنات، ظاهر است. ما این مقدار از او را دانسته‌ایم، پس بر این حد او را مراقبه می‌کنیم. بنابراین، مراقبه ما بر اشیاء، عین مراقبه ما بر اوست، زیرا او از هر چیزی ظاهر است. پس برخی از مردم گفته‌اند: «چیزی را ندیدم مگر اینکه خدا را قبل از آن دیدم» (یعنی مراقبه) و دیگری گفته: «بعد از آن»، و دیگری: «همراه آن»، یا دیگری: «در آن». چنین کسانی این مراقبه را صحیح می‌دانند.\n\n### مراقبه حیا\n\nو مراقبه دوم، مراقبه حیا است، برگرفته از این قول او: (أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَى) [آیا ندانسته که خداوند می‌بیند؟]. پس او مراقب دیدن حق (الحق) است و دیدن حق (الحق) نیز او را مراقب است. بنابراین، او مراقبه حق (الحق) بر خود را مراقبه می‌کند. این همان مراقبهِ مراقبه است و مشروع می‌باشد.\n\n### مراقبه بنده بر قلب و نفس خود\n\nو مراقبه سوم این است که بنده قلب و نفس ظاهر و باطن خود را مراقبه کند تا آثار پروردگارش را در آن‌ها ببیند و بر اساس آنچه از آثار پروردگارش می‌بیند، عمل کند. همچنین در موجودات خارج از خود نیز آن‌ها را مراقبه می‌کند تا آثار پروردگارش را در آن‌ها ببیند. و این همان قول اوست: (سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ) [به زودی آیات خود را در آفاق و در خودشان به آنان نشان خواهیم داد]. و این مراقبه به حق (الحق) تعلق دارد، زیرا فاعلی جز حق (الحق) نیست.\n\n### مراقبه، دوام رعایت موازین شرعی پنج‌گانه است\n\nو مراقبه، دوام رعایت است به گونه‌ای که هیچ زمانی فاصله نیندازد که بنده در آن مراقب نباشد. پس این را بدان و به حقیقت آن برس تا شئون پروردگارت را در خودت، و آنچه چشمت از موجودات درک می‌کند، و آنچه فکر و عقلت به آن می‌رسد، و آنچه در شهودت به تو شهادت می‌دهد، و آنچه از غیوب در کَوْن خود یا هر جای دیگر بر آن مطلع می‌شوی، بشناسی. و از اینجاست که خواطر خود را می‌شناسی. و برای مراقبه، موازین شرعی آمده‌اند که پنج میزان هستند: فرض، ندب (مستحب)، اباحه (مباح)، حظر (حرام) و کراهت (مکروه).\n\n### درجات مراقبه نزد عارفان\n\nو مراقبه نزد ارباب اُنس و وصال از عارفان درجاتی دارد که به هفتصد و هفتاد و چهار درجه می‌رسد. و نزد ارباب ادب از عارفان، سیصد و هفتاد و نه درجه است. و نزد ملامیه از اهل اُنس، هفتصد و چهل و سه درجه است. و نزد ادبای آنان، سیصد و چهل و هشت درجه است. و برای آن نسبت‌هایی به عوالم وجود دارد؛ از جمله دو نسبت به عالم مُلک، و یک نسبت به عالم ملکوت نزد ادبای هر دو طایفه، و سه نسبت نزد اهل اُنس به عالم جبروت.\n\n### واقعه برزخی که در شب نگارش این باب برای ابن عربی رخ داد\n\nو بدانید که خداوند متعال در شبی که این باب را می‌نوشتم، مرا بر امری آگاه ساخت که پیش از آن در واقعه‌ای برزخی که برایم رخ داد، نداشتم. در آن واقعه به من گفته شد: «آیا نشنیده‌ای که دنیا مادری مراقب (أم رقوب) است؟» گفتم: «بله.» گفته شد: «پس فصلی برای آن در این باب قرار ده.» پس برای این کار از خداوند طلب خیر کردم.\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمودند: «دنیا فرزندانی دارد.»\n\nو چون دنیا فرزندانی دارد، پس مادر این فرزندان است. و از عادت مادر این است که مراقب فرزندانش باشد، زیرا او تربیت‌کننده آن‌هاست و نسبت به آن‌ها شفقت مادری دارد و بر حذر است که مبادا ضره‌اش (هوویش) که آخرت است، در آن‌ها تأثیر بگذارد و به سوی آن متمایل شوند. پس دنیا آن‌ها را از مشاهده خیر آخرت حفظ می‌کند و مراقبتش بر احوال آنان شدید می‌شود.\n\n### آیا دنیا سرای اول است؟ سرای نزدیک به ما، نگهبان ما، و مهربان بر ما\n\nسپس بدانید که دنیا سرای اول و نزدیک به ماست. در آن نشأت گرفته‌ایم و جز آن ندیده‌ایم. پس دنیا مشهود است و نگهبان و مهربان بر ماست. در آن اعمالی را انجام دادیم که ما را به خدا نزدیک می‌کند و در آن شرایع الهی ظاهر شد. و دنیا سرایی است که جامع جمیع اسماء الهی است، پس نعمت‌های بهشت و دردهای آتش در آن ظاهر شده است. در آن عافیت و بیماری، شادی و غم، و پنهان و آشکار وجود دارد. و هیچ امری در آخرت نیست مگر اینکه در دنیا مثالی از آن هست. و دنیا امانتی است که مطیع خداست؛ خداوند امانت‌هایی را نزد آن به ودیعه نهاده تا به بندگانش برساند. و این همان چیزی است که دنیا را واداشته تا مراقب احوال فرزندانش باشد که با آن امانت‌هایی که به آن‌ها داده است، چه می‌کنند؟ آیا با هر امانتی آن‌گونه که شایسته است و برای آن وضع شده، رفتار می‌کنند؟ برخی از این امانات موافق میل نفس فرزندان است، پس دنیا مراقب آن‌هاست که آیا خدا را بر آنچه به دست او به آن‌ها عطا کرده، شکر می‌کنند؟ و برخی از امانات موافق میل آن‌ها نیست، پس دنیا مراقب احوال آن‌هاست که آیا آن‌ها را با رضایت و تسلیم می‌پذیرند، به این دلیل که هدیه‌ای از جانب خداست؟ پس در مورد اول می‌گویند: «الحمد لله المنعم المفضل» (سپاس خدای را که نعمت‌دهنده و فضل‌کننده است) و در مورد آنچه موافق میلشان نیست می‌گویند: «الحمد لله علی کل حال» (سپاس خدای را در هر حال). پس در خوشی و ناخوشی از سپاسگزاران خواهند بود. و دنیا این امانات را پاک و خالص از هر آلودگی به آن‌ها می‌دهد.\n\n### مزاج‌های فرزندان دنیا مانند زمین‌ها برای آب و مانند ظرف‌ها برای غذایی است که در آن‌ها قرار داده می‌شود\n\nپس برخی از مزاج‌های فرزندان که مانند زمین برای آب و ظرف‌ها برای غذایی هستند که در آن‌ها قرار داده می‌شود، مزاج آن زمین در آب تأثیر می‌گذارد. در حالی که آب در اصل خود، که همان باران است، پاک و شیرین است. اما وقتی در زمین‌های مختلف قرار می‌گیرد که مزاج‌های متفاوتی دارند، آب شیرین در زمین با مزاج خوب ظاهر می‌شود و آن را بر اصل خود، همان‌گونه که پاک و تمیز آمده، باقی می‌گذارد و از مزاج خود، پاکی و شیرینی بیشتری بر آنچه بوده، به آن می‌افزاید که همان آب گوارا است. و زمین دیگری آن را شور و تلخ می‌کند، و زمین دیگری آن را تلخ و ناگوار می‌سازد. پس این ظرف‌ها در حال پاک تأثیر گذاشتند. و شریعت تنها به افعال فرزندان تعلق گرفته است، نه به مادر. بلکه فرموده است: (وَبِالْوَالِدَيْنِ إِحْسَانًا) [و به پدر و مادر نیکی کنید] و فرموده است: (فَلَا تَقُلْ لَهُمَا أُفٍّ وَلَا تَنْهَرْهُمَا وَقُلْ لَهُمَا قَوْلًا كَرِيمًا * وَاخْفِضْ لَهُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحْمَةِ وَقُلْ رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا) [پس به آن دو «اُف» مگو و بر سرشان فریاد مزن و با آن‌ها سخنی شایسته بگو * و از سر مهربانی، بال فروتنی را برایشان فرود آور و بگو: پروردگارا، بر آن دو رحمت آور، همان‌گونه که مرا در کودکی تربیت کردند]. خداوند متعال به این امور سفارش نکرده است مگر به دلیل علمش به اینکه از فرزندان کسانی هستند که چنین افعالی از آن‌ها سر می‌زند. پس به آن‌ها امر کرده است که این احکام را در اعمال خود مراقبه کنند تا آنچه را خدا امر کرده، انجام دهند. و دنیا نسبت به آن‌ها مهربان، دلسوز و بسیار با شفقت است و می‌ترسد که ضره‌اش (آخرت) آن‌ها را از او بگیرد. زیرا در این زمان، سرای از آن دنیاست و حکم از آن اوست و نباید از آن برکنار شود، همان‌گونه که سرای آخرت نیز وقتی مردم به آن منتقل می‌شوند، سرای دنیا متعرض آن نمی‌شود. پس دنیا در حکم، منصف‌تر از آخرت است، زیرا در سرای سلطنت خود است و وقتی آخرت بیاید و روز آن فرا رسد، دنیا متعرض و مزاحم آخرت نمی‌شود. پس هیچ کس نسبت به دنیا انصاف نورزیده است.\n\n### هیچ کس نسبت به دنیا انصاف نورزید؛ به خاطر بدی بدکار در آن نکوهش شد و به خاطر نیکی نیکوکار در آن ستایش نشد\n\nقتاده گفت: «هیچ کس نسبت به دنیا انصاف نورزید؛ به خاطر بدی بدکار در آن نکوهش شد و به خاطر نیکی نیکوکار در آن ستایش نشد.» اگر دنیا ذاتاً زشتی و بدی می‌داد، ممکن نبود که در آن پیامبر مرسلی یا بنده صالحی وجود داشته باشد. چگونه چنین باشد در حالی که خداوند آن را به طاعت وصف کرده و فرموده است که بالا و پایین آن گفتند: (أَتَيْنَا طَائِعِينَ) [با میل و رغبت آمدیم]. و فرمود: (أَنَّ الْأَرْضَ يَرِثُهَا عِبَادِيَ الصَّالِحُونَ) [همانا زمین را بندگان صالح من به ارث می‌برند]. و صالح جز مال صالحی را که تصرف در آن برایش جایز است، به ارث نمی‌برد، زیرا او بنده صالح است. و نفرمود که همه بندگان آن را به ارث می‌برند. پس این دلالت می‌کند که میراث آن، کسبی صالح بوده است که بندگان صالح خدا آن را به ارث بردند.\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمودند: «هرگاه یکی از شما بگوید: لعنت خدا بر دنیا، دنیا می‌گوید: لعنت خدا بر کسی که نسبت به پروردگارش نافرمان‌تر است.»\n\nپس این فرزند عاق اوست که چگونه او را لعنت کرده و نامش را صریحاً برده است. اما دنیا از روی شفقتش بر فرزندانش نتوانست فرزند خود را لعنت کند، پس گفت: «لعنت خدا بر کسی که نسبت به پروردگارش نافرمان‌تر است» و نتوانست او را به نام بخواند. این است شفقت و مهربانی مادر بر فرزندش.\n\n### دنیا چه نیکو مرکبی برای مؤمن است که به وسیله آن به خیر می‌رسد و به وسیله آن از شر نجات می‌یابد\n\nو پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمودند: «دنیا چه نیکو مرکبی برای مؤمن است که به وسیله آن به خیر می‌رسد و به وسیله آن از شر نجات می‌یابد.»\n\nپس دنیا را به این وصف کرد که از روی حذرش بر فرزندان، شرور را به یادشان می‌آورد و آن‌ها را از آن شرور دور می‌کند، و خیر را برایشان زینت می‌دهد و مشتاق آن می‌سازد. پس دنیا آن‌ها را به سفر می‌برد و از موطن شر به موطن خیر حمل می‌کند. و این به دلیل شدت مراقبت دنیا نسبت به اوامر الهی نازل شده در آن است که شرایع نامیده می‌شوند. پس دوست دارد که فرزندانش به آن‌ها عمل کنند تا سعادتمند شوند. پس این پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) دنیا را به بهترین صفات وصف کرده و آن را محل خیرات قرار داده است. بنابراین، شایسته است که اهل مراقبه، آغاز ورودشان برای کسب این صفت، مراقبت احوال مادرشان باشد، زیرا کودک چشمانش را جز بر مادرش باز نمی‌کند و جز او را نمی‌بیند. پس طبعاً او را دوست دارد و بیشتر از پدرش به او متمایل می‌شود، زیرا جز کسی که او را تربیت می‌کند، درک نمی‌کند. و باید به افعال او اقتدا شود.\n\n### چرا دنیا به آخرت حسادت می‌ورزد؟\n\nاگر بگویی: «پس چرا دنیا به آخرت حسادت می‌ورزد؟» می‌گوییم: چون حکم از آن دنیاست و او در طاعت در این مرتبه است و آخرت در اینجا سلطانی ندارد، و آنچه در آخرت از لذات و آلام هست، در دنیا نیز هست، پس این دو سرا برابرند. برای دنیا دشوار است که فرزندانش به آخرت نسبت داده شوند، در حالی که او آن‌ها را نزاییده و در تربیتشان زحمت نکشیده است. و پس از همه این‌ها، مردم آنچه از احوال شرور که شارع تعیین کرده است، به دنیا نسبت دادند، در حالی که آن احوال خودشان است، نه احوال دنیا، زیرا شر، فعل مکلف است نه دنیا. و آنچه از احوال خیر و رضایت خدا که شارع تعیین کرده است، به آخرت نسبت دادند، در حالی که آن احوال خودشان است، نه احوال آخرت، زیرا خیر، فعل مکلف است نه آخرت. پس دنیا پاداش مصیبتی را دارد که در مورد فرزندانش و از جانب فرزندانش به او رسیده است. پس هر کس دنیا را با این مرتبه شناخت، آن را شناخته است، و هر کس آن را با این مرتبه نشناخت و نسبت به آن جاهل بود، با وجود اینکه در آن است و احوالش را شرعاً و عقلاً مشاهده می‌کند، پس نسبت به آخرت جاهل‌تر است، زیرا طعم آن را نچشیده است.\n\n### اشتباهی که برای اهل طریقت در کشفشان رخ می‌دهد\n\nو در اینجا اشتباهی برای اهل طریق الله در کشف (الکشف)شان رخ می‌دهد؛ زیرا اگر در این سرا یقین پیدا کنند و بر احوال آخرت مطلع شوند، آن آخرت بر حقیقت خود نیست، بلکه دنیاست که خداوند آن را در عالم برزخ، با چشم کشف (الکشف) یا خواب، در صورتی که در بیداری نسبت به آن جاهل بودند، برایشان ظاهر کرده است. زیرا آن‌ها آنچه را ما ذکر کردیم، از دنیا نمی‌دانند. پس می‌گویند: «بهشت و جهنم و قیامت را دیدیم» و رؤیایی را که دیده‌اند، ذکر می‌کنند. اما کجا سرایی مانند سرای دیگر است؟ و کجا وسعت مانند وسعت دیگر است؟ پس آنچه دیده‌اند، حال دنیاست که خداوند آن را بر خیر، طاعت، عدل در حکومت، نصیحت، موعظه و تذکر خلق کرده است.\n\n### قیامت دنیا و بهشت و آتش آن\n\nزیرا معلوم است که قیامت اکنون موجود نیست. پس اگر در زندگی دنیا دیده شود، چیزی جز قیامت دنیا و بهشت دنیا و آتش دنیا نیست، و بهشت و آتش به عنوان خادمان دنیا آمده‌اند.\n\nزیرا پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمودند (بلکه در نماز کسوف دیده شد) که در قبله خود پیش رفت، سپس بسیار عقب آمد و هنگامی که پیش رفت، دستش را دراز کرد. وقتی از او در این باره سؤال شد، فرمود: «هنگامی که مرا دیدید عقب آمدم، آتش را دیدم و ترسیدم که شعله آن به من برسد. و هنگامی که پیش رفتم، بهشت را دیدم و دستم را دراز کردم تا خوشه‌ای از آن بچینم. اگر آن را برای شما می‌آوردم، تا زمانی که باقی بود از آن می‌خوردید.» و ذکر کرد که در آتش، صاحب گربه و عمرو بن لُحَیّ را که شتران سائبه را رها می‌کرد، دید.\n\nو این همه در حال نماز و در بیداری او بود. و نفرمود که آخرت یا بهشت آخرت یا آتش آن را دیدم، بلکه فرمود: «در عرض این دیوار» و دیوار از سرای دنیاست. و به همین دلیل فرمود: (صَلَّى اللهُ عَليهِ وسَلَّم) «بهشت در عرض دیوار برایم تمثل یافت.» و نگفت که آن خود بهشت است. و فرمود: «بهشت را دیدم» و آن را وصف نکرد و تمثیل را ذکر کرد. و تمثل یافتن شیء، عین آن شیء نیست، بلکه شبیه آن است. و فرمود: «برایم تمثل یافت»، همان‌گونه که در مورد جبرئیل (علیه السلام) فرمود: (فَتَمَثَّلَ لَهَا بَشَرًا سَوِيًّا) [پس به صورت بشری کامل برای او مجسم شد]. آیا گمان می‌کنی غیر از جبرئیل بود؟ نه به خدا، جز جبرئیل نبود. پس پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) آن دو (بهشت و آتش) را ندید مگر در دنیا، در سرای و حیات آن. و خداوند در مقام ستایش فرمود: (وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ) [و فرمانروایی آسمان‌ها و زمین از آن خداست] و این دو (آسمان و زمین) متعلق به سرای دنیا هستند.\n\n### افزایشی که دنیا بر آخرت دارد\n\nو ما مقرر کردیم که هر آنچه در آخرت است، در دنیا نیز هست؛ برخی را شناخته‌ایم و برخی را نشناخته‌ایم. بلکه در دنیا افزایشی هست که در آخرت نیست. پس دنیا در نشأت کامل‌تر است و اگر تکلیف و عدم حصول همه اغراض نبود، آخرت با آن برابری نمی‌کرد. اگر بگویی: «پس آن افزایشی که دنیا بر آخرت دارد چیست؟» می‌گوییم: آخرت سرای تمییز (جداسازی) است، اما سرای دنیا سرای تمییز و اختلاط است. اهل آتش متمایز شده‌اند و اهل بهشت متمایز شده‌اند؛ اهل بهشت در بهشت و اهل آتش در آتش هستند و (يَعْرِفُونَ كُلًّا بِسِيمَاهُمْ) [هر یک را از سیمایشان می‌شناسند]. و سرای دنیا نیز آنچه از تمییز در آخرت هست را دارد، اما فراگیر نیست. زیرا ما در دنیا با اعلام خداوند دانسته‌ایم که رسولان و پیامبران و کسانی که رسولان به سعادتشان بشارت داده‌اند، سعادتمند هستند. خداوند می‌فرماید: (لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ) [برای آنان در زندگی دنیا و در آخرت بشارت است]. این عمومیت دنیاست. پس هیچ یک از اهل سعادت به آخرت منتقل نمی‌شود مگر اینکه در دنیا به او بشارت داده شود، حتی اگر یک نفر باشد، تا مقصود حاصل شود. و کسی که رسولان به شقاوتش بشارت داده‌اند، با شقاوت متمایز شده است. خداوند سبحان می‌فرماید: (فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ) [پس آنان را به عذابی دردناک بشارت ده]. و در مورد بیشتر مردم سکوت کرده و کسی را از آنان تعیین نکرده است. و صفات اشقیا در آخرت، در این سرا بر سعدا ظاهر شده است، مانند حزن، بلا، گریه، خواری و خشوع. و صفات سعدا در آخرت، در این سرا بر اشقیا از اهل آتش ظاهر شده است، مانند خیر، نعمت، تفریح، رسیدن به آرزوها و نفوذ اوامر. زیرا این نشأت اقتضا می‌کند که نصیب و بهره‌ای از این صفات داشته باشد. پس برخی هستند که این صفات در یک سرا برایشان جمع می‌شود و برخی در هر دو سرا برایشان وجود دارد. پس مؤمن به صفت کافر ظاهر می‌شود تا با ایمان برایش ختم شود، و کافر به صفت مؤمن ظاهر می‌شود تا با کفر برایش ختم شود. سپس خداوند، سعید و شقی را در اطلاق ایمان و کفر شریک کرده است. این دو لفظ معلوم هستند، اما بیشتر مردم ایمان را جز بر مؤمن به خدا و کفر را جز بر کافر به خدا اطلاق نمی‌کنند. در حالی که خداوند می‌فرماید: (وَالَّذِينَ آمَنُوا بِالْبَاطِلِ) [و کسانی که به باطل ایمان آوردند]، پس آن‌ها را مؤمن نامیده است، و (وَكَفَرُوا بِاللَّهِ) [و به خدا کفر ورزیدند]. پس دنیا آنچه را آخرت داده، داده است. و این همان افزایشی است که در آخرت نیست. و تشریع در آخرت جز در یک موطن نخواهد بود، آن هنگام که (يُدْعَوْنَ إِلَى السُّجُودِ) [به سجده فرا خوانده می‌شوند] تا با آن سجده، میزان اصحاب اعراف سنگین شود، در حالی که مردم متوجه نیستند.\n\n### وجود حق (الحق) در دنیا در انسان کامل‌تر از آن در آخرت است\n\nو به دلیل آنچه آوردیم، برخی از اهل الله می‌گویند – و من کسی را بر خدا تزکیه نمی‌کنم – که وجود حق (الحق) در دنیا در انسان کامل‌تر از آن در آخرت است. ما کسانی را دیده‌ایم که به این نظر رفته‌اند و در مجالس با ما رو در رو این را بیان کرده‌اند و دلیل خود را خلافت قرار داده‌اند. پس انسان در دنیا در صفات اسمائی کامل‌تر از آن در آخرت است، بدون شک؛ زیرا او با انعام و انتقام ظاهر می‌شود، در حالی که در آخرت چنین نیست. زیرا او نه بر کسی انعام دارد و نه انتقام، و اگر شفاعت کند، با اجازه است. پس انعام برای کسی است که اجازه داده شده است. اما در بهشت و آتش پس از ذبح مرگ، چنین نیست. بلکه در قیامت، به دلیل حکمتی که در این کتاب ذکر کردیم، بخشی از انتقام وجود دارد، مانند این قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم): «پس دور باد، دور باد.» پس ای بندگان خدا، در اینجا خدا را مراقبه کنید، مراقبه‌ای مانند مراقبه دنیا بر فرزندانش، زیرا او مادر مراقب (الأم الرقوب) است. و بر اخلاق مادرتان باشید تا سعادتمند شوید."
  },
  "page_count": 4
}