{
  "id": 279,
  "title": {
    "ar": "الباب التاسع والسبعون ومائتان في معرفة منزل الاعتبار وأسراره من المقام المحمدي",
    "en": "Chapter Two Hundred and Seventy-Nine: Concerning the Gnosis (معرفة) of the Station (منزل) of Contemplation (الاعتبار) and its Secrets, derived from the Muhammadan Station (المقام المحمدي).",
    "ur": "باب دو سو اناسی (۲۷۹) معرفتِ منزلِ الاعتبار (الاعتبار) اور اس کے اسرار کے بیان میں جو المقام المحمدی (المقام المحمدي) سے ہیں۔",
    "fa": "باب دویست و هفتاد و نهم در معرفت منزل اعتبار و اسرار آن از مقام محمدی."
  },
  "content": {
    "ar": "## «الباب التاسع والسبعون ومائتان في معرفة منزل الاعتبار وأسراره من المقام المحمدي»\n\n\n> تجليه في الأفعال ليس بممكن *** لدينا وعند الغير ذلك جائز\n\n\n> ويحتج في ذاك الجواز بفعله *** وكيف يرى في الفعل والعبد عاجز\n\n\n> فمن قائل الحق في الكون ظاهر *** ومن قائل الحق في المنع ناجز\n\n\n> وتحقيق هذا الأمر عجز وحيرة *** ولا ينجلي إلا لمن هو فائز\n\n\n### [أن التجلي الذاتي ممنوع في غير مظهر]\n\n\nاعلم أن التجلي الذاتي ممنوع بلا خلاف بين أهل الحقائق في غير مظهر والتجلي في المظاهر وهو التجلي في صور المعتقدات كائن بلا خلاف والتجلي في المعقولات كائن بلا خلاف وهما تجلى الاعتبارات لأن هذه المظاهر سواء كانت صور المعقولات أو صور المعتقدات فإنها جسور يعبر عليها بالعلم أي يعلم أن وراء هذه الصور أمر إلا يصح أن يشهد ولا إن يعلم وليس وراء ذلك المعلوم الذي لا يشهد ولا يعلم حقيقة ما يعلم أصلا وأما التجلي في الأفعال أعني نسبة ظهور الكائنات والمظاهر عن الذات التي تتكون عنها الكائنات وتظهر عنها المظاهر وهو قوله تعالى ما أَشْهَدْتُهُمْ خَلْقَ السَّماواتِ والْأَرْضِ فالحق سبحانه قرر في اعتقادات قوم وقوع ذلك وقرر في اعتقادات قوم منع وقوع ذلك وهو سبحانه‏\nقد ذكرنا أنه يتجلى في صور المعتقدات فمن عرف أن أفعال نفسه وغيره مخلوقة لله مع أنه يشاهدها عن قدرته ويعلم أنها عن القدرة الإلهية مع أنه لا يشهد تعلق قدرته أو قدرة غيره بمقدوره حالة إيجاده وإبرازه من العدم إلى الوجود يمنع إن يتجلى الحق في الأفعال إلا على حد ما وقع هنا فمنع وقوع هذا التجلي ومن عرف أن أفعال نفسه مخلوقة له لا للقدرة القديمة مع أنه أيضا لا يعرفها مشاهدة إلا حال وجودها ولا يرى صاحب هذا الاعتقاد إذا أنصف تعلق قدرته بإيجادها وإنما يشهد تعلق الجارحة بالحركة القائمة قال بوقوع هذا التجلي ففيه خلاف بين أهل هذا الشأن لا يرتفع دنيا ولا آخرة غير أن الدنيا تقتضي بحالها أن يتنازعوا في هذا الأمر وغيره وفي الجنة لا نزاع في ذلك لأن كل واحد قد قرره الحق على اعتقاده وأبقى عليه وهمه في تلك الدار أنه متجل له في أفعاله وأبقى على الآخر علمه أنه لا يتجلى في أفعاله مع حصول تجلى من أبقى عليه وهمه لمن أبقى علمه عليه بالمنع فصاحب المنع يشاهد من الحق ما يشاهده من يقول بوقوع التجلي في الأفعال فيعرف ما يشهد في ذلك التجلي كما يعرف هنا من يعقل معقولاته الصادرة عنه وذلك الآخر لا يعلم من الله هذا الذي يعلمه من يقول بالمنع فحصل من هذا أن الأمر مشكل فهو سبحانه المثبت لذلك والنافي له فيما خاطبنا به هنا في كتبه وعلى ألسنة رسله وقرره في أفكار النظار لتاخذه العقول على حد ما قرره في الأفكار من المنع لذلك أو وقوعه وهذا الحجاب لا يرتفع أبدا والتكليف محقق من حيث إن الأفعال مكتسبة بلا خلاف بين الطائفتين وإنما الخلاف في الإيجاد عن أي القدرتين كان قال تعالى وتبين لكم كيف فعلنا بهم وهو أقوى حجة للقائلين بالوقوع وهو أقوى حجة للقائلين بالمنع أَ لَمْ تَرَ إِلى‏ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ فقرن الرؤية بإلى وجعل المرئي الكيف فيقول صاحب المنع لما لم نشهد هنا ذات الحق وهو يكيف مد الظل ولا رأيناه وإنما رأينا مد الظلال عن الأشخاص الكثيفة التي تحجب الأنوار أن تنبسط على الأماكن التي تمتد فيها ظلال هذه الأشخاص علمنا إن الرؤية في هذا الخطاب إنما متعلقها العلم بالكيف المشهود الذي ذكرناه وأن ذلك من الله سبحانه لا من غيره أي أنه لو أراد أن تكون الأشخاص الكثيفة منصوبة والأنوار في جهة منها بمنع تلك الأشخاص انبساط النور على تلك الأماكن فيسمى منعها ظلالا أو يقبض تلك الظلال عن الانبساط على تلك الأماكن ولا يخلق فيها نورا آخر ولا ينبسط ذلك النور المحجوب على تلك الأماكن لما قصرت إرادته عن ذلك كما قال تعالى ثُمَّ قَبَضْناهُ إِلَيْنا قَبْضاً يَسِيراً وهو رجوع الظل إلى الشخص الممتد منه ببروز النور حتى يشهد ذلك المكان فجعل المقبوض إنما كان قبضه إلى الله لا إلى الجدار وفي الشاهد وما تراه العين إن سبب انقباض الظل وتشميره إلى جهة الشخص الكثيف إنما هو بروز النور فما في المسائل الإلهية ما تقع فيها الحيرة أكثر ولا أعظم من مسألة الأفعال ولا سيما في تعلق الحمد والذم بأفعال المخلوقين فيخرجها ذلك التعلق أن تكون أفعال المخلوقين لغير المخلوقين حال ظهورها عنهم وأفعال الله كلها حسنة في مذهب المخالف الذي ينفي الفعل عن المخلوق ويثبت الذم للفعل بلا خلاف ولا شك عنده في تعلق الذم بذلك الفعل من الله وسببه الكسب لما وقع مخالفا لحمد الله فيه مأمورا كان يفعله فلم يفعله أو منهيا عن فعله ففعله وهذا فيه ما فيه وفي مثل هذه المسائل قلت‏\n\n\n> حيرة من حيرة صدرت *** ليت شعري ثم من لا يحار\n\n\n> أنا إن قلت أنا قال لا *** وهو إن قال أنا لا يعار\n\n\n> أنا مجبور ولا فعل لي *** والذي أفعله باضطرار\n\n\n> والذي أسند فعلي له *** ليس في أفعاله بالخيار\n\n\n> فإنا وهو على نقطة *** ثبتت ليس لها من قرار\n\n\nفقد أوقفناك بما ذكرناه في هذا الباب على ما يزيدك حيرة فيه وبعد أن ذكرنا ما ذكرنا\n\n\n### [منزل حيرة ومقام غيرة]\n\n\nفاعلم أن هذا المنزل هو على الحقيقة منزل حيرة ومقام غيرة ومن علوم هذا المنزل وهو داخل في باب الحيرة اتصاف العدم بالكينونة وهي تقتضيه واتصاف الحق بجعل الموجودات في العدم وخلق العدم بحيث أن يقال فعل الفاعل لا شي‏ء ولا شي‏ء لا يكون فعلا وقد نسبه الحق إليه فقال إن يشأ يذهبكم أن يلحقكم بالعدم ويأت بخلق جديد فانظر كيف أضاف الإلحاق بالعدم إلى المشيئة ولم‏\nيضفه إلى القدرة التي يقع الخلق والجعل بها والكتب الإلهية من هذا مشحونة ويحتوي عليها هذا المنزل والصحيح في ذلك أن الموجودات إذا كانت كما قد ذكر لها أعيان ثابتة حال اتصافها بالعدم الذي هو للممكن لا للمحال فكما أبرزها للوجود وألبسها حاله وعراها عن حال العدم فيسمى بذلك موجدا وتسمى هذه العين موجودة لا يبعد أن يردها إلى ما منه أخرجها وهي حالة العدم فيتصف الحق بأنه معدم لها وتتصف هي بأنها معدومة ولا يتعرض إلى العلم بأية صفة حصل ذلك فإن سألنا ألحقنا حصول الأمرين والحالتين بالمشيئة ويسلم ذلك الخصمان وإذا سألنا عن إلحاق تلك العين بالوجود نسبنا ذلك إلى القدرة والمشيئة ويسلم الخصمان لنا ذلك فإذا فهمت ما أردناه فالحق الكل بالمشيئة وهو الأولى والأوجه حتى تسلم من النزاع في صنف الخبر من ذلك حتى لا يتصور نزاع فيه من جميع الطوائف ومن هذا الباب ذَهَبَ الله بِنُورِهِمْ أي أزاله عن أبصارهم ولكن لا يلزم من ذهابه عن أبصارهم الحاقة بالعدم لو لا إن المفهوم منه أن الله أعدم النور من أبصارهم وتَرَكَهُمْ في ظُلُماتٍ لا يُبْصِرُونَ ومن علوم هذا المنزل بعث الحق تعالى الجماعة لأمر يقوم به الواحد منهم أعني من تلك الجماعة ومن علوم هذا المنزل وجود العلم عن النظرة والضربة والرمية وكيف تقوم هذه الأمور مقام كلام العالم للمتعلم وذوقنا من هذا الفن ذوق النظرة\n\n\n### [النظر بنور الشمس يتضمن جميع المرئيات على كثرتها وبعدها]\n\n\nفاعلم أنه كما يتضمن النظر بنور الشمس جميع المرئيات على كثرتها وبعدها في غير زمان مطول بل عين زمان اللمحة زمان بسط النور على المبصرات عين زمان إدراك البصر لها عين زمان تعلق العلم بما أدركه البصر من غير ترتيب زماني ولا امتداد وإن كان الترتيب معقولا مثل ترتيب العلة والمعلول مع تساوقهما في الوجود كذلك اللحظة أو الضربة أو الرمية تتضمن العلوم التي أودع الله فيها فإذا وقعت من الضارب أو الرامي أو اللاحظ أدرك من العلم جميع ما في قوة تلك الضربة مثل ما أعطت اللحظة بنور الشمس جميع ما في قوة تلك اللحظة من المبصرات وليس القصور من الضربة وغيرها فإنها تتضمن ما لا نهاية له من العلوم كما تشرق الشمس على أكثر مما يدركه البصر وإنما القصور في قلب المدرك مثل القصور في المبصر عن إدراك جميع ما أشرقت عليه الشمس وهذا كله في آن واحد إن كان المدرك ممن يتقيد بالزمان كالأرواح التي لا تتصف بالتحيز فتدرك ما تدركه في غير زمان مما يدرك في زمان وفي غير زمان ولهذه الإشارة\n\n\nبقوله صلى الله عليه وسلم إن الحق ضربه بيده بين كتفيه أو في ظهره فوجد برد الأنامل بين ثدييه أو في صدره فعلم علم الأولين والآخرين‏\n\n\nفسبحان معلم من شاء بما شاء كيف شاء لا إله إلا هو العليم القدير وكذلك من هذا الباب لما رمى التراب في وجوه الأعداء يوم حنين فأصابت عيون القوم فانهزموا فانظر ما تضمنته تلك الرمية وما تضمنته تلك الضربة وأما لنظرة فما رويتها عن أحد ولا سمعتها عن أحد لكني رأيتها من نفسي نظرت نظرة فعلمت ما تضمنته من العلوم وأعطيت نظرة فنظرت بها فعلمت بها من نظرت إليه من جميع ما تضمنته تلك النظرة من العلوم وهذا هو علم الأذواق ومن هنا يعلم قول من قال يسمع بما به يبصر بما به يتكلم هذا مضى وأما فائدة ما يقوم به الواحد بما تبعث به الجماعة فللإنعام الإلهي بتلك الجماعة وعناية الحق بهم حيث جعل لهم نصيبا في ذلك الخير لا لقصور القدرة عن إبلاغ الواحد ذلك الأمر دون الجماعة إلا أن تكون حقائق النسب فإن ذلك ترتيب حقيقي لا وضعي كتقدم الحي على العالم ودخول المريد تحت إحاطة العالم ودخول القادر تحت إحاطة المريد فلا يقوم المريد بما يختص به القادر ولا يقوم العالم بما يختص به المريد ولا يقوم الحي بما يختص به العالم ولا يقوم العالم بما يختص به الحي ولا يقوم المريد بما يختص به العالم ولا يقوم القادر بما يختص به المريد وعين العالم هو عين الحي عين المريد عين القادر وعين الحياة هي عين العلم عين الإرادة عين القدرة وعين الحياة هي عين الحي عين العالم عين المريد عين القادر وكذلك ما بقي فالنسب مختلفة والعين واحدة والمعلوم صفة وحال وموصوف فالجمع في عين الوحدة مندرج حكما لا عينا فإنه ما ثم أعيان موجودة لهذا المجموع وإنما هي عين واحدة لها نسب مختلفة تبلغ ما بلغت فهذا هو السريان الوجودي في الموجودات فهذا من قيام الواحد بما تقوم به الجماعة بين موجود ومعقول فهذا المنزل يتضمن ما ذكرناه ومن علوم هذا المنزل معرفة استحالات العناصر والمولدات بعضها إلى بعض بنسبة رابطة بين المستحيل والمستحال إليه فإن ارتفعت تلك النسبة الرابطة لم يستحل شي‏ء إلى شي‏ء فإنه منافر له من جميع الوجوه ولهذا كانت النسبة بين الرب والمربوب‏\nموجودة وبها كان ربا له ولم يكن بين المربوب وذات الرب نسبة فلهذا لم يكن عن الذات شي‏ء كما تقول أصحاب العلل والمعلولات فلا تتوجه الذات على إيجاد الأشياء من كونها ذاتا وإنما تتوجه على الأشياء من نسبة القدرة إليها وعدم المانع وذلك مسمى الألوهة كذلك الطبائع رتبها الله ترتيبا عجيبا لأجل الاستحالات فجعل عنصر النار يليه الهواء وعنصر الهواء يليه الماء وعنصر الماء يليه التراب فبين الماء والنار منافرة طبيعية من جميع الوجوه وبين الهواء والتراب منافرة من جميع الوجوه طبيعية فجعل بينهما الوسائط لكونها ذات وجهين لكل واحد مما يلي الطرفين مناسبة خاصة فإذا أراد الحق أن يحيل الماء نارا وهو منافر طبعا أحاله أولا هواء ثم أحال ذلك الهواء نارا فما أحال الماء نارا حتى نقله إلى الهواء من أجل التناسب وكذلك جميع الاستحالات كلها في عالم الطبيعة وأما في الإلهيات فقد أشرنا إليه في هذه المسألة وفي هذا الكتاب في وصف ذات المخلوق بصفة ذات الخالق ووصف ذات الخالق بصفة ذات المخلوق ثم تجرد ذات الخالق عما تقتضيه ذات المخلوق وتجرد ذات المخلوق عما تقتضيه ذات الخالق فلو لا النسبة الموجودة بين الرب والمربوب ما دل عليه ولا قبل الاتصاف بصفته لا هذا ولا هذا وبتلك النسبة كان الحق مكلفا عباده وآمرا وناهيا وبها بعينها كان الخلق مكلفا مأمورا منهيا فحقق ما نبهناك عليه إن كنت ذا قلب وألقيت السمع وأنت شهيد لما ذكرناه فإن لم تكن كذلك فاتك خير كثير وعلم نافع جليل القدر لكنه عظيم الخطر إلا أن يعصم الله ومكر إلهي خفي في هذا المنزل صدر عن الاسم القاهر والقادر موجود من عالم الغيب في عالم الحس بيده حسام القهر صلتا يطلب به موجودا تعلق باسم رحماني مثل طلب موسى فرعون وطلب نمروذ وفراعنة الأنبياء للأنبياء عليهم السلام كل ذلك صفات تقوم للعارف في ظاهره وباطنه يكاشفها من نفسه فإذا صال رجال الاسم القاهر التجأ العارف إلى الاسم الباطن فشفع له عند القاهر فتبادر جماعة من الأسماء الإلهية من أجل الاسم الباطن تعظيما له لقربه من الهو وقاموا معه بالاسم القائم على الاسم الظاهر لبعد منزلته من الهو فأقام لهم الاسم من عالم الغيب جماعة في عالم البرزخ فإنه أشد قوة في التأثير من عالم الحس فإنه يؤثر في عالم الحس ما يؤثره الحس والحس لا يقدر يؤثر في الخيال أ لا ترى النائم يرى في الخيال إنه ينكح فينزل منه الماء في عالم الحس ويرى ما يفزعه فيتأثر لذلك جسم النائم بحركة أو صوت يصدر منه أو كلام مفهوم أو عرق لقوة سلطانه عليه ويظهر الخيال في صورة الحس ما ليس في نفسه بمحسوس ويلحقه بالحس وليس في قوة الحس أن يرد المحسوس بعينه متخيلا فيحصل لهذا العارف علوم من عين تلك الجماعة البرزخية يطلع بها على معرفة تلك الشبهة القادحة في سعادته لو ثبتت ومات عليها ولا بد في هذا المنزل من هذه الشبهة وهذه الأدلة\n\n\nواعلم أنه ما من منزل من المنازل ولا منازلة من المنازلات ولا مقام من المقامات ولا حال من الحالات إلا وبينهما برزخ يوقف العبد فيه يسمى الموقف وهو الذي تكلم منه صاحب المواقف محمد بن عبد الجبار النفري رحمه الله في كتابه المسمى بالمواقف الذي يقول فيه أوقفني الحق في موقف كذا فذلك الاسم الذي يضيفه إليه هو المنزل الذي ينتقل إليه أو المقام أو الحال أو المنازلة إلا قوله أوقفني في موقف وراء المواقف فذلك الموقف مسمى بغير اسم ما ينتقل إليه وهو الموقف الذي لا يكون بعده ما يناسب الأول وهو عند ما يريد الحق أن ينقله من المقام إلى الحال ومن الحال إلى المقام ومن المقام إلى المنزل ومن المنزل إلى المنازلات أو من المنازلات إلى المقام وفائدة هذه المواقف أن العبد إذا أراد الحق أن ينقله من شي‏ء إلى شي‏ء يوقفه ما بين ما ينتقل عنه وبين ما ينتقل إليه فيعطيه آداب ما ينتقل إليه ويعلمه كيف يتأدب بما يستحقه ذلك الأمر الذي يستقبله فإن للحق آدابا لكل منزل ومقام وحال ومنازلة إن لم يلزم الآداب الإلهية العبد فيها وإلا طرد وهو أن يجري فيها على ما يريده الحق من الظهور بتجليه في ذلك الأمر أو الحضرة من الإنكار أو التعريف فيعامل الحق بآداب ما تستحقه وقد ورد الخبر الصحيح في ذلك في تجليه سبحانه في موطن التلبيس وهو تجليه في غير صور الاعتقادات في حضرة الاعتقادات فلا يبقى أحد يقبله ولا يقربه بل يقولون إذا قال لهم أنا ربكم نعوذ بالله منك فالعارف في ذلك المقام يعرفه غير أنه قد علم منه بما أعلمه أنه لا يريد أن يعرفه في تلك الحضرة من كان هنا مقيد المعرفة بصورة خاصة يعبده فيها فمن أدب العارف أن يوافقهم في الإنكار ولكن لا يتلفظ بما تلفظوا به من الاستعاذة منه فإنه يعرفه فإذا قال لهم‏\nالحق في تلك الحضرة عند تلك النظرة هل كان بينكم وبينه علامة تعرفونه بها فيقولون نعم فيتحول لهم سبحانه في تلك العلامة مع اختلاف العلامات فإذا رأوها وهي الصورة التي كانوا يعبدونه فيها حينئذ اعترفوا به ووافقهم العارف بذلك في اعترافهم أدبا منه مع الله وحقيقة وأقر له بما أقرت الجماعة فهذه فائدة علم المواقف وما ثم منزل ولا مقام كما قلنا إلا وبينهما موقف إلا منزلان أو حضرتان أو مقامان أو حالان أو منازلتان كيف شئت قل ليس بينهما موقف وسبب ذلك أنه أمر واحد غير أنه يتغير على السالك حاله فيه فيتخيل أنه قد انتقل إلى منزل آخر أو حضرة أخرى فيحار لكونه لم ير الحق أوقفه والتغيير عنده حاصل فلا يدري هل ذلك التغير الذي ظهر فيه هل هو من انتقاله في المنزل أو انتقاله عنه فإن كان هنالك عارف بالأمر عرفه وإن لم يكن له أستاذ بقي التلبيس فإنه من شأن هذا الأمر أن لا يوقفه الحق كما فعل معه فيما تقدم وكما يفعل معه فيما يستقبل فيخاف السالك من سوء الأدب في الحال الذي يظهر عليه هل يعامله بالأدب المتقدم أوله أدب آخر وهذا لمن أوقفه الحق من السالكين فإذا لم يوقفه الحق في موقف من هذه المواقف ولم يعطه الفصل بين ما ينتقل إليه وعنه كان عنده الانتقالات في نفس المنزل الذي هو فيه فإنه ما ثم عند صاحب هذا الذوق إلا أمر واحد فيه تكون الانتقالات وهو كان حال المنذري صاحب المقامات وعليها بنى كتابه المعروف بالمقامات وأوصلها إلى مائة مقام في مقام واحد وهو المحبة فمثل هذا لا يقف ولا يتحير ولكن يفوته علم جليل من العلم بالله وصفاته المختصة بما ينتقل إليه فلا يعرف المناسبات من جانب الحق إلى هذا المنزل فيكون علمه علم إجمال قد تضمنه الأمر الأول عند دخوله إلى هذه الحضرات ويكون علم صاحب المواقف علم تفصيل ولكن يعفى عنه ما يفوته من الآداب إذا لم تقع منه وتجهل فيه ولا يؤثر في حاله بل يعطي الأمور على ما ينبغي ولكن لا يتنزل منزلة الواقف ولا يعرف ما فاته فيعرفه الواقف وهو لا يعرف الواقف فلهذا المنزل الذي نحن فيه موقف يجهل لا بل يحار فيه صاحب المواقف لأن المناسبة بين ما يعطيه الموقف الخاص به وبين هذا المنزل بعيدة مما بنى المنزل عليه وكذلك الذي يأتي بعده غير أن النازل فيه وإن كان حائرا فإنه يحصل له من الموقف في تلك الوقفة إذا ارتفعت المناسبة بين المنزل والوقفة إن المناسبة ترجع بين الوقفة والنازل فيعرف ما تستحقه الحضرة من الآداب مع ارتفاع المناسبة فيشكر الله على ذلك فصاحب المواقف متعوب لكنه عالم كبير والذي لا موقف له مستريح في سلوكه غير متعوب فيه وربما إذا اجتمعا ورأى من لا موقف له حال من له المواقف ينكر عليه ما يراه فيه من المشقة ويتخيل أنه دونه في المرتبة فيأخذ عليه في ذلك ويعتبه فيها ويقول له الطريق أهون من هذا الذي أنت عليه ويتشيخ عليه وذلك لجهله بالمواقف وأما صاحب المواقف فلا يجهله ولا ينكر عليه ما عامله به من سوء الأدب ويحمله فيه ولا يعرفه بحاله ولا بما فإنه من الطريق فإنه قد علم إن الله ما أراده بذلك ولا أهله فيقبل كلامه وغايته إن يقول له يا أخي سلم إلى حالي كما سلمت إليك حالك ويتركه وهذا الذي نبهتك عليه من أنفع ما يكون في هذا الطريق لما فيه من الحيرة والتلبيس فافهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Seventy-Nine concerning the Gnosis of the Station of Contemplation (الاعتبار) and its Secrets, derived from the Muhammadan Station (المقام المحمدي)\n\nHis Self-disclosure (تجَلِّيهِ) in Acts is not possible according to us, though others deem it permissible.\nThey argue for that permissibility based on His Act, yet how can He be seen in the Act when the servant is incapable?\nThus, some say The Real (الحق) is manifest in the cosmos, while others say The Real is decisive in the prohibition.\nThe realization of this matter is incapacity and bewilderment (حيرة), and it is not unveiled except for the one who is victorious.\n\n### [That the Essential Theophany (التجلي الذاتي) is prohibited except in a locus of manifestation (مظهر)]\n\nKnow that the Essential Theophany (التجلي الذاتي) is prohibited without dispute among the People of Realities (أهل الحقائق) except in a locus of manifestation (مظهر). The Theophany in loci of manifestation, which is the Theophany in the forms of beliefs (صور المعتقدات), occurs without dispute. The Theophany in intelligibles (المعقولات) also occurs without dispute. These two are the Theophanies of Contemplations (تجلى الاعتبارات), because these loci of manifestation, whether they are the forms of intelligibles or the forms of beliefs, are bridges (جسور) over which one crosses by means of Knowledge (العلم). That is, one knows that behind these forms there is a matter that cannot be witnessed (يشهد) nor known (يعلم), and behind that known thing which is neither witnessed nor known, there is no reality of what is known (حقيقة ما يعلم) at all.\n\nAs for the Theophany in Acts—meaning the attribution of the appearance of created things (الكائنات) and manifestations (المظاهر) to the Essence (الذات) from which the created things originate and the manifestations appear—this is related to His saying, the Exalted: <<مَا أَشْهَدْتُهُمْ خَلْقَ السَّمَاوَاتِ وَالْأَرْضِ>> (I did not make them witness the creation of the heavens and the earth). The Real (الحق), the Glorified, has established in the beliefs of some people the occurrence of that [Theophany in Acts] and has established in the beliefs of others the prohibition of its occurrence. We have mentioned that He discloses Himself in the forms of beliefs.\n\nThus, one who knows that his own acts and the acts of others are created by Allah, even though he witnesses them through his own power and knows they stem from Divine Power (القدرة الإلهية), yet does not witness the connection of his power or the power of others to the object of power (مقدوره) during its creation (إيجاده) and bringing forth from non-existence (العدم) into existence (الوجود)—this person prohibits the Theophany of The Real in Acts, except within the limits of what has occurred here. He thus prohibits the occurrence of this Theophany.\n\nAnd one who knows that his own acts are created by himself, not by the Ancient Power (القدرة القديمة), even though he also does not know them by witnessing (مشاهدة) except at the moment of their existence, and this believer, if he is fair, does not see the connection of his power to their creation, but only witnesses the connection of the limb (الجارحة) to the movement (الحركة) subsisting in it—this person affirms the occurrence of this Theophany.\n\nTherefore, there is a dispute among the People of this Path (أهل هذا الشأن) that will not be lifted in this world or the Hereafter. However, the state of this world necessitates that they dispute this matter and others. In Paradise, there will be no dispute concerning this, because The Real has confirmed each person upon his belief and maintained his illusion (وهمه) in that abode that He is disclosing Himself to him in his acts, while maintaining the other person's knowledge (علمه) that He does not disclose Himself in his acts. Yet, the Theophany maintained for the one whose illusion was kept is witnessed by the one whose knowledge of prohibition was kept. Thus, the one who prohibits witnesses from The Real what the one who affirms the occurrence of the Theophany in Acts witnesses. He knows what he witnesses in that Theophany, just as here one understands the intelligibles (معقولاته) emanating from him. But that other person does not know this from Allah, which the one who affirms the prohibition knows.\n\nIt results from this that the matter is problematic (مشكل). He, the Glorified, is both the Establisher and the Denier of that, in what He addresses us with here in His Books and upon the tongues of His Messengers, and what He establishes in the thoughts of the contemplators (أفكار النظار), so that minds may grasp it according to what He established in their thoughts, whether it be the prohibition or the occurrence. This veil (الحجاب) will never be lifted.\n\nThe religious obligation (التكليف) is confirmed, since acts are acquired (مكتسبة) without dispute between the two parties. The dispute is only concerning the creation (الإيجاد): from which of the two powers did it originate? He, the Exalted, said: <<وَتَبَيَّنَ لَكُمْ كَيْفَ فَعَلْنَا بِهِمْ>> (And it was made clear to you how We dealt with them). This is the strongest proof for those who affirm the occurrence. And His saying: <<أَلَمْ تَرَ إِلَى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ>> (Have you not regarded your Lord, how He extended the shadow?). This is the strongest proof for those who affirm the prohibition.\n\nHe linked vision (الرؤية) with 'to' (إلى) and made the object of vision the 'how' (الكيف). The Prohibitor says: Since we do not witness the Essence of The Real (ذات الحق) here while He is determining the 'how' of the shadow's extension, nor do we see Him, but only see the extension of shadows from dense bodies (الأشخاص الكثيفة) that prevent light from spreading onto the places where the shadows of these bodies extend, we know that the vision in this address relates only to the knowledge of the witnessed 'how' we mentioned, and that this is from Allah, the Glorified, not from another. That is, if He willed that the dense bodies be erected and the lights be in one direction, preventing the light from spreading onto those places—which is called their prevention of shadows—or if He willed to contract those shadows from spreading onto those places, without creating another light there, nor would that veiled light spread onto those places, His Will would not fall short of that. As He, the Exalted, said: <<ثُمَّ قَبَضْنَاهُ إِلَيْنَا قَبْضًا يَسِيرًا>> (Then We withdrew it to Ourselves with an easy withdrawal). This is the shadow returning to the body from which it extended by the emergence of light until that place is witnessed. He made the withdrawal of the shadow *to Allah*, not to the wall.\n\nIn Divine matters, there is no issue that causes more bewilderment (حيرة) or is greater than the issue of Acts, especially concerning the attachment of praise (الحمد) and blame (الذم) to the acts of creatures. This attachment removes the acts of creatures from being for others than the creatures themselves, even while they appear through them. All of Allah's acts are good, according to the opponent who denies the act to the creature but affirms blame for the act without dispute or doubt concerning the attachment of blame to that act from Allah. The cause of the blame is acquisition (الكسب), when the act contradicts what Allah praised, whether it was commanded and not done, or forbidden and done. This contains what it contains. Concerning such issues, I said:\n\nBewilderment issued from bewilderment. Would that I knew, then who is not bewildered?\nIf I say 'I,' He says 'No.' And if He says 'I,' He is not contradicted.\nI am compelled (مجبور) and have no act, and what I do is by necessity (اضطرار).\nAnd He to whom my act is attributed is not given choice (بالخيار) in His Acts.\nFor I and He are upon a point that is fixed, yet has no stability (قرار).\n\nWe have informed you in this chapter of what increases your bewilderment, even after what we have mentioned.\n\n### [The Station of Bewilderment (حيرة) and the Abode of Jealousy (غيرة)]\n\nKnow that this station is, in reality, the station of bewilderment and the abode of jealousy (غيرة). Among the sciences of this station, which falls under the category of bewilderment, is the description of non-existence (العدم) with being (الكينونة), which necessitates it, and the description of The Real with placing existents in non-existence and creating non-existence such that it is said: the act of the agent is nothing (لا شي‏ء), and nothing cannot be an act. Yet The Real attributed it to Himself, saying: <<إِنْ يَشَأْ يُذْهِبْكُمْ>> (If He wills, He can do away with you)—meaning consign you to non-existence—<<وَيَأْتِ بِخَلْقٍ جَدِيدٍ>> (and bring forth a new creation). Observe how He attributed the consignment to non-existence to the Will (المشيئة) and did not attribute it to the Power (القدرة) by which creation and making occur.\n\nThe Divine Books are filled with this. This station encompasses it. The correct view concerning this is that since existents have Fixed Entities (أعيان ثابتة) while described by non-existence (which belongs to the possible, not the impossible), just as He brought them forth into existence (الوجود) and clothed them in its state, stripping them of the state of non-existence—thus being called the Creator (موجدا) and the entity being called existent (موجودة)—it is not far-fetched that He returns them to the state from which He brought them out, which is the state of non-existence. Thus, The Real is described as annihilating them (معدم لها), and they are described as annihilated (معدومة).\n\nOne should not delve into the knowledge of by which attribute that occurred. If we are asked, we attribute the occurrence of both matters and states to the Will, and both opponents agree to that. If we are asked about consigning that entity to existence, we attribute that to Power and Will, and both opponents agree to that. Therefore, if you understand what we intend, attribute everything to the Will, which is the most appropriate and preferable, so that you may be safe from dispute regarding the category of the report, such that no dispute is conceivable from any faction.\n\nFrom this category is <<ذَهَبَ الله بِنُورِهِمْ>> (Allah has taken away their light), meaning He removed it from their sight. But its removal from their sight does not necessarily consign it to non-existence, were it not for the understanding that Allah annihilated the light from their sight, <<وَتَرَكَهُمْ فِي ظُلُمَاتٍ لَا يُبْصِرُونَ>> (and left them in darknesses, they do not see).\n\nAmong the sciences of this station is The Real, the Exalted, sending a group (الجماعة) for a matter that one individual (الواحد) from that group performs. Among the sciences of this station is the existence of Knowledge (العلم) resulting from a glance (النظرة), a strike (الضربة), or a throw (الرمية). How can these things take the place of the speech of the knowledgeable person to the learner? Our taste (ذوق) of this type is the taste of the glance.\n\n### [Vision by the Light of the Sun encompasses all visible things, despite their multiplicity and distance]\n\nKnow that just as vision by the light of the sun encompasses all visible things (المرئيات), despite their multiplicity and distance, not over an extended time, but the very moment of the glance (اللمحة)—the moment the light spreads over the visible objects is the very moment the sight perceives them, and the very moment the Knowledge connects to what the sight perceived—without temporal ordering or extension, even though the ordering is intelligible (like the ordering of cause and effect, despite their simultaneity in existence).\n\nSimilarly, the glance, the strike, or the throw encompasses the sciences (العلوم) that Allah deposited within it. When it occurs from the striker, the thrower, or the gazer, he perceives all the knowledge that is in the potential of that strike, just as the glance by the sun's light yields all that is in the potential of that glance concerning visible objects. The deficiency is not in the strike or the like, for it encompasses infinite knowledge, just as the sun shines upon more than the sight perceives. Rather, the deficiency is in the heart of the perceiver (قلب المدرك), like the deficiency in the visible object regarding the perception of everything the sun shines upon. This all happens in a single instant (آن واحد), unless the perceiver is bound by time, like the spirits (الأرواح) that are not characterized by spatial limitation (التحيز), so they perceive what they perceive outside of time, from what is perceived both in time and outside of time.\n\nThis refers to his saying (PBUH):\n\"Indeed, The Real struck him with His Hand between his shoulders (or on his back), and he found the coolness of the fingertips between his breasts (or on his chest), and he knew the knowledge of the first and the last.\"\n\nGlory be to the Teacher of whomever He wills, with whatever He wills, however He wills. There is no god but He, the All-Knowing, the All-Powerful.\n\nSimilarly, from this category is the matter of the throw of dust into the faces of the enemies on the Day of Hunayn, which struck the eyes of the people, causing them to flee. See what that throw encompassed and what that strike encompassed. As for the glance (النظرة), I have not narrated it from anyone nor heard it from anyone, but I saw it in myself. I cast a glance and knew the sciences it encompassed. I was given a glance, and I looked with it, and through it, I knew everything concerning the one I looked at, from all the sciences that glance encompassed. This is the science of Tastes (علم الأذواق). From here, one understands the saying of those who say: \"He hears by that by which he sees, by that by which he speaks.\" This is past.\n\nAs for the benefit of the matter performed by the individual, for which the group is sent, it is due to the Divine favor upon that group and the care of The Real for them, granting them a share in that good. It is not due to the deficiency of Power (القدرة) in conveying that matter to the individual without the group, unless it concerns the realities of the relations (حقائق النسب). That is a real, not conventional, ordering, such as the precedence of the Living (الحي) over the Knowing (العالم), the entry of the Willing (المريد) under the encompassment of the Knowing, and the entry of the Powerful (القادر) under the encompassment of the Willing. Thus, the Willing does not perform what is specific to the Powerful, nor does the Knowing perform what is specific to the Willing, nor does the Living perform what is specific to the Knowing, nor does the Knowing perform what is specific to the Living, nor does the Willing perform what is specific to the Knowing, nor does the Powerful perform what is specific to the Willing. Yet, the essence (عين) of the Knowing is the essence of the Living, the essence of the Willing, the essence of the Powerful. And the essence of Life (الحياة) is the essence of Knowledge (العلم), the essence of Will (الإرادة), the essence of Power (القدرة). Likewise for the rest. The relations are different, but the Essence is one. The known thing is an attribute, a state, and a described thing. The collection is implicitly contained within the Essence of Unity (عين الوحدة) by ruling (حكما), not by essence, for there are no existing entities (أعيان موجودة) for this collection. Rather, it is one Essence with different relations, reaching whatever they reach. This is the existential permeation (السريان الوجودي) in existents. This is an example of the individual performing what the group performs, existing between the sensible and the intelligible.\n\nThis station encompasses what we have mentioned. Among the sciences of this station is the knowledge of the transmutations (استحالات) of the elements (العناصر) and the generated things (المولدات) into one another, by means of a connecting relation (نسبة رابطة) between the transmuting thing and the thing transmuted into. If that connecting relation were lifted, nothing would transmute into anything else, for it would be naturally incompatible (منافر له) in all respects.\n\nFor this reason, the relation between the Lord (الرب) and the servant (المربوب) exists, and by it, He is Lord to him. But there is no relation between the servant and the Essence of the Lord (ذات الرب). Therefore, nothing proceeds from the Essence, as the proponents of causes and effects (أصحاب العلل والمعلولات) claim. The Essence does not turn toward the creation of things merely by virtue of being the Essence; rather, it turns toward things by the relation of Power (القدرة) to them and the absence of impediment—and this is called Divinity (الألوهة).\n\nSimilarly, Allah arranged the natures (الطبائع) in a wondrous order for the sake of transmutations. He placed the element of Fire next to Air, Air next to Water, and Water next to Earth. Between Water and Fire, there is natural incompatibility in all respects, and between Air and Earth, there is natural incompatibility in all respects. So, He placed mediators (الوسائط) between them, which have two faces, each having a specific suitability (مناسبة خاصة) to the two extremes. If The Real intends to transmute Water into Fire, which is naturally incompatible, He first transmutes it into Air, and then transmutes that Air into Fire. He does not transmute Water directly into Fire until He transfers it to Air due to the suitability. This applies to all transmutations in the natural world.\n\nAs for Divine matters, we have alluded to it in this issue and in this book, concerning the description of the creature's essence (ذات المخلوق) with the attribute of the Creator's essence, and the description of the Creator's essence with the attribute of the creature's essence. Then, the Creator's essence is stripped of what the creature's essence necessitates, and the creature's essence is stripped of what the Creator's essence necessitates. Were it not for the existing relation between the Lord and the servant, neither would point to the other, nor would either accept being described by the other's attribute. By that very relation, The Real obligated His servants, commanding and forbidding. And by that very same relation, the creation was obligated, commanded, and forbidden by Him.\n\nRealize what we have alerted you to, if you possess a heart and lend an ear while you are a witness (شهيد) to what we have mentioned. If you are not so, much good and beneficial, great knowledge will escape you, though it is of tremendous danger, unless Allah grants protection.\n\nThere is a subtle Divine subtlety (مكر إلهي خفي) in this station, emanating from the Name The Subduer (القاهر) and The Powerful (القادر). An existent from the World of the Unseen (عالم الغيب) appears in the Sensory World (عالم الحس), holding a drawn sword of Subjugation (حسام القهر), seeking an existent connected to a Merciful Name (اسم رحماني), like Moses seeking Pharaoh, and Nimrod and the Pharaohs of the Prophets seeking the Prophets (peace be upon them). All these are attributes that arise for the Gnostic (العارف) in his outer and inner being, which he unveils from himself. When the men of the Name The Subduer attack, the Gnostic takes refuge in the Name The Inner (الباطن), which intercedes for him with The Subduer. A group of Divine Names then rushes forth, out of reverence for the Name The Inner, due to its proximity to *Huwa* (He/The Essence). They stand with it by means of the Name The Establisher (القائم) against the Name The Outer (الظاهر), due to the latter's distance from *Huwa*.\n\nThe Name establishes for them a group from the World of the Unseen in the World of the Isthmus (عالم البرزخ), for the Isthmus is stronger in influence than the Sensory World. The Isthmus influences the Sensory World with what the senses influence, but the senses cannot influence the Imagination (الخيال). Do you not see the sleeper who sees in the Imagination that he is having intercourse, and water descends from him in the Sensory World? Or he sees what frightens him, and the sleeper's body is affected by a movement, a sound, intelligible speech, or sweat, due to the strength of its dominion over him. The Imagination manifests in the form of the sense what is not sensory in itself and consigns it to the sense. Yet, the sense does not have the power to return the sensible thing itself as an imagined thing.\n\nFrom this Barzakhic group, the Gnostic obtains sciences that reveal to him the nature of that doubt (الشبهة) that would undermine his felicity if it persisted and he died upon it. This doubt and these proofs are necessary in this station.\n\nKnow that there is no station (منزل), no spiritual contest (منازلة), no rank (مقام), and no state (حال) except that there is an Isthmus (برزخ) between them where the servant is halted. This is called the Halting Place (الموقف). This is what the author of *Al-Mawāqif*, Muhammad ibn Abd al-Jabbar al-Niffari (may Allah have mercy on him), spoke of in his book, where he says: \"The Real halted me in such-and-such a Halting Place.\" That Name he attributes it to is the station, rank, state, or contest he is moving toward, except for his saying: \"He halted me in a Halting Place beyond the Halting Places.\" That Halting Place is named by a name other than what he moves toward. It is the Halting Place after which there is nothing corresponding to the first.\n\nThe benefit of these Halting Places is that when The Real intends to transfer the servant from one thing to another, He halts him between what he is leaving and what he is moving toward. He grants him the proper manners (آداب) of what he is moving toward and teaches him how to conduct himself with the manners deserved by that matter he is approaching. For The Real has manners for every station, rank, state, and contest. If the servant does not adhere to the Divine manners therein, he is expelled. This means he must proceed according to what The Real wills concerning the manifestation of His Theophany in that matter or Presence (حضرة), whether through denial (الإنكار) or recognition (التعريف). He must treat The Real with the manners that are deserved.\n\nA sound report mentions this concerning His Theophany in the place of confusion (موطن التلبيس), which is His Theophany in forms other than the forms of beliefs, within the Presence of Beliefs (حضرة الاعتقادات). No one accepts Him or approaches Him, but they say, when He tells them, \"I am your Lord,\" \"We seek refuge in Allah from you.\" The Gnostic (العارف) recognizes Him in that rank, yet he knows, based on what He has informed him, that He does not wish to be recognized in that Presence by those whose knowledge here was restricted to a specific form they worshipped Him in. It is part of the Gnostic's manners to agree with them in denial, but without uttering the words of seeking refuge from Him, because he recognizes Him.\n\nWhen The Real says to them in that Presence, at that glance, \"Was there a sign (علامة) between you and Him by which you recognized Him?\" They say, \"Yes.\" Then He transforms Himself for them into that sign, despite the variation in signs. When they see it—which is the form they used to worship Him in—they then acknowledge Him. The Gnostic agrees with them in their acknowledgment, out of manners toward Allah and reality, and affirms for Him what the group affirmed.\n\nThis is the benefit of the science of Halting Places. As we said, there is no station or rank without a Halting Place between them, except for two stations, or two Presences, or two ranks, or two states, or two contests—however you wish to phrase it—between which there is no Halting Place. The reason is that it is one matter, but the state of the traveler changes within it, so he imagines that he has moved to another station or presence. He becomes bewildered because he did not see The Real halt him, yet the change has occurred for him. He does not know whether that change is due to his transition within the station or his transition away from it. If there is a Gnostic of the matter present, he informs him. If he has no master (أستاذ), the confusion remains. It is characteristic of this matter that The Real does not halt him, unlike what He did with him previously and what He will do with him in the future. The traveler fears improper manners (سوء الأدب) in the state that appears to him: should he treat it with the previous manners, or does it have different manners?\n\nThis is for the one whom The Real halts among the travelers. If The Real does not halt him in a Halting Place and does not grant him the distinction between what he is transitioning to and what he is transitioning from, the transitions occur for him within the very station he is in. For the possessor of this taste (الذوق), there is only one matter in which the transitions occur. This was the state of Al-Mundhirī, the author of *Al-Maqāmāt*, who based his book on this, extending them to one hundred ranks within a single rank, which is Love (المحبة). Such a person neither halts nor is bewildered, but he misses out on a great science concerning Allah and His attributes specific to what he is transitioning toward. He does not know the suitabilities from the side of The Real to this station. His knowledge is general (علم إجمال), contained within the first matter upon his entry into these Presences.\n\nThe knowledge of the possessor of Halting Places (صاحب المواقف) is detailed (علم تفصيل). He is excused for the manners he misses if they do not occur from him and he is ignorant of them, and it does not affect his state. He handles matters appropriately, but he does not descend to the level of the Halter, nor does he know what he missed, which the Halter knows, while he does not know the Halter.\n\nThis station we are in has a Halting Place that the possessor of Halting Places is ignorant of, or rather, bewildered by, because the suitability between what his specific Halting Place grants him and this station is distant from what the station is built upon. Likewise for the station that comes after it. However, the one who descends into it, even if he is bewildered, obtains from the Halting Place, during that halt, that if the suitability between the station and the halt is lifted, the suitability returns between the halt and the descender. He then knows the manners deserved by the Presence, despite the lack of suitability, and he thanks Allah for that.\n\nThe possessor of Halting Places is burdened (متعوب) but a great knower. The one who has no Halting Place is comfortable (مستريح) in his journey and not burdened. If they meet, the one without a Halting Place may criticize the state of the one who has Halting Places, imagining himself to be lower in rank. He may take issue with him and reproach him, saying, \"The path is easier than what you are upon,\" and act superior, due to his ignorance of the Halting Places. The possessor of Halting Places, however, does not ignore him or criticize his improper manners, but bears with him, and does not inform him of his state or what he missed of the path, for he knows that Allah did not intend that for him or qualify him for it. He accepts his words, and at most says to him, \"My brother, submit to my state just as I submit to your state,\" and leaves him.\n\nWhat I have alerted you to is among the most beneficial things on this path, due to the bewilderment and confusion it contains. Understand, and <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو اناسی: منزل اعتبار (منزل الاعتبار) اور اس کے اسرار کی معرفت، جو مقام محمدی (المقام المحمدي) سے متعلق ہے۔\n\nافعال میں اس کا (الحق کا) ظہور (التجلی) ہمارے نزدیک ممکن نہیں، جبکہ دوسروں کے نزدیک یہ جائز ہے۔\n\nوہ اس جواز پر اس کے فعل سے دلیل لاتے ہیں، اور فعل میں اسے کیسے دیکھا جائے جبکہ بندہ عاجز ہے؟\n\nپس کوئی کہتا ہے کہ الحق (ذات حق) کائنات میں ظاہر ہے، اور کوئی کہتا ہے کہ الحق (ذات حق) منع میں فیصلہ کن ہے۔\n\nاور اس امر کی حقیقت عجز اور حیرت (الحيرة) ہے، اور یہ صرف اسی پر منکشف ہوتا ہے جو کامیاب ہے۔\n\n### [یہ کہ تجلی ذاتی (التجلي الذاتي) مظہر کے بغیر ممنوع ہے]\n\nجان لو کہ تجلی ذاتی (التجلي الذاتي) اہل حقائق (أهل الحقائق) کے درمیان بغیر کسی اختلاف کے مظہر (مظہر) کے بغیر ممنوع ہے۔ اور مظاہر (المظاهر) میں تجلی (التجلی)، جو کہ معتقدات (المعتقدات) کی صورتوں میں تجلی ہے، بلا اختلاف واقع ہے۔ اور معقولات (المعقولات) میں تجلی بلا اختلاف واقع ہے۔ یہ دونوں تجلیات اعتبارات (تجلى الاعتبارات) ہیں، کیونکہ یہ مظاہر، خواہ وہ معقولات کی صورتیں ہوں یا معتقدات کی صورتیں، ایسے پل ہیں جن پر علم کے ذریعے عبور کیا جاتا ہے، یعنی یہ جانا جاتا ہے کہ ان صورتوں کے پیچھے ایک ایسا امر ہے جو نہ تو مشاہدہ کیا جا سکتا ہے اور نہ ہی جانا جا سکتا ہے۔ اور اس معلوم کے پیچھے، جس کا نہ مشاہدہ کیا جا سکتا ہے اور نہ ہی جانا جا سکتا ہے، کوئی ایسی حقیقت نہیں ہے جو اصلاً معلوم ہو۔\n\nاور جہاں تک افعال میں تجلی (التجلی) کا تعلق ہے، یعنی کائنات اور مظاہر کے اس ذات (الذات) سے ظاہر ہونے کی نسبت جس سے کائنات بنتی ہے اور مظاہر ظاہر ہوتے ہیں، تو یہ اللہ تعالیٰ کا قول ہے: (ما أَشْهَدْتُهُمْ خَلْقَ السَّماواتِ والْأَرْضِ) \"میں نے انہیں آسمانوں اور زمین کی تخلیق پر گواہ نہیں بنایا تھا۔\" پس الحق (ذات حق) سبحانہ نے ایک قوم کے معتقدات میں اس کے وقوع کو مقرر کیا اور ایک قوم کے معتقدات میں اس کے منع کو مقرر کیا۔ اور ہم نے ذکر کیا ہے کہ وہ سبحانہ معتقدات کی صورتوں میں تجلی (التجلی) فرماتا ہے۔\n\nپس جو شخص یہ جانتا ہے کہ اس کے اپنے اور دوسروں کے افعال اللہ کے مخلوق ہیں، باوجود اس کے کہ وہ انہیں اپنی قدرت سے مشاہدہ کرتا ہے، اور جانتا ہے کہ وہ الٰہی قدرت سے ہیں، باوجود اس کے کہ وہ اپنی قدرت یا دوسرے کی قدرت کا تعلق اس کے مقدور کے ساتھ، اس کے ایجاد اور عدم سے وجود (الوجود) میں لانے کے وقت، مشاہدہ نہیں کرتا، وہ اس بات سے منع کرتا ہے کہ الحق (ذات حق) افعال میں تجلی فرمائے، سوائے اس حد کے جو یہاں واقع ہوئی ہے۔ پس اس نے اس تجلی (التجلی) کے وقوع کو منع کیا۔\n\nاور جو شخص یہ جانتا ہے کہ اس کے اپنے افعال اسی کے مخلوق ہیں نہ کہ قدیم قدرت کے، باوجود اس کے کہ وہ انہیں بھی صرف ان کے وجود کے وقت ہی مشاہدہ سے جانتا ہے، اور یہ اعتقاد رکھنے والا اگر انصاف کرے تو اپنی قدرت کا تعلق ان کے ایجاد سے نہیں دیکھتا، بلکہ صرف جوارح (اعضاء) کا تعلق قائم حرکت سے مشاہدہ کرتا ہے، تو وہ اس تجلی کے وقوع کا قائل ہوا۔\n\nپس اس معاملے میں اہل شأن کے درمیان اختلاف ہے جو دنیا اور آخرت میں ختم نہیں ہوگا۔ البتہ دنیا اپنے حال کے تقاضے سے اس امر اور دیگر امور میں تنازع کا باعث بنتی ہے، جبکہ جنت میں اس بارے میں کوئی نزاع نہیں ہوگا، کیونکہ الحق (ذات حق) نے ہر ایک کو اس کے اعتقاد پر قائم رکھا ہے اور اس دار میں اس کے وہم کو باقی رکھا ہے کہ وہ اس کے افعال میں اس کے لیے متجلی (ظاہر) ہے، اور دوسرے پر اس کے علم کو باقی رکھا ہے کہ وہ اس کے افعال میں تجلی نہیں فرماتا، باوجود اس کے کہ جس پر اس کے وہم کو باقی رکھا گیا ہے، اس کے لیے اس شخص کی تجلی حاصل ہے جس پر اس کے علم کو منع کے ساتھ باقی رکھا گیا ہے۔\n\nپس منع کا قائل الحق (ذات حق) سے وہی مشاہدہ کرتا ہے جو افعال میں تجلی کے وقوع کا قائل مشاہدہ کرتا ہے، اور وہ اس تجلی میں جو کچھ مشاہدہ کرتا ہے اسے جانتا ہے، جیسا کہ یہاں وہ شخص جانتا ہے جو اپنے صادر ہونے والے معقولات کو سمجھتا ہے۔ اور وہ دوسرا شخص اللہ سے وہ نہیں جانتا جو منع کا قائل جانتا ہے۔\n\nاس سے یہ نتیجہ نکلا کہ یہ معاملہ مشکل ہے۔ پس وہ سبحانہ اس کا مثبت بھی ہے اور اس کا نفی کرنے والا بھی، ان چیزوں میں جن سے اس نے یہاں اپنی کتابوں میں اور اپنے رسولوں کی زبانوں پر ہمیں مخاطب کیا ہے، اور اسے اہل نظر کے افکار میں مقرر کیا ہے تاکہ عقلیں اسے اسی حد پر لیں جس پر اس نے افکار میں اس کے منع یا وقوع کو مقرر کیا ہے۔ اور یہ حجاب کبھی نہیں اٹھے گا۔ اور تکلیف (شرعی ذمہ داری) اس لحاظ سے متحقق ہے کہ افعال دونوں فریقوں کے درمیان بلا اختلاف کسب کیے گئے ہیں، اختلاف صرف اس میں ہے کہ ایجاد کس قدرت سے ہوا ہے۔ اللہ تعالیٰ نے فرمایا: (وتبين لكم كيف فعلنا بهم) \"اور تم پر واضح ہو گیا کہ ہم نے ان کے ساتھ کیا کیا۔\" اور یہ وقوع کے قائلین کے لیے سب سے قوی دلیل ہے۔\n\nاور منع کے قائلین کے لیے سب سے قوی دلیل یہ ہے: (أَ لَمْ تَرَ إِلى‏ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ) \"کیا تم نے اپنے رب کی طرف نہیں دیکھا کہ اس نے سائے کو کیسے پھیلایا؟\" پس اس نے رؤیت (دیکھنے) کو \"إلى\" (کی طرف) کے ساتھ جوڑا اور مرئی (دیکھی جانے والی چیز) کو \"کیف\" (کیسے) قرار دیا۔ پس منع کا قائل کہتا ہے: چونکہ ہم نے یہاں ذات حق (الحق) کا مشاہدہ نہیں کیا جبکہ وہ سائے کے پھیلانے کی کیفیت کو متعین کر رہا تھا، اور نہ ہی ہم نے اسے دیکھا، بلکہ ہم نے صرف کثیف اشخاص سے سائے کو پھیلتے ہوئے دیکھا جو ان جگہوں پر نور کے پھیلنے کو روکتے ہیں جہاں ان اشخاص کے سائے پھیلتے ہیں، تو ہم نے جانا کہ اس خطاب میں رؤیت کا تعلق صرف اس مشہود کیفیت کے علم سے ہے جس کا ہم نے ذکر کیا، اور یہ کہ یہ اللہ سبحانہ کی طرف سے ہے نہ کہ کسی اور کی طرف سے۔ یعنی اگر وہ چاہتا کہ کثیف اشخاص نصب ہوں اور نور ان کی ایک سمت میں ہو، اور وہ اشخاص نور کے ان جگہوں پر پھیلنے کو روکیں، تو اسے سائے کا نام دیا جاتا، یا وہ ان سائے کو ان جگہوں پر پھیلنے سے روک دیتا اور ان میں کوئی دوسرا نور پیدا نہ کرتا اور نہ ہی وہ محجوب نور ان جگہوں پر پھیلتا، تو اس کی ارادہ اس سے قاصر نہ ہوتی، جیسا کہ اللہ تعالیٰ نے فرمایا: (ثُمَّ قَبَضْناهُ إِلَيْنا قَبْضاً يَسِيراً) \"پھر ہم اسے اپنی طرف آہستہ آہستہ سمیٹ لیتے ہیں۔\" اور یہ سائے کا اس شخص کی طرف لوٹنا ہے جس سے وہ پھیلا تھا، نور کے ظاہر ہونے سے، یہاں تک کہ وہ جگہ مشاہدہ ہو جائے۔ پس اس نے مقبوض (سمیٹی ہوئی چیز) کو اللہ کی طرف سمیٹنا قرار دیا نہ کہ دیوار کی طرف۔ اور مشاہدے میں، جو آنکھ دیکھتی ہے، سائے کے سمٹنے اور کثیف شخص کی طرف سکڑنے کا سبب صرف نور کا ظاہر ہونا ہے۔\n\nپس الٰہی مسائل میں کوئی ایسا مسئلہ نہیں ہے جس میں حیرت (الحيرة) زیادہ یا عظیم تر ہو، سوائے افعال کے مسئلے کے، خاص طور پر مخلوق کے افعال کے ساتھ حمد اور ذم (تعریف اور مذمت) کے تعلق میں۔ یہ تعلق اس بات کو خارج کر دیتا ہے کہ مخلوق کے افعال ان کے ظاہر ہونے کے وقت مخلوق کے علاوہ کسی اور کے ہوں۔ اور مخالف کے مذہب میں، جو مخلوق سے فعل کی نفی کرتا ہے، اللہ کے تمام افعال اچھے ہیں، اور وہ بلا اختلاف اور بلا شک فعل کے لیے ذم کو ثابت کرتا ہے، اور اس کے نزدیک اس فعل کے ساتھ ذم کا تعلق اللہ کی طرف سے ہے، اور اس کا سبب کسب ہے، کیونکہ وہ اللہ کی حمد کے خلاف واقع ہوا، جس کا اسے حکم دیا گیا تھا مگر اس نے نہیں کیا، یا جس سے اسے منع کیا گیا تھا مگر اس نے کر دیا۔ اور اس میں جو کچھ ہے وہ ہے۔ اور ایسے ہی مسائل میں میں نے کہا:\n\nیہ حیرت (الحيرة) ایک اور حیرت سے صادر ہوئی، کاش میں جانتا کہ پھر کون ہے جو حیران نہیں ہوتا؟\n\nاگر میں کہوں \"میں\"، تو وہ کہتا ہے \"نہیں\"، اور اگر وہ کہے \"میں\"، تو اس پر اعتراض نہیں کیا جاتا۔\n\nمیں مجبور ہوں اور میرا کوئی فعل نہیں، اور جو کچھ میں کرتا ہوں وہ اضطرار سے ہے۔\n\nاور جس کی طرف میں اپنے فعل کی نسبت کرتا ہوں، وہ اپنے افعال میں بااختیار نہیں۔\n\nپس میں اور وہ ایک ایسے نقطے پر ہیں جو قائم ہے مگر اس کا کوئی ٹھکانہ نہیں۔\n\nپس ہم نے تمہیں جو کچھ اس باب میں ذکر کیا ہے اس کے ذریعے اس پر مطلع کر دیا ہے جو تمہاری حیرت (الحيرة) میں اضافہ کرے گا، اس کے بعد جو ہم نے ذکر کیا۔\n\n### [منزل حیرت (الحيرة) اور مقام غیرت (الغيرة)]\n\nپس جان لو کہ یہ منزل حقیقت میں منزل حیرت (الحيرة) اور مقام غیرت (الغيرة) ہے۔ اور اس منزل کے علوم میں سے، جو باب حیرت (الحيرة) میں داخل ہے، عدم (العدم) کا کونیت (الکینونۃ) کے ساتھ متصف ہونا ہے، جو اس کا تقاضا کرتی ہے۔ اور الحق (ذات حق) کا موجودات کو عدم (العدم) میں رکھنے اور عدم کو اس طرح پیدا کرنے کے ساتھ متصف ہونا ہے کہ کہا جائے کہ فاعل کا فعل لا شے ہے، اور لا شے فعل نہیں ہو سکتا۔ حالانکہ الحق (ذات حق) نے اس کی نسبت اپنی طرف کی اور فرمایا: (إن يشأ يذهبكم) \"اگر وہ چاہے تو تمہیں لے جائے\" (یعنی تمہیں عدم سے ملا دے) (ويأت بخلق جديد) \"اور ایک نئی مخلوق لے آئے۔\" پس دیکھو کہ اس نے عدم (العدم) سے ملانے کو مشیت (ارادہ) کی طرف منسوب کیا اور قدرت (القدرۃ) کی طرف منسوب نہیں کیا جس سے تخلیق اور جعل واقع ہوتا ہے۔ اور الٰہی کتب اس سے بھری پڑی ہیں اور یہ منزل ان پر مشتمل ہے۔\n\nاور اس بارے میں صحیح بات یہ ہے کہ جب موجودات کی ثابت اعیان ہیں، جیسا کہ ان کے لیے ذکر کیا گیا ہے، اس حال میں کہ وہ عدم (العدم) کے ساتھ متصف ہیں جو ممکن کے لیے ہے نہ کہ محال کے لیے، تو جس طرح اس نے انہیں وجود (الوجود) کے لیے ظاہر کیا اور انہیں وجود کا حال پہنایا اور انہیں عدم کے حال سے عاری کیا، اور اس طرح وہ موجد کہلایا اور یہ عین موجود کہلائی، تو یہ بعید نہیں کہ وہ انہیں اس حالت کی طرف لوٹا دے جہاں سے اس نے انہیں نکالا تھا، یعنی حالت عدم (العدم) کی طرف۔ پس الحق (ذات حق) اس طرح متصف ہو کہ وہ انہیں معدوم کرنے والا ہے، اور وہ اس طرح متصف ہوں کہ وہ معدوم ہیں۔ اور اس علم میں دخل نہ دو کہ یہ کس صفت سے حاصل ہوا ہے۔ اگر ہم سے سوال کیا جائے تو ہم دونوں امور اور دونوں حالتوں کے حصول کو مشیت (ارادہ) سے ملائیں گے، اور دونوں فریق اسے تسلیم کریں گے۔ اور اگر ہم سے اس عین کو وجود (الوجود) سے ملانے کے بارے میں سوال کیا جائے تو ہم اسے قدرت (القدرۃ) اور مشیت (ارادہ) کی طرف منسوب کریں گے، اور دونوں فریق اسے ہمارے لیے تسلیم کریں گے۔ پس اگر تم سمجھ گئے جو ہم چاہتے ہیں، تو سب کو مشیت (ارادہ) سے ملا دو، اور یہی زیادہ اولیٰ اور مناسب ہے، تاکہ تم خبر کی قسم میں نزاع سے محفوظ رہو، یہاں تک کہ تمام گروہوں کی طرف سے اس میں نزاع کا تصور بھی نہ ہو۔\n\nاور اسی باب سے ہے: (ذَهَبَ الله بِنُورِهِمْ) \"اللہ ان کے نور کو لے گیا۔\" یعنی اسے ان کی آنکھوں سے زائل کر دیا، لیکن ان کی آنکھوں سے اس کا چلے جانا اسے عدم (العدم) سے ملانے کو لازم نہیں کرتا، اگر یہ مفہوم نہ ہوتا کہ اللہ نے ان کی آنکھوں سے نور کو معدوم کر دیا، (وتَرَكَهُمْ في ظُلُماتٍ لا يُبْصِرُونَ) \"اور انہیں اندھیروں میں چھوڑ دیا کہ وہ کچھ نہیں دیکھتے۔\"\n\nاور اس منزل کے علوم میں سے یہ ہے کہ الحق (ذات حق) ایک جماعت کو کسی ایسے امر کے لیے مبعوث فرماتا ہے جسے ان میں سے کوئی ایک فرد انجام دیتا ہے، یعنی اس جماعت میں سے۔ اور اس منزل کے علوم میں سے یہ ہے کہ علم کا نظارہ (نظرة)، ضرب (مار) اور رمی (پھینکنے) سے وجود میں آنا، اور یہ امور کس طرح عالم (جاننے والے) کے متعلم (سیکھنے والے) سے کلام کرنے کی جگہ لیتے ہیں۔ اور ہمیں اس فن کا ذوق نظارہ (نظرة) کے ذوق سے حاصل ہوا۔\n\n### [سورج کے نور سے دیکھنا تمام مرئیات کو ان کی کثرت اور دوری کے باوجود شامل ہوتا ہے]\n\nپس جان لو کہ جس طرح سورج کے نور سے دیکھنا تمام مرئیات کو ان کی کثرت اور دوری کے باوجود، بغیر کسی طویل وقت کے، بلکہ لمحے کے عین وقت میں، نور کے مبصرات پر پھیلنے کا عین وقت، بصارت کے انہیں ادراک کرنے کا عین وقت، اور بصارت کے ادراک کردہ علم کے تعلق کا عین وقت ہوتا ہے، بغیر کسی زمانی ترتیب یا امتداد کے، اگرچہ ترتیب معقول ہے، جیسے علت اور معلول کی ترتیب باوجود ان کے وجود میں ہم آہنگی کے؛ اسی طرح لحظہ (نظارہ)، یا ضرب (مار)، یا رمی (پھینکنا) ان علوم کو شامل ہوتی ہے جو اللہ نے اس میں ودیعت کیے ہیں۔ پس جب وہ ضارب (مارنے والے)، یا رامی (پھینکنے والے)، یا ملاحظ (دیکھنے والے) سے واقع ہوتی ہے، تو وہ علم میں وہ سب کچھ ادراک کر لیتا ہے جو اس ضرب کی قوت میں ہے، جیسا کہ سورج کے نور سے لحظہ نے وہ سب کچھ دے دیا جو اس لحظہ کی قوت میں مبصرات میں تھا۔ اور قصور ضرب وغیرہ کی طرف سے نہیں ہے، کیونکہ وہ لامتناہی علوم کو شامل ہوتی ہے، جیسا کہ سورج اس سے زیادہ پر چمکتا ہے جتنا بصارت ادراک کرتی ہے۔ قصور صرف مدرک (ادراک کرنے والے) کے قلب میں ہوتا ہے، جیسا کہ مبصر (دیکھنے والے) میں اس سب کو ادراک کرنے سے قصور ہوتا ہے جس پر سورج چمکا ہے۔ اور یہ سب ایک ہی آن میں ہوتا ہے، اگر مدرک ان میں سے ہو جو زمان کے پابند ہیں، جیسے وہ ارواح جو تحیز (جگہ گھیرنے) کے ساتھ متصف نہیں ہوتیں، تو وہ اس چیز کو بغیر زمان کے ادراک کرتی ہیں جو زمان میں اور بغیر زمان کے ادراک کی جاتی ہے۔\n\nاور اسی کی طرف اشارہ ہے نبی اکرم صلی اللہ علیہ وسلم کے اس قول سے:\n\n**حدیث:** (إن الحق ضربه بيده بين كتفيه أو في ظهره فوجد برد الأنامل بين ثدييه أو في صدره فعلم علم الأولين والآخرين)\n**ترجمہ:** \"بیشک الحق (ذات حق) نے اپنے ہاتھ سے ان کے دونوں کندھوں کے درمیان یا ان کی پشت پر ضرب لگائی، تو انہوں نے انگلیوں کی ٹھنڈک اپنے دونوں پستانوں کے درمیان یا اپنے سینے میں محسوس کی، پس انہوں نے اولین و آخرین کا علم جان لیا۔\"\n\nپس پاک ہے وہ جو جسے چاہتا ہے، جس چیز سے چاہتا ہے، جیسے چاہتا ہے، سکھاتا ہے۔ اس کے سوا کوئی معبود نہیں، وہ علیم (جاننے والا) اور قدیر (قدرت والا) ہے۔\n\nاور اسی باب سے ہے جب حنین کے دن آپ صلی اللہ علیہ وسلم نے دشمنوں کے چہروں پر مٹی پھینکی، تو وہ قوم کی آنکھوں میں پڑی اور وہ بھاگ گئے۔ پس دیکھو کہ اس رمی (پھینکنے) میں کیا شامل تھا اور اس ضرب (مار) میں کیا شامل تھا۔ اور جہاں تک نظارہ (نظرة) کا تعلق ہے، تو میں نے اسے کسی سے روایت نہیں کیا اور نہ ہی کسی سے سنا، لیکن میں نے اسے خود اپنے آپ میں دیکھا: میں نے ایک نظارہ کیا تو میں نے وہ علوم جان لیے جو اس میں شامل تھے، اور مجھے ایک نظارہ دیا گیا تو میں نے اس کے ذریعے اس شخص کے بارے میں وہ سب کچھ جان لیا جسے میں نے دیکھا، جو اس نظارہ میں علوم شامل تھے۔ اور یہی علم الاذواق (ذوق کا علم) ہے۔ اور یہیں سے اس قول کا علم ہوتا ہے جو کہتا ہے: وہ سنتا ہے جس سے وہ دیکھتا ہے، وہ دیکھتا ہے جس سے وہ کلام کرتا ہے۔ یہ گزر چکا۔\n\nاور جہاں تک اس فائدے کا تعلق ہے کہ ایک فرد وہ کام انجام دیتا ہے جس کے لیے جماعت مبعوث کی جاتی ہے، تو یہ اس جماعت پر الٰہی انعام اور الحق (ذات حق) کی ان پر عنایت کی وجہ سے ہے، جہاں اس نے انہیں اس خیر میں حصہ دیا، نہ کہ قدرت (القدرۃ) کی کمی کی وجہ سے کہ وہ ایک فرد کو جماعت کے بغیر وہ امر نہ پہنچا سکے۔ سوائے اس کے کہ وہ نسبتوں کی حقائق ہوں، کیونکہ یہ ایک حقیقی ترتیب ہے نہ کہ وضعی، جیسے حی (زندہ) کا عالم (جاننے والے) پر مقدم ہونا، اور مرید (ارادہ کرنے والے) کا عالم کے احاطے میں داخل ہونا، اور قادر (قدرت والے) کا مرید کے احاطے میں داخل ہونا۔ پس مرید وہ کام انجام نہیں دیتا جو قادر کے لیے خاص ہے، اور عالم وہ کام انجام نہیں دیتا جو مرید کے لیے خاص ہے، اور حی وہ کام انجام نہیں دیتا جو عالم کے لیے خاص ہے، اور عالم وہ کام انجام نہیں دیتا جو حی کے لیے خاص ہے، اور مرید وہ کام انجام نہیں دیتا جو عالم کے لیے خاص ہے، اور قادر وہ کام انجام نہیں دیتا جو مرید کے لیے خاص ہے۔ اور عین عالم ہی عین حی ہے، عین مرید ہے، عین قادر ہے۔ اور عین حیات ہی عین علم ہے، عین ارادہ ہے، عین قدرت ہے۔ اور عین حیات ہی عین حی ہے، عین عالم، عین مرید، عین قادر ہے۔ اور اسی طرح باقی بھی۔ پس نسبتیں مختلف ہیں اور عین (حقیقت) ایک ہے، اور معلوم صفت، حال اور موصوف ہے۔ پس وحدت (الوحدۃ) کی عین میں جمع ہونا حکماً ہے نہ کہ عیناً، کیونکہ اس مجموعے کے لیے وہاں موجود اعیان نہیں ہیں، بلکہ یہ ایک ہی عین ہے جس کی مختلف نسبتیں ہیں جو جہاں تک پہنچتی ہیں پہنچتی ہیں۔ پس یہی موجودات میں وجودی سریان (پھیلاؤ) ہے۔ پس یہ ایک فرد کا وہ کام انجام دینا ہے جو جماعت انجام دیتی ہے، موجود اور معقول کے درمیان۔ پس یہ منزل ان چیزوں کو شامل ہے جن کا ہم نے ذکر کیا۔\n\nاور اس منزل کے علوم میں سے عناصر اور مولدات (پیدا ہونے والی چیزوں) کی ایک دوسرے میں تبدیلی کی معرفت ہے، جو متبدل ہونے والی چیز اور جس میں تبدیل ہونا ہے، ان کے درمیان ایک رابطے کی نسبت (نسبۃ) کے ذریعے ہوتی ہے۔ اگر وہ رابطے کی نسبت ختم ہو جائے تو کوئی چیز کسی دوسری چیز میں تبدیل نہیں ہو سکتی، کیونکہ وہ ہر لحاظ سے اس سے متنافر (مخالف) ہے۔ اور اسی وجہ سے رب (الرب) اور مربوب (مربوب) کے درمیان نسبت (النسبۃ) موجود تھی، اور اسی نسبت سے وہ اس کا رب تھا، اور مربوب اور رب کی ذات کے درمیان کوئی نسبت نہیں تھی۔ اسی لیے ذات (الذات) سے کوئی شے صادر نہیں ہوئی، جیسا کہ علل اور معلولات کے قائلین کہتے ہیں۔ پس ذات (الذات) اشیاء کو ایجاد کرنے کی طرف متوجہ نہیں ہوتی اس حیثیت سے کہ وہ ذات ہے، بلکہ وہ اشیاء کی طرف قدرت (القدرۃ) کی نسبت اور مانع کے عدم کی نسبت سے متوجہ ہوتی ہے، اور اسی کو الوہیت (الألوهۃ) کا نام دیا جاتا ہے۔\n\nاسی طرح اللہ نے طبائع کو تبدیلیوں کے لیے ایک عجیب ترتیب دی ہے۔ اس نے عنصرِ نار (آگ) کے بعد ہوا کو رکھا، اور عنصرِ ہوا کے بعد پانی کو، اور عنصرِ پانی کے بعد مٹی کو۔ پس پانی اور آگ کے درمیان ہر لحاظ سے طبعی منافرت ہے، اور ہوا اور مٹی کے درمیان ہر لحاظ سے طبعی منافرت ہے۔ پس اس نے ان کے درمیان واسطے رکھے، کیونکہ وہ دو رخے ہیں، اور ہر ایک کا دونوں اطراف سے ملنے والوں کے ساتھ خاص مناسبت ہے۔ پس جب الحق (ذات حق) پانی کو آگ میں تبدیل کرنا چاہتا ہے، جو طبعاً متنافر ہے، تو وہ پہلے اسے ہوا میں تبدیل کرتا ہے، پھر اس ہوا کو آگ میں تبدیل کرتا ہے۔ پس اس نے پانی کو آگ میں تبدیل نہیں کیا جب تک کہ اسے مناسبت کی وجہ سے ہوا میں منتقل نہ کر دیا۔ اور اسی طرح عالم طبیعت میں تمام تبدیلیاں ہیں۔\n\nاور جہاں تک الٰہیات کا تعلق ہے، تو ہم نے اس مسئلے میں اور اس کتاب میں اس کی طرف اشارہ کیا ہے، مخلوق کی ذات کی صفت کو خالق کی ذات کی صفت سے متصف کرنے اور خالق کی ذات کی صفت کو مخلوق کی ذات کی صفت سے متصف کرنے میں۔ پھر خالق کی ذات کا اس چیز سے مجرد ہونا جو مخلوق کی ذات کا تقاضا کرتی ہے، اور مخلوق کی ذات کا اس چیز سے مجرد ہونا جو خالق کی ذات کا تقاضا کرتی ہے۔ اگر رب (الرب) اور مربوب (مربوب) کے درمیان موجود نسبت (النسبۃ) نہ ہوتی، تو نہ تو یہ (مخلوق) اس پر دلالت کرتا اور نہ ہی وہ (خالق) اس کی صفت سے متصف ہونا قبول کرتا، اور نہ ہی یہ (مخلوق) اس کی صفت سے متصف ہونا قبول کرتا۔ اور اسی نسبت سے الحق (ذات حق) اپنے بندوں کو مکلف کرنے والا، حکم دینے والا اور منع کرنے والا تھا، اور اسی نسبت سے مخلوق مکلف، مامور اور ممنوع تھی۔ پس اس بات کی تحقیق کرو جس پر ہم نے تمہیں متنبہ کیا ہے، اگر تم صاحب قلب ہو اور تم نے کان لگائے جبکہ تم اس کے شاہد ہو جو ہم نے ذکر۔ اگر تم ایسے نہیں ہو، تو تم نے بہت سی بھلائی اور ایک نفع بخش، عظیم قدر والا علم کھو دیا، لیکن یہ بہت خطرناک ہے، مگر یہ کہ اللہ عصمت عطا فرمائے۔\n\nاور اس منزل میں ایک پوشیدہ الٰہی مکر (مکر إلهي) ہے جو اسم القاہر (القاهر) اور القادر (القادر) سے صادر ہوا ہے۔ یہ عالم غیب سے عالم حس میں موجود ہے، جس کے ہاتھ میں قہر کی تلوار سونت کر ہے، جو رحمانی اسم سے متعلق موجود کو تلاش کرتا ہے، جیسے موسیٰ کا فرعون کو تلاش کرنا اور نمرود اور انبیاء کے فرعونوں کا انبیاء علیہم السلام کو تلاش کرنا۔ یہ سب صفات ہیں جو عارف (العارف) کے ظاہر اور باطن میں قائم ہوتی ہیں، جنہیں وہ اپنے نفس سے منکشف کرتا ہے۔ پس جب اسم القاہر (القاهر) کے رجال حملہ کرتے ہیں، تو عارف اسم الباطن (الباطن) کی پناہ لیتا ہے، جو قاہر (القاہر) کے پاس اس کی شفاعت کرتا ہے۔ پس اسم الباطن (الباطن) کی وجہ سے الٰہی اسماء کی ایک جماعت تیزی سے آتی ہے، اس کی تعظیم کرتے ہوئے کیونکہ وہ \"ھو\" (ذات مطلق) کے قریب ہے، اور وہ اسم القائم (القائم) کے ساتھ کھڑے ہوتے ہیں جو اسم الظاہر (الظاهر) پر قائم ہے، کیونکہ اس کا مرتبہ \"ھو\" سے دور ہے۔ پس اسم (الحق) نے ان کے لیے عالم غیب سے عالم برزخ (البرزخ) میں ایک جماعت قائم کی، کیونکہ وہ عالم حس سے تاثیر میں زیادہ قوی ہے، کیونکہ وہ عالم حس میں وہی تاثیر کرتا ہے جو حس تاثیر کرتی ہے، اور حس خیال میں تاثیر نہیں کر سکتی۔ کیا تم نہیں دیکھتے کہ سونے والا خیال میں دیکھتا ہے کہ وہ جماع کر رہا ہے تو اس سے عالم حس میں پانی (منی) نکلتا ہے، اور وہ ایسی چیز دیکھتا ہے جو اسے خوفزدہ کرتی ہے تو سونے والے کا جسم حرکت یا آواز یا سمجھ میں آنے والی بات یا پسینے سے متاثر ہوتا ہے، اس پر اس کے سلطان کی قوت کی وجہ سے۔ اور خیال حس کی صورت میں وہ چیز ظاہر کرتا ہے جو بذات خود محسوس نہیں ہوتی اور اسے حس سے ملا دیتا ہے۔ اور حس کی قوت میں یہ نہیں ہے کہ محسوس کو بعینہ متخیل کر کے لوٹا دے۔ پس اس عارف (العارف) کو اس برزخی جماعت کی عین سے ایسے علوم حاصل ہوتے ہیں جن کے ذریعے وہ اس شبہہ پر مطلع ہوتا ہے جو اس کی سعادت میں قدح (نقصان) ڈالتا، اگر وہ اس پر قائم رہتا اور مر جاتا۔ اور اس منزل میں اس شبہہ اور ان دلائل کا ہونا ضروری ہے۔\n\nاور جان لو کہ منازل (المنازل) میں سے کوئی منزل نہیں، اور منازلات (المنازلات) میں سے کوئی منازلہ نہیں، اور مقامات (المقامات) میں سے کوئی مقام نہیں، اور حالات (الحالات) میں سے کوئی حال نہیں، مگر ان کے درمیان ایک برزخ (البرزخ) ہے جہاں بندے کو روکا جاتا ہے، جسے موقف (الموقف) کہا جاتا ہے۔ اور یہی وہ جگہ ہے جہاں سے صاحب المواقف محمد بن عبدالجبار النفری رحمۃ اللہ علیہ نے اپنی کتاب \"المواقف\" میں کلام کیا ہے، جس میں وہ کہتے ہیں: \"الحق (ذات حق) نے مجھے فلاں موقف میں روکا۔\" پس وہ اسم جس کی طرف وہ اسے منسوب کرتے ہیں، وہ منزل ہے جس کی طرف وہ منتقل ہوتا ہے، یا مقام، یا حال، یا منازلہ۔ سوائے ان کے قول کے: \"اس نے مجھے مواقف کے پیچھے ایک موقف میں روکا۔\" تو وہ موقف اس اسم کے علاوہ کسی اور نام سے موسوم ہوتا ہے جس کی طرف وہ منتقل ہوتا ہے، اور وہ وہ موقف ہے جس کے بعد وہ نہیں ہوتا جو پہلے کے مناسب ہو۔ اور یہ اس وقت ہوتا ہے جب الحق (ذات حق) اسے مقام سے حال کی طرف، اور حال سے مقام کی طرف، اور مقام سے منزل کی طرف، اور منزل سے منازلات کی طرف، یا منازلات سے مقام کی طرف منتقل کرنا چاہتا ہے۔ اور ان مواقف (المواقف) کا فائدہ یہ ہے کہ جب الحق (ذات حق) بندے کو ایک چیز سے دوسری چیز کی طرف منتقل کرنا چاہتا ہے، تو اسے اس چیز کے درمیان روکتا ہے جس سے وہ منتقل ہو رہا ہے اور جس کی طرف وہ منتقل ہو رہا ہے، پس اسے اس چیز کے آداب (الآداب) عطا کرتا ہے جس کی طرف وہ منتقل ہو رہا ہے، اور اسے سکھاتا ہے کہ وہ اس امر کے آداب کیسے بجا لائے جس کا وہ استقبال کر رہا ہے۔ کیونکہ الحق (ذات حق) کے ہر منزل، مقام، حال اور منازلہ کے لیے آداب ہیں، اگر بندہ ان میں الٰہی آداب کی پابندی نہ کرے تو اسے نکال دیا جاتا ہے۔ اور وہ یہ ہے کہ وہ ان میں اس طرح چلے جیسا الحق (ذات حق) چاہتا ہے کہ وہ اس امر یا اس حضرہ میں اپنے تجلی (التجلی) کے ظہور کے ذریعے ہو، خواہ وہ انکار ہو یا تعریف۔ پس وہ الحق (ذات حق) کے ساتھ ان آداب کے مطابق معاملہ کرے جو اس کا حق ہے۔\n\nاور اس بارے میں صحیح خبر وارد ہوئی ہے، اس کے سبحانہ کے موطن تلبیس (التبلیس) میں تجلی (التجلی) کے بارے میں، اور وہ معتقدات کی حضرہ میں معتقدات کی صورتوں کے علاوہ میں اس کا تجلی ہے۔ پس کوئی بھی اسے قبول نہیں کرتا اور نہ ہی اس کے قریب آتا ہے، بلکہ جب وہ ان سے کہتا ہے: \"میں تمہارا رب ہوں،\" تو وہ کہتے ہیں: \"ہم تجھ سے اللہ کی پناہ مانگتے ہیں۔\" پس اس مقام پر عارف (العارف) اسے پہچانتا ہے، لیکن اسے اس بات کا علم ہو چکا ہے کہ الحق (ذات حق) نہیں چاہتا کہ اسے اس حضرہ میں وہ شخص پہچانے جو یہاں معرفت (المعرفۃ) کو ایک خاص صورت کے ساتھ مقید کیے ہوئے تھا جس میں وہ اس کی عبادت کرتا تھا۔ پس عارف کے آداب میں سے یہ ہے کہ وہ ان کے انکار میں ان کی موافقت کرے، لیکن وہ اس چیز کا تلفظ نہ کرے جس کا انہوں نے اس سے پناہ مانگتے ہوئے تلفظ کیا، کیونکہ وہ اسے پہچانتا ہے۔ پس جب الحق (ذات حق) اس حضرہ میں، اس نظارے کے وقت، ان سے کہتا ہے: \"کیا تمہارے اور اس کے درمیان کوئی علامت تھی جس سے تم اسے پہچانتے تھے؟\" تو وہ کہتے ہیں: \"ہاں۔\" پس وہ سبحانہ ان کے لیے اس علامت میں تبدیل ہو جاتا ہے، علامتوں کے اختلاف کے ساتھ۔ پس جب وہ اسے دیکھتے ہیں، اور وہ وہی صورت ہوتی ہے جس میں وہ اس کی عبادت کرتے تھے، تب وہ اس کا اعتراف کرتے ہیں۔ اور عارف (العارف) بھی ان کے اعتراف میں ان کی موافقت کرتا ہے، اللہ کے ساتھ ادب اور حقیقت کی وجہ سے، اور اس کے لیے اقرار کرتا ہے جس کا جماعت نے اقرار کیا۔\n\nپس یہ مواقف (المواقف) کے علم کا فائدہ ہے۔ اور جیسا کہ ہم نے کہا، وہاں کوئی منزل یا مقام نہیں ہے مگر ان کے درمیان ایک موقف ہے، سوائے دو منزلوں یا دو حضرات یا دو مقامات یا دو حالوں یا دو منازلات کے، جیسے چاہو کہہ لو، جن کے درمیان کوئی موقف نہیں ہوتا۔ اور اس کی وجہ یہ ہے کہ وہ ایک ہی امر ہوتا ہے، لیکن سالک پر اس میں اس کا حال بدل جاتا ہے، تو وہ خیال کرتا ہے کہ وہ کسی دوسری منزل یا دوسری حضرہ میں منتقل ہو گیا ہے، تو وہ حیران (حیران) ہو جاتا ہے کیونکہ اس نے الحق (ذات حق) کو اسے روکتے ہوئے نہیں دیکھا، اور تبدیلی اس کے نزدیک حاصل ہے۔ پس وہ نہیں جانتا کہ یہ تبدیلی جو اس میں ظاہر ہوئی ہے، کیا یہ منزل میں اس کے انتقال سے ہے یا اس سے انتقال کرنے سے؟ اگر وہاں امر کا کوئی عارف ہو تو وہ اسے بتا دیتا ہے، اور اگر اس کا کوئی استاد نہ ہو تو تلبیس (التبلیس) باقی رہتی ہے، کیونکہ اس امر کی شان یہ ہے کہ الحق (ذات حق) اسے نہیں روکتا جیسا کہ اس نے اس کے ساتھ پہلے کیا تھا اور جیسا کہ وہ اس کے ساتھ آئندہ کرے گا۔ پس سالک اس حال میں جو اس پر ظاہر ہوتا ہے، سوء ادب سے ڈرتا ہے کہ کیا وہ اس کے ساتھ پچھلے ادب کے مطابق معاملہ کرے یا اس کا کوئی دوسرا ادب ہے؟\n\nاور یہ اس کے لیے ہے جسے الحق (ذات حق) نے سالکین میں سے روکا ہے۔ پس اگر الحق (ذات حق) اسے ان مواقف میں سے کسی موقف میں نہ روکے اور اسے اس چیز کے درمیان فصل نہ دے جس کی طرف وہ منتقل ہو رہا ہے اور جس سے وہ منتقل ہو رہا ہے، تو اس کے نزدیک انتقالات اسی منزل کے اندر ہوتے ہیں جس میں وہ ہے، کیونکہ اس ذوق کے مالک کے نزدیک صرف ایک ہی امر ہے جس میں انتقالات ہوتے ہیں۔ اور یہی صاحب المقامات المنذری کا حال تھا، اور اسی پر انہوں نے اپنی معروف کتاب \"المقامات\" کی بنیاد رکھی اور اسے ایک ہی مقام، یعنی محبت (المحبۃ) میں سو مقامات تک پہنچایا۔ پس ایسا شخص نہ رکتا ہے اور نہ حیران ہوتا ہے، لیکن وہ اللہ اور اس کی صفات کے بارے میں ایک عظیم علم سے محروم ہو جاتا ہے جو اس چیز کے لیے خاص ہیں جس کی طرف وہ منتقل ہوتا ہے۔ پس وہ الحق (ذات حق) کی طرف سے اس منزل کے لیے مناسبتوں کو نہیں جانتا۔ پس اس کا علم اجمالی علم ہوتا ہے جو پہلے امر میں شامل تھا جب وہ ان حضرات میں داخل ہوا تھا۔ اور صاحب المواقف کا علم تفصیلی علم ہوتا ہے، لیکن اگر اس سے آداب میں کوئی کمی واقع ہو جائے اور وہ اس میں جاہل رہے تو اسے معاف کر دیا جاتا ہے، اور یہ اس کے حال پر اثر انداز نہیں ہوتا، بلکہ وہ امور کو ویسے ہی دیتا ہے جیسا کہ ہونا چاہیے، لیکن وہ واقف (موقف میں رکنے والے) کے مرتبے پر نہیں اترتا اور نہ ہی وہ جانتا ہے کہ اس سے کیا چھوٹ گیا ہے، جسے واقف جانتا ہے، اور وہ واقف کو نہیں جانتا۔\n\nپس یہ منزل جس میں ہم ہیں، اس کا ایک موقف ہے جس میں صاحب المواقف جاہل رہتا ہے، بلکہ حیران (حیران) ہو جاتا ہے، کیونکہ اس موقف خاص اور اس منزل کے درمیان مناسبت دور ہے جس پر منزل کی بنیاد رکھی گئی ہے۔ اور اسی طرح وہ بھی جو اس کے بعد آتا ہے۔ البتہ اس میں نازل ہونے والا، اگرچہ حیران (حیران) ہوتا ہے، لیکن جب منزل اور وقفی کے درمیان مناسبت ختم ہو جاتی ہے، تو اسے اس وقفی میں موقف سے یہ حاصل ہوتا ہے کہ مناسبت وقفی اور نازل ہونے والے کے درمیان لوٹ آتی ہے۔ پس وہ جانتا ہے کہ حضرہ کے آداب کیا ہیں، مناسبت کے ختم ہونے کے باوجود۔ پس وہ اس پر اللہ کا شکر ادا کرتا ہے۔ پس صاحب المواقف تھکا ہوا ہوتا ہے لیکن وہ ایک بڑا عالم ہوتا ہے، اور وہ شخص جس کا کوئی موقف نہیں ہوتا، وہ اپنے سلوک میں آرام دہ ہوتا ہے اور اس میں تھکا ہوا نہیں ہوتا۔ اور بسا اوقات جب وہ دونوں ملتے ہیں اور وہ شخص جس کا کوئی موقف نہیں ہے، صاحب المواقف کا حال دیکھتا ہے، تو وہ اس پر اس مشقت کی وجہ سے انکار کرتا ہے جو وہ اس میں دیکھتا ہے، اور خیال کرتا ہے کہ وہ مرتبے میں اس سے کم ہے، پس وہ اس پر اعتراض کرتا ہے اور اسے اس میں ملامت کرتا ہے اور کہتا ہے کہ راستہ اس سے زیادہ آسان ہے جس پر تم ہو۔ اور وہ اس پر شیخ بن جاتا ہے، اور یہ اس کی مواقف سے جہالت کی وجہ سے ہے۔ اور جہاں تک صاحب المواقف کا تعلق ہے، تو وہ اسے جاہل نہیں سمجھتا اور نہ ہی اس پر اس سوء ادب کا انکار کرتا ہے جس کا اس نے اس کے ساتھ معاملہ کیا، اور وہ اسے اس میں برداشت کرتا ہے، اور نہ ہی اسے اپنے حال سے آگاہ کرتا ہے اور نہ ہی اس سے جو اسے راستے میں حاصل ہوا ہے، کیونکہ وہ جانتا ہے کہ اللہ نے اسے اس کے لیے نہیں چاہا اور نہ ہی اسے اس کا اہل بنایا۔ پس وہ اس کی بات قبول کرتا ہے اور زیادہ سے زیادہ یہ کہتا ہے: \"اے میرے بھائی! میرے حال کو تسلیم کر لو جیسا کہ میں نے تمہارے حال کو تسلیم کیا ہے۔\" اور اسے چھوڑ دیتا ہے۔ اور یہ جس پر میں نے تمہیں متنبہ کیا ہے، اس راستے میں سب سے زیادہ نفع بخش چیزوں میں سے ہے، کیونکہ اس میں حیرت (الحيرة) اور تلبیس (التبلیس) ہے۔ پس سمجھو، اور (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ) \"اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔\"",
    "fa": "«باب دویست و هفتاد و نهم: در معرفت منزل اعتبار (الاعتبار) و اسرار آن از مقام محمدی (المقام المحمدي)»\n\nتجلی او در افعال ممکن نیست *** نزد ما، و نزد دیگری آن جایز است\nو به فعل او در آن جواز احتجاج می‌کنند *** چگونه در فعل دیده شود در حالی که بنده عاجز است؟\nپس یکی می‌گوید حق در کائنات ظاهر است *** و دیگری می‌گوید حق در منع، قاطع است\nو تحقیق این امر، عجز و حیرت است *** و آشکار نمی‌شود مگر برای کسی که رستگار است.\n\n### [اینکه تجلی ذاتی در غیر مظهر ممنوع است]\n\nبدان که تجلی ذاتی (التجلي الذاتي) بدون هیچ اختلافی میان اهل حقایق (أهل الحقائق) در غیر مظهر ممنوع است. و تجلی در مظاهر، که همان تجلی در صور معتقدات است، بدون اختلاف واقع می‌شود. و تجلی در معقولات نیز بدون اختلاف واقع می‌شود. و این دو، تجلی اعتبارات (تجلى الاعتبارات) هستند؛ زیرا این مظاهر، چه صور معقولات باشند و چه صور معتقدات، پل‌هایی هستند که با علم از آن‌ها عبور می‌شود. یعنی دانسته می‌شود که ورای این صور، امری است که نه صحیح است شهود شود و نه صحیح است علم به آن حاصل شود. و ورای آن معلومی که نه شهود می‌شود و نه علم به آن حاصل می‌گردد، اصلاً حقیقتی که علم به آن تعلق گیرد، وجود ندارد.\n\nو اما تجلی در افعال (التجلي في الأفعال) – منظورم نسبت ظهور کائنات و مظاهر از ذاتی است که کائنات از آن تکوّن می‌یابند و مظاهر از آن ظاهر می‌شوند – و آن قول خداوند متعال است: **مَا أَشْهَدْتُهُمْ خَلْقَ السَّمَاوَاتِ وَالْأَرْضِ** (من آنان را بر آفرینش آسمان‌ها و زمین گواه نگرفتم). حق سبحانه در معتقدات قومی وقوع آن را مقرر داشته و در معتقدات قومی منع وقوع آن را مقرر داشته است. و او سبحانه، همان‌طور که ذکر کردیم، در صور معتقدات تجلی می‌کند.\n\nپس کسی که بداند افعال خود و دیگران مخلوق خداست، با وجود اینکه آن‌ها را از قدرت خود مشاهده می‌کند و می‌داند که آن‌ها از قدرت الهی (القدرة الإلهية) است، در حالی که تعلق قدرت خود یا قدرت دیگری را به مقدور خود در حال ایجاد و بیرون آوردن آن از عدم به وجود (الوجود) شهود نمی‌کند، منع می‌کند که حق در افعال تجلی کند، مگر به همان حدی که در اینجا واقع شده است. پس وقوع این تجلی را منع می‌کند. و کسی که بداند افعال خود مخلوق خود اوست نه مخلوق قدرت قدیم، با وجود اینکه او نیز آن‌ها را جز در حال وجودشان به شهود نمی‌شناسد و صاحب این اعتقاد اگر انصاف دهد، تعلق قدرت خود را به ایجاد آن‌ها نمی‌بیند، بلکه تعلق جارحه (عضو بدن) را به حرکت قائم مشاهده می‌کند، قائل به وقوع این تجلی می‌شود.\n\nپس در این باره میان اهل این شأن اختلافی است که نه در دنیا و نه در آخرت برطرف نمی‌شود. جز اینکه حال دنیا اقتضا می‌کند که در این امر و غیر آن نزاع کنند، اما در بهشت نزاعی در این باره نیست؛ زیرا حق هر یک را بر اعتقادش مقرر داشته و وهم (گمان) کسی را که قائل به تجلی در افعال است، در آن سرا باقی می‌گذارد که حق برای او در افعالش متجلی است، و علم کسی را که قائل به منع است، باقی می‌گذارد که حق در افعالش تجلی نمی‌کند، با وجود اینکه تجلی کسی که وهمش باقی مانده، برای کسی که علمش بر منع باقی مانده، حاصل است. پس صاحب منع، از حق همان را مشاهده می‌کند که کسی که قائل به وقوع تجلی در افعال است، مشاهده می‌کند. و آنچه را در آن تجلی شهود می‌کند، می‌شناسد، همان‌طور که در اینجا کسی که معقولات صادر شده از خود را تعقل می‌کند، می‌شناسد. و آن دیگری (قائل به وقوع) این چیزی را که قائل به منع می‌داند، از خدا نمی‌داند. از این رو، امر مشکل شده است. پس او سبحانه هم اثبات‌کننده آن است و هم نفی‌کننده آن، در آنچه در اینجا در کتب خود و بر زبان رسولانش ما را مخاطب ساخته و در افکار اهل نظر مقرر داشته تا عقول آن را بر همان حدی که در افکار مقرر شده است، از منع یا وقوع آن بپذیرند. و این حجاب هرگز برطرف نمی‌شود. و تکلیف (التكليف) محقق است از این جهت که افعال، مکتسب (کسب شده) هستند، بدون اختلاف میان دو طایفه. اختلاف فقط در این است که ایجاد از کدام یک از دو قدرت بوده است.\n\nخداوند متعال می‌فرماید: **وَتَبَيَّنَ لَكُمْ كَيْفَ فَعَلْنَا بِهِمْ** (و برای شما روشن شد که چگونه با آنان رفتار کردیم). و این قوی‌ترین حجت برای قائلین به وقوع است. و همچنین قوی‌ترین حجت برای قائلین به منع است: **أَلَمْ تَرَ إِلَى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ** (آیا به پروردگارت ننگریستی که چگونه سایه را گسترانید؟). پس رؤیت را به \"إلی\" (به سوی) پیوند داد و مرئی (آنچه دیده می‌شود) را \"کیف\" (چگونگی) قرار داد. پس صاحب منع می‌گوید: چون ما در اینجا ذات حق را در حالی که چگونگی گسترش سایه را ایجاد می‌کرد، شهود نکردیم و او را ندیدیم، بلکه گسترش سایه‌ها را از اشخاص کثیف (اجسام مادی) دیدیم که مانع می‌شوند نور بر مکان‌هایی که سایه‌های این اشخاص در آنجا گسترده می‌شود، بتابد، دانستیم که رؤیت در این خطاب، تنها متعلق به علم به آن کیفیت مشهود است که ذکر کردیم و اینکه آن از جانب خداوند سبحان است نه از غیر او. یعنی اگر او اراده کند که اشخاص کثیف برپا باشند و نور در جهتی از آن‌ها باشد، با منع آن اشخاص از انبساط نور بر آن مکان‌ها، این منع را سایه می‌نامد، یا آن سایه‌ها را از انبساط بر آن مکان‌ها قبض می‌کند و نور دیگری در آنجا خلق نمی‌کند و آن نور محجوب بر آن مکان‌ها نمی‌تابد، زیرا اراده او از این کار قاصر نیست، چنانکه خداوند متعال می‌فرماید: **ثُمَّ قَبَضْنَاهُ إِلَيْنَا قَبْضًا يَسِيرًا** (سپس آن را به سوی خود به آرامی قبض می‌کنیم). و این بازگشت سایه به سوی شخصی است که از آن ممتد شده بود، با ظهور نور تا آن مکان شهود شود. پس قبض شده را به سوی خدا قرار داد نه به سوی دیوار. و در شاهد (دنیای محسوس) و آنچه چشم می‌بیند، سبب انقباض سایه و جمع شدن آن به سوی شخص کثیف، تنها ظهور نور است.\n\nپس در مسائل الهی، مسئله‌ای که حیرت در آن بیشتر و بزرگ‌تر باشد، از مسئله افعال نیست، به ویژه در تعلق حمد و ذم به افعال مخلوقین. این تعلق باعث می‌شود که افعال مخلوقین در حال ظهور از آن‌ها، برای غیر مخلوقین نباشد. و افعال خدا همه نیکوست در مذهب مخالف که فعل را از مخلوق نفی می‌کند و ذم را برای فعل اثبات می‌کند، بدون هیچ اختلاف و شکی نزد او در تعلق ذم به آن فعل از جانب خدا. و سبب آن کسب است، زیرا آن فعل مخالف حمد خدا واقع شده است، در حالی که مأمور به انجام آن بوده و انجام نداده یا از انجام آن نهی شده و انجام داده است. و این خود جای بحث دارد. و در چنین مسائلی گفتم:\n\nحیرتی است که از حیرتی صادر شده *** کاش می‌دانستم پس چه کسی حیران نمی‌شود؟\nمن اگر بگویم «من»، او می‌گوید «نه» *** و او اگر بگوید «من»، مورد اعتراض قرار نمی‌گیرد\nمن مجبورم و فعلی ندارم *** و آنچه انجام می‌دهم از روی اضطرار است\nو آنکه فعل خود را به او نسبت می‌دهم *** در افعالش صاحب اختیار نیست\nپس من و او بر نقطه‌ای هستیم *** که ثابت شده ولی قراری ندارد.\n\nبا آنچه در این باب ذکر کردیم، تو را بر چیزی آگاه ساختیم که حیرتت را در آن می‌افزاید، پس از آنکه آنچه را ذکر کردیم، بیان نمودیم.\n\n### [منزل حیرت و مقام غیرت]\n\nپس بدان که این منزل در حقیقت منزل حیرت (منزل حيرة) و مقام غیرت (مقام غيرة) است. و از علوم این منزل که داخل در باب حیرت است، متصف شدن عدم به کَینونت (الکینونة) است، در حالی که کَینونت مقتضی وجود است. و متصف شدن حق به قرار دادن موجودات در عدم و خلق عدم به گونه‌ای که گفته شود: فعل فاعل، لاشیء (هیچ) است، و لاشیء نمی‌تواند فعل باشد. در حالی که حق آن را به خود نسبت داده و فرموده است: **إِنْ يَشَأْ يُذْهِبْكُمْ** (اگر بخواهد شما را می‌برد) – یعنی شما را به عدم ملحق می‌کند – **وَيَأْتِ بِخَلْقٍ جَدِيدٍ** (و خلق جدیدی می‌آورد). پس بنگر چگونه الحاق به عدم را به مشیئت (المشيئة) اضافه کرد و آن را به قدرتی که خلق و جعل با آن واقع می‌شود، اضافه نکرد. و کتب الهی از این امر مملو است و این منزل شامل آن‌هاست.\n\nو صحیح در این باره آن است که موجودات، همان‌طور که ذکر شد، دارای اعیان ثابته (الأعيان الثابتة) هستند در حالی که متصف به عدمی هستند که برای ممکن است نه محال. پس همان‌طور که آن‌ها را به وجود (الوجود) آشکار ساخت و لباس حال وجود را بر آن‌ها پوشاند و آن‌ها را از حال عدم عریان کرد و به این سبب «موجِد» نامیده شد و این عین، «موجود» نامیده شد، بعید نیست که آن‌ها را به همان حالتی که از آن خارج کرده بود، یعنی حالت عدم، بازگرداند. پس حق به «مُعدِم» (نیست‌کننده) متصف می‌شود و آن‌ها به «معدوم» (نیست‌شده) متصف می‌شوند. و به علم به اینکه این امر با کدام صفت حاصل شده است، نمی‌پردازیم. اگر سؤال شود، ما حصول هر دو امر و هر دو حالت را به مشیئت (المشيئة) ملحق می‌کنیم و دو خصم این را می‌پذیرند. و اگر از الحاق آن عین به وجود سؤال شود، آن را به قدرت و مشیئت نسبت می‌دهیم و دو خصم این را از ما می‌پذیرند. پس اگر آنچه را اراده کردیم فهمیدی، همه را به مشیئت ملحق کن، که این اولی‌تر و مناسب‌تر است تا از نزاع در صنف خبر از آن سالم بمانی، به گونه‌ای که نزاعی در آن از سوی همه طوایف متصور نباشد.\n\nو از این باب است: **ذَهَبَ اللَّهُ بِنُورِهِمْ** (خداوند نورشان را برد)، یعنی آن را از دیدگانشان زایل کرد. اما زوال آن از دیدگانشان مستلزم الحاق آن به عدم نیست، مگر اینکه مفهوم آن این باشد که خداوند نور را از دیدگانشان معدوم ساخت و **وَتَرَكَهُمْ فِي ظُلُمَاتٍ لَا يُبْصِرُونَ** (و آنان را در تاریکی‌هایی رها کرد که نمی‌بینند). و از علوم این منزل، برانگیختن گروهی توسط حق تعالی برای امری است که یکی از آنان (از آن گروه) آن را انجام می‌دهد. و از علوم این منزل، وجود علم از طریق نظره (نگاه)، ضربه (ضربه) و رَمیه (پرتاب) است. و چگونه این امور جای کلام عالم برای متعلم را می‌گیرند؟ و ذوق ما از این فن، ذوق نظره است.\n\n### [نگاه با نور خورشید شامل همه دیدنی‌ها با کثرت و دوری آن‌هاست]\n\nپس بدان که همان‌طور که نگاه با نور خورشید شامل همه دیدنی‌ها با کثرت و دوری آن‌هاست، نه در زمانی طولانی، بلکه عین زمان یک لحظه (اللمحة)، زمان گسترش نور بر مبصرات، عین زمان ادراک بصر (إدراك البصر) برای آن‌ها، عین زمان تعلق علم به آنچه بصر ادراک کرده است، بدون ترتیب زمانی و امتداد – اگرچه ترتیب معقول است، مانند ترتیب علت و معلول با وجود هم‌زمانی آن‌ها در وجود – همچنین لحظه یا ضربه یا پرتاب، شامل علومی است که خداوند در آن‌ها به ودیعه نهاده است. پس هنگامی که از ضارب یا رامی یا ناظر واقع شود، تمام آنچه در قوه آن ضربه است، از علم ادراک می‌شود، همان‌طور که لحظه با نور خورشید تمام آنچه در قوه آن لحظه از مبصرات است، عطا می‌کند. و قصور از ضربه و غیر آن نیست، زیرا آن‌ها شامل علوم بی‌نهایت هستند، همان‌طور که خورشید بر بیش از آنچه بصر ادراک می‌کند، می‌تابد. بلکه قصور در قلب مُدرِک است، مانند قصور در مُبصَر (بیننده) از ادراک تمام آنچه خورشید بر آن تابیده است. و این همه در یک آن واحد است، اگر مُدرِک از کسانی باشد که مقید به زمان است. اما ارواحی که متصف به تحیّز (مکان‌مندی) نیستند، آنچه را ادراک می‌کنند، در غیر زمان ادراک می‌کنند، از اموری که هم در زمان و هم در غیر زمان ادراک می‌شوند.\n\nو به همین اشاره است قول پیامبر (صلی الله علیه و سلم): **إن الحق ضربه بیده بین کتفیه أو فی ظهره فوجد برد الأنامل بین ثدییه أو فی صدره فعلم علم الأولین والآخرین** (همانا حق با دست خود بر پشت یا میان دو کتف او زد، پس سردی سرانگشتان را میان دو پستان یا در سینه‌اش یافت، و علم اولین و آخرین را دانست).\n\nپس منزه است معلمی که هر که را بخواهد، به هر چه بخواهد، هر طور که بخواهد، تعلیم می‌دهد. هیچ معبودی جز او نیست، دانای توانا.\n\nو همچنین از این باب است هنگامی که در روز حنین، خاک را به صورت دشمنان پرتاب کرد و به چشمان قوم اصابت کرد و شکست خوردند. پس بنگر که آن پرتاب و آن ضربه شامل چه بود. و اما نظره (نگاه)، من آن را از کسی روایت نکرده‌ام و از کسی نشنیده‌ام، اما آن را از خود دیدم. یک نگاه کردم، پس دانستم که شامل چه علومی است. و به من نگاهی عطا شد، پس با آن نگاه کردم و با آن، تمام آنچه را که آن نظره از علوم در بر داشت، درباره کسی که به او نگاه کردم، دانستم. و این همان علم اذواق (چشیدن‌ها) است. و از اینجا دانسته می‌شود قول کسی که گفت: می‌شنود با آنچه با آن می‌بیند، می‌بیند با آنچه با آن سخن می‌گوید. این گذشت.\n\nو اما فایده اینکه یک نفر کاری را انجام می‌دهد که گروهی برای آن برانگیخته شده‌اند، برای انعام الهی (الإنْعام الإلهي) به آن گروه و عنایت حق به آن‌هاست، زیرا برایشان نصیبی در آن خیر قرار داده است، نه به دلیل قصور قدرت از رساندن آن امر به فرد بدون گروه. مگر اینکه حقایق نسبت‌ها (حقائق النسب) باشد، زیرا آن یک ترتیب حقیقی است نه وضعی، مانند تقدم حی (زنده) بر عالم (دانا)، و داخل شدن مرید (اراده‌کننده) تحت احاطه عالم، و داخل شدن قادر (توانا) تحت احاطه مرید. پس مرید کاری را که مختص قادر است، انجام نمی‌دهد، و عالم کاری را که مختص مرید است، انجام نمی‌دهد، و حی کاری را که مختص عالم است، انجام نمی‌دهد، و عالم کاری را که مختص حی است، انجام نمی‌دهد، و مرید کاری را که مختص عالم است، انجام نمی‌دهد، و قادر کاری را که مختص مرید است، انجام نمی‌دهد. در حالی که عین عالم، عین حی، عین مرید و عین قادر است. و عین حیات، عین علم، عین اراده و عین قدرت است. و عین حیات، عین حی، عین عالم، عین مرید و عین قادر است. و همچنین آنچه باقی می‌ماند. پس نسبت‌ها مختلف و عین (ذات) یکی است. و معلوم، صفت و حال و موصوف است. پس جمع در عین وحدت، از نظر حکم مندرج است نه از نظر عین؛ زیرا در آنجا اعیان موجودی برای این مجموع نیست، بلکه تنها یک عین است که نسبت‌های مختلفی دارد که به هر جا برسد، می‌رسد. پس این همان سریان وجودی (السريان الوجودي) در موجودات است. پس این از باب انجام دادن یک نفر کاری است که گروهی آن را انجام می‌دهند، میان موجود و معقول. پس این منزل شامل آنچه ذکر کردیم، است.\n\nو از علوم این منزل، معرفت دگرگونی عناصر (استحالات العناصر) و مولدات (المولدات) به یکدیگر است، به واسطه نسبت رابطی که میان دگرگون‌شونده و دگرگون‌شده به آن وجود دارد. اگر آن نسبت رابط برداشته شود، هیچ چیز به چیز دیگری دگرگون نمی‌شود، زیرا از هر جهت با آن منافر است. و به همین دلیل، نسبت میان رب و مربوب (الرب والمربوب) موجود بود و به واسطه آن، او رب آن بود. و میان مربوب و ذات رب نسبتی نبود. به همین دلیل، از ذات چیزی صادر نشد، چنانکه اصحاب علل و معلولات می‌گویند. پس ذات از حیث ذات بودن، متوجه ایجاد اشیا نمی‌شود، بلکه از نسبت قدرت به آن‌ها و عدم مانع، متوجه اشیا می‌شود. و این همان الوهیت (الألوهة) نامیده می‌شود.\n\nهمچنین طبایع را خداوند برای دگرگونی‌ها به ترتیبی شگفت‌انگیز مرتب ساخت. عنصر آتش را در کنار هوا قرار داد، و عنصر هوا را در کنار آب، و عنصر آب را در کنار خاک. پس میان آب و آتش از همه جهات منافرت طبیعی (المنافرة الطبیعیة) وجود دارد، و میان هوا و خاک نیز از همه جهات منافرت طبیعی وجود دارد. پس خداوند میان آن‌ها واسطه‌هایی (الوسائط) قرار داد، زیرا هر یک از آن‌ها دارای دو وجه است که با هر یک از دو طرف مجاور، مناسبت خاصی دارد. پس اگر حق اراده کند که آب را به آتش تبدیل کند، در حالی که آب طبعاً با آتش منافر است، ابتدا آن را به هوا تبدیل می‌کند، سپس آن هوا را به آتش تبدیل می‌کند. پس آب را مستقیماً به آتش تبدیل نکرد، مگر پس از انتقال آن به هوا به دلیل تناسب. و همچنین تمام دگرگونی‌ها در عالم طبیعت این‌گونه است.\n\nو اما در الهیات (الإلهيات)، در همین مسئله و در این کتاب به آن اشاره کردیم، در وصف ذات مخلوق به صفت ذات خالق و وصف ذات خالق به صفت ذات مخلوق، سپس تجرد ذات خالق از آنچه ذات مخلوق اقتضا می‌کند و تجرد ذات مخلوق از آنچه ذات خالق اقتضا می‌کند. اگر نسبت موجود میان رب و مربوب (الرب والمربوب) نبود، نه این (مخلوق) و نه آن (خالق) بر آن دلالت نمی‌کرد و اتصاف به صفت او را نمی‌پذیرفت. و به واسطه همان نسبت بود که حق، بندگانش را مکلف ساخت و امر و نهی کرد، و به عین همان نسبت بود که خلق مکلف، مأمور و منهی شد. پس اگر صاحب قلب هستی و گوش فرا دادی در حالی که بر آنچه ذکر کردیم شاهد بودی، آنچه را به تو تذکر دادیم، محقق بدان. و اگر چنین نبودی، خیر کثیر و علم نافع و جلیل‌القدری را از دست داده‌ای، اما خطری عظیم دارد، مگر اینکه خداوند عصمت دهد.\n\nو مکر الهی پنهانی در این منزل وجود دارد که از اسم قاهر (الاسم القاهر) صادر شده است. و موجودی از عالم غیب (عالم الغيب) در عالم حس (عالم الحس) وجود دارد که شمشیر قهر را برهنه در دست دارد و با آن موجودی را که به اسم رحمانی تعلق دارد، طلب می‌کند، مانند طلب موسی فرعون را، و طلب نمرود و فراعنه انبیا، انبیا (علیهم السلام) را. همه این‌ها صفاتی هستند که برای عارف در ظاهر و باطنش پدیدار می‌شوند و او آن‌ها را از نفس خود مکاشفه می‌کند. پس هنگامی که مردان اسم قاهر حمله می‌کنند، عارف به اسم باطن (الاسم الباطن) پناه می‌برد، پس اسم باطن نزد قاهر شفاعت می‌کند. پس گروهی از اسماء الهی به خاطر اسم باطن، به جهت تعظیم او به دلیل نزدیکی‌اش به «هو»، شتابان می‌آیند و با اسم قائم بر اسم ظاهر، به دلیل دوری منزلتش از «هو»، همراه او می‌ایستند. پس اسم، گروهی را از عالم غیب در عالم برزخ (عالم البرزخ) برای آن‌ها برپا می‌دارد، زیرا عالم برزخ در تأثیرگذاری قوی‌تر از عالم حس است. زیرا عالم برزخ در عالم حس همان تأثیری را می‌گذارد که حس می‌گذارد، در حالی که حس نمی‌تواند در خیال تأثیر بگذارد. آیا نمی‌بینی که شخص خوابیده در خیال می‌بیند که نکاح می‌کند، پس آب (منی) از او در عالم حس خارج می‌شود؟ و یا چیزی را می‌بیند که او را می‌ترساند، پس جسم شخص خوابیده به واسطه حرکت یا صدایی که از او صادر می‌شود یا کلامی مفهوم یا عرق کردن، متأثر می‌شود، به دلیل قوت سلطه خیال بر او. و خیال در صورت حس چیزی را ظاهر می‌کند که در نفس خود محسوس نیست و آن را به حس ملحق می‌کند، در حالی که در قوه حس نیست که محسوس را عیناً به صورت متخیل بازگرداند. پس برای این عارف، علومی از عین آن گروه برزخی حاصل می‌شود که با آن‌ها بر معرفت آن شبهه‌ای که اگر ثابت می‌شد و بر آن می‌مرد، سعادتش را خدشه‌دار می‌کرد، آگاه می‌شود. و در این منزل، وجود این شبهه و این ادله ضروری است.\n\nو بدان که هیچ منزلی از منازل و هیچ منازله‌ای از منازلات و هیچ مقامی از مقامات و هیچ حالی از حالات نیست، مگر اینکه میان آن‌ها برزخی است که بنده در آن متوقف می‌شود و «موقف» نامیده می‌شود. و این همان چیزی است که صاحب المواقف، محمد بن عبد الجبار نفری (رحمه الله)، در کتاب خود به نام «المواقف» از آن سخن گفته است، که در آن می‌گوید: حق مرا در موقف فلان متوقف ساخت. پس آن اسمی که به آن اضافه می‌کند، همان منزلی است که به آن منتقل می‌شود، یا مقام یا حال یا منازله. مگر قول او که: مرا در موقفی ورای مواقف متوقف ساخت. آن موقف به غیر نام آنچه به آن منتقل می‌شود، نامیده می‌شود. و آن موقفی است که پس از آن چیزی که مناسب اول باشد، وجود ندارد. و این زمانی است که حق می‌خواهد او را از مقام به حال، و از حال به مقام، و از مقام به منزل، و از منزل به منازلات، یا از منازلات به مقام منتقل کند.\n\nو فایده این مواقف آن است که وقتی حق اراده کند بنده را از چیزی به چیز دیگر منتقل کند، او را میان آنچه از آن منتقل می‌شود و آنچه به آن منتقل می‌شود، متوقف می‌سازد. پس آداب آنچه به آن منتقل می‌شود را به او عطا می‌کند و به او می‌آموزد که چگونه به آنچه آن امر استقبال‌کننده سزاوار آن است، مؤدب شود. زیرا حق برای هر منزل و مقام و حال و منازله‌ای آدابی دارد که اگر بنده به آداب الهی (الآداب الإلهية) در آن‌ها ملتزم نشود، طرد می‌شود. و آن این است که در آن‌ها بر طبق آنچه حق از ظهور با تجلی خود در آن امر یا حضرت می‌خواهد، از انکار یا تعریف، رفتار کند. پس با حق به آداب آنچه سزاوار آن است، معامله کند.\n\nو خبر صحیح در این باره وارد شده است، در تجلی او سبحانه در موطن تلبیس (موطن التلبیس)، که همان تجلی او در غیر صور اعتقادات در حضرت اعتقادات است. پس هیچ کس باقی نمی‌ماند که او را بپذیرد یا به او نزدیک شود، بلکه وقتی به آن‌ها می‌گوید: «من پروردگار شما هستم»، می‌گویند: «پناه می‌بریم به خدا از تو». عارف در آن مقام او را می‌شناسد، اما از او دانسته است – به واسطه آنچه او به عارف آموخته است – که نمی‌خواهد در آن حضرت توسط کسی که معرفتش در اینجا به صورت خاصی که او را در آن عبادت می‌کند، مقید شده است، شناخته شود. پس از ادب عارف است که با آن‌ها در انکار موافقت کند، اما آنچه را که آن‌ها از پناه بردن از او بر زبان آوردند، بر زبان نیاورد، زیرا او را می‌شناسد. پس هنگامی که حق در آن حضرت و در آن نگاه به آن‌ها می‌گوید: آیا میان شما و او نشانه‌ای بود که او را با آن بشناسید؟ می‌گویند: بله. پس او سبحانه در آن نشانه برای آن‌ها متحول می‌شود، با وجود اختلاف نشانه‌ها. پس هنگامی که آن را می‌بینند، که همان صورتی است که او را در آن عبادت می‌کردند، در آن هنگام به او اعتراف می‌کنند. و عارف نیز در اعتراف آن‌ها با آن‌ها موافقت می‌کند، از روی ادب با خدا و حقیقت، و به آنچه گروه اعتراف کردند، اقرار می‌کند.\n\nپس این فایده علم مواقف است. و همان‌طور که گفتیم، هیچ منزل و مقامی نیست مگر اینکه میان آن‌ها موقفی است، جز دو منزل یا دو حضرت یا دو مقام یا دو حال یا دو منازله – هر طور که می‌خواهی بگو – که میان آن‌ها موقفی نیست. و سبب آن این است که آن یک امر واحد است، اما حال سالک در آن تغییر می‌کند، پس خیال می‌کند که به منزل دیگری یا حضرت دیگری منتقل شده است. پس حیران می‌شود، زیرا حق او را متوقف نساخته و تغییر نزد او حاصل شده است. پس نمی‌داند آیا آن تغییری که در او ظاهر شده، از انتقال او در منزل است یا انتقال او از آن. اگر در آنجا عارفی به امر باشد، او را می‌شناساند. و اگر استادی نداشته باشد، تلبیس (اشتباه) باقی می‌ماند. زیرا از شأن این امر است که حق او را متوقف نمی‌سازد، همان‌طور که در گذشته با او انجام داد و همان‌طور که در آینده با او انجام خواهد داد. پس سالک از سوء ادب در حالی که بر او ظاهر می‌شود، می‌ترسد که آیا با ادب پیشین با او معامله کند یا ادب دیگری دارد. و این برای کسی است که حق او را از میان سالکان متوقف ساخته است.\n\nو اگر حق او را در موقفی از این مواقف متوقف نسازد و فصل میان آنچه به آن منتقل می‌شود و آنچه از آن منتقل می‌شود را به او ندهد، نزد او انتقال‌ها در نفس همان منزلی است که در آن قرار دارد. زیرا نزد صاحب این ذوق، جز یک امر واحد نیست که انتقال‌ها در آن صورت می‌گیرد. و این حال مُنذَری، صاحب مقامات، بود و کتاب معروف خود به نام «المقامات» را بر همین اساس بنا نهاد و آن‌ها را به صد مقام در یک مقام واحد، که همان محبت (المحبة) است، رساند. چنین کسی نه می‌ایستد و نه حیران می‌شود، اما علم جلیلی از علم به خدا و صفات مختص به آنچه به آن منتقل می‌شود را از دست می‌دهد. پس مناسبت‌ها را از جانب حق به این منزل نمی‌شناسد. پس علم او، علم اجمال (علم إجمال) است که امر اول هنگام ورود او به این حضرات، آن را در بر داشته است. و علم صاحب مواقف، علم تفصیل (علم تفصيل) است.\n\nاما آنچه از آداب از او فوت می‌شود، اگر از او سر نزند و در آن جاهل باشد، از او بخشیده می‌شود و در حالش تأثیر نمی‌گذارد، بلکه امور را آن‌گونه که شایسته است، انجام می‌دهد، اما به منزلت «واقف» (کسی که در موقف می‌ایستد) تنزل نمی‌کند و آنچه را از دست داده است، نمی‌شناسد تا واقف آن را به او بشناساند، در حالی که او واقف را نمی‌شناسد.\n\nپس این منزلی که ما در آن هستیم، موقفی دارد که صاحب مواقف در آن جاهل می‌شود، بلکه حیران می‌گردد؛ زیرا مناسبت میان آنچه موقف خاص به او عطا می‌کند و میان این منزل، از آنچه منزل بر آن بنا شده است، دور است. و همچنین منزلی که پس از آن می‌آید. جز اینکه کسی که در آن فرود می‌آید، اگرچه حیران است، اما از آن وقفه، در صورتی که مناسبت میان منزل و وقفه برطرف شود، چیزی به دست می‌آورد که مناسبت میان وقفه و فرودآینده باز می‌گردد. پس آنچه را که حضرت از آداب سزاوار آن است، با وجود برطرف شدن مناسبت، می‌شناسد و خدا را بر آن شکر می‌کند.\n\nپس صاحب مواقف، رنج‌دیده است، اما عالمی بزرگ است. و کسی که موقفی ندارد، در سلوک خود آسوده است و رنجی در آن نمی‌بیند. و چه بسا اگر با هم جمع شوند و کسی که موقفی ندارد، حال کسی که مواقف دارد را ببیند، آنچه را از مشقت در او می‌بیند، انکار کند و خیال کند که او در مرتبه پایین‌تری قرار دارد. پس در این باره بر او خرده می‌گیرد و او را سرزنش می‌کند و به او می‌گوید: راه آسان‌تر از این است که تو بر آن هستی. و بر او ریاست می‌کند. و این به دلیل جهل او به مواقف است.\n\nو اما صاحب مواقف، او را جاهل نمی‌داند و آنچه را که او از سوء ادب با او انجام داده است، انکار نمی‌کند و آن را بر او حمل می‌کند و او را به حال خود و آنچه از راه به دست آورده است، آگاه نمی‌سازد؛ زیرا دانسته است که خداوند او را به آن نخواسته و او را اهل آن نگردانیده است. پس کلام او را می‌پذیرد و نهایت کاری که می‌کند این است که به او می‌گوید: ای برادر، حال مرا بپذیر، همان‌طور که من حال تو را پذیرفتم. و او را رها می‌کند. و این چیزی که تو را به آن آگاه ساختم، از نافع‌ترین امور در این راه است، به دلیل آنچه در آن از حیرت و تلبیس وجود دارد. پس بفهم. و **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}