{
  "id": 551,
  "title": {
    "ar": "الباب الأحد والخمسون وخمسمائة في معرفة حال قطب كان منزله فَسَيَرَى الله عَمَلَكُمْ ورَسُولُهُ والْمُؤْمِنُونَ",
    "en": "Chapter Five Hundred and Fifty-One: Concerning the knowledge of the state of a Pole (قطب) whose station was: <<فَسَيَرَى الله عَمَلَكُمْ ورَسُولُهُ والْمُؤْمِنُونَ>> (And Allah will see your deeds, and His Messenger, and the believers).",
    "ur": "باب پانچ سو اکیاون: اس قطب (قطب) کے حال کی معرفت (معرفۃ) کے بیان میں جس کا مقام یہ فرمانِ الٰہی ہے: **فَسَيَرَى الله عَمَلَكُمْ ورَسُولُهُ والْمُؤْمِنُونَ** (تو اللہ تمہارے عمل کو دیکھے گا اور اس کا رسول اور مومن بھی)۔",
    "fa": "باب پانصد و پنجاه و یکم در معرفت حال قطبی که منزل او این است: فَسَيَرَى الله عَمَلَكُمْ ورَسُولُهُ والْمُؤْمِنُونَ (پس خداوند عمل شما را خواهد دید و پیامبر او و مؤمنان)"
  },
  "content": {
    "ar": "## «الباب الأحد والخمسون وخمسمائة في معرفة حال قطب كان منزله فَسَيَرَى الله عَمَلَكُمْ ورَسُولُهُ والْمُؤْمِنُونَ»\n\n\n> كل من يعمل ما كلف به *** فبه يسعد حقا فانتبه‏\n\n\n> ثم للشارع فيه نظر *** ويرى الله الذي قد جئت به‏\n\n\n> فيرى المنصف يسعى جاهدا *** وكذا كل لبيب منتبه‏\n\n\n> يسع في تحصيل زاد مبلغ *** من حلال لا بزاد مشتبه‏\n\n\n> إنما ينظر في أعمالنا *** من له الحكم الذي يحكم به‏\n\n\n### [رؤية الله ورسوله والمؤمنين‏]\n\n\nقال الله تعالى أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏ ولكل راء عين تليق به فيدرك من المرئي بحسب ما تعطيه قوة ذلك العين فثم عين تعطي الإحاطة بالمرئي وليس ذلك إلا الله وأما ما يراه الرسول والمؤمنون فليس إلا رؤية خاصة ليس فيها إحاطة فيراه الرسول بحسب ما أرسل به وكذلك المؤمن يراه بقدر ما علم من هذا الرسول فليست عين المؤمن تبلغ في الرتبة إدراك عين الرسول فإن المجتهد مخطئ ومصيب والرسول حق كله فإن له التشريع وهو العين المطلوبة لطالب الدلالة فإذا قامت صورة العمل نشأة كاملة كان العمل ما كان من المكلف يراها الله من حيث أراها الرسول والمؤمنين ومن حيث لا يرونها أعني تلك الصورة العملية ويراها الرسول من حيث ما يراها المؤمنون ومن حيث ما يراها ويرى أيضا المؤمنون ذلك العمل من حيث يرونها لا من حيث يراها الرسول فالرسول مقرر حكم المجتهدين والمجتهدان يتنازعان ويخطئ كل واحد منهما صاحبة فلو ساوت الرؤية من كل ذي عين لما كان في العالم نزاع وإلى الله يرجع الأمر كله في ذلك فإذا حكم في الأمور بنفسه بما ذا يحكم هل بما يراه أو بما يراه الرسول أو بما يراه المؤمنون فصاحب هذا الذكر يرى مواطن في القيامة يحكم فيها تبلغ في الرتبة إدراك عين الرسول فإن المجتهد مخطئ ومصيب والرسول حق كله فإن له التشريع وهو العين بما يراه الرسول في العمل لا بما يراه الله ومواطن يحكم فيها الله بما يراه المؤمنون لا بما يراه الرسول ومواطن يحكم فيها بالمجموع فإذا وقف هذا الذاكر على هذه الأحكام وشاهد هذه المواطن فهو صاحب ذكر له والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Five Hundred and Fifty-One: On the Knowledge of the State of a Pole Whose Station Was: \"And Allah will see your work, and His Messenger, and the believers.\"\n\n> Whoever performs what he is obligated to do,\n> By it he is truly made happy, so pay heed.\n>\n> Then the Lawgiver has a regard concerning it,\n> And Allah sees that which you have brought forth.\n>\n> So He sees the just person striving diligently,\n> And likewise every intelligent, attentive person,\n>\n> Striving to acquire sufficient provision,\n> From the lawful, not by doubtful provision.\n>\n> Indeed, only He looks upon our deeds,\n> Who possesses the judgment by which He judges.\n\n### [The Vision of Allah, His Messenger, and the Believers]\n\nAllah the Exalted said: <<Did he not know that Allah sees?>> (أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏). For every seer there is an eye (عين) appropriate to him, so he perceives of the thing seen according to what the power of that eye grants him. Thus, there is an eye that grants comprehensive encompassment (الإحاطة) of the thing seen, and that is none other than Allah. As for what the Messenger and the believers see, it is only a specific vision (رؤية خاصة) in which there is no encompassment.\n\nThe Messenger sees it according to that with which he was sent, and likewise, the believer sees it according to what he has learned from this Messenger. Thus, the eye of the believer does not reach the rank (الرتبة) of the perception of the eye of the Messenger, for the one who strives (المجتهد) is sometimes mistaken and sometimes correct. But the Messenger is entirely truth (حق كله), for he possesses the legislation (التشريع), and he is the eye sought by the seeker of guidance.\n\nWhen the form (صورة) of the deed arises as a complete manifestation (نشأة كاملة), whatever the deed was from the obligated person (المكلف), Allah sees it from the perspective by which He shows it to the Messenger and the believers, and from the perspective by which they do not see it—meaning that operational form. The Messenger sees it from the perspective by which the believers see it, and from the perspective by which he [the Messenger] sees it [uniquely]. And the believers also see that deed from the perspective by which they see it, not from the perspective by which the Messenger sees it.\n\nThus, the Messenger confirms the ruling of the strivers, while the two strivers dispute, and each one declares the other mistaken. If the vision of every possessor of an eye were equal, there would be no dispute in the World (العالم). And to Allah returns the whole affair concerning this.\n\nSo when [the Pole] judges in matters by himself, by what does he judge? Is it by what he sees, or by what the Messenger sees, or by what the believers see?\n\nThe possessor of this remembrance (الذكر) sees stations (مواطن) on the Day of Resurrection where he judges, reaching the rank of the perception of the eye of the Messenger. For the one who strives is sometimes mistaken and sometimes correct, but the Messenger is entirely truth, for he possesses the legislation, and he is the eye—[he judges] by what the Messenger sees in the deed, not by what Allah sees. And [he sees] stations where Allah judges by what the believers see, not by what the Messenger sees. And stations where He judges by the totality. When this rememberer stands upon these judgments and witnesses these stations, then he is the possessor of this remembrance for himself. And <<Allah speaks the Truth, and He guides to the Way.>> (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏).",
    "ur": "باب نمبر پانچ سو اکیاون (551): اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"تو عنقریب اللہ تمہارے عمل کو دیکھے گا اور اس کا رسول اور مومنین بھی\" (فَسَيَرَى الله عَمَلَكُمْ ورَسُولُهُ والْمُؤْمِنُونَ)۔\n\n> جو بھی اس چیز پر عمل کرتا ہے جس کا اسے مکلف بنایا گیا ہے،\n> تو اسی کے ذریعے وہ سچائی کے ساتھ کامیاب ہوتا ہے، پس ہوشیار ہو جاؤ۔\n>\n> پھر شریعت ساز (رسول) کی اس میں نظر ہوتی ہے،\n> اور اللہ اسے دیکھتا ہے جو تم لائے ہو۔\n>\n> تو وہ منصف کو کوشش کرتے ہوئے دیکھتا ہے،\n> اور اسی طرح ہر عقلمند اور ہوشیار شخص کو۔\n>\n> وہ حلال سے زادِ راہ حاصل کرنے کی کوشش کرتا ہے جو اسے منزل تک پہنچائے،\n> نہ کہ مشتبہ زادِ راہ سے۔\n>\n> ہمارے اعمال میں صرف وہی دیکھتا ہے،\n> جس کے پاس وہ حکم ہے جس کے ذریعے وہ فیصلہ کرتا ہے۔\n\n### اللہ، اس کے رسول اور مومنین کا دیکھنا (رؤية الله ورسوله والمؤمنين)\n\nاللہ تعالیٰ نے فرمایا: \"کیا اسے معلوم نہیں کہ اللہ دیکھ رہا ہے؟\" (أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏)۔ اور ہر دیکھنے والے کے لیے ایک آنکھ ہوتی ہے جو اس کے لائق ہوتی ہے، پس وہ دیکھی جانے والی چیز (مرئی) کو اس آنکھ کی قوت کے مطابق ادراک کرتا ہے جو وہ عطا کرتی ہے۔ تو ایک آنکھ ایسی ہے جو دیکھی جانے والی چیز کا احاطہ (الإحاطة) عطا کرتی ہے، اور وہ صرف اللہ ہی ہے۔\n\nاور جہاں تک اس چیز کا تعلق ہے جسے رسول اور مومنین دیکھتے ہیں، تو وہ صرف ایک خاص رؤیت (رؤية خاصة) ہے جس میں احاطہ نہیں ہوتا۔ پس رسول اسے اس چیز کے مطابق دیکھتے ہیں جس کے ساتھ وہ بھیجے گئے ہیں، اور اسی طرح مومن اسے اس قدر دیکھتے ہیں جتنا انہوں نے اس رسول سے جانا۔ پس مومن کی آنکھ مرتبے میں رسول کی آنکھ کے ادراک تک نہیں پہنچتی، کیونکہ مجتہد غلطی کرنے والا بھی ہوتا ہے اور درست بھی، جبکہ رسول مکمل طور پر حق (الحق) ہیں۔ کیونکہ ان کے لیے تشریع (قانون سازی) ہے، اور وہ (رسول کی آنکھ) طالبِ رہنمائی کے لیے مطلوبہ آنکھ ہے۔\n\nپس جب عمل کی صورت ایک کامل نشأت (وجود) کے طور پر قائم ہو جاتی ہے، تو وہ عمل جو بھی مکلف کی طرف سے ہو، اللہ اسے اس جہت سے دیکھتا ہے جس جہت سے اس نے اسے رسول اور مومنین کو دکھایا، اور اس جہت سے بھی جہاں سے وہ (رسول اور مومنین) اسے نہیں دیکھتے، میرا مطلب ہے وہ عملی صورت۔ اور رسول اسے اس جہت سے دیکھتے ہیں جس جہت سے مومنین اسے دیکھتے ہیں، اور اس جہت سے بھی جس سے وہ (رسول) اسے دیکھتے ہیں۔ اور مومنین بھی اس عمل کو اس جہت سے دیکھتے ہیں جس سے وہ اسے دیکھتے ہیں، نہ کہ اس جہت سے جس سے رسول اسے دیکھتے ہیں۔\n\nپس رسول مجتہدین کے حکم کی تصدیق کرنے والے ہیں۔ اور دو مجتہد آپس میں اختلاف کرتے ہیں اور ان میں سے ہر ایک دوسرے کو غلط قرار دیتا ہے۔ اگر ہر صاحبِ آنکھ کی رؤیت (دیکھنا) برابر ہوتی تو دنیا میں کوئی نزاع (اختلاف) نہ ہوتا۔ اور اس معاملے میں تمام امور اللہ ہی کی طرف لوٹتے ہیں۔\n\nپس جب وہ (قطب) خود امور میں فیصلہ کرتا ہے، تو وہ کس چیز سے فیصلہ کرتا ہے؟ کیا اس چیز سے جو وہ دیکھتا ہے، یا اس چیز سے جو رسول دیکھتے ہیں، یا اس چیز سے جو مومنین دیکھتے ہیں؟ تو اس ذکر (ذکر) کا حامل (قطب) قیامت میں ایسے مقامات دیکھتا ہے جہاں فیصلے کیے جاتے ہیں۔ یہ مقامات مرتبے میں رسول کی آنکھ کے ادراک تک پہنچتے ہیں، کیونکہ مجتہد غلطی کرنے والا بھی ہوتا ہے اور درست بھی، جبکہ رسول مکمل طور پر حق (الحق) ہیں، کیونکہ ان کے لیے تشریع ہے اور وہ (رسول کی آنکھ) ہی مطلوبہ آنکھ ہے۔ وہ ایسے مقامات دیکھتا ہے جہاں رسول کے دیکھے ہوئے عمل کے مطابق فیصلہ کیا جاتا ہے، نہ کہ اللہ کے دیکھے ہوئے کے مطابق۔ اور ایسے مقامات بھی ہیں جہاں اللہ اس چیز کے مطابق فیصلہ کرتا ہے جو مومنین دیکھتے ہیں، نہ کہ اس چیز کے مطابق جو رسول دیکھتے ہیں۔ اور ایسے مقامات بھی ہیں جہاں مجموعی طور پر فیصلہ کیا جاتا ہے۔ پس جب یہ ذاکر (قطب) ان احکام پر مطلع ہو جاتا ہے اور ان مقامات کا مشاہدہ (الشہود) کر لیتا ہے، تو وہ اس ذکر کا حامل ہوتا ہے۔ اور اللہ حق (الحق) فرماتا ہے اور وہی سیدھے راستے کی رہنمائی کرتا ہے (وهُوَ يَهْدِي السَّبِيلَ‏)۔",
    "fa": "باب پانصد و پنجاه و یکم در شناخت حال قطبی که منزل او [آیه] «پس خدا عمل شما را خواهد دید و رسول او و مؤمنان» است.\n\n> هر کس آنچه را که به آن مکلف شده انجام دهد *** به واسطه آن به راستی سعادتمند می‌شود، پس آگاه باش.\n> سپس شارع (قانون‌گذار) در آن نظر می‌کند *** و خدا آنچه را که آورده‌ای می‌بیند.\n> پس منصف را می‌بیند که سخت می‌کوشد *** و همچنین هر خردمند هوشیاری را.\n> می‌کوشد تا توشه رساننده را فراهم کند *** از حلال، نه با توشه شبهه‌ناک.\n> همانا در اعمال ما نظر می‌کند *** کسی که حکمی دارد که با آن حکم می‌راند.\n\n[دیدن خداوند، رسول او و مؤمنان]\n\nخداوند متعال فرمود: «آیا نمی‌داند که خداوند می‌بیند؟» (أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏). و برای هر بیننده‌ای چشمی است که شایسته اوست، پس از شیء دیده شده (مرئی) به اندازه‌ای درک می‌کند که نیروی آن چشم به او می‌دهد. پس آنجا چشمی است که احاطه بر مرئی می‌بخشد و آن جز خداوند نیست. و اما آنچه را که رسول و مؤمنان می‌بینند، جز دیدنی خاص نیست که در آن احاطه وجود ندارد. پس رسول آن را به اندازه‌ای می‌بیند که به واسطه آن فرستاده شده است. و همچنین مؤمن آن را به اندازه‌ای می‌بیند که از این رسول آموخته است. پس چشم مؤمن در مرتبه به درک چشم رسول نمی‌رسد، زیرا مجتهد هم خطا می‌کند و هم صواب، در حالی که رسول تماماً حق است، زیرا تشریع (قانون‌گذاری) از آنِ اوست و او چشمی است که طالب دلیل و راهنما آن را می‌جوید.\n\nپس هنگامی که صورت عمل به صورت نشأتی کامل برپا شود، عمل هر چه که از مکلف صادر شده باشد، خداوند آن را از جهتی می‌بیند که رسول و مؤمنان آن را می‌بینند و از جهتی که آن را نمی‌بینند، منظورم آن صورت عملی است. و رسول آن را از جهتی می‌بیند که مؤمنان آن را می‌بینند و از جهتی که [فقط] او می‌بیند. و مؤمنان نیز آن عمل را از جهتی می‌بینند که خودشان می‌بینند، نه از جهتی که رسول آن را می‌بیند. پس رسول تثبیت‌کننده حکم مجتهدان است، در حالی که دو مجتهد با هم نزاع می‌کنند و هر یک دیگری را خطا می‌داند. اگر دیدن از سوی هر صاحب چشمی برابر بود، در عالم نزاعی وجود نداشت. و در این باره، بازگشت همه امور به سوی خداوند است.\n\nپس اگر [قطب] در امور به نفس خود حکم کند، به چه چیزی حکم می‌کند؟ آیا به آنچه خود می‌بیند، یا به آنچه رسول می‌بیند، یا به آنچه مؤمنان می‌بینند؟ پس صاحب این ذکر (قطب) در قیامت جایگاه‌هایی را می‌بیند که در آنها حکم می‌کند، [و این حکم] در مرتبه به درک چشم رسول می‌رسد. زیرا مجتهد هم خطا می‌کند و هم صواب، در حالی که رسول تماماً حق است، زیرا تشریع از آنِ اوست و او چشم است. [و حکم می‌کند] به آنچه رسول در عمل می‌بیند، نه به آنچه خداوند می‌بیند. و جایگاه‌هایی [هست] که خداوند در آنها به آنچه مؤمنان می‌بینند حکم می‌کند، نه به آنچه رسول می‌بیند. و جایگاه‌هایی [هست] که در آنها به مجموع حکم می‌شود. پس هنگامی که این ذاکر (قطب) بر این احکام وقوف یابد و این جایگاه‌ها را مشاهده کند، او صاحب ذکری است که از آنِ اوست. و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند (وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏)."
  },
  "page_count": 1
}