{
  "id": 525,
  "title": {
    "ar": "الباب الخامس والعشرون وخمسمائة في معرفة حال قطب كان منزله ومن يَتَعَدَّ حُدُودَ الله فَقَدْ ظَلَمَ نَفْسَهُ لا تَدْرِي لَعَلَّ الله يُحْدِثُ بَعْدَ ذلِكَ أَمْراً",
    "en": "Chapter Five Hundred and Twenty-Five: Concerning the knowledge of the state (حال) of a Pole (قطب) whose station (منزل) was: <<And whoever transgresses the limits of Allah has certainly wronged himself. You do not know; perhaps Allah will bring about after that a [new] matter.>>",
    "ur": "پانچ سو پچیسواں باب: ایک قطب کے حال کی معرفت (المعرفۃ) کے بیان میں جس کا مقام یہ تھا:\n**وَمَن يَتَعَدَّ حُدُودَ اللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ ۚ لَا تَدْرِي لَعَلَّ اللَّهَ يُحْدِثُ بَعْدَ ذَٰلِكَ أَمْرًا**\n(اور جو شخص اللہ کی حدود سے تجاوز کرتا ہے تو یقیناً اس نے اپنی جان پر ظلم کیا، تم نہیں جانتے شاید اللہ اس کے بعد کوئی نئی صورت پیدا کر دے۔)",
    "fa": "باب پانصد و بیست و پنجم در شناخت حال قطبی (قطب) که منزل او این آیه بود: «وَمَن يَتَعَدَّ حُدُودَ اللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ لَا تَدْرِي لَعَلَّ اللَّهَ يُحْدِثُ بَعْدَ ذَلِكَ أَمْرًا» (و هر کس از حدود الهی تجاوز کند، قطعاً به خویشتن ستم کرده است. تو نمی‌دانی، شاید خداوند پس از آن، امری نو پدید آورد)."
  },
  "content": {
    "ar": "## (الباب الخامس والعشرون وخمسمائة في معرفة حال قطب كان منزله ومن يَتَعَدَّ حُدُودَ الله فَقَدْ ظَلَمَ نَفْسَهُ لا تَدْرِي لَعَلَّ الله يُحْدِثُ بَعْدَ ذلِكَ أَمْراً)\n\n\n> إذا تعدت حدود الله أكوان *** فحكمها يوم فصل الحكم خسران‏\n\n\n> فإن تجدد حكم ليس يعرفه *** غير الإله ولا يدريه ميزان‏\n\n\n> فذاك جود إلهي أتاك به *** عناية من إله الحق فرقان‏\n\n\n> لو لا الوجود ولو لا سر حكمته *** فيه لما ظهرت في الكون أعيان‏\n\n\n> هو الوجود ولكن ليس يعرفه *** وكيف يدري الكمال الحق نقصان‏\n\n\nاعلم أيدنا الله وإياك بروح القدس الروح الأمين‏\n\n\n> إن لله حدودا تعرف *** والذي يعرفها لا يصرف‏\n> ناظرا في حكمها متئدا *** عندها في كل حال يقف‏\n\n\n> فانظروا فيها عليها وقفوا *** وبحق الحق لا تنحرفوا\n\n\n> تجدوا السر لديها علنا *** ولذا أهل التعدي عرفوا\n\n\n> ولهذا انتهكوا حرمتها *** وادعوا أنهم قد كشفوا\n\n\n> ظلموا أنفسهم فانحجبوا *** عن مراد الله حين اعترفوا\n\n\n> والترجي واقع حيث أتى *** من كلام الله عنه فقفوا\n\n\n> عند ما قلت به واتصفوا *** بالترجي مثل ما يتصف‏\n\n\n> أنه عند الذي ظن به *** فلتظنوا الخير منه ولتفوا\n\n\n### [إن الله حدد الأحكام بالوجوب والحظر والكراهة والندب والإباحة]\n\n\nحدود الله أحكامه في أفعال المكلفين فلا يتعدى منها حد إلا لحد آخر لغير حد إلهي لا يتعداه ونفس تعديه إليه عين تعديه فيه فيحكم في الأمور بغير حكم الله لا بد من ذلك فانظر ما أعجب هذا وأحكام الله التي هي حدوده وجوب وحظر وكراهة وندب وإباحة فكل متصرف بحركة وسكون فلا بد أن يكون تصرفه في واجب أو محظور أو مندوب أو مكروه أو مباح لا يخلو من هذا فإن كان تصرفه في واجب عليه فعله بترك فقد تعدى حدود الله بتركه ما وجب عليه فعله فإن تركه على أنه ليس بواجب عليه فعله فقد تعدى في ذلك تعدى كفر ولا بد أن يحكم فيه بغير حكم الله وينتقل فيه إلى حكم آخر من حكم الله لكن في غير هذا العين فأباح ترك ما أوجب الله عليه فعله وترك ما حرم الله عليه تركه وإن قال بوجوب الترك فيما قال الشرع فيه بوجوب الفعل فهذا تعد عظيم فاحش واتباع هوى مضل عن سبيل الله فالتعدي بالفعل والترك معصية والتعدي بالاعتقاد كفر ومن قلب أحكام الله فقد كفر وخسر وثم تعد آخر لحدود الله وهو قلب الحقائق ويسمى المتعدي جاهلا وتعديه جهلا وهي الحدود الذاتية للأشياء وإنما أضيفت إلى الله لأن العلم بها إنما حصل لنا من جانب الله حيث أعطانا من القوة التي هي قوة العقل والنظر ما نصل بها إلى العلم بهذه الحدود ولأن الأمور التي نحدها ما هي بأمر زائد على ما ظهر في المظاهر المعقولة والمحسوسة وما ظهر إلا الحق وذلك الظاهر في العقل أو الحس هو الذي نحده وليس إلا الله فهي حدود الله وقد تشترك المحدودات في أمور وتتميز بأمور فما تميزت به من الفصول فهو حدها المميز لها عن الذي شاركها وما وقع به الاشتراك والتميز كله حد لها فمن تعدى هذه الحدود فَقَدْ ظَلَمَ نَفْسَهُ بظلم يسمى جهلا وقلبا للحقائق وقلب الحقائق إما أن يقلبها عينها كلها وإما أن يقلبها من حيث فصولها المقومة لها وكيف ما كان فقد تعدى حدود الله وجهل فحد الخالق بما هو حد للمخلوق فقلب الأمر في عينه كله وقد حد الإنسان بالفصل المقوم للفرس فقد غلط وجهل بعضا وعلم بعضا فأولئك هم الجاهلون حقا كما هو في تعدى الأحكام أو ما جاء به الشارع إذا آمن ببعض وكفر ببعض هو الكافر حقا وغلب الكفر على الايمان فإن ذهاب الفصل المقوم من المحدود عين ذهاب ما له من نصيب الاشتراك فإن حيوانية الإنسان ما هي عين حيوانية الفرس بالنظر إلى شخصية ذلك المحدود فلهذا يذهب الكل لذهاب البعض وقد قال الله تعالى لنبيه صَلَّى اللهُ عَليهِ وسَلَّم فَلا تَكُونَنَّ من الْجاهِلِينَ وإِنِّي أَعِظُكَ أَنْ تَكُونَ من الْجاهِلِينَ وأما قوله في هذا الذكر لا تَدْرِي لَعَلَّ الله يُحْدِثُ بَعْدَ ذلِكَ أَمْراً وذلك لأنا ما عرفنا من القوي الموجودة في الإنسان إلا قدر ما أوجد فيه وربما في علم الله عنده أو في الإمكان قوى لم يوجدها الله تعالى فينا اليوم حتى لو قيل للفرس عن القوة التي تميز بها الإنسان عنه أنكرها وفي طريق الله ما يقوله أهل الطريق في إثبات المقام الذي فوق طور العقل وهي قوة يوجدها الله في بعض عباده من رسول ونبى وولي تعطي خلاف ما أعطته قوة العقل حتى إن بعض العقلاء أنكر ذلك والشرع أثبته ونحن نعلم أن في نشأة الآخرة قوى لا تكون في نشأة الدنيا ولا يحكم بها عقل هنا ولا تنال إلا بالذوق عند من أوجدها الله فيه وتحصل لبعض الناس هنا فَلا تَعْلَمُ نَفْسٌ ما أُخْفِيَ لها فيها من قُرَّةِ أَعْيُنٍ‏\n\n\nوفي الجنة ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n\n\nفخرج عن طور العقل بتعيين أمر ما وما خرج عن طور العقل بالإمكان إذ لا حكم للعقل فيما يعنيه الله من الأمور إلا الإمكان خاصة أو\nما تتحير فيه فلهذا جاءت كلمة لعل وهي كلمة ترج وكل ترج إلهي فهو واقع فلا بد منه فهذا هو الأمر الذي يحديه في النشأة وأما في الأحكام فمعلوم في العلم الرسمي إلى يوم القيامة فإن الرسول صَلَّى اللهُ عَليهِ وسَلَّم لما قرر حكم المجتهد لا يزال حكم الشرع ينزل من الله على قلوب المجتهدين إلى انقضاء الدنيا فقد يحكم اليوم مجتهد في أمر لم يتقدم فيه ذلك الحكم واقتضاه له دليل هذا لمجتهد من كتاب أو سنة أو إجماع أو قياس جلي فهذا أمر قد حدث في الحكم إذا تعداه المجتهد أو المقلد له فَقَدْ ظَلَمَ نَفْسَهُ فهذا أو أمثاله مما يعطيه هذا الذكر وهذا القدر من الإشارة في هذا الذكر كاف إن شاء الله فإن هذا الذي يعطيه هذا الذكر فيه تفصيل كثير وتمثيل نبهناك على المأخذ فيه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 525: Concerning the Gnosis of the State of a Pole (قطب) whose Station was [the verse]: <<And whoever transgresses the limits of Allah has certainly wronged himself. You do not know; perhaps Allah will bring about after that a matter.>> (Quran 65:1)\n\n> If the existent things (أكوان) transgress the limits of Allah,\n> Their judgment on the Day of Separation (يوم فصل الحكم) is loss.\n>\n> If a judgment is renewed that none knows\n> Save the God, and no balance (ميزان) comprehends it—\n>\n> That is a Divine Generosity (جود إلهي) brought to you by\n> The Providence (عناية) of the God of Truth (إله الحق), a Criterion (فرقان).\n>\n> Were it not for Existence (الوجود), and were it not for the secret of His Wisdom (حكمته)\n> Within it, the entities (أعيان) would not have appeared in the Cosmos (الكون).\n>\n> He is Existence (الوجود), but He is not known [in His Essence].\n> And how can deficiency (نقصان) comprehend the True Perfection (الكمال الحق)?\n\nKnow—may Allah support us and you with the Holy Spirit (روح القدس), the Trustworthy Spirit (الروح الأمين)—\n\n> Indeed, Allah has limits that are known,\n> And he who knows them does not turn away.\n>\n> Looking at their ruling with deliberation,\n> He stands by them in every state.\n>\n> So look into them, stand upon them,\n> And by the Truth of the Real (حق الحق), do not deviate.\n>\n> You will find the secret manifest within them,\n> And thus the people of transgression (أهل التعدي) knew [it].\n>\n> And for this, they violated their sanctity,\n> Claiming that they had attained Unveiling (كشف).\n>\n> They wronged themselves (ظلموا أنفسهم) and were veiled (انحجبوا)\n> From Allah’s Will (مراد الله) when they confessed [to the transgression].\n>\n> And hope (الترجي) is realized, since it came\n> From the Speech of Allah concerning Him, so stand firm.\n>\n> By what I have said concerning it, and be characterized\n> By hope (الترجي) just as He is characterized [by it].\n>\n> For He is with the one who thinks well of Him,\n> So think good of Him and turn [to Him].\n\n### [Indeed, Allah has defined the rulings by Obligation (الوجوب), Prohibition (الحظر), Dislike (الكراهة), Recommendation (الندب), and Permissibility (الإباحة)]\n\nThe limits of Allah (حدود الله) are His rulings concerning the acts of those held responsible (المكلفين). One does not transgress one limit except to another limit that is not a Divine limit (حد إلهي) which he should not transgress. His very transgression toward it is the essence of his transgression within it, so he judges matters by a ruling other than Allah’s ruling—this is inevitable. Look how astonishing this is!\n\nThe rulings of Allah, which are His limits, are Obligation (وجوب), Prohibition (حظر), Dislike (كراهة), Recommendation (ندب), and Permissibility (إباحة). Every agent acting through movement or stillness must have his action fall under an obligatory, prohibited, recommended, disliked, or permissible category; it cannot be devoid of these.\n\nIf his action concerning an obligation is its omission (ترك), he has transgressed the limits of Allah by abandoning what was obligatory for him to do. If he abandons it believing that it is not obligatory for him to do, then he has committed a transgression of disbelief (تعدى كفر) in that matter. He must necessarily judge it by a ruling other than Allah’s ruling, moving to another ruling of Allah, but applied to a different entity (عين). Thus, he permitted the omission of what Allah made obligatory for him to do, and permitted the omission of what Allah forbade him to omit. If he asserts the obligation of omission regarding what the Law (الشرع) declared to be the obligation of action, this is a great and flagrant transgression (تعد عظيم فاحش) and an adherence to a caprice (هوى) that misguides from the path of Allah.\n\nTransgression through action and omission is disobedience (معصية), while transgression through belief (اعتقاد) is disbelief (كفر). Whoever inverts the rulings of Allah has disbelieved and lost.\n\nThere is another transgression of the limits of Allah, which is the inversion of Realities (قلب الحقائق). The transgressor is called ignorant (جاهلا), and his transgression is ignorance (جهلا). These are the essential limits (الحدود الذاتية) of things. They are attributed to Allah only because the knowledge (العلم) of them was obtained by us from the side of Allah, since He granted us the power—which is the power of intellect (العقل) and contemplation (النظر)—by which we reach the knowledge of these limits.\n\nFurthermore, the matters we define are not something additional to what has appeared in the intelligible and sensible manifestations (المظاهر المعقولة والمحسوسة). Nothing has appeared except The Real (الحق), and that which appears in the intellect or the sense is what we define, and it is none other than Allah. Thus, these are the limits of Allah (حدود الله).\n\nThe defined entities (المحدودات) may share certain characteristics and be distinguished by others. That by which they are distinguished—the differentiae (الفصول)—is their distinguishing limit, separating them from what shares characteristics with them. And that by which both the sharing and the distinction occur is entirely a limit for them.\n\nWhoever transgresses these limits has certainly wronged himself (فَقَدْ ظَلَمَ نَفْسَهُ) with a wrong that is called ignorance (جهلا) and inversion of Realities (قلبا للحقائق). The inversion of Realities is either the inversion of the entity (عينها) entirely, or the inversion of its constitutive differentiae (فصولها المقومة لها). In any case, he has transgressed the limits of Allah and become ignorant.\n\nFor instance, defining the Creator by what is the limit of the created means inverting the matter in its entirety. Or, defining the human by the constitutive differentia of the horse means he has erred, being ignorant of some aspects while knowing others. These are truly the ignorant ones (الجاهلون حقا), just as in the transgression of rulings, or when dealing with what the Lawgiver (الشارع) brought: whoever believes in part and disbelieves in part is truly the disbeliever, and disbelief (الكفر) prevails over faith (الايمان).\n\nFor the removal of the constitutive differentia (الفصل المقوم) from the defined entity is the very removal of its share of commonality. The animality (حيوانية) of the human is not the same as the animality of the horse when considering the individuality (شخصية) of that defined entity. Therefore, the whole is lost when a part is lost.\n\nAllah the Exalted said to His Prophet, may Allah bless him and grant him peace: <<So be not among the ignorant>> (Quran 6:35) and <<I advise you lest you be among the ignorant>> (Quran 11:46).\n\nAs for His saying in this invocation, <<You do not know; perhaps Allah will bring about after that a matter>> (Quran 65:1), this is because we have only known of the powers existing in the human being the measure that He has brought into existence within him. Perhaps in Allah’s Knowledge (علم الله) or in possibility (الإمكان) there are powers that Allah the Exalted has not brought into existence within us today.\n\nEven if the horse were told about the power by which the human is distinguished from it, it would deny it. And in the Way of Allah (طريق الله), there is what the People of the Way (أهل الطريق) assert regarding the establishment of the Station (المقام) that is beyond the sphere of the intellect (طور العقل). This is a power that Allah brings into existence in some of His servants—whether a Messenger, a Prophet, or a Saint (ولي)—which yields results contrary to what the power of the intellect yields, to the extent that some rationalists deny it, while the Law (الشرع) affirms it.\n\nWe know that in the genesis of the Hereafter (نشأة الآخرة) there are powers that do not exist in the genesis of this world (نشأة الدنيا), which the intellect here cannot judge, and which are only attained through direct experience (الذوق) by those in whom Allah has brought them into existence. They are attained by some people here [in this life]: <<No soul knows what has been hidden for them of comfort for eyes>> (Quran 32:17).\n\nAnd in Paradise (الجنة) there is what no eye has seen, nor ear heard, nor has it occurred to the heart of man.\n\nThus, [this matter] is outside the sphere of the intellect (طور العقل) in terms of its specific determination, but it is not outside the sphere of the intellect in terms of possibility (الإمكان). For the intellect has no judgment concerning the matters Allah intends except possibility specifically, or that in which it is bewildered. For this reason, the word *la‘alla* (perhaps) came, and it is a word of hope (ترج). Every Divine hope is realized (واقع), so it is inevitable.\n\nThis, then, is the matter that limits Him in the genesis [of existence]. As for rulings (الأحكام), they are known in the formal science (العلم الرسمي) until the Day of Resurrection. Since the Messenger, may Allah bless him and grant him peace, established the ruling of the independent jurist (المجتهد), the ruling of the Law (حكم الشرع) continues to descend from Allah upon the hearts of the jurists until the end of the world. A jurist may rule today on a matter for which that ruling had not previously existed, and the evidence for this jurist required it, whether from the Book, the Sunna, consensus (إجماع), or clear analogy (قياس جلي). This is a matter that has occurred in the ruling. If the jurist or his follower transgresses it, he has certainly wronged himself (فَقَدْ ظَلَمَ نَفْسَهُ). This, or examples like it, is what this invocation yields. This much indication concerning this invocation is sufficient, if Allah wills, for what this invocation yields contains much detail and illustration. We have alerted you to the source of the matter, and <<Allah speaks the Truth, and He guides to the way>> (Quran 33:4).",
    "ur": "باب نمبر ۵۲۵: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور جو کوئی اللہ کی حدود سے تجاوز کرتا ہے تو اس نے اپنی جان پر ظلم کیا، تم نہیں جانتے شاید اللہ اس کے بعد کوئی نیا معاملہ پیدا کر دے۔\" (وَمَن يَتَعَدَّ حُدُودَ اللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ لَا تَدْرِي لَعَلَّ اللَّهَ يُحْدِثُ بَعْدَ ذَلِكَ أَمْرًا) [الطلاق: ۱]\n\nجب کائناتیں اللہ کی حدود سے تجاوز کر جائیں،\nتو فیصلہ کے دن ان کا حکم خسارہ ہے۔\n\nاور اگر کوئی ایسا حکم نیا ہو جائے جسے\nخدا کے سوا کوئی نہیں جانتا، اور نہ کوئی میزان اسے سمجھ سکتا ہے۔\n\nتو یہ ایک الٰہی سخاوت ہے جو تیرے پاس\nذات حق (الحق) کی عنایت سے فرقان بن کر آئی ہے۔\n\nاگر ہستی (الوجود) نہ ہوتی اور نہ اس میں اس کی حکمت کا راز ہوتا،\nتو کائنات میں کوئی حقیقت (اعیان) ظاہر نہ ہوتی۔\n\nوہ ہی ہستی (الوجود) ہے، لیکن کوئی اسے نہیں جانتا،\nاور حق (الحق) کے کمال کو نقص کیسے جان سکتا ہے؟\n\nجان لو، اللہ ہمیں اور تمہیں روح القدس، روح الامین کے ذریعے تائید عطا فرمائے۔\n\nبے شک اللہ کی حدود ہیں جو جانی جاتی ہیں،\nاور جو انہیں جانتا ہے وہ منہ نہیں موڑتا۔\nان کے حکم میں غور و فکر کرتا ہوا،\nہر حال میں ان کے پاس ٹھہرتا ہے۔\n\nپس ان میں غور کرو، ان پر ٹھہرو،\nاور ذات حق (الحق) کے حق سے انحراف نہ کرو۔\n\nتم ان کے پاس راز کو علانیہ پاؤ گے،\nاسی لیے تجاوز کرنے والوں نے پہچان لیا۔\nاور اسی وجہ سے انہوں نے ان کی حرمت کو پامال کیا،\nاور دعویٰ کیا کہ انہیں کشف (الکشف) حاصل ہو گیا ہے۔\n\nانہوں نے اپنی جانوں پر ظلم کیا، پس وہ\nاللہ کی مراد سے پردے میں چلے گئے جب انہوں نے اعتراف کیا۔\nاور امید (ترجی) واقع ہونے والی ہے، جہاں یہ\nاللہ کے کلام سے آئی ہے، پس تم ٹھہرو۔\n\nجو میں نے کہا ہے اس پر قائم رہو اور\nامید (ترجی) کی صفت اختیار کرو جیسے وہ صفت اختیار کرتا ہے۔\nکہ وہ اس کے پاس ہے جس کے بارے میں اس نے گمان کیا،\nپس تم اس سے بھلائی کا گمان کرو اور لپٹ جاؤ۔\n\n### [بے شک اللہ نے احکام کو وجوب، ممانعت، کراہت، استحباب اور اباحت کے ذریعے محدود کیا ہے]\n\nاللہ کی حدود مکلفین کے افعال میں اس کے احکام ہیں۔ پس کوئی شخص ایک حد سے تجاوز نہیں کرتا مگر کسی دوسری حد کی طرف، جو کہ غیر الٰہی حد نہیں ہے جس سے وہ تجاوز نہ کرے۔ اور اس کا اس حد کی طرف تجاوز کرنا عین اس حد میں تجاوز کرنا ہے۔ پس وہ معاملات میں اللہ کے حکم کے بغیر حکم لگاتا ہے، یہ لازمی ہے۔ پس دیکھو یہ کتنا عجیب ہے! اور اللہ کے احکام جو اس کی حدود ہیں، وہ وجوب، ممانعت (حظر)، کراہت، استحباب (ندب) اور اباحت ہیں۔ پس ہر متصرف حرکت اور سکون کے ساتھ لازماً واجب، یا ممنوع، یا مستحب، یا مکروہ، یا مباح میں تصرف کرتا ہے، وہ اس سے خالی نہیں ہو سکتا۔ اگر اس کا تصرف کسی واجب میں ہو جسے وہ ترک کر کے انجام دے، تو اس نے واجب فعل کو ترک کر کے اللہ کی حدود سے تجاوز کیا۔ اگر وہ اسے اس بنیاد پر ترک کرتا ہے کہ یہ اس پر واجب نہیں ہے، تو اس نے اس میں کفر کا تجاوز کیا، اور لازماً اس میں اللہ کے حکم کے بغیر حکم لگایا، اور اس میں اللہ کے کسی دوسرے حکم کی طرف منتقل ہو گیا، لیکن اس عین (حقیقت) میں نہیں۔ پس اس نے اس چیز کا ترک مباح قرار دیا جسے اللہ نے اس پر واجب کیا تھا، اور اس چیز کا ترک مباح قرار دیا جسے اللہ نے اس پر حرام کیا تھا۔ اور اگر وہ اس چیز میں ترک کو واجب قرار دے جس میں شریعت نے فعل کو واجب قرار دیا ہے، تو یہ ایک عظیم اور فاحش تجاوز ہے اور گمراہ کن خواہش کی پیروی ہے جو اللہ کے راستے سے بھٹکا دیتی ہے۔ پس فعل اور ترک کے ذریعے تجاوز کرنا معصیت ہے، اور اعتقاد کے ذریعے تجاوز کرنا کفر ہے۔ اور جس نے اللہ کے احکام کو الٹ دیا، اس نے کفر کیا اور خسارہ اٹھایا۔\n\nاور پھر اللہ کی حدود کا ایک اور تجاوز ہے، اور وہ حقائق کو الٹ دینا (قلب الحقائق) ہے۔ اور تجاوز کرنے والے کو جاہل کہا جاتا ہے، اور اس کا تجاوز جہالت ہے۔ یہ اشیاء کی ذاتی حدود ہیں۔ اور انہیں اللہ کی طرف اس لیے منسوب کیا گیا ہے کہ ان کا علم ہمیں اللہ کی طرف سے ہی حاصل ہوا ہے، جہاں اس نے ہمیں وہ قوت عطا کی جو عقل اور نظر کی قوت ہے، جس کے ذریعے ہم ان حدود کے علم تک پہنچتے ہیں۔ اور اس لیے بھی کہ جن امور کی ہم حد بندی کرتے ہیں، وہ ان مظاہر سے زائد کوئی چیز نہیں ہیں جو معقول اور محسوس میں ظاہر ہوئے ہیں، اور ظاہر تو صرف ذات حق (الحق) ہوئی ہے۔ اور وہ جو عقل یا حس میں ظاہر ہوا ہے، ہم اسی کی حد بندی کرتے ہیں، اور وہ اللہ کے سوا کچھ نہیں ہے۔ پس یہ اللہ کی حدود ہیں۔\n\nاور محدودات بعض امور میں مشترک ہو سکتے ہیں اور بعض امور میں ممتاز۔ پس جن فصول (امتیازی خصوصیات) کے ذریعے وہ ممتاز ہوئے، وہ ان کی حد ہے جو انہیں ان سے ممتاز کرتی ہے جو ان میں شریک ہیں۔ اور جس میں اشتراک اور امتیاز واقع ہوا، وہ سب ان کی حد ہے۔ پس جس نے ان حدود سے تجاوز کیا، تو اس نے اپنی جان پر ظلم کیا (فَقَدْ ظَلَمَ نَفْسَهُ)، ایسے ظلم کے ذریعے جسے جہالت اور حقائق کو الٹ دینا (قلب الحقائق) کہا جاتا ہے۔ اور حقائق کو الٹ دینا یا تو یہ ہے کہ ان کی پوری حقیقت (عین) کو الٹ دیا جائے، یا ان فصول کے لحاظ سے الٹ دیا جائے جو انہیں قائم کرتے ہیں۔ بہرصورت، اس نے اللہ کی حدود سے تجاوز کیا اور جہالت کی۔ پس اس نے خالق کی حد بندی اس چیز سے کی جو مخلوق کی حد ہے، تو اس نے پورے معاملے کو اس کی حقیقت (عین) میں الٹ دیا۔ اور جس نے انسان کی حد بندی اس فصل سے کی جو گھوڑے کو قائم کرتا ہے، تو اس نے غلطی کی اور بعض کو جانا اور بعض سے جاہل رہا۔ پس وہی حقیقی جاہل ہیں، جیسا کہ احکام کے تجاوز میں ہوتا ہے، یا جو شارع لایا ہے، جب کوئی بعض پر ایمان لائے اور بعض کا انکار کرے، تو وہ حقیقی کافر ہے اور کفر ایمان پر غالب آ جاتا ہے۔ کیونکہ محدود سے فصلِ مقوم (قائم کرنے والی خصوصیت) کا زائل ہونا عین اس کے مشترکہ حصے کا زائل ہونا ہے۔ کیونکہ انسان کی حیوانیت اس محدود کی شخصیت کے لحاظ سے گھوڑے کی حیوانیت کی عین نہیں ہے۔ اسی لیے بعض کے زائل ہونے سے سب زائل ہو جاتا ہے۔\n\nاور اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم سے فرمایا: \"پس تم جاہلوں میں سے نہ ہو جانا\" (فَلَا تَكُونَنَّ مِنَ الْجَاهِلِينَ) [الأنعام: ۳۵] اور \"میں تمہیں نصیحت کرتا ہوں کہ تم جاہلوں میں سے نہ ہو جانا\" (وَإِنِّي أَعِظُكَ أَن تَكُونَ مِنَ الْجَاهِلِينَ) [هود: ۴۶]۔\n\nاور جہاں تک اس ذکر میں اس کے قول کا تعلق ہے: \"تم نہیں جانتے شاید اللہ اس کے بعد کوئی نیا معاملہ پیدا کر دے\" (لَا تَدْرِي لَعَلَّ اللَّهَ يُحْدِثُ بَعْدَ ذَلِكَ أَمْرًا)، تو یہ اس لیے ہے کہ ہم نے انسان میں موجود قوتوں میں سے صرف اتنا ہی جانا ہے جتنا اس میں پیدا کیا گیا ہے۔ اور شاید اللہ کے علم میں یا امکان میں ایسی قوتیں ہوں جو اللہ تعالیٰ نے آج ہم میں پیدا نہیں کیں، یہاں تک کہ اگر گھوڑے سے اس قوت کے بارے میں کہا جائے جس سے انسان اس سے ممتاز ہوتا ہے تو وہ اس کا انکار کر دے گا۔ اور اللہ کے راستے میں وہ ہے جو اہل طریق اس مقام کے اثبات میں کہتے ہیں جو عقل کے دائرے سے اوپر ہے، اور وہ ایک ایسی قوت ہے جسے اللہ اپنے بعض بندوں میں، رسول، نبی اور ولی میں پیدا کرتا ہے، جو عقل کی قوت کے دیے ہوئے کے خلاف دیتی ہے۔ یہاں تک کہ بعض عقلمندوں نے اس کا انکار کیا، جبکہ شریعت نے اسے ثابت کیا۔ اور ہم جانتے ہیں کہ آخرت کی نشأت میں ایسی قوتیں ہوں گی جو دنیا کی نشأت میں نہیں ہوں گی، اور نہ ہی عقل یہاں ان کے بارے میں حکم لگا سکتی ہے، اور یہ صرف ذوق (روحانی تجربہ) کے ذریعے ہی حاصل ہوتی ہیں اس شخص کو جس میں اللہ اسے پیدا کر دے، اور بعض لوگوں کو یہ یہاں بھی حاصل ہو جاتی ہے۔ \"پس کوئی جان نہیں جانتی کہ ان کے لیے آنکھوں کی ٹھنڈک میں سے کیا کچھ چھپا کر رکھا گیا ہے\" (فَلَا تَعْلَمُ نَفْسٌ مَّا أُخْفِيَ لَهُم مِّن قُرَّةِ أَعْيُنٍ) [السجدة: ۱۷]۔ اور جنت میں وہ کچھ ہے جو نہ کسی آنکھ نے دیکھا، نہ کسی کان نے سنا، اور نہ کسی انسان کے دل پر اس کا خیال گزرا۔ پس کسی چیز کی تعیین کے ذریعے عقل کے دائرے سے باہر نکل گیا، لیکن امکان کے ذریعے عقل کے دائرے سے باہر نہیں نکلا، کیونکہ عقل کا ان امور میں جن کا اللہ ارادہ کرتا ہے، صرف امکان کا حکم ہے یا وہ جس میں وہ حیران ہو جائے۔ اسی لیے لفظ \"لعل\" (شاید) آیا ہے، اور یہ امید (ترجی) کا کلمہ ہے، اور ہر الٰہی امید واقع ہونے والی ہے، پس وہ لازمی ہے۔ تو یہ وہ معاملہ ہے جو نشأت میں اس کی حد بندی کرتا ہے۔\n\nاور جہاں تک احکام کا تعلق ہے، تو وہ قیامت تک رسمی علم میں معلوم ہیں۔ کیونکہ رسول صلی اللہ علیہ وسلم نے جب مجتہد کے حکم کو مقرر فرمایا، تو شریعت کا حکم دنیا کے ختم ہونے تک مجتہدین کے دلوں پر اللہ کی طرف سے نازل ہوتا رہے گا۔ پس آج کوئی مجتہد کسی ایسے معاملے میں حکم لگا سکتا ہے جس میں وہ حکم پہلے نہیں آیا تھا، اور اس مجتہد کے لیے اس کی دلیل کتاب، سنت، اجماع یا قیاس جلی سے نکلی ہو۔ پس یہ ایک ایسا معاملہ ہے جو حکم میں نیا پیدا ہوا ہے۔ اگر مجتہد یا اس کا مقلد اس سے تجاوز کرے، تو اس نے اپنی جان پر ظلم کیا (فَقَدْ ظَلَمَ نَفْسَهُ)۔ پس یہ یا اس کی مثالیں وہ ہیں جو یہ ذکر دیتا ہے۔ اور اس ذکر میں اشارے کی یہ مقدار کافی ہے، ان شاء اللہ۔ کیونکہ جو کچھ یہ ذکر دیتا ہے اس میں بہت زیادہ تفصیل اور مثالیں ہیں، ہم نے تمہیں اس کے ماخذ پر متنبہ کر دیا ہے۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے (وَهُوَ يَهْدِي السَّبِيلَ) [الأحزاب: ۴]۔",
    "fa": "باب پانصد و بیست و پنجم در شناخت حال قطبی که منزل او این آیه بود: «و هر کس از حدود الهی تجاوز کند، به تحقیق به خود ستم کرده است. تو نمی‌دانی، شاید خداوند پس از آن امری نو پدید آورد.» (وَمَن يَتَعَدَّ حُدُودَ اللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ لَا تَدْرِي لَعَلَّ اللَّهَ يُحْدِثُ بَعْدَ ذَلِكَ أَمْرًا)\n\nچون کائنات از حدود حق (الحق) تجاوز کنند،\nحکم آن‌ها در روز داوری، زیان و خسران است.\nاگر حکمی نو شود که جز خدا آن را نشناسد،\nو هیچ میزانی آن را درنیابد،\nپس آن بخشش الهی است که به تو رسیده،\nعنایتی از سوی خدای حق (الحق)، فرقان است.\nاگر هستی (الوجود) و اگر راز حکمت او نبود،\nدر آن، اعیان در کائنات ظاهر نمی‌شدند.\nاو هستی (الوجود) است، اما شناخته نمی‌شود،\nو چگونه نقص می‌تواند کمال حق (الحق) را درک کند؟\n\nبدان، خداوند ما و تو را به روح‌القدس، روح امین، تأیید کند.\n\nهمانا خداوند را حدودی است که شناخته می‌شوند،\nو آنکه آن‌ها را بشناسد، روی برنمی‌گرداند.\nبا تأمل در حکم آن‌ها می‌نگرد،\nو در هر حالی نزد آن‌ها می‌ایستد.\nپس در آن‌ها بنگرید و بر آن‌ها توقف کنید،\nو به حق حق (الحق) منحرف نشوید.\nراز را نزد آن‌ها آشکارا می‌یابید،\nو به همین دلیل اهل تجاوز (التعدي) آن‌ها را شناختند.\nو به همین دلیل حرمت آن‌ها را شکستند،\nو ادعا کردند که به کشف (الکشف) رسیده‌اند.\nبه خود ستم کردند و محجوب شدند،\nاز مراد خداوند هنگامی که اعتراف کردند.\nو امید (الترجي) واقع می‌شود، آنجا که\nاز کلام خدا درباره آن آمده است، پس توقف کنید.\nبر آنچه گفتم و متصف شوید،\nبه امید (الترجي) همان‌گونه که متصف می‌شود.\nکه او نزد گمان بنده‌اش است،\nپس گمان نیک به او برید و بپیچید (به سوی او).\n\n[همانا خداوند احکام را به وجوب، حظر (حرام بودن)، کراهت، ندب (مستحب بودن) و اباحه محدود کرده است]\n\nحدود الهی (حدود الله)، احکام او در افعال مکلفین است. پس هیچ حدی از آن تجاوز نمی‌شود مگر به سوی حدی دیگر که حد الهی نیست و از آن تجاوز نمی‌شود. و نفس تجاوز او به آن، عین تجاوز او در آن است. پس ناگزیر در امور به غیر حکم خدا حکم می‌کند. بنگر که این چقدر شگفت‌انگیز است! احکام خداوند که حدود او هستند عبارتند از: وجوب، حظر (حرام بودن)، کراهت، ندب (استحباب) و اباحه. هر متصرفی با حرکت و سکون، ناگزیر تصرفش یا در واجب است یا محظور، یا مندوب، یا مکروه، یا مباح؛ از این‌ها خالی نیست. اگر تصرف او در واجبی باشد که باید آن را انجام دهد، اما آن را ترک کند، به سبب ترک آنچه بر او واجب بوده، از حدود الهی تجاوز کرده است. اگر آن را ترک کند به این گمان که بر او واجب نیست، در این کار تجاوزی از نوع کفر کرده است و ناگزیر در آن به غیر حکم خدا حکم کرده و به حکم دیگری از احکام خدا منتقل شده است، اما نه در این عین (مورد خاص). پس ترک آنچه را خدا واجب کرده، مباح شمرده و ترک آنچه را خدا حرام کرده، ترک کرده است. و اگر در موردی که شرع به وجوب فعل حکم کرده، به وجوب ترک حکم کند، این تجاوزی بزرگ و فاحش و پیروی از هوای نفس گمراه‌کننده از راه خداست. پس تجاوز با فعل و ترک، معصیت است و تجاوز با اعتقاد، کفر است. و هر کس احکام خدا را دگرگون سازد، کافر شده و زیان دیده است.\n\nسپس تجاوز دیگری از حدود الهی وجود دارد که همان دگرگون‌سازی حقایق (قلب الحقائق) است و متجاوز، جاهل نامیده می‌شود و تجاوزش، جهل است. این‌ها حدود ذاتی اشیا هستند و تنها از آن رو به خدا نسبت داده شده‌اند که علم به آن‌ها از جانب خدا برای ما حاصل شده است، زیرا او به ما نیرویی داده است که همان نیروی عقل و نظر است و با آن به علم این حدود می‌رسیم. و نیز به این دلیل که اموری که ما آن‌ها را تعریف (حد) می‌کنیم، چیزی زائد بر آنچه در مظاهر معقول و محسوس ظاهر شده، نیستند و جز حق (الحق) چیزی ظاهر نشده است. و آن ظاهر در عقل یا حس، همان چیزی است که ما آن را تعریف می‌کنیم و جز خدا نیست. پس این‌ها حدود الهی هستند.\n\nمحدودات ممکن است در اموری مشترک باشند و در اموری متمایز شوند. آنچه با آن متمایز شده‌اند (فصول)، حد ممیز آن‌ها از شریکشان است، و آنچه با آن اشتراک و تمایز حاصل شده، تماماً حد آن است. پس هر کس از این حدود تجاوز کند، به خود ستم کرده است (فَقَدْ ظَلَمَ نَفْسَهُ) به ستمی که جهل و دگرگون‌سازی حقایق (قلب الحقائق) نامیده می‌شود. دگرگون‌سازی حقایق یا به این صورت است که عین آن حقیقت را به طور کامل دگرگون کند، یا آن را از حیث فصول مقومش دگرگون سازد. در هر صورت، از حدود الهی تجاوز کرده و جاهل شده است. پس خالق را به آنچه حد مخلوق است، تعریف کرده و امر را در تمام عینش دگرگون ساخته است. و اگر انسان را به فصلی که مقوم اسب است تعریف کند، خطا کرده و جاهل به بخشی و عالم به بخشی دیگر شده است. پس آنان جاهلان حقیقی هستند، همان‌گونه که در تجاوز از احکام یا آنچه شارع آورده است، اگر به بخشی ایمان آورد و به بخشی کفر ورزد، کافر حقیقی است و کفر بر ایمان غلبه یافته است. زیرا از بین رفتن فصل مقوم از محدود، عین از بین رفتن سهم اشتراک آن است. چرا که حیوانیت انسان، عین حیوانیت اسب نیست، با توجه به شخصیت آن محدود. به همین دلیل، با از بین رفتن جزء، کل از بین می‌رود. و خداوند متعال به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «پس زنهار از جاهلان مباش» (فَلَا تَكُونَنَّ مِنَ الْجَاهِلِينَ) و «من تو را پند می‌دهم که از جاهلان نباشی» (وَإِنِّي أَعِظُكَ أَن تَكُونَ مِنَ الْجَاهِلِينَ).\n\nو اما در مورد این ذکر که می‌گوید: «تو نمی‌دانی، شاید خداوند پس از آن امری نو پدید آورد» (لَا تَدْرِي لَعَلَّ اللَّهَ يُحْدِثُ بَعْدَ ذَلِكَ أَمْرًا)، این بدان سبب است که ما از نیروهای موجود در انسان، جز به اندازه‌ای که در او ایجاد شده، نشناخته‌ایم. و چه بسا در علم خداوند یا در عالم امکان، نیروهایی وجود داشته باشند که خداوند امروز آن‌ها را در ما ایجاد نکرده است؛ تا جایی که اگر به اسب درباره نیرویی که انسان به واسطه آن از او متمایز می‌شود گفته شود، آن را انکار می‌کند.\n\nو در طریق خدا، آنچه اهل طریقت در اثبات مقامی که فوق طور عقل است می‌گویند، نیرویی است که خداوند در برخی از بندگانش از رسول و نبی و ولی ایجاد می‌کند که خلاف آنچه نیروی عقل می‌دهد، عطا می‌کند؛ تا جایی که برخی از عقلا آن را انکار کرده‌اند، در حالی که شرع آن را اثبات نموده است.\n\nو ما می‌دانیم که در نشئه آخرت، نیروهایی وجود دارد که در نشئه دنیا نیست و عقل در اینجا بر آن‌ها حکم نمی‌کند و جز با ذوق (تجربه عرفانی) نزد کسی که خداوند آن را در او ایجاد کرده، به دست نمی‌آید، و برای برخی از مردم در همین دنیا نیز حاصل می‌شود: «پس هیچ کس نمی‌داند چه چیز از روشنی چشم‌ها برایشان پنهان شده است» (فَلَا تَعْلَمُ نَفْسٌ مَّا أُخْفِيَ لَهَا مِن قُرَّةِ أَعْيُنٍ).\n\nو در حدیث آمده است: «و در بهشت چیزی است که نه چشمی دیده و نه گوشی شنیده و نه بر قلب بشری خطور کرده است.»\n\nپس با تعیین امری خاص، از طور عقل خارج شده است، اما با امکان، از طور عقل خارج نشده است؛ زیرا عقل در اموری که خداوند به آن‌ها عنایت دارد، حکمی جز امکان خاص یا آنچه در آن متحیر می‌شود، ندارد. به همین دلیل کلمه «لعل» (شاید) آمده است که کلمه امید (ترجی) است. و هر امید الهی (ترجی إلهی) واقع شدنی است و ناگزیر رخ می‌دهد.\n\nپس این همان امری است که در نشئه (هستی) محدود می‌شود. اما در احکام، تا روز قیامت در علم رسمی معلوم است؛ زیرا هنگامی که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) حکم مجتهد را مقرر فرمود، حکم شرع پیوسته از جانب خدا بر قلب‌های مجتهدین تا پایان دنیا نازل می‌شود. پس ممکن است امروز مجتهدی در امری حکم کند که آن حکم پیش از این وجود نداشته و دلیل آن مجتهد از کتاب یا سنت یا اجماع یا قیاس جلی، آن را اقتضا کرده است. این امری است که در حکم حادث شده است. اگر مجتهد یا مقلد او از آن تجاوز کند، به خود ستم کرده است (فَقَدْ ظَلَمَ نَفْسَهُ).\n\nاین یا امثال آن، از جمله مواردی است که این ذکر به ما می‌دهد. و این مقدار اشاره در این ذکر کافی است، ان‌شاءالله. زیرا آنچه این ذکر به ما می‌دهد، تفصیل و تمثیل بسیاری دارد که ما شما را بر مأخذ آن آگاه ساختیم. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 3
}