{
  "id": 13,
  "title": {
    "ar": "الباب الثالث عشر في معرفة حملة العرش",
    "en": "Chapter Thirteen: On the Knowledge of the Bearers of the Throne.",
    "ur": "تیرہواں باب: حاملانِ عرش (حملة العرش) کی معرفت میں",
    "fa": "باب سیزدهم در معرفت حاملان عرش"
  },
  "content": {
    "ar": "## «الباب الثالث عشر في معرفة حملة العرش»\n\n\n> العرش والله بالرحمن محمول *** وحاملوه وهذا القول معقول‏\n\n\n> وأي حول لمخلوق ومقدرة *** لولاه جاء به عقل وتنزيل‏\n\n\n> جسم وروح وأقوات ومرتبة *** ما ثم غير الذي رتبت تفصيل‏\n\n\n> فذا هو العرش إن حققت سورته *** والمستوي باسمه الرحمن مأمول‏\n\n\n> وهم ثمانية والله يعلمهم *** واليوم أربعة ما فيه تعليل‏\n\n\n> محمد ثم رضوان ومالكهم *** وآدم وخليل ثم جبريل‏\n\n\n> والحق بميكال إسرافيل ليس هنا *** سوى ثمانية غر بهاليل‏\n\n\n### [العرش في لسان العرب‏]\n\n\nاعلم أيد الله الولي الحميم أن العرش في لسان العرب يطلق ويراد به الملك يقال ثل عرش الملك إذا دخل في ملكه خلل ويطلق ويراد به السرير فإذا كان العرش عبارة عن الملك فتكون حملته هم القائمون به وإذا كان العرش السرير فتكون حملته ما يقوم عليه من القوائم أو من يحمله على كواهلهم والعدد يدخل في حملة العرش وقد جعل الرسول‏\nحكمهم في الدنيا أربعة وفي القيامة ثمانية\n\n\nفتلا رسول الله صلى الله عليه وسلم ويَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمانِيَةٌ ثم قال وهم اليوم أربعة يعني في يوم الدنيا وقوله يومئذ ثمانية يعني يوم الآخرة\n\n\n### [العرش محصور في جسم وروح وغذاء ومرتبة]\n\n\nروينا عن ابن مسرة الجبلي من أكبر أهل الطريق علما وحالا وكشفا العرش المحمول هو الملك وهو محصور في جسم وروح وغذاء ومرتبة فآدم وإسرافيل للصور وجبريل ومحمد للأرواح وميكائيل وإبراهيم للأرزاق ومالك ورضوان للوعد والوعيد وليس في الملك إلا ما ذكر والأغذية التي هي الأرزاق حسية ومعنوية فالذي نذكر في هذا الباب الطريقة الواحدة التي هي بمعنى الملك لما يتعلق به من الفائدة في الطريق وتكون حملته عبارة عن القائمين بتدبيره فتدبر صورة عنصرية أو صورة نورية وروحا مدبر الصورة عنصرية وروحا مدبرا مسخرا الصورة نورية وغذاء لصورة عنصرية وغذاء علوم ومعارف لأرواح ومرتبة حسية من سعادة بدخول الجنة ومرتبة حسية من شقاوة بدخول جهنم ومرتبة روحية علمية فمبنى هذا الباب على أربع مسائل المسألة الأولى الصورة والمسألة الثانية الروح والمسألة الثالثة الغذاء والمسألة الرابعة المرتبة وهي الغاية وكل مسألة منها تنقسم قسمين فتكون ثمانية وهم حملة عرش الملك أي إذا ظهرت الثمانية قام الملك وظهر واستوى عليه مليكه‏\n\n\n### [الأجسام النورية والملائكة الكروبيون‏]\n\n\nالمسألة الأولى الصورة وهي تنقسم قسمين صورة جسمية عنصرية تتضمن صورة جسدية خيالية والقسم الآخر صورة جسمية نورية فلنبتدئ بالجسم النوري فنقول إن أول جسم خلقه الله أجسام الأرواح الملكية المهيمة في جلال الله ومنهم العقل الأول والنفس الكل وإليها انتهت الأجسام النورية المخلوقة من نور الجلال وما ثم ملك من هؤلاء الملائكة من وجد بواسطة غيره إلا النفس التي دون العقل وكل ملك خلق بعد هؤلاء فداخلون تحت حكم الطبيعة فهم من جنس أفلاكها التي خلقوا منها وهم عمارها وكذلك ملائكة العناصر وآخر صنف من الأملاك الملائكة المخلوقون من أعمال العباد وأنفاسهم فلنذكر ذلك صنفا صنفا في هذا الباب إن شاء الله تعالى اعلم أن الله تعالى كان قبل إن يخلق الخلق ولا قبلية زمان وإنما ذلك عبارة للتوصيل تدل على نسبة يحصل بها المقصود في نفس السامع كان جل وتعالى في عماء ما تحته هواء وما فوقه هواء وهو أول مظهر إلهي ظهر فيه سرى فيه النور الذاتي كما ظهر في قوله الله نُورُ السَّماواتِ والْأَرْضِ فلما انصبغ ذلك العماء بالنور فتح فيه صور الملائكة المهيمين الذين هم فوق عالم الأجسام الطبيعية ولا عرش ولا مخلوق تقدمهم فلما أوجدهم تجلى لهم فصار لهم من ذلك التجلي غيبا كان ذلك الغيب روحا لهم أي لتلك الصور وتجلى لهم في اسمه الجميل فهاموا في جلال جماله فهم لا يفيقون‏\n\n\n### [العقل الأول قطب عالم التدوين والتسطير]\n\n\nفلما شاء أن يخلق عالم التدوين والتسطير عين واحدا من هؤلاء الملائكة الكروبيين وهو أول ملك ظهر من ملائكة ذلك النور سماه العقل والقلم وتجلى له في مجلى التعليم الوهبي بما يريد إيجاده من خلقه لا إلى غاية وحد فقبل بذاته علم ما يكون وما للحق من الأسماء الإلهية الطالبة صدور هذا العالم الخلقي فاشتق من هذا العقل موجودا آخر سماه اللوح وأمر القلم أن يتدلى إليه ويودع فيه جميع ما يكون إلى يوم القيامة لا غير وجعل لهذا القلم ثلاثمائة وستين سنا في قلميته أي من كونه قلما ومن كونه عقلا ثلاثمائة وستين تجليا أو رقيقة كل سن أو رقيقة تغترف من ثلاثمائة وستين صنفا من العلوم الإجمالية فيفصلها في اللوح فهذا حصر ما في العالم من العلوم إلى يوم القيامة فعلمها اللوح حين أودعه إياها القلم فكان من ذلك علم الطبيعة وهو أول علم حصل في هذا اللوح من علوم ما يريد الله خلقه فكانت الطبيعة دون النفس وذلك كله في عالم النور الخالص‏\n\n\n### [العرش وعماره من الملائكة]\n\n\nثم أوجد سبحانه الظلمة المحضة التي هي في مقابلة هذا النور بمنزلة العدم المطلق المقابل للوجود المطلق فعند ما أوجدها أفاض عليها النور إفاضة ذاتية بمساعدة الطبيعة فلأم شعثها ذلك النور فظهر الجسم المعبر عنه بالعرش فاستوى عليه الاسم الرحمن بالاسم الظاهر فذلك أول ما ظهر من عالم الخلق وخلق من ذلك النور الممتزج الذي هو مثل ضوء السحر الملائكة الحافين بالسرير وهو قوله وتَرَى الْمَلائِكَةَ حَافِّينَ من حَوْلِ الْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ فليس لهم شغل إلا كونهم حافين من حول العرش يسبحون بحمده وقد بينا خلق العالم في كتاب سميناه عقلة المستوفز وإنما نأخذ منه في هذا الباب رءوس الأشياء\n\n\n### [الكرسي وعماره من الملائكة]\n\n\nثم أوجد الكرسي في جوف هذا العرش وجعل فيه ملائكة من جنس طبيعته فكل فلك أصل لما خلق فيه من عمارة كالعناصر فيما خلق منها من‏\nعمارها كما خلق آدم من تراب وعمر به وببنيه الأرض وقسم في هذا الكرسي الكريم الكلمة إلى خبر وحكم وهما القدمان اللتان تدلتا له من العرش كما\n\n\nورد في الخبر النبوي ثم خلق في جوف الكرسي الأفلاك فلكا في جوف فلك وخلق في كل فلك عالما منه يعمرونه سماهم ملائكة\n\n\nيعني رسلا وزينها بالكواكب وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها إلى أن خلق صور المولدات‏\n\n\n### [الأرواح والصور النورية والخيالية والعنصرية]\n\n\nولما أكمل الله هذه الصور النورية والعنصرية بلا أرواح تكون غيبا لهذه الصور تجلى لكل صنف من الصور بحسب ما هي عليه فتكون عن الصور وعن هذا التجلي أرواح الصور وهي المسألة الثانية فخلق الأرواح وأمرها بتدبير الصور وجعلها غير منقسمة بل ذاتا واحدة وميز بعضها عن بعض فتميزت وكان ميزها بحسب قبول الصور من ذلك التجلي وليست الصور بأينيات لهذه الأرواح على الحقيقة إلا أن هذه الصور لها كالملك في حق الصور العنصرية وكالمظاهر في حق الصور كلها ثم أحدث الله الصور الجسدية الخيالية بتجل آخر بين اللطائف والصور تتجلى في تلك الصور الجسدية الصور النورية والنارية ظاهرة للعين وتتجلى الصور الحسية حاملة للصور المعنوية في هذه الصور الجسدية في النوم وبعد الموت وقبل البعث وهو البرزخ الصوري وهو قرن من نور أعلاه واسع وأسفله ضيق فإن أعلاه الصماء وأسفله الأرض وهذه الأجساد الصورية التي يظهر فيها الجن والملائكة وباطن الإنسان وهي الظاهرة في النوم وصور سوق الجنة وهي هذه الصور التي تعمر الأرض التي تقدم الكلام عليها في بابها\n\n\n### [غذاء الأرواح وغذاء الصور]\n\n\nثم إن الله تعالى جعل لهذه الصور ولهذه الأرواح غذاء وهو المسألة الثالثة يكون بذلك الغذاء بقاؤهم وهو رزق حسي ومعنوي فالمعنوي منه غذاء العلوم والتجليات والأحوال والغذاء المحسوس معلوم وهو ما تحمله صور المطعومات والمشروبات من المعاني الروحانية أعني القوي فذلك هو الغذاء فالغذاء كله معنوي على ما قلناه وإن كان في صور محسوسة فتتغذى كل صورة نورية كانت أو حيوانية أو جسدية بما يناسبها وتفصيل ذلك يطول‏\n\n\n### [مراتب العالم في السعادة والشقاء]\n\n\nثم إن الله جعل لكل عالم مرتبة في السعادة والشقاء ومنزلة وتفاصيلها لا تنحصر فسعادتها بحسبها فمنها سعادة غرضية ومنها سعادة كمالية ومنها سعادة ملائمة ومنها سعادة وضعية أعني شرعية والشقاوة مثل ذلك في التقسيم بما لا يوافق الغرض ولا الكمال ولا المزاج وهو غير الملائم ولا الشرع وذلك كله محسوس ومعقول فالمحسوس منه ما يتعلق بدار الشقاء من الآلام في الدنيا والآخرة ويتعلق بدار السعادة من اللذات في الدنيا والآخرة ومنه خالص وممتزج فالخالص يتعلق بالدار الآخرة والممتزج يتعلق بالدار الدنيا فيظهر السعيد بصورة الشقي والشقي بصورة السعيد وفي الآخرة يمتازون وقد يظهر الشقي في الدنيا بشقاوته ويتصل بشقاء الآخرة وكذلك السعيد ولكنهم مجهولون وفي الآخرة يمتازون وامْتازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ فهنالك تلحق المراتب بأهلها لحوقا لا ينخرم ولا يتبدل‏\n\n\n### [حملة العرش في الدنيا والآخرة]\n\n\nفقد بان لك معنى الثمانية التي هي مجموع الملك المعبر عنه بالعرش وهذه هي المسألة الرابعة فقد بان لك معنى الثمانية وهذه الثمانية للنسب الثمانية التي يوصف بها الحق وهي الحياة والعلم والقدرة والإرادة والكلام والسمع والبصر وإدراك المطعوم والمشموم والملموس بالصفة اللائقة به فإن لهذا الإدراك بها تعلقا كإدراك السمع بالمسموعات والبصر بالمبصرات ولهذا انحصر الملك في ثمانية فالظاهر منها في الدنيا أربعة الصورة والغذاء والمرتبتان ويوم القيامة تظهر الثمانية بجميعها للعيان وهو قوله تعالى ويَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمانِيَةٌ\n\n\nفقال صلى الله عليه وسلم وهم اليوم أربعة\n\n\nهذا في تفسير العرش بالملك وأما العرش الذي هو السرير فإن لله ملائكة يحملونه على كواهلهم هم اليوم أربعة وغدا يكونون ثمانية لأجل الحمل إلى أرض الحشر وورد في صور هؤلاء الأربعة الحملة ما يقاربه قول ابن مسرة فقيل الواحد على صورة الإنسان والثاني على صورة الأسد والثالث على صورة النسر والرابع على صورة الثور وهو الذي رآه السامري فتخيل أنه إله موسى فصنع لقومه العجل وقال هذا إِلهُكُمْ وإِلهُ مُوسى‏ القصة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Thirteen: Concerning the Knowledge of the Bearers of the Throne\n\nThe Throne (العرش), by the All-Merciful (الرحمن), is indeed borne,\nAnd its bearers—this saying is intelligible.\nWhat power or capacity does a creature possess,\nWere it not for Him, brought forth by intellect and revelation?\nBody, Spirit, Sustenance, and Rank (مرتبة)—\nThere is nothing there save what has been detailed and arranged.\nThis, then, is the Throne, if you verify its form (صورته),\nAnd the One Who is established (المستوي) by His Name, the All-Merciful, is the desired goal.\nThey are eight, and Allah knows them,\nAnd today they are four; there is no ambiguity in this.\nMuhammad, then Riḍwān, and Mālik,\nAnd Adam, and the Friend (Khalīl, i.e., Abraham), then Gabriel.\nAnd The Real (الحق) with Michael and Isrāfīl—there are not here\nExcept eight noble, splendid ones.\n\n### [The Throne in the Arabic Language]\n\nKnow, may Allah support the intimate friend (الولي الحميم), that the Throne (العرش) in the Arabic language is used to mean Dominion (الملك). It is said, \"The king's throne (عرش الملك) was shaken,\" meaning a defect entered his dominion. It is also used to mean a couch or seat (السرير). If the Throne is an expression for Dominion, then its bearers are those who maintain it. If the Throne is the couch, then its bearers are the supports upon which it rests, or those who carry it upon their shoulders. The number [of bearers] enters into the concept of the bearers of the Throne. The Messenger [of Allah] established their ruling in this world as four, and on the Day of Resurrection as eight.\n\nThe Messenger of Allah, peace and blessings be upon him, recited: <<وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمَانِيَةٌ>> (And eight will bear the Throne of your Lord above them on that Day). Then he said, \"And today they are four,\" meaning on the day of this world (الدنيا). His saying, \"on that Day, eight,\" means the Day of the Hereafter (الآخرة).\n\n### [The Throne is Confined to Body, Spirit, Sustenance, and Rank]\n\nWe have narrated from Ibn Masarra al-Jabalī, one of the greatest People of the Path (أهل الطريق) in knowledge, spiritual state (حال), and unveiling (كشف), that the borne Throne (العرش المحمول) is the Dominion (الملك), and it is confined to Body (جسم), Spirit (روح), Sustenance (غذاء), and Rank (مرتبة). Adam and Isrāfīl are for the Forms (الصور); Gabriel and Muhammad are for the Spirits (الأرواح); Michael and Abraham are for the Provisions (الأرزاق); and Mālik and Riḍwān are for the Promise and the Threat (الوعيد). There is nothing in the Dominion except what has been mentioned. The Sustenances (الأغذية), which are the Provisions, are sensory and non-sensory (حسية ومعنوية). What we mention in this chapter is the single method (الطريقة الواحدة) which signifies Dominion, due to the benefit related to it on the Path. Its bearers are thus an expression for those who manage its governance (تدبيره). This management involves an elemental form (صورة عنصرية) or a luminous form (صورة نورية); a spirit governing the elemental form; a spirit governing and subjugating the luminous form; sustenance for the elemental form; sustenance of sciences and gnosis (معارف) for the spirits; a sensory rank of felicity (سعاده) by entering Paradise; a sensory rank of wretchedness (شقاوة) by entering Hell; and a spiritual, scientific rank. The structure of this chapter is based on four issues: The First Issue is Form (الصورة); the Second Issue is Spirit (الروح); the Third Issue is Sustenance (الغذاء); and the Fourth Issue is Rank (المرتبة), which is the Goal (الغاية). Each of these issues is divided into two sections, making eight in total. These are the bearers of the Throne of Dominion. That is, when these eight manifest, the Dominion is established, appears, and its Sovereign (مليكه) is established upon it.\n\n### [Luminous Bodies and the Cherubic Angels]\n\nThe First Issue is Form (الصورة), and it is divided into two sections: a physical, elemental form (صورة جسمية عنصرية) which includes a bodily, imaginative form (صورة جسدية خيالية); and the other section is a physical, luminous form (صورة جسمية نورية). Let us begin with the luminous body. We say that the first bodies Allah created were the bodies of the angelic Spirits (الأرواح الملكية) bewildered (المهيمة) in the Majesty (جلال) of Allah. Among them are the First Intellect (العقل الأول) and the Universal Soul (النفس الكل). The luminous bodies created from the Light of Majesty (نور الجلال) terminate at these. There is no angel among these angels whose existence was mediated by another, except for the Soul (النفس) which is below the Intellect. Every angel created after these falls under the rule of Nature (الطبيعة); they are of the same genus as the spheres (أفلاكها) from which they were created, and they are their inhabitants. Likewise are the angels of the elements. The last class of angels are those created from the acts and breaths of the servants. We shall mention this class by class, if Allah wills, in this chapter. Know that Allah, the Exalted, existed before He created creation—and this is not a temporal priority, but merely an expression used for conveyance, indicating a relationship that achieves the intended meaning in the listener’s mind. He, Glorified and Exalted, was in a Cloud (عماء), with no air beneath Him and no air above Him. This was the first divine manifestation (مظهر إلهي) in which the Essential Light (النور الذاتي) flowed, just as it appeared in His saying: <<اللهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ>> (Allah is the Light of the heavens and the earth). When that Cloud was dyed with the Light, the forms of the bewildered angels (الملائكة المهيمين) were opened within it. These angels are above the world of natural bodies, and neither the Throne nor any creature preceded them. When He brought them into existence, He disclosed Himself (تجلى) to them. From that Theophany (التجلي), a hidden reality arose for them, and that hidden reality became a spirit (روح) for them, meaning for those forms. He disclosed Himself to them in His Name, the Beautiful (الجميل), so they became lost in the Majesty of His Beauty (جلال جماله), and they do not recover consciousness.\n\n### [The First Intellect: The Axis of the World of Recording and Inscribing]\n\nWhen He willed to create the World of Recording and Inscribing (عالم التدوين والتسطير), He designated one of these Cherubic Angels (الملائكة الكروبيين)—who was the first angel to appear from the angels of that Light—and named him the Intellect (العقل) and the Pen (القلم). He disclosed Himself to him in the Locus of the Gifted Teaching Theophany (مجلى التعليم الوهبي) concerning what He intended to bring into existence from His creation, without limit. The Intellect accepted, by its very essence (بذاته), the knowledge of what shall be, and the knowledge of the Divine Names (الأسماء الإلهية) belonging to The Real (الحق) that demand the emanation of this created world (العالم الخلقي). From this Intellect, He derived another existent, which He named the Tablet (اللوح). He commanded the Pen to descend to it and deposit within it everything that shall be until the Day of Resurrection, and nothing else. He made for this Pen three hundred and sixty teeth in its pen-ness (قلميته)—meaning, from its being a Pen and its being an Intellect, three hundred and sixty Theophanies (تجليا) or subtle realities (رقيقة). Each tooth or subtle reality draws from three hundred and sixty classes of Comprehensive Sciences (العلوم الإجمالية), which it then details upon the Tablet. This encompasses all the sciences in the world until the Day of Resurrection. The Tablet knew these sciences when the Pen deposited them within it. From this arose the Science of Nature (علم الطبيعة), which was the first knowledge obtained in this Tablet concerning the sciences of what Allah wills to create. Thus, Nature was below the Soul (النفس). All of this occurred in the World of Pure Light (عالم النور الخالص).\n\n### [The Throne and its Angelic Inhabitants]\n\nThen, the Glorified One brought into existence Pure Darkness (الظلمة المحضة), which stands opposite this Light, analogous to Absolute Non-existence (العدم المطلق) opposite Absolute Existence (الوجود المطلق). When He brought it into existence, He poured the Light upon it—an essential outpouring (إفاضة ذاتية) with the assistance of Nature (الطبيعة). That Light gathered its scattered parts, and the body expressed as the Throne (العرش) appeared. The Name, the All-Merciful (الرحمن), established Himself upon it by means of the Name, the Manifest (الظاهر). That was the first thing to appear from the world of creation. From that mixed Light, which is like the light of dawn (ضوء السحر), He created the angels surrounding the Seat (السرير), which is His saying: <<وَتَرَى الْمَلَائِكَةَ حَافِّينَ مِنْ حَوْلِ الْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ>> (And you will see the angels surrounding the Throne, glorifying the praises of their Lord). Their only occupation is to be surrounding the Throne, glorifying His praise. We have already explained the creation of the world in a book we named *‘Uqlat al-Mustawfiz* (The Knot of the Hastener), but in this chapter, we only take the main points.\n\n### [The Footstool and its Angelic Inhabitants]\n\nThen, He brought the Footstool (الكرسي) into existence within the cavity (جوف) of this Throne, and placed within it angels of the same genus as its nature. Every sphere (فلك) is the origin for what is created within it from its inhabitants, just as the elements are the origin for what is created from their inhabitants—as Adam was created from dust and populated the earth with himself and his descendants. In this Noble Footstool, He divided the Word (الكلمة) into Information (خبر) and Judgment (حكم). These are the Two Feet (القدمان) that descended to it from the Throne, as mentioned in the Prophetic narration. Then, within the cavity of the Footstool, He created the Spheres, one sphere within another. In every sphere, He created a world of its own, which they inhabit, and He named them angels, meaning messengers (رسلا). He adorned them with stars and <<وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (He revealed in every heaven its command), until He created the Forms of the Generated Things (صور المولدات).\n\n### [Spirits and Luminous, Imaginative, and Elemental Forms]\n\nWhen Allah completed these luminous and elemental Forms (الصور النورية والعنصرية) without Spirits (أرواح) to serve as a hidden reality (غيبا) for these Forms, He disclosed Himself (تجلى) to each class of Forms according to its nature. From the Forms and from this Theophany arose the Spirits of the Forms, which is the Second Issue (المسألة الثانية). He created the Spirits and commanded them to govern the Forms (تدبير الصور). He made them indivisible (غير منقسمة), but rather a single Essence (ذاتا واحدة), and distinguished some from others. They became distinguished, and their distinction was based on the Forms' acceptance of that Theophany. The Forms are not, in reality, locations (أينيات) for these Spirits, except that these Forms are like the Dominion (الملك) for the elemental Forms, and like the Manifestations (المظاهر) for all Forms. Then, Allah brought into existence the Imaginative Bodily Forms (الصور الجسدية الخيالية) through another Theophany between the subtleties (اللطائف) and the Forms. In these bodily Forms, the luminous and fiery Forms manifest, visible to the eye. And the sensory Forms manifest, carrying the spiritual meanings (المعنوية), in these bodily Forms during sleep, after death, and before the Resurrection—this is the Formal Isthmus (البرزخ الصوري). It is a horn of light, wide at the top and narrow at the bottom, for its top is the Solid Earth (الصماء) and its bottom is the earth. These are the formal bodies (الأجساد الصورية) in which the Jinn and the angels appear, and the inner reality of man, and they are the forms that appear in sleep, and the forms of the market of Paradise. These are the forms that inhabit the earth, which were previously discussed in their respective chapter.\n\n### [Sustenance of the Spirits and Sustenance of the Forms]\n\nThen, Allah, the Exalted, appointed Sustenance (غذاء) for these Forms and these Spirits, which is the Third Issue (المسألة الثالثة). Through this sustenance, their subsistence (بقاؤهم) is maintained. It is a sensory and non-sensory provision (رزق حسي ومعنوي). The non-sensory provision includes the sustenance of sciences, Theophanies (التجليات), and spiritual states (الأحوال). The sensory sustenance is well-known, being the spiritual meanings (المعاني الروحانية)—meaning the faculties (القوى)—carried by the forms of foods and drinks. That is the true sustenance. Thus, all sustenance is non-sensory (معنوي), as we have stated, even if it appears in sensory forms. Every form, whether luminous, animal, or bodily, is nourished by what suits it, and the detailing of this would be lengthy.\n\n### [The Ranks of the World in Felicity and Wretchedness]\n\nThen, Allah established for every world a Rank (مرتبة) in Felicity (السعادة) and Wretchedness (الشقاء), and a station, the details of which are innumerable. Their felicity is according to their nature. Among them is purposive felicity (سعادة غرضية), perfectional felicity (سعادة كمالية), congenial felicity (سعادة ملائمة), and conventional—meaning legal—felicity (سعادة وضعية). Wretchedness is similarly divided: that which does not conform to the purpose, nor to perfection, nor to temperament (which is the uncongenial), nor to the Law. All of this is sensory and intelligible. The sensory part relates to the Abode of Wretchedness (دار الشقاء) in terms of pains (الآلام) in this world and the Hereafter, and relates to the Abode of Felicity (دار السعادة) in terms of pleasures (اللذات) in this world and the Hereafter. This is divided into pure (خالص) and mixed (ممتزج). The pure relates to the Hereafter, and the mixed relates to this world, where the felicitous appears in the form of the wretched, and the wretched in the form of the felicitous. In the Hereafter, they will be distinguished. The wretched may appear in this world in his wretchedness and connect with the wretchedness of the Hereafter, and likewise the felicitous, but they remain unknown [to others]. In the Hereafter, they will be distinguished: <<وَامْتَازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ>> (And be distinguished today, O you criminals!). There, the Ranks will adhere to their people with an adherence that is neither broken nor changed.\n\n### [The Bearers of the Throne in This World and the Hereafter]\n\nThe meaning of the eight (الثمانية), which is the totality of the Dominion (مجموع الملك) expressed as the Throne (العرش), has now become clear to you. This is the Fourth Issue (المسألة الرابعة). The meaning of the eight has become clear to you. These eight correspond to the Eight Relations (النسب الثمانية) by which The Real (الحق) is described: Life, Knowledge (العلم), Power (القدرة), Will (الإرادة), Speech (الكلام), Hearing (السمع), Sight (البصر), and the perception of the eaten, the smelled, and the touched, with the Attribute appropriate to it. For this perception has a relation (تعلقا) to them, just as the perception of hearing relates to the heard, and sight relates to the seen. For this reason, the Dominion is confined to eight. Those that are manifest in this world are four: Form, Sustenance, and the two Ranks. On the Day of Resurrection, all eight will appear to the eye, which is His saying, the Exalted: <<وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمَانِيَةٌ>> (And eight will bear the Throne of your Lord above them on that Day).\n\nThe Prophet, peace and blessings be upon him, said, \"And today they are four.\"\n\nThis is the interpretation of the Throne as Dominion (الملك). As for the Throne which is the Seat (السرير), Allah has angels who carry it upon their shoulders. Today they are four, and tomorrow they will be eight, for the purpose of carrying it to the Land of Gathering (أرض الحشر). A description of the forms of these four bearers has been narrated, which approximates the saying of Ibn Masarra. It is said that the first is in the form of a Human, the second in the form of a Lion, the third in the form of an Eagle, and the fourth in the form of a Bull. It was this [Bull] that the Sāmirī saw, and he imagined it to be the god of Moses, so he fashioned the calf for his people and said, <<هَذَا إِلَهُكُمْ وَإِلَهُ مُوسَى>> (This is your god and the god of Moses)—the story. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "«باب تیرہواں: حاملانِ عرش کی معرفت میں»\n\nعرش، اللہ کی قسم، رحمن کے ذریعے اٹھایا گیا ہے، اور اس کے اٹھانے والے ہیں، اور یہ بات معقول ہے۔\nمخلوق میں کیا طاقت اور قدرت ہو سکتی ہے؟ اگر وہ (اللہ) نہ ہوتا تو عقل اور تنزیل (وحی) اسے لے کر نہ آتے۔\nجسم، روح، غذائیں اور مرتبہ— وہاں اس تفصیل کے سوا کچھ نہیں جو ترتیب دی گئی ہے۔\nپس یہ ہی عرش ہے اگر تم اس کی صورت کو حقیقت سے جانو، اور رحمن کے نام سے مستوی (مأمول) ہے۔\nاور وہ آٹھ ہیں، اور اللہ انہیں جانتا ہے، اور آج (دنیا میں) چار ہیں، اس میں کوئی توجیہ نہیں۔\nمحمد، پھر رضوان اور مالک، اور آدم اور خلیل (ابراہیم)، پھر جبرائیل۔\nاور الحق (ذات حق) میکائیل اور اسرافیل کے ساتھ ہے، یہاں ان آٹھ روشن اور شاندار ہستیوں کے سوا کوئی نہیں۔\n\n[عربی زبان میں عرش]\n\nجان لو، اللہ تمہارے قریبی دوست کی مدد کرے، کہ عربی زبان میں عرش کا اطلاق بادشاہت (الملک) پر ہوتا ہے، کہا جاتا ہے: \"بادشاہ کا عرش ڈگمگا گیا\" جب اس کی بادشاہت میں کوئی خلل آ جائے۔ اور اس کا اطلاق تخت (السرير) پر بھی ہوتا ہے۔ پس اگر عرش سے مراد بادشاہت ہو تو اس کے حاملین وہ ہوں گے جو اسے قائم رکھتے ہیں، اور اگر عرش سے مراد تخت ہو تو اس کے حاملین وہ ہوں گے جو اس کے پایوں پر قائم ہوں یا وہ جو اسے اپنے کندھوں پر اٹھاتے ہیں۔ اور یہ عدد حاملانِ عرش (حملة العرش) میں داخل ہے، اور رسول (صلی اللہ علیہ وسلم) نے دنیا میں ان کا حکم چار اور قیامت میں آٹھ مقرر فرمایا ہے۔\n\nپھر رسول اللہ صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی: \"اور اس دن آپ کے رب کا عرش ان کے اوپر آٹھ (فرشتے) اٹھائے ہوئے ہوں گے\" (وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمانِيَةٌ)۔ پھر فرمایا: \"اور وہ آج چار ہیں\" یعنی دنیا کے دن میں۔ اور آپ کا قول \"اس دن آٹھ\" (يَوْمَئِذٍ ثَمانِيَةٌ) سے مراد یومِ آخرت ہے۔\n\n[عرش جسم، روح، غذا اور مرتبہ میں محصور ہے]\n\nہم نے ابن مسرہ الجبلی سے روایت کیا ہے، جو اہلِ طریق (اہل الطريق) میں علم، حال اور کشف (الکشف) کے اعتبار سے سب سے بڑے تھے، کہ عرشِ محمول سے مراد بادشاہت (الملک) ہے، اور یہ جسم، روح، غذا اور مرتبہ میں محصور ہے۔ پس آدم اور اسرافیل صورتوں کے لیے ہیں، جبرائیل اور محمد (صلی اللہ علیہ وسلم) ارواح کے لیے ہیں، میکائیل اور ابراہیم رزقوں کے لیے ہیں، اور مالک اور رضوان وعدہ اور وعید کے لیے ہیں۔ اور بادشاہت میں اس کے سوا کچھ نہیں جو ذکر کیا گیا۔ اور غذائیں جو کہ رزق ہیں، حسی (حسّی) اور معنوی (معنوی) ہیں۔ پس اس باب میں ہم صرف ایک ہی طریقہ ذکر کریں گے جو بادشاہت کے معنی میں ہے، کیونکہ اس کا تعلق طریق (تصوف) میں فائدے سے ہے۔ اور اس کے حاملین (حملتہ) سے مراد وہ ہیں جو اس کے تدبیر کو قائم رکھتے ہیں۔ پس غور کرو: ایک عنصری صورت، یا ایک نوری صورت، اور عنصری صورت کی تدبیر کرنے والی روح، اور نوری صورت کی تدبیر کرنے والی مسخر روح، اور عنصری صورت کے لیے غذا، اور ارواح کے لیے علوم و معارف کی غذا، اور جنت میں داخلے کی سعادت سے متعلق ایک حسی مرتبہ، اور جہنم میں داخلے کی شقاوت سے متعلق ایک حسی مرتبہ، اور ایک روحانی علمی مرتبہ۔ پس اس باب کی بنیاد چار مسائل پر ہے: پہلی مسئلہ صورت، دوسری مسئلہ روح، تیسری مسئلہ غذا، اور چوتھی مسئلہ مرتبہ جو کہ غایت (مقصد) ہے۔ اور ان میں سے ہر مسئلہ دو حصوں میں تقسیم ہوتا ہے، پس وہ آٹھ بن جاتے ہیں، اور یہی بادشاہت کے عرش کے حاملین ہیں۔ یعنی جب یہ آٹھ ظاہر ہوتے ہیں تو بادشاہت قائم ہو جاتی ہے، ظاہر ہو جاتی ہے، اور اس کا مالک اس پر مستوی ہو جاتا ہے۔\n\n[نوری اجسام اور کروبی فرشتے]\n\nپہلی مسئلہ صورت ہے، اور یہ دو حصوں میں تقسیم ہوتی ہے: ایک عنصری جسمانی صورت (صورة جسمية عنصرية) جو خیالی جسمانی صورت (صورة جسدية خيالية) کو شامل کرتی ہے، اور دوسرا حصہ نوری جسمانی صورت (صورة جسمية نورية) ہے۔ پس ہم نوری جسم سے آغاز کرتے ہیں اور کہتے ہیں کہ اللہ نے سب سے پہلے جو جسم خلق کیا وہ ان ملکی ارواح کے اجسام تھے جو اللہ کے جلال میں محو (مہیمہ) ہیں۔ اور ان میں عقلِ اول (العقل الأول) اور نفسِ کل (النفس الکل) شامل ہیں۔ اور نوری اجسام جو نورِ جلال سے خلق کیے گئے ہیں، ان کا اختتام یہیں ہوتا ہے۔ اور ان فرشتوں میں کوئی فرشتہ ایسا نہیں جو کسی دوسرے کے واسطے سے وجود میں آیا ہو، سوائے نفس کے جو عقل سے نیچے ہے۔ اور ہر وہ فرشتہ جو ان کے بعد خلق ہوا، وہ طبیعت (الطبيعة) کے حکم کے تحت داخل ہے، پس وہ ان افلاک کی جنس سے ہیں جن سے وہ خلق کیے گئے ہیں، اور وہ ان کے آباد کرنے والے ہیں۔ اور اسی طرح عناصر کے فرشتے بھی ہیں۔ اور فرشتوں کی آخری قسم وہ فرشتے ہیں جو بندوں کے اعمال اور ان کے سانسوں سے خلق کیے گئے ہیں۔ ہم ان شاء اللہ اس باب میں ان کا ذکر صنف بہ صنف کریں گے۔ جان لو کہ اللہ تعالیٰ مخلوق کو خلق کرنے سے پہلے تھا، اور یہ کوئی زمانی قبلّیت نہیں ہے، بلکہ یہ ایک تعبیری کلمہ ہے جو ایک نسبت پر دلالت کرتا ہے جس سے سننے والے کے دل میں مقصود حاصل ہو جائے۔ وہ جل و تعالیٰ ایک عماء (گہرے بادل) میں تھا، جس کے نیچے ہوا تھی اور نہ اوپر ہوا تھی۔ اور یہ پہلا الٰہی مظہر (مظهر إلهي) ہے جس میں نورِ ذاتی سرایت کر گیا، جیسا کہ اس کے قول میں ظاہر ہوا: \"اللہ آسمانوں اور زمین کا نور ہے\" (اللَّهُ نُورُ السَّماواتِ والْأَرْضِ)۔ پس جب وہ عماء اس نور سے رنگین ہو گیا، تو اس میں محو فرشتوں (الملائكة المهيمين) کی صورتیں کھل گئیں، جو عالمِ اجسامِ طبیعیہ سے اوپر ہیں۔ اور نہ کوئی عرش تھا اور نہ کوئی مخلوق جو ان سے پہلے ہو۔ پس جب اللہ نے انہیں وجود بخشا، تو ان پر ظہور الٰہی (التجلی) فرمایا، اور اس ظہور الٰہی (التجلی) سے ان کے لیے ایک غیب پیدا ہوا، اور وہ غیب ان صورتوں کے لیے روح بن گیا۔ اور اللہ نے ان پر اپنے اسمِ جمیل میں ظہور الٰہی (التجلی) فرمایا، پس وہ اس کے جمال کے جلال میں محو ہو گئے، اور وہ ہوش میں نہیں آتے۔\n\n[عقلِ اول عالمِ تدوین و تسطیر کا قطب]\n\nپس جب اللہ نے عالمِ تدوین و تسطیر (لکھنے اور ریکارڈ کرنے کا عالم) کو خلق کرنے کا ارادہ فرمایا، تو اس نے ان کروبی فرشتوں میں سے ایک کو متعین کیا، اور وہ اس نور کے فرشتوں میں سے سب سے پہلا فرشتہ تھا جو ظاہر ہوا، اس کا نام عقل (العقل) اور قلم (القلم) رکھا۔ اور اس پر عطائی تعلیم (التعليم الوهبي) کے مظہر میں ظہور الٰہی (التجلی) فرمایا، اس مخلوق کے ساتھ جسے وہ وجود میں لانا چاہتا تھا، بغیر کسی حد اور غایت کے۔ پس اس (عقل) نے اپنی ذات کے ذریعے اس علم کو قبول کیا کہ کیا ہو گا، اور ذات حق (الحق) کے لیے کون سے الٰہی اسماء ہیں جو اس خلق شدہ عالم کے صدور کا تقاضا کرتے ہیں۔ پس اس عقل سے ایک اور موجود کو مشتق کیا، جس کا نام لوح (اللوح) رکھا، اور قلم کو حکم دیا کہ وہ اس کی طرف جھکے اور اس میں وہ سب کچھ ودیعت کر دے جو قیامت تک ہونے والا ہے، اور بس۔ اور اس قلم کے لیے اس کی قلمیت میں تین سو ساٹھ دانت (سن) مقرر کیے، یعنی اس کے قلم ہونے اور اس کے عقل ہونے کی حیثیت سے تین سو ساٹھ ظہور الٰہی (التجلی) یا لطافتیں (رقيقة) ہیں۔ ہر دانت یا لطافت تین سو ساٹھ اقسام کے اجمالی علوم سے چن کر لوح میں تفصیل سے بیان کرتی ہے۔ پس یہ قیامت تک دنیا میں موجود تمام علوم کا احاطہ ہے۔ پس لوح نے ان علوم کو جان لیا جب قلم نے انہیں اس میں ودیعت کیا۔ اور ان میں سے علمِ طبیعت (علم الطبيعة) تھا، اور یہ پہلا علم تھا جو اس لوح میں ان علوم میں سے حاصل ہوا جنہیں اللہ خلق کرنا چاہتا تھا۔ پس طبیعت نفس سے نیچے تھی، اور یہ سب خالص نور کے عالم میں تھا۔\n\n[عرش اور اس کے آباد کرنے والے فرشتے]\n\nپھر اس (اللہ) سبحانہ نے ظلمتِ محضہ (خالص تاریکی) کو وجود بخشا، جو اس نور کے مقابلے میں عدمِ مطلق (العدم المطلق) کے مقابلے میں وجودِ مطلق (الوجود المطلق) کے درجے پر ہے۔ پس جب اس نے اسے وجود بخشا، تو طبیعت کی مدد سے اس پر نور کا ذاتی فیضان فرمایا۔ پس اس نور نے اس کی پراگندگی کو جمع کیا، تو وہ جسم ظاہر ہوا جسے عرش سے تعبیر کیا جاتا ہے۔ پس اسمِ رحمن (الرحمن) اسمِ ظاہر (الظاہر) کے ذریعے اس پر مستوی ہوا۔ پس یہ عالمِ خلق میں سب سے پہلی چیز تھی جو ظاہر ہوئی۔ اور اس مخلوط نور سے، جو سحر کے وقت کی روشنی کی مانند ہے، اس نے تخت کے گرد گھیرا ڈالنے والے فرشتے خلق کیے، اور یہ اس کا قول ہے: \"اور تم فرشتوں کو دیکھو گے کہ وہ عرش کے ارد گرد گھیرا ڈالے ہوئے اپنے رب کی حمد کے ساتھ تسبیح کر رہے ہوں گے\" (وَتَرَى الْمَلائِكَةَ حَافِّينَ مِنْ حَوْلِ الْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ)۔ پس ان کا کام صرف یہ ہے کہ وہ عرش کے گرد گھیرا ڈالے ہوئے اس کی حمد کے ساتھ تسبیح کرتے رہیں۔ اور ہم نے عالم کی تخلیق کو ایک کتاب میں بیان کیا ہے جسے ہم نے *عقلۃ المستوفز* کا نام دیا ہے، لیکن اس باب میں ہم صرف اہم نکات لیں گے۔\n\n[کرسی اور اس کے آباد کرنے والے فرشتے]\n\nپھر اس نے اس عرش کے اندر کرسی (الکرسی) کو وجود بخشا اور اس میں اس کی طبیعت کی جنس سے فرشتے مقرر کیے۔ پس ہر فلک ان چیزوں کے لیے اصل ہے جو اس میں آبادکاری کے لیے خلق کی گئیں، جیسے عناصر ان چیزوں کے لیے اصل ہیں جو ان سے خلق کی گئیں، جیسا کہ آدم کو مٹی سے خلق کیا گیا اور اس کے ذریعے اور اس کی اولاد کے ذریعے زمین کو آباد کیا گیا۔ اور اس کرسیِ کریم میں کلمہ کو خبر اور حکم میں تقسیم کیا، اور یہ وہ دو قدم ہیں جو عرش سے اس کے لیے لٹکائے گئے، جیسا کہ حدیث نبوی میں وارد ہے۔ پھر کرسی کے اندر افلاک کو خلق کیا، ایک فلک کے اندر دوسرا فلک، اور ہر فلک میں اس سے ایک عالم خلق کیا جو اسے آباد کرتے ہیں، انہیں فرشتے یعنی رسول کہا۔ اور انہیں ستاروں سے مزین کیا، اور \"ہر آسمان میں اس کا حکم وحی کیا\" (وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا) یہاں تک کہ مولدات (پیدا ہونے والی چیزوں) کی صورتیں خلق کیں۔\n\n[ارواح اور نوری، خیالی اور عنصری صورتیں]\n\nاور جب اللہ نے ان نوری اور عنصری صورتوں کو ارواح کے بغیر مکمل کر لیا جو ان صورتوں کے لیے غیب بنیں، تو ہر صنف کی صورتوں پر ان کی حیثیت کے مطابق ظہور الٰہی (التجلی) فرمایا۔ پس ان صورتوں اور اس ظہور الٰہی (التجلی) سے صورتوں کی ارواح وجود میں آئیں، اور یہ دوسری مسئلہ ہے۔ پس اس نے ارواح کو خلق کیا اور انہیں صورتوں کی تدبیر کا حکم دیا، اور انہیں غیر منقسم، بلکہ ایک ہی ذات بنایا، اور بعض کو بعض سے ممتاز کیا، پس وہ ممتاز ہو گئیں۔ اور ان کا امتیاز اس ظہور الٰہی (التجلی) سے صورتوں کے قبول کرنے کی صلاحیت کے مطابق تھا۔ اور یہ صورتیں حقیقت میں ان ارواح کے لیے کوئی \"جگہیں\" (أينيات) نہیں ہیں، سوائے اس کے کہ یہ صورتیں ان کے لیے عنصری صورتوں کے حق میں بادشاہت (الملک) کی طرح ہیں، اور تمام صورتوں کے حق میں مظاہر کی طرح ہیں۔ پھر اللہ نے لطائف اور صورتوں کے درمیان ایک اور ظہور الٰہی (التجلی) کے ذریعے خیالی جسمانی صورتوں (الصور الجسدية الخيالية) کو پیدا کیا، جن جسمانی صورتوں میں نوری اور ناری صورتیں آنکھوں کے لیے ظاہر ہوتی ہیں، اور حسی صورتیں ان جسمانی صورتوں میں معنوی صورتوں کو اٹھائے ہوئے ظاہر ہوتی ہیں، نیند میں، موت کے بعد اور بعث سے پہلے، اور یہی برزخِ صوری (البرزخ الصوري) ہے۔ اور یہ نور کا ایک سینگ (قرن) ہے جس کا بالائی حصہ وسیع اور نچلا حصہ تنگ ہے، کیونکہ اس کا بالائی حصہ صماء (آسمان) ہے اور نچلا حصہ زمین ہے۔ اور یہ صوری اجسام (الأجساد الصورية) ہیں جن میں جنات، فرشتے اور انسان کا باطن ظاہر ہوتا ہے، اور یہ وہی ہیں جو نیند میں ظاہر ہوتے ہیں، اور جنت کے بازار کی صورتیں بھی یہی ہیں، اور یہ وہی صورتیں ہیں جو زمین کو آباد کرتی ہیں جن کا ذکر ان کے باب میں پہلے گزر چکا ہے۔\n\n[ارواح کی غذا اور صورتوں کی غذا]\n\nپھر اللہ تعالیٰ نے ان صورتوں اور ان ارواح کے لیے غذا مقرر کی، اور یہ تیسری مسئلہ ہے، جس غذا کے ذریعے ان کا بقا (البقاء) ہوتا ہے۔ اور یہ رزق حسی (حسّی) اور معنوی (معنوی) ہے۔ پس معنوی غذا میں علوم، ظہورات الٰہیہ (التجلیات) اور احوال شامل ہیں، اور محسوس غذا معلوم ہے، اور وہ یہ ہے کہ کھانے پینے کی چیزوں کی صورتیں جو روحانی معانی، یعنی قوتوں کو اٹھائے ہوئے ہوتی ہیں، پس وہی غذا ہے۔ پس جیسا کہ ہم نے کہا، غذا تمام کی تمام معنوی ہے، اگرچہ وہ محسوس صورتوں میں ہو۔ پس ہر صورت، خواہ وہ نوری ہو یا حیوانی یا جسمانی، اس چیز سے غذا حاصل کرتی ہے جو اس کے مناسب ہو۔ اور اس کی تفصیل طویل ہے۔\n\n[سعادت اور شقاوت میں عالم کے مراتب]\n\nپھر اللہ نے ہر عالم کے لیے سعادت اور شقاوت میں ایک مرتبہ اور منزلت مقرر کی، اور اس کی تفصیلات بے شمار ہیں۔ پس ان کی سعادت ان کی حیثیت کے مطابق ہے۔ ان میں سے غرضی سعادت ہے، کمالی سعادت ہے، ملائمتی سعادت ہے، اور وضعی یعنی شرعی سعادت ہے۔ اور شقاوت بھی اسی طرح تقسیم ہوتی ہے، اس چیز کے ساتھ جو نہ غرض کے موافق ہو، نہ کمال کے، نہ مزاج کے، اور وہ غیر ملائم ہو، اور نہ شرع کے۔ اور یہ سب محسوس اور معقول ہے۔ پس محسوس شقاوت وہ ہے جو دنیا اور آخرت میں دارِ شقاوت کے دکھوں سے متعلق ہے، اور دارِ سعادت کی لذتوں سے متعلق ہے جو دنیا اور آخرت میں ہیں۔ اور ان میں سے خالص اور مخلوط ہیں۔ پس خالص کا تعلق دارِ آخرت سے ہے، اور مخلوط کا تعلق دارِ دنیا سے ہے۔ پس سعید شقی کی صورت میں ظاہر ہوتا ہے اور شقی سعید کی صورت میں، اور آخرت میں وہ ممتاز ہو جائیں گے۔ اور کبھی شقی دنیا میں اپنی شقاوت کے ساتھ ظاہر ہوتا ہے اور آخرت کی شقاوت سے جڑ جاتا ہے، اور اسی طرح سعید بھی، لیکن وہ نامعلوم ہوتے ہیں۔ اور آخرت میں وہ ممتاز ہو جائیں گے: \"اور اے مجرمو! آج تم الگ ہو جاؤ\" (امْتازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ)۔ پس وہاں مراتب اپنے اہل سے اس طرح مل جائیں گے کہ نہ ٹوٹیں گے اور نہ بدلیں گے۔\n\n[دنیا اور آخرت میں حاملانِ عرش]\n\nپس تمہارے لیے آٹھ کا معنی واضح ہو گیا جو کہ بادشاہت (الملک) کا مجموعہ ہے جسے عرش سے تعبیر کیا جاتا ہے، اور یہ چوتھی مسئلہ ہے۔ پس تمہارے لیے آٹھ کا معنی واضح ہو گیا۔ اور یہ آٹھ ان آٹھ نسبتوں کے لیے ہیں جن سے ذات حق (الحق) کو متصف کیا جاتا ہے، اور وہ ہیں: حیات، علم، قدرت، ارادہ، کلام، سمع، بصر، اور مطعوم (کھائی جانے والی چیز)، مشموم (سونگھی جانے والی چیز) اور ملموس (چھوئی جانے والی چیز) کا اس صفت کے ساتھ ادراک جو اس کے لائق ہے۔ کیونکہ اس ادراک کا ان سے تعلق ہے، جیسے سمع کا مسموعات سے اور بصر کا مبصرات سے ادراک۔ اور اسی لیے بادشاہت آٹھ میں محصور ہو گئی ہے۔ پس دنیا میں ان میں سے چار ظاہر ہیں: صورت، غذا، اور دو مراتب۔ اور قیامت کے دن یہ آٹھوں مکمل طور پر عیاں ہو جائیں گے، اور یہ اللہ تعالیٰ کا قول ہے: \"اور اس دن آپ کے رب کا عرش ان کے اوپر آٹھ (فرشتے) اٹھائے ہوئے ہوں گے\" (وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمانِيَةٌ)۔\nپس نبی صلی اللہ علیہ وسلم نے فرمایا: \"اور وہ آج چار ہیں\"۔\nیہ عرش کی بادشاہت (الملک) سے تفسیر کے بارے میں ہے۔ اور جہاں تک عرش کا تعلق تخت (السرير) سے ہے، تو اللہ کے فرشتے ہیں جو اسے اپنے کندھوں پر اٹھاتے ہیں، وہ آج چار ہیں اور کل (قیامت میں) آٹھ ہوں گے، حشر کی زمین تک لے جانے کے لیے۔ اور ان چار حاملین کی صورتوں کے بارے میں وہ کچھ وارد ہوا ہے جو ابن مسرہ کے قول سے قریب ہے، پس کہا گیا ہے کہ ایک انسان کی صورت پر ہے، دوسرا شیر کی صورت پر، تیسرا عقاب کی صورت پر، اور چوتھا بیل کی صورت پر ہے۔ اور یہ وہی ہے جسے سامری نے دیکھا تھا، پس اس نے گمان کیا کہ یہ موسیٰ کا معبود ہے، تو اس نے اپنی قوم کے لیے بچھڑا بنایا اور کہا: \"یہ تمہارا معبود ہے اور موسیٰ کا معبود ہے\" (هذا إِلهُكُمْ وإِلهُ مُوسى‏)۔ (پورا قصہ)۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔ (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "«باب سیزدهم: در معرفت حاملان عرش»\n\nعرش، به حق (الحق) و به واسطه رحمان حمل شده است *** و حاملان آن، این سخن معقول است.\nکدام توان و قدرتی برای مخلوق است *** اگر او (حق) نباشد، که عقل و تنزیل (وحی) آن را آورده است؟\nجسم و روح و روزی‌ها (أقوات) و مرتبه (مرتبة) *** تفصیلی جز آنچه مرتب شده، نیست.\nپس این است عرش، اگر صورت آن را محقق سازی *** و مستوی (مستوی) به نام رحمان، مورد امید است.\nو آنان هشت نفرند و خداوند آنان را می‌داند *** و امروز چهار نفرند، در این هیچ تعلیلی نیست.\nمحمد، سپس رضوان و مالک (خازن دوزخ) آنان *** و آدم و خلیل (ابراهیم) و سپس جبرئیل.\nو حق (الحق) با میکائیل و اسرافیل، در اینجا نیست *** جز هشت نفر بزرگوار و شریف.\n\n[عرش در زبان عرب]\n\nبدان، خداوند ولیّ صمیمی را تأیید کند، که عرش در زبان عرب اطلاق می‌شود و منظور از آن مُلک (سلطنت) است. گفته می‌شود: «عرش پادشاه سست شد»؛ یعنی در مُلک او خللی وارد شد. و نیز اطلاق می‌شود و منظور از آن تخت است. پس اگر عرش عبارت از مُلک باشد، حاملان آن کسانی هستند که به تدبیر آن قیام می‌کنند؛ و اگر عرش همان تخت باشد، حاملان آن پایه‌هایی هستند که تخت بر آن‌ها استوار است، یا کسانی که آن را بر دوش خود حمل می‌کنند. و عدد در حاملان عرش داخل می‌شود. و رسول (صلی الله علیه و سلم) حکم آنان را در دنیا چهار و در قیامت هشت قرار داده است.\n\nپس رسول خدا (صلی الله علیه و سلم) این آیه را تلاوت فرمود: «و در آن روز، هشت نفر عرش پروردگارت را بر فراز آنان حمل می‌کنند» (وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمانِيَةٌ). سپس فرمود: «و آنان امروز چهار نفرند»؛ یعنی در روز دنیا. و سخن او که «در آن روز هشت نفر» یعنی روز آخرت است.\n\n[عرش محصور در جسم و روح و غذا و مرتبه]\n\nاز ابن مَسَرّه جَبَلی، که از بزرگترین اهل طریقت (الطريق) در علم و حال و کشف (الکشف) بود، روایت کرده‌ایم که عرش محمول همان مُلک (سلطنت) است و آن محصور در جسم و روح و غذا و مرتبه (مرتبة) است. پس آدم و اسرافیل برای صُوَر (اشکال) هستند، و جبرئیل و محمد برای ارواح، و میکائیل و ابراهیم برای روزی‌ها (الأرزاق)، و مالک و رضوان برای وعد و وعید. و در مُلک جز آنچه ذکر شد، نیست. و غذاهایی که همان روزی‌ها هستند، حسی و معنوی‌اند. آنچه ما در این باب ذکر می‌کنیم، همان طریقه واحدی است که به معنای مُلک است، به دلیل فایده‌ای که در سلوک (الطريق) به آن تعلق می‌گیرد. و حاملان آن عبارتند از کسانی که به تدبیر آن قیام می‌کنند. پس تدبیر کن: صورتی عنصری یا صورتی نوری، و روحی که مدبر صورت عنصری است، و روحی که مدبر و مسخر صورت نوری است، و غذایی برای صورت عنصری، و غذای علوم و معارف برای ارواح، و مرتبه‌ای حسی از سعادت به واسطه ورود به بهشت، و مرتبه‌ای حسی از شقاوت به واسطه ورود به جهنم، و مرتبه‌ای روحی علمی. پس بنای این باب بر چهار مسئله است: مسئله اول صورت، مسئله دوم روح، مسئله سوم غذا، و مسئله چهارم مرتبه که همان غایت است. و هر مسئله‌ای از این‌ها به دو بخش تقسیم می‌شود، پس هشت بخش می‌شوند، و آنان حاملان عرش مُلک هستند؛ یعنی هنگامی که این هشت مورد ظاهر شوند، مُلک برپا می‌شود و آشکار می‌گردد و مالک آن بر آن استیلا می‌یابد.\n\n[اجسام نوری و فرشتگان کروبی]\n\nمسئله اول صورت است، و آن به دو بخش تقسیم می‌شود: صورت جسمی عنصری که متضمن صورت جسدی خیالی است، و بخش دیگر صورت جسمی نوری. پس با جسم نوری آغاز می‌کنیم و می‌گوییم: اولین جسمی که خداوند خلق کرد، اجسام ارواح ملکی (ملائکه) بودند که در جلال خداوند حیران و واله (المهيمة) هستند. و از جمله آنان عقل اول (العقل الأول) و نفس کُل (النفس الكل) است. و اجسام نوری که از نور جلال آفریده شده‌اند، به این‌ها ختم می‌شوند. و هیچ فرشته‌ای از این فرشتگان نیست که به واسطه غیر خود موجود شده باشد، مگر نفسی که پایین‌تر از عقل است. و هر فرشته‌ای که پس از این‌ها خلق شده، تحت حکم طبیعت قرار دارد؛ پس آنان از جنس افلاکی هستند که از آن‌ها خلق شده‌اند و آبادکنندگان آن‌هایند. و همچنین فرشتگان عناصر. و آخرین صنف از فرشتگان، ملائکه‌ای هستند که از اعمال و انفاس بندگان خلق شده‌اند. ان‌شاءالله این‌ها را صنف به صنف در این باب ذکر خواهیم کرد. بدان که خداوند متعال پیش از آنکه خلق را بیافریند، وجود داشت، و این «پیش از» به معنای تقدم زمانی نیست، بلکه عبارتی برای رساندن است که بر نسبتی دلالت می‌کند تا مقصود در ذهن شنونده حاصل شود. او جلّ و تعالی در «عماء» (فضای ابری) بود که نه زیر آن هوا بود و نه بالای آن هوا. و آن اولین مظهر الهی است که نور ذاتی در آن جریان یافت، چنانکه در قول او ظاهر شد: «خداوند نور آسمان‌ها و زمین است» (اللَّهُ نُورُ السَّماواتِ وَالْأَرْضِ). پس هنگامی که آن عماء به نور رنگین شد، صور فرشتگان واله (المهيمين) در آن گشوده شد؛ آنان که فوق عالم اجسام طبیعی هستند و هیچ عرش و مخلوقی بر آنان تقدم نداشته است. هنگامی که آنان را ایجاد کرد، بر ایشان تجلی (التجلی) نمود. پس از آن تجلی، غیبی برای آنان حاصل شد، و آن غیب، روح برای آنان، یعنی برای آن صور، بود. و بر ایشان در اسم جمیل خود تجلی کرد، پس آنان در جلال جمال او واله شدند و به هوش نمی‌آیند.\n\n[عقل اول، قطب عالم تدوین و تسطیر]\n\nپس هنگامی که خواست عالم تدوین و تسطیر (نوشتن و ثبت) را خلق کند، یکی از این فرشتگان کروبی را تعیین کرد، و او اولین فرشته‌ای بود که از ملائکه آن نور ظاهر شد. او را عقل (العقل) و قلم نامید. و بر او در مَجلای تعلیم وهبی (بخششی) تجلی کرد، به آنچه می‌خواست از خلق خود ایجاد کند، بدون هیچ حد و غایتی. پس عقل به ذات خود، علم آنچه خواهد بود و آنچه حق (الحق) از اسماء الهی دارد که طالب صدور این عالم خلقی هستند، را پذیرفت. سپس از این عقل، موجود دیگری را مشتق کرد و آن را لوح (اللوح) نامید. و به قلم امر کرد که به سوی آن سرازیر شود و تمام آنچه تا روز قیامت خواهد بود را در آن به ودیعه نهد و بس. و برای این قلم، سیصد و شصت دندانه در قلمیتش قرار داد؛ یعنی از جهت قلم بودنش و از جهت عقل بودنش، سیصد و شصت تجلی (التجلی) یا رقیقه (لطیفه) دارد. هر دندانه یا رقیقه از سیصد و شصت صنف از علوم اجمالی بهره می‌گیرد و آن‌ها را در لوح تفصیل می‌دهد. پس این، حصر تمام علوم موجود در عالم تا روز قیامت است. لوح هنگامی که قلم آن علوم را در او به ودیعه نهاد، آن‌ها را دانست. و از جمله آن علوم، علم طبیعت بود، و آن اولین علمی بود که در این لوح از علوم آنچه خداوند می‌خواهد خلق کند، حاصل شد. پس طبیعت پایین‌تر از نفس بود، و این همه در عالم نور خالص است.\n\n[عرش و آبادکنندگان آن از فرشتگان]\n\nسپس سبحانه و تعالی ظلمت محض را ایجاد کرد که در مقابل این نور، به منزله عدم مطلق (العدم المطلق) در مقابل هستی مطلق (الوجود المطلق) است. پس هنگامی که آن را ایجاد کرد، نور را با کمک طبیعت، افاضه‌ای ذاتی بر آن ریخت. پس آن نور، پراکندگی ظلمت را جمع کرد و جسمی که از آن به عرش تعبیر می‌شود، ظاهر شد. پس اسم رحمان به واسطه اسم ظاهر بر آن استیلا یافت. این اولین چیزی است که از عالم خلق ظاهر شد. و از آن نور آمیخته که مانند روشنایی سحر است، فرشتگان حافّ (احاطه‌کننده) بر تخت را خلق کرد، و این همان قول اوست: «و فرشتگان را می‌بینی که گرداگرد عرش حلقه زده‌اند و پروردگارشان را با حمد تسبیح می‌گویند» (وَتَرَى الْمَلائِكَةَ حَافِّينَ مِنْ حَوْلِ الْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ). پس شغل آنان جز این نیست که گرداگرد عرش حلقه زده‌اند و او را با حمد تسبیح می‌گویند. ما خلقت عالم را در کتابی به نام «عُقلة المستوفز» بیان کرده‌ایم، و در این باب تنها رؤوس مطالب را از آن می‌آوریم.\n\n[کرسی و آبادکنندگان آن از فرشتگان]\n\nسپس کرسی (الکرسي) را در درون این عرش ایجاد کرد و در آن فرشتگانی از جنس طبیعت آن قرار داد. پس هر فلکی، اصلی است برای آنچه در آن از آبادانی خلق شده است، مانند عناصر در مورد آبادکنندگانشان که از آن‌ها خلق شده‌اند، چنانکه آدم از خاک خلق شد و زمین به واسطه او و فرزندانش آباد گردید. و در این کرسی کریم، کلمه را به خبر و حکم تقسیم کرد، و این دو همان دو قدمی هستند که از عرش برای کرسی آویخته شدند، چنانکه در خبر نبوی (الخبر النبوي) آمده است. سپس در درون کرسی، افلاک را خلق کرد، فلکی در درون فلک دیگر، و در هر فلکی عالمی از آن خلق کرد که آن را آباد می‌کنند و آنان را فرشتگان نامید؛ یعنی رسولان. و آن‌ها را با ستارگان زینت داد و «در هر آسمانی امر آن را وحی کرد» (وَأَوْحى فِي كُلِّ سَماءٍ أَمْرَها) تا آنکه صور موالید (موجودات متولد شونده) را خلق کرد.\n\n[ارواح و صور نوری، خیالی و عنصری]\n\nو هنگامی که خداوند این صور نوری و عنصری را بدون ارواحی که غیب این صور باشند، کامل کرد، بر هر صنفی از صور، به حسب آنچه هست، تجلی (التجلی) نمود. پس از صور و از این تجلی، ارواح صور پدید آمدند، و این مسئله دوم است. پس ارواح را خلق کرد و به آن‌ها امر کرد که صور را تدبیر کنند. و آن‌ها را غیر قابل تقسیم، بلکه ذاتی واحد قرار داد و برخی را از برخی دیگر متمایز ساخت، پس متمایز شدند. و تمایز آن‌ها به حسب پذیرش صور از آن تجلی بود. و صور در حقیقت، مکان (أینیت) این ارواح نیستند، جز اینکه این صور برای ارواح، مانند مُلک (سلطنت) هستند در حق صور عنصری، و مانند مظاهر هستند در حق همه صور. سپس خداوند صور جسدی خیالی را با تجلی دیگری بین لطایف و صور ایجاد کرد. در آن صور جسدی، صور نوری و ناری (آتشین) برای چشم ظاهر می‌شوند، و صور حسی که حامل صور معنوی هستند، در این صور جسدی در خواب و پس از مرگ و پیش از بعث (برزخ) تجلی می‌کنند. و آن برزخ صوری (البرزخ الصوري) است که شاخی از نور است که بالای آن وسیع و پایین آن تنگ است؛ زیرا بالای آن صمّاء (آسمان صمّاء) و پایین آن زمین است. و این اجساد صوری هستند که جن و فرشتگان و باطن انسان در آن‌ها ظاهر می‌شوند، و این‌ها همان‌هایی هستند که در خواب ظاهر می‌شوند، و صور بازار بهشت، و این‌ها همان صورند که زمین را آباد می‌کنند و سخن درباره آن‌ها در باب خود گذشت.\n\n[غذای ارواح و غذای صور]\n\nسپس خداوند متعال برای این صور و این ارواح، غذایی قرار داد، و آن مسئله سوم است. بقای آن‌ها به واسطه آن غذاست، و آن روزی حسی و معنوی است. بخش معنوی آن، غذای علوم و تجلیات (التجلیات) و احوال است. و غذای محسوس معلوم است، و آن چیزی است که صور خوردنی‌ها و نوشیدنی‌ها از معانی روحانی، یعنی قوا، حمل می‌کنند. پس آن، همان غذاست. بنابراین، تمام غذا معنوی است، چنانکه گفتیم، اگرچه در صور محسوس باشد. پس هر صورتی، چه نوری باشد، چه حیوانی یا جسدی، با آنچه مناسب آن است، تغذیه می‌شود، و تفصیل آن به درازا می‌کشد.\n\n[مراتب عالم در سعادت و شقاوت]\n\nسپس خداوند برای هر عالمی مرتبه‌ای در سعادت و شقاوت و منزلتی قرار داد که تفصیلات آن قابل حصر نیست. پس سعادت آن به حسب خود آن عالم است. از جمله آن‌ها سعادت غرضی، سعادت کمالی، سعادت ملایم، و سعادت وضعی (یعنی شرعی) است. و شقاوت نیز در تقسیم‌بندی مانند آن است، به آنچه که با غرض، کمال، مزاج (که همان غیر ملایم است) و شرع موافق نباشد. و این همه محسوس و معقول است. بخش محسوس آن، مربوط به دار شقاوت از آلام در دنیا و آخرت است، و مربوط به دار سعادت از لذات در دنیا و آخرت است. و از آن، خالص و آمیخته وجود دارد. خالص مربوط به سرای آخرت است و آمیخته مربوط به سرای دنیاست. پس سعید به صورت شقی و شقی به صورت سعید ظاهر می‌شود، و در آخرت از هم متمایز می‌گردند. و گاهی شقی در دنیا با شقاوت خود ظاهر می‌شود و به شقاوت آخرت متصل می‌گردد، و همچنین سعید. اما آنان ناشناخته‌اند و در آخرت از هم متمایز می‌شوند: «ای مجرمان، امروز جدا شوید» (امْتازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ). پس در آنجا مراتب به اهل خود می‌پیوندند، پیوستنی که گسسته و دگرگون نمی‌شود.\n\n[حاملان عرش در دنیا و آخرت]\n\nپس معنای هشت مورد که مجموع مُلک (الملك) است و از آن به عرش تعبیر می‌شود، برای تو آشکار شد. و این مسئله چهارم است. معنای هشت مورد برای تو آشکار شد. و این هشت مورد برای نسبت‌های هشت‌گانه‌ای است که حق (الحق) به آن‌ها وصف می‌شود، و آن‌ها عبارتند از: حیات، علم، قدرت، اراده، کلام، سمع، بصر، و ادراک خوردنی، بوییدنی و لمس‌شدنی با صفتی که شایسته اوست؛ زیرا این ادراک به آن‌ها تعلق دارد، مانند ادراک سمع به مسموعات و بصر به مبصرات. به همین دلیل مُلک در هشت مورد محصور شد. آنچه از این هشت مورد در دنیا ظاهر است، چهار مورد است: صورت، غذا، و دو مرتبه. و روز قیامت تمام هشت مورد برای دیدگان آشکار می‌شود، و این همان قول خداوند متعال است: «و در آن روز، هشت نفر عرش پروردگارت را بر فراز آنان حمل می‌کنند» (وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمانِيَةٌ). پس پیامبر (صلی الله علیه و سلم) فرمود: «و آنان امروز چهار نفرند.» این در تفسیر عرش به معنای مُلک بود. اما عرشی که همان تخت است، خداوند فرشتگانی دارد که آن را بر دوش خود حمل می‌کنند. آنان امروز چهار نفرند و فردا هشت نفر خواهند شد، به خاطر حمل آن به سوی سرزمین محشر. و در مورد صور این چهار حامل، آنچه نزدیک به قول ابن مسره است، وارد شده است. پس گفته شده است: یکی بر صورت انسان، دومی بر صورت شیر، سومی بر صورت عقاب (نسر)، و چهارمی بر صورت گاو نر (ثور) است. و این همان صورتی است که سامری آن را دید و گمان کرد که خدای موسی است، پس برای قومش گوساله ساخت و گفت: «این خدای شما و خدای موسی است» (هذا إِلهُكُمْ وَإِلهُ مُوسى‏) تا آخر داستان. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 3
}