{
  "id": 39,
  "title": {
    "ar": "الباب التاسع والثلاثون في معرفة المنزل الذي يحط إليه الولي إذا طرده الحق تعالى من جواره",
    "en": "Chapter Thirty-Nine: Concerning the knowledge of the Abode to which the Saint is cast down when the Real, Exalted is He, expels him from His Proximity.",
    "ur": "باب انتالیس (۳۹): اس منزل کی معرفت (المعرفۃ) کے بارے میں جس پر ولی (الولی) کو اتارا جاتا ہے جب ذات حق (الحق) اسے اپنی قربت سے نکال دیتا ہے۔",
    "fa": "باب سی و نهم در معرفت منزلی که ولی بدان فرود می‌آید، هنگامی که حق تعالی او را از جوار خود براند."
  },
  "content": {
    "ar": "## (الباب التاسع والثلاثون في معرفة المنزل الذي يحط إليه الولي إذا طرده الحق تعالى من جواره)\n\n\n> إذا حط الولي فليس إلا *** عروج وارتقاء في علو\n\n\n> فإن الحق لا تقييد فيه *** ففي عين النوى عين الدنو\n\n\n> فحال المجتبى في كل حال *** سمو في سمو في سمو\n\n\n> فلا حكم عليه بكل وجه *** ولا تأثير فيه للعلو\n\n\n### [التكليف، الخطيئة، العقوبة]\n\n\nاعلم أيدك الله بروح منه إن الله تعالى يقول لإبليس اسجد لآدم فظهر الأمر فيه وقال لآدم وحواء لا تَقْرَبا هذِهِ الشَّجَرَةَ فظهر النهي فيهما والتكليف مقسم بين أمر ونهي وهما محمولان على الوجوب حتى تخرجهما عن مقام الوجوب قرينة حال وإن كان مذهبنا فيهما التوقيف فتعين امتثال الأمر والنهي وهذا أول أمر ظهر في العالم الطبيعي وأول نهي وقد أعلمناك أن الخاطر الأول وأن جميع الأوليات لا تكون إلا ربانية ولهذا تصدق ولا تخطئ أبدا ويقطع به صاحبه فسلطانه قوي ولما كان هذا أول أمر ونهي لذلك وقعت العقوبة عند المخالفة ولم يمهل فإذا جاءت الأوامر بالوسائط لم تقو قوة الأول وهي الأوامر الواردة إلينا على ألسنة الرسل وهي على قسمين إما ثوان وهو ما يلقي الله إلى نبيه في نفسه من غير واسطة الملك فيصل إلينا الأمر الإلهي وقد جاز على حضرة كونية فاكتسب منه حالة لم يكن عليها فإن الأسماء الإلهية تلقته في هذه الحضرة الكونية فشاركته بأحكامها في حكمه وإما أن ينزل عليه بذلك الأمر الملك فيكون الأمر الإلهي قد جاز على حضرتين من الكون جبريل وأي ملك كان وأي نبي كان فيكون فعله وأثره في القوة دون الأول والثاني فلذلك لم تقع المؤاخذة معجلة فأما إمهال إلى الآخرة وإما غفران فلا يؤاخذ بذلك أبدا وفعل الله ذلك رحمة بعباده كما أنه تعالى خص النهي بآدم وحواء والنهي ليس بتكليف عملي فإنه يتضمن أمرا عدميا وهو لا تفعل ومن حقيقة الممكن أنه لا يفعل فكأنه قيل له لا تفارق أصلك والأمر ليس كذلك فإنه يتضمن أمرا وجوديا وهو أن يفعل فكأنه قيل له أخرج عن أصلك فالأمر أشق على النفس من النهي إذ كلف الخروج عن أصله فلو أن إبليس لما عصى ولم يسجد لم يقل ما قال من التكبر والفضيلة التي نسبها إلى نفسه على غيره فخرج عن عبوديته بقدر ذلك فحلت به عقوبة الله وكانت العقوبة لآدم وحواء لما تكلفا الخروج عن أصلهما وهو الترك وهو أمر عدمي بالأكل وهو أمر وجودي فشرك الله بين إبليس وآدم وحواء في ضمير واحد وهو كان أشد العقوبة على آدم فقيل لهم اهبطوا بضمير الجماعة ولم يكن الهبوط عقوبة لآدم وحواء وإنما كان عقوبة لإبليس فإن آدم أهبط لصدق الوعد بأن يجعل في الأرض خليفة بعد ما تاب عليه واجتباه وتلقى الكلمات من ربه بالاعتراف فاعترافه عليه‏\nالسلام في مقابلة كلام إبليس أَنَا خَيْرٌ مِنْهُ فعرفنا الحق بمقام الاعتراف عند الله وما ينتجه من السعادة لنتخذه طريقا في مخالفتنا وعرفنا بدعوى إبليس ومقالته لنحذر من مثلها عند مخالفتنا وأهبطت حواء للتناسل وأهبط إبليس للاغواء فكان هبوط آدم وحواء هبوط كرامة وهبوط إبليس هبوط خذلان وعقوية واكتساب أو زار فإن معصيته كانت لا تقتضي تأبيد الشقاء فإنه لم يشرك بل افتخر بما خلقه الله عليه وكتبه شقيا ودار الشقاء مخصوصة بأهل الشرك فأنزله الله إلى الأرض ليسن الشرك بالوسوسة في قلوب العباد فإذا أشركوا وتبرأ إبليس من المشرك ومن الشرك لم ينفعه تبريه منه فإنه هو الذي قال له اكفر كما أخبر الله تعالى فحار عليه وزر كل مشرك في العالم وإن كان موحدا فإنه من سن سنة سيئة فعليه وزرها ووزر من عمل بها\n\n\n### [الشرك والتوحيد]\n\n\nفإن الشخص الطبيعي كإبليس وبنى آدم لا بد أن يتصور في نفسه مثال ما يريد أن يبرزه فما سن الشرك ووسوس به حتى تصوره في نفسه على الصورة التي إذا حصلت في نفس المشرك زالت عنه صورة التوحيد فإذا تصورها في نفسه بهذه الصورة فقد خرج التوحيد عن تصوره في نفسه ضرورة فإن الشريك متصور له في نفسه إلى جانب الحق الذي في نفسه متخيلا أعني من العلم بوجوده فما تركه في نفسه وحده فكان إبليس مشركا في نفسه بلا شك ولا ريب ولا بد أن يحفظ في نفسه بقاء صورة الشريك ليمد بها المشركين مع الأنفاس فإنه خائف منهم أن تزول عنهم صفة الشرك فيوحدوا الله فيسعدوا فلا يزال إبليس يحفظ صورة الشرك في نفسه ويراقب بها قلوب المشركين الكائنين في الوقت شرقا وغربا وجنوبا وشمالا ويرد بها الموحدين في المستقبل إلى الشرك ممن ليس بمشرك فلا ينفك إبليس دائما على الشرك فبذلك أشقاه الله لأنه لا يقدر أن يتصور التوحيد نفسا واحدا لملازمته هذه الصفة وحرصه على بقائها في نفس المشرك فإنها لو ذهبت من نفسه لم يجد المشرك من يحدثه في نفسه بالشرك فيذهب الشرك عنه ويكون إبليس لا يتصور الشريك لأنه قد زالت عن نفسه صورة الشريك فيكون لا يعلم أن ذلك المشرك قد زال عن إشراكه فدل إن الشريك يستصحب إبليس دائما فهو أول مشرك بالله وأول من سن الشرك وهو أشقى العالمين فلذلك يطمع في الرحمة من عين المنة ولهذا قلنا إن العقوبة في حق آدم إنما كانت في جمعه مع إبليس في الضمير حيث خاطبهم الحق بالهبوط بالكلام الذي يليق بجلاله ولكن لا بد أن يكون في الكلام الصفة التي يقتضيها لفظ الضمير فإن صورة اللفظ يطلب المعنى الخاص وهذه طريقة لم تجعل العلماء وبالها من ذلك‏\n\n\n### [خطيئة العارفين وخطيئة العامة]\n\n\nوإنما ذكرنا مسألة آدم تأنيسا لأهل الله تعالى إذا زالوا فحطوا عن مقامهم أن ذلك الانحطاط لا يقضي بشقائهم ولا بد بل يكون هبوطهم كهبوط آدم فإن الله لا يتحيز ولا يتقيد وإذا كان الأمر على هذا الحد وكان الله بهذه الصفة من عدم التقييد فيكون عين هبوط الولي عند الزلة وما قام به من الذلة والحياء والانكسار فيها عين الترقي إلى أعلى مما كان فيه لأن علوه بالمعرفة والحال وقد يزيد من العلم بالله ما لم يكن عنده ومن الحال وهو الذلة والانكسار ما لم يكن عليهما وهذا هو عين الترقي إلى مقام أشرف فإذا فقد الإنسان هذه الحالة في زلته ولم يندم ولا انكسر ولا ذل ولا خاف مقام ربه فليس من أهل هذه الطريقة بل ذلك جليس إبليس بل إبليس أحسن حالا منه لأنه يقول لمن يطيعه في الكفر إِنِّي بَرِي‏ءٌ مِنْكَ إِنِّي أَخافُ الله رَبَّ الْعالَمِينَ ونحن إنما نتكلم على زلات أهل الله إذا وقعت منهم قال تعالى ولَمْ يُصِرُّوا عَلى‏ ما فَعَلُوا وقال رسول الله صلى الله عليه وسلم الندم توبة\n\n\nوإنما الإنسان الولي إذا كان في المقام الذي كان والحال التي كان عليها ملتذا بها فلذته إنما كانت بحاله فإن الله يتعالى أن يلتذ به فلما زل وعرته حالة الذلة والانكسار زالت ضرورة الحالة التي كان يلتذ بوجودها وهي حالة الطاعة والموافقة فلما فقدها نخيل أنه انحط من عين الله وإنما تلك الحالة لما زالت عنه انحط عنها إذ كانت حالة تقتضي الرفعة وهو الآن في معراج الذلة والندم والافتقار والانكسار والاعتراف والأدب مع الله تعالى والحياء منه فهو يترقى في هذا المعراج فيجد هذا العبد في غاية هذا المعراج حالة أشرف من الحالة التي كان عليها فعند ذلك يعلم أنه ما انحط وأته ترقي من حيث لا يشعر أنه في ترق وأخفى الله ذلك عن أوليائه لئلا يجترءوا عليه في المخالفات كما أخفى الاستدراج فيمن أشقاه الله فقال سَنَسْتَدْرِجُهُمْ من حَيْثُ لا يَعْلَمُونَ فهم كما قال الله تعالى فيهم وهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعاً كذلك أخفى سبحانه تقريبه وعنايته فيمن‏\nأسعده الله بما شغله الله به من البكاء على ذنبه ومشاهدته زلته ونظره إليها في كتابه وذهل عن إن ذلك الندم يعطيه الترقي عند الله فإنه ما بشره بقبول التوبة فهو متحقق وقوع الزلة حاكم عليه الانكسار والحياء مما وقع فيه وإن لم يؤاخذه الله بذلك الذنب فكان الاستدراج حاصلا في الخير والشر وفي السعداء والأشقياء ولقيت بمدينة فاس رجلا عليه كآبة كأنه يخدم في الأتون فسألت أبا العباس الحصار وكان من كبار الشيوخ عنه فإني رأيته يجالسه ويحن إليه فقال لي هذا رجل كان في مقام فانحط عنه فكان في هذا المقام وكان من الحياء والانكسار بحالة وجبت عليه السكوت عن كلام الخلق فما زلت ألاطفه بمثل هذه الأدوية وأزيل عنه مرض تلك الزلة بمثل هذا العلاج وكان قد مكنني من نفسه فلم أزل به حتى سرى ذلك الدواء في أعضائه فأطلق محياه وفتح له في عين قلبه باب إلى قبوله ومع هذا فكان الحياء يستلزمه وكذلك ينبغي أن تكون زلات الأكابر غالبا نزولهم إلى المباحات لا غير وفي حكم النادر تقع منهم الكبائر قيل لأبي يزيد البسطامي رضي الله عنه أ يعصي العارف فقال وكانَ أَمْرُ الله قَدَراً مَقْدُوراً يريد أن معصيتهم بحكم القدر النافذ فيهم لا أنهم يقصدون انتهاك حرمات الله هم بحمد الله إذا كانوا أولياء عند الله تعالى وجل معصومون في هذا المقام فلا تصدر منهم معصية أصلا انتهاكا لحرمة الله كمعاصي الغير فإن الايمان المكتوب في القلوب يمنع من ذلك فمنهم من يعصي غفلة ومنهم من يخالف على حضور عن كشف إلهي قد عرفه الله فيه ما قدره عليه قبل وقوعه فهو على بصيرة من أمره وبينة من ربه وهذه الحالة بمنزلة البشرى في قوله لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ فقد أعلمه بالذنوب الواقعة المغفورة فلا حكم لها ولا لسلطانها فيه فإنه إذا جاء وقت ظهورها يكون في صحبتها الاسم الغفار فتنزل بالعبد ويحجب الغفار حكمها فتكون بمنزلة من يلقي في النار ولا يحترق كإبراهيم عليه السلام فكان في النار ولا حكم لها فيه بالحجاب الذي هو المانع كذلك زلة العارف صاحب مقام الكشف للاقدار تحل به النازلة وحكمها بمعزل عنها فلا تؤثر في مقامه بخلاف من تحل فيه وهو على غير بينة ولا بصيرة بما قدر عليه فهذا يستلزمه الحياء والندم والذلة وذلك ليس كذلك وهنا أسرار إلهية لا يسعنا التعبير عنها\n\n\n### [البساط وعدم الانبساط أو العبادة والعبودية]\n\n\nوبعد أن فهمناك مراتبهم في هذا المقام وفرقنا لك بين معصية العارفين وبين معاصي العامة من علماء الرسوم ومقلديهم فاعلم أنه حكي عن بعضهم أنه قال اقعد على البساط يريد بساط العبادة وإياك والانبساط أي التزم ما تعطيه حقيقة العبودة من حيث إنها مكلفة بأمور حدها له سيدها فإنه لو لا تلك الأمور لاقتضي مقامها الإدلال والفخر والزهو من أجل مقام من هو عبد له ومنزلته كما زها يوما عتبة الغلام وافتخر فقيل له ما هذا الزهو الذي نراه في شمائلك مما لم يكن يعرف قبل ذلك منك فقال وكيف لا أزهو وقد أصبح لي مولى وأصبحت له عبدا فما قبض العبيد من الإدلال وأن يكونوا في الدنيا مثل ما هم في الآخرة إلا التكليف فهم في شغل بأوامر سيدهم إلى أن يفرغوا منها فإذا لم يبق لهم شغل قاموا في مقام الإدلال الذي تقتضيه العبودية وذلك لا يكون إلا في الدار الآخرة فإن التكليف لهم مع الأنفاس في الدار الدنيا فكل صاحب إدلال في هذه الدار فقد نقص من المعرفة بالله على قدر إدلاله ولا يبلغ درجة غيره ممن ليس له إدلال أبدا فإنه فاتته أنفاس كثيرة في حال إدلاله غاب عما يجب عليه فيها من التكليف الذي يناقض الاشتغال به الإدلال فليست الدنيا بدار إدلال أ لا ترى عبد القادر الجيلي مع إدلاله لما حضرته الوفاة وبقي عليه من أنفاسه في هذه الدار ذلك القدر الزماني وضع خده في الأرض واعترف بأن الذي هو فيه الآن هو الحق الذي ينبغي أن يكون العبد عليه في هذه الدار وسبب ذلك أنه كان في أوقات صاحب إدلال لما كان الحق يعرفه به من حوادث الأكوان وعصم الله أبا السعود تلميذه من ذلك الإدلال فلازم العبودية المكلفة مع الأنفاس إلى حين موته فما حكي أنه تغير عليه الحال عند موته كما تغير على شيخه عبد القادر وحكى لنا الثقة عندنا قال سمعته يقول طريق عبد القادر في طرق الأولياء غريب وطريقنا في طرق عبد القادر غريب رضي الله عن جميعهم ونفعنا بهم والله يعصمنا من المخالفات وإن كانت قدرت علينا فالله أسأل أن يجعلنا في ارتكابها على بصيرة حتى يكون لنا بها ارتقاء درجات والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Thirty-Nine: Concerning the Knowledge of the Station (المنزل) to which the Saint (الولي) Descends when The Real (الحق) Expels Him from His Proximity.\n\nIf the saint descends, it is nothing but\nAscent and elevation into height.\n\nFor The Real (الحق) has no restriction in Him,\nSo in the very essence of distance (النوى) is the essence of nearness (الدنو).\n\nThe state of the Chosen One (المجتبى) in every state\nIs elevation upon elevation upon elevation.\n\nNo ruling applies to him in any respect,\nNor does height (العلو) have any effect upon him.\n\n### [Obligation, Sin, Punishment]\n\nKnow—may Allah support you with a spirit from Him—that Allah the Exalted said to Iblis, \"Prostrate to Adam,\" and the Command (الأمر) appeared in him. And He said to Adam and Eve, \"Do not approach this tree,\" and the Prohibition (النهي) appeared in them. Obligation (التكليف) is divided between Command and Prohibition, and both are carried upon the necessity (الوجوب) unless a circumstantial indicator removes them from the station of necessity, even though our doctrine concerning them is based on divine suspension (التوقيف). Thus, compliance with the Command and the Prohibition is incumbent.\n\nThis was the first Command and the first Prohibition to appear in the natural world (العالم الطبيعي). We have informed you that the first divine impulse (الخاطر الأول) and all first things are exclusively Lordly (ربانية). For this reason, they are always truthful and never err, and the one who receives them acts decisively upon them, for their authority is strong. Since this was the first Command and Prohibition, punishment (العقوبة) occurred immediately upon transgression, without delay.\n\nWhen Commands arrive through intermediaries, they do not possess the strength of the first Command. These are the Commands that reach us through the tongues of the Messengers. They are of two types:\n\nFirst, those of secondary strength, which Allah casts into His Prophet’s soul without the intermediary of the Angel. The Divine Command reaches us, having passed through a cosmic presence (حضرة كونية), thereby acquiring a state it did not previously possess, for the Divine Names (الأسماء الإلهية) received it in this cosmic presence and shared their rulings in its ruling.\n\nSecond, those where the Angel descends with the Command. In this case, the Divine Command has passed through two cosmic presences—Gabriel, and whichever Angel it may be, and whichever Prophet it may be. Its action and effect are therefore weaker than the first and second types. For this reason, immediate accountability (المؤاخذة معجلة) does not occur; rather, there is either a delay until the Hereafter or forgiveness, so that accountability never occurs. Allah did this out of mercy for His servants.\n\nJust as the Exalted specialized the Prohibition for Adam and Eve, the Prohibition is not a practical obligation, for it implies a non-existent command (أمر عدمي), which is \"Do not do.\" It is of the nature of the contingent (الممكن) that it does not act, so it is as if he was told, \"Do not depart from your origin (أصلك).\" The Command, however, is not like that, for it implies an existent command (أمر وجودي), which is to act. It is as if he was told, \"Depart from your origin.\" Thus, the Command is harder upon the soul than the Prohibition, as it obligates departure from one's origin.\n\nIf Iblis, when he disobeyed and did not prostrate, had not uttered what he said out of arrogance and the claim of superiority he attributed to himself over others, he would have departed from his servitude (عبوديته) only to that extent, and Allah’s punishment would have befallen him. The punishment for Adam and Eve was because they undertook the departure from their origin—which was non-action (الترك), a non-existent command—by eating, which is an existent command (أمر وجودي).\n\nAllah thus joined Iblis, Adam, and Eve in a single pronoun (ضمير واحد), which was the most severe punishment for Adam. They were told, \"Descend!\" using the collective pronoun. The descent was not a punishment for Adam and Eve; it was only a punishment for Iblis. Adam was made to descend to fulfill the promise of establishing a vicegerent (خليفة) on Earth, after Allah had accepted his repentance and chosen him, and he had received the Words from his Lord through confession. His confession, peace be upon him, stood in opposition to Iblis’s statement, \"I am better than him.\" Thus, The Real (الحق) taught us the station of confession before Allah and the happiness it yields, so that we may adopt it as a path in our transgressions. And He taught us about Iblis’s claim and statement so that we may beware of similar things when we transgress. Eve was made to descend for procreation, and Iblis was made to descend for temptation (الإغواء). Thus, the descent of Adam and Eve was a descent of honor (كرامة), while the descent of Iblis was a descent of abandonment (خذلان), punishment, and the acquisition of burdens (أوزار).\n\nIblis’s disobedience did not necessitate eternal wretchedness (تأبيد الشقاء), for he did not commit polytheism (شرك); rather, he boasted about what Allah had created him upon. However, Allah decreed him wretched, and the abode of wretchedness is reserved for the People of Polytheism (أهل الشرك). So Allah sent him down to Earth to institute polytheism by whispering into the hearts of servants. When they commit polytheism, and Iblis disavows the polytheist and the polytheism, his disavowal does not benefit him, for he is the one who told him to disbelieve, as Allah the Exalted informed us. Thus, the burden of every polytheist in the world falls upon him. Even if he were a monotheist, since he instituted an evil practice (سن سنة سيئة), he bears its burden and the burden of all who act upon it.\n\n### [Polytheism and Unity]\n\nThe natural person (الشخص الطبيعي), like Iblis and the children of Adam, must necessarily conceive within himself an image of what he wishes to manifest. Iblis did not institute polytheism (الشرك) and whisper it until he had conceived it within himself in the form that, when it enters the soul of the polytheist, the image of Unity (التوحيد) departs from him. When Iblis conceived it within himself in this form, Unity necessarily departed from his own conception, for the partner (الشريك) is imagined within his soul alongside The Real (الحق) who is within his soul—I mean, from the knowledge of His existence. Thus, he did not leave The Real alone in his soul.\n\nTherefore, Iblis is undoubtedly a polytheist (مشرك) in his own soul. He must preserve the persistence of the image of the partner within himself so that he may supply it to the polytheists with every breath (مع الأنفاس), for he fears that the attribute of polytheism might depart from them, causing them to unify Allah and become happy. Iblis constantly preserves the image of polytheism within himself, monitoring the hearts of the polytheists existing at the time—East, West, South, and North—and using it to turn future monotheists toward polytheism. Thus, Iblis is perpetually engaged in polytheism. For this reason, Allah made him wretched, because he is unable to conceive of Unity even for a single breath, due to his adherence to this attribute and his eagerness for its persistence in the soul of the polytheist. If it were to depart from his own soul, the polytheist would find no one to suggest polytheism to him in his soul, and polytheism would depart from him. Iblis would then not conceive of the partner, because the image of the partner would have vanished from his soul, and he would not know that the polytheist had ceased his polytheism. This indicates that the partner constantly accompanies Iblis. He is the first to commit polytheism against Allah and the first to institute it, and he is the most wretched of all beings. For this reason, he hopes for mercy from the very essence of divine favor (المنة).\n\nThis is why we said that the punishment concerning Adam was only in his being grouped with Iblis in the pronoun when The Real addressed them with the descent, using speech befitting His Majesty. However, the speech must contain the attribute required by the wording of the pronoun, for the form of the word demands a specific meaning. This is a method that scholars have not made a concern.\n\n### [The Sin of the Gnostics and the Sin of the Common People]\n\nWe mentioned the issue of Adam only to reassure the People of Allah (أهل الله) that when they slip and descend from their station, that descent does not necessarily condemn them to wretchedness. Rather, their descent is like the descent of Adam. For Allah is not confined (لا يتحيز) nor restricted (لا يتقيد). If the matter is of this nature, and Allah possesses this attribute of non-restriction, then the very descent of the saint (الولي) upon committing a slip (الزلة), and the state of humility (الذلة), shame (الحياء), and brokenness (الانكسار) that overcomes him therein, is the very essence of ascent (عين الترقي) to a station higher than the one he was in. This is because his elevation is through Gnosis (المعرفة) and spiritual state (الحال). He may gain knowledge of Allah that he did not possess, and a state—humility and brokenness—that he was not previously upon. This is the very essence of ascent to a nobler station.\n\nIf a person lacks this state in his slip—if he does not regret, nor feel broken, nor humble himself, nor fear the station of his Lord—he is not one of the People of this Path (الطريقة). Rather, he is a companion of Iblis. Indeed, Iblis is in a better state than him, for Iblis says to those who obey him in disbelief: <<إِنِّي بَرِيءٌ مِّنكُمْ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ>> (Indeed, I am disassociated from you; indeed, I fear Allah, Lord of the worlds). We are only speaking about the slips of the People of Allah when they occur from them. The Exalted said: <<وَلَمْ يُصِرُّوا عَلَىٰ مَا فَعَلُوا>> (And they did not persist in what they had done). And the Messenger of Allah, peace and blessings be upon him, said: \"Regret is repentance.\"\n\nWhen the saint was in the station he was in and the state he was upon, enjoying it, his enjoyment was only due to his state, for Allah is too exalted to be enjoyed. When he slipped and was overcome by the state of humility and brokenness, the state whose existence he enjoyed—the state of obedience and conformity—necessarily vanished. When he lost it, he imagined that he had descended from the eye of Allah. In reality, when that state departed from him, he descended from *it*, as it was a state that required elevation. He is now on the ladder of ascent (معراج) of humility, regret, neediness, brokenness, confession, proper etiquette (الأدب) with Allah the Exalted, and shame before Him.\n\nHe ascends on this ladder and finds, at the culmination of this ascent, a state nobler than the state he was previously upon. It is then that he knows he did not descend, but rather ascended from where he did not perceive himself to be ascending. Allah concealed this from His saints so that they would not become bold in transgression, just as He concealed the gradual drawing away (الاستدراج) in those whom He made wretched, saying: <<سَنَسْتَدْرِجُهُمْ مِّنْ حَيْثُ لَا يَعْلَمُونَ>> (We will gradually draw them near from where they do not know). They are as Allah the Exalted said concerning them: <<وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا>> (While they think that they are doing good work).\n\nLikewise, the Exalted concealed His drawing near (تقريبه) and His care (عنايته) in those whom Allah made happy, by preoccupying them with weeping over their sin, witnessing their slip, and looking at it in their book. They are heedless that this regret grants them ascent in the sight of Allah, for He has not given them the glad tidings of the acceptance of repentance. They are certain of the occurrence of the slip, and the brokenness and shame resulting from what they fell into govern them, even if Allah does not hold them accountable for that sin. Thus, the gradual drawing away (الاستدراج) occurs in both good and evil, and in the blessed and the wretched.\n\nI met a man in the city of Fez who was so melancholy that he looked as if he worked in a furnace. I asked Abu al-Abbas al-Hassar, who was one of the great Shaykhs, about him, as I saw him sitting with him and showing affection for him. He told me, \"This is a man who was in a station and fell from it. He was in this station and was in such a state of shame and brokenness that silence from speaking to creation became incumbent upon him. I continued to treat him gently with such remedies and remove the sickness of that slip with this kind of cure. He had allowed me access to his soul, and I persisted until that medicine flowed through his limbs, brightening his face, and a door was opened in the eye of his heart to his acceptance. Yet, shame still clung to him.\"\n\nThis is how the slips of the great ones (الأكابر) should generally be: their descent is only into permissible things (المباحات). Major sins (الكبائر) rarely occur from them. Abu Yazid al-Bistami, may Allah be pleased with him, was asked, \"Does the Gnostic (العارف) sin?\" He replied: <<وَكَانَ أَمْرُ اللَّهِ قَدَرًا مَّقْدُورًا>> (And the Command of Allah is a decree determined). He meant that their disobedience is by virtue of the irresistible decree (القدر النافذ) upon them, not that they intend to violate the sacred limits of Allah. By the grace of Allah, if they are saints (أولياء) in the sight of Allah the Exalted, they are protected (معصومون) in this station, so no disobedience issues from them at all as a violation of Allah’s sacred limits, unlike the sins of others, for the faith inscribed in their hearts prevents that.\n\nSome of them sin out of inattention (غفلة). Others transgress while in a state of presence (حضور), based on a divine unveiling (كشف إلهي) through which Allah has informed them of what He decreed upon them before its occurrence. Thus, they act upon clear insight (بصيرة) and evidence from their Lord. This state is equivalent to the glad tidings in His saying: <<لِّيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِن ذَنبِكَ وَمَا تَأَخَّرَ>> (That Allah may forgive you your former and your latter sins). He informed him of the sins that would occur and be forgiven, so they have no ruling or authority over him. When the time for their manifestation arrives, the Name *Al-Ghaffar* (The Forgiving) accompanies them. The affliction descends upon the servant, but *Al-Ghaffar* screens its ruling, so it is like one who is cast into the fire but is not burned, like Abraham, peace be upon him. He was in the fire, but it had no ruling over him due to the veil (الحجاب) that prevented it. Likewise, the slip of the Gnostic who possesses the station of Unveiling (الكشف) regarding the decrees: the affliction befalls him, but its ruling is isolated from him, so it does not affect his station. This is unlike the one upon whom the affliction descends while he lacks clear evidence or insight into what has been decreed upon him. The latter is compelled by shame, regret, and humility, while the former is not. There are divine secrets here that we cannot express.\n\n### [The Carpet and Lack of Familiarity, or Worship and Servitude]\n\nAfter we have made you understand their levels in this station and distinguished for you between the disobedience of the Gnostics (العارفين) and the disobedience of the common people (العامة) among the scholars of outward forms and their imitators, know that it was related that one of them said: \"Sit upon the Carpet (البساط), and beware of Familiarity (الانبساط).\" By the Carpet, he means the carpet of worship (بساط العبادة). He means: adhere to what the reality of servitude (العبودية) demands, in that it is obligated by commands whose limits have been set for it by its Master. Were it not for those commands, its station would necessitate presumption (الإدلال), pride, and vanity, due to the rank and station of the One whom it serves.\n\nThis is like Utbah the Youth, who once boasted and showed pride. When he was asked about this vanity seen in his character, which had not been known before, he said, \"How can I not boast when I have acquired a Master and have become His slave?\"\n\nWhat prevents slaves from presumption (الإدلال) and from being in this world as they are in the Hereafter is only Obligation (التكليف). They are preoccupied with the commands of their Master until they are finished with them. When they have no more preoccupation, they stand in the station of presumption that servitude demands. This only occurs in the Hereafter, for Obligation accompanies their breaths in the life of this world.\n\nTherefore, anyone who exhibits presumption in this world suffers a deficiency in Gnosis (المعرفة بالله) proportional to his presumption. He will never reach the degree of others who lack presumption, for he missed many breaths during his state of presumption, being absent from the obligation incumbent upon him during those moments—an obligation whose engagement contradicts presumption.\n\nThe world is not the abode of presumption. Do you not see Abd al-Qadir al-Jilani, despite his presumption, when death approached and that temporal measure of his breaths remained in this world, he placed his cheek on the ground and confessed that the state he was in then was the true state that the servant ought to be upon in this world? The reason for this was that he was at times a man of presumption due to the cosmic events that The Real revealed to him.\n\nAllah protected his student, Abu al-Su'ud, from that presumption, and he adhered to obligated servitude (العبودية المكلفة) with every breath until his death. It was not related that his state changed upon his death, as it changed for his Shaykh, Abd al-Qadir. A trustworthy source related to us that he heard him say, \"The path of Abd al-Qadir among the paths of the saints is strange, and our path among the paths of Abd al-Qadir is strange.\" May Allah be pleased with all of them and benefit us through them.\n\nWe ask Allah to protect us from transgressions (المخالفات), but if they are decreed upon us, I ask Allah to make us commit them with insight (بصيرة) so that they may be a means for us to ascend in degrees. And Allah speaks the Truth, and He guides to the Way.",
    "ur": "**(باب انتالیسواں: اس منزل کی معرفت میں جہاں ولی اترتا ہے جب ذات حق (الحق تعالى) اسے اپنے قرب سے دور کر دے)**\n\nجب ولی اترتا ہے تو یہ محض *** بلندی میں عروج اور ارتقاء ہی ہوتا ہے\nکیونکہ ذات حق (الحق) میں کوئی قید نہیں *** پس دوری (النوى) کی عینیت میں قربت (الدنو) کی عینیت ہے\nپس برگزیدہ شخص کا حال ہر حال میں *** بلندی پر بلندی، بلندی پر بلندی ہے\nچنانچہ اس پر کسی بھی طرح کا کوئی حکم نہیں *** اور نہ ہی بلندی کا اس پر کوئی اثر ہے۔\n\n### [تکلیف، خطا، سزا]\n\nجان لو، اللہ تمہیں اپنی روح سے مدد دے، کہ اللہ تعالیٰ نے ابلیس سے کہا: \"آدم کو سجدہ کرو\"، تو اس میں امر (حکم) ظاہر ہوا، اور آدم و حوا سے کہا: \"لَا تَقْرَبَا هَذِهِ الشَّجَرَةَ\" (اس درخت کے قریب نہ جانا)، تو ان دونوں میں نہی (ممانعت) ظاہر ہوئی۔ تکلیف (التكليف) امر اور نہی کے درمیان تقسیم ہے، اور یہ دونوں وجوب پر محمول ہیں، یہاں تک کہ کوئی حالیہ قرینہ انہیں وجوب کے مقام سے خارج کر دے۔ اگرچہ ہمارا مذہب ان دونوں میں توقیف (توقف) کا ہے، لیکن امر اور نہی کی تعمیل لازم ہے۔ یہ پہلا امر ہے جو عالمِ طبیعی میں ظاہر ہوا، اور پہلی نہی بھی۔ ہم تمہیں بتا چکے ہیں کہ پہلا خیال (الخاطر الأول) اور تمام اولیات صرف ربانی ہوتی ہیں، اسی لیے وہ ہمیشہ سچ ہوتی ہیں اور کبھی خطا نہیں کرتیں، اور ان کا حامل ان پر یقین رکھتا ہے کیونکہ ان کی سلطنت قوی ہوتی ہے۔ چونکہ یہ پہلا امر اور نہی تھی، اس لیے خلاف ورزی پر فوراً سزا واقع ہوئی اور مہلت نہیں دی گئی۔\n\nجب اوامر (احکام) واسطوں کے ذریعے آتے ہیں، تو ان میں پہلی قوت نہیں ہوتی۔ یہ وہ اوامر ہیں جو رسولوں کی زبانوں پر ہم تک پہنچتے ہیں، اور یہ دو قسم کے ہوتے ہیں: یا تو ثانوی (ثوان) ہوتے ہیں، یعنی وہ جو اللہ اپنے نبی کے دل میں بغیر کسی فرشتے کے واسطے کے القا کرتا ہے، تو الٰہی امر ہم تک پہنچتا ہے، اور وہ ایک کونی (کائناتی) حضور سے گزر چکا ہوتا ہے، اور اس سے ایک ایسی حالت حاصل کر لیتا ہے جو پہلے اس پر نہ تھی۔ کیونکہ الٰہی اسماء نے اس کونی حضور میں اسے قبول کیا، اور اس کے احکام نے اس کے حکم میں شرکت کی۔ یا پھر وہ امر فرشتہ کے ذریعے نازل ہوتا ہے، تو الٰہی امر کائنات کے دو حضوروں (جبرائیل اور جو بھی فرشتہ ہو) اور جو بھی نبی ہو، سے گزر چکا ہوتا ہے۔ تو اس کا فعل اور اثر قوت میں پہلے اور دوسرے سے کم ہوتا ہے۔ اسی لیے فوری مواخذہ واقع نہیں ہوتا، بلکہ یا تو آخرت تک مہلت دی جاتی ہے، یا پھر مغفرت ہو جاتی ہے، اور اس پر کبھی مواخذہ نہیں ہوتا۔ اللہ نے یہ اپنے بندوں پر رحمت کے طور پر کیا، جیسا کہ اس نے نہی کو آدم اور حوا کے ساتھ خاص کیا۔\n\nنہی (ممانعت) عملی تکلیف نہیں ہے، کیونکہ اس میں ایک عدمی امر شامل ہے، یعنی \"نہ کرو\" (لا تفعل)۔ اور ممکن (الممکن) کی حقیقت یہ ہے کہ وہ فعل نہیں کرتا، تو گویا ان سے کہا گیا: \"اپنی اصل سے جدا نہ ہو\"۔ جبکہ امر ایسا نہیں ہے، کیونکہ اس میں ایک وجودی امر شامل ہے، یعنی \"فعل کرو\" (أن يفعل)، تو گویا ان سے کہا گیا: \"اپنی اصل سے باہر نکلو\"۔ پس امر نفس پر نہی سے زیادہ شاق ہے، کیونکہ اسے اپنی اصل سے باہر نکلنے کی تکلیف دی گئی۔\n\nاگر ابلیس نے جب نافرمانی کی اور سجدہ نہیں کیا، تو وہ تکبر اور فضیلت کا وہ دعویٰ نہ کرتا جو اس نے اپنے لیے دوسروں پر منسوب کیا، تو وہ اس قدر اپنی عبودیت سے خارج نہ ہوتا، اور اس پر اللہ کی سزا نازل ہوئی۔ اور آدم و حوا کے لیے سزا اس لیے تھی کہ انہوں نے اپنی اصل سے باہر نکلنے کی تکلیف اٹھائی، جو کہ ترک (عدمی امر) تھا، اور کھانے (وجودی امر) کے ذریعے اس سے باہر نکلے۔ پس اللہ نے ابلیس اور آدم و حوا کو ایک ہی ضمیر میں شریک کیا، اور یہ آدم پر سب سے سخت سزا تھی۔ چنانچہ ان سب کو جمع کے ضمیر کے ساتھ کہا گیا: \"اہبطوا\" (اتر جاؤ)۔\n\nاور یہ ہبوط (اترنا) آدم و حوا کے لیے سزا نہیں تھا، بلکہ یہ ابلیس کے لیے سزا تھا۔ کیونکہ آدم کو زمین میں خلیفہ بنانے کے وعدے کی سچائی کے لیے اتارا گیا، اس کے بعد جب اللہ نے ان کی توبہ قبول کی، انہیں چن لیا (اجتباہ)، اور انہوں نے اپنے رب سے کلمات (اعتراف) حاصل کیے۔ ان کا اعتراف (علیہ السلام) ابلیس کے اس قول کے مقابلے میں تھا: \"أَنَا خَيْرٌ مِنْهُ\" (میں اس سے بہتر ہوں)۔ پس اللہ نے ہمیں اعتراف کے مقام کی حقیقت اور اس سے پیدا ہونے والی سعادت سے آگاہ کیا، تاکہ ہم اپنی مخالفتوں میں اسے اپنا راستہ بنائیں۔ اور ہمیں ابلیس کے دعوے اور اس کے قول سے آگاہ کیا، تاکہ ہم اپنی مخالفتوں کے وقت اس جیسی چیزوں سے بچیں۔ اور حوا کو نسل بڑھانے کے لیے اتارا گیا، اور ابلیس کو گمراہ کرنے کے لیے اتارا گیا۔ پس آدم و حوا کا ہبوط (اترنا) کرامت کا ہبوط تھا، اور ابلیس کا ہبوط ذلت اور سزا کا ہبوط تھا، اور گناہوں کا کمانا تھا۔ کیونکہ اس کی نافرمانی دائمی شقاوت کا تقاضا نہیں کرتی تھی، اس نے شرک نہیں کیا تھا، بلکہ اس نے اس چیز پر فخر کیا تھا جس پر اللہ نے اسے پیدا کیا تھا، اور اسے شقی (بدبخت) لکھ دیا تھا۔ اور شقاوت کا گھر (دار الشقاء) مشرکوں کے لیے مخصوص ہے۔ پس اللہ نے اسے زمین پر اتارا تاکہ وہ بندوں کے دلوں میں وسوسہ ڈال کر شرک کی سنت قائم کرے۔ جب وہ شرک کرتے ہیں اور ابلیس مشرک اور شرک سے براءت کا اظہار کرتا ہے، تو اس کی براءت اسے فائدہ نہیں دیتی، کیونکہ اسی نے انہیں کہا تھا کہ \"کفر کرو\"، جیسا کہ اللہ تعالیٰ نے خبر دی ہے۔ پس اس پر دنیا کے ہر مشرک کا بوجھ (وزر) پڑا، اگرچہ وہ موحد (توحید پرست) ہو، کیونکہ جس نے کوئی برا طریقہ (سنت سیئہ) جاری کیا، تو اس پر اس کا بوجھ اور ان سب کا بوجھ ہے جنہوں نے اس پر عمل کیا۔\n\n### [شرک اور توحید]\n\nکیونکہ طبیعی شخص، جیسے ابلیس اور بنی آدم، کے لیے ضروری ہے کہ وہ اپنے نفس میں اس چیز کی مثال تصور کرے جسے وہ ظاہر کرنا چاہتا ہے۔ پس اس نے شرک کی سنت اس وقت تک جاری نہیں کی اور اس کا وسوسہ نہیں ڈالا جب تک کہ اس نے اسے اپنے نفس میں اس صورت پر تصور نہ کر لیا، کہ جب وہ صورت مشرک کے نفس میں پیدا ہو جائے تو توحید کی صورت اس سے زائل ہو جائے۔ پس جب اس نے اسے اپنے نفس میں اس صورت پر تصور کر لیا، تو توحید لازمی طور پر اس کے اپنے تصور سے خارج ہو گئی۔ کیونکہ شریک اس کے نفس میں اس ذات حق (الحق) کے پہلو میں متصور ہے جو اس کے نفس میں ہے، یعنی اس کے وجود کے علم سے متخیل ہے۔ پس اس نے حق کو اپنے نفس میں اکیلا نہیں چھوڑا۔\n\nپس ابلیس بلاشبہ اپنے نفس میں مشرک تھا، اور اس کے لیے ضروری ہے کہ وہ شریک کی صورت کو اپنے نفس میں باقی رکھے تاکہ وہ سانسوں کے ساتھ مشرکوں کو مدد فراہم کرتا رہے۔ کیونکہ وہ ان سے ڈرتا ہے کہ کہیں ان سے شرک کی صفت زائل نہ ہو جائے اور وہ اللہ کی توحید اختیار کر کے سعادت مند ہو جائیں۔ پس ابلیس ہمیشہ اپنے نفس میں شرک کی صورت کو محفوظ رکھتا ہے اور اس کے ذریعے وقت کے مشرکوں کے دلوں کی نگرانی کرتا ہے، خواہ وہ مشرق، مغرب، جنوب یا شمال میں ہوں۔ اور وہ مستقبل میں توحید پرستوں کو، جو مشرک نہیں ہیں، شرک کی طرف لوٹاتا ہے۔ پس ابلیس ہمیشہ شرک پر قائم رہتا ہے۔ اسی وجہ سے اللہ نے اسے شقی (بدبخت) کر دیا، کیونکہ وہ ایک سانس کے لیے بھی توحید کا تصور نہیں کر سکتا، اس صفت کے لازم ہونے اور مشرک کے نفس میں اس کے باقی رہنے کی حرص کی وجہ سے۔ کیونکہ اگر یہ صفت اس کے نفس سے چلی جائے، تو مشرک کو کوئی ایسا نہیں ملے گا جو اس کے نفس میں شرک کی بات کرے، تو شرک اس سے زائل ہو جائے گا۔ اور ابلیس شریک کا تصور نہیں کر سکے گا، کیونکہ شریک کی صورت اس کے نفس سے زائل ہو چکی ہو گی۔ تو اسے یہ علم نہیں ہو گا کہ وہ مشرک اپنے شرک سے زائل ہو چکا ہے۔ پس یہ دلیل ہے کہ شریک ہمیشہ ابلیس کے ساتھ رہتا ہے۔ پس وہ اللہ کے ساتھ شرک کرنے والا پہلا شخص ہے، اور شرک کی سنت قائم کرنے والا پہلا شخص ہے، اور وہ تمام جہانوں میں سب سے زیادہ شقی ہے۔ اسی لیے وہ عینِ احسان سے رحمت کی امید رکھتا ہے۔\n\nاور اسی لیے ہم نے کہا کہ آدم کے حق میں سزا صرف انہیں ابلیس کے ساتھ ایک ضمیر میں جمع کرنے میں تھی، جب ذات حق (الحق) نے انہیں ہبوط (اترنے) کا خطاب ایسے کلام سے کیا جو اس کے جلال کے لائق تھا، لیکن کلام میں وہ صفت ضرور ہونی چاہیے جو ضمیر کا لفظ تقاضا کرتا ہے۔ کیونکہ لفظ کی صورت خاص معنی کا تقاضا کرتی ہے، اور یہ وہ طریقہ ہے جس پر علماء نے توجہ نہیں دی۔\n\n### [عارفین کی خطا اور عام لوگوں کی خطا]\n\nہم نے آدم کے مسئلے کا ذکر صرف اہل اللہ کی دلجوئی کے لیے کیا ہے، جب وہ لغزش کھا کر اپنے مقام سے نیچے اترتے ہیں، کہ یہ انحطاط (نیچے اترنا) لازمی طور پر ان کی شقاوت (بدبختی) کا سبب نہیں بنتا، بلکہ ان کا ہبوط آدم کے ہبوط کی طرح ہوتا ہے۔ کیونکہ اللہ نہ تو کسی جگہ میں محدود ہوتا ہے اور نہ ہی کسی قید میں آتا ہے۔ جب معاملہ اس حد پر ہو اور اللہ عدمِ تقیید (قید سے پاک ہونے) کی اس صفت پر ہو، تو ولی کی لغزش کے وقت اس کا ہبوط، اور اس میں اس کی ذلت، حیا، اور انکسار کی حالت، عین اس مقام سے بھی بلند تر مقام کی طرف ارتقاء ہوتی ہے جس پر وہ پہلے تھا۔ کیونکہ اس کی بلندی معرفت (المعرفۃ) اور حال کے ذریعے ہوتی ہے، اور اسے اللہ کے بارے میں ایسا علم حاصل ہو سکتا ہے جو پہلے اس کے پاس نہیں تھا، اور ایسا حال (ذلت اور انکسار) حاصل ہو سکتا ہے جو پہلے اس پر نہیں تھا۔ اور یہی اشرف مقام کی طرف عین ارتقاء ہے۔\n\nپس اگر انسان اپنی لغزش میں یہ حالت کھو دے، اور نہ نادم ہو، نہ انکسار کرے، نہ ذلیل ہو، اور نہ اپنے رب کے مقام سے ڈرے، تو وہ اس طریقے کے اہل میں سے نہیں ہے، بلکہ وہ ابلیس کا ہم نشین ہے۔ بلکہ ابلیس اس سے بہتر حال میں ہے، کیونکہ وہ اس شخص سے جو کفر میں اس کی اطاعت کرتا ہے، کہتا ہے: \"إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ\" (میں تجھ سے بری ہوں، میں اللہ سے ڈرتا ہوں جو تمام جہانوں کا رب ہے)۔ اور ہم تو صرف اہل اللہ کی لغزشوں کے بارے میں بات کر رہے ہیں جب وہ ان سے واقع ہوتی ہیں۔ اللہ تعالیٰ نے فرمایا: \"وَلَمْ يُصِرُّوا عَلَى مَا فَعَلُوا\" (اور جو کچھ انہوں نے کیا اس پر اصرار نہیں کیا)۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"ندامت توبہ ہے۔\"\n\nولی انسان جب اس مقام پر ہوتا ہے اور اس حال پر ہوتا ہے جس سے وہ لذت حاصل کر رہا ہوتا ہے، تو اس کی لذت صرف اس کے حال کی وجہ سے ہوتی ہے، کیونکہ اللہ اس سے بلند ہے کہ اس سے لذت حاصل کی جائے۔ پس جب وہ لغزش کھاتا ہے اور اس پر ذلت اور انکسار کی حالت طاری ہوتی ہے، تو وہ حالت جس کے وجود سے وہ لذت حاصل کر رہا تھا، یعنی اطاعت اور موافقت کی حالت، لازمی طور پر زائل ہو جاتی ہے۔ جب وہ اسے کھو دیتا ہے، تو ہم خیال کرتے ہیں کہ وہ عین اللہ سے نیچے اتر گیا ہے۔ حالانکہ جب وہ حالت اس سے زائل ہوئی تو وہ اس حالت سے نیچے اترا، کیونکہ وہ حالت رفعت کا تقاضا کرتی تھی۔ اور اب وہ ذلت، ندامت، فقر، انکسار، اعتراف، اللہ تعالیٰ کے ساتھ ادب اور اس سے حیا کی معراج پر ہے۔ وہ اس معراج میں ترقی کر رہا ہے، اور یہ بندہ اس معراج کی انتہا پر ایک ایسی حالت پاتا ہے جو اس حالت سے زیادہ اشرف ہے جس پر وہ پہلے تھا۔ تب اسے علم ہوتا ہے کہ وہ نیچے نہیں اترا، بلکہ وہ اس طرح ترقی کر گیا کہ اسے شعور بھی نہیں ہوا کہ وہ ترقی میں ہے۔\n\nاور اللہ نے یہ بات اپنے اولیاء سے چھپا دی ہے تاکہ وہ نافرمانیوں میں جری نہ ہو جائیں، جیسا کہ اس نے استدراج (تدریجی پکڑ) کو ان لوگوں میں چھپا دیا جنہیں اس نے شقی کیا، چنانچہ فرمایا: \"سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ\" (ہم انہیں تدریجاً پکڑیں گے جہاں سے انہیں علم بھی نہ ہو گا)۔ پس وہ ایسے ہی ہیں جیسا کہ اللہ تعالیٰ نے ان کے بارے میں فرمایا: \"وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا\" (اور وہ سمجھتے ہیں کہ وہ اچھا کام کر رہے ہیں)۔ اسی طرح اللہ سبحانہ و تعالیٰ نے اپنی قربت اور عنایت کو ان لوگوں میں چھپا دیا جنہیں اللہ نے سعید کیا، اس چیز کے ذریعے جس میں اللہ نے انہیں مشغول کر دیا، یعنی اپنے گناہ پر رونا، اپنی لغزش کا مشاہدہ کرنا، اور اسے اپنی کتاب میں دیکھنا، اور وہ اس بات سے غافل ہو گئے کہ یہ ندامت انہیں اللہ کے ہاں ترقی عطا کرتی ہے۔ کیونکہ اللہ نے انہیں توبہ کی قبولیت کی بشارت نہیں دی، پس وہ لغزش کے وقوع کو یقینی سمجھتے ہیں، اور انکسار اور حیا ان پر غالب رہتی ہے اس چیز کی وجہ سے جو ان سے واقع ہوئی، اگرچہ اللہ نے انہیں اس گناہ پر مواخذہ نہیں کیا۔\n\nپس استدراج خیر اور شر دونوں میں، اور سعیدوں اور شقیوں دونوں میں حاصل ہوا۔ اور میں نے فاس شہر میں ایک شخص سے ملاقات کی جس پر ایسی اداسی چھائی ہوئی تھی جیسے وہ بھٹی میں کام کر رہا ہو۔ میں نے ابو العباس الحصار سے، جو بڑے شیوخ میں سے تھے، اس کے بارے میں پوچھا، کیونکہ میں نے انہیں اس کے ساتھ بیٹھے اور اس سے محبت کرتے دیکھا تھا۔ انہوں نے مجھے بتایا: \"یہ ایک ایسا شخص ہے جو ایک مقام پر تھا، پھر اس سے نیچے اتر گیا۔ وہ اس مقام پر تھا اور حیا اور انکسار کی ایسی حالت میں تھا کہ اس پر مخلوق سے بات کرنے پر خاموشی واجب ہو گئی تھی۔\" میں مسلسل اس طرح کی دواؤں سے اس کی دلجوئی کرتا رہا اور اس طرح کے علاج سے اس لغزش کی بیماری کو دور کرتا رہا۔ اور اس نے مجھے اپنے نفس پر قابو پانے کی اجازت دے دی تھی۔ میں اس کے ساتھ لگا رہا یہاں تک کہ وہ دوا اس کے اعضاء میں سرایت کر گئی، تو اس کا چہرہ کھل گیا اور اس کے دل کی آنکھ میں قبولیت کا دروازہ کھل گیا۔ اس کے باوجود، حیا اس کے ساتھ لازم رہی۔\n\nاور اسی طرح ہونا چاہیے کہ اکابر کی لغزشیں عموماً صرف مباحات کی طرف نزول ہوتی ہیں، اور کبائر کا ان سے واقع ہونا نادر کے حکم میں ہے۔ ابو یزید بسطامی رضی اللہ عنہ سے پوچھا گیا: \"کیا عارف گناہ کرتا ہے؟\" تو انہوں نے فرمایا: \"وَكَانَ أَمْرُ اللَّهِ قَدَرًا مَقْدُورًا\" (اور اللہ کا حکم ایک مقررہ تقدیر ہے)۔ وہ یہ کہنا چاہتے تھے کہ ان کی نافرمانی ان میں نافذ ہونے والی تقدیر کے حکم سے ہوتی ہے، نہ کہ وہ اللہ کی حرمتوں کو پامال کرنے کا ارادہ کرتے ہیں۔ وہ، الحمد للہ، جب اللہ تعالیٰ کے ولی ہوتے ہیں، تو اس مقام پر معصوم ہوتے ہیں، چنانچہ ان سے اللہ کی حرمت کو پامال کرنے کے ارادے سے کوئی نافرمانی سرزد نہیں ہوتی، جیسا کہ دوسروں کی نافرمانیاں ہوتی ہیں۔ کیونکہ دلوں میں لکھی ہوئی ایمان کی صفت اس سے روکتی ہے۔ ان میں سے بعض غفلت میں گناہ کرتے ہیں، اور بعض الٰہی کشف (الکشف) کی موجودگی میں مخالفت کرتے ہیں، جس میں اللہ نے انہیں اس کے وقوع سے پہلے ہی بتا دیا ہوتا ہے کہ اس نے ان پر کیا مقدر کیا ہے۔ پس وہ اپنے معاملے میں بصیرت پر اور اپنے رب کی طرف سے واضح دلیل پر ہوتے ہیں۔ اور یہ حالت اس بشارت کے مانند ہے جو اس قول میں ہے: \"لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ\" (تاکہ اللہ تمہارے اگلے اور پچھلے گناہ معاف کر دے)۔ پس اللہ نے انہیں واقع ہونے والے مغفور گناہوں سے آگاہ کر دیا، لہٰذا ان گناہوں کا ان پر کوئی حکم یا تسلط نہیں ہوتا۔ کیونکہ جب ان کے ظاہر ہونے کا وقت آتا ہے، تو ان کی صحبت میں اسم الغفار (بخشنے والا) ہوتا ہے، تو وہ بندے پر نازل ہوتے ہیں اور الغفار ان کے حکم کو حجاب میں لے لیتا ہے۔ پس وہ اس شخص کی مانند ہوتے ہیں جسے آگ میں ڈالا جائے اور وہ نہ جلے، جیسے ابراہیم علیہ السلام۔ پس وہ آگ میں تھے اور حجاب کی وجہ سے، جو مانع ہے، اس کا کوئی حکم ان پر نہیں تھا۔ اسی طرح عارف کی لغزش، جو تقدیروں کے کشف (الکشف) کا مالک ہوتا ہے، اس پر مصیبت نازل ہوتی ہے اور اس کا حکم اس سے دور رہتا ہے، چنانچہ وہ اس کے مقام پر اثر انداز نہیں ہوتی۔ برخلاف اس شخص کے جس پر وہ نازل ہوتی ہے اور وہ اس چیز کے بارے میں جو اس پر مقدر کی گئی ہے، کسی واضح دلیل یا بصیرت پر نہیں ہوتا۔ پس یہ شخص حیا، ندامت اور ذلت کو لازم پکڑتا ہے، جبکہ وہ (عارف) ایسا نہیں ہوتا۔ اور یہاں الٰہی اسرار ہیں جنہیں بیان کرنے کی ہمیں گنجائش نہیں۔\n\n### [بساط اور عدم انبساط یا عبادت اور عبودیت]\n\nاور اس کے بعد کہ ہم نے تمہیں اس مقام پر ان کے مراتب سمجھا دیے اور عارفین کی نافرمانی اور عام علماءِ رسوم اور ان کے مقلدین کی نافرمانیوں کے درمیان فرق واضح کر دیا، تو جان لو کہ بعض سے یہ حکایت کی گئی ہے کہ انہوں نے کہا: \"بساط پر بیٹھو\" (اقعد على البساط)، یعنی عبادت (العبادة) کے بساط پر، اور \"انبساط سے بچو\" (إياك والانبساط)، یعنی عبودیت (العبودية) کی حقیقت جو تقاضا کرتی ہے، اسے لازم پکڑو، اس لحاظ سے کہ اسے اس کے آقا نے جن امور کی حد بندی کی ہے، ان کی تکلیف دی گئی ہے۔ کیونکہ اگر وہ امور نہ ہوتے، تو اس کا مقام اس کے آقا کے مقام اور منزلت کی وجہ سے ناز، فخر اور غرور کا تقاضا کرتا، جیسا کہ ایک دن غلام عتبہ نے ناز کیا اور فخر کیا، تو اس سے پوچھا گیا: \"یہ کیسا غرور ہے جو ہم تمہاری عادات میں دیکھ رہے ہیں، جو پہلے تم میں نہیں جانا جاتا تھا؟\" تو اس نے کہا: \"میں کیوں نہ ناز کروں، جبکہ میرا ایک آقا ہو گیا ہے اور میں اس کا غلام ہو گیا ہوں؟\"\n\nغلاموں کو ناز (الإدلال) سے اور دنیا میں آخرت کی طرح ہونے سے صرف تکلیف (التكليف) نے روکا ہے۔ پس وہ اپنے آقا کے احکام میں مشغول رہتے ہیں یہاں تک کہ وہ ان سے فارغ ہو جائیں۔ جب ان کے لیے کوئی مشغولیت باقی نہیں رہتی، تو وہ ناز کے مقام پر کھڑے ہو جاتے ہیں جس کا عبودیت تقاضا کرتی ہے، اور یہ صرف دارِ آخرت میں ہو گا۔ کیونکہ دنیا کے گھر میں تکلیف ان کے لیے سانسوں کے ساتھ لازم ہے۔ پس اس دنیا میں ناز کرنے والا ہر شخص، اپنے ناز کی مقدار کے مطابق اللہ کی معرفت (المعرفۃ) میں کمی رکھتا ہے، اور وہ کبھی بھی اس شخص کے درجے کو نہیں پہنچ سکتا جسے ناز نہیں ہے۔ کیونکہ ناز کی حالت میں اس کی بہت سی سانسیں فوت ہو گئیں، اور وہ اس تکلیف سے غافل رہا جو اس پر ان سانسوں میں واجب تھی، اور جس میں مشغولیت ناز کے منافی ہے۔ دنیا ناز کا گھر نہیں ہے۔\n\nکیا تم عبد القادر جیلانی کو نہیں دیکھتے کہ اپنے ناز کے باوجود، جب ان کی وفات کا وقت قریب آیا اور اس دنیا میں ان کی سانسوں کا وہ زمانی حصہ باقی رہ گیا، تو انہوں نے اپنا رخسار زمین پر رکھ دیا اور اعتراف کیا کہ وہ جس حال میں اب ہیں، وہی حق ہے جو بندے کو اس دنیا میں ہونا چاہیے۔ اور اس کی وجہ یہ تھی کہ وہ بعض اوقات ناز کرنے والے تھے، جب ذات حق (الحق) انہیں کائنات کے واقعات سے آگاہ کرتا تھا۔ اور اللہ نے ان کے شاگرد ابو السعود کو اس ناز سے محفوظ رکھا، چنانچہ انہوں نے اپنی موت تک سانسوں کے ساتھ مکلف عبودیت (العبودية) کو لازم پکڑا۔ پس یہ حکایت نہیں کی گئی کہ ان کی موت کے وقت ان کا حال بدل گیا، جیسا کہ ان کے شیخ عبد القادر کا حال بدلا تھا۔ اور ہمارے نزدیک ثقہ شخص نے ہمیں حکایت بیان کی، کہا: میں نے انہیں کہتے سنا: \"عبد القادر کا طریقہ اولیاء کے طریقوں میں غریب ہے، اور ہمارا طریقہ عبد القادر کے طریقوں میں غریب ہے۔\" اللہ ان سب سے راضی ہو اور ہمیں ان سے نفع پہنچائے۔ اور اللہ ہمیں مخالفتوں سے محفوظ رکھے، اگرچہ وہ ہم پر مقدر کی گئی ہوں، تو میں اللہ سے سوال کرتا ہوں کہ وہ ہمیں ان کے ارتکاب میں بصیرت پر رکھے، تاکہ وہ ہمارے لیے درجات کی بلندی کا سبب بنیں۔ \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔)",
    "fa": "(باب سی و نهم در معرفت منزلی که ولی بدان فرود می‌آید، هنگامی که حق تعالی او را از جوار خود براند)\n\nچو ولی فرود آید، نیست جز *** عروج و ارتقا در اوج و علو\n\nزیرا که حق (الحق) را هیچ تقییدی نیست *** پس در عین دوری، عین نزدیکی است\n\nحال برگزیده در هر حالی *** رفعت اندر رفعت اندر رفعت است\n\nپس هیچ حکمی بر او از هر جهت نیست *** و علو (رفعت) در او تأثیری ندارد\n\n### [تکلیف، خطا، عقوبت]\n\nبدان، خداوند تو را به روحی از جانب خود تأیید کند، که خدای تعالی به ابلیس فرمود: «برای آدم سجده کن»، پس امر (فرمان) در آن آشکار شد؛ و به آدم و حوا فرمود: «لا تَقْرَبا هذِهِ الشَّجَرَةَ» (به این درخت نزدیک نشوید)، پس نهی در آن دو آشکار شد. تکلیف (الزامات شرعی) میان امر و نهی تقسیم شده است و هر دو بر وجوب حمل می‌شوند، مگر آنکه قرینه‌ای حالی، آن دو را از مقام وجوب خارج سازد. اگرچه مذهب ما در مورد آن دو (امر و نهی) توقیف (توقف و عدم دخالت رأی) است، اما امتثال امر و نهی واجب است. این اولین امری بود که در عالم طبیعت ظاهر شد و اولین نهی. ما به تو آگاهانده‌ایم که خاطر (اندیشه) اول و تمامی اولیات، جز ربانی (الهی) نیستند و به همین دلیل همیشه راست می‌گویند و هرگز خطا نمی‌کنند و صاحبش به آن یقین پیدا می‌کند، زیرا سلطه آن قوی است. چون این اولین امر و نهی بود، عقوبت هنگام مخالفت واقع شد و مهلتی داده نشد. اما هنگامی که اوامر با واسطه‌ها می‌آیند، قدرت امر اول را ندارند. این اوامر که بر زبان رسولان به ما می‌رسند، بر دو قسم‌اند: یا ثوانی (دومی‌ها) هستند، که خداوند بدون واسطه فرشته، در نفس پیامبرش القا می‌کند؛ پس امر الهی به ما می‌رسد در حالی که از یک حضرت (مقام) کونی عبور کرده و حالتی را کسب نموده که پیش از آن نداشته است. زیرا اسماء الهی در این حضرت کونی آن را دریافت کرده و با احکام خود در حکم آن شریک شده‌اند. یا اینکه فرشته آن امر را بر پیامبر نازل می‌کند؛ در این صورت امر الهی از دو حضرت کونی (جبرئیل و هر فرشته‌ای که باشد، و هر پیامبری که باشد) عبور کرده است. پس فعل و اثر آن در قدرت، پایین‌تر از اول و دوم است. به همین دلیل مؤاخذه (بازخواست) به صورت تعجیل واقع نمی‌شود؛ یا مهلت تا آخرت داده می‌شود و یا غفران (آمرزش) شامل حال می‌شود و هرگز به خاطر آن مؤاخذه نمی‌شود. خداوند این کار را از روی رحمت به بندگانش انجام داد. همچنین خدای تعالی نهی را به آدم و حوا اختصاص داد. نهی یک تکلیف عملی نیست، زیرا متضمن یک امر عدمی است، یعنی «انجام نده». و از حقیقت ممکنات این است که انجام نمی‌دهند، پس گویی به او گفته شده: «از اصل خود جدا مشو». اما امر این‌گونه نیست، زیرا متضمن یک امر وجودی است، یعنی «انجام بده». پس گویی به او گفته شده: «از اصل خود خارج شو». بنابراین، امر بر نفس دشوارتر از نهی است، زیرا مکلف به خروج از اصل خود شده است. اگر ابلیس هنگامی که نافرمانی کرد و سجده ننمود، سخنانی را که از تکبر و فضیلت‌بخشی به خود نسبت به دیگری گفت، بر زبان نمی‌آورد، به همان اندازه از عبودیت خود خارج نمی‌شد و عقوبت خدا بر او نازل نمی‌گشت. اما عقوبت آدم و حوا به دلیل تکلیف خروج از اصلشان بود، که همان ترک (امر عدمی) بود، به سوی خوردن (امر وجودی). پس خداوند ابلیس و آدم و حوا را در یک ضمیر (مرجع جمع) شریک ساخت و این شدیدترین عقوبت بر آدم بود، که به صورت جمع به آن‌ها گفته شد: «اهبطوا» (فرود آیید). فرود آمدن عقوبت برای آدم و حوا نبود، بلکه عقوبت برای ابلیس بود. آدم به دلیل تحقق وعده الهی مبنی بر قرار دادن خلیفه در زمین، پس از توبه و برگزیده شدن و دریافت کلمات از پروردگارش با اعتراف، فرود آمد. اعتراف او (علیه‌السلام) در مقابل سخن ابلیس بود که گفت: «أَنَا خَيْرٌ مِنْهُ» (من از او بهترم). پس حق (الحق) مقام اعتراف نزد خدا و سعادتی را که از آن حاصل می‌شود، به ما شناساند تا آن را در مخالفت‌هایمان راه و روش خود سازیم؛ و ادعا و گفتار ابلیس را به ما شناساند تا از مانند آن هنگام مخالفت‌هایمان بپرهیزیم. حوا برای تناسل فرود آمد و ابلیس برای اغوا (گمراه کردن). پس فرود آدم و حوا، فرود کرامت بود و فرود ابلیس، فرود خواری، عقوبت و کسب گناهان. زیرا معصیت او مستلزم شقاوت ابدی نبود، چرا که او شرک نورزید، بلکه به آنچه خداوند او را بر آن آفریده بود افتخار کرد و شقی نوشته شده بود. و سرای شقاوت مخصوص اهل شرک است. پس خداوند او را به زمین فرود آورد تا شرک را با وسوسه در دل‌های بندگان سنت کند. هنگامی که مشرک شدند و ابلیس از مشرک و شرک تبری جست، تبری او سودی به حالش ندارد، زیرا او بود که به مشرک گفت: «اکفر» (کافر شو)، چنانکه خدای تعالی خبر داده است. پس گناه هر مشرکی در عالم بر گردن اوست. اگرچه ابلیس موحد باشد، اما هر کس سنت بدی را بنا نهد، گناه آن و گناه هر کس که بدان عمل کند، بر گردن اوست.\n\n### [شرک و توحید]\n\nشخص طبیعی، مانند ابلیس و فرزندان آدم، ناگزیر است که در نفس خود مثالی از آنچه می‌خواهد آشکار سازد، تصور کند. پس او شرک را سنت نکرد و بدان وسوسه ننمود مگر آنکه آن را در نفس خود به صورتی تصور کرد که اگر در نفس مشرک حاصل شود، صورت توحید از او زایل گردد. پس هنگامی که آن را در نفس خود به این صورت تصور کرد، توحید ضرورتاً از تصور او در نفسش خارج شده است؛ زیرا شریک در نفس او در کنار حق (الحق) که در نفس اوست، به صورت متخیل (از جهت علم به وجود آن) تصور شده است. پس او حق را در نفس خود تنها نگذاشت. بنابراین، ابلیس بدون شک و تردید در نفس خود مشرک بود. و ناگزیر است که بقای صورت شریک را در نفس خود حفظ کند تا با هر نفسی، مشرکان را بدان یاری رساند؛ زیرا او می‌ترسد که صفت شرک از آنان زایل شود و خدا را توحید کنند و سعادتمند گردند. پس ابلیس پیوسته صورت شرک را در نفس خود حفظ می‌کند و با آن، قلب‌های مشرکانی را که در آن زمان در شرق و غرب و جنوب و شمال هستند، مراقبت می‌کند و موحدان آینده را که مشرک نیستند، به سوی شرک باز می‌گرداند. پس ابلیس همیشه از شرک جدا نمی‌شود. به همین دلیل خداوند او را شقی ساخت، زیرا او نمی‌تواند حتی برای یک نفس، توحید را تصور کند، به دلیل ملازمت این صفت و حرص او بر بقای آن در نفس مشرک. زیرا اگر این صفت از نفس او برود، مشرک کسی را نمی‌یابد که در نفسش او را به شرک دعوت کند و شرک از او زایل می‌شود؛ و ابلیس نیز شریک را تصور نمی‌کند، زیرا صورت شریک از نفس او زایل شده است، و در نتیجه نمی‌داند که آن مشرک از شرک خود دست کشیده است. پس این دلالت می‌کند که شریک همیشه ابلیس را همراهی می‌کند. او اولین کسی است که به خدا شرک ورزید و اولین کسی است که شرک را سنت نهاد و شقی‌ترین جهانیان است. به همین دلیل از عین منت (بخشایش) به رحمت طمع می‌ورزد. و به همین دلیل گفتیم که عقوبت در حق آدم تنها در جمع شدن او با ابلیس در ضمیر (مرجع جمع) بود، آنجا که حق (الحق) با کلامی که شایسته جلال اوست، آن‌ها را به هبوط خطاب کرد. اما ناگزیر است که در کلام، صفتی باشد که لفظ ضمیر اقتضا می‌کند، زیرا صورت لفظ، معنای خاصی را می‌طلبد. و این روشی است که علما از آن غافل مانده‌اند.\n\n### [خطای عارفان و خطای عوام]\n\nما مسئله آدم را ذکر کردیم تا اهل الله (اولیای الهی) را دلداری دهیم که اگر از مقام خود لغزیدند و فرود آمدند، آن انحطاط لزوماً به شقاوت آن‌ها حکم نمی‌کند، بلکه هبوط آن‌ها مانند هبوط آدم خواهد بود. زیرا خداوند محدود و مقید نمی‌شود. و اگر امر بر این حد باشد و خداوند دارای این صفت عدم تقیید باشد، پس عین فرود آمدن ولی هنگام لغزش و آنچه از خواری، حیا و شکستگی در آن به او دست می‌دهد، عین ترقی به مقامی بالاتر از آنچه در آن بوده است. زیرا علو او به واسطه معرفت (المعرفة) و حال است، و ممکن است از علم به خدا چیزی بر او افزوده شود که پیش از آن نداشته است، و از حال (که همان خواری و شکستگی است) چیزی بر او عارض شود که پیش از آن بر آن نبوده است. و این عین ترقی به مقامی شریف‌تر است. پس اگر انسان در لغزش خود این حالت را از دست بدهد و پشیمان نشود، نشکند، خوار نگردد و از مقام پروردگارش نترسد، از اهل این طریقت نیست، بلکه همنشین ابلیس است. بلکه حال ابلیس از او بهتر است، زیرا به کسی که در کفر از او اطاعت می‌کند، می‌گوید: «إِنِّي بَرِي‏ءٌ مِنْكَ إِنِّي أَخافُ الله رَبَّ الْعالَمِينَ» (من از تو بیزارم، من از خدا، پروردگار جهانیان، می‌ترسم). و ما تنها درباره لغزش‌های اهل الله سخن می‌گوییم، هنگامی که از آن‌ها سر می‌زند. خدای تعالی فرمود: «ولَمْ يُصِرُّوا عَلى‏ ما فَعَلُوا» (و بر آنچه انجام داده‌اند اصرار نورزند). و رسول خدا (صلی الله علیه و سلم) فرمود: «الندم توبة» (پشیمانی توبه است).\n\nولی، هنگامی که در مقامی بود و حالی که بر آن بود و از آن لذت می‌برد، لذتش تنها به حال او بود، زیرا خداوند متعالی‌تر از آن است که از او لذت برده شود. پس هنگامی که لغزید و حالت خواری و شکستگی بر او عارض شد، ضرورتاً آن حالتی که از وجودش لذت می‌برد (که همان حالت طاعت و موافقت بود) زایل شد. هنگامی که آن را از دست داد، گمان می‌کند که از عین حق (الحق) فرود آمده است. در حالی که آن حالت چون از او زایل شد، او از آن حالت فرود آمد، زیرا آن حالتی بود که رفعت را اقتضا می‌کرد. اما او اکنون در معراج خواری، پشیمانی، فقر، شکستگی، اعتراف، ادب با خدای تعالی و حیا از اوست. پس او در این معراج ترقی می‌کند و این بنده در نهایت این معراج، حالی شریف‌تر از حالتی که بر آن بود، می‌یابد. در آن هنگام می‌داند که فرود نیامده، بلکه ترقی کرده است، در حالی که خود متوجه ترقی‌اش نیست. و خداوند این را از اولیای خود پنهان داشت تا در مخالفت‌ها بر او جرأت نورزند، همان‌گونه که استدراج (فریب تدریجی) را در کسی که شقی‌اش ساخته، پنهان داشت و فرمود: «سَنَسْتَدْرِجُهُمْ من حَيْثُ لا يَعْلَمُونَ» (به تدریج آنان را از جایی که نمی‌دانند، به ورطه هلاکت می‌کشانیم). پس آن‌ها همان‌گونه‌اند که خدای تعالی درباره‌شان فرمود: «وهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعاً» (و گمان می‌کنند که کار نیکو انجام می‌دهند). همچنین خداوند سبحان، تقرب و عنایت خود را در کسی که سعادتمندش ساخته، پنهان داشت، به واسطه آنچه خداوند او را بدان مشغول کرده است، از گریه بر گناهش و مشاهده لغزشش و نگریستن به آن در کتابش. و او غافل است از اینکه آن پشیمانی، ترقی نزد خدا را به او می‌بخشد، زیرا خداوند او را به قبول توبه بشارت نداده است. پس او وقوع لغزش را محقق می‌داند و شکستگی و حیا از آنچه در آن واقع شده است، بر او حاکم است، اگرچه خداوند او را به آن گناه مؤاخذه نکند. پس استدراج (فریب تدریجی) در خیر و شر و در سعادتمندان و شقاوتمندان حاصل است. در شهر فاس مردی را دیدم که اندوهی بر او بود، گویی در کوره کار می‌کند. از ابوالعباس حصار که از بزرگان شیوخ بود، درباره او پرسیدم، زیرا دیدم که با او همنشین است و به او میل دارد. او به من گفت: این مردی بود که در مقامی بود و از آن فرود آمد. پس در این مقام بود و از حیا و شکستگی به حالتی رسیده بود که سکوت از سخن گفتن با خلق بر او واجب شده بود. من پیوسته با چنین داروهایی با او مدارا کردم و بیماری آن لغزش را با چنین درمانی از او زایل ساختم. او خود را در اختیار من قرار داده بود. پس پیوسته با او بودم تا آن دارو در اعضای او سرایت کرد و چهره‌اش گشاده شد و دری به سوی پذیرش در عین قلبش گشوده شد. با این حال، حیا همچنان ملازم او بود. و همچنین شایسته است که لغزش‌های بزرگان غالباً فرود آمدن به مباحات باشد و نه غیر آن، و به ندرت کبائر (گناهان بزرگ) از آن‌ها سر می‌زند. از ابویزید بسطامی (رضی الله عنه) پرسیده شد: آیا عارف معصیت می‌کند؟ فرمود: «وكانَ أَمْرُ الله قَدَراً مَقْدُوراً» (و فرمان خدا تقدیری حتمی است). منظورش این است که معصیت آن‌ها به حکم قدر نافذ در آن‌هاست، نه اینکه قصد هتک حرمت‌های الهی را داشته باشند. آن‌ها به حمد خدا، هنگامی که اولیای خدا (الحق) هستند، در این مقام معصوم‌اند و اصلاً معصیتی از آن‌ها سر نمی‌زند که هتک حرمت خدا باشد، مانند معاصی دیگران؛ زیرا ایمانی که در قلب‌ها نوشته شده، مانع از آن می‌شود. پس برخی از آن‌ها از روی غفلت معصیت می‌کنند و برخی دیگر با حضور (آگاهی) و از روی کشف (الکشف) الهی مخالفت می‌کنند، که خداوند در آن، آنچه را که بر او مقدر کرده، پیش از وقوع به او شناسانده است. پس او بر بصیرت از امر خود و حجت از جانب پروردگارش است. و این حالت به منزله بشارت در قول خداوند است: «لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ» (تا خداوند گناهان گذشته و آینده تو را بیامرزد). پس خداوند او را از گناهان واقع شده‌ای که آمرزیده شده‌اند، آگاه ساخته است. پس آن گناهان هیچ حکم و سلطه‌ای بر او ندارند، زیرا هنگامی که زمان ظهور آن‌ها فرا می‌رسد، اسم «غفار» همراه آن‌هاست. پس آن گناهان بر بنده نازل می‌شوند و «غفار» حکم آن‌ها را می‌پوشاند. پس مانند کسی است که در آتش افکنده می‌شود و نمی‌سوزد، مانند ابراهیم (علیه‌السلام) که در آتش بود و به واسطه حجابی که مانع بود، آتش بر او حکمی نداشت. همچنین لغزش عارف صاحب مقام کشف (الکشف) نسبت به مقدرات، مصیبت بر او نازل می‌شود، در حالی که حکم آن مصیبت از او دور است و در مقام او تأثیری نمی‌گذارد. بر خلاف کسی که مصیبت بر او نازل می‌شود و او بر غیر بینه و بصیرت نسبت به آنچه بر او مقدر شده است، قرار دارد. این شخص حیا، پشیمانی و خواری را ملازم خود می‌سازد، در حالی که آن عارف چنین نیست. و در اینجا اسرار الهی وجود دارد که بیان آن‌ها برای ما میسر نیست.\n\n### [بساط و عدم انبساط یا عبادت و عبودیت]\n\nپس از آنکه مراتب آن‌ها را در این مقام به تو فهماندیم و میان معصیت عارفان و معاصی عوام از علمای رسوم (ظاهرگرا) و مقلدانشان فرق گذاشتیم، بدان که از برخی از آن‌ها حکایت شده است که گفت: «بر بساط بنشین» (منظورش بساط عبادت است) و «از انبساط بپرهیز». یعنی ملتزم باش به آنچه حقیقت عبودیت (العبودية) اقتضا می‌کند، از آن جهت که به اموری مکلف شده است که مولایش برای او حد و مرز تعیین کرده است. زیرا اگر آن امور نبود، مقام عبودیت، ادلال (ناز و دلبری)، فخر و غرور را اقتضا می‌کرد، به خاطر مقام کسی که بنده اوست و منزلت او. همان‌گونه که روزی عتبه غلام فخر و غرور ورزید. به او گفته شد: این چه غروری است که در شمایل تو می‌بینیم و پیش از این از تو شناخته نمی‌شد؟ گفت: چگونه غرور نورزم، در حالی که مولایی برای من شده و من بنده او گشته‌ام؟ آنچه بندگان را از ادلال باز داشته و مانع شده که در دنیا مانند آخرت باشند، تنها تکلیف (الزامات شرعی) است. پس آن‌ها به اوامر مولای خود مشغول‌اند تا از آن‌ها فارغ شوند. هنگامی که دیگر شغلی برایشان باقی نماند، در مقام ادلال که عبودیت اقتضا می‌کند، می‌ایستند. و این جز در سرای آخرت نخواهد بود، زیرا تکلیف در سرای دنیا با هر نفسی همراه آن‌هاست. پس هر صاحب ادلالی در این دنیا، به اندازه ادلالش از معرفت (المعرفة) به خدا کاسته شده است و هرگز به درجه دیگری که ادلال ندارد، نمی‌رسد؛ زیرا در حال ادلال، نفس‌های بسیاری از او فوت شده و از تکلیفی که در آن نفس‌ها بر او واجب بوده و اشتغال به آن با ادلال منافات دارد، غافل مانده است. پس دنیا سرای ادلال نیست. آیا نمی‌بینی عبدالقادر گیلانی را که با وجود ادلالش، هنگامی که وفاتش فرا رسید و آن مقدار زمانی از نفس‌هایش در این دنیا باقی مانده بود، گونه خود را بر زمین نهاد و اعتراف کرد که آنچه اکنون در آن است، همان حقیقتی است که بنده باید در این دنیا بر آن باشد؟ و سبب آن این بود که او در اوقاتی صاحب ادلال بود، به خاطر آنچه حق (الحق) از حوادث اکوان به او می‌شناساند. و خداوند ابوالسعود، شاگرد او را از آن ادلال معصوم داشت. پس او عبودیت مکلفه را با هر نفسی تا هنگام مرگش ملازمت کرد. و حکایت نشده است که حال او هنگام مرگ تغییر کرده باشد، همان‌گونه که حال شیخ او عبدالقادر تغییر کرد. و فرد مورد اعتماد نزد ما حکایت کرد که شنیدم می‌گفت: راه عبدالقادر در میان راه‌های اولیا غریب است و راه ما در میان راه‌های عبدالقادر غریب است. خداوند از همه آن‌ها راضی باشد و ما را به واسطه آن‌ها بهره‌مند سازد. و خداوند ما را از مخالفت‌ها معصوم بدارد، اگرچه بر ما مقدر شده باشند. پس از خداوند می‌خواهم که ما را در ارتکاب آن‌ها بر بصیرت قرار دهد تا به واسطه آن، درجات ما ارتقا یابد. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}