{
  "id": 405,
  "title": {
    "ar": "الباب الخامس وأربعمائة في معرفة منازلة من جعل قلبه بيتي وأخلاه من غيري أحد ما يدري أحد ما أعطيه فلا تشبهوه بالبيت المعمور فإنه بيت ملائكتي لا بيتي ولهذا لم أسكن فيه خليلي إبراهيم ع",
    "en": "Chapter 405: Concerning the Knowledge of the Station of him who made his heart My House and emptied it of all but Me. No one knows what I bestow upon him, so do not liken it to the Frequented House (البيت المعمور), for that is the House of My Angels, not My House. And for this reason, I did not cause My Intimate Friend (خليلي) Abraham (peace be upon him) to dwell therein.",
    "ur": "باب چار سو پانچ: اس شخص کے مقام (منزلة) کی معرفت کے بیان میں جس نے اپنے دل کو میرا گھر بنایا اور اسے میرے غیر سے خالی کر دیا۔ کوئی نہیں جانتا کہ میں اسے کیا عطا کرتا ہوں۔ پس اسے بیت المعمور (البيت المعمور) سے مشابہت نہ دو، کیونکہ وہ میرے فرشتوں کا گھر ہے، میرا گھر نہیں۔ اور اسی وجہ سے میں نے اپنے خلیل ابراہیم علیہ السلام کو اس میں نہیں بسایا۔",
    "fa": "باب چهارصد و پنجم در معرفت منزلت (منازلة) کسی که قلبش را خانه من قرار داد و آن را از غیر من خالی ساخت. هیچ کس نمی‌داند چه چیزی به او عطا می‌کنم. پس آن را به بیت المعمور (البيت المعمور) تشبیه نکنید، زیرا آن خانه فرشتگان من است، نه خانه من. و به همین دلیل، خلیل خود ابراهیم (ع) را در آن ساکن نساختم."
  },
  "content": {
    "ar": "## «الباب الخامس وأربعمائة في معرفة منازلة من جعل قلبه بيتي وأخلاه من غيري أحد ما يدري أحد ما أعطيه فلا تشبهوه بالبيت المعمور فإنه بيت ملائكتي لا بيتي ولهذا لم أسكن فيه خليلي إبراهيم ع»\n\n\n> القلب بيتك لا بيتي فاعمره *** فلست أذكر شيئا أنت تذكره‏\n\n\n> ذكري لنفسي حجاب إن ذكرك لي *** هو السرور الذي بالحسن تغمره‏\n\n\n> إذا ذكرتك كان الذكر منك لنا *** فلست تذكر أمرا نحن نذكره‏\n\n\n> إن الخليل بظهر البيت مسكنه *** من أجل قلب له ما زلت تعمره‏\n\n\n> فلو يحل به لكنت تابعه *** وليس يسكنه فلست تعمره‏\n\n\n> فالحمد لله حمدا لا يفوه به *** إلا الذي هو في قلبي يصوره‏\n\n\n### [إن قلب المؤمن أوسع من رحمة الله‏]\n\n\nاعلم أيدنا الله وإياك بروح القدس أن رحمة الله وَسِعَتْ كُلَّ شَيْ‏ءٍ ومن رحمته إن خلق الله بها قلب عبده وجعله أوسع من رحمته فإن قلب المؤمن وسع الحق كما\n\n\nورد أن الله يقول ما وسعني أرضي ولا سمائي ووسعني قلب عبدي المؤمن‏\n\n\nفرحمته مع اتساعها يستحيل أن تتعلق به أو تسعه فإنها وإن كانت منه فلا تعود عليه وما أحال تعالى عليه أن يسعه قلب عبده وذلك أنه الذي يفقه عن الله ويعقل عنه وقد أمره بالعلم به وما أمره إلا بما يمكن أن يقوم به فيكون الحق معلوما معقولا للعبد في قلبه ولا يتصف بأنه تعالى مرحوم فهذا يدلك على إن الرحمة لا تناله من خلقه كما يناله التقوى أعني تقوى القلوب كما قال ولكِنْ يَنالُهُ التَّقْوى‏ مِنْكُمْ وقال فَإِنَّها يعني شعائر الله وهي ضرب من العلم به من تَقْوَى الْقُلُوبِ وقال تعالى فَتَكُونَ لَهُمْ قُلُوبٌ يَعْقِلُونَ بِها وما جعلها عقلا إلا ليعقل عنه العبد بها ما يخاطبه به ومما خاطبه به إن رحمته وَسِعَتْ كُلَّ شَيْ‏ءٍ وأن قلبه وسعه جل جلاله إلا أن ثم سرا أشير إليه ولا أبسطه وهو أن الله أخبر أنه أحب أن يعرف ومقتضى الحب معروف فخلق‏\nالخلق وتعرف إليهم فعرفوه فما عرفوه بنظرهم وإنما عرفوه بتعريفه إياهم فهذي إشارة لِمَنْ كانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ والمحبة علم ذوق وما فينا إلا محب ومن أحب عرف مقتضى الحب فمن هنا تعرف عموم الرحمة والحديث الآخر غضب الله الكائن من إغضاب العبد ثم‏\n\n\nقال عنه التراجمة عليه السلام في باب الشفاعة إذا سألوهم الخلق فيها يوم القيامة فيقولون إن الله قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغصب بعده مثله فزال الغضب بالانتقام‏\n\n\nوأخبر صَلَّى اللهُ عَليهِ وسَلَّم أن الصدقة تطفئ غضب الرب‏\n\n\nوهو الموفق عبده لما تصدق به فهو المطفئ غضبه بما وفق إليه عبده وهذا كثير لكن هذا القدر عند عباد الله منه فإنا لا نزيد عليه لأنا ما عرفناه إلا بتعريفه وهذا من جملة تعريفه لا من نظر المخلوق فلما اتخذ الله قلب عبده بيتا لأنه جعله محل العلم به العرفاني لا النظري حماه وغار عليه أن يكون محلا لغيره والعبد جامع فلا بد أن يظهر الحق تعالى لهذا العبد في صور شتى أي في صورة كل شي‏ء لأنه محل للعلم بكل شي‏ء وليس محل العلم بالأشياء إلا القلب والحق يغار على قلب عبده أن يكون فيه غير ربه فاطلعه أنه صورة كل شي‏ء وعين كل شي‏ء فوسع كل شي‏ء قلب العبد لأن كل شي‏ء حق فما وسعه إلا الحق فمن علم الحق من حقيته فقد علم كل شي‏ء وليس من علم شيئا علم الحق وعلى الحقيقة فما علم‏\n\n\nالعبد ذلك الشي‏ء الذي يزعم أنه علمه لأنه لو علمه علم أنه الحق فلما لم يعلم أنه الحق قلنا فيه إنه لم يعلمه وإنما قال قلب المؤمن لا غير المؤمن لكون المعرفة بالله لا تكون إلا بتعريفه لا بحكم النظر الفكري ولا يقبل تعريفه به تعالى إلا المؤمن فإن غير المؤمن لا يقبل ذلك جملة واحدة فإنه الناظر على أحد ثلاثة أمور إما أن يحيل ذلك الذي ورد به التعريف على الحق فينقسم هنا المحيلون على أقسام فمنهم من يطعن في الرسل ويجعلهم تحت سلطان الخيال وهذه الطائفة من الأخسرين الذين أضلهم الله وأعماهم عن طريق الهدى بل في طريق الهدى لو علموا فهؤلاء قد جمعوا بين الجهل وبين المروق من الدين فلا حظ لهم في السعادة وقسم آخر منهم قالوا إن الرسل هم أعلم الناس بالله فتنزلوا في الخطاب على قدر أفهام الناس لا على ما هو الأمر عليه فإنه محال فهؤلاء كذبوا الله ورسوله فيما نسب الله إلى نفسه وإلى رسله بحسن عبارة كما يقول الإنسان إذا أراد أن يتأدب مع شخص آخر إذا حدثه بحديث يرى السامع في نظره أنه ليس كما قال المخبر فلا يقول له كذبت وإنما يقول له يصدق سيدي ولكن ما هو الأمر على هذا وإنما الأمر الذي ذكره سيدي على صورة كذا وكذا فهو يكذبه ويجهله بحسن عبارة هكذا فعل هؤلاء المتأولين وقسم آخر لا يقول بأنه نزل في العبارة إلى أفهام الناس وإنما يقول ليس المراد بهذا الخطاب إلا كذا وكذا ما المراد منه ما تفهمه العامة وهذا موجود في اللسان الذي جاء به هذا الرسول فهؤلاء أشبه حالا ممن تقدم إلا أنهم متحكمون في ذلك على الله بقولهم هذا هو المفهوم من اللسان وكذلك الذي يعتقده عامة ذلك اللسان هو أيضا المفهوم من ذلك فما يمنع أن يكون المجموع فأخطئوا في الحكم على الله بما لم يحكم به على نفسه فهؤلاء ما عبدوا إلا الإله الذي ربطت عليه عقولهم وقيدته وحصرته وقسم آخر قال نؤمن بهذا اللفظ كما جاء من غير أن نعقل له معنى حتى نكون في هذا الايمان به في حكم من لم يسمع به ونبقى على ما أعطانا دليل العقل من إحالة مفهوم هذا الظاهر من هذا القول فهذا القسم متحكم أيضا بحسن عبارة وإنه رد على الله بحسن عبارة فإنهم جعلوا نفوسهم حكم نفوس لم تسمع ذلك الخطاب وقسم آخر قالوا نؤمن بهذا اللفظ على حد علم الله فيه وعلم رسوله صَلَّى اللهُ عَليهِ وسَلَّم فهؤلاء قد قالوا إن الله خاطبنا عبثا لأنه خاطبنا بما لا نفهم والله يقول وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ وقد جاء بهذا فقد أبان كما قال الله لكن أبي هؤلاء أن يكون ذلك بيانا وهؤلاء كلهم مسلمون وأما الأمر الثالث فهم الذين كشف الله عن أعين بصائرهم غطاء الجهل فأشهدهم آيات أنفسهم وآيات الآفاق ف يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ لا غيره فآمنوا به بل علموه بكل وجه وفي كل صورة وإِنَّهُ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ فلا يرى العارف شيئا إلا فيه فهو ظرف إحاطة لكل شي‏ء وكيف لا يكون وقد نبه على ذلك باسمه الدهر فدخل فيه كل ما سوى الله فمن رأى شيئا فما رآه إلا فيه ولذلك قال الصديق ما رأيت شيئا إلا رأيت الله قبله لأنه ما رآه حتى دخل فيه فبالضرورة يرى الحق قبل الشي‏ء بعينه لأنه يرى صدور ذلك الشي‏ء\n\n\nمنه فالحق بيت الموجودات كلها لأنه الوجود وقلب العبد بيت الحق لأنه وسعه ولكن قلب المؤمن لا غير\n\n\n> فمن كان بيت الحق فالحق بيته *** فعين وجود الحق عين الكوائن‏\nوما حاز المؤمن هذه السعة إلا بكونه على صورة العالم وعلى صورة الحق وكل جزء من العالم ما هو على صورة الحق فمن هنا وصفه الحق بالسعة قال أبو يزيد البسطامي في سعة قلب العارف لو أن العرش يعني ملك الله وما حواه من جزئيات العالم وأعيانه مائة ألف ألف مرة لا يريد الحصر وإنما يريد ما لا يتناهى ولا يبلغه المدى فعبر عنه بما دخل في الوجود ويدخل أبدا في زاوية من زوايا قلب العارف ما أحس به وذلك لأن قلبا وسع القديم كيف يحس بالمحدث موجودا وهذا من أبي يزيد توسع على قدر مجلسه لإفهام الحاضرين وأما التحقيق في ذلك أن يقول إن العارف لما وسع الحق قلبه وسع قلبه كل شي‏ء إذ لا يكون شي‏ء إلا عن الحق فلا تتكون صورة شي‏ء إلا في قلبه يعني في قلب ذلك العبد الذي وسع الحق‏\n\n\n> فهو الهيولى لكل صورة *** من صورة صورة وسورة\n\n\n> وأنت ما بين ذا وهذا *** أقامك الحق فيه سورة\n\n\nوينظر إلى قول أبي يزيد ما قال الجنيد أن المحدث إذا قرن بالقديم لم يبق له أثر إلا أن قول الجنيد هنا أتم من قول أبي يزيد فإن المحدث إذا قرنته بالقديم كان الأثر للقديم لا للمحدث فتبين لك بهذه المقارنة ما هو الأمر عليه وهو ما قلناه فإنه لا يمكن أن يجهل الأثر وإنما كان قبل هذه المقارنة ينسب إلى المحدث فلما قرنه بالقديم رأى الأثر من القديم ورأى المحدث عين الأثر فقال ما قال ولا نشك بعد أن تقرر هذا أن الخليل إبراهيم عليه السلام بهذه المثابة هو والرسول صلوات الله عليهم قد وسع قلبه الحق فجعله تعالى مسندا ظهره إلى البيت المعمور وما دخله لأنه لو دخله لوسع البيت المعمور الحق لأنه قد وسع من وسعه وهي إشارة لا حقيقة فإن جسم إبراهيم عليه السلام محصور بجيرون بلا شك فما نريد إلا الصورة التي هو عليها في البرزخ الذي انتقل إليه بالموت وأما قوله وأخلاه من غيري هوقوله عليه السلام فيمن يقرأ القرآن من شغله ذكري‏\n\n\nيعني القرآن يقرأه العبد عن مسألتي أعطيته أفضل ما أعطى السائلين قال تعالى إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وهو القرآن وقال فَسْئَلُوا أَهْلَ الذِّكْرِ يعني أهل القرآن لأنه قال ما فَرَّطْنا في الْكِتابِ من شَيْ‏ءٍ فهو الجامع لكل شي‏ء فمن اعتقد غير أوجب عليه أن يخلي قلبه للحق والناس يتفاضلون في الدرجات فإن الله قد فضل العالم بعضه على بعض وأفضل المفاضلة فضل العلم بالله أ لا تراه قد أعطاه تعالى أعني للإنسان بمنزلة الاسم الآخر الذي لله وأعطى نفسه تعالى الاسم الأول في رتبة العلم به وجعل الملك محاطا به بين الأول والآخر فمن كان له علم بالمراتب علم ما للملك من الله وما له من الإنسان ولهذا كان الملك وهو الروح الأمين يأتي بالوحي من الاسم الأول الذي لله إلى العبد الكامل الرسول النازل في منزل الاسم الإلهي الآخر وهو قوله تعالى شَهِدَ الله فبدأ بنفسه في الشهادة بتوحيده ثم ذكر الملائكة ثم ذكر بعد الملائكة أولي العلم وهم الأناسي ف لِلَّهِ الْأَمْرُ من قَبْلُ ومن بَعْدُ والملك ما بينهما وهكذا كان أمر الوجود فالأولية للحق ثم أوجد الملك ثم أوجد الإنسان وأعطاه الخلافة ولم يعطها الملك لأن الوسط له وكل وسط فهو محاط به فافهم فصورة فضل الملك على الإنسان بما أتاه به من عند الله وليس ذلك بدليل قاطع على الفضيلية في العقل وفي اللسان كما إن خلق السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ لأن الناس في رتبة الانفعال عن حركة الأفلاك وقبول التكوين الذي في العناصر فما ثم إلا وجوه خاصة وما ثم وجه محيط فمن وجه يفضل ومن وجه يكون مفضولا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 405: Concerning the Gnosis of the Station of the one who made his Heart My House and emptied it of all but Me. No one knows what I bestow upon him. Therefore, do not liken it to the Frequented House (البيت المعمور), for that is the house of My angels, not My House. This is why I did not cause My Intimate Friend (خليلي) Abraham (peace be upon him) to dwell therein.\n\nThe heart is your house, not My House, so inhabit it,\nFor I do not mention anything that you mention.\n\nMy remembrance of Myself is a veil, but your remembrance of Me\nIs the joy that you overwhelm with beauty.\n\nWhen I remember you, the remembrance is from Us to you,\nFor you do not mention a matter that We mention.\n\nThe Intimate Friend (الخليل) has his dwelling behind the House,\nBecause of a heart belonging to him that You have continuously inhabited.\n\nIf he were to dwell in it, You would be his follower,\nBut he does not dwell in it, so You do not inhabit it.\n\nSo praise belongs to Allah, a praise that none utters\nExcept the one who pictures Him in my heart.\n\n### [Indeed, the Heart of the Believer is Vaster than the Mercy of Allah]\n\nKnow, may Allah support us and you with the Holy Spirit (روح القدس), that the Mercy of Allah encompasses all things (وَسِعَتْ كُلَّ شَيْ‏ءٍ). And it is from His Mercy that Allah created the heart of His servant and made it vaster than His Mercy. For the heart of the believer encompasses The Real (الحق), as is related: that Allah says, \"My earth and My heaven did not encompass Me, but the heart of My believing servant did encompass Me.\"\n\nHis Mercy, despite its vastness, is impossible for The Real to be related to or encompassed by, for even though Mercy originates from Him, it does not return upon Him. Yet, He has made it possible for the heart of His servant to encompass Him. This is because the servant understands and comprehends from Allah, and He commanded the servant to have Knowledge (العلم) of Him. He only commanded him with what he is capable of fulfilling. Thus, The Real (الحق) is known and comprehended by the servant in his heart, but He is not described as being the object of Mercy (مرحوم). This indicates that Mercy does not reach Him from His creation, unlike Piety (التقوى)—meaning the piety of hearts—as He said: <<وَلَكِنْ يَنالُهُ التَّقْوى‏ مِنْكُمْ>> (but what reaches Him is the piety from you). And He said concerning the rituals of Allah (شعائر الله), which are a form of Knowledge (العلم) of Him: <<فَإِنَّها مِنْ تَقْوَى الْقُلُوبِ>> (then indeed, it is from the piety of the hearts). And the Exalted said: <<فَتَكُونَ لَهُمْ قُلُوبٌ يَعْقِلُونَ بِها>> (so that they may have hearts by which they reason). He only made it intellect (عقلا) so that the servant might comprehend through it what He addresses him with. And among what He addresses him with is that His Mercy encompasses all things (وَسِعَتْ كُلَّ شَيْ‏ءٍ) and that his heart encompasses Him, exalted is His Majesty.\n\nHowever, there is a secret (سر) here that I will allude to but not elaborate upon: Allah informed us that He loved to be known. The implication of love is known, so He created Creation (الخلق) and introduced Himself to them, and they knew Him. They did not know Him through their own speculation, but rather through His introduction of Himself to them. This is an allusion for <<لِمَنْ كَانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وَهُوَ شَهِيدٌ>> (whoever has a heart or lends an ear while he is a witness). Love is the Knowledge (علم) of tasting (ذوق), and there is none among us except a lover. And whoever loves knows the implication of love. From this perspective, you understand the universality of Mercy and the other Hadith concerning the wrath of Allah that arises from the servant's provocation.\n\nThen the translators (التراجمة) (peace be upon them) spoke about it in the chapter on Intercession (الشفاعة) when Creation asks them for it on the Day of Resurrection. They say: \"Indeed, Allah is angry today with a wrath He has never been angry with before, nor will He be angry with after.\" Thus, the wrath is removed by retribution (الانتقام).\n\nAnd the Prophet (peace and blessings of Allah be upon him) informed us that charity (الصدقة) extinguishes the wrath of the Lord.\n\nAnd He is the One who grants success (الموفق) to His servant in what he gives in charity. Thus, He extinguishes His wrath through what He has enabled His servant to do. This is extensive, but this much is sufficient for the servants of Allah, for we do not add to it, as we only know Him through His introduction of Himself. This is part of His introduction, not from the speculation (نظر) of the created being. Since Allah took the heart of His servant as a House, because He made it the locus of Gnostic Knowledge (العلم العرفاني), not speculative knowledge (لا النظري), He protected it and became jealous (غار) over it, lest it become a locus for other than Him. The servant is comprehensive, so The Real (الحق) must manifest to this servant in various forms—that is, in the form of everything—because the heart is the locus for the Knowledge (العلم) of everything. The locus of the Knowledge of things is none other than the heart. The Real is jealous over the heart of His servant, lest anything other than his Lord be in it. So, He informed the servant that He is the image (صورة) of everything and the very Essence (عين) of everything. Thus, the heart of the servant encompassed everything, because everything is The Real (حق). Therefore, nothing encompassed it except The Real. Whoever knows The Real from His Reality has known everything. It is not the case that whoever knows a thing knows The Real. In reality, the servant has not known that thing which he claims to know, because if he had known it, he would have known that it is The Real. Since he did not know that it is The Real, we say concerning him that he did not know it.\n\nHe only said \"the heart of the believer\" and not the non-believer because Gnosis (المعرفة) of Allah only occurs through His introduction of Himself, not through the judgment of speculative thought (النظر الفكري). Only the believer accepts His introduction of Himself. The non-believer rejects this entirely, for he is one who speculates based on one of three matters:\n\n1.  He attributes the definition that came concerning The Real (الحق) to impossibility. Here, those who attribute impossibility are divided into groups. Some of them slander the Messengers and place them under the dominion of Imagination (الخيال). This group is among the greatest losers (الأخسرين) whom Allah has led astray and blinded from the path of guidance—or rather, they are on the path of guidance, if they but knew. These have combined ignorance with apostasy (المروق) from the religion, and they have no share in felicity.\n2.  Another group said that the Messengers are the most knowledgeable people concerning Allah, but they lowered their discourse to the level of people's understanding, not according to the reality of the matter, for that is impossible. These have lied against Allah and His Messenger concerning what Allah attributed to Himself and to His Messengers, albeit with polite phrasing. This is like when a person, wishing to be courteous to another, hears a statement that he perceives is not as the speaker described. He does not say to him, \"You lied,\" but rather says, \"My master speaks truly, but the matter is not exactly like this. Rather, the matter my master mentioned is in the form of such-and-such.\" Thus, he calls him a liar and ignorant with polite phrasing. This is what these interpreters (المتأولين) have done.\n3.  A third group does not say that the Messenger lowered the expression to the level of people's understanding, but rather says, \"The intent of this discourse is only such-and-such, and not what the common people understand.\" This is possible within the language (اللسان) through which this Messenger came. These are similar in state to those who preceded them, except that they are imposing their judgment upon Allah by saying, \"This is what is understood from the language.\" Likewise, what the common people of that language believe is also understood from it. What prevents the totality from being the case? They erred in judging Allah with what He did not judge Himself. These have only worshipped the god that their intellects have bound, restricted, and confined.\n4.  Another group said, \"We believe in this wording as it came, without comprehending its meaning, so that in this belief, we are in the position of one who has not heard it. We remain upon what the evidence of the intellect gives us, which is the attribution of impossibility to the apparent meaning of this saying.\" This group is also imposing its judgment, albeit with polite phrasing, and it is a rejection of Allah with polite phrasing. For they have made themselves the judge, like souls who have not heard that discourse.\n5.  Another group said, \"We believe in this wording according to the Knowledge (علم) Allah has of it and the Knowledge of His Messenger (peace and blessings of Allah be upon him).\" These have said that Allah addressed us in vain, because He addressed us with what we do not understand. Yet Allah says: <<وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ>> (And We did not send any messenger except with the language of his people, so that he might make clear to them). And He came with this, so He made it clear, as Allah said. But these people refused that it should be a clarification. All of these are Muslims.\n\nAs for the third matter, these are those whose eyes of insight (بصائرهم) Allah removed the veil of ignorance (غطاء الجهل) from. He made them witness the signs (آيات) within themselves and the signs in the horizons, <<فَيَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ>> (so that it becomes clear to them that it is The Real) and nothing else. They believed in Him; rather, they knew Him in every aspect and in every form, <<وَإِنَّهُ بِكُلِّ شَيْءٍ مُحِيطٌ>> (and indeed, He encompasses all things). The Gnostic (العارف) sees nothing except in Him. He is the vessel of encompassing (ظرف إحاطة) for everything. How could it be otherwise, when He drew attention to this through His Name, Time (الدهر)? Everything other than Allah entered into it. So, whoever sees a thing only sees it in Him. That is why the Veracious One (الصديق) said, \"I did not see a thing except that I saw Allah before it,\" because he did not see it until it entered into Him. Thus, he necessarily sees The Real before the thing itself, because he sees the emanation of that thing from Him.\n\nThe Real (الحق) is the House of all Existents (الموجودات) because He is Existence (الوجود). And the heart of the servant is the House of The Real because it encompassed Him, but only the heart of the believer.\n\nSo whoever is the House of The Real, The Real is his house,\nFor the very Essence of the Existence of The Real is the Essence of all Existents (الكوائن).\n\nThe believer did not attain this vastness except by being upon the Image (صورة) of the World (العالم) and upon the Image of The Real (الحق). Every part of the World is not upon the Image of The Real. From this perspective, The Real described him with vastness. Abu Yazid al-Bistami spoke concerning the vastness of the Gnostic's heart: \"If the Throne (العرش)—meaning the dominion of Allah and what it contains of the particulars and fixed entities (أعيانه) of the World—were repeated a hundred thousand thousand times,\" (he does not intend enumeration, but rather what is endless and beyond measure, expressing it through what has entered into Existence and will enter forever), \"it would fit into a corner of the Gnostic's heart without him sensing it.\" This is because how can a heart that encompassed the Eternal (القديم) sense the created (المحدث) as existent? This statement by Abu Yazid was an expansion suited to his audience to make the attendees understand. As for the verification of this, one should say that when the heart of the Gnostic encompassed The Real, his heart encompassed everything, since nothing exists except through The Real. Thus, the form (صورة) of anything is only constituted in his heart—meaning in the heart of that servant who encompassed The Real.\n\nSo he is the Prime Matter (الهيولى) for every form,\nFrom the form of a form and a chapter (سورة).\n\nAnd you, between this and that,\nThe Real established you therein as a chapter (سورة).\n\nConsider Abu Yazid's saying in light of what Junayd said: that when the created (المحدث) is juxtaposed with the Eternal (القديم), no trace of it remains. However, Junayd's saying here is more complete than Abu Yazid's, for when you juxtapose the created with the Eternal, the effect belongs to the Eternal, not to the created. Through this comparison, the reality of the matter becomes clear to you, which is what we have stated. It is impossible for the effect to be unknown. It was only attributed to the created before this comparison. When he juxtaposed it with the Eternal, he saw the effect originating from the Eternal and saw the created as the very Essence of the effect. Thus, he said what he said.\n\nAfter this is established, we do not doubt that the Intimate Friend Abraham (عليه السلام), along with the Messenger (peace and blessings of Allah be upon them), is of this rank: his heart encompassed The Real. Therefore, the Exalted made him lean his back against the Frequented House (البيت المعمور) but did not enter it. Had he entered it, the Frequented House would have encompassed The Real, because it would have encompassed the one who encompassed Him. This is an allusion (إشارة), not a reality, for the physical body of Abraham (عليه السلام) is undoubtedly confined to Jiyrun. We only intend the form (صورة) he is upon in the Isthmus (البرزخ) to which he transitioned through death.\n\nAs for His saying, \"and emptied it of all but Me (أخلاه من غيري),\" this refers to the saying of the Prophet (peace be upon him) concerning the one who recites the Quran: \"Whoever is preoccupied by My Remembrance (ذكري)—meaning the Quran—from asking Me, I grant him the best of what I grant the petitioners.\" The Exalted said: <<إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ>> (Indeed, We Ourselves have sent down the Remembrance), which is the Quran. And He said: <<فَاسْأَلُوا أَهْلَ الذِّكْرِ>> (So ask the People of the Remembrance), meaning the People of the Quran, because He said: <<مَا فَرَّطْنَا فِي الْكِتَابِ مِنْ شَيْءٍ>> (We have not neglected anything in the Book). Thus, it is the comprehensive container of everything. Whoever believes this is obligated to empty his heart for The Real (الحق).\n\nPeople differ in degrees (الدرجات), for Allah has favored some parts of the world over others. The greatest favor is the favor of Knowledge (العلم) of Allah. Do you not see that the Exalted granted it—meaning to the human—the station of the Last Name (الاسم الآخر) that belongs to Allah, and He granted Himself the First Name (الاسم الأول) in the rank of Knowledge of Him? He made the Angel (الملك) encompassed by it, between the First and the Last. Whoever has Knowledge of the Levels (المراتب) knows what the Angel has from Allah and what he has from the human. This is why the Angel, who is the Trustworthy Spirit (الروح الأمين), brings the Revelation (الوحي) from the First Name that belongs to Allah to the Perfect Servant (العبد الكامل), the Messenger, who descends into the station of the Divine Last Name. This is His saying, the Exalted: <<شَهِدَ اللَّهُ>> (Allah witnessed), where He began with Himself in the witnessing of His Unity, then He mentioned the angels, and then after the angels, He mentioned the people of Knowledge (أولي العلم), who are the humans. <<فَلِلَّهِ الْأَمْرُ مِنْ قَبْلُ وَمِنْ بَعْدُ>> (So to Allah belongs the command before and after), and the Angel is between them. The order of Existence (الوجود) was thus: the Priority (الأولية) belongs to The Real, then He brought the Angel into existence, then He brought the Human into existence and granted him the Vicegerency (الخلافة), but He did not grant it to the Angel, because the middle belongs to him, and every middle is encompassed. Understand this.\n\nThe appearance of the Angel's superiority over the human is due to what he brings from Allah, but this is not conclusive proof of superiority in intellect or in language. Just as the creation of the heavens and the earth is greater than the creation of mankind (<<خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ>>), because humans are in the rank of being acted upon by the movement of the spheres and accepting the formation (التكوين) that occurs in the elements. There are only specific aspects, and there is no encompassing aspect. From one aspect, one is superior, and from another aspect, one is inferior. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks The Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو پانچ: اس شخص کے منزلہ کی معرفت میں جس نے اپنے قلب کو میرا گھر بنا لیا اور اسے میرے غیر سے خالی کر دیا، کوئی نہیں جانتا کہ میں اسے کیا عطا کرتا ہوں۔ پس تم اسے بیت المعمور سے مشابہت نہ دو، کیونکہ وہ میرے فرشتوں کا گھر ہے، میرا گھر نہیں، اور اسی لیے میں نے اپنے خلیل ابراہیم علیہ السلام کو اس میں نہیں بسایا۔\n\n> قلب تیرا گھر ہے، میرا نہیں، پس اسے آباد کر *** میں کسی ایسی شے کا ذکر نہیں کرتا جس کا تو ذکر کرے۔\n> میرا اپنے لیے ذکر کرنا حجاب ہے، جبکہ تیرا میرے لیے ذکر *** وہ سرور ہے جسے تو حسن سے بھر دیتا ہے۔\n> جب میں تیرا ذکر کرتا ہوں تو وہ ذکر تیری طرف سے ہمارے لیے ہوتا ہے *** تو کسی ایسے امر کا ذکر نہیں کرتا جس کا ہم ذکر کریں۔\n> بے شک خلیل (ابراہیم) کا مسکن بیت (کعبہ) کی پشت پر ہے *** اس قلب کی خاطر جسے تو مسلسل آباد کرتا رہا ہے۔\n> اگر وہ اس (بیت) میں قیام کرتے تو میں ان کا تابع ہوتا *** لیکن وہ اس میں نہیں رہتے، پس تو اسے آباد نہیں کرتا۔\n> پس تمام تعریف اللہ کے لیے ہے، ایسی تعریف جو کوئی نہیں کر سکتا *** سوائے اس کے جو اسے میرے قلب میں مصور کرتا ہے۔\n\n### [بے شک مومن کا قلب اللہ کی رحمت سے بھی زیادہ وسیع ہے]\n\nجان لو، اللہ ہمیں اور تمہیں روح القدس کے ذریعے تائید بخشے، کہ اللہ کی رحمت ہر شے پر محیط ہے (وَسِعَتْ كُلَّ شَيْءٍ)۔ اور یہ بھی اس کی رحمت میں سے ہے کہ اللہ نے اس رحمت کے ذریعے اپنے بندے کا قلب تخلیق کیا اور اسے اپنی رحمت سے بھی زیادہ وسیع بنا دیا۔ کیونکہ مومن کا قلب ذات حق (الحق) کو سمو لیتا ہے، جیسا کہ روایت میں آیا ہے کہ اللہ فرماتا ہے: \"نہ میری زمین مجھے سمو سکی اور نہ میرا آسمان، لیکن میرے مومن بندے کا قلب مجھے سمو لیا۔\"\n\nپس اس کی رحمت، اپنی وسعت کے باوجود، محال ہے کہ اس (ذات حق) سے متعلق ہو یا اسے سمو سکے، کیونکہ اگرچہ وہ (رحمت) اس سے ہے، لیکن وہ اس پر واپس نہیں لوٹتی۔ اور اللہ تعالیٰ نے اس بات کو محال نہیں ٹھہرایا کہ اس کے بندے کا قلب اسے سمو لے۔ یہ اس لیے کہ بندہ ہی ہے جو اللہ سے فقہ (گہری سمجھ) حاصل کرتا ہے اور اس سے عقل (فہم) حاصل کرتا ہے۔ اور اس نے اسے اپنے علم کا حکم دیا، اور اسے صرف اسی چیز کا حکم دیا جو اس کے لیے ممکن ہو کہ وہ اسے قائم کرے۔ پس ذات حق (الحق) بندے کے قلب میں معلوم اور معقول ہو جاتی ہے، جبکہ اللہ تعالیٰ مرحوم (جس پر رحم کیا جائے) کی صفت سے متصف نہیں ہوتا۔ یہ بات تمہیں بتاتی ہے کہ رحمت اس کی مخلوق کی طرف سے اس تک نہیں پہنچتی، جیسا کہ تقویٰ اس تک پہنچتا ہے، میرا مطلب ہے قلوب کا تقویٰ، جیسا کہ اس نے فرمایا: \"لیکن تمہارا تقویٰ ہی اس تک پہنچتا ہے (وَلَكِنْ يَنَالُهُ التَّقْوَىٰ مِنْكُمْ)\"۔ اور فرمایا: \"پس بے شک وہ (یعنی شعائر اللہ، جو کہ اس کی معرفت کی ایک قسم ہے) قلوب کے تقویٰ (تَقْوَى الْقُلُوبِ) میں سے ہے۔\" اور اللہ تعالیٰ نے فرمایا: \"تاکہ ان کے پاس ایسے قلوب ہوں جن سے وہ عقل کریں (فَتَكُونَ لَهُمْ قُلُوبٌ يَعْقِلُونَ بِهَا)\"۔ اور اس نے انہیں عقل صرف اس لیے بنایا تاکہ بندہ اس کے ذریعے اس بات کو سمجھے جس سے وہ اسے مخاطب کرتا ہے۔ اور جن باتوں سے اس نے اسے مخاطب کیا، ان میں یہ ہے کہ اس کی رحمت ہر شے پر محیط ہے (وَسِعَتْ كُلَّ شَيْءٍ)، اور یہ کہ اس کا قلب اسے سمو لیتا ہے، جل جلالہ۔ مگر یہاں ایک راز ہے جس کی طرف میں اشارہ کروں گا اور اسے کھول کر بیان نہیں کروں گا، اور وہ یہ ہے کہ اللہ نے خبر دی کہ اس نے پسند کیا کہ اسے پہچانا جائے، اور محبت کا تقاضا معروف ہے۔ پس اس نے مخلوق کو پیدا کیا اور ان سے اپنا تعارف کرایا، تو انہوں نے اسے پہچانا۔ لیکن انہوں نے اسے اپنے غور و فکر سے نہیں پہچانا، بلکہ اس کے اپنے تعارف کرانے سے پہچانا۔ یہ اس شخص کے لیے اشارہ ہے \"جس کے پاس قلب ہو یا وہ کان لگائے اور وہ حاضر ہو (لِمَنْ كَانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وَهُوَ شَهِيدٌ)\"۔ اور محبت علم ذوق ہے، اور ہم میں کوئی نہیں مگر محب ہے۔ اور جس نے محبت کی، اس نے محبت کا تقاضا جانا۔ پس یہاں سے تم عمومِ رحمت کو پہچانتے ہو، اور دوسری حدیث جو بندے کے غضب دلانے سے پیدا ہونے والے اللہ کے غضب کے بارے میں ہے۔\n\nترجمان (انبیاء) علیہم السلام نے شفاعت کے باب میں اس کے بارے میں فرمایا، جب قیامت کے دن مخلوق ان سے شفاعت کی درخواست کرے گی، تو وہ کہیں گے کہ آج اللہ نے ایسا غضب فرمایا ہے کہ نہ اس سے پہلے ایسا غضب فرمایا اور نہ اس کے بعد ایسا غضب فرمائے گا۔ پس غضب انتقام کے ذریعے زائل ہو گیا۔ اور نبی اکرم صلی اللہ علیہ وسلم نے خبر دی کہ صدقہ رب کے غضب کو بجھا دیتا ہے۔ اور وہ (اللہ) ہی اپنے بندے کو توفیق دیتا ہے کہ وہ صدقہ کرے، پس وہ اپنے غضب کو اس چیز سے بجھا دیتا ہے جس کی توفیق اس نے اپنے بندے کو دی۔ یہ بہت زیادہ ہے، لیکن یہ مقدار اللہ کے بندوں کے پاس اس کی طرف سے ہے۔ ہم اس پر اضافہ نہیں کرتے کیونکہ ہم نے اسے صرف اس کے تعارف کرانے سے جانا ہے، اور یہ اس کے تعارف کرانے کے مجموعے میں سے ہے، نہ کہ مخلوق کے غور و فکر سے۔\n\nپس جب اللہ نے اپنے بندے کے قلب کو گھر بنا لیا، کیونکہ اس نے اسے اپنے عرفانی (المعرفۃ) علم کا محل بنایا، نہ کہ نظری علم کا، تو اس نے اس کی حفاظت کی اور اس پر غیرت کھائی کہ وہ اس کے غیر کا محل بنے۔ اور بندہ جامع ہے، لہٰذا ذات حق (الحق) کا اس بندے کے لیے مختلف صورتوں میں ظاہر ہونا ضروری ہے، یعنی ہر شے کی صورت میں، کیونکہ وہ ہر شے کے علم کا محل ہے۔ اور اشیاء کے علم کا محل قلب کے سوا کوئی نہیں ہے۔ اور ذات حق (الحق) اپنے بندے کے قلب پر غیرت کھاتا ہے کہ اس میں اس کے رب کے سوا کوئی اور ہو۔ پس اس نے اسے مطلع کیا کہ وہ ہر شے کی صورت اور ہر شے کی عین ہے۔ پس بندے کے قلب نے ہر شے کو سمو لیا، کیونکہ ہر شے حق ہے، لہٰذا اس نے حق کے سوا کسی کو نہیں سمویا۔ پس جس نے حق کو اس کی حقیقت سے جانا، اس نے ہر شے کو جان لیا۔ اور یہ ضروری نہیں کہ جس نے کسی شے کو جانا، اس نے حق کو جان لیا۔ اور حقیقت میں، بندے نے اس شے کو نہیں جانا جس کے بارے میں وہ گمان کرتا ہے کہ اس نے اسے جانا ہے، کیونکہ اگر وہ اسے جانتا تو جانتا کہ وہ حق ہے۔ پس جب اس نے یہ نہیں جانا کہ وہ حق ہے، تو ہم نے کہا کہ اس نے اسے نہیں جانا۔ اور اس نے صرف مومن کے قلب کا ذکر کیا، غیر مومن کا نہیں، کیونکہ اللہ کی معرفت (المعرفۃ) صرف اس کے تعارف کرانے سے ہوتی ہے، نہ کہ فکری غور و فکر کے حکم سے۔ اور اللہ تعالیٰ کے تعارف کو صرف مومن ہی قبول کرتا ہے، کیونکہ غیر مومن اسے یکسر قبول نہیں کرتا۔\n\nکیونکہ وہ (غیر مومن) تین امور میں سے کسی ایک پر غور کرتا ہے: یا تو وہ اس تعارف کو جو ذات حق (الحق) کی طرف سے آیا ہے، محال قرار دیتا ہے۔ اور یہاں محال قرار دینے والے کئی اقسام میں تقسیم ہو جاتے ہیں۔ ان میں سے ایک وہ ہے جو رسولوں پر طعن کرتا ہے اور انہیں خیال کے تسلط میں قرار دیتا ہے۔ اور یہ گروہ ان خسارہ پانے والوں میں سے ہے جنہیں اللہ نے گمراہ کر دیا اور ہدایت کے راستے سے اندھا کر دیا، بلکہ اگر وہ جانتے تو وہ ہدایت کے راستے پر ہوتے۔ پس ان لوگوں نے جہالت اور دین سے خروج کو جمع کر لیا، لہٰذا سعادت میں ان کا کوئی حصہ نہیں۔ اور ان میں سے ایک دوسرا گروہ ہے جس نے کہا کہ رسول اللہ کو سب سے زیادہ جاننے والے تھے، پس انہوں نے خطاب میں لوگوں کی سمجھ کے مطابق نزول کیا، نہ کہ اس کے مطابق جو امر حقیقت میں ہے، کیونکہ وہ محال ہے۔ پس ان لوگوں نے اللہ اور اس کے رسول کو جھٹلایا اس چیز میں جو اللہ نے اپنی ذات اور اپنے رسولوں کی طرف منسوب کی، لیکن اچھی عبارت کے ساتھ۔ جیسا کہ کوئی شخص جب کسی دوسرے شخص کے ساتھ ادب سے پیش آنا چاہے اور اسے کوئی ایسی بات بتائے جسے سننے والا اپنی نظر میں ویسا نہ سمجھے جیسا کہ بتانے والے نے کہا، تو وہ اسے یہ نہیں کہتا کہ تم نے جھوٹ بولا، بلکہ کہتا ہے: میرے آقا سچ فرماتے ہیں، لیکن معاملہ اس طرح نہیں ہے، بلکہ میرے آقا نے جو امر ذکر کیا ہے وہ فلاں فلاں صورت میں ہے۔ پس وہ اسے اچھی عبارت کے ساتھ جھٹلاتا اور جاہل قرار دیتا ہے۔ متأولین (تاویل کرنے والوں) نے بھی یہی کیا۔ اور ایک دوسرا گروہ ہے جو یہ نہیں کہتا کہ رسول نے عبارت میں لوگوں کی سمجھ کے مطابق نزول کیا، بلکہ کہتا ہے کہ اس خطاب سے مراد صرف فلاں فلاں ہے، اس سے وہ مراد نہیں جو عوام سمجھتے ہیں۔ اور یہ اس زبان میں موجود ہے جسے لے کر یہ رسول آیا ہے۔ یہ لوگ پہلے والوں سے زیادہ مشابہ حال ہیں، مگر وہ اس میں اللہ پر حکم لگانے والے ہیں، اپنے اس قول سے کہ یہ زبان سے سمجھا جانے والا مفہوم ہے۔ اور اسی طرح جو اس زبان کے عام لوگ اعتقاد رکھتے ہیں، وہ بھی اس سے سمجھا جانے والا مفہوم ہے۔ پس کیا چیز مانع ہے کہ وہ مجموعہ ہو؟ پس انہوں نے اللہ پر اس چیز کا حکم لگا کر غلطی کی جس کا حکم اللہ نے خود پر نہیں لگایا۔ پس ان لوگوں نے صرف اسی معبود کی عبادت کی جسے ان کی عقلوں نے باندھ دیا، مقید کر دیا اور محدود کر دیا۔\n\nاور ایک دوسرا گروہ ہے جس نے کہا کہ ہم اس لفظ پر ایمان لاتے ہیں جیسا کہ وہ آیا ہے، بغیر اس کے کہ ہم اس کا کوئی معنی سمجھیں، تاکہ اس پر ایمان لانے میں ہم اس شخص کے حکم میں ہوں جس نے اسے سنا ہی نہیں۔ اور ہم اس چیز پر قائم رہیں جو دلیل عقل نے ہمیں اس قول کے ظاہری مفہوم کو محال قرار دینے سے عطا کی ہے۔ پس یہ گروہ بھی اچھی عبارت کے ساتھ حکم لگانے والا ہے، اور یہ اچھی عبارت کے ساتھ اللہ پر رد ہے۔ کیونکہ انہوں نے اپنے آپ کو ان لوگوں کے حکم میں کر دیا جنہوں نے وہ خطاب نہیں سنا۔ اور ایک دوسرا گروہ ہے جس نے کہا کہ ہم اس لفظ پر اللہ کے علم اور اس کے رسول صلی اللہ علیہ وسلم کے علم کی حد تک ایمان لاتے ہیں۔ پس ان لوگوں نے گویا یہ کہا کہ اللہ نے ہم سے بے فائدہ خطاب کیا، کیونکہ اس نے ہم سے ایسی بات کی جسے ہم نہیں سمجھتے۔ حالانکہ اللہ فرماتا ہے: \"اور ہم نے کوئی رسول نہیں بھیجا مگر اس کی قوم کی زبان میں تاکہ وہ ان کے لیے بیان کرے (وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ)\"۔ اور وہ (رسول) یہ لے کر آئے، پس انہوں نے بیان کر دیا جیسا کہ اللہ نے فرمایا، لیکن ان لوگوں نے انکار کر دیا کہ وہ بیان ہو۔ اور یہ سب مسلمان ہیں۔\n\nاور تیسرا امر وہ لوگ ہیں جن کی بصیرت کی آنکھوں سے اللہ نے جہالت کا پردہ ہٹا دیا، پس اس نے انہیں ان کی اپنی جانوں کی نشانیاں اور آفاق کی نشانیاں دکھائیں، تاکہ \"ان پر واضح ہو جائے کہ وہ حق ہے، اس کے سوا کوئی نہیں (يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ)\"۔ پس وہ اس پر ایمان لائے، بلکہ انہوں نے اسے ہر رُخ سے اور ہر صورت میں جانا۔ اور \"بے شک وہ ہر شے پر محیط ہے (إِنَّهُ بِكُلِّ شَيْءٍ مُحِيطٌ)\"۔ پس عارف کسی شے کو نہیں دیکھتا مگر اسی میں۔ پس وہ ہر شے کے لیے احاطہ کا ظرف ہے۔ اور ایسا کیوں نہ ہو، جبکہ اس نے اپنے نام \"الدهر\" (زمانہ) سے اس پر تنبیہ کی ہے، پس اللہ کے سوا ہر شے اس میں داخل ہو گئی۔ پس جس نے کسی شے کو دیکھا، اس نے اسے صرف اسی میں دیکھا۔ اور اسی لیے صدیق (ابو بکر رضی اللہ عنہ) نے فرمایا: \"میں نے کوئی شے نہیں دیکھی مگر اس سے پہلے اللہ کو دیکھا۔\" کیونکہ اس نے اسے نہیں دیکھا جب تک کہ وہ اس میں داخل نہ ہو گیا۔ پس بالضرورت وہ حق کو بعینہٖ شے سے پہلے دیکھتا ہے، کیونکہ وہ اس شے کا اس سے صادر ہونا دیکھتا ہے۔ پس ذات حق (الحق) تمام موجودات کا گھر ہے کیونکہ وہ الوجود (ہستی) ہے، اور بندے کا قلب ذات حق (الحق) کا گھر ہے کیونکہ اس نے اسے سمو لیا، لیکن صرف مومن کا قلب۔\n\n> پس جو ذات حق (الحق) کا گھر ہو، تو حق اس کا گھر ہے *** پس حق کے وجود کی عین، کائنات کی عین ہے۔\n\nاور مومن نے یہ وسعت صرف اس لیے حاصل کی کہ وہ عالم کی صورت پر اور ذات حق (الحق) کی صورت پر ہے۔ اور عالم کا ہر جزو ذات حق (الحق) کی صورت پر نہیں ہے۔ پس اسی وجہ سے ذات حق (الحق) نے اسے وسعت سے متصف کیا۔ ابو یزید بسطامی نے عارف کے قلب کی وسعت کے بارے میں فرمایا: \"اگر عرش، یعنی اللہ کی بادشاہت اور جو کچھ اس میں عالم کے جزئیات اور اعیان ہیں، ایک لاکھ لاکھ بار بھی ہوں (وہ حصر مراد نہیں لیتے، بلکہ وہ مراد لیتے ہیں جو لامتناہی ہو اور جس کی انتہا نہ ہو)، تو وہ اس سے تعبیر کرتے ہیں جو الوجود (ہستی) میں داخل ہوا اور ہمیشہ داخل ہوتا رہے گا، وہ عارف کے قلب کے کسی ایک کونے میں سما جائے گا اور اسے محسوس بھی نہیں ہو گا۔\" اور یہ اس لیے کہ جس قلب نے قدیم کو سمو لیا، وہ محدث کو موجود ہوتے ہوئے کیسے محسوس کر سکتا ہے؟ اور ابو یزید کا یہ قول ان کی مجلس کے مطابق حاضرین کو سمجھانے کے لیے ایک وسعت تھی۔ لیکن اس میں تحقیق یہ ہے کہ کہا جائے کہ جب عارف کے قلب نے ذات حق (الحق) کو سمو لیا، تو اس کے قلب نے ہر شے کو سمو لیا، کیونکہ کوئی شے حق کے بغیر نہیں ہو سکتی۔ پس کسی شے کی صورت اس کے قلب میں، یعنی اس بندے کے قلب میں جس نے حق کو سمو لیا، کے سوا کہیں اور تشکیل نہیں پاتی۔\n\n> پس وہ ہر صورت کے لیے ہیولیٰ ہے *** صورت کی صورت اور سورت سے۔\n> اور تو اس اور اس کے درمیان ہے *** ذات حق (الحق) نے تجھے اس میں سورت بنا کر قائم کیا۔\n\nاور ابو یزید کے قول پر جنید کا قول بھی غور طلب ہے کہ محدث (تخلیق شدہ) جب قدیم (ازلی) کے ساتھ ملایا جاتا ہے تو اس کا کوئی اثر باقی نہیں رہتا۔ مگر یہاں جنید کا قول ابو یزید کے قول سے زیادہ مکمل ہے۔ کیونکہ جب تم محدث کو قدیم کے ساتھ ملاؤ گے تو اثر قدیم کا ہو گا نہ کہ محدث کا۔ پس اس موازنے سے تمہارے لیے وہ امر واضح ہو گیا جس پر معاملہ ہے، اور وہ وہی ہے جو ہم نے کہا۔ کیونکہ اثر کو نظر انداز کرنا ممکن نہیں، لیکن اس موازنے سے پہلے اسے محدث کی طرف منسوب کیا جاتا تھا۔ جب اسے قدیم کے ساتھ ملایا گیا تو اس نے اثر کو قدیم کی طرف سے دیکھا اور محدث کو عین اثر دیکھا، پس اس نے وہی کہا جو کہا۔ اور جب یہ بات ثابت ہو گئی تو ہمیں کوئی شک نہیں کہ خلیل ابراہیم علیہ السلام اور رسول صلی اللہ علیہ وسلم، ان سب کے قلوب نے ذات حق (الحق) کو سمو لیا۔ پس اللہ تعالیٰ نے انہیں بیت المعمور کی طرف پشت کیے ہوئے بنایا اور وہ اس میں داخل نہیں ہوئے، کیونکہ اگر وہ اس میں داخل ہوتے تو بیت المعمور ذات حق (الحق) کو سمو لیتا، کیونکہ اس نے اسے سمو لیا جس نے اسے سمویا۔ اور یہ ایک اشارہ ہے، حقیقت نہیں، کیونکہ ابراہیم علیہ السلام کا جسم بلاشبہ جیرون (مکہ کے قریب ایک جگہ) میں محدود ہے۔ پس ہم صرف اس صورت کو مراد لیتے ہیں جس پر وہ برزخ میں ہیں جہاں وہ موت کے ذریعے منتقل ہوئے۔\n\nاور اس کا قول \"اور اسے میرے غیر سے خالی کر دیا\" یہ اس شخص کے بارے میں نبی صلی اللہ علیہ وسلم کا قول ہے جو قرآن پڑھتا ہے: \"جسے میرے ذکر (یعنی قرآن) نے میری درخواست کرنے سے مشغول کر دیا، میں اسے سائلوں کو دی جانے والی بہترین چیز عطا کرتا ہوں۔\" اللہ تعالیٰ فرماتا ہے: \"بے شک ہم ہی نے ذکر (الذکر) نازل کیا ہے، اور وہ قرآن ہے (إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ)\"۔ اور فرمایا: \"پس اہل ذکر سے پوچھو (فَاسْأَلُوا أَهْلَ الذِّكْرِ)\"، یعنی اہل قرآن سے، کیونکہ اس نے فرمایا: \"ہم نے کتاب میں کوئی شے نہیں چھوڑی (مَا فَرَّطْنَا فِي الْكِتَابِ مِنْ شَيْءٍ)\"۔ پس وہ ہر شے کا جامع ہے۔ پس جس نے اس کے غیر کا اعتقاد رکھا، اس پر واجب ہے کہ وہ اپنے قلب کو ذات حق (الحق) کے لیے خالی کرے۔ اور لوگ درجات میں ایک دوسرے سے افضل ہیں، کیونکہ اللہ نے عالم کے بعض کو بعض پر فضیلت دی ہے۔ اور افضل ترین فضیلت اللہ کے علم کی فضیلت ہے۔ کیا تم نہیں دیکھتے کہ اس نے اسے، یعنی انسان کو، اللہ کے لیے جو اسم آخر ہے اس کے مرتبہ میں عطا کیا، اور اپنی ذات کو اس کے علم کے مرتبہ میں اسم اول عطا کیا، اور فرشتہ کو اول اور آخر کے درمیان محیط بنا دیا۔ پس جسے مراتب کا علم ہے، وہ جانتا ہے کہ فرشتے کا اللہ کی طرف سے کیا ہے اور انسان کی طرف سے کیا ہے۔ اور اسی لیے فرشتہ، جو کہ روح الامین ہے، اللہ کے لیے جو اسم اول ہے اس سے وحی لے کر کامل رسول (الإنسان الکامل) کے پاس آتا ہے جو اسم الٰہی آخر کے منزلہ میں نازل ہوا ہے۔ اور یہ اللہ تعالیٰ کا قول ہے: \"اللہ نے گواہی دی (شَهِدَ اللَّهُ)\"، پس اس نے اپنی توحید کی گواہی میں اپنی ذات سے آغاز کیا، پھر فرشتوں کا ذکر کیا، پھر فرشتوں کے بعد اہل علم کا ذکر کیا، اور وہ انسان ہیں۔ پس \"اللہ ہی کے لیے ہے حکم، پہلے بھی اور بعد میں بھی (فَلِلَّهِ الْأَمْرُ مِنْ قَبْلُ وَمِنْ بَعْدُ)\"، اور فرشتہ ان دونوں کے درمیان ہے۔ اور وجود کا معاملہ بھی اسی طرح تھا، پس اولیت ذات حق (الحق) کے لیے ہے، پھر اس نے فرشتہ کو وجود بخشا، پھر انسان کو وجود بخشا اور اسے خلافت عطا کی، اور فرشتہ کو عطا نہیں کی، کیونکہ وسط اس کے لیے ہے، اور ہر وسط محیط ہوتا ہے، پس سمجھ لو۔ پس انسان پر فرشتے کی فضیلت کی صورت اس چیز کی وجہ سے ہے جو وہ اللہ کی طرف سے لے کر آیا، اور یہ عقل میں اور زبان میں فضیلت پر کوئی قطعی دلیل نہیں ہے، جیسا کہ \"آسمانوں اور زمین کی تخلیق لوگوں کی تخلیق سے بڑی ہے (خَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ)\"۔ کیونکہ لوگ افلاک کی حرکت سے متاثر ہونے اور عناصر میں موجود تکوین کو قبول کرنے کے مرتبہ میں ہیں۔ پس وہاں صرف خاص وجوہ ہیں، اور وہاں کوئی محیط وجہ نہیں ہے۔ پس ایک رُخ سے وہ افضل ہوتا ہے اور ایک رُخ سے مفضول ہوتا ہے۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "«باب چهارصد و پنجم در معرفت منزلت کسی که قلبش را خانه من قرار داد و آن را از غیر من خالی کرد؛ کسی نمی‌داند چه به او عطا می‌کنم. پس آن را به بیت المعمور تشبیه نکنید، زیرا آن خانه فرشتگان من است نه خانه من. به همین دلیل، خلیل خود ابراهیم (ع) را در آن ساکن نکردم.»\n\n> قلب، خانه توست نه خانه من، پس آن را آباد کن *** من چیزی را که تو یاد می‌کنی، یاد نمی‌کنم.\n> یاد من از خودم حجاب است، اما یاد تو از من *** همان سروری است که با زیبایی آن را غرق می‌کنی.\n> اگر تو را یاد کنم، این ذکر از جانب تو برای ماست *** تو امری را که ما یاد می‌کنیم، یاد نمی‌کنی.\n> خلیل (ابراهیم) در پشت خانه (کعبه) مسکن دارد *** به خاطر قلبی که تو پیوسته آن را آباد می‌کنی.\n> اگر در آن (خانه) ساکن می‌شد، تو تابع او می‌شدی *** و چون در آن ساکن نیست، تو آن را آباد نمی‌کنی.\n> پس حمد و سپاس خدایی را که ستایشی را بر زبان نمی‌آورد *** مگر کسی که او (حق) آن را در قلب من تصویر می‌کند.\n\n### [همانا قلب مؤمن از رحمت خدا وسیع‌تر است]\n\nبدان، خداوند ما و تو را با روح القدس تأیید کند، که رحمت خداوند «وَسِعَتْ كُلَّ شَيْ‏ءٍ» (همه چیز را فرا گرفته است) (قرآن). و از رحمت اوست که خداوند قلب بنده خود را با آن آفرید و آن را وسیع‌تر از رحمت خود قرار داد. زیرا قلب مؤمن، حق (الحق) را در خود جای داده است، چنانکه روایت شده که خداوند می‌فرماید: «ما وسعني أرضي ولا سمائي ووسعني قلب عبدي المؤمن» (نه زمینم مرا گنجایش داشت و نه آسمانم، اما قلب بنده مؤمنم مرا گنجایش داشت).\n\nپس رحمت او با وجود وسعتش، محال است که به او (حق) تعلق گیرد یا او را در بر گیرد؛ زیرا اگرچه رحمت از اوست، اما به او باز نمی‌گردد. و آنچه خداوند محال ندانسته، این است که قلب بنده او او را در بر گیرد. این بدان سبب است که بنده کسی است که از جانب خدا تفقه (درک عمیق) می‌کند و تعقل می‌نماید، و خداوند او را به علم به خود امر کرده است، و او را امر نکرده مگر به آنچه توان انجامش را دارد. پس حق (الحق) در قلب بنده، معلوم و معقول می‌گردد، در حالی که خداوند به صفت «مرحوم» (مورد ترحم واقع شده) متصف نمی‌شود. این امر به تو نشان می‌دهد که رحمت از سوی خلق به او نمی‌رسد، چنانکه تقوا به او می‌رسد، منظورم تقوای قلوب است، چنانکه فرمود: «وَلَكِنْ يَنالُهُ التَّقْوى‏ مِنْكُمْ» (بلکه تقوای شما به او می‌رسد) (قرآن). و فرمود: «فَإِنَّها» (یعنی شعائر الهی که نوعی علم به اوست) «مِنْ تَقْوَى الْقُلُوبِ» (از تقوای دل‌هاست) (قرآن). و خداوند متعال فرمود: «فَتَكُونَ لَهُمْ قُلُوبٌ يَعْقِلُونَ بِها» (تا دل‌هایی داشته باشند که با آن تعقل کنند) (قرآن). و قلب را عقل قرار نداد مگر برای اینکه بنده با آن، آنچه را که خداوند او را بدان خطاب می‌کند، تعقل کند. و از جمله آنچه او را بدان خطاب کرده این است که رحمتش «وَسِعَتْ كُلَّ شَيْ‏ءٍ» (همه چیز را فرا گرفته است) و قلب بنده او، او را در خود جای داده است، جل جلاله. مگر اینکه در اینجا رازی است که به آن اشاره می‌کنم و آن را بسط نمی‌دهم، و آن این است که خداوند خبر داد که دوست داشت شناخته شود، و مقتضای این دوست داشتن (حب) معروف است. پس خلق را آفرید و خود را به آنان شناساند، و آنان او را شناختند. اما نه با نظر خود، بلکه با شناساندن او به ایشان. این اشاره‌ای است «لِمَنْ كانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ» (برای کسی که قلبی دارد یا گوش فرا دهد در حالی که شاهد است) (قرآن). و محبت، علم ذوق (ذوق) است، و در میان ما جز محب (دوستدار) نیست. و هر که دوست بدارد، مقتضای حب را می‌شناسد. از اینجاست که عمومیت رحمت و حدیث دیگر، یعنی غضب خداوند که ناشی از به خشم آوردن بنده است، شناخته می‌شود. سپس\n\nمترجمان (تراجمه) (ع) در باب شفاعت، هنگامی که مردم در روز قیامت از آنان شفاعت می‌خواهند، از آن (غضب) سخن گفته‌اند و می‌گویند: «امروز خداوند چنان غضبی کرده که پیش از آن مانندش را نکرده و پس از آن نیز مانندش را نخواهد کرد.» پس غضب با انتقام از بین رفت. و پیامبر (صلی الله علیه و سلم) خبر داد که صدقه، غضب پروردگار را خاموش می‌کند. و اوست که بنده خود را برای صدقه دادن موفق می‌سازد، پس اوست که غضب خود را با توفیقی که به بنده داده، خاموش می‌کند. این بسیار است، اما این مقدار نزد بندگان خدا از اوست. ما بر آن نمی‌افزاییم، زیرا او را نشناخته‌ایم مگر با شناساندن او، و این از جمله شناساندن اوست نه از نظر مخلوق. پس چون خداوند قلب بنده خود را خانه قرار داد، زیرا آن را محل علم عرفانی (المعرفة العرفانية) به خود ساخت نه علم نظری، از آن محافظت کرد و غیرت ورزید که محل غیر او باشد. و بنده جامع است، پس حق تعالی (الحق تعالی) ناگزیر است که در صور گوناگون، یعنی در صورت هر شیئی، بر این بنده ظاهر شود، زیرا او محل علم به هر شیئی است، و محل علم به اشیاء جز قلب نیست. و حق (الحق) بر قلب بنده خود غیرت می‌ورزد که غیر پروردگارش در آن باشد، پس به او آگاه ساخت که او (حق) صورت هر شیئی و عین هر شیئی است. پس قلب بنده، همه چیز را در خود جای داد، زیرا هر شیئی حق است، و جز حق آن را در بر نگرفت. پس هر کس حق را از حقیقتش بشناسد، همه چیز را شناخته است. و چنین نیست که هر کس چیزی را بشناسد، حق را شناخته باشد. و در حقیقت، بنده آن شیئی را که گمان می‌کند شناخته، نشناخته است، زیرا اگر آن را می‌شناخت، می‌دانست که آن حق است. پس چون ندانست که آن حق است، درباره‌اش گفتیم که آن را نشناخته است. و تنها قلب مؤمن است که این گنجایش را دارد، نه غیر مؤمن، زیرا معرفت (المعرفة) به خداوند جز با شناساندن او حاصل نمی‌شود، نه با حکم نظر فکری. و جز مؤمن، شناساندن او تعالی را نمی‌پذیرد. زیرا غیر مؤمن آن را یکسره نمی‌پذیرد. او (غیر مؤمن) بر یکی از سه امر نظر می‌کند: یا آنچه را که تعریف (شناساندن) با آن آمده است، به حق حواله می‌دهد. در اینجا حواله‌دهندگان به چند دسته تقسیم می‌شوند: دسته‌ای از آنان کسانی هستند که در پیامبران طعنه می‌زنند و آنان را تحت سلطه خیال قرار می‌دهند. این طایفه از زیانکارترین کسانی هستند که خداوند آنان را گمراه کرده و از راه هدایت کور ساخته است، بلکه اگر می‌دانستند، در راه هدایت بودند. اینان جهل و خروج از دین را با هم جمع کرده‌اند و بهره‌ای از سعادت ندارند. دسته دیگر از آنان گفتند که پیامبران داناترین مردم به خدا هستند، پس در خطاب، به اندازه فهم مردم تنزل کرده‌اند، نه بر آنچه امر بر آن است، زیرا آن محال است. اینان خدا و رسولش را در آنچه خداوند به خود و رسولانش نسبت داده است، با حسن عبارت تکذیب کردند. همان‌گونه که انسان اگر بخواهد با شخص دیگری با ادب سخن بگوید، وقتی حدیثی را برای او نقل می‌کند که شنونده در نظر خود می‌بیند آن‌گونه که گوینده گفته نیست، به او نمی‌گوید دروغ گفتی، بلکه می‌گوید: سرورم راست می‌گوید، اما امر بر این نیست، بلکه امری که سرورم ذکر کرده به این صورت و صورت دیگر است. پس او را با حسن عبارت تکذیب و جاهل می‌شمارد. این‌گونه است که این متأولین (تأویل‌کنندگان) عمل کرده‌اند. دسته دیگر نمی‌گویند که در عبارت به فهم مردم تنزل شده است، بلکه می‌گویند: مراد از این خطاب جز فلان و فلان نیست، نه آنچه عوام می‌فهمند. و این در زبانی که این رسول با آن آمده، موجود است. اینان از نظر حال شبیه‌تر به کسانی هستند که پیش از این آمدند، جز اینکه با این سخن خود بر خداوند حکم می‌رانند که این همان چیزی است که از زبان فهمیده می‌شود. و همچنین آنچه عموم آن زبان اعتقاد دارند نیز از آن فهمیده می‌شود. پس چه مانعی دارد که مجموع باشد؟ پس در حکم راندن بر خداوند به آنچه او بر خود حکم نرانده، خطا کرده‌اند. اینان جز خدایی را نپرستیده‌اند که عقولشان بر او بسته شده و او را مقید و محصور کرده است. دسته دیگر گفتند: ما به این لفظ همان‌گونه که آمده ایمان می‌آوریم، بدون اینکه معنایی برای آن تعقل کنیم، تا در این ایمان به آن، در حکم کسی باشیم که آن را نشنیده است، و بر آنچه دلیل عقل به ما داده است، یعنی محال دانستن مفهوم این ظاهر از این قول، باقی بمانیم. این دسته نیز با حسن عبارت حکم می‌رانند، و این رد بر خداوند با حسن عبارت است، زیرا آنان خود را در حکم کسانی قرار داده‌اند که آن خطاب را نشنیده‌اند. دسته دیگر گفتند: ما به این لفظ بر اساس علم خداوند در آن و علم رسولش (صلی الله علیه و سلم) ایمان می‌آوریم. اینان گفته‌اند که خداوند ما را بیهوده خطاب کرده است، زیرا ما را به چیزی خطاب کرده که نمی‌فهمیم. در حالی که خداوند می‌فرماید: «وَما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ» (و ما هیچ رسولی را نفرستادیم مگر به زبان قومش تا برای آنان بیان کند) (قرآن). و او با این (قرآن) آمده است، پس بیان کرده، چنانکه خداوند فرموده است، اما اینان از اینکه آن بیان باشد، سر باز زدند. و همه اینها مسلمان هستند. اما امر سوم، کسانی هستند که خداوند پرده جهل را از دیدگان بصیرتشان کنار زده است، پس آیات درون خود و آیات آفاق را به آنان نشان داده است تا «يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ» (برایشان آشکار شود که او حق است) (قرآن) و نه غیر آن. پس به او ایمان آوردند، بلکه او را در هر وجه و در هر صورت شناختند، و «إِنَّهُ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ» (همانا او بر هر چیزی احاطه دارد) (قرآن). پس عارف چیزی را نمی‌بیند مگر در او. پس او ظرف احاطه برای هر شیئی است. و چگونه چنین نباشد، در حالی که با نام «الدهر» (روزگار) بر آن تنبیه کرده است، پس هر آنچه غیر خداست در آن داخل شده است. پس هر کس چیزی را ببیند، آن را جز در او ندیده است. و به همین دلیل صدیق (ابوبکر) گفت: «چیزی را ندیدم مگر اینکه خدا را پیش از آن دیدم»، زیرا آن را ندید مگر اینکه در او داخل شد. پس به ضرورت، حق (الحق) را پیش از عین شیء می‌بیند، زیرا صدور آن شیء را از او می‌بیند. پس حق (الحق) خانه همه موجودات است، زیرا او وجود (الوجود) است، و قلب بنده خانه حق است، زیرا او را در خود جای داده است، اما قلب مؤمن، نه غیر آن.\n\n> پس هر که خانه حق باشد، حق خانه اوست *** پس عین وجود حق، عین کائنات است.\n\nو مؤمن این وسعت را به دست نیاورد مگر به این دلیل که بر صورت عالم و بر صورت حق (الحق) است. و هر جزئی از عالم بر صورت حق نیست. از اینجاست که حق او را به وسعت وصف کرده است. ابویزید بسطامی درباره وسعت قلب عارف گفت: «اگر عرش، یعنی مُلک خداوند و آنچه در بر دارد از جزئیات عالم و اعیان آن، صد هزار هزار بار (منظور حصر نیست، بلکه منظور چیزی است که پایان نمی‌پذیرد و به نهایت نمی‌رسد) در زاویه‌ای از زوایای قلب عارف وارد شود، او آن را احساس نمی‌کند.» و این بدان سبب است که قلبی که قدیم (القديم) را در خود جای داده است، چگونه می‌تواند محدث (المحدث) را به عنوان موجود احساس کند؟ و این سخن ابویزید، بسطی (توسع) به اندازه مجلسش برای فهماندن حاضران است. اما تحقیق در این باره این است که بگوییم: وقتی قلب عارف، حق (الحق) را در خود جای داد، قلب او همه چیز را در خود جای داد، زیرا هیچ شیئی جز از حق نیست، پس صورت هیچ شیئی تشکیل نمی‌شود مگر در قلب او، یعنی در قلب آن بنده‌ای که حق را در خود جای داده است.\n\n> پس او (قلب) هیولای (الهيولى) هر صورتی است *** از صورتِ صورت و سوره (مرتبه).\n> و تو در میان این و آن هستی *** حق تو را در آن به صورت (سورة) برپا داشته است.\n\nو سخن جنید را که گفت: «محدث (المحدث) هنگامی که با قدیم (القديم) قرین شود، اثری از آن باقی نمی‌ماند»، در مقابل سخن ابویزید قرار می‌دهد. با این حال، سخن جنید در اینجا کامل‌تر از سخن ابویزید است، زیرا وقتی محدث را با قدیم قرین می‌کنی، اثر از آنِ قدیم است نه محدث. پس با این مقایسه، آنچه امر بر آن است، برای تو روشن می‌شود، و آن همان است که ما گفتیم. زیرا محال نیست که اثر نادیده گرفته شود، بلکه پیش از این مقایسه، به محدث نسبت داده می‌شد. اما وقتی آن را با قدیم قرین کرد، اثر را از قدیم دید و محدث را عین اثر دید، پس آنچه را گفت، بیان کرد. و پس از تثبیت این مطلب، شک نداریم که خلیل ابراهیم (ع) و رسول (صلی الله علیه و سلم) که درود خدا بر آنان باد، در این مرتبه هستند که قلبشان حق (الحق) را در خود جای داده است. پس خداوند او را در حالی قرار داد که پشتش را به بیت المعمور تکیه داده بود و وارد آن نشد، زیرا اگر وارد آن می‌شد، بیت المعمور حق را در خود جای می‌داد، چون او کسی را که حق را در خود جای داده، در خود جای داده است. و این یک اشاره است نه حقیقت، زیرا جسم ابراهیم (ع) بدون شک در جیرون محصور است. پس ما جز صورتی را که او در برزخ (البرزخ) که با مرگ به آن منتقل شده، بر آن است، اراده نمی‌کنیم. و اما قول او (خداوند): «و آن را از غیر من خالی کرد»، همان قول پیامبر (ع) است درباره کسی که قرآن می‌خواند: «کسی که یاد من (یعنی قرآن) او را از درخواست من باز دارد، بهترین چیزی را که به درخواست‌کنندگان می‌دهم، به او عطا می‌کنم.» خداوند متعال می‌فرماید: «إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ» (همانا ما خود ذکر را نازل کردیم) (قرآن)، و آن قرآن است. و فرمود: «فَسْئَلُوا أَهْلَ الذِّكْرِ» (پس از اهل ذکر بپرسید) (قرآن)، یعنی اهل قرآن، زیرا فرمود: «ما فَرَّطْنا في الْكِتابِ من شَيْ‏ءٍ» (ما در کتاب از هیچ چیز فروگذار نکردیم) (قرآن). پس او (قرآن) جامع هر شیئی است. پس هر کس غیر این را اعتقاد داشته باشد، بر او واجب است که قلبش را برای حق (الحق) خالی کند. و مردم در درجات با یکدیگر تفاوت دارند، زیرا خداوند برخی از عالم را بر برخی دیگر برتری داده است، و بهترین برتری، برتری علم به خداست. آیا نمی‌بینی که خداوند آن (علم) را به انسان به منزله اسم آخر (الاسم الآخر) که برای خداست، عطا کرده است، و به خود تعالی اسم اول (الاسم الأول) را در مرتبه علم به خود عطا کرده است، و مَلَک (فرشته) را در میان اول و آخر، محاط به آن قرار داده است؟ پس هر کس به مراتب علم داشته باشد، می‌داند که مَلَک چه چیزی از خدا دارد و چه چیزی از انسان. و به همین دلیل، مَلَک که روح الامین (الروح الأمين) است، وحی را از اسم اول که برای خداست، به انسان کامل (الإنسان الکامل) رسول که در منزل اسم الهی آخر نازل شده است، می‌آورد. و این همان قول خداوند متعال است: «شَهِدَ الله» (خداوند شهادت داد) (قرآن). پس با خود در شهادت به توحیدش آغاز کرد، سپس فرشتگان را ذکر کرد، و پس از فرشتگان، اولی العلم (صاحبان دانش) را ذکر کرد که همان انسان‌ها هستند. پس «لِلَّهِ الْأَمْرُ من قَبْلُ ومن بَعْدُ» (امر از پیش و پس از آن برای خداست) (قرآن)، و مَلَک در میان آن دو است. و امر وجود (الوجود) نیز این‌گونه بود: اولیت برای حق است، سپس مَلَک را ایجاد کرد، سپس انسان را ایجاد کرد و خلافت را به او داد و به مَلَک نداد، زیرا وسط برای اوست، و هر وسطی محاط به اطراف است، پس بفهم. پس صورت برتری مَلَک بر انسان به واسطه چیزی است که از نزد خدا برای او آورده است، و این دلیل قاطعی بر فضیلت در عقل و در زبان نیست، همان‌گونه که «خَلْقِ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ» (آفرینش آسمان‌ها و زمین بزرگ‌تر از آفرینش مردم است) (قرآن)، زیرا مردم در رتبه انفعال از حرکت افلاک و پذیرش تکوینی هستند که در عناصر است. پس در آنجا جز وجوه خاصی نیست و وجه محیطی وجود ندارد. پس از یک جهت برتری دارد و از جهتی مفضول (برتری داده شده) است. و «وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند) (قرآن)."
  },
  "page_count": 3
}