{
  "id": 108,
  "title": {
    "ar": "الباب الثامن ومائة في معرفة الفتنة والشهوة وصحبة الأحداث والنسوان وأخذ الإرفاق منهن ومتى يأخذ المريد الإرفاق",
    "en": "Chapter 108: Concerning the Knowledge of Trial (الفتنة) and Passion (الشهوة), the Association with Youths (الأحداث) and Women, the Acceptance of Aid (الإرفاق) from them, and When the Disciple (المريد) Should Accept Aid.",
    "ur": "باب ایک سو آٹھواں: فتنہ (الفتنة) اور شہوت (الشهوة) کی معرفت، اور نوجوانوں اور عورتوں کی صحبت، اور ان سے معاونت (الإرفاق) حاصل کرنا، اور مرید (المريد) کب معاونت حاصل کرے۔",
    "fa": "باب صد و هشتم در معرفت فتنه و شهوت و مصاحبت با جوانان و زنان و گرفتن کمک (الإرفاق) از ایشان و اینکه مريد چه زمانی کمک (الإرفاق) می‌گیرد"
  },
  "content": {
    "ar": "## (الباب الثامن ومائة في معرفة الفتنة والشهوة وصحبة الأحداث والنسوان وأخذ الإرفاق منهن ومتى يأخذ المريد الإرفاق)\n\n\n> لا تصحبن حدثا إن كنت ذا حدث *** ولا نساء وكن بالله مشتغلا\n\n\n> واحذر من الفتنة العمياء أن لها *** حكما قويا على القلب الذي غفلا\n\n\n> وشهوة النفس فاحذرها فكم فتكت *** بسيد قلبه عن ربه عفلا\n\n\n> ولا يرى أخذا رفقا من امرأة *** إلا الذي من رجال الله قد كملا\n\n\n### [الفتنة اختبار وحيرة وهداية]\n\n\nاعلم أيدك الله أن الفتنة الاختبار يقال فتنت الفضة بالنار إذا اختبرتها قال تعالى أَنَّما أَمْوالُكُمْ وأَوْلادُكُمْ فِتْنَةٌ أي اختبرناكم بهما هل تحجبكم عنا وعما حددنا لكم أن تقفوا عنده وقال موسى عليه السلام إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِها من تَشاءُ أي تحير وتَهْدِي من تَشاءُ\n\n\n### [من أعظم فتن الإنسان خلقه على الصورة]\n\n\nومن أعظم الفتن التي فتن الله بها الإنسان تعريفه إياه بأن خلقه على صورته ليرى هل يقف مع عبوديته وإمكانه أو يزهو من أجل مكانة صورته إذ ليس له من الصورة إلا حكم الأسماء فيتحكم في العالم تحكم المستخلف القائم بصورة الحق على الكمال وكذلك من تأييد هذه الفتنة\n\n\nقول النبي صَلَّى اللهُ عَليهِ وسَلَّم يحكيه عن ربه إن العبد إذا تقرب إلى الله بالنوافل أحبه فإذا أحبه كان سمعه الذي يسمع به وبصره الذي يبصر به وذكر اليد والرجل‏\n\n\nالحديث وإذا علم العبد أنه بهذه المثابة يسمع بالحق ويبصر بالحق ويبطش بالحق ويسعى بالحق لا بنفسه وبقي مع هذا النعت الإلهي عبدا محضا فقيرا ويكون شهوده من الحق وهو بهذه المثابة كون الحق ينزل إلى عباده بالفرح بتوبتهم والتبشيش لمن يأتي إلى بيته والتعجب من الشاب الذي قمع هواه واتصافه بالجوع نيابة عن جوع عبده وبالظمإ نيابة عن ظمأ عبده وبالمرض نيابة عن مرض عبده مع علمه بما تقتضيه عزة ربوبيته وكبريائه في ألوهيته فما أثر هذا النزول في جبروته الأعظم ولا في كبريائه الأنزه الأقدم كذلك العبد إذا أقامه الحق نائبا فيما ينبغي للرب تعالى يقول العبد ومن كمال الصورة التي قال إنه خلقني عليها أن لا يغيب عني مقام إمكاني ومنزلة عبوديتي وصفة فقري وحاجتي كما كان الحق في حال نزوله إلى صفتنا حاضرا في كبريائه وعظمته فيكون الحق مع العبد إذا وفى بهذه الصفة يثنى عليه بأنه نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ حيث لم تؤثر فيه هذه الولاية الإلهية ولا أخرجته عن فقره واضطراره ومن تجاوز حده في التقريب انعكس إلى الضد وهو البعد من الله والمقت فاحذر نفسك فإن الفتنة بالاتساع أعظم من الفتنة بالحرج والضيق‏\n\n\n### [الشهوة آلة للنفس تعلو أو تسفل بحسب موضوعها]\n\n\nوأما الشهوة فهي آلة للنفس تعلو بعلو المشتهي وتستفل باستفال المشتهي والشهوة إرادة الالتذاذ بما ينبغي أن يلتذ به واللذة لذتان روحانية وطبيعية والنفس الجزئية متولدة من الطبيعة وهي أمها والروح الإلهي أبوها فالشهوة الروحانية لا تخلص من الطبيعة أصلا وبقي من يلتذ به فلا يلتذ إلا بالمناسب ولا مناسبة بيننا وبين الحق إلا بالصورة\n\n\n### [التذاذ الإنسان بكماله هو أشد الالتذاذ]\n\n\nوالتذاذ الإنسان بكماله أشد الالتذاذ فالتذاذه بمن هو على صورته أشد التذاذ برهان ذلك أن الإنسان لا يسرى في كله الالتذاذ ولا يفنى في مشاهدة شي‏ء بكليته ولا تسري المحبة والعشق في طبيعة روحانيته إلا إذا عشق جارية أو غلاما وسبب ذلك أنه يقابله بكليته لأنه على صورته وكل شي‏ء في العالم جزء منه فلا يقابله إلا بذلك الجزء المناسب فلذلك لا يفنى في شي‏ء يعشقه إلا في مثله‏\n\n\n### [الشهوة التي هي مطلب العارفين الوارثين‏]\n\n\nفإذا وقع التجلي الإلهي في عين الصورة التي خلق آدم عليها طابق المعنى المعنى ووقع الالتذاذ بالكل وسرت الشهوة في جميع أجزاء الإنسان ظاهرا وباطنا فهي الشهوة التي هي مطلب العارفين الوارثين أ لا ترى إلى قيس المجنون في حب ليلى كيف أفناه عن نفسه لما ذكرناه وكذلك رأينا أصحاب الوله والمحبين أعظم لذة وأقوى محبة في جناب الله من حب الجنس فإن الصورة الإلهية أتم في العبد من مماثلة الجنس لأنه لا يتمكن للجنس أن يكون سمعك وبصرك بل يكون غايته إن يكون مسموعك ومدركك اسم مفعول وإذا كان العبد مدرك بحق هو أتم فلذته أعظم وشهوته‏\nأقوى فهكذا ينبغي أن تكون شهوة أهل الله‏\n\n\n### [صحبة الأحداث وأهل البدع‏]\n\n\nوأما صحبة الأحداث وهم المردان وأهل البدع الذين أحدثوا في الدين من التسنين المحمود الذي أقره الشارع فينا فينظر العارف في المردان من حيث إنه أملس لا نبات بعارضيه كالصخرة الملساء فإن الأرض المرداء هي التي لا نبات فيها فذكره مقام التجريد وأنه أحدث عهد بربه من الكبير وقد راعى الشرع ذلك في المطرف كلما قرب من التكوين كان أقرب دلالة وأعظم حرمة وأوفر لدواعي الرحمة به من الكبير البعيد عن هذا المقام وأما كونهم أحداثا لهذا المعنى لأنهم حديثو عهد بربهم وفي صحبتهم تذكر حدثهم ليتميز قدمه تعالى به فهو اعتبار صحيح وطريق موصلة وأما إن كان من أحداث التسنين فيؤيده قوله تعالى ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ وما يَأْتِيهِمْ من ذِكْرٍ من الرَّحْمنِ مُحْدَثٍ فذم من لم يتلقاه بالقبول فهكذا نظر العارفين فيه وأما المريدون والصوفية فحرام عليهم صحبة الأحداث لاستيلاء الشهوة الحيوانية عليهم بسبب العقل الذي جعله الله مقابلا لها فلو لا العقل لكانت الشهوة الطبيعية محمودة\n\n\n### [حنين العارفين إلى النساء وفي أخذ الإرفاق منهن‏]\n\n\nوأما النسوان فنظر العارفين فيهن وفي أخذ الإرفاق منهن فحنين العارفين إليهن حنين الكل إلى جزئه كاستيحاش المنازل لساكنيها التي بهم حياتها ولأن المكان الذي في الرجل الذي استخرجت منه المرأة عمره الله بالميل إليها فحنينه إلى المرأة حنين الكبير وحنوه على الصغير وأما أخذ الإرفاق منهن فإنه يأخذه منهن لهن كما أخذه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حين أمرهن أن يتصدقن لأنه يسعى في خلاصهن لما رآهن أكثر أهل النار فأشفق عليهن حيث كن منه فهو شفقة الإنسان على نفسه ولأنهن محل التكوين لصورة الكمال فحبهن فريضة واقتداء به عليه السلام‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حبب إلي من دنياكم ثلاث النساء والطيب وجعلت قرة عيني في الصلاة\n\n\nفذكر النساء أ ترى حبب إليه ما يبعده عن ربه لا والله بل حبب إليه ما يقر به من ربه ولقد فهمت عائشة أم المؤمنين ما أخذ النساء من قلب رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حين خيرهن فاخترنه فأراد الله تعالى جبرهن وإيثارهن في الوقت ومراعاتهن وإن كان بخلاف مراد رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فقال لا يَحِلُّ لَكَ النِّساءُ من بَعْدُ ولا أَنْ تَبَدَّلَ بِهِنَّ من أَزْواجٍ ولَوْ أَعْجَبَكَ حُسْنُهُنَّ إِلَّا ما مَلَكَتْ يَمِينُكَ فأبقى عليه رحمة به لما جعل في قلبه من حب النساء ملك اليمين وهذه من أشق آية نزلت على رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فقالت عائشة ما كان الله ليعذب قلب نبيه صَلَّى اللهُ عَليهِ وسَلَّم والله ما مات رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حتى أحل له النساء فمن عرف قدر النساء وسرهن لم يزهد في حبهن بل من كمال العارف حبهن فإنه ميراث نبوي وحب إلهي فإنه‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم حبب إلي‏\n\n\nفلم ينسب حبه فيهن إلا إلى الله تعالى فتدبر هذا الفصل تر عجبا\n\n\n### [الميزان المشروع موضوع لوزن أفعال العباد]\n\n\nوأما المريدون الذين هم تحت حكم الشيوخ فهم بحكم أشياخهم فيهم فإن كانوا شيوخا حقيقة مقدمين من عند الله فهم أنصح الناس لعباد الله وإن لم يكونوا فعليهم وعلى أتباعهم الحرج من الله لأن الله قد وضع الميزان المشروع في العالم لتوزن به أفعال العباد والأشياخ يسألون ولا يقتدى بأفعالهم إلا إن أمروا بذلك في أفعال معينة قال تعالى فَسْئَلُوا أَهْلَ الذِّكْرِ وهم أهل القرآن أهل الله وخاصته وأهل القرآن هم الذين يعملون به وهو الميزان الذي قلنا ولا ينبغي أن يقتدي بفعل أحد دون رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فإن أحوال الناس تختلف فقد يكون عين ما يصلح للواحد يفسد به الآخر إن عمل به والعلماء الذين يخشون الله أطباء دين الله المزيلون علله وأمراضه العارفون بالأدوية فإذا كان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قد اختلف الناس في أفعاله هل هي على الوجوب أم لا فكيف بغيره مع قول الله تعالى لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ وقوله فَاتَّبِعُونِي يُحْبِبْكُمُ الله وهذا كله ليس بنص منه في وجوب الاتباع في أفعاله فإنه صَلَّى اللهُ عَليهِ وسَلَّم قد اختص بأشياء لا يجوز لنا اتباعه فيها ولو اقتدينا به فيها كنا عاصين مأثومين‏\n\n\n### [وجوب اجتناب كل أمر يؤدى إلى شغل القلب بغير الله‏]\n\n\nفينبغي لكل مؤمن ويجب على كل مدع في طريق الله إذا لم يكن من أهل الكشف والوجود والخطاب الإلهي وممن لا يكون يطفي نور معرفته نور ورعه أن يجتنب كل أمر يؤدي إلى شغل القلب بغير الله فإنه فتنة في حقه ويجب عليه إن يغلب عقله على شهوته بل يسعى في قطع المألوفات وترك المستحسنات الطبيعية وما يميل الطبع البشري ويجتنب مواضع التهم وصحبة المبتدعين في الدين ما لم يأذن به الله وهم الأحداث وكذلك صباح الوجوه من المردان مجالسة والنساء وأخذ الإرفاق فإن القلوب تميل إلى كل من أحسن إليها والطبع يطلبهم والقوة الإلهية على دفع الشهوات النفسية ما هي‏\nهناك والمعرفة معدومة من هذا الصنف من الناس‏\n\n\n### [ما يصبر تحت الاختبار الإلهي إلا الذي حاز رتبة الكمال‏]\n\n\nوما صبر تحت الاختبار الإلهي إلا الذهب الخالص المعدني الذي حاز رتبة الكمال وما بقي فيه من تربة المعدن شي‏ء وكل تكليف فتنة وجميع المخلوقات فتنة والاطلاع على نتائج الأعمال فتنة وهي حالة مقام يستصحب إلى الجنة وكان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وهو صاحب الكشف الأتم والعالم بما ثم يستعيذ من فتنة القبر وعذاب النار وفتنة المحيا والممات‏\n\n\n### [الشهوة العرضية والشهوة الذاتية]\n\n\nوأما الشهوة فهي إرادة الملذوذات فهي لذة والتذاذ بملذوذ عند المشتهي فإنه لا يلزم أن يكون ذلك ملذوذا عند غيره ولا أن يكون موافقا لمزاجه ولا ملاءمة طبعه وذلك أن الشهوة شهوتان شهوة عرضية وهي التي يمنع من اتباعها فإنها كاذبة وإن نفعت يوما ما فلا ينبغي للعاقل أن يتبعها لئلا يرجع ذلك له عادة فتؤثر فيه العوارض وشهوة ذاتية فواجب عليه اتباعها فإن فيها صلاح مزاجه لملاءمتها طبعه وفي صلاح مزاجه وفي صلاح دينه سعادته ولكن يتبعها بالميزان الإلهي الموضوع من الشارع وهو حكم الشرع المقرر وفيها سواء كان من الرخص أو العزائم إذا كان متبعا للشرع لا يبالي فإنه طريق إلى الله مشروعة فإنه تعالى ما شرع إلا ما يوصل إليه بحكم السعادة ولا يلزم أيضا أن يكون ما يشتهيه في هذه الحال أن يشتهيه في كل حال ولا في كل وقت فينبغي له أن يعرف الحال الذي ولد تلك الشهوة عنده والوقت الذي اقتضاها وقد تتعلق بأعمال الطاعات هذه الشهوات العرضية فتوجب بعدا كمن يرى موضعا يستحسنه طبعه فيشتهي إن يصلي فيه أو لفضيلة يعلمها في ذلك الزمان على غيره فإن ذلك يؤثر في حاله مع الله أثر سوء وميزان ذلك الالتذاذ بعمل لا لشهود إلهي وهذا من المكر الخفي ولأبي يزيد في هذا قدم راسخة وقد نبه على ذلك لما سألته أمه في ليلة باردة أن يسقيها ماء وكان برا بها فثقل عليه القيام وقد كان ملتذا في جميع أحواله في خدمة أمه فاتهم نفسه في تلك اللذة إذ كان يتخيل أنه لا يلتذ بخدمة أمه إلا لإقامة حق الله ولا بعبادة إلا لإقامة حق الله فيها فرمى كل عبادة تقدمت له كان له التذاذ بها وتاب توبة جديدة\n\n\n### [أغوار النفوس لا يدركها إلا الفحول من أهل الله‏]\n\n\nفأغوار النفوس لا يدركها إلا فحول أهل الله فلا تفرح بالالتذاذ بالطاعات ورفع المشقة فيها عنك دون ميزان القوم في ذلك فإذا اقترنت هذه الشهوة بصحبة أهل البدع وهم الأحداث وبصحبة الصبيان الصباح الوجوه والنساء في الله تعالى فيما تخيل له أنه في الله تعالى ففي طي هذا التعلق مكر إلهي خفي ولو تعلق ذلك الالتذاذ منه بغير هؤلاء الأصناف فليس ذلك بميزان يعرف به مكر الله حتى يفرق بين الصحبة لله والصحبة لشهوة الطبع إلا أن يصحب العلماء بالله أهل الورع أو شيخه إن كان من أهل الأذواق فذلك أمر آخر والذي ينبغي له أن يزن به حاله في دعواه إنه ما صحب الأحداث والنساء إلا لله إذا وجد ألما ووحشة عند فقده إياهم وهيجانا إلى لقائهم وفرحا بهم عند إقبالهم فتعلم عند ذلك أن الصحبة لهذا الصنف معلومة ليست لله وإن وقعت المنفعة للمصحوب منه فيسعد المصحوب ويشقى هذا المحب شقاوتين الواحدة فقد المحبوب والأخرى بالجهل وعدم العلم فيما كان يتخيل أنه علم وأنه صحب لله وفي الله وأما إن كان ممن تتعلق تلك المحبة منه بجميع المخلوقات ومن جملة المخلوقات أيضا هؤلاء الأصناف فقد يكون ذلك خديعة نفسية وميزانه أن لا يستوحش عند مفارقة واحد واحد فإنه لا يخلو عن مشاهدة\n\n\nمخلوق فمحبوبه معه ما فارقه فإن العين واحدة لو غاب عضو من أعضاء محبوبك مع بقاء عينه معك ما وجدت ألما والخلق كلهم أعضاء بعضهم لبعض وأيضا إن تعلق بجميع المخلوقات على علم من صاحبه بعموم التعلق ابتداء في غير هؤلاء الأصناف ثم تظهر هؤلاء الأصناف ولا يجد مزيدا في ميزانه فيدخلهم في عموم ذلك التعلق فذلك مبناه على أصل صحيح وإن انجر معه الطبع في هذا الصنف ووجد معه الألم عند فقده على الخصوص فذلك لا يؤثر في خلوص تعلقه الإلهي في دعوته ونصيحته لصحة الأصل فإن حدث عنده عموم التعلق في ثاني الحال من تعلقه بصحبة هذا الصنف فلا يعول عليه فذلك تلبيس من النفس فليحذر منه وليترك صحبتهم جملة واحدة وكلامنا إنما هو مع أهل الطريق ولا بد من تمحيص هذا التعميم الذي وجده في ثاني حال من صحبتهم كما يمحص نفسه صاحب السماع المقيد بالنغمات إذا أرسله مطلقا بعد تحصيله ابتداء من المقيد بالنغمات فهو أصل معلول فلا يعتمد من هذه حالته على سماعه المطلق المكتسب في ثاني حال فإن ذلك تلبيس النفس حتى لا تترك السماع المقيد\n\n\n### [عيون العارفين في قلوبهم يرون ما تجهله من نفسك‏]\n\n\nوالإنسان إذا أنصف لربه من نفسه ولنفسه من نفسه عرف حاله بل كان أعرف بحاله من غيره إلا من العارفين بالله فإنهم أعرف به من‏\nنفسه لأن العارفين لهم أعين في قلوبهم فتحتها لهم المعرفة يرون بها منك ما تجهله أنت من نفسك لأنه ليست لك تلك العين ولهذا قال الجنيد العارف من ينطق عن سرك وأنت ساكت والسكوت عدم الكلام فمعناه يعرف منك ما لا تعرفه أنت من نفسك كالخفي من سوء المزاج يعرفه الطبيب منك إذا نظر إليك ولا تعرفه أنت وهؤلاء أطباء النفوس‏\n\n\n### [الحذر من أخذ الإرفاق من النساء ومن صحبة الأحداث‏]\n\n\nواعلموا أن الشيوخ إنما حذروا من أخذ الإرفاق من النساء ومن صحبة الأحداث لما ذكرناه من الميل الطبيعي فلا ينبغي للمريد أن يأخذ رفقا من النساء حتى يرجع هو في نفسه امرأة فإذا تأنث والتحق بالعالم الأسفل ورأى تعشق العالم الأعلى به وشهد نفسه في كل حال ووقت ووارد منكوحا دائما ولا يبصر لنفسه في كشفه الصوري وحاله ذكرا ولا أنه رجل أصلا بل أنوثة محضة ويحمل من ذلك النكاح ويلد وحينئذ يجوز له أخذ الرفق من النساء ولا يضره الميل إليهن وحبهن وأما أخذ العارفين فمطلق لأن مشهودهم اليد الإلهية المقدسة المطلقة في الأخذ والعطاء وكل شخص يعرف حاله والطريق صدق كله وجد لا يقبل الهزل ولا الطفيلي عنده وإن سامح الحق‏\n\n",
    "en": "Chapter One Hundred and Eight: Concerning the Knowledge of Trial (فتنة), Desire (شهوة), the Companionship of Youths (أحداث) and Women (نسوان), the Acceptance of Favors (إرفاق) from Them, and When the Seeker (مريد) May Accept Favors\n\n> Do not keep company with a youth (حدث) if you are one who is susceptible to temptation (حدث),\n> Nor women; rather, be occupied with Allah.\n> And beware of the blind trial (الفتنة العمياء), for it has\n> A powerful dominion over the heart that is heedless.\n> And beware of the desire (شهوة) of the soul, for how many times has it destroyed\n> A master whose heart was distracted from his Lord.\n> And no one sees the taking of a favor (رفق) from a woman as permissible\n> Except he who has attained perfection among the men of Allah.\n\n### [Trial is Testing, Confusion, and Guidance]\n\nKnow, may Allah strengthen you, that *fitna* (الفتنة) is the trial (اختبار). It is said, \"I tried the silver with fire,\" meaning, \"I tested it.\" Allah the Exalted said: <<Indeed, your wealth and your children are a trial (فتنة)>>. Meaning, We have tested you with them to see whether they will veil you from Us and from what We have defined for you to adhere to. And Moses, peace be upon him, said: <<It is nothing but Your trial (فتنتك); You lead astray thereby whom You will>>. Meaning, You cause confusion and You guide whom You will.\n\n### [The Greatest Trial for Humanity is Its Creation Upon the Form]\n\nAnd among the greatest trials (فتن) with which Allah has tried humanity is His informing humanity that He created them upon His form (صورته). This is to see whether they will remain firm in their servitude (عبودية) and contingency (إمكان), or become arrogant because of the status of their form, since they possess nothing of the form except the ruling of the Names (الأسماء). Thus, they govern the world (العالم) with the governance of the vicegerent (المستخلف) who perfectly embodies the form of the Real (صورة الحق).\n\nLikewise, supporting this trial (فتنة) is the saying of the Prophet, may Allah bless him and grant him peace, relating from his Lord: \"When the servant draws near to Allah through supererogatory acts (نوافل), He loves him. And when He loves him, He becomes his hearing with which he hears, and his sight with which he sees,\" and he mentioned the hand and the foot—the rest of the Hadith.\n\nWhen the servant knows that he is in this station, hearing by the Real (الحق), seeing by the Real, striking by the Real, and striving by the Real, not by himself, and yet remains, despite this Divine description (النعت الإلهي), a pure, poor servant, his witnessing (شهود) of the Real, while he is in this station, is that the Real descends to His servants with joy at their repentance, with delight for those who come to His House, and with wonder at the youth who suppressed his passion. It is also His description of Himself with hunger, acting on behalf of the hunger of His servant, with thirst, acting on behalf of the thirst of His servant, and with sickness, acting on behalf of the sickness of His servant—all this while knowing what the might of His Lordship (ربوبية) and His grandeur (كبرياء) in His Divinity (ألوهية) necessitate. This descent does not affect His Greatest Omnipotence (جبروت) nor His Most Transcendent and Ancient Grandeur.\n\nLikewise, when the Real establishes the servant as a vicegerent (نائب) in what is fitting for the Lord the Exalted, the servant says: \"And part of the perfection of the form (صورة) upon which He said He created me is that the station of my contingency (إمكان), the rank of my servitude (عبودية), and the description of my poverty and need (فقر وحاجة) never vanish from me.\" Just as the Real, in the state of His descent to our description, was present in His grandeur and majesty.\n\nThus, the Real is with the servant when he fulfills this description, praising him by saying: <<What an excellent servant! Indeed, he was ever returning [to Allah]>>. This is because this Divine guardianship (ولاية إلهية) did not affect him or remove him from his poverty and necessity. Whoever exceeds his limit in drawing near (تقريب) is reversed into the opposite, which is distance from Allah and hatred. So beware of your soul, for the trial (فتنة) through expansion is greater than the trial through restriction and distress.\n\n### [Desire is an Instrument for the Soul, Rising or Falling According to Its Object]\n\nAs for desire (الشهوة), it is an instrument (آلة) for the soul (النفس); it rises with the elevation of the desired object and falls with the lowliness of the desired object. Desire is the will to derive pleasure (التذاذ) from that which ought to be enjoyed. Pleasure (اللذة) is of two kinds: spiritual (روحانية) and natural (طبيعية). The particular soul (النفس الجزئية) is generated from Nature (الطبيعة), which is its mother, and the Divine Spirit (الروح الإلهي) is its father. Thus, spiritual desire never completely escapes Nature. Concerning the one who derives pleasure, he only derives pleasure from what is suitable (مناسب). And there is no suitability between us and the Real (الحق) except through the form (صورة).\n\n### [A Human’s Pleasure in His Own Perfection is the Most Intense Pleasure]\n\nThe pleasure (التذاذ) a human derives from his own perfection is the most intense pleasure. Therefore, his pleasure in that which is upon his form (صورته) is the most intense pleasure. The proof of this is that pleasure does not permeate the human entirely, nor does he become annihilated (يفنى) in the witnessing (مشاهدة) of anything with his totality, nor does love (محبة) and passionate devotion (عشق) permeate the nature of his spirituality, unless he loves a young woman or a youth (غلام). The reason for this is that he confronts it with his totality because it is upon his form. Everything else in the world (العالم) is a part of him, so he only confronts it with that corresponding part. Therefore, he is not annihilated in anything he loves except in its like.\n\n### [The Desire that is the Goal of the Gnostics and the Inheritors]\n\nWhen the Divine Self-disclosure (التجلي الإلهي) occurs in the very essence of the form (صورة) upon which Adam was created, the meaning corresponds to the meaning, and pleasure (التذاذ) occurs with the totality. And desire (شهوة) permeates all parts of the human, outwardly and inwardly. This is the desire that is the goal of the Gnostics (العارفين) and the Inheritors (الوارثين). Do you not see how Qays the Madman, in his love for Layla, was annihilated (أفناه) from himself due to what we have mentioned? Likewise, we have seen that those possessed by rapture (وله) and the lovers (محبين) have greater pleasure and stronger love in the presence of Allah than the love of gender. For the Divine Form (الصورة الإلهية) is more complete in the servant than the similarity of gender. Because it is not possible for gender to become your hearing and your sight; rather, its utmost is to be your heard object and your perceived object. And if the servant is the perceiver by the Real (مدرك بحق), which is more complete, then his pleasure is greater and his desire (شهوة) is stronger. Thus, this is how the desire of the People of Allah (أهل الله) ought to be.\n\n### [The Companionship of Youths and the People of Innovation]\n\nAs for the companionship of youths (أحداث)—who are beardless boys (*al-murdān*)—and the People of Innovation (أهل البدع) who introduce praiseworthy practices (تسنين محمود) in the religion that the Lawgiver (الشارع) has sanctioned for us: The Gnostic (العارف) looks at the beardless boys from the perspective that they are smooth, without hair on their cheeks, like a smooth rock. This reminds him of the station of abstraction (مقام التجريد) and that they are newer in covenant with their Lord than the elder. The Law (الشرع) has taken this into account regarding the newly born: the closer they are to the moment of creation (تكوين), the closer they are in indication, the greater their sanctity, and the more abundant the calls for mercy upon them than upon the elder who is far from this station. As for their being called youths (*ahdath*) in this sense, it is because they are recent in covenant with their Lord. In their company, one remembers their newness (حدثهم) so that the Eternity (قدمه) of the Exalted may be distinguished by it. This is a sound consideration and a path that leads to Allah.\n\nBut if it refers to the newness of legislation (أحداث التسنين), it is supported by the saying of the Exalted: <<No fresh reminder (ذكر محدث) comes to them from their Lord>> and <<And no fresh reminder (ذكر محدث) comes to them from the Most Merciful>>. He censured those who did not receive it with acceptance. This is how the Gnostics (العارفين) view it.\n\nAs for the seekers (مريدون) and the Sufis, the companionship of youths (أحداث) is forbidden to them due to the dominance of animal desire (الشهوة الحيوانية) over them, which is countered by the intellect (العقل) that Allah placed opposite it. Were it not for the intellect, natural desire (الشهوة الطبيعية) would be praiseworthy.\n\n### [The Yearning of the Gnostics for Women and the Taking of Favors from Them]\n\nAs for women (نسوان), the Gnostics’ view of them and the taking of favors (إرفاق) from them: The yearning (حنين) of the Gnostics toward them is the yearning of the whole toward its part, like the longing of dwellings for their inhabitants, by whom they are brought to life. And because the place in the man from which the woman was extracted—Allah filled it with inclination toward her. Thus, his yearning for the woman is the yearning of the elder and his compassion for the younger.\n\nAs for taking favors (إرفاق) from them, he takes it from them for their sake, just as the Messenger of Allah, may Allah bless him and grant him peace, took it when he commanded them to give charity. This is because he strives for their salvation, having seen that they constitute the majority of the inhabitants of the Fire. So he had compassion for them, since they originated from him; thus, it is the compassion of a human for himself. And because they are the locus of formation (محل التكوين) for the form of perfection (صورة الكمال), loving them is an obligation and an emulation of him, peace be upon him.\n\nThe Messenger of Allah, may Allah bless him and grant him peace, said: \"Three things from your world have been made beloved to me: women, perfume, and the coolness of my eye has been placed in the prayer.\" He mentioned women. Do you think that what distances him from his Lord was made beloved to him? No, by Allah! Rather, what brings him closer to his Lord was made beloved to him.\n\nAnd indeed, Aisha, the Mother of the Believers, understood the hold women had on the heart of the Messenger of Allah, may Allah bless him and grant him peace, when he gave them a choice and they chose him. So Allah the Exalted desired to console them, favor them at that time, and show consideration for them, even if it was contrary to the desire of the Messenger of Allah, may Allah bless him and grant him peace. So He said: <<Women are not lawful for you hereafter, nor that you should exchange them for other wives, even if their beauty should please you, except those whom your right hand possesses>>. Thus, He left for him, out of mercy for him, the slave women (ملك اليمين) due to the love for women He had placed in his heart. This was one of the most difficult verses revealed to the Messenger of Allah, may Allah bless him and grant him peace. So Aisha said, \"Allah would not torment the heart of His Prophet, may Allah bless him and grant him peace.\" By Allah, the Messenger of Allah, may Allah bless him and grant him peace, did not die until women were made lawful for him again.\n\nWhoever knows the worth of women and their secret (سرهن) does not abstain from loving them. Rather, loving them is part of the perfection of the Gnostic (العارف), for it is a prophetic inheritance and a Divine love, since he said, may Allah bless him and grant him peace, \"has been made beloved to me.\" He did not attribute his love for them except to Allah the Exalted. Reflect upon this section, and you will see wonders.\n\n### [The Prescribed Balance is Established to Weigh the Actions of Servants]\n\nAs for the seekers (مريدون) who are under the authority of the Shaykhs (شيوخ), their ruling concerning them is according to their Shaykhs. If they are truly Shaykhs, appointed by Allah, then they are the most sincere advisors to the servants of Allah. But if they are not, then they and their followers bear the burden (حرج) from Allah. This is because Allah has established the prescribed Balance (الميزان المشروع) in the world (العالم) by which the actions of the servants are weighed. The Shaykhs are questioned, and their actions are not to be emulated unless they command it in specific actions. Allah the Exalted said: <<So ask the People of Remembrance (أهل الذكر)>>. They are the People of the Quran, the People of Allah and His elect. And the People of the Quran are those who act upon it, and it is the Balance (الميزان) we mentioned.\n\nIt is not proper to emulate the action of anyone other than the Messenger of Allah, may Allah bless him and grant him peace. For the states of people differ; the very thing that is beneficial for one person may corrupt another if he acts upon it. The scholars who fear Allah are the physicians of Allah’s religion, removing its ailments and diseases, and knowing the remedies. If people differed concerning the actions of the Messenger of Allah, may Allah bless him and grant him peace, as to whether they were obligatory or not, then how about others? This is despite the saying of Allah the Exalted: <<Indeed, in the Messenger of Allah you have an excellent example>> and His saying: <<So follow me, [and] Allah will love you>>. All of this is not an explicit text regarding the obligation of following all of his actions. For he, may Allah bless him and grant him peace, was distinguished by certain things in which it is not permissible for us to follow him; and if we were to emulate him in them, we would be disobedient and sinful.\n\n### [The Obligation to Avoid Everything that Occupies the Heart with Other than Allah]\n\nIt is proper for every believer, and obligatory upon every claimant on the path of Allah, if he is not among the People of Unveiling (أهل الكشف), Being (الوجود), and Divine Address (الخطاب الإلهي), and not among those whose light of gnosis (نور معرفة) does not extinguish the light of their piety (نور ورع): That he must avoid every matter that leads to the occupation of the heart with other than Allah, for that is a trial (فتنة) in his case. And it is obligatory upon him to overcome his desire (شهوة) with his intellect (عقل); rather, he should strive to cut off familiar habits, abandon natural pleasantries, and whatever the human nature inclines toward. And he must avoid places of suspicion, and the companionship of innovators in religion—unless Allah permits it—who are the youths (أحداث). Likewise, sitting with handsome-faced beardless boys (*al-murdān*) and women, and taking favors (إرفاق). For hearts incline toward everyone who treats them kindly, and nature seeks them out. And the Divine power to repel the desires of the soul (الشهوات النفسية) is not present there, and gnosis (معرفة) is absent in this class of people.\n\n### [None Endures the Divine Trial Except He Who Has Attained the Rank of Perfection]\n\nNone endures under the Divine trial (الاختبار الإلهي) except the pure mineral gold that has attained the rank of perfection (رتبة الكمال), and nothing of the ore’s earth remains in it. Every religious obligation (تكليف) is a trial (فتنة), and all creatures (المخلوقات) are a trial. And observing the results of actions is a trial, which is a state of station (مقام) that accompanies one to Paradise. And the Messenger of Allah, may Allah bless him and grant him peace—who possessed the most complete Unveiling (الكشف الأتم) and knew what was there—sought refuge from the trial of the grave, the punishment of the Fire, and the trial of life and death.\n\n### [Accidental Desire and Essential Desire]\n\nAs for desire (الشهوة), it is the will for pleasures (الملذوذات); it is pleasure and the deriving of pleasure from a desired object according to the one who desires it. For it is not necessary that this object be pleasurable to others, nor that it conform to their temperament (مزاج) or suit their nature (طبع). This is because desire is of two kinds: accidental desire (شهوة عرضية), which one is forbidden from following, for it is false. Even if it benefits one day, the rational person should not follow it, lest it become a habit for him, and the accidents (العوارض) affect him.\n\nAnd essential desire (شهوة ذاتية), which he is obligated to follow, for in it lies the soundness of his temperament (مزاج) due to its suitability to his nature (طبع). And in the soundness of his temperament and the soundness of his religion lies his happiness (سعادة). But he must follow it according to the Divine Balance (الميزان الإلهي) established by the Lawgiver (الشارع), which is the confirmed ruling of the Law (حكم الشرع). In it—whether it consists of dispensations (رخص) or strict obligations (عزائم)—if he is following the Law, he should not worry, for it is a legitimate path to Allah. For the Exalted only legislated what leads to Him by the ruling of happiness.\n\nIt is also not necessary that what he desires in this state he desires in every state or at every time. So he should know the state that gave birth to that desire in him and the time that necessitated it. These accidental desires (شهوات عرضية) may sometimes attach themselves to acts of obedience (طاعات) and cause distance. Like someone who sees a place that his nature finds pleasing and desires to pray there, or because of a virtue he knows that time possesses over others. For that negatively affects his state with Allah. The measure of this is deriving pleasure from the action, not from Divine Witnessing (شهود إلهي). And this is part of the subtle Divine deception (المكر الخفي).\n\nAbu Yazid had a firm footing in this matter. He drew attention to this when his mother asked him on a cold night to give her water, and he was dutiful to her, but rising was difficult for him. He had been deriving pleasure in all his states while serving his mother. So he suspected his soul concerning that pleasure, since he had imagined that he only derived pleasure from serving his mother for the sake of establishing Allah's right, and only derived pleasure from worship for the sake of establishing Allah's right in it. He therefore discarded every previous act of worship in which he had found pleasure and repented with a new repentance.\n\n### [The Depths of the Souls are Only Grasped by the Champions Among the People of Allah]\n\nThe depths of the souls (أغوار النفوس) are only grasped by the champions (فحول) among the People of Allah (أهل الله). So do not rejoice in deriving pleasure from acts of obedience (طاعات) and the removal of hardship in them, without applying the Balance (ميزان) of the People in this regard.\n\nIf this desire (شهوة) is coupled with the companionship of the People of Innovation (أهل البدع)—who are the youths (أحداث)—and the companionship of handsome-faced boys and women, *for the sake of Allah the Exalted*, in what he imagines to be for the sake of Allah the Exalted, then within the folds of this attachment lies a subtle Divine deception (مكر إلهي خفي). Even if that pleasure were attached to categories other than these, that would not be a Balance (ميزان) by which the deception of Allah is known, so as to distinguish between companionship for the sake of Allah and companionship for the desire of nature (شهوة الطبع). This is unless he keeps company with the scholars of Allah (العلماء بالله), the People of Piety (أهل الورع), or his Shaykh, if the latter is among the People of Spiritual Tastes (أهل الأذواق); that is another matter.\n\nWhat he ought to use to weigh his state, in his claim that he only kept company with youths and women for the sake of Allah, is: If he finds pain and loneliness (وحشة) upon losing them, agitation to meet them, and joy when they approach. Then he knows at that point that the companionship with this category is known [to be for desire] and is not for the sake of Allah. Even if benefit accrues to the one accompanied, so the accompanied one is happy, this lover is wretched with two wretchednesses: the first is the loss of the beloved, and the second is ignorance and lack of knowledge regarding what he imagined was knowledge and that he kept company for Allah and in Allah.\n\nBut if he is one whose love attaches to all creatures (المخلوقات), and these categories are also included among the creatures, that may be a deception of the soul (خديعة نفسية). Its measure is that he should not feel lonely (يستوحش) upon the separation of any single one. For he is never devoid of witnessing a creature (مخلوق), so his beloved is with him and has not left him. For the Eye is one; if a limb of your beloved were absent while His Eye remained with you, you would not feel pain. And all creation (الخلق) are limbs of one another.\n\nFurthermore, if he attaches to all creatures, knowing the generality of the attachment initially, excluding these categories, then these categories appear, and he finds no increase in his Balance (ميزان), so he includes them in the generality of that attachment—that is based on a sound principle. Even if nature (طبع) is drawn along with him toward this category, and he finds pain upon their specific loss, that does not affect the sincerity of his Divine attachment (تعلق إلهي) in his call and advice, due to the soundness of the principle.\n\nBut if the generality of attachment arises in him in the second state, subsequent to his attachment to the companionship of this category, he should not rely on it. That is a delusion (تلبيس) from the soul, so let him beware of it and abandon their companionship entirely. Our discussion is only with the People of the Path (أهل الطريق). It is necessary to scrutinize this generalization he found in the second state of their companionship, just as the practitioner of audition (سماع) restricted by melodies scrutinizes himself if he releases it absolutely after having initially achieved it through restricted melodies. That is a flawed principle, so one whose state is this should not rely on his absolute audition acquired in the second state, for that is a delusion of the soul so that it does not abandon restricted audition.\n\n### [The Eyes of the Gnostics are in Their Hearts; They See What You Are Ignorant of in Yourself]\n\nIf a human is fair to his Lord concerning his soul, and fair to his soul concerning himself, he knows his state; rather, he is more knowledgeable of his state than others. Except for the Gnostics of Allah (العارفين بالله), for they know him better than he knows himself. This is because the Gnostics have eyes in their hearts, opened for them by Gnosis (المعرفة), through which they see in you what you are ignorant of in yourself, because you do not possess that eye. For this reason, Al-Junayd said, \"The Gnostic (العارف) is he who speaks about your secret (سر) while you are silent.\" And silence is the absence of speech. Its meaning is that he knows about you what you do not know about yourself, like a hidden ailment of temperament (سوء المزاج) that the physician knows about you when he looks at you, but you do not know it. And these [Gnostics] are the physicians of the souls.\n\n### [Warning Against Taking Favors from Women and the Companionship of Youths]\n\nKnow that the Shaykhs only warned against taking favors (إرفاق) from women and against the companionship of youths (أحداث) because of the natural inclination (الميل الطبيعي) we mentioned. Thus, it is not proper for the seeker (مريد) to take a favor (رفق) from women until he himself becomes a woman in his soul. When he becomes feminized (تأنث) and joins the lower world (العالم الأسفل), and sees the passionate devotion of the higher world (العالم الأعلى) toward him, and witnesses himself in every state, time, and incoming inspiration as perpetually being penetrated (منكوحا), and does not perceive for himself, in his formal unveiling (كشف صوري) and his state, any masculinity (ذكر) or that he is a man at all, but rather pure femininity (أنوثة محضة), and he conceives from that penetration and gives birth—at that point, it is permissible for him to take the favor (رفق) from women, and the inclination toward them and the love for them will not harm him.\n\nAs for the taking of the Gnostics (العارفين), it is absolute, because what they witness (مشهودهم) is the Holy, Absolute Divine Hand (اليد الإلهية المقدسة المطلقة) in giving and taking. And every person knows his own state. The Path is entirely sincerity and earnestness; it accepts neither jest nor the parasite, even if the Real (الحق) is forgiving.",
    "ur": "باب ایک سو آٹھ: فتنہ (الفتنة)، شہوت (الشهوة)، نوعمر لڑکوں (الأحداث) اور عورتوں (النسوان) کی صحبت، ان سے مالی امداد (الإرفاق) لینے، اور مرید کب مالی امداد لے سکتا ہے، کے بیان میں۔\n\n> لا تصحبن حدثا إن كنت ذا حدث *** ولا نساء وكن بالله مشتغلا\n> واحذر من الفتنة العمياء أن لها *** حكما قويا على القلب الذي غفلا\n> وشهوة النفس فاحذرها فكم فتكت *** بسيد قلبه عن ربه عفلا\n> ولا يرى أخذا رفقا من امرأة *** إلا الذي من رجال الله قد كملا\n\nاگر تم نوعمر لڑکوں (حدث) کی طرف مائل ہو تو ان کی صحبت اختیار نہ کرو،\nاور نہ ہی عورتوں کی، بلکہ ذات حق (اللہ) کے ساتھ مشغول رہو۔\nاور اندھے فتنہ (الفتنة العمياء) سے بچو، کیونکہ اس کا\nغافل دل پر بہت سخت حکم ہوتا ہے۔\nاور نفس کی شہوت (شهوة النفس) سے بچو، کیونکہ اس نے کتنے ہی سرداروں کو ہلاک کیا،\nجن کا دل اپنے رب سے غافل ہو گیا۔\nاور عورت سے مالی امداد (رفق) لینا صرف وہی شخص دیکھتا ہے (جائز سمجھتا ہے)\nجو رجال اللہ میں سے کامل ہو چکا ہو۔\n\n### [فتنہ (الفتنة) آزمائش، حیرت اور ہدایت ہے]\n\nجان لو، اللہ تمہاری تائید کرے، کہ فتنہ (الفتنة) آزمائش ہے۔ کہا جاتا ہے: \"میں نے چاندی کو آگ سے آزمایا (فتنت الفضة بالنار)\" جب تم نے اسے پرکھا۔ اللہ تعالیٰ فرماتا ہے: \"إِنَّما أَمْوالُكُمْ وأَوْلادُكُمْ فِتْنَةٌ\" (بیشک تمہارے مال اور تمہاری اولادیں ایک آزمائش ہیں) یعنی ہم نے تمہیں ان کے ذریعے آزمایا کہ کیا وہ تمہیں ہم سے اور ان حدود سے روکتے ہیں جن پر ہم نے تمہیں ٹھہرنے کا حکم دیا ہے۔ اور موسیٰ علیہ السلام نے فرمایا: \"إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِها من تَشاءُ\" (یہ تو بس تیری آزمائش (فتنتك) ہے، تو اس کے ذریعے جسے چاہتا ہے گمراہ کرتا ہے) \"وتَهْدِي من تَشاءُ\" (اور جسے چاہتا ہے ہدایت دیتا ہے)۔\n\n### [انسان کے سب سے بڑے فتنوں میں سے ایک اس کی صورت پر تخلیق ہے]\n\nان سب سے بڑی آزمائشوں (الفتن) میں سے جن سے اللہ نے انسان کو آزمایا، یہ ہے کہ اسے یہ بتایا کہ اسے اپنی صورت پر پیدا کیا ہے، تاکہ وہ دیکھے کہ کیا وہ اپنی بندگی (عبودیت) اور امکانیت پر قائم رہتا ہے یا اپنی صورت کی منزلت کی وجہ سے فخر کرتا ہے، کیونکہ صورت میں اس کے لیے صرف اسماء کا حکم ہے، پس وہ عالم میں خلیفہ کی طرح تصرف کرتا ہے جو ذات حق (الحق) کی صورت پر کمال کے ساتھ قائم ہے۔ اور اسی فتنہ (الفتنة) کی تائید میں ہے۔\n\nنبی اکرم صَلَّى اللهُ عَليهِ وسَلَّم کا اپنے رب سے روایت کردہ فرمان ہے: \"جب بندہ نوافل کے ذریعے اللہ کا قرب حاصل کرتا ہے تو اللہ اسے محبوب بنا لیتا ہے، اور جب وہ اسے محبوب بنا لیتا ہے تو وہ اس کا کان بن جاتا ہے جس سے وہ سنتا ہے، اور اس کی آنکھ بن جاتا ہے جس سے وہ دیکھتا ہے، اور ہاتھ اور پاؤں کا ذکر کیا۔\" (الحدیث)\n\nاور جب بندہ جان لیتا ہے کہ وہ اس مقام پر ہے، کہ وہ ذات حق (الحق) کے ذریعے سنتا ہے، ذات حق (الحق) کے ذریعے دیکھتا ہے، ذات حق (الحق) کے ذریعے پکڑتا ہے، اور ذات حق (الحق) کے ذریعے چلتا ہے، نہ کہ اپنے نفس کے ذریعے، اور اس الٰہی وصف کے باوجود وہ محض بندہ، فقیر باقی رہتا ہے، اور اس کا شہود (شهود) ذات حق (الحق) کی طرف سے ہوتا ہے، اور وہ اس مقام پر ہوتا ہے کہ ذات حق (الحق) اپنے بندوں کی طرف ان کی توبہ پر خوشی کے ساتھ نازل ہوتا ہے، اور جو اس کے گھر آتا ہے اس سے خوش ہوتا ہے، اور اس نوجوان پر تعجب کرتا ہے جس نے اپنی خواہش کو کچل دیا، اور اپنے بندے کی بھوک کی نیابت میں بھوک سے متصف ہوتا ہے، اور اپنے بندے کی پیاس کی نیابت میں پیاس سے، اور اپنے بندے کی بیماری کی نیابت میں بیماری سے، اس علم کے باوجود کہ اس کی ربوبیت (ربوبيته) کی عزت اور اس کی الوہیت (ألوهيته) کی کبریائی کا کیا تقاضا ہے۔ پس اس نزول نے اس کی عظیم جبروت (جبروت) میں اور اس کی پاکیزہ قدیم کبریائی میں کوئی اثر نہیں ڈالا۔ اسی طرح بندہ جب ذات حق (الحق) اسے نائب بنا کر ان امور میں قائم کرتا ہے جو رب تعالیٰ کے لیے مناسب ہیں، تو بندہ کہتا ہے: اور اس صورت کے کمال میں سے جس پر اس نے کہا کہ مجھے پیدا کیا ہے، یہ ہے کہ میری امکانیت کا مقام، میری بندگی (عبودیت) کی منزلت، اور میری فقر و حاجت کی صفت مجھ سے غائب نہ ہو۔ جیسا کہ ذات حق (الحق) ہمارے وصف کی طرف نزول کے وقت اپنی کبریائی اور عظمت میں حاضر تھا۔ پس ذات حق (الحق) بندے کے ساتھ ہوتا ہے جب وہ اس صفت کو پورا کرتا ہے، تو اس کی تعریف کی جاتی ہے کہ وہ \"نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ\" (وہ کیا ہی اچھا بندہ ہے، بیشک وہ بہت رجوع کرنے والا ہے) جہاں اس الٰہی ولایت نے اس پر اثر نہیں ڈالا اور نہ ہی اسے اس کے فقر اور اضطرار سے نکالا۔ اور جس نے قربت میں اپنی حد سے تجاوز کیا، وہ اس کے برعکس ہو گیا، یعنی اللہ سے دوری اور ناراضگی۔ پس اپنے نفس سے بچو، کیونکہ وسعت میں فتنہ (الفتنة) تنگی اور حرج میں فتنہ (الفتنة) سے زیادہ عظیم ہے۔\n\n### [شہوت (الشهوة) نفس کا ایک آلہ ہے جو اپنے موضوع کے لحاظ سے بلند یا پست ہوتا ہے]\n\nاور جہاں تک شہوت (الشهوة) کا تعلق ہے، تو یہ نفس کا ایک آلہ ہے جو مشتہیٰ (جس کی خواہش کی جائے) کی بلندی سے بلند ہوتا ہے اور مشتہیٰ کی پستی سے پست ہوتا ہے۔ اور شہوت (الشهوة) اس چیز سے لذت حاصل کرنے کا ارادہ ہے جس سے لذت حاصل کرنا مناسب ہو۔ اور لذت دو طرح کی ہے: روحانی اور طبعی۔ اور نفس جزئی (النفس الجزئية) طبیعت سے پیدا ہوا ہے اور وہ اس کی ماں ہے، اور روح الٰہی اس کا باپ ہے۔ پس روحانی شہوت (الشهوة الروحانية) طبیعت سے بالکل پاک نہیں ہوتی، اور باقی رہا وہ جس سے لذت حاصل کی جاتی ہے، تو لذت صرف مناسب چیز سے ہی حاصل کی جاتی ہے، اور ہمارے اور ذات حق (الحق) کے درمیان صورت (الصورة) کے سوا کوئی مناسبت نہیں ہے۔\n\n### [انسان کا اپنے کمال سے لذت حاصل کرنا سب سے شدید لذت ہے]\n\nاور انسان کا اپنے کمال سے لذت حاصل کرنا سب سے شدید لذت (التذاذ) ہے۔ پس اس کا اس سے لذت حاصل کرنا جو اس کی صورت پر ہے، سب سے شدید لذت ہے۔ اس کی دلیل یہ ہے کہ انسان کے پورے وجود میں لذت سرایت نہیں کرتی، اور نہ ہی وہ کسی چیز کے مشاہدہ (مشاهدة) میں کلیت کے ساتھ فنا ہوتا ہے، اور نہ ہی محبت اور عشق اس کی روحانی طبیعت میں سرایت کرتا ہے، مگر جب وہ کسی لڑکی یا لڑکے سے عشق کرے۔ اور اس کی وجہ یہ ہے کہ وہ اس کا مقابلہ اپنی کلیت کے ساتھ کرتا ہے کیونکہ وہ اس کی صورت پر ہے۔ اور عالم کی ہر چیز اس کا ایک جزو ہے، پس وہ اس کا مقابلہ صرف اس مناسب جزو سے کرتا ہے۔ اسی لیے وہ کسی بھی چیز سے عشق میں فنا نہیں ہوتا مگر اپنے ہی جیسے میں۔\n\n### [وہ شہوت (الشهوة) جو عارفین وارثین کا مطلوب ہے]\n\nپس جب آدم (علیہ السلام) جس صورت پر پیدا کیے گئے تھے، اس کی عین صورت میں ظہور الٰہی (التجلی الإلهي) واقع ہوتا ہے، تو معنی معنی کے مطابق ہو جاتا ہے، اور کلیت کے ساتھ لذت واقع ہوتی ہے، اور شہوت (الشهوة) انسان کے تمام ظاہری اور باطنی اجزاء میں سرایت کر جاتی ہے۔ پس یہی وہ شہوت (الشهوة) ہے جو عارفین وارثین کا مطلوب ہے۔ کیا تم قیس مجنون کو لیلیٰ کی محبت میں نہیں دیکھتے کہ اس نے اسے اپنے نفس سے فنا کر دیا، جیسا کہ ہم نے ذکر کیا۔ اسی طرح ہم نے دیکھا کہ اہل و لہ اور محبین کو جنس کی محبت کے مقابلے میں ذات حق (اللہ) کی جناب میں زیادہ عظیم لذت اور قوی محبت حاصل ہوتی ہے، کیونکہ الٰہی صورت (الصورة الإلهية) بندے میں جنسی مماثلت سے زیادہ کامل ہے۔ کیونکہ جنس کے لیے یہ ممکن نہیں کہ وہ تمہارا کان اور تمہاری آنکھ بن جائے، بلکہ اس کی انتہا یہ ہے کہ وہ تمہارا مسموع اور تمہارا مدرک (اسم مفعول) ہو۔ اور جب بندہ ذات حق (الحق) کے ذریعے مدرک ہو تو وہ زیادہ کامل ہے، پس اس کی لذت زیادہ عظیم اور اس کی شہوت (الشهوة) زیادہ قوی ہوتی ہے۔ پس اہل اللہ کی شہوت (الشهوة) ایسی ہی ہونی چاہیے۔\n\n### [نوعمر لڑکوں (الأحداث) اور اہل بدعت کی صحبت]\n\nاور جہاں تک نوعمر لڑکوں (الأحداث) کی صحبت کا تعلق ہے، جو کہ امرد (مردان) ہیں، اور اہل بدعت کا، جنہوں نے دین میں ایسی سنتیں ایجاد کیں جو محمود ہیں اور جنہیں شارع نے ہم میں برقرار رکھا ہے، تو عارف نوعمر لڑکوں (المردان) کو اس لحاظ سے دیکھتا ہے کہ وہ بے ریش ہیں، ان کے رخساروں پر بال نہیں ہیں، جیسے کہ ہموار چٹان (الصخرة الملساء)۔ کیونکہ بے نبات زمین (الأرض المرداء) وہ ہے جس میں کوئی نباتات نہ ہو۔ پس یہ اسے تجرید (التجريد) کے مقام کی یاد دلاتا ہے، اور یہ کہ وہ بڑے شخص کے مقابلے میں اپنے رب سے زیادہ نیا عہد رکھتا ہے۔ اور شریعت نے اس کا لحاظ ہر اس شخص میں رکھا ہے جو تکوین (التكوين) کے قریب ہو، وہ زیادہ قریب کی دلیل ہوتا ہے، زیادہ عظیم حرمت رکھتا ہے، اور اس بڑے شخص کے مقابلے میں اس پر رحمت کے تقاضے زیادہ ہوتے ہیں جو اس مقام سے دور ہے۔ اور ان کا اس معنی میں نوعمر (أحداث) ہونا اس لیے ہے کہ وہ اپنے رب سے نئے عہد والے ہیں۔ اور ان کی صحبت میں ان کی نوخیزی (حدثهم) کو یاد کیا جاتا ہے تاکہ اس کے ذریعے اللہ تعالیٰ کی قدامت (قدمه) کو ممتاز کیا جائے۔ پس یہ ایک صحیح اعتبار اور منزل تک پہنچانے والا راستہ ہے۔ اور اگر یہ تسنین (سنت سازی) کی نوخیزی (أحداث) میں سے ہو، تو اس کی تائید اللہ تعالیٰ کے اس فرمان سے ہوتی ہے: \"ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ\" (ان کے پاس ان کے رب کی طرف سے کوئی نئی نصیحت نہیں آتی) \"وما يَأْتِيهِمْ من ذِكْرٍ من الرَّحْمنِ مُحْدَثٍ\" (اور ان کے پاس رحمن کی طرف سے کوئی نئی نصیحت نہیں آتی)۔ پس اس نے اس شخص کی مذمت کی جس نے اسے قبولیت کے ساتھ نہیں لیا۔ عارفین کا نظریہ اس میں ایسا ہی ہے۔ لیکن مریدوں اور صوفیاء پر نوعمر لڑکوں (الأحداث) کی صحبت حرام ہے، کیونکہ ان پر حیوانی شہوت (الشهوة الحيوانية) کا غلبہ ہوتا ہے، اس عقل کی وجہ سے جسے اللہ نے اس کے مقابلے میں بنایا ہے۔ اگر عقل نہ ہوتی تو طبعی شہوت (الشهوة الطبيعية) محمود ہوتی۔\n\n### [عارفین کا عورتوں کی طرف میلان اور ان سے مالی امداد (الإرفاق) لینا]\n\nاور جہاں تک عورتوں (النسوان) کا تعلق ہے، تو عارفین کا ان کے بارے میں اور ان سے مالی امداد (الإرفاق) لینے کے بارے میں نظریہ یہ ہے کہ عارفین کا ان کی طرف میلان (حنين) کل کا اپنے جزو کی طرف میلان ہے، جیسے گھروں کا اپنے مکینوں کی طرف وحشت محسوس کرنا جن سے ان کی زندگی ہے۔ اور اس لیے کہ وہ جگہ جو مرد میں تھی جہاں سے عورت کو نکالا گیا، اللہ نے اسے اس کی طرف میلان سے آباد کر دیا۔ پس اس کا عورت کی طرف میلان (حنين) بڑے کا میلان ہے اور چھوٹے پر اس کی شفقت ہے۔ اور جہاں تک ان سے مالی امداد (الإرفاق) لینے کا تعلق ہے، تو وہ ان کے لیے ان سے لیتا ہے، جیسا کہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے لیا جب انہیں صدقہ کرنے کا حکم دیا، کیونکہ وہ ان کی نجات کے لیے کوشش کر رہے تھے جب انہوں نے دیکھا کہ وہ جہنم کے زیادہ تر باسی ہیں۔ پس انہوں نے ان پر شفقت کی کیونکہ وہ ان سے تھیں، پس یہ انسان کی اپنے نفس پر شفقت ہے۔ اور اس لیے کہ وہ کمال کی صورت (صورة الكمال) کی تکوین (التكوين) کا محل ہیں، پس ان سے محبت فرض ہے اور آپ صَلَّى اللهُ عَليهِ وسَلَّم کی اقتداء ہے۔\n\nرسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: \"مجھے تمہاری دنیا میں سے تین چیزیں محبوب بنائی گئیں: عورتیں، خوشبو، اور میری آنکھوں کی ٹھنڈک نماز میں رکھی گئی۔\"\n\nپس آپ نے عورتوں کا ذکر کیا۔ کیا تم سمجھتے ہو کہ آپ کو وہ چیز محبوب بنائی گئی جو آپ کو آپ کے رب سے دور کرے؟ نہیں، اللہ کی قسم! بلکہ آپ کو وہ چیز محبوب بنائی گئی جو آپ کو آپ کے رب کے قریب کرے۔ اور ام المؤمنین عائشہ رضی اللہ عنہا نے سمجھ لیا تھا کہ عورتوں نے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے دل میں کیا جگہ بنائی تھی، جب آپ نے انہیں اختیار دیا تو انہوں نے آپ کو اختیار کیا۔ پس اللہ تعالیٰ نے چاہا کہ اس وقت ان کی دلجوئی کرے، انہیں ترجیح دے اور ان کا خیال رکھے، اگرچہ یہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کی مراد کے خلاف تھا۔ پس اللہ نے فرمایا: \"لا يَحِلُّ لَكَ النِّساءُ من بَعْدُ ولا أَنْ تَبَدَّلَ بِهِنَّ من أَزْواجٍ ولَوْ أَعْجَبَكَ حُسْنُهُنَّ إِلَّا ما مَلَكَتْ يَمِينُكَ\" (اس کے بعد آپ کے لیے عورتیں حلال نہیں ہیں، اور نہ ہی یہ کہ آپ ان کے بدلے دوسری بیویاں لائیں، اگرچہ ان کا حسن آپ کو کتنا ہی بھلا لگے، سوائے ان کے جو آپ کی ملکیت میں ہوں)۔ پس اللہ نے آپ پر رحمت کرتے ہوئے ملک یمین کو باقی رکھا، اس محبت کی وجہ سے جو اس نے آپ کے دل میں عورتوں کے لیے رکھی تھی۔ اور یہ ان سخت ترین آیات میں سے تھی جو رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم پر نازل ہوئیں۔ پس عائشہ رضی اللہ عنہا نے فرمایا: \"اللہ اپنے نبی صَلَّى اللهُ عَليهِ وسَلَّم کے دل کو عذاب نہیں دے گا۔\" اللہ کی قسم! رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کی وفات نہیں ہوئی یہاں تک کہ اللہ نے آپ کے لیے عورتوں کو حلال کر دیا۔ پس جس نے عورتوں کی قدر اور ان کے راز کو پہچان لیا، وہ ان کی محبت سے بے رغبت نہیں ہو گا، بلکہ ان سے محبت عارف کے کمال میں سے ہے، کیونکہ یہ نبوی وراثت اور الٰہی محبت ہے۔\n\nکیونکہ آپ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: \"مجھے محبوب بنائی گئیں۔\"\n\nپس آپ نے ان میں اپنی محبت کو اللہ تعالیٰ کے سوا کسی اور کی طرف منسوب نہیں کیا۔ پس اس فصل پر غور کرو، تم ایک عجوبہ دیکھو گے۔\n\n### [شریعت کا ترازو بندوں کے افعال کو تولنے کے لیے رکھا گیا ہے]\n\nاور جہاں تک مریدوں کا تعلق ہے جو شیوخ کے حکم کے تحت ہیں، تو وہ ان کے بارے میں اپنے شیوخ کے حکم کے مطابق ہیں۔ اگر وہ حقیقت میں شیوخ ہیں اور اللہ کی طرف سے مقدم کیے گئے ہیں، تو وہ اللہ کے بندوں کے لیے سب سے زیادہ خیر خواہ ہیں۔ اور اگر وہ ایسے نہیں ہیں، تو ان پر اور ان کے پیروکاروں پر اللہ کی طرف سے حرج ہے۔ کیونکہ اللہ نے دنیا میں شریعت کا ترازو (الميزان المشروع) رکھا ہے تاکہ اس سے بندوں کے افعال کو تولا جائے۔ اور شیوخ سے سوال کیا جاتا ہے، اور ان کے افعال کی پیروی نہیں کی جاتی، مگر جب وہ مخصوص افعال میں اس کا حکم دیں۔ اللہ تعالیٰ فرماتا ہے: \"فَسْئَلُوا أَهْلَ الذِّكْرِ\" (پس اہل ذکر سے پوچھو) اور وہ اہل قرآن، اہل اللہ اور اس کے خاص بندے ہیں۔ اور اہل قرآن وہ ہیں جو اس پر عمل کرتے ہیں، اور یہی وہ ترازو ہے جو ہم نے کہا۔ اور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے سوا کسی کے فعل کی اقتداء نہیں کرنی چاہیے، کیونکہ لوگوں کے احوال مختلف ہوتے ہیں۔ پس عین ممکن ہے کہ جو چیز ایک کے لیے درست ہو، وہی دوسرے کے لیے فساد کا سبب بن جائے اگر وہ اس پر عمل کرے۔ اور وہ علماء جو اللہ سے ڈرتے ہیں، وہ اللہ کے دین کے طبیب ہیں، جو اس کی بیماریوں اور امراض کو دور کرتے ہیں، اور دواؤں کو جانتے ہیں۔ پس جب رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے افعال کے بارے میں لوگوں میں اختلاف ہے کہ آیا وہ وجوب پر ہیں یا نہیں، تو پھر کسی اور کا کیا حال ہو گا، باوجود اس کے کہ اللہ تعالیٰ کا فرمان ہے: \"لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ\" (بیشک تمہارے لیے رسول اللہ میں بہترین نمونہ ہے) اور اس کا فرمان: \"فَاتَّبِعُونِي يُحْبِبْكُمُ الله\" (پس میری پیروی کرو، اللہ تم سے محبت کرے گا)۔ اور یہ سب آپ کے افعال میں اتباع کے وجوب کی نص نہیں ہے، کیونکہ آپ صَلَّى اللهُ عَليهِ وسَلَّم کو ایسی چیزوں کے ساتھ خاص کیا گیا ہے جن میں ہماری لیے آپ کی پیروی کرنا جائز نہیں، اور اگر ہم ان میں آپ کی اقتداء کریں تو ہم نافرمان اور گنہگار ہوں گے۔\n\n### [ہر اس کام سے بچنا واجب ہے جو دل کو غیر اللہ سے مشغول کر دے]\n\nپس ہر مومن کے لیے ضروری ہے، اور اللہ کے راستے کا دعویٰ کرنے والے ہر شخص پر واجب ہے، اگر وہ اہل کشف (أهل الكشف) اور وجود (الوجود) اور خطاب الٰہی (الخطاب الإلهي) میں سے نہیں ہے، اور ان میں سے نہیں ہے جن کے نور معرفت (نور معرفته) کو ان کا نور ورع (نور ورعه) بجھا نہ دے، کہ وہ ہر اس کام سے بچے جو دل کو غیر اللہ سے مشغول کر دے، کیونکہ یہ اس کے حق میں فتنہ (الفتنة) ہے۔ اور اس پر واجب ہے کہ وہ اپنی عقل کو اپنی شہوت (الشهوة) پر غالب کرے، بلکہ وہ مانوس چیزوں کو ترک کرنے اور طبعی مستحسنات کو چھوڑنے کی کوشش کرے، اور ان چیزوں کو بھی جن کی طرف بشری طبیعت مائل ہوتی ہے، اور تہمت کی جگہوں سے بچے، اور دین میں بدعت ایجاد کرنے والوں کی صحبت سے بچے، جب تک کہ اللہ اس کی اجازت نہ دے، اور وہ نوعمر لڑکے (الأحداث) ہیں۔ اسی طرح خوبصورت چہروں والے امردوں (المردان) کی مجلس اور عورتوں کی مجلس، اور ان سے مالی امداد (الإرفاق) لینا۔ کیونکہ دل ہر اس شخص کی طرف مائل ہوتے ہیں جو ان کے ساتھ احسان کرتا ہے، اور طبیعت ان کی طلب کرتی ہے، اور نفسانی شہوات (الشهوات النفسية) کو دفع کرنے کی الٰہی قوت وہاں موجود نہیں ہوتی، اور اس قسم کے لوگوں میں معرفت (المعرفة) مفقود ہوتی ہے۔\n\n### [الٰہی آزمائش (الاختبار الإلهي) کے تحت صرف وہی صبر کرتا ہے جو کمال کے مرتبے کو حاصل کر چکا ہو]\n\nاور الٰہی آزمائش (الاختبار الإلهي) کے تحت صرف وہی خالص معدنی سونا صبر کرتا ہے جس نے کمال (الكمال) کا مرتبہ حاصل کر لیا ہو اور اس میں معدن کی مٹی کا کوئی حصہ باقی نہ رہا ہو۔ اور ہر تکلیف فتنہ (الفتنة) ہے، اور تمام مخلوقات فتنہ (الفتنة) ہیں۔ اور اعمال کے نتائج پر مطلع ہونا فتنہ (الفتنة) ہے، اور یہ ایک مقام کی حالت ہے جو جنت تک ساتھ رہتی ہے۔ اور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم، جو کشف اتم (الکشف الأتم) کے مالک تھے اور جو کچھ وہاں ہے اسے جاننے والے تھے، قبر کے فتنہ (فتنة القبر)، آگ کے عذاب، اور زندگی اور موت کے فتنہ (فتنة المحيا والممات) سے پناہ مانگتے تھے۔\n\n### [شہوت عرضی (الشهوة العرضية) اور شہوت ذاتی (الشهوة الذاتية)]\n\nاور جہاں تک شہوت (الشهوة) کا تعلق ہے، تو یہ لذت بخش چیزوں کا ارادہ ہے، پس یہ مشتہیٰ (خواہش کرنے والے) کے نزدیک لذت اور لذت اندوزی ہے۔ کیونکہ یہ ضروری نہیں کہ وہ کسی اور کے نزدیک بھی لذت بخش ہو، اور نہ ہی یہ ضروری ہے کہ وہ اس کے مزاج کے موافق ہو یا اس کی طبیعت کے مطابق ہو۔ اور یہ اس لیے کہ شہوت (الشهوة) دو طرح کی ہے: شہوت عرضی (شهوة عرضية)، اور یہ وہ ہے جس کی پیروی سے روکا جاتا ہے، کیونکہ یہ جھوٹی ہے، اور اگرچہ یہ کسی دن فائدہ دے بھی دے، تو بھی عقل مند کے لیے اس کی پیروی کرنا مناسب نہیں، تاکہ یہ اس کی عادت نہ بن جائے اور عوارض اس پر اثر انداز نہ ہوں۔ اور شہوت ذاتی (شهوة ذاتية)، پس اس کی پیروی کرنا اس پر واجب ہے، کیونکہ اس میں اس کے مزاج کی اصلاح ہے، اس کی طبیعت کے موافق ہونے کی وجہ سے، اور اس کے مزاج کی اصلاح میں اور اس کے دین کی اصلاح میں اس کی سعادت ہے۔ لیکن وہ اس کی پیروی شارع کی طرف سے رکھے گئے الٰہی ترازو (الميزان الإلهي) کے ساتھ کرے، اور وہ مقرر کردہ شرعی حکم ہے، خواہ وہ رخصتوں میں سے ہو یا عزائم میں سے۔ جب وہ شریعت کی پیروی کر رہا ہو تو اسے پرواہ نہیں کرنی چاہیے، کیونکہ یہ اللہ تک پہنچنے کا ایک مشروع راستہ ہے۔ کیونکہ اللہ تعالیٰ نے صرف وہی مشروع کیا ہے جو سعادت کے حکم کے تحت اس تک پہنچاتا ہے۔ اور یہ بھی ضروری نہیں کہ جو چیز وہ اس حال میں چاہتا ہے، وہ ہر حال میں اور ہر وقت چاہے۔ پس اسے چاہیے کہ وہ اس حال کو پہچانے جس نے اس شہوت (الشهوة) کو اس کے اندر پیدا کیا، اور اس وقت کو جس نے اس کا تقاضا کیا۔ اور یہ عرضی شہوات (الشهوات العرضية) طاعات کے اعمال سے بھی متعلق ہو سکتی ہیں، اور دوری کا سبب بن سکتی ہیں، جیسے کوئی شخص کسی جگہ کو دیکھے جو اس کی طبیعت کو اچھی لگے، اور وہ اس میں نماز پڑھنے کی خواہش کرے، یا کسی فضیلت کی وجہ سے جو وہ اس وقت میں دوسروں پر جانتا ہو۔ پس یہ اس کے حال پر اللہ کے ساتھ برا اثر ڈالتا ہے۔ اور اس کا ترازو یہ ہے کہ وہ عمل سے لذت حاصل کرتا ہے نہ کہ الٰہی شہود (شهود إلهي) سے۔ اور یہ خفیہ مکر (المكر الخفي) میں سے ہے۔ اور ابو یزید (بسطامی) کا اس میں راسخ قدم ہے۔ انہوں نے اس پر تنبیہ کی جب ان کی والدہ نے سرد رات میں ان سے پانی پلانے کو کہا، اور وہ ان کے ساتھ نیک تھے، تو ان پر اٹھنا بھاری گزرا، حالانکہ وہ اپنی والدہ کی خدمت میں تمام احوال میں لذت محسوس کرتے تھے۔ پس انہوں نے اس لذت میں اپنے نفس پر تہمت لگائی، کیونکہ وہ یہ خیال کرتے تھے کہ وہ اپنی والدہ کی خدمت سے صرف اللہ کا حق قائم کرنے کے لیے لذت حاصل کرتے ہیں، اور کسی بھی عبادت سے صرف اس میں اللہ کا حق قائم کرنے کے لیے۔ پس انہوں نے ہر اس عبادت کو ترک کر دیا جو انہوں نے پہلے کی تھی اور جس میں انہیں لذت حاصل ہوئی تھی، اور نئی توبہ کی۔\n\n### [نفوس کی گہرائیوں کو صرف اہل اللہ کے فحول ہی سمجھتے ہیں]\n\nپس نفوس کی گہرائیوں (أغوار النفوس) کو صرف اہل اللہ کے فحول (بڑے) ہی سمجھتے ہیں۔ پس طاعات سے لذت حاصل کرنے اور ان میں مشقت کے اٹھ جانے پر خوش نہ ہو، جب تک کہ اس میں قوم کا ترازو نہ ہو۔ پس جب یہ شہوت (الشهوة) اہل بدعت کی صحبت سے مل جائے، اور وہ نوعمر لڑکے (الأحداث) ہیں، اور خوبصورت چہروں والے بچوں اور عورتوں کی صحبت سے، اللہ تعالیٰ کے لیے، جیسا کہ اسے خیال ہوتا ہے کہ یہ اللہ تعالیٰ کے لیے ہے، تو اس تعلق کے اندر ایک خفیہ الٰہی مکر (مكر إلهي خفي) پوشیدہ ہے۔ اور اگر یہ لذت (التذاذ) ان اصناف کے علاوہ کسی اور سے متعلق ہو، تو یہ وہ ترازو نہیں ہے جس سے اللہ کے مکر کو پہچانا جائے، یہاں تک کہ اللہ کے لیے صحبت اور طبعی شہوت (شهوة الطبع) کے لیے صحبت میں فرق کیا جائے۔ مگر یہ کہ وہ اللہ والے، اہل ورع علماء کی صحبت اختیار کرے، یا اپنے شیخ کی، اگر وہ اہل اذواق میں سے ہو۔ تو یہ ایک اور معاملہ ہے۔ اور وہ ترازو جس سے اسے اپنے حال کو تولنا چاہیے، اس کے اس دعوے میں کہ اس نے نوعمر لڑکوں (الأحداث) اور عورتوں کی صحبت صرف اللہ کے لیے اختیار کی، یہ ہے کہ جب وہ ان کے کھو جانے پر درد اور وحشت محسوس کرے، اور ان سے ملاقات کے لیے ہیجان محسوس کرے، اور ان کے آنے پر خوشی محسوس کرے۔ پس اس وقت اسے معلوم ہو جائے گا کہ اس صنف کی صحبت معلوم ہے، اللہ کے لیے نہیں ہے، اگرچہ مصحوب (جس کی صحبت اختیار کی گئی) کو فائدہ پہنچا ہو، پس مصحوب تو سعید ہو جائے گا اور یہ محب دو شقاوتوں (بدبختیوں) کا شکار ہو گا: ایک محبوب کا کھو جانا، اور دوسری جہالت اور علم کی کمی، اس چیز میں جسے وہ علم سمجھتا تھا اور یہ کہ اس نے اللہ کے لیے اور اللہ میں صحبت اختیار کی۔ اور اگر وہ ان لوگوں میں سے ہے جن کی محبت تمام مخلوقات سے متعلق ہوتی ہے، اور ان مخلوقات میں یہ اصناف بھی شامل ہیں، تو یہ ایک نفسانی دھوکہ (خديعة نفسية) ہو سکتا ہے، اور اس کا ترازو یہ ہے کہ وہ ایک ایک کی جدائی پر وحشت محسوس نہ کرے، کیونکہ وہ کسی مخلوق کے مشاہدہ (مشاهدة) سے خالی نہیں ہوتا، پس اس کا محبوب اس کے ساتھ ہے، اس سے جدا نہیں ہوا۔ کیونکہ آنکھ ایک ہے، اگر تمہارے محبوب کا کوئی عضو غائب ہو جائے اور اس کی آنکھ تمہارے ساتھ باقی رہے تو تمہیں درد محسوس نہیں ہو گا۔ اور تمام مخلوق ایک دوسرے کے اعضاء ہیں۔ اور یہ بھی کہ اگر وہ تمام مخلوقات سے متعلق ہو، اس علم کے ساتھ کہ اس کا ساتھی ان اصناف کے علاوہ میں ابتداءً عموم تعلق رکھتا ہے، پھر یہ اصناف ظاہر ہوں اور وہ اپنے ترازو میں کوئی اضافہ نہ پائے، اور انہیں اس عمومی تعلق میں شامل کر لے، تو اس کی بنیاد ایک صحیح اصل پر ہے۔ اور اگر اس کے ساتھ طبیعت اس صنف میں کھنچ جائے اور ان کے کھو جانے پر خاص طور پر درد محسوس کرے، تو یہ اس کے الٰہی تعلق کے خلوص پر اس کے دعوے اور نصیحت میں اثر انداز نہیں ہوتا، کیونکہ اصل صحیح ہے۔ لیکن اگر اس کے اندر اس صنف کی صحبت سے ثانی حال میں عموم تعلق پیدا ہو جائے، تو اس پر بھروسہ نہ کرے، کیونکہ یہ نفس کی طرف سے ایک فریب (تلبيس) ہے۔ پس اسے اس سے بچنا چاہیے اور ان کی صحبت کو یکسر ترک کر دینا چاہیے۔ اور ہماری بات اہل طریق کے ساتھ ہے، اور اس تعمیم کی جانچ ضروری ہے جو اسے ان کی صحبت کے ثانی حال میں ملی، جیسا کہ سماع (السماع) کا مالک جو نغمات سے مقید ہے، اپنے نفس کو جانچتا ہے جب وہ اسے نغمات سے مقید ہونے کے بعد مطلقاً چھوڑ دیتا ہے، جبکہ اس نے ابتداءً نغمات سے مقید ہو کر حاصل کیا تھا۔ پس یہ ایک معلول (بیمار) اصل ہے، پس جس کا یہ حال ہو وہ اپنے مطلق سماع پر بھروسہ نہ کرے جو اسے ثانی حال میں حاصل ہوا، کیونکہ یہ نفس کا فریب ہے تاکہ وہ مقید سماع کو ترک نہ کرے۔\n\n### [عارفین کی آنکھیں ان کے دلوں میں ہوتی ہیں، وہ دیکھتے ہیں جسے تم اپنے نفس سے نہیں جانتے]\n\nاور انسان جب اپنے رب کے لیے اپنے نفس سے اور اپنے نفس کے لیے اپنے نفس سے انصاف کرتا ہے، تو وہ اپنے حال کو جان لیتا ہے، بلکہ وہ دوسروں سے زیادہ اپنے حال کو جاننے والا ہوتا ہے، سوائے عارفین باللہ کے، کیونکہ وہ اس سے زیادہ اس کے حال کو جانتے ہیں۔\n\nکیونکہ عارفین کے دلوں میں آنکھیں ہوتی ہیں جنہیں معرفت (المعرفة) نے ان کے لیے کھول دیا ہے، وہ ان سے تمہارے اندر وہ چیزیں دیکھتے ہیں جنہیں تم اپنے نفس سے نہیں جانتے، کیونکہ تمہارے پاس وہ آنکھ نہیں ہے۔ اور اسی لیے جنید (بغدادی) نے فرمایا: \"عارف وہ ہے جو تمہارے راز کے بارے میں بولے جبکہ تم خاموش ہو۔\" اور خاموشی کلام کا نہ ہونا ہے۔ پس اس کا مطلب یہ ہے کہ وہ تمہارے بارے میں وہ جانتا ہے جو تم اپنے نفس سے نہیں جانتے، جیسے مزاج کی خفیہ خرابی کو طبیب تمہاری طرف دیکھ کر جان لیتا ہے اور تم اسے نہیں جانتے، اور یہ لوگ نفوس کے طبیب ہیں۔\n\n### [عورتوں سے مالی امداد (الإرفاق) لینے اور نوعمر لڑکوں (الأحداث) کی صحبت سے بچنا]\n\nاور جان لو کہ شیوخ نے عورتوں سے مالی امداد (الإرفاق) لینے اور نوعمر لڑکوں (الأحداث) کی صحبت سے صرف اس طبعی میلان کی وجہ سے خبردار کیا ہے جس کا ہم نے ذکر کیا۔ پس مرید کے لیے مناسب نہیں کہ وہ عورتوں سے کوئی مالی امداد (رفق) لے، یہاں تک کہ وہ خود اپنے نفس میں عورت بن جائے۔ پس جب وہ مؤنث ہو جائے اور عالم اسفل (العالم الأسفل) سے ملحق ہو جائے، اور عالم اعلیٰ (العالم الأعلى) کے اپنے ساتھ عشق کا مشاہدہ کرے، اور اپنے نفس کو ہر حال، وقت اور وارد میں ہمیشہ منکوح (جس سے نکاح کیا گیا ہو) دیکھے، اور اپنے صوری کشف (كشف) اور حال میں اپنے لیے کوئی مذکر یا مرد ہونا بالکل نہ دیکھے، بلکہ محض انوثت (مؤنث ہونا) دیکھے، اور اس نکاح سے حاملہ ہو اور بچے پیدا کرے، تب اسے عورتوں سے مالی امداد (الرفق) لینا جائز ہے، اور ان کی طرف میلان اور ان کی محبت اسے نقصان نہیں دے گی۔ اور جہاں تک عارفین کے لینے کا تعلق ہے، تو وہ مطلق ہے، کیونکہ ان کا مشہود (مشهود) لینے اور دینے میں مطلق، مقدس الٰہی ہاتھ (الید الإلهية) ہے۔ اور ہر شخص اپنے حال کو جانتا ہے، اور یہ راستہ مکمل سچائی اور جدوجہد کا ہے، جو ہنسی مذاق کو قبول نہیں کرتا، اور نہ ہی اس کے پاس طفیلی (مفت خور) کو جگہ ملتی ہے، اگرچہ ذات حق (الحق) معاف کر دے۔",
    "fa": "باب صد و هشتم: در معرفت فتنه، شهوت، مصاحبت با نوجوانان (الأحداث) و زنان، گرفتن کمک (الإرفاق) از آنان، و زمان مجاز بودن مريد برای گرفتن کمک.\n\nبا نوجوانان (حدث) مصاحبت مکن اگر خودت اهل حادثه‌ای،\nو نه با زنان، و به خداوند مشغول باش.\nاز فتنه کور برحذر باش، زیرا بر قلبی که غافل شده است،\nحکمی قوی دارد.\nو از شهوت نفس بپرهیز، که چه بسیار بزرگی را هلاک کرده است\nکه قلبش از پروردگارش غافل مانده است.\nو کسی گرفتن کمکی (رفق) از زن را روا نمی‌داند،\nمگر آنکه از مردان خدا به کمال (کمل) رسیده باشد.\n\n### [فتنه آزمایش و حیرت و هدایت است]\n\nبدان، خداوند تو را تأیید کند، که فتنه (الفتنة) همان آزمایش (الاختبار) است. گفته می‌شود: «نقره را با آتش فتنه کردم» یعنی آن را آزمودم. خداوند متعال می‌فرماید:\n**أَنَّما أَمْوالُكُمْ وأَوْلادُكُمْ فِتْنَةٌ** (همانا اموال و فرزندان شما فتنه‌اند)\nیعنی شما را به وسیله آن‌ها آزمودیم که آیا شما را از ما و از آنچه برایتان تعیین کرده‌ایم که در آنجا توقف کنید، باز می‌دارند یا خیر. و موسی (علیه السلام) گفت:\n**إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِها من تَشاءُ** (این جز آزمایش تو نیست، هر که را بخواهی با آن گمراه می‌کنی)\nیعنی متحیر می‌سازی و هر که را بخواهی هدایت می‌کنی.\n\n### [از بزرگترین فتنه‌های انسان، آفرینش او بر صورت الهی است]\n\nو از بزرگترین فتنه‌هایی که خداوند انسان را با آن آزمود، آگاه ساختن او به این است که او را بر صورت (الصورة) خود آفریده است؛ تا ببیند آیا بر بندگی (عبودیت) و امکان (إمکان) خود می‌ایستد یا به خاطر جایگاه صورتش تکبر می‌ورزد. زیرا او از این صورت جز حکم اسماء (الأسماء) را ندارد، پس در جهان مانند جانشینی که به کمال (الکمال) بر صورت حق (الحق) قیام کرده است، حکم می‌راند. و همچنین از تأیید این فتنه است:\n\nسخن پیامبر (صلی الله علیه و سلم) که از پروردگارش حکایت می‌کند:\n«همانا بنده چون با نوافل به خدا تقرب جوید، خداوند او را دوست می‌دارد. پس چون او را دوست بدارد، گوش او می‌شود که با آن می‌شنود، و چشم او می‌شود که با آن می‌بیند.»\nو دست و پای او را نیز ذکر کرد.\nو چون بنده بداند که در این مقام است، با حق (الحق) می‌شنود، با حق می‌بیند، با حق می‌گیرد و با حق می‌کوشد، نه با نفس خود؛ و با وجود این وصف الهی، بنده محض و فقیر باقی بماند، و شهود (الشهود) او از حق (الحق) باشد، در حالی که حق در این مقام به سوی بندگانش با شادمانی از توبه آن‌ها، و با خوشرویی برای کسی که به خانه‌اش می‌آید، و با تعجب از جوانی که هوای نفس خود را سرکوب کرده است، فرود می‌آید؛ و حق به جای گرسنگی بنده‌اش به گرسنگی، و به جای تشنگی بنده‌اش به تشنگی، و به جای بیماری بنده‌اش به بیماری متصف می‌شود، با وجود علم به آنچه عزت ربوبیت و کبریایی الوهیتش اقتضا می‌کند. این نزول در جبروت اعظم و کبریای منزه و قدیم او تأثیری نمی‌گذارد. همچنین بنده نیز، هنگامی که حق او را به عنوان نایب در آنچه شایسته پروردگار متعال است، برپا می‌دارد، بنده می‌گوید: از کمال صورتی که فرمود مرا بر آن آفریده است، این است که مقام امکان (إمکان) و منزلت عبودیت و صفت فقر و نیاز من از من غایب نشود، همان‌گونه که حق در حال نزول به سوی صفت ما، در کبریایی و عظمت خود حاضر بود. پس حق با بنده است اگر به این صفت وفا کند، و او را می‌ستاید که:\n**نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ** (چه بنده خوبی، همانا او بسیار بازگشت‌کننده است)\nزیرا این ولایت الهی در او تأثیر نگذاشته و او را از فقر و اضطرار خود خارج نکرده است. و هر کس در تقرب از حد خود تجاوز کند، به ضد آن یعنی دوری از خدا و خشم (المقت) برمی‌گردد. پس از نفس خود برحذر باش، زیرا فتنه در گشایش (الاتساع) بزرگتر از فتنه در تنگی و سختی (الحرج والضیق) است.\n\n### [شهوت ابزاری برای نفس است که بسته به موضوعش بالا یا پایین می‌رود]\n\nاما شهوت (الشهوة)، ابزاری برای نفس (النفس) است که با والایی مشتهی (آنچه مورد شهوت است) بالا می‌رود و با پستی مشتهی پایین می‌آید. شهوت، اراده لذت بردن از چیزی است که شایسته لذت بردن است. لذت دو نوع است: روحانی و طبیعی. نفس جزئی (النفس الجزئية) از طبیعت (الطبيعة) متولد شده و طبیعت مادر آن است، و روح الهی (الروح الإلهي) پدر آن. پس شهوت روحانی (الشهوة الروحانية) هرگز از طبیعت رها نمی‌شود. و اما کسی که لذت می‌برد، جز از آنچه مناسب اوست لذت نمی‌برد، و هیچ مناسبتی میان ما و حق (الحق) نیست مگر به واسطه صورت (الصورة).\n\n### [لذت بردن انسان از کمال خود، شدیدترین لذت است]\n\nلذت بردن انسان از کمال (الکمال) خود، شدیدترین لذت است. پس لذت بردن او از کسی که بر صورت اوست، شدیدترین لذت است. دلیل آن این است که لذت در تمام وجود انسان جریان نمی‌یابد و در مشاهده چیزی به کلیت خود فانی (الفناء) نمی‌شود، و محبت و عشق در طبیعت روحانی او جاری نمی‌گردد، مگر زمانی که عاشق کنیز یا نوجوانی (غلام) شود. و علت آن این است که او با تمامیت خود با آن معشوق مقابله می‌کند، زیرا او بر صورت اوست. و هر چیزی در جهان جزئی از اوست، پس جز با آن جزء مناسب با او مقابله نمی‌کند. به همین دلیل، انسان در چیزی که عاشق آن می‌شود، جز در مثل خود فانی نمی‌شود.\n\n### [شهوتی که مطلوب عارفان وارث است]\n\nپس هنگامی که تجلی الهی (التجلی الإلهی) در عین صورتی که آدم بر آن آفریده شد، واقع شود، معنا با معنا مطابقت می‌یابد و لذت بردن به طور کامل رخ می‌دهد و شهوت در تمام اجزای انسان، ظاهر و باطن، جریان می‌یابد. این همان شهوتی است که مطلوب عارفان (العارفین) وارث است. آیا به قیس مجنون در عشق لیلی نمی‌نگری که چگونه او را به خاطر آنچه ذکر کردیم، از خود فانی ساخت؟ همچنین ما دیده‌ایم که صاحبان شیفتگی و محبان، لذت و محبتی بزرگتر و قوی‌تر در آستان حق (الحق) دارند تا در عشق جنس (مخالف). زیرا صورت الهی در بنده کامل‌تر از مماثلت جنسی است، چرا که جنس نمی‌تواند گوش و چشم تو باشد، بلکه نهایت آن این است که مسموع و مدرَک تو باشد (اسم مفعول). و چون بنده مدرِک به حق باشد، کامل‌تر است، پس لذتش عظیم‌تر و شهوتش قوی‌تر است. شهوت اهل الله باید این‌گونه باشد.\n\n### [مصاحبت با نوجوانان و اهل بدعت]\n\nاما مصاحبت با نوجوانان (الأحداث) که همان امردان (مردان) و اهل بدعت هستند؛ کسانی که در دین از سنت‌های ستوده‌ای که شارع در میان ما تأیید کرده، نوآوری کرده‌اند. عارف به امردان از این جهت می‌نگرد که صورتشان صاف و بدون موی عارض است، مانند صخره صاف. زیرا زمین مرداء (بی‌گیاه) زمینی است که در آن گیاهی نیست. پس این، مقام تجرید (التجرید) را به یاد او می‌آورد و اینکه او نسبت به فرد بزرگسال، عهدش با پروردگارش جدیدتر است. و شریعت این نکته را در مورد فرد نازپرورده رعایت کرده است؛ هرچه به تکوین (التکوین) نزدیک‌تر باشد، دلالتش نزدیک‌تر، حرمتش عظیم‌تر و انگیزه‌های رحمت نسبت به او بیشتر از فرد بزرگسالی است که از این مقام دور است. و اما اینکه آن‌ها به این معنا «احداث» (نوجوانان) هستند، به این دلیل است که عهدشان با پروردگارشان جدید است، و در مصاحبت با آن‌ها، حادث بودن آن‌ها را به یاد می‌آوری تا قدمت (قدیم بودن) خداوند متعال با آن متمایز شود. این یک اعتبار صحیح و راهی رساننده است. و اما اگر از نوآوری‌های سنت‌گذاری باشد، سخن خداوند متعال آن را تأیید می‌کند:\n**ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ** (هیچ یادآوری جدیدی از پروردگارشان برایشان نمی‌آید)\nو\n**وما يَأْتِيهِمْ من ذِكْرٍ من الرَّحْمنِ مُحْدَثٍ** (و هیچ یادآوری جدیدی از رحمان برایشان نمی‌آید)\nپس کسی را که آن را با پذیرش دریافت نکند، مذمت کرده است. نظر عارفان در این باره چنین است. اما بر مریدان (المريدون) و صوفیه، مصاحبت با نوجوانان (الأحداث) حرام است، به دلیل غلبه شهوت حیوانی بر آن‌ها، که خداوند عقل را در مقابل آن قرار داده است. اگر عقل نبود، شهوت طبیعی ستوده می‌بود.\n\n### [اشتیاق عارفان به زنان و در مورد گرفتن کمک از آن‌ها]\n\nاما زنان (النسوان)، نظر عارفان (العارفین) در مورد آن‌ها و گرفتن کمک (الإرفاق) از آن‌ها این است: اشتیاق عارفان به زنان، اشتیاق کل به جزء خود است، مانند دلتنگی خانه‌ها برای ساکنانشان که حیات آن‌ها به واسطه آن‌هاست. و به این دلیل که مکانی در مرد که زن از آن استخراج شده است، خداوند آن را با میل به زن آباد کرده است. پس اشتیاق مرد به زن، اشتیاق بزرگ به کوچک و مهربانی او بر کوچک است. اما گرفتن کمک از آن‌ها، به این صورت است که آن را از آن‌ها برای خودشان می‌گیرد، همان‌گونه که رسول خدا (صلی الله علیه و سلم) آن را گرفت، هنگامی که به آن‌ها دستور داد صدقه دهند، زیرا او در تلاش برای نجات آن‌ها بود، وقتی دید که بیشتر اهل آتش (جهنم) هستند. پس بر آن‌ها شفقت ورزید، زیرا آن‌ها از او بودند. این شفقت انسان بر نفس خود است. و چون زنان محل تکوین (التکوین) صورت کمال (الکمال) هستند، دوست داشتن آن‌ها فریضه و اقتدا به آن حضرت است.\n\nرسول خدا (صلی الله علیه و سلم) فرمود:\n«از دنیای شما سه چیز برای من دوست‌داشتنی شد: زنان، بوی خوش، و نور چشم من در نماز قرار داده شد.»\nپس زنان را ذکر کرد. آیا گمان می‌کنی چیزی برای او دوست‌داشتنی شد که او را از پروردگارش دور کند؟ نه به خدا سوگند، بلکه چیزی برای او دوست‌داشتنی شد که او را به پروردگارش نزدیک کند. و عایشه، ام‌المؤمنین، آنچه را که زنان از قلب رسول خدا (صلی الله علیه و سلم) گرفته بودند، درک کرد، هنگامی که به آن‌ها اختیار داد و آن‌ها او را انتخاب کردند. پس خداوند متعال خواستار جبران و ترجیح دادن آن‌ها در آن زمان و رعایت حالشان بود، هرچند خلاف مراد رسول خدا (صلی الله علیه و سلم) بود، پس فرمود:\n**لا يَحِلُّ لَكَ النِّساءُ من بَعْدُ ولا أَنْ تَبَدَّلَ بِهِنَّ من أَزْواجٍ ولَوْ أَعْجَبَكَ حُسْنُهُنَّ إِلَّا ما مَلَكَتْ يَمِينُكَ** (از این پس، زنان [دیگر] بر تو حلال نیستند و [حتی] جایز نیست که همسران دیگری به جای آن‌ها بگیری، هرچند زیبایی آن‌ها تو را به شگفت آورد، مگر آنچه [کنیزانی] که مالک شده‌ای.)\nپس به دلیل رحمتی که در قلب او نسبت به زنان قرار داده بود، ملک یمین را برای او باقی گذاشت. و این یکی از سخت‌ترین آیاتی بود که بر رسول خدا (صلی الله علیه و سلم) نازل شد. پس عایشه گفت: خداوند قلب پیامبرش (صلی الله علیه و سلم) را عذاب نمی‌دهد. به خدا سوگند، رسول خدا (صلی الله علیه و سلم) نمرد تا اینکه زنان بر او حلال شدند. پس هر کس قدر زنان و سرّ آن‌ها را بشناسد، از دوست داشتن آن‌ها رویگردان نمی‌شود، بلکه دوست داشتن آن‌ها از کمال عارف (العارف) است، زیرا این میراث نبوی و محبتی الهی است. زیرا او (صلی الله علیه و سلم) فرمود:\n«برای من دوست‌داشتنی شد.»\nپس محبت خود را در مورد آن‌ها جز به خداوند متعال نسبت نداد. در این فصل تدبر کن تا شگفتی ببینی.\n\n### [میزان مشروع برای سنجش اعمال بندگان وضع شده است]\n\nاما مریدان (المريدون) که تحت حکم شیوخ هستند، حکمشان تابع شیوخشان است. اگر شیوخ حقیقی باشند و از جانب خداوند مقدم شده باشند، خیرخواه‌ترین مردم برای بندگان خدا هستند. و اگر چنین نباشند، بر خودشان و بر پیروانشان از جانب خداوند حرج (سختی) است. زیرا خداوند میزان مشروع (الميزان المشروع) را در جهان قرار داده است تا اعمال بندگان با آن سنجیده شود. و از شیوخ سؤال می‌شود و به افعال آن‌ها اقتدا نمی‌شود، مگر اینکه در افعال معینی به آن امر کنند. خداوند متعال می‌فرماید:\n**فَسْئَلُوا أَهْلَ الذِّكْرِ** (پس از اهل ذکر بپرسید)\nو اهل ذکر، اهل قرآن، اهل الله و خاصان او هستند. و اهل قرآن کسانی هستند که به آن عمل می‌کنند و آن همان میزانی است که گفتیم. و شایسته نیست که به فعل هیچ کس جز رسول خدا (صلی الله علیه و سلم) اقتدا شود، زیرا احوال مردم متفاوت است. چه بسا همان چیزی که برای یک نفر صلاح است، اگر دیگری آن را انجام دهد، موجب فساد او شود. و علمایی که از خدا می‌ترسند، پزشکان دین خدا هستند که بیماری‌ها و علل آن را برطرف می‌کنند و به داروها آگاهند. اگر در مورد افعال رسول خدا (صلی الله علیه و سلم) اختلاف شده است که آیا بر وجوب است یا خیر، پس در مورد غیر او چگونه خواهد بود؟ با وجود سخن خداوند متعال:\n**لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ** (قطعاً برای شما در [اقتدا به] رسول خدا سرمشقی نیکوست)\nو سخن او:\n**فَاتَّبِعُونِي يُحْبِبْكُمُ الله** (پس از من پیروی کنید تا خدا شما را دوست بدارد)\nو این همه، نص صریحی بر وجوب پیروی در تمام افعال او نیست. زیرا او (صلی الله علیه و سلم) به اموری اختصاص یافته بود که پیروی ما از آن‌ها جایز نیست و اگر به آن‌ها اقتدا می‌کردیم، گناهکار و عاصی می‌شدیم.\n\n### [وجوب اجتناب از هر امری که به مشغول شدن قلب به غیر خدا می‌انجامد]\n\nپس بر هر مؤمنی شایسته است و بر هر مدعی در راه خدا واجب است، اگر از اهل کشف (الکشف) و وجود (الوجود) و خطاب الهی نیست و از کسانی نیست که نور معرفت (المعرفة) او نور ورعش را خاموش نمی‌کند، که از هر امری که منجر به مشغول شدن قلب به غیر خدا می‌شود، دوری کند، زیرا آن در حق او فتنه است. و بر او واجب است که عقل خود را بر شهوتش غالب کند، بلکه باید در قطع مأنوسات و ترک مستحسنات طبیعی و آنچه طبع بشری به آن میل دارد، بکوشد. و از مواضع تهمت و مصاحبت با بدعت‌گذاران در دین که خداوند به آن اذن نداده است (که همان نوجوانان/الأحداث هستند)، و همچنین از همنشینی با امردان خوش‌رو و زنان و گرفتن کمک (الإرفاق) از آن‌ها اجتناب کند. زیرا قلب‌ها به هر کس که به آن‌ها نیکی کند، متمایل می‌شوند و طبع آن‌ها را می‌طلبد، در حالی که نیروی الهی برای دفع شهوات نفسانی در آنجا حضور ندارد و معرفت (المعرفة) در این دسته از مردم معدوم است.\n\n### [زیر آزمایش الهی صبر نمی‌کند مگر کسی که به رتبه کمال رسیده باشد]\n\nو زیر آزمایش الهی (الاختبار الإلهی) صبر نمی‌کند، مگر طلای خالص معدنی که به رتبه کمال (الکمال) رسیده و چیزی از خاک معدن در آن باقی نمانده باشد. و هر تکلیفی فتنه است، و همه مخلوقات فتنه هستند، و آگاهی بر نتایج اعمال نیز فتنه است، و این حالتی از مقام است که تا بهشت همراه می‌شود. و رسول خدا (صلی الله علیه و سلم)، که صاحب کشف (الکشف) اتم و آگاه به آنچه هست، بود، از فتنه قبر، عذاب آتش، و فتنه زندگی و مرگ به خدا پناه می‌برد.\n\n### [شهوت عرضی و شهوت ذاتی]\n\nاما شهوت (الشهوة)، اراده لذت‌هاست. پس آن لذت و التذاذ به ملذوذی است نزد مشتهی (کسی که شهوت دارد). زیرا لازم نیست که آن ملذوذ نزد دیگری نیز لذت‌بخش باشد یا موافق مزاج و سازگار با طبع او باشد. و آن بدین دلیل است که شهوت دو نوع است: شهوت عرضی (الشهوة العرضية) که از پیروی آن منع می‌شود، زیرا کاذب است و اگرچه روزی سودی داشته باشد، شایسته نیست که عاقل از آن پیروی کند تا مبادا برای او عادت شود و عوارض در او تأثیر بگذارد. و شهوت ذاتی (الشهوة الذاتية) که پیروی از آن بر او واجب است، زیرا در آن صلاح مزاج او به دلیل سازگاری با طبعش وجود دارد، و در صلاح مزاج و صلاح دین او سعادت اوست. اما باید از آن با میزان الهی که شارع قرار داده است، یعنی حکم شرع مقرر، پیروی کند. و در آن، چه از رخصت‌ها باشد و چه از عزائم (احکام سخت)، اگر پیرو شرع باشد، باکی ندارد، زیرا آن راهی مشروع به سوی خداست. خداوند متعال جز آنچه که به حکم سعادت به سوی او می‌رساند، تشریع نکرده است. و همچنین لازم نیست آنچه در این حال می‌خواهد، در هر حال و هر وقت بخواهد. پس شایسته است که حالی را که آن شهوت را در او ایجاد کرده و زمانی را که آن را اقتضا کرده است، بشناسد. گاهی این شهوات عرضی به اعمال طاعات تعلق می‌گیرند و موجب دوری می‌شوند، مانند کسی که مکانی را می‌بیند که طبعش آن را نیکو می‌شمارد و می‌خواهد در آن نماز بخواند، یا به دلیل فضیلتی که برای آن زمان نسبت به زمان‌های دیگر می‌داند. این امر در حال او با خدا تأثیر بدی می‌گذارد. و میزان آن، لذت بردن از عمل است نه برای شهود (الشهود) الهی، و این از مکر خفی (پنهان) است. ابویزید (بسطامی) در این زمینه قدمی راسخ داشت و به این نکته توجه داد، هنگامی که مادرش در شبی سرد از او خواست که به او آب دهد و او نسبت به مادرش نیکوکار بود، اما برخاستن بر او سنگین آمد. او در تمام احوالش در خدمت مادرش لذت می‌برد، پس نفس خود را در آن لذت متهم کرد، زیرا گمان می‌کرد که جز برای اقامه حق خدا از خدمت مادرش لذت نمی‌برد و جز برای اقامه حق خدا در عبادتی لذت نمی‌برد. پس هر عبادتی را که پیش از آن انجام داده بود و در آن لذتی برده بود، کنار گذاشت و توبه جدیدی کرد.\n\n### [ژرفای نفوس را جز مردان بزرگ اهل الله درک نمی‌کنند]\n\nپس ژرفای نفوس (أغوار النفوس) را جز مردان بزرگ (فحول) اهل الله درک نمی‌کنند. پس به لذت بردن از طاعات و برداشته شدن سختی آن از خود، بدون میزان (الميزان) اهل این راه، شاد مباش. اگر این شهوت با مصاحبت اهل بدعت (که همان نوجوانان/الأحداث هستند) و با مصاحبت پسران خوش‌رو و زنان، به خیال او «فی الله» (در راه خدا) همراه شود، در لابلای این تعلق، مکر الهی (مکر إلهی) پنهانی وجود دارد. و اگر آن التذاذ او به غیر این اصناف تعلق گیرد، آن میزان و معیاری نیست که مکر خدا با آن شناخته شود تا بتوان میان مصاحبت برای خدا و مصاحبت برای شهوت طبع تفاوت گذاشت، مگر اینکه با علمای بالله اهل ورع یا با شیخ خود، اگر از اهل اذواق (تجربه‌های عرفانی) باشد، مصاحبت کند، که آن امری دیگر است. و آنچه شایسته است که حال خود را در ادعای اینکه نوجوانان و زنان را جز برای خدا مصاحبت نکرده است، با آن بسنجد، این است که اگر هنگام فقدان آن‌ها، درد و وحشتی بیابد و برای دیدارشان هیجان و هنگام روی آوردنشان شادی احساس کند، در آن هنگام می‌داند که مصاحبت با این صنف معلوم است و برای خدا نیست. و اگرچه منفعتی برای مصاحبت‌شونده حاصل شود، مصاحبت‌شونده سعادتمند می‌شود و این محب دو شقاوت می‌کشد: یکی فقدان محبوب و دیگری جهل و بی‌علمی در آنچه گمان می‌کرد علم است و اینکه برای خدا و در راه خدا مصاحبت کرده است. و اما اگر از کسانی باشد که آن محبت او به همه مخلوقات تعلق می‌گیرد و این اصناف نیز جزو مخلوقات هستند، ممکن است آن یک فریب نفسانی باشد. و میزان آن این است که هنگام جدایی از تک‌تک آن‌ها، احساس وحشت نکند، زیرا او از مشاهده مخلوقی خالی نیست، پس محبوبش با اوست و از او جدا نشده است. زیرا چشم یکی است؛ اگر عضوی از اعضای محبوبت غایب شود، در حالی که عین او با تو باقی است، دردی نمی‌یابی، و خلق همه اعضای یکدیگرند. و همچنین، اگر تعلق او به همه مخلوقات، با آگاهی صاحبش از عمومیت تعلق در ابتدا و در غیر این اصناف باشد، سپس این اصناف ظاهر شوند و او در میزان خود افزایشی نیابد و آن‌ها را در عموم آن تعلق وارد کند، این بر مبنای یک اصل صحیح است. و اگر طبع او در این صنف کشیده شود و هنگام فقدان آن‌ها به طور خاص درد بیابد، این در خلوص تعلق الهی او در دعوت و نصیحتش تأثیری نمی‌گذارد، به دلیل صحت اصل. اما اگر عمومیت تعلق در حال دوم، پس از تعلق او به مصاحبت این صنف، در او حادث شود، نباید بر آن تکیه کند، زیرا آن تلبیس (فریب) از جانب نفس است. پس باید از آن برحذر باشد و مصاحبت آن‌ها را به کلی ترک کند. سخن ما تنها با اهل طریق (سالکان) است و این تعمیمی که در حال دوم از مصاحبت آن‌ها یافته است، باید تمحیص (خالص‌سازی) شود، همان‌گونه که صاحب سماع (آواز عرفانی) مقید به نغمات، نفس خود را تمحیص می‌کند، هنگامی که پس از تحصیل ابتدایی از مقید به نغمات، آن را به صورت مطلق رها می‌کند. پس آن اصلی معلول است و کسی که حالش چنین است، نباید بر سماع مطلق خود که در حال دوم کسب کرده است، اعتماد کند، زیرا آن فریب نفس است تا سماع مقید را ترک نکند.\n\n### [چشمان عارفان در قلب‌هایشان است و آنچه را که تو از خودت نادانی می‌بینند]\n\nو انسان اگر در مورد پروردگارش از جانب نفس خود و در مورد نفس خود از جانب نفس خود انصاف ورزد، حال خود را می‌شناسد، بلکه حال خود را بهتر از دیگران می‌داند، مگر عارفان بالله (العارفین بالله)، زیرا آن‌ها حال او را بهتر از خودش می‌دانند. چون عارفان (العارفین) در قلب‌هایشان چشم‌هایی دارند که معرفت (المعرفة) آن‌ها را برایشان گشوده است و با آن از تو چیزی را می‌بینند که تو از خودت نادانی، زیرا تو آن چشم را نداری. به همین دلیل جنید گفت: «عارف کسی است که از سرّ تو سخن می‌گوید در حالی که تو ساکتی.» و سکوت، عدم کلام است. پس معنای آن این است که او از تو چیزی را می‌داند که تو از خودت نمی‌دانی، مانند عیب پنهان مزاج که پزشک با نگاه کردن به تو آن را می‌شناسد و تو نمی‌شناسی. و اینان پزشکان نفوس هستند.\n\n### [حذر از گرفتن کمک از زنان و مصاحبت با نوجوانان]\n\nو بدانید که شیوخ از گرفتن کمک (الإرفاق) از زنان و مصاحبت با نوجوانان (الأحداث) برحذر داشتند، به دلیل میل طبیعی که ذکر کردیم. پس شایسته نیست که مرید (المريد) از زنان کمکی بگیرد، مگر اینکه خودش در نفس خود به زن تبدیل شود. پس هنگامی که مؤنث شد و به عالم اسفل ملحق گشت و عشق عالم اعلی به خود را دید و در هر حال و وقت و واردی، خود را دائماً مورد نکاح (منکوح) مشاهده کرد و در کشف (الکشف) صوری و حال خود، خود را مذکر و اصلاً مرد نبیند، بلکه انوثت محض باشد و از آن نکاح باردار شود و بزاید، در آن هنگام گرفتن کمک از زنان برای او جایز است و میل و محبت به آن‌ها به او ضرری نمی‌رساند. اما گرفتن عارفان (العارفین) مطلق است، زیرا مشهود (الشهود) آن‌ها دست الهی مقدس مطلق در گرفتن و دادن است. و هر شخصی حال خود را می‌شناسد. و این راه، تماماً صدق و جدّ است و شوخی و طفیلی را نمی‌پذیرد، حتی اگر حق (الحق) مسامحه کند."
  },
  "page_count": 4
}