{
  "id": 125,
  "title": {
    "ar": "الباب الخامس والعشرون ومائة في معرفة مقام ترك الصبر وأسراره",
    "en": "Chapter One Hundred and Twenty-Five: Concerning the Gnosis (معرفة) of the Station (مقام) of Abandoning Patience and its Secrets.",
    "ur": "باب ایک سو پچیس: صبر کو ترک کرنے کے مقام اور اس کے اسرار کی معرفت میں",
    "fa": "باب صد و بیست و پنجم در معرفت مقام ترک صبر و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الخامس والعشرون ومائة في معرفة مقام ترك الصبر وأسراره)\n> وفي الصبر من سوء الصنيعة أنه *** يقاوم قهر الحق في كل إقدام‏\n\n\n> فلا صبر عند العارفين فإنهم *** من الضعف في بحر على سيفه طام‏\n\n\n### [في الصبر المعروف عند العامة مقاومة القهر الإلهي‏]\n\n\nاعلم علمك الله أن في الصبر المعروف عند العامة مقاومة القهر الإلهي وسوء أدب مع الله وما ابتلى الله عباده إلا ليتضرعوا إليه ويسألوه في رفع ما ابتلاهم به من البلاء عنهم لأنه دواء لما تعطيهم في نفوسهم من المرض الصورة التي خلقوا عليها فيدعيها من لم تكمل فيه الصورة فإنه من كمالها الخلافة وهم المكملون من الرجال ومن لم تحصل له درجة الخلافة فما هو على الصورة فإنه بالمجموع يكون بالصورة\n\n\n### [أكابر الرجال لا يحسبون نفوسهم عن الشكوى إلى الله‏]\n\n\nقال بعضهم وقد بكى حين أخذه الجوع إنما جوعني لأبكي فهو يبكي له وعليه فإن أكابر الرجال لا يحبسون نفوسهم عن الشكوى إلى الله فإذا مدح الله الصابرين فهم الذين حبسوا نفوسهم عن الشكوى لغير الله وهذا مذهب الأكابر أ لا ترى سمنون لما أساء الأدب مع الله وأراد أن يقاوم القدرة الإلهية لما وجد في نفسه من حكم الرضي والصبر قال‏\n\n\n> وليس لي في سواك حظ *** فكيف ما شئت فاختبرني‏\n\n\nفابتلاه الله بعسر البول والنفس مجبولة على طلب حظها من العافية ولما سأل هذا كان في حكم حال العافية فلما سلبها بهذا البلاء طلبتها النفس بما جبلت عليه‏\n\n\n### [النفس مجبولة على طلب حظها من العافية]\n\n\nوقد ذكرنا ذلك في صفات النفس وأن الله عين لها مصارف لما علمه من أنها لا تنعدم إذ لو انعدمت لانعدمت النفس فهو وصف ذاتي لها أ لا ترى إلى عالم العلماء وحاكم الحكماء كيف كان سؤاله العافية وأمر بها\n\n\nفقال إذا سألتم الله فاسألوه العافية فإن كنتم أهل بلاء فقد سألتم العافية وإن كنتم أهل عافية فقد سألتم دوامها\n\n\nوهي مشتقة من عفي الأثر إذا ذهب فالعافية ذهاب أثر البلاء ممن قام به‏\n\n\n### [من الأدب مع الله وقوف العبد مع عجزه وفقره‏]\n\n\nفمن الأدب مع الله وقوف العبد مع عجزه وفقره وفاقته فإن الغناء بالله لا يصح عن الله ولا عن المخلوقين من حيث العموم لكنه يصح من حيث تعيين مخلوق ما يمكن أن يستغني عنه بغيره‏\n\n\n### [الأسباب الذاتية لا يمكن رفعها]\n\n\nفإن الله ما وضع الأسباب سدى فمنها أسباب ذاتية لا يمكن رفعها هنا ومنها أسباب عرضية يمكن رفعها فمن المحال رفع التأليف والتركيب عن الجسم مع بقاء حكم الجسمية فيه فهذا سبب لا يمكن زواله إلا بعدم عين الجسم من الوجود وإذا كانت الأسباب الأصلية لا ترتفع فلنقر الأسباب العرضية أدبا مع الله ولا نركن إليها ونبقي الخاطر معلقا بالله ولا يصح أن يتعلق بالله لله فإنه محال وإنما يتعلق بالله للأسباب فهذا حد المعرفة بها فقد بان لك معنى ترك الصبر\n\n",
    "en": "## Chapter One Hundred and Twenty-Five: On the Gnosis of the Station of Abandoning Patience (مقام ترك الصبر) and its Secrets\n\n> And in patience (الصبر) there is ill-manners (سوء الصنيعة) because it\n> Resists the overwhelming power (قهر) of The Real (الحق) in every undertaking.\n\n### [On the Patience Known to the Common People as Resistance to the Divine Overwhelming Power]\n\nKnow—may Allah grant you knowledge—that the patience known among the common people (العامة) involves resisting the Divine Overwhelming Power (القهر الإلهي) and constitutes ill-manners (سوء أدب) toward Allah. Allah only tests His servants so that they may supplicate Him and ask Him to remove the affliction (البلاء) with which He has tested them. This is because the affliction is a remedy for the sickness that the form (الصورة) upon which they were created gives them in their souls (نفوسهم).\n\nThis form is claimed by those in whom the form is not perfected, for the Vicegerency (الخلافة) is part of its perfection, and these are the perfected men (المكملون من الرجال). Whoever has not attained the degree of Vicegerency is not truly upon the Form, for it is only by the totality (بالمجموع) that one is upon the Form.\n\n### [The Greatest Men Do Not Restrain Themselves from Complaining to Allah]\n\nOne of them said, weeping when hunger seized him, \"He only made me hungry so that I might weep.\" Thus, he weeps for Him and upon Him. Indeed, the greatest men (أكابر الرجال) do not restrain their souls from complaining to Allah. Therefore, when Allah praises the patient ones (الصابرين), they are those who restrained their souls from complaining to anyone *other than* Allah. This is the way (مذهب) of the great ones.\n\nDo you not see how Samnun, when he showed ill-manners toward Allah and sought to resist the Divine Power (القدرة الإلهية) due to the state of contentment (الرضي) and patience he found within himself, said:\n\n> I have no portion (حظ) in anyone other than You,\n> So test me however You wish.\n\nSo Allah afflicted him with difficulty in urination. The soul (النفس) is naturally disposed (مجبولة) to seek its portion of well-being (العافية). When he made this request, he was under the ruling of the state of well-being. But when this affliction stripped him of it, the soul sought it [well-being] according to its natural disposition.\n\n### [The Soul is Naturally Disposed to Seek its Portion of Well-being]\n\nWe have mentioned this in the description of the soul's Attributes (صفات النفس), and that Allah designated expenditures (مصارف) for it, knowing that it cannot be annihilated (لا تنعدم), for if it were annihilated, the soul itself would cease to exist. Thus, it is an essential attribute (وصف ذاتي) for it.\n\nDo you not look at the most knowledgeable of scholars and the wisest of judges [i.e., the Prophet Muhammad], how he requested well-being and commanded it? He said: \"If you ask Allah, ask Him for well-being (العافية). For if you are people of affliction, you have asked for well-being; and if you are people of well-being, you have asked for its permanence.\"\n\n[The word *al-Afiyah*] is derived from *‘afa al-athar* (the trace vanished) when it departed. Thus, well-being (*al-Afiyah*) is the vanishing of the trace of affliction from the one who experienced it.\n\n### [Part of Proper Conduct with Allah is the Servant's Acknowledgment of His Incapacity and Poverty]\n\nPart of proper conduct (الأدب) with Allah is the servant's acknowledgment of his incapacity (عجزه), poverty (فقره), and destitution (فاقته). For sufficiency (الغناء) through Allah is not valid *from* Allah, nor is it valid *from* creatures (المخلوقين) in a general sense. However, it is valid in terms of specifying a particular creature from which one can be made sufficient by another [creature].\n\n### [Essential Causes Cannot Be Removed]\n\nAllah did not establish the causes (الأسباب) in vain. Some of them are essential causes (أسباب ذاتية) that cannot be removed here [in this world], and some are accidental causes (أسباب عرضية) that can be removed. It is impossible, for instance, to remove composition (التأليف) and structure (التركيب) from a body while the ruling of corporeality (حكم الجسمية) remains in it. This is a cause that cannot vanish except by the non-existence of the entity (عين الجسم) of the body itself from Being (الوجود).\n\nSince the original causes (الأسباب الأصلية) cannot be removed, let us acknowledge the accidental causes (الأسباب العرضية) as a matter of proper conduct (أدبا) with Allah, but without relying upon them. We must keep the inner thought (الخاطر) attached to Allah. Yet, it is not valid for the thought to be attached to Allah *for* Allah, for that is impossible. Rather, it is attached to Allah *because* of the causes (للأسباب). This is the limit of gnosis (المعرفة) concerning them. Thus, the meaning of abandoning patience (ترك الصبر) has become clear to you.",
    "ur": "باب ایک سو پچیس: ترک صبر (ترك الصبر) کے مقام اور اس کے اسرار کی معرفت میں۔\n\nاور صبر میں بد عملی یہ ہے کہ یہ ہر اقدام میں ذات حق (الحق) کے قہر کا مقابلہ کرتا ہے۔\n\nپس عارفین (العارفين) کے نزدیک کوئی صبر نہیں، کیونکہ وہ کمزوری کے ایک ایسے سمندر میں ہیں جو اپنی سطح پر موجزن ہے۔\n\n### [عام لوگوں میں معروف صبر، قہر الٰہی کی مزاحمت ہے]\n\nاللہ آپ کو علم عطا فرمائے، جان لیجیے کہ عام لوگوں میں معروف صبر (الصبر) قہر الٰہی (القهر الإلهي) کی مزاحمت اور اللہ کے ساتھ سوء ادب ہے۔ اللہ اپنے بندوں کو آزمائش میں نہیں ڈالتا مگر اس لیے کہ وہ اس کی طرف تضرع کریں اور اس بلا کو دور کرنے کی دعا کریں جس میں انہیں مبتلا کیا گیا ہے۔ کیونکہ یہ اس مرض کا علاج ہے جو ان کی جانوں میں اس صورت (الصورة) کی وجہ سے پیدا ہوتا ہے جس پر وہ خلق کیے گئے ہیں۔ اس صورت کا دعویٰ وہ کرتا ہے جس میں یہ صورت مکمل نہیں ہوئی، کیونکہ اس صورت کے کمال میں خلافت (الخلافة) شامل ہے، اور وہ کامل مردانِ حق ہیں۔ اور جسے خلافت (الخلافة) کا درجہ حاصل نہیں ہوا، وہ اس صورت پر نہیں ہے، بلکہ وہ مجموعی طور پر اس صورت کے ساتھ ہوتا ہے۔\n\n### [اکابر رجال اپنے نفوس کو اللہ سے شکوہ کرنے سے نہیں روکتے]\n\nبعض نے کہا، جب انہیں بھوک لگی اور وہ روئے: \"اس نے مجھے بھوکا کیا تاکہ میں روؤں۔\" پس وہ اس کے لیے اور اس پر روتے ہیں۔ کیونکہ اکابر رجال اپنے نفوس کو اللہ سے شکوہ کرنے سے نہیں روکتے۔ لہٰذا، جب اللہ صبر کرنے والوں کی تعریف کرتا ہے، تو وہ وہ لوگ ہیں جنہوں نے اپنے نفوس کو غیر اللہ سے شکوہ کرنے سے روکا۔ اور یہی اکابر کا مسلک ہے۔ کیا آپ نے سمنون کو نہیں دیکھا، جب انہوں نے اللہ کے ساتھ سوء ادب کیا اور رضامندی اور صبر (الصبر) کے حکم کو اپنے اندر پا کر قدرت الٰہیہ کا مقابلہ کرنا چاہا، تو انہوں نے کہا:\n\nاور تیرے سوا میرا کوئی حصہ نہیں ہے\nپس تو جس طرح چاہے مجھے آزما لے۔\n\nتو اللہ نے انہیں پیشاب کی تنگی کی آزمائش میں مبتلا کر دیا۔ اور نفس عافیت (العافية) میں اپنا حصہ طلب کرنے پر جبلت رکھتا ہے۔ جب انہوں نے یہ سوال کیا تو وہ عافیت کی حالت کے حکم میں تھے، لیکن جب اس بلا کے ذریعے عافیت چھین لی گئی تو نفس نے اس چیز کا مطالبہ کیا جس پر وہ جبلت رکھتا ہے۔\n\n### [نفس عافیت میں اپنا حصہ طلب کرنے پر جبلت رکھتا ہے]\n\nہم نے اس کا ذکر صفاتِ نفس میں کیا ہے، اور یہ کہ اللہ نے اس کے لیے مصارف مقرر کیے ہیں، کیونکہ وہ جانتا ہے کہ نفس فنا نہیں ہوتا، اگر وہ فنا ہو جائے تو نفس ہی فنا ہو جائے گا۔ پس یہ اس کی ذاتی صفت ہے۔ کیا آپ نے علماء کے عالم اور حکماء کے حاکم (یعنی نبی اکرم ﷺ) کو نہیں دیکھا کہ وہ کس طرح عافیت (العافية) کا سوال کرتے تھے اور اس کا حکم دیتے تھے؟\n\nآپ ﷺ نے فرمایا: \"جب تم اللہ سے سوال کرو تو عافیت (العافية) کا سوال کرو۔ اگر تم اہل بلا ہو تو تم نے عافیت کا سوال کیا، اور اگر تم اہل عافیت ہو تو تم نے اس کے دوام کا سوال کیا۔\"\n\nاور یہ لفظ \"عفی الأثر\" سے مشتق ہے، جب اثر زائل ہو جائے۔ پس عافیت (العافية) اس شخص سے بلا کے اثر کا زائل ہو جانا ہے جس پر وہ وارد ہوئی ہو۔\n\n### [اللہ کے ساتھ ادب میں سے یہ ہے کہ بندہ اپنے عجز اور فقر پر قائم رہے]\n\nپس اللہ کے ساتھ ادب میں سے یہ ہے کہ بندہ اپنے عجز، فقر اور احتیاج پر قائم رہے۔ کیونکہ اللہ کے ذریعے غنی ہونا نہ تو اللہ سے عمومی طور پر صحیح ہے اور نہ ہی مخلوق سے، لیکن یہ کسی خاص مخلوق کے تعین کے لحاظ سے صحیح ہے جس سے کسی دوسرے کے ذریعے بے نیاز ہوا جا سکتا ہے۔\n\n### [ذاتی اسباب کو ختم نہیں کیا جا سکتا]\n\nبے شک اللہ نے اسباب کو بے کار نہیں رکھا۔ ان میں سے کچھ ذاتی اسباب (أسباب ذاتية) ہیں جنہیں یہاں ختم نہیں کیا جا سکتا، اور کچھ عرضی اسباب ہیں جنہیں ختم کیا جا سکتا ہے۔ پس جسم سے تالیف اور ترکیب کو ختم کرنا محال ہے جبکہ اس میں جسمیت کا حکم باقی رہے۔ یہ ایسا سبب ہے جو وجود (الوجود) سے جسم کے عین کے معدوم ہونے کے بغیر زائل نہیں ہو سکتا۔ اور جب اصلی اسباب ختم نہیں ہوتے، تو ہمیں چاہیے کہ اللہ کے ساتھ ادب کرتے ہوئے عرضی اسباب کا اقرار کریں، لیکن ان پر بھروسہ نہ کریں، اور اپنے باطن کو اللہ سے معلق رکھیں۔ اور یہ صحیح نہیں کہ اللہ سے تعلق صرف اللہ کے لیے ہو، کیونکہ یہ محال ہے۔ بلکہ تعلق اللہ سے اسباب کی وجہ سے ہوتا ہے۔ پس یہ اس کی معرفت (المعرفۃ) کی حد ہے۔ اس طرح آپ پر ترک صبر (ترك الصبر) کا معنی واضح ہو گیا۔",
    "fa": "(باب صد و بیست و پنجم در معرفت مقام ترک صبر و اسرار آن)\nو در صبر، از بدیِ کردار این است که\nدر هر اقدام، قهر حق را مقاومت می‌کند.\n\nپس نزد عارفان (العارفين) صبری نیست، زیرا ایشان\nاز ضعف در دریایی هستند که شمشیرش طغیانگر است.\n\n### [در صبرِ شناخته شده نزد عامه، مقاومت در برابر قهر الهی است]\n\nخداوند تو را آگاه سازد که در صبرِ شناخته شده نزد عامه، مقاومتی در برابر قهر الهی و سوء ادبی در برابر خداوند وجود دارد. خداوند بندگانش را مبتلا نساخت مگر برای اینکه به سوی او تضرع کنند و از او بخواهند تا بلایی را که به آن مبتلا شده‌اند، از ایشان بردارد. زیرا آن (بلا) دارویی است برای مرضی که در نفوسشان به واسطه صورتی که بر آن خلق شده‌اند، به آنها دست می‌دهد. پس کسی که صورت در او کامل نشده باشد، ادعای آن (صبر) را می‌کند. در حالی که از کمال آن صورت، مقام خلافت (الخلافة) است، و ایشان مردان کامل هستند. و کسی که به درجه خلافت نرسیده باشد، بر آن صورت (کامل) نیست، زیرا او تنها به واسطه مجموع (اجزای وجودش) بر صورت است.\n\n### [بزرگان مردان، نفوس خود را از شکایت به درگاه خداوند باز نمی‌دارند]\n\nبرخی از ایشان هنگامی که گرسنگی او را فرا گرفت و گریست، گفت: «مرا گرسنه ساخت تا گریه کنم.» پس او برای خدا و بر حال خود می‌گرید. زیرا بزرگان مردان، نفوس خود را از شکایت به درگاه خداوند باز نمی‌دارند. پس اگر خداوند صابران را ستوده است، منظور کسانی هستند که نفوس خود را از شکایت به غیر خدا باز داشته‌اند. و این مذهب بزرگان است. آیا نمی‌بینی سمنون را که چون سوء ادب در برابر خداوند ورزید و خواست قدرت الهی را مقاومت کند، به سبب حکم رضایت و صبری که در خود یافت، گفت:\n\nو مرا در غیر تو بهره‌ای نیست\nپس هرگونه که خواهی مرا بیازما.\n\nپس خداوند او را به سختی دفع ادرار مبتلا ساخت. و نفس بر طلب بهره خود از عافیت (العافية) سرشته شده است. و چون او این را درخواست کرد، در حکم حال عافیت بود. اما هنگامی که عافیت با این بلا از او سلب شد، نفس به مقتضای آنچه بر آن سرشته شده بود، آن را طلب کرد.\n\n### [نفس بر طلب بهره خود از عافیت سرشته شده است]\n\nو ما این مطلب را در صفات نفس ذکر کرده‌ایم و اینکه خداوند برای نفس مصارفی (محل‌هایی برای صرف شدن) تعیین کرده است، زیرا می‌دانست که نفس معدوم نمی‌شود؛ چرا که اگر معدوم می‌شد، نفس (خودش) معدوم می‌گشت. پس این وصفی ذاتی برای آن است. آیا به عالمِ عالمان و حاکمِ حکیمان (پیامبر) نمی‌نگری که چگونه درخواست عافیت می‌کرد و به آن امر می‌نمود؟\n\nپس فرمود: «إذا سألتم الله فاسألوه العافية» (هرگاه از خداوند درخواست کردید، عافیت را درخواست کنید)، زیرا اگر اهل بلا باشید، عافیت را خواسته‌اید، و اگر اهل عافیت باشید، دوام آن را خواسته‌اید.\n\nو عافیت مشتق از «عَفِيَ الأثر» است، یعنی هنگامی که اثر از بین برود. پس عافیت، از بین رفتن اثر بلا از کسی است که بلا بر او وارد شده است.\n\n### [از ادب در برابر خداوند، ایستادن بنده بر عجز و فقر خویش است]\n\nپس از ادب در برابر خداوند، ایستادن بنده بر عجز، فقر و نیاز خویش است. زیرا بی‌نیازی (الغناء) به خداوند، نه از جانب خداوند و نه از جانب مخلوقات به طور عموم صحیح نیست، اما از حیث تعیین مخلوقی خاص که می‌توان از او به واسطه دیگری بی‌نیاز شد، صحیح است.\n\n### [اسباب ذاتی را نمی‌توان برطرف کرد]\n\nزیرا خداوند اسباب را بیهوده قرار نداده است. برخی از آنها اسباب ذاتی هستند که برطرف کردنشان در اینجا ممکن نیست، و برخی اسباب عرضی هستند که می‌توان آنها را برطرف کرد. پس محال است که تألیف و ترکیب از جسم برداشته شود در حالی که حکم جسمیت در آن باقی بماند. این سببی است که زوالش ممکن نیست مگر با معدوم شدن عین جسم از هستی (الوجود). و چون اسباب اصلی برداشته نمی‌شوند، ما نیز اسباب عرضی را از باب ادب در برابر خداوند اقرار می‌کنیم و به آنها تکیه نمی‌کنیم، بلکه خاطر را به خداوند معلق می‌داریم. و صحیح نیست که تعلق به خداوند برای خود خداوند باشد، زیرا این محال است؛ بلکه تعلق به خداوند به خاطر اسباب است. این حد معرفت (المعرفة) به آنهاست. پس معنای ترک صبر برای تو آشکار شد."
  },
  "page_count": 2
}