{
  "id": 350,
  "title": {
    "ar": "الباب الموفي خمسين وثلاثمائة في معرفة منزل تجلى الاستفهام ورفع الغطاء عن أعين المعاني وهو من الحضرة المحمدية من اسمه الرب",
    "en": "Chapter 350: Concerning the Knowledge of the Station (manzil) of the Theophany (تجلي) of Interrogation (الاستفهام) and the Lifting of the Veil (الغطاء) from the Eyes of the Meanings (المعاني). It is from the Muhammadan Presence (الحضرة المحمدية), derived from His Name, the Lord (الرب).",
    "ur": "باب نمبر تین سو پچاس: اس منزل کی معرفت (المعرفۃ) میں جہاں استفہام کا ظہور الٰہی (التجلی) ہوا اور معانی کی آنکھوں سے پردہ اٹھا دیا گیا، اور یہ حضرت محمدیہ (الحضرة المحمدية) سے ہے، اس کے اسم الرب (الرب) سے۔",
    "fa": "باب سیصد و پنجاه و یکم در معرفت (المعرفة) مقام تجلی (التجلی) استفهام و برداشته شدن پرده از چشمان معانی، و آن از ساحت محمدیه (الحضرة المحمدية) است که از اسم «الرب» می‌باشد."
  },
  "content": {
    "ar": "## «الباب الموفي خمسين وثلاثمائة في معرفة منزل تجلى الاستفهام ورفع الغطاء عن أعين المعاني وهو من الحضرة المحمدية من اسمه الرب»\n\n\n> إذا صعق الروح من وحيه *** فكيف بهيكل ظلمائه‏\n\n\n> لقد ثبت الله أركانه *** وأجراه فلكا على مائه‏\n\n\n> وما هو بحر له ساحل *** وأين التناهي لأسمائه‏\n\n\n> أبو الكون لو كنت تدري به *** وتشهده عين أبنائه‏\n\n\n> فلا تفرحن بإتيانه *** ولا تقعدن بسيسائه‏\n\n\n> فسبحان مذهب أعياننا *** إذا ما كفرنا بنعمائه‏\n\n\n> ويا عجبا إذ كفرنا بها *** وإني من عين آلائه‏\n\n\n### [إن الله لا يزال يرى العالم‏]\n\n\nاعلم أيدنا الله وإياك أن هذا المنزل منزل الحجب المانعة والآلات الدافعة فمنها حجب عناية مثل‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم إن لله سبعين ألف حجاب أو سبعين حجابا الشك مني من نور ظلمة ولو كشفها لأحرقت سبحات وجهه ما أدركه بصره من خلقه‏\n\n\nوهنا نكتة وإشارة أن البصر هنا بصر الخلق الذي الحق بصره وهو القابل لهذه الحجب وهو الموصوف بأن‏\nالحق بصره وهو عين سبحات الوجه فإن الله لا يزال يرى العالم ولم يزل وما أحرقت العالم رؤيته ومنها حجب غير عناية مثل قوله تعالى كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ‏\n\n\n### [إن الحجب على أنواع حجب كيانية بين الأكوان‏]\n\n\nفاعلم إن الحجب على أنواع حجب كيانية بين الأكوان مثل قوله تعالى فَسْئَلُوهُنَّ من وَراءِ حِجابٍ ومنها حجب احتجبت بها الخلق عن الله مثل قوله وقالُوا قُلُوبُنا في أَكِنَّةٍ ومنها حجب احتجب بها الله عن خلقه مثل‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم إن الله يتجلى يوم القيامة لعباده ليس بينه وبينهم إلا رداء الكبرياء على وجهه وفي رواية بينه وبين خلقه ثلاثة حجب‏\n\n\nأو كما قال ومنها وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ كما كلم موسى عليه السلام من حجاب النار والشجرة وشاطِئِ الْوادِ الْأَيْمَنِ وجانِبِ الطُّورِ الْأَيْمَنِ وفي الْبُقْعَةِ الْمُبارَكَةِ وكما قال فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله فكلم الله المستجير من خلف حجاب محمد صَلَّى اللهُ عَليهِ وسَلَّم إذ كان هو عين الحجاب لأن المستجير من المشركين منه سمع كلام الله فلا نشك أن الله كلمنا على لسان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وكما أيضا كلمنا من وراء حجاب المصلي إذا قال سمع الله لمن حمده فالسنة العالم كلها أقوال الله وتقسيمها لله فيضيف إلى نفسه منها ما شاء ويترك منها ما شاء فأما الحجب الكيانية التي بين الأكوان فمنها جنن ووقايات ومنها عزة وحمايات كاحتجاب الملوك وحجاب الغيرة على من يغار عليه كما قال في ذوات الخدور وهن المحتجبات ومن ذلك حُورٌ مَقْصُوراتٌ في الْخِيامِ وأما الوقايات والجنن فمنها الحجب التي تقي الأجسام الحيوانية من البرد القوي والحر الشديد فيدفع بذلك الألم عن نفسه وكذلك الطوارق يدفع بها في الحرب المقاتل عن نفسه سهام الأعداء ورماحهم وسيوفهم فيتقي هذا وأمثاله بمجنه الحائل بينه وبين عدوه ويدفع بذلك عن نفسه الأذى من خودة وترس ودرع وقد تكون حجب معنوية يدفع بها الأذى الشخص عمن يتكرم عليه مثل شخص يصدر منه في حق شخص آخر ما يكرهه ذلك الشخص لكونه لا يلائم طبعه ولا يوافق غرضه فيلحق به الذم لما جرى منه في حقه فيقوم شخص يجعل نفسه له وقاية حتى يتلقى هو في نفسه سهام ذلك الذم فيقرر في نفس الذام أنه السبب الموجب لذلك وأن ذلك الأذى كان كله من جهته حتى يتحقق ذلك الذام هذا الأمر أنه كان من جهة هذا الشخص بأي وجه أمكنه التوصل إليه فيعلق الذم به ويكون حائلا بينه وبين الشخص الذي كان منه الأذى لذلك الذم فوقى عرضه بنفسه كما نلحق نحن من الأفعال ما قبح منها مما لا يوافق الأغراض ولا يلائم الطبع إلينا مع علمنا إن الكل من عند الله ولكن لما تعلق به لسان الذم فدينا ما ينسب إلى الحق من ذلك بنفوسنا أدبا مع الله وما كان من خير وحسن رفعنا نفوسنا من الطريق وأضفنا ذلك إلى الله حتى يكون هو المحمود أدبا مع الله وحقيقة فإنه لله بلا شك مع ما فيه من رائحة الاشتراك بالخبر الإلهي في قوله والله خَلَقَكُمْ وما تَعْمَلُونَ وقوله ما أَصابَكَ من حَسَنَةٍ فَمِنَ الله وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ وقال قُلْ كُلٌّ من عِنْدِ الله فأضاف العمل وقتا إلينا ووقتا إليه فلهذا قلنا فيه رائحة اشتراك قال تعالى لَها ما كَسَبَتْ وعَلَيْها ما اكْتَسَبَتْ فأضاف الكل إلينا وقال فَأَلْهَمَها فُجُورَها وتَقْواها فله الإلهام فينا ولنا العمل بما ألهم وقال كُلًّا نُمِدُّ هؤُلاءِ وهَؤُلاءِ من عَطاءِ رَبِّكَ فقد يكون عطاؤه الإلهام وقد يكون خلق العمل فهذه مسألة لا يتخلص فيها توحيد أصلا لا من جهة الكشف ولا من جهة الخبر فالأمر الصحيح في ذلك أنه مربوط بين حق وخلق غير مخلص لأحد الجانبين فإنه أعلى ما يكون من النسب الإلهية أن يكون الحق تعالى هو عين الوجود الذي استفادته الممكنات فما ثم إلا وجود عين الحق لا غيره والتغييرات الظاهرة في هذه العين أحكام أعيان الممكنات فلو لا العين ما ظهر الحكم ولو لا الممكن ما ظهر التغيير فلا بد في الأفعال من حق وخلق وفي مذهب بعض العامة أن العبد محل ظهور أفعال الله وموضع جريانها فلا يشهدها الحس إلا من الأكوان ولا تشهدها بصيرتهم إلا من الله من وراء حجاب هذا الذي ظهرت على يديه المريد لها المختار فيها فهو لها مكتسب باختياره وهذا مذهب الأشاعرة ومذهب بعض العامة أيضا إن الفعل للعبد حقيقة ومع هذا فربط الفعل عندهم بين الحق والخلق لا يزول فإن هؤلاء أيضا يقولون إن القدرة الحادثة في العبد التي يكون بها هذا الفعل من الفاعل إن الله خلق له القدرة عليها فما يخلص الفعل للعبد إلا بما خلق الله فيه من القدرة عليه فما زال الاشتراك وهذا مذهب أهل الاعتزال فهؤلاء ثلاثة أصناف أصحابنا والأشاعرة والمعتزلة ما زال منهم وقوع الاشتراك وهكذا أيضا حكم مثبتي العلل‏\nلا يتخلص لهم إثبات المعلول لعلته التي هي معلولة لعلة أخرى فوقها إلى أن ينتهوا إلى الحق في ذلك الواجب الوجود لذاته الذي هو عندهم علة العلل فلو لا علة العلل ما كان معلول عن علة إذ كل علة دون علة العلل معلولة فالاشتراك ما ارتفع على مذهب هؤلاء وأما ما عدا هؤلاء الأصناف من الطبيعيين والدهريين فغاية ما يؤول إليه أمرهم أن الذي نقول نحن فيه إنه الإله تقول الدهرية فيه إنه الدهر والطبيعيون أنه الطبيعة وهم لا يخلصون الفعل الظاهر منا دون أن يضيفوا ذلك إلى الطبيعة وأصحاب الدهر إلى الدهر فما زال وجود الاشتراك في كل نحلة وملة وما ثم عقل يدل على خلاف هذا ولا خبر إلهي في شريعة تخلص الفعل من جميع الجهات إلى أحد الجانبين فلنقره كما أقره الله على علم الله فيه وما ثم إلا كشف وشرع وعقل وهذه الثلاثة ما خلصت شيئا ولا يخلص أبدا دنيا ولا آخرة جزاء بما كنتم تعملون فالأمر في نفسه والله أعلم ما هو إلا كما وقع ما يقع فيه تخليص لأنه في نفسه غير مخلص إذ لو كان في نفسه مخلصا لا بد إن كان يظهر عليه بعض هذه الطوائف ولا يتمكن لنا أن نقول الكل على خطأ فإن في الكل الشرائع الإلهية ونسبة الخطاء إليها محال وما يخبر بالأشياء على ما هي عليه إلا الله وقد أخبر فما هو الأمر إلا كما أخبر لأن مرجوع الكل إليه فما خلص فهو مخلص وما لم يخلص فما هو في نفسه مخلص فإن الله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ فاتفق الحق والعالم جميعه في هذه المسألة على الاشتراك وهذا هو الشرك الخفي والجلي وموضع الحيرة فلا يرجح فما ثم إلا ما قلناه فإذ قد قررنا في هذه المسألة ما قررناه فلنقل‏\n\n\n### [الجود الإلهي والغيرة الإلهية]\n\n\nإن الجود الإلهي والغيرة الإلهية اقتضيا أن يقولا ما نبينه إن شاء الله وذلك أن المتكلمين في هذا الشأن على قسمين الواحد أضاف الأفعال كلها إلى الأكوان فقال لسان الغيرة الإلهية كُلٌّ من عِنْدِ الله فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً أي حادثا وأما القسم الثاني فأضاف الأفعال الحسنة كلها إلى الله وأضاف الأفعال القبيحة إلى الأكوان فقال لسان الجود الإلهي قُلْ كُلٌّ من عِنْدِ الله لا تكذيبا لهم بل ثناء جميلا وما ثم من قال إن الأفعال كلها لله ولا للأكوان من غير رائحة اشتراك فلهذا حصرناها في قسمين من أجل الطبيعية والدهرية وأما حجب العناية وهي حجب الإشفاق على الخلق من الإحراق فهي الحجب التي تمنع السبحات الوجهية أن تحرق ما أدركه البصر من الخلق وسبب ذلك أن الله قد وضع الدعاوي في الخلق لأن أعيانهم لما اتصفت بالوجود بعد العدم وأن ذلك الوجود كان عن ترجيح المرجح الذي هو واجب الوجود فما أنكره أحد وإن كانت قد تغيرت العبارات عنه باسم طبيعة ودهر وعلة وغير ذلك فهو هو لا غيره فرأوا إن الوجود لها وإن كان مستفادا فإنه لهم حقيقة وإن أعيانهم هم الموجودون بهذا الوجود المستفاد وهذه هي أعيان الحجب التي بين الله وبين خلقه فلو كشفها عموما كما كشفها خصوصا لبعض عباده لأحرقت أنوار ذاته المعبر عنها بسبحات وجهه ما أدركه بصره من أعيان الموجودات أي أن بصره ما كان يدرك من الموجودات سوى وجود الحق ويذهب الكل الذي قررته الدعاوي فيتبين أنه الحق لا غيره فعبر عن هذا الذهاب بالإحراق لما جعلها أنوارا والأنوار لها الإحراق لكنه تعالى أبقى حجب الدعاوي ليتميز أهل الله من غيرهم فلم تزل الممكنات عند أهل الله من حيث أعيانهم موصوفين بالعدم ومن حيث أحكامهم لم يزالوا موصوفين بالوجود وهو الحق كما\n\n\nقال تعالى كنت سمعه وبصره‏\n\n\nفي الخبر الصحيح فأثبت العين للعبد وجعل نفسه عين صفته التي هي عين وجوده عين صفة العبد فعين الممكن ثابتة غير موجودة والصفة موجودة ثابتة وهي عين واحدة ولو تكثرت بنسبها فإنها كثيرة في النسب فهي سمع وبصر وغير هذين إلى جميع ما في العالم من القوي من ملك وبشر وجان ومعدن ونبات وحيوان ومكان وزمان ومحل ومعقول ومحسوس وما ثم إلا هذا ولما قرر الله دعاوى المدعين بإرسال الحجب بينهم وبين ما هو الأمر عليه وشغلهم بالحجب التي بينهم وبينه في الأفعال وضرب الكل بالكل انفرد بخاصته وجعلهم جلساء له عنده بالشهود وفي صورهم المحسوسة بالذكر فهو جليس الذاكرين وهم آخر الطوائف ليس بعدهم أحد له نعت يذكر قال تعالى لما وصفهم ذُكْراناً وإِناثاً والذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ فختم بجلسائه وما بعد جلسائه من يقبل صفة إلا صفة بعد عن هذه المجالسة أ لا ترى أبا يزيد رحمه الله حين جهل الأسماء الإلهية وما تستحقه من الحقائق كيف صنع لما سمع القارئ يقرأ يوم الجمعة يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً طار الدم من عينيه حتى ضرب المنبر وتأوه وقال هذا عجب كيف يحشر إليه‏\nمن هو جليسه فإنه في تلك الحالة كان جليسا مع الأسماء من حيث ما هي دالة على الذات كل واحد منها لم يكن مع الاسم من حيث ما تطلبه حقيقته من عين دلالته على الذات فأنكر ما لم يعطه مشهده مع كونه كلام الحق وقد وقع منه الإنكار بل ما وقع منه إلا التعجب خاصة فهو يشبه الإنكار وليس بإنكار حتى أنه لو كان هذا القول من غير الله لأمر القائل بالسكوت وزجره عن ذلك وإنما الرجل أظهر التعجب من قول الله في حق المتقين الذين هم جلساء الله كيف يحشرون إليه فكأنه إبراهيمي المشهد في طلب الكيفية في إحياء الموتى فأراد أبو يزيد ما أراده إبراهيم في كيفية إحياء الموتى لاختلاف الوجوه في ذلك لا إنكار إحياء الموتى فدل هذا الكلام من أبي يزيد على حاله في ذلك الوقت فهذا مثل قول إبراهيم يا أَبَتِ إِنِّي أَخافُ أَنْ يَمَسَّكَ عَذابٌ من الرَّحْمنِ والرحمة تناقض العذاب إلا على الوجه الذي قررناه في المنزل الذي قبل هذا المنزل وهو منزل فتح الأبواب كذلك أبو يزيد لو علم إن المتقي ما هو جليس الرحمن وإنما هو جليس الجبار المريد العظيم المتكبر فيحشر المتقي إلى الرحمن ليكون جليسه فيزول عنه الاتقاء فإن الرحمن لا يتقى بل هو محل موضع الطمع والإدلال والأنس لكنهم رضي الله عنهم صادقون لا يتعدون ذوقهم في كل حال بخلاف العامة من أهل الله فإنهم يتكلمون بأحوال غيرهم والخاصة لا سبيل لهم إلى ذلك وإن اتفق أن يتكلم أحد منهم في حال نبي أو ولي هو فوقه فيبين أنه مترجم عن حال غيره حتى بعرف السامع عمن يقول هذه حالهم رضي الله عنهم ولا يقع منهم مثل هذا إلا في النادر لضرورة تدعو إليه فإن لهم الكشف الخبري عن مقامات من هو فوقهم وما لهم الكشف الذوقي إلا فيما هو مقامهم وحالهم فلو لا هذه الحجب التي أسد لها الله بين الأكوان وبينه ما تميزت المراتب واختلطت الحقائق وهذا سبب وضع الحدود في الأشياء وقد لعن الله من غير منار الأرض‏\n\n\nومن هذا الباب أن الله ما جمع لأحد بين مشاهدته وبين كلامه في حال مشاهدته فإنه لا سبيل إلى ذلك إلا أن يكون التجلي الإلهي في صورة مثالية فحينئذ يجمع بين المشاهدة والكلام وهذا غير منكور عندنا وقد بلغنا عن الشيخ العارف شهاب الدين السهروردي ببغداد رضي الله عنه أنه قال بالجمع بين المشاهدة والكلام ولكن ما نقل عنه أكثر من هذا فإني سألت الناقل فلم يذكر لي نوع التجلي والظن بالشيخ جميل فلا بد أن يريد التجلي الصوري أ لا ترى السياري من رجال رسالة القشيري حيث قال ما التذ عاقل بمشاهدة قط ثم فسر فقال لأن مشاهدة الحق فناء ليس فيها لذة والخطاب في حال الفناء لا يصح لأن فائدة الخطاب أن يعقل ولذلك قال وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ وما زال البشر عن حكم البشرية كمسألة موسى والحجاب عين الصورة التي يناديه منها وما يزول البشر عن بشريته وإن فنى عن شهودها فعين وجودها لا يزول والحد يصحبها وإنما قلنا هذا لأني سمعت بعض الشيوخ يقول هذا حظ البشر فإذا زال عن بشريته كان حكمه حكما آخر فأبنت له رضي الله عنه إن الأمر ليس كما يظنه فلما تحقق ما ذكرناه رجع عن ذلك وقال ما كنت أظن إلا إن الأمر على ما قلته لم أجعل بالي من هذا فإنه تكلم في شرح الآية فغلط ما تكلم في ذلك عن ذوق الأمر ومن هنا يقع الغلط ونحن نعلم أن الذي قاله الله حق كله وإنه لا يخالف الأذواق فلا بد أن يكون كلام الذائق مطابقا للاخبارات الإلهية حتى يقول من لا معرفة له بمقام الرجال إن هذا المتكلم يتكلم بما لا يخالف ما جاء به قرآن أو سنة إنما هو أخذه منهما وهو مفسر لهما وصاحب الذوق ما قال إلا ما ذاقه فمن المحال أن يخالف شيئا مما جاء عن الله لكن الأجنبي الذي لا ذوق له يقول هذا عن الذائق بل جماعة من أهل الطريق ممن لا ذوق لهم يتخيلون مثل هذا ويقولون إن فلانا يتكلم من حيثما ورد في الأخبار الإلهية ليس له مادة غيرها وينكرون الذوق لأنهم ما عرفوه من نفوسهم مع كونهم يعتقدون في نفوسهم أنهم على طريق واحدة وكذلك هو الأمر أصحاب الأذواق هم على طريق واحدة بلا شك غير أن فيهم البصير والأعمى والأعشى فلا يقول واحد منهم إلا ما أعطاه حاله لا ما أعطاه الطريق ولا ما هو الطريق عليه في نفسه ولا سيما السلوك المعنوي فإن عمى القلوب أشد من عمى الأبصار فإن عمى القلوب يحول بينك وبين الحق وعمى البصر الذي لم ير قط صاحبه ليس يحول إلا بينك وبين الألوان خاصة ليس له إلا ذلك وهذا العمي من الحجب وكذلك الصمم والقفل والكن‏\nوالغشاوة دون العمي في الحكم إلا أن تكون الغشاوة تعطي الظلمة فلا فرق بينها وبين العمي فإن خرجت عن حد الظلمة إلى حد السدفة فقد يكون حال صاحبها أحسن من حال صاحب الظلمة ومن حال الأعمى قال بعضهم لمحمد صَلَّى اللهُ عَليهِ وسَلَّم ومن بَيْنِنا وبَيْنِكَ حِجابٌ وهو الأكنة فَاعْمَلْ إِنَّنا عامِلُونَ أي اعمل في رفع ذلك ويحتمل قولهم إِنَّنا عامِلُونَ في رفع ذلك في حق من يحتمل صدقه عندهم فإنهم اعترفوا أن قلوبهم في أكنة مما يدعوهم إليه فما جحدوا قوله ولا ردوه كما اعتقد غيرهم ممن لم يقل ذلك فلا أدري ما آل إليه أمر هؤلاء فإنهم عندي في مقام الرجاء فإنا نعلم قطعا إن الرسول يعمل في رفع الغطاء عن أعينهم بلا شك حتى قال لأزيدن على السبعين ولذا قال في الآية ووَيْلٌ لِلْمُشْرِكِينَ ولم يقل وويل لكم فهذا يدل بقرينة الحال أنهم عاملون في رفع الحجاب وإخراج قلوبهم من الأكنة وإنما كثر الأكنة لاختلاف أسباب توقفهم في قبول ما أتاهم به فمنهم من كنه الحسد وآخر الجهل وآخر شغل الوقت بما كان عنده أهم حتى يتفرغ منه والكل حجاب ومن أعجب الأشياء الواقعة في الوجود ما أقوله وذلك أن الملائكة إذا تكلم الله بالوحي كأنه سلسلة على صفوان تصعق الملائكة ورسول الله صَلَّى اللهُ عَليهِ وسَلَّم كان إذا نزل عليه الوحي كسلسلة على صفوان يصعق وهو أشد الوحي عليه فينزل جبريل به على قلبه فيفني عن عالم الحس ويرغو ويسجى إلى أن يسرى عنه وأنه لينزل عليه الوحي في اليوم الشديد البرد فيتفصد جبينه عرقا\n\n\nوموسى صَلَّى اللهُ عَليهِ وسَلَّم كلمه الله تكليما بارتفاع الوسائط وما صعق ولا زال عن حسه وقال وقيل له وهذا المقام أعظم من مقام الوحي بوساطة الملك فهذا الملك يصعق عند الكلام وهذا أكرم البشر يصعق عند نزول الروح بالوحي وهذا موسى لم يصعق ولا جرى عليه شي‏ء مع ارتفاع الوسائط وصعق لذلك الجبل فاعلم إن هذا كله من آثار الحجب فإن الحكم لها حيث ظهرت فإن الله لما خلقها حجبا لم يمكن إلا أن تحجب ولا بد فلو لم تحجب لما كانت حجبا وخلق الله هذه الحجب على نوعين معنوية ومادية وخلق المادية على نوعين كثيفة ولطيفة وشفافة فالكثيفة لا يدرك البصر سواها واللطيفة يدرك البصر ما فيها وما وراءها والشفافة يدرك البصر ما وراءها ويحصل له الالتباس إذا أدرك ما فيها كما قيل‏\n\n\n> رق الزجاج ورقت الخمر *** فتشاكلا فتشابه الأمر\n\n\n> فكأنما خمر ولا قدح *** وكأنما قدح ولا خمر\n\n\nوأما المرائي والأجسام الصقيلة فلا يدرك موضع الصور منها ولا يدرك ما وراءها ويدرك الصور الغائبة عن عين المدرك بها لا فيها فالصور المرئية حجاب بين البصر وبين الصقيل وهي صور لا يقال فيها لطيفة ولا كثيفة وتشهدها الأبصار كثيفة وتتغير أشكالها بتغير شكل الصقيل وتتموج بتموجه وتتحرك بتحرك من هي صورته من خارج وتسكن بسكونه إلا أن يتحرك الصقيل كتموج الماء فيظهر في العين فيها حركة ومن هي صورته ساكن فلها حركتان حركة من حركة من هي صورته وحركة من حركة الصقيل فما في الوجود إلا حجب مسدلة والإدراكات متعلقها الحجب ولها الأثر في صاحب العين المدرك لها\n\n\n### [الحجب حجابان حجاب معنوي وحجاب حسي‏]\n\n\nوأعظم الحجب حجابان حجاب معنوي وهو الجهل وحجاب حسي وهو أنت على نفسك فأما الحجاب الأعظم المعنوي‏\n\n\nفقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لما أسرى به في شجرة فيها وكرا طائر فقعد جبريل في الوكر الواحد وقعد رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الآخر فلما وصلا إلى السماء الدنيا تدلى إليهما شبه الرفرف درا وياقوتا وكان ذلك نوعا من تجلى الحق قال عليه السلام فأما جبريل فغشي عليه لعلمه بما تدلى إليه وأما رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فبقي على حاله لكونه ما علم ما هو فلم يكن له سلطان عليه فلما أخبره جبريل عند ما أفاق أنه الحق قال صَلَّى اللهُ عَليهِ وسَلَّم عند ذلك فعلمت فضله‏\n\n\nيعني فضل جبريل علي في العلم فالعلم أصعق جبريل وعدم العلم أبقى النبي صلى الله عليه وسلم على حاله مع وجود الرؤية من الشخصين فهذا أعظم الحجب المعنوية وأما كونك حجابا عليك وهو أكثف الحجب الحسية فقول القائل‏\n\n\n> بدا لك سر طال عنك اكتتامه *** ولاح صباح كنت أنت ظلامه‏\n\n\n> فأنت حجاب القلب عن سر غيبه *** ولولاك لم يطبع عليه ختامه‏\n> إذا غبت عنه حل فيه وطنبت *** على منكب الكشف المصون خيامه‏\n\n\n> وجاء حديث لا يمل سماعه *** شهى إلينا نثره ونظامه‏\n\n\nفما جعل حجابا عليك سواك ثم نرجع إلى مسألتنا ونقول أما موسى عليه السلام فكان قد استفرغه طلب النار لأهله وهو الذي أخرجه لما أمر به من السعي على العيال والأنبياء أشد الناس مطالبة لأنفسهم للقيام بأوامر الحق فلم يكن في نفسه سوى ما خرج إليه فلما أبصر حاجته وهي النار التي لاحت له من الشَّجَرَةِ من جانِبِ الطُّورِ الْأَيْمَنِ ناداه الحق من عين حاجته بما يناسب الوقت إِنِّي أَنَا رَبُّكَ فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوادِ الْمُقَدَّسِ طُوىً وأَنَا اخْتَرْتُكَ فَاسْتَمِعْ لِما يُوحى‏ ولم يقل لما أوحى إِنَّنِي أَنَا الله فثبته الخطاب الأول بالنداء لأنه خرج على إن يقتبس نارا أو يجد على النار هدى وهو قوله سَآتِيكُمْ مِنْها بِخَبَرٍ أي من يدله على حاجته فكان منتظرا للنداء قد هيأ سمعه وبصره لرؤية النار وسمعه لمن يدله عليها فلما جاءه النداء بأمر مناسب لم ينكره وثبت فلما علم إن المنادي ربه وقد صح له الثبوت وجاءه النداء من خارج لا من نفسه ثبت ليوفي الأدب حقه في الاستماع فإنه لكل نوع من التجلي حكم وحكم نداء هذا التجلي التهيؤ لسماع ما يأتي به فلم يصعق ولا غاب عن شهوده فإنه خطاب مقيد بجهة مسموع بإذن وخطاب تفصيلي فالمثبت للإنسان على حسه وشهود محسوسه قلبه المدبر لجسده ولم يكن لهذا الكلام الإلهي الموسوي توجه على القلب فليس للقلب هنا إلا ما يتلقاه من سمعه وبصره وقواه حسبما جرت به العادة فلم يتعد الحال حكمه في موسى عليه السلام وأما أمر محمد صَلَّى اللهُ عَليهِ وسَلَّم فهو نزول قلبي وخطاب إجمالي كسلسلة على صفوان فاجعل بالك لهذا التشبيه فاشتغل القلب بما نزل إليه ليتلقاه فغاب عن تدبير بدنه فسمى ذلك غشية وصعقا وكذلك الملائكة أخبر النبي صَلَّى اللهُ عَليهِ وسَلَّم عن الملائكة في طريان هذا الحال أنه إذا كان الوحي المتكلم به كسلسلة على صفوان وكان نزوله على قلوب الملائكة فإنه قال حَتَّى إِذا فُزِّعَ عَنْ قُلُوبِهِمْ ثم لما أفاقوا أخبر عنهم بأنهم يقولون ما ذا وهنا وقف ثم يجيبهم فيقول ربكم وهنا وقف فيقولون الحق بالنصب أي قال الحق كذا علمناه وهو العلي عن هذا النزول في هذا النزول الكبير عن هذا التشبيه في هذه النسبة وعلى الوجه الآخر قالُوا ما ذا قالَ رَبُّكُمْ وهنا وقف فيقول بعضهم لبعض الْحَقَّ وهُوَ الْعَلِيُّ الْكَبِيرُ من قول الله لا من قول الملائكة فعلى الوجه الأول لما أفاقوا وزال الخطاب الإجمالي المشبه وزالت البديهة قالوا ما ذا فقال لهم ربكم وهو قوله قال ربكم فما صعقوا عند هذا القول بل ثبتوا وقالوا الحق أي قال الحق أي قال ربنا القول الحق يعنون ما فهموه من الوحي أو قوله قال ربكم أو هما معا وهو الصحيح فهذا الفرق بين حال موسى عليه السلام وبين حال محمد صَلَّى اللهُ عَليهِ وسَلَّم وحال الملائكة ع‏\n\n\n### [علم ثناء الحق على نفسه بخلقه‏]\n\n\nواعلم أن في هذا المنزل من العلوم علم ثناء الحق على نفسه بخلقه وهو المثنى على نفسه بغناه عن خلقه فأي الثناءين أتم وأحق وما هو الحق من هذين الثناءين وما هو الحقيقة منهما أو كلاهما حقيقتان لحقين أو هما حقان ولهما حقيقتان وفيه علم الفرق بين العلم والحكمة والخبرة وفيه علم العلم بما في العالم بتقاسيم أحوالهم وفيه علم النيابة في الأجوبة عن الله ولا يكون ذلك إلا لرسول أو نبي أو وارث عن سماع لخطاب إلهي لا عن تجل ولا خطاب حال وفيه علم علم الله وفيه علم أين أودع الله علمه في خلقه من العوالم وهل أودعه في واحد أو فيما زاد على واحد وفيه علم بما ذا تتميز به القبضتان في عالم الشهادة وبما ذا تتميز به في عالم الغيب وفيه علم الدلالة على العلماء وأصحاب الأخبار الإلهية لنعرفهم فنتلقي منهم ما يأتون به عن الله فنساويهم في العلم بذلك رغبة في إن تلحق نفوسنا بنفوسهم في الصورة وإن اختلفت الطرق فلا أثر لاختلافها في صورة العلم وهذا هو الذي يحرض الأكابر من العلماء الأكابر على نشر العلم كما يحرض المتعلمين على طلب العلم من أكابر العلماء الذين يعلمون أنهم أعلم بالله منهم ومن هذا قال الرجل للتلميذ لأن ترى أبا يزيد مرة خير لك من أن ترى الله ألف مرة لفضله عليه في العلم بالله لما علم إن ظهور الحق لعباده على قدر علمهم به فرؤيتنا الله بعلم العلماء به إذا استفدناه منهم أتم من رؤيتنا بعلمنا قبل إن نستفيده منهم وفيه علم إحاطة الاعتبار بالجهات وإن أن الاعتبار لا يخص حالا من حال ولا جهة من جهة وأنه علم عام وهو علم يعطي الدلالة لمن رجع إلى الله بالعبودة وفيه علم الأمر والنهي الإلهي بالمساعدة في العبادة وأعمال الخير وفيه علم إرسال النعم‏\nالخارقة وما يحجب منها وما ذا يحجب وفيه علم قوى المسخرات في التسخير وإلى أين تنتهي قواهم فيما سخروا فيه وفيه علم الموت المجهول في الميت وبما ذا يعرف كما حكى القشيري في رسالته عن بعضهم أنه مات إنسان فنظر إليه الغاسل فتحير فلم يدر أ هو ميت أم ليس بميت وهو ميت في نفس الأمر ومثل هذا ظهر على صاحب لي كان يخدمني فمات عندي فشك فيه الغاسل عند غسله هل هو ميت أم لا وفيه علم أثر العلم في العالم ومن ادعى العلم ولم يؤثر فيه ما هو عالم وهي مسألة مشكلة يورث الإشكال فيها الحس فإنه ما رأينا أحدا يلقي نفسه في النار لعلمه أنها تحرقه إلا طائفتين الواحدة من تتخذها قربانا فتلقى نفسها فيها طلبا للإحراق قربة إليها أو من يعلم أنها لا تحرقه فعلمنا إن العلم له أثر في العالم وفيه علم آيات النعم وعلى ما ذا تدل وما حقها على من يراها آية وفيه علم العلم القوي الذي يذهب بما سواه من العلوم التي يجدها في القلب وفيه علم الأدنى والأعلى وما السبب الموجب للطالب في طلبه الأدنى وتركه الأعلى مع علمه بمرتبة كل واحد منهما وفيه علم أسباب الجزاء في الخير والشر وفيه علم البعد والقرب الكياني والإلهي وفيه علم ما في علم القرب والبعد من الآيات الدالة على الله وفيه علم موافقة الظن العلم وبما ذا يعلم صاحب الحق أنه علم لا ظن وقد كان يعتقد أن ذلك ظن وفيه علم حال أهل الريب وبمن يلحقون من الأصناف وما ينظر إليهم من الأسماء وفيه علم الحوالة وفيه علم أحوال الملإ الأعلى واختلافها عليهم لاختلاف الواردات في مقامهم المعلوم وفيه علم ما لا ينسب إلى الله أعني لا يوصف به هل هو أمر عدمي أو وجودي وفيه علم أين يشك العالم وهو ليس بشاك ولما ذا يظهر بصورة الشاك وفيه علم ما يسأل عنه وما لا يسأل عنه وفيه علم فيما ذا يجمع الله بين عباده ثم يفصل بينهم في عين هذا الجمع فهم فيه مفصلون وفيه علم من ادعى أمرا طولب بالدليل على ما ادعاه إذا ادعى ما يريد أن يؤثر به في أحوال العالم وفيه علم ما لا يقبل التقدم ولا التأخر من الأحوال وفيه علم الحجاج وفيه علم التقريب وإلى من يكون القرب هل إلى كون أو إلى الله وهل يصح القرب إلى الله أم لا وهو أقرب إلى كل إنسان من حَبْلِ الْوَرِيدِ كما قال تعالى وفيه علم الأعراض وفيه علم الفرق والتبري بين الأرواح وفيه علم ما يقال عند رؤية الدلالات وفيه علم الأجر المعاد وإلحاق الشي‏ء بجنسه وفيه علم من يدري ما يقول وما يقال له ومن لا يدري ما يقول وما يقال له من ذلك وفيه علم رد الأمور كلها حيرتها وإنابتها إلى الله وخيرها وشرها وأن الشر ليس إلى الله وفيه علم الإدراك الإلهي وفيه علم ما لا يدرك مما يجوز أن يدرك وفيه علم ما يمنع الاحتلام بالرؤية وفيه علم الموانع والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Fifty: Concerning the Knowledge of the Station (منزل) of the Theophany (تجلى) of Interrogation and the Lifting of the Veil (رفع الغطاء) from the Eyes of Meanings (أعين المعاني), which is from the Muhammadan Presence (الحضرة المحمدية), derived from His Name, The Lord (الرب).\n\nIf the Spirit is struck senseless by His Revelation,\nHow then fares the temple of its darkness?\nIndeed, Allah has established its pillars,\nAnd made it run like a sphere upon His water.\nAnd He is not a sea that has a shore;\nWhere is the limit to His Names?\nThe Father of the Cosmos, if you but knew Him,\nAnd witnessed Him with the eye of His children.\nSo do not rejoice at His coming,\nNor sit upon His foundation.\nGlory be to the One who removes our essences (أعياننا)\nWhen we deny His blessings.\nAnd O wonder, when we deny them,\nYet I am from the very source of His bounties.\n\n[Indeed, Allah Continually Sees the World]\n\nKnow—may Allah support us and you—that this Station is the Station of the preventing Veils (الحجب المانعة) and the repelling Instruments (الآلات الدافعة). Among these are the Veils of Providence (حجب عناية), such as the saying of the Prophet (peace and blessings be upon him): \"Indeed, Allah has seventy thousand veils, or seventy veils—the doubt is mine—of light and darkness. If He were to lift them, the splendors of His Face (سبحات وجهه) would burn everything reached by His sight (بصره) from His creation.\"\n\nHerein lies a subtle point and an indication: the sight (البصر) mentioned here is the sight of the creation (بصر الخلق) which the Real (الحق) made its sight, and it is the recipient of these Veils. It is described as that whose sight is the Real, and it is the very essence of the splendors of the Face. For indeed, Allah continually sees the world (العالم) and has always done so, and His vision has not burned the world. Among them are Veils of Non-Providence (حجب غير عناية), such as His saying, the Exalted: <<كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ>> (Nay! Indeed, they will surely be veiled from their Lord on that Day).\n\n[Indeed, Veils are of Types: Existential Veils Between Existents]\n\nKnow that Veils (الحجب) are of several types:\n1. **Existential Veils (حجب كيانية) between existents (الأكوان):** Such as His saying, the Exalted: <<فَسْئَلُوهُنَّ من وَراءِ حِجابٍ>> (So ask them from behind a veil).\n2. **Veils by which the creation veils itself from Allah:** Such as His saying: <<وقالُوا قُلُوبُنا في أَكِنَّةٍ>> (And they said, \"Our hearts are in coverings\").\n3. **Veils by which Allah veils Himself from His creation:** Such as the saying of the Prophet (peace and blessings be upon him): \"Indeed, Allah will manifest Himself to His servants on the Day of Resurrection, and there will be nothing between Him and them except the mantle of Grandeur (رداء الكبرياء) upon His Face.\" And in another narration: \"Between Him and His creation are three veils,\" or words to that effect.\n4. **And among them:** <<وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ>> (And it is not for any human being that Allah should speak to him except by revelation, or from behind a veil), as He spoke to Moses (peace be upon him) from the veil of the fire, the tree, the right bank of the valley (شاطِئِ الْوادِ الْأَيْمَنِ), the right side of the Mount (جانِبِ الطُّورِ الْأَيْمَنِ), and in the blessed spot (الْبُقْعَةِ الْمُبارَكَةِ).\n5. **And also:** As He said: <<فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله>> (So grant him protection until he hears the Word of Allah). Allah spoke to the seeker of protection (المستجير) from behind the veil of Muhammad (peace and blessings be upon him), since the Prophet was the very essence of the Veil (عين الحجاب), because the seeker of protection, who was one of the polytheists, heard the Word of Allah from him. Thus, we do not doubt that Allah spoke to us through the tongue of the Messenger of Allah (peace and blessings be upon him).\n6. **And also:** As He speaks to us from behind the veil of the worshipper (المصلي) when he says, \"Allah hears those who praise Him.\"\n\nThe entire speech of the world (العالم) is the sayings of Allah, and their division belongs to Allah. He attributes to Himself whatever He wills of them and leaves whatever He wills.\n\nAs for the Existential Veils (الحجب الكيانية) that are between existents (الأكوان), some are shields (جنن) and protections (وقايات), and some are honor (عزة) and safeguards (حمايات), such as the veiling of kings, and the veil of jealousy (حجاب الغيرة) over those one is jealous for, as He said concerning the women in the private chambers (ذوات الخدور), who are the veiled ones. And from this is <<حُورٌ مَقْصُوراتٌ في الْخِيامِ>> (Fair maidens confined in pavilions).\n\nAs for protections and shields, they include the veils that protect animal bodies from intense cold and severe heat, thereby warding off pain from themselves. Similarly, in war, the fighter uses shields to ward off the arrows, spears, and swords of enemies. He protects himself with this and similar things—his intervening shield (مجنه الحائل) between himself and his enemy—thereby warding off harm from himself, whether it be a helmet, a buckler, or armor.\n\nThere may also be **spiritual veils (حجب معنوية)** by which a person wards off harm from someone he honors. For example, if one person does something disliked by another because it does not suit his temperament or agree with his purpose, the latter person attributes blame (الذم) to him for what occurred. Then, a third person stands up and makes himself a shield for the first, receiving the arrows of that blame upon himself. He convinces the blamer that he (the third person) was the necessary cause for that action, and that all the harm came from his side, until the blamer is convinced that the matter originated from this third person, by whatever means possible. The blame then attaches to him, and he becomes a barrier between the blamer and the person who originally caused the harm to the blamer. Thus, he protects the honor of the other with his own self.\n\nSimilarly, we attribute ugly actions—those that do not agree with purposes or suit temperament—to ourselves, even though we know that everything is from Allah. But because the tongue of blame attaches to it, we ransom what is attributed to the Real (الحق) with our own selves, out of courtesy (أدبا) toward Allah. As for what is good and beautiful, we remove ourselves from the path and attribute it to Allah, so that He is the one praised, out of courtesy toward Allah and in reality (حقيقة). For it belongs to Him without doubt, despite the scent of partnership (رائحة الاشتراك) implied by the divine report in His saying: <<والله خَلَقَكُمْ وما تَعْمَلُونَ>> (And Allah created you and what you do), and His saying: <<ما أَصابَكَ من حَسَنَةٍ فَمِنَ الله وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ>> (Whatever good befalls you is from Allah, and whatever evil befalls you is from yourself). Yet He also said: <<قُلْ كُلٌّ من عِنْدِ الله>> (Say: All is from Allah).\n\nThus, He sometimes attributes the action to us and sometimes to Himself. This is why we said there is a scent of partnership. The Exalted said: <<لَها ما كَسَبَتْ وعَلَيْها ما اكْتَسَبَتْ>> (For it is what it has earned, and against it is what it has acquired), attributing everything to us. And He said: <<فَأَلْهَمَها فُجُورَها وتَقْواها>> (Then inspired it [with] its wickedness and its righteousness). So, He has the inspiration (الإلهام) in us, and we have the action based on what He inspired. And He said: <<كُلًّا نُمِدُّ هؤُلاءِ وهَؤُلاءِ من عَطاءِ رَبِّكَ>> (To all—these and those—We extend from the bounty of your Lord). His bounty may be the inspiration, or it may be the creation of the action.\n\nThis is a matter in which absolute Unity (توحيد) is never achieved, neither through Unveiling (الكشف) nor through divine Report (الخبر). The sound position in this regard is that the matter is bound between the Real (الحق) and the creation (الخلق), not exclusively belonging to either side. The highest of the divine relations (النسب الإلهية) is that the Real, the Exalted, is the very Essence of Existence (عين الوجود) that the contingent things (الممكنات) acquired. Thus, there is nothing but the Existence of the Essence of the Real (وجود عين الحق), and nothing else. The apparent changes in this Essence are the rulings (أحكام) of the immutable essences (الأعيان الثابتة) of the contingent things. Were it not for the Essence, the ruling would not appear; and were it not for the contingent thing, the change would not appear. Therefore, in actions, both the Real and the creation are necessary.\n\nIn the doctrine of some common people (العامة), the servant is the locus of the manifestation of Allah’s actions and the place of their occurrence. The senses only witness them as coming from existents (الأكوان), but their inner sight (بصيرتهم) only witnesses them as coming from Allah, from behind a veil. This is the one through whose hands the action appeared, the one who desired it and chose it; thus, he is the acquirer (مكتسب) of it by his choice. This is the doctrine of the Ash’arites (الأشاعرة).\n\nThe doctrine of some other common people is that the action truly belongs to the servant. Yet, even for them, the connection of the action between the Real and the creation does not vanish. For these people also say that the originated power (القدرة الحادثة) in the servant, by which this action is performed by the agent, is created by Allah for him. Thus, the action is not purely the servant’s unless Allah created the power for it within him. So, the partnership has not ceased. This is the doctrine of the Mu’tazilites (أهل الاعتزال).\n\nThese are three groups: our companions, the Ash’arites, and the Mu’tazilites—the occurrence of partnership has not ceased among them. Similarly, the ruling applies to those who affirm causes (مثبتي العلل). They cannot purely affirm the effect (المعلول) to its cause, which is itself an effect of another cause above it, until they reach the Real in this matter—the Necessary Existent by His Essence (الواجب الوجود لذاته), who is, for them, the Cause of Causes (علة العلل). Were it not for the Cause of Causes, there would be no effect from a cause, since every cause below the Cause of Causes is an effect. Thus, partnership has not been removed according to the doctrine of these people.\n\nAs for those outside these groups, such as the Naturalists (الطبيعيين) and the Materialists (الدهريين), the ultimate conclusion of their matter is that what we call the Deity (الإله), the Materialists call Time (الدهر), and the Naturalists call Nature (الطبيعة). They do not purify the action that appears from us without attributing it to Nature, or the Materialists to Time. Thus, the existence of partnership (وجود الاشتراك) has not ceased in any sect or creed.\n\nThere is no intellect (عقل) that indicates otherwise, nor any divine report (خبر إلهي) in a Law (شريعة) that purifies the action from all aspects, attributing it solely to one of the two sides. Therefore, let us affirm it as Allah has affirmed it, according to Allah’s Knowledge concerning it. There is nothing but Unveiling (كشف), Law (شرع), and Intellect (عقل). These three have not purified anything, and nothing will ever be purified, neither in this world nor the Hereafter: <<جَزَاءً بِمَا كُنْتُمْ تَعْمَلُونَ>> (A recompense for what you used to do).\n\nThe matter in itself, and Allah knows best, is exactly as it occurred; there is no purification in it, because in itself it is not purified. For if it were purified in itself, it would necessarily manifest to some of these factions. We cannot say that all are mistaken, for divine Laws (الشرائع الإلهية) exist in all of them, and attributing error to them is impossible. Only Allah reports things as they truly are, and He has reported. Thus, the matter is only as He reported, because the return of all is to Him. What is purified is purified, and what is not purified is not purified in itself. For Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).\n\nThus, the Real (الحق) and the entire world (العالم) agree on partnership (الاشتراك) in this matter. This is the hidden and manifest polytheism (الشرك الخفي والجلي) and the locus of bewilderment (موضع الحيرة). No preference is given. Thus, there is only what we have stated. Since we have established what we established in this matter, let us say:\n\n[Divine Generosity and Divine Jealousy]\n\nIndeed, Divine Generosity (الجود الإلهي) and Divine Jealousy (الغيرة الإلهية) necessitated that they say what we shall explain, if Allah wills. Those who speak on this subject are of two types:\n\nThe first attributes all actions to the existents (الأكوان). The tongue of Divine Jealousy said: <<كُلٌّ من عِنْدِ الله فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً>> (All is from Allah. What is wrong with these people that they hardly understand a statement?)—meaning, an originated thing (حادثا).\n\nThe second attributes all good actions to Allah and attributes ugly actions to the existents. The tongue of Divine Generosity said: <<قُلْ كُلٌّ من عِنْدِ الله>> (Say: All is from Allah), not in denial of them, but as beautiful praise.\n\nThere is no one who has said that all actions belong entirely to Allah, nor entirely to the existents, without a scent of partnership. This is why we limited them to two types, due to the Naturalists and the Materialists.\n\nAs for the **Veils of Providence (حجب العناية)**, which are the veils of compassion (الإشفاق) for the creation against burning, these are the veils that prevent the splendors of the Face (السبحات الوجهية) from burning whatever His sight reaches of the creation.\n\nThe reason for this is that Allah has placed claims (الدعاوي) in the creation, because when their essences (أعيانهم) were characterized by existence (الوجود) after non-existence (العدم), and that existence came from the preference of the Preferrer (ترجيح المرجح), who is the Necessary Existent (واجب الوجود)—no one denies this, even if the expressions for it have changed to the name Nature, Time, Cause, and so on; He is He, and no other. They saw that existence belongs to them, and even if it is acquired (مستفاد), it is truly theirs, and that their essences are the ones existing by this acquired existence. These are the very essences of the Veils (أعيان الحجب) between Allah and His creation.\n\nIf He were to lift them generally, as He lifted them specifically for some of His servants, the lights of His Essence (أنوار ذاته)—expressed as the splendors of His Face—would burn whatever His sight reached of the essences of existents (أعيان الموجودات). That is, His sight would perceive nothing of the existents except the Existence of the Real (وجود الحق), and everything established by the claims would vanish. It would become clear that He is the Real, and nothing else. This vanishing is expressed as burning, because He made them lights, and lights possess burning power.\n\nHowever, the Exalted maintained the veils of claims (حجب الدعاوي) so that the people of Allah (أهل الله) might be distinguished from others. Thus, for the people of Allah, the contingent things (الممكنات), in terms of their essences (أعيانهم), remain characterized by non-existence (العدم), and in terms of their rulings (أحكامهم), they remain characterized by Existence, which is the Real (الحق), as the Exalted said: \"I was his hearing and his sight,\" in the authentic report (الخبر الصحيح).\n\nHe affirmed the essence (العين) for the servant and made Himself the essence of the servant’s attribute (صفته), which is the essence of His Existence, which is the essence of the servant’s attribute. The essence of the contingent thing (عين الممكن) is fixed (ثابتة) but non-existent (غير موجودة), while the attribute (الصفة) is existent and fixed (موجودة ثابتة). It is one essence, even if it multiplies through its relations (نسبها). It is multiple in relations: it is hearing, sight, and other things, extending to all the powers (القوي) in the world—angel, human, jinn, mineral, plant, animal, place, time, locus, intelligible, and sensible. There is nothing but this.\n\nSince Allah established the claims of the claimants by sending down veils between them and the reality of the matter, and occupied them with the veils between them and Him in actions, and struck everything by everything, He singled out His elect (خاصته). He made them His companions (جلساء) with Him through Witnessing (الشهود), and in their sensible forms (صورهم المحسوسة) through Remembrance (الذكر). He is the Companion of those who remember (جليس الذاكرين). They are the last of the groups; there is no one after them who possesses a mentionable description.\n\nThe Exalted said, describing them: <<ذُكْراناً وإِناثاً والذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ>> (Men and women who remember [Allah], and the men who remember Allah often and the women who remember). He concluded with His companions. No one after His companions accepts a description except the description of distance from this companionship.\n\nDo you not see what Abu Yazid (may Allah have mercy on him) did when he was ignorant of the Divine Names (الأسماء الإلهية) and the realities they deserve? When he heard the reciter on Friday reading: <<يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً>> (The Day We will gather the righteous to the Most Merciful [الرحمن] as a delegation), blood flew from his eyes until it struck the pulpit, and he sighed and said: \"This is strange! How can He gather to Him one who is already His companion (جليسه)?\"\n\nIn that state, he was a companion of the Names (الأسماء) in terms of their indication of the Essence (الذات), each one of them. He was not with the Name in terms of what its reality demands from the very essence of its indication of the Essence. So, he denied what his witnessing (مشهده) did not grant him, despite it being the Word of the Real (كلام الحق). Indeed, what occurred from him was not denial, but only astonishment (التعجب). It resembles denial but is not denial, to the extent that if this saying had come from someone other than Allah, he would have commanded the speaker to be silent and rebuked him for it. The man only expressed astonishment at the Word of Allah concerning the righteous (المتقين), who are the companions of Allah: how are they gathered to Him?\n\nIt is as if his witnessing was Abrahamic (إبراهيمي المشهد) in seeking the *how* (الكيفية) of raising the dead. Abu Yazid desired what Abraham desired regarding the *how* of raising the dead, due to the difference in aspects, not a denial of the raising of the dead. This statement from Abu Yazid indicates his state at that time. This is like Abraham’s saying: <<يا أَبَتِ إِنِّي أَخافُ أَنْ يَمَسَّكَ عَذابٌ من الرَّحْمنِ>> (O my father, indeed I fear that a punishment from the Most Merciful [الرحمن] will touch you). Mercy (الرحمة) contradicts punishment (العذاب), except according to the aspect we established in the Station preceding this one, which is the Station of the Opening of the Doors.\n\nSimilarly, Abu Yazid, had he known that the righteous person (المتقي) is not the companion of *al-Rahman* (the Most Merciful), but rather the companion of *al-Jabbar* (the Compeller), *al-Murid* (the Willer), *al-Azim* (the Magnificent), *al-Mutakabbir* (the Proud), then the righteous person is gathered to *al-Rahman* so that he may become His companion, and the state of caution (الاتقاء) is removed from him. For *al-Rahman* is not feared (لا يتقى); rather, He is the locus of hope (الطمع), intimacy (الإدلال), and familiarity (الأنس).\n\nHowever, they (may Allah be pleased with them) are truthful; they do not transgress their tasting (ذوقهم) in any state, unlike the common people of Allah (العامة من أهل الله), who speak of the states of others. The elect (الخاصة) have no way to do that. If it happens that one of them speaks about the state of a prophet or saint who is above him, he makes it clear that he is translating the state of another, so that the listener knows whose state he is describing. This is their way (may Allah be pleased with them). Such an occurrence is rare for them, only happening out of necessity. For they possess the knowledge of Unveiling through Report (الكشف الخبري) concerning the stations of those above them, but they only possess the knowledge of Unveiling through Tasting (الكشف الذوقي) concerning their own station and state.\n\nWere it not for these Veils (الحجب) that Allah has drawn between the existents and Himself, the Levels (المراتب) would not be distinguished, and the Realities (الحقائق) would be mixed. This is the reason for establishing boundaries (الحدود) in things. Allah cursed the one who changes the landmarks of the earth.\n\nIt is from this chapter that Allah has not combined for anyone the witnessing of Him (مشاهدته) and His speech (كلامه) during the state of witnessing. There is no way to achieve this unless the Divine Theophany (التجلي الإلهي) occurs in an imaginal form (صورة مثالية). In that case, witnessing and speech can be combined. This is not denied by us.\n\nWe have been informed that the Gnostic Shaykh Shihab al-Din al-Suhrawardi in Baghdad (may Allah be pleased with him) affirmed the combination of witnessing and speech. However, nothing more than this was transmitted from him, for I asked the transmitter, and he did not mention the type of Theophany. We have a good opinion of the Shaykh, so he must have meant the formal Theophany (التجلي الصوري). Do you not see al-Sayyari, one of the men mentioned in al-Qushayri’s *Risala*, when he said: \"No rational person has ever found pleasure in witnessing?\" Then he explained: \"Because the witnessing of the Real (مشاهدة الحق) is annihilation (فناء), in which there is no pleasure.\"\n\nAnd address (الخطاب) is not valid in the state of annihilation, because the purpose of address is comprehension (أن يعقل). That is why He said: <<وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ>> (And it is not for any human being that Allah should speak to him except by revelation, or from behind a veil). The human being (البشر) does not cease from the ruling of humanity (حكم البشرية), as in the case of Moses’ request. The Veil (الحجاب) is the very form (عين الصورة) from which He calls him. The human being does not cease from his humanity, even if he is annihilated (فنى) from the witnessing of it. The essence of his existence (عين وجودها) does not vanish, and the boundary (الحد) accompanies it.\n\nWe only said this because I heard some shaykhs say: \"This is the lot of the human being. If he ceases from his humanity, his ruling becomes another ruling.\" I clarified to him (may Allah be pleased with him) that the matter is not as he supposed. When he verified what we mentioned, he retracted and said: \"I only thought the matter was as I stated. I did not pay attention to this.\" He spoke in explanation of the verse, but he erred because he did not speak from the tasting (ذوق) of the matter. Error occurs from this point.\n\nWe know that everything Allah has said is true, and that it does not contradict the tastings (الأذواق). Therefore, the speech of the one who tastes (الذائق) must conform to the Divine Reports (الاخبارات الإلهية), even if someone who lacks knowledge of the station of men says: \"This speaker speaks only according to what came in the Quran or Sunnah; he took it from them and is merely interpreting them.\" But the possessor of tasting (صاحب الذوق) only says what he has tasted. It is impossible for him to contradict anything that came from Allah. However, the outsider (الأجنبي) who lacks tasting says this about the one who tastes. Indeed, a group of people on the Path (أهل الطريق) who lack tasting imagine this and say: \"So-and-so speaks only from what is contained in the Divine Reports; he has no material other than them.\" They deny tasting because they have not known it in themselves, even though they believe themselves to be on the same path.\n\nAnd so it is: the possessors of tastings (أصحاب الأذواق) are undoubtedly on one path, but among them are the clear-sighted (البصير), the blind (الأعمى), and the near-sighted (الأعشى). None of them speaks except according to what his state (حاله) grants him, not what the Path grants him, nor what the Path is in itself. Especially in spiritual journeying (السلوك المعنوي), the blindness of the hearts (عمى القلوب) is more severe than the blindness of the eyes. The blindness of the hearts intervenes between you and the Real (الحق), whereas the blindness of the eye, for one who has never seen, only intervenes between you and colors, nothing more.\n\nThis blindness is one of the Veils (الحجب), as are deafness (الصمم), sealing (القفل), covering (الكن), and film (الغشاوة). These are lesser in ruling than blindness, unless the film causes darkness, in which case there is no difference between it and blindness. If it moves beyond the limit of darkness to the limit of twilight (السدفة), the state of its possessor may be better than the state of the possessor of darkness or the blind person.\n\nSome of them said to Muhammad (peace and blessings be upon him): <<ومن بَيْنِنا وبَيْنِكَ حِجابٌ>> (And between us and you is a veil), which is the covering (الأكنة). <<فَاعْمَلْ إِنَّنا عامِلُونَ>> (So work; indeed, we are working)—meaning, work to remove that. It is possible that their saying <<إِنَّنا عامِلُونَ>> means they are working to remove that, concerning those whose sincerity is possible in their view. For they admitted that their hearts were in coverings (أكنة) regarding what he called them to. They did not deny his saying or reject it, unlike others who did not say this. I do not know what became of these people, for in my view, they are in the station of hope (مقام الرجاء). We know with certainty that the Messenger works to lift the veil from their eyes, without doubt, to the extent that he said, \"I shall increase beyond seventy.\" That is why the verse said: <<ووَيْلٌ لِلْمُشْرِكِينَ>> (And woe to the polytheists), and did not say, \"And woe to you.\" This indicates, by circumstantial evidence, that they are working to remove the veil and extract their hearts from the coverings. The coverings (الأكنة) multiplied due to the variety of reasons for their hesitation in accepting what came to them: some were veiled by envy (الحسد), others by ignorance (الجهل), and others by being occupied with what they considered more important at the time until they could free themselves. All of this is a veil.\n\nAmong the most astonishing things occurring in Existence (الوجود) is what I am about to say: When Allah speaks with Revelation (الوحي), it is like a chain on a smooth rock (سلسلة على صفوان), and the angels are struck senseless (تصعق الملائكة). The Messenger of Allah (peace and blessings be upon him), when Revelation descended upon him, was like a chain on a smooth rock, and he was struck senseless (يصعق). This was the most severe form of Revelation for him. Gabriel would bring it down upon his heart, and he would be annihilated (يفني) from the sensory world, groaning and covered, until the state passed from him. Revelation would descend upon him on a severely cold day, and his forehead would stream with sweat.\n\nMoses (peace and blessings be upon him) was spoken to by Allah directly (تكليما), without intermediaries (ارتفاع الوسائط), yet he was not struck senseless (ما صعق) nor did he cease from his senses. He spoke and was spoken to. This station is greater than the station of Revelation through the mediation of an Angel. Yet, this Angel (Gabriel) is struck senseless upon hearing the Speech, and this most honored of humans (Muhammad) is struck senseless when the Spirit (الروح) descends with the Revelation. But Moses was neither struck senseless nor did anything happen to him, despite the absence of intermediaries. The mountain, however, was struck senseless (صعق لذلك الجبل).\n\nKnow that all of this is due to the effects of the Veils (آثار الحجب). For the ruling belongs to the Veils wherever they manifest. Since Allah created them as veils, it is impossible for them not to veil; it is necessary. If they did not veil, they would not be veils. Allah created these Veils in two types: spiritual (معنوية) and material (مادية). He created the material ones in two types: dense (كثيفة) and subtle/transparent (لطيفة وشفافة). The **dense** are such that the sight perceives nothing but them. The **subtle** are such that the sight perceives what is in them and what is behind them. The **transparent** are such that the sight perceives what is behind them, and confusion (الالتباس) occurs when it perceives what is in them, as was said:\n\nThe glass was subtle, and the wine was subtle,\nSo they resembled each other, and the matter became confused.\nIt is as if there is wine but no cup,\nAnd as if there is a cup but no wine.\n\nAs for mirrors and polished bodies (الأجسام الصقيلة), the locus of the images in them is not perceived, nor is what is behind them perceived. Rather, the images absent from the eye of the perceiver are perceived *by means of* them, not *in* them. The visible images are a veil between the sight and the polished surface. These images are not called subtle or dense. Eyes witness them as dense, and their shapes change with the change in the shape of the polished surface. They ripple with its rippling and move with the movement of the one whose image they are, from outside, and settle with his stillness, unless the polished surface itself moves, like the rippling of water, in which case movement appears in the eye, even if the one whose image it is remains still. Thus, there are two movements for it: a movement from the movement of the one whose image it is, and a movement from the movement of the polished surface. There are only drawn Veils (حجب مسدلة) in Existence, and perceptions (الإدراكات) are related to the Veils, and they have an effect on the possessor of the eye that perceives them.\n\n[The Veils are Two: A Spiritual Veil and a Sensory Veil]\n\nThe greatest Veils (الحجب) are two: a **Spiritual Veil (حجاب معنوي)**, which is ignorance (الجهل), and a **Sensory Veil (حجاب حسي)**, which is *you* upon yourself.\n\nAs for the greatest Spiritual Veil, it is the saying of the Messenger of Allah (peace and blessings be upon him) when he was taken on the Night Journey (أسرى به) to a tree that had a bird’s nest. Gabriel sat in one nest, and the Messenger of Allah (peace and blessings be upon him) sat in the other. When they reached the lowest heaven, something like a cushion (الرفرف) of pearls and rubies descended toward them. This was a type of Theophany (تجلى الحق). He (peace be upon him) said: \"As for Gabriel, he fainted (غشي عليه) due to his knowledge of what descended toward them. As for the Messenger of Allah (peace and blessings be upon him), he remained in his state because he did not know what it was, so it had no power over him.\" When Gabriel informed him, upon recovering, that it was the Real (الحق), the Prophet (peace and blessings be upon him) said: \"Then I knew his superiority (فضله).\" Meaning, the superiority of Gabriel over me in knowledge. Thus, knowledge struck Gabriel senseless, while the lack of knowledge kept the Prophet (peace and blessings be upon him) in his state, despite the presence of vision for both persons. This is the greatest of the Spiritual Veils.\n\nAs for your being a veil upon yourself (كونك حجابا عليك), which is the densest of the Sensory Veils (أكثف الحجب الحسية), it is the saying of the poet:\n\nA secret appeared to you that was long concealed from you,\nAnd a morning dawned, of which you were the darkness.\nYou are the veil of the heart from the secret of its Unseen (غيبه),\nWere it not for you, its seal would not be impressed upon it.\nIf you are absent from it, it settles therein, and its tents are pitched\nUpon the shoulder of the protected Unveiling (الكشف المصون).\nAnd a discourse comes, whose hearing is never tiresome,\nIts prose and its verse are delightful to us.\n\nNothing was made a veil upon you except yourself.\n\nThen we return to our issue and say: As for Moses (peace be upon him), his search for fire for his family had completely absorbed him. This is what brought him out, as he was commanded to seek provision for his dependents. Prophets are the most demanding of themselves in fulfilling the commands of the Real. He had nothing in his soul except what he went out for. When he perceived his need—the fire that appeared to him from the tree on the right side of the Mount (جانِبِ الطُّورِ الْأَيْمَنِ)—the Real called him from the very essence of his need with words appropriate to the moment: <<إِنِّي أَنَا رَبُّكَ فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوادِ الْمُقَدَّسِ طُوىً وأَنَا اخْتَرْتُكَ فَاسْتَمِعْ لِما يُوحى‏>> (Indeed, I am your Lord, so remove your sandals. Indeed, you are in the sacred valley of Tuwa. And I have chosen you, so listen to what is revealed).\n\nHe did not say, \"Listen to what is revealed,\" *before* saying: <<إِنَّنِي أَنَا الله>> (Indeed, I am Allah). The first address established him through the call (النداء) because he went out intending to fetch fire or find guidance by the fire, as he said: <<سَآتِيكُمْ مِنْها بِخَبَرٍ>> (I will bring you from it some information)—meaning, someone to guide him to his need. He was expecting the call, having prepared his hearing and sight for seeing the fire and hearing whoever might guide him to it. When the call came with an appropriate command, he did not deny it and remained firm. When he knew that the Caller was his Lord, and his firmness was confirmed, and the call came from outside, not from within himself, he remained firm to fulfill the right of courtesy (الأدب) in listening.\n\nFor every type of Theophany (تجلي) has a ruling. The ruling of the call of this Theophany was preparation for hearing what it brought. Thus, he was neither struck senseless nor did he vanish from his witnessing (شهوده). It was a restricted address (خطاب مقيد) directed to a specific location, heard with permission, and a detailed address (خطاب تفصيلي). What keeps a person firm upon his senses and the witnessing of his sensible world is his heart (قلبه) managing his body. This Divine Mosaic Speech (الكلام الإلهي الموسوي) was not directed toward the heart. The heart here only received what came through his hearing and sight and his faculties, according to custom. Thus, the state did not transgress its ruling in Moses (peace be upon him).\n\nAs for the matter of Muhammad (peace and blessings be upon him), it was a descent upon the heart (نزول قلبي) and a comprehensive address (خطاب إجمالي), like a chain on a smooth rock. Pay attention to this simile. The heart became preoccupied with what descended upon it in order to receive it, so it was absent from managing his body. This was called fainting (غشية) and being struck senseless (صعقا).\n\nSimilarly, the Angels: the Prophet (peace and blessings be upon him) reported concerning the Angels regarding the onset of this state that when the Revelation spoken was like a chain on a smooth rock, and its descent was upon the hearts of the Angels, He said: <<حَتَّى إِذا فُزِّعَ عَنْ قُلُوبِهِمْ>> (Until, when fear is removed from their hearts). Then, when they recovered, he reported that they say: \"What did [He say]?\" And here he paused. Then He answers them, saying: \"Your Lord.\" And here he paused. Then they say: \"The Truth (الحق),\" in the accusative case, meaning, \"The Real said such-and-such.\" We know this, and He is the Exalted above this descent in this great descent, above this simile in this relation. According to the other aspect, they said: <<قالُوا ما ذا قالَ رَبُّكُمْ>> (They said, \"What did your Lord say?\"). And here he paused. Then some of them say to others: <<الْحَقَّ وهُوَ الْعَلِيُّ الْكَبِيرُ>> (The Truth, and He is the Most High, the Grand), which is from the saying of Allah, not the saying of the Angels.\n\nAccording to the first aspect, when they recovered and the comprehensive, likened address ceased, and the sudden shock passed, they said: \"What did [He say]?\" And He said to them: \"Your Lord.\" This is His saying: \"Your Lord said.\" They were not struck senseless at this saying, but remained firm and said: \"The Truth (الحق),\" meaning, \"Our Lord spoke the true saying,\" referring to what they understood from the Revelation, or His saying, \"Your Lord said,\" or both together, which is the correct view. This is the difference between the state of Moses (peace be upon him) and the state of Muhammad (peace and blessings be upon him) and the state of the Angels.\n\n[The Knowledge of the Real’s Self-Praise Through His Creation]\n\nKnow that among the knowledges (العلوم) in this Station (منزل) is:\nThe knowledge of the Real’s Self-Praise (ثناء الحق على نفسه) through His creation, and He is the one who praises Himself by His independence from His creation. Which of the two praises is more perfect and more rightful? And which of these two praises is the Real (الحق)? And what is the Reality (الحقيقة) of them? Or are both realities for two truths (حقين)? Or are they two truths, and do they have two realities?\n\nThe knowledge of the difference between Knowledge (العلم), Wisdom (الحكمة), and Expertise (الخبرة).\n\nThe knowledge of knowing what is in the world (العالم) by the divisions of their states.\n\nThe knowledge of representation (النيابة) in answering on behalf of Allah. This only belongs to a Messenger, a Prophet, or an heir (وارث) based on hearing a Divine Address (خطاب إلهي), not based on a Theophany (تجلي) or an address of state (خطاب حال).\n\nThe knowledge of Allah’s Knowledge (علم الله).\n\nThe knowledge of where Allah deposited His Knowledge in His creation among the worlds (العوالم). Did He deposit it in one, or in more than one?\n\nThe knowledge of what distinguishes the two grips (القبضتان) in the world of witnessing (عالم الشهادة), and what distinguishes them in the world of the Unseen (عالم الغيب).\n\nThe knowledge of the indication (الدلالة) concerning the scholars and the possessors of Divine Reports (أصحاب الأخبار الإلهية), so that we may know them and receive from them what they bring from Allah, thereby equaling them in that knowledge, desiring that our souls join their souls in form, even if the paths differ. The difference in paths has no effect on the form of knowledge. This is what encourages the great scholars (الأكابر من العلماء الأكابر) to disseminate knowledge, just as it encourages the learners to seek knowledge from the great scholars who know that they have more knowledge of Allah than they do. From this, the man said to the disciple: \"To see Abu Yazid once is better for you than to see Allah a thousand times,\" due to his superiority over him in the knowledge of Allah. For he knew that the manifestation of the Real (ظهور الحق) to His servants is according to their knowledge of Him. Thus, our vision of Allah through the knowledge of the scholars, if we benefit from it, is more perfect than our vision through our knowledge before benefiting from them.\n\nThe knowledge of the comprehensiveness of consideration (إحاطة الاعتبار) across all aspects, and that consideration does not specialize one state over another, nor one aspect over another, and that it is a general knowledge. It is a knowledge that provides guidance to the one who returns to Allah through servitude (العبودة).\n\nThe knowledge of the Divine Command and Prohibition (الأمر والنهي الإلهي) through assistance in worship (العبادة) and good deeds.\n\nThe knowledge of the sending of extraordinary blessings (النعم الخارقة), what is veiled from them, and what veils them.\n\nThe knowledge of the powers of the subjugated things (قوى المسخرات) in subjugation, and where their powers end in what they are subjugated for.\n\nThe knowledge of the unknown death (الموت المجهول) in the deceased, and by what it is known, as al-Qushayri recounted in his *Risala* about someone who died, and the washer looked at him and was perplexed, not knowing whether he was dead or not dead, though he was dead in reality. A similar thing happened to a companion of mine who served me; he died in my presence, and the washer doubted during his washing whether he was dead or not.\n\nThe knowledge of the effect of knowledge (أثر العلم) in the world. And the one who claims knowledge, yet what he knows does not affect him—this is a problematic issue that causes sensory confusion. For we have not seen anyone throw himself into the fire, despite knowing that it burns, except for two groups: one who takes it as a sacrifice (قربانا) and throws himself into it seeking burning as an offering; or one who knows that it will not burn him. Thus, we know that knowledge has an effect in the world.\n\nThe knowledge of the signs of blessings (آيات النعم), what they indicate, and what is due upon the one who sees them as a sign.\n\nThe knowledge of the powerful knowledge (العلم القوي) that removes all other knowledges found in the heart.\n\nThe knowledge of the lower (الأدنى) and the higher (الأعلى), and the reason that compels the seeker to seek the lower and abandon the higher, despite his knowledge of the rank of each.\n\nThe knowledge of the causes of recompense (أسباب الجزاء) in good and evil.\n\nThe knowledge of physical (الكياني) and Divine (الإلهي) distance and proximity.\n\nThe knowledge of the signs (الآيات) in the knowledge of proximity and distance that indicate Allah.\n\nThe knowledge of the agreement of conjecture (الظن) with knowledge, and by what the possessor of the Real knows that it is knowledge, not conjecture, when he previously believed it to be conjecture.\n\nThe knowledge of the state of the people of doubt (أهل الريب), which categories they belong to, and which Names (الأسماء) look upon them.\n\nThe knowledge of transference (الحوالة).\n\nThe knowledge of the states of the Highest Assembly (الملإ الأعلى) and their variation due to the variation of the incoming inspirations (الواردات) in their known station.\n\nThe knowledge of what is not attributed to Allah—meaning, not described by Him—whether it is a non-existent (عدمي) or an existent (وجودي) matter.\n\nThe knowledge of where the knowledgeable person doubts (يشك العالم) while he is not doubting, and why he appears in the form of a doubter.\n\nThe knowledge of what is asked about and what is not asked about.\n\nThe knowledge of that in which Allah gathers His servants, then separates them within the very essence of this gathering, so they are separated within it.\n\nThe knowledge of when someone who claims a matter is required to provide proof for his claim, if he claims something by which he intends to affect the states of the world.\n\nThe knowledge of the states that do not accept precedence or delay.\n\nThe knowledge of argumentation (الحجاج).\n\nThe knowledge of drawing near (التقريب), and to whom the proximity is—is it to an existent (كون) or to Allah? And is proximity to Allah valid or not, when He is closer to every human being than the jugular vein (حَبْلِ الْوَرِيدِ), as the Exalted said?\n\nThe knowledge of accidents (الأعراض).\n\nThe knowledge of separation and disavowal (الفرق والتبري) between spirits (الأرواح).\n\nThe knowledge of what is said upon seeing the indications (الدلالات).\n\nThe knowledge of the returned reward (الأجر المعاد) and the joining of a thing to its genus.\n\nThe knowledge of who knows what he says and what is said to him, and who does not know what he says and what is said to him concerning that.\n\nThe knowledge of the return of all matters to their bewilderment (حيرتها) and their turning back to Allah, both their good and their evil, and that evil is not attributed to Allah.\n\nThe knowledge of Divine Perception (الإدراك الإلهي).\n\nThe knowledge of what is not perceived among what is permissible to be perceived.\n\nThe knowledge of what prevents nocturnal emission (الاحتلام) through vision.\n\nThe knowledge of the preventions (الموانع).\n\nAnd Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "تین سو پچاسویں باب کا بیان، استفہام کے ظہور اور معانی کی آنکھوں سے پردہ اٹھانے کے مقام کی معرفت میں، اور یہ مقام الحضرة المحمدیۃ (الحضرة المحمدیۃ) میں سے اسم الرب (الرب) سے متعلق ہے۔\n\nجب روح اس کے وحی سے صعق (بے ہوش) ہو جائے،\nتو اس کے تاریکی کے ڈھانچے کا کیا حال ہو گا؟\nاللہ نے اس کے ارکان کو مضبوط کیا ہے،\nاور اسے اپنے پانی پر ایک فلک کی طرح چلایا ہے۔\nاور وہ ایسا سمندر نہیں جس کا کوئی ساحل ہو،\nاور اس کے اسماء کی انتہا کہاں ہے؟\nوہ کائنات کا باپ ہے، کاش تم اسے جانتے،\nاور اس کے بیٹوں کی آنکھ اسے دیکھتی۔\nتو نہ اس کے آنے پر خوش ہو،\nاور نہ اس کے میدان میں بیٹھو۔\nپاک ہے وہ جو ہماری اعیان (حقائق) کو مٹا دیتا ہے،\nجب ہم اس کی نعمتوں کا کفر کرتے ہیں۔\nاور تعجب ہے جب ہم ان کا کفر کرتے ہیں،\nحالانکہ میں اس کی نعمتوں کی عین (حقیقت) میں سے ہوں۔\n\n### [بے شک اللہ ہمیشہ عالم کو دیکھتا ہے]\n\nجان لو، اللہ ہماری اور تمہاری مدد فرمائے، کہ یہ مقام روکنے والے حجابات (حجب) اور دفع کرنے والے آلات کا مقام ہے۔ ان میں سے کچھ عنایت کے حجابات ہیں، جیسے نبی اکرم صلی اللہ علیہ وسلم کا یہ فرمان: \"بے شک اللہ کے ستر ہزار حجابات ہیں یا ستر حجابات ہیں (شک مجھ سے ہے) جو نور اور ظلمت کے ہیں۔ اور اگر وہ انہیں کھول دے تو اس کے چہرے کے انوار (سبحات وجہ) اس کی مخلوق میں سے ہر اس چیز کو جلا ڈالیں جسے اس کی نگاہ نے پایا ہے۔\"\n\nاور یہاں ایک لطیف نکتہ اور اشارہ ہے کہ یہاں \"بصر\" (نگاہ) سے مراد مخلوق کی نگاہ ہے جسے حق (الحق) نے اس کی نگاہ بنایا ہے، اور یہی وہ ہے جو ان حجابات کو قبول کرنے والا ہے، اور یہی وہ ہے جسے اس صفت سے موصوف کیا گیا ہے کہ حق اس کی نگاہ ہے۔ اور یہی سبحات وجہ (سبحات الوجه) کی عین (حقیقت) ہے۔ بے شک اللہ ہمیشہ سے عالم کو دیکھتا رہا ہے اور اس کی رؤیت نے عالم کو نہیں جلایا۔ اور ان میں سے کچھ حجابات غیر عنایت کے ہیں، جیسے اللہ تعالیٰ کا فرمان:\n**كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ** (ہرگز نہیں! بے شک وہ اس دن اپنے رب سے ضرور اوجھل رکھے جائیں گے)۔\n\n### [بے شک حجابات کئی اقسام کے ہیں، اکوان کے درمیان کیانی حجابات]\n\nجان لو کہ حجابات کئی اقسام کے ہیں۔ اکوان (الأکوان) کے درمیان کیانی حجابات (حجب کیانیۃ) ہیں، جیسے اللہ تعالیٰ کا فرمان:\n**فَسْئَلُوهُنَّ من وَراءِ حِجابٍ** (تو ان سے پردے کے پیچھے سے سوال کرو)۔\nاور ان میں وہ حجابات ہیں جن کے ذریعے مخلوق نے اللہ سے پردہ کیا، جیسے اس کا فرمان:\n**وقالُوا قُلُوبُنا في أَكِنَّةٍ** (اور انہوں نے کہا کہ ہمارے دل پردوں میں ہیں)۔\nاور ان میں وہ حجابات ہیں جن کے ذریعے اللہ نے اپنی مخلوق سے پردہ کیا، جیسے نبی اکرم صلی اللہ علیہ وسلم کا فرمان: \"بے شک اللہ قیامت کے دن اپنے بندوں کے لیے ظہور الٰہی (التجلی) فرمائے گا، اس کے اور ان کے درمیان اس کے چہرے پر رداءِ کبریائی کے سوا کچھ نہ ہو گا،\" اور ایک روایت میں ہے: \"اس کے اور اس کی مخلوق کے درمیان تین حجابات ہوں گے،\" یا جیسا کہ آپ صلی اللہ علیہ وسلم نے فرمایا۔\nاور ان میں سے یہ بھی ہے:\n**وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ** (اور کسی بشر کے لیے یہ ممکن نہیں کہ اللہ اس سے کلام کرے مگر وحی کے ذریعے یا پردے کے پیچھے سے)۔\nجیسا کہ اس نے موسیٰ علیہ السلام سے آگ اور درخت کے حجاب سے، وادی ایمن کے کنارے سے، طور کے دائیں جانب سے، اور برکت والی جگہ سے کلام کیا۔ اور جیسا کہ اس نے فرمایا:\n**فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله** (تو اسے پناہ دے یہاں تک کہ وہ اللہ کا کلام سن لے)۔\nتو اللہ نے پناہ مانگنے والے سے محمد صلی اللہ علیہ وسلم کے حجاب کے پیچھے سے کلام کیا، کیونکہ آپ صلی اللہ علیہ وسلم ہی عین حجاب تھے، اس لیے کہ مشرکین میں سے پناہ مانگنے والے نے آپ صلی اللہ علیہ وسلم کے ذریعے اللہ کا کلام سنا۔ پس ہمیں کوئی شک نہیں کہ اللہ نے رسول اللہ صلی اللہ علیہ وسلم کی زبان پر ہم سے کلام کیا، اور اسی طرح اس نے ہم سے نمازی کے حجاب کے پیچھے سے بھی کلام کیا جب وہ کہتا ہے: \"سمع اللہ لمن حمدہ\" (اللہ نے اس کی سن لی جس نے اس کی تعریف کی)۔ پس عالم کی تمام زبانیں اللہ کے اقوال ہیں، اور ان کی تقسیم اللہ کے لیے ہے، وہ ان میں سے جسے چاہتا ہے اپنی طرف منسوب کرتا ہے اور جسے چاہتا ہے چھوڑ دیتا ہے۔\n\nجہاں تک اکوان (الأکوان) کے درمیان کیانی حجابات (حجب کیانیۃ) کا تعلق ہے، ان میں سے کچھ ڈھالیں اور بچاؤ ہیں، اور کچھ عزت اور حفاظتیں ہیں، جیسے بادشاہوں کا پردہ کرنا اور غیرت کا حجاب اس شخص پر جس پر غیرت کی جاتی ہے، جیسا کہ پردہ نشین عورتوں کے بارے میں فرمایا گیا ہے، اور وہ پردہ کرنے والیاں ہیں۔ اور اسی میں سے ہے:\n**حُورٌ مَقْصُوراتٌ في الْخِيامِ** (خیموں میں محدود حوریں)۔\nجہاں تک بچاؤ اور ڈھالوں کا تعلق ہے، ان میں وہ حجابات شامل ہیں جو حیوانی اجسام کو شدید سردی اور سخت گرمی سے بچاتے ہیں، جس سے وہ اپنے آپ سے تکلیف کو دور کرتے ہیں۔ اسی طرح جنگ میں لڑنے والا اپنے آپ کو دشمنوں کے تیروں، نیزوں اور تلواروں سے ڈھالوں کے ذریعے بچاتا ہے، اور وہ اپنے اور دشمن کے درمیان حائل ڈھال سے اپنا بچاؤ کرتا ہے، اور خود، ڈھال اور زرہ کے ذریعے اپنے آپ سے اذیت کو دور کرتا ہے۔\nکبھی یہ حجابات معنوی (معنویۃ) بھی ہوتے ہیں، جن کے ذریعے کوئی شخص اس شخص سے اذیت کو دور کرتا ہے جس پر وہ کرم کرتا ہے۔ مثال کے طور پر، ایک شخص دوسرے شخص کے حق میں کوئی ایسا کام کرتا ہے جو اسے ناپسند ہو کیونکہ وہ اس کی طبیعت کے مطابق نہیں یا اس کے مقصد کے موافق نہیں، تو اس پر اس فعل کی وجہ سے ملامت آتی ہے۔ تو ایک تیسرا شخص کھڑا ہوتا ہے اور خود کو اس کے لیے ڈھال بنا لیتا ہے، یہاں تک کہ وہ خود اس ملامت کے تیروں کو اپنے اوپر لیتا ہے، اور ملامت کرنے والے کے دل میں یہ بات بٹھا دیتا ہے کہ وہی اس کا سبب ہے اور یہ ساری اذیت اسی کی طرف سے تھی، یہاں تک کہ ملامت کرنے والے کو یقین ہو جاتا ہے کہ یہ معاملہ اسی شخص کی طرف سے تھا، جس طریقے سے بھی وہ اس تک پہنچا سکتا ہے۔ پس وہ ملامت اس پر ڈال دیتا ہے، اور وہ اس شخص کے درمیان حائل ہو جاتا ہے جس کی طرف سے وہ اذیت آئی تھی، اس طرح اس نے اپنی جان سے اس کی عزت کی حفاظت کی۔\nاسی طرح ہم بھی ان برے افعال کو جو اغراض کے موافق نہیں اور طبیعت کے مطابق نہیں، اپنی طرف منسوب کرتے ہیں، حالانکہ ہم جانتے ہیں کہ سب کچھ اللہ کی طرف سے ہے۔ لیکن جب ملامت کی زبان اس سے متعلق ہوئی، تو ہم نے اپنی جانوں سے اس چیز کا فدیہ دیا جو حق (الحق) کی طرف منسوب ہو سکتی تھی، یہ اللہ کے ساتھ ادب ہے۔ اور جو کچھ خیر اور حسن تھا، ہم نے اپنی جانوں کو راستے سے ہٹا لیا اور اسے اللہ کی طرف منسوب کر دیا، تاکہ وہی محمود ہو، یہ اللہ کے ساتھ ادب بھی ہے اور حقیقت بھی۔\nبے شک یہ سب اللہ ہی کے لیے ہے، اس میں کوئی شک نہیں، اگرچہ اس میں الٰہی خبر کے ذریعے اشتراک کی بو آتی ہے، جیسا کہ اس کے فرمان میں ہے:\n**والله خَلَقَكُمْ وما تَعْمَلُونَ** (اور اللہ نے تمہیں اور تمہارے اعمال کو پیدا کیا)۔\nاور اس کا فرمان:\n**ما أَصابَكَ من حَسَنَةٍ فَمِنَ الله وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ** (تجھے جو بھی بھلائی پہنچتی ہے وہ اللہ کی طرف سے ہے، اور تجھے جو بھی برائی پہنچتی ہے وہ تیرے نفس کی طرف سے ہے)۔\nاور فرمایا:\n**قُلْ كُلٌّ من عِنْدِ الله** (کہہ دو کہ سب کچھ اللہ کی طرف سے ہے)۔\nپس اس نے عمل کو کبھی ہماری طرف منسوب کیا اور کبھی اپنی طرف، اسی لیے ہم نے کہا کہ اس میں اشتراک کی بو ہے۔ اللہ تعالیٰ نے فرمایا:\n**لَها ما كَسَبَتْ وعَلَيْها ما اكْتَسَبَتْ** (اس کے لیے ہے جو اس نے کمایا اور اس پر ہے جو اس نے حاصل کیا)۔\nپس اس نے سب کچھ ہماری طرف منسوب کیا۔ اور فرمایا:\n**فَأَلْهَمَها فُجُورَها وتَقْواها** (پھر اسے اس کی بدکاری اور پرہیزگاری کا الہام کیا)۔\nپس ہم میں الہام اس کا ہے اور ہمارا کام اس پر عمل کرنا ہے جس کا الہام کیا گیا۔ اور فرمایا:\n**كُلًّا نُمِدُّ هؤُلاءِ وهَؤُلاءِ من عَطاءِ رَبِّكَ** (ہم ان سب کو اور ان سب کو تیرے رب کے عطیے سے مدد دیتے ہیں)۔\nپس اس کا عطیہ الہام بھی ہو سکتا ہے اور عمل کی تخلیق بھی۔\nیہ ایک ایسا مسئلہ ہے جس میں توحید (التوحید) مکمل طور پر حاصل نہیں ہوتی، نہ کشف (الکشف) کی جہت سے اور نہ خبر کی جہت سے۔ اس میں صحیح بات یہ ہے کہ یہ حق (الحق) اور خلق کے درمیان مربوط ہے، اور کسی ایک جانب کے لیے خالص نہیں ہے۔ کیونکہ اعلیٰ ترین الٰہی نسبت یہ ہے کہ حق تعالیٰ عین الوجود (عین الوجود) ہے جسے ممکنات نے حاصل کیا ہے۔ پس وہاں عین حق (عین الحق) کی ہستی کے سوا کچھ نہیں، اور اس عین میں ظاہر ہونے والی تبدیلیاں ممکنات کے اعیان (الأعیان) کے احکام ہیں۔ اگر عین نہ ہوتی تو حکم ظاہر نہ ہوتا، اور اگر ممکن نہ ہوتا تو تبدیلی ظاہر نہ ہوتی۔ پس افعال میں حق اور خلق دونوں کا ہونا ضروری ہے۔\nبعض عوام کا مذہب یہ ہے کہ بندہ اللہ کے افعال کے ظہور کا محل اور ان کے جاری ہونے کی جگہ ہے، پس حواس انہیں اکوان (الأکوان) کے سوا کسی سے نہیں دیکھتے، اور ان کی بصیرت انہیں اللہ کے سوا کسی سے نہیں دیکھتی، پردے کے پیچھے سے۔ یہ وہ شخص ہے جس کے ہاتھوں پر یہ افعال ظاہر ہوئے، جو ان کا ارادہ کرنے والا اور ان میں اختیار رکھنے والا ہے، پس وہ اپنے اختیار سے انہیں کسب کرنے والا ہے۔ یہ اشاعرہ کا مذہب ہے۔\nاور بعض عوام کا مذہب یہ بھی ہے کہ فعل حقیقت میں بندے کا ہے، اس کے باوجود ان کے نزدیک فعل کا حق اور خلق کے درمیان ربط زائل نہیں ہوتا، کیونکہ یہ لوگ بھی کہتے ہیں کہ بندے میں جو حادث قدرت ہوتی ہے جس سے یہ فعل فاعل کی طرف سے ہوتا ہے، اللہ نے اس کے لیے اس پر قدرت پیدا کی ہے۔ پس فعل بندے کے لیے خالص نہیں ہوتا مگر اس قدرت کے ذریعے جو اللہ نے اس میں پیدا کی، پس اشتراک زائل نہیں ہوا۔ یہ معتزلہ کا مذہب ہے۔\nپس یہ تین قسمیں ہیں: ہمارے اصحاب، اشاعرہ، اور معتزلہ، ان میں سے اشتراک کا وقوع زائل نہیں ہوا۔\nاسی طرح علل (اسباب) کو ثابت کرنے والوں کا حکم بھی ہے، ان کے لیے معلول (نتیجہ) کو اس کی علت کی طرف منسوب کرنا خالص نہیں ہوتا، جو خود اپنے اوپر کی کسی دوسری علت کا معلول ہے، یہاں تک کہ وہ اس واجب الوجود لذاتہ حق (الحق) تک پہنچ جائیں، جو ان کے نزدیک علۃ العلل (اسباب کا سبب) ہے۔ اگر علۃ العلل نہ ہوتی تو کسی علت سے کوئی معلول نہ ہوتا، کیونکہ علۃ العلل سے نیچے کی ہر علت معلول ہے۔ پس ان کے مذہب پر بھی اشتراک ختم نہیں ہوا۔\nجہاں تک ان اقسام کے علاوہ طبعی اور دہریوں کا تعلق ہے، تو ان کے معاملے کا انجام یہ ہے کہ جسے ہم الٰہ کہتے ہیں، دہری اسے دہر (زمانہ) کہتے ہیں، اور طبعی اسے طبیعت کہتے ہیں۔ اور وہ ہم سے ظاہر ہونے والے فعل کو خالص نہیں کرتے جب تک کہ اسے طبیعت کی طرف یا اصحاب دہر اسے دہر کی طرف منسوب نہ کریں۔ پس ہر فرقے اور ملت میں اشتراک کا وجود زائل نہیں ہوا۔\nاور کوئی عقل ایسی نہیں جو اس کے خلاف پر دلالت کرے، اور نہ ہی کسی شریعت میں کوئی الٰہی خبر ہے جو فعل کو تمام جہات سے کسی ایک جانب کے لیے خالص کر دے۔ پس ہم اسے اسی طرح برقرار رکھیں گے جس طرح اللہ نے اسے اپنے علم میں برقرار رکھا ہے۔ اور وہاں کشف (الکشف)، شریعت اور عقل کے سوا کچھ نہیں، اور ان تینوں نے کسی چیز کو خالص نہیں کیا اور نہ ہی کبھی خالص کریں گے، دنیا میں بھی نہیں اور آخرت میں بھی نہیں، **جَزَاءً بِمَا كُنْتُمْ تَعْمَلُونَ** (اس کا بدلہ جو تم کرتے تھے)۔\nپس معاملہ اپنی ذات میں، اور اللہ بہتر جانتا ہے، صرف اسی طرح واقع ہوا ہے، اس میں کوئی تخصیص واقع نہیں ہوتی، کیونکہ یہ اپنی ذات میں غیر مخلص (غیر خالص) ہے۔ اگر یہ اپنی ذات میں خالص ہوتا تو لازمی تھا کہ ان میں سے بعض گروہوں پر ظاہر ہوتا، اور ہمارے لیے یہ کہنا ممکن نہیں کہ سب غلطی پر ہیں، کیونکہ ان سب میں الٰہی شریعتیں موجود ہیں، اور ان کی طرف غلطی کی نسبت کرنا محال ہے۔ اور اللہ کے سوا کوئی نہیں جو چیزوں کے بارے میں خبر دے جیسا کہ وہ ہیں۔ اور اس نے خبر دی ہے، پس معاملہ وہی ہے جیسا اس نے خبر دی، کیونکہ سب کا مرجع اسی کی طرف ہے۔ پس جو خالص ہے وہ خالص ہے، اور جو خالص نہیں ہے وہ اپنی ذات میں خالص نہیں ہے۔ بے شک اللہ **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔\nپس حق (الحق) اور تمام عالم اس مسئلے میں اشتراک پر متفق ہیں، اور یہی شرک خفی (الشرک الخفی) اور جلی (الجلی) ہے، اور حیرت کا مقام ہے، پس کوئی ترجیح نہیں دی جا سکتی۔ پس وہاں وہی ہے جو ہم نے کہا۔\nجب ہم نے اس مسئلے میں جو کچھ طے کرنا تھا وہ طے کر لیا، تو اب ہم کہتے ہیں:\n\n### [الٰہی جود اور الٰہی غیرت]\n\nبے شک الٰہی جود (الجود الإلهی) اور الٰہی غیرت (الغیرة الإلهیۃ) نے یہ تقاضا کیا کہ وہ وہ بات کہیں جو ہم ان شاء اللہ بیان کریں گے۔\nاس کی وجہ یہ ہے کہ اس معاملے میں بات کرنے والے دو قسموں پر ہیں:\nپہلی قسم نے تمام افعال کو اکوان (الأکوان) کی طرف منسوب کیا، تو الٰہی غیرت کی زبان نے کہا:\n**كُلٌّ من عِنْدِ الله فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً** (سب کچھ اللہ کی طرف سے ہے، تو ان لوگوں کو کیا ہو گیا ہے کہ وہ کوئی بات سمجھنے کے قریب بھی نہیں آتے؟) یعنی کوئی حادث (نئی) بات۔\nجہاں تک دوسری قسم کا تعلق ہے، انہوں نے تمام اچھے افعال کو اللہ کی طرف منسوب کیا اور برے افعال کو اکوان کی طرف، تو الٰہی جود کی زبان نے کہا:\n**قُلْ كُلٌّ من عِنْدِ الله** (کہہ دو کہ سب کچھ اللہ کی طرف سے ہے)۔\nیہ انہیں جھٹلانے کے لیے نہیں، بلکہ ایک خوبصورت تعریف ہے۔\nاور وہاں کوئی ایسا نہیں جس نے کہا ہو کہ تمام افعال اللہ کے لیے ہیں یا اکوان کے لیے ہیں، بغیر کسی اشتراک کی بو کے۔ اسی لیے ہم نے انہیں طبعی اور دہریوں کی وجہ سے دو قسموں میں محدود کر دیا۔\nجہاں تک عنایت کے حجابات (حجب العنایۃ) کا تعلق ہے، جو مخلوق پر جل جانے کے خوف سے شفقت کے حجابات ہیں، یہ وہ حجابات ہیں جو سبحات وجہ (سبحات الوجه) کو اس چیز کو جلانے سے روکتے ہیں جسے نگاہ نے مخلوق میں سے پایا ہے۔\nاس کی وجہ یہ ہے کہ اللہ نے مخلوق میں دعوے رکھ دیے ہیں، کیونکہ جب ان کے اعیان (حقائق) عدم کے بعد وجود (الوجود) سے متصف ہوئے، اور وہ وجود مرجح (ترجیح دینے والے) کی ترجیح سے تھا جو واجب الوجود لذاتہ ہے، تو کسی نے اس کا انکار نہیں کیا، اگرچہ اس کے لیے تعبیرات بدل گئیں، جیسے طبیعت، دہر، اور علت وغیرہ، لیکن وہ وہی ہے، کوئی اور نہیں۔ پس انہوں نے دیکھا کہ اگرچہ وجود انہیں مستفاد (حاصل شدہ) ہے، لیکن حقیقت میں وہ ان ہی کا ہے، اور ان کے اعیان ہی اس مستفاد وجود کے ساتھ موجود ہیں۔\nاور یہی وہ اعیان حجابات ہیں جو اللہ اور اس کی مخلوق کے درمیان ہیں۔ اگر وہ انہیں عام طور پر کھول دیتا، جیسا کہ اس نے خاص طور پر اپنے بعض بندوں کے لیے کھولا، تو اس کی ذات کے انوار، جنہیں سبحات وجہ (سبحات الوجه) سے تعبیر کیا جاتا ہے، موجودات کے اعیان میں سے ہر اس چیز کو جلا ڈالتے جسے اس کی نگاہ نے پایا۔ یعنی اس کی نگاہ موجودات میں وجود حق (وجود الحق) کے سوا کچھ نہ پاتی، اور وہ سب کچھ ختم ہو جاتا جسے دعووں نے طے کیا تھا، اور یہ واضح ہو جاتا کہ وہ حق (الحق) ہے اور کوئی نہیں۔ پس اس نے اس زوال کو \"جلانے\" سے تعبیر کیا، کیونکہ اس نے انہیں انوار بنایا ہے، اور انوار میں جلانے کی خاصیت ہوتی ہے۔\nلیکن اللہ تعالیٰ نے دعووں کے حجابات کو باقی رکھا تاکہ اہل اللہ دوسروں سے ممتاز ہو جائیں۔ پس اہل اللہ کے نزدیک ممکنات (الممکنات) اپنے اعیان کی حیثیت سے عدم سے موصوف ہیں، اور اپنے احکام کی حیثیت سے وہ ہمیشہ وجود سے موصوف ہیں، اور وہ وجود حق (الحق) ہے۔ جیسا کہ اس نے صحیح خبر میں فرمایا:\n**كنت سمعه وبصره** (میں اس کا کان اور اس کی آنکھ بن جاتا ہوں)۔\nپس اس نے بندے کے لیے عین (حقیقت) کو ثابت کیا اور اپنی ذات کو اس کی صفت کی عین بنا دیا، جو اس کے وجود کی عین ہے، جو بندے کی صفت کی عین ہے۔ پس ممکن کی عین ثابت ہے مگر موجود نہیں، اور صفت موجود ہے اور ثابت ہے، اور وہ ایک ہی عین ہے، اگرچہ اپنی نسبتوں کی وجہ سے کثیر ہو جائے، کیونکہ وہ نسبتوں میں کثیر ہے۔ پس وہ سمع (سننا) اور بصر (دیکھنا) ہے، اور ان دونوں کے علاوہ عالم کی تمام قوتیں ہیں، جیسے فرشتہ، بشر، جن، معدنیات، نباتات، حیوانات، مکان، زمان، محل، معقول اور محسوس۔ اور وہاں اس کے سوا کچھ نہیں۔\nاور جب اللہ نے دعویٰ کرنے والوں کے دعووں کو ان کے اور اس حقیقت کے درمیان حجابات (حجب) بھیج کر برقرار رکھا جو معاملہ ہے، اور انہیں ان حجابات میں مشغول کر دیا جو افعال میں ان کے اور اس کے درمیان ہیں، اور سب کو سب سے ٹکرا دیا، تو وہ اپنی خاص مخلوق کے ساتھ منفرد ہو گیا اور انہیں اپنے پاس شہود (الشہود) کے ذریعے اپنا ہم نشین بنا لیا، اور ان کی محسوس صورتوں میں ذکر (الذکر) کے ذریعے (وہ ان کا ہم نشین ہے)۔ پس وہ ذاکرین کا ہم نشین ہے، اور یہ آخری گروہ ہے، ان کے بعد کوئی ایسا نہیں جس کی کوئی قابل ذکر صفت ہو۔\nاللہ تعالیٰ نے جب ان کی صفت بیان کی تو فرمایا:\n**ذُكْراناً وإِناثاً والذَّاكِرِينَ الله كَثِيراً والذَّاكِرَاتِ** (مردوں اور عورتوں کو، اور اللہ کا کثرت سے ذکر کرنے والے مردوں اور ذکر کرنے والی عورتوں کو)۔\nپس اس نے اپنے ہم نشینوں پر ختم کیا، اور ان ہم نشینوں کے بعد کوئی ایسی صفت قبول کرنے والا نہیں جو اس ہم نشینی سے دوری کی صفت ہو۔\nکیا تم نے ابو یزید (رحمۃ اللہ علیہ) کو نہیں دیکھا، جب وہ اسماء الٰہیہ اور ان کے حقائق کے مستحق کو نہ جان سکے، تو انہوں نے کیا کیا جب جمعہ کے دن قاری کو یہ آیت پڑھتے سنا:\n**يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً** (جس دن ہم پرہیزگاروں کو رحمن کی طرف مہمان بنا کر جمع کریں گے)۔\nان کی آنکھوں سے خون نکل آیا یہاں تک کہ انہوں نے منبر پر ہاتھ مارا اور آہ بھری اور کہا: یہ تعجب کی بات ہے، جو اس کا ہم نشین ہے اسے اس کی طرف کیسے جمع کیا جائے گا؟\nکیونکہ اس حالت میں وہ اسماء کے ساتھ ہم نشین تھے اس حیثیت سے کہ وہ ذات پر دلالت کرتے ہیں، ہر ایک اسم کے ساتھ اس حیثیت سے نہیں تھے کہ اس کی حقیقت ذات پر دلالت کی عین سے کیا تقاضا کرتی ہے۔ پس انہوں نے اس چیز کا انکار کیا جو ان کے مشاہدے نے انہیں نہیں دیا تھا، حالانکہ وہ حق کا کلام ہے۔ اور ان سے انکار واقع ہوا، بلکہ ان سے صرف تعجب ہی واقع ہوا، پس یہ انکار سے مشابہت رکھتا ہے مگر انکار نہیں ہے۔ یہاں تک کہ اگر یہ قول اللہ کے علاوہ کسی اور کا ہوتا تو وہ کہنے والے کو خاموش رہنے کا حکم دیتے اور اسے ڈانٹتے۔ لیکن اس شخص نے صرف اللہ کے اس قول پر تعجب کا اظہار کیا جو متقین کے حق میں ہے، جو اللہ کے ہم نشین ہیں، کہ انہیں اس کی طرف کیسے جمع کیا جائے گا؟\nپس گویا وہ احیائے موتی (مردوں کو زندہ کرنے) کی کیفیت طلب کرنے میں ابراہیمی مشہد (مشاہدہ) میں تھے، تو ابو یزید نے وہی چاہا جو ابراہیم نے احیائے موتی کی کیفیت میں چاہا تھا، اس میں وجوہ کے اختلاف کی وجہ سے، نہ کہ احیائے موتی کا انکار۔ پس ابو یزید کا یہ کلام اس وقت ان کے حال پر دلالت کرتا ہے۔\nیہ ابراہیم کے اس قول کی طرح ہے:\n**يا أَبَتِ إِنِّي أَخافُ أَنْ يَمَسَّكَ عَذابٌ من الرَّحْمنِ** (اے میرے باپ! مجھے ڈر ہے کہ تجھے رحمن کی طرف سے کوئی عذاب نہ پہنچے)۔\nاور رحمت عذاب کے منافی ہے، مگر اس طریقے پر جو ہم نے اس سے پہلے والے مقام میں طے کیا، جو \"فتح الأبواب\" کا مقام ہے۔\nاسی طرح ابو یزید اگر یہ جان لیتے کہ متقی رحمن کا ہم نشین نہیں ہے، بلکہ وہ جبار، مرید، عظیم، متکبر کا ہم نشین ہے، تو متقی کو رحمن کی طرف جمع کیا جائے گا تاکہ وہ اس کا ہم نشین ہو جائے اور اس سے اتقاء (پرہیزگاری) زائل ہو جائے، کیونکہ رحمن سے پرہیز نہیں کیا جاتا، بلکہ وہ طمع، ناز اور انس کا مقام ہے۔\nلیکن وہ (رضی اللہ عنہم) سچے ہیں، وہ ہر حال میں اپنے ذوق (ذوق) سے تجاوز نہیں کرتے، برخلاف اہل اللہ کے عوام کے، جو دوسروں کے احوال بیان کرتے ہیں۔ اور خواص کے لیے اس کا کوئی راستہ نہیں، اور اگر ان میں سے کوئی اپنے سے اوپر کے کسی نبی یا ولی کے حال میں بات کرے بھی، تو وہ واضح کر دیتا ہے کہ وہ کسی اور کے حال کا ترجمان ہے، تاکہ سننے والا جان لے کہ وہ کس کے بارے میں کہہ رہا ہے۔ یہ ان کے احوال ہیں (رضی اللہ عنہم)، اور ان سے ایسا شاذ و نادر ہی ہوتا ہے، جب کوئی ضرورت پیش آئے۔ کیونکہ انہیں اپنے سے اوپر کے مقامات کے بارے میں کشف خبری (الکشف الخبری) حاصل ہوتا ہے، لیکن کشف ذوقی (الکشف الذوقی) صرف ان کے اپنے مقام اور حال میں ہوتا ہے۔\nاگر یہ حجابات نہ ہوتے جو اللہ نے اکوان اور اپنے درمیان ڈال رکھے ہیں، تو مراتب ممتاز نہ ہوتے اور حقائق خلط ملط ہو جاتے۔ اور یہی چیزوں میں حدود مقرر کرنے کا سبب ہے۔ اور اللہ نے اس پر لعنت کی ہے جو زمین کی حد بندیوں کو بدلتا ہے۔\nاور اسی باب میں سے یہ ہے کہ اللہ نے کسی کے لیے بھی اس کے مشاہدے کے حال میں اس کے مشاہدے اور اس کے کلام کو جمع نہیں کیا۔ کیونکہ اس کا کوئی راستہ نہیں، مگر یہ کہ الٰہی ظہور (التجلی الإلهی) ایک مثالی صورت میں ہو، تب مشاہدہ اور کلام کو جمع کیا جا سکتا ہے، اور یہ ہمارے نزدیک ناقابل انکار ہے۔\nہمیں شیخ عارف شہاب الدین سہروردی (رضی اللہ عنہ) کے بارے میں بغداد میں یہ بات پہنچی ہے کہ انہوں نے مشاہدہ اور کلام کے جمع ہونے کا قول کیا، لیکن اس سے زیادہ کچھ نقل نہیں ہوا۔ کیونکہ میں نے نقل کرنے والے سے پوچھا تو اس نے مجھے ظہور (التجلی) کی نوعیت نہیں بتائی، اور شیخ کے بارے میں گمان اچھا ہے، لہٰذا لازمی ہے کہ ان کی مراد صوری ظہور (التجلی الصوری) ہو۔\nکیا تم نے قشیری کے رسالے کے رجال میں سے سیاری کو نہیں دیکھا، جب انہوں نے کہا: \"کسی عاقل نے کبھی مشاہدے سے لذت حاصل نہیں کی،\" پھر اس کی تفسیر کرتے ہوئے کہا: \"کیونکہ حق کا مشاہدہ فنا (الفناء) ہے، اس میں کوئی لذت نہیں، اور فنا کی حالت میں خطاب صحیح نہیں، کیونکہ خطاب کا فائدہ یہ ہے کہ عقل اسے سمجھے۔\"\nاسی لیے اس نے فرمایا:\n**وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ** (اور کسی بشر کے لیے یہ ممکن نہیں کہ اللہ اس سے کلام کرے مگر وحی کے ذریعے یا پردے کے پیچھے سے)۔\nاور بشر، بشریت کے حکم سے زائل نہیں ہوتا، جیسا کہ موسیٰ کا مسئلہ ہے، اور حجاب وہی صورت ہے جس سے اسے پکارا جاتا ہے۔ اور بشر اپنی بشریت سے زائل نہیں ہوتا، اگرچہ وہ اس کے شہود (الشہود) سے فنا ہو جائے، تو اس کے وجود کی عین (حقیقت) زائل نہیں ہوتی اور حد اس کے ساتھ رہتی ہے۔\nہم نے یہ اس لیے کہا کہ میں نے بعض شیوخ کو یہ کہتے سنا کہ یہ بشر کا حصہ ہے، اور جب وہ اپنی بشریت سے زائل ہو جاتا ہے تو اس کا حکم دوسرا ہو جاتا ہے۔ تو میں نے انہیں (رضی اللہ عنہ) واضح کیا کہ معاملہ ویسا نہیں جیسا وہ گمان کرتے ہیں۔ جب انہوں نے اس بات کی تصدیق کی جو ہم نے ذکر کی، تو وہ اس سے رجوع کر گئے اور کہا: \"میں تو یہی سمجھتا تھا کہ معاملہ وہی ہے جو میں نے کہا، میں نے اس طرف دھیان نہیں دیا تھا۔\" کیونکہ انہوں نے آیت کی شرح میں بات کی اور غلطی کی، انہوں نے اس معاملے کے ذوق (ذوق) سے بات نہیں کی۔ اور یہیں سے غلطی واقع ہوتی ہے۔\nاور ہم جانتے ہیں کہ جو کچھ اللہ نے کہا وہ سب حق ہے، اور وہ اذواق (ذوقی تجربات) کے خلاف نہیں ہے۔ پس ذوق رکھنے والے کا کلام الٰہی خبروں کے مطابق ہونا ضروری ہے، یہاں تک کہ وہ شخص جسے رجال کے مقام کی معرفت نہیں، یہ کہے کہ یہ متکلم اس چیز کے مطابق بات کرتا ہے جو قرآن یا سنت میں آئی ہے، اس نے صرف ان دونوں سے لیا ہے اور وہ ان کی تفسیر کر رہا ہے۔ اور صاحب ذوق نے وہی کہا جو اس نے چکھا (ذوق کیا)، پس یہ محال ہے کہ وہ اللہ کی طرف سے آئی ہوئی کسی چیز کے خلاف ہو۔ لیکن اجنبی، جسے ذوق نہیں، وہ ذوق رکھنے والے کے بارے میں یہ کہتا ہے۔ بلکہ اہل طریق میں سے ایک جماعت جنہیں ذوق نہیں، وہ ایسا ہی خیال کرتے ہیں اور کہتے ہیں کہ فلاں شخص الٰہی خبروں میں جو کچھ آیا ہے اسی کے مطابق بات کرتا ہے، اس کے پاس اس کے علاوہ کوئی مواد نہیں، اور وہ ذوق کا انکار کرتے ہیں کیونکہ انہوں نے اسے اپنے نفسوں میں نہیں پہچانا، حالانکہ وہ اپنے نفسوں میں یہ اعتقاد رکھتے ہیں کہ وہ ایک ہی راستے پر ہیں۔\nاور معاملہ ایسا ہی ہے، اصحاب اذواق (ذوق رکھنے والے) بلا شک ایک ہی راستے پر ہیں، مگر ان میں بصیر، اندھا اور کمزور نظر والا ہے۔ پس ان میں سے کوئی بھی وہی نہیں کہتا جو اسے راستہ نے دیا، اور نہ وہ جو راستہ اپنی ذات میں ہے، بلکہ وہی جو اس کے حال نے اسے دیا، خاص طور پر معنوی سلوک (السلوک المعنوی) میں۔ کیونکہ دلوں کا اندھا پن آنکھوں کے اندھے پن سے زیادہ شدید ہے، کیونکہ دلوں کا اندھا پن تمہارے اور حق (الحق) کے درمیان حائل ہوتا ہے، اور آنکھ کا اندھا پن، جس کے مالک نے کبھی نہیں دیکھا، صرف تمہارے اور رنگوں کے درمیان حائل ہوتا ہے، اس کے علاوہ کچھ نہیں۔\nاور یہ اندھا پن حجابات میں سے ہے۔ اسی طرح بہرا پن، قفل، پردہ اور غشاوت (پردہ) حکم میں اندھے پن سے کم ہیں، مگر یہ کہ غشاوت تاریکی پیدا کرے، تو پھر اس میں اور اندھے پن میں کوئی فرق نہیں۔ اور اگر وہ تاریکی کی حد سے نکل کر ہلکی روشنی کی حد تک پہنچ جائے، تو اس کے مالک کا حال تاریکی کے مالک اور اندھے کے حال سے بہتر ہو سکتا ہے۔\nبعض نے محمد صلی اللہ علیہ وسلم سے کہا:\n**ومِنْ بَيْنِنا وبَيْنِكَ حِجابٌ** (اور ہمارے اور آپ کے درمیان ایک پردہ ہے)۔\nاور وہ پردہ \"الأکنۃ\" (دلوں کے پردے) ہیں۔\n**فَاعْمَلْ إِنَّنا عامِلُونَ** (تو آپ عمل کریں، بے شک ہم بھی عمل کرنے والے ہیں)۔\nیعنی اس پردے کو اٹھانے میں عمل کریں۔ اور یہ بھی احتمال ہے کہ ان کا قول **إِنَّنا عامِلُونَ** (بے شک ہم بھی عمل کرنے والے ہیں) اس پردے کو اٹھانے میں ہو، ان کے حق میں جن کی سچائی ان کے نزدیک قابل قبول ہے۔ کیونکہ انہوں نے اعتراف کیا کہ ان کے دل اس چیز سے پردوں میں ہیں جس کی طرف آپ انہیں بلا رہے ہیں، پس انہوں نے آپ کے قول کا انکار نہیں کیا اور نہ اسے رد کیا، جیسا کہ دوسروں نے اعتقاد کیا جنہوں نے یہ نہیں کہا۔\nپس میں نہیں جانتا کہ ان کا انجام کیا ہوا، کیونکہ وہ میرے نزدیک رجاء (امید) کے مقام پر ہیں۔ کیونکہ ہم قطعی طور پر جانتے ہیں کہ رسول ان کی آنکھوں سے پردہ اٹھانے میں بلا شک عمل کرتے ہیں، یہاں تک کہ آپ نے فرمایا: \"میں ستر سے زیادہ کروں گا۔\" اور اسی لیے آیت میں فرمایا:\n**ووَيْلٌ لِلْمُشْرِكِينَ** (اور مشرکوں کے لیے ہلاکت ہے)۔\nاور یہ نہیں فرمایا: \"اور تمہارے لیے ہلاکت ہے۔\" پس یہ قرینہ حال سے دلالت کرتا ہے کہ وہ حجاب کو اٹھانے اور اپنے دلوں کو پردوں سے نکالنے میں عمل کرنے والے ہیں۔ اور پردوں کی کثرت ان کے قبول کرنے میں توقف کے اسباب کے اختلاف کی وجہ سے تھی جو آپ ان کے پاس لائے۔ پس ان میں سے کچھ حسد کی وجہ سے پردے میں تھے، اور دوسرے جہالت کی وجہ سے، اور تیسرے وقت کے اس کام میں مشغول ہونے کی وجہ سے جو ان کے نزدیک زیادہ اہم تھا، یہاں تک کہ وہ اس سے فارغ ہو جائیں، اور یہ سب حجاب ہے۔\nاور وجود (الوجود) میں واقع ہونے والی سب سے عجیب چیزوں میں سے وہ ہے جو میں کہتا ہوں، اور وہ یہ ہے کہ جب اللہ وحی کے ساتھ کلام کرتا ہے، تو گویا وہ کسی سخت پتھر پر زنجیر کی طرح ہے، تو فرشتے صعق (بے ہوش) ہو جاتے ہیں۔ اور رسول اللہ صلی اللہ علیہ وسلم پر جب وحی نازل ہوتی تھی، تو وہ کسی سخت پتھر پر زنجیر کی طرح ہوتی تھی، اور آپ صعق ہو جاتے تھے، اور یہ آپ پر سب سے شدید وحی ہوتی تھی۔ پس جبرائیل اسے آپ کے قلب پر نازل کرتے، تو آپ عالم حس (حسی دنیا) سے فنا (الفناء) ہو جاتے، اور آپ غرانے لگتے اور آپ کو چادر اوڑھا دی جاتی، یہاں تک کہ وہ کیفیت آپ سے دور ہو جاتی۔ اور آپ پر شدید سردی کے دن بھی وحی نازل ہوتی تو آپ کی پیشانی سے پسینہ بہنے لگتا۔\nاور موسیٰ علیہ السلام سے اللہ نے براہ راست کلام کیا، واسطوں کے اٹھ جانے کے باوجود، اور وہ نہ صعق ہوئے اور نہ اپنے حواس سے زائل ہوئے، اور انہوں نے کہا اور انہیں کہا گیا۔ اور یہ مقام فرشتے کے واسطے سے وحی کے مقام سے زیادہ عظیم ہے۔\nپس یہ فرشتہ کلام کے وقت صعق ہو جاتا ہے، اور یہ اکرم البشر (سب سے معزز بشر) روح کے وحی لے کر نازل ہونے پر صعق ہو جاتے ہیں، اور یہ موسیٰ ہیں جو واسطوں کے اٹھ جانے کے باوجود نہ صعق ہوئے اور نہ ان پر کچھ گزرا، اور اس پہاڑ پر صعق طاری ہو گیا۔\nپس جان لو کہ یہ سب حجابات (حجب) کے اثرات میں سے ہے، کیونکہ جہاں وہ ظاہر ہوتے ہیں، حکم انہی کا ہوتا ہے۔ جب اللہ نے انہیں حجاب کے طور پر پیدا کیا تو ان کے لیے حجاب کرنا ضروری تھا، اور اگر وہ حجاب نہ کرتے تو وہ حجاب نہ ہوتے۔\nاور اللہ نے ان حجابات کو دو قسموں پر پیدا کیا: معنوی (معنویۃ) اور مادی (مادیۃ)۔ اور مادی کو دو قسموں پر پیدا کیا: کثیف (گھنے)، لطیف (باریک) اور شفاف۔\nکثیف وہ ہیں جن کے سوا نگاہ کچھ نہیں دیکھتی۔ لطیف وہ ہیں جن میں اور جن کے پیچھے جو کچھ ہے، نگاہ اسے دیکھتی ہے۔ اور شفاف وہ ہیں جن کے پیچھے جو کچھ ہے نگاہ اسے دیکھتی ہے، اور جب وہ ان میں موجود چیز کو دیکھتی ہے تو اسے التباس (گڑبڑ) ہو جاتا ہے، جیسا کہ کہا گیا ہے:\n\nشیشہ بھی لطیف ہوا اور شراب بھی لطیف ہوئی،\nپس دونوں ایک جیسے ہو گئے اور معاملہ مشتبہ ہو گیا۔\nتو گویا شراب ہے مگر پیالہ نہیں،\nاور گویا پیالہ ہے مگر شراب نہیں۔\n\nجہاں تک آئینوں اور چمکدار اجسام کا تعلق ہے، تو نگاہ ان میں موجود صورتوں کی جگہ کو نہیں دیکھتی اور نہ ہی ان کے پیچھے جو کچھ ہے اسے دیکھتی ہے، بلکہ وہ ان صورتوں کو دیکھتی ہے جو دیکھنے والے کی آنکھ سے غائب ہیں، ان کے اندر نہیں۔ پس نظر آنے والی صورتیں نگاہ اور چمکدار چیز کے درمیان حجاب ہیں، اور یہ ایسی صورتیں ہیں جنہیں نہ لطیف کہا جا سکتا ہے اور نہ کثیف۔ اور نگاہیں انہیں کثیف دیکھتی ہیں، اور ان کی شکلیں چمکدار چیز کی شکل بدلنے سے بدل جاتی ہیں، اور اس کے لہرانے سے لہراتی ہیں، اور باہر سے جس کی صورت ہے اس کے حرکت کرنے سے حرکت کرتی ہیں، اور اس کے ساکن ہونے سے ساکن ہو جاتی ہیں، مگر یہ کہ چمکدار چیز حرکت کرے، جیسے پانی کا لہرانا، تو آنکھ میں اس میں حرکت ظاہر ہوتی ہے، اور جس کی صورت ہے وہ ساکن ہے۔ پس اس کے لیے دو حرکتیں ہیں: ایک اس کی حرکت جس کی وہ صورت ہے، اور دوسری چمکدار چیز کی حرکت سے۔\nپس وجود (الوجود) میں لٹکے ہوئے حجابات (حجب) کے سوا کچھ نہیں، اور ادراکات کا تعلق حجابات سے ہے، اور ان کا اثر انہیں ادراک کرنے والی آنکھ کے مالک پر ہوتا ہے۔\n\n### [حجاب دو ہیں: ایک معنوی حجاب اور ایک حسی حجاب]\n\nاور سب سے بڑے حجابات (حجب) دو ہیں: ایک معنوی حجاب (حجاب معنوی) اور وہ جہالت ہے، اور ایک حسی حجاب (حجاب حسی) اور وہ تمہارا اپنے اوپر حجاب ہونا ہے۔\nجہاں تک سب سے بڑے معنوی حجاب کا تعلق ہے، تو وہ رسول اللہ صلی اللہ علیہ وسلم کا یہ فرمان ہے جب آپ کو معراج کرائی گئی، ایک درخت میں جہاں پرندے کا گھونسلا تھا، تو جبرائیل ایک گھونسلے میں بیٹھے اور رسول اللہ صلی اللہ علیہ وسلم دوسرے میں۔ جب وہ آسمان دنیا پر پہنچے تو ان کی طرف موتیوں اور یاقوت کا ایک رفرف (پردہ) لٹکا، اور یہ حق (الحق) کے ظہور (التجلی) کی ایک قسم تھی۔ آپ صلی اللہ علیہ وسلم نے فرمایا: \"جہاں تک جبرائیل کا تعلق ہے، تو وہ بے ہوش ہو گئے، کیونکہ وہ جانتے تھے کہ ان کی طرف کیا لٹکا ہے، اور جہاں تک رسول اللہ صلی اللہ علیہ وسلم کا تعلق ہے، تو وہ اپنی حالت پر قائم رہے، کیونکہ وہ نہیں جانتے تھے کہ وہ کیا ہے، پس اس کا ان پر کوئی تسلط نہیں ہوا۔\" جب جبرائیل نے ہوش میں آنے پر انہیں بتایا کہ وہ حق (الحق) ہے، تو آپ صلی اللہ علیہ وسلم نے اس وقت فرمایا: \"تب میں نے ان کی فضیلت جانی،\" یعنی علم میں جبرائیل کی مجھ پر فضیلت۔ پس علم نے جبرائیل کو صعق کر دیا، اور علم کی عدم موجودگی نے نبی صلی اللہ علیہ وسلم کو اپنی حالت پر قائم رکھا، حالانکہ دونوں شخص دیکھ رہے تھے۔ پس یہ سب سے بڑا معنوی حجاب ہے۔\nجہاں تک تمہارا اپنے اوپر حجاب ہونا ہے، اور یہ سب سے گھنا حسی حجاب ہے، تو وہ شاعر کا قول ہے:\n\nتمہارے لیے وہ راز ظاہر ہو گیا جس کا چھپانا تم سے طویل رہا،\nاور وہ صبح نمودار ہوئی جس کی تاریکی تم خود تھے۔\nپس تم ہی قلب کے لیے اس کے غیب کے راز سے حجاب ہو،\nاور اگر تم نہ ہوتے تو اس پر مہر نہ لگائی جاتی۔\nجب تم اس سے غائب ہوتے ہو تو وہ اس میں اتر آتا ہے،\nاور کشف مصون (محفوظ کشف) کے کندھے پر اپنے خیمے گاڑ دیتا ہے۔\nاور ایک ایسی بات آتی ہے جسے سن کر دل نہیں بھرتا،\nجس کا نثر اور نظم ہمارے لیے لذیذ ہے۔\n\nپس تمہارے اوپر تمہارے سوا کسی کو حجاب نہیں بنایا گیا۔\nپھر ہم اپنے مسئلے کی طرف لوٹتے ہیں اور کہتے ہیں: جہاں تک موسیٰ علیہ السلام کا تعلق ہے، تو ان پر اپنے اہل و عیال کے لیے آگ کی تلاش غالب تھی، اور یہی وہ چیز تھی جس نے انہیں اس کام کے لیے نکالا جس کا انہیں عیال کی تلاش میں حکم دیا گیا تھا۔ اور انبیاء حق کے احکام کی تعمیل کے لیے اپنے نفسوں سے سب سے زیادہ مطالبہ کرنے والے ہوتے ہیں۔ پس ان کے نفس میں اس کے سوا کچھ نہ تھا جس کے لیے وہ نکلے تھے۔ جب انہوں نے اپنی ضرورت کو دیکھا، جو آگ تھی جو انہیں طور ایمن کے کنارے پر درخت سے نظر آئی، تو حق (الحق) نے انہیں ان کی ضرورت کی عین (حقیقت) سے اس چیز کے ساتھ پکارا جو وقت کے مناسب تھی:\n**إِنِّي أَنَا رَبُّكَ فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوادِ الْمُقَدَّسِ طُوىً وأَنَا اخْتَرْتُكَ فَاسْتَمِعْ لِما يُوحى‏** (بے شک میں ہی تیرا رب ہوں، پس اپنی جوتیاں اتار دے، بے شک تو طویٰ کی مقدس وادی میں ہے، اور میں نے تجھے چن لیا ہے، پس جو وحی کی جاتی ہے اسے سن)۔\nاور جب وحی کی گئی تو یہ نہیں فرمایا: **إِنَّنِي أَنَا الله** (بے شک میں ہی اللہ ہوں)۔\nپس پہلے خطاب نے انہیں پکار کے ذریعے ثابت قدم رکھا، کیونکہ وہ آگ لینے یا آگ کے پاس کوئی ہدایت پانے کے لیے نکلے تھے، اور یہ ان کا قول تھا: **سَآتِيكُمْ مِنْها بِخَبَرٍ** (میں تمہارے پاس وہاں سے کوئی خبر لاؤں گا) یعنی کوئی جو انہیں ان کی ضرورت کی طرف رہنمائی کرے۔ پس وہ پکار کے منتظر تھے، انہوں نے اپنے کان اور آنکھ کو آگ دیکھنے اور اس شخص کو سننے کے لیے تیار کر رکھا تھا جو انہیں رہنمائی کرے۔ پس جب مناسب حکم کے ساتھ پکار آئی تو انہوں نے اس کا انکار نہیں کیا اور ثابت قدم رہے۔ جب انہیں معلوم ہوا کہ پکارنے والا ان کا رب ہے، اور ان کا ثابت قدم رہنا صحیح ہو گیا، اور پکار باہر سے آئی تھی نہ کہ ان کے نفس سے، تو وہ ثابت قدم رہے تاکہ سننے میں ادب کا حق ادا کریں۔ کیونکہ ظہور الٰہی (التجلی) کی ہر قسم کا ایک حکم ہوتا ہے، اور اس ظہور کی پکار کا حکم یہ تھا کہ جو کچھ آنے والا ہے اسے سننے کے لیے تیار ہو جائیں۔ پس وہ نہ صعق ہوئے اور نہ اپنے شہود (الشہود) سے غائب ہوئے، کیونکہ یہ ایک جہت سے مقید خطاب تھا، جو اجازت سے سنا گیا، اور ایک تفصیلی خطاب تھا۔\nانسان کو اس کے حواس اور محسوسات کے شہود پر ثابت رکھنے والی چیز اس کا قلب ہے جو اس کے جسم کی تدبیر کرتا ہے۔ اور اس الٰہی موسوی کلام کا قلب پر کوئی توجہ نہیں تھا، پس قلب کے لیے یہاں وہی تھا جو اسے اس کے کان اور آنکھ اور اس کی قوتوں سے حسب عادت ملتا تھا۔ پس حال نے موسیٰ علیہ السلام میں اپنے حکم سے تجاوز نہیں کیا۔\nجہاں تک محمد صلی اللہ علیہ وسلم کے معاملے کا تعلق ہے، تو وہ قلبی نزول اور ایک اجمالی خطاب تھا، جو کسی سخت پتھر پر زنجیر کی طرح تھا۔ پس اس تشبیہ پر دھیان دو۔ پس قلب اس چیز میں مشغول ہو گیا جو اس پر نازل ہوئی تاکہ اسے وصول کرے، تو وہ اپنے بدن کی تدبیر سے غائب ہو گیا، پس اسے غشی اور صعق (بے ہوشی) کہا گیا۔\nاور اسی طرح فرشتوں کا حال بھی ہے۔ نبی صلی اللہ علیہ وسلم نے فرشتوں کے بارے میں اس حال کے طاری ہونے پر خبر دی کہ جب وہ وحی جس کے ساتھ کلام کیا گیا، کسی سخت پتھر پر زنجیر کی طرح تھی، اور اس کا نزول فرشتوں کے دلوں پر ہوا، تو آپ نے فرمایا:\n**حَتَّى إِذا فُزِّعَ عَنْ قُلُوبِهِمْ** (یہاں تک کہ جب ان کے دلوں سے گھبراہٹ دور کی جاتی ہے)۔\nپھر جب وہ ہوش میں آتے ہیں، تو آپ نے ان کے بارے میں خبر دی کہ وہ کہتے ہیں: \"ماذا؟\" (کیا کہا؟) اور یہاں وقف ہے۔ پھر وہ انہیں جواب دیتا ہے اور کہتا ہے: \"ربکم\" (تمہارے رب نے) اور یہاں وقف ہے۔ تو وہ کہتے ہیں: \"الحق\" (حق کو) نصب کے ساتھ، یعنی حق نے کہا۔ ہم نے اسے اسی طرح جانا، اور وہ اس نزول میں اس بڑے نزول سے، اس نسبت میں اس تشبیہ سے بلند ہے۔\nاور دوسرے طریقے پر: **قالُوا ما ذا قالَ رَبُّكُمْ** (انہوں نے کہا: تمہارے رب نے کیا کہا؟) اور یہاں وقف ہے۔ تو ان میں سے بعض بعض سے کہتے ہیں: **الْحَقَّ وهُوَ الْعَلِيُّ الْكَبِيرُ** (حق، اور وہ بلند و بالا ہے)۔ یہ اللہ کا قول ہے، فرشتوں کا قول نہیں۔\nپس پہلے طریقے پر، جب وہ ہوش میں آئے اور مشابہت والا اجمالی خطاب زائل ہو گیا اور بد یہی بات زائل ہو گئی، تو انہوں نے کہا: \"ماذا؟\" تو انہیں کہا گیا: \"ربکم\" (تمہارے رب نے) اور یہ اس کا قول ہے: \"قال ربکم\" (تمہارے رب نے کہا)۔ پس وہ اس قول پر صعق نہیں ہوئے، بلکہ ثابت قدم رہے اور کہا: \"الحق\" (حق کو)، یعنی حق نے کہا، یعنی ہمارے رب نے حق بات کہی، ان کا مطلب وہ تھا جو انہوں نے وحی سے سمجھا، یا اس کا قول: \"قال ربکم\"، یا دونوں، اور یہی صحیح ہے۔\nپس یہ موسیٰ علیہ السلام کے حال اور محمد صلی اللہ علیہ وسلم کے حال اور فرشتوں کے حال کے درمیان فرق ہے۔\n\n### [حق کا اپنی مخلوق کے ذریعے اپنی تعریف کا علم]\n\nجان لو کہ اس مقام میں جو علوم ہیں ان میں حق (الحق) کا اپنی مخلوق کے ذریعے اپنی تعریف کا علم ہے، اور وہ اپنی مخلوق سے بے نیازی کے ساتھ اپنی تعریف کرنے والا ہے۔ پس ان دونوں تعریفوں میں سے کون سی زیادہ کامل اور زیادہ حق ہے؟ اور ان دونوں تعریفوں میں سے حق کیا ہے اور ان میں سے حقیقت کیا ہے؟ یا کیا وہ دونوں دو حقائق کے لیے دو حقیقتیں ہیں، یا وہ دونوں دو حق ہیں اور ان کے لیے دو حقیقتیں ہیں؟\nاور اس میں علم، حکمت اور خبرت کے درمیان فرق کا علم ہے۔\nاور اس میں عالم میں موجود چیزوں کے احوال کی تقسیم کے علم کا علم ہے۔\nاور اس میں اللہ کی طرف سے جوابات میں نیابت کا علم ہے، اور یہ صرف رسول، نبی یا وارث کے لیے ہوتا ہے جو الٰہی خطاب کو سننے سے حاصل ہو، نہ کہ ظہور الٰہی (التجلی) یا حال کے خطاب سے۔\nاور اس میں اللہ کے علم کا علم ہے۔\nاور اس میں یہ علم ہے کہ اللہ نے اپنا علم اپنی مخلوق میں سے کن عوالم میں ودیعت کیا ہے، اور کیا اس نے اسے ایک میں ودیعت کیا ہے یا ایک سے زیادہ میں؟\nاور اس میں یہ علم ہے کہ عالم شہادت (دیکھی ہوئی دنیا) میں دو قبضے کس چیز سے ممتاز ہوتے ہیں، اور عالم غیب میں وہ کس چیز سے ممتاز ہوتے ہیں؟\nاور اس میں علماء اور الٰہی خبروں کے حاملین پر دلالت کا علم ہے تاکہ ہم انہیں پہچانیں اور ان سے وہ چیزیں حاصل کریں جو وہ اللہ کی طرف سے لاتے ہیں، تاکہ ہم علم میں ان کے برابر ہو جائیں، اس خواہش میں کہ ہماری جانیں صورت میں ان کی جانوں سے مل جائیں، اگرچہ راستے مختلف ہوں، کیونکہ علم کی صورت میں ان کے اختلاف کا کوئی اثر نہیں ہوتا۔\nاور یہی وہ چیز ہے جو بڑے علماء کو علم پھیلانے پر ابھارتی ہے، جیسا کہ متعلمین کو بڑے علماء سے علم طلب کرنے پر ابھارتی ہے، جن کے بارے میں وہ جانتے ہیں کہ وہ اللہ کے بارے میں ان سے زیادہ علم رکھتے ہیں۔ اور اسی میں سے ایک شخص نے شاگرد سے کہا: \"تمہارا ابو یزید کو ایک بار دیکھنا تمہارے لیے اللہ کو ہزار بار دیکھنے سے بہتر ہے،\" اللہ کے بارے میں علم میں ان کی فضیلت کی وجہ سے، جب اس نے جان لیا کہ حق کا اپنے بندوں کے لیے ظہور ان کے علم کے مطابق ہوتا ہے۔ پس ہمارا اللہ کو علماء کے علم کے ذریعے دیکھنا، جب ہم اسے ان سے حاصل کرتے ہیں، ہمارے اپنے علم کے ذریعے دیکھنے سے زیادہ کامل ہے اس سے پہلے کہ ہم اسے ان سے حاصل کریں۔\nاور اس میں جہات کے ساتھ اعتبار کے احاطے کا علم ہے، اور یہ کہ اعتبار کسی حال کو کسی حال سے یا کسی جہت کو کسی جہت سے خاص نہیں کرتا، اور یہ ایک عام علم ہے، اور یہ وہ علم ہے جو اس شخص کے لیے دلالت فراہم کرتا ہے جو عبودیت کے ساتھ اللہ کی طرف رجوع کرتا ہے۔\nاور اس میں عبادت اور نیک اعمال میں مدد کے ذریعے الٰہی امر اور نہی کا علم ہے۔\nاور اس میں خارق عادت نعمتوں کے بھیجنے کا علم ہے، اور ان میں سے کیا چیز حجاب بنتی ہے اور کیا چیز حجاب کرتی ہے؟\nاور اس میں مسخرات (مسخر کی گئی چیزوں) کی تسخیر میں قوتوں کا علم ہے، اور ان کی قوتیں اس چیز میں کہاں تک پہنچتی ہیں جس میں انہیں مسخر کیا گیا ہے؟\nاور اس میں میت میں نامعلوم موت کا علم ہے، اور اسے کس چیز سے پہچانا جاتا ہے، جیسا کہ قشیری نے اپنے رسالے میں بعض سے حکایت کی کہ ایک شخص مر گیا تو غسل دینے والے نے اسے دیکھا اور حیران رہ گیا، اسے معلوم نہ ہوا کہ وہ مردہ ہے یا نہیں، حالانکہ وہ حقیقت میں مردہ تھا۔ اور اسی طرح کا معاملہ میرے ایک خادم کے ساتھ پیش آیا جو میرے پاس فوت ہوا، تو غسل دینے والے کو غسل دیتے وقت شک ہوا کہ وہ مردہ ہے یا نہیں؟\nاور اس میں عالم میں علم کے اثر کا علم ہے، اور وہ شخص جس نے علم کا دعویٰ کیا اور جو وہ جانتا ہے اس نے اس پر اثر نہیں کیا، اور یہ ایک مشکل مسئلہ ہے جس میں حس اشکال پیدا کرتی ہے، کیونکہ ہم نے کسی کو نہیں دیکھا کہ وہ اپنے آپ کو آگ میں ڈال دے، اس علم کے باوجود کہ وہ اسے جلائے گی، سوائے دو گروہوں کے: ایک وہ جو اسے قربانی بناتے ہیں اور اس میں جلنے کی طلب میں اپنے آپ کو ڈال دیتے ہیں، یا وہ جو جانتے ہیں کہ وہ انہیں نہیں جلائے گی۔ پس ہم نے جان لیا کہ علم کا عالم میں اثر ہوتا ہے۔\nاور اس میں نعمتوں کی آیات کا علم ہے، اور وہ کس چیز پر دلالت کرتی ہیں، اور جو انہیں آیت کے طور پر دیکھتا ہے اس پر ان کا کیا حق ہے؟\nاور اس میں اس قوی علم کا علم ہے جو ان تمام علوم کو زائل کر دیتا ہے جو قلب میں پائے جاتے ہیں۔\nاور اس میں ادنیٰ اور اعلیٰ کا علم ہے، اور طالب کے لیے ادنیٰ کو طلب کرنے اور اعلیٰ کو چھوڑنے کا سبب کیا ہے، حالانکہ وہ ان دونوں میں سے ہر ایک کے مرتبے کو جانتا ہے؟\nاور اس میں خیر اور شر میں جزا کے اسباب کا علم ہے۔\nاور اس میں کیانی اور الٰہی قرب اور بعد کا علم ہے۔\nاور اس میں قرب اور بعد کے علم میں موجود ان آیات کا علم ہے جو اللہ پر دلالت کرتی ہیں۔\nاور اس میں گمان کا علم کے موافق ہونے کا علم ہے، اور صاحب حق کس چیز سے جانتا ہے کہ یہ علم ہے نہ کہ گمان، حالانکہ وہ پہلے اسے گمان سمجھتا تھا؟\nاور اس میں اہل ریب (شک کرنے والوں) کے حال کا علم ہے، اور وہ کن اقسام سے ملحق ہوتے ہیں، اور کون سے اسماء ان پر نظر کرتے ہیں؟\nاور اس میں حوالہ (سپردگی) کا علم ہے۔\nاور اس میں ملأ اعلیٰ (بلند مجلس) کے احوال کا علم ہے، اور ان کے معلوم مقام میں واردات کے اختلاف کی وجہ سے ان پر ان کا اختلاف۔\nاور اس میں اس چیز کا علم ہے جو اللہ کی طرف منسوب نہیں کی جاتی، یعنی جس کے ساتھ اس کی صفت بیان نہیں کی جاتی، کیا وہ عدمی امر ہے یا وجودی؟\nاور اس میں یہ علم ہے کہ عالم کہاں شک کرتا ہے حالانکہ وہ شک کرنے والا نہیں ہے، اور وہ شک کرنے والے کی صورت میں کیوں ظاہر ہوتا ہے؟\nاور اس میں اس چیز کا علم ہے جس کے بارے میں سوال کیا جاتا ہے اور جس کے بارے میں سوال نہیں کیا جاتا۔\nاور اس میں یہ علم ہے کہ اللہ اپنے بندوں کو کس چیز میں جمع کرتا ہے، پھر اسی جمع میں ان کے درمیان تفریق کرتا ہے، پس وہ اس میں مفصل (جدا جدا) ہیں۔\nاور اس میں اس شخص کا علم ہے جس نے کسی چیز کا دعویٰ کیا تو اس سے اس دعوے پر دلیل طلب کی گئی، اگر اس نے ایسی چیز کا دعویٰ کیا جس سے وہ عالم کے احوال میں اثر ڈالنا چاہتا ہے۔\nاور اس میں ان احوال کا علم ہے جو تقدم (آگے بڑھنے) اور تاخر (پیچھے ہٹنے) کو قبول نہیں کرتے۔\nاور اس میں حجتوں کا علم ہے۔\nاور اس میں تقریب (قربت دینا) کا علم ہے، اور قرب کس کی طرف ہوتا ہے، کیا کسی کون (کائنات) کی طرف یا اللہ کی طرف؟ اور کیا اللہ کی طرف قرب صحیح ہے یا نہیں، حالانکہ وہ ہر انسان کے **حَبْلِ الْوَرِيدِ** (شہ رگ) سے زیادہ قریب ہے، جیسا کہ اللہ تعالیٰ نے فرمایا؟\nاور اس میں اعراض (عارضی صفات) کا علم ہے۔\nاور اس میں ارواح کے درمیان فرق اور بیزاری کا علم ہے۔\nاور اس میں دلالات (نشانیاں) کو دیکھتے وقت کیا کہا جاتا ہے اس کا علم ہے۔\nاور اس میں اجر معاد (لوٹائے جانے والے اجر) کا علم ہے اور چیز کو اس کی جنس سے ملانے کا علم ہے۔\nاور اس میں اس شخص کا علم ہے جو جانتا ہے کہ وہ کیا کہتا ہے اور اسے کیا کہا جاتا ہے، اور وہ جو نہیں جانتا کہ وہ کیا کہتا ہے اور اسے کیا کہا جاتا ہے۔\nاور اس میں تمام امور کو ان کی حیرت اور ان کی انابت (رجوع) کو اللہ کی طرف لوٹانے کا علم ہے، اور ان کی خیر اور شر کا، اور یہ کہ شر اللہ کی طرف نہیں ہے۔\nاور اس میں الٰہی ادراک کا علم ہے۔\nاور اس میں اس چیز کا علم ہے جو ادراک نہیں کی جاتی حالانکہ اس کا ادراک جائز ہے۔\nاور اس میں اس چیز کا علم ہے جو رؤیت کے ذریعے احتلام (خواب میں انزال) کو روکتی ہے۔\nاور اس میں رکاوٹوں کا علم ہے۔\nاور اللہ **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و پنجاه و یکم در معرفت منزل تجلی استفهام و برداشته شدن پرده از دیدگان معانی، و این منزل از حضرت محمدیه (الحضرة المحمدية) و از اسم «الرب» است.\n\nچون روح از وحی او مدهوش شود، پس با کالبد ظلمانی‌اش چه خواهد شد؟\nخداوند ارکانش را استوار ساخت و آن را چون فلکی بر آبش روان کرد.\nو آن دریایی نیست که ساحلی داشته باشد، و نهایت نام‌های او کجاست؟\nای پدر هستی (الکون)، اگر او را می‌دانستی و چشم فرزندانش او را مشاهده می‌کرد.\nپس به آمدنش شادمان مباش و بر جایگاهش (سیسائه) ننشین.\nپاک و منزه است آن که اعیان ما را زایل می‌کند، آنگاه که نعمت‌هایش را کفران کنیم.\nو شگفتا که ما آن نعمت‌ها را کفران کردیم، در حالی که من از عین عطایای او هستم.\n\n### [همانا خداوند پیوسته جهان را می‌بیند]\n\nبدان، خداوند ما و تو را تأیید کند، که این منزل، منزل حجاب‌های مانع و ابزارهای دفع‌کننده است. برخی از آن‌ها حجاب‌های عنایت هستند، مانند این سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم): «همانا برای خداوند هفتاد هزار حجاب یا هفتاد حجاب است (شک از من است) از نور و ظلمت، و اگر آن‌ها را بردارد، سبحات وجه (سبحات وجهه) او هر آنچه را که دیده‌اش از خلقش درک کرده است، خواهد سوزاند.»\n\nو در اینجا نکته و اشاره‌ای است که این «بصر» در اینجا بصر خلق است که حق (الحق) آن را بصر خود قرار داده است، و آن (بصر خلق) پذیرنده این حجاب‌هاست، و آن (بصر خلق) موصوف به این است که حق (الحق) بصر اوست، و آن عین سبحات وجه (سبحات الوجه) است. زیرا خداوند پیوسته و از ازل جهان را می‌بیند و رؤیت او جهان را نسوزانده است. و از جمله حجاب‌های غیر عنایت، مانند این سخن خداوند متعال است: **«كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ»** (چنین نیست، همانا آنان در آن روز از پروردگارشان محجوب‌اند).\n\n### [همانا حجاب‌ها بر چند نوع‌اند: حجاب‌های کیانی میان اکوان]\n\nپس بدان که حجاب‌ها بر چند نوع‌اند: حجاب‌های کیانی (حجب كيانية) میان اکوان (الأكوان)، مانند این سخن خداوند متعال: **«فَسْئَلُوهُنَّ مِنْ وَراءِ حِجابٍ»** (پس از پشت پرده از ایشان بپرسید). و از جمله آن‌ها حجاب‌هایی است که خلق به واسطه آن‌ها از خداوند محجوب شده‌اند، مانند این سخن: **«وَقالُوا قُلُوبُنا فِي أَكِنَّةٍ»** (و گفتند: دل‌های ما در پرده‌هاست). و از جمله آن‌ها حجاب‌هایی است که خداوند به واسطه آن‌ها از خلقش محجوب شده است، مانند این سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم): «همانا خداوند در روز قیامت بر بندگانش تجلی می‌کند، در حالی که میان او و ایشان جز ردای کبریا بر وجهش نیست.» و در روایتی دیگر: «میان او و خلقش سه حجاب است.» یا چنان که فرمود. و از جمله آن‌ها این سخن است: **«وَما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ مِنْ وَراءِ حِجابٍ»** (و هیچ بشری را نرسد که خداوند با او سخن گوید مگر به وحی یا از پشت پرده)، چنان که با موسی (علیه السلام) از حجاب آتش و درخت و **«شاطِئِ الْوادِ الْأَيْمَنِ»** (ساحل وادی ایمن) و **«جانِبِ الطُّورِ الْأَيْمَنِ»** (جانب راست طور) و در **«الْبُقْعَةِ الْمُبارَكَةِ»** (بقعه مبارکه) سخن گفت. و چنان که فرمود: **«فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله»** (پس او را پناه ده تا کلام خدا را بشنود). پس خداوند با پناه‌جو از پشت حجاب محمد (صَلَّى اللهُ عَليهِ وسَلَّم) سخن گفت، زیرا او (محمد) عین حجاب بود، چرا که پناه‌جو از مشرکان، کلام خدا را از او شنید. پس شک نداریم که خداوند با ما بر زبان رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) سخن گفته است. و همچنین از پشت حجاب نمازگزار با ما سخن گفته است، آنگاه که می‌گوید: «سمع الله لمن حمده» (خداوند سخن کسی را که او را ستایش کند، شنید). پس زبان عالم، تماماً اقوال خداوند است و تقسیم آن برای خداست، پس آنچه را بخواهد به خود نسبت می‌دهد و آنچه را بخواهد رها می‌کند.\n\nاما حجاب‌های کیانی (الحجب الكيانية) که میان اکوان (الأكوان) قرار دارند، برخی از آن‌ها سپرها و محافظت‌ها هستند و برخی دیگر عزت و حمایت‌ها، مانند احتجاب پادشاهان و حجاب غیرت بر کسی که نسبت به او غیرت ورزیده می‌شود، چنان که در مورد زنان پرده‌نشین (ذوات الخدور) که محتجب هستند، گفته شده است. و از آن جمله است: **«حُورٌ مَقْصُوراتٌ فِي الْخِيامِ»** (حوریانی که در خیمه‌ها محصورند). اما محافظت‌ها و سپرها، برخی از آن‌ها حجاب‌هایی هستند که اجسام حیوانی را از سرمای شدید و گرمای سخت حفظ می‌کنند و بدین وسیله درد را از خود دور می‌سازند. همچنین در جنگ، جنگجو با سپرها، تیرها و نیزه‌ها و شمشیرهای دشمنان را از خود دفع می‌کند و با سپر خود که حائل میان او و دشمنش است، از این‌ها و امثال آن پرهیز می‌کند و با کلاهخود و سپر و زره، آزار را از خود دور می‌سازد. و گاهی حجاب‌ها معنوی هستند که شخص با آن‌ها آزار را از کسی که به او کرامت می‌ورزد، دفع می‌کند؛ مانند شخصی که از او در حق شخص دیگری عملی سر می‌زند که آن شخص آن را ناخوش می‌دارد، زیرا با طبع او سازگار نیست و با غرض او موافق نمی‌افتد، پس به سبب آنچه از او در حقش سر زده است، مورد سرزنش قرار می‌گیرد. در این هنگام، شخصی برمی‌خیزد و خود را سپر او قرار می‌دهد تا تیرهای آن سرزنش را به جان خود بپذیرد و در ذهن سرزنش‌کننده چنین القا کند که او (شخص دوم) سبب اصلی آن بوده و تمام آن آزار از جانب او بوده است، تا آن سرزنش‌کننده به این امر یقین کند که آن کار از جانب این شخص بوده است، به هر روی که بتواند به آن دست یابد. پس سرزنش به او تعلق می‌گیرد و او حائل میان سرزنش و شخصی می‌شود که آزار از او سر زده بود، و بدین ترتیب آبروی او را با جان خود حفظ می‌کند. چنان که ما نیز افعال قبیح را که با اغراض موافق نیست و با طبع سازگار نمی‌باشد، به خود نسبت می‌دهیم، با وجود آنکه می‌دانیم همه از جانب خداست، اما چون زبان سرزنش به آن تعلق می‌گیرد، آنچه را که به حق (الحق) نسبت داده می‌شود، به خاطر ادب با خداوند، با جان‌های خود فدا می‌کنیم. و آنچه از خیر و نیکی است، نفس خود را از میان برمی‌داریم و آن را به خداوند نسبت می‌دهیم تا او ستوده شود، هم از باب ادب با خداوند و هم از روی حقیقت، زیرا بی‌شک آن برای خداست، با وجود آنکه بوی اشتراک در آن وجود دارد، به دلیل خبر الهی در این سخن: **«وَاللهُ خَلَقَكُمْ وَما تَعْمَلُونَ»** (و خداوند شما و آنچه را عمل می‌کنید، آفریده است) و این سخن: **«ما أَصابَكَ مِنْ حَسَنَةٍ فَمِنَ اللهِ وَما أَصابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ»** (آنچه از نیکی به تو رسد، از خداست و آنچه از بدی به تو رسد، از نفس توست). و فرمود: **«قُلْ كُلٌّ مِنْ عِنْدِ اللهِ»** (بگو: همه از جانب خداست). پس عمل را گاهی به ما و گاهی به خود نسبت داد. به همین دلیل گفتیم در آن بوی اشتراک وجود دارد. خداوند متعال فرمود: **«لَها ما كَسَبَتْ وَعَلَيْها مَا اكْتَسَبَتْ»** (آنچه کسب کرده به سود اوست و آنچه مرتکب شده به زیان اوست)، پس همه را به ما نسبت داد. و فرمود: **«فَأَلْهَمَها فُجُورَها وَتَقْواها»** (پس فجور و تقوای او را به او الهام کرد). پس الهام در ما از اوست و عمل به آنچه الهام شده از ماست. و فرمود: **«كُلًّا نُمِدُّ هؤُلاءِ وَهَؤُلاءِ مِنْ عَطاءِ رَبِّكَ»** (ما همه این‌ها و آن‌های دیگر را از عطای پروردگارت مدد می‌رسانیم). پس عطای او گاهی الهام است و گاهی خلق عمل. این مسئله‌ای است که توحید (التوحيد) در آن به طور کامل خالص نمی‌شود، نه از جهت کشف (الکشف) و نه از جهت خبر. پس امر صحیح در این باره آن است که میان حق (حق) و خلق گره خورده است و برای هیچ یک از دو جانب خالص نیست. زیرا بالاترین نسبت‌های الهی این است که حق تعالی (الحق تعالى) عین هستی (الوجود) باشد که ممکنات آن را کسب کرده‌اند. پس در آنجا جز هستی (وجود) عین حق (الحق) نیست و بس. و تغییرات آشکار در این عین، احکام اعیان ممکنات هستند. پس اگر عین نبود، حکم ظاهر نمی‌شد، و اگر ممکن نبود، تغییر ظاهر نمی‌شد. بنابراین در افعال، وجود حق و خلق ضروری است. و در مذهب برخی از عوام، بنده محل ظهور افعال خدا و جایگاه جریان آن‌هاست، پس حواس آن‌ها را جز از اکوان (الأكوان) مشاهده نمی‌کند و بصیرتشان آن‌ها را جز از خداوند از پشت حجاب مشاهده نمی‌کند. این کسی که افعال بر دست او ظاهر شده، اراده‌کننده آن و مختار در آن است، پس او با اختیار خود کسب‌کننده آن است. و این مذهب اشاعره است. و مذهب برخی از عوام نیز این است که فعل حقیقتاً از آن بنده است، با این حال، پیوند فعل میان حق (الحق) و خلق نزد آن‌ها از بین نمی‌رود، زیرا اینان نیز می‌گویند که قدرت حادث در بنده که این فعل از فاعل به واسطه آن صورت می‌گیرد، خداوند آن قدرت را برای او خلق کرده است. پس فعل برای بنده خالص نمی‌شود مگر به واسطه قدرتی که خداوند در او خلق کرده است. پس اشتراک از بین نرفته است. و این مذهب اهل اعتزال است. پس این‌ها سه دسته هستند: اصحاب ما، اشاعره و معتزله، که وقوع اشتراک از میان آن‌ها برنخاسته است. و همچنین حکم کسانی که علل را اثبات می‌کنند (مثبتي العلل)؛ اثبات معلول برای علت آن که خود معلول علت دیگری بالاتر از آن است، برایشان خالص نمی‌شود تا اینکه به حق (الحق) در آن واجب الوجود لذاته برسند که نزد آن‌ها علت العلل است. پس اگر علت العلل نبود، معلولی از علتی وجود نداشت، زیرا هر علتی پایین‌تر از علت العلل، معلول است. پس اشتراک بر مذهب اینان نیز برطرف نشده است. اما غیر از این دسته‌ها، یعنی طبیعیون و دهریون، نهایت امرشان به این می‌انجامد که آنچه ما آن را «اله» می‌نامیم، دهریون آن را «دهر» و طبیعیون آن را «طبیعت» می‌نامند. و آن‌ها نیز فعل ظاهر شده از ما را خالص نمی‌کنند، مگر اینکه آن را به طبیعت یا به دهر نسبت دهند. پس وجود اشتراک در هر نحله و ملتی از بین نرفته است. و هیچ عقلی وجود ندارد که بر خلاف این دلالت کند و هیچ خبر الهی در شریعتی نیست که فعل را از همه جهات به یکی از دو جانب خالص کند. پس بگذارید آن را همان‌گونه که خداوند بر اساس علم خود در آن قرار داده است، بپذیریم. و در آنجا جز کشف (کشف) و شرع و عقل نیست، و این سه هیچ چیزی را خالص نکرده‌اند و هرگز خالص نخواهند کرد، نه در دنیا و نه در آخرت، **«جَزاءً بِما كُنْتُمْ تَعْمَلُونَ»** (به پاداش آنچه عمل می‌کردید). پس امر در ذات خود، و خداوند داناتر است، جز همان‌گونه که واقع شده، نیست و در آن تخلیصی واقع نمی‌شود، زیرا اگر در ذات خود خالص بود، حتماً بر برخی از این طوایف آشکار می‌شد و برای ما ممکن نبود که بگوییم همه در خطا هستند، زیرا در همه آن‌ها شرایع الهی وجود دارد و نسبت دادن خطا به آن‌ها محال است. و جز خداوند کسی از امور آن‌گونه که هستند، خبر نمی‌دهد، و او خبر داده است. پس امر جز همان‌گونه که خبر داده، نیست، زیرا بازگشت همه به اوست. پس آنچه خالص شده، خالص است و آنچه خالص نشده، در ذات خود خالص نیست. همانا خداوند **«يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ»** (حق را می‌گوید و او راه را می‌نمایاند). پس حق (الحق) و تمام عالم در این مسئله بر اشتراک توافق کردند، و این همان شرک خفی و جلی و جایگاه حیرت است، پس ترجیحی وجود ندارد. پس جز آنچه گفتیم، نیست. حال که در این مسئله آنچه را مقرر کردیم، مقرر نمودیم، پس بگوییم:\n\n### [جود الهی و غیرت الهی]\n\nهمانا جود الهی (الجود الإلهي) و غیرت الهی (الغيرة الإلهية) اقتضا کردند که آنچه را بیان می‌کنیم، بگویند، ان شاء الله. و آن این است که متکلمان در این شأن بر دو دسته‌اند: دسته اول تمام افعال را به اکوان (الأكوان) نسبت دادند، پس زبان غیرت الهی گفت: **«كُلٌّ مِنْ عِنْدِ اللهِ فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً»** (همه از جانب خداست. پس این قوم را چه شده که نزدیک نیست سخنی را بفهمند؟) یعنی سخن حادث را. اما دسته دوم، تمام افعال نیکو را به خداوند نسبت دادند و افعال زشت را به اکوان (الأكوان) نسبت دادند، پس زبان جود الهی گفت: **«قُلْ كُلٌّ مِنْ عِنْدِ اللهِ»** (بگو: همه از جانب خداست)، نه برای تکذیب آن‌ها، بلکه برای ستایش نیکو. و کسی وجود ندارد که گفته باشد تمام افعال برای خداست و نه برای اکوان، بدون هیچ بوی اشتراکی. به همین دلیل ما آن را به دو دسته محدود کردیم، به خاطر طبیعیون و دهریون.\n\nاما حجاب‌های عنایت (حجب العناية)، که حجاب‌های شفقت بر خلق از سوختن هستند، حجاب‌هایی‌اند که مانع می‌شوند سبحات وجه (السبحات الوجهية) آنچه را که بصر از خلق درک کرده است، بسوزاند. و سبب آن این است که خداوند دعاوی را در خلق قرار داده است، زیرا اعیان آن‌ها وقتی به هستی (الوجود) پس از عدم متصف شدند و آن هستی (الوجود) از ترجیح مرجِّح که واجب الوجود است، حاصل شد، هیچ کس آن را انکار نکرد، اگرچه عبارات در مورد آن به نام طبیعت و دهر و علت و غیره تغییر یافته است، اما او همان است و نه غیر او. پس دیدند که هستی (الوجود) اگرچه مستفاد است، اما حقیقتاً از آنِ آن‌هاست، و اعیان آن‌ها هستند که با این هستی (الوجود) مستفاد موجود شده‌اند. و این‌ها اعیان حجاب‌هایی هستند که میان خداوند و خلقش قرار دارند. پس اگر آن‌ها را به طور عمومی برمی‌داشت، چنان که به طور خصوصی برای برخی از بندگانش برداشته است، انوار ذات او که با سبحات وجه (سبحات وجهه) تعبیر می‌شود، هر آنچه را که دیده‌اش از اعیان موجودات درک کرده است، می‌سوزاند. یعنی بصر او از موجودات جز هستی (وجود) حق (الحق) را درک نمی‌کرد و تمام آنچه دعاوی مقرر کرده‌اند، از بین می‌رفت و آشکار می‌شد که او حق (الحق) است و نه غیر او. پس این زوال را به «احراق» (سوختن) تعبیر کرد، زیرا آن‌ها را انوار قرار داده است و انوار خاصیت احراق دارند. اما او تعالی حجاب‌های دعاوی را باقی گذاشت تا اهل الله از غیر آن‌ها متمایز شوند. پس ممکنات نزد اهل الله از حیث اعیانشان موصوف به عدم هستند و از حیث احکامشان پیوسته موصوف به هستی (الوجود) هستند، و آن حق (الحق) است، چنان که در خبر صحیح فرمود: «كنت سمعه وبصره» (من گوش و چشم او بودم). پس عین را برای بنده اثبات کرد و خود را عین صفت او قرار داد که عین هستی (وجود) اوست، عین صفت بنده. پس عین ممکن ثابت است و موجود نیست، و صفت موجود و ثابت است، و آن یک عین است، اگرچه به نسبت‌هایش کثیر شود، زیرا در نسبت‌ها کثیر است. پس آن سمع و بصر و غیر این دو است تا تمام قوای موجود در عالم، از فرشته و بشر و جن و معدن و نبات و حیوان و مکان و زمان و محل و معقول و محسوس. و جز این نیست. و چون خداوند دعاوی مدعیان را با فرستادن حجاب‌ها میان آن‌ها و آنچه امر بر آن است، تثبیت کرد و آن‌ها را به حجاب‌هایی که میان آن‌ها و او در افعال است، مشغول ساخت و همه را به همه زد، خاصان خود را جدا کرد و آن‌ها را با شهود (الشهود) در نزد خود همنشین قرار داد و در صور محسوسشان با ذکر (الذکر). پس او همنشین ذاکرین است و آن‌ها آخرین طوایف هستند که پس از آن‌ها کسی نیست که وصفی قابل ذکر داشته باشد. خداوند متعال وقتی آن‌ها را وصف کرد، فرمود: **«ذُكْراناً وَإِناثاً وَالذَّاكِرِينَ اللهَ كَثِيراً وَالذَّاكِراتِ»** (مردان و زنان و مردان و زنانی که خدا را بسیار یاد می‌کنند). پس با همنشینان خود ختم کرد، و پس از همنشینان او کسی نیست که صفتی را بپذیرد، مگر صفت دوری از این مجالست. آیا نمی‌بینی ابویزید (رحمه الله) را، هنگامی که اسماء الهی و آنچه از حقایق سزاوار آن‌هاست را نمی‌دانست، چه کرد؟ وقتی شنید قاری در روز جمعه می‌خواند: **«يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً»** (روزی که پرهیزکاران را به سوی رحمان به صورت هیئت‌های واردشونده محشور می‌کنیم)، خون از چشمانش پرید تا اینکه به منبر زد و آه کشید و گفت: این شگفت است! چگونه کسی که همنشین اوست، به سوی او محشور می‌شود؟ زیرا او در آن حالت، همنشین با اسماء بود از آن حیث که بر ذات دلالت می‌کنند، نه اینکه با اسم از آن حیث که حقیقتش از عین دلالتش بر ذات طلب می‌کند، باشد. پس آنچه را که مشهدش به او نداده بود، انکار کرد، با وجود آنکه کلام حق (الحق) بود. و از او انکار واقع شد، بلکه جز تعجب خاص از او واقع نشد. پس شبیه انکار است و انکار نیست، تا جایی که اگر این سخن از غیر خدا بود، گوینده را به سکوت امر می‌کرد و او را از آن باز می‌داشت. بلکه آن مرد تنها تعجب خود را از سخن خداوند در حق متقین که همنشینان خدا هستند، ابراز کرد که چگونه به سوی او محشور می‌شوند. پس گویی او در مشهد ابراهیمی در طلب کیفیت احیای مردگان بود. پس ابویزید همان را اراده کرد که ابراهیم در کیفیت احیای مردگان اراده کرد، به دلیل اختلاف وجوه در آن، نه انکار احیای مردگان. پس این سخن ابویزید بر حال او در آن زمان دلالت دارد. این مانند سخن ابراهیم است: **«يا أَبَتِ إِنِّي أَخافُ أَنْ يَمَسَّكَ عَذابٌ مِنَ الرَّحْمنِ»** (ای پدر، من می‌ترسم که عذابی از جانب رحمان به تو رسد)، در حالی که رحمت با عذاب تناقض دارد، مگر بر وجهی که در منزل پیش از این منزل، یعنی منزل فتح الأبواب، مقرر کردیم. همچنین ابویزید اگر می‌دانست که متقی همنشین رحمان نیست، بلکه همنشین جبار، مرید، عظیم و متکبر است، پس متقی به سوی رحمان محشور می‌شود تا همنشین او باشد و پرهیز از او زایل شود، زیرا از رحمان پرهیز نمی‌شود، بلکه او محل طمع و ناز و انس است. اما آن‌ها (رضی الله عنهم) صادق هستند و در هیچ حالی از ذوق خود فراتر نمی‌روند، بر خلاف عوام اهل الله که از احوال دیگران سخن می‌گویند. و خواص راهی به این کار ندارند، و اگر هم یکی از آن‌ها در حال پیامبر یا ولی‌ای که بالاتر از اوست، سخن بگوید، بیان می‌کند که مترجم حال دیگری است تا شنونده بداند که این حال آن‌هاست (رضی الله عنهم). و چنین چیزی از آن‌ها واقع نمی‌شود مگر به ندرت و به دلیل ضرورتی که پیش آید، زیرا آن‌ها کشف خبری (الکشف الخبري) از مقامات بالاتر از خود دارند، اما کشف ذوقی (الکشف الذوقي) ندارند مگر در آنچه مقام و حال خودشان است. پس اگر این حجاب‌ها که خداوند میان اکوان (الأكوان) و خود آویخته است، نبود، مراتب متمایز نمی‌شد و حقایق (الحقائق) در هم می‌آمیخت. و این سبب وضع حدود در اشیا است، و خداوند کسی را که نشانه‌های زمین را تغییر دهد، لعنت کرده است.\n\nو از این باب است که خداوند برای هیچ کس میان مشاهده خود و کلام خود در حال مشاهده جمع نکرده است، زیرا راهی به آن نیست مگر اینکه تجلی الهی (التجلي الإلهي) در صورت مثالی باشد، در این صورت میان مشاهده و کلام جمع می‌شود. و این نزد ما انکار شده نیست. و به ما رسیده است که شیخ عارف شهاب‌الدین سهروردی در بغداد (رضی الله عنه) به جمع میان مشاهده و کلام قائل بوده است، اما بیش از این از او نقل نشده است. زیرا از ناقل پرسیدم، اما نوع تجلی را برایم ذکر نکرد. و گمان به شیخ نیکوست، پس ناگزیر باید تجلی صوری را اراده کرده باشد. آیا سیاری، از رجال رساله قشیری، را نمی‌بینی که گفت: هیچ عاقلی هرگز از مشاهده لذت نبرده است. سپس تفسیر کرد و گفت: زیرا مشاهده حق (الحق) فنا (الفناء) است و در آن لذتی نیست، و خطاب در حال فنا (الفناء) صحیح نیست، زیرا فایده خطاب این است که تعقل شود. و به همین دلیل فرمود: **«وَما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ مِنْ وَراءِ حِجابٍ»** (و هیچ بشری را نرسد که خداوند با او سخن گوید مگر به وحی یا از پشت پرده). و بشر از حکم بشریت زایل نمی‌شود، مانند مسئله موسی، و حجاب عین صورتی است که از آن به او ندا می‌دهد. و بشر از بشریت خود زایل نمی‌شود، حتی اگر از شهود (الشهود) آن فانی شود، زیرا عین هستی (وجود) آن زایل نمی‌شود و حد با آن همراه است. ما این را گفتیم، زیرا شنیدم برخی از شیوخ می‌گفتند: این بهره بشر است، پس اگر از بشریت خود زایل شود، حکمش حکم دیگری خواهد بود. پس برای او (رضی الله عنه) روشن ساختم که امر آن‌گونه که گمان می‌کند، نیست. پس وقتی آنچه را ذکر کردیم، محقق ساخت، از آن بازگشت و گفت: گمان نمی‌کردم مگر اینکه امر بر همان باشد که گفتم و به این نکته توجه نکرده بودم. زیرا او در شرح آیه سخن گفت و اشتباه کرد، و در آن از ذوق امر سخن نگفت. و از اینجا اشتباه رخ می‌دهد. و ما می‌دانیم که آنچه خداوند گفته است، تماماً حق است و با اذواق مخالفت نمی‌کند. پس ناگزیر باید کلام صاحب ذوق مطابق با اخبارات الهی باشد، تا جایی که کسی که معرفت (المعرفة) به مقام رجال ندارد، بگوید: این متکلم سخنی می‌گوید که با آنچه قرآن یا سنت آورده، مخالفت نمی‌کند، بلکه آن را از آن دو گرفته و مفسر آن دو است. و صاحب ذوق جز آنچه چشیده، نگفته است، پس محال است که با چیزی از آنچه از جانب خدا آمده، مخالفت کند. اما بیگانه بی‌ذوق، این را از صاحب ذوق می‌گوید. بلکه گروهی از اهل طریقت که ذوق ندارند، چنین چیزی را تصور می‌کنند و می‌گویند: فلان کس از آنجا که در اخبارات الهی آمده، سخن می‌گوید و ماده دیگری ندارد، و ذوق را انکار می‌کنند، زیرا آن را از نفس خود نشناخته‌اند، با وجود آنکه در نفس خود معتقدند که بر یک طریق هستند. و امر نیز چنین است؛ اصحاب اذواق بی‌شک بر یک طریق هستند، جز اینکه در میان آن‌ها بینا و کور و شب‌کور وجود دارد. پس هیچ یک از آن‌ها جز آنچه حالش به او داده، نمی‌گوید، نه آنچه طریق به او داده و نه آنچه طریق در ذات خود بر آن است. به ویژه سلوک معنوی، زیرا کوری قلب‌ها شدیدتر از کوری چشم‌هاست. زیرا کوری قلب‌ها میان تو و حق (الحق) حائل می‌شود، در حالی که کوری چشمی که صاحبش هرگز ندیده است، تنها میان تو و رنگ‌ها حائل می‌شود و بس. و این کوری از حجاب‌هاست. و همچنین کری و قفل و پرده و غشاوه، در حکم پایین‌تر از کوری هستند، مگر اینکه غشاوه ظلمت ایجاد کند، در این صورت فرقی میان آن و کوری نیست. اما اگر از حد ظلمت به حد سدفة (تاریکی خفیف) خارج شود، حال صاحبش ممکن است بهتر از حال صاحب ظلمت و حال کور باشد. برخی از آن‌ها به محمد (صَلَّى اللهُ عَليهِ وسَلَّم) گفتند: **«وَمِنْ بَيْنِنا وَبَيْنِكَ حِجابٌ»** (و میان ما و تو حجابی است)، و آن همان پرده‌ها (الأكنة) است. **«فَاعْمَلْ إِنَّنا عامِلُونَ»** (پس تو عمل کن، همانا ما نیز عمل‌کننده‌ایم)، یعنی در رفع آن عمل کن. و این سخن آن‌ها که **«إِنَّنا عامِلُونَ»** (ما نیز عمل‌کننده‌ایم) در رفع آن، در حق کسی که صدقش نزد آن‌ها محتمل است، این احتمال را دارد که آن‌ها اعتراف کردند که قلب‌هایشان در پرده‌هایی است از آنچه او آن‌ها را به آن دعوت می‌کند، پس سخن او را انکار نکردند و رد ننمودند، چنان که دیگرانی که این را نگفتند، اعتقاد داشتند. پس نمی‌دانم سرانجام اینان به کجا انجامید، زیرا آن‌ها نزد من در مقام رجاء (امید) هستند. زیرا ما قطعاً می‌دانیم که رسول (صَلَّى اللهُ عَليهِ وسَلَّم) بی‌شک در رفع پوشش از دیدگان آن‌ها می‌کوشد، تا جایی که فرمود: «حتماً بر هفتاد خواهم افزود.» و به همین دلیل در آیه فرمود: **«وَوَيْلٌ لِلْمُشْرِكِينَ»** (و وای بر مشرکان) و نگفت: «و وای بر شما». پس این به قرینه حال دلالت می‌کند که آن‌ها عامل در رفع حجاب و بیرون آوردن قلب‌هایشان از پرده‌ها هستند. و پرده‌ها تنها به دلیل اختلاف اسباب توقف آن‌ها در پذیرش آنچه او آورده بود، زیاد شد. پس برخی از آن‌ها را حسد، و دیگری را جهل، و دیگری را مشغولیت وقت به آنچه نزد او مهم‌تر بود تا از آن فارغ شود، پوشانده بود، و همه این‌ها حجاب است. و از شگفت‌انگیزترین چیزهایی که در هستی (الوجود) واقع شده، این است که می‌گویم: و آن این است که فرشتگان هنگامی که خداوند به وحی سخن می‌گوید، گویی زنجیری بر سنگ صاف است، فرشتگان مدهوش می‌شوند. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) نیز هنگامی که وحی بر او نازل می‌شد، مانند زنجیری بر سنگ صاف بود و مدهوش می‌شد، و این شدیدترین وحی بر او بود. پس جبرئیل آن را بر قلب او نازل می‌کرد و او از عالم حس فانی می‌شد و ناله می‌کرد و پوشیده می‌شد تا اینکه از او برطرف می‌شد. و وحی بر او در روز بسیار سرد نازل می‌شد و پیشانی‌اش عرق می‌کرد. و موسی (صَلَّى اللهُ عَليهِ وسَلَّم) خداوند با او تکلیم کرد، با برداشته شدن واسطه‌ها، و او مدهوش نشد و از حس خود زایل نگردید و گفت و به او گفته شد. و این مقام اعظم از مقام وحی با واسطه فرشته است. پس این فرشته هنگام کلام مدهوش می‌شود و این گرامی‌ترین بشر هنگام نزول روح با وحی مدهوش می‌شود، و این موسی مدهوش نشد و چیزی بر او جاری نشد، با وجود برداشته شدن واسطه‌ها، و آن کوه مدهوش شد. پس بدان که این همه از آثار حجاب‌هاست، زیرا حکم برای آن‌هاست هر جا که ظاهر شوند. زیرا خداوند وقتی آن‌ها را حجاب آفرید، ممکن نبود جز اینکه حجاب باشند و ناگزیر باید حجاب باشند. و اگر حجاب نمی‌بودند، حجاب نبودند. و خداوند این حجاب‌ها را بر دو نوع آفرید: معنوی و مادی. و مادی را بر دو نوع آفرید: کثیف و لطیف و شفاف. پس کثیف آن است که بصر جز آن را درک نمی‌کند، و لطیف آن است که بصر آنچه در آن است و آنچه پشت آن است را درک می‌کند، و شفاف آن است که بصر آنچه پشت آن است را درک می‌کند و اگر آنچه در آن است را درک کند، دچار التباس می‌شود، چنان که گفته شده است:\n\nشیشه نازک شد و شراب نیز نازک شد *** پس شبیه هم شدند و امر مشتبه گشت\nگویی شراب است و جامی نیست *** و گویی جام است و شرابی نیست\n\nاما آینه‌ها و اجسام صیقلی، جایگاه صور در آن‌ها درک نمی‌شود و آنچه پشت آن‌هاست درک نمی‌شود، و صور غایب از چشم درک‌کننده به واسطه آن درک می‌شوند، نه در آن. پس صور مرئی حجابی میان بصر و صیقلی هستند، و آن‌ها صورتی هستند که نه لطیف نامیده می‌شوند و نه کثیف، و چشم‌ها آن‌ها را کثیف مشاهده می‌کنند و شکل‌هایشان با تغییر شکل صیقلی تغییر می‌کند و با موج‌دار شدن آن موج‌دار می‌شود و با حرکت کسی که صورت اوست از بیرون، حرکت می‌کند و با سکون او ساکن می‌شود، مگر اینکه صیقلی حرکت کند، مانند موج آب، که در چشم حرکتی در آن ظاهر می‌شود، در حالی که کسی که صورت اوست ساکن است. پس برای آن دو حرکت است: حرکتی از حرکت کسی که صورت اوست و حرکتی از حرکت صیقلی. پس در هستی (الوجود) جز حجاب‌های آویخته نیست و ادراکات متعلق به حجاب‌ها هستند و در صاحب چشم درک‌کننده آن‌ها اثر دارند.\n\n### [حجاب‌ها دو حجاب هستند: حجاب معنوی و حجاب حسی]\n\nو بزرگ‌ترین حجاب‌ها دو حجاب هستند: حجاب معنوی که همان جهل است، و حجاب حسی که همان «تو بر خودت» هستی.\n\nاما حجاب اعظم معنوی، سخن رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) است هنگامی که به معراج برده شد، درختی بود که در آن آشیانه پرنده‌ای قرار داشت. جبرئیل در یک آشیانه نشست و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در دیگری. هنگامی که به آسمان دنیا رسیدند، چیزی شبیه رفرف (بساط) از درّ و یاقوت به سوی آن‌ها آویزان شد، و این نوعی از تجلی حق (تجلی الحق) بود. پیامبر (علیه السلام) فرمود: «اما جبرئیل، به دلیل علمش به آنچه به سوی او آویزان شد، مدهوش گشت. و اما رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم)، بر حال خود باقی ماند، زیرا نمی‌دانست آن چیست، پس بر او تسلطی نداشت.» هنگامی که جبرئیل پس از به هوش آمدن به او خبر داد که آن حق (الحق) است، پیامبر (صَلَّى اللهُ عَليهِ وسَلَّلَم) در آن هنگام فرمود: «پس فضیلت او را دانستم.» یعنی فضیلت جبرئیل بر من در علم. پس علم، جبرئیل را مدهوش کرد و عدم علم، پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) را بر حال خود باقی گذاشت، با وجود اینکه رؤیت از هر دو شخص وجود داشت. پس این بزرگ‌ترین حجاب‌های معنوی است.\n\nو اما اینکه تو حجاب بر خودت باشی، که کثیف‌ترین حجاب‌های حسی است، سخن شاعر است که می‌گوید:\n\nرازی بر تو آشکار شد که پنهان بودنش به درازا کشیده بود *** و صبحی طلوع کرد که تو خود ظلمت آن بودی\nپس تو حجاب قلب از راز غیبش هستی *** و اگر تو نبودی، مهرش بر آن زده نمی‌شد\nهرگاه از آن غایب شوی، در آن فرود می‌آید و خیمه‌هایش *** بر دوش کشف (الکشف) مصون برپا می‌شود\nو سخنی آمد که از شنیدنش خسته نمی‌شویم *** نثر و نظم آن برای ما دلپذیر است\n\nپس جز تو، حجابی بر تو قرار داده نشده است.\n\nسپس به مسئله خود باز می‌گردیم و می‌گوییم: اما موسی (علیه السلام)، طلب آتش برای خانواده‌اش او را کاملاً مشغول کرده بود، و این همان چیزی بود که او را به دلیل مأموریتش برای تأمین معاش خانواده، بیرون کشید. و پیامبران سخت‌ترین مردم در مطالبه از نفس خود برای انجام اوامر حق (الحق) هستند. پس در نفس او جز آنچه برای آن خارج شده بود، نبود. هنگامی که حاجت خود را دید، که همان آتشی بود که از درخت در جانب راست طور (جانِبِ الطُّورِ الْأَيْمَنِ) بر او نمایان شد، حق (الحق) از عین حاجت او، با آنچه مناسب وقت بود، به او ندا داد: **«إِنِّي أَنَا رَبُّكَ فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوادِ الْمُقَدَّسِ طُوىً وَأَنَا اخْتَرْتُكَ فَاسْتَمِعْ لِما يُوحى»** (همانا من پروردگار تو هستم، پس کفش‌هایت را بیرون آور، زیرا تو در وادی مقدس طوی هستی، و من تو را برگزیدم، پس به آنچه وحی می‌شود گوش فرا ده). و نگفت: «به آنچه وحی شد، همانا من الله هستم.» پس خطاب اول با ندا او را ثابت نگه داشت، زیرا او برای این خارج شده بود که آتشی برگیرد یا هدایتی نزد آتش بیابد، و این همان سخن اوست: **«سَآتِيكُمْ مِنْها بِخَبَرٍ»** (به زودی خبری از آن برای شما می‌آورم)، یعنی کسی که او را به حاجتش راهنمایی کند. پس منتظر ندا بود و گوش و چشم خود را برای دیدن آتش و شنیدن صدای کسی که او را راهنمایی کند، آماده کرده بود. پس هنگامی که ندا با امری مناسب آمد، آن را انکار نکرد و ثابت ماند. هنگامی که دانست نداکننده پروردگار اوست و ثبوت برای او صحیح شد و ندا از خارج آمد نه از نفس او، ثابت ماند تا حق ادب را در استماع به جا آورد. زیرا برای هر نوعی از تجلی (التجلي) حکمی است، و حکم ندای این تجلی، آماده شدن برای شنیدن آنچه می‌آورد، بود. پس مدهوش نشد و از شهود (الشهود) خود غایب نگردید، زیرا آن خطاب مقید به جهت، شنیده شده با اذن، و خطاب تفصیلی بود. پس آنچه انسان را بر حس و شهود محسوسش ثابت نگه می‌دارد، قلب اوست که مدبر جسد اوست. و این کلام الهی موسوی توجهی بر قلب نداشت. پس قلب در اینجا جز آنچه از گوش و چشم و قوای خود طبق عادت جاری دریافت می‌کند، ندارد. پس حال از حکم خود در موسی (علیه السلام) فراتر نرفت.\n\nاما امر محمد (صَلَّى اللهُ عَليهِ وسَلَّم)، نزول قلبی و خطاب اجمالی بود، مانند زنجیری بر سنگ صاف. پس به این تشبیه توجه کن. قلب به آنچه بر او نازل شد مشغول گشت تا آن را دریافت کند، پس از تدبیر بدنش غایب شد، و این را غشیه و صعق (مدهوشی) نامیدند. و همچنین فرشتگان؛ پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) درباره فرشتگان در عارض شدن این حال خبر داد که وقتی وحی متکلم به آن مانند زنجیری بر سنگ صاف بود و نزول آن بر قلب‌های فرشتگان بود، فرمود: **«حَتَّى إِذا فُزِّعَ عَنْ قُلُوبِهِمْ»** (تا هنگامی که ترس از دل‌هایشان برطرف شود). سپس هنگامی که به هوش آمدند، از آن‌ها خبر داد که می‌گویند: «ماذا؟» و در اینجا توقف کرد. سپس به آن‌ها پاسخ می‌دهد و می‌گوید: «ربکم» و در اینجا توقف کرد. پس می‌گویند: «الحق» (به نصب)، یعنی حق (الحق) چنین گفت. ما این‌گونه دانستیم، و او از این نزول در این نزول بزرگ و از این تشبیه در این نسبت، برتر است. و بر وجه دیگر: **«قالُوا ما ذا قالَ رَبُّكُمْ»** (گفتند: پروردگارتان چه گفت؟) و در اینجا توقف کرد. پس برخی از آن‌ها به برخی دیگر می‌گویند: **«الْحَقَّ وَهُوَ الْعَلِيُّ الْكَبِيرُ»** (حق است و او بلندمرتبه بزرگ است)، که این از قول خداست نه از قول فرشتگان. پس بر وجه اول، هنگامی که به هوش آمدند و خطاب اجمالی مشبه زایل شد و بداهت برطرف شد، گفتند: «ماذا؟» پس به آن‌ها گفته شد: «ربکم»، و این همان سخن اوست: «قال ربکم». پس آن‌ها هنگام این قول مدهوش نشدند، بلکه ثابت ماندند و گفتند: «الحق»، یعنی حق (الحق) گفت، یعنی پروردگار ما سخن حق را گفت، منظورشان آنچه از وحی فهمیدند یا سخن او که «قال ربکم» یا هر دو با هم است، و این صحیح است. پس این تفاوت میان حال موسی (علیه السلام) و حال محمد (صَلَّى اللهُ عَليهِ وسَلَّم) و حال فرشتگان است.\n\n### [علم ستایش حق (الحق) بر نفس خود به واسطه خلقش]\n\nو بدان که در این منزل از علوم، علم ستایش حق (الحق) بر نفس خود به واسطه خلقش وجود دارد، و او ستایش‌کننده نفس خود به واسطه بی‌نیازی‌اش از خلقش است. پس کدام یک از این دو ستایش کامل‌تر و سزاوارتر است؟ و حق (الحق) از این دو ستایش کدام است؟ و حقیقت از آن دو کدام است؟ یا هر دو حقیقت برای دو حق هستند؟ یا هر دو حق هستند و دو حقیقت دارند؟\n\nو در آن، علم تفاوت میان علم و حکمت و خبرت وجود دارد. و در آن، علم آگاهی از آنچه در عالم است با تقسیمات احوال آن‌ها وجود دارد. و در آن، علم نیابت در پاسخ‌ها از جانب خداوند وجود دارد، و این جز برای رسول یا نبی یا وارثی از طریق شنیدن خطاب الهی نیست، نه از طریق تجلی (التجلي) و نه خطاب حال.\n\nو در آن، علم علم خداوند وجود دارد. و در آن، علم اینکه خداوند علم خود را در خلقش از عوالم کجا به ودیعه نهاده است، و آیا آن را در یک چیز یا در بیش از یک چیز به ودیعه نهاده است، وجود دارد.\n\nو در آن، علم اینکه دو قبضه در عالم شهادت به چه چیزی متمایز می‌شوند و در عالم غیب به چه چیزی متمایز می‌شوند، وجود دارد.\n\nو در آن، علم دلالت بر علما و صاحبان اخبار الهی وجود دارد تا آن‌ها را بشناسیم و آنچه را از جانب خداوند می‌آورند، از آن‌ها دریافت کنیم و در علم به آن با آن‌ها برابر شویم، به دلیل رغبت در اینکه نفوس ما در صورت به نفوس آن‌ها ملحق شود، اگرچه راه‌ها متفاوت باشد، زیرا اختلاف راه‌ها در صورت علم اثری ندارد. و این همان چیزی است که بزرگان از علمای بزرگ را به نشر علم ترغیب می‌کند، چنان که متعلمان را به طلب علم از علمای بزرگی که می‌دانند آن‌ها داناتر به خدا از خودشان هستند، ترغیب می‌کند. و از این روست که آن مرد به شاگرد گفت: «اگر ابویزید را یک بار ببینی، برای تو بهتر است از اینکه خداوند را هزار بار ببینی»، به دلیل فضیلت او بر او در علم به خدا، زیرا دانست که ظهور حق (الحق) بر بندگانش به اندازه علم آن‌ها به اوست. پس رؤیت ما به خداوند با علم علما به او، اگر آن را از آن‌ها کسب کنیم، کامل‌تر از رؤیت ما با علم خودمان قبل از کسب آن از آن‌هاست.\n\nو در آن، علم احاطه اعتبار به جهات وجود دارد، و اینکه اعتبار حالی را از حالی و جهتی را از جهتی خاص نمی‌کند، و آن علمی عام است، و آن علمی است که دلالت می‌دهد به کسی که با عبودیت به سوی خداوند بازگشته است.\n\nو در آن، علم امر و نهی الهی با کمک در عبادت و اعمال خیر وجود دارد.\n\nو در آن، علم فرستادن نعمت‌های خارق‌العاده و آنچه از آن‌ها محجوب می‌شود و چه چیزی محجوب می‌کند، وجود دارد.\n\nو در آن، علم قوای مسخرات در تسخیر و اینکه قوای آن‌ها در آنچه برای آن مسخر شده‌اند، تا کجا پایان می‌یابد، وجود دارد.\n\nو در آن، علم مرگ مجهول در میت و اینکه به چه چیزی شناخته می‌شود، وجود دارد، چنان که قشیری در رساله خود از برخی نقل کرده است که انسانی مرد و غسال به او نگاه کرد و متحیر شد و ندانست که آیا مرده است یا نه، در حالی که در نفس الأمر مرده بود. و مانند این بر یکی از یاران من که به من خدمت می‌کرد، ظاهر شد و نزد من درگذشت، و غسال هنگام غسل او شک کرد که آیا مرده است یا نه.\n\nو در آن، علم اثر علم در عالم وجود دارد، و کسی که ادعای علم کند و آنچه می‌داند در او اثر نکند، و این مسئله‌ای مشکل است که حس در آن ایجاد اشکال می‌کند، زیرا ما ندیده‌ایم کسی خود را در آتش بیندازد، با وجود علمش به اینکه او را می‌سوزاند، مگر دو دسته: یکی کسی که آن را قربانی قرار می‌دهد و خود را در آن می‌اندازد به قصد سوختن به عنوان قربت به آن، یا کسی که می‌داند آن او را نمی‌سوزاند. پس دانستیم که علم در عالم اثر دارد.\n\nو در آن، علم آیات نعمت‌ها و اینکه بر چه چیزی دلالت می‌کنند و حق آن‌ها بر کسی که آن‌ها را آیه می‌بیند چیست، وجود دارد.\n\nو در آن، علم علم قوی که آنچه غیر آن از علومی که در قلب می‌یابد را از بین می‌برد، وجود دارد.\n\nو در آن، علم ادنی و اعلی و سبب موجب طلب طالب برای ادنی و ترک اعلی، با وجود علمش به مرتبه هر یک از آن دو، وجود دارد.\n\nو در آن، علم اسباب جزا در خیر و شر وجود دارد.\n\nو در آن، علم بعد و قرب کیانی و الهی وجود دارد.\n\nو در آن، علم آنچه در علم قرب و بعد از آیات دال بر خداوند است، وجود دارد.\n\nو در آن، علم موافقت گمان با علم و اینکه صاحب حق (الحق) به چه چیزی می‌داند که آن علم است نه گمان، در حالی که قبلاً معتقد بود که آن گمان است، وجود دارد.\n\nو در آن، علم حال اهل شک و اینکه به کدام دسته‌ها ملحق می‌شوند و کدام اسماء به آن‌ها نظر می‌کنند، وجود دارد.\n\nو در آن، علم حواله وجود دارد.\n\nو در آن، علم احوال ملأ اعلی و اختلاف آن‌ها بر ایشان به دلیل اختلاف واردات در مقام معلومشان وجود دارد.\n\nو در آن، علم آنچه به خداوند نسبت داده نمی‌شود، یعنی به آن وصف نمی‌شود، وجود دارد که آیا امری عدمی است یا وجودی.\n\nو در آن، علم اینکه عالم کجا شک می‌کند در حالی که شکاک نیست و چرا به صورت شکاک ظاهر می‌شود، وجود دارد.\n\nو در آن، علم آنچه از آن سؤال می‌شود و آنچه از آن سؤال نمی‌شود، وجود دارد.\n\nو در آن، علم اینکه خداوند بندگانش را در چه چیزی جمع می‌کند و سپس در عین این جمع میان آن‌ها تفصیل می‌دهد، پس آن‌ها در آن مفصل هستند، وجود دارد.\n\nو در آن، علم اینکه هر کس امری را ادعا کند، اگر ادعای چیزی کند که می‌خواهد در احوال عالم اثر بگذارد، از او دلیل بر ادعایش خواسته می‌شود، وجود دارد.\n\nو در آن، علم آنچه تقدم و تأخر را از احوال نمی‌پذیرد، وجود دارد.\n\nو در آن، علم حجاج (برهان‌آوری) وجود دارد.\n\nو در آن، علم تقریب و اینکه قرب به سوی کیست، آیا به سوی کون است یا به سوی خداوند، و آیا قرب به سوی خداوند صحیح است یا نه، در حالی که او از **«حَبْلِ الْوَرِيدِ»** (رگ گردن) به هر انسانی نزدیک‌تر است، چنان که خداوند متعال فرمود.\n\nو در آن، علم اعراض وجود دارد.\n\nو در آن، علم فرق و تبرّی میان ارواح وجود دارد.\n\nو در آن، علم آنچه هنگام دیدن دلالات گفته می‌شود، وجود دارد.\n\nو در آن، علم اجر بازگشت داده شده و ملحق کردن شیء به جنس خود وجود دارد.\n\nو در آن، علم کسی که می‌داند چه می‌گوید و به او چه گفته می‌شود و کسی که نمی‌داند چه می‌گوید و به او چه گفته می‌شود، وجود دارد.\n\nو در آن، علم بازگرداندن تمام امور، حیرت و انابت آن‌ها به سوی خداوند، و خیر و شر آن‌ها، و اینکه شر به سوی خداوند نیست، وجود دارد.\n\nو در آن، علم ادراک الهی وجود دارد.\n\nو در آن، علم ما لا یدرک (آنچه ادراک نمی‌شود) از آنچه جایز است ادراک شود، وجود دارد.\n\nو در آن، علم آنچه مانع احتلام با رؤیت می‌شود، وجود دارد.\n\nو در آن، علم موانع وجود دارد. و خداوند **«يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ»** (حق را می‌گوید و او راه را می‌نمایاند)."
  },
  "page_count": 7
}