{
  "id": 87,
  "title": {
    "ar": "الباب السابع والثمانون في تقوى النار",
    "en": "Chapter Eighty-Seven, Concerning Piety Regarding the Fire",
    "ur": "باب ستاسی: آگ کی تقویٰ کے بیان میں",
    "fa": "باب هشتاد و هفتم در تقوای آتش"
  },
  "content": {
    "ar": "## (الباب السابع والثمانون في تقوى النار)\n\n\nقال تعالى واتَّقُوا النَّارَ الَّتِي أُعِدَّتْ لِلْكافِرِينَ وفَاتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ والْحِجارَةُ وقال قُوا أَنْفُسَكُمْ وأَهْلِيكُمْ ناراً وَقُودُهَا النَّاسُ والْحِجارَةُ\n\n\n> من يتقي النار فذاك الذي *** يحشر للرحمن من قبره‏\n\n\n> من اسمه الجبار أو مثله *** فليشكر الله على شكره‏\n\n\n> لا سيما والنار مشهوده *** في ذلك اليوم على كبره‏\n\n\n> لا تقي النار ولا مثلها *** فإن تقوى النار من مكره‏\n\n\n> لا تقي غير الإله الذي *** أبطن نفع الشخص في ضره‏\n\n\n### [النار يوم القيامة دواء لأهل الكبائر]\n\n\nاعلم وفقك الله وفهمك أن النار قد تتخذ دواء لبعض الأمراض فهي وقاية وهو الداء الذي لا يتقي إلا بالكي بالنار فقد جعل الله النار وقاية في هذا الموطن من داء هو أشد من النار في حق المبتلى به وأي داء أكبر من الكبائر فجعل الله لهم النار يوم القيامة دواء كالكي بالنار في الدنيا فدفع بدخولهم النار يوم القيامة داء عظيما أعظم من النار وهو غضب الله الذي قام مقام الداء الذي يكوي من يخاف عليه منه بالنار ولهذا يخرجون بعد ذلك من النار إلى الجنة قد امتحشوا كما يخرج إلى العافية صاحب الكي بالنار هذا إذا جعلناها وقاية كما جعلنا في الحدود الدنياوية وقاية من عذاب الآخرة ولهذا هي كفارات أي تستره هذه الحدود عن عذاب الآخرة\n\n\n### [عقوبة الكفار وعقوبة أهل الكبائر]\n\n\nومن هنا قلنا في المحاربين الله ورسوله إن المعنى بهم الكفار فإن الله لما عاقبهم في الدنيا لم يجعل عقوبتهم كفارة مثل ما هي الحدود في حق المؤمنين بل قال ذلِكَ لَهُمْ خِزْيٌ في الدُّنْيا ولَهُمْ في الْآخِرَةِ عَذابٌ عَظِيمٌ وهذا لا يكون إلا للكفار والعذاب العظيم هو أن يعم الظاهر والباطن بخلاف عذاب أهل الكبائر من المؤمنين فإن الله يميتهم في النار إماتة حتى يعودوا حمما شبه الفحم فهؤلاء ما أحسوا بالعذاب لموتهم فليس لهم حظ في العذاب العظيم فتتقى النار لما يكون من الألم عند تعلقها بنا والذين هم جمر لها يزيدون في فعلها فإنهم المحرقون بالنار مثل الجمرات ثم تفعل النار بوساطة الجمرات التي ظهرت فيها فعلا آخر قد يكون فيه منفعة كالجمرات التي تكون تحت القدر لإنضاج ما في القدر ليقع بذلك الإنضاج منفعة المتمتع بما نضج‏\n\n\n### [كرة الأثير وأشعة الشمس وموضع الجنة والنار]\n\n\nولما كانت كرة الأثير واسعة الشمس تؤثر في مولدات الفواكه والمعادن بحرارتها نضجا لما في ذلك من المنفعة لنا كانت رحمة مع كونها نارا كذلك من عرف نشأة الآخرة وموضع الجنة والنار وما في فواكه الجنة من النضج الذي يقع به الالتذاذ لأكله من أهل الجنان علم أين النار وأين الجنة وإن نضج فواكه الجنة سببها حرارة النار الذي تحت مقعر أرض الجنة فتحدث النار حرارة في مقعر أرضها فيكون صلاح ما في الجنة من المأكولات وما لا يصلح إلا بالحرارة من حرارة النار وهو لها كحرارة النار تحت القدر فإن مقعر أرض الجنة هو سقف النار وقد بينا ذلك في التنزلات الموصلية والشمس والقمر والنجوم كلها في النار وعن أحكامها بما أودع الله فيها كانت منافع الحيوانات بها فتفعل بالأشياء هنالك علوا كما كانت تفعل هنا سفلا وكما هو الأمر هنا كذلك ينتقل إلى هنالك بالمعنى وإن اختلفت الصور أ لا ترى أرض الجنة مسكا وهو حار بالطبع لما فيه‏\nمن النار وأشجار الجنة مغروسة في تلك التربة المسكية كما يقتضي حال نبات هذه الدار الدنيا الزبل لما فيه من الحرارة الطبيعية لأنه معفن والحرارة تعطي التعفين في الأجسام القابلة للتعفين وهذا القدر كاف في تقوى النار أعاذنا الله منها في الدارين‏\n\n",
    "en": "## (Chapter Eighty-Seven: On the Pious Avoidance of the Fire)\n\nAllah the Exalted said: <<وَاتَّقُوا النَّارَ الَّتِي أُعِدَّتْ لِلْكَافِرِينَ>> (And fear the Fire which has been prepared for the disbelievers.) [Q 3:131] And: <<وَاتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ>> (And fear the Fire whose fuel is men and stones.) [Q 2:24] And He said: <<قُوا أَنْفُسَكُمْ وَأَهْلِيكُمْ نَاراً وَقُودُهَا النَّاسُ وَالْحِجَارَةُ>> (Protect yourselves and your families from a Fire whose fuel is men and stones.) [Q 66:6]\n\n> He who fears the Fire is the one\n> Who shall be gathered to the All-Merciful from his grave.\n> He whose name is the Compeller (الجبار) or similar,\n> Let him thank God for His gratitude.\n> Especially when the Fire is witnessed\n> On that Day, despite its vastness.\n> Do not fear the Fire, nor its like,\n> For the pious avoidance (تقوى) of the Fire is part of its cunning.\n> Fear none but the God who\n> Concealed the person's benefit within his harm.\n\n### [The Fire on the Day of Resurrection is a Medicine for the People of Major Sins]\n\nKnow, may God grant you success and understanding, that the Fire may be taken as a medicine for certain ailments. It is a protection (وقاية), yet it is the ailment (الداء) that can only be avoided by cauterization (الكي) with fire. God has made the Fire a protection in this station against an ailment that is more severe than the Fire itself for the one afflicted by it. And what ailment is greater than major sins (الكبائر)? Thus, God has made the Fire on the Day of Resurrection a medicine for them, like cauterization with fire in this world. By their entry into the Fire on the Day of Resurrection, He repels a great ailment, greater than the Fire itself, which is the Wrath of God (غضب الله). This Wrath takes the place of the ailment from which one is feared, and for which one is cauterized with fire. This is why they will later emerge from the Fire into Paradise, having been scorched (امتحشوا), just as the one who undergoes cauterization emerges into health. This is if we consider it a protection, just as we consider the worldly legal punishments (الحدود الدنياوية) a protection against the punishment of the Hereafter. This is why they are expiations (كفارات)—meaning these worldly limits conceal the person from the punishment of the Hereafter.\n\n### [The Punishment of the Disbelievers and the Punishment of the People of Major Sins]\n\nFrom this perspective, we said concerning those who wage war against God and His Messenger (المحاربين الله ورسوله) that the intended meaning refers to the disbelievers (الكفار). When God punished them in this world, He did not make their punishment an expiation, unlike the legal punishments applied to the believers. Rather, He said: <<ذَلِكَ لَهُمْ خِزْيٌ فِي الدُّنْيَا وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ>> (That is for them a disgrace in this world, and for them in the Hereafter is a great punishment.) [Q 5:33] This applies only to the disbelievers. The great punishment (العذاب العظيم) is that which encompasses both the outward and the inward. This is in contrast to the punishment of the people of major sins among the believers. God causes them to die (يميتهم) in the Fire until they turn into charcoal-like embers (حمما شبه الفحم). These individuals do not feel the punishment due to their death. Thus, they have no share in the great punishment.\n\nThe Fire is feared because of the pain that occurs when it attaches to us. Those who become embers (جمر لها) increase its effect, for they are the ones burned by the Fire, like the embers themselves. Then the Fire, through the mediation of the embers that appeared within it, performs another act, which may contain benefit (منفعة). This is like the embers placed beneath a pot (القدر) to cook what is inside, so that the cooking results in the benefit enjoyed by the one who partakes of what has been cooked.\n\n### [The Sphere of the Aether, the Rays of the Sun, and the Location of Paradise and the Fire]\n\nSince the vast sphere of the Aether (كرة الأثير) and the sun affect the generation of fruits and minerals (مولدات الفواكه والمعادن) through their heat, ripening them (نضجا) for our benefit, this heat is a mercy (رحمة) despite being a fire. Similarly, whoever knows the creation of the Hereafter (نشأة الآخرة), the location of Paradise (الجنة) and the Fire (النار), and the ripeness (النضج) in the fruits of Paradise—which causes pleasure (الالتذاذ) for those who eat them—will know where the Fire is and where Paradise is.\n\nThe ripening of the fruits of Paradise is caused by the heat of the Fire located beneath the concave floor (مقعر أرض) of Paradise. The Fire generates heat in the concave floor of Paradise, which perfects the edibles in Paradise—those things that are only perfected by heat—from the heat of the Fire. This heat is to Paradise what the heat of the fire beneath the pot is to the contents, for the concave floor of Paradise is the roof of the Fire. We have explained this in *Al-Tanazzulat al-Mawsiliyya*.\n\nThe sun, the moon, and the stars are all in the Fire. Their benefits for living creatures arise from their rulings (أحكامها) based on what God has deposited within them. They act upon things there (in the Hereafter) from above (علوا), just as they acted here (in the world) from below (سفلا). Just as the matter is here, so too does it transfer to the Hereafter in meaning (بالمعنى), even if the forms differ. Do you not see that the soil of Paradise (أرض الجنة) is musk (مسك)? Musk is naturally hot (حار بالطبع) due to the Fire contained within it. The trees of Paradise are planted in that musky soil, just as the state of vegetation in this worldly abode requires manure (الزبل) due to the natural heat it contains, because it is putrefied, and heat causes putrefaction in bodies susceptible to it. This much suffices regarding the pious avoidance of the Fire. May God grant us refuge from it in both abodes.",
    "ur": "(باب ستاسی: آگ کے تقویٰ کے بیان میں)\n\nاللہ تعالیٰ نے فرمایا: وَاتَّقُوا النَّارَ الَّتِي أُعِدَّتْ لِلْكافِرِينَ (اور اس آگ سے ڈرو جو کافروں کے لیے تیار کی گئی ہے)۔ اور فرمایا: فَاتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجارَةُ (پس اس آگ سے ڈرو جس کا ایندھن انسان اور پتھر ہیں)۔ اور فرمایا: قُوا أَنْفُسَكُمْ وَأَهْلِيكُمْ نَاراً وَقُودُهَا النَّاسُ وَالْحِجَارَةُ (اپنے آپ کو اور اپنے گھر والوں کو اس آگ سے بچاؤ جس کا ایندھن انسان اور پتھر ہیں)۔\n\nجو شخص آگ سے تقویٰ (پرہیز) کرتا ہے، وہی ہے جو\nاپنی قبر سے رحمن کی طرف اٹھایا جائے گا۔\nجس کا نام الجبار (الجبار) ہے یا اس جیسا ہے،\nاسے چاہیے کہ وہ اللہ کا شکر ادا کرے اس کے شکر پر۔\nخاص طور پر جب کہ آگ اس دن\nاپنی عظمت کے ساتھ مشہود (مشهوده) ہوگی۔\nنہ آگ بچاتی ہے اور نہ اس جیسی کوئی چیز،\nکیونکہ آگ کا تقویٰ (بچاؤ) اس کی چال (مکر) میں سے ہے۔\nاللہ کے سوا کوئی نہیں بچاتا، جس نے\nشخص کے نفع کو اس کے نقصان میں چھپا رکھا ہے۔\n\n[قیامت کے دن آگ، کبیرہ گناہوں والوں کے لیے دوا ہے]\n\nجان لو، اللہ تمہیں توفیق دے اور سمجھ عطا کرے، کہ آگ کو بعض بیماریوں کے لیے دوا کے طور پر استعمال کیا جاتا ہے۔ یہ ایک بچاؤ (وقاية) ہے، اور یہ وہ بیماری (الداء) ہے جس سے آگ کے ذریعے داغنے (الکی بالنار) کے بغیر بچا نہیں جا سکتا۔ پس اللہ نے اس مقام پر آگ کو ایک ایسی بیماری سے بچاؤ (وقاية) بنا دیا ہے جو مبتلا شخص کے حق میں آگ سے بھی زیادہ شدید ہے۔ اور کبیرہ گناہوں (الکبائر) سے بڑی کون سی بیماری ہو سکتی ہے؟ چنانچہ اللہ نے قیامت کے دن ان کے لیے آگ کو دوا بنا دیا، جیسے دنیا میں آگ سے داغنا (الکی بالنار)۔ پس قیامت کے دن ان کے آگ میں داخلے کے ذریعے ایک عظیم بیماری کو دور کیا گیا جو آگ سے بھی بڑی ہے، اور وہ ہے اللہ کا غضب، جو اس بیماری کی جگہ قائم ہوا جس سے ڈرنے والے کو آگ سے داغا جاتا ہے۔ اسی لیے وہ اس کے بعد آگ سے جنت کی طرف نکلیں گے، اس حال میں کہ وہ جل کر کوئلہ ہو چکے ہوں گے، جیسے آگ سے داغنے والا شخص صحت یابی کی طرف نکلتا ہے۔ یہ تب ہے جب ہم اسے بچاؤ (وقاية) قرار دیں، جیسا کہ ہم نے دنیاوی حدود (الحدود الدنیاویۃ) کو آخرت کے عذاب سے بچاؤ (وقاية) قرار دیا ہے۔ اسی لیے یہ کفارات (کفارات) ہیں، یعنی یہ حدود انہیں آخرت کے عذاب سے ڈھانپ لیتی ہیں۔\n\n[کافروں کی سزا اور کبیرہ گناہوں والوں کی سزا]\n\nاور اسی بنا پر ہم نے اللہ اور اس کے رسول سے لڑنے والوں (المحاربین اللہ ورسولہ) کے بارے میں کہا کہ ان سے مراد کافر ہیں، کیونکہ جب اللہ نے انہیں دنیا میں سزا دی تو ان کی سزا کو کفارہ نہیں بنایا، جیسا کہ حدود (الحدود) مومنوں کے حق میں ہوتی ہیں۔ بلکہ فرمایا: ذَلِكَ لَهُمْ خِزْيٌ فِي الدُّنْيَا وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ (یہ ان کے لیے دنیا میں رسوائی ہے اور آخرت میں ان کے لیے بڑا عذاب ہے)۔ اور یہ صرف کافروں کے لیے ہو سکتا ہے، اور بڑا عذاب (العذاب العظیم) یہ ہے کہ ظاہر اور باطن دونوں کو اپنی لپیٹ میں لے لے۔ اس کے برعکس مومنوں میں سے کبیرہ گناہوں والوں کے عذاب کے، کیونکہ اللہ انہیں آگ میں موت دے گا (یمیتہم) یہاں تک کہ وہ کوئلے (حمما) کی مانند ہو جائیں گے۔ پس یہ لوگ اپنی موت کی وجہ سے عذاب کو محسوس نہیں کریں گے، لہٰذا انہیں بڑے عذاب (العذاب العظیم) میں کوئی حصہ نہیں ملے گا۔ پس آگ سے بچاؤ (تتقى النار) اس درد کی وجہ سے کیا جاتا ہے جو اس کے ہم سے متعلق ہونے پر ہوتا ہے۔ اور جو لوگ اس کے انگارے (جمر) ہیں، وہ اس کے فعل میں اضافہ کرتے ہیں، کیونکہ وہ آگ سے جلائے جاتے ہیں، جیسے انگارے۔ پھر آگ ان انگاروں کے ذریعے، جو اس میں ظاہر ہوئے، ایک اور فعل کرتی ہے جس میں فائدہ ہو سکتا ہے، جیسے وہ انگارے جو ہنڈیا کے نیچے ہوتے ہیں تاکہ ہنڈیا میں موجود چیز کو پکائیں، تاکہ اس پکنے سے وہ شخص فائدہ اٹھا سکے جو پکی ہوئی چیز سے لطف اندوز ہوتا ہے۔\n\n[کرہ اثیر، سورج کی شعاعیں اور جنت و دوزخ کا مقام]\n\nچونکہ کرہ اثیر (كرة الأثير) وسیع ہے، سورج اپنی حرارت سے پھلوں اور معدنیات کی پیداوار میں اثر انداز ہوتا ہے، انہیں پکا کر (نضجا) تاکہ اس میں ہمارے لیے فائدہ ہو، اس لیے یہ رحمت ہے باوجود اس کے کہ یہ آگ ہے۔ اسی طرح جس نے آخرت کی نشوونما، جنت اور دوزخ کے مقام، اور جنت کے پھلوں میں اس پختگی (النضج) کو جانا جس سے جنتیوں کو کھانے میں لذت حاصل ہوتی ہے، وہ جان گیا کہ آگ کہاں ہے اور جنت کہاں ہے۔ اور یہ کہ جنت کے پھلوں کا پکنا اس آگ کی حرارت کی وجہ سے ہے جو جنت کی زمین کے مقعر (مقعر أرض الجنة) کے نیچے ہے۔ پس آگ اس کی زمین کے مقعر میں حرارت پیدا کرتی ہے، چنانچہ جنت میں موجود کھانے کی چیزوں کی اصلاح ہوتی ہے اور وہ چیزیں جو حرارت کے بغیر درست نہیں ہوتیں، وہ آگ کی حرارت سے درست ہوتی ہیں، اور یہ اس کے لیے ایسی ہی ہے جیسے ہنڈیا کے نیچے کی آگ کی حرارت۔ کیونکہ جنت کی زمین کا مقعر (مقعر أرض الجنة) دوزخ کی چھت ہے۔ اور ہم نے اس کی وضاحت التنزلات الموصلیہ (التنزلات الموصلية) میں کی ہے۔ سورج، چاند اور ستارے سب آگ میں ہیں، اور ان کے احکام سے، جو اللہ نے ان میں ودیعت کیے ہیں، حیوانات کو ان سے فائدے حاصل ہوتے ہیں۔ پس وہ وہاں اوپر کی چیزوں پر اثر انداز ہوتے ہیں، جیسا کہ وہ یہاں نیچے کی چیزوں پر اثر انداز ہوتے تھے۔ اور جیسا معاملہ یہاں ہے، اسی طرح وہ معنی کے لحاظ سے وہاں منتقل ہو جاتا ہے، اگرچہ صورتیں مختلف ہوں۔ کیا تم نہیں دیکھتے کہ جنت کی زمین مشک ہے، اور وہ اپنی طبیعت میں گرم ہے کیونکہ اس میں آگ ہے۔ اور جنت کے درخت اس مشکی مٹی میں لگائے گئے ہیں، جیسا کہ اس دنیا کے پودوں کی حالت تقاضا کرتی ہے کہ وہ کھاد (الزبل) میں ہوں کیونکہ اس میں قدرتی حرارت ہوتی ہے، کیونکہ یہ سڑی ہوئی ہوتی ہے، اور حرارت ان اجسام کو سڑانڈ دیتی ہے جو سڑنے کی صلاحیت رکھتے ہیں۔ آگ کے تقویٰ (تقوى النار) کے لیے یہ مقدار کافی ہے، اللہ ہمیں دونوں جہانوں میں اس سے پناہ دے۔",
    "fa": "باب هشتاد و هفتم در تقوای آتش (تقوى النار)\n\nخداوند متعال فرمود: «و از آتشی که برای کافران آماده شده است، بپرهیزید (وَاتَّقُوا النَّارَ الَّتِي أُعِدَّتْ لِلْكَافِرِينَ)». و «از آتشی بترسید که سوخت آن مردم و سنگ‌ها هستند (فَاتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ)». و فرمود: «خود و خانواده‌تان را از آتشی که سوخت آن مردم و سنگ‌ها هستند، حفظ کنید (قُوا أَنفُسَكُمْ وَأَهْلِيكُمْ نَارًا وَقُودُهَا النَّاسُ وَالْحِجَارَةُ)».\n\nآن کس که تقوای آتش پیشه کند، اوست که\nاز گور خود برای رحمان محشور می‌شود\n\nهر که نامش جبار است یا مانند اوست\nباید خدا را به خاطر شکرش شکر کند\n\nبه ویژه آنکه آتش در آن روز\nبا عظمتش مشهود است\n\nنه آتش تقوا می‌پذیرد و نه مانند آن\nزیرا تقوای آتش از مکر آن است\n\nجز از خدایی که نفع شخص را\nدر ضرر او پنهان کرده است، تقوا مکن\n\n### [آتش در روز قیامت، دارویی برای اهل گناهان کبیره]\n\nبدان، خداوند تو را توفیق دهد و بفهماند، که آتش ممکن است به عنوان دارویی برای برخی بیماری‌ها به کار رود؛ پس آن یک محافظت (وقایه) است، و آن بیماری‌ای است که جز با داغ کردن (کی) با آتش، از آن پرهیز نمی‌شود. پس خداوند آتش را در این موضع، محافظتی قرار داده است در برابر دردی که برای مبتلا به آن، از خود آتش شدیدتر است. و چه دردی بزرگتر از گناهان کبیره؟ پس خداوند آتش را در روز قیامت برای آنان دارویی قرار داد، مانند داغ کردن با آتش در دنیا. پس با ورودشان به آتش در روز قیامت، دردی عظیم‌تر از آتش را دفع کرد، و آن غضب خداوند است که به جای آن دردی قرار گرفته که کسی را که از آن می‌ترسند، با آتش داغ می‌کنند. به همین دلیل، پس از آن از آتش به سوی بهشت خارج می‌شوند، در حالی که سوخته و پاک شده‌اند، همان‌گونه که کسی که با آتش داغ شده، به سوی عافیت خارج می‌شود. این در صورتی است که آن را محافظت (وقایه) بدانیم، همان‌گونه که حدود (مجازات‌های شرعی) دنیوی را محافظتی از عذاب آخرت قرار دادیم. به همین دلیل است که آن‌ها کفارات هستند، یعنی این حدود، شخص را از عذاب آخرت می‌پوشانند.\n\n### [مجازات کافران و مجازات اهل گناهان کبیره]\n\nو از این رو درباره محاربان با خدا و رسولش گفتیم که منظور از آنان کافران هستند. زیرا هنگامی که خداوند آنان را در دنیا مجازات کرد، مجازاتشان را کفاره قرار نداد، برخلاف حدود در حق مؤمنان؛ بلکه فرمود: «این برای آنان در دنیا خواری است و در آخرت عذابی بزرگ خواهند داشت (ذَلِكَ لَهُمْ خِزْيٌ فِي الدُّنْيَا وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ)». و این جز برای کافران نخواهد بود. و عذاب عظیم آن است که ظاهر و باطن را فرا گیرد، برخلاف عذاب اهل گناهان کبیره از مؤمنان. زیرا خداوند آنان را در آتش می‌میراند، چنان میراندنی که به صورت زغال‌های سوخته (حُمَم) درآیند. پس اینان به دلیل مرگشان، عذاب را احساس نمی‌کنند، بنابراین بهره‌ای از عذاب عظیم ندارند. پس از آتش پرهیز می‌شود به خاطر دردی که هنگام تعلق آن به ما ایجاد می‌شود. و کسانی که خودشان جمر (اخگر) برای آتش هستند، بر فعل آن می‌افزایند. زیرا آنان کسانی هستند که مانند اخگرها با آتش سوزانده می‌شوند. سپس آتش به واسطه اخگرهایی که در آن ظاهر شده‌اند، فعل دیگری انجام می‌دهد که ممکن است در آن منفعتی باشد، مانند اخگرهایی که زیر دیگ قرار می‌گیرند تا آنچه در دیگ است پخته شود، تا از طریق آن پختگی، منفعت بهره‌برنده از آنچه پخته شده، حاصل گردد.\n\n### [کره اثیر، پرتوهای خورشید و جایگاه بهشت و آتش]\n\nو چون کره اثیر (کُرة الأثیر) گسترده بود، خورشید با حرارت خود بر مولدات میوه‌ها و معادن تأثیر می‌گذارد و آن‌ها را می‌پزاند (نضج می‌دهد)، و چون در این کار منفعتی برای ما وجود دارد، این حرارت با وجود اینکه آتش است، رحمت به شمار می‌رود. همچنین کسی که نشأت آخرت، جایگاه بهشت و آتش، و پختگی (نضج) میوه‌های بهشت را که موجب لذت خوردن برای اهل بهشت می‌شود، بشناسد، می‌داند که آتش کجاست و بهشت کجاست. و اینکه پختگی میوه‌های بهشت، سببش حرارت آتشی است که زیر گودی (مقعر) زمین بهشت قرار دارد. پس آتش در گودی زمین بهشت حرارتی ایجاد می‌کند و این حرارت باعث صلاح و آماده شدن خوردنی‌های بهشت و هر آنچه جز با حرارت آماده نمی‌شود، می‌گردد. و این حرارت برای بهشت مانند حرارت آتش زیر دیگ است. زیرا گودی زمین بهشت، سقف آتش است. و ما این مطلب را در کتاب *التنزلات الموصلیة* بیان کرده‌ایم. و خورشید و ماه و ستارگان، همگی در آتش هستند، و منافع حیوانات از احکام آن‌هاست که خداوند در آن‌ها به ودیعه نهاده است. پس در آنجا (آخرت) بر اشیاء از بالا تأثیر می‌گذارد، همان‌گونه که در اینجا (دنیا) از پایین تأثیر می‌گذاشت. و همان‌گونه که امر در اینجا جاری است، به همان معنا به آنجا منتقل می‌شود، اگرچه صورت‌ها متفاوت باشند. آیا نمی‌بینی که زمین بهشت از مشک است، و مشک به دلیل آتشی که در آن است، طبعاً گرم است؟ و درختان بهشت در آن خاک مشکین کاشته شده‌اند، همان‌گونه که حال گیاهان این سرای دنیا اقتضا می‌کند که در کود (زبل) کاشته شوند، زیرا کود دارای حرارت طبیعی است، چون فاسد شده است و حرارت باعث فساد در اجسام مستعد فساد می‌شود. این مقدار در باب تقوای آتش کافی است. خداوند ما را در هر دو سرا از آن پناه دهد."
  },
  "page_count": 2
}