{
  "id": 462,
  "title": {
    "ar": "الباب الثاني والستون وأربعمائة في الأقطاب المحمديين ومنازلهم",
    "en": "Chapter Four Hundred and Sixty-Two: Concerning the Muhammadan Poles (الأقطاب المحمديون) and their Stations (منازلهم)",
    "ur": "باب چار سو باسٹھواں: محمدی اقطاب اور ان کے منازل کے بیان میں",
    "fa": "باب چهارصد و شصت و دوم در مورد اقطاب محمدی (الأقطاب المحمديين) و منازل (منازل) آن‌ها."
  },
  "content": {
    "ar": "## «الباب الثاني والستون وأربعمائة في الأقطاب المحمديين ومنازلهم»\n\n\n> اليثربي الذي لا نعت يضبطه *** ولا مقام ولا حال يعينه‏\n\n\n> مرخى العنان على الإطلاق نشأته *** قامت فلا أحد منا يبينه‏\n\n\n> من قال إن له نعتا فليس له *** علم به عند ما يبدو مكونه‏\n\n\n> فعلمنا إن علمناه يشير به *** وجهلنا هو في علمي يزينه‏\n\n\n### [إن الإنسان مسئول على جوارحه وجميع قواه‏]\n\n\nقال الله تعالى عن الملائكة والملإ الأعلى وما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ وقال يا أَهْلَ يَثْرِبَ لا مُقامَ لَكُمْ فأشبه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\nأي تشبه هذه الآية الآية الأخرى وأصل باب الأقطاب‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم كلكم راع‏\n\n\nحتى الإنسان على جوارحه وجميع قواه من بادية وهي الظاهرة وحاضرة وهي الباطنة\n\n\n### [ما معنى القطب‏]\n\n\nفاعلم أن الأمور كثيرة مختلفة في العالم فكل شي‏ء يدور عليه أمر ما من الأمور فذلك الشي‏ء قطب ذلك الأمر وما من شي‏ء إلا وهو مركب من روح وصورة فلا بد أن يكون لكل قطب روح وصورة فروحه تدور عليه أرواح ذلك الأمر الذي هذا قطبه وصورة ذلك القطب تدور عليه صورة ذلك الأمر الذي هذا قطبه يسمى الوجه الواحد من القطب جنوبيا وهو الروح والآخر شماليا وهو الصورة فمن جملة أصناف العالم الأناسي وهم المقصودون من وجود العالم بالقصد الثاني لا بالقصد الأول وأما القصد الأول فالقصد بوجود العالم عبادة الله أعني عبادة العرفان الحادث لكمال الوجود غير أنه في كل صنف من أصناف العالم تام غير كامل وما كمل إلا بهذه النشأة الإنسانية الكاملة وما عدا الكاملة فهو الإنسان الحيوان المسمى بالحد حيوانا ناطقا والأقطاب من الكمل‏\n\n\n### [إن الله جعل العالم الجسمي في منزلين الدنيا والآخرة]\n\n\nثم إن الله جعل العالم الجسمي والجسماني في منزلين منزل يسمى الدنيا ومنزل يسمى الآخرة وجعل سكانهما الإنس والجان والمعتبر فيهما الإنس والمعتبر من الإنس الكمل لا غير وهم الذين ذكرهم الله لا يزيدون عليه في نفوسهم هذا ذكرهم في نفوسهم وفي خلواتهم باللسان وأما في العموم فلا إله إلا الله ثم بعدها أنواع الذكر من سبحان الله المقيد والمطلق والحمد لله كذلك والله أكبر كذلك ولا حول ولا قوة إلا بالله كذلك فعمر بهذا الصنف المقصود من العالم أولا الدار الدنيا من الدارين وجعل سكناهم فيها بآجال مسماة ينتهون إليها ثم ينتقلون عند فراغ مدتهم إلى الدار الآخرة ونقلتهم على ضربين منهم من ينتقل بموت وهو مفارقة الحياة الدنيا فيحيي بحياة الآخرة ومنهم من ينتقل بالحياة الدنيا من غير موت وهو الشهيد في سبيل الله خاصة وما يقال فيه بأنه أفضل من الميت إلا أنه أفضل من بعض الموتى ثم إن الله جعل هذا الصنف الإنساني في الدنيا أمما كثيرين ثم بعث في كل أمة رسولا ليعلمها ما هو الأمر عليه الذي خلقوا له ويعلمهم بما للحق عليهم أن يفعلوه وما لهم إذا فعلوا ذلك من الخير عند الله في الدار الآخرة وما ذا عليهم إذا لم يفعلوا من العقوبة عند الله في الدار الدنيا إذا علم ولاة أمرهم ذلك وفي الآخرة ثم جعل الفضل فيهم فمنهم الفاضل والأفضل من الأمم ومن الرسل وختم الأمم بأمة محمد صَلَّى اللهُ عَليهِ وسَلَّم وجعلهم خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ وختم بمحمد صَلَّى اللهُ عَليهِ وسَلَّم جميع الرسل عليه السلام وختم بشرعه جميع الشرائع فلا رسول بعده يشرع ولا شريعة بعد شريعته تنزل من عند الله إلا ما قرره شرعه من اجتهاد علماء أمته في استنباط الأحكام من كتابه وسنة نبيه وأعني بالسنة الحديث لا من قياس وأعني بالقياس هنا قياس فرع على فرع لا قياس فرع على أصل فإن قياس الفرع على الأصل هو المستنبط الذي ثبت بالاجتهاد وجعله الفقهاء أصلا رابعا كما جعلوا الإجماع أصلا ثالثا وهو إجماع الصدر الأول وقالوا إنهم ما أجمعوا على أمر إلا ولا بد أن يعرفوا فيه نصا يرجعون فيه إليه إلا أنه ما وصل إلينا مع قطعنا به فإنه من المحال أن يجتمعوا على حكم لا يكون لهم فيه نص لأن نظرهم وفطرهم مختلفة فلا بد من الاختلاف وقد أجمعوا على أمر فذلك الحكم مقطوع به عندنا أنهم فيه على نص من الرسول صَلَّى اللهُ عَليهِ وسَلَّم ولا حكم بإجماع بعد إجماع الصدر الأول فلما كان الأمر على ما قررناه في هذا الباب فاشتغلنا بذكر الأقطاب المحمديين لكون محمد صَلَّى اللهُ عَليهِ وسَلَّم سيد الناس يوم القيامة وهو وأمته الآخرون الأولون فاعتبرنا من الرسل محمدا صَلَّى اللهُ عَليهِ وسَلَّم ومن الأمم أمته ص‏\n\n\n### [الأقطاب المحمديين على نوعين‏]\n\n\nواعلم أن الأقطاب المحمديين على نوعين أقطاب بعد بعثته وأقطاب قبل بعثته فالأقطاب الذين كانوا قبل بعثته هم الرسل وهم ثلاثمائة وثلاثة عشر رسولا وأما الأقطاب من أمته الذين كانوا بعد بعثته إلى يوم القيامة فهم اثنا عشر قطبا والختمان خارجان عن هؤلاء الأقطاب فهم من المفردين وسيأتي في آخر الكتاب ذكر الختم ويأتي بعد هذا الباب ذكر الاثني عشر قطبا مستوفى إن شاء الله تعالى‏\n\n\n### [منازل الأقطاب المحمديين الذين هم الرسل ص‏]\n\n\nفأما منازل الأقطاب المحمديين الذين هم الرسل صلوات الله عليهم أجمعين فلا سبيل لنا إلى الكلام على منازلهم فإن كلامنا عن ذوق ولا ذوق لنا في مقامات الرسل عليه السلام وإنما أذواقنا في الوراثة خاصة فلا يتكلم في الرسل إلا رسول ولا في الأنبياء إلا نبي أو رسول ولا في الوارثين إلا رسول أو نبي أو ولي أو من هو منهم هذا هو الأدب الإلهي فلا تعرف مراتب الرسل إلا من الختم العام‏\nالذي يختم الله به الولاية العامة في آخر الزمان وهو عيسى بن مريم روح الله فإن سئل عن ذلك فهو يترجم عنهم وعن تفاضلهم فإنه رسول منهم وأما نحن فلا سبيل إلى ذلك فكلامنا في أقطاب الأمم الذين هم ورثة أنبيائهم وإرسالهم وفي أقطاب هذه الأمة المحمدية المتأخرة المنعوتة بالخيرية على جميع الأمم السالفة مؤمنيهم وكافريهم فكافرهم شر من كافري الأمم ومؤمنهم خير من مؤمني الأمم فلهم التقدم كما ورد في الخبر في قريش أنهم المقدمون على جميع القبائل في الخير والشر وجعل الإمامة فيهم سواء عدلوا أم جاروا فإن عدلوا فلرعيتهم ولهم وإن جاروا فلرعيتهم وعليهم يعني ما فرطوا فيه من حقوق الله وحقوق من استرعاهم الله عليهم فأقطاب هذه الأمة المختارة مقدمون على الأقطاب المتقدمين في الأمم السالفة أعني الأقطاب الوارثين المتبعين آثار رسلهم ثم نرجع ونقول إن أقطاب هذه الأمة المحمدية على أقسام مختلفة وما أعني بالأقطاب الذين لا يكون في كل عصر منهم إلا واحد إنما نذكر ذلك في الاثني عشر قطبا في الباب الذي يلي هذا الباب وإنما أذكر في الأقطاب المحمديين كل من دار عليه أمر جماعة من الناس في إقليم أو جهة كالإبدال في الأقاليم السبعة لكل إقليم بدل هو قطب ذلك الإقليم وكالأوتاد الأربعة لهم أربع جهات يحفظها الله بهم من شرق وغرب وجنوب وشمال لكل جهة وتد وكأقطاب القرى فلا بد في كل قرية من ولي لله تعالى به يحفظ الله تلك القرية سواء كانت تلك القرية كافرة أو مؤمنة فذلك الولي قطبها وكذلك أصحاب المقامات فلا بد للزهاد من قطب يكون المدار عليه في الزهد في أهل زمانه وكذلك في التوكل والمحبة والمعرفة وسائر المقامات والأحوال لا بد في كل صنف صنف من أربابها من قطب يدور عليه ذلك المقام ولقد أطلعني الله تعالى على قطب المتوكلين فرأيت التوكل يدور عليه كأنه الرحى حين تدور على قطبها وهو عبد الله بن الأستاذ الموروري من مدينة مورور ببلاد الأندلس كان قطب التوكل في زمانه عاينته وصحبته بفضل الله وكشفه لي ولما اجتمعت به عرفته بذلك فتبسم وشكر الله تعالى وكذلك اجتمعت بقطب الزمان سنة ثلاث وتسعين وخمسمائة بمدينة فاس أطلعني الله عليه في واقعة وعرفني به فاجتمعنا يوما ببستان بن حيون بمدينة فاس وهو في الجماعة لا يؤبه له فحضر في الجماعة وكان غريبا من أهل بجاية أشل اليد وكان في المجلس معنا شيوخ من أهل الله معتبرون في طريق الله منهم أبو العباس الحصار وأمثاله وكانت تلك الجماعة بأسرها إذا حضروا يتأدبون معنا فلا يكون المجلس إلا لنا ولا يتكلم أحد في علم الطريق فيهم غيري وإن تكلموا فيما بينهم رجعوا فيها إلي فوضع ذكر الأقطاب وهو في الجماعة فقلت لهم يا إخواني إني أذكر لكم\n\n\nفي قطب زمانكم عجبا فالتفت إلى ذلك الرجل الذي أراني الله في منامي أنه قطب الوقت وكان يختلف إلينا كثيرا ويحبنا فقال لي قل ما أطلعك الله عليه ولا تسم الشخص الذي عين لك في الواقعة وتبسم وقال الحمد لله فأخذت أذكر للجماعة ما أطلعني الله عليه من أمر ذلك الرجل فتعجب السامعون وما سميته ولا عينته وبقينا في أطيب مجلس مع أكرم إخوان إلى العصر ولا ذكرت للرجل أنه هو فلما انفضت الجماعة جاء ذلك القطب وقال جزاك الله خيرا ما أحسن ما فعلت حيث لم تسم الشخص الذي أطلعك الله عليه والسلام عليك ورحمة الله فكان سلام وداع ولا علم لي بذلك فما رأيته بعد ذلك في المدينة إلى الآن فالأقطاب المحمديون هم الذين ورثوا محمدا صَلَّى اللهُ عَليهِ وسَلَّم فيما اختص به من الشرائع والأحوال مما لم يكن في شرع تقدمه ولا في رسول تقدمه فإن كان في شرع تقدم شرعه وهو من شرعه أو في رسول قبله وهو فيه صَلَّى اللهُ عَليهِ وسَلَّم فذلك الرجل وارث ذلك الرسول المخصوص ولكن من محمد صَلَّى اللهُ عَليهِ وسَلَّم فلا ينسب إلا إلى ذلك الرسول وإن كان في هذه الأمة فيقال فيه موسوي إن كان من موسى أو عيسوي أو إبراهيمي أو ما كان من رسول أو نبي ولا ينسب إلى محمد صَلَّى اللهُ عَليهِ وسَلَّم إلا من كان بمثابة ما قلناه مما اختص به محمد صَلَّى اللهُ عَليهِ وسَلَّم وليس أعم في الاختصاص من عدم التقييد بمقام يتميز به فما يتميز\n\n\nالمحمدي إلا بأنه لا مقام له بتعين فمقامه إن لا مقام ومعنى ذلك ما نبينه وهو أن الإنسان قد تغلب عليه حالته فلا يعرف إلا بها فينسب إليها ويتعين بها والمحمدي نسبة المقامات إليه نسبة الأسماء لي الله فلا يتعين في مقام ينسب إليه بل هو في كل نفس وفي كل زمان وفي كل حال بصورة ما يقتضيه ذلك النفس أو الزمان أو الحال فلا يستمر تقيده فإن الأحكام الإلهية تختلف في كل زمان فيختلف باختلافها فإنه عز وجل كُلَّ يَوْمٍ هُوَ في شَأْنٍ‏\nفكذلك المحمدي وهو قوله تعالى إِنَّ في ذلِكَ لَذِكْرى‏ لِمَنْ كانَ لَهُ قَلْبٌ ولم يقل عقل فيقيده ولقلب ما سمي إلا بتقلبه في الأحوال والأمور دائما مع الأنفاس فمن عباد الله من يعلم ما يتقلب فيه في كل نفس ومنهم من يغفل عن ذلك‏\n\n\n### [القطب المحمدي هو الذي يتقلب مع الأنفاس علما]\n\n\nفالقطب المحمدي أو المفرد هو الذي يتقلب مع الأنفاس علما كما يتقلب معها حالا كل واحد من خلق الله فما زاد هذا الرجل إلا بالعلم بما يتقلب فيه وعليه لا بالتقليب فإن التقلب أمر يسرى في العالم كله وفيه ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ ذلك على التفصيل والتعيين وإن علموه على الإجمال فمنازلهم على قدر علمهم فيما يتقلبون فيه وعليه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ وشرح هذا الباب وبسطة يطول فرأينا الاقتصار على ما ذكرناه وأومانا إليه وتوخيناه وفي ذكرنا هجيرهم بتبين مقامهم والله يتولى التوفيق‏\n\n",
    "en": "Chapter Four Hundred and Sixty-Two: On the Muhammadan Poles (الأقطاب المحمديين) and their Stations (منازلهم)\n\nThe Yathribi [i.e., the Muhammadan] whom no description defines,\nNor Station (مقام) nor State (حال) specifies him.\n\nHis origination (نشأته) is established, with the reins loosened absolutely,\nSo none among us can clarify him.\n\nWhoever says he has a description has no\nKnowledge of him when his constitution appears.\n\nOur knowledge, if we know him, only points to him,\nAnd our ignorance of him adorns him in my knowledge.\n\n### [Man is responsible for his limbs and all his powers]\n\nAllah the Exalted said concerning the angels and the High Assembly (الملإ الأعلى): <<There is none among us but has a known station>> (وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ). And He said: <<O people of Yathrib, there is no station for you [to remain]>> (يَا أَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ). This resembles the verse <<There is nothing like unto Him>> (لَيْسَ كَمِثْلِهِ شَيْءٌ)—meaning this verse resembles the other verse—and the basis of the chapter on the Poles is the saying of the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم): \"All of you are shepherds (راع),\" extending even to Man over his limbs and all his powers, both the visible (بادية) and the hidden (حاضرة).\n\n### [What is the meaning of the Pole]\n\nKnow that affairs (الأمور) in the World (العالم) are many and diverse. Everything around which a certain affair revolves is the Pole (قطب) of that affair. There is nothing that is not composed of spirit (روح) and form (صورة). Therefore, every Pole must have a spirit and a form. Its spirit is that around which the spirits of the affair it governs revolve, and the form of that Pole is that around which the forms of the affair it governs revolve. One face of the Pole is called Southern (جنوبيا), which is the Spirit, and the other is called Northern (شماليا), which is the Form.\n\nAmong the categories of the World are human beings (الأناسي), who are the intended purpose of the World’s existence by the secondary intention (القصد الثاني), not the primary intention. As for the primary intention, the purpose of the World’s existence is the worship of Allah—meaning the worship of Gnosis (عبادة العرفان) that arises for the perfection of Being (كمال الوجود). However, every genus of the World is complete (تام) but not perfect (كامل). Perfection is only achieved through this complete human origination (النشأة الإنسانية الكاملة). Everything other than the complete human is the animal-human (الإنسان الحيوان), defined logically as the rational animal (حيوانا ناطقا). The Poles are from the Perfect Ones (الكمل).\n\n### [Indeed, Allah made the corporeal world into two abodes: the World and the Hereafter]\n\nThen, Allah made the corporeal and physical World into two abodes (منزلين): an abode called the World (الدنيا) and an abode called the Hereafter (الآخرة). He made their inhabitants humans (الإنس) and Jinn (الجان). The one considered (المعتبر) in both is the human, and the ones considered among humans are only the Perfect Ones (الكمل). They are those whom Allah mentions, and they do not exceed this mention in their souls (نفوسهم) and in their private moments (خلواتهم) by tongue. As for in public, [the mention is] *La ilaha illa Allah* (There is no god but Allah), followed by various types of remembrance (ذكر), such as the restricted and unrestricted *Subhan Allah* (Glory be to Allah), and likewise *Alhamdulillah* (Praise be to Allah), and likewise *Allahu Akbar* (Allah is Greater), and likewise *La hawla wa la quwwata illa billah* (There is no power nor strength save in Allah).\n\nWith this intended class (الصنف المقصود) of the World, He first populated the abode of the World out of the two abodes, and He made their dwelling therein for fixed terms (آجال مسماة) which they reach. Then, upon the completion of their term, they transfer to the abode of the Hereafter. Their transfer is of two types: some transfer by death (موت), which is the separation from the life of the World, so they live by the life of the Hereafter; and some transfer by the life of the World without death, which is specifically the martyr (الشهيد) in the path of Allah. What is said about him being better than the dead is true, but he is better than *some* of the dead.\n\nThen, Allah made this human class into many nations (أمما كثيرين) in the World. Then He sent a Messenger (رسول) to every nation to teach them the state of affairs for which they were created, and to teach them what The Real (الحق) requires them to do, and what good they will receive from Allah in the Hereafter if they do that, and what punishment they will receive from Allah in the World—if their guardians (ولاة أمرهم) know that—and in the Hereafter if they do not do it.\n\nThen He established excellence (الفضل) among them. Among the nations and the Messengers, there is the excellent (الفاضل) and the most excellent (الأفضل). He sealed the nations with the nation of Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم) and made them <<the best nation produced for mankind>> (خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ). He sealed all Messengers (الرسل) with Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم), and He sealed all Laws (الشرائع) with his Law (شرعه). There is no Messenger after him who legislates, nor any Law after his Law that descends from Allah, except what his Law established through the *ijtihad* (independent reasoning) of the scholars of his nation in deriving rulings from his Book and the Sunna of his Prophet—and by Sunna I mean the Hadith, not analogy (*qiyas*). By analogy here, I mean the analogy of a secondary case upon a secondary case, not the analogy of a secondary case upon a primary source, for the analogy of a secondary case upon a primary source is the derivation established by *ijtihad* which the jurists made the fourth source, just as they made Consensus (الإجماع) the third source. This refers to the consensus of the first generation (الصدر الأول). They said that they never agreed upon an matter unless they necessarily knew a text (نصا) to which they could refer, even if that text did not reach us, for we are certain of this. It is impossible for them to agree upon a ruling for which they have no text, because their views and natures differ, so disagreement is inevitable. Since they did agree upon an matter, we are certain that they based that ruling on a text from the Messenger (صَلَّى اللهُ عَليهِ وسَلَّم). There is no ruling based on consensus after the consensus of the first generation.\n\nSince the matter is as we have established in this chapter, we shall occupy ourselves with mentioning the Muhammadan Poles, because Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم) is the Master of mankind on the Day of Resurrection, and he and his nation are the Last Ones who are the First Ones. Thus, we consider Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم) among the Messengers and his nation among the nations.\n\n### [The Muhammadan Poles are of two types]\n\nKnow that the Muhammadan Poles are of two types: Poles after his mission (بعثته) and Poles before his mission. The Poles who existed before his mission are the Messengers, numbering three hundred and thirteen Messengers. As for the Poles from his nation who existed after his mission until the Day of Resurrection, they are twelve Poles. The Two Seals (الختمان) are outside of these Poles; they belong to the Solitaries (المفردين). The mention of the Seal will come at the end of the book, and the mention of the twelve Poles will come fully detailed in the chapter following this one, if Allah wills.\n\n### [The Stations of the Muhammadan Poles who are the Messengers]\n\nAs for the Stations (منازل) of the Muhammadan Poles who are the Messengers (صلوات الله عليهم أجمعين), we have no way to speak about their Stations, for our discourse is based on spiritual taste (ذوق), and we have no taste in the stations of the Messengers (عليه السلام). Our tastes are only in the inheritance (الوراثة) specifically. Only a Messenger speaks of Messengers, and only a Prophet or Messenger speaks of Prophets, and only a Messenger, Prophet, or Saint (ولي), or one who is from them, speaks of the Inheritors (الوارثين). This is the Divine Propriety (الأدب الإلهي).\n\nThe ranks of the Messengers are known only through the Universal Seal (الختم العام) with whom Allah seals the Universal Sainthood (الولاية العامة) at the end of time, who is Jesus son of Mary (عيسى بن مريم), the Spirit of God. If he is asked about that, he will interpret (يترجم) concerning them and their degrees of excellence (تفاضلهم), for he is a Messenger among them. As for us, there is no way to that.\n\nOur discourse is concerning the Poles of the nations who are the inheritors of their Prophets and their missions, and concerning the Poles of this later Muhammadan Nation, described as the best (الخيرية) over all previous nations, both their believers and their disbelievers. Their disbeliever is worse than the disbelievers of the [previous] nations, and their believer is better than the believers of the nations. They have precedence, as mentioned in the Hadith concerning Quraysh, that they precede all tribes in good and evil, and that the Imamate is among them, whether they are just or tyrannical. If they are just, it is for their subjects and for them; if they are tyrannical, it is for their subjects and against them—meaning what they neglected of the rights of Allah and the rights of those over whom Allah made them shepherds.\n\nThe chosen Poles of this nation precede the earlier Poles in the previous nations—meaning the inheriting Poles who follow the traces of their Messengers.\n\nWe return now to say that the Poles of this Muhammadan Nation are of different categories. By Poles here, I do not mean those of whom there is only one in every age—we shall mention that in the context of the twelve Poles in the chapter that follows this one. Rather, by Muhammadan Poles, I mean everyone around whom the affair of a group of people revolves in a region (إقليم) or direction (جهة), such as the Substitutes (الأبدال) in the seven climes (الأقاليم السبعة), where each clime has a Substitute who is the Pole of that clime. And such as the four Pegs (الأوتاد), who have four directions that Allah preserves through them—East, West, South, and North—with one Peg for each direction. And such as the Poles of the villages: every village must have a Saint (ولي) of Allah by whom Allah preserves that village, whether that village is disbelieving or believing. That Saint is its Pole. Likewise, the masters of the Stations (المقامات): the ascetics (الزهاد) must have a Pole around whom the matter of asceticism revolves among the people of his time. Likewise in reliance (التوكل), love (المحبة), gnosis (المعرفة), and all other Stations and States (الأحوال): every class of their masters must have a Pole around whom that Station revolves.\n\nIndeed, Allah revealed to me the Pole of those who rely (قطب المتوكلين). I saw reliance revolving around him as a millstone revolves on its axis. He was Abdullah ibn al-Ustadh al-Mururi from the city of Murur in al-Andalus. He was the Pole of Reliance in his time. I witnessed him and accompanied him by the grace and unveiling (كشف) of Allah. When I met him, I informed him of this, and he smiled and thanked Allah the Exalted.\n\nLikewise, I met the Pole of the Age (قطب الزمان) in the year 593 AH in the city of Fez. Allah revealed him to me in a vision (واقعة) and made him known to me. We met one day in the Ibn Hayyun garden in Fez. He was among the group, unnoticed. He was a stranger from Bijaya, with a paralyzed hand. In the gathering were respected Shaykhs of Allah on the Path, among them Abu al-Abbas al-Hassar and others like him. When that entire group was present, they showed deference to us, and the discussion of the science of the Path was ours alone; no one else spoke of it. If they spoke among themselves, they referred back to me. The topic of the Poles was raised while he was in the group. I said to them: \"O brothers, I shall mention to you a wonder concerning the Pole of your time.\" That man whom Allah had shown me in my sleep to be the Pole of the Time—and he often visited us and loved us—turned to me and said: \"Say what Allah has revealed to you, but do not name the person designated to you in the vision.\" He smiled and said, \"Praise be to God.\" I then began to mention to the group what Allah had revealed to me concerning that man. The listeners were astonished, but I neither named nor specified him. We remained in the best company with the most generous brothers until the afternoon. I did not mention to the man that he was the one. When the gathering dispersed, that Pole came and said: \"May Allah reward you well. How beautifully you acted by not naming the person Allah revealed to you. Peace be upon you and the mercy of Allah.\" It was a farewell greeting, though I did not know it then, for I have not seen him in the city since.\n\nThe Muhammadan Poles are those who inherited Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم) in what was exclusive to him concerning the Laws and States that were not present in any preceding Law or Messenger. If a trait was present in a preceding Law, and it is part of his Law, or in a Messenger before him, and it is in him (صَلَّى اللهُ عَليهِ وسَلَّم), then that man is the inheritor of that specific Messenger, but he inherits it from Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم). He is attributed only to that Messenger, even if he is in this nation. Thus, he is called Musawi (Mosaic) if he inherits from Moses, or Isawi (Christic), or Ibrahimi (Abrahamic), or whatever Messenger or Prophet he inherits from. He is not attributed to Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم) unless he possesses the exclusive traits of Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم) as we have stated.\n\nThe most general exclusive trait is the absence of being restricted by a distinguishing Station (مقام). The Muhammadan Pole is distinguished only by having no defined Station (لا مقام له بتعين). His Station is *no station* (مقامه إن لا مقام). The meaning of this is what we shall clarify: A person may be overcome by his state (حالته) and is known only by it, attributed to it, and specified by it. But the Muhammadan Pole’s relation to the Stations is like the relation of the Names (الأسماء) to Allah. He is not specified by a Station to which he is attributed. Rather, in every moment (نفس), every time (زمان), and every state (حال), he takes the form required by that moment, time, or state. His restriction is not continuous, for the Divine rulings (الأحكام الإلهية) differ in every time, so he varies according to their variation, for He, the Mighty and Majestic, <<Every day He is in [some] affair>> (كُلَّ يَوْمٍ هُوَ في شَأْنٍ).\n\nLikewise is the Muhammadan Pole. This relates to His saying: <<Indeed in that is a reminder for whoever has a heart>> (إِنَّ في ذلِكَ لَذِكْرى‏ لِمَنْ كانَ لَهُ قَلْبٌ). He did not say 'intellect' (عقل) to restrict him. The heart (قلب) is only named so because of its constant turning (تقلبه) in states and affairs perpetually with the breaths (الأنفاس). Some servants of Allah know what they are turning in with every breath, and some are heedless of that.\n\n### [The Muhammadan Pole is he who turns with the breaths knowingly]\n\nThe Muhammadan Pole or the Solitary (المفرد) is he who turns with the breaths *knowingly* (علما), just as every creature of Allah turns with them *in state* (حالا). This man’s only increase is in the Knowledge (العلم) of what he is turning in and upon, not in the turning itself, for turning is an affair that flows through the entire World and within him, <<But most people do not know>> (وَلَكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ) this in detail and specification, even if they know it generally. Their Stations are according to their knowledge of what they turn in and upon. And Allah <<speaks the Truth and He guides to the Way>> (يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ). The explanation and elaboration of this chapter would be lengthy, so we have decided to limit ourselves to what we have mentioned, alluded to, and aimed for. In our mention is the clarification of their station. And Allah is the Granter of Success.",
    "ur": "باب نمبر چار سو باسٹھ: محمدی اقطاب (الأقطاب المحمديين) اور ان کے مقامات کے بیان میں\n\nیثربی وہ ہے جس کی کوئی صفت اسے محدود نہیں کرتی،\nنہ کوئی مقام (مقام) اور نہ کوئی حال (حال) اسے متعین کرتا ہے۔\n\nاس کی نشوونما مطلق طور پر آزاد ہے، وہ قائم ہو چکی ہے،\nلہٰذا ہم میں سے کوئی بھی اسے واضح نہیں کر سکتا۔\n\nجس نے کہا کہ اس کی کوئی صفت ہے، تو جب اس کی تخلیق ظاہر ہوتی ہے\nتو اسے اس کا علم نہیں ہوتا۔\n\nپس ہمارا علم، اگر ہم اسے جانیں، تو اس کی طرف اشارہ کرتا ہے،\nاور ہماری جہالت ہی میرے علم میں اسے زینت بخشتی ہے۔\n\n[بے شک انسان اپنے اعضاء اور اپنی تمام قوتوں کا ذمہ دار ہے]\n\nاللہ تعالیٰ نے فرشتوں اور ملأ اعلیٰ کے بارے میں فرمایا: \"اور ہم میں سے کوئی نہیں مگر اس کے لیے ایک مقام (مقام) معلوم ہے\" (وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ)۔ اور فرمایا: \"اے اہلِ یثرب! تمہارے لیے ٹھہرنے کی جگہ نہیں\" (يَا أَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ)۔ پس یہ آیت اس آیت سے مشابہت رکھتی ہے: \"اس جیسی کوئی چیز نہیں\" (لَيْسَ كَمِثْلِهِ شَيْءٌ)۔ یعنی یہ آیت دوسری آیت سے مشابہت رکھتی ہے۔ اور اقطاب (الأقطاب) کے باب کی اصل یہ ہے:\n\nنبی اکرم صلی اللہ علیہ وسلم کا فرمان ہے: \"تم میں سے ہر ایک نگہبان ہے\" (كُلُّكُمْ رَاعٍ)۔\n\nیہاں تک کہ انسان بھی اپنے اعضاء اور اپنی تمام قوتوں کا نگہبان ہے، خواہ وہ ظاہری (بادية) ہوں یا باطنی (حاضرة)۔\n\n[قطب (القطب) کا کیا معنی ہے]\n\nپس جان لو کہ دنیا میں معاملات بہت زیادہ اور مختلف ہیں۔ ہر وہ چیز جس پر کوئی معاملہ گھومتا ہے، وہ چیز اس معاملے کا قطب (قطب) ہے۔ اور کوئی چیز ایسی نہیں مگر وہ روح اور صورت سے مرکب ہے۔ لہٰذا ہر قطب (قطب) کے لیے روح اور صورت کا ہونا ضروری ہے۔ پس اس کی روح پر اس معاملے کی ارواح گھومتی ہیں جس کا یہ قطب ہے، اور اس قطب کی صورت پر اس معاملے کی صورت گھومتی ہے جس کا یہ قطب ہے۔ قطب کے ایک رُخ کو جنوبی (جنوبيا) کہا جاتا ہے، جو کہ روح ہے، اور دوسرے کو شمالی (شماليا) کہا جاتا ہے، جو کہ صورت ہے۔ عالم کی اقسام میں سے ایک قسم انسان ہیں، اور وہ عالم کی ہستی (الوجود) کا مقصود ہیں، لیکن قصدِ ثانی کے طور پر، نہ کہ قصدِ اول کے طور پر۔ اور جہاں تک قصدِ اول کا تعلق ہے، تو عالم کی ہستی کا مقصد اللہ کی عبادت ہے، یعنی وہ معرفت (المعرفۃ) کی عبادت جو کمالِ ہستی (الوجود) کے لیے پیدا ہوتی ہے۔ تاہم، عالم کی ہر صنف میں وہ (کمال) تام (مکمل) تو ہے مگر کامل (پرفیکٹ) نہیں۔ اور وہ کامل نہیں ہوا مگر اس کامل انسانی نشوونما (النشأة الإنسانية الكاملة) کے ذریعے۔ اور کاملہ کے علاوہ جو کچھ ہے، وہ حیوانی انسان ہے جسے تعریف کے لحاظ سے حیوانِ ناطق کہا جاتا ہے۔ اور اقطاب (الأقطاب) کاملین میں سے ہوتے ہیں۔\n\n[بے شک اللہ نے جسمانی عالم کو دو منزلوں میں بنایا ہے: دنیا اور آخرت]\n\nپھر اللہ نے جسمانی اور جسمی عالم کو دو منزلوں میں بنایا: ایک منزل جسے دنیا کہا جاتا ہے اور ایک منزل جسے آخرت کہا جاتا ہے۔ اور ان دونوں کے باشندے انسان اور جنات کو بنایا۔ اور ان دونوں میں قابلِ اعتبار انسان ہیں، اور انسانوں میں صرف کاملین (الکمل) قابلِ اعتبار ہیں۔ یہ وہی لوگ ہیں جن کا ذکر اللہ نے کیا ہے، وہ اپنے نفوس میں اس (ذکر) سے زیادہ نہیں کرتے۔ یہ ان کا اپنے نفوس میں اور اپنی خلوتوں میں زبان سے ذکر ہے۔ اور جہاں تک عموم کا تعلق ہے، تو وہ \"لا إله إلا الله\" ہے، پھر اس کے بعد ذکر کی مختلف اقسام ہیں، جیسے \"سبحان اللہ\" مقید اور مطلق، اور اسی طرح \"الحمد للہ\"، اور اسی طرح \"اللہ اکبر\"، اور اسی طرح \"لا حول ولا قوة إلا بالله\"۔ پس عالم کے اس مقصود صنف نے سب سے پہلے دونوں گھروں میں سے دارِ دنیا کو آباد کیا، اور ان کا ٹھکانہ اس میں مقررہ مدتوں کے ساتھ بنایا جو ان کی انتہا ہیں، پھر جب ان کی مدت پوری ہو جاتی ہے تو وہ دارِ آخرت کی طرف منتقل ہو جاتے ہیں۔ اور ان کی منتقلی دو طرح کی ہوتی ہے: ان میں سے کچھ وہ ہیں جو موت کے ذریعے منتقل ہوتے ہیں، جو کہ دنیاوی زندگی سے جدائی ہے، پھر وہ آخرت کی زندگی کے ساتھ زندہ ہوتے ہیں۔ اور ان میں سے کچھ وہ ہیں جو دنیاوی زندگی کے ساتھ بغیر موت کے منتقل ہوتے ہیں، اور وہ خاص طور پر اللہ کی راہ میں شہید (الشهيد) ہیں۔ اور ان کے بارے میں یہ نہیں کہا جاتا کہ وہ میت سے افضل ہیں، مگر یہ کہ وہ بعض مردوں سے افضل ہیں۔ پھر اللہ نے اس انسانی صنف کو دنیا میں بہت سی امتوں میں تقسیم کیا، پھر ہر امت میں ایک رسول بھیجا تاکہ انہیں وہ معاملہ سکھائے جس کے لیے وہ پیدا کیے گئے ہیں، اور انہیں سکھائے کہ ذات حق (الحق) کا ان پر کیا حق ہے کہ وہ کیا کریں، اور اگر وہ ایسا کریں تو دارِ آخرت میں اللہ کے ہاں ان کے لیے کیا بھلائی ہے، اور اگر وہ ایسا نہ کریں تو دارِ دنیا میں اللہ کے ہاں ان پر کیا سزا ہے، جب ان کے حکام کو اس کا علم ہو جائے، اور آخرت میں بھی۔ پھر اللہ نے ان میں فضیلت رکھی، تو ان میں سے بعض امتوں میں فاضل (فضیلت والے) اور افضل (بہترین) ہیں، اور رسولوں میں بھی۔ اور امتوں کا اختتام امتِ محمد صلی اللہ علیہ وسلم پر کیا، اور انہیں \"بہترین امت جو لوگوں کے لیے نکالی گئی\" (خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ) بنایا۔ اور محمد صلی اللہ علیہ وسلم پر تمام رسولوں کا سلسلہ ختم کیا، اور ان کی شریعت پر تمام شرائع کا اختتام کیا، لہٰذا ان کے بعد کوئی رسول نہیں جو شریعت لائے، اور نہ ہی ان کی شریعت کے بعد اللہ کی طرف سے کوئی شریعت نازل ہو گی، سوائے اس کے جو ان کی شریعت نے مقرر کیا ہے، یعنی ان کی امت کے علماء کا اجتہاد (اجتہاد) جو ان کی کتاب اور ان کے نبی کی سنت سے احکام اخذ کرتے ہیں۔ اور سنت سے میری مراد حدیث ہے، نہ کہ قیاس (قياس)۔ اور یہاں قیاس سے میری مراد فرع کا فرع پر قیاس ہے، نہ کہ فرع کا اصل پر قیاس۔ کیونکہ فرع کا اصل پر قیاس وہ استنباط ہے جو اجتہاد سے ثابت ہوا ہے اور جسے فقہاء نے چوتھی اصل بنایا ہے، جیسا کہ انہوں نے اجماع (الإجماع) کو تیسری اصل بنایا ہے، اور وہ صدر اول (الصدر الأول) کا اجماع ہے۔ اور انہوں نے کہا کہ انہوں نے کسی معاملے پر اجماع نہیں کیا مگر یہ کہ انہیں اس میں کوئی نص ضرور معلوم ہو گی جس کی طرف وہ رجوع کرتے ہوں گے، اگرچہ وہ ہم تک نہیں پہنچی، لیکن ہمیں اس پر یقین ہے۔ کیونکہ یہ ناممکن ہے کہ وہ کسی ایسے حکم پر متفق ہو جائیں جس میں ان کے لیے کوئی نص نہ ہو، کیونکہ ان کی آراء اور فطرتیں مختلف ہوتی ہیں، لہٰذا اختلاف کا ہونا ضروری ہے۔ اور انہوں نے کسی معاملے پر اجماع کیا ہے، تو وہ حکم ہمارے نزدیک یقینی ہے کہ وہ اس میں رسول صلی اللہ علیہ وسلم کی کسی نص پر تھے۔ اور صدر اول (الصدر الأول) کے اجماع کے بعد کوئی حکم اجماع سے ثابت نہیں ہوتا۔ پس جب معاملہ اس باب میں ہمارے مقرر کردہ اصول کے مطابق ہے، تو ہم نے محمدی اقطاب (الأقطاب المحمديين) کے ذکر میں مشغولیت اختیار کی، کیونکہ محمد صلی اللہ علیہ وسلم قیامت کے دن لوگوں کے سردار ہوں گے، اور وہ اور ان کی امت آخری ہونے کے باوجود اولین ہیں۔ لہٰذا ہم نے رسولوں میں محمد صلی اللہ علیہ وسلم کو اور امتوں میں ان کی امت کو معتبر جانا۔\n\n[محمدی اقطاب (الأقطاب المحمديين) دو قسم کے ہیں]\n\nاور جان لو کہ محمدی اقطاب (الأقطاب المحمديين) دو قسم کے ہیں: اقطاب جو آپ کی بعثت کے بعد ہوئے، اور اقطاب جو آپ کی بعثت سے پہلے ہوئے۔ پس وہ اقطاب جو آپ کی بعثت سے پہلے تھے، وہ رسول تھے، اور وہ تین سو تیرہ رسول ہیں۔ اور جہاں تک آپ کی امت کے اقطاب کا تعلق ہے جو آپ کی بعثت کے بعد سے قیامت تک ہوں گے، تو وہ بارہ قطب (قطبا) ہیں۔ اور دو ختم (الختمان) ان اقطاب سے خارج ہیں، وہ مفردین (المفردين) میں سے ہیں۔ اور کتاب کے آخر میں ختم (الختم) کا ذکر آئے گا، اور اس باب کے بعد ان شاء اللہ بارہ اقطاب کا ذکر تفصیل سے آئے گا۔\n\n[محمدی اقطاب (الأقطاب المحمديين) کے مقامات جو کہ رسول ہیں]\n\nبہرحال، محمدی اقطاب (الأقطاب المحمديين) کے مقامات جو کہ رسول ہیں، اللہ کی صلواتیں ان سب پر ہوں، ان کے مقامات پر بات کرنے کا ہمارے پاس کوئی راستہ نہیں ہے، کیونکہ ہماری گفتگو ذوق (ذوق) پر مبنی ہوتی ہے، اور ہمیں رسولوں علیہم السلام کے مقامات میں کوئی ذوق حاصل نہیں ہے۔ بلکہ ہمارے اذواق خاص طور پر وراثت (الوراثۃ) میں ہیں۔ پس رسولوں کے بارے میں صرف رسول ہی بات کر سکتا ہے، اور انبیاء کے بارے میں صرف نبی یا رسول ہی بات کر سکتا ہے، اور وارثین (الوارثين) کے بارے میں صرف رسول، یا نبی، یا ولی، یا وہ جو ان میں سے ہو، بات کر سکتا ہے۔ یہ الٰہی ادب ہے۔ پس رسولوں کے مراتب صرف ختمِ عام (الختم العام) سے ہی معلوم ہو سکتے ہیں، جس کے ذریعے اللہ آخر زمانے میں ولایتِ عامہ (الولایۃ العامۃ) کو ختم کرے گا، اور وہ عیسیٰ بن مریم روح اللہ ہیں۔ اگر ان سے اس بارے میں پوچھا جائے تو وہ ان کی اور ان کی فضیلتوں کی ترجمانی کریں گے، کیونکہ وہ ان میں سے ایک رسول ہیں۔ لیکن ہمارے لیے اس کا کوئی راستہ نہیں ہے۔ پس ہماری گفتگو ان امتوں کے اقطاب (الأقطاب) کے بارے میں ہے جو اپنے انبیاء اور ان کی رسالت کے وارث ہیں، اور اس متاخر محمدی امت کے اقطاب کے بارے میں ہے جسے تمام سابقہ امتوں پر خیریت (الخيرية) سے موسوم کیا گیا ہے، خواہ وہ ان کے مومن ہوں یا کافر۔ پس ان کا کافر سابقہ امتوں کے کافروں سے زیادہ برا ہے، اور ان کا مومن سابقہ امتوں کے مومنوں سے بہتر ہے۔ ان کے لیے تقدم ہے، جیسا کہ قریش کے بارے میں خبر میں آیا ہے کہ وہ خیر اور شر میں تمام قبائل پر مقدم ہیں۔ اور امامت ان میں رکھی گئی ہے، خواہ وہ عدل کریں یا ظلم۔ اگر وہ عدل کریں تو ان کی رعایا کے لیے اور ان کے لیے ہے، اور اگر وہ ظلم کریں تو ان کی رعایا کے لیے اور ان پر ہے، یعنی وہ حقوق اللہ اور ان لوگوں کے حقوق جن کا اللہ نے انہیں نگہبان بنایا، ان میں جو کوتاہی کرتے ہیں۔ پس اس منتخب محمدی امت کے اقطاب (الأقطاب) سابقہ امتوں کے متقدم اقطاب پر مقدم ہیں، یعنی وہ اقطاب جو وارث ہیں اور اپنے رسولوں کے آثار کی پیروی کرتے ہیں۔ پھر ہم واپس آتے ہیں اور کہتے ہیں کہ اس محمدی امت کے اقطاب مختلف اقسام پر ہیں۔ اور اقطاب سے میری مراد وہ نہیں ہیں جن میں سے ہر زمانے میں صرف ایک ہی ہوتا ہے، بلکہ ہم اس کا ذکر اس باب کے بعد والے باب میں بارہ اقطاب (الاثني عشر قطبا) کے ضمن میں کریں گے۔ بلکہ میں محمدی اقطاب (الأقطاب المحمديين) میں ہر اس شخص کا ذکر کر رہا ہوں جس پر کسی علاقے یا جہت میں لوگوں کی ایک جماعت کا معاملہ گھومتا ہے، جیسے سات اقلیموں میں ابدال (الإبدال)، ہر اقلیم کا ایک بدل (بدل) ہوتا ہے جو اس اقلیم کا قطب (قطب) ہوتا ہے۔ اور جیسے چار اوتاد (الأوتاد الأربعة)، ان کے لیے چار جہتیں ہیں جنہیں اللہ ان کے ذریعے محفوظ رکھتا ہے، مشرق، مغرب، جنوب اور شمال، ہر جہت کے لیے ایک وتد (وتد) ہے۔ اور جیسے بستیوں کے اقطاب (أقطاب القرى)، ہر بستی میں اللہ کا ایک ولی ضرور ہوتا ہے جس کے ذریعے اللہ اس بستی کو محفوظ رکھتا ہے، خواہ وہ بستی کافر ہو یا مومن، تو وہ ولی اس کا قطب ہوتا ہے۔ اور اسی طرح اصحابِ مقامات (أصحاب المقامات)، زاہدوں کے لیے ایک قطب کا ہونا ضروری ہے جس پر ان کے زمانے کے زہد کا مدار ہو۔ اور اسی طرح توکل، محبت، معرفت (المعرفۃ) اور دیگر مقامات (المقامات) اور احوال (الأحوال) میں بھی، ان کے ہر صنف کے ارباب میں ایک قطب کا ہونا ضروری ہے جس پر وہ مقام گھومتا ہو۔ اور اللہ تعالیٰ نے مجھے متوکلین کے قطب (قطب المتوكلين) پر مطلع فرمایا، تو میں نے دیکھا کہ توکل اس پر گھوم رہا ہے، گویا وہ چکی ہے جو اپنے قطب پر گھومتی ہے۔ اور وہ عبداللہ بن الاستاذ الموروری تھے، جو اندلس کے علاقے میں مورور شہر سے تھے۔ وہ اپنے زمانے میں توکل کے قطب تھے، میں نے انہیں دیکھا اور ان کی صحبت اختیار کی، اللہ کے فضل اور میرے لیے کشف (الکشف) کے ذریعے، اور جب میں ان سے ملا تو میں نے انہیں اس سے آگاہ کیا، تو وہ مسکرائے اور اللہ کا شکر ادا کیا۔ اور اسی طرح میں سنہ پانچ سو ترانوے (۵۹۳ھ) میں فاس شہر میں قطبِ زمان (قطب الزمان) سے ملا۔ اللہ نے مجھے ایک واقعہ (واقعۃ) میں ان پر مطلع فرمایا اور مجھے ان سے متعارف کرایا۔ پس ہم ایک دن فاس شہر میں ابن حیون کے باغ میں جمع ہوئے، اور وہ جماعت میں تھے، ان پر کوئی خاص توجہ نہیں دی جاتی تھی۔ وہ جماعت میں حاضر ہوئے اور بجایہ کے رہنے والے ایک غریب شخص تھے، ان کا ہاتھ شل تھا۔ اور مجلس میں ہمارے ساتھ اللہ کے معتبر شیوخ بھی تھے، جو طریقِ الٰہی میں معتبر تھے، ان میں ابو العباس الحصار اور ان جیسے دیگر شامل تھے۔ اور جب وہ پوری جماعت حاضر ہوتی تھی تو وہ ہمارے ساتھ ادب سے پیش آتے تھے، اور مجلس صرف ہمارے لیے ہوتی تھی، اور علمِ طریق (علم الطريق) میں میرے علاوہ کوئی بات نہیں کرتا تھا، اور اگر وہ آپس میں بات کرتے تو اس میں میری طرف رجوع کرتے۔ پس اقطاب (الأقطاب) کا ذکر شروع ہوا، اور وہ جماعت میں موجود تھے۔ تو میں نے ان سے کہا: \"اے میرے بھائیو! میں تمہیں تمہارے زمانے کے قطب کے بارے میں ایک عجیب بات بتاتا ہوں۔\" تو وہ شخص جس کو اللہ نے مجھے خواب میں دکھایا تھا کہ وہ وقت کا قطب ہے، اور جو ہمارے پاس کثرت سے آتا تھا اور ہم سے محبت کرتا تھا، میری طرف متوجہ ہوا اور مجھ سے کہا: \"جو کچھ اللہ نے آپ پر ظاہر کیا ہے وہ بیان کریں، لیکن اس شخص کا نام نہ لیں جسے آپ کے لیے واقعہ میں متعین کیا گیا ہے۔\" اور وہ مسکرایا اور کہا: \"الحمد للہ۔\" پس میں نے جماعت کے سامنے اس شخص کے بارے میں وہ بات ذکر کرنا شروع کی جو اللہ نے مجھ پر ظاہر کی تھی۔ سننے والے حیران ہوئے، اور میں نے نہ تو اس کا نام لیا اور نہ ہی اسے متعین کیا۔ اور ہم عصر تک بہترین مجلس میں معزز بھائیوں کے ساتھ رہے، اور میں نے اس شخص کو یہ نہیں بتایا کہ وہ خود ہے۔ پھر جب جماعت منتشر ہوئی تو وہ قطب آیا اور کہا: \"اللہ آپ کو جزائے خیر دے، آپ نے کتنا اچھا کیا کہ اس شخص کا نام نہیں لیا جس پر اللہ نے آپ کو مطلع کیا تھا۔ والسلام علیکم ورحمۃ اللہ۔\" اور یہ سلام وداع کا تھا، اور مجھے اس کا علم نہیں تھا۔ اس کے بعد میں نے اسے شہر میں اب تک نہیں دیکھا۔ پس محمدی اقطاب (الأقطاب المحمديون) وہ ہیں جنہوں نے محمد صلی اللہ علیہ وسلم کی ان شرائع اور احوال میں وراثت پائی جو آپ کے ساتھ خاص تھیں، جو نہ تو آپ سے پہلے کسی شریعت میں تھیں اور نہ ہی آپ سے پہلے کسی رسول میں۔ اور اگر وہ کسی ایسی شریعت میں تھیں جو آپ کی شریعت سے پہلے تھی، اور وہ آپ کی شریعت میں بھی ہے، یا آپ سے پہلے کسی رسول میں تھی اور آپ صلی اللہ علیہ وسلم میں بھی ہے، تو وہ شخص اس مخصوص رسول کا وارث ہے، لیکن محمد صلی اللہ علیہ وسلم کی طرف سے۔ پس اس کی نسبت صرف اسی رسول کی طرف کی جائے گی، اگرچہ وہ اس امت میں ہو۔ تو اسے موسوی کہا جائے گا اگر وہ موسیٰ علیہ السلام سے ہو، یا عیسوی، یا ابراہیمی، یا جو بھی رسول یا نبی ہو۔ اور محمد صلی اللہ علیہ وسلم کی طرف نسبت صرف اسی کی کی جائے گی جو اس مقام پر ہو جس کا ہم نے ذکر کیا، یعنی وہ جو محمد صلی اللہ علیہ وسلم کے ساتھ خاص ہو۔ اور اختصاص میں اس سے زیادہ عام کوئی چیز نہیں کہ وہ کسی ایسے مقام سے مقید نہ ہو جس سے وہ ممتاز ہو۔ پس محمدی (المحمدي) صرف اس بات سے ممتاز ہوتا ہے کہ اس کا کوئی متعین مقام (مقام) نہیں ہوتا۔ پس اس کا مقام یہ ہے کہ کوئی مقام نہ ہو۔ اور اس کا معنی وہ ہے جو ہم واضح کریں گے، اور وہ یہ ہے کہ انسان پر اس کا حال (حال) غالب آ جاتا ہے، تو وہ صرف اسی سے پہچانا جاتا ہے، اور اسی کی طرف منسوب ہوتا ہے اور اسی سے متعین ہوتا ہے۔ اور محمدی (المحمدي) کی طرف مقامات کی نسبت ایسی ہے جیسے اللہ کے لیے اسماء کی نسبت۔ پس وہ کسی ایسے مقام میں متعین نہیں ہوتا جس کی طرف اس کی نسبت کی جائے، بلکہ وہ ہر سانس میں، ہر زمانے میں، اور ہر حال میں اس صورت میں ہوتا ہے جس کا وہ سانس، یا زمانہ، یا حال تقاضا کرتا ہے۔ پس اس کی قید مستقل نہیں رہتی، کیونکہ الٰہی احکام ہر زمانے میں مختلف ہوتے ہیں، تو وہ ان کے اختلاف کے ساتھ مختلف ہوتا ہے۔ کیونکہ وہ عزوجل \"ہر دن ایک نئی شان میں ہے\" (كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ)۔ اور اسی طرح محمدی (المحمدي) بھی ہے۔ اور یہ اللہ تعالیٰ کا فرمان ہے: \"بے شک اس میں اس شخص کے لیے نصیحت ہے جس کے پاس دل ہو\" (إِنَّ فِي ذَلِكَ لَذِكْرَى لِمَنْ كَانَ لَهُ قَلْبٌ)۔ اور یہ نہیں فرمایا کہ عقل ہو، تاکہ اسے مقید نہ کرے۔ اور قلب (دل) کو قلب اسی لیے کہا جاتا ہے کہ وہ ہمیشہ سانسوں کے ساتھ احوال اور معاملات میں پلٹتا رہتا ہے۔ پس اللہ کے بندوں میں سے کچھ وہ ہیں جو جانتے ہیں کہ وہ ہر سانس میں کس چیز میں پلٹ رہے ہیں، اور کچھ اس سے غافل ہوتے ہیں۔\n\n[محمدی قطب (القطب المحمدي) وہ ہے جو سانسوں کے ساتھ علمی طور پر پلٹتا ہے]\n\nپس محمدی قطب (القطب المحمدي) یا مفرد (المفرد) وہ ہے جو سانسوں کے ساتھ علمی طور پر پلٹتا ہے، جیسا کہ اللہ کی ہر مخلوق اس کے ساتھ حالی طور پر پلٹتی ہے۔ پس اس شخص کی زیادتی صرف اس علم کی وجہ سے ہے کہ وہ کس چیز میں اور کس پر پلٹ رہا ہے، نہ کہ پلٹنے کی وجہ سے۔ کیونکہ پلٹنا ایک ایسا امر ہے جو پورے عالم میں اور اس میں جاری ہے، \"لیکن اکثر لوگ نہیں جانتے\" (وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ) اس کی تفصیل اور تعین کو، اگرچہ وہ اسے اجمالی طور پر جانتے ہیں۔ پس ان کے مقامات ان کے علم کے مطابق ہیں کہ وہ کس چیز میں اور کس پر پلٹ رہے ہیں۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔ اور اس باب کی شرح اور تفصیل طویل ہے، لہٰذا ہم نے اسی پر اکتفا کیا جو ہم نے ذکر کیا اور جس کی طرف اشارہ کیا اور جس کا ارادہ کیا۔ اور ہمارے ذکر میں ان کے مقام کی وضاحت کے ساتھ ان کا ذکر ہے۔ اور اللہ ہی توفیق کا ذمہ دار ہے۔",
    "fa": "«باب چهارصد و شصت و دوم در اقطاب محمدی و منازل ایشان»\n\nیثربی (قطب) که وصفی او را در بند نمی‌کشد *** و نه مقامی و نه حالی او را معین می‌سازد\n\nنشأت او بر اطلاق، عنان گسیخته *** برپا شده است و هیچ‌یک از ما او را آشکار نمی‌سازد\n\nهر کس گوید او را وصفی است، نزد ما علمی به او ندارد، آنگاه که تکوین او آشکار می‌شود\n\nپس علم ما، اگر او را بشناسیم، به او اشاره می‌کند *** و جهل ما، در علم من، او را زینت می‌بخشد\n\n[انسان در برابر جوارح و تمامی قوای خود مسئول است]\n\nخداوند متعال درباره فرشتگان و ملأ اعلی فرمود: «و هیچ‌یک از ما نیست مگر آنکه برای او مقامی معلوم است» (وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ). و فرمود: «ای اهل یثرب، برای شما جای ماندن نیست» (يَا أَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ). پس این [حال] شبیه است به: «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْءٌ). یعنی این آیه شبیه آیه دیگر است و اصل باب اقطاب،\n\nسخن پیامبر (صلی الله علیه و سلم) است که فرمود: «همه شما شبانید (مسئولید)».\n\nحتی انسان بر جوارح و تمامی قوای خود، چه بادیه (ظاهر) که آشکار است و چه حاضرة (باطن) که پنهان است، مسئول است.\n\n[معنای قطب چیست]\n\nپس بدان که امور در عالم بسیار و متفاوتند. هر چیزی که امری از امور بر محور آن می‌چرخد، آن چیز قطب آن امر است. و هیچ چیزی نیست مگر آنکه از روح و صورت ترکیب یافته است. پس ناگزیر هر قطبی باید روح و صورتی داشته باشد. روح آن قطب، ارواح آن امری را که این قطبِ آن است، بر محور خود می‌چرخاند؛ و صورت آن قطب، صورت آن امری را که این قطبِ آن است، بر محور خود می‌چرخاند. یک روی قطب، جنوبی نامیده می‌شود که همان روح است، و روی دیگر شمالی نامیده می‌شود که همان صورت است. از جمله اصناف عالم، انسان‌ها هستند که مقصود از وجود عالم به قصد دوم هستند، نه به قصد اول. اما قصد اول، مقصود از وجود عالم، عبادت خداوند است؛ یعنی عبادت معرفت (المعرفة) که برای کمال هستی (الوجود) پدید می‌آید. با این حال، در هر صنفی از اصناف عالم، [آن صنف] تام است اما کامل نیست، و کامل نشد مگر با این نشأت انسانی کامل (النشأة الإنسانية الكاملة). و آنچه غیر از کامل است، همان انسان حیوانی است که در تعریف، حیوان ناطق نامیده می‌شود. و اقطاب از جمله کاملان هستند.\n\n[خداوند عالم جسمانی را در دو منزل، دنیا و آخرت، قرار داد]\n\nسپس خداوند عالم جسمی و جسمانی را در دو منزل قرار داد: منزلی که دنیا نامیده می‌شود و منزلی که آخرت نامیده می‌شود. و ساکنان آن دو را انس و جن قرار داد، و معتبر در آن دو، انس است، و معتبر از انس، کاملان هستند و نه غیر ایشان. ایشان کسانی هستند که خداوند آنان را ذکر کرده است و در نفوس خود بر آن نمی‌افزایند. این ذکر ایشان در نفوس و خلوت‌هایشان با زبان است. اما در عموم، «لا إله إلا الله» است، و سپس انواع ذکر از «سبحان الله» مقید و مطلق، و «الحمد لله» به همین ترتیب، و «الله اکبر» به همین ترتیب، و «لا حول ولا قوة إلا بالله» به همین ترتیب. پس خداوند با این صنف مقصود از عالم، ابتدا دار دنیا را از میان دو سرا آباد کرد و سکونت آنان را در آن با آجال (مدت‌های) معینی قرار داد که به آن پایان می‌رسند. سپس پس از پایان مدتشان به دار آخرت منتقل می‌شوند. و انتقال آنان بر دو نوع است: برخی با مرگ منتقل می‌شوند که همان مفارقت از حیات دنیاست و با حیات آخرت زنده می‌شوند؛ و برخی با حیات دنیا و بدون مرگ منتقل می‌شوند که به طور خاص شهید در راه خداست. و آنچه درباره او گفته می‌شود که از مرده بهتر است، این است که او از برخی مردگان بهتر است. سپس خداوند این صنف انسانی را در دنیا امت‌های بسیاری قرار داد، و سپس در هر امتی رسولی برانگیخت تا به آنان بیاموزد که امری که برای آن خلق شده‌اند چیست، و به آنان بیاموزد که حق (الحق) بر عهده آنان چه کارهایی است که باید انجام دهند، و اگر آن کارها را انجام دهند چه خیری نزد خداوند در دار آخرت برایشان خواهد بود، و اگر انجام ندهند چه عقوبتی نزد خداوند در دار دنیا (اگر والیان امرشان بدانند) و در آخرت بر عهده آنان است. سپس فضیلت را در میان آنان قرار داد، پس برخی از امت‌ها و از رسولان فاضل و افضل هستند. و امت‌ها را با امت محمد (صلی الله علیه و سلم) ختم کرد و آنان را «بهترین امتی که برای مردم پدیدار شده است» (خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ) قرار داد. و تمامی رسولان (علیهم السلام) را با محمد (صلی الله علیه و سلم) ختم کرد، و تمامی شرایع را با شریعت او ختم کرد. پس نه رسولی بعد از او تشریع می‌کند و نه شریعتی بعد از شریعت او از نزد خداوند نازل می‌شود، مگر آنچه شریعت او از اجتهاد (الاجتهاد) علمای امتش در استنباط احکام از کتاب و سنت پیامبرش مقرر کرده است. و منظورم از سنت، حدیث است نه قیاس. و منظورم از قیاس در اینجا، قیاس فرع بر فرع است، نه قیاس فرع بر اصل. زیرا قیاس فرع بر اصل همان استنباطی است که با اجتهاد ثابت شده و فقها آن را اصل چهارم قرار داده‌اند، همان‌گونه که اجماع را اصل سوم قرار داده‌اند، و آن اجماع صدر اول است. و گفته‌اند که آنان بر امری اجماع نکردند مگر آنکه ناگزیر باید نصی را در آن می‌دانستند که به آن رجوع کنند، هرچند آن نص به ما نرسیده باشد، با وجود قطع ما به آن. زیرا محال است که بر حکمی اجماع کنند که نصی برایشان در آن نباشد، چرا که نظرها و فطرت‌هایشان متفاوت است و ناگزیر باید اختلاف وجود داشته باشد. و چون بر امری اجماع کرده‌اند، آن حکم نزد ما قطعی است که آنان در آن بر نصی از رسول (صلی الله علیه و سلم) بوده‌اند. و پس از اجماع صدر اول، حکمی با اجماع وجود ندارد. پس چون امر بر این منوال است که در این باب مقرر کردیم، به ذکر اقطاب محمدی (الأقطاب المحمديين) پرداختیم، به دلیل اینکه محمد (صلی الله علیه و سلم) سرور مردم در روز قیامت است و او و امتش، آخرینانِ اولین هستند. پس از رسولان، محمد (صلی الله علیه و سلم) را معتبر دانستیم و از امت‌ها، امت او را.\n\n[اقطاب محمدی بر دو نوع هستند]\n\nو بدان که اقطاب محمدی (الأقطاب المحمديين) بر دو نوع هستند: اقطاب پس از بعثت او و اقطاب پیش از بعثت او. اقطابی که پیش از بعثت او بودند، همان رسولان هستند و تعدادشان سیصد و سیزده رسول است. اما اقطاب از امت او که پس از بعثت او تا روز قیامت بوده‌اند، دوازده قطب هستند. و دو ختم (الختمان) از این اقطاب خارج هستند و از مفردین (المفردين) به شمار می‌آیند. ذکر ختم در آخر کتاب خواهد آمد و ذکر دوازده قطب به طور کامل، ان‌شاءالله تعالی، پس از این باب خواهد آمد.\n\n[منازل اقطاب محمدی که همان رسولان هستند]\n\nاما منازل اقطاب محمدی (الأقطاب المحمديين) که همان رسولان (صلوات الله علیهم اجمعین) هستند، ما را راهی به سخن گفتن درباره منازل ایشان نیست، زیرا سخن ما از ذوق (تجربه عرفانی) است و ما را در مقامات رسولان (علیهم السلام) ذوقی نیست. ذوق‌های ما تنها در وراثت است. پس در مورد رسولان سخن نمی‌گوید مگر رسول، و در مورد انبیا سخن نمی‌گوید مگر نبی یا رسول، و در مورد وارثان سخن نمی‌گوید مگر رسول یا نبی یا ولی یا کسی که از ایشان باشد. این است ادب الهی. پس مراتب رسولان شناخته نمی‌شود مگر از طریق ختم عام (الختم العام) که خداوند ولایت عامه را در آخرالزمان با او ختم می‌کند، و او عیسی بن مریم، روح الله است. اگر از او درباره آن سؤال شود، او از ایشان و از برتری‌هایشان ترجمه می‌کند، زیرا او خود رسولی از ایشان است. اما ما را راهی به آن نیست. پس سخن ما درباره اقطاب امت‌هاست که وارثان پیامبران و رسالت‌هایشان هستند، و درباره اقطاب این امت محمدی متأخر که به خیریت بر تمامی امت‌های پیشین، مؤمنان و کافرانشان، توصیف شده است. کافر این امت بدتر از کافران امت‌های دیگر است و مؤمن این امت بهتر از مؤمنان امت‌های دیگر است. پس آنان تقدم دارند، چنانکه در خبر درباره قریش آمده است که آنان در خیر و شر بر تمامی قبایل مقدم هستند. و امامت را در میان آنان قرار داد، چه عدالت ورزند و چه ستم کنند. اگر عدالت ورزند، برای رعیتشان و خودشان است، و اگر ستم کنند، برای رعیتشان و بر عهده خودشان است؛ یعنی آنچه را که در حقوق خداوند و حقوق کسانی که خداوند آنان را بر ایشان گماشته است، کوتاهی کرده‌اند. پس اقطاب این امت برگزیده، بر اقطاب پیشین در امت‌های گذشته مقدم هستند؛ منظورم اقطاب وارثی است که پیرو آثار رسولان خود هستند. سپس باز می‌گردیم و می‌گوییم که اقطاب این امت محمدی بر اقسام مختلفی هستند. و منظورم از اقطاب، کسانی نیستند که در هر عصری تنها یکی از آنان باشد؛ بلکه آن را در باب بعدی در مورد دوازده قطب ذکر خواهیم کرد. بلکه در اقطاب محمدی، هر کسی را ذکر می‌کنم که امر جماعتی از مردم در یک اقلیم یا جهت بر محور او می‌چرخد، مانند ابدال (الإبدال) در اقلیم‌های هفت‌گانه که برای هر اقلیمی بدلی است که قطب آن اقلیم است، و مانند اوتاد (الأوتاد) چهارگانه که چهار جهت دارند و خداوند آنها را به واسطه ایشان حفظ می‌کند، از شرق و غرب و جنوب و شمال، که برای هر جهتی وتدی است. و مانند اقطاب روستاها، که ناگزیر در هر روستایی ولی‌ای از جانب خداوند متعال وجود دارد که خداوند به واسطه او آن روستا را حفظ می‌کند، چه آن روستا کافر باشد و چه مؤمن؛ آن ولی قطب آنجاست. و همچنین اصحاب مقامات، که ناگزیر زاهدان را قطبی است که مدار زهد در اهل زمانش بر او می‌چرخد. و همچنین در توکل، محبت، معرفت (المعرفة) و سایر مقامات و احوال، ناگزیر در هر صنف از ارباب آن، قطبی وجود دارد که آن مقام بر محور او می‌چرخد. و خداوند متعال مرا بر قطب متوکلان آگاه ساخت، پس دیدم که توکل بر محور او می‌چرخد، گویی آسیاب است که بر قطب خود می‌گردد. و او عبدالله بن الأستاذ الموروری از شهر مورور در سرزمین اندلس بود. او قطب توکل در زمان خود بود. او را به فضل خداوند و کشف (الکشف) او برای من، مشاهده و مصاحبت کردم. و هنگامی که با او ملاقات کردم، او را از این امر آگاه ساختم، پس تبسم کرد و خداوند متعال را شکر گفت. همچنین با قطب زمان در سال پانصد و نود و سه در شهر فاس ملاقات کردم. خداوند مرا در یک واقعه بر او آگاه ساخت و او را به من شناساند. پس روزی در باغ ابن حیون در شهر فاس با هم جمع شدیم، در حالی که او در میان جماعت بود و به او توجهی نمی‌شد. او در جماعت حاضر شد و غریبی از اهل بجایه بود که دستش فلج بود. در آن مجلس با ما مشایخی از اهل الله بودند که در طریق خدا معتبر بودند، از جمله ابوالعباس الحصار و امثال او. و تمامی آن جماعت، هنگامی که حاضر می‌شدند، با ما ادب می‌ورزیدند و مجلس جز برای ما نبود و هیچ‌کس در علم طریقت در میان آنان جز من سخن نمی‌گفت، و اگر در میان خود سخن می‌گفتند، در آن به من رجوع می‌کردند. پس ذکر اقطاب مطرح شد، در حالی که او در جماعت بود. به آنان گفتم: ای برادرانم، من برای شما درباره قطب زمانتان شگفتی‌ای را ذکر می‌کنم. پس به آن مردی که خداوند در خواب به من نشان داده بود که او قطب وقت است، التفات کرد و او که زیاد نزد ما می‌آمد و ما را دوست می‌داشت، به من گفت: آنچه خداوند تو را بر آن آگاه ساخته بگو، و شخصی را که در واقعه برایت معین شده نام نبر. و تبسم کرد و گفت: الحمد لله. پس شروع کردم به ذکر آنچه خداوند مرا بر آن از امر آن مرد آگاه ساخته بود برای جماعت. شنوندگان تعجب کردند و من او را نام نبردم و معین نکردم. و ما در بهترین مجلس با گرامی‌ترین برادران تا عصر ماندیم و به آن مرد نگفتم که او همان شخص است. هنگامی که جماعت پراکنده شدند، آن قطب آمد و گفت: خداوند به تو جزای خیر دهد، چه نیکو کردی که شخصی را که خداوند تو را بر او آگاه ساخت، نام نبردی. و السلام علیک و رحمة الله. و این سلام وداع بود و من از آن خبر نداشتم. پس از آن او را تا کنون در شهر ندیدم. پس اقطاب محمدی (الأقطاب المحمديون) کسانی هستند که محمد (صلی الله علیه و سلم) را در آنچه به او اختصاص داشت از شرایع و احوال، که در شریعت پیش از او و در رسول پیش از او نبوده است، به ارث برده‌اند. اگر [آن امر] در شریعتی پیش از شریعت او بوده و آن [شریعت] از شریعت او باشد، یا در رسولی پیش از او بوده و او (صلی الله علیه و سلم) در آن باشد، آن مرد وارث آن رسول مخصوص است، اما از محمد (صلی الله علیه و سلم). پس او جز به آن رسول نسبت داده نمی‌شود، و اگر در این امت باشد، به او موسوی گفته می‌شود اگر از موسی باشد، یا عیسوی یا ابراهیمی، یا هر رسول یا نبی دیگری که باشد. و جز کسی که در مرتبه آنچه گفتیم و مختص به محمد (صلی الله علیه و سلم) است، به محمد (صلی الله علیه و سلم) نسبت داده نمی‌شود. و در اختصاص، چیزی عام‌تر از عدم تقیید به مقامی که با آن متمایز شود، نیست. پس محمدی (المحمدي) متمایز نمی‌شود مگر به اینکه مقامی معین ندارد. پس مقام او این است که لا مقام (مقامی ندارد) است. و معنای آن چیزی است که بیان می‌کنیم، و آن این است که ممکن است حالتی بر انسان غلبه کند، پس جز با آن شناخته نشود و به آن نسبت داده شود و با آن معین گردد. اما نسبت مقامات به محمدی، مانند نسبت اسماء به حق (الله) است. پس او در مقامی که به آن نسبت داده شود، معین نمی‌گردد، بلکه او در هر نفس، در هر زمان و در هر حال، به صورت آنچه آن نفس یا زمان یا حال اقتضا می‌کند، ظاهر می‌شود. پس تقیید او مستمر نیست، زیرا احکام الهی در هر زمان متفاوت است و او نیز با اختلاف آنها متفاوت می‌شود، زیرا او عز و جل «هر روز در کاری است» (كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ). و محمدی نیز چنین است، و این همان سخن خداوند متعال است که می‌فرماید: «همانا در این، تذکری است برای کسی که قلب دارد» (إِنَّ فِي ذَلِكَ لَذِكْرَى لِمَنْ كَانَ لَهُ قَلْبٌ). و نفرمود عقل، تا او را مقید سازد. و قلب نامیده نشد مگر به دلیل تقلب (دگرگونی) دائمی‌اش در احوال و امور همراه با انفاس. پس برخی از بندگان خدا می‌دانند که در هر نفس در چه چیزی متقلب می‌شوند و برخی از آن غافلند.\n\n[قطب محمدی کسی است که از روی علم همراه با انفاس متقلب می‌شود]\n\nپس قطب محمدی (القطب المحمدي) یا مفرد (المفرد) کسی است که از روی علم همراه با انفاس متقلب می‌شود، همان‌گونه که هر یک از خلق خدا از روی حال همراه با آن متقلب می‌شوند. پس این مرد جز به علم به آنچه در آن و بر آن متقلب می‌شود، افزوده نشده است، نه به تقلب (دگرگونی)، زیرا تقلب امری است که در تمام عالم و در او جاری است، «لیکن بیشتر مردم نمی‌دانند» (وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ) آن را به تفصیل و تعیین، هرچند آن را به اجمال بدانند. پس منازل آنان به اندازه علمشان به آنچه در آن و بر آن متقلب می‌شوند، است. و خداوند «حق را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ). شرح و بسط این باب طولانی است، لذا صلاح دیدیم به آنچه ذکر کردیم و به آن اشاره نمودیم و قصد کردیم، اکتفا کنیم. و در ذکر ما، مقام آنان با آشکار شدنشان روشن می‌شود. و خداوند متولی توفیق است."
  },
  "page_count": 4
}