{
  "id": 123,
  "title": {
    "ar": "الباب الثالث والعشرون ومائة في معرفة مقام ترك اليقين وأسراره",
    "en": "Chapter One Hundred and Twenty-Three: Concerning the Knowledge of the Station of Abandoning Certainty and its Secrets.",
    "ur": "باب ایک سو تیئیس (۱۲۳): مقام ترک الیقین (مقام ترك اليقين) کی معرفت (معرفۃ) اور اس کے اسرار کے بیان میں۔",
    "fa": "باب صد و بیست و سوم در معرفت مقام ترک یقین و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الثالث والعشرون ومائة في معرفة مقام ترك اليقين وأسراره)\n\n\n> إذا وقف العبيد مع المريد *** يزيل يقينه حكم الإرادة\n\n\n> ويعطي الحق رتبته لئلا *** يقيده فيقدح في العبادة\n\n\n> فيفعل ما يشاء كما يشاء *** بلا جبر ولا حكم لعادة\n\n\n> وقد دل الدليل بغير شك *** ولا ريب على نفي الإعادة\n\n\n> لأن الجوهر المعلوم باق *** على ما كان في حكم الشهادة\n\n\n> فيخلع منه وقتا أو عليه *** بمثل أو بضد للإفادة\n\n\n### [لا يتكرر شي‏ء في الوجود للاتساع الإلهي‏]\n\n\nاعلم وفقك الله أني أردت بنفي الإعادة الذي نقول إنه لا يتكرر شي‏ء في الوجود للاتساع الإلهي وإنما هي أعيان أمثال لا يدركها لحس إذ لا يدرك التفرقة بينها أريد بين ما انعدم منها وما تجدد وهو قول المتكلمين إن العرض لا يبقى زمانين‏\n\n\n### [اليقين فيه رائحة من مقاومة القهر الإلهي كالصبر]\n\n\nلما كان اليقين فيه رائحة من مقاومة القهر الإلهي مثل الصبر ترك أهل الله الاتصاف به وتعمله وطلبه من الله فإذا أتى من عند الله من غير تعمل من العبد قبله العبد أدبا مع الله ولم يرده على الله إذا أراد الله أن يصير هذا العبد محلا\nلوجود هذا اليقين ويكون حكمه في هذا المحل التعلق بالله في دفع الضرر عن هذا العبد فيكون ذلك سؤال اليقين وتعلقه بجناب الحق لا بتعلق العبد ولا بسؤاله‏\n\n\n### [العبد سبب في ظهور عين اليقين لعدم قيام اليقين بنفسه‏]\n\n\nوذلك لما كان العبد سببا في ظهور عين اليقين لعدم قيام اليقين بنفسه كان للمحل عند هذا اليقين يد أراد مكافاتها فيسأل اليقين موجدة تعالى رفع الضرر عن هذا المحل إذ اليقين لا يوجد إلا لرفع الضرر وأما في حال المنفعة فلا حكم له إلا في استدامتها لا فيها فإنها حاصلة فإن توهم العبد إزالتها فإن اليقين يطلب من الله استمرار وجودها في محله فبهذا القدر يكون ترك اليقين أي العبد لا يعترض على اليقين في سؤاله ربه ما شاء فهو تاركه يفعل ما يريد فلا يتصف العبد هنا بشي‏ء\n\n\n### [العبد مضطرب في أصل نشأته لا يقين له من حيث حقيقته‏]\n\n\nومع هذا التحقيق فالمسألة غامضة بعيدة التصور فالعبد في أصله مضطرب متزلزل الملك فلا يقين له من حيث حقيقته فإنه محل لتجدد الأعراض عليه واليقين سكون وهو عرض فلا ثبوت له زمانين والله تعالى كل يوم في شأن وأصغر الأيام الزمن الفرد فقد أبنت لك أن أهل الله في نفوسهم بمعزل عما يطلبه اليقين وأن اليقين هو السائل ولهذا قال له حَتَّى يَأْتِيَكَ الْيَقِينُ فيكون اليقين هو الذي يسأل ويتعب وأنت مستريح فافهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\n### [لا طمأنينة مع المريد إلا عن بشرى‏]\n\n\nفإن الوقوف مع إرادة الله لا يتمكن معها سكون أصلا لأنه خروج عن حقيقة النفس والشي‏ء لا يخرج عن حقيقته إذ خروج الشي‏ء عن حقيقته محال فلا طمأنينة مع المريد إلا عن بشرى فإنه يسكن عند ذلك لصدق القول وتكون البشرى معينة موقتة وحينئذ يكون له السكون إليها وهو اليقين وقد ورد أن الملائكة يخافون من مكر الله‏\n\n\nولا يقين مع الخوف فإن سكن العبد إلى قوله فَعَّالٌ لِما يُرِيدُ لا يزول عنه فذلك السكون قد يسمى يقينا ولكن يورث في المحل خلاف ما يطلب من حكم اليقين الذي اصطلح عليه أهل الله وأما نحن فاليقين عندنا موجود في كل أحد من خلق الله وإنما يقع الخلاف بما ذا يتعلق اليقين فاليقين صفة شمول وليست من خصوص طريق الله التي فيها السعادة إلا بحكم متيقن ما فهذا تحقيقه والله الموفق لا رب غيره‏\n\n",
    "en": "## (Chapter One Hundred and Twenty-Three: On the Gnosis of the Station of Abandoning Certainty [ترك اليقين] and its Secrets)\n\nWhen the servants stand with the Willer (المريد),\nThe rule of the Will removes his certainty.\n\nAnd he gives The Real (الحق) its rank, lest\nHe restrict Him, thereby blemishing the servitude.\n\nSo He does what He wills, as He wills,\nWithout compulsion and without the rule of custom.\n\nAnd the proof has indicated, without doubt\nOr suspicion, the negation of repetition.\n\nBecause the known substance remains\nUpon what it was in the state of witnessing (الشهادة).\n\nSo He strips from it, at times, or upon it,\nWith a likeness or with an opposite, for the sake of instruction.\n\n### [Nothing is repeated in Existence due to Divine Vastness]\n\nKnow, may Allah grant you success, that by the negation of repetition, we mean that nothing is repeated in Existence (الوجود) due to the Divine Vastness (الاتساع الإلهي). Rather, they are entities of likenesses (أعيان أمثال) which the senses do not perceive, as the senses cannot discern the difference between them—I mean, between what has ceased to exist and what has been renewed. This is the statement of the theologians (المتكلمين) that the accident (العرض) does not persist for two moments.\n\n### [Certainty contains a scent of resistance to Divine Compulsion, like Patience]\n\nSince Certainty (اليقين) contains a scent of resistance to the Divine Compulsion (القهر الإلهي), similar to Patience (الصبر), the People of Allah (أهل الله) abandon being characterized by it, striving for it, or seeking it from Allah. If it comes from Allah without self-exertion (تعمل) on the part of the servant, the servant accepts it out of courtesy (أدبا) toward Allah and does not reject it back to Allah, if Allah wills that this servant become a locus (محلا) for the existence of this Certainty.\n\nIts ruling in this locus is the attachment to Allah in repelling harm from this servant. Thus, that becomes the asking of Certainty and its attachment to the Divine Presence (جناب الحق), not through the servant's attachment or his asking.\n\n### [The servant is a cause for the manifestation of the essence of Certainty because Certainty does not subsist by itself]\n\nThis is because since the servant is a cause for the manifestation of the essence (عين) of Certainty, due to Certainty not subsisting by itself, the locus [the servant] has a hand [a benefit] with this Certainty, which it wishes to reward. So Certainty asks its Creator, the Exalted, to remove harm from this locus, since Certainty only exists to remove harm.\n\nAs for the state of benefit, it has no ruling except in sustaining it, not in bringing it about, for it is already attained. If the servant imagines its removal, then Certainty asks Allah for the continuation of its existence in its locus.\n\nTo this extent is the abandoning of Certainty (ترك اليقين): meaning, the servant does not object to Certainty in its asking its Lord whatever it wills. Thus, the servant leaves it to do what it desires, and the servant is not characterized by anything here.\n\n### [The servant is unstable in his original nature; he has no certainty from the perspective of his reality]\n\nDespite this verification, the matter is obscure and difficult to conceive. For the servant, in his origin, is agitated, his dominion is shaky, so he has no Certainty from the perspective of his reality (حقيقته). For he is a locus for the renewal of accidents (الأعراض) upon him, and Certainty is stillness, and it is an accident, so it has no persistence for two moments. And Allah the Exalted is <<كُلَّ يَوْمٍ فِي شَأْنٍ>> (every day in [a new] affair), and the smallest of days is the single moment.\n\nI have thus made clear to you that the People of Allah (أهل الله), in their souls, are far removed from what Certainty seeks, and that Certainty itself is the asker. This is why He said to him: <<وَاعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ>> (And worship your Lord until there comes to you the Certainty [i.e., death]). Thus, Certainty is the one that asks and strives, while you are at rest. Understand this. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).\n\n### [There is no Tranquility with the Willer except through glad tidings]\n\nFor standing with the Will of Allah (إرادة الله) allows for no stillness whatsoever, because it is a departure from the reality of the soul, and a thing does not depart from its reality, since the departure of a thing from its reality is impossible.\n\nThus, there is no tranquility (طمأنينة) with the Willer (المريد) except through glad tidings (بشرى). For he becomes still at that point due to the truthfulness of the saying, and the glad tidings are specific and temporary. And at that time, he has stillness toward it, and that is Certainty.\n\nIt has been reported that the angels fear the cunning of Allah, and there is no Certainty alongside fear. If the servant finds stillness in His saying: <<فَعَّالٌ لِّمَا يُرِيدُ>> (Doer of what He wills), and this stillness does not depart from him, then that stillness may be called Certainty. But it bequeaths in the locus the opposite of what is sought from the ruling of Certainty as defined by the People of Allah.\n\nAs for us, Certainty (اليقين) is present in every single one of Allah's creation. The disagreement only arises regarding what the Certainty relates to. So Certainty is a comprehensive attribute, and it is not among the specifics of the Path of Allah that contains felicity, except by the ruling of some certain thing. This is its verification, and Allah is the Granter of success; there is no Lord other than Him.",
    "ur": "(باب ایک سو تئیس: مقام ترک الیقین اور اس کے اسرار کی معرفت میں)\n\nجب بندے مراد (الٰہی) کے ساتھ کھڑے ہوتے ہیں،\nتو ارادے کا حکم ان کے یقین کو زائل کر دیتا ہے۔\n\nاور وہ (بندہ) ذات حق (الحق) کو اس کا مرتبہ دیتا ہے\nتاکہ وہ اسے مقید نہ کرے، ورنہ یہ عبادت میں نقص پیدا کرے گا۔\n\nپس وہ (ذات حق) جو چاہتا ہے، جیسے چاہتا ہے، کرتا ہے،\nنہ کسی جبر کے تحت اور نہ کسی عادت کے حکم کے تحت۔\n\nاور دلیل نے بغیر کسی شک و شبہ کے\nاعادہ (تکرار) کی نفی پر دلالت کی ہے۔\n\nکیونکہ معلوم جوہر (الجوهر المعلوم) شہادت (الشہود) کے حکم میں\nاسی طرح باقی رہتا ہے جیسا کہ وہ تھا۔\n\nپس وہ (ذات حق) اس (جوہر) سے کبھی وقت کو نکالتا ہے یا اس پر\nکسی مثل یا ضد کے ذریعے افادہ (فائدہ) کے لیے ڈالتا ہے۔\n\n### [الٰہی وسعت کی وجہ سے ہستی میں کوئی شے مکرر نہیں ہوتی]\n\nجان لو، اللہ تمہیں توفیق دے، کہ اعادہ (تکرار) کی نفی سے میری مراد یہ ہے کہ الٰہی وسعت (الاتساع الإلهي) کی وجہ سے ہستی (الوجود) میں کوئی شے مکرر نہیں ہوتی۔ بلکہ وہ صرف امثال (مشابہات) کے اعیان (حقیقتیں) ہیں جنہیں حس ادراک نہیں کر سکتی، کیونکہ وہ ان کے درمیان فرق کو نہیں پہچان سکتی—یعنی ان کے درمیان جو معدوم ہو گئے اور جو نئے سرے سے ظاہر ہوئے۔ اور یہی متکلمین کا قول ہے کہ عرض (عارضی صفت) دو زمانوں تک باقی نہیں رہتی۔\n\n### [یقین میں قہر الٰہی کی مزاحمت کی بو آتی ہے جیسے کہ صبر میں]\n\nچونکہ یقین (الیقین) میں قہر الٰہی (القهر الإلهي) کی مزاحمت کی بو آتی ہے، جیسے کہ صبر میں، اس لیے اہل اللہ نے اس کے ساتھ متصف ہونے، اسے بناوٹ سے اختیار کرنے اور اللہ سے اس کا طلب کرنے کو ترک کر دیا۔ پس جب وہ اللہ کی طرف سے بندے کی کسی بناوٹ کے بغیر آتا ہے، تو بندہ اسے اللہ کے ساتھ ادب کی وجہ سے قبول کر لیتا ہے اور اسے اللہ پر رد نہیں کرتا، جب اللہ یہ ارادہ کرتا ہے کہ یہ بندہ اس یقین (الیقین) کے وجود کا محل بن جائے، اور اس محل میں اس کا حکم یہ ہوتا ہے کہ وہ اس بندے سے ضرر کو دور کرنے کے لیے اللہ سے تعلق قائم کرے۔ پس یہ یقین (الیقین) کا سوال اور ذات حق (الحق) کی جناب سے اس کا تعلق ہوتا ہے، نہ کہ بندے کے تعلق یا اس کے سوال سے۔\n\n### [بندہ عین الیقین کے ظہور کا سبب ہے کیونکہ یقین بذات خود قائم نہیں ہوتا]\n\nاور یہ اس لیے ہے کہ چونکہ بندہ عین الیقین (یقین کی حقیقت) کے ظہور کا سبب تھا، کیونکہ یقین بذات خود قائم نہیں ہوتا، اس لیے اس یقین کے نزدیک محل (بندے) کا ایک ہاتھ (اثر) تھا جس کا وہ بدلہ دینا چاہتا تھا۔ پس یقین (الیقین) اللہ تعالیٰ سے اس محل سے ضرر کو دور کرنے کا سوال کرتا ہے، کیونکہ یقین صرف ضرر کو دور کرنے کے لیے ہی موجود ہوتا ہے۔ اور جہاں تک منفعت (فائدہ) کی حالت کا تعلق ہے، تو اس کا کوئی حکم نہیں ہوتا سوائے اس کے کہ وہ اس منفعت کو برقرار رکھنے کا سوال کرے، نہ کہ خود منفعت میں، کیونکہ وہ تو پہلے ہی حاصل ہے۔ اگر بندہ اس کے زائل ہونے کا وہم کرے، تو یقین (الیقین) اللہ سے اس کے محل میں اس کے وجود کے تسلسل کا مطالبہ کرتا ہے۔ پس اس حد تک ترک الیقین (یقین کو ترک کرنا) ہوتا ہے، یعنی بندہ یقین (الیقین) کے اپنے رب سے جو چاہے سوال کرنے پر اعتراض نہیں کرتا۔ پس وہ اسے چھوڑ دیتا ہے کہ وہ جو چاہے کرے، لہٰذا بندہ یہاں کسی شے کے ساتھ متصف نہیں ہوتا۔\n\n### [بندہ اپنی اصل نشوونما میں مضطرب ہے، اپنی حقیقت کے اعتبار سے اس کے لیے کوئی یقین نہیں]\n\nاس تحقیق کے باوجود، یہ مسئلہ مبہم اور تصور سے بعید ہے۔ پس بندہ اپنی اصل میں مضطرب اور متزلزل ملکیت والا ہے، لہٰذا اپنی حقیقت کے اعتبار سے اس کے لیے کوئی یقین (الیقین) نہیں ہے۔ کیونکہ وہ اپنے اوپر اعراض (عارضی صفات) کے تجدد کا محل ہے، اور یقین (الیقین) سکون ہے جو کہ ایک عرض ہے، لہٰذا اسے دو زمانوں تک ثبات حاصل نہیں ہوتا۔ اور اللہ تعالیٰ ہر دن ایک نئی شان میں ہے، اور سب سے چھوٹا دن وہ واحد زمانہ (الزمن الفرد) ہے۔ میں نے تمہارے لیے واضح کر دیا ہے کہ اہل اللہ اپنی ذات میں اس چیز سے دور ہیں جس کا یقین (الیقین) مطالبہ کرتا ہے، اور یہ کہ یقین ہی سوال کرنے والا ہے۔ اور اسی لیے اللہ نے اسے فرمایا: **\"یہاں تک کہ تمہارے پاس یقین (الیقین) آ جائے\"** (سورۃ الحجر: ۹۹)۔ پس یقین (الیقین) ہی وہ ہے جو سوال کرتا ہے اور تھکتا ہے، اور تم آرام دہ ہو۔ پس سمجھو۔ اور اللہ **\"حق فرماتا ہے اور وہی راہ دکھاتا ہے\"** (سورۃ الاحزاب: ۴)۔\n\n### [مراد (الٰہی) کے ساتھ کوئی اطمینان نہیں مگر بشارت کے ذریعے]\n\nکیونکہ ارادہ الٰہی (إرادة الله) کے ساتھ کھڑے ہونے میں مطلقاً سکون ممکن نہیں ہے۔ کیونکہ یہ نفس کی حقیقت سے خروج ہے، اور شے اپنی حقیقت سے خارج نہیں ہوتی، کیونکہ شے کا اپنی حقیقت سے خارج ہونا محال ہے۔ پس مراد (الٰہی) کے ساتھ کوئی اطمینان (طمأنينة) نہیں ہوتا مگر بشارت (بشرى) کے ذریعے سے۔ پس وہ اس وقت قول کی سچائی کی وجہ سے سکون حاصل کرتا ہے، اور بشارت متعین اور وقتی ہوتی ہے۔ اور اس وقت اس کے لیے اس کی طرف سکون ہوتا ہے، اور یہی یقین (الیقین) ہے۔ اور یہ وارد ہوا ہے کہ فرشتے اللہ کی خفیہ تدبیر (مکر اللہ) سے خوف کھاتے ہیں۔ اور خوف کے ساتھ یقین (الیقین) نہیں ہوتا۔ پس اگر بندہ اس کے قول **\"جو وہ چاہتا ہے اسے کر گزرنے والا ہے\"** (سورۃ ہود: ۱۰۷) پر سکون حاصل کرے جو اس سے زائل نہیں ہوتا، تو اس سکون کو یقین (الیقین) کہا جا سکتا ہے، لیکن یہ محل (بندے) میں اس یقین کے حکم کے خلاف چیز پیدا کرتا ہے جس پر اہل اللہ نے اصطلاح قائم کی ہے۔ اور جہاں تک ہمارا تعلق ہے، تو ہمارے نزدیک یقین (الیقین) اللہ کی ہر مخلوق میں موجود ہے۔ اختلاف صرف اس بات میں واقع ہوتا ہے کہ یقین (الیقین) کس چیز سے متعلق ہے۔ پس یقین (الیقین) ایک شمولیت کی صفت ہے، اور یہ اللہ کے خاص راستے میں شامل نہیں ہے جس میں سعادت ہے، مگر کسی یقینی حکم کے ساتھ۔ پس یہ اس کی تحقیق ہے، اور اللہ ہی توفیق دینے والا ہے، اس کے سوا کوئی رب نہیں۔",
    "fa": "باب صد و بیست و سوم در معرفت مقام ترک یقین و اسرار آن\n\nآنگاه که بندگان با اراده‌مند (المريد) بایستند\nیقین او حکم اراده را زایل می‌سازد\nو حق (الحق) را رتبه او می‌بخشد تا مبادا\nاو را مقید سازد و در عبادت خللی وارد آید\nپس آنچه را می‌خواهد، آن‌گونه که می‌خواهد انجام می‌دهد\nبی‌هیچ جبر و بی‌هیچ حکم عادتی\nو دلیل، بی‌هیچ شک و تردیدی\nبر نفی اعاده (تکرار) دلالت کرده است\nزیرا جوهر معلوم، باقی است\nبر آنچه در حکم شهود (الشهود) بود\nپس گاهی از آن می‌کاهد یا بر آن می‌افزاید\nبا مثلی یا با ضدی برای افاده (فایده‌بخشی)\n\n### [هیچ چیزی در هستی به دلیل وسعت الهی تکرار نمی‌شود]\n\nبدان، خداوند تو را توفیق دهد، که منظور من از نفی اعاده (تکرار) این است که می‌گوییم هیچ چیزی در هستی (الوجود) به دلیل وسعت الهی (الاتساع الإلهي) تکرار نمی‌شود. بلکه آن‌ها اعیان امثال (ذوات شبیه) هستند که حس آن‌ها را درک نمی‌کند، زیرا حس نمی‌تواند تفاوت میان آنچه معدوم شده و آنچه تجدید گشته را دریابد. و این همان قول متکلمین است که عرض (صفت ناپایدار) دو زمان باقی نمی‌ماند.\n\n### [یقین بویی از مقاومت در برابر قهر الهی مانند صبر دارد]\n\nاز آنجا که یقین (الیقین) بویی از مقاومت در برابر قهر الهی (القهر الإلهي) مانند صبر دارد، اهل الله (عارفان) از متصف شدن به آن، تکلف ورزیدن در آن و طلب آن از خداوند دست کشیده‌اند. پس اگر یقین از جانب خداوند و بدون تکلف از سوی بنده بیاید، بنده آن را از باب ادب با خداوند می‌پذیرد و آن را بر خداوند رد نمی‌کند، اگر خداوند بخواهد این بنده محل وجود این یقین شود. و حکم یقین در این محل، تعلق به خداوند در دفع ضرر از این بنده است. پس این، سؤال یقین و تعلق آن به جناب حق (الحق) است، نه تعلق بنده و نه سؤال او.\n\n### [بنده سبب ظهور عین یقین است، زیرا یقین به نفس خود قیام ندارد]\n\nو این بدان سبب است که چون بنده سبب ظهور عین یقین (الیقین) است، به دلیل عدم قیام یقین به نفس خود، محل (بنده) نزد این یقین دستی دارد که یقین می‌خواهد پاداش آن را بدهد. پس یقین از خداوند می‌خواهد که ضرر را از این محل برطرف سازد، زیرا یقین جز برای رفع ضرر وجود نمی‌یابد. اما در حالت منفعت، یقین حکمی ندارد مگر در استدامه (ادامه یافتن) آن، نه در اصل منفعت، زیرا منفعت حاصل است. اگر بنده توهم زوال منفعت را داشته باشد، یقین از خداوند استمرار وجود آن را در محلش می‌طلبد. به این مقدار است که ترک یقین محقق می‌شود؛ یعنی بنده بر یقین در سؤال کردن از پروردگارش هر آنچه می‌خواهد، اعتراض نمی‌کند. پس بنده آن را رها می‌کند تا هر چه می‌خواهد انجام دهد و در اینجا بنده به چیزی متصف نمی‌شود.\n\n### [بنده در اصل نشأت خود مضطرب است و از حیث حقیقت خود یقینی ندارد]\n\nبا وجود این تحقیق، مسئله‌ای است مبهم و دور از تصور. بنده در اصل خود مضطرب و متزلزل‌الملک است، پس از حیث حقیقت خود یقینی ندارد، زیرا او محل تجدد اعراض (صفات ناپایدار) است و یقین سکون است و خود عرض است، پس دو زمان ثبوت ندارد. و خداوند متعال «كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ» (هر روز در کاری است) [الرحمن: ۲۹] و کوچک‌ترین روزها، زمان فرد است. پس برای تو روشن ساختم که اهل الله (عارفان) در نفوس خود از آنچه یقین می‌طلبد، برکنارند و یقین خود سائل (درخواست‌کننده) است. به همین دلیل به او گفته شد: «حَتَّى يَأْتِيَكَ الْيَقِينُ» (تا یقین به تو آید) [الحجر: ۹۹]. پس یقین است که سؤال می‌کند و رنج می‌برد و تو آسوده‌ای. پس بفهم. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند) [الأحزاب: ۴].\n\n### [با اراده‌مند (المريد) جز از طریق بشری (مژده) طمأنینه‌ای نیست]\n\nزیرا ایستادن با اراده خداوند، اصلاً سکونی را ممکن نمی‌سازد، چرا که خروج از حقیقت نفس است و شیء از حقیقت خود خارج نمی‌شود، زیرا خروج شیء از حقیقتش محال است. پس با اراده‌مند (المريد) هیچ طمأنینه‌ای نیست مگر از طریق بشری (مژده الهی). زیرا در آن هنگام به دلیل صدق قول، آرام می‌گیرد و این بشری معین و موقت است و در آن زمان سکون به سوی آن برای او حاصل می‌شود و آن همان یقین است. و روایت شده است که فرشتگان از مکر خداوند می‌ترسند.\n\nو با ترس، یقینی وجود ندارد. پس اگر بنده به قول او که «فَعَّالٌ لِما يُرِيدُ» (آنچه را می‌خواهد انجام می‌دهد) [هود: ۱۰۷] آرام گیرد و این آرامش از او زایل نشود، آن سکون ممکن است یقین نامیده شود، اما در محل (بنده) خلاف آنچه از حکم یقین که اهل الله (عارفان) بر آن اصطلاح کرده‌اند، به ارث می‌گذارد. اما نزد ما، یقین در هر یک از خلق خداوند موجود است و اختلاف تنها در این است که یقین به چه چیزی تعلق می‌گیرد. پس یقین صفتی فراگیر است و از خصوصیات راه خداوند که سعادت در آن است، نیست، مگر به حکم چیزی که یقین به آن حاصل شده باشد. این است تحقیق آن و خداوند توفیق‌دهنده است و پروردگاری جز او نیست."
  },
  "page_count": 2
}