{
  "id": 357,
  "title": {
    "ar": "الباب السابع والخمسون وثلاثمائة في معرفة منزل البهائم من الحضرة الإلهية وقهرهم تحت سرين موسويين",
    "en": "Chapter Three Hundred and Fifty-Seven: Concerning the Gnosis (معرفة) of the Station of the Beasts (البهائم) within the Divine Presence (الحضرة الإلهية), and their Subjugation under Two Mosaic Secrets (سرين موسويين).",
    "ur": "باب تین سو ستاون: الٰہی حضور (الحضرة الإلهية) میں بہائم کے مقام کی معرفت اور ان کا دو موسوی رازوں (سرين موسويين) کے تحت زیر کیا جانا",
    "fa": "باب سیصد و پنجاه و هفتم در شناخت جایگاه بهائم (چهارپایان) در حضرت الهی و مقهور شدن آن‌ها تحت دو سرّ موسوی."
  },
  "content": {
    "ar": "## «الباب السابع والخمسون وثلاثمائة في معرفة منزل البهائم من الحضرة الإلهية وقهرهم تحت سرين موسويين»\n\n\n> هيهات ما تسدل الأستار والكلل *** إلا لأمر عظيم كله جلل‏\n\n\n> لو أن ما سترت يبدو لأعيننا *** لما بدت نحل فينا ولا ملل‏\n\n\n> ولا بد أعرض في طيه مرض *** ولا دواء ولا طب ولا علل‏\n\n\n> ولا جديد تكون النفس تلبسه *** ولا التوسط منه لا ولا الثمل‏\n\n\n> إن الستور ترى في العين صورتها *** وليس يدركها في ذلكم ملل‏\n\n\n> وأعين الكون خلف الستر ناظرة *** والحجب تبصر ما لا تبصر المقل‏\n\n\n### [التخلق بأسماء إلهية والتحقق بأرواح طاهرة ملكية سبب معرفة الأمور]\n\n\nاعلم أيدك الله أيها الطالب أن معرفة الأمور على ما هي عليه في أنفسها إنك لا تعلم ذلك إلا إذا أوقفك الله عليك من نفسك وأشهدك ذلك من ذاتك فيحصل لك ما طلبته ذوقا عند ما تقف عليه كشفا ولا سبيل إلى حصول ذلك إلا بعناية أزلية تعطيك استعدادا تاما لقبوله برياضات نفسية ومجاهدات بدنية وتخلق بأسماء إلهية وتحقق بأرواح طاهرة ملكية وتطهير بطهارة شرعية مشروعة لا معقولة وعدم تعلق بأكوان وتفريغ محل عن جميع الأغيار لأن الحق ما اصطفى لنفسه منك إلا قلبك حين نوره بالإيمان فوسع جلال الحق فعاين من هذه صفته الممكنات بعين الحق فكانت له مشهودة وإن لم تكن موجودة فما هي له مفقودة وقد كشف لبصيرته بل لبصره وبصيرته نور الايمان حين انبسط على أعيان الممكنات أنها في حال عدمها مرئية رائية مسموعة سامعة برؤية ثبوتية وسمع ثبوتي لا وجود له فعين الحق ما شاء من تلك الأعيان فوجه عليه دون غيره من أمثاله قوله المعبر عنه باللسان العربي المترجم بكن فأسمعه أمره فبادر المأمور فتكون عن كلمته لا بل كان عين كلمته ولم تزل الممكنات في حال عدمها الأزلي لها تعرف الواجب الوجود لذاته وتسبحه وتمجده بتسبيح أزلي وتمجيد قديم ذاتي ولا عين لها موجودة ولا حكم لها مفقود فإذا كان حال الممكنات كلها على ما ذكرناه من هذه الصفات التي لا جهل معها فكيف تكون في حال وجودها وظهورها لنفسها جمادا لا ينطق أو نباتا بتعظيم خالقه لا يتحقق أو حيوانا بحاله لا يصدق أو إنسانا بربه لا يتعلق هذا محال فلا بد أن يكون كل ما في الوجود من ممكن موجود يسبح الله بحمده بلسان لا يفقه ولحن ما إليه كل أحد يتنبه فيسمعه أهل الكشف شهادة ويقبله المؤمن إيمانا وعبادة فقال تعالى وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ ولكِنْ لا تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كانَ حَلِيماً غَفُوراً فجاء باسم الحجاب والستر وهو قوله غَفُوراً وجاء بالاسم الذي يقتضي تأخير المؤاخذة إلى الآجل وعدم حكمها في العاجل وهو الحليم لما علم إن في عباده من حرم الكشف والايمان وهم العقلاء عبيد الأفكار والواقفون مع الاعتبار فجازوا من الظاهر إلى الباطن مفارقين الظاهر فعبروا عنه إذ لم يكونوا أهل كشف ولا إيمان لما حجب الله أعينهم عن مشاهدة ما هي عليه الموجودات في أنفسها ولا رزقوا إيمانا في قلوبهم يكون له نور يَسْعى‏ بَيْنَ أَيْدِيهِمْ وأما المؤمنون الصادقون أولوا العزم من الأولياء فعبروا بالظاهر معهم لا من الظاهر إلى الباطن وبالحرف عينه إلى المعنى ما عبروا عنه فرأوا الأمور بالعينين وشهدوا بنور إيمانهم النجدين فلم يتمكن لهم إنكار\nما شهدوه ولا جحدوا ما تيقنوه فأسمعهم الله نطق الموجودات لا بل نطق الممكنات قبل وجودها فإنها حية ناطقة دراكة بحياة ثبوتية ونطق ثبوتي وإدراك ثبوتي إذ كانت في أنفسها أشياء ثبوتية فلما قبلت شيئية الوجود قبلتها بجميع نعوتها وصفاتها وليس نعتها سوى عينها فهي في حال شيئية وجودها حية بحياة وجودية ناطقة بنطق وجودي دراكة بإدراك وجودي إلا إن الله سبحانه أخذ بأبصار بعض عباده عن إدراك هذه الحياة السارية والنطق والإدراك الساري في جميع الموجودات كما أخذ الله ببصائر أهل العقول والأفكار عن إدراك ما ذكرناه في جميع الموجودات وفي جميع الممكنات وأهل الكشف والايمان على علم مما هو الأمر عليه في هذه الأعيان في حال عدمها ووجودها فمن ظهرت حياته سمي حيا ومن بطنت حياته فلم تظهر لكل عين سمي نباتا وجمادا فانقسم عند المحجوبين الأمر وعند أهل الكشف والايمان لم ينقسم فأما صاحب الكشف والشهود أهل الاختصاص فقد أعطاهم الشهود وما أعطى المحجوبين شهودهم فيقول أهل الشهود سمعنا ورأينا ويقول المحجوبون ما سمعنا ولا رأينا ويقول أهل الايمان آمنا وصدقنا قال تعالى وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وشي‏ء نكرة وقال أَ لَمْ تَرَ أَنَّ الله يَسْجُدُ لَهُ من في السَّماواتِ ومن في الْأَرْضِ والشَّمْسُ والْقَمَرُ والنُّجُومُ والْجِبالُ والشَّجَرُ والدَّوَابُّ فذكر الجماد والنبات والحيوان الذين وقع فيهم الخلاف بين المحجوبين من أهل العقول والأفكار وبين أهل الشهود والايمان وقال تعالى ولِلَّهِ يَسْجُدُ ما في السَّماواتِ وما في الْأَرْضِ من دابَّةٍ وقال ويُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وقال ولِلَّهِ يَسْجُدُ من في السَّماواتِ والْأَرْضِ طَوْعاً وكَرْهاً وظِلالُهُمْ بِالْغُدُوِّ والْآصالِ وقال قالَتْ نَمْلَةٌ يا أَيُّهَا النَّمْلُ ادْخُلُوا مَساكِنَكُمْ لا يَحْطِمَنَّكُمْ سُلَيْمانُ وجُنُودُهُ وهُمْ لا يَشْعُرُونَ فَتَبَسَّمَ ضاحِكاً من قَوْلِها وقال عُلِّمْنا مَنْطِقَ الطَّيْرِ وقال عن الهدهد إنه قال لسليمان أَحَطْتُ بِما لَمْ تُحِطْ به وجِئْتُكَ من سَبَإٍ بِنَبَإٍ يَقِينٍ إِنِّي وَجَدْتُ امْرَأَةً تَمْلِكُهُمْ وأُوتِيَتْ من كُلِّ شَيْ‏ءٍ ولَها عَرْشٌ عَظِيمٌ وَجَدْتُها وقَوْمَها يَسْجُدُونَ لِلشَّمْسِ من دُونِ الله فانظر فيما أعطى الله هذا الهدهد من العلم بالله فيما ذكره وقال تعالى أَخْرَجْنا لَهُمْ دَابَّةً من الْأَرْضِ تُكَلِّمُهُمْ ثم أخبر أن طائفة من العباد لا توقن بذلك وتخرجه بالتأويل عن ظاهره فقال أَنَّ النَّاسَ كانُوا بِآياتِنا لا يُوقِنُونَ أي لا يستقر الايمان بالآيات التي هذه الآية منها في قلوبهم بل يقبلون ذلك إيمانا وطائفة منهم تتأول ذلك على غير وجهه الذي قصد له وقال صَلَّى اللهُ عَليهِ وسَلَّم يشهد للمؤذن مدى صوته من رطب ويابس‏\n\n\nوقال في أحد هذا جبل يحبنا ونحبه‏\n\n\nوقال إني لأعرف حجرا بمكة كان يسلم علي قبل إن أبعث‏\n\n\nقد صح أن الحصى سبح في كفه وصح حنين الجذع إليه الذي كان يستند إليه إذا خطب الناس قبل أن يعمل له المنبر فلما صنع له المنبر تركه فحن إليه فنزل من منبره وأتاه فلمسه بيده حتى سكن‏\n\n\nوصح أن كتف الشاة المسموم كلمه وقال صَلَّى اللهُ عَليهِ وسَلَّم لا تقوم الساعة حتى تكلم الرجل عذبة سوطه وتخبره فخذه بما فعل أهله بعده‏\n\n\nوثبت عنه في قتل اليهود في آخر الزمان إذا استتر اليهود خلف الشجر يقول الشجر يا مسلم هذا يهودي خلفي أقتله إلا شجرة الغرقد فإنها ملعونة لا تنبه على من يستتر بها من اليهود\n\n\nوهنا سر إلهي عجيب يعلم أن من الأشجار من راعى حق من استجار به اعتمادا من تلك الشجرة على رحمة الله ووفاء لحق الجوار وهو من الصفات المحمودة في كل طائفة وفي كل ملة وقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لابنة عمه أم هانئ قد أجرنا من أجرت يا أم هانئ وكان مشركا\n\n\nواليهود أهل كتاب على كل حال فهم أولى بأن يوفى لهم بحق الجوار وكان هذا من الله في حق هذه الشجرة التي استجار بها اليهود فسترتهم ليتحقق عندنا قوله يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ فجاء بلفظة من وهي نكرة فدخل تحتها كل شي‏ء لأن كل شي‏ء حي ناطق فيدخل تحت قوله من لأن بعض النحاة يعتقدون أن لفظة من لا تقع إلا على من يعقل وكل شي‏ء يسبح بحمد الله ولا يسبح إلا من يعقل من يسبحه ويثني عليه بما يستحقه فمن تقع على كل شي‏ء إذ كل شي‏ء يعقل عن الله ما يسبحه به فالله تعالى يرزقنا الايمان إذا لم نكن من أهل العيان والكشف والشهود لهذه الأمور التي أعمى الله عنها أهل العقول الذين تعبدتهم أفكارهم وغير المؤمنين الذين طمس الله على قلوبهم فمن علم إن كل شي‏ء ناطق ناظر إلى ربه لزمه الحياء\nمن كل شي‏ء حتى من نفسه وجوارحه فإن الله يقول يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ بِما كانُوا يَعْمَلُونَ وقال تعالى الْيَوْمَ نَخْتِمُ عَلى‏ أَفْواهِهِمْ وتُكَلِّمُنا أَيْدِيهِمْ وتَشْهَدُ أَرْجُلُهُمْ بِما كانُوا يَكْسِبُونَ وأخبر تعالى عن بعض الناس المشهود عليهم أنهم يقولون لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنا قالُوا أَنْطَقَنَا الله يعني بالشهادة عليكم الَّذِي أَنْطَقَ كُلَّ شَيْ‏ءٍ فيا ولي لا تكن الجلود أعلم بالأمر منك مع دعواك إنك من أهل العقل والإستبصار فهذه الجلود قد علمت نطق كل شي‏ء وأن الله منطقه بما\n\n\nشاء ثم قال وما كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ ولا أَبْصارُكُمْ ولا جُلُودُكُمْ أي هذا لا يمكن الاستتار منه لأنكم ما تعملون الذي تأتونه من المنكرات إلا بالجوارح فإنها عين الآلة تصرفونها في طاعة الله أو معصيته فلا يتمكن لكم الاستتار عما لا يمكنك العمل إلا به ولكِنْ ظَنَنْتُمْ أَنَّ الله لا يَعْلَمُ كَثِيراً مِمَّا تَعْمَلُونَ هذا خطاب لمن يعتقد أن الله لا يعلم الجزئيات خاصة ثم قال وذلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْداكُمْ أي أهلككم فَأَصْبَحْتُمْ من الْخاسِرِينَ والخسران ضد الربح وهو نقص من رأس المال لما كان الأمر تجارة اتصف بالربح والخسران يقول تعالى فَما رَبِحَتْ تِجارَتُهُمْ وما كانُوا مُهْتَدِينَ عقيب قوله أُولئِكَ الَّذِينَ اشْتَرَوُا الضَّلالَةَ بِالْهُدى‏ فلما باعوا الهدى بالضلالة خسروا وقال هَلْ أَدُلُّكُمْ عَلى‏ تِجارَةٍ تُنْجِيكُمْ من عَذابٍ أَلِيمٍ ثم ذكر ما هي التجارة فقال تُؤْمِنُونَ بِاللَّهِ ورَسُولِهِ وتُجاهِدُونَ في سَبِيلِ الله وإنما عدل في هذه الأمور إلى التجارة دون غيرها فإن القرآن نزل على قرشي بلغة قريش بالحجاز وكانوا تجارا دون غيرهم من الأعراب فلما كان الغالب عليهم التجارة كسى الله ذات الشرع والايمان لفظ التجارة ليكون أقرب إلى أفهامهم ومناسبة أحوالهم وبعد أن أبنت لك عن الأمور على ما هي عليه إن كنت ذا نظر أو إيمان فإني ما أخبرتك إلا بممكن ما أخبرتك بمحال فلنقل بعد هذا البيان الشافي والإيضاح الكافي لأهل طريق الله خاصة وخاصته من عباده من مكاشف ومؤمن إن البهائم ما اختصت بهذا الاسم المشتق من الإبهام والمبهم إلا لكون الأمر أبهم علينا فإنا قد بينا لك ما هي عليه من المعرفة بالله وبالموجودات وإنما سميت بذلك لما انبهم علينا من أمرها فإبهام أمرها إنما هو من حيث جهلنا ذلك أو حيرتنا فيه فلم نعرف صورة الأمر كما يعرفه أهل الكشف فهي عند غير أهل الكشف والايمان بهائم لما نبهم عليهم من أمرها لما يرون من بعض الحيوان من الأعمال الصادرة عنها التي لا تصدر إلا عن فكر وروية صحيحة ونظر دقيق يصدر منهم ذلك بالفطرة لا عن فكر ولا روية فأبهم الله على بعض الناس أمرهم ولا يقدرون على إنكار ما يرونه مما يصدر عنهم من الصنائع المحكمة فذلك جعلهم يتأولون ما جاء في الكتاب والسنة من نطقهم ونسبة القول إليهم ليت شعري ما يفعلون فيما يرونه مشاهدة في الذي يصدر عنهم من الأفعال المحكمة كالعناكب في ترتيب الحبالات لصيد الذباب الذي جعل الله أرزاقهم فيه وما يدخره بعض الحيوان من أقواتهم على ميزان معلوم وقدر مخصوص وعلمهم بالأزمان واحتياطهم على نفسهم في أقواتهم فيأكلون نصف ما يدخرونه خوف الجدب فلا يجدون ما يتقوتون به كالنمل فإن كان ذلك عن نظر فهم يشبهون أهل النظر فأين عدم العقل الذي ينسب إليهم وإن كان ذلك علما ضروريا فقد أشبهونا فيما لا ندركه إلا بالضرورة فلا فرق بيننا وبينهم لو رفع الله عن أعيننا غطاء العمي كما رفعه الله عن أبصار أهل الشهود وبصائر أهل الايمان وفي عشق الأشجار بعضها بعضا التي لها اللقاح فإن ذلك فيها أظهر آيات لأهل النظر إذا أنصفوا\n\n\n### [أن العاقل إذا أراد أن يوصل إليك ما في نفسه لم يقتصر في ذلك التوصيل على العبارة بنظم حروف‏]\n\n\nواعلم أن العاقل كان من كان من أي أصناف العالم إن شئت إذا أراد أن يوصل إليك ما في نفسه لم يقتصر في ذلك التوصيل على العبارة بنظم حروف ولا بد فإن الغرض من ذلك إذا كان إنما هو إعلامك بالأمر الذي في نفس ذلك المعلم إياك فوقتا بالعبارة اللفظية المنطوق بها في اللسان المسماة في العرف قولا وكلاما ووقتا بالإشارة بيد أو برأس أو بما كان ووقتا بكتاب ورقوم ووقتا بما يحدث من ذلك المريد إفهامك بما يريد الحق أن يفهمك فيوجد فيك أثرا تعرف منه ما في نفسه ويسمى هذا كله أيضا كلاما كما قال تعالى أَخْرَجْنا لَهُمْ دَابَّةً من الْأَرْضِ تُكَلِّمُهُمْ فأخبر أنها تكلمنا وذلك أنها إذا خرجت من أجياد وهي دابة أهلب كثيرة الشعر لا يعرف قبلها من دبرها يقال لها الجساسة فتنفخ فتسم بنفخها وجوه الناس شرقا وغربا جنوبا وشمالا برا وبحرا فيرتقم في جبين كل شخص ما هو عليه في علم الله من إيمان وكفر فيقول من سمته مؤمنا لمن‏\nسمته كافرا يا كافر أعطني كذا وكذا وما يريد أن يقول له فلا يغضب لذلك الاسم لأنه يعلم أنه مكتوب في جبينه كتابة لا يمكنه إزالتها فيقول الكافر للمؤمن نعم أو لا في قضاء ما طلب منه بحسب ما يقع فكلامها المنسوب إليها ما هو في العموم سوى ما وسمت به الوجوه بنفختها وإن كان لها كلام مع من يشاهدها أو يجالسها من أي أهل لسان كان فهي تكلمه بلسانه من عرب أو عجم على اختلاف اصطلاحاتهم يعلم ذلك كله وقد ورد حديثها في الخبر الصحيح الذي ذكره مسلم في حديث الدجال حين دلت تميما الداري عليه وقالت له إنه إلى حديثك بالأشواق وهي الآن في جزيرة في البحر الذي يلي جهة الشمال وهي الجزيرة التي فيها الدجال‏\n\n\n### [ما من صورة في العالم الأسفل إلا ومثلها في العالم العلوي‏]\n\n\nواعلم أنه ما من صورة في العالم الأسفل إلا ومثلها في العالم العلوي فصور العالم العلوي تحفظ على أمثالها في العالم السفلي الوجود ويؤثر فيها ما تجده من العلم بالأمور التي لا تقدر على إنكارها من نفسها لتحققها بما تجده فهذا أثر الصور العلويات الفلكيات في الصور السفليات العنصريات وتؤثر الصور العنصريات السفليات في الصور العلويات الفلكيات الحسن والقبح والتحرك بالوهب لما تحتاج إليه بما هي عليه من الاستعدادات فلا تقدر الصور العلويات أن تحفظ نفسها عن هذا التأثير لأن لهذا خلقت وبين العالمين رقائق ممتدة من كل صورة إلى مثلها متصلة غير منقطعة على تلك الرقائق يكون العروج والنزول فهي معارج ومدارج وقد يعبر عنها بالمناسبات وبين تلك الصور العلويات الفلكيات وبين الطبيعة رقائق ممتدة عليها ينزل من الطبيعة إلى هذه الصور ما به قوام وجودها فإذا انصبغت بذلك أفاضت على الصور السفليات العنصريات ما به قوام وجودها ولكن من حيث ما هي أجسام وأجساد لا غير ليحفظ عليها صورها وبين هذه الصور العلويات الفلكيات وبين النفس الكلية التي عبر عنها الشارع صَلَّى اللهُ عَليهِ وسَلَّم عن الله باللوح المحفوظ لما حفظ الله عليه ما كتب فيه فلم ينله محو بعد ذلك ولا تبديل فكل شي‏ء فيه وهو المسمى في القرآن بكل شي‏ء تسمية إلهية ومنه كتب الله كتبه وصحفه المنزلة على رسله وأنبيائه مثل قوله تعالى وكَتَبْنا لَهُ في الْأَلْواحِ من كُلِّ شَيْ‏ءٍ وهو اللوح المحفوظ مَوْعِظَةً وتَفْصِيلًا لِكُلِّ شَيْ‏ءٍ وهو اللوح المحفوظ ففصلت الكتب المنزلة مجمله وأبانت عن موعظته فبين هذه الصور وبين هذه النفس رقائق ممتدة من حيث أرواحها المدبرة لصور أجسادها تنزل عليها العلوم والمعارف بما شاء الله إما من العلم به أو العلم بما شاء من المعلومات الموجودات والمعقولات فإذا حصلت أرواح هذه الصور العلويات الفلكيات ما شاء الله من العلوم التي هي لها بمنزلة الغذاء لصورها الجسمية فبه قوام وجودها ونعيمها ولذتها فإذا انصبغت بتلك الأنوار وتحققت بها أفاضت على نفوس الصور السفليات العنصريات من تلك العلوم بحسب ما قبله استعدادها فيتفاضلون في العلم لتفاضل الاستعداد ثم يعلم بعضهم بعضا وليس التعليم إلا رفع الحجب التي حجبها استعدادهم عن قبول ذلك الفيض فكنى عن ذلك الرفع بالتعليم فلم يكن التعليم إلا من ذلك الفيض من تلك الصور العلويات الفلكيات كما يرفع المانع الذي يمنع الماء عن جريته فإذا رفعته جرى الماء في ذلك الموضع الذي كان المانع يمنع من جريته عليه ففاتح هذا السد لم يجر الماء كذلك المعلم من هذه الصور السفليات لغيرها من أمثالها إنما رفع عنها حجاب الجهل والشك فانكشف لذلك الفيض الروحاني فقبلت من العلوم ما لم يكن عندها فتخيلت إن المعلم لها من رفع غطاء جهلها وليس الأمر كذلك فافهم وبين هذه الصور العلويات الفلكيات وبين الصور السفليات العنصريات رقائق ممتدة للأسماء الإلهية والحقائق الربانية وهي الوجوه الخاصة التي لكل ممكن الذي صدر منه عن كلمة كن بالتوجه الإرادي الإلهي الذي لا يعلمه المسبب عنه من غيره وإن كان له وجه خاص من نفسه يعلم ذلك أو يجهله ومن ذلك الوجه يفتقر كل شي‏ء إلى الله لا إلى سببه الكوني وهو السبب الإلهي الأقرب من السبب الكوني فإن السبب الكوني منفصل عنه وهذا السبب لا يتصف بالانفصال عنه ولا بالاتصال المجاور وإن كان أقرب في حق الإنسان من حبل الوريد فقربه أقرب من ذلك فيعطي الله تعالى لكل صورة علوية وسفلية من العلوم الاختصاصية التي لا يعلم بها إلا ذلك المعطى له خاصة ما شاء الله وهذه هي علوم الأذواق التي لا تنقال ولا تنحكى ولا يعرفها إلا من ذاقها وليس في الإمكان أن يبلغها من ذاقها إلى من لم يذقها وبينهم في ذلك تفاضل لا يعرف ولا يمكن أن يعرف عين ما فضله به فلما كان في العلم هذا الاختصاص كان ثم جنات اختصاص‏\n\n\n### [إن العالم من حيث حقيقته قام على أربعة أركان في صورته الجسمية والروحانية]\nأنه ليس في المنازل ولا في المقامات منزل عم جميع العالم والإنسان إلا هذا المنزل فله عموم الرحمة في العالم لأن العالم من حيث حقيقته قام على أربعة أركان في صورته الجسمية والروحانية فهو من حيث طبيعته مربع ومن حيث روحه مربع فمن حيث جسده ذو أربع طبائع عن أركان أربعة ومن حيث روحه عن أم وأب ونفخ وتوجه فجاءته الرحمة من أربعة وجوه لكل وجه رحمة تخصه فالرحمة التي تبقي عليه رطوبته حتى لا تؤثر فيها يبوسته غير الرحمة التي تحفظ عليه يبوسته لئلا تفنيها رطوبته والرحمة التي تحفظ عليه برودته لئلا تفنيها حرارته غير الرحمة التي تحفظ عليه حرارته لئلا تفنيها برودته فتمانعت فبقيت لهذا التمانع والتكافؤ صورة الجسم ما دام هذا التكافؤ والممانعة ومن هذا المنزل انبعثت هذه الرحمات الأربع فمن وقف عليها من نفسه علم ما له ومن لم يقف عليها من نفسه جهل حاله وإنما حجب الله من حجب عن شهودها حتى لا يتكلموا كما ورد في حديث معاذ وحديث عمر وكشفها الله للامناء حيث علم منهم أنهم لا يؤدون الأمانة إلا لأهلها فإن الله قد خلق للعلم أهلا بمثل هذا وجعل وصول العلم إليهم بمثل هذا على نوعين إما منه إليهم وإما من معلم قد علم أمانة غيره وهو أمين مثل ما علم من أمانته فالقى ذلك العلم إليه إذ كان من أهله وهو مأمور من الله تعالى بأداء الأمانة فإذا وقفت على هذه الرحمات من‏\n\n\nنفسك حالت بينك وبين كل ما يؤدي إلى بعدك عن الله تعالى وعن سعادتك واتصفت بالانقياد إلى الله في كل حال بما دعاك إليه هذا أثرها فيك إذا شاهدتها فتورثك الأدب الإلهي ولا يكون هذا الآتي بهذا العلم إليك إلا عالما بك وبما تكون به حياتك وهو من الأرواح السيارة والملائكة أولي الأجنحة على طبقاتها في الأجنحة فأعلاهم أقلهم أجنحة وأقلهم أجنحة من له جناحان فإنه ما ثم من له جناح واحد لا مساعد له إما من جناح أو غيره وقد رأينا حيوانا على فرد رجل وقد خرج من صدره شبه درة المحتسب يحركه تحريك الجناح ويعدو بتلك الحركة ويحرك رجله الواحدة بحيث أن السابق من الخيل لا يلحقه ما بين القل وجيجل ببلاد المغرب فلهذا لنا من لا مساعد له فمن الملائكة من له جناحان إلى ستمائة جناح إلى ما فوق ذلك فهذا علم لا يأتي لمن أتى إليه إلا على يدي ملك كريم مطيع لا يعصي الله ما أمره له جناحان ينزل بهما إلى قلب هذا العبد فإن أجنحة الملائكة للنزول لا للصعود وأجنحة الأجسام العنصرية للصعود لا للنزول لأن الملائكة تجري بطبعها الذي عليه صورة أجسامها إلى أفلاكها التي عنها كان وجودها فإذا نزلت إلى الأرض نزلت طائرة بتلك الأجنحة وهي إذا رجعت إلى أفلاكها ترجع بطبعها بحركة طبيعية وإن حركت أجنحتها حتى أنها لو لم تحرك أجنحتها لصعدت إلى مقرها ومقامها بذاتها وأجسام الطير العنصري يحرك جناحه للصعود ولو ترك تحريك جناحه أو بسطة لنزل إلى الأرض بطبعه فما يبسط جناحه في النزول إلا للوزن في النزول لأنه إن لم يزن نزوله وبقي مع طبعه تأذى في نزوله لقوة حكم الطبع فحركة جناحه في النزول حركة حفظ فاعلم ذلك‏\n\n\n### [أن البهائم تعلم من الإنسان ومن أمر الدار الآخرة]\n\n\nواعلم أن البهائم تعلم من الإنسان ومن أمر الدار الآخرة ومن الحقائق التي الوجود عليها ما يجهله بعض الناس ولا يعلمه كما حكي عن بعضهم أنه رأى رجلا راكبا على حمار وهو يضرب رأس الحمار بقضيب فنهاه الرائي عن ضربه رأس الحمار فقال له الحمار دعه فإنه على رأسه يضرب فجعله عين الحمار وعلم الحمار أنه مجازي بمثل ما فعل معه وقوله دعه لما علم الحمار ما له في ذلك من الخير عند الله أو لعلمه أيضا بأنه ما وفى له بحق ما خلق له من التسخير فعلم أنه مستحق بالضرب فنبه بذلك السامع له أن الشخص إذا لم يجي‏ء بحق ما تعين عليه لصاحبه استحق الضرب أدبا وجزاء لما كان منه وهذه كلها وجوه محققة لصورة هذا الفعل والقول من هذا الحمار إلى غير ذلك من الوجوه التي يطلبها هذا الفعل وقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في ناقته لما هاجر إلى المدينة وبركت الناقة بفناء أبي أيوب الأنصاري فأراد من حضر من أصحابه صَلَّى اللهُ عَليهِ وسَلَّم أن يقيمها والنبي صَلَّى اللهُ عَليهِ وسَلَّم راكب عليها فقال دعوها فإنها مأمورة وقال حبسها حابس الفيل‏\n\n\nيعني عن مكة وحديث الفيل مشهور الصحة فجميع ما سوى الثقلين وبعض الناس والجان على بينة من ربهم في أمرهم من حيوان ونبات وجماد وملك وروح ويتضمن هذا المنزل من العلوم علم الأعداد وعلم الحروف وهو علم الأولياء كذا قال محمد بن علي الترمذي الحكيم وعلم المجمل وعلم الرحمات المختصة بالإنسان وعلم التبيان وعلم البشائر وعلم مراتب الايمان وعلم إقامة نشأة الأعمال من المكلفين وغير\nالمكلفين وعلم التلقي الروحاني المظهر من الملقي الذي هو الحق لا الملك وعلم أداء حقوق الغير وعلم ما يكون من الله لمن مشى في حق أخيه وعلم تولى الحق ذلك بنفسه وعلم ما هي الحضرة الإلهية عليه من الأمان الذي لا يعلمه إلا العالمون بالله ذوقا وعلم تقلب الأحوال فتتقلب لتقلبهم المواهب الإلهية وعلم الآيات والدلالات وعلى ما ذا تدل واختلافها مع أحدية المدلول وعلم ما يحجب القلب عن العلم بالشي‏ء مع وجود البيان في ذلك وعلم العناية الإلهية بوهب العلم وعلم ما يحصل من العلم بطريق الورث وعلم مراتب الحيوان وفيما ذا يتفاضلون وما يكونون فيه على السواء وهل الإنسان يلحق بالحيوان أو هو نوع خاص وبما ذا يختص عن الحيوان وقد علمنا إن كل حيوان فهو ناطق وعلم آداب الملوك وكيف ينبغي أن يكون الملك في ملكه ولنا في هذا الفن كتاب سميناه التدبيرات الإلهية في إصلاح المملكة الإنسانية وعلم النصائح لدفع الضرر والتوقي وعلم التوحيد الذي يختص بالبهائم وعلم جواز الكذب على كل ناطق مع العلم بأنه صادق ما عدا الثقلين فإنهما قد يكذبان في كثير مما يخبرون به وعلم اتخاذ الملوك الجواسيس وما ينبغي للجاسوس أن يظهر به من الصفات في حال تجسسه وما يحمد من ذلك وإن كان كذبا وعلم مشورة الأعلى للأدنى مع علمه بأنه يصل إلى العلم بما يريد العلم به من غير مشورة وكون الحق تعالى أمر نبيه صَلَّى اللهُ عَليهِ وسَلَّم بمشاورة أصحابه في الأمر الذي يعن له إذا لم يوح إليه فيه شي‏ء وعلم‏\n\n\nقول النبي صَلَّى اللهُ عَليهِ وسَلَّم تهادوا تحابوا\n\n\nوما للعطاء في النفوس من الأثر القادح في الايمان هل هو محمود أو مذموم فإن الإحسان محبوب لذاته فهل المحسن مثل ذلك أم ينفصل عن الإحسان فإنها مسألة خطرة عظيمة في إحسان من أمرك الله أن تعاديه فتقبل إحسانه من غير أن يؤثر فيك مودة له إيثار الجناب الله وامتثالا أمره وهذا هو خروج عن الطبع وهو صعب مشكل يمكن أن لا يتصور وقوعه وإن لم يظهر له حكم في الظاهر فإن الباطن لا يمكن له دفع ذلك وعلم الموازنة بين المحسنين فيما أحسنا فيه لشخص بعينه هل يقع للنفس ترجيح من حيث ما أحسنا به لا من حيث الإحسان فإن وقع فيه تفاضل هان الأمر فيه على المؤمن العالم المشاهد إحسان الله العام المسخر وعلم الخواص والظهور به في موطن القربة إلى الله تعالى بذلك وعلم شكر المنعم وعلم ما تستحقه الربوبية مما لا يقع فيه اشتراك وعلم الالتباس للابتلاء وعلم النظر إلى المخطوبة وما أبيح للناظر أن ينظر منها شرعا فإنه أمر بذلك وعلم صورة تعلم العلم وعلم الاعتراف بين يدي المعلم بالجهل وعلم الحيل والمكر والكيد وما يذم من ذلك وما يحمد وعلم الثناء المطلق والمقيد وهل ثم ثناء مطلق أو لا يصح ذلك بالحال وإن أطلقه اللفظ وعلم حصر ما يتقيد به الثناء من كل مثنى ومثنى عليه وفيه علم التخيير من العالم بالحق وفيه علم منزلة الأرض وما زينت به وفيه علم سبب إجابة الله دعاء الكافر والمشرك ومتى يوحد المشرك ربه وفيه علم اندراج النور في الظلمة وفيه علم الخلق والرزق وفيه علم القيامة وفيه علم إنكار الممكن وفيه علم كشف الغيب في حضرة الغيب وفيه علم من ينادي ولا يجاب وفيه علم هل يعم الحشر كل ميت أو لا يحشر إلا بعض الموتى وفيه علم الناقور الذي هو الصور وما هو وفيه علم أي جزاء هو أفضل من عمله أو كل جزاء أفضل من عمله وهو علم شريف وفيه علم عبادة الرب من حيث ما هو مضاف إلى كون ما وفيه علم ما تعطي الرؤية من علم ما كان يعلم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Fifty-Seven: Concerning the Knowledge of the Station of the Beasts (البهائم) in the Divine Presence (الحضرة الإلهية) and their Subjugation under Two Mosaic Secrets.\n\nFar off it is that the curtains and veils (الأستار والكلل) are drawn,\nExcept for a mighty matter, all of it momentous.\n\nIf that which is veiled were to appear to our eyes,\nNeither weariness nor boredom would manifest in us.\n\nAnd inevitably, within its fold, sickness would be averted,\nAnd there would be no medicine, no cure, and no ailments.\n\nNor would the soul wear anything new,\nNor would there be mediation from it, nor intoxication.\n\nIndeed, the veils see their own image in the eye,\nAnd no boredom perceives them in that state.\n\nAnd the eyes of the Cosmos (الكون) are gazing from behind the veil,\nAnd the coverings perceive what the pupils do not see.\n\n### [Assuming the Character of the Divine Names (أسماء إلهية) and Realizing the Pure Angelic Spirits (أرواح طاهرة ملكية) as the Cause of Knowing Things]\n\nKnow, may Allah support you, O seeker, that the knowledge (معرفة) of things as they are in themselves—you will not know this unless Allah causes you to stand upon it from your own self and witnesses it to you from your Essence (ذاتك). Thus, you attain what you sought by direct experience (ذوقا) when you stand upon it through Unveiling (كشفا). There is no path to achieving this except through Pre-eternal Providence (عناية أزلية) that grants you a complete preparedness (استعدادا تاما) to receive it, through spiritual disciplines (رياضات نفسية), physical struggles (مجاهدات بدنية), assuming the character of the Divine Names (تخلق بأسماء إلهية), realizing the pure angelic spirits (تحقق بأرواح طاهرة ملكية), purification through prescribed legal purity (طهارة شرعية مشروعة لا معقولة), detachment from the cosmos (عدم تعلق بأكوان), and emptying the vessel (محل) of all others (الأغيار).\n\nThis is because The Real (الحق) chose nothing for Himself from you except your heart when He illuminated it with faith. Thus, the Majesty of The Real expanded, and whoever possesses this attribute witnesses the contingent things (الممكنات) with the Eye of The Real (عين الحق). They become witnessed (مشهودة) to him, and even if they are not existent (موجودة), they are not lost to him. The light of faith, when it spreads over the Fixed Entities (أعيان الممكنات), unveils to his insight—indeed, to his sight and insight—that these entities, in their state of non-existence (عدمها), are seen and seeing, heard and hearing, through a fixed vision (رؤية ثبوتية) and a fixed hearing (سمع ثبوتي) that has no existence (وجود).\n\nThen the Essence of The Real (عين الحق) desired what He willed from those Entities, and directed upon it, and not upon others like it, His saying, expressed in the Arabic tongue and translated as \"Be!\" (كن). He made the commanded entity hear His command, and the commanded entity hastened, and thus came into being through His Word (كلمته)—nay, rather, it *was* the very Essence of His Word.\n\nThe contingent things (الممكنات), in their state of pre-eternal non-existence (عدمها الأزلي), never ceased knowing the Necessary Existent (الواجب الوجود) by His Essence (لذاته), glorifying Him and magnifying Him with an eternal glorification (تسبيح أزلي) and an ancient essential magnification (تمجيد قديم ذاتي). They had no existent entity (عين موجودة), nor was their ruling (حكم) lost.\n\nIf the state of all contingent things is as we have mentioned, possessing these attributes which preclude ignorance, then how can they, in their state of existence (وجودها) and manifestation to themselves, be inanimate objects (جمادا) that do not speak, or plants (نباتا) that do not realize the magnification of their Creator, or animals (حيوانا) that do not affirm their own state, or humans (إنسانا) that are not attached to their Lord? This is impossible (محال).\n\nTherefore, everything in Existence (الوجود) that is a contingent existent (ممكن موجود) must glorify Allah with His praise, using a tongue that is not understood and a melody to which not everyone pays attention. The People of Unveiling (أهل الكشف) hear it as a witnessing (شهادة), and the believer accepts it through faith and worship. Thus, He, the Exalted, said: <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كَانَ حَلِيمًا غَفُورًا>> (And there is not a thing except that it glorifies [Allah] with His praise, but you do not understand their glorification. Indeed, He is Ever-Forbearing, All-Forgiving).\n\nHe brought the Name of the Veil and the Covering, which is His saying, \"All-Forgiving\" (غَفُورًا), and He brought the Name that necessitates delaying accountability until the Hereafter and not judging it in the immediate world, which is \"The Forbearing\" (الحليم). This is because He knew that among His servants are those deprived of Unveiling (الكشف) and faith (الإيمان)—these are the rationalists (العقلاء), slaves to their thoughts (الأفكار), who rely solely on consideration (الاعتبار). They pass from the manifest (الظاهر) to the hidden (الباطن), separating themselves from the manifest, and thus they express *about* it, since they are neither People of Unveiling nor People of Faith. This is because Allah veiled their eyes from witnessing the true state of existing things (الموجودات) in themselves, nor were they granted faith in their hearts that would possess a light <<يَسْعَى بَيْنَ أَيْدِيهِمْ>> (that runs before them).\n\nAs for the sincere believers, the resolute ones among the Saints (الأولياء), they passed *with* the manifest, not *from* the manifest to the hidden, and they passed from the very letter to the meaning, not expressing *about* it. They saw things with both eyes and witnessed the two paths (النجدين) by the light of their faith. Thus, they were unable to deny what they witnessed or reject what they ascertained.\n\nAllah made them hear the speech (نطق) of existing things—nay, rather, the speech of the contingent things (الممكنات) before their existence. For they are living, speaking, and perceiving through a fixed life (حياة ثبوتية), fixed speech, and fixed perception, since they were in themselves fixed things (أشياء ثبوتية). When they accepted the thing-ness of Existence (شيئية الوجود), they accepted it with all its descriptions (نعوتها) and Attributes (صفاتها). And their description is nothing other than their essence (عينها). Thus, in the state of their existent thing-ness, they are living with an existential life (حياة وجودية), speaking with existential speech, and perceiving with existential perception.\n\nHowever, Allah, the Glorified, has veiled the sight of some of His servants from perceiving this pervasive life, speech, and perception that runs through all existing things (الموجودات). Just as Allah has veiled the insights (بصائر) of the People of Intellect and Thoughts (أهل العقول والأفكار) from perceiving what we have mentioned in all existing things and all contingent things (الممكنات). But the People of Unveiling (أهل الكشف) and Faith are fully aware of the reality of these Entities (الأعيان) in their state of non-existence and existence.\n\nThus, whoever’s life is manifest is called living (حي), and whoever’s life is hidden and does not appear to every eye is called plant (نباتا) or inanimate (جمادا). The matter is divided for the veiled ones (المحجوبين), but for the People of Unveiling and Faith, it is not divided. As for the possessor of Unveiling (الكشف) and Witnessing (الشهود)—the People of Specialization (أهل الاختصاص)—He granted them the Witnessing, but He did not grant the veiled ones their witnessing. So the People of Witnessing say, \"We heard and we saw,\" and the veiled ones say, \"We neither heard nor saw.\" And the People of Faith say, \"We believed and we affirmed.\"\n\nThe Exalted said: <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (And there is not a thing except that it glorifies [Allah] with His praise). And the word *shay’* (thing) is indefinite. And He said: <<أَلَمْ تَرَ أَنَّ اللَّهَ يَسْجُدُ لَهُ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ وَالشَّمْسُ وَالْقَمَرُ وَالنُّجُومُ وَالْجِبَالُ وَالشَّجَرُ وَالدَّوَابُّ>> (Do you not see that to Allah prostrates whoever is in the heavens and whoever is on the earth, and the sun, and the moon, and the stars, and the mountains, and the trees, and the moving creatures [الدَّوَابُّ]). He mentioned the inanimate (جماد), the plant (نبات), and the animal (حيوان), concerning which the disagreement arose between the veiled ones among the People of Intellect and Thoughts and the People of Witnessing and Faith. And the Exalted said: <<وَلِلَّهِ يَسْجُدُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مِنْ دَابَّةٍ>> (And to Allah prostrates whatever is in the heavens and whatever is on the earth of moving creature [دابَّةٍ]). And He said: <<وَيُسَبِّحُ الرَّعْدُ بِحَمْدِهِ>> (And the thunder glorifies [Allah] with His praise). And He said: <<وَلِلَّهِ يَسْجُدُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا وَظِلَالُهُمْ بِالْغُدُوِّ وَالْآصَالِ>> (And to Allah prostrates whoever is in the heavens and the earth, willingly or unwillingly, and their shadows [ظِلَالُهُمْ] in the mornings and the evenings). And He said: <<قَالَتْ نَمْلَةٌ يَا أَيُّهَا النَّمْلُ ادْخُلُوا مَسَاكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ وَهُمْ لَا يَشْعُرُونَ * فَتَبَسَّمَ ضَاحِكًا مِنْ قَوْلِهَا>> (A female ant said: \"O ants, enter your dwellings so that Solomon and his soldiers do not crush you while they perceive not.\" So he smiled, amused at her speech). And He said: <<عُلِّمْنَا مَنْطِقَ الطَّيْرِ>> (We have been taught the speech of the birds). And He reported concerning the hoopoe (الهدهد) that it said to Solomon: <<أَحَطْتُ بِمَا لَمْ تُحِطْ بِهِ وَجِئْتُكَ مِنْ سَبَإٍ بِنَبَإٍ يَقِينٍ * إِنِّي وَجَدْتُ امْرَأَةً تَمْلِكُهُمْ وَأُوتِيَتْ مِنْ كُلِّ شَيْءٍ وَلَهَا عَرْشٌ عَظِيمٌ * وَجَدْتُهَا وَقَوْمَهَا يَسْجُدُونَ لِلشَّمْسِ مِنْ دُونِ اللَّهِ>> (I have encompassed what you have not encompassed, and I have come to you from Sheba with certain news. Indeed, I found a woman ruling over them, and she has been given of all things, and she has a great throne. I found her and her people prostrating to the sun instead of Allah). Look at the knowledge of Allah that He granted this hoopoe in what it mentioned.\n\nAnd the Exalted said: <<أَخْرَجْنَا لَهُمْ دَابَّةً مِنَ الْأَرْضِ تُكَلِّمُهُمْ>> (We will bring forth for them a creature [دَابَّةً] from the earth that will speak to them). Then He informed that a group of servants do not believe this and remove it from its apparent meaning through interpretation (التأويل), saying: <<أَنَّ النَّاسَ كَانُوا بِآيَاتِنَا لَا يُوقِنُونَ>> (that mankind were not certain of Our signs)—meaning, faith in the signs, of which this verse is one, does not settle in their hearts. Rather, they accept it as faith, while a faction among them interprets it in a way other than that intended.\n\nThe Prophet, peace and blessings be upon him, said: \"The wet and the dry bear witness for the caller (Mu'adhdhin) as far as his voice reaches.\"\n\nHe said concerning Uhud: \"This is a mountain that loves us, and we love it.\"\n\nHe said: \"I know a stone in Mecca that used to greet me before I was sent as a Prophet.\"\n\nIt is authentically established that the pebbles glorified Allah in his palm, and the weeping of the palm trunk is established—the trunk he used to lean on when addressing the people before a pulpit was made for him. When the pulpit was made, he left the trunk, and it wept for him, so he descended from his pulpit and went to it and touched it with his hand until it became silent.\n\nIt is established that the poisoned shoulder of the sheep spoke to him. And the Prophet, peace and blessings be upon him, said: \"The Hour will not be established until the tip of a man’s whip speaks to him, and his thigh informs him of what his family did after him.\"\n\nIt is confirmed concerning the killing of the Jews at the end of time that when the Jews hide behind the trees, the tree will say: \"O Muslim, there is a Jew behind me, kill him,\" except for the *Gharqad* tree, for it is cursed and does not warn about those Jews who hide behind it.\n\nHerein lies a wondrous Divine Secret (سر إلهي): that among the trees, there is one that observes the right of the one who seeks refuge in it, relying on Allah’s Mercy and fulfilling the right of neighborliness (حق الجوار), which is one of the praiseworthy attributes in every group and every religion. The Messenger of Allah, peace and blessings be upon him, said to his cousin, Umm Hani: \"We have granted protection to whom you have granted protection, O Umm Hani,\" and the person was a polytheist.\n\nThe Jews are People of the Book (أهل كتاب) in any case, so they are more deserving of having the right of neighborliness fulfilled for them. This was from Allah regarding this tree that the Jews sought refuge in, so it covered them, in order that His saying be realized for us: <<يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشَاءُ>> (He singles out for His Mercy whom He wills).\n\nHe used the word *man* (whom), which is indefinite (نكرة), and everything falls under it, because everything is living and speaking (حي ناطق), and thus falls under His saying *man*. This is because some grammarians believe that the word *man* only applies to those who possess intellect (يعقل). Yet everything glorifies Allah with His praise, and none glorifies except one who comprehends (يعقل) the One he glorifies and praises Him with what He deserves. Therefore, *man* applies to everything, since everything comprehends from Allah that by which it glorifies Him.\n\nMay Allah, the Exalted, grant us faith if we are not among the People of Direct Vision (أهل العيان), Unveiling (الكشف), and Witnessing (الشهود) of these matters, from which Allah has blinded the People of Intellect whose thoughts enslaved them, and the non-believers whose hearts Allah has sealed.\n\nWhoever knows that everything is speaking and looking toward its Lord must feel shame (الحياء) before everything, even before his own self and his limbs. For Allah says: <<يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُمْ بِمَا كَانُوا يَعْمَلُونَ>> (The Day when their tongues, their hands, and their feet will testify against them as to what they used to do). And the Exalted said: <<الْيَوْمَ نَخْتِمُ عَلَى أَفْوَاهِهِمْ وَتُكَلِّمُنَا أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُمْ بِمَا كَانُوا يَكْسِبُونَ>> (This Day We will seal over their mouths, and their hands will speak to Us, and their feet will testify as to what they used to earn). And the Exalted informed that some of the people testified against will say to their skins: <<لِمَ شَهِدْتُمْ عَلَيْنَا * قَالُوا أَنْطَقَنَا اللَّهُ>> (Why did you testify against us? They will say: \"Allah made us speak\"), meaning, the One <<الَّذِي أَنْطَقَ كُلَّ شَيْءٍ>> (Who made everything speak).\n\nO Saint (ولي), let not the skins be more knowledgeable of the matter than you, despite your claim that you are among the People of Intellect and Insight (الإستبصار). These skins have known the speech (نطق) of everything, and that Allah made it speak as He willed. Then He said: <<وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ>> (And you were not concealing yourselves lest your hearing testify against you, or your sight, or your skins). Meaning, it is impossible to conceal yourselves from this, because you only commit the abominations you approach by means of your limbs (الجوارح). They are the very instrument (الآلة) you employ in obedience to Allah or disobedience to Him. Thus, you cannot conceal yourselves from that without which you cannot act. <<وَلَكِنْ ظَنَنْتُمْ أَنَّ اللَّهَ لَا يَعْلَمُ كَثِيرًا مِمَّا تَعْمَلُونَ>> (But you thought that Allah did not know much of what you were doing). This is an address to those who believe that Allah does not know particulars, specifically. Then He said: <<وَذَلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْدَاكُمْ>> (And that was your assumption which you assumed about your Lord. It has ruined you), meaning, it has destroyed you, <<فَأَصْبَحْتُمْ مِنَ الْخَاسِرِينَ>> (and you became among the losers).\n\nLoss (الخسران) is the opposite of profit (الربح), and it is a reduction of the capital. Since the matter is a trade (تجارة), it is described by profit and loss. The Exalted says: <<فَمَا رَبِحَتْ تِجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ>> (So their trade did not profit, nor were they guided), following His saying: <<أُولَئِكَ الَّذِينَ اشْتَرَوُا الضَّلَالَةَ بِالْهُدَى>> (Those are the ones who purchased error [الضَّلَالَةَ] with guidance [الْهُدَى]). When they sold guidance for error, they lost. And He said: <<هَلْ أَدُلُّكُمْ عَلَى تِجَارَةٍ تُنْجِيكُمْ مِنْ عَذَابٍ أَلِيمٍ>> (Shall I guide you to a trade that will save you from a painful punishment?). Then He mentioned what that trade is, saying: <<تُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ اللَّهِ>> (You believe in Allah and His Messenger and strive in the cause of Allah).\n\nThe reason He shifted to the metaphor of trade (التجارة) in these matters, rather than others, is that the Quran was revealed to a Qurayshi in the language of Quraysh in the Hijaz, and they were merchants, unlike the other Bedouins. Since trade was dominant among them, Allah clothed the essence of the Law (الشرع) and Faith (الإيمان) in the terminology of trade, so that it would be closer to their understanding and more suitable to their circumstances.\n\nNow that I have clarified matters for you as they truly are, if you possess insight (نظر) or faith (إيمان), know that I have only informed you of what is contingent (ممكن), not what is impossible (محال).\n\nLet us say, after this sufficient clarification and adequate explanation for the People of Allah’s Path (طريق الله), especially His elite servants, whether they be those granted Unveiling (مكاشف) or believers (مؤمن): The beasts (البهائم) were only singled out with this name, derived from *ibham* (ambiguity/obscurity), because the matter was obscured *to us*. We have already explained to you the knowledge (المعرفة) they possess concerning Allah and existing things (الموجودات). They were only named thus because their affair was obscured to us. The obscurity of their affair stems only from our ignorance of it or our confusion regarding it, so we do not know the true nature of the matter as the People of Unveiling know it. Thus, to those who are not the People of Unveiling and Faith, they are beasts (بهائم) because their affair is obscured to them, even though they see certain actions emanating from some animals that only proceed from sound thought and deliberation (فكر وروية صحيحة) and subtle consideration. Yet these actions proceed from them by instinct (الفطرة), not from thought or deliberation. Allah has obscured their affair to some people, who cannot deny what they observe of the precise crafts emanating from them, such as spiders arranging snares to catch the flies that Allah made their provision, or some animals storing their food according to a known measure and specific quantity, their knowledge of seasons, and their precaution regarding their provisions—eating only half of what they store for fear of drought, so they do not lack sustenance, like the ants. If this is due to deliberation, then they resemble the People of Deliberation, so where is the lack of intellect (عدم العقل) attributed to them? If it is necessary knowledge (علما ضروريا), then they resemble us in what we only perceive by necessity. There is no difference between us and them if Allah were to lift the veil of blindness from our eyes, just as He lifted it from the sight of the People of Witnessing (أهل الشهود) and the insights of the People of Faith. And in the mutual love (عشق) of trees that possess pollination, that is the clearest of signs for the People of Deliberation, if they are fair-minded.\n\n### [That when the Rational Being (العاقل) desires to convey what is in his soul to you, he does not restrict that conveyance to expression through the arrangement of letters]\n\nKnow that the rational being (العاقل), whoever he may be, from any category of the cosmos (العالم) you wish, when he desires to convey what is in his soul to you, he does not necessarily restrict that conveyance to expression through the arrangement of letters. For if the purpose is merely to inform you of the matter in the soul of that instructor, this is done sometimes by verbal expression spoken by the tongue, which is conventionally called speech (*qawl* and *kalam*); sometimes by gesture with a hand or head or whatever it may be; sometimes by writing and inscriptions; and sometimes by what occurs from that person intending to make you understand what The Real (الحق) wills you to understand, whereby an effect is found in you from which you know what is in his soul. All of this is also called speech (*kalam*), as the Exalted said: <<أَخْرَجْنَا لَهُمْ دَابَّةً مِنَ الْأَرْضِ تُكَلِّمُهُمْ>> (We will bring forth for them a creature [دَابَّةً] from the earth that will speak to them).\n\nHe informed that it will speak to us. This is because when it emerges from Ajyad—and it is a shaggy creature (دابة أهلب) with much hair, whose front is not known from its back, called Al-Jassasa (The Spy)—it breathes out, and by its breath, it brands the faces of people, east and west, south and north, land and sea. What is known about them in Allah’s knowledge, whether faith or disbelief, is inscribed on the forehead of every person. The one branded as a believer will say to the one branded as a disbeliever, \"O disbeliever, give me such and such,\" or whatever he wishes to say to him. The disbeliever will not be angered by that name because he knows it is written on his forehead in an inscription that cannot be removed. The disbeliever will say to the believer, \"Yes\" or \"No,\" in fulfilling what was requested of him, according to what occurs.\n\nThe speech attributed to it, generally speaking, is nothing other than what it marks on the faces with its breath. Although it also has speech with whoever witnesses it or sits with it, from any linguistic group, it speaks to him in his own tongue, whether Arab or non-Arab, according to their various conventions. All of this is known. Its tradition has been mentioned in the authentic report recorded by Muslim in the Hadith of the Dajjal, when it guided Tamim al-Dari to him and told him that it longed for his conversation. It is currently on an island in the sea adjacent to the northern direction, which is the island where the Dajjal is located.\n\n### [There is no form in the Lower World (العالم الأسفل) except that its like exists in the Upper World (العالم العلوي)]\n\nKnow that there is no form (صورة) in the Lower World (العالم الأسفل) except that its like exists in the Upper World (العالم العلوي). The forms of the Upper World preserve existence (الوجود) for their counterparts in the Lower World and influence them with the knowledge of things that they cannot deny from themselves, due to their realization of what they find. This is the effect of the celestial Upper Forms (الصور العلويات الفلكيات) upon the elemental Lower Forms (الصور السفليات العنصريات). And the elemental Lower Forms influence the celestial Upper Forms with beauty and ugliness, and with movement by way of gift (الوهب) for what they need, according to the preparedness (الاستعدادات) they possess. The Upper Forms cannot protect themselves from this influence because they were created for this purpose.\n\nBetween the two worlds are subtle extensions (رقائق ممتدة) stretching from every form to its counterpart, connected and unbroken. Upon these extensions occurs the ascent (العروج) and descent (النزول); they are ascents and pathways. They are sometimes expressed as correspondences (المناسبات).\n\nBetween those celestial Upper Forms and Nature (الطبيعة) are subtle extensions upon which descends from Nature to these forms that by which their existence is sustained. When they are dyed by that, they pour forth upon the elemental Lower Forms that by which their existence is sustained, but only insofar as they are bodies and physical forms, in order to preserve their forms.\n\nBetween these celestial Upper Forms and the Universal Soul (النفس الكلية)—which the Lawgiver (الشارع), peace and blessings be upon him, expressed as the Preserved Tablet (اللوح المحفوظ) on behalf of Allah, because Allah preserved what was written upon it, so no erasure or alteration reached it thereafter—everything is in it, and it is Divinely named in the Quran as \"everything.\" From it, Allah wrote His books and His scriptures revealed to His Messengers and Prophets, such as His saying, the Exalted: <<وَكَتَبْنَا لَهُ فِي الْأَلْوَاحِ مِنْ كُلِّ شَيْءٍ>> (And We wrote for him on the tablets [الْأَلْوَاحِ] of every thing), and it is the Preserved Tablet, <<مَوْعِظَةً وَتَفْصِيلًا لِكُلِّ شَيْءٍ>> (an admonition and a detailed explanation of every thing), and it is the Preserved Tablet. The revealed books detailed what was summarized in it and clarified its admonition.\n\nBetween these forms and this Soul are subtle extensions, in terms of their governing spirits (أرواحها المدبرة) for the forms of their bodies. Knowledge (العلوم) and Gnosis (المعارف) descend upon them as Allah wills, whether it is knowledge of Him or knowledge of whatever existing and intelligible things He wills. When the spirits of these celestial Upper Forms acquire the knowledge that Allah wills—which is for them like nourishment for their physical forms, and by which their existence, bliss, and pleasure are sustained—when they are dyed by those lights and realize them, they pour forth upon the souls (نفوس) of the elemental Lower Forms from that knowledge, according to the capacity (استعدادها) they accept. Thus, they differ in knowledge due to the difference in preparedness.\n\nThen some teach others. Teaching (التعليم) is nothing but the lifting of the veils (الحجب) that their preparedness has drawn over the acceptance of that Effusion (الفيض). This lifting is metaphorically referred to as teaching. Teaching is nothing but the removal of the barrier that prevents the flow of water. When you remove it, the water flows in the place where the barrier prevented its flow. The one who opens this dam does not cause the water to flow. Similarly, the teacher among these lower forms, teaching others like them, only removes the veil of ignorance and doubt from them. Thus, the spiritual Effusion (الفيض الروحاني) is unveiled, and they accept knowledge they did not possess. They imagine that the one who removed the covering of their ignorance is the teacher, but the matter is not so, so understand.\n\nBetween these celestial Upper Forms and the elemental Lower Forms are subtle extensions (رقائق ممتدة) belonging to the Divine Names (الأسماء الإلهية) and the Lordly Realities (الحقائق الربانية). These are the specific aspects (الوجوه الخاصة) of every contingent thing (ممكن) from which it originated through the Word \"Be!\" (كن) by means of the Divine Volitional Orientation (التوجه الإرادي الإلهي), which is not known by the effect caused by it, from anything other than itself, even if it has a specific aspect from itself that knows or is ignorant of that. It is through that aspect that everything is in need of Allah, not of its cosmic cause (سببه الكوني). This is the Divine Cause (السبب الإلهي), which is closer than the cosmic cause, for the cosmic cause is separate from it, while this Cause is not characterized by separation from it, nor by adjacent connection, even though it is closer to man than the jugular vein (حبل الوريد).\n\nThus, Allah, the Exalted, grants every upper and lower form specific knowledge (العلوم الاختصاصية) that only the recipient knows. These are the sciences of direct experience (علوم الأذواق) that cannot be spoken or narrated, and are known only by those who taste them. It is not possible for the one who has tasted them to convey them to the one who has not tasted them. There is a difference in degree (تفاضل) between them in this regard that is unknown, and it is impossible to know the exact thing by which He favored him. Since this specialization exists in knowledge, there are also Gardens of Specialization (جنات اختصاص).\n\n### [That the Cosmos (العالم), in terms of its Reality (حقيقته), is established upon Four Pillars in its Physical and Spiritual Form]\n\nThere is no station (منزل) or spiritual rank (مقام) that encompasses the entire Cosmos (العالم) and the Human (الإنسان) except this station. It possesses the universality of Mercy (عموم الرحمة) in the Cosmos, because the Cosmos, in terms of its Reality (حقيقته), is established upon four pillars in its physical and spiritual form. In terms of its nature (طبيعته), it is fourfold, and in terms of its spirit (روحه), it is fourfold. In terms of its body, it possesses four natures derived from four pillars; and in terms of its spirit, it is derived from a mother, a father, a breath (نفخ), and an orientation (توجه).\n\nThus, Mercy (الرحمة) came to it from four aspects, each aspect having a specific mercy. The Mercy that preserves its moisture so that its dryness does not affect it is different from the Mercy that preserves its dryness so that its moisture does not annihilate it. And the Mercy that preserves its coldness so that its heat does not annihilate it is different from the Mercy that preserves its heat so that its coldness does not annihilate it. Thus, they resisted each other, and due to this mutual resistance (التمانع) and equilibrium (التكافؤ), the form of the body remains as long as this equilibrium and resistance persist.\n\nFrom this station (منزل) these four Mercies emanated. Whoever stands upon them from his own self knows what is due to him, and whoever does not stand upon them from his own self is ignorant of his state. Allah only veiled those He veiled from witnessing them so that they would not speak, as mentioned in the Hadith of Mu'adh and the Hadith of Umar. He unveiled them to the trustworthy (الامناء), knowing that they would only convey the trust (الأمانة) to its rightful recipients. For Allah has created people worthy of knowledge such as this, and He made the arrival of knowledge to them in this manner in two ways: either from Him to them, or from a teacher who knows the trustworthiness of another and is himself trustworthy, just as he knows his own trustworthiness. Thus, he conveys that knowledge to him, since he is worthy of it, and he is commanded by Allah, the Exalted, to fulfill the trust.\n\nIf you stand upon these Mercies from your own self, they will intervene between you and everything that leads to your distance from Allah, the Exalted, and from your felicity, and you will be characterized by submission to Allah in every state, according to what this calls you to. This is its effect upon you when you witness it, for it bequeaths to you Divine manners (الأدب الإلهي).\n\nThe one who brings this knowledge to you must be knowledgeable of you and of that by which your life subsists. He is one of the Traveling Spirits (الأرواح السيارة) and the Angels (الملائكة) possessing wings, according to their classes in wings. The highest among them have the fewest wings, and the fewest wings belong to those with two wings. There is none who has only one wing without an assistant, whether another wing or something else. We have seen a creature standing on a single leg, from whose chest emerged something like a pearl of the *muhtasib* (market inspector), which it moves like the movement of a wing, and it runs with that movement, moving its single leg such that the fastest horse cannot catch it between Qull and Jijel in the lands of the Maghreb. Therefore, we have evidence for one who has no assistant.\n\nAmong the angels, there are those with two wings, up to six hundred wings, and more than that. This knowledge only comes to the recipient through the hands of a noble, obedient angel (ملك كريم مطيع) who does not disobey Allah in what He commands him. He has two wings with which he descends to the heart of this servant. For the wings of the angels are for descent, not ascent, while the wings of elemental bodies are for ascent, not descent. This is because the angels move by their nature (طبعها), which is the form of their bodies, toward their spheres (أفلاكها) from which their existence originated. When they descend to the earth, they descend flying with those wings. When they return to their spheres, they return by their nature through a natural movement, even if they move their wings, such that even if they did not move their wings, they would ascend to their abode and station by their essence. The bodies of elemental birds move their wings for ascent, and if they stopped moving or spreading their wings, they would descend to the earth by their nature. They only spread their wings during descent for balance, because if they do not balance their descent and remain subject to their nature, they would be harmed in their descent due to the strength of the rule of nature. Thus, the movement of their wings during descent is a movement of preservation, so know that.\n\n### [That the Beasts (البهائم) know about the Human and about the Affair of the Hereafter]\n\nKnow that the beasts (البهائم) know about the human, about the affair of the Hereafter (الدار الآخرة), and about the Realities (الحقائق) upon which Existence (الوجود) is founded, things that some people are ignorant of and do not know. It is narrated that someone saw a man riding a donkey and striking the donkey’s head with a stick. The observer forbade him from striking the donkey’s head, whereupon the donkey said to him, \"Leave him, for he strikes upon his own head.\" The donkey made the blow his own essence. The donkey knew that the man was being recompensed for what he did to him. His saying, \"Leave him,\" was because the donkey knew the good he would receive from Allah through that, or perhaps because he knew that he had not fulfilled the right of subjugation (التسخير) for which he was created, and thus knew he deserved the beating. By this, he alerted the listener that if a person does not fulfill the right incumbent upon him toward his master, he deserves to be beaten as a discipline and a recompense for his action. These are all verified aspects of the form of this action and speech from this donkey, in addition to other aspects required by this action.\n\nThe Messenger of Allah, peace and blessings be upon him, said concerning his she-camel when he migrated to Medina and she knelt in the courtyard of Abu Ayyub al-Ansari—and those of his companions present wanted to make her stand up while the Prophet, peace and blessings be upon him, was riding her—he said: \"Leave her, for she is commanded.\" And he said: \"The One Who restrained the Elephant restrained her,\" referring to Mecca. The Hadith of the Elephant is famously authentic.\n\nAll things other than the two weighty ones (mankind and jinn)—and some humans and jinn—are upon clear evidence from their Lord concerning their affair, whether animal, plant, inanimate, angel (ملك), or spirit (روح).\n\nThis station (منزل) encompasses the science of numbers (علم الأعداد) and the science of letters (علم الحروف), which is the science of the Saints (علم الأولياء), as stated by Muhammad ibn Ali al-Tirmidhi al-Hakim. It includes the science of the comprehensive (علم المجمل), the science of Mercies specific to the human, the science of clarification (علم التبيان), the science of glad tidings (علم البشائر), the science of the levels of faith (علم مراتب الايمان), the science of establishing the nature of deeds (نشأة الأعمال) from the responsible and non-responsible, the science of spiritual reception (التلقي الروحاني) manifested by the Giver (الملقي), who is The Real (الحق), not the Angel (الملك), the science of fulfilling the rights of others, the science of what comes from Allah for one who acts on behalf of his brother, the science of The Real undertaking that Himself, the science of the security (الأمان) upon which the Divine Presence (الحضرة الإلهية) rests, known only by those who know Allah through direct experience (ذوقا), the science of the transformation of states (تقلب الأحوال), whereby Divine gifts (المواهب الإلهية) transform due to their transformation, the science of signs (الآيات) and indications (الدلالات), what they indicate, and their variation despite the oneness (أحدية) of the indicated object, the science of what veils the heart from knowing a thing despite the existence of clarification regarding it, the science of Divine Providence (العناية الإلهية) in granting knowledge, the science of knowledge acquired through inheritance (الورث), the science of the levels of animals (مراتب الحيوان), how they differ in degree, and in what they are equal, and whether the human is joined to the animal or is a specific type, and by what he is distinguished from the animal (we already know that every animal is speaking/rational), the science of the manners of kings (آداب الملوك) and how a king ought to be in his kingdom (we have a book on this subject which we named *The Divine Governance in Reforming the Human Kingdom* [التدبيرات الإلهية في إصلاح المملكة الإنسانية]), the science of advice for repelling harm and taking precaution, the science of Unity (التوحيد) specific to the beasts (البهائم), the science of the permissibility of lying about every speaker (ناطق) while knowing that he is truthful, except for the two weighty ones (mankind and jinn), for they may lie in much of what they report, the science of kings employing spies (الجواسيس) and the attributes a spy should manifest while spying, and what is praiseworthy in that, even if it is a lie, the science of the superior consulting the inferior, despite the superior knowing that he will attain the desired knowledge without consultation, and the fact that The Real, the Exalted, commanded His Prophet, peace and blessings be upon him, to consult his companions on matters that arose for which he had received no revelation, and the science of the Prophet’s saying: \"Give gifts to one another, and you will love one another,\" and the science of the effect of giving (العطاء) on souls, which might ignite something in faith: is it praiseworthy or blameworthy? For beneficence (الإحسان) is loved for its own sake, so is the benefactor (المحسن) like that, or is he separate from the beneficence? This is a serious and critical issue concerning the beneficence of one whom Allah commanded you to oppose: do you accept his beneficence without allowing it to generate affection for him, prioritizing the Divine command and obeying His order? This is a departure from nature, which is difficult and problematic, and its occurrence may not be conceivable, even if its ruling does not appear outwardly, for the inner self cannot repel that.\n\nIt includes the science of balancing between benefactors regarding the beneficence they offered to a specific person: does the soul prioritize based on the *thing* they offered, not the beneficence itself? If there is a difference in degree in this, the matter is easy for the believing, knowledgeable person who witnesses the universal, subjugating beneficence of Allah.\n\nIt includes the science of special properties (الخواص) and manifesting them in the station of proximity (القربة) to Allah through them, the science of thanking the Benefactor (المنعم), the science of what Lordship (الربوبية) deserves, in which there is no partnership, the science of confusion (الالتباس) for the sake of trial (الابتلاء), the science of looking at the betrothed woman (المخطوبة) and what the viewer is legally permitted to see of her, as he was commanded to do so, the science of the form of acquiring knowledge, the science of admitting ignorance before the teacher, the science of stratagems (الحيل), cunning (المكر), and plotting (الكيد), and what is blameworthy and praiseworthy among them, the science of absolute and restricted praise (الثناء المطلق والمقيد), and whether absolute praise exists, or if it is never valid in reality, even if the wording is absolute, the science of restricting what praise is bound by, concerning every praiser and praised one.\n\nIt contains the science of choice (التخيير) from the knower of The Real. It contains the science of the station of the Earth and what it is adorned with. It contains the science of the reason Allah answers the prayer (دعاء) of the disbeliever and the polytheist, and when the polytheist affirms the Unity of his Lord. It contains the science of the inclusion of light (النور) within darkness (الظلمة). It contains the science of creation (الخلق) and provision (الرزق). It contains the science of the Resurrection (القيامة). It contains the science of denying the contingent (الممكن). It contains the science of the Unveiling of the Unseen (كشف الغيب) in the Presence of the Unseen (حضرة الغيب). It contains the science of who calls out but is not answered. It contains the science of whether the Gathering (الحشر) encompasses every dead person, or if only some of the dead are gathered. It contains the science of the Trumpet (الناقور), which is the Horn (الصور), and what it is. It contains the science of which reward is better than one's deed, or if every reward is better than one's deed—this is a noble science. It contains the science of worshipping the Lord (الرب) from the perspective of His being attributed to a specific existence. It contains the science of what vision (الرؤية) grants in terms of knowledge that was previously known. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (says the truth, and He guides to the way).",
    "ur": "باب نمبر تین سو ستاون: معرفتِ منزلِ بہائم (جانوروں) کا مقام، حضرتِ الٰہیہ (الحضرة الإلهية) میں، اور ان کا دو موسوی رازوں کے تحت مغلوب ہونا۔\n\nہائے افسوس! پردے اور غلاف نہیں لٹکائے جاتے، مگر کسی عظیم الشان معاملے کے لیے۔\nاگر وہ چیز جو چھپائی گئی ہے ہماری آنکھوں کے سامنے ظاہر ہو جائے، تو ہم میں نہ کوئی کمزوری باقی رہے اور نہ کوئی اکتاہٹ۔\nاور نہ ہی اس کے اندر کوئی بیماری ظاہر ہو، نہ کوئی دوا، نہ طب اور نہ کوئی علت۔\nاور نہ ہی کوئی نئی چیز ہو جسے نفس پہنے، نہ اس سے کوئی توسط (درمیانی حالت) اور نہ ہی کوئی نشہ۔\nبے شک پردے آنکھ میں اپنی صورت دیکھتے ہیں، اور اس میں کوئی اکتاہٹ نہیں پاتا۔\nاور کائنات کی آنکھیں پردے کے پیچھے سے دیکھ رہی ہیں، اور حجابات وہ دیکھتے ہیں جو آنکھیں نہیں دیکھ سکتیں۔\n\n### اسماءِ الٰہیہ (أسماء إلهية) سے متصف ہونا اور طاہر ملکی ارواح (أرواح طاهرة ملكية) سے متحقق ہونا امور کی معرفت کا سبب ہے۔\n\nاے طالب! اللہ تمہاری مدد کرے، جان لو کہ امور کی معرفت جیسا کہ وہ اپنی حقیقت میں ہیں، تم اسے نہیں جان سکتے جب تک کہ اللہ تمہیں تمہارے نفس سے اس پر مطلع نہ کر دے اور تمہاری ذات سے اس کا مشاہدہ نہ کرا دے۔ تب تمہیں وہ چیز ذوقاً حاصل ہو جائے گی جسے تم نے کشف (الکشف) کے ذریعے طلب کیا تھا۔ اور اس کے حصول کا کوئی راستہ نہیں مگر ازلی عنایت کے ذریعے جو تمہیں اسے قبول کرنے کے لیے مکمل استعداد عطا کرے، نفسانی ریاضتوں، بدنی مجاہدوں، اسماءِ الٰہیہ (أسماء إلهية) سے متصف ہونے، طاہر ملکی ارواح (أرواح طاهرة ملكية) سے متحقق ہونے، اور شرعی طہارت سے پاکیزگی حاصل کرنے کے ذریعے جو کہ مشروع ہے نہ کہ معقول۔ نیز اکوان (کائنات) سے تعلق نہ رکھنا اور محل (دل) کو تمام اغیار سے خالی کرنا ضروری ہے، کیونکہ ذات حق (الحق) نے تمہارے اندر سے اپنے لیے تمہارے دل کے سوا کسی چیز کو منتخب نہیں کیا، جب اس نے اسے ایمان سے منور کیا۔ پس اس نے جلالِ حق کو وسعت دی، اور جس کی یہ صفت ہو وہ ممکنات کو عینِ حق سے دیکھتا ہے، لہٰذا وہ اس کے لیے مشہود (الشہود) ہوتی ہیں اگرچہ وہ موجود نہ ہوں، تو وہ اس کے لیے مفقود نہیں ہوتیں۔\n\nاور اس کی بصیرت کے لیے، بلکہ اس کی آنکھ اور بصیرت دونوں کے لیے، ایمان کا نور اس وقت منکشف ہوا جب وہ ممکنات کے اعیان (حقائق) پر پھیلا، کہ وہ اپنی عدم کی حالت میں بھی دیکھی جانے والی، دیکھنے والی، سنی جانے والی اور سننے والی ہیں، ثبوتی رؤیت اور ثبوتی سماعت کے ساتھ، اگرچہ ان کا وجود نہیں ہے۔ پس ذات حق (الحق) نے ان اعیان میں سے جسے چاہا، اس پر، نہ کہ اس کے ہم مثل کسی اور پر، اپنا وہ قول متوجہ کیا جسے عربی زبان میں \"کن\" (ہو جا) سے تعبیر کیا جاتا ہے، تو اس نے اپنا حکم اسے سنایا۔ پس مامور نے جلدی کی اور وہ اس کے کلمے سے وجود میں آ گیا، بلکہ وہ عین اس کا کلمہ تھا۔ اور ممکنات اپنی ازلی عدم کی حالت میں ہمیشہ سے واجب الوجود لذاتہ کو پہچانتی رہی ہیں اور اس کی تسبیح کرتی رہی ہیں اور اس کی تمجید کرتی رہی ہیں، ازلی تسبیح اور قدیم ذاتی تمجید کے ساتھ، حالانکہ نہ ان کا کوئی موجود عین تھا اور نہ ان کا کوئی مفقود حکم۔\n\nپس جب تمام ممکنات کا حال ان صفات پر ہے جن کا ہم نے ذکر کیا، جن کے ساتھ جہالت نہیں ہے، تو وہ اپنے وجود اور اپنے لیے ظاہر ہونے کی حالت میں کیسے ہو سکتی ہیں کہ وہ ایسی جمادات ہوں جو بولتی نہ ہوں، یا ایسی نباتات ہوں جو اپنے خالق کی تعظیم سے متحقق نہ ہوں، یا ایسے حیوان ہوں جو اپنے حال سے سچ نہ بولتے ہوں، یا ایسے انسان ہوں جو اپنے رب سے تعلق نہ رکھتے ہوں؟ یہ محال ہے۔ لہٰذا ضروری ہے کہ ہستی (الوجود) میں موجود ہر ممکن چیز اللہ کی حمد کے ساتھ تسبیح کرتی ہو، ایسی زبان سے جسے ہر کوئی نہیں سمجھتا اور ایسی دھن سے جس کی طرف ہر کوئی متوجہ نہیں ہوتا۔ پس اہل کشف (الکشف) اسے شہادت کے طور پر سنتے ہیں اور مومن اسے ایمان اور عبادت کے طور پر قبول کرتا ہے۔ اللہ تعالیٰ نے فرمایا:\n**وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كَانَ حَلِيمًا غَفُورًا**\n(اور کوئی چیز نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے، لیکن تم ان کی تسبیح کو نہیں سمجھتے۔ بے شک وہ بڑا بردبار، بڑا بخشنے والا ہے۔)\n\nپس وہ حجاب اور پردے کے نام کے ساتھ آیا، اور وہ اس کا قول \"غَفُورًا\" (بخشنے والا) ہے۔ اور وہ اس نام کے ساتھ آیا جو مؤاخذے کو آئندہ وقت تک مؤخر کرنے اور دنیا میں اس کا حکم نہ ہونے کا تقاضا کرتا ہے، اور وہ \"الحلیم\" (بردبار) ہے۔ کیونکہ اللہ جانتا تھا کہ اس کے بندوں میں ایسے لوگ بھی ہیں جو کشف (الکشف) اور ایمان سے محروم ہیں، اور وہ عقلمند ہیں جو افکار کے غلام ہیں اور اعتبار (غور و فکر) پر ٹھہرے ہوئے ہیں۔ پس وہ ظاہر سے باطن کی طرف گزرے، ظاہر کو چھوڑ کر، اور اس سے تعبیر کیا، کیونکہ وہ نہ اہل کشف تھے اور نہ اہل ایمان، اس لیے کہ اللہ نے ان کی آنکھوں کو اس مشاہدے سے پردہ کر دیا تھا کہ موجودات اپنی حقیقت میں کیا ہیں، اور نہ ہی انہیں ان کے دلوں میں ایسا ایمان نصیب ہوا جس کا نور **يَسْعَى بَيْنَ أَيْدِيهِمْ** (ان کے آگے آگے دوڑتا ہو)۔\n\nلیکن سچے مومن، اولو العزم اولیاء، تو انہوں نے ظاہر کے ساتھ ہی تعبیر کی، نہ کہ ظاہر سے باطن کی طرف۔ اور عین حرف سے معنی کی طرف گئے، نہ کہ اس سے تعبیر کیا۔ پس انہوں نے امور کو دونوں آنکھوں سے دیکھا اور اپنے ایمان کے نور سے دونوں راستوں کا مشاہدہ کیا۔ لہٰذا ان کے لیے ممکن نہ رہا کہ وہ اس کا انکار کریں جس کا انہوں نے مشاہدہ کیا، اور نہ ہی اس کا انکار کیا جس کا انہیں یقین ہو گیا۔ پس اللہ نے انہیں موجودات کا نطق (بولنا) سنایا، بلکہ ممکنات کا نطق ان کے وجود سے پہلے ہی سنایا۔ کیونکہ وہ ثبوتی حیات، ثبوتی نطق اور ثبوتی ادراک کے ساتھ زندہ، بولنے والی اور ادراک کرنے والی ہیں، جب وہ اپنی حقیقت میں ثبوتی اشیاء تھیں۔ پس جب انہوں نے وجود کی شیئیت (شے ہونا) کو قبول کیا تو اسے اپنی تمام صفات اور نعوت کے ساتھ قبول کیا، اور ان کی نعت ان کے عین کے سوا کچھ نہیں۔ پس وہ اپنے وجود کی شیئیت کی حالت میں وجودی حیات کے ساتھ زندہ، وجودی نطق کے ساتھ بولنے والی، اور وجودی ادراک کے ساتھ ادراک کرنے والی ہیں۔ مگر یہ کہ اللہ سبحانہ نے اپنے بعض بندوں کی آنکھوں کو اس جاری و ساری حیات، نطق اور ادراک کے ادراک سے روک دیا جو تمام موجودات میں جاری ہے۔ جیسا کہ اللہ نے اہل عقول اور افکار کی بصیرتوں کو تمام موجودات اور تمام ممکنات میں اس چیز کے ادراک سے روک دیا جس کا ہم نے ذکر کیا۔ اور اہل کشف (الکشف) اور ایمان ان اعیان کے بارے میں علم رکھتے ہیں کہ وہ عدم اور وجود دونوں حالتوں میں کس حال پر ہیں۔\n\nپس جس کی حیات ظاہر ہوئی اسے زندہ کہا گیا، اور جس کی حیات پوشیدہ رہی اور ہر آنکھ کے لیے ظاہر نہ ہوئی اسے نباتات اور جمادات کہا گیا۔ پس محجوب لوگوں کے نزدیک معاملہ تقسیم ہو گیا، جبکہ اہل کشف (الکشف) اور ایمان کے نزدیک تقسیم نہیں ہوا۔ لیکن اہل اختصاص، یعنی صاحب کشف (الکشف) اور شہود (الشہود)، انہیں مشاہدہ عطا کیا گیا، اور محجوب لوگوں کو ان کا مشاہدہ عطا نہیں کیا گیا۔ پس اہل شہود کہتے ہیں: ہم نے سنا اور دیکھا۔ اور محجوب کہتے ہیں: ہم نے نہ سنا اور نہ دیکھا۔ اور اہل ایمان کہتے ہیں: ہم ایمان لائے اور تصدیق کی۔ اللہ تعالیٰ نے فرمایا:\n**وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ**\n(اور کوئی چیز نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے)۔ اور \"شیء\" (چیز) نکرہ (عام) ہے۔ اور فرمایا:\n**أَلَمْ تَرَ أَنَّ اللَّهَ يَسْجُدُ لَهُ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ وَالشَّمْسُ وَالْقَمَرُ وَالنُّجُومُ وَالْجِبَالُ وَالشَّجَرُ وَالدَّوَابُّ**\n(کیا تم نے نہیں دیکھا کہ اللہ ہی کو سجدہ کرتے ہیں جو آسمانوں میں ہیں اور جو زمین میں ہیں، اور سورج، اور چاند، اور ستارے، اور پہاڑ، اور درخت، اور جانور)۔\nپس اس نے جمادات، نباتات اور حیوانات کا ذکر کیا جن کے بارے میں اہل عقول و افکار میں اور اہل شہود (الشہود) و ایمان میں اختلاف واقع ہوا۔ اور اللہ تعالیٰ نے فرمایا:\n**وَلِلَّهِ يَسْجُدُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مِنْ دَابَّةٍ**\n(اور اللہ ہی کو سجدہ کرتے ہیں جو آسمانوں میں ہیں اور جو زمین میں ہیں، ہر چلنے والا جانور)۔\nاور فرمایا:\n**وَيُسَبِّحُ الرَّعْدُ بِحَمْدِهِ**\n(اور بادل کی گرج اس کی حمد کے ساتھ تسبیح کرتی ہے)۔\nاور فرمایا:\n**وَلِلَّهِ يَسْجُدُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا وَظِلَالُهُمْ بِالْغُدُوِّ وَالْآصَالِ**\n(اور اللہ ہی کو سجدہ کرتے ہیں جو آسمانوں اور زمین میں ہیں، خوشی سے اور ناخوشی سے، اور ان کے سائے بھی صبح و شام)۔\nاور فرمایا:\n**قَالَتْ نَمْلَةٌ يَا أَيُّهَا النَّمْلُ ادْخُلُوا مَسَاكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ وَهُمْ لَا يَشْعُرُونَ**\n(ایک چیونٹی نے کہا: اے چیونٹیو! اپنے بلوں میں داخل ہو جاؤ، کہیں سلیمان اور اس کے لشکر تمہیں کچل نہ ڈالیں اور انہیں خبر بھی نہ ہو)۔\n**فَتَبَسَّمَ ضَاحِكًا مِنْ قَوْلِهَا**\n(تو وہ اس کی بات پر مسکرائے)۔\nاور فرمایا:\n**عُلِّمْنَا مَنْطِقَ الطَّيْرِ**\n(ہمیں پرندوں کی بولی سکھائی گئی ہے)۔\nاور ہدہد کے بارے میں فرمایا کہ اس نے سلیمان سے کہا:\n**أَحَطْتُ بِمَا لَمْ تُحِطْ بِهِ وَجِئْتُكَ مِنْ سَبَإٍ بِنَبَإٍ يَقِينٍ إِنِّي وَجَدْتُ امْرَأَةً تَمْلِكُهُمْ وَأُوتِيَتْ مِنْ كُلِّ شَيْءٍ وَلَهَا عَرْشٌ عَظِيمٌ وَجَدْتُهَا وَقَوْمَهَا يَسْجُدُونَ لِلشَّمْسِ مِنْ دُونِ اللَّهِ**\n(میں نے ایسی چیز کا احاطہ کیا ہے جس کا آپ نے احاطہ نہیں کیا، اور میں سبا سے آپ کے پاس ایک یقینی خبر لے کر آیا ہوں۔ میں نے ایک عورت کو پایا جو ان پر حکومت کرتی ہے، اور اسے ہر چیز دی گئی ہے، اور اس کا ایک بڑا تخت ہے۔ میں نے اسے اور اس کی قوم کو اللہ کے سوا سورج کو سجدہ کرتے ہوئے پایا)۔\nپس غور کرو کہ اللہ نے اس ہدہد کو اللہ کے بارے میں کتنا علم عطا کیا جو اس نے ذکر کیا۔ اور اللہ تعالیٰ نے فرمایا:\n**أَخْرَجْنَا لَهُمْ دَابَّةً مِنَ الْأَرْضِ تُكَلِّمُهُمْ**\n(ہم ان کے لیے زمین سے ایک جانور نکالیں گے جو ان سے بات کرے گا)۔\nپھر خبر دی کہ بندوں میں سے ایک گروہ اس پر یقین نہیں کرے گا اور تاویل کے ذریعے اسے اس کے ظاہر سے ہٹا دے گا، پس فرمایا:\n**أَنَّ النَّاسَ كَانُوا بِآيَاتِنَا لَا يُوقِنُونَ**\n(بے شک لوگ ہماری آیتوں پر یقین نہیں رکھتے تھے)۔\nیعنی وہ آیات جن میں یہ آیت بھی شامل ہے، ان کے دلوں میں ایمان مستحکم نہیں ہوتا، بلکہ وہ اسے ایمان کے طور پر قبول کرتے ہیں، اور ان میں سے ایک گروہ اس کی تاویل اس کے مقصود معنی کے خلاف کرتا ہے۔\n\nاور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا:\n**حدیث:** \"مؤذن کی آواز کی حد تک ہر تر اور خشک چیز اس کے لیے گواہی دیتی ہے۔\"\nاور احد پہاڑ کے بارے میں فرمایا:\n**حدیث:** \"یہ پہاڑ ہم سے محبت کرتا ہے اور ہم اس سے محبت کرتے ہیں۔\"\nاور فرمایا:\n**حدیث:** \"میں مکہ میں ایک پتھر کو جانتا ہوں جو میرے مبعوث ہونے سے پہلے مجھے سلام کیا کرتا تھا۔\"\nیہ بات صحیح ثابت ہے کہ کنکریوں نے آپ صلی اللہ علیہ وسلم کی ہتھیلی میں تسبیح کی، اور اس تنے کا آپ صلی اللہ علیہ وسلم کی طرف رونا بھی صحیح ثابت ہے جس پر آپ خطبہ دیتے وقت ٹیک لگایا کرتے تھے، اس سے پہلے کہ آپ کے لیے منبر بنایا جائے۔ جب آپ کے لیے منبر بنایا گیا تو آپ نے اسے چھوڑ دیا، تو وہ رویا۔ پس آپ منبر سے نیچے اترے اور اس کے پاس آئے اور اسے اپنے ہاتھ سے چھوا یہاں تک کہ وہ پرسکون ہو گیا۔\nاور یہ بھی صحیح ہے کہ زہر آلود بکری کے شانے نے آپ سے بات کی۔ اور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا:\n**حدیث:** \"قیامت قائم نہیں ہو گی یہاں تک کہ آدمی سے اس کے کوڑے کا کنارہ بات کرے گا اور اس کی ران اسے خبر دے گی کہ اس کے اہل نے اس کے بعد کیا کیا۔\"\nاور آپ سے یہ بھی ثابت ہے کہ آخری زمانے میں یہودیوں کے قتل کے وقت جب یہودی درخت کے پیچھے چھپیں گے تو درخت کہے گا: \"اے مسلمان! میرے پیچھے ایک یہودی ہے، اسے قتل کر دے۔\" سوائے غرقد کے درخت کے، کیونکہ وہ ملعون ہے، وہ یہودیوں کے بارے میں خبردار نہیں کرے گا جو اس کے پیچھے چھپتے ہیں۔\n\nاور یہاں ایک عجیب الٰہی راز ہے، جس سے معلوم ہوتا ہے کہ بعض درختوں نے اس شخص کے حق کو ملحوظ رکھا جس نے ان کی پناہ لی، اس درخت کے اللہ کی رحمت پر بھروسہ کرنے اور حقِ جوار (پڑوسی کے حق) کو پورا کرنے کی وجہ سے، اور یہ ہر گروہ اور ہر ملت میں قابل تعریف صفات میں سے ہے۔ اور رسول اللہ صلی اللہ علیہ وسلم نے اپنی چچا زاد بہن ام ہانی سے فرمایا:\n**حدیث:** \"اے ام ہانی! جسے تم نے پناہ دی، ہم نے اسے پناہ دے دی۔\" حالانکہ وہ مشرک تھا۔\n\nاور یہودی بہرحال اہل کتاب ہیں، لہٰذا وہ حقِ جوار پورا کیے جانے کے زیادہ حقدار ہیں۔ اور یہ اللہ کی طرف سے اس درخت کے حق میں تھا جس کی یہودیوں نے پناہ لی، تو اس نے انہیں چھپا لیا، تاکہ ہمارے نزدیک اس کا قول متحقق ہو جائے:\n**يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشَاءُ**\n(وہ اپنی رحمت کے ساتھ جسے چاہتا ہے خاص کر لیتا ہے)۔\nپس وہ لفظ \"مَن\" (جو کوئی) کے ساتھ آیا، اور یہ نکرہ (عام) ہے، لہٰذا اس کے تحت ہر چیز داخل ہو گئی، کیونکہ ہر چیز زندہ اور ناطق ہے، لہٰذا وہ اس کے قول \"مَن\" کے تحت داخل ہو گئی۔ کیونکہ بعض نحوی یہ سمجھتے ہیں کہ لفظ \"مَن\" صرف عاقل پر ہی استعمال ہوتا ہے، حالانکہ ہر چیز اللہ کی حمد کے ساتھ تسبیح کرتی ہے، اور تسبیح وہی کرتا ہے جو اس ذات کو پہچانتا ہو جس کی وہ تسبیح کر رہا ہے اور اس کی تعریف کر رہا ہو جس کا وہ مستحق ہے۔ پس \"مَن\" ہر چیز پر واقع ہوتا ہے، کیونکہ ہر چیز اللہ کی طرف سے اس چیز کو سمجھتی ہے جس کے ساتھ وہ اس کی تسبیح کرتی ہے۔ پس اللہ تعالیٰ ہمیں ایمان عطا فرمائے اگر ہم ان امور کے اہل عیان، کشف (الکشف) اور شہود (الشہود) میں سے نہیں ہیں جن سے اللہ نے اہل عقول کو اندھا کر دیا ہے جنہیں ان کے افکار نے غلام بنا لیا ہے، اور ان غیر مومنوں کو جن کے دلوں پر اللہ نے مہر لگا دی ہے۔\n\nپس جو یہ جان لے کہ ہر چیز ناطق ہے اور اپنے رب کی طرف دیکھ رہی ہے، تو اس پر لازم ہے کہ وہ ہر چیز سے حیا کرے، یہاں تک کہ اپنے نفس اور اپنے اعضاء سے بھی۔ کیونکہ اللہ فرماتا ہے:\n**يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُمْ بِمَا كَانُوا يَعْمَلُونَ**\n(جس دن ان کے خلاف ان کی زبانیں، ان کے ہاتھ اور ان کے پاؤں گواہی دیں گے جو کچھ وہ کرتے تھے)۔\nاور اللہ تعالیٰ نے فرمایا:\n**الْيَوْمَ نَخْتِمُ عَلَى أَفْوَاهِهِمْ وَتُكَلِّمُنَا أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُمْ بِمَا كَانُوا يَكْسِبُونَ**\n(آج ہم ان کے مونہوں پر مہر لگا دیں گے اور ان کے ہاتھ ہم سے بات کریں گے اور ان کے پاؤں گواہی دیں گے جو کچھ وہ کماتے تھے)۔\nاور اللہ تعالیٰ نے بعض ان لوگوں کے بارے میں خبر دی جن پر گواہی دی جائے گی کہ وہ اپنی کھالوں سے کہیں گے:\n**لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنَا قَالُوا أَنْطَقَنَا اللَّهُ**\n(تم نے ہمارے خلاف کیوں گواہی دی؟ وہ کہیں گے: ہمیں اللہ نے بولنے کی طاقت دی ہے)۔\nیعنی تم پر گواہی دینے کے ذریعے، **الَّذِي أَنْطَقَ كُلَّ شَيْءٍ** (جس نے ہر چیز کو بولنے کی طاقت دی)۔\nپس اے ولی! تمہاری کھالیں تم سے زیادہ اس معاملے کو جاننے والی نہ بنیں، باوجود اس کے کہ تم عقل اور بصیرت کے اہل ہونے کا دعویٰ کرتے ہو۔ پس ان کھالوں نے ہر چیز کے نطق کو جان لیا اور یہ کہ اللہ نے اسے اپنی مشیت کے مطابق بولنے کی طاقت دی۔ پھر فرمایا:\n**وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ**\n(اور تم اس سے چھپتے نہیں تھے کہ تمہارے کان، تمہاری آنکھیں اور تمہاری کھالیں تمہارے خلاف گواہی دیں)۔\nیعنی اس سے چھپنا ممکن نہیں، کیونکہ تم جو منکرات کرتے ہو وہ اعضاء کے بغیر نہیں کرتے، کیونکہ وہ عین آلہ ہیں جنہیں تم اللہ کی اطاعت یا نافرمانی میں استعمال کرتے ہو۔ لہٰذا تم اس چیز سے چھپ نہیں سکتے جس کے بغیر تم عمل نہیں کر سکتے۔\n**وَلَكِنْ ظَنَنْتُمْ أَنَّ اللَّهَ لَا يَعْلَمُ كَثِيرًا مِمَّا تَعْمَلُونَ**\n(لیکن تم نے یہ گمان کیا کہ اللہ تمہارے بہت سے اعمال کو نہیں جانتا)۔ یہ خطاب ان لوگوں سے ہے جو یہ عقیدہ رکھتے ہیں کہ اللہ خاص طور پر جزئیات کو نہیں جانتا۔ پھر فرمایا:\n**وَذَلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْدَاكُمْ**\n(اور تمہارا یہی گمان جو تم نے اپنے رب کے بارے میں کیا، اس نے تمہیں ہلاک کر دیا)۔ یعنی تمہیں ہلاک کر دیا۔\n**فَأَصْبَحْتُمْ مِنَ الْخَاسِرِينَ**\n(پس تم خسارہ پانے والوں میں سے ہو گئے)۔\nاور خسارہ نفع کی ضد ہے، اور یہ اصل سرمائے میں کمی ہے۔ چونکہ یہ معاملہ تجارت تھا، اس لیے اسے نفع اور خسارے سے متصف کیا گیا۔ اللہ تعالیٰ فرماتا ہے:\n**فَمَا رَبِحَتْ تِجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ**\n(پس ان کی تجارت نے کوئی نفع نہ دیا اور وہ ہدایت پانے والے نہ تھے)۔\nیہ اس کے قول کے بعد ہے:\n**أُولَئِكَ الَّذِينَ اشْتَرَوُا الضَّلَالَةَ بِالْهُدَى**\n(یہ وہ لوگ ہیں جنہوں نے ہدایت کے بدلے گمراہی خریدی)۔\nپس جب انہوں نے ہدایت کو گمراہی کے بدلے بیچ دیا تو خسارہ اٹھایا۔ اور فرمایا:\n**هَلْ أَدُلُّكُمْ عَلَى تِجَارَةٍ تُنْجِيكُمْ مِنْ عَذَابٍ أَلِيمٍ**\n(کیا میں تمہیں ایسی تجارت نہ بتاؤں جو تمہیں دردناک عذاب سے نجات دے؟)\nپھر اس تجارت کا ذکر کیا، پس فرمایا:\n**تُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ اللَّهِ**\n(تم اللہ اور اس کے رسول پر ایمان لاؤ اور اللہ کی راہ میں جہاد کرو)۔\nاور ان امور میں تجارت کی طرف رجوع اس لیے کیا گیا کہ قرآن ایک قریشی پر قریش کی زبان میں حجاز میں نازل ہوا، اور وہ اعراب کے برعکس تاجر تھے۔ پس جب ان پر تجارت غالب تھی، تو اللہ نے شریعت اور ایمان کی ذات کو تجارت کا لفظ پہنایا تاکہ یہ ان کی سمجھ کے قریب ہو اور ان کے حالات کے مناسب ہو۔\nاور اس کے بعد کہ میں نے تمہارے لیے امور کو واضح کر دیا جیسا کہ وہ ہیں، اگر تم صاحبِ نظر یا صاحبِ ایمان ہو، تو میں نے تمہیں صرف ممکن کی خبر دی ہے، محال کی خبر نہیں دی۔\nپس اس شافی بیان اور کافی وضاحت کے بعد، جو خاص طور پر اہل طریق اللہ اور اس کے خاص بندوں میں سے مکاشف (کشف پانے والے) اور مومن کے لیے ہے، ہم کہتے ہیں کہ بہائم (جانوروں) کو یہ نام جو \"ابہام\" (پوشیدگی) اور \"مبہم\" (پوشیدہ) سے مشتق ہے، صرف اس لیے ملا کہ ان کا معاملہ ہم پر مبہم ہو گیا۔ کیونکہ ہم نے تمہارے لیے بیان کر دیا کہ وہ اللہ اور موجودات کی معرفت (المعرفۃ) کے لحاظ سے کس حال پر ہیں۔ اور انہیں یہ نام صرف اس لیے دیا گیا کہ ان کا معاملہ ہم پر مبہم ہو گیا تھا۔ پس ان کے معاملے کا ابہام صرف اس وجہ سے ہے کہ ہم اسے نہیں جانتے یا اس میں حیران ہیں، لہٰذا ہم معاملے کی صورت کو اس طرح نہیں جانتے جس طرح اہل کشف (الکشف) جانتے ہیں۔ پس وہ اہل کشف (الکشف) اور ایمان کے علاوہ دوسروں کے نزدیک بہائم ہیں، کیونکہ ان کا معاملہ ان پر مبہم ہے۔\nیہ اس لیے ہے کہ وہ بعض حیوانات سے ایسے اعمال دیکھتے ہیں جو صحیح فکر اور گہری بصیرت کے بغیر صادر نہیں ہو سکتے، لیکن وہ (حیوانات) یہ اعمال فطرت کے ذریعے کرتے ہیں، نہ کہ فکر یا بصیرت کے ذریعے۔ پس اللہ نے بعض لوگوں پر ان کا معاملہ مبہم کر دیا، اور وہ ان محکم صنعتوں کا انکار نہیں کر سکتے جو ان سے صادر ہوتی ہیں۔ اسی وجہ سے وہ کتاب و سنت میں ان کے نطق اور ان کی طرف قول کی نسبت کو تاویل سے بیان کرتے ہیں۔ کاش میں جانتا کہ وہ اس مشاہدے کے بارے میں کیا کرتے ہیں جو وہ ان محکم افعال میں دیکھتے ہیں جو ان سے صادر ہوتے ہیں، جیسے مکڑیوں کا جال بننا تاکہ مکھیوں کا شکار کریں جن میں اللہ نے ان کا رزق رکھا ہے، اور بعض حیوانات کا اپنی خوراک کو معلوم میزان اور مخصوص مقدار پر ذخیرہ کرنا، اور ان کا زمانوں کا علم رکھنا، اور اپنی خوراک میں اپنے لیے احتیاط کرنا، پس وہ قحط کے خوف سے اپنے ذخیرہ کا نصف کھاتے ہیں تاکہ انہیں قوت حاصل کرنے کے لیے کچھ نہ ملے، جیسے چیونٹیاں۔ پس اگر یہ نظر (فکر) سے ہے تو وہ اہل نظر سے مشابہت رکھتے ہیں، تو پھر وہ عدمِ عقل کہاں گیا جو ان کی طرف منسوب کیا جاتا ہے؟ اور اگر یہ علمِ ضروری ہے، تو وہ اس چیز میں ہمارے مشابہ ہو گئے جسے ہم صرف ضرورت کے ذریعے ہی ادراک کرتے ہیں۔ پس اگر اللہ ہماری آنکھوں سے اندھے پن کا پردہ ہٹا دے، جیسا کہ اس نے اہل شہود (الشہود) کی آنکھوں اور اہل ایمان کی بصیرتوں سے ہٹایا ہے، تو ہمارے اور ان کے درمیان کوئی فرق نہیں رہے گا۔ اور درختوں کا ایک دوسرے سے عشق کرنا جن میں لقاح (زردانہ) ہوتا ہے، یہ اہل نظر کے لیے سب سے زیادہ واضح نشانیاں ہیں اگر وہ انصاف کریں۔\n\n### یہ کہ عاقل جب یہ ارادہ کرتا ہے کہ وہ تم تک وہ بات پہنچائے جو اس کے نفس میں ہے، تو وہ اس پہنچانے میں صرف حروف کو ترتیب دے کر تعبیر کرنے پر اکتفا نہیں کرتا۔\n\nجان لو کہ عاقل، خواہ وہ عالم کی کسی بھی صنف سے ہو، جب وہ یہ ارادہ کرتا ہے کہ وہ تم تک وہ بات پہنچائے جو اس کے نفس میں ہے، تو وہ اس پہنچانے میں صرف حروف کو ترتیب دے کر تعبیر کرنے پر اکتفا نہیں کرتا، اور یہ ضروری ہے۔ کیونکہ اس کا مقصد جب تمہیں اس معاملے کی خبر دینا ہو جو اس معلم کے نفس میں ہے، تو کبھی وہ لسانی لفظی تعبیر کے ذریعے ہوتا ہے جسے عرف میں قول اور کلام کہا جاتا ہے، اور کبھی ہاتھ یا سر یا کسی بھی چیز کے اشارے سے، اور کبھی کتابت اور نقوش کے ذریعے، اور کبھی اس چیز کے ذریعے جو تمہیں سمجھانے کا ارادہ رکھنے والے سے صادر ہوتی ہے، جس سے ذات حق (الحق) تمہیں سمجھانا چاہتا ہے، تو وہ تم میں ایک اثر پیدا کرتا ہے جس سے تم اس کے نفس کی بات کو جان لیتے ہو۔ اور یہ سب بھی کلام کہلاتا ہے، جیسا کہ اللہ تعالیٰ نے فرمایا:\n**أَخْرَجْنَا لَهُمْ دَابَّةً مِنَ الْأَرْضِ تُكَلِّمُهُمْ**\n(ہم ان کے لیے زمین سے ایک جانور نکالیں گے جو ان سے بات کرے گا)۔\nپس اس نے خبر دی کہ وہ ہم سے بات کرے گی۔ اور یہ اس طرح ہو گا کہ جب وہ اجیاد سے نکلے گی، اور وہ ایک بہت زیادہ بالوں والا جانور ہو گا جس کا اگلا حصہ پچھلے حصے سے پہچانا نہیں جائے گا، اسے \"جساسہ\" کہا جاتا ہے۔ پس وہ پھونک مارے گی اور اپنی پھونک سے لوگوں کے چہروں پر مشرق و مغرب، شمال و جنوب، خشکی و تری میں نشان لگا دے گی۔ پس ہر شخص کی پیشانی پر وہ چیز نقش ہو جائے گی جو اللہ کے علم میں اس کے لیے ہے، ایمان یا کفر۔ پس جسے اس نے مومن کا نشان لگایا ہو گا وہ اسے کہے گا جسے کافر کا نشان لگایا ہو گا: \"اے کافر! مجھے فلاں چیز دے دو،\" اور جو کچھ وہ اسے کہنا چاہے گا۔ پس وہ اس نام پر غصہ نہیں کرے گا کیونکہ وہ جانتا ہے کہ یہ اس کی پیشانی پر ایسی کتابت ہے جسے وہ مٹا نہیں سکتا۔ پس کافر مومن سے کہے گا: \"ہاں\" یا \"نہیں\"، اس کے طلب کردہ کو پورا کرنے میں، جیسا کہ واقع ہو گا۔ پس اس کی طرف منسوب کلام، عموم میں، اس کے سوا کچھ نہیں جو اس نے اپنی پھونک سے چہروں پر نشان لگایا۔ اگرچہ وہ کسی بھی زبان کے اہل سے ہو، جو اس کا مشاہدہ کرے یا اس کے پاس بیٹھے، تو وہ اس سے اس کی اپنی زبان میں بات کرے گی، عربی ہو یا عجمی، ان کے مختلف اصطلاحات کے مطابق۔ وہ یہ سب جانتا ہے۔ اور اس کی حدیث صحیح خبر میں وارد ہوئی ہے جسے مسلم نے دجال کی حدیث میں ذکر کیا ہے، جب اس نے تمیم الداری کو اس پر رہنمائی کی اور اس سے کہا کہ وہ تمہاری باتوں کا مشتاق ہے۔ اور وہ اب شمالی سمت کے سمندر کے ایک جزیرے میں ہے، اور یہی وہ جزیرہ ہے جہاں دجال ہے۔\n\n### عالمِ اسفل (زیریں دنیا) میں کوئی صورت ایسی نہیں مگر اس کی مثال عالمِ علوی (بالائی دنیا) میں موجود ہے۔\n\nاور جان لو کہ عالمِ اسفل (زیریں دنیا) میں کوئی صورت ایسی نہیں مگر اس کی مثال عالمِ علوی (بالائی دنیا) میں موجود ہے۔ پس عالمِ علوی کی صورتیں عالمِ سفلی میں اپنے ہم مثلوں کے وجود کو محفوظ رکھتی ہیں، اور ان میں اس علم کا اثر ڈالتی ہیں جسے وہ امور کے بارے میں پاتی ہیں، جن کا وہ اپنے نفس سے انکار نہیں کر سکتیں، اس چیز کے متحقق ہونے کی وجہ سے جسے وہ پاتی ہیں۔ پس یہ علوی فلکی صورتوں کا سفلی عنصری صورتوں میں اثر ہے۔ اور سفلی عنصری صورتیں علوی فلکی صورتوں میں حسن اور قبح کا اثر ڈالتی ہیں، اور عطیہ کے ذریعے حرکت کرتی ہیں اس چیز کے لیے جس کی انہیں ضرورت ہوتی ہے، ان استعدادات کے مطابق جن پر وہ ہیں۔ پس علوی صورتیں اس اثر سے اپنے آپ کو محفوظ نہیں رکھ سکتیں کیونکہ وہ اسی کے لیے پیدا کی گئی ہیں۔ اور دونوں عالموں کے درمیان باریک ریشے (رقائق) پھیلے ہوئے ہیں، ہر صورت سے اس کے ہم مثل تک، جو متصل ہیں اور منقطع نہیں ہوتے۔ انہی ریشوں پر عروج اور نزول ہوتا ہے، پس وہ معراجیں اور مدارج ہیں۔ اور کبھی انہیں مناسبات سے تعبیر کیا جاتا ہے۔ اور ان علوی فلکی صورتوں اور طبیعت کے درمیان بھی باریک ریشے پھیلے ہوئے ہیں، جن پر طبیعت سے ان صورتوں پر وہ چیز نازل ہوتی ہے جس سے ان کے وجود کا قیام ہے۔ پس جب وہ اس سے رنگین ہو جاتی ہیں، تو وہ سفلی عنصری صورتوں پر وہ چیز افاضہ کرتی ہیں جس سے ان کے وجود کا قیام ہوتا ہے، لیکن صرف اس حیثیت سے کہ وہ اجسام اور جسد ہیں، تاکہ ان کی صورتیں محفوظ رہیں۔\n\nاور ان علوی فلکی صورتوں اور نفسِ کلیہ (النفس الکلیۃ) کے درمیان، جسے شارع صلی اللہ علیہ وسلم نے اللہ کی طرف سے لوحِ محفوظ (اللوح المحفوظ) سے تعبیر کیا، کیونکہ اللہ نے اس پر جو کچھ لکھا اسے محفوظ رکھا، پس اس کے بعد اسے نہ مٹایا گیا اور نہ بدلا گیا۔ پس ہر چیز اس میں ہے، اور قرآن میں اسے الٰہی تسمیہ کے طور پر \"ہر چیز\" کہا گیا ہے۔ اور اسی سے اللہ نے اپنی کتابیں اور صحیفے لکھے جو اس نے اپنے رسولوں اور نبیوں پر نازل کیے، جیسا کہ اس کا قول ہے:\n**وَكَتَبْنَا لَهُ فِي الْأَلْوَاحِ مِنْ كُلِّ شَيْءٍ**\n(اور ہم نے اس کے لیے تختیوں میں ہر چیز لکھ دی)۔ اور وہ لوحِ محفوظ (اللوح المحفوظ) ہے۔\n**مَوْعِظَةً وَتَفْصِيلًا لِكُلِّ شَيْءٍ**\n(نصیحت اور ہر چیز کی تفصیل)۔ اور وہ لوحِ محفوظ (اللوح المحفوظ) ہے۔\nپس نازل شدہ کتابوں نے اس کے مجمل کو مفصل کیا اور اس کی نصیحت کو واضح کیا۔ پس ان صورتوں اور اس نفس کے درمیان باریک ریشے پھیلے ہوئے ہیں، ان کی ارواح کے لحاظ سے جو ان کے اجساد کی صورتوں کی تدبیر کرتی ہیں، ان پر اللہ کی مشیت کے مطابق علوم و معارف نازل ہوتے ہیں، خواہ وہ اللہ کی معرفت (المعرفۃ) سے متعلق ہوں یا معلومات، موجودات اور معقولات میں سے کسی بھی چیز کے علم سے متعلق ہوں۔ پس جب ان علوی فلکی صورتوں کی ارواح اللہ کی مشیت کے مطابق وہ علوم حاصل کر لیتی ہیں جو ان کے جسمانی صورتوں کے لیے غذا کی مانند ہیں، تو اسی سے ان کے وجود کا قیام، ان کی نعمت اور ان کی لذت ہے۔ پس جب وہ ان انوار سے رنگین ہو جاتی ہیں اور ان سے متحقق ہو جاتی ہیں، تو وہ سفلی عنصری صورتوں کے نفوس پر ان علوم کا افاضہ کرتی ہیں، ان کی استعداد کے قبول کرنے کے مطابق۔ پس وہ علم میں استعداد کے تفاوت کی وجہ سے ایک دوسرے سے افضل ہوتے ہیں۔ پھر وہ ایک دوسرے کو تعلیم دیتے ہیں۔ اور تعلیم صرف ان حجابات کو اٹھانا ہے جنہیں ان کی استعداد نے اس فیض کو قبول کرنے سے روک رکھا تھا۔ پس اس اٹھانے کو تعلیم سے تعبیر کیا گیا۔ لہٰذا تعلیم صرف ان علوی فلکی صورتوں سے ہونے والے اس فیض سے ہی ہوتی ہے۔ جیسا کہ اس رکاوٹ کو ہٹانا جو پانی کو بہنے سے روکتی ہے۔ پس جب تم اسے ہٹا دیتے ہو تو پانی اس جگہ بہہ نکلتا ہے جہاں رکاوٹ اسے بہنے سے روک رہی تھی۔ پس اس بند کو کھولنے والے نے پانی کو نہیں بہایا۔ اسی طرح ان سفلی صورتوں کا اپنے ہم مثلوں کو تعلیم دینا صرف ان سے جہالت اور شک کے پردے کو ہٹانا ہے، پس وہ روحانی فیض کے لیے منکشف ہو گئیں اور ایسے علوم کو قبول کر لیا جو ان کے پاس نہیں تھے۔ پس انہوں نے یہ گمان کیا کہ معلم وہ ہے جس نے ان کی جہالت کا پردہ ہٹایا، حالانکہ معاملہ ایسا نہیں ہے۔ پس سمجھو۔\n\nاور ان علوی فلکی صورتوں اور سفلی عنصری صورتوں کے درمیان اسماءِ الٰہیہ (أسماء إلهية) اور حقائقِ ربانیہ (حقائق ربانية) کے لیے باریک ریشے پھیلے ہوئے ہیں، اور یہی وہ خاص وجوہ ہیں جو ہر ممکن کے لیے ہیں، جو کلمہ \"کن\" (ہو جا) سے صادر ہوا، الٰہی ارادی توجہ کے ساتھ، جسے اس کا مسبب (یعنی ممکن) اپنے علاوہ کسی اور سے نہیں جانتا، اگرچہ اس کا اپنے نفس سے ایک خاص وجہ ہے جسے وہ جانتا ہے یا نہیں جانتا۔ اور اسی وجہ سے ہر چیز اللہ کی محتاج ہے، نہ کہ اپنے کونی سبب کی، اور یہ الٰہی سبب کونی سبب سے زیادہ قریب ہے۔ کیونکہ کونی سبب اس سے جدا ہے، اور یہ سبب نہ اس سے جدا ہونے کی صفت رکھتا ہے اور نہ مجاور اتصال کی، اگرچہ یہ انسان کے حق میں شہ رگ سے بھی زیادہ قریب ہے۔ پس اس کی قربت اس سے بھی زیادہ قریب ہے۔ پس اللہ تعالیٰ ہر علوی اور سفلی صورت کو وہ خصوصی علوم عطا کرتا ہے جو صرف وہی جانتا ہے جسے وہ خاص طور پر عطا کیے گئے ہوں، جو اللہ چاہتا ہے۔ اور یہی علومِ اذواق (ذوقی علوم) ہیں جو نہ بیان کیے جا سکتے ہیں اور نہ سنائے جا سکتے ہیں، اور انہیں صرف وہی جانتا ہے جس نے انہیں چکھا ہو۔ اور یہ ممکن نہیں کہ چکھنے والا اسے اس تک پہنچا سکے جس نے اسے نہیں چکھا۔ اور ان کے درمیان اس میں ایسا تفاوت ہے جو نہ جانا جا سکتا ہے اور نہ ہی عین اس چیز کو جانا جا سکتا ہے جس کے ذریعے اسے فضیلت دی گئی ہے۔ پس جب علم میں یہ اختصاص تھا، تو وہاں اختصاصی جنتیں بھی ہیں۔\n\n### بے شک عالم اپنی حقیقت کے لحاظ سے اپنی جسمانی اور روحانی صورت میں چار ارکان پر قائم ہے۔\n\nبے شک منازل اور مقامات میں کوئی ایسا مقام نہیں جو تمام عالم اور انسان کو شامل ہو سوائے اس منزل کے۔ پس اس کے لیے عالم میں رحمت کا عموم ہے، کیونکہ عالم اپنی حقیقت کے لحاظ سے اپنی جسمانی اور روحانی صورت میں چار ارکان پر قائم ہے۔ پس وہ اپنی طبیعت کے لحاظ سے مربع ہے اور اپنی روح کے لحاظ سے مربع ہے۔ پس اپنے جسد کے لحاظ سے وہ چار ارکان سے چار طبائع والا ہے، اور اپنی روح کے لحاظ سے ماں، باپ، نفخ (پھونک) اور توجہ سے ہے۔ پس اس پر رحمت چار وجوہ سے آئی، ہر وجہ کے لیے ایک خاص رحمت ہے۔ پس وہ رحمت جو اس کی رطوبت کو باقی رکھتی ہے تاکہ اس کی خشکی اس پر اثر انداز نہ ہو، اس رحمت سے مختلف ہے جو اس کی خشکی کو محفوظ رکھتی ہے تاکہ اس کی رطوبت اسے فنا نہ کر دے۔ اور وہ رحمت جو اس کی ٹھنڈک کو محفوظ رکھتی ہے تاکہ اس کی گرمی اسے فنا نہ کر دے، اس رحمت سے مختلف ہے جو اس کی گرمی کو محفوظ رکھتی ہے تاکہ اس کی ٹھنڈک اسے فنا نہ کر دے۔ پس انہوں نے ایک دوسرے کو روکا، اور اس روک تھام اور توازن کی وجہ سے جسم کی صورت باقی رہی جب تک یہ توازن اور ممانعت باقی ہے۔ اور اسی منزل سے یہ چاروں رحمتیں پھوٹیں ہیں۔ پس جو اپنے نفس سے ان پر مطلع ہوا، اس نے جان لیا کہ اس کے لیے کیا ہے، اور جو اپنے نفس سے ان پر مطلع نہ ہوا، وہ اپنے حال سے جاہل رہا۔\n\nاور اللہ نے جسے چاہا اسے ان کے مشاہدے سے پردہ کر دیا تاکہ وہ بات نہ کریں، جیسا کہ معاذ اور عمر رضی اللہ عنہما کی حدیث میں وارد ہے۔ اور اللہ نے اسے امانت داروں کے لیے منکشف کر دیا، کیونکہ وہ جانتا تھا کہ وہ امانت کو صرف اس کے اہل تک ہی پہنچائیں گے۔ بے شک اللہ نے اس علم کے لیے ایسے اہل پیدا کیے ہیں، اور ان تک علم کا پہنچنا دو طرح سے مقرر کیا ہے: یا تو براہ راست اس کی طرف سے ان تک، یا کسی معلم کی طرف سے جس نے کسی دوسرے کی امانت کو جانا ہو اور وہ خود بھی امین ہو جیسا کہ اس نے اپنی امانت کو جانا، پس اس نے وہ علم اس کی طرف القا کر دیا کیونکہ وہ اس کا اہل تھا، اور وہ اللہ تعالیٰ کی طرف سے امانت ادا کرنے کا مامور تھا۔ پس جب تم اپنے نفس سے ان رحمتوں پر مطلع ہو جاؤ گے، تو وہ تمہارے اور ہر اس چیز کے درمیان رکاوٹ بن جائیں گی جو تمہیں اللہ تعالیٰ سے اور تمہاری سعادت سے دور لے جاتی ہے۔ اور تم ہر حال میں اللہ کے سامنے انقیاد (فرمانبرداری) کی صفت سے متصف ہو جاؤ گے جس کی طرف اس نے تمہیں بلایا ہے۔ جب تم ان کا مشاہدہ کرو گے تو یہ تم میں ان کا اثر ہو گا، پس یہ تمہیں الٰہی ادب عطا کریں گی۔ اور یہ علم تمہارے پاس لانے والا صرف وہی ہو گا جو تمہیں اور تمہاری حیات کے سبب کو جانتا ہو، اور وہ سیار ارواح اور فرشتوں میں سے ہو گا جو پروں والے ہیں، ان کے پروں کے طبقات کے مطابق۔ پس ان میں سب سے اعلیٰ وہ ہے جس کے پر سب سے کم ہوں، اور سب سے کم پر والا وہ ہے جس کے دو پر ہوں۔ کیونکہ وہاں کوئی ایسا نہیں جس کا ایک پر ہو اور اس کا کوئی مددگار نہ ہو، خواہ وہ پر ہو یا کوئی اور چیز۔ اور ہم نے ایک جانور کو ایک ٹانگ پر دیکھا ہے، اور اس کے سینے سے محتسب کے موتی جیسی کوئی چیز نکلی ہوئی تھی جسے وہ پر کی طرح حرکت دیتا تھا، اور وہ اس حرکت سے دوڑتا تھا اور اپنی ایک ٹانگ کو اس طرح حرکت دیتا تھا کہ تیز ترین گھوڑا بھی اسے نہیں پکڑ سکتا تھا، یہ مغرب کے علاقوں میں القل اور جیجل کے درمیان کا واقعہ ہے۔ پس ہمارے پاس وہ بھی ہے جس کا کوئی مددگار نہیں ہے۔ اور فرشتوں میں سے کوئی دو پروں والا ہے، کوئی چھ سو پروں والا، اور اس سے بھی زیادہ۔ پس یہ علم جس کے پاس بھی آتا ہے، وہ صرف ایک کریم، مطیع فرشتے کے ہاتھوں آتا ہے جو اللہ کے حکم کی نافرمانی نہیں کرتا، اس کے دو پر ہوتے ہیں جن کے ذریعے وہ اس بندے کے دل میں نازل ہوتا ہے۔ کیونکہ فرشتوں کے پر نزول کے لیے ہوتے ہیں نہ کہ صعود (اوپر جانے) کے لیے، اور عنصری اجسام کے پر صعود کے لیے ہوتے ہیں نہ کہ نزول کے لیے۔ کیونکہ فرشتے اپنی طبیعت کے مطابق، جس پر ان کے اجسام کی صورت ہے، اپنے افلاک کی طرف حرکت کرتے ہیں جن سے ان کا وجود ہوا ہے۔ پس جب وہ زمین پر اترتے ہیں تو ان پروں کے ساتھ اڑتے ہوئے اترتے ہیں، اور جب وہ اپنے افلاک کی طرف واپس جاتے ہیں تو اپنی طبیعت کے مطابق طبعی حرکت سے واپس جاتے ہیں، اگرچہ وہ اپنے پروں کو حرکت دیں، یہاں تک کہ اگر وہ اپنے پروں کو حرکت نہ بھی دیں تو بھی وہ اپنی ذات کے ساتھ اپنے ٹھکانے اور مقام کی طرف صعود کر جائیں گے۔ اور عنصری پرندے کے اجسام صعود کے لیے اپنے پروں کو حرکت دیتے ہیں، اور اگر وہ اپنے پروں کو حرکت دینا یا پھیلانا چھوڑ دیں تو اپنی طبیعت کے مطابق زمین پر اتر آئیں گے۔ پس وہ نزول میں اپنے پروں کو صرف نزول میں توازن کے لیے پھیلاتا ہے، کیونکہ اگر وہ اپنے نزول کو متوازن نہ کرے اور اپنی طبیعت کے ساتھ رہے تو طبعی حکم کی قوت کی وجہ سے نزول میں تکلیف اٹھائے گا۔ پس نزول میں اس کے پر کی حرکت حفظ کی حرکت ہے۔ پس یہ جان لو۔\n\n### بے شک بہائم (جانور) انسان کے بارے میں اور دارِ آخرت کے معاملے کے بارے میں علم رکھتے ہیں۔\n\nاور جان لو کہ بہائم (جانور) انسان کے بارے میں، دارِ آخرت کے معاملے کے بارے میں، اور ان حقائق کے بارے میں جن پر ہستی (الوجود) قائم ہے، وہ کچھ جانتے ہیں جسے بعض لوگ نہیں جانتے اور نہ ہی اس کا علم رکھتے ہیں۔ جیسا کہ بعض سے حکایت کی گئی ہے کہ انہوں نے ایک شخص کو گدھے پر سوار دیکھا جو چھڑی سے گدھے کے سر پر مار رہا تھا۔ دیکھنے والے نے اسے گدھے کے سر پر مارنے سے منع کیا، تو گدھے نے اس سے کہا: \"اسے چھوڑ دو، یہ اپنے سر پر مار رہا ہے۔\" پس اس نے اسے عین گدھا بنا دیا، اور گدھے کو معلوم تھا کہ اسے اس کے عمل کا بدلہ دیا جا رہا ہے۔ اور اس کا قول \"اسے چھوڑ دو\" اس لیے تھا کہ گدھے کو معلوم تھا کہ اس میں اللہ کے ہاں اس کے لیے کیا خیر ہے، یا اس علم کی وجہ سے بھی کہ اس نے اس تسخیر کا حق پورا نہیں کیا جس کے لیے اسے پیدا کیا گیا تھا، پس اس نے جان لیا کہ وہ مار کا مستحق ہے۔ پس اس نے سننے والے کو اس بات پر متنبہ کیا کہ جب کوئی شخص اپنے مالک کے لیے اس حق کو پورا نہ کرے جو اس پر لازم کیا گیا ہے، تو وہ ادب اور بدلے کے طور پر مار کا مستحق ہوتا ہے جو اس کی طرف سے ہوا ہے۔ اور یہ سب اس گدھے کے اس فعل اور قول کی صورت کو متحقق کرنے والے وجوہ ہیں، اور ان کے علاوہ بھی دیگر وجوہ ہیں جن کا یہ فعل متقاضی ہے۔\nاور رسول اللہ صلی اللہ علیہ وسلم نے اپنی اونٹنی کے بارے میں فرمایا جب آپ مدینہ ہجرت کر کے گئے اور اونٹنی ابو ایوب انصاری کے صحن میں بیٹھ گئی، تو آپ کے اصحاب میں سے جو حاضر تھے انہوں نے چاہا کہ اسے اٹھائیں، جبکہ نبی صلی اللہ علیہ وسلم اس پر سوار تھے، تو آپ نے فرمایا:\n**حدیث:** \"اسے چھوڑ دو، کیونکہ یہ مامور ہے۔\"\nاور فرمایا:\n**حدیث:** \"اسے ہاتھی کو روکنے والے نے روک رکھا ہے۔\"\nیعنی مکہ سے۔ اور ہاتھی کا واقعہ مشہورِ صحت ہے۔\nپس ثقلین (جن و انس) اور بعض انسانوں اور جنوں کے علاوہ ہر چیز، خواہ وہ حیوان ہو، نباتات ہو، جمادات ہو، فرشتہ ہو یا روح ہو، اپنے رب کی طرف سے اپنے معاملے میں واضح دلیل پر ہے۔\nاور یہ منزل ان علوم کو شامل ہے: علم الاعداد، اور علم الحروف، جو کہ اولیاء کا علم ہے، جیسا کہ محمد بن علی ترمذی الحکیم نے کہا ہے۔ اور علم المجمل (اجمالی علم)، اور انسان کے ساتھ خاص رحمتوں کا علم، اور علم التبیان (واضح کرنے کا علم)، اور علم البشائر (خوشخبریوں کا علم)، اور مراتبِ ایمان کا علم، اور مکلفین اور غیر مکلفین سے اعمال کی نشأت کو قائم کرنے کا علم، اور روحانی تلقین کا علم جو ملقّی (تلقین کرنے والے) کی طرف سے ظاہر ہوتا ہے جو کہ ذات حق (الحق) ہے نہ کہ فرشتہ۔ اور دوسروں کے حقوق ادا کرنے کا علم، اور اس چیز کا علم جو اللہ کی طرف سے اس شخص کے لیے ہو گا جو اپنے بھائی کے حق میں چلا، اور ذات حق (الحق) کا خود اس کی تولیت سنبھالنے کا علم، اور اس امان کا علم جس پر حضرتِ الٰہیہ (الحضرة الإلهية) قائم ہے، جسے صرف اللہ کو ذوقاً جاننے والے ہی جانتے ہیں۔ اور احوال کے پلٹنے کا علم، پس ان کے پلٹنے کی وجہ سے الٰہی عطیات پلٹ جاتے ہیں۔ اور آیات اور دلالات کا علم، اور وہ کس چیز پر دلالت کرتی ہیں، اور مدلول کی احدیت کے ساتھ ان کا اختلاف۔ اور اس چیز کا علم جو دل کو کسی چیز کے علم سے روکتی ہے باوجود اس کے کہ اس میں بیان موجود ہو۔ اور علم عطا کرنے میں الٰہی عنایت کا علم، اور وہ علم جو وراثت کے طریقے سے حاصل ہوتا ہے۔ اور حیوانات کے مراتب کا علم، اور وہ کن چیزوں میں ایک دوسرے سے افضل ہیں اور کن چیزوں میں برابر ہیں۔ اور کیا انسان حیوان کے ساتھ ملحق ہے یا وہ ایک خاص نوع ہے، اور وہ حیوان سے کس چیز میں خاص ہے۔ اور ہم جان چکے ہیں کہ ہر حیوان ناطق (بولنے والا) ہے۔ اور بادشاہوں کے آداب کا علم، اور بادشاہ کو اپنی بادشاہت میں کیسا ہونا چاہیے۔ اور اس فن میں ہماری ایک کتاب ہے جسے ہم نے \"التدبیرات الإلهية في إصلاح المملكة الإنسانية\" (انسانی مملکت کی اصلاح میں الٰہی تدبیریں) کا نام دیا ہے۔ اور ضرر کو دفع کرنے اور بچاؤ کی نصیحتوں کا علم۔ اور توحید کا علم جو بہائم (جانوروں) کے ساتھ خاص ہے۔ اور ہر ناطق پر جھوٹ بولنے کے جواز کا علم، باوجود اس علم کے کہ وہ سچا ہے، سوائے ثقلین (جن و انس) کے، کیونکہ وہ بہت سی باتوں میں جھوٹ بول سکتے ہیں جن کی وہ خبر دیتے ہیں۔ اور بادشاہوں کے جاسوس رکھنے کا علم، اور جاسوس کو اپنی جاسوسی کی حالت میں کن صفات کو ظاہر کرنا چاہیے، اور اس میں سے کیا قابل تعریف ہے اگرچہ وہ جھوٹ ہو۔ اور اعلیٰ کا ادنیٰ سے مشورہ کرنے کا علم، باوجود اس کے کہ وہ جانتا ہے کہ وہ بغیر مشورے کے بھی اس علم تک پہنچ جائے گا جسے وہ جاننا چاہتا ہے۔ اور یہ کہ ذات حق (الحق) تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو اس معاملے میں اپنے اصحاب سے مشورہ کرنے کا حکم دیا جو آپ کے سامنے پیش آتا تھا جب اس کے بارے میں کوئی وحی نازل نہیں ہوتی تھی۔\nاور نبی صلی اللہ علیہ وسلم کے اس قول کا علم:\n**حدیث:** \"آپس میں تحفے دو، محبت بڑھے گی۔\"\nاور عطیہ کا نفوس میں ایمان کو مجروح کرنے والا کیا اثر ہے، کیا وہ قابل تعریف ہے یا قابل مذمت؟ کیونکہ احسان اپنی ذات میں محبوب ہے، تو کیا محسن بھی ایسا ہی ہے یا وہ احسان سے جدا ہے؟ کیونکہ یہ ایک خطرناک اور عظیم مسئلہ ہے کہ تم اس شخص کا احسان قبول کرو جس سے اللہ نے تمہیں دشمنی کا حکم دیا ہے، اور تم اس کے لیے کوئی محبت دل میں پیدا کیے بغیر اس کا احسان قبول کرو، اللہ کی جناب کو ترجیح دیتے ہوئے اور اس کے حکم کی تعمیل کرتے ہوئے۔ اور یہ طبعی حالت سے خروج ہے، اور یہ مشکل ہے، جس کا وقوع بظاہر تصور نہ کیا جا سکے، اگرچہ ظاہر میں اس کا کوئی حکم ظاہر نہ ہو، لیکن باطن اس کو دفع نہیں کر سکتا۔\nاور ایک ہی شخص کے حق میں احسان کرنے والے دو محسنوں کے درمیان موازنہ کا علم، کیا نفس کو اس چیز کے لحاظ سے ترجیح حاصل ہوتی ہے جس کے ذریعے انہوں نے احسان کیا، نہ کہ احسان کی حیثیت سے؟ اگر اس میں تفاوت واقع ہو تو مومن، عالم، اور اللہ کے عام مسخر احسان کا مشاہدہ کرنے والے کے لیے یہ معاملہ آسان ہو جاتا ہے۔\nاور خواص کا علم، اور اس کے ذریعے اللہ تعالیٰ کے قرب کے مقام میں ظاہر ہونے کا علم۔ اور نعمت دینے والے کا شکر ادا کرنے کا علم۔ اور اس چیز کا علم جس کی ربوبیت مستحق ہے اور جس میں کوئی اشتراک واقع نہیں ہوتا۔ اور ابتلاء (آزمائش) کے لیے التباس (گڈمڈ) کا علم۔ اور منگیتر کو دیکھنے کا علم، اور شرعاً ناظر کو اس میں سے کیا دیکھنا جائز ہے، کیونکہ اس کا حکم دیا گیا ہے۔ اور علم سیکھنے کی صورت کا علم۔ اور معلم کے سامنے جہالت کا اعتراف کرنے کا علم۔ اور حیلوں، مکر اور کید کا علم، اور ان میں سے کیا مذموم ہے اور کیا محمود ہے۔ اور مطلق اور مقید ثناء کا علم، اور کیا کوئی مطلق ثناء ہے یا لفظ کے مطلق ہونے کے باوجود یہ حال کے لحاظ سے صحیح نہیں؟ اور ہر ثناء کرنے والے اور جس کی ثناء کی گئی ہے، اس سے ثناء کے مقید ہونے کا علم۔ اور اس میں ذات حق (الحق) کے عالم کی طرف سے اختیار دینے کا علم ہے۔ اور اس میں زمین کے مقام کا علم اور اس چیز کا علم جس سے اسے مزین کیا گیا ہے۔ اور اس میں کافر اور مشرک کی دعا قبول ہونے کے سبب کا علم، اور مشرک کب اپنے رب کو واحد مانتا ہے۔ اور اس میں ظلمت میں نور کے داخل ہونے کا علم ہے۔ اور اس میں خلق اور رزق کا علم ہے۔ اور اس میں قیامت کا علم ہے۔ اور اس میں ممکن کے انکار کا علم ہے۔ اور اس میں حضرۃ الغیب (غیب کی موجودگی) میں کشف الغیب (غیب کا انکشاف) کا علم ہے۔ اور اس میں منادی کا علم جو پکارتا ہے اور اسے جواب نہیں دیا جاتا۔ اور اس میں یہ علم ہے کہ کیا حشر ہر مردہ کو شامل ہو گا یا صرف بعض مردے ہی حشر کیے جائیں گے؟ اور اس میں ناقور (صور) کا علم ہے اور وہ کیا ہے۔ اور اس میں یہ علم ہے کہ کون سا بدلہ اس کے عمل سے افضل ہے یا ہر بدلہ اس کے عمل سے افضل ہے، اور یہ ایک شریف علم ہے۔ اور اس میں رب کی عبادت کا علم ہے اس حیثیت سے کہ وہ کسی کون (وجود) کے ساتھ مضاف ہے۔ اور اس میں اس علم کا علم ہے جو رؤیت (دیکھنے) سے حاصل ہوتا ہے جو پہلے سے معلوم تھا۔ اور اللہ **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و پنجاه و هفتم: در معرفت جایگاه چهارپایان (البهائم) در حضرت الهی و مقهور بودن آن‌ها تحت دو سرّ موسوی.\n\nهیهات! پرده‌ها و پوشش‌ها فرو نمی‌افتند (الكلل) *** مگر برای امری عظیم که سراسر بزرگ است.\nاگر آنچه پوشیده شده است بر چشمان ما آشکار می‌شد *** نه رنجی در ما پدیدار می‌گشت و نه ملالی.\nو ناگزیر در آن (پوشش) نه مرضی عارض می‌شد *** و نه دارویی، نه طبی و نه علتی.\nو نه جامه‌ای نو که نفس بپوشد *** و نه واسطه‌ای از آن، نه و نه مستی.\nهمانا پرده‌ها صورت خود را در چشم می‌بینند *** و در آن (دیدن) ملالی درک نمی‌شود.\nو چشمان هستی (الکون) از پشت پرده نظاره‌گرند *** و حجاب‌ها چیزی را می‌بینند که دیدگان (مقل) نمی‌بینند.\n\n[آراسته شدن به اسماء الهی و تحقق یافتن به ارواح پاک ملکوتی، سبب معرفت امور است]\n\nای سالک، خداوند تو را یاری کند، بدان که معرفت امور آن‌گونه که در نفس خود هستند، برای تو حاصل نمی‌شود مگر زمانی که خداوند تو را بر نفس خودت واقف سازد و آن را از ذاتت به شهودت برساند. در این صورت، آنچه را طلب کرده‌ای، ذوقاً (ذوقاً) به دست می‌آوری، آنگاه که از طریق کشف (الکشف) بر آن واقف شوی. و راهی برای حصول این امر نیست مگر به عنایت ازلی که به واسطه ریاضت‌های نفسانی، مجاهدات بدنی، آراسته شدن به اسماء الهی (التخلق بأسماء إلهية)، تحقق یافتن به ارواح پاک ملکوتی (التحقق بأرواح طاهرة ملكية)، و تطهیر با طهارت شرعی مشروع (نه معقول)، و عدم تعلق به اکوان (هستی‌ها)، و خالی کردن محل (قلب) از جمیع اغیار، استعدادی تام برای پذیرش آن به تو ببخشد. زیرا حق (الحق) از تو برای خود جز قلبت را برنگزید، آنگاه که آن را با ایمان نورانی ساخت. پس جلال حق (الحق) وسعت یافت و صاحب این صفت، ممکنات را با چشم حق (الحق) مشاهده کرد، پس آن ممکنات برای او مشهود بودند، اگرچه موجود نبودند، و از او فوت نشده‌اند. نور ایمان بر بصیرت او، بلکه بر بصر و بصیرت او، پرده برداشت، آنگاه که بر اعیان ممکنات گسترده شد، و آشکار ساخت که آن‌ها در حال عدمشان، دیده‌شونده (مرئی)، بیننده (رائی)، شنیده‌شونده (مسموع) و شنونده (سامع) هستند، با رؤیت ثبوتی و سمع ثبوتی، نه وجودی. پس عین حق (الحق) هر یک از آن اعیان را که خواست، برگزید و قول خود را که با زبان عربی به «کن» ترجمه شده است، بر او متوجه ساخت نه بر امثال دیگرش. پس امر خود را به او شنواند و مأمور شتاب کرد و از کلمه او پدید آمد، بلکه عین کلمه او بود. و ممکنات در حال عدم ازلی خود، پیوسته واجب الوجود لذاته را می‌شناختند و او را با تسبیح ازلی و تمجید قدیم ذاتی تسبیح و تمجید می‌کردند، در حالی که نه عین موجودی داشتند و نه حکم مفقودی.\n\nاگر حال همه ممکنات بر این صفاتی باشد که ذکر کردیم و جهلی در آن راه ندارد، پس چگونه در حال وجود و ظهورشان برای خود، جمادی باشند که سخن نمی‌گوید، یا نباتی باشند که به تعظیم خالق خود تحقق نمی‌یابد، یا حیوانی باشند که به حال خود تصدیق نمی‌کند، یا انسانی باشند که به پروردگارش تعلق نمی‌یابد؟ این محال است. پس ناگزیر هر آنچه در هستی (الوجود) از ممکن موجود است، خداوند را با حمدش تسبیح می‌گوید، با زبانی که فهمیده نمی‌شود و آهنگی که هر کسی به آن توجه نمی‌کند. پس اهل کشف (الکشف) آن را به شهود (الشهود) می‌شنوند و مؤمن آن را به ایمان و عبادت می‌پذیرد. خداوند متعال می‌فرماید: **﴿وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كَانَ حَلِيمًا غَفُورًا﴾** (و هیچ چیز نیست مگر آنکه با ستایش او تسبیح می‌گوید، ولی شما تسبیح آن‌ها را درنمی‌یابید. همانا او بردبار و آمرزنده است). پس با اسم حجاب و ستر (پوشش) آمد، که همان قول اوست: **غَفُورًا** (آمرزنده)، و با اسمی آمد که اقتضای تأخیر مؤاخذه به آینده و عدم حکم آن در حال حاضر را دارد، که همان **الحلیم** (بردبار) است؛ زیرا می‌دانست که در میان بندگانش کسانی هستند که از کشف (الکشف) و ایمان محروم شده‌اند، و آن‌ها همان عاقلانی هستند که بنده افکارند و با اعتبار (عقل) متوقف شده‌اند. پس آن‌ها از ظاهر به باطن گذر کردند و ظاهر را ترک گفتند و از آن تعبیر کردند، زیرا اهل کشف (الکشف) و ایمان نبودند، چرا که خداوند چشمانشان را از مشاهده آنچه موجودات در نفس خود بر آن هستند، پوشانده است و ایمانی در قلبشان روزی نشده است که نوری داشته باشد **﴿يَسْعَى بَيْنَ أَيْدِيهِمْ﴾** (که پیشاپیش آن‌ها می‌شتابد). اما مؤمنان صادق و اولوالعزم از اولیاء، با ظاهر گذر کردند، نه از ظاهر به باطن، و از عین حرف به معنا، نه اینکه از آن تعبیر کنند. پس امور را با هر دو چشم دیدند و با نور ایمانشان هر دو راه (خیر و شر) را به شهود (الشهود) دریافتند. پس برایشان ممکن نبود که آنچه را شهود (الشهود) کردند، انکار کنند و آنچه را یقین یافتند، جحد نمایند. پس خداوند نطق موجودات را به آن‌ها شنواند، بلکه نطق ممکنات را پیش از وجودشان، زیرا آن‌ها زنده، ناطق و درّاک هستند، با حیات ثبوتی، نطق ثبوتی و ادراک ثبوتی، چرا که در نفس خود اشیاء ثبوتی بودند. پس هنگامی که شیئیت وجود را پذیرفتند، آن را با جمیع نُعوت و صفاتش پذیرفتند، و نعت آن‌ها چیزی جز عین آن‌ها نیست. پس آن‌ها در حال شیئیت وجودشان، با حیات وجودی زنده، با نطق وجودی ناطق و با ادراک وجودی درّاک هستند. مگر اینکه خداوند سبحان دیدگان برخی از بندگانش را از درک این حیات جاری و نطق و ادراک جاری در جمیع موجودات گرفته است، همان‌گونه که بصیرت اهل عقول و افکار را از درک آنچه در جمیع موجودات و جمیع ممکنات ذکر کردیم، گرفته است. و اهل کشف (الکشف) و ایمان بر علم آنچه امر بر آن است، در این اعیان در حال عدم و وجودشان، آگاهند. پس کسی که حیاتش ظاهر شد، زنده نامیده شد، و کسی که حیاتش پنهان ماند و برای هر چشمی ظاهر نشد، نبات و جماد نامیده شد. پس امر نزد محجوبان تقسیم شد، اما نزد اهل کشف (الکشف) و ایمان تقسیم نشد. اما صاحب کشف (الکشف) و شهود (الشهود) که اهل اختصاص هستند، خداوند شهود (الشهود) را به آن‌ها عطا کرد و شهود (الشهود) را به محجوبان عطا نکرد. پس اهل شهود (الشهود) می‌گویند: شنیدیم و دیدیم، و محجوبان می‌گویند: نشنیدیم و ندیدیم. و اهل ایمان می‌گویند: ایمان آوردیم و تصدیق کردیم. خداوند متعال فرمود: **﴿وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ﴾** و «شیء» نکره است. و فرمود: **﴿أَلَمْ تَرَ أَنَّ اللَّهَ يَسْجُدُ لَهُ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ وَالشَّمْسُ وَالْقَمَرُ وَالنُّجُومُ وَالْجِبَالُ وَالشَّجَرُ وَالدَّوَابُّ﴾** (آیا ندیدی که هر که در آسمان‌ها و هر که در زمین است و خورشید و ماه و ستارگان و کوه‌ها و درختان و جنبندگان برای خدا سجده می‌کنند؟) پس جماد و نبات و حیوان را ذکر کرد که اختلاف در مورد آن‌ها بین محجوبان از اهل عقول و افکار و بین اهل شهود (الشهود) و ایمان واقع شده است. و خداوند متعال فرمود: **﴿وَلِلَّهِ يَسْجُدُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مِنْ دَابَّةٍ﴾** (و برای خدا سجده می‌کند هر جنبنده‌ای که در آسمان‌ها و زمین است). و فرمود: **﴿وَيُسَبِّحُ الرَّعْدُ بِحَمْدِهِ﴾** (و رعد با ستایش او تسبیح می‌گوید). و فرمود: **﴿وَلِلَّهِ يَسْجُدُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا وَظِلَالُهُمْ بِالْغُدُوِّ وَالْآصَالِ﴾** (و برای خدا سجده می‌کند هر که در آسمان‌ها و زمین است، خواه از روی میل و خواه از روی اکراه، و سایه‌هایشان نیز در بامدادان و شامگاهان). و فرمود: **﴿قَالَتْ نَمْلَةٌ يَا أَيُّهَا النَّمْلُ ادْخُلُوا مَسَاكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ وَهُمْ لَا يَشْعُرُونَ * فَتَبَسَّمَ ضَاحِكًا مِنْ قَوْلِهَا﴾** (مورچه‌ای گفت: ای مورچگان، به لانه‌های خود درآیید تا سلیمان و لشکریانش شما را درهم نشکنند، در حالی که نمی‌دانند. پس سلیمان از سخن او خندان تبسم کرد). و فرمود: **﴿عُلِّمْنَا مَنْطِقَ الطَّيْرِ﴾** (به ما زبان پرندگان آموخته شده است). و درباره هدهد فرمود که به سلیمان گفت: **﴿أَحَطْتُ بِمَا لَمْ تُحِطْ بِهِ وَجِئْتُكَ مِنْ سَبَإٍ بِنَبَإٍ يَقِينٍ * إِنِّي وَجَدْتُ امْرَأَةً تَمْلِكُهُمْ وَأُوتِيَتْ مِنْ كُلِّ شَيْءٍ وَلَهَا عَرْشٌ عَظِيمٌ * وَجَدْتُهَا وَقَوْمَهَا يَسْجُدُونَ لِلشَّمْسِ مِنْ دُونِ اللَّهِ﴾** (من به چیزی احاطه یافتم که تو احاطه نیافتی و از سبأ خبری یقینی برایت آورده‌ام. من زنی را یافتم که بر آن‌ها حکومت می‌کند و از هر چیزی به او داده شده است و او تختی بزرگ دارد. او و قومش را یافتم که به جای خدا برای خورشید سجده می‌کنند). پس بنگر به علمی که خداوند به این هدهد درباره خدا عطا کرده است، در آنچه ذکر کرد. و خداوند متعال فرمود: **﴿أَخْرَجْنَا لَهُمْ دَابَّةً مِنَ الْأَرْضِ تُكَلِّمُهُمْ﴾** (جنبنده‌ای را از زمین برایشان بیرون می‌آوریم که با آن‌ها سخن می‌گوید). سپس خبر داد که گروهی از بندگان به این امر یقین نمی‌آورند و آن را با تأویل از ظاهرش خارج می‌سازند، پس فرمود: **﴿أَنَّ النَّاسَ كَانُوا بِآيَاتِنَا لَا يُوقِنُونَ﴾** (که مردم به آیات ما یقین نمی‌آورند)، یعنی ایمان به آیاتی که این آیه از جمله آن‌هاست، در قلبشان مستقر نمی‌شود، بلکه گروهی از آن‌ها آن را به ایمان می‌پذیرند و گروهی دیگر آن را بر غیر وجهی که برای آن قصد شده، تأویل می‌کنند. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: **«يشهد للمؤذن مدى صوته من رطب ويابس»** (هر تر و خشکی که صدای مؤذن به آن می‌رسد، برای او شهادت می‌دهد). و درباره کوه احد فرمود: **«هذا جبل يحبنا ونحبه»** (این کوهی است که ما را دوست دارد و ما او را دوست داریم). و فرمود: **«إني لأعرف حجرا بمكة كان يسلم علي قبل إن أبعث»** (من سنگی را در مکه می‌شناسم که پیش از مبعوث شدنم بر من سلام می‌کرد). به صحت پیوسته است که سنگریزه‌ها در کف دست او تسبیح گفتند، و به صحت پیوسته است ناله ستون درخت (جذع) که پیش از ساختن منبر به آن تکیه می‌داد، پس چون منبر برایش ساخته شد، آن را ترک کرد و آن ستون ناله کرد. پس پیامبر از منبر پایین آمد و نزد آن رفت و با دست خود آن را لمس کرد تا آرام گرفت. و به صحت پیوسته است که کتف گوسفند مسموم با او سخن گفت. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: **«لا تقوم الساعة حتى تكلم الرجل عذبة سوطه وتخبره فخذه بما فعل أهله بعده»** (قیامت برپا نمی‌شود تا آنکه نوک تازیانه مرد با او سخن بگوید و ران او به او خبر دهد که خانواده‌اش پس از او چه کرده‌اند). و در مورد کشتن یهود در آخرالزمان از او ثابت شده است که هرگاه یهود پشت درختی پنهان شوند، درخت می‌گوید: ای مسلمان، این یهودی پشت من است، او را بکش، مگر درخت غرقد، که آن ملعون است و کسی را که پشت آن پنهان شود، خبر نمی‌دهد. و در اینجا سرّ الهی عجیبی است که می‌آموزد برخی از درختان حق کسی را که به آن‌ها پناه برده، رعایت می‌کنند، به اعتماد آن درخت بر رحمت خدا و وفای به حق همسایگی، که این از صفات ستوده در هر گروه و در هر ملت است. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به دختر عمویش ام هانی فرمود: **«قد أجرنا من أجرت يا أم هانئ»** (ای ام هانی، ما به کسی که تو پناه دادی، پناه دادیم)، در حالی که او مشرک بود. و یهود به هر حال اهل کتاب هستند، پس سزاوارترند که حق همسایگی برایشان وفا شود. و این از جانب خدا در حق این درختی بود که یهود به آن پناه بردند و آن درخت آن‌ها را پوشاند تا قول او برای ما محقق شود: **﴿يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشَاءُ﴾** (رحمت خود را به هر که بخواهد اختصاص می‌دهد). پس با لفظ «مَن» آمد که نکره است، و هر چیزی را در بر می‌گیرد، زیرا هر چیزی زنده و ناطق است، پس تحت قول «مَن» داخل می‌شود، چرا که برخی از نحویان معتقدند که لفظ «مَن» فقط بر عاقل واقع می‌شود. در حالی که هر چیزی با حمد خدا تسبیح می‌گوید و تسبیح نمی‌گوید مگر کسی که تسبیح‌کننده خود را تعقل کند و او را به آنچه سزاوار است، ثنا گوید. پس «مَن» بر هر چیزی واقع می‌شود، زیرا هر چیزی آنچه را که با آن خدا را تسبیح می‌گوید، از او تعقل می‌کند. پس خداوند به ما ایمان روزی کند، اگر از اهل عیان و کشف (الکشف) و شهود (الشهود) این امور نباشیم، اموری که خداوند اهل عقول را که افکارشان آن‌ها را به بندگی کشانده، و غیر مؤمنانی را که خداوند بر قلب‌هایشان مهر زده، از درک آن‌ها کور کرده است. پس کسی که بداند هر چیزی ناطق و ناظر به پروردگارش است، حیا از هر چیزی بر او لازم می‌شود، حتی از نفس و جوارحش. زیرا خداوند می‌فرماید: **﴿يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُمْ بِمَا كَانُوا يَعْمَلُونَ﴾** (روزی که زبان‌ها و دست‌ها و پاهایشان بر ضد آن‌ها به آنچه انجام می‌دادند، شهادت می‌دهند). و خداوند متعال فرمود: **﴿الْيَوْمَ نَخْتِمُ عَلَى أَفْوَاهِهِمْ وَتُكَلِّمُنَا أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُمْ بِمَا كَانُوا يَكْسِبُونَ﴾** (امروز بر دهان‌هایشان مهر می‌نهیم و دست‌هایشان با ما سخن می‌گویند و پاهایشان به آنچه کسب می‌کردند، شهادت می‌دهند). و خداوند متعال خبر داد که برخی از مردمی که بر ضدشان شهادت داده می‌شود، به پوست‌های خود می‌گویند: **﴿لِمَ شَهِدْتُمْ عَلَيْنَا قَالُوا أَنْطَقَنَا اللَّهُ﴾** (چرا بر ضد ما شهادت دادید؟ گفتند: خدایی که هر چیزی را به سخن درآورده، ما را به سخن درآورده است)، یعنی با شهادت بر ضد شما. پس ای ولیّ، مبادا پوست‌ها به این امر داناتر از تو باشند، با ادعای تو که از اهل عقل و استبصار هستی. این پوست‌ها نطق هر چیزی را دانسته‌اند و اینکه خداوند آن را به آنچه خواسته، به نطق درآورده است. سپس فرمود: **﴿وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ﴾** (و شما خود را پنهان نمی‌کردید از اینکه گوش‌ها و چشم‌ها و پوست‌هایتان بر ضد شما شهادت دهند)، یعنی پنهان شدن از این امر ممکن نیست، زیرا شما منکراتی را که مرتکب می‌شوید، جز با جوارح انجام نمی‌دهید، چرا که آن‌ها عین ابزاری هستند که شما آن‌ها را در طاعت خدا یا معصیت او به کار می‌برید. پس پنهان شدن از چیزی که عمل شما جز با آن ممکن نیست، برایتان میسر نمی‌شود. **﴿وَلَكِنْ ظَنَنْتُمْ أَنَّ اللَّهَ لَا يَعْلَمُ كَثِيرًا مِمَّا تَعْمَلُونَ﴾** (بلکه گمان می‌کردید که خداوند بسیاری از آنچه را انجام می‌دهید، نمی‌داند). این خطاب به کسانی است که معتقدند خداوند جزئیات را نمی‌داند. سپس فرمود: **﴿وَذَلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْدَاكُمْ﴾** (و این گمان شما بود که درباره پروردگارتان بردید و شما را هلاک کرد)، یعنی شما را به هلاکت رساند. **﴿فَأَصْبَحْتُمْ مِنَ الْخَاسِرِينَ﴾** (پس از زیانکاران شدید). و خسران (زیان) ضد ربح (سود) است و آن نقص از اصل سرمایه است. چون این امر تجارت بود، به ربح و خسران متصف شد. خداوند متعال می‌فرماید: **﴿فَمَا رَبِحَتْ تِجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ﴾** (پس تجارتشان سودی نکرد و هدایت‌یافته نبودند)، به دنبال قول او: **﴿أُولَئِكَ الَّذِينَ اشْتَرَوُا الضَّلَالَةَ بِالْهُدَى﴾** (آنان کسانی هستند که گمراهی را به بهای هدایت خریدند). پس چون هدایت را به گمراهی فروختند، زیان کردند. و فرمود: **﴿هَلْ أَدُلُّكُمْ عَلَى تِجَارَةٍ تُنْجِيكُمْ مِنْ عَذَابٍ أَلِيمٍ﴾** (آیا شما را بر تجارتی راهنمایی کنم که شما را از عذابی دردناک نجات دهد؟). سپس ذکر کرد که آن تجارت چیست و فرمود: **﴿تُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ اللَّهِ﴾** (به خدا و رسولش ایمان می‌آورید و در راه خدا جهاد می‌کنید). و در این امور به جای امور دیگر، به تجارت روی آورد، زیرا قرآن بر قریشی و به زبان قریش در حجاز نازل شد و آن‌ها برخلاف دیگر اعراب، تاجر بودند. پس چون تجارت بر آن‌ها غالب بود، خداوند ذات شریعت و ایمان را به لفظ تجارت پوشاند تا به فهم آن‌ها نزدیک‌تر و مناسب احوالشان باشد. و پس از آنکه امور را آن‌گونه که هستند، برای تو بیان کردم، اگر اهل نظر یا ایمان باشی، بدان که من جز از ممکن به تو خبر ندادم و از محال خبر ندادم. پس بعد از این بیان شافی و ایضاح کافی، به ویژه برای اهل طریق خدا و خاصان بندگانش از مکاشف و مؤمن، می‌گوییم که چهارپایان (البهائم) به این اسم که از «ابهام» و «مبهم» مشتق شده، اختصاص نیافتند مگر به این دلیل که امر بر ما مبهم شده است. زیرا ما برای تو بیان کردیم که آن‌ها بر چه معرفتی نسبت به خدا و موجودات هستند. و آن‌ها به این نام خوانده شدند، چون امرشان بر ما مبهم شد. و ابهام امر آن‌ها تنها از جهت جهل ما به آن یا حیرت ما در آن است، پس صورت امر را آن‌گونه که اهل کشف (الکشف) می‌دانند، نمی‌دانیم. پس آن‌ها نزد غیر اهل کشف (الکشف) و ایمان، چهارپایان (بهائم) هستند، به دلیل ابهامی که در امرشان بر آن‌ها وجود دارد، زیرا برخی از حیوانات اعمالی از خود بروز می‌دهند که جز از فکر و تدبیر صحیح و نظر دقیق صادر نمی‌شود، در حالی که این اعمال از آن‌ها به فطرت صادر می‌شود، نه از فکر و تدبیر. پس خداوند امر آن‌ها را بر برخی از مردم مبهم ساخت و آن‌ها نمی‌توانند آنچه را که به مشاهده می‌بینند، از صناعات محکم که از آن‌ها صادر می‌شود، انکار کنند، مانند عنکبوت‌ها در ترتیب تله‌ها برای صید مگس که خداوند روزی آن‌ها را در آن قرار داده است، و آنچه برخی از حیوانات از قوت خود را با میزانی معلوم و قدری مخصوص ذخیره می‌کنند، و علم آن‌ها به زمان‌ها و احتیاطشان بر نفس خود در قوتشان، که نصف آنچه را ذخیره می‌کنند، می‌خورند از ترس قحطی که مبادا چیزی برای قوت خود نیابند، مانند مورچه. پس اگر این از روی نظر باشد، آن‌ها شبیه اهل نظر هستند، پس کجاست عدم عقلی که به آن‌ها نسبت داده می‌شود؟ و اگر این علم ضروری باشد، پس آن‌ها در آنچه ما جز به ضرورت درک نمی‌کنیم، شبیه ما هستند. پس اگر خداوند پرده کوری را از چشمان ما بردارد، همان‌گونه که از دیدگان اهل شهود (الشهود) و بصیرت اهل ایمان برداشته است، فرقی بین ما و آن‌ها نیست. و در عشق ورزیدن درختان به یکدیگر که دارای لقاح هستند، این آشکارترین آیات برای اهل نظر است، اگر انصاف داشته باشند.\n\n[همانا عاقل هر که باشد، اگر بخواهد آنچه در نفس خود دارد به تو برساند، در آن رساندن به عبارت با نظم حروف اکتفا نمی‌کند]\n\nو بدان که عاقل، هر که باشد و از هر صنفی از عالم که بخواهی، اگر بخواهد آنچه در نفس خود دارد به تو برساند، در آن رساندن به عبارت با نظم حروف اکتفا نمی‌کند. زیرا اگر غرض از آن، آگاه ساختن تو به امری باشد که در نفس آن معلم است، گاهی با عبارت لفظی که در زبان تلفظ می‌شود و در عرف، قول و کلام نامیده می‌شود، و گاهی با اشاره با دست یا سر یا هر چیز دیگر، و گاهی با کتابت و ارقام، و گاهی با آنچه از آن اراده‌کننده فهماندن تو پدید می‌آید، که حق (الحق) می‌خواهد به تو بفهماند، پس اثری در تو ایجاد می‌شود که از آن، آنچه در نفس اوست، می‌شناسی. و همه این‌ها نیز کلام نامیده می‌شود، چنانکه خداوند متعال فرمود: **﴿أَخْرَجْنَا لَهُمْ دَابَّةً مِنَ الْأَرْضِ تُكَلِّمُهُمْ﴾** (جنبنده‌ای را از زمین برایشان بیرون می‌آوریم که با آن‌ها سخن می‌گوید). پس خبر داد که با ما سخن می‌گوید. و این بدان سبب است که وقتی آن جنبنده از «اجیاد» خارج می‌شود، که جنبنده‌ای پشمالو و پرمو است و سرش از دمش شناخته نمی‌شود و به آن «جساسه» می‌گویند، می‌دمد و با دمیدن خود صورت‌های مردم را در شرق و غرب، جنوب و شمال، خشکی و دریا داغ می‌زند. پس در پیشانی هر شخص آنچه در علم خدا بر آن است، از ایمان و کفر، نقش می‌بندد. پس کسی که داغ مؤمن خورده است، به کسی که داغ کافر خورده است، می‌گوید: ای کافر، فلان چیز را به من بده، و هر چه می‌خواهد به او بگوید. و او از این نام خشمگین نمی‌شود، زیرا می‌داند که آن در پیشانی‌اش نوشته شده و پاک کردن آن ممکن نیست. پس کافر به مؤمن می‌گوید: بله یا خیر، در قضای آنچه از او طلب شده، بر حسب آنچه واقع می‌شود. و کلامی که به آن جنبنده نسبت داده شده، در عموم چیزی جز همان داغی نیست که با دمیدن خود بر صورت‌ها زده است، اگرچه با کسی که او را مشاهده می‌کند یا با او همنشین می‌شود، از هر اهل زبانی که باشد، سخن می‌گوید. او با زبان او سخن می‌گوید، از عرب یا عجم، با اختلاف اصطلاحاتشان، و همه این‌ها را می‌داند. و حدیث آن در خبر صحیحی که مسلم در حدیث دجال ذکر کرده، وارد شده است، آنگاه که تمیم داری را بر او راهنمایی کرد و به او گفت که او مشتاق سخن گفتن با تو است. و او اکنون در جزیره‌ای در دریای سمت شمال است، همان جزیره‌ای که دجال در آن است.\n\n[هیچ صورتی در عالم اسفل نیست مگر آنکه مثلی از آن در عالم علوی وجود دارد]\n\nو بدان که هیچ صورتی در عالم اسفل (پایین) نیست مگر آنکه مثلی از آن در عالم علوی (بالا) وجود دارد. پس صور عالم علوی، وجود امثال خود را در عالم سفلی حفظ می‌کنند و در آن‌ها تأثیر می‌گذارند، از طریق علمی که به امور می‌یابند و نمی‌توانند آن را از نفس خود انکار کنند، به دلیل تحققی که به آنچه می‌یابند، دارند. این اثر صور علوی فلکی در صور سفلی عنصری است. و صور عنصری سفلی نیز در صور علوی فلکی تأثیر می‌گذارند، از جهت حسن و قبح و حرکت با بخشش (وهب) برای آنچه بدان نیاز دارند، بر حسب استعدادهایی که بر آن هستند. و صور علوی نمی‌توانند خود را از این تأثیر حفظ کنند، زیرا برای این خلق شده‌اند. و بین دو عالم، رِقاق (رشته‌های لطیف) کشیده شده است که از هر صورتی به مثل آن متصل است و قطع نمی‌شود. عروج و نزول بر روی این رقاق صورت می‌گیرد، پس آن‌ها معارج (نردبان‌های عروج) و مدارج (پله‌های نزول) هستند و گاهی از آن‌ها به مناسبات تعبیر می‌شود. و بین این صور علوی فلکی و بین طبیعت، رقاقی کشیده شده است که از طبیعت بر روی آن‌ها آنچه قوام وجود این صور به آن است، نازل می‌شود. پس هنگامی که به آن رنگ پذیرفتند، بر صور سفلی عنصری آنچه قوام وجود آن‌ها به آن است، افاضه می‌کنند، اما تنها از حیث جسم و جسد بودن، تا صور آن‌ها حفظ شود. و بین این صور علوی فلکی و بین نفس کلیه (النفس الكلية) که شارع (پیامبر) (صَلَّى اللهُ عَليهِ وسَلَّم) از آن به لوح محفوظ (اللوح المحفوظ) تعبیر کرده است، به دلیل اینکه خداوند آنچه را در آن نوشته، حفظ کرده و پس از آن محو و تبدیلی به آن نرسیده است، رقاقی کشیده شده است. پس هر چیزی در آن است و در قرآن به تسمیه الهی «کل شیء» نامیده شده است. و کتب و صحیفه‌های نازل شده بر رسولان و پیامبرانش، مانند قول خداوند متعال: **﴿وَكَتَبْنَا لَهُ فِي الْأَلْوَاحِ مِنْ كُلِّ شَيْءٍ﴾** (و برای او در الواح از هر چیزی نوشتیم)، که همان لوح محفوظ (اللوح المحفوظ) است، **﴿مَوْعِظَةً وَتَفْصِيلًا لِكُلِّ شَيْءٍ﴾** (پند و تفصیلی برای هر چیزی)، که همان لوح محفوظ (اللوح المحفوظ) است. پس کتب نازل شده، مجمل آن را تفصیل دادند و موعظه آن را بیان کردند. پس بین این صور و بین این نفس، رقاقی کشیده شده است، از حیث ارواح آن‌ها که مدبر صور اجسادشان هستند. علوم و معارف بر آن‌ها نازل می‌شود، به آنچه خداوند بخواهد، یا از علم به او یا علم به آنچه از معلومات موجودات و معقولات بخواهد. پس هنگامی که ارواح این صور علوی فلکی آنچه را خداوند خواسته است، از علوم که برای آن‌ها به منزله غذای صور جسمی‌شان است، به دست آوردند، که قوام وجود و نعیم و لذت آن‌ها به آن است، و هنگامی که به آن انوار رنگ پذیرفتند و به آن تحقق یافتند، بر نفوس صور سفلی عنصری از آن علوم افاضه می‌کنند، بر حسب آنچه استعدادشان پذیرفته است. پس در علم به دلیل تفاوت استعداد، با یکدیگر تفاوت می‌یابند. سپس برخی به برخی دیگر تعلیم می‌دهند. و تعلیم چیزی نیست جز برداشتن حجاب‌هایی که استعدادشان آن‌ها را از پذیرش آن فیض پوشانده است. پس از آن برداشتن به «تعلیم» کنایه شده است. پس تعلیم چیزی نیست جز از آن فیض از آن صور علوی فلکی، همان‌گونه که مانعی که آب را از جریان باز می‌دارد، برداشته می‌شود. پس هنگامی که آن را برداشتی، آب در آن موضع که مانع از جریانش جلوگیری می‌کرد، جاری می‌شود. پس گشاینده این سد، آب را جاری نکرده است. همچنین معلم از این صور سفلی برای غیر خود از امثالشان، تنها حجاب جهل و شک را از آن‌ها برداشته است. پس آن فیض روحانی آشکار شد و از علوم آنچه را نزدش نبود، پذیرفت. پس تخیل کرد که معلم، کسی است که پوشش جهل او را برداشته است. و امر چنین نیست، پس بفهم. و بین این صور علوی فلکی و بین صور سفلی عنصری، رقاقی کشیده شده است برای اسماء الهی و حقایق ربانی، و آن‌ها همان وجوه خاصی هستند که برای هر ممکنی وجود دارد و از کلمه «کن» با توجه ارادی الهی صادر شده است، که مسبب عنه (معلول) آن را از غیر خود نمی‌داند، اگرچه برای او وجه خاصی از نفس خود وجود دارد که آن را می‌داند یا نمی‌داند. و از آن وجه است که هر چیزی به خدا نیازمند است، نه به سبب کونی خود. و آن سبب الهی نزدیک‌تر از سبب کونی است، زیرا سبب کونی از آن منفصل است و این سبب به انفصال از آن و اتصال مجاور متصف نمی‌شود، اگرچه در حق انسان از رگ گردن (حبل الورید) نزدیک‌تر است. پس قرب آن از آن نزدیک‌تر است. و خداوند متعال به هر صورت علوی و سفلی از علوم اختصاصی که جز آن کسی که به او عطا شده، نمی‌داند، آنچه را بخواهد، عطا می‌کند. و این‌ها همان علوم اذواق (چشیدنی) هستند که قابل انتقال و حکایت نیستند و جز کسی که آن را چشیده، نمی‌شناسد. و برای کسی که آن را چشیده، ممکن نیست که آن را به کسی که نچشیده، برساند. و در این میان، تفاوتی بین آن‌ها وجود دارد که شناخته نمی‌شود و ممکن نیست که عین آنچه خداوند او را به آن برتری داده، شناخته شود. پس چون در علم این اختصاص وجود داشت، در آنجا جنات اختصاص نیز وجود دارد.\n\n[همانا عالم از حیث حقیقتش بر چهار رکن در صورت جسمی و روحانی خود بنا شده است]\n\nهمانا در میان منازل و مقامات، منزلی که همه عالم و انسان را در بر گیرد، جز این منزل نیست. پس برای آن عموم رحمت (الرحمة) در عالم است، زیرا عالم از حیث حقیقتش بر چهار رکن در صورت جسمی و روحانی خود بنا شده است. پس از حیث طبیعتش مربع است و از حیث روحش مربع. از حیث جسدش دارای چهار طبیعت از چهار رکن است و از حیث روحش از مادر و پدر و نفخ (دمیدن) و توجه. پس رحمت (الرحمة) از چهار وجه به او رسیده است که برای هر وجهی رحمتی مخصوص به آن است. رحمتی که رطوبت او را باقی می‌دارد تا خشکی در آن تأثیر نکند، غیر از رحمتی است که خشکی او را حفظ می‌کند تا رطوبت آن را فانی نسازد. و رحمتی که سردی او را حفظ می‌کند تا گرمی آن را فانی نسازد، غیر از رحمتی است که گرمی او را حفظ می‌کند تا سردی آن را فانی نسازد. پس این‌ها با هم ممانعت کردند و به دلیل این ممانعت و تکافؤ، صورت جسم تا زمانی که این تکافؤ و ممانعت وجود دارد، باقی ماند. و از این منزل است که این چهار رحمت (الرحمة) منبعث شده است. پس کسی که بر آن‌ها از نفس خود واقف شود، آنچه را برای اوست، می‌داند و کسی که بر آن‌ها از نفس خود واقف نشود، حال خود را نمی‌داند. و خداوند کسی را که پوشانده است، از شهود آن‌ها پوشانده تا سخن نگویند، چنانکه در حدیث معاذ و حدیث عمر وارد شده است. و خداوند آن‌ها را برای امینان آشکار ساخت، زیرا می‌دانست که آن‌ها امانت را جز به اهلش نمی‌سپارند. زیرا خداوند برای علم، اهلی را مانند این خلق کرده است و وصول علم به آن‌ها را به دو نوع قرار داده است: یا از او به آن‌ها، یا از معلمی که امانت دیگری را می‌داند و خود امین است، مانند آنچه از امانت او دانسته است. پس آن علم را به او القا کرد، زیرا او اهل آن بود و از جانب خداوند متعال مأمور به ادای امانت است. پس هنگامی که بر این رحمت‌ها از نفس خود واقف شدی، بین تو و هر آنچه به دوری تو از خداوند متعال و از سعادتت می‌انجامد، حائل می‌شود و به انقیاد در برابر خدا در هر حالی که تو را به آن فراخوانده، متصف می‌شوی. این اثر آن در تو است، هنگامی که آن را مشاهده کنی، که ادب الهی را به تو به ارث می‌گذارد. و کسی که این علم را به تو می‌آورد، جز عالمی به تو و به آنچه حیات تو به آن است، نیست. و او از ارواح سیاره و فرشتگان صاحب بال (أولي الأجنحة) است، بر طبقاتشان در بال‌ها. پس بالاترین آن‌ها کمترین بال را دارند و کمترین بال را کسی دارد که دو بال دارد، زیرا کسی که یک بال داشته باشد و کمکی از بال یا غیر آن نداشته باشد، وجود ندارد. و ما حیوانی را دیدیم که بر یک پا بود و از سینه‌اش چیزی شبیه دُرّ محتسب بیرون آمده بود که آن را مانند بال حرکت می‌داد و با آن حرکت می‌دوید و پای واحد خود را چنان حرکت می‌داد که سریع‌ترین اسب‌ها در بین «القل» و «جیجل» در بلاد مغرب به او نمی‌رسید. پس برای ما کسی که کمکی ندارد، وجود ندارد. و از فرشتگان کسانی هستند که دو بال تا ششصد بال و بیشتر از آن دارند. پس این علمی است که برای کسی که به سوی او می‌آید، جز به دست فرشته‌ای کریم و مطیع که از خدا در آنچه به او امر کرده، نافرمانی نمی‌کند، نمی‌آید. او دو بال دارد که با آن‌ها به قلب این بنده نازل می‌شود. زیرا بال‌های فرشتگان برای نزول است نه برای صعود، و بال‌های اجسام عنصری برای صعود است نه برای نزول. زیرا فرشتگان به طبع خود که صورت اجسامشان بر آن است، به سوی افلاکشان که وجودشان از آن بوده، حرکت می‌کنند. و هنگامی که به زمین نازل می‌شوند، با آن بال‌ها پروازکنان نازل می‌شوند. و هنگامی که به افلاک خود باز می‌گردند، با طبع خود با حرکتی طبیعی باز می‌گردند، حتی اگر بال‌های خود را حرکت ندهند، به مقر و مقام خود با ذاتشان صعود می‌کنند. و اجسام پرندگان عنصری بال خود را برای صعود حرکت می‌دهند و اگر حرکت بال خود یا گستردن آن را ترک کنند، با طبع خود به زمین نازل می‌شوند. پس بال خود را در نزول نمی‌گسترند مگر برای وزن در نزول، زیرا اگر نزول خود را وزن نکنند و با طبع خود باقی بمانند، به دلیل قوت حکم طبع، در نزول آسیب می‌بینند. پس حرکت بال آن‌ها در نزول، حرکت حفظ است، پس این را بدان.\n\n[همانا چهارپایان (البهائم) از انسان و از امر سرای آخرت آگاهند]\n\nو بدان که چهارپایان (البهائم) از انسان و از امر سرای آخرت و از حقایقی (الحقائق) که هستی (الوجود) بر آن است، چیزهایی می‌دانند که برخی از مردم از آن جاهلند و آن را نمی‌دانند. چنانکه از برخی حکایت شده است که مردی را دید که بر الاغی سوار بود و با چوبی بر سر الاغ می‌زد. پس بیننده او را از زدن سر الاغ نهی کرد. الاغ به او گفت: او را واگذار، زیرا او بر سر خود می‌زند. پس او را عین الاغ قرار داد. و الاغ دانست که به مثل آنچه با او کرده است، مجازات می‌شود. و قول او «او را واگذار» به این دلیل بود که الاغ می‌دانست در آن برای او خیری نزد خدا هست، یا به دلیل علمش به اینکه او حق آنچه برای آن مسخر شده، وفا نکرده است. پس دانست که مستحق ضرب است. پس با این کار، شنونده خود را متوجه ساخت که شخص اگر حق آنچه بر او واجب شده است را برای صاحبش به جا نیاورد، مستحق ضرب است، به عنوان ادب و جزا برای آنچه از او سر زده است. و این‌ها همه وجوهی هستند که صورت این فعل و قول از این الاغ را محقق می‌سازند، علاوه بر وجوه دیگری که این فعل طلب می‌کند. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) درباره شتر ماده‌اش فرمود، هنگامی که به مدینه هجرت کرد و شتر در حیاط ابی ایوب انصاری زانو زد. اصحاب پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) که حاضر بودند، خواستند او را بلند کنند، در حالی که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) بر آن سوار بود، فرمود: **«دعوها فإنها مأمورة»** (او را واگذارید، زیرا او مأمور است). و فرمود: **«حبسها حابس الفيل»** (کسی که فیل را بازداشت، او را بازداشت). یعنی از مکه. و حدیث فیل مشهور به صحت است. پس همه آنچه غیر از ثقلین (جن و انس) و برخی از مردم و جن هستند، در امر خود از حیوان و نبات و جماد و ملک و روح، بر بینه‌ای از پروردگارشان هستند. و این منزل از علوم، علم اعداد و علم حروف را در بر می‌گیرد، که علم اولیاء است، چنانکه محمد بن علی ترمذی حکیم گفته است. و علم مجمل و علم رحمت‌های اختصاصی به انسان و علم تبیان و علم بشارت‌ها و علم مراتب ایمان و علم برپایی نشأت اعمال از مکلفین و غیر مکلفین و علم تلقی روحانی که از مُلقی (القا کننده) که حق (الحق) است، نه فرشته، ظاهر می‌شود. و علم ادای حقوق دیگران و علم آنچه از خدا برای کسی که در حق برادرش قدم بردارد، خواهد بود. و علم تولّی حق (الحق) آن را به نفس خود. و علم آنچه حضرت الهی (الحضرة الإلهية) بر آن است، از امانی که جز عالمان به خدا ذوقاً (ذوقاً) آن را نمی‌دانند. و علم دگرگونی احوال، که مواهب الهی به دلیل دگرگونی آن‌ها دگرگون می‌شود. و علم آیات و دلالات و اینکه بر چه چیزی دلالت می‌کنند و اختلاف آن‌ها با احدیت مدلول. و علم آنچه قلب را از علم به شیء می‌پوشاند، با وجود بیان در آن. و علم عنایت الهی به بخشش علم. و علم آنچه از علم از طریق وراثت حاصل می‌شود. و علم مراتب حیوان و اینکه در چه چیزی با هم تفاوت دارند و در چه چیزی برابرند. و آیا انسان به حیوان ملحق می‌شود یا نوع خاصی است و به چه چیزی از حیوان متمایز می‌شود؟ و ما دانسته‌ایم که هر حیوانی ناطق است. و علم آداب ملوک و اینکه پادشاه در ملک خود چگونه باید باشد. و ما در این فن کتابی به نام «التدبیرات الإلهية في إصلاح المملكة الإنسانية» (تدبیرات الهی در اصلاح مملکت انسانی) داریم. و علم نصایح برای دفع ضرر و احتیاط. و علم توحیدی که به چهارپایان (البهائم) اختصاص دارد. و علم جواز دروغ گفتن بر هر ناطقی، با علم به اینکه او صادق است، به جز ثقلین (جن و انس)، زیرا آن‌ها ممکن است در بسیاری از آنچه خبر می‌دهند، دروغ بگویند. و علم اتخاذ جاسوسان توسط پادشاهان و اینکه جاسوس در حال جاسوسی باید چه صفاتی را از خود نشان دهد و چه چیزی از آن ستوده است، اگرچه دروغ باشد. و علم مشورت بالاتر با پایین‌تر، با علم به اینکه او بدون مشورت به علم آنچه می‌خواهد بداند، می‌رسد. و اینکه حق تعالی (الحق) به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) امر کرد که در امری که برایش پیش می‌آید و در آن وحی‌ای به او نشده است، با اصحابش مشورت کند. و علم قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم): **«تهادوا تحابوا»** (به یکدیگر هدیه دهید تا محبت ورزید). و اینکه بخشش در نفوس چه اثری دارد که در ایمان قدح می‌کند، آیا ستوده است یا نکوهیده؟ زیرا احسان به ذات خود محبوب است، پس آیا مُحسن نیز چنین است یا از احسان جدا می‌شود؟ زیرا این مسئله‌ای خطیر و عظیم است در احسان کسی که خداوند به تو امر کرده است با او دشمنی کنی، و تو احسان او را بپذیری بدون آنکه محبتی به او در تو تأثیر کند، به دلیل ترجیح جانب خدا و امتثال امر او. و این خروج از طبع است و دشوار و مشکل است و ممکن است وقوع آن تصور نشود، اگرچه حکم آن در ظاهر آشکار نباشد، زیرا باطن نمی‌تواند آن را دفع کند. و علم موازنه بین دو مُحسن در آنچه برای شخص معینی احسان کرده‌اند، آیا برای نفس ترجیحی از حیث آنچه احسان کرده‌اند، واقع می‌شود، نه از حیث احسان؟ اگر در آن تفاضلی واقع شود، امر بر مؤمن عالم و شاهد احسان عام الهی مسخر، آسان می‌شود. و علم خواص و ظهور به آن در موطن قربت به خداوند متعال با آن. و علم شکر منعم. و علم آنچه ربوبیت مستحق آن است و در آن اشتراکی واقع نمی‌شود. و علم التباس برای ابتلاء. و علم نظر به خواستگاری شده و آنچه شرعاً برای بیننده مجاز است که از او ببیند، زیرا به آن امر شده است. و علم صورت آموختن علم. و علم اعتراف به جهل در برابر معلم. و علم حیله‌ها و مکر و کید و آنچه از آن نکوهیده و آنچه ستوده است. و علم ثنای مطلق و مقید و اینکه آیا ثنای مطلق وجود دارد یا به هیچ وجه صحیح نیست، اگرچه لفظ آن مطلق باشد. و علم حصر آنچه ثنا به آن مقید می‌شود، از هر ثناگو و ثناشده. و در آن علم تخییر از عالم به حق (الحق) است. و در آن علم منزلت زمین و آنچه به آن زینت داده شده است. و در آن علم سبب اجابت دعای کافر و مشرک و اینکه چه زمانی مشرک پروردگارش را توحید می‌کند. و در آن علم اندراج نور در ظلمت است. و در آن علم خلق و رزق است. و در آن علم قیامت است. و در آن علم انکار ممکن است. و در آن علم کشف (الکشف) غیب در حضرت غیب است. و در آن علم کسی است که ندا می‌دهد و اجابت نمی‌شود. و در آن علم این است که آیا حشر همه مردگان را در بر می‌گیرد یا فقط برخی از مردگان حشر می‌شوند. و در آن علم ناقور (صور) و اینکه چیست. و در آن علم این است که کدام جزا از عملش بهتر است یا همه جزاها از عملش بهتر است، و این علم شریفی است. و در آن علم عبادت پروردگار از حیث اضافه به کونی خاص است. و در آن علم آنچه رؤیت از علم آنچه قبلاً می‌دانست، عطا می‌کند. و **﴿وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ﴾** (و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 6
}