{
  "id": 130,
  "title": {
    "ar": "الباب الموفي ثلاثين ومائة في مقام العبودة",
    "en": "Chapter 130: Concerning the Station of Servitude (العبودة)",
    "ur": "ایک سو تیسواں باب مقام العبودیۃ (العبودة) کے بیان میں",
    "fa": "باب یکصد و سی‌ام در مقام عبودیت"
  },
  "content": {
    "ar": "## (الباب الموفي ثلاثين ومائة في مقام العبودة)\n> إني انتسبت إلى نفسي لمعرفتي *** بأن نسبتنا للحق معلوله‏\n\n\n> وكونه علة للخلق مجهلة *** بما له من علو القدر مجهوله‏\n\n\n> هو الغني على الإطلاق ليس له *** فقر قد أودع الرحمن تنزيله‏\n\n\n> هذا الذي قلته القرآن فصله *** فابحث عليه ترى بالبحث تفصيله‏\n\n\n### [مقام العبودية مقام الذلة والافتقار]\n\n\nالعبودية نسب إلى العبودة والعبودة مخلصة من غير نسب لا إلى الله ولا إلى نفسها لأنه لا يقبل النسب إليه ولذلك لم تجي‏ء بيا النسب فأذل الأذلاء من ينتسب إلى ذليل على جهة الافتخار به ولهذا قيل في الأرض ذلول ببنية المبالغة في الذلة لأن الأذلاء يطئونها فهي أعظم في الذلة منهم فمقام العبودية مقام الذلة والافتقار وليس بنعت إلهي قال أبو يزيد البسطامي وما وجد سببا يتقرب به إلى الله إذ رأى كل نعت يتقرب به إلى الله للالوهية فيه مدخل فلما عجز قال يا رب بما ذا أتقرب إليك قال الله له بما جرت عادة الله مع أوليائه أن يخاطبهم به تقرب إلي بما ليس لي الذلة والافتقار\n\n\n### [تقرب العبد إلى الله بما ليس له وتقرب الله إلى العبد بما ليس له‏]\n\n\nوهنا سر لا يمكن كشفه فمن أطلعه الله عليه عرفه نطق الله عباده عليه بأن له صاحبه وولدا وأمثالا وأن له البخل وأنه فقير من العرض بقولهم ونَحْنُ أَغْنِياءُ ثم قال سَنَكْتُبُ ما قالُوا وكتبة الله إيجاب وهذا موضع السر لمن فتح الله عين بصيرته ثم في قوله لَقَدْ سَمِعَ الله قَوْلَ الَّذِينَ قالُوا إِنَّ الله فَقِيرٌ ونَحْنُ أَغْنِياءُ فألحقهم في العقاب بالكفار وهم الذين ستروا ما يجب للحق عليهم من التنزيه والاشتراك في أسماء الصفات لا في مسمياتها فالعبد معناه الذليل يقال أرض معبدة أي مذللة\n\n\n### [لا يذل لله من لا يعرفه تعالى‏]\n\n\nقال الله عز وجل وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ وما قال ذلك في غير هذين الجنسين لأنه ما ادعى أحد الألوهية ولا اعتقدها في غير الله ولا تكبر على خلق الله إلا هذان الجنسان فلذلك خصهما بالذكر دون سائر المخلوقات فقال ابن عباس معناه ليعرفوني فما فسر بحقيقة ما تعطيه دلالة اللفظ وإنما تفسيره ليذلوا لي ولا يذل له من لا يعرفه فلا بد من المعرفة به أولا وأنه ذو العزة التي تذل الأعزاء لها فلذلك عدل ابن عباس في تفسير العبادة إلى المعرفة هذا هو الظن به‏\n\n\n### [مقام العبودية لم يتحقق به على كماله مثل رسوله الله‏]\n\n\nولم يتحقق بهذا المقام على كماله مثل رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فكان عبدا محضا زاهدا في جمع الأحوال التي تخرجه عن مرتبة العبودية وشهد الله له بأنه عبد مضاف إليه من حيث هويته واسمه الجامع فقال في حق اسمه وأَنَّهُ لَمَّا قامَ عَبْدُ الله يَدْعُوهُ وقال في حق هويته سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ فأسرى به عبدا ولما أمر بتعريف مقامه يوم القيامة قيد ذلك‏\n\n\nفقال أنا سيد ولد آدم ولا فخر\n\n\nبالراء أي ما قصدت الفخر عليكم بالسيادة بل أردت التعريف بشرى لكم إذ أنتم مأمورون باتباعي وقد روى ولا فخز\n\n\nبالزاي ما قلته متبجحا وأنا لست كذلك فإن الفخر التبجح بالباطل في صورة حق‏\n\n\n### [العبد مع الحق في حال عبوديته كالظل مع الشخص في مقابلة السراج‏]\n\n\nفالعبد مع الحق في حال عبوديته كالظل مع الشخص في مقابلة السراج كلما قرب من السراج عظم الظل ولا قرب من الله إلا بما هو لك وصف أخص لا له وكلما بعد من السراج صغر الظل فإنه ما يبعدك عن الحق إلا خروجك عن صفتك التي تستحقها وطمعك في صفته كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ وهما صفتان لله تعالى وذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ وهذا\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم أعوذ بك منك‏\n\n\n### [دخول العبد على الحق بنعته الأخص واستقبال الحق له بنعته الأخص‏]\n\n\nوهذا المقام لا يبقى لك صفة تخص الحق وينفرد بها ولا يمكن حصول اشتراك فيها من النعوت الثبوتية لا النعوت السلبية والإضافية إلا ويعلمها صاحب هذا المقام خاصة ولكن عز صاحبه ذوقا فإن الوصف الأخص منك إذا تحققت به وانفردت ودخلت به على الحق لم يقابلك إلا بالنعت الأخص به الذي لا قدم لك فيه وإذا جئت بالنعت المشترك تجلى لك بالنعت المشترك فتعرف سر نسبته إليك من نسبته إليه وهو علم غريب قل أن تجد له ذائقا ومع هذا فهو دون الأول الذي هو الأخص بك فاعلم ذلك فتحقق بهذا المقام فهذا أعطاك مقام العبودية\n\n\n### [الظاهر ينصبغ بحقيقة المظهر كان ما كان‏]\n\n\nوأما مقام العبودة فلا تدري ما يحصل لك فيه من العلم به فإنك تنفي النسب فيه عنه تعالى وعن الكون وهو مقام عزيز جدا لأنه لا يصح عند الطائفة أن يبقى الكون مع إمكانه بغير نسب وهو بالذات واجب لغيره والتنبيه على هذا المقام وصف الظاهر في المظهر بنعت العبد فإن الظاهر ينصبغ بحقيقة المظهر كان ما كان فلا ينتسب الظاهر إلى العبودية فإنه ليس وراءها نزول والمنتسب لا بد أن يكون أنزل في المرتبة من المنسوب إليه ولا ينتسب الظاهر إلا إليه فإن الأثر الذي أعطاه عين المظهر ليس غير الظاهر وليس وراء الله مرمى والشي‏ء لا ينسب إلى نفسه فلهذا جاءت العبودة\nبغير ياء النسب يقال رجل بين العبودية والعبودة أي ذاته ظاهرة ونسبه مجهول فلا ينسب فإنه ما ثم إلى من فهو عبد لا عبد\n\n",
    "en": "## Chapter One Hundred and Thirty: Concerning the Station of Pure Servitude (مقام العبودة)\n\nI attributed myself to my own soul, due to my knowledge,\nThat our relationship/attribution to the Real (الحق) is contingent.\n\nAnd His being the Cause of creation (الخلق) is unknown,\nDue to the unknown nature of His high rank.\n\nHe is the Absolutely Rich (الغني على الإطلاق); He has no\nPoverty (فقر), which the All-Merciful (الرحمن) has deposited in His Revelation (تنزيله).\n\nWhat I have said, the Quran details it;\nSo search for it, and through searching, you will see its elaboration.\n\n### [The Station of Servanthood (مقام العبودية) is the Station of Lowliness and Indigence (الذلة والافتقار)]\n\nServanthood (العبودية) is an attribution (نسب) to Pure Servitude (العبودة). Pure Servitude (العبودة) is absolute, free from any relationship, neither to Allah nor to itself, because He does not accept attribution to Him. For this reason, it does not come with the *yā’* of attribution (ياء النسب).\n\nThe lowest of the lowly is he who attributes himself to something low out of pride in it. This is why the earth is called *dhalūl* (ذلول—submissive), using the intensive form of lowliness (الذلة), because the lowly tread upon it, making the earth greater in lowliness than they are.\n\nThus, the Station of Servanthood (مقام العبودية) is the station of lowliness and indigence (الذلة والافتقار), and it is not a Divine Attribute (نعت إلهي). Abū Yazīd al-Bisṭāmī said: He found no means by which to draw near to Allah, for he saw that every attribute used to draw near to Allah had a connection to Divinity (الألوهية). When he was unable, he said, \"O Lord, by what shall I draw near to You?\" Allah said to him—in the manner that is God’s custom when addressing His saints—\"Draw near to Me by that which is not Mine: lowliness and indigence.\"\n\n### [The Servant Drawing Near to Allah by What is Not His, and Allah Drawing Near to the Servant by What is Not His]\n\nHerein lies a secret that cannot be unveiled. Whoever Allah informs of it knows it. Allah caused His servants to speak against Him, claiming that He has a consort, a son, and peers, and that He is miserly, and that He is poor, in contrast to their saying: <<وَنَحْنُ أَغْنِيَاءُ>> (and we are rich). Then He said: <<سَنَكْتُبُ مَا قَالُوا>> (We shall record what they said). Allah’s recording is an affirmation (إيجاب). This is the locus of the secret for whomever Allah opens the eye of their insight (بصيرته).\n\nFurthermore, in His saying: <<لَقَدْ سَمِعَ الله قَوْلَ الَّذِينَ قَالُوا إِنَّ الله فَقِيرٌ وَنَحْنُ أَغْنِيَاءُ>> (Indeed, Allah has heard the saying of those who said, 'Indeed, Allah is poor, and we are rich'), He joined them in punishment with the disbelievers (الكفار). They are those who concealed the necessary transcendence (التنزيه) due to the Real (الحق) from them, and the sharing in the Names of the Attributes (أسماء الصفات), but not in their referents (مسمياتها).\n\nThe servant (*al-abd*) means the lowly one (*al-dhalīl*). It is said: *ardun mu'abbadah* (أرض معبدة), meaning land made low/submissive.\n\n### [He Who Does Not Know the Exalted Does Not Submit to Him]\n\nAllah, the Mighty and Majestic, said: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except that they should worship Me). He did not say this concerning any other two kinds, because no one has claimed Divinity (الألوهية) or believed in it for other than Allah, nor has anyone shown arrogance toward Allah’s creation, except these two kinds. Therefore, He singled them out for mention, excluding all other creatures.\n\nIbn Abbas said its meaning is: \"that they may know Me (ليعرفوني).\" This interpretation does not explain the reality conveyed by the literal meaning of the word. Rather, its interpretation is: \"that they may submit to Me (ليذلوا لي).\" And he who does not know Him does not submit to Him. Therefore, knowledge (المعرفة) of Him is necessary first, and that He is the Possessor of the Might (العزة) before which the mighty submit. For this reason, Ibn Abbas shifted the interpretation of worship (*al-ibādah*) to gnosis (*al-ma'rifah*). This is the assumption concerning him.\n\n### [No One Attained the Perfection of the Station of Servanthood Like the Messenger of Allah]\n\nNo one attained the perfection of this Station (مقام) like the Messenger of Allah (peace and blessings be upon him). He was a pure servant (*abd mahd*), ascetic regarding all states that would remove him from the degree of Servanthood (مرتبة العبودية).\n\nAllah bore witness for him that he was a servant attributed to Him, both in terms of his identity (هويته) and His Comprehensive Name (اسمه الجامع). Regarding His Name, He said: <<وَأَنَّهُ لَمَّا قَامَ عَبْدُ اللهِ يَدْعُوهُ>> (And that when the servant of Allah stood up, calling upon Him). And regarding his identity, He said: <<سُبْحَانَ الَّذِي أَسْرَى بِعَبْدِهِ>> (Exalted is He who took His servant by night).\n\nThus, He took him on the Night Journey as a servant. When he was commanded to define his station on the Day of Resurrection, he qualified it, saying: \"I am the Master (Sayyid) of the children of Adam, and *lā fakhr* (لا فخر) [with the *rā’*].\" Meaning: I did not intend to boast over you with this mastery, but rather I intended to inform you, as good tidings for you, since you are commanded to follow me. It has also been narrated as *lā fakhz* (لا فخز) [with the *zāy*], meaning: I did not say this boastfully, for I am not like that, as boasting (*al-fakhr*) is showing off with falsehood in the guise of truth.\n\n### [The Servant with the Real in His State of Servanthood is Like the Shadow with the Person Facing the Lamp]\n\nThe servant, with the Real (الحق) in his state of servanthood (عبوديته), is like the shadow with the person facing the lamp (السراج). The closer one gets to the lamp, the larger the shadow becomes. And there is no drawing near to Allah except through that which is your most specific attribute (وصف أخص), not His.\n\nThe further one moves from the lamp, the smaller the shadow becomes. For nothing distances you from the Real except your departure from the attribute you deserve and your coveting of His Attribute. <<كَذَلِكَ يَطْبَعُ اللهُ عَلَى كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ>> (Thus does Allah seal over every heart of an arrogant tyrant). These are two Attributes of Allah, the Exalted. And: <<ذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ>> (Taste! Indeed, you are the mighty, the noble). This relates to his (peace and blessings be upon him) saying: \"I seek refuge in You from You.\"\n\n### [The Servant Entering upon the Real with His Most Specific Quality, and the Real Receiving Him with His Most Specific Quality]\n\nIn this Station (مقام), no Attribute remains that belongs specifically to the Real (الحق) and is unique to Him—and in which no sharing is possible among the affirmative qualities (النعوت الثبوتية), excluding the negative and relational qualities (النعوت السلبية والإضافية)—except that the possessor of this Station knows it specifically, though its attainment is rare in terms of direct experience (ذوقا).\n\nFor if you realize your most specific attribute, become unique in it, and enter upon the Real with it, He will only meet you with His most specific quality, in which you have no footing. If you come with a shared quality (النعت المشترك), He will manifest (تجلى) to you through the shared quality. Thus, you will know the secret of its attribution to you from its attribution to Him. This is a strange knowledge (علم غريب); rarely will you find one who tastes it. Yet, even this is below the first, which is your most specific attribute. Know this, and realize this Station, for this grants you the Station of Servanthood (مقام العبودية).\n\n### [The Manifest is Colored by the Reality of the Locus of Manifestation, Whatever It May Be]\n\nAs for the Station of Pure Servitude (مقام العبودة), you do not know what knowledge of Him you will attain therein, for in it you negate the relationship (النسب) both from the Exalted and from the cosmos (الكون). It is a very rare Station (مقام عزيز جدا), because, according to the Sufi community (الطائفة), it is not sound for the cosmos, despite its contingency (إمكانه), to remain without a relationship, even though it is essentially necessary for other than itself (واجب لغيره).\n\nThe indication of this Station is the description of the Manifest (الظاهر) in the Locus of Manifestation (المظهر) with the quality of the servant (*al-abd*). For the Manifest is colored by the reality of the Locus of Manifestation, whatever that may be.\n\nThe Manifest is not attributed to Servanthood (العبودية), for there is no descent beyond it. And the attributed (المنتسب) must necessarily be lower in degree (المرتبة) than that to which he is attributed. The Manifest is only attributed to Him (Allah), for the effect (الأثر) that the Locus of Manifestation grants is none other than the Manifest, and there is no goal beyond Allah.\n\nAnd a thing is not attributed to itself. For this reason, *al-Ubūdah* (العبودة) came without the *yā’* of attribution. It is said: A man is between *al-Ubūdiyyah* (Servanthood) and *al-Ubūdah* (Pure Servitude)—meaning his essence (ذاته) is manifest, but his relationship (نسبه) is unknown, so he is not attributed, for there is no one to attribute him to. Thus, he is a servant (*abd*), not a relational servant.",
    "ur": "(باب ایک سو تیسواں: مقام عبودت (العبودة) کے بیان میں)\n\nمیں نے اپنی ذات کی طرف نسبت کی، اس معرفت کی بنا پر\nکہ ہماری نسبت ذات حق (الحق) کی طرف معلول (ثانوی) ہے۔\nاور اس کا مخلوق کے لیے علت ہونا ایک ایسی جہالت ہے\nجو اس کے بلند مرتبہ کی وجہ سے نامعلوم ہے۔\nوہ مطلقاً غنی ہے، اس کے لیے کوئی فقر نہیں\nجسے رحمن نے اپنے تنزیل (قرآن) میں ودیعت کیا ہے۔\nیہ جو میں نے کہا ہے، قرآن نے اسے تفصیل سے بیان کیا ہے،\nپس اس پر تحقیق کرو، تم تحقیق کے ذریعے اس کی تفصیل دیکھو گے۔\n\n### [مقام بندگی (العبودیۃ) ذلت اور محتاجی کا مقام ہے]\n\nبندگی (العبودیۃ) عبودت (العبودة) کی طرف ایک نسبت ہے۔ اور عبودت (العبودة) نسبت سے پاک ہے، نہ اللہ کی طرف اور نہ ہی اپنی ذات کی طرف، کیونکہ وہ (اللہ) نسبت کو قبول نہیں کرتا۔ اسی لیے یہ (العبودة) یاءِ نسبت کے بغیر آئی ہے۔ پس ذلیل ترین وہ ہے جو کسی ذلیل کی طرف فخر کے طور پر نسبت کرے۔ اسی لیے زمین کے بارے میں ذلول (ذلت میں مبالغہ کا صیغہ) کہا گیا ہے، کیونکہ ذلیل لوگ اسے روندتے ہیں، لہٰذا وہ ان سے زیادہ ذلت میں ہے۔ پس مقام بندگی (العبودیۃ) ذلت اور محتاجی (الافتقار) کا مقام ہے، اور یہ کوئی الٰہی صفت نہیں ہے۔ ابو یزید بسطامی نے فرمایا: \"میں نے کوئی ایسا ذریعہ نہ پایا جس سے اللہ کا قرب حاصل کروں، کیونکہ میں نے دیکھا کہ ہر وہ صفت جس کے ذریعے اللہ کا قرب حاصل کیا جاتا ہے، اس میں الوہیت کا دخل ہے۔\" جب وہ عاجز ہو گئے تو عرض کیا: \"اے رب! میں کس چیز کے ذریعے تیرا قرب حاصل کروں؟\" اللہ نے ان سے اس طریقے سے فرمایا جس سے اللہ اپنے اولیاء سے مخاطب ہونے کا عادی ہے: \"میرا قرب اس چیز سے حاصل کر جو میری نہیں ہے: ذلت اور محتاجی (الافتقار)۔\"\n\n### [بندے کا اللہ کا قرب اس چیز سے حاصل کرنا جو اس کی نہیں اور اللہ کا بندے کا قرب اس چیز سے حاصل کرنا جو اس کی نہیں]\n\nاور یہاں ایک ایسا راز ہے جس کا کشف (الکشف) ممکن نہیں، پس جسے اللہ اس پر مطلع کر دے وہ اسے جان لیتا ہے۔ اللہ نے اپنے بندوں کو اس پر گویا کیا کہ اس کی بیوی، بیٹا اور مثالیں ہیں، اور یہ کہ وہ بخیل ہے اور وہ فقیر ہے، جیسا کہ ان کے اس قول سے ظاہر ہوتا ہے: \"اور ہم غنی ہیں (وَنَحْنُ أَغْنِيَاءُ)\"۔ پھر فرمایا: \"ہم لکھ لیں گے جو انہوں نے کہا (سَنَكْتُبُ مَا قَالُوا)\"۔ اور اللہ کا لکھنا ایجاب (لازم کرنا) ہے۔ اور یہ اس شخص کے لیے راز کی جگہ ہے جس کی بصیرت کی آنکھ اللہ نے کھول دی ہو۔ پھر اس کے اس قول میں: \"یقیناً اللہ نے ان لوگوں کی بات سن لی جنہوں نے کہا کہ اللہ فقیر ہے اور ہم غنی ہیں (لَقَدْ سَمِعَ اللَّهُ قَوْلَ الَّذِينَ قَالُوا إِنَّ اللَّهَ فَقِيرٌ وَنَحْنُ أَغْنِيَاءُ)\"۔ پس اللہ نے انہیں سزا میں کفار کے ساتھ شامل کر دیا، اور یہ وہ لوگ ہیں جنہوں نے ذات حق (الحق) کے لیے تنزیہ (پاکیزگی) کو چھپایا جو ان پر واجب تھی، اور صفات کے ناموں میں اشتراک کو چھپایا، نہ کہ ان کے مسمیات میں۔ پس عبد (بندہ) کا معنی ہے ذلیل۔ کہا جاتا ہے: \"أرض معبدة\" یعنی ذلیل کی گئی زمین۔\n\n### [اللہ کے لیے وہ ذلیل نہیں ہوتا جو اسے نہیں پہچانتا]\n\nاللہ عزوجل نے فرمایا: \"اور میں نے جنوں اور انسانوں کو صرف اس لیے پیدا کیا کہ وہ میری بندگی کریں (وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ)\"۔ اور اللہ نے یہ بات ان دو جنسوں کے علاوہ کسی اور کے بارے میں نہیں فرمائی، کیونکہ ان دو جنسوں کے علاوہ کسی نے نہ تو الوہیت کا دعویٰ کیا اور نہ ہی اللہ کے سوا کسی اور میں اس کا اعتقاد رکھا، اور نہ ہی اللہ کی مخلوق پر تکبر کیا۔ اسی لیے اللہ نے انہیں باقی تمام مخلوقات کے مقابلے میں خاص طور پر ذکر کیا۔ ابن عباس رضی اللہ عنہما نے فرمایا کہ اس کا معنی ہے: \"تاکہ وہ مجھے پہچانیں (لیعرفونی)\"۔ انہوں نے اس کی تفسیر لفظ کی دلالت کے حقیقی مفہوم کے مطابق نہیں کی، بلکہ اس کی تفسیر یہ ہے کہ: \"تاکہ وہ میرے لیے ذلیل ہوں\"۔ اور جو اسے نہیں پہچانتا وہ اس کے لیے ذلیل نہیں ہوتا۔ لہٰذا پہلے اس کی معرفت (المعرفۃ) ضروری ہے، اور یہ کہ وہ اس عزت کا مالک ہے جس کے سامنے تمام عزت والے ذلیل ہو جاتے ہیں۔ اسی لیے ابن عباس نے عبادت کی تفسیر میں معرفت کی طرف رجوع کیا، اور یہی ان کے بارے میں گمان ہے۔\n\n### [مقام بندگی (العبودیۃ) کو رسول اللہ صلی اللہ علیہ وسلم کے سوا کسی نے کمال کے ساتھ حاصل نہیں کیا]\n\nاور اس مقام کو کمال کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کے سوا کسی نے حاصل نہیں کیا، پس آپ خالص بندے تھے، اور ان تمام احوال سے بے رغبت تھے جو آپ کو بندگی (العبودیۃ) کے مرتبے سے نکال دیں۔ اور اللہ نے آپ کے لیے گواہی دی کہ آپ اس کی طرف منسوب بندے ہیں، آپ کی ہویت (ذات) اور آپ کے اسم جامع کے لحاظ سے۔ پس اللہ نے آپ کے اسم کے حق میں فرمایا: \"اور جب اللہ کا بندہ اسے پکارنے کے لیے کھڑا ہوا (وَأَنَّهُ لَمَّا قَامَ عَبْدُ اللَّهِ يَدْعُوهُ)\"۔ اور آپ کی ہویت کے حق میں فرمایا: \"پاک ہے وہ ذات جو اپنے بندے کو لے گئی (سُبْحَانَ الَّذِي أَسْرَى بِعَبْدِهِ)\"۔ پس اللہ نے آپ کو بندے کی حیثیت سے معراج کرائی۔ اور جب آپ کو قیامت کے دن اپنے مقام کی تعریف کا حکم دیا گیا تو آپ نے اسے مقید فرمایا:\n\"میں اولاد آدم کا سردار ہوں اور کوئی فخر نہیں (ولا فخر)\"۔\n(راء کے ساتھ) یعنی میں نے سرداری کے ذریعے تم پر فخر کرنا مقصود نہیں رکھا، بلکہ میں نے تمہارے لیے تعریف اور خوشخبری کا ارادہ کیا، کیونکہ تمہیں میری پیروی کا حکم دیا گیا ہے۔ اور یہ بھی روایت کیا گیا ہے: \"ولا فخز\" (زا کے ساتھ) یعنی میں نے یہ بات شیخی بگھارتے ہوئے نہیں کہی، اور میں ایسا نہیں ہوں، کیونکہ فخر حق کی صورت میں باطل پر شیخی بگھارنا ہے۔\n\n### [بندہ بندگی (العبودیۃ) کی حالت میں ذات حق (الحق) کے ساتھ ایسا ہے جیسے چراغ کے سامنے شخص کا سایہ]\n\nپس بندہ بندگی (العبودیۃ) کی حالت میں ذات حق (الحق) کے ساتھ ایسا ہے جیسے چراغ کے سامنے شخص کا سایہ۔ جب بھی وہ چراغ کے قریب ہوتا ہے، سایہ بڑا ہو جاتا ہے۔ اور اللہ کا قرب صرف اس صفت کے ذریعے حاصل ہوتا ہے جو تمہارے لیے خاص ہے، نہ کہ اس کے لیے۔ اور جب بھی وہ چراغ سے دور ہوتا ہے، سایہ چھوٹا ہو جاتا ہے۔ کیونکہ تمہیں ذات حق (الحق) سے صرف تمہارا اپنی مستحق صفت سے نکل جانا اور اس کی صفت میں لالچ کرنا ہی دور کرتا ہے۔ \"اسی طرح اللہ ہر متکبر، جبار کے دل پر مہر لگا دیتا ہے (كَذَلِكَ يَطْبَعُ اللَّهُ عَلَى كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ)\"۔ اور یہ دونوں (متکبر، جبار) اللہ تعالیٰ کی صفات ہیں۔ اور (اس سے کہا جائے گا) \"چکھ لے، بے شک تو ہی غالب، عزت والا ہے (وَذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ)\"۔ اور یہی آپ صلی اللہ علیہ وسلم کا قول ہے: \"میں تیری پناہ مانگتا ہوں تجھ سے (أعوذ بك منك)\"۔\n\n### [بندے کا ذات حق (الحق) پر اپنی خاص صفت کے ساتھ داخل ہونا اور ذات حق کا اسے اپنی خاص صفت کے ساتھ استقبال کرنا]\n\nاور اس مقام میں تمہارے لیے کوئی ایسی صفت باقی نہیں رہتی جو ذات حق (الحق) کے لیے خاص ہو اور وہ اس میں منفرد ہو، اور نہ ہی ثبوتی صفات میں (نہ کہ سلبی اور اضافی صفات میں) اس میں اشتراک ممکن ہو، مگر یہ کہ اس مقام کا مالک اسے خاص طور پر جانتا ہے۔ لیکن اس کے مالک کا ذوق (ذوقا) نایاب ہے۔ کیونکہ جب تم اپنی اس خاص صفت کے ساتھ متحقق ہو جاتے ہو اور منفرد ہو کر ذات حق (الحق) پر داخل ہوتے ہو، تو وہ تمہارا استقبال صرف اپنی اس خاص صفت کے ساتھ کرتا ہے جس میں تمہارا کوئی حصہ نہیں ہے۔ اور جب تم مشترک صفت کے ساتھ آتے ہو، تو وہ تمہارے لیے مشترک صفت کے ساتھ تجلی (التجلی) فرماتا ہے۔ پس تم اس کی نسبت کا راز اپنی طرف سے اس کی طرف جان لیتے ہو۔ اور یہ ایک عجیب علم ہے، کم ہی لوگ ہیں جو اس کا ذائقہ چکھتے ہیں۔ اس کے باوجود، یہ پہلے (مقام) سے کم ہے جو تمہارے لیے خاص ہے۔ پس یہ جان لو اور اس مقام کو حاصل کرو، کیونکہ یہ تمہیں مقام بندگی (العبودیۃ) عطا کرتا ہے۔\n\n### [ظاہر (الظاہر) مظہر (المظہر) کی حقیقت سے رنگین ہو جاتا ہے، خواہ وہ کچھ بھی ہو]\n\nاور جہاں تک مقام عبودت (العبودة) کا تعلق ہے، تو تم نہیں جانتے کہ اس میں تمہیں اس کے بارے میں کیا علم حاصل ہوتا ہے۔ کیونکہ تم اس میں اس (اللہ) سے اور کائنات سے نسبت کی نفی کرتے ہو۔ اور یہ بہت ہی نایاب مقام ہے، کیونکہ صوفیاء کے نزدیک یہ درست نہیں کہ کائنات اپنے امکان کے باوجود نسبت کے بغیر باقی رہے۔ اور وہ (کائنات) بالذات واجب لغیرہ ہے۔ اس مقام پر تنبیہ یہ ہے کہ مظہر (المظہر) میں ظاہر (الظاہر) کو بندے کی صفت سے متصف کیا جائے۔ کیونکہ ظاہر (الظاہر) مظہر (المظہر) کی حقیقت سے رنگین ہو جاتا ہے، خواہ وہ کچھ بھی ہو۔ پس ظاہر (الظاہر) بندگی (العبودیۃ) کی طرف نسبت نہیں کرتا، کیونکہ اس کے بعد کوئی نزول نہیں ہے۔ اور نسبت کرنے والے کا مرتبہ منسوب الیہ سے کم ہونا ضروری ہے۔ اور ظاہر (الظاہر) صرف اسی (اللہ) کی طرف نسبت کرتا ہے، کیونکہ وہ اثر جو مظہر (المظہر) نے دیا ہے، وہ ظاہر (الظاہر) کے سوا کچھ نہیں ہے۔ اور اللہ کے ماوراء کوئی ٹھکانہ نہیں ہے۔ اور کوئی شے اپنی ذات کی طرف نسبت نہیں کرتی۔ اسی لیے عبودت (العبودة) یاءِ نسبت کے بغیر آئی ہے۔ کہا جاتا ہے: \"رجل بین العبودیۃ والعبودة\" یعنی اس کی ذات ظاہر ہے اور اس کی نسبت نامعلوم ہے، لہٰذا وہ نسبت نہیں کرتا۔ کیونکہ وہاں کوئی نہیں ہے جس کی طرف نسبت کی جائے، پس وہ عبد (بندہ) ہے، نہ کہ منسوب عبد۔",
    "fa": "باب یکصد و سی‌ام در مقام عبوده (العبودة)\n\nمن خود را به خویشتن نسبت دادم، زیرا دانستم\nکه نسبت ما به حق (الحق) معلول است.\n\nو اینکه او علت خلق است، مجهول است\nبه سبب علو قدرش که ناشناخته است.\n\nاو غنی مطلق است و فقر برای او نیست\nکه خداوند رحمان آن را در تنزیلش (قرآن) به ودیعه نهاده است.\n\nاین چیزی که گفتم، قرآن آن را تفصیل داده است\nپس در آن جستجو کن تا تفصیلش را با تحقیق ببینی.\n\n### [مقام عبودیت (العبودية)، مقام ذلت و افتقار]\n\nعبودیت (العبودية) نسبتی است به عبوده (العبودة)، و عبوده (العبودة) خالص است و نسبتی ندارد، نه به خدا و نه به خودش؛ زیرا نسبت را نمی‌پذیرد. به همین دلیل با یای نسبت (یاء النسب) نیامده است. پس خوارترینِ خواران کسی است که از روی افتخار به خواری منتسب شود. به همین دلیل در مورد زمین گفته شده است: «ذلول» (ذلیل) با صیغه مبالغه در ذلت، زیرا خواران بر آن گام می‌نهند، پس ذلت آن از ایشان بیشتر است. بنابراین، مقام عبودیت (العبودية) مقام ذلت و افتقار (الافتقار) است و صفت الهی نیست. ابویزید بسطامی گفت: «هیچ سببی برای تقرب به خدا نیافتم، زیرا دیدم هر صفتی که با آن به خدا تقرب جویم، الوهیت در آن مدخل دارد.» پس چون عاجز شد، گفت: «پروردگارا، با چه چیزی به تو تقرب جویم؟» خداوند به او فرمود (به شیوه‌ای که عادت خدا بر خطاب به اولیائش جاری است): «با آنچه که برای من نیست، به من تقرب جوی: ذلت و افتقار.»\n\n### [تقرب بنده به خدا با آنچه که برای خدا نیست و تقرب خدا به بنده با آنچه که برای بنده نیست]\n\nو در اینجا رازی است که کشف آن ممکن نیست. هر کس که خداوند او را بر آن مطلع سازد، آن را می‌شناسد. خداوند بندگانش را بر این امر آگاه ساخت که او همسر و فرزند و امثال دارد، و اینکه او بخل می‌ورزد و فقیر است، به دلیل گفتارشان: **وَنَحْنُ أَغْنِيَاءُ** (و ما توانگریم). سپس فرمود: **سَنَكْتُبُ مَا قَالُوا** (به زودی آنچه را گفتند خواهیم نوشت). و نوشتن خداوند، ایجاب است. این موضع سر است برای کسی که خداوند چشم بصیرتش را گشوده باشد. سپس در این قول خداوند: **لَقَدْ سَمِعَ اللَّهُ قَوْلَ الَّذِينَ قَالُوا إِنَّ اللَّهَ فَقِيرٌ وَنَحْنُ أَغْنِيَاءُ** (به راستی خداوند سخن کسانی را که گفتند: «خداوند فقیر است و ما توانگریم» شنید)، آنان را در عقوبت به کفار ملحق ساخت. و ایشان کسانی هستند که آنچه را که از تنزیه (پاک دانستن) بر حق (الحق) واجب است، پوشاندند، و همچنین اشتراک در اسماء صفات، نه در مسمیات آن‌ها. پس معنای «عبد» (بنده) همان ذلیل است. گفته می‌شود: «أرض معبدة» (زمین معبده) یعنی زمینی که ذلیل و رام شده است.\n\n### [کسی که خداوند متعال را نشناسد، برای او ذلت نمی‌پذیرد]\n\nخداوند عز و جل فرمود: **وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ** (و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند). و این را در مورد غیر این دو جنس نفرمود، زیرا هیچ کس جز این دو جنس ادعای الوهیت نکرده و آن را در غیر خدا باور نداشته و بر خلق خدا تکبر نورزیده است. به همین دلیل، این دو را به ذکر اختصاص داد نه سایر مخلوقات را. ابن عباس گفت: معنای آن این است که «مرا بشناسند» (لیعرفونی). اما این تفسیر، حقیقت دلالت لفظ را نمی‌دهد، بلکه تفسیر آن این است که «برای من ذلت بپذیرند». و کسی که او را نشناسد، برای او ذلت نمی‌پذیرد. پس ناگزیر ابتدا باید معرفت (المعرفة) به او حاصل شود و اینکه او صاحب عزتی است که عزیزان در برابر آن ذلیل می‌شوند. به همین دلیل ابن عباس در تفسیر عبادت به معرفت (المعرفة) عدول کرد. این گمان ما درباره اوست.\n\n### [کسی به کمال این مقام عبودیت (العبودية) متحقق نشد مگر رسول خدا]\n\nو کسی به کمال این مقام متحقق نشد مگر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم). او بنده‌ای محض بود که در تمام احوالی که او را از مرتبه عبودیت (العبودية) خارج می‌ساخت، زاهد بود. و خداوند شهادت داد که او بنده‌ای است که از حیث هویت و اسم جامعش به او اضافه شده است. پس در حق اسمش فرمود: **وَأَنَّهُ لَمَّا قَامَ عَبْدُ اللَّهِ يَدْعُوهُ** (و هنگامی که بنده خدا برخاست تا او را بخواند). و در حق هویتش فرمود: **سُبْحَانَ الَّذِي أَسْرَى بِعَبْدِهِ** (پاک و منزه است آن کس که بنده‌اش را شبانه سیر داد). پس او را در حال بندگی به معراج برد. و هنگامی که مأمور شد مقام خود را در روز قیامت تعریف کند، آن را مقید ساخت و فرمود:\n\n**أنا سيد ولد آدم ولا فخر** (من سرور فرزندان آدم هستم و فخری نیست)\n\nیعنی: با «راء»؛ قصد فخر فروشی بر شما با سیادت را نداشتم، بلکه خواستم شما را آگاه سازم تا مژده‌ای برای شما باشد، زیرا شما مأمور به پیروی از من هستید. و روایت شده است: **ولا فخز** (با «زاء»)؛ یعنی این را از روی تبجح نگفتم و من چنین نیستم، زیرا فخر، تبجح به باطل در صورت حق است.\n\n### [بنده در حال عبودیت (العبودية) با حق (الحق) مانند سایه با شخص در مقابل چراغ است]\n\nپس بنده در حال عبودیت (العبودية) با حق (الحق) مانند سایه با شخص در مقابل چراغ است. هر چه به چراغ نزدیک‌تر شود، سایه بزرگ‌تر می‌شود. و نزدیکی به خدا جز با صفتی که مخصوص توست و نه مخصوص او، حاصل نمی‌شود. و هر چه از چراغ دورتر شود، سایه کوچک‌تر می‌شود. زیرا چیزی تو را از حق (الحق) دور نمی‌کند مگر خروجت از صفتی که سزاوار آنی و طمع ورزیدن به صفت او. **كَذَلِكَ يَطْبَعُ اللَّهُ عَلَى كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ** (این گونه خداوند بر دل هر متکبر جبار مهر می‌نهد). و این دو (متکبر و جبار) دو صفت برای خداوند متعال هستند. و **ذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ** (بچش، همانا تو خود عزیز و کریمی). و این همان\nقول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) است: **أعوذ بك منك** (پناه می‌برم به تو از خودت).\n\n### [ورود بنده بر حق (الحق) با صفت مخصوص خود و استقبال حق (الحق) از او با صفت مخصوص خود]\n\nاین مقام به گونه‌ای است که هیچ صفتی که مخصوص حق (الحق) باشد و او به تنهایی به آن متفرد باشد، برای تو باقی نمی‌ماند و امکان اشتراک در آن از میان نعوت ثبوتیه (صفات وجودی) نیست، نه نعوت سلبیه و اضافیه. مگر اینکه صاحب این مقام به طور خاص آن را بداند. اما ذوق صاحب این مقام عزیز است. زیرا اگر به صفت مخصوص خودت متحقق شوی و منفرد گردی و با آن بر حق (الحق) وارد شوی، او جز با نعت مخصوص خود که تو در آن قدمی نداری، با تو مقابله نمی‌کند. و اگر با نعت مشترک بیایی، با نعت مشترک بر تو تجلی (التجلی) می‌کند. پس راز نسبت آن صفت به خودت را از نسبت آن به او می‌شناسی. و این علمی غریب است که کمتر کسی را می‌یابی که آن را چشیده باشد. با این حال، این مقام پایین‌تر از مقام اول است که مخصوص‌ترینِ توست. پس این را بدان و به این مقام متحقق شو، که این مقام عبودیت (العبودية) را به تو بخشید.\n\n### [ظاهر به حقیقت مظهر رنگ می‌پذیرد، هر چه که باشد]\n\nاما مقام عبوده (العبودة)، نمی‌دانی چه علمی از او برایت حاصل می‌شود. زیرا در آن، نسبت را از خداوند متعال و از کَوْن (هستی) نفی می‌کنی. و این مقامی بسیار عزیز است، زیرا نزد این طایفه (صوفیه) صحیح نیست که کَوْن (هستی) با وجود امکانش بدون نسبت باقی بماند، در حالی که ذاتاً واجب لغیره است. و تنبیه بر این مقام، وصف ظاهر (الظاهر) در مظهر (المظهر) به نعت عبد است. زیرا ظاهر (الظاهر) به حقیقت مظهر (المظهر) رنگ می‌پذیرد، هر چه که باشد. پس ظاهر (الظاهر) به عبودیت (العبودية) منتسب نمی‌شود، زیرا فراتر از آن نزولی نیست. و منتسب باید در مرتبه پایین‌تر از منسوب‌الیه باشد. و ظاهر (الظاهر) جز به خودش منتسب نمی‌شود، زیرا اثری که عین مظهر (المظهر) به آن داده است، غیر از ظاهر (الظاهر) نیست. و فراتر از خدا مقصدی نیست. و شیء به خودش نسبت داده نمی‌شود. به همین دلیل عبوده (العبودة) بدون یای نسبت (یاء النسب) آمده است. گفته می‌شود: «رجل بین العبودية والعبودة» (مردی میان عبودیت و عبوده) یعنی ذاتش ظاهر و نسبتش مجهول است، پس نسبت داده نمی‌شود، زیرا در آنجا «به سوی چه کسی» وجود ندارد. پس او عبد است، نه عبدِ [کسی]."
  },
  "page_count": 3
}