{
  "id": 228,
  "title": {
    "ar": "الباب الثامن والعشرون ومائتان في حال المريد",
    "en": "Chapter Two Hundred and Twenty-Eight: Concerning the Spiritual State (حال) of the Aspirant (المريد).",
    "ur": "باب نمبر دو سو اٹھائیس مرید کے حال کے بیان میں",
    "fa": "باب دویست و بیست و هشتم در حال مرید"
  },
  "content": {
    "ar": "## «الباب الثامن والعشرون ومائتان في حال المريد»\n\n\nفاعلم يا ولي وفقك الله أنه‏\n\n\n> ليس المريد الذي قامت إرادته *** به ولكنه من ينقضي غرضه‏\n\n\n> فإن أراد أمورا ليس يدركها *** فإن حاكمه في صرفه مرضه‏\n\n\n> وليس إذ ذاك من أهل الطريق ولا *** في حكمه جوهر في الكون أو عرضه‏\n\n\n### [أعظم مرتبة المريد إن يكون نافذ الإرادة]\n\n\nلفظة المريد عند المحققين من أهل الله تطلق بإزاء المنقطع إلى الله المؤثر جناب الله الساعي في محاب الله ومراضيه وقد يطلقونها بإزاء المتجرد عن إرادته وأعظم مراتب المريد عندهم وعندنا إن يكون نافذ الإرادة لا عن كشف فإن كان عن كشف فليس بمريد وإنما هو عالم بما يكون كما أنه ليس من شرط المراد أن تكون له إرادة فيما يقع في الوجود به وبغيره أن يكون ما يقع مشهودا له في إرادته فيريده قبل وقوعه بل قد لا يكون ذلك وليس بشرط وإنما حاله إن الأمر إذا وقع في الوجود يرضى به ويلتذ بوقوعه ولا يرده بخاطره ولا يكرهه‏\n\n\n### [إن من أعلمه الله مراده فيما يكون عناية منه فإنه مطلوب بالتأهب‏]\n\n\nفاعلم أنه من أعلمه الله مراده فيما يكون عناية منه فإنه مطلوب بالتأهب لذلك ولا سيما فيما يقع به لا بغيره فيتلقاه بالصفة التي يطلبها ذلك الواقع شرعا من رضي أو صبر أو شكر فإن كان مع هذا الإعلام يكون مريدا لذلك فتلك إرادة موافقة ويكون مريدا لقيام الإرادة به لا لنفوذ إرادته فإنه لا ينبغي في الطريق أن يسمى مريدا إلا من تنفذ إرادته وهو الله أو من أعطاه الله ذلك من خلقه وما سمعنا إنه نال هذا المقام أحد من خلق الله فإنه قد صح عندنا كشفا ونقلا إنه لا مقام أعلى من مقام محمد صلى الله عليه وسلم ومع هذا قد سأل الله في أشياء منها أن لا يجعل الله بأس أمته بينها فلم يقبل سؤاله في ذلك قال صلى الله عليه وسلم فمنعنيها فإذا لم يكمل مقام نفوذ الإرادة له صلى الله عليه وسلم فكيف يناله غيره فإنه ممن انفرد الله به فمن أطلعه الله على مراداته فما أراد إلا ما يقع فيظهر نفوذ إرادته وما يعلم الناس ما هو مشهوده الذي أشهده الحق فهم يتخيلون أن ذلك المراد الواقع من أثر همته وليس‏\nكذلك فالمريد من انقطع إلى الله تعالى عن نظر واستبصار وطلب مرضاة الله وتجرد عن إرادته إذ علم أنه ما يقع في الوجود إلا ما يريده الله لا ما يريده الخلق فيقول هذا المريد فلما ذا أتعني وأريد ما لا أعلم أنه يقع أم لا يقع فإنه لا علم لي بما في علم الله تعالى من ذلك فإن وقع ما أريد فلكونه مراد الله فبما ذا أفرح وإن لم يقع فلا بد من انكسار الخيبة فاستعجل الهم وربما ينجر معه عدم الرضي لعدم وقوع المراد فالأولى إن لا يريد إلا ما يريده الحق كان ما كان على الإجمال فمتى وقع تلقيته بالقبول والرضي فيتجرد عن إرادته فلا يبقى له إرادة الأعلى هذا الحكم وأما الذي يطلعه الله من المريدين على مراد الله في العالم فإن ذلك قد يكون على أحد طريقين الطريق الواحدة بأخبار إلهي وكشف لما يكون والطريق الثانية أن يرزقه الله علم ما تعطيه حقائق الأشياء وترتيبها الإلهي الذي رتبت عليه فيريد عند ذلك أمرا ما فلا تخطئ له إرادة بل يقع مراده على حسب ما تعلق به فهذا مريد بالحق كما كان سميعا بصيرا بالحق إذ كان الحق سمعه وبصره فتكون أيضا إرادته ومهما أخطأت إرادته فليس بمريد على الحقيقة إذ لا فائدة في إن لا يكون مريدا إلا من قامت به الإرادة وإنما الفائدة في إن لا يكون مريدا إلا من تنفذ إرادته فالمريد في هذه الطريقة يحمل المشاق والشدائد والمكاره مشاق وشدائد ومكاره غير ملتذ بها بل يحملها من أجل الله أو أجل ما له فيها أي في حملها من السعادة الأبدية أعلاها وأن يشكر الله فعله فيكون ممن أثنى الله عليه فيتجرع الغصص ويصبر عليها لعلمه بما في طي ذلك من الخير الإلهي وقد يكون بعض رجال الله مريدا من وجه مرادا من وجه فتختلف أحواله فتختلف أحكامه فإذا التذ بالواقع المكروه كان مرادا وإذا تألم بالواقع المحبوب كان مريدا فكيف حاله بالمكروه فهذا حال المريد قد بيناه مفصلا لمن يعقل من أهل الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Twenty-Eight Concerning the State of the Seeker (المريد)\n\nKnow, O friend (ولي), may God grant you success, that:\n\n> The Seeker (المريد) is not he whose aspiration (إرادته) stands by him,\n> But rather he whose purpose is fulfilled.\n> If he wills things he cannot attain,\n> Then his judge in turning away is his sickness.\n> And he is not, in that state, among the People of the Path,\n> Nor does his judgment hold sway over any substance or accident in the cosmos.\n\n### The Highest Level of the Seeker is to possess Effective Will (نفوذ الإرادة)\n\nThe term *al-Murīd* (the Seeker) among the Verifiers (المحققين) of the People of God is applied to the one who is devoted solely to God, preferring the Divine Presence, striving for what God loves and is pleased with. Sometimes they apply it to the one who is stripped bare of his own will (إرادته). The greatest of the levels (المراتب) of the Seeker, according to them and according to us, is that he possesses Effective Will (نافذ الإرادة), but not based on Unveiling (كشف). For if it is based on Unveiling, he is not a Seeker, but rather he is one who knows what will be.\n\nJust as it is not a condition for the Willed One (المراد) to have a will concerning what occurs in Existence (الوجود) through him or through others—that what occurs must be witnessed by him in his will, so that he wills it before its occurrence. Rather, this may not happen, and it is not a condition. Rather, his state is that when the matter occurs in Existence, he is content with it and finds pleasure in its occurrence, and he does not reject it in his mind nor dislike it.\n\n### Indeed, whoever God informs of His Will concerning what shall be, out of Divine Care, is required to prepare himself\n\nKnow that whoever God informs of His Will (مراده) concerning what shall be, out of Divine Care (عناية), is required to prepare himself for that, especially regarding what occurs through him and not through others. He should receive it with the quality that the occurrence demands legally, whether it be contentment (رضي), patience (صبر), or gratitude (شكر). If, along with this notification, he becomes a Seeker of that, then that is a conforming will (إرادة موافقة), and he is a Seeker due to the establishment of the Will within him, not due to the effectiveness (نفوذ) of his own will.\n\nFor it is not proper on the Path (الطريق) that anyone be called a Seeker except he whose will is effective—and that is God, or one of His creatures to whom God has granted that. We have not heard that any creature of God has attained this station (مقام). For it has been verified for us, both through Unveiling (كشفا) and transmission (نقلا), that there is no station higher than the station of Muhammad (peace and blessings be upon him). Yet, despite this, he asked God for certain things, among them that God would not make the affliction of his community be among themselves, but his request in that matter was not accepted. He (peace and blessings be upon him) said: \"So He withheld it from me.\" If the station of Effective Will was not perfected for him (peace and blessings be upon him), how can anyone else attain it? For he is one whom God singled out.\n\nSo, whoever God informs of His Wills (مراداته), he wills nothing but what occurs, and thus the effectiveness of his will appears. People do not know what his witnessed reality (مشهوده) is, which The Real (الحق) has made him witness, so they imagine that the willed occurrence is the result of his spiritual resolve, but this is not the case.\n\nThe Seeker (المريد), therefore, is he who is devoted solely to God, based on contemplation and insight, seeking God's pleasure, and stripping himself of his own will (إرادته), since he knows that nothing occurs in Existence (الوجود) except what God wills, not what creatures will. This Seeker says: \"Why should I trouble myself and will something when I do not know whether it will occur or not? For I have no knowledge of what is contained in God's Knowledge concerning that. If what I will occurs, it is only because it is God's Will (مراد الله), so why should I rejoice? And if it does not occur, the disappointment is inevitable, thus hastening anxiety, and perhaps leading to dissatisfaction due to the non-occurrence of the willed thing.\"\n\nTherefore, the best course is not to will anything except what The Real (الحق) wills, whatever that may be, in general terms. Whenever it occurs, he receives it with acceptance and contentment (القبول والرضي), thus stripping himself of his will, so that no will remains for him except this judgment.\n\nAs for the Seekers whom God informs of God's Will (مراد الله) in the world, this may occur in one of two ways. The first way is through Divine information and Unveiling (كشف) of what shall be. The second way is that God grants him the knowledge of what the realities of things (حقائق الأشياء) yield, and the Divine ordering (ترتيبها الإلهي) upon which they are arranged. When he wills a matter based on this knowledge, his will does not err; rather, what he wills occurs according to what his will was attached to. This person is a Seeker *by* The Real (مريد بالحق), just as he was hearing and seeing *by* The Real, since The Real was his hearing and his sight; thus, his will is also *by* The Real. And whenever his will errs, he is not a Seeker in reality, for there is no benefit in defining the Seeker merely as one in whom the will stands. Rather, the benefit lies in defining the Seeker only as one whose will is effective (تنفذ إرادته).\n\nThe Seeker on this Path (الطريقة) bears hardships, difficulties, and disliked things—hardships, difficulties, and disliked things—without finding pleasure in them. Rather, he bears them for the sake of God, or for the sake of the eternal felicity (السعادة الأبدية) that he gains through bearing them, the highest of which is that God praises his action, making him one of those whom God commends. He swallows the bitter draughts and endures them, due to his knowledge of the Divine Goodness (الخير الإلهي) contained within that concealment.\n\nAnd sometimes some of the Men of God (رجال الله) are Seekers (مريدا) from one perspective and Willed Ones (مرادا) from another, so their states differ, and their rulings differ. If he finds pleasure in a disliked occurrence, he is a Willed One; and if he feels pain from a beloved occurrence, he is a Seeker. So what is his state regarding the disliked thing? This is the state of the Seeker, which we have explained in detail for those among the People of God who possess intellect. And God speaks the Truth (الحق), and He guides to the Way.",
    "ur": "باب نمبر دو سو اٹھائیس: مرید (المريد) کے حال کے بیان میں\n\nپس اے ولی! اللہ تمہیں توفیق دے، جان لو کہ:\n\n> مرید وہ نہیں جس کا ارادہ (الإرادة) اس کے ساتھ قائم ہو *** بلکہ وہ ہے جس کا مقصد پورا ہو جائے\n> اگر وہ ایسی چیزوں کا ارادہ کرے جنہیں وہ نہیں پا سکتا *** تو اس کے ارادے کو پھیرنے والا اس کا مرض ہے\n> اور تب وہ نہ اہل طریق میں سے ہے اور نہ ہی *** اس کے حکم میں کائنات میں کوئی جوہر (جوهر) یا عرض (عرض) ہے\n\n### مرید کا سب سے بڑا مرتبہ یہ ہے کہ وہ نافذ الارادہ ہو\n\nاہل اللہ (أهل الله) میں سے محققین کے نزدیک لفظ مرید (المريد) اس شخص پر بولا جاتا ہے جو اللہ کی طرف یکسو ہو، ذات حق (الحق) کی جناب کو ترجیح دے، اور اللہ کی محبتوں اور رضا کی چیزوں میں کوشش کرے۔ اور کبھی وہ اسے اس شخص پر بھی بولتے ہیں جو اپنے ارادے سے تجرد (التجرد) اختیار کرے۔\n\nمرید کا سب سے بڑا مرتبہ ان کے اور ہمارے نزدیک یہ ہے کہ وہ نافذ الارادہ ہو، لیکن یہ نفاذ کشف (الکشف) کے ذریعے نہ ہو۔ اگر یہ کشف کے ذریعے ہو تو وہ مرید نہیں ہے، بلکہ وہ صرف اس بات کا عالم ہے کہ کیا ہونے والا ہے۔ اسی طرح، مراد (المراد) کے لیے یہ شرط نہیں ہے کہ جو کچھ ہستی (الوجود) میں اس کے ذریعے یا اس کے بغیر واقع ہو، اس کے ارادے میں مشہود (مشهود) ہو، اور وہ اس کے وقوع سے پہلے اس کا ارادہ کرے۔ بلکہ ہو سکتا ہے کہ ایسا نہ ہو اور یہ شرط بھی نہیں ہے۔ اس کا حال یہ ہے کہ جب کوئی امر ہستی (الوجود) میں واقع ہوتا ہے تو وہ اس پر راضی ہوتا ہے اور اس کے وقوع سے لذت محسوس کرتا ہے، اور نہ ہی اپنے دل میں اسے رد کرتا ہے اور نہ ہی اسے ناپسند کرتا ہے۔\n\n### جسے اللہ اپنی عنایت سے اپنے ارادے سے آگاہ کر دے کہ کیا ہونے والا ہے، تو وہ تیاری کرنے کا مکلف ہے\n\nپس جان لو کہ جسے ذات حق (الحق) اپنی عنایت سے اپنے ارادے سے آگاہ کر دے کہ کیا ہونے والا ہے، تو وہ اس کے لیے تیاری کرنے کا مکلف ہے، خاص طور پر ان امور میں جو اس کے ذریعے واقع ہوں نہ کہ کسی اور کے ذریعے۔ چنانچہ وہ اسے اس صفت کے ساتھ قبول کرے جو شرعاً اس واقعے کا تقاضا کرتی ہے، خواہ وہ رضا (الرضي) ہو، صبر ہو یا شکر (الشکر)۔ اگر اس اطلاع کے ساتھ وہ اس کا ارادہ بھی کرے، تو یہ موافق ارادہ ہوگا۔ اور وہ اپنے ساتھ ارادے کے قیام کا ارادہ کرنے والا ہوگا، نہ کہ اپنے ارادے کے نفاذ کا۔\n\nکیونکہ طریق میں مرید (المريد) صرف اسی کو کہا جانا چاہیے جس کا ارادہ نافذ ہو، اور وہ یا تو اللہ ہے یا وہ جسے اللہ نے اپنی مخلوق میں سے یہ مقام عطا کیا ہو۔ اور ہم نے نہیں سنا کہ اللہ کی مخلوق میں سے کسی نے یہ مقام حاصل کیا ہو۔ کیونکہ ہمارے نزدیک کشف (الکشف) اور نقل دونوں سے یہ ثابت ہے کہ مقام محمد صلی اللہ علیہ وسلم سے بلند کوئی مقام نہیں ہے، اس کے باوجود آپ صلی اللہ علیہ وسلم نے اللہ سے کئی چیزوں کے بارے میں سوال کیا، جن میں سے ایک یہ تھی کہ اللہ آپ کی امت کی باہمی لڑائی نہ کرائے، لیکن آپ کا سوال اس بارے میں قبول نہیں ہوا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: \"پس اللہ نے مجھے اس سے منع فرما دیا۔\" تو جب نفاذ ارادہ کا مقام آپ صلی اللہ علیہ وسلم کے لیے بھی مکمل نہیں ہوا، تو کوئی دوسرا اسے کیسے حاصل کر سکتا ہے؟ کیونکہ یہ وہ مقام ہے جس میں اللہ نے خود کو منفرد رکھا ہے۔\n\nپس جسے اللہ اپنے ارادات پر مطلع کرتا ہے، تو اس نے صرف اسی چیز کا ارادہ کیا جو واقع ہونے والی ہے، چنانچہ اس کے ارادے کا نفاذ ظاہر ہوتا ہے۔ اور لوگ نہیں جانتے کہ اس کا مشہود (مشهود) کیا ہے جو ذات حق (الحق) نے اسے دکھایا ہے۔ وہ یہ گمان کرتے ہیں کہ وہ واقع ہونے والا مراد اس کی ہمت (الهمة) کا اثر ہے، حالانکہ ایسا نہیں ہے۔\n\nپس مرید وہ ہے جو غور و فکر اور بصیرت کے ساتھ اللہ کی طرف یکسو ہو جائے، اللہ کی رضا کا طالب ہو، اور اپنے ارادے سے تجرد (التجرد) اختیار کر لے، کیونکہ وہ جانتا ہے کہ ہستی (الوجود) میں صرف وہی واقع ہوتا ہے جو اللہ چاہتا ہے، نہ کہ جو مخلوق چاہتی ہے۔ یہ مرید کہتا ہے: \"میں کیوں مشقت اٹھاؤں اور ایسی چیز کا ارادہ کروں جس کے بارے میں مجھے علم نہیں کہ وہ واقع ہوگی یا نہیں؟ کیونکہ مجھے اللہ کے علم میں موجود اس چیز کا کوئی علم نہیں ہے۔ اگر وہ چیز واقع ہو گئی جس کا میں نے ارادہ کیا تھا، تو وہ اللہ کا مراد ہونے کی وجہ سے واقع ہوئی، تو میں کس بات پر خوش ہوں؟ اور اگر وہ واقع نہ ہوئی، تو مایوسی کی شکست لازمی ہے، جس سے غم جلدی آ جاتا ہے، اور بسا اوقات یہ مراد کے واقع نہ ہونے کی وجہ سے عدم رضا (عدم الرضي) کی طرف لے جاتا ہے۔\"\n\nلہٰذا بہتر یہ ہے کہ وہ صرف اسی چیز کا ارادہ کرے جو ذات حق (الحق) ارادہ کرتی ہے، خواہ وہ اجمالی طور پر کچھ بھی ہو۔ جب بھی وہ واقع ہو، میں اسے قبولیت اور رضا (الرضي) کے ساتھ لوں گا۔ پس وہ اپنے ارادے سے تجرد اختیار کر لیتا ہے، اور اس کے لیے اس حکم کے علاوہ کوئی ارادہ باقی نہیں رہتا۔\n\nاور وہ مریدین (المريدين) جنہیں اللہ عالم میں اپنے ارادے پر مطلع کرتا ہے، یہ دو طریقوں میں سے کسی ایک پر ہو سکتا ہے۔ پہلا طریقہ: الٰہی خبر اور کشف (الکشف) کے ذریعے کہ کیا ہونے والا ہے۔ دوسرا طریقہ: یہ کہ اللہ اسے اشیاء کی حقائق اور ان کی الٰہی ترتیب کا علم عطا کرے جس پر وہ مرتب کی گئی ہیں۔ تب وہ کسی چیز کا ارادہ کرتا ہے اور اس کا ارادہ خطا نہیں کرتا، بلکہ اس کا مراد اسی کے مطابق واقع ہوتا ہے جس سے وہ متعلق ہوا تھا۔\n\nپس یہ ذات حق (الحق) کے ذریعے مرید (المريد) ہے، جیسا کہ وہ ذات حق کے ذریعے سننے والا اور دیکھنے والا تھا، جب ذات حق اس کی سماعت اور بصارت بن گئی تھی۔ چنانچہ اس کا ارادہ بھی ذات حق کا ارادہ ہوتا ہے۔ اور جب بھی اس کا ارادہ خطا کرے، تو وہ حقیقت میں مرید نہیں ہے، کیونکہ اس میں کوئی فائدہ نہیں کہ مرید صرف وہی ہو جس کے ساتھ ارادہ قائم ہو، بلکہ فائدہ اس میں ہے کہ مرید صرف وہی ہو جس کا ارادہ نافذ ہو۔\n\nاس طریق میں مرید (المريد) مشقتیں، سختیاں اور ناپسندیدہ چیزیں اٹھاتا ہے، اور وہ ان سے لذت نہیں لیتا، بلکہ وہ انہیں اللہ کی خاطر یا اس سعادت ابدی کی خاطر اٹھاتا ہے جو اسے ان کو اٹھانے میں حاصل ہوتی ہے، اور اس کا اعلیٰ ترین درجہ یہ ہے کہ اللہ اس کے فعل پر اس کی تعریف کرے، چنانچہ وہ ان لوگوں میں شامل ہو جائے جن کی اللہ نے تعریف کی ہے۔ پس وہ کڑوے گھونٹ پیتا ہے اور ان پر صبر کرتا ہے، کیونکہ وہ جانتا ہے کہ اس کے اندر الٰہی خیر پوشیدہ ہے۔\n\nاور بعض اہل اللہ (أهل الله) ایسے بھی ہوتے ہیں جو ایک پہلو سے مرید (المريد) ہوتے ہیں اور دوسرے پہلو سے مراد (المراد) ہوتے ہیں، چنانچہ ان کے احوال مختلف ہوتے ہیں اور ان کے احکام بھی مختلف ہوتے ہیں۔ پس جب وہ ناپسندیدہ واقعے سے لذت محسوس کرے تو وہ مراد ہوتا ہے، اور جب وہ محبوب واقعے سے تکلیف محسوس کرے تو وہ مرید ہوتا ہے۔ تو ناپسندیدہ واقعے کے ساتھ اس کا کیا حال ہوگا؟\n\nیہ مرید (المريد) کا حال ہے جسے ہم نے اہل اللہ میں سے عقل رکھنے والے کے لیے تفصیل سے بیان کر دیا ہے۔ اور اللہ حق (الحق) فرماتا ہے اور وہی سیدھا راستہ دکھاتا ہے۔ (وَهُوَ يَهْدِي السَّبِيلَ)",
    "fa": "باب دویست و بیست و هشتم در بیان حال مرید (سالک)\n\nای ولیّ، خداوند تو را توفیق دهد، بدان که:\n\n> مرید (المريد) آن نیست که اراده‌اش به او قائم باشد، *** بلکه او کسی است که غرضش به انجام رسد.\n> اگر اموری را اراده کند که به آن‌ها دست نیابد، *** پس حاکم او در بازداشتن از آن، بیماری اوست.\n> و در آن هنگام، او نه از اهل طریق است *** و نه در حکم او جوهر یا عرضی در هستی (الکون) وجود دارد.\n\n### [بالاترین مرتبه مرید (سالک) این است که نافذ الاراده باشد]\n\nواژه مرید (المريد) نزد محققان از اهل الله (اهل حق) در مورد کسی به کار می‌رود که از غیر بریده و به سوی حق (الحق) منقطع شده، جناب الهی را برگزیده و در پی محبوب‌ها و رضایت‌های خداوند است. گاهی نیز این واژه را در مورد کسی به کار می‌برند که از اراده خود تجرد یافته است. بالاترین مراتب مرید (المريد) نزد آنان و نزد ما این است که نافذ الاراده باشد، اما نه از طریق کشف (الکشف). زیرا اگر نفوذ اراده از طریق کشف (الکشف) باشد، او مرید نیست، بلکه صرفاً عالمی است به آنچه واقع می‌شود. همان‌طور که شرط مراد (المراد) این نیست که در آنچه به واسطه او یا غیر او در هستی (الوجود) واقع می‌شود، اراده‌ای داشته باشد که آن واقعه را در اراده‌اش مشاهده کند و پیش از وقوع آن را اراده نماید؛ بلکه ممکن است چنین نباشد و این شرط نیست. حال مراد (المراد) این است که وقتی امری در هستی (الوجود) واقع می‌شود، از آن راضی باشد و از وقوعش لذت ببرد و آن را در خاطر خود رد نکند و از آن کراهت نداشته باشد.\n\n### [کسی که خداوند او را از مراد خود در آنچه واقع می‌شود، از روی عنایت آگاه سازد، مأمور به آمادگی است]\n\nپس بدان، کسی که خداوند او را از مراد خود در آنچه واقع می‌شود، از روی عنایت آگاه سازد، مأمور به آمادگی برای آن است، به ویژه در آنچه به واسطه خود او واقع می‌شود نه به واسطه دیگری. پس باید آن را با صفتی که شرعاً آن واقعه طلب می‌کند، از رضایت یا صبر یا شکر، دریافت کند. اگر با وجود این آگاهی، او مرید (المريد) آن واقعه باشد، این اراده‌ای موافق است. و او مریدِ قیام اراده به خود است، نه مریدِ نفوذ اراده‌اش. زیرا در این طریق شایسته نیست کسی مرید (المريد) نامیده شود مگر کسی که اراده‌اش نافذ باشد، و آن یا خداوند است یا کسی از خلقش که خداوند این مقام را به او عطا کرده باشد. و ما نشنیده‌ایم که احدی از خلق خدا به این مقام رسیده باشد. زیرا نزد ما به طریق کشف (الکشف) و نقل صحیح است که مقامی بالاتر از مقام محمد (صلی الله علیه و سلم) نیست، با این حال، ایشان در مورد اموری از خداوند درخواست کردند، از جمله اینکه خداوند نزاع و درگیری امت او را در میان خودشان قرار ندهد، اما درخواست ایشان در این مورد پذیرفته نشد. پیامبر (صلی الله علیه و سلم) فرمود: «فمنعنيها» (پس خداوند آن را از من بازداشت). پس اگر مقام نفوذ اراده برای ایشان (صلی الله علیه و سلم) کامل نشده، چگونه دیگری می‌تواند به آن دست یابد؟ زیرا این مقامی است که خداوند در آن منفرد است. پس کسی که خداوند او را بر مرادات خود آگاه سازد، جز آنچه واقع می‌شود اراده نکرده است، و نفوذ اراده‌اش آشکار می‌شود. مردم نمی‌دانند که مشهود او چیست که حق (الحق) او را شاهد آن قرار داده است، لذا گمان می‌کنند که آن مراد واقع شده، اثر همت اوست، در حالی که چنین نیست.\n\nپس مرید (المريد) کسی است که با نظر و استبصار به سوی خداوند متعال منقطع شده، رضایت حق (الحق) را می‌طلبد و از اراده خود تجرد یافته است، زیرا می‌داند که در هستی (الوجود) جز آنچه خداوند اراده کند واقع نمی‌شود، نه آنچه خلق اراده می‌کنند. این مرید (المريد) می‌گوید: «چرا خود را به زحمت اندازم و چیزی را اراده کنم که نمی‌دانم واقع می‌شود یا نه؟ زیرا من از آنچه در علم خداوند متعال است، آگاهی ندارم. اگر آنچه اراده می‌کنم واقع شود، به دلیل مراد خداوند بودن آن است، پس به چه چیز شاد باشم؟ و اگر واقع نشود، ناگزیر از شکست و ناامیدی خواهم بود که باعث شتاب در اندوه می‌شود و چه بسا به عدم رضایت از عدم وقوع مراد منجر گردد.» پس سزاوارتر آن است که جز آنچه حق (الحق) اراده می‌کند، اراده نکند، هر چه که باشد، به صورت اجمالی. پس هرگاه واقع شد، آن را با قبول و رضایت دریافت کند. بدین ترتیب از اراده خود تجرد می‌یابد و جز این حکم، اراده‌ای برای او باقی نمی‌ماند.\n\nاما مریدی (المريد) که خداوند او را بر مراد الهی در عالم آگاه می‌سازد، این آگاهی ممکن است از یکی از دو طریق باشد: طریق اول، از طریق اخبار الهی و کشف (الکشف) آنچه واقع می‌شود؛ و طریق دوم، اینکه خداوند به او علم آنچه را که حقائق اشیاء و ترتیب الهی که بر آن مرتب شده‌اند، اقتضا می‌کند، روزی دهد. پس در آن هنگام امری را اراده می‌کند و اراده‌اش خطا نمی‌کند، بلکه مرادش مطابق با آنچه به آن تعلق یافته، واقع می‌شود. پس این شخص مرید (المريد) به واسطه حق (الحق) است، همان‌طور که شنوا و بینا به واسطه حق (الحق) بود، زیرا حق (الحق) گوش و چشم او بود، پس اراده او نیز چنین خواهد بود. و هرگاه اراده‌اش خطا کند، او مرید (المريد) حقیقی نیست، زیرا فایده‌ای در این نیست که مرید (المريد) کسی باشد که اراده به او قائم است، بلکه فایده در این است که مرید (المريد) کسی باشد که اراده‌اش نافذ است.\n\nپس مرید (المريد) در این طریق، سختی‌ها، مشقت‌ها و ناگواری‌ها را تحمل می‌کند؛ سختی‌ها و مشقت‌ها و ناگواری‌هایی که از آن‌ها لذت نمی‌برد، بلکه آن‌ها را به خاطر خداوند یا به خاطر سعادت ابدی که در تحمل آن‌ها برای اوست، که بالاترین آن است، تحمل می‌کند و شکرگزار فعل خداوند است تا از کسانی باشد که خداوند او را ستوده است. پس او غصه‌ها را فرو می‌برد و بر آن‌ها صبر می‌کند، به دلیل علمش به خیر الهی که در پس آن نهفته است. و گاهی برخی از رجال الله (مردان خدا) از یک جهت مرید (المريد) و از جهت دیگر مراد (المراد) هستند، پس احوالشان متفاوت می‌شود و احکامشان نیز فرق می‌کند. پس اگر از واقعه ناخوشایند لذت ببرد، مراد (المراد) است، و اگر از واقعه محبوب متألم شود، مرید (المريد) است. پس حال او در برابر ناخوشایندها چگونه خواهد بود؟ این حال مرید (المريد) است که آن را به تفصیل برای کسی که از اهل الله (اهل حق) است و تعقل می‌کند، بیان کردیم. و خداوند حق (الحق) را می‌گوید و اوست که راه را می‌نمایاند. (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}