{
  "id": 305,
  "title": {
    "ar": "الباب الخامس وثلاثمائة في معرفة منزل ترادف الأحوال على قلوب الرجال من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Five: Concerning the Gnosis of the Station (منزل) of the Simultaneous Succession (ترادف) of the Spiritual States (الأحوال) upon the Hearts of the Men (الرجال), originating from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو پانچ: الحضرة المحمدية (الحضرة المحمدية) سے رجال (الرجال) کے قلوب پر احوال (الأحوال) کے ترادف (ترادف) کے منزل کی معرفت (المعرفۃ) کے بیان میں۔",
    "fa": "باب سیصد و پنجم در معرفت منزل ترادف احوال بر قلوب مردان از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب الخامس وثلاثمائة في معرفة منزل ترادف الأحوال على قلوب الرجال من الحضرة المحمدية»\n\n\n> حقائق الحق بالأسماء والحال *** تقلب الكون من حال إلى حال‏\n\n\n> وليس يدري به إلا القلوب وما *** للعقل فيه مجال دون إملال‏\n\n\n> يخالف العقل تقليب الوجود فما *** للعقل شي‏ء سوى قيد وأغلال‏\n\n\n> فالعقل يشهد ذاتا لا انتقال لها *** عنها وقلبك في تقليب أحوال‏\n\n\n> إن المظاهر تقليب الإله لنا *** في نفسه وهو عندي عين إضلال‏\n\n\n### [علم القوة وهو الرمي بالقوس‏]\n\n\nاعلم وفقك الله أن هذا المنزل يحوي على علوم كثيرة منها علم القوة وهو الرمي بالقوس والدخول فيه وعقد الأصابع على‏\nالوتر والسهم وكيفية الإطلاق وسداد السهم والمناضلة فإن الله تعالى ما اعتنى بشي‏ء من آلة الحرب ما اعتنى بعلم الرمي بالقوس وأقامه في هذا المنزل مرتب المنازل بالاسم القوي وأمرنا في القرآن بالاستعداد به فقال وأَعِدُّوا لَهُمْ ما اسْتَطَعْتُمْ من قُوَّةٍ\n\n\nفقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ألا إن القوة الرمي ألا إن القوة الرمي ألا إن القوة الرمي‏\n\n\nوجعله في هذا المنزل على أربع مراتب وأشهدها أصحاب الأذواق لهذه المنازل لحكمة علمها أهلها ليعلم الإنسان كيف يصيب الفعل ويؤثر من غير مباشرة من الاسم البعيد عن هذا الوصف ومن هذا العلم ينكشف لك سر القدر وكيف تحكم في الخلائق ولما ذا يرجع أصله ولا دليل عليه إلا الرمي بالقوس وهو روح كن للإيجاد وروح المشيئة للاعدام ويحوي هذا المنزل على علم الأرواح المدبرة للأجسام العلوية والسفلية وما حكمها في الأجسام النورية وأن حكمها فيها تشكلها في الصور خاصة كما إن حكمها في الأجسام الحيوانية الإنسانية التشكل في القوة الخيالية مع غير هذا من الأحكام فإن الأجسام النورية لا خيال لها بل هي عين الخيال والصور تقلباتها عن أرواحها المدبرة لها وهو علم شريف وكما لا يخلو خيال الإنسان عن صورة كذلك ذات الملك لا تخلو عن صورة وهو علم شريف يحوي على أسرار كثيرة وبيد هذه الأرواح تعيين الأمور التي يريدها الحق بهذه الأجسام كلها فالإنسان عالم بجميع الأمور الحقية فيه من حيث روحه المدبر وهو لا يعلم أنه يعلم فهو بمنزلة الساهي والناسي والأحوال تذكره والمقامات والمنازل وقد قالها الحكيم في التقسيم الرباعي وهو الرجل الذي يدري ولا يدري أنه يدري فذلك الناسي فذكروه وفي هذا المنزل علم الصيحتين اللتين بالواحدة منهما يصعق العالم أصحاب السماع وبالأخرى يفيقون فيفزعون إلى ربهم تسمى نفخة البعث ونفخة الفزع وفيه علم القلوب وسرعة تقليبها وفيه علم البصيرة والبصر وما يتجلى لكل واحد منهما وفيه علم الإعادة وكيفيته وما ذا يرد منه وما لا يرد وفيه علم الدور والكور وهل يكون ذلك في الصور أو في الأعيان الحاملة للصور وفيه علم اختصاص القيومية بالتبديل وفيه علم الكلام الإلهي المسموع بالأذن لا المسموع بالقلب في المواد الثواني وفيه علم الكبرياء الموجود في الثقلين خاصة ولما اختص بهما دون سائر الموجودات وما الحقيقة التي أعطتهما ذلك وهل هو في الجن كما هو في الإنس أو يختلف السبب فيكون سببه في الإنسان وجوده على الصورة الكاملة ويكون في الجن كونه من نار وعلى من تكبر الإنسان وعلى من تكبر الجان وفيه علم ما يزول به هذا الكبرياء من العالمين وفيه علم الإعجاز وتفاضل الأمر المعجز وما يبقى منه وما لا يبقى وهل له حد ينتهي إليه أم لا ولما ذا يرجع هل إلى الصرف أم لغير الصرف فإن كان إلى الصرف فهل إذا انقضى زمان الدعوى في عين ذلك الفعل وانفصل المجلس هل يقدر المنازع على الإتيان بذلك وإذا أتى هل يقدح في الدعوى الأولى من المتحدي أم لا يقدح وفيه ما السبب المانع من الرجوع إلى الحق بعد العلم به وهل ذلك علم أو ليس بعلم وفيه علم ما يفر إليه الفار مما يهوله وإلى أين يفر مع علمه بأن الذي يفر إليه منه يفر فما ذا يحركه ويدعوه إلى الفرار مع هذا العلم وفيه علم الاعتبار ومن أهله ولما ذا وضعه الله في العالم وأمر به وما المطلوب منه وفيه علم الخلق ولما ذا خلق هل من أجل الإنسان أو من أجل الحيوان أو من أجلهما وفيه علم الآخرة وما فيها في الموقف وعلم الجنة والنار وعلم الصفات التي تطلب كل واحدة منهما وفيه إباحة التشريع للإنسان بالأمر والنهي في نفسه لا في غيره وإنه إن خالف ما تأمر به نفسه أو تنهى عوقب أو غفر له مثل ما هو حكم الشارع ومن أي حضرة صح له ذلك وهل لها ذوق في النبوة أو هي نبوة خاصة لا نبوة الأنبياء المحجورة وفيه علم منتهى القيامة وفيه علم طي الزمان فهذا جميع ما يتضمنه هذا المنزل من أجناس العلوم وتحت كل جنس من العلوم وأنواعها على حسب ما تعطيها تقاسيم كل جنس ونوع منها فلنذكر منها مسألة واحدة أو ما تيسر كما عملنا في كل منزل والله المؤبد والعاصم لا رب غيره فمن الأحوال التي يتضمنها هذا المنزل حال الإنسان قبل أخذ الميثاق عليه وهو الحال الذي كان فيها صَلَّى اللهُ عَليهِ وسَلَّم حين عرف بنبوته قبل خلق آدم عليه السلام وقد ورد ذلك في الخبر عنه صَلَّى اللهُ عَليهِ وسَلَّم فقال كنت نبيا وآدم بين الماء والطين‏\n\n\nفكان له التعريف في تلك الحالة وذلك أن هذه النشأة الإنسانية كانت مبثوثة في العناصر ومراتبها إلى حين موتها التي يكون عليها في وجود أعيان أجسامها معلومة معينة في الأمر المودع في السموات لكل حالة من أحواله التي تتقلب فيها في الدنيا صورة في الفلك على تلك الحالة قد\nأخذ الله بأبصار الملائكة عن شهودها مكتنفة عند الله في غيبة معينة له سبحانه لا تعلم السموات بها مع كونها فيها وقد جعل الله وجود عينها في عالم الدنيا في حركات تلك الأفلاك فمن الناس من أعطى في ذلك الموطن شهود نفسه ومرتبته إما على غاياتها بكمالها وإما يشهد صورة ما من صورة وهو عين تلك المرتبة له في الحياة الدنيا فيعلمها فيحكم على نفسه بها وهنا شاهد رسول الله صَلَّى اللهُ عَليهِ وسَلَّم نبوته ولا ندري هل شهد صورة جميع أحواله أم لا فالله أعلم قال تعالى وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها وهذا من أمرها وشأنها حفظ هذه الصورة إلى وصول وقتها فتعطيها مراتبها في الحياة الدنيا تلك الصورة الفلكية من غير أن تفقد منها ذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ وهذه الصور كلها موجودة في الأفلاك التسعة وجود الصورة الواحدة في المرايا الكثيرة المختلفة الأشكال من طول وعرض واستقامة وتعويج واستدارة وتربيع وتثليث وصغر وكبر فتختلف صور الأشكال باختلاف المجلى والعين واحدة فتلك صور المراتب حكمت على تلك العين كما حكمت أشكال المرايا على الصورة فالعارف من عرف ذاته لذاته من غير مجلى وإن كان بهذه المثابة لم تؤثر فيه المراتب إذا نالها كما\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم وهو في المرتبة العليا أنا سيد ولد آدم ولا فخر\n\n\nفلم تحكم فيه المرتبة وقال في كل وقت وهو في مرتبة الرسالة والخلافة إِنَّما أَنَا بَشَرٌ مِثْلُكُمْ فلم تحجبه المرتبة عن معرفة نشأته وسبب ذلك أنه رأى لطيفته ناظرة إلى مركبها العنصري وهو متبدد فيها فشاهد ذاته العنصرية فعلم أنها تحت قوة الأفلاك العلوية ورأى المشاركة بينها وبين سائر الخلق الإنساني والحيوان والنبات والمعادن فلم ير لنفسه من حيث نشأته العنصرية فضلا على كل من تولد منها وأنه مثل لهم وهم أمثال له فقال إِنَّما أَنَا بَشَرٌ مِثْلُكُمْ ثم رأى افتقاره إلى ما تقوم به نشأته من الغذاء الطبيعي كسائر المخلوقات الطبيعية فعرف نفسه‏\n\n\nفقال يا أبا بكر ما أخرجك قال الجوع قال وأنا أخرجني الجوع فكشف عن حجرين قد وضعهما على بطنه يشد بهما أمعاءه وكان يتعوذ من الجوع ويقول إنه بئس الضجيع‏\n\n\nص فقد عرفت أن‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم كنت نبيا وآدم بين الماء والطين‏\n\n\nإنما كان هذا القول بلسان تلك الصورة التي فيها من جملة صور المراتب فترجم لنا في هذه الدار عن تلك الصورة فهذا من أحوال الخلق ولنا صور أيضا فوق هذا لم نذكرها لأنه ليس لنا استرواح من قول شارع ولا من دليل عقلي نركن إليه في تعريفنا إياك بها فسكتنا عنها وإلا فلنا صورة في الكرسي وصورة في العرش وصورة في الهيولى وصورة في الطبيعة وصورة في النفس وصورة في العقل وهو المعبر عنهما باللوح والقلم وصورة في العماء وصورة في العدم وكل ذلك معلوم مرئي مبصر لله تعالى وهو الذي يتوجه عليه خطاب الله إذا أراد إيجاد مجموعنا في الدنيا بكن فنبادر ونجيب إلى الخروج من حضرة العدم إلى حضرة الوجود فينصبغ بالوجود وهو قوله تعالى صِبْغَةَ الله ومن أَحْسَنُ من الله صِبْغَةً ونَحْنُ لَهُ عابِدُونَ أي أذلاء خاضعون ونحن في كل ما ذكرنا لنا حال نتميز به في ذلك المقام وحالنا هو عين صورتنا فيه فما أوسع ملك الله وما أعظمه وكل ما ذكرناه في جنب الله كلا شي‏ء ومن الأحوال أيضا التي ترد على قلوبنا حال كوننا في الميثاق الذي أخذه ربنا علينا قال تعالى وإِذْ أَخَذَ رَبُّكَ من بَنِي آدَمَ من ظُهُورِهِمْ ذُرِّيَّتَهُمْ وأَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ أَ لَسْتُ بِرَبِّكُمْ قالُوا بَلى‏ أنت ربنا فلولاك ما كان لنا وجود في صورة آدم العنصرية معينين مرئيين متميزين عند الله في علمه ورؤيته وعندنا ما قلنا بلى أنت ربنا فأخلصنا له التوجه وكيف لا نخلص ونحن في قبضته مشاهدة عين محصورين والله بِكُلِّ شَيْ‏ءٍ مُحِيطٌ\n\n\n### [إن الله لما أوجد آدم عليه السلام جعل في صورته صورا مثل ما فعل فيما تقدم من المخلوقات‏]\n\n\nفاعلم إن آدم عليه السلام لما أوجده الله وسواه كما سوى الأفلاك وجميع الحضرات التي ذكرنا جعل لنا في صورته صورا مثل ما فعل فيما تقدم من المخلوقات ثم قبض على تلك الصور المعينة في ظهر آدم وآدم لا يعرف ما يحوي عليه كما أنه كل صورة لنا في كل فلك ومقام لا يعرف بها ذلك الفلك ولا ذلك المقام وإنه للحق في كل صورة لنا وجه خاص إليه من ذلك الوجه يخاطبنا ومن ذلك الوجه نرد عليه ومن ذلك الوجه نقر بربوبيته فلو أخذنا من بين يدي آدم لعلمنا فكان الأخذ من ظهره إذ كان ظهره غيبا له وأخذه أيضا معنا في هذا الميثاق من ظهره فإن له معنا صورة في صورته فشهد كما شهدنا ولا يعلم أنه أخذ منه أو ربما علم فإنه ما نحن على يقين من أنه لم يعلم بأنه أخذ منه ولا بأنا أخذنا منه ولكن لما رأينا أن الحضرات التي تقدمته لا تعلم بصورنا فيها قلنا ربما يكون الأمر هنا كذلك فرحم الله عبدا وقف على علم ذلك أنه علم آدم أو لم يعلم‏\nفيلحق ذلك في هذا الموضع من هذا الكتاب فإن بعد عن فهمك ما ذكرناه من تعداد الصور\n\n\nفقد ورد في الخبر المشهور الحسن الغريب أن الله تجلى لآدم عليه السلام ويداه مقبوضتان فقال له يا آدم اختر أيتهما شئت فقال اخترت يمين ربي وكلتا يدي ربي يمين مباركة قال فبسطها فإذا آدم وذريته فنظر إلى شخص من أضوئهم أو أضوئهم فقال من هذا يا رب فقال الله له هذا ابنك داود فقال يا رب كم كتبت له فقال أربعين سنة فقال يا رب وكم كتبت لي فقال الله ألف سنة فقال يا رب فقد أعطيته من عمري ستين سنة قال الله له أنت وذاك فما زال يعد لنفسه حتى بلغ تسعمائة وأربعين سنة فجاءه ملك الموت ليقبض روحه فقال له آدم إنه بقي لي ستون سنة فأوحى الله إلى آدم أي يا آدم إنك وهبتها لابنك داود فجحد آدم فجحدت ذريته ونسي آدم فنسيت ذريته قال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فمن ذلك اليوم أمر بالكتاب والشهود\n\n\nفهذا آدم وذريته صور قائمة في يمين الحق وهذا آدم خارج عن تلك اليد وهو يبصر صورته وصور ذريته في يد الحق فما لك تقربه في هذا الموضع وتنكره علينا فلو كان هذا محالا لنفسه لم يكن واقعا ولا جائزا بالنسبة إذ الحقائق لا تتبدل فاعلم ذلك وأكثر من هذا التأنيس ما أقدر لك عليه فلا تكن ممن قال الله فيهم صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لا يَرْجِعُونَ صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لا يَعْقِلُونَ وأخذ الله الصور من ظهر آدم وآدم فيهم وأَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ بمحضر من الملإ الأعلى والصور التي لهم في كل مجلى أَ لَسْتُ بِرَبِّكُمْ قالُوا بَلى‏ فشهد على نطقهم من حضر ممن ذكرنا بالإقرار بربوبيته عليهم وعبوديتهم له فلو كان له شريك فيهم لما أقروا بالملك له مطلقا فإن ذلك موضع حق من أجل الشهادة فنفس إطلاقهم بالملك له بأنه ربهم هو عين نفي الشريك وإنما قلنا ذلك لأنه لم يجر للتوحيد هنا لفظ أصلا ولكن المعنى يعطيه ولما كان الموت سببا لتفريق المجموع وفصل الاتصالات وشتات الشمل سمي التفريق الذي هو بهذه المثابة موتا فقال تعالى كَيْفَ تَكْفُرُونَ بِاللَّهِ وكُنْتُمْ أَمْواتاً فَأَحْياكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ أي كنتم متفرقين في كل جزء من عالم الطبيعة فجمعكم وأحياكم ثم يميتكم أي يردكم متفرقين أرواحكم مفارقة لصور أجسامكم ثم يحييكم الحياة الدنيا ثُمَّ إِلَيْهِ تُرْجَعُونَ بعد مفارقة الدنيا وإن الله سيذكر عباده يوم القيامة بما شهدوا به على أنفسهم في أخذ الميثاق فيقولون رَبَّنا أَمَتَّنَا اثْنَتَيْنِ وأَحْيَيْتَنَا اثْنَتَيْنِ فَاعْتَرَفْنا بِذُنُوبِنا فَهَلْ إِلى‏ خُرُوجٍ من سَبِيلٍ أي كما قبلنا حياة بعد موت وموتا بعد حياة مرتين فليس بمحال أن نقبل ذلك مرارا فطلبوا من الله أن يمن عليهم بالرجوع إلى الدنيا ليعملوا ما يورثهم دار النعيم وحين قالوا هذا لم يكن الأمد المقدر لعذابهم قد انقضى ولما قدر الله أن يكونوا أهلا للنار وأنه ليس لهم في علم الله دار يعمرونها سوى النار قال تعالى ولَوْ رُدُّوا لَعادُوا لِما نُهُوا عَنْهُ حتى يدخلوا النار باستحقاق المخالفة إلى أن يظهر سبق الرحمة الغضب فيمكثون في النار مخلدين لا يخرجون منها أبدا على الحالة التي قد شاءها الله أن يقيمهم عليها وفيها يرد الله الذرية إلى أصلاب الآباء إلى أن يخرجهم الله إلى الحياة الدنيا على تلك الفطرة فكانت الأصلاب قبورهم إلى يوم يبعثون من بطون أمهاتهم ومن ضلع آبائهم في الحياة الدنيا ثم يموت منهم من شاء الله أن يموت ثم يبعث يوم القيامة كما وعد واختلف أصحابنا في الإعادة هل تكون على صورة ما أوجدنا في الدنيا من التناسل شخصا عن شخص كما قال كَما بَدَأَكُمْ تَعُودُونَ بجماع وحمل وولادة في آن واحد للجميع وهو مذهب أبي القاسم بن قسي أو يعودون روحا إلى جسم وهو مذهب الجماعة والله أعلم‏\n\n\n### [أحوال الفطرة التي فطر الله الخلق عليها]\n\n\nواعلم أن من الأحوال التي هي أمهات في هذا الباب فإن تفاصيل الأحوال لا تحصى كثرة ولكن نذكر منها الأحوال التي تجري مجرى الأمهات فمنها أحوال الفطرة التي فطر الله الخلق عليها وهو أن لا يعبدوا إلا الله فبقوا على تلك الفطرة في توحيد الله فما جعلوا مع الله مسمى آخر هو الله بل جعلوا آلهة على طريق القربة إلى الله ولهذا قال قُلْ سَمُّوهُمْ فإنهم إذا سموهم بان أنهم ما عبدوا إلا الله فما عبد كل عابد إلا الله في المحل الذي نسب الألوهية له فصح بقاء التوحيد لله الذي أقروا به في الميثاق وأن الفطرة مستصحبة والسبب في نسبة الألوهية لهذه الصور المعبودة هو أن الحق لما تجلى لهم في أخذ الميثاق تجلى لهم في مظهر من المظاهر الإلهية فذلك الذي أجرأهم على أن يعبدوه في الصور ومن قوة بقائهم على الفطرة إنهم ما عبدوه على الحقيقة في الصور وإنما عبدوا الصور لما تخيلوا فيها من رتبة التقريب كالشفعاء وهاتان الحقيقتان إليهما مال الخلق في الدار الآخرة\nوهما الشفاعة والتجلي في الصور على طريق التحول فإذا تمكنت هذه الحالة في قلب الرجل وعرف من العلم الإلهي ما الذي دعا هؤلاء الذين صفتهم هذا وأنهم تحت قهر ما إليه يؤولون تضرعوا إلى الله في الدياجي وتملقوا له في حقهم وسألوه أن يدخلهم في رحمته إذا أخذت منهم النقمة حدها وإن كانوا عمار تلك الدار فليجعل لهم فيها نعيما به إذ كانوا من جملة الأشياء التي وسعتهم الرحمة العامة وحاشا الجناب الإلهي من التقييد وهو القائل بأن رحمته سبقت غضبه فلحق الغضب بالعدم وإن كان شيئا فهو تحت إحاطة الرحمة الإلهية الواسعة وقد قال صَلَّى اللهُ عَليهِ وسَلَّم إن الأنبياء صَلَّى اللهُ عَليهِ وسَلَّم تقول يوم القيامة إذا سألوا في الشفاعة إن الله قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله‏\n\n\nوهذا من أرجى حديث يعتمد عليه في هذا الباب أيضا\n\n\n### [يوم القيامة هو يوم قيام الناس من قبورهم لرب العالمين‏]\n\n\nفإن اليوم الذي أشار إليه الأنبياء هو يوم القيامة ويوم القيامة هو يوم قيام الناس من قبورهم لرب العالمين قال تعالى يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعالَمِينَ وفي ذلك اليوم يكون الغضب من الله على أهل الغضب وأعطى حكم ذلك الغضب الأمر بدخول النار وحلول العذاب والانتقام من المشركين وغيرهم من القوم الذين يخرجون بالشفاعة والذين يخرجهم الرحمن كما\n\n\nورد في الصحيح ويدخلهم الجنة إذ لم يكونوا من أهل النار الذين هم أهلها ولم يبق في النار إلا أهلها الذين هم أهلها\n\n\nفعم الأمر بدخول النار كل من دخلها من أهلها ومن غير أهلها لذلك الغضب الإلهي الذي لن يغضب بعده مثله فلو سرمد عليهم العذاب لكان ذلك عن غضب أعظم من غضب الأمر بدخولها وقد قالت الأنبياء إن الله لا يغضب بعد ذلك مثل ذلك الغضب ولم يكن حكمه مع عظم ذلك الغضب إلا الأمر بدخول النار فلا بد من حكم الرحمة على الجميع ويكفي من الشارع التعريف بقوله وأما أهل النار الذين هم أهلها ولم يقل أهل العذاب ولا يلزم من كان من أهل النار الذين يعمرونها أن يكونوا معذبين بها فإن أهلها وعمارها مالك وخزنتها وهم ملائكة وما فيها من الحشرات والحيات وغير ذلك من الحيوانات التي تبعث يوم القيامة ولا واحد منهم تكون النار عليه عذابا كذلك من يبقى فيها لا يموتون فيها ولا يحيون وكل من ألف موطنه كان به مسرورا وأشد العذاب مفارقة الوطن فلو فارق النار أهلها لتعذبوا باغترابهم عما أهلوا له وإن الله قد خلقهم على نشأة تألف ذلك الموطن فعمرت الداران وسبقت الرحمة الغضب ووسعت كل شي‏ء جهنم ومن فيها والله أرحم الراحمين كما قال عن نفسه وقد وجدنا في نفوسنا ممن جبلهم الله على الرحمة أنهم يرحمون جميع عباد الله حتى لو حكمهم الله في خلقه لأزالوا صفة العذاب من العالم بما تمكن حكم الرحمة من قلوبهم وصاحب هذه الصفة أنا وأمثالي ونحن مخلوقون أصحاب أهواء وأغراض وقد قال عن نفسه جل علاه أنه أرحم الراحمين فلا نشك أنه أرحم منا بخلقه ونحن قد عرفنا من نفوسنا هذه المبالغة في الرحمة فكيف يتسرمد عليهم العذاب وهو بهذه الصفة العامة من الرحمة إن الله أكرم من ذلك ولا سيما وقد قام الدليل العقلي على إن الباري لا تنفعه الطاعات ولا تضره المخالفات وأن كل شي‏ء جار بقضائه وقدره وحكمه وأن الخلق مجبورون في اختيارهم وقد قام الدليل السمعي إن الله يقول في الصحيح يا عبادي فأضافهم إلى نفسه وما أضاف الله قط العباد لنفسه إلا من سبقت له الرحمة أن لا يؤيد عليهم الشقاء وإن دخلوا النار\n\n\nفقال يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم اجتمعوا على أتقى قلب رجل واحد منكم ما زاد ذلك في ملكي شيئا\n\n\nفقد أخبر بما دل عليه العقل أن الطاعات والمعاصي ملكه وأنه على ما هو عليه لا يتغير ولا يزيد ولا ينقص ملكه مما طرأ عليه وفيه فإن الكل ملكه وملكه‏\n\n\nثم قال من تمام هذا الخبر الصحيح يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم قاموا في صعيد واحد وسألوني فأعطيت كل واحد منكم مسألته ما نقص ذلك من ملكي شيئا\n\n\nالحديث ولا شك أنه ما من أحد إلا وهو يكره ما يؤلمه طبعا فما من أحد إلا وقد سأله أن لا يؤلمه وأن يعطيه اللذة في الأشياء ولا يقدح ما أومأنا إليه فيه قوله في الحديث إذا تعلق به المنازع في هذه المسألة إدخال لو في ذلك فإن السؤال من العالم في ذلك قد علم وقوعه بالضرورة من كل مخلوق فإن الطبع يقتضيه والسؤال قد يكون قولا وحالا كبكاء الصغير الرضيع وإن لم يعقل عند وجود الألم الحسي بالوجع أو الألم النفسي بمخالفة الغرض إذا منع من الثدي وقد أخذت المسألة حقها والأحوال التي ترد على قلوب الرجال لا تحصى كثرة وقد\nأعطيناك منها في هذا الباب أنموذجا وعلى هذا الأسلوب تكون الأحوال المنسوبة إلى الرجال وأما الأحوال في نفوسها فلها الحكم العام في كل شي‏ء ولها الوجود الدائم في كل شي‏ء ففعل الحال يسمى الدائم ويتعلق بالقديم والمحدث قال تعالى سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ فهذا من الحال إن كنت تعلم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى السفر العشرون من الفتوحات المكية\n\n",
    "en": "Chapter Three Hundred and Five: On the Knowledge of the Station of the Succession of Spiritual States upon the Hearts of Men, derived from the Muhammadan Presence (الحضرة المحمدية)\n\nThe Realities of the Real (حقائق الحق), through the Names and the State, / Turn the Cosmos from state to state.\nNone knows this save the hearts (القلوب), and the intellect (العقل) has no scope therein without weariness.\nThe turning of Existence (الوجود) contradicts the intellect, so the intellect has nothing but fetters and chains.\nThe intellect witnesses an Essence (الذات) from which there is no movement away, / While your heart is in the turning of states.\nIndeed, the manifestations (المظاهر) are the turning of the Deity for us / in Himself, and this, to me, is the very essence of misguidance (إضلال).\n\n### [The Science of Strength, which is Archery]\n\nKnow, may Allah grant you success, that this station (منزل) contains many sciences (علوم), among them the Science of Strength, which is archery (الرمي بالقوس), including entering into it, gripping the string and the arrow with the fingers, the manner of release, the straightness of the arrow, and competitive shooting (المناضلة). For Allah the Exalted has not given attention to any instrument of war as He has given attention to the science of archery, establishing it in this station (منزل), which orders the stations by the Name, The Strong (القوي). He commanded us in the Quran to prepare for it, saying: <<وَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ>> (And prepare against them whatever you are able of strength).\n\nThe Messenger of Allah, peace and blessings be upon him, said: \"Behold, strength is archery! Behold, strength is archery! Behold, strength is archery!\"\n\nHe placed it in this station (منزل) upon four levels (مراتب) and made the people of spiritual experience (أصحاب الأذواق) witness them for these stations, due to a wisdom known to their people. This is so that man may know how the act hits and takes effect without direct involvement from the Name that is distant from this description. From this science, the secret of Destiny (سر القدر) is unveiled to you, and how you rule over the creatures (الخلائق), and why its origin returns, having no proof except archery. It is the spirit of 'Be!' (روح كن) for origination and the spirit of the Will (روح المشيئة) for annihilation. This station (منزل) contains the science of the spirits (الأرواح) that govern the celestial and terrestrial bodies, and their ruling in the luminous bodies (الأجسام النورية). Their ruling therein is their formation into specific images (صور), just as their ruling in the human animal bodies is their formation in the imaginative faculty (القوة الخيالية), along with other rulings. Luminous bodies (الأجسام النورية) have no imagination (خيال); rather, they are the very essence of imagination (عين الخيال), and their images (الصور) are their transformations arising from the spirits governing them. This is a noble science. Just as the imagination of man is never devoid of an image, so too the Essence (ذات) of the angel is never devoid of an image. This is a noble science containing many secrets. In the hands of these spirits lies the determination of the matters that the Real (الحق) wills for all these bodies. Thus, man is knowledgeable of all the matters of the Real (الحق) within him by virtue of his governing spirit, yet he does not know that he knows. He is therefore in the position of one who is heedless or forgetful, and the spiritual states (الأحوال), the stations (المقامات), and the stages (المنازل) remind him. The Sage mentioned this in the quaternary division: \"He is the man who knows but does not know that he knows; that is the forgetful one, so remind him.\"\n\nThis station (منزل) contains the science of the two cries (الصيحتين): the one by which the world's people of hearing (أصحاب السماع) are struck unconscious, and the other by which they awaken and hasten to their Lord—called the Blast of Resurrection (نفخة البعث) and the Blast of Terror (نفخة الفزع). It contains the science of hearts (القلوب) and the swiftness of their turning. It contains the science of insight (البصيرة) and sight (البصر), and what is disclosed (يتجلى) to each of them. It contains the science of Re-creation (الإعادة) and its manner, and what returns from it and what does not. It contains the science of the Cycle (الدور) and the Revolution (الكور), and whether this occurs in the images (الصور) or in the essences (الأعيان) that bear the images. It contains the science of the Self-Subsistence (القيومية) being specialized in transformation. It contains the science of Divine Speech (الكلام الإلهي) heard by the ear, not that heard by the heart in secondary substances. It contains the science of Grandeur (الكبرياء) existing specifically in the two weighty ones (mankind and jinn), and why it is specialized to them rather than the rest of existing things, and what the Reality (الحقيقة) is that granted them that. Is it in the jinn as it is in mankind, or does the cause differ? Is its cause in man his existence upon the Perfect Form (الصورة الكاملة), and in the jinn his being created from fire? And upon whom does man show pride, and upon whom does the jinn show pride? It contains the science of what removes this Grandeur (الكبرياء) from the two worlds. It contains the science of Inimitability (الإعجاز) and the gradation of the miraculous matter, what remains of it and what does not. Does it have a limit to which it ends or not? And why does it return? Is it due to the sheer impossibility (الصرف) or for something other than the sheer impossibility? If it is due to the sheer impossibility, then if the time of the claim has passed regarding the very act, and the assembly has dispersed, can the challenger produce it? And if he produces it, does it invalidate the first claim of the challenger or not? It contains the reason preventing return to the Real (الحق) after knowing Him. Is that knowledge or not knowledge? It contains the science of what the fleeing one flees to from what terrifies him, and where he flees, knowing that what he flees to is fleeing from him. What, then, moves him and calls him to flee despite this knowledge? It contains the science of contemplation (الاعتبار), who its people are, why Allah placed it in the world and commanded it, and what is sought from it. It contains the science of creation (الخلق), and why it was created: is it for the sake of man, or for the sake of the animal, or for the sake of both? It contains the science of the Hereafter (الآخرة) and what is in it at the Standing (الموقف), the science of Paradise and the Fire, and the science of the attributes sought by each of them. It contains the permissibility of legislation (التشريع) for man through command and prohibition *in himself*, not in others. If he violates what his soul commands or prohibits, he is punished or forgiven, just as is the ruling of the Lawgiver. From which Presence (حضرة) is this validated for him? Does it have a taste (ذوق) of prophecy, or is it a special prophecy, not the restricted prophecy of the Prophets? It contains the science of the ultimate end of the Resurrection (القيامة). It contains the science of the folding of time (طي الزمان).\n\nThis is the totality of what this station (منزل) encompasses in terms of categories of sciences (أجناس العلوم). Under every category of science and its types are subdivisions according to what the divisions of each category and type grant. We shall mention one issue from them, or whatever is facilitated, as we have done in every station. Allah is the Sustainer and the Protector; there is no Lord but Him.\n\nAmong the states (الأحوال) contained in this station (منزل) is the state of man before the covenant (الميثاق) was taken from him. This is the state in which the Prophet, peace and blessings be upon him, was when his prophethood was known before the creation of Adam, peace be upon him. This is mentioned in the report from him, peace and blessings be upon him, where he said: \"I was a Prophet while Adam was between water and clay.\"\n\nThe definition (التعريف) was for him in that state. This is because this human constitution (النشأة الإنسانية) was diffused throughout the elements (العناصر) and their levels (مراتب) until the time of their death. The state upon which they would exist in the existence of their bodily essences (أعيان أجسامها) was known and determined in the matter deposited in the heavens for every state of his states through which he turns in the world. There is an image (صورة) in the celestial sphere (الفلك) corresponding to that state. Allah veiled the eyes of the angels from witnessing it, being encompassed by Allah in a specific hiddenness (غيبة معينة) for Him, the Glorified, which the heavens do not know, despite its being within them. Allah made the existence of its essence (عينها) in the world of this life (عالم الدنيا) occur through the movements of those celestial spheres (الأفلاك). Some people were granted in that station (موطن) the witnessing (شهود) of their own self and their level (مرتبة), either in its complete perfection or by witnessing some image (صورة) of the image, which is the very essence of that level for him in the life of this world. Thus, he knows it and judges himself by it. Here, the Messenger of Allah, peace and blessings be upon him, witnessed his prophethood. We do not know whether he witnessed the image of all his states or not; Allah knows best. The Exalted said: <<وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (And He revealed in every heaven its command). This is part of its command and its affair: preserving this image until its time arrives, so that its levels (مراتبها) in the life of this world grant it that celestial image (الصورة الفلكية) without losing anything from it. <<ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ>> (That is the determination of the Almighty, the All-Knowing).\n\nAll these images (الصور) exist in the nine celestial spheres (الأفلاك) like the existence of a single image in many mirrors (المرايا) of different shapes—long, wide, straight, crooked, round, square, triangular, small, and large. The images of the shapes differ according to the difference of the polished surface (المجلى), while the essence (العين) is one. Those images of the levels (صور المراتب) ruled over that essence (العين), just as the shapes of the mirrors ruled over the image. The Gnostic (العارف) is he who knows his Essence (ذاته) for its Essence, without a locus of manifestation (مجلى). If he is in this position, the levels (المراتب) do not affect him when he attains them, as\n\nHe, peace and blessings be upon him, said while in the highest level: \"I am the master of the children of Adam, and no boast.\"\n\nThus, the level did not rule over him. And he said at all times, while in the level of Messengership and Caliphate: <<إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ>> (I am only a human being like you). Thus, the level did not veil him from the knowledge of his constitution (نشأته). The reason for this is that he saw his subtle nature (لطيفته) looking at its elemental composite (مركبها العنصري) while it was dispersed within it. He witnessed his elemental essence (ذاته العنصرية) and knew that it was under the power of the celestial spheres (الأفلاك العلوية). He saw the shared nature between it and the rest of creation: human, animal, plant, and mineral. Thus, he saw no superiority for himself, in terms of his elemental constitution, over anyone born from it, and that he was like them and they were like him. So he said: <<إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ>> (I am only a human being like you). Then he saw his need for what sustains his constitution (نشأته) from natural nourishment, like the rest of the natural creatures, so he knew himself.\n\nHe said: \"O Abu Bakr, what brought you out?\" He replied: \"Hunger.\" He said: \"And hunger brought me out.\" Then he uncovered two stones he had placed on his stomach to tighten his intestines. He used to seek refuge from hunger and say that it was a wretched companion.\n\nThus, you have known that\n\nHis saying, peace and blessings be upon him: \"I was a Prophet while Adam was between water and clay,\"\n\nwas only spoken by the tongue of that image (صورة) which he possessed from the totality of the images of the levels (صور المراتب). He translated for us in this abode (دار) concerning that image. This is from the states of creation (الخلق). We also have images above this that we have not mentioned, because we have no comfort from the saying of a Lawgiver (شارع) nor from a rational proof (دليل عقلي) upon which we can rely in defining them to you. So we remained silent about them. Otherwise, we have an image in the Footstool (الكرسي), an image in the Throne (العرش), an image in the Prime Matter (الهيولى), an image in Nature (الطبيعة), an image in the Soul (النفس), and an image in the Intellect (العقل)—which are referred to as the Preserved Tablet (اللوح) and the Pen (القلم)—an image in the Cloud ('Amā'), and an image in Non-existence (العدم). All of that is known, seen, and perceived by Allah the Exalted. It is to this totality that the address of Allah is directed when He wills the existence of our aggregate in the world by 'Be!' (كن). So we hasten and respond to emerge from the Presence of Non-existence (حضرة العدم) to the Presence of Existence (حضرة الوجود), and we are dyed with Existence, which is His saying, the Exalted: <<صِبْغَةَ اللهِ وَمَنْ أَحْسَنُ مِنَ اللهِ صِبْغَةً وَنَحْنُ لَهُ عَابِدُونَ>> (The Dye of Allah, and who is better than Allah in dyeing? And we are His worshippers), meaning, submissive and humble. In everything we have mentioned, we have a state (حال) by which we are distinguished in that station (مقام), and our state is the very essence of our image therein. How vast is the dominion of Allah, and how magnificent! Everything we have mentioned is nothing in comparison to Allah.\n\nAmong the states (الأحوال) that descend upon our hearts is also the state of our being in the covenant (الميثاق) that our Lord took from us. The Exalted said: <<وَإِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ ذُرِّيَّتَهُمْ وَأَشْهَدَهُمْ عَلَى أَنْفُسِهِمْ أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَى>> (And when your Lord took from the Children of Adam—from their loins—their descendants and made them testify concerning themselves, \"Am I not your Lord?\" They said, \"Yes\"). You are our Lord (ربنا). Were it not for You, we would have no existence in the elemental form of Adam, determined, seen, and distinguished in Allah’s Knowledge and Vision, and in our own knowledge when we said, \"Yes, You are our Lord.\" Thus, we purified our orientation toward Him. How could we not purify it when we were in His grasp, witnessing the very essence of confinement? And <<وَاللَّهُ بِكُلِّ شَيْءٍ مُحِيطٌ>> (And Allah is encompassing of all things).\n\n### [When Allah brought Adam, peace be upon him, into existence, He placed images within his form, just as He did in the creatures that preceded him]\n\nKnow that when Allah brought Adam, peace be upon him, into existence and fashioned him, just as He fashioned the celestial spheres (الأفلاك) and all the Presences (الحضرات) we mentioned, He placed images (صور) for us within his form, just as He did in the creatures that preceded him. Then He took hold of those determined images in Adam’s loins, and Adam did not know what they contained, just as every image we have in every celestial sphere (فلك) and station (مقام) is unknown to that sphere or that station. Indeed, for the Real (الحق), in every image we possess, there is a specific face directed toward Him. From that face, He addresses us; from that face, we respond to Him; and from that face, we affirm His Lordship (ربوبيته). Had He taken us from before Adam, he would have known us. Therefore, the taking was from his loins, since his loins were unseen (غيب) to him. He also took him with us in this covenant (الميثاق) from his loins, for he has an image with us within his form. So he witnessed as we witnessed, yet he does not know that he was taken from, or perhaps he did know. We are not certain that he did not know that he was taken from, nor that we were taken from him. However, seeing that the Presences (الحضرات) that preceded him did not know of our images within them, we said that perhaps the matter is similar here. May Allah have mercy on a servant who ascertains the knowledge of whether Adam knew this or not,\n\nso that it may be included in this place in this book. If the enumeration of images we mentioned is difficult for your understanding,\n\nIndeed, it is reported in the well-known, good, and rare tradition (الخبر المشهور الحسن الغريب) that Allah disclosed Himself (تجلى) to Adam, peace be upon him, while His hands were closed. He said to him, \"O Adam, choose whichever of them you wish.\" Adam said, \"I choose the right hand of my Lord, and both hands of my Lord are blessed right hands.\" He said, \"So He opened it, and behold, there was Adam and his offspring.\" He looked at a person who was the brightest of them, or among the brightest, and said, \"Who is this, O Lord?\" Allah said to him, \"This is your son, David (Dawood).\" Adam said, \"O Lord, how many years have You decreed for him?\" He said, \"Forty years.\" Adam said, \"O Lord, and how many years have You decreed for me?\" Allah said, \"A thousand years.\" Adam said, \"O Lord, I have given him sixty years of my life.\" Allah said to him, \"That is between you and him.\" Adam continued counting for himself until he reached nine hundred and forty years. Then the Angel of Death came to seize his soul. Adam said to him, \"I still have sixty years left.\" Allah revealed to Adam, \"O Adam, you gifted them to your son David.\" Adam denied (جحد), and his offspring denied. Adam forgot (نسي), and his offspring forgot. The Messenger of Allah, peace and blessings be upon him, said: \"From that day, writing and witnesses were commanded.\"\n\nThis is Adam and his offspring, images (صور) standing in the Right Hand of the Real (الحق). And this is Adam, outside of that Hand, seeing his image and the images of his offspring in the Hand of the Real. Why do you accept this here and deny it when we mention it? If this were inherently impossible, it would not have occurred or been permissible in relation to the Real, since realities (الحقائق) do not change. Know this, and I will provide you with as much familiarization (تأنيس) as I can. Do not be among those of whom Allah said: <<صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَرْجِعُونَ>> (Deaf, dumb, blind—so they will not return) and <<صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَعْقِلُونَ>> (Deaf, dumb, blind—so they do not reason). Allah took the images from Adam’s loins, and Adam was among them, and <<وَأَشْهَدَهُمْ عَلَى أَنْفُسِهِمْ>> (and made them testify concerning themselves) in the presence of the Highest Assembly (الملإ الأعلى) and the images they possess in every locus of manifestation (مجلى): \"Am I not your Lord?\" They said, \"Yes.\" Those present whom we mentioned testified to their affirmation of His Lordship over them and their servitude to Him. Had He had a partner among them, they would not have affirmed absolute dominion (الملك) for Him, for that is a position of truth (حق) due to the witnessing. Their very affirmation of absolute dominion for Him, that He is their Lord, is the essence of negating a partner. We only say this because the word Monotheism (التوحيد) was not mentioned here at all, but the meaning implies it. Since death is the cause of separating the aggregate, severing connections, and scattering the gathering, the separation that is of this nature is called death. The Exalted said: <<كَيْفَ تَكْفُرُونَ بِاللَّهِ وَكُنْتُمْ أَمْوَاتًا فَأَحْيَاكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ>> (How can you disbelieve in Allah when you were dead and He gave you life? Then He will cause you to die, then He will bring you to life). That is, you were scattered in every part of the world of Nature (عالم الطبيعة), so He gathered you and gave you life (أحياكم). Then He causes you to die, meaning He returns you scattered, your spirits separated from the forms of your bodies. Then He brings you to life (يحييكم) in the life of this world. <<ثُمَّ إِلَيْهِ تُرْجَعُونَ>> (Then to Him you will be returned) after departing this world. Indeed, Allah will remind His servants on the Day of Resurrection of what they testified to concerning themselves during the taking of the covenant (الميثاق). They will say: <<رَبَّنَا أَمَتَّنَا اثْنَتَيْنِ وَأَحْيَيْتَنَا اثْنَتَيْنِ فَاعْتَرَفْنَا بِذُنُوبِنَا فَهَلْ إِلَى خُرُوجٍ مِنْ سَبِيلٍ>> (Our Lord, You have caused us to die twice and given us life twice, and we have confessed our sins. Is there any way out?). That is, just as we accepted life after death and death after life twice, it is not impossible for us to accept that repeatedly. So they asked Allah to grant them the favor of returning to the world so they might perform deeds that would earn them the Abode of Bliss. When they said this, the appointed term for their torment had not yet expired. Since Allah decreed that they would be people of the Fire and that they had no abode in Allah’s Knowledge to inhabit other than the Fire, the Exalted said: <<وَلَوْ رُدُّوا لَعَادُوا لِمَا نُهُوا عَنْهُ>> (And if they were returned, they would return to that which they were forbidden), until they enter the Fire by deserving the consequence of transgression, until the precedence of Mercy (الرحمة) over Wrath (الغضب) becomes manifest. They will then abide eternally (مخلدين) in the Fire, never leaving it, upon the state that Allah willed to establish them upon. In this state, Allah returns the offspring (الذرية) to the loins (أصلاب) of the fathers until Allah brings them forth into the life of this world upon that primordial nature (الفطرة). The loins were their graves until the Day they are resurrected from the wombs of their mothers and the ribs of their fathers in the life of this world. Then those whom Allah wills to die will die. Then they will be resurrected on the Day of Resurrection as promised. Our companions differed regarding the Re-creation (الإعادة): Will it be in the form in which we were originated in the world, through procreation (التناسل), person after person, as He said: <<كَمَا بَدَأَكُمْ تَعُودُونَ>> (As He originated you, you will return), through intercourse, pregnancy, and birth simultaneously for all? This is the doctrine of Abu al-Qasim ibn Qasi. Or will they return as spirit to body? This is the doctrine of the majority. Allah knows best.\n\n### [The States of the Primordial Nature (الفطرة) upon which Allah created the creatures]\n\nKnow that among the states (الأحوال) that are fundamental (أمهات) in this chapter—for the details of the states are countless—we mention the states that function as fundamentals. Among them are the states of the Primordial Nature (الفطرة) upon which Allah created the creatures: that they should worship none but Allah. They remained upon that Primordial Nature (الفطرة) in the Monotheism (توحيد) of Allah. They did not set up another named entity alongside Allah that is Allah; rather, they set up deities (آلهة) by way of drawing near to Allah. For this reason, He said: <<قُلْ سَمُّوهُمْ>> (Say, \"Name them\"). For if they name them, it becomes clear that they worshipped none but Allah. Thus, every worshipper worshipped none but Allah in the locus to which they attributed divinity (الألوهية). Therefore, the persistence of Monotheism (التوحيد) for Allah, which they affirmed in the covenant (الميثاق), is confirmed, and the Primordial Nature (الفطرة) is maintained. The reason for attributing divinity (الألوهية) to these worshipped images (الصور المعبودة) is that when the Real (الحق) disclosed Himself (تجلى) to them during the taking of the covenant (الميثاق), He disclosed Himself in one of the Divine Manifestations (المظاهر الإلهية). That is what emboldened them to worship Him in images (الصور). And from the strength of their persistence upon the Primordial Nature (الفطرة) is that they did not truly worship Him in the images; rather, they worshipped the images because of the rank of proximity they imagined in them, such as intercessors (الشفعاء). These two realities (الحقيقتان) are what the creatures incline toward in the Hereafter (الدار الآخرة): namely, Intercession (الشفاعة) and Theophany (التجلي) in images by way of transformation.\n\nWhen this state (الحالة) is established in the heart of a man, and he knows from Divine Knowledge (العلم الإلهي) what called these people—whose description is this—and that they are under the compulsion of what they will ultimately return to, they supplicate to Allah in the darkness of night (الدياجي) and humble themselves to Him concerning their right. They ask Him to admit them into His Mercy (رحمته) when the vengeance (النقمة) has reached its limit upon them. Even if they are the inhabitants (عمار) of that abode (the Fire), they ask Him to grant them bliss therein, since they are among the totality of things encompassed by the General Mercy (الرحمة العامة). Far be it from the Divine Presence (الجناب الإلهي) to be restricted, for He is the One who said that His Mercy preceded His Wrath (غضبه). Wrath is thus attached to non-existence, and even if it is a thing, it is under the encompassing of the vast Divine Mercy (الرحمة الإلهية الواسعة).\n\nThe Prophet, peace and blessings be upon him, said that the Prophets, peace and blessings be upon them, will say on the Day of Resurrection when asked for intercession: \"Indeed, Allah is angry today with a wrath He has never been angry with before, nor will He be angry with anything like it afterward.\"\n\nThis is also one of the most hopeful traditions relied upon in this chapter.\n\n### [The Day of Resurrection is the Day when people stand up from their graves for the Lord of the Worlds]\n\nThe Day (اليوم) to which the Prophets referred is the Day of Resurrection (يوم القيامة). The Day of Resurrection is the Day when people stand up from their graves for the Lord of the Worlds. The Exalted said: <<يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ>> (The Day when mankind will stand before the Lord of the Worlds). On that Day, the Wrath (الغضب) from Allah will be upon the people of Wrath. The ruling of that Wrath granted the command to enter the Fire and the descent of torment and vengeance upon the polytheists and others among the people who will exit through intercession (الشفاعة) and those whom the All-Merciful (الرحمن) will bring out, as\n\nIt is reported in the *Sahih*: \"And He will admit them into Paradise, since they were not among the people of the Fire who are its true inhabitants. None remains in the Fire except its true inhabitants who are its people.\"\n\nThe command to enter the Fire encompassed everyone who entered it, whether they were its true inhabitants or not, due to that Divine Wrath (الغضب الإلهي) which will never be matched afterward. If the torment were eternal (سرمد) upon them, that would be due to a Wrath greater than the Wrath of the command to enter it. Yet the Prophets said that Allah will not be angry after that with a wrath like it. And His ruling, despite the magnitude of that Wrath, was only the command to enter the Fire. Therefore, the ruling of Mercy (الرحمة) must apply to all. The Lawgiver’s definition suffices when He says: \"As for the people of the Fire who are its true inhabitants,\" and He did not say \"the people of torment.\" It is not necessary that those who are the inhabitants (عمار) of the Fire, who dwell in it, must be tormented by it. For its inhabitants and dwellers are Malik and its keepers (خزنتها), who are angels, and the insects, snakes, and other animals within it that will be resurrected on the Day of Resurrection. None of them will find the Fire to be torment (عذاب). Likewise, those who remain in it will neither die therein nor live. Everyone who is accustomed to his abode is happy in it, and the severest torment is separation from one's homeland. If the people of the Fire were to leave it, they would be tormented by their estrangement (اغترابهم) from what they were fitted for. Allah created them upon a constitution (نشأة) that is accustomed to that abode. Thus, the two abodes (Paradise and Fire) are inhabited, and Mercy (الرحمة) preceded Wrath (الغضب) and encompassed everything, including Hell (جهنم) and those within it. And Allah is the Most Merciful of the Merciful (أرحم الراحمين), as He said of Himself. We have found in ourselves, among those whom Allah created upon Mercy, that they show mercy to all servants of Allah, such that if Allah gave them authority over His creation, they would remove the attribute of torment from the world due to the dominance of the ruling of Mercy in their hearts. I and those like me possess this attribute, yet we are created beings subject to desires and purposes. He, may His glory be exalted, said of Himself that He is the Most Merciful of the Merciful (أرحم الراحمين). We do not doubt that He is more merciful to His creation than we are. Since we have recognized this extreme degree of Mercy in ourselves, how can the torment be eternal (يتسرمد) upon them when He possesses this general attribute of Mercy? Allah is too Generous for that, especially since rational proof (الدليل العقلي) has been established that the Creator is not benefited by acts of obedience nor harmed by transgressions, and that everything proceeds according to His decree (قضائه), destiny (قدره), and ruling (حكمه), and that creation is compelled (مجبورون) in their choice. Furthermore, the transmitted proof (الدليل السمعي) has been established that Allah says in the *Sahih*: \"O My servants,\" thus attributing them to Himself. Allah never attributes servants to Himself except those for whom Mercy has preceded, ensuring that misery (الشقاء) will not be confirmed upon them, even if they enter the Fire.\n\nHe said: \"O My servants, if the first of you and the last of you, and your mankind and your jinn, were gathered upon the most pious heart of a single man among you, that would not increase My dominion (ملكي) by anything.\"\n\nHe thus informed us of what the intellect indicates: that acts of obedience and disobedience belong to His dominion, and that He remains as He is, unchanging, and His dominion neither increases nor decreases due to what occurs in it, for all is His dominion and His possession.\n\nThen He said, completing this authentic tradition: \"O My servants, if the first of you and the last of you, and your mankind and your jinn, were to stand on one plain and ask Me, and I gave every one of you his request, that would not decrease My dominion by anything.\"\n\nThe tradition continues. There is no doubt that no one naturally likes what pains him. Therefore, everyone has asked Him not to pain him and to grant him pleasure in things. What we have alluded to is not invalidated by the opponent’s argument in this matter concerning the inclusion of 'if' (لو) in the tradition, for the occurrence of the request (السؤال) from the world is known by necessity from every creature, as nature (الطبع) demands it. The request may be verbal or by state, such as the crying of a nursing infant, even if he does not reason, when experiencing physical pain from an ache or psychological pain from the frustration of purpose when prevented from the breast.\n\nThe issue has been given its due. The states (الأحوال) that descend upon the hearts of men are countless. We have given you a sample of them in this chapter. The states attributed to men follow this style. As for the states in themselves, they have a general ruling over everything, and they have a permanent existence in everything. The act of the State (الحال) is called the Permanent (الدائم) and relates to the Pre-eternal (القديم) and the originated (المحدث). The Exalted said: <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ>> (We will attend to you, O you two weighty ones). This is from the State (الحال), if you but know. And Allah speaks the Truth, and He guides to the Way.\n\nEnd of the Twentieth Journey (السفر العشرون) of *Al-Futuhat al-Makkiyya*.",
    "ur": "باب نمبر تین سو پانچ: حضرت محمدیہ سے مردانِ حق کے قلوب پر احوال کے تواتر (یکے بعد دیگرے آنے) کے منزل کی معرفت میں\n\nحقائق الحق (ذات حق کی حقیقتیں) اسماء اور حال کے ذریعے *** کائنات کو ایک حال سے دوسرے حال میں پلٹتی ہیں۔\nاور اسے قلوب کے سوا کوئی نہیں جانتا *** اور عقل کے لیے اس میں بغیر تھکاوٹ کے کوئی گنجائش نہیں۔\nعقل تقلیب الوجود (ہستی کے پلٹنے) کی مخالفت کرتی ہے *** پس عقل کے لیے قید اور زنجیروں کے سوا کچھ نہیں۔\nعقل ایسی ذات کا مشاہدہ کرتی ہے جس میں کوئی انتقال نہیں *** جبکہ آپ کا قلب احوال کے پلٹنے میں ہے۔\nبے شک مظاہر ہمارے لیے الٰہ کا اپنی ذات میں پلٹنا ہیں *** اور یہ میرے نزدیک عین گمراہی ہے۔\n\n### [علمِ قوت، جو کمان سے تیر اندازی ہے]\n\nجان لو، اللہ تمہیں توفیق دے، کہ یہ منزل بہت سے علوم پر مشتمل ہے، جن میں سے ایک علمِ قوت ہے، جو کمان سے تیر اندازی ہے، اور اس میں داخل ہونا، اور انگلیوں کو تانت اور تیر پر باندھنا، اور تیر چلانے کا طریقہ، اور تیر کا سیدھا ہونا، اور مقابلہ کرنا۔ بے شک اللہ تعالیٰ نے آلاتِ حرب میں سے کسی چیز پر اتنی توجہ نہیں دی جتنی کمان سے تیر اندازی کے علم پر دی، اور اسے اس منزل میں اسم القوی کے ذریعے منازل کے ساتھ مرتب کیا۔ اور ہمیں قرآن میں اس کی تیاری کا حکم دیا، چنانچہ فرمایا:\n\nوَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ (اور ان کے لیے جو کچھ تم سے ہو سکے قوت تیار رکھو) [الأنفال: 60]\n\nرسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: ألا إن القوة الرمي ألا إن القوة الرمي ألا إن القوة الرمي (خبردار! قوت تیر اندازی ہے، خبردار! قوت تیر اندازی ہے، خبردار! قوت تیر اندازی ہے۔)\n\nاور اللہ نے اسے اس منزل میں چار مراتب پر رکھا، اور اہل ذوق کو ان منازل کا مشاہدہ کرایا، اس حکمت کے لیے جو اس کے اہل جانتے ہیں، تاکہ انسان جان لے کہ وہ کس طرح فعل کو انجام دیتا ہے اور اس وصف سے دور اسم کے براہ راست عمل کے بغیر کیسے اثر انداز ہوتا ہے۔ اور اسی علم سے تمہارے لیے قدر (قدر) کا راز منکشف ہوتا ہے، اور تم مخلوقات میں کیسے حکم چلاتے ہو، اور کیوں اس کی اصل لوٹتی ہے، اور اس پر کمان سے تیر اندازی کے سوا کوئی دلیل نہیں، اور یہ ایجاد کے لیے \"کن\" کی روح اور اعدام (فنا) کے لیے مشیئت کی روح ہے۔ یہ منزل علوی اور سفلی اجسام کی تدبیر کرنے والی ارواح کے علم پر مشتمل ہے، اور نوری اجسام میں ان کا کیا حکم ہے، اور ان میں ان کا حکم خاص طور پر صورتوں میں متشکل ہونا ہے، جیسا کہ انسانی حیوانی اجسام میں ان کا حکم قوتِ خیالیہ میں متشکل ہونا ہے، اس کے علاوہ دیگر احکام بھی ہیں۔ کیونکہ نوری اجسام کا کوئی خیال نہیں ہوتا، بلکہ وہ عین خیال ہیں، اور صورتیں ان کی تدبیر کرنے والی ارواح سے پلٹتی ہیں۔ یہ ایک شریف علم ہے۔ اور جس طرح انسان کا خیال صورت سے خالی نہیں ہوتا، اسی طرح ملک کی ذات بھی صورت سے خالی نہیں ہوتی۔ یہ ایک شریف علم ہے جو بہت سے اسرار پر مشتمل ہے۔ اور ان ارواح کے ہاتھ میں ان امور کا تعین ہے جو الحق (ذات حق) ان تمام اجسام کے ذریعے چاہتا ہے۔ پس انسان اپنے مدبر روح کے لحاظ سے اپنے اندر موجود تمام حقّی امور کو جاننے والا ہے، لیکن وہ نہیں جانتا کہ وہ جانتا ہے۔ پس وہ ساہی (بھولنے والے) اور ناسی (غافل) کے درجے میں ہے، اور احوال، مقامات اور منازل اسے یاد دلاتے ہیں۔ اور حکیم نے چہار رکنی تقسیم میں یہ بات کہی ہے، اور وہ ایسا شخص ہے جو جانتا ہے لیکن نہیں جانتا کہ وہ جانتا ہے، پس وہ ناسی ہے، تو اسے یاد دلاؤ۔\n\nاور اس منزل میں دو چیخوں کا علم ہے، جن میں سے ایک سے عالم کے اہل سماع بیہوش ہو جائیں گے، اور دوسری سے وہ ہوش میں آئیں گے اور اپنے رب کی طرف گھبرا کر دوڑیں گے، اسے نفخہ بعث (اٹھائے جانے کا صور) اور نفخہ فزع (گھبراہٹ کا صور) کہا جاتا ہے۔ اور اس میں قلوب کا علم اور ان کے پلٹنے کی تیزی کا علم ہے۔ اور اس میں بصیرت اور بصر کا علم ہے، اور جو کچھ ان میں سے ہر ایک پر التجلی (ظہور الٰہی) ہوتا ہے۔ اور اس میں اعادہ (دوبارہ لانا) کا علم اور اس کی کیفیت ہے، اور اس میں سے کیا لوٹتا ہے اور کیا نہیں لوٹتا۔ اور اس میں دور (چکر) اور کور (تکرار) کا علم ہے، اور کیا یہ صورتوں میں ہوگا یا صورتوں کو اٹھانے والی اعیان میں۔ اور اس میں تبديل کے ساتھ قیومیت (قیومیت) کے اختصاص کا علم ہے۔ اور اس میں ثانوی مواد میں کان سے سنے جانے والے کلام الٰہی کا علم ہے، نہ کہ قلب سے سنے جانے والے کا۔ اور اس میں خاص طور پر ثقلین (جن و انس) میں موجود کبریائی (کبریائی) کا علم ہے، اور کیوں یہ کبریائی باقی موجودات کے بجائے صرف ان دونوں کے ساتھ خاص ہوئی، اور وہ کون سی حقیقت ہے جس نے انہیں یہ عطا کیا، اور کیا یہ جنوں میں ویسا ہی ہے جیسا انسانوں میں ہے، یا سبب مختلف ہے، چنانچہ انسان میں اس کا سبب کامل صورت پر اس کا وجود ہے، اور جنوں میں اس کا آگ سے ہونا ہے۔ اور انسان کس پر تکبر کرتا ہے اور جن کس پر تکبر کرتا ہے۔ اور اس میں اس علم کا ذکر ہے جس سے یہ کبریائی دونوں عالموں سے زائل ہو جاتی ہے۔ اور اس میں اعجاز (معجزہ) کا علم اور معجزانہ امر کی فضیلت کا علم ہے، اور اس میں سے کیا باقی رہتا ہے اور کیا باقی نہیں رہتا، اور کیا اس کی کوئی حد ہے جہاں وہ ختم ہو جائے، یا نہیں۔ اور یہ کیوں لوٹتا ہے، کیا صرف (خالص) ہونے کی وجہ سے یا غیر صرف کی وجہ سے؟ اور اگر صرف کی وجہ سے ہے، تو کیا جب دعوے کا وقت ختم ہو جائے اور مجلس برخاست ہو جائے، تو کیا مد مقابل اس کو لانے پر قادر ہو گا؟ اور اگر وہ لے آئے، تو کیا یہ چیلنج کرنے والے کے پہلے دعوے میں نقص پیدا کرے گا یا نہیں؟ اور اس میں اس سبب کا علم ہے جو الحق (ذات حق) کو جاننے کے بعد اس کی طرف رجوع کرنے سے مانع ہوتا ہے، اور کیا یہ علم ہے یا علم نہیں ہے۔ اور اس میں اس چیز کا علم ہے جس سے بھاگنے والا خوفزدہ ہو کر بھاگتا ہے، اور وہ کہاں بھاگتا ہے، اس علم کے باوجود کہ جس سے وہ بھاگ رہا ہے، وہ بھی بھاگ رہا ہے، تو اس علم کے باوجود اسے کیا چیز حرکت دیتی ہے اور فرار کی دعوت دیتی ہے۔ اور اس میں اعتبار (غور و فکر) کا علم ہے، اور اس کے اہل کون ہیں، اور اللہ نے اسے عالم میں کیوں رکھا اور اس کا حکم دیا، اور اس سے کیا مطلوب ہے۔ اور اس میں خلق (تخلیق) کا علم ہے، اور یہ کیوں خلق کی گئی، کیا انسان کی خاطر یا حیوان کی خاطر یا دونوں کی خاطر۔ اور اس میں آخرت کا علم ہے، اور موقف (میدان حشر) میں کیا ہوگا، اور جنت اور دوزخ کا علم ہے، اور وہ صفات جن کا مطالبہ ان میں سے ہر ایک کرتا ہے۔ اور اس میں انسان کے لیے اپنے نفس میں امر و نہی کے ذریعے تشریع (قانون سازی) کی اباحت ہے، نہ کہ کسی اور میں، اور یہ کہ اگر وہ اس کی مخالفت کرے جس کا اس کا نفس حکم دیتا ہے یا منع کرتا ہے، تو اسے سزا دی جائے گی یا معاف کر دیا جائے گا، جیسا کہ شارع کا حکم ہے۔ اور یہ اسے کس حضرت (حضور) سے صحیح ہوا، اور کیا اس کا نبوت میں کوئی ذوق ہے یا یہ خاص نبوت ہے، نہ کہ انبیاء کی محصور نبوت۔ اور اس میں قیامت کے اختتام کا علم ہے۔ اور اس میں زمان (وقت) کے لپیٹے جانے کا علم ہے۔ پس یہ وہ تمام علوم کی اقسام ہیں جو یہ منزل اپنے اندر سموئے ہوئے ہے، اور ہر جنس اور نوع کے تحت اس کی تقسیمات کے مطابق علوم اور ان کی انواع ہیں۔ پس ہم ان میں سے ایک مسئلہ یا جو میسر ہو ذکر کریں گے، جیسا کہ ہم نے ہر منزل میں کیا ہے، اور اللہ ہی ہمیشہ باقی رہنے والا اور بچانے والا ہے، اس کے سوا کوئی رب نہیں۔\n\nپس ان احوال میں سے جو یہ منزل اپنے اندر سموئے ہوئے ہے، انسان کا وہ حال ہے جو اس پر عہد (ميثاق) لیے جانے سے پہلے تھا، اور یہ وہ حال ہے جس میں رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم تھے جب آپ کو آدم علیہ السلام کی تخلیق سے پہلے اپنی نبوت سے آگاہ کیا گیا۔ اور یہ خبر میں آپ صَلَّى اللهُ عَليهِ وسَلَّم سے وارد ہوا ہے، چنانچہ آپ نے فرمایا: كنت نبيا وآدم بين الماء والطين (میں نبی تھا جبکہ آدم پانی اور مٹی کے درمیان تھے)۔\n\nپس اس حالت میں آپ کے لیے تعریف (آگاہی) تھی۔ اور یہ اس طرح ہے کہ یہ انسانی نشأت عناصر میں اور ان کے مراتب میں پھیلی ہوئی تھی، یہاں تک کہ ان کی موت کا وقت آ گیا، جس پر وہ اپنے اجسام کی اعیان کے وجود میں ہوں گے، جو آسمانوں میں ہر اس حال کے لیے جو وہ دنیا میں پلٹتے ہیں، ایک معلوم اور متعین امر میں ودیعت ہے۔ اس حال کی ایک صورت فلک میں ہے، جسے اللہ نے فرشتوں کی نگاہوں سے چھپا رکھا ہے، جو اللہ کے پاس ایک معین غیب میں لپٹی ہوئی ہے، جسے آسمان نہیں جانتے حالانکہ وہ ان میں موجود ہے۔ اور اللہ نے دنیا کے عالم میں اس کی عین کا وجود ان افلاک کی حرکات میں رکھا ہے۔ پس لوگوں میں سے بعض کو اس مقام پر اپنے نفس اور اپنے مرتبے کا مشاہدہ عطا کیا گیا، یا تو اس کی انتہاؤں پر اس کی کاملیت کے ساتھ، یا وہ کسی صورت کا مشاہدہ کرتا ہے، اور وہ دنیا کی زندگی میں اس کے لیے عین وہ مرتبہ ہے، پس وہ اسے جانتا ہے اور اس کے ذریعے اپنے نفس پر حکم لگاتا ہے۔ اور یہاں رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے اپنی نبوت کا مشاہدہ کیا، اور ہم نہیں جانتے کہ کیا آپ نے اپنے تمام احوال کی صورت کا مشاہدہ کیا یا نہیں، اللہ ہی بہتر جانتا ہے۔ اللہ تعالیٰ نے فرمایا: وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا (اور ہر آسمان میں اس کا حکم وحی کیا) [فصلت: 12]۔ اور یہ اس کے حکم اور اس کی شان میں سے ہے کہ اس صورت کو اس کے وقت آنے تک محفوظ رکھا جائے، پس دنیا کی زندگی میں اس کے مراتب کو وہ فلکی صورت عطا کر دی جاتی ہے، بغیر اس کے کہ اس میں سے کچھ کم ہو جائے۔ ذَٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ (یہ غالب، جاننے والے کا اندازہ ہے) [الأنعام: 96]۔\n\nاور یہ تمام صورتیں نو افلاک (نو افلاک) میں موجود ہیں، جیسے ایک صورت کا کثیر آئینوں میں موجود ہونا جو شکلوں میں مختلف ہیں، جیسے لمبائی، چوڑائی، سیدھا پن، ٹیڑھا پن، گولائی، چوکور، مثلث، چھوٹا اور بڑا۔ پس صورتوں کی شکلیں مجلی (ظہور کی جگہ) کے اختلاف سے مختلف ہوتی ہیں، جبکہ عین (اصل) ایک ہی ہے۔ پس وہ مراتب کی صورتیں اس عین پر حکم فرما ہوئیں، جیسا کہ آئینوں کی شکلوں نے صورت پر حکم لگایا۔ پس عارف وہ ہے جس نے اپنی ذات کو اپنی ذات کے لیے پہچانا، بغیر کسی مجلی کے۔ اور اگر وہ اس مرتبے پر ہو، تو جب وہ مراتب کو حاصل کرتا ہے تو وہ اس پر اثر انداز نہیں ہوتیں، جیسا کہ آپ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا، جبکہ آپ اعلیٰ مرتبے پر تھے: أنا سيد ولد آدم ولا فخر (میں اولادِ آدم کا سردار ہوں اور مجھے فخر نہیں)۔\n\nپس مرتبے نے آپ پر حکم نہیں لگایا۔ اور آپ نے ہر وقت فرمایا، جبکہ آپ رسالت اور خلافت کے مرتبے پر تھے: إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ (میں تو بس تمہاری طرح کا ایک بشر ہوں) [الکہف: 110]۔ پس مرتبے نے آپ کو آپ کی نشأت کی معرفت سے نہیں روکا۔ اور اس کا سبب یہ ہے کہ آپ نے اپنی لطیفہ کو اپنے عنصری مرکب کی طرف دیکھتے ہوئے دیکھا، جبکہ وہ اس میں بکھرا ہوا تھا، پس آپ نے اپنی عنصری ذات کا مشاہدہ کیا، اور جان لیا کہ وہ علوی افلاک کی قوت کے تحت ہے، اور آپ نے اس میں اور باقی انسانی مخلوق، حیوان، نباتات اور جمادات کے درمیان شرکت دیکھی۔ پس آپ نے اپنی عنصری نشأت کے لحاظ سے اپنے لیے ہر اس چیز پر کوئی فضیلت نہیں دیکھی جو اس سے پیدا ہوئی، اور یہ کہ آپ ان کے لیے مثال ہیں اور وہ آپ کے لیے مثال ہیں۔ پس آپ نے فرمایا: إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ (میں تو بس تمہاری طرح کا ایک بشر ہوں)۔ پھر آپ نے اپنی نشأت کو قائم رکھنے کے لیے طبعی غذا کی طرف اپنی احتیاج دیکھی، جیسے باقی طبعی مخلوقات، پس آپ نے اپنے نفس کو پہچانا۔\n\nآپ نے فرمایا: يا أبا بكر ما أخرجك قال الجوع قال وأنا أخرجني الجوع فكشف عن حجرين قد وضعهما على بطنه يشد بهما أمعاءه وكان يتعوذ من الجوع ويقول إنه بئس الضجيع‏ (اے ابوبکر! تمہیں کس چیز نے نکالا؟ انہوں نے کہا: بھوک نے۔ آپ نے فرمایا: اور مجھے بھی بھوک نے نکالا ہے۔ پس آپ نے دو پتھروں سے پردہ ہٹایا جو آپ نے اپنے پیٹ پر رکھے ہوئے تھے، جن سے آپ اپنی آنتوں کو باندھتے تھے۔ اور آپ بھوک سے پناہ مانگتے تھے اور فرماتے تھے کہ یہ برا ساتھی ہے۔)\n\nپس تم نے جان لیا کہ آپ صَلَّى اللهُ عَليهِ وسَلَّم کا یہ قول: كنت نبيا وآدم بين الماء والطين (میں نبی تھا جبکہ آدم پانی اور مٹی کے درمیان تھے)، یہ قول اس صورت کی زبان سے تھا جو مراتب کی صورتوں کے مجموعے میں آپ کے لیے تھی۔ پس آپ نے اس دار (دنیا) میں ہمارے لیے اس صورت کی ترجمانی کی۔ پس یہ خلق کے احوال میں سے ہے۔ اور ہمارے لیے اس سے اوپر بھی صورتیں ہیں جن کا ہم نے ذکر نہیں کیا، کیونکہ ہمارے پاس کسی شارع کے قول سے یا کسی عقلی دلیل سے کوئی اطمینان نہیں ہے جس پر ہم تمہیں ان کی تعریف میں بھروسہ کر سکیں۔ پس ہم ان سے خاموش رہے۔ ورنہ ہماری ایک صورت کرسی میں ہے، اور ایک صورت عرش میں، اور ایک صورت ہیولیٰ میں، اور ایک صورت طبیعت میں، اور ایک صورت نفس میں، اور ایک صورت عقل میں ہے، جسے لوح اور قلم (اللوح والقلم) سے تعبیر کیا جاتا ہے، اور ایک صورت عماء (عماء) میں ہے، اور ایک صورت عدم (عدم) میں ہے۔ اور یہ سب اللہ تعالیٰ کے لیے معلوم، مرئی اور بصیرت سے دیکھے جانے والے ہیں۔ اور یہی وہ ہے جس پر اللہ کا خطاب متوجہ ہوتا ہے جب وہ دنیا میں ہمارے مجموعے کو \"کن\" کے ذریعے وجود میں لانا چاہتا ہے، پس ہم تیزی سے عدم (عدم) کی حضرت (حضور) سے الوجود (ہستی) کی حضرت کی طرف نکلنے کے لیے جواب دیتے ہیں، پس ہم الوجود (ہستی) سے رنگین ہو جاتے ہیں۔ اور یہی اللہ تعالیٰ کا قول ہے: صِبْغَةَ اللَّهِ وَمَنْ أَحْسَنُ مِنَ اللَّهِ صِبْغَةً وَنَحْنُ لَهُ عَابِدُونَ (اللہ کا رنگ، اور اللہ سے بہتر رنگ کس کا ہو سکتا ہے؟ اور ہم اسی کی عبادت کرنے والے ہیں) [البقرۃ: 138]۔ یعنی ذلیل اور فرمانبردار۔ اور ہم ان تمام مذکورہ مقامات میں ایک حال رکھتے ہیں جس سے ہم اس مقام میں ممتاز ہوتے ہیں، اور ہمارا حال اس میں ہماری عین صورت ہے۔ پس اللہ کی بادشاہت کتنی وسیع اور کتنی عظیم ہے! اور جو کچھ ہم نے ذکر کیا وہ اللہ کے مقابلے میں کچھ بھی نہیں۔\n\nاور ان احوال میں سے جو ہمارے قلوب پر وارد ہوتے ہیں، ہمارا وہ حال ہے جب ہم اس عہد (ميثاق) میں تھے جو ہمارے رب نے ہم سے لیا تھا۔ اللہ تعالیٰ نے فرمایا: وَإِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ ذُرِّيَّتَهُمْ وَأَشْهَدَهُمْ عَلَىٰ أَنْفُسِهِمْ أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَىٰ (اور جب آپ کے رب نے بنی آدم کی پشتوں سے ان کی اولاد کو نکالا اور انہیں ان کے نفسوں پر گواہ بنایا، کیا میں تمہارا رب نہیں ہوں؟ انہوں نے کہا: کیوں نہیں) [الأعراف: 172]۔\n\nآپ ہی ہمارے رب ہیں، پس اگر آپ نہ ہوتے تو آدم کی عنصری صورت میں ہمارا وجود نہ ہوتا، جو اللہ کے علم اور اس کی رؤیت میں متعین، مرئی اور ممتاز ہیں۔ اور ہمارے پاس وہ ہے جو ہم نے کہا: \"کیوں نہیں، آپ ہمارے رب ہیں (بَلَىٰ أنت ربنا)\"۔ پس ہم نے اس کے لیے توجہ کو خالص کر لیا۔ اور ہم کیسے خالص نہ کرتے جبکہ ہم اس کی گرفت میں ہیں، عین مشاہدہ میں، محصور ہیں۔ وَاللَّهُ بِكُلِّ شَيْءٍ مُحِيطٌ (اور اللہ ہر چیز کو گھیرے ہوئے ہے) [النساء: 126]۔\n\n### [بے شک جب اللہ نے آدم علیہ السلام کو وجود بخشا تو ان کی صورت میں صورتیں بنائیں جیسا کہ اس نے سابقہ مخلوقات میں کیا تھا]\n\nپس جان لو کہ جب اللہ نے آدم علیہ السلام کو وجود بخشا اور انہیں سنوارا، جیسا کہ اس نے افلاک اور تمام مذکورہ حضرات کو سنوارا، تو اس نے ان کی صورت میں ہمارے لیے صورتیں بنائیں، جیسا کہ اس نے سابقہ مخلوقات میں کیا تھا۔ پھر اس نے آدم کی پشت میں ان متعین صورتوں کو قبض کیا، اور آدم نہیں جانتے تھے کہ وہ کیا سموئے ہوئے ہیں، جیسا کہ ہر فلک اور مقام میں ہماری ہر صورت کو وہ فلک اور وہ مقام نہیں جانتا۔ اور بے شک الحق (ذات حق) کے لیے ہماری ہر صورت میں ایک خاص رخ ہے، اسی رخ سے وہ ہم سے مخاطب ہوتا ہے، اور اسی رخ سے ہم اسے جواب دیتے ہیں، اور اسی رخ سے ہم اس کی ربوبیت کا اقرار کرتے ہیں۔ پس اگر ہمیں آدم کے سامنے سے لیا جاتا تو وہ جان لیتے، اس لیے پشت سے لیا گیا، کیونکہ ان کی پشت ان کے لیے غیب تھی۔ اور اس عہد (ميثاق) میں بھی ہمیں ان کی پشت سے لیا گیا، کیونکہ ان کی صورت میں ہماری ایک صورت ہے۔ پس انہوں نے مشاہدہ کیا جیسا کہ ہم نے مشاہدہ کیا، اور وہ نہیں جانتے کہ انہیں ان سے لیا گیا یا شاید وہ جانتے تھے، کیونکہ ہم اس یقین پر نہیں ہیں کہ وہ نہیں جانتے تھے کہ انہیں ان سے لیا گیا، اور نہ ہی اس پر کہ ہمیں ان سے لیا گیا، لیکن جب ہم نے دیکھا کہ ان سے پہلے کی حضرات ہماری صورتوں کو ان میں نہیں جانتیں، تو ہم نے کہا کہ شاید یہاں بھی معاملہ ایسا ہی ہو۔ پس اللہ اس بندے پر رحم کرے جو اس علم پر ٹھہر جائے کہ آدم نے جانا یا نہیں جانا۔\n\nپس اگر تمہاری سمجھ سے صورتوں کی گنتی جو ہم نے ذکر کی ہے، دور ہو گئی ہو، تو مشہور، حسن، غریب خبر میں وارد ہوا ہے کہ اللہ نے آدم علیہ السلام پر التجلی (ظہور الٰہی) فرمایا، جبکہ اس کے دونوں ہاتھ بندھے ہوئے تھے، پس اللہ نے ان سے فرمایا: يا آدم اختر أيتهما شئت فقال اخترت يمين ربي وكلتا يدي ربي يمين مباركة قال فبسطها فإذا آدم وذريته فنظر إلى شخص من أضوئهم أو أضوئهم فقال من هذا يا رب فقال الله له هذا ابنك داود فقال يا رب كم كتبت له فقال أربعين سنة فقال يا رب وكم كتبت لي فقال الله ألف سنة فقال يا رب فقد أعطيته من عمري ستين سنة قال الله له أنت وذاك فما زال يعد لنفسه حتى بلغ تسعمائة وأربعين سنة فجاءه ملك الموت ليقبض روحه فقال له آدم إنه بقي لي ستون سنة فأوحى الله إلى آدم أي يا آدم إنك وهبتها لابنك داود فجحد آدم فجحدت ذريته ونسي آدم فنسيت ذريته قال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فمن ذلك اليوم أمر بالكتاب والشهود (اے آدم! ان میں سے جسے چاہو چن لو۔ انہوں نے کہا: میں نے اپنے رب کا دایاں ہاتھ چنا، اور میرے رب کے دونوں ہاتھ مبارک دائیں ہیں۔ فرمایا: پس اللہ نے اسے کھولا، تو اس میں آدم اور ان کی ذریت تھی۔ پس انہوں نے ان میں سے ایک شخص کی طرف دیکھا جو ان سب سے زیادہ روشن تھا، یا ان میں سے زیادہ روشن تھا۔ پس انہوں نے کہا: اے رب! یہ کون ہے؟ اللہ نے ان سے فرمایا: یہ تمہارا بیٹا داؤد ہے۔ انہوں نے کہا: اے رب! تو نے اس کے لیے کتنی عمر لکھی ہے؟ اللہ نے فرمایا: چالیس سال۔ انہوں نے کہا: اے رب! اور تو نے میرے لیے کتنی لکھی ہے؟ اللہ نے فرمایا: ایک ہزار سال۔ انہوں نے کہا: اے رب! میں نے اسے اپنی عمر میں سے ساٹھ سال دے دیے۔ اللہ نے فرمایا: تم اور وہ۔ پس وہ اپنے لیے گنتے رہے یہاں تک کہ نو سو چالیس سال تک پہنچ گئے۔ پس ملک الموت ان کی روح قبض کرنے کے لیے آئے، تو آدم نے ان سے کہا: میری تو ساٹھ سال باقی ہیں۔ پس اللہ نے آدم کی طرف وحی کی، یعنی اے آدم! تم نے وہ اپنے بیٹے داؤد کو ہبہ کر دی تھی۔ پس آدم نے انکار کیا تو ان کی ذریت نے انکار کیا، اور آدم بھول گئے تو ان کی ذریت بھول گئی۔ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: پس اسی دن سے لکھنے اور گواہی کا حکم دیا گیا۔)\n\nپس یہ آدم اور ان کی ذریت الحق (ذات حق) کے دائیں ہاتھ میں قائم صورتیں ہیں۔ اور یہ آدم اس ہاتھ سے باہر ہیں اور وہ اپنی صورت اور اپنی ذریت کی صورتوں کو الحق (ذات حق) کے ہاتھ میں دیکھ رہے ہیں۔ پس تم اس مقام پر اسے کیوں قریب کرتے ہو اور ہم پر اس کا انکار کرتے ہو؟ اگر یہ بذات خود محال ہوتا تو یہ واقع نہ ہوتا اور نہ ہی جائز ہوتا، کیونکہ حقائق (حقائق) نہیں بدلتے۔ پس یہ جان لو، اور میں تمہارے لیے اس سے زیادہ انس پیدا کرنے کی کوشش کرتا ہوں جتنا میں کر سکتا ہوں۔ پس تم ان لوگوں میں سے نہ بنو جن کے بارے میں اللہ نے فرمایا: صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَرْجِعُونَ (بہرے، گونگے، اندھے ہیں، پس وہ نہیں لوٹیں گے) [البقرۃ: 18]، صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَعْقِلُونَ (بہرے، گونگے، اندھے ہیں، پس وہ عقل نہیں کرتے) [البقرۃ: 171]۔ اور اللہ نے آدم کی پشت سے صورتیں لیں، اور آدم ان میں موجود تھے، اور وَأَشْهَدَهُمْ عَلَىٰ أَنْفُسِهِمْ (اور انہیں ان کے نفسوں پر گواہ بنایا) [الأعراف: 172]، ملأ اعلیٰ کی موجودگی میں، اور ان صورتوں کے لیے جو ہر مجلی (ظہور کی جگہ) میں ہیں: أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَىٰ (کیا میں تمہارا رب نہیں ہوں؟ انہوں نے کہا: کیوں نہیں) [الأعراف: 172]۔ پس جن کا ہم نے ذکر کیا ان میں سے جو حاضر تھے، انہوں نے ان کے اقرار پر گواہی دی کہ وہ ان کے رب ہیں اور وہ اس کے بندے ہیں۔ پس اگر ان میں اس کا کوئی شریک ہوتا تو وہ مطلقاً اس کی بادشاہت کا اقرار نہ کرتے، کیونکہ یہ گواہی کی وجہ سے حق کا مقام ہے۔ پس ان کا مطلقاً اس کی بادشاہت کا اقرار کرنا کہ وہ ان کا رب ہے، عین شریک کی نفی ہے۔ اور ہم نے یہ اس لیے کہا کہ یہاں توحید کا لفظ اصلاً استعمال نہیں ہوا، لیکن معنی اس کا تقاضا کرتا ہے۔\n\nاور جب موت مجموعے کو منتشر کرنے، تعلقات کو جدا کرنے اور اجتماع کو بکھیرنے کا سبب ہے، تو اس طرح کے تفریق کو موت کہا گیا۔ اللہ تعالیٰ نے فرمایا: كَيْفَ تَكْفُرُونَ بِاللَّهِ وَكُنْتُمْ أَمْوَاتًا فَأَحْيَاكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ (تم اللہ کا کیسے انکار کرتے ہو جبکہ تم مردہ تھے تو اس نے تمہیں زندہ کیا، پھر وہ تمہیں مارے گا، پھر تمہیں زندہ کرے گا) [البقرۃ: 28]۔ یعنی تم عالمِ طبیعت کے ہر جز میں متفرق تھے، پس اس نے تمہیں جمع کیا اور زندہ کیا، پھر وہ تمہیں مارے گا، یعنی تمہیں متفرق حالت میں لوٹا دے گا، تمہاری ارواح تمہارے اجسام کی صورتوں سے جدا ہوں گی۔ پھر وہ تمہیں دنیا کی زندگی میں زندہ کرے گا۔ ثُمَّ إِلَيْهِ تُرْجَعُونَ (پھر تم اسی کی طرف لوٹائے جاؤ گے) [البقرۃ: 28] دنیا سے جدا ہونے کے بعد۔ اور بے شک اللہ قیامت کے دن اپنے بندوں کو اس چیز کی یاد دلائے گا جس کی انہوں نے عہد (ميثاق) لیتے وقت اپنے نفسوں پر گواہی دی تھی، پس وہ کہیں گے: رَبَّنَا أَمَتَّنَا اثْنَتَيْنِ وَأَحْيَيْتَنَا اثْنَتَيْنِ فَاعْتَرَفْنَا بِذُنُوبِنَا فَهَلْ إِلَىٰ خُرُوجٍ مِنْ سَبِيلٍ (اے ہمارے رب! تو نے ہمیں دو بار مارا اور دو بار زندہ کیا، پس ہم نے اپنے گناہوں کا اعتراف کر لیا، تو کیا نکلنے کی کوئی راہ ہے؟) [غافر: 11]۔ یعنی جیسا کہ ہم نے دو بار موت کے بعد زندگی اور زندگی کے بعد موت کو قبول کیا، تو یہ محال نہیں کہ ہم اسے بار بار قبول کریں۔ پس انہوں نے اللہ سے درخواست کی کہ وہ انہیں دنیا میں لوٹنے کا احسان کرے تاکہ وہ ایسا عمل کریں جو انہیں دارِ نعیم کا وارث بنائے۔ اور جب انہوں نے یہ کہا، تو ان کے عذاب کی مقررہ مدت ختم نہیں ہوئی تھی۔ اور جب اللہ نے یہ مقدر کر دیا کہ وہ اہل نار ہوں گے اور اللہ کے علم میں ان کے لیے آگ کے سوا کوئی گھر نہیں ہے جسے وہ آباد کریں، تو اللہ تعالیٰ نے فرمایا: وَلَوْ رُدُّوا لَعَادُوا لِمَا نُهُوا عَنْهُ (اور اگر وہ لوٹائے جائیں تو وہی کریں گے جس سے انہیں منع کیا گیا تھا) [الأنعام: 28]، یہاں تک کہ وہ مخالفت کے استحقاق کے ساتھ آگ میں داخل ہوں، جب تک کہ رحمت کا غضب پر سبقت لے جانا ظاہر نہ ہو جائے۔ پس وہ آگ میں ہمیشہ رہیں گے، اس سے کبھی نہیں نکلیں گے، اس حالت پر جو اللہ نے ان کے لیے مقرر کی ہے۔ اور اس میں اللہ ذریت کو آباء کی پشتوں کی طرف لوٹا دے گا، یہاں تک کہ اللہ انہیں اس فطرت پر دنیا کی زندگی میں نکالے گا۔ پس پشتیں ان کی قبریں تھیں، اس دن تک جب وہ اپنی ماؤں کے پیٹوں سے اور اپنے آباء کی پسلیوں سے دنیا کی زندگی میں اٹھائے جائیں گے۔ پھر ان میں سے جسے اللہ چاہے گا وہ مر جائے گا، پھر قیامت کے دن اٹھایا جائے گا جیسا کہ وعدہ کیا گیا۔ اور ہمارے اصحاب نے اعادہ (دوبارہ لانا) کے بارے میں اختلاف کیا ہے کہ کیا یہ اس صورت پر ہوگا جس پر ہم دنیا میں تناسل کے ذریعے ایک شخص سے دوسرے شخص کی صورت میں پیدا ہوئے، جیسا کہ فرمایا: كَمَا بَدَأَكُمْ تَعُودُونَ (جیسا کہ اس نے تمہیں شروع کیا تھا، تم لوٹو گے) [الأعراف: 29]، یعنی سب کے لیے ایک ہی وقت میں جماع، حمل اور ولادت کے ساتھ، اور یہ ابو القاسم بن قسی کا مذہب ہے، یا وہ روح کے جسم کی طرف لوٹنے کی صورت میں ہوں گے، اور یہ جماعت کا مذہب ہے۔ واللہ اعلم۔\n\n### [فطرت کے احوال جس پر اللہ نے مخلوق کو پیدا کیا]\n\nاور جان لو کہ ان احوال میں سے جو اس باب میں امہات (بنیادی اصول) ہیں، کیونکہ احوال کی تفصیلات کثرت کی وجہ سے شمار نہیں کی جا سکتیں، لیکن ہم ان میں سے وہ احوال ذکر کرتے ہیں جو امہات کا درجہ رکھتے ہیں۔ ان میں سے وہ فطرت (فطرت) کے احوال ہیں جس پر اللہ نے مخلوق کو پیدا کیا، اور وہ یہ ہے کہ وہ صرف اللہ کی عبادت کریں۔ پس وہ اللہ کی توحید (توحید) پر اس فطرت پر قائم رہے، پس انہوں نے اللہ کے ساتھ کسی دوسرے مسمیٰ کو اللہ نہیں بنایا، بلکہ انہوں نے اللہ سے قربت (قربت) کے طریقے پر معبود بنائے، اور اسی لیے اللہ نے فرمایا: قُلْ سَمُّوهُمْ (کہو، ان کے نام رکھو) [الرعد: 33]۔ پس جب وہ ان کے نام رکھیں گے تو یہ ظاہر ہو جائے گا کہ انہوں نے صرف اللہ کی عبادت کی ہے۔ پس ہر عبادت کرنے والے نے صرف اللہ کی عبادت کی، اس محل میں جسے اس نے الوہیت سے منسوب کیا۔ پس اللہ کے لیے توحید کا باقی رہنا صحیح ہوا جس کا انہوں نے عہد (ميثاق) میں اقرار کیا تھا، اور یہ کہ فطرت (فطرت) برقرار ہے۔ اور ان معبود صورتوں کی طرف الوہیت کی نسبت کا سبب یہ ہے کہ جب الحق (ذات حق) نے عہد (ميثاق) لیتے وقت ان پر التجلی (ظہور الٰہی) فرمایا، تو اس نے ان پر الٰہی مظاہر میں سے کسی ایک مظهر میں التجلی فرمایا۔ پس اسی چیز نے انہیں صورتوں میں اس کی عبادت کرنے کی جرات دلائی۔ اور ان کے فطرت (فطرت) پر باقی رہنے کی قوت میں سے یہ ہے کہ انہوں نے حقیقت میں صورتوں میں اس کی عبادت نہیں کی، بلکہ انہوں نے صورتوں کی عبادت کی اس مرتبے کی وجہ سے جو انہوں نے ان میں تخیل کیا، جیسے شفاعت کرنے والے (الشفعاء)۔ اور یہ دو حقیقتیں ہیں جن کی طرف مخلوق آخرت کے گھر میں مائل ہو گی۔\n\nاور وہ دو حقیقتیں شفاعت (شفاعت) اور صورتوں میں تحول (بدلنے) کے طریقے پر التجلی (ظہور الٰہی) ہیں۔ پس جب یہ حال آدمی کے قلب میں راسخ ہو جائے اور وہ علم الٰہی سے جان لے کہ ان لوگوں کو کس چیز نے بلایا جن کی یہ صفت ہے، اور یہ کہ وہ اس قہر کے تحت ہیں جس کی طرف وہ لوٹیں گے، تو وہ راتوں کی تاریکیوں میں اللہ سے گڑگڑاتے ہیں اور اپنے حق میں اس کی خوشامد کرتے ہیں، اور اس سے سوال کرتے ہیں کہ جب ان سے انتقام اپنی حد کو پہنچ جائے تو وہ انہیں اپنی رحمت میں داخل کر لے، اگرچہ وہ اس گھر (جہنم) کے آباد کرنے والے ہی کیوں نہ ہوں۔ پس وہ اس میں ان کے لیے نعمت بنا دے، کیونکہ وہ ان تمام چیزوں میں سے ہیں جنہیں رحمت عامہ (رحمت عامہ) نے گھیر لیا ہے۔ اور جناب الٰہی اس بات سے پاک ہے کہ اسے مقید کیا جائے، اور وہ ہی فرمانے والا ہے کہ اس کی رحمت اس کے غضب پر سبقت لے گئی (رحمتي سبقت غضبي)۔ پس غضب عدم (عدم) سے جا ملا، اور اگر وہ کوئی چیز ہے تو وہ وسیع رحمت الٰہی کے احاطے کے تحت ہے۔\n\nاور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: إن الأنبياء صَلَّى اللهُ عَليهِ وسَلَّم تقول يوم القيامة إذا سألوا في الشفاعة إن الله قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله (بے شک انبیاء صَلَّى اللهُ عَليهِ وسَلَّم قیامت کے دن کہیں گے جب ان سے شفاعت کے بارے میں پوچھا جائے گا: بے شک اللہ آج اتنا غضبناک ہے کہ اس سے پہلے اتنا غضبناک نہیں ہوا اور نہ اس کے بعد اتنا غضبناک ہو گا۔)\n\nاور یہ اس باب میں سب سے زیادہ امید افزا حدیث ہے جس پر بھروسہ کیا جاتا ہے۔\n\n### [قیامت کا دن وہ دن ہے جب لوگ اپنے رب العالمین کے لیے اپنی قبروں سے کھڑے ہوں گے]\n\nپس جس دن کی طرف انبیاء نے اشارہ کیا وہ یوم القیامہ (قیامت کا دن) ہے، اور یوم القیامہ وہ دن ہے جب لوگ اپنے رب العالمین کے لیے اپنی قبروں سے کھڑے ہوں گے۔ اللہ تعالیٰ نے فرمایا: يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ (جس دن لوگ رب العالمین کے لیے کھڑے ہوں گے) [المطففین: 6]۔ اور اس دن اللہ کی طرف سے اہل غضب پر غضب ہوگا، اور اس غضب کا حکم آگ میں داخل ہونے، عذاب کے نازل ہونے اور مشرکین اور ان لوگوں سے انتقام لینے کا حکم دیا گیا جو شفاعت کے ذریعے نکلیں گے اور جنہیں رحمن نکالے گا، جیسا کہ صحیح حدیث میں وارد ہوا ہے، اور انہیں جنت میں داخل کرے گا، کیونکہ وہ اہل نار میں سے نہیں تھے جو اس کے اہل ہیں۔ اور آگ میں صرف اس کے اہل باقی رہیں گے جو اس کے اہل ہیں۔\n\nپس آگ میں داخل ہونے کا حکم ہر اس شخص کو شامل ہوا جو اس میں داخل ہوا، خواہ وہ اس کے اہل میں سے ہو یا غیر اہل میں سے، اس الٰہی غضب کی وجہ سے جس کے بعد وہ ایسا غضبناک نہیں ہوگا۔ پس اگر ان پر عذاب ہمیشہ کے لیے ہوتا تو یہ اس غضب سے بھی بڑا غضب ہوتا جو اس میں داخل ہونے کا حکم دینے پر تھا۔ اور انبیاء نے کہا کہ اللہ اس کے بعد ایسا غضبناک نہیں ہوگا، اور اس عظیم غضب کے باوجود اس کا حکم صرف آگ میں داخل ہونے کا تھا۔ پس سب پر رحمت کا حکم ہونا ضروری ہے۔ اور شارع کی طرف سے یہ تعریف کافی ہے کہ اس نے فرمایا: \"اور رہے اہل نار جو اس کے اہل ہیں (وأما أهل النار الذين هم أهلها)\"، اور یہ نہیں کہا کہ اہل عذاب۔ اور یہ ضروری نہیں کہ جو اہل نار میں سے ہوں اور اسے آباد کرنے والے ہوں، وہ اس سے عذاب دیے جائیں، کیونکہ اس کے اہل اور آباد کرنے والے مالک اور اس کے خازن (داروغے) ہیں، اور وہ فرشتے ہیں، اور جو کچھ اس میں حشرات، سانپ اور دیگر حیوانات ہیں جو قیامت کے دن اٹھائے جائیں گے، ان میں سے کوئی بھی ایسا نہیں ہوگا جس پر آگ عذاب ہو۔ اسی طرح جو اس میں باقی رہیں گے، وہ نہ اس میں مریں گے اور نہ زندہ رہیں گے۔ اور جو شخص اپنے وطن کا عادی ہو جاتا ہے، وہ اس سے خوش ہوتا ہے، اور سب سے سخت عذاب وطن سے جدائی ہے۔ پس اگر اہل نار اس سے جدا ہو جائیں تو وہ اس سے اجنبی ہونے کی وجہ سے عذاب پائیں گے جس کے لیے وہ اہل بنائے گئے تھے۔ اور اللہ نے انہیں ایسی نشأت پر پیدا کیا ہے جو اس وطن سے مانوس ہوتی ہے۔ پس دونوں گھر آباد ہو گئے، اور رحمت غضب پر سبقت لے گئی، اور جہنم اور جو کچھ اس میں ہے، سب کو رحمت نے گھیر لیا۔ اور اللہ ارحم الراحمین ہے، جیسا کہ اس نے اپنے بارے میں فرمایا ہے۔ اور ہم نے اپنے نفوس میں ان لوگوں کو پایا ہے جنہیں اللہ نے رحمت پر پیدا کیا ہے کہ وہ اللہ کے تمام بندوں پر رحم کرتے ہیں، یہاں تک کہ اگر اللہ انہیں اپنی مخلوق پر حاکم بنا دے تو وہ عالم سے عذاب کی صفت کو ختم کر دیں گے، اس رحمت کے حکم کی وجہ سے جو ان کے قلوب میں راسخ ہو چکا ہے۔ اور اس صفت کا حامل میں اور میرے جیسے لوگ ہیں، اور ہم مخلوق ہیں، خواہشات اور اغراض والے ہیں۔ اور اس نے اپنی ذاتِ جلالہ کے بارے میں فرمایا کہ وہ ارحم الراحمین ہے، پس ہمیں شک نہیں کہ وہ اپنی مخلوق پر ہم سے زیادہ رحم کرنے والا ہے۔ اور ہم نے اپنے نفوس میں رحمت میں اس مبالغے کو جان لیا ہے، تو وہ ان پر عذاب کو کیسے ہمیشہ کے لیے رکھے گا جبکہ وہ رحمت کی اس عام صفت کا حامل ہے؟ بے شک اللہ اس سے زیادہ کریم ہے۔ خاص طور پر جب عقلی دلیل قائم ہو چکی ہے کہ باری تعالیٰ کو طاعات نفع نہیں دیتیں اور نہ ہی نافرمانیاں نقصان پہنچاتی ہیں، اور یہ کہ ہر چیز اس کے قضا و قدر اور حکم سے جاری ہے، اور یہ کہ مخلوق اپنے اختیار میں مجبور ہے۔ اور سمعی دلیل قائم ہو چکی ہے کہ اللہ صحیح حدیث میں فرماتا ہے: \"اے میرے بندو (يا عبادي)\"، پس اس نے انہیں اپنی ذات کی طرف منسوب کیا، اور اللہ نے کبھی بھی بندوں کو اپنی ذات کی طرف منسوب نہیں کیا مگر اس کے لیے جس کے لیے رحمت سبقت لے چکی ہو کہ ان پر شقاوت (بدبختی) کو غالب نہ کرے، اگرچہ وہ آگ میں داخل ہوں۔\n\nپس فرمایا: يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم اجتمعوا على أتقى قلب رجل واحد منكم ما زاد ذلك في ملكي شيئا (اے میرے بندو! اگر تمہارے اول و آخر، تمہارے انسان اور تمہارے جن، تم میں سے ایک آدمی کے سب سے متقی قلب پر جمع ہو جائیں، تو یہ میری بادشاہت میں کچھ بھی اضافہ نہیں کرے گا۔)\n\nپس اس نے اس چیز کی خبر دی جس پر عقل دلالت کرتی ہے کہ طاعات اور معاصی اس کی بادشاہت ہیں، اور وہ جیسا ہے ویسا ہی ہے، نہ بدلتا ہے اور نہ اس کی بادشاہت میں کوئی اضافہ یا کمی ہوتی ہے اس چیز سے جو اس پر وارد ہوتی ہے، کیونکہ سب کچھ اس کی ملکیت اور اس کی بادشاہت ہے۔\n\nپھر اس صحیح خبر کے تتمہ میں فرمایا: يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم قاموا في صعيد واحد وسألوني فأعطيت كل واحد منكم مسألته ما نقص ذلك من ملكي شيئا (اے میرے بندو! اگر تمہارے اول و آخر، تمہارے انسان اور تمہارے جن، ایک ہی میدان میں کھڑے ہو جائیں اور مجھ سے سوال کریں، اور میں تم میں سے ہر ایک کو اس کا سوال دے دوں، تو یہ میری بادشاہت میں کچھ بھی کمی نہیں کرے گا۔)\n\n(باقی حدیث) اور اس میں کوئی شک نہیں کہ ہر کوئی طبعاً اس چیز کو ناپسند کرتا ہے جو اسے تکلیف دیتی ہے، پس ہر کوئی اس سے سوال کرتا ہے کہ وہ اسے تکلیف نہ دے اور اسے چیزوں میں لذت عطا کرے۔ اور جو کچھ ہم نے اشارہ کیا ہے، اس میں اس حدیث میں اس کا قول قدح نہیں کرتا جب اس مسئلے میں جھگڑنے والا اس سے تعلق جوڑے، یعنی اس میں \"لو\" (اگر) کا داخل کرنا۔ کیونکہ عالم سے اس بارے میں سوال کا وقوع ہر مخلوق سے بالضرورة معلوم ہے، کیونکہ طبع اس کا تقاضا کرتی ہے، اور سوال قول اور حال دونوں طرح سے ہو سکتا ہے، جیسے دودھ پیتے بچے کا رونا، اگرچہ وہ حسی درد یا غرض کی مخالفت کے نفسیاتی درد کو نہ سمجھے جب اسے چھاتی سے روکا جائے۔ اور مسئلہ اپنا حق لے چکا ہے۔\n\nاور مردانِ حق کے قلوب پر جو احوال وارد ہوتے ہیں، وہ کثرت کی وجہ سے شمار نہیں کیے جا سکتے۔ اور ہم نے تمہیں اس باب میں ان کا ایک نمونہ دے دیا ہے۔ اور اسی اسلوب پر وہ احوال ہوں گے جو مردانِ حق سے منسوب ہیں۔ اور رہے احوال اپنی ذات میں، تو ان کا ہر چیز میں عام حکم ہے، اور ان کا ہر چیز میں دائمی وجود ہے۔ پس حال کا فعل دائم کہلاتا ہے اور قدیم اور محدث سے متعلق ہوتا ہے۔ اللہ تعالیٰ نے فرمایا: سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ (عنقریب ہم تمہاری طرف متوجہ ہوں گے، اے دو بھاری گروہ!) [الرحمن: 31]۔ پس یہ حال میں سے ہے، اگر تم جانتے ہو۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راہ دکھاتا ہے) [الأحزاب: 4]۔\n\nالفتوحات المکیہ کا بیسواں سفر مکمل ہوا۔",
    "fa": "«باب سیصد و پنجم در معرفت منزل ترادف احوال (الأحوال) بر قلوب (القلوب) مردان از حضرت محمدیه (الحضرة المحمدية)»\n\nحقایق حق (الحق) با اسماء و حال، *** جهان را از حالی به حال دیگر می‌گرداند.\nو این را جز دل‌ها (القلوب) درنمی‌یابند، و عقل را در آن میدانی نیست جز خستگی.\nگردش هستی (الوجود) با عقل مخالف است، پس برای عقل چیزی نیست جز قید و زنجیرها.\nعقل ذاتی را شهود (الشهود) می‌کند که از آن انتقال ندارد، در حالی که قلب تو در دگرگونی احوال (الأحوال) است.\nهمانا مظاهر، دگرگونی الهی برای ما در نفس اوست، و این نزد من عین گمراهی است.\n\n### [علم قوت، و آن تیراندازی با کمان است]\n\nبدان، خداوند تو را توفیق دهد، که این منزل حاوی علوم بسیاری است؛ از جمله علم قوت، که همان تیراندازی با کمان و ورود به آن، و گرفتن انگشتان بر زه و تیر، و چگونگی رها کردن، و نشانه گرفتن تیر، و مسابقه تیراندازی است. زیرا خداوند متعال به هیچ یک از ابزارهای جنگی به اندازه علم تیراندازی با کمان توجه نکرده است و آن را در این منزل، که مرتبه منازل است، با اسم قوی (الاسم القوي) برپا داشته است. و ما را در قرآن به آمادگی با آن امر فرموده و گفته است: **«وَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ»** (و هر چه در توان دارید از نیرو برای مقابله با آنان آماده سازید).\n\nو رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: **«ألا إن القوة الرمي ألا إن القوة الرمي ألا إن القوة الرمي»** (آگاه باشید که قوت، تیراندازی است؛ آگاه باشید که قوت، تیراندازی است؛ آگاه باشید که قوت، تیراندازی است).\n\nو آن را در این منزل بر چهار مرتبه قرار داده و برای اهل ذوق این منازل را به شهود (الشهود) آورده است، به حکمتی که اهل آن می‌دانند؛ تا انسان بداند چگونه فعل را به هدف می‌زند و تأثیر می‌گذارد، بدون مباشرت از اسم دور از این وصف. و از این علم، راز قدر بر تو آشکار می‌شود و اینکه چگونه بر خلایق حکم می‌کنی و چرا اصل آن باز می‌گردد، و دلیلی بر آن نیست جز تیراندازی با کمان، که روح «کُن» برای ایجاد و روح مشیت برای اعدام است. این منزل حاوی علم ارواح مدبر اجسام علوی و سفلی است، و حکم آن‌ها در اجسام نوری چیست؟ و حکم آن‌ها در اجسام نوری این است که به طور خاص در صور شکل می‌گیرند، همان‌طور که حکم آن‌ها در اجسام حیوانی انسانی، شکل‌گیری در قوه خیال (الخیالیة) است، به همراه احکام دیگر. زیرا اجسام نوری خیال ندارند، بلکه خودِ خیال هستند، و دگرگونی‌های صور آن‌ها از ارواح مدبرشان است. این علمی شریف است. همان‌طور که خیال انسان از صورت خالی نیست، ذات مَلَک نیز از صورت خالی نیست. این علمی شریف است که اسرار بسیاری را در بر دارد. و به دست این ارواح است تعیین اموری که حق (الحق) برای تمامی این اجسام می‌خواهد. پس انسان به تمامی امور حقی که در اوست، از حیث روح مدبرش، عالم است، در حالی که نمی‌داند که می‌داند. پس او به منزله کسی است که غافل و فراموشکار است، و احوال (الأحوال) و مقامات و منازل او را به یاد می‌آورند. و حکیم در تقسیم چهارگانه خود گفته است: او مردی است که می‌داند ولی نمی‌داند که می‌داند، پس او فراموشکار است، پس او را یادآوری کنید.\n\nدر این منزل، علم دو صیحه وجود دارد که با یکی از آن‌ها اهل سماع (جهان) مدهوش می‌شوند و با دیگری به هوش می‌آیند و به سوی پروردگارشان پناه می‌برند؛ که نفخه بعث و نفخه فزع نامیده می‌شود. و در آن علم قلوب (القلوب) و سرعت دگرگونی آن‌هاست. و در آن علم بصیرت و بصر است و آنچه بر هر یک از آن‌ها تجلی (التجلی) می‌کند. و در آن علم اعاده و چگونگی آن است، و چه چیزی از آن باز می‌گردد و چه چیزی باز نمی‌گردد. و در آن علم دور و کور است، و آیا این در صور است یا در اعیان حامل صور؟ و در آن علم اختصاص قیومیت (القيومية) به تبدیل است. و در آن علم کلام الهی است که با گوش شنیده می‌شود، نه با قلب (القلب) در مواد ثانوی. و در آن علم کبریا است که به طور خاص در ثقلین (جن و انس) وجود دارد، و چرا به آن‌ها اختصاص یافته نه به سایر موجودات؟ و آن حقیقت چیست که این را به آن‌ها داده است؟ و آیا در جن همان‌طور است که در انس است، یا سبب متفاوت است؟ به طوری که سبب آن در انسان، وجود او بر صورت کامل است، و در جن، از آتش بودن اوست. و انسان بر چه کسی تکبر می‌کند و جن بر چه کسی تکبر می‌کند؟ و در آن علم زوال این کبریا از دو جهان است.\n\nو در آن علم اعجاز و تفاوت امر معجز است، و چه چیزی از آن باقی می‌ماند و چه چیزی باقی نمی‌ماند؟ و آیا حدی دارد که به آن منتهی شود یا خیر؟ و چرا باز می‌گردد؟ آیا به صرف (خالص بودن) است یا به غیر صرف؟ و اگر به صرف است، آیا اگر زمان ادعا در عین آن فعل سپری شود و مجلس جدا شود، آیا منازع می‌تواند آن را بیاورد؟ و اگر آورد، آیا در ادعای اولِ تحدی‌کننده خدشه وارد می‌کند یا خیر؟ و در آن علم سبب بازدارنده از رجوع به حق (الحق) پس از علم به آن است، و آیا آن علم است یا علم نیست؟ و در آن علم چیزی است که فرارکننده از آنچه او را می‌ترساند به سوی آن می‌گریزد، و به کجا می‌گریزد با علم به اینکه آنچه از آن می‌گریزد، به سوی آن فرار می‌کند؟ پس چه چیزی او را به حرکت درمی‌آورد و با وجود این علم، او را به فرار می‌خواند؟ و در آن علم اعتبار است، و اهل آن کیستند؟ و چرا خداوند آن را در عالم قرار داد و به آن امر کرد؟ و مطلوب از آن چیست؟ و در آن علم خلق است، و چرا خلق شد؟ آیا به خاطر انسان یا به خاطر حیوان یا به خاطر هر دوی آن‌ها؟\n\nو در آن علم آخرت و آنچه در موقف (محشر) است، و علم بهشت و دوزخ، و علم صفاتی است که هر یک از آن‌ها را می‌طلبد. و در آن اباحه تشریع برای انسان است، به امر و نهی در نفس خود، نه در غیر خود. و اینکه اگر با آنچه نفسش امر یا نهی می‌کند مخالفت کند، مجازات می‌شود یا آمرزیده می‌شود، همانند حکم شارع. و از کدام حضرت این امر برای او صحیح شده است؟ و آیا برای آن ذوقی در نبوت (النبوة) هست یا نبوتی خاص است، نه نبوت محجوره انبیاء؟ و در آن علم منتهای قیامت است. و در آن علم درنوردیدن زمان است. این‌ها تمامی آن چیزی است که این منزل از انواع علوم در بر دارد، و زیر هر جنس از علوم، انواع آن بر حسب تقسیماتی است که هر جنس و نوع از آن می‌دهد. پس بگذارید یک مسئله یا آنچه میسر شود را ذکر کنیم، همان‌طور که در هر منزل عمل کردیم. و خداوند مؤید و نگهدار است، پروردگاری جز او نیست.\n\nاز جمله احوالی (الأحوال) که این منزل در بر دارد، حال انسان قبل از گرفتن میثاق از اوست، و آن حالی است که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در آن بود، هنگامی که به نبوت خود قبل از خلقت آدم (علیه السلام) معرفت یافت. و این در خبر از ایشان (صَلَّى اللهُ عَليهِ وسَلَّم) وارد شده است که فرمود: **«كنت نبيا وآدم بين الماء والطين»** (من پیامبر بودم در حالی که آدم میان آب و گِل بود).\n\nپس تعریف نبوت در آن حالت برای او بود. و این بدان سبب است که این نشأت انسانی در عناصر و مراتب آن پراکنده بود تا زمان مرگش، که بر آن در وجود اعیان اجسامشان معلوم و معین است، در امری که در آسمان‌ها به ودیعه نهاده شده است. برای هر حالتی از احوال او که در دنیا دگرگون می‌شود، صورتی در فلک بر آن حالت وجود دارد. خداوند دیدگان فرشتگان را از شهود (الشهود) آن باز داشته است، در حالی که نزد خداوند در غیبتی معین برای او سبحانه پوشیده است، و آسمان‌ها با وجود اینکه در آن‌هاست، از آن خبر ندارند. و خداوند وجود عین آن را در عالم دنیا در حرکات آن افلاک قرار داده است.\n\nپس برخی از مردم در آن موطن، شهود (الشهود) نفس و مرتبه خود را دریافتند، یا بر غایات کامل آن، یا صورتی از صور را شهود کردند که عین آن مرتبه برای او در زندگی دنیاست، پس آن را می‌شناسد و بر اساس آن بر نفس خود حکم می‌کند. و در اینجا رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) نبوت خود را مشاهده کرد. و ما نمی‌دانیم که آیا صورت تمامی احوال خود را مشاهده کرد یا خیر، و خداوند داناتر است. خداوند متعال می‌فرماید: **«وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا»** (و در هر آسمانی امر آن را وحی کرد). و این از امر و شأن آن است که این صورت را تا رسیدن وقتش حفظ کند، پس مراتب آن را در زندگی دنیا، آن صورت فلکی به او می‌دهد، بدون اینکه چیزی از آن را از دست بدهد. **«ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ»** (این تقدیر خدای عزیز و داناست).\n\nو این صور همگی در افلاک نه‌گانه موجودند، مانند وجود یک صورت واحد در آینه‌های متعدد با اشکال مختلف از طول و عرض و راستی و کجی و گردی و چهارگوش و سه‌گوش و کوچکی و بزرگی. پس صور اشکال با اختلاف محل تجلی (التجلی) متفاوت می‌شوند، در حالی که عین (حقیقت) یکی است. آن صور مراتب بر آن عین حکم کردند، همان‌طور که اشکال آینه‌ها بر صورت حکم کردند. عارف کسی است که ذات خود را برای ذات خود بشناسد، بدون محل تجلی (التجلی). و اگر چنین باشد، مراتب در او تأثیر نمی‌گذارند، هنگامی که به آن‌ها دست یابد، چنانکه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود، در حالی که در مرتبه علیا بود: **«أنا سيد ولد آدم ولا فخر»** (من سرور فرزندان آدم هستم و فخری نیست).\n\nپس مرتبه در او حکم نکرد. و در هر زمان که در مرتبه رسالت و خلافت بود، می‌فرمود: **«إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ»** (من جز بشری مانند شما نیستم). پس مرتبه او را از معرفت (المعرفة) نشأت خود محجوب نساخت. و سبب آن این است که او لطیفه خود را دید که به مرکب عنصری‌اش می‌نگرد، در حالی که در آن پراکنده است. پس ذات عنصری خود را مشاهده کرد و دانست که تحت نیروی افلاک علوی است. و مشارکت میان آن و سایر خلق انسانی، حیوانی، گیاهی و معدنی را دید. پس برای خود، از حیث نشأت عنصری‌اش، فضیلتی بر هر کس که از آن متولد شده ندید، و اینکه او مانند آن‌هاست و آن‌ها مانند او هستند. پس فرمود: **«إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ»**. سپس نیاز خود را به آنچه نشأت او با آن برپا می‌ماند، یعنی غذای طبیعی، مانند سایر مخلوقات طبیعی دید. پس نفس خود را شناخت.\n\nپس فرمود: «ای ابوبکر، چه چیزی تو را بیرون آورد؟» گفت: گرسنگی. فرمود: «و مرا نیز گرسنگی بیرون آورد.» پس از دو سنگی که بر شکم خود نهاده بود تا روده‌هایش را محکم کند، پرده برداشت. و از گرسنگی به خدا پناه می‌برد و می‌گفت: «آن بد همخوابه‌ای است.»\n\nپس دانستی که قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم): **«كنت نبيا وآدم بين الماء والطين»** (من پیامبر بودم در حالی که آدم میان آب و گِل بود)، تنها با زبان آن صورتی بود که از جمله صور مراتب در آن قرار داشت. پس در این دنیا برای ما از آن صورت ترجمه کرد. این از احوال خلق است. و ما صور دیگری نیز فراتر از این داریم که ذکر نکردیم، زیرا از قول شارع یا دلیلی عقلی که به آن تکیه کنیم تا تو را به آن‌ها بشناسانیم، آسودگی خاطر نداریم. پس از آن‌ها سکوت کردیم. وگرنه ما صورتی در کرسی، و صورتی در عرش، و صورتی در هیولی، و صورتی در طبیعت، و صورتی در نفس، و صورتی در عقل داریم، که از آن‌ها به لوح و قلم تعبیر می‌شود. و صورتی در عماء (العماء) و صورتی در عدم (العدم) داریم. و تمامی این‌ها برای خداوند متعال معلوم، مرئی و مبصر است. و اوست که خطاب خداوند به سوی او متوجه می‌شود، هنگامی که اراده کند مجموع ما را در دنیا با «کُن» ایجاد کند. پس ما می‌شتابیم و به خروج از حضرت عدم (العدم) به حضرت هستی (الوجود) پاسخ می‌دهیم، و به هستی رنگ می‌گیریم. و این همان قول خداوند متعال است: **«صِبْغَةَ اللَّهِ وَمَنْ أَحْسَنُ مِنَ اللَّهِ صِبْغَةً وَنَحْنُ لَهُ عَابِدُونَ»** (رنگ خدا؛ و چه کسی رنگش نیکوتر از خداست؟ و ما او را پرستش می‌کنیم)، یعنی خوار و خاضع هستیم. و ما در هر آنچه ذکر کردیم، حالی داریم که در آن مقام با آن متمایز می‌شویم، و حال ما عین صورت ما در آن است. پس ملک خداوند چه گسترده و چه عظیم است! و هر آنچه ذکر کردیم در جنب خداوند هیچ است.\n\nو از جمله احوالی (الأحوال) که بر قلوب (القلوب) ما وارد می‌شود، حال بودن ما در میثاقی است که پروردگارمان از ما گرفت. خداوند متعال می‌فرماید: **«وَإِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ ذُرِّيَّتَهُمْ وَأَشْهَدَهُمْ عَلَى أَنْفُسِهِمْ أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَى»** (و هنگامی که پروردگارت از پشت‌های بنی آدم، ذریه آن‌ها را گرفت و آن‌ها را بر خودشان گواه گرفت که آیا من پروردگار شما نیستم؟ گفتند: بله). تو پروردگار ما هستی. پس اگر تو نبودی، ما وجودی در صورت آدم عنصری، معین، مرئی و متمایز نزد خداوند در علم و رؤیت او نداشتیم. و نزد ماست آنچه گفتیم: بله، تو پروردگار ما هستی. پس توجه را برای او خالص کردیم. و چگونه خالص نکنیم در حالی که ما در قبضه او هستیم، مشاهده عین محصورین. و **«وَاللَّهُ بِكُلِّ شَيْءٍ مُحِيطٌ»** (و خداوند بر هر چیزی احاطه دارد).\n\n### [همانا خداوند هنگامی که آدم (علیه السلام) را ایجاد کرد، در صورت او صورتی قرار داد، همان‌طور که در مخلوقات پیشین انجام داده بود]\n\nپس بدان که هنگامی که خداوند آدم (علیه السلام) را ایجاد کرد و او را سامان داد، همان‌طور که افلاک و تمامی حضراتی را که ذکر کردیم سامان داد، برای ما در صورت او صورتی قرار داد، همان‌طور که در مخلوقات پیشین انجام داده بود. سپس آن صور معین را از پشت آدم گرفت، در حالی که آدم نمی‌دانست چه چیزی را در بر دارد، همان‌طور که هر صورت ما در هر فلک و مقام، آن فلک و آن مقام از آن خبر ندارد. و همانا حق (الحق) در هر صورت ما، وجه خاصی به سوی او دارد. از آن وجه با ما خطاب می‌کند و از آن وجه به او پاسخ می‌دهیم و از آن وجه به ربوبیت او اقرار می‌کنیم. پس اگر ما را از پیش روی آدم می‌گرفت، می‌دانست. پس گرفتن از پشت او بود، زیرا پشت او برای او غیب بود. و گرفتن او نیز با ما در این میثاق از پشت او بود، زیرا او با ما صورتی در صورت خود دارد. پس شهود (الشهود) کرد همان‌طور که ما شهود کردیم، و نمی‌داند که از او گرفته شده است، یا شاید می‌دانست. زیرا ما یقین نداریم که او ندانسته که از او گرفته شده است و ما از او گرفته شده‌ایم. اما چون دیدیم که حضرات پیشین از صور ما در خود خبر ندارند، گفتیم شاید امر در اینجا نیز چنین باشد. پس خداوند رحمت کند بنده‌ای را که بر علم به این امر وقوف یابد که آیا آدم دانست یا ندانست.\n\nپس این را در این موضع از کتاب ملحق کن، اگر آنچه از شمارش صور ذکر کردیم، از فهم تو دور شد.\n\nدر خبر مشهور، حسن و غریب وارد شده است که خداوند بر آدم (علیه السلام) تجلی (التجلی) کرد در حالی که دستانش بسته بود. پس به او فرمود: «ای آدم، هر کدام را که می‌خواهی انتخاب کن.» گفت: «دست راست پروردگارم را انتخاب کردم، و هر دو دست پروردگارم دست راست مبارک است.» فرمود: «پس آن را گشود، و ناگهان آدم و ذریه‌اش بودند.» پس به شخصی از نورانی‌ترین آن‌ها نگریست و گفت: «این کیست ای پروردگار؟» خداوند به او فرمود: «این پسرت داود است.» گفت: «ای پروردگار، چقدر برای او نوشتی؟» فرمود: «چهل سال.» گفت: «ای پروردگار، و چقدر برای من نوشتی؟» خداوند فرمود: «هزار سال.» گفت: «ای پروردگار، شصت سال از عمرم را به او بخشیدم.» خداوند به او فرمود: «تو و آن.» پس پیوسته برای خود شمرد تا به نهصد و چهل سال رسید. پس ملک‌الموت آمد تا روح او را قبض کند. آدم به او گفت: «شصت سال برای من باقی مانده است.» پس خداوند به آدم وحی کرد: «ای آدم، تو آن را به پسرت داود بخشیدی.» پس آدم انکار کرد و ذریه‌اش انکار کردند، و آدم فراموش کرد و ذریه‌اش فراموش کردند. رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: **«فمن ذلك اليوم أمر بالكتاب والشهود»** (پس از آن روز به نوشتن و گواهی دادن امر شد).\n\nاین آدم و ذریه‌اش، صورتی هستند که در دست راست حق (الحق) ایستاده‌اند. و این آدم خارج از آن دست است و صورت خود و صور ذریه‌اش را در دست حق (الحق) می‌بیند. پس چرا تو در این موضع آن را نزدیک می‌دانی و بر ما انکار می‌کنی؟ اگر این امر ذاتاً محال بود، واقع نمی‌شد و نسبت به حقایق (الحقائق) نیز جایز نبود، زیرا حقایق دگرگون نمی‌شوند. پس این را بدان. و من تا جایی که بتوانم برای تو انس بیشتری ایجاد می‌کنم. پس از کسانی مباش که خداوند درباره آن‌ها فرمود: **«صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَرْجِعُونَ»** (کرانند، گنگانند، کورانند، پس باز نمی‌گردند)؛ **«صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَعْقِلُونَ»** (کرانند، گنگانند، کورانند، پس تعقل نمی‌کنند).\n\nو خداوند صور را از پشت آدم گرفت، در حالی که آدم در میان آن‌ها بود، و **«وَأَشْهَدَهُمْ عَلَى أَنْفُسِهِمْ»** (و آن‌ها را بر خودشان گواه گرفت) در محضر ملأ اعلی و صورتی که برای آن‌ها در هر محل تجلی (التجلی) بود: **«أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَى»** (آیا من پروردگار شما نیستم؟ گفتند: بله). پس هر کس از کسانی که ذکر کردیم حاضر بود، بر نطق آن‌ها به اقرار ربوبیت او بر آن‌ها و عبودیت آن‌ها برای او گواهی داد. اگر برای او شریکی در میان آن‌ها بود، به طور مطلق به ملک او اقرار نمی‌کردند، زیرا آن موضع حق (الحق) به خاطر شهادت (الشهادة) است. پس نفسِ مطلق گفتن آن‌ها به ملک او که پروردگارشان است، عین نفی شریک است. و ما این را گفتیم زیرا در اینجا اصلاً لفظی برای توحید (التوحيد) جاری نشد، اما معنا آن را اقتضا می‌کند.\n\nو چون مرگ سبب پراکندگی مجموعه و جدایی اتصالات و پریشانی جمع است، این جدایی که به این منزله است، مرگ نامیده شد. پس خداوند متعال می‌فرماید: **«كَيْفَ تَكْفُرُونَ بِاللَّهِ وَكُنْتُمْ أَمْوَاتًا فَأَحْيَاكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ»** (چگونه به خدا کفر می‌ورزید در حالی که مردگان بودید و او شما را زنده کرد، سپس شما را می‌میراند، سپس شما را زنده می‌کند). یعنی در هر جزئی از عالم طبیعت متفرق بودید، پس شما را جمع کرد و زنده کرد. سپس شما را می‌میراند، یعنی شما را متفرق باز می‌گرداند، در حالی که ارواح شما از صور اجسامتان جدا شده‌اند. سپس شما را به زندگی دنیا زنده می‌کند، **«ثُمَّ إِلَيْهِ تُرْجَعُونَ»** (سپس به سوی او بازگردانده می‌شوید) پس از جدایی از دنیا.\n\nو خداوند در روز قیامت بندگانش را به آنچه بر خودشان در گرفتن میثاق گواهی دادند، یادآوری خواهد کرد. پس می‌گویند: **«رَبَّنَا أَمَتَّنَا اثْنَتَيْنِ وَأَحْيَيْتَنَا اثْنَتَيْنِ فَاعْتَرَفْنَا بِذُنُوبِنَا فَهَلْ إِلَى خُرُوجٍ مِنْ سَبِيلٍ»** (پروردگارا، ما را دو بار میراندی و دو بار زنده کردی، پس به گناهانمان اعتراف کردیم، آیا راهی برای خروج هست؟). یعنی همان‌طور که دو بار زندگی پس از مرگ و مرگی پس از زندگی را پذیرفتیم، محال نیست که آن را بارها بپذیریم. پس از خداوند خواستند که بر آن‌ها منت نهد و به دنیا بازگردند تا عملی انجام دهند که دار نعیم را برایشان به ارث بگذارد. و هنگامی که این را گفتند، مدت مقدر برای عذابشان سپری نشده بود. و چون خداوند مقدر کرده بود که آن‌ها اهل آتش باشند و در علم خداوند خانه‌ای جز آتش برای آبادانی ندارند، خداوند متعال فرمود: **«وَلَوْ رُدُّوا لَعَادُوا لِمَا نُهُوا عَنْهُ»** (و اگر بازگردانده شوند، به آنچه از آن نهی شده‌اند باز می‌گردند) تا با استحقاق مخالفت وارد آتش شوند، تا زمانی که سبقت رحمت بر غضب آشکار شود. پس در آتش جاودانه می‌مانند و هرگز از آن خارج نمی‌شوند، بر حالتی که خداوند خواسته است آن‌ها را بر آن بدارد. و در آنجا خداوند ذریه را به صلب‌های پدران باز می‌گرداند تا زمانی که خداوند آن‌ها را به زندگی دنیا بر آن فطرت خارج کند. پس صلب‌ها قبور آن‌ها بود تا روزی که از شکم مادرانشان و از دنده پدرانشان در زندگی دنیا برانگیخته شوند. سپس هر کس را که خداوند بخواهد از آن‌ها می‌میرد، سپس در روز قیامت برانگیخته می‌شود، همان‌طور که وعده داده است. و اصحاب ما در مورد اعاده اختلاف کرده‌اند که آیا بر صورت آنچه ما را در دنیا ایجاد کرد، از تناسل شخص از شخص، باز می‌گردند، چنانکه فرمود: **«كَمَا بَدَأَكُمْ تَعُودُونَ»** (همان‌طور که شما را آغاز کرد، باز می‌گردید)، با جماع و حمل و ولادت در یک آن برای همه، که این مذهب ابوالقاسم بن قسی است؛ یا روح به جسم باز می‌گردد، که این مذهب جماعت است. و خداوند داناتر است.\n\n### [احوال فطرت که خداوند خلق را بر آن آفرید]\n\nو بدان که از جمله احوالی (الأحوال) که در این باب مادر (اصلی) هستند، این است که تفصیل احوال از کثرت قابل شمارش نیست، اما ما از آن‌ها احوالی را ذکر می‌کنیم که به منزله مادران هستند. از جمله آن‌ها احوال فطرت است که خداوند خلق را بر آن آفرید، و آن این است که جز خدا را نپرستند. پس بر آن فطرت در توحید (التوحيد) خداوند باقی ماندند. پس نام دیگری را که خدا باشد، با خدا قرار ندادند، بلکه خدایانی را به طریق تقرب به خدا قرار دادند. و به همین دلیل فرمود: **«قُلْ سَمُّوهُمْ»** (بگو آن‌ها را نام ببرید). زیرا اگر آن‌ها را نام ببرند، آشکار می‌شود که جز خدا را نپرستیده‌اند. پس هیچ پرستنده‌ای جز خدا را نپرستیده است، در محلی که الوهیت را به آن نسبت داده است. پس بقای توحید (التوحيد) برای خدا که در میثاق به آن اقرار کردند، صحیح است و فطرت همراه است. و سبب نسبت دادن الوهیت به این صور پرستیده شده این است که حق (الحق)، هنگامی که در گرفتن میثاق بر آن‌ها تجلی (التجلی) کرد، در مظهری از مظاهر الهی بر آن‌ها تجلی کرد. پس این همان چیزی است که آن‌ها را بر پرستش او در صور جسور ساخت. و از قوت بقای آن‌ها بر فطرت این است که آن‌ها در حقیقت او را در صور نپرستیدند، بلکه صور را پرستیدند به خاطر مرتبه تقربی که در آن‌ها تصور کردند، مانند شفیعان. و این دو حقیقت، همان‌هایی هستند که خلق در سرای آخرت به سوی آن‌ها متمایل می‌شوند.\n\nو آن دو، شفاعت و تجلی (التجلی) در صور به طریق تحول هستند. پس هنگامی که این حال در قلب (القلب) مرد جای گرفت و از علم الهی دانست که چه چیزی این افراد را که صفتشان این است، فراخوانده است و اینکه آن‌ها تحت قهر چیزی هستند که به سوی آن باز می‌گردند، در تاریکی‌ها به سوی خدا تضرع می‌کنند و در حق خود برای او تملق می‌گویند و از او می‌خواهند که آن‌ها را در رحمت خود داخل کند، هنگامی که انتقام حد خود را از آن‌ها گرفت، و اگرچه آن‌ها آبادکنندگان آن خانه باشند، برای آن‌ها در آن نعمتی قرار دهد، زیرا آن‌ها از جمله چیزهایی بودند که رحمت عامه آن‌ها را فرا گرفته است. و حاشا از جناب الهی از تقیید، در حالی که اوست که می‌گوید رحمتش بر غضبش سبقت گرفته است. پس غضب به عدم ملحق شد. و اگر چیزی باشد، تحت احاطه رحمت واسعه الهی است. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: **«إن الأنبياء صَلَّى اللهُ عَليهِ وسَلَّم تقول يوم القيامة إذا سألوا في الشفاعة إن الله قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله»** (همانا انبیاء (صَلَّى اللهُ عَليهِ وسَلَّم) در روز قیامت، هنگامی که در مورد شفاعت از آن‌ها سؤال شود، می‌گویند: همانا خداوند امروز چنان غضبی کرده است که پیش از آن مانندش غضب نکرده و پس از آن نیز مانندش غضب نخواهد کرد).\n\nو این از امیدبخش‌ترین حدیث‌هایی است که در این باب نیز به آن اعتماد می‌شود.\n\n### [روز قیامت، روز برخاستن مردم از گورهایشان برای پروردگار جهانیان است]\n\nزیرا روزی که انبیاء به آن اشاره کردند، روز قیامت است. و روز قیامت، روز برخاستن مردم از گورهایشان برای پروردگار جهانیان است. خداوند متعال می‌فرماید: **«يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ»** (روزی که مردم برای پروردگار جهانیان برمی‌خیزند). و در آن روز، غضب از جانب خداوند بر اهل غضب خواهد بود، و حکم آن غضب، امر به ورود به آتش و فرود آمدن عذاب و انتقام از مشرکان و دیگر اقوامی است که با شفاعت خارج می‌شوند و کسانی که رحمان آن‌ها را خارج می‌کند، چنانکه در صحیح وارد شده است، و آن‌ها را وارد بهشت می‌کند، زیرا آن‌ها از اهل آتش که اهل آن هستند، نبودند. و در آتش جز اهل آن که اهل آن هستند، باقی نمی‌مانند.\n\nپس امر به ورود به آتش، شامل هر کس که وارد آن شود، از اهل آن و غیر اهل آن، به خاطر آن غضب الهی است که پس از آن مانندش غضب نخواهد کرد. پس اگر عذاب بر آن‌ها جاودانه می‌شد، این از غضبی بزرگ‌تر از غضب امر به ورود به آن بود. و انبیاء گفتند که خداوند پس از آن مانند آن غضب، غضب نخواهد کرد. و حکم او با عظمت آن غضب، جز امر به ورود به آتش نبود. پس ناگزیر حکم رحمت بر همگان جاری است. و تعریف شارع با قولش: «و اما اهل آتش که اهل آن هستند» کافی است، و نگفت «اهل عذاب». و لازم نیست کسی که از اهل آتش است و آن را آباد می‌کند، با آن معذب باشد. زیرا اهل و آبادکنندگان آن، مالک و خزانه‌داران آن هستند، و آن‌ها فرشتگانند، و آنچه در آن است از حشرات و مارها و غیر آن از حیواناتی که در روز قیامت برانگیخته می‌شوند. و هیچ یک از آن‌ها آتش برایش عذاب نخواهد بود. همچنین کسانی که در آن باقی می‌مانند، در آن نمی‌میرند و زنده نمی‌شوند. و هر کس به موطن خود انس گیرد، در آن شادمان است. و سخت‌ترین عذاب، جدایی از وطن است. پس اگر اهل آتش از آن جدا شوند، به خاطر غریب شدن از آنچه برای آن مهیا شده‌اند، عذاب می‌بینند. و خداوند آن‌ها را بر نشأتی آفریده است که با آن موطن انس می‌گیرند. پس هر دو خانه آباد شد و رحمت بر غضب سبقت گرفت و جهنم و هر کس در آن است، همه چیز را فرا گرفت. و خداوند مهربان‌ترین مهربانان است، چنانکه خود درباره خویش فرموده است.\n\nو ما در نفوس خود از کسانی که خداوند آن‌ها را بر رحمت سرشته است، یافتیم که به تمامی بندگان خدا رحم می‌کنند، حتی اگر خداوند آن‌ها را حاکم بر خلق خود می‌کرد، صفت عذاب را از عالم برمی‌داشتند، به سبب تمکن حکم رحمت در قلوبشان (القلوب). و صاحب این صفت من و امثال من هستیم، در حالی که ما مخلوق و دارای هواها و اغراض هستیم. و او جل علاه درباره خود فرموده است که او مهربان‌ترین مهربانان است. پس شک نداریم که او بر خلقش از ما مهربان‌تر است. و ما این مبالغه در رحمت را از نفوس خود شناخته‌ایم، پس چگونه عذاب بر آن‌ها جاودانه می‌شود، در حالی که او دارای این صفت عام رحمت است؟ همانا خداوند گرامی‌تر از آن است. به ویژه که دلیل عقلی بر این امر قائم شده است که طاعات به حال باری تعالی سودی نمی‌رساند و مخالفت‌ها به او ضرری نمی‌زند، و اینکه هر چیزی به قضا و قدر و حکم او جاری است، و خلق در اختیار خود مجبورند. و دلیل سمعی قائم شده است که خداوند در صحیح می‌فرماید: **«يا عبادي»** (ای بندگان من)، پس آن‌ها را به خود اضافه کرد. و خداوند هرگز بندگان را به خود اضافه نکرده است، مگر کسانی که رحمت بر آن‌ها سبقت گرفته است که شقاوت را بر آن‌ها تأیید نکند، حتی اگر وارد آتش شوند.\n\nپس فرمود: **«يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم اجتمعوا على أتقى قلب رجل واحد منكم ما زاد ذلك في ملكي شيئا»** (ای بندگان من، اگر اولین و آخرین شما و انسان‌ها و جنیان شما بر پرهیزگارترین قلب یک مرد از شما جمع شوند، این چیزی بر ملک من نمی‌افزاید).\n\nپس به آنچه عقل بر آن دلالت دارد، خبر داد که طاعات و معاصی ملک اوست و او بر همان حالتی است که هست و ملک او تغییر نمی‌کند و زیاد و کم نمی‌شود از آنچه بر آن عارض شده و در آن است، زیرا همه ملک او و ملکیت اوست.\n\nسپس در ادامه این خبر صحیح فرمود: **«يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم قاموا في صعيد واحد وسألوني فأعطيت كل واحد منكم مسألته ما نقص ذلك من ملكي شيئا»** (ای بندگان من، اگر اولین و آخرین شما و انسان‌ها و جنیان شما در یک سرزمین بایستند و از من درخواست کنند، و من به هر یک از شما خواسته‌اش را بدهم، این چیزی از ملک من کم نمی‌کند).\n\nحدیث. و شکی نیست که هیچ کس نیست مگر اینکه طبعاً از آنچه او را آزار می‌دهد، کراهت دارد. پس هیچ کس نیست مگر اینکه از او خواسته است که او را آزار ندهد و به او لذت در اشیاء بدهد. و آنچه ما به آن اشاره کردیم، با قول او در حدیث که منازع در این مسئله به آن تمسک می‌جوید، یعنی وارد کردن «لو» در آن، خدشه وارد نمی‌کند. زیرا وقوع سؤال از عالم در این مورد، به ضرورت از هر مخلوقی معلوم است، چرا که طبع آن را اقتضا می‌کند. و سؤال ممکن است قولی و حالی باشد، مانند گریه کودک شیرخوار، حتی اگر هنگام وجود درد حسی یا درد نفسانی به دلیل مخالفت با غرض، هنگامی که از پستان منع می‌شود، تعقل نکند.\n\nو مسئله حق خود را گرفت. و احوالی (الأحوال) که بر قلوب (القلوب) مردان وارد می‌شود، از کثرت قابل شمارش نیست. و ما در این باب نمونه‌ای از آن را به تو دادیم. و احوال منسوب به مردان بر این سبک است. اما احوال (الأحوال) در نفس خود، حکم عام در هر چیزی دارند و وجود دائم در هر چیزی دارند. و فعل حال، دائم نامیده می‌شود و به قدیم و حادث تعلق می‌گیرد. خداوند متعال می‌فرماید: **«سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ»** (به زودی به حساب شما می‌پردازیم، ای دو گروه جن و انس). این از حال است، اگر بدانی. و **«وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ»** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند). سفر بیستم از فتوحات مکیه به پایان رسید."
  },
  "page_count": 6
}