{
  "id": 75,
  "title": {
    "ar": "الباب الخامس والسبعون في ترك التوبة",
    "en": "Chapter Seventy-Five: On the Abandonment of Repentance.",
    "ur": "پچھترواں باب: توبہ کو ترک کرنے کے بیان میں",
    "fa": "باب هفتاد و پنجم در ترک توبه"
  },
  "content": {
    "ar": "## (الباب الخامس والسبعون في ترك التوبة)\n\n\n> متى خالفته حتى تتوب *** فترك التوب يؤذن بالشهود\n\n\n> فقل للتائبين لقد حجبتم *** عن إدراك الحقائق بالورود\n\n\n> فممن أو إلى من قد رجعتم *** وليس سوى المسود والمسود\n\n\n> فمن عين الذي قد جئت منه *** إليه به ومن عين العبيد\n\n\n> وأسماء الإله هي التي لم *** تزل موصوفة بسنا الوجود\n\n\n### [لا يتوب إلا من لا يشعر ولا يبصر القرب الإلهي‏]\n\n\nاعلم وفقك الله أنه من كان صفته وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ وهو بِكُلِّ شَيْ‏ءٍ مُحِيطٌ وأَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏ والَّذِي يَراكَ حِينَ تَقُومُ ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ فلا يتوب إلا من لا يشعر ولا يبصر هذا القرب والشعور علم إجمالي قطعي إن ثم مشعورا به لكن لا يعلم ما هو ذلك المشعور به فالعلم بالله شعور والشعور لا علم بما هو عليه المشعور به وعلمه بنا ليس كذلك فلا يصرف العبد معناه إلى معنى إلا والحق في الصارف والمصروف والصرف فإلى أين أتوب إن نادى فهو المنادي لأنه لا ينادي إلا من يسمع وهو سمعك فلا تسمع إلا به فما فقدته في ندائه إياك هذا حد العلم الصحيح ولهذا لم يأمر بالتوبة إلا المؤمنين فقال وتُوبُوا إِلَى الله جَمِيعاً أَيُّهَا الْمُؤْمِنُونَ بغير ألف لحكمة أخفاها يعرفها العالم ولا يشعر بها المؤمن فهي بالألف هاء التنبيه إذا قال أيها المؤمنون وهي بغير الألف هي هويته قرأها الكسائي برفع هاء أيه وحذف الواو لالتقاء الساكنين يقول هو المؤمنون لأنه المؤمن وما يسمع‏\nنداء الحق إلا بالحق والسامع مؤمن والسامعون كثيرون فهو المؤمنون فترك التوبة ترك الرجوع لأنه قال ارْجِعُوا وَراءَكُمْ لمن كان في ظلمة كونه فَالْتَمِسُوا نُوراً انظروا إلى موجدكم وهو النور الذي به الظهور فإذا رأيتم النور كشف لكم عنكم فعلمتم أنه أقرب إليكم مِنْكُمْ ولكِنْ لا تُبْصِرُونَ لعدم النور\n\n\n### [ما تاب من تاب ولكن الله تاب‏]\n\n\nفلما حصلت لهم المعرفة هنا بهذا القدر لم تصح منهم توبة عندهم أنهم تائبون فَتابَ عَلَيْهِ فكان هو التائب على الحقيقة والعبد محل ظهور الصفة ولذلك قال لِيَتُوبُوا ثم قال إِنَّ الله هُوَ التَّوَّابُ وهو لفظ المبالغة إذ كانت له التوبة الأولى من قوله ثُمَّ تابَ عَلَيْهِمْ والثانية من قوله لِيَتُوبُوا فالتوبتان له من كل عبد فهو التواب لا هم وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ وهذا حكم سار في جميع أفعال العباد فما تاب من تاب ولكن الله تاب ولهذا قالت الجماعة التوبة ترك التوبة والتوبة من التوبة فنفيها إثباتها وإثباتها نفيها\n\n\n### [التوبة على مستوى الشريعة والتوبة على مستوى الحقيقة]\n\n\nفترك التوبة حال التبري من الدعوى فليست التوبة المشروعة إلا الرجوع من حال المخالفة إلى حال الموافقة أعني مخالفة أمر الواسطة إلى موافقة أمرها لا غير والتوبة من التوبة هي الرجوع منه إليه به فالتوبة من التوبة لها الكشف وما لها حجاب وصاحبها مسئول لأنه تبرأ من الدعوى بها أعني بالدعوى وكل مدع مطالب بالبرهان على صحة دعواه فالمكمل من يثبت التوبة حيث أثبتها الحق ولمن أثبتها ولا يعديها محلها فلها رجال يقومون بها ولها رجال يحكمون بها وهم عَنْها مُبْعَدُونَ لأنها حالة غربة وهم في الموطن الذي فيه ولدوا فلا غربة\n\n\n### [محبة الله للتائب هي كمحبة أهل الغائب إذا عاد إليهم الغائب‏]\n\n\nما يرجع إلى أهله إلا الغائب والغائب غريب فالغرباء هم التائبون فالمحبة من الله لهم محبة أهل الغائب إذا ورد عليهم غائبهم فمن كان من أهله مشاهدا له في حال غربته لم يفرح به لنفسه فإنه غير فاقد له وإنما فرحه به لفرحه برجوعه إلى موطنه فهو فرح موافقة كمحبة المحبوب لمحبه لأنها عين حبه لنفسه ولهذا يبغض من يبغضه لحبه لنفسه إِنَّ الله يُحِبُّ التَّوَّابِينَ إليه في كل حال من خلاف ووفاق فهو مقبول محبوب على كل حال وإذا كانت التوبة تحب لأجل الوصلة فالمتصل لا يتصل فهو أشد في المحبة وأعظم في اللذة وهو المعبر عنه بترك التوبة\n\n\n### [الأصل أنه لا رجوع وأن الأمر في مزيد]\n\n\nومن رأى أن الأمر الإلهي واتساع الحقيقة الربانية لا يدوم لها حال معين ولا ينبغي ولذلك هو كل يوم في شأن ولا يكرر فلا تصح توبة فإنها رجوع ولا يكون رجوع إلا من مفارقة لأمر يرجع إليه والحق على خلافه فلا رجوع فلا توبة وقوله وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ لما تغرب الأمر عند المحجوبين عن موطنه بما ادعوه فيه لنفوسهم قيل لهم إليه يرجع الأمر كله لو نظرتم لرأيتم من نسبتم إليه هذا الفعل منكم إنما هو الله لا أنتم وما الله بِغافِلٍ عَمَّا يَعْمَلُونَ من دعواكم إن الأمر إليكم وهو لله فالأصل إنه لا رجوع وأن الأمر في مزيد إلى ما لا نهاية له ولا إحاطة إذ لا نهاية لواجب الوجود فلا نهاية للممكنات إذ هو الخلاق دائما ولا يصح أن يزول عنه هذا الحكم لأنه ما لا يثبت نفيه إلا بإثباته فنفيه محال فكل باب من أبواب هذا الكتاب مما يقتضي ترك ما أثبتناه في الباب الذي قبله فهو كالذيل له فهو منه فنسوقه مختصرا لأنه لا يحتمل التطويل وهو فصل من فصول الباب الذي قبله فنقتصر في ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Seventy-Five: On Abandoning Repentance (في ترك التوبة)\n\nWhen did you oppose Him that you should repent?\nThus, abandoning repentance signifies Witnessing [of the Real] (الشهود).\n\nSo tell the repenters, 'You have been veiled\nFrom realizing the Realities (الحقائق) by [mere] arrival.\n\nFrom whom or to whom have you returned,\nWhen there is none but the Master and the mastered?\n\nFrom the very Essence (عين) from which you came,\nTo Him, by Him, and from the Essence of the servants (العبيد).\n\nAnd the Names [of] the God are those which have not\nCeased to be described by the splendor of Being (الوجود).\n\n### None Repents Except He Who Does Not Perceive or Witness the Divine Proximity\n\nKnow, may Allah grant you success, that He whose description is: <<He is with you wherever you are>>, and <<He encompasses all things>>, and <<Does he not know that Allah sees?>>, and <<Who sees you when you stand>>, and <<We are nearer to him than the jugular vein>>, and <<We are nearer to him than you, but you do not perceive>>—therefore, none repents except he who does not perceive (يشعر) or witness (يبصر) this Proximity (القرب).\n\nPerception (الشعور) is a definitive, general knowledge that there is something perceived, but one does not know what that perceived thing is. Thus, knowledge of Allah is perception, but perception is not knowledge of what the perceived thing truly is. And His Knowledge of us is not like that.\n\nThe servant does not turn his meaning toward a meaning except that the Real (الحق) is in the turner, the turned, and the turning. So, to where shall I repent? If He calls, He is the Caller, because none calls except one who hears, and He is your hearing, so you hear only by Him. You have not lost Him in His calling you. This is the limit of sound Knowledge (العلم الصحيح).\n\nFor this reason, He only commanded the believers to repent, saying: <<And turn to Allah all of you, O believers>> (وَتُوبُوا إِلَى الله جَمِيعاً أَيُّهَا الْمُؤْمِنُونَ) without the *alif* [in *ayyuhā*] due to a hidden wisdom known by the Gnostic (العالم) but not perceived by the believer. With the *alif*, it is the *hā’* of warning/attention when He says *ayyuhā al-mu’minūn*. Without the *alif*, it is His Ipseity (هويته). Al-Kisa’i read it by raising the *hā’* of *ayyihi* and omitting the *wāw* due to the meeting of two quiescent letters, meaning: He says, \"He is the believers,\" because He is the Believer, and the call of the Real (نداء الحق) is heard only by the Real. The hearer is a believer, and the hearers are many, so He is the believers.\n\nThus, abandoning repentance is abandoning return (الرجوع), because He said: <<Go back behind you>> to those who were in the darkness of their being, <<and seek light>>. Look toward your Originator, who is the Light (النور) by which manifestation occurs. When you see the Light, it unveils you from yourselves, and you know that He is <<nearer to you than yourselves, but you do not perceive>> due to the absence of Light.\n\n### None Repented Who Repented, But Allah Repented\n\nWhen Gnosis (المعرفة) was attained by them here to this degree, repentance was not valid from them, even though they believed themselves to be repenters. <<He turned toward him>> (فَتَابَ عَلَيْهِ), so He was the Repenter in reality, and the servant is merely the locus of the manifestation of the Attribute (الصفة).\n\nFor this reason, He said <<that they may repent>> (لِيَتُوبُوا), and then He said <<Indeed, Allah is the Acceptor of Repentance>> (إِنَّ الله هُوَ التَّوَّابُ), which is the intensive form, since the first repentance belonged to Him, from His saying <<Then He turned toward them>> (ثُمَّ تَابَ عَلَيْهِمْ), and the second from His saying <<that they may repent>>. Thus, both repentances belong to Him from every servant; He is the Acceptor of Repentance (التواب), not they.\n\n<<And you threw not when you threw, but Allah threw>>. This ruling applies to all the acts (أفعال) of the servants. Therefore, none repented who repented, but Allah repented. For this reason, the group [of Gnostics] said: Repentance is abandoning repentance, and repentance is repenting from repentance. Thus, its negation is its affirmation, and its affirmation is its negation.\n\n### Repentance on the Level of the Law and Repentance on the Level of the Reality\n\nThus, abandoning repentance is the state of disavowing the claim [of independent action] (الدعوى).\n\nThe prescribed repentance (التوبة المشروعة) is nothing but the return from the state of opposition to the state of conformity—meaning, opposition to the command of the intermediary (الواسطة) to conformity with its command, and nothing else.\n\nAnd repentance from repentance is the return from Him, to Him, by Him. Repentance from repentance possesses Unveiling (الكشف) and has no veil. Its practitioner is held accountable because he disavowed the claim [of independent action] by it—I mean, by the claim. And every claimant is required to provide proof of the validity of his claim.\n\nThe perfected one (المكمل) is he who affirms repentance where the Real (الحق) affirmed it, and for whom He affirmed it, and does not exceed its proper place. For it, there are men who perform it, and men who rule by it, and they are <<far removed from it>> (مُبْعَدُونَ) because it is a state of estrangement (غربة), and they are in the homeland where they were born, so there is no estrangement.\n\n### Allah’s Love for the Repenter is Like the Love of the Family of the Absent One When the Absent One Returns to Them\n\nNone returns to his family except the absent one, and the absent one is a stranger (غريب). Thus, the strangers are the repenters. Therefore, the love from Allah for them is the love of the family of the absent one when their absent one arrives back to them.\n\nBut whoever among His family was witnessing him (مشاهدا له) during his state of estrangement does not rejoice in him for his own sake, for he has not lost him. Rather, his joy in him is due to his joy in the repenter’s return to his homeland. This is a joy of conformity, like the love of the beloved for his lover, because it is the very essence of his love for himself. For this reason, He hates whoever hates Him, due to His love for Himself.\n\n<<Indeed, Allah loves those who turn in repentance>> (إِنَّ الله يُحِبُّ التَّوَّابِينَ) to Him in every state, whether of opposition or conformity. Thus, He is accepted and loved in every state. And if repentance is loved for the sake of connection (الوصلة), then the connected one does not connect [because he never separated]. This is more intense in love and greater in delight, and this is what is expressed by abandoning repentance.\n\n### The Fundamental Principle is That There is No Return and That the Matter is in Increase\n\nWhoever sees that the Divine Command (الأمر الإلهي) and the vastness of the Lordly Reality (الحقيقة الربانية) do not and should not remain in a fixed state—and for this reason, He is <<every day in [new] manifestation>> (كُلَّ يَوْمٍ فِي شَأْنٍ)—and He does not repeat Himself, then repentance is not valid, for it is a return (رجوع). And return only occurs after separation from a matter to which one returns. The Real (الحق) is contrary to this, so there is no return, and thus no repentance.\n\nAnd His saying <<And to Him the matter will be returned entirely>> (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ) [was said] because the matter became estranged (تغرب) among those veiled from its homeland by what they claimed for themselves within it. It was said to them: \"To Him the matter will be returned entirely.\" If you looked, you would see that the one to whom you attributed this action from yourselves is only Allah, not you. <<And Allah is not unaware of what you do>> (وَمَا الله بِغَافِلٍ عَمَّا يَعْمَلُونَ) of your claim that the matter belongs to you, when it belongs to Allah.\n\nThe fundamental principle (الأصل) is that there is no return, and that the matter is in increase (مزيد) toward that which has no end and no encompassment, since there is no end to the Necessary Being (واجب الوجود), and thus no end to the possibilities (الممكنات), for He is the perpetual Creator (الخلاق دائما). It is not valid for this ruling to cease from Him, because that whose negation cannot be established except by its affirmation—its negation is impossible.\n\nThus, every chapter (باب) of this book that necessitates abandoning what we established in the preceding chapter is like an appendix (الذيل) to it, and is part of it. We present it concisely because it does not bear elaboration, and it is a section of the preceding chapter’s sections. We shall be brief in this, and <<Allah speaks the Truth, and He guides to the Way>>.",
    "ur": "پچھترواں باب: توبہ کے ترک کے بارے میں\n\nتم نے کب اس کی مخالفت کی کہ توبہ کرو؟\nتوبہ کا ترک (ترك التوبة) شہود (الشهود) کی خبر دیتا ہے۔\nپس توبہ کرنے والوں سے کہو کہ تم تو ورود (حاضری) کے ذریعے حقائق (الحقائق) کے ادراک سے پردے میں ہو۔\nتم کس سے یا کس کی طرف لوٹے ہو؟\nجب کہ مسود (جسے سردار بنایا گیا) اور مسود (سردار) کے سوا کوئی نہیں۔\nپس تم جس کی عین (ذات) سے آئے ہو،\nاسی کی طرف، اسی کے ذریعے، اور بندوں کی عین (ذات) سے۔\nاور الٰہی اسماء (أسماء الإله) وہ ہیں جو ہمیشہ سے،\nہستی (الوجود) کی چمک سے موصوف ہیں۔\n\n### [توبہ صرف وہی کرتا ہے جو قرب الٰہی کو محسوس نہیں کرتا اور نہ دیکھتا ہے]\n\nجان لو، اللہ تمہیں توفیق دے، کہ جس کی صفت یہ ہو:\n**وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ** (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)\nاور وہ **بِكُلِّ شَيْ‏ءٍ مُحِيطٌ** (ہر چیز پر محیط ہے)\nاور **أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏** (کیا اسے معلوم نہیں کہ اللہ دیکھ رہا ہے؟)\nاور **الَّذِي يَراكَ حِينَ تَقُومُ** (اور وہ جو تمہیں دیکھتا ہے جب تم کھڑے ہوتے ہو)\nاور **وَنَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ** (اور ہم اس کی طرف شہ رگ سے بھی زیادہ قریب ہیں)\nاور **وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ** (اور ہم تمہاری نسبت اس سے زیادہ قریب ہیں لیکن تم دیکھتے نہیں)\nتو توبہ صرف وہی کرتا ہے جو اس قرب کو محسوس نہیں کرتا اور نہ دیکھتا ہے۔\n\nاور شعور (احساس) ایک اجمالی، قطعی علم ہے کہ وہاں کوئی محسوس کی جانے والی چیز ہے، لیکن وہ نہیں جانتا کہ وہ محسوس کی جانے والی چیز کیا ہے۔ پس اللہ کی معرفت (المعرفۃ) شعور ہے، اور شعور اس چیز کے بارے میں علم نہیں ہے کہ محسوس کی جانے والی چیز کس حالت پر ہے۔ اور اس کا ہم پر علم ایسا نہیں ہے۔\n\nپس بندہ اپنے معنی کو کسی معنی کی طرف نہیں پھیرتا مگر یہ کہ ذات حق (الحق) پھیرنے والے، جس کی طرف پھیرا گیا، اور پھیرنے کے عمل میں موجود ہے۔ تو میں کہاں توبہ کروں؟ اگر وہ پکارتا ہے، تو وہی پکارنے والا ہے، کیونکہ وہ صرف اسی کو پکارتا ہے جو سنتا ہے، اور وہ تمہاری سماعت ہے۔ پس تم اس کے بغیر نہیں سنتے۔ تو تم نے اسے اس کی پکار میں کھویا ہی نہیں۔ یہ صحیح علم کی حد ہے۔\n\nاور اسی لیے اس نے توبہ کا حکم صرف مومنین (المؤمنين) کو دیا، پس فرمایا: **وَتُوبُوا إِلَى الله جَمِيعاً أَيُّهَا الْمُؤْمِنُونَ** (اور تم سب اللہ کی طرف توبہ کرو اے مومنو) بغیر الف کے، ایک ایسی حکمت کے لیے جسے اس نے چھپا دیا، جسے عالم جانتا ہے اور مومن محسوس نہیں کرتا۔ پس الف کے ساتھ، جب وہ \"أيها المؤمنون\" کہتا ہے، تو یہ ہائے تنبیہ ہے۔ اور بغیر الف کے، یہ اس کی ہویت (Huwiyyah) ہے۔ کسائی نے اسے \"أيه\" کی ہاء کو رفع کے ساتھ اور واؤ کو دو ساکنوں کے ملنے کی وجہ سے حذف کر کے پڑھا ہے۔ وہ کہتا ہے: \"وہ مومنون ہیں\" کیونکہ وہ مومن ہے۔ اور ذات حق (الحق) کی پکار کو صرف ذات حق کے ذریعے ہی سنا جاتا ہے، اور سننے والا مومن ہے، اور سننے والے بہت ہیں، پس وہ مومنون ہے۔\n\nپس توبہ کا ترک (ترك التوبة) رجوع کا ترک ہے۔ کیونکہ اس نے فرمایا: **ارْجِعُوا وَراءَكُمْ** (تم اپنے پیچھے لوٹ جاؤ) اس شخص سے جو اپنی کونی تاریکی میں تھا، **فَالْتَمِسُوا نُوراً** (پس نور تلاش کرو)۔ اپنے موجد کی طرف دیکھو، اور وہ نور ہے جس کے ذریعے ظہور (التجلی) ہوتا ہے۔ پس جب تم نور دیکھو گے، تو تمہارے بارے میں تم سے پردہ ہٹا دیا جائے گا۔ تو تم جان لو گے کہ وہ تمہاری نسبت تم سے زیادہ قریب ہے **وَلَكِنْ لَا تُبْصِرُونَ** (لیکن تم دیکھتے نہیں) نور کی کمی کی وجہ سے۔\n\n### [جس نے توبہ کی، اس نے توبہ نہیں کی، بلکہ اللہ نے توبہ قبول کی]\n\nپس جب انہیں یہاں اس قدر معرفت (المعرفۃ) حاصل ہوئی، تو ان کی طرف سے توبہ صحیح نہ ہوئی، حالانکہ ان کے نزدیک وہ توبہ کرنے والے تھے۔ **فَتابَ عَلَيْهِ** (پس اس نے اس پر توبہ قبول کی)، پس حقیقت میں وہی توبہ قبول کرنے والا تھا، اور بندہ صفت کے ظہور کا محل ہے۔ اور اسی لیے اس نے فرمایا: **لِيَتُوبُوا** (تاکہ وہ توبہ کریں) پھر فرمایا: **إِنَّ الله هُوَ التَّوَّابُ** (بے شک اللہ ہی بہت توبہ قبول کرنے والا ہے)۔ اور یہ مبالغے کا صیغہ ہے، کیونکہ اس کے لیے پہلی توبہ اس کے قول **ثُمَّ تابَ عَلَيْهِمْ** (پھر اس نے ان پر توبہ قبول کی) سے تھی، اور دوسری اس کے قول **لِيَتُوبُوا** سے تھی۔ پس دونوں توبہ ہر بندے کی طرف سے اسی کے لیے ہیں، پس وہی تواب ہے، نہ کہ وہ بندے۔\n\n**وَما رَمَيْتَ إِذْ رَمَيْتَ وَلكِنَّ الله رَمى‏** (اور جب تم نے پھینکا تو تم نے نہیں پھینکا، بلکہ اللہ نے پھینکا)۔ اور یہ حکم بندوں کے تمام افعال میں جاری ہے۔ پس جس نے توبہ کی، اس نے توبہ نہیں کی، بلکہ اللہ نے توبہ قبول کی۔ اور اسی لیے جماعت نے کہا: توبہ، توبہ کا ترک ہے، اور توبہ سے توبہ کرنا۔ پس اس کی نفی اس کا اثبات ہے، اور اس کا اثبات اس کی نفی ہے۔\n\n### [شریعت کے سطح پر توبہ اور حقیقت کے سطح پر توبہ]\n\nپس توبہ کا ترک (ترك التوبة) دعوے سے براءت کی حالت ہے۔ پس مشروع توبہ صرف مخالفت کی حالت سے موافقت کی حالت کی طرف رجوع کرنا ہے، یعنی واسطے (رسول) کے حکم کی مخالفت سے اس کے حکم کی موافقت کی طرف رجوع کرنا، اور کچھ نہیں۔ اور توبہ سے توبہ کرنا، اس سے، اسی کی طرف، اسی کے ذریعے رجوع کرنا ہے۔ پس توبہ سے توبہ کے لیے کشف (الکشف) ہے، اور اس کے لیے کوئی حجاب نہیں۔\n\nاور اس کا حامل ذمہ دار ہے، کیونکہ اس نے اس کے ذریعے دعوے سے براءت اختیار کی، یعنی دعوے سے۔ اور ہر دعویٰ کرنے والے سے اس کے دعوے کی صحت پر دلیل طلب کی جاتی ہے۔ پس کامل (المکمل) وہ ہے جو توبہ کو وہاں ثابت کرتا ہے جہاں ذات حق (الحق) نے اسے ثابت کیا، اور جس کے لیے اسے ثابت کیا، اور اسے اس کے محل سے تجاوز نہیں کرنے دیتا۔ پس اس کے لیے ایسے لوگ ہیں جو اسے قائم کرتے ہیں، اور ایسے لوگ ہیں جو اس کے ذریعے حکم کرتے ہیں۔ اور وہ اس سے دور رکھے گئے ہیں، کیونکہ یہ غربت (اجنبیت) کی حالت ہے، اور وہ اس وطن میں ہیں جہاں وہ پیدا ہوئے، لہٰذا کوئی غربت نہیں۔\n\n### [توبہ کرنے والے کے لیے اللہ کی محبت ایسی ہے جیسے غائب شخص کے اہل خانہ کی محبت جب وہ ان کی طرف لوٹ آئے]\n\nاپنے اہل کی طرف صرف غائب ہی لوٹتا ہے، اور غائب اجنبی (غریب) ہوتا ہے۔ پس اجنبی ہی توبہ کرنے والے ہیں۔ پس اللہ کی طرف سے ان کے لیے محبت، غائب شخص کے اہل خانہ کی محبت کی طرح ہے جب ان کا غائب ان کے پاس آ جائے۔ پس جو شخص اس کے اہل میں سے ہو اور اس کی غربت کی حالت میں اسے مشاہدہ (الشہود) کر رہا ہو، وہ اس کے لیے خود خوش نہیں ہوتا، کیونکہ وہ اسے کھونے والا نہیں تھا۔ بلکہ اس کی خوشی اس کے اپنے وطن کی طرف لوٹنے کی خوشی کی وجہ سے ہوتی ہے۔ پس یہ موافقت کی خوشی ہے، جیسے محبوب کی اپنے محب سے محبت، کیونکہ یہ اس کے اپنے نفس سے محبت کی عین (ذات) ہے۔ اور اسی لیے وہ اس سے بغض رکھتا ہے جو اس سے بغض رکھتا ہے، اس کے اپنے نفس سے محبت کی وجہ سے۔\n\n**إِنَّ الله يُحِبُّ التَّوَّابِينَ** (بے شک اللہ توبہ کرنے والوں سے محبت کرتا ہے) ہر حال میں اس کی طرف، خواہ مخالفت ہو یا موافقت۔ پس وہ ہر حال میں مقبول اور محبوب ہے۔ اور جب توبہ وصل (ملاپ) کی خاطر محبوب ہو، تو متصل (وصل یافتہ) شخص وصل نہیں کرتا۔ پس وہ محبت میں زیادہ شدید اور لذت میں زیادہ عظیم ہے، اور اسی کو توبہ کا ترک (ترك التوبة) سے تعبیر کیا جاتا ہے۔\n\n### [اصل یہ ہے کہ کوئی رجوع نہیں اور معاملہ ہمیشہ اضافے میں ہے]\n\nاور جس نے یہ دیکھا کہ امر الٰہی اور حقیقت ربانی (الحقیقۃ الربانیۃ) کی وسعت کے لیے کوئی معین حالت دائمی نہیں ہے اور نہ ہی ہونی چاہیے، اور اسی لیے وہ **كُلَّ يَوْمٍ فِي شَأْنٍ** (ہر دن ایک نئی شان میں ہے) اور وہ دہراتا نہیں، تو توبہ صحیح نہیں، کیونکہ یہ رجوع ہے۔ اور رجوع تب ہی ہوتا ہے جب کسی ایسے امر سے جدائی ہو جس کی طرف لوٹا جائے، اور ذات حق (الحق) اس کے برعکس ہے، پس کوئی رجوع نہیں، لہٰذا کوئی توبہ نہیں۔\n\nاور اس کا قول: **وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ** (اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں) اس لیے ہے کہ جب معاملہ پردہ نشینوں کے نزدیک اپنے وطن سے اجنبی ہو گیا، اس دعوے کی وجہ سے جو انہوں نے اس میں اپنے نفسوں کے لیے کیا، تو ان سے کہا گیا: تمام معاملات اسی کی طرف لوٹائے جاتے ہیں۔ اگر تم دیکھتے تو تم پاتے کہ تم میں سے جس کی طرف تم نے اس فعل کو منسوب کیا ہے، وہ صرف اللہ ہے، نہ کہ تم۔ **وَمَا الله بِغافِلٍ عَمَّا يَعْمَلُونَ** (اور اللہ اس سے غافل نہیں جو تم کرتے ہو) تمہارے اس دعوے سے کہ معاملہ تمہاری طرف ہے، حالانکہ وہ اللہ کے لیے ہے۔\n\nپس اصل یہ ہے کہ کوئی رجوع نہیں، اور معاملہ ہمیشہ اضافے میں ہے، جس کی کوئی انتہا نہیں اور نہ ہی احاطہ ہے، کیونکہ واجب الوجود (واجب الوجود) کی کوئی انتہا نہیں، پس ممکنات کی بھی کوئی انتہا نہیں، کیونکہ وہ ہمیشہ خالق ہے۔ اور یہ حکم اس سے زائل نہیں ہو سکتا، کیونکہ یہ وہ ہے جس کی نفی اس کے اثبات کے بغیر ثابت نہیں ہوتی۔ پس اس کی نفی محال ہے۔\n\nپس اس کتاب کے ابواب میں سے ہر باب جو اس بات کا تقاضا کرتا ہے کہ ہم نے پچھلے باب میں جو کچھ ثابت کیا ہے اسے ترک کر دیا جائے، تو وہ اس کے لیے ایک ذیل (ضمیمہ) کی مانند ہے۔ پس وہ اسی میں سے ہے، لہٰذا ہم اسے مختصر طور پر بیان کرتے ہیں کیونکہ یہ طوالت کو برداشت نہیں کرتا۔ اور یہ پچھلے باب کے فصول میں سے ایک فصل ہے، لہٰذا ہم اسی پر اکتفا کرتے ہیں۔ **وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ‏** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "(باب هفتاد و پنجم در ترک توبه)\n\nچه وقت با او مخالفت کردی که توبه کنی؟ *** زیرا ترک توبه، به شهود (الشهود) آگاهی می‌دهد.\nپس به توبه‌کنندگان بگو که شما *** از درک حقایق (الحقائق) به واسطه ورود (به حق) محجوب شده‌اید.\nاز چه کسی یا به سوی چه کسی بازگشته‌اید؟ *** در حالی که جز مسوَّد (آنکه سیاه شده) و مسوِّد (آنکه سیاه می‌کند) نیست.\nاز عین همان کسی که از او آمده‌ای *** به سوی او، به واسطه او، و از عین بندگان.\nو اسماء الهی همان‌هایی هستند که *** پیوسته به فروغ هستی (الوجود) وصف شده‌اند.\n\n### [توبه نمی‌کند مگر کسی که قرب الهی را درک و مشاهده نمی‌کند]\n\nبدان، خداوند تو را توفیق دهد، کسی که صفتش این است که: «و او با شماست هر کجا که باشید» (وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ) و «او بر هر چیزی احاطه دارد» (وَهُوَ بِكُلِّ شَيْءٍ مُحِيطٌ) و «آیا نمی‌داند که خداوند می‌بیند؟» (أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَى) و «همان کسی که تو را هنگام برخاستن می‌بیند» (الَّذِي يَرَاكَ حِينَ تَقُومُ) و «و ما از رگ گردن به او نزدیک‌تریم» (وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ) و «و ما از شما به او نزدیک‌تریم، ولی شما نمی‌بینید» (وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ وَلَكِنْ لَا تُبْصِرُونَ)؛ پس توبه نمی‌کند مگر کسی که این قرب (نزدیکی) را درک و مشاهده نمی‌کند. و درک (الشعور) یک علم اجمالی قطعی است که در آن، چیزی درک شده وجود دارد، اما نمی‌داند آن چیز درک شده چیست. پس علم به خداوند، درک است، و درک، علم به ماهیت آن چیز درک شده نیست. و علم او به ما این‌گونه نیست. پس بنده معنای خود را به معنایی دیگر منصرف نمی‌کند مگر آنکه حق (الحق) در منصرف‌کننده، منصرف‌شده و انصراف حضور دارد. پس اگر ندا دهد، به کجا توبه کنم؟ او همان ندا دهنده است، زیرا جز کسی که می‌شنود، ندا نمی‌دهد، و او شنوایی توست، پس جز به واسطه او نمی‌شنوی. پس تو او را در ندای او به سوی تو از دست نداده‌ای. این حد علم صحیح است. به همین دلیل، جز مؤمنان را به توبه امر نکرد و فرمود: «و همگی به سوی خدا بازگردید، ای مؤمنان» (وَتُوبُوا إِلَى اللَّهِ جَمِيعًا أَيُّهَا الْمُؤْمِنُونَ). (در نسخه‌ای) بدون الف (أيها) آمده است، به دلیل حکمتی که آن را پنهان کرده است و عارف آن را می‌شناسد و مؤمن آن را درک نمی‌کند. اگر با الف (أيها) باشد، آن «هاء» تنبیه است، و اگر بدون الف باشد، آن هویت (هویته) اوست. کسائی آن را با رفع «هاء» (أيه) و حذف واو به دلیل التقاء ساکنین قرائت کرده است. او می‌گوید: «او مؤمنان است»، زیرا او مؤمن است و ندای حق (الحق) را جز به واسطه حق نمی‌شنود، و شنونده مؤمن است و شنوندگان بسیارند، پس او مؤمنان است. پس ترک توبه، ترک بازگشت است، زیرا به کسانی که در ظلمت هستی خود بودند، فرمود: «به پشت سر خود بازگردید» (ارْجِعُوا وَرَاءَكُمْ) و «پس نوری بجویید» (فَالْتَمِسُوا نُورًا). به پدیدآورنده خود بنگرید، که او نوری است که ظهور به واسطه اوست. پس هنگامی که نور را دیدید، حجاب از شما برداشته می‌شود و می‌دانید که او «از شما به شما نزدیک‌تر است، ولی شما نمی‌بینید» (أَقْرَبُ إِلَيْكُمْ مِنْكُمْ وَلَكِنْ لَا تُبْصِرُونَ) به دلیل نبود نور.\n\n### [کسی که توبه کرد، توبه نکرد، بلکه خداوند توبه کرد]\n\nپس هنگامی که معرفت (المعرفة) به این اندازه برای آنان حاصل شد، توبه از جانب آنان صحیح نبود. آنان نزد خود توبه‌کننده‌اند، اما «پس بر او توبه کرد» (فَتَابَ عَلَيْهِ)، پس او در حقیقت توبه‌کننده بود و بنده محل ظهور صفت است. به همین دلیل فرمود: «تا توبه کنند» (لِيَتُوبُوا)، سپس فرمود: «همانا خداوند بسیار توبه‌پذیر است» (إِنَّ اللَّهَ هُوَ التَّوَّابُ). و این لفظ مبالغه است، زیرا توبه اول از آنِ او بود، از قولش: «سپس بر آنان توبه کرد» (ثُمَّ تَابَ عَلَيْهِمْ)، و توبه دوم از قولش: «تا توبه کنند» (لِيَتُوبُوا). پس هر دو توبه از هر بنده‌ای از آنِ اوست، اوست تواب (بسیار توبه‌پذیر) نه آنان. و «هنگامی که پرتاب کردی، تو پرتاب نکردی، بلکه خدا پرتاب کرد» (وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَى). و این حکمی است که در تمام افعال بندگان جاری است. پس کسی که توبه کرد، توبه نکرد، بلکه خداوند توبه کرد. به همین دلیل، گروهی از عرفا گفته‌اند: توبه، ترک توبه است، و توبه از توبه. پس نفی آن، اثبات آن است و اثبات آن، نفی آن است.\n\n### [توبه در سطح شریعت و توبه در سطح حقیقت]\n\nپس ترک توبه، حال بیزاری جستن از ادعاست. توبه مشروع، جز بازگشت از حال مخالفت به حال موافقت نیست؛ منظورم مخالفت امر واسطه (شریعت) به موافقت امر آن است و نه غیر آن. و توبه از توبه، بازگشت از او به سوی او به واسطه اوست. پس توبه از توبه، کشف (الکشف) را به همراه دارد و حجابی برای آن نیست. و صاحب آن مسئول است، زیرا او از ادعا به واسطه آن (توبه) بیزاری جسته است. منظورم از ادعا، هر مدعی است که برای صحت ادعای خود، مطالبه برهان می‌شود. پس انسان کامل (الإنسان الکامل) کسی است که توبه را در جایی که حق (الحق) آن را اثبات کرده و برای کسی که آن را اثبات کرده، ثابت کند و آن را از محل خود تجاوز ندهد. پس توبه مردانی دارد که به آن قیام می‌کنند، و مردانی دارد که به آن حکم می‌کنند، و آنان «از آن دور داشته شده‌اند» (وَهُمْ عَنْهَا مُبْعَدُونَ)، زیرا توبه حال غربت است و آنان در موطنی هستند که در آن متولد شده‌اند، پس غربتی نیست.\n\n### [محبت خداوند به توبه‌کننده، مانند محبت خانواده غایب است هنگامی که غایبشان به سوی آنان بازگردد]\n\nجز غایب به سوی خانواده‌اش باز نمی‌گردد، و غایب، غریب است. پس غریبان همان توبه‌کنندگان هستند. بنابراین، محبت خداوند به آنان، محبت خانواده غایب است هنگامی که غایبشان به سوی آنان بازگردد. کسی که از خانواده‌اش در حال غربت، شاهد او بوده است، به خاطر خودش به بازگشت او شاد نمی‌شود، زیرا او را از دست نداده است، بلکه شادی او به خاطر بازگشت غایب به موطن خود است. پس این شادی، شادی موافقت است، مانند محبت محبوب به دوستدارش، زیرا این محبت، عین محبت او به خودش است. به همین دلیل، کسی را که او را دشمن می‌دارد، به خاطر محبتش به خودش، دشمن می‌دارد. «همانا خداوند توبه‌کنندگان را دوست دارد» (إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ) به سوی او در هر حال از خلاف و وفاق. پس او در هر حال پذیرفته و محبوب است. و اگر توبه به خاطر وصل دوست داشته می‌شود، پس واصل (المتصل) وصل نمی‌شود. بنابراین، او در محبت شدیدتر و در لذت عظیم‌تر است، و این همان چیزی است که از آن به ترک توبه تعبیر می‌شود.\n\n### [اصل این است که بازگشتی نیست و امر در فزونی است]\n\nو کسی که ببیند که امر الهی و گستردگی حقیقت ربانی، حال معینی را برای خود پایدار نمی‌دارد و شایسته آن هم نیست، و به همین دلیل او «هر روز در شأنی است» (كُلَّ يَوْمٍ فِي شَأْنٍ) و تکرار نمی‌شود، پس توبه صحیح نیست، زیرا توبه بازگشت است، و بازگشت جز از مفارقت از امری که به سوی آن باز می‌گردد، صورت نمی‌گیرد، در حالی که حق (الحق) بر خلاف آن است، پس بازگشتی نیست و توبه‌ای نیست. و قول او: «و همه امور به سوی او بازگردانده می‌شود» (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ)، به این دلیل است که امر نزد محجوبان از موطن خود، به واسطه آنچه برای خود در آن ادعا کردند، غریب شد. به آنان گفته شد: همه امور به سوی او بازگردانده می‌شود. اگر می‌نگریستید، می‌دیدید کسی که این فعل را به او نسبت دادید، از جانب شما نیست، بلکه او خداوند است نه شما. و «خداوند از آنچه انجام می‌دهید غافل نیست» (وَمَا اللَّهُ بِغَافِلٍ عَمَّا يَعْمَلُونَ) از ادعای شما که امر به دست شماست، در حالی که امر از آنِ خداست. پس اصل این است که بازگشتی نیست و امر در فزونی است تا بی‌نهایت و بی‌احاطه، زیرا واجب الوجود را نهایتی نیست، پس ممکنات را نیز نهایتی نیست، زیرا او دائماً خلاق است. و صحیح نیست که این حکم از او زائل شود، زیرا نفی آن ثابت نمی‌شود مگر به اثبات آن، پس نفی آن محال است. پس هر بابی از ابواب این کتاب که مقتضی ترک چیزی باشد که در باب قبلی اثبات کرده‌ایم، مانند دنباله آن است و جزئی از آن است. پس آن را به اختصار می‌آوریم، زیرا گنجایش طولانی شدن ندارد و فصلی از فصول باب قبلی است. پس در آن به اختصار بسنده می‌کنیم. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}