{
  "id": 194,
  "title": {
    "ar": "الباب الرابع والتسعون ومائة في معرفة المكان",
    "en": "Chapter One Hundred and Ninety-Four, Concerning the Knowledge of Place",
    "ur": "باب ایک سو چورانوے: معرفتِ مکان کے بیان میں",
    "fa": "باب صد و نود و چهارم در معرفت مکان"
  },
  "content": {
    "ar": "## (الباب الرابع والتسعون ومائة في معرفة المكان)\n\n\n> نفي المقام هو المكان وإنه *** لليثربي بسورة الأحزاب‏\n\n\n> من كان فيه يكون مجهولا لذا *** ما ناله أحد بغير حجاب‏\n\n\n> رب المكان هو الذي يدعى إذا *** دعي الرجال بسيد الأحباب‏\n\n\n> وله الوسيلة لا تكون لغيره *** وهو المقدم من أولي الألباب‏\n\n\n> وهو الإمام وما له من تابع *** وهو المصرف حاجب الحجاب‏\n\n\n### [المكان في الخصوص والعموم‏]\n\n\nقال تعالى يا أَهْلَ يَثْرِبَ لا مُقامَ لَكُمْ وقال تعالى في إدريس ورَفَعْناهُ مَكاناً عَلِيًّا والمكان نعت إلهي في العموم والخصوص أما في العموم فقوله الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ وأما في الخصوص‏\n\n\nفقوله وسعني قلب عبدي المؤمن‏\n\n\nوأما عموم العموم فإن يكون بحيث أنت وهو قوله وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ فذكر الأينية والمكان في الذوات كالمكانة في المراتب والمكان عند القوم منزلة في البساط هي لأهل الكمال الذين جازوا المقامات والأحوال والجلال والجمال فلا صفة لهم ولا نعت ولا مقام كأبي يزيد\n\n\n### [أن عبور المقامات والأحوال لا يكون إلا لأهل الأدب جلساء الحق‏]\n\n\nاعلم أن عبور المقامات والأحوال هو من خصائص المحمديين ولا يكون إلا لأهل الأدب جلساء الحق على بساط الهيبة مع الأنس الدائم لأصحابه الاعتدال والثبات والسكون غير إن لهم سرعة الحركات في الباطن في كل نفس ف تَرَى الْجِبالَ تَحْسَبُها جامِدَةً وهِيَ تَمُرُّ مَرَّ السَّحابِ إن تجلى لهم الحق في صورة محدودة أطرقوا فرأوه في إطراقهم مقلبا أحوالهم على غير الصورة التي تجلى لهم فيها فأورثهم الإطراق فهم بين تقييد وإطلاق لا مقام يحكم عليهم فإنه ما ثم فهم أصحاب مكان في بساط النشأة وهم أصحاب مكانة في عدم القرار فهم من حيث مكانتهم متنوعون ومن حيث مكانهم ثابتون فهم بالذات في مكانهم وهم بالأسماء الإلهية في مكانتهم فمن الأسماء لهم المقام المحمود والمكانة الزلفى في اليوم المشهود والزور والوفود ومن الذات لهم المكان المحدود والمعنى المقصود والثبات على الشهود وحالة الوجود ورؤيته في كل موجود في سكون وخمود يشهدونه في العماء بالعين التي يشهدونه بها في الاستواء بالعين التي يشهدونه بها في السماء الدنيا بالعين التي يشهدونه بها في الأرض بالعين التي يشهدونه بها في المعية بالعين التي يشهدونه بها في لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهذا كله من نعوت المكان وأما شهودهم من حيث المكانة فتختلف عيونهم باختلاف النسب فالعين التي يشهدونه بها في كذا ليست العين التي يشهدونه بها في أمر آخر والمشهود في عين واحدة والشاهد من عين واحدة والنظرة تختلف باختلاف المنظور إليه فمنا من يرى اختلاف النظر لاختلاف المنظور ومنا من يرى اختلاف المنظور لاختلاف النظر وكل له شرب معلوم فالمكان يطلب فرغ ربك والمكانة تطلب كُلَّ يَوْمٍ هُوَ في شَأْنٍ‏\nوسَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ فجاء بلفظ الثقلين أعلاما من خاطب ومن يريد ونحن مركبون من ثقيل وخفيف فالخفيف للمكانة والثقيل للمكان الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ فثبتت الرحمة فلم تزل وأثرت في النزول إلى السماء الدنيا فما نزل ليسلط عذابا وإنما نزل ليقبل تائبا ويجيب داعيا ويغفر لمستغفر ويعطي سائلا فذكر هذا كله ولم يذكر شيئا من القهر لأنه نزل من عرش الرحمن فالمكان رحمة حيث كان لأن فيه استقرار الأجسام من تعب الانتقال إلا تراهم في حال العذاب كيف وصفهم بالانتقال بتبديل الجلود والتبديل انتقال إلى أن يفرغ الميقات والأمر الحقيقي للمكانة فإنه لا يصح الثبوت على أمر واحد في الوجود فالمكان ثبوت في المكانة كما نقول في التمكين أنه تمكين في التلوين لا أن التلوين يضاد التمكين كما يراه من لا علم له بالحقائق وللتمكين باب يرد بعد هذا إن شاء الله‏\n\n",
    "en": "## Chapter One Hundred and Ninety-Four: Concerning the Knowledge of Place (المكان)\n\nThe negation of the Station (المقام) is the Place (المكان), and indeed,\nIt belongs to the Yathribite by the Surah of the Confederates (Al-Ahzab).\nWhoever is in it remains unknown, thus\nNo one attains it without a veil.\nThe Lord of the Place (رب المكان) is He who is called, when\nMen are called, the Master of the Beloveds (سيد الأحباب).\nAnd the Means (الوسيلة) belongs to Him alone, not to another,\nAnd He is the Foremost among those of understanding.\nHe is the Imam, and He has no follower,\nAnd He is the Disposer, the Veil of the Veil (حاجب الحجاب).\n\n### [Place (المكان) in Specificity and Generality]\n\nThe Exalted said: <<O people of Yathrib, there is no station (مقام) for you.>> And the Exalted said concerning Idris: <<And We raised him to a high place (مكاناً عليّاً).>> Place (المكان) is a Divine attribute (نعت إلهي) in both generality and specificity. As for generality, it is His saying: <<The All-Merciful established Himself upon the Throne (الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى).>> As for specificity, it is His saying:\n\n> My believing servant’s heart encompasses Me.\n\nAs for the generality of generality (عموم العموم), it is that He is wherever you are, which is His saying: <<And He is with you wherever you are (وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ).>>\n\nThe mention of \"whereness\" (الأينية) and Place (المكان) in relation to Essences (الذوات) is like Status (المكانة) in relation to Levels (المراتب). Place (المكان), according to the People [of the Path], is a rank (منزلة) on the Carpet (البساط) reserved for the People of Perfection (أهل الكمال) who have transcended the Stations (المقامات), the States (الأحوال), Majesty (الجلال), and Beauty (الجمال). They have neither attribute, nor description, nor station, like Abu Yazid.\n\n### [That the Transcending of Stations and States is Only for the People of Propriety, the Companions of The Real]\n\nKnow that the transcending of Stations (المقامات) and States (الأحوال) is among the unique characteristics of the Muhammadans, and it belongs only to the People of Propriety (أهل الأدب), the companions of The Real (جلساء الحق) upon the Carpet of Awe (الهيبة) coupled with perpetual Intimacy (الأنس). This is for those who possess equilibrium, stability, and stillness, yet they possess swift movements in the inner dimension (الباطن) in every breath. Thus, <<You see the mountains, thinking them rigid, while they pass as the passing of the clouds (تَرَى الْجِبالَ تَحْسَبُها جامِدَةً وهِيَ تَمُرُّ مَرَّ السَّحابِ).>>\n\nIf The Real (الحق) manifests (تجلى) to them in a limited form, they lower their gaze (أطرقوا), and in their lowering, they see Him transforming their states, not in the form in which He manifested to them. This lowering of the gaze bequeaths them a state where they are between restriction (تقييد) and release (إطلاق). No station governs them, for there is none there. They are the people of Place (أصحاب مكان) on the Carpet of Origination (بساط النشأة), and they are the people of Status (أصحاب مكانة) in the absence of permanence (عدم القرار).\n\nThus, from the perspective of their Status (مكانتهم), they are varied (متنوعون), and from the perspective of their Place (مكانهم), they are stable (ثابتون). They are in their Place by Essence (بالذات), and they are in their Status by the Divine Names (بالأسماء الإلهية). From the Names, they possess the Praised Station (المقام المحمود) and the Near Status (المكانة الزلفى) on the Witnessed Day (اليوم المشهود), the Visitation (الزور), and the Delegation (الوفود). From the Essence (الذات), they possess the Limited Place (المكان المحدود), the Intended Meaning (المعنى المقصود), stability upon Witnessing (الشهود), the state of Being (الوجود), and the vision of Him in every existent thing, in stillness and quiescence.\n\nThey witness Him in the Cloud (العماء) with the eye by which they witness Him in the Establishment (الاستواء), with the eye by which they witness Him in the lowest heaven, with the eye by which they witness Him on Earth, with the eye by which they witness Him in Co-presence (المعية), and with the eye by which they witness Him in <<There is nothing like unto Him (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ).>> All of this is among the attributes of Place (المكان).\n\nAs for their witnessing from the perspective of Status (المكانة), their eyes differ according to the differences in relationships (النسب). The eye by which they witness Him in one thing is not the eye by which they witness Him in another matter. The Object Witnessed (المشهود) is in one eye, and the Witness (الشاهد) is from one eye, but the gaze differs according to the difference in the object gazed upon. Some of us see the difference in the gaze due to the difference in the object gazed upon, and some of us see the difference in the object gazed upon due to the difference in the gaze. Each has a known portion (شرب معلوم).\n\nPlace (المكان) demands: \"Your Lord will soon be free (فرغ ربك),\" while Status (المكانة) demands: <<Every day He is in a [new] affair (كُلَّ يَوْمٍ هُوَ في شَأْنٍ).>>\n\nAnd <<We shall attend to you, O you two heavy things (وَسَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ).>> The mention of the \"two heavy things\" (الثقلين) serves as an indication of who is addressed and who is intended. We are composed of the heavy (ثقيل) and the light (خفيف). The light is for Status (المكانة), and the heavy is for Place (المكان).\n\n<<The All-Merciful established Himself upon the Throne (الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى).>> Thus, Mercy (الرحمة) was established and never ceased, and it manifested its effect in the descent to the lowest heaven. He did not descend to impose punishment, but rather to accept the repentant, answer the supplicant, forgive the seeker of forgiveness, and grant the petitioner. He mentioned all of this and did not mention anything of coercion (القهر), because He descended from the Throne of the All-Merciful.\n\nPlace (المكان) is mercy wherever it is, because in it is the stability of bodies from the fatigue of transition. Do you not see how, in the state of punishment, He described them by transition through the changing of skins (تبديل الجلود)? And changing is a transition until the appointed time is fulfilled.\n\nThe true command belongs to Status (المكانة), for stability (الثبوت) upon a single matter is not possible in Existence (الوجود). Thus, Place (المكان) is stability *within* Status (المكانة), just as we say concerning Establishment (التمكين) that it is establishment *within* Variation (التلوين), and that Variation does not contradict Establishment, as is believed by those who have no knowledge of the Realities (الحقائق). And there will follow a chapter concerning Establishment, if God wills.",
    "ur": "(باب ایک سو چورانوے: معرفتِ مکان (Al-Makān) کے بیان میں)\n\nمقام (Al-Maqām) کی نفی ہی مکان (Al-Makān) ہے، اور یہ یثرب والے (رسول اللہ ﷺ) کے لیے سورۃ الاحزاب کے ذریعے ہے۔\nجو اس میں ہوتا ہے وہ مجہول رہتا ہے، اسی لیے کسی نے اسے حجاب کے بغیر حاصل نہیں کیا۔\nمکان (Al-Makān) کا رب وہ ہے جسے پکارا جاتا ہے جب لوگوں کو پکارا جائے تو وہ سید الاحباب (محبوبوں کے سردار) کہلاتا ہے۔\nاور وسیلہ (Al-Wasīlah) صرف اسی کے لیے ہے، کسی اور کے لیے نہیں، اور وہ اہلِ عقل میں سب سے مقدم ہے۔\nاور وہ امام ہے اور اس کا کوئی متبع نہیں، اور وہ ہی متصرف ہے، حجاب کا حجاب ہے۔\n\n### [مکان (Al-Makān) خصوص اور عموم میں]\n\nاللہ تعالیٰ نے فرمایا: **يَا أَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ** (اے اہلِ یثرب! تمہارے لیے کوئی ٹھہرنے کی جگہ نہیں ہے)۔ اور اللہ تعالیٰ نے ادریس علیہ السلام کے بارے میں فرمایا: **وَرَفَعْنَاهُ مَكَانًا عَلِيًّا** (اور ہم نے اسے بلند مقام پر اٹھا لیا)۔ اور مکان (Al-Makān) عموم اور خصوص میں ایک الٰہی صفت ہے۔ عموم میں تو اس کا فرمان ہے: **الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى** (رحمن عرش پر مستوی ہے)۔ اور خصوص میں اس کا فرمان ہے: \"میرے مومن بندے کا دل میری وسعت رکھتا ہے۔\"\n\nاور عموم العموم (عمومی ترین عموم) یہ ہے کہ وہ اس جگہ ہو جہاں تم ہو، اور یہ اس کا فرمان ہے: **وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ** (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)۔ پس \"کہاں ہونا\" (الأينية) کا ذکر کیا گیا، اور ذوات میں مکان (Al-Makān) کا ہونا ایسا ہی ہے جیسے مراتب میں مکانت (Al-Makāna) کا ہونا۔ اور اہلِ تصوف کے نزدیک مکان (Al-Makān) بساط پر ایک ایسی منزل ہے جو اہلِ کمال کے لیے ہے، جنہوں نے مقامات (Al-Maqāmāt)، احوال (Al-Aḥwāl)، جلال (Al-Jalāl) اور جمال (Al-Jamāl) کو عبور کر لیا ہے۔ پس ان کی کوئی صفت، کوئی نعت اور کوئی مقام (Al-Maqām) نہیں ہوتا، جیسے ابو یزید (بسطامی)۔\n\n### [یہ کہ مقامات (Al-Maqāmāt) اور احوال (Al-Aḥwāl) کو عبور کرنا صرف اہلِ ادب، ذات حق (Al-Ḥaqq) کے ہم نشینوں کے لیے ہی ہوتا ہے]\n\nجان لو کہ مقامات (Al-Maqāmāt) اور احوال (Al-Aḥwāl) کو عبور کرنا محمدی (ﷺ) خصوصیات میں سے ہے، اور یہ صرف اہلِ ادب، ذات حق (Al-Ḥaqq) کے ہم نشینوں کے لیے ہی ہوتا ہے جو ہیبت کے بساط پر ہوتے ہیں۔ ان کے لیے دائمی انس ہوتا ہے، وہ اعتدال، ثبات اور سکون والے ہوتے ہیں، مگر اس کے باوجود ہر سانس میں ان کے باطن میں حرکات کی تیزی ہوتی ہے۔ پس **تَرَى الْجِبَالَ تَحْسَبُهَا جَامِدَةً وَهِيَ تَمُرُّ مَرَّ السَّحَابِ** (اور تم پہاڑوں کو دیکھتے ہو اور انہیں جامد سمجھتے ہو، حالانکہ وہ بادلوں کی طرح گزر رہے ہیں)۔ اگر ذات حق (Al-Ḥaqq) ان پر کسی محدود صورت میں ظہور الٰہی (At-Tajallī) فرمائے تو وہ نگاہیں جھکا لیتے ہیں، اور اپنے جھکاؤ میں اسے دیکھتے ہیں کہ وہ ان کے احوال کو اس صورت کے علاوہ کسی اور صورت میں بدل رہا ہے جس میں اس نے ان پر ظہور الٰہی (At-Tajallī) فرمایا تھا۔ پس اس جھکاؤ نے انہیں میراث بخشی، لہٰذا وہ تقیید (پابندی) اور اطلاق (آزادی) کے درمیان ہوتے ہیں، کوئی مقام (Al-Maqām) ان پر حکم نہیں چلاتا، کیونکہ وہاں کوئی مقام نہیں ہے۔ پس وہ نشأت کے بساط پر مکان (Al-Makān) والے ہیں، اور وہ عدمِ قرار میں مکانت (Al-Makāna) والے ہیں۔ پس اپنی مکانت (Al-Makāna) کے لحاظ سے وہ متنوع ہیں، اور اپنے مکان (Al-Makān) کے لحاظ سے وہ ثابت ہیں۔ پس وہ ذات کے اعتبار سے اپنے مکان (Al-Makān) میں ہیں، اور اسماء الٰہیہ کے اعتبار سے اپنی مکانت (Al-Makāna) میں ہیں۔ پس اسماء کے سبب ان کے لیے مقام محمود (Al-Maqām al-Maḥmūd) ہے، اور یوم مشہود (دیکھے ہوئے دن) میں مکانتِ زلفیٰ (قرب کا مرتبہ)، زیارت اور وفود (آمد) ہے۔ اور ذات کے سبب ان کے لیے مکان محدود (Al-Makān al-Maḥdūd)، معنی مقصود، شہود (Ash-Shuhūd) پر ثبات، حالتِ وجود (Al-Wujūd)، اور ہر موجود میں سکون اور خمود کے ساتھ اس کا دیکھنا ہے۔ وہ اسے عماء (غیب مطلق) میں اسی آنکھ سے دیکھتے ہیں جس سے وہ اسے استواء (عرش پر قرار) میں دیکھتے ہیں، اسی آنکھ سے وہ اسے آسمانِ دنیا میں دیکھتے ہیں، اسی آنکھ سے وہ اسے زمین میں دیکھتے ہیں، اسی آنکھ سے وہ اسے معیت (ساتھ ہونے) میں دیکھتے ہیں، اور اسی آنکھ سے وہ اسے **لَيْسَ كَمِثْلِهِ شَيْءٌ** (اس کی مثل کوئی چیز نہیں) میں دیکھتے ہیں۔ اور یہ سب مکان (Al-Makān) کی صفات میں سے ہے۔\n\nاور جہاں تک ان کے مکانت (Al-Makāna) کے لحاظ سے شہود (Ash-Shuhūd) کا تعلق ہے، تو ان کی آنکھیں نسبتوں کے اختلاف سے مختلف ہوتی ہیں۔ پس جس آنکھ سے وہ اسے کسی ایک چیز میں دیکھتے ہیں، وہ اس آنکھ سے مختلف ہوتی ہے جس سے وہ اسے کسی دوسرے معاملے میں دیکھتے ہیں۔ اور مشہود (جس کا شہود کیا جا رہا ہے) ایک ہی آنکھ میں ہے، اور شاہد (شہود کرنے والا) ایک ہی آنکھ سے ہے۔ اور نگاہ کا فرق منظور الیہ (جسے دیکھا جا رہا ہے) کے اختلاف سے ہوتا ہے۔ پس ہم میں سے کچھ وہ ہیں جو اختلافِ منظور (دیکھی جانے والی چیز کے فرق) کی وجہ سے اختلافِ نظر دیکھتے ہیں، اور ہم میں سے کچھ وہ ہیں جو اختلافِ نظر کی وجہ سے اختلافِ منظور دیکھتے ہیں۔ اور ہر ایک کے لیے ایک معلوم حصہ ہے۔ پس مکان (Al-Makān) تقاضا کرتا ہے: \"تیرے رب نے فراغت پائی\"، اور مکانت (Al-Makāna) تقاضا کرتی ہے: **كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ** (وہ ہر دن ایک نئی شان میں ہے)۔\n\nاور **سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ** (عنقریب ہم تمہاری طرف متوجہ ہوں گے، اے دونوں بوجھ والو!)۔ پس \"ثقلین\" (دو بوجھ) کا لفظ اس بات کی علامت کے طور پر آیا کہ کسے مخاطب کیا جا رہا ہے اور کون مراد ہے۔ اور ہم ثقیل (بھاری) اور خفیف (ہلکے) سے مرکب ہیں۔ پس خفیف (ہلکا حصہ) مکانت (Al-Makāna) کے لیے ہے اور ثقیل (بھاری حصہ) مکان (Al-Makān) کے لیے ہے۔ **الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى** (رحمن عرش پر مستوی ہے)۔ پس رحمت ثابت ہوئی اور زائل نہیں ہوئی، اور اس نے آسمانِ دنیا کی طرف نزول میں اثر ڈالا۔ پس وہ عذاب مسلط کرنے کے لیے نازل نہیں ہوا، بلکہ وہ نازل ہوا تاکہ توبہ کرنے والے کو قبول کرے، دعا کرنے والے کی دعا قبول کرے، مغفرت چاہنے والے کو بخشے، اور سوال کرنے والے کو عطا کرے۔ پس اس نے یہ سب ذکر کیا اور قہر (غلبہ) کا کوئی ذکر نہیں کیا، کیونکہ وہ عرشِ رحمن سے نازل ہوا۔ پس مکان (Al-Makān) جہاں بھی ہو رحمت ہے، کیونکہ اس میں اجسام کو نقل و حرکت کی تھکاوٹ سے قرار ملتا ہے۔ کیا تم نہیں دیکھتے کہ عذاب کی حالت میں انہیں کس طرح انتقال (تبدیلی) سے موصوف کیا گیا ہے، کھالوں کے بدلنے کے ذریعے؟ اور یہ تبدیلی ایک انتقال ہے جب تک کہ میقات (وقت مقررہ) پورا نہ ہو جائے۔ اور حقیقی معاملہ مکانت (Al-Makāna) کے لیے ہے، کیونکہ ہستی (Al-Wujūd) میں کسی ایک چیز پر ثبات (ٹھہراؤ) درست نہیں ہے۔ پس مکان (Al-Makān) مکانت (Al-Makāna) میں ثبوت (ٹھہراؤ) ہے، جیسا کہ ہم تمکین (At-Tamkīn) کے بارے میں کہتے ہیں کہ یہ تلوین (At-Talwīn - تغیر) میں تمکین (At-Tamkīn) ہے، نہ کہ تلوین (At-Talwīn) تمکین (At-Tamkīn) کی ضد ہے، جیسا کہ وہ لوگ سمجھتے ہیں جنہیں حقائق (Al-Ḥaqā’iq) کا علم نہیں ہے۔ اور تمکین (At-Tamkīn) کا ایک باب ہے جو ان شاء اللہ اس کے بعد آئے گا۔",
    "fa": "باب صد و نود و چهارم در معرفت مکان (جایگاه)\n\nنفی مقام همان مکان است، و آن\nبرای یثربی (اهل مدینه) در سوره احزاب است\n\nهر کس در آن باشد، ناشناخته می‌ماند، از این رو\nکسی جز با حجاب به آن دست نیافت\n\nپروردگار مکان (جایگاه) کسی است که خوانده می‌شود، آنگاه که\nمردان به سید احباب (سرور دوستان) خوانده شوند\n\nو وسیله (مقام شفاعت) از آن اوست و برای دیگری نیست\nو او پیشوای خردمندان (أولي الألباب) است\n\nو او امام است و پیرو ندارد\nو اوست که پرده‌دار حجاب را تدبیر می‌کند\n\n### [مکان در خصوص و عموم]\n\nخداوند متعال می‌فرماید: ای اهل یثرب (مدینه)، برای شما ایستادنی (مقام) نیست (يا أَهْلَ يَثْرِبَ لا مُقامَ لَكُمْ). و در مورد ادریس می‌فرماید: و او را به جایگاهی بلند (مَكاناً عَلِيًّا) برکشیدیم (وَرَفَعْناهُ مَكاناً عَلِيًّا). و مکان (جایگاه) وصفی الهی است در عموم و خصوص. اما در عموم، سخن اوست: خداوند رحمان بر عرش استیلا یافت (الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏). و اما در خصوص، سخن اوست: قلب بنده مؤمنم مرا گنجایش دارد.\n\nو اما عمومِ عموم، آن است که او در جایی باشد که تو هستی، و آن سخن اوست: و او با شماست هر کجا که باشید (وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ). پس ذکر \"أینیت\" (کجا بودن) و مکان (جایگاه) در ذات‌ها، مانند مکانت (منزلت) در مراتب است. و مکان (جایگاه) نزد این طایفه، منزلتی است در بساط (حضور) که مخصوص اهل کمال است؛ کسانی که از مقامات و احوال و جلال و جمال عبور کرده‌اند، پس نه وصفی دارند و نه نعت و نه مقامی، مانند ابویزید (بسطامی).\n\n### [اینکه عبور از مقامات و احوال جز برای اهل ادب، همنشینان حق، میسر نیست]\n\nبدان که عبور از مقامات و احوال از ویژگی‌های محمدیان است و جز برای اهل ادب، همنشینان حق (الحق)، بر بساط هیبت همراه با اُنس دائمی میسر نیست. برای صاحبان آن، اعتدال و ثبات و سکون است، جز اینکه در باطن، در هر نفس، سرعت حرکاتی دارند. پس کوه‌ها را می‌بینی و آن‌ها را ساکن می‌پنداری، در حالی که مانند گذر ابرها در حرکتند (تَرَى الْجِبالَ تَحْسَبُها جامِدَةً وهِيَ تَمُرُّ مَرَّ السَّحابِ).\n\nاگر حق (الحق) در صورتی محدود بر آنان تجلی (التجلی) کند، سر به زیر می‌اندازند و در سر به زیر انداختن خود، او را می‌بینند که احوالشان را بر غیر آن صورتی که در آن تجلی کرده بود، دگرگون می‌سازد. پس این سر به زیر انداختن، میراث آنان شد؛ از این رو، آنان میان تقیید (محدودیت) و اطلاق (آزادی) هستند و هیچ مقامی بر آنان حکم نمی‌راند، زیرا مقامی در کار نیست. پس آنان صاحبان مکان (جایگاه) در بساط نشئه (عالم هستی) هستند و صاحبان مکانت (منزلت) در عدم قرار (بی‌قراری).\n\nپس آنان از حیث مکانت (منزلت) متنوع‌اند و از حیث مکان (جایگاه) ثابت. آنان به ذات خود در مکان (جایگاه) خویش‌اند و به اسماء الهی در مکانت (منزلت) خویش. پس از اسماء، مقام محمود و مکانت (منزلت) زلفی (قرب) در روز مشهود (قیامت) و زیارت و وفود (وارد شدن) از آنِ ایشان است. و از ذات، مکان (جایگاه) محدود و معنای مقصود و ثبات بر شهود (الشهود) و حالت هستی (الوجود) و رؤیت او در هر موجودی از آنِ ایشان است.\n\nدر سکون و خاموشی، او را در عماء (ابر غلیظ) با همان چشمی شهود می‌کنند که او را در استواء (استیلا) شهود می‌کنند، با همان چشمی که او را در آسمان دنیا شهود می‌کنند، با همان چشمی که او را در زمین شهود می‌کنند، با همان چشمی که او را در معیت (همراهی) شهود می‌کنند، با همان چشمی که او را در «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ) شهود می‌کنند. و این همه از اوصاف مکان (جایگاه) است. اما شهود (الشهود) آنان از حیث مکانت (منزلت)، چشمانشان به اختلاف نسبت‌ها متفاوت می‌شود.\n\nپس چشمی که با آن او را در فلان چیز شهود می‌کنند، آن چشمی نیست که با آن او را در امری دیگر شهود می‌کنند. در حالی که مشهود در یک چشم است و شاهد از یک چشم، و نگاه به اختلاف منظورٌالیه (آنچه به آن نگریسته می‌شود) متفاوت می‌شود. پس برخی از ما اختلاف نظر را به دلیل اختلاف منظور (آنچه دیده می‌شود) می‌بینند و برخی از ما اختلاف منظور را به دلیل اختلاف نظر می‌بینند، و برای هر یک بهره‌ای معلوم است.\n\nپس مکان (جایگاه) طلب می‌کند: پروردگارت فارغ شد، و مکانت (منزلت) طلب می‌کند: او هر روز در کاری است (كُلَّ يَوْمٍ هُوَ في شَأْنٍ). و به زودی برای شما فارغ خواهیم شد، ای دو گروه سنگین (سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ). پس لفظ ثقلین (دو گروه سنگین) را آورد تا اعلام کند که مخاطب کیست و چه کسی را اراده می‌کند. و ما از سنگین و سبک ترکیب شده‌ایم؛ پس سبک برای مکانت (منزلت) است و سنگین برای مکان (جایگاه).\n\nخداوند رحمان بر عرش استیلا یافت (الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏). پس رحمت ثابت شد و زائل نگشت و در نزول به آسمان دنیا تأثیر گذاشت. او نازل نشد تا عذابی مسلط کند، بلکه نازل شد تا توبه‌کننده را بپذیرد و دعا کننده را اجابت کند و آمرزش‌خواه را بیامرزد و سائل را عطا کند. پس همه این‌ها را ذکر کرد و چیزی از قهر (غلبه) را ذکر نکرد، زیرا او از عرش رحمان نازل شد. پس مکان (جایگاه) هر جا که باشد، رحمت است.\n\nزیرا در آن، استقرار اجسام از رنج انتقال است. آیا نمی‌بینی که در حال عذاب چگونه آنان را به انتقال، با تبدیل پوست‌ها، وصف کرده است؟ و تبدیل، انتقال است تا زمانی که میقات (وقت مقرر) به پایان رسد. و امر حقیقی برای مکانت (منزلت) است، زیرا ثبوت بر یک امر واحد در هستی (الوجود) صحیح نیست. پس مکان (جایگاه)، ثبوت در مکانت (منزلت) است، همان‌طور که در مورد تمکین (استقرار) می‌گوییم که تمکین، تمکین در تلوین (تغییر احوال) است، نه اینکه تلوین با تمکین در تضاد باشد، چنانکه کسانی که به حقایق (الحقائق) علم ندارند، می‌پندارند. و برای تمکین بابی است که پس از این خواهد آمد، ان شاء الله."
  },
  "page_count": 2
}