{
  "id": 483,
  "title": {
    "ar": "الباب الثالث والثمانون وأربعمائة في معرفة حال قطب كان منزله قَدْ أَفْلَحَ من زَكَّاها وقَدْ خابَ من دَسَّاها",
    "en": "Chapter Four Hundred and Eighty-Three: Concerning the knowledge of the state of a Pole (*Qutb*) whose station was: <<قَدْ أَفْلَحَ من زَكَّاها وقَدْ خابَ من دَسَّاها>> (He has succeeded who purifies it, and he has failed who corrupts it).",
    "ur": "باب چار سو تراسی، ایک ایسے قطب (Qutb) کے حال کی معرفت (Ma'rifah) کے بیان میں جس کا منزل (Manzil) یہ تھا: \"یقیناً وہ کامیاب ہوا جس نے اسے (نفس کو) پاک کیا، اور یقیناً وہ ناکام ہوا جس نے اسے (گناہوں میں) دبا دیا\" (قَدْ أَفْلَحَ مَن زَكَّاها وَقَدْ خابَ مَن دَسَّاها)۔",
    "fa": "باب چهارصد و هشتاد و سوم در معرفت حال قطبی که منزل او «قَدْ أَفْلَحَ مَن زَكَّاهَا وَقَدْ خَابَ مَن دَسَّاهَا» (به راستی رستگار شد کسی که آن [نفس] را تزکیه کرد و به راستی زیانکار شد کسی که آن را فرو پوشاند) بود."
  },
  "content": {
    "ar": "## «الباب الثالث والثمانون وأربعمائة في معرفة حال قطب كان منزله قَدْ أَفْلَحَ من زَكَّاها وقَدْ خابَ من دَسَّاها»\n\n\n> فازت النفس إذا ما اتصفت *** بصفات القدس في نشأتها\n\n\n> أو بأمر عارض كان لها *** وقفت فيه على حكمتها\n\n\n> فهما في الحكم سيان على *** ما اقتضاه الأمر من سورتها\n\n\n> والذي قد دسها بينهما *** دون نعت خاب من جملتها\n\n\n> لم يجب من بعد ما تنتجه *** إنه الظاهر في صورتها\n\n\n> فله الحمد على ذاك وذا *** لدخول الكون في رحمتها\n\n\n### [إن النفس معظم ومشرف بربها]\n\n\nتحقيق هذا الذكر إن النفس لا تزكو إلا بربها فبه تشرف وتعظم في ذاتها لأن الزكاة ربو فمن كان الحق سمعه وبصره وجميع قواه والصورة في الشاهد صورة خلق فقد زكت نفس من هذا نعته ورَبَتْ وأَنْبَتَتْ من كُلِّ زَوْجٍ بَهِيجٍ كالاسماء الإلهية لله والخلق كله بهذا النعت في نفس الأمر ولو لا أنه هكذا في نفس الأمر ما صح لصورة الخلق ظهور ولا وجود ولذلك خابَ من دَسَّاها لأنه جهل ذلك فتخيل أنه دسها في هذا النعت وما علم إن هذا النعت لنفسه نعت ذاتي لا ينفك عنه يستحيل زواله لذلك وصفه بالخيبة حيث لم يعلم هذا ولذلك قال قَدْ أَفْلَحَ ففرض له البقاء والبقاء ليس إلا لله أو لما كان عند الله وما ثم إلا الله أو ما هو عنده فخزائنه غير نافدة فليس إلا صور تعقب صورا والعلم بها يسترسل عليها استرسالا بقوله حَتَّى نَعْلَمَ مع علمه بها قبل تفصيلها فلو علمها مفصلة في حال إجمالها ما علمها فإنها مجملة والعلم لا يكون علما حتى يكون تعلقه بما هو المعلوم عليه فإن المعلوم هو الذي يعطيه بذاته العلم والمعلوم هنا غير مفصل فلا يعلمه إلا غير مفصل إلا أنه يعلم التفصيل في الإجمال ومثل هذا إلا يدل على أن المجمل مفصل إنما يدل على أنه يقبل التفصيل إذا فصل بالفعل هذا معنى حتى نعلم وإذا كان الأمر كما ذكرناه فما ثم من دساها ولو كان ثم لكان هو الموصوف بالخيبة لأن الشي‏ء لا يمكن أن ينجعل ولا يندس في غير قابل لاندساسه وإذا دسه فقد قبله ذلك القابل وإذا قبله فما تعدى ذلك المدسوس رتبته لأنه حل في موضعه واستقر في مكانه فما خاب من دسه الخيبة المفهومة من الحرمان فله العلم وما له نيل الغرض فحرمانه عدم نيل غرضه فإن العلم ما هو محبوب لكل أحد ولو كان العلم محبوبا لكل أحد ما قال من قال إن العلم حجاب والحجاب عن الخير تنفر منه الطباع ونحن إذا قلنا العلم حجاب فإنما نعني به يحجب عن الجهل فإن الوجود والعدم لا يجتمعان أعني النفي والإثبات فما يخيب إلا أصحاب الأغراض وهم الأشقياء فمن لا غرض له لا خيبة له وأنت تعلم أنه إذا دس شي‏ء في شي‏ء إن لم يسعه فلا يندس فيه وإن اندس فقد وسعه ولا يسعه إلا ما هو له فلكل دار أهل وما ثم في الآخرة إلا داران جنة ولها أهل وهم الموحدون بأي وجه وحدوا وهم الذين زكوا نفوسهم والدار الثانية النار ولها أهل وهم الذين لم يوحدوا الله وهم الداسون أنفسهم فخابوا لا بالنظر إلى دارهم ولكن بالنظر إلى الدار الأخرى فكما أنه لم يتعد أحد هنا ما قدر له وما أعطته نشأته الخاصة به كذلك لم يتعد هنالك ما قدر له موطنه الذي هو معين لذلك الذي قدر له فمن خلق للنعيم فسييسره لليسرى فَأَمَّا من أَعْطى‏ واتَّقى‏ وصَدَّقَ بِالْحُسْنى‏ فَسَنُيَسِّرُهُ لِلْيُسْرى‏ ومن خلق للجحيم فسييسره للعسرى وأَمَّا من بَخِلَ بنفسه على ربه حيث طلب منه قلبه ليتخذه بيتا له بالإيمان أو التوحيد واسْتَغْنى‏\nبنفسه عن ربه في زعمه وكَذَّبَ بِالْحُسْنى‏ وهي أحكام الأسماء الحسنى فَسَنُيَسِّرُهُ لِلْعُسْرى‏ فهذا تيسير التعسير وهو يشبه الدس فإن الدس يؤذن بالعسر لا بالسهولة فلو جهد أحد أن يدخل فيما لا يسعه ما يمكن له ذلك جملة واحدة وما كلف الله نَفْساً إِلَّا وُسْعَها في نفس الأمر ولذلك وسعت رحمته كل شي‏ء وزال الغضب وارتفع حكمه وتعينت المراتب وبانت المذاهب وتميزا لمركوب من الراكب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 483: Concerning the Knowledge of the State of a Pole (قطب) whose Station was: <<He has succeeded who purifies it, and he has failed who corrupts it>> (Q 91:9-10).\n\nThe soul triumphs when it is characterized\nBy the Attributes of Holiness (صفات القدس) in its origination,\n\nOr by an accidental matter that occurred to it,\nIn which it stood upon its wisdom.\n\nThus, they are equal in judgment according to\nWhat the matter necessitated from its nature.\n\nAnd he who corrupted it between the two\nWithout an attribute failed from its totality.\n\nIt is not necessary after what it produces,\nFor He is the Manifest (الظاهر) in its form.\n\nSo praise belongs to Him for this and that,\nDue to the entry of the Cosmos (الكون) into His Mercy.\n\n### [Verily, the Soul is Honored and Ennobled by its Lord]\n\nThe verification of this remembrance is that the soul (النفس) is purified (تزكو) only through its Lord. By Him, it is ennobled and magnified in its Essence (ذاتها), because purification (الزكاة) is growth (ربو). Thus, the soul whose description (نعت) is that The Real (الحق) is its hearing, its sight, and all its powers—while the form witnessed is the form of creation (صورة خلق)—that soul is purified, has grown, and has brought forth <<of every delightful pair>> (Q 22:5), like the Divine Names (الأسماء الإلهية) of Allah. All Creation (الخلق كله) possesses this attribute in the Reality of the Matter (في نفس الأمر). Were it not thus in the Reality of the Matter, the form of creation would not be valid for appearance (ظهور) or Existence (وجود).\n\nFor this reason, <<he has failed who corrupts it>> (Q 91:10), because he was ignorant of that, imagining that he corrupted it (دسها) within this attribute. He did not know that this attribute is an essential attribute (نعت ذاتي) for the soul itself, inseparable from it, and impossible to remove. Therefore, [Allah] described him with failure (الخيبة) since he did not know this.\n\nFor this reason, He said, <<He has succeeded>> (Q 91:9), thereby decreeing Subsistence (البقاء) for him. Subsistence belongs only to Allah, or to that which is with Allah. And there is nothing there except Allah, or that which is with Him. His treasures are inexhaustible. Thus, there are only forms following forms, and Knowledge (العلم) flows over them continuously, as indicated by His saying, <<until We know>> (Q 47:31), despite His Knowledge of them before their detailed manifestation (تفصيلها).\n\nIf He had known them in detail (مفصلة) while they were in their state of generality (إجمالها), He would not have known them [as general]. For they are general, and Knowledge is not Knowledge unless its relation is to that upon which the object of knowledge (المعلوم) stands. For the object of knowledge is that which, by its Essence (بذاته), gives Knowledge to [the Knower]. And the object of knowledge here is not detailed, so He does not know it except as non-detailed. However, He knows the detail within the generality. Such a case does not indicate that the general is detailed; rather, it indicates that it accepts detailing when it is actually detailed. This is the meaning of <<until We know>>.\n\nIf the matter is as We have mentioned, then there is no one who truly corrupts it. If there were, that person would be the one described by failure. This is because a thing cannot be made or corrupted (يندس) into something that is not receptive (قابل) to its corruption. If he corrupts it, that receptive entity has accepted it. And if it accepts it, then that corrupted thing has not exceeded its Level (رتبته), because it has settled in its proper place and established itself in its station. Thus, the one who corrupts it does not fail in the sense of deprivation (الحرمان). He possesses Knowledge, but he does not attain his objective (الغرض). His deprivation, therefore, is the failure to attain his objective.\n\nFor Knowledge is not beloved by everyone. If Knowledge were beloved by everyone, no one would have said that Knowledge is a veil (حجاب). A veil from goodness is something that natures (الطباع) recoil from. When We say Knowledge is a veil, We only mean that it veils from ignorance (الجهل), for Existence (الوجود) and non-Existence (العدم) do not combine—meaning negation and affirmation. Thus, only the people of objectives (أصحاب الأغراض) fail, and they are the wretched (الأشقياء). He who has no objective has no failure.\n\nYou know that when something is corrupted into something else, if the latter does not contain it (يسعه), it cannot be corrupted into it. If it is corrupted into it, then it has contained it. And nothing contains it except that which belongs to it. Thus, every abode has its inhabitants. In the Hereafter (الآخرة), there are only two abodes: Paradise (جنة), which has its inhabitants, and they are the Monotheists (الموحدون), in whatever manner they affirmed Unity (وحدوا), and they are those who purified their souls (زكوا نفوسهم). The second abode is the Fire (النار), which has its inhabitants, and they are those who did not affirm the Unity of Allah, and they are those who corrupted their souls (الداسون أنفسهم). They failed, not by looking at their own abode, but by looking at the other abode.\n\nJust as no one here exceeds what has been decreed for him and what his specific origination (نشأته الخاصة به) has granted him, likewise, there [in the Hereafter], he does not exceed what has been decreed for him by his station (موطنه), which is appointed for that which was decreed for him. So, whoever was created for bliss (النعيم), He will facilitate him for ease (اليسرى): <<As for him who gives and fears [Allah], and believes in the best [reward], We shall facilitate him for ease>> (Q 92:5-7). And whoever was created for the Fire (الجحيم), He will facilitate him for difficulty (العسرى): <<But as for him who is miserly with his soul toward his Lord—when He sought his heart to take it as a house for Himself through faith or Unity (التوحيد)—and deemed himself self-sufficient (استغنى) from his Lord, in his claim, and denied the best [reward] (الحسنى)>>—which are the rulings of the Beautiful Names (الأسماء الحسنى)—<<We shall facilitate him for difficulty>> (Q 92:8-10). This is the facilitation of difficulty (تيسير التعسير), and it resembles corruption, for corruption implies difficulty, not ease.\n\nIf someone were to strive to enter into that which cannot contain him, that would be utterly impossible for him. Allah has not burdened a soul <<except with its capacity>> (Q 2:286) in the Reality of the Matter. For this reason, His Mercy encompasses everything, and Wrath (الغضب) has vanished, its ruling lifted, the Levels (المراتب) have been determined, the paths (المذاهب) made clear, and the mounted distinguished from the rider. And Allah <<says the Truth (الحق), and He guides to the Way>> (Q 33:4).",
    "ur": "باب چار سو تراسی، اس قطب (قطب) کے حال کی معرفت میں جس کا مقام یہ تھا: \"یقیناً وہ کامیاب ہوا جس نے اسے پاک کیا، اور وہ ناکام ہوا جس نے اسے آلودہ کیا۔\"\n\nنفس (نفس) کامیاب ہوئی جب وہ متصف ہوئی\nقدس (قدس) کی صفات سے اپنی نشأت (نشأت) میں\n\nیا کسی عارضی امر سے جو اس کے لیے تھا\nجس میں وہ اپنی حکمت (حکمت) پر قائم رہی\n\nپس وہ دونوں حکم میں برابر ہیں\nاس کے مطابق جو امر نے اس کی صورت (صورت) سے تقاضا کیا\n\nاور جس نے اسے ان دونوں کے درمیان آلودہ کیا\nبغیر کسی صفت کے، وہ اس کی کلیت سے ناکام ہوا\n\nاس نے اس کے بعد جواب نہیں دیا جو اس نے پیدا کیا\nیقیناً وہ (ذات حق) اس کی صورت (صورت) میں ظاہر (الظاہر) ہے\n\nپس اسی کے لیے حمد ہے اس پر اور اس پر\nکون (کون) کے اس کی رحمت (رحمت) میں داخل ہونے کے سبب\n\n### [یقیناً نفس (نفس) اپنے رب (رب) کے ذریعے معظم اور مشرف ہے]\n\nاس ذکر کی تحقیق یہ ہے کہ نفس (نفس) اپنے رب (رب) کے بغیر پاکیزہ نہیں ہوتی، پس اسی کے ذریعے وہ اپنی ذات (ذات) میں شرف اور عظمت حاصل کرتی ہے، کیونکہ زکوٰۃ (زکوٰۃ) بڑھوتری ہے۔ پس جس کا سننا، دیکھنا اور تمام قوتیں ذات حق (الحق) ہو، اور شاہد (الشاہد) میں صورت (صورت) خلق (خلق) کی صورت ہو، تو اس کی نفس (نفس) پاکیزہ ہو گئی جس کی یہ صفت ہے، اور وہ بڑھی اور \"ہر خوبصورت جوڑے\" (قرآن ۵۰:۷) کو اگایا، جیسے کہ اللہ تعالیٰ کے لیے اسماء الٰہیہ (الاسماء الإلهية) ہیں۔ اور تمام خلق (خلق) حقیقت (نفس الأمر) میں اسی صفت کے ساتھ ہے۔\n\nاور اگر حقیقت (نفس الأمر) میں ایسا نہ ہوتا تو صورت خلق (صورت خلق) کے لیے ظہور (ظہور) اور ہستی (الوجود) صحیح نہ ہوتی۔ اور اسی لیے \"وہ ناکام ہوا جس نے اسے آلودہ کیا\" (خابَ من دَسَّاها)، کیونکہ وہ اس سے جاہل رہا۔ پس اس نے گمان کیا کہ اس نے اسے اس صفت میں آلودہ کیا ہے، حالانکہ وہ نہیں جانتا تھا کہ یہ صفت اس کی نفس (نفس) کے لیے ایک ذاتی صفت (نعت ذاتي) ہے جو اس سے جدا نہیں ہوتی، اور اس کا زائل ہونا محال ہے۔ اسی لیے ذات حق نے اسے ناکامی (الخيبة) سے متصف کیا، کیونکہ اس نے یہ نہ جانا۔ اور اسی لیے ذات حق نے فرمایا: \"یقیناً وہ کامیاب ہوا\" (قَدْ أَفْلَحَ)، پس اس کے لیے بقا (البقاء) کو فرض کر دیا۔ اور بقا (البقاء) صرف اللہ کے لیے ہے یا اس کے لیے جو اللہ کے پاس ہے۔ اور وہاں اللہ کے سوا کچھ نہیں یا وہ جو اس کے پاس ہے، پس اس کے خزانے کبھی ختم نہیں ہوتے۔ پس یہ صرف صورتیں (صور) ہیں جو صورتوں کے بعد آتی ہیں، اور ان کا علم (علم) ان پر مسلسل جاری رہتا ہے، جیسا کہ اس کے قول \"حَتَّى نَعْلَمَ\" (یہاں تک کہ ہم جان لیں) سے ظاہر ہوتا ہے، باوجود اس کے کہ وہ ان کی تفصیل (تفصیل) سے پہلے بھی انہیں جانتا تھا۔\n\nپس اگر وہ انہیں ان کے اجمال (إجمال) کی حالت میں مفصل (مفصل) جانتا تو وہ انہیں نہ جانتا، کیونکہ وہ مجمل (مجمل) ہیں۔ اور علم (علم) تب تک علم نہیں ہوتا جب تک اس کا تعلق اس چیز سے نہ ہو جس پر معلوم (المعلوم) قائم ہے۔ کیونکہ معلوم (المعلوم) ہی اپنی ذات (ذات) سے علم (علم) عطا کرتا ہے۔ اور یہاں معلوم (المعلوم) غیر مفصل ہے، لہٰذا وہ اسے غیر مفصل ہی جانتا ہے۔ مگر یہ کہ وہ اجمال (إجمال) میں تفصیل (التفصيل) کو جانتا ہے۔ اور ایسی بات یہ نہیں بتاتی کہ مجمل (المجمل) مفصل (مفصل) ہے، بلکہ یہ بتاتی ہے کہ وہ تفصیل (التفصيل) کو قبول کرتا ہے جب اسے بالفعل مفصل کیا جائے۔ یہ ہے \"حَتَّى نَعْلَمَ\" کا معنی۔\n\nاور جب معاملہ ایسا ہے جیسا کہ ہم نے ذکر کیا، تو وہاں کوئی نہیں جس نے اسے آلودہ کیا ہو۔ اور اگر کوئی ہوتا تو وہی ناکامی (الخيبة) سے متصف ہوتا۔ کیونکہ کسی چیز کے لیے یہ ممکن نہیں کہ وہ کسی ایسی چیز میں داخل ہو یا آلودہ (یندس) ہو جو اس کی آلودگی کو قبول نہ کرے۔ اور جب اس نے اسے آلودہ کیا تو اس قابل نے اسے قبول کر لیا۔ اور جب اس نے اسے قبول کر لیا تو وہ آلودہ شدہ چیز اپنے مرتبے (رتبتہ) سے تجاوز نہیں کر سکی۔ کیونکہ وہ اپنی جگہ پر حلول کر گئی اور اپنے مقام پر ٹھہر گئی۔ پس جس نے اسے آلودہ کیا وہ اس ناکامی (الخيبة) سے ناکام نہیں ہوا جو محرومی (الحرمان) سے سمجھی جاتی ہے۔ پس اس کے لیے علم (علم) ہے، لیکن اسے مقصد (الغرض) کا حصول نہیں ہے۔ پس اس کی محرومی (حرمان) اس کے مقصد کا حاصل نہ ہونا ہے۔ کیونکہ علم (علم) ہر کسی کو محبوب نہیں ہوتا۔ اور اگر علم (علم) ہر کسی کو محبوب ہوتا تو کوئی یہ نہ کہتا کہ علم (علم) حجاب (حجاب) ہے۔ اور خیر سے حجاب (حجاب) وہ ہے جس سے طبائع (طباع) نفرت کرتی ہیں۔ اور جب ہم کہتے ہیں کہ علم (علم) حجاب (حجاب) ہے، تو ہمارا مطلب صرف یہ ہوتا ہے کہ وہ جہل (الجهل) سے پردہ کرتا ہے۔ کیونکہ ہستی (الوجود) اور عدم (العدم) جمع نہیں ہو سکتے، یعنی نفی (النفي) اور اثبات (الإثبات)۔\n\nپس صرف اغراض (الأغراض) والے ہی ناکام ہوتے ہیں، اور وہ بدبخت (الأشقياء) ہیں۔ پس جس کا کوئی مقصد (غرض) نہیں، اس کے لیے کوئی ناکامی (خيبة) نہیں ہے۔ اور آپ جانتے ہیں کہ جب کوئی چیز کسی چیز میں آلودہ (دس) کی جاتی ہے، اگر وہ اسے اپنے اندر نہ سمو سکے تو وہ اس میں آلودہ نہیں ہو سکتی۔ اور اگر وہ آلودہ ہو گئی تو اس نے اسے سمو لیا، اور اسے وہی سمو سکتا ہے جو اس کے لیے ہے۔ پس ہر گھر کے لیے اہل ہیں۔ اور آخرت (الآخرة) میں صرف دو گھر ہیں۔ جنت (جنة)، اور اس کے اہل ہیں، اور وہ موحدون (الموحدون) ہیں، خواہ انہوں نے کسی بھی طریقے سے توحید (توحید) کا اقرار کیا ہو۔ اور وہ وہی ہیں جنہوں نے اپنی نفوس (نفوس) کو پاک کیا۔ اور دوسرا گھر آگ (نار) ہے، اور اس کے اہل وہ ہیں جنہوں نے اللہ کی توحید (توحید) کا اقرار نہیں کیا، اور وہ اپنی نفوس (نفوس) کو آلودہ کرنے والے ہیں، پس وہ ناکام ہوئے، اپنے گھر کے اعتبار سے نہیں بلکہ دوسرے گھر کے اعتبار سے۔\n\nجس طرح یہاں کسی نے اس چیز سے تجاوز نہیں کیا جو اس کے لیے مقدر کی گئی تھی اور جو اس کی خاص نشأت (نشأت) نے اسے عطا کی تھی، اسی طرح وہاں بھی اس نے اس چیز سے تجاوز نہیں کیا جو اس کے لیے مقدر کی گئی تھی—اس کا وہ ٹھکانہ (موطن) جو اس کے لیے مقرر کیا گیا تھا۔ پس جو نعمت (النعيم) کے لیے پیدا کیا گیا، وہ اسے آسانی (اليسرى) کے لیے میسر کرے گا: \"پس جس نے دیا اور پرہیزگاری اختیار کی، اور بہترین (الحسنیٰ) کی تصدیق کی، تو ہم اسے آسانی (اليسرى) کے لیے میسر کریں گے۔\" (قرآن ۹۲:۵-۷) اور جو جہنم (الجحيم) کے لیے پیدا کیا گیا، وہ اسے مشکل (العسرى) کے لیے میسر کرے گا: \"اور جس نے اپنے رب (رب) کے مقابلے میں اپنی نفس (نفس) سے بخل کیا، جب اس نے اس سے اس کا دل مانگا تاکہ اسے ایمان (ایمان) یا توحید (توحید) کے ذریعے اپنا گھر بنا لے، اور اپنے گمان میں اپنے رب (رب) سے بے نیاز (استغنیٰ) ہوا، اور بہترین (الحسنیٰ) کی تکذیب کی—جو کہ اسماء حسنیٰ (الأسماء الحسنى) کے احکام ہیں—تو ہم اسے مشکل (العسرى) کے لیے میسر کریں گے۔\" (قرآن ۹۲:۸-۱۰) پس یہ مشکل (التعسير) کو میسر کرنا ہے، اور یہ آلودہ کرنے (الدس) سے مشابہت رکھتا ہے۔ کیونکہ آلودہ کرنا (الدس) مشکل کی خبر دیتا ہے، نہ کہ آسانی کی۔ پس اگر کوئی کوشش کرے کہ وہ اس چیز میں داخل ہو جائے جو اسے نہیں سمو سکتی، تو یہ اس کے لیے بالکل ممکن نہیں ہے۔ اور اللہ نے کسی نفس (نفس) کو حقیقت (نفس الأمر) میں اس کی وسعت (وسع) سے زیادہ مکلف نہیں کیا۔ اور اسی لیے اس کی رحمت (رحمت) ہر چیز کو محیط ہے۔ اور غضب زائل ہو گیا اور اس کا حکم اٹھا لیا گیا، اور مراتب (المراتب) متعین ہو گئے، اور مذاہب (المذاهب) واضح ہو گئے، اور سوار سے سواری کو ممتاز کر دیا گیا۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راہ دکھاتا ہے۔ (قرآن ۳۳:۴)",
    "fa": "باب چهارصد و هشتاد و سوم در معرفت حال قطبی که منزل او [آیه] «قَدْ أَفْلَحَ من زَكَّاها وقَدْ خابَ من دَسَّاها» (به راستی رستگار شد کسی که آن [نفس] را تزکیه کرد و به راستی زیانکار شد کسی که آن را فرو پوشاند) بود.\n\nنفس رستگار شد آنگاه که متصف گشت\nبه صفات قدس در نشأت خویش\n\nیا به امری عارضی که برای او بود\nو در آن بر حکمت خود ایستاد\n\nپس این دو در حکم یکسانند بر\nآنچه امر از سورت (قوت/شدت) آن اقتضا کرد\n\nو آنکه آن را در میان این دو فرو پوشاند\nبدون وصفی، از جمله آن زیانکار شد\n\nپس از آنچه تولید می‌کند، پاسخ نداد\nهمانا او در صورت آن آشکار است\n\nپس حمد از آن اوست بر این و آن\nبه خاطر ورود کائنات در رحمت آن (نفس)\n\n### [همانا نفس به پروردگارش بزرگ و شریف می‌شود]\n\nتحقق این ذکر آن است که نفس جز به پروردگارش تزکیه نمی‌شود؛ پس به واسطه او در ذات خود شرافت و عظمت می‌یابد، زیرا زکات (الزكاة) به معنای رشد و نمو است. پس کسی که حق (الحق) شنوایی و بینایی و تمامی قوای او باشد و صورت در عالم شهود، صورت خلق باشد، نفس چنین کسی تزکیه شده و رشد یافته است و «از هر جفت بهجت‌آور رویانیده است» (وَأَنْبَتَتْ مِنْ كُلِّ زَوْجٍ بَهِيجٍ)، مانند اسماء الهی برای خداوند. و تمامی خلق در نفس‌الامر (نفس الأمر) دارای این وصف هستند. و اگر در نفس‌الامر چنین نبود، ظهور و وجودی برای صورت خلق صحیح نمی‌شد. و به همین دلیل «زیانکار شد کسی که آن را فرو پوشاند» (وَقَدْ خَابَ مَنْ دَسَّاهَا)، زیرا او این حقیقت را نادیده گرفت و گمان کرد که آن را در این وصف پنهان کرده است، در حالی که نمی‌دانست این وصف برای نفس او وصفی ذاتی است که از آن جدا نمی‌شود و زوالش محال است. به همین دلیل او را به زیانکاری (الخيبة) وصف کرد، چون این را ندانست. و به همین دلیل فرمود: «به راستی رستگار شد» (قَدْ أَفْلَحَ)، پس بقا را برای او فرض کرد. و بقا جز برای خداوند یا آنچه نزد خداوند است، نیست. و در آنجا جز خداوند یا آنچه نزد اوست، وجود ندارد؛ پس خزانه‌های او تمام‌شدنی نیست. پس جز صورت‌هایی که پی در پی می‌آیند، نیست. و علم به آن‌ها به واسطه قول او «تا بدانیم» (حَتَّى نَعْلَمَ) بر آن‌ها جاری می‌شود، با وجود علم او به آن‌ها پیش از تفصیلشان. اگر او آن‌ها را در حال اجمالشان به صورت مفصل می‌دانست، آن‌ها را نمی‌دانست، زیرا آن‌ها مجمل هستند. و علم، علم نمی‌شود مگر آنکه تعلقش به همان چیزی باشد که معلوم بر آن است. زیرا معلوم است که علم را به ذات خود به او می‌دهد. و معلوم در اینجا غیر مفصل است، پس جز به صورت غیر مفصل دانسته نمی‌شود، مگر اینکه تفصیل را در اجمال می‌داند. و چنین چیزی دلالت نمی‌کند بر اینکه مجمل، مفصل است، بلکه دلالت می‌کند بر اینکه اگر بالفعل تفصیل یابد، قابلیت تفصیل را دارد. این معنای «تا بدانیم» است. و اگر امر چنان باشد که ذکر کردیم، پس کسی نیست که آن را فرو پوشانده باشد. و اگر کسی بود، او سزاوار وصف زیانکاری (الخيبة) بود، زیرا شیء نمی‌تواند در چیزی که قابلیت فرو پوشانده شدن را ندارد، قرار گیرد یا پنهان شود. و اگر آن را پنهان کرد، آن پذیرنده آن را قبول کرده است. و چون آن را قبول کرد، آن پنهان شده از مرتبه خود تجاوز نکرده است، زیرا در جایگاه خود فرود آمده و در مکان خود مستقر شده است. پس کسی که آن را پنهان کرده، به زیانکاری (الخيبة) که از محرومیت فهمیده می‌شود، دچار نشده است. پس او علم دارد، اما به هدف خود نرسیده است. محرومیت او، عدم نیل به غرضش است. زیرا علم محبوب همگان نیست. و اگر علم محبوب همگان بود، کسی نمی‌گفت که علم حجاب است. و طبایع از حجاب در برابر خیر، دوری می‌کنند. و ما وقتی می‌گوییم علم حجاب است، منظورمان این است که از جهل حجاب می‌شود، زیرا وجود و عدم با هم جمع نمی‌شوند، یعنی نفی و اثبات. پس زیانکار نمی‌شوند مگر صاحبان اغراض، و آن‌ها همان شقاوتمندان هستند. پس کسی که غرضی ندارد، زیانکاری ندارد.\n\nو تو می‌دانی که اگر چیزی در چیزی پنهان شود، اگر آن چیز گنجایش آن را نداشته باشد، در آن پنهان نمی‌شود. و اگر پنهان شد، پس گنجایش آن را داشته است. و جز آنچه برای اوست، گنجایش آن را ندارد. پس هر خانه‌ای اهلی دارد. و در آخرت جز دو خانه نیست: بهشت و اهل آن، که همان موحدان هستند، به هر روی که توحید ورزیده باشند، و آن‌ها کسانی هستند که نفوس خود را تزکیه کرده‌اند. و خانه دوم آتش است و اهل آن، که کسانی هستند که خدا را توحید نکرده‌اند و آن‌ها کسانی هستند که نفوس خود را فرو پوشانده‌اند. پس زیانکار شدند، نه به اعتبار خانه خود، بلکه به اعتبار خانه دیگر. همان‌طور که هیچ‌کس در اینجا از آنچه برایش مقدر شده و آنچه نشأت خاص او به او داده، تجاوز نکرده است، در آنجا نیز از آنچه برایش مقدر شده و جایگاهش که برای آن مقدر شده تعیین شده، تجاوز نخواهد کرد. پس کسی که برای نعمت آفریده شده، او را برای آسانی (الیسری) آماده خواهد کرد: «اما کسی که بخشید و پرهیزگاری کرد و نیکویی (الحسنی) را تصدیق نمود، پس او را برای آسانی آماده خواهیم کرد» (فَأَمَّا مَنْ أَعْطَى وَاتَّقَى وَصَدَّقَ بِالْحُسْنَى فَسَنُيَسِّرُهُ لِلْيُسْرَى). و کسی که برای دوزخ آفریده شده، او را برای سختی (العسری) آماده خواهد کرد: «و اما کسی که به نفس خود بر پروردگارش بخل ورزید، آنجا که پروردگارش قلب او را طلبید تا آن را با ایمان یا توحید خانه‌ای برای خود قرار دهد، و از پروردگارش بی‌نیاز شد و نیکویی (الحسنی) را تکذیب کرد» (وَأَمَّا مَنْ بَخِلَ... وَاسْتَغْنَى... وَكَذَّبَ بِالْحُسْنَى) که همان احکام اسماء حسنی است، «پس او را برای سختی آماده خواهیم کرد» (فَسَنُيَسِّرُهُ لِلْعُسْرَى). پس این، آسان‌سازیِ سخت‌سازی است و شبیه به فرو پوشاندن (الدس) است، زیرا فرو پوشاندن به سختی اشاره دارد نه به آسانی. اگر کسی تلاش کند که وارد چیزی شود که گنجایش آن را ندارد، به طور کلی برایش ممکن نخواهد بود. و خداوند در نفس‌الامر (نفس الأمر) «هیچ نفسی را جز به اندازه توانش مکلف نکرده است» (مَا كَلَّفَ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا). و به همین دلیل رحمت او همه چیز را فرا گرفته است و غضب از بین رفته و حکم آن برداشته شده است، و مراتب مشخص شده و مذاهب آشکار گشته‌اند و سوار از مرکوب متمایز شده است. و خداوند «حق را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}