{
  "id": 7,
  "title": {
    "ar": "الباب السابع في معرفة بدء الجسوم الإنسانية",
    "en": "Chapter Seven: Concerning the Knowledge of the Origin of Human Bodies.",
    "ur": "ساتواں باب: انسانی اجسام کی ابتدا کی معرفت میں",
    "fa": "باب هفتم در معرفت آغاز جسم‌های انسانی"
  },
  "content": {
    "ar": "## (الباب السابع) في معرفة بدء الجسوم الإنسانية\n\n\nوهو آخر جنس موجود من العالم الكبير وآخر صنف من المولدات‏\n\n\n> نشأت حقيقة باطن الإنسان *** ملكا قويا ظاهر السلطان‏\n\n\n> ثم استوت في عرش آدم ذاته *** مثل استواء العرش بالرحمن‏\n\n\n> فبدت حقيقة جسمه في عينها *** وبها انتهى ملك الوجود الثاني‏\n\n\n> وبدت معارف لفظه في علمه *** عند الكرام وحامل الشنآن‏\n\n\n> فتصاغرت لعلومه أحلامهم *** وتكبر الملعون من شيطان‏\n\n\n> باءوا بقرب الله في ملكوته *** إلا الشويطن باء بالخسران‏\n\n\n### [عمر العالم الطبيعي‏]\n\n\nاعلم أيدك الله أنه لما مضى من عمر العالم الطبيعي المقيد بالزمان المحصور بالمكان إحدى وسبعون ألف سنة من السنين المعروفة في الدنيا وهذه المدة أحد عشر يوما من أيام غير هذا الاسم ومن أيام ذي المعارج يوم وخمسا يوم وفي هذه الأيام يقع التفاضل قال تعالى في يَوْمٍ كانَ مِقْدارُهُ خَمْسِينَ أَلْفَ سَنَةٍ وقال وإِنَّ يَوْماً عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ فأصغر الأيام هي التي نعدها حركة الفلك المحيط الذي يظهر في يومه الليل والنهار فأقصر يوم عند العرب وهو هذا لأكبر فلك وذلك لحكمه على ما في جوفه من الأفلاك إذ كانت حركة ما دونه في الليل والنهار حركة قسرية له قهر بها سائر الأفلاك التي يحيط بها\n\n\n### [الحركة الطبيعية والقسرية للأفلاك‏]\n\n\nولكل فلك حركة طبيعية تكون له مع الحركة القسرية فكل فلك دونه ذو حركتين في وقت واحد حركة طبيعية وحركة قسرية ولكل حركة طبيعية في كل فلك يوم مخصوص بعد مقداره بالأيام الحادثة عن الفلك المحيط المعبر عنها بقوله مِمَّا تَعُدُّونَ وكلها تقطع في الفلك المحيط فكلما قطعته على الكمال كان يوما لها ويدور الدور فأصغر الأيام منها هو ثمانية وعشرون يوما مما تعدون وهو مقدار قطع حركة القمر في الفلك المحيط ونصب الله هذه الكواكب السبعة في السموات ليدرك البصر قطع فلكها في الفلك المحيط لنعلم عدد السنين والحساب قال تعالى وقَدَّرَهُ مَنازِلَ لِتَعْلَمُوا عَدَدَ السِّنِينَ والْحِسابَ وكُلَّ شَيْ‏ءٍ فَصَّلْناهُ تَفْصِيلًا ذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ فلكل كوكب منها يوم مقدر يفضل بعضها على بعض على قدر سرعة حركاتها الطبيعية أو صغر أفلاكها وكبرها\n\n\n### [خلق القلم واللوح‏]\n\n\nفاعلم إن الله تعالى لما خلق القلم واللوح وسماهما العقل والروح وأعطى الروح صفتين صفة علمية وصفة عملية وجعل العقل لها معلما ومفيدا إفادة مشاهدة حالية كما تستفيد من صورة السكين القطع من غير نطق يكون منه في ذلك وخلق تعالى جوهرا دون النفس الذي هو الروح المذكور سماه الهباء وهذه الاسمية له نقلناها من كلام علي بن أبي طالب رضي الله عنه‏\n\n\n### [خلق الهباء]\n\n\nوأما الهباء\nفمذكور في اللسان العربي قال تعالى فَكانَتْ هَباءً مُنْبَثًّا كذلك لما رآها علي بن أبي طالب أعني هذه الجوهرة منبثة في جميع الصور الطبيعية كلها وأنها لا تخلو صورة منها إذ لا تكون صورة إلا في هذه الجوهرة سماها هباء وهي مع كل صورة بحقيقتها لا تنقسم ولا تتجزى ولا تتصف بالنقص بل هي كالبياض الموجود في كل أبيض بذاته وحقيقته ولا يقال قد نقص من البياض قدر ما حصل منه في هذا الأبيض فهذا مثل حال هذه الجوهرة\n\n\n### [المراتب الأربعة بين الروح والهباء]\n\n\nوعين الله سبحانه بين هذا الروح الموصوف بالصفتين وبين الهباء أربع مراتب وجعل كل مرتبة منزلا لأربعة أملاك وجعل هؤلاء الأملاك كالولاة على ما أحدثه سبحانه دونهم من العالم من عليين إلى أسفل سافلين ووهب كل ملك من هؤلاء الملائكة علم ما يريد إمضائه في العالم فأول شي‏ء أوجده الله في الأعيان مما يتعلق به علم هؤلاء الملائكة وتدبيرهم الجسم الكلي وأول شكل فتح في هذا الجسم الشكل الكري المستدير إذ كان أفضل الأشكال ثم نزل سبحانه بالإيجاد والخلق إلى تمام الصنعة وجعل جميع ما خلقه تعالى مملكة لهؤلاء الملائكة وولاهم أمورها في الدنيا والآخرة وعصمهم عن المخالفة فيما أمرهم به فأخبرنا سبحانه أنهم لا يَعْصُونَ الله ما أَمَرَهُمْ ويَفْعَلُونَ ما يُؤْمَرُونَ‏\n\n\n### [خلق المولدات‏]\n\n\nولما انتهى خلق المولدات من الجمادات والنبات والحيوان بانتهاء إحدى وسبعين ألف سنة من سنى الدنيا مما نعد ورتب العالم ترتيبا حكميا ولم يجمع سبحانه لشي‏ء مما خلقه من أول موجود إلى آخر مولود وهو الحيوان بين يديه تعالى إلا للإنسان وهي هذه النشأة البدنية الترابية بل خلق كل ما سواها إما عن أمر إلهي أو عن يد واحدة قال تعالى إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ فهذا عن أمر إلهي وورد في الخبر أن الله عز وجل خلق جنة عدن بيده وكتب التوراة بيده وغرس شجرة طوبى بيده وخلق آدم الذي هو الإنسان بيديه‏\n\n\nفقال تعالى لإبليس على جهة التشريف لآدم عليه السلام ما مَنَعَكَ أَنْ تَسْجُدَ لِما خَلَقْتُ بِيَدَيَ‏\n\n\n### [الفلك الأدنى والبروج الاثنا عشر]\n\n\nولما خلق الله الفلك الأدنى الذي هو الأول المذكور آنفا قسمه اثني عشر قسما سماها قال تعالى والسَّماءِ ذاتِ الْبُرُوجِ فجعل كل قسم برجا وجعل تلك الأقسام ترجع إلى أربعة في الطبيعة ثم كرر كل واحد من الأربعة في ثلاثة مواضع منه وجعل هذه الأقسام كالمنازل والمناهل التي ينزل فيها المسافرون ويسير فيها السائرون في حال سيرهم وسفرهم لينزل في هذه الأقسام عند سير الكواكب فيها وسياحتهم ما يحدث الله في جوف هذا الفلك من الكواكب التي تقطع بسيرها في هذه البروج ليحدث الله عند قطعها وسيرها ما شاء أن يحدث الله في جوفي هذا الفلك من الكواكب التي تقطع بسيرها في هذه البروج ليحدث الله عند قطعها وسيرها ما شاء أن يحدث من العالم الطبيعي والعنصري وجعلها علامات على أثر حركة فلك البروج فاعلم‏\n\n\n### [الطبائع والعناصر الأربعة]\n\n\nفقسم من هذه الأربعة طبيعته الحرارة واليبوسة والثاني البرودة واليبوسة والثالث الحرارة والرطوبة والرابع البرودة والرطوبة وجعل الخامس والتاسع من هذه الأقسام مثل الأول وجعل السادس والعاشر مثل الثاني وجعل السابع والحادي عشر مثل الثالث وجعل الثامن والثاني عشر مثل الرابع أعني في الطبيعة فحصر الأجسام الطبيعية بخلاف والأجسام العنصرية بلا خلاف في هذه الأربعة التي هي الحرارة والبرودة والرطوبة واليبوسة ومع كونها أربعا أمهات فإن الله جعل اثنين منها أصلا في وجود الاثنين الآخرين فانفعلت اليبوسة عن الحرارة والرطوبة عن البرودة فالرطوبة واليبوسة موجودتان عن سببين هما الحرارة والبرودة ولهذا ذكر الله في قوله تعالى ولا رَطْبٍ ولا يابِسٍ إِلَّا في كِتابٍ مُبِينٍ لأن المسبب يلزم من كونه مسببا وجود السبب أو منفعلا وجود الفاعل كيف شئت فقل ولا يلزم من وجود السبب وجود المسبب‏\n\n\n### [الفلك الأطلس‏]\n\n\nولما خلق الله هذا الفلك الأول دار دورة غير معلومة الانتهاء إلا لله تعالى لأنه ليس فوقه شي‏ء محدود من الأجرام يقطع فيه فإنه أول الأجرام الشفافة فتتعدد الحركات وتتميز ولا كان قد خلق الله في جوفه شيئا فتتميز الحركات وتنتهي عند من يكون في جوفه ولو كان لم تتميز أيضا لأنه أطلس لا كوكب فيه متشابه الأجزاء فلا يعرف مقدار الحركة الواحدة منه ولا تتعين فلو كان فيه جزء مخالف لسائر أجزائه عد به حركاته بلا شك ولكن علم الله قدرها وانتهاءها وكرورها فحدث عن تلك الحركة اليوم ولم يكن ثم ليل ولا نهار في هذا اليوم ثم استمرت حركات هذا الفلك فخلق الله ملائكة خمسة وثلاثين ملكا أضافهم إلى ما ذكرناه من الأملاك الستة عشر فكان الجميع أحدا وخمسين ملكا من جملة هؤلاء الملائكة جبريل وميكائيل وإسرافيل وعزرائيل ثم خلق تسعمائة ملك وأربعا وسبعين وأضافهم إلى ما ذكرناه من الأملاك وأوحى إليهم وأمرهم بما يجري على أيديهم في خلقه فقالوا\nوما نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ لَهُ ما بَيْنَ أَيْدِينا وما خَلْفَنا وما بَيْنَ ذلِكَ وما كانَ رَبُّكَ نَسِيًّا وقال فيهم لا يَعْصُونَ الله ما أَمَرَهُمْ فهؤلاء من الملائكة هم الولاة خاصة وخلق الله ملائكة هم عمار السموات والأرض لعبادته فما في السماء والأرض موضع إلا وفيه ملك ولا يزال الحق يخلق من أنفاس العالم ملائكة ما داموا متنفسين‏\n\n\n### [خلق الدار الدنيا]\n\n\nولما انتهى من حركات هذا الفلك الأول ومدته أربع وخمسون ألف سنة مما تعدون خلق الله الدار الدنيا وجعل لها أمدا معلوما تنتهي إليه وتنقضي صورتها وتستحيل من كونها دارا لنا وقبولها صورة مخصوصة وهي التي نشاهدها اليوم إلى أن تبدل الْأَرْضُ غَيْرَ الْأَرْضِ والسَّماواتُ ولما انقضى من مد حركة هذا الفلك ثلاث وستون ألف سنة مما تعدون خلق الله الدار الآخرة الجنة والنار اللتين أعدهما الله لعباده السعداء والأشقياء فكان بين خلق الدنيا وخلق الآخرة تسع آلاف سنة مما تعدون ولهذا سميت آخرة لتاخر خلقها عن خلق الدنيا وسميت الدنيا الأولى لأنها خلقت قبلها قال تعالى ولَلْآخِرَةُ خَيْرٌ لَكَ من الْأُولى‏ يخاطب نبيه صلى الله عليه وسلم ولم يجعل للآخرة مدة ينتهي إليها بقاؤها فلها البقاء الدائم‏\n\n\n### [سقف الجنة الفلك الأطلس‏]\n\n\nوجعل سقف الجنة هذا الفلك وهو العرش عندهم الذي لا تتعين حركته ولا تتميز فحركته دائمة لا تنقضي وما من خلق ذكرناه خلق إلا وتعلق القصد الثاني منه وجود الإنسان الذي هو الخليفة في العالم وإنما قلت القصد الثاني إذ كان القصد الأول معرفة الحق وعبادته التي لها خلق العالم كله فما من شي‏ء إلا وهو يُسَبِّحُ بِحَمْدِهِ ومعنى القصد الثاني والأول التعلق الإرادي لا حدوث الإرادة لأن الإرادة لله صفة قديمة أزلية اتصفت بها ذاته كسائر صفاته‏\n\n\n### [حركة السماوات وحركة الأرض‏]\n\n\nولما خلق الله هذه الأفلاك والسموات وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها ورتب فيها أنوارها وسرجها وعمرها بملائكته وحركها تعالى فتحركت طائعة لله آتية إليه طلبا للكمال في العبودية التي تليق بها لأنه تعالى دعاها ودعا الأرض ف فَقالَ لَها ولِلْأَرْضِ ائْتِيا طَوْعاً أَوْ كَرْهاً لأمر حد لهما قالَتا أَتَيْنا طائِعِينَ فهما آتيتان أبدا فلا تزالان متحركتين غير أن حركة الأرض خفية عندنا وحركتها حول الوسط لأنها أكر فأما السماء فاتت طائعة عند أمر الله لها بالإتيان وأما الأرض فاتت طائعة لما علمت نفسها مقهورة وأنه لا بد أن يؤتى بها بقوله أَوْ كَرْهاً فكانت المرادة بقوله تعالى أَوْ كَرْهاً فاتت طائعة كرها فَقَضاهُنَّ سَبْعَ سَماواتٍ في يَوْمَيْنِ وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها\n\n\n### [خلق الأرض وتقدير أقواتها]\n\n\nوقد كان خَلَقَ الْأَرْضَ وقَدَّرَ فِيها أَقْواتَها من أجل المولدات فجعلها خزانة لأقواتهم وقد ذكرنا ترتيب نش‏ء العالم في كتاب عقلة المستوفز فكان من تقدير أقواتها وجود الماء والهواء والنار وما في ذلك من البخارات والسحب والبروق والرعود والآثار العلوية وذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ وخلق الجان من النار والطير والدواب البرية والبحرية والحشرات من عفونات الأرض ليصفو الهواء لنا من بخارات العفونات التي لو خالطت الهواء الذي أودع الله حياة هذا الإنسان والحيوان وعافيته فيه لكان سقيما مريضا معلولا فصفى له الجو سبحانه لطفا منه بتكوين هذه المعفنات فقلت الأسقام والعلل‏\n\n\n### [خلق الإنسان‏]\n\n\nولما استوت المملكة وتهيأت وما عرف أحد من هؤلاء المخلوقات كلها من أي جنس يكون هذا الخليفة الذي مهد الله هذه المملكة لوجوده فلما وصل الوقت المعين في علمه لإيجاد هذا الخليفة بعد أن مضى من عمر الدنيا سبع عشرة ألف سنة ومن عمر الآخرة الذي لا نهاية له في الدوام ثمان آلاف سنة أمر الله بعض ملائكته أن يأتيه بقبضة من كل أجناس تربة الأرض فأتاه بها في خبر طويل معلوم عند الناس فأخذها سبحانه وخمرها بيديه فهو قوله لِما خَلَقْتُ بِيَدَيَّ وكان الحق قد أودع عند كل ملك من الملائكة الذين ذكرناهم وديعة لآدم وقال لهم إِنِّي خالِقٌ بَشَراً من طِينٍ وهذه الودائع التي بأيديكم له فإذا خلقته فليؤد إليه كل واحد منكم ما عنده مما أمنتكم عليه ثم فَإِذا سَوَّيْتُهُ ونَفَخْتُ فِيهِ من رُوحِي فَقَعُوا لَهُ ساجِدِينَ فلما خمر الحق تعالى بيديه طينة آدم حتى تغير ريحها وهو المسنون وذلك الجزء الهوائي الذي في النشأة جعل ظهره محلا للأشقياء والسعداء من ذريته فأودع فيه ما كان في قبضتيه فإنه سبحانه أخبرنا أن في قبضة يمينه السعداء وفي قبضة اليد الأخرى الأشقياء وكلتا يدي ربي يمين مباركة وقال هؤلاء للجنة وبعمل أهل الجنة يعملون وهؤلاء للنار وبعمل أهل النار يعملون وأودع الكل طينة آدم وجمع فيه الأضداد بحكم المجاورة وأنشأه على الحركة المستقيمة وذلك في دولة السنبلة وجعله ذا جهات ست الفوق وهو ما يلي رأسه والتحت يقابله وهو ما يلي رجليه واليمين وهو ما يلي جانبه الأقوى والشمال يقابله وهو ما يلي جانبه‏\nالأضعف والأمام وهو ما يلي الوجه ويقابله الخلف وهو ما يلي القفا وصوره وعدله وسواه ثم نفخ فيه من روحه المضاف إليه فحدث عند هذا النفخ فيه بسريانه في أجزائه أركان الأخلاط التي هي الصفراء والسوداء والدم والبلغم فكانت الصفراء عن الركن الناري الذي أنشأه الله منه في قوله تعالى من صَلْصالٍ كَالْفَخَّارِ وكانت السوداء عن التراب وهو قوله خَلَقَهُ من تُرابٍ وكان الدم من الهواء وهو قوله مَسْنُونٍ وكان البلغم من الماء الذي عجن به التراب فصار طينا ثم أحدث فيه القوة الجاذبة التي بها يجذب الحيوان الأغذية ثم القوة الماسكة وبها يمسك ما يتغذى به الحيوان ثم القوة الهاضمة وبها يهضم الغذاء ثم القوة الدافعة وبها يدفع الفضلات عن نفسه من عرق وبخار ورياح وبراز وأمثال ذلك وأما سريان الأبخرة وتقسيم الدم في العروق من الكبد وما يخلصه كل جزء من الحيوان فبالقوة الجاذبة لا الدافعة فحظ القوة الدافعة ما نخرجه كما قلنا من الفضلات لا غير ثم أحدث فيه القوة الغاذية والمنمية والحاسية والخيالية والوهمية والحافظة والذاكرة وهذا كله في الإنسان بما هو حيوان لا بما هو إنسان فقط غير أن هذه القوي الأربعة قوة الخيال والوهم والحفظ والذكر هي في الإنسان أقوى منها في الحيوان ثم خص آدم الذي هو الإنسان بالقوة المصورة والمفكرة والعاقلة فتميز عن الحيوان وجعل هذه القوي كلها في هذا الجسم آلات للنفس الناطقة لتصل بذلك إلى جميع منافعها المحسوسة والمعنوية ثم أنشأه خلقا آخر وهو الإنسانية فجعله دراكا بهذه القوي حيا عالما قادرا مريدا متكلما سميعا بصيرا على حد معلوم معتاد في اكتسابه فَتَبارَكَ الله أَحْسَنُ الْخالِقِينَ ثم إنه سبحانه ما سمي نفسه باسم من الأسماء إلا وجعل للإنسان من التخلق بذلك الاسم حظا منه يظهر به في العالم على قدر ما يليق به ولذلك تأول بعضهم‏\n\n\nقوله عليه السلام إن الله خلق آدم على صورته‏\n\n\nعلى هذا المعنى وأنزله خليفة عنه في أرضه إذ كانت الأرض من عالم التغيير والاستحالات بخلاف العالم الأعلى فيحدث فيهم من الأحكام بحسب ما يحدث في العالم الأرضي من التغيير فيظهر لذلك حكم جميع الأسماء الإلهية فلذلك كان خليفة في الأرض دون السماء والجنة ثم كان من أمره ما كان من علم الأسماء وسجود الملائكة وإباية إبليس يأتي ذكر ذلك كله في موضعه إن شاء الله‏\n\n\n### [الجسوم الانسانية وأنواعها]\n\n\nفإن هذا الباب مخصوص بابتداء الجسوم الإنسانية وهي أربعة أنواع جسم آدم وجسم حواء وجسم عيسى وأجسام بنى آدم وكل جسم من هذه الأربعة نشؤه يخالف نش‏ء الآخر في السببية مع الاجتماع في الصورة الجسمانية والروحانية وإنما سقنا هذا ونبهنا عليه لئلا يتوهم الضعيف العقل أن القدرة الإلهية أو أن الحقائق لا تعطي أن تكون هذه النشأة الإنسانية إلا عن سبب واحد يعطي بذاته هذا النش‏ء فرد الله هذه الشبهة بأن أظهر هذا النش‏ء الإنساني في آدم بطريق لم يظهر به جسم حواء وأظهر جسم حواء بطريق لم يظهر جسم ولد آدم وأظهر جسم أولاد آدم بطريق لم يظهر به جسم عيسى عليه السلام وينطلق على كل واحد من هؤلاء اسم الإنسان بالحد والحقيقة ذلك ليعلم أَنَّ الله بِكُلِّ شَيْ‏ءٍ عَلِيمٌ وأَنَّهُ عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ ثم إن الله قد جمع هذه الأربعة الأنواع من الخلق في آية من القرآن في سورة الحجرات فقال يا أَيُّهَا النَّاسُ إِنَّا خَلَقْناكُمْ يريد آدم من ذَكَرٍ يريد حواء وأُنْثى‏ يريد عيسى ومن المجموع من ذكر وأنثى يريد بنى آدم بطريق النكاح والتوالد فهذه الآية من جوامع الكلم وفصل الخطاب الذي أوتي محمد صلى الله عليه وسلم‏\n\n\n### [جسم آدم وجسم حواء]\n\n\nولما ظهر جسم آدم كما ذكرناه ولم تكن فيه شهوة نكاح وكان قد سبق في علم الحق إيجاد التوالد والتناسل والنكاح في هذه الدار إنما هو لبقاء النوع فاستخرج من ضلع آدم من القصيري حواء فقصرت بذلك عن درجة الرجل كما قال تعالى ولِلرِّجالِ عَلَيْهِنَّ دَرَجَةٌ فما تلحق بهم أبدا وكانت من الضلع للانحناء الذي في الضلوع لتحنو بذلك على ولدها وزوجها فحنو الرجل على المرأة حنوه على نفسه لأنها جزء منه وحنو المرأة على الرجل لكونها خلقت من الضلع والضلع فيه انحناء وانعطاف‏\n\n\n### [حب آدم وحب حواء]\n\n\nوعمر الله الموضع من آدم الذي خرجت منه حواء بالشهوة إليها إذ لا يبقى في الوجود خلاء فلما عمره بالهواء حن إليها حنينه إلى نفسه لأنها جزء منه وحنت إليه لكونه موطنها الذي نشأت فيه فحب حواء حب الموطن وحب آدم حب نفسه ولذلك يظهر حب الرجل للمرأة إذ كانت عينه وأعطيت المرأة القوة المعبر عنها بالحياء في محبة الرجل فقويت على الإخفاء لأن الموطن لا يتحد بها اتحاد آدم بها فصور في ذلك الضلع جميع ما صوره وخلقه في جسم آدم فكان نش‏ء جسم آدم في صورته كنش‏ء الفاخوري فيما\nينشئه من الطين والطبخ وكان نش‏ء جسم حواء نش‏ء النجار فيما ينحته من الصور في الخشب فلما نحتها في الضلع وأقام صورتها وسواها وعدلها نفخ فيها من روحه فقامت حية ناطقة أنثى ليجعلها محلا للزراعة والحرث لوجود الإنبات الذي هو التناسل فسكن إليها وسكنت إليه وكانت لباسا له وكان لباسا لها قال تعالى هُنَّ لِباسٌ لَكُمْ وأَنْتُمْ لِباسٌ لَهُنَّ وسرت الشهوة منه في جميع أجزائه فطلبها\n\n\n### [تكوين الجسم الثالث‏]\n\n\nفَلَمَّا تَغَشَّاها وألقى الماء في الرحم ودار بتلك النطفة من الماء دم الحيض الذي كتبه الله على النساء تكون في ذلك الجسم جسم ثالث على غير ما تكون منه جسم آدم وجسم حواء فهذا هو الجسم الثالث فتولاه الله بالنش‏ء في الرحم حالا بعد حال بالانتقال من ماء إلى نطفة إلى علقة إلى مضغة إلى عظم ثم كسا العظم لحما فلما أتم نشأته الحيوانية أنشأه خلقا آخر فنفخ فيه الروح الإنساني فَتَبارَكَ الله أَحْسَنُ الْخالِقِينَ ولو لا طول الأمر لبينا تكوينه في الرحم حالا بعد حال ومن يتولى ذلك من الملائكة الموكلين بإنشاء الصور في الأرحام إلى حين الخروج ولكن كان الغرض الإعلام بأن الأجسام الإنسانية وإن كانت واحدة في الحد والحقيقة والصور الحسية والمعنوية فإن أسباب تأليفها مختلفة لئلا يتخيل أن ذلك لذات السبب تعالى الله بل ذلك راجع إلى فاعل مختار يفعل ما يشاء كيف يشاء من غير تحجير ولا قصور على أمر دون أمر لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ‏\n\n\n### [تكوين جسم عيسى‏]\n\n\nولما قال أهل الطبيعة إن ماء المرأة لا يتكون منه شي‏ء وإن الجنين الكائن في الرحم إنما هو من ماء الرجل لذلك جعلنا تكوين جسم عيسى تكوينا آخر وإن كان تدبيره في الرحم تدبير أجسام البنين فإن كان من ماء المرأة إذ تمثل لها الروح بَشَراً سَوِيًّا أو كان عن نفخ بغير ماء فعلى كل وجه هو جسم رابع مغاير في النش‏ء غيره من أجسام النوع ولذلك قال تعالى إِنَّ مَثَلَ عِيسى‏ أي صفة نش‏ء عيسى عِنْدَ الله كَمَثَلِ آدَمَ خَلَقَهُ من تُرابٍ الضمير يعود على آدم ووقع الشبه في خلقه من غير أب أي صفة نشئه صفة نش‏ء آدم إلا أن آدم خلقه من تراب ثُمَّ قالَ لَهُ كُنْ ثم إن عيسى على ما قيل لم يلبث في بطن مريم لبث البنين المعتاد لأنه أسرع إليه التكوين لما أراد الله أن يجعله آية ويرد به على الطبيعيين حيث حكموا على الطبيعة بما أعطتهم من العادة لا بما تقتضيه مما أودع الله فيها من الأسرار والتكوينات العجيبة ولقد أنصف بعض حذاق هذا الشأن الطبيعة فقال لا نعلم منها إلا ما أعطتنا خاصة وفيها ما لا نعلم‏\n\n\n### [الإنسان في الأرض نظير العقل في السماء]\n\n\nفهذا قد ذكرنا ابتداء الجسوم الإنسانية وإنها أربعة أجسام مختلفة النش‏ء كما قررنا وأنه آخر المولدات فهو نظير العقل الأول وبه ارتبط لأن الوجود دائرة فكان ابتداء الدائرة وجود العقل الأول الذي ورد في الخبر أنه أول ما خلق الله العقل فهو أول الأجناس وانتهى الخلق إلى الجنس الإنساني فكملت الدائرة واتصل الإنسان بالعقل كما يتصل آخر الدائرة بأولها فكانت دائرة وما بين طرفي الدائرة جميع ما خلق الله من أجناس العالم بين العقل الأول الذي هو القلم أيضا وبين الإنسان الذي هو الموجود الآخر ولما كانت الخطوط الخارجة من النقطة التي في وسط الدائرة إلى المحيط الذي وجد عنها تخرج على السواء لكل جزء من المحيط كذلك نسبة الحق تعالى إلى جميع الموجودات نسبة واحدة فلا يقع هناك تغيير البتة كانت الأشياء كلها ناظرة إليه وقابلة منه ما يهبها نظر أجزاء المحيط إلى النقطة وأقام سبحانه هذه الصورة الإنسانية بالحركة المستقيمة صورة العمد الذي للخيمة فجعله لقبة هذه السموات فهو سبحانه يمسكها أن تزول بسببه فعبرنا عنه بالعمد فإذا فنيت هذه الصورة ولم يبق منها على وجه الأرض أحد متنفس وانْشَقَّتِ السَّماءُ فَهِيَ يَوْمَئِذٍ واهِيَةٌ لأن العمد زال وهو الإنسان ولما انتقلت العمارة إلى الدار الآخرة بانتقال الإنسان إليها وخربت الدنيا بانتقاله عنها علمنا قطعا إن الإنسان هو العين المقصودة لله من العالم وأنه الخليفة حقا وأنه محل ظهور الأسماء الإلهية وهو الجامع لحقائق العالم كله من ملك وفلك وروح وجسم وطبيعة وجماد ونبات وحيوان إلى ما خص به من علم الأسماء الإلهية مع صغر حجمه وجرمه وإنما قال الله فيه بأن خلق السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ لكون الإنسان متولدا عن السماء والأرض فهما له كالأبوين فرفع الله مقدارهما ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ فلم يرد في الجرمية فإن ذلك معلوم حسا\n\n\n### [ابتلاء الإنسان الأكبر]\n\n\nغير أن الله تعالى ابتلاه ببلاء ما ابتلى به أحدا من خلقه إما لأن يسعده أو يشقيه على حسب ما يوفقه إلى استعماله فكان البلاء الذي ابتلاه به إن خلق فيه قوة تسمى الفكر وجعل هذه القوة خادمة لقوة أخرى تسمى العقل وجبر العقل مع سيادته على الفكر أن يأخذ منه ما يعطيه ولم يجعل للفكر مجالا إلا في القوة الخيالية وجعل سبحانه القوة الخيالية محلا\nجامعا لما تعطيها القوة الحساسة وجعل له قوة يقال لها المصورة فلا يحصل في القوة الخيالية إلا ما أعطاه الحس أو أعطته القوة المصورة ومادة المصورة من المحسوسات فتركب صورا لم يوجد لها عين لكن أجزاؤها كلها موجودة حسا وذلك لأن العقل خلق ساذجا ليس عنده من العلوم النظرية شي‏ء وقيل للفكر ميز بين الحق والباطل الذي في هذه القوة الخيالية فينظر بحسب ما يقع له فقد يحصل في شبهة وقد يحصل في دليل عن غير علم منه بذلك ولكن في زعمه أنه عالم بصور الشبه من الأدلة وأنه قد حصل على علم ولم ينظر إلى قصور المواد التي استند إليها في اقتناء العلوم فيقبلها العقل منه ويحكم بها فيكون جهله أكثر من علمه بما لا يتقارب ثم إن الله كلف هذا العقل معرفته سبحانه ليرجع إليه فيها لا إلى غيره ففهم العقل نقيض ما أراد به الحق بقوله تعالى أَ ولَمْ يَتَفَكَّرُوا لِقَوْمٍ يَتَفَكَّرُونَ فاستند إلى الفكر وجعله إماما يقتدى به وغفل عن الحق في مراده بالتفكر أنه خاطبه أن يتفكر فيرى أن علمه بالله لا سبيل إليه إلا بتعريف الله فيكشف له عن الأمر على ما هو عليه فلم يفهم كل عقل هذا الفهم إلا عقول خاصة الله من أنبيائه وأوليائه يا ليت شعري هل بأفكارهم قالُوا بَلى‏ حين أَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ في قبضة الذرية من ظهر آدم لا والله بل عناية إشهاده إياهم ذلك عند أخذه إياهم عنهم من ظهورهم ولما رجعوا إلى الأخذ عن قواهم المفكرة في معرفة الله لم يجتمعوا قط على حكم واحد في معرفة الله وذهب كل طائفة إلى مذهب وكثرت القالة في الجناب الإلهي الأحمى واجترءوا غاية الجراءة على الله وهذا كله من الابتلاء الذي ذكرناه من خلقه الفكر في الإنسان وأهل الله افتقروا إليه فيما كلفهم من الايمان به في معرفته وعلموا إن المراد منهم رجوعهم إليه في ذلك وفي كل حال فمنهم القائل سبحان من لم يجعل سبيلا إلى معرفته إلا العجز عن معرفته ومنهم من قال العجز عن درك الإدراك إدراك وقال صلى الله عليه وسلم لا أحصي ثناء عليك‏\n\n\nوقال تعالى ولا يُحِيطُونَ به عِلْماً فرجعوا إلى الله في المعرفة به وتركوا الفكر في مرتبته ووفوه حقه لم ينقلوه إلى ما لا ينبغي له التفكر فيه وقد ورد النهي عن التفكر في ذات الله‏\n\n\nوالله يقول ويُحَذِّرُكُمُ الله نَفْسَهُ فوهبهم الله من معرفته ما وهبهم وأشهدهم من مخلوقاته ومظاهره ما أشهدهم فعلموا أنه ما يستحيل عقلا من طريق الفكر لا يستحيل نسبة إلهية كما سنورد من ذلك طرفا في باب الأرض المخلوقة من بقية طينة آدم وغيرها فالذي ينبغي للعاقل أن ندين الله به في نفسه أن يعلم إِنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ من ممكن ومحال ولا كل محال نافذ الاقتدار واسع العطاء ليس لإيجاده تكرار بل أمثال تحدث في جوهر أوجده وشاء بقاه ولو شاء أفناه مع الأنفاس لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ‏\n\n",
    "en": "Chapter Seven: Concerning the Knowledge of the Origin of Human Bodies\n\nIt is the last existing genus of the Great World (العالم الكبير) and the last species of the generated things (المولدات).\n\n> The Reality of the inner aspect of the Human arose,\n> A powerful King, manifest in sovereignty.\n\n> Then its Essence (ذاته) settled upon Adam’s Throne,\n> Like the settling of the Throne upon the All-Merciful (الرحمن).\n\n> So the reality of his body appeared in its essence,\n> And with it ended the dominion of the Second Existence (الوجود الثاني).\n\n> And the gnoses (معارف) of his utterance appeared in his knowledge,\n> Both to the noble ones and the bearer of hatred.\n\n> Their intellects (أحلامهم) were humbled before his sciences,\n> But the accursed one, the devil (شيطان), grew arrogant.\n\n> They returned with proximity to Allah in His Dominion (ملكوته),\n> Except for the little devil (الشويطن), who returned with loss (الخسران).\n\n### [The Age of the Natural World]\n\nKnow, may Allah support you, that when seventy-one thousand years of the years known in this world had passed from the age of the Natural World (العالم الطبيعي), which is bound by time and confined by space—and this duration is eleven days of the days of another Name, and one day and five days of the days of the Possessor of the Ascending Stairways (ذي المعارج)—it is in these days that differentiation occurs. Allah the Exalted said: <<in a Day the measure of which is fifty thousand years>> (يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ), and He said: <<Indeed, a Day with your Lord is like a thousand years of those which you count>> (وَإِنَّ يَوْمًا عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ). The smallest of the days are those which we count by the movement of the encompassing sphere (الفلك المحيط), which manifests night and day in its cycle. The shortest day among the Arabs is this one, corresponding to the largest sphere, due to its governance over the spheres within its cavity, since the movement of what is below it during the night and day is a compulsory motion (حركة قسرية) by which it dominates all the other spheres it encompasses.\n\n### [The Natural and Compulsory Motion of the Spheres]\n\nEvery sphere has a natural motion (حركة طبيعية) that occurs alongside the compulsory motion. Thus, every sphere below the encompassing sphere has two motions simultaneously: a natural motion and a compulsory motion. For every natural motion in every sphere, there is a specific day whose measure is calculated by the days resulting from the encompassing sphere, referred to by His saying: <<of those which you count>> (مِمَّا تَعُدُّونَ). All of them traverse the encompassing sphere, and whenever a sphere completes its traversal, that constitutes a day for it, and the cycle turns. The smallest of these days is twenty-eight days of those which you count, which is the measure of the Moon’s movement traversing the encompassing sphere. Allah established these seven planets in the heavens so that sight might perceive the traversal of their spheres within the encompassing sphere, allowing us to know the number of years and the calculation. Allah the Exalted said: <<And He determined for it phases, that you might know the number of years and the calculation. And everything We have detailed with a thorough detailing. That is the determination of the Exalted in Might, the All-Knowing (الْعَزِيزِ الْعَلِيمِ)>>. Thus, each of these planets has a determined day, and they vary in measure according to the speed of their natural motions or the size of their spheres.\n\n### [The Creation of the Pen and the Tablet]\n\nKnow that when Allah the Exalted created the Pen (القلم) and the Tablet (اللوح), and named them the Intellect (العقل) and the Spirit (الروح), He granted the Spirit two attributes: a cognitive attribute (صفة علمية) and an operative attribute (صفة عملية). He made the Intellect a teacher and provider of benefit to the Spirit, a benefit derived from immediate witnessing (إفادة مشاهدة حالية), just as one derives the concept of cutting from the image of a knife without any verbal utterance from the knife itself. Then, the Exalted created a substance (جوهر) below the Soul (النفس), which is the aforementioned Spirit, and named it the Dust (الهباء). We have derived this nomenclature from the words of Ali ibn Abi Talib, may Allah be pleased with him.\n\n### [The Creation of the Haba]\n\nAs for the Dust (الهباء), it is mentioned in the Arabic language. Allah the Exalted said: <<and they became scattered dust (هَبَاءً مُنْبَثًّا)>>. Likewise, when Ali ibn Abi Talib saw this substance—meaning this essence—scattered throughout all natural forms, and that no form is devoid of it, since no form can exist except within this substance, he named it *Haba*. It exists with every form by its reality (حقيقتها); it is neither divisible nor particulate, nor is it characterized by deficiency. Rather, it is like the whiteness existing in every white thing by its essence and reality, and one does not say that the whiteness has decreased by the amount that has manifested in this white object. This is similar to the state of this substance.\n\n### [The Four Levels between the Spirit and the Haba]\n\nBetween this Spirit, described by the two attributes, and the Dust (الهباء), Allah the Glorious established four Levels (المراتب). He made each Level a station for four angels, and He made these angels like governors (الولاة) over the world that He brought into existence below them, from the Highest Heights (عليين) to the Lowest of the Low (أسفل سافلين). He bestowed upon each of these angels the knowledge of what He intended to execute in the world. The first thing Allah brought into existence in the Fixed Entities (الأعيان) that relates to the knowledge and administration of these angels was the Universal Body (الجسم الكلي). The first shape opened within this Body was the spherical, circular form (الشكل الكري المستدير), as it is the most excellent of shapes. Then, the Glorious descended with creation and origination until the completion of the making. He made everything He created a dominion for these angels and entrusted them with its affairs in this world and the Hereafter. He protected them from disobeying what He commanded them, for He informed us that <<They do not disobey Allah in what He commands them but do what they are commanded>>.\n\n### [The Creation of the Generated Things]\n\nWhen the creation of the generated things (المولدات)—minerals, plants, and animals—was completed at the end of seventy-one thousand years of the years of this world that we count, and the World (العالم) was arranged in a wise order, Allah the Glorious did not combine His two Hands for anything He created, from the first existing thing to the last generated thing, which is the animal, except for the Human, meaning this physical, earthly constitution (النشأة البدنية الترابية). Everything else was created either by a Divine Command or by a single Hand. Allah the Exalted said: <<Our word to a thing, when We intend it, is only that We say to it, 'Be,' and it is>>. This is by a Divine Command. It is mentioned in the tradition (الخبر) that Allah the Mighty and Majestic created the Garden of Eden with His Hand, wrote the Torah with His Hand, planted the Tuba tree with His Hand, and created Adam, who is the Human, with His two Hands.\n\nThus, He said to Iblis, in a manner of honoring Adam, peace be upon him: <<What prevented you from prostrating to that which I created with My two Hands?>>\n\n### [The Lowest Sphere and the Twelve Constellations]\n\nWhen Allah created the Lowest Sphere (الفلك الأدنى), which is the first one mentioned previously, He divided it into twelve sections, which He named. Allah the Exalted said: <<By the heaven containing the constellations (الْبُرُوجِ)>>. He made each section a constellation (برج). He made these sections revert to four in nature, then He repeated each of the four in three places within the sphere. He made these sections like stations (المنازل) and watering places (المناهل) where travelers alight and those journeying proceed during their travel, so that what Allah brings into existence within the cavity of this sphere—from the planets that traverse these constellations—may descend into these sections during the planets’ movement and journeying. This is so that Allah may bring into existence, upon their traversal and movement, whatever He wills to create of the natural and elemental world. He made them signs indicating the effect of the motion of the sphere of the constellations. Know this.\n\n### [The Four Natures and Elements]\n\nOne division of these four has the nature of Heat and Dryness. The second, Coldness and Dryness. The third, Heat and Moisture. The fourth, Coldness and Moisture. He made the fifth and ninth of these divisions like the first; the sixth and tenth like the second; the seventh and eleventh like the third; and the eighth and twelfth like the fourth—meaning in nature. Thus, the natural bodies, without dispute, and the elemental bodies, without dispute, are confined within these four: Heat, Coldness, Moisture, and Dryness. Although they are four primary sources (أمهات), Allah made two of them the origin for the existence of the other two. Dryness was acted upon by Heat, and Moisture by Coldness. Thus, Moisture and Dryness exist due to two causes, which are Heat and Coldness. For this reason, Allah mentioned in His saying: <<nor anything moist nor dry (رَطْبٍ ولا يَابِسٍ) except that it is in a clear register>>. This is because the effect (المسبب) necessitates the existence of the cause (السبب), or the passive necessitates the existence of the agent (الفاعل)—say it however you wish—but the existence of the cause does not necessitate the existence of the effect.\n\n### [The Atlas Sphere]\n\nWhen Allah created this First Sphere (الفلك الأول), it revolved in a cycle whose end is unknown except to Allah the Exalted, because there is no limited body above it for it to traverse. It is the first of the transparent bodies. If He had created something within its cavity, the motions would multiply and become distinct, but since He had not yet created anything within it, the motions would not be distinct and would not terminate for anyone within its cavity. Even if something were within it, the motions would still not be distinct because it is the Atlas Sphere (الفلك الأطلس), starless and uniform in its parts, so the measure of a single motion cannot be known or determined. If it had a part that differed from the rest of its parts, its motions would undoubtedly be counted by it. However, Allah knew its measure, its end, and its recurrence. From that motion, the Day came into existence, though there was neither night nor day in that Day. Then the motions of this sphere continued, and Allah created thirty-five angels, adding them to the sixteen angels we mentioned, making a total of fifty-one angels. Among these angels are Gabriel, Michael, Israfil, and Azrael. Then He created nine hundred and seventy-four angels and added them to the angels we mentioned, and He revealed to them and commanded them concerning what is executed through their hands in His creation. They said: <<And we do not descend except by the command of your Lord. To Him belongs what is before us and what is behind us and what is between that, and never was your Lord forgetful>>. And He said concerning them: <<They do not disobey Allah in what He commands them>>. These angels are the specific governors (الولاة). Allah also created angels who are the inhabitants of the heavens and the earth for His worship. There is no place in the heavens or the earth except that there is an angel in it. And the Real (الحق) continues to create angels from the breaths of the world as long as they are breathing.\n\n### [The Creation of the Abode of the World]\n\nWhen the motions of this First Sphere concluded, and its duration was fifty-four thousand years of those which you count, Allah created the Abode of the World (الدار الدنيا). He appointed for it a known term to which it will end, its form will cease, and it will be transformed from being an abode for us and accepting the specific form we witness today, until <<the earth will be replaced by another earth, and the heavens as well>>. When sixty-three thousand years of the duration of this sphere’s motion had passed of those which you count, Allah created the Hereafter (الدار الآخرة)—Paradise and the Fire—which Allah prepared for His blessed and wretched servants. Thus, there was a period of nine thousand years of those which you count between the creation of the world and the creation of the Hereafter. For this reason, it was named the Last (الآخرة) due to its creation being later than the creation of the world, and the world was named the First (الأولى) because it was created before it. Allah the Exalted said, addressing His Prophet, peace and blessings be upon him: <<And the Hereafter is better for you than the first [life]>>. He did not appoint a term for the Hereafter to which its subsistence (بقاؤها) would end; rather, it has perpetual subsistence.\n\n### [The Roof of Paradise is the Atlas Sphere]\n\nHe made the roof of Paradise this sphere, which is considered by them to be the Throne (العرش), whose motion is neither determined nor distinct. Its motion is perpetual and unending. There is no creation we have mentioned that was created except that the secondary intention (القصد الثاني) behind it was the existence of the Human, who is the Vicegerent (الخليفة) in the World. I said the secondary intention because the primary intention (القصد الأول) was the Gnosis of the Real (معرفة الحق) and His worship, for which the entire World was created. There is nothing except that <<it glorifies Him with praise>> (يُسَبِّحُ بِحَمْدِهِ). The meaning of the primary and secondary intention is the volitional attachment (التعلق الإرادي), not the origination of the Will, because the Will (الإرادة) is an ancient, eternal Attribute (صفة قديمة أزلية) of His Essence (ذاته), like all His other Attributes.\n\n### [The Motion of the Heavens and the Motion of the Earth]\n\nWhen Allah created these spheres and heavens, and <<inspired in each heaven its command>> (أَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا), and arranged in them their lights and lamps, and populated them with His angels, He moved them, and they moved, obedient to Allah, coming to Him in search of the perfection of servitude (العبودية) appropriate for them. This is because the Exalted called them and called the earth, saying: <<Then He said to it and to the earth, 'Come [into being], willingly or by compulsion.' They said, 'We have come willingly'>>. They are always coming, and they remain in motion, although the motion of the earth is hidden from us, and its motion is around the center because it is spherical. As for the heaven, it came willingly when Allah commanded it to come. As for the earth, it came willingly when it knew itself to be compelled and that it must be brought forth by His saying: <<or by compulsion>> (أَوْ كَرْهًا). Thus, it was the one intended by His saying <<or by compulsion>>, yet it came willingly by compulsion. <<And He completed them as seven heavens in two days and inspired in every heaven its command>>.\n\n### [The Creation of the Earth and the Determination of its Provisions]\n\nHe had already <<created the earth and determined therein its provisions>> (خَلَقَ الْأَرْضَ وَقَدَّرَ فِيهَا أَقْوَاتَهَا) for the sake of the generated things (المولدات), making it a treasury for their provisions. We have mentioned the arrangement of the World’s constitution in the book *Uqlat al-Mustawfiz* (The Snare of the Hurried Seeker). Part of the determination of its provisions was the existence of water, air, and fire, and what is contained therein of vapors, clouds, lightning, thunder, and celestial effects. <<That is the determination of the Exalted in Might, the All-Knowing>>. He created the Jinn (الجان) from fire, and the birds, land and sea animals, and insects from the putrefactions (عفونات) of the earth, so that the air might be purified for us from the vapors of putrefaction. If these vapors were to mix with the air in which Allah deposited the life and health of this Human and animal, they would be sick, ill, and diseased. So the Glorious purified the atmosphere for him, out of kindness, by creating these putrefying things, thereby reducing sicknesses and ailments.\n\n### [The Creation of the Human]\n\nWhen the dominion was established and prepared, none of these creatures knew what genus this Vicegerent (الخليفة) would be, for whose existence Allah had prepared this dominion. When the appointed time in His Knowledge arrived for the creation of this Vicegerent, after seventeen thousand years had passed from the age of the world and eight thousand years from the age of the Hereafter, which has no end in perpetuity, Allah commanded some of His angels to bring Him a handful from all species of the earth’s soil. They brought it to Him in a long story known to people. The Glorious took it and kneaded it with His two Hands, which is His saying: <<to that which I created with My two Hands>>. The Real (الحق) had deposited a trust for Adam with every angel we mentioned, and He said to them: <<Indeed, I am going to create a human being from clay (طِينٍ). These trusts in your hands are for him. So when I have created him, let each of you render to him what you have been entrusted with. Then, when I have proportioned him and breathed into him of My Spirit, then fall down to him in prostration>>. When the Real kneaded the clay of Adam with His two Hands until its odor changed—which is the altered clay (المسنون)—that aerial part of the constitution, He made his back a place for the wretched and the blessed among his progeny. He deposited in it what was in His two grasps, for He informed us that in the grasp of His Right Hand are the blessed, and in the grasp of the other Hand are the wretched—and both Hands of my Lord are blessed Right Hands. He said: \"These are for Paradise, and they will act with the deeds of the people of Paradise; and these are for the Fire, and they will act with the deeds of the people of the Fire.\" He deposited all of this in the clay of Adam, combining opposites within him by virtue of proximity. He constituted him upon the upright motion (الحركة المستقيمة), and this was in the dominion of Virgo (السنبلة). He made him possess six directions: the Above, which is toward his head; the Below, which opposes it, toward his feet; the Right, which is toward his stronger side; the Left, which opposes it, toward his weaker side; the Front, which is toward the face; and the Back, which opposes it, toward the nape. He formed him, proportioned him, and perfected him. Then He breathed into him of His Spirit, which is attributed to Him. Upon this breathing, through its permeation into his parts, the pillars of the humors (الأخلاط) came into existence: yellow bile, black bile, blood, and phlegm. Yellow bile resulted from the fiery element from which Allah created him, as mentioned in His saying: <<from clay like pottery>> (مِنْ صَلْصَالٍ كَالْفَخَّارِ). Black bile resulted from the earth, which is His saying: <<He created him from dust>> (خَلَقَهُ مِنْ تُرَابٍ). Blood resulted from the air, which is His saying: <<altered>> (مَسْنُونٍ). Phlegm resulted from the water with which the dust was kneaded, becoming clay. Then He brought into existence within him the attractive power (القوة الجاذبة), by which the animal draws nourishment; then the retentive power (القوة الماسكة), by which it holds what it consumes; then the digestive power (القوة الهاضمة), by which it digests the food; and then the expulsive power (القوة الدافعة), by which it expels waste from itself, such as sweat, vapor, wind, feces, and the like. As for the permeation of vapors and the distribution of blood in the veins from the liver, and what each part of the animal extracts, that is by the attractive power, not the expulsive power. The share of the expulsive power is only what we excrete as waste, as we said. Then He brought into existence within him the nutritive, growth, sensitive, imaginative, estimative, preservative, and recollective powers. All of this exists in the Human insofar as he is an animal, not only insofar as he is a Human. However, these four powers—imagination, estimation, preservation, and recollection—are stronger in the Human than in the animal. Then He distinguished Adam, who is the Human, with the formative, cogitative, and rational powers (القوة المصورة والمفكرة والعاقلة). Thus, he was distinguished from the animal. He made all these powers in this body instruments for the rational soul (النفس الناطقة) so that it might thereby attain all its sensible and intelligible benefits. Then He brought him forth as another creation, which is humanity (الإنسانية), making him perceptive through these powers: living, knowing, capable, willing, speaking, hearing, and seeing, according to a known limit customary in his acquisition. <<So blessed is Allah, the best of creators>>. Furthermore, the Glorious did not name Himself with any Name except that He granted the Human a share of being characterized by that Name, by which he manifests in the World according to what is appropriate for him. For this reason, some interpreted the Prophet’s saying, peace be upon him: \"Indeed, Allah created Adam upon His form,\" according to this meaning. He made him a Vicegerent (خليفة) for Him on His earth, since the earth belongs to the world of change and transformation, unlike the higher world. Thus, judgments occur among them according to the changes that occur in the earthly world, and thereby the ruling of all the Divine Names (الأسماء الإلهية) is manifested. That is why he was a Vicegerent on earth, not in heaven or Paradise. Then occurred what occurred concerning his knowledge of the Names, the prostration of the angels, and the refusal of Iblis, all of which will be mentioned in its proper place, God willing.\n\n### [The Types of Human Bodies]\n\nThis chapter is specifically dedicated to the beginning of Human Bodies (الجسوم الإنسانية), which are four types: the body of Adam, the body of Eve, the body of Jesus, and the bodies of the children of Adam. The origin of each of these four bodies differs from the origin of the others in terms of causality, despite their shared physical and spiritual form. We have presented this and drawn attention to it so that the weak-minded person does not imagine that Divine Power (القدرة الإلهية) or the Realities (الحقائق) only permit this human constitution to arise from a single cause that inherently produces this constitution. Allah refuted this misconception by manifesting this human constitution in Adam in a way that the body of Eve did not manifest, and He manifested the body of Eve in a way that the body of Adam’s offspring did not manifest, and He manifested the body of Adam’s offspring in a way that the body of Jesus, peace be upon him, did not manifest. Yet, the name ‘Human’ applies to every one of them by definition and reality. This is so that it may be known <<that Allah is All-Knowing of all things and that He is over all things Competent (قَدِيرٌ)>>. Furthermore, Allah has gathered these four types of creation in one verse of the Quran, in Surat al-Hujurat, where He said: <<O mankind, indeed We have created you>> (referring to Adam) <<from male>> (referring to Eve) <<and female>> (referring to Jesus) <<and made you peoples and tribes>> (referring to the children of Adam through marriage and procreation). This verse is one of the comprehensive words (جوامع الكلم) and decisive speech granted to Muhammad, peace and blessings be upon him.\n\n### [The Body of Adam and the Body of Eve]\n\nWhen the body of Adam appeared, as we mentioned, he did not possess the desire for sexual intercourse. Since the existence of procreation, propagation, and marriage in this abode was predetermined in the Knowledge of the Real (علم الحق) only for the continuation of the species, Eve was extracted from Adam’s rib, specifically the short one (القصيرة). She was thereby shortened from the degree of man, as Allah the Exalted said: <<But men have a degree over them>> (وَلِلرِّجَالِ عَلَيْهِنَّ دَرَجَةٌ), so she never attains their degree. She was created from the rib due to the curvature (الانحناء) in the ribs, so that she might incline with tenderness toward her child and her husband. The man’s tenderness toward the woman is his tenderness toward himself, because she is a part of him. The woman’s tenderness toward the man is due to her being created from the rib, and the rib contains curvature and inclination.\n\n### [The Love of Adam and the Love of Eve]\n\nAllah populated the place in Adam from which Eve emerged with desire for her, since no void remains in Existence (الوجود). When He populated it with air, Adam yearned for her, his yearning being for himself because she was a part of him. And she yearned for him because he was her homeland (موطنها) where she originated. Thus, Eve’s love is the love of the homeland, and Adam’s love is the love of his own self. For this reason, the man’s love for the woman is manifest, as she is his essence. The woman was given the power expressed as modesty (الحياء) in her love for the man, so she was strengthened in concealment, because the homeland does not unite with her in the same way Adam unites with her. He formed in that rib everything He had formed and created in Adam’s body. Thus, the formation of Adam’s body in its form was like the formation of the potter in what he creates from clay and firing, while the formation of Eve’s body was like the formation of the carpenter in what he carves into wood. When He carved her in the rib, established her form, perfected and proportioned her, He breathed into her of His Spirit, and she arose, living, speaking, and female, so that He might make her a place for cultivation and plowing for the existence of growth, which is procreation. So he found tranquility in her, and she found tranquility in him. She was clothing for him, and he was clothing for her. Allah the Exalted said: <<They are clothing for you and you are clothing for them>>. The desire permeated from him into all his parts, and he sought her.\n\n### [The Formation of the Third Body]\n\n<<And when he covered her>> (فَلَمَّا تَغَشَّاهَا) and cast the water into the womb, and that drop of water circulated with the menstrual blood (دم الحيض) that Allah decreed upon women, a third body was formed in that substance, different from the way the body of Adam and the body of Eve were formed. This is the third body. Allah took charge of its formation in the womb, state after state, transitioning from water to a sperm-drop (نطفة), to a clinging clot (علقة), to a lump of flesh (مضغة), to bone, then clothing the bone with flesh. When He completed its animal constitution, He brought it forth as another creation, breathing into it the human spirit. <<So blessed is Allah, the best of creators>>. Were it not for the length of the matter, we would explain its formation in the womb, state after state, and which angels are entrusted with creating the forms in the wombs until the time of emergence. However, the purpose was to inform that even though human bodies are one in definition, reality, and sensible and intelligible forms, the causes of their composition are diverse, lest it be imagined that this is due to the essence of the cause—exalted is Allah—but rather, it refers back to a chosen Agent (فاعل مختار) who does what He wills, how He wills, without restriction or limitation to one matter over another. <<There is no deity except Him, the Exalted in Might, the Wise (الْعَزِيزُ الْحَكِيمُ)>>.\n\n### [The Formation of the Body of Jesus]\n\nSince the naturalists (أهل الطبيعة) claimed that the woman’s water does not form anything and that the fetus in the womb is only from the man’s water, we made the formation of the body of Jesus (عيسى) another type of formation. Even though its administration in the womb was the administration of the bodies of the sons of Adam, it was either from the woman’s water when the Spirit appeared to her as <<a man in all respects>> (بَشَرًا سَوِيًّا), or it was through breathing without water. In any case, it is a fourth body, different in its origin from the other bodies of the species. For this reason, Allah the Exalted said: <<Indeed, the example of Jesus (عِيسَى)—meaning the description of the origin of Jesus—to Allah is like that of Adam (آدَمَ). He created him from dust>> (the pronoun refers back to Adam). The similarity lies in his creation without a father. That is, the description of his origin is the description of Adam’s origin, except that Adam was created from dust, <<then He said to him, 'Be,' and he was>>. Furthermore, it is said that Jesus did not remain in Mary’s womb for the customary duration of the sons of Adam, because his formation was hastened when Allah willed to make him a sign and thereby refute the naturalists, who judged nature based on what custom granted them, not based on what it necessitates of the secrets and wondrous formations Allah deposited within it. Indeed, some of the experts in this field treated nature fairly, saying: \"We only know of it what it specifically grants us, and there is in it what we do not know.\"\n\n### [The Human on Earth is the Counterpart of the Intellect in Heaven]\n\nWe have thus mentioned the beginning of Human Bodies, that they are four bodies of differing origins, as we established, and that the Human is the last of the generated things (المولدات). He is the counterpart of the First Intellect (العقل الأول), and the existence of the World is connected to him, because Existence (الوجود) is a circle. The beginning of the circle was the existence of the First Intellect, concerning which the tradition states: \"The first thing Allah created was the Intellect.\" Thus, it is the first of the genera, and creation ended with the human genus. The circle was completed, and the Human connected with the Intellect, just as the end of the circle connects with its beginning. Thus, it was a circle. Between the two ends of the circle is everything Allah created of the genera of the World, between the First Intellect, which is also the Pen (القلم), and the Human, who is the last existing thing. Since the lines extending from the point in the center of the circle to the circumference that resulted from it emerge equally to every part of the circumference, likewise, the relation of the Real (الحق) to all existing things is a single relation, and no change whatsoever occurs there. All things look toward Him and receive from Him what He bestows upon them, just as the parts of the circumference look toward the point. The Glorious established this Human Form with the upright motion, making it the form of the tent pole (العمد) for the dome of these heavens. He holds them from vanishing because of him. We therefore expressed him as the pole. When this form perishes, and no breathing person remains on the face of the earth, <<And the heaven will split apart, for on that Day it will be fragile>> (وَانْشَقَّتِ السَّمَاءُ فَهِيَ يَوْمَئِذٍ وَاهِيَةٌ), because the pole—the Human—has vanished. When the habitation transferred to the Hereafter with the transfer of the Human to it, and the world was ruined by his departure from it, we knew with certainty that the Human is the intended essence (العين المقصودة) of Allah in the World, that he is truly the Vicegerent (الخليفة), and that he is the locus of manifestation for the Divine Names (الأسماء الإلهية). He is the comprehensive synthesis of the realities of the entire World: angel, sphere, spirit, body, nature, mineral, plant, and animal, in addition to what he was specifically granted of the knowledge of the Divine Names, despite the smallness of his volume and mass. Allah only said: <<The creation of the heavens and earth is greater than the creation of mankind>> (خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ) because the Human is generated from the heaven and the earth, so they are like parents to him, and Allah elevated their status. <<But most of the people do not know>> (وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ). He did not mean in terms of mass, for that is known sensually.\n\n### [The Greatest Trial of the Human]\n\nHowever, Allah the Exalted tested him with a trial (ابتلاء) with which He tested none of His creation, either to make him blessed or wretched, according to how He guides him in its use. The trial with which He tested him was that He created within him a power called Cogitation (الفكر), and He made this power a servant to another power called the Intellect (العقل). He compelled the Intellect, despite its mastery over Cogitation, to take from it what it gives. He did not grant Cogitation a field of operation except in the imaginative power (القوة الخيالية). The Glorious made the imaginative power a comprehensive locus for what the sensitive power (القوة الحساسة) gives it. He also gave it a power called the formative power (المصورة). Nothing enters the imaginative power except what the senses or the formative power have given it, and the material of the formative power comes from the sensibles. Thus, it constructs forms whose essence does not exist, but all their parts exist sensually. This is because the Intellect was created simple (ساذجا), possessing nothing of theoretical knowledge. Cogitation was told: \"Distinguish between the truth and falsehood in this imaginative power.\" So it looks according to what occurs to it. It may fall into doubt, or it may arrive at a proof, without having knowledge of it, but in its presumption, it knows the forms of doubts from the proofs and has attained knowledge. It does not consider the deficiency of the materials upon which it relied in acquiring knowledge. The Intellect accepts this from it and judges by it, so its ignorance becomes greater than its knowledge by an incomparable degree. Then Allah charged this Intellect with His Gnosis (معرفته), so that it might return to Him concerning it, not to anything else. But the Intellect understood the opposite of what the Real intended by His saying: <<Do they not reflect? For a people who reflect...>> (أَوَلَمْ يَتَفَكَّرُوا لِقَوْمٍ يَتَفَكَّرُونَ). It relied upon Cogitation and made it an Imam (leader) to be followed, neglecting the Real’s intention behind reflection (التفكر), which was that He addressed it to reflect so that it might see that the path to its knowledge of Allah is only through Allah’s definition, whereby He unveils the matter to it as it truly is. Not every intellect understood this understanding, except for the intellects specifically chosen by Allah from among His Prophets and Saints (أوليائه). I wish I knew: was it by their cogitations that <<They said, 'Yes'>> (قَالُوا بَلَى) when He made them bear witness against themselves in the grasp of the progeny from Adam’s loins? No, by Allah! Rather, it was the care of His making them witness that when He took them from themselves, from their loins. When they returned to taking from their cogitative powers in the Gnosis of Allah, they never agreed upon a single judgment concerning the Gnosis of Allah. Every faction went to a different doctrine, and much talk arose concerning the most protected Divine Presence (الجناب الإلهي الأحمى), and they dared to the utmost degree against Allah. All of this stems from the trial we mentioned: His creation of Cogitation in the Human. The People of Allah (أهل الله) resorted to Him concerning the faith He charged them with regarding His Gnosis. They knew that what was intended from them was their return to Him in that and in every state. Among them is the one who said: \"Glory be to Him who made no path to His Gnosis (معرفة) except the inability to attain it.\" And among them is the one who said: \"The inability to grasp the grasp is itself a grasp.\" And the Prophet, peace be upon him, said: \"I cannot enumerate Your praise.\"\n\nAnd Allah the Exalted said: <<while they encompass Him not in knowledge>> (وَلَا يُحِيطُونَ بِهِ عِلْمًا). So they returned to Allah for Gnosis of Him and left Cogitation in its proper level (مرتبته), giving it its due right, without transferring it to what it ought not to cogitate upon. Indeed, there is a prohibition against cogitating upon the Essence (الذات) of Allah.\n\nAnd Allah says: <<And Allah warns you of Himself>> (وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ). So Allah bestowed upon them the Gnosis of Him that He bestowed, and He made them witness His creations and manifestations (مظاهره) that He made them witness. Thus, they knew that what is rationally impossible through the path of Cogitation is not impossible in relation to the Divine Attribute. We shall mention a portion of this in the chapter on the earth created from the remainder of Adam’s clay and other matters. What the rational person should hold as his inner conviction is to know <<Indeed, Allah is over all things Competent (قَدِيرٌ)>>—whether possible or impossible. Not every impossibility is beyond His effective power (نافذ الاقتدار) and vast bestowal. His creation is not a repetition, but rather similitudes that arise in a substance He brought into existence and willed its subsistence (بقاه). Had He willed, He would have annihilated it with the breaths. <<There is no deity except Him, the Exalted in Might, the Wise>>.",
    "ur": "(ساتواں باب) انسانی اجسام کی ابتدا کی معرفت میں\n\nاور یہ عالم کبیر کی آخری موجود جنس اور مولدات (پیدا شدہ اشیاء) کی آخری صنف ہے۔\n\n> انسان کے باطن کی حقیقت نے جنم لیا، ایک قوی بادشاہ جو ظاہر میں صاحبِ سلطنت ہے۔\n>\n> پھر اس کی ذات آدم کے عرش پر مستوی ہوئی، جیسے عرش کا (الرحمن) پر استواء (استواء) ہے۔\n>\n> پس اس کے جسم کی حقیقت اس کی عینیت میں ظاہر ہوئی، اور اسی کے ساتھ وجود (الوجود) ثانی کی بادشاہت اختتام پذیر ہوئی۔\n>\n> اور اس کے لفظ کی معرفتیں اس کے علم میں ظاہر ہوئیں، نیک لوگوں کے نزدیک بھی اور بغض رکھنے والوں کے نزدیک بھی۔\n>\n> پس ان کے خواب اس کے علوم کے سامنے چھوٹے پڑ گئے، اور ملعون شیطان نے تکبر کیا۔\n>\n> وہ سب اللہ کی بادشاہت میں اس کے قرب کے ساتھ لوٹے، سوائے چھوٹے شیطان کے جو خسارے کے ساتھ لوٹا۔\n\n### (عالم طبیعی کی عمر)\n\nجان لو، اللہ تمہاری مدد کرے، کہ جب زمان (الزمان) سے مقید اور مکان (المکان) سے محدود عالم طبیعی کی عمر کے اکہتر ہزار سال گزر گئے، جو دنیا میں معروف سالوں کے مطابق ہیں۔ اور یہ مدت اس نام کے علاوہ دیگر ایام کے گیارہ دن ہیں، اور ذی المعارج کے دنوں میں سے ایک دن اور پانچواں دن ہے۔ اور ان دنوں میں تفاضل (فرق) واقع ہوتا ہے۔ اللہ تعالیٰ نے فرمایا: **فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ** (ایک دن میں جس کی مقدار پچاس ہزار سال ہے)۔ اور فرمایا: **وَإِنَّ يَوْمًا عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ** (اور بے شک تمہارے رب کے نزدیک ایک دن تمہارے شمار کے مطابق ہزار سال جیسا ہے)۔ پس سب سے چھوٹے دن وہ ہیں جنہیں ہم فلک محیط کی حرکت سے شمار کرتے ہیں، جس کے دن میں رات اور دن ظاہر ہوتے ہیں۔ پس عربوں کے نزدیک سب سے چھوٹا دن یہی ہے، جو سب سے بڑے فلک کے لیے ہے، اور یہ اس کے اندر موجود افلاک پر اس کے حکم کی وجہ سے ہے، کیونکہ اس سے نیچے کی حرکت رات اور دن میں اس کے لیے ایک جبری حرکت (قسرية) تھی، جس کے ذریعے اس نے ان تمام افلاک کو مغلوب کیا جنہیں وہ گھیرے ہوئے ہے۔\n\n### (افلاک کی طبیعی اور جبری حرکت)\n\nاور ہر فلک کے لیے جبری حرکت (الحركة القسرية) کے ساتھ ایک طبیعی حرکت (الحركة الطبيعية) بھی ہوتی ہے۔ پس اس سے نیچے کا ہر فلک ایک ہی وقت میں دو حرکتیں رکھتا ہے: ایک طبیعی حرکت اور ایک جبری حرکت۔ اور ہر فلک میں ہر طبیعی حرکت کے لیے ایک مخصوص دن ہوتا ہے، جس کی مقدار فلک محیط سے پیدا ہونے والے دنوں کے ذریعے شمار کی جاتی ہے، جنہیں اللہ کے قول **مِمَّا تَعُدُّونَ** (جو تم شمار کرتے ہو) سے تعبیر کیا گیا ہے۔ اور یہ سب فلک محیط میں اپنا چکر پورا کرتے ہیں۔ پس جب بھی وہ اسے مکمل طور پر کاٹتا ہے، تو وہ اس کا ایک دن ہوتا ہے اور دور مکمل ہو جاتا ہے۔ ان میں سب سے چھوٹا دن وہ ہے جو تمہارے شمار کے مطابق اٹھائیس دن کا ہے، اور یہ فلک محیط میں قمر (چاند) کی حرکت کے قطع کرنے کی مقدار ہے۔ اور اللہ نے ان سات ستاروں کو آسمانوں میں نصب کیا تاکہ آنکھ فلک محیط میں ان کے فلک کے قطع کو دیکھ سکے، تاکہ ہم سالوں اور حساب کی تعداد جان سکیں۔ اللہ تعالیٰ نے فرمایا: **وَقَدَّرَهُ مَنَازِلَ لِتَعْلَمُوا عَدَدَ السِّنِينَ وَالْحِسَابَ وَكُلَّ شَيْءٍ فَصَّلْنَاهُ تَفْصِيلًا ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ** (اور اس کے لیے منزلیں مقرر کیں تاکہ تم سالوں کی گنتی اور حساب جان سکو۔ اور ہم نے ہر چیز کو تفصیل سے بیان کر دیا ہے۔ یہ غالب، جاننے والے (العزیز العلیم) کا اندازہ ہے)۔ پس ان میں سے ہر ستارے کا ایک مقررہ دن ہے، جو اپنی طبیعی حرکت کی تیزی یا اپنے افلاک کے چھوٹے یا بڑے ہونے کے مطابق ایک دوسرے پر فضیلت رکھتے ہیں۔\n\n### (قلم اور لوح کا خلق)\n\nپس جان لو کہ اللہ تعالیٰ نے جب قلم اور لوح کو پیدا کیا اور ان کا نام عقل (العقل) اور روح (الروح) رکھا، اور روح (الروح) کو دو صفات عطا کیں: ایک علمی صفت اور ایک عملی صفت۔ اور عقل (العقل) کو اس کے لیے معلم اور فائدہ پہنچانے والا بنایا، ایسا فائدہ جو مشاہدہ (مشاہدۃ) اور حالیہ ہوتا ہے، جیسا کہ تم چھری کی صورت سے کاٹنے کا فائدہ حاصل کرتے ہو، بغیر اس کے کہ وہ اس بارے میں کوئی بات کرے۔ اور اللہ تعالیٰ نے مذکورہ روح (الروح) سے نیچے ایک جوہر پیدا کیا، جسے اس نے ہباء (الهباء) کا نام دیا۔ اور یہ نام ہم نے علی بن ابی طالب رضی اللہ عنہ کے کلام سے لیا ہے۔\n\n### (ہباء کا خلق)\n\nاور جہاں تک ہباء (الهباء) کا تعلق ہے، تو وہ عربی زبان میں مذکور ہے۔ اللہ تعالیٰ نے فرمایا: **فَكَانَتْ هَبَاءً مُنْبَثًّا** (پس وہ بکھری ہوئی دھول ہو جائے گی)۔ اسی طرح جب علی بن ابی طالب نے اس جوہر کو دیکھا، یعنی یہ جوہر تمام طبیعی صورتوں میں بکھرا ہوا ہے، اور کوئی صورت اس سے خالی نہیں ہے، کیونکہ اس جوہر کے بغیر کوئی صورت نہیں بن سکتی، تو انہوں نے اسے ہباء (الهباء) کا نام دیا۔ اور یہ ہر صورت کے ساتھ اپنی حقیقت کے ساتھ موجود ہے، نہ تقسیم ہوتا ہے، نہ ٹکڑے ہوتا ہے، اور نہ ہی نقص سے متصف ہوتا ہے، بلکہ یہ اس سفیدی کی طرح ہے جو ہر سفید چیز میں اپنی ذات اور حقیقت کے ساتھ موجود ہوتی ہے۔ اور یہ نہیں کہا جاتا کہ سفیدی میں سے اتنی مقدار کم ہو گئی جو اس سفید چیز میں حاصل ہوئی ہے۔ پس یہ اس جوہر کی حالت کی مثال ہے۔\n\n### (روح اور ہباء کے درمیان چار مراتب)\n\nاور اللہ سبحانہ و تعالیٰ نے دو صفات سے متصف اس روح (الروح) اور ہباء (الهباء) کے درمیان چار مراتب (درجے) مقرر کیے، اور ہر مرتبے کو چار فرشتوں کے لیے منزل بنایا۔ اور ان فرشتوں کو ان تمام چیزوں پر والی (گورنر) بنایا جو اللہ نے ان سے نیچے عالم میں پیدا کیں، علیین (بلند ترین مقام) سے لے کر اسفل سافلین (سب سے نچلے مقام) تک۔ اور ان فرشتوں میں سے ہر ایک کو اس علم سے نوازا جسے وہ عالم میں نافذ کرنا چاہتا ہے۔ پس سب سے پہلی چیز جو اللہ نے اعیان (موجودات) میں پیدا کی، جس سے ان فرشتوں کا علم اور تدبیر متعلق ہے، وہ جسم کلی (الْجِسْمُ الْكُلِّي) ہے۔ اور اس جسم میں سب سے پہلی شکل جو کھولی گئی، وہ کروی (گول) شکل تھی، کیونکہ وہ اشکال میں سب سے افضل تھی۔ پھر اللہ سبحانہ و تعالیٰ نے ایجاد اور خلق کے ذریعے صنعت کی تکمیل تک نزول فرمایا۔ اور اللہ نے اپنی تمام مخلوقات کو ان فرشتوں کی بادشاہت (مملکت) بنا دیا، اور انہیں دنیا اور آخرت میں ان کے معاملات کا والی بنا دیا۔ اور انہیں اس چیز کی مخالفت سے محفوظ رکھا جس کا انہیں حکم دیا گیا تھا۔ پس اللہ سبحانہ و تعالیٰ نے ہمیں خبر دی کہ وہ **لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ** (اللہ کی نافرمانی نہیں کرتے جس کا وہ انہیں حکم دیتا ہے، اور وہی کرتے ہیں جس کا انہیں حکم دیا جاتا ہے)۔\n\n### (مولدات کا خلق)\n\nاور جب مولدات (پیدا شدہ اشیاء) کا خلق، یعنی جمادات (بے جان)، نباتات (پودے) اور حیوانات (جانور)، دنیا کے ان سالوں کے مطابق جو ہم شمار کرتے ہیں، اکہتر ہزار سال کے اختتام پر مکمل ہوا، اور عالم کو حکیمانہ ترتیب دی گئی، تو اللہ سبحانہ و تعالیٰ نے اپنی مخلوقات میں سے کسی بھی چیز کو، پہلے موجود سے لے کر آخری مولود تک، جو اس کے سامنے ہے، دو ہاتھوں سے جمع نہیں کیا، سوائے انسان کے، جو کہ یہ بدنی خاکی نشأة (پیدائش) ہے۔ بلکہ اس کے علاوہ ہر چیز کو یا تو امر الٰہی سے پیدا کیا، یا ایک ہاتھ سے۔ اللہ تعالیٰ نے فرمایا: **إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ** (بے شک ہمارا قول کسی چیز کے لیے جب ہم اس کا ارادہ کرتے ہیں تو یہی ہے کہ ہم اسے کہیں: ہو جا، تو وہ ہو جاتی ہے)۔ پس یہ امر الٰہی سے ہے۔ اور حدیث میں آیا ہے کہ اللہ عزوجل نے جنت عدن کو اپنے ہاتھ سے پیدا کیا، اور تورات کو اپنے ہاتھ سے لکھا، اور شجرہ طوبیٰ کو اپنے ہاتھ سے لگایا، اور آدم کو، جو کہ انسان ہے، اپنے دونوں ہاتھوں سے پیدا کیا۔\n\nپس اللہ تعالیٰ نے ابلیس سے آدم علیہ السلام کی تعظیم کے طور پر فرمایا: **مَا مَنَعَكَ أَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ** (تجھے کس چیز نے روکا کہ تو اسے سجدہ کرے جسے میں نے اپنے دونوں ہاتھوں سے پیدا کیا)۔\n\n### (سب سے نچلا فلک اور بارہ برج)\n\nاور جب اللہ نے سب سے نچلا فلک (جو ابھی مذکور ہوا) پیدا کیا، تو اسے بارہ حصوں میں تقسیم کیا، جنہیں اس نے برج (البروج) کا نام دیا۔ اللہ تعالیٰ نے فرمایا: **وَالسَّمَاءِ ذَاتِ الْبُرُوجِ** (قسم ہے برجوں والے آسمان کی)۔ پس اس نے ہر حصے کو ایک برج بنایا، اور ان حصوں کو طبیعت (الطبیعۃ) میں چار کی طرف لوٹایا۔ پھر ان چاروں میں سے ہر ایک کو اس کے تین مقامات پر دہرایا۔ اور ان حصوں کو ایسی منزلوں اور پڑاؤں کی طرح بنایا جہاں مسافر اترتے ہیں اور چلنے والے اپنے سفر کے دوران چلتے ہیں۔ تاکہ جب ستارے ان میں چلیں اور سیاحت کریں تو ان حصوں میں وہ چیزیں نازل ہوں جو اللہ اس فلک کے اندر پیدا کرتا ہے، جو ان برجوں میں اپنی سیر سے قطع کرتے ہیں، تاکہ ان کے قطع اور سیر کے وقت اللہ عالم طبیعی اور عنصری میں جو کچھ پیدا کرنا چاہے، وہ پیدا کرے۔ اور انہیں برجوں کے فلک کی حرکت کے اثر پر علامات بنایا۔ پس جان لو۔\n\n### (چار طبائع اور عناصر)\n\nپس ان چار میں سے ایک حصے کی طبیعت (الطبیعۃ) حرارت (گرمی) اور یبوست (خشکی) ہے، اور دوسرے کی برودت (سردی) اور یبوست (خشکی)، اور تیسرے کی حرارت (گرمی) اور رطوبت (نمی)، اور چوتھے کی برودت (سردی) اور رطوبت (نمی) ہے۔ اور اس نے پانچویں اور نویں حصے کو پہلے کی طرح بنایا، اور چھٹے اور دسویں کو دوسرے کی طرح، اور ساتویں اور گیارہویں کو تیسرے کی طرح، اور آٹھویں اور بارہویں کو چوتھے کی طرح بنایا، یعنی طبیعت میں۔ پس اس نے طبیعی اجسام کو بلا اختلاف اور عنصری اجسام کو بلا اختلاف ان چار میں محدود کر دیا، جو کہ حرارت، برودت، رطوبت اور یبوست ہیں۔ اور ان کے چار امہات (بنیادی اصول) ہونے کے باوجود، اللہ نے ان میں سے دو کو باقی دو کے وجود میں اصل بنایا۔ پس یبوست (خشکی) حرارت (گرمی) سے متاثر ہوئی، اور رطوبت (نمی) برودت (سردی) سے۔ پس رطوبت اور یبوست دو اسباب سے موجود ہیں، جو کہ حرارت اور برودت ہیں۔ اسی لیے اللہ نے اپنے قول میں ذکر فرمایا: **وَلَا رَطْبٍ وَلَا يَابِسٍ إِلَّا فِي كِتَابٍ مُبِينٍ** (اور نہ کوئی تر چیز ہے اور نہ کوئی خشک، مگر یہ کہ وہ کھلی کتاب میں ہے)۔ کیونکہ مسبب (نتیجہ) کے لیے لازم ہے کہ وہ سبب کے وجود سے ہو، یا منفعل (متاثر) کے لیے لازم ہے کہ فاعل (اثر کرنے والا) کا وجود ہو، تم جیسے چاہو کہو۔ لیکن سبب کے وجود سے مسبب کا وجود لازم نہیں آتا۔\n\n### (فلک اطلس)\n\nاور جب اللہ نے یہ پہلا فلک پیدا کیا، تو وہ ایک ایسا دور گھوما جس کا اختتام اللہ تعالیٰ کے سوا کسی کو معلوم نہیں، کیونکہ اس کے اوپر اجرام (اجسام) میں سے کوئی محدود چیز نہیں ہے جسے وہ قطع کرے۔ کیونکہ یہ پہلا شفاف جرم ہے۔ پس حرکتیں متعدد اور ممتاز ہو جاتی ہیں۔ اور چونکہ اللہ نے اس کے اندر کوئی چیز پیدا نہیں کی تھی، اس لیے حرکتیں ممتاز ہوتیں اور اس کے اندر موجود شخص کے نزدیک ختم ہوتیں۔ اور اگر اس میں کوئی چیز ہوتی بھی تو بھی وہ ممتاز نہ ہوتیں، کیونکہ یہ اطلس (خالی) ہے، اس میں کوئی ستارہ نہیں ہے، اس کے اجزاء ایک جیسے ہیں۔ پس اس کی ایک حرکت کی مقدار معلوم نہیں ہو سکتی اور نہ ہی وہ متعین ہو سکتی ہے۔ اگر اس میں کوئی ایسا جز ہوتا جو اس کے باقی اجزاء سے مختلف ہوتا، تو بلاشبہ اس سے اس کی حرکتیں شمار کی جاتیں۔ لیکن اللہ اس کی مقدار، اس کے اختتام اور اس کے تکرار کو جانتا ہے۔ پس اس حرکت سے دن پیدا ہوا، اور اس دن میں نہ رات تھی اور نہ دن۔ پھر اس فلک کی حرکتیں جاری رہیں، تو اللہ نے پینتیس فرشتے پیدا کیے، جنہیں اس نے ہمارے ذکر کردہ سولہ فرشتوں کے ساتھ شامل کیا، پس وہ سب اکاون (51) فرشتے ہو گئے۔ ان فرشتوں میں جبرائیل، میکائیل، اسرافیل اور عزرائیل شامل ہیں۔ پھر اس نے نو سو چوہتر (974) فرشتے پیدا کیے اور انہیں مذکورہ فرشتوں کے ساتھ شامل کیا، اور ان کی طرف وحی کی اور انہیں ان کاموں کا حکم دیا جو ان کے ہاتھوں سے اس کی مخلوق میں جاری ہوتے ہیں۔ پس انہوں نے کہا: **وَمَا نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ لَهُ مَا بَيْنَ أَيْدِينَا وَمَا خَلْفَنَا وَمَا بَيْنَ ذَلِكَ وَمَا كَانَ رَبُّكَ نَسِيًّا** (اور ہم نہیں اترتے مگر آپ کے رب کے حکم سے۔ اسی کا ہے جو ہمارے آگے ہے اور جو ہمارے پیچھے ہے اور جو اس کے درمیان ہے، اور آپ کا رب بھولنے والا نہیں ہے)۔ اور ان کے بارے میں فرمایا: **لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ** (وہ اللہ کی نافرمانی نہیں کرتے جس کا وہ انہیں حکم دیتا ہے)۔ پس یہ فرشتے خاص طور پر والی (گورنر) ہیں۔ اور اللہ نے ایسے فرشتے بھی پیدا کیے جو آسمانوں اور زمین کے آباد کرنے والے ہیں، اس کی عبادت کے لیے۔ پس آسمان اور زمین میں کوئی جگہ نہیں مگر وہاں ایک فرشتہ ہے، اور جب تک عالم کے لوگ سانس لیتے رہیں گے، ذات حق (الحق) ان کے سانسوں سے فرشتے پیدا کرتا رہے گا۔\n\n### (دار دنیا کا خلق)\n\nاور جب اس پہلے فلک کی حرکتیں ختم ہوئیں، اور اس کی مدت تمہارے شمار کے مطابق چون ہزار (54,000) سال تھی، تو اللہ نے دار دنیا (دنیا کا گھر) کو پیدا کیا، اور اس کے لیے ایک معلوم مدت مقرر کی جس پر وہ ختم ہو جائے گی، اور اس کی صورت ختم ہو جائے گی اور وہ ہمارے لیے گھر ہونے کی حالت سے بدل جائے گی، اور ایک مخصوص صورت کو قبول کرنے سے، جسے ہم آج دیکھتے ہیں، یہاں تک کہ **الْأَرْضُ غَيْرُ الْأَرْضِ وَالسَّمَاوَاتُ** (زمین دوسری زمین سے اور آسمان بدل دیے جائیں گے)۔ اور جب اس فلک کی حرکت کی مدت کے تمہارے شمار کے مطابق تریسٹھ ہزار (63,000) سال گزر گئے، تو اللہ نے دار آخرت (آخرت کا گھر)، جنت اور دوزخ کو پیدا کیا، جنہیں اللہ نے اپنے نیک بخت اور بد بخت بندوں کے لیے تیار کیا ہے۔ پس دنیا کے خلق اور آخرت کے خلق کے درمیان تمہارے شمار کے مطابق نو ہزار (9,000) سال کا فرق تھا۔ اسی لیے اسے آخرت (الآخرۃ) کہا گیا، کیونکہ اس کا خلق دنیا کے خلق کے بعد ہوا، اور دنیا کو اولیٰ (پہلی) کہا گیا کیونکہ وہ اس سے پہلے پیدا کی گئی۔ اللہ تعالیٰ نے فرمایا: **وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَى** (اور بے شک آخرت آپ کے لیے دنیا سے بہتر ہے)۔ یہ خطاب نبی صلی اللہ علیہ وسلم سے ہے۔ اور اللہ نے آخرت کے لیے کوئی مدت مقرر نہیں کی جس پر اس کا بقا (البقاء) ختم ہو، پس اس کے لیے دائمی بقا ہے۔\n\n### (جنت کی چھت فلک اطلس ہے)\n\nاور اس نے جنت کی چھت اسی فلک کو بنایا، اور یہ ان کے نزدیک عرش (العرش) ہے، جس کی حرکت متعین نہیں ہوتی اور نہ ہی ممتاز ہوتی ہے۔ پس اس کی حرکت دائمی ہے جو کبھی ختم نہیں ہوتی۔ اور ہم نے جس مخلوق کا بھی ذکر کیا، اس کے خلق کا دوسرا مقصد (القصد الثاني) انسان کا وجود تھا، جو عالم میں خلیفہ ہے۔ میں نے اسے دوسرا مقصد اس لیے کہا کہ پہلا مقصد (القصد الأول) ذات حق (الحق) کی معرفت (المعرفۃ) اور اس کی عبادت تھی، جس کے لیے تمام عالم کو پیدا کیا گیا۔ پس کوئی چیز نہیں مگر وہ **يُسَبِّحُ بِحَمْدِهِ** (اس کی حمد کے ساتھ تسبیح کرتی ہے)۔ اور پہلے اور دوسرے مقصد کا مطلب ارادی تعلق ہے، نہ کہ ارادے کا حادث ہونا، کیونکہ اللہ کے لیے ارادہ ایک قدیم، ازلی صفت ہے، جس سے اس کی ذات اپنی دیگر صفات کی طرح متصف ہے۔\n\n### (آسمانوں کی حرکت اور زمین کی حرکت)\n\nاور جب اللہ نے ان افلاک اور آسمانوں کو پیدا کیا اور **وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا** (اور ہر آسمان میں اس کا حکم بھیجا)، اور ان میں ان کے نور اور چراغوں کو ترتیب دیا، اور انہیں اپنے فرشتوں سے آباد کیا، اور اللہ نے انہیں حرکت دی، تو وہ اللہ کی اطاعت کرتے ہوئے حرکت میں آئے، اور اس کی طرف آئے، اس بندگی میں کمال کی تلاش میں جو ان کے لائق ہے۔ کیونکہ اللہ تعالیٰ نے انہیں اور زمین کو بلایا، پس **فَقَالَ لَهَا وَلِلْأَرْضِ ائْتِيَا طَوْعًا أَوْ كَرْهًا** (پس اس نے آسمان اور زمین سے کہا: خوشی سے آؤ یا ناخوشی سے)، ایک مقررہ حکم کے لیے۔ **قَالَتَا أَتَيْنَا طَائِعِينَ** (انہوں نے کہا: ہم خوشی سے حاضر ہیں)۔ پس وہ ہمیشہ آنے والے ہیں، اور ہمیشہ متحرک رہیں گے۔ البتہ زمین کی حرکت ہمارے نزدیک پوشیدہ ہے، اور اس کی حرکت مرکز کے گرد ہے کیونکہ وہ کروی ہے۔ جہاں تک آسمان کا تعلق ہے، تو وہ اللہ کے حکم پر خوشی سے حاضر ہوا، اور جہاں تک زمین کا تعلق ہے، تو وہ خوشی سے حاضر ہوئی جب اس نے خود کو مغلوب جانا اور یہ کہ اسے ضرور لایا جائے گا، اس کے قول **أَوْ كَرْهًا** (یا ناخوشی سے) کے ذریعے، پس وہ اس قول **أَوْ كَرْهًا** سے مراد تھی۔ پس وہ ناخوشی سے خوشی کے ساتھ حاضر ہوئی۔ **فَقَضَاهُنَّ سَبْعَ سَمَاوَاتٍ فِي يَوْمَيْنِ وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا** (پس اس نے انہیں دو دن میں سات آسمان بنا دیا، اور ہر آسمان میں اس کا حکم بھیجا)۔\n\n### (زمین کا خلق اور اس کی غذاؤں کا اندازہ)\n\nاور اس نے مولدات (پیدا شدہ اشیاء) کی خاطر **خَلَقَ الْأَرْضَ وَقَدَّرَ فِيهَا أَقْوَاتَهَا** (زمین کو پیدا کیا اور اس میں اس کی غذائیں مقرر کیں)، پس اسے ان کی غذاؤں کا خزانہ بنایا۔ اور ہم نے کتاب *عقلۃ المستوفز* میں عالم کی نشأة کی ترتیب کا ذکر کیا ہے۔ اور اس کی غذاؤں کے اندازے میں پانی، ہوا، آگ کا وجود شامل تھا، اور اس میں موجود بخارات، بادل، بجلی، گرج اور علوی آثار شامل تھے۔ **ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ** (یہ غالب، جاننے والے کا اندازہ ہے)۔ اور اس نے جنات کو آگ سے پیدا کیا، اور پرندوں، خشکی اور سمندر کے جانوروں اور حشرات کو زمین کی سڑاند (عفونات) سے پیدا کیا، تاکہ ہوا ہمارے لیے سڑاند کے بخارات سے پاک ہو جائے، جو اگر اس ہوا میں شامل ہو جاتے جس میں اللہ نے اس انسان اور حیوان کی زندگی اور عافیت رکھی ہے، تو وہ بیمار، مریض اور علیل ہو جاتا۔ پس اللہ سبحانہ و تعالیٰ نے ان سڑاند والی چیزوں کی تخلیق کے ذریعے اپنے لطف سے ماحول کو اس کے لیے صاف کر دیا۔ پس بیماریاں اور علتیں کم ہو گئیں۔\n\n### (انسان کا خلق)\n\nاور جب بادشاہت مستحکم ہو گئی اور تیار ہو گئی، اور ان تمام مخلوقات میں سے کسی کو معلوم نہ تھا کہ یہ خلیفہ کس جنس سے ہو گا جس کے وجود کے لیے اللہ نے یہ بادشاہت تیار کی ہے۔ پس جب اس خلیفہ کو پیدا کرنے کا وقت آیا، جو اس کے علم میں مقرر تھا، دنیا کی عمر کے سترہ ہزار سال گزرنے کے بعد، اور آخرت کی عمر کے، جس کا بقا (البقاء) میں کوئی اختتام نہیں، آٹھ ہزار سال گزرنے کے بعد، تو اللہ نے اپنے بعض فرشتوں کو حکم دیا کہ وہ زمین کی ہر جنس کی مٹی کی ایک مٹھی لے آئیں۔ پس وہ ایک طویل خبر کے مطابق، جو لوگوں میں معلوم ہے، اسے لے آئے۔ پس اللہ سبحانہ و تعالیٰ نے اسے لیا اور اپنے دونوں ہاتھوں سے گوندھا۔ یہی اس کا قول ہے: **لِمَا خَلَقْتُ بِيَدَيَّ** (جسے میں نے اپنے دونوں ہاتھوں سے پیدا کیا)۔ اور ذات حق (الحق) نے ان فرشتوں میں سے ہر ایک کے پاس، جن کا ہم نے ذکر کیا، آدم کی ایک امانت رکھی تھی، اور ان سے فرمایا: **إِنِّي خَالِقٌ بَشَرًا مِنْ طِينٍ** (بے شک میں مٹی سے ایک بشر پیدا کرنے والا ہوں)۔ اور یہ امانتیں جو تمہارے پاس ہیں، اس کے لیے ہیں۔ پس جب میں اسے پیدا کر لوں، تو تم میں سے ہر ایک اپنی امانت اسے ادا کر دے جو میں نے تمہیں سونپی ہے۔ پھر فرمایا: **فَإِذَا سَوَّيْتُهُ وَنَفَخْتُ فِيهِ مِنْ رُوحِي فَقَعُوا لَهُ سَاجِدِينَ** (پس جب میں اسے درست کر لوں اور اس میں اپنی روح پھونک دوں، تو تم اس کے لیے سجدے میں گر جانا)۔\n\nپس جب ذات حق (الحق) تعالیٰ نے اپنے دونوں ہاتھوں سے آدم کی مٹی کو گوندھا یہاں تک کہ اس کی بو بدل گئی، جو کہ مسنون (بدلی ہوئی) ہے، اور یہ نشأة (پیدائش) میں موجود ہوائی جز ہے، تو اس نے اس کی پشت کو اس کی ذریت میں سے بد بختوں اور نیک بختوں کا ٹھکانہ بنایا۔ پس اس میں وہ سب کچھ ودیعت کر دیا جو اس کی دونوں مٹھیوں میں تھا۔ کیونکہ اس نے ہمیں خبر دی کہ اس کے دائیں ہاتھ کی مٹھی میں نیک بخت ہیں، اور دوسرے ہاتھ کی مٹھی میں بد بخت ہیں۔ اور میرے رب کے دونوں ہاتھ مبارک دائیں ہیں۔ اور فرمایا: یہ جنت کے لیے ہیں اور جنت والوں کے عمل کریں گے، اور یہ دوزخ کے لیے ہیں اور دوزخ والوں کے عمل کریں گے۔ اور اس نے سب کو آدم کی مٹی میں ودیعت کر دیا، اور اس میں اضداد (متضاد چیزوں) کو مجاورت (پڑوس) کے حکم سے جمع کیا، اور اسے حرکت مستقیمہ (سیدھی حرکت) پر پیدا کیا، اور یہ سنبلہ (Virgo) کی حکومت میں تھا۔ اور اسے چھ جہتوں والا بنایا: اوپر، جو اس کے سر کی طرف ہے، اور نیچے، جو اس کے پاؤں کی طرف ہے، اور دائیں، جو اس کے مضبوط پہلو کی طرف ہے، اور بائیں، جو اس کے کمزور پہلو کی طرف ہے، اور سامنے، جو چہرے کی طرف ہے، اور اس کے مقابل پیچھے، جو گدی کی طرف ہے۔ اور اس نے اسے صورت دی، اسے معتدل کیا اور اسے درست کیا۔ پھر اس میں اپنی روح (الروح) پھونکی جو اس کی طرف منسوب ہے۔ پس اس پھونکنے سے، جو اس کے اجزاء میں سرایت کر گئی، اخلاط (مزاجوں) کے ارکان پیدا ہوئے، جو کہ صفراء (زرد رطوبت)، سوداء (سیاہ رطوبت)، خون اور بلغم ہیں۔ پس صفراء (زرد رطوبت) ناری رکن سے تھی، جسے اللہ نے اس سے پیدا کیا، جیسا کہ اس کے قول **مِنْ صَلْصَالٍ كَالْفَخَّارِ** (کھنکھناتی مٹی سے، جیسے ٹھیکری) میں ہے۔ اور سوداء (سیاہ رطوبت) مٹی سے تھی، جو اس کا قول ہے: **خَلَقَهُ مِنْ تُرَابٍ** (اسے مٹی سے پیدا کیا)۔ اور خون ہوا سے تھا، جو اس کا قول ہے: **مَسْنُونٍ** (بدلی ہوئی)۔ اور بلغم اس پانی سے تھا جس سے مٹی کو گوندھا گیا تھا، پس وہ کیچڑ بن گئی۔\n\nپھر اس نے اس میں قوت جاذبہ (کھینچنے والی قوت) پیدا کی، جس سے حیوان غذائیں کھینچتا ہے۔ پھر قوت ماسکہ (روکنے والی قوت)، جس سے حیوان اس غذا کو روکتا ہے جسے وہ کھاتا ہے۔ پھر قوت ہاضمہ (ہضم کرنے والی قوت)، جس سے وہ غذا کو ہضم کرتا ہے۔ پھر قوت دافعہ (دفع کرنے والی قوت)، جس سے وہ اپنے فضلات کو پسینہ، بخارات، ہواؤں اور براز (پاخانہ) وغیرہ کی صورت میں باہر نکالتا ہے۔ اور جہاں تک بخارات کے سرایت کرنے اور جگر سے رگوں میں خون کی تقسیم کا تعلق ہے، اور جو کچھ حیوان کا ہر جز خالص کرتا ہے، وہ قوت جاذبہ سے ہوتا ہے نہ کہ دافعہ سے۔ پس قوت دافعہ کا حصہ صرف وہ فضلات ہیں جنہیں ہم باہر نکالتے ہیں، جیسا کہ ہم نے کہا، اور کچھ نہیں۔ پھر اس نے اس میں قوت غاذیہ (غذا دینے والی)، منمیہ (بڑھانے والی)، حاسیہ (محسوس کرنے والی)، خیالیہ (تخیلی)، وہمیہ (وہم کرنے والی)، حافظہ (یاد رکھنے والی) اور ذاکرہ (ذکر کرنے والی) قوتیں پیدا کیں۔ اور یہ سب انسان میں اس حیثیت سے ہیں کہ وہ حیوان ہے، نہ کہ صرف انسان ہونے کی حیثیت سے۔ البتہ یہ چار قوتیں، یعنی خیال، وہم، حفظ اور ذکر کی قوت، انسان میں حیوان کی نسبت زیادہ قوی ہیں۔\n\nپھر آدم کو، جو کہ انسان ہے، قوت مصورہ (صورت بنانے والی)، مفکرہ (غور و فکر کرنے والی) اور عاقلہ (عقل والی) کے ساتھ خاص کیا، پس وہ حیوان سے ممتاز ہو گیا۔ اور اس نے ان تمام قوتوں کو اس جسم میں نفس ناطقہ (بولنے والی روح) کے لیے آلات بنایا، تاکہ وہ ان کے ذریعے اپنے تمام محسوس اور معنوی فوائد تک پہنچ سکے۔ پھر اس نے اسے ایک اور مخلوق کے طور پر پیدا کیا، جو کہ انسانیت ہے۔ پس اسے ان قوتوں کے ذریعے ادراک کرنے والا، زندہ، عالم، قادر، ارادہ کرنے والا، متکلم، سننے والا، دیکھنے والا بنایا، اس کے کسب (حصول) میں ایک معلوم، معتاد حد پر۔ **فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ** (پس بابرکت ہے اللہ، سب سے بہترین پیدا کرنے والا)۔\n\nپھر اللہ سبحانہ و تعالیٰ نے اپنا کوئی نام نہیں رکھا مگر یہ کہ اس نے انسان کے لیے اس نام سے متخلق ہونے کا ایک حصہ مقرر کیا، جس کے ذریعے وہ عالم میں ظاہر ہوتا ہے، اس مقدار کے مطابق جو اس کے لائق ہے۔ اسی لیے بعض نے نبی صلی اللہ علیہ وسلم کے اس قول کی تاویل کی ہے: \"بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا\"۔\n\nاسی معنی پر، اور اسے اپنی زمین میں اپنا خلیفہ بنا کر اتارا، کیونکہ زمین تغیرات اور استحالوں (تبدیلیوں) کے عالم سے تعلق رکھتی ہے، برخلاف عالم بالا کے۔ پس ان میں احکام اس تبدیلی کے مطابق پیدا ہوتے ہیں جو عالم ارضی میں واقع ہوتی ہے، تاکہ تمام اسماء الٰہیہ (اللہ کے ناموں) کا حکم ظاہر ہو۔ اسی لیے وہ زمین میں خلیفہ تھا نہ کہ آسمان اور جنت میں۔ پھر اس کا معاملہ وہ ہوا جو اسماء کے علم، فرشتوں کے سجدے اور ابلیس کے انکار سے متعلق تھا، ان سب کا ذکر ان شاء اللہ اپنے مقام پر آئے گا۔\n\n### (انسانی اجسام اور ان کی اقسام)\n\nپس یہ باب انسانی اجسام کی ابتدا کے لیے مخصوص ہے، اور وہ چار اقسام کے ہیں: آدم کا جسم، حواء کا جسم، عیسیٰ کا جسم، اور بنی آدم کے اجسام۔ اور ان چاروں میں سے ہر جسم کی نشأة (پیدائش) سببیت میں دوسرے کی نشأة سے مختلف ہے، باوجود اس کے کہ وہ جسمانی اور روحانی صورت میں یکجا ہیں۔ ہم نے یہ بات اس لیے بیان کی اور اس پر تنبیہ کی تاکہ کمزور عقل والا یہ وہم نہ کرے کہ قدرت الٰہیہ (القدرۃ الإلٰہیۃ) یا حقائق (الحقائق) یہ اجازت نہیں دیتیں کہ یہ انسانی نشأة صرف ایک ہی سبب سے ہو جو اپنی ذات سے یہ نشأة پیدا کرے۔ پس اللہ نے اس شبہ کو رد کیا کہ اس نے یہ انسانی نشأة آدم میں ایک ایسے طریقے سے ظاہر کی جس سے حواء کا جسم ظاہر نہیں ہوا، اور حواء کا جسم ایک ایسے طریقے سے ظاہر کیا جس سے بنی آدم کا جسم ظاہر نہیں ہوا، اور بنی آدم کے اجسام کو ایک ایسے طریقے سے ظاہر کیا جس سے عیسیٰ علیہ السلام کا جسم ظاہر نہیں ہوا۔ اور ان میں سے ہر ایک پر انسان کا نام حد اور حقیقت کے ساتھ لاگو ہوتا ہے۔ یہ اس لیے تاکہ معلوم ہو جائے کہ **أَنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ وَأَنَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ** (بے شک اللہ ہر چیز کو جاننے والا ہے اور بے شک وہ ہر چیز پر قادر ہے)۔\n\nپھر اللہ نے خلق کی ان چاروں اقسام کو قرآن کی ایک آیت میں سورۃ الحجرات میں جمع فرمایا، جب اس نے کہا: **يَا أَيُّهَا النَّاسُ إِنَّا خَلَقْنَاكُمْ** (اے لوگو! بے شک ہم نے تمہیں پیدا کیا) – اس سے مراد آدم ہے – **مِنْ ذَكَرٍ** (ایک مرد سے) – اس سے مراد حواء ہے – **وَأُنْثَى** (اور ایک عورت سے) – اس سے مراد عیسیٰ ہے – اور مرد اور عورت کے مجموعے سے – اس سے مراد نکاح اور توالد کے ذریعے بنی آدم ہیں۔ پس یہ آیت ان جوامع الکلم (جامع کلمات) اور فصل الخطاب (فیصلہ کن بات) میں سے ہے جو محمد صلی اللہ علیہ وسلم کو عطا کیے گئے۔\n\n### (آدم کا جسم اور حواء کا جسم)\n\nاور جب آدم کا جسم ظاہر ہوا جیسا کہ ہم نے ذکر کیا، اور اس میں نکاح کی شہوت نہیں تھی، اور ذات حق (الحق) کے علم میں توالد، تناسل اور نکاح کا وجود اس دنیا میں نوع کی بقا (البقاء) کے لیے پہلے سے طے شدہ تھا، تو اس نے حواء کو آدم کی پسلیوں میں سے چھوٹی پسلی سے نکالا۔ پس وہ اس وجہ سے مرد کے درجے سے کم ہو گئی، جیسا کہ اللہ تعالیٰ نے فرمایا: **وَلِلرِّجَالِ عَلَيْهِنَّ دَرَجَةٌ** (اور مردوں کو ان پر ایک درجہ فضیلت ہے)۔ پس وہ کبھی ان کے برابر نہیں ہو سکتی۔ اور وہ پسلی سے اس لیے تھی کہ پسلیوں میں جو خم ہے، اس کی وجہ سے وہ اپنے بچے اور اپنے شوہر پر شفقت کرے۔ پس مرد کی عورت پر شفقت اس کا اپنی ذات پر شفقت کرنا ہے، کیونکہ وہ اس کا ایک جز ہے۔ اور عورت کی مرد پر شفقت اس لیے ہے کہ وہ پسلی سے پیدا کی گئی، اور پسلی میں خم اور جھکاؤ ہے۔\n\n### (آدم کی محبت اور حواء کی محبت)\n\nاور اللہ نے آدم کے اس مقام کو جہاں سے حواء نکلی تھی، اس کی شہوت سے آباد کر دیا، کیونکہ وجود (الوجود) میں کوئی خلا باقی نہیں رہتا۔ پس جب اس نے اسے ہوا سے آباد کیا، تو آدم نے اس کی طرف اپنی ذات کی طرف حنین (تڑپ) محسوس کی، کیونکہ وہ اس کا ایک جز تھی۔ اور حواء نے اس کی طرف حنین محسوس کیا کیونکہ وہ اس کا وطن تھا جہاں سے وہ پیدا ہوئی تھی۔ پس حواء کی محبت وطن کی محبت ہے، اور آدم کی محبت اپنی ذات کی محبت ہے۔ اسی لیے مرد کی عورت کے لیے محبت ظاہر ہوتی ہے، إذ كانت عينه (کیونکہ وہ اس کی عینیت ہے)۔ اور عورت کو مرد کی محبت میں وہ قوت عطا کی گئی جسے حیاء (شرم) سے تعبیر کیا جاتا ہے، پس وہ چھپانے پر قوی ہوئی، کیونکہ وطن اس کے ساتھ آدم کی طرح متحد نہیں ہوتا۔\n\nپس اس نے اس پسلی میں وہ سب کچھ صورت پذیر کیا اور پیدا کیا جو اس نے آدم کے جسم میں صورت پذیر کیا اور پیدا کیا تھا۔ پس آدم کے جسم کی نشأة اس کی صورت میں ایسی تھی جیسے کمہار کا مٹی سے چیزیں بنا کر پکانا، اور حواء کے جسم کی نشأة ایسی تھی جیسے بڑھئی کا لکڑی میں صورتیں تراشنا۔ پس جب اس نے اسے پسلی میں تراشا اور اس کی صورت کو قائم کیا، اسے درست کیا اور معتدل کیا، تو اس میں اپنی روح پھونکی، پس وہ زندہ، ناطق عورت بن کر کھڑی ہو گئی، تاکہ اسے زراعت اور کھیتی باڑی کا محل بنائے، تناسل (نسل بڑھانے) کے وجود کے لیے۔ پس آدم اس کی طرف مائل ہوا اور وہ اس کی طرف مائل ہوئی، اور وہ اس کے لیے لباس بنی اور وہ اس کے لیے لباس بنا۔ اللہ تعالیٰ نے فرمایا: **هُنَّ لِبَاسٌ لَكُمْ وَأَنْتُمْ لِبَاسٌ لَهُنَّ** (وہ تمہارے لیے لباس ہیں اور تم ان کے لیے لباس ہو)۔ اور شہوت اس کے تمام اجزاء میں سرایت کر گئی، پس اس نے اسے طلب کیا۔\n\n### (تیسرے جسم کی تشکیل)\n\nپس جب **فَلَمَّا تَغَشَّاهَا** (جب اس نے اسے ڈھانپ لیا) اور رحم میں پانی ڈالا، اور وہ نطفہ اس پانی کے ساتھ حیض کے خون کے گرد گھوما جسے اللہ نے عورتوں پر لکھ دیا ہے، تو اس جسم میں ایک تیسرا جسم تشکیل پایا، جو آدم کے جسم اور حواء کے جسم کی تشکیل سے مختلف تھا۔ پس یہ تیسرا جسم ہے۔ پس اللہ نے رحم میں اسے حال کے بعد حال میں نشأة (پیدائش) کے ذریعے سنبھالا، پانی سے نطفہ، پھر علقہ (جما ہوا خون)، پھر مضغہ (گوشت کا لوتھڑا)، پھر ہڈی، پھر ہڈی پر گوشت چڑھایا۔ پس جب اس نے اس کی حیوانی نشأة مکمل کر دی، تو اسے ایک اور مخلوق کے طور پر پیدا کیا، پس اس میں انسانی روح پھونکی۔ **فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ** (پس بابرکت ہے اللہ، سب سے بہترین پیدا کرنے والا)۔ اور اگر معاملہ طویل نہ ہوتا تو ہم رحم میں اس کی تشکیل کو حال کے بعد حال بیان کرتے، اور ان فرشتوں کا ذکر کرتے جو ارحام میں صورتیں بنانے پر مقرر ہیں، خروج کے وقت تک۔ لیکن مقصد یہ بتانا تھا کہ اگرچہ انسانی اجسام حد اور حقیقت میں اور حسی و معنوی صورتوں میں ایک ہیں، لیکن ان کی تالیف کے اسباب مختلف ہیں، تاکہ یہ خیال نہ کیا جائے کہ یہ صرف سبب کی ذات کی وجہ سے ہے، اللہ اس سے بلند ہے۔ بلکہ یہ ایک مختار فاعل (اختیار رکھنے والے کام کرنے والے) کی طرف لوٹتا ہے جو جو چاہتا ہے، جیسے چاہتا ہے، کرتا ہے، بغیر کسی رکاوٹ یا کسی ایک امر پر قناعت کے۔ **لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ** (اس کے سوا کوئی معبود نہیں، وہ غالب، حکمت والا ہے)۔\n\n### (عیسیٰ کے جسم کی تشکیل)\n\nاور جب اہل طبیعت (فطرت پرستوں) نے کہا کہ عورت کے پانی سے کوئی چیز تشکیل نہیں پاتی، اور رحم میں موجود جنین صرف مرد کے پانی سے ہوتا ہے، اسی لیے ہم نے عیسیٰ کے جسم کی تشکیل کو ایک اور تشکیل بنایا، اگرچہ رحم میں اس کی تدبیر بیٹوں کے اجسام کی تدبیر جیسی تھی۔ خواہ وہ عورت کے پانی سے تھا جب روح اس کے سامنے **بَشَرًا سَوِيًّا** (ایک مکمل انسان) بن کر ظاہر ہوئی، یا بغیر پانی کے پھونکنے سے تھا، بہر صورت وہ نشأة میں نوع کے دیگر اجسام سے مختلف ایک چوتھا جسم ہے۔ اسی لیے اللہ تعالیٰ نے فرمایا: **إِنَّ مَثَلَ عِيسَى** (بے شک عیسیٰ کی مثال) – یعنی عیسیٰ کی نشأة کی صفت – **عِنْدَ اللَّهِ كَمَثَلِ آدَمَ خَلَقَهُ مِنْ تُرَابٍ** (اللہ کے نزدیک آدم کی مثال جیسی ہے، جسے اس نے مٹی سے پیدا کیا)۔ ضمیر آدم کی طرف لوٹتا ہے۔ اور اس کی تخلیق میں بغیر باپ کے ہونے میں مشابہت واقع ہوئی، یعنی اس کی نشأة کی صفت آدم کی نشأة کی صفت جیسی ہے، سوائے اس کے کہ آدم کو مٹی سے پیدا کیا، **ثُمَّ قَالَ لَهُ كُنْ** (پھر اسے کہا: ہو جا)۔\n\nپھر عیسیٰ علیہ السلام نے، جیسا کہ کہا جاتا ہے، مریم کے پیٹ میں بیٹوں کے معتاد ٹھہرنے کی مدت نہیں گزاری، کیونکہ اللہ نے اسے نشانی بنانا چاہا اور اس کے ذریعے فطرت پرستوں کو جواب دینا چاہا، جب انہوں نے طبیعت پر اس چیز کا حکم لگایا جو انہیں عادت سے ملی تھی، نہ کہ اس چیز کا جو اللہ نے اس میں ودیعت کیے گئے اسرار اور عجیب و غریب تخلیقات کا تقاضا کرتی ہے۔ اور اس فن کے بعض ماہرین نے طبیعت کے ساتھ انصاف کیا اور کہا: ہم اس میں سے صرف وہی جانتے ہیں جو اس نے ہمیں خاص طور پر دیا ہے، اور اس میں وہ کچھ بھی ہے جو ہم نہیں جانتے۔\n\n### (زمین میں انسان آسمان میں عقل کا نظیر ہے)\n\nپس یہ ہم نے انسانی اجسام کی ابتدا کا ذکر کیا، اور یہ کہ وہ چار مختلف نشأة کے اجسام ہیں جیسا کہ ہم نے مقرر کیا، اور یہ کہ وہ مولدات (پیدا شدہ اشیاء) میں سب سے آخر میں ہے۔ پس وہ عقل اول (العقل الأول) کا نظیر ہے اور اسی سے منسلک ہے۔ کیونکہ وجود (الوجود) ایک دائرہ ہے۔ پس دائرے کی ابتدا عقل اول (العقل الأول) کا وجود تھا، جس کے بارے میں حدیث میں آیا ہے کہ سب سے پہلی چیز جو اللہ نے پیدا کی وہ عقل (العقل) ہے۔ پس وہ اجناس میں سب سے اول ہے۔ اور خلق کا اختتام جنس انسانی پر ہوا، پس دائرہ مکمل ہو گیا اور انسان عقل سے اس طرح جڑ گیا جیسے دائرے کا آخر اس کے اول سے جڑتا ہے۔ پس یہ ایک دائرہ بن گیا۔ اور دائرے کے دونوں سروں کے درمیان وہ سب کچھ ہے جو اللہ نے عالم کی اجناس میں سے پیدا کیا، عقل اول (جو قلم بھی ہے) اور انسان (جو آخری موجود ہے) کے درمیان۔\n\nاور چونکہ دائرے کے مرکز میں موجود نقطے سے محیط کی طرف نکلنے والی لکیریں، جو اس سے وجود میں آیا، محیط کے ہر جز کے لیے یکساں طور پر نکلتی ہیں، اسی طرح ذات حق (الحق) تعالیٰ کی نسبت تمام موجودات سے ایک ہی ہے، پس وہاں کوئی تبدیلی واقع نہیں ہوتی۔ تمام اشیاء اس کی طرف دیکھ رہی ہیں اور اس سے وہ قبول کر رہی ہیں جو وہ انہیں عطا کرتا ہے، جیسے محیط کے اجزاء نقطے کی طرف دیکھتے ہیں۔ اور اللہ سبحانہ و تعالیٰ نے اس انسانی صورت کو حرکت مستقیمہ (سیدھی حرکت) کے ساتھ قائم کیا، جو خیمے کے ستون (عمد) کی صورت ہے۔ پس اس نے اسے ان آسمانوں کا گنبد بنایا۔ پس وہ سبحانہ و تعالیٰ اسے اس کے سبب سے زائل ہونے سے روکے ہوئے ہے۔ پس ہم نے اسے ستون (عمد) سے تعبیر کیا۔ پس جب یہ صورت فنا (الفناء) ہو جائے گی اور زمین پر کوئی سانس لینے والا باقی نہیں رہے گا، تو **وَانْشَقَّتِ السَّمَاءُ فَهِيَ يَوْمَئِذٍ وَاهِيَةٌ** (اور آسمان پھٹ جائے گا، پس وہ اس دن کمزور ہو گا)، کیونکہ ستون (عمد) یعنی انسان زائل ہو چکا ہے۔\n\nاور جب انسان کے آخرت کی طرف منتقل ہونے سے عمارت آخرت کی طرف منتقل ہو گئی، اور اس کے وہاں منتقل ہونے سے دنیا ویران ہو گئی، تو ہم نے قطعی طور پر جان لیا کہ انسان ہی عالم میں اللہ کا مقصود عین ہے، اور وہ حقیقتاً خلیفہ ہے، اور وہ اسماء الٰہیہ (اللہ کے ناموں) کے ظہور کا محل ہے، اور وہ فرشتہ، فلک، روح، جسم، طبیعت، جماد، نباتات اور حیوان سمیت تمام عالم کی حقائق (الحقائق) کو جمع کرنے والا ہے، اس کے ساتھ جو اسے اسماء الٰہیہ کے علم سے خاص کیا گیا۔ باوجود اس کے کہ اس کا حجم اور جرم چھوٹا ہے۔ اور اللہ نے اس کے بارے میں یہ اس لیے کہا کہ **لَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ** (بے شک آسمانوں اور زمین کا پیدا کرنا لوگوں کے پیدا کرنے سے بڑا ہے)، کیونکہ انسان آسمان اور زمین سے پیدا ہوا ہے، پس وہ اس کے لیے والدین کی طرح ہیں، پس اللہ نے ان کی قدر کو بلند کیا۔ **وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ** (لیکن اکثر لوگ نہیں جانتے)۔ اس سے مراد جسمانیت نہیں ہے، کیونکہ وہ حسی طور پر معلوم ہے۔\n\n### (انسان کی سب سے بڑی آزمائش)\n\nالبتہ اللہ تعالیٰ نے اسے ایک ایسی آزمائش میں ڈالا جس میں اس نے اپنی کسی مخلوق کو نہیں ڈالا، تاکہ وہ اسے نیک بخت بنائے یا بد بخت، اس کے استعمال میں اس کی توفیق کے مطابق۔ اور وہ آزمائش جس میں اسے ڈالا، یہ تھی کہ اس میں ایک قوت پیدا کی جسے فکر (الفکر) کہا جاتا ہے، اور اس قوت کو ایک دوسری قوت کی خادمہ بنایا جسے عقل (العقل) کہا جاتا ہے۔ اور عقل کو، اس کی فکر پر سیادت کے باوجود، مجبور کیا کہ وہ اس سے وہی لے جو وہ اسے دے۔ اور فکر (الفکر) کے لیے قوت خیالیہ (تخیلی قوت) کے سوا کوئی میدان نہیں بنایا۔ اور اللہ سبحانہ و تعالیٰ نے قوت خیالیہ کو ایک ایسا محل بنایا جو قوت حاسہ (محسوس کرنے والی قوت) جو کچھ اسے دیتی ہے، اسے جمع کرتا ہے، اور اس کے لیے ایک قوت بنائی جسے مصورہ (صورت بنانے والی) کہا جاتا ہے۔ پس قوت خیالیہ میں وہی کچھ حاصل ہوتا ہے جو حس نے اسے دیا یا قوت مصورہ نے اسے دیا۔ اور مصورہ کا مادہ محسوسات سے ہے۔ پس وہ ایسی صورتیں ترکیب دیتی ہے جن کا کوئی عین (حقیقی وجود) نہیں ہوتا، لیکن ان کے تمام اجزاء حسی طور پر موجود ہوتے ہیں۔ اور یہ اس لیے کہ عقل (العقل) سادہ پیدا کیا گیا، اس کے پاس نظری علوم میں سے کچھ نہیں تھا۔\n\nاور فکر (الفکر) سے کہا گیا کہ وہ اس قوت خیالیہ میں موجود حق اور باطل کے درمیان تمیز کرے۔ پس وہ اس کے مطابق دیکھتا ہے جو اسے حاصل ہوتا ہے۔ پس کبھی وہ شبہ میں پڑ جاتا ہے اور کبھی دلیل میں، بغیر اس کے کہ اسے اس کا علم ہو۔ لیکن اس کے گمان میں وہ شبہات کی صورتوں کو دلائل سے جاننے والا ہے، اور یہ کہ اس نے علم حاصل کر لیا ہے۔ اور وہ ان مواد کی کمی پر غور نہیں کرتا جن پر اس نے علوم کے حصول میں بھروسہ کیا، پس عقل اسے قبول کر لیتا ہے اور اس کے مطابق حکم لگاتا ہے، پس اس کا جہل اس کے علم سے کہیں زیادہ ہو جاتا ہے۔\n\nپھر اللہ نے اس عقل کو اپنی معرفت (المعرفۃ) کا مکلف بنایا، تاکہ وہ اس میں اسی کی طرف رجوع کرے نہ کہ کسی اور کی طرف۔ پس عقل نے ذات حق (الحق) کے ارادے کے برعکس سمجھا، اس کے قول **أَوَلَمْ يَتَفَكَّرُوا لِقَوْمٍ يَتَفَكَّرُونَ** (کیا انہوں نے غور نہیں کیا؟ ان لوگوں کے لیے جو غور کرتے ہیں) کے ذریعے، پس اس نے فکر (الفکر) پر بھروسہ کیا اور اسے امام بنا لیا جس کی پیروی کی جاتی ہے، اور ذات حق (الحق) کے اس ارادے سے غافل ہو گیا کہ تفکر (غور و فکر) سے مراد یہ تھی کہ اس نے اسے مخاطب کیا کہ وہ غور کرے تاکہ وہ دیکھے کہ اللہ کی معرفت (المعرفۃ) کا راستہ صرف اللہ کے تعارف سے ہی ممکن ہے، پس وہ اس کے لیے معاملے کو اسی طرح کھول دے جیسا کہ وہ ہے۔\n\nپس ہر عقل نے یہ سمجھ نہیں سمجھا، سوائے ان خاص عقلوں کے جنہیں اللہ نے اپنے انبیاء اور اولیاء میں سے خاص کیا۔ کاش میں جانتا کہ کیا انہوں نے اپنی فکروں سے **قَالُوا بَلَى** (انہوں نے کہا: کیوں نہیں) کہا تھا، جب اللہ نے انہیں آدم کی پشت سے ذریت کی مٹھی میں ان کی جانوں پر گواہ بنایا تھا؟ نہیں، اللہ کی قسم! بلکہ یہ ان کے مشاہدہ (الشہود) کی عنایت تھی جب اس نے انہیں ان کی پشتوں سے لیا تھا۔ اور جب وہ اللہ کی معرفت (المعرفۃ) میں اپنی مفکرہ قوتوں سے لینے کی طرف لوٹے، تو وہ کبھی بھی ایک حکم پر جمع نہیں ہوئے، اور ہر گروہ ایک مذہب کی طرف چلا گیا، اور جناب الٰہی (الأحمى) میں بہت زیادہ باتیں ہونے لگیں، اور انہوں نے اللہ پر انتہائی جرات کی۔ اور یہ سب اس آزمائش کی وجہ سے ہے جس کا ہم نے ذکر کیا کہ اس نے انسان میں فکر (الفکر) کو پیدا کیا۔\n\nاور اہل اللہ نے اس چیز میں اس کی طرف فقر (محتاجی) اختیار کی جس کا اس نے انہیں ایمان لانے کا مکلف بنایا تھا، اور انہوں نے جانا کہ ان سے مراد یہ ہے کہ وہ اس میں اور ہر حال میں اسی کی طرف رجوع کریں۔ پس ان میں سے بعض کہنے والے ہیں: \"پاک ہے وہ جس نے اپنی معرفت (المعرفۃ) کا کوئی راستہ نہیں بنایا سوائے اس کے کہ اس کی معرفت سے عاجز ہو جایا جائے\"۔ اور بعض نے کہا: \"ادراک کے ادراک سے عاجز ہونا ہی ادراک ہے\"۔ اور نبی صلی اللہ علیہ وسلم نے فرمایا: **لَا أُحْصِي ثَنَاءً عَلَيْكَ** (میں آپ کی ثناء کا احاطہ نہیں کر سکتا)۔\n\nاور اللہ تعالیٰ نے فرمایا: **وَلَا يُحِيطُونَ بِهِ عِلْمًا** (اور وہ اپنے علم سے اس کا احاطہ نہیں کر سکتے)۔ پس وہ اس کی معرفت (المعرفۃ) میں اللہ کی طرف لوٹے اور فکر (الفکر) کو اس کے مرتبے پر چھوڑ دیا اور اس کا حق ادا کیا، اسے اس چیز کی طرف منتقل نہیں کیا جس میں اسے غور و فکر نہیں کرنا چاہیے۔ اور اللہ کی ذات میں غور و فکر کرنے سے منع کیا گیا ہے۔\n\nاور اللہ فرماتا ہے: **وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ** (اور اللہ تمہیں اپنی ذات سے ڈراتا ہے)۔ پس اللہ نے انہیں اپنی معرفت (المعرفۃ) میں سے وہ کچھ عطا کیا جو عطا کیا، اور انہیں اپنی مخلوقات اور مظاہر میں سے وہ کچھ دکھایا جو دکھایا۔ پس انہوں نے جانا کہ جو چیز عقلی طور پر فکر کے ذریعے محال ہے، وہ نسبت الٰہیہ کے لحاظ سے محال نہیں ہے، جیسا کہ ہم اس کا ایک حصہ اس باب میں بیان کریں گے جو آدم کی مٹی کے باقی ماندہ حصے سے پیدا ہونے والی زمین وغیرہ کے بارے میں ہے۔ پس جو چیز عاقل کے لیے ضروری ہے کہ وہ اپنے نفس میں اللہ پر ایمان لائے، وہ یہ ہے کہ وہ جان لے کہ **إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ** (بے شک اللہ ہر چیز پر قادر ہے)، خواہ وہ ممکن ہو یا محال۔ اور ہر محال پر اس کی قدرت نافذ ہے، وہ وسیع عطا والا ہے۔ اس کی ایجاد میں تکرار نہیں ہے، بلکہ ایسی مثالیں ہیں جو اس جوہر میں پیدا ہوتی ہیں جسے اس نے پیدا کیا اور اس کے بقا (البقاء) کو چاہا، اور اگر وہ چاہتا تو اسے سانسوں کے ساتھ فنا (الفناء) کر دیتا۔ **لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ** (اس کے سوا کوئی معبود نہیں، وہ غالب، حکمت والا ہے)۔",
    "fa": "(باب هفتم) در معرفت آغاز پیکرهای انسانی\n\nو آن آخرین جنس موجود از عالم کبیر و آخرین صنف از مولدات (موجودات متولد شده) است.\n\n> حقیقت باطن انسان پدید آمد *** پادشاهی نیرومند با سلطنتی آشکار\n> سپس ذات او بر عرش آدم استوار شد *** همچون استواری عرش بر رحمان\n> پس حقیقت جسم او در عین آن (حقیقت) آشکار گشت *** و با آن، مُلک هستی (الوجود) دوم به پایان رسید\n> و معارف گفتار او در علمش آشکار شد *** نزد گرامیان و کینه‌توزان\n> پس آرزوهایشان در برابر علوم او کوچک شد *** و آن ملعون از شیطان تکبر ورزید\n> آنان به قرب الهی در ملکوتش بازگشتند *** مگر آن شیطانک که به زیان بازگشت.\n\n### [عمر عالم طبیعی]\n\nبدان، خداوند تو را یاری کند، که چون از عمر عالم طبیعی که مقید به زمان و محصور در مکان است، هفتاد و یک هزار سال از سال‌های شناخته شده در دنیا گذشت، این مدت یازده روز از روزهایی با نامی دیگر است، و یک روز و پنج روز از روزهای ذی‌المعارج است. در این روزها برتری (تفاضل) رخ می‌دهد. خداوند متعال می‌فرماید: **«در روزی که مقدار آن پنجاه هزار سال است» (يَوْمٍ كانَ مِقْدارُهُ خَمْسِينَ أَلْفَ سَنَةٍ)** و فرمود: **«و همانا یک روز نزد پروردگارت مانند هزار سال از آن چیزی است که شما می‌شمارید» (إِنَّ يَوْماً عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ)**. پس کوچک‌ترین روزها، روزهایی هستند که ما می‌شماریم و ناشی از حرکت فلک محیط است که شب و روز در آن آشکار می‌شود. کوتاه‌ترین روز نزد عرب، همین روز است که متعلق به بزرگ‌ترین فلک است، و این به دلیل حکم آن بر افلاکی است که در درونش قرار دارند، زیرا حرکت آنچه پایین‌تر از آن است در شب و روز، حرکتی قسری (اجباری) برای آن است که با آن بر سایر افلاکی که احاطه کرده، غلبه یافته است.\n\n### [حرکت طبیعی و قسری افلاک]\n\nو برای هر فلکی یک حرکت طبیعی وجود دارد که همراه با حرکت قسری برای آن است. پس هر فلکی که پایین‌تر از آن است، در یک زمان دارای دو حرکت است: حرکت طبیعی و حرکت قسری. و برای هر حرکت طبیعی در هر فلکی، روز مخصوصی وجود دارد که مقدار آن با روزهایی که از فلک محیط پدید می‌آیند و با عبارت **«آنچه شما می‌شمارید» (مِمَّا تَعُدُّونَ)** از آن تعبیر شده، محاسبه می‌شود. و همه آن‌ها در فلک محیط قطع می‌شوند؛ هرگاه آن را به طور کامل قطع کند، یک روز برای آن فلک خواهد بود و این دور می‌چرخد. کوچک‌ترین روزها از این میان، بیست و هشت روز از آنچه شما می‌شمارید است، که مقدار قطع حرکت ماه در فلک محیط است. و خداوند این هفت ستاره را در آسمان‌ها قرار داد تا چشم، قطع فلک آن‌ها را در فلک محیط درک کند تا عدد سال‌ها و حساب را بدانیم. خداوند متعال می‌فرماید: **«و برای آن منزل‌هایی مقدر کردیم تا عدد سال‌ها و حساب را بدانید؛ و هر چیزی را به تفصیل بیان کردیم. این تقدیر (اندازه‌گیری) خدای عزیز و داناست» (وقَدَّرَهُ مَنازِلَ لِتَعْلَمُوا عَدَدَ السِّنِينَ والْحِسابَ وكُلَّ شَيْ‏ءٍ فَصَّلْناهُ تَفْصِيلًا ذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ)**. پس برای هر یک از این ستارگان، روزی مقدر است که برخی بر برخی دیگر برتری دارند، به اندازه سرعت حرکات طبیعی‌شان یا کوچکی و بزرگی افلاکشان.\n\n### [خلق قلم و لوح]\n\nپس بدان که چون خداوند متعال قلم و لوح را آفرید و آن‌ها را عقل و روح نامید، و به روح دو صفت داد: صفت علمی و صفت عملی، و عقل را برای آن معلم و آموزنده قرار داد، آموزاندنی از طریق مشاهده حالی، همان‌گونه که از صورت چاقو، بریدن را می‌آموزی بدون آنکه چاقو سخنی بگوید. و خداوند جوهری پایین‌تر از نفس (که همان روح مذکور است) آفرید و آن را هباء نامید. این نام‌گذاری را از کلام علی بن ابی‌طالب (رضی الله عنه) نقل کرده‌ایم.\n\n### [خلق هباء]\n\nو اما هباء (غبار پراکنده)، در زبان عربی ذکر شده است. خداوند متعال می‌فرماید: **«پس غبار پراکنده شد» (فَكانَتْ هَباءً مُنْبَثًّا)**. همچنین، هنگامی که علی بن ابی‌طالب این جوهر را دید که در تمام صور طبیعی پراکنده است و هیچ صورتی از آن خالی نیست، زیرا هیچ صورتی جز در این جوهر وجود ندارد، آن را هباء نامید. و این (هباء) با هر صورتی به حقیقت خود همراه است، نه تقسیم می‌شود، نه تجزیه می‌گردد و نه به نقص متصف می‌شود، بلکه مانند سفیدی است که در هر شیء سفیدی به ذات و حقیقتش موجود است و گفته نمی‌شود که از سفیدی به اندازه‌ای که در این شیء سفید حاصل شده، کاسته شده است. این مثال حال این جوهر است.\n\n### [مراتب چهارگانه بین روح و هباء]\n\nو خداوند سبحان میان این روح که به دو صفت توصیف شده و میان هباء، چهار مرتبه قرار داد و هر مرتبه را منزلگاهی برای چهار فرشته ساخت. و این فرشتگان را مانند والیان بر آنچه خداوند در زیر آن‌ها از عالم، از علیین تا اسفل سافلین، ایجاد کرده است، قرار داد. و به هر فرشته‌ای از این فرشتگان، علم آنچه را که می‌خواهد در عالم اجرا کند، بخشید. پس اولین چیزی که خداوند در اعیان (حقایق موجود) ایجاد کرد و علم و تدبیر این فرشتگان به آن تعلق گرفت، جسم کلی بود. و اولین شکلی که در این جسم گشوده شد، شکل کروی و گرد بود، زیرا بهترین اشکال بود. سپس خداوند سبحان با ایجاد و خلق، تا تمام شدن صنعت، پایین آمد و تمام آنچه را که آفرید، قلمرو این فرشتگان قرار داد و امور آن را در دنیا و آخرت به آن‌ها سپرد و آن‌ها را از مخالفت در آنچه به آن‌ها امر کرده بود، معصوم ساخت. پس خداوند سبحان به ما خبر داد که آن‌ها **«از آنچه خدا به آن‌ها امر کرده، سرپیچی نمی‌کنند و آنچه را که مأمورند انجام می‌دهند» (لا يَعْصُونَ الله ما أَمَرَهُمْ ويَفْعَلُونَ ما يُؤْمَرُونَ)**.\n\n### [خلق مولدات]\n\nو چون خلق مولدات (موجودات متولد شده) از جمادات، نباتات و حیوانات با پایان هفتاد و یک هزار سال از سال‌های دنیا که ما می‌شماریم، به اتمام رسید و عالم را با ترتیبی حکیمانه سامان داد، خداوند سبحان هیچ یک از مخلوقاتش را، از اولین موجود تا آخرین مولود که حیوان است، با دو دست خود جمع نکرد، مگر انسان را که همین نشأت بدنی خاکی است. بلکه هر آنچه غیر از آن بود را یا با امر الهی آفرید یا با یک دست. خداوند متعال می‌فرماید: **«همانا سخن ما برای چیزی که اراده‌اش کنیم، این است که به آن بگوییم: باش، پس می‌شود» (إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ)**. این از امر الهی است. و در خبر آمده است که خداوند عزوجل باغ عدن را با دست خود آفرید، تورات را با دست خود نوشت، درخت طوبی را با دست خود کاشت و آدم را که همان انسان است، با دو دست خود آفرید. پس خداوند متعال به ابلیس، از باب تشریف و گرامی‌داشت آدم (علیه السلام)، فرمود: **«چه چیز تو را بازداشت از اینکه سجده کنی برای آنچه با دو دست خود آفریدم؟» (ما مَنَعَكَ أَنْ تَسْجُدَ لِما خَلَقْتُ بِيَدَيَ)**.\n\n### [فلک پایین‌تر و دوازده برج]\n\nو چون خداوند فلک پایین‌تر (الأدنى) را که همان فلک اول مذکور در بالا بود، آفرید، آن را به دوازده بخش تقسیم کرد و آن‌ها را نامید. خداوند متعال می‌فرماید: **«سوگند به آسمان دارای برج‌ها» (والسَّماءِ ذاتِ الْبُرُوجِ)**. پس هر بخش را برجی قرار داد و این بخش‌ها را در طبیعت به چهار (طبع) بازگرداند، سپس هر یک از این چهار طبع را در سه موضع از آن تکرار کرد. و این بخش‌ها را مانند منزل‌ها و آبشخورهایی قرار داد که مسافران در آن‌ها فرود می‌آیند و روندگان در حال سیر و سفر خود در آن‌ها حرکت می‌کنند، تا هنگام سیر و سیاحت ستارگان در این بخش‌ها، آنچه را که خداوند در درون این فلک از ستارگان پدید می‌آورد، نازل شود؛ ستارگانی که با سیر خود در این برج‌ها قطع می‌شوند تا خداوند هنگام قطع و سیر آن‌ها، آنچه را که می‌خواهد از عالم طبیعی و عنصری پدید آورد. و آن‌ها را نشانه‌هایی بر اثر حرکت فلک برج‌ها قرار داد، پس بدان.\n\n### [طبایع و عناصر چهارگانه]\n\nپس طبیعت یک بخش از این چهار بخش، گرمی و خشکی است، و دومی سردی و خشکی، و سومی گرمی و رطوبت، و چهارمی سردی و رطوبت. و بخش پنجم و نهم را مانند اول، و ششم و دهم را مانند دوم، و هفتم و یازدهم را مانند سوم، و هشتم و دوازدهم را مانند چهارم قرار داد؛ یعنی در طبیعت. پس اجسام طبیعی و اجسام عنصری را بدون اختلاف در این چهار (طبع) که عبارتند از گرمی، سردی، رطوبت و خشکی، محصور کرد. و با وجود اینکه این چهار، مادران (اصول) هستند، خداوند دو تای آن‌ها را اصل در وجود دو تای دیگر قرار داد؛ پس خشکی از گرمی و رطوبت از سردی منفعل شد. بنابراین، رطوبت و خشکی از دو سبب که گرمی و سردی هستند، موجود شده‌اند. به همین دلیل، خداوند در قول خود متعال ذکر کرده است: **«و هیچ تر و خشکی نیست مگر در کتابی آشکار» (ولا رَطْبٍ ولا يابِسٍ إِلَّا في كِتابٍ مُبِينٍ)**. زیرا از مسبب بودن، وجود سبب لازم می‌آید، یا از منفعل بودن، وجود فاعل لازم می‌آید، هر طور که می‌خواهی بگو. اما از وجود سبب، وجود مسبب لازم نمی‌آید.\n\n### [فلک اطلس]\n\nو چون خداوند این فلک اول را آفرید، دورانی زد که پایانش جز برای خداوند متعال معلوم نیست، زیرا بالای آن هیچ شیء محدود از اجرام وجود ندارد که در آن قطع شود. این فلک، اولین اجرام شفاف است. پس حرکات متعدد و متمایز می‌شوند. و چون خداوند در درون آن چیزی نیافریده بود، حرکات متمایز و نزد کسی که در درون آن است، پایان می‌یابند. و اگر هم چیزی بود، باز هم متمایز نمی‌شد، زیرا فلک اطلس (بی‌ستاره) است و هیچ ستاره‌ای در آن نیست و اجزایش مشابه یکدیگرند، پس مقدار یک حرکت آن شناخته نمی‌شود و معین نمی‌گردد. اگر در آن جزئی مخالف سایر اجزایش بود، بی‌شک حرکاتش با آن شمرده می‌شد. اما خداوند قدر، انتها و تکرار آن را می‌دانست. پس از آن حرکت، روز پدید آمد، در حالی که در آن روز نه شب بود و نه روز. سپس حرکات این فلک ادامه یافت. پس خداوند سی و پنج فرشته آفرید و آن‌ها را به شانزده فرشته‌ای که ذکر کردیم، افزود. پس مجموعاً پنجاه و یک فرشته شدند. از جمله این فرشتگان، جبرئیل، میکائیل، اسرافیل و عزرائیل هستند. سپس نهصد و هفتاد و چهار فرشته دیگر آفرید و آن‌ها را به فرشتگان مذکور افزود و به آن‌ها وحی کرد و به آنچه به دست آن‌ها در خلقش جاری می‌شود، امر فرمود. پس گفتند: **«و ما جز به فرمان پروردگارت نازل نمی‌شویم. آنچه پیش روی ما و پشت سر ما و میان آن است، از آن اوست، و پروردگار تو فراموشکار نبوده است» (وما نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ لَهُ ما بَيْنَ أَيْدِينا وما خَلْفَنا وما بَيْنَ ذلِكَ وما كانَ رَبُّكَ نَسِيًّا)**. و درباره آن‌ها فرمود: **«از آنچه خدا به آن‌ها امر کرده، سرپیچی نمی‌کنند» (لا يَعْصُونَ الله ما أَمَرَهُمْ)**. پس این فرشتگان، والیان خاص هستند. و خداوند فرشتگانی را آفرید که آبادکنندگان آسمان‌ها و زمین برای عبادت او هستند. پس هیچ موضعی در آسمان و زمین نیست مگر اینکه در آن فرشته‌ای است. و حق (الحق) پیوسته از انفاس عالم، فرشتگانی می‌آفریند تا زمانی که آن‌ها نفس می‌کشند.\n\n### [خلق سرای دنیا]\n\nو چون حرکات این فلک اول به پایان رسید و مدت آن پنجاه و چهار هزار سال از آنچه شما می‌شمارید بود، خداوند سرای دنیا را آفرید و برای آن مدتی معلوم قرار داد که به آن پایان می‌یابد و صورتش منقضی می‌شود و از اینکه سرای ما باشد و صورت مخصوصی را که امروز مشاهده می‌کنیم بپذیرد، دگرگون می‌شود تا آنجا که **«زمین به زمینی دیگر و آسمان‌ها دگرگون شوند» (تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ والسَّماواتُ)**. و چون شصت و سه هزار سال از مدت حرکت این فلک گذشت، خداوند سرای آخرت، یعنی بهشت و دوزخ را آفرید که برای بندگان سعادتمند و شقاوتمند خود آماده کرده است. پس میان خلق دنیا و خلق آخرت، نُه هزار سال از آنچه شما می‌شمارید، فاصله بود. به همین دلیل، آخرت نامیده شد، به خاطر تأخیر خلقش نسبت به خلق دنیا، و دنیا، اولی نامیده شد، زیرا قبل از آن آفریده شد. خداوند متعال می‌فرماید: **«و قطعاً آخرت برای تو بهتر از دنیاست» (ولَلْآخِرَةُ خَيْرٌ لَكَ من الْأُولى‏)**، که پیامبرش (صلی الله علیه و سلم) را مخاطب قرار می‌دهد. و برای آخرت مدتی قرار نداد که بقای آن به پایان رسد، پس بقای آن دائمی است.\n\n### [سقف بهشت، فلک اطلس]\n\nو سقف بهشت را همین فلک قرار داد که نزد آن‌ها عرش است و حرکتش معین و متمایز نمی‌شود، پس حرکتش دائمی و بی‌انتهاست. و هیچ مخلوقی از آنچه ذکر کردیم، آفریده نشد مگر اینکه قصد دوم از خلقت آن، وجود انسان بود که خلیفه در عالم است. و من گفتم قصد دوم، زیرا قصد اول، معرفت حق (الحق) و عبادت او بود که عالم به خاطر آن آفریده شد. پس هیچ چیزی نیست مگر اینکه **«با حمد او تسبیح می‌گوید» (يُسَبِّحُ بِحَمْدِهِ)**. و معنای قصد دوم و اول، تعلق ارادی است، نه حدوث اراده، زیرا اراده برای خداوند صفتی قدیم و ازلی است که ذات او مانند سایر صفاتش به آن متصف شده است.\n\n### [حرکت آسمان‌ها و حرکت زمین]\n\nو چون خداوند این افلاک و آسمان‌ها را آفرید و **«در هر آسمانی امر آن را وحی کرد» (أَوْحى‏ في كُلِّ سَماءٍ أَمْرَها)** و انوار و چراغ‌هایش را در آن‌ها مرتب ساخت و آن‌ها را با فرشتگانش آباد کرد و خداوند آن‌ها را به حرکت درآورد، پس آن‌ها مطیعانه به سوی خدا حرکت کردند و آمدند، در طلب کمال در عبودیتی که شایسته آن‌هاست. زیرا خداوند متعال آن‌ها و زمین را فراخواند و **«به آن (آسمان) و به زمین فرمود: خواه یا ناخواه بیایید» (فَقالَ لَها ولِلْأَرْضِ ائْتِيا طَوْعاً أَوْ كَرْهاً)** برای امری که برای آن‌ها تعیین کرده بود. **«گفتند: مطیعانه آمدیم» (قالَتا أَتَيْنا طائِعِينَ)**. پس آن‌ها همیشه در حال آمدن هستند و پیوسته متحرک‌اند، جز اینکه حرکت زمین نزد ما پنهان است و حرکتش به دور مرکز است، زیرا زمین کروی است. اما آسمان، هنگام امر خداوند به آمدن، مطیعانه آمد. و اما زمین، چون خود را مقهور دانست و اینکه ناگزیر است با قول خداوند **«یا ناخواه» (أَوْ كَرْهاً)** آورده شود، مطیعانه آمد. پس زمین همان بود که در قول خداوند متعال **«یا ناخواه» (أَوْ كَرْهاً)** اراده شده بود، پس مطیعانه و ناخواسته آمد. **«پس آن‌ها را در دو روز به صورت هفت آسمان مقرر داشت و در هر آسمانی امر آن را وحی کرد» (فَقَضاهُنَّ سَبْعَ سَماواتٍ في يَوْمَيْنِ وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها)**.\n\n### [خلق زمین و تقدیر روزی‌های آن]\n\nو پیش از آن، **«زمین را آفریده بود و روزی‌های آن را در آن تقدیر کرده بود» (خَلَقَ الْأَرْضَ وقَدَّرَ فِيها أَقْواتَها)** به خاطر مولدات (موجودات متولد شده)، پس آن را خزانه‌ای برای روزی‌های آن‌ها قرار داد. و ما ترتیب نشأت عالم را در کتاب *عقلة المستوفز* ذکر کرده‌ایم. از جمله تقدیر روزی‌های آن، وجود آب، هوا و آتش و آنچه در آن است از بخارات، ابرها، برق‌ها، رعدها و آثار علوی بود. **«این تقدیر (اندازه‌گیری) خدای عزیز و داناست» (ذلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ)**. و جن را از آتش، و پرندگان و جنبندگان خشکی و دریا و حشرات را از عفونت‌های زمین آفرید تا هوا برای ما از بخارات عفونت‌ها پاک شود؛ بخاراتی که اگر با هوایی که خداوند حیات و عافیت این انسان و حیوان را در آن به ودیعه نهاده، مخلوط می‌شد، بیمار و علیل می‌گشت. پس خداوند سبحان از روی لطف، با تکوین این موجودات عفونی، جو را برای او تصفیه کرد، در نتیجه بیماری‌ها و علت‌ها کاهش یافت.\n\n### [خلق انسان]\n\nو چون قلمرو (مملکت) استوار و آماده شد و هیچ یک از این مخلوقات ندانستند که این خلیفه‌ای که خداوند این قلمرو را برای وجود او آماده کرده، از چه جنسی خواهد بود، هنگامی که وقت معین در علم او برای ایجاد این خلیفه فرا رسید، پس از آنکه هفده هزار سال از عمر دنیا و هشت هزار سال از عمر آخرت که در دوامش پایانی نیست، گذشته بود، خداوند به برخی از فرشتگانش امر کرد که قبضه‌ای از تمام اجناس خاک زمین برای او بیاورند. پس فرشته آن را در خبری طولانی که نزد مردم معلوم است، آورد. خداوند سبحان آن را گرفت و با دو دست خود خمیر کرد، و این همان قول اوست: **«برای آنچه با دو دست خود آفریدم» (لِما خَلَقْتُ بِيَدَيَّ)**. و حق (الحق) نزد هر یک از فرشتگانی که ذکر کردیم، ودیعه‌ای برای آدم نهاده بود و به آن‌ها فرمود: **«من آفریننده بشری از گِل هستم» (إِنِّي خالِقٌ بَشَراً من طِينٍ)** و این ودیعه‌هایی که در دست شماست، برای اوست. پس چون او را آفریدم، هر یک از شما آنچه را که نزد خود دارید و به شما امانت سپرده‌ام، به او بازگردانید. سپس **«هنگامی که او را سامان دادم و از روح خود در او دمیدم، پس برای او سجده‌کنان بیفتید» (فَإِذا سَوَّيْتُهُ ونَفَخْتُ فِيهِ من رُوحِي فَقَعُوا لَهُ ساجِدِينَ)**. پس چون حق تعالی با دو دست خود گِل آدم را خمیر کرد تا بوی آن تغییر یافت، که همان گِل بدبو (المسنون) است، و آن جزء هوایی که در نشأت است، پشت او را محل اشقیا و سعدای ذریه‌اش قرار داد. پس آنچه در دو قبضه او بود، در آن به ودیعه نهاد. زیرا خداوند سبحان به ما خبر داد که در قبضه راست او سعادتمندان و در قبضه دیگر اشقیا هستند، و هر دو دست پروردگارم، دست راست مبارک است. و فرمود: اینان برای بهشت‌اند و به عمل اهل بهشت عمل می‌کنند، و اینان برای آتش‌اند و به عمل اهل آتش عمل می‌کنند. و همه را در گِل آدم به ودیعه نهاد و اضداد را به حکم مجاورت در او جمع کرد و او را بر حرکت مستقیم ایجاد کرد، و این در دولت سنبله (خوشه) بود. و او را دارای شش جهت قرار داد: بالا که سمت سر اوست، و پایین که مقابل آن است و سمت پاهای اوست، و راست که سمت قوی‌تر اوست، و چپ که مقابل آن است و سمت ضعیف‌تر اوست، و جلو که سمت صورت است، و مقابل آن پشت است که سمت قفاست. و او را صورت بخشید و تعدیل کرد و سامان داد. سپس از روح منسوب به خود در او دمید. پس با سریان این نفخ در اجزای او، ارکان اخلاط پدید آمد که عبارتند از صفرا، سودا، خون و بلغم. پس صفرا از رکن ناری بود که خداوند او را از آن ایجاد کرد، در قول متعال: **«از گِل خشکیده مانند سفال» (من صَلْصالٍ كَالْفَخَّارِ)**. و سودا از خاک بود، که همان قول اوست: **«او را از خاک آفرید» (خَلَقَهُ من تُرابٍ)**. و خون از هوا بود، که همان قول اوست: **«گِل بدبو» (مَسْنُونٍ)**. و بلغم از آبی بود که خاک با آن سرشته شد و گِل گردید. سپس در او قوه جاذبه را پدید آورد که حیوان با آن غذاها را جذب می‌کند، سپس قوه ماسکه (نگهدارنده) را که با آن آنچه را که حیوان تغذیه می‌کند، نگه می‌دارد، سپس قوه هاضمه را که با آن غذا هضم می‌شود، سپس قوه دافعه را که با آن فضولات را از خود دفع می‌کند، مانند عرق، بخار، بادها، مدفوع و امثال آن. اما سریان بخارات و تقسیم خون در رگ‌ها از کبد و آنچه هر جزء از حیوان خالص می‌کند، با قوه جاذبه است نه دافعه. پس سهم قوه دافعه فقط دفع فضولات است، همان‌طور که گفتیم. سپس در او قوه غاذیه (تغذیه کننده)، منمیه (رشد دهنده)، حاسیه (حس کننده)، خیالیه، وهمیه، حافظه و ذاکره را پدید آورد. این همه در انسان به اعتبار حیوان بودن اوست، نه فقط به اعتبار انسان بودن. جز اینکه این چهار قوه (قوه خیال، وهم، حفظ و ذکر) در انسان قوی‌تر از حیوان است. سپس آدم را که همان انسان است، به قوه مصوره (صورت‌بخش)، مفکره (اندیشنده) و عاقله اختصاص داد، پس از حیوان متمایز شد. و این قوای کلی را در این جسم، ابزارهایی برای نفس ناطقه قرار داد تا با آن به تمام منافع محسوس و معنوی خود دست یابد. سپس او را خلقی دیگر ایجاد کرد که همان انسانیت است. پس او را با این قوا، درک‌کننده، زنده، دانا، توانا، اراده‌کننده، سخنگو، شنوا و بینا قرار داد، بر اساس حدی معلوم و معتاد در کسب او. **«پس پربرکت است خدا، بهترین آفرینندگان» (فَتَبارَكَ الله أَحْسَنُ الْخالِقِينَ)**. سپس خداوند سبحان هیچ نامی از اسماء خود را بر خود ننهاد مگر اینکه برای انسان از تخلق به آن اسم، بهره‌ای قرار داد که به واسطه آن در عالم ظاهر شود، به اندازه‌ای که شایسته اوست. به همین دلیل، برخی قول پیامبر (صلی الله علیه و سلم) را که فرمود: «خداوند آدم را بر صورت خود آفرید»، بر این معنا تأویل کرده‌اند. و او را خلیفه خود در زمین نازل کرد، زیرا زمین برخلاف عالم بالا، از عالم تغییر و استحالات است. پس احکامی در آن‌ها پدید می‌آید بر حسب تغییری که در عالم زمینی رخ می‌دهد، و به همین دلیل حکم تمام اسماء الهی ظاهر می‌شود. از این رو، او خلیفه در زمین بود نه در آسمان و بهشت. سپس آنچه از امر او بود، از علم اسماء و سجده فرشتگان و سرپیچی ابلیس، ذکر همه آن‌ها در جای خود خواهد آمد، ان شاء الله.\n\n### [پیکرهای انسانی و انواع آن‌ها]\n\nهمانا این باب مخصوص آغاز پیکرهای انسانی است و آن‌ها چهار نوع هستند: پیکر آدم، پیکر حوا، پیکر عیسی و پیکرهای بنی‌آدم. و نشأت هر یک از این چهار پیکر، در سببیت با نشأت دیگری متفاوت است، با وجود اشتراک در صورت جسمانی و روحانی. و ما این مطلب را آوردیم و بر آن تأکید کردیم تا ضعیف‌العقل گمان نکند که قدرت الهی یا حقایق (حقائق) اجازه نمی‌دهد که این نشأت انسانی جز از یک سبب واحد باشد که به ذات خود این نشأت را ایجاد کند. پس خداوند این شبهه را با آشکار ساختن این نشأت انسانی در آدم به طریقی که پیکر حوا با آن ظاهر نشد، و آشکار ساختن پیکر حوا به طریقی که پیکر فرزند آدم ظاهر نشد، و آشکار ساختن پیکر اولاد آدم به طریقی که پیکر عیسی (علیه السلام) ظاهر نشد، دفع کرد. و نام انسان با حد و حقیقت بر هر یک از این‌ها اطلاق می‌شود، تا دانسته شود که **«همانا خداوند بر هر چیزی داناست» (أَنَّ الله بِكُلِّ شَيْءٍ عَلِيمٌ)** و **«همانا او بر هر چیزی تواناست» (أَنَّهُ عَلى‏ كُلِّ شَيْءٍ قَدِيرٌ)**. سپس خداوند این چهار نوع از خلق را در یک آیه از قرآن در سوره حجرات جمع کرده است، آنجا که می‌فرماید: **«ای مردم، ما شما را آفریدیم» (يا أَيُّهَا النَّاسُ إِنَّا خَلَقْناكُمْ)**، منظورش آدم است، **«از مرد» (من ذَكَرٍ)**، منظورش حوا است، **«و زن» (وأُنْثى‏)**، منظورش عیسی است، و از مجموع مرد و زن، منظورش بنی‌آدم از طریق نکاح و توالد است. پس این آیه از جوامع الکلم و فصل الخطاب است که به محمد (صلی الله علیه و سلم) داده شده است.\n\n### [پیکر آدم و پیکر حوا]\n\nو چون پیکر آدم همان‌طور که ذکر کردیم ظاهر شد و در او شهوت نکاح نبود، و در علم حق (الحق) سبقت گرفته بود که ایجاد توالد و تناسل و نکاح در این سرا تنها برای بقای نوع است، حوا را از دنده کوتاه آدم بیرون آورد. پس به همین دلیل از درجه مرد کوتاهی کرد، چنانکه خداوند متعال می‌فرماید: **«و مردان بر آنان درجه‌ای دارند» (ولِلرِّجالِ عَلَيْهِنَّ دَرَجَةٌ)**، پس هرگز به آن‌ها نمی‌رسد. و از دنده آفریده شد به خاطر انحنایی که در دنده‌هاست، تا با آن بر فرزند و همسرش مهربانی کند. پس مهربانی مرد بر زن، مهربانی او بر نفس خود است، زیرا زن جزئی از اوست. و مهربانی زن بر مرد به دلیل آن است که از دنده آفریده شده و دنده دارای انحنا و انعطاف است.\n\n### [محبت آدم و محبت حوا]\n\nو خداوند موضعی از آدم را که حوا از آن خارج شد، با شهوت به سوی او آباد کرد، زیرا در هستی (الوجود) خلأ باقی نمی‌ماند. پس چون آن را با هوا آباد کرد، آدم به سوی او مشتاق شد، اشتیاق به نفس خود، زیرا حوا جزئی از او بود. و حوا به سوی او مشتاق شد، به دلیل اینکه او موطن (جایگاه) او بود که در آن نشأت یافته بود. پس محبت حوا، محبت موطن است و محبت آدم، محبت نفس خود. به همین دلیل، محبت مرد به زن آشکار می‌شود، زیرا زن عین او بود. و به زن نیرویی داده شد که از آن به حیا در محبة الرجل تعبیر می‌شود، پس بر پنهان کردن قوی شد، زیرا موطن با او متحد نمی‌شود، آن‌گونه که آدم با او متحد شد. پس خداوند در آن دنده، تمام آنچه را که در پیکر آدم صورت بخشیده و آفریده بود، صورت داد. پس نشأت پیکر آدم در صورتش مانند نشأت کوزه‌گر در آنچه از گِل می‌سازد و می‌پزد بود، و نشأت پیکر حوا مانند نشأت نجار در آنچه از صورت‌ها در چوب می‌تراشد بود. پس چون او را در دنده تراشید و صورتش را برپا داشت و سامان داد و تعدیل کرد، از روح خود در او دمید، پس او زنده، ناطق و مؤنث برخاست تا او را محلی برای زراعت و کشت قرار دهد، برای وجود روییدن که همان تناسل است. پس آدم به او آرام گرفت و او به آدم آرام گرفت، و او لباسی برای آدم بود و آدم لباسی برای او بود. خداوند متعال می‌فرماید: **«آن‌ها لباس شما هستند و شما لباس آن‌ها هستید» (هُنَّ لِباسٌ لَكُمْ وأَنْتُمْ لِباسٌ لَهُنَّ)**. و شهوت از آدم در تمام اجزایش سریان یافت، پس او را طلب کرد.\n\n### [تکوین پیکر سوم]\n\nپس **«هنگامی که با او درآمیخت» (فَلَمَّا تَغَشَّاها)** و آب (نطفه) را در رحم افکند و خون حیض که خداوند بر زنان مقرر کرده، آن نطفه آب را احاطه کرد، در آن جسم، پیکر سومی تشکیل شد که بر خلاف نحوه تکوین پیکر آدم و پیکر حوا بود. این پیکر سوم است. پس خداوند تولد آن را در رحم، حال به حال، با انتقال از آب به نطفه، به علقه (خون بسته)، به مضغه (پاره گوشت)، به استخوان، و سپس پوشاندن استخوان با گوشت، بر عهده گرفت. پس چون نشأت حیوانی او را کامل کرد، او را خلقی دیگر ایجاد کرد و روح انسانی را در او دمید. **«پس پربرکت است خدا، بهترین آفرینندگان» (فَتَبارَكَ الله أَحْسَنُ الْخالِقِينَ)**. و اگر امر طولانی نمی‌شد، تکوین او را در رحم، حال به حال، و اینکه کدام فرشتگان موکل به ایجاد صورت‌ها در رحم‌ها تا هنگام خروج، متولی آن هستند، بیان می‌کردیم. اما هدف، آگاه ساختن بود که پیکرهای انسانی، اگرچه در حد و حقیقت و صورت‌های حسی و معنوی یکی هستند، اما اسباب تألیف آن‌ها متفاوت است، تا کسی گمان نکند که این امر به ذات سبب بازمی‌گردد، خداوند متعال برتر است. بلکه این امر به فاعل مختاری بازمی‌گردد که هر چه بخواهد و هر طور که بخواهد انجام می‌دهد، بدون هیچ محدودیتی و قصوری بر امری دون امر دیگر. **«هیچ معبودی جز او نیست، عزیز و حکیم» (لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ)**.\n\n### [تکوین پیکر عیسی]\n\nو چون اهل طبیعت گفتند که از آب زن چیزی تشکیل نمی‌شود و جنینی که در رحم است تنها از آب مرد است، به همین دلیل ما تکوین پیکر عیسی را تکوینی دیگر قرار دادیم. اگرچه تدبیر او در رحم، تدبیر پیکرهای پسران بود، اما اگر از آب زن بود، هنگامی که روح (جبرئیل) به صورت **«بشری کامل» (بَشَراً سَوِيًّا)** برای او متمثل شد، یا از نفخ بدون آب بود، در هر صورت، او پیکر چهارمی است که در نشأت با سایر پیکرهای نوع متفاوت است. و به همین دلیل خداوند متعال فرمود: **«همانا مَثَل عیسی» (إِنَّ مَثَلَ عِيسى‏)**، یعنی صفت نشأت عیسی، **«نزد خدا مانند آدم است که او را از خاک آفرید» (عِنْدَ الله كَمَثَلِ آدَمَ خَلَقَهُ من تُرابٍ)**. ضمیر (او را) به آدم بازمی‌گردد. و شباهت در خلق او بدون پدر رخ داد. یعنی صفت نشأت او، صفت نشأت آدم است، جز اینکه آدم را از خاک آفرید، **«سپس به او گفت: باش» (ثُمَّ قالَ لَهُ كُنْ)**. سپس عیسی، بنا بر آنچه گفته شده، به اندازه لبث (ماندن) معمول پسران در شکم مریم نماند، زیرا تکوین به سوی او شتاب گرفت، چون خداوند اراده کرد او را آیتی قرار دهد و با آن بر طبیعیون رد کند، زیرا آن‌ها بر طبیعت حکم کردند بر اساس آنچه عادت به آن‌ها داده بود، نه بر اساس آنچه طبیعت اقتضا می‌کند از اسرار و تکوینات شگفت‌انگیزی که خداوند در آن به ودیعه نهاده است. و برخی از حاذقان این فن، انصاف طبیعت را دادند و گفتند: ما از آن جز آنچه به ما داده، نمی‌دانیم و در آن چیزهایی است که نمی‌دانیم.\n\n### [انسان در زمین نظیر عقل در آسمان]\n\nپس ما آغاز پیکرهای انسانی را ذکر کردیم و اینکه آن‌ها چهار پیکر با نشأت‌های متفاوت هستند، همان‌طور که مقرر کردیم. و اینکه او (انسان) آخرین مولودات است، پس نظیر عقل اول است و به آن مرتبط شد، زیرا هستی (الوجود) یک دایره است. و آغاز دایره، وجود عقل اول بود که در خبر آمده است: «اولین چیزی که خداوند آفرید، عقل بود». پس عقل اولین اجناس بود و خلق به جنس انسانی ختم شد، پس دایره کامل شد و انسان به عقل متصل شد، همان‌گونه که آخر دایره به اول آن متصل می‌شود. پس یک دایره بود، و آنچه میان دو طرف دایره است، تمام مخلوقات خداوند از اجناس عالم است، میان عقل اول که همان قلم نیز هست و میان انسان که موجود آخر است. و چون خطوطی که از نقطه‌ای در وسط دایره به سوی محیطی که از آن پدید آمده، خارج می‌شوند، برای هر جزء از محیط به تساوی خارج می‌شوند، همچنین نسبت حق تعالی به تمام موجودات، نسبتی واحد است و هرگز تغییری در آن رخ نمی‌دهد. همه اشیاء به او می‌نگرند و آنچه را که به آن‌ها می‌بخشد، می‌پذیرند، همان‌گونه که اجزای محیط به نقطه می‌نگرند. و خداوند سبحان این صورت انسانی را با حرکت مستقیم، به صورت ستونی که برای خیمه است، برپا داشت. پس او را برای گنبد این آسمان‌ها قرار داد. پس خداوند سبحان به سبب او، آسمان‌ها را نگه می‌دارد که زایل نشوند، از این رو از او به ستون تعبیر کردیم. پس هنگامی که این صورت فانی شود و هیچ نفس‌کشنده‌ای بر روی زمین باقی نماند، **«و آسمان شکافته شود، پس در آن روز سست و بی‌بنیاد است» (وانْشَقَّتِ السَّماءُ فَهِيَ يَوْمَئِذٍ واهِيَةٌ)**، زیرا ستون که همان انسان است، از بین رفته است. و چون آبادانی با انتقال انسان به سرای آخرت منتقل شد و دنیا با انتقال او از آن ویران گشت، قطعاً دانستیم که انسان همان عین مقصود خداوند از عالم است و او حقیقتاً خلیفه است و محل ظهور اسماء الهی است. و او جامع حقایق تمام عالم است، از فرشته و فلک و روح و جسم و طبیعت و جماد و نبات و حیوان، تا آنچه به آن اختصاص یافته از علم اسماء الهی، با وجود کوچکی حجم و جرمش. و اینکه خداوند درباره آن فرمود: **«همانا آفرینش آسمان‌ها و زمین بزرگ‌تر از آفرینش مردم است» (خَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ)**، به دلیل آن است که انسان از آسمان و زمین متولد شده است، پس آن‌ها برای او مانند پدر و مادر هستند، و خداوند مقدار آن‌ها را بالا برد. **«ولیکن بیشتر مردم نمی‌دانند» (ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ)**. پس منظور بزرگی در جرم نیست، زیرا آن به حس معلوم است.\n\n### [بلای بزرگ‌تر انسان]\n\nجز اینکه خداوند متعال او را به بلایی مبتلا کرد که هیچ یک از مخلوقاتش را به آن مبتلا نکرده بود، یا برای اینکه او را سعادتمند کند یا شقاوتمند، بر حسب آنچه او را به استفاده از آن توفیق دهد. و بلایی که او را به آن مبتلا کرد، این بود که در او نیرویی به نام فکر آفرید و این نیرو را خادم نیروی دیگری به نام عقل قرار داد. و عقل را با وجود سیادتش بر فکر، مجبور کرد که آنچه را که فکر به او می‌دهد، بپذیرد. و برای فکر مجالی قرار نداد مگر در قوه خیالیه. و خداوند سبحان قوه خیالیه را محلی جامع برای آنچه قوه حاسه به آن می‌دهد، قرار داد و برای آن نیرویی به نام مصوره (صورت‌بخش) قرار داد. پس در قوه خیالیه جز آنچه حس به آن داده یا قوه مصوره به آن داده، حاصل نمی‌شود. و ماده مصوره از محسوسات است. پس صورت‌هایی را ترکیب می‌کند که عین آن‌ها موجود نیست، اما اجزای آن‌ها همگی به حس موجودند. و این بدان دلیل است که عقل ساده (ساذج) آفریده شد و هیچ چیز از علوم نظری نزد او نبود. و به فکر گفته شد که میان حق و باطلی که در این قوه خیالیه است، تمییز دهد. پس بر حسب آنچه برایش رخ می‌دهد، می‌نگرد. گاهی در شبهه می‌افتد و گاهی در دلیل، بدون آنکه خود به آن علم داشته باشد، اما در گمان خود عالم به صورت‌های شبهه از ادله است و اینکه به علم دست یافته است. و به قصور موادی که در کسب علوم به آن‌ها استناد کرده، توجه نمی‌کند. پس عقل آن را از او می‌پذیرد و با آن حکم می‌کند، در نتیجه جهل او از علمش بیشتر می‌شود، به طوری که قابل مقایسه نیست. سپس خداوند این عقل را مکلف به معرفت خود سبحان کرد تا در آن به او رجوع کند نه به غیر او. اما عقل، نقیض آنچه را که حق (الحق) با قول متعال **«آیا تفکر نمی‌کنند؟ برای قومی که تفکر می‌کنند» (أَ ولَمْ يَتَفَكَّرُوا لِقَوْمٍ يَتَفَكَّرُونَ)** اراده کرده بود، فهمید. پس به فکر استناد کرد و آن را امامی قرار داد که از او پیروی شود، و از مراد حق در تفکر غافل شد. مراد این بود که او را مخاطب قرار داد تا تفکر کند و ببیند که راهی به علم به خدا نیست مگر با تعریف خدا، تا امر را بر همان‌گونه که هست برای او کشف کند. اما هر عقلی این فهم را درک نکرد، مگر عقولی که خداوند از انبیا و اولیای خود اختصاص داده است. ای کاش می‌دانستم، آیا با افکارشان **«آری گفتند» (قالُوا بَلى‏)** هنگامی که خداوند آن‌ها را بر نفس‌هایشان در قبضه ذریه از پشت آدم گواه گرفت؟ نه، به خدا سوگند، بلکه عنایت گواه گرفتن او، هنگام گرفتن آن‌ها از پشت‌هایشان بود. و چون برای معرفت خدا به گرفتن از قوای مفکره خود بازگشتند، هرگز بر یک حکم واحد در معرفت خدا جمع نشدند و هر طایفه‌ای به مذهبی رفت و سخن در ساحت الهی که حریم ممنوعه است، زیاد شد و نهایت جسارت را بر خدا روا داشتند. و این همه از بلایی است که ذکر کردیم، یعنی خلق فکر در انسان. اما اهل الله در آنچه خداوند آن‌ها را به ایمان به او در معرفتش مکلف کرد، به سوی او فقر (نیاز) بردند و دانستند که مراد از آن‌ها، رجوع به او در آن و در هر حالی است. پس برخی از آن‌ها می‌گویند: «منزه است کسی که راهی به معرفت خود قرار نداد مگر عجز از معرفت او». و برخی گفتند: «عجز از درک، خود درک است». و پیامبر (صلی الله علیه و سلم) فرمود: **«من نمی‌توانم ثنای تو را بشمارم» (لا أحصي ثناء عليك)**. و خداوند متعال می‌فرماید: **«و به او احاطه علمی ندارند» (ولا يُحِيطُونَ به عِلْماً)**. پس آن‌ها در معرفت به سوی خدا بازگشتند و فکر را در مرتبه خود رها کردند و حق آن را ادا نمودند و آن را به جایی که شایسته تفکر نیست، منتقل نکردند. و نهی از تفکر در ذات خدا وارد شده است. و خداوند می‌فرماید: **«و خداوند شما را از (نافرمانی) خود برحذر می‌دارد» (ويُحَذِّرُكُمُ الله نَفْسَهُ)**. پس خداوند از معرفت خود آنچه را که به آن‌ها بخشید، عطا کرد و از مخلوقات و مظاهر خود آنچه را که به آن‌ها شهود داد، نشان داد. پس دانستند که آنچه از طریق فکر محال عقلی است، نسبت الهی محال نیست، چنانکه بخشی از آن را در باب زمین مخلوق از باقیمانده گِل آدم و غیر آن خواهیم آورد. پس آنچه شایسته عاقل است که در نفس خود به آن متدین شود، این است که بداند **«همانا خداوند بر هر چیزی تواناست» (إِنَّ الله عَلى‏ كُلِّ شَيْءٍ قَدِيرٌ)**، چه ممکن و چه محال. و هیچ محالی نیست که نفوذ اقتدار او را محدود کند و عطای او گسترده است. برای ایجاد او تکراری نیست، بلکه امثالی هستند که در جوهری که او ایجاد کرده و بقای آن را خواسته، پدید می‌آیند، و اگر می‌خواست، آن را با هر نفسی فانی می‌کرد. **«هیچ معبودی جز او نیست، عزیز و حکیم» (لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ)**."
  },
  "page_count": 6
}