{
  "id": 420,
  "title": {
    "ar": "الباب الموفي عشرين وأربعمائة في معرفة منازلة التخلص من المقامات",
    "en": "Chapter Four Hundred and Twentieth: Concerning the Knowledge of the Stages of Disengagement from the Spiritual Stations (المقامات).",
    "ur": "باب نمبر چار سو بیس: مقامات (المقامات) سے خلاصی (التخلص) کی منازل (منازلة) کی معرفت میں۔",
    "fa": "باب چهارصد و بیستم در معرفت منازل رهایی (تخلص) از مقامات"
  },
  "content": {
    "ar": "## «الباب الموفي عشرين وأربعمائة في معرفة منازلة التخلص من المقامات»\n\n\n> ما في الوجود سواه فانظروه كما *** نظرته تجدوا في هو الذي ما هو\n\n\n> ومن يدل عليه فهو ذو جدل *** في قلبه منه أمثال وأشباه‏\n\n\n> لولاه ما نظرت عين بناظرها *** لولاه ما نطقت بالذكر أفواه‏\n\n\n> فاحكم عليه به وأنت في عدم *** واثبت عليه فما في الكون إلا هو\n\n\n> والله لو لا وجود الحق ما قبلت *** أقواله في وجود الكون لولاه‏\n\n\n### [معرفة العارفين به تعالى ليس من رؤية الآيات الخارجة والداخلة]\n\n\nقال الله تعالى يا أَهْلَ يَثْرِبَ لا مُقامَ لَكُمْ فَارْجِعُوا والجامع للمقامات ما له مقام يقتضيه‏\n\n\nمن عرف نفسه عرف ربه‏\n\n\nوقوله سَنُرِيهِمْ آياتِنا في الْآفاقِ يعني الدالة عليها في الآفاق وفي أَنْفُسِهِمْ وهي مقيدة فلا بد أن يقيد مدلولها وإن دلت على إطلاقه فكونه مطلقا تقييد لأن التقييد تمييز فمعرفة العارفين به تعالى ليس من رؤية الآيات الخارجة والداخلة فإنها تدل على مقيد في إطلاق أو إطلاق في مقيد والعارفون يرونه عين كل شي‏ء المخلوق قال لمن أساء في حقه فقطع رحمه لا تَثْرِيبَ عَلَيْكُمُ فالحق أولى بهذه الصفة لمن أساء في حقه بقطع رحمه فإنا لا نشك أن قاطع الرحم ما قطعها إلا بجهله وما انقطعت الرحم فالرحم موصولة في نفس الأمر فهي موصولة عند العالم فمن جانبه موصولة ومن جانب الجاهل بها مقطوعة ولما رجع الأمر كله لله مما وقعت فيه الدعاوي الكاذبة لم يدل رجوعها إلى الله تعالى على أمر لم يكن عليه الله بل هويته هي هي في حال الدعاوي في المشاركة وفي حال رجوع الأمر إليه والمقام ليس إلا للتمييز وما ثم إلا واحد فعمن يتميز فلا مقام بل هوية أحدية فيها صور مختلفة فزيد أحدي العين لو لم يكن في الوجود إلا هو لم يتميز عن شي‏ء لأنه ما ثم‏\nإلا هو ولم يتميز عنه شي‏ء لأنك ما فرضت موجود إلا هو خاصة ولا مقام له يتميز به عن غيره إذ لا غير هناك فإن يده متميزة عن رجله ورأسه متميز عن صدره وأذنه عن عينه وكل جارحة متميزة عن غيرها من الجوارح وكل قوة منه في باطنه لها حكم ليس للأخرى ومحل ليس للآخر فتميزت الصور في عين واحدة لا تميز فيها ولا مقام لها فنحن له كالأعضاء للواحد منا والقوي فما ثم عمن نتميز ولا يتميز عنا ولكن تميزنا بعضنا عن بعض كما قررنا ولا تنسب الأحكام والمقامات لأعضائنا وإنما ينسب ذلك كله إلينا فيقال بطش فلان بفلان ومشى فلان إلى فلان وسمع فلان كلام فلان ورأى فلان فلانا ما ينسب شي‏ء من هذا كله إلى آلة ولا إلى قوة ولا إلى عضو ف إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ ف لَهُ الْحُكْمُ وإِلَيْهِ تُرْجَعُونَ‏\n\n\n### [أنه لا مخلص من المقامات إلا وارث محمد صَلَّى اللهُ عَليهِ وسَلَّم الذي آتاه الله جوامع الكلم‏]\n\n\nفاعلم أنه لا يخلص من المقامات إلا وارث محمد صَلَّى اللهُ عَليهِ وسَلَّم الذي آتاه الله جوامع الكلم وعلم الأسماء كلها وعلم الأولين والآخرين فكل الصيد في جوف الفرا فما ثم عمن نتميز فإن العالم كله في وارث محمد صَلَّى اللهُ عَليهِ وسَلَّم كما هو في محمد صَلَّى اللهُ عَليهِ وسَلَّم فقد خلص من حكم المقامات عليه فهو يحكم بها بحسب ما تعطيه الأحوال فإنه العليم الحكيم فالأسماء الإلهية كلها هي تظهر المقامات وبها يحكم الحاكم ولا حاكم إلا الله وما يبدل القول لديه فالقول له الحكم فبالقول يحكم الحق فتنبه لمن هو المحكوم عليه والمحكوم به والمحكوم فيه والحاكم تعرف من هو المخلص من المقامات والذي لا مقام له وأما المقام المحمود وهو المقام المثنى عليه الذي أثنى عليه الله الذي يقيم الحق فيه سبحانه محمدا صَلَّى اللهُ عَليهِ وسَلَّم فهو مقام شفاعة رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الشافعين أن يشفعوا يوم القيامة من ملك ورسول ونبي وولي ومؤمن وأن يخرج الحق من النار أو يدخل الجنة من لم يعمل خيرا قط حتى لا يبقى في النار إلا أهلها الذين هم أهلها فيبقيهم الله فيها على صفة ومزاج لو أخرجهم الله بذلك المزاج إلى الجنة لتعذبوا وأضر بهم دخولها كما تضر رياح الورد بالجعل فيجيبه الله لما سأل فيه وإذا زاد سبب ظهور أمر على واحد فهو شفاعة سواء كان شفعا أو وترا لا بد أن يكون زائدا على واحد وأما الأحوال فلا سبيل إلى التخلص منها وهي فينا موهوبة وهي للحق ذاتية\n\n\n> فالحكم للحال والأحوال حاكمة *** وليس في الكون إلا الله والبشر\n\n\n> ونحن في عبرة لو كنت تعقلها *** فكل شي‏ء سوى الرحمن يعتبر\n\n\n> نحن النجوم التي في الغرب موقعها *** وليس يظهر إلا الشمس والقمر\n\n\n> الطمس فينا وذاك الطمس ينفعنا *** وليس يدريه إلا من له نظر\n\n\n> فلا تخف فسوى الرحمن ليس له *** عين وليس له التحكيم والأثر\n\n\n> إليه يرجع أمر الخلق كلهم *** حتى القضاء وحتى الحكم والقدر\n\n\n> وهو الوجود الذي ما عنده ضرر *** والشر ليس له في خلقه أثر\n\n\n> فالشر ليس إليه جل خالقنا *** عنه بذا جاء عن إرساله الخبر\n\n\nمن عرف الضلالة والهدى لم يطل عليه المدى وعلم إن الله لا يترك خلقه سدى كما لم يتركه ابتداء وإن لم ينزله منازل السعداء فإن الله برحمته التي وَسِعَتْ كُلَّ شَيْ‏ءٍ لا يسرمد عليه الرداء وكيف يسرمده وهو عين الرداء فهو في مقام الفداء وإشارة سهام العداء فله الرحمة آخرا خالدا مخلدا فيها أبدا والله تعالى يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 420: Concerning the Knowledge of the Station of Transcending the Spiritual Stations (المقامات)\n\nThere is nothing in Existence (الوجود) but Him, so look upon Him as\nI have looked upon Him, and you will find in Him that which is not what He is.\nAnd whoever points to Him is one who argues,\nFor in his heart are similitudes and likenesses of Him.\nWere it not for Him, no eye would look with its sight,\nWere it not for Him, no mouth would speak the remembrance (الذكر).\nSo judge Him by Him while you are in non-existence (عدم),\nAnd remain firm upon Him, for there is nothing in the Cosmos but Him.\nBy God, were it not for the Being (وجود) of the Real (الحق), His sayings regarding the existence of the Cosmos would not have been accepted, were it not for Him.\n\n### The Gnosis (معرفة) of those who know the Exalted Reality is not derived from seeing external and internal signs.\n\nAllah the Exalted said: <<O people of Yathrib, there is no station (مقام) for you, so return!>> (Q 33:13). And the one who encompasses all stations (المقامات) has no station that defines him.\n\nHe who knows himself knows his Lord.\n\nAnd His saying: <<We will show them Our signs in the horizons (الآفاق) and within themselves (أنفسهم)>> (Q 41:53), meaning those signs that point to Him in the horizons and within themselves. These signs are restricted (مقيدة), so their indication must necessarily be restricted, even if they point to His absolute nature (إطلاق). For His being absolute is a restriction, because restriction is differentiation (تمييز). Therefore, the Gnosis (معرفة) of those who know the Exalted Reality is not derived from seeing external and internal signs, for these signs point to a restricted thing within the absolute, or the absolute within a restricted thing. But the Gnostics (العارفون) see Him as the very Essence (عين) of everything.\n\nThe created being said to the one who wronged him by cutting ties of kinship (رحم): <<There shall be no reproach upon you this day.>> (Q 12:92). The Real (الحق) is more deserving of this Attribute toward one who wrongs Him by cutting ties of kinship. For we do not doubt that the one who cuts ties only cuts them due to his ignorance. Yet the tie (الرحم) itself is not cut, for the tie is connected in reality (في نفس الأمر). It is connected in the view of the knower (العالم); from his side, it is connected, but from the side of the ignorant person, it is cut.\n\nAnd when the whole affair returns to Allah (إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ) from the false claims that occurred, this return does not indicate a state that Allah was not already upon. Rather, His Ipseity (هوية) is the same, whether in the state of claims of partnership or in the state of the return of the affair to Him.\n\nThe station (مقام) exists only for differentiation (تمييز). But there is only One (واحد), so from whom would He be differentiated? Thus, there is no station. Rather, there is an absolute Oneness (هوية أحدية) containing diverse forms. Zayd, for example, is singular in essence (أحدي العين). If nothing existed but him, he would not be differentiated from anything, because there would be nothing but him. And nothing would be differentiated from him, because you have only posited him specifically as existing. He would have no station by which he is differentiated from another, since there is no other there.\n\nYet his hand is differentiated from his leg, and his head is differentiated from his chest, and his ear from his eye. Every limb (جارحة) is differentiated from the other limbs, and every inner faculty (قوة) has a ruling (حكم) that the other does not have, and a locus (محل) that the other does not have. Thus, the forms are differentiated within a single Essence (عين واحدة) which itself has no differentiation and no station (مقام).\n\nWe are to Him like the limbs and faculties are to one of us. Thus, there is no one from whom we are differentiated, nor is there anyone differentiated from us. However, we are differentiated from one another, as we have established. The rulings (الأحكام) and stations (المقامات) are not attributed to our limbs. Rather, all of that is attributed to us. It is said: \"So-and-so struck so-and-so,\" \"So-and-so walked to so-and-so,\" \"So-and-so heard the speech of so-and-so,\" and \"So-and-so saw so-and-so.\" None of this is attributed to an instrument, a faculty, or a limb. Thus, <<To Him is referred the whole affair (الأمر كله)>> (Q 11:123), so <<To Him belongs the Judgment (الحكم)>> (Q 28:88), and <<To Him you shall be returned.>> (Q 11:123).\n\n### That none is delivered from the Spiritual Stations (المقامات) except the inheritor of Muhammad (PBUH), whom Allah granted the comprehensive words (جوامع الكلم).\n\nKnow, therefore, that none is delivered from the spiritual stations (المقامات) except the inheritor of Muhammad (PBUH), whom Allah granted the comprehensive words (جوامع الكلم), taught all the Names (الأسماء), and gave the knowledge (العلم) of the first and the last. For all the game is within the belly of the wild ass. Thus, there is no one from whom we are differentiated, for the entire World (العالم) is contained within the inheritor of Muhammad (PBUH), just as it is contained within Muhammad (PBUH). He is therefore delivered from the ruling of the stations upon him. Rather, he rules by them according to what the spiritual states (الأحوال) grant, for he is the All-Knowing (العليم), the Wise (الحكيم).\n\nAll the Divine Names (الأسماء الإلهية) are what manifest the stations, and by them the ruler judges—and there is no ruler but Allah. <<And the Word (القول) is not changed with Me.>> (Q 50:29). The Word belongs to the Judgment (الحكم). By the Word, the Real (الحق) judges. Pay attention to who is the one judged (المحكوم عليه), the means by which judgment is made (المحكوم به), the locus in which judgment is made (المحكوم فيه), and the Judge (الحاكم), and you will know who is delivered from the stations and who has no station.\n\nAs for the Praised Station (المقام المحمود)—the lauded station upon which Allah bestowed praise, and in which the Exalted Real establishes Muhammad (PBUH)—it is the station of the intercession (شفاعة) of the Messenger of Allah (PBUH) for the intercessors: that they may intercede on the Day of Resurrection, whether they be angels, messengers, prophets, saints (ولي), or believers. [It is also the station] that the Real brings out of the Fire, or admits into Paradise, those who have never done any good whatsoever, until none remain in the Fire except its people who belong there. Allah will keep them therein upon a quality and temperament (مزاج) such that if Allah were to bring them out with that temperament into Paradise, they would be tormented, and entering it would harm them, just as the scent of roses harms the dung beetle. Allah answers him concerning what he requested. And if the cause of the manifestation of an affair increases beyond one, it is intercession (شفاعة), whether it is an even number (شفع) or an odd number (وتر), provided it must be greater than one.\n\nAs for the spiritual states (الأحوال), there is no way to transcend them (التخلص منها). They are bestowed upon us as gifts, but they are intrinsic (ذاتية) to the Real (الحق).\n\nThe Judgment (الحكم) belongs to the State (الحال), and the States are the rulers,\nAnd there is nothing in the Cosmos but Allah and humanity (البشر).\nWe are in a lesson (عبرة), if you could but understand it,\nFor everything other than the All-Merciful (الرحمن) is considered.\nWe are the stars whose setting place is in the West,\nAnd nothing appears but the Sun and the Moon.\nEffacement (الطمس) is in us, and that effacement benefits us,\nAnd none perceives it save he who possesses insight (نظر).\nSo do not fear, for nothing other than the All-Merciful\nHas an essence (عين), nor does it possess authority (التحكيم) or effect (الأثر).\nTo Him returns the affair of all Creation (الخلق),\nEven the Divine Decree (القضاء), the Judgment (الحكم), and Destiny (القدر).\nHe is the Existence (الوجود) from whom no harm proceeds,\nAnd evil has no effect in His creation.\nFor evil is not attributed to Him—Exalted is our Creator—\nThe report concerning His sending [messengers] came with this [truth].\n\nWhoever knows error (الضلالة) and guidance (الهدى) will not find the span of time long, and knows that Allah does not leave His creation neglected (سدى), just as He did not leave it neglected in the beginning, even if He does not place it in the stations of the fortunate (السعداء). For Allah, by His Mercy (رحمته) which <<encompasses all things>> (Q 7:156), will not make the covering (الرداء) eternal upon him. And how could He make it eternal when He is the very Essence (عين) of the covering? Thus, he is in the station of ransom (الفداء) and the target of the arrows of enmity. So, Mercy belongs to him eternally in the end, abiding therein forever. And Allah the Exalted <<speaks the Truth (الحق), and He guides to the way.>> (Q 33:4).",
    "ur": "باب نمبر چار سو بیس: مقامات (المقامات) سے خلاصی (التخلص) کی منزلوں کی معرفت میں۔\n\nہستی (الوجود) میں اس کے سوا کچھ نہیں، پس اسے ویسا ہی دیکھو جیسا میں نے دیکھا ہے، تم اس میں وہی پاؤ گے جو وہ نہیں ہے۔\n\nاور جو اس کی طرف رہنمائی کرتا ہے، وہ جھگڑالو ہے، اس کے دل میں اس کی مثالیں اور مشابہتیں ہیں۔\n\nاگر وہ نہ ہوتا تو کوئی آنکھ اپنے دیکھنے والے کے ساتھ نہ دیکھتی، اگر وہ نہ ہوتا تو کوئی منہ ذکر کے ساتھ نہ بولتا۔\n\nپس تم عدم میں ہوتے ہوئے بھی اس کے ذریعے اس پر حکم لگاؤ، اور اس پر ثابت قدم رہو، کیونکہ کائنات میں اس کے سوا کوئی نہیں ہے۔\n\nاور اللہ کی قسم! اگر ذات حق (الحق) کی ہستی (الوجود) نہ ہوتی تو کائنات کی ہستی (الوجود) کے بارے میں اس کے اقوال قبول نہ کیے جاتے۔\n\n### [اللہ تعالیٰ کی معرفت رکھنے والے عارفین کی معرفت خارجی اور داخلی آیات کو دیکھنے سے حاصل نہیں ہوتی]\n\nاللہ تعالیٰ نے فرمایا: **\"اے یثرب والو! تمہارے لیے ٹھہرنے کی جگہ نہیں ہے، پس لوٹ جاؤ۔\"** (سورۃ الاحزاب: ۱۳) اور مقامات (المقامات) کو جمع کرنے والے کے لیے کوئی ایسا مقام نہیں ہوتا جو اسے لازم کرے۔\n\nجس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا۔\n\nاور اس کا فرمان: **\"ہم انہیں اپنی نشانیاں آفاق میں دکھائیں گے\"** (سورۃ فصلت: ۵۳) یعنی وہ نشانیاں جو آفاق میں اس پر دلالت کرتی ہیں، **\"اور ان کے اپنے نفوس میں بھی\"** (سورۃ فصلت: ۵۳) اور یہ نشانیاں مقید ہیں، لہٰذا ان کے مدلول کو بھی مقید ہونا ضروری ہے، اگرچہ وہ اس کے اطلاق پر دلالت کریں۔ پس اس کا مطلق ہونا بھی ایک تقیید ہے، کیونکہ تقیید تمیز (امتیاز) ہے۔ لہٰذا اللہ تعالیٰ کی معرفت رکھنے والے عارفین کی معرفت خارجی اور داخلی آیات کو دیکھنے سے حاصل نہیں ہوتی، کیونکہ یہ نشانیاں اطلاق میں مقید پر یا مقید میں اطلاق پر دلالت کرتی ہیں، جبکہ عارفین اسے ہر شے کی عین (حقیقت) دیکھتے ہیں۔\n\nمخلوق نے اس شخص سے کہا جس نے اس کے حق میں برا کیا اور اس کا رشتہ کاٹا: **\"آج تم پر کوئی ملامت نہیں ہے۔\"** (سورۃ یوسف: ۹۲) پس ذات حق (الحق) اس صفت کی زیادہ حقدار ہے اس شخص کے لیے جس نے اس کے حق میں رشتہ کاٹ کر برا کیا۔ کیونکہ ہمیں کوئی شک نہیں کہ رشتہ کاٹنے والے نے اسے اپنی جہالت کے سوا کسی اور وجہ سے نہیں کاٹا، حالانکہ رحم (رشتہ) منقطع نہیں ہوا ہے۔ پس رحم (رشتہ) نفسِ امر میں جڑا ہوا ہے، لہٰذا وہ عالم (جاننے والے) کے نزدیک جڑا ہوا ہے، پس اس کی طرف سے جڑا ہوا ہے اور اس سے جاہل کی طرف سے کٹا ہوا ہے۔\n\nاور جب تمام معاملہ اللہ کی طرف لوٹ گیا ان جھوٹے دعووں کی وجہ سے جو کیے گئے تھے، تو اس کا اللہ تعالیٰ کی طرف لوٹنا کسی ایسے امر پر دلالت نہیں کرتا جس پر اللہ پہلے سے نہ تھا، بلکہ اس کی ہویت (ذات) وہی ہے جو شرکت کے دعووں کی حالت میں تھی اور وہی اس وقت ہے جب معاملہ اس کی طرف لوٹتا ہے۔ اور مقام (المقام) صرف تمیز (امتیاز) کے لیے ہوتا ہے، اور وہاں ایک کے سوا کچھ نہیں، تو پھر کس سے تمیز حاصل کی جائے؟ لہٰذا کوئی مقام نہیں، بلکہ وہ ایک احدی ہویت (ذات) ہے جس میں مختلف صورتیں ہیں۔ پس زید جو کہ عینِ احدی ہے، اگر ہستی (الوجود) میں اس کے سوا کوئی نہ ہوتا تو وہ کسی شے سے ممتاز نہ ہوتا، کیونکہ وہاں اس کے سوا کوئی نہیں ہے، اور کوئی شے اس سے ممتاز نہ ہوتی، کیونکہ تم نے صرف اسی کو موجود فرض کیا ہے، اور اس کے لیے کوئی مقام نہیں ہے جس سے وہ غیر سے ممتاز ہو، کیونکہ وہاں کوئی غیر موجود ہی نہیں ہے۔\n\nبے شک اس کا ہاتھ اس کے پاؤں سے ممتاز ہے، اور اس کا سر اس کے سینے سے ممتاز ہے، اور اس کا کان اس کی آنکھ سے، اور ہر عضو دوسرے اعضاء سے ممتاز ہے، اور اس کے باطن میں ہر قوت کا ایک حکم ہے جو دوسری کے لیے نہیں ہے، اور ایک محل ہے جو دوسرے کے لیے نہیں ہے۔ پس صورتیں ایک ہی عین (حقیقت) میں ممتاز ہو گئیں، جس میں نہ کوئی تمیز ہے اور نہ کوئی مقام۔ پس ہم اس کے لیے ایسے ہیں جیسے ہم میں سے ایک کے اعضاء اور قوتیں ہیں۔ لہٰذا وہاں کوئی نہیں جس سے ہم ممتاز ہوں یا جو ہم سے ممتاز ہو، لیکن ہم نے ایک دوسرے سے تمیز حاصل کی جیسا کہ ہم نے بیان کیا۔ اور احکام اور مقامات (المقامات) ہمارے اعضاء کی طرف منسوب نہیں کیے جاتے، بلکہ یہ سب ہماری طرف منسوب کیے جاتے ہیں۔ پس کہا جاتا ہے کہ فلاں نے فلاں کو پکڑا، اور فلاں فلاں کی طرف چلا، اور فلاں نے فلاں کی بات سنی، اور فلاں نے فلاں کو دیکھا۔ ان میں سے کوئی بھی چیز کسی آلہ، کسی قوت یا کسی عضو کی طرف منسوب نہیں کی جاتی۔ پس **\"اسی کی طرف تمام معاملات لوٹائے جاتے ہیں\"** (سورۃ ہود: ۱۲۳)، پس **\"اسی کا حکم ہے\"** (سورۃ القصص: ۸۸) اور **\"تم اسی کی طرف لوٹائے جاؤ گے\"** (سورۃ البقرۃ: ۲۸).\n\n### [یہ کہ مقامات (المقامات) سے کوئی خلاصی نہیں پاتا مگر محمد صلی اللہ علیہ وسلم کا وارث جسے اللہ نے جوامع الکلم عطا فرمائے]\n\nپس جان لو کہ مقامات (المقامات) سے کوئی خلاصی نہیں پاتا مگر محمد صلی اللہ علیہ وسلم کا وارث، جسے اللہ نے جوامع الکلم (جامع کلمات) عطا فرمائے، اور تمام اسماء کا علم دیا، اور اولین و آخرین کا علم دیا۔ پس \"تمام شکار خرگوش کے پیٹ میں ہے\" (یعنی سب کچھ اسی میں شامل ہے)۔ لہٰذا وہاں کوئی نہیں جس سے ہم ممتاز ہوں، کیونکہ سارا عالم محمد صلی اللہ علیہ وسلم کے وارث میں موجود ہے، جیسا کہ وہ محمد صلی اللہ علیہ وسلم میں موجود ہے۔ پس وہ مقامات (المقامات) کے حکم سے آزاد ہو چکا ہے، لہٰذا وہ ان کے ذریعے حکم لگاتا ہے جیسا کہ احوال (الأحوال) اسے عطا کرتے ہیں۔ بے شک وہ علیم (جاننے والا) اور حکیم (حکمت والا) ہے۔\n\nپس تمام اسماء الٰہیہ ہی مقامات (المقامات) کو ظاہر کرتی ہیں، اور ان کے ذریعے حاکم حکم لگاتا ہے، اور اللہ کے سوا کوئی حاکم نہیں۔ اور اس کے ہاں بات بدلی نہیں جاتی، پس قول ہی حکم ہے۔ پس ذات حق (الحق) قول کے ذریعے حکم لگاتی ہے۔ پس اس شخص پر توجہ دو جو محکوم علیہ ہے، اور جو محکوم بہ ہے، اور جو محکوم فیہ ہے، اور جو حاکم ہے، تب تم جان جاؤ گے کہ مقامات (المقامات) سے خلاصی پانے والا کون ہے اور وہ کون ہے جس کا کوئی مقام نہیں۔\n\nاور جہاں تک مقام محمود (المقام المحمود) کا تعلق ہے، جو کہ وہ مقام ہے جس کی تعریف کی گئی ہے، جس کی اللہ نے تعریف کی ہے، جس میں ذات حق (الحق) محمد صلی اللہ علیہ وسلم کو کھڑا کرے گا، تو وہ رسول اللہ صلی اللہ علیہ وسلم کی شفاعت کا مقام ہے، جو شفاعت کرنے والوں کے حق میں ہوگی کہ وہ قیامت کے دن شفاعت کریں، خواہ وہ فرشتہ ہو، رسول ہو، نبی ہو، ولی ہو یا مومن ہو۔ اور یہ کہ ذات حق (الحق) ان لوگوں کو آگ سے نکالے یا جنت میں داخل کرے جنہوں نے کبھی کوئی نیکی نہیں کی، یہاں تک کہ آگ میں صرف وہی لوگ باقی رہ جائیں جو اس کے اہل ہیں، پس اللہ انہیں اس میں ایک ایسی صفت اور مزاج پر باقی رکھے گا کہ اگر اللہ انہیں اس مزاج کے ساتھ جنت میں نکالے تو وہ عذاب میں مبتلا ہو جائیں گے اور جنت میں داخلہ انہیں نقصان پہنچائے گا، جیسا کہ گلاب کی خوشبو گندے کیڑے کو نقصان پہنچاتی ہے۔ پس اللہ اس کی درخواست کو قبول فرمائے گا جس کے بارے میں اس نے سوال کیا۔\n\nاور جب کسی امر کے ظہور کا سبب ایک سے بڑھ جائے تو وہ شفاعت ہے، خواہ وہ جفت ہو یا طاق، اسے ایک سے زیادہ ہونا ضروری ہے۔ اور جہاں تک احوال (الأحوال) کا تعلق ہے، تو ان سے خلاصی پانے کا کوئی راستہ نہیں، اور وہ ہم میں موہوب (عطا کردہ) ہیں، جبکہ ذات حق (الحق) کے لیے وہ ذاتی ہیں۔\n\nپس حکم حال (الحال) کے لیے ہے اور احوال (الأحوال) حاکم ہیں، اور کائنات میں اللہ اور بشر کے سوا کوئی نہیں۔\n\nاور ہم ایک عبرت ہیں، اگر تم اسے سمجھو، پس رحمن کے سوا ہر شے عبرت حاصل کرتی ہے۔\n\nہم وہ ستارے ہیں جن کا ٹھکانہ مغرب میں ہے، اور صرف سورج اور چاند ہی ظاہر ہوتے ہیں۔\n\nہم میں مٹ جانا (الطمس) ہے، اور یہ مٹ جانا ہمیں فائدہ دیتا ہے، اور اسے وہی جانتا ہے جو نظر (بصیرت) رکھتا ہے۔\n\nپس خوف نہ کھاؤ، کیونکہ رحمن کے سوا کسی کی نہ کوئی عین (حقیقت) ہے، اور نہ ہی اسے تحکیم (حکم چلانے) اور اثر کا اختیار ہے۔\n\nاسی کی طرف تمام مخلوق کا معاملہ لوٹتا ہے، یہاں تک کہ قضاء، اور یہاں تک کہ حکم اور قدر (تقدیر) بھی۔\n\nاور وہ ہستی (الوجود) ہے جس کے پاس کوئی نقصان نہیں، اور شر کا اس کی تخلیق میں کوئی اثر نہیں۔\n\nپس شر ہمارے خالقِ جلیل کی طرف منسوب نہیں، اس کے بھیجنے (رسالت) کے ذریعے اسی بارے میں خبر آئی ہے۔\n\nجس نے گمراہی اور ہدایت کو پہچان لیا، اس پر مدت طویل نہیں ہوتی، اور وہ جانتا ہے کہ اللہ اپنی مخلوق کو بے کار نہیں چھوڑتا، جیسا کہ اس نے ابتدا میں بھی نہیں چھوڑا، اگرچہ وہ اسے سعادت مندوں کی منزلوں پر نہ اتارے۔ بے شک اللہ اپنی رحمت کے ذریعے جو **\"ہر شے پر محیط ہے\"** (سورۃ الاعراف: ۱۵۶)، اس پر ہلاکت کو دائمی نہیں کرتا۔ اور وہ اسے کیسے دائمی کر سکتا ہے جبکہ وہ خود ہلاکت کی عین (حقیقت) ہے؟ پس وہ فدا (قربانی) کے مقام پر ہے اور دشمنی کے تیروں کا اشارہ ہے۔ پس آخرت میں اس کے لیے رحمت ہے، وہ اس میں ہمیشہ ہمیشہ کے لیے خالد و مخلد رہے گا۔ اور اللہ تعالیٰ **\"حق فرماتا ہے اور وہی راستہ دکھاتا ہے\"** (سورۃ الاحزاب: ۴).",
    "fa": "باب چهارصد و بیستم در معرفت منازل رهایی از مقامات.\n\nنیست در هستی (الوجود) جز او، پس بنگریدش چنان *** که من نگریستم تا بیابید در او، آنی که او نیست.\n\nو هر که بر او دلالت کند، او صاحب جدل است *** در قلبش از او مَثَل‌ها و شَبَه‌هاست.\n\nاگر او نبود، چشمی با بیننده‌اش نمی‌نگریست *** اگر او نبود، دهان‌ها به ذکر سخن نمی‌گفتند.\n\nپس بر او حکم کن به واسطه‌ی او، در حالی که تو در نیستی هستی *** و بر او ثابت بمان، زیرا در کَون جز او نیست.\n\nبه خدا سوگند، اگر هستی (الوجود) حق (الحق) نبود، *** سخنانش در هستی کَون پذیرفته نمی‌شد، اگر او نبود.\n\n### [معرفت عارفان به حق تعالی از دیدن آیات بیرونی و درونی نیست]\n\nخداوند متعال فرمود: «ای اهل یثرب، اینجا جای ماندن شما نیست، بازگردید.» (يا أَهْلَ يَثْرِبَ لا مُقامَ لَكُمْ فَارْجِعُوا) و کسی که جامع مقامات است، مقامی ندارد که او را مقید سازد.\n\nهر که خود را شناخت، پروردگارش را شناخت. (من عرف نفسه عرف ربه)\n\nو سخن او: «به زودی آیات خود را در آفاق به آنان نشان خواهیم داد» (سَنُرِيهِمْ آياتِنا فِي الْآفاقِ) یعنی دلالت‌کننده بر آن در آفاق و «در خودشان» (فِي أَنْفُسِهِمْ). و این آیات مقید هستند، پس ناگزیر مدلول آن‌ها نیز باید مقید باشد، اگرچه بر اطلاق او دلالت کنند؛ زیرا مطلق بودن او خود نوعی تقیید است، چرا که تقیید همان تمایز است. پس معرفت (المعرفة) عارفان به حق تعالی از دیدن آیات بیرونی و درونی نیست، زیرا این آیات بر مقیدی در اطلاق یا اطلاقی در مقید دلالت می‌کنند. و عارفان او را عین هر شیء مخلوق می‌بینند.\n\n[خداوند] به کسی که در حق او بدی کرده و قطع رحم نموده، فرمود: «امروز ملامتی بر شما نیست.» (لا تَثْرِيبَ عَلَيْكُمُ) پس حق (الحق) سزاوارتر به این صفت است برای کسی که با قطع رحم در حق او بدی کرده است. زیرا ما شک نداریم که قطع‌کننده‌ی رحم، آن را قطع نکرده مگر به سبب جهلش؛ و رحم قطع نشده است. پس رحم در نفس‌الأمر پیوسته است و نزد عارف (العالم) پیوسته است. از جانب او پیوسته است و از جانب جاهل به آن، گسسته است.\n\nو چون همه‌ی امور به سوی خداوند بازگشت، از آنچه دعاوی دروغین در آن واقع شده بود، بازگشت آن‌ها به سوی خداوند متعال دلالت بر امری نمی‌کند که خداوند بر آن نبوده است؛ بلکه هویت او همان هویت است، چه در حال دعاوی در مشارکت و چه در حال بازگشت امر به سوی او.\n\nو مقام (المقام) نیست مگر برای تمایز، و در آنجا جز یکی نیست؛ پس از چه کسی متمایز شود؟ بنابراین مقامی نیست، بلکه هویتی احدی است که صورت‌های مختلف در آن است. پس زید، احدی‌العین است. اگر در هستی (الوجود) جز او نبود، از چیزی متمایز نمی‌شد، زیرا در آنجا جز او نیست. و چیزی از او متمایز نمی‌شد، زیرا تو موجودی جز او فرض نکرده‌ای. و او مقامی ندارد که به واسطه‌ی آن از غیر خود متمایز شود، زیرا در آنجا غیری نیست.\n\nدر حالی که دست او از پایش متمایز است، و سرش از سینه‌اش، و گوشش از چشمش، و هر عضوی از سایر اعضا متمایز است. و هر قوه‌ای از قوای باطنی او حکمی دارد که برای دیگری نیست و محلی دارد که برای دیگری نیست. پس صورت‌ها در عین واحدی متمایز شدند که در آن تمایزی نیست و مقامی برای آن نیست.\n\nپس ما برای او مانند اعضا برای یکی از ما و قوای او هستیم. در آنجا کسی نیست که از او متمایز شویم و او از ما متمایز شود، بلکه تمایز ما از یکدیگر است، همان‌گونه که مقرر کردیم. و احکام و مقامات به اعضای ما نسبت داده نمی‌شود، بلکه همه‌ی آن به ما نسبت داده می‌شود. پس گفته می‌شود: فلان شخص به فلان شخص حمله کرد، و فلان شخص به سوی فلان شخص راه رفت، و فلان شخص سخن فلان شخص را شنید، و فلان شخص، فلان شخص را دید. هیچ یک از این‌ها به ابزار، یا به قوه، یا به عضو نسبت داده نمی‌شود. پس «امر همه به سوی او بازگردانده می‌شود.» (إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ) پس «حکم از آن اوست» (فَلَهُ الْحُكْمُ) و «به سوی او بازگردانده می‌شوید.» (وَإِلَيْهِ تُرْجَعُونَ)\n\n### [اینکه هیچ رهایی‌دهنده‌ای از مقامات نیست مگر وارث محمد (صَلَّى اللهُ عَليهِ وسَلَّم) که خداوند جوامع الکلم را به او عطا کرده است.]\n\nپس بدان که هیچ کس از مقامات (المقامات) رهایی نمی‌یابد مگر وارث محمد (صَلَّى اللهُ عَليهِ وسَلَّم) که خداوند جوامع الکلم را به او عطا کرده و همه‌ی اسماء را به او آموخته و علم اولین و آخرین را به او داده است. پس همه‌ی صید در شکم گورخر است. پس در آنجا کسی نیست که از او متمایز شویم، زیرا همه‌ی عالَم در وارث محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است، همان‌گونه که در محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است. پس او از حکم مقامات بر خود رهایی یافته است.\n\nپس او بر اساس آنچه احوال (الأحوال) به او عطا می‌کند، حکم می‌راند، زیرا او دانای حکیم است. پس همه‌ی اسماء الهی هستند که مقامات را ظاهر می‌سازند و حاکم به واسطه‌ی آن‌ها حکم می‌کند، و حاکمی جز خداوند نیست. و «سخن نزد او تبدیل نمی‌شود.» (ما يُبَدَّلُ الْقَوْلُ لَدَيَّ) پس سخن، حکم است. پس حق (الحق) به واسطه‌ی قول حکم می‌کند. پس توجه کن به کسی که محکوم‌علیه است، و محکوم‌به است، و محکوم‌فیه است، و حاکم است، تا بشناسی چه کسی رهایی‌دهنده از مقامات است و چه کسی مقامی ندارد.\n\nو اما مقام محمود (المقام المحمود)، که همان مقام ستایش‌شده‌ای است که خداوند آن را ستوده و حق (الحق) سبحانه محمد (صَلَّى اللهُ عَليهِ وسَلَّم) را در آن اقامه می‌کند، آن مقام شفاعت رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) است در حق شفاعت‌کنندگان، تا در روز قیامت شفاعت کنند؛ از فرشته و رسول و نبی و ولی و مؤمن. و اینکه حق (الحق) کسانی را که هرگز خیری انجام نداده‌اند، از آتش خارج کند یا به بهشت وارد سازد، تا در آتش جز اهل آن که اهل حقیقی آن هستند، باقی نمانند. پس خداوند آن‌ها را در آنجا بر صفتی و مزاجی باقی می‌دارد که اگر خداوند آن‌ها را با آن مزاج به بهشت خارج کند، عذاب می‌بینند و ورود به آن به ایشان زیان می‌رساند، همان‌گونه که بوی گل سرخ به سوسک زیان می‌رساند. پس خداوند او را در آنچه درخواست کرده، اجابت می‌کند. و اگر سبب ظهور امری بر یکی، افزون شود، آن شفاعت است، چه زوج باشد و چه فرد، ناگزیر باید بیش از یکی باشد.\n\nو اما احوال (الأحوال)، راهی برای رهایی از آن‌ها نیست، و آن‌ها در ما موهبتی هستند و برای حق (الحق) ذاتی می‌باشند.\n\nپس حکم از آنِ حال است و احوال حاکم‌اند *** و نیست در کَون جز خداوند و بشر.\n\nو ما در عبرت هستیم، اگر تعقل کنی *** پس هر چیزی جز رحمان، عبرت گرفته می‌شود.\n\nما ستارگانی هستیم که جایگاهشان در غرب است *** و جز خورشید و ماه ظاهر نمی‌شود.\n\nمحو شدن (الطمس) در ماست و آن محو شدن به ما سود می‌رساند *** و آن را نمی‌داند مگر کسی که صاحب نظر باشد.\n\nپس مترس، زیرا جز رحمان نه چشمی دارد *** و نه تحکیم و اثری از آن اوست.\n\nامر همه‌ی خلق به سوی او باز می‌گردد *** حتی قضا و حتی حکم و قدر.\n\nو او هستی (الوجود) است که نزد او ضرری نیست *** و شر در خلق او اثری ندارد.\n\nپس شر به سوی او نیست، جلیل است خالق ما *** خبر از فرستادن او به این [معنا] آمده است.\n\nهر کس گمراهی و هدایت را شناخت، مدت بر او طولانی نشد و دانست که خداوند خلق خود را بیهوده رها نمی‌کند، همان‌گونه که در ابتدا رها نکرد. و اگرچه او را در منازل سعادتمندان جای ندهد، اما خداوند به رحمتش که «همه چیز را فرا گرفته است» (وَسِعَتْ كُلَّ شَيْ‏ءٍ)، ردا را بر او جاودانه نمی‌سازد. و چگونه آن را جاودانه سازد در حالی که او عین ردا است؟ پس او در مقام فدا و نشانه‌ی تیرهای دشمنی است. پس رحمت در نهایت برای اوست، جاودانه و مخلد در آن برای همیشه. و خداوند متعال «حق را می‌گوید و او راه را هدایت می‌کند.» (يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 2
}