{
  "id": 374,
  "title": {
    "ar": "الباب الرابع والسبعون وثلاثمائة في معرفة منزل الرؤية",
    "en": "Chapter Three Hundred and Seventy-Four: Concerning the Knowledge of the Station of Vision.",
    "ur": "باب تین سو چوہترواں: منزلِ رویت کی معرفت میں",
    "fa": "باب سیصد و هفتاد و چهارم در معرفت منزل رؤیت (الرؤية)"
  },
  "content": {
    "ar": "## «الباب الرابع والسبعون وثلاثمائة» في معرفة منزل الرؤية\n\n\nوالرؤية وسوابق الأشياء في الحضرة الربية وأن للكفار قدما كما إن للمؤمنين قدما وقدوم كل طائفة على قدمها وآتية بإمامها عدلا وفضلا من الحضرة المحمدية\n\n\n> من كان في ظلمة الأكوان كان له *** حكم العناية دون الخلق أجمعه‏\n\n\n> ونال كشف غطاء الحس من كتب *** وأبصر الكل مفتوحا بموضعه‏\n\n\n> يجري على السنة البيضاء سيرته *** يشاهد الحق مربوطا بمهيعه‏\n\n\n### [إن الله تعالى جعل العرش محل أحدية الكلمة]\n\n\nاعلم أيدك الله بالشهود وجعلك من أهل الجمع والوجود إن الله تعالى لما جعل العرش محل أحدية الكلمة وهو الرحمن لا غيره وخلق الكرسي فانقسمت فيه الكلمة إلى أمرين ليخلق من كل شي‏ء زوجين ليكون أحد الزوجين متصفا بالعلو والآخر بالسفل الواحد بالفعل والآخر بالانفعال فظهرت الشفيعة من الكرسي بالفعل وكانت في الكلمة الواحدة بالقوة ليعلم أن الموجود الأول أنه وإن كان واحد العين من حيث ذاته فإن له حكم نسبة إلى ما ظهر من العالم عنه فهو ذات وجودية ونسبة فهذا أصل شفيعة العالم ولا بد من رابط معقول بين الذات والنسبة حتى تقبل الذات هذه النسبة فظهرت الفردية بمعقولية الرابط فكانت الثلاثة أول الأفراد ولا رابع في الأصل فالثلاثة أول الأفراد في العدد إلى ما لا يتناهى والشفيعة المعبر عنها بالاثنين أول الأزواج إلى ما لا يتناهى في العدد فما من شفع إلا ويوتره واحد يكون بذلك فردية ذلك الشفع وما من فرد إلا ويشفعه واحد يكون به شفعية ذلك الفرد فالأمر الذي يشفع الفرد ويفرد الشفع هو الغني الذي له الحكم ولا يحكم عليه ولا يفتقر ويفتقر إليه فتدلت إلى الكرسي القدمان لما انقسمت فيه الكلمة الرحمانية فإن الكرسي نفسه به ظهرت قسمة الكلمة لأنه الثاني بعد العرش المحيط من صور الأجسام الظاهرة في الجوهر الأصل وهما شكلان في الجسم الكل الطبيعي فتدلت إليه القدمان فاستقرت كل قدم في مكان ليس هو المكان الذي استقرت فيه الأخرى وهو منتهى استقرارهما فسمى المكان الواحد جهنما والآخر جنة وليس بعدهما مكان تنتقل إليه هاتان القدمان فهاتان القدمان لا يستمدان إلا من الأصل الذي منه ظهرت وهو الرحمن فلا\n\n\nيعطيان إلا الرحمة فإن النهاية ترجع إلى الأصل بالحكم غير أنه بين البدء والنهاية طريق ميز ذلك الطريق بين البداية والغاية ولو لا تلك الطريق ما كان بدء ولا غاية فكان سفرا للأمر النازل بينهن والسفر مظنة التعب والشقاء فهذا سبب ظهور ما ظهر في العالم دنيا وآخرة وبرزخا من الشقاء وعند انتهاء الاستقرار يلقى عصا التسيار وتقع الراحة في دار القرار والبوار فإن قلت فكان ينبغي عند الحلول في الدار الواحدة المسماة نارا أن توجد الراحة وليس الأمر كذلك قلنا صدقت ولكن فإنك نظر وذلك أن المسافرين على نوعين مسافر يكون سفره كإقامة بما هو فيه من الترفه من كونه مخدوما حاصلة له جميع أغراضه في محفة محمول على أعناق الرجال محفوظ من تغير الأهواء فهذا مثله في الوصول إلى المنزل مثل أهل الجنة في الجنة ومسافر يقطع الطريق على قدميه قليل الزاد ضعيف المؤنة إذا وصل إلى المنزل بقيت معه بقية التعب والمشقة زمانا حتى تذهب عنه ثم يجد الراحة فهذا مثل من يتعذب ويشقى في النار التي هي منزله ثم تعمه الرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ ومسافر بينهما ليست له رفاهية صاحب الجنة ولا شظف صاحب النار فهو بين راحة وتعب فهي الطائفة التي تخرج من النار بشفاعة الشافعين وبإخراج أرحم الراحمين وهم على طبقات فلذلك يكون فيهم المتقدم والمتأخر بقدر ما يبقى معهم من التعب فيزول في النار شيئا بعد شي‏ء فإذا انتهت مدته خرج إلى محل الراحة وهو الجنة إما بشفاعة شافع وإما بالإخراج العام وهو إخراج أرحم الراحمين فالأنبياء والمؤمنون يشفعون في أهل الايمان وأهل الايمان طائفتان منهم المؤمن عن نظر وتحصيل‏\nدليل وهم الذين علموا الآيات والدلالات والمعجزات وهؤلاء هم الذين يشفع فيهم النبيون ومنهم المؤمن تقليدا بما أعطاه أبواه إذ ربياه أو أهل الدار التي نشأ فيها فهذا النوع يشفع فيهم المؤمنون كما أنهم أعطوهم الايمان في الدنيا بالتربية وأما الملائكة فتشفع فيمن كان على مكارم الأخلاق في الدنيا وإن لم يكن مؤمنا وما ثم شافع رابع وبقي من يخرجه أرحم الراحمين وهم الذين ما عملوا خيرا قط لا من جهة الايمان ولا بإتيان مكارم الأخلاق غير إن العناية سبقت لهم أن يكونوا من أهل تلك الدار وبقي أهل هذه الدار الأخرى فيها فغلقت أبواب الدار وأطبقت ووقع الياس من الخروج فحينئذ تعم الرحمة أهلها لأنهم قد يئسوا من الخروج منها فإنهم كانوا يخافون منها الخروج لما رأوا إخراج أرحم الراحمين وهم قد جعلهم الله على مزاج بصلح لساكن تلك الدار ويتضرر بالخروج منها كما قد بيناه فلما يئسوا فرحوا فنعيمهم هذا القدر وهو أول نعيم يجدونه وحالهم فيها كما قدمناه بعد فراغ مدة الشقاء فيستعذبون العذاب فتزول الآلام ويبقى العذاب ولهذا سمي عذابا لأن المال إلى استعذابه لمن قام به كما يستحلي الجرب من يحكه فإذا حكه من غير جرب أو غير حاجة من يبوسة تطرأ على بعض بدنه تألم بالحك هكذا الأمر يقتضيه حال المزاج الذي يعرض للإنسان فافهم نعيم كل دار تسعد إن شاء الله تعالى أ لا ترى إلى صدق ما قلناه إن النار لا تزال متالمة لما فيها من النقص وعدم الامتلاء حتى يضع الجبار فيها قدمه وهي إحدى تينك القدمين المذكورتين في الكرسي والقدم الأخرى التي مستقرها الجنة قوله وبَشِّرِ الَّذِينَ آمَنُوا أَنَّ لَهُمْ قَدَمَ صِدْقٍ عِنْدَ رَبِّهِمْ فالاسم الرب مع هؤلاء والجبار مع الآخرين لأنها دار جلال وجبروت وهيبة والجنة دار جمال وأنس وتنزل إلهي لطيف فقدم الصدق إحدى قدمي الكرسي وهما قبضتان الواحدة للنار ولا يبالي والأخرى للجنة ولا يبالي لأنهما في المال إلى الرحمة فلذلك لا يبالي فيهما ولو كان الأمر كما يتوهمه من لا علم له من عدم المبالاة ما وقع الأخذ بالجرائم ولا وصف الله نفسه بالغضب ولا كان البطش الشديد فهذا كله من المبالاة والتهمم بالمأخوذ إذ لو لم يكن له قدر ما عذب ولا استعد له وقد قيل في أهل التقوى إن الجنة أُعِدَّتْ لِلْمُتَّقِينَ وقال في أهل الشقاء أَعَدَّ لَهُمْ عَذاباً أَلِيماً فلو لا المبالاة ما ظهر هذا الحكم فللأمور والأحكام مواطن إذا عرفها أهلها لم يتعد بكل حكم موطنه وبهذا يعرف العالم من غير العالم فالعالم لا يزال يتأدب مع الله ويعامله في كل موطن بما يريد الحق أن يعامله به في ذلك الموطن ومن لا يعلم ليس كذلك فبالقدمين أغنى وأفقر وبهما أمات وأحيا وبهما أهل وأقفر وبهما خَلَقَ الزَّوْجَيْنِ الذَّكَرَ والْأُنْثى‏ وبهما أذل وأعز وأعطى ومنع وأضر ونفع ولولاهما ما وقع شي‏ء في العالم مما وقع ولولاهما ما ظهر في العالم شرك فإن القدمين اشتركتا في الحكم في العالم فلكل واحدة منهما دار تحكم فيها وأهل تحكم فيهم بما شاء الله من الحكم وقد أومأنا إليه وإلى تفاصيله فإن الأحكام كالحدود تتغير بتغير الموجب لها فالمحدود في الافتراء يحد بحد لا يقام فيه إذا قتل بل يتولاه حد آخر خلاف هذا والمفتري هو القاتل عينه فتغيرت الحدود عليه لتغير الموجب لها فافهم فكذلك أحوال الأحكام الإلهية تتغير لتغير المواطن فالعناية الكبرى التي لله بالعالم كون استواءه على العرش المحيط بالعالم باسمه الرحمن وإليه يرجع الأمر كله ولذلك هو أرحم الراحمين لأن الرحماء في العالم لو لا رحمته ما كانوا رحماء فرحمته أسبق ولما كانت القدمان عبارة عن تقابل الأسماء الإلهية مثل الأول والآخر والظاهر والباطن ومثل ذلك ظهر عنها في العالم حكم ذلك في عالم الغيب والشهادة والجلال والجمال والقرب والبعد والهيبة والأنس والجمع والفرق والستر والتجلي والغيبة والحضور والقبض والبسط والدنيا والآخرة والجنة والنار كما إن بالواحد كان لكل معلوم أحدية يمتاز بها من غيره كما إن عن الفردية وهي الثلاثة ظهر حكم الطرفين والواسطة وهي البرزخ والشي‏ء\n\n\nالذي هو بينهما كالحار والبارد والفاتر وعن الفردية ظهرت الأفراد وعن الاثنين ظهرت الأشفاع ولا يخلو كل عدد أن يكون شفعا أو وترا إلى ما لا يتناهى التضعيف فيه والواحد يضعفه أبدا فبقوة الواحد ظهر ما ظهر من الحكم في العدد والحكم لله الواحد القهار فلو لا أنه سمي بالمتقابلين ما تسمى بالقهار لأنه من المحال أن يقاومه مخلوق أصلا فإذا ما هو قهار إلا من حيث إنه تسمى بالمتقابلين فلا يقاومه غيره فهو المعز المذل فيقع بين الاسمين حكم القاهر والمقهور بظهور أحد الحكمين في المحل فلذلك هو الواحد من حيث إنه يسمى القهار من حيث أنه يسمى بالمتقابلين ولا بد من نفوذ حكم أحد الاسمين فالنافذ الحكم هو القاهر\nوالقهار من حيث إن أسماء التقابل له كثيرة كما ذكرناها من المحيي والمميت والضار والنافع وما أشبه ذلك ومن هاتين القدمين ظهر في النبوة المبعوث وغير المبعوث وفي المؤمنين المؤمن عن نظر وعن غير نظر فحكمهما سار في العالم فقد بان لك الأمر فلا ينهتك الستر كما يحكمك الشفع كذا يحكمك الوتر وأما معرفة الحجاب والرؤية وهما من أحكام القدمين وإن كان حكم الرؤية باقيا إلا أن متعلقها الحجاب فهي ترى الحجاب فما زال حكمها فما ثم قاهر لها ولا مضاد إلا أن الرائي له عرض في متعلق خاص إذا لم تتعلق رؤيته به هناك يظهر حكم الحجاب فالغرض هو المقهور لا الرؤية فمن أراد أن يزول عنه حكم القهر فليصحب الله بلا غرض ولا تشوف بل ينظر كل ما وقع في العالم وفي نفسه يجعله كالمراد له فيلتذ به ويتلقاه بالقبول والبشر والرضي فلا يزال من هذه حاله مقيما في النعيم الدائم لا يتصف بالذلة ولا بأنه مقهور فتدركه الآلام لذلك وعزيز صاحب هذا المقام وما رأيت له ذائقا لأنه يجهل الطريق إليه فإن الإنسان لا يخلو نفسا واحدا عن طلب يقوم به لأمر ما وإذا كانت حقيقة الإنسان ظهور الطلب فيه فليجعل متعلق طلبه مجهولا غير معين إلا من جهة واحدة وهو أن يكون متعلق طلبه ما يحدثه الله في العالم في نفسه أو في غيره فما وقعت عليه عينه أو تعلق به سمعه أو وجده في نفسه أو عامله به أحد فليكن ذلك عين مطلوبه المجهول قد عينه له الوقوع فيكون قد وفي حقيقة كونه طالبا وتحصل له اللذة بكل واقع منه أو فيه أو من غيره أو في غيره فإن اقتضى ذلك الواقع التغيير له تغير لطلب الحق منه التغير وهو طالب الواقع والتغير هو الواقع وليس بمقهور فيه بل هو ملتذ في تغييره كما هو ملتذ في الموت للتغير وما ثم طريق إلى تحصيل هذا المقام إلا ما ذكرناه فلا نقل كما قال من جهل الأمر فطلب المحال فقال أريد أن لا أريد وإنما الطلب الصحيح الذي تعطيه حقيقة الإنسان أن يقول أريد ما تريد وأما طريقتها في العموم فسهل على أهل الله وذلك أن الإنسان لا يخلو من حالة يكون عليها ويقوم فيها عن إرادة منه وعن كره بأن يقام فيها من غير إرادة ولا بد أن يحكم لتلك الحال حكم شرعي يتعلق بها فيقف عند حكم الشرع فيريد ما أراده الشرع فيتصف بالإرادة لما أراد الشرع خاصة فلا يبقى له غرض في مراد معين وكذلك من قال إن العبد ينبغي أن يكون مع الله بغير إرادة لا يصح وإنما يصح لو قال إن العبد من يكون متعلق إرادته ما يريد الحق به إذ لا يخلو عن إرادة فمن طلب رؤية الحق عن أمر الحق فهو عبد ممتثل أمر سيده ومن طلب رؤية الحق عن غير أمر الحق فلا بد أن يتألم إذا لم يقع له وجدان لما تعلقت به إرادته فهو الجاني على نفسه فإن خالق الأشياء والمرادات والحوادث يحكم ولا يحكم عليه فليكن العبد معه على ما يريده فإنه يجوز بهذا الراحة المعجلة في الدنيا وقد ورد في الأخبار الإلهية يا عبدي أريد وتريد ولا يكون إلا ما أريد فهذا تنبيه على دواء إذا استعمله الإنسان زال عنه الألم الذي ذكرناه ولذلك‏\n\n\nورد في الإلهيات عن كعب الأحبار أن الله تعالى يقول يا ابن آدم إن رضيت بما قسمت لك أرحت قلبك وبدنك وهو موضع إرادة العبد وأنت محمود وإن لم ترض بما قسمت لك سلطت عليك الدنيا حتى تركض فيها ركض الوحش في البرية ثم وعزتي وجلالي لا تنال منها إلا ما قدرت لك وأنت مذموم‏\n\n\nوهذا أيضا دواء وأما قوله تعالى وما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله فهو عزاء أفاد علما ليثبت به العبد في القيامة حكما فهو تلقين حجة ورحمة من الله وفضل‏\n\n\n### [الطلب سعاية والرؤية امتنان‏]\n\n\nواعلم أنه كل ما ينال بسعاية فليس فيه امتنان والطلب سعاية والرؤية امتنان فلا يصح أن يطلب فإذا وقع ما وقع من الرؤية عن طلب فليست هي الرؤية على الحقيقة الحاصلة عن الطلب فإن مطلوبه من المرئي أن يراه إنما هو أن يراه على ما هو له وهو لا يتجلى له إلا في صورة علمه به لأنه إن لم يكن كذلك أنكره فما تجلى له إلا في غير ما طلب فكانت الرؤية إحسانا فإنه ما جاءه عين ما طلب وهو يتخيل أن ذلك عين ما طلب وليس هو فإذا وقع له الالتذاذ بما رآه وتخيل أنه مطلوبه تجلى له بعد ذلك من غير طلب فكان ذلك التجلي أيضا امتنانا إلهيا أعطاه من العلم به ما لم يكن عنده ولا خطر على باله فإذا فهمت ما ذكرته لك علمت أن رؤية الله لا تكون بطلب ولا تنال جزاء كما تنال النعم بالجنان وهذه مسألة ما في علمي أن أحدا نبه عليها من خلق الله إلا الله مع أن رجال الله يعلمونها وما نبهوا عليها لتخيلهم إن هذه المسألة قريبة المأخذ سهلة المتناول أو وقوعها من المحال لا بد من أحد الحكمين فإن الله ما سوى بين الخلق في العلم به فلا بد من التفاضل في ذلك بين عباد الله فإن المعتزلي يمنع الرؤية والأشعري يجوزها عقلا\nويثبتها شرعا في مقتضى نظره والفيلسوف ينفيها عقلا إذ لا قدم له في الشرع والايمان وأهل الله يثبتونها كشفا وذوقا ولو كان قبل الكشف ما كان فإن الكشف يرده لما أعطاه ما يبقيه على ما كان عليه إلا إن كان ممن يقول بما جاء به أهل الكشف فإنه لا يتغير عليه الحال إلا بقدر ما بين العلم ورؤية المعلوم واعلم أن الله من حيث نفسه له أحدية الأحد ومن حيث أسماؤه له أحدية الكثرة\n\n\n> إِنَّمَا الله إِلهٌ واحِدٌ *** ودليلي قُلْ هُوَ الله أَحَدٌ\n\n\n> فإذا ما تهت في أسمائه *** فاعلم أن التيه من أجل العدد\n\n\n> يرجع الكل إليه كلما *** قرأ القارئ الله الصَّمَدُ\n\n\n> لَمْ يَلِدْ حقا ولَمْ يُولَدْ ولم *** يكن كفوا للاله من أحد\n\n\n> فيحار العقل فيه عند ما *** يغلب الوهم عليه بالمدد\n\n\n> ثم يأتيه مشدا أزل *** جاء في الشرع ويتلوه أبد\n\n\n> وبنا كان له الحكم به *** فإذا زلنا فكون ينفرد\n\n\nوهذا هو السبب الموجب لطلب تجليه تعالى في الصور المختلفة وتحوله فيها لاختلاف المعتقدات في العالم إلى هذه الكثرة فكان أصل اختلاف المعتقدات في العالم هذه الكثرة في العين الواحدة ولهذا وقع الإنكار من أهل الموقف عند ظهوره وقوله أَنَا رَبُّكُمْ فلو تجلى لهم في الصورة التي أخذ عليهم الميثاق فيها ما أنكره أحد فبعد وقوع الإنكار تحول لهم في الصورة التي أخذ عليهم فيها الميثاق فأقروا به لأنهم عرفوه ولهم إدلال إقرارهم وأما تجليه تعالى في الكثيب للرؤية فهنالك يتجلى في صور الاعتقادات لاختلافهم في ذلك في مراتبهم ولم يختلف في أخذ الميثاق فذلك هو التجلي العالم للكثرة وتجلى الكثيب هو التجلي العام في الكثرة والتجلي الذي يكون من الله لعبده وهو في ملكه هو التجلي الخاص الواحد للواحد فرؤيتنا إياه في يوم المواقف في القيامة يخالف رؤيتنا إياه في أخذ الميثاق ويخالف رؤيتنا إياه في الكثيب ويخالف رؤيتنا إياه ونحن في ملكنا وفي قصورنا وأهلينا فمنه كان الخلاف الذي حكم علينا به في القرآن العزيز في قوله تعالى ولا يَزالُونَ مُخْتَلِفِينَ وقوله إِلَّا من رَحِمَ رَبُّكَ فهم الذين عرفوه في الاختلاف فلم ينكروه فهم الذين أطلعهم الله على أحدية الكثرة وهؤلاء هم أهل الله وخاصته فقد خالف المرحومون بهذا الأمر الذي اختصهم الله به من سواهم من الطوائف فدخلوا بهذا النعت في حكم قوله ولا يَزالُونَ مُخْتَلِفِينَ لأنهم خالفوا أولئك وخالفهم أولئك فما أعطانا الاستثناء إلا ما ذكرناه فكان سبحانه أول مسألة خلاف ظهر في العالم لأن كل موجود في العالم أول ما ينظر في سبب وجوده لأنه يعلم في نفسه أنه لم يكن ثم كان بحدوثه لنفسه واختلفت فطرهم في ذلك فاختلفوا في السبب الموجب لظهورهم ما هو فلذلك كان الحق أول مسألة خلاف في العالم ولما كان أصل الخلاف في العالم في المعتقدات وكان السبب أيضا وجود كل شي‏ء من العالم على مزاج لا يكون للشي‏ء الآخر لهذا كان مال الجميع إلى الرحمة لأنه خلقهم وأظهرهم في العماء وهو نفس الرحمن فهم كالحروف في نفس المتكلم في المخارج وهي مختلفة كذلك اختلف العالم في المزاج والاعتقاد مع أحديته أنه عالم محدث أ لا تراه قد تسمى بالمدبر المفصل فقال عز وجل يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ وكل ما ذكرناه آنفا هو تفصيل الآيات فيه وفينا ودلالة عليه وعلينا وكذلك نحن أدلة عليه وعلينا فإن أعظم الدلالات وأوضحها دلالة الشي‏ء على نفسه والتدبر من الله عين التفكر في المفكرين منافيا لتدبر تميز العالم بعضه من بعض ومن الله وبالتفكر عرف العالم ذلك ودليله الذي فكر فيه هو عين ما شاهده من نفسه ومن غيره سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أن ذلك المرئي هو الحق‏\n\n\n> إن التدبر مثل الفكر في الحدث *** وفي المهيمن تدبير بلا نظر\n\n\n> فأخلص الفكر إن الفكر مهلكة *** به يفرق بين الله والبشر\n\n\nفتحقق ما أوردناه في هذا الباب وما أبان الحق في هذا المنزل من علم الرؤية تنتفع بذلك في الدنيا إن كنت من‏\nأهل الشهود والجمع والوجود وفي الآخرة وتنظيم في سلك من استثنى الله كقوله إِلَّا من رَحِمَ رَبُّكَ فإن فهم العامة فيه خلاف فهم خاصة الله وأهله وهم أهل الذكر لأنهم فهموه على مراد الله فيه أعطاهم ذلك الأهلية فثم عين تجمع وعين تفرق في عين واحدة سواء ذلك في جانب الحق أو جانب الخلق والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ وفي هذا المنزل من العلوم علم أصناف الكتب المنزلة والعلم بكل واحد منها بحسب الاسم الدال عليه فمن هناك تعرف رتبة ذلك الكتاب وإن كان كل اسم لكتاب صالحا لكل كتاب لأنه اسم صفة فيه ولكن ما اختص بهذا الاسم وحده على التعيين إلا لكونه هو فيه أتم حكما من غيره من الأسماء\n\n\nكقوله عليه السلام أقضاكم علي وأفرضكم زيد وأعلمكم بالحلال والحرام معاذ بن جبل‏\n\n\nوقد ذكرنا الكتب وأسماءها في هذا الكتاب أعني طرفا من ذلك في منزل القرآن وفي كتاب مواقع النجوم في عضو اللسان فإن الله تعالى لما أشار إلينا في القرآن العزيز إلى ما أنزله علينا نارة أوقع الإشارة إلى عين الكتاب فقال ذلِكَ الْكِتابُ وتارة أشار إلى آياته وقال تِلْكَ آياتُ الْكِتابِ فتارة ترك الإشارة وذكر الكتاب من غير إشارة ولكل حكم من هذه الأحكام فهم منا يخصه لا بد من ذلك وفيه علم الفرق بين السحر والمعجزة وفيه علم ما للناس عند الله من حيث ما قام بهم من الصفات فيعلم من ذلك منزلته من ربه فإن الله ينزل على عبده منه حيث أنزل العبد ربه من نفسه فالعبد أنزل نفسه من ربه فلا يلومن إلا نفسه إذا رأى منزلة غيره تفوق رفعة منزلته هذا هو الخسران المبين حيث كان متمكنا من ذلك فلم يفعل ولذلك كان يوم القيامة يقال فيه يَوْمُ التَّغابُنِ فإنه يوم كشف الغطاء وتتبين الأمور الواقعة في الدنيا ما أثمرت هنالك فيقول الكافر وهو الجاهل يا لَيْتَنِي قَدَّمْتُ لِحَياتِي لعلمه أنه كان متمكنا من ذلك فلم يفعل فعذابه ندمه وما غبن فيه نفسه أشد عليه من أسباب العذاب من خارج وهذا هو العذاب الأكبر وفيه علم الاستدلال على الله بما ذا يكون هل بالله أو بالعالم أو بما فيه من النسب وفيه علم فائدة اختلاف الأنوار حتى كان منها الكاشف ومنها المحرق وفيه علم مقادير الحركات الزمانية وحكم اسم الدهر عليها وهو اسم من أسماء الله تعالى وفيه علم اختلاف الآيات لاختلاف صفات الناظرين فيها وفيه علم ما يذم من الغفلة وما يحمد وفيه علم الأسباب الموجبة لما يؤول إليه من أثرت فيه في الآخرة وفيه علم ما تكلم به أول إنسان في نشئه وهو الحمد لله وهو آخِرُ دَعْواهُمْ أَنِ الْحَمْدُ لِلَّهِ فبدأ العالم بالثناء وختم بالثناء فأين الشقاء السرمد حاشا الله أن يسبق غضبه رحمته فهو الصادق أو يخصص اتساع رحمته بعد ما أعطاها مرتبة العموم حكاية في هذا اجتمع سهل بن عبد الله بإبليس فقال له إبليس في مناظرته إياه إن الله تعالى يقول ورَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ وكل تعطي العموم وشي‏ء أنكر النكرات فإنا لا أقطع يأسي من رحمة الله قال سهل فبقيت حائرا ثم إني تنبهت في زعمي إلى تقييدها فقلت له يا إبليس إن الله قيدها بقوله فَسَأَكْتُبُها قال فقال لي يا سهل التقييد صفتك لا صفته فلم أجد جوابا له على ذلك وفيه علم ما يحمد من التأني والتثبط وما يذم وعلم ما يحمد من العجلة في الأمور وما يذم وفيه علم الرجوع إلى الله عن القهر إذا رجع مثله إليه بالإحسان وهل يستوي الرجوعان أم لا يستويان وهذه مسألة حار فيها أهل الله أعني في رجوع الاضطرار ورجوع الاختيار إذ كان في الاختيار رائحة ربوبية والاضطرار كله عبودية فهذا سبب الخلاف في أي الرجوعين أتم في حق الإنسان وفيه علم المحاضرات والمناظرات في مجالس العلماء بينهم وأن ذلك كله من محاضرات الأسماء الإلهية بعضها مع بعض ثم ظهر ذلك في الملإ الأعلى إذ يختصمون مع شغلهم بالله وأنهم عليه السلام في تسبيحهم لا يفترون ولا يسأمون فهل خصومتهم من تسبيحهم كما كان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يذكر الله على كل أحيانه مع كونه كان يتحدث مع الأعراب في مجالستهم ومع أهله فهل كل ذلك هو ذكر الله أم لا وأما اختلاف من خلق من الطبائع فغير منكور لأن الطبائع متضادة فكل أحد يدرك ذلك ولا ينكر المنازعة في عالم الطبيعة وينكر ونها فيما فوق الطبيعة وأما أهل الله فلا ينكرون النزاع في الوجود أصلا لعلمهم بالأسماء الإلهية وأنها على صورة العالم بل الله أوجد العالم على صورتها لأنها الأصل وفيها المقابل والمخالف والموافق والمساعد وفيه علم الفرق بين من كان معلمه الله ومن كان معلمه نظره الفكري ومن كان معلمه مخلوق مثله فأما صاحب‏\nنظر فيلحق بمعلمه وأما صاحب إلقاء إلهي فيلحق بمعلمه ولا سيما في العلم الإلهي الذي لا يعلم في الحقيقة إلا بإعلامه فإنه يعز أن يدرك بالإعلام الإلهي فكيف بالنظر الفكري ولذلك نهى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عن التفكر في ذات الله وقد غفل الناس عن هذا القدر فما منهم من سلم من التفكر فيها والحكم عليها من حيث الفكر وليس لأبي حامد الغزالي عند نازلة بحمد الله أكبر من هذه فإنه تكلم في ذات الله من حيث النظر الفكري في المضنون به على غير أهله وفي غيره ولذلك أخطأ في كل ما قاله وما أصاب وجاء أبو حامد وأمثاله في ذلك بأقصى غايات الجهل وبأبلغ مناقضة لما أعلمنا الله به من ذلك واحتاجوا لما أعطاهم الفكر خلاف ما وقع به الإعلام الإلهي إلى تأويل بعيد لينصروا جانب الفكر على جانب إعلام الله عن نفسه ما ينبغي أن ينسب إليه وكيف ينبغي أن ينسب إليه تعالى فما رأيت أحدا وقف موقف أدب في ذلك إلا خاض فيه على عماية إلا القليل من أهل الله لما سمعوا ما جاءت به رسله صلوات الله عليهم فيما وصف به نفسه وكلوا علم ذلك إليه ولم يتأولوا حتى أعطاهم الله الفهم فيه بإعلام آخر أنزله في قلوبهم فكانت المسألة منه تعالى وشرحها منه تعالى فعرفوه به لا بنظرهم فالله يجعلنا من الأدباء الأمناء الأتقياء الأبرياء الأخفياء الذين اصطفاهم الحق لنفسه وخبأهم في خزائن العادات في أحوالهم وفيه علم قول المبلغ عن الله تعالى قولا بلغه عن الله لو قاله عن نفسه على مجرى العرف فيه لكان رادا على نفسه بما\n\n\nادعاه أنه جاء به من عند الله فلما قاله عن أمر الله عرف بالأمر الإلهي معنى ذلك وهو قول الإنسان إذا أمر بالخير أحدا من خلق الله من سلطان أو غيره فيجني عليه ذلك الأمر بالخير ممن أمره به ضرارا في نفسه إما نفسيا وإما حسيا أو المجموع فإن الراد له والضار عليه استهان بالله وهو أشد ما يمشي على الداعي إلى الله لأنه على بصيرة من الله فيما دعا إليه من الخير فيقول عند ذلك ليتني ما دعوته إلى شي‏ء من هذا لما طرأ عليه من الضرر في ذلك فهي مزلة العارفين إذا قالوا مثل ذلك فإن الله يقول وقُلِ الْحَقُّ من رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ فإذا قالها العبد عن أمر الله مثل قوله تعالى إذ قال لنبيه عليه السلام قُلْ فأمره لَوْ شاءَ الله ما تَلَوْتُهُ عَلَيْكُمْ ولا أَدْراكُمْ به ولكنه شاء فتلوته عليكم وأدراكم به يقول فهمكم إياه فعلمتهم أنه الحق كما قال وجَحَدُوا بِها واسْتَيْقَنَتْها أَنْفُسُهُمْ فإذا قالها الوارث أو من قالها على هذا الحد فهو معرف معلم ما هو الأمر عليه ولهذا أمر الله بقول مثل هذا وكثير ما يقع من الناس العتب على أهل الله إذا أمروا بخير يعقبهم ذلك ضررا في أنفسهم محسوسا وذلك لا يقع من مؤمن ولا من قائل عن كشف فإن الرسول عليه السلام قيل له فَإِنَّما عَلَيْكَ الْبَلاغُ وقيل له بَلِّغْ ما أُنْزِلَ إِلَيْكَ وكذلك يجب على الوارث فكيف يصح منه الندم على فعل ما يجب عليه فعله لضرر قام به أو شفقة على من لم يسمع حيث زاد في شقائه لما أعلمه حين لم يصغ إلى ذلك وهذا كله حديث نفس والدين النصيحة لله ولرسوله ولأئمة المسلمين وعامتهم فلا يصرفنك عن ذلك صارف ولقد رأيت قوما ممن يدعي أنه من أهل هذا الشأن إذا رد عليهم في وجوههم ما جاءوا به عن الحق انقبضوا وقالوا فضولنا أدانا إلى ذلك ولو شاء الله ما تكلمنا بشي‏ء من هذا مع مثال هؤلاء ونحن جنينا على أنفسنا وقد تبنا وما نرجع نقول مثل هذا القول عند أمثال هؤلاء ويظهرون الندم على ذلك وهذا كله جهل منهم بالأمر ودليل قاطع على أنه ليس بمخبر عن الله ولا أوصل شيئا من ذلك عن إذن إلهي في ذلك فإن المخبر عن الله لا يرى في باطنه إلا النور الساطع سواء قبل قوله أو رد أو أوذى والمتكلم عن نفسه وإن قال الحق أعقبه إذا رد عليه ندم وضيق وحرج في نفسه وجعل كلامه فضولا فرد الحق الواجب فضولا فهذا جهل على جهل فالنصيحة لعباد الله واجبة على كل مؤمن بالله ولا يبالي ما\n\n\nيطرأ عليه من الذي ينصحه من الضرر فإن الله يقول في الورثة ويَقْتُلُونَ الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ من النَّاسِ وهذا القول عطف على قوله ويَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّ ذكر ذلك في معرض الثناء عليهم وذم الذين لم يصغوا إلى ما بلغ الرسول ولا الوارث إليهم وأية فرحة أعظم ممن يفرح بثناء الله عليه قُلْ بِفَضْلِ الله وبِرَحْمَتِهِ فَبِذلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ وفيه علم الصفات التي يتميز بها أهل الاستحقاق حتى يوفيهم حقوقهم من تعين ذلك عليه ومن الحقوق من يقتضي الثناء الجميل على من لا يوفيه حقه من ذلك كالمجرم المستحق للعذاب بأجرامه فيعفى عنه فهذا حق قد أبطل وهو محمود كما إن الغيبة حق وهي مذمومة ومن عرف هذا عرف الحق‏\nما هو وفرق بينه وبين الصدق وعلم عند ذلك أن الغيبة ليست بحق وأنها صدق ولهذا يسأل الصادق عن صدقه ولا يسأل ذو الحق إذا قام به فالغيبة والنميمة وأشباههما صدق لا حق إذ الحق ما وجب والصدق ما أخبر به على الوجه الذي هو عليه وقد يجب فيكون حقا وقد لا يجب ويكون صدقا لا حقا فلهذا يسأل الصادق عن صدقه إن كان وجب عليه نجا وإن كان لم يجب عليه بل منع من ذلك هلك فيه فمن علم الفرق بين الحق والصدق تعين عليه أن يتكلم في الاستحقاق وفيه علم ما ينتج من ذل لغير الله على إنزاله منه منزلة ربه جهلا منه به فإن ذل للصفة من غير اعتبار المحل كان له في ذلك الذي حكم آخر وفيه علم ما يحكم على الله وهو خير الحاكمين ومن هنا تعلم أن صفاته لو كانت زائدة على ذاته كما يقوله المتكلم من الأشاعرة لحكم على الذات ما هو زائد عليها ولا هو عينها وهذه مسألة زلت فيها أقدام كثيرين من العلماء وأضلهم فيها قياس الشاهد على الغائب أو طرد الدلالة شاهدا وغائبا وهذا غاية الغلط فإن الحكم على المحكوم عليه بأمر ما من غير أن يعلم ذات المحكوم عليه وحقيقته جهل عظيم من الحاكم عليه بذلك فلا تطرد الدلالة في نسبة أمر إلى شي‏ء من غير أن تعرف حقيقة ذلك المنسوب إليه وفيه علم إن الله لا يجوز لأحد من المخلوقين التحكم عليه ولو بلغ من المنزلة ما بلغ إلى أن يأمره بذلك فيحكم عليه بأمره فيما يجوز له أن يوجبه على نفسه إن كان من العالم بخلاف الحق فإن المكلف تحت الحجر فلو أوجب على نفسه فعل ما حرم عليه فعله لم يجز له ذلك وكان كفارة ما أوجبه كفارة يمين فلم يخل عن عقوبة وإن لم يفعل ما أوجبه إذ لم يجز له ذلك ولا كفارة على من أوجب على نفسه فعل ما أبيح له فعله ولا مندوحة له إلا أن يفعله ولا بد وفيه علم المكر الخفي وتعجيل الجزاء عليه وفيه علم موجب الاضطرار في الاختيار وما ينفع الاضطرار وفيه علم الأسباب التي تنسى العالم بأمر ما يقتضيه حكم ذلك العلم من العمل وهي كثيرة وفيه علم الحسرة وهو أن أحد لا يؤاخذه على ما جناه سوى ما جناه فهو الذي آخذ نفسه فلا يلومن إلا نفسه ومن اتقى مثل هذا فقد فاز فوزا عظيما وبهذا تقوم الحجة لله على خلقه وإنه إذا تكرم عليهم بعدم تسليطهم عليهم وعفا وغفر وجب له الثناء بصفة الكرم والإحسان وفيه علم دعوة الله عباده لما ذا يدعوهم هل إلى عمل ما كلفهم أو إلى ما ينتجه عمل ما كلفهم في الدار الآخرة وإن الله ما كلف عباده ولا دعاهم إلى تكليف قط بغير واسطة فإنه بالذات لا يدعو إلى ما فيه مشقة فلهذا اتخذ الرسل عليهم الصلاة والسلام وقال جل ثناؤه وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا وفيه علم الجزاء الوفاق وإذا أعطى ما هو خارج عن الجزاء فذلك من الاسم الواهب والوهاب وفيه علم العذاب المتخيل وفيه علم تذكر العالم ما كان نسيه إذ كان لم يعمل به فإن العامل بالعلم هو المنشئ صورته فمن المحال أن ينساه وفيه علم حسن التعليم إذ ما كل معلم يحسن التعليم وفيه علم التأسي بالله كيف يكون وهو المطلق في أفعاله وأنت المقيد وفيه علم البحث والحث على العمل بالأولى والأوجب وفيه علم الفرق بين العلم والظن أعني غلبة الظن وفيه علم العصمة والاعتصام وفيه علم ما يقال للمعاند إذا لم يرجع إلى الحق وهو ما يرجع إلى علم الإنصاف وفيه علم ما يعلم به إن أفعال العباد أفعال الحق لكن تضاف إلى العباد بوجه وإلى الحق بوجه فإن الإضافة في اللسان في اصطلاح النحاة محضة وغير محضة ومن الأفعال ما هي محضة لله إذا أضيفت إليه ومنها غير محضة لما فيها من الاشتراك فلم تخلص فالعبودية لله خالصة ومأمور بتخليصها كما قال تعالى وما أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ الدِّينَ وهو ما تعبدهم به وقوله قُلِ الله أَعْبُدُ مُخْلِصاً لَهُ دِينِي وهو ما تعبده به في هذا الموضع وقوله إِنَّ الله لا يَظْلِمُ النَّاسَ شَيْئاً كلمة تحقيق فإن الناس لا يملكون شيئا حتى يكون ما يأخذ منهم بغير وجه حق غاصبا فكل ما يقال فيه إنه ملك لهم فهو ملك لله ومن ذلك أعمالهم ثم قال ولكِنْ أَنْفُسَهُمْ يَظْلِمُونَ فكنى سبحانه عن نفسه بأنفسهم لما وقع الظلم في العالم وقيل به فكأنه قال ولكن نفسه يظلم إن كان هذا ظلما ولا بد والمالك لا يظلم نفسه في ملكه فلو كان ما عند الناس ملك لهم ما حجر الله عليهم التصرف فيه ولا حد لهم فيه حدودا متنوعة فهذا يدلك على إن أفعال المكلف ما هي له وإنما هي لله فالظلم إلى الحقيقة في الناس دعواهم فيما ليس لهم إنه لهم فما عاقبهم الله إلا على الدعوى الكاذبة وفيه علم إدراج الكثير في القليل حتى يقال فيه إنه قليل وهو كثير في نفس الأمر وفيه علم الآجال في الأشياء ومعنى قوله لا يَسْتَأْخِرُونَ ساعَةً ولا يَسْتَقْدِمُونَ على تلك الساعة\nوفيه علم من ادعى عليه بدعوى كاذبة يعلم المدعي عليه إن المدعي كاذب ولم يقم له بينة فوجب عليه اليمين فهو مأمور من الله بأن يحلف وليس له أن يرد اليمين على المدعي ولا أن ينكل عن اليمين فيعطيه ما ادعى عليه فيكون معينا له على ظلمه لنفسه وأنه في اليمين قد أحرز نفس صاحبه أن يتصرف فيما ظلمه فيه بما ادعاه فيستصحبه الإثم ما دام يتصرف فيه واليمين مانعة من ذلك ولم يبق على المدعي من الإثم إلا إثم اليمين خاصة فإن إثم كذبه في دعواه أزاله الحلف وعاد وبال الحلف الكاذب عليه فهو بمنزلة لو حلف كاذبا فيعود عليه إثم من حلف لو كان في يمينه كاذبا كرجل ادعى على رجل مثلا بمائة دينار وهو كاذب في دعواه ولم تقم له بينة تصدق دعواه فأوجب الحاكم اليمين على المدعى عليه فإن رد المدعي عليه اليمين على المدعي وكان الحاكم ممن يرى ذلك وإن كان لا يجوز عندنا فهذا المدعى عليه ما نصح المدعي وهو مأمور بالنصيحة فإن حلف المدعي بحكم القاضي فإن عليه إثم الحلف الفاجرة وعلى المدعى عليه إثم ظلمه للحالف فإنه الذي جعله يحلف وليس على الحاكم إثم فإنه مجتهد فغايته أن يكون مخطئا في اجتهاده فله أجر فإن قام المدعى عليه فأعطى المدعي ما ادعاه عليه تضاعف الإثم على المدعى عليه لأنه مكنه من التصرف في مال لا يحل له التصرف فيه ولا يزال الإثم على المدعي ما دام يتصرف في ذلك المال وفيما ينتجه ذلك المال ولا يزال الإثم على المدعى عليه كذلك من حيث إنه أعان أخاه على الظلم ولم يكن ينبغي له ذلك ومن حيث إنه عصى أمر الله بترك اليمين فإن الله أوجب اليمين عليه فلو حلف عمل بما أوجب الله عليه فكان مأجورا ونوى تخليص المدعي من التصرف في الظلم فله أجر ذلك ولم يبق على المدعي بيمين المدعى عليه إلا إثم يمينه خاصة فعلى المدعي إثم يمين كاذبة وهي اليمين الغموس وهذه مسألة في الشرع لطيفة لا ينظر إليها بهذا النظر إلا من استبرأ لدينه وكان من أهل الله فإنه يحب للناس ما يحب لنفسه فلا يعين أخاه على ظلم نفسه إذا أراد ذلك وفيه علم ما يذم من القدح وما يحمد وفيه علم المراقبة والحضور وإنهما من أبواب العصمة والحفظ الإلهي وتحصيل العلم النافع وفيه علم صفات أهل البشرى وأنواع المبشرات وحيث يكون وما يسوء منها وما يسر وفيه علم ما يظهر على من اعتز بالله من العزة والوقاية والحماية الإلهية وفيه علم من لم يعمل بما سمع مما يجب عليه العمل به ما سببه الذي منعه من ذلك وهل حكمه حكم من لم يسمع فيكون الله قد تفضل عليه أو يكون حكمه حكم من علم فلم يعمل فعاقبه الله فيكون الله قد عدل فيه فإنه يقول ولا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا فإنهم سمعوا حقيقة وفهموا فإنه خاطبهم بلسانهم فقال تعالى وهُمْ لا يَسْمَعُونَ أي حكمهم حكم من لم يسمع عندنا مع كونهم سمعوا وما قال تعالى بما ذا يحكم فيهم وإن كان غالب الأمر من قرائن الأحوال العقوبة ولكن الإمكان لا يرتفع في نفس الأمر لما يعرف من فضل الله وتجاوزه عن سيئات‏\n\n\nأمثال هؤلاء فافهم وفيه علم ما يعطي الله المتوكل في قلبه إذا توكل على الله حق توكله وفيه علم الخلافة الإلهية وفيه علم أسباب الطبع على القلوب المؤدي إلى الشقاء وفيه علم طلب إقامة البينة من المدعي ويتضمن هذا العلم قوله تعالى وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا ولم يقل حتى نبعث شخصا فلا بد أن تثبت رسالة المبعوث عند من وجه إليه فلا بد من إقامة الدلالة البينة الظاهرة عند كل شخص شخص ممن بعث إليهم فإنه رب آية يكون فيها من الغموض أو الاحتمال بحيث أن لا يدرك بعض الناس دلالتها فلا بد أن يكون للدليل من الوضوح عند كل من أقيم عليه حتى يثبت عنده أنه رسول وحينئذ إن جحد بعد ما تيقن تعينت المؤاخذة ففي هذه الآية رحمة عظيمة لما هو الخلق عليه من اختلاف الفطر المؤدي إلى اختلاف النظر وما فعل الله ذلك إلا رحمة بعباده لمن علم شمول الرحمة الإلهية التي أخبر الله تعالى أنها وَسِعَتْ كُلَّ شَيْ‏ءٍ وفيه‏\n\n\nعلم ما ينتجه الكرم وما ينتجه البخل وفيه علم رفع الإشكال في التلفظ بالإيمان حتى يعلم السامعون بأنه مؤمن علما لا يشكون فيه وهو المعبر عنه بالنصوص فإن الظاهر وإن كان ما يعلم بأول البديهة في الوضع ولكن يتطرق إليه الاحتمال وفيه علم من اعتنى الله به من عباده وفيه علم الخذلان وأهله وفيه علم ما يرجع إليه صاحب الحق إذا رد في وجهه وفيه علم أنواع الصبر في الصابرين والشكر في الشاكرين والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Seventy-Four: Concerning the Knowledge of the Station of Vision, the Antecedents of Things in the Lordly Presence, and that the Disbelievers have a Foot just as the Believers have a Foot, and the Arrival of Every Group upon its Foot, coming with its Imam, by Justice and Grace, from the Muhammadan Presence.\n\n> Whoever was in the darkness of the created worlds (al-akwan), for him was the ruling of Divine Providence (al-'Inaya), excluding all other creation.\n> And he attained the unveiling (kashf) of the veil of sense perception from the scriptures, and saw the All open in its proper place.\n> His conduct proceeds upon the clear Sunnah, witnessing The Real (al-Haqq) bound to its path.\n\n### [Indeed, Allah the Exalted made the Throne the locus of the Oneness of the Word]\n\nKnow—may Allah support you with Witnessing (al-Shahud) and make you among the People of Synthesis (al-Jam') and Existence (al-Wujud)—that when Allah the Exalted made the Throne (al-'Arsh) the locus of the Oneness (ahadiyya) of the Word (al-Kalima)—and He is The All-Merciful (al-Rahman) and none other—He created the Footstool (al-Kursi). In the Footstool, the Word divided into two matters, so that He might create pairs from everything, such that one of the pair is characterized by highness and the other by lowness, one by action and the other by passivity. Thus, the Evenness (al-Shafi'a) appeared from the Footstool through action, though it was potentially present in the single Word. This is so that it may be known that the First Existent, although singular in essence (al-'ayn) from the perspective of His Essence (Dhat), has the ruling of a relation (nisba) to what appeared of the world from Him. Thus, He is an Existent Essence and a Relation. This is the origin of the world’s Evenness. There must be a conceptual link (rabit ma'qul) between the Essence and the Relation so that the Essence accepts this Relation. The Singularity (al-Fardiyya) appeared through the conceptual nature of the link, making the Three the first of the Singularities, and there is no fourth in the origin. Thus, the Three is the first of the Singularities in number, extending infinitely, and the Evenness, expressed by the Two, is the first of the Pairs, extending infinitely in number. There is no pair (shaf') except that it is made singular (witr) by a One, thereby establishing the singularity of that pair. And there is no singular except that it is paired by a One, thereby establishing the evenness of that singular. The matter that pairs the singular and singularizes the pair is the Self-Sufficient (al-Ghani) Who holds the ruling and is not ruled over, Who is not in need but is needed.\n\nThe two Feet (al-Qadaman) descended to the Footstool when the Merciful Word divided within it. The Footstool itself is where the division of the Word appeared, because it is the second entity after the encompassing Throne, formed from the manifest bodies in the primordial substance (al-jawhar al-asl). They are two forms in the Universal Natural Body. The two Feet descended to it, and each Foot settled in a place that is not the place where the other settled, and this is the limit of their settlement. One place was named Hell (Jahannam) and the other Paradise (Janna). There is no place beyond them to which these two Feet can move. These two Feet draw sustenance only from the Origin from which they appeared, which is The All-Merciful (al-Rahman).\n\nTherefore, they grant nothing but Mercy, for the end returns to the origin by decree. However, between the beginning and the end there is a path (tariq) that distinguishes the beginning from the goal. Were it not for that path, there would be neither beginning nor goal. Thus, it was a journey (safar) for the descending command between them, and travel is a place of fatigue and misery (shaqa'). This is the reason for the appearance of misery in the world—in this life, the Hereafter, and the Isthmus (Barzakh). Upon the completion of the settlement, the staff of travel is cast down, and rest occurs in the Abode of Permanence (Dar al-Qarar) or the Abode of Perdition (Dar al-Bawar). If you say, \"Then rest should be found upon entering the Abode called Fire, but this is not the case,\" we reply: \"You speak truly, but you have only looked at the surface.\" This is because travelers are of two types: A traveler whose journey is like a residence due to the comfort he enjoys, being served and having all his needs met, carried in a litter upon the necks of men, protected from changing circumstances. His arrival at the destination is like the people of Paradise in Paradise. And a traveler who traverses the path on foot, with little provision and weak sustenance. When he reaches the destination, a residue of fatigue and hardship remains with him for a time until it departs, and then he finds rest. This is the likeness of those who are tormented and suffer in the Fire, which is their dwelling, and then are encompassed by the Mercy that <<WIDENED OVER EVERYTHING>>. And a traveler between the two, who has neither the luxury of the first nor the hardship of the second. He is between rest and fatigue. This is the group that exits the Fire through the intercession of intercessors and by the expulsion of the Most Merciful of the Merciful (Arham al-Rahimin). They are of various ranks, so among them are the advanced and the delayed, according to the amount of fatigue that remains with them, which gradually vanishes in the Fire. When his term ends, he exits to the place of rest, which is Paradise, either through the intercession of an intercessor or through the general expulsion, which is the expulsion by the Most Merciful of the Merciful.\n\nThe Prophets and the believers intercede for the People of Faith. The People of Faith are two groups: those who believe through contemplation and the acquisition of proof (dalil)—these are those who knew the signs, indications, and miracles, and these are the ones for whom the Prophets intercede; and those who believe through imitation (taqlid), based on what their parents gave them through upbringing, or the people of the house where they grew up—this type is interceded for by the believers, just as they gave them faith through upbringing in this world. As for the angels, they intercede for those who possessed noble character (makarim al-akhlaq) in this world, even if they were not believers. There is no fourth intercessor. There remains the group whom the Most Merciful of the Merciful expels—those who never did any good deed at all, neither through faith nor through noble character, except that Divine Providence (al-'Inaya) preceded for them that they should be among the people of that Abode.\n\nThe remaining people of this other Abode stay there. The doors of the Abode are closed and sealed, and despair of exit occurs. It is then that Mercy encompasses its people, because they have despaired of leaving it. They used to fear leaving it when they saw the expulsion by the Most Merciful of the Merciful, for God has made them upon a temperament (mizaj) suitable for the dweller of that Abode, and they would be harmed by exiting it, as we have explained. When they despaired, they rejoiced. This is the extent of their bliss, and it is the first bliss they find. Their state therein, after the period of misery is over, is as we presented: they find the torment sweet (yasta'dhibun al-'adhab), so the pains (al-alam) vanish, and the torment remains. This is why it is called torment ('adhab), because the outcome is that the one who experiences it finds it sweet, just as the one who has scabies finds scratching sweet. If one scratches without scabies or without the need arising from dryness affecting a part of his body, he is pained by the scratching. This is what the state of the temperament that affects the human being necessitates. Understand the bliss of every Abode, and you will be happy, God willing.\n\nDo you not see the truth of what we have said, that the Fire remains in pain due to the deficiency and lack of fullness within it, until the Almighty (al-Jabbar) places His Foot (qadam) in it? This is one of those two Feet mentioned in the Footstool (al-Kursi). The other Foot, whose resting place is Paradise, is referred to in His saying: <<AND GIVE GLAD TIDINGS TO THOSE WHO BELIEVE THAT FOR THEM IS A FOOT OF TRUTH (QADAM SIDQ) WITH THEIR LORD>>. Thus, the Name The Lord (al-Rabb) is with the former, and The Almighty (al-Jabbar) is with the latter, because [Hell] is the Abode of Majesty (Jalal), Compulsion (Jabarut), and Awe (Hayba), while Paradise is the Abode of Beauty (Jamal), Intimacy (Uns), and subtle Divine Descent (tanzul ilahi latif). The Foot of Truth is one of the two Feet of the Footstool, and they are two Graspings (Qabdatan): one for the Fire, and He cares not (la yubali), and the other for Paradise, and He cares not. This is because both ultimately return to Mercy, and thus He cares not about them. If the matter were as those without knowledge imagine—that the lack of caring implies indifference—then the seizing for crimes would not occur, nor would God describe Himself with Wrath (Ghadab), nor would there be severe punishment (al-Batsh al-Shadid). All of this stems from caring and concern for the one seized, for if he had no worth, he would not be punished or prepared for. It was said concerning the pious that Paradise <<HAS BEEN PREPARED FOR THE RIGHTEOUS (AL-MUTTAQIN)>>, and He said concerning the wretched, <<HE HAS PREPARED FOR THEM A PAINFUL TORMENT>>. Were it not for caring, this ruling would not have appeared.\n\nMatters and rulings have stations (mawatin); when their people know them, they do not apply every ruling beyond its station. By this, the knowledgeable person is distinguished from the ignorant. The knowledgeable person constantly maintains proper conduct (adab) with God and deals with Him in every station according to what The Real desires to be dealt with in that station. The ignorant person is not like that.\n\nBy the two Feet, He enriched and impoverished; by them, He caused death and gave life; by them, He populated and emptied; by them, <<HE CREATED THE TWO PAIRS, THE MALE AND THE FEMALE>>; by them, He humiliated and honored; He gave and withheld; He harmed and benefited. Were it not for them, nothing that occurred in the world would have occurred. Were it not for them, association (shirk) would not have appeared in the world, for the two Feet share the ruling over the world. Each one of them has an Abode over which it rules and people over whom it rules according to the ruling God wills, which we have alluded to in general and in detail. Rulings are like legal penalties (hudud); they change with the change of the cause necessitating them. The slanderer (muftari) is penalized with a limit that is not applied to him if he commits murder; rather, another limit takes over, different from the first, even though the slanderer is the same person as the murderer. The penalties changed for him due to the change in the cause necessitating them. Understand this. Likewise, the states of the Divine Rulings change due to the change in stations.\n\nThe Supreme Providence (al-'Inaya al-Kubra) that God has for the world is His establishment upon the Throne (al-'Arsh) that encompasses the world by His Name The All-Merciful (al-Rahman). To Him the whole matter returns. That is why He is the Most Merciful of the Merciful, for were it not for His Mercy, the merciful ones in the world would not be merciful; thus, His Mercy is prior.\n\nSince the two Feet express the polarity of the Divine Names—such as The First and The Last, The Manifest and The Hidden—their ruling appeared in the world in the realm of the Unseen and the Visible, Majesty (Jalal) and Beauty (Jamal), Nearness and Distance, Awe (Hayba) and Intimacy (Uns), Synthesis (Jam') and Separation (Farq), Concealment and Theophany (Tajalli), Absence and Presence, Contraction and Expansion, this world and the Hereafter, Paradise and the Fire. Just as through the One, every known thing had a uniqueness (ahadiyya) by which it is distinguished from others, so too from the Singularity (al-Fardiyya), which is the Three, appeared the ruling of the two extremes and the intermediary (al-Wasita), which is the Isthmus (Barzakh) and the thing that is between them, like hot, cold, and lukewarm. From the Singularity appeared the singular numbers, and from the Two appeared the pairs. Every number is either a pair or a singular, extending infinitely in multiplication, and the One always multiplies it. Thus, by the power of the One, what appeared of the ruling in number appeared, and the ruling belongs to God, the One, the Subduer (al-Qahhar). Were He not named by the opposites (al-Mutaqabilin), He would not be named The Subduer, because it is impossible for any creature to resist Him fundamentally. Therefore, He is only The Subduer in that He is named by the opposites. No one resists Him but Himself. He is The Honorer and The Humiliator, so the ruling of the Conqueror (al-Qahir) and the Conquered (al-Maqhur) occurs between the two Names by the appearance of one of the two rulings in the locus. Therefore, He is the One in that He is named The Subduer, in that He is named by the opposites, which are many, as we mentioned: The Giver of Life and The Giver of Death, The Harmer and The Benefiter, and the like.\n\nFrom these two Feet appeared in Prophethood the sent and the unsent, and among the believers, the believer through contemplation and the believer through imitation. Their ruling is continuous in the world. The matter has become clear to you, so the veil is not torn. Just as the pair rules you, so too does the singular rule you.\n\nAs for the knowledge of the Veil (al-Hijab) and Vision (al-Ru'ya), they are rulings of the two Feet. Although the ruling of Vision remains, its object is the Veil, so it sees the Veil, and its ruling has not ceased. There is no conqueror (qahir) or opponent to it, except that the seer has a goal (gharadh) related to a specific object. If his vision is not related to that object, the ruling of the Veil appears. Thus, the goal is the conquered, not the Vision.\n\nWhoever wishes to remove the ruling of subjugation (al-Qahr) from himself should accompany God without a goal or anticipation (tashawwuf). Rather, he should regard everything that occurs in the world and within himself as what is intended for him, finding pleasure in it and receiving it with acceptance, joy, and contentment (al-Rida). One whose state is this remains established in perpetual bliss, not characterized by humiliation or by being conquered, which would otherwise cause him pain. Rare is the possessor of this station, and I have not seen anyone who has tasted it, because the path to it is unknown. For the human being is never free, not for a single breath, from a seeking (talab) that he maintains for some matter. Since the reality of the human being is the appearance of seeking within him, let him make the object of his seeking unknown (majhulan), not specified, except from one perspective: that the object of his seeking be whatever God brings into existence in the world, either within himself or in others. Whatever his eye falls upon, or his ear hears, or he finds within himself, or someone deals with him—let that be the very object of his unknown seeking, specified for him by its occurrence. Thus, he fulfills the reality of his being a seeker, and he achieves pleasure in every occurrence, whether from him, in him, from others, or in others. If that occurrence necessitates change for him, he changes, because The Real demands change from him, and he is the seeker of the occurrence, and the change is the occurrence. He is not conquered in it; rather, he finds pleasure in his change, just as he finds pleasure in death for the sake of change.\n\nThere is no path to achieving this station except what we have mentioned. Therefore, we do not say, as the ignorant person said, seeking the impossible: \"I want not to want.\" Rather, the correct seeking, which the reality of the human being grants, is to say: \"I desire what You desire (uridu ma turid).\"\n\nAs for the general method for this, it is easy for the People of God (Ahl Allah). This is because a human being is never free from a state he is in, whether he maintains it by his own will or is placed in it against his will. A legal ruling (hukm shar'i) must apply to that state. He stops at the ruling of the Law, and thus wills what the Law willed, becoming characterized by the will for what the Law willed specifically. Thus, he retains no goal in a specific desired object. Likewise, the one who says that the servant should be with God without will is incorrect. Rather, it is correct if he says that the servant is one whose object of will is what The Real wills for him, since he is never free from will.\n\nWhoever seeks the vision of The Real by God's command is a servant obeying his Master's command. Whoever seeks the vision of The Real without God's command will inevitably suffer pain if he does not find what his will was attached to. He is the one who transgresses against himself. For the Creator of things, desires, and events rules and is not ruled over. Let the servant be with Him according to what He wills, for by this he achieves immediate rest (al-raha al-mu'ajjala) in this world.\n\nIt has been reported in Divine Sayings: \"O My servant, I desire and you desire, but only what I desire comes to pass.\" This is an alert to a remedy; if a person uses it, the pain we mentioned will vanish from him.\n\nFor this reason, it was reported in the Divine Sayings from Ka'b al-Ahbar that Allah the Exalted says: \"O son of Adam, if you are content with what I have allotted for you, I will grant rest to your heart and body, which is the locus of the servant's will, and you will be praised. But if you are not content with what I have allotted for you, I will set the world upon you so that you run in it like a wild beast in the wilderness. Then, by My Might and Majesty, you will not attain from it except what I have decreed for you, and you will be blamed.\"\n\nThis is also a remedy. As for His saying, <<AND YOU DO NOT WILL EXCEPT THAT ALLAH WILLS>>, this is consolation ('aza') that imparts knowledge, so that the servant may establish a ruling by it on the Day of Resurrection. It is an instruction of proof, and a mercy and grace from God.\n\n### [Seeking is Effort, and Vision is Grace]\n\nKnow that everything attained through effort (sa'aya) contains no grace (Imtinan), and seeking (al-Talab) is effort, while Vision (al-Ru'ya) is grace. Therefore, it is not correct to seek it. If Vision occurs as a result of seeking, it is not Vision in the true sense. The seeker's desired object from the Seen is to see Him as He truly is, but He only manifests (yatajalla) to him in the form of his knowledge of Him. If it were not so, he would deny Him. Thus, He only manifests to him in a form other than what he sought, and the Vision was an act of benevolence (ihsan), for what came to him was not the exact thing he sought, though he imagines it is. When he finds pleasure in what he saw and imagines it is his desired object, He then manifests to him without seeking. That Theophany (Tajalli) is also a Divine Grace, granting him knowledge of Him that he did not possess and that never crossed his mind.\n\nIf you understand what I have mentioned to you, you will know that the vision of God is not achieved by seeking, nor is it attained as a reward, as blessings are attained in the Gardens. This is a matter that, to my knowledge, no one among God's creation has pointed out except God, even though the Men of God (Rijal Allah) know it. They did not point it out because they imagined this matter was easily grasped and simple to attain, or because its occurrence is impossible—one of the two rulings must apply. For God did not make creation equal in the knowledge of Him, so there must be degrees of excellence among His servants in this regard.\n\nThe Mu'tazili denies Vision, and the Ash'ari permits it rationally and affirms it legally according to his contemplation. The Philosopher denies it rationally, as he has no footing in the Law and Faith. The People of God affirm it through Unveiling (Kashf) and Direct Experience (Dhawq), even if they had not affirmed it before the Unveiling, for the Unveiling would refute their previous state by granting them what prevents them from remaining as they were, unless they were already among those who affirm what the People of Unveiling brought. In that case, the state does not change for them except by the degree of difference between knowledge and the vision of the known object.\n\nKnow that God, from the perspective of His Self (Nafs), has the Oneness of the One (ahadiyyat al-Ahad), and from the perspective of His Names, He has the Oneness of Multiplicity (ahadiyyat al-Kathra).\n\n> Indeed, Allah is one God, and my proof is: <<SAY: HE IS ALLAH, [THE] ONE>>.\n> And if you wander in His Names, know that the wandering is due to the number (multiplicity).\n> The All returns to Him whenever the reader recites: Allah, the Eternal Refuge (al-Samad).\n> He has not begotten, truly, nor was He begotten, and there is none comparable to the God, not one.\n> The intellect is bewildered concerning Him when imagination (al-wahm) overcomes it with aid.\n> Then there comes to it a strengthening: Eternity without beginning (Azal) came in the Law, followed by Eternity without end (Abad).\n> And through us was the ruling for Him by it; and if we vanish, Existence (kawn) becomes singular.\n\nThis is the reason necessitating the seeking of His Theophany (Tajalli) in different forms and His transformation therein, due to the variation of beliefs in the world into this multiplicity. Thus, the origin of the difference in beliefs in the world is this multiplicity within the single Essence ('Ayn al-Wahida). This is why the people in the Station (al-Mawqif) denied Him when He appeared and said, \"I am your Lord.\" Had He manifested to them in the form in which He took the Covenant (al-Mithaq) from them, no one would have denied Him. After the denial occurred, He transformed for them into the form in which He took the Covenant from them, and they acknowledged Him because they recognized Him, and they have the privilege of their acknowledgment.\n\nAs for His Theophany upon the Dune (al-Kathib) for Vision, there He manifests in the forms of beliefs due to their differences in their ranks. They did not differ in the taking of the Covenant. That is the universal Theophany for Multiplicity. The Theophany upon the Dune is the general Theophany in Multiplicity. The Theophany that occurs from God to His servant while the servant is in his kingdom is the specific Theophany (al-Tajalli al-Khass), one for one.\n\nOur vision of Him on the Day of Stations in the Resurrection differs from our vision of Him at the taking of the Covenant, and differs from our vision of Him upon the Dune, and differs from our vision of Him while we are in our kingdom, in our palaces and with our families. From Him came the difference that He decreed upon us in the Glorious Quran in His saying, <<AND THEY WILL NOT CEASE TO DIFFER>>, and His saying, <<EXCEPT THOSE UPON WHOM YOUR LORD HAS BESTOWED MERCY>>. These are the ones who knew Him in difference and did not deny Him. They are the ones whom God informed of the Oneness of Multiplicity (ahadiyyat al-Kathra). These are the People of God and His elect. The merciful ones differed by this matter with which God distinguished them from other groups, and by this description, they entered the ruling of His saying, <<AND THEY WILL NOT CEASE TO DIFFER>>, because they differed from those others, and those others differed from them. The exception only granted us what we mentioned.\n\nThus, Glory be to Him, He was the first issue of dispute (khilaf) that appeared in the world, because the first thing every existent in the world looks at is the cause of its existence, for it knows within itself that it was not, and then came to be by its own contingency. Their natures differed concerning this, so they differed as to what the necessary cause for their appearance was. Therefore, The Real was the first issue of dispute in the world.\n\nSince the origin of dispute in the world lies in beliefs, and the cause is also the existence of every thing in the world upon a temperament (mizaj) that is not shared by the other thing, the outcome of all is Mercy, because He created them and manifested them in the Cloud ('Ama'), which is the very Breath of the All-Merciful (Nafs al-Rahman). They are like the letters in the breath of the speaker in the points of articulation, which are different. Likewise, the world differed in temperament and belief, despite its oneness as a contingent world. Do you not see that He named Himself The Director (al-Mudabbir) and The Detailer (al-Mufassil)? He said, exalted is His praise, <<HE DIRECTS THE MATTER, HE DETAILS THE SIGNS (AL-AYAT)>>. Everything we mentioned just now is the detailing of the signs in Him and in us, and an indication of Him and of us. Likewise, we are indications of Him and of us, for the greatest and clearest indication is the indication of a thing upon itself. The direction (al-tadabbur) from God is the very contemplation (al-tafakkur) in the thinkers among us, distinct from the direction that distinguishes parts of the world from others. Through contemplation, the world knew this, and the proof upon which it contemplated is the very thing it witnessed in itself and in others: <<WE SHALL SHOW THEM OUR SIGNS UPON THE HORIZONS AND WITHIN THEMSELVES UNTIL IT BECOMES CLEAR TO THEM THAT WHAT IS SEEN IS THE REAL>>.\n\n> Indeed, reflection (al-tadabbur) is like thought (al-fikr) concerning the contingent, but in the Guardian (al-Muhaymin) there is direction without contemplation.\n> So purify thought, for thought is ruinous; by it, distinction is made between Allah and humanity.\n\nRealize what we have presented in this chapter and what The Real has clarified in this station concerning the knowledge of Vision. You will benefit from this in this world, if you are among the People of Witnessing (al-Shahud), Synthesis (al-Jam'), and Existence (al-Wujud), and in the Hereafter, and you will be included in the category of those whom God excepted, as in His saying, <<EXCEPT THOSE UPON WHOM YOUR LORD HAS BESTOWED MERCY>>. The understanding of the common people regarding this differs from the understanding of God's elect and His People, who are the People of Remembrance (Ahl al-Dhikr), because they understood it according to God's intention therein, and that granted them the qualification.\n\nThere is an essence that synthesizes and an essence that separates in one single essence, whether in the side of The Real or the side of creation. <<AND ALLAH SPEAKS THE TRUTH, AND HE GUIDES TO THE WAY>>.\n\nIn this station of knowledge is the science of the types of revealed Books and the knowledge of each one according to the Name that indicates it. From there, you know the rank of that Book, even though every Name suitable for a Book is suitable for every Book, because it is the name of an Attribute therein. However, it was specified by that Name alone because the ruling of that Name is more complete in it than in other Names.\n\nLike his saying, peace and blessings be upon him: \"The best of you in judgment is Ali, the best of you in inheritance is Zayd, and the most knowledgeable of you concerning the lawful and the unlawful is Mu'adh ibn Jabal.\"\n\nWe have mentioned the Books and their Names in this work—meaning a part of that—in the Station of the Quran and in the book *Mawaqi' al-Nujum* (The Sites of the Stars) in the member of the tongue. When Allah the Exalted referred to what He revealed to us in the Glorious Quran, sometimes He referred to the essence of the Book, saying, <<THAT IS THE BOOK (DHALIKA AL-KITAB)>>, and sometimes He referred to its verses, saying, <<THOSE ARE THE VERSES OF THE BOOK (TILKA AYAT AL-KITAB)>>. Sometimes He omitted the reference and mentioned the Book without indication. For each of these rulings, we have a specific understanding that is necessary.\n\nIn it is the knowledge of the difference between magic (al-Sihr) and miracle (al-Mu'jiza). In it is the knowledge of what people have with God based on the attributes they maintain, by which one knows his station with his Lord. For God descends to His servant from the place where the servant places his Lord within himself. The servant placed himself lower than his Lord, so let him blame no one but himself if he sees the station of another surpassing the loftiness of his own station. This is the manifest loss (al-Khusran al-Mubin), since he was capable of that but did not do it. That is why the Day of Resurrection is called the Day of Mutual Loss (Yawm al-Taghabun), for it is the day of the unveiling of the veil, and the matters that occurred in the world become clear as to what they bore fruit there. The disbeliever, who is the ignorant one, will say, <<OH, I WISH I HAD SENT FORTH [GOOD DEEDS] FOR MY LIFE!>>, knowing that he was capable of it but did not do it. His torment is his regret and what he lost for himself, which is more severe for him than the external causes of torment. This is the Greater Torment (al-'Adhab al-Akbar).\n\nIn it is the knowledge of how to seek proof of God: whether by God, by the world, or by the relations within it. In it is the knowledge of the benefit of the difference in lights, such that some are revealing and some are burning. In it is the knowledge of the measures of temporal movements and the ruling of the Name Time (al-Dahr) over them, which is one of the Names of God the Exalted. In it is the knowledge of the difference in signs due to the difference in the attributes of those who look at them. In it is the knowledge of what is blameworthy in heedlessness (al-Ghafla) and what is praiseworthy. In it is the knowledge of the causes necessitating the outcome for the one affected by it in the Hereafter. In it is the knowledge of what the first human being spoke at his inception, which is *Al-Hamdu li-Llah* (Praise be to God), and it is <<THE LAST OF THEIR CALL IS: PRAISE BE TO GOD>>. Thus, the world began with praise and ended with praise. Where then is eternal misery? God forbid that His Wrath should precede His Mercy, for He is the Truthful, or that He should restrict the vastness of His Mercy after granting it the rank of universality.\n\nIn this regard, there is a story: Sahl ibn Abdullah met Iblis, and Iblis said to him in their debate, \"God the Exalted says, <<AND MY MERCY WIDENED OVER EVERYTHING (KULL SHAY')>>. *Kull* (all) gives universality, and *shay'* (thing) is the most indefinite of indefinites. Therefore, I do not cut off my despair from God's Mercy.\" Sahl said, \"I remained bewildered. Then I realized, in my estimation, that I should restrict it, so I said to him, 'O Iblis, God restricted it by His saying, <<SO I WILL DECREE IT (FASAAKTUBUHA)>>.'\" Iblis replied, \"O Sahl, restriction is your attribute, not His.\" I found no answer for him concerning that.\n\nIn it is the knowledge of what is praiseworthy in deliberation (al-Ta'anni) and hesitation, and what is blameworthy. And the knowledge of what is praiseworthy in haste in matters and what is blameworthy. In it is the knowledge of returning to God from compulsion (al-Qahr) if one returns to Him through benevolence (al-Ihsan). Are the two returns equal or unequal? This is a matter that has bewildered the People of God—meaning the return of necessity (al-Idtirar) and the return of choice (al-Ikhtiyar)—since choice contains a scent of Lordship (Rububiyya), while necessity is entirely servitude ('ubudiyya). This is the cause of the dispute over which of the two returns is more complete for the human being.\n\nIn it is the knowledge of lectures and debates in the assemblies of scholars among themselves, and that all of that is from the lectures of the Divine Names, some with others. Then this appeared in the Highest Assembly (al-Mala' al-A'la), where they dispute despite their preoccupation with God, and despite the fact that they, peace be upon them, are in their glorification (tasbih) without ceasing or tiring. Is their disputation part of their glorification, just as the Messenger of God, peace and blessings be upon him, remembered God in all his states, even while conversing with the Bedouins in their gatherings and with his family? Is all of that the remembrance of God or not?\n\nAs for the difference among those created from the temperaments (al-Taba'i'), it is not denied, because the temperaments are opposed. Everyone perceives that, and no one denies contention in the natural world, yet they deny it in what is above nature. As for the People of God, they do not deny contention in Existence (al-Wujud) at all, due to their knowledge of the Divine Names, and that they are in the form of the world. Rather, God brought the world into existence upon their form, because they are the origin, and in them are the opposite, the differing, the agreeing, and the assisting.\n\nIn it is the knowledge of the difference between one whose teacher is God, one whose teacher is his intellectual contemplation, and one whose teacher is a creature like himself. The one who relies on contemplation is attached to his teacher, and the one who relies on Divine Inspiration (ilqa' ilahi) is attached to his Teacher, especially in Divine Knowledge, which is truly known only by His informing. It is rare to attain it through Divine Informing, so how can it be attained through intellectual contemplation? For this reason, the Messenger of God, peace and blessings be upon him, forbade contemplation of the Divine Essence (Dhat Allah). People have been heedless of this matter, and none of them is safe from contemplating it and judging it based on thought. Abu Hamid al-Ghazali, may God be praised, has no greater calamity than this, for he spoke about the Divine Essence from the perspective of intellectual contemplation in *al-Madnun bihi 'ala ghayr ahlihi* (The Treasure Withheld from the Unqualified) and other works. Therefore, he erred in everything he said and did not succeed. Abu Hamid and his likes brought the utmost limits of ignorance in this matter and the most profound contradiction to what God informed us about it. When their thought gave them something contrary to Divine Informing, they resorted to far-fetched interpretation to support the side of thought over the side of God's informing about Himself—what should not be attributed to Him and how it should be attributed to Him, the Exalted.\n\nI have not seen anyone who stood in the station of proper conduct (adab) in this matter except that he plunged into it blindly, save for a few of the People of God. When they heard what His Messengers, peace and blessings be upon them, brought concerning how He described Himself, they entrusted the knowledge of that to Him and did not interpret, until God granted them understanding of it through another informing that He sent down into their hearts. Thus, the question was from Him, and its explanation was from Him. They knew Him by Him, not by their contemplation. May God make us among the well-mannered, the trustworthy, the pious, the innocent, the hidden ones whom The Real has chosen for Himself and concealed in the treasuries of customs in their states.\n\nIn it is the knowledge of the saying of the one who conveys a word from God—a word that, if he had said it about himself according to common usage, would have been a refutation of his claim that it came from God. But when he said it by God's command, the meaning of that was known through the Divine Command. This is like the saying of a person who commands someone to do good, whether a ruler or otherwise, and that command to do good causes harm to the one who commanded it, either psychological or physical, or both. The one who rejects him and harms him has belittled God. This is the most severe thing that can happen to the caller to God, because he is upon clear insight from God in what he called to of good. He then says, \"I wish I had not called him to any of this,\" due to the harm that befell him. This is a slippery slope for the Gnostics ('Arifin) if they say such a thing. For God says, <<SAY: THE TRUTH IS FROM YOUR LORD, SO LET HIM WHO WILL, BELIEVE, AND LET HIM WHO WILL, DISBELIEVE>>.\n\nIf the heir (al-Warith) or whoever says it says it according to this limit, he is a knowledgeable informant of the true state of affairs. For this reason, God commanded the saying of such a thing, like His saying when He commanded His Prophet, peace be upon him, to say: <<IF ALLAH HAD WISHED, I WOULD NOT HAVE RECITED IT TO YOU, NOR WOULD HE HAVE MADE IT KNOWN TO YOU>>. But He wished, so I recited it to you and made it known to you—meaning, He made you understand it, so you knew it was The Real, as He said, <<AND THEY REJECTED THEM WHILE THEIR SOULS WERE CONVINCED OF THEM>>.\n\nIf the servant says it by God's command, he is a knowledgeable informant of the true state of affairs. For this reason, people often blame the People of God when they command good that is followed by palpable harm to themselves. This does not occur from a believer or from one who speaks from Unveiling (Kashf). For the Messenger, peace be upon him, was told, <<YOUR DUTY IS ONLY THE CONVEYANCE>>, and he was told, <<CONVEY WHAT HAS BEEN REVEALED TO YOU>>. Likewise, it is incumbent upon the heir. How then can he regret doing what is incumbent upon him due to harm that befell him, or out of compassion for the one who did not listen, where his misery increased when he was informed but did not heed? All of this is a whisper of the soul (hadith nafs). Religion is sincere advice (al-Nasihah) to God, His Messenger, the leaders of the Muslims, and their common folk. Let no deterrent turn you away from that.\n\nI have seen people who claim to be among the People of this Station; when what they brought from The Real was rejected to their faces, they withdrew and said, \"Our superfluousness led us to this. If God had wished, we would not have spoken any of this in the presence of such people. We have transgressed against ourselves, and we have repented, and we will not return to saying such a thing in the presence of such people.\" They show regret for this. All of this is ignorance of the matter on their part and conclusive proof that they are neither informing on behalf of God nor conveying anything by Divine Permission (idhn ilahi) in that regard. For the one who informs on behalf of God sees nothing in his inner being but the shining light, whether his word is accepted or rejected, or whether he is harmed. The one who speaks from himself, even if he speaks the truth, is followed by regret, distress, and constraint in his soul if he is rejected, and he considers his speech superfluous, thus rejecting the obligatory truth as superfluous. This is ignorance upon ignorance.\n\nSincere advice to God's servants is obligatory upon every believer in God, and he should not care about the harm that may befall him from the one he advises. For God says concerning the heirs, <<AND THEY KILL THOSE WHO ENJOIN JUSTICE AMONG THE PEOPLE>>. This saying is an extension of His saying, <<AND THEY KILL THE PROPHETS WITHOUT RIGHT>>. He mentioned this in the context of praising them and blaming those who did not heed what the Messenger or the heir conveyed to them. What joy is greater than rejoicing in God's praise of him? <<SAY: IN THE GRACE OF ALLAH AND IN HIS MERCY—IN THAT LET THEM REJOICE; IT IS BETTER THAN WHAT THEY ACCUMULATE>>.\n\nIn it is the knowledge of the attributes by which the People of Entitlement (Ahl al-Istihqaq) are distinguished, so that those upon whom it is incumbent may fulfill their rights. Among the rights is that which necessitates beautiful praise for one who does not fulfill his right in that, such as the criminal who deserves punishment for his crimes but is forgiven. This is a right that has been nullified, yet it is praiseworthy. Just as backbiting (al-Ghiba) is a right (haqq) but is blameworthy. Whoever knows this knows what The Real (al-Haqq) is and distinguishes it from Truthfulness (al-Sidq). He knows then that backbiting is not a right, but it is truthfulness. For this reason, the truthful person is questioned about his truthfulness, but the possessor of a right is not questioned if he maintains it. Backbiting, slander (al-Namima), and their likes are truthfulness, not right, for right is what is obligatory, and truthfulness is what is reported exactly as it is. It may be obligatory, in which case it is a right, or it may not be obligatory, in which case it is truthfulness but not a right. Therefore, the truthful person is questioned about his truthfulness: if it was obligatory upon him, he is saved; if it was not obligatory, but forbidden, he perishes in it. Whoever knows the difference between right and truthfulness must speak concerning entitlement.\n\nIn it is the knowledge of the humiliation that results from humbling oneself to other than God, due to placing that other in the station of his Lord out of ignorance of Him. If he humbles himself to the attribute without considering the locus, he has another ruling in that.\n\nIn it is the knowledge of what rules God, and He is the Best of Rulers. From here, you learn that if His Attributes were additional to His Essence (Dhat), as the Ash'ari theologians say, then the Essence would be ruled by what is additional to it and not identical to it. This is a matter in which the feet of many scholars have slipped, and they were misled by comparing the witnessed (al-Shahid) to the unseen (al-Gha'ib), or by applying the indication universally to both witnessed and unseen. This is the height of error, for judging the judged by a matter without knowing the Essence and reality of the judged is a great ignorance on the part of the one judging it. Therefore, do not apply the indication universally in attributing a matter to a thing without knowing the reality of that to which it is attributed.\n\nIn it is the knowledge that it is not permissible for any creature to impose a ruling upon God, no matter how high his station, unless God commands him to do so. Then he rules Him by His command in what He permits him to make obligatory upon himself, if he is among the knowledgeable of the world. This is unlike The Real, for the obligated person is under restriction. If he makes obligatory upon himself an act that is forbidden to him, it is not permissible for him, and the expiation for what he made obligatory is the expiation of an oath, so he is not free from punishment, even if he does not perform what he made obligatory, since it was not permissible for him. There is no expiation for one who makes obligatory upon himself an act that is permissible for him, and he has no recourse but to perform it necessarily.\n\nIn it is the knowledge of subtle cunning (al-Makr al-Khafi) and the hastening of its recompense. In it is the knowledge of the necessity of compulsion (al-Idtirar) within choice (al-Ikhtiyar) and what necessity benefits. In it is the knowledge of the causes that make the knowledgeable person forget a matter necessitated by the ruling of that knowledge in terms of action, and these are many.\n\nIn it is the knowledge of regret (al-Hasra), which is that no one holds him accountable for what he committed except what he committed himself. He is the one who holds himself accountable, so let him blame no one but himself. Whoever guards against such a thing has achieved a great triumph. By this, the proof of God is established against His creation. If He honors them by not setting them upon themselves, and pardons and forgives, then praise is due to Him by the attribute of Generosity (al-Karam) and Benevolence (al-Ihsan).\n\nIn it is the knowledge of God's call to His servants: why does He call them? Is it to perform what He obligated them to do, or to what the performance of what He obligated them to do produces in the Hereafter? God never obligated His servants or called them to obligation without an intermediary, for by Essence, He does not call to what involves hardship. For this reason, He took Messengers, peace and blessings be upon them, and He said, exalted is His praise, <<AND NEVER WOULD WE PUNISH UNTIL WE HAD SENT A MESSENGER>>.\n\nIn it is the knowledge of the fitting recompense (al-Jaza' al-Wifaq). If He grants what is outside of recompense, that is from the Name The Giver (al-Wahib) and The Bestower (al-Wahhab). In it is the knowledge of imagined torment (al-'Adhab al-Mutakhayyal). In it is the knowledge of the knowledgeable person remembering what he had forgotten because he had not acted upon it, for the one who acts upon knowledge is the originator of its form, so it is impossible for him to forget it.\n\nIn it is the knowledge of good teaching, for not every teacher excels in teaching. In it is the knowledge of how to emulate God (al-Ta'assi bi-Llah): He is the Absolute in His actions, and you are the restricted. In it is the knowledge of research and the urging to act upon what is preferable and most obligatory. In it is the knowledge of the difference between knowledge and conjecture (al-Dhann)—meaning the predominance of conjecture. In it is the knowledge of infallibility ('Isma) and seeking protection (I'tisam). In it is the knowledge of what should be said to the obstinate person if he does not return to The Real, which returns to the knowledge of fairness (al-Insaf).\n\nIn it is the knowledge by which it is known that the actions of the servants are the actions of The Real, but they are attributed to the servants in one respect and to The Real in another. Attribution in language, according to the grammarians, is pure (mahda) and impure (ghayr mahda). Some actions are purely God's when attributed to Him, and some are impure due to the partnership involved, so they are not pure. Servitude ('Ubudiyya) is purely for God, and the servant is commanded to purify it, as the Exalted said, <<AND THEY WERE NOT COMMANDED EXCEPT TO WORSHIP ALLAH, SINCERELY DEDICATING THE RELIGION TO HIM>>. This is what He obligated them to worship Him with. And His saying, <<SAY: ALLAH I WORSHIP, SINCERELY DEDICATING MY RELIGION TO HIM>>. This is what he worships Him with in this context.\n\nAnd His saying, <<INDEED, ALLAH DOES NOT WRONG PEOPLE AT ALL>> is a word of verification, for people do not possess anything such that what is taken from them without right would be usurpation. Everything said to be their possession is God's possession, including their actions. Then He said, <<BUT IT IS THEMSELVES THEY WRONG>>. Glory be to Him, He alluded to Himself by their selves when wrong (al-Dhulm) occurred in the world and was spoken of. It is as if He said, \"But he wrongs his own self, if this is indeed wrong.\" The Owner does not wrong Himself in His possession. If what people possess were truly theirs, God would not restrict their disposal of it, nor would He set various limits for them therein. This indicates to you that the actions of the obligated person are not his, but God's. The true wrong among people is their claim that what is not theirs belongs to them. God only punishes them for the false claim.\n\nIn it is the knowledge of including the many in the few, such that it is called little while it is much in reality. In it is the knowledge of the appointed terms (al-Ajal) in things and the meaning of His saying, <<THEY CAN NEITHER POSTPONE IT FOR AN HOUR NOR ADVANCE IT>> beyond that hour.\n\nIn it is the knowledge concerning one against whom a false claim is made. The defendant knows that the claimant is lying, but the claimant has no evidence. The oath is incumbent upon the defendant. He is commanded by God to swear, and he is not permitted to return the oath to the claimant or to refuse the oath and give the claimant what he claimed, for that would be assisting him in his self-wrongdoing. By swearing the oath, he has protected the claimant's soul from disposing of what he wrongfully claimed, which would accompany the sin as long as he disposes of it. The oath prevents that. The claimant is only left with the sin of the oath itself, for the sin of his lie in his claim is removed by the oath, and the consequence of the false oath returns upon him. He is in the position of one who swore falsely. The sin of the one who swore falsely returns upon him.\n\nFor example, a man claims one hundred dinars from another, and he is lying in his claim, and he has no evidence to support his claim. The judge obligates the oath upon the defendant. If the defendant returns the oath to the claimant, and the judge is one who permits that (even though it is not permissible according to us), then this defendant has not given sincere advice (nasaha) to the claimant, and he is commanded to give sincere advice. If the claimant swears by the judge's ruling, then the claimant bears the sin of the false oath, and the defendant bears the sin of wronging the swearer, for he is the one who caused him to swear. The judge bears no sin, for he is an independent jurist (mujtahid), and at most, he is mistaken in his judgment, so he has a reward.\n\nIf the defendant then gives the claimant what he claimed, the sin upon the defendant is multiplied because he enabled the claimant to dispose of wealth that is unlawful for him to dispose of. The sin remains upon the claimant as long as he disposes of that wealth and what that wealth produces. The sin likewise remains upon the defendant because he assisted his brother in wrongdoing, which he should not have done, and because he disobeyed God's command by abandoning the oath, for God obligated the oath upon him. If he had sworn, he would have acted upon what God obligated him to do, and he would have been rewarded, intending to free the claimant from disposing of the wrongfully claimed wealth, and he would have been rewarded for that. The claimant would only be left with the sin of his oath alone due to the defendant's oath. Thus, the claimant bears the sin of a false oath, which is the oath of immersion (al-Yamin al-Ghamus). This is a subtle legal matter that is only viewed with this perspective by one who seeks to protect his religion and is among the People of God, for he loves for people what he loves for himself, and thus does not assist his brother in wronging himself if he intends that.\n\nIn it is the knowledge of what is blameworthy in disparagement (al-Qadh) and what is praiseworthy. In it is the knowledge of vigilance (al-Muraqaba) and presence (al-Hudhur), and that they are doors to infallibility ('Isma) and Divine Protection, and the acquisition of beneficial knowledge. In it is the knowledge of the attributes of the People of Glad Tidings (Ahl al-Bushra), the types of glad tidings, where they occur, and what is displeasing among them and what is pleasing. In it is the knowledge of what appears upon the one who seeks refuge in God: honor, protection, and Divine Safeguarding.\n\nIn it is the knowledge of the cause that prevented one who heard what was obligatory upon him from acting upon it. Is his ruling the same as one who did not hear, such that God has favored him? Or is his ruling the same as one who knew but did not act, such that God punished him justly? For He says, <<AND BE NOT LIKE THOSE WHO SAID, 'WE HAVE HEARD'>>. They truly heard and understood, for He addressed them in their own language. Then He said, <<WHILE THEY DO NOT HEAR>>—meaning, their ruling is like one who did not hear, in Our view, despite their having heard. He did not say what ruling He applies to them, although the prevailing circumstance suggests punishment. However, the possibility is not removed in reality, due to what is known of God's grace and His overlooking the misdeeds of such people. Understand this.\n\nIn it is the knowledge of what God grants the trusting servant in his heart if he truly trusts in God. In it is the knowledge of the Divine Vicegerency (al-Khilafa al-Ilahiyya). In it is the knowledge of the causes of the sealing of hearts (al-Tab' 'ala al-Qulub) that leads to misery. In it is the knowledge of demanding evidence from the claimant. This knowledge includes His saying, <<AND NEVER WOULD WE PUNISH UNTIL WE HAD SENT A MESSENGER>>. He did not say, \"until We had sent a person.\" The message of the sent one must be established with the one to whom he is sent. Therefore, the clear, manifest evidence must be established with every single person to whom they were sent. For perhaps a sign contains ambiguity or possibility such that some people do not grasp its indication. The proof must be clear to everyone against whom it is established, so that it is confirmed to him that he is a Messenger. Only then, if he denies after being certain, is accountability determined. In this verse is a great mercy, due to the difference in human natures that leads to differences in contemplation. God did not do that except out of mercy for His servants, for those who know the universality of Divine Mercy, which God informed us <<WIDENED OVER EVERYTHING>>.\n\nIn it is the knowledge of what generosity (al-Karam) produces and what stinginess (al-Bukhl) produces. In it is the knowledge of removing ambiguity in the utterance of faith, so that the listeners know without doubt that he is a believer. This is expressed by the explicit texts (al-Nusus), for although the apparent meaning is known at first glance in its context, possibility can still enter it. In it is the knowledge of those of His servants whom God cares for. In it is the knowledge of abandonment (al-Khidhlan) and its people. In it is the knowledge of what the possessor of a right returns to when he is rejected to his face. In it is the knowledge of the types of patience in the patient and gratitude in the grateful. <<AND ALLAH SPEAKS THE TRUTH, AND HE GUIDES TO THE WAY>>.",
    "ur": "\"باب نمبر تین سو چوہتر\" رؤیت (دیدار) کے مقام کی معرفت میں\n\nاور رؤیت (الرؤية) اور حضور ربانی (الحضرة الربية) میں اشیاء کی سبقت کی معرفت میں، اور یہ کہ کفار کے لیے بھی ایک قدم (قدم) ہے جیسا کہ مومنین کے لیے ہے، اور ہر گروہ کا اپنے قدم پر آنا اور اپنے امام کے ساتھ آنا، جو کہ حضور محمدیہ (الحضرة المحمدية) کی طرف سے عدل اور فضل ہے۔\n\nجو کوئی کائنات کی تاریکی میں تھا، اس کے لیے\nتمام مخلوق کے علاوہ عنایت کا حکم تھا۔\nاور اس نے حسی پردے کے کشف (الکشف) کو کتابوں سے حاصل کیا،\nاور ہر چیز کو اس کے مقام پر کھلا ہوا دیکھا۔\nوہ روشن سنت پر اپنی سیرت کو چلاتا ہے،\nوہ ذات حق (الحق) کو اس کے راستے سے جڑا ہوا دیکھتا ہے۔\n\n### [بے شک اللہ تعالیٰ نے عرش کو کلمہ کی احدیت کا محل بنایا]\n\nجان لو، اللہ تمہیں شہود (الشہود) سے تائید بخشے اور تمہیں جمع اور ہستی (الوجود) والوں میں شامل کرے، کہ جب اللہ تعالیٰ نے عرش (العرش) کو کلمہ (الکلمۃ) کی احدیت (أحدية) کا محل بنایا، اور وہ صرف رحمن ہے، اور کرسی (الکرسی) کو پیدا کیا، تو اس میں کلمہ دو امور میں تقسیم ہو گیا تاکہ ہر چیز سے دو جوڑے (زوجین) پیدا کرے، تاکہ ایک جوڑا علو (بلندی) سے متصف ہو اور دوسرا سفل (پستی) سے، ایک بالفعل (عمل میں) اور دوسرا بالانفعال (قبولیت میں)۔ پس کرسی سے شفیعہ (جوڑا پن) بالفعل ظاہر ہوئی، حالانکہ وہ ایک ہی کلمہ میں بالقوہ موجود تھی۔ تاکہ یہ معلوم ہو جائے کہ موجود اول (الموجود الأول) اگرچہ اپنی ذات کے اعتبار سے واحد العین ہے، لیکن اس کا ایک حکم نسبت (نسبة) کا بھی ہے اس عالم کی طرف جو اس سے ظاہر ہوا، پس وہ ایک وجودی ذات اور ایک نسبت ہے۔ یہی عالم کے جوڑے پن (شفيعة) کی اصل ہے۔ اور ذات (الذات) اور نسبت (النسبة) کے درمیان ایک معقول رابط (رابط معقول) کا ہونا ضروری ہے تاکہ ذات اس نسبت کو قبول کرے۔ پس فردیت (الفردية) رابط کی معقولیت سے ظاہر ہوئی، اور یوں تین (الثلاثة) پہلے افراد (الأفراد) بنے، اور اصل میں چوتھا نہیں ہے۔ پس تین عدد میں لامتناہی تک پہلے افراد ہیں، اور شفیعہ، جسے دو سے تعبیر کیا جاتا ہے، عدد میں لامتناہی تک پہلے ازواج (الأزواج) ہیں۔ کوئی شفع (جفت) ایسا نہیں جسے ایک طاق (وتر) نہ بنائے، جس سے اس شفع کی فردیت قائم ہو، اور کوئی فرد ایسا نہیں جسے ایک جفت نہ بنائے، جس سے اس فرد کی شفعیت قائم ہو۔ پس وہ امر جو فرد کو جفت بناتا ہے اور جفت کو طاق بناتا ہے، وہ غنی (الغني) ہے جس کا حکم چلتا ہے اور اس پر کوئی حکم نہیں چلتا، اور وہ محتاج نہیں ہوتا اور سب اس کے محتاج ہوتے ہیں۔\n\nپس دونوں قدم (القدمان) کرسی کی طرف لٹک گئے جب اس میں رحمانی کلمہ (الكلمة الرحمانية) تقسیم ہوا۔ کیونکہ کرسی بذات خود کلمہ کی تقسیم کا محل بنا، اس لیے کہ وہ عرش کے بعد دوسرا ہے جو اصل جوہر میں ظاہر ہونے والے اجسام کی صورتوں میں محیط ہے۔ اور وہ جسم کل طبیعی میں دو شکلیں ہیں۔ پس دونوں قدم اس کی طرف لٹک گئے، اور ہر قدم ایک ایسی جگہ میں ٹھہر گیا جو دوسری قدم کے ٹھہرنے کی جگہ نہیں تھی، اور یہی ان کے ٹھہرنے کی انتہا ہے۔ پس ایک جگہ کا نام جہنم (جهنم) رکھا گیا اور دوسری کا جنت (جنة)۔ اور ان کے بعد کوئی ایسی جگہ نہیں جہاں یہ دونوں قدم منتقل ہو سکیں۔ پس یہ دونوں قدم صرف اسی اصل سے مدد لیتے ہیں جس سے یہ ظاہر ہوئے ہیں، اور وہ رحمن ہے، لہٰذا یہ صرف رحمت ہی عطا کرتے ہیں۔ کیونکہ انجام حکم کے اعتبار سے اصل کی طرف لوٹتا ہے، مگر یہ کہ آغاز اور انجام کے درمیان ایک راستہ ہے جس نے اس راستے کو ابتدا اور انتہا کے درمیان ممتاز کر دیا۔ اور اگر وہ راستہ نہ ہوتا تو نہ ابتدا ہوتی اور نہ انتہا۔ پس یہ ان کے درمیان نازل ہونے والے امر کا سفر تھا، اور سفر تھکاوٹ اور بدبختی (الشقاء) کا مظنہ ہے۔ پس یہی وہ سبب ہے جس سے دنیا، آخرت اور برزخ میں بدبختی ظاہر ہوئی۔ اور جب ٹھہراؤ کی انتہا ہو جائے گی تو سفر کی لاٹھی پھینک دی جائے گی اور دار القرار (ٹھہرنے کی جگہ) اور دار البوار (تباہی کی جگہ) میں راحت نصیب ہو گی۔\n\nاگر تم کہو کہ جب ایک ہی گھر میں، جسے آگ (نار) کہا جاتا ہے، داخل ہو گئے تو راحت ملنی چاہیے تھی، مگر ایسا نہیں ہے، تو ہم کہیں گے کہ تم نے سچ کہا، لیکن تم نے غور نہیں کیا۔ وہ اس طرح کہ مسافر دو قسم کے ہوتے ہیں: ایک وہ جس کا سفر قیام کی طرح ہوتا ہے، اس آرام کی وجہ سے جو اسے حاصل ہوتا ہے، جیسے کہ وہ مخدوم ہو، اس کی تمام خواہشات پوری ہوں، اسے پالکی میں اٹھایا جائے، اور وہ موسمی تبدیلیوں سے محفوظ ہو۔ یہ شخص منزل پر پہنچنے میں جنت والوں کی طرح ہے جو جنت میں ہیں۔ اور دوسرا مسافر وہ ہے جو اپنے قدموں پر راستہ طے کرتا ہے، زادِ راہ کم ہو، اور سامانِ سفر کمزور ہو۔ جب وہ منزل پر پہنچتا ہے تو تھکاوٹ اور مشقت کی کچھ باقیات اس کے ساتھ رہتی ہیں یہاں تک کہ وہ دور ہو جائیں، پھر اسے راحت ملتی ہے۔ یہ اس شخص کی مثال ہے جو آگ میں عذاب اور مشقت اٹھاتا ہے، جو اس کی منزل ہے، پھر اسے وہ رحمت عام کر لیتی ہے جو:\n**وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ** (اور میری رحمت ہر چیز پر چھا گئی ہے)۔\nاور ایک مسافر ان دونوں کے درمیان ہے، جسے نہ جنت والے کا آرام حاصل ہے اور نہ جہنم والے کی سختی۔ پس وہ راحت اور تھکاوٹ کے درمیان ہے۔ یہ وہ گروہ ہے جو شفاعت کرنے والوں کی شفاعت سے اور ارحم الراحمین (سب سے زیادہ رحم کرنے والے) کے نکالنے سے آگ سے نکلے گا۔ اور وہ طبقات پر ہیں، اس لیے ان میں آگے بڑھنے والا اور پیچھے رہنے والا ہوتا ہے، اس قدر کے مطابق جتنی تھکاوٹ ان کے ساتھ باقی رہتی ہے، جو آگ میں آہستہ آہستہ زائل ہو جاتی ہے۔ جب ان کی مدت ختم ہو جاتی ہے تو وہ راحت کے محل یعنی جنت کی طرف نکل جاتے ہیں، یا تو کسی شفاعت کرنے والے کی شفاعت سے یا عام اخراج سے، جو ارحم الراحمین کا اخراج ہے۔\n\nپس انبیاء اور مومنین اہل ایمان کی شفاعت کریں گے، اور اہل ایمان دو گروہ ہیں: ایک وہ مومن جو نظر (غور و فکر) اور دلیل کے حصول سے ایمان لایا، اور یہ وہ لوگ ہیں جنہوں نے آیات، دلائل اور معجزات کو جانا، اور یہ وہ ہیں جن کی شفاعت انبیاء کریں گے۔ اور دوسرا وہ مومن جو تقلیداً ایمان لایا، اس وجہ سے کہ اس کے والدین نے اسے پالا یا اس گھر کے لوگوں نے جہاں وہ پلا بڑھا۔ اس قسم کی شفاعت مومنین کریں گے، جیسا کہ انہوں نے دنیا میں تربیت کے ذریعے انہیں ایمان دیا۔ اور جہاں تک فرشتوں کا تعلق ہے، وہ ان لوگوں کی شفاعت کریں گے جو دنیا میں مکارم الاخلاق (اچھے اخلاق) پر تھے، اگرچہ وہ مومن نہ ہوں۔ اور چوتھا کوئی شفاعت کرنے والا نہیں ہے۔ اور باقی وہ ہیں جنہیں ارحم الراحمین (سب سے زیادہ رحم کرنے والا) نکالے گا، اور وہ وہ لوگ ہیں جنہوں نے کبھی کوئی نیکی نہیں کی، نہ ایمان کی جہت سے اور نہ مکارم الاخلاق کے ذریعے، مگر یہ کہ ان کے لیے یہ عنایت (العناية) سبقت لے گئی تھی کہ وہ اس گھر (جہنم) کے اہل ہوں۔ اور اس دوسرے گھر (جہنم) کے اہل اس میں باقی رہیں گے، پس گھر کے دروازے بند کر دیے جائیں گے اور اوپر سے ڈھک دیے جائیں گے، اور نکلنے سے مایوسی ہو جائے گی۔ تب رحمت ان کے اہل کو عام کر لے گی، کیونکہ وہ اس سے نکلنے سے مایوس ہو چکے ہیں۔ کیونکہ وہ نکلنے سے ڈرتے تھے جب انہوں نے ارحم الراحمین کا نکالنا دیکھا، اور اللہ نے انہیں ایسے مزاج پر بنایا ہے جو اس گھر کے مکین کے لیے موزوں ہے اور اس سے نکلنے سے انہیں نقصان پہنچے گا، جیسا کہ ہم بیان کر چکے ہیں۔ پس جب وہ مایوس ہو جائیں گے تو خوش ہوں گے، اور یہ خوشی ان کی پہلی نعمت (نعیم) ہے جو وہ پائیں گے۔ اور ان کا حال اس میں وہی ہو گا جو ہم نے شقاوت کی مدت ختم ہونے کے بعد بیان کیا ہے، پس وہ عذاب کو شیریں سمجھیں گے (يستعذبون العذاب)، پس درد (الآلام) زائل ہو جائیں گے اور عذاب باقی رہے گا۔ اور اسی لیے اسے عذاب (عذاب) کہا گیا ہے، کیونکہ انجام کار اس کے لیے شیریں ہو جاتا ہے جو اس میں قائم ہو، جیسا کہ خارش والا شخص کھجلی کو میٹھا سمجھتا ہے۔ پس اگر وہ بغیر خارش کے یا کسی اور ضرورت کے، جیسے بدن پر خشکی طاری ہو، کھجائے تو اسے کھجلی سے تکلیف ہوتی ہے۔ اسی طرح یہ امر اس مزاج کے حال کا تقاضا کرتا ہے جو انسان کو لاحق ہوتا ہے۔ پس ہر گھر کی نعمت کو سمجھو، ان شاء اللہ تم کامیاب ہو جاؤ گے۔\n\nکیا تم نہیں دیکھتے کہ ہماری بات کتنی سچی ہے کہ آگ (نار) اپنے نقص اور عدم بھرنے کی وجہ سے ہمیشہ تکلیف میں رہے گی یہاں تک کہ جبار (الجبار) اس میں اپنا قدم (قدمه) رکھ دے، اور یہ ان دو قدموں میں سے ایک ہے جن کا ذکر کرسی (الکرسی) میں ہوا ہے۔ اور دوسرا قدم جس کا ٹھکانہ جنت ہے، اس کے بارے میں اللہ کا فرمان ہے:\n**وَبَشِّرِ الَّذِينَ آمَنُوا أَنَّ لَهُمْ قَدَمَ صِدْقٍ عِنْدَ رَبِّهِمْ** (اور ان لوگوں کو خوشخبری دو جو ایمان لائے ہیں کہ ان کے لیے ان کے رب کے پاس سچائی کا قدم [قدم صدق] ہے۔)\nپس اسم رب (الرب) ان لوگوں کے ساتھ ہے، اور جبار (الجبار) دوسروں کے ساتھ ہے، کیونکہ وہ (جہنم) جلال (جلال) اور جبروت (جبروت) اور ہیبت کا گھر ہے، اور جنت جمال (جمال) اور انس (أنس) اور لطیف الٰہی تنزل کا گھر ہے۔ پس قدم صدق (قدم صدق) کرسی کے دو قدموں میں سے ایک ہے، اور وہ دو مٹھیاں (قبضتان) ہیں، ایک آگ کے لیے اور وہ پرواہ نہیں کرتا (لا يبالي)، اور دوسری جنت کے لیے اور وہ پرواہ نہیں کرتا (لا يبالي)، کیونکہ وہ دونوں انجام کار رحمت کی طرف لوٹتے ہیں۔ اسی لیے وہ ان دونوں میں پرواہ نہیں کرتا۔ اور اگر معاملہ ایسا ہوتا جیسا کہ بے علم لوگ گمان کرتے ہیں کہ پرواہ نہ کرنا ہے، تو جرائم پر گرفت نہ ہوتی، اور نہ اللہ تعالیٰ اپنے آپ کو غضب (الغضب) سے متصف کرتا، اور نہ شدید پکڑ (البطش الشديد) ہوتی۔ یہ سب پرواہ کرنے (المبالاة) سے ہیں۔ اور متقیوں کے بارے میں کہا گیا ہے کہ جنت **أُعِدَّتْ لِلْمُتَّقِينَ** (متقیوں کے لیے تیار کی گئی ہے)، اور بدبختوں کے بارے میں فرمایا: **أَعَدَّ لَهُمْ عَذاباً أَلِيماً** (ان کے لیے دردناک عذاب تیار کیا ہے)۔ اگر پرواہ نہ ہوتی تو یہ حکم ظاہر نہ ہوتا۔ امور اور احکام کے مقامات ہوتے ہیں، جب ان کے اہل انہیں جان لیتے ہیں تو ہر حکم کو اس کے مقام سے تجاوز نہیں کرنے دیتے۔ اور اسی سے عالم غیر عالم سے پہچانا جاتا ہے۔ پس عالم ہمیشہ اللہ کے ساتھ ادب سے پیش آتا ہے اور ہر مقام پر اس کے ساتھ ویسا ہی معاملہ کرتا ہے جیسا ذات حق اس مقام پر اس سے معاملہ کرنا چاہتا ہے۔ اور جو نہیں جانتا وہ ایسا نہیں کرتا۔ پس دونوں قدموں سے ہی اس نے غنی کیا اور محتاج کیا، اور ان سے ہی مارا اور زندہ کیا، اور ان سے ہی آباد کیا اور ویران کیا، اور ان سے ہی **خَلَقَ الزَّوْجَيْنِ الذَّكَرَ وَالْأُنْثى** (دو جوڑے، نر اور مادہ پیدا کیے)، اور ان سے ہی ذلیل کیا اور عزت دی، اور عطا کیا اور روکا، اور نقصان پہنچایا اور نفع دیا۔ اور اگر یہ دونوں نہ ہوتے تو عالم میں جو کچھ ہوا وہ نہ ہوتا۔ اور اگر یہ دونوں نہ ہوتے تو عالم میں شرک (شرك) ظاہر نہ ہوتا، کیونکہ دونوں قدموں نے عالم میں حکم میں شرکت کی ہے۔ پس ان میں سے ہر ایک کے لیے ایک گھر ہے جس میں وہ حکم کرتا ہے، اور اہل ہیں جن میں وہ حکم کرتا ہے، جیسا اللہ نے چاہا، اور ہم نے اس کی طرف اور اس کی تفصیلات کی طرف اشارہ کیا ہے۔ کیونکہ احکام حدود کی طرح ہیں جو ان کے موجب کے بدلنے سے بدل جاتے ہیں۔ پس افترا (بہتان) میں حد لگنے والا اس حد پر قائم نہیں کیا جاتا جب وہ قتل کر دے، بلکہ اس پر اس کے خلاف دوسری حد جاری ہوتی ہے، حالانکہ افترا کرنے والا وہی قاتل ہے۔ پس اس پر حدود بدل گئیں کیونکہ ان کا موجب بدل گیا۔ پس سمجھو۔ اسی طرح الٰہی احکام کے احوال مقامات کے بدلنے سے بدل جاتے ہیں۔\n\nوہ بڑی عنایت (العناية الكبرى) جو اللہ کو عالم کے ساتھ ہے، وہ اس کا اپنے اسم رحمن (الرحمن) کے ساتھ عرش محیط (العرش المحيط) پر استواء (مستوی ہونا) ہے۔ اور اسی کی طرف تمام امر لوٹتا ہے، اور اسی لیے وہ ارحم الراحمین (سب سے زیادہ رحم کرنے والا) ہے۔ کیونکہ عالم میں رحم کرنے والے اگر اس کی رحمت نہ ہوتی تو رحم کرنے والے نہ ہوتے، پس اس کی رحمت سبقت لے جانے والی ہے۔ اور چونکہ دونوں قدم (القدمان) الٰہی اسماء کے تقابل (متقابل ہونے) کا اظہار ہیں، جیسے الاول اور الآخر، الظاہر اور الباطن، اور اسی طرح، تو ان سے عالم میں اس کا حکم ظاہر ہوا، عالم غیب اور شہادت میں، جلال اور جمال میں، قرب اور بعد میں، ہیبت اور انس میں، جمع اور فرق میں، ستر اور تجلی میں، غیبت اور حضور میں، قبض اور بسط میں، دنیا اور آخرت میں، اور جنت اور نار میں۔ جیسا کہ واحد (الواحد) سے ہر معلوم کے لیے ایک احدیت (أحدية) تھی جس سے وہ دوسرے سے ممتاز ہوتا ہے، اسی طرح فردیت (الفردية) یعنی تین سے دونوں اطراف اور واسطہ (برزخ) کا حکم ظاہر ہوا، اور وہ چیز جو ان دونوں کے درمیان ہے جیسے گرم اور ٹھنڈا اور نیم گرم۔ اور فردیت سے افراد ظاہر ہوئے، اور دو (الاثنين) سے ازواج ظاہر ہوئے، اور ہر عدد اس سے خالی نہیں کہ وہ جفت ہو یا طاق، اس میں لامتناہی تک تضعیف (دوگنا ہونا) ہوتا ہے، اور واحد اسے ہمیشہ دوگنا کرتا ہے۔ پس واحد کی قوت سے وہ حکم ظاہر ہوا جو عدد میں ظاہر ہوا، اور حکم اللہ الواحد القہار (یکتا، غالب) کا ہے۔ اگر وہ متقابلین (مخالف صفات) سے موسوم نہ ہوتا تو قہار (القہار) نہ کہلاتا، کیونکہ مخلوق کا اس کا مقابلہ کرنا محال ہے۔ پس وہ قہار نہیں ہے مگر اس حیثیت سے کہ وہ متقابلین سے موسوم ہے۔ پس کوئی دوسرا اس کا مقابلہ نہیں کرتا۔ پس وہ معز (عزت دینے والا) اور مذل (ذلت دینے والا) ہے۔ پس دونوں ناموں کے درمیان قاہر اور مقہور کا حکم واقع ہوتا ہے، محل میں ایک حکم کے ظاہر ہونے سے۔ اسی لیے وہ واحد ہے اس حیثیت سے کہ وہ قہار کہلاتا ہے، اس حیثیت سے کہ وہ متقابلین سے موسوم ہے، اور ایک نام کے حکم کا نافذ ہونا ضروری ہے۔ پس نافذ ہونے والا حکم ہی قاہر ہے۔ اور قہار اس حیثیت سے ہے کہ اس کے تقابل کے اسماء کثیر ہیں، جیسا کہ ہم نے ذکر کیا: محیی (زندہ کرنے والا) اور ممیت (مارنے والا)، ضار (نقصان دینے والا) اور نافع (نفع دینے والا) اور اسی طرح۔ اور ان دونوں قدموں سے نبوت میں مبعوث اور غیر مبعوث ظاہر ہوئے، اور مومنین میں نظر سے ایمان لانے والا اور بغیر نظر کے ایمان لانے والا۔ پس ان دونوں کا حکم عالم میں جاری ہے۔ پس تمہارے لیے امر واضح ہو گیا، پس پردہ نہ پھٹے، جیسا کہ جفت تم پر حکم کرتا ہے، ویسا ہی طاق تم پر حکم کرتا ہے۔\n\nاور حجاب (الحجاب) اور رؤیت (الرؤية) کی معرفت، اور یہ دونوں دونوں قدموں کے احکام میں سے ہیں، اگرچہ رؤیت کا حکم باقی ہے، مگر اس کا متعلق حجاب ہے، پس وہ حجاب کو دیکھتی ہے، لہٰذا اس کا حکم زائل نہیں ہوا۔ پس اس کے لیے کوئی قاہر (القاهر) یا مخالف نہیں ہے، مگر یہ کہ دیکھنے والے (الرائي) کا ایک خاص متعلق میں ایک غرض (غرض) ہوتا ہے، جب اس کی رؤیت اس سے متعلق نہیں ہوتی تو وہاں حجاب کا حکم ظاہر ہوتا ہے۔ پس غرض ہی مقہور (المقهور) ہے نہ کہ رؤیت۔ پس جو شخص قہر (القهر) کے حکم کو اپنے سے زائل کرنا چاہے، اسے چاہیے کہ وہ اللہ کی صحبت اختیار کرے بغیر کسی غرض اور توقع کے، بلکہ وہ ہر اس چیز کو جو عالم میں اور اپنے نفس میں واقع ہو، اسے اپنے لیے مراد سمجھے، اور اسے قبولیت، خوشی اور رضامندی (الرضي) سے حاصل کرے۔ پس جس کا یہ حال ہو گا وہ ہمیشہ دائمی نعمت (النعيم الدائم) میں مقیم رہے گا، نہ ذلت (الذلة) سے متصف ہو گا اور نہ مقہور ہونے سے، جس کی وجہ سے اسے تکلیفیں پہنچیں۔ اور اس مقام کا صاحب بہت کم یاب ہے، اور میں نے اس کا ذائقہ چکھنے والا کوئی نہیں دیکھا، کیونکہ وہ اس تک پہنچنے کا راستہ نہیں جانتا۔ کیونکہ انسان ایک لمحہ بھی کسی نہ کسی چیز کی طلب (طلب) سے خالی نہیں ہوتا۔ اور جب انسان کی حقیقت اس میں طلب کا ظاہر ہونا ہے، تو اسے چاہیے کہ اپنی طلب کا متعلق مجہول (مجهولا) رکھے، غیر متعین، سوائے ایک جہت کے، اور وہ یہ کہ اس کی طلب کا متعلق وہ ہو جو اللہ عالم میں یا اس کے نفس میں پیدا کرے۔ پس جس پر اس کی نظر پڑے یا جس سے اس کا کان متعلق ہو یا جو وہ اپنے نفس میں پائے یا کوئی اس کے ساتھ معاملہ کرے، تو وہ اس کی عین مطلوب ہو جو وقوع کے ذریعے اس کے لیے متعین ہو چکا ہے۔ پس وہ طالب ہونے کی حقیقت کو پورا کرے گا، اور اسے ہر واقع ہونے والی چیز سے لذت حاصل ہو گی، خواہ وہ اس سے ہو یا اس میں ہو یا کسی اور سے ہو یا کسی اور میں ہو۔ اگر وہ واقع اس کے لیے تبدیلی کا تقاضا کرے تو وہ بدل جائے گا، کیونکہ حق اس سے تبدیلی کا طالب ہے، اور وہ واقع کا طالب ہے، اور تبدیلی ہی واقع ہے، اور وہ اس میں مقہور نہیں ہے، بلکہ وہ تبدیلی میں بھی لذت پاتا ہے، جیسا کہ موت میں تبدیلی کے لیے لذت پاتا ہے۔ اور اس مقام کے حصول کا کوئی راستہ نہیں سوائے اس کے جو ہم نے ذکر کیا۔ پس ہم یہ نہیں کہیں گے جیسا کہ اس شخص نے کہا جو امر سے جاہل تھا اور محال کا طالب تھا، اور کہا کہ میں چاہتا ہوں کہ میں نہ چاہوں۔ بلکہ صحیح طلب جو انسان کی حقیقت عطا کرتی ہے وہ یہ ہے کہ وہ کہے: میں وہ چاہتا ہوں جو تو چاہتا ہے۔ اور جہاں تک اس کے عمومی طریقے کا تعلق ہے، تو وہ اہل اللہ کے لیے آسان ہے۔ وہ یہ کہ انسان کسی حال سے خالی نہیں ہوتا جس پر وہ قائم ہو، یا تو اپنی ارادہ (إرادة) سے یا کراہت (كره) سے کہ اسے بغیر ارادے کے اس میں قائم کیا جائے۔ اور اس حال پر کوئی شرعی حکم (حكم شرعي) کا تعلق ہونا ضروری ہے۔ پس وہ شرع کے حکم پر ٹھہرتا ہے اور وہی چاہتا ہے جو شرع نے چاہا، پس وہ خاص طور پر اس چیز کے ارادے سے متصف ہوتا ہے جو شرع نے چاہی، پس اس کے لیے کسی معین مراد میں کوئی غرض باقی نہیں رہتی۔ اور اسی طرح جس نے کہا کہ بندے کو اللہ کے ساتھ بغیر ارادہ (إرادة) کے ہونا چاہیے، یہ صحیح نہیں ہے، بلکہ صحیح یہ ہے کہ بندہ وہ ہے جس کی ارادہ کا متعلق وہ ہو جو حق اس کے لیے چاہتا ہے، کیونکہ وہ ارادے سے خالی نہیں ہو سکتا۔ پس جو شخص حق کی رؤیت (دیدار) کو حق کے حکم سے طلب کرے، وہ اپنے آقا کے حکم کی تعمیل کرنے والا بندہ ہے۔ اور جو حق کی رؤیت کو حق کے حکم کے بغیر طلب کرے، تو جب اسے وہ چیز نہ ملے جس سے اس کی ارادہ متعلق تھی، تو اسے لازماً تکلیف ہو گی۔ وہ اپنے نفس پر زیادتی کرنے والا ہے، کیونکہ اشیاء، مرادات اور حوادث کا خالق حکم کرتا ہے اور اس پر حکم نہیں کیا جاتا۔ پس بندے کو چاہیے کہ وہ اس کے ساتھ ویسا ہی ہو جیسا وہ چاہتا ہے، کیونکہ اس سے اسے دنیا میں فوری راحت حاصل ہو جائے گی۔ اور الٰہی اخبار میں آیا ہے:\n**يا عبدي أريد وتريد ولا يكون إلا ما أريد** (اے میرے بندے، میں چاہتا ہوں اور تو چاہتا ہے، اور ہوتا وہی ہے جو میں چاہتا ہوں۔)\nیہ اس دوا پر تنبیہ ہے کہ اگر انسان اسے استعمال کرے تو وہ تکلیف زائل ہو جائے گی جس کا ہم نے ذکر کیا۔\n\nاور اسی لیے کعب الاحبار سے الٰہیات میں آیا ہے کہ اللہ تعالیٰ فرماتا ہے:\n\"اے ابن آدم، اگر تو اس پر راضی ہو گیا جو میں نے تیرے لیے تقسیم کیا ہے تو میں تیرے دل اور تیرے بدن کو راحت دوں گا، اور یہ بندے کے ارادے کا مقام ہے، اور تو قابل تعریف ہو گا۔ اور اگر تو اس پر راضی نہ ہوا جو میں نے تیرے لیے تقسیم کیا ہے تو میں تجھ پر دنیا کو مسلط کر دوں گا یہاں تک کہ تو اس میں جنگلی جانور کی طرح دوڑے گا، پھر مجھے اپنی عزت اور جلال کی قسم، تجھے اس میں سے وہی ملے گا جو میں نے تیرے لیے مقدر کیا ہے، اور تو قابل مذمت ہو گا۔\"\nاور یہ بھی ایک دوا ہے۔ اور جہاں تک اللہ تعالیٰ کے فرمان **وَمَا تَشَاءُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ** (اور تم نہیں چاہتے مگر یہ کہ اللہ چاہے) کا تعلق ہے، تو یہ ایک تسلی (عزاء) ہے جس نے علم عطا کیا تاکہ بندہ اس سے قیامت میں ایک حکم ثابت کرے۔ پس یہ اللہ کی طرف سے تلقینِ حجت، رحمت اور فضل ہے۔\n\n### [طلب کوشش ہے اور رؤیت احسان ہے]\n\nاور جان لو کہ جو کچھ بھی کوشش (سعاية) سے حاصل ہوتا ہے، اس میں احسان (امتنان) نہیں ہوتا، اور طلب (الطلب) کوشش ہے، اور رؤیت (الرؤية) احسان ہے۔ پس اسے طلب کرنا صحیح نہیں ہے۔ پس اگر رؤیت طلب سے واقع ہو تو وہ حقیقی رؤیت نہیں ہے جو طلب سے حاصل ہوتی ہے۔ کیونکہ مرئی (جسے دیکھا جا رہا ہے) سے اس کا مطلوب صرف یہ ہے کہ وہ اسے ویسا ہی دیکھے جیسا وہ ہے، اور وہ اس پر تجلی (التجلی) نہیں کرتا مگر اس صورت میں جو اس کے علم میں ہے۔ کیونکہ اگر ایسا نہ ہو تو وہ اس کا انکار کر دے گا۔ پس اس پر تجلی نہیں ہوئی مگر اس چیز میں جو اس نے طلب نہیں کی تھی، پس رؤیت احسان (إحسانا) تھی۔ کیونکہ اسے عین وہ چیز نہیں ملی جو اس نے طلب کی تھی، اور وہ گمان کرتا ہے کہ یہ عین وہی ہے جو اس نے طلب کی تھی۔ پس جب اسے اس چیز سے لذت حاصل ہوئی جو اس نے دیکھی اور گمان کیا کہ یہ اس کا مطلوب ہے، تو اس کے بعد اس پر بغیر طلب کے تجلی ہوئی، پس وہ تجلی بھی ایک الٰہی احسان (امتنانا إلهيا) تھا جس نے اسے اس کے بارے میں وہ علم عطا کیا جو اس کے پاس نہیں تھا اور نہ اس کے وہم و گمان میں تھا۔\n\nپس اگر تم نے وہ سمجھ لیا جو میں نے تمہیں ذکر کیا، تو تم جان لو گے کہ اللہ کی رؤیت (رؤية الله) طلب سے نہیں ہوتی اور نہ وہ جزا کے طور پر حاصل ہوتی ہے جیسا کہ جنتوں میں نعمتیں حاصل ہوتی ہیں۔ اور یہ ایک ایسا مسئلہ ہے جس کے بارے میں میرے علم میں نہیں کہ اللہ کی مخلوق میں سے کسی نے اس پر تنبیہ کی ہو سوائے اللہ کے، حالانکہ اللہ کے رجال اسے جانتے ہیں، اور انہوں نے اس پر تنبیہ نہیں کی، یا تو اس گمان کی وجہ سے کہ یہ مسئلہ قریب الماخذ اور آسان الحصول ہے، یا اس کے محال ہونے کی وجہ سے۔ دونوں میں سے ایک حکم کا ہونا ضروری ہے۔ کیونکہ اللہ نے مخلوق کو اپنے علم میں برابر نہیں رکھا، پس اللہ کے بندوں کے درمیان اس میں تفاضل (برتری) ہونا ضروری ہے۔ پس معتزلی رؤیت کا انکار کرتا ہے، اور اشعری اسے عقلی طور پر جائز قرار دیتا ہے اور شرعی طور پر اپنے نظر کے تقاضے کے مطابق ثابت کرتا ہے، اور فلسفی عقلی طور پر اس کی نفی کرتا ہے کیونکہ اسے شرع اور ایمان میں کوئی قدم حاصل نہیں ہے۔ اور اہل اللہ اسے کشف (الکشف) اور ذوق (ذوقا) سے ثابت کرتے ہیں۔ اور اگر کشف سے پہلے وہ کچھ اور تھا، تو کشف اسے رد کر دیتا ہے، کیونکہ کشف اسے وہ عطا کرتا ہے جو اسے اس حال پر باقی نہیں رکھتا جس پر وہ پہلے تھا۔ سوائے اس کے کہ وہ ان لوگوں میں سے ہو جو اہل کشف کی باتوں کو مانتے ہیں، تو اس پر حال صرف علم اور معلوم کے دیدار کے درمیان کے فرق کے بقدر ہی بدلتا ہے۔ اور جان لو کہ اللہ اپنی ذات (نفسه) کے اعتبار سے احد کی احدیت (أحدية الأحد) رکھتا ہے، اور اپنے اسماء کے اعتبار سے کثرت کی احدیت (أحدية الكثرة) رکھتا ہے۔\n\n**إِنَّمَا اللَّهُ إِلَهٌ وَاحِدٌ** (بے شک اللہ ہی ایک معبود ہے)\nاور میری دلیل **قُلْ هُوَ اللَّهُ أَحَدٌ** (کہہ دو وہ اللہ ایک ہے) ہے۔\nپس جب تم اس کے اسماء میں حیران ہو جاؤ\nتو جان لو کہ یہ حیرانی عدد کی وجہ سے ہے۔\nجب بھی قاری **اللَّهُ الصَّمَدُ** (اللہ بے نیاز ہے) پڑھتا ہے\nتو سب اسی کی طرف لوٹتے ہیں۔\n**لَمْ يَلِدْ** (نہ اس نے جنا) حقاً **وَلَمْ يُولَدْ** (اور نہ وہ جنا گیا) اور\nکوئی بھی معبود کا ہمسر نہیں ہے۔\nپس عقل اس میں حیران ہو جاتی ہے جب\nوہم مدد کے ساتھ اس پر غالب آ جاتا ہے۔\nپھر اس کے پاس ازل کی مضبوطی آتی ہے\nجو شرع میں آئی ہے اور اس کے بعد ابد ہے۔\nاور ہمارے ذریعے ہی اس کے لیے حکم تھا،\nپس جب ہم زائل ہو جائیں گے تو کائنات تنہا ہو جائے گی۔\n\nاور یہی وہ سبب ہے جو اللہ تعالیٰ کے مختلف صورتوں میں تجلی (التجلی) اور ان میں تبدیل ہونے کا تقاضا کرتا ہے، عالم میں عقائد (المعتقدات) کے اس کثرت کی وجہ سے۔ پس عالم میں عقائد کے اختلاف کی اصل یہی کثرت ہے جو ایک ہی عین میں ہے۔ اور اسی لیے موقف (قیامت کے میدان) کے لوگوں نے اس وقت انکار کیا جب وہ ظاہر ہوا اور کہا: **أَنَا رَبُّكُمْ** (میں تمہارا رب ہوں)۔ اگر وہ ان پر اس صورت میں تجلی کرتا جس پر ان سے میثاق (عہد) لیا گیا تھا تو کوئی بھی انکار نہ کرتا۔ پس انکار واقع ہونے کے بعد وہ ان کے لیے اس صورت میں تبدیل ہوا جس پر ان سے میثاق لیا گیا تھا، تو انہوں نے اسے پہچان لیا اور اس کا اقرار کیا۔ اور ان کا اقرار ان کے لیے دلیل ہے۔ اور جہاں تک رؤیت کے لیے ٹیلے (الكثيب) پر اس کے تجلی کا تعلق ہے، تو وہاں وہ اعتقادات کی صورتوں میں تجلی کرے گا، ان کے مراتب میں اختلاف کی وجہ سے۔ اور میثاق لینے میں اختلاف نہیں ہوا تھا۔ پس وہ کثرت کے لیے عالم تجلی (التجلي العالم للكثرة) ہے۔ اور ٹیلے کا تجلی کثرت میں عام تجلی (التجلي العام في الكثرة) ہے۔ اور وہ تجلی جو اللہ کی طرف سے اپنے بندے پر ہوتا ہے جب وہ اپنی ملکیت میں ہوتا ہے، وہ واحد کے لیے خاص واحد تجلی (التجلي الخاص الواحد للواحد) ہے۔ پس قیامت کے دن مواقف میں ہمارا اسے دیکھنا، میثاق کے وقت ہمارے اسے دیکھنے سے مختلف ہو گا، اور ٹیلے پر ہمارے اسے دیکھنے سے مختلف ہو گا، اور ہمارے گھروں اور اہل و عیال میں ہمارے اسے دیکھنے سے مختلف ہو گا۔ پس اسی سے وہ اختلاف پیدا ہوا جس کا حکم ہم پر قرآن عزیز میں لگایا گیا ہے، اس کے فرمان میں:\n**وَلَا يَزَالُونَ مُخْتَلِفِينَ** (اور وہ ہمیشہ اختلاف کرتے رہیں گے)\nاور اس کا فرمان: **إِلَّا مَنْ رَحِمَ رَبُّكَ** (سوائے ان کے جن پر تیرے رب نے رحم کیا)۔\nپس وہ وہ لوگ ہیں جنہوں نے اسے اختلاف میں پہچانا اور اس کا انکار نہیں کیا، یہ وہ ہیں جنہیں اللہ نے کثرت کی احدیت (أحدية الكثرة) پر مطلع کیا۔ اور یہ اہل اللہ اور اس کے خاص بندے ہیں۔ پس مرحومین (جن پر رحم کیا گیا) نے اس امر میں اختلاف کیا جس کے ساتھ اللہ نے انہیں دوسرے گروہوں سے خاص کیا، پس وہ اس صفت کے ساتھ اس فرمان کے حکم میں داخل ہوئے: **وَلَا يَزَالُونَ مُخْتَلِفِينَ**، کیونکہ انہوں نے ان سے اختلاف کیا اور انہوں نے ان سے اختلاف کیا۔ پس استثناء نے ہمیں صرف وہی عطا کیا جو ہم نے ذکر کیا۔\n\nاور وہ سبحانہ و تعالیٰ عالم میں ظاہر ہونے والا پہلا اختلافی مسئلہ (مسألة خلاف) تھا، کیونکہ عالم میں ہر موجود سب سے پہلے اپنے وجود کے سبب پر غور کرتا ہے، کیونکہ وہ اپنے نفس میں جانتا ہے کہ وہ نہیں تھا پھر اپنے حدوث سے وجود میں آیا، اور ان کی فطرتیں (فطرهم) اس میں مختلف ہو گئیں، پس وہ اس سبب کے بارے میں مختلف ہو گئے جو ان کے ظہور کا موجب ہے۔ اسی لیے ذات حق عالم میں پہلا اختلافی مسئلہ تھا۔ اور چونکہ عالم میں اختلاف کی اصل عقائد (المعتقدات) میں تھی، اور سبب یہ بھی تھا کہ عالم کی ہر چیز ایک ایسے مزاج پر موجود ہوئی جو دوسری چیز کے لیے نہیں ہے۔ اسی لیے سب کا انجام رحمت کی طرف ہے، کیونکہ اس نے انہیں عماء (بادل) میں پیدا کیا اور ظاہر کیا، اور وہ نفس الرحمن (رحمن کا سانس) ہے۔ پس وہ متکلم کے نفس میں حروف کی طرح ہیں جو مخارج میں مختلف ہیں، اسی طرح عالم مزاج اور اعتقاد میں مختلف ہوا، باوجود اس کے کہ اس کی احدیت یہ ہے کہ وہ ایک حادث عالم ہے۔ کیا تم نہیں دیکھتے کہ اس نے اپنے آپ کو مدبر (تدبیر کرنے والا) اور مفصل (تفصیل دینے والا) کہا، پس فرمایا:\n**يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ** (وہ امر کی تدبیر کرتا ہے، وہ آیات کو تفصیل سے بیان کرتا ہے)۔\nاور جو کچھ ہم نے ابھی ذکر کیا وہ اس میں اور ہم میں آیات کی تفصیل ہے، اور اس پر اور ہم پر دلالت ہے۔ اور اسی طرح ہم بھی اس پر اور ہم پر دلائل ہیں۔ کیونکہ سب سے بڑی اور واضح دلالت کسی چیز کا اپنے آپ پر دلالت کرنا ہے۔ اور اللہ کی طرف سے تدبر (التدبر) ہم میں غور و فکر (التفكر) کا عین ہے۔ اور اس کی دلیل جس میں اس نے غور کیا، وہ عین وہی ہے جو اس نے اپنے نفس میں اور دوسروں میں مشاہدہ کیا:\n**سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّ ذَلِكَ الْمَرْئِيَّ هُوَ الْحَقُّ** (ہم انہیں اپنی نشانیاں آفاق میں اور ان کے نفوس میں دکھائیں گے، یہاں تک کہ ان پر واضح ہو جائے کہ وہ مرئی ہی حق ہے)۔\n\nبے شک تدبر (التدبر) حادث میں فکر کی مانند ہے،\nاور مہیمن (اللہ) میں تدبیر بغیر نظر کے ہے۔\nپس فکر کو خالص کرو، کیونکہ فکر ہلاکت ہے،\nاس سے اللہ اور بشر کے درمیان فرق کیا جاتا ہے۔\n\nپس اس باب میں جو کچھ ہم نے رؤیت (الرؤية) کے علم کے مقام میں پیش کیا ہے، اسے متحقق کرو۔ اگر تم اہل شہود (الشہود)، جمع (الجمع) اور وجود (الوجود) میں سے ہو تو تم اس سے دنیا میں اور آخرت میں نفع اٹھاؤ گے، اور تمہیں ان لوگوں کی لڑی میں شامل کیا جائے گا جنہیں اللہ نے مستثنیٰ کیا، جیسا کہ اس کا فرمان ہے: **إِلَّا مَنْ رَحِمَ رَبُّكَ** (سوائے ان کے جن پر تیرے رب نے رحم کیا)۔ کیونکہ عام لوگوں کی سمجھ اس میں اللہ کے خاص لوگوں اور اہل ذکر (أهل الذكر) کی سمجھ سے مختلف ہے۔ کیونکہ انہوں نے اسے اللہ کی مراد کے مطابق سمجھا، اور اس اہلیت نے انہیں یہ عطا کیا۔ پس ایک عین ہے جو جمع کرتی ہے اور ایک عین ہے جو فرق کرتی ہے، ایک ہی عین میں، خواہ وہ حق کے پہلو میں ہو یا خلق کے پہلو میں۔ اور اللہ **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔\n\nاور اس مقام میں علوم میں سے نازل شدہ کتابوں کی اقسام کا علم ہے، اور ان میں سے ہر ایک کا علم اس اسم کے مطابق ہے جو اس پر دلالت کرتا ہے، پس اسی سے اس کتاب کا مرتبہ معلوم ہوتا ہے، اگرچہ ہر کتاب کے لیے ہر اسم صالح ہے، کیونکہ وہ اس میں صفت کا اسم ہے، لیکن وہ اس اسم کے ساتھ خاص طور پر اس لیے مختص ہوا کہ اس میں اس کا حکم دوسروں کے مقابلے میں زیادہ مکمل ہے۔\nجیسا کہ آپ صلی اللہ علیہ وسلم کا فرمان ہے:\n**أقضاكم علي وأفرضكم زيد وأعلمكم بالحلال والحرام معاذ بن جبل** (تم میں سب سے زیادہ فیصلہ کرنے والے علی ہیں، اور سب سے زیادہ فرائض جاننے والے زید ہیں، اور حلال و حرام کے سب سے زیادہ عالم معاذ بن جبل ہیں۔)\nاور ہم نے اس کتاب میں کتابوں اور ان کے اسماء کا ذکر کیا ہے، یعنی اس کا ایک حصہ قرآن کے مقام میں اور کتاب *مواقع النجوم* میں عضو لسان (زبان) میں۔ کیونکہ اللہ تعالیٰ نے جب قرآن عزیز میں ہماری طرف اس چیز کی طرف اشارہ کیا جو اس نے ہم پر نازل کی، تو کبھی کتاب کی عین کی طرف اشارہ کیا، پس فرمایا: **ذَلِكَ الْكِتَابُ** (یہ وہ کتاب ہے)، اور کبھی اس کی آیات کی طرف اشارہ کیا، اور فرمایا: **تِلْكَ آيَاتُ الْكِتَابِ** (یہ کتاب کی آیات ہیں)، اور کبھی اشارہ ترک کر دیا اور بغیر اشارے کے کتاب کا ذکر کیا۔ اور ان میں سے ہر حکم کے لیے ہماری طرف سے ایک خاص سمجھ ہے جو ضروری ہے۔ اور اس میں سحر (السحر) اور معجزہ (المعجزة) کے درمیان فرق کا علم ہے، اور اس میں اس علم کا علم ہے کہ لوگوں کے لیے اللہ کے ہاں کیا ہے، ان صفات کے لحاظ سے جو ان میں قائم ہیں، پس اس سے وہ اپنے رب کے ہاں اپنا مرتبہ جانتا ہے۔ کیونکہ اللہ اپنے بندے پر وہاں سے نازل ہوتا ہے جہاں سے بندہ اپنے رب کو اپنے نفس سے نازل کرتا ہے۔ پس بندے نے اپنے رب سے اپنے نفس کو نازل کیا، پس وہ اپنے آپ کو ہی ملامت کرے اگر وہ دیکھے کہ دوسرے کا مرتبہ اس کے مرتبے سے زیادہ بلند ہے۔ یہی کھلا نقصان (الخسران المبين) ہے، جہاں وہ اس پر قادر تھا مگر اس نے نہیں کیا۔ اور اسی لیے قیامت کے دن کو **يَوْمُ التَّغَابُنِ** (نقصان اٹھانے کا دن) کہا جاتا ہے، کیونکہ یہ پردہ اٹھنے کا دن ہے، اور دنیا میں واقع ہونے والے امور کا ثمرہ وہاں ظاہر ہو جاتا ہے۔ پس کافر، جو جاہل ہے، کہے گا: **يَا لَيْتَنِي قَدَّمْتُ لِحَيَاتِي** (اے کاش میں نے اپنی زندگی کے لیے کچھ آگے بھیجا ہوتا)، کیونکہ وہ جانتا ہے کہ وہ اس پر قادر تھا مگر اس نے نہیں کیا۔ پس اس کا عذاب اس کی ندامت ہے، اور جو نقصان اس نے اپنے نفس کو پہنچایا وہ باہر کے عذاب کے اسباب سے زیادہ شدید ہے۔ اور یہی عذاب اکبر (سب سے بڑا عذاب) ہے۔ اور اس میں اللہ پر استدلال کا علم ہے کہ وہ کس چیز سے ہو گا، کیا اللہ سے یا عالم سے یا ان نسبتوں سے جو اس میں ہیں؟ اور اس میں انوار کے اختلاف کا فائدہ ہے، یہاں تک کہ ان میں سے کچھ کشف کرنے والے ہیں اور کچھ جلانے والے ہیں۔ اور اس میں زمانی حرکات (الحركات الزمانية) کی مقداروں کا علم ہے اور ان پر اسم دہر (الدهر) کا حکم ہے، اور وہ اللہ کے اسماء میں سے ایک اسم ہے۔ اور اس میں دیکھنے والوں کی صفات کے اختلاف کی وجہ سے آیات کے اختلاف کا علم ہے۔ اور اس میں غفلت (الغفلة) میں سے کیا مذموم ہے اور کیا محمود، اس کا علم ہے۔ اور اس میں ان اسباب کا علم ہے جو اس چیز کا موجب بنتے ہیں جس کی طرف وہ شخص لوٹتا ہے جس پر آخرت میں اس کا اثر پڑا ہے۔ اور اس میں اس بات کا علم ہے جو پہلے انسان نے اپنے نشو و نما میں سب سے پہلے کہی، اور وہ الحمد للہ ہے، اور یہی ان کی آخری دعا ہے: **آخِرُ دَعْوَاهُمْ أَنِ الْحَمْدُ لِلَّهِ** (اور ان کی آخری دعا یہ ہو گی کہ تمام تعریفیں اللہ کے لیے ہیں)۔ پس عالم نے ثناء سے آغاز کیا اور ثناء پر ختم کیا۔ پس دائمی بدبختی (الشقاء السرمد) کہاں ہے؟ اللہ کی پناہ کہ اس کا غضب اس کی رحمت پر سبقت لے جائے، وہ سچا ہے، یا وہ اپنی رحمت کی وسعت کو خاص کر دے، جب کہ اس نے اسے عموم کا مرتبہ عطا کیا ہے۔\n\nاس بارے میں ایک حکایت: سہل بن عبداللہ کی ملاقات ابلیس سے ہوئی، تو ابلیس نے اس سے مناظرہ میں کہا کہ اللہ تعالیٰ فرماتا ہے: **وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ** (اور میری رحمت ہر چیز پر چھا گئی ہے)، اور \"کل\" عموم کا معنی دیتا ہے، اور \"شیء\" نکرہ میں سب سے زیادہ نکرہ ہے، پس میں اللہ کی رحمت سے اپنی مایوسی کو قطع نہیں کرتا۔ سہل نے کہا: تو میں حیران رہ گیا، پھر میں نے اپنے گمان میں اسے مقید کرنے کی طرف توجہ دی، پس میں نے اس سے کہا: اے ابلیس، اللہ نے اسے اپنے اس قول سے مقید کر دیا ہے: **فَسَأَكْتُبُهَا لِلَّذِينَ يَتَّقُونَ** (پس میں اسے ان لوگوں کے لیے لکھ دوں گا جو پرہیزگاری اختیار کرتے ہیں)۔ اس نے مجھ سے کہا: اے سہل، تقیید (قید لگانا) تیری صفت ہے نہ کہ اس کی صفت۔ پس مجھے اس کا کوئی جواب نہ ملا۔\n\nاور اس میں اس علم کا علم ہے کہ تأنی (آہستگی) اور تثبط (سستی) میں سے کیا محمود ہے اور کیا مذموم، اور امور میں جلد بازی (العجلة) میں سے کیا محمود ہے اور کیا مذموم۔ اور اس میں قہر (القهر) کے ذریعے اللہ کی طرف رجوع کرنے کا علم ہے، جب اس جیسا کوئی احسان (الإحسان) کے ذریعے اس کی طرف رجوع کرے۔ اور کیا دونوں رجوع برابر ہیں یا نہیں؟ اور یہ ایک ایسا مسئلہ ہے جس میں اہل اللہ حیران ہوئے ہیں، یعنی اضطرار (مجبوری) کے رجوع اور اختیار (اختیاری) کے رجوع میں، کیونکہ اختیار میں ربوبیت کی بو ہے، اور اضطرار مکمل طور پر عبودیت ہے۔ پس یہی اس اختلاف کا سبب ہے کہ انسان کے حق میں کون سا رجوع زیادہ مکمل ہے۔ اور اس میں علماء کی مجالس میں ان کے درمیان ہونے والے محاضرات اور مناظرات کا علم ہے، اور یہ سب الٰہی اسماء کے ایک دوسرے کے ساتھ محاضرات سے ہیں۔ پھر یہ ملأ اعلیٰ میں ظاہر ہوا جب وہ اللہ کے کام میں مشغول ہونے کے باوجود جھگڑتے ہیں، اور وہ علیہم السلام اپنی تسبیح میں نہ تھکتے ہیں اور نہ اکتاہٹ محسوس کرتے ہیں۔ پس کیا ان کا جھگڑنا ان کی تسبیح میں سے ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم ہر حال میں اللہ کا ذکر کرتے تھے، باوجود اس کے کہ وہ اعراب کے ساتھ اپنی مجلسوں میں اور اپنے اہل کے ساتھ گفتگو کرتے تھے؟ پس کیا یہ سب اللہ کا ذکر ہے یا نہیں؟ اور جہاں تک طبائع سے پیدا ہونے والوں کے اختلاف کا تعلق ہے تو وہ غیر منکور ہے، کیونکہ طبائع متضاد ہیں۔ پس ہر کوئی اسے جانتا ہے، اور وہ عالم طبیعت میں جھگڑے کا انکار نہیں کرتا، اور طبیعت سے اوپر اس کا انکار کرتے ہیں۔ اور اہل اللہ وجود میں جھگڑے کا بالکل انکار نہیں کرتے، کیونکہ وہ الٰہی اسماء کو جانتے ہیں، اور یہ کہ وہ عالم کی صورت پر ہیں، بلکہ اللہ نے عالم کو ان کی صورت پر پیدا کیا، کیونکہ وہ اصل ہیں، اور ان میں متقابل، مخالف، موافق اور مددگار موجود ہیں۔ اور اس میں اس شخص کے درمیان فرق کا علم ہے جس کا معلم اللہ ہو، اور جس کا معلم اس کا فکری نظر ہو، اور جس کا معلم اس جیسا مخلوق ہو۔ پس صاحب نظر اپنے معلم سے ملحق ہوتا ہے، اور صاحب الٰہی القاء اپنے معلم سے ملحق ہوتا ہے، خاص طور پر علم الٰہی میں جو حقیقت میں اس کے بتانے کے بغیر نہیں جانا جاتا۔ کیونکہ الٰہی اعلام سے اسے پانا مشکل ہے، تو فکری نظر سے کیسے پایا جا سکتا ہے؟ اور اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے ذات اللہ میں غور و فکر (التفكر) کرنے سے منع فرمایا ہے۔ اور لوگ اس قدر سے غافل ہو گئے ہیں، پس ان میں سے کوئی بھی اس میں غور و فکر کرنے اور فکر کی رو سے اس پر حکم لگانے سے محفوظ نہیں رہا۔ اور ابو حامد الغزالی کے پاس بحمد اللہ اس سے بڑی کوئی مصیبت نہیں ہے، کیونکہ اس نے ذات اللہ کے بارے میں فکری نظر (النظر الفكري) سے بات کی، *المضنون به على غير أهله* میں اور اس کے علاوہ میں۔ اور اسی لیے اس نے جو کچھ کہا اس میں غلطی کی اور درست نہیں کہا۔ اور ابو حامد اور اس جیسے لوگ اس میں جہالت کی انتہا اور اس چیز کی مکمل مخالفت لائے جس کی اللہ نے ہمیں خبر دی ہے۔ اور انہیں اس بات کی ضرورت پڑی کہ جو کچھ فکر نے انہیں عطا کیا وہ الٰہی اعلام کے خلاف تھا، تو انہوں نے دور کی تاویل کی تاکہ وہ فکر کے پہلو کو اللہ کے اس اعلام کے پہلو پر غالب کر سکیں کہ اس کی طرف کیا منسوب کرنا چاہیے اور کیسے منسوب کرنا چاہیے۔ پس میں نے کسی کو نہیں دیکھا جو اس میں ادب کے مقام پر ٹھہرا ہو، مگر یہ کہ اس نے اندھے پن میں اس میں قدم رکھا، سوائے اہل اللہ میں سے تھوڑے سے لوگوں کے، جب انہوں نے وہ سنا جو اس کے رسولوں (صلوات اللہ علیہم) نے اس کے بارے میں لایا جس سے اس نے اپنے آپ کو متصف کیا، تو انہوں نے اس کا علم اسی کے سپرد کر دیا اور تاویل نہیں کی، یہاں تک کہ اللہ نے انہیں اس میں ایک دوسرے اعلام کے ذریعے سمجھ عطا کی جو اس نے ان کے دلوں میں نازل کیا، پس مسئلہ بھی اسی کی طرف سے تھا اور اس کی شرح بھی اسی کی طرف سے، پس انہوں نے اسے اس کے ذریعے پہچانا نہ کہ اپنی نظر سے۔ اللہ ہمیں ان باادب، امانت دار، متقی، بے گناہ، پوشیدہ لوگوں میں شامل کرے جنہیں حق نے اپنے لیے چن لیا اور انہیں ان کے احوال میں عادات کے خزانوں میں چھپا دیا۔\n\nاور اس میں اللہ کی طرف سے تبلیغ کرنے والے کے اس قول کا علم ہے کہ اگر وہ اسے اپنے بارے میں کہتا تو وہ اس چیز کی تردید کرتا جو اس نے دعویٰ کیا کہ وہ اللہ کی طرف سے لایا ہے، لیکن جب اس نے اسے اللہ کے حکم سے کہا تو اس کا معنی الٰہی امر سے پہچانا گیا۔ اور وہ یہ ہے کہ جب انسان اللہ کی مخلوق میں سے کسی کو، خواہ وہ سلطان ہو یا کوئی اور، نیکی کا حکم دے، اور وہ نیکی کا حکم دینے والا اس شخص کی طرف سے جس کو حکم دیا گیا، اپنے نفس میں یا حسی طور پر یا مجموعی طور پر نقصان (ضرار) اٹھائے۔ پس اس کو رد کرنے والا اور نقصان پہنچانے والا اللہ کی توہین کرنے والا ہے۔ اور یہ داعی الی اللہ پر سب سے زیادہ شدید ہوتا ہے، کیونکہ وہ اللہ کی طرف سے بصیرت پر تھا جس کی طرف اس نے نیکی کی دعوت دی۔ پس وہ اس وقت کہتا ہے: کاش میں نے اسے اس میں سے کسی چیز کی دعوت نہ دی ہوتی، اس نقصان کی وجہ سے جو اسے اس میں پہنچا۔ پس یہ عارفین (العارفين) کے لیے پھسلنے کی جگہ ہے اگر وہ ایسا کہیں۔ کیونکہ اللہ فرماتا ہے:\n**وَقُلِ الْحَقُّ مِنْ رَبِّكُمْ فَمَنْ شَاءَ فَلْيُؤْمِنْ وَمَنْ شَاءَ فَلْيَكْفُرْ** (اور کہہ دو کہ حق تمہارے رب کی طرف سے ہے، پس جو چاہے ایمان لائے اور جو چاہے کفر کرے۔)\nپس جب بندہ اسے اللہ کے حکم سے کہے، جیسا کہ اللہ تعالیٰ نے اپنے نبی علیہ السلام کو حکم دیا: **قُلْ** (کہو)، پس اسے حکم دیا: **لَوْ شَاءَ اللَّهُ مَا تَلَوْتُهُ عَلَيْكُمْ وَلَا أَدْرَاكُمْ بِهِ** (اگر اللہ چاہتا تو میں اسے تم پر نہ پڑھتا اور نہ تمہیں اس سے آگاہ کرتا)، لیکن اس نے چاہا تو میں نے اسے تم پر پڑھا اور تمہیں اس سے آگاہ کیا، یعنی تمہیں اس کی سمجھ دی، پس تم نے جان لیا کہ وہ حق ہے، جیسا کہ فرمایا: **وَجَحَدُوا بِهَا وَاسْتَيْقَنَتْهَا أَنْفُسُهُمْ** (اور انہوں نے اس کا انکار کیا حالانکہ ان کے دلوں نے اسے یقین کر لیا تھا)۔ پس جب وارث (الوارث) یا جو کوئی اس حد پر اسے کہے، تو وہ معلم معرفت ہے کہ امر کیا ہے۔ اور اسی لیے اللہ نے اس طرح کی بات کہنے کا حکم دیا۔ اور اکثر لوگوں کی طرف سے اہل اللہ پر عتاب ہوتا ہے جب وہ نیکی کا حکم دیتے ہیں اور اس کے بعد انہیں محسوس نقصان پہنچتا ہے۔ اور یہ کسی مومن سے یا کشف (الکشف) سے بات کرنے والے سے واقع نہیں ہوتا۔ کیونکہ رسول علیہ السلام سے کہا گیا: **فَإِنَّمَا عَلَيْكَ الْبَلَاغُ** (پس تم پر صرف پہنچا دینا ہے)، اور ان سے کہا گیا: **بَلِّغْ مَا أُنْزِلَ إِلَيْكَ** (جو کچھ تمہاری طرف نازل کیا گیا ہے اسے پہنچا دو)۔ اور اسی طرح وارث پر بھی واجب ہے۔ پس اس سے اپنے واجب فعل پر ندامت کیسے صحیح ہو سکتی ہے، اس نقصان کی وجہ سے جو اسے پہنچا، یا اس شخص پر شفقت کی وجہ سے جس نے نہیں سنا، جہاں اس نے اپنی بدبختی میں اضافہ کیا جب اس نے اس کی طرف توجہ نہیں دی۔ اور یہ سب حدیث نفس (دل کا خیال) ہے۔ اور دین نصیحت ہے، اللہ کے لیے، اس کے رسول کے لیے، اور مسلمانوں کے ائمہ اور عام لوگوں کے لیے۔ پس کوئی روکنے والا تمہیں اس سے نہ روکے۔ اور میں نے کچھ ایسے لوگوں کو دیکھا ہے جو اس شان کے اہل ہونے کا دعویٰ کرتے ہیں، جب ان کی بات کو حق کی طرف سے رد کیا جاتا ہے تو وہ سکڑ جاتے ہیں اور کہتے ہیں کہ ہماری فضول گوئی نے ہمیں اس طرف دھکیلا، اور اگر اللہ چاہتا تو ہم اس میں سے کچھ نہ کہتے، اور ہم نے اپنے نفسوں پر زیادتی کی ہے اور ہم نے توبہ کر لی ہے، اور ہم ایسے لوگوں کے سامنے ایسی بات دوبارہ نہیں کہیں گے۔ اور وہ اس پر ندامت ظاہر کرتے ہیں۔ اور یہ سب ان کی طرف سے امر کی جہالت ہے، اور یہ اس بات پر قطعی دلیل ہے کہ وہ اللہ کی طرف سے خبر دینے والے نہیں ہیں اور نہ انہوں نے کوئی چیز الٰہی اجازت سے پہنچائی ہے۔ کیونکہ اللہ کی طرف سے خبر دینے والا اپنے باطن میں صرف چمکتا ہوا نور (النور الساطع) دیکھتا ہے، خواہ اس کی بات قبول کی جائے یا رد کی جائے یا اسے تکلیف پہنچائی جائے۔ اور جو شخص اپنے نفس سے بات کرتا ہے، اگرچہ وہ حق کہے، جب اسے رد کیا جاتا ہے تو اس کے بعد ندامت اور دل میں تنگی اور حرج پیدا ہوتا ہے، اور وہ اپنی بات کو فضول گوئی قرار دیتا ہے، پس اس نے واجب حق کو فضول قرار دیا۔ پس یہ جہالت پر جہالت ہے۔ پس اللہ کے بندوں کو نصیحت کرنا ہر مومن پر واجب ہے، اور اسے اس نقصان کی پرواہ نہیں کرنی چاہیے جو اسے نصیحت کرنے والے کی طرف سے پہنچے۔ کیونکہ اللہ وارثوں کے بارے میں فرماتا ہے: **وَيَقْتُلُونَ الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ مِنَ النَّاسِ** (اور وہ ان لوگوں کو قتل کرتے ہیں جو لوگوں میں انصاف کا حکم دیتے ہیں)۔ اور یہ قول اس کے فرمان **وَيَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّ** (اور وہ نبیوں کو ناحق قتل کرتے ہیں) پر عطف ہے، اس نے یہ ذکر ان کی تعریف کے ضمن میں کیا ہے اور ان لوگوں کی مذمت میں جنہوں نے رسول اور وارث کی بات پر کان نہیں دھرا۔ اور اس سے بڑھ کر کون سی خوشی ہو سکتی ہے جو اس شخص کو ہو جسے اللہ کی طرف سے تعریف نصیب ہو؟ **قُلْ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ** (کہہ دو کہ اللہ کے فضل اور اس کی رحمت سے، پس اسی پر انہیں خوش ہونا چاہیے، یہ اس سے بہتر ہے جو وہ جمع کرتے ہیں)۔\n\nاور اس میں ان صفات کا علم ہے جن سے اہل استحقاق ممتاز ہوتے ہیں، یہاں تک کہ وہ ان کے حقوق کو پورا کرتے ہیں جن پر یہ متعین ہے۔ اور حقوق میں سے وہ بھی ہے جو اس شخص کی خوبصورت تعریف کا تقاضا کرتا ہے جو اپنا حق پورا نہیں کرتا، جیسے مجرم جو اپنے جرائم کی وجہ سے عذاب کا مستحق ہے، پھر اسے معاف کر دیا جاتا ہے۔ پس یہ ایک حق ہے جو باطل کر دیا گیا اور وہ محمود ہے۔ جیسا کہ غیبت (الغيبة) ایک حق ہے اور وہ مذموم ہے۔ اور جس نے یہ جان لیا اس نے حق کو جان لیا کہ وہ کیا ہے اور صدق (الصدق) سے اس میں فرق کیا، اور اس وقت جان لیا کہ غیبت حق نہیں ہے بلکہ وہ صدق ہے۔ اور اسی لیے صادق سے اس کے صدق کے بارے میں سوال کیا جاتا ہے، اور صاحب حق سے سوال نہیں کیا جاتا جب وہ اس پر قائم ہو۔ پس غیبت اور چغلی (النميمة) اور ان جیسی چیزیں صدق ہیں نہ کہ حق، کیونکہ حق وہ ہے جو واجب ہو، اور صدق وہ ہے جس کی خبر اسی صورت پر دی جائے جس پر وہ ہے۔ اور وہ واجب ہو سکتا ہے، پس وہ حق ہو گا، اور وہ واجب نہیں ہو سکتا، اور وہ صدق ہو گا نہ کہ حق۔ اسی لیے صادق سے اس کے صدق کے بارے میں سوال کیا جاتا ہے، اگر وہ واجب تھا تو وہ نجات پا گیا، اور اگر وہ واجب نہیں تھا بلکہ اس سے منع کیا گیا تھا تو وہ اس میں ہلاک ہو گیا۔ پس جس نے حق اور صدق کے درمیان فرق جان لیا، اس پر استحقاق میں بات کرنا متعین ہو گیا۔\n\nاور اس میں اس ذلت (ذل) کا علم ہے جو غیر اللہ کے لیے اس کو اپنے رب کے مرتبے پر نازل کرنے سے پیدا ہوتی ہے، اس کی جہالت کی وجہ سے۔ اگر وہ صفت کے لیے ذلیل ہوا بغیر محل کے اعتبار کے، تو اس کے لیے اس میں ایک دوسرا حکم ہو گا۔ اور اس میں اس علم کا علم ہے کہ اللہ پر کون حکم کرتا ہے، اور وہ بہترین حاکم ہے۔ اور اسی سے تم جانو گے کہ اگر اس کی صفات اس کی ذات پر زائد ہوتیں، جیسا کہ اشعری متکلم کہتا ہے، تو ذات پر وہ چیز حکم کرتی جو اس پر زائد ہے اور نہ ہی وہ اس کا عین ہے۔ اور یہ ایک ایسا مسئلہ ہے جس میں بہت سے علماء کے قدم پھسل گئے ہیں، اور انہیں اس میں شاہد (دیکھی ہوئی چیز) کو غائب (نہ دیکھی ہوئی چیز) پر قیاس کرنے یا شاہد اور غائب میں دلالت کو جاری کرنے نے گمراہ کیا ہے۔ اور یہ غلطی کی انتہا ہے۔ کیونکہ کسی محکوم علیہ کی ذات اور حقیقت کو جانے بغیر کسی امر سے اس پر حکم لگانا، اس پر حکم لگانے والے کی طرف سے بڑی جہالت ہے۔ پس کسی چیز کی طرف کسی امر کی نسبت میں دلالت کو جاری نہ کرو جب تک کہ تم اس منسوب الیہ کی حقیقت کو نہ جان لو۔ اور اس میں اس علم کا علم ہے کہ اللہ کے لیے مخلوقات میں سے کسی کو بھی اس پر حکم چلانے کی اجازت نہیں ہے، خواہ وہ کتنے ہی بلند مرتبے پر پہنچ جائے، یہاں تک کہ وہ اسے اس کا حکم دے، پس وہ اس کے حکم سے اس پر حکم لگائے جس کا وہ اپنے نفس پر واجب کرنا جائز سمجھتا ہے اگر وہ عالم میں سے ہو۔ بخلاف حق کے، کیونکہ مکلف (انسان) پابندی کے تحت ہے۔ پس اگر وہ اپنے نفس پر کسی حرام فعل کو واجب کر لے تو اسے یہ جائز نہیں، اور اس کے واجب کرنے کا کفارہ قسم کے کفارے کی طرح ہو گا، پس وہ سزا سے خالی نہیں ہوا، اگرچہ اس نے وہ فعل نہیں کیا جو اس نے واجب کیا تھا، کیونکہ اسے یہ جائز نہیں تھا۔ اور اس پر کوئی کفارہ نہیں جو اپنے نفس پر کسی مباح فعل کو واجب کر لے، اور اس کے لیے اس سے کوئی مفر نہیں مگر یہ کہ وہ اسے ضرور کرے۔ اور اس میں مکر خفی (المكر الخفي) اور اس پر فوری جزا کا علم ہے۔ اور اس میں اختیار (الاختيار) میں اضطرار (مجبوری) کے موجب کا علم ہے، اور اضطرار کا کیا فائدہ ہے۔ اور اس میں ان اسباب کا علم ہے جو عالم کو کسی امر کے بارے میں اس عمل سے غافل کر دیتے ہیں جس کا تقاضا وہ علم کرتا ہے، اور وہ بہت سے ہیں۔ اور اس میں حسرت (الحسرة) کا علم ہے، اور وہ یہ ہے کہ کسی کو اس کے گناہ پر اس کے علاوہ کوئی مؤاخذہ نہیں کرے گا جو اس نے خود کیا، پس وہی ہے جس نے اپنے نفس کا مؤاخذہ کیا۔ پس وہ اپنے آپ کو ہی ملامت کرے۔ اور جس نے اس جیسی چیز سے پرہیز کیا تو اس نے بڑی کامیابی حاصل کی۔ اور اسی سے اللہ کی حجت اس کی مخلوق پر قائم ہوتی ہے۔ اور جب وہ ان پر کرم کرے اور ان پر کسی کو مسلط نہ کرے اور معاف کر دے اور بخش دے، تو اس کے لیے کرم اور احسان کی صفت سے ثناء واجب ہو جاتی ہے۔\n\nاور اس میں اللہ کے اپنے بندوں کو دعوت دینے کا علم ہے کہ وہ انہیں کس لیے دعوت دیتا ہے؟ کیا اس عمل کی طرف جس کا اس نے انہیں مکلف بنایا، یا اس چیز کی طرف جو ان کے مکلف بنائے گئے عمل کا نتیجہ آخرت میں نکلے گا؟ اور اللہ نے اپنے بندوں کو کبھی بھی بغیر واسطہ (واسطة) کے کسی تکلیف (تکلیف) کی طرف دعوت نہیں دی۔ کیونکہ وہ بذات خود اس چیز کی طرف دعوت نہیں دیتا جس میں مشقت ہو۔ اسی لیے اس نے رسولوں (الرسل) کو بنایا، اور فرمایا: **وَمَا كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا** (اور ہم عذاب دینے والے نہیں تھے جب تک کہ ہم کوئی رسول نہ بھیج دیں)۔ اور اس میں جزاء وفاق (مطابق بدلہ) کا علم ہے، اور جب وہ اس سے باہر کی چیز عطا کرے تو وہ اسم واہب (الواہب) اور وہاب (الوہاب) کی طرف سے ہے۔ اور اس میں متخیل عذاب (العذاب المتخيل) کا علم ہے۔ اور اس میں عالم کا اس چیز کو یاد کرنا ہے جسے وہ بھول گیا تھا جب اس نے اس پر عمل نہیں کیا تھا، کیونکہ علم پر عمل کرنے والا ہی اس کی صورت کو پیدا کرنے والا ہے، پس اس کا اسے بھول جانا محال ہے۔ اور اس میں حسن تعلیم (اچھی تعلیم) کا علم ہے، کیونکہ ہر معلم اچھی تعلیم نہیں دیتا۔ اور اس میں اللہ کی پیروی (التأسي بالله) کا علم ہے کہ وہ کیسے ہو، اور وہ اپنے افعال میں مطلق ہے اور تم مقید ہو۔ اور اس میں اولیٰ اور اوجب (زیادہ بہتر اور زیادہ واجب) پر عمل کرنے کی تحقیق اور ترغیب کا علم ہے۔ اور اس میں علم (العلم) اور ظن (گمان) کے درمیان فرق کا علم ہے، یعنی غلبہ ظن (غالب گمان)۔ اور اس میں عصمت (العصمة) اور اعتصام (پناہ پکڑنا) کا علم ہے۔ اور اس میں اس علم کا علم ہے کہ معاند (ہٹ دھرم) سے کیا کہا جائے جب وہ حق کی طرف رجوع نہ کرے، اور یہ وہ ہے جو انصاف کے علم کی طرف لوٹتا ہے۔ اور اس میں اس علم کا علم ہے جس سے یہ معلوم ہوتا ہے کہ بندوں کے افعال حق کے افعال ہیں، لیکن وہ بندوں کی طرف ایک وجہ سے اور حق کی طرف ایک وجہ سے منسوب کیے جاتے ہیں، کیونکہ زبان میں نحوی اصطلاح میں اضافت محض (خالص) اور غیر مححض (غیر خالص) ہوتی ہے۔ اور افعال میں سے کچھ اللہ کے لیے خالص ہیں جب ان کی نسبت اس کی طرف کی جائے، اور کچھ غیر خالص ہیں کیونکہ ان میں اشتراک ہے۔ پس عبودیت (العبودية) اللہ کے لیے خالص ہے، اور اسے خالص کرنے کا حکم دیا گیا ہے، جیسا کہ اللہ تعالیٰ نے فرمایا: **وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ** (اور انہیں صرف اسی کا حکم دیا گیا تھا کہ وہ اللہ کی عبادت کریں، اس کے لیے دین کو خالص کرتے ہوئے)۔ اور یہ وہ ہے جس کی اس نے ان سے عبادت کروائی۔ اور اس کا فرمان: **قُلِ اللَّهَ أَعْبُدُ مُخْلِصًا لَهُ دِينِي** (کہہ دو میں اللہ کی عبادت کرتا ہوں، اس کے لیے اپنے دین کو خالص کرتے ہوئے)۔ اور یہ وہ ہے جس کی اس نے اس مقام پر عبادت کی۔ اور اس کا فرمان: **إِنَّ اللَّهَ لَا يَظْلِمُ النَّاسَ شَيْئًا** (بے شک اللہ لوگوں پر ذرہ برابر بھی ظلم نہیں کرتا) یہ ایک تحقیق کا کلمہ ہے، کیونکہ لوگ کسی چیز کے مالک نہیں ہیں، یہاں تک کہ جو کچھ ان سے ناحق لیا جائے وہ غصب ہو۔ پس ہر وہ چیز جسے ان کی ملکیت کہا جاتا ہے وہ اللہ کی ملکیت ہے، اور اس میں ان کے اعمال بھی شامل ہیں۔ پھر فرمایا: **وَلَكِنْ أَنْفُسَهُمْ يَظْلِمُونَ** (لیکن وہ اپنے آپ پر ظلم کرتے ہیں)۔ پس سبحانہ و تعالیٰ نے اپنے نفس سے ان کے نفوس کی طرف کنایہ کیا، جب عالم میں ظلم واقع ہوا اور اس کا قول کیا گیا۔ پس گویا اس نے کہا: لیکن وہ اپنے نفس پر ظلم کرتا ہے اگر یہ ظلم ہے، اور مالک اپنی ملکیت میں اپنے نفس پر ظلم نہیں کرتا۔ پس اگر لوگوں کے پاس جو کچھ ہے وہ ان کی ملکیت ہوتا تو اللہ انہیں اس میں تصرف کرنے سے نہ روکتا اور نہ ان کے لیے اس میں مختلف حدود مقرر کرتا۔ پس یہ تمہیں دلالت کرتا ہے کہ مکلف کے افعال اس کے لیے نہیں ہیں، بلکہ وہ اللہ کے لیے ہیں۔ پس لوگوں میں حقیقت میں ظلم ان کا یہ دعویٰ ہے کہ جو چیز ان کی نہیں ہے وہ ان کی ہے۔ پس اللہ نے انہیں صرف جھوٹے دعوے پر سزا دی۔\n\nاور اس میں کثیر کو قلیل میں شامل کرنے کا علم ہے، یہاں تک کہ اسے قلیل کہا جائے حالانکہ وہ حقیقت میں کثیر ہے۔ اور اس میں اشیاء میں مقررہ مدتوں (الآجال) کا علم ہے، اور اس کے فرمان **لَا يَسْتَأْخِرُونَ سَاعَةً وَلَا يَسْتَقْدِمُونَ** (وہ ایک گھڑی بھی پیچھے نہیں ہٹ سکتے اور نہ آگے بڑھ سکتے ہیں) کا معنی اس گھڑی پر۔ اور اس میں اس شخص کا علم ہے جس پر جھوٹا دعویٰ کیا گیا ہو، اور مدعی علیہ جانتا ہو کہ مدعی جھوٹا ہے، اور اس کے پاس کوئی گواہ نہ ہو، پس اس پر قسم (الیمین) واجب ہو جائے۔ پس اسے اللہ کی طرف سے حکم ہے کہ وہ قسم کھائے، اور اسے یہ حق نہیں کہ وہ قسم کو مدعی پر لوٹا دے اور نہ ہی قسم کھانے سے انکار کرے اور اسے وہ چیز دے دے جس کا اس نے دعویٰ کیا ہے، کیونکہ وہ اس کے ظلم پر اس کی مدد کرنے والا ہو گا۔ اور وہ قسم میں اپنے ساتھی کے نفس کو اس چیز میں تصرف کرنے سے محفوظ کر رہا ہے جس میں اس نے اس پر ظلم کیا، پس جب تک وہ اس میں تصرف کرتا رہے گا، گناہ اس کے ساتھ رہے گا۔ اور قسم اس سے مانع ہے، اور مدعی پر صرف قسم کا گناہ باقی رہے گا، کیونکہ اس کے دعوے میں جھوٹ کا گناہ حلف نے زائل کر دیا، اور جھوٹی قسم کا وبال اس پر لوٹ آیا۔ پس وہ اس شخص کے مقام پر ہے جو جھوٹی قسم کھائے، پس اس پر اس شخص کا گناہ لوٹ آئے گا جس نے قسم کھائی اگر وہ اپنی قسم میں جھوٹا تھا۔ جیسے ایک شخص نے دوسرے پر سو دینار کا دعویٰ کیا اور وہ اپنے دعوے میں جھوٹا ہے، اور اس کے دعوے کی تصدیق کے لیے کوئی گواہ نہیں ہے۔ پس حاکم نے مدعی علیہ پر قسم واجب کر دی۔ پس اگر مدعی علیہ نے قسم کو مدعی پر لوٹا دیا، اور حاکم ان میں سے ہو جو اسے جائز سمجھتے ہیں، اگرچہ ہمارے نزدیک یہ جائز نہیں ہے، تو اس مدعی علیہ نے مدعی کو نصیحت نہیں کی، حالانکہ اسے نصیحت کا حکم دیا گیا ہے۔ پس اگر مدعی نے قاضی کے حکم سے قسم کھائی، تو اس پر جھوٹی قسم کا گناہ ہے، اور مدعی علیہ پر حلف اٹھانے والے پر ظلم کا گناہ ہے، کیونکہ اسی نے اسے قسم کھانے پر مجبور کیا۔ اور حاکم پر کوئی گناہ نہیں، کیونکہ وہ مجتہد ہے، پس زیادہ سے زیادہ یہ ہے کہ وہ اپنے اجتہاد میں غلطی کرنے والا ہو، پس اسے اجر ملے گا۔ اور اگر مدعی علیہ کھڑا ہوا اور مدعی کو وہ دے دیا جس کا اس نے دعویٰ کیا تھا، تو مدعی علیہ پر گناہ دوگنا ہو گیا، کیونکہ اس نے اسے ایسے مال میں تصرف کرنے کا موقع دیا جس میں اسے تصرف کرنا حلال نہیں تھا۔ اور مدعی پر گناہ اس وقت تک رہے گا جب تک وہ اس مال میں اور اس سے پیدا ہونے والی چیزوں میں تصرف کرتا رہے گا، اور مدعی علیہ پر بھی گناہ رہے گا اس حیثیت سے کہ اس نے اپنے بھائی کو ظلم پر مدد دی، اور اسے ایسا نہیں کرنا چاہیے تھا۔ اور اس حیثیت سے کہ اس نے اللہ کے حکم کی نافرمانی کی، قسم کو ترک کر کے، کیونکہ اللہ نے اس پر قسم واجب کی تھی۔ پس اگر وہ قسم کھاتا تو اس نے وہ عمل کیا ہوتا جو اللہ نے اس پر واجب کیا، پس اسے اجر ملتا، اور اس نے مدعی کو ظلم میں تصرف کرنے سے بچانے کی نیت کی، پس اسے اس کا اجر ملتا۔ اور مدعی پر مدعی علیہ کی قسم سے صرف اس کی قسم کا گناہ باقی رہتا۔ پس مدعی پر جھوٹی قسم کا گناہ ہے، اور وہ یمین غموس (ڈبونے والی قسم) ہے۔ اور یہ شرع میں ایک لطیف مسئلہ ہے، جسے اس نظر سے وہی دیکھتا ہے جو اپنے دین کے لیے احتیاط کرے اور اہل اللہ میں سے ہو، کیونکہ وہ لوگوں کے لیے وہی پسند کرتا ہے جو اپنے لیے پسند کرتا ہے، پس وہ اپنے بھائی کو اس کے نفس پر ظلم کرنے میں مدد نہیں دیتا جب وہ ایسا چاہتا ہو۔ اور اس میں قدح (عیب جوئی) میں سے کیا مذموم ہے اور کیا محمود، اس کا علم ہے۔ اور اس میں مراقبہ (المراقبة) اور حضور (الحضور) کا علم ہے، اور یہ دونوں عصمت (العصمة) اور الٰہی حفاظت کے دروازوں میں سے ہیں اور علم نافع کے حصول کا ذریعہ ہیں۔ اور اس میں اہل بشریٰ (خوشخبری پانے والوں) کی صفات کا علم ہے، اور مبشرات (خوشخبریاں) کی اقسام، اور وہ کہاں ہوتی ہیں، اور ان میں سے کیا ناگوار ہے اور کیا خوش کن۔ اور اس میں اس عزت (العزة) کا علم ہے جو اس شخص پر ظاہر ہوتی ہے جس نے اللہ پر بھروسہ کیا، اور الٰہی حفاظت اور حمایت کا علم ہے۔ اور اس میں اس شخص کا علم ہے جس نے سنی ہوئی چیز پر عمل نہیں کیا جو اس پر واجب تھا، اس کا سبب کیا ہے جس نے اسے روکا، اور کیا اس کا حکم اس شخص کا حکم ہے جس نے نہیں سنا، پس اللہ نے اس پر فضل کیا، یا اس کا حکم اس شخص کا حکم ہے جس نے جانا مگر عمل نہیں کیا، پس اللہ نے اسے سزا دی، پس اللہ نے اس میں عدل کیا؟ کیونکہ وہ فرماتا ہے: **وَلَا تَكُونُوا كَالَّذِينَ قَالُوا سَمِعْنَا** (اور ان لوگوں کی طرح نہ ہو جاؤ جنہوں نے کہا کہ ہم نے سنا)۔ کیونکہ انہوں نے حقیقت میں سنا اور سمجھا، کیونکہ اس نے انہیں ان کی زبان میں مخاطب کیا، پھر فرمایا: **وَهُمْ لَا يَسْمَعُونَ** (حالانکہ وہ نہیں سنتے)، یعنی ان کا حکم ہمارے نزدیک اس شخص کا حکم ہے جس نے نہیں سنا، باوجود اس کے کہ انہوں نے سنا۔ اور اللہ نے یہ نہیں فرمایا کہ ان کے بارے میں کیا حکم دیا جائے گا، اگرچہ قرائن احوال سے غالب امر سزا کا ہے، لیکن فضل الٰہی اور اس کے ایسے لوگوں کی برائیوں سے درگزر کرنے کے علم کی وجہ سے حقیقت میں امکان ختم نہیں ہوتا۔ پس سمجھو۔ اور اس میں اس علم کا علم ہے جو اللہ متوکل کے دل میں عطا کرتا ہے جب وہ اللہ پر حق توکل کرتا ہے۔ اور اس میں خلافت الٰہیہ (الخلافة الإلهية) کا علم ہے۔ اور اس میں دلوں پر مہر لگنے (الطبع على القلوب) کے اسباب کا علم ہے جو بدبختی کی طرف لے جاتے ہیں۔ اور اس میں مدعی سے بینہ (گواہی) طلب کرنے کا علم ہے، اور یہ علم اللہ تعالیٰ کے فرمان **وَمَا كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا** (اور ہم عذاب دینے والے نہیں تھے جب تک کہ ہم کوئی رسول نہ بھیج دیں) کو شامل ہے۔ اور اس نے یہ نہیں کہا کہ ہم کسی شخص کو بھیجیں، پس مبعوث کی رسالت کا ثابت ہونا ضروری ہے اس شخص کے نزدیک جس کی طرف اسے بھیجا گیا، پس ہر شخص کے نزدیک واضح اور ظاہر دلیل کا قائم ہونا ضروری ہے جس کی طرف انہیں بھیجا گیا، کیونکہ بسا اوقات کوئی آیت ایسی ہوتی ہے جس میں ابہام یا احتمال ہوتا ہے کہ بعض لوگ اس کی دلالت کو نہیں سمجھ پاتے۔ پس ضروری ہے کہ دلیل ہر اس شخص کے نزدیک واضح ہو جس پر وہ قائم کی گئی ہے، یہاں تک کہ اس کے نزدیک یہ ثابت ہو جائے کہ وہ رسول ہے۔ اور اس وقت اگر وہ یقین کرنے کے بعد انکار کرے تو مؤاخذہ متعین ہو جاتا ہے۔ پس اس آیت میں مخلوق کی فطرتوں کے اختلاف کی وجہ سے جو نظر کے اختلاف کا باعث بنتا ہے، بڑی رحمت ہے۔ اور اللہ نے یہ صرف اپنے بندوں پر رحمت کے طور پر کیا، اس شخص کے لیے جو الٰہی رحمت کے شمول کو جانتا ہے جس کے بارے میں اللہ نے خبر دی کہ **وَسِعَتْ كُلَّ شَيْءٍ** (ہر چیز پر چھا گئی ہے)۔ اور اس میں کرم (الكرم) سے کیا نتیجہ نکلتا ہے اور بخل (البخل) سے کیا نتیجہ نکلتا ہے، اس کا علم ہے۔ اور اس میں ایمان کے تلفظ میں اشکال کو دور کرنے کا علم ہے، یہاں تک کہ سننے والے یہ جان لیں کہ وہ مومن ہے، ایسا علم جس میں وہ شک نہ کریں، اور اسے نصوص (النصوص) سے تعبیر کیا جاتا ہے۔ کیونکہ ظاہر اگرچہ وضع میں پہلی بدیہی چیز سے معلوم ہوتا ہے، لیکن اس میں احتمال داخل ہو جاتا ہے۔ اور اس میں ان بندوں کا علم ہے جن پر اللہ نے عنایت کی ہے۔ اور اس میں خذلان (ترک کر دینا) اور اس کے اہل کا علم ہے۔ اور اس میں صاحب حق کا اس وقت رجوع کرنے کا علم ہے جب اس کے منہ پر اس کی بات رد کر دی جائے۔ اور اس میں صابرین میں صبر (الصبر) کی اقسام اور شاکرین میں شکر (الشکر) کی اقسام کا علم ہے۔ اور اللہ **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب سیصد و هفتاد و چهارم» در معرفت منزل رؤیت (منزل شهود)\n\nو رؤیت و پیشی گرفتن اشیاء در حضرت ربوبی (الحضرة الربية) و اینکه کفار نیز قدمی دارند همان‌گونه که مؤمنان قدمی دارند، و آمدن هر طایفه‌ای بر قدم خویش و آمدنشان با امام خود، از روی عدل و فضل از حضرت محمدیه (الحقیقة المحمدیة) است.\n\n> آن کس که در ظلمت کائنات (الأکوان) بود، *** حکم عنایت برای او بود نه برای همه خلق.\n> و به کشف حجاب حس دست یافت از آنچه نوشته شد، *** و همه چیز را در جایگاه خود گشوده دید.\n> سیرت او بر سنت پاک جاری است، *** حق (الحق) را در مسیر روشن خود پیوسته مشاهده می‌کند.\n\n### [همانا خداوند متعال عرش را محل احدیت کلمه قرار داد]\n\nبدان، خداوند تو را به شهود (الشهود) تأیید کند و از اهل جمع و هستی (الوجود) قرار دهد، که چون خداوند متعال عرش را محل احدیت کلمه قرار داد، و آن (عرش) همان رحمان است و نه غیر آن، و کرسی را خلق کرد، کلمه در آن به دو امر تقسیم شد تا از هر چیزی دو زوج بیافریند؛ به طوری که یکی از زوج‌ها متصف به علو و دیگری به سفل باشد، یکی بالفعل و دیگری بالانفعال. پس شفیعه (زوجیت) از کرسی بالفعل ظاهر شد، در حالی که در کلمه واحد بالقوه بود، تا دانسته شود که موجود اول، اگرچه از حیث ذات خود واحدالعین است، اما حکم نسبتی به آنچه از عالم از او ظاهر شده دارد. پس او ذاتی وجودی و نسبتی است. این اصل شفیعه عالم است. و ناگزیر باید رابطی معقول بین ذات و نسبت وجود داشته باشد تا ذات این نسبت را بپذیرد. پس فردیت با معقولیت رابط ظاهر شد، و سه اولین افراد بود و در اصل چهارمی نیست. پس سه اولین افراد در عدد تا بی‌نهایت است، و شفیعه که به دو تعبیر می‌شود، اولین ازواج تا بی‌نهایت در عدد است. هیچ شفعی نیست مگر اینکه واحدی آن را وتر (فرد) می‌کند و به این ترتیب فردیت آن شفع حاصل می‌شود، و هیچ فردی نیست مگر اینکه واحدی آن را شفع می‌کند و به این ترتیب شفعیت آن فرد حاصل می‌شود. پس امری که فرد را شفع می‌کند و شفع را فرد، همان غنی است که حکم از آن اوست و بر او حکم نمی‌شود، و او نیازمند نمی‌شود و به او نیازمند می‌شوند. پس دو قدم به سوی کرسی آویزان شدند، هنگامی که کلمه رحمانی در آن تقسیم شد. زیرا خود کرسی به واسطه آن، تقسیم کلمه ظاهر شد، چون کرسی دومین بعد از عرش محیط است که از صور اجسام ظاهر در جوهر اصل است، و آن دو (عرش و کرسی) دو شکل در جسم کل طبیعی هستند. پس دو قدم به سوی آن آویزان شدند و هر قدم در مکانی مستقر شد که مکان استقرار دیگری نبود، و این نهایت استقرار آن دو است. پس یکی از آن دو مکان، جهنم و دیگری، جنت نامیده شد. و بعد از آن دو، مکانی نیست که این دو قدم به آن منتقل شوند. این دو قدم جز از اصلی که از آن ظاهر شده‌اند، یعنی رحمان، مدد نمی‌گیرند. پس جز رحمت نمی‌بخشند، زیرا نهایت به حکم به اصل بازمی‌گردد. با این حال، بین آغاز و نهایت راهی وجود دارد که آن راه بین ابتدا و غایت تمایز ایجاد کرده است، و اگر آن راه نبود، نه آغازی بود و نه غایتی. پس این سفر برای امر نازل در میان آنها بود، و سفر جایگاه گمان خستگی و شقاوت است. این سبب ظهور آنچه در عالم، دنیا و آخرت و برزخ، از شقاوت ظاهر شده است. و هنگام پایان استقرار، عصای سیر و سفر انداخته می‌شود و آسایش در سرای قرار و یا هلاکت (بوار) حاصل می‌گردد.\n\nاگر بگویی: پس شایسته بود که هنگام ورود به سرای واحدی که آتش نامیده می‌شود، آسایش یافت شود، در حالی که چنین نیست. می‌گوییم: راست گفتی، اما تو فقط یک جنبه را دیدی. مسافران دو نوع هستند: مسافری که سفرش مانند اقامت است، به دلیل رفاهی که در آن است، از این جهت که خدمتکار دارد و تمام خواسته‌هایش در کجاوه بر دوش مردان حمل می‌شود و از تغییرات هوا محفوظ است. مَثَل این شخص در رسیدن به منزل، مانند اهل بهشت در بهشت است. و مسافری که راه را با پای خود می‌پیماید، توشه کم و بار ضعیفی دارد؛ وقتی به منزل می‌رسد، مقداری از خستگی و مشقت با او می‌ماند تا از او زایل شود و سپس آسایش یابد. این مَثَل کسی است که در آتش که منزل اوست، عذاب می‌کشد و به شقاوت می‌افتد، سپس رحمتی که «وَسِعَتْ كُلَّ شَيْ‏ءٍ» (همه چیز را فرا گرفته است) او را در بر می‌گیرد. و مسافری بین این دو است که نه رفاه صاحب بهشت را دارد و نه سختی صاحب آتش را؛ پس او بین آسایش و خستگی است. این همان طایفه‌ای است که با شفاعت شفاعت‌کنندگان و با خارج کردن ارحم الراحمین از آتش خارج می‌شوند. و آنها بر طبقاتی هستند، به همین دلیل در میانشان پیشی‌گیرنده و تأخیرکننده وجود دارد، به اندازه‌ای که از خستگی با آنها باقی می‌ماند، که کم‌کم در آتش زایل می‌شود. پس هنگامی که مدت او به پایان رسید، به محل آسایش یعنی بهشت خارج می‌شود، یا با شفاعت شافعی، یا با خارج کردن عمومی که همان خارج کردن ارحم الراحمین است. پس انبیا و مؤمنان برای اهل ایمان شفاعت می‌کنند. و اهل ایمان دو طایفه‌اند: یکی مؤمن از روی نظر و تحصیل دلیل، و آنها کسانی هستند که آیات و دلالات و معجزات را دانسته‌اند، و اینان کسانی هستند که پیامبران برایشان شفاعت می‌کنند. و دیگری مؤمن تقلیدی، به آنچه پدر و مادرش به او داده‌اند، زیرا او را تربیت کرده‌اند، یا اهل خانه‌ای که در آن رشد کرده است. این نوع را مؤمنان شفاعت می‌کنند، همان‌گونه که در دنیا ایمان را با تربیت به آنها داده‌اند. اما فرشتگان، برای کسی شفاعت می‌کنند که در دنیا بر مکارم اخلاق بوده، اگرچه مؤمن نبوده باشد. و شافع چهارمی در آنجا نیست. و باقی می‌ماند کسی که ارحم الراحمین او را خارج می‌کند، و آنها کسانی هستند که هرگز خیری انجام نداده‌اند، نه از جهت ایمان و نه با انجام مکارم اخلاق، جز اینکه عنایت الهی بر آنان سبقت گرفته که از اهل آن سرای باشند. و اهل این سرای دیگر (جهنم) در آن باقی می‌مانند. پس درهای آن سرا بسته و محکم می‌شود و یأس از خروج حاصل می‌گردد. در این هنگام، رحمت اهل آن را فرا می‌گیرد، زیرا از خروج از آن مأیوس شده‌اند. چرا که آنان از خروج می‌ترسیدند، هنگامی که خارج کردن ارحم الراحمین را دیدند، در حالی که خداوند آنان را بر مزاجی آفریده که برای ساکن آن سرا مناسب است و از خروج از آن متضرر می‌شوند، همان‌گونه که بیان کردیم. پس هنگامی که مأیوس شدند، شاد شدند. پس نعمت آنان همین مقدار است و این اولین نعمتی است که می‌یابند. و حالشان در آن، همان‌گونه که پیشتر گفتیم، پس از پایان مدت شقاوت است، که عذاب را شیرین می‌یابند (استعذاب می‌کنند). پس دردها زایل می‌شود و عذاب باقی می‌ماند. و به همین دلیل عذاب نامیده شده است، زیرا سرانجام آن به شیرین یافتن (استعذاب) برای کسی که در آن است می‌انجامد، همان‌گونه که کسی که دچار گال است، خاراندن آن را شیرین می‌یابد. اما اگر کسی بدون گال یا بدون نیاز به خشکی‌ای که بر بخشی از بدنش عارض شده، بخاراند، از خاراندن درد می‌کشد. امر این‌گونه اقتضای حال مزاجی را دارد که برای انسان عارض می‌شود. پس نعمت هر سرایی را بفهم تا ان‌شاءالله سعادتمند شوی. آیا به درستی آنچه گفتیم نمی‌نگری که آتش پیوسته به دلیل نقص و عدم امتلاء (پر شدن) در رنج است، تا اینکه جبار (الجبار) قدم خود را در آن می‌نهد، و آن یکی از آن دو قدمی است که در کرسی ذکر شد. و قدم دیگر که مستقر آن بهشت است، قول خداوند است: «وَبَشِّرِ الَّذِينَ آمَنُوا أَنَّ لَهُمْ قَدَمَ صِدْقٍ عِنْدَ رَبِّهِمْ» (و به کسانی که ایمان آورده‌اند بشارت ده که نزد پروردگارشان قدم صدق دارند). پس اسم رب (الرب) با این گروه است و جبار (الجبار) با گروه دیگر، زیرا آن (جهنم) سرای جلال و جبروت و هیبت است، و بهشت سرای جمال و انس و تنزل الهی لطیف است. پس قدم صدق یکی از دو قدم کرسی است، و آن دو دو قبضه هستند، یکی برای آتش است و باکی ندارد، و دیگری برای بهشت است و باکی ندارد، زیرا سرانجام هر دو به رحمت است. به همین دلیل در مورد آن دو باکی نیست. و اگر امر چنان بود که جاهل گمان می‌برد (که عدم مبالات به معنای بی‌اهمیتی است)، مجازات بر جرائم واقع نمی‌شد و خداوند خود را به غضب وصف نمی‌کرد و بطش شدید (گرفتن سخت) وجود نداشت. پس این همه از مبالات (اهمیت دادن) و توجه به کسی است که مورد مؤاخذه قرار می‌گیرد، زیرا اگر او قدر و منزلتی نداشت، عذاب نمی‌شد و برای او آماده‌سازی صورت نمی‌گرفت. و در مورد اهل تقوا گفته شده است که بهشت «أُعِدَّتْ لِلْمُتَّقِينَ» (برای پرهیزکاران آماده شده است) و در مورد اهل شقاوت فرمود: «أَعَدَّ لَهُمْ عَذاباً أَلِيماً» (برای آنان عذابی دردناک آماده کرده است). اگر مبالات نبود، این حکم ظاهر نمی‌شد. پس امور و احکام جایگاه‌هایی دارند که اگر اهل آن جایگاه‌ها را بشناسند، هر حکمی را از جایگاه خود فراتر نمی‌برند. و به این وسیله عالم از غیر عالم شناخته می‌شود. پس عالم پیوسته با خدا ادب می‌ورزد و در هر موطنی با او به گونه‌ای رفتار می‌کند که حق (الحق) می‌خواهد در آن موطن با او رفتار شود. و کسی که نمی‌داند چنین نیست. پس به واسطه آن دو قدم، غنی و فقیر کرد، و به واسطه آن دو میراند و زنده کرد، و به واسطه آن دو آباد کرد و ویران ساخت، و به واسطه آن دو «خَلَقَ الزَّوْجَيْنِ الذَّكَرَ وَالْأُنْثى» (دو زوج نر و ماده را آفرید)، و به واسطه آن دو خوار کرد و عزیز ساخت، و بخشید و منع کرد، و زیان رساند و سود بخشید. و اگر آن دو نبودند، هیچ یک از آنچه در عالم واقع شده، واقع نمی‌شد. و اگر آن دو نبودند، شرک در عالم ظاهر نمی‌شد، زیرا آن دو قدم در حکم در عالم شریک شدند. پس برای هر یک از آن دو سرایی است که در آن حکم می‌کند و اهلی که در آنها به آنچه خدا خواسته حکم می‌کند، و ما به آن و به جزئیات آن اشاره کردیم. زیرا احکام مانند حدود، با تغییر موجِب (علت ایجاب‌کننده) تغییر می‌کنند. پس کسی که به دلیل افترا حد می‌خورد، اگر مرتکب قتل شود، با حدی مجازات می‌شود که در افترا اجرا نمی‌شود، بلکه حد دیگری غیر از این بر او جاری می‌شود، در حالی که مفتری همان قاتل است. پس حدود بر او به دلیل تغییر موجِب تغییر کرده است. پس بفهم. همچنین احوال احکام الهی به دلیل تغییر مواطن تغییر می‌کند.\n\nپس عنایت کبری (العناية الكبرى) که خداوند به عالم دارد، به دلیل استوای او بر عرش محیط بر عالم به اسم رحمان است، و امر همه به سوی او بازمی‌گردد. به همین دلیل او ارحم الراحمین است، زیرا اگر رحمت او نبود، رحیمان در عالم رحیم نبودند، پس رحمت او سبقت دارد. و چون دو قدم عبارت از تقابل اسماء الهی مانند اول و آخر، ظاهر و باطن و مانند آن بودند، حکم آن در عالم غیب و شهود (الشهود)، جلال و جمال، قرب و بعد، هیبت و انس، جمع و فرق، ستر و تجلی (التجلی)، غیبت و حضور، قبض و بسط، دنیا و آخرت، و بهشت و آتش از آنها ظاهر شد. همان‌گونه که به واسطه واحد، برای هر معلومی احدیتی بود که به واسطه آن از غیر خود متمایز می‌شد. همان‌گونه که از فردیت که همان سه است، حکم دو طرف و واسطه که همان برزخ و شیء بین آن دو است، مانند گرم و سرد و ولرم، ظاهر شد. و از فردیت، افراد ظاهر شدند و از دو، ازواج ظاهر شدند. و هیچ عددی خالی از این نیست که شفع یا وتر باشد تا بی‌نهایت که تضعیف در آن است، و واحد پیوسته آن را تضعیف می‌کند. پس به نیروی واحد، آنچه از حکم در عدد ظاهر شد، پدید آمد. و حکم از آن خداوند واحد قهار است. اگر او به متقابلین نامیده نمی‌شد، قهار نامیده نمی‌شد، زیرا محال است که مخلوقی اصلاً با او مقاومت کند. پس او قهار نیست مگر از این جهت که به متقابلین نامیده شده است، پس غیر او با او مقاومت نمی‌کند. او معز (عزت‌دهنده) و مذل (خوارکننده) است. پس حکم قاهر و مقهور بین این دو اسم واقع می‌شود، با ظهور یکی از دو حکم در محل. به همین دلیل او واحد است از حیث اینکه قهار نامیده می‌شود، از حیث اینکه به متقابلین نامیده می‌شود. و ناگزیر باید حکم یکی از دو اسم نافذ شود، پس آنکه حکمش نافذ است، قاهر است.\n\nو قهار (القهار) از این جهت است که اسماء تقابل برای او بسیار است، همان‌گونه که ذکر کردیم، مانند محیی (زنده‌کننده) و ممیت (میراننده)، ضار (زیان‌رسان) و نافع (سودرسان) و مانند آن. و از این دو قدم، در نبوت، مبعوث و غیر مبعوث، و در مؤمنان، مؤمن از روی نظر و مؤمن از غیر نظر ظاهر شد. پس حکم آن دو در عالم جاری است. اکنون امر بر تو آشکار شد، پس پرده دریده نشود. همان‌گونه که شفع بر تو حکم می‌کند، وتر نیز بر تو حکم می‌کند. اما معرفت حجاب و رؤیت، که هر دو از احکام دو قدم هستند، اگرچه حکم رؤیت باقی است، اما متعلق آن حجاب است. پس رؤیت، حجاب را می‌بیند و حکمش زایل نشده است. پس قاهری برای آن نیست و نه ضدی، جز اینکه بیننده غرضی در متعلق خاصی دارد که اگر رؤیت او به آن تعلق نگیرد، در آنجا حکم حجاب ظاهر می‌شود. پس غرض است که مقهور می‌شود نه رؤیت. پس هر کس می‌خواهد حکم قهر از او زایل شود، باید بدون غرض و بدون اشتیاق (تشوف) با خدا مصاحبت کند، بلکه به هر آنچه در عالم و در نفس او واقع می‌شود بنگرد و آن را مراد خود قرار دهد، و از آن لذت ببرد و با قبول، بشاشت و رضایت آن را بپذیرد. کسی که حالش چنین باشد، پیوسته در نعیم دائم مقیم است و به ذلت و مقهور بودن متصف نمی‌شود که به همین دلیل دردها او را دریابد. و صاحب این مقام عزیز است و من کسی را ندیده‌ام که طعم آن را چشیده باشد، زیرا راه رسیدن به آن را نمی‌داند. زیرا انسان لحظه‌ای خالی از طلبی که برای امری انجام می‌دهد، نیست. و اگر حقیقت انسان ظهور طلب در اوست، پس باید متعلق طلب خود را مجهول و نامعین قرار دهد، مگر از یک جهت، و آن اینکه متعلق طلب او، چیزی باشد که خداوند در عالم، در نفس او یا در غیر او، ایجاد می‌کند. پس آنچه چشمش بر آن افتاد، یا گوشش به آن تعلق گرفت، یا در نفس خود یافت، یا کسی با او رفتار کرد، باید همان عین مطلوب مجهول او باشد که وقوع آن، آن را برای او معین کرده است. پس او به حقیقت طالب بودن خود وفا کرده است و از هر واقعه‌ای که از او یا در او، یا از غیر او یا در غیر او رخ می‌دهد، لذت می‌برد. اگر آن واقعه مقتضی تغییر برای او باشد، تغییر می‌کند، زیرا حق (الحق) از او تغییر را می‌طلبد، و او طالب واقعه است و تغییر همان واقعه است، و در آن مقهور نیست، بلکه در تغییر خود لذت می‌برد، همان‌گونه که در مرگ برای تغییر لذت می‌برد. و راهی برای تحصیل این مقام جز آنچه ذکر کردیم نیست. پس نباید بگوییم، همان‌گونه که کسی که امر را ندانست و محال را طلب کرد و گفت: «می‌خواهم که نخواهم». بلکه طلب صحیح که حقیقت انسان آن را اقتضا می‌کند، این است که بگوید: «آنچه تو می‌خواهی، می‌خواهم». اما روش آن به طور عمومی برای اهل الله آسان است. و آن این است که انسان از حالتی که بر آن است و در آن قیام می‌کند، خالی نیست؛ یا از روی اراده اوست، یا از روی کراهت، به اینکه بدون اراده در آن قرار داده شود. و ناگزیر باید برای آن حال، حکم شرعی‌ای که به آن تعلق می‌گیرد، حکم کند. پس نزد حکم شرع توقف می‌کند و آنچه را شرع اراده کرده، اراده می‌کند. پس به اراده آنچه شرع خواسته است، به طور خاص متصف می‌شود و دیگر غرضی در مراد معینی برای او باقی نمی‌ماند. همچنین کسی که می‌گوید: بنده باید با خدا بدون اراده باشد، صحیح نیست. بلکه صحیح است اگر بگوید: بنده کسی است که متعلق اراده‌اش، چیزی باشد که حق (الحق) برای او می‌خواهد، زیرا او از اراده خالی نیست. پس کسی که رؤیت حق (الحق) را به امر حق طلب کند، بنده‌ای است که امر مولای خود را امتثال کرده است. و کسی که رؤیت حق را بدون امر حق طلب کند، ناگزیر اگر به آنچه اراده‌اش به آن تعلق گرفته، دست نیابد، متألم می‌شود. پس او بر نفس خود جنایت کرده است. زیرا خالق اشیاء و مرادات و حوادث حکم می‌کند و بر او حکم نمی‌شود. پس بنده باید با او بر آنچه او می‌خواهد باشد، زیرا با این کار به آسایش تعجیل شده در دنیا دست می‌یابد. و در اخبار الهی آمده است: «یا عبدی أرید وتريد ولا يكون إلا ما أريد» (ای بنده من، من می‌خواهم و تو می‌خواهی، و جز آنچه من می‌خواهم نخواهد بود). این تنبیهی است بر دارویی که اگر انسان آن را به کار برد، دردی که ذکر کردیم از او زایل می‌شود.\n\nو در الهیات از کعب الاحبار روایت شده است که خداوند متعال می‌فرماید: «یا ابن آدم إن رضيت بما قسمت لك أرحت قلبك وبدنك وهو موضع إرادة العبد وأنت محمود وإن لم ترض بما قسمت لك سلطت عليك الدنيا حتى تركض فيها ركض الوحش في البرية ثم وعزتي وجلالي لا تنال منها إلا ما قدرت لك وأنت مذموم» (ای فرزند آدم، اگر به آنچه برایت قسمت کرده‌ام راضی باشی، قلب و بدنت را آسوده می‌کنم، و این جایگاه اراده بنده است و تو ستوده هستی. و اگر به آنچه برایت قسمت کرده‌ام راضی نباشی، دنیا را بر تو مسلط می‌کنم تا در آن مانند حیوان وحشی در بیابان بدوی، سپس به عزت و جلالم سوگند، از آن جز آنچه برایت مقدر کرده‌ام به دست نخواهی آورد و تو نکوهیده هستی).\n\nو این نیز دارویی است. و اما قول خداوند متعال: «وَما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله» (و شما نمی‌خواهید مگر اینکه خدا بخواهد)، این تسلایی است که دانشی را افاده می‌کند تا بنده به واسطه آن در قیامت حکمی را ثابت کند. پس این تلقین حجت و رحمت و فضلی از جانب خداست.\n\n### [طلب، کوشش است و رؤیت، منت الهی]\n\nو بدان که هر آنچه با کوشش (سعایه) به دست آید، در آن منتی نیست. و طلب، کوشش است و رؤیت، منت الهی (امتنان). پس صحیح نیست که رؤیت طلب شود. پس اگر آنچه از رؤیت واقع شد، از روی طلب باشد، آن رؤیت حقیقی نیست که از طلب حاصل می‌شود. زیرا مطلوب او از مرئی (آنچه دیده می‌شود) این است که او را بر آنچه هست ببیند، در حالی که او (حق) جز در صورت علم بیننده به او، بر او تجلی (التجلی) نمی‌کند، زیرا اگر چنین نباشد، آن را انکار می‌کند. پس بر او تجلی نکرد مگر در غیر آنچه طلب کرده بود. پس رؤیت، احسان بود، زیرا عین آنچه را طلب کرده بود به او نرسید، در حالی که او گمان می‌کند که آن عین مطلوب اوست، در حالی که چنین نیست. پس هنگامی که از آنچه دید لذت برد و گمان کرد که مطلوب اوست، پس از آن بدون طلب بر او تجلی کرد. پس آن تجلی (التجلی) نیز منت الهی بود که از علم به او چیزی بخشید که نزد او نبود و به ذهنش خطور نکرده بود. پس اگر آنچه را برایت ذکر کردم بفهمی، خواهی دانست که رؤیت خداوند با طلب حاصل نمی‌شود و به عنوان جزا به دست نمی‌آید، همان‌گونه که نعمت‌ها در بهشت‌ها به دست می‌آیند. و این مسئله‌ای است که در علم من کسی از خلق خدا جز خدا به آن تنبیه نکرده است، با اینکه رجال الله (اهل الله) آن را می‌دانند و به آن تنبیه نکرده‌اند، به دلیل گمانشان که این مسئله نزدیک به فهم و آسان به دست آوردن است، یا وقوع آن محال است. ناگزیر یکی از این دو حکم باید باشد. زیرا خداوند در علم به خود، بین خلق مساوات قرار نداده است، پس ناگزیر باید در این زمینه بین بندگان خدا تفاوت باشد. معتزلی رؤیت را منع می‌کند، و اشعری آن را عقلاً جایز می‌داند و شرعاً بر مقتضای نظر خود اثبات می‌کند. و فیلسوف آن را عقلاً نفی می‌کند، زیرا او در شرع و ایمان قدمی ندارد. و اهل الله (اهل الله) آن را با کشف (الکشف) و ذوق اثبات می‌کنند. و اگر قبل از کشف (الکشف) آنچه بود، کشف آن را رد می‌کند، زیرا چیزی به او داده است که او را بر حال سابق باقی نمی‌گذارد، مگر اینکه از کسانی باشد که به آنچه اهل کشف آورده‌اند، قائل باشد. در این صورت حال او تغییر نمی‌کند، مگر به اندازه تفاوت بین علم و رؤیت معلوم.\n\nو بدان که خداوند از حیث نفس خود، احدیت احد را دارد، و از حیث اسماء خود، احدیت کثرت را دارد.\n\n> «إِنَّمَا الله إِلهٌ واحِدٌ» (همانا خدا، خدایی یگانه است) *** و دلیل من «قُلْ هُوَ الله أَحَدٌ» (بگو او خدای یکتاست) است.\n> پس اگر در اسماء او سرگردان شدی، *** بدان که این سرگردانی به خاطر عدد است.\n> همه به سوی او بازمی‌گردند هرگاه *** خواننده بخواند: «الله الصَّمَدُ» (الله بی‌نیاز است).\n> «لَمْ يَلِدْ» (نزاده است) به حق و «وَلَمْ يُولَدْ» (زاده نشده است) و *** «وَلَمْ يَكُنْ كُفُواً لِلْإِلَهِ مِنْ أَحَدٍ» (و هیچ کس همتای او نیست).\n> پس عقل در او حیران می‌شود هنگامی که *** وهم با مدد بر او غلبه کند.\n> سپس ازل (ازلی بودن) به سوی او می‌آید در حالی که محکم است *** که در شرع آمده و ابد (ابدی بودن) آن را دنبال می‌کند.\n> و به واسطه ما، حکم برای او بود *** پس اگر ما زایل شویم، هستی (کون) منفرد می‌شود.\n\nو این همان سببی است که موجب طلب تجلی (التجلی) او تعالی در صور مختلف و تحول او در آنها شده است، به دلیل اختلاف اعتقادات در عالم به این کثرت. پس اصل اختلاف اعتقادات در عالم، این کثرت در عین واحد بود. و به همین دلیل، هنگام ظهور او و قولش: «أَنَا رَبُّكُمْ» (من پروردگار شما هستم)، انکار از سوی اهل موقف (محل توقف در قیامت) واقع شد. اگر او در صورتی که میثاق را بر آن از ایشان گرفته بود، بر آنان تجلی می‌کرد، هیچ کس او را انکار نمی‌کرد. پس از وقوع انکار، در صورتی که میثاق را بر آن از ایشان گرفته بود، بر آنان متحول شد، پس به او اقرار کردند، زیرا او را شناختند و اقرارشان برایشان دلالت داشت. و اما تجلی (التجلی) او تعالی در تپه شنی (کثیب) برای رؤیت، در آنجا در صور اعتقادات تجلی می‌کند، به دلیل اختلاف آنان در مراتبشان در آن. و در گرفتن میثاق اختلافی نبود. پس آن (تجلی در میثاق) تجلی عالم برای کثرت است، و تجلی (التجلی) در کثیب، تجلی (التجلی) عام در کثرت است، و تجلی (التجلی) که از خدا برای بنده اوست، در حالی که بنده در مُلک خود است، تجلی (التجلی) خاص واحد برای واحد است. پس رؤیت ما از او در روز مواقف در قیامت، با رؤیت ما از او در گرفتن میثاق متفاوت است، و با رؤیت ما از او در کثیب متفاوت است، و با رؤیت ما از او در حالی که در مُلک خود و در قصرها و نزد خانواده‌هایمان هستیم، متفاوت است. پس اختلاف از همین جا ناشی شد که خداوند در قرآن عزیز بر ما حکم کرده است، در قولش تعالی: «وَلا يَزالُونَ مُخْتَلِفِينَ» (و پیوسته در اختلاف خواهند بود) و قولش: «إِلَّا مَنْ رَحِمَ رَبُّكَ» (مگر کسی که پروردگارت رحم کند). پس آنان کسانی هستند که او را در اختلاف شناختند و انکار نکردند. اینان کسانی هستند که خداوند آنان را بر احدیت کثرت آگاه ساخت، و اینان اهل الله و خاصان او هستند. پس مرحومان با این امری که خداوند آنان را به آن اختصاص داد، با سایر طوایف مخالفت کردند. پس با این وصف، در حکم قول او: «وَلا يَزالُونَ مُخْتَلِفِينَ» داخل شدند، زیرا آنان با آن گروه مخالفت کردند و آن گروه نیز با آنان مخالفت کردند. پس استثناء جز آنچه ذکر کردیم، به ما نداد. پس او سبحانه اولین مسئله اختلافی بود که در عالم ظاهر شد، زیرا هر موجودی در عالم، ابتدا به سبب وجود خود می‌نگرد، چون در نفس خود می‌داند که نبوده و سپس با حدوث خود به وجود آمده است. و فطرت‌هایشان در این باره مختلف شد، پس در اینکه سبب ایجاب‌کننده ظهورشان چیست، اختلاف کردند. به همین دلیل، حق (الحق) اولین مسئله اختلاف در عالم بود. و چون اصل اختلاف در عالم در اعتقادات بود، و سبب آن نیز وجود هر شیئی از عالم بر مزاجی بود که برای شیء دیگر نیست، به همین دلیل سرانجام همه به سوی رحمت است، زیرا خداوند آنان را آفرید و در عماء (فضای ابهام) ظاهر ساخت، که همان نفس رحمان است. پس آنان مانند حروف در نفس متکلم در مخارج هستند که مختلف‌اند. همچنین عالم در مزاج و اعتقاد مختلف شد، با وجود احدیتش که عالمی حادث است. آیا نمی‌بینی که او به مدبر مفصل نامیده شده است؟ پس فرمود عز وجل: «يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ» (امر را تدبیر می‌کند، آیات را تفصیل می‌دهد). و هر آنچه اندکی پیش ذکر کردیم، تفصیل آیات در او و در ماست، و دلالت بر او و بر ماست. و همچنین ما دلایلی بر او و بر خودمان هستیم. زیرا بزرگترین و واضح‌ترین دلالات، دلالت شیء بر نفس خود است. و تدبر از جانب خدا، عین تفکر در متفکران است، که با تدبر تمایز عالم از یکدیگر منافات دارد. و به واسطه تفکر، عالم این را شناخت. و دلیل او که در آن تفکر کرد، عین چیزی است که از نفس خود و از غیر خود مشاهده کرد: «سَنُرِيهِمْ آياتِنا فِي الْآفاقِ وَفِي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ» (به زودی آیات خود را در آفاق و در نفس‌هایشان به آنان نشان خواهیم داد تا برایشان آشکار شود) که آن مرئی، حق (الحق) است.\n\n> همانا تدبر مانند تفکر در حادث است *** و در مهیمن (خداوند) تدبیر بدون نظر است.\n> پس تفکر را خالص کن، زیرا تفکر هلاکت‌بار است *** به واسطه آن بین خدا و بشر تفاوت گذاشته می‌شود.\n\nپس آنچه را در این باب آوردیم و آنچه را حق (الحق) در این منزل از علم رؤیت آشکار ساخت، محقق کن. اگر از اهل شهود (الشهود) و جمع و هستی (الوجود) باشی، در دنیا و آخرت از آن بهره‌مند می‌شوی و در سلک کسانی قرار می‌گیری که خداوند استثناء کرده است، مانند قولش: «إِلَّا مَنْ رَحِمَ رَبُّكَ» (مگر کسی که پروردگارت رحم کند). زیرا فهم عامه در این باره خلاف فهم خاصان خدا و اهل اوست، و آنان اهل ذکر هستند، زیرا آن را بر مراد خدا فهمیدند و این اهلیت را به آنان بخشید. پس در یک عین واحد، چشمی است که جمع می‌کند و چشمی است که تفرقه می‌اندازد، چه در جانب حق (الحق) باشد و چه در جانب خلق. و «وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خدا حق را می‌گوید و او راه را هدایت می‌کند). و در این منزل از علوم، علم انواع کتاب‌های نازل شده و علم به هر یک از آنها بر حسب اسمی که بر آن دلالت می‌کند، وجود دارد. از آنجا مرتبه آن کتاب را می‌شناسی، اگرچه هر اسمی برای کتاب، برای هر کتابی صالح است، زیرا اسم صفتی در آن است، اما به طور خاص به این اسم اختصاص نیافته است، مگر به دلیل اینکه حکم آن در این کتاب کامل‌تر از سایر اسماء است.\n\nمانند قول او (پیامبر) علیه السلام: «أقضاكم علي وأفرضكم زيد وأعلمكم بالحلال والحرام معاذ بن جبل» (قضاوت‌کننده‌ترین شما علی است، و داناترین شما به فرائض زید است، و داناترین شما به حلال و حرام معاذ بن جبل است).\n\nو ما کتاب‌ها و اسماء آنها را در این کتاب ذکر کرده‌ایم، یعنی بخشی از آن را در منزل قرآن و در کتاب *مواقع النجوم* در عضو زبان. زیرا خداوند متعال هنگامی که در قرآن عزیز به آنچه بر ما نازل کرده اشاره می‌کند، گاهی اشاره به عین کتاب می‌کند و می‌فرماید: «ذلِكَ الْكِتابُ» (آن کتاب)، و گاهی به آیات آن اشاره می‌کند و می‌فرماید: «تِلْكَ آياتُ الْكِتابِ» (اینها آیات کتاب است). و گاهی اشاره را ترک می‌کند و کتاب را بدون اشاره ذکر می‌کند. و برای هر یک از این احکام، فهمی از جانب ما وجود دارد که مخصوص آن است و ناگزیر باید باشد. و در آن (این باب) علم تفاوت بین سحر و معجزه است. و در آن علم آنچه مردم نزد خدا دارند، از حیث صفاتی که در آنان قائم است، وجود دارد. پس از آن، منزلت خود را نزد پروردگارش می‌شناسد. زیرا خداوند بر بنده خود از آنجا نازل می‌شود که بنده، پروردگارش را از نفس خود نازل کرده است. پس بنده نفس خود را از پروردگارش نازل کرده است، پس نباید جز خود را ملامت کند، اگر منزلت دیگری را ببیند که از رفعت منزلت او فراتر است. این همان خسران مبین (زیان آشکار) است، زیرا او توانایی آن را داشت و انجام نداد. و به همین دلیل روز قیامت، «يَوْمُ التَّغابُنِ» (روز مغبون شدن) نامیده می‌شود، زیرا آن روز کشف حجاب است و امور واقع شده در دنیا آشکار می‌شود که در آنجا چه ثمری داده‌اند. پس کافر که همان جاهل است، می‌گوید: «يا لَيْتَنِي قَدَّمْتُ لِحَياتِي» (ای کاش برای زندگی‌ام پیش فرستاده بودم)، به دلیل علمش به اینکه توانایی آن را داشت و انجام نداد. پس عذاب او، ندامت او و آنچه نفس خود را در آن مغبون کرده است، بر او سخت‌تر از اسباب عذاب خارجی است، و این همان عذاب اکبر است. و در آن علم استدلال بر خدا به چه چیزی است؟ آیا به خداست یا به عالم یا به نسبت‌هایی که در آن است؟ و در آن علم فایده اختلاف انوار است، تا جایی که برخی از آنها کاشف و برخی سوزاننده هستند. و در آن علم مقادیر حرکات زمانی و حکم اسم دهر بر آنهاست، که آن اسمی از اسماء الله تعالی است. و در آن علم اختلاف آیات به دلیل اختلاف صفات ناظران در آنهاست. و در آن علم آنچه از غفلت نکوهیده و آنچه ستوده است، وجود دارد. و در آن علم اسباب ایجاب‌کننده آنچه در آخرت به آن می‌انجامد، در کسی که در او تأثیر گذاشته است، وجود دارد. و در آن علم آنچه اولین انسان در نشئه خود به آن سخن گفت، یعنی «الحمد لله» است، و آن «آخِرُ دَعْواهُمْ أَنِ الْحَمْدُ لِلَّهِ» (آخرین دعایشان این است که حمد مخصوص خداست) می‌باشد. پس عالم با ثنا آغاز شد و با ثنا ختم شد. پس شقاوت سرمدی کجاست؟ حاشا که غضب او بر رحمتش سبقت گیرد، پس او صادق است، یا اینکه وسعت رحمتش را پس از آنکه مرتبه عموم را به آن بخشید، تخصیص دهد. حکایتی در این باره: سهل بن عبدالله با ابلیس ملاقات کرد. ابلیس در مناظره با او گفت: خداوند متعال می‌فرماید: «وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ» (و رحمت من همه چیز را فرا گرفته است). و «کل» عموم را افاده می‌کند و «شیء» نکره‌ترین نکره‌هاست. پس من یأس خود را از رحمت خدا قطع نمی‌کنم. سهل گفت: من متحیر ماندم. سپس به گمان خود به تقیید آن تنبه یافتم و به او گفتم: ای ابلیس، خداوند آن را با قولش: «فَسَأَكْتُبُها» (پس آن را خواهم نوشت) مقید کرده است. ابلیس گفت: ای سهل، تقیید صفت توست نه صفت او. پس جوابی برای او در این باره نیافتم.\n\nو در آن علم آنچه از تأنی (آهستگی) و تثبط (سستی) ستوده و آنچه نکوهیده است، وجود دارد. و علم آنچه از عجله در امور ستوده و آنچه نکوهیده است. و در آن علم بازگشت به سوی خدا از روی قهر است، هنگامی که مانند او (بنده) با احسان به سوی او بازگردد. و آیا این دو بازگشت مساوی هستند یا نه؟ و این مسئله‌ای است که اهل الله (اهل الله) در آن حیران شده‌اند، یعنی در رجوع اضطرار و رجوع اختیار، زیرا در اختیار بویی از ربوبیت است و اضطرار تماماً عبودیت است. پس این سبب اختلاف در این است که کدام یک از این دو بازگشت در حق انسان کامل‌تر است. و در آن علم محاورات و مناظرات در مجالس علما بین خودشان است، و اینکه همه اینها از محاورات اسماء الهی با یکدیگر است، سپس این امر در ملأ اعلی ظاهر شد، آنجا که با وجود اشتغالشان به خدا، با یکدیگر خصومت می‌کنند، و اینکه آنان (ملائکه) علیهم السلام در تسبیح خود سستی نمی‌کنند و خسته نمی‌شوند. پس آیا خصومت آنان از تسبیح آنان است؟ همان‌گونه که رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) در همه احوال خود خدا را ذکر می‌کرد، با وجود اینکه با اعراب در مجالسشان و با خانواده‌اش سخن می‌گفت. پس آیا همه اینها ذکر خداست یا نه؟ و اما اختلاف کسانی که از طبایع خلق شده‌اند، انکار نمی‌شود، زیرا طبایع متضاد هستند. پس هر کسی این را درک می‌کند و نزاع در عالم طبیعت را انکار نمی‌کند، اما آن را در مافوق طبیعت انکار می‌کنند. اما اهل الله (اهل الله) نزاع در هستی (الوجود) را اصلاً انکار نمی‌کنند، به دلیل علمشان به اسماء الهی و اینکه آنها بر صورت عالم هستند، بلکه خداوند عالم را بر صورت آنها ایجاد کرده است، زیرا آنها اصل هستند و در آنها مقابل، مخالف، موافق و مساعد وجود دارد. و در آن علم تفاوت بین کسی است که معلمش خداست، و کسی که معلمش نظر فکری اوست، و کسی که معلمش مخلوقی مانند اوست. اما صاحب نظر، به معلم خود ملحق می‌شود. و اما صاحب القاء الهی، به معلم خود ملحق می‌شود، به ویژه در علم الهی که در حقیقت جز با اعلام او دانسته نمی‌شود. زیرا درک آن با اعلام الهی دشوار است، پس چگونه با نظر فکری؟ و به همین دلیل رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) از تفکر در ذات خدا نهی کرد. و مردم از این مقدار غافل شده‌اند، پس هیچ یک از آنان از تفکر در آن و حکم بر آن از حیث فکر سالم نمانده است. و برای ابوحامد غزالی در هیچ حادثه‌ای، به حمد خدا، بزرگتر از این نیست، زیرا او در ذات خدا از حیث نظر فکری در آنچه بر غیر اهلش مضنون (بخل ورزیده) است و در غیر آن سخن گفته است. و به همین دلیل در هر آنچه گفته خطا کرده و به صواب نرسیده است. و ابوحامد و امثال او در این باره به نهایت جهل و بلیغ‌ترین تناقض با آنچه خداوند ما را به آن آگاه ساخته، آمده‌اند. و هنگامی که فکر به آنان چیزی داد که خلاف اعلام الهی بود، به تأویل بعید نیاز پیدا کردند تا جانب فکر را بر جانب اعلام خدا از نفس خود، که چه چیزی شایسته است به او نسبت داده شود و چگونه شایسته است به او تعالی نسبت داده شود، یاری دهند. پس من کسی را ندیدم که در این باره در موضع ادب توقف کرده باشد، مگر اینکه کورکورانه در آن فرو رفته است، جز اندکی از اهل الله (اهل الله) که وقتی آنچه را رسولان او (صلوات الله علیهم) در وصف خود آورده‌اند شنیدند، علم آن را به او واگذار کردند و تأویل نکردند، تا اینکه خداوند فهم آن را با اعلام دیگری که در قلب‌هایشان نازل کرد، به آنان بخشید. پس مسئله از جانب او تعالی بود و شرح آن نیز از جانب او تعالی بود. پس او را به واسطه او شناختند نه به واسطه نظر خود. پس خداوند ما را از ادیبان، امینان، پرهیزکاران، بی‌گناهان، و پنهان‌کارانی قرار دهد که حق (الحق) آنان را برای خود برگزیده و پنهانشان کرده است در خزانه‌های عادات در احوالشان. و در آن علم قول کسی است که از جانب خدا سخنی را ابلاغ می‌کند که اگر آن را از جانب خود بر مجرای عرف می‌گفت، با آنچه ادعا کرده که از نزد خدا آورده، بر خود رد می‌کرد. پس هنگامی که آن را به امر خدا گفت، معنای آن با امر الهی شناخته شد. و آن، قول انسان است هنگامی که کسی از خلق خدا، از سلطان یا غیر او را به خیری امر می‌کند، و آن امر به خیر از سوی کسی که به او امر شده، ضرری در نفس او، یا نفسی یا حسی، یا مجموع آن دو، بر او وارد می‌کند. پس کسی که آن را رد می‌کند و به او ضرر می‌رساند، خدا را سبک شمرده است، و این سخت‌ترین چیزی است که بر داعی الی الله می‌گذرد، زیرا او در آنچه به خیر دعوت کرده، بر بصیرتی از خداست. پس در آن هنگام می‌گوید: ای کاش او را به هیچ یک از اینها دعوت نمی‌کردم، به دلیل ضرری که در آن بر او عارض شد. پس این لغزشگاه عارفان است اگر چنین بگویند. زیرا خداوند می‌فرماید: «وَقُلِ الْحَقُّ مِنْ رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ وَمَنْ شاءَ فَلْيَكْفُرْ» (و بگو حق از پروردگار شماست، پس هر کس خواست ایمان بیاورد و هر کس خواست کفر ورزد). پس اگر بنده آن را به امر خدا بگوید، مانند قول خداوند متعال که به پیامبرش علیه السلام فرمود: «قُلْ» (بگو) و او را امر کرد: «لَوْ شاءَ الله ما تَلَوْتُهُ عَلَيْكُمْ وَلا أَدْراكُمْ بِهِ وَلكِنَّهُ شاءَ فَتَلَوْتُهُ عَلَيْكُمْ وَأَدْراكُمْ بِهِ» (اگر خدا می‌خواست، من آن را بر شما نمی‌خواندم و شما را به آن آگاه نمی‌ساختم، ولی او خواست، پس آن را بر شما خواندم و شما را به آن آگاه ساختم)، یعنی فهم آن را به شما داد، پس دانستید که آن حق (الحق) است، همان‌گونه که فرمود: «وَجَحَدُوا بِها وَاسْتَيْقَنَتْها أَنْفُسُهُمْ» (و آن را انکار کردند در حالی که نفس‌هایشان به آن یقین داشت). پس اگر وارث یا کسی که آن را بر این حد بگوید، او معلمی است که می‌داند امر بر چه قرار است. و به همین دلیل خداوند به گفتن چنین چیزی امر کرده است. و بسیار اتفاق می‌افتد که مردم بر اهل الله (اهل الله) عتاب می‌کنند، هنگامی که به خیری امر می‌کنند و آن امر ضرری محسوس در نفسشان به دنبال دارد. و این از مؤمن و از گوینده‌ای که از روی کشف (الکشف) سخن می‌گوید، واقع نمی‌شود. زیرا به رسول علیه السلام گفته شد: «فَإِنَّما عَلَيْكَ الْبَلاغُ» (پس همانا بر تو فقط ابلاغ است) و به او گفته شد: «بَلِّغْ ما أُنْزِلَ إِلَيْكَ» (آنچه بر تو نازل شده ابلاغ کن). و همچنین بر وارث واجب است. پس چگونه صحیح است که او از انجام کاری که بر او واجب است، به دلیل ضرری که به او رسیده، یا از روی شفقت بر کسی که نشنیده، پشیمان شود، در حالی که با آگاه ساختن او، شقاوتش را افزایش داده است، هنگامی که به آن گوش نداده است؟ و این همه حدیث نفس است. و دین، نصیحت برای خدا و رسولش و برای پیشوایان مسلمانان و عموم آنان است. پس هیچ مانعی تو را از آن باز ندارد. و من اقوامی را دیدم که ادعا می‌کردند از اهل این شأن هستند، هنگامی که آنچه را از حق (الحق) آورده بودند، در روی آنان رد می‌شد، منقبض می‌شدند و می‌گفتند: فضولی ما ما را به این کار کشاند، و اگر خدا می‌خواست، ما چیزی از این را نمی‌گفتیم، با وجود مثال اینان. و ما بر نفس خود جنایت کردیم و توبه کردیم و دیگر نزد امثال اینان چنین قولی را باز نمی‌گوییم. و بر آن اظهار ندامت می‌کنند. و این همه جهل آنان به امر است و دلیلی قاطع بر این است که او از جانب خدا خبر نمی‌دهد و چیزی از آن را با اذن الهی نرسانده است. زیرا کسی که از جانب خدا خبر می‌دهد، در باطن خود جز نور ساطع نمی‌بیند، چه قولش پذیرفته شود یا رد شود یا آزار ببیند. و کسی که از جانب نفس خود سخن می‌گوید، اگرچه حق (الحق) را بگوید، اگر بر او رد شود، ندامت و تنگی و حرج در نفسش به دنبال دارد و کلام خود را فضول می‌شمارد، پس حق واجب را فضول رد کرده است. پس این جهل بر جهل است. پس نصیحت برای بندگان خدا بر هر مؤمنی به خدا واجب است و باکی ندارد از ضرری که از سوی کسی که او را نصیحت می‌کند، بر او عارض می‌شود. زیرا خداوند در مورد وارثان می‌فرماید: «وَيَقْتُلُونَ الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ مِنَ النَّاسِ» (و کسانی را که به قسط (عدل) امر می‌کنند، می‌کشند). و این قول عطف بر قول اوست: «وَيَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّ» (و پیامبران را به ناحق می‌کشند). این را در مقام ستایش از آنان و نکوهش کسانی که به آنچه رسول و وارث به آنان ابلاغ کرده، گوش نداده‌اند، ذکر کرده است. و چه شادی‌ای بزرگتر از کسی است که به ستایش خدا از خود شاد شود؟ «قُلْ بِفَضْلِ اللهِ وَبِرَحْمَتِهِ فَبِذلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ» (بگو به فضل خدا و رحمت او، پس به آن باید شاد شوند، که آن بهتر از چیزی است که جمع می‌کنند). و در آن علم صفاتی است که اهل استحقاق به واسطه آنها متمایز می‌شوند تا حقوقشان را از کسی که آن بر او معین شده است، به طور کامل دریافت کنند. و از حقوق، برخی مستلزم ثنای جمیل بر کسی است که حق او را به طور کامل ادا نمی‌کند، مانند مجرمی که به دلیل جرم‌هایش مستحق عذاب است، اما از او درگذشته می‌شود. پس این حقی است که باطل شده و ستوده است، همان‌گونه که غیبت حق است و نکوهیده است. و کسی که این را بشناسد، حق (الحق) را می‌شناسد که چیست و بین آن و صدق تفاوت می‌گذارد و در آن هنگام می‌داند که غیبت حق نیست، بلکه صدق است. و به همین دلیل از صادق درباره صدقش سؤال می‌شود، اما از صاحب حق هنگامی که حق بر او قائم است، سؤال نمی‌شود. پس غیبت و نمیمه و مانند آن، صدق هستند نه حق، زیرا حق چیزی است که واجب شده است و صدق چیزی است که به همان صورتی که هست، خبر داده شده است. و گاهی واجب می‌شود و حق می‌گردد، و گاهی واجب نمی‌شود و صدق است نه حق. به همین دلیل از صادق درباره صدقش سؤال می‌شود؛ اگر بر او واجب بوده، نجات می‌یابد، و اگر بر او واجب نبوده، بلکه از آن منع شده، در آن هلاک می‌شود. پس کسی که تفاوت بین حق (الحق) و صدق را بداند، بر او معین می‌شود که در استحقاق سخن بگوید. و در آن علم آنچه از ذلت برای غیر خدا ناشی می‌شود، به دلیل قرار دادن او در منزلت پروردگارش از روی جهل به او، وجود دارد. پس اگر ذلت برای صفت باشد بدون در نظر گرفتن محل، در آن حکم دیگری وجود دارد. و در آن علم آنچه بر خدا حکم می‌کند، در حالی که او بهترین حاکمان است، وجود دارد. و از اینجا می‌دانی که اگر صفات او زائد بر ذات او بودند، همان‌گونه که متکلم اشعری می‌گوید، بر ذات چیزی حکم می‌شد که زائد بر آن است و عین آن نیست. و این مسئله‌ای است که در آن پای بسیاری از علما لغزیده است و قیاس شاهد بر غایب یا جاری کردن دلالت شاهد و غایب، آنان را در آن گمراه کرده است. و این نهایت غلط است. زیرا حکم بر محکوم‌علیه به امری، بدون دانستن ذات و حقیقت محکوم‌علیه، جهل عظیمی از سوی حاکم بر اوست. پس دلالت را در نسبت دادن امری به چیزی، بدون شناخت حقیقت آن منسوب‌الیه، جاری نکن. و در آن علم این است که برای هیچ یک از مخلوقات جایز نیست که بر خدا حکم کنند، حتی اگر به هر منزلتی برسند، مگر اینکه او به آن امر کند. پس به امر او حکم می‌کند در آنچه برای او جایز است که بر نفس خود واجب کند، اگر از عالم باشد. برخلاف حق (الحق)، زیرا مکلف تحت حجر (محدودیت) است. پس اگر بر نفس خود انجام کاری را که بر او حرام شده، واجب کند، برای او جایز نیست و کفاره آنچه واجب کرده، کفاره قسم است. پس از عقوبت خالی نمی‌ماند، حتی اگر آنچه را واجب کرده انجام ندهد، زیرا برای او جایز نبوده است. و کسی که بر نفس خود انجام کاری را که برای او مباح شده، واجب کند، کفاره‌ای بر او نیست و چاره‌ای جز انجام آن ندارد و ناگزیر باید آن را انجام دهد. و در آن علم مکر خفی و تعجیل جزا بر آن است. و در آن علم موجب اضطرار در اختیار و آنچه اضطرار سود می‌رساند، وجود دارد. و در آن علم اسبابی است که عالم را به امری که حکم آن علم از عمل اقتضا می‌کند، به فراموشی می‌اندازد، و آنها بسیارند. و در آن علم حسرت است، و آن این است که هیچ کس او را بر آنچه جنایت کرده، مؤاخذه نمی‌کند جز آنچه خود جنایت کرده است. پس او کسی است که نفس خود را مؤاخذه کرده است، پس نباید جز خود را ملامت کند. و کسی که از چنین چیزی پرهیز کند، به فوز عظیمی دست یافته است. و به این وسیله حجت خدا بر خلقش تمام می‌شود. و اینکه اگر بر آنان کرم کند با مسلط نکردن آنان بر خودشان و عفو و مغفرت کند، ثنا به صفت کرم و احسان بر او واجب می‌شود. و در آن علم دعوت خدا از بندگانش است که چرا آنان را دعوت می‌کند؟ آیا به عمل آنچه مکلف کرده است یا به آنچه عمل مکلف شده در سرای آخرت نتیجه می‌دهد؟ و اینکه خداوند هرگز بندگانش را مکلف نکرده و آنان را به تکلیفی جز با واسطه دعوت نکرده است، زیرا او بالذات به آنچه در آن مشقت است، دعوت نمی‌کند. به همین دلیل رسولان (علیهم الصلاة والسلام) را برگزید و فرمود جل ثناؤه: «وَما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا» (و ما عذاب‌کننده نبودیم تا اینکه رسولی بفرستیم). و در آن علم جزای وفاق است. و اگر چیزی خارج از جزا ببخشد، آن از اسم واهب و وهاب است. و در آن علم عذاب متخیل است. و در آن علم به یاد آوردن عالم چیزی است که فراموش کرده بود، زیرا به آن عمل نکرده بود. زیرا عامل به علم، ایجادکننده صورت آن است، پس محال است که آن را فراموش کند. و در آن علم حسن تعلیم است، زیرا هر معلمی تعلیم را نیکو نمی‌داند. و در آن علم تأسی به خدا چگونه است، در حالی که او در افعال خود مطلق است و تو مقید. و در آن علم بحث و تشویق بر عمل به اولی و اوجب است. و در آن علم فرق بین علم و ظن، یعنی غلبه ظن، است. و در آن علم عصمت و اعتصام است. و در آن علم آنچه به معاند گفته می‌شود، هنگامی که به حق (الحق) بازنمی‌گردد، وجود دارد، و آن چیزی است که به علم انصاف بازمی‌گردد. و در آن علم آنچه به واسطه آن دانسته می‌شود که افعال بندگان، افعال حق (الحق) است، اما به وجهی به بندگان و به وجهی به حق (الحق) اضافه می‌شود. زیرا اضافه در زبان در اصطلاح نحویان، محضه (خالص) و غیر محضه است. و برخی از افعال هنگامی که به خدا اضافه می‌شوند، محضه برای خدا هستند، و برخی غیر محضه، به دلیل اشتراکی که در آنهاست و خالص نشده‌اند. پس عبودیت برای خدا خالص است و به خالص کردن آن امر شده است، همان‌گونه که فرمود تعالی: «وَما أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ الدِّينَ» (و امر نشدند مگر برای اینکه خدا را بپرستند در حالی که دین را برای او خالص کرده‌اند)، و این همان چیزی است که آنان را به آن متعبد ساخته است. و قول او: «قُلِ الله أَعْبُدُ مُخْلِصاً لَهُ دِينِي» (بگو خدا را می‌پرستم در حالی که دینم را برای او خالص کرده‌ام)، و این همان چیزی است که در این موضع او را به آن متعبد ساخته است. و قول او: «إِنَّ الله لا يَظْلِمُ النَّاسَ شَيْئاً» (همانا خدا به مردم هیچ ظلمی نمی‌کند)، کلمه‌ای برای تحقیق است. زیرا مردم مالک چیزی نیستند تا آنچه از آنان گرفته می‌شود، بدون وجه حق، غصب باشد. پس هر آنچه گفته می‌شود که ملک آنان است، ملک خداست، و از جمله آن، اعمالشان است. سپس فرمود: «وَلكِنْ أَنْفُسَهُمْ يَظْلِمُونَ» (ولی به خودشان ظلم می‌کنند). پس سبحانه از نفس خود به نفس‌های آنان کنایه آورد، هنگامی که ظلم در عالم واقع شد و به آن گفته شد. پس گویی فرمود: ولی نفس خود را ظلم می‌کند، اگر این ظلمی باشد و ناگزیر است. و مالک در ملک خود به نفس خود ظلم نمی‌کند. اگر آنچه نزد مردم است، ملک آنان بود، خداوند آنان را از تصرف در آن منع نمی‌کرد و برای آنان در آن حدود متنوعی قرار نمی‌داد. این به تو دلالت می‌کند که افعال مکلف از آن او نیست، بلکه از آن خداست. پس ظلم در حقیقت در مردم، ادعای آنان است در مورد چیزی که از آن آنان نیست و می‌گویند از آن ماست. پس خداوند آنان را مجازات نکرد مگر به دلیل ادعای دروغین. و در آن علم گنجاندن کثیر در قلیل است، تا جایی که گفته می‌شود قلیل است، در حالی که در نفس الامر کثیر است. و در آن علم آجال (سررسیدها) در اشیاء و معنای قول او: «لا يَسْتَأْخِرُونَ ساعَةً وَلا يَسْتَقْدِمُونَ» (نه ساعتی تأخیر می‌کنند و نه پیشی می‌گیرند) بر آن ساعت است.\n\nو در آن علم کسی است که ادعای دروغی بر او شده است، و مدعی‌علیه می‌داند که مدعی دروغگوست و بینه‌ای (شاهدی) برای او اقامه نشده است، پس قسم بر او واجب شده است. او از جانب خدا مأمور است که قسم بخورد و حق ندارد قسم را به مدعی برگرداند و نه اینکه از قسم خوردن خودداری کند و آنچه را مدعی شده به او بدهد، زیرا در این صورت او را بر ظلم به نفس خود یاری کرده است. و او با قسم خوردن، نفس صاحبش را از تصرف در آنچه به ناحق ادعا کرده، حفظ کرده است، زیرا اگر تصرف کند، گناه همراه او خواهد بود، و قسم مانع از آن است. و از گناه مدعی جز گناه قسم خاص باقی نمی‌ماند، زیرا گناه دروغ او در ادعایش با قسم زایل شده و وبال قسم دروغ بر خود او بازگشته است. پس او به منزله کسی است که دروغ قسم خورده باشد، و گناه کسی که قسم خورده، اگر در قسمش دروغگو باشد، بر او بازمی‌گردد. مثلاً مردی بر مردی صد دینار ادعا کند، در حالی که در ادعایش دروغگوست و بینه‌ای که ادعایش را تصدیق کند، اقامه نشده است. پس حاکم قسم را بر مدعی‌علیه واجب می‌کند. اگر مدعی‌علیه قسم را به مدعی برگرداند، و حاکم از کسانی باشد که این را جایز می‌داند، اگرچه نزد ما جایز نیست، این مدعی‌علیه مدعی را نصیحت نکرده است، در حالی که مأمور به نصیحت است. پس اگر مدعی به حکم قاضی قسم بخورد، گناه قسم فاجره (گناهکارانه) بر اوست، و بر مدعی‌علیه گناه ظلم به قسم‌خورنده است، زیرا اوست که او را وادار به قسم خوردن کرده است. و بر حاکم گناهی نیست، زیرا او مجتهد است و نهایت امر این است که در اجتهادش خطا کرده باشد، پس برای او اجر است. اگر مدعی‌علیه برخیزد و آنچه را مدعی بر او ادعا کرده به او بدهد، گناه بر مدعی‌علیه مضاعف می‌شود، زیرا او را قادر به تصرف در مالی کرده است که تصرف در آن برای او حلال نیست. و گناه بر مدعی باقی می‌ماند تا زمانی که در آن مال و آنچه از آن حاصل می‌شود، تصرف کند. و گناه بر مدعی‌علیه نیز باقی می‌ماند، از این جهت که برادرش را بر ظلم یاری کرده و شایسته او نبوده است، و از این جهت که امر خدا را با ترک قسم نافرمانی کرده است، زیرا خداوند قسم را بر او واجب کرده بود. پس اگر قسم می‌خورد، به آنچه خدا بر او واجب کرده عمل کرده بود و مأجور بود، و نیتش رها کردن مدعی از تصرف در ظلم بود، پس اجر آن را داشت. و با قسم مدعی‌علیه، جز گناه قسم خاص بر مدعی باقی نمی‌ماند. پس بر مدعی گناه قسم دروغ است که همان یمین غموس (قسم غوطه‌ورکننده در گناه) است. و این مسئله‌ای لطیف در شرع است که جز کسی که دین خود را حفظ کرده و از اهل الله (اهل الله) باشد، با این نظر به آن نمی‌نگرد، زیرا او برای مردم آنچه را برای خود دوست دارد، دوست می‌دارد، پس برادرش را بر ظلم به نفس خود یاری نمی‌کند، اگر او چنین اراده کند. و در آن علم آنچه از قدح (طعنه زدن) نکوهیده و آنچه ستوده است، وجود دارد. و در آن علم مراقبه و حضور است، و اینکه آن دو از ابواب عصمت و حفظ الهی و تحصیل علم نافع هستند. و در آن علم صفات اهل بشارت و انواع مبشرات و جایگاه آنها و آنچه از آنها بد و آنچه خوشحال‌کننده است، وجود دارد. و در آن علم آنچه بر کسی که به خدا اعتزاز جوید، از عزت و وقایه و حمایت الهی ظاهر می‌شود، وجود دارد. و در آن علم کسی است که به آنچه شنیده و عمل به آن بر او واجب بوده، عمل نکرده است، که سبب منع او از آن چه بوده است؟ و آیا حکم او حکم کسی است که نشنیده، پس خداوند بر او تفضل کرده است، یا حکم او حکم کسی است که دانسته و عمل نکرده، پس خداوند او را مجازات کرده است، و در این صورت خداوند در حق او عدل کرده است؟ زیرا او می‌فرماید: «وَلا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا» (و مانند کسانی نباشید که گفتند شنیدیم)، زیرا آنان حقیقتاً شنیدند و فهمیدند، چون خداوند با زبان خودشان با آنان سخن گفت. پس فرمود تعالی: «وَهُمْ لا يَسْمَعُونَ» (و آنان نمی‌شنوند)، یعنی حکم آنان نزد ما حکم کسی است که نشنیده، با وجود اینکه شنیده‌اند. و خداوند نفرمود که در مورد آنان به چه چیزی حکم می‌کند، اگرچه غالب امر از قرائن احوال، عقوبت است، اما امکان در نفس الامر مرتفع نمی‌شود، به دلیل آنچه از فضل خدا و گذشت او از بدی‌های امثال اینان دانسته می‌شود. پس بفهم. و در آن علم آنچه خداوند به متوکل در قلبش می‌بخشد، هنگامی که بر خدا حق توکل کند، وجود دارد. و در آن علم خلافت الهی است. و در آن علم اسباب مهر زدن بر قلب‌هاست که به شقاوت می‌انجامد. و در آن علم طلب اقامه بینه از مدعی است. و این علم شامل قول خداوند متعال است: «وَما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا» (و ما عذاب‌کننده نبودیم تا اینکه رسولی بفرستیم). و نفرمود: تا اینکه شخصی را بفرستیم. پس ناگزیر باید رسالت مبعوث نزد کسی که به سوی او فرستاده شده، ثابت شود. پس ناگزیر باید دلالت بینه ظاهره نزد هر شخص شخصی از کسانی که به سوی آنان فرستاده شده، اقامه شود. زیرا چه بسا آیتی باشد که در آن از ابهام یا احتمال باشد، به طوری که برخی از مردم دلالت آن را درک نکنند. پس ناگزیر باید دلیل برای هر کسی که بر او اقامه شده، واضح باشد تا نزد او ثابت شود که او رسول است. و در آن هنگام اگر پس از یقین انکار کند، مؤاخذه معین می‌شود. پس در این آیه رحمت عظیمی است، به دلیل آنچه خلق بر آن هستند از اختلاف فطرت‌ها که به اختلاف نظر می‌انجامد. و خداوند این کار را نکرد مگر از روی رحمت به بندگانش، برای کسی که شمول رحمت الهی را می‌داند که خداوند متعال خبر داده که «وَسِعَتْ كُلَّ شَيْ‏ءٍ» (همه چیز را فرا گرفته است). و در آن علم آنچه کرم نتیجه می‌دهد و آنچه بخل نتیجه می‌دهد، وجود دارد. و در آن علم رفع اشکال در تلفظ به ایمان است، تا شنوندگان به طور یقینی بدانند که او مؤمن است، و این همان چیزی است که به نصوص تعبیر می‌شود. زیرا ظاهر، اگرچه چیزی است که در اولین نگاه در وضع دانسته می‌شود، اما احتمال به آن راه می‌یابد. و در آن علم کسی است که خداوند به او عنایت کرده است از بندگانش. و در آن علم خذلان (واگذاشتگی) و اهل آن است. و در آن علم آنچه صاحب حق (الحق) به آن بازمی‌گردد، هنگامی که حق در روی او رد شود، وجود دارد. و در آن علم انواع صبر در صابران و شکر در شاکران است. و «وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خدا حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 8
}