{
  "id": 203,
  "title": {
    "ar": "الباب الثالث ومائتان في حال الرياضة",
    "en": "Chapter Two Hundred and Third: Concerning the State of Spiritual Discipline.",
    "ur": "باب نمبر دو سو تین: ریاضت کا حال",
    "fa": "باب دویست و سوم در بیان حال ریاضت"
  },
  "content": {
    "ar": "## «الباب الثالث ومائتان في حال الرياضة»\n\n\n> إذا هذب الإنسان أخلاق نفسه *** وأخرجها عن طبعها ومرادها\n\n\n> وذاك محال عندنا كونه فما *** يرى راضها من راضها بعنادها\n\n\n> فإن كنت ذا علم فإن مصارفا *** لها عينت بالشرع عند فسادها\n\n\n### [الرياضة قسمان‏]\n\n\nاعلم أن الرياضة عند القوم من الأحوال وهي قسمان رياضة الأدب ورياضة الطلب‏\n\n\nفرياضة الأدب‏\n\n\nعندهم الخروج عن طبع النفس‏\n\n\nورياضة الطلب‏\n\n\nهي صحة المراد به أعني بالطلب‏\n\n\nوعندنا الرياضة تهذيب الأخلاق فإن الخروج عن طبع النفس لا يصح ولما كان لا يصح بين الله لذلك الطبع مصارف فإذا وقفت النفوس عندها حمدت وشكرت ولم تخرج بذلك عن طبعها فرياضتها اقتصارها على المصارف التي عينها لها خالقها فإن عين الشي‏ء المزاجي ليس غير مزاجه فلو خرج الشي‏ء عن طبعه لم يكن هو ولهذا يكون قول من قال رياضة الطلب صحة المراد به فإنه إذا كان الشي‏ء مرادا به أمر ما والمريد لذلك الأمر هو موجد ذلك الشي‏ء وقد عينه له وعرفه به وإن ذلك القدر يريد منه فتصرف فيه بطبعه على ذلك الحد كان صاحب رياضة لأنه لو تصرف في نقيض ما أريد منه لكان تصرفه فيه بطبعه أيضا فما كان التهذيب فيه إلا صرفه عن الإطلاق في التصرف إلى التقييد فإن أراد صاحب القول في رياضة الأدب أنه الخروج عن طبع النفس بمعنى ما كان لها فيه التصرف مطلقا صار مقيدا فحمل هذا الشخص نفسه على ما قيدها به خالقها من التصرف فيه ودخلت تحت التحجير بعد ما كانت مسرحة فهو الذي ذكرناه وإن أراد غير ذلك فليس إلا ما قلناه وذلك أن الرياضة تذليل النفس وإلحاقها بالعبودية ولذا سميت الأرض أرضا وذلولا فالرياضة عندنا من صير نفسه أرضا أي مثل الأرض يطئوها البر والفاجر ولا يؤثر عندها تمييزا بل تحمل البار حبا لما هو عليه من مراضي سيده وتحمل الفاجر حمل الله إياه بكونه يرزقه على كفره بنعمه وجحده إياها ونسيان رب النعمة فيها وإلى الرياضة يرجع مسمى الرضي على الحقيقة إن تفطنت لأن النفس تطلب بذاتها الكثير من الخير لأن الأصل على ذلك فإن الله تعالى ما طلب إلا الممكنات وهي غير متناهية ولا أكثر مما لا يتناهى وما لا يتناهى لا يدخل في الوجود دفعة ولكن يدخل قليلا قليلا لا إلى نهاية فإذا نسبت إليه ما توجه إليه طلبه من الكثرة ثم رضي من ذلك باليسير والتدريج لعلمه أن ما لا يتناهى لا يمكن حصوله في الوجود رضي بذلك القدر الذي يدخل منه فمتعلق الرضي لا يكون إلا بالقليل ولا يكون مخلوق بأعظم قدرا من خالقه وإذا كانت هذه صفة الحق فهي بالعبد أولى فما عند الله لا يتناهى ومطلب هذا العبد من الله ما عنده ولا يتمكن دخوله في الوجود إلا قليلا قليلا لا إلى نهاية فرضي بذلك القدر العبد وهو قليل بالنسبة إلى متعلق علمه بما عند الله فرضي عن الحق ورضي الحق عنه فوقع الاقتصار من العالم بما لا يتناهى على ما أعطى من ذلك مما يتناهى رياضة منه عن مطلق تعلق علمه من ذلك إذ قد علم أيضا أن ما لا يتناهى لا يدخل في الوجود فحقيقة الرياضة ترجع إلى هذا لأن الآدمي لما خلق على الصورة زهت نفسه وتخيلت أن التحجير لا يصح على من له العزة وما علمت أن العزة تحجير فإن العزة حمى والحمى تحجير فعين ما ادعت به الإطلاق ذلك‏\nبعينه قيدها فلما أشهدها الحق حضرة عزه ونفوذ اقتداره ومع نفوذ اقتداره لم يعطه الإمكان من نفسه إلا قدر ما يحصل منه في الوجود انكسرت النفس وصار ما كانت تصول به أورثها ما أشهدها ذلة وانكسارا فإنها تقبل الذلة لجهلها فارتاضت والحق لعلمه على عزه فرياضة العلم أنفع الرياضات فما أزالها العلم عن الصورة ولكن أولا جهلت ما هي الصورة عليه وما هي الحقائق عليه فما أشرف العلم لو لم يكن من شرف العلم إلا تجلى الحق في صورة تنكر ثم تحوله في صورة تعرف وهو هو في الأولى والثانية وإن موطن تلك المشاهدة لا يتمكن في نفس الأمر إلا أن تكون مقيدة لأن الذي يشهد وهو عين العبد مقيد بإمكانه فلا يتمكن له شهود الإطلاق ولا بد من الشهود فظهر له المشهود مقيدا بالصورة ومقيدا بالتحول في الصور ولأنه مقيد بالوجوب الذاتي فالكل في عين التقييد إن عقلت عنا وإنما تقيد بالتحول ليفتح له في نفسه العلم بأن الأمر لا يتناهى وما لا يتناهى لا يدخل تحت التقييد فإنه من قبل التحول إلى صورة من صورة قبل التحول إلى صور لا نهاية لها أو إلى صور لا يمكن لذلك المتحول أن يتجاوزها إلى غيرها فخرج عن حد التقييد بالتقييد ليعلم أن مشهوده مطلق الوجود فيكون شهوده أيضا مطلقا إطلاق مشهوده فأفاده التحول من صورة إلى صورة علما لم يكن عنده فعلم عند ذلك أن الله هو الحق المبين فأعلى رياضة العبد العالم أن لا ينكره في صورة ولا يقيده بتنزيه بل له التنزيه على الإطلاق عن تنزيه التقييد\n\n\n«بسم الله الرحمن الرحيم»\n\n",
    "en": "Chapter Two Hundred and Three: Concerning the State of Spiritual Discipline (الرياضة)\n\nIf the human refines the character of his soul\nAnd removes it from its nature and its inclination,\n\nThat, however, is impossible for us to accept, for the discipliner\nDoes not see the discipline achieved by forcing its nature.\n\nIf you possess Knowledge (العلم), then specific channels\nFor it were designated by the Divine Law (الشرع) when its nature is corrupted.\n\n### [Spiritual Discipline (الرياضة) is of Two Kinds]\n\nKnow that Spiritual Discipline (الرياضة), according to the People [the Sufis], is one of the spiritual states (الأحوال), and it is of two kinds: the discipline of proper conduct (رياضة الأدب) and the discipline of seeking (رياضة الطلب).\n\nThe discipline of proper conduct (رياضة الأدب), according to them, is the departure from the soul’s nature (طبع النفس).\n\nAnd the discipline of seeking (رياضة الطلب) is the soundness of the intended meaning of the seeking itself.\n\nAccording to us, Spiritual Discipline (الرياضة) is the refinement of character (تهذيب الأخلاق), for departure from the soul’s nature (طبع النفس) is not sound. Since it is not sound, Allah clarified specific channels (مصارف) for that nature. When souls restrict themselves to these channels, they are praised and thanked, and they do not thereby depart from their nature. Thus, their discipline is their restriction to the channels designated for them by their Creator.\n\nFor the essence (عين) of a thing defined by its temperament (المزاجي) is nothing other than its temperament. If a thing were to depart from its nature (طبعه), it would cease to be itself. This is why the statement of those who say that the discipline of seeking (رياضة الطلب) is the soundness of the intended meaning is valid. If a thing is intended for a specific purpose, and the one intending that purpose is the originator (موجد) of that thing, and He has designated it for that purpose and made it known that He desires that specific measure from it—then if the thing acts according to its nature within that limit, it is considered disciplined. For even if it were to act contrary to what was intended for it, its action would still be according to its nature. Therefore, refinement (التهذيب) consists only of diverting it from absolute freedom (الإطلاق) in action to restriction (التقييد).\n\nIf the proponent of the discipline of proper conduct (رياضة الأدب) means by \"departure from the soul’s nature\" that the soul’s previously absolute freedom of action (التصرف مطلقا) becomes restricted (مقيدا), and this person compels his soul to act only within the limits imposed by its Creator, entering under restriction (التحجير) after having been unrestrained (مسرحة)—then this is exactly what we have stated. If he means anything other than this, then it is only what we have said.\n\nThis is because Spiritual Discipline (الرياضة) is the subjugation (تذليل) of the soul and its attachment to servitude (العبودية). For this reason, the earth (الأرض) was named *ard* (earth) and *dhalūl* (submissive/tamed). Thus, discipline (الرياضة) according to us belongs to him who makes his soul like the earth (أرضًا)—that is, like the ground trodden upon by the righteous (البر) and the wicked (الفاجر), making no distinction between them. Rather, it bears the righteous out of love for the satisfaction of its Lord, and it bears the wicked as Allah bears him, by providing him sustenance despite his ingratitude (كفره) for the blessings, his denial of them, and his forgetfulness of the Lord of the blessing therein.\n\nThe true meaning of contentment (الرضي) returns to Spiritual Discipline (الرياضة), if you pay close attention. This is because the soul inherently seeks a great deal of good, for this is the fundamental principle. Indeed, Allah the Exalted only sought the possibilities (الممكنات), which are infinite (غير متناهية), and nothing is greater than the infinite. The infinite does not enter into Existence (الوجود) all at once, but enters gradually, little by little, without end.\n\nTherefore, when the soul relates its seeking to the vastness of what it desires, and then becomes content (رضي) with the small portion and the gradual process, knowing that the infinite cannot be realized in Existence (الوجود), it is content with the measure that enters. The object of contentment (الرضي) is thus only the small portion, for no creature can be greater in measure than its Creator.\n\nIf this is the Attribute (صفة) of The Real (الحق), then it is even more fitting for the servant (العبد). What is with Allah is infinite, and this servant’s request from Allah is what is with Him. Yet, its entry into Existence (الوجود) is only possible gradually, little by little, without end. So the servant is content with that measure, which is small compared to the object of his Knowledge (العلم) concerning what is with Allah. Thus, he is content with The Real (الحق), and The Real is content with him. The restriction by the knower of the infinite (العالم بما لا يتناهى) to what is given of the finite portion is a discipline (رياضة) on his part, restraining the absolute attachment of his Knowledge (العلم) to that infinite, since he also knows that the infinite does not enter into Existence (الوجود).\n\nThe Reality of Spiritual Discipline (حقيقة الرياضة) thus returns to this point. Because the human (الآدمي) was created upon the Form (الصورة), his soul became proud and imagined that restriction (التحجير) was not proper for one who possesses Might (العزة). Yet, it did not know that Might (العزة) is restriction, for Might is a protected preserve (حمى), and a protected preserve is restriction. Thus, the very thing by which the soul claimed absolute freedom (الإطلاق) is precisely what restricted it.\n\nWhen The Real (الحق) made the soul witness the Presence of His Might (حضرة عزه) and the penetration of His Power (نفوذ اقتداره)—and despite the penetration of His Power, He only granted possibility (الإمكان) from Himself to the extent that it could be realized in Existence (الوجود)—the soul was broken. What it used to boast of now bequeathed to it, through this witnessing, humility (ذلة) and brokenness. Since the soul accepts humility due to its ignorance, it became disciplined (فارتاضت). The Real, due to His Knowledge (العلم), remains upon His Might (عزه). Therefore, the discipline of Knowledge (رياضة العلم) is the most beneficial of disciplines.\n\nKnowledge (العلم) did not remove the soul from the Form (الصورة), but initially, the soul was ignorant of what the Form entailed and what the Realities (الحقائق) entailed. How noble is Knowledge! If there were no nobility in Knowledge except the Theophany (تجلي) of The Real (الحق) in a form that is denied, and then His transformation into a form that is recognized, while He remains Himself in both the first and the second.\n\nThe locus of that Witnessing (المشاهدة) cannot be established in reality (نفس الأمر) unless it is restricted (مقيدة), because the one who witnesses—who is the essence (عين) of the servant—is restricted by his possibility (إمكانه). Thus, he cannot witness the Absolute (الإطلاق). Yet, Witnessing (الشهود) is necessary, so the object witnessed (المشهود) appears to him restricted by the Form (الصورة) and restricted by transformation (التحول) in forms. And because He [The Real] is restricted by Essential Necessity (الوجوب الذاتي), everything is essentially restricted, if you understand our meaning.\n\nHe was restricted by transformation (التحول) only so that Knowledge (العلم) might be opened within the soul that the matter is infinite (لا يتناهى), and the infinite does not fall under restriction (التقييد). For, through transformation from one form to another, He accepts transformation into endless forms, or into forms that the transformer cannot exceed to others. Thus, He departed from the limit of restriction by means of restriction, so that the servant might know that the object witnessed (مشهوده) is Absolute Being (مطلق الوجود), and thus his Witnessing (شهوده) also becomes absolute, mirroring the absoluteness of the object witnessed.\n\nThe transformation from form to form thus granted him Knowledge (علماً) that he did not previously possess, and he knew then that Allah is The Manifest Truth (الحق المبين).\n\nTherefore, the highest discipline (رياضة) for the knowing servant (العبد العالم) is not to deny Him in any form, nor to restrict Him by transcendence (تنزيه). Rather, transcendence belongs to Him absolutely, free from the transcendence of restriction.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "## «باب نمبر دو سو تین: ریاضت (الرياضة) کے حال کے بیان میں»\n\nجب انسان اپنے نفس کے اخلاق کی تہذیب کرے\nاور اسے اس کے طبع (الطبع) اور مراد سے باہر نکال دے\nاور یہ ہمارے نزدیک محال ہے کہ ایسا ہو، پس ریاضت کرنے والا\nاسے اس کی سرکشی سے ریاضت کرتا ہوا نہیں دیکھتا\nپس اگر تم علم والے ہو تو (جان لو کہ) اس کے لیے مصارف (حدود)\nشرع (الشرع) کے ذریعے مقرر کیے گئے ہیں جب وہ فساد کی طرف مائل ہو\n\n### [ریاضت (الرياضة) کی دو اقسام]\n\nجان لو کہ اہل تصوف (القوم) کے نزدیک ریاضت (الرياضة) احوال میں سے ہے اور اس کی دو اقسام ہیں: ریاضتِ ادب اور ریاضتِ طلب۔\n\nپس ان کے نزدیک ریاضتِ ادب (رياضة الأدب) نفس کے طبع (الطبع) سے باہر نکلنا ہے۔\n\nاور ریاضتِ طلب (رياضة الطلب) سے مراد طلب (الطلب) کی صحت ہے۔\n\nاور ہمارے نزدیک ریاضت (الرياضة) اخلاق کی تہذیب (التهذيب) ہے۔ کیونکہ نفس کے طبع (الطبع) سے باہر نکلنا درست نہیں ہے۔ اور چونکہ یہ درست نہیں تھا، اللہ تعالیٰ نے اس طبع کے لیے مصارف (حدود) بیان فرما دیے۔ پس جب نفوس ان حدود پر ٹھہر جاتے ہیں تو وہ قابل تعریف اور شکر گزار ہوتے ہیں، اور اس کے باوجود وہ اپنے طبع سے باہر نہیں نکلتے۔ لہٰذا ان کی ریاضت (الرياضة) ان مصارف پر اکتفا کرنا ہے جو ان کے خالق (الخالق) نے ان کے لیے مقرر کیے ہیں۔ کیونکہ کسی مزاجی شے کی حقیقت اس کے مزاج کے علاوہ کچھ نہیں ہے۔ اگر کوئی شے اپنے طبع سے باہر نکل جائے تو وہ وہ شے نہیں رہتی۔ اسی لیے اس شخص کا قول درست ہے جس نے کہا کہ ریاضتِ طلب (رياضة الطلب) سے مراد اس کی مراد کی صحت ہے۔ کیونکہ جب کسی شے سے کوئی خاص امر مراد ہو، اور اس امر کا ارادہ کرنے والا ہی اس شے کا موجد ہو، اور اس نے اسے اس کے لیے مقرر کر دیا ہو اور اس سے متعارف کرا دیا ہو کہ وہ اس سے صرف اسی قدر چاہتا ہے، تو اگر وہ اس میں اپنے طبع کے مطابق اس حد تک تصرف کرے تو وہ صاحبِ ریاضت (ریاضت کرنے والا) ہوگا۔ کیونکہ اگر وہ اس کے برعکس تصرف کرتا جو اس سے مراد تھا، تو وہ تصرف بھی اس کے طبع کے مطابق ہی ہوتا۔ پس تہذیب (التهذيب) صرف یہ ہے کہ اسے تصرف میں مطلق ہونے سے مقید ہونے کی طرف موڑ دیا جائے۔ پس اگر ریاضتِ ادب (رياضة الأدب) کے قائل کا مطلب یہ ہے کہ نفس کے طبع سے باہر نکلنے کا مطلب یہ ہے کہ جس میں اسے مطلق تصرف حاصل تھا، وہ مقید ہو جائے، تو اس شخص نے اپنے نفس کو اس تصرف پر محمول کیا جس کے ذریعے اس کے خالق نے اسے مقید کیا تھا، اور آزاد ہونے کے بعد وہ پابندی (تحجیر) کے تحت آ گیا، تو یہ وہی ہے جو ہم نے بیان کیا۔ اور اگر اس کا ارادہ اس کے علاوہ کچھ اور ہے تو پھر وہی ہے جو ہم نے کہا۔ اور وہ یہ ہے کہ ریاضت (الرياضة) نفس کو رام کرنا اور اسے عبودیت (العبودية) سے جوڑنا ہے۔ اسی لیے زمین کو \"ارض\" (زمین) اور \"ذلول\" (رام کی ہوئی) کہا جاتا ہے۔\n\nپس ہمارے نزدیک ریاضت (الرياضة) یہ ہے کہ کوئی شخص اپنے نفس کو زمین بنا دے، یعنی زمین کی طرح جسے نیک اور بد دونوں روندتے ہیں، اور وہ ان کے درمیان کوئی امتیاز نہیں کرتی، بلکہ نیک شخص کو اپنے آقا کی رضا پر ہونے کی وجہ سے محبت کے ساتھ اٹھاتی ہے، اور فاجر کو اللہ کے اٹھانے کی طرح اٹھاتی ہے، اس طرح کہ اللہ اسے اس کے کفر کے باوجود رزق دیتا ہے، حالانکہ وہ اس کی نعمتوں کا انکار کرتا ہے، انہیں جھٹلاتا ہے اور نعمت کے رب کو بھول جاتا ہے۔ اور اگر تم غور کرو تو رضا (الرضي) کا حقیقی مفہوم ریاضت (الرياضة) کی طرف لوٹتا ہے۔ کیونکہ نفس اپنی ذات سے بہت زیادہ خیر کا طالب ہوتا ہے، کیونکہ اصل اسی پر ہے۔ اللہ تعالیٰ نے صرف ممکنات (الممكنات) کو طلب کیا ہے، اور وہ غیر متناہی (لا يتناهى) ہیں، اور غیر متناہی سے زیادہ کچھ نہیں ہے۔ اور جو غیر متناہی ہے وہ ایک دم سے (الوجود) ہستی میں داخل نہیں ہوتا، بلکہ تھوڑا تھوڑا داخل ہوتا ہے اور اس کی کوئی انتہا نہیں ہے۔ پس جب تم اس کثرت کو اس کی طرف منسوب کرتے ہو جس کی طرف اس کی طلب متوجہ ہوئی، پھر وہ اس میں سے تھوڑے اور تدریج پر راضی ہو جاتا ہے، کیونکہ وہ جانتا ہے کہ جو غیر متناہی ہے وہ (الوجود) ہستی میں حاصل نہیں ہو سکتا، تو وہ اس قدر پر راضی ہو جاتا ہے جو اس میں سے داخل ہوتا ہے۔ پس رضا (الرضي) کا تعلق صرف قلیل سے ہوتا ہے، اور کوئی مخلوق اپنے خالق سے زیادہ قدر والی نہیں ہو سکتی۔ اور جب یہ (ذات حق) الحق کی صفت ہے، تو یہ بندے کے لیے بدرجہ اولیٰ ہے۔ پس جو کچھ اللہ کے پاس ہے وہ غیر متناہی ہے، اور اس بندے کی اللہ سے طلب وہی ہے جو اس کے پاس ہے، اور وہ (الوجود) ہستی میں داخل نہیں ہو سکتا مگر تھوڑا تھوڑا، لا انتہا تک۔ پس بندہ اس قدر پر راضی ہو گیا، اور یہ اللہ کے پاس موجود چیزوں کے بارے میں اس کے علم کے مقابلے میں قلیل ہے۔ پس وہ (ذات حق) الحق سے راضی ہوا اور (ذات حق) الحق اس سے راضی ہوا۔ پس غیر متناہی (لا يتناهى) کو جاننے والے کا اس پر اکتفا کرنا جو اسے اس میں سے متناہی (يتناهى) طور پر دیا گیا، اس کی طرف سے اس علم کے مطلق تعلق سے ایک ریاضت (الرياضة) ہے، کیونکہ وہ یہ بھی جانتا ہے کہ جو غیر متناہی ہے وہ (الوجود) ہستی میں داخل نہیں ہوتا۔\n\nپس ریاضت (الرياضة) کی حقیقت اسی کی طرف لوٹتی ہے، کیونکہ جب آدم زاد کو (الصورة) صورت پر پیدا کیا گیا تو اس کے نفس میں غرور پیدا ہوا اور اس نے خیال کیا کہ جس کے لیے عزت (العزة) ہے اس پر پابندی (تحجیر) درست نہیں ہے۔ حالانکہ اسے یہ معلوم نہ تھا کہ عزت (العزة) خود ایک پابندی ہے۔ کیونکہ عزت ایک محفوظ علاقہ (حمى) ہے اور محفوظ علاقہ پابندی ہے۔ پس جس چیز کے ذریعے اس نے اطلاق کا دعویٰ کیا، وہی بعینہٖ اس کی قید بن گئی۔ پس جب (ذات حق) الحق نے اسے اپنی عزت (العزة) اور نفاذِ اقتدار کی حضوری کا مشاہدہ کرایا، اور نفاذِ اقتدار کے باوجود اس نے اپنے نفس سے (الوجود) ہستی میں صرف اسی قدر امکان دیا جو حاصل ہو سکتا ہے، تو نفس ٹوٹ گیا اور جس چیز پر وہ فخر کرتا تھا، اس مشاہدے نے اسے ذلت اور انکسار وراثت میں دیا۔ کیونکہ وہ اپنی جہالت کی وجہ سے ذلت قبول کرتا ہے، پس اس نے ریاضت کی۔ اور (ذات حق) الحق اپنے علم کی وجہ سے اپنی عزت پر قائم ہے۔ پس علم کی ریاضت (رياضة العلم) سب سے زیادہ نفع بخش ریاضت ہے۔ علم نے اسے (الصورة) صورت سے دور نہیں کیا، لیکن پہلے وہ اس سے ناواقف تھا کہ (الصورة) صورت کیا ہے اور (الحقائق) حقائق کیا ہیں۔ علم کتنا ہی شرف والا ہے، اگر علم کا شرف صرف یہی ہوتا کہ (ذات حق) الحق ایک ایسی صورت میں (التجلی) ظہور الٰہی فرمائے جسے وہ (نفس) ناپسند کرے، پھر وہ ایک ایسی صورت میں تبدیل ہو جائے جسے وہ پہچانے، حالانکہ وہ پہلی اور دوسری دونوں میں وہی ہے۔ اور اس مشاہدے کا مقام حقیقت میں ممکن نہیں ہو سکتا مگر یہ کہ وہ مقید ہو۔ کیونکہ جو مشاہدہ کرتا ہے، جو کہ بندے کی عین ذات ہے، وہ اپنے امکان (إمكانه) کے ساتھ مقید ہے، لہٰذا اس کے لیے اطلاق (الإطلاق) کا (الشهود) شہود ممکن نہیں ہے۔ اور (الشهود) شہود ضروری ہے، پس مشہود اس کے لیے (الصورة) صورت کے ساتھ مقید ہو کر اور صورتوں میں تحول (تبدیلی) کے ساتھ مقید ہو کر ظاہر ہوا۔ اور چونکہ وہ وجوبِ ذاتی (الوجوب الذاتي) کے ساتھ مقید ہے، اگر تم ہماری بات سمجھو تو سب کچھ عینِ تقیید (پابندی) میں ہے۔ اور وہ تحول (تبدیلی) کے ساتھ صرف اس لیے مقید ہوا تاکہ اس کے نفس میں یہ علم کھل جائے کہ امر غیر متناہی (لا يتناهى) ہے، اور جو غیر متناہی ہے وہ تقیید (پابندی) کے تحت نہیں آتا۔ کیونکہ وہ ایک صورت سے دوسری صورت میں تحول (تبدیلی) کو قبول کرتا ہے، اس سے پہلے کہ وہ ایسی صورتوں میں تحول کو قبول کرے جن کی کوئی انتہا نہیں، یا ایسی صورتوں میں جن سے اس متحول کے لیے تجاوز کرنا ممکن نہ ہو۔ پس وہ تقیید کے ذریعے تقیید کی حد سے باہر نکل گیا، تاکہ وہ جان لے کہ اس کا مشہود مطلق (الوجود) ہستی ہے، پس اس کا (الشهود) شہود بھی اپنے مشہود کے اطلاق کی طرح مطلق ہو جائے۔ پس ایک صورت سے دوسری صورت میں تحول نے اسے وہ علم عطا کیا جو اس کے پاس نہیں تھا۔ تب اسے معلوم ہوا کہ اللہ ہی (الحق المبين) حق مبین ہے۔ پس عالم بندے کی سب سے اعلیٰ ریاضت (الرياضة) یہ ہے کہ وہ اسے کسی صورت میں نہ جھٹلائے اور نہ ہی اسے کسی تنزیہ (التنزيه) کے ساتھ مقید کرے، بلکہ اس کے لیے تقیید کی تنزیہ سے مطلق تنزیہ ہے۔\n\n«بسم اللہ الرحمن الرحیم»",
    "fa": "## باب دویست و سوم در بیان حال ریاضت\n\nاگر انسان اخلاق نفس خود را تهذیب کند *** و آن را از طبع و مرادش خارج سازد\nو این نزد ما محال است، زیرا کسی که ریاضت می‌دهد *** ریاضت‌دیده را با عنادش نمی‌بیند\nپس اگر اهل علم هستی، بدان که مصارفی (مجاری‌ای) *** برای آن [نفس] به هنگام فسادش، توسط شرع تعیین شده است.\n\n### [ریاضت دو بخش است]\n\nبدان که ریاضت (الرياضة) نزد این طایفه از احوال است و دو بخش دارد: ریاضت ادب (رياضة الأدب) و ریاضت طلب (رياضة الطلب).\n\nریاضت ادب (رياضة الأدب)\nنزد ایشان، خروج از طبع نفس است.\n\nو ریاضت طلب (رياضة الطلب)\nصحت مراد از آن است، یعنی صحت طلب.\n\nو نزد ما، ریاضت (الرياضة) تهذیب اخلاق است، زیرا خروج از طبع نفس صحیح نیست. و چون صحیح نبود، خداوند برای آن طبع، مصارفی (مجاری‌ای) را بیان کرد. پس اگر نفوس در آن مصارف توقف کنند، ستوده و شکرگزار خواهند بود و با این کار از طبع خود خارج نشده‌اند. بنابراین، ریاضتِ نفس، محدود کردن آن به مصارفی است که خالقش برای آن تعیین کرده است. زیرا عین شیء مزاجی، چیزی جز مزاجش نیست؛ اگر شیء از طبع خود خارج شود، دیگر آن شیء نخواهد بود. به همین دلیل، سخن کسی که می‌گوید ریاضت طلب (رياضة الطلب) صحت مراد از آن است، صحیح می‌باشد. زیرا اگر چیزی مرادِ امری باشد و اراده‌کننده آن امر، همان ایجادکننده آن شیء باشد و آن را برایش تعیین کرده و به آن شناسانده باشد که این مقدار را از آن می‌خواهد، پس اگر [نفس] با طبع خود در آن حد تصرف کند، صاحب ریاضت خواهد بود. زیرا اگر در نقیض آنچه از او خواسته شده تصرف کند، باز هم تصرفش با طبعش خواهد بود. پس تهذیب در آن، چیزی جز برگرداندن آن از اطلاق در تصرف به سوی تقیید نیست. اگر صاحب این قول در ریاضت ادب (رياضة الأدب) اراده کند که خروج از طبع نفس به این معناست که آنچه در آن تصرف مطلق داشت، مقید شود، پس این شخص نفس خود را بر آنچه خالقش از تصرف در آن مقید کرده است، حمل نموده و پس از آنکه رها بود، تحت محدودیت (التحجير) درآمده است؛ این همان چیزی است که ما ذکر کردیم. و اگر غیر از این اراده کند، جز آنچه ما گفتیم نیست. و این بدان سبب است که ریاضت، رام کردن نفس و ملحق ساختن آن به عبودیت است. و به همین دلیل، زمین را «أرض» (زمین) و «ذلول» (رام) نامیده‌اند.\n\nپس ریاضت (الرياضة) نزد ما، آن است که شخص نفس خود را زمین گرداند؛ یعنی مانند زمینی که نیکوکار و بدکار بر آن گام می‌نهند و نزد آن تمایزی تأثیر نمی‌گذارد، بلکه نیکوکار را به دلیل محبتی که به رضایت‌های مولایش دارد، حمل می‌کند و بدکار را به دلیل حمل خداوند بر او، حمل می‌کند؛ به این صورت که خداوند با وجود کفرش به نعمت‌ها و انکارش و فراموشی صاحب نعمت، به او روزی می‌دهد. و اگر درک کنی، مسمای رضا (الرضي) در حقیقت به ریاضت بازمی‌گردد. زیرا نفس ذاتاً خیر کثیر را طلب می‌کند، چون اصل بر این است. همانا خداوند متعال جز ممکنات را نطلبیده است و ممکنات نامتناهی هستند و نه بیشتر از نامتناهی. و آنچه نامتناهی است، یکباره وارد هستی (الوجود) نمی‌شود، بلکه اندک اندک و بی‌نهایت وارد می‌شود. پس اگر آنچه را که طلبش به سوی کثرت متوجه شده است، به آن نسبت دهی، سپس به اندک و تدریجی بودن آن راضی شود، به دلیل علمش به اینکه نامتناهی نمی‌تواند یکباره در هستی (الوجود) حاصل شود، به همان مقداری که از آن وارد می‌شود، راضی می‌گردد. پس متعلق رضا (الرضي) جز با اندک نخواهد بود. و هیچ مخلوقی قدرش از خالقش بزرگتر نیست. و اگر این صفت حق (الحق) است، پس برای بنده سزاوارتر است. آنچه نزد خداوند است، نامتناهی است و مطلوب این بنده از خداوند، آنچه نزد اوست، می‌باشد و ورود آن به هستی (الوجود) ممکن نیست مگر اندک اندک و بی‌نهایت. پس بنده به آن مقدار راضی شد، در حالی که آن مقدار نسبت به متعلق علمش به آنچه نزد خداوند است، اندک است. پس بنده از حق (الحق) راضی شد و حق (الحق) از او راضی شد. در نتیجه، محدود کردنِ عالم به نامتناهی، به آنچه از آن به صورت متناهی به او داده شده است، ریاضتی از جانب اوست نسبت به تعلق مطلق علمش به آن، زیرا او همچنین دانسته است که نامتناهی وارد هستی (الوجود) نمی‌شود.\n\nپس حقیقت ریاضت (الرياضة) به این بازمی‌گردد، زیرا هنگامی که آدمی بر صورت [الهی] خلق شد، نفسش به خود بالید و گمان کرد که محدودیت (التحجير) بر کسی که دارای عزت است، صحیح نیست؛ در حالی که ندانست عزت خود محدودیت (التحجير) است، زیرا عزت حریم است و حریم محدودیت است. پس عین همان چیزی که با آن ادعای اطلاق می‌کرد، عیناً او را مقید ساخت. پس هنگامی که حق (الحق) حضور عزتش و نفوذ اقتدارش را به نفس نشان داد، و با وجود نفوذ اقتدارش، امکان را از نفس خود جز به اندازه آنچه در هستی (الوجود) حاصل می‌شود، نداد، نفس شکست و آنچه با آن جولان می‌داد، میراثی از ذلت و انکسار شد که [حق] به او نشان داد. زیرا نفس به دلیل جهلش ذلت را می‌پذیرد، پس ریاضت کشید. و حق (الحق) به دلیل علمش بر عزتش است. پس ریاضت علم، سودمندترین ریاضت‌هاست. علم او را از صورت [الهی] زایل نکرد، بلکه او ابتدا جاهل بود به اینکه صورت بر چه چیزی است و حقایق (الحقائق) بر چه چیزی هستند. چه شریف است علم، اگر از شرف علم جز این نبود که حق (الحق) در صورتی که انکار می‌شود، تجلی (التجلی) کند، سپس در صورتی که شناخته می‌شود، متحول گردد، در حالی که او در هر دو صورت همان است. و موطن آن مشاهده (المشاهدة) در نفس‌الامر ممکن نیست مگر اینکه مقید باشد، زیرا کسی که شهود (الشهود) می‌کند، که عین بنده است، مقید به امکان خود است. پس شهود اطلاق برای او ممکن نیست و چاره‌ای جز شهود نیست. پس مشهود برای او مقید به صورت و مقید به تحول در صور ظاهر شد. و چون او مقید به وجوب ذاتی است، اگر از ما درک کنی، همه چیز در عین تقیید است. و تنها به تحول مقید شد تا در نفس او علم به این گشوده شود که امر نامتناهی است و آنچه نامتناهی است، تحت تقیید درنمی‌آید. زیرا او از قبلِ تحول به صورتی از صورتی دیگر، تحول به صور بی‌نهایت یا به صورتی که برای آن متحول ممکن نیست از آن فراتر رود، را پذیرفت. پس با تقیید از حد تقیید خارج شد تا بداند که مشهود او مطلق هستی (الوجود) است، پس شهود (الشهود) او نیز مطلق باشد، به اطلاق مشهودش. پس تحول از صورتی به صورتی دیگر، علمی را به او بخشید که نزدش نبود. پس در آن هنگام دانست که خداوند همان حق مبین است. پس بالاترین ریاضت بنده عالم این است که او را در هیچ صورتی انکار نکند و او را به تنزیه مقید نسازد، بلکه تنزیه مطلق از تنزیه تقییدی برای اوست."
  },
  "page_count": 2
}