{
  "id": 294,
  "title": {
    "ar": "الباب الرابع والتسعون ومائتان في معرفة المنزل المحمدي المكي من الحضرة الموسوية",
    "en": "Chapter Two Hundred and Ninety-Four: Concerning the Gnosis of the Muhammadan Meccan Station from the Mosaic Presence.",
    "ur": "باب دو سو چورانوے (۲۹۴) حضرۃ موسویہ (الحضرة الموسوية) سے محمدی مکی منزل (المنزل المحمدي المكي) کی معرفت کے بیان میں۔",
    "fa": "باب دویست و نود و چهارم در معرفت منزل محمدی مکی از حضرت موسوی."
  },
  "content": {
    "ar": "## «الباب الرابع والتسعون ومائتان في معرفة المنزل المحمدي المكي من الحضرة الموسوية»\n\n\n> حرم الله قلب كل نبي *** وكذا قيل قلب كل ولي‏\n\n\n> ورثوه وورثوه بينهم *** في علوم وفي مقام علي‏\n\n\n> فإذا ما نسبت للشرع علما *** فاطلب العلم في حروف الروي‏\n\n\n> وبحار لها معارف نور *** في شريف محقق ودني‏\n\n\n> ونبي مطهر ورسول *** وفقير ممردك وغني‏\n\n\n> ونعيم مرتب في علو *** وعذاب مقسم في ركي‏\n\n\n### [هل للعدم مرتبة عند الله أم لا]\n\n\nاعلم أن هذا المنزل يتضمن علم مرتبة العالم عند الله بجملته وهل العدم له مرتبة عند الله يتعين تعظيمه من أجلها أم لا وهل من خلق من أهل الشقاء المغضوب عليه له مرتبة تعظيم عند الله أم لا وهل التعظيم الإلهي له أثر في المعظم بحيث أن يسعد به أم لا وما سبب تعظيم الله العالم وهل لمن عظم العالم من الخلق صفة يعرف بها أم لا وما الأسماء الإلهية التي تضاف إلى المخلوقين في مذهب من يقول ما أقسم الله قط إلا بنفسه لكن أضمره تارة وأظهره في موطن آخر ليعلم أنه مضمر فيما لم يذكر وجميع ما يتعلق بهذا الفن يتضمنه هذا المنزل إن ذكرناها على التفصيل طال الكلام‏\n\n\n### [هل يشارك الإنسان والحيوان في الخلق أم لا من العالم‏]\n\n\nومما يتضمن هذا المنزل علم خلق الإنسان من العالم وهل الحيوان مشارك له في هذا الخلق أم هو خصيص به ولم خص بهذا الضرب من الخلق وإن كان يشاركه الحيوان فيه فلم عين الإنسان بالذكر وحده ولما ذا ذكرت لفظة الإنسان في القرآن حيثما ذكرت ونيط بذكرها إما الذم وإما الضعف والنقص وإن ذكر بمدح أعقبه الذم منوطا به فالذم كقوله إِنَّ الْإِنْسانَ لَفِي خُسْرٍ إِنَّ الْإِنْسانَ لِرَبِّهِ لَكَنُودٌ والضعف والنقص مثل قوله خَلَقْنَا الْإِنْسانَ من سُلالَةٍ من طِينٍ وقوله لَقَدْ خَلَقْنَا الْإِنْسانَ في كَبَدٍ والذم العاقب للمدح كقوله لَقَدْ خَلَقْنَا الْإِنْسانَ في أَحْسَنِ تَقْوِيمٍ هذا مدح ثُمَّ رَدَدْناهُ أَسْفَلَ سافِلِينَ هذا ذم ويتضمن علم مال أصحاب الدعاوي التي تعطيها رعونة الأنفس ويتضمن تقرير النعم الحسية والمعنوية ويتضمن التخلق بالأسماء ويتضمن علم القوة التي أعطيها الإنسان وأن لها أثرا وفي ذلك رد على الأشاعرة وتقوية للمعتزلة في إضافة الأفعال إلى المكلفين ويتضمن علم ما يقع فيه التعاون ويتضمن علم مال عرف الدليل وتركه لهوى نفسه فهذا جميع رءوس ما يتضمنه هذا المنزل من المسائل وهي تتشعب إلى ما لا يحصى كثرة إلا عن مشقة كبيرة فأما مرتبة العالم عند الله بجملته‏\n\n\n### [إن الله تعالى خلق العالم دليلا على معرفته‏]\n\n\nفاعلم إن الله تعالى ما خلق العالم لحاجة كانت له إليه وإنما خلقه دليلا على معرفته ليكمل بذلك ما نقص من مرتبة الوجود ومرتبة المعرفة فلم يرجع إليه سبحانه من خلقه وصف كمال لم يكن عليه بل له الكمال على الإطلاق ولا أيضا كان العالم في خلقه مطلوبا لنفسه لأنه ما طرأ عليه من خلقه صفة كمال بل له النقص الكامل على الإطلاق سواء\nخلق أو لم يخلق بل كان المقصود ما ذكرناه مرتبة الوجود ومرتبة المعرفة أن تكمل بوجود العالم وما خلق الله فيه من العلم بالله لما أعطاه التقسيم العقلي فإن وصف العالم بالتعظيم فمن حيث نصب دليلا على معرفة الله وأن به كملت مرتبة الوجود ومرتبة المعرفة والدليل يشرف بشرف مدلوله ولما كان العلم والوجود أمرين يوصف بهما الحق تعالى كان لهما الشرف التام فشرف العالم لدلالته على ما هو شريف فإن قال القائل كان يقع هذا بجوهر فرد يخلقه في العالم إن كان المقصود الدلالة قلنا صدقت وذلك أردنا إلا أن لله تعالى نسبا ووجوها وحقائق لا نهاية لها وإن رجعت إلى عين واحدة فإن النسب لا تتصف بالوجود فيدخلها التناهي فلو كان كما أشرت إليه لكان الكمال للوجود والمعرفة بما يدل عليه ذلك المخلوق الواحد فلا يعرف من الحق إلا ما تعطيه تلك النسبة الخاصة وقد قلنا إن النسب لا تتناهى فخلق الممكنات لا تتناهى فالخلق على الدوام دنيا وآخرة فالمعرفة تحدث على الدوام دنيا وآخرة ولذا أمر بطلب الزيادة من العلم أ تراه أمره بطلب الزيادة من العلم بالأكوان لا والله ما أمر إلا بالزيادة من العلم بالله بالنظر فيما يحدثه من الكون فيعطيه ذلك الكون عن أية نسبة إلهية ظهر ولهذا نبه صلى الله عليه وسلم القلوب‏\n\n\nبقوله في دعائه اللهم إني أسألك بكل اسم سميت به نفسك أو علمته أحدا من خلقك أو استأثرت به في علم غيبك‏\n\n\nوالأسماء نسب إلهية والغيب لا نهاية له فلا بد من الخلق على الدوام والعالم من المخلوقين لا بد أن يكون علمه متناهيا في كل حال أو زمان وأن يكون قابلا في كل نفس لعلم ليس عنده محدث متعلق بالله أو بمخلوق يدل على الله ذلك العلم فافهم فإن قال القائل فالأجناس محصورة بما دل عليه العقل في تقسيمه وكل ما يخلق مما لا يتناهى داخل في هذا التقسيم العقلي إذ هو تقسيم دخل فيه وجود الحق قلنا التقسيم صحيح في العقل وما تعطيه قوته كما أنه لو قسم البصر المبصرات لقسمها بما تعطيه قوته وكذلك السمع وجميع كل قوة تعطي بحسبها ولكن ما يدل ذلك على حصر المخلوقات فإنها قسمت على قدر ما تعطي قوتها وما من قوة تعطي أمرا وتحصر القسمة فيه إلا ويخرج عن قسمتها ما لا تعطيه قوتها فقوة السمع تقسم المسموعات ومتعلقها الكلام والأصوات لا غير فقد خرج عنها المبصرات كلها والمطعومات والمشمومات والملموسات وغيرها وكذلك أيضا العقل لما أعطى بقوته ما أعطى لم يدل ذلك على أنه ما ثم أمور إلهية لا تعطي العلم بتفاصيلها وحقائقها قوة العقل وإن دخلت في تقسيمه من وجه فقد خرجت عنه من وجوه وجائز أن يخلق الله في عبده قوة أخرى تعطي ما لا تعطيه قوة العقل فيرد المحال واجبا والواجب محالا والجائز كذلك فمن جهل ما تقتضيه الحضرة الإلهية من السعة بعدم التكرار في الخلق والتجليات لم يقل مثل هذا القول ولا اعترض بمثل هذا الاعتراض فإن قال لا بد أن يكون ما خلق تحت حكم العقل وداخلا في تقسيمه إما تحت قسمة النفي أو الإثبات قلنا صدقت ما تمنع أن يكون ما يعلم مما كان لا يعلم إما في قسم النفي أو الإثبات ولكن ما يدخل تحت ذلك النفي أو الإثبات هل يعطي ما يعطي النفي من العلم أو يعطي ما يعطي الإثبات من العلم أو يعطي أمرا آخر فإن النفي قد أعطى من العلم بالله ما أعطى من حيث ما هو نفي لا من حيث ما هو تحت دلالته من المنفيات التي لا نهاية لها وإن الإثبات قد أعطى من العلم بالله ما أعطى من حيث ما هو إثبات لا من حيث ما تحت دلالته من المثبتين فإذا الإيجاد مستمر والعلم فينا يحدث بحدوث الإيجاد والمعلوم الذي تعلق به العلم من ذلك الدليل الخاص ليس هو المعلوم الآخر فهو معلوم لله لا للعالم فكملت مرتبة ذلك العلم بوجوده في هذا العالم الكوني وكملت مرتبة الوجود الخاص بهذا الموجود بظهور عينه والذي يعطيه كل موجود من العلم الذوقي لا يعطيه الآخر ولقد يجد الإنسان من نفسه تفرقة ذوقية في أكله تفاحة واحدة في كل عضة يعض منها إلى أن يفرغ من أكلها ذوقا لا يجده إلا في تلك العضة خاصة والتفاحة واحدة ويجد فرقانا حسيا في كل أكلة منها وإن لم يقدر يترجم عنها ومن تحقق ما ذكرناه يعلم أن الأمر خارج عن طور كل قوة موجودة كانت تلك القوة عقلا أو غيره فسبحان من تعلق علمه بما لا يتناهى من المعلومات لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ قال تعالى ولا يُحِيطُونَ بِشَيْ‏ءٍ من عِلْمِهِ إِلَّا بِما شاءَ وقد بين لك في هذه الآية أن العقل وغيره ما أعطاه الله من العلم إلا ما شاء ولا يُحِيطُونَ به عِلْماً ولذا قال وعَنَتِ الْوُجُوهُ عقيب قوله ولا يُحِيطُونَ به عِلْماً أي إذا عرفوا أنهم لا يحيطون به علما خضعوا وذلوا وطلبوا الزيادة من العلم فيما لا علم لهم به منه والوجوه هنا أعيان الذوات وحقائق الموجودات إذ وجه كل شي‏ء ذاته وكل‏\nما خلق الله من العالم فإنما خلقه الله على كماله في نفسه فذلك الكمال وجهه قال تعالى أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ فقد أكمله ثُمَّ هَدى‏ فأعطى الهدى أيضا الذي هو البيان هنا خلقه فأبان الأمر بعبيده على أكمل وجوهه عقلا وشرعا ما أبهم ولا رمز ولا لغز إِنْ هُوَ إِلَّا ذِكْرٌ وقُرْآنٌ مُبِينٌ ... لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ ولو لا البيان ما فصل بين المتشابه والمحكم ليعلم أن المتشابه لا يعلمه إلا الله والمحكم يتعلق به علمنا فلو لم ينزل المتشابه لنعلم أنه متشابه لكوننا نرى فيه وجها يشبه أن يكون وصفا للمخلوق ويشبه أن يكون وصفا للخالق فلا يعلم معنى ذلك المتشابه إلا الله فلو لم ينزل المتشابه لم يعلم أن ثم في علم الله ما يكون متشابها وهذا غاية البيان حيث أبان لنا أن ثم ما يعلم وثم ما لا يعلمه إلا الله وقد يمكن أن يعلمه الله من يشاء من خلقه بأي وجه شاء أن يعلمه ومما يتضمن هذا المنزل العلم بالأقسام الإلهية التي وردت في الشرائع المتقدمة والمتأخرة لما أقسم وإذا أقسم بمن أقسم هل بنفسه أو بمخلوقاته أو بهذا وقتا وبهذا وقتا آخر مثل قوله تَاللَّهِ لَقَدْ أَرْسَلْنا فأقسم بالله وكقوله فَوَ رَبِّكَ فَوَ رَبِّ السَّماءِ والْأَرْضِ وكقوله والذَّارِياتِ والْمُرْسَلاتِ والصَّافَّاتِ والنَّجْمِ والشَّمْسِ وغير ذلك من المخلوقين الذين أقامهم في الظاهر مقام أسمائه فإن كان أضمر فما أضمر من الأسماء وعلى كل حال فلها شرف عظيم بإضافتها إليه سواء أظهر الاسم أو لم يظهر والقسم العام فَلا أُقْسِمُ بِما تُبْصِرُونَ وما لا تُبْصِرُونَ فدخل في هذا القسم من الموجودات جميع الأشياء ودخل فيه العدم والمعدومات وهو قوله وما لا تُبْصِرُونَ وما تبصرونه في الحال والمستقبل والمستقبل معدوم فللأشياء نسبة إلى الشرف والتعظيم وكذلك العدم فأما شرف العدم المطلق فإنه يدل على الوجود المطلق فعظم من حيث الدلالة وهو مما يجري على ألسنة الناس وقد نظم ذلك فقيل‏\n\n\nوبضدها تتميز الأشياء\n\n\nفالعدم ميز الوجود والوجود ميز العدم وأما شرف العدم المقيد فإنه على صفة تقبل الوجود والوجود في نفسه شريف ولهذا هو من أوصاف الحق فقد شرف على العدم المطلق بوجه قبوله للوجود فله دلالتان على الحق دلالة في حال عدمه ودلالة في حال وجوده وشرف العدم المطلق على المقيد بوجه وهو أنه من تعظيمه لله وقوة دلالته إنه ما قبل الوجود وبقي على أصله في عينه غيرة على الجناب الإلهي أن يشركه في صفة الوجود فينطلق عليه من الاسم ما ينطلق على الله ولما كان نفس الأمر على هذا شرع الحق للموجودات التسبيح وهو التنزيه وهو أن يوصف بأنه لا يتعلق به صفات المحدثين والتنزيه وصف عدمي فشرف سبحانه لعدم المطلق بأن وصف به نفسه فقال سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ تشريفا للعدم لهذا القصد المحقق منه في تعظيم الله فإنه أعرف بما يستحقه الله من المعدوم المقيد فإنه له صفة الأزل في عدمه كما للحق صفة الأزل في وجوده وهو وصف الحق بنفي الأولية وهي وصف العدم بنفي الوجود عنه لذاته فلم يعرف الله مما سوى الله أعظم معرفة من العدم المطلق ولما كان للعدم هذا الشرف وكان الدعوى والمشاركة للموجودات لهذا قيل لنا وقَدْ خَلَقْتُكَ من قَبْلُ ولَمْ تَكُ شَيْئاً أي ولم تك موجودا فكن معي في حال وجودك من عدم الاعتراض في الحكم والتسليم لمجاري الأقدار كما كنت في حال عدمك فجعل شرف الإنسان رجوعه في وجوده إلى حال عدمه فلو لا شرف العدم بما ذكرناه ما نبه الحق الموجود المخلوق على الرجوع إلى تلك الحالة في الحكم لا في العين ولا يقدر على هذا الوصف من الرجوع إلى العدم بالحكم مع الوجود العيني إلا من عرف من أين جاء وما يراد منه وما خلق له فقد تبين لك من شرف العدم المطلق ما فيه كفاية وهذه مسألة أغفلها الناس ولم يعقلوها عن الله حين ذكرها ولما تبين أن الشرف للموجودات والمعدومات إنما كان من حيث الدلالة وجب تعظيمها فقال تعالى ومن يُعَظِّمْ شَعائِرَ الله فَإِنَّها من تَقْوَى الْقُلُوبِ والشعائر هي الإعلام فهي الدلالات فمن عظمها فهو تقي في جميع تقلباته فإن القلوب من التقليب وما قال سبحانه إن ذلك‏\n\n\nمن تقوى النفوس ولا من تقوى الأرواح ولكن قال من تَقْوَى الْقُلُوبِ لأن الإنسان يتقلب في الحالات مع الأنفاس وهو إيجاد المعدومات مع الأنفاس ومن يَتَّقِ الله في كل تقلب يتقلب فيه فهو غاية ما طلب الله من الإنسان ولا يناله إلا الأقوياء الكمل من الخلق لأن الشعور بهذا التقلب عزيز ولهذا قال شَعائِرَ الله أي هي تشعر بما تدل عليه وما تكون شعائر إلا في حق من يشعر بها ومن لا يشعر بها وهم أكثر الخلق فلا يعظمها فإذا لا يعظمها إلا من قصد الله في جميع توجهاته وتصرفاته كلها ولهذا ما ذكرها الله إلا في الحج الذي هو تكرار القصد ولما كان القصد لا يخلو عنه‏\nإنسان كان ذكر الشعائر في آية الحج وذكر المناسك وهي متعددة أي في كل قصد فكان سبب القسم بالأشياء طلب التعظيم من الخلق للأشياء حتى لا يهملوا شيئا من الأشياء الدلالة على الله سواء كان ذلك الدليل سعيدا أو شقيا وعدما أو وجودا أي ذلك كان وإن كان القصد الإلهي بالقسم نفسه لا الأشياء بل المقصود الأمران معا وهو الصحيح فاعلم أنه ليس المراد بهذا القصد الآخر إلا التعظيم لنا والتعريف فذكر الأشياء وأضمر الأسماء الإلهية لتدل الأشياء على ما يريده من الأسماء الإلهية فما تخرج عن الدلالة وشرفها فقال والسَّماءِ وما بَناها أي وباني السماء والْأَرْضِ وما طَحاها أي وباسط الأرض والنَّجْمِ إِذا هَوى‏ أي ومسقط النجم فاختلفت الأشياء فاختلفت النسب فاختلفت الأسماء وتعينت المختصة بهذا الكون المذكور فعلم من الله ما ينبغي أن يطلق عليه من الأسماء في المعنى فيما أضمر وفي اللفظ فيما أطلق إذ لو أراد إطلاق ما أضمره عليه لأظهره كما أظهره في قوله فَوَ رَبِّ السَّماءِ والْأَرْضِ فجاء بالاسم الرب بالنسبة الخاصة المتعلقة بالسماء خاصة واسم الأرض مضمر لأنه للرب نسبة خاصة في الأرض ليست في السماء ولذلك لم يتماثلا بل السماء مغايرة للأرض لاختلاف النسب فنسبة الرب لخلق السماء مغايرة للنسبة الربانية لخلق الأرض ولو لا وجود الواو في قوله والأرض الذي يعطي التشريك لقلنا باختلاف الاسم الرب لاختلاف النسبة ولكن الواو منعت والقرآن نزل باللسان العربي والواو في اللسان في هذا الباب إذا ذكر الأول ولم يذكر في المعطوف عليه حكم آخر دلت على التشريك فإذا قلت قام زيد وعمر وفلا يريد القائل إذا وقف على هذا من غير قاطع عرضي مثل انقطاع النفس بسعلة تطرأ عليه أو شغل يشغله عن تمام تلفظه في مراده فهو للتشريك ولا بد فيما ذكر فالقاطع منعه أن يقول وعمر وخارج أو يقول وعمر وأبوه قاعد فهذه الواو واو الابتداء والحال لا واو العطف فإذا قال قام زيد وخرج عمرو فهذه واو العطف أعني عطف جملة على جملة لا واو التشريك فلهذا جعلنا الواو في قوله والأرض للتشريك في الاسم الإلهي المذكور الذي هو المعطوف عليه وكان الإضمار في النسبة التي يقع فيها التغاير فافهم فإنه من دقيق المعرفة بالله‏\n\n\n### [ما نص بتسرمد العذاب الذي هو الألم‏]\n\n\nواعلم أنه لما رأى بعض العارفين تعظيم هذه الأمور مشروعا ألحق كل ما سوى الله بالسعادة التي هي في حق أصحاب الأغراض من المخلوقين وصولهم إلى أغراضهم التي تخلق لهم في الحال فلم يبق صاحب هذا النظر أحدا في العذاب الذي هو الألم فإنه مكروه لذاته وإن عمروا النار فإن لهم فيها نعيما ذوقيا لا يعرفه غيرهم فإنه لكل واحدة من الدارين ملؤها فأخبر الله أنه يملؤها ويخلد فيها مؤبدا ولكن ما ثم نص بتسرمد العذاب الذي هو الألم لا الحركات السببية في وجود الألم في العادة بالمزاج الخاص المحس للألم فقد نرى الضرب والقطع والحرق في الوجود ظاهرا ولكن لا يلزم عن تلك الأفعال ألم ولا بد وقد شاهدنا هذا من نفوسنا في هذا الطريق وهذا من شرف الطريق وفيه يقول أصحابنا ليس العجب من ورد في بستان فإنه المعتاد وإنما العجب من ورد في وسط النار لأنه غير معتاد يريد أنه ليس العجب ممن يجد اللذة في المعتاد وإنما العجب ممن يجد اللذة في غير السبب المعتاد وهو كان مطلوب أبي يزيد في قوله‏\n\n\nسوى ملذوذ وجدي بالعذاب‏\n\n\nولهذا سمي عذابا لأنه يعذب في حال ما عند قوم ما لمزاج يطلبه وإذا كان الحق يأمر بتعظيم كل ما سواه مما هو مضاف إليه وما ثم إلا ما هو مضاف إليه إما نصا أو عقلا فبعيد إن يتسرمد عليه العذاب الذي هو الألم وقد كان الله ولا شي‏ء معه ولم يرجع إليه وصف لم يكن عليه مما أوجده وخلقه فكذلك هو ويكون وإنما قلنا هذا من أجل من يقول بنفي اسم من الأسماء الإلهية لا أثر له قلنا وإن لم يكن له أثر فليس كماله بوجود الأثر عنه فإن العين واحدة فافهم ذلك وهذه مسألة من أشكل المسائل في هذا الطريق‏\n\n\n### [إن رحمة الله سبقت غضبه‏]\n\n\nوالله يقول إن رحمته سبقت غضبه يريد أن حكمه برحمة عباده سبق غضبه عليهم ولا يظهر السبق في نفس الشأو فإنه قد يكون الفرس واسع النفس بطي‏ء الحركة والآخر ضيق النفس سريع الحركة والشأو طويل فلا يزال الواسع النفس وإن أبطأ في الحضر يدخل على الضيق النفس حتى يزيد عليه ويتركه خلفه فلا يحكم بالسبق إلا في آخر الشأو فمن حاز قصب السبق فهو السابق ولهذا يطول في المسابقة بين الخيل في المسافة وهو مشروع في معرض التنبيه على هذا المقام وآخر المسافة هو الذي ينتهي إليه الحكم بالسبق والرحمة سبقت غضب الله على خلقه فهي تحوز العالم في الدارين بكرم الله وما ذلك على الله بعزيز وإن كانوا في النار فلهم فيها نعيم فإنهم‏\nليسوا منها بمخرجين ويصدق‏\n\n\nقوله تعالى سبقت رحمتي غضبي‏\n\n\nويصدق قوله لَأَمْلَأَنَّ جَهَنَّمَ من الْجِنَّةِ والنَّاسِ أَجْمَعِينَ ويصدق قوله ورَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ وقد أظهرت أمرا في هذه المسألة لم يكن باختياري ولكن حق القول الإلهي بإظهاره فكنت فيه كالمجبور في اختياره والله ينفع به من يشاء لا إله إلا هو وهذا القدر كاف من علم هذا المنزل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 294: Concerning the Knowledge of the Muhammadan Meccan Station (المنزل المحمدي المكي) within the Mosaic Presence (الحضرة الموسوية)\n\n> Allah has sanctified the heart of every prophet,\n> And likewise, it is said, the heart of every saint (ولي).\n> They inherited it and bequeathed it among themselves,\n> In sciences and in a lofty station.\n> So if you attribute knowledge to the Sacred Law (الشرع),\n> Then seek that knowledge in the letters of the rhyme (الروي).\n> And seas that possess gnoses (معارف) of light,\n> In the noble, the realized, and the base.\n> And a purified prophet and a messenger,\n> And a poor one, one who is stripped bare, and a rich one.\n> And bliss (نعيم) arranged in loftiness,\n> And punishment (عذاب) distributed in lowliness.\n\n### [Does Non-Existence have a Level with God or Not?]\n\nKnow that this station (منزل) contains the knowledge of the level (مرتبة) of the World (العالم) as a whole in the sight of Allah. It addresses whether Non-Existence (العدم) has a level with Allah for which its veneration (تعظيم) is determined, or not. It also addresses whether he who was created among the people of wretchedness (أهل الشقاء), upon whom is wrath, has a level of veneration with Allah, or not. And whether the Divine veneration (التعظيم الإلهي) has an effect on the venerated such that he becomes happy by it, or not. And what is the reason for Allah's veneration of the World. And whether he among Creation (الخلق) who venerates the World has a characteristic by which he is known, or not. And what are the Divine Names (الأسماء الإلهية) that are attributed to creatures (المخلوقين) according to the school of thought that says Allah never swore an oath except by Himself, but concealed it sometimes and revealed it in another place, so that it may be known that it is concealed in what was not mentioned. Everything related to this subject is contained within this station; if we were to mention them in detail, the discussion would be lengthy.\n\n### [Does the Human and the Animal Share in the Creation of the World or Not?]\n\nAmong what this station contains is the knowledge of the creation of the Human (الإنسان) from the World. And whether the animal (الحيوان) shares with him in this creation, or if he is unique to it. And why he was singled out for this type of creation. And if the animal shares in it, why was the Human specified for mention alone? And why the word 'Human' (الإنسان) was mentioned in the Quran wherever it occurred, and linked to its mention is either blame, or weakness and deficiency. And if it was mentioned with praise, blame followed, attached to it. The blame is like His saying: <<إِنَّ الْإِنْسانَ لَفِي خُسْرٍ>> (Indeed, the Human is in loss) and <<إِنَّ الْإِنْسانَ لِرَبِّهِ لَكَنُودٌ>> (Indeed, the Human is ungrateful to his Lord). And weakness and deficiency is like His saying: <<خَلَقْنَا الْإِنْسانَ من سُلالَةٍ من طِينٍ>> (We created the Human from an extract of clay) and His saying: <<لَقَدْ خَلَقْنَا الْإِنْسانَ في كَبَدٍ>> (We have certainly created the Human in struggle). And the blame following the praise is like His saying: <<لَقَدْ خَلَقْنَا الْإِنْسانَ في أَحْسَنِ تَقْوِيمٍ>> (We have certainly created the Human in the best of stature)—this is praise—<<ثُمَّ رَدَدْناهُ أَسْفَلَ سافِلِينَ>> (Then We returned him to the lowest of the low)—this is blame. It includes the knowledge of the outcome of the claimants whose claims are given by the recklessness of the souls (الأنفس). It includes the confirmation of sensory and spiritual blessings. It includes the assumption of the character of the Names (التخلق بالأسماء). It includes the knowledge of the power granted to the Human and that it has an effect, and in that is a refutation of the Ashʿarites and a strengthening of the Muʿtazilites regarding the attribution of acts (الأفعال) to those held responsible (المكلفين). It includes the knowledge of what cooperation occurs in. It includes the knowledge of the outcome of him who knew the proof but abandoned it due to the caprice of his soul. These are all the main points of the issues contained in this station, and they branch out into an unquantifiable multitude except with great difficulty.\n\nAs for the level of the World as a whole in the sight of Allah:\n\n### [Indeed, Allah Almighty Created the World as a Proof of His Gnosis]\n\nKnow that Allah Almighty did not create the World out of any need He had for it. Rather, He created it as a proof (دليل) of His Gnosis (معرفة), so that what was deficient in the Level of Existence (مرتبة الوجود) and the Level of Gnosis might be perfected thereby. Thus, no attribute of perfection that He did not already possess returned to Him, glory be to Him, from His creation. Rather, He possesses absolute perfection. Nor was the World sought for its own sake in its creation, because no attribute of perfection accrued to it from its creation; rather, it possesses absolute, complete deficiency, whether it was created or not created. Rather, the purpose was what we mentioned: that the Level of Existence and the Level of Gnosis be perfected by the existence of the World, and what Allah created within it of knowledge of Allah, due to what the rational division grants it.\n\nIf the World is described with veneration (تعظيم), it is because it was established as a proof of the Gnosis of Allah, and that through it the Level of Existence and the Level of Gnosis were perfected. And the proof is honored by the honor of what it proves. And since Knowledge (العلم) and Existence (الوجود) are two matters by which the Real (الحق) Almighty is described, they possess complete honor. Thus, the honor of the World is due to its indication of that which is honorable.\n\nIf someone says: \"This could have occurred through a single substance He created in the World, if the purpose was merely indication,\" we say: \"You spoke truly, and that is what we intended, except that Allah Almighty has relations (نسب), aspects, and Realities (حقائق) that have no end, even if they return to a single Essence (عين). For the relations are not described by Existence, so finitude does not enter them. If it were as you indicated, then the perfection of Existence and Gnosis would only be through what that single creature indicates. Thus, nothing of the Real would be known except what that specific relation grants. And we have said that the relations are endless, so the creation of possibilities (الممكنات) is endless. Thus, creation is continuous, in this world and the Hereafter. Thus, Gnosis occurs continuously, in this world and the Hereafter. And for this reason, He commanded the seeking of increase in knowledge. Do you think He commanded him to seek increase in knowledge of the created things? No, by Allah! He only commanded the increase in knowledge of Allah by observing what He brings into existence of creation, so that creation grants him knowledge of which Divine relation (نسبة إلهية) it appeared from.\"\n\nAnd for this, the Prophet, peace and blessings be upon him, alerted the hearts by his saying in his supplication: \"O Allah, I ask You by every Name You have named Yourself with, or taught to any one of Your creation, or kept exclusively in Your knowledge of the Unseen (غيبك).\" And the Names (الأسماء) are Divine relations, and the Unseen has no end. Therefore, creation must be continuous.\n\nAnd the knower among the creatures must have knowledge that is finite in every state or time, and he must be receptive in every breath to a new knowledge that he does not possess, related to Allah or to a creature that indicates Allah—so understand this.\n\nIf someone says: \"The genera are limited by what the intellect (العقل) indicated in its division, and everything created that is endless is included in this rational division, since it is a division that includes the Existence of the Real,\" we say: \"The division is correct within the intellect and according to what its power grants. Just as if sight were to divide the visible things, it would divide them according to what its power grants. And likewise hearing and every power grants according to its capacity. But that does not indicate the limitation of creatures. For they were divided according to the capacity of their power. And there is no power that grants a matter and limits the division to it, except that what its power does not grant falls outside of its division. The power of hearing divides the audible things, and its object is speech and sounds, nothing else. Thus, all visible things, tasted things, smelled things, touched things, and others are excluded from it. And likewise, when the intellect granted what it granted by its power, that did not indicate that there are no Divine matters whose details and realities the power of the intellect cannot grant knowledge of. Even if they entered into its division from one aspect, they have departed from it from other aspects. And it is permissible that Allah creates in His servant another power that grants what the power of the intellect does not grant, so that it renders the impossible necessary, and the necessary impossible, and the permissible likewise. Whoever is ignorant of the breadth (السعة) required by the Divine Presence (الحضرة الإلهية) through the non-repetition in creation and theophanies (التجليات), would not make such a statement or raise such an objection.\"\n\nIf he says: \"What is created must be under the rule of the intellect and included in its division, either under the category of negation (النفي) or affirmation (الإثبات),\" we say: \"You spoke truly. We do not deny that what is known, which was previously unknown, falls either into the category of negation or affirmation. But does what falls under that negation or affirmation grant the knowledge that negation grants, or the knowledge that affirmation grants, or does it grant something else? For negation has granted knowledge of Allah from the perspective of its being negation, not from the perspective of the endless negated things under its indication. And affirmation has granted knowledge of Allah from the perspective of its being affirmation, not from the perspective of the affirmed things under its indication. Therefore, origination (الإيجاد) is continuous, and knowledge arises in us with the occurrence of origination. And the known thing to which knowledge relates from that specific proof is not the other known thing. Thus, it is known to Allah, not to the knower. So the level of that knowledge was perfected by its existence in this cosmic World (العالم الكوني). And the level of Existence specific to this existent thing was perfected by the manifestation of its essence (عين). And the experiential knowledge (العلم الذوقي) that every existent thing grants is not granted by another. Indeed, the Human may find in himself an experiential difference when eating a single apple, in every bite he takes until he finishes eating it—an experience he finds only in that specific bite, yet the apple is one. And he finds a sensory distinction in every morsel of it, even if he cannot articulate it. Whoever realizes what we have mentioned knows that the matter is beyond the scope of every existing power, whether that power is the intellect or something else. Glory be to Him Whose Knowledge relates to endless known things. <<لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ>> (There is no god but He, the All-Mighty, the All-Wise). He Almighty said: <<وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ>> (And they encompass nothing of His Knowledge except what He wills). And He has made clear to you in this verse that the intellect and others were only granted knowledge by Allah of what He willed. And they do not encompass Him in knowledge. And for this reason, He said <<وَعَنَتِ الْوُجُوهُ>> (And faces shall be humbled) immediately following His saying <<وَلَا يُحِيطُونَ بِهِ عِلْمًا>> (And they do not encompass Him in knowledge). Meaning, when they knew that they do not encompass Him in knowledge, they submitted and humbled themselves and sought increase in knowledge regarding what they did not know of Him. And the faces (الوجوه) here are the essences of the selves and the realities of existent things, since the face of everything is its Essence (ذات). And everything Allah created in the World, He created it upon its perfection in itself. That perfection is its aspect. He Almighty said: <<أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ>> (He gave everything its creation). He perfected it, then He guided. So He also gave the guidance (الهدى), which here means the clarification, to His creation. Thus, He clarified the matter to His servants in the most perfect ways, rationally and legally (شرعاً). He did not obscure, nor symbolize, nor riddle: <<إِنْ هُوَ إِلَّا ذِكْرٌ وَقُرْآنٌ مُبِينٌ>> (It is nothing but a reminder and a clear Quran)... <<لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ>> (That you may make clear to the people what was sent down to them). Were it not for clarification, there would be no distinction between the ambiguous (المتشابه) and the decisive (المحكم). So that it may be known that the ambiguous is known only to Allah, while the decisive relates to our knowledge. If the ambiguous had not been revealed, we would not know that it is ambiguous, because we see in it an aspect that resembles an attribute of the creature and resembles an attribute of the Creator. Thus, the meaning of that ambiguous matter is known only to Allah. If the ambiguous had not been revealed, it would not be known that there is something in Allah's Knowledge that is ambiguous. And this is the ultimate clarification, where He made clear to us that there is what is known, and there is what is known only to Allah. And it is possible that Allah teaches it to whomever He wills of His creation, in whatever way He wills to teach him.\n\nAmong what this station contains is the knowledge of the Divine oaths (الأقسام الإلهية) that occurred in the preceding and subsequent Sacred Laws (الشرائع), concerning why He swore. And when He swore, by whom did He swear? By Himself, or by His creatures, or by this sometimes and by that at other times? Like His saying: <<تَاللَّهِ لَقَدْ أَرْسَلْنَا>> (By Allah, We certainly sent)—so He swore by Allah—and like His saying: <<فَوَرَبِّكَ>> (So by your Lord) and <<فَوَرَبِّ السَّمَاءِ وَالْأَرْضِ>> (So by the Lord of the Heaven and the Earth). And like His saying: <<وَالذَّارِيَاتِ>> (By the scattering winds), <<وَالْمُرْسَلَاتِ>> (By the sending winds), <<وَالصَّافَّاتِ>> (By those lined up in ranks), <<وَالنَّجْمِ>> (By the star), and <<وَالشَّمْسِ>> (By the sun), and other creatures whom He established outwardly in the place of His Names. If He concealed, then what Names did He conceal? In any case, they possess great honor due to their attribution to Him, whether the Name was revealed or not.\n\nAnd the general oath is: <<فَلَا أُقْسِمُ بِمَا تُبْصِرُونَ وَمَا لَا تُبْصِرُونَ>> (But nay! I swear by what you see, and what you do not see). All things among existent things (الموجودات) entered into this oath. And Non-Existence (العدم) and non-existent things (المعدومات) entered into it, which is His saying: \"and what you do not see.\" And what you see now and in the future, and the future is non-existent. Thus, things have a relation to honor and veneration, and likewise Non-Existence.\n\nAs for the honor of Absolute Non-Existence (العدم المطلق), it indicates Absolute Existence (الوجود المطلق). So it is venerated from the perspective of indication, and this is something that runs on the tongues of people, and this was versified, and it was said:\n\n> And by their opposites are things distinguished\n\nSo Non-Existence distinguished Existence, and Existence distinguished Non-Existence.\n\nAs for the honor of Restricted Non-Existence (العدم المقيد), it is upon an attribute that accepts Existence. And Existence in itself is honorable, and for this reason, it is one of the attributes of the Real (الحق). Thus, it is honored above Absolute Non-Existence by the aspect of its acceptance of Existence. So it has two indications of the Real: an indication in its state of non-existence and an indication in its state of existence.\n\nAnd Absolute Non-Existence is honored above the restricted by one aspect, which is that, out of its veneration of Allah and the strength of its indication, it did not accept Existence and remained upon its origin in its essence, out of jealousy (غيرة) for the Divine Presence (الجناب الإلهي) that it should share with Him in the attribute of Existence, lest the Name that applies to Allah should apply to it.\n\nAnd since the matter itself is thus, the Real prescribed glorification (التسبيح) for existent things. And that is transcendence (التنزيه), which is that He be described as not being related to the attributes of originated things. And transcendence is a non-existent attribute. So He, glory be to Him, honored Absolute Non-Existence by describing Himself with it, saying: <<سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ>> (Glory be to your Lord, the Lord of Might, above what they describe). Honoring Non-Existence for this realized intention it holds in venerating Allah. For it is more knowing of what Allah deserves than the restricted non-existent thing. For it possesses the attribute of pre-eternity (الأزل) in its non-existence, just as the Real possesses the attribute of pre-eternity in His Existence. And that is describing the Real by negating anteriority, and it is describing Non-Existence by negating Existence from it intrinsically. Thus, nothing other than Allah knows Allah with greater Gnosis than Absolute Non-Existence.\n\nAnd since Non-Existence had this honor, and the claim and participation belonged to existent things, for this reason it was said to us: <<وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئًا>> (And I had created you before, when you were nothing). Meaning: \"And you were not existent. So be with Me in your state of existence by not objecting to the decree and by submitting to the flow of destinies (الأقدار), just as you were in your state of non-existence.\" So He made the honor of the Human his return in his existence to his state of non-existence. Were it not for the honor of Non-Existence as we mentioned, the Real would not have alerted the created existent thing to return to that state in decree, not in essence. And no one is capable of this attribute of returning to Non-Existence by decree while maintaining essential Existence (الوجود العيني), except he who knows whence he came, what is desired of him, and what he was created for. Thus, what is sufficient has become clear to you regarding the honor of Absolute Non-Existence. And this is an issue that people neglected and did not grasp from Allah when He mentioned it.\n\nAnd since it became clear that the honor for existent things and non-existent things was only from the perspective of indication (الدلالة), their veneration became obligatory. He Almighty said: <<وَمَنْ يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِنْ تَقْوَى الْقُلُوبِ>> (And whoever venerates the symbols [شعائر] of Allah—indeed, that is from the piety of the hearts). And the symbols are the signs, meaning the indications. So whoever venerates them is pious in all his transformations (تقلباته). For the hearts (القلوب) are from turning/changing. And He, glory be to Him, did not say that is from the piety of the souls or the piety of the spirits, but rather He said: <<مِنْ تَقْوَى الْقُلُوبِ>> (from the piety of the hearts). Because the Human transforms through states with every breath, and that is the origination of non-existent things with every breath. And whoever fears Allah in every transformation he undergoes, that is the ultimate thing Allah sought from the Human. And only the strong, perfect ones (الكمل) among Creation attain it, because the awareness of this transformation is rare. And for this reason, He said \"symbols of Allah,\" meaning they make one aware of what they indicate. And they are only symbols in the case of one who is aware of them. And those who are not aware of them—and they are the majority of Creation—do not venerate them. Therefore, only he who intends Allah in all his orientations and actions venerates them. And for this reason, Allah only mentioned them in the Hajj, which is the repetition of intention (القصد). And since no human is devoid of intention, the mention of the symbols was in the verse of Hajj, and the mention of the rites (المناسك), which are multiple, meaning in every intention.\n\nThus, the reason for swearing by things was the demand for veneration of things from Creation, so that they would not neglect the indication of Allah in anything, whether that proof was happy or wretched, non-existence or existence, whichever it was. Even if the Divine intention by the oath was Himself, not the things—rather, the two matters together are intended, and that is the correct view. Know that the intent of this secondary purpose is nothing but veneration for us and definition. So He mentioned the things and concealed the Divine Names so that the things might indicate what He intends of the Divine Names. Thus, they do not depart from indication and its honor. He said: <<وَالسَّمَاءِ وَمَا بَنَاهَا>> (By the Heaven and He Who built it)—meaning: and by the Builder of the Heaven. <<وَالْأَرْضِ وَمَا طَحَاهَا>> (And the Earth and He Who spread it)—meaning: and by the Spreader of the Earth. <<وَالنَّجْمِ إِذَا هَوَى>> (By the star when it descends)—meaning: and by the Causer of the star's descent. So the things differed, and the relations differed, and the Names differed. And the Names specific to this mentioned creation were determined. Thus, it was known from Allah what Names ought to be applied to Him in meaning regarding what He concealed, and in wording regarding what He revealed. For if He had intended to apply what He concealed to it, He would have revealed it, just as He revealed it in His saying: <<فَوَرَبِّ السَّمَاءِ وَالْأَرْضِ>> (So by the Lord of the Heaven and the Earth). So He brought the Name 'the Lord' (الرب) with the specific relation pertaining particularly to the Heaven. And the name of the Earth is concealed because the Lord has a specific relation in the Earth that is not in the Heaven. And for that reason, they are not alike; rather, the Heaven is different from the Earth due to the difference in relations. Thus, the relation of the Lord to the creation of the Heaven is different from the Lordly relation to the creation of the Earth. Were it not for the presence of the *wāw* (and) in His saying \"and the Earth,\" which implies sharing, we would have said that the Name 'the Lord' differs due to the difference in relation. But the *wāw* prevented that. The Quran was revealed in the Arabic language, and the *wāw* in the language, in this context, when the first item is mentioned and no other ruling is mentioned for the item conjoined to it, indicates sharing. So if you say, \"Zayd stood up and ʿAmr,\" the speaker, if he stops there without an accidental interruption—such as shortness of breath due to a cough, or a preoccupation that distracts him from completing his intended utterance—intends sharing, and it must be so in what was mentioned. The interruption prevented him from saying, \"and ʿAmr, and he went out,\" or saying, \"and ʿAmr, while his father is sitting.\" For this *wāw* is the *wāw* of beginning or state, not the *wāw* of conjunction. But if he says, \"Zayd stood up and ʿAmr went out,\" this is the *wāw* of conjunction—meaning the conjunction of a sentence upon a sentence—not the *wāw* of sharing. For this reason, we made the *wāw* in His saying \"and the Earth\" for sharing in the mentioned Divine Name, which is the conjoined item. And the concealment was in the relation where the difference occurs. So understand, for this is from the subtle points of Gnosis of Allah.\n\n### [There is No Text Stating the Eternity of Punishment, which is Pain]\n\nKnow that when some of the Gnostics (العارفين) saw the veneration of these matters as prescribed, they attached everything other than Allah to happiness (السعادة), which, for the people of purposes among creatures, is their attainment of the purposes created for them immediately. Thus, the holder of this view leaves no one in the punishment (العذاب) which is pain (الألم). For pain is disliked intrinsically. And even if they inhabit the Fire (النار), they have in it an experiential bliss (نعيم ذوقي) that no one else knows. For each of the two abodes has its filling. So Allah informed that He will fill it and make them abide therein eternally. But there is no text (نص) stating the eternity (تسرمد) of the punishment which is pain, not the causal movements in the customary existence of pain through the specific temperament that senses pain. We may see striking, cutting, and burning outwardly in Existence, but pain is not necessarily entailed by those acts. And we have witnessed this in our own souls on this Path (طريق). And this is from the honor of the Path. And concerning this, our companions say: \"It is not wondrous for one who enters a garden, for that is customary. But the wonder is for one who enters the midst of the Fire, because that is not customary.\" He means that it is not wondrous for one who finds pleasure in the customary, but the wonder is for one who finds pleasure in the non-customary cause. And this was the desire of Abu Yazid in his saying:\n\n> Except for the pleasure of my ecstasy (وجد) in the punishment\n\nAnd for this reason, it is called punishment, because it is painful in a state that, for some people, is sought by a temperament. And since the Real commands the veneration of everything other than Him that is attributed to Him—and there is nothing except what is attributed to Him, either by text or by reason—then it is unlikely that the punishment which is pain should be eternal upon him. And Allah was, and there was nothing with Him, and no attribute that He did not already possess returned to Him from what He originated and created. So He is thus, and He will be. We only said this for the sake of those who argue for the negation of a Divine Name that has no effect. We say: \"Even if it has no effect, His perfection is not dependent on the existence of an effect from it.\" For the Essence is one, so understand that. And this is one of the most complex issues on this Path.\n\n### [Indeed, Allah's Mercy Preceded His Wrath]\n\nAnd Allah says that His Mercy (رحمة) preceded His Wrath (غضب). He means that His decree of mercy upon His servants preceded His wrath upon them. And the precedence is not apparent in the course itself. For a horse may have a long breath but be slow in movement, while another has a short breath but is fast in movement, and the course is long. The one with the long breath, even if he is slow at the start, will continue to gain on the one with the short breath until he surpasses him and leaves him behind. Thus, precedence is only decreed at the end of the course. So whoever wins the prize of precedence is the predecessor. And for this reason, the distance in horse racing is long, and it is prescribed in the context of drawing attention to this station (مقام). And the end of the distance is where the decree of precedence terminates.\n\nAnd Mercy preceded Allah's Wrath upon His creation, so it encompasses the World in both abodes (الدارين) through Allah's generosity. And that is not difficult for Allah. And even if they are in the Fire, they have bliss therein, for they will not be brought out of it. And His saying Almighty is confirmed: \"My Mercy preceded My Wrath.\" And His saying is confirmed: <<لَأَمْلَأَنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَالنَّاسِ أَجْمَعِينَ>> (I will surely fill Hell with jinn and men all together). And His saying is confirmed: <<وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ>> (And My Mercy encompasses all things).\n\nAnd I have revealed a matter concerning this issue that was not by my choice, but the Divine Word necessitated its manifestation. So I was in it like one compelled in his choice. And Allah benefits whomever He wills by it. There is no god but He. And this much is sufficient from the knowledge of this station. And Allah speaks the Truth, and He guides to the Way.",
    "ur": "باب نمبر دو سو چورانوے: موسوی حضور (الحضرة الموسوية) سے محمدی مکی منزل (المنزل المحمدي المكي) کی معرفت میں\n\nاللہ نے ہر نبی کے قلب کو حرمت بخشی، اور اسی طرح ہر ولی کے قلب کو بھی۔\nانہوں نے اسے وراثت میں پایا اور اسے آپس میں وراثت میں دیا، علوم میں اور بلند مقام میں۔\nپس جب تم کسی علم کو شریعت سے منسوب کرو، تو علم کو حروفِ روی (قافیہ کے حروف) میں تلاش کرو۔\nاور ایسے سمندر جن میں نور کی معرفتیں ہیں، شریف محقق اور کمینے میں۔\nاور پاک نبی اور رسول، اور فقیر، متمرد اور غنی میں۔\nاور وہ نعمت جو بلندی میں ترتیب دی گئی ہے، اور وہ عذاب جو گہرائی میں تقسیم کیا گیا ہے۔\n\n[کیا عدم (العدم) کے لیے اللہ کے ہاں کوئی مرتبہ ہے یا نہیں؟]\n\nجان لو کہ یہ منزل (المنزل) اپنے مجموعی طور پر اللہ کے ہاں عالم (العالم) کے مرتبے کے علم کو شامل ہے، اور کیا عدم (العدم) کے لیے اللہ کے ہاں کوئی ایسا مرتبہ ہے جس کی وجہ سے اس کی تعظیم (التعظيم) متعین ہو، یا نہیں؟ اور کیا شقاوت والے مغضوب علیہم میں سے جو مخلوق ہیں، ان کے لیے اللہ کے ہاں تعظیم کا کوئی مرتبہ ہے یا نہیں؟ اور کیا تعظیم الٰہی (التعظيم الإلهي) کا معظَّم پر کوئی اثر ہوتا ہے کہ وہ اس کے ذریعے سعادت مند ہو جائے یا نہیں؟ اور اللہ کے عالم (العالم) کی تعظیم کا سبب کیا ہے؟ اور کیا مخلوق میں سے جس نے عالم کی تعظیم کی، اس کی کوئی صفت ہے جس سے وہ پہچانا جائے یا نہیں؟ اور وہ کون سے اسماء الٰہیہ (الأسماء الإلهية) ہیں جو ان مخلوقات کی طرف منسوب کیے جاتے ہیں جو یہ کہتے ہیں کہ اللہ نے کبھی اپنی ذات کے سوا کسی کی قسم نہیں کھائی، لیکن کبھی اسے پوشیدہ رکھا اور کبھی دوسرے مقام پر ظاہر کیا تاکہ یہ معلوم ہو جائے کہ وہ ان چیزوں میں بھی پوشیدہ ہے جن کا ذکر نہیں کیا گیا؟ اور اس فن سے متعلق تمام چیزیں اس منزل (المنزل) میں شامل ہیں، اگر ہم انہیں تفصیل سے بیان کریں تو بات لمبی ہو جائے گی۔\n\n[کیا انسان اور حیوان عالم (العالم) کی تخلیق میں شریک ہیں یا نہیں؟]\n\nاور جو کچھ یہ منزل (المنزل) شامل ہے، ان میں سے ایک علم انسان (الإنسان) کی عالم (العالم) سے تخلیق کا ہے، اور کیا حیوان اس تخلیق میں اس کا شریک ہے یا یہ صرف انسان کے لیے خاص ہے؟ اور اسے تخلیق کی اس قسم کے ساتھ کیوں خاص کیا گیا؟ اور اگر حیوان اس میں شریک ہے تو صرف انسان کو ہی ذکر کے لیے کیوں خاص کیا گیا؟ اور قرآن میں لفظ انسان جہاں بھی ذکر ہوا ہے، اس کے ساتھ یا تو مذمت یا ضعف اور نقص کو کیوں جوڑا گیا ہے؟ اور اگر تعریف کے ساتھ ذکر ہوا تو اس کے بعد مذمت کو اس سے منسلک کر دیا گیا ہے۔ پس مذمت کی مثال جیسے اس کا فرمان ہے: **إِنَّ الْإِنْسانَ لَفِي خُسْرٍ** (بیشک انسان خسارے میں ہے)، **إِنَّ الْإِنْسانَ لِرَبِّهِ لَكَنُودٌ** (بیشک انسان اپنے رب کا بڑا ناشکرا ہے)۔ اور ضعف اور نقص کی مثال جیسے اس کا فرمان ہے: **خَلَقْنَا الْإِنْسانَ من سُلالَةٍ من طِينٍ** (ہم نے انسان کو مٹی کے خلاصے سے پیدا کیا)، اور اس کا فرمان: **لَقَدْ خَلَقْنَا الْإِنْسانَ في كَبَدٍ** (بیشک ہم نے انسان کو مشقت میں پیدا کیا)۔ اور وہ مذمت جو تعریف کے بعد آتی ہے، جیسے اس کا فرمان ہے: **لَقَدْ خَلَقْنَا الْإِنْسانَ في أَحْسَنِ تَقْوِيمٍ** (بیشک ہم نے انسان کو بہترین ساخت پر پیدا کیا) – یہ تعریف ہے – **ثُمَّ رَدَدْناهُ أَسْفَلَ سافِلِينَ** (پھر ہم نے اسے سب سے نچلے درجے میں لوٹا دیا) – یہ مذمت ہے۔ اور یہ منزل (المنزل) ان دعووں کے حاملین کے انجام کے علم کو بھی شامل ہے جو نفس کی رعونت سے پیدا ہوتے ہیں، اور حسی و معنوی نعمتوں کے اقرار کو بھی شامل ہے، اور اسماء (الأسماء) کے ساتھ اخلاق اختیار کرنے کو بھی شامل ہے، اور اس قوت کے علم کو بھی شامل ہے جو انسان کو دی گئی ہے اور یہ کہ اس کا اثر ہے، اور اس میں اشاعرہ پر رد اور معتزلہ کی اس بات میں تقویت ہے کہ افعال کو مکلفین کی طرف منسوب کیا جاتا ہے۔ اور یہ منزل (المنزل) اس علم کو بھی شامل ہے کہ تعاون کہاں واقع ہوتا ہے، اور اس شخص کے انجام کے علم کو بھی شامل ہے جس نے دلیل کو پہچانا مگر اپنی نفسانی خواہش کی وجہ سے اسے ترک کر دیا۔ پس یہ تمام وہ بنیادی مسائل ہیں جو اس منزل (المنزل) میں شامل ہیں، اور یہ بے شمار شاخوں میں تقسیم ہوتے ہیں جن کا احاطہ بڑی مشقت کے بغیر ممکن نہیں۔ جہاں تک اللہ کے ہاں عالم (العالم) کے مجموعی مرتبے کا تعلق ہے...\n\n[بیشک اللہ تعالیٰ نے عالم (العالم) کو اپنی معرفت (المعرفۃ) کی دلیل کے طور پر پیدا کیا]\n\nپس جان لو کہ اللہ تعالیٰ نے عالم (العالم) کو اپنی کسی ضرورت کی بنا پر پیدا نہیں کیا، بلکہ اسے اپنی معرفت (المعرفۃ) کی دلیل کے طور پر پیدا کیا تاکہ اس کے ذریعے ہستی (الوجود) کے مرتبے اور معرفت (المعرفۃ) کے مرتبے میں جو کمی تھی وہ مکمل ہو جائے۔ پس اس کی تخلیق سے اس کی طرف کوئی صفتِ کمال واپس نہیں لوٹی جو اس پر پہلے سے نہ تھی، بلکہ اس کے لیے کمال مطلق (الكمال على الإطلاق) ہے۔ اور نہ ہی عالم (العالم) اپنی تخلیق میں اپنی ذات کے لیے مطلوب تھا، کیونکہ اس کی تخلیق سے اس پر کوئی صفتِ کمال طاری نہیں ہوئی، بلکہ اس کے لیے نقصِ کامل مطلق (النقص الكامل على الإطلاق) ہے، خواہ وہ پیدا کیا جائے یا نہ کیا جائے۔ بلکہ مقصود وہی تھا جو ہم نے ذکر کیا، کہ ہستی (الوجود) کا مرتبہ اور معرفت (المعرفۃ) کا مرتبہ عالم (العالم) کے وجود سے مکمل ہو جائے۔ اور اللہ نے اس میں جو علم باللہ پیدا کیا، وہ اس تقسیم عقلی کی وجہ سے ہے جو اس نے اسے عطا کی۔ پس اگر عالم (العالم) کو تعظیم (التعظيم) سے موصوف کیا جاتا ہے تو اس لحاظ سے کہ اسے اللہ کی معرفت (المعرفۃ) کی دلیل کے طور پر نصب کیا گیا، اور یہ کہ اس کے ذریعے ہستی (الوجود) کا مرتبہ اور معرفت (المعرفۃ) کا مرتبہ مکمل ہوا۔ اور دلیل اپنے مدلول کے شرف سے شرف پاتی ہے۔ اور چونکہ علم اور ہستی (الوجود) دو ایسے امر ہیں جن سے ذات حق (الحق) موصوف ہوتی ہے، اس لیے ان دونوں کے لیے شرفِ تام ہے۔ پس عالم (العالم) کا شرف اس لیے ہے کہ وہ اس چیز پر دلالت کرتا ہے جو شرف والی ہے۔ اگر کوئی کہنے والا کہے کہ اگر مقصود صرف دلالت تھی تو یہ کام عالم (العالم) میں ایک جوہرِ فرد کو پیدا کرنے سے بھی ہو سکتا تھا، تو ہم کہیں گے: تم نے سچ کہا، اور ہمارا ارادہ بھی یہی تھا، مگر اللہ تعالیٰ کے لیے ایسی نسبتیں (النسب) اور وجوہ (الوجوه) اور حقائق (الحقائق) ہیں جن کی کوئی انتہا نہیں، اگرچہ وہ ایک ہی عین (ذات) کی طرف لوٹتی ہیں۔ لیکن نسبتیں (النسب) ہستی (الوجود) سے متصف نہیں ہوتیں کہ ان میں انتہا داخل ہو جائے۔ پس اگر ایسا ہوتا جیسا کہ تم نے اشارہ کیا، تو ہستی (الوجود) اور معرفت (المعرفۃ) کا کمال صرف اسی ایک مخلوق کی دلالت سے حاصل ہوتا، اور ذات حق (الحق) کی معرفت صرف اسی خاص نسبت کے ذریعے ہوتی۔ جبکہ ہم کہہ چکے ہیں کہ نسبتیں (النسب) لامتناہی ہیں، لہٰذا ممکنات کی تخلیق بھی لامتناہی ہے۔ پس تخلیق دنیا اور آخرت میں ہمیشہ جاری ہے۔ لہٰذا معرفت (المعرفۃ) بھی دنیا اور آخرت میں ہمیشہ پیدا ہوتی رہتی ہے۔ اسی لیے علم میں اضافے کے طلب کا حکم دیا گیا۔ کیا تم سمجھتے ہو کہ اسے اکوان (مخلوقات) کے علم میں اضافے کا حکم دیا گیا؟ نہیں، اللہ کی قسم! اسے صرف اللہ کے علم میں اضافے کا حکم دیا گیا ہے، اس کون (مخلوق) میں غور و فکر کے ذریعے جسے وہ پیدا کرتا ہے، تاکہ وہ کون اسے بتائے کہ وہ کس الٰہی نسبت (نسبة إلهية) سے ظاہر ہوا ہے۔ اسی لیے نبی اکرم صلی اللہ علیہ وسلم نے قلوب کو متنبہ فرمایا:\n\nاپنے دعا میں ان کے اس قول کے ذریعے: \"اے اللہ! میں تجھ سے تیرے ہر اس نام کے واسطے سے سوال کرتا ہوں جو تو نے خود کو دیا، یا اپنی مخلوق میں سے کسی کو سکھایا، یا اپنے علمِ غیب (علم غيبك) میں اپنے پاس محفوظ رکھا۔\"\n\nاور اسماء (الأسماء) الٰہی نسبتیں (نسب إلهية) ہیں، اور غیب (الغيب) کی کوئی انتہا نہیں، لہٰذا تخلیق کا ہمیشہ جاری رہنا ضروری ہے۔ اور مخلوقات میں سے عالم (العالم) کا علم ہر حال اور ہر زمانے میں متناہی ہونا ضروری ہے، اور یہ بھی ضروری ہے کہ وہ ہر سانس میں ایسے علم کو قبول کرنے والا ہو جو اس کے پاس نہ ہو، جو اللہ سے یا اللہ پر دلالت کرنے والی مخلوق سے متعلق ہو۔ پس سمجھو! اگر کوئی کہنے والا کہے کہ اجناس (الأجناس) اس تقسیم پر منحصر ہیں جس پر عقل نے دلالت کی ہے، اور جو کچھ بھی لامتناہی طور پر پیدا ہوتا ہے وہ اسی عقلی تقسیم میں داخل ہے، کیونکہ یہ ایسی تقسیم ہے جس میں ذات حق (الحق) کا وجود بھی شامل ہے، تو ہم کہیں گے: تقسیم عقل میں اور اس کی قوت کے مطابق صحیح ہے، جیسا کہ اگر بصارت دیکھنے والی چیزوں کو تقسیم کرے تو وہ اپنی قوت کے مطابق تقسیم کرے گی، اور اسی طرح سماعت اور ہر وہ قوت جو اپنی حد کے مطابق عطا کرتی ہے۔ لیکن یہ مخلوقات کے محصور ہونے پر دلالت نہیں کرتا، کیونکہ وہ اپنی قوت کی عطا کے مطابق تقسیم کی گئی ہیں۔ اور کوئی ایسی قوت نہیں جو کسی امر کو عطا کرے اور تقسیم کو اس میں محصور کر دے، مگر یہ کہ اس کی تقسیم سے وہ چیزیں خارج ہو جاتی ہیں جو اس کی قوت عطا نہیں کرتی۔ پس قوتِ سماعت مسموعات کو تقسیم کرتی ہے، اور اس کا تعلق صرف کلام اور آوازوں سے ہے، لہٰذا اس سے تمام مبصرات، مطعومات، مشمومات، ملموسات اور دیگر چیزیں خارج ہو گئیں۔ اسی طرح عقل نے جب اپنی قوت کے ذریعے جو کچھ عطا کیا، تو یہ اس بات پر دلالت نہیں کرتا کہ وہاں کوئی ایسے امورِ الٰہیہ نہیں ہیں جن کی تفصیلات اور حقائق کا علم قوتِ عقل عطا نہیں کرتی، اگرچہ وہ کسی ایک پہلو سے اس کی تقسیم میں داخل ہو گئے ہوں۔ اور یہ جائز ہے کہ اللہ اپنے بندے میں کوئی اور قوت پیدا کر دے جو وہ عطا کرے جو قوتِ عقل عطا نہیں کرتی، پس وہ محال کو واجب، واجب کو محال اور جائز کو بھی اسی طرح لوٹا دے۔ پس جو شخص تخلیق اور تجلیات (التجلیات) میں تکرار نہ ہونے کی وجہ سے حضورِ الٰہیہ (الحضرة الإلهية) کی وسعت کے تقاضوں سے ناواقف رہا، وہ ایسی بات نہیں کہے گا اور نہ ہی ایسا اعتراض کرے گا۔ اگر وہ کہے کہ جو کچھ پیدا کیا گیا ہے، اسے عقل کے حکم کے تحت اور اس کی تقسیم میں داخل ہونا ضروری ہے، خواہ نفی (النفي) کی تقسیم کے تحت ہو یا اثبات (الإثبات) کی، تو ہم کہیں گے: تم نے سچ کہا، ہم اس بات سے منع نہیں کرتے کہ جو علم میں آتا ہے، خواہ وہ پہلے معلوم نہ تھا، وہ یا تو نفی کے حصے میں ہو گا یا اثبات کے۔ لیکن کیا جو کچھ اس نفی یا اثبات کے تحت داخل ہوتا ہے، وہ وہی علم عطا کرتا ہے جو نفی عطا کرتی ہے، یا وہی علم عطا کرتا ہے جو اثبات عطا کرتا ہے، یا کوئی اور امر عطا کرتا ہے؟ کیونکہ نفی نے اللہ کے بارے میں وہ علم عطا کیا جو اس نے عطا کیا، اس لحاظ سے کہ وہ نفی ہے، نہ کہ اس لحاظ سے کہ وہ ان لامتناہی منفیات کی دلالت کے تحت ہے۔ اور اثبات نے اللہ کے بارے میں وہ علم عطا کیا جو اس نے عطا کیا، اس لحاظ سے کہ وہ اثبات ہے، نہ کہ اس لحاظ سے کہ وہ ان مثبتات کی دلالت کے تحت ہے۔ پس ایجاد (الإيجاد) مسلسل جاری ہے، اور علم ہم میں ایجاد کے وقوع کے ساتھ پیدا ہوتا ہے۔ اور وہ معلوم جس سے اس خاص دلیل کے ذریعے علم کا تعلق ہوا، وہ دوسرا معلوم نہیں ہے۔ پس وہ اللہ کے لیے معلوم ہے، عالم (العالم) کے لیے نہیں۔ پس اس علم کا مرتبہ اس کونی عالم (العالم الكوني) میں اس کے وجود سے مکمل ہوا، اور اس موجود کے ساتھ خاص ہستی (الوجود) کا مرتبہ اس کے عین (ذات) کے ظہور سے مکمل ہوا۔ اور جو ذوقی علم (العلم الذوقي) ہر موجود عطا کرتا ہے، وہ دوسرا عطا نہیں کرتا۔ اور انسان ایک ہی سیب کھانے میں ہر لقمے میں ایک ذوقی فرق پاتا ہے، جب تک کہ وہ اسے کھا کر فارغ نہ ہو جائے، ایسا ذوق جو اسے صرف اسی خاص لقمے میں ملتا ہے، حالانکہ سیب ایک ہی ہے۔ اور وہ ہر لقمے میں ایک حسی فرق (فرقان حسي) پاتا ہے، اگرچہ وہ اس کی ترجمانی نہ کر سکے۔ اور جس نے اس بات کی تحقیق کر لی جو ہم نے ذکر کی، وہ جان لے گا کہ یہ معاملہ ہر موجود قوت کی حد سے باہر ہے، خواہ وہ قوت عقل ہو یا کوئی اور۔ پس پاک ہے وہ ذات جس کے علم کا تعلق لامتناہی معلومات سے ہے، **لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ** (اس کے سوا کوئی معبود نہیں، وہ غالب، حکمت والا ہے)۔ اللہ تعالیٰ نے فرمایا: **وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ** (اور وہ اس کے علم میں سے کسی چیز کا احاطہ نہیں کر سکتے مگر جتنا وہ چاہے)۔ اور اس آیت میں تمہارے لیے واضح کر دیا گیا ہے کہ عقل اور دیگر چیزوں کو اللہ نے صرف وہی علم عطا کیا جو اس نے چاہا، **وَلَا يُحِيطُونَ بِهِ عِلْمًا** (اور وہ اس کا علمی احاطہ نہیں کر سکتے)۔ اسی لیے اس نے فرمایا: **وَعَنَتِ الْوُجُوهُ** (اور چہرے جھک گئے) اس کے اس قول کے فوراً بعد کہ **وَلَا يُحِيطُونَ بِهِ عِلْمًا** (اور وہ اس کا علمی احاطہ نہیں کر سکتے)۔ یعنی جب انہوں نے جان لیا کہ وہ اس کا علمی احاطہ نہیں کر سکتے، تو وہ جھک گئے، ذلیل ہو گئے، اور اس علم میں اضافے کی طلب کی جس کا علم انہیں اس کے بارے میں نہیں تھا۔ اور یہاں وجوہ (الوجوه) سے مراد ذوات کی عینیں اور موجودات کے حقائق ہیں، کیونکہ ہر شے کا وجہ (چہرہ) اس کی ذات ہے۔\n\nاور اللہ نے عالم (العالم) میں جو کچھ بھی پیدا کیا، اسے اپنی ذات میں کمال پر پیدا کیا۔ پس وہ کمال ہی اس کا وجہ (چہرہ) ہے۔ اللہ تعالیٰ نے فرمایا: **أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ** (اس نے ہر چیز کو اس کی تخلیق عطا کی)۔ پس اس نے اسے مکمل کیا، **ثُمَّ هَدَى** (پھر ہدایت دی)۔ پس اس نے ہدایت بھی عطا کی جو یہاں بیان (البيان) ہے۔ اس نے اپنی تخلیق کو اپنے بندوں کے لیے عقلی اور شرعی طور پر بہترین طریقوں سے واضح کر دیا، نہ مبہم رکھا، نہ رمز استعمال کیا، نہ معمہ بنایا۔ **إِنْ هُوَ إِلَّا ذِكْرٌ وَقُرْآنٌ مُبِينٌ** (یہ تو صرف نصیحت اور واضح قرآن ہے) ... **لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ** (تاکہ تم لوگوں کے لیے وہ چیز واضح کر دو جو ان کی طرف نازل کی گئی ہے)۔ اور اگر بیان (البيان) نہ ہوتا تو متشابہ اور محکم کے درمیان فرق نہ کیا جاتا، تاکہ یہ معلوم ہو جائے کہ متشابہ کا علم صرف اللہ کو ہے اور محکم کا تعلق ہمارے علم سے ہے۔ پس اگر متشابہ نازل نہ ہوتا تاکہ ہم جان لیں کہ یہ متشابہ ہے، کیونکہ ہم اس میں ایک ایسا پہلو دیکھتے ہیں جو مخلوق کی صفت ہونے کے مشابہ ہے اور خالق کی صفت ہونے کے بھی مشابہ ہے، تو اس متشابہ کا معنی صرف اللہ ہی جانتا ہے۔ پس اگر متشابہ نازل نہ ہوتا تو یہ معلوم نہ ہوتا کہ اللہ کے علم میں کوئی ایسی چیز بھی ہے جو متشابہ ہے۔ اور یہ بیان (البيان) کی انتہا ہے، جہاں اس نے ہمارے لیے واضح کر دیا کہ کچھ چیزیں ایسی ہیں جن کا علم ہے اور کچھ ایسی ہیں جن کا علم صرف اللہ کو ہے۔ اور یہ ممکن ہے کہ اللہ جسے چاہے اپنی مخلوق میں سے جس طریقے سے چاہے اس کا علم عطا کر دے۔ اور جو کچھ یہ منزل (المنزل) شامل ہے، ان میں سے ایک علم ان الٰہی قسموں (الأقسام الإلهية) کا ہے جو پچھلی اور بعد کی شریعتوں میں وارد ہوئی ہیں کہ اس نے کس لیے قسم کھائی، اور جب قسم کھائی تو کس کی قسم کھائی؟ کیا اپنی ذات کی، یا اپنی مخلوقات کی، یا کبھی اس کی اور کبھی اس کی؟ جیسے اس کا فرمان: **تَاللَّهِ لَقَدْ أَرْسَلْنَا** (اللہ کی قسم، ہم نے بھیجا) – پس اس نے اللہ کی قسم کھائی۔ اور جیسے اس کا فرمان: **فَوَرَبِّكَ** (پس تیرے رب کی قسم)، **فَوَرَبِّ السَّمَاءِ وَالْأَرْضِ** (پس آسمان اور زمین کے رب کی قسم)۔ اور جیسے اس کا فرمان: **وَالذَّارِيَاتِ** (قسم ہے بکھیرنے والی ہواؤں کی)، **وَالْمُرْسَلَاتِ** (اور بھیجی جانے والی ہواؤں کی)، **وَالصَّافَّاتِ** (اور صف باندھنے والوں کی)، **وَالنَّجْمِ** (اور ستارے کی)، **وَالشَّمْسِ** (اور سورج کی)، اور دیگر مخلوقات جنہیں اس نے بظاہر اپنے اسماء (الأسماء) کے مقام پر کھڑا کیا۔ پس اگر اس نے کسی کو پوشیدہ رکھا تو وہ کون سے اسماء (الأسماء) تھے جنہیں پوشیدہ رکھا؟ اور بہر حال، ان کے لیے اس کی طرف نسبت کی وجہ سے عظیم شرف ہے، خواہ اسم ظاہر ہو یا نہ ہو۔ اور عام قسم یہ ہے: **فَلَا أُقْسِمُ بِمَا تُبْصِرُونَ * وَمَا لَا تُبْصِرُونَ** (پس میں قسم کھاتا ہوں ان چیزوں کی جنہیں تم دیکھتے ہو، اور ان کی جنہیں تم نہیں دیکھتے)۔ پس اس قسم میں موجودات میں سے تمام چیزیں داخل ہو گئیں، اور اس میں عدم (العدم) اور معدومات بھی داخل ہو گئے، اور یہی اس کا فرمان ہے: **وَمَا لَا تُبْصِرُونَ** (اور ان کی جنہیں تم نہیں دیکھتے)۔ اور جو کچھ تم حال اور مستقبل میں دیکھتے ہو، اور مستقبل معدوم ہے۔ پس اشیاء کے لیے شرف اور تعظیم (التعظيم) کی نسبت ہے، اور اسی طرح عدم (العدم) کے لیے بھی۔\n\nجہاں تک عدم مطلق (العدم المطلق) کے شرف کا تعلق ہے، تو وہ وجود مطلق (الوجود المطلق) پر دلالت کرتا ہے۔ پس اسے دلالت کے لحاظ سے تعظیم دی گئی، اور یہ وہ چیز ہے جو لوگوں کی زبانوں پر جاری ہے۔ اور اسے نظم کیا گیا ہے:\n\nاور اشیاء اپنے ضد سے ممتاز ہوتی ہیں\n\nپس عدم (العدم) نے وجود (الوجود) کو ممتاز کیا اور وجود نے عدم کو ممتاز کیا۔ اور جہاں تک عدم مقید (العدم المقيد) کے شرف کا تعلق ہے، تو وہ ایک ایسی صفت پر ہے جو وجود (الوجود) کو قبول کرتی ہے، اور وجود بذاتِ خود شرف والا ہے، اور اسی لیے یہ ذات حق (الحق) کی صفات میں سے ہے۔ پس وہ عدم مطلق (العدم المطلق) پر اس پہلو سے شرف پا گیا کہ وہ وجود کو قبول کرتا ہے۔ پس اس کے لیے ذات حق (الحق) پر دو دلالتیں ہیں: ایک اس کی عدم کی حالت میں دلالت، اور دوسری اس کی وجود کی حالت میں دلالت۔ اور عدم مطلق (العدم المطلق) مقید پر ایک پہلو سے شرف رکھتا ہے، اور وہ یہ ہے کہ یہ اللہ کی تعظیم (التعظيم) اور اس کی دلالت کی قوت میں سے ہے کہ اس نے وجود کو قبول نہیں کیا اور اپنی عین (ذات) میں اپنی اصل پر باقی رہا، یہ جنابِ الٰہیہ پر غیرت کی وجہ سے تھا کہ وہ صفتِ وجود میں اس کا شریک ہو جائے، اور اس پر وہ نام بولا جائے جو اللہ پر بولا جاتا ہے۔ اور چونکہ معاملہ کی حقیقت یہی تھی، اس لیے ذات حق (الحق) نے موجودات کے لیے تسبیح (التسبيح) کو مشروع کیا، اور وہ تنزیہ (التنزيه) ہے، یعنی یہ وصف بیان کرنا کہ اس کا تعلق محدثین کی صفات سے نہیں ہے۔ اور تنزیہ (التنزيه) ایک عدمی وصف ہے۔ پس اس نے عدم مطلق (العدم المطلق) کو شرف بخشا کہ اس نے خود کو اس سے موصوف کیا، چنانچہ فرمایا: **سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ** (پاک ہے تیرا رب، عزت کا رب، ان چیزوں سے جو وہ بیان کرتے ہیں)۔ یہ عدم (العدم) کو اس مقصدِ محقق کی وجہ سے شرف بخشنا ہے جو اللہ کی تعظیم (التعظيم) میں ہے، کیونکہ وہ عدم مقید (المعدوم المقيد) سے زیادہ جانتا ہے کہ اللہ کس چیز کا مستحق ہے۔ کیونکہ اس کے لیے اس کے عدم میں ازل کی صفت ہے، جیسا کہ ذات حق (الحق) کے لیے اس کے وجود میں ازل کی صفت ہے۔ اور یہ ذات حق (الحق) کو اولیت کی نفی سے موصوف کرنا ہے، اور یہ عدم (العدم) کو اس کی ذات سے وجود کی نفی سے موصوف کرنا ہے۔ پس اللہ کو اللہ کے سوا کسی نے عدم مطلق (العدم المطلق) سے زیادہ عظیم معرفت (المعرفۃ) کے ساتھ نہیں پہچانا۔ اور چونکہ عدم (العدم) کے لیے یہ شرف تھا، اور موجودات کے لیے دعویٰ اور شرکت تھی، اس لیے ہم سے کہا گیا: **وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئًا** (حالانکہ میں نے تجھے اس سے پہلے پیدا کیا تھا اور تو کچھ بھی نہ تھا)۔ یعنی تو موجود نہ تھا۔ پس تو اپنے وجود کی حالت میں میرے ساتھ حکم میں اعتراض نہ کرنے اور تقدیروں کے جاری ہونے کو تسلیم کرنے میں ایسا ہی رہ جیسا کہ تو اپنی عدم کی حالت میں تھا۔ پس انسان کا شرف یہ قرار دیا گیا کہ وہ اپنے وجود میں اپنی عدم کی حالت کی طرف لوٹ جائے۔ اور اگر عدم (العدم) کا شرف وہ نہ ہوتا جو ہم نے ذکر کیا، تو ذات حق (الحق) مخلوق موجود کو حکم میں اس حالت کی طرف لوٹنے پر متنبہ نہ کرتا، نہ کہ عین (ذات) میں۔ اور وجودِ عینی کے ساتھ حکم میں عدم کی طرف لوٹنے کی اس صفت پر وہی قادر ہو سکتا ہے جو یہ جانتا ہو کہ وہ کہاں سے آیا، اس سے کیا مطلوب ہے، اور اسے کس لیے پیدا کیا گیا ہے۔ پس عدم مطلق (العدم المطلق) کے شرف میں تمہارے لیے کافی وضاحت ہو چکی ہے۔ اور یہ ایک ایسا مسئلہ ہے جسے لوگوں نے نظر انداز کر دیا اور جب اللہ نے اسے ذکر کیا تو اسے اللہ سے نہیں سمجھا۔ اور جب یہ واضح ہو گیا کہ موجودات اور معدومات کا شرف صرف دلالت (الدلالة) کے لحاظ سے ہے، تو ان کی تعظیم (التعظيم) واجب ہو گئی، چنانچہ اللہ تعالیٰ نے فرمایا: **وَمَنْ يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِنْ تَقْوَى الْقُلُوبِ** (اور جو شخص اللہ کی نشانیوں (شعائر اللہ) کی تعظیم کرتا ہے تو یہ دلوں کے تقویٰ میں سے ہے)۔ اور شعائر (الشعائر) علامات ہیں، پس وہ دلالتیں (الدلالات) ہیں۔ پس جو ان کی تعظیم کرتا ہے، وہ اپنی تمام حالتوں میں متقی ہے، کیونکہ قلوب (القلوب) تقلب (پلٹنے) سے ہیں۔ اور اللہ سبحانہ نے یہ نہیں فرمایا کہ یہ نفوس (النفوس) کے تقویٰ میں سے ہے اور نہ ہی ارواح (الأرواح) کے تقویٰ میں سے، بلکہ فرمایا: **مِنْ تَقْوَى الْقُلُوبِ** (دلوں کے تقویٰ میں سے ہے)۔ کیونکہ انسان سانسوں کے ساتھ حالتوں میں پلٹتا رہتا ہے، اور یہ سانسوں کے ساتھ معدومات کا ایجاد ہے۔ اور جو شخص ہر اس پلٹ میں اللہ کا تقویٰ اختیار کرتا ہے جس میں وہ پلٹتا ہے، تو یہی وہ انتہا ہے جو اللہ نے انسان سے طلب کی ہے۔ اور اسے صرف مخلوق میں سے قوی اور کامل لوگ ہی پا سکتے ہیں، کیونکہ اس تقلب کا شعور (الشعور) نایاب ہے۔ اسی لیے فرمایا: **شَعَائِرَ اللَّهِ** (اللہ کی نشانیاں)، یعنی وہ ان چیزوں کا شعور دلاتی ہیں جن پر وہ دلالت کرتی ہیں۔ اور وہ شعائر (الشعائر) نہیں ہو سکتیں مگر اس شخص کے حق میں جو ان کا شعور رکھتا ہو، اور جو ان کا شعور نہیں رکھتے، اور وہ اکثر مخلوق ہیں، تو وہ ان کی تعظیم نہیں کرتے۔ لہٰذا ان کی تعظیم صرف وہی کرتا ہے جو اپنی تمام توجہات اور تصرفات میں اللہ کا قصد کرتا ہے۔ اور اسی لیے اللہ نے ان کا ذکر صرف حج میں کیا جو قصد کا تکرار ہے۔ اور چونکہ کوئی بھی انسان قصد سے خالی نہیں ہوتا، اس لیے شعائر (الشعائر) کا ذکر حج کی آیت میں کیا گیا، اور مناسک (المناسك) کا ذکر کیا گیا جو متعدد ہیں، یعنی ہر قصد میں۔ پس اشیاء کی قسم کھانے کا سبب مخلوق سے اشیاء کی تعظیم (التعظيم) کا مطالبہ تھا، تاکہ وہ اللہ پر دلالت کرنے والی کسی بھی چیز کو نظر انداز نہ کریں، خواہ وہ دلیل سعید ہو یا شقی، عدم ہو یا وجود، جو بھی ہو۔ اور اگرچہ قسم کھانے میں الٰہی قصد خود ذات حق (الحق) تھی نہ کہ اشیاء، بلکہ مقصود دونوں امر تھے، اور یہی صحیح ہے۔ پس جان لو کہ اس دوسرے قصد سے مراد ہمارے لیے تعظیم (التعظيم) اور تعریف کے سوا کچھ نہیں ہے۔ پس اس نے اشیاء کا ذکر کیا اور اسماء الٰہیہ (الأسماء الإلهية) کو پوشیدہ رکھا، تاکہ اشیاء ان اسماء الٰہیہ پر دلالت کریں جن کا وہ ارادہ کرتا ہے۔ پس وہ دلالت اور اپنے شرف سے خارج نہیں ہوتیں۔ چنانچہ فرمایا: **وَالسَّمَاءِ وَمَا بَنَاهَا** (اور آسمان کی اور اس ذات کی جس نے اسے بنایا)۔ یعنی اور آسمان کے بنانے والے کی قسم۔ **وَالْأَرْضِ وَمَا طَحَاهَا** (اور زمین کی اور اس ذات کی جس نے اسے بچھایا)۔ یعنی اور زمین کے بچھانے والے کی قسم۔ **وَالنَّجْمِ إِذَا هَوَى** (اور ستارے کی جب وہ گرے)۔ یعنی اور ستارے کو گرانے والے کی قسم۔ پس اشیاء مختلف ہوئیں، تو نسبتیں (النسب) مختلف ہوئیں، تو اسماء (الأسماء) مختلف ہوئے، اور اس مذکورہ کون (مخلوق) کے ساتھ خاص اسماء متعین ہو گئے۔ پس اللہ کی طرف سے یہ معلوم ہوا کہ معنی میں اس پر کون سے اسماء (الأسماء) جاری ہونے چاہئیں جو پوشیدہ رکھے گئے، اور لفظ میں وہ جو ظاہر کیے گئے۔ کیونکہ اگر وہ اس پر وہ نام جاری کرنا چاہتا جو اس نے پوشیدہ رکھے تھے، تو وہ انہیں ظاہر کر دیتا، جیسا کہ اس نے اپنے اس قول میں ظاہر کیا: **فَوَرَبِّ السَّمَاءِ وَالْأَرْضِ** (پس آسمان اور زمین کے رب کی قسم)۔ پس وہ رب (الرب) کا نام لایا، اس خاص نسبت کے ساتھ جو صرف آسمان سے متعلق ہے، اور زمین کا نام پوشیدہ ہے، کیونکہ رب کے لیے زمین میں ایک خاص نسبت ہے جو آسمان میں نہیں ہے۔ اسی لیے وہ دونوں مماثل نہیں ہیں، بلکہ نسبتوں کے اختلاف کی وجہ سے آسمان زمین سے مختلف ہے۔ اور رب کی نسبت آسمان کی تخلیق کے لیے اس ربانی نسبت سے مختلف ہے جو زمین کی تخلیق کے لیے ہے۔ اور اگر اس کے قول **وَالْأَرْضِ** میں واؤ (واو) موجود نہ ہوتی جو شرکت کو ظاہر کرتی ہے، تو ہم کہتے کہ نسبت کے اختلاف کی وجہ سے رب (الرب) کا نام بھی مختلف ہے۔ لیکن واؤ نے اس سے منع کیا۔ اور قرآن عربی زبان میں نازل ہوا ہے، اور اس باب میں زبان میں واؤ، جب پہلے کا ذکر ہو اور معطوف علیہ میں کوئی دوسرا حکم ذکر نہ ہو، تو وہ شرکت پر دلالت کرتی ہے۔ پس جب تم کہو: \"قام زيد وعمرو\" (زید کھڑا ہوا اور عمرو)، تو کہنے والا، جب وہ اس پر کسی عارضی رکاوٹ کے بغیر ٹھہر جائے، جیسے کھانسی کی وجہ سے سانس کا ٹوٹ جانا یا کوئی مشغولیت جو اسے اپنے ارادے کی تکمیل سے روک دے، تو یہ شرکت کے لیے ہے، اور مذکورہ میں یہ ضروری ہے۔ پس رکاوٹ نے اسے یہ کہنے سے روکا کہ \"وعمرو خارج\" (اور عمرو باہر نکلا) یا \"وعمرو وأبوه قاعد\" (اور عمرو اور اس کا باپ بیٹھا ہے)۔ پس یہ واؤ واؤِ ابتداء اور حال ہے، واؤِ عطف نہیں۔ پس جب وہ کہے: \"قام زيد وخرج عمرو\" (زید کھڑا ہوا اور عمرو نکلا)، تو یہ واؤِ عطف ہے، یعنی ایک جملے کا دوسرے جملے پر عطف، واؤِ شرکت نہیں۔ اسی لیے ہم نے اس کے قول **وَالْأَرْضِ** میں واؤ کو مذکورہ الٰہی اسم میں شرکت کے لیے قرار دیا جو معطوف علیہ ہے، اور تغایر (فرق) اس نسبت میں پوشیدہ تھا جس میں تغایر واقع ہوتا ہے۔ پس سمجھو، کیونکہ یہ اللہ کی معرفت (المعرفۃ) کے دقیق امور میں سے ہے۔\n\n[اس بات پر کوئی نص نہیں ہے کہ عذاب جو کہ درد (الألم) ہے، ہمیشہ رہے گا]\n\nاور جان لو کہ جب بعض عارفین (العارفين) نے ان امور کی تعظیم (التعظيم) کو مشروع دیکھا، تو انہوں نے اللہ کے سوا ہر چیز کو سعادت (السعادة) سے جوڑ دیا، جو مخلوق میں سے اغراض والوں کے حق میں ان اغراض تک پہنچنا ہے جو ان کے لیے فی الحال پیدا کی جاتی ہیں۔ پس اس نظر کے حامل نے کسی کو بھی عذاب (العذاب) میں باقی نہیں رکھا جو کہ درد (الألم) ہے، کیونکہ وہ اپنی ذات میں ناپسندیدہ ہے۔ اور اگرچہ وہ جہنم میں ہمیشہ رہیں گے، تو ان کے لیے اس میں ایک ذوقی نعمت ہو گی جسے ان کے سوا کوئی نہیں جانتا، کیونکہ دونوں گھروں (جنت و دوزخ) میں سے ہر ایک کو بھرنا ضروری ہے۔ پس اللہ نے خبر دی کہ وہ اسے بھرے گا اور اس میں ہمیشہ کے لیے رکھے گا، لیکن اس بات پر کوئی نص نہیں ہے کہ عذاب (العذاب) جو کہ درد (الألم) ہے، ہمیشہ رہے گا، نہ کہ وہ سببی حرکات جو خاص مزاج کے ساتھ درد کو محسوس کرنے میں عادتاً درد کے وجود کا سبب بنتی ہیں۔ پس ہم وجود میں مار پیٹ، کاٹنا اور جلانا ظاہر طور پر دیکھتے ہیں، لیکن یہ ضروری نہیں کہ ان افعال سے درد (الألم) لازم آئے۔ اور ہم نے اس راستے (الطريق) میں اپنی جانوں سے اس کا مشاہدہ کیا ہے۔ اور یہ اس راستے کا شرف ہے۔ اور اسی کے بارے میں ہمارے اصحاب کہتے ہیں: \"اس شخص پر تعجب نہیں جو باغ میں وارد ہوا، کیونکہ یہ معمول کی بات ہے۔ بلکہ تعجب اس شخص پر ہے جو آگ کے بیچ میں وارد ہوا، کیونکہ یہ غیر معمولی ہے۔\" وہ یہ کہنا چاہتے ہیں کہ اس شخص پر تعجب نہیں جو معمول کی چیز میں لذت پاتا ہے، بلکہ تعجب اس شخص پر ہے جو غیر معمولی سبب میں لذت پاتا ہے۔ اور یہی وہ چیز تھی جو ابو یزید (بسطامی) کو مطلوب تھی، جیسا کہ ان کے اس قول میں ہے:\n\nسوائے اس لذت کے جو مجھے عذاب میں ملتی ہے\n\nاور اسی لیے اسے عذاب (العذاب) کہا گیا، کیونکہ یہ اس حالت میں عذاب دیتا ہے جو بعض لوگوں کے پاس نہیں ہے، اس مزاج کی وجہ سے جو اسے طلب کرتا ہے۔ اور جب ذات حق (الحق) ہر اس چیز کی تعظیم (التعظيم) کا حکم دیتا ہے جو اس کے سوا ہے اور جو اس کی طرف منسوب ہے، اور اس کے سوا کوئی چیز نہیں جو اس کی طرف منسوب نہ ہو، خواہ نصاً ہو یا عقلاً، تو یہ بعید ہے کہ اس پر عذاب (العذاب) جو کہ درد (الألم) ہے، ہمیشہ رہے۔ اور اللہ تھا اور اس کے ساتھ کوئی چیز نہ تھی، اور اس کی طرف کوئی ایسی صفت واپس نہیں لوٹی جو اس پر پہلے سے نہ تھی، جو اس نے ایجاد اور خلق کی۔ پس وہ اسی طرح ہے اور رہے گا۔ اور ہم نے یہ بات ان لوگوں کی خاطر کہی جو یہ کہتے ہیں کہ اسماء الٰہیہ (الأسماء الإلهية) میں سے کوئی ایسا نام ہے جس کا کوئی اثر نہیں ہوتا۔ ہم نے کہا: اگرچہ اس کا کوئی اثر نہ ہو، تو اس کا کمال اس سے اثر کے وجود میں نہیں ہے، کیونکہ عین (ذات) ایک ہی ہے۔ پس اسے سمجھو۔ اور یہ اس راستے (الطريق) کے مشکل ترین مسائل میں سے ایک ہے۔\n\n[بیشک اللہ کی رحمت اس کے غضب پر سبقت لے گئی]\n\nاور اللہ فرماتا ہے کہ اس کی رحمت (الرحمة) اس کے غضب (الغضب) پر سبقت لے گئی ہے۔ اس کا مطلب یہ ہے کہ اپنے بندوں پر اس کے رحم کا حکم ان پر اس کے غضب سے پہلے تھا۔ اور سبقت خود دوڑ (الشأو) میں ظاہر نہیں ہوتی، کیونکہ ہو سکتا ہے کہ ایک گھوڑا وسیع سانس والا ہو مگر حرکت میں سست ہو، اور دوسرا تنگ سانس والا ہو مگر حرکت میں تیز ہو۔ اور دوڑ لمبی ہو، تو وسیع سانس والا، اگرچہ وہ شروع میں سست ہو، تنگ سانس والے پر غالب آ جاتا ہے یہاں تک کہ اس سے آگے نکل جاتا ہے اور اسے پیچھے چھوڑ دیتا ہے۔ پس سبقت کا حکم صرف دوڑ کے آخر میں دیا جاتا ہے۔ پس جس نے سبقت کی لکڑی حاصل کر لی، وہی سابق ہے۔ اور اسی لیے گھوڑوں کی دوڑ میں فاصلہ لمبا کیا جاتا ہے، اور یہ اس مقام پر تنبیہ کے لیے مشروع ہے۔ اور مسافت کا آخر ہی وہ مقام ہے جہاں سبقت کا حکم ختم ہوتا ہے۔ اور رحمت (الرحمة) اللہ کے غضب پر سبقت لے گئی ہے، پس وہ اللہ کے کرم سے دونوں جہانوں میں عالم (العالم) کو گھیر لے گی۔ اور یہ اللہ پر کوئی مشکل نہیں ہے۔ اور اگرچہ وہ آگ میں ہوں گے، تو ان کے لیے اس میں نعمت ہو گی، کیونکہ وہ اس سے نکالے جانے والے نہیں ہیں۔ اور اس کا قول سچا ہو گا:\n\nمیری رحمت میرے غضب پر سبقت لے گئی\n\nاور اس کا قول سچا ہو گا: **لَأَمْلَأَنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَالنَّاسِ أَجْمَعِينَ** (میں ضرور جہنم کو جنوں اور انسانوں سب سے بھر دوں گا)۔ اور اس کا قول سچا ہو گا: **وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ** (اور میری رحمت ہر چیز پر محیط ہے)۔ اور میں نے اس مسئلے میں ایک ایسا امر ظاہر کیا ہے جو میرے اختیار میں نہیں تھا، لیکن الٰہی قول کے حق نے اسے ظاہر کرنے کا تقاضا کیا، پس میں اس میں اپنے اختیار میں مجبور کی طرح تھا۔ اور اللہ اس سے جسے چاہے نفع پہنچاتا ہے۔ اس کے سوا کوئی معبود نہیں ہے۔ اور اس منزل (المنزل) کے علم میں یہ مقدار کافی ہے۔ **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب دویست و نود و چهارم در معرفت منزل محمدی مکی از حضرت موسوی»\n\nحق (الحق) قلب هر پیامبری را حرم قرار داد،\nو همچنین گفته شده است قلب هر ولی‌ای را.\n\nآن را به ارث بردند و در میان خود به ارث گذاشتند،\nدر علوم و در مقام بلند.\n\nپس اگر علمی را به شریعت نسبت دادی،\nعلم را در حروف رَوی (حروف قافیه) بجوی.\n\nو دریاهایی که معارف نورانی دارند،\nدر شریف محقق و در فرومایه.\n\nو پیامبر پاک و رسول،\nو فقیر مجرد و غنی.\n\nو نعمتی که در بلندی مرتب شده است،\nو عذابی که در گودال (رَکی) تقسیم گشته است.\n\n### [آیا عدم نزد خداوند مرتبه‌ای دارد یا خیر]\n\nبدان که این منزل (منزل) دربردارنده علم مرتبه عالم نزد خداوند به طور کلی است، و اینکه آیا عدم (العدم) نزد خداوند مرتبه‌ای دارد که به خاطر آن تعظیمش واجب شود یا خیر؟ و آیا کسی که از اهل شقاوت و مغضوب علیهم خلق شده است، نزد خداوند مرتبه تعظیمی دارد یا خیر؟ و آیا تعظیم الهی در شخص معظم اثری دارد که به واسطه آن سعادتمند شود یا خیر؟ و سبب تعظیم خداوند عالم چیست؟ و آیا کسی از خلق که عالم را تعظیم می‌کند، صفتی دارد که با آن شناخته شود یا خیر؟ و اسماء الهی که در مذهب کسانی که می‌گویند خداوند هرگز قسم نخورده مگر به ذات خود، اما گاهی آن را پنهان کرده و گاهی در موطن دیگری آشکار ساخته تا دانسته شود که در مواردی که ذکر نشده نیز پنهان است، به مخلوقات اضافه می‌شوند، کدامند؟ و هر آنچه به این فن مربوط است، اگر به تفصیل ذکر کنیم، سخن به درازا می‌کشد.\n\n### [آیا انسان و حیوان در خلقت از عالم شریک هستند یا خیر]\n\nو از جمله آنچه این منزل دربردارد، علم خلقت انسان از عالم است، و اینکه آیا حیوان در این خلقت با او شریک است یا انسان به آن اختصاص دارد؟ و چرا به این نوع از خلقت اختصاص یافته است؟ و اگر حیوان در آن شریک است، چرا انسان به تنهایی ذکر شده است؟ و چرا لفظ انسان در قرآن هر جا که ذکر شده، یا با مذمت همراه بوده یا با ضعف و نقص، و اگر با مدح ذکر شده، به دنبال آن مذمتی پیوسته آمده است؟ مذمت مانند این قول خداوند: *إِنَّ الْإِنْسانَ لَفِي خُسْرٍ* (همانا انسان در زیان است) و *إِنَّ الْإِنْسانَ لِرَبِّهِ لَكَنُودٌ* (همانا انسان نسبت به پروردگارش ناسپاس است). و ضعف و نقص مانند این قول: *خَلَقْنَا الْإِنْسانَ من سُلالَةٍ من طِينٍ* (انسان را از چکیده‌ای از گِل آفریدیم) و قولش: *لَقَدْ خَلَقْنَا الْإِنْسانَ في كَبَدٍ* (به راستی انسان را در رنج آفریدیم). و مذمتی که به دنبال مدح می‌آید مانند این قول: *لَقَدْ خَلَقْنَا الْإِنْسانَ في أَحْسَنِ تَقْوِيمٍ* (به راستی انسان را در نیکوترین ساختار آفریدیم) که این مدح است، *ثُمَّ رَدَدْناهُ أَسْفَلَ سافِلِينَ* (سپس او را به پست‌ترینِ پَست‌ها بازگرداندیم) که این مذمت است. و این منزل دربردارنده علم سرانجام صاحبان ادعاهایی است که رعونت نفس‌ها به آنها می‌دهد، و دربردارنده تثبیت نعمت‌های حسی و معنوی است، و دربردارنده تخلق به اسماء الهی است، و دربردارنده علم نیرویی است که به انسان داده شده و اینکه این نیرو اثری دارد؛ و در این، ردی بر اشاعره و تقویتی برای معتزله در نسبت دادن افعال به مکلفین است. و دربردارنده علم آنچه تعاون در آن رخ می‌دهد، و دربردارنده علم سرانجام کسی است که دلیل را شناخت اما آن را به خاطر هوای نفس خود ترک کرد. اینها همه رؤوس مسائلی است که این منزل دربردارد و به شاخه‌های بی‌شماری منشعب می‌شوند مگر با مشقت بسیار. اما مرتبه عالم نزد خداوند به طور کلی:\n\n### [همانا خداوند متعال عالم را دلیلی بر معرفت خود آفرید]\n\nبدان که خداوند متعال عالم را به خاطر نیازی که به آن داشت نیافرید، بلکه آن را دلیلی بر معرفت (المعرفة) خود آفرید تا به واسطه آن، آنچه از مرتبه هستی (الوجود) و مرتبه معرفت (المعرفة) ناقص بود، کامل شود. پس از خلقت او، وصف کمالی که بر آن نبود، به سوی او سبحانه بازنگشت، بلکه کمال به طور مطلق از آن اوست. و همچنین عالم در خلقتش مطلوب بالذات نبود، زیرا صفت کمالی با خلقت بر او عارض نشد، بلکه نقص کامل به طور مطلق از آن اوست، چه خلق شود و چه خلق نشود. بلکه مقصود همان بود که ذکر کردیم: اینکه مرتبه هستی (الوجود) و مرتبه معرفت (المعرفة) با وجود عالم کامل شود. و آنچه خداوند در آن از علم به خدا خلق کرد، به دلیل تقسیم عقلی است که به آن داده است. پس اگر عالم به تعظیم وصف می‌شود، از آن جهت است که دلیلی بر معرفت (المعرفة) خداوند قرار داده شده و به واسطه آن مرتبه هستی (الوجود) و مرتبه معرفت (المعرفة) کامل شده است. و دلیل به شرافت مدلول خود شرافت می‌یابد. و چون علم و هستی (الوجود) دو امری هستند که حق (الحق) تعالی به آنها وصف می‌شود، شرافت تام از آن آنهاست. پس عالم به دلیل دلالتش بر آنچه شریف است، شرافت یافته است. اگر کسی بگوید: «اگر مقصود دلالت بود، این امر می‌توانست با یک جوهر فرد که در عالم خلق می‌شد، محقق گردد»، می‌گوییم: راست گفتی، و مقصود ما همین بود، جز اینکه خداوند متعال نسبت‌ها (النسب) و وجوه و حقایقی دارد که پایانی ندارند، هرچند به یک عین واحد بازگردند. اما نسبت‌ها (النسب) به هستی (الوجود) متصف نمی‌شوند تا تناهی در آنها راه یابد. پس اگر چنان بود که اشاره کردی، کمال برای هستی (الوجود) و معرفت (المعرفة) تنها به واسطه آنچه آن مخلوق واحد بر آن دلالت می‌کرد، حاصل می‌شد. در نتیجه، از حق (الحق) شناخته نمی‌شد مگر آنچه آن نسبت خاص اقتضا می‌کرد. و ما گفتیم که نسبت‌ها (النسب) پایان ندارند، پس خلقت ممکنات پایان ندارد. بنابراین، خلقت در دنیا و آخرت پیوسته است. پس معرفت (المعرفة) در دنیا و آخرت پیوسته حادث می‌شود. و به همین دلیل به طلب فزونی علم امر شده است. آیا گمان می‌کنی او را به طلب فزونی علم به اکوان (مخلوقات) امر کرده است؟ نه به خدا، بلکه تنها به فزونی علم به خداوند امر کرده است، از طریق نظر کردن در آنچه از کون (هستی) حادث می‌کند، تا آن کون به او نشان دهد که از کدام نسبت الهی ظاهر شده است. و به همین دلیل پیامبر (صلی الله علیه وسلم) قلب‌ها را آگاه ساخت:\n\nبا این قول در دعای خود: «اللهم إني أسألك بكل اسم سميت به نفسك أو علمته أحدا من خلقك أو استأثرت به في علم غيبك» (بار خدایا، من از تو می‌خواهم به حق هر نامی که خود را بدان نامیدی، یا آن را به یکی از مخلوقاتت آموختی، یا آن را در علم غیب خود مخصوص خویش ساختی).\n\nو اسماء، نسبت‌های الهی هستند و غیب پایانی ندارد، پس خلقت باید پیوسته باشد. و علم عالم از مخلوقات باید در هر حال و زمانی متناهی باشد، و باید در هر نفس (لحظه) پذیرای علمی باشد که نزد او نیست و حادث است و به خدا یا به مخلوقی که بر خدا دلالت می‌کند، تعلق دارد. پس بفهم. اگر کسی بگوید: «اجناس به واسطه آنچه عقل در تقسیم خود بر آن دلالت کرده، محصور هستند، و هر آنچه خلق می‌شود و پایان ندارد، داخل در این تقسیم عقلی است، زیرا این تقسیمی است که هستی (الوجود) حق (الحق) در آن وارد شده است»، می‌گوییم: تقسیم در عقل و آنچه نیروی آن اقتضا می‌کند، صحیح است؛ همان‌طور که اگر بینایی، دیدنی‌ها را تقسیم کند، آنها را بر اساس آنچه نیروی آن اقتضا می‌کند، تقسیم می‌کند. و همچنین شنوایی و هر نیرویی که بر اساس خود چیزی را می‌دهد. اما این دلالت بر حصر مخلوقات ندارد، زیرا آنها به اندازه‌ای که نیرویشان اقتضا می‌کند، تقسیم شده‌اند. و هیچ نیرویی نیست که امری را بدهد و تقسیم را در آن محصور کند، مگر اینکه آنچه نیروی آن نمی‌دهد، از تقسیمش خارج می‌شود. نیروی شنوایی، شنیدنی‌ها را تقسیم می‌کند و متعلق آن فقط کلام و صداهاست. پس تمام دیدنی‌ها، چشیدنی‌ها، بوییدنی‌ها، لمس‌کردنی‌ها و غیره از آن خارج شده‌اند. و همچنین عقل نیز وقتی با نیروی خود آنچه را داد، این دلالت نمی‌کند که امور الهی وجود ندارند که نیروی عقل علم به جزئیات و حقایق آنها را نمی‌دهد، هرچند از جهتی در تقسیم آن وارد شده باشند، اما از جهات دیگر از آن خارج شده‌اند. و جایز است که خداوند در بنده خود نیروی دیگری خلق کند که آنچه نیروی عقل نمی‌دهد را بدهد، و محال را واجب، و واجب را محال، و جایز را نیز چنین گرداند. پس کسی که از سعه‌ای که حضرت الهی در عدم تکرار در خلق و تجلیات (التجلی) اقتضا می‌کند، جاهل باشد، چنین سخنی نمی‌گوید و چنین اعتراضی نمی‌کند. اگر بگوید: «آنچه خلق شده، باید تحت حکم عقل و داخل در تقسیم آن باشد، یا تحت قسم نفی یا اثبات»، می‌گوییم: راست گفتی. ما منکر این نیستیم که آنچه دانسته می‌شود و قبلاً دانسته نمی‌شده، یا در قسم نفی است یا اثبات. اما آیا آنچه تحت آن نفی یا اثبات وارد می‌شود، همان علمی را می‌دهد که نفی می‌دهد، یا همان علمی را که اثبات می‌دهد، یا امر دیگری را می‌دهد؟ زیرا نفی از علم به خداوند آنچه را داده، از آن جهت که نفی است، نه از آن جهت که تحت دلالت آن از منفیات بی‌نهایت قرار دارد. و اثبات از علم به خداوند آنچه را داده، از آن جهت که اثبات است، نه از آن جهت که تحت دلالت آن از مثبتات قرار دارد. پس ایجاد مستمر است و علم در ما با حدوث ایجاد حادث می‌شود. و معلومی که علم به آن دلیل خاص تعلق گرفته، معلوم دیگر نیست. پس آن معلوم برای خداست نه برای عالم. بنابراین، مرتبه آن علم با وجودش در این عالم کونی کامل شد، و مرتبه هستی (الوجود) خاص این موجود با ظهور عینش کامل شد. و آنچه هر موجودی از علم ذوقی می‌دهد، دیگری نمی‌دهد. و چه بسا انسان در خوردن یک سیب، در هر گازی که می‌زند تا زمانی که از خوردن آن فارغ شود، تفاوت ذوقی در خود می‌یابد که آن را جز در همان گاز خاص نمی‌یابد، در حالی که سیب یکی است. و در هر لقمه از آن، فرقانی حسی می‌یابد، هرچند نتواند آن را ترجمه کند. و کسی که آنچه را ذکر کردیم، محقق کند، می‌داند که امر خارج از طور هر نیروی موجودی است، خواه آن نیرو عقل باشد یا غیر آن. پس منزه است کسی که علمش به معلومات بی‌نهایت تعلق گرفته است. *لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ* (هیچ معبودی جز او نیست، عزیز و حکیم). خداوند متعال می‌فرماید: *وَلا يُحِيطُونَ بِشَيْ‏ءٍ من عِلْمِهِ إِلَّا بِما شاءَ* (و به چیزی از علم او احاطه نمی‌یابند مگر به آنچه او بخواهد). و در این آیه برای تو بیان کرد که عقل و غیر آن، خداوند به آنها علمی نداده مگر آنچه خواسته است. *وَلا يُحِيطُونَ بِهِ عِلْماً* (و به او از نظر علم احاطه نمی‌یابند). و به همین دلیل فرمود: *وَعَنَتِ الْوُجُوهُ* (و چهره‌ها خضوع کردند) به دنبال قولش: *وَلا يُحِيطُونَ بِهِ عِلْماً* (و به او از نظر علم احاطه نمی‌یابند). یعنی وقتی دانستند که به او احاطه علمی ندارند، خضوع کردند و ذلیل شدند و طلب فزونی علم کردند در آنچه از او علم ندارند. و وجوه (چهره‌ها) در اینجا اعیان ذات‌ها و حقایق موجودات هستند، زیرا وجه هر شیء ذات آن است. و هر آنچه خداوند از عالم خلق کرده، آن را بر کمالش در ذات خود خلق کرده است. آن کمال، وجه آن است. خداوند متعال می‌فرماید: *أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ* (به هر چیزی خلقتش را عطا کرد)، پس آن را کامل کرد، *ثُمَّ هَدى‏* (سپس هدایت کرد)، پس هدایت را نیز که در اینجا بیان است، به خلقتش عطا کرد. پس امر را برای بندگانش بر کامل‌ترین وجوه آن، عقلاً و شرعاً، بیان کرد. نه ابهام گذاشت، نه رمز آورد و نه معما ساخت. *إِنْ هُوَ إِلَّا ذِكْرٌ وقُرْآنٌ مُبِينٌ* (این نیست مگر تذکر و قرآنی آشکار)... *لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ* (تا برای مردم آنچه را که به سوی ایشان نازل شده است، بیان کنی). و اگر بیان نبود، بین متشابه و محکم تفاوتی گذاشته نمی‌شد تا دانسته شود که متشابه را جز خدا نمی‌داند و علم ما به محکم تعلق می‌گیرد. پس اگر متشابه نازل نمی‌شد تا بدانیم که متشابه است، به دلیل اینکه در آن وجهی می‌بینیم که شبیه وصف مخلوق است و شبیه وصف خالق، پس معنای آن متشابه را جز خدا نمی‌داند. اگر متشابه نازل نمی‌شد، دانسته نمی‌شد که در علم خدا چیزی وجود دارد که متشابه است. و این نهایت بیان است، زیرا برای ما بیان کرد که چیزی هست که دانسته می‌شود و چیزی هست که جز خدا نمی‌داند. و ممکن است خداوند آن را به هر کس از خلقش که بخواهد، به هر وجهی که بخواهد، بیاموزد. و از جمله آنچه این منزل دربردارد، علم به قسم‌های الهی است که در شرایع پیشین و پسین آمده است، اینکه چرا قسم خورده و وقتی قسم خورده، به چه کسی قسم خورده است؟ آیا به ذات خود یا به مخلوقاتش، یا گاهی به این و گاهی به آن؟ مانند قولش: *تَاللَّهِ لَقَدْ أَرْسَلْنا* (به خدا سوگند، فرستادیم) که به خدا قسم خورده است. و مانند قولش: *فَوَ رَبِّكَ* (پس به پروردگارت سوگند)، *فَوَ رَبِّ السَّماءِ والْأَرْضِ* (پس به پروردگار آسمان و زمین سوگند). و مانند قولش: *والذَّارِياتِ* (سوگند به بادهای پراکنده‌کننده)، *والْمُرْسَلاتِ* (و سوگند به فرستادگان)، *والصَّافَّاتِ* (و سوگند به صف‌بستگان)، *والنَّجْمِ* (و سوگند به ستاره)، *والشَّمْسِ* (و سوگند به خورشید) و غیر آن از مخلوقاتی که در ظاهر آنها را در مقام اسماء خود قرار داده است. اگر پنهان کرده، چه چیزی از اسماء را پنهان کرده است؟ و در هر حال، آنها به واسطه اضافه‌شدن به او، شرافت عظیمی دارند، خواه اسم ظاهر شود یا نشود. و قسم عام: *فَلا أُقْسِمُ بِما تُبْصِرُونَ * وما لا تُبْصِرُونَ* (پس سوگند به آنچه می‌بینید * و آنچه نمی‌بینید). پس در این قسم، تمام اشیاء از موجودات وارد شدند و عدم (العدم) و معدومات نیز وارد شدند، که همان قول اوست: *وَما لا تُبْصِرُونَ* (و آنچه نمی‌بینید). و آنچه را در حال و آینده می‌بینید، و آینده معدوم است. پس اشیاء نسبتی به شرافت و تعظیم دارند، و همچنین عدم (العدم). اما شرافت عدم مطلق (العدم المطلق) این است که بر هستی مطلق (الوجود المطلق) دلالت می‌کند. پس از جهت دلالت تعظیم یافته است. و این چیزی است که بر زبان مردم جاری است و در شعر آمده است:\n\nوبضدها تتميز الأشياء\n(و اشیاء به ضد خود متمایز می‌شوند)\n\nپس عدم (العدم)، هستی (الوجود) را متمایز کرد و هستی (الوجود)، عدم (العدم) را متمایز کرد. اما شرافت عدم مقید (العدم المقید) این است که بر صفتی است که پذیرای هستی (الوجود) است، و هستی (الوجود) در ذات خود شریف است و به همین دلیل از اوصاف حق (الحق) است. پس به واسطه وجه پذیرش هستی (الوجود)، بر عدم مطلق (العدم المطلق) شرافت یافته است. پس دو دلالت بر حق (الحق) دارد: دلالتی در حال عدمش و دلالتی در حال وجودش. و شرافت عدم مطلق (العدم المطلق) بر مقید از یک جهت است، و آن این است که از تعظیم او نسبت به خدا و قوت دلالتش این است که هستی (الوجود) را نپذیرفت و بر اصل خود در عینش باقی ماند، از روی غیرت بر جناب الهی که مبادا در صفت هستی (الوجود) با او شریک شود و اسمی که بر خدا اطلاق می‌شود، بر او نیز اطلاق گردد. و چون نفس امر بر این منوال بود، حق (الحق) برای موجودات تسبیح را تشریع کرد، که همان تنزیه است؛ و آن این است که به نفی صفات محدثین از او وصف شود. و تنزیه وصف عدمی است. پس او سبحانه عدم مطلق (العدم المطلق) را شرافت بخشید به اینکه خود را به آن وصف کرد و فرمود: *سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ* (منزه است پروردگار تو، پروردگار عزت، از آنچه وصف می‌کنند)، برای شرافت بخشیدن به عدم (العدم) به خاطر این قصد محقق در تعظیم خداوند. زیرا او به آنچه خداوند سزاوار آن است، آشناتر از معدوم مقید است. زیرا او صفت ازل را در عدم خود دارد، همان‌طور که حق (الحق) صفت ازل را در هستی (الوجود) خود دارد. و آن، وصف حق (الحق) به نفی اولیت است، و وصف عدم (العدم) به نفی هستی (الوجود) از ذاتش است. پس هیچ چیز جز خدا، خدا را به اندازه‌ی عدم مطلق (العدم المطلق) نشناخت. و چون عدم (العدم) این شرافت را داشت و ادعا و مشارکت برای موجودات بود، به ما گفته شد: *وَقَدْ خَلَقْتُكَ من قَبْلُ ولَمْ تَكُ شَيْئاً* (و تو را پیش از این آفریدم و تو چیزی نبودی)، یعنی موجود نبودی. پس در حال وجودت نیز با من باش در عدم اعتراض بر حکم و تسلیم در برابر مجاری تقدیرات، همان‌طور که در حال عدمت بودی. پس شرافت انسان را بازگشت او در وجودش به حال عدمش قرار داد. و اگر شرافت عدم (العدم) به آنچه ذکر کردیم نبود، حق (الحق) موجود مخلوق را به بازگشت به آن حالت در حکم (نه در عین) آگاه نمی‌ساخت. و بر این وصف بازگشت به عدم (العدم) در حکم، با وجود عینی، قادر نیست مگر کسی که بداند از کجا آمده و از او چه خواسته شده و برای چه خلق شده است. پس از شرافت عدم مطلق (العدم المطلق) آنچه کفایت می‌کند، برای تو روشن شد. و این مسئله‌ای است که مردم از آن غفلت کرده‌اند و آن را از خدا درک نکرده‌اند، هنگامی که آن را ذکر کرد. و چون روشن شد که شرافت برای موجودات و معدومات تنها از جهت دلالت است، تعظیم آنها واجب شد. پس خداوند متعال فرمود: *وَمَن يُعَظِّمْ شَعائِرَ الله فَإِنَّها من تَقْوَى الْقُلُوبِ* (و هر کس شعائر الهی را بزرگ دارد، این از پرهیزگاری دل‌هاست). و شعائر، علامت‌ها هستند، پس آنها دلالت‌ها هستند. پس هر کس آنها را تعظیم کند، در تمام حالاتش پرهیزگار است، زیرا قلب‌ها از تقلب (دگرگونی) هستند. و او سبحانه نفرمود که این از پرهیزگاری نفس‌ها یا پرهیزگاری ارواح است، بلکه فرمود: *من تَقْوَى الْقُلُوبِ* (از پرهیزگاری دل‌هاست)، زیرا انسان در حالات با هر نفس (دم) دگرگون می‌شود، و این ایجاد معدومات با هر نفس است. و هر کس در هر دگرگونی که در آن دگرگون می‌شود، تقوای خدا پیشه کند، این نهایت چیزی است که خداوند از انسان خواسته است. و به آن نمی‌رسد مگر اقویا و کاملان از خلق، زیرا شعور به این دگرگونی نادر است. و به همین دلیل فرمود: *شَعائِرَ الله* (شعائر الهی)، یعنی آنها به آنچه بر آن دلالت می‌کنند، شعور می‌بخشند. و شعائر نیستند مگر در حق کسی که به آنها شعور یابد. و کسانی که به آنها شعور نمی‌یابند، که بیشتر خلق هستند، آنها را تعظیم نمی‌کنند. پس آنها را تعظیم نمی‌کند مگر کسی که در تمام توجهات و تصرفات خود، قصد خدا را داشته باشد. و به همین دلیل خداوند آنها را ذکر نکرد مگر در حج که تکرار قصد است. و چون هیچ انسانی از قصد خالی نیست، ذکر شعائر در آیه حج آمد و مناسک که متعدد هستند، ذکر شدند، یعنی در هر قصد. پس سبب قسم خوردن به اشیاء، طلب تعظیم اشیاء از سوی خلق بود تا هیچ چیزی از اشیاء را که دلالت بر خدا دارد، نادیده نگیرند، خواه آن دلیل سعادتمند باشد یا شقی، و خواه عدم باشد یا وجود، هر کدام که باشد. و اگرچه قصد الهی از قسم، ذات خود اوست نه اشیاء، بلکه مقصود هر دو امر با هم است، و این صحیح است. پس بدان که مراد از این قصد دیگر، جز تعظیم ما و شناساندن نیست. پس اشیاء را ذکر کرد و اسماء الهی را پنهان داشت تا اشیاء بر آنچه از اسماء الهی می‌خواهد، دلالت کنند. پس از دلالت و شرافت خود خارج نمی‌شوند. پس فرمود: *وَالسَّماءِ وما بَناها* (سوگند به آسمان و کسی که آن را بنا کرد)، یعنی و به بناکننده آسمان. *وَالْأَرْضِ وما طَحاها* (و سوگند به زمین و کسی که آن را گستراند)، یعنی و به گستراننده زمین. *والنَّجْمِ إِذا هَوى‏* (و سوگند به ستاره هنگامی که فرو می‌افتد)، یعنی و به فروافکننده ستاره. پس اشیاء مختلف شدند، نسبت‌ها (النسب) مختلف شدند، اسماء مختلف شدند و آنهایی که مختص به این کون مذکور بودند، معین شدند. پس از خداوند دانسته شد که چه اسمی باید بر او اطلاق شود، در معنا در آنچه پنهان داشت و در لفظ در آنچه آشکار ساخت. زیرا اگر می‌خواست آنچه را پنهان کرده، بر او اطلاق کند، آن را آشکار می‌ساخت، همان‌طور که در قولش: *فَوَ رَبِّ السَّماءِ والْأَرْضِ* (پس به پروردگار آسمان و زمین سوگند) آشکار ساخت. پس اسم «رب» را با نسبت خاصی که به آسمان تعلق دارد، آورد. و اسم زمین پنهان است، زیرا رب برای زمین نسبت خاصی دارد که در آسمان نیست. و به همین دلیل با هم یکسان نیستند، بلکه آسمان به دلیل اختلاف نسبت‌ها (النسب) با زمین متفاوت است. پس نسبت رب در خلق آسمان با نسبت ربانی در خلق زمین متفاوت است. و اگر وجود واو در قولش «والأرض» که دلالت بر تشارک می‌کند، نبود، می‌گفتیم به دلیل اختلاف نسبت، اسم رب نیز متفاوت است. اما واو مانع شد. و قرآن به زبان عربی نازل شده است، و واو در این باب در زبان، اگر اولی ذکر شود و در معطوف علیه حکم دیگری ذکر نشود، دلالت بر تشارک می‌کند. پس اگر بگویی: «قام زید وعمرو» (زید و عمرو برخاستند)، اگر گوینده بر این توقف کند، بدون مانع عارضی مانند قطع شدن نفس به سرفه‌ای که بر او عارض شود یا اشتغالی که او را از اتمام تلفظ مرادش باز دارد، پس دلالت بر تشارک می‌کند و در آنچه ذکر شد، ناگزیر است. پس مانع، او را از گفتن «وعمرو خارج» (و عمرو خارج شد) یا «وعمرو وأبوه قاعد» (و عمرو و پدرش نشسته‌اند) باز داشته است. این واو، واو ابتداء و حال است نه واو عطف. اما اگر بگوید: «قام زيد وخرج عمرو» (زید برخاست و عمرو خارج شد)، این واو عطف است، یعنی عطف جمله بر جمله، نه واو تشارک. به همین دلیل، واو در قولش «والأرض» را برای تشارک در اسم الهی مذکور که معطوف علیه است، قرار دادیم. و پنهان‌سازی در نسبتی بود که در آن تفاوت رخ می‌دهد. پس بفهم، زیرا این از دقیق‌ترین معارف (المعرفة) به خداوند است.\n\n### [نصی وجود ندارد که بر جاودانگی عذابی که همان درد است، دلالت کند]\n\nو بدان که چون برخی از عارفان (العارفين) تعظیم این امور را مشروع دیدند، هر آنچه غیر خداست را به سعادت ملحق کردند. سعادتی که در حق صاحبان اغراض از مخلوقین، رسیدن آنها به اغراضی است که در حال برایشان خلق می‌شود. پس صاحب این نظر، هیچ کس را در عذابی که همان درد است، باقی نگذاشت. زیرا درد ذاتاً ناخوشایند است. و اگرچه جهنم را پر کنند، اما برای آنها در آن نعمتی ذوقی وجود دارد که غیر آنها آن را نمی‌شناسد. زیرا هر یک از دو سرا (بهشت و جهنم) پرکننده خود را دارد. پس خداوند خبر داد که آن را پر می‌کند و در آن جاودانه می‌سازد. اما نصی وجود ندارد که بر جاودانگی عذابی که همان درد است، دلالت کند، نه حرکات سببی در وجود درد به عادت، با مزاج خاصی که درد را حس می‌کند. پس ما ضرب و قطع و سوختن را در هستی (الوجود) آشکارا می‌بینیم، اما لزوماً از آن افعال، درد حاصل نمی‌شود. و ما این را از نفس‌های خود در این طریق (عرفان) مشاهده کرده‌ایم. و این از شرافت این طریق است. و در این باره اصحاب ما می‌گویند: «عجیب نیست کسی که در بوستان وارد شود، زیرا این امر معتاد است. بلکه عجیب کسی است که در میان آتش وارد شود، زیرا این غیر معتاد است.» منظور این است که عجیب نیست کسی که در امر معتاد لذت می‌یابد، بلکه عجیب کسی است که در غیر سبب معتاد لذت می‌یابد. و این همان چیزی بود که ابویزید در قولش طلب می‌کرد:\n\nسوى ملذوذ وجدي بالعذاب‏\n(جز لذت یافتنِ وجد من به عذاب)\n\nو به همین دلیل عذاب نامیده شده است، زیرا در حالی که نزد قومی عذاب است، برای مزاجی آن را می‌طلبد. و چون حق (الحق) امر به تعظیم هر آنچه غیر اوست و به او اضافه شده، می‌کند، و جز آنچه به او اضافه شده، وجود ندارد، خواه به نص یا به عقل، بعید است که عذابی که همان درد است، بر او جاودانه شود. و خداوند بود و چیزی با او نبود، و وصفی که بر آن نبود، از آنچه ایجاد و خلق کرد، به او بازنگشت. پس او همچنین هست و خواهد بود. و ما این را به خاطر کسی گفتیم که قائل به نفی اسمی از اسماء الهی است که اثری ندارد. گفتیم: اگرچه اثری نداشته باشد، کمال او به وجود اثر از آن نیست، زیرا عین یکی است. پس این را بفهم. و این مسئله‌ای از مشکل‌ترین مسائل در این طریق است.\n\n### [همانا رحمت خداوند بر غضبش پیشی گرفته است]\n\nو خداوند می‌فرماید: *إِنَّ رَحْمَتَهُ سَبَقَتْ غَضَبَهُ* (همانا رحمت او بر غضبش پیشی گرفته است). منظور این است که حکم او به رحمت بندگانش بر غضب او بر آنها پیشی گرفته است. و پیشی گرفتن در نفس مسابقه (شأو) ظاهر نمی‌شود. زیرا ممکن است اسبی نفس طولانی و حرکت کند داشته باشد و دیگری نفس کوتاه و حرکت سریع. و مسابقه طولانی باشد. پس اسب با نفس طولانی، هرچند در ابتدا کند باشد، پیوسته بر اسب با نفس کوتاه پیشی می‌گیرد تا از او جلو افتاده و او را پشت سر بگذارد. پس حکم به پیشی گرفتن نمی‌شود مگر در پایان مسابقه. پس کسی که چوب سبقت را به دست آورد، او پیشی‌گیرنده است. و به همین دلیل در مسابقه اسب‌ها مسافت را طولانی می‌کنند، و این در معرض آگاهی دادن به این مقام مشروع است. و پایان مسافت همان جایی است که حکم به سبقت در آن نهایی می‌شود. و رحمت بر غضب خداوند بر خلقش پیشی گرفته است، پس به کرم خداوند، عالم را در هر دو سرا (دنیا و آخرت) در بر می‌گیرد. و این بر خداوند دشوار نیست. و اگرچه در آتش باشند، برای آنها در آن نعمتی است، زیرا آنها:\n\nاز آن خارج نمی‌شوند. و این قول خداوند: *سَبَقَتْ رَحْمَتِي غَضَبِي* (رحمت من بر غضبم پیشی گرفته است) را تصدیق می‌کند. و قولش: *لَأَمْلَأَنَّ جَهَنَّمَ من الْجِنَّةِ والنَّاسِ أَجْمَعِينَ* (قطعاً جهنم را از جن و انس، همگی پر خواهم کرد) را تصدیق می‌کند. و قولش: *ورَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ* (و رحمت من همه چیز را فرا گرفته است) را تصدیق می‌کند. و من در این مسئله امری را آشکار ساختم که به اختیار من نبود، بلکه حق (الحق) قول الهی به آشکار ساختن آن بود. پس من در آن مانند مجبور در اختیار خود بودم. و خداوند به واسطه آن به هر کس که بخواهد نفع می‌رساند. *لا إِلهَ إِلَّا هُوَ* (هیچ معبودی جز او نیست). و این مقدار از علم این منزل کافی است. *وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ* (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}