{
  "id": 479,
  "title": {
    "ar": "الباب التاسع والسبعون وأربعمائة في حال قطب كان منزله ومن يُعَظِّمْ حُرُماتِ الله فَهُوَ خَيْرٌ لَهُ عِنْدَ رَبِّهِ",
    "en": "Chapter Four Hundred and Seventy-Nine: Concerning the state (حال) of a Pole (قطب) whose station (منزل) was: <<And whosoever honors the sacred things (حُرُمَات) of Allah, it is better for him in the sight of his Lord.>>",
    "ur": "باب چار سو اناسی (۴۷۹) قطب (قطب) کے حال کے بارے میں جس کا مقام یہ تھا: وَمَن يُعَظِّمْ حُرُمَاتِ اللَّهِ فَهُوَ خَيْرٌ لَّهُ عِندَ رَبِّهِ (اور جو کوئی اللہ کی حرمتوں کی تعظیم کرے تو یہ اس کے لیے اس کے رب کے نزدیک بہتر ہے)",
    "fa": "باب چهارصد و هفتاد و نهم در بیان حال قطبی که منزلگاهش این آیه بود: «و هر کس حرمت‌های خدا را بزرگ دارد، پس آن برای او نزد پروردگارش بهتر است» (وَمَن يُعَظِّمْ حُرُمَاتِ اللَّهِ فَهُوَ خَيْرٌ لَّهُ عِندَ رَبِّهِ)."
  },
  "content": {
    "ar": "## «الباب التاسع والسبعون وأربعمائة في حال قطب كان منزله ومن يُعَظِّمْ حُرُماتِ الله فَهُوَ خَيْرٌ لَهُ عِنْدَ رَبِّهِ»\n\n\n> من يعظم حرمة الله *** ما يرى عينا سوى الله‏\n\n\n> كل ما في الكون حرمته *** ليس في الأعيان إلا هي‏\n\n\n> ليس بالساهي معظمها *** لا ولا في الحكم باللاهي‏\n\n\n> كيف يسهو عن محارمه *** من يرى الأشياء بالله‏\n\n\n> فهو الرائي بجار حتى *** وأنا عن ذاك بالساهي‏\n\n\n### [العالم كله حرم الله‏]\n\n\nالعالم حرم الحق والكون حرمه الذي أسكن فيه هؤلاء الحرم وأعظم الحرم ما له فيه أثر الطبع النكاحي لأنه محل التكوين والعالم كله حرم الله فإنه محل تكوين الأحكام الإلهية لظهور الأعيان فأي عين ظهر عاد حرمة من الحرم فحواء من آدم سواء منه ظهرت فهي عينه وهو عينها حرمته وزوجته التي كون فيها نبيه لأنها ضلعه القصير قبل الشكل المعلوم بالإنسان فهكذا ما خلق الله من العالم والإشارة إليه في قوله جَمِيعاً مِنْهُ وقوله في عيسى ورُوحٌ مِنْهُ لم ينسبه إلى غير لأنه ما ثم غير فمن عظم حرمة الله ومن العالم فما عظم إلا نفسه وقد تبين لك أنك منه لا من ذاتك من أمر آخر فمن عظم حرمة الله فإنما عظم الله ومن عظم الله كان خيرا له وهو ما يجازيه به من التعظيم في مثل قوله ومن يُعَظِّمْ شَعائِرَ الله ومن يُعَظِّمْ حُرُماتِ الله وقوله عِنْدَ رَبِّهِ العامل في هذا الظرف في طريقنا قوله ومن يُعَظِّمْ أي من يعظمها عِنْدَ رَبِّهِ‏\nأي في ذلك الموطن فلتبحث في المواطن التي تكون فيها عند ربك ما هي كالصلاة مثلا فإن المصلي يناجي ربه فهو عند ربه فإذا عظم حرمة الله في هذا الموطن كان خيرا له وتعظيم الحرمة أن يتلبس بها حتى تعظم فإذا عظمت كان التكوين كما جاء فلما أثقلت دعوا الله والمؤمن إذا نام على طهارة فروحه عند ربه فيعظم هناك حرمة الله فيكون الخير الذي له في مثل هذا الموطن المبشرة التي تحصل له في نومه أو يراها له غيره والمواطن التي يكون العبد فيها عند ربه كثيرة فيعظم فيها حرمات الله على الشهود وهذا الباب إن بسطنا القول فيه طال وهذه الإشارة القليلة تعطي صاحب الفهم بقوتها ما في البسط من الفوائد الوجودية وهذا كاف في الغرض المقصود والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيل‏\n\n",
    "en": "Chapter 479: Concerning the State of a Pole (Qutb) Whose Station Was: \"And whoever honors the sacred things of Allah, it is better for him in the sight of his Lord.\"\n\nWhoever honors the sacredness of Allah,\nSees no entity (عين) other than Allah.\n\nEverything in the cosmos is His sacredness,\nThere is nothing in the Fixed Entities (الأعيان) except Him.\n\nThe one who honors it is not heedless (الساهي),\nNor is he frivolous (اللاهي) in judgment.\n\nHow can he be heedless of His sacred prohibitions,\nHe who sees all things through Allah?\n\nHe is the Seer, even by means of the neighbor,\nWhile I am heedless of that.\n\n### [The Entire World is the Sacred Precinct of Allah]\n\nThe World (العالم) is the sacred precinct (حرم) of the Real (الحق), and the Cosmos (الكون) is His sacred precinct wherein He has settled these sacred things (الحرم). The greatest of the sacred precincts is that in which the effect of the conjugal nature (الطبع النكاحي) is found, because it is the locus of formation (محل التكوين).\n\nThe entire World is the sacred precinct of Allah, for it is the locus for the formation of the Divine decrees (الأحكام الإلهية) for the manifestation of the Entities (الأعيان). Thus, whichever entity manifests, it returns as a sacred thing (حرمة) from the sacred precincts. So, Eve (حواء) is from Adam (آدم), having manifested from him; she is his entity (عينه) and he is her entity (عينها), his sacred thing and his wife, in whom He formed His Prophet, because she is his short rib before the known form of the human (الإنسان).\n\nThis is the case with everything Allah created in the World. The reference to this is in His saying: <<جَمِيعاً مِنْهُ>> (All of it is from Him), and His saying concerning Jesus (عيسى): <<وَرُوحٌ مِنْهُ>> (And a Spirit from Him). He did not attribute it to other than Himself because there is no other (غير) there.\n\nTherefore, whoever honors the sacred thing of Allah, and of the World, has only honored himself. It has become clear to you that you are from Him, not from your own essence (ذاتك) derived from some other matter. Thus, whoever honors the sacred thing of Allah has only honored Allah. And whoever honors Allah, it is better for him, which is the honoring with which He rewards him, as in His saying: <<وَمَن يُعَظِّمْ شَعَائِرَ اللَّهِ>> (And whoever honors the symbols of Allah) and <<وَمَن يُعَظِّمْ حُرُمَاتِ اللَّهِ>> (And whoever honors the sacred things of Allah), and His saying: <<عِندَ رَبِّهِ>> (in the sight of his Lord).\n\nThe operative word (العامل) for this adverbial phrase (الظرف) in our path is His saying: \"And whoever honors,\" meaning, whoever honors them <<عِندَ رَبِّهِ>> (in the sight of his Lord), that is, in that station (الموطن).\n\nTherefore, you should investigate what the stations (المواطن) are in which you are \"in the sight of your Lord,\" such as the Prayer (الصلاة), for example. The one who prays is communing with his Lord, so he is \"in the sight of his Lord.\" If he honors the sacred thing of Allah in this station, it is better for him.\n\nThe honoring of the sacred thing (الحرمة) is that one should be clothed in it until it becomes great, and when it becomes great, the formation (التكوين) occurs, as it came in the verse: <<فَلَمَّا أَثْقَلَت دَّعَوَا اللَّهَ>> (But when she became heavy, they both invoked Allah).\n\nAnd when the believer sleeps in a state of ritual purity (طهارة), his spirit (روح) is in the sight of his Lord. He honors the sacred thing of Allah there, and the good (الخير) that accrues to him in such a station is the glad tidings (المبشرة) that he receives in his sleep, or that someone else sees for him.\n\nThe stations (المواطن) in which the servant (العبد) is \"in the sight of his Lord\" are numerous, and in them he honors the sacred things of Allah based on Witnessing (الشهود).\n\nIf we were to elaborate on this chapter, the discussion would be lengthy. This brief allusion, however, grants the person of understanding, through its power, the existential benefits (الفوائد الوجودية) contained in the elaboration. This is sufficient for the intended purpose. <<وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ>> (And praise be to Allah, Lord of the Worlds). <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو اناسی قطب کے حال کے بارے میں جس کا مقام یہ تھا: \"اور جو شخص اللہ کی حرمتوں کی تعظیم کرے تو یہ اس کے لیے اس کے رب کے نزدیک بہتر ہے۔\" (وَمَن يُعَظِّمْ حُرُمَاتِ اللَّهِ فَهُوَ خَيْرٌ لَّهُ عِندَ رَبِّهِ)\n\nجو شخص اللہ کی حرمت کی تعظیم کرتا ہے (من يعظم حرمة الله)،\nوہ اللہ کے سوا کوئی عین (حقیقت) نہیں دیکھتا (ما يرى عينا سوى الله)۔\n\nکائنات میں جو کچھ بھی ہے، وہ اس کی حرمت ہے (كل ما في الكون حرمته)،\nاعیان (الأعيان) میں اس کے سوا کچھ نہیں ہے (ليس في الأعيان إلا هي)۔\n\nاس کی تعظیم کرنے والا نہ تو غافل (ساهي) ہوتا ہے (ليس بالساهي معظمها)،\nاور نہ ہی حکم میں لاپرواہ (لاهي) ہوتا ہے (لا ولا في الحكم باللاهي)۔\n\nوہ اپنی محرمات (حرمتوں) سے کیسے غافل ہو سکتا ہے (كيف يسهو عن محارمه)،\nجو ہر شے کو اللہ کے ذریعے دیکھتا ہے (من يرى الأشياء بالله)۔\n\nپس وہ (ذات حق) پڑوسی کے ذریعے بھی دیکھنے والا ہے (فهو الرائي بجار حتى)،\nجبکہ میں اس سے غافل ہوں (وأنا عن ذاك بالساهي)۔\n\n### [پوری کائنات اللہ کا حرم ہے]\n\nکائنات (العالم) ذات حق (الحق) کا حرم ہے، اور یہ وہ حرم ہے جس میں اس نے ان حرمتوں کو بسایا ہے۔ سب سے بڑی حرمت وہ ہے جس میں طبع نکاحی (تولیدی فطرت) کا اثر موجود ہے، کیونکہ یہ تکوین (پیدائش) کا مقام ہے۔ اور پوری کائنات اللہ کا حرم ہے، کیونکہ یہ اعیان (الأعيان) کے ظہور کے لیے احکامِ الٰہیہ کی تکوین کا مقام ہے۔ پس جو بھی عین (حقیقت) ظاہر ہوتی ہے، وہ حرمتوں میں سے ایک حرمت بن جاتی ہے۔ چنانچہ حوا، آدم سے ہیں، خواہ وہ اس سے ظاہر ہوئی ہوں، وہ اس کی عین (حقیقت) ہے اور وہ اس کی عین (حقیقت) ہے۔ یہ اس کی حرمت اور اس کی بیوی ہے جس میں اس نے اپنے نبی کو پیدا کیا، کیونکہ وہ انسان کے معلوم شکل سے پہلے اس کی چھوٹی پسلی تھی۔ اسی طرح وہ سب کچھ ہے جسے اللہ نے کائنات میں پیدا کیا۔\n\nاس کی طرف اشارہ اللہ تعالیٰ کے اس قول میں ہے: \"جَمِيعاً مِنْهُ\" (سب کچھ اسی کی طرف سے ہے) اور عیسیٰ (علیہ السلام) کے بارے میں اس کا قول: \"وَرُوحٌ مِّنْهُ\" (اور ایک روح اس کی طرف سے)۔ اس نے اسے کسی اور کی طرف منسوب نہیں کیا کیونکہ وہاں کوئی اور ہے ہی نہیں۔ پس جس نے اللہ کی حرمت کی تعظیم کی، اور کائنات کی حرمت کی تعظیم کی، تو اس نے اپنی ذات کے سوا کسی کی تعظیم نہیں کی۔ اور یہ بات آپ پر واضح ہو چکی ہے کہ آپ اس (حق) سے ہیں، نہ کہ کسی اور امر سے اپنی ذات سے۔ پس جو شخص اللہ کی حرمت کی تعظیم کرتا ہے، وہ درحقیقت اللہ کی تعظیم کرتا ہے۔ اور جس نے اللہ کی تعظیم کی، تو یہ اس کے لیے بہتر ہے، اور یہی وہ بدلہ ہے جو وہ اسے تعظیم کی صورت میں دیتا ہے، جیسا کہ اس کے اس قول میں ہے: \"وَمَن يُعَظِّمْ شَعَائِرَ اللَّهِ\" (اور جو شخص اللہ کی نشانیوں کی تعظیم کرے) اور \"وَمَن يُعَظِّمْ حُرُمَاتِ اللَّهِ\" (اور جو شخص اللہ کی حرمتوں کی تعظیم کرے)۔\n\nاور اس کا قول \"عِنْدَ رَبِّهِ\" (اس کے رب کے نزدیک)۔ ہمارے طریقے (طریقنا) میں اس ظرف (جگہ/وقت) میں عمل کرنے والا اس کا قول ہے: \"وَمَن يُعَظِّمْ\" (یعنی جو اس کی تعظیم کرے) \"عِنْدَ رَبِّهِ\" (یعنی اس مقام پر)۔ پس آپ کو ان مقامات کی تحقیق کرنی چاہیے جہاں آپ اپنے رب کے نزدیک ہوتے ہیں، وہ کیا ہیں؟ جیسے کہ نماز۔ مثال کے طور پر، نمازی اپنے رب سے سرگوشی کرتا ہے، پس وہ اپنے رب کے نزدیک ہوتا ہے۔ لہٰذا، جب وہ اس مقام پر اللہ کی حرمت کی تعظیم کرتا ہے، تو یہ اس کے لیے بہتر ہوتا ہے۔\n\nاور حرمت کی تعظیم یہ ہے کہ انسان اس سے اس طرح وابستہ ہو جائے کہ وہ عظیم ہو جائے، اور جب وہ عظیم ہو جاتی ہے تو تکوین (پیدائش) اسی طرح ہوتی ہے جیسا کہ آیا ہے: \"فَلَمَّا أَثْقَلَت دَّعَوَا اللَّهَ\" (پھر جب وہ بوجھل ہو گئی تو دونوں نے اللہ سے دعا کی)۔ اور جب مومن طہارت کی حالت میں سوتا ہے، تو اس کی روح اس کے رب کے نزدیک ہوتی ہے۔ پس وہ وہاں اللہ کی حرمت کی تعظیم کرتا ہے، اور اس طرح کے مقام پر جو خیر (بھلائی) اسے حاصل ہوتی ہے، وہ بشارتیں ہیں جو اسے نیند میں حاصل ہوتی ہیں یا کوئی دوسرا شخص اس کے لیے دیکھتا ہے۔\n\nاور وہ مقامات جہاں بندہ اپنے رب کے نزدیک ہوتا ہے، بہت زیادہ ہیں۔ پس وہ ان میں شہود (الشہود) کے ذریعے اللہ کی حرمتوں کی تعظیم کرتا ہے۔ اگر ہم اس باب میں بات کو پھیلاتے تو یہ طویل ہو جاتا۔ اور یہ مختصر اشارہ صاحبِ فہم کو اپنی قوت کے ذریعے وہ فوائدِ وجودیہ (الفوائد الوجودية) عطا کرتا ہے جو تفصیل میں موجود ہیں۔ اور یہ مقصود کے لیے کافی ہے۔ \"وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ\" (اور تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے)۔ \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و هفتاد و نهم در حال قطبی که منزل او این آیه بود: «و هر کس حرمت‌های خدا را بزرگ دارد، پس آن برای او نزد پروردگارش بهتر است.» (وَمَن يُعَظِّمْ حُرُمَاتِ اللَّهِ فَهُوَ خَيْرٌ لَّهُ عِندَ رَبِّهِ)\n\nآن کس که حرمت حق را بزرگ دارد *** جز حق (الله) هیچ عینی را نمی‌بیند\nهر آنچه در هستی (الکون) است، حرمت اوست *** و در اعیان (موجودات) جز آن (حرمت) نیست\nبزرگ‌دارنده آن، از روی غفلت (الساهي) نیست *** و نه در حکم، از روی لهو و بازی\nچگونه از محارم (حرمت‌ها) او غافل شود *** کسی که اشیاء را به واسطه حق می‌بیند\nپس اوست که حتی به واسطه همسایه می‌بیند *** و من از آن (دیدن به واسطه حق) غافلم\n\n[همه عالم حرم حق است]\n\nعالم حرم حق (الحق) است و هستی (الکون) حرم اوست که این حرم‌ها را در آن ساکن کرده است. و بزرگترین حرم، آن است که در آن اثر طبع نکاحی (آمیزش) وجود دارد، زیرا آن محل تکوین (ایجاد) است. و همه عالم حرم حق (الله) است، زیرا محل تکوین احکام الهی برای ظهور اعیان است. پس هر عینی که ظاهر شود، خود حرمتی از حرم‌ها می‌شود.\nپس حوا از آدم است، به یکسان از او ظاهر شد، پس او عین آدم است و آدم عین اوست. او حرمت و همسر آدم است که پیامبرش را در او تکوین داد، زیرا او دنده کوتاه آدم بود پیش از شکل معلوم به انسان. و آنچه خداوند از عالم خلق کرد نیز چنین است. و اشاره به این مطلب در قول اوست: «همگی از اوست» (جَمِيعاً مِنْهُ) و قول او درباره عیسی: «و روحی از جانب او» (وَرُوحٌ مِنْهُ). او را به غیر نسبت نداد، زیرا در آنجا غیری نیست.\nپس هر کس حرمت حق (الله) و حرمت عالم را بزرگ دارد، جز نفس خود را بزرگ نداشته است. و برای تو روشن شد که تو از او هستی، نه از ذات خودت از امر دیگری. پس هر کس حرمت حق را بزرگ دارد، در حقیقت حق را بزرگ داشته است. و هر کس حق را بزرگ دارد، برای او بهتر است، و این همان تعظیمی است که حق به او پاداش می‌دهد، مانند قول او: «و هر کس شعائر خدا را بزرگ دارد» (وَمَن يُعَظِّمْ شَعَائِرَ اللَّهِ) و «و هر کس حرمت‌های خدا را بزرگ دارد» (وَمَن يُعَظِّمْ حُرُمَاتِ اللَّهِ). و قول او: «نزد پروردگارش» (عِندَ رَبِّهِ). عامل در این ظرف (قید مکان/زمان) در طریقت ما، قول اوست: «و هر کس بزرگ دارد» (وَمَن يُعَظِّمْ)، یعنی هر کس آن را نزد پروردگارش بزرگ دارد.\nیعنی در آن موطن (مکان/مقام). پس باید در موطن‌هایی که در آن نزد پروردگارت هستی، جستجو کنی که آن موطن‌ها کدامند؛ مانند نماز. زیرا نمازگزار با پروردگارش مناجات می‌کند، پس او نزد پروردگارش است. اگر در این موطن حرمت حق را بزرگ دارد، برای او بهتر است. و بزرگداشت حرمت این است که شخص با آن متلبس شود تا بزرگ گردد. و چون بزرگ شد، تکوین (ایجاد) چنان خواهد بود که آمده است: «پس چون سنگین شد، خدا را خواندند» (فَلَمَّا أَثْقَلَت دَّعَوَا اللَّهَ).\nو مؤمن چون با طهارت بخوابد، روحش نزد پروردگارش است. پس در آنجا حرمت حق را بزرگ می‌دارد. در نتیجه، خیری که در چنین موطنی نصیب او می‌شود، همان بشارت‌هایی است که در خواب برایش حاصل می‌گردد یا دیگری برای او می‌بیند. و موطن‌هایی که بنده در آن نزد پروردگارش است، بسیارند. پس در آن موطن‌ها حرمت‌های حق را بر اساس شهود (الشهود) بزرگ می‌دارد. اگر در این باب سخن را بسط دهیم، طولانی خواهد شد. و این اشاره اندک، به صاحب فهم، با نیروی خود، آنچه را که در بسط (توضیح مفصل) از فواید وجودی (الوجودية) هست، می‌بخشد. و این برای مقصود کافی است. و سپاس خدای را که پروردگار جهانیان است (وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ) و خداوند حق (الْحَقَّ) را می‌گوید و او راه را می‌نمایاند (وَهُوَ يَهْدِي السَّبِيل)."
  },
  "page_count": 2
}