{
  "id": 220,
  "title": {
    "ar": "الباب العشرون ومائتان في معرفة الفناء وأسراره",
    "en": "Chapter Two Hundred and Twenty, Concerning the Gnosis (المعرفة) of Annihilation (الفناء) and its Mysteries.",
    "ur": "باب نمبر دو سو بیس: فنا (الفناء) اور اس کے اسرار کی معرفت (المعرفۃ) میں",
    "fa": "باب دویست و بیستم در معرفت فنا (الفناء) و اسرار آن"
  },
  "content": {
    "ar": "## «الباب العشرون ومائتان في معرفة الفناء وأسراره»\n\n\n> إن الفناء أخو العدم *** وله التسلط إن حكم‏\n\n\n> هو عن كذا لا غيره *** فبعن له فينا قدم‏\n\n\n> ثم الفناء عن الفناء *** حجاب ما ينفي الظلم‏\n\n\n> فشبيهه بل عينه *** ما قيل في عدم العدم‏\n\n\n> هي لفظة ما تحتها *** عين ولكن تحتكم‏\n\n\n> ما زال تطلبه الرجاء *** ل فمن يقوم به عصم فيه إذا سلطانه‏\n\n\nيمضيه تحصين الحكم‏\n\n\n### [ما المراد بالفناء]\n\n\nاعلم أن الفناء عند الطائفة يقال بإزاء أمور فمنهم من قال إن الفناء فناء المعاصي ومن قائل الفناء فناء رؤية العبد فعله بقيام الله على ذلك وقال بعضهم الفناء فناء عن الخلق وهو عندهم على طبقات منها الفناء عن الفناء وأوصله بعضهم إلى سبع طبقات فاعلموا أيدنا الله وإياكم بروح القدس أن الفناء لا يكون إلا عن كذا كما إن البقاء لا يكون إلا بكذا ومع كذا فعن للفناء لا بد منه ولا يكون الفناء في هذا الطريق عند الطائفة إلا عن أدنى بأعلى وأما الفناء عن الأعلى فليس هو اصطلاح القوم وإن كان يصح لغة\n\n\nفأما الطبقة الأولى في الفناء فهي إن تفني عن المخالفات‏\n\n\nفلا تخطر لك ببال عصمة وحفظا إلهيا ورجال الله هنا على قسمين القسم الواحد رجال لم يقدر عليهم المعاصي فلا يتصرفون إلا في مباح وإن ظهرت منهم المخالفات المسماة بالمعاصي شرعا في الأمة إلا إن الله وفق هؤلاء فكانوا ممن أذنبوا فعلموا إن لهم ربا يغفر الذنب ويأخذ بالذنب فقيل لهم على سماع منهم لهذا القول‏\n\n\nاعملوا ما شئتم فقد غفرت لكم‏\n\n\nوكأهل بدر ففنيت عنهم أحكام المخالفات فما خالفوا فإنهم ما تصرفوا إلا فيما أبيح لهم فإن الغيرة الإلهية تمنع أن ينتهك المقربون عنده حرمة الخطاب‏\nالإلهي بالتحجير وهو غير مؤاخذ لهم لما سبقت لهم به العناية في الأزل فأباح لهم ما هو محجور على الغير وسائر من ليس له هذا المقام لا علم له بذلك فيحكم عليه بأنه ارتكب المعاصي وهو ليس بعاص بنص كلام الله المبلغ على لسان رسول الله صلى الله عليه وسلم وكأهل البيت حين أذهب الله عنهم الرجس ولا رجس أرجس من المعاصي وطهرهم تطهيرا وهو خبر والخبر لا يدخله النسخ وخبر الله صدق وقد سبقت به الإرادة الإلهية فكل ما ينسب إلى أهل البيت مما يقدح فيما أخبر الله به عنهم من التطهير وذهاب الرجس فإنما ينسب إليهم من حيث اعتقاد الذي ينسبه لأنه رجس بالنسبة إليه وذلك الفعل عينه ارتفع حكم الرجس عنه في حق أهل البيت فالصورة واحدة فيهما والحكم مختلف والقسم الآخر رجال اطلعوا على سر القدر وتحكمه في الخلائق وعاينوا ما قدر عليهم من جريان الأفعال الصادرة منهم من حيث ما هي أفعال لا من حيث ما هي محكوم عليها بكذا أو كذا وذلك في حضرة النور الخالص الذي منه يقول أهل الكلام أفعال الله كلها حسنة ولا فاعل إلا الله فلا فعل إلا لله وتحت هذه الحضرة حضرتان حضرة السدفة وحضرة الظلمة المحضة وفي حضرة السدفة ظهر التكليف وتقسمت الكلمة إلى كلمات وتميز الخير من الشر وحضرة الظلمة هي حضرة الشر الذي لا خير معه وهو الشرك والفعل الموجب للخلود في النار وعدم الخروج منها وأن نعم فيها فلما عاين هؤلاء الرجال من هذا القسم ما عاينوه من حضرة النور بادروا إلى فعل جميع ما علموا أنه يصدر منهم وفنوا عن الأحكام الموجبة للبعد والقرب ففعلوا الطاعات ووقعوا في المخالفات كل ذلك من غير نية لقرب ولا انتهاك حرمة فهذا فناء غريب أطلعني الله عليه بمدينة فاس ولم أر له ذائقا مع علمي بأن له رجالا ولكن لم ألقهم ولا رأيت أحدا منهم غير أني رأيت حضرة النور وحكم الأمر فيها غير أنه لم يكن لتلك المشاهدة فينا حكم بل أقامني الله في حضرة السدفة وحفظني وعصمني فلي حكم حضرة النور وإقامتي في السدفة وهو عند القوم أتم من الإقامة في حضرة النور فهذا معنى قول بعضهم في الفناء إنه فناء المعاصي‏\n\n\n### «و أما النوع الثاني» من الفناء فهو الفناء عن أفعال العباد بقيام الله على ذلك‏\n\n\nمن قوله أَ فَمَنْ هُوَ قائِمٌ عَلى‏ كُلِّ نَفْسٍ بِما كَسَبَتْ فيرون الفعل لله من خلف حجب الأكوان التي هي محل ظهور الأفعال فيها وهو قوله تعالى إِنَّ رَبَّكَ واسِعُ الْمَغْفِرَةِ أي ستره واسع والأكوان كلها ستره وهو الفاعل من خلف هذا الستر وهُمْ لا يَشْعُرُونَ والمثبتون من المتكلمين أفعال العباد خلقا لله يشعرون ولكن لا يشهدون لحجاب الكسب الذي أعمى الله به بصيرتهم كما أعمى بصيرة من يرى الأفعال للخلق حين أوقفه الله مع ما يشاهده ببصره فهذا لا يشعر وهو المعتزلي وذلك لا يشهد وهو الأشعري فالكل عَلى‏ بَصَرِهِ غِشاوَةً\n\n\n«و أما النوع الثالث» فهو الفناء عن صفات المخلوقين‏\n\n\nبقوله تعالى في الخبر المروي النبوي عنه كنت سمعه وبصره‏\n\n\nوكذا جميع صفاته والسمع والبصر وغير ذلك من أعيان الصفات التي للعبد أو الخلق قل كيف شئت وعرف الحق أن نفسه هي عين صفاتهم لا صفته فأنت من حيث صفاتك عين الحق لا صفته ومن حيث ذاتك عينك الثابتة التي اتخذها الله مظهرا أظهر نفسه فيها لنفسه فإنه ما يراه منك إلا بصرك وهو عين نظرك فما رآه إلا نفسه وأفناك بهذا عن رؤيته فناء حقيقة شهودية معلومة محققة لا يرجع بعد هذا الفناء حالا إلى حال يثبت لك أن لك صفة محققة ليست عين الحق وصاحب هذا الفناء دائما في الدنيا والآخرة لا يتصف في نفسه ولا عند نفسه بشهود ولا كشف ولا رؤية مع كونه يشهد ويكشف ويرى ويزيد صاحب هذا الفناء على كل مشاهد وراء ومكاشف أنه يرى الحق كما يرى نفسه لأنك رأيته به لا بك وهذا مشهد عزيز لم أر له بالحال ذائقا فإنه دقيق فمن زعم أنه ذاقه ثم رجع بعد ذلك إلى حسه ونفسه وأثبت لنفسه صفة ليست هي عين الحق التي علمها فليس عنده خبر بما قاله ولا يعرف من شاهد ولا ما شاهد ثم إن صاحب هذا الفناء مهما فرق بين صفاته في حال الفناء فرأى غير ما سمع وسمع غير ما سعى وسعى غير ما شم وطعم وطعم غير ما علم وعلم غير ما قدر وميز وفرق بين هذه النسب وادعى أنه صاحب هذا النوع من الفناء فليس هو وإذا توحدت عنده العين فسمع بما به رأى بما به تكلم بما به علم وسعى وشم وطعم وأحس ولم يختلف عليه الإدراك باختلاف الحكم فهو صاحب هذا الفناء ذوقا صحيح الحال‏\n\n\n«و أما النوع الرابع» من الفناء فهو الفناء عن ذاتك‏\n\n\nوتحقيق ذلك أن تعلم أن ذاتك مركبة من لطيف وكثيف وأن لكل ذات منك حقيقة وأحوالا تخالف بها الأخرى وأن لطيفتك متنوعة الصور مع‏\nالآنات في كل حال وأن هيكلك ثابت على صورة واحدة وإن اختلفت عليه الأعراض فإذا فنيت عن ذاتك بمشهودك الذي هو شاهد الحق من الحق وغير الحق ولا تغيب في هذه الحال عن شهود ذاتك فيه فما أنت صاحب هذا الفناء فإن لم تشهد ذاتك في هذا الشهود وشاهدت ما شاهدت فأنت صاحب هذا النوع من الفناء وإنما قلنا شاهدت ما شاهدت ولم نخصص شهود الحق وحده فإن صاحب هذا الفناء قد يكون مشهوده كونا من الأكوان وهو حال يعصم ذات الإنسان من التأثر أخبرني الأستاذ النحوي عبد العزيز بن زيدان بمدينة فاس وكان ينكر حال الفناء وكان يختلف إلينا وكانت فيه إنابة فلما كان ذات يوم دخل علي وهو فارح مسرور فقال لي يا سيدي الفناء الذي تذكره الصوفية صحيح عندي بالذوق قد شاهدته اليوم قلت له كيف قال أ لست تعلم أن أمير المؤمنين دخل اليوم من الأندلس إلى هذه المدينة قلت له بلى قال اعلم إني خرجت أتفرج مع أهل فاس فأقبلت العساكر فلما وصل أمير المؤمنين ونظرت إليه فنيت عن نفسي وعن العسكر وعن جميع ما يحسه الإنسان وما سمعت دوي الكوسات ولا صوت طبل مع كثرة ذلك ولا البوقات ولا ضجيج الناس ولا رأيت ببصري أحدا من العالم جملة واحدة سوى شخص أمير المؤمنين ثم إنه ما أزاحني أحد عن مكاني ووقفت في طريق الخيل وازدحام الناس وما رأيت نفسي ولا علمت أني ناظر إليه بل فنيت عن ذاتي وعن الحاضرين كلهم بشهودي فيه ولما انحجب عني ورجعت إلى نفسي أخذتني الخيل وازدحام الناس فازالونى عن موضعي وما تخلصت من الضيق إلا بشدة وأدرك سمعي الضجيج وأصوات الكوسات والبوقات فتحققت إن الفناء حق وأنه حال يعصم ذات الفاني من أن يؤثر فيه ما فنى عنه هذا يا أخي فناء في مخلوق فما ظنك بالفناء في الخالق فإن شاهدت في هذا الفناء تنوع ذاتك اللطيفة ولم تشاهد معها سواها ففناؤك عنك بك لا بسواك فأنت فإن عن ذاتك ولست فانيا عن ذاتك فإنك لك بك مشهود من حيث لطيفتك وإنك لك بك مفقود من حيث هيكلك فإن شاهدت مركبك في حال هذا الفناء فمشهودك خيال ومثال ما هو عينك ولا غيرك بل حالك في هذا الفناء حال النائم صاحب الرؤيا\n\n\n«و أما النوع الخامس من الفناء» وهو فناؤك عن كل العالم بشهودك الحق أو ذاتك‏\n\n\nفإن تحققت من تشهد منك علمت أنك شاهدت ما شاهدته بعين حق والحق لا يفنى بمشاهدة نفسه ولا العالم فلا تفني في هذه الحال عن العالم وإن لم تعلم من يشهد منك كنت صاحب هذا الحال وفنيت عن رؤية العالم بشهود الحق أو بشهود ذاتك كما فنيت عن ذاتك بشهود الحق أو بشهود كون من الأكوان فهذا النوع يقرب من الرابع في الصورة وإن كان يعطي من الفائدة ما لا يعطيه النوع الرابع المتقدم‏\n\n\n«و أما النوع السادس من الفناء» فهو إن تفني عن كل ما سوى الله بالله‏\n\n\nولا بد وتفني في هذا الفناء عن رؤيتك فلا تعلم أنك في حال شهود حق إذ لا عين لك مشهودة في هذا الحال وهنا يطرأ غلط لبعض الناس من أهل هذا الشأن وأبينه لك إن شاء الله حتى يتخلص لك المقام وإن الله ألهمني لهذا البيان وذلك أن صاحب هذا الحال إذا فنى عن كل ما سوى الله بشهود الله فيما يقول فلا يخلو في شهوده ذلك إما أن يرى الحق في شئونه أو لا يراه في شئونه فإنه لا يزال في شئون إذ لا غيبة له عن العالم ولا عن أثر فيه فإن شاهده في شئونه فما فنى عن كل ما سوى الله وإن شاهده في غير شئونه بل في غناه عن العالم فهو صحيح الدعوى فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ وهذا المشهد كان للصديق فإنه قال ما رأيت شيئا إلا رأيت الله قبله فأثبت أنه رآه ولا شي‏ء ثم أقيم في مشهد آخر فرأى صدور الشي‏ء عنه وقد كان رآه ولا شي‏ء فجعل تلك الرؤية قبل هذا الشهود فقال ما رأيت شيئا إلا رأيت الله قبله فقد أبنت لك الأمر على ما هو عليه‏\n\n\n«و أما النوع السابع من الفناء» فهو الفناء عن صفات الحق ونسبها\n\n\nوذلك لا يكون إلا بشهود ظهور العالم عن الحق لعين هذا الشخص لذات الحق ونفسه لا لأمر زائد يعقل ولكن لا من كونه علة كما يراه بعض النظار ولا يرى الكون معلولا وإنما يراه حقا ظاهرا في عين مظهر بصورة استعداد ذلك المظهر في نفسه فلا يرى للحق أثرا في الكون فما يكون له دليل على ثبوت نسبة ولا صفة ولا نعت فيفنيه هذا الشهود عن الأسماء والصفات والنعوت بل إن حققه يرى أنه محل التأثر حيث أثر فيه استعداد الأعيان الثابتة من أعيان الممكنات ومما يحقق هذا كونه تعالى وصف نفسه في كتابه وعلى ألسنة رسله بما وصف به المخلوقات المحدثات وإما أن تكون هذه الصفات في جنابه حقا ثم نعتنا بها\nوإما أن تكون لنا حقا ونعت نفسه بها توصلا لنا وخبره بها صدق لا كذب وإن كنا نحن فيها الأصل فهو مكتسب وإن كان هو الأصل فقد كسبنا إياها وهذه من أغمض نتائج العلم بالله فإنه أضاف إليه نعوت المحدثات كلها بأخبار قديم أزلي فمنها ما أشار به في أخباره بأنه مكتسب لبعضها مثل قوله ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ ومنها ما ذكره ولم يقيد باكتساب ولا غيره ومن هذا الباب أُجِيبُ دَعْوَةَ الدَّاعِ وادْعُونِي أَسْتَجِبْ لَكُمْ واسئلوني أعطكم واستغفروني أغفر لكم وفَاذْكُرُونِي أَذْكُرْكُمْ وأما قولهم الفناء عن الفناء فما هو نوع ثامن وإنما هو الفاني إذا لم يعلم في فنائه إنه فإن فذلك الفناء عن الفناء كصاحب الرؤيا الذي لا يعلم أنه في رؤيا فهو حال تابع في كل نوع يقوم من أنواع الفناء وحال الفناء لا ينال بتعمل أي لا يقصد وأدناه درجة حكمه في المتفكر فإذا استغرق الإنسان الفكر في أمر ما من أمور الدنيا أو في مسألة من العلم فتحدثه ولا يسمعك وتكون بين يديه ولا يراك وترى في عينه جمودا في تلك الحالة فإذا عثر على مطلوبه أو طرأ أمر يرده إلى إحساسه حينئذ يراك ويسمعك فهذه أدنى درجاته في العالم وسبب ذلك ضيق المحدث فإنه لا شي‏ء أوسع من حقيقة الإنسان ولا شي‏ء أضيق منها فأما اتساع القلب فإنه لا يضيق عن شي‏ء ولكن عن شي‏ء واحد وأما ضيقه فإنه لا يسع خاطرين معا فإنه أحدي الذات فلا يقبل الكثرة فهو من حيث هذه الحقيقة في الحكم الإلهي في معنى قوله فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ وفي الرتبة الأخرى في‏\n\n\nقوله فأحببت إن أعرف‏\n\n\nوهذا القدر كاف في معرفة هذا الباب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "The Two Hundred and Twentieth Chapter: Concerning the Knowledge of Annihilation (الفناء) and its Secrets\n\nIndeed, Annihilation (الفناء) is the brother of Non-existence (العدم),\nAnd it holds dominion when it rules.\n\nIt is *from* such-and-such, and nothing else;\nThus, the preposition 'from' (عن) establishes its precedence in us.\n\nThen, Annihilation from Annihilation (الفناء عن الفناء)\nIs a veil that negates darkness.\n\nIts likeness, nay, its very essence,\nIs what is said concerning the non-existence of non-existence.\n\nIt is a word beneath which there is no essence (عين),\nYet it governs.\n\nHope never ceases to seek it,\nSo whoever stands by it is protected within it when its dominion\nExecutes the fortification of the decree.\n\n### [What is Meant by Annihilation (الفناء)]\n\nKnow that Annihilation (الفناء), according to the Sufi community (الطائفة), is used to denote several matters. Some said that Annihilation is the annihilation of sins (فناء المعاصي). Others said Annihilation is the annihilation of the servant’s perception of his own action, due to the Real’s (الله) standing over that action. Some of them said Annihilation is annihilation from Creation (الخلق), and this, according to them, is divided into levels (طبقات), among which is Annihilation from Annihilation (الفناء عن الفناء). Some have extended these levels to seven.\n\nKnow—may Allah support us and you with the Holy Spirit—that Annihilation (الفناء) only occurs *from* such-and-such, just as Subsistence (البقاء) only occurs *by* such-and-such and *with* such-and-such. Thus, the preposition 'from' (عن) is indispensable for Annihilation. Annihilation in this Path, according to the community, only occurs *from* a lower thing *by* a higher thing. As for Annihilation from the higher thing, this is not the technical usage (اصطلاح) of the People, even though it is linguistically valid.\n\nThe first level (طبقة) of Annihilation is that you are annihilated from transgressions (المخالفات), so that they do not even cross your mind, due to divine protection (عصمة) and preservation. The Men of Allah (رجال الله) here are of two types.\n\nThe first type consists of men whom sins have no power over; they only act within what is permissible (مباح). Even if transgressions, which are legally termed sins (المعاصي) in the community, appear from them, Allah has granted these individuals success, so they were among those who sinned but knew that they have a Lord who forgives sin and holds accountable for sin. It was said to them, upon their hearing this statement: <<اعملوا ما شئتم فقد غفرت لكم>> (Do what you will, for I have forgiven you).\n\nThey are like the People of Badr, from whom the rulings of transgressions were annihilated (فنيت). They did not transgress, for they only acted in what was permitted to them. Divine jealousy (الغيرة الإلهية) prevents those who are close to Him from violating the sanctity of the Divine address by restriction (التحجير). He does not hold them accountable because of the Pre-eternal Care (العناية) that preceded for them in the pre-eternity (الأزل). Thus, He permitted them what is restricted (محجور) for others. All others who do not possess this station (مقام) have no knowledge of this, so they judge him as having committed sins, while he is not a sinner, based on the text of Allah’s word conveyed by the tongue of the Messenger of Allah (peace and blessings be upon him).\n\nThey are like the People of the House (أهل البيت) when Allah removed all defilement (الرجس) from them—and there is no defilement more defiling than sins—and purified them with a thorough purification. This is a statement (خبر), and a statement is not subject to abrogation (النسخ). The statement of Allah is truth (صدق), and the Divine Will (الإرادة الإلهية) preceded it. Therefore, anything attributed to the People of the House that impugns what Allah stated about their purification and the removal of defilement is only attributed to them based on the belief of the one who attributes it, because it is defilement (رجس) relative to him. Yet, the ruling of defilement concerning that very action is lifted in the case of the People of the House. The form (الصورة) is the same in both cases, but the ruling (الحكم) is different.\n\nThe second type consists of men who have been informed of the secret of Destiny (القدر) and its governance over creatures (الخلائق). They witnessed what was decreed upon them regarding the flow of actions emanating from them, viewing them as actions *per se*, not as actions judged as such-and-such. This occurs in the Presence of Pure Light (حضرة النور الخالص), from which the theologians (أهل الكلام) say: \"All of Allah’s acts are good, and there is no actor but Allah, so there is no action except for Allah.\"\n\nBeneath this Presence are two other Presences: the Presence of Twilight (حضرة السدفة) and the Presence of Pure Darkness (حضرة الظلمة المحضة). In the Presence of Twilight, the religious obligation (التكليف) appeared, the Word (الكلمة) was divided into words, and good was distinguished from evil. The Presence of Darkness is the Presence of evil with which there is no good, which is polytheism (الشرك) and the action that necessitates eternal dwelling in the Fire and the impossibility of exiting it, even if one enjoys it therein.\n\nWhen these men of the second type witnessed what they witnessed from the Presence of Light, they hastened to perform all that they knew would emanate from them, and they were annihilated (فنوا) from the rulings that necessitate distance or proximity. Thus, they performed acts of obedience and fell into transgressions, all without the intention of seeking proximity or violating sanctity. This is a strange Annihilation (فناء غريب) that Allah revealed to me in the city of Fez. I have not seen anyone who tasted it, though I know that it has its men, but I have not met them nor seen any of them. However, I did see the Presence of Light and the ruling of the Command therein. Yet, that witnessing had no ruling over me; rather, Allah established me in the Presence of Twilight (حضرة السدفة) and preserved and protected me. Thus, I have the ruling of the Presence of Light, while my establishment is in the Twilight, which, according to the People, is more complete than establishment in the Presence of Light. This is the meaning of the saying of some of them regarding Annihilation: that it is the annihilation of sins (فناء المعاصي).\n\n### «As for the second type» of Annihilation, it is Annihilation from the actions of the servants due to the Real’s (الله) standing over that,\n\nbased on His saying: <<أَ فَمَنْ هُوَ قائِمٌ عَلى‏ كُلِّ نَفْسٍ بِما كَسَبَتْ>> (Is He then Who stands over every soul with what it has earned?). They see the action belonging to Allah from behind the veils of the existents (الأكوان), which are the locus where actions appear. This is His saying, the Exalted: <<إِنَّ رَبَّكَ واسِعُ الْمَغْفِرَةِ>> (Indeed, your Lord is vast in forgiveness), meaning His veil (ستره) is vast, and all existents are His veil, and He is the Actor from behind this veil, <<وَهُمْ لا يَشْعُرُونَ>> (and they do not perceive).\n\nThose theologians (المتكلمين) who affirm the actions of the servants as creation belonging to Allah *do* perceive (يشعرون), but they do not witness (يشهدون), due to the veil of acquisition (الكسب) by which Allah has blinded their inner sight (بصيرتهم). Likewise, He blinded the inner sight of those who see actions belonging to creation (الخلق) when He made them stand with what they observe with their physical sight. The latter does not perceive—and this is the Mu’tazili—and the former does not witness—and this is the Ash’ari. Thus, all of them have <<عَلى‏ بَصَرِهِ غِشاوَةً>> (a covering over their sight).\n\n### «As for the third type,» it is Annihilation from the attributes (صفات) of the created beings,\n\nbased on the Prophetic tradition (الخبر المروي النبوي) narrated from Him: \"I was his hearing and his sight.\" And likewise, all his attributes—hearing, sight, and other Fixed Entities (أعيان) of the attributes belonging to the servant or creation, say what you will—and know that the Essence (نفسه) of the Real (الحق) is the very essence (عين) of their attributes, not His Attribute. Thus, you, in terms of your attributes, are the very essence of the Real, not His Attribute. And in terms of your Essence (ذاتك), you are your Fixed Entity (عينك الثابتة) that Allah took as a manifestation (مظهرا) in which He disclosed Himself to Himself. For He only sees you through your sight, and that is the very essence of your gaze. Thus, He saw nothing but Himself, and by this, He annihilated you from seeing Him—an Annihilation of known, verified, witnessed Reality (فناء حقيقة شهودية معلومة محققة).\n\nAfter this Annihilation, one does not return to a state that establishes for you a verified attribute that is not the very essence of the Real (الحق). The possessor of this Annihilation is perpetually, in this world and the Hereafter, not described by himself or to himself as having witnessing (شهود), unveiling (كشف), or vision (رؤية), despite the fact that he witnesses, unveils, and sees. The possessor of this Annihilation surpasses every witnesser, seer, and unveiler in that he sees the Real (الحق) just as he sees himself, because you saw Him *by* Him, not *by* yourself. This is a rare station (مشهد عزيز). I have not seen anyone who has tasted this state (حال), for it is subtle. Whoever claims that he tasted it and then returned to his senses and his self, and established for himself an attribute that is not the very essence of the Real (الحق) which he knew, then he has no knowledge of what he claimed, nor does he know what witnessing is or what he witnessed.\n\nFurthermore, if the possessor of this Annihilation differentiates between his attributes during the state of Annihilation—so he sees something other than what he hears, and hears something other than what he strives for, and strives for something other than what he smells and tastes, and tastes something other than what he knows, and knows something other than what he determines and distinguishes—and he differentiates between these relations and claims to be the possessor of this type of Annihilation, then he is not. But if the Essence (العين) becomes unified for him, so he hears by that by which he sees, by which he speaks, by which he knows, strives, smells, tastes, and perceives, and the perception (الإدراك) does not differ for him due to the difference in the ruling (الحكم), then he is the possessor of this Annihilation, with a sound tasting (ذوقا صحيح الحال) of the state.\n\n### «As for the fourth type» of Annihilation, it is Annihilation from your Essence (ذاتك).\n\nThe verification of this is that you know that your Essence (ذاتك) is composed of the subtle (لطيف) and the dense (كثيف), and that every essence (ذات) of yours has a reality (حقيقة) and states (أحوال) by which it differs from the other, and that your subtle aspect (لطيفتك) is varied in forms (الصور) with the moments (الآنات) in every state, while your physical structure (هيكلك) remains fixed in one form, even if accidents (الأعراض) vary upon it.\n\nIf you are annihilated from your Essence (ذاتك) by your witnessed object (مشهودك), which is the witness of the Real (شاهد الحق) from the Real and from other than the Real, and you do not become absent in this state from witnessing your Essence within it, then you are not the possessor of this Annihilation. But if you do not witness your Essence (ذاتك) in this witnessing, and you witness what you witness, then you are the possessor of this type of Annihilation. We said \"you witness what you witness\" and did not specify the witnessing of the Real alone, because the witnessed object of the possessor of this Annihilation may be an existent (كون) among the existents.\n\nThis is a state (حال) that protects the essence of the human from being affected. The grammarian master, Abdul Aziz ibn Zaydan, informed me in the city of Fez—and he used to deny the state of Annihilation (حال الفناء) and frequented us, and he had repentance (إنابة)—that one day he came to me joyful and happy and said: \"O my master, the Annihilation that the Sufis mention is verified for me by tasting (بالذوق); I witnessed it today.\" I asked him, \"How?\" He said, \"Do you not know that the Commander of the Faithful entered this city from Andalusia today?\" I said, \"Yes.\" He said, \"Know that I went out to watch with the people of Fez. The armies approached. When the Commander of the Faithful arrived and I looked at him, I was annihilated from myself, from the army, and from everything that a human senses. I did not hear the roar of the kettledrums, nor the sound of the drum, despite their abundance, nor the trumpets, nor the clamor of the people. I did not see with my sight anyone from the world at all, except the person of the Commander of the Faithful.\n\n\"Furthermore, no one moved me from my place, and I stood in the path of the horses and the crowd of people, yet I did not see myself, nor did I know that I was looking at him. Rather, I was annihilated from my Essence (ذاتي) and from all those present by my witnessing *in* him. When he was veiled from me and I returned to myself, the horses and the crowd of people seized me and moved me from my spot. I only escaped the congestion with difficulty, and my hearing perceived the clamor and the sounds of the kettledrums and trumpets. Thus, I verified that Annihilation (الفناء) is real and that it is a state that protects the essence (ذات) of the annihilated one from being affected by that from which he was annihilated.\"\n\n\"This, my brother, is Annihilation in a created being (مخلوق); what then do you think of Annihilation in the Creator (الخالق)?\"\n\nIf, in this Annihilation, you witness the variation of your subtle essence (ذاتك اللطيفة) and do not witness anything besides it, then your Annihilation is from yourself *by* yourself, not by anything else. Thus, you are annihilated *from* your Essence (ذاتك) and yet you are not annihilated *from* your Essence, for you are witnessed *by* yourself in terms of your subtle aspect, and you are lost *by* yourself in terms of your physical structure (هيكلك). If you witness your composite nature (مركبك) in the state of this Annihilation, then your witnessed object (مشهودك) is imagination (خيال) and similitude (مثال); it is neither your very essence (عينك) nor other than you. Rather, your state in this Annihilation is the state of a sleeper having a dream (الرؤيا).\n\n### «As for the fifth type of Annihilation,» it is your Annihilation from the entire World (العالم) by your witnessing the Real (الحق) or your Essence (ذاتك).\n\nIf you verify who witnesses from you, you will know that you witnessed what you witnessed by the very essence of the Real (عين حق). The Real is not annihilated by witnessing Himself, nor is the World. Therefore, in this state, you are not annihilated from the World. But if you do not know who witnesses from you, you are the possessor of this state, and you are annihilated from seeing the World by witnessing the Real, or by witnessing your Essence (ذاتك), just as you were annihilated from your Essence by witnessing the Real or by witnessing an existent among the existents. This type is close to the fourth in form, even though it yields a benefit that the preceding fourth type does not yield.\n\n### «As for the sixth type of Annihilation,» it is that you are annihilated from everything other than Allah *by* Allah—this is necessary—\n\nand in this Annihilation, you are annihilated from your own vision (رؤيتك), so you do not know that you are in a state of witnessing the Real (شهود حق), since you have no witnessed essence (عين مشهودة) in this state. Here, an error occurs for some people of this Path, which I shall clarify for you, God willing, so that the station (المقام) becomes clear to you, and because Allah inspired me with this clarification.\n\nThis is because the possessor of this state, when he is annihilated from everything other than Allah by witnessing Allah, as he claims, his witnessing must either be that he sees the Real in His affairs (شئونه) or he does not see Him in His affairs. For He is never absent from affairs, since He is not absent from the World nor from an effect within it. If he witnesses Him in His affairs, then he is not annihilated from everything other than Allah. But if he witnesses Him outside of His affairs, rather in His independence from the World, then his claim is sound: <<فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ>> (Indeed, Allah is Independent of the Worlds).\n\nThis station (مشهد) belonged to the Veracious One (الصديق), for he said: \"I did not see a thing except that I saw Allah before it.\" He thus affirmed that he saw Him and there was no thing. Then he was established in another station where he saw the emanation of the thing from Him, having previously seen Him when there was no thing. So he made that vision precede this witnessing, saying: \"I did not see a thing except that I saw Allah before it.\" I have thus clarified the matter for you as it truly is.\n\n### «As for the seventh type of Annihilation,» it is Annihilation from the Attributes (صفات) of the Real (الحق) and their relations (نسبها).\n\nThis only occurs by witnessing the manifestation of the World (العالم) from the Real (الحق) to the very essence (عين) of this person, for the Essence (ذات) of the Real and His Self (نفسه), not for an added intelligible matter. However, this is not seen as Him being a cause (علة), as some speculative thinkers (النظار) see it, nor is the existent (الكون) seen as an effect (معلول). Rather, he sees it as the Real (حق) manifesting in the very essence of a locus of manifestation (مظهر) in the form of that locus’s own preparedness (استعداد).\n\nThus, he sees no trace (أثرا) of the Real in the existent (الكون), so he has no proof for the affirmation of a relation, an attribute (صفة), or a description (نعت). This witnessing annihilates him from the Names (الأسماء), Attributes, and Descriptions. Indeed, if he verifies it, he sees that he is the locus of being affected, since the preparedness (استعداد) of the Fixed Entities (الأعيان الثابتة) of the possible existents affected him.\n\nWhat verifies this is that the Exalted described Himself in His Book and upon the tongues of His Messengers with what He described the created, originated beings (المخلوقات المحدثات). Either these attributes are truly in His Majesty (جنابه) and then He described us with them, or they are truly ours and He described Himself with them as a means of access to us, and His statement concerning them is truth, not falsehood. If we are the origin in them, then He acquired them (مكتسب). If He is the origin, then we acquired them from Him. This is one of the most obscure results of the Knowledge of Allah. For He ascribed to Himself all the descriptions of the originated beings (المحدثات) through an ancient, pre-eternal statement (أخبار قديم أزلي). Some of these He indicated in His statements that He acquires them, such as His saying: <<وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ>> (And We will surely test you until We know). And some He mentioned without restricting them by acquisition or otherwise. From this category is: <<أُجِيبُ دَعْوَةَ الدَّاعِ>> (I answer the call of the caller), and <<وَادْعُونِي أَسْتَجِبْ لَكُمْ>> (Call upon Me; I will respond to you), and \"Ask Me, I will give you,\" and \"Seek My forgiveness, I will forgive you,\" and <<فَاذْكُرُونِي أَذْكُرْكُمْ>> (So remember Me; I will remember you).\n\nAs for their saying, Annihilation from Annihilation (الفناء عن الفناء), it is not an eighth type. Rather, it is when the annihilated one (الفاني) does not know, in his Annihilation, that he is annihilated. This is a dependent state (حال تابع) in every type of Annihilation that arises.\n\nThe state of Annihilation (حال الفناء) is not attained by striving (بتعمل)—meaning, it cannot be intended. Its lowest degree of ruling is found in the contemplative person (المتفكر). If a person is absorbed in contemplation (الفكر) concerning a worldly matter or a scholarly issue, you speak to him and he does not hear you, and you stand before him and he does not see you, and you see a stillness in his eye in that state. When he stumbles upon his objective or an event occurs that returns him to his senses, only then does he see you and hear you. This is its lowest degree in the world.\n\nThe reason for this is the narrowness of the originated being (المحدث). For nothing is vaster than the Reality of the Human (حقيقة الإنسان), and nothing is narrower than it. As for the vastness of the heart (القلب), it is not constrained by anything, except by one thing. As for its narrowness, it cannot contain two thoughts (خاطرين) simultaneously, for it is singular in Essence (أحدي الذات) and does not accept multiplicity (الكثرة). Thus, in terms of this Reality, it is, in the Divine Decree (الحكم الإلهي), in the meaning of His saying: <<فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ>> (Indeed, Allah is Independent of the Worlds). And in the other rank, it is in His saying: \"I loved to be known.\"\n\nThis much is sufficient for the knowledge of this chapter. <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو بیس: الفناء (فنا) اور اس کے اسرار کی المعرفۃ (معرفت) میں\n\nبے شک الفناء (فنا) عدم کا بھائی ہے،\nاور جب وہ حکم کرتا ہے تو اسی کا تسلط ہوتا ہے۔\n\nوہ (فنا) صرف 'عن کذا' (کسی چیز سے) ہوتا ہے،\nپس 'عن' (سے) کے ذریعے وہ ہم میں قدم رکھتا ہے۔\n\nپھر الفناء عن الفناء (فنا سے فنا) ایک ایسا حجاب ہے\nجو ظلمت کو دور کرتا ہے۔\n\nپس اس کا مشابہ، بلکہ عین وہی ہے،\nجو عدم العدم (عدم کی نفی) کے بارے میں کہا گیا ہے۔\n\nیہ ایک ایسا لفظ ہے جس کے نیچے کوئی عین (حقیقت) نہیں،\nلیکن وہ حکم کرتا ہے۔\n\nامید ہمیشہ اس کی طلبگار رہتی ہے،\nپس جو اس پر قائم ہو جائے وہ محفوظ ہو گیا۔\nاس کا تسلط اسے حکم کی مضبوطی سے نافذ کرتا ہے۔\n\n### [الفناء (فنا) سے کیا مراد ہے]\n\nجان لو کہ الفناء (فنا) صوفیاء کے نزدیک کئی امور کے لیے استعمال ہوتا ہے۔ ان میں سے بعض نے کہا کہ الفناء (فنا) گناہوں کا فنا ہو جانا ہے۔ اور بعض نے کہا کہ الفناء (فنا) بندے کا اپنے فعل کو دیکھنا فنا ہو جانا ہے، کیونکہ اللہ تعالیٰ اس پر قائم ہے۔ اور بعض نے کہا کہ الفناء (فنا) مخلوق سے فنا ہو جانا ہے، اور یہ ان کے نزدیک کئی طبقات پر ہے، جن میں سے ایک الفناء عن الفناء (فنا سے فنا) ہے۔ بعض نے اسے سات طبقات تک پہنچایا ہے۔ پس جان لو، اللہ تعالیٰ روح القدس کے ذریعے ہماری اور تمہاری مدد فرمائے، کہ الفناء (فنا) صرف 'عن کذا' (کسی چیز سے) ہی ہوتا ہے، جیسا کہ البقاء (بقا) صرف 'بکذا' (کسی چیز کے ساتھ) اور 'مع کذا' (کسی چیز کے ساتھ) ہوتا ہے۔ پس الفناء (فنا) کے لیے 'عن' (سے) کا ہونا ضروری ہے۔ اور اس طریق میں صوفیاء کے نزدیک الفناء (فنا) صرف ادنیٰ کا اعلیٰ کے ذریعے فنا ہونا ہوتا ہے۔ البتہ اعلیٰ سے فنا ہونا قوم کی اصطلاح نہیں ہے، اگرچہ لغوی طور پر یہ صحیح ہے۔\n\nالفناء (فنا) کا پہلا طبقہ یہ ہے کہ تم مخالفتوں سے فنا ہو جاؤ، چنانچہ وہ تمہارے دل میں بھی نہ آئیں، یہ اللہ کی طرف سے عصمت اور حفاظت ہے۔ اور اللہ کے بندے یہاں دو قسموں پر ہیں۔ پہلی قسم وہ لوگ ہیں جن پر گناہ مسلط نہیں ہو سکتے، چنانچہ وہ صرف مباح میں ہی تصرف کرتے ہیں، اگرچہ امت میں شرعاً ان سے وہ مخالفتیں ظاہر ہوں جنہیں گناہ کہا جاتا ہے۔ مگر اللہ نے ان لوگوں کو توفیق دی، چنانچہ وہ ان لوگوں میں سے تھے جنہوں نے گناہ کیا، پھر جان لیا کہ ان کا ایک رب ہے جو گناہ بخشتا ہے اور گناہ پر پکڑتا بھی ہے۔ پس ان سے یہ قول سن کر کہا گیا: \"جو چاہو کرو، میں نے تمہیں بخش دیا ہے۔\" جیسے اہل بدر۔ پس ان سے مخالفتوں کے احکام فنا ہو گئے، چنانچہ انہوں نے مخالفت نہیں کی، کیونکہ انہوں نے صرف اسی میں تصرف کیا جو ان کے لیے مباح کر دیا گیا تھا۔ کیونکہ غیرت الٰہی اس بات سے روکتی ہے کہ اس کے مقربین تحجیر (ممانعت) کے ذریعے خطاب الٰہی کی حرمت کو پامال کریں۔ اور ان پر کوئی مؤاخذہ نہیں ہے، کیونکہ ازل میں ان کے لیے عنایت سبقت لے چکی تھی۔ پس اللہ نے ان کے لیے وہ چیزیں مباح کر دیں جو دوسروں پر ممنوع ہیں۔ اور باقی لوگ جنہیں یہ مقام حاصل نہیں، وہ اس کا علم نہیں رکھتے، چنانچہ وہ ان پر گناہ کرنے کا حکم لگاتے ہیں، حالانکہ وہ اللہ کے کلام کی نص کے مطابق گناہ گار نہیں ہیں جو رسول اللہ صلی اللہ علیہ وسلم کی زبان پر پہنچایا گیا۔ اور جیسے اہل بیت، جب اللہ نے ان سے رجس (ناپاکی) کو دور کر دیا، اور گناہوں سے بڑھ کر کوئی رجس ناپاک نہیں ہے، اور انہیں خوب پاک کر دیا۔ اور یہ ایک خبر ہے، اور خبر میں نسخ داخل نہیں ہوتا، اور اللہ کی خبر سچی ہے۔ اور ارادہ الٰہی اس کے ساتھ سبقت لے چکا ہے۔ پس اہل بیت کی طرف جو کچھ بھی منسوب کیا جاتا ہے جو اللہ کی خبر (تطہیر اور رجس کے دور ہونے) میں قدح کرتا ہے، وہ صرف اس شخص کے اعتقاد کی رو سے منسوب کیا جاتا ہے جو اسے منسوب کرتا ہے، کیونکہ وہ اس کے لیے رجس ہے۔ جبکہ وہی فعل اہل بیت کے حق میں رجس کے حکم سے بلند ہو چکا ہے۔ پس صورت دونوں میں ایک ہے اور حکم مختلف ہے۔\n\nاور دوسری قسم وہ لوگ ہیں جنہوں نے سرِ قدر اور مخلوقات میں اس کے تسلط پر اطلاع پائی، اور انہوں نے ان افعال کے جاری ہونے کا مشاہدہ کیا جو ان سے صادر ہوتے ہیں، اس حیثیت سے کہ وہ افعال ہیں، نہ اس حیثیت سے کہ ان پر کسی خاص چیز کا حکم لگایا گیا ہے۔ اور یہ خالص نور کی حضرہ میں ہوتا ہے، جہاں سے اہل کلام کہتے ہیں کہ اللہ کے تمام افعال اچھے ہیں، اور اللہ کے سوا کوئی فاعل نہیں، پس اللہ کے سوا کوئی فعل نہیں۔ اور اس حضرہ کے نیچے دو حضریں ہیں: حضرۃ السدفۃ (نیم تاریکی کی حضرہ) اور حضرۃ الظلمۃ المحضۃ (خالص تاریکی کی حضرہ)۔ اور حضرۃ السدفۃ میں تکلیف (شرعی ذمہ داری) ظاہر ہوئی، اور کلمہ کلمات میں تقسیم ہوا، اور خیر و شر میں تمیز ہوئی۔ اور حضرۃ الظلمۃ وہ شر کی حضرہ ہے جس میں کوئی خیر نہیں، اور وہ شرک ہے اور وہ فعل ہے جو جہنم میں ہمیشہ رہنے اور اس سے نہ نکلنے کا موجب ہے، اگرچہ وہ اس میں نعمتوں میں ہوں۔ پس جب اس قسم کے لوگوں نے حضرۃ النور سے وہ مشاہدہ کیا جو انہوں نے کیا، تو انہوں نے ان تمام افعال کو کرنے میں جلدی کی جن کے بارے میں وہ جانتے تھے کہ وہ ان سے صادر ہوں گے، اور وہ قرب و بعد کے موجب احکام سے فنا ہو گئے۔ چنانچہ انہوں نے طاعات بھی کیں اور مخالفتوں میں بھی پڑے، یہ سب کچھ نہ قرب کی نیت سے تھا اور نہ ہی حرمت کی پامالی کے ارادے سے۔ پس یہ ایک عجیب الفناء (فنا) ہے جس پر اللہ نے مجھے فاس شہر میں مطلع کیا، اور میں نے اس کا کوئی ذائقہ چکھنے والا نہیں دیکھا، اگرچہ میں جانتا ہوں کہ اس کے لوگ موجود ہیں، لیکن میں ان سے نہیں ملا اور نہ ہی ان میں سے کسی کو دیکھا۔ البتہ میں نے حضرۃ النور اور اس میں امر کے حکم کو دیکھا۔ مگر اس مشاہدے کا ہم پر کوئی حکم نہیں تھا، بلکہ اللہ نے مجھے حضرۃ السدفۃ میں قائم رکھا اور میری حفاظت اور عصمت فرمائی۔ پس میرے لیے حضرۃ النور کا حکم ہے اور حضرۃ السدفۃ میں میرا قیام ہے، اور یہ قوم کے نزدیک حضرۃ النور میں قیام سے زیادہ کامل ہے۔ پس یہ بعض لوگوں کے اس قول کا معنی ہے کہ الفناء (فنا) گناہوں کا فنا ہو جانا ہے۔\n\n### \"اور الفناء (فنا) کی دوسری قسم\" بندوں کے افعال سے فنا ہو جانا ہے، اس پر اللہ کا قیام ہونے کی وجہ سے\n\nجیسا کہ اس کے قول میں ہے: \"أَ فَمَنْ هُوَ قائِمٌ عَلى‏ كُلِّ نَفْسٍ بِما كَسَبَتْ\" (تو کیا وہ جو ہر جان پر اس کے کیے ہوئے کے ساتھ قائم ہے؟)۔ پس وہ افعال کو اللہ کے لیے دیکھتے ہیں، ان اکوان (کائناتوں) کے حجابات کے پیچھے سے جو افعال کے ظاہر ہونے کا مقام ہیں، اور یہی اللہ تعالیٰ کا قول ہے: \"إِنَّ رَبَّكَ واسِعُ الْمَغْفِرَةِ\" (بے شک تمہارا رب وسیع مغفرت والا ہے) یعنی اس کا پردہ وسیع ہے، اور تمام اکوان (کائناتیں) اس کا پردہ ہیں، اور وہ اس پردے کے پیچھے سے فاعل ہے، \"وَهُمْ لَا يَشْعُرُونَ\" (اور وہ نہیں جانتے)۔ اور متکلمین میں سے وہ لوگ جو بندوں کے افعال کو اللہ کی تخلیق ثابت کرتے ہیں، وہ شعور رکھتے ہیں لیکن الشہود (شہود) نہیں کرتے، اس کسب کے حجاب کی وجہ سے جس سے اللہ نے ان کی بصیرت کو اندھا کر دیا، جیسا کہ اس شخص کی بصیرت کو اندھا کر دیا جو افعال کو مخلوق کے لیے دیکھتا ہے جب اللہ نے اسے اس کے بصری مشاہدے کے ساتھ کھڑا کر دیا۔ پس یہ (معتزلی) شعور نہیں رکھتا، اور وہ (اشعری) الشہود (شہود) نہیں کرتا۔ پس سب \"عَلَى بَصَرِهِ غِشَاوَةٌ\" (ان کی آنکھوں پر پردہ ہے)۔\n\n### \"اور الفناء (فنا) کی تیسری قسم\" مخلوق کی صفات سے فنا ہو جانا ہے\n\nجیسا کہ اس کے بارے میں مروی نبوی خبر میں اللہ تعالیٰ کا قول ہے: \"میں اس کا کان اور اس کی آنکھ بن جاتا ہوں\"۔ اور اسی طرح اس کی تمام صفات، اور سماعت، بصارت اور دیگر صفات جو بندے یا مخلوق کے لیے ہیں، تم جیسے چاہو کہو۔ اور الحق (ذات حق) نے جان لیا کہ اس کی ذات ان کی صفات کا عین ہے نہ کہ اس کی صفت۔ پس تم اپنی صفات کے لحاظ سے الحق (ذات حق) کا عین ہو نہ کہ اس کی صفت، اور اپنی ذات کے لحاظ سے تم تمہاری ثابت عین ہو جسے اللہ نے مظہر بنایا اور اس میں اپنے آپ کو اپنے لیے ظاہر کیا۔ کیونکہ وہ تمہیں تمہاری آنکھ کے سوا نہیں دیکھتا، اور وہ تمہاری نظر کا عین ہے۔ پس اس نے اپنے آپ کے سوا کسی کو نہیں دیکھا، اور اس نے تمہیں اس کے ذریعے تمہاری رؤیت سے فنا کر دیا، یہ ایک معلوم، محقق الشہود (شہود) کی حقیقت کا الفناء (فنا) ہے۔ اس الفناء (فنا) کے بعد وہ حال سے ایسے حال کی طرف واپس نہیں آتا جو تمہارے لیے یہ ثابت کرے کہ تمہاری کوئی محقق صفت ہے جو الحق (ذات حق) کا عین نہیں ہے۔ اور اس الفناء (فنا) کا مالک ہمیشہ دنیا اور آخرت میں اپنی ذات میں اور اپنے نزدیک الشہود (شہود)، الکشف (کشف) یا رؤیت سے متصف نہیں ہوتا، باوجود اس کے کہ وہ الشہود (شہود) کرتا ہے، الکشف (کشف) کرتا ہے اور دیکھتا ہے۔ اور اس الفناء (فنا) کا مالک ہر مشاہدہ کرنے والے، دیکھنے والے اور مکاشف پر اس بات میں بڑھ جاتا ہے کہ وہ الحق (ذات حق) کو ایسے دیکھتا ہے جیسے اپنے آپ کو دیکھتا ہے، کیونکہ تم نے اسے اس (حق) کے ذریعے دیکھا ہے نہ کہ اپنے ذریعے سے۔ اور یہ ایک عزیز مشہد ہے، میں نے حال کے اعتبار سے اس کا کوئی ذائقہ چکھنے والا نہیں دیکھا، کیونکہ یہ دقیق ہے۔ پس جس نے یہ دعویٰ کیا کہ اس نے اسے چکھا، پھر اس کے بعد اپنے حس اور نفس کی طرف لوٹ آیا اور اپنے لیے ایسی صفت ثابت کی جو الحق (ذات حق) کا عین نہیں ہے جسے اس نے جانا تھا، تو اسے اپنے کہے کی کوئی خبر نہیں، اور نہ وہ جانتا ہے کہ کس نے الشہود (شہود) کیا اور نہ کیا الشہود (شہود) کیا۔ پھر اس الفناء (فنا) کا مالک جب بھی الفناء (فنا) کی حالت میں اپنی صفات کے درمیان فرق کرے، اور وہ دیکھے جو اس نے سنا نہیں، اور سنے جو اس نے کوشش نہیں کی، اور کوشش کرے جو اس نے سونگھا اور چکھا نہیں، اور چکھے جو اس نے جانا نہیں، اور جانے جو اس نے اندازہ اور تمیز نہیں کیا، اور ان نسبتوں میں فرق کرے اور دعویٰ کرے کہ وہ اس قسم کے الفناء (فنا) کا مالک ہے، تو وہ ایسا نہیں ہے۔ اور جب اس کے نزدیک عین (حقیقت) واحد ہو جائے، تو وہ اسی سے سنے جس سے اس نے دیکھا، جس سے اس نے کلام کیا، جس سے اس نے جانا، کوشش کی، سونگھا، چکھا اور محسوس کیا، اور حکم کے اختلاف سے اس پر ادراک مختلف نہ ہو، تو وہ صحیح الحال ذوق کے ساتھ اس الفناء (فنا) کا مالک ہے۔\n\n### \"اور الفناء (فنا) کی چوتھی قسم\" تمہاری ذات سے فنا ہو جانا ہے\n\nاور اس کی تحقیق یہ ہے کہ تم جان لو کہ تمہاری ذات لطیف اور کثیف سے مرکب ہے، اور تمہاری ہر ذات کی ایک حقیقت اور احوال ہیں جو دوسری سے مختلف ہیں۔ اور تمہاری لطیفہ ہر حال میں آنات (لمحات) کے ساتھ مختلف صورتوں میں متنوع ہوتی ہے، اور تمہارا ڈھانچہ ایک ہی صورت پر ثابت رہتا ہے اگرچہ اس پر عوارض مختلف ہوں۔ پس اگر تم اپنی ذات سے فنا ہو جاؤ اپنے مشہود کے ذریعے جو الحق (ذات حق) کی طرف سے اور غیر الحق (غیر ذات حق) کی طرف سے شاہد ہے، اور تم اس حال میں اپنی ذات کے الشہود (شہود) سے غائب نہ ہو، تو تم اس الفناء (فنا) کے مالک نہیں ہو۔ لیکن اگر تم اس الشہود (شہود) میں اپنی ذات کا الشہود (شہود) نہ کرو اور جو کچھ مشاہدہ کیا اسے مشاہدہ کرو، تو تم اس قسم کے الفناء (فنا) کے مالک ہو۔ اور ہم نے یہ اس لیے کہا کہ \"جو کچھ مشاہدہ کیا اسے مشاہدہ کرو\" اور صرف الحق (ذات حق) کے الشہود (شہود) کو خاص نہیں کیا، کیونکہ اس الفناء (فنا) کا مالک کبھی اکوان (کائناتوں) میں سے کسی کون (کائنات) کا مشہود کر سکتا ہے، اور یہ ایک ایسا حال ہے جو انسان کی ذات کو متاثر ہونے سے محفوظ رکھتا ہے۔\n\nمجھے نحوی استاد عبد العزیز بن زیدان نے فاس شہر میں خبر دی، اور وہ الفناء (فنا) کے حال کا انکار کرتے تھے اور ہمارے پاس آتے جاتے تھے اور ان میں انابت (رجوع الی اللہ) تھی۔ ایک دن وہ میرے پاس آئے اور وہ خوش و مسرور تھے، اور کہنے لگے: \"اے میرے آقا! وہ الفناء (فنا) جس کا صوفیاء ذکر کرتے ہیں، میرے نزدیک ذوق کے ساتھ صحیح ہے، میں نے آج اس کا مشاہدہ کیا ہے۔\" میں نے ان سے پوچھا: \"کیسے؟\" انہوں نے کہا: \"کیا آپ نہیں جانتے کہ آج امیر المؤمنین اندلس سے اس شہر میں داخل ہوئے ہیں؟\" میں نے کہا: \"ہاں۔\" انہوں نے کہا: \"جان لو کہ میں اہل فاس کے ساتھ تماشا دیکھنے نکلا۔ پس لشکر قریب آیا۔ جب امیر المؤمنین پہنچے اور میں نے ان کی طرف دیکھا، تو میں اپنی ذات سے، لشکر سے، اور ہر اس چیز سے فنا ہو گیا جسے انسان محسوس کرتا ہے۔ اور میں نے نقاروں کی گونج نہیں سنی، نہ طبل کی آواز، باوجود اس کی کثرت کے، نہ بگلوں کی آواز، نہ لوگوں کا شور۔ اور میں نے اپنی آنکھ سے امیر المؤمنین کی ذات کے سوا تمام عالم میں سے کسی ایک کو بھی نہیں دیکھا۔ پھر مجھے کسی نے میری جگہ سے نہیں ہٹایا، اور میں گھوڑوں کے راستے اور لوگوں کے ہجوم میں کھڑا رہا، اور میں نے نہ اپنے آپ کو دیکھا اور نہ یہ جانا کہ میں ان کی طرف دیکھ رہا ہوں، بلکہ میں اپنی ذات سے اور تمام حاضرین سے فنا ہو گیا، ان میں اپنے الشہود (شہود) کے ذریعے سے۔ اور جب وہ مجھ سے اوجھل ہوئے اور میں اپنی ذات کی طرف لوٹا، تو گھوڑوں اور لوگوں کے ہجوم نے مجھے پکڑ لیا اور مجھے میری جگہ سے ہٹا دیا، اور میں بڑی مشکل سے اس تنگی سے نکلا۔ اور میرے کان نے شور، نقاروں اور بگلوں کی آوازوں کو محسوس کیا۔ پس مجھے یقین ہو گیا کہ الفناء (فنا) حق ہے، اور یہ ایک ایسا حال ہے جو فانی کی ذات کو اس چیز سے متاثر ہونے سے محفوظ رکھتا ہے جس سے وہ فنا ہوا ہے۔ اے میرے بھائی! یہ ایک مخلوق میں الفناء (فنا) ہے، تو خالق میں الفناء (فنا) کا کیا عالم ہو گا؟\n\nاگر تم نے اس الفناء (فنا) میں اپنی لطیف ذات کا تنوع مشاہدہ کیا اور اس کے ساتھ اس کے سوا کسی اور کا مشاہدہ نہیں کیا، تو تمہارا الفناء (فنا) تمہارے ذریعے تم سے ہے نہ کہ تمہارے سوا کسی اور سے۔ پس تم اپنی ذات سے فانی ہو، لیکن اپنی ذات سے فنا ہونے والے نہیں ہو، کیونکہ تمہاری لطیفہ کے لحاظ سے تم تمہارے ذریعے مشہود ہو، اور تمہارے ڈھانچے کے لحاظ سے تم تمہارے ذریعے مفقود ہو۔ اور اگر تم نے اس الفناء (فنا) کی حالت میں اپنے مرکب کا مشاہدہ کیا، تو تمہارا مشہود ایک خیال اور مثال ہے، جو نہ تمہارا عین ہے اور نہ تمہارے سوا کوئی اور، بلکہ اس الفناء (فنا) میں تمہارا حال خواب دیکھنے والے کا حال ہے۔\n\n### \"اور الفناء (فنا) کی پانچویں قسم\" یہ ہے کہ تم الحق (ذات حق) یا اپنی ذات کے الشہود (شہود) کے ذریعے تمام عالم سے فنا ہو جاؤ\n\nپس اگر تم نے تحقیق کر لی کہ تم میں سے کون الشہود (شہود) کر رہا ہے، تو تم جان لو گے کہ تم نے جو کچھ مشاہدہ کیا ہے وہ عین حق کے ذریعے مشاہدہ کیا ہے، اور الحق (ذات حق) اپنے نفس کے مشاہدے سے فنا نہیں ہوتا اور نہ ہی عالم، لہٰذا تم اس حال میں عالم سے فنا نہیں ہو گے۔ اور اگر تم نے یہ نہ جانا کہ تم میں سے کون الشہود (شہود) کر رہا ہے، تو تم اس حال کے مالک ہو گے اور الحق (ذات حق) کے الشہود (شہود) کے ذریعے یا اپنی ذات کے الشہود (شہود) کے ذریعے عالم کی رؤیت سے فنا ہو جاؤ گے، جیسا کہ تم اپنی ذات سے الحق (ذات حق) کے الشہود (شہود) کے ذریعے یا اکوان (کائناتوں) میں سے کسی کون (کائنات) کے الشہود (شہود) کے ذریعے فنا ہوئے تھے۔ پس یہ قسم صورت میں چوتھی قسم کے قریب ہے، اگرچہ یہ ایسا فائدہ دیتی ہے جو پچھلی چوتھی قسم نہیں دیتی۔\n\n### \"اور الفناء (فنا) کی چھٹی قسم\" یہ ہے کہ تم اللہ کے ذریعے ہر اس چیز سے فنا ہو جاؤ جو اللہ کے سوا ہے\n\nاور یہ ضروری ہے۔ اور تم اس الفناء (فنا) میں اپنی رؤیت سے بھی فنا ہو جاؤ، چنانچہ تم یہ بھی نہ جانو کہ تم الحق (ذات حق) کے الشہود (شہود) کی حالت میں ہو، کیونکہ اس حال میں تمہاری کوئی مشہود عین (حقیقت) نہیں ہے۔ اور یہاں اس شان کے بعض لوگوں کو ایک غلطی لاحق ہوتی ہے، اور میں ان شاء اللہ اسے تمہارے لیے واضح کروں گا تاکہ تمہارے لیے یہ مقام خالص ہو جائے، اور اللہ نے مجھے اس بیان کا الہام کیا ہے۔ وہ یہ ہے کہ اس حال کا مالک جب اللہ کے الشہود (شہود) کے ذریعے ہر اس چیز سے فنا ہو جاتا ہے جو اللہ کے سوا ہے، جیسا کہ وہ کہتا ہے، تو اس کے الشہود (شہود) میں یہ بات خالی نہیں ہو گی کہ یا تو وہ الحق (ذات حق) کو اس کے شؤون (شانوں) میں دیکھے گا یا اسے اس کے شؤون (شانوں) میں نہیں دیکھے گا۔ کیونکہ وہ ہمیشہ شؤون (شانوں) میں رہتا ہے، کیونکہ وہ عالم سے اور اس میں موجود اثر سے غائب نہیں ہے۔ پس اگر اس نے اسے اس کے شؤون (شانوں) میں دیکھا، تو وہ ہر اس چیز سے فنا نہیں ہوا جو اللہ کے سوا ہے۔ اور اگر اس نے اسے اس کے شؤون (شانوں) کے علاوہ دیکھا، بلکہ عالم سے اس کے استغناء (بے نیازی) میں دیکھا، تو اس کا دعویٰ صحیح ہے، \"فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ\" (پس بے شک اللہ تمام جہانوں سے بے نیاز ہے)۔ اور یہ مشہد صدیق (ابو بکر رضی اللہ عنہ) کو حاصل تھا، کیونکہ انہوں نے کہا: \"میں نے کوئی چیز نہیں دیکھی مگر اس سے پہلے اللہ کو دیکھا۔\" پس انہوں نے ثابت کیا کہ انہوں نے اسے دیکھا جبکہ کوئی چیز نہیں تھی۔ پھر انہیں ایک دوسرے مشہد میں کھڑا کیا گیا، تو انہوں نے اس سے چیز کے صادر ہونے کو دیکھا، حالانکہ وہ اسے دیکھ چکے تھے جبکہ کوئی چیز نہیں تھی۔ پس انہوں نے اس رؤیت کو اس الشہود (شہود) سے پہلے قرار دیا، چنانچہ کہا: \"میں نے کوئی چیز نہیں دیکھی مگر اس سے پہلے اللہ کو دیکھا۔\" پس میں نے تمہارے لیے اس امر کو اسی طرح واضح کر دیا جیسا کہ وہ ہے۔\n\n### \"اور الفناء (فنا) کی ساتویں قسم\" الحق (ذات حق) کی صفات اور ان کی نسبتوں سے فنا ہو جانا ہے\n\nاور یہ صرف اس شخص کے لیے الحق (ذات حق) کی ذات اور نفس کے لیے عالم کے الحق (ذات حق) سے ظہور کے الشہود (شہود) سے ہی ہو سکتا ہے، نہ کہ کسی زائد عقلی امر کے لیے۔ لیکن یہ اس حیثیت سے نہیں کہ وہ علت ہے، جیسا کہ بعض اہل نظر دیکھتے ہیں، اور نہ ہی وہ کون (کائنات) کو معلول دیکھتا ہے، بلکہ وہ اسے ایک مظہر کے عین میں ظاہر ہونے والا حق دیکھتا ہے، اس مظہر کے اپنے اندرونی استعداد کی صورت میں۔ پس وہ کون (کائنات) میں الحق (ذات حق) کا کوئی اثر نہیں دیکھتا، چنانچہ اس کے لیے کسی نسبت، صفت یا نعت کے ثبوت پر کوئی دلیل نہیں ہوتی۔ پس یہ الشہود (شہود) اسے اسماء، صفات اور نعوت سے فنا کر دیتا ہے۔ بلکہ اگر وہ اس کی تحقیق کرے تو وہ دیکھتا ہے کہ وہ خود محلِ تاثر ہے، جہاں ممکنات کی ثابت اعیان کے استعداد نے اس پر اثر کیا۔ اور اس بات کی تحقیق اس سے ہوتی ہے کہ اللہ تعالیٰ نے اپنی کتاب میں اور اپنے رسولوں کی زبانوں پر اپنے آپ کو ان چیزوں سے متصف کیا جن سے مخلوقاتِ محدثات کو متصف کیا ہے۔ اور یا تو یہ صفات اس کی جناب میں حق ہیں، پھر ہمیں ان سے متصف کیا گیا، اور یا یہ ہمارے لیے حق ہیں اور اس نے اپنے آپ کو ان سے متصف کیا تاکہ ہم تک رسائی ہو، اور اس کی خبر سچی ہے، جھوٹ نہیں ہے۔ اور اگر ہم ان میں اصل ہیں تو وہ (صفت) مکتسب (حاصل کردہ) ہے، اور اگر وہ اصل ہے تو ہم نے اسے حاصل کیا ہے۔ اور یہ اللہ کے علم کے انتہائی پوشیدہ نتائج میں سے ہے۔ کیونکہ اس نے تمام محدثات کی نعتوں کو قدیم ازلی خبروں کے ذریعے اپنی طرف منسوب کیا ہے۔ ان میں سے بعض وہ ہیں جن کی طرف اس نے اپنی خبروں میں اشارہ کیا کہ وہ ان میں سے بعض کو حاصل کرتا ہے، جیسے اس کا قول: \"وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ\" (اور ہم تمہیں ضرور آزمائیں گے تاکہ ہم جان لیں)۔ اور ان میں سے بعض وہ ہیں جن کا اس نے ذکر کیا اور انہیں کسب یا کسی اور چیز سے مقید نہیں کیا، اور اسی باب سے ہے: \"أُجِيبُ دَعْوَةَ الدَّاعِ\" (میں دعا کرنے والے کی دعا قبول کرتا ہوں)، \"وَادْعُونِي أَسْتَجِبْ لَكُمْ\" (اور مجھے پکارو میں تمہاری دعا قبول کروں گا)، \"وَاسْأَلُونِي أُعْطِكُمْ وَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ\" (اور مجھ سے مانگو میں تمہیں دوں گا، اور مجھ سے مغفرت طلب کرو میں تمہیں بخش دوں گا)، اور \"فَاذْكُرُونِي أَذْكُرْكُمْ\" (پس تم مجھے یاد کرو میں تمہیں یاد کروں گا)۔\n\nاور جہاں تک ان کے قول الفناء عن الفناء (فنا سے فنا) کا تعلق ہے، تو یہ آٹھویں قسم نہیں ہے، بلکہ یہ وہ فانی ہے جو اپنے الفناء (فنا) میں یہ نہیں جانتا کہ وہ فانی ہے، تو یہ الفناء عن الفناء (فنا سے فنا) ہے، جیسے خواب دیکھنے والا جو یہ نہیں جانتا کہ وہ خواب میں ہے۔ پس یہ ایک ایسا حال ہے جو الفناء (فنا) کی ہر قسم میں تابع ہوتا ہے۔ اور الفناء (فنا) کا حال کوشش سے حاصل نہیں ہوتا، یعنی اس کا قصد نہیں کیا جاتا۔ اور اس کا سب سے ادنیٰ درجہ متفکر میں اس کا حکم ہے۔ پس جب انسان دنیا کے کسی معاملے میں یا علم کے کسی مسئلے میں فکر میں ڈوب جاتا ہے، تو تم اس سے بات کرتے ہو اور وہ تمہیں نہیں سنتا، اور تم اس کے سامنے ہوتے ہو اور وہ تمہیں نہیں دیکھتا، اور تم اس کی آنکھ میں اس حالت میں جمود دیکھتے ہو۔ پھر جب وہ اپنی مطلوبہ چیز پا لیتا ہے یا کوئی ایسا امر پیش آتا ہے جو اسے اس کے احساس کی طرف لوٹا دیتا ہے، تب وہ تمہیں دیکھتا ہے اور سنتا ہے۔ پس یہ عالم میں اس کے سب سے ادنیٰ درجات ہیں۔ اور اس کا سبب محدث (نئی چیز) کی تنگی ہے، کیونکہ انسان کی حقیقت سے زیادہ وسیع کوئی چیز نہیں، اور نہ ہی اس سے زیادہ تنگ کوئی چیز ہے۔ جہاں تک قلب کے وسیع ہونے کا تعلق ہے، تو وہ کسی چیز سے تنگ نہیں ہوتا، لیکن ایک چیز سے تنگ ہوتا ہے۔ اور جہاں تک اس کی تنگی کا تعلق ہے، تو وہ ایک ساتھ دو خیالوں کو نہیں سما سکتا، کیونکہ وہ ذات میں احدی ہے، کثرت کو قبول نہیں کرتا۔ پس وہ اس حقیقت کے لحاظ سے حکم الٰہی میں اس کے قول \"فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ\" (پس بے شک اللہ تمام جہانوں سے بے نیاز ہے) کے معنی میں ہے، اور دوسری رتبہ میں اس کے قول \"فَأَحْبَبْتُ أَنْ أُعْرَفَ\" (پس میں نے چاہا کہ میں پہچانا جاؤں) میں ہے۔ اور یہ مقدار اس باب کی المعرفۃ (معرفت) کے لیے کافی ہے۔ \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب دویست و بیستم در معرفت فنا و اسرار آن»\n\nهمانا فنا برادر عدم است\nو اگر حکم کند، تسلط از آن اوست\nآن (فنا) از «چنین چیزی» است و نه غیر آن\nپس با «عن» (از) برای او در ما قدم بگذار\n\nسپس فنا از فنا (الفناء عن الفناء)\nحجابی است که ظلمت را نفی می‌کند\nپس شبیه آن، بلکه عین آن\nهمان است که در باب عدمِ عدم گفته شده است\n\nاین (فنا) لفظی است که زیر آن\nعین (حقیقت) است، اما حکم می‌راند\nپیوسته امید آن را می‌طلبد\nپس هر که به آن قیام کند، در آن معصوم شده است\nآنگاه که سلطنتش\nبا حصار حکم (الهی) جاری می‌شود\n\n### [مقصود از فنا چیست]\n\nبدان که فنا (الفناء) نزد طایفه (صوفیه) در برابر امور مختلفی به کار می‌رود. برخی گفته‌اند که فنا، فنای معاصی است. و برخی گفته‌اند فنا، فنای رؤیت فعل بنده است به سبب قیام حق بر آن. و برخی گفته‌اند فنا، فنا از خلق است و این نزد آنان دارای طبقاتی است، از جمله فنا از فنا (الفناء عن الفناء). و برخی آن را به هفت طبقه رسانده‌اند. پس بدانید – خداوند ما و شما را به روح القدس تأیید کند – که فنا جز «از کذا» (از چیزی) نیست، همان‌طور که بقا (البقاء) جز «به کذا» (به چیزی) و «با کذا» (با چیزی) نیست. پس «عن» (از) برای فنا ضروری است. و فنا در این طریق نزد طایفه جز از «ادنی» (پایین‌تر) به «اعلی» (بالاتر) نیست. اما فنا از اعلی، اصطلاح این قوم نیست، هرچند از نظر لغوی صحیح باشد.\n\nاما طبقه اول در فنا این است که از مخالفت‌ها (گناهان) فانی شوی. به گونه‌ای که به سبب عصمت و حفظ الهی، هیچ مخالفتی به ذهنت خطور نکند. و رجال الله در اینجا بر دو قسم‌اند: قسم اول، مردانی هستند که معاصی بر آنان چیره نشده است، پس جز در مباح تصرف نمی‌کنند. و اگر از آنان مخالفت‌هایی که شرعاً در امت معصیت نامیده می‌شود، ظاهر شود، خداوند اینان را توفیق داده است تا از کسانی باشند که گناه کردند و دانستند که پروردگاری دارند که گناه را می‌آمرزد و به گناه مؤاخذه می‌کند. پس به آنان در شنیدن این قول گفته شد:\n\n«اعملوا ما شئتم فقد غفرت لكم» (هر چه می‌خواهید انجام دهید، همانا شما را آمرزیدم).\n\nمانند اهل بدر. پس احکام مخالفت‌ها از آنان فانی شد، زیرا آنان مخالفت نکردند، بلکه جز در آنچه برایشان مباح شده بود، تصرف ننمودند. زیرا غیرت الهی مانع از آن می‌شود که مقربان نزد او حرمت خطاب الهی را با منع و تحجیر بشکنند. و خداوند آنان را مؤاخذه نمی‌کند، زیرا عنایت ازلی در حقشان سبقت گرفته است. پس آنچه بر دیگران ممنوع است، برای آنان مباح کرده است. و سایر کسانی که این مقام را ندارند، از این امر بی‌خبرند، پس بر آن شخص حکم می‌شود که مرتکب معاصی شده است، در حالی که او به نص کلام خدا که بر زبان رسول خدا (صلی الله علیه و سلم) ابلاغ شده، عاصی نیست. مانند اهل بیت (علیهم السلام) هنگامی که خداوند رجس (پلیدی) را از آنان دور کرد، و هیچ رجسی پلیدتر از معاصی نیست، و آنان را تطهیر نمود، «تطهیراً» (تطهیر کامل). و این یک خبر است و خبر را نسخ راهی نیست، و خبر خدا صدق است و اراده الهی بر آن سبقت گرفته است. پس هر آنچه به اهل بیت نسبت داده می‌شود که قادح در تطهیر و زوال رجس است که خداوند از آنان خبر داده، تنها از حیث اعتقاد کسی است که آن را نسبت می‌دهد، زیرا آن فعل نسبت به او رجس است، در حالی که حکم رجس از عین همان فعل در حق اهل بیت برداشته شده است. پس صورت در هر دو یکی است و حکم متفاوت.\n\nقسم دیگر، مردانی هستند که بر سرّ قدر و حاکمیت آن بر خلایق آگاه شده‌اند و آنچه بر آنان مقدر شده است از جریان افعال صادر شده از ایشان را مشاهده کرده‌اند، از آن حیث که فعل هستند، نه از آن حیث که محکوم به خوب یا بد هستند. و این در «حضور نور خالص» (حضرة النور الخالص) است که اهل کلام از آن می‌گویند: «افعال خدا همه نیکوست و فاعلی جز خدا نیست، پس فعلی جز برای خدا نیست.» و زیر این حضور، دو حضور دیگر است: «حضور سُدفَه» (حضرة السدفة - حضور نیمه‌تاریک) و «حضور ظلمت محض» (حضرة الظلمة المحضة). در حضور سُدفَه، تکلیف ظاهر شد و کلمه به کلمات تقسیم شد و خیر از شر متمایز گشت. و حضور ظلمت، حضور شرّی است که خیری با آن نیست، و آن شرک و فعلی است که موجب خلود در آتش و عدم خروج از آن می‌شود، اگرچه در آن نعمت‌هایی باشد.\n\nهنگامی که این مردان از این قسم، آنچه را که از حضور نور مشاهده کردند، دیدند، به انجام تمام آنچه می‌دانستند از آنان صادر می‌شود، شتافتند و از احکامی که موجب دوری و نزدیکی می‌شود، فانی شدند. پس طاعات را انجام دادند و در مخالفت‌ها واقع شدند، همه اینها بدون نیت قربت یا هتک حرمت بود. این فنایی غریب است که خداوند مرا در شهر فاس بر آن آگاه ساخت و من برای آن ذائقه‌ای (کسی که آن را چشیده باشد) ندیدم، با علم به اینکه مردانی دارد، اما آنان را ملاقات نکردم و کسی از ایشان را ندیدم، جز اینکه حضور نور و حکم امر در آن را دیدم. اما آن مشاهده در ما حکمی نداشت، بلکه خداوند مرا در حضور سُدفَه اقامت داد و حفظ و عصمت بخشید. پس من حکم حضور نور را دارم و اقامتم در سُدفَه است، و این نزد قوم کامل‌تر از اقامت در حضور نور است. این است معنای قول برخی از آنان در باب فنا که آن را فنای معاصی دانسته‌اند.\n\n### «و اما نوع دوم» از فنا، فنا از افعال بندگان است به سبب قیام حق بر آن\n\nاز قول او: «أَ فَمَنْ هُوَ قائِمٌ عَلى‏ كُلِّ نَفْسٍ بِما كَسَبَتْ» (آیا پس کسی که بر هر نفسی به آنچه کسب کرده، قائم است؟). پس فعل را از پشت پرده‌های اکوان (هستی‌ها) که محل ظهور افعال در آن است، برای خدا می‌بینند. و این همان قول خدای تعالی است: «إِنَّ رَبَّكَ واسِعُ الْمَغْفِرَةِ» (همانا پروردگار تو گسترده‌المغفرت است)، یعنی پرده‌اش گسترده است و اکوان همگی پرده او هستند و او فاعل از پشت این پرده است، «وَهُمْ لا يَشْعُرُونَ» (و آنان درک نمی‌کنند). و متکلمانی که افعال بندگان را خلق خدا اثبات می‌کنند، درک می‌کنند، اما شهود (الشهود) نمی‌کنند، به سبب حجاب کسب که خداوند بصیرتشان را با آن کور کرده است، همان‌طور که بصیرت کسی را که افعال را برای خلق می‌بیند، کور کرده است، هنگامی که خداوند او را با آنچه با چشم می‌بیند، متوقف ساخت. پس این (معتزلی) درک نمی‌کند و آن (اشعری) شهود نمی‌کند. پس بر همه «عَلى‏ بَصَرِهِ غِشاوَةٌ» (بر دیده‌اش پرده‌ای است).\n\n### «و اما نوع سوم» فنا از صفات مخلوقین است\n\nبه سبب قول خدای تعالی در خبر نبوی روایت شده از او: «كنت سمعه وبصره» (من گوش و چشم او بودم). و همچنین سایر صفات او. و سمع و بصر و غیر آن از اعیان صفاتی که برای بنده یا خلق است – هر طور که می‌خواهی بگو – و حق (الحق) را بشناس که نفس او عین صفات ایشان است نه صفت او. پس تو از حیث صفاتت عین حق هستی نه صفت او، و از حیث ذاتت، عین ثابت تو هستی که خداوند آن را مظهر قرار داد و خود را در آن برای خودش ظاهر ساخت. زیرا او از تو جز بصیرتت را نمی‌بیند، و آن عین نظر توست. پس جز خود را ندیده است و تو را با این (شهود) از رؤیت خودت فانی ساخته است؛ فنایی از جنس حقیقت شهودی معلوم و محقق که پس از این فنا، حال به حالی باز نمی‌گردد که برای تو اثبات کند صفتی محقق داری که عین حق نیست. و صاحب این فنا همیشه در دنیا و آخرت، نه در خود و نه نزد خود، به شهود و کشف (الکشف) و رؤیت متصف نمی‌شود، با وجود اینکه شهود می‌کند و کشف می‌نماید و می‌بیند. و صاحب این فنا بر هر بیننده و شاهد و مکاشفی برتری دارد، زیرا حق را همان‌طور که خود را می‌بیند، می‌بیند، چون تو او را به واسطه او دیدی نه به واسطه خودت. و این مشهدی عزیز است که من برای آن ذائقه‌ای (چشنده‌ای) ندیده‌ام، زیرا بسیار دقیق است. پس هر کس گمان کند که آن را چشیده و سپس به حس و نفس خود بازگردد و برای خود صفتی اثبات کند که عین حقیقتی نیست که آن را دانسته، پس از آنچه گفته خبری ندارد و نمی‌داند چه کسی شهود کرده و چه چیزی را شهود کرده است.\n\nسپس اگر صاحب این فنا در حال فنا بین صفات خود تفاوت قائل شود، و غیر آنچه شنیده ببیند، و غیر آنچه سعی کرده بشنود، و غیر آنچه بوییده و چشیده سعی کند، و غیر آنچه دانسته بچشد، و غیر آنچه مقدر کرده و تمییز داده بداند، و بین این نسبت‌ها تفاوت قائل شود و ادعا کند که صاحب این نوع از فناست، او صاحب آن نیست. اما اگر عین (حقیقت) نزد او یگانه شود، پس با آنچه می‌بیند بشنود، با آنچه سخن می‌گوید ببیند، با آنچه می‌داند سعی کند و ببوید و بچشد و احساس کند، و ادراک بر او به اختلاف حکم، مختلف نشود، پس او صاحب این فناست، با ذوقی صحیح‌الحال.\n\n### «و اما نوع چهارم» از فنا، فنا از ذات توست\n\nو تحقیق این امر آن است که بدانی ذات تو مرکب از لطیف و کثیف است و هر ذاتی از تو حقیقتی و احوالی دارد که با دیگری متفاوت است، و لطیفه تو در هر حال با آنات (لحظات) متنوع‌الصور است، در حالی که هیکل تو بر یک صورت ثابت است، اگرچه اعراض بر آن مختلف شود. پس اگر از ذات خود فانی شوی به مشهودت که شاهد حق از حق و غیر حق است، و در این حال از شهود ذاتت در آن غایب نشوی، پس تو صاحب این فنا نیستی. اما اگر در این شهود، ذات خود را شهود نکنی و آنچه را شهود کردی، شهود نمایی، پس تو صاحب این نوع از فنا هستی. و اینکه گفتیم «آنچه را شهود کردی، شهود نمایی» و شهود حق را به تنهایی تخصیص ندادیم، به این دلیل است که مشهود صاحب این فنا ممکن است کونی از اکوان باشد، و این حالی است که ذات انسان را از تأثیرپذیری حفظ می‌کند.\n\nاستاد نحوی، عبدالعزیز بن زیدان، در شهر فاس به من خبر داد، و او حال فنا را انکار می‌کرد و نزد ما رفت و آمد داشت و در او انابه (توبه و بازگشت) بود. روزی بر من وارد شد در حالی که شاد و مسرور بود و گفت: ای سید من، فنایی که صوفیه ذکر می‌کنند، نزد من با ذوق صحیح شد و امروز آن را مشاهده کردم. به او گفتم: چگونه؟ گفت: آیا نمی‌دانی که امیرالمؤمنین امروز از اندلس وارد این شهر شد؟ گفتم: بله. گفت: بدان که من برای تماشا با مردم فاس بیرون رفتم. پس لشکریان آمدند. هنگامی که امیرالمؤمنین رسید و به او نگاه کردم، از خودم و از لشکر و از تمام آنچه انسان حس می‌کند، فانی شدم. و صدای طبل‌ها و شیپورها و هیاهوی مردم را نشنیدم، با وجود کثرت آن، و با چشمم هیچ‌کس از عالم را ندیدم، جز شخص امیرالمؤمنین. سپس هیچ‌کس مرا از جایم دور نکرد و در مسیر اسب‌ها و ازدحام مردم ایستادم و نه خود را دیدم و نه دانستم که به او نگاه می‌کنم، بلکه از ذات خود و از همه حاضران فانی شدم به سبب شهودم در او. و هنگامی که او از من محجوب شد و به خود بازگشتم، اسب‌ها و ازدحام مردم مرا گرفتند و از جایم دور ساختند و جز با سختی از تنگی رها نشدم و گوشم هیاهو و صدای طبل‌ها و شیپورها را درک کرد. پس یقین کردم که فنا حق است و حالی است که ذات فانی را از اینکه آنچه از آن فانی شده، در او تأثیر بگذارد، حفظ می‌کند.\n\nای برادر من، این فنا در مخلوق است، پس گمانت به فنا در خالق چیست؟\n\nاگر در این فنا، تنوع ذات لطیفه خود را مشاهده کردی و غیر آن را با آن مشاهده نکردی، پس فنای تو از خودت به واسطه خودت است نه به واسطه غیر خودت. پس تو از ذات خود فانی هستی و در عین حال از ذات خود فانی نیستی، زیرا از حیث لطیفه، به واسطه خودت مشهود داری و از حیث هیکلت، به واسطه خودت مفقود هستی. اما اگر مرکب خود را در حال این فنا مشاهده کردی، پس مشهود تو خیال و مثال است، نه عین تو و نه غیر تو، بلکه حال تو در این فنا، حال شخص خوابیده صاحب رؤیاست.\n\n### «و اما نوع پنجم از فنا» فنای تو از تمام عالم است به سبب شهود حق یا ذاتت\n\nاگر تحقیق کنی که چه کسی از تو شهود می‌کند، خواهی دانست که آنچه را شهود کرده‌ای، به عین حق شهود کرده‌ای. و حق با مشاهده نفس خود فانی نمی‌شود، و عالم نیز فانی نمی‌شود. پس در این حال از عالم فانی نمی‌شوی. اما اگر ندانی چه کسی از تو شهود می‌کند، صاحب این حال خواهی بود و از رؤیت عالم فانی می‌شوی به سبب شهود حق یا به سبب شهود ذاتت، همان‌طور که از ذات خود فانی شدی به سبب شهود حق یا به سبب شهود کونی از اکوان. پس این نوع در صورت به نوع چهارم نزدیک است، هرچند فایده‌ای می‌دهد که نوع چهارم پیشین نمی‌دهد.\n\n### «و اما نوع ششم از فنا» این است که از هر آنچه غیر خداست، به واسطه خدا فانی شوی\n\nو این ضروری است. و در این فنا از رؤیت خود فانی می‌شوی، پس نمی‌دانی که در حال شهود حق هستی، زیرا در این حال عین مشهودی برای تو نیست. و در اینجا غلطی برای برخی از اهل این شأن رخ می‌دهد که ان‌شاءالله آن را برایت روشن خواهم ساخت تا مقام برایت خالص شود، و خداوند این بیان را به من الهام کرده است. و آن این است که صاحب این حال، هنگامی که از هر آنچه غیر خداست فانی می‌شود، به شهود خدا – آن‌گونه که می‌گوید – در شهود خود یا حق را در شئوناتش می‌بیند یا در شئوناتش نمی‌بیند. زیرا او پیوسته در شئونات است، چرا که غیبتی از عالم و از اثر در آن ندارد. اگر او را در شئوناتش مشاهده کند، پس از هر آنچه غیر خداست فانی نشده است. و اگر او را در غیر شئوناتش، بلکه در بی‌نیازی‌اش از عالم مشاهده کند، ادعایش صحیح است: «فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ» (همانا خداوند از جهانیان بی‌نیاز است). و این مشهد برای صدیق (ابوبکر) بود، زیرا او گفت: «ما رأيت شيئا إلا رأيت الله قبله» (چیزی را ندیدم مگر اینکه خدا را قبل از آن دیدم). پس اثبات کرد که او را دیده است و شیئی در کار نبوده است. سپس در مشهد دیگری اقامت داده شد، پس صدور شیء را از او دید، در حالی که او را دیده بود و شیئی نبود. پس آن رؤیت را قبل از این شهود قرار داد و گفت: «ما رأيت شيئا إلا رأيت الله قبله» (چیزی را ندیدم مگر اینکه خدا را قبل از آن دیدم). پس من امر را آن‌گونه که هست برایت روشن ساختم.\n\n### «و اما نوع هفتم از فنا» فنا از صفات حق و نسبت‌های اوست\n\nو این جز به شهود ظهور عالم از حق برای عین این شخص، به ذات حق و نفس او، نه به امری زائد که تعقل شود، حاصل نمی‌شود. اما نه از این جهت که او علت است، آن‌گونه که برخی از اهل نظر می‌بینند، و کَون را معلول نمی‌بیند، بلکه آن را حق می‌بیند که در عین مظهر، به صورت استعداد آن مظهر در نفس خود، ظاهر شده است. پس برای حق اثری در کَون نمی‌بیند. بنابراین دلیلی بر ثبوت نسبتی، یا صفتی، یا نعتی برای او وجود ندارد. این شهود او را از اسماء و صفات و نعوت فانی می‌سازد. بلکه اگر آن را تحقیق کند، می‌بیند که او (حق) محل تأثر است، زیرا استعداد اعیان ثابته از اعیان ممکنات در او تأثیر گذاشته است. و آنچه این امر را محقق می‌سازد، این است که خدای تعالی خود را در کتابش و بر زبان رسولانش به آنچه مخلوقات حادث به آن وصف شده‌اند، وصف کرده است. یا اینکه این صفات در جناب او حق است و سپس ما به آن نعت داده شده‌ایم، و یا اینکه برای ما حق است و او خود را به آن نعت داده است تا به ما دست یابد. و خبر او در این باره صدق است نه کذب. و اگر ما در آن اصل باشیم، او کسب‌کننده است، و اگر او اصل باشد، ما آن را کسب کرده‌ایم. و این از غامض‌ترین نتایج علم به خداست، زیرا او نعوت (اوصاف) حادثات را با اخبار قدیم ازلی به خود نسبت داده است. از جمله آنچه در اخبارش به کسبی بودن برخی از آنها اشاره کرده است، مانند قولش: «وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ» (و قطعاً شما را می‌آزماییم تا بدانیم). و از جمله آنچه ذکر کرده و به کسب یا غیر آن مقید نکرده است. و از این باب است: «أُجِيبُ دَعْوَةَ الدَّاعِ» (دعوت دعا کننده را اجابت می‌کنم)، و «ادْعُونِي أَسْتَجِبْ لَكُمْ» (مرا بخوانید تا شما را اجابت کنم)، و «واسئلوني أعطكم» (از من بخواهید تا به شما عطا کنم)، و «واستغفروني أغفر لكم» (از من آمرزش بخواهید تا شما را بیامرزم)، و «فَاذْكُرُونِي أَذْكُرْكُمْ» (پس مرا یاد کنید تا شما را یاد کنم).\n\nو اما قول آنان که «فنا از فنا» (الفناء عن الفناء) می‌گویند، نوع هشتم نیست، بلکه آن است که فانی (الفانی) اگر در فنای خود نداند که فانی است، آن فنا، فنا از فناست. مانند صاحب رؤیا که نمی‌داند در رؤیاست. پس این حالی است که تابع هر نوعی از انواع فناست که تحقق یابد. و حال فنا با تکلف (به قصد و کوشش) حاصل نمی‌شود، یعنی قصد نمی‌شود. و پایین‌ترین درجه حکم آن در متفکر است. هنگامی که انسان در امری از امور دنیا یا در مسئله‌ای از علم غرق در فکر شود، با او سخن می‌گویی و نمی‌شنود، و در مقابل او هستی و تو را نمی‌بیند، و در چشم او در آن حالت جمودی می‌بینی. پس هنگامی که به مطلوب خود دست یابد یا امری عارض شود که او را به حس خود بازگرداند، آنگاه تو را می‌بیند و می‌شنود. این پایین‌ترین درجات آن در عالم است و سبب آن تنگی مُحدَث (مخلوق) است. زیرا هیچ چیز وسیع‌تر از حقیقت انسان نیست و هیچ چیز تنگ‌تر از آن نیست. اما وسعت قلب، از هیچ چیز تنگ نمی‌شود، مگر از یک چیز. و اما تنگی آن، این است که دو خاطر را با هم در خود جای نمی‌دهد، زیرا ذاتش احدی است و کثرت را نمی‌پذیرد. پس او از حیث این حقیقت، در حکم الهی در معنای قول «فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ» (همانا خداوند از جهانیان بی‌نیاز است) است. و در رتبه دیگر در قول: «فأحببت إن أعرف» (پس دوست داشتم که شناخته شوم) است.\n\nو این مقدار در معرفت این باب کافی است. «وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 4
}