{
  "id": 114,
  "title": {
    "ar": "الباب الرابع عشر ومائة في معرفة الحسد والغبط",
    "en": "Chapter One Hundred and Fourteenth: Concerning the Knowledge of Envy and Emulation.",
    "ur": "باب ایک سو چودہ: حسد اور غبطہ کی معرفت (معرفة) کے بیان میں",
    "fa": "باب صد و چهاردهم در معرفت حسد و غبطه"
  },
  "content": {
    "ar": "## (الباب الرابع عشر ومائة في معرفة الحسد والغبط)\n\n\n> حسد القلب حصاد *** وهوى النفس بعاد\n> عينه في الجنس تبدو *** وهو الملك الجواد\n\n\n> فإنا أحسد مثلي *** وبهذا القوم سادوا\n\n\n> ما لنا مثل سوانا *** حسد الحق العباد\n\n\n> لو دري الناس الذي قلت *** لما كان العناد\n\n\n### [ما كان في الجبلة فمن المحال عدمه‏]\n\n\nالحسد وصف جبلي في الإنس والجان وكذلك الغضب والغبط والحرص والشرة والجبن والبخل وما كان في الجبلة فمن المحال عدمه إلا أن تنعدم العين الموصوف بها ولما علم الحق أن إزالتها من هذين الصنفين من الخلق لا يصح زوالها عين لها مصارف يصرفها فيها فتكون محمودة إذا صرفت في الوجه الذي أمر الشارع أن تصرف فيه وجوبا أو ندبا وتكون مذمومة إذا صرفت في خلاف المشروع وإذا عرفت هذا فلا عناد ولا نزاع‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم زادك الله حرصا ولا تعد\n\n\nوقال منهومان لا يشبعان طالب دنيا وطالب علم‏\n\n\n### [طلب الدنيا وطلب العلم‏]\n\n\nفطلب الدنيا قد يكون مذموما وقد يكون محمودا وطلب العلم محمود بكل وجه غير إن المعلومات متفاضلة فبعضها أفضل من بعض وتختلف باختلاف القصد فإن طلب العلم بالمثال من جهة من قامت بهم لا من حيث أعيانها وطلب بعضها بطريق التجسس مذموم فما ثم على التحقيق ما هو مخلص لأحد الجانبين أين قوله ومن شَرِّ حاسِدٍ إِذا حَسَدَ من‏\n\n\nقوله لا حسد إلا في اثنتين‏\n\n\nوكذلك أين الغضب لله من غضب الإنسان لنفسه من غضبه حمية جاهلية\n\n\n### [ما جبلت عليه النفس لا يزول وإنما المجاهدة والرياضة في مصارفها ومقاصدها]\n\n\nفجميع ما جبلت النفس عليه لا يزول بالمجاهدة ولا بالرياضة وإنما تختلف مصارفها فيختلف اللسان عليها بالذم والحمد فإن أخذ بها جهة اليمين فبخل بدينه وحرص على فعل الخير وغضب لله حمد وإن أخذ بها جهة الشمال فغضب حمية جاهلية وبخل بما فرض عليه الجود به كالزكاة وتعليم العلم ذم حقا وخلقا وعلم هذا الباب فيه راحة عظيمة ومنفعة للناس وهم عنها غافلون انتهى الجزء الثامن والتسعون‏\n\n\n( (بسم الله الرحمن الرحيم))\n\n",
    "en": "## Chapter One Hundred and Fourteen: Concerning the Knowledge of Envy (الحسد) and Emulation (الغبط)\n\n> The envy of the heart is a harvest,\n> And the passion of the soul is distance.\n> Its eye appears in the species,\n> And He is the Generous King.\n\n> For I envy my like,\n> And by this the people prevailed.\n\n> We have no equal other than ourselves;\n> The Real envied the servants.\n\n> If people knew what I said,\n> There would be no contention.\n\n### [That which is innate is impossible to eliminate]\n\nEnvy (الحسد) is an innate characteristic (وصف جبلي) in humans (الإنس) and jinn (الجان), as are anger, emulation (الغبط), eagerness (الحرص), voracity (الشرة), cowardice (الجبن), and stinginess (البخل). That which is rooted in the innate disposition (الجبلة) is impossible to eliminate, unless the entity (العين) described by it ceases to exist. Since the Real (الحق) knew that the removal of these characteristics from these two types of creation is not possible, He designated channels (مصارف) for them into which they should be directed.\n\nThus, they become praiseworthy if directed toward the manner in which the Lawgiver (الشارع) commanded them to be directed, whether obligatorily or commendably. And they become blameworthy if directed contrary to the Law (المشروع). If you understand this, there is neither obstinacy nor contention.\n\nThe Prophet, peace and blessings be upon him, said: \"May Allah increase your eagerness (حرصا), but do not transgress.\"\n\nAnd he said: \"Two greedy ones (منهومان) are never satisfied: a seeker of the world and a seeker of knowledge.\"\n\n### [The Seeking of the World and the Seeking of Knowledge]\n\nThe seeking of the world may be blameworthy or praiseworthy. The seeking of knowledge (العلم) is praiseworthy in every respect, except that the objects of knowledge possess degrees of excellence (متفاضلة), so some are superior to others. They also differ according to the difference in intention (القصد). For seeking knowledge through example from the perspective of those who possess it, rather than from the perspective of their immutable essences (أعيانها), and seeking some knowledge through spying (التجسس) is blameworthy. Therefore, in reality (على التحقيق), there is nothing that is purely dedicated to one of the two sides.\n\nWhere is His saying, <<وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ>> (And from the evil of the envier when he envies), compared to His saying, \"There is no envy (حسد) except in two cases\"? Likewise, where is anger for the sake of Allah compared to a person's anger for his own sake, or his anger due to ignorant zealotry (حمية جاهلية)?\n\n### [That which the soul is innately disposed to does not vanish; rather, the struggle and spiritual discipline pertain to its channels and intentions]\n\nAll that the soul is innately disposed to does not vanish through spiritual struggle (المجاهدة) nor through discipline (الرياضة). Rather, their channels (مصارفها) differ, and thus the tongue differs in applying blame and praise to them.\n\nIf one takes them toward the right direction, and is stingy with his religion, eager to perform good deeds, and angry for the sake of Allah, he is praised. And if one takes them toward the left direction, and is angry due to ignorant zealotry, and is stingy with what he is obligated to be generous with, such as Zakat and the teaching of knowledge, he is blamed both legally and morally. The knowledge of this chapter contains great comfort and benefit for people, though they are heedless of it.\n\nThe ninety-eighth section is concluded.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "باب نمبر ایک سو چودہ: حسد اور رشک (غبط) کی معرفت میں\n\nدل کا حسد (حسد) فصل کاٹنا ہے *** اور نفس کی خواہش دوری (بعاد) ہے۔\nاس کی آنکھ جنس میں ظاہر ہوتی ہے *** اور وہ بادشاہ (الملک) ہے جو سخی (الجواد) ہے۔\nپس میں اپنے جیسے سے حسد کرتا ہوں *** اور اسی سے قوموں نے سیادت حاصل کی۔\nہمارے لیے دوسروں جیسا کچھ نہیں *** ذات حق (الحق) بندوں سے حسد کرتا ہے۔\nاگر لوگ جان لیتے جو میں نے کہا *** تو کوئی عناد (ضد) نہ ہوتا۔\n\n### (جو چیز جبلی سرشت میں ہو، اس کا ختم ہونا محال ہے)\n\nحسد (الحسد) انسانوں اور جنوں میں ایک جبلی صفت (وصف جبلي) ہے، اور اسی طرح غصہ، رشک (الغبط)، حرص، لالچ (الشرة)، بزدلی (الجبن) اور بخل بھی۔ اور جو چیز جبلی سرشت (الجبلة) میں ہو، اس کا ختم ہونا محال ہے، سوائے اس کے کہ وہ عین ہی ختم ہو جائے جس میں یہ صفت پائی جاتی ہے۔ اور جب ذات حق (الحق) نے جان لیا کہ مخلوق کی ان دونوں اقسام سے ان صفات کا زائل ہونا درست نہیں، تو اس نے ان کے لیے ایسے مصارف (راستے) مقرر کر دیے جن میں انہیں صرف کیا جائے، چنانچہ وہ قابل تعریف ہوں گی اگر انہیں اس طریقے پر صرف کیا جائے جس کا شارع (الشارع) نے وجوباً یا استحباباً حکم دیا ہے، اور وہ قابل مذمت ہوں گی اگر انہیں خلافِ شریعت طریقے پر صرف کیا جائے۔ اور جب تم یہ جان لو تو پھر کوئی عناد اور نزاع باقی نہیں رہتا۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"اللہ تمہاری حرص میں اضافہ کرے، اور تم دوبارہ ایسا نہ کرنا۔\"\n\nاور آپ صلی اللہ علیہ وسلم نے فرمایا: \"دو حریص ایسے ہیں جو کبھی سیر نہیں ہوتے: دنیا کا طالب اور علم کا طالب۔\"\n\n### (دنیا کا طلب کرنا اور علم کا طلب کرنا)\n\nپس دنیا کا طلب کرنا کبھی مذموم ہو سکتا ہے اور کبھی محمود، جبکہ علم کا طلب کرنا ہر لحاظ سے محمود ہے۔ البتہ معلومات میں تفاضل (درجات کا فرق) ہے، چنانچہ بعض معلومات بعض سے افضل ہیں۔ اور یہ (فضیلت) قصد کے اختلاف سے بدل جاتی ہے۔ اگر علم کو مثال کے ذریعے ان لوگوں کی طرف سے طلب کیا جائے جن میں وہ قائم ہے، نہ کہ ان کی اعیان (ذاتوں) کے لحاظ سے، اور بعض علم کو تجسس کے ذریعے طلب کرنا مذموم ہے۔ پس حقیقت میں کوئی ایسی چیز نہیں جو دونوں پہلوؤں میں سے کسی ایک کے لیے خالص ہو۔ کہاں ہے اللہ تعالیٰ کا یہ فرمان:\n\n**قرآنی آیت:** \"وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ\" (اور حسد کرنے والے کے شر سے جب وہ حسد کرے)\n\nاس فرمان سے:\n\n**حدیث:** \"لَا حَسَدَ إِلَّا فِي اثْنَتَيْنِ\" (حسد صرف دو چیزوں میں جائز ہے)۔\n\nاور اسی طرح کہاں ہے اللہ کے لیے غصہ کرنا، انسان کے اپنے نفس کے لیے غصہ کرنے سے، یا اس کے جاہلی حمیت (تعصب) کے لیے غصہ کرنے سے۔\n\n### (جس پر نفس کو جبلی طور پر پیدا کیا گیا ہے وہ زائل نہیں ہوتا، بلکہ مجاہدہ اور ریاضت صرف اس کے مصارف اور مقاصد میں ہوتی ہے)\n\nپس وہ تمام چیزیں جن پر نفس کو جبلی طور پر پیدا کیا گیا ہے، وہ مجاہدہ (المجاهدة) اور ریاضت (الرياضة) سے زائل نہیں ہوتیں، بلکہ صرف ان کے مصارف (صرف کرنے کے طریقے) مختلف ہو جاتے ہیں، چنانچہ زبان ان پر مذمت یا تعریف کرتی ہے۔ اگر وہ (نفس) انہیں دائیں جانب لے جائے، تو وہ اپنے دین پر بخل کرے (یعنی دین کو ضائع ہونے سے بچائے)، اور نیکی کرنے پر حرص کرے، اور اللہ کے لیے غصہ کرے، تو اس کی تعریف کی جائے گی۔ اور اگر وہ انہیں بائیں جانب لے جائے، تو وہ جاہلی حمیت کے لیے غصہ کرے، اور ان چیزوں میں بخل کرے جن میں سخاوت کرنا اس پر فرض ہے، جیسے زکوٰۃ اور علم کی تعلیم دینا، تو وہ حقاً اور خلقاً مذمت کا مستحق ہے۔ اور اس باب کا علم لوگوں کے لیے عظیم راحت اور فائدہ کا باعث ہے، حالانکہ وہ اس سے غافل ہیں۔\n\n(یہ اٹھانوےواں حصہ ختم ہوا)\n\n(شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے)",
    "fa": "باب صد و چهاردهم در معرفت حسد و غبطه (الغبط)\n\nحسد قلب، درو کردن است *** و هوای نفس، دوری است\nچشم آن (حسد) در نوع (بشر) آشکار می‌شود *** و او (حق) پادشاه بخشنده است\n\nپس من به مثل خود حسد می‌ورزم *** و به همین سبب، قوم (صالحان) سروری یافتند\n\nما را مِثلی جز دیگران نیست *** حق (الحق) بر بندگان حسد ورزید\n\nاگر مردم آنچه را گفتم می‌دانستند *** ستیزه‌ای (العناد) وجود نداشت\n\n[آنچه در سرشت (الجبلة) است، محال است که از بین برود]\n\nحسد (الحسد) صفتی سرشتی (جبلی) در انسان و جن است، و همچنین است خشم (الغضب)، غبطه (الغبط)، حرص، آزمندی (الشرة)، ترس (الجبن) و بخل. و آنچه در سرشت (الجبلة) باشد، محال است که از بین برود، مگر اینکه آن عین (ذات) که بدان وصف شده است، معدوم گردد. و چون حق (الحق) دانست که از بین بردن این صفات از این دو صنف از خلق (انسان و جن) صحیح نیست، برای آنها مصارفی (مجاری‌ای) تعیین کرد که آنها را در آنجا صرف کنند. پس اگر در جهتی صرف شود که شارع به وجوب یا استحباب امر کرده است، ستوده خواهد بود؛ و اگر در خلاف شرع صرف شود، نکوهیده خواهد بود. و چون این را دانستی، دیگر ستیزه و نزاعی نیست.\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «زَادَكَ اللَّهُ حِرْصًا وَلَا تَعُدْ» (خداوند حرص تو را بیفزاید و بازنگرد).\n\nو فرمود: «مَنْهُومَانِ لَا يَشْبَعَانِ طَالِبُ دُنْيَا وَطَالِبُ عِلْمٍ» (دو حریص‌اند که سیر نمی‌شوند: طالب دنیا و طالب علم).\n\n[طلب دنیا و طلب علم]\n\nپس طلب دنیا گاهی نکوهیده و گاهی ستوده است، اما طلب علم از هر جهت ستوده است. جز اینکه معلومات (المعلومات) دارای برتری‌هایی هستند، پس برخی از برخی دیگر افضل‌اند و با اختلاف قصد (القصد) متفاوت می‌شوند. زیرا طلب علم به مثال (بالمثال) از جهت کسانی که آن علم در آنها قائم شده است، نه از حیث اعیان (ذوات) خود علم، و طلب برخی از علوم از طریق تجسس، نکوهیده است. پس در حقیقت (على التحقيق) چیزی نیست که برای یکی از دو جانب (ستایش یا نکوهش) خالص باشد. کجاست سخن او (خداوند): «وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ» (و از شر حسود هنگامی که حسد ورزد) در مقایسه با سخن او (پیامبر): «لَا حَسَدَ إِلَّا فِي اثْنَتَيْنِ» (حسد روا نیست مگر در دو چیز). و همچنین کجاست خشم برای خدا (الغضب لله) در مقایسه با خشم انسان برای نفس خود، یا خشم او از روی تعصب جاهلی (حمية جاهلية).\n\n[آنچه نفس بر آن سرشته شده است زائل نمی‌شود، بلکه مجاهده و ریاضت در مصارف و مقاصد آن است]\n\nپس تمام آنچه نفس بر آن سرشته شده است، با مجاهده و ریاضت از بین نمی‌رود. بلکه مصارف (مجاری) آن متفاوت می‌شود، پس زبان در مورد آن به ذم و حمد (نکوهش و ستایش) اختلاف می‌یابد. پس اگر آن را به سمت راست ببرد، و در دین خود بخل ورزد (یعنی آن را حفظ کند)، و بر انجام خیر حریص باشد، و برای خدا خشم گیرد، ستوده می‌شود. و اگر آن را به سمت چپ ببرد، و از روی تعصب جاهلی (حمية جاهلية) خشم گیرد، و در آنچه جود به آن بر او واجب شده است، مانند زکات و تعلیم علم، بخل ورزد، به حق و خلق نکوهیده می‌شود. و علم این باب، آسایش عظیم و منفعتی برای مردم دارد، در حالی که آنها از آن غافل‌اند. جزء نود و هشتم به پایان رسید.\n\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 2
}