{
  "id": 332,
  "title": {
    "ar": "الباب الثاني والثلاثون وثلاثمائة في معرفة منزل الحراسة الإلهية لأهل المقامات المحمدية وهو من الحضرة الموسوية",
    "en": "Chapter Three Hundred and Thirty-Two, Concerning the Gnosis of the Station of Divine Guarding (منزل الحراسة الإلهية) for the People of the Muhammadan Stations (المقامات المحمدية), and it is from the Mosaic Presence (الحضرة الموسوية).",
    "ur": "باب تین سو بتیس: مقاماتِ محمدیہ (المقامات المحمدية) کے اہل کے لیے حراستِ الٰہیہ (الحراسة الإلهية) کے منزل کی معرفت میں، اور یہ حضرتِ موسویہ (الحضرة الموسوية) سے ہے۔",
    "fa": "باب سیصد و سی و دوم در معرفت منزل حراسة الإلهية (حراسة الإلهية) برای اهل مقامات محمدیه (المقامات المحمدية) و آن از حضرت موسویه (الحضرة الموسوية) است."
  },
  "content": {
    "ar": "## «الباب الثاني والثلاثون وثلاثمائة في معرفة منزل الحراسة الإلهية لأهل المقامات المحمدية وهو من الحضرة الموسوية»\n\n\n> كل من مال لاستدارة كون *** فهو طور وجمعه أطوار\n\n\n> وهو عطف الإله ليس سواه *** فهو سر في كوننا مستعار\n\n\n> بدء أعياننا به لوجوب *** يحكم العقل فيه والاضطرار\n\n\n> لو تناهي الوجود ما كان كورا *** فلهذا عقل اللبيب يحار\n\n\n### [إن الله ينادي لموسى من جانب الطور]\n\n\nاعلم أيدك الله أن الله تعالى يقول في حق موسى عليه السلام معرفا إيانا ونادَيْناهُ من جانِبِ الطُّورِ الْأَيْمَنِ فجعل النداء من الطور لانحنائه لأنه خرج في طلب النار لأهله لما كان فيه من الحنو عليهم الذي أورثه الانحناء على من خلق من الانحناء وهي أهله لأنها خلقت بالأصالة من الضلع والضلع له الانحناء وكان الانحناء في الأضلاع لاستقامة النشأة وحفظ ما انحنت عليه من الأحشاء لتعم بانحنائها جميع ما تحتوي عليه فتتساوى أجزاؤها في الحفظ لها بخلاف ما لو كانت على غير استدارة لكانت فيها زوايا فارغة بعيدة من الحفظ الذي خلقت له ووقع التجلي لموسى في عين صورة حاجته فرأى نارا لأنها مطلوبة فقصدها فناداه ربه منها وهو لا علم له بذلك لاستفراغه فيما خرج له وهو قولنا في قصيدة لنا في جزء الزينبيات‏\n\n\n> كنار موسى يراها عين حاجته *** وهو الإله ولكن ليس يدريه‏\n\n\n### [أن الله ما خلق الذي خلق من الموجودات خلقا خطيا من غير أن يكون فيه ميل إلى الاستدارة]\n\n\nواعلم أن الله ما خلق الذي خلق من الموجودات خلقا خطيا من غير أن يكون فيه ميل إلى الاستدارة أو مستديرا في عالم الأجسام والمعاني وقال تعالى في السموات وهو ما علا وفي الأرض وهو ما سفل إذ لا أسفل منها إنه لا يَؤُدُهُ حِفْظُهُما فوصف نفسه بأنه لكل شي‏ء حفيظ والحفظ حنو من الحافظ على المحفوظ فيكون في شكل كل صورة الأجسام انحناء وفي المعاني والأرواح حنو فلنذكر سبب ميل الأجسام إلى الاستدارة وذلك إن أول شكل قبله الجسم الاستدارة وهو المسمى فلكا أي مستديرا وعن حركة ذلك الفلك ظهر عالم الأجسام علوا وسفلا فمنه ما ظهر بصورة ذات الأصل وهو كل من كملت فيه الاستدارة والتقى طرفا الدائرة ومن نقص عن هذه الصورة لا بد أن يوجد فيه ميل إلى الاستدارة يظهر ذلك حسا في الأجسام حتى في أوراق الأشجار والأحجار والجبال والأغصان فما في عالم الأجسام خط غير مائل إلا بالفرض والتوهم لا بالوقوع وإنما ظهر الجسم بصورة الاستدارة أعني الجسم الكل الظاهر بالشكل لأن الله أراد أن يملأ به الخلأ فلو لم يكن مستدير الشكل لبقي في الخلأ ما ليس فيه ملأ والخلأ استدارة متوهمة لا في جسم وإنما وقع الأمر هكذا الصدور الأشياء عن الله ورجوعها فمنه بدأ وإليه يعود فلا بد أن يكون هذا الأمر في عالم الشكل صورة دائرة لأنه لا يعود إليه على الطريق الذي خرج عليه وإنما امتداده ينتهي إلى مبدئه ولا يكون ذلك في الشكل الخطي لأنه لو كان لم يعد إليه أبدا وهو عائد إليه فلا بد من الاستدارة فيه معنى وحسا ومن خلقه العالم على الصورة إن خلقه مستدير الشكل فانظر في حكمة الله ولما كان المرجع إليه ليظهر الحنو الذي صورته انحناء لذلك عمت رحمته جميع الموجودات ووسعت كل شي‏ء كما\nوسع هو كُلَّ شَيْ‏ءٍ رَحْمَةً وعِلْماً ولم يجر للغضب ذكر في هذه السعة الإلهية والرحمانية فلا بد من مال العالم إلى الرحمة لأنه لا بد للعالم من الرجوع إلى الله فإنه القائل وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فإذا انتهت رجعته إليه عاد الأمر إلى البدء والمبدأ والمبدئ والمبدأ رحمة وسعت كل شي‏ء والمبدئ وسع كُلَّ شَيْ‏ءٍ رَحْمَةً وعِلْماً فعرف الأمر في عوده في الرحمة فيأمن من تسرمد العذاب على خلق الله أين أنت من هذا الشهود لو لا سبق الرحمة الشاملة العامة الامتنانية لتسرمد العذاب على من ينفي رحمة الله من هذه السعة التي ذكر الله فيها ولكن سبق الرحمة جعله أن يبدو له من الله من الرحمة به مع هذا الاعتقاد ما لم يكن يحتسبه فما آخذه الله بجهله لأنه صاحب شبهة في فهمه فعين بصيرته مطموس وعقله في قيد الجهالة محبوس وما في الحيوان من جرى في مسكنه وعمارة بيته وإقامة صورته على شكل العالم مثل النحل فسدست صور بيوتها حتى لا يبقى خلاء كما سد الشكل الكري الخلأ فلم يبق خلاء وعمرت بيتها بالعسل الذي هو ملذوذ نظير الرحمة الإلهية التي عمت الوجود وغمرته وما عمرته بذلك في حق غيرها وإنما عمرته في حق نفسها وكذا صدر العالم على هذه الصورة فما من شي‏ء من العالم إلا وهو يُسَبِّحُ بِحَمْدِهِ فلنفسه أوجده لأنه ما شغله إلا به وقال فيمن جعل فيه استعدادا يمكن أن يسعى به لنفسه ولغير الله فنبه أنه ما خلقهم إلا لعبادته فقال وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فكونهم ما فعل بعضهم ما خلق له لا يلزم منه بالقصد المذكور أنه خلق لما تصرف فيه ولذلك يسأل ويحاسب كما وقع فيما اختزنته النحلة لنفسها وأظهرته منها لقوام ذاتها فأخذه من أخذه وتحكم فيه في غير ما أوجدته له ولما كان الأمر كما ذكرناه في النحل دون غيره لذلك أخبرنا الله عنها أنه أوحى إليها دون غيرها من الحيوان وقال فيما يَخْرُجُ من بُطُونِها إنه شِفاءٌ لِلنَّاسِ فأنزله منزلة الرحمة التي وسعت كل شي‏ء وما ذكر له مضرة وإن كان بعض الأمزجة يضره استعماله ولكن ما تعرض لذلك أي أن المقصود منه الشفاء بالوجود كما المقصود بالغيث إيجاد الرزق الذي يكون عن نزوله بالقصد وإن هدم الغيث بيت الشيخ الفقير الضعيف فما كان رحمة في حقه من هذه الجهة الخاصة ولكن ما هي بالقصد العام الذي له نزل المطر وإنما كان ما كان من استعداد القابل للتهدم لضعف البنيان كما كان الضرر الواقع لآكل العسل من استعداد مزاجه لم يكن بالقصد العام‏\n\n\n### [أن الله حفظ العالم لإبقاء الثناء عليه‏]\n\n\nواعلم أن حفظ الله للعالم إنما هو لإبقاء الثناء عليه بلسان المحدثات بالتنزيه عما هي عليه من الافتقار فلم يكن الحفظ للاهتمام به ولا للعناية بل ليكون مجلاه وليظهر أحكام أسمائه وكذا خلق الإنسان على صورته فقال وأَنْ لَيْسَ لِلْإِنْسانِ إِلَّا ما سَعى‏ فجعله لا يسعى إلا لنفسه ولهذا قرن بسعيه الأجر حتى يسعى لنفسه بخلاف من لا أجر له من العالم الأعلى والأسفل وليس بعد الرسل ومرتبتهم في العلم بالله مرتبة فهم المطرقون والمنبهون ومع هذا فما منهم من رسول إلا قيل له قل لأمتك ما أَسْئَلُكُمْ عَلَيْهِ أي على ما بلغتكم من أَجْرٍ إِنْ أَجْرِيَ إِلَّا عَلَى الله فإنه الذي استخدمه وأرسله فالأجر عليه فما سعوا ولا بلغوا إلا في حظوظ نفوسهم لكن الفرق بين العماء من أهل الله وبين العامة إنهم علموا ما الأجر ومن صاحبه ومن يطلبه منهم ممن لا يطلبه ولمن يرجع ذلك الحكم فكل ساع في أمر فإنما يسعى لنفسه كان ذلك الساعي من كان لا يستثني ساع من ساع بل الأمر كله لله وتختلف الأجور باختلاف المقاصد فأعلاها حب المدح والثناء فإنها صفة إلهية ولأجلها أوجد الله العالم ناطقا بتسبيحه بحمده ودون ذلك من الأجور طلب الزيادة من العلم بالكوائن ودون ذلك من الأجور ما تطلبه الطبيعة من القوي الروحانية لوجود الانفعال كثيرا عنها ودون ذلك ما تطلبه الطبيعة من القوي الحسية لمجرد الالتذاذ الذي للروح الحيواني به وليس وراء ذلك أجر يطلب فما ذكرنا سعيا إلا وهو حظ للنفس الساعية فإذا علمت حفظ الله العالم علمت قوله تعالى تَجْرِي بِأَعْيُنِنا فكثر فقال فَإِنَّكَ بِأَعْيُنِنا فكثر فكل حافظ في العالم أمرا ما فهو عين الحق إذ الحفظ لا يكون إلا ممن لا يغالب على محفوظه ولا يقاوي على حفظه فكن حافظا لما أنت به تكن عين الحق في وجوده فحفاظ العالم لهم هذه المنزلة وهم لا يعلمون أنهم أعين الحق وذلك ليعلم فضل أهل الشهود والوجود على غيرهم وإن وقع الاشتراك في الصفة ولكن ليس من علم منزلته من حضرة الحق مثل من لم يعلم قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ والَّذِينَ لا يَعْلَمُونَ إِنَّما يَتَذَكَّرُ أُولُوا الْأَلْبابِ فهذا إعلام بأنهم علموا ثم طرأ النسيان على بعضهم فمنهم من استمر عليه حكم النسيان ف نَسُوا الله فَنَسِيَهُمْ ومنهم من ذكر فتذكر وهم أولو الألباب ولب العقل هو الذي‏\nيقع به الغذاء للعقلاء فهم أهل الاستعمال لما ينبغي أن يستعمل بخلاف أهل العقول فإنهم أهل قشر زال عنه لبه فأخذه أولو الألباب فعقلوا وما استعملوا ما ينبغي أن يستعملوه لأن العقل لا يستعمل إلا إذا كان قشرا على لب فاستعمال العقل بما فيه من صفة القبول لما يرد من الله مما لا يقبله العقل الذي لا لب له من حيث فكره فلهذا أهل الله هم أهل الألباب لأن اللب غذاء لهم فاستعملوا ما به قوامهم وأهل العقل هم الذين يعقلون الأمر على ما هو عليه إن اتفق وكان نظرهم في دليل فإذا عقلوا ذلك كانوا أصحاب عقل فإن استعملوه بحسب ما يقتضي استعمال ذلك المعقول فهم أصحاب لب‏\n\n\n> وفي اللب لب الدهن إن كنت تعلم *** وفي الدهن أمداد لمن كان يفهم‏\n\n\nفمن رزق الفهم من المحدثات فقد رزق العلم وما كل من رزق علما كان صاحب فهم فالفهم درجة عليا في المحدثات وبه ينفصل علم الحق من علم الخلق فإن الله له العلم ولا يتصف بالفهم والمحدث يتصف بالفهم وبالعلم وفي الفهم عن الله يقع التفاضل بين العلماء بالله والفهم متعلقة الإمداد الإلهي الصوري خاصة فإن كان الإمداد في غير صورة كان علما ولم يكن هناك حكم للفهم لأنه لا متعلق له إلا في هذه الحضرة فلهذا يسمى مستفيدا لما استفاده من فهمه إذ لا يصح لمستفيد استفادة من غير حالة الانتقال من محل العالم المعلم إلى محل المتعلم فما استفاد إلا من فهمه فللمعلم إنشاء صور ما يريد تعليمها للطالب المتعلم وللمستفيد الفهم عنه فلو لا قوة الفهم ما استفاد فكما لا تستوي الظُّلُماتُ ولا النُّورُ ولا الظِّلُّ ولا الْحَرُورُ ولا الْأَحْياءُ ولا الْأَمْواتُ كذلك لا يستوي الأعمى وهو الذي لا يفهم فيعلم ولا البصير الذي يفهم فيعلم كما لا تَسْتَوِي الْحَسَنَةُ ولا السَّيِّئَةُ فلا يستوي الحق والخلق فإنه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فاعلم وهُوَ السَّمِيعُ الْبَصِيرُ فأبهم فحير العقول والفهوم بين الإعلام والإبهام غير إن الرحمة لما عمت عاملهم الحق بما أداهم إليه اجتهادهم أصابوا في ذلك أم أخطئوا طريق القصد بالوضع إذ لا خطأ من هذا الوجه في العالم الأعلى ما ذكرناه من إضافة شي‏ء إلى غير ما أضيف إليه في نفس الأمر كمن يطلب الشي‏ء من غير سببه الذي وضع له فله أجر الطلب لا أجر الحصول لأنه لم يحصل فهو طالب في الماء جذوة نار فكان في الإبهام عين المكر الإلهي فالعالم يلحق الفروع بأصولها على بصيرة وكشف والمبهم عليه يلحق الفروع بالأصول فإن وافقت أصولها فبحكم المصادفة وهو يتخيل أنها أصل لذلك الفرع فإذا صادف سمي خيالا صحيحا وإن لم يصادف سمي خيالا فاسدا فلو لا الإبهام ما احتيج إلى الفهم فهي قوة لا تتصرف إلا في المبهمات الممكنات وغوامض الأمور ويحتاج صاحب الفهم إلى معرفة المواطن فإذا كان الميزان بيده الموضوع الإلهي عرف مكر الله وميزه ومع هذا فلا يأمنه في المستقبل لأنه من أهل النشأة التي تقبل الغفلات والنسيان وعدم استحضار العلم بالشي‏ء في كل وقت ولا فائدة في إلحاق الفروع بأصولها إلا أن يكون للفروع حكم الأصول وأصل وجود العالم وجود الحق فللعالم حكم وجود الحق وهو الوجوب من حيث ما هو وجوب ثم كون الوجوب ينقسم إلى وجوب بالذات وإلى وجوب بالغير هذا أمر آخر وكذلك أصل وجود العلم بالله العلم بالنفس فللعلم بالله حكم العلم بالنفس الذي هو أصله والعلم بالنفس بحر لا ساحل له عند العلماء بالنفس فلا يتناهى العلم بها هذا حكم علم النفس فالعلم بالله الذي هو فرع هذا الأصل يلحق به في الحكم فلا يتناهى العلم بالله ففي كل حال يقول رَبِّ زِدْنِي عِلْماً فيزيده الله علما بنفسه ليزيد علما بربه هذا يعطيه الكشف الإلهي وذهب بعض أصحاب الأفكار إلى أن العلم بالله أصل في العلم بالنفس ولا يصح ذلك أبدا في علم الخلق بالله وإنما ذلك في علم الحق خاصة وهو تقدم وأصل بالمرتبة لا بالوجود فإنه بالوجود عين علمه بنفسه عين علمه بالعالم وإن كان بالرتبة أصلا فما هو بالوجود كما تقول بالنظر العقلي في العلة والمعلول وإن تساوقا في الوجود ولا يكون إلا كذلك فمعلوم إن رتبة العلة تتقدم على رتبة المعلول لها عقلا لا وجودا وكذلك المتضايفان من حيث ما هما متضايفان وهو أتم فيما نريد فإن كل‏\n\n\nواحد من المتضايفين علة ومعلول لمن قامت به الإضافة فكل واحد علة لمن هو له معلول ومعلول لمن هو له علة فعلة البنوة أوجبت للأبوة أن تكون معلولة لها وعلة الأبوة أوجبت للبنوة أن تكون معلولة لها ومن حيث أعيانهما لا علة ولا معلول واعلم أنه مما يتعلق بهذا الباب كون العالم عيالا لله تعالى وبعضه اتخذه أهلا\n\n\nفقال عليه السلام في الخبر الوارد عنه إن الخلق عيال الله‏\n\n\nوأخبر في خبر آخر أن أهل القرآن هم أهل الله وخاصته‏\n\n\nوالأهلية منزلة خصوص واختصاص من‏\nالعموم وجعل الرحم التي منها ظهر أولو الأرحام فينا شجنة من الرحمن كما أن الولد شجنة من أبويه وجعل له سبحانه نسبا بينه وبين عباده وهو التقوى فيضع أنساب العالم يوم القيامة ويرفع نسبه فيعم لأنه ما ثم إلا من يتقيه ومن اجترأ عليه فمن كونه أجرأه عليه بما ذكر من حكم نعته بالعفو والتجاوز والصفح والمغفرة وعموم الرحمة فأشهدهم هذه النعوت وليس لها أثر يظهر حكمه عموما لكل ناظر إلا في العصاة ولا سيما العفو فكل عاص ما اجترأ على الله إلا به وهو من حيث نفسه متق لله فإن النسب ما للأحوال فيه أثر إذا هو صح وما اعتبر الله إلا النسب الديني وبه يقع التوارث بين الناس فإذا اجتمع في الشخص النسب الديني والطيني حينئذ له أن يحجب ما يحجبه من النسب الديني والطيني فإذا لم يكن له نسب طيني وله نسب ديني رجع على دينه لم يحجبوا بالنسب الطيني وراثته عن النسب الديني فورثه المسلمون أو يكون كافرا فيرثه الكفار وإن كان\n\n\nذو نسب طيني وليس له نسب ديني فيرثه المسلمون فما إلا خرج عن دينه تعالى فإن نسب التقوى يعم كل نحلة وملة إن عقلت فمن حيث إن العالم عيال الله رزقهم ومن حيث إن فيهم من هو أهل له اعتنى بهم فأشفق عليهم ومن حيث إنهم مخلوقون على الصورة على وجه الكمال استنابهم ومن حيث إن بعضهم على بعض الصورة رفق بهم ومن حيث النسب المذكور نظر إليهم الاسم الرحمن بالوصل وانتظام الشمل فمن كل وجه له نظر إليهم بالإحسان ولهذا تسمى بالبر الرحيم والبر معناه المحسان وهذا القدر كاف في الكلام في هذا المنزل فلنذكر ما يتضمن من العلوم فمنها علم أفضل الأشكال ومنها علم الكتب ومراتبها ومعرفة المبين منها من المنير من الحكيم من الكريم من المحصي من المسطور من المرقوم من المعنوي من الحسي من الأم من الإمام إلى غير ذلك من أصناف الكتب والكتاب فإن الله كتب التوراة بيده وكتب القلم بنفسه عن أمر ربه في اللوح المحفوظ ومرتبة كل كاتب وما كتب من الكتابة في الأرحام وهم كتاب الخلق والرزق والأجل والشقاء والسعادة والكرام الكاتبون والفرق بين المكتوب فيه من لوح محفوظ وألواح غير محفوظة ورق وغير ذلك وصور الكتابة الإلهية من غيرها هذا كله يعلم من هذا المنزل ويشهده من دخله وعلم المعمور من العالم من غير المعمور وغير المعمور هل معمور بما لا تدركه أبصارنا أو ليس بمعمور في نفس الأمر وعمارة الأمكنة بما يتكون فيها من نبات أو حيوان أو معدن أو ما ينزل فيه من حق وملك وجان والفرق بين الاسم الإلهي العلي والرفيع ولما ذا جاء الاسم الرفيع مقيدا بالإضافة والعلي مطلقا من غير تقييد وعلم كيفية انقلاب الضد إلى ضده إذا جاوز حده هل ذلك من حيث جوهره أو جوهر صورته وعلم الإيلاء الإلهي بنفسه وبالموجودات والمعدومات وعلم المقسم عليه في تقييده بالماضي وهو الواقع أو بالمستقبل الذي لا بد من وقوعه حكما أو وجوده عينا ولما ذا اختص المقسوم عليه بالقسم دون غيره وهو من حيث هو عالم واحد وعلم القضاء هل له راد أم لا وذلك الراد هل هو منه أوامر آخر اقتضاه شرط بالرفع أو بالثبوت وعلم تغير النعوت على المنعوت بها هل كل متغير قام التغير بذاته أو كان التغير في حكمه لا في عينه ولا في صفته إن كان ذا صفة وعلم السبب المؤدي إلى الجحد مع العلم وإنه لا ينزل منزلة الجاهل في الحكم وهل الجاهل معذور أم لا وعلم العلم المحمود من العلم المذموم وهل الذم له عرضي عرض له من المعلوم أم لا أثر له فيه لا بالحكم العرضي ولا الذاتي وهل للعلم أثر محسوس في النفس والحس أم لا أثر له إلا في النفس كمن يعلم أنه تقع به مصيبة ولا بد فيتغير لذلك مزاجه ولونه وحركته ويتبلبل لسانه ويقول ولا يدري ما يقول فإن العلم أثر في النفس خوفا وهذه الآثار آثار وجود الخوف عنده ما هي آثار العلم لأن العلم قد يقع في نفس القوي الذي يحكم على نفسه‏\n\n\nفلا يؤثر فيها خوفا فلا يتغير مع وجود العلم وعلم الأمر الذي يعذب به الكاذب وهل يعذب بأمر عدمي لمناسبة الكذب أو يعذب بأمر وجودي لكون الكذب له مرتبة وجود في الوجود الذهني وحينئذ يعبر عنه الكاذب فهل عقوبته مثل نسبته إلى الحس فيكون بأمر عدمي أو بمثل نسبته إلى الخيال فيكون بأمر وجودي متخيل وهي علوم عجيبة في المشاهدات لا علم لعلماء الرسوم والنظار بهذه الموازنات لجهلهم بالميزان الموضوع الذي وضعه الله عند رفع السماء وبسط الأرض بين السماء والأرض وأنه مع كونه موضوعا هو بيد الحق المسمى بالدهر يخفض ويرفع وعلم السحر لما ذا يرجع وهل فيه محمود وما فعله وعلم السواء في قوله تعالى سَواءٌ عَلَيْهِمْ أَ أَنْذَرْتَهُمْ أَمْ لَمْ تُنْذِرْهُمْ لا يُؤْمِنُونَ وقوله سَواءٌ عَلَيْهِمْ أَسْتَغْفَرْتَ لَهُمْ أَمْ لَمْ تَسْتَغْفِرْ لَهُمْ ... إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ الله لَهُمْ وقوله‏\nفَاصْبِرُوا أَوْ لا تَصْبِرُوا سَواءٌ عَلَيْكُمْ وموطن الدنيا الذي وقع فيه الاستغفار يقتضي أن يقبل بخلاف موطن الآخرة فكما أنه استوى عندهم الإنذار وعدم الإنذار فلم يؤمنوا كذلك استوى في حقهم في الآخرة وجود الصبر وعدمه فلم يؤثر في نفوذ الجزاء الوفاق وعلم الاعتماد على غير الله مما يحمد الله أن يعتمد عليه ما أثره في الدار الآخرة في الجزاء الوفاق وعلم سبب النكاح الذي لا يكون عنه التناسل لإبقاء ذلك النوع وعلم سبب المعاطاة من غير حاجة إذ المعاطاة لا تكون إلا في ذي حاجة وعلم وجود الامتنان مع المعاوضة في البيوع لا في الهبات لأن الامتنان في الهبات معقول ولهذا شرعت المكافاة عليه ليضعف سلطان الامتنان والسبب الذي يرفع الامتنان من العالم ولمن ينبغي الامتنان مع المعاوضة وعلم الفرق بين الكهانة والوحي وعلم ما هو الهوى والعقل الذي يقابله وعلم من أين خلق العالم هل من شي‏ء أو من لا شي‏ء وعلم هل تتفاضل الأرواح في القوة فيؤثر بعضها في بعض كالقوى الجسمانية أم لا وعلم الخزائن الإلهية وما اختزن فيها وأين مكانها وعلم عندية الحق هل هي نسبة أو ظرف وجودي وعلم ترقي العالم الطبيعي على أي معراج يكون هل على طبيعي فيفتقر أيضا إلى معراج أو على غير طبيعي وعلم صورة تأثير المعاني اللطيفة في الأجرام الكثيفة وعلم تأثير القصد في الأفعال وعلم ما ينبغي أن يكون عليه الإله من الصفات وعلم سبب خيبة الظنون في وقت دون وقت وعلم أحوال التنزيه فهذا بعض ما يحوي عليه هذا المنزل من العلوم قد ذكرناه لتتوفر همة الطالب على طلبها من الله أو من العالم بها والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Three Hundred and Thirty-Two: On the Gnosis of the Station of Divine Guardianship (الحراسة الإلهية) for the People of the Muhammadan Stations (المقامات المحمدية), which belongs to the Mosaic Presence (الحضرة الموسوية)\n\n> Everyone who inclines toward the circularity of existence (كون) / is a Mount (طور), and its plural is Mounts (أطوار).\n> And this is the Compassion (عطف) of the God, there is none other than Him / It is a secret borrowed within our existence.\n> The beginning of our essences (أعياننا) is through it, due to a necessity / which reason (العقل) and compulsion (الاضطرار) dictate.\n> If Existence (الوجود) were finite, it would not be circular (كورا) / For this reason, the mind of the discerning person is bewildered.\n\n### [Indeed Allah Calls to Moses from the Side of the Mount]\n\nKnow, may Allah support you, that Allah the Exalted says concerning Moses (peace be upon him), informing us: <<And We called him from the side of the blessed Mount>> (<<وَنَادَيْنَاهُ مِنْ جَانِبِ الطُّورِ الْأَيْمَنِ>>). He made the call come from the Mount (الطور) due to its curvature (لانحنائه), because Moses went out seeking fire for his family (أهله) due to the tenderness (الحنو) he felt for them, which resulted in his bending (الانحناء) toward those created from curvature—namely, his family, who were originally created from the rib (الضلع), and the rib possesses curvature.\n\nThe curvature in the ribs was for the soundness of the constitution and the preservation of the viscera (الأحشاء) over which they curve, so that their curvature might encompass everything they contain, making their parts equal in preservation. This is unlike a non-circular shape, which would leave empty corners far from the preservation for which they were created.\n\nThe Theophany (التجلي) occurred for Moses precisely in the form of his need; he saw fire because it was what he sought, so he approached it. His Lord called him from it, yet he had no knowledge of this, due to his complete absorption in the object of his quest. This is what we said in a poem of ours in the section on the Zaynabiyyat:\n\n> Like the fire of Moses, which he sees as the very object of his need / And yet it is the God, though he does not perceive it.\n\n### [That Allah Did Not Create Any Existing Thing with a Linear Creation Without an Inclination Toward Circularity]\n\nKnow that Allah did not create any of the existing things (الموجودات) with a linear creation (خلقا خطيا) without it having an inclination toward circularity (الاستدارة) or being entirely circular in the world of bodies (الأجسام) and meanings (المعاني). Allah the Exalted said concerning the heavens (which are above) and the earth (which is below, as there is nothing lower than it): <<The preservation of both does not weary Him>> (<<لَا يَؤُودُهُ حِفْظُهُمَا>>). Thus, He described Himself as a Preserver (حفيظ) of everything. And preservation (الحفظ) is tenderness (حنو) from the Preserver toward the preserved.\n\nTherefore, in the form of every physical body there is curvature (انحناء), and in meanings and spirits (الأرواح) there is tenderness (حنو). Let us mention the reason for the inclination of bodies toward circularity. That is because the first shape accepted by the body was circularity, which is called a celestial sphere (فلك), meaning circular. From the movement of that sphere, the world of bodies, both high and low, appeared. Some of it appeared in the form of the origin itself—that is, everything in which circularity is complete and the two ends of the circle meet. Whatever falls short of this form must possess an inclination toward circularity. This is physically evident in bodies, even in the leaves of trees, stones, mountains, and branches. There is no non-inclined line in the world of bodies except by hypothesis and imagination, not by actual occurrence.\n\nThe body appeared in the form of circularity—I mean the total body (الجسم الكل) manifested in shape—because Allah intended to fill the void (الخلأ) with it. Had it not been circular in shape, there would have remained in the void something that was not filled. The void is an imagined circularity, not residing in a body.\n\nThe matter occurred this way because of the emanation of things from Allah and their return to Him. From Him they began, and to Him they return. Therefore, this matter must take the form of a circle in the world of shape, because it does not return to Him along the path by which it departed. Rather, its extension terminates at its beginning. This cannot happen with a linear shape, for if it were linear, it would never return to Him, yet it is returning to Him. Thus, circularity is necessary, both conceptually (معنى) and physically (حسا).\n\nPart of His creation of the world in this form is that He created it circular in shape. Reflect upon the wisdom of Allah. Since the return is to Him, so that the tenderness (الحنو)—whose form is curvature (انحناء)—may be manifested, His Mercy (رحمته) encompassed all existing things (الموجودات) and embraced everything, just as He encompassed <<everything in Mercy and Knowledge>> (<<كُلَّ شَيْءٍ رَحْمَةً وَعِلْمًا>>).\n\nWrath (الغضب) is not mentioned in this Divine and Compassionate vastness. Therefore, the world must incline toward Mercy, because the world must return to Allah, for He is the One who said: <<And to Him all matters are returned>> (<<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>>). When its return is complete, the matter reverts to the beginning (البدء). The Origin (المبدأ) and the Initiator (المبدئ) are Mercy that encompassed everything, and the Initiator encompassed <<everything in Mercy and Knowledge>>. Thus, the matter is known to return within Mercy, and one is secure from the eternity of punishment (تسرمد العذاب) upon Allah’s creation.\n\nWhere are you in relation to this Witnessing (الشهود)? Were it not for the precedence of the comprehensive, general, gratuitous Mercy (الرحمة الشاملة العامة الامتنانية), eternal punishment would befall those who deny Allah's Mercy from this vastness He mentioned. However, the precedence of Mercy causes something of His Mercy to appear to them from Allah, despite their belief, which they had not anticipated. He does not hold them accountable for their ignorance, because they possess a misconception (شبهة) in their understanding; the eye of their insight (بصيرته) is obscured, and their intellect is imprisoned by the fetters of ignorance.\n\nAmong animals, none has conducted its dwelling, built its home, and established its form upon the shape of the cosmos (العالم) like the bee (النحل). The forms of its houses are hexagonal (سدست) so that no void (خلاء) remains, just as the spherical shape (الشكل الكري) sealed the void, leaving no emptiness. It built its home with honey, which is delightful, analogous to the Divine Mercy that encompassed and overwhelmed Existence (الوجود).\n\nIt did not build it for the sake of others, but for its own sake. Similarly, the world emanated in this form. There is nothing in the world except that <<it glorifies Him with His praise>> (<<يُسَبِّحُ بِحَمْدِهِ>>). He brought it into existence for its own sake, because He only occupied it with Himself. Regarding those in whom He placed a capacity (استعدادا) that allows them to strive for themselves and for other than Allah, He alerted them that He only created them for His worship, saying: <<And I did not create the jinn and mankind except that they should worship Me>> (<<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ>>).\n\nThe fact that some of them do not do what they were created for does not imply, based on the stated intention, that they were created for what they engaged in. For this reason, they will be questioned and held accountable, just as happens with what the bee stores for itself and manifests for the sustenance of its being, which is then taken by others and used for purposes other than that for which it was brought into existence.\n\nSince the matter concerning the bee is as we mentioned, unlike other animals, Allah informed us that He revealed (أوحى) to it, unlike other animals. And He said concerning what <<emerges from their bellies>> (<<يَخْرُجُ مِنْ بُطُونِهَا>>), that it is <<a healing for mankind>> (<<شِفَاءٌ لِلنَّاسِ>>). Thus, He placed it in the rank of the Mercy that encompasses everything, and He did not mention any harm associated with it. Although its use may harm some temperaments, He did not address that, meaning that the intended purpose of its existence is healing, just as the intended purpose of rain (الغيث) is the provision of sustenance that results from its descent. Even if the rain destroys the house of a poor, weak elder, it was not Mercy in that specific regard. However, that specific harm is not the general intention for which the rain descended. Rather, what occurred was due to the preparedness of the recipient for destruction due to the weakness of the structure, just as the harm incurred by the honey-eater was due to the preparedness of his temperament, not due to the general intention.\n\n### [That Allah Preserved the World to Maintain Praise Upon Him]\n\nKnow that Allah’s preservation (حفظ) of the world (العالم) is only to maintain the praise (الثناء) directed toward Him by the tongues of contingent beings (المحدثات), through declaring Him transcendent (التنزيه) above the state of need (الافتقار) that characterizes them. Thus, the preservation was not due to concern or care for the world, but rather so that the world might be His manifestation (مجلاه) and so that the rulings of His Names (أحكام أسمائه) might appear.\n\nLikewise, He created the human being upon His form, and said: <<And that there is not for man except what he strives for>> (<<وَأَنْ لَيْسَ لِلْإِنْسَانِ إِلَّا مَا سَعَى>>). Thus, He made him strive only for himself. For this reason, He coupled his striving with reward (الأجر), so that he strives for himself. This is unlike those who have no reward from the higher or lower worlds. There is no rank in the knowledge of Allah higher than that of the Messengers (الرسل). They are the ones who guide and alert others. Yet, there is no Messenger who was not told to say to his community: <<I ask you no reward for it>> (<<مَا أَسْأَلُكُمْ عَلَيْهِ>>)—that is, for what I have conveyed to you—<<My reward is only upon Allah>> (<<إِنْ أَجْرِيَ إِلَّا عَلَى اللَّهِ>>). For He is the One who employed and sent him, so the reward is upon Him. They did not strive or convey except for the benefit of their own souls.\n\nHowever, the difference between the elite (العماء) among the People of Allah (أهل الله) and the common people (العامة) is that the elite know what the reward is, who owns it, who seeks it from them, who does not seek it, and to whom that ruling returns. Every striver in any matter strives only for himself, whoever that striver may be; no striver is excluded from another. Rather, the entire matter belongs to Allah.\n\nRewards differ according to intentions (المقاصد). The highest of these is the love of praise and commendation (المدح والثناء), for this is a Divine Attribute (صفة إلهية), and it was for this reason that Allah brought the world into existence, speaking His glorification with His praise. Below that reward is the seeking of increased knowledge of created things (الكوائن). Below that reward is what nature seeks from the spiritual powers (القوي الروحانية) due to the frequent occurrence of emotional response from them. And below that is what nature seeks from the sensory powers (القوي الحسية) merely for the pleasure enjoyed by the animal spirit. There is no reward sought beyond this. Thus, every striving we have mentioned is a benefit (حظ) for the striving soul.\n\nIf you know Allah’s preservation of the world, you understand His saying, <<sailing under Our eyes>> (<<تَجْرِي بِأَعْيُنِنَا>>), which is plural, and His saying, <<for indeed you are under Our eyes>> (<<فَإِنَّكَ بِأَعْيُنِنَا>>), which is also plural. Thus, every preserver (حافظ) of anything in the world is an Eye of the Real (عين الحق), since preservation can only come from one who cannot be overcome regarding what he preserves, nor overpowered in his preservation. Be a preserver of that by which you exist, and you will be the Eye of the Real (عين الحق) in His Existence (وجوده). The preservers of the world hold this station, yet they do not know that they are the Eyes of the Real. This is so that the superiority of the People of Witnessing (أهل الشهود) and Existence (الوجود) over others may be known, even though they share the attribute. But the one who knows his station in the Divine Presence (حضرة الحق) is not like the one who does not know.\n\n<<Say: Are those who know equal to those who do not know? Only those of understanding will remember>> (<<قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ>>). This is an announcement that they knew, but then forgetfulness (النسيان) overtook some of them. Among them are those upon whom the ruling of forgetfulness persisted, so <<they forgot Allah, and He forgot them>> (<<نَسُوا اللَّهَ فَنَسِيَهُمْ>>). And among them are those who remembered and thus recalled, and they are the People of Understanding (أولو الألباب).\n\nThe core (لب) of the intellect (العقل) is that by which nourishment occurs for the intelligent ones (العقلاء). They are the people who utilize what ought to be utilized. This is contrary to the people of mere intellects (أهل العقول), for they are people of a shell (قشر) whose core has departed, which was taken by the People of Understanding (أولو الألباب). They understood, but they did not utilize what ought to be utilized, because the intellect is only utilized when it is a shell containing a core. The utilization of the intellect, with its attribute of receptivity to what comes from Allah, is something that the intellect without a core cannot accept in terms of its thought. For this reason, the People of Allah (أهل الله) are the People of Understanding (أهل الألباب), because the core (اللب) is nourishment for them, so they utilized that by which their existence is sustained. The people of intellect (أهل العقل) are those who comprehend the matter as it is, provided their consideration is based on evidence. If they comprehend that, they are possessors of intellect. If they utilize it according to what the utilization of that comprehensible thing requires, then they are possessors of the core (أصحاب لب).\n\n> And in the core is the core of the fat, if you but know / And in the fat are Divine Sustenances (أمداد) for the one who understands.\n\nWhoever among contingent beings (المحدثات) is granted understanding (الفهم) has been granted knowledge (العلم), but not everyone granted knowledge is a possessor of understanding. Understanding is a high degree among contingent beings. By it, the Knowledge of the Real (علم الحق) is separated from the knowledge of creation (علم الخلق), for Allah possesses Knowledge (العلم) but is not described by Understanding (الفهم). The contingent being is described by both Understanding and Knowledge.\n\nIt is through understanding from Allah that differentiation occurs among the Gnostics of Allah (العلماء بالله). Understanding is specifically related to the formal Divine Sustenance (الإمداد الإلهي الصوري). If the Sustenance is non-formal, it is Knowledge, and there is no ruling for Understanding, because it has no relation except in this Presence (الحضرة). For this reason, the recipient is called an acquirer (مستفيد) of what he acquired through his understanding, since it is not valid for an acquirer to acquire knowledge without a state of transition from the place of the knowing teacher to the place of the learner. Thus, he only acquired it through his understanding. The teacher creates the forms of what he intends to teach the seeking learner, and the acquirer gains understanding from him. Were it not for the power of understanding, he would not acquire knowledge.\n\nJust as <<darkness and light are not equal>> (<<لَا تَسْتَوِي الظُّلُمَاتُ وَلَا النُّورُ>>), nor <<the shade and the heat>> (<<وَلَا الظِّلُّ وَلَا الْحَرُورُ>>), nor <<the living and the dead>> (<<وَلَا الْأَحْيَاءُ وَلَا الْأَمْوَاتُ>>), likewise the blind person—who does not understand and thus does not know—is not equal to the seeing person—who understands and thus knows. Just as <<the good deed and the evil deed are not equal>> (<<لَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ>>), so too the Real (الحق) and the creation (الخلق) are not equal, for <<there is nothing like unto Him>> (<<لَيْسَ كَمِثْلِهِ شَيْءٌ>>). Know this, <<and He is the All-Hearing, the All-Seeing>> (<<وَهُوَ السَّمِيعُ الْبَصِيرُ>>).\n\nHe made things ambiguous (أبهم), thus bewildering intellects and understandings between declaration (الإعلام) and ambiguity (الإبهام). However, since Mercy is comprehensive, the Real deals with them according to what their striving leads them to, whether they were correct in that or missed the path of intentional placement, for there is no error from this perspective in the higher world. What we mentioned is the attribution of something to other than what it is attributed to in reality, like someone seeking a thing through a cause not designated for it. Such a person receives the reward for the seeking, but not the reward for the attainment, because he did not attain it; he is like one seeking a burning ember in water. Thus, ambiguity (الإبهام) was the very essence of Divine Subtlety (المكر الإلهي).\n\nThe Gnostic (العالم) connects the branches (الفروع) to their roots (أصولها) based on insight (بصيرة) and unveiling (كشف). The one for whom the matter is ambiguous connects the branches to the roots, and if they correspond to their roots, it is by coincidence, and he imagines that they are the root for that branch. If it coincides, it is called sound imagination (خيالا صحيحا); if it does not coincide, it is called corrupt imagination (خيالا فاسدا). Were it not for ambiguity, understanding (الفهم) would not be needed. It is a power that operates only in ambiguous possibilities (المبهمات الممكنات) and obscure matters.\n\nThe possessor of understanding needs knowledge of the stations (المواطن). If the Divinely established Balance (الميزان) is in his hand, he recognizes Allah’s Subtlety (مكر الله) and distinguishes it. Despite this, he is not secure from it in the future, because he belongs to the realm of existence (النشأة) that accepts heedlessness (الغفلات), forgetfulness (النسيان), and the failure to recall knowledge of a thing at all times.\n\nThere is no benefit in connecting the branches to their roots unless the branches possess the ruling of the roots. The root of the world’s existence (وجود العالم) is the Existence of the Real (وجود الحق). Therefore, the world has the ruling of the Existence of the Real, which is necessity (الوجوب) insofar as it is necessity. That necessity then divides into necessity by Essence (وجوب بالذات) and necessity by other (وجوب بالغير)—this is another matter.\n\nLikewise, the root of the knowledge of Allah (العلم بالله) is the knowledge of the self (العلم بالنفس). Therefore, the knowledge of Allah has the ruling of the knowledge of the self, which is its root. The knowledge of the self is a shoreless sea according to those who know the self, so knowledge of it is limitless. This is the ruling of self-knowledge. The knowledge of Allah, which is a branch of this root, is attached to it in ruling, so the knowledge of Allah is also limitless. Thus, in every state, he says: <<My Lord, increase me in knowledge>> (<<رَبِّ زِدْنِي عِلْمًا>>). And Allah increases him in knowledge of his self so that he may increase in knowledge of his Lord. This is granted by Divine Unveiling (الكشف الإلهي).\n\nSome thinkers (أصحاب الأفكار) have held that the knowledge of Allah is the root of the knowledge of the self. This is never valid concerning the creation’s knowledge of Allah. That is only true concerning the Knowledge of the Real (علم الحق) specifically, where it is a precedence and a root by rank (بالمرتبة), not by existence (بالوجود). For, in terms of existence, His knowledge of Himself is identical to His knowledge of the world. Even if it is a root by rank, it is not so by existence, just as you say in the rational consideration of the cause (العلة) and the effect (المعلول), even though they coexist in existence, and it must be so. It is known that the rank of the cause precedes the rank of its effect rationally, not existentially. The same applies to correlatives (المتضايفان) insofar as they are correlatives—and this is more complete for our purpose—for each correlative is a cause and an effect for the one to whom the correlation applies. Each is a cause for that which is its effect, and an effect for that which is its cause. Thus, the causality of sonship necessitates that fatherhood be its effect, and the causality of fatherhood necessitates that sonship be its effect. But in terms of their immutable essences (أعيانهما), there is neither cause nor effect.\n\nKnow that related to this chapter is the fact that the world (العالم) is the family (عيالا) of Allah the Exalted, and He has taken some of it as His people (أهلا). The Prophet (peace be upon him) said in the reported tradition: \"Creation (الخلق) is the family of Allah (عيال الله).\" And he informed in another tradition that the People of the Quran are the People of Allah (أهل الله) and His chosen ones (خاصته).\n\nBeing 'people' (الأهلية) is a station of particularity and specialization derived from generality. He made the womb (الرحم), from which those possessing kinship (أولو الأرحام) appeared among us, a branch (شجنة) of the All-Merciful (الرحمن), just as the child is a branch of his parents. And He, glory be to Him, established a lineage (نسبا) between Himself and His servants, which is piety (التقوى). He will cast down the lineages of the world on the Day of Resurrection and raise His lineage, which is comprehensive, because there is no one there except those who fear Him and those who dared to transgress against Him. The latter dared to transgress because of the ruling of His attributes mentioned: pardon (العفو), overlooking (التجاوز), forgiveness (الصفح), and the universality of Mercy (عموم الرحمة). He made them witness these attributes.\n\nThese attributes have no effect whose ruling is generally apparent to every observer except in the case of sinners (العصاة), especially pardon (العفو). Every sinner only dared to transgress against Allah through it, and yet, in essence, he is pious toward Allah, for lineage (النسب) has no effect on states (الأحوال) if it is sound. Allah only considered the religious lineage (النسب الديني), and by it, inheritance (التوارث) occurs among people. If a person combines both religious lineage and earthly lineage (النسب الطيني), then he may withhold what is withheld from him by religious and earthly lineage. If he has no earthly lineage but has religious lineage, the ruling reverts to his religion; his inheritance from the religious lineage is not withheld by the earthly lineage, so the Muslims inherit from him, or if he is an unbeliever, the unbelievers inherit from him. If he possesses earthly lineage but no religious lineage, the Muslims inherit from him, for he has only departed from the religion of Allah the Exalted.\n\nThe lineage of piety (نسب التقوى) encompasses every sect and creed, if you understand. Insofar as the world is the family of Allah, He provides for them. Insofar as some of them are His people (أهل), He cares for them and shows compassion toward them. Insofar as they are created upon the Form (على الصورة) in a state of perfection, He appoints them as vicegerents (استنابهم). Insofar as some of them are upon a partial form, He treats them gently. And insofar as the aforementioned lineage is concerned, the Name al-Rahman (الرحمن) looks upon them with connection and the ordering of the whole. From every perspective, He looks upon them with beneficence (الإحسان). For this reason, He is named al-Barr (the Righteous/Beneficent), the Merciful (الرحيم), and al-Barr means the Benefactor (المحسان). This much is sufficient for discussing this station.\n\nLet us mention the sciences contained within it. Among them is the science of the best shapes; the science of the Books (الكتب) and their ranks; and the gnosis of the Manifest (المبين) among them, the Illuminating (المنير), the Wise (الحكيم), the Generous (الكريم), the Enumerated (المحصي), the Inscribed (المسطور), the Written (المرقوم), the Conceptual (المعنوي), the Sensory (الحسي), the Mother (الأم), the Imam (الإمام), and other categories of Books and the Writer. For Allah wrote the Torah with His Hand, and the Pen (القلم) wrote by itself, by the command of its Lord, upon the Preserved Tablet (اللوح المحفوظ). [Also included is] the rank of every writer and what was written of the inscription in the wombs (الأرحام)—these are the writers of creation (الخلق), provision (الرزق), term of life (الأجل), wretchedness (الشقاء), and felicity (السعادة)—and the Noble Scribes (الكرام الكاتبون). [Also included is] the difference between what is written in the Preserved Tablet and non-preserved tablets, parchment, and other materials, and the forms of Divine writing compared to others.\n\nAll of this is known from this station and witnessed by whoever enters it. [Also included is] the science of the inhabited part of the world (العالم) versus the uninhabited part; whether the uninhabited part is inhabited by things our eyes cannot perceive, or if it is truly uninhabited; and the inhabitation of places by what forms within them of plants, animals, minerals, or what descends into them of the Real (حق), angels (ملك), and jinn (جان). [Also included is] the difference between the Divine Name al-Ali (the High) and al-Rafi (the Exalter), and why the Name al-Rafi came restricted by addition (الإضافة) while al-Ali came absolute (مطلقا) without restriction. [Also included is] the science of how an opposite (الضد) transforms into its opposite when it exceeds its limit—is this due to its essence (جوهر) or the essence of its form? [Also included is] the science of the Divine Oath (الإيلاء الإلهي) by Himself, by existing things (الموجودات), and by non-existing things (المعدومات); and the science of the object of the oath (المقسم عليه) in its restriction to the past (which has occurred) or to the future (which must occur by ruling or exist by essence), and why the object of the oath is specified by the oath to the exclusion of others, even though it is one world. [Also included is] the science of Divine Decree (القضاء)—is there anything that repels it or not? And is that repelling factor from Him, or is it another matter necessitated by a condition, either by removal or by establishment? [Also included is] the science of the change of attributes (النعوت) upon those described by them—does change reside in the essence of every changing thing, or is the change in its ruling, not in its essence or its attribute, if it possesses an attribute? [Also included is] the science of the cause leading to denial (الجحد) despite knowledge, and that the denier is not placed in the rank of the ignorant person (الجاهل) in ruling; and whether the ignorant person is excused or not. [Also included is] the science of praiseworthy knowledge (العلم المحمود) versus blameworthy knowledge (العلم المذموم); and whether the blame is accidental (عرضي), having occurred to it from the known object (المعلوم), or whether it has no effect upon it, neither by accidental nor essential ruling. [Also included is] whether knowledge has a perceptible effect on the soul (النفس) and the senses, or if it has no effect except on the soul, like someone who knows that an inevitable calamity will befall him, so his temperament, color, and movement change, his tongue becomes confused, and he speaks without knowing what he says. Knowledge affects the soul through fear, and these effects are the effects of the presence of fear in him, not the effects of knowledge itself, because knowledge may occur in the soul of a strong person who controls himself, so it does not affect him with fear, and he does not change despite the presence of knowledge. [Also included is] the science of the matter by which the liar is punished—is he punished by a non-existent matter (أمر عدمي) due to the nature of lying, or is he punished by an existent matter (أمر وجودي) because lying has a rank of existence in mental existence (الوجود الذهني), and the liar expresses it accordingly? Is his punishment similar to its relation to the senses, making it a non-existent matter, or similar to its relation to the Imagination (الخيال), making it an imagined existent matter? These are wondrous sciences in the realm of Witnessing (المشاهدات), and the scholars of external forms (علماء الرسوم) and speculative thinkers (النظار) have no knowledge of these balances, due to their ignorance of the established Balance (الميزان) that Allah set up when raising the heaven and spreading the earth between the heaven and the earth, and that, despite being established, it is in the Hand of the Real, named Time (الدهر), which lowers and raises. [Also included is] the science of why magic (السحر) returns, and whether there is anything praiseworthy in it and what its effect is. [Also included is] the science of equality (السواء) in His saying, <<It is the same for them whether you warn them or do not warn them—they will not believe>> (<<سَوَاءٌ عَلَيْهِمْ أَأَنْذَرْتَهُمْ أَمْ لَمْ تُنْذِرْهُمْ لَا يُؤْمِنُونَ>>), and His saying, <<It is the same for them whether you ask forgiveness for them or do not ask forgiveness for them... If you ask forgiveness for them seventy times, Allah will never forgive them>> (<<سَوَاءٌ عَلَيْهِمْ أَسْتَغْفَرْتَ لَهُمْ أَمْ لَمْ تَسْتَغْفِرْ لَهُمْ ... إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ>>), and His saying, <<So endure patiently or do not endure patiently—it is the same for you>> (<<فَاصْبِرُوا أَوْ لَا تَصْبِرُوا سَوَاءٌ عَلَيْكُمْ>>). The context of this world (موطن الدنيا) where the seeking of forgiveness occurred implies acceptance, unlike the context of the Hereafter (موطن الآخرة). Just as warning and lack of warning were equal to them, so they did not believe, likewise in the Hereafter, the presence or absence of patience was equal for them, and thus did not affect the execution of the commensurate recompense (الجزاء الوفاق). [Also included is] the science of reliance upon other than Allah—of that which Allah praises reliance upon—and what its effect is in the Hereafter regarding the commensurate recompense. [Also included is] the science of the cause of marriage (النكاح) that does not result in procreation (التناسل), for the preservation of that species. [Also included is] the science of the cause of mutual exchange (المعاطاة) without need, since mutual exchange only occurs among those in need. [Also included is] the science of the presence of beneficence (الامتنان) alongside compensation (المعاوضة) in sales, but not in gifts (الهبات), because beneficence in gifts is rationally understood. For this reason, requital (المكافاة) was legislated for it, so that the dominion of beneficence might be weakened. [Also included is] the cause that removes beneficence from the world, and for whom beneficence is appropriate alongside compensation. [Also included is] the science of the difference between soothsaying (الكهانة) and Revelation (الوحي). [Also included is] the science of what passion (الهوى) is, and the intellect (العقل) that opposes it. [Also included is] the science of where the world was created from—was it from something or from nothing? [Also included is] the science of whether spirits (الأرواح) differ in power, so that some affect others, like physical powers, or not. [Also included is] the science of the Divine Treasuries (الخزائن الإلهية), what is stored within them, and where they are located. [Also included is] the science of the 'Nearness' (عندية) of the Real—is it a relation (نسبة) or an existential locus (ظرف وجودي)? [Also included is] the science of the ascent (ترقي) of the natural world—upon what ladder (معراج) does it occur? Is it upon a natural ladder, thus requiring another ladder, or upon a non-natural one? [Also included is] the science of the form of the influence of subtle meanings (المعاني اللطيفة) upon dense bodies (الأجرام الكثيفة). [Also included is] the science of the influence of intention (القصد) upon actions. [Also included is] the science of the attributes (الصفات) that are appropriate for the God. [Also included is] the science of the reason for the failure of expectations (خيبة الظنون) at certain times but not others. [Also included is] the science of the states of Transcendence (التنزيه).\n\nThis is some of the knowledge contained within this station. We have mentioned it so that the seeker’s resolve may be strengthened to seek it from Allah or from the one who knows it. And Allah <<speaks the Truth, and He guides to the way>> (<<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>>).",
    "ur": "باب تین سو بتیس: مقامات محمدیہ کے حاملین کے لیے الٰہی نگہبانی (الحراسة الإلهية) کے مقام کی معرفت میں، اور یہ مقام حضرت موسویہ سے ہے۔\n\n> ہر وہ شے جو کائنات کے دائرے کی طرف مائل ہوئی،\n> وہ ایک طور (پہاڑ) ہے، اور اس کی جمع اطوار ہے۔\n> اور وہ ذات حق (الحق) کی مہربانی ہے، اس کے سوا کچھ نہیں،\n> پس وہ ہماری ہستی (کون) میں ایک مستعار راز ہے۔\n> ہماری اعیان (حقائق) کا آغاز اسی سے ہوا، ایک ایسے وجوب کے لیے\n> جس میں عقل اور اضطرار (مجبوری) حکم کرتے ہیں۔\n> اگر ہستی (الوجود) ختم ہو جاتی تو وہ دائرہ نہ بنتی،\n> اسی لیے دانا کی عقل حیران رہ جاتی ہے۔\n\n### [بے شک اللہ موسیٰ کو طور کے جانب سے پکارتا ہے]\n\nجان لو، اللہ تمہیں قوت دے، کہ اللہ تعالیٰ حضرت موسیٰ علیہ السلام کے حق میں ہمیں آگاہ کرتے ہوئے فرماتا ہے: وَنَادَيْنَاهُ مِن جَانِبِ الطُّورِ الْأَيْمَنِ (اور ہم نے اسے طور کے دائیں جانب سے پکارا)۔\n\nپس اس نے پکار کو طور (پہاڑ) سے اس کے جھکاؤ (انحناء) کی وجہ سے بنایا، کیونکہ موسیٰ اپنے اہل کے لیے آگ کی تلاش میں نکلے تھے، اس شفقت (حنو) کی وجہ سے جو انہیں ان لوگوں پر تھی جو جھکاؤ سے پیدا ہوئے تھے، یعنی ان کے اہل۔ کیونکہ عورت اصل میں پسلی سے پیدا کی گئی ہے، اور پسلی میں جھکاؤ ہوتا ہے۔ اور پسلیوں میں یہ جھکاؤ نشو و نما کی درستی اور ان احشاء (اندرونی اعضاء) کی حفاظت کے لیے ہے جن پر وہ جھکی ہوئی ہیں، تاکہ ان کا جھکاؤ ان تمام چیزوں کو شامل کر لے جو وہ اپنے اندر رکھتی ہیں، اور اس طرح ان کے تمام اجزاء کی حفاظت میں مساوات ہو جائے۔ اس کے برعکس اگر وہ غیر دائرہ نما شکل میں ہوتیں تو ان میں خالی زاویے باقی رہ جاتے جو اس حفاظت سے دور ہوتے جس کے لیے وہ پیدا کی گئی تھیں۔\n\nاور موسیٰ پر ظہور الٰہی (التجلی) ان کی ضرورت کی عین صورت میں واقع ہوا، پس انہوں نے آگ دیکھی کیونکہ وہ مطلوب تھی، اور انہوں نے اس کا قصد کیا، تو ان کے رب نے انہیں اس میں سے پکارا، حالانکہ انہیں اس کا علم نہ تھا، کیونکہ وہ اس چیز میں پوری طرح مشغول تھے جس کے لیے وہ نکلے تھے۔ یہی ہمارا قول ہے جو ہم نے اپنے ایک قصیدے میں جزء الزینبیات میں کہا ہے:\n\n> موسیٰ کی آگ کی طرح، وہ اسے اپنی ضرورت کی عین صورت دیکھتے ہیں،\n> اور وہ ذات حق (الحق) ہے، لیکن وہ اسے نہیں جانتے۔\n\n### [بے شک اللہ نے موجودات میں سے جو کچھ پیدا کیا، اسے خطی (سیدھی لکیر) تخلیق نہیں کیا، بغیر اس کے کہ اس میں دائرہ نما ہونے کا رجحان ہو]\n\nاور جان لو کہ اللہ نے جو کچھ بھی موجودات میں پیدا کیا ہے، اسے خطی (سیدھی لکیر) تخلیق نہیں کیا، بغیر اس کے کہ اس میں دائرہ نما ہونے کا رجحان ہو یا وہ اجسام اور معانی کے عالم میں دائرہ نما ہو۔ اور اللہ تعالیٰ نے آسمانوں کے بارے میں فرمایا، جو بلند ہیں، اور زمین کے بارے میں فرمایا، جو پست ہے، کیونکہ اس سے نیچے کوئی پست نہیں ہے، کہ لَا يَؤُودُهُ حِفْظُهُمَا (اور ان دونوں کی حفاظت اسے تھکاتی نہیں)۔ پس اس نے اپنی ذات کو ہر شے کا نگہبان (حفیظ) قرار دیا ہے۔ اور نگہبانی (حفظ) نگہبان کی طرف سے محفوظ پر شفقت (حنو) ہے۔ لہٰذا، اجسام کی ہر صورت کی شکل میں جھکاؤ (انحناء) ہوتا ہے، اور معانی اور ارواح میں شفقت (حنو) ہوتی ہے۔\n\nاب ہم اجسام کے دائرہ نما ہونے کی طرف مائل ہونے کی وجہ بیان کرتے ہیں: وہ یہ ہے کہ پہلی شکل جسے جسم نے قبول کیا وہ دائرہ نما تھی، جسے فلک (گردش کرنے والا) کہا جاتا ہے۔ اور اس فلک کی حرکت سے اجسام کا عالم، بلندی اور پستی میں، ظاہر ہوا۔ پس ان میں سے کچھ وہ ہیں جو اصل کی صورت پر ظاہر ہوئے، اور وہ ہر وہ شے ہے جس میں دائرہ نما ہونا مکمل ہو گیا اور دائرے کے دونوں سرے مل گئے۔ اور جو اس صورت سے ناقص رہا، اس میں لازماً دائرہ نما ہونے کا رجحان پایا جاتا ہے، جو اجسام میں حسی طور پر ظاہر ہوتا ہے، یہاں تک کہ درختوں کے پتوں، پتھروں، پہاڑوں اور شاخوں میں بھی۔ پس عالم اجسام میں کوئی خط (سیدھی لکیر) ایسا نہیں جو مائل نہ ہو، مگر صرف فرض اور وہم کی بنا پر، نہ کہ وقوع کی بنا پر۔\n\nاور جسم دائرہ نما صورت میں ظاہر ہوا، یعنی وہ کلی جسم جو شکل کے ساتھ ظاہر ہوا، کیونکہ اللہ نے چاہا کہ وہ خلاء (خالی جگہ) کو اس سے بھر دے۔ اگر وہ دائرہ نما شکل کا نہ ہوتا تو خلاء میں وہ جگہ باقی رہ جاتی جہاں پُر نہ ہوتا۔ اور خلاء ایک وہمی دائرہ ہے جو کسی جسم میں نہیں ہے۔ اور یہ معاملہ اسی طرح واقع ہوا ہے کہ اشیاء کا اللہ سے صادر ہونا اور اس کی طرف لوٹنا۔ اسی سے آغاز ہوا اور اسی کی طرف لوٹنا ہے۔ لہٰذا، اس معاملے کو عالم شکل میں دائرے کی صورت میں ہونا ضروری ہے، کیونکہ وہ اسی راستے پر واپس نہیں لوٹتا جس سے وہ نکلا تھا۔ بلکہ اس کا پھیلاؤ اپنے مبداء (آغاز) پر ختم ہوتا ہے، اور یہ خطی شکل میں نہیں ہو سکتا، کیونکہ اگر ایسا ہوتا تو وہ کبھی اس کی طرف واپس نہ لوٹتا، حالانکہ وہ اس کی طرف لوٹنے والا ہے۔ لہٰذا، اس میں معنی اور حس دونوں میں دائرہ نما ہونا ضروری ہے۔\n\nاور عالم کی تخلیق اس صورت پر ہے کہ اس نے اسے دائرہ نما شکل میں پیدا کیا۔ پس اللہ کی حکمت میں غور کرو۔ اور چونکہ مرجع اسی کی طرف ہے تاکہ وہ شفقت (حنو) ظاہر ہو جس کی صورت جھکاؤ (انحناء) ہے، اسی لیے اس کی رحمت تمام موجودات پر عام ہوئی اور ہر شے کو گھیر لیا، جیسا کہ اس نے كُلَّ شَيْءٍ رَّحْمَةً وَعِلْمًا (ہر چیز کو رحمت اور علم سے گھیر لیا)۔ اور اس الٰہی اور رحمانی وسعت میں غضب کا کوئی ذکر نہیں ہوا۔ لہٰذا، عالم کا رحمت کی طرف مائل ہونا ضروری ہے، کیونکہ عالم کا اللہ کی طرف لوٹنا ضروری ہے۔ بے شک وہ فرماتا ہے: وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ (اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں)۔ پس جب اس کا لوٹنا اس پر ختم ہو گا، تو معاملہ آغاز کی طرف لوٹ جائے گا، اور مبداء (آغاز) اور مبدئ (آغاز کرنے والا) رحمت ہے جو ہر شے پر وسیع ہے۔ اور مبدئ نے كُلَّ شَيْءٍ رَّحْمَةً وَعِلْمًا (ہر چیز کو رحمت اور علم سے گھیر لیا)۔ پس لوٹنے کے معاملے کو رحمت میں پہچان لو، تو تم اللہ کی مخلوق پر عذاب کے دائمی ہونے سے محفوظ ہو جاؤ گے۔\n\nتم اس شہود (الشہود) سے کہاں ہو؟ اگر یہ شامل اور عام احسانی رحمت (الرحمة الشاملة العامة الامتنانية) سبقت نہ لے جاتی، تو عذاب ان لوگوں پر دائمی ہو جاتا جو اللہ کی رحمت کو اس وسعت سے خارج کرتے ہیں جس کا اللہ نے ذکر کیا ہے۔ لیکن رحمت کی سبقت نے اسے اس اعتقاد کے باوجود اللہ کی طرف سے ایسی رحمت ظاہر کرنے پر مجبور کیا جس کا وہ گمان بھی نہیں کر سکتا تھا۔ پس اللہ نے اسے اس کی جہالت پر نہیں پکڑا، کیونکہ وہ اپنے فہم میں شبہ کا شکار ہے۔ پس اس کی بصیرت کی آنکھ اندھی ہے اور اس کی عقل جہالت کی قید میں محبوس ہے۔\n\nاور حیوانات میں سے جو اپنے مسکن میں چلتے ہیں اور اپنے گھر کو آباد کرتے ہیں اور اپنی صورت کو عالم کی شکل پر قائم کرتے ہیں، جیسے شہد کی مکھی، تو اس نے اپنے گھروں کی صورت کو مسدس (چھ کونوں والی) بنایا تاکہ کوئی خلاء باقی نہ رہے، جیسا کہ کروی شکل نے خلاء کو بند کر دیا اور کوئی خلاء باقی نہ رہا۔ اور اس نے اپنے گھر کو شہد سے آباد کیا جو لذیذ ہے، جو اس الٰہی رحمت کے مشابہ ہے جس نے ہستی (الوجود) کو عام کیا اور اسے ڈھانپ لیا۔ اور اس نے اسے دوسروں کے حق میں آباد نہیں کیا، بلکہ اپنے حق میں آباد کیا۔ اور اسی طرح عالم بھی اسی صورت پر صادر ہوا ہے۔ پس عالم میں کوئی شے ایسی نہیں جو يُسَبِّحُ بِحَمْدِهِ (اس کی حمد کے ساتھ تسبیح نہ کرتی ہو)۔ پس اس نے اسے اپنے لیے ہی پیدا کیا، کیونکہ اسے صرف اسی نے مشغول رکھا۔\n\nاور اس نے ان لوگوں کے بارے میں فرمایا جن میں ایسی استعداد رکھی گئی کہ وہ اپنے لیے اور غیر اللہ کے لیے کوشش کر سکتے ہیں، تو اس نے متنبہ کیا کہ اس نے انہیں صرف اپنی عبادت کے لیے پیدا کیا: وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ (اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا ہے)۔ پس ان میں سے بعض کا وہ کام نہ کرنا جس کے لیے وہ پیدا کیے گئے، اس سے یہ لازم نہیں آتا کہ وہ اس چیز کے لیے پیدا کیے گئے جس میں انہوں نے تصرف کیا۔ اسی لیے ان سے سوال کیا جائے گا اور حساب لیا جائے گا، جیسا کہ اس شہد کی مکھی کے معاملے میں ہوا جس نے اپنے لیے ذخیرہ کیا اور اسے اپنی ذات کے قیام کے لیے ظاہر کیا، تو جس نے اسے لیا، اس نے اس میں تصرف کیا، اس مقصد کے علاوہ جس کے لیے اسے پیدا کیا گیا تھا۔\n\nاور چونکہ معاملہ شہد کی مکھی کے بارے میں ایسا ہی ہے، نہ کہ دوسروں کے بارے میں، اسی لیے اللہ نے ہمیں اس کے بارے میں خبر دی کہ اس نے اسے وحی کی، نہ کہ دوسرے حیوانات کو۔ اور اس نے اس کے بارے میں فرمایا: يَخْرُجُ مِن بُطُونِهَا (جو اس کے پیٹوں سے نکلتا ہے) کہ وہ شِفَاءٌ لِّلنَّاسِ (لوگوں کے لیے شفا ہے)۔ پس اس نے اسے اس رحمت کے مقام پر اتارا جس نے ہر شے کو گھیر لیا۔ اور اس نے اس کے لیے کسی نقصان کا ذکر نہیں کیا، اگرچہ بعض مزاجوں کو اس کا استعمال نقصان دیتا ہے، لیکن اس کا ذکر نہیں کیا گیا، یعنی اس کا مقصود وجود کے لحاظ سے شفا ہے، جیسا کہ بارش کا مقصود رزق کا وجود ہے جو اس کے نزول سے مقصود ہوتا ہے، اگرچہ بارش ضعیف فقیر شیخ کا گھر گرا دے۔ پس اس خاص جہت سے یہ اس کے حق میں رحمت نہ تھی، لیکن یہ وہ عام مقصود نہیں تھا جس کے لیے بارش نازل ہوئی تھی۔ بلکہ جو کچھ ہوا وہ قبول کرنے والے کی استعداد کی وجہ سے تھا کہ وہ کمزور عمارت کی وجہ سے گر جائے۔ جیسا کہ شہد کھانے والے کو پہنچنے والا نقصان اس کے مزاج کی استعداد کی وجہ سے تھا، نہ کہ عام مقصود کی وجہ سے۔\n\n### [بے شک اللہ نے عالم کو اس پر ثناء (تعریف) باقی رکھنے کے لیے محفوظ رکھا]\n\nاور جان لو کہ اللہ کا عالم کو محفوظ رکھنا صرف اس لیے ہے کہ محدثات (نئی پیدا ہونے والی اشیاء) کی زبان سے اس کی ثناء (تعریف) باقی رہے، اس فقر سے پاکیزگی کے ساتھ جس پر وہ ہیں۔ پس یہ نگہبانی (حفظ) عالم کی اہمیت یا عنایت کی وجہ سے نہیں تھی، بلکہ اس لیے تھی کہ وہ اس کا مظہر (مجلیٰ) بنے اور اس کے اسماء کے احکام ظاہر ہوں۔ اور اسی طرح انسان کو اپنی صورت پر پیدا کیا، پس فرمایا: وَأَن لَّيْسَ لِلْإِنسَانِ إِلَّا مَا سَعَىٰ (اور یہ کہ انسان کے لیے وہی ہے جو اس نے کوشش کی)۔ پس اس نے اسے ایسا بنایا کہ وہ صرف اپنے لیے کوشش کرتا ہے۔ اسی لیے اس کی کوشش کے ساتھ اجر کو جوڑ دیا تاکہ وہ اپنے لیے کوشش کرے۔ اس کے برعکس عالم بالا اور عالم اسفل میں سے وہ لوگ جن کے لیے کوئی اجر نہیں ہے۔\n\nاور رسولوں اور اللہ کے علم میں ان کے مرتبے کے بعد کوئی مرتبہ نہیں ہے، پس وہ راستہ دکھانے والے اور متنبہ کرنے والے ہیں۔ اس کے باوجود، ان میں سے ہر رسول سے کہا گیا کہ اپنی امت سے کہو: مَا أَسْأَلُكُمْ عَلَيْهِ (میں تم سے اس پر کوئی اجر نہیں مانگتا) یعنی جو میں نے تمہیں پہنچایا، إِنْ أَجْرِيَ إِلَّا عَلَى اللَّهِ (میرا اجر تو صرف اللہ پر ہے)۔ کیونکہ وہی ہے جس نے اسے استعمال کیا اور بھیجا، پس اجر اسی پر ہے۔ پس انہوں نے کوشش نہیں کی اور نہ ہی پہنچایا مگر اپنی جانوں کے حصوں کے لیے۔ لیکن اہل اللہ کے خواص اور عوام میں فرق یہ ہے کہ خواص نے جان لیا کہ اجر کیا ہے، اور اس کا مالک کون ہے، اور ان میں سے کون اسے طلب کرتا ہے اور کون نہیں کرتا، اور یہ حکم کس کی طرف لوٹتا ہے۔ پس ہر کوشش کرنے والا کسی معاملے میں صرف اپنے لیے کوشش کرتا ہے، خواہ وہ کوشش کرنے والا کوئی بھی ہو، کوئی کوشش کرنے والا دوسرے سے مستثنیٰ نہیں ہے۔ بلکہ تمام معاملہ اللہ کے لیے ہے۔\n\nاور اجر مقاصد کے اختلاف سے مختلف ہوتے ہیں۔ ان میں سب سے اعلیٰ تعریف اور ثناء (مدح والثناء) کی محبت ہے، کیونکہ یہ ایک الٰہی صفت ہے۔ اور اسی کی خاطر اللہ نے عالم کو پیدا کیا جو اس کی حمد کے ساتھ تسبیح کرتا ہے۔ اور اس سے کم اجر کوائن (مخلوقات) کے علم میں اضافہ طلب کرنا ہے۔ اور اس سے کم اجر وہ ہے جو طبیعت روحانی قوتوں سے طلب کرتی ہے، کیونکہ ان سے انفعال (اثر قبول کرنا) کثرت سے ہوتا ہے۔ اور اس سے کم وہ ہے جو طبیعت حسی قوتوں سے طلب کرتی ہے، صرف اس لذت کے لیے جو حیوانی روح کو اس سے حاصل ہوتی ہے۔ اور اس کے بعد کوئی اجر نہیں ہے جو طلب کیا جائے۔ پس ہم نے جس کوشش کا بھی ذکر کیا، وہ کوشش کرنے والی نفس کا حصہ ہے۔\n\nپس جب تم اللہ کے عالم کو محفوظ رکھنے کو جان لو گے، تو تم اللہ تعالیٰ کے اس قول کو جان لو گے: تَجْرِي بِأَعْيُنِنَا (وہ ہماری آنکھوں کے سامنے چلتی ہے)۔ پھر اس نے کثرت سے فرمایا: فَإِنَّكَ بِأَعْيُنِنَا (پس بے شک تم ہماری آنکھوں کے سامنے ہو)۔ پس عالم میں جو بھی کسی چیز کی نگہبانی (حفظ) کرتا ہے، وہ ذات حق (الحق) کی عین (آنکھ) ہے، کیونکہ نگہبانی صرف وہی کر سکتا ہے جو اپنے محفوظ پر غالب نہ ہو اور نہ ہی اس کی نگہبانی پر کوئی طاقت رکھے۔ پس تم اس چیز کے نگہبان بن جاؤ جو تم ہو، تو تم اس کے وجود میں ذات حق (الحق) کی عین بن جاؤ گے۔ پس عالم کے نگہبانوں کا یہ مقام ہے، حالانکہ وہ نہیں جانتے کہ وہ ذات حق (الحق) کی آنکھیں ہیں۔ اور یہ اس لیے ہے تاکہ اہل شہود (الشہود) اور ہستی (الوجود) کی فضیلت دوسروں پر معلوم ہو، اگرچہ صفت میں اشتراک واقع ہوا ہو۔ لیکن جو شخص ذات حق (الحق) کی بارگاہ میں اپنے مقام کو جانتا ہے، وہ اس شخص کی طرح نہیں ہے جو نہیں جانتا۔ قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ (کہو: کیا وہ لوگ جو جانتے ہیں اور وہ لوگ جو نہیں جانتے برابر ہو سکتے ہیں؟ بے شک نصیحت تو عقل والے ہی حاصل کرتے ہیں)۔\n\nیہ اس بات کا اعلان ہے کہ انہوں نے جانا، پھر ان میں سے بعض پر نسیان (بھول) طاری ہو گیا۔ پس ان میں سے کچھ وہ ہیں جن پر نسیان کا حکم جاری رہا، فَنَسُوا اللَّهَ فَنَسِيَهُمْ (تو انہوں نے اللہ کو بھلا دیا، تو اللہ نے انہیں بھلا دیا)۔ اور ان میں سے کچھ وہ ہیں جنہوں نے یاد کیا اور نصیحت حاصل کی، اور وہ أُولُو الْأَلْبَابِ (مغز عقل والے) ہیں۔ اور عقل کا مغز (لب) وہ ہے جس سے عقلمندوں کو غذا ملتی ہے۔ پس وہ اس چیز کے استعمال کے اہل ہیں جسے استعمال کرنا چاہیے۔ اس کے برعکس اہل عقول (صرف عقل والے) ہیں، کیونکہ وہ چھلکے والے ہیں جس سے مغز (لب) زائل ہو چکا ہے، جسے أُولُو الْأَلْبَابِ نے لے لیا۔ پس انہوں نے عقل کی، لیکن وہ استعمال نہیں کیا جسے استعمال کرنا چاہیے، کیونکہ عقل صرف اسی وقت استعمال ہوتی ہے جب وہ مغز پر چھلکا ہو۔ عقل کا استعمال اس قبولیت کی صفت کے ساتھ جو اللہ کی طرف سے آتی ہے، وہ ہے جسے وہ عقل قبول نہیں کرتی جس میں مغز نہ ہو، اس کی فکر کے لحاظ سے۔ اسی لیے اہل اللہ ہی أُولُو الْأَلْبَابِ (مغز والے) ہیں، کیونکہ مغز ان کے لیے غذا ہے۔ پس انہوں نے وہ استعمال کیا جس سے ان کا قیام ہے۔ اور اہل عقل وہ ہیں جو معاملے کو اس کی اصل حالت پر سمجھتے ہیں، اگر ان کا غور کسی دلیل میں ہو۔ پس جب وہ اسے سمجھ لیتے ہیں، تو وہ اصحاب عقل ہوتے ہیں۔ اگر وہ اسے اس کے استعمال کے تقاضے کے مطابق استعمال کریں، تو وہ اصحاب لب (مغز والے) ہیں۔\n\n> اگر تم جانتے ہو تو مغز میں تیل کا مغز ہے،\n> اور تیل میں ان لوگوں کے لیے امداد ہے جو سمجھتے ہیں۔\n\nپس جسے محدثات میں فہم (سمجھ) عطا ہوا، اسے علم عطا ہوا۔ اور ہر وہ شخص جسے علم عطا ہوا، وہ صاحب فہم نہیں تھا۔ پس فہم (الفهم) محدثات میں ایک اعلیٰ درجہ ہے، اور اسی سے ذات حق (الحق) کا علم خلق کے علم سے جدا ہوتا ہے۔ کیونکہ اللہ کے لیے علم ہے، اور وہ فہم سے متصف نہیں ہوتا۔ اور محدث (مخلوق) فہم اور علم دونوں سے متصف ہوتا ہے۔ اور اللہ کے بارے میں فہم میں ہی اللہ کے علماء کے درمیان فضیلت واقع ہوتی ہے۔ اور فہم کا تعلق خاص طور پر صوری الٰہی امداد (الإمداد الإلهي الصوري) سے ہے۔ پس اگر امداد غیر صوری ہو، تو وہ علم ہو گا، اور وہاں فہم کا کوئی حکم نہیں ہو گا، کیونکہ اس کا تعلق صرف اسی بارگاہ (الحضرة) میں ہے۔ اسی لیے اسے مستفید (فائدہ اٹھانے والا) کہا جاتا ہے، اس فہم کی وجہ سے جو اس نے حاصل کیا، کیونکہ مستفید کے لیے معلم عالم کے مقام سے متعلم کے مقام کی طرف منتقل ہوئے بغیر فائدہ اٹھانا درست نہیں ہے۔ پس اس نے صرف اپنے فہم سے فائدہ اٹھایا۔ پس معلم کے لیے ان صورتوں کو ایجاد کرنا ہے جن کی وہ طالب متعلم کو تعلیم دینا چاہتا ہے، اور مستفید کے لیے اس سے فہم حاصل کرنا ہے۔ اگر فہم کی قوت نہ ہوتی تو وہ فائدہ نہ اٹھاتا۔\n\nجیسا کہ الظُّلُمَاتُ وَلَا النُّورُ (اندھیرے اور نہ روشنی) اور وَلَا الظِّلُّ وَلَا الْحَرُورُ (اور نہ سایہ اور نہ دھوپ) اور وَلَا الْأَحْيَاءُ وَلَا الْأَمْوَاتُ (اور نہ زندہ اور نہ مردہ) برابر ہو سکتے، اسی طرح وہ اندھا جو فہم نہیں رکھتا اور جانتا ہے، اور وہ بصیر جو فہم رکھتا ہے اور جانتا ہے، برابر نہیں ہو سکتے۔ جیسا کہ لَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ (نیکی اور بدی برابر نہیں ہو سکتے)، اسی طرح ذات حق (الحق) اور خلق برابر نہیں ہو سکتے، کیونکہ لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں ہے)۔ پس جان لو، وَهُوَ السَّمِيعُ الْبَصِيرُ (اور وہ سننے والا، دیکھنے والا ہے)۔ پس اس نے مبہم رکھا، تو اس نے عقلوں اور فہموں کو اعلان اور ابہام کے درمیان حیران کر دیا۔ تاہم، چونکہ رحمت عام ہوئی، ذات حق (الحق) نے ان کے ساتھ اس کے مطابق معاملہ کیا جس تک ان کی اجتہاد نے انہیں پہنچایا، خواہ انہوں نے اس میں درستگی پائی یا وضع کے لحاظ سے قصد کے راستے میں غلطی کی۔ کیونکہ اس جہت سے عالم بالا میں کوئی غلطی نہیں ہے۔\n\nجو ہم نے ذکر کیا کہ کسی چیز کو اس کے غیر کی طرف منسوب کرنا جو درحقیقت اس سے منسوب نہیں ہے، جیسے وہ شخص جو کسی چیز کو اس سبب کے بغیر طلب کرتا ہے جو اس کے لیے مقرر کیا گیا ہے۔ پس اس کے لیے طلب کا اجر ہے، حصول کا اجر نہیں، کیونکہ اسے حاصل نہیں ہوا۔ پس وہ پانی میں آگ کا شعلہ طلب کرنے والا ہے۔ پس ابہام میں عین الٰہی مکر (المكر الإلهي) ہے۔ پس عالم بصیرت اور کشف (الکشف) کے ساتھ فروع کو ان کی اصولوں سے ملاتا ہے، اور جس پر ابہام ہے وہ فروع کو اصولوں سے ملاتا ہے۔ اگر وہ ان کے اصولوں کے موافق ہوں، تو یہ اتفاق کے حکم سے ہے، اور وہ گمان کرتا ہے کہ وہ اس فرع کا اصل ہے۔ پس اگر وہ موافق ہو جائے تو اسے صحیح خیال کہا جاتا ہے، اور اگر موافق نہ ہو تو اسے فاسد خیال کہا جاتا ہے۔ اگر ابہام نہ ہوتا تو فہم (الفهم) کی ضرورت نہ ہوتی۔ پس یہ ایک ایسی قوت ہے جو صرف مبہمات ممکنات اور امور کی گہرائیوں میں تصرف کرتی ہے۔\n\nاور صاحب فہم کو مقامات کی معرفت کی ضرورت ہوتی ہے۔ پس جب الٰہی میزان (الميزان الموضوع الإلهي) اس کے ہاتھ میں ہو، تو وہ اللہ کے مکر کو پہچانتا ہے اور اسے ممتاز کرتا ہے۔ اس کے باوجود، وہ مستقبل میں اس سے بے خوف نہیں ہوتا، کیونکہ وہ اس نشأة (وجود) کے اہل میں سے ہے جو غفلتوں، نسیان اور ہر وقت کسی چیز کے علم کو حاضر نہ رکھنے کو قبول کرتی ہے۔ اور فروع کو ان کے اصولوں سے ملانے کا کوئی فائدہ نہیں، مگر یہ کہ فروع کے لیے اصولوں کا حکم ہو۔ اور عالم کے وجود کا اصل ذات حق (الحق) کا وجود ہے۔ پس عالم کے لیے ذات حق (الحق) کے وجود کا حکم ہے، جو وجوب (ضروری ہونا) ہے، اس لحاظ سے کہ وہ وجوب ہے۔ پھر وجوب کا وجوب بالذات اور وجوب بالغیر میں تقسیم ہونا ایک اور معاملہ ہے۔\n\nاسی طرح اللہ کے علم کا اصل نفس کا علم ہے۔ پس اللہ کا علم، جو اس اصل کی فرع ہے، حکم میں اس سے ملحق ہوتا ہے۔ پس اللہ کا علم ختم نہیں ہوتا۔ پس ہر حال میں وہ کہتا ہے: رَبِّ زِدْنِي عِلْمًا (اے میرے رب! میرے علم میں اضافہ فرما)، تو اللہ اسے اپنے نفس کا علم بڑھاتا ہے تاکہ وہ اپنے رب کا علم بڑھائے۔ یہ الٰہی کشف (الکشف الإلهي) عطا کرتا ہے۔ اور بعض اہل افکار اس طرف گئے ہیں کہ اللہ کا علم نفس کے علم میں اصل ہے، لیکن خلق کے اللہ کے علم میں یہ کبھی درست نہیں ہو سکتا۔ بلکہ یہ صرف ذات حق (الحق) کے علم میں ہے، اور یہ مرتبے کے لحاظ سے تقدم اور اصل ہے، وجود کے لحاظ سے نہیں۔ کیونکہ وجود کے لحاظ سے اس کا اپنے نفس کا علم عین اس کا عالم کا علم ہے۔ اگرچہ مرتبے کے لحاظ سے وہ اصل ہے، لیکن وجود کے لحاظ سے نہیں، جیسا کہ تم عقلی نظر میں علت اور معلول کے بارے میں کہتے ہو، اگرچہ وہ وجود میں ساتھ ساتھ ہوں، اور ایسا ہی ہونا چاہیے۔ پس یہ معلوم ہے کہ علت کا مرتبہ معلول کے مرتبے پر عقلی طور پر مقدم ہوتا ہے، نہ کہ وجودی طور پر۔ اور اسی طرح متضائفین (باہمی تعلق رکھنے والے) اس لحاظ سے کہ وہ متضائفین ہیں، اور یہ اس چیز میں زیادہ مکمل ہے جو ہم چاہتے ہیں۔ کیونکہ متضائفین میں سے ہر ایک اس کے لیے علت اور معلول ہے جس کے ساتھ اضافہ قائم ہے۔ پس ہر ایک اس کے لیے علت ہے جس کے لیے وہ معلول ہے، اور معلول ہے اس کے لیے جس کے لیے وہ علت ہے۔ پس بنوت (بیٹا ہونے) کی علت نے ابوت (باپ ہونے) کے لیے لازم کیا کہ وہ اس کے لیے معلول ہو، اور ابوت کی علت نے بنوت کے لیے لازم کیا کہ وہ اس کے لیے معلول ہو۔ اور ان کی اعیان (حقائق) کے لحاظ سے نہ کوئی علت ہے اور نہ کوئی معلول۔\n\nاور جان لو کہ اس باب سے متعلق یہ ہے کہ عالم اللہ کا عیال ہے، اور بعض کو اس نے اہل (خاندان) بنایا ہے۔ پس آپ صلی اللہ علیہ وسلم نے وارد شدہ حدیث میں فرمایا: إِنَّ الْخَلْقَ عِيَالُ اللَّهِ (بے شک مخلوق اللہ کا عیال ہے)۔ اور ایک دوسری حدیث میں خبر دی کہ: أَهْلُ الْقُرْآنِ هُمْ أَهْلُ اللَّهِ وَخَاصَّتُهُ (اہل قرآن اللہ کے اہل اور اس کے خاص لوگ ہیں)۔ اور اہلیت عموم میں سے خصوص اور اختصاص کا مقام ہے۔ اور رحم (رحم مادر) جس سے ہم میں اولو الارحام (رشتہ دار) ظاہر ہوئے، اسے رحمن سے ایک شاخ (شجنة) بنایا، جیسا کہ اولاد اپنے والدین سے ایک شاخ ہے۔ اور اس سبحانہ و تعالیٰ نے اپنے اور اپنے بندوں کے درمیان ایک نسب (رشتہ) بنایا، اور وہ تقویٰ ہے۔ پس وہ قیامت کے دن عالم کے نسبوں کو مٹا دے گا اور اپنے نسب کو بلند کرے گا، پس وہ عام ہو گا، کیونکہ وہاں صرف وہی ہے جو اس سے ڈرتا ہے اور جو اس پر جرات کرتا ہے۔ اور اس کا اس پر جرات کرنا اس وجہ سے ہے جو اس نے عفو، درگزر، معافی اور عام رحمت کی صفت کے حکم سے ذکر کیا۔ پس اس نے انہیں ان صفات کا مشاہدہ کرایا۔ اور ان کا کوئی اثر نہیں جو ہر دیکھنے والے کے لیے عموماً ظاہر ہو، مگر گناہ گاروں میں، خاص طور پر عفو۔ پس ہر گناہ گار نے اللہ پر جرات صرف اسی کی وجہ سے کی۔ اور وہ اپنی ذات کے لحاظ سے اللہ سے ڈرنے والا ہے۔ کیونکہ نسب میں احوال کا کوئی اثر نہیں ہوتا اگر وہ صحیح ہو۔\n\nاور اللہ نے صرف دینی نسب کو ہی معتبر قرار دیا، اور اسی سے لوگوں کے درمیان وراثت واقع ہوتی ہے۔ پس جب کسی شخص میں دینی اور طینی (مٹی کا) نسب جمع ہو جائے، تو اس وقت اسے حق ہے کہ وہ دینی اور طینی نسب سے جو کچھ حجاب میں آتا ہے، اسے حجاب میں رکھے۔ اور اگر اس کا طینی نسب نہ ہو اور دینی نسب ہو، تو وہ اپنے دین کی طرف لوٹتا ہے۔ طینی نسب والے اس کی دینی نسب سے وراثت کو حجاب میں نہیں رکھتے۔ پس اسے مسلمان وارث بنتے ہیں، یا وہ کافر ہو، تو اسے کفار وارث بنتے ہیں۔ اور اگر وہ طینی نسب والا ہو اور اس کا دینی نسب نہ ہو، تو اسے مسلمان وارث بنتے ہیں۔ پس وہ صرف اس کے دین سے خارج ہوا ہے۔ بے شک تقویٰ کا نسب ہر نحلہ (فرقہ) اور ملت کو عام ہے، اگر تم عقل کرو۔\n\nپس اس لحاظ سے کہ عالم اللہ کا عیال ہے، اس نے انہیں رزق دیا۔ اور اس لحاظ سے کہ ان میں سے کچھ اس کے اہل ہیں، اس نے ان پر توجہ دی اور ان پر شفقت کی۔ اور اس لحاظ سے کہ وہ کامل صورت پر پیدا کیے گئے ہیں، اس نے انہیں اپنا نائب بنایا۔ اور اس لحاظ سے کہ ان میں سے بعض جزوی صورت پر ہیں، اس نے ان پر نرمی کی۔ اور مذکورہ نسب کے لحاظ سے، اسم الرحمن نے وصل اور شمل (اجتماع) کے انتظام کے ساتھ ان کی طرف نظر کی۔ پس ہر پہلو سے اس کی نظر ان کی طرف احسان کے ساتھ ہے۔ اسی لیے اسے البر الرحیم (نیک، رحم کرنے والا) کہا جاتا ہے۔ اور البر کا معنی المحسن (احسان کرنے والا) ہے۔\n\nیہ مقدار اس مقام کے بارے میں کلام کے لیے کافی ہے۔ اب ہم ان علوم کا ذکر کرتے ہیں جو اس میں شامل ہیں: ان میں سے بہترین اشکال کا علم ہے۔ اور کتب اور ان کے مراتب کا علم، اور ان میں سے مبین (واضح)، منیر (روشن)، حکیم (حکمت والا)، کریم (عزت والا)، محصی (شمار کرنے والا)، مسطور (لکھا ہوا)، مرقوم (نقش کیا ہوا)، معنوی (معنوی)، حسی (حسی)، ام (اصل)، امام (پیشوا) وغیرہ کی معرفت، کتب اور کتابت کی اقسام میں سے۔ کیونکہ اللہ نے تورات اپنے ہاتھ سے لکھی، اور قلم نے خود اپنے رب کے حکم سے لوح محفوظ میں لکھا۔ اور ہر کاتب کا مرتبہ، اور جو کچھ اس نے ارحام (رحم مادر) میں لکھا، اور وہ خلق، رزق، اجل، شقاوت اور سعادت کے کاتب ہیں، اور کراماً کاتبین (عزت والے لکھنے والے فرشتے)۔ اور لوح محفوظ میں لکھے ہوئے اور غیر محفوظ الواح، کاغذ وغیرہ میں لکھے ہوئے کے درمیان فرق۔ اور الٰہی کتابت کی صورتیں اور ان کے علاوہ۔ یہ سب کچھ اس مقام سے معلوم ہوتا ہے اور جو اس میں داخل ہوتا ہے وہ اس کا شہود (الشہود) کرتا ہے۔\n\nاور عالم کے آباد حصے کا علم، غیر آباد حصے سے، اور کیا غیر آباد حصہ ایسی چیزوں سے آباد ہے جنہیں ہماری آنکھیں نہیں دیکھ سکتیں، یا وہ درحقیقت آباد نہیں ہے؟ اور جگہوں کی آبادی ان چیزوں سے جو ان میں پیدا ہوتی ہیں، جیسے نباتات، حیوانات، یا معدنیات، یا جو حق، فرشتہ، اور جن ان میں نازل ہوتے ہیں۔ اور الٰہی اسم العلی (بلند) اور الرفیع (بلندی دینے والا) کے درمیان فرق، اور الرفیع اسم کیوں اضافت کے ساتھ مقید آیا اور العلی بغیر کسی قید کے مطلق آیا۔ اور ضد کا اپنی ضد میں کیسے پلٹ جانا، جب وہ اپنی حد سے تجاوز کر جائے، کیا یہ اس کے جوہر کے لحاظ سے ہے یا اس کی صورت کے جوہر کے لحاظ سے؟ اور اللہ کا اپنی ذات، موجودات اور معدومات کے ساتھ ایلاء (قسم) کا علم۔ اور جس پر قسم کھائی گئی ہے، اس کی ماضی (جو واقع ہو چکا ہے) یا مستقبل (جس کا حکم یا وجود کے لحاظ سے واقع ہونا ضروری ہے) کے ساتھ قید کا علم۔ اور کیوں مقسوم علیہ (جس پر قسم کھائی گئی) کو قسم کے ساتھ خاص کیا گیا، نہ کہ کسی اور کے ساتھ، حالانکہ وہ ایک ہی عالم ہے۔\n\nاور قضاء (فیصلہ) کا علم، کیا اسے کوئی رد کرنے والا ہے یا نہیں؟ اور وہ رد کرنے والا کیا اسی کی طرف سے ہے یا کوئی اور امر ہے جسے کسی شرط نے رفع یا ثبوت کے ساتھ لازم کیا؟ اور جن پر صفات لاگو ہوتی ہیں ان پر صفات کے بدلنے کا علم، کیا ہر بدلنے والے میں تبدیلی اس کی ذات کے ساتھ قائم ہوئی، یا تبدیلی اس کے حکم میں تھی نہ کہ اس کی عین میں اور نہ ہی اس کی صفت میں، اگر وہ صفت والا ہو۔ اور علم کے باوجود انکار (جحد) کی طرف لے جانے والے سبب کا علم، اور یہ کہ وہ حکم میں جاہل کے مقام پر نہیں اترتا۔ اور کیا جاہل معذور ہے یا نہیں؟ اور محمود (قابل تعریف) علم کا علم، مذموم (قابل مذمت) علم سے، اور کیا مذمت اس کے لیے ایک عرضی (عارضی) چیز ہے جو اسے معلوم سے لاحق ہوئی، یا اس میں اس کا کوئی اثر نہیں، نہ عرضی حکم سے اور نہ ذاتی سے؟ اور کیا علم کا نفس اور حس میں کوئی محسوس اثر ہوتا ہے یا اس کا اثر صرف نفس میں ہوتا ہے؟ جیسے وہ شخص جو جانتا ہے کہ اس پر کوئی مصیبت آنے والی ہے، تو اس کا مزاج، رنگ اور حرکت بدل جاتی ہے، اور اس کی زبان لڑکھڑانے لگتی ہے، اور وہ بولتا ہے اور نہیں جانتا کہ کیا بول رہا ہے۔ پس علم نے نفس میں خوف کے ذریعے اثر کیا، اور یہ آثار اس کے پاس خوف کے وجود کے آثار ہیں، نہ کہ علم کے آثار، کیونکہ علم کبھی اس قوی نفس میں بھی واقع ہوتا ہے جو اپنے نفس پر حکم کرتا ہے، تو وہ اس میں خوف کا اثر نہیں کرتا، پس علم کے وجود کے باوجود وہ نہیں بدلتا۔\n\nاور اس امر کا علم جس سے جھوٹے کو عذاب دیا جاتا ہے، اور کیا اسے کسی عدمی امر سے عذاب دیا جاتا ہے جو جھوٹ سے مناسبت رکھتا ہے، یا اسے کسی وجودی امر سے عذاب دیا جاتا ہے، کیونکہ جھوٹ کا ذہنی وجود (الوجود الذهني) میں ایک وجودی مرتبہ ہے، اور اس وقت جھوٹا اس کا اظہار کرتا ہے۔ پس کیا اس کی سزا حس سے اس کی نسبت کی طرح ہے، تو وہ عدمی امر سے ہو، یا خیال سے اس کی نسبت کی طرح ہے، تو وہ ایک وجودی متخیل امر سے ہو؟ اور یہ مشاہدات میں عجیب علوم ہیں، رسمی علماء اور نظریوں کے علماء کو ان موازنات کا علم نہیں ہے، کیونکہ وہ اس مقررہ میزان سے ناواقف ہیں جسے اللہ نے آسمان کو بلند کرنے اور زمین کو آسمان اور زمین کے درمیان بچھانے کے وقت مقرر کیا، اور یہ کہ وہ مقرر ہونے کے باوجود ذات حق (الحق) کے ہاتھ میں ہے جسے دہر (زمانہ) کہا جاتا ہے، وہ اسے پست کرتا ہے اور بلند کرتا ہے۔\n\nاور جادو (السحر) کا علم، کیوں وہ لوٹتا ہے، اور کیا اس میں کوئی محمود (قابل تعریف) چیز ہے اور اس نے کیا کیا؟ اور اللہ تعالیٰ کے اس قول میں مساوات (السواء) کا علم: سَوَاءٌ عَلَيْهِمْ أَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ (ان کے لیے برابر ہے، خواہ تم انہیں ڈراؤ یا نہ ڈراؤ، وہ ایمان نہیں لائیں گے)۔ اور اس کا قول: سَوَاءٌ عَلَيْهِمْ أَسْتَغْفَرْتَ لَهُمْ أَمْ لَمْ تَسْتَغْفِرْ لَهُمْ... إِن تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَن يَغْفِرَ اللَّهُ لَهُمْ (ان کے لیے برابر ہے، خواہ تم ان کے لیے مغفرت طلب کرو یا نہ کرو... اگر تم ان کے لیے ستر بار بھی مغفرت طلب کرو گے تو اللہ انہیں ہرگز نہیں بخشے گا)۔ اور اس کا قول: فَاصْبِرُوا أَوْ لَا تَصْبِرُوا سَوَاءٌ عَلَيْكُمْ (پس صبر کرو یا نہ کرو، تمہارے لیے برابر ہے)۔ اور دنیا کا وہ مقام جہاں استغفار واقع ہوا، وہ قبولیت کا تقاضا کرتا ہے، برخلاف آخرت کے مقام کے۔ پس جیسا کہ ان کے نزدیک ڈرانا اور نہ ڈرانا برابر ہو گیا، تو وہ ایمان نہیں لائے، اسی طرح آخرت میں ان کے حق میں صبر کا وجود اور عدم برابر ہو گیا، تو اس نے جزاء وفاق (مطابق بدلہ) کے نفاذ میں کوئی اثر نہیں کیا۔\n\nاور غیر اللہ پر بھروسہ کرنے کا علم، جس پر اللہ بھروسہ کرنے کی تعریف کرتا ہے، اس کا آخرت میں جزاء وفاق میں کیا اثر ہے؟ اور نکاح کے سبب کا علم جس سے نسل پیدا نہیں ہوتی، اس نوع کو باقی رکھنے کے لیے۔ اور ضرورت کے بغیر باہمی لین دین (المعاطاة) کے سبب کا علم، کیونکہ باہمی لین دین صرف ضرورت مند میں ہوتا ہے۔ اور بیع (خرید و فروخت) میں معاوضہ کے ساتھ احسان (الامتنان) کے وجود کا علم، نہ کہ ہبہ (تحفہ) میں، کیونکہ ہبہ میں احسان معقول ہے۔ اسی لیے اس پر مکافات (بدلہ) مشروع کی گئی تاکہ احسان کا غلبہ کمزور ہو جائے۔ اور وہ سبب جو عالم سے احسان کو ختم کرتا ہے، اور کس کے لیے معاوضہ کے ساتھ احسان کرنا مناسب ہے۔ اور کہانت (غیب گوئی) اور وحی کے درمیان فرق کا علم۔ اور یہ علم کہ خواہش (الہویٰ) کیا ہے اور اس کے مقابلے میں عقل کیا ہے۔ اور یہ علم کہ عالم کہاں سے پیدا ہوا، کیا کسی شے سے یا لا شے (کسی چیز سے نہیں) سے؟ اور یہ علم کہ کیا ارواح قوت میں ایک دوسرے سے افضل ہوتی ہیں، تو بعض کا بعض پر اثر ہوتا ہے، جیسے جسمانی قوتیں، یا نہیں؟ اور الٰہی خزانوں کا علم، اور جو کچھ ان میں ذخیرہ کیا گیا ہے، اور ان کا مقام کہاں ہے۔ اور ذات حق (الحق) کی عندیت (پاس ہونا) کا علم، کیا یہ ایک نسبت ہے یا ایک وجودی ظرف؟ اور عالم طبیعی کی ترقی کس معراج پر ہوتی ہے، کیا طبیعی پر، تو اسے بھی معراج کی ضرورت ہو گی، یا غیر طبیعی پر؟ اور لطیف معانی کا کثیف اجسام میں اثر کرنے کی کیفیت کا علم۔ اور افعال میں قصد (ارادے) کے اثر کا علم۔ اور وہ صفات جو الٰہ کے لیے ہونی چاہئیں، ان کا علم۔ اور بعض اوقات گمانوں کے ناکام ہونے کا سبب کا علم۔ اور تنزیہ (پاکیزگی بیان کرنا) کے احوال کا علم۔\n\nیہ ان علوم میں سے کچھ ہیں جو اس مقام میں شامل ہیں، ہم نے انہیں ذکر کر دیا ہے تاکہ طالب کی ہمت ان کے طلب کرنے پر اللہ سے یا ان کے جاننے والے سے پوری طرح متوجہ ہو۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و سی و دوم: در معرفت منزل حراست الهی برای اهل مقامات محمدیه، و این منزل از حضرت موسویه است.\n\nهر کس که به سوی استداره (گردش) هستی متمایل شود، *** او طور است و جمع آن اطوار (اطوار جمع طور) است.\nو آن (استداره) عطوفت الهی است و جز آن نیست، *** پس آن رازی است در هستی ما که عاریه داده شده است.\nآغاز اعیان ما به واسطه آن (استداره) برای وجوبی است *** که عقل و اضطرار در آن حکم می‌کنند.\nاگر هستی (الوجود) پایان می‌یافت، گردشی (کَور) در کار نبود، *** از این رو عقل خردمند حیران می‌ماند.\n\n[همانا خداوند موسی را از جانب طور ندا می‌دهد]\n\nبدان، خداوند تو را تأیید کند، که خدای تعالی در حق موسی علیه السلام می‌فرماید و ما را آگاه می‌سازد: «وَنَادَيْنَاهُ مِن جَانِبِ الطُّورِ الْأَيْمَنِ» (و او را از جانب راست کوه طور ندا دادیم). پس ندا را از طور (کوه) قرار داد به دلیل انحنای آن، زیرا موسی برای اهل خود در طلب آتش خارج شد، به سبب مهربانی (حنو) که نسبت به آنان داشت؛ مهربانی‌ای که انحنا بر کسی که از انحنا خلق شده است را به ارث گذاشت، و آن اهل او بودند، زیرا زن در اصل از دنده خلق شده است و دنده دارای انحناست. و انحنا در دنده‌ها برای استقامت نشأت و حفظ احشایی بود که دنده‌ها بر آن خم شده‌اند، تا انحنای آن همه آنچه را که در بر دارد فرا گیرد و اجزای آن در حفظ شدن برابر باشند. برخلاف حالتی که اگر دنده‌ها غیر مستدیر (غیر گرد) بودند، در آن زوایای خالی‌ای وجود داشت که از حفظی که برای آن خلق شده‌اند، دور می‌ماند. و تجلی (التجلی) برای موسی در عین صورت حاجت او واقع شد، پس آتشی دید زیرا مطلوب او بود و قصد آن کرد. پس پروردگارش او را از آن ندا داد، در حالی که موسی از آن بی‌خبر بود، زیرا تمام توجهش مصروف چیزی بود که برای آن خارج شده بود. و این همان سخن ما در قصیده‌ای از جزء زینبیات است:\n\nچون آتش موسی که آن را عین حاجت خود می‌بیند، *** و او (آتش) همان حق (الإله) است، اما موسی آن را درک نمی‌کند.\n\n[همانا خداوند آنچه را که از موجودات خلق کرده، خلقت خطی (مستقیم) نکرده است، مگر آنکه در آن میلی به سوی استداره (گردش) باشد]\n\nو بدان که خداوند آنچه را که از موجودات خلق کرده، خلقت خطی (مستقیم) نکرده است، مگر آنکه در آن میلی به سوی استداره (گردش) باشد یا در عالم اجسام و معانی مستدیر (گرد) باشد. و خدای تعالی درباره آسمان‌ها که برترند و زمین که فروتر است، زیرا فروتر از آنی نیست، فرمود: «لَا يَئُودُهُ حِفْظُهُمَا» (حفظ آن دو او را خسته نمی‌کند). پس خود را به این صفت توصیف کرد که برای هر چیزی حافظ است. و حفظ، مهربانی (حنو) حافظ بر محفوظ است. بنابراین، در شکل هر صورتی از اجسام انحنایی وجود دارد و در معانی و ارواح مهربانی (حنو) هست. پس سبب میل اجسام به استداره را ذکر می‌کنیم: و آن این است که اولین شکلی که جسم پذیرفت، استداره بود که فلک نامیده می‌شود، یعنی مستدیر. و از حرکت آن فلک، عالم اجسام در بالا و پایین ظاهر شد. پس برخی از آن‌ها به صورت ذات اصل ظاهر شدند، و آن هر چیزی است که استداره در آن کامل شده و دو طرف دایره به هم رسیده‌اند. و هر آنچه از این صورت ناقص باشد، ناگزیر در آن میلی به سوی استداره وجود دارد که این میل به صورت حسی در اجسام، حتی در برگ درختان، سنگ‌ها، کوه‌ها و شاخه‌ها، آشکار می‌شود. پس در عالم اجسام خطی غیر مایل وجود ندارد مگر به فرض و توهم، نه به وقوع. و جسم به صورت استداره، یعنی جسم کلی که به شکل ظاهر شده، پدیدار گشت، زیرا خداوند اراده کرد که خلأ را با آن پر کند. اگر شکل آن مستدیر نبود، در خلأ چیزی باقی می‌ماند که در آن پُری نبود. و خلأ، استداره‌ای موهوم است نه در جسم. و امر این‌گونه واقع شد که اشیاء از خداوند صادر می‌شوند و به سوی او باز می‌گردند؛ از او آغاز شد و به سوی او باز می‌گردد. پس ناگزیر این امر در عالم شکل، صورت دایره است، زیرا بر همان مسیری که خارج شده، به سوی او باز نمی‌گردد، بلکه امتداد آن به مبدأش منتهی می‌شود. و این در شکل خطی ممکن نیست، زیرا اگر خطی بود، هرگز به سوی او باز نمی‌گشت، در حالی که بازگشتنی است. پس ناگزیر استداره در آن، معناً و حساً، وجود دارد. و از خلقت عالم بر این صورت است که آن را مستدیر شکل آفرید. پس در حکمت خداوند بنگر. و چون مرجع به سوی اوست تا مهربانی (حنو) که صورتش انحناست، آشکار شود، از این رو رحمت او همه موجودات را فرا گرفت و همه چیز را وسعت داد، چنانکه خود او «كُلَّ شَيْءٍ رَحْمَةً وَعِلْمًا» (همه چیز را از نظر رحمت و علم) وسعت داد. و در این سعه الهی و رحمانی، ذکری از غضب به میان نیامد. پس ناگزیر عالم به سوی رحمت متمایل است، زیرا عالم باید به سوی خداوند بازگردد، چرا که اوست که می‌فرماید: «وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ» (و همه امور به سوی او بازگردانده می‌شود). پس هنگامی که بازگشت آن به سوی او پایان یابد، امر به آغاز و مبدأ باز می‌گردد. و مبدأ، رحمتی است که همه چیز را فرا گرفته است، و مبدِئ (آغازگر) «كُلَّ شَيْءٍ رَحْمَةً وَعِلْمًا» (همه چیز را از نظر رحمت و علم) وسعت داده است. پس امر را در بازگشتش در رحمت بشناس، تا از جاودانگی عذاب بر خلق خدا در امان باشی. اگر سبقت رحمت فراگیر، عام و امتنان‌آمیز نبود، کجا بودی از این شهود (الشهود)؟ عذاب بر کسی که رحمت خدا را از این سعه‌ای که خداوند ذکر کرده است، نفی می‌کند، جاودانه می‌شد. اما سبقت رحمت باعث شد که از جانب خداوند، رحمتی به او آشکار شود که با وجود این اعتقاد، هرگز گمان نمی‌کرد. پس خداوند او را به دلیل جهلش مؤاخذه نکرد، زیرا او در فهم خود صاحب شبهه است، پس چشم بصیرتش کور و عقلش در بند جهالت محبوس است. و در میان حیوانات، آنچه در مسکن خود و آبادانی خانه‌اش و برپایی صورتش بر شکل عالم عمل کرده، مانند زنبور عسل است که صورت خانه‌هایش را شش‌ضلعی ساخته تا خلأیی باقی نماند، همان‌گونه که شکل کُروی خلأ را مسدود کرد و خلأیی باقی نگذاشت. و خانه‌اش را با عسل آباد کرد که لذت‌بخش است، نظیر رحمت الهی که هستی (الوجود) را فرا گرفت و غرق کرد. و آن را برای حق غیر خود آباد نکرد، بلکه برای حق نفس خود آباد کرد. و همچنین عالم بر این صورت صادر شد. پس هیچ چیز در عالم نیست مگر آنکه «يُسَبِّحُ بِحَمْدِهِ» (با حمد او تسبیح می‌گوید). خداوند آن را برای نفس خود ایجاد کرد، زیرا جز به آن مشغول نشد. و درباره کسی که در او استعدادی قرار داد که می‌تواند برای خود و برای غیر خدا تلاش کند، متذکر شد که آن‌ها را جز برای عبادت خود نیافریده است، پس فرمود: «وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ» (و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند). اینکه برخی از آن‌ها آنچه را که برای آن خلق شده‌اند انجام نداده‌اند، به این معنا نیست که به قصد مذکور، برای آنچه در آن تصرف کرده‌اند خلق شده‌اند. و به همین دلیل مورد سؤال و محاسبه قرار می‌گیرند، همان‌گونه که در مورد آنچه زنبور برای خود ذخیره کرد و برای قوام ذاتش از خود ظاهر ساخت، واقع شد؛ پس کسی که آن را گرفت و در غیر آنچه برای آن ایجاد شده بود، در آن تصرف کرد. و چون امر در مورد زنبور عسل، برخلاف دیگر حیوانات، همان‌گونه بود که ذکر کردیم، از این رو خداوند درباره آن به ما خبر داد که به آن وحی کرد، نه به دیگر حیوانات. و درباره آنچه «يَخْرُجُ مِن بُطُونِهَا» (از شکم‌های آن خارج می‌شود) فرمود: «إِنَّهُ شِفَاءٌ لِّلنَّاسِ» (همانا در آن شفایی برای مردم است). پس آن را در منزلت رحمتی قرار داد که همه چیز را فرا گرفته است و ضرری برای آن ذکر نکرد، اگرچه استعمال آن برای برخی مزاج‌ها ضرر دارد، اما به آن اشاره نشد. یعنی مقصود از آن، شفا به واسطه وجود است، همان‌گونه که مقصود از باران، ایجاد رزق است که با قصد از نزول آن حاصل می‌شود، اگرچه باران خانه شیخ فقیر ضعیف را ویران کند. پس از این جهت خاص، در حق او رحمت نبوده است، اما این به قصد عامی که باران برای آن نازل شده، نیست. بلکه آنچه واقع شد، ناشی از استعداد پذیرنده برای ویرانی به دلیل ضعف بنا بود، همان‌گونه که ضرر وارد بر خورنده عسل، ناشی از استعداد مزاج او بود و به قصد عام نبود.\n\n[همانا خداوند عالم را حفظ کرد تا ثنای بر خود را باقی بدارد]\n\nو بدان که حفظ خداوند برای عالم، تنها برای باقی ماندن ثنا بر او به زبان موجودات حادث (المحدثات) است، با تنزیه از نیازمندی‌ای که بر آن هستند. پس حفظ نه به خاطر اهتمام به عالم بود و نه به خاطر عنایت، بلکه برای آن بود که عالم مَجلای او باشد و احکام اسمای او ظاهر شود. و همچنین انسان را بر صورت خود آفرید و فرمود: «وَأَن لَّيْسَ لِلْإِنسَانِ إِلَّا مَا سَعَى» (و اینکه برای انسان جز آنچه تلاش کرده، نیست). پس او را چنان قرار داد که جز برای خود تلاش نکند. و به همین دلیل، اجر را به تلاش او پیوند داد تا برای خود تلاش کند، برخلاف کسانی که در عالم بالا و پایین اجری ندارند. و پس از پیامبران و مرتبه آنان در علم به خداوند، مرتبه‌ای نیست. آنان کسانی هستند که سر به زیر افکنده‌اند (المطرقون) و هشداردهندگان (المنبهون) هستند. با این حال، هیچ پیامبری نیست مگر آنکه به او گفته شد: به امت خود بگو: «مَا أَسْأَلُكُمْ عَلَيْهِ» (من بر این [رسالت] از شما اجری نمی‌خواهم) یعنی بر آنچه به شما رساندم، «إِنْ أَجْرِيَ إِلَّا عَلَى اللَّهِ» (اجر من جز بر عهده خداوند نیست). زیرا اوست که او را به کار گرفته و فرستاده است، پس اجر بر عهده اوست. پس آنان تلاش نکردند و ابلاغ ننمودند مگر در بهره‌های نفس خود. اما فرق میان خواص (العماء) از اهل الله و عوام این است که خواص دانستند که اجر چیست و صاحب آن کیست و چه کسی آن را از آنان می‌طلبد و چه کسی نمی‌طلبد و آن حکم به چه کسی باز می‌گردد. پس هر تلاشگری در امری، تنها برای نفس خود تلاش می‌کند، هر که می‌خواهد باشد؛ هیچ تلاشگری از تلاشگر دیگر مستثنی نیست، بلکه امر همه از آن خداوند است. و اجرها با اختلاف مقاصد متفاوت می‌شود. بالاترین آن‌ها، دوست داشتن مدح و ثناست، زیرا این صفتی الهی است و به خاطر آن، خداوند عالم را آفرید که با تسبیح و حمد او سخن می‌گوید. و پایین‌تر از آن اجرها، طلب افزایش علم به کائنات است. و پایین‌تر از آن اجرها، چیزی است که طبیعت از قوای روحانی می‌طلبد، به دلیل وقوع انفعال زیاد از آن‌ها. و پایین‌تر از آن، چیزی است که طبیعت از قوای حسی می‌طلبد، تنها برای لذتی که روح حیوانی از آن می‌برد. و ورای این‌ها اجری نیست که طلب شود. پس هیچ تلاشی را ذکر نکردیم مگر آنکه بهره‌ای برای نفس تلاشگر است. پس هنگامی که حفظ خداوند برای عالم را دانستی، سخن خدای تعالی را دانستی که فرمود: «تَجْرِي بِأَعْيُنِنَا» (که زیر نظر ما روان بود) و سپس به صورت مفرد فرمود: «فَإِنَّكَ بِأَعْيُنِنَا» (پس تو زیر نظر ما هستی). پس هر حافظی در عالم، امری را حفظ کند، او عین حق (الحق) است، زیرا حفظ تنها از کسی صادر می‌شود که بر محفوظ خود مغلوب نشود و بر حفظ آن توانایی داشته باشد. پس حافظ چیزی باش که به واسطه آن هستی، تا عین حق (الحق) در وجود (الوجود) او باشی. پس حافظان عالم این منزلت را دارند، در حالی که نمی‌دانند که آنان اعین حق هستند. و این برای آن است که فضل اهل شهود (الشهود) و وجود (الوجود) بر غیر آنان دانسته شود، اگرچه در صفت اشتراک واقع شده باشد. اما کسی که منزلت خود را از حضرت حق می‌داند، مانند کسی نیست که نمی‌داند. «قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ» (بگو: آیا کسانی که می‌دانند و کسانی که نمی‌دانند برابرند؟ تنها خردمندان (اولوا الالباب) متذکر می‌شوند). این اعلامی است که آنان دانستند، سپس نسیان بر برخی از آنان عارض شد. پس برخی از آنان حکم نسیان بر آن‌ها مستمر شد: «نَسُوا اللَّهَ فَنَسِيَهُمْ» (خدا را فراموش کردند، پس خدا نیز آن‌ها را فراموش کرد). و برخی دیگر یادآوری کردند و متذکر شدند، و آنان همان اولوا الالباب (خردمندان) هستند. و لُبّ عقل همان چیزی است که غذای عاقلان به واسطه آن حاصل می‌شود. پس آنان اهل به کارگیری چیزی هستند که شایسته به کارگیری است. برخلاف اهل عقول، زیرا آنان اهل پوسته‌ای هستند که لُبّ آن از بین رفته است، پس اولوا الالباب آن را گرفتند و تعقل کردند، اما آنچه را که شایسته به کارگیری بود، به کار نبردند، زیرا عقل به کار گرفته نمی‌شود مگر آنکه پوسته‌ای بر لُبّ باشد. پس به کارگیری عقل با صفت قبول آنچه از جانب خداوند می‌رسد، چیزی است که عقلی که لُبّ ندارد، از جهت فکرش آن را نمی‌پذیرد. به همین دلیل، اهل الله همان اهل الألباب هستند، زیرا لُبّ برای آن‌ها غذاست، پس آنچه را که قوامشان به آن است، به کار بردند. و اهل عقل کسانی هستند که امر را بر همان صورتی که هست تعقل می‌کنند، اگر اتفاق افتد و نظرشان در دلیلی باشد. پس اگر آن را تعقل کردند، صاحبان عقل هستند. و اگر آن را بر حسب آنچه استعمال آن معقول اقتضا می‌کند، به کار بردند، پس صاحبان لُبّ هستند.\n\nو در لُبّ، لُبّ روغن است اگر بدانی، *** و در روغن، امدادهایی است برای کسی که می‌فهمد.\n\nپس هر کس که از موجودات حادث، فهم روزی‌اش شود، علم روزی‌اش شده است. اما هر کس که علم روزی‌اش شود، صاحب فهم نیست. پس فهم درجه‌ای عالی در موجودات حادث است و به واسطه آن، علم حق (الحق) از علم خلق جدا می‌شود. زیرا خداوند علم دارد و به صفت فهم متصف نمی‌شود، اما موجود حادث به فهم و علم متصف می‌شود. و در فهم از خداوند است که برتری میان عالمان به خدا واقع می‌شود. و فهم به طور خاص متعلق به امداد الهی صوری است. اگر امداد در غیر صورت باشد، علم است و حکم فهم در آنجا نیست، زیرا فهم جز در این حضرت (حضور) تعلقی ندارد. به همین دلیل، کسی که از فهم خود بهره می‌برد، مستفید نامیده می‌شود، زیرا برای مستفید صحیح نیست که بدون حالت انتقال از محل عالمِ آموزگار به محل متعلم، بهره‌ای ببرد. پس او جز از فهم خود بهره نبرده است. برای آموزگار، ایجاد صور آنچه می‌خواهد به طالب متعلم بیاموزد وجود دارد، و برای مستفید، فهمیدن از او. اگر نیروی فهم نبود، بهره‌ای نمی‌برد. پس همان‌گونه که «الظُّلُمَاتُ وَلَا النُّورُ وَلَا الظِّلُّ وَلَا الْحَرُورُ وَلَا الْأَحْيَاءُ وَلَا الْأَمْوَاتُ» (تاریکی‌ها و نور، و سایه و گرما، و زندگان و مردگان) برابر نیستند، همچنین کور که نمی‌فهمد و در نتیجه نمی‌داند، با بینا که می‌فهمد و در نتیجه می‌داند، برابر نیست. همان‌گونه که «لَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ» (نیکی و بدی برابر نیستند)، حق (الحق) و خلق نیز برابر نیستند، زیرا «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست)، پس بدان، «وَهُوَ السَّمِيعُ الْبَصِيرُ» (و او شنوای بیناست). پس مبهم ساخت و عقول و فهم‌ها را میان اعلام و ابهام حیران کرد. جز اینکه چون رحمت فراگیر شد، حق (الحق) با آنان بر اساس آنچه اجتهادشان به آن انجامید، رفتار کرد، چه در آن راه قصد را به درستی پیموده باشند و چه خطا کرده باشند. زیرا از این جهت در عالم بالا خطایی وجود ندارد، مگر آنچه ذکر کردیم از نسبت دادن چیزی به غیر آنچه در نفس‌الامر به آن نسبت داده شده است، مانند کسی که چیزی را از غیر سبب وضع شده برای آن می‌طلبد. پس او اجر طلب را دارد، نه اجر حصول را، زیرا حاصل نشده است. او در آب، شعله آتش می‌طلبد. پس در ابهام، عین مکر الهی بود. پس عالم، فروع را بر اصولشان بر اساس بصیرت و کشف (الکشف) ملحق می‌کند، و کسی که امر بر او مبهم است، فروع را به اصول ملحق می‌کند. اگر با اصولشان موافق بود، به حکم تصادف است، در حالی که او خیال می‌کند که آن اصل برای آن فرع است. پس اگر تصادف کرد، خیال صحیح نامیده می‌شود، و اگر تصادف نکرد، خیال فاسد نامیده می‌شود. اگر ابهام نبود، نیازی به فهم نبود. پس فهم نیرویی است که جز در مبهمات ممکنات و امور پیچیده تصرف نمی‌کند. و صاحب فهم نیاز به شناخت مواطن دارد. پس اگر میزان الهی وضع شده در دست او باشد، مکر خدا را می‌شناسد و آن را تمییز می‌دهد. با این حال، در آینده از آن ایمن نیست، زیرا او از اهل نشأتی است که غفلت‌ها و نسیان و عدم استحضار علم به شیء در هر زمان را می‌پذیرد. و فایده‌ای در الحاق فروع به اصولشان نیست، مگر اینکه فروع حکم اصول را داشته باشند. و اصل وجود عالم، وجود حق (الحق) است. پس عالم حکم وجود حق را دارد، و آن وجوب است از حیث آنچه وجوب است. سپس اینکه وجوب به وجوب بالذات و وجوب بالغیر تقسیم می‌شود، امری دیگر است. و همچنین اصل وجود علم به خداوند، علم به نفس است. پس علم به خداوند حکم علم به نفس را دارد که اصل آن است. و علم به نفس نزد عالمان به نفس، دریایی بی‌ساحل است، پس علم به آن پایان نمی‌پذیرد. این حکم علم به نفس است. پس علم به خداوند که فرع این اصل است، در حکم به آن ملحق می‌شود، پس علم به خداوند پایان نمی‌پذیرد. پس در هر حال می‌گوید: «رَبِّ زِدْنِي عِلْمًا» (پروردگارا، علم مرا زیاد کن)، پس خداوند علم او را به نفسش زیاد می‌کند تا علمش به پروردگارش زیاد شود. این را کشف (الکشف) الهی به او می‌دهد. و برخی از صاحبان افکار بر این رفته‌اند که علم به خداوند اصل در علم به نفس است، و این هرگز در علم خلق به خداوند صحیح نیست، بلکه این تنها در علم حق (الحق) است، و آن تقدم و اصل بودن به مرتبه است نه به وجود. زیرا به وجود، عین علم او به نفسش، عین علم او به عالم است، اگرچه به رتبه اصل است، اما به وجود نیست. همان‌گونه که در نظر عقلی درباره علت و معلول می‌گویی، اگرچه در وجود همگام باشند، و جز این نمی‌تواند باشد. پس معلوم است که رتبه علت بر رتبه معلول خود عقلاً مقدم است نه وجوداً. و همچنین متضایفان (دو امر متقابل) از حیث آنچه متضایف هستند، و این در آنچه ما می‌خواهیم کامل‌تر است. زیرا هر یک از متضایفان، علت و معلول برای کسی است که اضافه به او قائم شده است. پس هر یک علت برای کسی است که معلول اوست، و معلول برای کسی است که علت اوست. پس علت فرزندی (البنوة) ایجاب کرد که پدری (الأبوة) معلول آن باشد، و علت پدری ایجاب کرد که فرزندی معلول آن باشد. و از حیث اعیانشان، نه علت هستند و نه معلول. و بدان که از جمله آنچه به این باب تعلق دارد، این است که عالم عیال خدای تعالی است و برخی از آن را اهل خود قرار داده است.\n\nپس پیامبر (ص) در خبری که از او وارد شده فرمود: «إن الخلق عيال الله» (همانا خلق، عیال خداوند هستند). و در خبری دیگر خبر داد که: «أهل القرآن هم أهل الله وخاصته» (اهل قرآن، اهل خداوند و خاصان او هستند). و اهلیت، منزلت خصوص و اختصاص از عموم است. و رَحِم (زهدان) که اولوا الارحام (صاحبان خویشاوندی) از آن در میان ما ظاهر شدند، شاخه‌ای (شجنه) از رحمان قرار داده شد، همان‌گونه که فرزند شاخه‌ای از پدر و مادر خود است. و خداوند سبحان برای خود نسبی میان خود و بندگانش قرار داد و آن تقواست. پس در روز قیامت، نسب‌های عالم را فرو می‌نهد و نسب خود را بالا می‌برد، پس فراگیر می‌شود، زیرا در آنجا جز کسی که از او پروا کند و کسی که بر او جرأت ورزیده، نیست. و اینکه بر او جرأت ورزیده، به دلیل حکم نعت او به عفو، گذشت، صفح، مغفرت و عموم رحمت است که این نعوت را به آنان شهود (الشهود) داد. و این نعوت اثری ندارند که حکم آن به طور عمومی برای هر بیننده‌ای ظاهر شود مگر در مورد گناهکاران، به ویژه عفو. پس هیچ گناهکاری بر خدا جرأت نورزید مگر به واسطه آن. و او از حیث نفس خود، پرواکننده از خداست، زیرا نسب اگر صحیح باشد، احوال در آن اثری ندارد. و خداوند جز نسب دینی را معتبر ندانسته است و به واسطه آن توارث میان مردم واقع می‌شود. پس اگر نسب دینی و نسب طینی (خاکی/جسمانی) در شخص جمع شود، در آن هنگام می‌تواند آنچه را که از نسب دینی و طینی او حجاب می‌شود، حجاب کند. و اگر نسب طینی نداشته باشد و نسب دینی داشته باشد، به دین خود باز می‌گردد و نسب طینی، وراثت او را از نسب دینی حجاب نمی‌کند، پس مسلمانان از او ارث می‌برند، یا کافر باشد که کفار از او ارث می‌برند. و اگر صاحب نسب طینی باشد و نسب دینی نداشته باشد، مسلمانان از او ارث می‌برند. پس او جز از دین خدای تعالی خارج نشده است. زیرا نسب تقوا، اگر تعقل شود، همه نحله‌ها و ملت‌ها را فرا می‌گیرد. پس از آن جهت که عالم عیال خداست، به آن‌ها روزی داد. و از آن جهت که در میان آن‌ها کسانی هستند که اهل اویند، به آن‌ها توجه کرد و بر آن‌ها شفقت ورزید. و از آن جهت که بر صورت او به وجه کمال آفریده شده‌اند، آن‌ها را جانشین خود ساخت. و از آن جهت که برخی از آن‌ها بر بخشی از صورت هستند، با آن‌ها مدارا کرد. و از جهت نسب مذکور، اسم رحمان با وصل و انتظام شمل به آن‌ها نظر کرد. پس از هر جهت، با احسان به آن‌ها نظر دارد. و به همین دلیل به «البر الرحیم» (نیکوکار مهربان) نامیده شده است، و «البر» به معنای احسان‌کننده است. این مقدار در سخن گفتن درباره این منزل کافی است. پس علومی را که این منزل در بر دارد، ذکر می‌کنیم: از جمله آن‌ها، علم افضل اشکال است. و از جمله آن‌ها، علم کتب و مراتب آن‌ها و معرفت مبین از منیر، از حکیم، از کریم، از محصی، از مسطور، از مرقوم، از معنوی، از حسی، از اُمّ (مادر)، از امام و غیره از انواع کتب و کتابت است. زیرا خداوند تورات را با دست خود نوشت، و قلم خود به امر پروردگارش در لوح محفوظ نوشت. و مرتبه هر کاتب و آنچه از کتابت در ارحام نوشته شده است، و آنان کاتبان خلق و رزق و اجل و شقاوت و سعادت هستند، و کرام الکاتبین (نویسندگان بزرگوار) و فرق میان آنچه در لوح محفوظ نوشته شده و الواح غیر محفوظ و کاغذ و غیر آن، و صور کتابت الهی از غیر آن. همه این‌ها از این منزل دانسته می‌شود و کسی که وارد آن شود، آن را شهود (الشهود) می‌کند. و علم آباد از عالم از غیر آباد، و اینکه آیا غیر آباد با آنچه ابصار ما درک نمی‌کند آباد است یا در نفس‌الامر آباد نیست. و آبادانی مکان‌ها به آنچه در آن‌ها از گیاه یا حیوان یا معدن یا آنچه از حق و ملک و جن در آن نازل می‌شود، تکوین می‌یابد. و فرق میان اسم الهی «العلی» و «الرفیع» و اینکه چرا اسم «الرفیع» مقید به اضافه آمده و «العلی» مطلق و بدون تقیید است. و علم کیفیت انقلاب ضد به ضد خود هنگامی که از حد خود بگذرد، آیا این از حیث جوهر آن است یا جوهر صورت آن. و علم ایلاء (سوگند) الهی به نفس خود و به موجودات و معدومات. و علم مقسم‌علیه (آنچه بر آن سوگند خورده می‌شود) در تقیید آن به گذشته که واقع شده است، یا به آینده که وقوع آن حکماً یا وجود آن عیناً ناگزیر است. و اینکه چرا مقسوم‌علیه به قسم اختصاص یافته است نه غیر آن، در حالی که عالم از حیث خود واحد است. و علم قضا، آیا رادّی (بازگرداننده‌ای) دارد یا نه؟ و آیا آن رادّ از خود اوست یا امر دیگری است که شرطی آن را به رفع یا ثبوت اقتضا کرده است. و علم تغییر نعوت بر موصوف به آن‌ها، آیا هر متغیری تغییر به ذات او قائم شده است یا تغییر در حکم او بوده است نه در عین او و نه در صفت او، اگر صاحب صفت باشد. و علم سبب منجر به انکار (جحد) با وجود علم، و اینکه در حکم به منزله جاهل نیست. و آیا جاهل معذور است یا نه. و علم علم ستوده از علم نکوهیده، و آیا نکوهش برای آن عرضی است که از معلوم برای آن عارض شده است یا اثری در آن ندارد، نه به حکم عرضی و نه ذاتی. و آیا علم در نفس و حس اثری محسوس دارد یا اثری جز در نفس ندارد؟ مانند کسی که می‌داند مصیبتی ناگزیر بر او واقع می‌شود، پس مزاج و رنگ و حرکتش تغییر می‌کند و زبانش پریشان می‌شود و سخن می‌گوید در حالی که نمی‌داند چه می‌گوید. زیرا علم در نفس، خوف ایجاد کرده است. و این آثار، آثار وجود خوف نزد اوست، نه آثار علم، زیرا علم ممکن است در نفس فرد قوی که بر نفس خود حاکم است، واقع شود، پس خوفی در آن تأثیر نکند و با وجود علم تغییر نکند. و علم امری که دروغگو به واسطه آن عذاب می‌شود، و آیا به امر عدمی به مناسبت دروغ عذاب می‌شود یا به امر وجودی، به دلیل اینکه دروغ مرتبه‌ای از وجود در وجود ذهنی دارد و در آن هنگام دروغگو از آن تعبیر می‌کند؟ پس آیا عقوبت او مانند نسبت آن به حس است که به امر عدمی باشد، یا مانند نسبت آن به خیال است که به امر وجودی متخیل باشد؟ و این‌ها علوم عجیبی در مشاهدات هستند که علمای رسوم و اهل نظر به دلیل جهلشان به میزان وضع شده‌ای که خداوند هنگام برافراشتن آسمان و گستراندن زمین میان آسمان و زمین قرار داده است، به این موازنات علم ندارند. و اینکه این میزان با وجود وضع شدنش، در دست حق (الحق) است که دهر نامیده می‌شود و فرو می‌آورد و بالا می‌برد. و علم سحر، چرا باز می‌گردد و آیا در آن ستوده‌ای هست و چه کاری انجام داده است. و علم مساوات در سخن خدای تعالی: «سَوَاءٌ عَلَيْهِمْ أَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ» (برایشان یکسان است، چه آن‌ها را بیم دهی و چه بیم ندهی، ایمان نمی‌آورند) و سخن او: «سَوَاءٌ عَلَيْهِمْ أَسْتَغْفَرْتَ لَهُمْ أَمْ لَمْ تَسْتَغْفِرْ لَهُمْ ... إِن تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَن يَغْفِرَ اللَّهُ لَهُمْ» (برایشان یکسان است، چه برایشان آمرزش بخواهی و چه نخواهی... اگر هفتاد بار هم برایشان آمرزش بخواهی، خداوند هرگز آن‌ها را نمی‌آمرزد) و سخن او: «فَاصْبِرُوا أَوْ لَا تَصْبِرُوا سَوَاءٌ عَلَيْكُمْ» (پس صبر کنید یا صبر نکنید، برای شما یکسان است). و موطن دنیا که استغفار در آن واقع شده، اقتضا می‌کند که پذیرفته شود، برخلاف موطن آخرت. پس همان‌گونه که انذار و عدم انذار برایشان یکسان بود و ایمان نیاوردند، همچنین در حق آن‌ها در آخرت، وجود صبر و عدم آن یکسان بود و در نفوذ جزای موافق تأثیری نداشت. و علم اعتماد بر غیر خدا از اموری که خداوند ستوده است که بر آن اعتماد شود، اثر آن در سرای آخرت در جزای موافق چیست. و علم سبب نکاحی که از آن تناسلی حاصل نمی‌شود، برای بقای آن نوع. و علم سبب معاطات (داد و ستد) بدون نیاز، در حالی که معاطات جز در مورد صاحب نیاز نیست. و علم وجود امتنان (منت‌گذاری) همراه با معاوضه در بیع‌ها، نه در هبه‌ها، زیرا امتنان در هبه‌ها معقول است و به همین دلیل مکافات بر آن تشریع شده تا سلطه امتنان ضعیف شود. و سبب رفع امتنان از عالم و اینکه امتنان همراه با معاوضه برای چه کسی شایسته است. و علم فرق میان کهانت و وحی. و علم اینکه هوی (میل نفسانی) چیست و عقل که مقابل آن است چیست. و علم اینکه عالم از کجا خلق شده است، آیا از چیزی یا از هیچ چیز. و علم اینکه آیا ارواح در قوت با هم تفاوت دارند، به طوری که برخی بر برخی دیگر تأثیر بگذارند، مانند قوای جسمانی، یا نه. و علم خزانه‌های الهی و آنچه در آن‌ها ذخیره شده و مکان آن‌ها کجاست. و علم عندیت حق (الحق)، آیا نسبتی است یا ظرف وجودی. و علم ترقی عالم طبیعی بر کدام معراج (نردبان) است، آیا بر معراج طبیعی است که باز هم به معراج نیاز پیدا کند یا بر غیر طبیعی. و علم صورت تأثیر معانی لطیف در اجرام کثیف. و علم تأثیر قصد در افعال. و علم صفاتی که شایسته است اله به آن‌ها متصف باشد. و علم سبب ناامیدی ظنون در زمانی خاص و نه در زمان دیگر. و علم احوال تنزیه. این‌ها برخی از علومی است که این منزل در بر دارد و ما آن‌ها را ذکر کردیم تا همت طالب برای طلب آن‌ها از خداوند یا از عالم به آن‌ها، کامل شود. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}