{
  "id": 454,
  "title": {
    "ar": "الباب الرابع والخمسون وأربعمائة في معرفة منازلة لا يقوى معنا في حضرتنا غريب وإنما المعروف لأولي القربى",
    "en": "Chapter Four Hundred and Fifty-Four: Concerning the Gnosis of the Stations in which no stranger can prevail with us in our Presence, for only those of proximity (أولي القربى) are recognized.",
    "ur": "باب چار سو چون (۴۵۴) ان روحانی منازل (منازل) کی معرفت (معرفة) کے بیان میں جن میں کوئی غریب (غريب) ہماری حضرت (حضرت) میں ہمارے ساتھ قوت نہیں پاتا، اور یہ صرف اہلِ قرب (أولي القربى) کے لیے ہی معروف ہے۔",
    "fa": "باب چهارصد و پنجاه و چهارم در معرفت منازلی که غریبه‌ای در حضرت ما یارای همراهی ندارد، و تنها برای خویشاوندان نزدیک (أولي القربى) شناخته شده است."
  },
  "content": {
    "ar": "## «الباب الرابع والخمسون وأربعمائة في معرفة منازلة لا يقوى معنا في حضرتنا غريب وإنما المعروف لأولي القربى»\n\n\n> أولو القربى هم الحكام فينا *** وفي أموالنا ولنا القياد\n\n\n> فإن جاء الغريب يقيم يوما *** ويرحل مسرعا وهو المراد\n\n\n> قريب قرابة وقريب قربى *** جمعناها فيحسدنا العباد\n\n\n> فما أحد يدوم به شقاء *** ولا كون يزول ولا فساد\n### [التقوى سبب النجاة]\n\n\nقال الله تعالى آمرا لنبيه صَلَّى اللهُ عَليهِ وسَلَّم قُلْ لا أَسْئَلُكُمْ عَلَيْهِ أَجْراً إِلَّا الْمَوَدَّةَ في الْقُرْبى‏ وورد في الخبر في إثبات النسب بيننا وبين الله إن الله يقول يوم القيامة اليوم أضع نسبكم وأرفع نسبي أين المتقون وهم الذين جعلوا نفوسهم وقاية يحمون بها جانب الله تعالى إِنَّ أَكْرَمَكُمْ عِنْدَ الله أَتْقاكُمْ‏\n\n\nأي أشدكم وقاية لأنه جاء في باب أفعل فالمدار على صحة النسب الإلهي فإذا صح النسب لم تبق غربة في حق من صح نسبه ولا يصح النسب حتى يقع التناسب في الصفة فإذا كان العبد أحدي الذات في شأنه معروفا عند الله مجهولا في العالم لا يعرف نسبه ولا ينال منصبه يسأل الله به ويلجأ إليه عند الاضطرار من غير تعيين ولا تمييز وهو الذي يدعى به إذا جاءت الشدائد فيقول صاحبها اللهم بحرمة الصالحين عندك افعل لي كذا وكذا فهو المجهول المعين ولم يتولد عنه أمر يوجب تمييزه عند الأجانب من الأجانب ولم يدل عليه لأنه لا يدل عليه حتى يكون مطلوبا والذي لا يؤبه له لا يطلب ثم إنه يكون على حالة لا يزنه فيها أحد من خلق الله إلا من له هذا المقام فإذا كان بمثل هذه الصفات صح النسب‏\n\n\nورد في الخبر أن اليهود قالت لمحمد صَلَّى اللهُ عَليهِ وسَلَّم يا محمد انسب لنا ربك فنزلت قُلْ هُوَ الله أَحَدٌ\n\n\n> نسب الله قُلْ هُوَ الله *** فانظروا فيه تعرفوا ما هو\n\n\n> أحدي لذاته صمد *** ليس يدري ما هو إلا هو\n\n\n> لم تلده العقول إذ نظرت *** وهو الناظر الذي ما هو\n\n\n> واحد ما يكون عنه زكى *** لا ولا واحد فقل ما هو\n\n\n> هو عين الوجود فهو حسبي *** وكثير فليس إلا هو\n\n\n> فانظروا الحق في تناقض ما *** قلته لا إله إلا هوفحضرته لا تحمل الغرباء لأنه وصل للرحم فهو أرحم الرحماء فقرابته مجهولة والجاهلون بها منهم أنزلهم جهلهم منزلة الغرباء الذين لا نسب بينهم وبينه وهو سبحانه ما يعامل عبده إلا بما جاءه به لا يزيده عليه وهو قوله وذلِكُمْ ظَنُّكُمُ فهو لهم في اعتقادهم جار جنب فهم قطعوا رحمهم فقطعهم الله فما أشرف العلم بالأنساب ولهذا كانت العرب تثابر على علم الأنساب حتى قال الله ما قلناه من إثبات النسب بالطريقين طريق أرفع نسبي وطريق الرحم شجنة من الرحمن وهوقوله الولد سر أبيه‏\n\n\nفكم بين رجل يأتي يوم القيامة عارفا بنسبه مدلا بقرابته متوسلا إلى الرحمن برحمه وبين من يأتي جاهلا بهذا كله يعتقد الأجنبية وبعد المناسبة وإن علم بالخبر فيكون عنده بمنزلة كون أبيه آدم منه وهو ابن آدم فيجعل هذا مثل ذلك فإن هذا النسب لا يعطي سعادة عنده وهو غالط بل يعطي ويعطي ولقد رأيت ذلك ذوقا بمكة في عمرة اعتمرتها عن أبينا آدم عليه السلام فظهر لي ذلك في مبشرة رآها بعض الناس لنا وللجماعة التي أمرتهم في تلك الليلة بالاعتمار معي عن أبينا آدم رأى فيها من لتقريب الإلهي وفتح أبواب السماء وعروج تلك الجماعة وتلقاهم الملأ الأعلى بالتأهيل والسهل والترحيب إلى أن بهت وذهل مما رأى فإن رحم آدم منا رحم مقطوعة عند أكثر الناس من أهل الله فكيف حال العامة في ذلك ولقد وصلتها بحمد الله ووصلت بسببي وجرى فيها على سنني وكان عن توفيق إلهي لم أر لأحد في ذلك قد ما أمشي على أثره فيها فحمدت الله على الإنعام وما اهتديت إلى ذلك إلا بالنسب الإلهي فإنه أبعد مناسبة وقد نفع وذكر وما تفطن الناس لقول الله تعالى في غير موضع يا بَنِي آدَمَ يا بَنِي آدَمَ يذكر ولا أحد ينتبه لهذه الأبوة والبنوة وما يَذَّكَّرُ إِلَّا أُولُوا الْأَلْبابِ جعلنا لله وإياكم ممن بر أباه وما أشبه هذا الذكرى من الله في بنى آدم بقوله يا أُخْتَ هارُونَ وأين زمان هارون منها فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Four Hundred and Fifty-Four: Concerning the Knowledge of the Stations where no stranger is strong in our Presence, and only the well-known belongs to the People of Kinship\n\nThe People of Kinship (أولو القربى) are the rulers over us,\nAnd over our possessions, and the leadership belongs to us.\n\nIf the stranger comes, he stays for a day,\nAnd departs quickly, and that is the intention.\n\nA relative by lineage and a relative by proximity (قريب قربى)\nWe have combined them, so the servants envy us.\n\nNo one endures misery through it,\nNor does existence vanish, nor corruption.\n\n### [Piety (Taqwa) is the Cause of Salvation]\n\nAllah the Exalted said, commanding His Prophet (may Allah bless him and grant him peace): <<Say: I ask of you no reward for it, save affection in respect of kinship (الْقُرْبى)>>.\n\nIt is mentioned in the tradition concerning the establishment of the lineage (النسب) between us and Allah that Allah will say on the Day of Resurrection: \"Today I abolish your lineages and raise My Lineage. Where are the pious (المتقون)?\" They are those who made their souls a shield (وقاية) by which they protect the side of Allah the Exalted: <<Indeed, the noblest of you in the sight of Allah is the most pious (أَتْقاكُمْ) of you>>.\n\nMeaning, the one who is strongest in protection, because it comes in the form of *af'al* (the superlative). The pivot is the soundness of the Divine Lineage (النسب الإلهي). If the lineage is sound, no strangeness (غربة) remains for the one whose lineage is sound. The lineage is not sound until there is proportionality (التناسب) in the Attribute (الصفة). When the servant is singular (أحدي) in his Essence (الذات) in his affair, known to Allah but unknown in the World (العالم), his lineage is not known, nor is his station attained. Allah is asked through him, and refuge is sought in him during necessity, without specification or distinction. He is the one through whom supplication is made when hardships come, and the supplicant says: \"O Allah, by the sanctity of the righteous (الصالحين) with You, do such and such for me.\" He is the specific unknown (المجهول المعين). No matter has arisen from him that necessitates his distinction among strangers from other strangers, and he is not pointed out, because he is not pointed out unless he is sought. And the one who is not cared for is not sought. Furthermore, he is in a state where no one among Allah's creation can weigh him, except for the one who possesses this station (المقام). If he possesses such attributes, the lineage is sound.\n\nIt is mentioned in the tradition that the Jews said to Muhammad (may Allah bless him and grant him peace): \"O Muhammad, describe the lineage of your Lord to us.\" So, the verse was revealed: <<Say: He is Allah, [the] One (أَحَدٌ)>>.\n\nThe lineage of Allah is <<Say: He is Allah>>,\nLook into it, and you will know what He is.\n\nSingular (أحدي) in His Essence (ذاته), the Eternal Refuge (صمد),\nNo one knows what He is, except Him.\n\nMinds did not give birth to Him when they looked,\nAnd He is the Observer who is not [like anything].\n\nOne (واحد) from whom nothing pure comes forth,\nNor is He one, so say what He is.\n\nHe is the very Essence of Existence (عين الوجود), so He suffices me,\nAnd He is Multiplicity (كثير), yet there is none but Him.\n\nSo look at the Truth (الحق) in the contradiction of what\nI have said: There is no god but He.\n\nHis Presence (حضرة) does not bear strangers, because He has joined the womb (الرحم), and He is the Most Merciful of the Merciful. His kinship is unknown. Those who are ignorant of it—their ignorance places them in the station of strangers who have no lineage between them and Him. And He, glory be to Him, only deals with His servant according to what the servant brings to Him; He does not increase upon it. This is His saying: <<And that was your assumption (ظَنُّكُمُ)>>. Thus, in their belief, He is a distant neighbor (جار جنب) to them. They cut off their kinship, so Allah cut them off. How noble is the knowledge of lineages (الأنساب)! This is why the Arabs diligently pursued the science of genealogy, until Allah stated what we have mentioned regarding the establishment of lineage through two paths: the path of \"I raise My Lineage,\" and the path of the womb (الرحم) being \"a branch (شجنة) from the All-Merciful (الرحمن).\" This is also His saying: \"The child is the secret of his father.\"\n\nHow vast is the difference between a man who comes on the Day of Resurrection knowing his lineage, boasting of his kinship, interceding with the All-Merciful through his womb-tie, and one who comes ignorant of all this, believing in foreignness and distance of suitability. Even if he knows the tradition, it is for him merely like the fact that his father Adam is from him, and he is the son of Adam, so he makes this [Divine Lineage] similar to that [physical lineage]. He thinks that this lineage does not grant felicity, and he is mistaken; rather, it grants and grants abundantly. I have witnessed this through direct experience (ذوقا) in Mecca during a minor pilgrimage which I performed on behalf of our father Adam (peace be upon him). This became manifest to me in a glad vision seen by some people for us and for the group whom I commanded that night to perform the *Umrah* with me on behalf of our father Adam. In it, he saw such Divine proximity (التقريب الإلهي), the opening of the gates of heaven, the ascent of that group, and their reception by the Highest Assembly (الملأ الأعلى) with welcome, ease, and greeting, until he was astonished and bewildered by what he saw. For the kinship of Adam to us is a severed kinship in the view of most of the People of Allah (أهل الله), so what is the state of the common people regarding it? I have joined it, praise be to Allah, and it was joined through my means, and it proceeded according to my way. This was due to Divine success. I have not seen anyone whose footsteps I could follow in this matter. So I praised Allah for the favor. I was not guided to this except through the Divine Lineage, for it is the most distant suitability, yet it benefited and was mentioned. People have not paid attention to the saying of Allah the Exalted in more than one place: <<O Children of Adam (يا بَنِي آدَمَ)>>, <<O Children of Adam (يا بَنِي آدَمَ)>>. He mentions it, yet no one notices this fatherhood and sonship. <<And none will remember except those of understanding (أُولُوا الْأَلْبابِ)>>. May Allah make us and you among those who honor their father. How similar is this reminder from Allah regarding the Children of Adam to His saying: <<O sister of Aaron (يا أُخْتَ هارُونَ)>>! And where is the time of Aaron in relation to her? Know this, and Allah <<says the Truth (الْحَقَّ) and He guides to the way (السَّبِيلَ)>>.",
    "ur": "باب چار سو چوون (۴۵۴) اس مقام کی معرفت میں جہاں ہماری بارگاہ میں کوئی اجنبی ٹھہر نہیں سکتا، اور یہ صرف اہلِ قربت (أولي القربى) کے لیے معروف ہے۔\n\nاہلِ قربت (أولي القربى) ہی ہم پر حاکم ہیں\nاور ہمارے اموال پر، اور قیادت ہمارے لیے ہے\n\nاگر اجنبی آئے تو ایک دن ٹھہرتا ہے\nاور تیزی سے کوچ کر جاتا ہے، اور یہی مراد ہے\n\nایک قریبی قرابت (قرابة) سے اور ایک قریبی قربت (قربى) سے\nہم نے ان دونوں کو جمع کر لیا ہے، پس لوگ ہم سے حسد کرتے ہیں\n\nپس نہ کسی پر دائمی شقاوت (بدبختی) رہتی ہے\nاور نہ کوئی کائنات زائل ہوتی ہے اور نہ کوئی فساد ہوتا ہے\n\n[تقویٰ نجات کا سبب ہے]\n\nاللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو حکم دیتے ہوئے فرمایا: قُلْ لا أَسْئَلُكُمْ عَلَيْهِ أَجْراً إِلَّا الْمَوَدَّةَ في الْقُرْبى‏ (کہہ دیجیے کہ میں تم سے اس (تبلیغ) پر کوئی اجر نہیں مانگتا سوائے قرابت میں محبت کے) [الشورى: ۲۳]۔ اور خبر میں ہمارے اور اللہ کے درمیان نسب (Nasab) کے اثبات میں آیا ہے کہ اللہ قیامت کے دن فرمائے گا: \"آج میں تمہارے نسب گرا دوں گا اور اپنا نسب بلند کروں گا، متقی کہاں ہیں؟\" اور وہ متقی وہ ہیں جنہوں نے اپنے نفوس کو ڈھال بنا لیا جس سے وہ اللہ تعالیٰ کی جانب کی حفاظت کرتے ہیں۔ إِنَّ أَكْرَمَكُمْ عِنْدَ الله أَتْقاكُمْ‏ (بے شک تم میں سے اللہ کے نزدیک سب سے زیادہ عزت والا وہ ہے جو سب سے زیادہ متقی ہے) [الحجرات: ۱۳]۔\n\nیعنی تم میں سے سب سے زیادہ حفاظت کرنے والا، کیونکہ یہ بابِ \"أفعل\" (صفتِ تفضیل) میں آیا ہے۔ لہٰذا، مدار صحتِ نسبِ الٰہی (Nasab-e-Ilāhī) پر ہے۔ جب نسب صحیح ہو جاتا ہے تو جس کا نسب صحیح ہو اس کے حق میں کوئی غربت (اجنبیت) باقی نہیں رہتی۔ اور نسب اس وقت تک صحیح نہیں ہوتا جب تک صفات میں تناسب (Tanasub) واقع نہ ہو۔ پس جب بندہ اپنے معاملے میں احدی الذات (أحدي الذات) ہو، اللہ کے ہاں معروف ہو، مگر دنیا میں مجہول ہو، نہ اس کا نسب معلوم ہو اور نہ اس کا منصب حاصل کیا جا سکے، لوگ اس کے ذریعے اللہ سے سوال کرتے ہیں اور اضطرار کے وقت بغیر کسی تعیین یا تمیز کے اس کی پناہ لیتے ہیں۔ یہ وہ شخص ہے جسے پکارا جاتا ہے جب سختیاں آتی ہیں، اور پکارنے والا کہتا ہے: \"اے اللہ! تیرے ہاں صالحین کے احترام کے واسطے میرے لیے فلاں فلاں کام کر دے۔\" پس وہ مجہول المعین (نامعلوم مگر متعین) ہوتا ہے۔ اس سے کوئی ایسا امر پیدا نہیں ہوا جو اجنبیوں کے درمیان اس کی تمیز کو واجب کرے، اور نہ ہی اس پر دلالت کی گئی، کیونکہ اس پر دلالت تب کی جاتی ہے جب وہ مطلوب ہو۔ اور جس کی پرواہ نہ کی جائے اسے طلب نہیں کیا جاتا۔ پھر وہ ایسی حالت پر ہوتا ہے کہ اللہ کی مخلوق میں سے کوئی بھی اسے نہیں جانچ سکتا سوائے اس کے جو یہ مقام رکھتا ہو۔ پس جب وہ ان صفات کے ساتھ ہو تو نسب صحیح ہو جاتا ہے۔\n\nخبر میں آیا ہے کہ یہودیوں نے محمد صلی اللہ علیہ وسلم سے کہا: \"اے محمد! ہمیں اپنے رب کا نسب بتاؤ۔\" تو نازل ہوا: قُلْ هُوَ الله أَحَدٌ (کہہ دیجیے وہ اللہ ایک ہے) [الإخلاص: ۱]۔\n\nاللہ کا نسب قُلْ هُوَ الله ہے\nپس اس میں غور کرو تو جان لو گے کہ وہ کیا ہے\n\nوہ اپنی ذات کے لیے احدی (Aḥadī) ہے، صمد (Ṣamad) ہے\nوہ کیا ہے یہ اس کے سوا کوئی نہیں جانتا\n\nعقلوں نے جب غور کیا تو اسے جنم نہ دے سکیں\nاور وہ دیکھنے والا ہے جو وہ ہے\n\nوہ واحد ہے جس سے کوئی پاکیزہ چیز نہیں ہوتی\nاور نہ ہی وہ واحد ہے، پس بتاؤ وہ کیا ہے\n\nوہ عین الوجود (Ain-ul-Wujūd) ہے، پس وہ میرے لیے کافی ہے\nاور وہ کثیر ہے، پس اس کے سوا کوئی نہیں\n\nپس اس تضاد میں الحق (الحق) کو دیکھو جو میں نے کہا:\nلا إله إلا هو (اللہ کے سوا کوئی معبود نہیں ہے)\n\nپس اس کی بارگاہ (Ḥaḍra) اجنبیوں کو برداشت نہیں کرتی، کیونکہ وہ رحم (Raḥm) تک پہنچا ہے۔ پس وہ ارحم الراحمین (سب سے زیادہ رحم کرنے والا) ہے۔ اس کی قرابت مجہول ہے، اور جو لوگ اس سے ناواقف ہیں، ان کی جہالت نے انہیں اجنبیوں کے مقام پر لا کھڑا کیا جن کا اس کے اور اس کے درمیان کوئی نسب نہیں۔ اور وہ سبحانہ اپنے بندے کے ساتھ صرف اسی طرح معاملہ کرتا ہے جو وہ لے کر آیا ہو، اس میں اضافہ نہیں کرتا، اور یہ اس کا قول ہے: وذلِكُمْ ظَنُّكُمُ (اور یہ تمہارا گمان ہے) [فصلت: ۲۳]۔ پس وہ ان کے اعتقاد میں پڑوسی کی طرح ہے، لہٰذا انہوں نے اپنا رحم (Raḥm) کاٹ دیا تو اللہ نے انہیں کاٹ دیا۔ پس علمِ انساب (علمِ نسب) کتنا شرف والا ہے! اسی لیے عرب علمِ انساب پر ثابت قدم رہے، یہاں تک کہ اللہ نے وہی کہا جو ہم نے کہا، یعنی دو طریقوں سے نسب کا اثبات: ایک طریقہ \"میں اپنا نسب بلند کروں گا\" اور دوسرا طریقہ \"رحم (Raḥm) رحمن سے ایک شاخ ہے\"۔ اور یہ اس کا قول ہے: \"الولد سر أبيه\" (بیٹا اپنے باپ کا راز ہوتا ہے۔)\n\nپس اس شخص میں کتنا فرق ہے جو قیامت کے دن اپنے نسب کو جاننے والا، اپنی قرابت پر ناز کرنے والا، اور اپنے رحم (Raḥm) کے ذریعے رحمن سے وسیلہ طلب کرنے والا آئے گا، اور اس شخص میں جو ان سب سے جاہل آئے گا، جو اجنبیت اور عدمِ مناسبت کا اعتقاد رکھتا ہے، اگرچہ وہ خبر سے جانتا بھی ہو، تو وہ اس کے نزدیک ایسا ہو گا جیسے اس کا باپ آدم اس سے ہے، اور وہ آدم کا بیٹا ہے۔ پس وہ اس کو اس جیسا بنا دیتا ہے۔ کیونکہ یہ نسب اس کے نزدیک سعادت نہیں دیتا، اور وہ غلطی پر ہے۔ بلکہ یہ سعادت دیتا ہے، اور بہت کچھ دیتا ہے۔ میں نے یہ ذوقاً (Dhauqan) مکہ میں اس عمرہ کے دوران دیکھا جو میں نے اپنے والد آدم علیہ السلام کی طرف سے ادا کیا تھا۔ یہ بات مجھ پر ایک بشارت میں ظاہر ہوئی جسے بعض لوگوں نے ہمارے لیے اور اس جماعت کے لیے دیکھا جنہیں میں نے اس رات اپنے ساتھ اپنے والد آدم کی طرف سے عمرہ کرنے کا حکم دیا تھا۔ اس نے اس بشارت میں تقربِ الٰہی (Taqrīb-e-Ilāhī)، آسمانوں کے دروازے کھلنے، اور اس جماعت کے عروج کو دیکھا، اور یہ کہ ملأ اعلیٰ (فرشتوں کی جماعت) نے انہیں خوش آمدید کہا، آسانی اور ترحیب سے استقبال کیا، یہاں تک کہ وہ جو کچھ دیکھا اس سے حیران اور مدہوش ہو گیا۔ کیونکہ آدم کا رحم (Raḥm) ہم سے اہلِ اللہ میں سے اکثر لوگوں کے نزدیک کٹا ہوا ہے، تو عام لوگوں کا اس بارے میں کیا حال ہو گا؟ اور میں نے اللہ کے فضل سے اسے جوڑا، اور وہ میرے سبب سے جڑ گیا، اور اس میں میرے طریقے پر عمل کیا گیا۔ اور یہ ایک الٰہی توفیق کے ذریعے ہوا، میں نے اس معاملے میں کسی کا قدم نہیں دیکھا جس کے نقشِ قدم پر میں چلوں۔ پس میں نے اس انعام پر اللہ کا شکر ادا کیا، اور مجھے اس کی ہدایت صرف نسبِ الٰہی (Nasab-e-Ilāhī) کے ذریعے ملی، کیونکہ یہ سب سے دور کی مناسبت ہے، اور اس نے فائدہ دیا اور یاد دلایا۔ اور لوگوں نے اللہ تعالیٰ کے اس قول پر غور نہیں کیا جو کئی مقامات پر آیا ہے: يا بَنِي آدَمَ يا بَنِي آدَمَ (اے آدم کی اولاد! اے آدم کی اولاد!)۔ وہ ذکر کرتا ہے، مگر کوئی بھی اس ابوت اور بنوت پر توجہ نہیں دیتا۔ وما يَذَّكَّرُ إِلَّا أُولُوا الْأَلْبابِ (اور نصیحت صرف عقل والے ہی حاصل کرتے ہیں) [الرعد: ۱۹]۔ اللہ ہمیں اور آپ کو ان لوگوں میں شامل کرے جنہوں نے اپنے باپ کے ساتھ نیکی کی۔ اور اللہ کی طرف سے بنی آدم کے بارے میں یہ یاد دہانی اس کے اس قول سے کتنی مشابہت رکھتی ہے: يا أُخْتَ هارُونَ (اے ہارون کی بہن!) [مریم: ۲۸]، حالانکہ ہارون کا زمانہ اس سے کتنا دور تھا! پس یہ جان لو، اور اللہ حق فرماتا ہے اور وہی سیدھے راستے کی ہدایت دیتا ہے۔",
    "fa": "باب چهارصد و پنجاه و چهارم در معرفت منزلتی که غریبه‌ای در حضرت ما یارای ماندن ندارد، و این منزلت تنها برای اولی القربی (أولي القربى) شناخته شده است.\n\nاولی القربی (أولي القربى) حاکمان بر ما هستند *** و بر اموال ما، و زمام امور در دست ماست.\n\nاگر غریبه‌ای بیاید، یک روز می‌ماند *** و شتابان کوچ می‌کند، و این همان مراد است.\n\nنزدیک به خویشاوندی و نزدیک به قرب (قربى) *** ما این دو را جمع کرده‌ایم، پس بندگان بر ما حسد می‌ورزند.\n\nپس نه کسی است که شقاوتش پایدار باشد *** و نه هستی‌ای (کون) که زوال پذیرد و نه فسادی.\n\n### [تقوا (التقوى) سبب نجات است]\n\nخداوند متعال به پیامبرش (صلی الله علیه و سلم) امر فرمود: «بگو: من هیچ پاداشی در برابر آن (رسالت) از شما نمی‌خواهم مگر دوستی در حق خویشاوندان (قُلْ لا أَسْئَلُكُمْ عَلَيْهِ أَجْراً إِلَّا الْمَوَدَّةَ في الْقُرْبى‏)». و در خبر (حدیث) برای اثبات نسبت میان ما و خداوند آمده است که خداوند در روز قیامت می‌فرماید: «امروز نسب‌های شما را فرومی‌نهم و نسب خود را بالا می‌برم. پرهیزگاران (المتقون) کجایند؟» و آنان کسانی هستند که جان‌های خود را سپر و وقایه قرار دادند تا جانب حق تعالی را با آن حفظ کنند: «همانا گرامی‌ترین شما نزد خداوند، پرهیزگارترین شماست (إِنَّ أَكْرَمَكُمْ عِنْدَ الله أَتْقاكُمْ)».\n\nیعنی کسی که وقایه و سپر بودنش شدیدتر است، زیرا این واژه در باب «أفعل» (صفت تفضیلی) آمده است. پس مدار بر صحت نسب الهی است. هنگامی که نسب صحیح باشد، غربتی در حق کسی که نسبش صحیح است باقی نمی‌ماند. و نسب صحیح نمی‌شود مگر آنکه تناسب در صفت (صفات) رخ دهد. پس اگر بنده در شأن خود احدی الذات (أحدي الذات) باشد، نزد خداوند شناخته شده و در عالم ناشناخته باشد، نه نسبش معلوم باشد و نه منصبش درک شود، در هنگام اضطرار به واسطه او از خداوند درخواست می‌شود و به او پناه برده می‌شود، بدون تعیین و تمییز. او کسی است که هنگام فرارسیدن سختی‌ها به او دعا می‌شود و صاحب حاجت می‌گوید: «خداوندا، به حرمت صالحان نزد تو، برای من چنین و چنان کن.» پس او همان ناشناخته‌ی معین است. و از او امری متولد نشده که موجب تمییز او نزد بیگانگان از بیگانگان شود، و کسی بر او دلالت نکرده است، زیرا بر او دلالت نمی‌شود مگر آنکه مطلوب باشد، و کسی که به او توجهی نمی‌شود، طلب نمی‌گردد. سپس او در حالتی است که هیچ‌یک از خلق خدا او را وزن نمی‌کند، مگر کسی که خود دارای این مقام باشد. پس اگر با چنین صفاتی باشد، نسب صحیح است.\n\nدر خبر (حدیث) آمده است که یهودیان به محمد (صلی الله علیه و سلم) گفتند: «ای محمد، پروردگارت را برای ما وصف کن (نسبش را بگو)». پس نازل شد: «بگو او خداوند یکتاست (قُلْ هُوَ الله أَحَدٌ)».\n\nنسب خداوند «قُلْ هُوَ الله» است *** پس در آن بنگرید تا بدانید او چیست.\n\nاحدی (أحدي) است برای ذاتش، صمد (صمد) است *** هیچ‌کس نمی‌داند او چیست مگر خود او.\n\nعقل‌ها او را نزاییدند آنگاه که نظر کردند *** و اوست ناظری که او نیست (آنچه عقل می‌پندارد).\n\nواحدی (واحد) است که از او پاکی (زکی) حاصل نمی‌شود *** و نه واحدی دیگر، پس بگو او چیست.\n\nاو عین الوجود (عين الوجود) است، پس او مرا کافی است *** و بسیار است، پس جز او نیست.\n\nپس حق (الحق) را در تناقض آنچه گفتم بنگرید *** «لا إله إلا هو» (هیچ معبودی جز او نیست).\n\nپس حضرت او (حق) غریبه‌ها را تحمل نمی‌کند، زیرا او به رحم (رحم) پیوسته است، پس او ارحم الراحمین است. خویشاوندی او مجهول است، و جاهلان به آن، جهلشان آنان را به منزلت غریبه‌هایی تنزل داده که هیچ نسبتی میان آن‌ها و او نیست. و او سبحانه با بنده‌اش جز بر اساس آنچه بنده آورده است رفتار نمی‌کند و بر آن نمی‌افزاید، و این همان قول اوست: «و این گمان شماست (وَذَلِكُمْ ظَنُّكُمُ)». پس او در اعتقاد آن‌ها همسایه‌ای بیگانه است. آن‌ها پیوند خویشاوندی (رحم) خود را قطع کردند، پس خداوند نیز آن‌ها را قطع کرد. چقدر شریف است علم به انساب! به همین دلیل عرب‌ها بر علم انساب پافشاری می‌کردند، تا آنجا که خداوند آنچه را گفتیم از اثبات نسب از دو طریق بیان کرد: طریق «نسب خود را بالا می‌برم» و طریق «رحم شاخه‌ای از رحمان است (الرحم شجنة من الرحمن)» و این همان قول است که «فرزند راز پدر خویش است».\n\nپس چقدر تفاوت است میان مردی که روز قیامت می‌آید در حالی که عارف به نسب خود است، به خویشاوندی خود ناز می‌کند و به واسطه رحم خود به رحمان متوسل می‌شود، و میان کسی که جاهل به همه این‌ها می‌آید و بیگانگی و دوری مناسبت را باور دارد. و اگر هم از طریق خبر (حدیث) بداند، نزد او به منزله این است که پدرش آدم از اوست و او فرزند آدم است، و این را مانند آن قرار می‌دهد. او گمان می‌کند که این نسب سعادتی به او نمی‌دهد، در حالی که در اشتباه است؛ بلکه می‌دهد و بسیار هم می‌دهد. و من این را به صورت ذوق (ذوق) در مکه در عمره‌ای که به نیابت از پدرمان آدم (علیه السلام) به جا آوردم، مشاهده کردم. این امر در رؤیای مبشره‌ای برای من آشکار شد که برخی از مردم برای ما و جماعتی که در آن شب به آن‌ها امر کرده بودم تا همراه من به نیابت از پدرمان آدم عمره به جا آورند، دیدند. او در آن رؤیا از تقریب الهی (تقريب الإلهي) و گشوده شدن درهای آسمان و عروج آن جماعت و استقبال ملأ اعلی (الملأ الأعلى) از آن‌ها با تأیید و آسانی و خوشامدگویی، چیزهایی دید تا آنجا که از آنچه مشاهده کرد مبهوت و حیران شد. زیرا رحم آدم از ما، نزد بیشتر اهل الله (اهل الله) رحمی قطع شده است، پس حال عوام در این باره چگونه است؟ و من به حمدالله آن را وصل کردم و به سبب من وصل شد و بر سنت من جاری گشت، و این از توفیق الهی بود. من در این زمینه قدمی ندیدم که بتوانم بر جای پای کسی در آن گام بردارم. پس خداوند را بر این نعمت سپاس گفتم. و به این امر هدایت نشدم مگر به واسطه نسب الهی، زیرا آن دورترین مناسبت است و سود بخشیده و یادآوری کرده است. و مردم به قول خداوند متعال در مواضع متعدد توجه نکرده‌اند: «ای فرزندان آدم (يا بَنِي آدَمَ)، ای فرزندان آدم (يا بَنِي آدَمَ)». این ذکر می‌شود، اما هیچ‌کس به این ابوت و بنوت توجه نمی‌کند، «و جز خردمندان (أُولُوا الْأَلْبابِ) متذکر نمی‌شوند (وَمَا يَذَّكَّرُ إِلَّا أُولُوا الْأَلْبَابِ)». خداوند ما و شما را از کسانی قرار دهد که به پدر خود نیکی کردند. و چقدر این یادآوری از جانب خداوند در مورد بنی آدم شبیه به قول اوست: «ای خواهر هارون (يا أُخْتَ هَارُونَ)». و زمان هارون کجا و او کجا؟ پس این را بدان، و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}