{
  "id": 326,
  "title": {
    "ar": "الباب السادس والعشرون وثلاثمائة في معرفة منزل التحاور والمنازعة وهو من الحضرة المحمدية الموسوية",
    "en": "Chapter Three Hundred and Twenty-Six: Concerning the Gnosis of the Station of Dialogue and Contention, and it is from the Muhammadan-Mosaic Presence (الحضرة المحمدية الموسوية).",
    "ur": "تین سو چھبیسواں باب: منزل تحاور (التحاور) اور منازعت (المنازعة) کی معرفت (المعرفۃ) میں، اور یہ الحضرة المحمدیۃ الموسویۃ (الحضرة المحمدية الموسوية) سے ہے۔",
    "fa": "باب سیصد و بیست و ششم در معرفت منزل گفت‌وگو و منازعه (تحاور و منازعة) و آن از حضرت محمدی موسوی است."
  },
  "content": {
    "ar": "## «الباب السادس والعشرون وثلاثمائة في معرفة منزل التحاور والمنازعة وهو من الحضرة المحمدية الموسوية»\n\n\n> ينزل الله أينما كنا *** دون أسماء ذاته الحسنى‏\n\n\n> وهو نور والنور مظهره *** ولهذا أزاله عنا\n\n\n> فذوات الكيان مظلمة *** وهي أدنى الدنو لا أدنى‏\n\n\n> ثم حزناه صورة شرفا *** جملة الأمر نعم ما حزنا\n\n\n> سمع الله صوت سائله *** بالذي قد أراده منا\n\n\n> فلهذا نكونه أبدا *** ولهذا عنا فما زلنا\n\n\n> فإذا شاء أن يولدنا *** في هيولى وجوده أمنا\n\n\n> بلبل البال في ذري فنن *** يطرب الشرب كلما غنى‏\n\n\n> فظهرنا به لنا فأبى *** فاستحلنا عنا وما حلنا\nاعلم أيدك الله أن هذا المنزل خاصة دون غيره من المنازل ما فيه علم يظهر منه في الكون أو يدل عليه في العين أو في الاسم أو في الحكم إلا ولحكم الله من حيث هذا الاسم الذي هو الجامع لمراتب الألوهية فيه أي في ذلك العلم نظر من وجه ووجهين وثلاثة وأربعة وأكثر ولا تجد ذلك في غيره من المنازل فسألت كم علم فيه فرفع لي المنزل بكماله فرأيت فيه ثلاثة وعشرين علما منصوبا ونظرت إلى الألوهية في تلك الأعلام كلها فوجدت نظرها إليها من أربعين وجها وقيل لي ما جمعها إلا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ومن هذا المنزل كانت سيادته على جميع العالم فمن ورثه فيه من أمته حصل له من السيادة بقدره في هذه الجمعية ومن هذا المنزل تعطي الحكمة لمن أخلص لله أربعين صباحا فهو يشهد الله في جميع أحواله كما كان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يذكر الله على كل أحيانه ويتضمن هذا المنزل من المسائل معرفة ازدواج المقدمات للإنتاج وعلم منازعة المرسل إليه للرسول صَلَّى اللهُ عَليهِ وسَلَّم مع إيمانه به وبما جاء به من عند الله فيرجع خصما في هذا المنزل ويتولى الله الحكم بين الرسول والمرسل إليه مع علمه بأن الرسول لا ينطق عن الهوى وإنه يبلغ عن الله ما أرسله به ومع هذا كله يدعى عليه في نفس ما جاء به فيرتفع إلى الله ليحكم بينهما وهو من أصعب العلوم في التصور لوجود الايمان والتصديق به من الخصم وفيه علم من ترك خلفه ما شرع له أن يكون أمامه وفيه علم الانتساب أعني انتساب الفروع إلى أصولها ومن ألحق فرعا بغير أصله ما حكم الله فيه من طريق الكشف وفيه علم ظهور الباطل بصورة الحق والباطل عدم لا وجود له والصورة موجودة فهي حق فأين عين الباطل الذي ظهر والصورة إنما هي للحق وما الستر الذي بين العقل والحق حتى يستره الباطل بصورة الحق وعلم الفرق بين الخاطر الأول والخاطر الثاني وإنه غير مؤاخذ بالخاطر الأول مؤاخذ بالخاطر الثاني والثاني عين صورة الأول فلما ذا لم يصدق في الثاني في بعض الأمور كما يصدق في الأول فهل ذلك لمرتبة الثاني فإن الثاني مما زاد في مراتب العدد أصله عدم والأول وجود وبالأول ظهر من الأعداد ما ظهر مما هو ظهر لها وفيه علم إلحاق من استرقه الحجاب من الأمثال بالحرية لمن قلب الحقائق في نظره فالحق الأمور بغير مراتبها والفروع بغير أصولها وفيه علم السبب الإلهي الذي لأجله كان هذا وفيه إضافة علم الأذواق إلى الله تعالى وهو شعور بالعلم بها من غير ذوق فأي نسبة إلهية أعطت مثل هذا الحكم في العلم الإلهي مثل قوله حَتَّى نَعْلَمَ وهو يعلم فهذا هو علم الذوق وفيه علم مقدار إقامة الصفة التي لا تقبل المثل بالعبد لإزالة رفع هذا الواقع من هذا الشخص الذي أنزل الخف منزلة الإمام في غير موضعه فخلط بين الحقائق وتخيل هذا أن‏\n\n\nقول النبي صَلَّى اللهُ عَليهِ وسَلَّم إني أراكم من خلف ظهري‏\n\n\nإنه برؤيته صار إماما فإنما جعل له حكم النظر كما هو للإمام والإمام إمام والخلف خلف فإن عجز عن اللبث تحت قدر حكم هذه الصفة العديمة المثل فلم يكشف غلطه ولا رأى الحق لعجزه عن القيام بهذه المدة التي تفني فيها نفسه حصل في علم آخر في هذا المنزل مجاور لهذا يطلبه بحياة أنفس معدودين موفين له بالصفة التي كان يفنى نفسه فيها فظهر شرف نفسه على غيره حيث قام جماعة من أمثاله مقام نفسه مع الاشتراك في الصورة والمقام والحال وقد بين الله الفرقان بينهما وجعل حق النفس على نفسها أعظم من حقوق أمثالها عليه بلغت ما بلغت فأدخل قاتل أنفس الغير في المشيئة من غير قطع بالمؤاخذة فهو بين العفو والمؤاخذة مع تعلق حقوقهم به وجعل قاتل نفسه في النار بأن حرم عليه الجنة لعظم حق نفسه على نفسه وقد ورد أن حق الله أحق أن يقضى من حق الغير\n\n\nفجعل كذلك حق النفس وفيه علم السبب الذي لأجله رتب هذه الحقوق هكذا وجعل لها هذه الحدود الإلهية وفيه علم صفة عذاب من يستر الحق عن أهله إذا توجه عليه كشفه لهم بالإيجاب الإلهي وفيه علم من عدل عن الحق بعد إقامة البينة عليه المقطوع بها ما الذي عدل به عن الحق وما حكمه في هذا العدول عند الله وفيه علم عذاب أهل الحجب هل عذابهم بحجابهم أو بأمر آخر وفيه علم الجمع للتعريف بالأعمال المنسية عندهم وغير المنسية ومن يتولى ذلك من الأسماء الإلهية وفيه علم تعلق علم الله الذي لا تدركه الأكوان بما في العالم بطريق المشاهدة والمجالسة ثم تأخير التعريف بما كان من الأكوان من الأعمال إلى زمان مخصوص معين عند الله وفيه علم النجوى الأخراوية والدنياوية وفيه علم آداب المناجاة بين المتناجين وبما ذا يبدأ من يناجي ربه أو أحدا من أهل الله وفيه علم اتساع مجالس‏\nالذاكرين الله لكون الله جليسهم من الاسم الواسع وفيه علم مراتب الايمان من العلم وأي الدرجات أرفع وفيه علم المفلسين وما الذي أفلسهم مع ما عندهم من الموجود وفيه علم رجوع الله على العبد متى رجع هل يختلف أو لا يختلف ولما ذا يرجع ذلك الاختلاف إن كان مختلفا هل للراجع أو لحال المرجوع إليه وفيه علم ما ينتجه التولي عن الذكر من الغضب الإلهي وفيه علم ما يغني وما لا يغني وفيه تفرق الأحزاب من أي حقيقة تفرقوا من الحقائق الإلهية وفيه علم الوجوب الإلهي بما ذا تعلق وفيه علم من ترك أحباه لما ذا تركهم وما حليتهم وصفتهم وفيه علم البقاء والفوز والنجاة وكل علم من هذه العلوم الإلهية من الاسم الله لا من غيره من الأسماء ولا تجد ذلك إلا في هذا المنزل خاصة فإنه منزل مخصوص بحكم الله دون سائر الأسماء مع مشاركة بعض الأسماء فيه فهذا بعض ما يحوي عليه هذا المنزل من العلوم عيناها لك لترتفع الهمة منك إلى نيلها فتح مكاشفة من الله ثم نرجع إلى الكلام على بعض ما يحوي عليه هذا المنزل فنقول إن الله قال في كتابه إنه وَضَعَ الْمِيزانَ ليظهر به إقامة العدل في العالم بصورة ظاهرة محسوسة ليرتفع النزاع بين المتنازعين لوجود الكفتين المماثلة للخصمين ولسان الميزان هو الحاكم فإلى أية جهة مال حكم لتلك الجهة بالحق وإن هو بقي في قبته من غير ميل إلى جهة إحدى الكفتين علم إن المتنازعين لكل واحد منهما حق فيما ينازع فيه فيقع له الإنصاف لما شهد له به حاكم لسان الميزان فارتفع الخصام والمنازعة والحاكم لا يكون خصما أبدا فإن نوزع فما ينازعه إلا من عزله من الحكم أو من جهل إنه حاكم ولهذا\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عند نبي لا ينبغي تنازع‏\n\n\nأي لا يكون نزاع مع حضوره أو تمكن الوصول إلى حضوره فإذا فقد ظهر النزاع وادعى كل واحد من الخصماء أن الحق بيده فلو إن الله يفتح عين بصائر الخصماء لمشاهدة الحق ويعلمون أنه بالمرصاد وهو الحاكم وبيده الميزان يرفع ويخفض لم يصح نزاع في العالم فدل وقوعه أن الكل في حجاب عن الحاكم صاحب الوزن والميزان فإذا رأيت من ينازع في العالم فتعلم أنه في حجاب عن الله فإن نازع أحدهما ولم ينازع الآخر بل سكت عنه فتعلم إن الساكت عنه إما صاحب شهود أو صاحب خلق فإن كان النزاع في تعدى حد إلهي فالمنازع في ذلك صاحب أدب إلهي أو متصور بصورة صاحب أدب إلهي وهو المرائي لكنه خير بالجملة فصاحب الأدب الإلهي ما هو منازع وإنما هو ترجمان منازع والمترجم عنهم هم الأسماء الإلهية التي منها نشاء النزاع في العالم ومن أجلها وضع الميزان الشرعي في الدنيا والميزان الأصلي في الآخرة فإن المعز والمذل خصم والضار والنافع خصم والمحيي والمميت خصم والمعطي والمانع خصم وكل اسم له مقابل من الأسماء في الحكم والميزان الموضوع بين هذه الأسماء الاسم الحكم والميزان العدل في القضاء فينظر الحكم استعداد المحل فيحكم له بحسب استعداده فيجعله في حزب أحد الاسمين المتقابلين المتنازعين فإذا علمت وضع الموازين على اختلاف صورها في المعنى والحس كنت أنت عين الحاكم بها وصحت لك النيابة عن الله في كون الميزان بيدك تخفض وترفع غير إن الفارق بينك وبين الله في الوزن إن الله يرفع بالمشيئة ويخفض بالمشيئة وأنت لا أثر لمشيئتك في الوزن وإنما تزن لمن ترى الحق بيده فأنت صاحب علامة تعرف صاحب الحق فتزن له والحق صاحب مشيئة وهنا سر يخفى عن بعض العارفين وهو أن المشيئة تعين بالميزان إذا رفعت أو خفضت إن استعداد المحل أعطى ذلك كما إن وجود الحق في نفس الأمر أعطى لصاحب العلامة أن يزن له لعلمه بأن الحق له كما علم الحق تعالى أن استعداد هذا المحل أعطاه الوزن له ولا أثر للمشيئة في الاستعداد بما هو استعداد وإنما\n\n\nأثرها في تعيين هذا المحل الخاص لهذا الاستعداد الخاص إذ يجوز أن يكون لغيره لا يجوز أن تزول حقيقة الاستعداد ولا إن تنقلب مثل ما نقول في علم الطبيعة إن الحرارة لا تنقلب برودة لكن الحار ينقلب باردا من جهة كونه محلا وعينا لا من كونه حارا ولا باردا فالاستعداد الذي هو كذا لا ينقلب للاستعداد الذي هو كذا وإنما المحل القابل لهذا الاستعداد المعين قابل لغيره من الاستعدادات فالمشيئة خصصته بهذا الاستعداد دون غيره ما خصصت الاستعداد فإني رأيت جماعة من أصحابنا غلطوا في هذه المسألة ورأوا أن المشيئة لا أثر لها في هذا المحل لما يعطيه استعداد ذلك المحل إذ لا أثر لها في الاستعداد والأمر على ما بيناه إن عقلت‏\n\n\n(فمن مسائل هذا الباب)\n\n\nأن ميزان الطبيعة نازع الميزان الإلهي الروحاني لما علمت إن ميزانها ما هو بجعل جاعل وذهلت أن ظهور ميزانها\nفي شي‏ء معين إنما هو بجعل جاعل وهو الميزان الإلهي فلما نازعت الطبيعة بميزانها الميزان الإلهي الروحاني ونازعها الميزان الروحاني الإلهي وهو الأقوى وله الحكم وما وقع الخصام إلا من الطبيعة لأنها ما رضيت بذلك الميزان ولا بالوزن فارتفعت إلى الله تطلب منه أن يحكم بينها وبين الميزان الروحاني ويحكم بينها وبين الروح المتوجه عليها بالنكاح الروحاني النوري لظهور الأجسام الطبيعية والأرواح الجزئية الإنسانية وغير الإنسانية إذ كان كل جسم في العالم مقيدا بصورة روح إلهي يلازم تلك الصورة به تكون مسبحة لله فمن الأرواح ما تكون مدبرة لتلك الصورة لكون الصورة تقبل تدبير الأرواح وهي كل صورة تتصف بالحياة الظاهرة والموت فإن لم تتصف بالحياة الظاهرة والموت فروحها روح تسبيح لا روح تدبير فإذا ظهرت صورة طبيعية تقبل التدبير وظهرت لها نفس جزئية مدبرة لها كانت الصورة بمنزلة الأنثى والروح المدبر لها بمنزلة الذكر فكانت الصورة له أهلا وكان الروح لتلك الصورة بعلا وهذه الأرواح الجزئية متفاضلة بالعلم بالأشياء فمنهم من له علم بأشياء كثيرة ومنهم من لا يعلم إلا القليل ولا أعلم بالله من أرواح الصور التي لا حظ لها في التدبير لكون الصورة لا تقبل ذلك وهي أرواح الجماد ودونهم في رتبة العلم بالله أرواح النبات ودونهم في العلم بالله أرواح الحيوان وكل واحد من هؤلاء الأصناف مفطور على العلم بالله والمعرفة به ولهذا ما لهم هم إلا التسبيح بحمده تعالى ودون هؤلاء في العلم بالله أرواح الإنس وأما الملائكة فهم والجمادات مفطورون على العلم بالله لا عقول لهم ولا شهوة والحيوان مفطور على العلم بالله وعلى الشهوة والإنس والجن مفطورون على الشهوة والمعارف من حيث صورهم لا من حيث أرواحهم وجعل الله لهم العقل ليردوا به الشهوة إلى الميزان الشرعي ويدفع عنهم به منازعة الشهوة في غير المحل المشروع لها لم يوجد الله لهم العقل لاقتناء العلوم والذي أعطاهم الله لاقتناء العلوم إنما هي القوة المفكرة فلذلك لم تفطر أرواحهم على المعارف كما فطرت أرواح الملائكة وما عدا الثقلين ولما تفاضلت مراتب الإنس في العلم بالأشياء أراد بعض الأرواح أن يلحق حكم الصورة التي هو مدبر لها بحكم الطبيعة التي وجدت عنها تلك الصورة وتنزلها منزلتها في الحكم وهي لا تنزل منزلتها أبدا فقال له المعلم هذا الذي رمته محال فإن الصورة لا تفعل فعل الطبيعة فإنها منفعلة عنها وأين رتبة الفاعل من المنفعل أ لا ترى النفس الكلية التي هي أهل للعقل الأول ولما زوج الله بينهما لظهور العالم كان أول مولود ظهر عن النفس الكلية الطبيعية فلم تقو الطبيعة أن تفعل فعل النفس الكلية في الأشياء لأن الجزء ما له حكم الكل والكل له حكم الجزء لأنه بما يحمله من الأجزاء كان كلا فلما عجز هذا الروح الجاهل عن إلحاق الصورة بالطبيعة التي هي أم له قال لعل ذلك لعجزى وقصوري عن إدراك العلم في ذلك فيعود في طلب ذلك من الله إلى الله فطلب من الله أن ينفعل عن الصورة ما ينفعل عن الطبيعة فوجد القوابل التي تؤثر فيها الصورة غير قابلة لما تقبله الصور التي لها قبول أثر الطبيعة والحق سبحانه لا يعطي الأشياء كما تقدم إلا بحسب استعداد المعطي إياه إذ لا يقبل ما لا يعطيه استعداده فلما تبين لهذا الروح خطؤه من صوابه وعلم أنه نفخ في غير ضرم طلب الوقوف مع صورته بحسب ما يعطيه استعدادها فقبل الوصول إلى إبراز ما يلقي منه إلى الصور لإظهار عين ما من أعيان الممكنات المعنوية والحسية أو الخيالية ظهر له في فتوح المكاشفة بالحق لا في فتوح الحلاوة ولا في فتوح العبارة ثلاث مراتب مرتبة الحرية وقد تقدم بابها وهي التي تخرجه عن رق الأكوان لأنه كان قد استرقه هذا الطلب الذي كان عن جهله بالأمور وكان الله أعلم بذلك أنه لا يقع ولا علم له بما في علم الله ولا بما هو الأمر عليه فإن اتصف بهذا المقام وظهر بهذه الحال مكنه الله من مراده ووهبه قوة الإيجاد وإن عجز عن الاتصاف بهذا المقام فهو بحاله أعجز فإن الحال موهبة إلهية والمقام مكتسب فعدل عند ذلك إلى المرتبة الثانية وهي على الترتيب في الحكم والشهود فقام له الحق في التجلي الصمداني فإن قدر على النظر إليه فيه وثبت لتجليه‏\n\n\nولم يك جبليا فيصير دكا ولا موسويا فيصعق كان له ما طلب من الله من الانفعال عن صورته ما يعطيه استعدادها إذا أمكنه الله من الحكم فيها فإن كان موسويا أو جبليا لم يثبت لذلك التجلي المفني من يطلب باستعداده الفناء والمهلك من يطلب باستعداده الهلاك قامت له مرتبة إمساك الحياة على العالم القابل للموت فوجده في رتب على عدد درجات التجلي الصمداني فإنه موت أو إمساك حياة فإن اعتنى الله به وأعطاه القوة على ذلك تصرف في صورته كيف شاء وإن لم يعط\nالقوة على ذلك وعجز فإن كان عجزه عن شهود إلهي أعطاه التصرف في صورته وإن كان عجزه من خلف حجاب نفسه منع من التصرف إذ ليست له قوة إلهية يتصرف بها فهذا قد ذكرنا من ذوق رجال هذا المنزل في هذا المنزل ما بيناه ويطول الشرح لما يحمله كل منزل وهذا منزل ليس في المنازل له شبيه ولا مقاوم وهو من أقوى المنازل منه يقع الإخلاص للنطق بالحكمة بعد الأربعين لمن أخلص من عباد الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 326: On the Gnosis of the Station of Dialogue and Contention (منزل التحاور والمنازعة), which belongs to the Muhammadan-Mosaic Presence (الحضرة المحمدية الموسوية)\n\n> Allah descends wherever we are,\n> Apart from the Names of His Beautiful Essence (أسماء ذاته الحسنى).\n> He is Light (نور), and the Light is His manifestation (مظهره);\n> And for this reason, He removed it from us.\n> Thus, the essences of existence (ذوات الكيان) are dark,\n> And this is the nearest proximity (أدنى الدنو), not the lowest.\n> Then we attained Him as a form of honor (صورة شرفا);\n> The totality of the matter: excellent is what we have attained.\n> Allah heard the voice of His petitioner,\n> Regarding that which He desired from us.\n> Therefore, we are Him eternally,\n> And for this reason, we have never ceased to be from Him.\n> So if He wills to give birth to us,\n> In the primal matter (هيولى) of His Being (وجوده), we are safe.\n> The nightingale of the heart (بلبل البال) on the peak of a branch,\n> Delights the drinkers (الشرب) whenever it sings.\n> So we appeared through Him for ourselves, but He refused;\n> Thus, we transformed away from Him, yet we did not depart.\n\nKnow, may Allah aid you, that this station (منزل), specifically, unlike other stations, contains no knowledge (علم) that manifests in the Cosmos (الكون) or is indicated in the Fixed Entity (العين), the Name (الاسم), or the Ruling (الحكم), except that the Ruling of Allah (حكم الله)—from the perspective of this Name which is the comprehensive container of the degrees of Divinity (مراتب الألوهية)—has a scrutiny (نظر) directed toward it (that knowledge) from one, two, three, four, or more aspects. You will not find this characteristic in any other station.\n\nI asked how many sciences it contained, and the entire station was raised up for me. I saw twenty-three established sciences (علما منصوبا) within it. I looked at the Divinity (الألوهية) in all those signs and found its scrutiny directed toward them from forty aspects. I was told: \"Only the Messenger of Allah (peace and blessings be upon him) gathered them.\"\n\nFrom this station came his mastery (سيادته) over the entire cosmos. Whoever inherits from him in this station among his community attains mastery commensurate with his degree in this comprehensive gathering (الجمعية). From this station, wisdom (الحكمة) is granted to whoever dedicates himself sincerely to Allah for forty mornings. Such a person witnesses Allah in all his states, just as the Messenger of Allah (peace and blessings be upon him) remembered Allah in all his moments.\n\nThis station includes, among its issues, the gnosis of the coupling of premises (ازدواج المقدمات) for production (للإنتاج), and the science of the contention (منازعة) of the recipient of the message (المرسل إليه) with the Messenger (peace and blessings be upon him), despite the recipient’s faith in him and in what he brought from Allah. The recipient returns as an adversary (خصما) in this station. Allah Himself undertakes the judgment between the Messenger and the recipient, even though He knows that the Messenger does not speak out of caprice (الهوى) and that he conveys from Allah what He sent him with. Despite all this, the Messenger is challenged regarding the very thing he brought, and the matter is raised to Allah to judge between them. This is one of the most difficult sciences to conceive, due to the existence of faith and affirmation (الإيمان والتصديق) on the part of the adversary.\n\nIt includes the science of one who leaves behind what was legislated for him to be before him. It includes the science of attribution (الانتساب), meaning the attribution of branches (الفروع) to their roots (أصولها), and Allah’s ruling, revealed through Unveiling (الكشف), concerning one who attaches a branch to a root other than its own.\n\nIt includes the science of the appearance of Falsehood (الباطل) in the guise of the Real (الحق). Falsehood is non-existence (عدم), having no being (وجود له). The form (الصورة) is existent, thus it is Real (حق). So, where is the essence (عين) of the Falsehood that appeared? The form belongs only to the Real. And what is the veil (الستر) between the Intellect (العقل) and the Real, such that Falsehood can veil it in the form of the Real?\n\nIt includes the science of the difference between the first thought (الخاطر الأول) and the second thought (الخاطر الثاني), and that one is not held accountable for the first thought but is held accountable for the second. The second is the very form (عين صورة) of the first. Why, then, is the second not affirmed in certain matters, as the first is affirmed? Is this due to the rank (مرتبة) of the second? For the second, being an increase in the ranks of number, its origin is non-existence (عدم), while the first is existence (وجود). Through the first, the numbers that appeared—which are manifestations of the first—came into being.\n\nIt includes the science of attaching those whom the veil (الحجاب) has enslaved, by way of similitudes (الأمثال), to the state of freedom (الحرية) for one who reverses the realities (قلب الحقائق) in his contemplation—attaching matters to ranks other than their own, and branches to roots other than their own.\n\nIt includes the science of the Divine Cause (السبب الإلهي) for which this occurred. It includes the attribution of the science of tastes (علم الأذواق) to Allah the Exalted, which is the perception (شعور) of knowledge concerning them without tasting (ذوق). What Divine proportion (نسبة إلهية) granted such a ruling in Divine Knowledge (العلم الإلهي), such as His saying: <<حَتَّى نَعْلَمَ>> (Until We know), while He is All-Knowing? This is the science of tasting (علم الذوق).\n\nIt includes the science of the measure of establishing the Attribute (الصفة) that accepts no likeness (المثل) with the servant, in order to remove the error committed by the person who placed the rear (الخلف) in the position of the Imam (الإمام) in the wrong place, thereby confusing the realities (الحقائق). This person imagined that the Prophet’s saying (peace and blessings be upon him):\n\n> \"Indeed, I see you from behind my back,\"\n\nmeant that by this vision he became the Imam. Rather, he was granted the ruling of vision (حكم النظر) just as it is granted to the Imam. But the Imam is the Imam, and the rear is the rear.\n\nIf he is incapable of remaining under the power of the ruling of this peerless Attribute (الصفة العديمة المثل), his error is not unveiled to him, nor does he see the Real, due to his inability to maintain the duration in which his soul (نفسه) is annihilated (تفنى فيها). He then enters another science in this station, adjacent to the first, which he seeks by the life of a counted number of souls (أنفس معدودين) who fulfill for him the Attribute in which he was annihilating his own soul. Thus, the honor of his soul (شرف نفسه) over others becomes apparent, since a group of his peers stood in the place of his own soul, despite sharing the form, the station, and the state.\n\nAllah has clarified the Criterion (الفرقان) between them and made the right of the soul upon itself greater than the rights of its peers upon it, no matter how great those rights may be. Therefore, He placed the killer of other souls (قاتل أنفس الغير) under the Divine Will (المشيئة), without definitively cutting off accountability (المؤاخذة). Such a person is between pardon and accountability, even though the rights of the victims are attached to him. But He placed the killer of his own soul (قاتل نفسه) in the Fire, by forbidding him Paradise, due to the magnitude of the right of his soul upon himself. It has been reported that the right of Allah is more deserving of being fulfilled than the right of others. Thus, the right of the soul was made likewise.\n\nIt includes the science of the reason (السبب) for which these rights were ordered in this manner and for which these Divine boundaries (الحدود الإلهية) were established for them. It includes the science of the description of the punishment (عذاب) of one who conceals the Real (الحق) from its people, when the Divine Obligation (الإيجاب الإلهي) requires him to unveil it to them. It includes the science of one who deviates from the Real after conclusive evidence (البينة المقطوع بها) has been established against him: what caused him to deviate from the Real, and what is his ruling (حكمه) concerning this deviation in the sight of Allah?\n\nIt includes the science of the punishment of the people of the veils (أهل الحجب): is their punishment due to their veil, or due to another matter? It includes the science of the gathering (الجمع) for the definition (التعريف) of deeds, both those forgotten by them and those not forgotten, and which of the Divine Names (الأسماء الإلهية) undertakes this task. It includes the science of the connection of Allah’s Knowledge—which the created things (الأكوان) cannot grasp—to what is in the world (العالم) through observation (المشاهدة) and companionship (المجالسة), followed by the deferral of the definition of the deeds that were from the created things until a specific, determined time known to Allah.\n\nIt includes the science of the secret counsel (النجوى), both in the Hereafter (الأخراوية) and in this world (الدنياوية). It includes the science of the etiquette (آداب) of intimate conversation (المناجاة) between those who converse, and with what one should begin when conversing intimately with his Lord or with any of the People of Allah (أهل الله). It includes the science of the spaciousness (اتساع) of the gatherings of those who remember Allah (الذاكرين), due to Allah being their Companion (جليسهم) through the Name *al-Wāsiʿ* (The All-Encompassing).\n\nIt includes the science of the ranks of faith (مراتب الإيمان) derived from Knowledge (العلم), and which degrees are the highest. It includes the science of the bankrupt (المفلسين) and what bankrupted them, despite the existent things (الموجود) they possess. It includes the science of Allah’s return (رجوع) to the servant when the servant returns: does it differ or not differ? And why does that difference occur, if it is different? Is it due to the one returning (الراجع) or due to the state of the One returned to (المرجوع إليه)?\n\nIt includes the science of what turning away from remembrance (الذكر) produces in terms of Divine Wrath (الغضب الإلهي). It includes the science of what suffices and what does not suffice. It includes the science of the separation of the parties (تفرق الأحزاب): from which Divine Reality (حقيقة إلهية) did they separate? It includes the science of the Divine Obligation (الوجوب الإلهي): to what is it attached? It includes the science of one who abandoned his loved ones (أحباه): why did he abandon them, and what are their characteristics and descriptions? It includes the science of Subsistence (البقاء), Triumph (الفوز), and Salvation (النجاة).\n\nEvery one of these Divine sciences (العلوم الإلهية) originates from the Name *Allah* (الاسم الله), and not from any other Name. You will not find this except specifically in this station, for it is a station specialized by the Ruling (حكم) of *Allah* (the comprehensive Name), apart from all other Names, even though some Names participate in it. This is but a portion of the sciences contained in this station. We have defined them for you so that your aspiration (الهمة) may be elevated toward attaining them through an opening of Divine Unveiling (فتح مكاشفة من الله).\n\nThen we return to discussing some of what this station contains. We say that Allah said in His Book that He <<وَضَعَ الْمِيزانَ>> (established the Balance/Mīzān), so that the establishment of justice (العدل) in the world (العالم) might appear in a manifest, sensible form, thereby removing contention (النزاع) between adversaries (المتنازعين). This is due to the existence of the two pans (الكفتين), which are analogous to the two adversaries (الخصمين). The tongue of the Balance (لسان الميزان) is the judge (الحاكم). Whichever direction it inclines, it rules with the Real (الحق) for that side. If it remains in its dome (قبته) without inclining toward either pan, it is known that both adversaries have a right in the matter they dispute. Thus, justice (الإنصاف) is rendered to him based on what the judge, the tongue of the Balance, testified for him. This removes dispute and contention.\n\nThe judge can never be an adversary. If he is disputed, he is only disputed by one who has dismissed him from judgment or by one who is ignorant that he is the judge. For this reason, the Messenger of Allah (peace and blessings be upon him) said:\n\n> \"There should be no contention in the presence of a Prophet,\"\n\nmeaning, there should be no dispute when he is present or when access to his presence is possible. If he is absent, dispute appears, and each adversary claims that the Real is in his hand. If Allah were to open the inner sight (عين بصائر) of the adversaries to witness the Real, and they knew that He is ever watchful (بالمرصاد), and He is the Judge, and the Balance is in His hand, raising and lowering, no dispute would be valid in the world. The occurrence of dispute indicates that everyone is veiled (في حجاب) from the Judge, the Master of Weight and the Balance.\n\nIf you see someone disputing in the world, know that he is veiled from Allah. If one of them disputes and the other does not, but remains silent, know that the silent one is either a person of Witnessing (صاحب شهود) or a person of character (صاحب خلق). If the dispute concerns the transgression of a Divine boundary (حد إلهي), the disputant is either a person of Divine etiquette (صاحب أدب إلهي) or one who assumes the form of a person of Divine etiquette (the hypocrite/المرائي), but he is good overall. The person of Divine etiquette is not the disputant; rather, he is the translator (ترجمان) for the disputant. The ones being translated for are the Divine Names (الأسماء الإلهية) from which the dispute in the world arises, and for the sake of which the legal Balance (الميزان الشرعي) was established in this world and the original Balance (الميزان الأصلي) in the Hereafter.\n\nFor *al-Muʿizz* (The Giver of Honor) and *al-Mudhill* (The Giver of Humiliation) are adversaries; *al-Ḍārr* (The Harmer) and *al-Nāfiʿ* (The Benefiter) are adversaries; *al-Muḥyī* (The Giver of Life) and *al-Mumīt* (The Giver of Death) are adversaries; *al-Muʿṭī* (The Giver) and *al-Māniʿ* (The Withholder) are adversaries. Every Name has an opposing Name in the ruling. The Balance established between these Names is the Name *al-Ḥakam* (The Judge), and the Balance is Justice (العدل) in decree. The Judge looks at the preparedness (استعداد) of the locus (المحل) and rules for it according to its preparedness, placing it in the party (حزب) of one of the two opposing, contending Names.\n\nIf you know the establishment of the Balances, despite their varying forms in meaning and sensation, you yourself become the very Judge of them, and the vicegerency (النيابة) from Allah becomes valid for you, in that the Balance is in your hand, lowering and raising. However, the difference between you and Allah in weighing is that Allah raises by the Will (المشيئة) and lowers by the Will, whereas your will has no effect on the weighing. Rather, you weigh for the one whom you see the Real is in his hand. You are the possessor of a sign (علامة) by which you recognize the possessor of the Real and weigh for him. The Real is the possessor of the Will (صاحب مشيئة).\n\nHere is a secret hidden from some Gnostics (العارفين): The Will determines by the Balance, when it raises or lowers, that the preparedness of the locus granted that. Just as the existence of the Real in the matter itself granted the possessor of the sign the ability to weigh for him, due to his knowledge that the Real belongs to him, so too did the Real (الحق) know that the preparedness of this locus granted it the weighing. The Will has no effect on preparedness *as* preparedness. Rather, its effect is in designating this specific locus for this specific preparedness, since it is permissible for it to belong to another. It is not permissible for the reality of preparedness to vanish or to be inverted. This is like what we say in the science of nature (علم الطبيعة): heat (الحرارة) does not invert into coldness (البرودة), but the hot thing (الحار) inverts into a cold thing, from the perspective of its being a locus and an entity (عينا), not from the perspective of its being hot or cold. Preparedness that is *such-and-such* does not invert into preparedness that is *thus-and-so*. Rather, the locus (المحل) that accepts this specific preparedness is capable of accepting other preparednesses. The Will specialized it with this preparedness over others; it did not specialize the preparedness itself. I have seen a group of our companions err on this issue, believing that the Will has no effect on this locus due to what the preparedness of that locus grants, since the Will has no effect on preparedness. The matter is as we have explained, if you understand.\n\n(Among the issues of this chapter): The Balance of Nature (ميزان الطبيعة) contended with the Divine Spiritual Balance (الميزان الإلهي الروحاني), because Nature knew that its balance was not established by an establisher (جاعل). It forgot that the manifestation of its balance in a specific thing is indeed by an establisher, which is the Divine Balance. When Nature contended with its balance against the Divine Spiritual Balance, the Divine Spiritual Balance contended against it—and it is the stronger, and the ruling belongs to it. The dispute (الخصام) only arose from Nature because it was not satisfied with that Balance or the weighing. So, it ascended to Allah, asking Him to judge between it and the Spiritual Balance, and to judge between it and the Spirit (الروح) that governs it through the luminous spiritual marriage (النكاح الروحاني النوري) for the manifestation of natural bodies (الأجسام الطبيعية) and partial human and non-human spirits (الأرواح الجزئية).\n\nEvery body in the world is constrained by the form of a Divine Spirit (روح إلهي) that adheres to that form, by which it performs the glorification (مسبحة) of Allah. Some spirits govern that form because the form accepts the governance of spirits—these are all forms characterized by manifest life and death. If a form is not characterized by manifest life and death, its spirit is a spirit of glorification, not a spirit of governance. When a natural form appears that accepts governance, and a partial soul (نفس جزئية) appears to govern it, the form is in the position of the female (الأنثى), and the governing spirit is in the position of the male (الذكر). Thus, the form is a spouse (أهلا) for the spirit, and the spirit is a husband (بعلا) for that form.\n\nThese partial spirits are differentiated in their knowledge of things. Some have knowledge of many things, and some know only a little. The spirits of forms that have no share in governance—because the form does not accept it, such as the spirits of inanimate objects (الجماد)—have the deepest knowledge of Allah. Below them in the rank of knowledge of Allah are the spirits of plants (النبات). Below them in the knowledge of Allah are the spirits of animals (الحيوان). Every one of these categories is created upon the innate disposition (مفطور) of knowing Allah and having gnosis (المعرفة) of Him. For this reason, their only concern is glorification with His praise. Below these in the knowledge of Allah are the spirits of humans (الإنس).\n\nAs for the angels and inanimate objects, they are created upon the innate disposition of knowing Allah; they have neither intellect (عقول) nor desire (شهوة). Animals are created upon the innate disposition of knowing Allah and upon desire. Humans and Jinn are created upon desire and gnosis (المعارف) from the perspective of their forms, not their spirits. Allah gave them the Intellect (العقل) so that they might restrain desire according to the legal Balance (الميزان الشرعي) and repel the contention of desire in places not legislated for it. Allah did not create the Intellect for the acquisition of sciences. What Allah gave them for the acquisition of sciences is the faculty of thought (القوة المفكرة). Therefore, their spirits were not created upon the innate disposition of gnosis, as were the spirits of the angels and everything other than the two weighty ones (الثقلين).\n\nSince the ranks of humans differ in the knowledge of things, some spirits desired to attach the ruling of the form they govern to the ruling of Nature (الطبيعة) from which that form originated, and to place it in the same rank of ruling. But the form can never attain that rank. The Teacher (المعلم) said to him: \"What you sought is impossible, for the form does not perform the act of Nature; it is acted upon by Nature. What is the rank of the agent (الفاعل) compared to the patient (المنفعل)?\" Do you not see the Universal Soul (النفس الكلية), which is the locus for the First Intellect (العقل الأول)? When Allah married them for the manifestation of the world, the first offspring that appeared was from the Universal Soul and Nature. Nature was not strong enough to perform the act of the Universal Soul in things, because the part does not have the ruling of the whole, while the whole has the ruling of the part, because it is a whole by virtue of the parts it carries.\n\nWhen this ignorant spirit failed to attach the form to Nature, which is its mother, it said: \"Perhaps this is due to my incapacity and deficiency in grasping the knowledge of that.\" So, it returned to seeking that from Allah. It asked Allah that the form be acted upon (ينفعل) by what Nature is acted upon. It found that the recipients (القوابل) upon which the form acts are not receptive to what the forms that accept the effect of Nature receive. The Real (الحق), Exalted is He, only grants things according to the preparedness (استعداد) of the recipient, as nothing accepts what its preparedness does not grant it.\n\nWhen this spirit realized its error from its correctness, and knew that it was blowing into non-kindling (نفخ في غير ضرم), it sought to remain with its form according to what its preparedness grants. It accepted the ability to bring forth what it casts into the forms, in order to manifest the essence (عين) of any of the intelligible, sensible, or imaginative possible things (الممكنات).\n\nIn the opening of Unveiling (فتوح المكاشفة) by the Real—not in the opening of sweetness (الحلاوة) nor the opening of expression (العبارة)—three ranks appeared to him:\n\n1.  **The Rank of Freedom (مرتبة الحرية):** Its chapter has preceded. This rank removes him from the servitude (رق) of created things (الأكوان), because he had been enslaved by this seeking, which arose from his ignorance of matters. Allah knew best that this would not occur, and the spirit had no knowledge of what was in Allah’s Knowledge or what the matter truly was. If he is characterized by this station and manifests this state, Allah empowers him with his desire and grants him the power of origination (قوة الإيجاد). If he is incapable of being characterized by this station, he is even more incapable in his state, for the state (الحال) is a Divine gift, while the station (المقام) is acquired.\n2.  **The Rank of Judgment and Witnessing (مرتبة الحكم والشهود):** He then turned to the second rank, which is ordered in judgment and witnessing. The Real stood for him in the Samadānī Theophany (التجلي الصمداني). If he is able to look at it therein and remain firm in its Theophany—neither being *Jabalī* (mountain-like, becoming dust) nor *Mūsawī* (Mosaic, fainting)—he will attain what he sought from Allah: that his form be acted upon according to what its preparedness grants, provided Allah empowers him with the ruling over it.\n3.  **The Rank of Sustaining Life (مرتبة إمساك الحياة):** If he is Mosaic or mountain-like, he will not remain firm before that Annihilating Theophany (التجلي المفني) that seeks annihilation (فناء) by its preparedness and destruction (هلاك) by its preparedness. The rank of sustaining life over the world capable of death arose for him. He found this in ranks corresponding to the degrees of the Samadānī Theophany, for it is either death or the sustaining of life.\n\nIf Allah cares for him and grants him the power over that, he disposes of his form however he wills. If he is not granted the power and is incapable, and his incapacity stems from a Divine witnessing (شهود إلهي), Allah grants him disposition over his form. But if his incapacity stems from behind the veil of his own soul (حجاب نفسه), he is prevented from disposition, as he lacks the Divine power by which he disposes.\n\nWe have mentioned what we clarified concerning the tasting (ذوق) of the men of this station. The explanation of what each station contains would be lengthy. This station has no likeness or equal among the stations. It is one of the strongest stations. From it arises the sincerity (الإخلاص) for speaking wisdom (الحكمة) after the forty days for those servants of Allah who are sincere. And Allah says the Truth, and He guides to the Way. <<وَاللهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>>.",
    "ur": "باب نمبر تین سو چھبیس: منزل التحاور والمنازعة (منزل التحاور والمنازعة) کی معرفت میں، اور یہ مقام الحضرة المحمدیۃ الموسویۃ (الحضرة المحمدیۃ الموسویۃ) سے ہے۔\n\nاللہ نازل ہوتا ہے جہاں بھی ہم ہوں،\nاپنی ذات کے اسماء حسنیٰ کے بغیر۔\n\nوہ نور ہے اور نور اس کا مظہر ہے،\nاور اسی لیے اس نے اسے ہم سے دور کر دیا۔\n\nپس وجود کی ذاتیں تاریک ہیں،\nاور وہ ادنیٰ ترین قربت ہے، نہ کہ ادنیٰ۔\n\nپھر ہم نے اسے شرف کی صورت میں حاصل کیا،\nحاصل کلام یہ ہے کہ ہم نے کیا خوب حاصل کیا۔\n\nاللہ نے اپنے سائل کی آواز سنی،\nاس چیز کے ساتھ جو اس نے ہم سے ارادہ کی تھی۔\n\nپس اسی لیے ہم ہمیشہ اس کے ہوتے ہیں،\nاور اسی لیے ہم اس سے کبھی دور نہیں ہوئے۔\n\nپس جب وہ چاہے کہ ہمیں پیدا کرے،\nاپنے وجود (الوجود) کے ہیولیٰ میں، تو ہم امن میں آ گئے۔\n\nذہن کی بلبل شاخ کی چوٹی پر ہے،\nجب بھی وہ گاتی ہے، پینے والوں کو مست کر دیتی ہے۔\n\nپس ہم اس کے ذریعے ہمارے لیے ظاہر ہوئے، تو اس نے انکار کر دیا،\nپھر ہم نے اپنے آپ کو ہم سے حلال کر لیا اور ہم نے قیام نہیں کیا۔\n\nجان لو، اللہ تمہاری تائید کرے، کہ یہ منزل خاص طور پر دیگر منازل کے برعکس ہے؛ اس میں کوئی ایسا علم نہیں ہے جو کائنات میں ظاہر ہو، یا کسی عین، اسم، یا حکم میں اس پر دلالت کرے، مگر یہ کہ اللہ کے حکم کا، اس اسم کے اعتبار سے جو الوہیت کے مراتب کا جامع ہے، اس علم میں ایک، دو، تین، چار یا اس سے زیادہ پہلوؤں سے نظر ہوتی ہے۔ اور یہ بات تمہیں کسی دوسری منزل میں نہیں ملے گی۔\n\nپس میں نے سوال کیا کہ اس میں کتنے علوم ہیں؟ تو پوری منزل میرے لیے بلند کر دی گئی، اور میں نے اس میں تئیس (۲۳) علوم نصب شدہ دیکھے۔ میں نے ان تمام علوم میں الوہیت (الألوہیۃ) کی طرف نظر کی تو پایا کہ اس کی نظر ان کی طرف چالیس (۴۰) پہلوؤں سے ہے۔ اور مجھ سے کہا گیا کہ ان سب کو رسول اللہ ﷺ کے سوا کسی نے جمع نہیں کیا۔ اور اسی منزل سے آپ ﷺ کی تمام عالم پر سیادت (سرداری) تھی۔ پس آپ کی امت میں سے جو شخص اس میں آپ کا وارث بنا، اسے اس جامعیت میں اپنے مرتبے کے مطابق سیادت حاصل ہوئی۔ اور اسی منزل سے حکمت اسے عطا کی جاتی ہے جو چالیس صبحوں تک اللہ کے لیے اخلاص اختیار کرے، پس وہ تمام احوال میں اللہ کا شہود (الشہود) کرتا ہے، جیسا کہ رسول اللہ ﷺ ہر وقت اللہ کا ذکر کرتے تھے۔\n\nیہ منزل ان مسائل کو بھی شامل کرتی ہے: نتائج پیدا کرنے کے لیے مقدمات کے جوڑے بنانے کی معرفت؛ اور مرسل الیہ (جس کی طرف رسول بھیجا گیا) کا رسول اللہ ﷺ سے جھگڑا کرنا، باوجود اس کے کہ وہ آپ پر اور جو کچھ آپ اللہ کی طرف سے لائے ہیں اس پر ایمان رکھتا ہے۔ پس وہ اس منزل میں فریق مخالف بن جاتا ہے۔ اور اللہ تعالیٰ رسول اور مرسل الیہ کے درمیان فیصلہ خود سنبھالتا ہے، باوجود اس کے کہ وہ جانتا ہے کہ رسول اپنی خواہش سے نہیں بولتا اور وہ اللہ کی طرف سے بھیجے گئے پیغام کو پہنچاتا ہے۔ اس سب کے باوجود، اس چیز کے بارے میں جس کے ساتھ وہ آیا ہے، اس پر دعویٰ کیا جاتا ہے، پس وہ اللہ کی طرف رجوع کرتا ہے تاکہ وہ ان کے درمیان فیصلہ کرے۔ یہ تصور میں سب سے مشکل علوم میں سے ہے، کیونکہ فریق مخالف کی طرف سے ایمان اور تصدیق موجود ہوتی ہے۔\n\nاور اس میں اس شخص کا علم ہے جس نے وہ چیز پیچھے چھوڑ دی جو اس کے لیے مشروع تھی کہ وہ اس کے آگے ہو۔ اور اس میں انتساب کا علم ہے، یعنی فروع کا اپنے اصول سے انتساب؛ اور جس نے کسی فرع کو اس کے اصل کے علاوہ کسی اور سے ملایا، اس بارے میں اللہ کا حکم کشف (الکشف) کے ذریعے کیا ہے۔ اور اس میں باطل کا حق (الحق) کی صورت میں ظاہر ہونے کا علم ہے۔ اور باطل عدم (عدم) ہے، اس کا کوئی وجود (الوجود) نہیں، جبکہ صورت موجود ہے، پس وہ حق ہے۔ تو باطل کی وہ عین کہاں ہے جو ظاہر ہوئی؟ اور صورت تو صرف حق کے لیے ہے۔ اور وہ پردہ کیا ہے جو عقل اور حق کے درمیان ہے، یہاں تک کہ باطل اسے حق کی صورت میں چھپا دیتا ہے؟\n\nاور پہلے خاطر (خیال) اور دوسرے خاطر کے درمیان فرق کا علم؛ اور یہ کہ پہلے خاطر پر اس سے مواخذہ نہیں ہوتا، جبکہ دوسرے خاطر پر مواخذہ ہوتا ہے، حالانکہ دوسرا پہلے کی عین صورت ہے۔ تو بعض امور میں دوسرے میں سچائی کیوں نہیں ہوتی جیسا کہ پہلے میں ہوتی ہے؟ کیا یہ دوسرے کے مرتبے کی وجہ سے ہے؟ کیونکہ دوسرا ان چیزوں میں سے ہے جو عدد کے مراتب میں اضافہ کرتی ہے، اس کی اصل عدم (عدم) ہے اور پہلا وجود (الوجود) ہے۔ اور پہلے کے ذریعے اعداد میں سے وہ ظاہر ہوا جو ان کے لیے ظاہر ہے۔\n\nاور اس میں ان لوگوں کو آزادی (حریۃ) سے ملانے کا علم ہے جنہیں حجاب نے مثالوں میں غلام بنا لیا، اس شخص کے لیے جو حقائق (الحقائق) کو اپنی نظر میں پلٹ دیتا ہے، پس وہ امور کو ان کے مراتب کے بغیر اور فروع کو ان کے اصول کے بغیر ملاتا ہے۔ اور اس میں اس الٰہی سبب کا علم ہے جس کی وجہ سے یہ سب ہوا۔ اور اس میں علمِ اذواق (ذوق کے علوم) کو اللہ تعالیٰ کی طرف منسوب کرنا ہے، اور وہ ان کا علم بغیر ذوق کے محسوس کرنا ہے۔ تو کون سی الٰہی نسبت نے علمِ الٰہی میں ایسا حکم دیا، جیسے اس کا فرمان: **\"حَتَّى نَعْلَمَ\"** (یہاں تک کہ ہم جان لیں)، حالانکہ وہ جانتا ہے؟ پس یہی علم الذوق ہے۔\n\nاور اس میں اس صفت کے قیام کی مقدار کا علم ہے جو بندے کے ساتھ مماثلت قبول نہیں کرتی، تاکہ اس شخص کے اس واقعے کو ختم کیا جا سکے جس نے پیچھے والے کو امام کے مقام پر رکھ دیا، جو اس کا مقام نہیں تھا۔ پس اس نے حقائق (الحقائق) کو خلط ملط کر دیا۔ اور اس شخص نے یہ گمان کیا کہ نبی ﷺ کا یہ فرمان: **\"إني أراكم من خلف ظهري\"** (میں تمہیں اپنی پیٹھ کے پیچھے سے دیکھتا ہوں)، اس دیکھنے کی وجہ سے وہ امام بن گیا۔ حالانکہ اس کے لیے صرف نظر کا حکم مقرر کیا گیا جیسا کہ امام کے لیے ہوتا ہے، اور امام امام ہے اور پیچھے والا پیچھے والا ہے۔ پس اگر وہ اس بے مثال صفت کے حکم کے تحت ٹھہرنے کی طاقت نہ رکھ سکا، تو اس کی غلطی ظاہر نہ ہوئی اور نہ ہی اس نے حق (الحق) کو دیکھا، کیونکہ وہ اس مدت کو قائم رکھنے سے عاجز رہا جس میں اس کا نفس فنا (الفناء) ہو جاتا ہے۔\n\nاس کے پڑوس میں اس منزل میں ایک اور علم حاصل ہوا، جو اسے گنے چنے نفوس کی زندگی کے ذریعے طلب کرتا ہے جو اس صفت کو پورا کرتے ہیں جس میں وہ اپنے نفس کو فنا کر رہا تھا۔ پس اس کے نفس کا شرف دوسروں پر ظاہر ہوا، جہاں اس کے جیسے لوگوں کی ایک جماعت اس کے نفس کے مقام پر کھڑی ہوئی، باوجود اس کے کہ وہ صورت، مقام اور حال میں شریک تھے۔ اور اللہ نے ان دونوں کے درمیان فرقان (فرق) واضح کر دیا، اور نفس کا حق اس پر اس کے ہم مثلوں کے حقوق سے زیادہ عظیم قرار دیا، خواہ وہ کتنے ہی ہوں۔ پس اس نے دوسروں کے نفوس کے قاتل کو مشیئت (ارادے) میں داخل کیا، بغیر مواخذے کے قطعی حکم کے، پس وہ عفو اور مواخذے کے درمیان ہے، باوجود اس کے کہ ان کے حقوق اس سے متعلق ہیں۔ اور اپنے نفس کے قاتل کو آگ میں ڈال دیا، اس پر جنت حرام کر دی، کیونکہ اس کے نفس کا حق اس پر بہت بڑا تھا۔ اور یہ وارد ہوا ہے کہ اللہ کا حق زیادہ حقدار ہے کہ غیر کے حق سے پہلے ادا کیا جائے، پس اسی طرح نفس کا حق بھی قرار دیا گیا۔\n\nاور اس میں اس سبب کا علم ہے جس کی وجہ سے ان حقوق کو اس طرح ترتیب دیا گیا اور ان کے لیے یہ الٰہی حدود مقرر کی گئیں۔ اور اس میں اس شخص کے عذاب کی صفت کا علم ہے جو حق (الحق) کو اس کے اہل سے چھپاتا ہے، جب اس پر الٰہی ایجاب کے ذریعے ان کے لیے اس کا کشف (الکشف) کرنا لازم ہو جائے۔ اور اس میں اس شخص کا علم ہے جو قطعی دلیل قائم ہونے کے بعد حق سے پھر گیا، کس چیز نے اسے حق سے پھیرا، اور اللہ کے نزدیک اس انحراف کا حکم کیا ہے؟ اور اس میں اہل حجاب کے عذاب کا علم ہے، کیا ان کا عذاب ان کے حجاب کی وجہ سے ہے یا کسی اور امر کی وجہ سے؟ اور اس میں ان کے نزدیک بھولی ہوئی اور نہ بھولی ہوئی اعمال کی تعریف کے لیے جمع کرنے کا علم ہے، اور کون سے الٰہی اسماء اس کی ذمہ داری لیتے ہیں۔\n\nاور اس میں اللہ کے اس علم کا تعلق ہے جسے کائناتیں نہیں پا سکتیں، جو عالم میں مشاہدہ (المشاہدۃ) اور ہم نشینی کے ذریعے موجود ہے، پھر کائناتوں کے اعمال کی تعریف کو اللہ کے نزدیک ایک مخصوص مقررہ وقت تک مؤخر کرنا۔ اور اس میں اخروی اور دنیاوی سرگوشی (نجویٰ) کا علم ہے۔ اور اس میں سرگوشی کرنے والوں کے درمیان مناجات کے آداب کا علم ہے، اور جو شخص اپنے رب سے یا اہل اللہ میں سے کسی سے مناجات کرتا ہے، وہ کس چیز سے آغاز کرے۔ اور اس میں اللہ کا اسم الواسع ہونے کی وجہ سے ذاکرین (اللہ کا ذکر کرنے والوں) کی مجالس کی وسعت کا علم ہے۔\n\nاور اس میں علم سے ایمان کے مراتب کا علم ہے اور کون سے درجات بلند تر ہیں۔ اور اس میں مفلسوں کا علم ہے اور کس چیز نے انہیں مفلس کیا، باوجود اس کے کہ ان کے پاس موجود (موجود) ہے۔ اور اس میں بندے کی طرف اللہ کے رجوع کا علم ہے، جب وہ رجوع کرتا ہے، تو کیا یہ مختلف ہوتا ہے یا نہیں؟ اور اگر یہ مختلف ہوتا ہے تو یہ اختلاف کیوں ہوتا ہے؟ کیا یہ رجوع کرنے والے کی وجہ سے ہے یا اس کی حالت کی وجہ سے جس کی طرف رجوع کیا گیا؟ اور اس میں ذکر سے منہ موڑنے کے نتیجے میں پیدا ہونے والے غضبِ الٰہی کا علم ہے۔ اور اس میں اس چیز کا علم ہے جو بے نیاز کرتی ہے اور جو بے نیاز نہیں کرتی۔ اور اس میں گروہوں کے تفرقے کا علم ہے کہ وہ الٰہی حقائق (الحقائق الإلہیۃ) میں سے کس حقیقت سے جدا ہوئے۔ اور اس میں الٰہی وجوب (الوجود الإلہی) کا علم ہے کہ وہ کس چیز سے متعلق ہے۔ اور اس میں اس شخص کا علم ہے جس نے اپنے محبوبوں کو چھوڑ دیا، اس نے انہیں کیوں چھوڑا، اور ان کی حلیہ اور صفت کیا ہے۔ اور اس میں بقا (البقاء)، فوز اور نجات کا علم ہے۔ اور ان الٰہی علوم میں سے ہر علم اسم \"اللہ\" سے ہے، نہ کہ دوسرے اسماء سے۔ اور یہ بات تمہیں خاص طور پر صرف اسی منزل میں ملے گی، کیونکہ یہ منزل اللہ کے حکم کے ساتھ مخصوص ہے، دیگر اسماء کے مقابلے میں، اگرچہ بعض اسماء اس میں شریک ہیں۔\n\nپس یہ ان علوم میں سے کچھ ہیں جو یہ منزل اپنے اندر رکھتی ہے، ہم نے انہیں تمہارے لیے واضح کر دیا تاکہ تمہاری ہمت اللہ کی طرف سے کشف (الکشف) کے ذریعے انہیں حاصل کرنے کے لیے بلند ہو۔ پھر ہم اس منزل کے بعض مندرجات پر بات کرنے کی طرف لوٹتے ہیں۔ ہم کہتے ہیں کہ اللہ نے اپنی کتاب میں فرمایا ہے کہ اس نے **\"وَضَعَ الْمِيزانَ\"** (ترازو قائم کیا) تاکہ اس کے ذریعے عالم میں عدل کا قیام ایک ظاہری محسوس صورت میں ظاہر ہو، تاکہ جھگڑنے والوں کے درمیان نزاع ختم ہو جائے، کیونکہ دونوں فریقوں کے مماثل دو پلڑے موجود ہیں۔ اور ترازو کی زبان ہی حاکم ہے۔ پس جس طرف بھی وہ جھکے، اس طرف حق (الحق) کا حکم ہوتا ہے۔ اور اگر وہ بغیر کسی پلڑے کی طرف جھکے اپنی جگہ پر قائم رہے، تو معلوم ہوا کہ جھگڑنے والے دونوں فریقوں میں سے ہر ایک کا اپنے جھگڑے میں حق ہے، پس اسے انصاف ملتا ہے جس کی گواہی ترازو کی زبان کے حاکم نے دی، یوں جھگڑا اور نزاع ختم ہو گیا۔ اور حاکم کبھی بھی فریق مخالف نہیں ہوتا۔ اگر اس سے جھگڑا کیا جائے تو اس سے وہی جھگڑا کرتا ہے جس نے اسے حکم سے معزول کر دیا ہو یا جو یہ نہ جانتا ہو کہ وہ حاکم ہے۔ اور اسی لیے رسول اللہ ﷺ نے فرمایا: **\"عند نبي لا ينبغي تنازع\"** (نبی کی موجودگی میں جھگڑا نہیں ہونا چاہیے)، یعنی آپ کی موجودگی میں یا آپ کی موجودگی تک رسائی ممکن ہونے پر کوئی نزاع نہیں ہوتا۔ پس جب وہ مفقود ہو جائے تو نزاع ظاہر ہوتا ہے اور ہر فریق دعویٰ کرتا ہے کہ حق اس کے ہاتھ میں ہے۔\n\nپس اگر اللہ جھگڑنے والوں کی بصیرت کی آنکھیں کھول دے تاکہ وہ حق (الحق) کا مشاہدہ (المشاہدۃ) کریں اور جان لیں کہ وہ گھات میں ہے اور وہی حاکم ہے اور اس کے ہاتھ میں ترازو ہے جو بلند کرتا اور پست کرتا ہے، تو عالم میں کوئی نزاع باقی نہ رہے۔ پس اس کا وقوع اس بات پر دلالت کرتا ہے کہ سب وزن اور ترازو کے مالک حاکم سے حجاب (پردے) میں ہیں۔ پس جب تم کسی کو عالم میں جھگڑتے ہوئے دیکھو تو جان لو کہ وہ اللہ سے حجاب میں ہے۔ اگر ان میں سے ایک جھگڑا کرے اور دوسرا جھگڑا نہ کرے بلکہ خاموش رہے، تو جان لو کہ خاموش رہنے والا یا تو صاحب شہود (الشہود) ہے یا صاحب خلق (اخلاق) ہے۔ اگر نزاع کسی الٰہی حد سے تجاوز کرنے میں ہو، تو اس میں جھگڑا کرنے والا صاحب ادبِ الٰہی ہے یا صاحب ادبِ الٰہی کی صورت میں متصور ہے، جو کہ ریاکار ہے، لیکن مجموعی طور پر وہ بہتر ہے۔ پس صاحب ادبِ الٰہی جھگڑا کرنے والا نہیں ہے، بلکہ وہ جھگڑا کرنے والے کا ترجمان ہے، اور جن کی طرف سے وہ ترجمانی کرتا ہے وہ الٰہی اسماء ہیں جن سے عالم میں نزاع پیدا ہوا، اور جن کی خاطر دنیا میں شرعی ترازو اور آخرت میں اصلی ترازو رکھا گیا۔\n\nپس المعز (عزت دینے والا) اور المذل (ذلت دینے والا) فریق مخالف ہیں، اور الضار (نقصان دینے والا) اور النافع (نفع دینے والا) فریق مخالف ہیں، اور المحیی (زندہ کرنے والا) اور الممیت (موت دینے والا) فریق مخالف ہیں، اور المعطی (عطا کرنے والا) اور المانع (روکنے والا) فریق مخالف ہیں۔ اور ہر اسم کا حکم میں اسماء میں سے ایک مقابل ہے۔ اور ان اسماء کے درمیان رکھا گیا ترازو اسم \"الحکم\" ہے، اور ترازو قضاء میں عدل ہے۔ پس \"الحکم\" محل کی استعداد کو دیکھتا ہے اور اس کی استعداد کے مطابق اس کے حق میں فیصلہ کرتا ہے، اور اسے متقابل اور جھگڑنے والے دو اسماء میں سے کسی ایک کے گروہ میں شامل کر دیتا ہے۔ پس جب تم موازین کے وضع کو، معنی اور حس میں ان کی مختلف صورتوں کے ساتھ جان لو گے، تو تم ان کے عین حاکم بن جاؤ گے، اور تمہارے لیے اللہ کی نیابت صحیح ہو جائے گی کہ ترازو تمہارے ہاتھ میں ہے، تم پست کرتے ہو اور بلند کرتے ہو۔ مگر تمہارے اور اللہ کے درمیان وزن میں فرق یہ ہے کہ اللہ مشیئت (ارادے) سے بلند کرتا ہے اور مشیئت سے پست کرتا ہے، جبکہ تمہاری مشیئت کا وزن میں کوئی اثر نہیں ہوتا۔ تم صرف اس کے لیے وزن کرتے ہو جس کے ہاتھ میں تم حق (الحق) دیکھتے ہو۔ پس تم صاحب علامت ہو جو صاحب حق کو پہچانتا ہے اور اس کے لیے وزن کرتا ہے، اور حق صاحب مشیئت ہے۔\n\nاور یہاں ایک راز ہے جو بعض عارفین (العارفین) سے پوشیدہ رہتا ہے، اور وہ یہ ہے کہ مشیئت (المشیئۃ) ترازو کے ذریعے مدد کرتی ہے جب وہ بلند یا پست کرتی ہے، اگر محل کی استعداد نے یہ عطا کیا ہو۔ جیسا کہ نفس الامر میں حق (الحق) کے وجود نے صاحب علامت کو یہ عطا کیا کہ وہ اس کے لیے وزن کرے، کیونکہ وہ جانتا ہے کہ حق اس کا ہے، جیسا کہ حق تعالیٰ نے جانا کہ اس محل کی استعداد نے اسے اس کے لیے وزن عطا کیا۔ اور مشیئت کا استعداد میں، بما ہو استعداد، کوئی اثر نہیں ہوتا۔ بلکہ اس کا اثر اس خاص محل کو اس خاص استعداد کے لیے متعین کرنے میں ہوتا ہے، کیونکہ یہ جائز ہے کہ وہ کسی اور کے لیے ہو۔ استعداد کی حقیقت کا زائل ہونا یا پلٹ جانا جائز نہیں، جیسا کہ ہم علمِ طبیعت میں کہتے ہیں کہ حرارت ٹھنڈک میں تبدیل نہیں ہوتی، لیکن گرم چیز ٹھنڈی ہو جاتی ہے، اس حیثیت سے کہ وہ محل اور عین ہے، نہ کہ اس حیثیت سے کہ وہ گرم یا ٹھنڈی ہے۔ پس جو استعداد ایسا ہے وہ دوسرے استعداد میں تبدیل نہیں ہوتا، بلکہ وہ محل جو اس معین استعداد کو قبول کرتا ہے، وہ دوسرے استعدادات کو بھی قبول کرنے والا ہے۔ پس مشیئت نے اسے اس استعداد کے ساتھ خاص کیا، نہ کہ استعداد کو خاص کیا۔ کیونکہ میں نے اپنے اصحاب کی ایک جماعت کو اس مسئلے میں غلطی کرتے دیکھا، اور انہوں نے یہ رائے دی کہ مشیئت کا اس محل میں کوئی اثر نہیں ہے، کیونکہ اس محل کی استعداد جو کچھ عطا کرتی ہے، مشیئت کا استعداد میں کوئی اثر نہیں ہوتا۔ اور اگر تم عقل سے کام لو تو معاملہ وہی ہے جو ہم نے بیان کیا۔\n\n(پس اس باب کے مسائل میں سے ہے) کہ ميزانِ طبیعت (فطرت کا ترازو) نے ميزانِ الٰہی روحانی (الٰہی روحانی ترازو) سے جھگڑا کیا، جب اسے معلوم ہوا کہ اس کا ترازو کسی بنانے والے کے بنانے سے نہیں ہے، اور وہ بھول گئی کہ کسی معین چیز میں اس کے ترازو کا ظہور صرف ایک بنانے والے کے بنانے سے ہے، اور وہ الٰہی ترازو ہے۔ پس جب طبیعت نے اپنے ترازو کے ذریعے الٰہی روحانی ترازو سے جھگڑا کیا، اور الٰہی روحانی ترازو نے اس سے جھگڑا کیا، حالانکہ وہ زیادہ قوی ہے اور حکم اسی کا ہے، اور یہ جھگڑا صرف طبیعت کی طرف سے ہوا، کیونکہ وہ اس ترازو اور وزن پر راضی نہیں ہوئی، پس وہ اللہ کی طرف بلند ہوئی اور اس سے مطالبہ کیا کہ وہ اس کے اور روحانی ترازو کے درمیان فیصلہ کرے، اور اس کے اور اس روح کے درمیان فیصلہ کرے جو اس پر روحانی نوری نکاح کے ذریعے متوجہ ہے، تاکہ طبعی اجسام اور جزوی انسانی اور غیر انسانی ارواح ظاہر ہوں۔ کیونکہ عالم میں ہر جسم ایک الٰہی روح کی صورت کے ساتھ مقید ہے جو اس صورت کے ساتھ لازم ہے، اور اسی کے ذریعے وہ اللہ کی تسبیح کرنے والا ہوتا ہے۔\n\nپس ارواح میں سے کچھ ایسی ہیں جو اس صورت کی تدبیر کرتی ہیں، کیونکہ صورت ارواح کی تدبیر کو قبول کرتی ہے، اور وہ ہر وہ صورت ہے جو ظاہری حیات اور موت سے متصف ہو۔ اور اگر وہ ظاہری حیات اور موت سے متصف نہ ہو، تو اس کی روح روحِ تسبیح ہے، نہ کہ روحِ تدبیر۔ پس جب کوئی طبعی صورت ظاہر ہو جو تدبیر قبول کرے اور اس کے لیے ایک جزوی نفس ظاہر ہو جو اس کی تدبیر کرے، تو وہ صورت مؤنث کے مقام پر ہوتی ہے اور اس کی تدبیر کرنے والی روح مذکر کے مقام پر ہوتی ہے۔ پس وہ صورت اس کے لیے اہل ہوتی ہے اور وہ روح اس صورت کے لیے شوہر ہوتی ہے۔ اور یہ جزوی ارواح اشیاء کے علم میں ایک دوسرے سے افضل ہیں۔ پس ان میں سے کچھ ہیں جنہیں بہت سی چیزوں کا علم ہے، اور کچھ ایسے ہیں جو صرف تھوڑا سا جانتے ہیں۔ اور اللہ کے بارے میں سب سے زیادہ جاننے والی وہ ارواح ہیں جن کا تدبیر میں کوئی حصہ نہیں، کیونکہ صورت اسے قبول نہیں کرتی، اور وہ جمادات کی ارواح ہیں۔ اور ان سے کم رتبے میں اللہ کے علم میں نباتات کی ارواح ہیں، اور ان سے کم رتبے میں اللہ کے علم میں حیوانات کی ارواح ہیں۔ اور ان اصناف میں سے ہر ایک اللہ کے علم اور اس کی معرفت (المعرفۃ) پر فطرت کیا گیا ہے، اور اسی لیے ان کا کام صرف اللہ کی حمد کے ساتھ تسبیح کرنا ہے۔ اور ان سے کم رتبے میں اللہ کے علم میں انسانوں کی ارواح ہیں۔\n\nاور جہاں تک ملائکہ کا تعلق ہے، وہ اور جمادات اللہ کے علم پر فطرت کیے گئے ہیں، ان کے لیے نہ عقل ہے اور نہ شہوت۔ اور حیوان اللہ کے علم اور شہوت پر فطرت کیا گیا ہے۔ اور انسان اور جن اپنی صورتوں کے اعتبار سے شہوت اور معارف پر فطرت کیے گئے ہیں، نہ کہ اپنی ارواح کے اعتبار سے۔ اور اللہ نے انہیں عقل اس لیے دی تاکہ وہ اس کے ذریعے شہوت کو شرعی ترازو کی طرف لوٹائیں اور اس کے ذریعے شہوت کے اس مقام پر جھگڑے کو دور کریں جو اس کے لیے مشروع نہیں ہے۔ اللہ نے انہیں عقل علوم حاصل کرنے کے لیے نہیں دی، اور جو چیز اللہ نے انہیں علوم حاصل کرنے کے لیے عطا کی ہے، وہ صرف قوتِ مفکرہ (سوچنے کی قوت) ہے۔ اسی لیے ان کی ارواح معارف پر فطرت نہیں کی گئیں، جیسا کہ ملائکہ اور ثقلین (جن و انس) کے علاوہ کی ارواح فطرت کی گئیں۔\n\nاور جب انسانوں کے مراتب اشیاء کے علم میں مختلف ہوئے، تو بعض ارواح نے چاہا کہ وہ اس صورت کا حکم جس کی وہ تدبیر کر رہی ہے، اس طبیعت کے حکم سے ملا دے جس سے وہ صورت وجود میں آئی، اور اسے حکم میں اس کے مقام پر اتارے، حالانکہ وہ کبھی بھی اس کے مقام پر نہیں اتر سکتی۔ پس معلم نے اسے کہا: \"جو تم نے ارادہ کیا ہے وہ محال ہے، کیونکہ صورت طبیعت کا فعل نہیں کر سکتی، وہ تو اس سے منفعل (متاثر) ہے۔ اور فاعل کا مرتبہ منفعل کے مرتبے سے کہاں؟ کیا تم نفس کلیہ (النفس الکلیۃ) کو نہیں دیکھتے جو عقل اول (العقل الأول) کی اہل ہے؟ اور جب اللہ نے ان دونوں کے درمیان عالم کے ظہور کے لیے نکاح کرایا، تو پہلی اولاد جو ظاہر ہوئی وہ نفس کلیہ طبعیہ سے تھی۔ پس طبیعت میں یہ طاقت نہ تھی کہ وہ اشیاء میں نفس کلیہ کا فعل کرے، کیونکہ جزو کو کل کا حکم حاصل نہیں ہوتا، جبکہ کل کو جزو کا حکم حاصل ہوتا ہے، کیونکہ وہ اپنے اندر موجود اجزاء کی وجہ سے کل ہے۔\"\n\nپس جب یہ جاہل روح صورت کو طبیعت سے ملانے سے عاجز آ گئی جو اس کی ماں ہے، تو اس نے کہا: \"شاید یہ اس علم کو سمجھنے میں میری عاجزی اور کمی کی وجہ سے ہے۔\" پس وہ اللہ سے اس چیز کو دوبارہ طلب کرنے کے لیے اللہ کی طرف رجوع کرتا ہے۔ اس نے اللہ سے درخواست کی کہ صورت سے وہی چیزیں منفعل ہوں جو طبیعت سے منفعل ہوتی ہیں۔ پس اس نے پایا کہ وہ قابل (قبول کرنے والے) جن پر صورت اثر کرتی ہے، وہ اس چیز کو قبول کرنے والے نہیں ہیں جسے وہ صورتیں قبول کرتی ہیں جن میں طبیعت کے اثر کو قبول کرنے کی صلاحیت ہے۔ اور حق سبحانہ و تعالیٰ اشیاء کو، جیسا کہ پہلے بیان ہوا، صرف عطا کیے جانے والے کی استعداد کے مطابق ہی عطا کرتا ہے، کیونکہ وہ اسے قبول نہیں کرتا جو اس کی استعداد عطا نہیں کرتی۔ پس جب اس روح پر اس کی غلطی اور درستگی واضح ہو گئی اور اسے معلوم ہو گیا کہ اس نے غیر شعلہ زن چیز میں پھونک ماری ہے، تو اس نے اپنی صورت کے ساتھ اس کی استعداد کے مطابق ٹھہرنے کا مطالبہ کیا۔\n\nپس اس نے ان چیزوں کو ظاہر کرنے تک رسائی قبول کر لی جو وہ صورتوں کی طرف ڈالتا ہے، تاکہ معنوی، حسی یا خیالی ممکنات (الممکنات) میں سے کسی عین کو ظاہر کرے۔ پس اسے حق (الحق) کے ساتھ مکاشفہ (المکاشفۃ) کے فتوح میں، نہ کہ حلاوت کے فتوح میں اور نہ ہی عبارت کے فتوح میں، تین مراتب ظاہر ہوئے: حریۃ (آزادی) کا مرتبہ، جس کا باب پہلے گزر چکا ہے، اور یہی وہ مرتبہ ہے جو اسے کائناتوں کی غلامی سے نکالتا ہے، کیونکہ اس مطالبے نے اسے غلام بنا لیا تھا جو امور سے اس کی جہالت کی وجہ سے تھا۔ اور اللہ اس بات کو زیادہ جانتا تھا کہ یہ واقع نہیں ہو گا، اور اسے اللہ کے علم میں موجود چیزوں کا اور جس پر امر قائم ہے اس کا کوئی علم نہیں تھا۔ پس اگر وہ اس مقام سے متصف ہو جائے اور اس حال کے ساتھ ظاہر ہو، تو اللہ اسے اس کے ارادے پر قدرت دے دیتا ہے اور اسے ایجاد کی قوت عطا کرتا ہے۔ اور اگر وہ اس مقام سے متصف ہونے سے عاجز رہے، تو وہ اپنے حال کے ساتھ زیادہ عاجز ہے، کیونکہ حال ایک الٰہی موہبت ہے اور مقام کسب کیا جاتا ہے۔\n\nپس اس وقت اس نے دوسرے مرتبے کی طرف رجوع کیا، جو حکم اور شہود (الشہود) میں ترتیب پر ہے۔ پس حق (الحق) اس کے لیے التجلی الصمدانی (ظہورِ صمدانی) میں قائم ہوا۔ پس اگر وہ اس میں اس کی طرف دیکھنے پر قادر ہو گیا اور اس کے ظہور (التجلی) کے لیے ثابت قدم رہا، اور وہ جبلی (فطری) نہ ہوا کہ ریزہ ریزہ ہو جائے، اور نہ موسوی (موسیٰ علیہ السلام کی طرح) کہ بے ہوش ہو جائے، تو اسے وہ چیز مل گئی جو اس نے اللہ سے طلب کی تھی کہ اس کی صورت سے وہ چیزیں منفعل ہوں جو اس کی استعداد عطا کرتی ہے، جب اللہ اسے اس میں حکم چلانے کی قدرت دے دے۔ اور اگر وہ موسوی یا جبلی ہوا، تو وہ اس تجلی (التجلی) کے لیے ثابت قدم نہ رہ سکا جو اسے فنا (الفناء) کر دیتا ہے جو اپنی استعداد سے فنا طلب کرتا ہے، اور اسے ہلاک کر دیتا ہے جو اپنی استعداد سے ہلاکت طلب کرتا ہے۔ پس اس کے لیے موت کو قبول کرنے والے عالم پر حیات کو روکنے کا مرتبہ قائم ہوا، اور اس نے اسے التجلی الصمدانی کے درجات کی تعداد کے مطابق مراتب میں پایا، کیونکہ یہ یا تو موت ہے یا حیات کو روکنا۔\n\nپس اگر اللہ نے اس پر توجہ دی اور اسے اس پر قوت عطا کی، تو وہ اپنی صورت میں جیسے چاہے تصرف کرے گا۔ اور اگر اسے اس پر قوت نہ دی گئی اور وہ عاجز رہا، تو اگر اس کی عاجزی کسی الٰہی شہود (الشہود) کی وجہ سے تھی، تو اسے اپنی صورت میں تصرف کی اجازت دی جائے گی، اور اگر اس کی عاجزی اس کے نفس کے حجاب (پردے) کے پیچھے سے تھی، تو اسے تصرف سے روک دیا جائے گا، کیونکہ اس کے پاس کوئی الٰہی قوت نہیں ہے جس سے وہ تصرف کرے۔ پس یہ وہ ذوق ہے جو ہم نے اس منزل کے مردوں کے بارے میں بیان کیا ہے۔ اور ہر منزل کے مندرجات کی شرح طویل ہو جاتی ہے۔ اور یہ ایک ایسی منزل ہے جس کی کوئی مثال یا مقابلہ کرنے والی دوسری منازل میں نہیں ہے۔ اور یہ سب سے قوی منازل میں سے ہے، اسی سے اللہ کے مخلص بندوں میں سے چالیس دن کے بعد حکمت کے ساتھ بات کرنے کا اخلاص پیدا ہوتا ہے۔ اور **\"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\"** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔)",
    "fa": "باب سیصد و بیست و ششم در معرفت منزل گفت‌وگو و منازعه، و آن از حضرت محمدیه موسویه است.\n\n> خداوند هر جا که باشیم فرود می‌آید *** بدون اسماء ذات نیکویش\n> او نور است و نور مظهر اوست *** و به همین دلیل آن را از ما دور کرد\n> پس ذات‌های (ذوات) هستی (الکیان) تاریک‌اند *** و این نزدیک‌ترین نزدیکی است، نه پایین‌ترین\n> سپس او را به صورت شرفی به دست آوردیم *** در مجموع، چه نیکو چیزی به دست آوردیم\n> خداوند صدای خواهنده خود را شنید *** به آنچه از ما اراده کرده بود\n> پس به همین دلیل ما همیشه او هستیم *** و به همین دلیل از ما دور نشدیم\n> پس اگر بخواهد ما را متولد سازد *** در هیولای (هیولی) هستی (الوجود) او، ایمن می‌شویم\n> بلبل دل در شاخسار شاخه‌ای *** هرگاه آواز بخواند، باده‌نوشان را به طرب می‌آورد\n> پس به واسطه او برای ما ظاهر شد، اما نپذیرفت *** پس از ما دور شدیم و او از ما دور نشد\n\nبدان، خداوند تو را تأیید کند، که این منزل به ویژه، برخلاف سایر منازل، علمی در خود ندارد که در عالم (الکون) ظاهر شود یا در عین یا در اسم یا در حکم بر آن دلالت کند، مگر اینکه حکم حق (الحق) از حیث این اسم که جامع مراتب الوهیت (الألوهية) است، در آن علم (یعنی در آن علم) از یک وجه و دو وجه و سه وجه و چهار وجه و بیشتر نظر داشته باشد، و این را در غیر این منزل نخواهی یافت. پس پرسیدم که چند علم در آن است؟ منزل به طور کامل برایم بالا برده شد. در آن بیست و سه علم برپا شده دیدم و به الوهیت (الألوهية) در تمام آن علوم نگریستم و دیدم که نظرش به آن‌ها از چهل وجه است. و به من گفته شد: «آن‌ها را جز رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) جمع نکرده است.» و سیادت او بر تمام عالم از این منزل بود. پس هر کس از امت او که در این منزل از او ارث ببرد، به اندازه سهم خود در این جامعیت، سیادت به دست می‌آورد. و از این منزل است که حکمت به کسی داده می‌شود که چهل بامداد برای خدا اخلاص ورزد، پس او حق (الحق) را در تمام احوال خود مشاهده می‌کند، همان‌گونه که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در تمام اوقات خود خدا را یاد می‌کرد.\n\nاین منزل شامل مسائلی است از جمله: معرفت ازدواج مقدمات برای نتیجه‌گیری (الإنتاج)، و علم منازعه مرسل‌الیه با رسول (صَلَّى اللهُ عَليهِ وسَلَّم) با وجود ایمانش به او و به آنچه از نزد خدا آورده است، که در این منزل به صورت خصم بازمی‌گردد. و خداوند خود حکم بین رسول و مرسل‌الیه را بر عهده می‌گیرد، با علم به اینکه رسول از روی هوی سخن نمی‌گوید و آنچه را که به آن مبعوث شده است از جانب خدا ابلاغ می‌کند. با این همه، در مورد همان چیزی که آورده است، بر او ادعا می‌شود، پس برای حکم بین آن دو به سوی خدا بالا می‌رود. این از دشوارترین علوم در تصور است، به دلیل وجود ایمان و تصدیق خصم به آن. و در آن علم کسی است که آنچه برای او تشریع شده بود که پیش رویش باشد، پشت سر گذاشت. و در آن علم انتساب است، یعنی انتساب فروع به اصولشان، و حکم خدا در مورد کسی که فرعی را به غیر اصلش ملحق کند، از طریق کشف (الکشف).\n\nو در آن علم ظهور باطل (الباطل) به صورت حق (الحق) است. باطل (الباطل) عدم است و وجودی ندارد، در حالی که صورت موجود است و حق (الحق) است. پس عین باطلی که ظاهر شده کجاست؟ و صورت تنها برای حق (الحق) است. و آن پرده‌ای که بین عقل و حق (الحق) است تا باطل (الباطل) آن را به صورت حق (الحق) بپوشاند، چیست؟ و علم فرق بین خاطر اول (الخاطر الأول) و خاطر دوم (الخاطر الثاني)، و اینکه شخص به خاطر اول مؤاخذه نمی‌شود، اما به خاطر دوم مؤاخذه می‌شود. در حالی که خاطر دوم عین صورت خاطر اول است، پس چرا در بعضی امور در خاطر دوم تصدیق نمی‌شود، همان‌گونه که در خاطر اول تصدیق می‌شود؟ آیا این به دلیل مرتبه دوم است؟ زیرا دوم از چیزهایی است که در مراتب عدد افزوده شده و اصلش عدم است، در حالی که اول وجود است. و به واسطه اول، آنچه از اعداد ظاهر شد، ظاهر گشت، که آن ظاهر برای آن‌هاست.\n\nو در آن علم الحاق کسی است که حجاب او را به بردگی گرفته است، از امثال به آزادی، برای کسی که حقایق (الحقائق) را در نظر خود دگرگون (قلب) کرده است، پس امور را به غیر مراتبشان و فروع را به غیر اصولشان ملحق می‌کند. و در آن علم سبب الهی است که به خاطر آن این امر واقع شده است. و در آن اضافه کردن علم اذواق (الأذواق) به خداوند متعال است، و آن شعور به علم به آن‌هاست بدون چشیدن (ذوق). پس کدام نسبت الهی چنین حکمی را در علم الهی داده است؟ مانند قول او: «حَتَّى نَعْلَمَ» (تا بدانیم)، در حالی که او می‌داند. پس این همان علم ذوق است.\n\nو در آن علم مقدار برپایی صفتی است که مثل نمی‌پذیرد، با بنده، برای از بین بردن این واقعه از این شخص که «خلف» (پشت سر) را در غیر جایگاهش به منزله «امام» قرار داده است، پس حقایق (الحقائق) را درهم آمیخته است. و این شخص چنین تصور کرده است که:\n\n> قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم): «من شما را از پشت سرم می‌بینم»\n\nاینکه او با دیدن خود امام شده است. در حالی که برای او تنها حکم نظر قرار داده شده است، همان‌گونه که برای امام است. و امام، امام است و خلف، خلف. پس اگر از ماندن تحت قدرت حکم این صفت بی‌مانند عاجز شد، و غلط او کشف (الکشف) نشد و حق (الحق) را ندید، به دلیل ناتوانی‌اش از ایستادگی در این مدت که نفسش در آن فانی می‌شود، در علم دیگری در این منزل قرار می‌گیرد که مجاور این علم است و آن را با حیات نفوس معدودی می‌طلبد که با صفتی که نفس خود را در آن فانی می‌کرد، به او وفا می‌کنند. پس شرف نفس او بر غیرش ظاهر شد، زیرا گروهی از امثال او به جای نفس او ایستادند، با وجود اشتراک در صورت و مقام و حال. و خداوند فرقان (جدایی) بین آن دو را بیان کرده است و حق نفس بر خودش را بزرگ‌تر از حقوق امثال او بر او قرار داده است، هر چقدر هم که باشد. پس قاتل نفوس دیگران را در مشیت (اراده الهی) وارد کرده است، بدون قطع به مؤاخذه، پس او بین عفو و مؤاخذه است، با وجود تعلق حقوق آن‌ها به او. و قاتل نفس خود را در آتش قرار داده است، به این دلیل که بهشت را بر او حرام کرده است، به خاطر عظمت حق نفسش بر خودش. و وارد شده است که حق خدا سزاوارتر است که ادا شود تا حق دیگری.\n\nپس حق نفس نیز چنین قرار داده شد. و در آن علم سبب الهی است که به خاطر آن این حقوق این‌گونه مرتب شده و این حدود الهی برای آن‌ها قرار داده شده است. و در آن علم صفت عذاب کسی است که حق (الحق) را از اهلش پنهان می‌کند، در حالی که کشف (الکشف) آن به ایجاب الهی بر او واجب شده است. و در آن علم کسی است که پس از اقامه بینه قطعی بر او، از حق (الحق) روی گردانده است؛ چه چیزی او را از حق (الحق) منحرف کرده است و حکم او در این انحراف نزد خدا چیست؟ و در آن علم عذاب اهل حجاب است؛ آیا عذاب آن‌ها به سبب حجابشان است یا به امر دیگری؟ و در آن علم جمع برای تعریف اعمال فراموش شده و فراموش نشده نزد آن‌هاست، و اینکه کدام یک از اسماء الهی متولی این امر است. و در آن علم تعلق علم خداست که عوالم (الأکوان) آن را درک نمی‌کنند، به آنچه در عالم است از طریق مشاهده و مجالست، سپس به تأخیر انداختن تعریف آنچه از اعمال عوالم (الأکوان) بوده است تا زمان مخصوص و معینی نزد خدا.\n\nو در آن علم نجواهای اخروی و دنیوی است. و در آن علم آداب مناجات (المناجاة) بین مناجات‌کنندگان است و اینکه کسی که با پروردگارش یا یکی از اهل خدا مناجات می‌کند، با چه چیزی شروع کند. و در آن علم وسعت مجالس ذاکران خداست، به دلیل اینکه خداوند جلیس آن‌هاست از اسم واسع (الاسم الواسع). و در آن علم مراتب ایمان از علم است و اینکه کدام درجات والاتر است. و در آن علم مفلسان است و چه چیزی آن‌ها را با وجود آنچه دارند، مفلس کرده است. و در آن علم بازگشت خدا بر بنده است؛ هرگاه بنده بازگردد، آیا بازگشت خدا متفاوت است یا متفاوت نیست؟ و اگر متفاوت است، چرا این اختلاف بازمی‌گردد؟ آیا به بازگشت‌کننده مربوط است یا به حال کسی که به سوی او بازگشته می‌شود؟ و در آن علم نتیجه روی گرداندن از ذکر، از غضب الهی است. و در آن علم آنچه بی‌نیاز می‌کند و آنچه بی‌نیاز نمی‌کند. و در آن تفرقه احزاب است؛ از کدام حقیقت (الحقیقة) از حقایق الهی متفرق شدند؟ و در آن علم وجوب الهی است؛ به چه چیزی تعلق گرفته است؟ و در آن علم کسی است که دوستان خود را ترک کرده است؛ چرا آن‌ها را ترک کرده است و حلیه و صفت آن‌ها چیست؟ و در آن علم بقا (البقاء) و فوز و نجات است. و هر یک از این علوم الهی از اسم «الله» است، نه از غیر آن از اسماء، و این را جز در این منزل به خصوص نخواهی یافت، زیرا این منزل به حکم خدا اختصاص یافته است، نه سایر اسماء، با وجود مشارکت بعضی از اسماء در آن. این‌ها بخشی از علومی است که این منزل در بر دارد. آن‌ها را برای تو آشکار کردیم تا همت تو برای دستیابی به آن‌ها بالا رود، با گشایش مکاشفه (المکاشفة) از جانب خدا.\n\nسپس به سخن گفتن درباره برخی از آنچه این منزل در بر دارد بازمی‌گردیم. می‌گوییم: خداوند در کتاب خود فرموده است که: «وَضَعَ الْمِيزانَ» (میزان را وضع کرد)، تا اقامه عدل در عالم (العالم) به صورتی آشکار و محسوس ظاهر شود، تا نزاع بین منازعه‌کنندگان برطرف گردد، به دلیل وجود دو کفه که مشابه دو خصم هستند، و زبان میزان (لسان المیزان) حاکم است. پس به هر جهتی که متمایل شود، برای آن جهت به حق (الحق) حکم می‌کند. و اگر در وسط خود بماند و به هیچ یک از دو کفه متمایل نشود، دانسته می‌شود که هر یک از منازعه‌کنندگان در آنچه منازعه می‌کنند، حقی دارند. پس به دلیل آنچه حاکم لسان میزان برای او شهادت داده است، انصاف به او می‌رسد و خصومت و منازعه برطرف می‌شود. و حاکم هرگز خصم نمی‌شود. اگر با او منازعه شود، تنها کسی با او منازعه می‌کند که او را از حکم عزل کرده باشد یا جاهل باشد به اینکه او حاکم است.\n\nو به همین دلیل رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود:\n> «در حضور پیامبر، سزاوار نیست که نزاعی باشد»\n\nیعنی با حضور او یا امکان دسترسی به حضور او، نزاعی رخ نمی‌دهد. پس اگر او غایب شود، نزاع ظاهر می‌شود و هر یک از خصماء ادعا می‌کند که حق (الحق) در دست اوست. اگر خداوند چشم بصیرت خصماء را برای مشاهده حق (الحق) باز می‌کرد و می‌دانستند که او در کمین است و او حاکم است و میزان در دست اوست که بالا و پایین می‌برد، نزاعی در عالم (العالم) صحیح نبود. پس وقوع نزاع دلالت بر این دارد که همه در حجاب از حاکم صاحب وزن و میزان هستند. پس اگر کسی را دیدی که در عالم (العالم) منازعه می‌کند، بدان که او در حجاب از خداست. اگر یکی از آن‌ها منازعه کرد و دیگری منازعه نکرد، بلکه سکوت کرد، بدان که ساکت یا صاحب شهود (الشهود) است یا صاحب خلق. اگر نزاع در تجاوز از حد الهی باشد، منازعه‌کننده در آن صاحب ادب الهی است یا کسی است که خود را به صورت صاحب ادب الهی درآورده است (و او ریاکار است)، اما در مجموع خیر است. پس صاحب ادب الهی منازعه‌کننده نیست، بلکه مترجم منازعه‌کننده است. و کسانی که از طرف آن‌ها ترجمه می‌شود، اسماء الهی هستند که نزاع در عالم (العالم) از آن‌ها نشأت می‌گیرد و به خاطر آن‌ها میزان شرعی در دنیا و میزان اصلی در آخرت وضع شده است.\n\nزیرا «معز» (عزت‌دهنده) و «مذل» (خوارکننده) خصم هستند، و «ضار» (زیان‌رسان) و «نافع» (سودرسان) خصم هستند، و «محیی» (زنده‌کننده) و «ممیت» (میراننده) خصم هستند، و «معطی» (بخشنده) و «مانع» (بازدارنده) خصم هستند. و هر اسمی در حکم، مقابلی از اسماء دارد. و میزان وضع شده بین این اسماء، اسم «حکم» (الاسم الحكم) است و میزان، عدل (العدل) در قضاوت است. پس «حکم» به استعداد محل می‌نگرد و بر اساس استعدادش برای او حکم می‌کند، و او را در حزب یکی از دو اسم متقابل و متنازع قرار می‌دهد. پس اگر وضع میزان‌ها را با اختلاف صورت‌هایشان در معنی و حس دانستی، تو عین حاکم بر آن‌ها خواهی بود و نیابت از خدا برای تو صحیح می‌شود که میزان در دست توست و پایین و بالا می‌بری. با این تفاوت که فرق بین تو و خدا در وزن این است که خدا با مشیت (اراده) بالا می‌برد و با مشیت پایین می‌آورد، اما مشیت تو در وزن اثری ندارد. بلکه تو برای کسی وزن می‌کنی که حق (الحق) را در دست او می‌بینی. پس تو صاحب علامتی هستی که صاحب حق (الحق) را می‌شناسی و برای او وزن می‌کنی. و حق (الحق) صاحب مشیت (اراده) است.\n\nو در اینجا رازی است که بر برخی از عارفان (العارفين) پنهان می‌ماند، و آن این است که مشیت (المشيئة) با میزان تعیین می‌کند، هنگامی که بالا یا پایین می‌برد، که استعداد محل آن را اقتضا کرده است. همان‌گونه که وجود حق (الحق) در نفس‌الامر به صاحب علامت این امکان را داده است که برای او وزن کند، زیرا می‌داند که حق (الحق) با اوست. همان‌گونه که حق تعالی دانست که استعداد این محل، وزن کردن برای او را اقتضا می‌کند. و مشیت (المشيئة) در استعداد، به عنوان استعداد، اثری ندارد. بلکه اثر آن در تعیین این محل خاص برای این استعداد خاص است، زیرا جایز است که برای غیر آن باشد. جایز نیست که حقیقت استعداد از بین برود یا دگرگون شود، مانند آنچه در علم طبیعت می‌گوییم که حرارت به برودت تبدیل نمی‌شود، اما شیء گرم از جهت اینکه محل و عین است، به سرد تبدیل می‌شود، نه از جهت اینکه گرم یا سرد است. پس استعدادی که چنین است، به استعدادی که چنان است، تبدیل نمی‌شود. بلکه محل پذیرنده این استعداد معین، پذیرای استعدادهای دیگر نیز هست. پس مشیت (المشيئة) آن را به این استعداد اختصاص داده است نه به غیر آن، و استعداد را اختصاص نداده است. زیرا من دیدم که گروهی از اصحاب ما در این مسئله اشتباه کردند و گمان کردند که مشیت (المشيئة) در این محل اثری ندارد، به دلیل آنچه استعداد آن محل اقتضا می‌کند، زیرا مشیت در استعداد اثری ندارد. در حالی که امر بر همان است که ما بیان کردیم، اگر تعقل کنی.\n\n(از مسائل این باب)\n\nاین است که میزان طبیعت (ميزان الطبيعة) با میزان الهی روحانی (الميزان الإلهي الروحاني) منازعه کرد، زیرا می‌دانست که میزانش به جعل جاعل نیست. و غافل بود از اینکه ظهور میزانش در شیء معین، تنها به جعل جاعل است و آن میزان الهی است. پس چون طبیعت با میزانش با میزان الهی روحانی منازعه کرد، و میزان روحانی الهی که قوی‌تر است و حکم از آن اوست، با آن منازعه کرد، خصومت تنها از جانب طبیعت واقع شد، زیرا به آن میزان و به آن وزن راضی نبود. پس به سوی خدا بالا رفت و از او خواست که بین او و میزان روحانی حکم کند، و بین او و روح متوجه بر او به نکاح روحانی نوری حکم کند، برای ظهور اجسام طبیعی و ارواح جزئی انسانی و غیر انسانی. زیرا هر جسمی در عالم (العالم) مقید به صورت روح الهی است که ملازم آن صورت است و به واسطه آن تسبیح‌گوی خداست.\n\nپس برخی از ارواح مدبر آن صورت هستند، زیرا صورت پذیرای تدبیر ارواح است، و آن هر صورتی است که به حیات ظاهری و مرگ متصف باشد. و اگر به حیات ظاهری و مرگ متصف نباشد، روح آن روح تسبیح است نه روح تدبیر. پس هنگامی که صورت طبیعی پذیرای تدبیر ظاهر شد و نفس جزئی مدبری برای آن ظاهر شد، صورت به منزله مؤنث و روح مدبر آن به منزله مذکر بود. پس صورت برای او اهل بود و روح برای آن صورت بعل (شوهر). و این ارواح جزئی در علم به اشیاء با هم تفاوت دارند. پس برخی از آن‌ها علم به اشیاء بسیاری دارند و برخی جز اندکی نمی‌دانند. و هیچ روحی از ارواح صور که بهره‌ای در تدبیر ندارند، عالم‌تر به خدا نیست، زیرا صورت پذیرای آن نیست، و آن‌ها ارواح جمادات هستند. و پایین‌تر از آن‌ها در رتبه علم به خدا، ارواح نباتات هستند. و پایین‌تر از آن‌ها در علم به خدا، ارواح حیوانات هستند. و هر یک از این اصناف بر علم به خدا و معرفت (المعرفة) به او سرشته شده‌اند. و به همین دلیل، همّ آن‌ها جز تسبیح به حمد او تعالی نیست. و پایین‌تر از این‌ها در علم به خدا، ارواح انسان‌ها هستند.\n\nاما ملائکه و جمادات بر علم به خدا سرشته شده‌اند، نه عقل دارند و نه شهوت. و حیوان بر علم به خدا و بر شهوت سرشته شده است. و انسان و جن بر شهوت و معارف (المعارف) سرشته شده‌اند، از حیث صورشان نه از حیث ارواحشان. و خداوند عقل را برای آن‌ها قرار داد تا با آن شهوت را به میزان شرعی بازگردانند و با آن منازعه شهوت را در غیر محل مشروعش از خود دور کنند. خداوند عقل را برای کسب علوم برای آن‌ها قرار نداد، و آنچه خداوند برای کسب علوم به آن‌ها داده است، تنها قوه متفکره است. به همین دلیل ارواح آن‌ها بر معارف (المعارف) سرشته نشده‌اند، همان‌گونه که ارواح ملائکه و غیر ثقلین (جن و انس) سرشته شده‌اند.\n\nو چون مراتب انسان‌ها در علم به اشیاء متفاوت شد، برخی از ارواح خواستند که حکم صورتی را که مدبر آن هستند، به حکم طبیعتی که آن صورت از آن به وجود آمده است، ملحق کنند و آن را در حکم، منزلت طبیعت قرار دهند، در حالی که هرگز به منزلت آن نمی‌رسد. پس معلم به او گفت: «اینکه قصد کرده‌ای محال است، زیرا صورت فعل طبیعت را انجام نمی‌دهد، بلکه منفعل از آن است. و رتبه فاعل کجا و رتبه منفعل کجا؟ آیا نمی‌بینی نفس کلیه (النفس الكلية) را که اهل عقل اول (العقل الأول) است؟ و هنگامی که خداوند بین آن دو ازدواج برقرار کرد تا عالم (العالم) ظاهر شود، اولین مولودی که از نفس کلیه طبیعی ظاهر شد، طبیعت نتوانست فعل نفس کلیه را در اشیاء انجام دهد، زیرا جزء حکم کل را ندارد، در حالی که کل حکم جزء را دارد، زیرا به واسطه اجزایی که حمل می‌کند، کل است.»\n\nپس هنگامی که این روح جاهل از الحاق صورت به طبیعت که مادر اوست، عاجز شد، گفت: «شاید این به دلیل عجز و قصور من از درک علم در این باره باشد.» پس دوباره در طلب آن از خدا به سوی خدا بازگشت. پس از خدا خواست که از صورت همان چیزی منفعل شود که از طبیعت منفعل می‌شود. پس دریافت که قوایلی که صورت در آن‌ها تأثیر می‌گذارد، پذیرای آنچه صورتی که پذیرای اثر طبیعت است، نیستند. و حق سبحانه، همان‌گونه که پیش‌تر گفته شد، اشیاء را جز بر اساس استعداد کسی که به او عطا می‌شود، نمی‌دهد، زیرا آنچه را که استعدادش به او نمی‌دهد، نمی‌پذیرد. پس هنگامی که خطای این روح از صوابش برای او روشن شد و دانست که در غیر آتش دمیده است، خواست که با صورت خود بر اساس آنچه استعدادش اقتضا می‌کند، بماند. پس پذیرفت که به ابراز آنچه از او به صور القا می‌شود، بپردازد تا عین آنچه از اعیان ممکنات معنوی و حسی یا خیالی است، ظاهر شود.\n\nدر فتوح مکاشفه (المکاشفة) به حق (الحق) برای او سه مرتبه ظاهر شد، نه در فتوح حلاوت و نه در فتوح عبارت: مرتبه حریت (الحرية) که باب آن پیش‌تر گذشت، و آن مرتبه‌ای است که او را از بردگی عوالم (رق الأكوان) خارج می‌کند، زیرا این طلبی که ناشی از جهل او به امور بود، او را به بردگی گرفته بود. و خداوند به این امر داناتر بود که واقع نمی‌شود، و او علمی به آنچه در علم خداست و به آنچه امر بر آن است، نداشت. پس اگر به این مقام (المقام) متصف شود و با این حال (الحال) ظاهر گردد، خداوند او را بر مرادش توانا می‌سازد و به او قوه ایجاد می‌بخشد. و اگر از اتصاف به این مقام (المقام) عاجز شود، با حالش عاجزتر است، زیرا حال (الحال) موهبت الهی است و مقام (المقام) اکتسابی.\n\nدر آن هنگام به مرتبه دوم روی آورد، که بر اساس ترتیب در حکم و شهود (الشهود) است. پس حق (الحق) در تجلی صمدانی (التجلي الصمداني) برای او قیام کرد. پس اگر توانست در آن به او بنگرد و در برابر تجلی او ثابت ماند و جبلی (جبليا) نبود که متلاشی شود و موسوی (موسویا) نبود که صاعقه بر او فرود آید، آنچه را که از خدا خواسته بود، یعنی انفعال از صورتش بر اساس آنچه استعدادش اقتضا می‌کند، برای او حاصل می‌شد، اگر خداوند او را بر حکم در آن توانا می‌ساخت.\n\nپس اگر موسوی (موسویا) یا جبلی (جبليا) بود، در برابر آن تجلی که هر کس را که با استعدادش فنا (الفناء) را می‌طلبد، فانی می‌کند و هر کس را که با استعدادش هلاکت را می‌طلبد، هلاک می‌سازد، ثابت نمی‌ماند. مرتبه امساک حیات بر عالم (العالم) پذیرای مرگ برای او قیام کرد. پس آن را در رتبه‌هایی به تعداد درجات تجلی صمدانی یافت، زیرا آن یا مرگ است یا امساک حیات. پس اگر خداوند به او عنایت کرد و بر آن قوه بخشید، در صورت خود هرگونه که خواست تصرف می‌کرد. و اگر قوه بر آن داده نشد و عاجز ماند، اگر عجز او از شهود (الشهود) الهی بود، تصرف در صورتش به او داده می‌شد. و اگر عجز او از پشت حجاب نفسش بود، از تصرف منع می‌شد، زیرا قوه الهی برای تصرف نداشت.\n\nاین‌ها بخشی از ذوق مردان این منزل است که در این منزل بیان کردیم. شرح آنچه هر منزل در بر دارد، طولانی است. و این منزلی است که در میان منازل شبیه و مقاومی ندارد و از قوی‌ترین منازل است. اخلاص برای گفتن حکمت (الحكمة) پس از چهل روز برای کسی که از بندگان خدا اخلاص ورزیده باشد، از این منزل حاصل می‌شود. و خداوند می‌فرماید: «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}