{
  "id": 280,
  "title": {
    "ar": "الباب الثمانون ومائتان في معرفة منزل مالي وأسراره من المقام الموسوي",
    "en": "Chapter Two Hundred and Eighty: Concerning the Knowledge of the Station of Mālī (منزل مالي) and its Secrets, derived from the Mosaic Station (المقام الموسوي).",
    "ur": "۲۸۰ واں باب: موسیٰ علیہ السلام کے مقام سے میرے مقام کی منزل اور اس کے اسرار کی معرفت میں۔",
    "fa": "باب دویست و هشتادم در معرفت منزل مالي و اسرار آن از مقام موسوی"
  },
  "content": {
    "ar": "## «الباب الثمانون ومائتان في معرفة منزل مالي وأسراره من المقام الموسوي»\n\n\n> قلت مالي فقال مالك عبدي *** قلت مالي فقال مالك عندي‏\n\n\n> قلت لما أضفته لي ملكا *** لم خصصته بقولك عندي‏\n\n\n> قال لما علمت أنك عندي *** كان ما تحت ملك عندك عندي‏\n\n\n> قلت إن كان عين إنك أني *** صح ما قلت إن عندك عندي‏\n\n\n> وكما قلت إن عندك عندي *** فلنقل نحن إن عندك عندي‏\n\n\n> وهو أولى فإن ذاتي ظرف *** وتعاليت أنت فالعند عندي‏\n\n\nهذا منزل عال ليس بينه وبين موقفه مناسبة فترجع المناسبة إلى الواقف كما كان في المنزل الذي قبله من هذا المنزل قال يعقوب عليه السلام لبنيه وما أُغْنِي عَنْكُمْ من الله من شَيْ‏ءٍ إِنِ الْحُكْمُ إِلَّا لِلَّهِ ومن هذا المنزل‏\n\n\nقال محمد صلى الله عليه وسلم وقد نزل عليه وأَنْذِرْ عَشِيرَتَكَ الْأَقْرَبِينَ فوقف على الصفا وجاء الناس يهرعون إليه فقال لأكرم الناس عليه يا فاطمة\nبنت محمد انظري لنفسك لا أغنى عنك من الله شيئا وقال مثل هذه المقالة لجميع الأقربين وكان عمه أبو لهب حاضرا فنفخ في يده وقال ما حصل بأيدينا مما قاله شي‏ء وصدق أبو لهب فإنه ما نفعه الله بإنذاره ولا أدخل قلبه منه شيئا لما أراد به من الشقاء فأنزل الله فيه تَبَّتْ يَدا أَبِي لَهَبٍ وتَبَّ ما أَغْنى‏ عَنْهُ مالُهُ وما كَسَبَ‏\n\n\nفإنه كان معتمدا على ماله فمن اعتمد على غير الله في أموره خسر والقائلون بالأسباب إذا اعتمدوا عليها وتركوا الاعتماد على الله لحقوا بِالْأَخْسَرِينَ أَعْمالًا وإذا أثبتوا الأسباب واعتمدوا على الله ولم يتعدوا فيها منزلتها التي أنزلها الله فيها فأولئك الأكابر من رجال الله الذين لا تُلْهِيهِمْ تِجارَةٌ ولا بَيْعٌ عَنْ ذِكْرِ الله وأثبت لهم الحق الرجولة في هذا الموطن ومن شهد له الحق بأمر فهو على حق في دعواه إذا ادعاه ومن أثبت الأسباب بإثبات الحق وركن إليها ركون الطبع واضطرب عند فقدها في نفس الاعتماد على الله فذلك من متوسط الرجال وإذا وقع الاضطراب في النفس فإن أحس بالفقد واضطرب المزاج فذلك من خصائص الرجال الأكابر وإن لم يضطرب المزاج ولم يحس بالفقد فذلك حال الاعتماد على الله وهو مقام المتوسطين أصحاب الأحوال ومن هذا المنزل‏\n\n\nقيل للنبي صلى الله عليه وسلم في فتح مكة لما وقف بين يديه رجل ممن كان النبي صلى الله عليه وسلم يريد قتله فلما قضى حاجته منه وانصرف قال النبي صلى الله عليه وسلم لم لم تقتلوه حين وقف بين يدي فقال له أصحابه هلا أومأت إلينا بطرفك فقال صلى الله عليه وسلم ما كان لنبي أن تكون له خائنة عين‏\n\n\nوهي حالة لا يسلم منها وغاية إن يسلم منها من سلم في الشر وأما في الخير فإنهم ربما اتخذوها في الخير طريقا محمودة فيومئ الكبير في حق الحاضر إلى بعض من يمتثل أمره أن يجي‏ء إليه بخلعة أو بمال يهبه لذلك الحاضر يكون ذلك إيماء بالعين لا تصريحا باللفظ من غير شعور من يومي في حقه بذلك الخير ولا يقع مثل هذا وإن كان خيرا من نبي وسببه أن لا تعتاده النفس فربما تستعمله في الشر لاستصحابها إياه في الخير إذ كانت النفس من طبعها أن تسترقها العادة وإنما سميت خائنة عين لأن الإفصاح عما في النفس إنما هو لصفة الكلام ليس هو من صفة العين وإن كان في قوة العين الإفصاح بما في النفس بالإشارة ولكن إنما لها النظر والذي عندها من صفة الكلام إنما هو أمانة بيدها للكلام فإذا تصرفت في تلك الأمانة بالإيماء والإشارة لمن تومئ إليه في أمر ما فقد خانت الكلام فيما أمنها عليه من ذلك فلهذا سميت خائِنَةَ الْأَعْيُنِ فوصفت بالخيانة والخيانة التصرف في الأمانة فإن الأمانة ليست بملك لك وإنك مأمور بأدائها إلى أهلها فإذا اقتضى المنزل الأمر بخير وشر في حق شخص وفي قوة العين الإفصاح عن ذلك لمن يشير إليه به فعلمت إن ذلك صفة للكلام فلم تفعل وردت تلك الأمانة إلى اللسان فنطق فقد أدت هذه العين الأمانة إلى أهلها ولم تخن فيها قال تعالى يَعْلَمُ خائِنَةَ الْأَعْيُنِ أي يعلم أنها خيانة وكيف هي خيانة ولم يقل يعلم ما أشارت به الأعين وما أومأت فإن المشار إليه يعلم ذلك فلا يكون مدحا ولكن لا يعلم كل أحد أنها خيانة إلا من أعلمه الله بذلك وقد أعلمنا بها فعلمناها فهي في الخير خيانة محمودة وفي الشر خيانة مذمومة وما زالت عن كونها خيانة في الحالين وبعد أن بينا لك هذا الأمر فتحفظ منها ما استطعت أن تفعلها مع الحضور فإنك لست بمعصوم فاستعمل الحضور عسى تفوز بهذا المقام فإن قلت قد أشارت من شهد لها بالكمال ومنعت من الكلام وهي مريم إلى عيسى إن يسألوه عن شأنه قلنا بعد ذلك نالت الكمال لا في ذلك الوقت أ لا ترى زكريا قيل له آيَتُكَ أَلَّا تُكَلِّمَ النَّاسَ ثَلاثَةَ أَيَّامٍ إِلَّا رَمْزاً والرمز ما يقع بالإشارة فإن الإشارة صريحة في الأمر المطلوب بل هي أقوى في التعريف من التلفظ باسم المشار إليه في مواطن يحتاج المتكلم فيها إلى قرينة حال حتى لو قال شخص لآخر كلم زيدا بكذا وكذا وزيد حاضر احتمل أن يفهم عنه السامع زيدا آخر غير هذا والمتكلم إنما أراد الحاضر فإذا ترك التلفظ باسمه وأشار إليه بيده أو بعينه فقال كلم هذا مشيرا إليه كان أفصح وأبعد من الإبهام والنكر والحرف إنما هو لفظ مجمل يحتمل التوجيه فيه إلى أمور مثل ما رمز الشاعر في التعريف بالنار من غير إن يسميها فقال‏\n\n\n> وطائرة تطير بلا جناح *** وتأكل في المساء وفي الصباح‏\n\n\n> وتمشي في الغصون لها صياح *** وهز في الحسام لدى الكفاح‏\n\n\n> تفر الأسد منها في الفيافي *** وتغلب للصوارم والرماح‏\n> وتجلس بين أفخاذ العذارى *** وتكشف ما خفي تحت الوشاح‏\n\n\n> إذا ماتت تجارح والداها *** فترجع حية عند الجراح‏\n\n\nيريد بالوالدين الزناد فهذا هو الرمز في النار وقال الآخر في العين فأحسن‏\n\n\n> وطائرة تطير بلا جناح *** تفوق الطائرين وما تطير\n\n\n> إذا ما مسها الحجر استكنت *** وتنكر أن يلامسها الحرير\n\n\nيريد بالحجر الإثمد\n\n\n### [الظن لا يغني من الحق شيئا]\n\n\nواعلم أنه من أقام في نفسه معبودا يعبده على الظن لا على القطع خانه ذلك الظن وما أغنى عنه من الله شيئا قال تعالى إِنَّ الظَّنَّ لا يُغْنِي من الْحَقِّ شَيْئاً وقال في عبادتهم إِنْ يَتَّبِعُونَ إِلَّا الظَّنَّ وما تَهْوَى الْأَنْفُسُ فما نسب إليهم قط أنهم عبدوا غير الله إلا على طريق الظن لا على جهة العلم فإن ذلك في نفس الأمر ليس بعلم فمن هنا تعلم أن العلم سبب النجاة وإن شقي في الطريق فالمال إلى النجاة فما أشرف مرتبة العلم ولهذا لم يأمر الله نبيه صلى الله عليه وسلم أن يطلب من الله تعالى الزيادة من شي‏ء إلا من العلم فقال له وقُلْ رَبِّ زِدْنِي عِلْماً فمن فهم ما أشرنا إليه علم أهل السعادة من أهل الشقاء ولم تؤثر فيه الأمور العرضية التي توجب الشقاء في الطريق فلو علم المشرك ما يستحقه الحق من نعوت الجلال لعلم أنه لا يستحق أن يشرك به ولو علم المشرك أن الذي جعله شريكا لا يستحق أن يوصف بالشركة لله في الوهته لما أشرك فما أخذ إلا بالجهل من\n\n\nالطرفين قال تعالى فَلا تَكُونَنَّ من الْجاهِلِينَ وقال إِنِّي أَعِظُكَ أَنْ تَكُونَ من الْجاهِلِينَ فلو اقتصر المشرك على الشركة في الفعل لا في الألوهة لكان في الأمر سعة فإن إضافة الأفعال إلى المخلوقين فيه إشكال ويعذر صاحبه فيمن هو ذو فعل فإذا أضافوا الأفعال إلى من يعلمون أنه ليس بفاعل فبالجهل أخذوا وبه وقع التوبيخ فقيل لهم أَ تَعْبُدُونَ ما تَنْحِتُونَ وقال في حق ذي فعل وأَضَلَّ فِرْعَوْنُ قَوْمَهُ وما هَدى‏ فنسب الإضلال لفرعون وما نسبه إلى قومه فإنه عندهم ذو فعل وفي نفس الأمر كذلك وقوله وما هَدى‏ أي ما بين لهم طريق الحق فإنه موضع لبس لكونه ذا أفعال فلو كان المعبود جمادا ما وقع اللبس فإن قيل فإن اتخذوا إلها من له فعل بالخاصية من جماد ونبات أ يعذرون قلنا لا يعذرون فإن خاصيته لا تكون سارية في كل شي‏ء حتى تضاف إليه الأفعال كما تضاف إلى الله وبهذا القدر من الجهل أخذوا عبدة المخلوقين ذوي الأفعال كفرعون وغيره فإن القدرة التي له لا تزيد على قدرة العابد إياه فهي قاصرة عن سريانها في جميع الأفعال فإن القدرة الحادثة لا تخلق المتحيزات من أعيان الجواهر والأجسام فعبدوا من لم يخلق أعيانهم ولهذا وبخهم بقوله تعالى أَ فَمَنْ يَخْلُقُ كَمَنْ لا يَخْلُقُ أَ فَلا تَذَكَّرُونَ فإن قيل فإن أقدر أحد على جهة خرق العادة على خلق جوهر فعبده أحد لذلك هل يعذر أم لا قلنا لا بعذر فإنه يشهد أنه يقبل الحوادث ولا يخلو عنها وما لا يخلو عن الحوادث يستحيل أن يتقدمها على الجملة وإذا لم يتقدم الحوادث على الجملة كان حادثا مثلها ومن شأن الإله أن يكون أقدم من كل ما يحدث على الجملة فلا بد أن يكون الحادث متأخرا عنه بأي نسبة كان من نسب التأخر فلما فاته هذا القدر من العلم وكان جاهلا به لم يعذر وأخذ بذلك وأصله إنما كان الجهل بذلك فمن استند إلى معبود موضوع فإنما استند إليه بظنه لا بعلمه فلذلك أخذ به فشقي إلا أن يعطي المجهود من نفسه في نفي الشريك فلم يعط فكره ولا نظره ولا اجتهاده نفيه جملة واحدة ولم يبعث إليه رسول ولم تصل إليه دعوته فإن جماعة من أهل النظر قالوا بعذر من هذه حالته وهو مأجور في نفس الأمر مع أنه مخطئ وليس بصاحب ظن بل هو قاطع لا عالم والقطع على الشي‏ء لا يلزم أن يكون عن علم وربما يستروح من قول الله تعالى ومن يَدْعُ مَعَ الله إِلهاً آخَرَ لا بُرْهانَ لَهُ به إن الله يعذره ولا شك أن المجتهد الذي أخطأ في اجتهاده في الأصول يقطع أنه على برهان فيما أداه إليه نظره وإن كان ليس ببرهان في نفس الأمر فقد يعذره الله تعالى لقطعه بذلك عن اجتهاده كما قطع الصاحب أنه رأى دحية وكان المرئي جبريل فهذا قاطع على غير علم فاجتهد فأخطأ فإنه غير ذاكر لما نقصه من التقسيم فإنه لو قال إن لم يكن روحا تجسد وإلا فهو دحية بلا شك فتدبر ما قررناه في مثل هذا\n\n\nفإن النبي صلى الله عليه وسلم يقول في المجتهد إذا اجتهد فأصاب فله أجران وإن أخطأ فله أجر\n\n\nولم يفصل بين الاجتهاد في الأصول والفروع وقال‏\nتعالى وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا ويلحق بهذا الباب طوائف ممن أوجب أكثر العلماء عليهم العذاب وحكموا عليهم بالشقاء من غير دليل واضح يفيد العلم فأنزلوهم منازل الأشقياء بالظن والقطع على غير علم في نفس الأمر فالإله لا يكون بالحسبان فثبت بما ذكرناه أنه من ظن لم ينج من عذاب في الإله فإن قيل‏\n\n\nيقول الله أنا عند ظن عبدي بي‏\n\n\nقلنا له هو مذهبنا فإنه قال بي فقد أثبته وما قال أنا عند ظن العبد بمن جعله إلها فمتعلق الظن كان عنده بالله فيما يظنه من سعادة أو شقاء فإنه عالم بالله صاحب ظن في مؤاخذته على الذنب أو العفو عنه وبعد أن تقرر هذا\n\n\n### [أن الجنة جنتان جنة حسية وجنة معنوية كما أن النار ناران‏]\n\n\nفلتعلم إن الجنة جنتان جنة حسية وجنة معنوية فالمحسوسة تتنعم بها الأرواح الحيوانية والنفوس الناطقة والجنة المعنوية تتنعم بها النفوس الناطقة لا غير وهي جنة العلوم والمعارف ما ثم غيرهما والنار ناران نار محسوسة ونار معنوية فالنار المحسوسة تتعذب بها النفوس الحيوانية والنفوس الناطقة والنار المعنوية تتعذب بها النفوس الناطقة لا غير والفرق بين النعيمين والعذابين إن العذاب الحسي والنعيم الحسي يكون بالمباشرة للذي يكون عن مباشرته الألم القائم بالروح الحيواني والعذاب المعنوي لا يكون بمباشرة للنفوس الناطقة وإنما هو بما حصل لها من العلم بما فاتها من العمل والعلم المؤدي إلى سعادة الروح الحيواني الذي يتضمن سعادة النفس الناطقة وأما نار الفكر الذي يتعلق ألمه بالحس وبالنفس فهي نار معنوية فإن حصل العلم عنها أعقبها نعيم جنة معنوية وإن لم يحصل العلم عنها لم يزل صاحبها معذبا ما دام مفكرا ولا نعيم له معنوي وإذا زال الفكر عنه بأي وجه زال من غير حصول علم فذلك النعيم الذي تجده النفس إنما هو الراحة من فقد نار التفكر المسلط على قلبه فهي راحة حسية لا معنوية فاعلم ذلك‏\n\n\n### [إحراق النار بالطبع‏]\n\n\nواعلم أن هذا المنزل يتضمن علم عقل ما ليس بحيوان في الإدراك الحس العادي عن الله تعالى ما يأمره به مثل قوله تعالى إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ فَأَبَيْنَ أَنْ يَحْمِلْنَها وقوله تعالى فَقالَ لَها ولِلْأَرْضِ ائْتِيا طَوْعاً أَوْ كَرْهاً قالَتا أَتَيْنا طائِعِينَ فجمعهما جمع من يعقل وأثبت لها ما أثبت للحي العالم السميع القادر وقوله تعالى عَلَيْهِمْ نارٌ مُؤْصَدَةٌ فأخبر أنها مسلطة ولا يقبل التسليط إلا من يعقل وأنها محرقة بالطبع فإنه لو لم تحرق بالطبع ما قبلت الإرسال على الكفار إذ لو كان الحرق فيها بغير الطبع لما تصورت منها المخالفة لأن المخالف إنما هو الاحتراق فهو أمر آخر يفتقر وجوده إلى إيجاد موجدة والحق ما خاطب إلا النار والإحراق عرض والعرض يفتقر إلى وجود في غير عين النار فإنه إن وجد في النار فإنه لا ينتقل إلى الجسم المسلط عليه النار لأن العرض لا ينتقل إذ لو انتقل لخلا عن المحل وقام بنفسه والعرض لا يقوم بنفسه فمن المحال تحريق الجسم المحرق بالنار فيكون خطاب النار بالإحراق عبثا وقد وقع الخطاب على النار بالتسليط فعلى من وقع فبطل إن يكون الحق يتكلم بالعبث فكيف يخرج هذا الخطاب وعلى من يقع إذا لم يكن الإحراق للنار بالطبع وهكذا كل جماد ونبات وحيوان خوطب لا بد أن يكون حيا عاقلا قابلا لما يخاطب به من شأنه أن يعقل ما قيل له افعل قبولا ذاتيا تابعا لوجود عينه فهذا قد نبهتك على هذا النوع من الإدراك الذي يتضمنه هذا المنزل واعلم أن جميع ما يحويه هذا المنزل من العلوم لا يوصل إليها إلا بالتعريف الإلهي بوساطة روحانية الأنبياء لهذا المكاشف وتلك الأرواح لا يعلمها من الله إلا بوسائط لغموضها ودقتها فمن جملة ما يحويه علم كسر المكسور إلى ما لا نهاية له ومعلوم من طريق العقل إن المكسور محصور فهو متناه لنفسه فكيف يقبل الكسر إلى ما لا يتناهى وهذه مسألة تشبه بمسألة انقسام الجسم إلى ما لا نهاية له عقلا لا حسا عند الحكماء لإبطال إثبات الجوهر الفرد الذي تنتهي إليه قسمة الجسم في مذهب المتكلمين فمن هذا المنزل تعرف الحق عند من هو من هاتين الطائفتين وتطلع من هذا المنزل على علم قيام العذاب وحمله في غير أجسام المعذبين وعذاب المعذبين به مع كونه غير قائم بهم وهو من أشكل المسائل كيف يوجب المعنى حكمه لغير من قام به فتشبه أيضا هذه المسألة مسألة من يقول إن الله إذا أراد أن يمضي أمرا خلق إرادة لا في محل ثم أراد بها إمضاء ذلك الأمر فقد أوجب المعنى حكمه لمن لم يقم به عند مثبتي الصفات أعيانا لها أحكام وهم المتكلمون والفرق بين هذه المسألة وبين مسألتنا أن العذاب محمول في أجسام وحكمه في أجسام أخر غير الأجسام القائم بها العذاب والعذاب المحمول في هذه الأجسام لا تتعذب به وهو قائم بها وهي متصفة به من كونها محلا\nله لا من كونها معذبة به والوجه الجامع بين المسألتين وجود الحكم المضاف إلى المعنى في غير المحل الذي قام به ذلك المعنى وهل العلم مثل الإرادة في هذا الباب وغيره من الصفات أم لا فيقوم العلم بزيد ولا يعلم به زيد ويعلم به عمر وهذا محال عقلا ولكن هذا المنزل يحكم بوقوع ذلك فإن أردت تأنيس النفس لقبول ما أعطاه هذا المنزل في هذه المسألة فانظر ما أنت مجمع عليه مع أصحابك إن الحق سبحانه يتعالى عن الحلول في الأجسام فإن الإنسان إنما يبصر ببصره القائم بجارحة عينه في وجهه ويسمع بسمعه القائم بجارحة أذنه ويتكلم بالكلام الموجود في تحريك لسانه وتسكينه وشفتيه ومخارج حروفه من صدره إلى شفتيه ثم إن هذا الشخص يعمل بطاعة الله تعالى الزائدة على فرائضه من نوافل الخيرات فينتج له هذا العمل نفي سمعه وبصره وكلامه وجميع معانيه من بطش وسعي التي كانت توجب له أحكامها فكان ينطلق عليه من أحكامها سميع بصير متكلم إلى غير ذلك فصار يسمع بالله بعد ما كان يسمع بسمعه ويبصر بالله بعد ما كان يبصر ببصره مع العلم بأن الله يتقدس أن تكون الأشياء محلا له أو يكون هو محلا لها فقد سمع العبد بمن لم يقم به وأبصر بما لم يقم به وتكلم بما لم يقم به فكان الحق سمعه وبصره ويده فهكذا وجود العذاب في المحال التي لم تقم بها الصفة التي يكون حكمها العذاب كما قد ثبت أن الصفة تعطي خلاف حكمها في المحل وأنت القائل به ولا فرق بين المسألتين وقد أنشد في ذلك صاحب محاسن المجالس‏\n\n\n> فهل سمعتم بصب *** سليم طرف سقيم‏\n\n\n> منعم بعذاب *** معذب بنعيم‏\n\n\nوأنشد أبو يزيد الأكبر طيفور بن عيسى البسطامي يخاطب ربه عز وجل‏\n\n\n> أريدك لا أريدك للثواب *** ولكني أريدك للعقاب‏\n\n\n> وكل ما ربي قد نلت منها *** سوى ملذوذ وجدي بالعذاب‏\n\n\nفطلب اللذة في العذاب وهذا عكس الحقائق في العقل ولكن أهل الكشف والذوق وجدوا أمورا أحالها العقل وإن كنا نعرف نحن ما قاله القائلان في شعرهما ومن هذا الباب قال الله للنار كُونِي بَرْداً وسَلاماً والنار لا تكون بردا في العقل إذ لو كانت بردا لبطلت الحقائق أن تكون حقائق فقد جاء الذوق في تجليه بخلاف ما يعطيه العقل وإن كنا نحن نعرف ما قاله الحق في ذلك ولمن خاطب به ولكن جئنا بذلك تأنيسا للمريد ليتحقق أَنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ وأن قدرته مطلقة على إيجاد المحال لو شاء وجوده كما ذكره\n\n\nفي كتابه عن نفسه ما هو محال في العقل بما يعطيه دليله فقال لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً لَاصْطَفى‏ مِمَّا يَخْلُقُ ما يَشاءُ سُبْحانَهُ هُوَ الله الْواحِدُ الْقَهَّارُ فألحقه بدرجة الإمكان بالنسبة إلى المشيئة الإلهية والعقل قد دل على إن ذلك محال لا من كونه لم يرده فكانت هذه الآية أولها جرح جرح به العقل في صحة دليله ليبطله ثم داوى ذلك الجرح في آخر الآية بقوله سبحانه أي هو المنزه أن يكون لأحديته ثان غير أن في قوله القهار أسرارا من اعتبرها لمن يكون قهارا وجميع الأفعال إنما هي أحكام أسمائه في الكون فلا فعل لأحد إلا لله فالأفعال كلها من الاسم القادر والقاهر فما يقهر بالاسم القاهر إلا موجد ذلك الفعل في الكون وهو أثر القاهر فما قهر إلا نفسه وهو أثر الاسم القادر فما قهر إلا الاسم القادر وهو المشارك له في وجود العين فما قهر القاهر القادر إلا بالاسم القادر فالقادر نفسه قهر بالاسم القاهر إلا أن يكون القهر بالمنع لا بالإيجاد فيكون عند ذلك القهر مضافا إلى الاسم المريد ولكن ما يمنع إلا بالاسم القاهر للعين التي تهيأت لقبول الوجود فقهرتها المشيئة وأخرتها عن الوجود لأن لها الترجيح فقد حصلت لك بما أوردته من الأنس في قبول هذه المسألة ما فيه كفاية فيما تعطيه طريقة القوم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Eighty: Concerning the Gnosis of the Station of \"My Wealth\" (mālī) and its Secrets Derived from the Mosaic Station\n\nI said, \"My wealth (mālī)?\" He replied, \"Your wealth is My servant.\"\nI said, \"My wealth?\" He replied, \"Your wealth is with Me (ʿindī).\"\n\nI said, \"Since I attributed it to myself as possession, why did You specify it with Your saying, 'with Me'?\"\n\nHe said, \"Because I knew that you are with Me, whatever is under your possession is also with Me.\"\n\nI said, \"If the very essence of 'You are Me' is true, then what You said—that what is with You is with Me—is correct.\"\n\n\"And just as You said that what is with You is with Me, let us also say that what is with You is with Me.\"\n\n\"And this is more fitting, for My Essence (dhātī) is a vessel, while You are Transcendent (taʿālayta), so the 'withness' (al-ʿind) is with Me.\"\n\nThis is a high station (manzil ʿāl) between which and its standing-place (mawqif) there is no suitability (munāsaba). The suitability thus reverts to the one standing [in the station], just as it was in the station preceding this one. Jacob (Yaʿqūb), peace be upon him, said to his sons: <<وَمَا أُغْنِي عَنْكُمْ مِنَ اللَّهِ مِنْ شَيْءٍ إِنِ الْحُكْمُ إِلَّا لِلَّهِ>> (And I cannot avail you against Allah at all. The judgment is only for Allah). This is from this station.\n\nMuhammad, peace and blessings of Allah be upon him, said—when the verse <<وَأَنْذِرْ عَشِيرَتَكَ الْأَقْرَبِينَ>> (And warn your nearest kindred) was revealed to him—he stood upon Mount Safa, and the people rushed to him. He said to the dearest person to him, \"O Fatima, daughter of Muhammad, look out for yourself; I cannot avail you against Allah at all.\" He said a similar statement to all his relatives. His uncle, Abu Lahab, was present and blew into his hand, saying, \"Nothing of what he said has been gained by our hands.\" Abu Lahab spoke the truth, for Allah did not benefit him through this warning, nor did He place anything of it into his heart, due to the misery (ash-shaqā’) decreed for him. Thus, Allah revealed concerning him: <<تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ * مَا أَغْنَى عَنْهُ مَالُهُ وَمَا كَسَبَ>> (May the hands of Abu Lahab be ruined, and ruined is he. His wealth will not avail him, nor what he gained).\n\nFor he was relying on his wealth. Whoever relies on other than Allah in his affairs is lost. Those who affirm secondary causes (al-asbāb), if they rely upon them and abandon reliance upon Allah, they join <<الْأَخْسَرِينَ أَعْمَالًا>> (those whose deeds are the greatest losers). But if they affirm the secondary causes and rely upon Allah, and do not exceed the rank (manzila) that Allah has assigned to them, then those are the great ones (al-akābir) among the Men of Allah (rijāl Allāh), whom <<لَا تُلْهِيهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَنْ ذِكْرِ اللَّهِ>> (neither commerce nor selling distracts from the remembrance of Allah). The Real (al-Haqq) affirmed their manhood (ar-rujūliyya) in this station (mawṭin). Whoever is witnessed to by The Real concerning an affair is upon truth in his claim, should he make one. Whoever affirms the secondary causes by affirming The Real, but leans upon them with a natural inclination (rukūn aṭ-ṭabʿ) and becomes agitated upon their loss, even while relying on Allah—that one is among the average men (mutawassiṭ ar-rijāl). If agitation occurs in the soul (an-nafs), such that one feels the loss and the temperament (al-mizāj) is disturbed, that is characteristic of the great Men. But if the temperament is not disturbed and one does not feel the loss, that is the state of reliance upon Allah (al-iʿtimād ʿalā Allāh), which is the station (maqām) of the average ones, the people of spiritual states (aṣḥāb al-aḥwāl). This is also from this station.\n\nIt was related that during the Conquest of Mecca, when a man whom the Prophet, peace and blessings of Allah be upon him, intended to kill stood before him, and after the man had finished his business and departed, the Prophet, peace and blessings of Allah be upon him, said, \"Why did you not kill him when he stood before me?\" His Companions asked him, \"Why did you not signal to us with a glance (bi-ṭarfika)?\" The Prophet, peace and blessings of Allah be upon him, replied, \"It is not fitting for a Prophet to have a treacherous glance (khā’inat ʿayn).\"\n\nThis is a state from which no one is safe. At most, those who are safe from it are safe in evil matters. As for good matters, they sometimes adopt it as a praiseworthy path (ṭarīq maḥmūda) in goodness. For instance, when a great person signals with his eye to one of those present who obeys his command, asking him to bring a robe of honor (khilʿa) or money to bestow upon the person present—this is a signal with the eye, not an explicit verbal statement, and the person being signaled about the good deed is unaware. Such an act, even if it is good, should not occur from a Prophet. The reason is so that the soul (an-nafs) does not become accustomed to it, lest it be used in evil, due to the soul's habituation to it in good, since the nature of the soul is to be enslaved by habit.\n\nIt is called the \"treachery of the eye\" (khā’inat ʿayn) because the expression of what is in the soul belongs to the attribute of speech (ṣifat al-kalām), not the attribute of the eye. Although the eye has the power to express what is in the soul through signaling (al-ishāra), its primary function is sight (an-naẓar). The attribute of speech that the eye holds is merely a trust (amāna) in its hand for speech. If the eye disposes of that trust by signaling or gesturing to someone concerning a matter, it has betrayed speech in what was entrusted to it. Therefore, it is called <<خَائِنَةَ الْأَعْيُنِ>> (the treachery of the eyes). It is described as treachery (khiyāna), and treachery is the disposal of a trust, for a trust is not your possession, and you are commanded to render it to its rightful owners.\n\nIf the station (manzil) requires an order, whether good or evil, concerning a person, and the eye has the power to express this to the one being signaled, but the eye knows that this is the attribute of speech, so it refrains and returns that trust to the tongue, which then speaks—then this eye has rendered the trust to its owners and has not betrayed it. Allah the Exalted said: <<يَعْلَمُ خَائِنَةَ الْأَعْيُنِ>> (He knows the treachery of the eyes). That is, He knows that it is treachery and how it constitutes treachery. He did not say, \"He knows what the eyes signaled or gestured,\" for the one being signaled knows that, and thus it would not be a praise [of Allah's knowledge]. However, not everyone knows that it is treachery except those whom Allah informs. He has informed us of it, so we know it. It is praiseworthy treachery in good and blameworthy treachery in evil.\n\nNow that we have clarified this matter for you, guard yourself against performing it in the presence of others as much as you can, for you are not infallible (maʿṣūm). Strive for presence (al-ḥuḍūr), perhaps you will attain victory in this station (maqām). If you say, \"But Maryam, who was witnessed to possess perfection, signaled to Jesus and refrained from speaking, asking them to question him about his affair,\" we reply: She attained perfection *after* that, not at that time. Do you not see that Zechariah was told: <<آيَتُكَ أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَةَ أَيَّامٍ إِلَّا رَمْزًا>> (Your sign is that you will not speak to the people for three nights, except by signaling)? Signaling (ar-ramz) is what occurs through gesture (al-ishāra), for gesture is explicit concerning the desired matter; indeed, it is stronger in conveying meaning than uttering the name of the one being signaled in situations where the speaker needs a contextual clue (qarīnat ḥāl). For example, if a person tells another, \"Speak to Zayd about such-and-such,\" and Zayd is present, it is possible for the listener to understand him to mean another Zayd, not the one present, even though the speaker intended the one present. But if he refrains from uttering the name and points to him with his hand or eye, saying, \"Speak to this one,\" pointing to him, it is clearer (afṣaḥ) and further removed from ambiguity (al-ibhām) and uncertainty (an-nukr).\n\nThe letter (al-ḥarf) is merely a general utterance (lafẓ mujmal) that allows for interpretation (tawjīh) concerning various matters, just as the poet signaled (ramaza) in defining fire without naming it, saying:\n\nAnd a flyer that flies without a wing,\nAnd eats in the evening and in the morning.\n\nAnd walks among the branches, having a cry,\nAnd a shaking like a sword in combat.\n\nLions flee from it in the deserts,\nAnd it overcomes swords and spears.\n\nAnd it sits between the thighs of virgins,\nAnd reveals what is hidden beneath the veil (al-wishāḥ).\n\nIf it dies, its two parents wound each other,\nAnd it returns alive at the wounding.\n\nHe means by the two parents (al-wālidayn) the fire-steel (az-zinād). This is the signaling (ar-ramz) concerning fire. And another said concerning the eye, and did well:\n\nAnd a flyer that flies without a wing,\nSurpassing all flyers, yet it does not fly.\n\nWhen stone touches it, it settles down,\nAnd it denies that silk should touch it.\n\nHe means by the stone (al-ḥajar) antimony (al-ithmid).\n\n### [Conjecture Avails Nothing Against The Real]\n\nKnow that whoever establishes a deity (maʿbūd) in his soul and worships it based on conjecture (aẓ-ẓann) and not on certainty (al-qaṭʿ), that conjecture will betray him and will not avail him against Allah at all. Allah the Exalted said: <<إِنَّ الظَّنَّ لَا يُغْنِي مِنَ الْحَقِّ شَيْئًا>> (Indeed, conjecture avails nothing against The Real). And concerning their worship, He said: <<إِنْ يَتَّبِعُونَ إِلَّا الظَّنَّ وَمَا تَهْوَى الْأَنْفُسُ>> (They follow nothing but conjecture and what the souls desire). Thus, it was never attributed to them that they worshipped other than Allah except by way of conjecture, not by way of Knowledge (al-ʿilm), for that [conjecture] is not Knowledge in reality (fī nafsi al-amr).\n\nFrom this, you learn that Knowledge is the cause of salvation (an-najāt), and even if one suffers hardship on the path, the outcome is salvation. How noble is the rank (martaba) of Knowledge! For this reason, Allah did not command His Prophet, peace and blessings of Allah be upon him, to ask Allah the Exalted for an increase in anything except Knowledge, saying to him: <<وَقُلْ رَبِّ زِدْنِي عِلْمًا>> (And say, \"My Lord, increase me in Knowledge\").\n\nWhoever understands what we have alluded to will know the people of felicity (ahl as-saʿāda) from the people of misery (ahl ash-shaqā’) and will not be affected by accidental matters (al-umūr al-ʿaraḍiyya) that necessitate misery on the path. If the polytheist (al-mushrik) knew the attributes of Majesty (nuʿūt al-jalāl) that The Real (al-Haqq) deserves, he would know that He does not deserve to have partners associated with Him. And if the polytheist knew that what he made a partner does not deserve to be described as sharing in Allah's Divinity (ulūhiyya), he would not have committed polytheism (shirk). He was only seized by ignorance (al-jahl) from both sides. Allah the Exalted said: <<فَلَا تَكُونَنَّ مِنَ الْجَاهِلِينَ>> (So do not be among the ignorant). And He said: <<إِنِّي أَعِظُكَ أَنْ تَكُونَ مِنَ الْجَاهِلِينَ>> (Indeed, I advise you not to be among the ignorant).\n\nIf the polytheist had limited the partnership to acts (al-fiʿl) and not to Divinity, there would have been latitude in the matter, for attributing acts to creatures (al-makhlūqīn) involves ambiguity, and the one who does so is excused if the creature is one who performs acts (dhū fiʿl). But when they attribute acts to those whom they know are not actors (fāʿil), they are seized by ignorance, and for this, they incurred reproach, as He said to them: <<أَتَعْبُدُونَ مَا تَنْحِتُونَ>> (Do you worship that which you carve?). And concerning one who performs acts, He said: <<وَأَضَلَّ فِرْعَوْنُ قَوْمَهُ وَمَا هَدَى>> (And Pharaoh led his people astray and did not guide them). He attributed the leading astray (al-iḍlāl) to Pharaoh and did not attribute it to his people, for in their view, he was an actor, and in reality (fī nafsi al-amr), he was likewise. His saying, <<وَمَا هَدَى>> (and did not guide them), means he did not show them the path of The Real, for this was a point of confusion (mawdhiʿ labs) because he was one who performed acts. If the object of worship had been an inanimate object (jamād), the confusion would not have occurred.\n\nIf it is said: What if they took as a god one who performs acts by inherent property (bi-l-khāṣṣiyya), such as an inanimate object or a plant? Are they excused? We reply: They are not excused, for its inherent property does not permeate everything such that acts can be attributed to it as they are attributed to Allah. It is by this degree of ignorance that the worshippers of creatures who perform acts, like Pharaoh and others, were seized. For the power (al-qudra) that he possesses does not exceed the power of the worshipper himself; it is deficient in permeating all acts. The originated power (al-qudra al-ḥāditha) does not create the delimited things (al-mutahayyizāt) from the essences of substances (jawāhir) and bodies (ajsām). Thus, they worshipped one who did not create their essences (aʿyānahum). For this reason, He reproached them with His saying, the Exalted: <<أَفَمَنْ يَخْلُقُ كَمَنْ لَا يَخْلُقُ أَفَلَا تَذَكَّرُونَ>> (Is He who creates like one who does not create? Will you not remember?).\n\nIf it is said: What if someone is enabled, by way of breaking the custom (kharq al-ʿāda), to create a substance (jawhar), and someone worships him for that? Is he excused or not? We reply: He is not excused, for he witnesses that [the created substance] accepts originated events (al-ḥawādith) and is not free of them. And whatever is not free of originated events is impossible to precede them entirely (ʿalā al-jumla). If it does not precede the originated events entirely, it is originated (ḥādith) like them. The nature of the Divine (al-Ilāh) is to be older than everything that originates entirely. The originated must necessarily be posterior to Him by whatever ratio of posteriority. Since this degree of Knowledge escaped him, and he was ignorant of it, he is not excused and is seized by it. Its origin was only that ignorance.\n\nWhoever relies upon an established object of worship (maʿbūd mawḍūʿ) relies upon it based on his conjecture, not his Knowledge. Therefore, he is seized by it and suffers misery, unless he exerts his utmost effort (al-majhūd) in denying the partner, but his thought (fikr), contemplation (naẓar), or striving (ijtihād) did not lead him to deny it completely, and no messenger was sent to him, nor did the call reach him. A group of contemplative scholars (ahl an-naẓar) said that one in this state is excused, and he is rewarded in reality (fī nafsi al-amr), even though he is mistaken. He is not a person of conjecture (ṣāḥib ẓann), but rather a person of certainty (qāṭiʿ), not a knower (ʿālim). Certainty about a thing does not necessarily stem from Knowledge. One might find comfort in the saying of Allah the Exalted: <<وَمَنْ يَدْعُ مَعَ اللَّهِ إِلَهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ>> (And whoever invokes alongside Allah another god for which he has no proof), suggesting that Allah excuses him.\n\nThere is no doubt that the *mujtahid* (one who strives to deduce rulings) who errs in his striving concerning the fundamentals (al-uṣūl) is certain that he is upon proof (burhān) in what his contemplation led him to, even if it is not proof in reality. Thus, Allah may excuse him for his certainty based on his striving, just as the Companion was certain that he saw Diḥya, when the one seen was Gabriel. This is certainty based on non-Knowledge. He strove and erred because he failed to mention the missing part of the division. If he had said, \"If it is not a spirit that has embodied itself, then it is undoubtedly Diḥya,\" then reflect upon what we have established in such a case.\n\nFor the Prophet, peace and blessings of Allah be upon him, said concerning the *mujtahid*: \"If he strives and is correct, he has two rewards; and if he errs, he has one reward.\" He did not distinguish between striving in the fundamentals (al-uṣūl) and the branches (al-furūʿ). Allah the Exalted said: <<وَمَا كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا>> (And We would not punish until We had sent a messenger). This chapter includes groups whom most scholars deemed deserving of punishment and judged them to be miserable (ash-shaqā’) without clear evidence that yields Knowledge. They assigned them to the stations of the miserable based on conjecture and certainty without Knowledge in reality. The Divine (al-Ilāh) is not based on estimation (al-ḥusbān). Thus, it is established by what we have mentioned that whoever relies on conjecture will not be saved from punishment concerning the Divine.\n\nIf it is said: Allah says, \"I am as My servant thinks of Me (bī).\" We reply: That is our doctrine, for He said \"of Me\" (bī). He affirmed Himself. He did not say, \"I am as the servant thinks of the one he made a god.\" The object of the conjecture (ẓann) was concerning Allah Himself, regarding the felicity or misery he conjectured, for he is a knower of Allah (ʿālim bi-Llāh), but one who conjectures regarding His accountability for sin or His forgiveness.\n\nNow that this is established:\n\n### [That Paradise is Two Paradises: A Sensory Paradise and an Intellectual Paradise, just as the Fire is Two Fires]\n\nKnow that Paradise (al-Janna) is two Paradises: a sensory Paradise (janna ḥissiyya) and an intellectual Paradise (janna maʿnawiyya). The sensory one is where the animal spirits (al-arwāḥ al-ḥayawāniyya) and the rational souls (an-nufūs an-nāṭiqa) enjoy bliss. The intellectual Paradise is where only the rational souls enjoy bliss. It is the Paradise of sciences (al-ʿulūm) and gnoses (al-maʿārif). There is nothing else besides them.\n\nAnd the Fire (an-Nār) is two Fires: a sensory Fire (nār maḥsūsa) and an intellectual Fire (nār maʿnawiyya). The sensory Fire is where the animal souls (an-nufūs al-ḥayawāniyya) and the rational souls are tormented. The intellectual Fire is where only the rational souls are tormented.\n\nThe difference between the two kinds of bliss and the two kinds of torment is that sensory torment and sensory bliss occur through direct contact (al-mubāshara), which results in pain residing in the animal spirit. Intellectual torment (al-ʿadhāb al-maʿnawī) does not occur through direct contact for the rational souls. Rather, it is due to the Knowledge (al-ʿilm) they acquired concerning the actions (al-ʿamal) they missed, and the Knowledge that leads to the felicity of the animal spirit, which implies the felicity of the rational soul.\n\nAs for the fire of thought (nār al-fikr), whose pain relates to the senses and the soul, it is an intellectual Fire. If Knowledge results from it, it is followed by the bliss of an intellectual Paradise. If Knowledge does not result from it, its possessor remains tormented as long as he is thinking, and he has no intellectual bliss. If the thought ceases for him, by whatever means it ceases, without the attainment of Knowledge, the bliss that the soul finds is merely relief from the loss of the fire of contemplation (nār at-tafakkar) that was imposed upon his heart. This is sensory comfort (rāḥa ḥissiyya), not intellectual. Know this.\n\n### [The Burning of the Fire by Nature]\n\nKnow that this station (manzil) includes the knowledge of the intellect (ʿaql) of what is not animal in ordinary sensory perception (al-idrāk al-ḥiss al-ʿādī) concerning what Allah the Exalted commands it to do. For example, His saying: <<إِنَّا عَرَضْنَا الْأَمَانَةَ عَلَى السَّمَاوَاتِ وَالْأَرْضِ وَالْجِبَالِ فَأَبَيْنَ أَنْ يَحْمِلْنَهَا>> (Indeed, We offered the Trust [al-Amāna] to the heavens and the earth and the mountains, but they refused to bear it). And His saying: <<فَقَالَ لَهَا وَلِلْأَرْضِ ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ>> (Then He said to it [the heaven] and to the earth, \"Come willingly or unwillingly.\" They said, \"We have come willingly\"). He addressed them as one addresses a rational being (man yaʿqil) and affirmed for them what He affirms for the knowing, hearing, and capable living being.\n\nAnd His saying: <<عَلَيْهِمْ نَارٌ مُؤْصَدَةٌ>> (Upon them is a Fire closed in). He informed that it is imposed (musaṭṭala), and only a rational being accepts imposition. And that it burns by nature (bi-ṭ-ṭabʿ). For if it did not burn by nature, it would not accept being sent against the disbelievers, because if the burning were in it by other than nature, disobedience (al-mukhālafa) would not be conceivable from it, since disobedience is the burning itself. Burning is another matter whose existence requires the creation of a creator (mūjid). The Real (al-Haqq) only addressed the Fire, and burning (al-iḥrāq) is an accident (ʿaraḍ). An accident requires existence in something other than the essence of the Fire. For if it existed in the Fire, it would not transfer to the body upon which the Fire is imposed, because an accident does not transfer; if it transferred, it would vacate its locus and subsist by itself, and an accident does not subsist by itself. Therefore, the burning of the body being burned by the Fire is impossible. Thus, addressing the Fire with the command to burn would be futile (ʿabathan). Yet, the command to impose (at-taslīṭ) was directed at the Fire. Upon whom did it fall? It is therefore invalid that The Real speaks in futility. How then is this address to be understood, and upon whom does it fall, if the burning of the Fire is not by nature?\n\nSimilarly, every inanimate object, plant, or animal that is addressed must be living, rational, and capable of accepting what it is addressed with, such that it is capable of understanding what was said to it—\"Do [this]\"—with an essential acceptance (qubūlan dhātiyyan) following the existence of its essence (ʿayn). I have alerted you to this type of perception (idrāk) contained within this station.\n\nKnow that all the sciences (al-ʿulūm) contained in this station can only be reached through Divine instruction (at-taʿrīf al-ilāhī) via the spirituality (rūḥāniyya) of the Prophets for the one who receives the unveiling (al-mukāshif). Those spirits are known from Allah only through intermediaries (wasā’iṭ) due to their subtlety and precision. Among what it contains is the knowledge of breaking the broken (kasr al-maksūr) into infinity (ilā mā lā nihāyata lahu). It is known by way of the intellect (al-ʿaql) that the broken thing is confined (maḥṣūr); thus, it is finite in itself. How can it accept being broken into infinity? This issue resembles the issue of the division of the body into infinity intellectually, though not sensually, according to the philosophers (al-ḥukamā’), in order to invalidate the affirmation of the indivisible substance (al-jawhar al-fard) where the division of the body ends, according to the doctrine of the theologians (al-mutakallimūn). From this station, you know The Real (al-Haqq) according to which of these two groups He belongs.\n\nFrom this station, you also gain insight into the knowledge of the subsistence (qiyām) of torment (al-ʿadhāb) and its bearing in bodies other than the bodies of the tormented, and the torment of the tormented by it, despite it not subsisting in them. This is one of the most difficult issues: How can an attribute (al-maʿnā) necessitate its ruling (ḥukmuhu) for something in which it does not subsist? This issue also resembles the issue of those who say that when Allah wills to execute an affair, He creates a will (irāda) not in a locus, and then wills the execution of that affair by means of that will. This necessitates the ruling of the attribute for one in whom it does not subsist, according to those who affirm the attributes as essences (aʿyān) having rulings—namely, the theologians (al-mutakallimūn).\n\nThe difference between this issue and ours is that the torment is borne in bodies, and its ruling is in other bodies, which are not the bodies in which the torment subsists. The torment borne in these bodies does not torment them, even though it subsists in them, and they are described by it as being its locus (maḥall), not as being tormented by it. The common aspect between the two issues is the existence of the ruling attributed to the attribute in a locus other than the one in which that attribute subsists.\n\nIs Knowledge (al-ʿilm) like Will (al-irāda) in this chapter and other Attributes (ṣifāt), or not? So that Knowledge subsists in Zayd, but Zayd does not know by it, while ʿAmr knows by it. This is intellectually impossible. However, this station (manzil) affirms the occurrence of that. If you wish to reassure the soul (an-nafs) to accept what this station grants concerning this issue, look at what you and your companions agree upon: that The Real, the Glorified, is transcendent above indwelling (al-ḥulūl) in bodies.\n\nYet, a human being sees with his sight (baṣar) subsisting in the organ of his eye in his face, and hears with his hearing (samʿ) subsisting in the organ of his ear, and speaks with the speech (kalām) existing in the movement and stillness of his tongue, his lips, and the articulation points of his letters from his chest to his lips. Then this person performs acts of obedience to Allah the Exalted that exceed his obligatory duties, such as supererogatory good deeds (nawāfil al-khayrāt). This action results in the negation of his hearing, sight, speech, and all his attributes of striking (baṭsh) and striving (saʿy) that previously necessitated their rulings for him—so he was described by their rulings as hearing, seeing, speaking, and so on. He then begins to hear by Allah after he used to hear by his hearing, and sees by Allah after he used to see by his sight, while knowing that Allah is sanctified (yataqaddas) from things being a locus for Him or Him being a locus for them. Thus, the servant heard by that in which the attribute did not subsist, saw by that in which the attribute did not subsist, and spoke by that in which the attribute did not subsist. The Real became his hearing, his sight, and his hand. In the same way, torment exists in loci in which the attribute whose ruling is torment does not subsist, just as it has been established that the attribute gives a ruling contrary to its own ruling in the locus, and you are the one who affirms this. There is no difference between the two issues.\n\nThe author of *Maḥāsin al-Majālis* recited concerning this:\n\nHave you ever heard of a lover,\nWhose eye is sound, yet sick?\n\nBlissful through torment,\nTormented through bliss?\n\nAnd Abu Yazid al-Akbar, Tayfur ibn ʿIsa al-Bisṭāmī, recited, addressing his Lord, the Mighty and Majestic:\n\nI desire You, not desiring You for reward,\nBut rather I desire You for punishment.\n\nAnd everything, my Lord, that I have attained from them,\nIs nothing compared to the delightful ecstasy (wajd) I find in torment.\n\nHe sought delight in torment, which is the inverse of realities (ʿaks al-ḥaqā’iq) according to the intellect (al-ʿaql). However, the people of Unveiling (Kashf) and Taste (Dhawq) have found matters that the intellect deems impossible, although we know what the two poets said in their verses.\n\nFrom this chapter, Allah said to the Fire: <<كُونِي بَرْدًا وَسَلَامًا>> (Be coolness and safety). The Fire cannot be coolness according to the intellect, for if it were coolness, realities would cease to be realities. Thus, the Taste (adh-dhawq) came in its Theophany (tajallī) contrary to what the intellect yields. Although we know what The Real said concerning that and to whom He addressed it, we brought this up to reassure the seeker (al-murīd) so that he may realize <<أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ>> (Indeed, Allah is over all things competent).\n\nAnd that His Power (qudra) is absolute concerning the creation of impossibilities (al-muḥāl) if He willed their existence, just as He mentioned in His Book concerning Himself what is intellectually impossible according to its proof: <<لَوْ أَرَادَ اللَّهُ أَنْ يَتَّخِذَ وَلَدًا لَاصْطَفَى مِمَّا يَخْلُقُ مَا يَشَاءُ سُبْحَانَهُ هُوَ اللَّهُ الْوَاحِدُ الْقَهَّارُ>> (If Allah had intended to take a son, He could have chosen from what He creates whatever He willed. Exalted is He! He is Allah, the One, the Subduer [al-Qahhār]). He attached it to the degree of possibility (al-imkān) relative to the Divine Will (al-mashī’a al-ilāhiyya), while the intellect has demonstrated that this is impossible, not because He did not will it. Thus, the beginning of this verse was a wound inflicted upon the intellect regarding the soundness of its proof, in order to invalidate it. Then, He healed that wound at the end of the verse with His saying, \"Exalted is He!\" (subḥānahu)—meaning, He is Transcendent from having a second due to His Oneness (aḥadiyya).\n\nHowever, in His saying, \"the Subduer\" (al-Qahhār), there are secrets for whoever considers for whom He is the Subduer. All acts (al-afʿāl) are merely the rulings (aḥkām) of His Names (Asmā’) in the cosmos (al-kawn). No one performs an act except Allah. All acts stem from the Name the Capable (al-Qādir) and the Subduer (al-Qāhir). Nothing is subdued by the Name the Subduer except the originator of that act in the cosmos, which is the effect (athar) of the Subduer. Thus, He subdued none but Himself. And He is the effect of the Name the Capable (al-Qādir). Thus, He subdued none but the Name the Capable, which shares with Him in the existence of the essence (al-ʿayn). The Subduer subdued the Capable only by the Name the Capable. The Capable Himself is subdued by the Name the Subduer, unless the subduing (al-qahr) is by prevention (al-manʿ) and not by creation (al-ījād). In that case, the subduing is attributed to the Name the Willing (al-Murīd). However, He prevents only by the Name the Subduer, subduing the essence (al-ʿayn) that was prepared to accept Existence (al-Wujūd), but the Will (al-mashī’a) subdued it and delayed it from Existence because the Will has the power of preference (at-tarjīḥ). By what I have presented to you concerning the reassurance (al-uns) in accepting this issue, you have sufficient knowledge regarding what the path of the People (ṭarīqat al-qawm) yields. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks The Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو اسی: منزلِ مَالِی (مالی) کی معرفت اور اس کے اسرار، جو مقامِ موسوی سے متعلق ہیں\n\nمیں نے کہا: میرا مال کیا ہے؟ تو اس نے فرمایا: تیرا مال اے میرے بندے!\nمیں نے کہا: میرا مال کیا ہے؟ تو اس نے فرمایا: تیرا مال میرے پاس ہے۔\n\nمیں نے کہا: جب تو نے اسے میرے لیے ملکیت کے طور پر منسوب کیا،\nتو پھر اسے \"میرے پاس\" کہنے کے ساتھ کیوں خاص کیا؟\n\nاس نے فرمایا: جب میں نے جان لیا کہ تو میرے پاس ہے،\nتو جو کچھ تیری ملکیت کے تحت تھا، وہ بھی میرے پاس ہے۔\n\nمیں نے کہا: اگر تیرا \"تو میرے پاس ہے\" ہونا ہی میری حقیقت ہے،\nتو تیرا یہ کہنا درست ہے کہ \"جو تیرے پاس ہے وہ میرے پاس ہے۔\"\n\nاور جیسا کہ تو نے کہا کہ \"جو تیرے پاس ہے وہ میرے پاس ہے،\"\nتو ہمیں بھی کہنا چاہیے کہ \"جو تیرے پاس ہے وہ میرے پاس ہے۔\"\n\nاور یہ زیادہ اولیٰ ہے، کیونکہ میری ذات ایک ظرف ہے،\nاور تو بلند و بالا ہے، لہٰذا \"پاس\" (العند) میرے پاس ہے۔\n\nیہ ایک بلند منزل (منزل) ہے، اس کے اور اس کے مقامِ وقوف کے درمیان کوئی مناسبت نہیں ہے، لہٰذا مناسبت واپس واقف کی طرف لوٹتی ہے، جیسا کہ اس منزل سے پہلے والی منزل میں تھا۔ اسی منزل سے حضرت یعقوب علیہ السلام نے اپنے بیٹوں سے فرمایا:\n**وَمَا أُغْنِي عَنْكُمْ مِنَ اللَّهِ مِنْ شَيْءٍ إِنِ الْحُكْمُ إِلَّا لِلَّهِ** (اور میں اللہ کے مقابلے میں تمہارے کسی کام نہیں آ سکتا۔ حکم صرف اللہ ہی کا ہے۔)\nاور یہ اسی منزل سے متعلق ہے۔\n\nحضرت محمد صلی اللہ علیہ وسلم نے فرمایا، جب آپ پر یہ آیت نازل ہوئی:\n**وَأَنْذِرْ عَشِيرَتَكَ الْأَقْرَبِينَ** (اور اپنے قریبی رشتہ داروں کو ڈراؤ۔)\nتو آپ صفا پہاڑی پر کھڑے ہوئے اور لوگ تیزی سے آپ کی طرف آنے لگے۔ آپ نے اپنے سب سے معزز شخص سے فرمایا: \"اے فاطمہ بنت محمد! اپنی جان کا خیال رکھو، میں اللہ کے مقابلے میں تمہارے کسی کام نہیں آ سکتا۔\" اور یہی بات آپ نے تمام قریبی رشتہ داروں سے کہی۔ آپ کا چچا ابو لہب بھی موجود تھا، اس نے اپنے ہاتھ میں پھونک ماری اور کہا: \"اس نے جو کچھ کہا، اس سے ہمارے ہاتھ کچھ نہیں آیا۔\" اور ابو لہب نے سچ کہا، کیونکہ اللہ نے اسے آپ کے ڈرانے سے کوئی فائدہ نہیں پہنچایا اور نہ ہی اس کے دل میں کوئی چیز داخل کی، کیونکہ اللہ نے اس کے لیے بدبختی (الشقاء) کا ارادہ کر رکھا تھا۔ چنانچہ اللہ نے اس کے بارے میں نازل فرمایا:\n**تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ * مَا أَغْنَى عَنْهُ مَالُهُ وَمَا كَسَبَ** (ابو لہب کے دونوں ہاتھ ٹوٹ جائیں اور وہ خود بھی ہلاک ہو جائے! اس کا مال اور جو کچھ اس نے کمایا، اس کے کچھ کام نہ آیا۔)\n\nکیونکہ وہ اپنے مال پر بھروسہ کرتا تھا۔ پس جو شخص اپنے معاملات میں اللہ کے سوا کسی اور پر بھروسہ کرتا ہے، وہ خسارہ اٹھاتا ہے۔ اور اسباب (الأسباب) کے قائلین جب ان پر بھروسہ کرتے ہیں اور اللہ پر اعتماد (الاعتماد) چھوڑ دیتے ہیں، تو وہ **الْأَخْسَرِينَ أَعْمَالًا** (اعمال کے لحاظ سے سب سے زیادہ خسارہ پانے والوں) میں شامل ہو جاتے ہیں۔ اور اگر وہ اسباب کو ثابت رکھیں اور اللہ پر اعتماد کریں اور ان اسباب کو ان کی اس منزل سے تجاوز نہ کرنے دیں جو اللہ نے ان کے لیے مقرر کی ہے، تو وہ اللہ کے بزرگ مردوں (رجال اللہ) میں سے ہیں، جنہیں **لَا تُلْهِيهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَنْ ذِكْرِ اللَّهِ** (تجارت اور خرید و فروخت اللہ کے ذکر سے غافل نہیں کرتی)۔ اور ذات حق (الحق) نے اس مقام پر ان کے لیے مردانگی (الرجولة) ثابت کر دی ہے۔ اور جس کے لیے ذات حق کسی امر کی گواہی دے دے، تو وہ اپنے دعوے میں حق پر ہے۔ اور جس نے اسباب کو ذات حق کے اثبات کے ساتھ ثابت کیا اور طبعی میلان کے طور پر ان پر بھروسہ کیا، لیکن اسباب کے فقدان پر اللہ پر اعتماد (الاعتماد) کے معاملے میں خود متزلزل ہو گیا، تو وہ متوسط درجے کے مردوں میں سے ہے۔ اور اگر نفس میں اضطراب واقع ہو جائے، لیکن اگر وہ فقدان کو محسوس کرے اور مزاج میں اضطراب پیدا ہو، تو یہ اکابر مردوں کی خصوصیات میں سے ہے۔ اور اگر مزاج میں اضطراب نہ ہو اور نہ ہی فقدان محسوس ہو، تو یہ اللہ پر اعتماد (الاعتماد) کی حالت ہے، اور یہ متوسطین (اصحاب الاحوال) کا مقام ہے۔ اور یہ اسی منزل سے متعلق ہے۔\n\nفتح مکہ کے موقع پر نبی صلی اللہ علیہ وسلم سے کہا گیا، جب ایک شخص جس کے قتل کا آپ نے ارادہ کیا تھا، آپ کے سامنے کھڑا ہوا، اور جب وہ اپنی حاجت پوری کر کے چلا گیا، تو نبی صلی اللہ علیہ وسلم نے فرمایا: \"جب وہ میرے سامنے کھڑا تھا تو تم نے اسے کیوں نہیں قتل کیا؟\" آپ کے صحابہ نے عرض کیا: \"آپ نے ہماری طرف آنکھ کے اشارے سے کیوں نہیں بتایا؟\" تو آپ صلی اللہ علیہ وسلم نے فرمایا: \"کسی نبی کے لیے یہ مناسب نہیں کہ اس کی آنکھ میں خیانت (خائنۃ عین) ہو۔\"\n\nاور یہ ایک ایسی حالت ہے جس سے کوئی محفوظ نہیں رہتا، اور اس سے محفوظ رہنے کی انتہا یہ ہے کہ جو شخص شر میں محفوظ رہا۔ لیکن خیر کے معاملے میں، لوگ بعض اوقات اسے ایک قابل تعریف راستہ بنا لیتے ہیں۔ چنانچہ کوئی بڑا شخص حاضر شخص کے حق میں اپنے کسی حکم ماننے والے کی طرف اشارہ کرتا ہے کہ وہ اس حاضر شخص کے لیے خلعت یا مال لے آئے جو اسے ہبہ کیا جائے گا، اور یہ آنکھ کا اشارہ ہوتا ہے، نہ کہ لفظی تصریح، اس شخص کے شعور کے بغیر جس کے حق میں یہ خیر کا اشارہ کیا جا رہا ہے۔ اور نبی سے ایسی چیز واقع نہیں ہوتی، اگرچہ وہ خیر ہی ہو۔ اس کی وجہ یہ ہے کہ نفس کو اس کی عادت نہ پڑ جائے، کیونکہ نفس اسے خیر میں استعمال کرنے کی وجہ سے شاید شر میں بھی استعمال کرنے لگے، کیونکہ نفس کی فطرت ہے کہ وہ عادت کا غلام بن جاتا ہے۔ اسے آنکھ کی خیانت (خائنۃ عین) اس لیے کہا گیا ہے کہ نفس کی بات کو ظاہر کرنا صفتِ کلام کا کام ہے، یہ صفتِ عین (آنکھ) کا کام نہیں ہے۔ اگرچہ آنکھ میں اشارے کے ذریعے نفس کی بات کو ظاہر کرنے کی قوت ہے، لیکن اس کا کام صرف دیکھنا ہے۔ اور جو صفتِ کلام اس کے پاس ہے، وہ کلام کے لیے اس کے ہاتھ میں ایک امانت ہے۔ پس جب وہ اس امانت میں اشارے اور ایما کے ذریعے کسی معاملے میں تصرف کرتی ہے جس کی طرف وہ اشارہ کر رہی ہے، تو اس نے کلام کی اس امانت میں خیانت کی جو اسے سونپی گئی تھی۔ اسی لیے اسے **خَائِنَةَ الْأَعْيُنِ** (آنکھوں کی خیانت) کہا گیا ہے۔ اور اسے خیانت سے موصوف کیا گیا ہے، اور خیانت امانت میں تصرف کا نام ہے۔ کیونکہ امانت تمہاری ملکیت نہیں ہوتی، اور تمہیں حکم دیا گیا ہے کہ اسے اس کے اہل تک پہنچاؤ۔ پس جب منزل (منزل) کسی شخص کے حق میں خیر یا شر کا تقاضا کرے، اور آنکھ میں یہ قوت ہو کہ وہ اس شخص کی طرف اشارہ کر کے اسے ظاہر کر دے، لیکن وہ جانتی ہے کہ یہ صفت کلام کی ہے، لہٰذا وہ ایسا نہیں کرتی اور اس امانت کو زبان کی طرف لوٹا دیتی ہے، اور زبان بولتی ہے، تو اس آنکھ نے امانت کو اس کے اہل تک پہنچا دیا اور اس میں خیانت نہیں کی۔ اللہ تعالیٰ فرماتا ہے:\n**يَعْلَمُ خَائِنَةَ الْأَعْيُنِ** (وہ آنکھوں کی خیانت کو جانتا ہے۔)\nیعنی وہ جانتا ہے کہ یہ خیانت ہے اور یہ کس طرح خیانت ہے۔ اور یہ نہیں فرمایا کہ وہ جانتا ہے کہ آنکھوں نے کس چیز کی طرف اشارہ کیا یا ایما کیا، کیونکہ جس کی طرف اشارہ کیا گیا ہے وہ اسے جانتا ہے، لہٰذا یہ تعریف نہیں ہو سکتی۔ لیکن ہر کوئی یہ نہیں جانتا کہ یہ خیانت ہے، سوائے اس کے جسے اللہ نے اس کی خبر دی ہو۔ اور اللہ نے ہمیں اس کی خبر دی ہے، لہٰذا ہم نے اسے جان لیا ہے۔ پس یہ خیر میں قابل تعریف خیانت ہے اور شر میں قابل مذمت خیانت ہے۔ اور یہ دونوں حالتوں میں خیانت ہونے سے نہیں ہٹی۔ اور جب ہم نے تمہارے لیے یہ معاملہ واضح کر دیا ہے، تو تم حاضرین کے ساتھ اسے کرنے سے حتی الامکان بچو، کیونکہ تم معصوم نہیں ہو۔ پس حضور (الحضور) کو استعمال کرو، شاید تم اس مقام کو حاصل کر لو۔\nاگر تم کہو کہ جس کے لیے کمال کی گواہی دی گئی اور جسے کلام سے منع کیا گیا، یعنی مریم، نے عیسیٰ کی طرف اشارہ کیا کہ وہ ان سے ان کے معاملے میں پوچھیں، تو ہم کہیں گے کہ انہوں نے کمال اس کے بعد حاصل کیا، نہ کہ اس وقت۔ کیا تم نہیں دیکھتے کہ زکریا علیہ السلام سے کہا گیا:\n**آيَتُكَ أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَةَ أَيَّامٍ إِلَّا رَمْزًا** (تمہاری نشانی یہ ہے کہ تم تین دن تک لوگوں سے اشارے کے سوا بات نہیں کر سکو گے۔)\nاور رمز (الرمز) وہ ہے جو اشارے سے واقع ہوتا ہے۔ کیونکہ اشارہ مطلوبہ امر میں صریح ہوتا ہے، بلکہ یہ ان مقامات پر نام لے کر پکارنے سے زیادہ قوی ہوتا ہے جہاں متکلم کو قرینہِ حال کی ضرورت ہوتی ہے۔ یہاں تک کہ اگر کوئی شخص دوسرے سے کہے کہ زید سے فلاں بات کہو، اور زید حاضر ہو، تو یہ احتمال ہے کہ سننے والا اس سے مراد کوئی دوسرا زید سمجھے، جبکہ متکلم کا ارادہ حاضر شخص کا تھا۔ پس جب وہ اس کا نام لینے سے گریز کرے اور ہاتھ یا آنکھ سے اس کی طرف اشارہ کرے اور کہے کہ \"اس سے بات کرو\" (اشارہ کرتے ہوئے)، تو یہ زیادہ واضح اور ابہام و انکار سے دور ہوتا ہے۔ اور حرف ایک مجمل لفظ ہے جو کئی امور کی طرف توجیہ کا احتمال رکھتا ہے، جیسا کہ شاعر نے آگ کی تعریف میں بغیر نام لیے رمز (الرمز) استعمال کیا، اور کہا:\n\nاور ایک اڑنے والی جو بغیر پروں کے اڑتی ہے،\nاور شام و صبح کھاتی ہے۔\n\nاور شاخوں میں چلتی ہے، اس کی چیخ ہوتی ہے،\nاور لڑائی کے وقت تلواروں میں لرزش پیدا کرتی ہے۔\n\nشیر اس سے میدانوں میں بھاگتے ہیں،\nاور یہ تلواروں اور نیزوں پر غالب آتی ہے۔\n\nاور کنواریوں کی رانوں کے درمیان بیٹھتی ہے،\nاور پردے کے نیچے چھپی ہوئی چیز کو ظاہر کرتی ہے۔\n\nجب وہ مر جاتی ہے تو اس کے والدین اسے زخمی کرتے ہیں،\nتو وہ زخموں کے پاس زندہ ہو جاتی ہے۔\n\nاس کی مراد والدین سے چقماق (الزناد) کی لکڑیاں ہیں۔ پس یہ آگ میں رمز (الرمز) ہے۔ اور دوسرے شاعر نے آنکھ کے بارے میں کہا اور خوب کہا:\n\nاور ایک اڑنے والی جو بغیر پروں کے اڑتی ہے،\nوہ اڑنے والوں سے سبقت لے جاتی ہے حالانکہ وہ اڑتی نہیں۔\n\nجب اسے پتھر چھوتا ہے تو وہ ٹھہر جاتی ہے،\nاور ریشم کے چھونے کو ناپسند کرتی ہے۔\n\nاس کی مراد پتھر سے سرمہ (الإثمد) ہے۔\n\n### [گمان (الظن) ذات حق (الحق) کے مقابلے میں کچھ کام نہیں آتا]\n\nاور جان لو کہ جس نے اپنے نفس میں کسی ایسے معبود کو قائم کیا جس کی وہ گمان (الظن) پر عبادت کرتا ہے نہ کہ یقین (القطع) پر، تو وہ گمان اسے دھوکہ دے گا اور اللہ کے مقابلے میں اس کے کچھ کام نہیں آئے گا۔ اللہ تعالیٰ فرماتا ہے:\n**إِنَّ الظَّنَّ لَا يُغْنِي مِنَ الْحَقِّ شَيْئًا** (بے شک گمان ذات حق (الحق) کے مقابلے میں کچھ کام نہیں آتا۔)\nاور ان کی عبادت کے بارے میں فرمایا:\n**إِنْ يَتَّبِعُونَ إِلَّا الظَّنَّ وَمَا تَهْوَى الْأَنْفُسُ** (وہ صرف گمان اور نفسانی خواہشات کی پیروی کرتے ہیں۔)\nپس ان کی طرف کبھی بھی یہ نسبت نہیں کی گئی کہ انہوں نے اللہ کے سوا کسی اور کی عبادت علم کی بنیاد پر کی ہو، بلکہ صرف گمان کے طریقے پر کی، کیونکہ وہ فی نفسہ علم نہیں ہے۔ یہاں سے تم جان سکتے ہو کہ علم نجات کا سبب ہے، اور اگرچہ وہ راستے میں بدبخت ہو جائے، لیکن انجام کار نجات کی طرف ہے۔ پس علم کا مرتبہ کتنا شرف والا ہے۔ اسی لیے اللہ نے اپنے نبی صلی اللہ علیہ وسلم کو کسی بھی چیز میں زیادتی طلب کرنے کا حکم نہیں دیا سوائے علم کے، چنانچہ آپ سے فرمایا:\n**وَقُلْ رَبِّ زِدْنِي عِلْمًا** (اور کہو: اے میرے رب! میرے علم میں اضافہ فرما۔)\nپس جس نے اس بات کو سمجھ لیا جس کی طرف ہم نے اشارہ کیا ہے، وہ اہل سعادت کو اہل شقاوت سے پہچان لے گا، اور اس پر وہ عارضی امور اثر انداز نہیں ہوں گے جو راستے میں بدبختی کا سبب بنتے ہیں۔ اگر مشرک جانتا کہ ذات حق (الحق) جلال کی کن صفات کا مستحق ہے، تو وہ جان لیتا کہ اس کے ساتھ شرک کرنا جائز نہیں ہے۔ اور اگر مشرک جانتا کہ جسے اس نے شریک بنایا ہے، وہ اللہ کی الوہیت میں شرکت کا مستحق نہیں ہے، تو وہ شرک نہ کرتا۔ پس اس نے دونوں طرف سے جہالت ہی کو اختیار کیا۔ اللہ تعالیٰ فرماتا ہے:\n**فَلَا تَكُونَنَّ مِنَ الْجَاهِلِينَ** (پس تم جاہلوں میں سے نہ ہو جانا۔)\nاور فرمایا:\n**إِنِّي أَعِظُكَ أَنْ تَكُونَ مِنَ الْجَاهِلِينَ** (میں تمہیں نصیحت کرتا ہوں کہ تم جاہلوں میں سے نہ ہو جاؤ۔)\nاگر مشرک صرف فعل میں شرکت پر اکتفا کرتا، نہ کہ الوہیت میں، تو معاملے میں گنجائش ہوتی، کیونکہ افعال کی نسبت مخلوق کی طرف کرنا ایک مشکل امر ہے، اور اس کا مرتکب معذور ہو سکتا ہے اگر وہ صاحبِ فعل ہو۔ لیکن جب انہوں نے افعال کی نسبت ایسے کی طرف کی جسے وہ جانتے ہیں کہ وہ فاعل نہیں ہے، تو انہوں نے جہالت کو اختیار کیا، اور اسی پر انہیں سرزنش کی گئی، چنانچہ ان سے کہا گیا:\n**أَتَعْبُدُونَ مَا تَنْحِتُونَ** (کیا تم ان چیزوں کی عبادت کرتے ہو جنہیں تم خود تراشتے ہو؟)\nاور صاحبِ فعل کے حق میں فرمایا:\n**وَأَضَلَّ فِرْعَوْنُ قَوْمَهُ وَمَا هَدَى** (اور فرعون نے اپنی قوم کو گمراہ کیا اور ہدایت نہ دی۔)\nپس گمراہی کی نسبت فرعون کی طرف کی گئی، نہ کہ اس کی قوم کی طرف، کیونکہ وہ ان کے نزدیک صاحبِ فعل تھا، اور فی نفسہ بھی ایسا ہی ہے۔ اور اس کا قول **وَمَا هَدَى** (اور ہدایت نہ دی) یعنی اس نے انہیں حق کا راستہ نہیں دکھایا، کیونکہ یہ ایک التباس کا مقام ہے، چونکہ وہ افعال کا مالک تھا۔ اگر معبود جماد ہوتا تو التباس واقع نہ ہوتا۔\nاگر کہا جائے کہ اگر انہوں نے کسی ایسے معبود کو اختیار کیا جس میں جماد یا نباتات میں سے خاصیت کے ذریعے فعل ہو، تو کیا وہ معذور ہوں گے؟ ہم کہیں گے: وہ معذور نہیں ہوں گے، کیونکہ اس کی خاصیت ہر چیز میں جاری نہیں ہوتی کہ اس کی طرف افعال کی نسبت کی جائے جیسا کہ اللہ کی طرف کی جاتی ہے۔ اور اسی قدر جہالت کی وجہ سے مخلوق کے پجاریوں نے، جو صاحبِ افعال تھے جیسے فرعون وغیرہ، انہیں اختیار کیا۔ کیونکہ اس کی جو قدرت ہے وہ اس کی عبادت کرنے والے کی قدرت سے زیادہ نہیں ہے، لہٰذا وہ تمام افعال میں جاری ہونے سے قاصر ہے۔ کیونکہ حادث قدرت جواہر اور اجسام کے اعیان (متحیزات) کو خلق نہیں کر سکتی۔ پس انہوں نے اس کی عبادت کی جس نے ان کے اعیان کو خلق نہیں کیا۔ اسی لیے اللہ نے انہیں اس قول سے سرزنش کی:\n**أَفَمَنْ يَخْلُقُ كَمَنْ لَا يَخْلُقُ أَفَلَا تَذَكَّرُونَ** (کیا جو پیدا کرتا ہے وہ اس جیسا ہے جو پیدا نہیں کرتا؟ کیا تم نصیحت حاصل نہیں کرتے؟)\nاگر کہا جائے کہ اگر کسی کو خرقِ عادت کے طور پر کسی جوہر کو خلق کرنے کی قدرت دی جائے، اور کوئی اس وجہ سے اس کی عبادت کرے، تو کیا وہ معذور ہوگا یا نہیں؟ ہم کہیں گے: وہ معذور نہیں ہوگا، کیونکہ وہ گواہی دیتا ہے کہ وہ حوادث کو قبول کرتا ہے اور ان سے خالی نہیں ہوتا۔ اور جو حوادث سے خالی نہ ہو، اس کے لیے مجموعی طور پر ان پر سبقت لے جانا محال ہے۔ اور جب وہ مجموعی طور پر حوادث پر سبقت نہیں لے جا سکتا، تو وہ ان کی طرح حادث ہے۔ اور الٰہ کی شان یہ ہے کہ وہ مجموعی طور پر ہر حادث ہونے والی چیز سے قدیم ہو۔ لہٰذا حادث کا اس سے مؤخر ہونا ضروری ہے، خواہ تاخیر کی نسبت کوئی بھی ہو۔ پس جب اس سے علم کی یہ مقدار فوت ہو گئی اور وہ اس سے جاہل رہا، تو وہ معذور نہیں ٹھہرا اور اسی وجہ سے پکڑا گیا۔ اور اس کی اصل صرف جہالت ہی تھی۔\nپس جس نے کسی موضوع معبود کا سہارا لیا، تو اس نے اپنے گمان (الظن) کی بنا پر سہارا لیا، نہ کہ اپنے علم کی بنا پر۔ اسی لیے وہ پکڑا گیا اور بدبخت ہوا، مگر یہ کہ وہ شریک کی نفی میں اپنی طرف سے پوری کوشش (المجہود) صرف کرے، لیکن اس کی فکر، اس کی نظر اور اس کی کوشش نے اسے مکمل طور پر نفی نہ کیا ہو، اور نہ ہی اس کی طرف کوئی رسول بھیجا گیا ہو اور نہ ہی اس تک اس کی دعوت پہنچی ہو۔ اہل نظر کی ایک جماعت نے کہا ہے کہ ایسا شخص معذور ہے، اور وہ فی نفسہ ماجور ہے، اگرچہ وہ خطا کار ہے۔ اور وہ گمان (الظن) والا نہیں ہے، بلکہ وہ یقین (القطع) والا ہے، عالم نہیں ہے۔ اور کسی چیز پر یقین کرنا ضروری نہیں کہ وہ علم کی بنا پر ہو۔\nاور شاید کوئی شخص اللہ تعالیٰ کے اس قول سے تسلی حاصل کرے:\n**وَمَنْ يَدْعُ مَعَ اللَّهِ إِلَهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ** (اور جو شخص اللہ کے ساتھ کسی دوسرے معبود کو پکارتا ہے جس کے لیے اس کے پاس کوئی دلیل (برہان) نہیں ہے۔)\nکہ اللہ اسے معاف کر دے گا۔ اور اس میں کوئی شک نہیں کہ وہ مجتہد جس نے اصول میں اجتہاد میں خطا کی، وہ یقین رکھتا ہے کہ جو کچھ اس کی نظر نے اسے پہنچایا ہے وہ برہان پر مبنی ہے، اگرچہ وہ فی نفسہ برہان نہ ہو۔ پس اللہ تعالیٰ اسے اس کے اجتہاد کی بنا پر اس یقین کی وجہ سے معاف کر سکتا ہے، جیسا کہ صحابی نے یقین کیا کہ اس نے دحیہ کلبی کو دیکھا، حالانکہ وہ جبرائیل تھے (یہ قاطع علی غیر علم تھا)۔ پس یہ یقین کرنے والا غیر عالم تھا، اس نے اجتہاد کیا اور خطا کی، کیونکہ وہ اس تقسیم کو یاد نہیں رکھ سکا جو اس میں کمی تھی۔ اگر وہ کہتا کہ اگر یہ مجسم روح نہیں ہے، تو بلا شبہ یہ دحیہ ہے۔ پس جو کچھ ہم نے اس طرح کے معاملے میں مقرر کیا ہے، اس پر غور کرو۔\n\nکیونکہ نبی صلی اللہ علیہ وسلم مجتہد کے بارے میں فرماتے ہیں: \"جب مجتہد اجتہاد کرے اور درست پائے تو اس کے لیے دو اجر ہیں، اور اگر خطا کرے تو ایک اجر ہے۔\"\nاور آپ نے اصول اور فروع میں اجتہاد کے درمیان کوئی فرق نہیں کیا۔ اور اللہ تعالیٰ نے فرمایا:\n**وَمَا كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا** (اور ہم عذاب دینے والے نہیں ہیں جب تک کہ رسول نہ بھیج دیں۔)\nاور اس باب سے ان گروہوں کا تعلق ہے جن پر اکثر علماء نے عذاب واجب قرار دیا ہے اور ان پر بدبختی کا حکم لگایا ہے بغیر کسی واضح دلیل کے جو علم کا فائدہ دے۔ پس انہوں نے انہیں بدبختوں کی منزلوں میں اتار دیا گمان (الظن) اور یقین (القطع) کی بنا پر جو فی نفسہ علم نہیں تھا۔ پس الٰہ کا وجود محض گمان پر نہیں ہو سکتا۔ لہٰذا جو کچھ ہم نے ذکر کیا ہے اس سے ثابت ہوا کہ جس نے گمان کیا، وہ الٰہ کے معاملے میں عذاب سے نہیں بچے گا۔\nاگر کہا جائے کہ اللہ فرماتا ہے: \"میں اپنے بندے کے گمان کے پاس ہوں جو وہ مجھ سے رکھتا ہے۔\"\nتو ہم کہیں گے کہ یہ ہمارا مسلک ہے، کیونکہ اس نے \"مجھ سے\" کہا ہے۔ پس اس نے اللہ کو ثابت کیا ہے۔ اور یہ نہیں کہا کہ میں اس بندے کے گمان کے پاس ہوں جسے اس نے الٰہ بنایا ہے۔ پس گمان کا تعلق اس کے نزدیک اللہ سے تھا، اس سعادت یا شقاوت کے بارے میں جو وہ گمان کرتا ہے۔ کیونکہ وہ اللہ کو جاننے والا ہے، اور گناہ پر مؤاخذہ یا معافی کے بارے میں گمان (الظن) رکھتا ہے۔ اور جب یہ بات طے ہو گئی، تو...\n\n### [بے شک جنت دو ہیں: ایک حسی جنت اور ایک معنوی جنت، جیسا کہ آگ بھی دو ہیں]\n\nتو جان لو کہ جنت دو ہیں: ایک حسی جنت اور ایک معنوی جنت۔ حسی جنت سے ارواح حیوانیہ اور نفوس ناطقہ (عقل رکھنے والے نفوس) نعمت حاصل کرتے ہیں۔ اور معنوی جنت سے صرف نفوس ناطقہ ہی نعمت حاصل کرتے ہیں، اور وہ علوم اور معارف (المعرفة) کی جنت ہے، اس کے سوا کوئی اور نہیں۔\nاور آگ بھی دو ہیں: ایک محسوس آگ اور ایک معنوی آگ۔ محسوس آگ سے نفوس حیوانیہ اور نفوس ناطقہ عذاب پاتے ہیں۔ اور معنوی آگ سے صرف نفوس ناطقہ ہی عذاب پاتے ہیں۔\nدونوں نعمتوں اور دونوں عذابوں میں فرق یہ ہے کہ حسی عذاب اور حسی نعمت براہ راست ملامست (مباشرۃ) سے ہوتی ہے، جس کے ملامست سے روح حیوانی میں درد پیدا ہوتا ہے۔ اور معنوی عذاب نفوس ناطقہ کے لیے براہ راست ملامست سے نہیں ہوتا، بلکہ یہ اس علم کی وجہ سے ہوتا ہے جو انہیں اپنے فوت شدہ عمل کے بارے میں حاصل ہوتا ہے، اور وہ علم جو روح حیوانی کی سعادت کی طرف لے جاتا ہے، جس میں نفس ناطقہ کی سعادت بھی شامل ہے۔\nاور جہاں تک فکر کی آگ کا تعلق ہے، جس کا درد حس اور نفس سے متعلق ہوتا ہے، تو وہ معنوی آگ ہے۔ اگر اس سے علم حاصل ہو جائے تو اس کے بعد معنوی جنت کی نعمت ملتی ہے۔ اور اگر اس سے علم حاصل نہ ہو، تو جب تک وہ شخص فکر میں رہتا ہے، عذاب میں رہتا ہے، اور اس کے لیے کوئی معنوی نعمت نہیں ہوتی۔ اور اگر فکر اس سے کسی بھی طرح زائل ہو جائے، بغیر علم حاصل کیے، تو وہ نعمت جو نفس محسوس کرتا ہے، وہ صرف اس تفکر کی آگ کے فقدان سے راحت ہے جو اس کے دل پر مسلط تھی، پس یہ راحت حسی ہے نہ کہ معنوی۔ یہ جان لو۔\n\n### [آگ کا طبعی طور پر جلانا]\n\nاور جان لو کہ یہ منزل (منزل) اس علم کو شامل ہے کہ غیر حیوانی چیزیں بھی اللہ تعالیٰ کے حکم کو عام حسی ادراک کے ذریعے عقل کرتی ہیں، جیسے کہ اس کا یہ قول:\n**إِنَّا عَرَضْنَا الْأَمَانَةَ عَلَى السَّمَاوَاتِ وَالْأَرْضِ وَالْجِبَالِ فَأَبَيْنَ أَنْ يَحْمِلْنَهَا** (بے شک ہم نے امانت کو آسمانوں، زمین اور پہاڑوں پر پیش کیا تو انہوں نے اسے اٹھانے سے انکار کر دیا۔)\nاور اس کا یہ قول:\n**فَقَالَ لَهَا وَلِلْأَرْضِ ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ** (پھر اس نے آسمان اور زمین سے کہا: خوشی سے آؤ یا ناخوشی سے۔ دونوں نے کہا: ہم خوشی سے حاضر ہیں۔)\nپس اللہ نے ان دونوں کو عقل رکھنے والوں کی طرح جمع کیا اور ان کے لیے وہی ثابت کیا جو زندہ، عالم، سننے والے اور قادر کے لیے ثابت کیا جاتا ہے۔\nاور اس کا یہ قول:\n**عَلَيْهِمْ نَارٌ مُؤْصَدَةٌ** (ان پر آگ بند کر دی جائے گی۔)\nپس اس نے خبر دی کہ وہ مسلط کی گئی ہے، اور تسلط کو صرف وہی قبول کرتا ہے جو عقل رکھتا ہو۔ اور یہ کہ آگ طبعی طور پر جلانے والی (مُحْرِقَةٌ بِالطَّبْع) ہے۔ کیونکہ اگر وہ طبعی طور پر جلانے والی نہ ہوتی تو کفار پر بھیجے جانے کو قبول نہ کرتی۔ اگر اس میں جلانا طبعی نہ ہوتا تو اس سے مخالفت کا تصور نہ ہوتا، کیونکہ مخالفت تو جلنا ہے، اور یہ ایک دوسرا امر ہے جس کا وجود کسی موجد کے ایجاد کا محتاج ہے۔ اور ذات حق (الحق) نے صرف آگ کو مخاطب کیا ہے۔ اور جلانا ایک عرض (Accident) ہے، اور عرض اپنے وجود کے لیے آگ کے عین کے علاوہ کسی اور چیز کا محتاج ہے۔ کیونکہ اگر وہ آگ میں موجود ہو، تو وہ اس جسم کی طرف منتقل نہیں ہو سکتا جس پر آگ مسلط کی گئی ہے، کیونکہ عرض منتقل نہیں ہوتا۔ اگر وہ منتقل ہو جائے تو وہ محل سے خالی ہو جائے گا اور خود قائم ہو جائے گا، حالانکہ عرض خود قائم نہیں ہوتا۔ پس آگ کے ذریعے جلنے والے جسم کا جلانا محال ہو جائے گا، اور آگ کو جلانے کا خطاب دینا عبث ہو جائے گا۔ حالانکہ آگ کو تسلط کا خطاب دیا گیا ہے، تو یہ کس پر واقع ہوا؟ پس یہ باطل ہے کہ ذات حق (الحق) عبث بات کرے۔ تو یہ خطاب کیسے صادر ہوا اور کس پر واقع ہوا، اگر آگ کا جلانا طبعی نہ ہو؟\nاور اسی طرح ہر جماد، نباتات اور حیوان جسے مخاطب کیا گیا ہے، ضروری ہے کہ وہ زندہ، عاقل ہو، اور اس بات کو قبول کرنے والا ہو جس سے اسے مخاطب کیا گیا ہے، اور اس کی شان یہ ہو کہ وہ اس حکم کو عقل کرے کہ \"یہ کرو\"، اور یہ قبولیت ذاتی ہو جو اس کے عین کے وجود کے تابع ہو۔\nپس میں نے تمہیں ادراک کی اس قسم پر متنبہ کیا ہے جو اس منزل (منزل) میں شامل ہے۔\nاور جان لو کہ اس منزل میں شامل تمام علوم تک رسائی صرف انبیاء کی روحانیت کے واسطے سے الٰہی تعریف (التعریف الإلهي) کے ذریعے ہی اس مکاشف (الکشف) کو حاصل ہو سکتی ہے۔ اور وہ ارواح اپنی گہرائی اور نزاکت کی وجہ سے اللہ کی طرف سے صرف واسطوں کے ذریعے ہی جانی جاتی ہیں۔\nان علوم میں سے ایک یہ ہے کہ مکسور (ٹوٹی ہوئی چیز) کو لامتناہی طور پر توڑنے کا علم۔ اور عقل کے ذریعے معلوم ہے کہ مکسور محدود ہوتا ہے، پس وہ بذات خود متناہی ہے۔ تو وہ لامتناہی طور پر ٹوٹنے کو کیسے قبول کر سکتا ہے؟ یہ مسئلہ اس مسئلے سے مشابہت رکھتا ہے کہ حکماء کے نزدیک جسم کی تقسیم عقلی طور پر لامتناہی ہوتی ہے، نہ کہ حسی طور پر، تاکہ جوہر فرد (الجوهر الفرد) کے اثبات کو باطل کیا جا سکے، جس پر متکلمین کے مذہب میں جسم کی تقسیم ختم ہو جاتی ہے۔ پس اس منزل (منزل) سے تم ان دونوں گروہوں میں سے ہر ایک کے نزدیک ذات حق (الحق) کو پہچانتے ہو۔\nاور تم اس منزل سے عذاب کے قیام اور اسے معذبوں کے اجسام کے علاوہ میں اٹھانے کے علم پر مطلع ہوتے ہو، اور اس کے ساتھ معذبوں کا عذاب پانا، حالانکہ وہ ان میں قائم نہیں ہے۔ اور یہ سب سے مشکل مسائل میں سے ہے کہ کوئی معنی (صفت) اپنا حکم اس کے علاوہ پر کیسے واجب کر سکتا ہے جس میں وہ قائم ہو۔\nیہ مسئلہ بھی اس مسئلے سے مشابہت رکھتا ہے جو یہ کہتے ہیں کہ جب اللہ کسی امر کو نافذ کرنا چاہتا ہے تو وہ ایک ارادہ (إرادة) کو بغیر کسی محل کے خلق کرتا ہے، پھر اس ارادے کے ذریعے اس امر کو نافذ کرتا ہے۔ پس اس نے اس معنی (صفت) کا حکم اس پر واجب کر دیا جس میں وہ قائم نہیں تھا، صفات کو اعیان ماننے والوں کے نزدیک جن کے احکام ہوتے ہیں اور وہ متکلمین ہیں۔\nاور اس مسئلے اور ہمارے مسئلے میں فرق یہ ہے کہ عذاب اجسام میں اٹھایا جاتا ہے، اور اس کا حکم دوسرے اجسام میں ہوتا ہے جو ان اجسام کے علاوہ ہیں جن میں عذاب قائم ہے۔ اور ان اجسام میں اٹھایا گیا عذاب ان کو عذاب نہیں دیتا، حالانکہ وہ ان میں قائم ہے اور وہ اس سے متصف ہیں اس لحاظ سے کہ وہ اس کا محل ہیں، نہ کہ اس لحاظ سے کہ وہ اس سے عذاب پانے والے ہیں۔\nاور دونوں مسائل کے درمیان جامع وجہ یہ ہے کہ اس معنی (صفت) کا حکم اس محل کے علاوہ میں موجود ہوتا ہے جس میں وہ معنی قائم ہوا ہے۔\nاور کیا علم بھی اس باب میں اور دیگر صفات میں ارادے کی طرح ہے یا نہیں؟ کہ علم زید میں قائم ہو اور زید اس سے نہ جانے، اور عمر اس سے جان لے؟ یہ عقلی طور پر محال ہے، لیکن یہ منزل (منزل) اس کے وقوع کا حکم دیتی ہے۔\nاگر تم نفس کو اس مسئلے میں اس منزل کے عطا کردہ کو قبول کرنے کے لیے مانوس کرنا چاہتے ہو، تو اس بات پر غور کرو جس پر تم اپنے ساتھیوں کے ساتھ متفق ہو کہ ذات حق (الحق) اجسام میں حلول کرنے سے پاک ہے۔ کیونکہ انسان اپنی آنکھ کے عضو میں قائم اپنی بصارت سے دیکھتا ہے، اور اپنے کان کے عضو میں قائم اپنی سماعت سے سنتا ہے، اور اپنی زبان کی حرکت و سکون، اپنے ہونٹوں اور اپنے سینے سے ہونٹوں تک حروف کے مخارج میں موجود کلام سے بات کرتا ہے۔ پھر یہ شخص اللہ تعالیٰ کی اطاعت میں فرائض سے زائد نوافلِ خیرات کا عمل کرتا ہے، تو یہ عمل اس کے لیے اس کی سماعت، بصارت، کلام اور اس کے تمام معانی جیسے پکڑنا (بطش) اور چلنا (سعی) کی نفی کا نتیجہ دیتا ہے، جو اس کے لیے ان کے احکام کو واجب کرتے تھے، چنانچہ وہ ان احکام کی بنا پر سمیع، بصیر، متکلم وغیرہ کہلاتا تھا۔ پس وہ اپنی سماعت سے سننے کے بعد اللہ سے سننے لگا، اور اپنی بصارت سے دیکھنے کے بعد اللہ سے دیکھنے لگا، اس علم کے ساتھ کہ اللہ اس سے پاک ہے کہ چیزیں اس کا محل ہوں یا وہ ان کا محل ہو۔ پس بندے نے اس سے سنا جو اس میں قائم نہیں تھا، اور اس سے دیکھا جو اس میں قائم نہیں تھا، اور اس سے بات کی جو اس میں قائم نہیں تھا۔ پس ذات حق (الحق) اس کی سماعت، بصارت اور ہاتھ بن گیا۔\nپس اسی طرح عذاب کا ان محال میں وجود ہے جن میں وہ صفت قائم نہیں ہوئی جس کا حکم عذاب ہے، جیسا کہ یہ ثابت ہو چکا ہے کہ صفت محل میں اپنے حکم کے خلاف حکم دیتی ہے، اور تم اس کے قائل ہو۔ اور ان دونوں مسائل میں کوئی فرق نہیں ہے۔ اور صاحبِ محاسن المجالس نے اس بارے میں شعر کہا ہے:\n\nکیا تم نے کسی عاشق کے بارے میں سنا ہے؟\nجس کی آنکھ تو سلامت ہو مگر وہ بیمار ہو؟\n\nجو عذاب سے نعمت پائے،\nاور نعمت سے عذاب پائے؟\n\nاور ابو یزید الاکبر طیفور بن عیسیٰ البسطامی نے اپنے رب عزوجل کو مخاطب کرتے ہوئے شعر کہا:\n\nمیں تیرا ارادہ کرتا ہوں، ثواب کے لیے تیرا ارادہ نہیں کرتا،\nبلکہ میں تیرا ارادہ عذاب کے لیے کرتا ہوں۔\n\nاور اے میرے رب! میں نے ان سب سے جو کچھ پایا،\nوہ میرے عذاب میں لذت بخش وجد کے سوا کچھ نہیں۔\n\nپس اس نے عذاب میں لذت طلب کی، اور یہ عقل میں حقائق کے برعکس ہے۔ لیکن اہل کشف (الکشف) اور ذوق نے ایسی چیزیں پائی ہیں جنہیں عقل محال قرار دیتی ہے۔ اگرچہ ہم جانتے ہیں کہ ان دونوں شاعروں نے اپنے اشعار میں کیا کہا ہے اور کس کو مخاطب کیا ہے، لیکن ہم نے اسے اس لیے پیش کیا تاکہ مرید کو تسلی ہو اور وہ اس بات کا یقین کر لے کہ **أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ** (بے شک اللہ ہر چیز پر قادر ہے) اور یہ کہ اس کی قدرت محال کو بھی وجود میں لانے پر مطلق ہے، اگر وہ اس کے وجود کا ارادہ کرے۔ جیسا کہ اس نے اپنی کتاب میں اپنے بارے میں اس چیز کا ذکر کیا جو عقل میں محال ہے، اس دلیل کے ساتھ جو عقل دیتی ہے، چنانچہ فرمایا:\n**لَوْ أَرَادَ اللَّهُ أَنْ يَتَّخِذَ وَلَدًا لَاصْطَفَى مِمَّا يَخْلُقُ مَا يَشَاءُ سُبْحَانَهُ هُوَ اللَّهُ الْوَاحِدُ الْقَهَّارُ** (اگر اللہ ارادہ کرتا کہ وہ کوئی اولاد بنائے تو وہ اپنی مخلوق میں سے جسے چاہتا چن لیتا۔ وہ پاک ہے، وہی اللہ ہے، اکیلا، زبردست (القہار)۔)\nپس اللہ نے اسے مشیتِ الٰہیہ کے لحاظ سے امکان کے درجے میں شامل کر دیا۔ حالانکہ عقل نے اس بات پر دلیل دی ہے کہ یہ محال ہے، نہ کہ اس وجہ سے کہ اللہ نے اس کا ارادہ نہیں کیا۔ پس اس آیت کا پہلا حصہ ایک ایسا زخم تھا جو عقل کی دلیل کی صحت پر لگایا گیا تاکہ اسے باطل کر دے، پھر اس زخم کا علاج آیت کے آخر میں اس کے قول **سُبْحَانَهُ** (وہ پاک ہے) سے کیا، یعنی وہ اس سے منزہ ہے کہ اس کی احدیت کا کوئی ثانی ہو۔\nعلاوہ ازیں، اس کے قول **الْقَهَّارُ** (زبردست) میں ایسے اسرار ہیں جن پر غور کرنے والا جانتا ہے کہ قہار کس کے لیے ہوتا ہے۔ اور تمام افعال درحقیقت کائنات میں اس کے اسماء کے احکام ہیں۔ پس اللہ کے سوا کسی کا کوئی فعل نہیں ہے۔ تمام افعال اسم القادر اور القاہر سے ہیں۔ پس اسم القاہر سے قہر نہیں کیا جاتا مگر اس فعل کے موجد کو جو کائنات میں ہے، اور وہ قاہر کا اثر ہے۔ پس اس نے قہر نہیں کیا مگر اپنے آپ کو، اور وہ اسم القادر کا اثر ہے۔ پس قاہر نے قادر کو قہر نہیں کیا مگر اسم القادر کے ذریعے، کیونکہ وہ عین کے وجود میں اس کا شریک ہے۔ پس قادر نے خود کو اسم القاہر کے ذریعے قہر کیا۔\nمگر یہ کہ قہر ایجاد کے ذریعے نہ ہو بلکہ منع کے ذریعے ہو، تو اس صورت میں قہر کی نسبت اسم المرید (ارادہ کرنے والا) کی طرف کی جائے گی۔ لیکن منع بھی اسم القاہر کے ذریعے ہی ہوتا ہے، اس عین کے لیے جو وجود کو قبول کرنے کے لیے تیار تھی، تو مشیت نے اسے قہر کیا اور وجود سے مؤخر کر دیا، کیونکہ مشیت کو ترجیح حاصل ہے۔\nپس جو کچھ میں نے اس مسئلے کو قبول کرنے میں تمہاری تسلی کے لیے پیش کیا ہے، وہ طریقہِ قوم کے عطا کردہ کے لیے کافی ہے۔\n**وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔)",
    "fa": "باب دویست و هشتادم در معرفت منزل «مالی» و اسرار آن از مقام موسوی\n\nگفتم: «مال من چیست؟» فرمود: «ای بنده من، مال تو.»\nگفتم: «مال من چیست؟» فرمود: «مال تو نزد من است.»\n\nگفتم: «چون آن را به عنوان ملک به من نسبت دادی، چرا آن را با گفتن \"نزد من\" اختصاص دادی؟»\n\nفرمود: «چون دانستم که تو نزد من هستی، آنچه تحت ملک تو بود، نزد من بود.»\n\nگفتم: «اگر عینِ \"تو\" بودن، \"من\" بودن باشد، آنچه گفتی که \"نزد تو، نزد من است\" صحیح است.»\n\nو همان‌گونه که گفتی «نزد تو، نزد من است»، پس ما نیز بگوییم «نزد تو، نزد من است.»\n\nو این اولی‌تر است، زیرا ذات من ظرف است، و تو متعالی هستی، پس «نزد» نزد من است.\n\nاین منزل (منزل) والایی است که میان آن و موضع ایستادن (موقفه) مناسبتی نیست، پس مناسبت به ایستنده (الواقف) بازمی‌گردد، همان‌گونه که در منزل پیشین از این منزل بود. یعقوب (علیه السلام) به فرزندانش گفت: «وَمَا أُغْنِي عَنكُم مِّنَ اللَّهِ مِن شَيْءٍ ۖ إِنِ الْحُكْمُ إِلَّا لِلَّهِ» (و من در برابر خدا هیچ چیز را از شما دفع نمی‌کنم؛ حکم تنها از آنِ خداست). و از همین منزل است که محمد (صلی الله علیه و سلم) هنگامی که آیه «وَأَنذِرْ عَشِيرَتَكَ الْأَقْرَبِينَ» (و خویشاوندان نزدیکت را بیم ده) بر او نازل شد، بر کوه صفا ایستاد و مردم شتابان به سوی او آمدند. او به گرامی‌ترین فرد نزد خود، فاطمه دختر محمد، فرمود: «به فکر خودت باش، من در برابر خدا هیچ چیز را از تو دفع نمی‌کنم.» و همین سخن را به همه نزدیکانش گفت. عمویش ابولهب حاضر بود، پس در دست خود دمید و گفت: «آنچه او گفت، چیزی به دست ما نرساند.» و ابولهب راست گفت، زیرا خداوند او را با انذار پیامبر سود نبخشید و چیزی از آن را در قلبش وارد نکرد، به دلیل شقاوتی که برای او اراده کرده بود. پس خداوند درباره او نازل فرمود: «تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ * مَا أَغْنَىٰ عَنْهُ مَالُهُ وَمَا كَسَبَ» (بریده باد دست‌های ابولهب و نابود باد! * مال او و آنچه کسب کرد، به حالش سودی نبخشید).\n\nاو (ابولهب) بر مال خود تکیه کرده بود. پس هر کس در امور خود بر غیر خدا تکیه کند، زیان می‌بیند. و کسانی که به اسباب (الأسباب) قائل‌اند، اگر بر آن‌ها تکیه کنند و اعتماد بر حق (الحق) را ترک نمایند، به «الْأَخْسَرِينَ أَعْمَالًا» (زیانکارترین مردم در عمل) ملحق می‌شوند. اما اگر اسباب را اثبات کنند و بر خدا اعتماد نمایند و از منزلتی که خداوند برای آن‌ها قرار داده است تجاوز نکنند، آنان بزرگان (الأکابر) از مردان خدا هستند که «لَا تُلْهِيهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَن ذِكْرِ اللَّهِ» (تجارت و خرید و فروش آنان را از یاد خدا غافل نمی‌سازد). و حق (الحق) در این موطن، رجولیت (مردانگی) را برای آنان اثبات کرده است. و هر کس که حق (الحق) برای او امری را شهادت دهد، در ادعای خود بر حق است. و کسی که اسباب را با اثبات حق (الحق) ثابت کند و به آن‌ها از روی طبع تکیه کند و هنگام فقدان آن‌ها در نفسِ اعتماد بر خدا مضطرب شود، او از مردان متوسط است. و اگر اضطراب در نفس رخ دهد، اما اگر فقدان را احساس کند و مزاجش مضطرب شود، این از ویژگی‌های مردان بزرگ است. و اگر مزاج مضطرب نشود و فقدان را احساس نکند، این حال اعتماد بر خداست و مقام متوسطین و صاحبان احوال است. و از همین منزل است.\n\nدر فتح مکه، هنگامی که مردی که پیامبر (صلی الله علیه و سلم) قصد کشتن او را داشت، در برابرش ایستاد، پس از آنکه کارش را انجام داد و رفت، پیامبر (صلی الله علیه و سلم) فرمود: «چرا هنگامی که در برابر من ایستاد، او را نکشتید؟» اصحابش گفتند: «چرا با گوشه چشمت به ما اشاره نکردی؟» پیامبر (صلی الله علیه و سلم) فرمود: «شایسته نیست که پیامبری خیانت چشم (خائنة عين) داشته باشد.»\n\nاین حالتی است که کسی از آن سالم نمی‌ماند، و نهایت امر این است که کسی در شر از آن سالم بماند. اما در خیر، گاهی آن را راهی پسندیده قرار می‌دهند. مثلاً، بزرگ در حق حاضری با چشم به کسی که امر او را اطاعت می‌کند اشاره می‌کند که خلعت یا مالی برای هدیه به آن حاضر بیاورد. این اشاره با چشم است نه تصریح با لفظ، بدون آنکه کسی که به نفع او اشاره می‌شود، آگاه باشد. و چنین چیزی، حتی اگر خیر باشد، از پیامبر رخ نمی‌دهد. و دلیل آن این است که نفس به آن عادت نکند، زیرا ممکن است آن را در شر به کار برد، به دلیل همراهی آن در خیر؛ چرا که عادت، طبیعت نفس را به بردگی می‌کشد. و این عمل «خیانت چشم» نامیده شد، زیرا آشکار کردن آنچه در نفس است، صفت کلام است نه صفت چشم. اگرچه چشم توانایی آشکار کردن آنچه در نفس است را با اشاره دارد، اما کار اصلی آن نگریستن است. و آنچه نزد چشم از صفت کلام است، امانتی است در دست آن برای کلام. پس اگر در آن امانت با ایما و اشاره به کسی که به او اشاره می‌کند، تصرف کند، در آنچه کلام او را بر آن امین دانسته، خیانت کرده است. به همین دلیل «خائنة الأعين» (خیانت چشم‌ها) نامیده شد. و به خیانت وصف شده است، و خیانت تصرف در امانت است، زیرا امانت ملک تو نیست و تو مأمور به ادای آن به اهلش هستی. پس اگر منزل (منزل) امری را در حق شخصی، چه خیر و چه شر، اقتضا کند و چشم توانایی آشکار کردن آن را برای کسی که به او اشاره می‌کند داشته باشد، اما بداند که این صفت کلام است و آن را انجام ندهد و آن امانت را به زبان بازگرداند و زبان سخن بگوید، این چشم امانت را به اهلش ادا کرده و در آن خیانت نکرده است. خداوند متعال می‌فرماید: «يَعْلَمُ خَائِنَةَ الْأَعْيُنِ» (خیانت چشم‌ها را می‌داند). یعنی می‌داند که آن خیانت است و چگونه خیانت است. و نگفت: «می‌داند که چشم‌ها به چه چیزی اشاره یا ایما کرده‌اند»، زیرا کسی که به او اشاره شده، آن را می‌داند و این مدح نخواهد بود. اما همه نمی‌دانند که آن خیانت است، مگر کسی که خدا او را آگاه سازد. و ما را به آن آگاه ساخته است، پس آن را دانستیم. بنابراین، در خیر، خیانتی پسندیده و در شر، خیانتی نکوهیده است. و در هر دو حال، از خیانت بودن خارج نشده است. پس از آنکه این امر را برای تو بیان کردیم، تا جایی که می‌توانی از انجام آن در حضور دیگران خودداری کن، زیرا تو معصوم نیستی. پس حضور را به کار گیر، شاید به این مقام دست یابی. اگر بگویی: «مریم که کمال برای او شهادت داده شده بود، اشاره کرد و از سخن گفتن منع شد، تا عیسی را از حال خود بپرسند»، می‌گوییم: «او پس از آن به کمال رسید، نه در آن زمان.» آیا نمی‌بینی که به زکریا گفته شد: «آيَتُكَ أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَةَ أَيَّامٍ إِلَّا رَمْزًا» (نشانه تو این است که سه شبانه‌روز با مردم سخن نگویی، مگر با اشاره). و رمز (رمز) همان است که با اشاره رخ می‌دهد، زیرا اشاره در امر مطلوب صریح است، بلکه در شناساندن قوی‌تر از تلفظ به اسم مشارٌالیه است، در مواطنی که متکلم در آن به قرینه حال نیاز دارد. حتی اگر شخصی به دیگری بگوید: «با زید درباره فلان چیز صحبت کن»، و زید حاضر باشد، این احتمال وجود دارد که شنونده، زید دیگری را غیر از این شخص بفهمد، در حالی که متکلم زید حاضر را اراده کرده است. اما اگر تلفظ به اسم او را ترک کند و با دست یا چشم به او اشاره کند و بگوید: «با این شخص صحبت کن»، در حالی که به او اشاره می‌کند، این فصیح‌تر و دورتر از ابهام و ناشناختگی است. و حرف، لفظی مجمل است که احتمال توجیه به امور مختلف را دارد، مانند رمزی که شاعر در شناساندن آتش بدون نام بردن آن به کار برده است:\n\nو پرنده‌ای که بدون بال پرواز می‌کند *** و شب و صبح می‌خورد\nو در شاخه‌ها راه می‌رود و صدایی دارد *** و هنگام نبرد، شمشیر را می‌لرزاند\nشیرها در بیابان‌ها از آن می‌گریزند *** و بر شمشیرها و نیزه‌ها غالب می‌شود\nو میان ران‌های دوشیزگان می‌نشیند *** و آنچه زیر روبنده پنهان است، آشکار می‌کند\nاگر بمیرد، والدینش او را زخمی می‌کنند *** و هنگام زخم‌ها دوباره زنده می‌شود\n\nمراد او از والدین، سنگ آتش‌زنه (الزناد) است. این همان رمز (رمز) در مورد آتش است. و دیگری درباره چشم نیکو سروده است:\n\nو پرنده‌ای که بدون بال پرواز می‌کند *** بر پرندگان برتری دارد، در حالی که پرواز نمی‌کند\nاگر سنگ به آن برسد، آرام می‌گیرد *** و از تماس ابریشم با خود بیزار است\n\nمراد او از سنگ، سرمه (الإثمد) است.\n\n### [گمان (الظن) از حق (الحق) چیزی را بی‌نیاز نمی‌کند]\n\nبدان که هر کس در نفس خود معبودی را بر اساس گمان (الظن) و نه بر اساس یقین (القطع) بپرستد، آن گمان به او خیانت می‌کند و او را از خدا بی‌نیاز نمی‌سازد. خداوند متعال می‌فرماید: «إِنَّ الظَّنَّ لَا يُغْنِي مِنَ الْحَقِّ شَيْئًا» (همانا گمان (الظن) از حق (الحق) هیچ چیز را بی‌نیاز نمی‌کند). و درباره عبادت آنان فرمود: «إِن يَتَّبِعُونَ إِلَّا الظَّنَّ وَمَا تَهْوَى الْأَنفُسُ» (آنان جز از گمان (الظن) و آنچه نفس‌ها می‌خواهند، پیروی نمی‌کنند). پس هرگز به آنان نسبت داده نشده است که غیر خدا را پرستیده‌اند، مگر از طریق گمان (الظن)، نه از جهت علم. زیرا آن در نفس‌الامر، علم نیست. از اینجا می‌فهمی که علم سبب نجات است و اگر در راه شقی شود، سرانجام به نجات می‌رسد. پس مرتبه علم چقدر شریف است! به همین دلیل، خداوند به پیامبرش (صلی الله علیه و سلم) امر نکرد که از او طلب افزایش در چیزی کند، مگر در علم، و به او فرمود: «وَقُل رَّبِّ زِدْنِي عِلْمًا» (و بگو: پروردگارا، علم مرا زیاد کن). پس هر کس آنچه را که به آن اشاره کردیم بفهمد، اهل سعادت را از اهل شقاوت می‌شناسد و امور عَرَضی که موجب شقاوت در راه می‌شوند، در او تأثیر نمی‌گذارند. اگر مشرک آنچه را که حق (الحق) از صفات جلال سزاوار است می‌دانست، می‌فهمید که شایسته نیست برای او شریکی قرار داده شود. و اگر مشرک می‌دانست که آنچه او شریک قرار داده، شایسته نیست که به شرکت با خدا در الوهیت وصف شود، شرک نمی‌ورزید. پس او جز به نادانی (الجهل) از هر دو طرف گرفتار نشده است. خداوند متعال می‌فرماید: «فَلَا تَكُونَنَّ مِنَ الْجَاهِلِينَ» (پس زنهار از جاهلان (الجاهلين) مباش). و فرمود: «إِنِّي أَعِظُكَ أَن تَكُونَ مِنَ الْجَاهِلِينَ» (من تو را پند می‌دهم که از جاهلان (الجاهلين) نباشی). اگر مشرک تنها به شرکت در فعل اکتفا می‌کرد، نه در الوهیت، امر وسیع‌تر بود، زیرا نسبت دادن افعال به مخلوقات محل اشکال است و صاحب آن در مورد کسی که دارای فعل است، معذور است. اما اگر افعال را به کسی نسبت دهند که می‌دانند فاعل نیست، به نادانی (الجهل) گرفتار شده‌اند و به همین دلیل مورد توبیخ قرار گرفتند و به آنان گفته شد: «أَتَعْبُدُونَ مَا تَنْحِتُونَ» (آیا چیزی را می‌پرستید که خود می‌تراشید؟). و درباره کسی که دارای فعل است، فرمود: «وَأَضَلَّ فِرْعَوْنُ قَوْمَهُ وَمَا هَدَىٰ» (و فرعون قوم خود را گمراه کرد و هدایت ننمود). پس گمراهی را به فرعون نسبت داد و به قومش نسبت نداد، زیرا او نزد آنان دارای فعل است و در نفس‌الامر نیز چنین است. و قول او «وَمَا هَدَىٰ» (و هدایت ننمود) یعنی راه حق (الحق) را برای آنان بیان نکرد، زیرا او موضع اشتباه بود، به دلیل داشتن افعال. اگر معبود، جماد بود، اشتباهی رخ نمی‌داد. اگر گفته شود: «اگر خدایی را برگزینند که دارای فعلی از طریق خاصیت (بالخاصية) باشد، مانند جماد یا نبات، آیا معذورند؟» می‌گوییم: «معذور نیستند، زیرا خاصیت آن در همه چیز جاری نیست تا افعال به آن نسبت داده شود، همان‌گونه که به خدا نسبت داده می‌شود.» و به همین مقدار از نادانی (الجهل) بود که پرستندگان مخلوقات دارای افعال، مانند فرعون و غیره، گرفتار شدند. زیرا قدرتی که او دارد، از قدرت پرستنده او بیشتر نیست، پس از سریان در همه افعال قاصر است. زیرا قدرت حادث، جوهرهای متحیز از اعیان جواهر و اجسام را خلق نمی‌کند. پس کسی را پرستیدند که اعیان آن‌ها را خلق نکرده است. و به همین دلیل، خداوند آنان را با این قول توبیخ کرد: «أَفَمَن يَخْلُقُ كَمَن لَّا يَخْلُقُ ۗ أَفَلَا تَذَكَّرُونَ» (آیا کسی که می‌آفریند، مانند کسی است که نمی‌آفریند؟ آیا متذکر نمی‌شوید؟). اگر گفته شود: «اگر کسی به طریق خرق عادت، بر خلق جوهری قادر شود و کسی او را به این دلیل بپرستد، آیا معذور است یا خیر؟» می‌گوییم: «معذور نیست، زیرا شهادت می‌دهد که او حوادث را می‌پذیرد و از آن‌ها خالی نیست. و آنچه از حوادث خالی نباشد، محال است که به طور کلی بر آن‌ها تقدم داشته باشد. و اگر به طور کلی بر حوادث تقدم نداشته باشد، مانند آن‌ها حادث است. و شأن اله این است که از هر آنچه به طور کلی حادث می‌شود، قدیم‌تر باشد. پس لازم است که حادث، با هر نسبتی از تأخر، از او متأخر باشد.» پس چون این مقدار از علم از او فوت شد و به آن جاهل بود، معذور نشد و به همین دلیل گرفتار شد. و اصل آن، همان نادانی (الجهل) به آن بود. پس هر کس به معبودی موضوع تکیه کند، تنها با گمان (الظن) خود به آن تکیه کرده است، نه با علم خود. به همین دلیل گرفتار شد و شقی گشت، مگر اینکه نهایت تلاش خود را در نفی شریک به کار گیرد، اما فکر و نظر و اجتهادش به نفی کامل آن نرسد و رسولی به سوی او فرستاده نشده باشد و دعوت او به او نرسیده باشد. زیرا گروهی از اهل نظر گفته‌اند که کسی که حالش چنین است، معذور است و در نفس‌الامر مأجور است، با اینکه خطا کرده است. و او صاحب گمان (الظن) نیست، بلکه قاطع (یقین‌کننده) است، نه عالم. و یقین (القطع) بر چیزی، لزوماً از روی علم نیست. و شاید از این قول خداوند متعال آرامش یابد: «وَمَن يَدْعُ مَعَ اللَّهِ إِلَٰهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ» (و هر کس با خدا، معبود دیگری را بخواند که برهانی بر آن ندارد). شکی نیست که مجتهدی که در اجتهاد خود در اصول خطا کرده است، یقین (القطع) دارد که برهانی بر آنچه نظرش به آن رسیده، دارد، اگرچه در نفس‌الامر برهان نیست. پس خداوند متعال ممکن است او را به دلیل یقین (القطع) او که از اجتهادش حاصل شده، معذور بدارد، همان‌گونه که صحابی یقین (القطع) داشت که دحیه را دیده است، در حالی که دیده شده جبرئیل بود. پس این شخص بر غیر علم، یقین (القطع) کرده است. او اجتهاد کرد و خطا نمود، زیرا آنچه از تقسیم‌بندی کم داشت را به یاد نیاورد. اگر می‌گفت: «اگر روحی تجسد یافته نباشد، بدون شک دحیه است»، تدبر کن در آنچه در این مورد مقرر کردیم.\n\nپیامبر (صلی الله علیه و سلم) درباره مجتهد می‌فرماید: «إذا اجتهد فأصاب فله أجران وإن أخطأ فله أجر» (هرگاه مجتهد اجتهاد کند و به صواب رسد، دو پاداش دارد و اگر خطا کند، یک پاداش دارد).\n\nو خداوند متعال فرمود: «وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبْعَثَ رَسُولًا» (و ما عذاب‌کننده نبودیم، مگر اینکه رسولی بفرستیم). و به این باب، گروه‌هایی ملحق می‌شوند که اکثر علما عذاب را بر آنان واجب دانسته‌اند و حکم به شقاوت آنان کرده‌اند، بدون دلیل واضحی که علم را افاده کند. پس آنان را با گمان (الظن) و یقین (القطع) بر غیر علم در نفس‌الامر، در منازل اشقیا قرار داده‌اند. پس اله با گمان (الحسبان) نیست. بنابراین، با آنچه ذکر کردیم، ثابت شد که هر کس گمان (الظن) کند، از عذاب در مورد اله نجات نمی‌یابد. اگر گفته شود:\n\nخداوند می‌فرماید: «أنا عند ظن عبدي بي» (من نزد گمان بنده خود به خویش هستم).\n\nمی‌گوییم: «این مذهب ماست، زیرا فرمود: \"به خویش (بی)\"، پس او را اثبات کرده است. و نگفت: \"من نزد گمان بنده به کسی هستم که او را اله قرار داده است.\"» پس متعلق گمان (الظن) نزد او، خدا بود، در آنچه از سعادت یا شقاوت گمان می‌برد. زیرا او عالم به خداست و صاحب گمان (الظن) در مؤاخذه او بر گناه یا عفو از آن است. و پس از آنکه این امر مقرر شد:\n\n### [بدان که بهشت دو بهشت است: بهشت حسی و بهشت معنوی، همان‌گونه که آتش دو آتش است]\n\nپس بدان که بهشت دو بهشت است: بهشت حسی و بهشت معنوی. بهشت محسوس، ارواح حیوانی و نفوس ناطقه (النفوس الناطقة) در آن متنعم می‌شوند. و بهشت معنوی، تنها نفوس ناطقه (النفوس الناطقة) در آن متنعم می‌شوند، و آن بهشت علوم و معارف (المعارف) است و غیر از این دو نیست. و آتش نیز دو آتش است: آتش محسوس و آتش معنوی. آتش محسوس، ارواح حیوانی و نفوس ناطقه (النفوس الناطقة) با آن عذاب می‌بینند. و آتش معنوی، تنها نفوس ناطقه (النفوس الناطقة) با آن عذاب می‌بینند. و فرق میان این دو نعیم و دو عذاب این است که عذاب حسی و نعیم حسی با مباشرت (تماس مستقیم) رخ می‌دهد که از مباشرت آن، درد در روح حیوانی پدید می‌آید. و عذاب معنوی با مباشرت برای نفوس ناطقه (النفوس الناطقة) نیست، بلکه به واسطه علمی است که از فوت شدن عمل و علمی که منجر به سعادت روح حیوانی می‌شود و سعادت نفس ناطقه را در بر دارد، برای آن حاصل شده است. اما آتش فکر که درد آن به حس و نفس تعلق دارد، آتش معنوی است. اگر از آن علم حاصل شود، به دنبال آن نعیم بهشت معنوی می‌آید. و اگر از آن علم حاصل نشود، صاحبش تا زمانی که متفکر است، معذب می‌ماند و نعیم معنوی ندارد. و اگر فکر از او زائل شود، به هر وجهی که زائل شود، بدون حصول علم، آن نعمتی که نفس می‌یابد، تنها راحتی از فقدان آتش تفکری است که بر قلب او مسلط بوده است. پس آن راحتی حسی است نه معنوی. این را بدان.\n\n### [سوزاندن آتش به طبع]\n\nو بدان که این منزل (منزل) شامل علم تعقل آنچه حیوان نیست در ادراک حسی عادی از جانب خداوند متعال است، در آنچه به آن امر می‌کند. مانند قول خداوند متعال: «إِنَّا عَرَضْنَا الْأَمَانَةَ عَلَى السَّمَاوَاتِ وَالْأَرْضِ وَالْجِبَالِ فَأَبَيْنَ أَن يَحْمِلْنَهَا» (ما امانت را بر آسمان‌ها و زمین و کوه‌ها عرضه کردیم، پس از حمل آن سر باز زدند). و قول خداوند متعال: «فَقَالَ لَهَا وَلِلْأَرْضِ ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ» (پس به آسمان و زمین فرمود: خواه یا ناخواه بیایید. گفتند: فرمانبردار آمدیم). پس خداوند آن‌ها را مانند کسی که تعقل می‌کند جمع بست و آنچه را برای حیوان عالم، شنوا و قادر اثبات شده، برای آن‌ها اثبات کرد. و قول خداوند متعال: «عَلَيْهِمْ نَارٌ مُّؤْصَدَةٌ» (بر آنان آتشی است که درهایش بسته شده). پس خبر داد که آن مسلط است، و تسلط را جز کسی که تعقل می‌کند نمی‌پذیرد، و اینکه آن به طبع (بالطبع) سوزاننده است. زیرا اگر به طبع سوزاننده نبود، تسلط بر کفار را نمی‌پذیرفت. زیرا اگر سوختن در آن به غیر طبع بود، مخالفت از آن تصور نمی‌شد، چرا که مخالفت همان احتراق است و آن امری دیگر است که وجودش نیازمند به ایجادکننده‌ای است. و حق (الحق) تنها آتش را مورد خطاب قرار داده است. و احتراق یک عَرَض است و عَرَض نیازمند وجود در غیر عین آتش است. زیرا اگر در آتش وجود داشته باشد، به جسمی که آتش بر آن مسلط شده منتقل نمی‌شود، چون عَرَض منتقل نمی‌شود؛ زیرا اگر منتقل می‌شد، از محل خود خالی می‌شد و به خودی خود قائم می‌گشت، در حالی که عَرَض به خودی خود قائم نمی‌شود. پس سوزاندن جسمی که با آتش سوزانده می‌شود، محال است. بنابراین، خطاب آتش به سوزاندن، عبث خواهد بود. در حالی که خطاب تسلط بر آتش واقع شده است. پس بر چه کسی واقع شده است؟ پس باطل است که حق (الحق) به عبث سخن بگوید. پس چگونه این خطاب خارج می‌شود و بر چه کسی واقع می‌شود، اگر سوزاندن برای آتش به طبع نباشد؟ و همچنین هر جماد، نبات و حیوانی که مورد خطاب قرار گیرد، باید زنده، عاقل و پذیرای آنچه مورد خطاب قرار می‌گیرد باشد، و شأن آن این است که آنچه به او گفته شده «انجام بده» را بپذیرد، پذیرشی ذاتی که تابع وجود عین آن است. پس من تو را بر این نوع از ادراک که این منزل (منزل) در بر دارد، آگاه ساختم. و بدان که به تمام آنچه این منزل (منزل) از علوم در بر دارد، جز با تعریف الهی، به واسطه روحانیت انبیا برای این مکاشف، نمی‌توان دست یافت. و آن ارواح، به دلیل پیچیدگی و ظرافتشان، جز به واسطه‌ها از جانب خدا دانسته نمی‌شوند. از جمله آنچه این منزل (منزل) در بر دارد، علم شکستن شکسته (کسر المکسور) تا بی‌نهایت است. و از طریق عقل معلوم است که شکسته محصور است، پس متناهی است. چگونه شکستن تا بی‌نهایت را می‌پذیرد؟ و این مسئله شبیه مسئله تقسیم جسم تا بی‌نهایت است، عقلاً نه حساً، نزد حکما، برای ابطال اثبات جوهر فرد که تقسیم جسم در مذهب متکلمین به آن ختم می‌شود. پس از این منزل (منزل)، حق (الحق) را نزد هر یک از این دو گروه می‌شناسی. و از این منزل (منزل) بر علم قیام عذاب و حمل آن در غیر اجسام معذبین و عذاب دیدن معذبین به آن، با وجود اینکه در آن‌ها قائم نیست، مطلع می‌شوی. و این از مشکل‌ترین مسائل است که چگونه یک معنی، حکم خود را برای غیر از محلی که در آن قائم است، واجب می‌کند؟ و این مسئله نیز شبیه مسئله کسی است که می‌گوید: «خداوند اگر بخواهد امری را اجرا کند، اراده‌ای را خلق می‌کند که در محلی نیست، سپس با آن اراده، اجرای آن امر را اراده می‌کند.» پس معنی، حکم خود را برای کسی که در آن قائم نیست، واجب کرده است، نزد کسانی که صفات را اعیانی دارای احکام می‌دانند، و آنان متکلمین هستند. و فرق میان این مسئله و مسئله ما این است که عذاب در اجسامی حمل می‌شود و حکم آن در اجسام دیگری است که غیر از اجسامی هستند که عذاب در آن‌ها قائم است. و عذابی که در این اجسام حمل می‌شود، با آن عذاب نمی‌بینند، در حالی که در آن‌ها قائم است و به آن متصف هستند، از جهت اینکه محل آن هستند، نه از جهت اینکه با آن معذب می‌شوند. و وجه جامع میان دو مسئله، وجود حکم مضاف به معنی در غیر محلی است که آن معنی در آن قائم شده است. و آیا علم مانند اراده در این باب و سایر صفات است یا خیر؟ به طوری که علم در زید قائم باشد، اما زید به آن عالم نباشد و عمرو به آن عالم باشد. و این عقلاً محال است. اما این منزل (منزل) به وقوع آن حکم می‌کند. اگر می‌خواهی نفس را برای پذیرش آنچه این منزل (منزل) در این مسئله داده است، مأنوس کنی، به آنچه تو و اصحابت بر آن اجماع دارید بنگر که حق سبحانه از حلول در اجسام متعالی است. انسان با بینایی خود که در جارحه چشمش در صورتش قائم است، می‌بیند؛ و با شنوایی خود که در جارحه گوشش قائم است، می‌شنود؛ و با کلامی که در حرکت و سکون زبان و لب‌هایش و مخارج حروفش از سینه‌اش تا لب‌هایش موجود است، سخن می‌گوید. سپس این شخص به طاعت خداوند متعال، که افزون بر فرائض اوست، از نوافل خیرات عمل می‌کند. و این عمل برای او نفی شنوایی، بینایی، کلام و تمام معانی او از بطش و سعی را نتیجه می‌دهد که احکام آن‌ها را بر او واجب می‌کردند. پس از احکام آن‌ها، شنوا، بینا، متکلم و غیره بر او اطلاق می‌شد. پس او با خدا می‌شنود، پس از آنکه با شنوایی خود می‌شنید؛ و با خدا می‌بیند، پس از آنکه با بینایی خود می‌دید؛ با علم به اینکه خداوند تقدس دارد از اینکه اشیا محل او باشند یا او محل آن‌ها باشد. پس بنده با کسی شنید که صفت در او قائم نیست، و با چیزی دید که صفت در او قائم نیست، و با چیزی سخن گفت که صفت در او قائم نیست. پس حق (الحق) شنوایی، بینایی و دست او بود. پس وجود عذاب در محل‌هایی که صفتی که حکم آن عذاب است در آن‌ها قائم نشده، این‌گونه است. همان‌گونه که ثابت شده است که صفت، خلاف حکم خود را در محل می‌دهد، و تو خود به آن قائلی. و فرقی میان دو مسئله نیست. و صاحب محاسن المجالس در این باره سروده است:\n\nآیا درباره عاشقی شنیده‌اید *** که چشمش سالم و بیمار است؟\nمتنعم به عذاب *** و معذب به نعیم\n\nو ابویزید اکبر، طیفور بن عیسی بسطامی، خطاب به پروردگار عز و جل خود سروده است:\n\nتو را می‌خواهم، نه برای ثواب *** بلکه تو را برای عقاب می‌خواهم\nو هر آنچه پروردگارم از آن به دست آوردم *** جز لذت وجد من به عذاب نبود\n\nپس او لذت را در عذاب طلب کرد. و این برعکس حقایق (الحقائق) در عقل است. اما اهل کشف (الکشف) و ذوق، اموری را یافته‌اند که عقل آن‌ها را محال می‌داند. اگرچه ما می‌دانیم که این دو گوینده در شعر خود چه گفته‌اند. و از همین باب است که خداوند به آتش فرمود: «كُونِي بَرْدًا وَسَلَامًا» (سرد و سلامت باش). و آتش در عقل سرد نمی‌شود، زیرا اگر سرد می‌شد، حقایق (الحقائق) از حقایق بودن باطل می‌شدند. پس ذوق در تجلی (التجلی) خود، خلاف آنچه را که عقل می‌دهد، آورده است. اگرچه ما می‌دانیم که حق (الحق) در آن چه فرموده و با چه کسی خطاب کرده است، اما این را آوردیم تا مراد را برای پذیرش این امر مأنوس کنیم که «أَنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ» (همانا خداوند بر هر چیزی تواناست) و اینکه قدرت او مطلق است بر ایجاد محالات، اگر وجود آن را بخواهد، همان‌گونه که در کتاب خود درباره خود ذکر کرده است، آنچه در عقل محال است، با دلیلی که عقل می‌دهد، فرمود: «لَّوْ أَرَادَ اللَّهُ أَن يَتَّخِذَ وَلَدًا لَّاصْطَفَىٰ مِمَّا يَخْلُقُ مَا يَشَاءُ ۚ سُبْحَانَهُ ۖ هُوَ اللَّهُ الْوَاحِدُ الْقَهَّارُ» (اگر خداوند می‌خواست فرزندی برگزیند، از میان آنچه می‌آفریند، آنچه را می‌خواست برمی‌گزید. منزه است او. اوست خداوند یگانه قهار). پس آن را به درجه امکان، نسبت به مشیت الهی ملحق کرد. در حالی که عقل دلالت کرده است که آن محال است، نه از این جهت که آن را اراده نکرده است. پس ابتدای این آیه، زخمی بود که عقل را در صحت دلیلش جریح کرد تا آن را باطل سازد، سپس آن زخم را در آخر آیه با قول خود «سُبْحَانَهُ» (منزه است او) درمان کرد. یعنی او منزه است از اینکه برای احدیت او دومی باشد. غیر از این، در قول او «الْقَهَّارُ» (قهار) اسراری است که هر کس در آن تأمل کند، می‌فهمد که قهار برای چه کسی است. و تمام افعال، احکام اسمای او در کون هستند. پس هیچ فاعلی جز خدا نیست. پس تمام افعال از اسم قادر و قاهر هستند. و با اسم قاهر، قهر نمی‌شود، مگر موجد آن فعل در کون، و آن اثر قاهر است. پس قهر نکرد، مگر نفس خود را، و آن اثر اسم قادر است. پس قاهر، اسم قادر را قهر نکرد، مگر با اسم قادر، که در وجود عین با او شریک است. پس قاهر، قادر را قهر نکرد، مگر با اسم قادر. مگر اینکه قهر با منع باشد نه با ایجاد، که در این صورت قهر به اسم مرید اضافه می‌شود. اما منع نمی‌کند، مگر با اسم قاهر برای عینی که برای پذیرش وجود مهیا شده بود، پس مشیت آن را قهر کرد و از وجود به تأخیر انداخت، زیرا مشیت ترجیح دارد. پس با آنچه از انس در پذیرش این مسئله آوردم، کفایت لازم را در آنچه طریقه قوم می‌دهد، برای تو حاصل شد. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}