{
  "id": 44,
  "title": {
    "ar": "الباب الرابع والأربعون في البهاليل وأئمتهم في البهللة",
    "en": "Chapter Forty-Four: Concerning the Holy Fools (البهاليل) and their Imams in the State of Holy Foolishness (البهللة)",
    "ur": "چوالیسواں باب: بہالیل (البهاليل) اور ان کے ائمہ کے بارے میں، بہللہ (البهللة) کے ضمن میں",
    "fa": "باب چهل و چهارم در باب بهالیل (البهاليل) و امامانشان در بهلله (البهللة)"
  },
  "content": {
    "ar": "## (الباب الرابع والأربعون في البهاليل وأئمتهم في البهللة)\n\n\n(بسم الله الرحمن الرحيم)\n\n\n> إذا كنت في طاعة راغبا *** فلا تكسها حلة الآجل‏\n\n\n> وكن كالبهاليل في حالهم *** مع الوقت يجرون كالعاقل‏\n\n\n> وحوصل من السنبل الحاصل *** ولا تصبرن إلى قابل‏\n\n\n> فحوصلة الرزق قد هيئت *** ليحصل ما ليس بالحاصل‏\n\n\n> ولا تبكين على فائت *** يفتك الذي هو في العاجل‏\n\n\n> وسوف فلا تلتفت حكمها *** ولا السين وأرحل مع الراحل‏\n\n\n> عساك إذا كنت ذا عزمة *** ومت حصلت على طائل‏\n\n\n> وقل للذي لم يزل وانيا *** تخبطت في شرك الحابل‏\n> وما ظفرت كفكم بالذي *** تريد فيا خيبة السائل‏\n\n\n> فلو كان فعلك في أمره *** كفعل الفتى الحذر الواجل‏\n\n\n> لميزت بيني وبين الذي *** يجلي لك الحق كالباطل‏\n\n\n### [فجآت الحق لمن خلا به في سره‏]\n\n\nيقول الله تعالى وتَرَى النَّاسَ سُكارى‏ وما هُمْ بِسُكارى‏ وذلك أن لله قوما كانت عقولهم محجوبة بما كانوا عليه من الأعمال التي كلفهم الحق تعالى في كتابه وعلى لسان رسوله صلى الله عليه وسلم التصرف فيها شرعا وشرعها لهم ولم يكن لهم علم بأن لله تعالى الحق فجأة لمن خلا به في سره وأطاعه في أمره وهيأ قلبه لنوره من حيث لا يشعر ففجأه الحق على غفلة منه بذلك وعدم علم واستعداد لهائل أمر فذهب بعقله في الذاهبين وأبقى تعالى ذلك الأمر الذي فجأه مشهودا له فهام فيه ومضى معه فبقي في عالم شهادته بروحه الحيواني يأكل ويشرب ويتصرف في ضروراته الحيوانية تصرف الحيوان المفطور على العلم بمنافعه المحسوسة ومضاره من غير تدبير ولا روية ولا فكر ينطق بالحكمة ولا علم له بها ولا يقصد نفعك بها لتتعظ وتتذكر أن الأمور ليست بيدك وأنك عبد مصرف بتصريف حكيم وسقط التكليف عن هؤلاء إذ ليس لهم عقول يقبلون بها ولا يفقهون بها تَراهُمْ يَنْظُرُونَ إِلَيْكَ وهُمْ لا يُبْصِرُونَ خذ العفو أي القليل مما يجري الله على ألسنتهم من الحكم والمواعظ\n\n\n### [عقلاء المجانين من أهل الله‏]\n\n\nوهؤلاء هم الذين يسمون عقلاء المجانين يريدون بذلك أن جنونهم ما كان سببه فساد مزاج عن أمر كوني من غذاء أو جوع أو غير ذلك وإنما كان عن نجل إلهي لقلوبهم وفجأة من فجآت الحق فجأتهم فذهبت بعقولهم فعقولهم محبوسة عنده منعمة بشهوده عاكفة في حضرته متنزهة في جماله فهم أصحاب عقول بلا عقول وعرفوا في الظاهر بالمجانين أي المستورين عن تدبير عقولهم فلهذا سموا عقلاء المجانين قيل لأبي السعود بن الشبل البغدادي عاقل زمانه ما تقول في عقلاء المجانين من أهل الله فقال رضي الله عنه هو ملاح والعقلاء منهم أملح قيل له فبما ذا نعرف مجانين الحق من غيرهم فقال مجانين الحق تظهر عليهم آثار القدرة والعقلاء يشهد الحق بشهودهم أخبرني بذلك عنه صاحبه أبو البدر التماسكي رحمه الله وكان ثقة ضابطا عارفا بما ينقل لا يجعل فاء مكان واو فقال الشيخ من شاهد ما شاهدوا وأبقى عليه عقله فذلك أحسن وأمكن فإنه قد أقيم وأعطى من القوة قريبا مما أعطيت الرسل‏\n\n\n### [تجلى الرب وتدكدك جبل القلب‏]\n\n\nوإن تغيروا في وقت الفجئات فقد علمنا\n\n\nأن رسول الله صلى الله عليه وسلم لما فجأه الوحي جئت منه رعبا فأتى خديجة ترجف بوادره فقال زملوني زملوني‏\n\n\nوذلك من تجلى ملك فكيف به بتجلى ملك فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا وخَرَّ مُوسى‏ صَعِقاً وكان رسول الله صلى الله عليه وسلم إذا جاءه الوحي ونزل الروح الأمين به على قلبه أخذ عن حسه وسجي ورغا كما يرغو البعير حتى ينفصل عنه وقد وعى ما جاءه به فيلقيه على الحاضرين ويبلغه للسامعين‏\n\n\nفمواجده صلى الله عليه وسلم من تجليات ربه على قلبه أعظم سطوة من نزول ملك ووارد في الوقت الذي لم يكن يسعه فيه غير ربه ولكن كان منتظرا مستعدا لذلك الهول ومع هذا يؤخذ عن نفسه فلو لا أنه رسول مطلوب بتبليغ الرسالة وسياسة الأمة لذهب الله بعقول الرسل لعظيم ما يشاهدونه فمكنهم الله القوي المتين من القوة بحيث يتمكنون من قبول ما يرد عليهم من الحق ويوصلونه إلى الناس ويعملون به‏\n\n\n### [مراتب الناس في قبول الواردات الإلهية]\n\n\nفاعلم إن الناس في هذا المقام على إحدى ثلاث مراتب منهم من يكون وارده أعظم من القوة التي يكون في نفسه عليها فيحكم الوارد عليه فيغلب عليه الحال فيكون بحكمه يصرفه الحال ولا تدبير له في نفسه ما دام في ذلك الحال فإن استمر عليه إلى آخر عمره فذلك المسمى في هذه الطريقة بالجنون كأبي عقال المغربي ومنهم من يمسك عقله هناك ويبقى عليه عقل حيوانيته فيأكل ويشرب ويتصرف من غير تدبير ولا روية فهؤلاء يسمون عقلاء المجانين لتناولهم العيش الطبيعي كسائر الحيوانات وأما مثل أبي عقال فمجنون مأخوذ عنه بالكلية ولهذا ما أكل وما شرب من حين أخذ إلى أن مات وذلك في مدة أربع سنين بمكة فهو مجنون أي مستور مطلق عن عالم حسه ومنهم من لا يدوم له حكم ذلك الوارد فيزول عنه الحال فيرجع إلى الناس بعقله فيدبر أمره ويعقل ما يقول ويقال له ويتصرف عن تدبير وروية مثل كل إنسان وذلك هو النبي وأصحاب الأحوال من الأولياء ومنهم من يكون وارده وتجليه مساويا لقوته فلا يرى عليه أثر من ذلك حاكم لكن يشعر عند ما يبصران ثم أمرا ما طرأ عليه‏\nشعورا خفيا فإنه لا بد لهذا أن يصغي إليه أي إلى ذلك الوارد حتى يأخذ عنه ما جاءه به من عند الحق فحاله كحال جليسك الذي يكون معك في حديث فيأتي شخص آخر في أمر من عند الملك إليه فيترك الحديث معك ويصغي إلى ما يقول له ذلك الشخص فإذا أوصل إليه ما عنده رجع إليك فحادثك فلو لم تبصره عينك ورأيته يصغي إلى أمر شعرت أن ثم أمرا شغله عنك في ذلك كرجل يحدثك فأخذته فكرة في أمر فصرف حسه إليه في خياله فجمدت عينه ونظره وأنت تحدثه فتنظر إليه غير قابل حديثك فتشعر أن باطنه متفكر في أمر آخر خلاف ما أنت عليه ومنهم من تكون قوته أقوى من الوارد فإذا أتاه الوارد وهو معك في حديث لم تشعر به وهو يأخذ من الوارد ما يلقى إليه ويأخذ عنك ما تحدثه به أو يحدثك به وما ثم أمر رابع في واردات الحق على قلوب أهل هذه الطريقة وهي مسألة غلط فيها بعض أهل الطريق في الفرق بين النبي والولي فقالوا الأنبياء يصرفون الأحوال والأولياء تصرفهم الأحوال فالأنبياء مالكون أحوالهم والأولياء مملوكون لأحوالهم والأمر إنما هو كما فصلناه لك وقد بينا لك لما ذا يرد الرسول ويحفظ عليه عقله مع كونه يؤخذ ولا بد عن حسه في وقت وارد الحق على قلبه بالوحي المنزل فافهم ذلك وتحققه‏\n\n\n### [من نوادر عقلاء المجانين‏]\n\n\nوقد لقينا جماعة منهم وعاشرناهم واقتبسنا من فوائدهم ولقد كنت واقفا على واحد منهم والناس قد اجتمعوا عليه وهو ينظر إليهم وهو يقول لهم أطيعوا الله يا مساكين فإنكم من طين خلقتم وأخاف عليكم أن تطبخ النار هذه الأواني فتردها فخارا فهل رأيتم قط آنية من طين تكون فخارا من غير أن تطبخها نار يا مساكين لا يغرنكم إبليس بكونه يدخل النار معكم وتقولون الله يقول لَأَمْلَأَنَّ جَهَنَّمَ مِنْكَ ومِمَّنْ تَبِعَكَ مِنْهُمْ أَجْمَعِينَ إبليس خلقه الله من نار فهو يرجع إلى أصله وأنتم من طين تتحكم النار في مفاصلكم يا مساكين انظروا إلى إشارة الحق في خطابه لإبليس بقوله لَأَمْلَأَنَّ جَهَنَّمَ مِنْكَ وهنا قف ولا تقرأ ما بعدها فقال له جهنم منك وهو قوله خَلَقَ الْجَانَّ من مارِجٍ من نارٍ فمن دخل بيته وجاء إلى داره واجتمع بأهله ما هو مثل الغريب الوارد عليه فهو رجع إلى ما به افتخر قالَ أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي من نارٍ فسروره رجوعه إلى أصله وأنتم يا مناحيس تتفخر بالنار طينتكم فلا تسمعوا من إبليس ولا تطيعوا واهربوا إلى محل النور تسعدوا يا مساكين أنتم عمي ما تبصرون الذي أبصره أنا تقولون سقف هذا المسجد ما يمسكه إلا هذه الأسطوانات أنتم تبصرونها أسطوانات من رخام وأنا أبصرها رجالا يذكرون الله ويمجدونه بالرجال تقوم السموات فكيف هذا المسجد ما أدري إما أنا هو الأعمى لا أبصر الأسطوانات حجارة وإما أنتم هم العمي لا تبصرون هذه الأسطوانات رجالا والله يا إخوتي ما أدري لا والله أنتم هم العمي ثم استشهدني دون الجماعة فقال يا شاب أ لست أقول الحق قلت بلى ثم جلست إلى جانبه فجعل يضحك وقال يا ناس الأستاه المنتنة تصفر بعضها لبعض وهذا الشاب منتن مثلي هذه المناسبة جعلته يجلس إلى جانبي ويصدقني أنتم الساعة تحسبونه عاقلا وأنا مجنون هو أجن مني بكثير وإنما أنتم كما أعماكم الله عن رؤية هذه الأسطوانات رجالا أعماكم أيضا عن جنون هذا الشاب ثم أخذ بيدي وقال قم امش بنا عن هؤلاء فخرجت معه فلما فارق الناس ترك يدي من يده وانصرف عني وهو من أكبر من لقيته من المعتوهين كنت إذا سألته ما الذي ذهب بعقلك يقول لي أنت هو المجنون حقا ولو كان لي عقل كنت تقول لي ما الذي ذهب بعقلك أين عقلي حتى يخاطبك قد أخذه معه ما أدري ما يفعل به وتركني هنا في جملة الدواب آكل وأشرب وهو يدبرني قلت له فمن يركبك إذا كنت دابة قال أنا دابة وحشية لا أركب ففهمت أنه يريد خروجه عن عالم الإنس وأنه في مفاوز المعرفة فلا حكم للانس عليه وكذلك كان محفوظا من أذى الصبيان وغيرهم كثير السكوت مبهوتا دائم الاعتبار يلازم المسجد ويصلي في أوقات فربما كنت أسأله عند ما أراه يصلي أقول له أراك تصلي يقول لي لا والله إنما أراه يقيمني ويقعدني ما أدري ما يريد بي أقول له فهل تنوي في صلاتك هذه أداء ما افترض الله عليك فيقول لي أي شي‏ء تكون النية أقول له القصد بهذه الأعمال القربة إليه فيضحك ويقول أنا أقول له أراه يقيمني ويقعدني فكيف أنوي القربة إلى من هو معي وأنا أشهده ولا يغيب عني هذا كلام المجانين ما عندكم عقول‏\n\n\n### [ألوان من مجانين الحق‏]\n\n\nثم لتعلم إن هؤلاء البهاليل كبهلول وسعدون من المتقدمين وأبي وهب الفاضل وأمثالهم منهم المسرور ومنهم المحزون وهم في ذلك بحسب الوارد الأول الذي ذهب بعقولهم فإن كان وارد قهر قبضهم كيعقوب‏\nالكوراني كان بالجسر الأبيض رأيته وكان على هذا القدم وكذلك مسعود الحبشي رأيته بدمشق ممتزجا بين القبض والبسط الغالب عليه البهت وإن كان وارد لطف بسطهم رأيت من هذا الصنف جماعة كأبي الحجاج الغليري وأبي الحسن علي السلاوي والناس لا يعرفون ما ذهب بعقولهم شغلهم ما تجلى لهم عن تدبير نفوسهم فسخر الله لهم الخلق فهم مشتغلون بمصالحهم عن طيب نفس فأشهى ما إلى الناس أن يأكل واحد من هؤلاء عنده أو يقبل منه ثوبا تسخيرا إلهيا فجمع الله لهم بين الراحتين حيث يأكلون ما يشتهون ولا يحاسبون ولا يسألون وجعل لهم القبول في قلوب الخلق والمحبة والعطف عليهم واستراحوا من التكليف ولهم عند الله أجر من أحسن عملا في مدة أعمارهم التي ذهبت بغير عمل لأنه سبحانه هو الذي أخذهم إليه فحفظ عليهم نتائج الأعمال التي لو لم يذهب بعقولهم لعملوها من الخير كمن بات نائما على وضوء وفي نفسه أن يقوم من الليل يصلي فيأخذ الله بروحه فينام حتى يصبح فإن الله يكتب له أجر من قام ليلة لأنه الذي حبسه عنده في حال نومه فالمخاطب بالتكليف منهم وهو روحهم غائب في شهود الحق الذي ظهر سلطانه فيهم فما لهم أذن واعية لحفظ السماع من خارج وتعقل ما جاء به‏\n\n\n### [ابن عربي في مقام البهللة]\n\n\nولقد ذقت هذا المقام ومر على وقت أؤدي فيه الصلوات الخمس إماما بالجماعة على ما قيل لي بإتمام الركوع والسجود وجميع أحوال الصلاة من أفعال وأقوال وأنا في هذا كله لا علم لي بذلك لا بالجماعة ولا بالمحل ولا بالحال ولا بشي‏ء من عالم الحس لشهود غلب على غبت فيه عني وعن غيري وأخبرت أني كنت إذا دخل وقت الصلاة أقيم الصلاة وأصلي بالناس فكان حالي كالحركات الواقعة من النائم ولا علم له بذلك فعلمت إن الله حفظ على وقتي ولم يجر على لساني ذنب كما فعل بالشبلي في ولهه لكنه كان الشبلي يرد في أوقات الصلوات على ما روى عنه فلا أدري هل كان يعقل رده أو كان مثل ما كنت فيه فإن الراوي ما فصل فلما قيل للجنيد عنه قال الحمد لله الذي لم يجر عليه لسان ذنب إلا أني كنت في أوقات في حال غيبتي أشاهد ذاتي في النور الأعم والتجلي الأعظم بالعرش العظيم يصلي بها وأنا عرى عن الحركة بمعزل عن نفسي وأشاهدها بين يديه راكعة وساجدة وأنا أعلم أني أنا ذلك الراكع والساجد كرؤية النائم واليد في ناصيتي وكنت أتعجب من ذلك واعلم أن ذلك ليس غيري ولا هو أنا ومن هناك عرفت المكلف والتكليف والمكلف اسم فاعل واسم مفعول فقد أبنت لك حالة المأخوذين عنهم من المجانين الإلهيين إبانة ذائق بشهود حاصل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## The Forty-Fourth Chapter Concerning the Ecstatics (البهاليل) and their Imams in the State of Ecstasy (البهللة)\n\n(In the Name of Allah, the Most Compassionate, the Most Merciful)\n\n> If you are desirous of obedience,\n> Do not clothe it in the garment of the future.\n> And be like the Ecstatics (البهاليل) in their state,\n> With time, they proceed as if rational.\n> Gather the grain from the existing ear,\n> And do not wait until the next year.\n> For the gathering of provision has been prepared,\n> So that what is not yet obtained may be obtained.\n> And do not weep over what has passed,\n> Lest it destroy what is present in the immediate.\n> And 'soon' (*sawfa*)—do not heed its ruling,\n> Nor the letter *sīn* [denoting future], but depart with the departing.\n> Perhaps, if you possess resolve,\n> And die, you will have achieved something great.\n> And say to him who remains weak,\n> \"You have stumbled into the snare of the trapper.\"\n> \"And your hand has not grasped what\n> You desire, O disappointment of the seeker!\"\n> If your action concerning His command\n> Were like the action of the cautious, fearful youth,\n> You would distinguish between me and him\n> Who manifests the Real (الحق) to you as falsehood.\n\n### The Sudden Appearance of the Real to him who is alone with Him in his secret heart\n\nAllah the Exalted says: <<وَتَرَى النَّاسَ سُكارى‏ وَمَا هُمْ بِسُكارى‏>> (And you see mankind intoxicated, yet they are not intoxicated).\n\nThis is because Allah has a people whose intellects were veiled by the actions with which the Real (الحق) obligated them in His Book and upon the tongue of His Messenger (peace and blessings be upon him), commanding them to engage in these actions legally, and legislating them for them. They had no knowledge that the Real (الحق) has a sudden manifestation (فجأة) for him who is alone with Him in his secret heart, obeys Him in His command, and prepares his heart for His light, without realizing it.\n\nSo the Real (الحق) suddenly appeared to him while he was heedless of it, lacking knowledge and preparation for such a tremendous matter, and thus took his intellect away among those whose intellects are gone. The Exalted preserved that matter which suddenly appeared to him as something witnessed (مشهودا) by him, so he became lost in it and proceeded with it.\n\nHe remains in the world of his witnessing (عالم شهادته) by means of his animal spirit (روحه الحيواني), eating, drinking, and managing his animal necessities, acting like an animal naturally disposed to know its sensible benefits and harms, without planning (تدبير), deliberation (روية), or thought. He may speak wisdom, yet he has no knowledge of it, nor does he intend to benefit you with it so that you may take heed and remember that affairs are not in your hands, and that you are a servant managed by the disposition of a Wise One.\n\nThe religious obligation (التكليف) is lifted from these individuals, as they possess no intellects by which they can accept or understand. <<تَرَاهُمْ يَنْظُرُونَ إِلَيْكَ وَهُمْ لَا يُبْصِرُونَ>> (You see them looking at you, yet they do not see). Take the pardon (*al-afw*), meaning the little bit of wisdom and admonition that Allah causes to flow upon their tongues.\n\n### The Sane Madmen (عقلاء المجانين) among the People of Allah\n\nThese are the ones called the Sane Madmen (عقلاء المجانين). By this, they mean that their madness was not caused by a corruption of temperament due to a cosmic matter, such as food, hunger, or anything else. Rather, it resulted from a Divine glance (نجل إلهي) upon their hearts and a sudden manifestation (فجأة) from the sudden manifestations of the Real (الحق) that overwhelmed them and took away their intellects.\n\nTheir intellects are imprisoned with Him, enjoying His witnessing (شهوده), devoted to His Presence (حضرته), and delighting in His Beauty. Thus, they are possessors of intellects without intellects. Outwardly, they are known as the mad (*al-majānīn*), meaning those veiled from the management of their intellects. This is why they are called the Sane Madmen (عقلاء المجانين).\n\nAbū al-Su'ūd ibn al-Shibl al-Baghdādī, the rational man of his time, was asked: \"What do you say about the Sane Madmen among the People of Allah?\" He replied (may Allah be pleased with him): \"He is handsome, and the rational ones among them are even more handsome.\" He was asked: \"How do we distinguish the madmen of the Real (مجانين الحق) from others?\" He said: \"The madmen of the Real show the traces of Power (آثار القدرة) upon them, while the rational ones witness the Real (الحق) through their witnessing (شهود).\" His companion, Abū al-Badr al-Timāskī (may Allah have mercy on him), informed me of this. He was trustworthy, precise, and knowledgeable of what he transmitted, never substituting a *fā'* for a *wāw*.\n\nThe Shaykh said: \"He who witnesses what they witness, yet retains his intellect, is better and more established. For he has been upheld and given a strength close to that given to the Messengers.\"\n\n### The Theophany of the Lord and the Crushing of the Mountain of the Heart\n\nIf they change during the time of sudden manifestations (الفجئات), we know that when the Revelation (الوحي) suddenly came upon the Messenger of Allah (peace and blessings be upon him), he was struck with terror by it. He came to Khadījah, his muscles trembling, saying: \"Wrap me up! Wrap me up!\"\n\nThat was from the Self-disclosure (تجلي) of an angel. How then would it be with the Self-disclosure of the King [Allah]? <<فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا وَخَرَّ مُوسَى صَعِقًا>> (But when his Lord manifested His glory to the mountain, He made it crumble to dust, and Moses fell down unconscious).\n\nWhen the Revelation came to the Messenger of Allah (peace and blessings be upon him) and the Trustworthy Spirit [Gabriel] descended with it upon his heart, he was taken away from his senses, covered, and he would groan like a camel groans until the state departed from him. Yet he retained what was brought to him, delivering it to those present and conveying it to those who listened.\n\nHis spiritual experiences (*mawājid*) (peace and blessings be upon him) resulting from the Self-disclosures (تجليات) of his Lord upon his heart were more overwhelming than the descent of an angel, and they were a Divine influx (*wārid*) at a time when nothing but his Lord could encompass him. However, he was expectant and prepared for that terror. Despite this, he was taken away from his self. Were it not that he was a Messenger required to convey the message and govern the community, Allah would have taken away the intellects of the Messengers due to the magnitude of what they witness. Thus, Allah, the Strong, the Firm, enabled them with a strength by which they could accept what came to them from the Real (الحق), convey it to people, and act upon it.\n\n### The Levels of People in Accepting Divine Influxes\n\nKnow that people in this station (مقام) are upon one of three levels (مراتب).\n\nOne group is such that their Divine influx (وارده) is greater than the strength they possess in their soul. The influx dominates them, the spiritual state (*al-hāl*) overcomes them, and they are subject to its ruling. The state manages them, and they have no self-management (تدبير) as long as they are in that state. If this continues until the end of his life, that is what is called \"madness\" (*al-junūn*) in this Path, such as Abū ‘Uqāl al-Maghribī.\n\nAnother group retains their intellect there, but their animal intellect (عقل حيوانيته) remains, so they eat, drink, and act without planning or deliberation. These are called the Sane Madmen (عقلاء المجانين) because they partake of natural life like all other animals. As for someone like Abū ‘Uqāl, he is completely taken away (*ma’khūdh ‘anhu bi-l-kulliyya*), which is why he neither ate nor drank from the moment he was taken until he died, a period of four years in Mecca. He is a madman, meaning one absolutely veiled from the world of his senses.\n\nAnother group is such that the ruling of that influx does not last for them; the state departs, and they return to people with their intellect, managing their affairs, understanding what they say and what is said to them, and acting with planning and deliberation like any human being. This is the Prophet (النبي) and the possessors of spiritual states (*ashāb al-ahwāl*) among the Saints (الأولياء).\n\nAnother group is such that their influx (وارده) and Self-disclosure (تجلي) are equal to their strength. No ruling effect of that is visible upon them, but when they perceive that something has suddenly occurred to them, they feel a subtle awareness. Such a person must listen attentively to it—that is, to the influx (الوارد)—until he receives from it what has come to him from the Real (الحق). His state is like that of your companion who is speaking with you, when another person arrives with a command from the King for him. He leaves off speaking with you and listens attentively to what that person says. When the person has delivered his message, he returns to you and resumes conversation. Even if your eye did not see the messenger, but you saw him listening to a command, you would sense that something had distracted him from you. This is like a man speaking to you who is seized by a thought concerning some matter, diverting his senses to it in his imagination (خيال). His eye and gaze freeze while you are speaking to him, and you look at him, seeing that he is not receiving your speech, and you sense that his inner being is contemplating something else contrary to what you are discussing.\n\nAnother group is such that their strength is greater than the influx. If the influx comes to him while he is speaking with you, you do not perceive it, yet he receives from the influx what is cast upon him, and he also receives from you what you are telling him, or he tells you.\n\nThere is no fourth matter concerning the influxes of the Real (الحق) upon the hearts of the people of this Path. This is a point where some people of the Path erred regarding the difference between the Prophet (النبي) and the Saint (الولي). They said: \"The Prophets manage the spiritual states (الأحوال), while the Saints are managed by the spiritual states.\" Thus, the Prophets are masters of their states, and the Saints are mastered by their states. The matter is only as we have detailed it for you. We have already explained why the Messenger returns and his intellect is preserved for him, despite the fact that he is necessarily taken away from his senses at the time of the influx of the Real (الحق) upon his heart through the revealed Revelation (الوحي المنزل). Understand this and verify it.\n\n### From the Anecdotes of the Sane Madmen\n\nWe have met a group of them, associated with them, and derived benefits from them.\n\nI was standing by one of them while people had gathered around him. He was looking at them and saying: \"Obey Allah, O wretched ones! For you were created from clay (طين), and I fear for you that the Fire will cook these vessels and turn them into pottery (فخار). Have you ever seen a vessel made of clay become pottery without fire cooking it, O wretched ones? Do not let Iblīs deceive you by saying he will enter the Fire with you, and you say, 'Allah says: <<لَأَمْلَأَنَّ جَهَنَّمَ مِنْكَ وَمِمَّنْ تَبِعَكَ مِنْهُمْ أَجْمَعِينَ>> (I will surely fill Hell with you and with those among them who follow you all together).' Iblīs was created by Allah from fire, so he returns to his origin. But you are made of clay, and the Fire will dominate your joints, O wretched ones! Look at the indication of the Real (الحق) in His address to Iblīs when He said: <<لَأَمْلَأَنَّ جَهَنَّمَ مِنْكَ>> (I will surely fill Hell with you). Stop here and do not read what follows! He said to him, 'Hell is from you,' which refers to His saying: <<وَخَلَقَ الْجَانَّ مِنْ مَارِجٍ مِنْ نَارٍ>> (And He created the jinn from a smokeless flame of fire). So, he who enters his house, comes to his dwelling, and gathers with his family is not like a stranger arriving upon it. He has returned to that by which he boasted: <<قَالَ أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي مِنْ نَارٍ>> (He said, 'I am better than him; You created me from fire'). His joy is in returning to his origin, while you, O miserable ones, boast of the Fire, though your nature is clay! So do not listen to Iblīs and do not obey him. Flee to the place of Light, and you will be happy, O wretched ones! You are blind; you do not see what I see. You say the roof of this mosque is held up only by these pillars. You see them as pillars of marble, but I see them as men remembering Allah and glorifying Him. By men the heavens are upheld, so how about this mosque? I do not know. Either I am the blind one who does not see the pillars as stones, or you are the blind ones who do not see these pillars as men. By Allah, O my brothers, I do not know... No, by Allah, you are the blind ones!\"\n\nThen he called upon me to witness, apart from the group, and said: \"O young man, am I not speaking the truth?\" I said: \"Yes, indeed.\"\n\nThen I sat beside him, and he began to laugh and said: \"O people, foul-smelling posteriors whistle to one another! This young man is foul-smelling like me. This affinity made him sit beside me and confirm me. Now you consider him rational and me mad. He is much madder than I am! Just as Allah blinded you from seeing these pillars as men, He has also blinded you from the madness of this young man.\"\n\nThen he took my hand and said: \"Get up, let us walk away from these people.\" I went out with him. When we left the people, he released my hand and turned away from me.\n\nHe was one of the greatest of the Divinely afflicted (*al-ma'tūhīn*) whom I met. Whenever I asked him, \"What took away your intellect?\" he would say to me: \"You are truly the madman! If I had an intellect, would you be asking me, 'What took away your intellect?' Where is my intellect that it should address you? He took it with Him. I do not know what He does with it, and He left me here among the beasts, eating and drinking, and He manages me.\" I said to him: \"Then who rides you, if you are a beast?\" He said: \"I am a wild beast; I am not ridden.\" I understood that he meant his departure from the world of humanity, and that he was in the wildernesses of Gnosis (المعرفة), so no human judgment applied to him.\n\nLikewise, he was protected from the harm of children and others. He was mostly silent, bewildered (*mabhūt*), constantly contemplating, adhering to the mosque, and praying at the appointed times. Sometimes, when I saw him praying, I would ask him: \"I see you praying.\" He would say to me: \"No, by Allah, I only see Him raising me up and sitting me down. I do not know what He wants with me.\" I would say to him: \"Do you intend in this prayer of yours to fulfill what Allah has obligated upon you?\" He would say to me: \"What is intention (*niyya*)?\" I would say to him: \"The purpose of these actions is nearness (*al-qurba*) to Him.\" He would laugh and say: \"I tell you, 'I see Him raising me up and sitting me down,' so how can I intend nearness to Him who is with me, whom I witness (أشهده), and who is never absent from me? This is the talk of madmen! You have no intellects.\"\n\n### Types of the Madmen of the Real\n\nThen know that these Ecstatics (البهاليل), such as Bahlūl and Sa‘dūn among the predecessors, and Abū Wahb al-Fāḍil and their likes, include those who are joyful (*al-masrūr*) and those who are sorrowful (*al-maḥzūn*). Their state in this depends on the initial influx (الوارد الأول) that took away their intellects. If the influx was one of overwhelming power (*qahr*), it caused them contraction (*qabḍ*), like Ya‘qūb al-Kūrānī, whom I saw at the White Bridge, and he was upon this footing. Likewise, Mas‘ūd al-Ḥabashī, whom I saw in Damascus, was a mixture of contraction (القبض) and expansion (البسط), though bewilderment (*al-baht*) predominated in him. If the influx was one of gentleness (*luṭf*), it caused them expansion (*basṭ*). I saw a group of this type, such as Abū al-Ḥajjāj al-Ghalīrī and Abū al-Ḥasan ‘Alī al-Salāwī.\n\nPeople do not know what took away their intellects. What was disclosed (تجلى) to them distracted them from managing their own souls. So Allah subjugated creation to them, and people willingly attend to their needs. The most desirable thing to people is that one of these individuals should eat with him or accept a garment from him—a Divine subjugation (تسخيرا إلهيا). Thus, Allah combined two comforts for them: they eat what they desire, are neither judged nor questioned, and He placed acceptance, love, and compassion for them in the hearts of creation. They are relieved of religious obligation (التكليف).\n\nThey have with Allah the reward of one who performed the best deeds during the span of their lives that passed without action, because it was He, the Glorified, who took them to Himself. He preserved for them the results of the good deeds they would have performed had their intellects not been taken away. This is like someone who sleeps having performed ablution (wuḍū’) and intends to rise during the night to pray, but Allah takes his soul, and he sleeps until morning. Allah writes for him the reward of one who stood the night in prayer, because it was He who detained him with Him during his sleep.\n\nThe one addressed by the religious obligation (التكليف) among them—which is their spirit—is absent in the witnessing (شهود) of the Real (الحق) whose sovereignty has appeared in them. Thus, they do not possess a conscious ear to retain external hearing or to comprehend what comes through it.\n\n### Ibn Arabi in the Station of Ecstasy (البهللة)\n\nI have tasted this station (مقام), and a time passed over me during which I performed the five obligatory prayers as the Imām leading the congregation, as I was told, completing the bowing (*rukū’*), prostration (*sujūd*), and all states of the prayer, both actions and words. Yet, throughout all of this, I had no knowledge of it—neither of the congregation, nor the place, nor the state, nor anything of the sensory world (عالم الحس), due to a witnessing (شهود) that overwhelmed me, in which I was absent from myself and from others.\n\nI was informed that when the time for prayer arrived, I would establish the prayer and lead the people in prayer. My state was like the movements performed by a sleeper who has no knowledge of them. I knew that Allah preserved my time for me and did not allow a sin to pass upon my tongue, as happened to al-Shiblī in his distraction. However, al-Shiblī would return [to consciousness] at the times of prayer, according to what was narrated about him. I do not know whether he was conscious of his return or if he was in the same state I was in, for the narrator did not elaborate. When al-Junayd was told about him, he said: \"Praise be to Allah who did not allow a sinful tongue to pass upon him.\"\n\nExcept that at times, during my state of absence (*ghayba*), I would witness my Essence (ذاتي) in the All-Encompassing Light (النور الأعم) and the Greatest Theophany (التجلي الأعظم) by the Mighty Throne (العرش العظيم), praying with it, while I was stripped of movement, isolated from my self. I would witness it bowing and prostrating before Him, and I knew that I was that one bowing and prostrating, like the vision of a sleeper, with the Hand upon my forelock. I used to marvel at that, knowing that it was neither other than me nor was it truly me. From that point, I understood the obligated one (*al-mukallaf*), the obligation (*al-taklīf*), and that *al-mukallaf* is both the active subject and the passive object [of the command].\n\nI have thus clarified for you the state of those who are taken away—the Divine Madmen (المجانين الإلهيين)—with the clarification of one who has tasted it through actual witnessing (شهود حاصل). And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "(باب چوالیس: بہالیل (البهاليل) اور بہللہ (البہللہ) میں ان کے ائمہ کے بیان میں)\n\n(بسم الله الرحمن الرحيم)\n\nجب تم اطاعت میں رغبت رکھو\nتو اسے آئندہ کی پوشاک نہ پہناؤ\n\nاور اپنے حال میں بہالیل (البهاليل) کی طرح ہو جاؤ\nجو وقت کے ساتھ عاقل کی طرح چلتے ہیں\n\nاور حاصل شدہ خوشے کو جمع کر لو\nاور آنے والے کل تک صبر نہ کرو\n\nکیونکہ رزق کا ذخیرہ تیار کر دیا گیا ہے\nتاکہ وہ حاصل ہو جائے جو حاصل نہیں ہے\n\nاور جو فوت ہو گیا اس پر مت روؤ\nوہ تمہیں اس سے محروم کر دے گا جو حال میں ہے\n\nاور \"سوف\" (آئندہ) کے حکم کی طرف مت دیکھو\nاور نہ \"سین\" (مستقبل کی علامت) کی طرف، اور جانے والے کے ساتھ کوچ کر جاؤ\n\nشاید اگر تم عزم والے ہو\nاور مر گئے تو تمہیں بڑا فائدہ حاصل ہو جائے\n\nاور اس شخص سے کہو جو ہمیشہ سست رہا\nکہ تم نے شکاری کے جال میں ٹھوکر کھائی\n\nاور تمہارے ہاتھ نے وہ حاصل نہ کیا\nجو تم چاہتے تھے، پس اے سائل کی محرومی!\n\nاگر تمہارا فعل اس کے معاملے میں\nحذر کرنے والے اور ڈرنے والے جوان کے فعل جیسا ہوتا\n\nتو تم میرے اور اس شخص کے درمیان تمیز کر لیتے\nجو تمہارے لیے حق کو باطل کی طرح ظاہر کرتا ہے\n\n### [ذات حق کا اس شخص پر فجأت (فجأة) فرمانا جو اپنے باطن میں اس سے خلوت اختیار کرتا ہے]\n\nاللہ تعالیٰ فرماتا ہے: وَتَرَى النَّاسَ سُكارى‏ وما هُمْ بِسُكارى‏ (اور تم لوگوں کو دیکھو گے کہ وہ مدہوش ہیں، حالانکہ وہ مدہوش نہیں ہیں) [الحج: 2]۔ یہ اس لیے ہے کہ اللہ کے کچھ ایسے بندے ہیں جن کی عقلیں ان اعمال کے سبب پردے میں تھیں جن میں ذات حق (الحق) نے انہیں اپنی کتاب میں اور اپنے رسول صلی اللہ علیہ وسلم کی زبان پر شرعی طور پر تصرف کرنے کا مکلف بنایا اور ان کے لیے انہیں مشروع کیا۔ انہیں یہ علم نہیں تھا کہ ذات حق (الحق) اس شخص پر فجأت (فجأة) فرماتا ہے جو اپنے باطن میں اس سے خلوت اختیار کرتا ہے، اس کے حکم میں اس کی اطاعت کرتا ہے، اور اپنے قلب کو اس کے نور کے لیے تیار کرتا ہے، جہاں سے اسے شعور بھی نہیں ہوتا۔ تو ذات حق (الحق) نے غفلت کی حالت میں اس پر فجأت (فجأة) فرمائی، اور اس عظیم امر کے لیے عدم علم اور عدم تیاری کی حالت میں، تو اس کی عقل جانے والوں میں چلی گئی، اور اللہ تعالیٰ نے اس امر کو جو اس پر فجأت (فجأة) ہوا، اس کے لیے مشہود (مشہود) باقی رکھا۔ پس وہ اس میں سرگرداں ہو گیا اور اس کے ساتھ چل پڑا۔ تو وہ اپنی حیوانی روح (روح الحيواني) کے ساتھ اپنے عالمِ شہود (عالم شهادته) میں باقی رہا، کھاتا پیتا رہا اور اپنی حیوانی ضروریات میں اس حیوان کی طرح تصرف کرتا رہا جو اپنے محسوس منافع اور نقصانات کے علم پر فطرت میں پیدا کیا گیا ہے۔ یہ سب بغیر کسی تدبیر، غور و فکر یا حکمت کے ساتھ بات کرنے کے ہوتا ہے، نہ اسے اس حکمت کا علم ہوتا ہے اور نہ ہی وہ تمہارے لیے اس سے نفع کا ارادہ کرتا ہے تاکہ تم نصیحت حاصل کرو اور یاد کرو کہ امور تمہارے ہاتھ میں نہیں ہیں اور تم ایک حکیم کے تصرف سے چلائے جانے والے بندے ہو۔ ان لوگوں سے تکلیف (التكليف) ساقط ہو جاتی ہے کیونکہ ان کے پاس ایسی عقلیں نہیں ہیں جن سے وہ قبول کریں یا سمجھیں۔ تَرَاهُمْ يَنْظُرُونَ إِلَيْكَ وهُمْ لا يُبْصِرُونَ (تم انہیں دیکھو گے کہ وہ تمہاری طرف دیکھتے ہیں حالانکہ وہ نہیں دیکھتے)۔ خُذِ الْعَفْوَ (درگزر کرو) یعنی ان حکمتوں اور نصیحتوں میں سے جو اللہ ان کی زبانوں پر جاری کرتا ہے، ان میں سے صرف تھوڑا سا حصہ لے لو۔\n\n### [اللہ والوں میں سے عقلمند دیوانے (عقلاء المجانين)]\n\nاور یہی وہ لوگ ہیں جنہیں عقلمند دیوانے (عقلاء المجانين) کہا جاتا ہے۔ اس سے ان کا مطلب یہ ہوتا ہے کہ ان کا جنون کسی غذائی یا بھوک یا کسی اور کونی امر کے سبب مزاج کے فساد کی وجہ سے نہیں تھا، بلکہ یہ ان کے قلوب کے لیے ایک الٰہی جھلک (نجل إلهي) اور ذات حق (الحق) کی فجأت (فجأة) میں سے ایک فجأت (فجأة) کے سبب تھا جو ان پر وارد ہوئی اور ان کی عقلوں کو لے گئی۔ پس ان کی عقلیں اس کے پاس قید ہیں، اس کے شہود (شهود) سے نعمتیں پا رہی ہیں، اس کی بارگاہ (حضرته) میں اعتکاف کیے ہوئے ہیں، اور اس کے جمال میں سیر کر رہی ہیں۔ پس وہ بغیر عقلوں کے عقلوں والے ہیں۔ اور ظاہر میں وہ مجانین (المجانين) یعنی اپنی عقلوں کی تدبیر سے پردہ نشین ہونے والے کے نام سے جانے جاتے ہیں۔ اسی لیے انہیں عقلمند دیوانے (عقلاء المجانين) کہا گیا۔\n\nابو السعود بن الشبل البغدادی، جو اپنے زمانے کے عاقل تھے، سے پوچھا گیا کہ آپ اللہ والوں میں سے عقلمند دیوانوں (عقلاء المجانين) کے بارے میں کیا کہتے ہیں؟ تو انہوں نے فرمایا، اللہ ان سے راضی ہو، \"وہ نمکین ہیں اور ان میں سے عقلمند زیادہ نمکین ہیں۔\" ان سے پوچھا گیا کہ ہم حق کے دیوانوں کو دوسروں سے کیسے پہچانیں؟ تو انہوں نے فرمایا، \"حق کے دیوانوں پر قدرت کے آثار ظاہر ہوتے ہیں، اور عقلمندوں کے شہود (شهود) سے ذات حق (الحق) گواہی دیتا ہے۔\" یہ بات مجھے ان کے ساتھی ابو البدر التماسکی نے بتائی، اللہ ان پر رحم فرمائے، اور وہ ثقہ، ضابط اور جو کچھ نقل کرتے تھے اس کے عارف تھے، وہ \"واؤ\" کی جگہ \"فاء\" نہیں لگاتے تھے۔\n\nشیخ (ابن عربی) نے فرمایا: جس نے وہ سب دیکھا جو انہوں نے دیکھا اور اپنی عقل کو باقی رکھا، تو وہ زیادہ بہتر اور زیادہ مضبوط ہے، کیونکہ اسے قائم کیا گیا ہے اور اسے تقریباً اتنی ہی قوت دی گئی ہے جتنی رسولوں (الرسل) کو دی گئی تھی۔\n\n### [رب کا ظہور (تجلی) اور قلب کے پہاڑ کا ریزہ ریزہ ہو جانا]\n\nاور اگر وہ فجأت (الفجئات) کے وقت بدل جاتے تھے، تو ہمیں معلوم ہے کہ جب رسول اللہ صلی اللہ علیہ وسلم پر وحی کی فجأت (فجأة) ہوئی تو آپ پر اس سے رعب طاری ہو گیا، تو آپ خدیجہ رضی اللہ عنہا کے پاس آئے، آپ کے پہلو کانپ رہے تھے، اور آپ نے فرمایا: زملوني زملوني (مجھے کمبل اوڑھا دو، مجھے کمبل اوڑھا دو)۔\n\nاور یہ ایک فرشتے کے ظہور (تجلی) سے تھا، تو اس بادشاہ کے ظہور (تجلی) سے کیا حال ہو گا؟ فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا وخَرَّ مُوسى‏ صَعِقاً (پھر جب ان کے رب نے پہاڑ پر ظہور (تجلی) فرمایا تو اسے ریزہ ریزہ کر دیا اور موسیٰ بے ہوش ہو کر گر پڑے) [الأعراف: 143]۔\n\nاور رسول اللہ صلی اللہ علیہ وسلم کو جب وحی آتی تھی اور روح الامین آپ کے قلب پر اسے لے کر نازل ہوتے تھے، تو آپ اپنے حواس سے غائب ہو جاتے تھے، اور اونٹ کی طرح بلبلاتے تھے یہاں تک کہ وہ آپ سے جدا ہو جاتا۔ اور آپ نے جو کچھ وہ لایا تھا اسے یاد کر لیا ہوتا تھا، پھر آپ اسے حاضرین تک پہنچاتے اور سننے والوں کو اس کی تبلیغ کرتے تھے۔\n\nپس آپ صلی اللہ علیہ وسلم کے رب کے ظہور (تجلیات) سے آپ کے قلب پر جو واردات ہوتے تھے، وہ فرشتے کے نزول سے زیادہ عظیم سطوت والے ہوتے تھے، اور یہ وارد اس وقت ہوتا تھا جب آپ کے رب کے سوا کوئی آپ کو اپنے اندر سمو نہیں سکتا تھا، لیکن آپ اس ہول کے لیے منتظر اور تیار تھے۔ اس کے باوجود آپ اپنے نفس سے غائب ہو جاتے تھے۔ اگر آپ رسول نہ ہوتے اور رسالت کی تبلیغ اور امت کی سیاست کے مطلوب نہ ہوتے، تو اللہ رسولوں کی عقلوں کو بھی لے جاتا، اس عظمت کی وجہ سے جو وہ دیکھتے ہیں۔ پس اللہ القوی المتین نے انہیں ایسی قوت سے متمکن کیا کہ وہ ذات حق (الحق) کی طرف سے آنے والے کو قبول کر سکیں، اسے لوگوں تک پہنچا سکیں اور اس پر عمل کر سکیں۔\n\n### [واردات الٰہیہ کو قبول کرنے میں لوگوں کے مراتب]\n\nپس جان لو کہ اس مقام پر لوگ تین مراتب میں سے کسی ایک پر ہیں:\n\n۱۔ ان میں سے کچھ ایسے ہیں جن کا وارد (وارد) ان کی اندرونی قوت سے زیادہ عظیم ہوتا ہے، تو وارد (وارد) ان پر حکم کرتا ہے اور حال (الحال) ان پر غالب آ جاتا ہے، تو وہ اس کے حکم میں ہوتے ہیں، حال (الحال) انہیں چلاتا ہے اور جب تک وہ اس حال (الحال) میں رہتے ہیں ان کا اپنے نفس میں کوئی تدبیر نہیں ہوتا۔ اگر یہ ان پر آخری عمر تک جاری رہے تو اس طریقے میں اسے جنون (الجنون) کہا جاتا ہے، جیسے ابو عقال مغربی۔\n\n۲۔ اور ان میں سے کچھ ایسے ہیں جن کی عقل وہاں رک جاتی ہے اور ان کی حیوانی عقل باقی رہتی ہے، تو وہ بغیر کسی تدبیر اور غور و فکر کے کھاتے پیتے اور تصرف کرتے ہیں۔ یہ لوگ عقلمند دیوانے (عقلاء المجانين) کہلاتے ہیں کیونکہ وہ دیگر حیوانات کی طرح طبعی زندگی گزارتے ہیں۔ لیکن ابو عقال جیسے لوگ کلی طور پر مأخوذ (لے لیے گئے) دیوانے تھے، اسی لیے جب سے انہیں لیا گیا تاوقتیکہ وہ فوت ہوئے، انہوں نے نہ کھایا نہ پیا، اور یہ مکہ میں چار سال کی مدت میں ہوا۔ پس وہ مجنون (مجنون) ہیں، یعنی اپنے عالمِ حس سے مکمل طور پر پردہ نشین ہیں۔\n\n۳۔ اور ان میں سے کچھ ایسے ہیں جن پر اس وارد (وارد) کا حکم دائمی نہیں رہتا، تو حال (الحال) ان سے زائل ہو جاتا ہے اور وہ اپنی عقل کے ساتھ لوگوں کی طرف لوٹ آتے ہیں، تو اپنے معاملے کی تدبیر کرتے ہیں، جو کہتے ہیں اور جو ان سے کہا جاتا ہے اسے سمجھتے ہیں، اور ہر انسان کی طرح تدبیر اور غور و فکر سے تصرف کرتے ہیں۔ اور یہ نبی اور اولیاء میں سے احوال (الأحوال) والے ہیں۔\n\n۴۔ اور ان میں سے کچھ ایسے ہیں جن کا وارد (وارد) اور ظہور (تجلی) ان کی قوت کے برابر ہوتا ہے، تو ان پر اس کا کوئی غالب اثر نظر نہیں آتا، لیکن جب وہ دیکھتے ہیں کہ کوئی امر ان پر طاری ہوا ہے تو انہیں ایک خفیف شعور ہوتا ہے۔ کیونکہ اس شخص کے لیے ضروری ہے کہ وہ اس وارد (وارد) کی طرف کان لگائے تاکہ وہ ذات حق (الحق) کی طرف سے جو کچھ لایا ہے اسے لے لے۔ پس اس کا حال اس شخص جیسا ہے جو تمہارے ساتھ گفتگو میں ہو، پھر کوئی دوسرا شخص بادشاہ کی طرف سے کوئی حکم لے کر اس کے پاس آئے، تو وہ تمہارے ساتھ گفتگو چھوڑ دیتا ہے اور اس شخص کی بات کی طرف کان لگاتا ہے۔ جب وہ اپنا پیغام پہنچا دیتا ہے تو وہ تمہاری طرف لوٹ آتا ہے اور تم سے بات کرتا ہے۔ اگر تمہاری آنکھ اسے نہ دیکھتی اور تم اسے کسی امر کی طرف کان لگاتے ہوئے دیکھتے تو تمہیں شعور ہوتا کہ کوئی امر ہے جس نے اسے تم سے مشغول کر دیا ہے۔ جیسے کوئی شخص تم سے بات کر رہا ہو اور اسے کسی معاملے میں فکر آ جائے، تو وہ اپنے حواس کو اپنے خیال میں اس کی طرف پھیر دیتا ہے، اور اس کی آنکھ اور نظر جم جاتی ہے، اور تم اس سے بات کر رہے ہوتے ہو، تو تم اسے دیکھتے ہو کہ وہ تمہاری بات قبول نہیں کر رہا، تو تمہیں شعور ہوتا ہے کہ اس کا باطن کسی دوسرے معاملے میں متفکر ہے جو تمہارے معاملے کے خلاف ہے۔\n\n۵۔ اور ان میں سے کچھ ایسے ہیں جن کی قوت وارد (وارد) سے زیادہ قوی ہوتی ہے، تو جب وارد (وارد) ان کے پاس آتا ہے اور وہ تمہارے ساتھ گفتگو میں ہوتے ہیں، تو تمہیں اس کا شعور نہیں ہوتا، اور وہ وارد (وارد) سے وہ سب لے رہے ہوتے ہیں جو ان پر ڈالا جاتا ہے، اور تم سے وہ سب لے رہے ہوتے ہیں جو تم ان سے بات کر رہے ہو یا وہ تم سے بات کر رہے ہیں۔\n\nاور ذات حق (الحق) کے واردات (واردات) میں اہل اس طریقے کے قلوب پر کوئی چوتھا امر نہیں ہے۔ یہ ایک ایسا مسئلہ ہے جس میں بعض اہل طریق نے نبی اور ولی کے فرق میں غلطی کی، اور کہا کہ انبیاء احوال (الأحوال) کو چلاتے ہیں اور اولیاء کو احوال (الأحوال) چلاتے ہیں۔ پس انبیاء اپنے احوال (الأحوال) کے مالک ہوتے ہیں اور اولیاء اپنے احوال (الأحوال) کے مملوک ہوتے ہیں۔ حالانکہ معاملہ وہی ہے جو ہم نے تمہارے لیے تفصیل سے بیان کر دیا ہے۔ اور ہم نے تمہیں یہ بھی بیان کر دیا ہے کہ رسول کیوں لوٹ آتا ہے اور اس کی عقل کیوں محفوظ رہتی ہے، باوجود اس کے کہ وحی نازل ہونے کے وقت ذات حق (الحق) کے وارد (وارد) پر وہ اپنے حواس سے غائب ہو جاتا ہے۔ پس اسے سمجھو اور اس کی تحقیق کرو۔\n\n### [عقلمند دیوانوں (عقلاء المجانين) کے نوادر]\n\nاور ہم نے ان میں سے ایک جماعت سے ملاقات کی اور ان کے ساتھ رہے اور ان کے فوائد سے اکتساب کیا۔ اور میں ان میں سے ایک کے پاس کھڑا تھا اور لوگ اس کے گرد جمع تھے، اور وہ ان کی طرف دیکھ رہا تھا اور ان سے کہہ رہا تھا: \"اے مسکینوں! اللہ کی اطاعت کرو، کیونکہ تم مٹی سے پیدا کیے گئے ہو، اور مجھے تم پر خوف ہے کہ آگ ان برتنوں کو پکا دے گی اور انہیں فخار (پکی ہوئی مٹی) بنا دے گی۔ کیا تم نے کبھی مٹی کے برتن کو بغیر آگ کے پکائے فخار (پکی ہوئی مٹی) بنتے دیکھا ہے؟ اے مسکینوں! ابلیس تمہیں اس بات سے دھوکہ نہ دے کہ وہ تمہارے ساتھ آگ میں داخل ہو گا اور تم کہو گے کہ اللہ فرماتا ہے: لَأَمْلَأَنَّ جَهَنَّمَ مِنْكَ ومِمَّنْ تَبِعَكَ مِنْهُمْ أَجْمَعِينَ (میں ضرور جہنم کو تجھ سے اور ان سب سے بھر دوں گا جو ان میں سے تیری پیروی کریں گے) [ص: 85]۔ ابلیس کو اللہ نے آگ سے پیدا کیا ہے، پس وہ اپنی اصل کی طرف لوٹ جائے گا، اور تم مٹی سے ہو، آگ تمہارے جوڑوں پر حکومت کرے گی۔ اے مسکینوں! ابلیس کو خطاب کرتے ہوئے ذات حق (الحق) کے اشارے کو دیکھو، اس کے قول میں: لَأَمْلَأَنَّ جَهَنَّمَ مِنْكَ (میں ضرور جہنم کو تجھ سے بھر دوں گا)۔ اور یہاں رک جاؤ اور اس کے بعد مت پڑھو۔\"\n\nتو اس نے کہا: \"جہنم تجھ سے ہے، اور یہ اس کا قول ہے: خَلَقَ الْجَانَّ من مارِجٍ من نارٍ (اور جنات کو آگ کے شعلے سے پیدا کیا) [الرحمن: 15]۔ پس جو اپنے گھر میں داخل ہو اور اپنے ٹھکانے پر آئے اور اپنے اہل سے ملے، وہ اس اجنبی کی طرح نہیں ہے جو اس پر وارد ہوتا ہے۔ پس وہ اس چیز کی طرف لوٹ گیا جس پر اس نے فخر کیا تھا: قَالَ أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي من نارٍ (اس نے کہا: میں اس سے بہتر ہوں، تو نے مجھے آگ سے پیدا کیا) [ص: 76]۔ پس اس کی خوشی اپنی اصل کی طرف لوٹنا ہے، اور تم، اے بدبختو! تمہاری مٹی آگ پر فخر کرتی ہے، پس ابلیس کی بات نہ سنو اور نہ اس کی اطاعت کرو، اور نور کی جگہ کی طرف بھاگو تاکہ تم کامیاب ہو جاؤ۔ اے مسکینوں! تم اندھے ہو، تم وہ نہیں دیکھتے جو میں دیکھتا ہوں۔ تم کہتے ہو کہ اس مسجد کی چھت کو صرف یہ ستون تھامے ہوئے ہیں۔ تم انہیں سنگ مرمر کے ستون دیکھتے ہو، اور میں انہیں مرد دیکھتا ہوں جو اللہ کا ذکر کرتے ہیں اور اس کی تمجید کرتے ہیں۔ آسمان مردوں کے ذریعے قائم ہیں، تو یہ مسجد کیسے (قائم نہیں ہو گی)؟ مجھے نہیں معلوم، یا تو میں ہی اندھا ہوں جو ستونوں کو پتھر نہیں دیکھتا، یا تم ہی اندھے ہو جو ان ستونوں کو مرد نہیں دیکھتے۔ اللہ کی قسم، اے میرے بھائیو! مجھے نہیں معلوم، نہیں، اللہ کی قسم، تم ہی اندھے ہو۔\"\n\nپھر اس نے جماعت کو چھوڑ کر مجھے گواہ بنایا اور کہا: \"اے جوان! کیا میں حق نہیں کہہ رہا؟\" میں نے کہا: \"کیوں نہیں!\" پھر میں اس کے پہلو میں بیٹھ گیا۔ تو وہ ہنسنے لگا اور کہا: \"اے لوگو! بدبودار سرین ایک دوسرے کے لیے سیٹی بجاتے ہیں، اور یہ جوان میری طرح بدبودار ہے، اسی مناسبت نے اسے میرے پہلو میں بٹھا دیا اور میری تصدیق کرنے پر مجبور کر دیا۔ تم اس وقت اسے عاقل سمجھ رہے ہو اور میں مجنون ہوں، حالانکہ یہ مجھ سے کہیں زیادہ دیوانہ ہے۔ لیکن تم ایسے ہو کہ جیسے اللہ نے تمہیں ان ستونوں کو مرد دیکھنے سے اندھا کر دیا ہے، ویسے ہی تمہیں اس جوان کے جنون سے بھی اندھا کر دیا ہے۔\"\n\nپھر اس نے میرا ہاتھ پکڑا اور کہا: \"اٹھو، ہمیں ان لوگوں سے دور لے چلو۔\" تو میں اس کے ساتھ باہر نکلا۔ جب وہ لوگوں سے جدا ہوا تو اس نے میرا ہاتھ چھوڑ دیا اور مجھ سے منہ موڑ لیا۔ اور وہ ان سب سے بڑے معتوہین (عقلی طور پر کمزور) میں سے تھا جن سے میں ملا ہوں۔ جب میں اس سے پوچھتا تھا کہ تمہاری عقل کو کیا لے گیا؟ تو وہ مجھے کہتا تھا: \"تم ہی اصل میں مجنون ہو، اگر میرے پاس عقل ہوتی تو تم مجھ سے کہتے کہ تمہاری عقل کو کیا لے گیا؟ میری عقل کہاں ہے کہ وہ تم سے مخاطب ہو؟ وہ اسے اپنے ساتھ لے گیا ہے، مجھے نہیں معلوم کہ وہ اس کے ساتھ کیا کرتا ہے، اور مجھے یہاں چوپایوں کے زمرے میں چھوڑ دیا ہے، میں کھاتا پیتا ہوں اور وہ میری تدبیر کرتا ہے۔\" میں نے اس سے کہا: \"اگر تم چوپایہ ہو تو تمہیں کون سوار کرتا ہے؟\" اس نے کہا: \"میں وحشی چوپایہ ہوں، میں سوار نہیں ہوتا۔\" تو میں سمجھ گیا کہ وہ عالمِ انس (عالم الإنس) سے اپنے نکل جانے کا ارادہ کر رہا ہے اور یہ کہ وہ معرفت (المعرفۃ) کے بیابانوں میں ہے، پس انسانوں کا کوئی حکم اس پر نہیں چلتا۔ اور اسی طرح وہ بچوں اور دوسروں کی اذیت سے محفوظ رہتا تھا۔ وہ بہت خاموش، ہمیشہ مبہوت (حیران) اور دائمی غور و فکر میں رہتا تھا۔ وہ مسجد کو لازم رکھتا تھا اور اوقات پر نماز پڑھتا تھا۔\n\nکبھی میں اس سے پوچھتا تھا جب میں اسے نماز پڑھتے دیکھتا تھا، میں کہتا تھا: \"میں تمہیں نماز پڑھتے دیکھتا ہوں۔\" تو وہ مجھے کہتا تھا: \"نہیں، اللہ کی قسم! میں تو اسے دیکھتا ہوں کہ وہ مجھے کھڑا کرتا ہے اور بٹھاتا ہے، مجھے نہیں معلوم کہ وہ مجھ سے کیا چاہتا ہے۔\" میں اس سے کہتا تھا: \"تو کیا تم اپنی اس نماز میں اللہ کے فرض کردہ کو ادا کرنے کی نیت کرتے ہو؟\" تو وہ مجھے کہتا تھا: \"نیت کیا ہوتی ہے؟\" میں کہتا تھا: \"ان اعمال سے اس کی قربت کا ارادہ کرنا۔\" تو وہ ہنستا تھا اور کہتا تھا: \"میں کہتا ہوں کہ میں اسے دیکھتا ہوں کہ وہ مجھے کھڑا کرتا ہے اور بٹھاتا ہے، تو میں اس کی قربت کی نیت کیسے کروں جو میرے ساتھ ہے اور میں اس کا شہود (شهود) کرتا ہوں اور وہ مجھ سے غائب نہیں ہوتا؟ یہ دیوانوں کی باتیں ہیں، تمہارے پاس عقلیں نہیں ہیں۔\"\n\n### [حق کے دیوانوں کے رنگ]\n\nپھر تمہیں معلوم ہونا چاہیے کہ یہ بہالیل (البهاليل)، جیسے متقدمین میں بہلول اور سعدون، اور ابو وہب الفاضل اور ان جیسے لوگ، ان میں سے کچھ مسرور (خوش) ہوتے ہیں اور کچھ محزون (غمگین) ہوتے ہیں۔ اور وہ اس میں اس پہلے وارد (وارد) کے مطابق ہوتے ہیں جس نے ان کی عقلوں کو لے لیا۔\n\nاگر وارد (وارد) قہر (غلبہ) کا ہو تو وہ انہیں قبض (قبض) میں لے لیتا ہے، جیسے یعقوب الکورانی جو الجسر الابیض میں تھے، میں نے انہیں دیکھا اور وہ اسی قدم پر تھے۔ اور اسی طرح مسعود الحبشی کو میں نے دمشق میں دیکھا، جو قبض (قبض) اور بسط (بسط) کے درمیان ملے جلے تھے، اور ان پر بہتان (حیرت) غالب تھی۔\n\nاور اگر وارد (وارد) لطف کا ہو تو وہ انہیں بسط (بسط) میں لے لیتا ہے، میں نے اس صنف میں سے ایک جماعت کو دیکھا، جیسے ابو الحجاج الغلیری اور ابو الحسن علی السلاوی۔ اور لوگ نہیں جانتے کہ ان کی عقلوں کو کیا لے گیا ہے۔ جس چیز کا ان پر ظہور (تجلی) ہوا اس نے انہیں اپنے نفوس کی تدبیر سے مشغول کر دیا ہے۔ پس اللہ نے مخلوق کو ان کے لیے مسخر کر دیا ہے، تو وہ خوش دلی سے ان کے مفادات میں مشغول رہتے ہیں۔ اور لوگوں کے لیے سب سے زیادہ لذیذ یہ ہوتا ہے کہ ان میں سے کوئی ان کے پاس کھائے یا ان سے کوئی کپڑا قبول کر لے، یہ ایک الٰہی تسخیر ہے۔ پس اللہ نے ان کے لیے دونوں راحتیں جمع کر دیں، جہاں وہ جو چاہتے ہیں کھاتے ہیں اور ان کا کوئی حساب نہیں ہوتا اور نہ ان سے کوئی سوال کیا جاتا ہے، اور اللہ نے لوگوں کے دلوں میں ان کے لیے قبولیت، محبت اور شفقت پیدا کر دی، اور وہ تکلیف (التكليف) سے فارغ ہو گئے۔ اور ان کے لیے اللہ کے ہاں اس شخص کا اجر ہے جس نے اپنی عمر کی مدت میں بہترین عمل کیا، جو بغیر عمل کے گزر گئی، کیونکہ اللہ سبحانہ و تعالیٰ ہی ہے جس نے انہیں اپنی طرف لے لیا، تو اس نے ان پر ان اعمال کے نتائج کو محفوظ رکھا جو اگر ان کی عقلیں نہ لی جاتیں تو وہ خیر کے کام کرتے، جیسے وہ شخص جو وضو کے ساتھ سویا اور اس کے دل میں تھا کہ وہ رات کو اٹھ کر نماز پڑھے گا، پھر اللہ اس کی روح کو لے لیتا ہے اور وہ صبح تک سوتا رہتا ہے، تو اللہ اس کے لیے پوری رات قیام کرنے والے کا اجر لکھتا ہے، کیونکہ اللہ ہی ہے جس نے اسے نیند کی حالت میں اپنے پاس روکے رکھا۔\n\nپس ان میں سے جو تکلیف (التكليف) کا مخاطب ہے، یعنی ان کی روح، وہ ذات حق (الحق) کے شہود (شهود) میں غائب ہے جس کا تسلط ان میں ظاہر ہوا ہے۔ پس ان کے پاس باہر سے سننے کو محفوظ رکھنے اور جو کچھ اس کے ذریعے آیا ہے اسے سمجھنے کے لیے کوئی سننے والا کان نہیں ہے۔\n\n### [ابن عربی مقام بہللہ (البهللة) میں]\n\nاور میں نے بھی اس مقام (المقام) کا ذائقہ چکھا ہے اور مجھ پر ایک وقت ایسا گزرا ہے کہ میں پانچوں نمازیں جماعت کے ساتھ امامت میں ادا کرتا تھا، جیسا کہ مجھے بتایا گیا، رکوع، سجدہ اور نماز کے تمام افعال و اقوال کو مکمل کرتے ہوئے، اور میں اس سب میں اس کا کوئی علم نہیں رکھتا تھا، نہ جماعت کا، نہ جگہ کا، نہ حال (الحال) کا، اور نہ عالمِ حس کی کسی چیز کا، ایک ایسے شہود (شهود) کی وجہ سے جو غالب آ گیا تھا، جس میں میں اپنے آپ سے اور دوسروں سے غائب تھا۔ اور مجھے بتایا گیا کہ جب نماز کا وقت داخل ہوتا تھا تو میں نماز کھڑی کرتا تھا اور لوگوں کو نماز پڑھاتا تھا۔ پس میرا حال سونے والے کی حرکات جیسا تھا اور اسے اس کا علم نہیں ہوتا تھا۔\n\nتو میں نے جانا کہ اللہ نے میرے وقت کو محفوظ رکھا اور میری زبان پر کوئی گناہ جاری نہیں کیا، جیسا کہ شبلی کے ساتھ ان کی دیوانگی میں ہوا، لیکن شبلی نماز کے اوقات میں لوٹ آتے تھے، جیسا کہ ان سے روایت کیا گیا ہے، تو مجھے نہیں معلوم کہ وہ اپنے لوٹنے کو سمجھتے تھے یا میرا جیسا حال تھا، کیونکہ راوی نے تفصیل نہیں بتائی۔ جب جنید سے ان کے بارے میں پوچھا گیا تو انہوں نے کہا: \"الحمد للہ کہ اس کی زبان پر کوئی گناہ جاری نہیں ہوا۔\"\n\nلیکن میں اپنی غیبت (غيبتي) کے اوقات میں اپنی ذات (ذاتی) کو نورِ اعم (النور الأعم) اور عرش عظیم پر تجلیِ اعظم (التجلی الأعظم) میں نماز پڑھتے ہوئے دیکھتا تھا، اور میں حرکت سے عاری، اپنے نفس سے الگ تھلگ ہوتا تھا، اور میں اسے اپنے سامنے رکوع اور سجدہ کرتے ہوئے دیکھتا تھا، اور میں جانتا تھا کہ وہ رکوع اور سجدہ کرنے والا میں ہی ہوں، جیسے سونے والا دیکھتا ہے اور میرا ہاتھ میری پیشانی پر ہوتا تھا۔ اور میں اس پر تعجب کرتا تھا اور جانتا تھا کہ وہ میرے سوا کوئی اور نہیں ہے اور نہ ہی وہ میں ہوں۔ اور وہیں سے میں نے مکلف (المكلف) اور تکلیف (التكليف) کو جانا۔ اور مکلف (المكلف) اسم فاعل بھی ہے اور اسم مفعول بھی۔\n\nپس میں نے تمہیں ان الٰہی دیوانوں میں سے مأخوذین (جن کی عقلیں لے لی گئی ہیں) کے حال کو ایک ذائقہ چکھنے والے کے بیان سے واضح کر دیا ہے جو حاصل شدہ شہود (شهود) رکھتا ہے۔ وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏ (اور اللہ حق فرماتا ہے اور وہی سیدھی راہ دکھاتا ہے) [الأحزاب: 4]۔",
    "fa": "باب چهل و چهارم در باب بهالیل و پیشوایان ایشان در بهلله (Bahlala)\n\n(بسم الله الرحمن الرحيم)\n\n> اگر مشتاق طاعتی هستی، *** پس جامه تأخیر بر آن مپوشان.\n> و در حال خود مانند بهالیل باش، *** که با زمان همچون عاقلان پیش می‌روند.\n> و از خوشه‌ی رسیده، دانه جمع کن، *** و تا سال آینده صبر مکن.\n> زیرا انبار روزی آماده شده است، *** تا آنچه حاصل نیست، حاصل شود.\n> و بر از دست رفته‌ای گریه مکن، *** که آنچه در این دنیاست، تو را از دست می‌دهد.\n> و به حکم «سوف» (آینده) و حرف «سین» (نشانه‌ی آینده) توجه مکن، و با کوچ‌کننده کوچ کن.\n> شاید اگر صاحب عزم باشی، *** و بمیری، به مقصودی دست یابی.\n> و به کسی که پیوسته سست است بگو: *** در دام صیاد گرفتار شدی.\n> و دست شما به آنچه می‌خواهید نرسید، *** پس ای ناامیدی سائل!\n> اگر عمل تو در کار حق، *** مانند عمل جوان محتاط و ترسان بود،\n> میان من و کسی که حق را چون باطل بر تو آشکار می‌کند، تمایز می‌گذاشتی.\n\n### [تجلیات ناگهانی حق برای کسی که در سرّ خود با او خلوت کرده است]\n\nخداوند متعال می‌فرماید: وَتَرَى النَّاسَ سُكارى‏ وما هُمْ بِسُكارى‏ (و مردم را مست می‌بینی، در حالی که مست نیستند). این بدان سبب است که خداوند اقوامی دارد که عقل‌هایشان در حجاب اعمالی بود که حق تعالی در کتابش و بر زبان رسولش (صلی الله علیه و سلم) آنان را شرعاً به تصرف در آن‌ها مکلف کرده بود و برایشان تشریع نموده بود. آنان علمی نداشتند به اینکه حق تعالی برای کسی که در سرّ خود با او خلوت کند و در امرش او را اطاعت نماید و قلبش را برای نور او آماده سازد، ناگهان تجلی می‌کند، از جایی که او خبر ندارد. پس حق (الحق) ناگهان در غفلت و بی‌خبری و عدم آمادگی او برای آن امر هولناک بر او تجلی می‌کند و عقل او را در میان عقل‌های از دست رفته می‌برد. و حق تعالی آن امری را که ناگهان بر او تجلی کرده، برایش مشهود باقی می‌گذارد. پس او در آن حیران و سرگردان می‌شود و با آن پیش می‌رود. او در عالم شهود (الشهود) خود با روح حیوانی‌اش باقی می‌ماند، می‌خورد و می‌نوشد و در ضروریات حیوانی خود تصرف می‌کند، تصرف حیوانی که بر علم به منافع محسوس و مضراتش مفطور شده است، بدون تدبیر، بدون اندیشه و بدون فکری که به حکمت سخن بگوید، و او علمی به آن ندارد و قصد ندارد که با آن به تو نفعی برساند تا پند گیری و متذکر شوی که امور به دست تو نیست و تو بنده‌ای هستی که به تدبیر حکیمی اداره می‌شوی. و تکلیف از اینان ساقط است، زیرا عقل‌هایی ندارند که با آن بپذیرند و با آن بفهمند. تَراهُمْ يَنْظُرُونَ إِلَيْكَ وهُمْ لا يُبْصِرُونَ (آنان را می‌بینی که به تو می‌نگرند، در حالی که نمی‌بینند). خذ العفو (عفو را بگیر)، یعنی اندکی از حکمت‌ها و موعظه‌هایی که خداوند بر زبان آنان جاری می‌سازد.\n\n### [عاقلان دیوانه از اهل الله]\n\nاینان همان کسانی هستند که «عاقلان دیوانه» نامیده می‌شوند. منظورشان این است که جنونشان ناشی از فساد مزاج به دلیل امری طبیعی مانند غذا یا گرسنگی یا غیر آن نبوده است، بلکه ناشی از تجلی (التجلی) الهی بر قلب‌هایشان و تجلی ناگهانی از تجلیات حق (الحق) بوده که بر آنان وارد شده و عقل‌هایشان را برده است. پس عقل‌هایشان نزد حق محبوس است، در شهود (الشهود) او متنعم است، در حضرت او معتکف است و در جمال او سیر می‌کند. بنابراین، آنان صاحبان عقل‌هایی هستند بدون عقل (ظاهری) و در ظاهر به دیوانگان معروف شده‌اند، یعنی کسانی که از تدبیر عقل‌هایشان پوشیده شده‌اند. به همین دلیل «عاقلان دیوانه» نامیده شدند. از ابوالسعود بن الشبل بغدادی، عاقل زمان خود، پرسیده شد: درباره‌ی عاقلان دیوانه از اهل الله چه می‌گویی؟ او (رضی الله عنه) گفت: او (بهلول) نمکین است و عاقلانشان نمکین‌ترند. به او گفته شد: پس دیوانگان حق را از غیر آنان به چه چیز بشناسیم؟ گفت: آثار قدرت بر دیوانگان حق ظاهر می‌شود و عاقلان، حق را با شهود خود شهود می‌کنند. این را صاحبش ابوالبدر التماسکی (رحمه الله) به من خبر داد. او فردی مورد اعتماد، دقیق و آگاه به آنچه نقل می‌کرد بود و «فاء» را به جای «واو» نمی‌گذاشت. شیخ گفت: کسی که آنچه را آنان شهود کردند، شهود کند و عقلش بر او باقی بماند، بهتر و استوارتر است، زیرا او برپا داشته شده و از قوّتی نزدیک به آنچه به رسولان داده شده، برخوردار گشته است.\n\n### [تجلی پروردگار و متلاشی شدن کوه قلب]\n\nو اگر در وقت تجلیات ناگهانی دگرگون شدند، ما می‌دانیم که رسول خدا (صلی الله علیه و سلم) هنگامی که وحی ناگهان بر او وارد می‌شد، از آن به وحشت می‌افتاد، نزد خدیجه می‌آمد در حالی که عضلاتش می‌لرزید و می‌گفت: زملوني زملوني (مرا بپوشانید، مرا بپوشانید).\nو این از تجلی یک فرشته بود، پس چگونه خواهد بود تجلی ملک (خداوند)؟ فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا وخَرَّ مُوسى‏ صَعِقاً (پس چون پروردگارش بر کوه تجلی کرد، آن را متلاشی ساخت و موسی مدهوش بر زمین افتاد). و رسول خدا (صلی الله علیه و سلم) هنگامی که وحی بر او می‌آمد و روح‌الامین بر قلبش نازل می‌شد، از حس خود خارج می‌شد و به خواب می‌رفت و مانند شتر نر صدا می‌کرد تا اینکه از او جدا می‌شد، در حالی که آنچه را آورده بود، حفظ کرده بود. سپس آن را بر حاضران القا می‌کرد و به شنوندگان می‌رساند.\nپس واردات (مواجد) پیامبر (صلی الله علیه و سلم) از تجلیات (التجلی) پروردگارش بر قلب او، سطوت و غلبه‌ای عظیم‌تر از نزول فرشته داشت، و این وارد در زمانی بود که جز پروردگارش کسی او را در خود جای نمی‌داد. اما او منتظر و آماده‌ی آن هول بود. با این حال، از خود بی‌خود می‌شد. اگر او رسولی نبود که مأمور به ابلاغ رسالت و سیاست امت باشد، خداوند عقل‌های رسولان را به دلیل عظمت آنچه مشاهده می‌کنند، می‌برد. پس خداوند قوی و متین، آنان را به قوّتی متمکن ساخت که بتوانند آنچه از حق (الحق) بر آنان وارد می‌شود را بپذیرند و به مردم برسانند و به آن عمل کنند.\n\n### [مراتب مردم در پذیرش واردات الهی]\n\nبدان که مردم در این مقام بر یکی از سه مرتبه هستند:\nاز آنان کسی است که وارد (الوارد) او عظیم‌تر از قوّتی است که در نفس خود بر آن است. پس وارد بر او حکم می‌راند و حال بر او غلبه می‌کند. او تحت حکم آن حال قرار می‌گیرد و تا زمانی که در آن حال است، تدبیری از خود ندارد. اگر این حال تا پایان عمر بر او مستمر باشد، او همان کسی است که در این طریقت به جنون (دیوانگی) نامیده می‌شود، مانند ابوعقال مغربی.\nو از آنان کسی است که عقلش در آنجا (نزد حق) نگه داشته می‌شود و عقل حیوانی‌اش بر او باقی می‌ماند. پس می‌خورد و می‌نوشد و بدون تدبیر و اندیشه تصرف می‌کند. اینان «عاقلان دیوانه» نامیده می‌شوند، زیرا زندگی طبیعی را مانند سایر حیوانات می‌گذرانند. اما کسی مانند ابوعقال، دیوانه‌ای است که به کلی از خود گرفته شده است. به همین دلیل، از زمانی که گرفته شد تا زمانی که درگذشت، در مدت چهار سال در مکه، چیزی نخورد و ننوشید. پس او مجنون (مستور) مطلق از عالم حس خود است.\nو از آنان کسی است که حکم آن وارد برایش دوام نمی‌یابد و حال از او زایل می‌شود. پس با عقل خود به سوی مردم باز می‌گردد و کار خود را تدبیر می‌کند و آنچه را می‌گوید و به او گفته می‌شود، می‌فهمد و با تدبیر و اندیشه مانند هر انسانی تصرف می‌کند. و این همان پیامبر و صاحبان احوال از اولیا هستند.\nو از آنان کسی است که وارد و تجلی (التجلی) او مساوی با قوّت اوست. پس هیچ اثری از آن حاکم بر او دیده نمی‌شود، اما هنگامی که می‌بیند که امری بر او عارض شده است، احساسی خفیف پیدا می‌کند. زیرا برای این شخص لازم است که به آن وارد گوش فرا دهد تا آنچه را از نزد حق برایش آمده، از او بگیرد. حال او مانند حال همنشین توست که با تو در حال گفتگو است، سپس شخص دیگری برای امری از جانب پادشاه نزد او می‌آید. او گفتگوی با تو را رها می‌کند و به آنچه آن شخص به او می‌گوید، گوش می‌دهد. وقتی آنچه را نزد اوست رساند، به سوی تو باز می‌گردد و با تو سخن می‌گوید. اگر چشمت او را نمی‌دید و می‌دیدی که به امری گوش می‌دهد، احساس می‌کردی که امری او را از تو مشغول کرده است. مانند مردی که با تو سخن می‌گوید و فکری او را درگیر می‌کند، پس حس خود را در خیالش متوجه آن می‌کند و چشم و نگاهش ثابت می‌ماند، در حالی که تو با او سخن می‌گویی. تو به او نگاه می‌کنی و می‌بینی که سخن تو را نمی‌پذیرد، پس احساس می‌کنی که باطن او در اندیشه‌ی امری دیگر خلاف آنچه تو در آن هستی، است.\nو از آنان کسی است که قوّتش قوی‌تر از وارد است. پس اگر وارد بر او بیاید، در حالی که با تو در حال گفتگو است، تو متوجه نمی‌شوی و او از وارد آنچه را به او القا می‌شود، می‌گیرد و از تو نیز آنچه را که با او سخن می‌گویی یا او با تو سخن می‌گوید، می‌گیرد.\nو امر چهارمی در واردات حق (الحق) بر قلب‌های اهل این طریقت وجود ندارد. این مسئله‌ای است که برخی از اهل طریقت در فرق بین نبی و ولی در آن دچار اشتباه شده‌اند و گفته‌اند: انبیا احوال را تصرف می‌کنند و اولیا احوال آنان را تصرف می‌کند. پس انبیا مالک احوال خود هستند و اولیا مملوک احوال خود. در حالی که امر همان‌گونه است که برای تو تفصیل دادیم. و ما برای تو بیان کردیم که چرا رسول باز می‌گردد و عقلش بر او حفظ می‌شود، با وجود اینکه در وقت وارد حق بر قلبش با وحی نازل، ناگزیر از حس خود گرفته می‌شود. پس این را بفهم و به حقیقت آن دست یاب.\n\n### [از نوادر عاقلان دیوانه]\n\nما با گروهی از آنان ملاقات کردیم و با ایشان معاشرت نمودیم و از فوایدشان بهره بردیم. من کنار یکی از آنان ایستاده بودم و مردم دور او جمع شده بودند. او به آنان نگاه می‌کرد و می‌گفت: ای بیچارگان، از خدا اطاعت کنید، زیرا شما از گِل آفریده شده‌اید و می‌ترسم که آتش این ظرف‌ها را بپزد و آن‌ها را به سفال تبدیل کند. آیا هرگز دیده‌اید که ظرفی گلی بدون پخته شدن توسط آتش، سفال شود؟ ای بیچارگان، شیطان شما را فریب ندهد که او نیز با شما وارد آتش می‌شود و شما می‌گویید: خداوند می‌فرماید: لَأَمْلَأَنَّ جَهَنَّمَ مِنْكَ ومِمَّنْ تَبِعَكَ مِنْهُمْ أَجْمَعِينَ (جهنم را از تو و از هر کس از آنان که تو را پیروی کند، پر خواهم کرد). شیطان را خداوند از آتش آفرید، پس او به اصل خود باز می‌گردد، اما شما از گِل هستید و آتش در مفاصل شما حکم می‌راند. ای بیچارگان، به اشاره‌ی حق (الحق) در خطابش به ابلیس بنگرید که می‌گوید: لَأَمْلَأَنَّ جَهَنَّمَ مِنْكَ (جهنم را از تو پر خواهم کرد). و اینجا توقف کن و بعد از آن را نخوان. پس گفت: جهنم از توست، و این همان قول اوست: خَلَقَ الْجَانَّ من مارِجٍ من نارٍ (و جن را از شعله‌ای از آتش آفرید). پس کسی که وارد خانه‌ی خود شود و به سرای خود آید و با اهل خود جمع شود، مانند غریبه‌ای نیست که بر او وارد شده است. پس او به آنچه به آن افتخار کرد بازگشت: قالَ أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي من نارٍ (گفت: من از او بهترم، مرا از آتش آفریدی). پس شادی او بازگشت به اصل خود است. و شما ای بدبختان، با آتش بر گِل خود افتخار می‌کنید. پس از ابلیس نشنوید و اطاعت نکنید و به سوی محل نور بگریزید تا سعادتمند شوید. ای بیچارگان، شما کور هستید و آنچه را من می‌بینم، نمی‌بینید. شما می‌گویید: سقف این مسجد را جز این ستون‌ها نگه نمی‌دارد. شما آن‌ها را ستون‌هایی از مرمر می‌بینید، اما من آن‌ها را مردانی می‌بینم که خدا را ذکر می‌کنند و تمجید می‌نمایند. آسمان‌ها به وسیله‌ی مردان برپا داشته شده‌اند، پس این مسجد چگونه است؟ نمی‌دانم، یا من کور هستم که ستون‌ها را سنگ نمی‌بینم، یا شما کور هستید که این ستون‌ها را مردان نمی‌بینید. به خدا سوگند، ای برادرانم، نمی‌دانم. نه به خدا سوگند، شما کور هستید.\nسپس مرا از میان جمع شاهد گرفت و گفت: ای جوان، آیا حق نمی‌گویم؟ گفتم: بله. سپس کنار او نشستم. او شروع به خندیدن کرد و گفت: ای مردم، نشیمنگاه‌های بدبو برای یکدیگر سوت می‌زنند و این جوان نیز مانند من بدبو است. این تناسب باعث شد که کنار من بنشیند و مرا تصدیق کند. شما اکنون او را عاقل می‌پندارید و مرا دیوانه، در حالی که او بسیار دیوانه‌تر از من است. و شما همان‌گونه که خداوند شما را از دیدن این ستون‌ها به صورت مردان کور کرده است، از جنون این جوان نیز کور کرده است.\nسپس دست مرا گرفت و گفت: برخیز، از نزد اینان برویم. من با او خارج شدم. هنگامی که از مردم جدا شدیم، دستم را رها کرد و از من روی گرداند. او از بزرگترین معتوهانی بود که ملاقات کردم. وقتی از او می‌پرسیدم که چه چیزی عقلت را برده است، می‌گفت: تو واقعاً دیوانه‌ای. اگر من عقل داشتم، تو به من می‌گفتی چه چیزی عقلت را برده است؟ عقل من کجاست که با تو سخن بگوید؟ آن را با خود برده است، نمی‌دانم با آن چه می‌کند و مرا اینجا در زمره‌ی چهارپایان رها کرده است که می‌خورم و می‌نوشم و او مرا تدبیر می‌کند. به او گفتم: پس اگر چهارپا هستی، چه کسی تو را سوار می‌کند؟ گفت: من چهارپای وحشی هستم، سوار نمی‌شوم.\nفهمیدم که او خروج خود از عالم انس را اراده می‌کند و اینکه او در بیابان‌های معرفت (المعرفة) است و حکم انسان‌ها بر او جاری نیست. و همچنین او از آزار کودکان و دیگران محفوظ بود. بسیار ساکت، مبهوت، دائم‌الاعتبار بود، ملازم مسجد بود و در اوقات نماز می‌خواند. گاهی اوقات وقتی او را در حال نماز می‌دیدم، از او می‌پرسیدم: می‌بینم که نماز می‌خوانی. می‌گفت: نه به خدا سوگند، بلکه او را می‌بینم که مرا بلند می‌کند و می‌نشاند، نمی‌دانم از من چه می‌خواهد. به او می‌گفتم: آیا در این نمازت نیت ادای آنچه خداوند بر تو واجب کرده است، می‌کنی؟ می‌گفت: نیت چیست؟ می‌گفتم: قصد از این اعمال، قربت به اوست. او می‌خندید و می‌گوید: من می‌گویم او را می‌بینم که مرا بلند می‌کند و می‌نشاند، پس چگونه نیت قربت به کسی کنم که با من است و من او را شهود (الشهود) می‌کنم و از من غایب نیست؟ این سخن دیوانگان است، شما عقل ندارید.\n\n### [انواعی از دیوانگان حق]\n\nسپس بدان که این بهالیل، مانند بهلول و سعدون از متقدمان و ابی وهب فاضل و امثال آنان، برخی شادمان و برخی محزون هستند. و این حالت آنان بر حسب وارد اولی است که عقل‌هایشان را برده است. اگر وارد، وارد قبض (القبض) باشد، آنان را قبض (قبض روحی) می‌کند، مانند یعقوب کورانی که او را در جسر ابیض دیدم و بر این قدم بود. و همچنین مسعود حبشی را در دمشق دیدم که حالتی آمیخته بین قبض و بسط (البسط) داشت و بهت (حیرت) بر او غالب بود. و اگر وارد، وارد لطف باشد، آنان را بسط (بسط روحی) می‌دهد. من گروهی از این صنف را دیدم، مانند ابوالحجاج غلیری و ابوالحسن علی سلاوی. مردم نمی‌دانند چه چیزی عقل‌هایشان را برده است. آنچه بر آنان تجلی (التجلی) کرده، آنان را از تدبیر نفس‌هایشان مشغول کرده است. پس خداوند خلق را برای آنان مسخر کرده است و مردم با رضایت خاطر مشغول مصالح آنان هستند. و لذیذترین چیز برای مردم این است که یکی از اینان نزد او غذا بخورد یا لباسی را از او بپذیرد، این تسخیری الهی است. پس خداوند دو آسایش را برای آنان جمع کرده است: هم آنچه را می‌خواهند می‌خورند و هم مورد محاسبه و سؤال قرار نمی‌گیرند. و برای آنان در قلب‌های خلق، پذیرش، محبت و عطوفت قرار داده است و از تکلیف آسوده شده‌اند. و نزد خداوند پاداش کسی را دارند که در طول عمرشان که بدون عمل سپری شده، نیکو عمل کرده است، زیرا او سبحانه است که آنان را به سوی خود برده است. پس نتایج اعمالی را که اگر عقلشان برده نمی‌شد، از خیر انجام می‌دادند، برایشان حفظ کرده است. مانند کسی که با وضو می‌خوابد و در دل دارد که شب برخیزد و نماز بخواند، اما خداوند روح او را می‌گیرد و می‌خوابد تا صبح شود. در این صورت، خداوند پاداش کسی را که شب را به عبادت گذرانده، برای او می‌نویسد، زیرا اوست که او را در حال خواب نزد خود حبس کرده است. پس مخاطب به تکلیف از آنان، که روحشان است، در شهود حق (الحق) که سلطنتش در آنان ظاهر شده، غایب است. پس آنان گوش شنوایی برای حفظ شنیدن از خارج و تعقل آنچه با آن آمده، ندارند.\n\n### [ابن عربی در مقام بهلله]\n\nو من این مقام را چشیده‌ام و زمانی بر من گذشت که نمازهای پنج‌گانه را به جماعت امامت می‌کردم، آن‌گونه که به من گفته شد، با اتمام رکوع و سجود و تمامی احوال نماز از افعال و اقوال، در حالی که در تمام این‌ها، نه به جماعت، نه به محل، نه به حال و نه به هیچ چیز از عالم حس علم نداشتم، به دلیل غلبه‌ی شهودی (الشهود) که بر من مستولی شده بود و مرا از خودم و از دیگران غایب کرده بود. و به من خبر داده شد که هرگاه وقت نماز داخل می‌شد، اقامه می‌گفتم و با مردم نماز می‌خواندم. پس حال من مانند حرکاتی بود که از شخص خوابیده سر می‌زند و او از آن خبر ندارد. پس دانستم که خداوند وقت مرا حفظ کرده است و بر زبانم گناهی جاری نساخته است، همان‌گونه که با شبلی در وله (حیرت) او انجام داد. اما شبلی در اوقات نماز به خود باز می‌گشت، آن‌گونه که از او روایت شده است. پس نمی‌دانم آیا او بازگشت خود را تعقل می‌کرد یا مانند حالتی بود که من در آن بودم، زیرا راوی تفصیل نداده است. هنگامی که درباره‌ی او به جنید گفته شد، گفت: سپاس خدای را که بر زبان او گناهی جاری نساخت.\nجز اینکه من در اوقاتی در حال غیبت خود، ذاتم را در نور اعم (فراگیر) و تجلی اعظم (التجلی الأعظم) در عرش عظیم مشاهده می‌کردم که نماز می‌خواند، در حالی که من از حرکت عاری و از نفس خود جدا بودم و آن را در برابر حق در حال رکوع و سجود مشاهده می‌کردم. و می‌دانستم که آن راکع و ساجد، من هستم، مانند رؤیت شخص خوابیده، در حالی که دست (قدرت الهی) بر پیشانی من است. و از این تعجب می‌کردم و می‌دانستم که آن نه غیر من است و نه عین من. و از آنجا مکلف و تکلیف را شناختم. مکلف هم اسم فاعل است و هم اسم مفعول.\nپس من حالت کسانی را که عقلشان از آنان گرفته شده است، یعنی دیوانگان الهی، برای تو بیان کردم، بیانی از کسی که چشیده و شهودی (الشهود) حاصل دارد. والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 4
}