{
  "id": 441,
  "title": {
    "ar": "الباب الأحد والأربعون وأربعمائة في معرفة منازلة عيون أفئدة العارفين ناظرة إلى ما عندي لا إلي",
    "en": "Chapter Four Hundred and Forty-One: Concerning the Gnosis of the Stationing of the Eyes of the Gnostics' Hearts, Gazing upon That Which is With Me, Not Upon Me.",
    "ur": "باب چار سو اکتالیس: عارفین (Al-Ārifīn) کے دلوں کی آنکھوں کے اس مقام (Manzilah) کی معرفت (Ma'rifah) کے بیان میں جو اس چیز کی طرف دیکھتی ہیں جو میرے پاس ہے، نہ کہ میری ذات کی طرف۔",
    "fa": "باب چهارصد و چهل و یکم (۴۴۱) در معرفت جایگاه (منازلة) چشم‌های دل‌های عارفان (أفئدة العارفين) که به سوی آنچه نزد من است می‌نگرند، نه به سوی من."
  },
  "content": {
    "ar": "## «الباب الأحد والأربعون وأربعمائة في معرفة منازلة عيون أفئدة العارفين ناظرة إلى ما عندي لا إلي»\n\n\n> لو كان عندك ما عندي لما نظرت *** عيون أفئدة للعارفين سواك‏\n\n\n> فإن نظرت بعين الجمع تحظ بنا *** وإن نظرت بأخرى كان ذاك هواك‏\n\n\n> ما في الوجود وجود غير خالقه *** وما هنا عين شي‏ء لا يكون هناك‏\n\n\n> بل كله عينه جمعا وتفرقة *** إن لم يكن هكذا كوني فليس بذاك‏\n\n\n### [الفرق بين العارفين والعلماء]\n\n\nقال الله عز وجل في العارفين وإِذا سَمِعُوا ما أُنْزِلَ إِلَى الرَّسُولِ تَرى‏ أَعْيُنَهُمْ تَفِيضُ من الدَّمْعِ مِمَّا عَرَفُوا من الْحَقِّ ولم يقل علموا يَقُولُونَ رَبَّنا آمَنَّا فَاكْتُبْنا مَعَ الشَّاهِدِينَ ولم يقولوا علمنا وما لَنا لا نُؤْمِنُ بِاللَّهِ ولم يقل نعلم وما جاءَنا من الْحَقِّ ونَطْمَعُ وما قالوا نتحقق أَنْ يُدْخِلَنا رَبُّنا مَعَ الْقَوْمِ الصَّالِحِينَ وهي الدرجة الرابعة فَأَثابَهُمُ الله بِما قالُوا ولم يقل بما علموا جَنَّاتٍ تَجْرِي من تَحْتِهَا الْأَنْهارُ خالِدِينَ فِيها وذلِكَ جَزاءُ الْمُحْسِنِينَ والجنات عند الله فلهذا قال ناظرة إلى ما عندي فإنه قال في حق طائفة آخرين وُجُوهٌ يَوْمَئِذٍ ناضِرَةٌ إِلى‏ رَبِّها ناظِرَةٌ على إن تكون إلى حرف أداة غاية لا تكون اسم جمع النعمة فإن ذلك في اللفظ يحتمل ولهذا ما هي هذه الآية نص في الرؤية يوم القيامة وإذا كان الأمر هكذا فاعلم إن الله قد فرق بين العارفين والعلماء بما وصفهم به وميز بعضهم عن بعض فالعلم صفته والمعرفة ليست صفته فالعالم إلهي والعارف رباني من حيث الاصطلاح وإن كان العلم والمعرفة والفقه كله بمعنى واحد لكن يعقل بينهما تميز في الدلالة كما تميزوا في اللفظ فيقال في الحق إنه عالم ولا يقال فيه عارف ولا فقيه وتقال هذه الثلاثة الألقاب في الإنسان وأكمل الثناء تعالى بالعلم على من اختصه من عباده أكثر مما أثنى به على العارفين فعلمنا إن اختصاصه بمن شاركه في الصفة أعظم عنده لأنه يرى نفسه فيه فالعالم مرآة الحق ولا يكون العارف ولا الفقيه مرآة له تعالى وكل عالم عندنا لم تظهر عليه ثمرة علمه ولا حكم عليه علمه فليس بعالم وإنما هو ناقل والعلم يستصحب الرحمة بلا شك فإذا رأيت من يدعي العلم ولا يقول بشمول الرحمة فما هو\nصاحب علم فإن الرحمة تتقدم بين يدي العلم تطلب العبد ثم يتبعها العلم هذا هو علم الطريق الذي درج عليه أهل الله وخاصته وهو قوله آتَيْناهُ رَحْمَةً من عِنْدِنا وعَلَّمْناهُ من لَدُنَّا عِلْماً وهذا هو علم الذوق لا علم النظر\n\n\n### [العلم والمعرفة]\n\n\nواعلم أن العارفين هم الموحدون والعلماء وإن كانوا موحدين فمن حيث هم عارفون إلا أن لهم علم النسب فهم يعلمون علم أحدية الكثرة وأحدية التمييز وليس هذا لغيرهم وبتوحيد العلماء وحد الله نفسه إذ عرف خلقه بذلك ولما أراد الله سبحانه أن يصف نفسه لنا بما وصف به العارفين من حيث هم عارفون جاء بالعلم والمراد به المعرفة حتى لا يكون لا طلاق المعرفة عليه تعالى حكم في الظاهر فقال لا تَعْلَمُونَهُمُ الله يَعْلَمُهُمْ فالعلم هنا بمعنى المعرفة لا غير فالعارف لا يرى إلا حقا وخلقا والعالم يرى حقا وخلقا في خلق فيرى ثلاثة لأن الله وتر يحب الوتر فهو مع الله على ما يحبه الله مع الكثرة كما\n\n\nورد أن لله تسعة وتسعين اسما مائة إلا واحد\n\n\nفإن الله وتر يحب الوتر فما تسمى إلا بالواحد الكثير لا بالواحد الأحد وإنما قلنا في العارف إنه رباني فإن الله لما ذكر من وصفه بأنه عرف قال عنه إنه يقول في دعائه ربنا لم يقل غير ذلك من الأسماء وقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فيه مثل ذلك من عرف نفسه عرف ربه‏\n\n\nوما قال علم ولا قال إلهه فلزمنا الأدب مع الله تعالى ومع رسوله صَلَّى اللهُ عَليهِ وسَلَّم فأنزلنا كل أحد منزلته من الأسماء والصفات ومن أراد تحقيق الفرق بين المعرفة والعلم فعليه بمطالعة ما ذكرناه في مواقع النجوم لنا فإني شفيت في ذلك الغليل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 441: On the Gnosis of the Station of the Eyes of the Hearts of the Gnostics, Looking Toward What is With Me, Not At Me\n\nIf what is *with* Me were *with* you, the gaze would not be\nThe eyes of the Gnostics’ hearts upon anyone other than you.\n\nIf you look with the eye of Unification (جمع), you attain Us,\nBut if you look with the other, that is merely your desire.\n\nThere is no existence (وجود) in Being (الوجود) other than its Creator,\nAnd what is here is the very essence of a thing that cannot be there.\n\nRather, the whole of it is its essence, both in Unification and Separation (جمعا وتفرقة);\nIf My existence is not thus, then it is not that Reality.\n\n### [The Difference Between the Gnostics (العارفين) and the Scholars (العلماء)]\n\nAllah Almighty said concerning the Gnostics: <<And when they hear what has been revealed to the Messenger, you see their eyes overflowing with tears because of what they have *known* (عَرَفُوا) of The Real (الْحَقِّ)>>. He did not say, \"they have known (علموا).\" <<They say, 'Our Lord, we have believed, so register us among the witnesses (الشَّاهِدِينَ)'>>. And they did not say, \"we have known (علمنا).\" <<And why should we not believe in Allah>>—He did not say, \"know (نعلم)\"—<<and what has come to us of The Real, and we aspire>>—and they did not say, \"we verify (نتحقق)\"—<<that our Lord will admit us with the righteous people>>. This is the fourth degree. <<So Allah rewarded them for what they *said* (قالُوا)>>—and He did not say, \"for what they knew (علموا)\"—<<Gardens beneath which rivers flow, wherein they will abide eternally. That is the reward of the doers of good (الْمُحْسِنِينَ)>>.\n\nThe Gardens are *with* Allah (عند الله), which is why He said [in the chapter title], \"looking toward what is *with* Me (ما عندي).\" For He said concerning another group: <<[Some] faces, that Day, will be radiant, looking toward their Lord (إِلى‏ رَبِّها ناظِرَةٌ)>>. This is provided that the particle *ila* (إلى) is understood as a preposition denoting the goal or limit, and not as a noun meaning \"the gathering of grace,\" for the wording allows for that possibility. This is why this verse is not an explicit textual proof (*nass*) for the Vision (Rū’ya) on the Day of Resurrection.\n\nSince the matter is thus, know that Allah has differentiated between the Gnostics (العارفين) and the Scholars (العلماء) by the way He described them, distinguishing one group from the other. For Knowledge (العلم) is His Attribute (صفته), but Gnosis (المعرفة) is not His Attribute. Thus, the Scholar (*'Alim*) is *Ilahi* (Divine/Theological), and the Gnostic (*'Arif*) is *Rabbani* (Lordly/Pertaining to the Lord), according to technical usage (الاصطلاح). Although Knowledge, Gnosis, and Jurisprudence (الفقه) are all fundamentally one in meaning, a distinction in their connotation is understood, just as they are distinguished in wording. Thus, it is said of The Real (الحق) that He is All-Knowing (*'Alim*), but it is not said of Him that He is a Gnostic (*'Arif*) or a Jurist (*Faqih*). These three titles are applied to the human being.\n\nThe most complete praise Allah bestows upon those servants He singles out is through Knowledge, more so than the praise He bestows upon the Gnostics. We therefore know that His special favor toward one who shares His Attribute is greater in His estimation, because He sees Himself within that person. Thus, the Scholar is the mirror of The Real (مرآة الحق), while the Gnostic and the Jurist are not mirrors for Him, Exalted is He.\n\nEvery scholar, in our view, upon whom the fruit of his knowledge has not appeared, and whose knowledge does not govern him, is not a true scholar; he is merely a transmitter. Knowledge undoubtedly entails Mercy (الرحمة). Therefore, if you see someone who claims knowledge but does not affirm the universality of Mercy, he is not a possessor of knowledge. For Mercy precedes Knowledge, seeking the servant, and then Knowledge follows it. This is the knowledge of the Path (علم الطريق) upon which the People of Allah and His elect have trod, and it is His saying: <<We gave him Mercy (رَحْمَةً) from Our presence and taught him Knowledge (عِلْماً) from Our own>>. And this is the knowledge of Direct Experience (علم الذوق), not the knowledge of Speculation (علم النظر).\n\n### [Knowledge (العلم) and Gnosis (المعرفة)]\n\nKnow that the Gnostics are the Unitarians (الموحدون). Although the Scholars are also Unitarians, they are so only insofar as they are Gnostics. However, the Gnostics possess the knowledge of relationships (علم النسب); they know the knowledge of the Oneness of Multiplicity (أحدية الكثرة) and the Oneness of Distinction (أحدية التمييز). This is not granted to others.\n\nIt is through the Unitarianism of the Scholars that Allah unified Himself, since He made His creation know Him through that. When Allah, the Glorious, wished to describe Himself to us with what He described the Gnostics with, insofar as they are Gnostics, He used the term Knowledge, intending Gnosis, so that the application of the term Gnosis to Him, Exalted is He, would not be judged inappropriate outwardly. Thus, He said: <<You do not know them; Allah knows them (يَعْلَمُهُمْ)>>. Therefore, Knowledge (العلم) here means Gnosis (المعرفة) and nothing else.\n\nThe Gnostic sees only The Real (حقاً) and Creation (خلقاً). The Scholar sees The Real and Creation *in* Creation, thus seeing three, because Allah is Odd (وتر) and loves the Odd. Thus, he is with Allah upon what Allah loves, along with the Multiplicity, just as it was reported that Allah has ninety-nine Names, one hundred minus one, for Allah is Odd and loves the Odd. He only named Himself with the One-Multiplied (الواحد الكثير), not with the One-Unique (الواحد الأحد).\n\nWe only said that the Gnostic is *Rabbani* (Lordly) because when Allah mentioned the one He described as having Gnosis (*'arafa*), He said that this person says in his supplication, \"Our Lord (ربنا),\" and did not mention any other Names. And the Messenger of Allah, peace and blessings be upon him, said something similar concerning him: \"Whoever knows (عرف) his self knows (عرف) his Lord (ربه).\" He did not say, \"knows (علم)\" nor did he say, \"his God (إلهه).\" Therefore, we are bound by proper conduct (*adab*) toward Allah Almighty and toward His Messenger, peace and blessings be upon him, and we assign everyone his proper station (منزلته) regarding the Names and Attributes.\n\nWhoever desires to verify the distinction between Gnosis and Knowledge must consult what we have mentioned in our book *Mawāqi' al-Nujūm* (The Settings of the Stars), for I have fully quenched the thirst concerning that matter therein. <<And Allah speaks The Truth (الْحَقَّ), and He guides to the way (السَّبِيلَ)>>.",
    "ur": "باب نمبر چار سو اکتالیس (441): عارفین کے دلوں کی آنکھوں کے مقامات کی معرفت میں جو میری طرف نہیں بلکہ اس کی طرف دیکھ رہی ہیں جو میرے پاس ہے۔\n\nاگر تمہارے پاس وہ ہوتا جو میرے پاس ہے، تو\nعارفین کے دلوں کی آنکھیں تمہارے سوا کسی اور کو نہ دیکھتیں۔\n\nپس اگر وہ عین الجمع (عين الجمع) سے دیکھیں تو تم ہم سے حصہ پاؤ گے،\nاور اگر کسی دوسری (آنکھ) سے دیکھیں تو وہ تمہاری خواہش ہوگی۔\n\nالوجود (الوجود) میں خالق کے سوا کوئی وجود نہیں،\nاور جو یہاں ہے وہ عین وہی شے ہے جو وہاں نہیں ہو سکتی۔\n\nبلکہ سب کچھ جمع (جمع) اور تفرقہ (تفرقة) میں اس کا عین ہے،\nاگر میری ہستی (کونی) ایسی نہیں ہے تو پھر وہ ایسی نہیں ہے۔\n\n### [عارفین اور علماء کے درمیان فرق]\n\nاللہ عزوجل نے عارفین کے بارے میں فرمایا: **\"اور جب وہ سنتے ہیں جو رسول کی طرف نازل کیا گیا ہے، تو تم دیکھتے ہو کہ ان کی آنکھیں آنسوؤں سے چھلک پڑتی ہیں اس حق (الحق) کی وجہ سے جسے انہوں نے پہچانا (عرفوا)\"** (المائدہ: 83)۔ اور یہ نہیں فرمایا کہ \"انہوں نے جانا (علموا)\"۔ **\"وہ کہتے ہیں: اے ہمارے رب! ہم ایمان لائے، پس ہمیں شاہدین (الشاهدين) کے ساتھ لکھ لے\"** (المائدہ: 83)۔ اور انہوں نے یہ نہیں کہا کہ \"ہم نے جانا (علمنا)\"۔ **\"اور ہمیں کیا ہے کہ ہم اللہ پر ایمان نہ لائیں اور اس حق (الحق) پر جو ہمارے پاس آیا ہے، اور ہم طمع رکھتے ہیں\"** (المائدہ: 84)۔ اور انہوں نے یہ نہیں کہا کہ \"ہمیں یقین ہے (نتحقق)\"۔ **\"کہ ہمارا رب ہمیں صالحین کے ساتھ داخل کرے گا\"** (المائدہ: 84)۔ اور یہ چوتھا درجہ ہے۔ **\"پس اللہ نے انہیں ان کے کہنے کے سبب ثواب دیا\"** (المائدہ: 85)۔ اور یہ نہیں فرمایا کہ \"ان کے جاننے کے سبب\"۔ **\"ایسے باغات جن کے نیچے نہریں بہتی ہیں، وہ ان میں ہمیشہ رہیں گے، اور یہ احسان کرنے والوں کا بدلہ ہے\"** (المائدہ: 85)۔\n\nاور جنتیں اللہ کے پاس ہیں، اسی لیے (باب کے عنوان میں) فرمایا: \"جو اس کی طرف دیکھ رہی ہیں جو میرے پاس ہے\"۔ کیونکہ اللہ نے ایک دوسرے گروہ کے حق میں فرمایا: **\"کچھ چہرے اس دن تروتازہ ہوں گے، اپنے رب کی طرف دیکھنے والے ہوں گے\"** (القیامہ: 22-23)۔ اس شرط پر کہ \"إلى\" حرفِ غایت ہو، نہ کہ نعمت کے جمع کا اسم، کیونکہ لفظ میں یہ احتمال موجود ہے۔ اسی لیے یہ آیت قیامت کے دن رؤیت (دیدار) کے بارے میں نص (قطعی دلیل) نہیں ہے۔\n\nاور جب معاملہ ایسا ہے، تو جان لو کہ اللہ نے عارفین (العارفين) اور علماء (العلماء) کے درمیان فرق کیا ہے، ان اوصاف کے ذریعے جن سے انہیں متصف کیا اور ان میں سے بعض کو بعض سے ممتاز کیا۔ پس علم (العلم) اس کی صفت ہے، جبکہ معرفت (المعرفۃ) اس کی صفت نہیں ہے۔ اصطلاح کے لحاظ سے عالم (العالم) الٰہی (إلهي) ہوتا ہے اور عارف (العارف) ربانی (رباني)، اگرچہ علم، معرفت اور فقہ سب ایک ہی معنی میں ہیں، لیکن ان کے درمیان دلالت میں ایک امتیاز سمجھا جاتا ہے، جیسا کہ وہ لفظ میں ممتاز ہیں۔ چنانچہ الحق (الحق) کے بارے میں کہا جاتا ہے کہ وہ عالم ہے، لیکن یہ نہیں کہا جاتا کہ وہ عارف یا فقیہ ہے، جبکہ یہ تینوں القاب انسان کے لیے استعمال کیے جاتے ہیں۔\n\nاور اللہ تعالیٰ نے اپنے جن بندوں کو خاص کیا، ان پر علم (العلم) کے ذریعے زیادہ کامل تعریف کی، بہ نسبت اس تعریف کے جو اس نے عارفین پر کی۔ پس ہم نے جانا کہ اس کا اختصاص اس شخص کے ساتھ جو صفت میں اس کا شریک ہے، اس کے نزدیک زیادہ عظیم ہے، کیونکہ وہ اپنے آپ کو اس میں دیکھتا ہے۔ پس عالم (العالم) الحق (الحق) کا آئینہ ہے، جبکہ عارف اور فقیہ اس (اللہ تعالیٰ) کا آئینہ نہیں ہوتے۔\n\nاور ہمارے نزدیک ہر وہ عالم جس پر اس کے علم کا ثمر ظاہر نہ ہو اور نہ ہی اس کے علم نے اس پر حکم چلایا ہو، وہ عالم نہیں ہے، بلکہ وہ صرف ناقل (نقل کرنے والا) ہے۔ اور علم بلاشبہ رحمت (الرحمۃ) کو اپنے ساتھ رکھتا ہے۔ پس اگر تم کسی ایسے شخص کو دیکھو جو علم کا دعویٰ کرتا ہو اور رحمت کے شمول (عمومیت) کا قائل نہ ہو، تو وہ صاحبِ علم نہیں ہے۔ کیونکہ رحمت (الرحمۃ) علم سے پہلے آگے بڑھتی ہے، بندے کو تلاش کرتی ہے، پھر علم اس کے پیچھے آتا ہے۔ یہی وہ علمِ طریق ہے جس پر اہلِ اللہ اور اس کے خواص گامزن ہوئے، اور یہی اللہ کا قول ہے: **\"ہم نے اسے اپنی طرف سے رحمت عطا کی اور اسے اپنے پاس سے علم سکھایا\"** (الکہف: 65)۔ اور یہ علمِ ذوق (علم الذوق) ہے، نہ کہ علمِ نظر (علم النظر)۔\n\n### [علم اور معرفت]\n\nاور جان لو کہ عارفین (العارفين) ہی موحدون (توحید پرست) ہیں، اور علماء اگرچہ موحد ہیں، تو اس حیثیت سے کہ وہ عارف ہیں۔ مگر ان کے لیے علمِ نسب (علم النسب) ہے، پس وہ کثرت کی احدیت (أحدية الكثرة) اور تمییز کی احدیت (أحدية التمييز) کا علم رکھتے ہیں، اور یہ علم ان کے سوا کسی اور کے لیے نہیں ہے۔ اور علماء کی توحید (توحید) کے ذریعے ہی اللہ نے اپنی ذات کو واحد قرار دیا، جب اس نے اپنی مخلوق کو اس سے آگاہ کیا۔\n\nاور جب اللہ سبحانہ نے ارادہ کیا کہ وہ اپنی ذات کو ہمارے لیے اس چیز سے بیان کرے جس سے اس نے عارفین کو متصف کیا ہے، اس حیثیت سے کہ وہ عارف ہیں، تو وہ علم (العلم) کے ساتھ آیا، اور اس سے مراد معرفت (المعرفۃ) تھی، تاکہ اللہ تعالیٰ پر معرفت کا اطلاق ظاہری طور پر کوئی حکم نہ رکھتا ہو۔ چنانچہ فرمایا: **\"تم انہیں نہیں جانتے، اللہ انہیں جانتا ہے\"** (الاحزاب: 59)۔ پس یہاں علم کا معنی صرف معرفت ہے۔\n\nپس عارف (العارف) حق (الحق) اور خلق (الخلق) کے سوا کچھ نہیں دیکھتا، جبکہ عالم (العالم) خلق میں حق اور خلق کو دیکھتا ہے، پس وہ تین دیکھتا ہے، کیونکہ اللہ وتر (طاق) ہے اور وتر کو پسند کرتا ہے۔ پس وہ کثرت (الکثرۃ) کے ساتھ اللہ کے ساتھ اس طرح ہے جسے اللہ پسند کرتا ہے، جیسا کہ وارد ہوا ہے کہ اللہ کے ننانوے نام ہیں، سوائے ایک کے۔ کیونکہ اللہ وتر ہے اور وتر کو پسند کرتا ہے۔ پس اس نے صرف واحدِ کثیر (الواحد الکثیر) کے ساتھ اپنا نام رکھا، نہ کہ واحدِ احد (الواحد الأحد) کے ساتھ۔\n\nاور ہم نے عارف کے بارے میں صرف اس لیے کہا کہ وہ ربانی (رباني) ہے کہ جب اللہ نے اس شخص کا ذکر کیا جس کی صفت یہ ہے کہ اس نے پہچانا (عرف)، تو اس کے بارے میں فرمایا کہ وہ اپنی دعا میں \"ربنا\" (ہمارا رب) کہتا ہے، اور اس کے سوا کوئی دوسرا نام نہیں لیا۔ اور رسول اللہ صلی اللہ علیہ وسلم نے اس کے بارے میں اسی طرح فرمایا: **\"جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا\"**۔ اور آپ صلی اللہ علیہ وسلم نے یہ نہیں فرمایا کہ \"اس نے جانا (علم)\" اور نہ یہ فرمایا کہ \"اس نے اپنے الٰہ کو پہچانا\"۔ پس ہم پر اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم کے ساتھ ادب لازم ہوا، چنانچہ ہم نے ہر ایک کو اسماء و صفات میں اس کے مقام پر اتارا۔\n\nاور جو شخص معرفت (المعرفۃ) اور علم (العلم) کے درمیان فرق کی تحقیق کرنا چاہے، تو اسے چاہیے کہ وہ ہماری کتاب \"مواقع النجوم\" میں جو کچھ ہم نے ذکر کیا ہے، اس کا مطالعہ کرے، کیونکہ میں نے اس میں پیاس بجھا دی ہے۔ اور **\"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\"** (الاحزاب: 4)۔",
    "fa": "باب چهارصد و چهل و یکم در معرفت جایگاه‌هایی که دیدگان دل‌های عارفان به آنچه نزد من است می‌نگرند، نه به خود من.\n\nاگر آنچه نزد من است نزد تو بود، دیدگان دل‌های عارفان به جز تو نمی‌نگریستند.\nپس اگر با چشم جمع بنگری، به ما دست می‌یابی؛ و اگر با چشمی دیگر بنگری، آن نگاه هوای نفس توست.\nدر هستی (الوجود)، وجودی جز خالق آن نیست؛ و آنچه اینجاست عین چیزی است که آنجا نیست.\nبلکه همه آن، عین اوست در جمع و تفرقه؛ اگر هستی من این‌گونه نباشد، پس آن نیست.\n\n### [تفاوت میان عارفان و عالمان]\n\nخداوند عز و جل درباره عارفان می‌فرماید: «وَإِذَا سَمِعُوا مَا أُنْزِلَ إِلَى الرَّسُولِ تَرَى أَعْيُنَهُمْ تَفِيضُ مِنَ الدَّمْعِ مِمَّا عَرَفُوا مِنَ الْحَقِّ» (و چون آنچه را که بر پیامبر نازل شده بشنوند، می‌بینی که چشمانشان از اشک لبریز می‌شود، به سبب آنچه از حق (الحق) شناخته‌اند). و نفرمود: «علموا» (دانسته‌اند). «يَقُولُونَ رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ» (می‌گویند: پروردگارا، ایمان آوردیم، پس ما را در زمره گواهان بنویس). و نگفتند: «علمنا» (دانستیم). «وَمَا لَنَا لَا نُؤْمِنُ بِاللَّهِ» (و ما را چه شده که به خدا ایمان نیاوریم؟). و نگفت: «نعلم» (می‌دانیم). «وَمَا جَاءَنَا مِنَ الْحَقِّ وَنَطْمَعُ» (و به آنچه از حق (الحق) بر ما آمده است، و طمع داریم). و نگفتند: «نتحقق» (به یقین رسیدیم). «أَنْ يُدْخِلَنَا رَبُّنَا مَعَ الْقَوْمِ الصَّالِحِينَ» (که پروردگارمان ما را با گروه شایستگان وارد سازد). و این درجه چهارم است. «فَأَثَابَهُمُ اللَّهُ بِمَا قَالُوا» (پس خداوند به سبب آنچه گفتند، پاداششان داد). و نگفت: «بما علموا» (به سبب آنچه دانستند). «جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا وَذَلِكَ جَزَاءُ الْمُحْسِنِينَ» (باغ‌هایی که از زیر [درختان] آن نهرها جاری است، جاودانه در آن می‌مانند، و این پاداش نیکوکاران است).\n\nو بهشت‌ها نزد خداست، از این رو فرمود: «ناظرة إلى ما عندي» (نگرنده به آنچه نزد من است). زیرا در حق گروهی دیگر فرموده است: «وُجُوهٌ يَوْمَئِذٍ نَاضِرَةٌ * إِلَى رَبِّهَا نَاظِرَةٌ» (چهره‌هایی در آن روز شادابند * به سوی پروردگارشان می‌نگرند). به شرط آنکه «إلى» حرف جر و ادات غایت باشد، نه اسم جمع نعمت؛ زیرا این احتمال در لفظ وجود دارد و به همین دلیل این آیه نص صریح در رؤیت (دیدار) در روز قیامت نیست.\n\nو چون امر چنین است، بدان که خداوند میان عارفان و عالمان با اوصافی که برایشان آورده، فرق گذاشته و برخی را از برخی دیگر متمایز ساخته است. پس علم صفت اوست، اما معرفت (المعرفة) صفت او نیست. عالم (العالم) از حیث اصطلاح، الهی است و عارف (العارف) ربانی است. اگرچه علم و معرفت و فقه همگی به یک معنا هستند، اما در دلالت میان آنها تمایزی درک می‌شود، همان‌گونه که در لفظ متمایز شده‌اند. پس درباره حق (الحق) گفته می‌شود که او عالم است، اما گفته نمی‌شود که عارف یا فقیه است. و این سه لقب برای انسان به کار می‌رود.\n\nو کامل‌ترین ستایش خداوند متعال با علم بر کسانی است که از بندگانش برگزیده، بیشتر از ستایشی است که بر عارفان کرده است. پس دانستیم که اختصاص او به کسی که در صفت با او شریک است، نزد او عظیم‌تر است، زیرا او خود را در آن می‌بیند. پس عالم آینه حق (الحق) است، اما عارف و فقیه آینه او تعالی نیستند.\n\nو هر عالمی نزد ما که ثمره علمش بر او ظاهر نشود و علمش بر او حکم نکند، عالم نیست، بلکه صرفاً ناقل است. و علم بدون شک همراه رحمت است. پس اگر کسی را دیدی که ادعای علم می‌کند ولی به شمول رحمت قائل نیست، او صاحب علم نیست. زیرا رحمت پیشاپیش علم حرکت می‌کند و بنده را می‌طلبد، سپس علم به دنبال آن می‌آید. این همان علم طریقت است که اهل الله و خاصان او بر آن گام نهاده‌اند، و آن قول خداوند است: «آتَيْنَاهُ رَحْمَةً مِنْ عِنْدِنَا وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْمًا» (رحمتی از جانب خود به او دادیم و از نزد خود دانشی به او آموختیم). و این علم ذوق است، نه علم نظر.\n\n### [علم و معرفت]\n\nو بدان که عارفان همان موحدان هستند. و عالمان اگرچه موحدند، اما از آن جهت که عارف هستند [موحدند]. جز اینکه عالمان، علم نسبت‌ها را دارند؛ پس آنان علم احدیت کثرت و احدیت تمییز را می‌دانند و این برای غیر ایشان نیست.\n\nو خداوند خود را با توحید عالمان، یگانه ساخت، زیرا خلق خود را به واسطه آن شناساند. و چون خداوند سبحان خواست خود را برای ما به آنچه عارفان را بدان وصف کرده، وصف کند، علم را آورد و مراد از آن معرفت (المعرفة) بود، تا اطلاق معرفت بر او تعالی در ظاهر حکمی نداشته باشد. پس فرمود: «لَا تَعْلَمُونَهُمُ اللَّهُ يَعْلَمُهُمْ» (شما آنان را نمی‌شناسید، خدا آنان را می‌شناسد). پس علم در اینجا صرفاً به معنای معرفت (المعرفة) است.\n\nپس عارف جز حق (الحق) و خلق نمی‌بیند، اما عالم، حق و خلق را در خلق می‌بیند، پس سه چیز می‌بیند. زیرا خداوند وتر (فرد) است و وتر را دوست دارد. پس او با خدا بر آنچه خدا دوست دارد، همراه با کثرت است، چنانکه وارد شده است: «أن لله تسعة وتسعين اسما مائة إلا واحد» (خداوند نود و نه اسم دارد، یکی کمتر از صد). زیرا خداوند وتر است و وتر را دوست دارد. پس او جز به واحد کثیر نامیده نشده، نه به واحد احد.\n\nو اینکه ما درباره عارف گفتیم که او ربانی است، به این دلیل است که خداوند هنگامی که کسی را به وصف معرفت (المعرفة) یاد کرد، فرمود که او در دعای خود می‌گوید: «ربنا» (پروردگار ما). و نام دیگری از اسماء را نگفت. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) نیز در این باره فرمود: «من عرف نفسه عرف ربه» (هر کس خود را شناخت، پروردگارش را شناخت). و نفرمود: «علم» (دانست) و نفرمود: «إلهه» (معبودش). پس بر ما لازم است که ادب را با خداوند متعال و با رسول او (صَلَّى اللهُ عَليهِ وسَلَّم) رعایت کنیم و هر کس را در جایگاه خود از اسماء و صفات قرار دهیم.\n\nو هر کس که بخواهد فرق میان معرفت (المعرفة) و علم را به تحقیق دریابد، باید آنچه را که در کتاب «مواقع النجوم» ما ذکر کرده‌ایم، مطالعه کند، زیرا من در آنجا تشنگی [معرفتی] را برطرف کرده‌ام. «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق (الحق) را می‌گوید و او راه را می‌نمایاند)."
  },
  "page_count": 2
}