{
  "id": 470,
  "title": {
    "ar": "الباب السبعون وأربعمائة في حال قطب كان منزله وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ",
    "en": "Chapter Four Hundred and Seventy: Concerning the State (حال) of a Pole (قطب) Whose Station (منزل) Was <<And I did not create the jinn and mankind except that they should worship Me>>.",
    "ur": "باب چار سو ستر (۴۷۰): ایک قطب (Quṭb) کے حال کے بیان میں جس کا منزل (Manzil) یہ تھا: \"اور میں نے جنوں اور انسانوں کو صرف اس لیے پیدا کیا ہے کہ وہ میری عبادت کریں\" (الذاریات ۵۱:۵۶)۔",
    "fa": "باب چهارصد و هفتادم در حال قطبی که منزل او این آیه است: «وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ» (و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند)."
  },
  "content": {
    "ar": "## «الباب السبعون وأربعمائة في حال قطب كان منزله وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ»\n\n\n> كما أعطاك خلقك من حباكا *** فأعط ما خلقت له كذاكا\n\n\n> وإن لم تعطه فالخلق يعطي *** وليس يكون مشكورا هناكا\n\n\n> وحق الحق أولى يا ولي *** بأن يقضي به وحي أتاكا\n\n\n> فإن تبلغ مناه كما تمنى *** يبلغك الإله به مناكا\n\n\n### [الطلب لا يكون الا بنوع من الإذلال‏]\n\n\nقال الله تعالى وقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ وقضاؤه لا يرد علمنا إن نتيجة هذا الذكر شهود هذه الآية بلا شك فإن الحق هو الوجود والأشياء صور الوجود فارتبط الأمر ارتباط المادة بالصورة والعبادة ذلة بلا شك في اللسان المنزل به هذا القرآن والأمر إذا ارتبط بين أمرين لا يمكن لكل واحد منهما أن يكون عنه ذلك الأمر إلا بارتباطه بالأمر\nالآخر علمنا إن كل واحد من الأمرين المرتبطين للحب الذي قام لكل واحد منهما في ظهور الأمر الثالث وإنه طالب للأمر الثاني فصح الطلب من كل واحد والحاصل لا يبتغى فلا بد أن يتصفا بالفقد لما يبغيان وجوده والطلب لا يكون إلا بنوع من الإذلال وقالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ فطلب الدعاء من عباده وطلب العباد الإجابة منه فالكل طالب ومطلوب وقد قام الدليل أن الحوادث لا تقوم به فلا يستقل بكل طلب في ذاته لأن الطلب من الحادث حادث ويستحيل أن يقوم به مثل هذا الطلب فلا بد من طلب وجود ما يقوم به هذا الطلب الحادث وهو قوله إذا أردناه والطلب إرادة سواء طلبك لنفسه أو طلبك لك على كل حال الحاصل لا يبتغى من الوجه الذي يطلب فإنه من ذلك الوجه ليس بحاصل فلا يصح الوجود أصلا إلا من أصلين الأصل الواحد الاقتدار وهو الذي يلي جانب الحق والأصل الثاني القبول وهو الذي يلي جانب الممكن فلا استقلال لواحد من الأصلين بالوجود ولا بالإيجاد فالأمر المستفيد الوجود ما استفاده إلا من نفسه بقبوله وممن نفذ فيه اقتداره وهو الحق غير أنه لا يقول في نفسه إنه موجد نفسه بل يقول إن الله أوجده والأمر على ما ذكرناه فما أنصف الممكن نفسه وآثر بهذا الوصف ربه فلما علم الله أنه آثر ربه على نفسه بنسبة الإيجاد إليه أعطاه الظهور بصورته جزاء فلا أكمل من العالم لأنه لا أكمل من الحق وما كمل الوجود إلا بظهور الحادث ولما كان الأمر بهذه المثابة في التوقف وعدم الاستقلال من الطرفين نبه الحق على ذلك‏\n\n\nبقوله قسمت الصلاة بيني وبين عبدي نصفين فنصفها لي ونصفها لعبدي‏\n\n\nوهو أيضا أعني التقسيم موجود في استخلاف العبد وفي وكالة الحق فيما هو فيه العبد مستخلف فاستقل الوجود وكمل بالحادث ولما كان الحق غيورا أن يذكر معه سواه تجلى للعالم في صور المحدثات وعلموه فيها أعلاما منه للعالم إنه غني عن العالمين بما رأيتموه في ذاته من ظهوره بالتجلي في صور المحدثات فسواء ظهوركم وعدمكم يقول للممكن فعند ذلك ذل الممكن بالفعل في نفسه فوقع منه ما خلقه الله له وزال عنه عز الاستعداد بالقبول في الإيجاد إذا رأى أعيان الصور التي تكون عن قبولها واقتدار الحق قد ظهر الحق بها فلم تكن الحاجة إلى الممكنات في قبولها والأمر قد حصل وصح قوله فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ ولقد برقت لي بارقة إلهية عند تقييدي هذه المسألة رأيت فيها ما شاء الله من العلوم كما\n\n\nضرب النبي صَلَّى اللهُ عَليهِ وسَلَّم بالمعول الحجر الذي تعرض لهم في الخندق فبرقت في الضربة منه بارقة رأى بها ما فتح الله على أمته حتى رأى قصور بصري كأنياب الفيلة رأى ذلك في ثلاث ضربات في كل ضربة بارقة تبدي له جهة مخصوصة\n\n\nهذا رأيته عند تقييدي هذا الباب وراثة نبوية بحمد الله ورأيت فيها وبها وإن ظهر بصور الممكنات واتصف بالغنى فإن ذلك لا يخرجه عن عدم الاستقلال في وجود الحادث به إذ لا بد من قبوله وفيه وقع الكلام هذا مما أعطتنيه تلك البارقة وإنه تعالى لما خلقهم لعبادته كساهم صفته وهي التي بها طلبهم فعبدوه بها إذ لا يصح أن يعبدوه بأنفسهم على جهة الاستقلال ولهذا شرع لهم أن يقولوا بعد قولهم إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ لعدم الاستقلال في العبادة فألقت عندهم الطلب في المعونة على عبادته كما كان القبول منهم معونة للاقتدار الإلهي في الخلق ولو لا هذا الارتباط ما صحت عبادة ولا إيجاد فالإيجاد عبادة وهو لله والعبادة إيجاد وهي المطلوبة من الخلق فهم العابدون وهو المعبود وهو الموجد وهم الموجودون فلام العلة ذاتية من الجانبين واسمها في الشرع حكمة وسبب فإنه حكيم ففي كل شي‏ء له حكمة ظاهرة يعلمها أهل الكشف والوجود في كل شي‏ء ويعلمها أهل الرسوم في التكليفات التي لا تعلم إلا من جهة الشرع فحكمتها لا تعلم إلا من جهة الشرع كقوله ولَكُمْ في الْقِصاصِ حَياةٌ وأما القول بالعلة في التكليف من جهة الحق فمظنونة غير معلومة ولكن فتح لهم باب الاستنباط بما ذكره لهم في الوحي المنزل من التعليل فمنه جلي ومنه خفي كذلك له في الأشياء حكمة باطنة لا يعلمها إلا هو ومن أعلمه الله بها ولذلك قال الجن وهو ما استتر فلا يعلم إلا منه والإنس وهو ما ظهر فيعلم بذاته حيث ظهر إِلَّا لِيَعْبُدُونِ إثبات السبب الموجب للخلق فهذه لام الحكمة والسبب شرعا ولام العلة عقلا والعبادة ذاتية للمخلوق لا يحتاج فيها إلى تكليف فلا بد أن يكون الخالق عين كل صورة يعبدها المخلوق مع افتقار الصورة إلى المادة وإنه إذا لم يكن الأمر هكذا فلا تكن العبادة من المخلوق ذاتية فإنه إذا اقتصرنا على مسمى الله في العرف عبد المخلوق غير الله فإنا نرى الأكثر من العالم ما يفتقرون‏\nإلا إلى الأسباب وكيف وقد قال وقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ ويا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله ولم يذكر قط افتقار مخلوق لغير الله ولا قضى أن يعبد غير الله فلا بد أن يكون هو عين كل شي‏ء أي عين كل ما يفتقر إليه وعين ما يعبد كما أنه عين العابد من كل عابد بقوله أيضا كنت سمعه حين خاطبه بالتكليف والتعريف فما سمع كلامه إلا بسمعه وكذلك جميع قواه التي لا يكون عابد الله إلا بها فلم يظهر في العابد والمعبود إلا هويته فحكمته وسببه وعلته لم تكن إلا هو ومعلوله ومسببه لم يكن إلا هو فإياه عبد وعبد\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم في خطبته لما أثنى على ربه فإنما نحن به وله‏\n\n\nفخاطب وسمع وهذا أمر لا يندفع فإنه عين الأمر غير إن الفضل بين الناس هو بما شاهده بعضهم وحرمه بعضهم فيعلم العالم من غيره ما لا يعلمه الغير من نفسه مما هو عليه في نفسه فظهر التفاضل ومع هذا الظهور لا يخرج المخلوق عن أن يكون الحق هويته بدليل تفاضل الأسماء الإلهية وهي الصفات وليست غيره‏\n\n\n> فلا يعلم الخلق إلا به *** ولا يعلم الحق إلا بها\n\n\nوأما وصفه بالغنى عن العالم أنما هو لمن توهم إن الله تعالى ليس عين العالم وفرق بين الدليل والمدلول ولم يتحقق بالنظر إذا كان الدليل على الشي‏ء نفسه فلا يضاد نفسه فالأمر واحد وإن اختلفت العبارات عليه فهو العالم والعلم والمعلوم فهو الدليل والدال والمدلول فبالعلم يعلم العلم فالعلم معلوم للعلم فهو المعلوم والعلم والعلم ذاتي للعالم وهو قول المتكلم ما هو غيره فقط وأما قوله وما هو هو بعد هذا فهو لما يرى من أنه معقول زائد على ما هو فبقي أن يكون هو وما قدر على أن يثبت هو من غير علم يصفه به فقال ما هو غيره فحار فنطق بما أعطاه فهمه فقال إن صفة الحق ما هي هو ولا هي غيره ولكن إذا قلنا نحن مثل هذا القول ما نقوله على حد ما يقوله المتكلم فإنه يعقل الزائد ولا بد ونحن لا نقول بالزائد فما يزيد المتكلم على من يقول إِنَّ الله فَقِيرٌ إلا بحسن العبارة ونعوذ بالله أن نكون من الجاهلين فهذا بعض نتائج هذا الهجير والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 470 concerning the state of a Pole (Qutb) whose station was: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except that they should worship Me)\n\nJust as your creation gave you [existence] from Him who endowed you,\nSo give what you were created for, likewise.\n\nAnd if you do not give it, then Creation (الخلق) gives [it],\nBut you will not be thanked for it there.\n\nAnd the right of The Real (الحق) is more worthy, O Saint (Wali),\nThat the revelation which came to you should decree it.\n\nFor if you reach His ultimate desire, just as He desired,\nThe God (الإله) will make you reach your ultimate desire through it.\n\n### [Seeking (Al-Talab) is only achieved through a type of Humiliation (Al-Idhlal)]\n\nAllah the Exalted said: <<وَقَضَى رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ>> (And your Lord has decreed that you worship none but Him). His decree (قضاؤه) does not negate our knowledge that the result of this remembrance (الذكر) is the witnessing (شهود) of this verse without doubt. For The Real (الحق) is Existence (الوجود), and things are the forms of Existence. Thus, the matter is linked, like the linking of matter to form.\n\nWorship (العبادة) is undoubtedly humiliation (ذلة) in the language in which this Qur’an was revealed. When a matter is linked between two things, it is impossible for that matter to proceed from either one of them except through its linkage to the other matter.\n\nWe know that each of the two linked matters is driven by the love (الحب) that arose in each of them for the manifestation of the third matter, and that each is seeking the second matter. Thus, seeking (الطلب) is valid from both sides. That which is already attained (الحاصل) is not sought. Therefore, both must be characterized by the lack (الفقد) of what they seek to exist. Seeking (الطلب) is only achieved through a type of humiliation (الإذلال).\n\nAllah said: <<وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ>> (And your Lord said, \"Call upon Me; I will respond to you\"). He sought the supplication (الدعاء) from His servants, and the servants sought the response (الإجابة) from Him. Thus, all are seekers (طالب) and sought (مطلوب).\n\nThe proof has been established that contingent beings (الحوادث) do not subsist in Him. Therefore, He is not self-sufficient in every seeking (طلب) in His Essence (ذاته), because the seeking that comes from the contingent being is contingent (حادث). It is impossible for such seeking to subsist in Him. Thus, there must be a seeking for the existence of that in which this contingent seeking subsists, which is His saying [concerning creation], \"If We intend it.\" Seeking (الطلب) is intention (إرادة), whether it is His seeking for Himself or His seeking for you.\n\nIn any case, that which is attained (الحاصل) is not sought from the aspect through which it is sought, for from that aspect, it is not attained. Existence (الوجود) is not valid at all except from two origins (أصلين): The first origin is Power/Capability (الاقتدار), which pertains to the side of The Real (الحق). The second origin is Acceptance/Receptivity (القبول), which pertains to the side of the possible (الممكن). Neither of the two origins is self-sufficient in Existence (الوجود) or in bringing into existence (الإيجاد).\n\nThe matter that gains existence only gained it from itself through its acceptance (قبوله) and from Him whose Power (اقتداره) was executed within it, which is The Real (الحق). However, [the possible] does not say of itself that it is the originator of itself (موجد نفسه); rather, it says that Allah originated it. The matter is as we have stated. The possible being did not do justice to itself, preferring its Lord with this description [of origination]. When Allah knew that it preferred its Lord over itself by attributing origination (الإيجاد) to Him, He granted it manifestation in His own form (صورته) as a reward. Thus, there is nothing more perfect than the world (العالم), because there is nothing more perfect than The Real (الحق). And Existence (الوجود) was not perfected except by the manifestation of the contingent being (الحادث).\n\nSince the matter was of this nature—of mutual dependence (التوقف) and lack of self-sufficiency (عدم الاستقلال) from both sides—The Real drew attention to this by His saying: \"I have divided the prayer (الصلاة) between Myself and My servant into two halves: half of it is for Me, and half of it is for My servant.\"\n\nThis division (التقسيم) is also present in the vicegerency (استخلاف) of the servant and in the agency (وكالة) of The Real in that wherein the servant is made a vicegerent. Thus, Existence became self-sufficient and complete through the contingent being (الحادث).\n\nSince The Real (الحق) is jealous (غيور) that anything other than Him should be mentioned alongside Him, He disclosed Himself (تجلى) to the world (العالم) in the forms of contingent beings (المحدثات). They recognized Him therein as signs (أعلام) from Him to the world that He is independent of the worlds (غني عن العالمين), based on what you have seen in His Essence (ذاته) of His manifestation through Theophany (التجلي) in the forms of contingent beings. Thus, your manifestation and your non-existence are equal [to Him]. He says to the possible being, \"Be!\" (كن).\n\nAt that point, the possible being (الممكن) was actually humbled (ذل) within itself, and thus performed what Allah created it for. The glory of preparedness (عز الاستعداد) through acceptance (القبول) in the act of origination (الإيجاد) vanished from it when it saw the essences of the forms (أعيان الصور) that result from its acceptance and the Power (اقتدار) of The Real, and saw that The Real had manifested through them. Thus, there was no need for the possible beings in their acceptance, yet the matter was achieved. And His saying, <<فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ>> (Indeed, Allah is independent of the worlds), was confirmed.\n\nA divine flash (بارقة إلهية) shone upon me while I was recording this issue, in which I saw, by the will of Allah, many sciences.\n\nJust as the Prophet (peace and blessings be upon him) struck the rock that obstructed them in the Trench (Khandaq) with the pickaxe, and a flash (بارقة) shone forth from his strike, by which he saw what Allah would open up for his Community (Ummah), even seeing the palaces of Busra as if they were elephant tusks. He saw this in three strikes, with a flash in each strike revealing a specific direction to him.\n\nI saw this when I was recording this chapter, as a prophetic inheritance, praise be to Allah. I saw in it and through it that even if [The Real] manifests in the forms of the possible beings (الممكنات) and is described by Independence (الغنى), this does not remove Him from the lack of self-sufficiency (عدم الاستقلال) in the existence of the contingent being through Him, since its acceptance (قبوله) is necessary. And this is where the discussion lies. This is what that flash granted me.\n\nWhen the Exalted created them for His worship (عبادته), He clothed them with His Attribute (صفته), which is the means by which He sought them, so they worshipped Him through it. For it is not valid for them to worship Him by themselves in a state of self-sufficiency (استقلال). This is why He legislated for them to say, after saying <<إِيَّاكَ نَعْبُدُ>> (You alone we worship), <<وَإِيَّاكَ نَسْتَعِينُ>> (and You alone we ask for help), due to the lack of self-sufficiency in worship. This instilled in them the seeking (الطلب) of assistance (المعونة) in His worship, just as their acceptance (القبول) was assistance (معونة) for the Divine Power (الاقتدار الإلهي) in creation.\n\nWere it not for this linkage (الارتباط), neither worship nor origination (الإيجاد) would be valid. Origination is worship, and it belongs to Allah. Worship is origination, and it is what is sought from Creation (الخلق). Thus, they are the worshippers (العابدون), and He is the Worshipped (المعبود). He is the Originator (الموجد), and they are the originated (الموجودون).\n\nThe *lām* of cause (لام العلة) is intrinsic (ذاتية) from both sides. Its name in the Sacred Law (الشرع) is Wisdom (حكمة) and Reason (سبب). For He is Wise (حكيم), and in everything, He has a manifest wisdom (حكمة ظاهرة) known by the People of Unveiling (أهل الكشف) and Existence (الوجود), and known by the People of Formalities (أهل الرسوم) in the religious obligations (التكليفات) that are known only through the Sacred Law, whose wisdom is known only through the Sacred Law, such as His saying: <<وَلَكُمْ فِي الْقِصَاصِ حَيَاةٌ>> (And there is for you in legal retribution [Qisas] life).\n\nAs for speaking of the cause (*‘illa*) in religious obligation from the side of The Real, it is conjectured (مظنونة), not known. However, He opened the door of inference (الاستنباط) for them through the explanations He mentioned in the revealed Revelation (الوحي المنزل), some of which are manifest and some hidden. Likewise, He has an inner wisdom (حكمة باطنة) in things that none knows but Him and those whom Allah informs.\n\nThat is why He said: *Al-Jinn* (الجن), which is what is concealed (استتر) and thus known only through Him, and *Al-Ins* (الإنس), which is what is manifest (ظهر) and thus known by its essence where it manifests, <<إِلَّا لِيَعْبُدُونِ>> (except that they should worship Me)—this is the affirmation of the necessary reason (السبب الموجب) for creation. This *lām* is the *lām* of Wisdom and Reason (حكمة وسبب) according to the Sacred Law, and the *lām* of Cause (*‘illa*) according to reason.\n\nWorship (العبادة) is intrinsic (ذاتية) to the created being (المخلوق); it does not require religious obligation (تكليف). Therefore, the Creator must be the very Essence (عين) of every form that the created being worships, despite the form’s need for matter. If the matter were not thus, the worship of the created being would not be intrinsic.\n\nIf we restrict ourselves to the conventional meaning of the name Allah (مسمى الله في العرف), the created being would be worshipping other than Allah, for we see that most of the world only depends on secondary causes (الأسباب).\n\nHow can this be, when He has said: <<وَقَضَى رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ>> (And your Lord has decreed that you worship none but Him) and <<يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ>> (O mankind, you are the needy ones toward Allah)? He never mentioned the need of a created being for other than Allah, nor did He decree that other than Allah should be worshipped. Therefore, He must be the very Essence (عين) of everything—meaning, the Essence of everything that is needed and the Essence of everything that is worshipped—just as He is the Essence of the worshipper (العابد) from every worshipper, by His saying, \"I was his hearing\" when He addressed him with religious obligation (التكليف) and definition (التعريف). Thus, he did not hear His speech except with His hearing, and likewise all his faculties (قواه) by which alone one can worship Allah.\n\nNothing manifested in the worshipper (العابد) and the worshipped (المعبود) except His Identity (هويته). Thus, His Wisdom, His Reason, and His Cause were none other than Him, and His effect (معلوله) and His consequence (مسببه) were none other than Him. So, it is Him whom he worshipped, and it is Him who worshipped.\n\nThe Prophet (peace and blessings be upon him) said in his sermon when he praised his Lord: \"Indeed, we are by Him and for Him.\"\n\nHe addressed and He heard. This is a matter that cannot be refuted, for He is the very Essence (عين) of the matter. However, the distinction (الفضل) among people lies in what some witness (شاهده) and others are deprived of. Thus, the knower (العالم) knows about the other what the other does not know about himself concerning what he is in himself. This is how differentiation (التفاضل) appears. Yet, despite this manifestation of differentiation, the created being does not depart from the fact that The Real is his Identity (هويته), evidenced by the differentiation of the Divine Names (الأسماء الإلهية), which are the Attributes (الصفات) and are not other than Him.\n\nCreation (الخلق) is not known except through Him,\nAnd The Real (الحق) is not known except through them [the Attributes].\n\nAs for His description of Independence (الغنى) from the world, that is for those who imagine that Allah the Exalted is not the very Essence (عين) of the world, and who differentiate between the proof (الدليل) and the proven (المدلول), and who have not realized through contemplation that when the proof for a thing is the thing itself, it does not contradict itself.\n\nThe matter is one, even if the expressions concerning it differ. He is the Knower (العالم), the Knowledge (العلم), and the Known (المعلوم). He is the Proof (الدليل), the Signifier (الدال), and the Signified (المدلول). Knowledge (العلم) is known by Knowledge, so Knowledge is known to Knowledge. Thus, He is the Known, the Knowledge, and Knowledge is intrinsic (ذاتي) to the Knower (العالم). This is the saying of the theologian (المتكلم): \"He is not other than Him,\" only. As for his saying, \"He is not Him\" after this, it is because he perceives a conceptual addition (معقول زائد) to what He is. So, it remained that He is Him, but he was unable to affirm \"He is Him\" without an attribute (علم) to describe Him with, so he said, \"He is not other than Him.\" He was perplexed (حار), so he spoke what his understanding granted him. He said that the Attribute of The Real is neither Him nor other than Him.\n\nBut when we say such a statement, we do not say it in the manner of the theologian, for he necessarily conceives of an addition (الزائد), and we do not affirm the addition. The theologian does not add anything to the one who says <<إِنَّ الله فَقِيرٌ>> (Indeed, Allah is poor) except by the elegance of expression. We seek refuge in Allah from being among the ignorant. This is some of the results of this midday heat (هجير). <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو ستر قطب کے حال کے بارے میں جس کا مقام یہ تھا: \"اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا\" (وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ)۔\n\nجیسا کہ تیری تخلیق نے تجھے عطا کیا جس نے تجھے نوازا،\nتو بھی وہ عطا کر جس کے لیے تو پیدا کیا گیا ہے۔\n\nاور اگر تو اسے عطا نہیں کرتا تو مخلوق عطا کرتی ہے،\nاور وہاں وہ شکر گزار نہیں ہوتا۔\n\nاور ذات حق (الحق) کا حق زیادہ اولیٰ ہے، اے ولی،\nکہ اس کے ذریعے اس وحی کو پورا کیا جائے جو تجھ پر آئی ہے۔\n\nپس اگر تو اس کی مراد کو پہنچ جائے جیسا کہ اس نے چاہا،\nتو الٰہ تجھے اس کے ذریعے تیری مراد تک پہنچا دے گا۔\n\n### [طلب صرف ایک قسم کی عاجزی (الإذلال) کے ذریعے ہی ہوتی ہے]\n\nاللہ تعالیٰ نے فرمایا: \"اور تیرے رب نے فیصلہ کر دیا ہے کہ تم اس کے سوا کسی کی عبادت نہ کرو\" (وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ)۔ اور اس کا فیصلہ رد نہیں ہوتا۔ ہمارا علم یہ ہے کہ اس ذکر کا نتیجہ بلاشبہ اس آیت کا شہود (الشہود) ہے۔ کیونکہ ذات حق (الحق) ہی ہستی (الوجود) ہے، اور اشیاء ہستی (الوجود) کی صورتیں ہیں۔ پس یہ معاملہ مادے کا صورت سے تعلق کی طرح جڑا ہوا ہے۔ اور عبادت بلاشبہ عاجزی (ذلۃ) ہے، اس زبان میں جس میں یہ قرآن نازل کیا گیا۔\n\nاور جب کوئی امر دو چیزوں کے درمیان جڑا ہو، تو ان میں سے ہر ایک کے لیے یہ ممکن نہیں کہ وہ امر اس سے صادر ہو مگر یہ کہ وہ دوسرے امر سے جڑا ہو۔ ہم نے جانا کہ محبت (الحب) کی وجہ سے جو ان دونوں میں سے ہر ایک میں تیسرے امر کے ظہور میں قائم ہوئی، یہ دونوں جڑے ہوئے ہیں۔ اور یہ کہ وہ دوسرے امر کا طالب ہے۔ پس دونوں کی طرف سے طلب (الطلب) درست ہوئی۔ اور جو حاصل ہے اس کی جستجو نہیں کی جاتی۔ لہٰذا ضروری ہے کہ وہ دونوں اس چیز کے فقدان سے متصف ہوں جس کے وجود کی وہ جستجو کر رہے ہیں۔ اور طلب (الطلب) صرف ایک قسم کی عاجزی (الإذلال) کے ذریعے ہی ہوتی ہے۔\n\nاور فرمایا: \"اور تمہارے رب نے کہا: مجھے پکارو، میں تمہاری دعا قبول کروں گا\" (وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ)۔ پس اس نے اپنے بندوں سے دعا کی طلب کی، اور بندوں نے اس سے قبولیت کی طلب کی۔ پس سب طالب بھی ہیں اور مطلوب بھی۔ اور دلیل قائم ہو چکی ہے کہ حوادث (مخلوقات) اس (ذات حق) کے ساتھ قائم نہیں ہو سکتے۔ لہٰذا وہ اپنی ذات میں ہر طلب کے ساتھ خود مختار نہیں ہو سکتا، کیونکہ حادث کی طلب حادث ہوتی ہے، اور یہ محال ہے کہ ایسی طلب اس کے ساتھ قائم ہو۔ لہٰذا ضروری ہے کہ اس حادث طلب کے قیام کے لیے وجود کی طلب ہو، اور یہی اس کا قول ہے: \"جب ہم اس کا ارادہ کرتے ہیں\" (إِذَا أَرَدْنَاهُ)۔ اور طلب (الطلب) ارادہ (إرادۃ) ہی ہے، خواہ وہ تیری طلب اپنے لیے ہو یا تیری طلب تیرے لیے ہو۔ بہر حال، حاصل کی جستجو اس پہلو سے نہیں کی جاتی جس سے وہ مطلوب ہے، کیونکہ وہ اس پہلو سے حاصل نہیں ہے۔\n\nپس وجود (الوجود) اصلاً دو اصولوں کے بغیر درست نہیں ہو سکتا۔ پہلا اصل اقتدار (الاقتدار) ہے، جو ذات حق (الحق) کی جانب سے ہے۔ اور دوسرا اصل قبول (القبول) ہے، جو ممکن (الممکن) کی جانب سے ہے۔ پس ان دونوں اصولوں میں سے کوئی بھی وجود (الوجود) یا ایجاد (الإیجاد) میں خود مختار نہیں۔ پس وہ امر جس نے وجود (الوجود) حاصل کیا، اس نے اسے صرف اپنے قبول (القبول) سے حاصل کیا، اور اس سے جس نے اس میں اپنا اقتدار (اقتدار) نافذ کیا، اور وہ ذات حق (الحق) ہے۔ تاہم، وہ اپنے بارے میں یہ نہیں کہتا کہ وہ خود کو ایجاد کرنے والا ہے، بلکہ کہتا ہے کہ اللہ نے اسے وجود بخشا۔ اور معاملہ وہی ہے جو ہم نے ذکر کیا۔ پس ممکن (الممکن) نے اپنے ساتھ انصاف نہیں کیا اور اس وصف (ایجاد) کو اپنے رب کے لیے مخصوص کر دیا۔\n\nپس جب اللہ نے جان لیا کہ اس نے ایجاد کی نسبت اپنی ذات کی بجائے اپنے رب کی طرف دے کر اپنے رب کو خود پر ترجیح دی، تو اللہ نے اسے اس کی صورت میں ظہور (الظہور) عطا کیا بطور جزا۔ پس عالم (مخلوق) سے زیادہ کامل کوئی نہیں، کیونکہ ذات حق (الحق) سے زیادہ کامل کوئی نہیں۔ اور وجود (الوجود) کامل نہیں ہوا مگر حادث (مخلوق) کے ظہور سے۔\n\nاور جب معاملہ دونوں فریقوں کی طرف سے اس توقف اور عدمِ استقلال کی حالت میں تھا، تو ذات حق (الحق) نے اس پر متنبہ فرمایا:\n\nاپنے اس قول سے: \"میں نے نماز کو اپنے اور اپنے بندے کے درمیان دو حصوں میں تقسیم کر دیا ہے، آدھا میرے لیے اور آدھا میرے بندے کے لیے ہے۔\" (حدیث قدسی)\n\nاور یہ تقسیم، یعنی تقسیم، بندے کے استخلاف (خلافت) میں بھی موجود ہے، اور اس معاملے میں ذات حق (الحق) کی وکالت میں بھی جس میں بندہ خلیفہ ہے۔ پس وجود (الوجود) خود مختار ہوا اور حادث (مخلوق) کے ذریعے کامل ہوا۔ اور چونکہ ذات حق (الحق) کو غیرت تھی کہ اس کے ساتھ کسی اور کا ذکر کیا جائے، اس لیے اس نے عالم پر محدثات (مخلوقات) کی صورتوں میں تجلی (التجلی) فرمائی۔ اور انہوں نے ان صورتوں میں اسے پہچانا، یہ عالم کے لیے اس کی طرف سے نشانیاں تھیں کہ وہ عالمین سے بے نیاز (غنی) ہے، جیسا کہ تم نے اس کی ذات میں محدثات کی صورتوں میں ظہور (التجلی) کے ذریعے دیکھا۔ پس تمہارا ظہور اور عدمِ ظہور برابر ہے، وہ ممکن (الممکن) سے کہتا ہے۔\n\nاس وقت ممکن (الممکن) نے اپنی ذات میں بالفعل عاجزی اختیار کی، پس اس سے وہی صادر ہوا جس کے لیے اللہ نے اسے پیدا کیا تھا۔ اور ایجاد میں قبول (القبول) کے ذریعے استعداد کی عزت اس سے زائل ہو گئی، جب اس نے ان صورتوں کے اعیان کو دیکھا جو اس کے قبول اور ذات حق (الحق) کے اقتدار سے وجود میں آئیں، اور ذات حق (الحق) ان کے ذریعے ظاہر ہوا۔ پس ممکنات (الممکنات) کی اپنے قبول میں کوئی ضرورت باقی نہ رہی، اور امر حاصل ہو گیا۔ اور اس کا قول درست ہوا: \"بے شک اللہ تمام جہانوں سے بے نیاز ہے\" (فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ)۔\n\nاور جب میں یہ مسئلہ لکھ رہا تھا تو مجھ پر ایک الٰہی چمک (بارقۃ إلہیۃ) چمکی، جس میں میں نے وہ علوم دیکھے جو اللہ نے چاہے۔ جیسا کہ:\n\nنبی اکرم صلی اللہ علیہ وسلم نے خندق میں اس پتھر پر کدال ماری جو ان کے سامنے آیا تھا، تو اس ضرب میں ایک چمک (بارقۃ) چمکی، جس کے ذریعے آپ نے وہ فتوحات دیکھیں جو اللہ نے آپ کی امت پر کھولیں، یہاں تک کہ آپ نے بصریٰ کے محلات کو ہاتھی کے دانتوں کی طرح دیکھا۔ آپ نے یہ تین ضربوں میں دیکھا، ہر ضرب میں ایک چمک تھی جو آپ کے لیے ایک مخصوص جہت کو ظاہر کرتی تھی۔\n\nمیں نے یہ اس باب کو لکھتے وقت دیکھا، الحمد للہ، یہ ایک نبوی وراثت ہے۔ اور میں نے اس میں اور اس کے ذریعے دیکھا کہ اگرچہ وہ ممکنات (الممکنات) کی صورتوں میں ظاہر ہوا اور بے نیازی (الغنی) سے متصف ہوا، لیکن یہ اسے حادث (مخلوق) کے وجود میں عدمِ استقلال سے خارج نہیں کرتا، کیونکہ اس کے قبول (القبول) کی ضرورت بہرحال ہے، اور اسی میں کلام واقع ہوا۔ یہ ان چیزوں میں سے ہے جو اس چمک (بارقۃ) نے مجھے عطا کیں۔\n\nاور یہ کہ جب اللہ تعالیٰ نے انہیں اپنی عبادت کے لیے پیدا کیا، تو انہیں اپنی صفت کا لباس پہنایا، اور اسی صفت کے ذریعے اس نے انہیں طلب کیا، پس انہوں نے اسی کے ذریعے اس کی عبادت کی، کیونکہ وہ اپنی ذات کے ذریعے استقلال (استقلال) کی جہت پر اس کی عبادت نہیں کر سکتے۔ اور اسی لیے اس نے ان کے لیے یہ مشروع کیا کہ وہ اپنے قول \"ہم تیری ہی عبادت کرتے ہیں\" (إِيَّاكَ نَعْبُدُ) کے بعد \"اور ہم تجھ ہی سے مدد مانگتے ہیں\" (وَإِيَّاكَ نَسْتَعِينُ) کہیں، عبادت میں عدمِ استقلال کی وجہ سے۔ پس انہوں نے اس کی عبادت پر مدد کے لیے طلب (الطلب) کو اس کے پاس ڈالا، جیسا کہ ان کا قبول (القبول) تخلیق میں الٰہی اقتدار (الاقتدار الإلٰہی) کے لیے مدد تھا۔ اور اگر یہ ربط نہ ہوتا تو نہ عبادت درست ہوتی اور نہ ایجاد (الإیجاد)۔ پس ایجاد (الإیجاد) عبادت ہے، اور وہ اللہ کے لیے ہے، اور عبادت ایجاد ہے، اور وہ مخلوق سے مطلوب ہے۔ پس وہ عابد ہیں اور وہ معبود ہے، اور وہ موجد ہے اور وہ موجود ہیں۔\n\nپس علت (العلۃ) کا لام دونوں جانب سے ذاتی ہے، اور شرع میں اس کا نام حکمت (حکمۃ) اور سبب (سبب) ہے۔ کیونکہ وہ حکیم ہے، پس ہر چیز میں اس کے لیے ایک ظاہر حکمت ہے جسے اہل کشف (الکشف) اور وجود (الوجود) ہر چیز میں جانتے ہیں، اور اہل رسوم (ظاہری علماء) اسے ان تکالیف میں جانتے ہیں جو صرف شرع کی طرف سے معلوم ہوتی ہیں۔ پس اس کی حکمت صرف شرع کی طرف سے معلوم ہوتی ہے، جیسا کہ اس کا قول: \"اور تمہارے لیے قصاص میں زندگی ہے\" (وَلَكُمْ فِي الْقِصَاصِ حَيَاةٌ)۔ اور جہاں تک ذات حق (الحق) کی طرف سے تکلیف میں علت (العلۃ) کے قول کا تعلق ہے، تو وہ مظنون ہے، معلوم نہیں۔ لیکن اس نے ان کے لیے استنباط کا دروازہ کھول دیا ہے، اس تعلیل کے ذریعے جو اس نے نازل شدہ وحی میں ان کے لیے ذکر کی ہے، پس اس میں سے کچھ واضح ہے اور کچھ پوشیدہ۔ اسی طرح اس کے لیے اشیاء میں ایک باطنی حکمت ہے جسے صرف وہی جانتا ہے اور جسے اللہ نے اس سے آگاہ کیا۔\n\nاور اسی لیے اس نے فرمایا: \"جن\" (الجن) جو پوشیدہ ہے، پس وہ صرف اسی سے معلوم ہوتا ہے، اور \"انس\" (الإنس) جو ظاہر ہے، پس وہ اپنی ذات سے معلوم ہوتا ہے جہاں وہ ظاہر ہوا: \"صرف میری عبادت کے لیے\" (إِلَّا لِيَعْبُدُونِ)۔ یہ تخلیق کے موجب سبب کا اثبات ہے۔ پس یہ شرعاً حکمت (حکمۃ) اور سبب (سبب) کا لام ہے، اور عقلاً علت (علۃ) کا لام ہے۔ اور عبادت مخلوق کے لیے ذاتی ہے، اس میں اسے تکلیف کی ضرورت نہیں۔ لہٰذا ضروری ہے کہ خالق ہر اس صورت کا عین ہو جس کی مخلوق عبادت کرتی ہے، اس کے باوجود کہ صورت کو مادے کی ضرورت ہے۔ اور اگر معاملہ ایسا نہ ہو، تو مخلوق کی طرف سے عبادت ذاتی نہیں ہو گی۔ کیونکہ اگر ہم عرف میں صرف \"اللہ\" کے نام پر اکتفا کریں، تو مخلوق غیر اللہ کی عبادت کرے گی، کیونکہ ہم دیکھتے ہیں کہ اکثر عالم صرف اسباب کے محتاج ہیں۔\n\nاور یہ کیسے ہو سکتا ہے، جبکہ اس نے فرمایا: \"اور تیرے رب نے فیصلہ کر دیا ہے کہ تم اس کے سوا کسی کی عبادت نہ کرو\" (وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ) اور \"اے لوگو! تم اللہ کے محتاج ہو\" (يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ)۔ اور اس نے کبھی کسی مخلوق کے غیر اللہ کے محتاج ہونے کا ذکر نہیں کیا، اور نہ ہی یہ فیصلہ کیا کہ غیر اللہ کی عبادت کی جائے۔ لہٰذا ضروری ہے کہ وہ ہر چیز کا عین ہو، یعنی ہر اس چیز کا عین ہو جس کا وہ محتاج ہے، اور ہر اس چیز کا عین ہو جس کی عبادت کی جاتی ہے، جیسا کہ وہ ہر عابد کا عین ہے، اپنے اس قول سے بھی: \"میں اس کی سماعت ہوتا ہوں\" (كُنْتُ سَمْعَهُ) جب اس نے اسے تکلیف اور تعریف کے ساتھ مخاطب کیا۔ پس اس نے اس کے کلام کو صرف اپنی سماعت سے سنا۔ اور اسی طرح اس کی تمام قوتیں جن کے بغیر اللہ کا عابد نہیں ہو سکتا۔ پس عابد اور معبود میں اس کی ہویت (ہویۃ) کے سوا کچھ ظاہر نہیں ہوا۔ پس اس کی حکمت، اس کا سبب، اور اس کی علت صرف وہی تھا، اور اس کا معلول اور مسبب صرف وہی تھا۔ پس اسی کی عبادت کی گئی اور اسی نے عبادت کی۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے اپنے خطبہ میں جب اپنے رب کی ثنا کی تو فرمایا: \"پس ہم اسی کے ذریعے ہیں اور اسی کے لیے ہیں\" (فَإِنَّمَا نَحْنُ بِهِ وَلَهُ)۔\n\nپس اس نے مخاطب کیا اور سنا۔ اور یہ ایک ایسا امر ہے جو رد نہیں ہو سکتا، کیونکہ وہ امر کا عین ہے۔ البتہ، لوگوں کے درمیان فضیلت (الفضل) اس چیز کی وجہ سے ہے جس کا بعض نے شہود (الشہود) کیا اور بعض اس سے محروم رہے۔ پس عالم دوسرے سے وہ جانتا ہے جو دوسرا اپنی ذات کے بارے میں نہیں جانتا، اس چیز میں جو وہ اپنی ذات میں ہے۔ پس تفاضل (التفاضل) ظاہر ہوا۔ اور اس ظہور کے باوجود، مخلوق اس سے خارج نہیں ہوتی کہ ذات حق (الحق) اس کی ہویت (ہویۃ) ہو، اس کی دلیل الٰہی اسماء (صفات) کا تفاضل ہے، اور وہ اس کے غیر نہیں ہیں۔\n\nپس مخلوق صرف اسی کے ذریعے جانتی ہے،\nاور ذات حق (الحق) صرف ان (صفات) کے ذریعے جانا جاتا ہے۔\n\nاور جہاں تک اس کے عالم سے بے نیاز (غنی) ہونے کے وصف کا تعلق ہے، تو وہ اس شخص کے لیے ہے جو یہ وہم کرتا ہے کہ اللہ تعالیٰ عالم کا عین نہیں ہے، اور دلیل (الدلیل) اور مدلول (المدلول) کے درمیان فرق کرتا ہے، اور نظر کے ذریعے حقیقت کو نہیں پاتا۔ جب دلیل خود شے پر ہو، تو وہ اپنی ذات کی ضد نہیں ہوتی۔ پس امر ایک ہی ہے، اگرچہ اس پر عبارات مختلف ہوں۔ پس وہ عالم (جاننے والا)، علم (العلم)، اور معلوم (المعلوم) ہے۔ پس وہ دلیل (الدلیل)، دال (الدال)، اور مدلول (المدلول) ہے۔ پس علم (العلم) کے ذریعے علم جانا جاتا ہے، پس علم، علم کے لیے معلوم ہے، پس وہ معلوم (المعلوم) اور علم (العلم) ہے۔ اور علم (العلم) عالم (العالم) کے لیے ذاتی ہے۔ اور یہی متکلم کا قول ہے کہ وہ صرف اس کا غیر نہیں ہے۔ اور جہاں تک اس کے بعد اس کے قول \"اور وہ وہ نہیں ہے\" کا تعلق ہے، تو یہ اس لیے ہے کہ وہ دیکھتا ہے کہ وہ ایک معقول زائد ہے اس پر جو وہ ہے۔ پس یہ باقی رہا کہ وہ \"وہ\" ہے۔ اور وہ اس علم کے بغیر جو اسے بیان کرتا ہے، \"وہ\" کو ثابت کرنے پر قادر نہ ہو سکا۔ پس اس نے کہا: \"وہ اس کا غیر نہیں ہے۔\" پس وہ حیران ہوا، اور اس نے وہ بات کہی جو اس کی سمجھ نے اسے عطا کی، پس اس نے کہا کہ ذات حق (الحق) کی صفت نہ وہ ہے اور نہ اس کا غیر ہے۔ لیکن جب ہم ایسی بات کہتے ہیں، تو ہم اسے اس طرح نہیں کہتے جس طرح متکلم کہتا ہے، کیونکہ وہ زائد کو معقول سمجھتا ہے، اور یہ ضروری ہے۔ اور ہم زائد کے قائل نہیں ہیں۔ پس متکلم اس شخص پر کوئی اضافہ نہیں کرتا جو کہتا ہے: \"بے شک اللہ فقیر ہے\" (إِنَّ اللَّهَ فَقِيرٌ) مگر اچھی عبارت کے ذریعے۔ اور ہم اللہ کی پناہ مانگتے ہیں کہ ہم جاہلوں میں سے ہوں۔ پس یہ اس دوپہر کے کچھ نتائج ہیں۔ \"اور اللہ حق کہتا ہے اور وہی راہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و هفتادم در حال قطبی که منزل او [آیه] «و جن و انس را نیافریدم مگر برای آنکه مرا عبادت کنند» (وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ) بود.\n\nهمان‌گونه که آفرینش تو را از کسی که تو را دوست داشت، به تو بخشید؛\nپس تو نیز آنچه را که برای آن آفریده شدی، به همان‌گونه ببخش.\n\nو اگر تو آن را نبخشی، آفرینش می‌بخشد؛\nاما در آنجا سپاسگزاری نخواهد شد.\n\nای ولی، حقِ حق (الحق) سزاوارتر است\nکه وحی‌ای که به تو رسیده، آن را حکم کند.\n\nپس اگر به آرزوی او [حق] برسی، همان‌گونه که او آرزو کرد،\nخداوند تو را به واسطه آن به آرزویت می‌رساند.\n\n### [طلب (خواستن) جز با نوعی از خواری (الإذلال) محقق نمی‌شود]\n\nخداوند متعال فرمود: «و پروردگارت حکم کرد که جز او را نپرستید» (وَقَضَى رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ). حکم او رد نمی‌شود. ما می‌دانیم که نتیجه این ذکر، بی‌شک، شهود (الشهود) این آیه است. زیرا حق (الحق) همان هستی (الوجود) است و اشیاء، صورت‌های هستی هستند. پس امر [عبادت] مانند ارتباط ماده با صورت، مرتبط شد. و عبادت، بی‌شک، در زبانی که این قرآن به آن نازل شده، خواری (ذلة) است. و هنگامی که امری میان دو چیز مرتبط شود، محال است که آن امر از هر یک از آن دو صادر شود مگر به واسطه ارتباطش با امر دیگر. ما دانستیم که هر یک از این دو امر مرتبط، به دلیل محبتی است که در هر یک از آن‌ها برای ظهور امر سوم پدید آمده است، و آن [امر سوم] طالب امر دوم است. پس طلب از هر دو صحیح است. و آنچه حاصل است، طلب نمی‌شود. بنابراین، ناگزیر باید هر دو به فقدان آنچه وجودش را می‌خواهند، متصف باشند. و طلب (الطلب) جز با نوعی از خواری (الإذلال) محقق نمی‌شود.\n\nو [خداوند] فرمود: «پروردگارتان گفت: مرا بخوانید تا شما را اجابت کنم» (وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ). پس او دعا را از بندگانش طلب کرد و بندگان نیز اجابت را از او طلب کردند. بنابراین، همه طالب و مطلوب هستند. و دلیل قائم شده است که حوادث (مخلوقات) به ذات او قائم نمی‌شوند. پس او در ذات خود به هر طلبی مستقل نیست، زیرا طلب از حادث، خود حادث است و محال است که چنین طلبی به او قائم شود. پس ناگزیر باید وجود چیزی که این طلب حادث به آن قائم شود، طلب شود، و آن همان قول اوست: «اگر آن را اراده کنیم». و طلب، اراده است، چه طلب تو برای خودش باشد و چه طلب تو برای تو باشد. در هر حال، آنچه حاصل است، از آن وجهی که طلب می‌شود، طلب نمی‌شود؛ زیرا از آن وجه حاصل نیست. پس هستی (الوجود) اصلاً صحیح نیست مگر از دو اصل: اصل اول، اقتدار (الاقتدار) است که به جانب حق (الحق) تعلق دارد؛ و اصل دوم، قبول (القبول) است که به جانب ممکن (الممكن) تعلق دارد. پس هیچ یک از این دو اصل، در هستی و نه در ایجاد، استقلال ندارند.\n\nپس امری که هستی (الوجود) را کسب کرده، آن را کسب نکرده مگر از خودش به واسطه قبولش، و از کسی که اقتدارش در او نفوذ کرده، و او حق (الحق) است. با این حال، [ممکن] در درون خود نمی‌گوید که خودش، خود را ایجاد کرده است، بلکه می‌گوید خداوند او را ایجاد کرده است. و امر بر همان است که ذکر کردیم. پس ممکن (الممكن) در حق خود انصاف نداد و این وصف [ایجاد] را به پروردگارش ترجیح داد. هنگامی که خداوند دانست که او پروردگارش را بر خود ترجیح داده و ایجاد را به او نسبت داده است، به عنوان پاداش، ظهور به صورت خودش را به او عطا کرد. پس کامل‌تر از عالم نیست، زیرا کامل‌تر از حق (الحق) نیست. و هستی (الوجود) کامل نشد مگر با ظهور حادث (الحادث).\n\nو چون امر در این توقف و عدم استقلال از هر دو طرف بود، حق (الحق) بر آن با این قول تنبیه کرد: «نماز را میان خود و بنده‌ام دو نیم کردم؛ نیمی از آن برای من و نیمی برای بنده‌ام است.»\n\nو این [تقسیم]، یعنی تقسیم، در استخلاف بنده و در وکالت حق (الحق) در آنچه بنده در آن خلیفه است نیز موجود است. پس هستی (الوجود) مستقل شد و با حادث (الحادث) کامل گشت. و چون حق (الحق) غیرت داشت که غیر او با او ذکر شود، در صورت‌های محدثات (مخلوقات) بر عالم تجلی (التجلی) کرد و آن‌ها در آن [محدثات] نشانه‌هایی از او برای عالم دانستند که او از جهانیان بی‌نیاز است، به واسطه آنچه در ذات او دیدید از ظهورش به تجلی (التجلی) در صورت‌های محدثات. پس [خداوند] به ممکن (الممكن) می‌گوید: ظهور شما و عدم شما یکسان است. در این هنگام، ممکن در ذات خود عملاً خوار شد و آنچه خداوند او را برای آن آفریده بود، از او صادر گشت. و عزت استعداد به قبول در ایجاد از او زایل شد، هنگامی که اعیان صورت‌هایی را دید که از قبول او و اقتدار حق (الحق) حاصل شده بودند و حق (الحق) به واسطه آن‌ها ظاهر شده بود. پس نیازی به ممکنات در قبول آن‌ها نبود و امر حاصل شد و قول او صحیح گشت: «پس همانا خداوند از جهانیان بی‌نیاز است» (فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ).\n\nو هنگام ثبت این مسئله، بارقه‌ای الهی بر من درخشید که در آن، آنچه خداوند خواست از علوم را دیدم؛ همان‌گونه که پیامبر (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) با کلنگ بر سنگی که در خندق برایشان ظاهر شده بود، زد و در آن ضربه، بارقه‌ای درخشید که با آن، آنچه خداوند بر امتش گشوده بود را دید، تا جایی که قصرهای بُصری را مانند دندان‌های فیل دید. این را در سه ضربه دید که در هر ضربه، بارقه‌ای بود که جهتی مخصوص را برای او آشکار می‌ساخت.\n\nاین را هنگام ثبت این باب، به حمدالله، به صورت وراثت نبوی دیدم. و در آن [بارقه] و به واسطه آن دیدم که اگرچه [حق] به صورت‌های ممکنات (الممكنات) ظاهر شده و به بی‌نیازی متصف است، اما این امر او را از عدم استقلال در وجود حادث (الحادث) به واسطه او خارج نمی‌سازد، زیرا ناگزیر باید قبول (القبول) [از جانب ممکن] باشد و سخن در همین‌جاست. این از چیزهایی است که آن بارقه به من عطا کرد. و همانا خداوند متعال چون آن‌ها را برای عبادتش آفرید، صفت خود را بر آن‌ها پوشاند، و این همان صفتی است که با آن، آن‌ها را طلب کرد. پس آن‌ها با آن صفت، او را عبادت کردند، زیرا صحیح نیست که او را به صورت مستقل با نفس خود عبادت کنند.\n\nو به همین دلیل برایشان تشریع کرد که پس از گفتن «تنها تو را می‌پرستیم» (إِيَّاكَ نَعْبُدُ)، بگویند: «و تنها از تو یاری می‌جوییم» (وَإِيَّاكَ نَسْتَعِينُ)، به دلیل عدم استقلال در عبادت. پس طلب یاری در عبادتش را نزد آن‌ها القا کرد، همان‌گونه که قبول (القبول) از جانب آن‌ها، یاری برای اقتدار (الاقتدار) الهی در خلق بود. و اگر این ارتباط نبود، نه عبادتی صحیح بود و نه ایجادی (الإيجاد). پس ایجاد، عبادت است و آن از آنِ خداست؛ و عبادت، ایجاد است و آن از خلق خواسته شده است. پس آن‌ها عابدان هستند و او معبود است؛ او ایجادکننده (الموجد) است و آن‌ها موجودات (الموجودون) هستند. پس لام علّت (لام العلة) از هر دو جانب ذاتی است و نام آن در شرع، حکمت و سبب است. زیرا او حکیم است. پس در هر چیزی حکمتی آشکار دارد که اهل کشف (الکشف) و هستی (الوجود) آن را در هر چیز می‌دانند، و اهل رسوم [ظاهر] آن را در تکالیفی می‌دانند که جز از طریق شرع دانسته نمی‌شود. پس حکمت آن جز از طریق شرع دانسته نمی‌شود، مانند قول او: «و برای شما در قصاص، زندگی است» (وَلَكُمْ فِي الْقِصَاصِ حَيَاةٌ).\n\nاما قول به علّت در تکلیف از جانب حق (الحق)، گمانی است و معلوم نیست. اما باب استنباط را برای آن‌ها گشوده است به واسطه آنچه از تعلیل (علت‌یابی) در وحی نازل شده برایشان ذکر کرده است؛ که برخی از آن آشکار و برخی پنهان است. همچنین او در اشیاء حکمتی باطنی دارد که جز او و کسی که خداوند او را آگاه سازد، نمی‌داند. و به همین دلیل [خداوند] فرمود: جن (الجن) که همان پنهان است و جز از او دانسته نمی‌شود، و انس (الإنس) که همان آشکار است و به ذات خود دانسته می‌شود، آنجا که ظاهر شده است: «مگر برای آنکه مرا عبادت کنند» (إِلَّا لِيَعْبُدُونِ). این اثبات سببِ موجبِ خلق است. پس این، لامِ حکمت و سبب از نظر شرع، و لامِ علّت از نظر عقل است. و عبادت برای مخلوق ذاتی است و در آن نیازی به تکلیف ندارد. پس ناگزیر باید خالق، عین هر صورتی باشد که مخلوق آن را می‌پرستد، با وجود نیاز صورت به ماده.\n\nو اگر امر چنین نباشد، عبادت از مخلوق ذاتی نخواهد بود. زیرا اگر به اسم «الله» در عرف اکتفا کنیم، مخلوق غیر خدا را پرستیده است. ما می‌بینیم که بیشتر مردم جز به اسباب نیازمند نیستند. و چگونه [ممکن است غیر خدا را بپرستند] در حالی که [خداوند] فرمود: «و پروردگارت حکم کرد که جز او را نپرستید» (وَقَضَى رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ) و «ای مردم، شما نیازمندان به سوی خدا هستید» (يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ). و هرگز نیازمندی مخلوقی به غیر خدا را ذکر نکرده و حکم نکرده است که غیر خدا پرستیده شود. پس ناگزیر باید او عین هر چیزی باشد؛ یعنی عین هر آنچه که به آن نیازمند است و عین آنچه که پرستیده می‌شود، همان‌گونه که او عین عابد از هر عابدی است، به واسطه قولش: «گوش او بودم» هنگامی که او را با تکلیف و تعریف مخاطب ساخت. پس کلام او را نشنید مگر با گوش او. و همچنین تمام قوای او که عابد خدا جز با آن‌ها نیست. پس در عابد و معبود جز هویت (ذات) او ظاهر نشد.\n\nپس حکمت و سبب و علّت او جز او نبود، و معلول و مسبَّب او جز او نبود. پس او را پرستید و پرستیده شد.\n\nپیامبر (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) در خطبه‌اش هنگامی که پروردگارش را ستایش کرد، فرمود: «همانا ما به او هستیم و برای او هستیم» (فَإِنَّمَا نَحْنُ بِهِ وَلَهُ). پس مخاطب ساخت و شنید. و این امری است که دفع نمی‌شود، زیرا او عین امر است. جز اینکه برتری میان مردم به واسطه چیزی است که برخی آن را شهود (الشهود) کرده‌اند و برخی از آن محروم مانده‌اند. پس عارف (العالم) از غیر خود چیزی را می‌داند که آن غیر از نفس خود نمی‌داند، در آنچه که در نفس خود بر آن است. پس برتری (التفاضل) ظاهر شد. و با وجود این ظهور، مخلوق از اینکه حق (الحق) هویت (ذات) او باشد، خارج نمی‌شود، به دلیل برتری اسماء الهی که همان صفات هستند و غیر او نیستند.\n\nپس خلق جز به واسطه او دانسته نمی‌شود\nو حق (الحق) جز به واسطه آن‌ها (صفات) دانسته نمی‌شود.\n\nو اما وصف او به بی‌نیازی از عالم (الغنى عن العالم)، تنها برای کسی است که توهم کرده که خداوند متعال عین عالم نیست و میان دلیل و مدلول فرق گذاشته و به نظر [صحیح] نرسیده است. هنگامی که دلیل بر شیء، خود آن شیء باشد، با خود متضاد نمی‌شود. پس امر واحد است، اگرچه عبارات بر آن مختلف باشد. پس اوست عالم و علم و معلوم؛ اوست دلیل و دال و مدلول. پس علم به واسطه علم دانسته می‌شود. پس علم، معلومِ علم است. پس اوست معلوم و علم. و علم برای عالم ذاتی است. و این قول متکلم است که می‌گوید: «آن [صفت] فقط غیر او نیست». و اما قول او پس از این که «آن [صفت] خود او نیست»، به دلیل آن است که می‌بیند آن [صفت] معقولی است که بر آنچه او هست، افزوده شده است. پس باقی ماند که [صفت] خود او باشد، اما نتوانست او را بدون علمی که او را با آن وصف کند، اثبات کند. پس گفت: «آن غیر او نیست». پس سرگردان شد و به آنچه فهمش به او داد، سخن گفت و گفت: «صفت حق (الحق) نه خود اوست و نه غیر او». اما هنگامی که ما چنین قولی می‌گوییم، آن را به شیوه‌ای که متکلم می‌گوید، نمی‌گوییم؛ زیرا او ناگزیر زائد را تعقل می‌کند، در حالی که ما قائل به زائد نیستیم. پس متکلم بر کسی که می‌گوید: «همانا خداوند فقیر است» (إِنَّ اللَّهَ فَقِيرٌ)، جز به نیکویی عبارت، برتری ندارد. و پناه می‌بریم به خدا از اینکه از جاهلان باشیم. این برخی از نتایج این [سفر] نیمروزی است. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 3
}