{
  "id": 391,
  "title": {
    "ar": "الباب الأحد والتسعون وثلاثمائة في معرفة منازلة المسلك السيال الذي لا يثبت عليه أقدام الرجال السؤال",
    "en": "Chapter Three Hundred and Ninety-One: Concerning the Gnosis of the Stations of the Ever-Flowing Path, upon which the feet of the Questioning Seekers cannot stand firm.",
    "ur": "باب تین سو اکیانوے: سیال مسلک (المسلك السيال) کے منازل کی معرفت کے بیان میں، جس پر سالکین (الرجال) کے قدم ثابت نہیں رہتے، سوال۔",
    "fa": "باب سیصد و نود و یکم در معرفت منازل سالک روان (المسلک السیال) که قدم‌های مردان سؤال بر آن ثابت نمی‌ماند"
  },
  "content": {
    "ar": "## «الباب الأحد والتسعون وثلاثمائة في معرفة منازلة المسلك السيال الذي لا يثبت عليه أقدام الرجال السؤال»\n\n\n> رأيت الحق في الأعيان حقا *** وفي الأسماء فلم أره سوائي‏\n\n\n> ولست بحاكم في ذاك وحدي *** فهذا حكمه في كل رائي‏\n\n\n> وعند المثبتين خلاف هذا *** هو الرائي ونحن له المرائي‏\n\n\n### [الأعيان المحدثات‏]\n\n\nقال الله عز وجل فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ وهو القائل واقْتُلُوهُمْ حَيْثُ وَجَدْتُمُوهُمْ فأظهر آمرا وأمرا ومأمورا في هذا الخطاب التكليفي فلما وقع الامتثال وظهر القتل بالفعل من أعيان المحدثات قال ما هم أنتم الذين قتلتموهم بل أنا قتلتهم فأنتم لنا بمنزلة السيف لكم أو أي آلة كانت للقتل فالقتل وقع في المقتول بالآلة ولم يقل فيه إنه القاتل وقيل في الضارب إنه القاتل كذلك الضارب به بالنسبة إلينا مثل السيف له عنده فلا يقال في المكلف إنه القاتل بل الله هو القاتل بالمكلف وبالسيف فقام له المكلف مقام اليد الضاربة بالسيف كالحجر الأسود يمين الله في البيعة تقبيلا واستلاما كالمصافحة من الشخصين وتحرير هذه المنازلة معرفة الأمور الموجبة للاحكام هل لها أعيان وجودية أو هي نسب تطلبها الأحكام فهي معقولة بأحكامها وبقي العلم في المحل الذي ظهرت فيه هذه الأحكام ما هو هل هو عين الممكن وهذه النسب للمرجح مثل ما قال فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ وقوله والله خَلَقَكُمْ وما تَعْمَلُونَ أو هل المحل وجود الحق وهذه الأحكام أثر الممكنات في وجود الحق وهو ما يظهر فيه من الصور فكل صورة تشهد صورة وهي آثار الممكنات في وجود الحق فيرى زيد صورة خالد في وجود حق ويرى خالد صورة زيد في وجود حق وكذلك كل حالة يرى تلك الصورة عليها مثل الصورة سواء وكلا الأمرين قد قال به طائفة من أهل الله وكيفما كان على القولين فلا يتمكن لكل صاحب قول الثبات على أمر واحد بل بنفس ما يثبت الحكم لأمر يثبته لأمر آخر وينفيه عن ذلك الأمر الأول فهو ينفي السابق ويثبت اللاحق فبأي أمر بدأ يكون له هذا الحكم في القولين معا مثل قوله وما رَمَيْتَ‏\nفنفى إِذْ رَمَيْتَ فأثبت الرمي لمن نفاه عنه ثم لم يثبت على الإثبات بل أعقب الإثبات نفيا كما أعقب النفي إثباتا فقال ولكِنَّ الله رَمى‏ فما أسرع ما نفى وما أسرع ما أثبت لعين واحدة فلهذا سميت هذه المنازلة المسلك السيال تشبيها بسيلان الماء الذي لا يثبت على شي‏ء من مسلكه إلا قدر مروره عليه فقدم رجاله غير ثابتة على شي‏ء بعينه لأن المقام يعطي ذلك وهو عين قوله كُلَّ يَوْمٍ هُوَ في شَأْنٍ ومقدار اليوم الزمن الفرد وكذلك قوله تعالى\n\n\nولا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ مع كونهم سمعوا فانظر إلى هذا الذم كيف أشبه غاية الحمد فيمن كان الحق سمعه وبصره فمن كان الحق سمعه فقد سمع ضرورة فلم يسمع إلا بربه فهو سامع لا بنفسه ولا يصح أن يكون محلا لهوية ربه فعينه وجود الحق والحكم للممكن فإن ذلك أثره ولَوْ عَلِمَ الله فِيهِمْ خَيْراً لَأَسْمَعَهُمْ والوجود هو الخير فيتصفون بالوجود ولَوْ أَسْمَعَهُمْ إذ أوجدهم لَتَوَلَّوْا إلى ذواتهم فيعلمون أنهم ما سمعوا فكنى عنه بالإعراض لأن الحق هو السامع وهم له كالأذن لنا آلة نسمع بها أصوات المصوتين وكلام المتكلمين فهو المخاطب وهو المتكلم السامع يا أَيُّهَا الَّذِينَ آمَنُوا أي صدقوا بما قلنا اسْتَجِيبُوا لِلَّهِ ولِلرَّسُولِ إِذا دَعاكُمْ فوحد الداعي بعد ذكر الاثنين فعلمنا إن الأمر واحد وما سمعنا متكلما إلا الرسول بالسماع الحسي وسمعنا كلام الحق بسمع الحق بالسمع المعنوي فالله والرسول اسمان للمتكلم فإن الكلام لله كما قال الله والمتكلم المشهود عين لسان محمد صَلَّى اللهُ عَليهِ وسَلَّم من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله‏\n\n\n> فليس عيني سواه *** فما أبيت إياه‏\n\n\n> فمن يشاهد بعين *** الوجود يشهد إياه‏\n\n\n> فنحن فيه سواء *** كما يراني أراه‏\n\n\nوقد ذكرناه جماع هذا الباب مختصرا كافيا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Three Hundred and Ninety-One: Concerning the Knowledge of the Station of the Flowing Path upon which the Feet of the Questioning Men Cannot Stand Firm\n\n> I saw The Real (الحق) as Reality in the Fixed Entities (الأعيان),\n> And in the Names (الأسماء), I did not see Him other than myself.\n> I am not the only one judging in this matter,\n> For this is His judgment in every seer.\n> But among those who affirm (المثبتين), the opposite holds:\n> He is the Seer (الرائي), and we are the Seen (المرائي) for Him.\n\n### [The Originated Entities (الأعيان المحدثات)]\n\nAllah, the Mighty and Majestic, said: <<فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ>> (So you did not kill them, but Allah killed them). And He is the One who said: <<واقْتُلُوهُمْ حَيْثُ وَجَدْتُمُوهُمْ>> (And kill them wherever you find them).\n\nThus, He manifested a Commander, a Command, and a commanded one in this address of obligation (الخطاب التكليفي). When the compliance occurred and the act of killing manifested through the originated entities (أعيان المحدثات), He said: It was not you who killed them, but I killed them.\n\nTherefore, you are to Us in the position of the sword to you, or whatever instrument was used for the killing. The killing occurred in the slain by means of the instrument, yet the instrument is not called the killer. The striker is called the killer. Similarly, the one who strikes with it is, relative to Us, like the sword is to him (the striker). Thus, the obligated person (المكلف) is not called the killer; rather, Allah is the Killer, acting through the obligated person and through the sword. The obligated person thus stands in the position of the hand striking with the sword, just as the Black Stone (الحجر الأسود) is the Hand of Allah in the covenant (البيعة), through kissing and touching, like the handshake between two people.\n\nThe clarification (تحرير) of this station (منازلة) lies in knowing whether the matters that necessitate the judgments (الأحكام) possess existent entities (أعيان وجودية), or whether they are merely relations (نسب) demanded by the judgments, thus being intelligible only through their judgments.\n\nIt remains to be known what the locus (المحل) is in which these judgments appear. Is it the essence of the contingent (عين الممكن), and are these relations (نسب) for the sake of preponderance (المرجح), as He said: <<فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ>> (So you did not kill them, but Allah killed them), and His saying: <<والله خَلَقَكُمْ وما تَعْمَلُونَ>> (And Allah created you and what you do)?\n\nOr is the locus the Being of The Real (وجود الحق), and are these judgments the effect of the contingent things (الممكنات) within the Being of The Real, which is what manifests therein as forms (الصور)? Thus, every form witnesses a form, and these are the effects of the contingent things within the Being of The Real. Zayd sees the form of Khalid in the Being of The Real, and Khalid sees the form of Zayd in the Being of The Real. Likewise, every state sees that form upon it, exactly like the form itself.\n\nBoth of these views have been held by a group of the People of Allah (أهل الله). However, regardless of which of the two views is held, it is impossible for the proponent of either view to remain firm upon a single matter. Rather, by the very principle through which he affirms a judgment for one thing, he affirms it for another and negates it from the first thing. Thus, he negates the former and affirms the latter.\n\nWhichever matter he begins with, this judgment applies to him in both views simultaneously. For example, His saying: <<وما رَمَيْتَ>> (And you did not throw), which negates the act, followed by <<إِذْ رَمَيْتَ>> (when you threw), which affirms the throwing for the one from whom He had negated it. Then He did not remain firm upon the affirmation, but followed the affirmation with a negation, just as He followed the negation with an affirmation, saying: <<ولكِنَّ الله رَمى>> (But Allah threw).\n\nHow quickly He negated, and how quickly He affirmed, concerning a single entity (عين واحدة)! For this reason, this station (منازلة) is called the Flowing Path (المسلك السيال), likened to the flowing of water, which does not remain firm upon any part of its course except for the duration of its passage over it. Therefore, the feet of its men are not fixed upon any specific thing, because the station demands this, and this is the very meaning of His saying: <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>> (Every day He is in a [new] manifestation/state). The measure of the day here is the singular moment (الزمن الفرد).\n\nAnd His saying, the Exalted: <<ولا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ>> (And be not like those who say, \"We have heard,\" while they do not hear), despite the fact that they did hear. Look at how this censure resembles the ultimate praise for the one whose hearing and sight are The Real (الحق).\n\nFor whoever has The Real as his hearing has necessarily heard, and he hears only through his Lord. Thus, he is a hearer, but not by himself. It is not correct for him to be the locus (محلا) for the identity (هوية) of his Lord. His essence (عينه) is the Being of The Real (وجود الحق), and the judgment belongs to the contingent (الممكن), for that is its effect.\n\n<<ولَوْ عَلِمَ الله فِيهِمْ خَيْراً لَأَسْمَعَهُمْ>> (If Allah had known any good in them, He would have made them hear). And Being (الوجود) is the good, so they are characterized by Being. <<ولَوْ أَسْمَعَهُمْ>> (And if He had made them hear) when He brought them into existence, <<لَتَوَلَّوْا>> (they would have turned away) to their own essences (ذواتهم), knowing that they had not heard. Thus, He alluded to this by turning away (الإعراض), because The Real is the Hearer, and they are to Him like the ear is to us—an instrument by which we hear the sounds of those who call out and the speech of those who speak.\n\nHe is the Addressed and He is the Speaker, the Hearer. <<يا أَيُّهَا الَّذِينَ آمَنُوا>> (O you who have believed)—that is, believed in what We have said—<<اسْتَجِيبُوا لِلَّهِ ولِلرَّسُولِ إِذا دَعاكُمْ>> (Respond to Allah and to the Messenger when he calls you). He unified the caller (الداعي) after mentioning the two (Allah and the Messenger), so we know that the matter is one.\n\nWe have not heard a speaker except the Messenger through sensory hearing (السماع الحسي), and we heard the speech of The Real (كلام الحق) through the hearing of The Real (بسمع الحق) by means of spiritual hearing (السمع المعنوي). Thus, Allah and the Messenger are two Names (اسمان) for the Speaker, for the speech belongs to Allah, as Allah said, and the witnessed speaker is the very tongue of Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم). <<من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله>> (Whoever obeys the Messenger has obeyed Allah).\n\n> My essence (عيني) is none other than Him,\n> So I do not deny Him.\n> Whoever witnesses (يشاهد) with the eye of Being (عين الوجود),\n> Witnesses Him.\n> We are equal in Him,\n> Just as He sees me, I see Him.\n\nWe have mentioned the summary (جماع) of this chapter concisely and sufficiently. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب تین سو اکیانوے: سیال مسلک (المسلك السيال) کے مقام کی معرفت میں، جس پر سوال کرنے والے مردوں کے قدم نہیں جمتے۔\n\nمیں نے اعیان میں الحق (ذات حق) کو حق دیکھا\nاور اسماء میں اسے اپنے سوا نہیں دیکھا\n\nمیں اس معاملے میں اکیلا فیصلہ کرنے والا نہیں ہوں\nیہ ہر دیکھنے والے کا حکم ہے\n\nاور ثابت کرنے والوں کے نزدیک اس کے برعکس ہے\nوہ دیکھنے والا ہے اور ہم اس کے لیے دیکھے جانے والے ہیں۔\n\n[محدث اعیان (الأعيان المحدثات)]\n\nاللہ عزوجل نے فرمایا: \"فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ\" (پھر تم نے انہیں قتل نہیں کیا بلکہ اللہ نے انہیں قتل کیا)۔ اور وہی فرمانے والا ہے: \"واقْتُلُوهُمْ حَيْثُ وَجَدْتُمُوهُمْ\" (اور انہیں قتل کرو جہاں تم انہیں پاؤ)۔ پس اس تکلیفی خطاب میں اس نے ایک آمر (حکم دینے والا)، ایک امر (حکم)، اور ایک مأمور (جسے حکم دیا گیا) کو ظاہر کیا۔ پھر جب تعمیل واقع ہوئی اور محدث اعیان (الأعيان المحدثات) کی طرف سے بالفعل قتل ظاہر ہوا، تو اس نے فرمایا: تم وہ نہیں ہو جنہوں نے انہیں قتل کیا، بلکہ میں نے انہیں قتل کیا۔ پس تم ہمارے لیے اس تلوار کی مانند ہو جو تمہارے پاس ہے، یا قتل کے لیے کوئی بھی آلہ ہو۔ چنانچہ مقتول میں قتل آلہ کے ذریعے واقع ہوا، اور آلہ کے بارے میں یہ نہیں کہا گیا کہ وہ قاتل ہے، بلکہ مارنے والے (ضارب) کے بارے میں کہا گیا کہ وہ قاتل ہے۔ اسی طرح، اس (آلہ) سے مارنے والا ہمارے نزدیک اس کے لیے تلوار کی مانند ہے۔ لہٰذا مکلف (جس پر ذمہ داری ڈالی گئی) کے بارے میں یہ نہیں کہا جائے گا کہ وہ قاتل ہے، بلکہ اللہ ہی مکلف کے ذریعے اور تلوار کے ذریعے قاتل ہے۔ پس مکلف اس کے لیے تلوار سے مارنے والے ہاتھ کی جگہ کھڑا ہوا، جیسے حجر اسود بیعت میں اللہ کا دایاں ہاتھ ہے، بوسہ دینے اور چھونے کے ذریعے، جیسے دو اشخاص کا مصافحہ کرنا۔\n\nاور اس مقام (منازلہ) کی تحقیق یہ ہے کہ ان امور کی معرفت حاصل کی جائے جو احکام کو واجب کرتے ہیں: کیا ان کے وجودی اعیان (أعيان وجودية) ہیں، یا وہ محض نسبتیں ہیں جن کا تقاضا احکام کرتے ہیں؟ پس وہ اپنے احکام کے ذریعے معقول (سمجھی جانے والی) ہیں۔ اور یہ علم باقی رہا کہ وہ محل (جگہ) کیا ہے جس میں یہ احکام ظاہر ہوئے؟ کیا وہ ممکن کا عین ہے؟ اور یہ نسبتیں مرجح (ترجیح دینے والے) کے لیے ہیں، جیسا کہ اس نے فرمایا: \"فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ\" (پھر تم نے انہیں قتل نہیں کیا بلکہ اللہ نے انہیں قتل کیا) اور اس کا قول: \"والله خَلَقَكُمْ وما تَعْمَلُونَ\" (اور اللہ نے تمہیں اور تمہارے اعمال کو پیدا کیا)۔ یا کیا محل (جگہ) الحق (ذات حق) کا الوجود (ہستی) ہے، اور یہ احکام الوجود (ہستی) الحق میں ممکنات کا اثر ہیں، اور وہ وہ صورتیں ہیں جو اس میں ظاہر ہوتی ہیں۔ پس ہر صورت ایک صورت کا مشاہدہ کرتی ہے، اور یہ الوجود (ہستی) الحق میں ممکنات کے آثار ہیں۔ چنانچہ زید الحق (ذات حق) کے الوجود (ہستی) میں خالد کی صورت دیکھتا ہے، اور خالد الحق (ذات حق) کے الوجود (ہستی) میں زید کی صورت دیکھتا ہے۔ اور اسی طرح ہر حالت میں وہ اس صورت کو بالکل اسی صورت کی طرح دیکھتا ہے۔ اور ان دونوں امور کو اہل اللہ کی ایک جماعت نے اختیار کیا ہے۔\n\nاور بہرحال، دونوں اقوال پر، ہر قول کے حامل کے لیے ایک ہی امر پر ثابت قدم رہنا ممکن نہیں ہے۔ بلکہ جس امر کے لیے وہ حکم ثابت کرتا ہے، اسی کے ذریعے وہ اسے دوسرے امر کے لیے ثابت کرتا ہے اور پہلے امر سے اس کی نفی کرتا ہے۔ پس وہ سابق کی نفی کرتا ہے اور لاحق کو ثابت کرتا ہے۔ پس وہ جس امر سے بھی آغاز کرے، دونوں اقوال میں اس کے لیے یہی حکم ہوگا۔ جیسا کہ اس کا قول: \"وما رَمَيْتَ\" (اور جب تم نے پھینکا) تو اس نے نفی کی، \"إِذْ رَمَيْتَ\" (جب تم نے پھینکا) تو اس نے اس کے لیے پھینکنا ثابت کیا جس سے اس کی نفی کی تھی۔ پھر وہ اثبات پر قائم نہیں رہا، بلکہ اس نے اثبات کے بعد نفی لائی، جیسا کہ نفی کے بعد اثبات لایا، پس فرمایا: \"ولكِنَّ الله رَمى\" (لیکن اللہ نے پھینکا)۔ پس کتنی جلدی اس نے نفی کی اور کتنی جلدی ایک ہی عین (ذات) کے لیے اثبات کیا۔ اسی وجہ سے اس مقام (منازلہ) کو المسلك السيال (سیال مسلک) کا نام دیا گیا، پانی کے بہاؤ سے تشبیہ دیتے ہوئے جو اپنے راستے کی کسی بھی چیز پر اس کے گزرنے کے وقت کے علاوہ ثابت نہیں رہتا۔ پس اس کے مردوں کے قدم کسی ایک چیز پر ثابت نہیں رہتے، کیونکہ یہ مقام اسی کا تقاضا کرتا ہے، اور یہ عین اس کے قول کے مطابق ہے: \"كُلَّ يَوْمٍ هُوَ في شَأْنٍ\" (وہ ہر دن ایک نئی شان میں ہے)۔ اور دن کی مقدار ایک فردی زمانہ ہے۔ اور اسی طرح اس کا قول تعالیٰ:\n\n\"ولا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ\" (اور ان لوگوں کی طرح نہ ہو جاؤ جنہوں نے کہا کہ ہم نے سنا، حالانکہ وہ نہیں سنتے)۔ حالانکہ انہوں نے سنا تھا۔ پس دیکھو کہ یہ مذمت کس طرح اس شخص کی انتہا درجے کی تعریف سے مشابہت رکھتی ہے جس کا کان اور آنکھ الحق (ذات حق) ہو۔ پس جس کا کان الحق (ذات حق) ہو، اس نے یقیناً سنا، اور اس نے اپنے رب کے ذریعے ہی سنا۔ پس وہ سننے والا ہے، اپنی ذات سے نہیں۔ اور یہ درست نہیں کہ وہ اپنے رب کی ہویت (ذات) کا محل (جگہ) ہو، پس اس کا عین (ذات) الوجود (ہستی) الحق ہے، اور حکم ممکن کے لیے ہے، کیونکہ وہ اس کا اثر ہے۔ \"ولَوْ عَلِمَ الله فِيهِمْ خَيْراً لَأَسْمَعَهُمْ\" (اور اگر اللہ ان میں کوئی بھلائی جانتا تو انہیں ضرور سناتا)۔ اور الوجود (ہستی) ہی خیر ہے، پس وہ الوجود (ہستی) سے متصف ہوتے ہیں۔ اور اگر وہ انہیں سناتا، جب اس نے انہیں موجود کیا، تو وہ اپنی ذاتوں کی طرف پلٹ جاتے اور جان لیتے کہ انہوں نے نہیں سنا۔ پس اس نے اس سے اعراض (منہ موڑنے) کے ذریعے کنایہ کیا، کیونکہ الحق (ذات حق) ہی سننے والا ہے، اور وہ اس کے لیے کان کی مانند ہیں، جو ہمارے لیے ایک آلہ ہے جس سے ہم آواز دینے والوں کی آوازیں اور کلام کرنے والوں کی باتیں سنتے ہیں۔ پس وہی مخاطب ہے اور وہی کلام کرنے والا سننے والا ہے۔ \"يا أَيُّهَا الَّذِينَ آمَنُوا\" (اے ایمان والو) یعنی جو ہم نے کہا اس کی تصدیق کرو، \"اسْتَجِيبُوا لِلَّهِ ولِلرَّسُولِ إِذا دَعاكُمْ\" (اللہ اور رسول کی پکار پر لبیک کہو جب وہ تمہیں بلائیں)۔ پس دو کا ذکر کرنے کے بعد اس نے پکارنے والے کو واحد قرار دیا، تو ہم نے جان لیا کہ امر ایک ہی ہے۔ اور ہم نے حسی سماعت کے ذریعے متکلم (کلام کرنے والا) صرف رسول کو سنا، اور ہم نے الحق (ذات حق) کا کلام الحق (ذات حق) کی سماعت کے ذریعے، یعنی معنوی سماعت سے سنا۔ پس اللہ اور رسول متکلم کے دو نام ہیں، کیونکہ کلام اللہ کا ہے جیسا کہ اللہ نے فرمایا، اور مشہود متکلم (جس کا مشاہدہ کیا گیا) محمد صلی اللہ علیہ وسلم کی زبان کا عین ہے۔ \"مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله\" (جس نے رسول کی اطاعت کی، اس نے درحقیقت اللہ کی اطاعت کی)۔\n\nپس میرا عین اس کے سوا نہیں ہے\nتو میں اس کے سوا کسی اور میں رات نہیں گزارتا\n\nپس جو الوجود (ہستی) کی آنکھ سے مشاہدہ کرتا ہے\nوہ اسی کا شہود (الشہود) کرتا ہے\n\nپس ہم اس میں برابر ہیں\nجیسا وہ مجھے دیکھتا ہے، میں اسے دیکھتا ہوں۔\n\nاور ہم نے اس باب کا خلاصہ کافی اختصار کے ساتھ بیان کر دیا ہے۔ \"والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و نود و یکم در معرفت مقام (منازلة) مسلک سیال (المسلك السيال) که قدم‌های مردان سؤال بر آن ثابت نمی‌ماند\n\nحق (الحق) را در اعیان (موجودات عینی) به عنوان حق دیدم،\nو در اسماء (الهی) او را جز خود ندیدم.\n\nو من تنها در این باره حکم‌کننده نیستم،\nزیرا این حکم او در هر بیننده‌ای است.\n\nو نزد کسانی که (وجود مستقل را) اثبات می‌کنند، خلاف این است:\nاو بیننده (الرائي) است و ما برای او مرئی (المرائي) هستیم.\n\n### اعیانِ حادث (الأعيان المحدثات)\n\nخداوند عز و جل فرمود: «شما آنان را نکشتید، بلکه خدا آنان را کشت» (فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ). و اوست که می‌فرماید: «و هر جا آنان را یافتید، بکشید» (واقْتُلُوهُمْ حَيْثُ وَجَدْتُمُوهُمْ). پس در این خطاب تکلیفی، امرکننده، امر و مأمور را آشکار ساخت. پس هنگامی که امتثال واقع شد و قتل عملاً از اعیانِ حادث (الأعيان المحدثات) ظاهر گشت، فرمود: شما نبودید که آنان را کشتید، بلکه من آنان را کشتم. پس شما برای ما به منزله شمشیری هستید که برای شماست، یا هر ابزار دیگری که برای کشتن باشد. قتل در مقتول به وسیله ابزار واقع شد، اما درباره ابزار گفته نشد که قاتل است، بلکه درباره ضارب گفته شد که قاتل است. همچنین، ضارب با آن (ابزار) نسبت به ما، مانند شمشیر نزد اوست. پس درباره مکلف گفته نمی‌شود که او قاتل است، بلکه خداوند است که به وسیله مکلف و به وسیله شمشیر، قاتل است. پس مکلف برای او در جایگاه دست ضربه‌زننده با شمشیر قرار گرفت، همانند حجرالأسود که دست راست خداوند در بیعت است، از طریق بوسیدن و لمس کردن، مانند مصافحه دو شخص.\n\nو تبیین این مقام (منازلة) شناخت اموری است که احکام را ایجاب می‌کنند؛ آیا این امور دارای اعیان وجودی هستند یا نسبت‌هایی هستند که احکام آن‌ها را می‌طلبند و لذا به واسطه احکامشان معقول می‌شوند؟ و علم باقی می‌ماند در مورد محلی که این احکام در آن ظاهر شده‌اند که آن محل چیست؟ آیا آن محل، عین ممکن است و این نسبت‌ها برای ترجیح‌دهنده (مرجح) هستند، مانند آنچه فرمود: «شما آنان را نکشتید، بلکه خدا آنان را کشت» (فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ) و سخن او: «و خدا شما و آنچه را عمل می‌کنید، آفریده است» (والله خَلَقَكُمْ وما تَعْمَلُونَ)؟ یا آیا محل، وجود حق (وجود الحق) است و این احکام، اثر ممکنات در وجود حق هستند، و آن همان چیزی است که از صور در آن ظاهر می‌شود؟ پس هر صورتی، صورت دیگری را مشاهده می‌کند، و این‌ها آثار ممکنات در وجود حق (وجود الحق) هستند. پس زید، صورت خالد را در وجود حق می‌بیند و خالد، صورت زید را در وجود حق می‌بیند. و همچنین هر حالتی که آن صورت را بر آن می‌بیند، دقیقاً مانند آن صورت است.\n\nو هر دو امر را گروهی از اهل الله (اهل معرفت) پذیرفته‌اند. و به هر حال، بر اساس هر دو قول، برای هیچ صاحب قولی امکان ثبات بر یک امر واحد وجود ندارد، بلکه به محض اینکه حکمی را برای امری اثبات می‌کند، آن را برای امر دیگری اثبات کرده و از آن امر اول نفی می‌کند. پس او سابق را نفی می‌کند و لاحق را اثبات می‌نماید. پس با هر امری که آغاز کند، این حکم در هر دو قول برای او جاری است، مانند سخن او: «و تو پرتاب نکردی» (وما رَمَيْتَ). پس نفی کرد، در حالی که «پرتاب کردی» (إِذْ رَمَيْتَ)؛ پس پرتاب را برای کسی که از او نفی کرده بود، اثبات نمود. سپس بر اثبات ثابت نماند، بلکه اثبات را با نفی دنبال کرد، همان‌طور که نفی را با اثبات دنبال کرده بود، و فرمود: «بلکه خدا پرتاب کرد» (ولكِنَّ الله رَمى‏). پس چه سریع نفی کرد و چه سریع برای یک عین واحد اثبات نمود! به همین دلیل، این مقام (منازلة) «مسلک سیال» (المسلك السيال) نامیده شد، به تشبیه سیلان آبی که بر هیچ چیز از مسیر خود ثابت نمی‌ماند، مگر به اندازه عبور از آن. پس قدم‌های سالکانش بر هیچ چیز معینی ثابت نیست، زیرا این مقام (مقام) چنین اقتضا می‌کند، و این عین سخن اوست: «هر روز او در کاری است» (كُلَّ يَوْمٍ هُوَ في شَأْنٍ). و مقدار روز، همان زمان فرد (لحظه واحد) است. و همچنین سخن خداوند متعال:\n\n«و مانند کسانی نباشید که گفتند شنیدیم، در حالی که نمی‌شنوند» (ولا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ)، با وجود اینکه شنیدند. پس بنگر که این مذمت چگونه شبیه نهایت ستایش است در مورد کسی که حق (الحق) سمع و بصر او باشد. پس کسی که حق (الحق) سمع او باشد، ضرورتاً شنیده است و جز به واسطه پروردگارش نشنیده است. پس او شنونده است نه به واسطه خودش، و صحیح نیست که محل هویت پروردگارش باشد. پس عین او، وجود حق (وجود الحق) است و حکم برای ممکن است، زیرا آن (شنیدن) اثر اوست. «و اگر خداوند خیری در آنان می‌دانست، قطعاً آنان را شنوا می‌ساخت» (لَوْ عَلِمَ الله فِيهِمْ خَيْراً لَأَسْمَعَهُمْ). و وجود، همان خیر است، پس آنان به وجود متصف می‌شوند. و اگر آنان را شنوا می‌ساخت، هنگامی که آنان را ایجاد کرد، قطعاً به سوی ذات‌های خود روی می‌گرداندند و می‌دانستند که نشنیده‌اند. پس با اعراض (روی گرداندن) از آن کنایه آورده است. زیرا حق (الحق) همان شنونده است و آنان برای او مانند گوش برای ما هستند؛ ابزاری که با آن صدای فریادکنندگان و کلام سخن‌گویان را می‌شنویم. پس او مخاطب است و او متکلمِ شنونده است: «ای کسانی که ایمان آورده‌اید» (يا أَيُّهَا الَّذِينَ آمَنُوا) یعنی کسانی که آنچه گفتیم را تصدیق کردید، «خدا و رسول را اجابت کنید هنگامی که شما را فرا می‌خوانند» (اسْتَجِيبُوا لِلَّهِ ولِلرَّسُولِ إِذا دَعاكُمْ). پس پس از ذکر دو نفر (خدا و رسول)، داعی (فراخواننده) را واحد شمرد. پس دانستیم که امر یکی است. و ما متکلمی را جز رسول (صَلَّى اللهُ عَليهِ وسَلَّم) با شنیدن حسی نشنیدیم، و کلام حق (الحق) را با سمع حق (سمع الحق) به واسطه شنیدن معنوی شنیدیم. پس الله و رسول، دو اسم برای متکلم هستند، زیرا کلام از آنِ خداست، چنانکه خداوند فرمود، و متکلمِ مشهود، عین زبان محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است. «هر کس از رسول اطاعت کند، قطعاً از خدا اطاعت کرده است» (مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله‏).\n\nپس عین من جز او نیست،\nو من جز او نیستم.\n\nپس هر کس با چشم وجود (عین الوجود) مشاهده کند،\nاو را شهود می‌کند.\n\nپس ما در او یکسانیم،\nهمان‌گونه که مرا می‌بیند، او را می‌بینم.\n\nو ما چکیده این باب را به اختصار و کفایت ذکر کردیم. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}