{
  "id": 379,
  "title": {
    "ar": "الباب التاسع والسبعون وثلاثمائة في معرفة منزل الحل والعقد والإكرام والإهانة ونشأة الدعاء في صورة الإخبار وهو منزل محمدي‏",
    "en": "Chapter Three Hundred and Seventy-Nine: Concerning the Knowledge of the Station (منزل) of Loosing and Binding (الحل والعقد), and of Honor (الإكرام) and Humiliation (الإهانة), and the Emergence of Supplication (الدعاء) in the Form of Informing (الإخبار); and it is a Muhammadan Station (منزل محمدي).",
    "ur": "باب تین سو اناسی: حل و عقد (الحل والعقد)، اکرام اور اہانت کی منزل کی معرفت میں، اور دعا (الدعاء) کا اخبار (الإخبار) کی صورت میں نشأت پانا، اور یہ ایک محمدی منزل ہے۔",
    "fa": "باب سیصد و هفتاد و نهم در معرفت منزل گشودن و بستن (الحل والعقد)، و اکرام و اهانت، و پیدایش دعا در صورت خبر دادن، و آن منزل محمدی است."
  },
  "content": {
    "ar": "## «الباب التاسع والسبعون وثلاثمائة» في معرفة منزل الحل والعقد والإكرام والإهانة ونشأة الدعاء في صورة الإخبار وهو منزل محمدي‏\n\n\n> صحاف من اللجين *** ومن جوهر وعين‏\n\n\n> أتتنا بها كرام *** عليها ستور صون‏\n\n\n> فلما بدت إلينا *** أكلنا من كل لون‏\n\n\n> فمنها علوم ونعت *** ومنها علوم كون‏\n\n\n> ومنها علوم حال *** ومنها علوم عين‏\n\n\n> فمن قائل بوصل *** ومن قائل ببين‏\n\n\n> فسبحان من تعالى *** بتشبيه كل عين‏\n\n\n> فما كونه سواه *** وما كونه بكوني‏\n\n\n### [الاثني عشر منتهى البسائط من الأعداد]\n\n\nاعلم أن الاثني عشر منتهى البسائط من الأعداد أصابع وعقد فالأصابع منها تسعة والعقد ثلاثة فالمجموع اثنا عشر ولكل واحد من هؤلاء الاثني عشر حكم ليس للآخر ومشهد إلهي لا يكون لسواه ولكل واحد من هذا العدد رجل من عباد الله له حكم ذلك العدد فالواحد منهم ليس من العدد ولهذا كان وتر رسول الله ص‏\nإحدى عشرة ركعة لأن الواحد ليس من العدد ولو كان الواحد من العدد ما صحت الوترية جملة واحدة لا في العدد ولا في المعدود فكان وتر رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إحدى عشرة ركعة كل ركعة منها نشأة رجل من أمته يكون قلب ذلك الرجل على صورة قلب النبي صَلَّى اللهُ عَليهِ وسَلَّم في تلك الركعة وأما الثاني عشر فهو الجامع للأحد عشر والرجل الذي له مقام الاثني عشر حق كله في الظاهر والباطن يعلم ولا يعلم وهو الواحد الأول فإن أول العدد من الاثنين فإذا انتهيت إلى الاثني عشر فإنما هي نهايتك إلى أحد عشر من العدد فإن الواحد الأول ليس منه ولا يصح وجود الاثني عشر إلا بالواحد الأول مع كونه ليس من العدد وله هذا الحكم فهو في الاثني عشر لا هو كما يقول أنت لا أنت وهؤلاء الاثني عشر هم الذين يستخرجون كنوز المعارف التي اكتنزت في صور العالم فللعالم علم الصور من العالم ولهؤلاء علم ما تحوي عليه هذه الصور وهو الكنز الذي فيها فيستخرجونه بالواحد الأول فهم أعلم الناس بالتوحيد والعبادة ولهم المناجاة الدائمة مع الله الذاتية لمستصحبة استصحاب الواحد للأعداد مثل قوله وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ أي ليس لكم وجود معين دون الواحد فبالواحد تظهر أعيان الأعداد فهو مظهرها ومغنيها فالألف نعته إذا بالألف وقعت ألفة الواحد بمراتب العدد لظهوره ف هُوَ الْأَوَّلُ والْآخِرُ وإذا ضربت الواحد في نفسه لم يظهر في الخارج بعد الضرب سوى نفسه وفي أي شي‏ء ضربت الواحد لم يتضاعف ذلك الشي‏ء ولا زاد فإن الواحد الذي ضربته في تلك الكثرة إنما ضربته في أحديتها فلهذا لم يظهر فيها زيادة فإن الواحد لا يقبل الزائد في نفسه ولا فيما يضرب فيه فلا يتضاعف فهو واحد حيث كان فتقول واحد في مائة ألف بمائة ألف وواحد في اثنين باثنين وواحد في عشرة بعشرة لا يزيد منه في العدد المضروب شي‏ء أصلا لأن مقام الواحد يتعالى أن يحل في شي‏ء أو يحل فيه شي‏ء وسواء كان من العدد الصحيح أو المكسور لا فرق فهو أعني الواحد يترك الحقائق على ما هي عليه لا تتغير عن ذاتها إذ لو تغيرت لتغير الواحد في نفسه وتغير الحق في نفسه وتغير الحقائق محال ولم يكن يثبت علم أصلا لا حقا ولا خلقا فثبت إن الحقائق لا تنقلب أصلا ولهذا يعتمد على ما يعتمد عليه وهو المسمى علما فلنذكر كل رجل من هؤلاء الأحد عشر الذين انتشوا من وتر رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بل هذه الصور ربما جعلت رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بوتر بإحدى عشرة ركعة في الصورة الظاهرة وهذه الصور منه صَلَّى اللهُ عَليهِ وسَلَّم في الباطن فإنه كان نبيا وآدم بين الماء والطين فأنشأها لما كانت هذه صفته فلما ظهر صَلَّى اللهُ عَليهِ وسَلَّم بجسده استصحبه تلك الصور المعنوية فأقامت جسده ليلا لمناسبة الغيب فحكمت على ظاهره بإحدى عشرة ركعة كان يوتر بها فكانت تره فهي الحاكمة المحكومة له فمنه صَلَّى اللهُ عَليهِ وسَلَّم انتشئوا وفيه صَلَّى اللهُ عَليهِ وسَلَّم ظهروا وعليه حكموا بوجهين مختلفين فمن ذلك صورة الركعة الأولى انتشا منها رجل من رجال الله يدعى بعبد الكبير من حيث الصفة إلا أنه اسم له وهو نشأة روحانية معقولة إذا تجسدت كانت في صورة إنسان صفته ما يدعى به وهكذا هي كل صورة من صور هؤلاء الاثني عشر\n\n\n### [المفاضلة في الأسماء الإلهية]\n\n\nواعلم أن المفاضلة في الأسماء الإلهية مثل أعلى وأجل في‏\n\n\nقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حين قال المشركون في رجزهم أعل هبل أعل هبل فقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قولوا فقالوا يا رسول الله وما نقول قال قولوا الله أعلى وأجل‏\n\n\nوهم يسلمون هذا القدر فإنهم القائلون ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏ فهو عندهم أعلى وأجل فلو صدقوا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في أنه رسول من عند الله الذي يطلبون التقرب إليه بعبادة هؤلاء الآلهة فما سموهم آلهة إلا لكونهم جعلوهم معبودين لهم لأن الإله هو المعبود والآلهة العبادة وقد قرئ ويَذَرَكَ وآلِهَتَكَ أي وعبادتك وإذا قال وآلِهَتَكَ يقول والمعبودين الذين نعبدهم فلما نسبوا الألوهية لهؤلاء الذين عبدوهم ونسبتها لي الله أتم وأعظم عندهم باعترافهم لذلك قال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ببنية المفاضلة في ذلك يقول لهم أي هذا قولكم واعتقادكم ولهذا جاء في التكبير في الصلاة لفظة الله أكبر ببنية المفاضلة لا إن الحجارة أفضل ولا ما نحتوه ولا ما نسبوا إليه الألوهية من كوكب وغيره وإنما وقعت المفاضلة في المناسبة لا في الأعيان لأنه لا مفاضلة في الأعيان لأنه ليس بين العبد والسيد ولا الرب والمربوب ولا لخالق والمخلوق مفاضلة فإن تحققت ما أومأنا إليه في نش‏ء هذه الصورة علمت ما آل المشرك بعد المؤاخذة نش‏ء صورة الركعة الثانية من الوتر انتشأ منها رجل من رجال الله تعالى يقال له عبد المجيب‏\n### [الإجابة فرع عن السؤال‏]\n\n\nواعلم أن الإجابة فرع عن السؤال فهذا عبد مؤثر بسؤاله ودعائه في سيده مؤثر فيه الإجابة لعبده‏\n\n\nفإن الله قد أثبت لنفسه عز وجل على لسان رسوله صَلَّى اللهُ عَليهِ وسَلَّم أن العبد يرضى الله فيرضى ويغضب الله فيغضب ويسخط الله فيسخط ويضحك الله فيضحك‏\n\n\nوما أشبه ذلك مما ورد في الكتاب والسنة والحق تعالى يؤثر في العبد السؤال ليجيب والفعل المسخط للحق ليسخط وذلك لتعلم إن الأمر دوري كروي وأن منتهى الدائرة ترجع لنقطة ابتدائها فينعطف الآخر على الأول ليكون هو الأول والآخر فما أرضاه إلا هو ولا أسخطه إلا هو لأنه يتعالى أن يكون مؤثرا لغيره فافهم وليس لله حكم في العالم إلا ما ذكرناه أ لا تراه يقول سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ ولا شغل له إلا بنا فمنا يفرغ لنا فلو زلنا لكان ولم يكن وجودا وتقديرا ولا يعقل الأمر إلا هكذا ولبطلت الإضافات ولا تبطل لأنها لنفسها هي إضافات فلا يعقل الرب لا مضافا ولذلك ما جاء في القرآن قط مطلقا من غير إضافة وإن اختلفت إضافاته فتارة يضاف إلى أسماء الضمائر وتارة يضاف إلى الأعيان وتارة يضاف إلى الأحوال وإن لم تعقل معرفتك بربك هكذا وإلا فما عرفت ربك أصلا وإنما عرفت بالتقسيم العقلي أن حكم الواجب الوجود لذاته أن يكون كذا وهل ثم واجب وجود لذاته أم لا فلا تعرفه إلا بك وما لم نعرفه إلا بك فلا بد أن يكون العلم به موقوفا على علمك بك فوجودك موقوف على وجوده والعلم بربوبيته عليك موقوف على العلم بك فله الأصل في الوجود ولك حكم لفرع في الوجود وأنت الأصل في العلم به وله حكم الفرع في العلم نش‏ء صورة الركعة الثالثة من الوتر انتشا منها رجل من رجال الله يدعى عبد الحميد\n\n\n### [الثناء على الله على نوعين مطلق ومقيد]\n\n\nاعلم أن الثناء على الله على نوعين مطلق ومقيد فالمطلق لا يكون إلا مع العجز مثل‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم لا أحصي ثناء عليك أنت كما أثنيت على نفسك‏\n\n\n> قال قائلهم إذا نحن أثنينا عليك بصالح *** فأنت الذي نثني وفوق الذي نثني‏\n\n\nولا يمكن أن يحيط مخلوق بما يجب لله تعالى من الثناء عليه لأنه لا يمكن أن يدخل في الوجود جميع الممكنات ولكل ممكن وجه خاص إلى الله منه يوجده الله ومنه يعرفه ذلك الممكن ومنه يثنى عليه الثناء الذي لا يعرفه إلا صاحب ذلك الوجه لا يمكن أن يعلمه غيره ولا يدل عليه بلفظ ولا إشارة فهذا مطلق الثناء على الله بكل لسان مما كان ويكون ولهذا ثواب قول القائل سبحان الله عدد خلقه لا يتصور وقوعه في الوجود لكن لا يزال يوجد ثوابه حالا بعد حال على الدوام إلى ما لا يتناهى ولهذا أيضا جاء به الشرع مثلثا أن يقول العبد ذلك ثلاث مراتب ليحصل بذلك الثواب المحسوس والثواب المتخيل والثواب المعنوي فينعم حسا وخيالا وعقلا كما يذكر حسا وخيالا وعقلا كما يعبد حسا وخيالا وعقلا وكذلك ذكر العبد مداد الكلمات الإلهية وكذلك زنة عرشه إذا كان العرش العالم كله بمحدده وكذلك رضا نفسه فيما يفعله أهل الجنة وأهل النار فإنهم ما يفعلون ولا يتصرفون إلا في المراضي الإلهية لأن الموطن يعطيهم ذلك بخلاف موطن الدنيا والتكليف فإنهم يتصرفون في موطن الدنيا بما يرضي الله وبما يسخطه وإنما كان ذلك لكون النار جعلها الله دار من سخط عليه فلا بد أن يتحرك أهلها فيما يسخط الله في دار الدنيا فإذا سكنوا دار النار وعمروها لا يمكن أن يتحركوا إلا في مرضاة الله ولهذا يكون المال لأهلها إلى حكم الرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ وإن كانت دار شقاء كما يقول في الرسول الذي انتهت رسالته وفرغ منها وانقلب إلى الله أنه رسول الله وإن كان في ذلك الحال ليس برسول كذلك نقول في دار الشقاء إنها دار شقاء وإن كان أهلها فيها قد زل عنهم الشقاء وأما الثناء المقيد فالحكماء يقيدونه بصفة التنزيه لا غير وإن أثنوا عليه بصفة الفعل فبحكم الكل أو الأصالة لا يحكم لشخص وما عدا الحكماء فيقيدون الثناء على الله بصفة الفعل وصفة التنزيه معا وهؤلاء هم الكمل لأنهم شاركوا الحكماء فيما علموا وزادوا عليهم بما جهله الحكماء ولم يعلموه لقصور همهم للشبهة التي قامت لهم وحكمت عليهم بأنه تعالى ما صدر عنه إلا الواحد المشار إليه فقط وبأنه تعالى لا يجوز عليه ما نعت به نفسه في كتابه إذ لم يثبت عندهم في نظرهم كتاب منزل ولا شخص مرسل على الوجه الذي هو الأمر في نفسه وعند أهل الكشف والايمان انصرف وبعض عقول النظار مثل المتكلمين وغيرهم ممن يقول بذلك من جهة النظر العقلي وقد سر في العالم كله حكم صور هذه الركعات الوترية النبوية من وقت كونه نبيا صَلَّى اللهُ عَليهِ وسَلَّم وآدم بين الماء والطين إلى يوم القيامة نش‏ء صورة الركعة الرابعة من الوتر انتشا منها\nرجل من رجال الله يدعى عبد الرحمن‏\n\n\n### [الرحمة الإلهية التي أوجد الله في عباده مخلوقة من الرحمة الذاتية]\n\n\nاعلم أن الرحمة الإلهية التي أوجد الله في عباده ليتراحموا بها مخلوقة من الرحمة الذاتية التي أوجد الله بها العالم حين أحب أن يعرف وبها كَتَبَ عَلى‏ نَفْسِهِ الرَّحْمَةَ وهذه الرحمة المكتوبة منفعلة عن الرحمة الذاتية والرحمة الامتنانية هي التي وَسِعَتْ كُلَّ شَيْ‏ءٍ فرحمة الشي‏ء لنفسه تمدها الرحمة الذاتية وتنظر إليها وفيها يقع الشهود من كل رحيم بنفسه فإن الله قد وصف نفسه بالحب وشدة الشوق إلى لقاء أحبابه فما لقيهم إلا بحكم هذه الرحمة التي يشهدها صاحب هذه الرحمة هي الرحمة التي كتبها على نفسه لا مشهد لها في الرحمة الذاتية ولا الامتنانية وأما رحمة الراحم بمن أساء إليه وما يقتضيه شمول الإنعام الإلهي والاتساع الجودي فلا مشهد لها إلا رحمة الامتنان وهي الرحمة التي يترجاها إبليس فمن دونه لا مشهد لهؤلاء في الرحمة المكتوبة ولا في الرحمة الذاتية وبهذا كان الله والرحمن دون غير الرحمن من الأسماء لِلَّهِ الْأَسْماءُ الْحُسْنى‏ فجميع الأسماء دلائل على الاسم الرحمن وعلى الاسم الله ولكن أكثر الناس لا يشعرون وما رأيت أحدا من أهل الله نبه على تثليث الرحمة بهذا التقسيم فإنه تقسيم غريب كما هو في نفس الأمر فما علمناه إلا من الكشف وما أدري لما ذا ترك التعبير عنه أصحابنا مع ظني بأن الله قد كشف لهم عن هذا وأما النبوات فقد علمت أنهم وقفوا على ذلك وقوف عين ومن نور مشكاتهم عرفناه لأن الله رزقنا الاتباع الإلهي والاتباع النبوي فأما الاتباع الإلهي فهو قوله تعالى وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ فالله في هذه المعية يتبع العبد حيث كان فنحن أيضا تتبعه تعالى حيث ظهر بالحكم فنحن وقوف حتى يظهر بأمر يعطي ذلك الأمر حكما خاصا في الوجود فنتبعه فيه ولا نظهر في العامة بخلافه كسكوتنا عن التعريف به أنه هو إذا تجلى في صورة ينكر فيها مع معرفتنا به فهو المقدم بالتجلي وحكم الإنكار فنحن نتبعه بالسكوت وإن لم ننكر ولا نقر فهذا هو الاتباع الإلهي وأما الاتباع النبوي الذي رزقنا الله فهو قوله لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ ثم إنه أتبعنا وتأسى بنا في صلاته إذا صلى بالجماعة فيكون فيها الضعيف والمريض وذو الحاجة فيصلي بصلاتهم فهو صَلَّى اللهُ عَليهِ وسَلَّم المتبع والمتبع اسم مفعول واسم فاعل ثم أمرنا أن نصلي إذا كنا أئمة بصلاة إلا ضعف فاتبعنا الرحمن بما ذكرناه فنحن التابعون واتبعنا الرحمن بما تعطيه حقائقنا من الاحتياج والفاقة فيمشي بما نحن عليه فنحن المتبوعون فانظر ما ذا تعطي حقائق السيادة في العبيد وحقائق العبادة والعبودية في السيادة فهذا الرجل هذه صفته في العالم وبهذه الركعة الرابعة ظهرت أحكام الأسماء الأربعة الإلهية وأحكام الطبيعة في النشأة الطبيعية وأحكام العناصر في المولدات الثلاثة التي لها هذه الرحمات الثلاثة وأحكام الأخلاط في النشأة الحيوانية فلهذا الرجل المهيمنية على هذه كلها نش‏ء صورة الركعة الخامسة من الوتر انتشا رجل منها رجل من رجال الله يقال له عبد المعطي فتارة يكون عطاؤه وهبا فيكون المعطي عبد الوهاب وتارة يكون عطاؤه إنعاما فيكون عبد المنعم وتارة يكون عطاؤه كرما فيكون المعطي عبد الكريم وتارة يكون عطاؤه جودا فيكون المعطي عبد الجواد وتارة يكون عطاؤه سخاء فيكون المعطي عبد المقيت وعبد السخي وتارة يكون عطاؤه إيثارا فيكون المعطي عبد الغني وهذا العطاء أغمض الإعطاءات وأصبعها تصورا بل يمنعها الجميع إلا نحن وما رأينا أحدا أثبت هذا العطاء في الإلهيات وما يثبته إلا من علم معنى اسمه الغني تعالى وذلك أنه قد ثبت في الصحيح أن العبد يصل إلى مقام يكون الحق من حيث هويته جميع قواه في‏\n\n\nقوله كنت سمعه وبصره ويده‏\n\n\nوغير ذلك من أعضائه وقواه الحديث وهو سبحانه الغني لذاته الغناء الذي لا يمكن إزالته عنه فإذا قام العبد في هذا المقام فقد أعطاه صفة الغناء عنه وعن كل شي‏ء لأن هويته هي أعيان قوى هذا العبد وليس ذلك في تقاسيم العطاء إلا للإيثار فقد آثر عبده بما هو لهويته قال تعالى ويُؤْثِرُونَ عَلى‏ أَنْفُسِهِمْ ولَوْ كانَ بِهِمْ خَصاصَةٌ بل بهم خصاصة ولما كان عطاء الإيثار فضلا يرجع على المعطي كان الحق أولى بصفة الفضل فعطاء الإيثار أحق في حق الحق وأتم في حق العبد وهذا من علوم الأسرار التي لا يمكن بسط التعريف فيها إلا بالإيماء لأهلها أشجعهم للعمل عليها فإنهم في غاية من الخوف لقبولها فكيف للاتصاف بها وباقي الأسماء هينه الخطب نش‏ء صورة الركعة السادسة من الوتر انتشا منها رجل من رجال الله يقال له عبد المؤمن‏\n\n\n### [أن الايمان نعت إلهى‏]\n\n\nاعلم أن الايمان إذا كان نعتا إلهيا فهو ما يظهر من الدلالات كلها على وجه صحة ما يدعيه المدعي أي مدع‏\nكان على ما كان من غير تعيين بشرط أن يكون دليلا في نفس الأمر كما يشهد له الحس إن كان الدليل محسوسا حتى لو أعطى العلم الضروري بصدق هذه الدعوى في نفس الحاكم لكان ذلك العلم الضروري عين الدليل على صدق دعوى هذا المدعي فناصب هذه الدلالات هو المصدق لصاحب هذه الدعوى فإذا صدقه من صدقه وحصل العلم بذلك في نفس من حصل عنده كان ذلك لشخص الحاصل عنده هذا الدليل مصدقا صاحب هذه الدعوى وعاد التصديق كونيا أي في الخلق كما هو في الحق فكان صاحب الدعوى بين مصدقين محصورا من أي جهة التفت لم يجد إلا مصدقا بما جاء به في دعواه فأعطاه هذا الحال الأمان في نفسه من تكذيبه من هذين الطرفين ولو جحد الكون فإنه متيقن في نفسه صدق هذا المدعي وليس المراد إلا ذلك أعني حصول العلم بصدقه فبصورة هذه الركعة سرى التصديق في عالم الإنس والجان في بواطنهم وذلك حين وقعت منه هذه الركعة في باطن الأمر إذ كان نبيا وآدم بين الماء والطين فلم يزل تسري روحا مجردا في كل مصدق حتى ركعها صَلَّى اللهُ عَليهِ وسَلَّم بصورة جسمه فتجسدت وليس ذلك الروح من فعله صورة جسدية لأنها من حركات محسوسة فكان فعلها أقوى عندنا للجمع بين الصورتين كما كان تأثيره صَلَّى اللهُ عَليهِ وسَلَّم بظهور جسمه أقوى في بعثه منه إذ كان نبيا وآدم بين الماء والطين فإنه نسخ بصورة بعثته جميع الشرائع كلها ولم يبق لشريعة حكم سوى ما أبقى هو منها من حيث هي شرع له لا من حيث ما هي شرع فقط نش‏ء صورة الركعة السابعة من الوتر انتشا منها رجل من رجال الله يقال له عبد الرحيم اعلم أن الرحمة في عين القادر على إظهار حكمها تعود عذابا أليما على من قامت به لأنها من ذاتها تطلب التعدي إلى المرحوم وإظهار أثرها بالفعل فيه فإذا قامت بالقادر على تنفيذها في المرحوم كان لها أثر إن أثر في الراحم وهو ما زال عنه من الألم بحصول أثرها في المرحوم فالراحم مرحوم بها من حيث قدرته على تنفيذها والذي نفذت فيه مرحوم أيضا بها وبقدرة الراحم على تنفيذها فأثرها فيه من وجهين والأثر إزالة ما أدى الراحم لتعلق الرحمة بذلك المرحوم فما كل رحمة تكون نعيما إلا إذا كان الراحم قادرا على تنفيذها فللرحمة تجل في صورة العذاب في حق الراحم الذي نفيت عنه الاقتدار ولها تجل في صورة النعيم في حق الراحم والمرحوم إذا كانت في قادر على تنفيذها فقد قلبت الصورتين المتقابلتين وهذا من أعجب الأمور إن الرحمة تنتج ألما وعذابا فلو لم تقم الرحمة به لم يتصف بالألم هذا الذي لا اقتدار له ثم الذي في المسألة من العجب العجاب أن الرحمة القائمة بالموصوف\n\n\nبنفوذ الاقتدار قد يكون له مانع من تنفيذها من ذاته فيقوم به ألم الكراهة وذلك حكم ذلك المانع من كونه متصفا بالاقتدار على تنفيذها وهذه المسألة من أصعب المسائل في العلم الإلهي وظهر حكم ذلك في الصحيح من الأخبار الإلهية عن نفسه تعالى عز وجل‏\n\n\nحيث قال ما ترددت في شي‏ء أنا فاعله ترددي في قبض نسمة المؤمن يكره الموت وأنا أكره مساءته ولا بد له من لقائي‏\n\n\nوهو الذي جعله يكره الموت ودل على أن لقاءه تعالى لا يكون إلا بالموت وهو الخروج عن الحس المطلق إلى الحس المشترك كما تراه في النوم لكون النوم ضربا من ضروب الموت فإنه وفاة وانتقال من عالم الحس إلى عالم الخيال والحس المشترك فيرى النائم ربه في نومه كما يراه الميت بعد موته غير أن رؤية الميت ولقاءه ربه لا رجعة بعد رؤيته عنه والنائم يستيقظ مرسلا إلى الأجل المسمى فإن كان اللقاء عن فناء لا عن نوم ثم رد إلى حال البقاء فحكمه حكم الميت إذا بعث يوم القيامة لا يقع له حجاب عنه فهذا الفارق بين النائم والفاني ولذلك قال عمرو بن عثمان المكي في صفة العارفين إنهم كما هم اليوم كذلك يكونون غدا إن شاء الله تعالى فلم ير أعجب من حكم الرحمة أ لا ترى الطبيب تقوم به الرحمة بصاحب الآكلة ولا يقدر على تنفيذها فيه إلا بإيلامه فعلى قدر رحمة ذلك الطبيب بصاحب هذه العلة يكون ألمه في نفسه لعدم إنفاذها فيه من غير إيلامه فلو لا رحمته به ما تألم أ لا ترى المستشفي كيف لا يجد ألما بل يجد لذة فتدبر ما ذكرته لك في العلم الإلهي ولقد رأيته في الكشف الصحيح والمشهد الصريح ورسول الله صَلَّى اللهُ عَليهِ وسَلَّم معي وقد أمر تعالى بقتل الدجال لدعواه الألوهية وهو يبكي ويعتذر عنه فيما يعاقب به من أجله وأنه ما بيده في ذلك من شي‏ء فبكاؤه مثل الألم في نفس الراحم الذي ما له اقتدار على تنفيذ رحمته للمانع فما في العلم الإلهي حيرة أعظم من هذه الحيرة ولو لا عظمها ما وصف الحق نفسه بالتردد والتردد حيرة فافهم نش‏ء صورة الركعة الثامنة من الوتر انتشا منها رجل من رجال الله تعالى يقال له‏\nعبد الملك‏\n\n\n### [المخلوق ملك على الإطلاق والحق ملك الملك‏]\n\n\nاعلم أن الملك الذي أحدث هذه الحقيقة التي تسمى ملكا فإذا تسمى بها العبد واتصف الحق بالملك لم يتصف به اتصاف المخلوق فإن المخلوق ملك على الإطلاق والحق ملك الملك لا ملك على الإطلاق فإنه لا يكون ملكا للعبد حتى تظهر عند العبد عبوديته له تعالى ويظهر عنده كونه ملكا لمليكه وهو الله تعالى وإنما قلنا هذا الأجل طائفة أعطاها نظرها إلى الله إن الله لا يعلم الجزء على التعيين وإنما يعلم الكل الذي يتضمن الجزء بخلاف أهل الحق أهل الكشف والوجود ولهذا كان له اسم الملك والملك أي هذا الوصف ظهر عن شدة لكون أصحاب هذا النظر العقلي لا يثبتونه فلما لم تجتمع عليه العقول وقعت فيه المنازعة فاستخلصه الحق ملكا أي عن شدة واستخلص العبد العارف الحق ملكا له أي عن شدة لأجل المنازع فسماه ملك الملك ليفرق بينه وبين كون المخلوق ملكا لله فيتصف المخلوق بالعبودية لله في كونه ملكا له ويتصف الحق بملك الملك ولا يتصف بالعبودية له وإن كان في الحق تأثير من الخلق كما تقدم ومع هذا فلا يتصف بالعبودية لأن ذلك ليس عن ذلة لأنه تعالى الأصل في ذلك التأثير فما عاد عليه إلا ما كان منه بخلاف الخلق فإن المخلوق يعود عليه ما كان منه ويقوم به ما لم يكن منه بابتداء من الحق فاعلم ذلك نش‏ء صورة الركعة التاسعة من الوتر انتشا منها صورة رجل من رجال الله يقال له عبد الهادي اعلم أن الهداية أثر إلهي في قوله من يُضْلِلِ الله فَلا هادِيَ لَهُ وأثر كوني في قوله ولِكُلِّ قَوْمٍ هادٍ ويعود معناه إلى الأول فإن الهادي الكوني لا يكون إلا رسولا من عند الله فهو مبلغ لا هاد معناه لا موفق لكنه هاد بمعنى مبين قال تعالى في البيان الذي لهم والتبيان الذي أوجبه عليهم الله تعالى لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ وقال في الهداية التي هي التوفيق لَيْسَ عَلَيْكَ هُداهُمْ أي ليس عليك إن توفقهم لقبول ما أرسلتك به وأمرتك بتبيانه ولكِنَّ الله يَهْدِي أي يوفق من يَشاءُ وهُوَ أَعْلَمُ بِالْمُهْتَدِينَ أي بالقابلين التوفيق فإنه على مزاج خاص أوجدهم عليه فهؤلاء الهداة هم هداة البيان لا هداة التوفيق وللهادي الذي هو الله الإبانة والتوفيق وليس للهادي الذي هو المخلوق إلا الإبانة خاصة وإنما قلنا ذلك واستشهدنا بما استشهدنا به لما تقرر عند ما لا علم له بالحقائق إن العبد إذا صدق فيما يبلغه عن الله في بيانه أثر ذلك في نفوس السامعين وليس كما زعموا فإنه لا أقرب إلى الله ومن الله ولا أصدق في التبليغ عن الله ولا أحب في القبول فيما جاء به من عند الله من الرسل صلوات الله عليهم وسلامه ومع هذا فما عم القبول من السامعين بل قال الرسول الصادق في التبليغ وما يزيدهم دُعائِي إِلَّا فِراراً فلما لم يعم مع تحققنا هذه الهمة علمنا إن الهمة ما لها أثر جملة واحدة في المدعو والذي قبل من السامعين ما قبل من أثر همة الداعي الذي هو المبلغ وإنما قبل من حيث ما وهبه الله في خلقه من مزاج يقتضي له قبول هذا وأمثاله وهذا المزاج الخاص لا يعلمه إلا الله الذي خلقهم عليه وهو قوله تعالى وهُوَ أَعْلَمُ بِالْمُهْتَدِينَ فلا نقل بعد هذا إذا حضرت مجلس مذكر داع إلى الله فلم تجد أثرا لكلامه فيك إن هذا من عدم صدق المذكر لا بل هو العيب منك من ذاتك حيث ما فطرك الله في ذلك الوقت على القبول فإن المنصف ينظر فيما جاء به هذا الداعي المذكر فإن كان حقا ولم يقبله فيعلم على القطع أن العيب من السامع لا من المذكر فإذا حضر في مجلس مذكر آخر وجاء بذلك الذكر عينه وأثر فيه فيقول السامع بجهله صدق هذا المذكر فإن كلامه أثر في قلبي والعيب منك وأنت لا تدري فلتعلم إن ذلك التأثير لم يكن لقبولك الحق فإنه حق في المذكرين في نفس الأمر وإنما وقع التأثير فيك في هذا المجلس دون ذلك لنسبة بينك وبين هذا المذكر أو بينك وبين الزمان فأثر فيك هذا الذكر والأثر لم يكن للمذكر إذ قد كان الذكر ولا أثر له فيك وإنما أثرت المناسبة التي بينتها لك الزمانية أو النسبة التي بينك وبين هذا المذكر وربما أثر لاعتقادك فيه ولم‏\n\n\nيكن لك اعتقاد في ذلك الآخر فما أثر فيك سواك أو ما أشبه ذلك ولهذا قلنا في تفسير الهداية الإلهية بالتوفيق والبيان فقولنا بالتوفيق أي بموافقة النسبة بين السامع والمذكر لا بالبيان فإن البيان فرضناه واقعا في الحالتين من المذكرين ولم يقع القبول إلا في إحدى الحالين فاعلم ذلك وتحققه ترشد إن شاء الله وأقل فائدة في هذه المسألة سلامة المذكر من تهمتك إياه بعدم الصدق في تذكيره ورده وردك الحق فإن السليم العقل يؤثر فيه الحق جاء على يدي من جاء ولو جاء على لسان مشرك بالله عدو لله كاذب على الله ممقوت عند الله لكن الذي جاء هو به حق فيقبله العاقل من حيث ما هو حق لا من حيث المحل الذي ظهر به وبهذا يتميز طالب الحق من غيره نش‏ء صورة الركعة العاشرة من الوتر انتشا منها رجل من‏\nرجال الله يقال له عبد ربه‏\n\n\n### [الربوبية موقوفة على اثنين‏]\n\n\nاعلم أن الربوبية نعت إضافي لا ينفرد به أحد المتضايفين عن الآخر فهي موقوفة على اثنين ولا يلزم أن لا يكونا متباينين فقد يكونان متباينين وقد يكونان غير متباينين فما لك بلا ملك لا يكون وجودا وتقديرا ومليك بلا ملك لا يكون كذلك والرب بلا مربوب لا يصح وجودا وتقديرا وهكذا كل متضايفين فنسبة العالم إلى ما تعطيه حقائق بعض الأسماء الإلهية نسبة المتضايفين من الطرفين فالعالم يطلب تلك الأسماء الإلهية وتلك الأسماء الإلهية تطلب العالم كالاسم الرب والقادر والخالق والنافع والضار والمحيي والمميت والقاهر والمعز والمذل إلى أمثال هذه الأسماء وثم أسماء إلهية لا تطلب العالم ولكن يستروح منها نفس من أنفاس العالم من غير تفصيل كما يفصل بين هذه الأسماء التي ذكرناها آنفا فأسماء الاسترواح كالغني والعزيز ولقدوس وأمثال هذه الأسماء وما وجدنا لله أسماء تدل على ذاته خاصة من غير تعقل معنى زائد على الذات فإنه ما ثم اسم إلا على أحد أمرين إما ما يدل على فعل وهو الذي يستدعي العالم ولا بد وإما ما يدل على تنزيه وهو الذي يستروح منه صفات نقص كوني تنزه الحق عنها غير ذلك ما أعطانا الله فما ثم اسم علم ما فيه سوى العلمية لله أصلا إلا إن كان ذلك في علمه أو ما استأثر الله به في غيبه مما لم يبده لنا وسبب ذلك لأنه تعالى ما أظهر أسماءه لنا إلا للثناء بها عليه فمن المحال أن يكون فيها اسم علمي أصلا لأن الأسماء الأعلام لا يقع بها ثناء على المسمى لكنها أسماء أعلام للمعاني التي تدل عليها وتلك المعاني هي التي يثنى بها على من ظهر عندنا حكمه بها فينا وهو المسمى بمعانيها والمعاني هي المسماة بهذه الأسماء اللفظية كالعالم والقادر وباقي الأسماء فلله الأسماء الحسنى وليست إلا المعاني لا هذه الألفاظ فإن الألفاظ لا تتصف بالحسن والقبح إلا بحكم التبعية لمعانيها الدالة عليها فلا اعتبار لها من حيث ذاتها فإنها ليست بزائدة على حروف مركبة ونظم خاص يسمى اصطلاحا فافهم ذلك نش‏ء صورة الركعة الإحدى عشرة من الوتر انتشا منها صورة رجل من رجال الله يقال له عبد الفرد\n\n\n### [أن الفردية لا يعقلها المنصف إلا بتعقل أمر آخر]\n\n\nاعلم أن الفردية لا يعقلها المنصف إلا بتعقل أمر آخر عنه انفرد هذا المسمى فردا بنعت لا يكون فيمن انفرد عنه إذ لو كان فيه ما صح له أن ينفرد به فلم يكن ينطلق عليه اسم الفرد فلا بد من ذلك الذي انفرد عنه أن يكون معقولا وليس إلا الشفع والأمر الذي انفرد به الفرد إنما هو التشبه بالأحدية وأول الأفراد الثلاثة فالواحد ليس بفرد فإن الله وصف بالكفر من قال إِنَّ الله ثالِثُ ثَلاثَةٍ فلو قال ثالث اثنين لما كان كافرا فإنه تعالى ثالث اثنين ورابع ثلاثة وخامس أربعة بالغا ما بلغ وهو قوله تعالى وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ فمن كان في أحديته فهو تعالى ثاني واحدة ومن كان في تثنيته فهو ثالث اثنينيته ومن كان في تثليثه فهو تعالى رابع ثلاثة بالغا ما بلغ فهو مع المخلوقين حيث كانوا فالخالق لا يفارقهم لأن مستند الخلق إنما هو للاسم الخالق استنادا صحيحا لا شك فيه وإن كان هذا الاسم يستدعي عدة معان فهو يطلبها أعني الاسم الخالق بذاته لكل معنى منها أثر في المخلوق لا في الخالق فالخالق لهذه المعاني كالجامع خاصة وأثرها في المخلوق لا فيه فالحق لا ينفرد في الأربعة بالرابع وإنما ينفرد في الأربعة بالخامس لأنه لَيْسَ كَمِثْلِهِ\n\n\nشَيْ‏ءٌ ولو كان عين الرابع من الأربعة لكان مثلها وكل واحد من الأربعة عين الرابع للأربعة من غير تخصيص ولو كان هذا لكان الواحد من الأربعة يربع الحق بوجوده وليس الأمر كذلك وهكذا في كل عدد فمتى فرضت عددا فاجعل الحق الواحد الذي يكون بعد ذلك العدد اللاصق به ولا بد فإنه يتضمنه فالخامس للأربعة يتضمن الأربعة ولا تتضمنه فهو يخمسها وهي لا تخمسه فإنها أربعة لنفسها وهكذا في كل عدد وإنما كان هذا لحفظ العدد على المعدودات والحفظ لا يكون إلا لله وليس الله سوى الوحد فلا بد أن يكون الواحد أبدا له حفظ ما دونه من شفع ووتر فهو يوتر الشفع ويشفع الوتر فيقال رابع ثلاثة وخامس أربعة ولا يقال فيه خامس خمسة ولا رابع أربعة ولا عاشر عشرة فالحكماء يقولون في الفردية إنها الوتر من كل عدد من الثلاثة فصاعدا في كل وتر منها كالخامس والسابع والتاسع فبين كل فردين مقام شفعية وبين كل شفعين مقام فردية هذا عند الحكماء وعندنا ليس كذلك فإن الفردية تكون للواحد الذي يشفع الوتر وللواحد الذي يوتر الشفع الذي هو عند الحكماء فرد ولو لا ذلك ما صح أن تقول في فردية الحق إنه رابع ثلاثة وسادس خمسة وأدنى من ذلك وأكثر وهو فرد في كل نسبة فتارة ينفرد بتشفيع الوتر وتارة بإيثار الشفع وهو قوله ما يَكُونُ من نَجْوى‏ ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ ولا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ فما بين في فرديته بالذكر المعين إلا فردية تشفيع الوتر الذي لا يقول به‏\nالحكماء في اصطلاح الفردية ثم قال في العام ولا أَدْنى‏ من ذلِكَ ولا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ سواء كان عددهم وترا أو شفعا فإن الله لا يكون واحدا من شفعيتهم ولا واحدا من وتريتهم بل هو الرقيب عليهم الحفيظ الذي هو من وَرائِهِمْ مُحِيطٌ فمتى انتقل الخلق إلى المرتبة التي كانت للحق انتقل الحق إلى المرتبة التي تليها لا يمكن له الوقوف في تلك المرتبة التي كان فيها عند انتقال الخلق إليها فانظر في هذا السر الإلهي ما أدقه وما أعظمه في التنزيه الذي لا يصح للخلق مع الحق فيه مشاركة فالخلق أبدا يطلب أن يلحق بالحق ولا يقدر على ذلك لانتقال الحق عن تلك المرتبة ولهذا كان العدد لا يتناهى فإنه لو تناهي للحق الخلق الحق ولا يكون ذلك أبدا فالخلق خلق لنفسه والحق حق لنفسه ومثال ذلك أن يكون جماعة من ثلاثة في نجوى بينهم قد جمعهم مجلس فالله بلا شك رابع تلك الجماعة فإن رابعهم إنسان آخر فجاء وجلس إليهم انتقل الحق من المرتبة الرابعة بمجرد مجي‏ء ذلك الرجل أو الشخص الذي ربعهم إلى المرتبة الخامسة فإن أطالوا الجلوس بحيث أن جاء من خمس القوم انتقل الحق إلى المرتبة السادسة فيكون سادس خمس وهو سادس الجماعة أعني هذه الجماعة بعد ما كان خامس الجماعة التي خمسها ذلك الواحد فاعلم فقد نبهتك على علم عظيم تشكرني عليه عند الله فإني أرجو من الله أن ينفعني بمن علم مني ما ذكرته في كلامي هذا من العلم بالله الذي لا تجده فيما تقدم من كتب المؤلفين في هذا الفن وهذا كله نقطة من كلمة من القرآن العزيز فما عندنا من الله إلا الفهم فيه من الله وهو الوحي الإلهي الذي أبقاه الحق علينا فهذا الذي ذكرناه كان وتر رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من صلاة الليل وأما تمام الاثنتي عشرة فذلك المسمى المهيمن الخارج عن نش‏ء صورة الوتر القوي وهو الواحد الأول وليس إلا الله فهو المنشئ سبحانه وتعالى في كبريائه الواحد الأحد الذي لَمْ يَلِدْ ولَمْ يُولَدْ ولَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ\n\n\nوالرجل الذي كمل به الاثني عشر كما كمل الشهور برمضان ما كملها إلا باسم من أسمائه وهو رمضان عز وجل فبه كمل كل شي‏ء فكمال الأربعة بالخامس إذا كان الله خامس أربعة فإنه الذي يحفظ عليها أربعتها فإذا جاء من جنسها من يخمسها ذهبت الأربعة وكان الله سادس الخمسة يحفظ عليها خمستها لأنه الحفيظ فانظر ما أعجب هذا الأمر ومن هنا صح الفرار الموجود والانتقال من حال إلى حال فإن الله ينتقل في مراتب الأعداد لما ذكرناه واسم هذا الرجل الذي كمل الله به الاثني عشر عبد الله وإنما سمي عبد الله لأن الله يتجلى له بحقيقة كل اسم من أسمائه وهو قوله ولِلَّهِ الْأَسْماءُ الْحُسْنى‏ فَادْعُوهُ بِها فإذا دعوته باسم منها تجلى مجيبا لك في عين ذلك الاسم كصوم شهر رمضان فإن صومه واجب في الاثني عشر شهرا فكل صوم في شهر من الشهور الأحد عشر إنما هو تشبيه بصوم يوم من أيام شهر رمضان لأنه نافلة والواجب ليس إلا رمضان بالوجوب الإلهي الابتدائي وإنما قلنا الابتدائي من أجل النذر بالصوم الذي أوجبه الله عليك بإيجابك إياه على نفسك عقوبة لك وليثبك به إذا أديته ثواب الواجب لكن الفرق بينه وبين الواجب المبتدأ أن الواجب المبتدأ تقضيه إذا مضى زمان إيجابه وو الواجب الكوني لو نسيته لكن أو مرضت فلم تقدر على أدائه ومضى زمانه لم تقضه فهذا هو الفرق بين الواجب الإلهي والواجب الكوني فمن عرف ما ذكرناه من أمر هذه الاثني عشر فقد حصل على كنوز إلهية كما قيل في الفاتحة إن الله أعطاها نبيه محمدا صلى الله عليه وسلم خاصة دون غيره من الرسل من كنز من كنوز العرش لم توجد في كتاب منزل من عند الله ولا صحيفة إلا في القرآن خاصة وبهذا سمي قرآنا لأنه جمع بين ما نزل في الكتب والصحف وما لم ينزل ففيه كل ما في الكتب كلها المنزلة وفيه ما لم ينزل في كتاب ولا صحيفة وفي هذا المنزل من العلوم علم الحل والعقد وفيه علم الحلال والحرام وفيه علم ما يجمع الكافر والمؤمن ويؤلف بينهما وفيه علم إلحاق البهائم بالإنسان في حكم ما من أحكام الشرائع وفيه علم متعلق الكمال ببعض الأشخاص وما فيه علم التقديس وأسبابه وأنواعه وفيه علم الآلاء والمنن الإلهية وفيه علم المواثيق والعهود وفيه علم نش‏ء صور العبادات البدنية وفيه علم التعظيم الكوني وفيه علم المداينات الإلهية وفيه علم الايمان وفيه علم الإبدال وفيه علم النداء الإلهي وفيه علم التعريف وفيه علم إقامة البراهين على الدعاوي وفيه علم أصحاب الفترات ما حكمهم عند الله وفيه علم ما يخص الملك والسوقة وفيه علم النيابة في النداء وفيه علم الرد والقبول وفيه علم التفويض والتسليم في النفوس وفيه علم الستر ورد الأشياء إلى أصولها وفيه علم إقامة الواحد مقام الجميع في أي موطن يكون‏\nوفيه علم الموافقة والخلاف وفيه علم مؤاخذة المجبور وفيه علم السماع وفيه علم النور والمعنوي والهدى وفيه علم الأمثال وفيه علم الاتباع والأتباع وفيه علم الشهادات وفيه علم المعاد وحكمه وفيه علم الخوف والحذر وفيه علم التجانس بين الأشياء وفيه علم الحب وشرفه وأصناف المحبين وفيه علم خلع العذار فيه وفيه علم الاختصاص وفيه علم نسخ البواطن في العموم والخصوص وفيه علم تشبيه الحق بالخلق وما يجوز من ذلك وما لا يجوز ومتعلقة السمع ليس للعقل فيه دخول بما هو ناظر فيه وفيه علم الوهب والكسب وفيه علم ما يجب على الرسول وفيه علم من سمي الله بغير اسمه ما حكمه في التوحيد وفيه علم مراتب الضلال والإضلال والتفاوت في ذلك وفيه علم الأمر بالمعروف والنهي عن المنكر وفيه علم تأثير الخلق في الحق وفيه علم ما شقي به أهل الكتب وفيه علم رفع الحرج ومراتب المتقين وفيه علم الاختيار وفيه علم شرف الأماكن بعضها على بعض لما ذا يرجع وفيه علم تحكم الأدنى على الأدنى وفيه علم إضافة الأشياء إلى أصولها وفيه علم التعريض بالخير والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Three Hundred and Seventy-Nine\n\nConcerning the knowledge of the Station of Loosing and Binding, of Honoring and Humiliating, and the origination of Supplication in the form of Narration. It is a Muhammadan Station.\n\n> Platters made of silver *** And of essence and spring [‘ayn].\n>\n> Noble ones brought them to us *** Over them were veils of protection.\n>\n> When they appeared to us *** We ate of every color.\n>\n> From them are sciences and description *** And from them are sciences of the cosmos.\n>\n> From them are sciences of spiritual state (ḥāl) *** And from them are sciences of direct vision (‘ayn).\n>\n> So some speak of union (waṣl) *** And some speak of separation (bayn).\n>\n> Glory be to Him who is exalted *** By the similitude of every essence/eye.\n>\n> For His being is not other than Him *** And His being is not by my being.\n\n### [The Twelve: The Limit of the Simple Numbers]\n\nKnow that the number twelve (12) is the limit of the simple numbers (البسائط) composed of digits (أصابع) and joints (عقد). The digits are nine of them, and the joints are three, making the total twelve. Each of these twelve possesses a ruling (ḥukm) that the others do not, and a Divine witnessing (mashhad) that belongs to no other. Corresponding to each of these numbers is a man among the servants of Allah who holds the ruling of that number.\n\nThe One (الواحد) is not counted among the numbers. This is why the Witr (وتر) prayer of the Messenger of Allah (PBUH) was eleven *rak‘ahs*. If the One were counted among the numbers, the singularity (Witr-ness) would not be valid at all, neither in the number nor in the counted objects. Thus, the Witr prayer of the Messenger of Allah (PBUH) was eleven *rak‘ahs*, and each *rak‘ah* is the origination (نشأة) of a man from his community whose heart is upon the form of the Prophet’s heart (PBUH) in that *rak‘ah*.\n\nAs for the Twelfth, he is the one who comprehends the eleven. The man who holds the station of the twelve is the Truth (Ḥaqq) entirely, outwardly and inwardly. He knows and is not known. He is the First One (الواحد الأول). For the beginning of counting is from two. When you reach twelve, you have only reached eleven of the numbers, for the First One is not counted among them. The existence of the twelve is not valid except through the First One, despite Him not being counted among the numbers. Because He holds this ruling, He is in the twelve, yet He is not it, just as one says, \"You are not you.\"\n\nThese twelve are the ones who extract the treasures of Gnosis (كنوز المعارف) that are stored within the forms of the world (صور العالم). The world has the knowledge of the forms of the world, but these men have the knowledge of what these forms contain—the treasure within them—which they extract by means of the First One. Thus, they are the most knowledgeable of people concerning Unity (التوحيد) and Worship (العبادة). They possess the perpetual, essential intimate conversation (المناجاة) with Allah, which is maintained by the maintenance of the One for the numbers, like His saying: <<وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ>> (And He is with you wherever you are). That is, you have no specific existence apart from the One. By the One, the essences (أعيان) of the numbers appear; He is their Manifestor and their Enricher.\n\nThe letter *alif* is His description, for by the *alif* the affinity (ألفة) of the One with the degrees of number occurs due to His manifestation, for <<هُوَ الْأَوَّلُ وَالْآخِرُ>> (He is the First and the Last). If you multiply the One by itself, nothing appears externally after the multiplication except Himself. And whatever you multiply the One by, that thing neither doubles nor increases. For the One that you multiplied into that multiplicity (كثرة) was only multiplied into its own oneness (aḥadiyya), which is why no increase appeared in it. The One does not accept increase in itself or in what it is multiplied by; it does not double. It is One wherever it is. So you say, \"One times one hundred thousand is one hundred thousand,\" and \"One times two is two,\" and \"One times ten is ten.\" Nothing is added to the multiplied number at all, because the station of the One is too exalted to reside in anything or for anything to reside in it. This applies whether the number is whole or fractional; there is no difference.\n\nThe One, meaning the Real (الحق), leaves the realities (الحقائق) as they are; they do not change from their essence. For if they changed, the One would change in Himself, and the Real would change in Himself, and the change of realities is impossible. No knowledge would be established at all, neither Divine nor created. Thus, it is established that realities never fundamentally change. This is why reliance is placed upon what is relied upon, which is called Knowledge (العلم).\n\nLet us mention each man among these eleven who originated from the Witr of the Messenger of Allah (PBUH). Indeed, these forms perhaps made the Messenger of Allah (PBUH) perform the Witr of eleven *rak‘ahs* in the outward form, while these forms originated from him (PBUH) inwardly. For he was a Prophet while Adam was between water and clay, and he originated them because this was his description. When he (PBUH) appeared with his body, he maintained those spiritual forms (الصور المعنوية), and they established his body at night due to the suitability of the Unseen (al-Ghayb). They ruled over his outward form with the eleven *rak‘ahs* with which he performed the Witr. Thus, they were his Witr; they are the Rulers and the Ruled for him. From him (PBUH) they originated, and in him (PBUH) they appeared, and upon him they ruled in two different ways.\n\nFrom the form of the First *Rak‘ah* originated a man from the men of Allah called ‘Abd al-Kabīr (Servant of the Great) in terms of attribute, though it is a name for him. He is a rational spiritual origination (نشأة روحانية معقولة) that, if embodied, would be in the form of a human whose description is what he is called by. And so is every form of these twelve.\n\n### [The Superiority in the Divine Names]\n\nKnow that the superiority (المفاضلة) in the Divine Names is a higher and more majestic example, as in the saying of the Messenger of Allah (PBUH) when the polytheists chanted in their war-song, \"A‘la Hubal! A‘la Hubal!\" (Hubal is higher! Hubal is higher!). The Messenger of Allah (PBUH) said, \"Say!\" They asked, \"O Messenger of Allah, what should we say?\" He said, \"Say: Allah is Higher (A‘lā) and More Majestic (Ajall).\"\n\nThey concede this much, for they are the ones who say: <<مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى>> (We only worship them that they may bring us nearer to Allah). So, He is Higher and More Majestic in their view. If they had believed the Messenger of Allah (PBUH) that he was a messenger from the Allah to whom they sought proximity by worshipping these deities, they would not have called them deities (ālihat) except because they made them objects of worship, for *ilāh* (deity) is the object of worship, and *ālihat* (deities) means worship. It has been recited: *wa yadharaka wa ālihataka* (and leave you and your deities), meaning, \"and your worship.\" If one says *wa ālihataka*, it means \"and the worshipped ones whom we worship.\"\n\nSince they attributed divinity (al-ulūhiyya) to those whom they worshipped, and the attribution of divinity to Allah is more complete and greater in their own admission, the Messenger of Allah (PBUH) spoke using the structure of comparison (المفاضلة) in that context, saying to them, \"This is your own saying and belief.\" This is why the phrase *Allahu Akbar* (Allah is Greater) came in the *takbīr* of the prayer with the structure of comparison, not because stones or what they carved or what they attributed divinity to (like a star or other things) are superior. Rather, the comparison occurred in the context of appropriateness (المناسبة), not in the essences (الأعيان), because there is no comparison between the servant and the Master, nor the Lord and the object of Lordship (المربوب), nor the Creator and the created.\n\nIf you realize what we have alluded to regarding the origination of this form, you will know what the polytheist returns to after accountability.\n\nThe origination of the form of the Second *Rak‘ah* of the Witr originated a man from the men of Allah the Exalted, called ‘Abd al-Mujīb (Servant of the Responder).\n\n### [Response is a Branch of the Request]\n\nKnow that the response (الإجابة) is a branch of the request (السؤال). This servant is effective through his request and supplication (دعاء) upon his Master, and the Master is effective upon him by responding to His servant.\n\nFor Allah, the Mighty and Majestic, has established for Himself, upon the tongue of His Messenger (PBUH), that the servant pleases Allah, so He is pleased; the servant angers Allah, so He is angry; the servant displeases Allah, so He is displeased; and the servant makes Allah laugh, so He laughs.\n\nAnd similar things that have been reported in the Book and the Sunnah. The Real (الحق) influences the servant to ask so that He may respond, and influences the displeasing act so that He may be displeased. This is so you may know that the matter is circular and spherical (دوري كروي), and that the end of the circle returns to its starting point, so the Last bends back upon the First, to be the First and the Last. Thus, none pleases Him but He, and none displeases Him but He, because He is too exalted to be influenced by other than Himself. Understand this.\n\nAllah has no ruling (ḥukm) in the world except what we have mentioned. Do you not see Him saying: <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ>> (We shall attend to you, O you two weighty ones [men and jinn])? He has no occupation except with us. It is from us that He attends to us. If we were to cease, He would be, but there would be no existence (وجود) or estimation (تقدير). The matter cannot be rationally understood except in this way, otherwise the relations (الإضافات) would be nullified, and they are not nullified because they are relations unto themselves. Therefore, the Lord cannot be conceived without being related. That is why He never came in the Quran absolutely without relation, even if His relations differ: sometimes He is related to pronouns, sometimes to essences (الأعيان), and sometimes to states (الأحوال).\n\nIf you do not rationally understand your knowledge of your Lord in this way, then you have not known your Lord at all. You have only known by rational division that the ruling of the Necessarily Existent by His Essence (الواجب الوجود لذاته) must be such-and-such. But whether there is a Necessarily Existent by His Essence or not, you do not know Him except through yourself. And what we do not know except through you, the knowledge of it must be contingent upon your knowledge of yourself. Thus, your existence is contingent upon His existence, and the knowledge of His Lordship over you is contingent upon the knowledge of yourself. He is the origin (الأصل) in existence, and you have the ruling of the branch (الفرع) in existence; but you are the origin in the knowledge of Him, and He has the ruling of the branch in knowledge.\n\nThe origination of the form of the Third *Rak‘ah* of the Witr originated a man from the men of Allah called ‘Abd al-Ḥamīd (Servant of the Praiseworthy).\n\n### [Praise of Allah is of Two Types: Absolute and Restricted]\n\nKnow that the praise (الثناء) of Allah is of two types: absolute (مطلق) and restricted (مقيد). The absolute is only possible with the acknowledgment of incapacity (العجز), such as His saying (PBUH):\n\n> I cannot enumerate Your praise; You are as You have praised Yourself.\n\n> One of them said: If we praise You with goodness *** You are the one whom we praise, and above the one whom we praise.\n\nIt is impossible for a created being to encompass the praise due to Allah the Exalted, because it is impossible for all possibilities (الممكنات) to enter into existence. Every possibility has a specific face (وجه خاص) toward Allah, from which Allah brings it into existence, from which that possibility knows Him, and from which it praises Him with a praise that only the possessor of that face knows. No one else can know it or indicate it with a word or a sign. This is the absolute praise of Allah by every tongue, past and future.\n\nThis is why the reward for the saying of the one who says, \"Glory be to Allah, the number of His creation\" (سبحان الله عدد خلقه), cannot be conceived as occurring in existence, but its reward continues to be found, state after state, perpetually, without end. This is also why the Law (al-Shar‘) brought it in triplicate, that the servant should say it three times, so that the sensible reward (المحسوس), the imagined reward (المتخيل), and the spiritual reward (المعنوي) may be attained. Thus, he is blessed sensually, imaginatively, and intellectually, just as he remembers sensually, imaginatively, and intellectually, and just as he worships sensually, imaginatively, and intellectually.\n\nSimilarly, the servant’s remembrance of the ink of the Divine Words (مداد الكلمات الإلهية), and the weight of His Throne (زنة عرشه)—if the Throne is the entire delimited cosmos (العالم كله بمحدده)—and similarly, the pleasure of His Self (رضا نفسه) in what the people of Paradise and the people of the Fire do. For they do not act or dispose themselves except in Divine Pleasures (المراضي الإلهية), because that abode grants them this, unlike the abode of this world and obligation (التكليف), where they dispose themselves in what pleases Allah and what displeases Him. This is because Allah made the Fire the abode of those with whom He is displeased, so its inhabitants must move in what displeases Allah in the abode of this world. But when they dwell in the abode of the Fire and inhabit it, they cannot move except in the pleasure of Allah. This is why the outcome for its inhabitants will be the ruling of the Mercy that <<وَسِعَتْ كُلَّ شَيْءٍ>> (encompassed everything), even though it is the abode of wretchedness (دار شقاء). Just as we say of the Messenger whose mission has ended and who has returned to Allah that he is the Messenger of Allah, even though he is not a messenger in that state, similarly, we say of the abode of wretchedness that it is the abode of wretchedness, even though wretchedness has departed from its inhabitants while they are in it.\n\nAs for restricted praise (الثناء المقيد), the philosophers (الحكماء) restrict it only to the attribute of Transcendence (التنزيه). Even if they praise Him with the attribute of Act (صفة الفعل), it is by the ruling of the whole or the origin (الأصالة), not by ruling for an individual.\n\nThose other than the philosophers restrict the praise of Allah to the attribute of Act and the attribute of Transcendence together. These are the Perfect Ones (الكمل), because they shared with the philosophers what they knew and added what the philosophers were ignorant of and did not know, due to the limitation of their aspiration (همهم) caused by the ambiguity that arose for them, which ruled upon them that only the One referred to proceeded from the Exalted, and that what He described Himself with in His Book is not permissible for Him, since they did not establish in their view a revealed Book or a sent person in the manner that the matter is in itself and with the People of Unveiling (الكشف) and Faith (الإيمان). This view has been adopted by some rational thinkers, such as the theologians (المتكلمين) and others who hold this view based on rational speculation.\n\nThe ruling of the forms of these Prophetic Witr *rak‘ahs* has spread throughout the entire world from the time he (PBUH) was a Prophet while Adam was between water and clay until the Day of Resurrection.\n\nThe origination of the form of the Fourth *Rak‘ah* of the Witr originated a man from the men of Allah called ‘Abd al-Raḥmān (Servant of the All-Merciful).\n\n### [The Divine Mercy that Allah Created in His Servants is Created from the Essential Mercy]\n\nKnow that the Divine Mercy (الرحمة الإلهية) that Allah created in His servants so that they might show mercy to one another is created from the Essential Mercy (الرحمة الذاتية) by which Allah brought the world into existence when He loved to be known, and by which He <<كَتَبَ عَلَى نَفْسِهِ الرَّحْمَةَ>> (prescribed Mercy for Himself). This Written Mercy (الرحمة المكتوبة) is passive (منفعلة) relative to the Essential Mercy.\n\nThe Gratuitous Mercy (الرحمة الامتنانية) is the one that <<وَسِعَتْ كُلَّ شَيْءٍ>> (encompassed everything). The mercy of a thing upon itself is sustained by the Essential Mercy and looks toward it. In this mercy, the witnessing (الشهود) of every compassionate one upon himself occurs. For Allah described Himself with love and intense longing (شدة الشوق) to meet His beloved ones. He only met them by the ruling of this mercy that the possessor of this mercy witnesses—the Mercy He prescribed for Himself. It has no witnessing in the Essential Mercy or the Gratuitous Mercy.\n\nAs for the mercy of the compassionate one toward the one who wronged him, and what the comprehensiveness of Divine beneficence and the vastness of Bounty (الجود) necessitate, it has no witnessing except in the Gratuitous Mercy. This is the mercy that Iblis and those below him hope for. These have no witnessing in the Written Mercy or the Essential Mercy.\n\nBy this, Allah and the All-Merciful (al-Raḥmān) were distinguished from other Names, for <<لِلَّهِ الْأَسْمَاءُ الْحُسْنَى>> (To Allah belong the Most Beautiful Names). All the Names are indications of the Name al-Raḥmān and the Name Allah, but most people do not perceive this. I have not seen anyone among the People of Allah (Ahl Allah) draw attention to the tripartition of Mercy with this division, for it is a strange division, just as it is in reality. We only learned it through Unveiling (الكشف). I do not know why our companions neglected to express it, though I suspect Allah revealed it to them. As for the Prophets, we know that they stood upon this knowledge with direct vision (‘ayn), and we knew it from the light of their niche, because Allah granted us Divine Following (الاتباع الإلهي) and Prophetic Following (الاتباع النبوي).\n\nAs for Divine Following, it is His saying, <<وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ>> (And He is with you wherever you are). In this company (ma‘iyya), Allah follows the servant wherever he is. We, too, follow the Exalted wherever He manifests by a ruling. We remain still until He manifests by a command that gives a specific ruling in existence, and then we follow Him in it. We do not appear in public contrary to it, such as our silence regarding defining Him as \"He\" when He manifests in a form that is denied, even though we know Him. He is the one who precedes with the Theophany (التجلي) and the ruling of denial, so we follow Him by silence, neither denying nor affirming. This is Divine Following.\n\nAs for the Prophetic Following that Allah granted us, it is His saying, <<لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ>> (Indeed, in the Messenger of Allah you have a good example). Furthermore, He followed us and took us as an example in his prayer when he prayed with the congregation, where there might be the weak, the sick, and the one with a need, so he prayed according to their prayer. Thus, he (PBUH) was the follower (متبع) and the followed (متبوع)—both active and passive participles. Then He commanded us, when we are imams, to pray according to the prayer of the weakest among us.\n\nWe follow the All-Merciful (al-Raḥmān) in what we mentioned, so we are the followers. And we follow the All-Merciful in what our realities necessitate of need and destitution, so He proceeds according to our state, and thus we are the followed. Look at what the realities of Lordship (al-siyāda) grant to the servants, and what the realities of worship and servitude (al-‘ubūdiyya) grant to Lordship.\n\nThis man possesses this description in the world. By this Fourth *Rak‘ah*, the rulings of the four Divine Names appeared, as well as the rulings of Nature (الطبيعة) in the natural origination (النشأة الطبيعية), the rulings of the elements in the three generated realms (المولدات الثلاثة) that possess these three Mercies, and the rulings of the humors (الأخلاط) in the animal origination (النشأة الحيوانية). Therefore, this man has dominion (المهيمنية) over all of these.\n\nThe origination of the form of the Fifth *Rak‘ah* of the Witr originated a man from the men of Allah called ‘Abd al-Mu‘ṭī (Servant of the Giver).\n\nSometimes his giving is a gift (wahb), so the Giver is ‘Abd al-Wahhāb (Servant of the Bestower). Sometimes his giving is a favor (in‘ām), so he is ‘Abd al-Mun‘im (Servant of the Favorer). Sometimes his giving is generosity (karam), so the Giver is ‘Abd al-Karīm (Servant of the Generous). Sometimes his giving is bounty (jūd), so the Giver is ‘Abd al-Jawwād (Servant of the Bountiful). Sometimes his giving is liberality (sakhā’), so the Giver is ‘Abd al-Muqīt and ‘Abd al-Sakhī (Servant of the Sustainer and Servant of the Liberal). And sometimes his giving is altruism (īthār), so the Giver is ‘Abd al-Ghanī (Servant of the Rich/Self-Sufficient).\n\nThis giving is the most obscure of all givings and the most difficult to conceive; indeed, everyone denies it except us. We have not seen anyone establish this giving in Divine matters (الإلهيات). None establishes it except one who knows the meaning of His Name, al-Ghanī (The Self-Sufficient), the Exalted. This is because it is established in the *Ṣaḥīḥ* collection that the servant reaches a station where the Real (الحق), in terms of His Identity (Huwiyya), becomes all his powers, as in His saying:\n\n> I was his hearing, his sight, and his hand.\n\nAnd the rest of his limbs and powers, as mentioned in the Hadith. He, Glory be to Him, is Self-Sufficient by His Essence (الغني لذاته), a Self-Sufficiency that cannot be removed from Him. When the servant stands in this station, He has given him the attribute of Self-Sufficiency from Him and from everything, because His Identity is the very essences (أعيان) of this servant’s powers. This is not found in the divisions of giving except as altruism (الإيثار). He has preferred His servant with what belongs to His Identity. He the Exalted said: <<وَيُؤْثِرُونَ عَلَى أَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ>> (And they prefer [others] over themselves, even though they are in need). Indeed, they are in need.\n\nSince the giving of altruism is a favor (faḍl) that returns to the Giver, the Real is more deserving of the attribute of Favor. Thus, the giving of altruism is more appropriate for the Real and more complete for the servant. This is one of the sciences of secrets (علوم الأسرار) whose definition cannot be fully elaborated except by allusion to its people, encouraging them to act upon it, for they are in extreme fear of accepting it, let alone being characterized by it. The rest of the Names are of lesser concern.\n\nThe origination of the form of the Sixth *Rak‘ah* of the Witr originated a man from the men of Allah called ‘Abd al-Mu’min (Servant of the Giver of Security/The Believer).\n\n### [That Faith is a Divine Attribute]\n\nKnow that Faith (الإيمان), when it is a Divine attribute (نعت إلهي), is what appears from all the indications (الدلالات) that confirm the validity of the claim made by any claimant, whatever the claim, without specific designation, provided that it is a proof (dalīl) in itself. This is witnessed by the senses if the proof is sensible, such that if it grants necessary knowledge (العلم الضروري) of the truth of this claim in the mind of the judge, that necessary knowledge is the very proof of the truth of the claimant’s assertion.\n\nThe Establisher of these indications is the Affirmer (المصدق) of the claimant. When the one who affirms him does so, and the knowledge of this is attained in the soul of the one who attained it, that person who possesses this proof becomes an affirmer of the claimant. Thus, the affirmation returns to being cosmic (كونيا)—that is, in creation (al-Khalq)—just as it is in the Real (al-Ḥaqq). The claimant is thus confined between two affirmers; wherever he turns, he finds only an affirmer of what he brought in his claim. This state grants him security (الأمان) within himself from being denied by these two sides. Even if the cosmos denies him, he is certain within himself of the claimant’s truthfulness. This is the only goal: the attainment of knowledge of his truthfulness.\n\nBy the form of this *rak‘ah*, affirmation spread in the world of humans and jinn in their inner beings. This occurred when this *rak‘ah* took place in the inner reality, when he (PBUH) was a Prophet while Adam was between water and clay. It continued to spread as a pure spirit (روحا مجردا) in every affirmer until he (PBUH) performed it in the form of his body, and it became embodied. That spirit is not a bodily form resulting from his act, because it arises from sensible movements. Its act was stronger in our view because it combined the two forms, just as his influence (PBUH) through the appearance of his body was stronger in his mission than when he was a Prophet while Adam was between water and clay. For by the form of his mission, he abrogated all previous laws (الشرائع), and no law remained valid except what he maintained from it, in the sense that it was a law for him, not merely a law in itself.\n\nThe origination of the form of the Seventh *Rak‘ah* of the Witr originated a man from the men of Allah called ‘Abd al-Raḥīm (Servant of the Merciful).\n\nKnow that Mercy (الرحمة) in the essence of the one capable of manifesting its ruling turns into painful torment (عذاب أليم) for the one in whom it resides, because its essence demands reaching out to the object of mercy (المرحوم) and manifesting its effect through action upon him. If it resides in the one capable of executing it upon the object of mercy, it has an effect that influences the compassionate one (al-Rāḥim), which is the removal of the pain he felt by the effect occurring in the object of mercy. The compassionate one is shown mercy by it, in terms of his ability to execute it. The one upon whom it is executed is also shown mercy by it and by the compassionate one’s ability to execute it. Thus, its effect upon him is from two aspects. The effect is the removal of what caused the compassionate one pain due to the attachment of mercy to that object of mercy.\n\nNot all mercy is bliss (na‘īm) unless the compassionate one is capable of executing it. Mercy has a Theophany (تجلي) in the form of torment in the case of the compassionate one who lacks the power to execute it, and it has a Theophany in the form of bliss in the case of the compassionate one and the object of mercy if it resides in one capable of executing it. Thus, it has inverted the two opposing forms. This is one of the most astonishing matters: that mercy produces pain and torment. If mercy did not reside in him, this powerless one would not be characterized by pain.\n\nThe most astonishing aspect of this issue is that the mercy residing in the one characterized by the execution of power may have a barrier from his own essence preventing its execution. This causes him the pain of aversion (ألم الكراهة), which is the ruling of that barrier, despite his being characterized by the power to execute it. This issue is one of the most difficult in Divine Knowledge (العلم الإلهي).\n\nThe ruling of this appeared in the authentic Divine reports about Himself, the Mighty and Majestic, where He said:\n\n> I have not hesitated about anything I am going to do as much as I hesitate about taking the soul of My believing servant, who dislikes death, and I dislike causing him distress, but he must meet Me.\n\nIt is He who made him dislike death, and He indicated that meeting Him only occurs through death, which is the departure from the absolute sense (al-Ḥiss al-Muṭlaq) to the shared sense (al-Ḥiss al-Mushtarak), as you see in sleep, for sleep is a type of death. It is a demise (wafāt) and a transition from the world of sense to the world of Imagination (al-Khayāl) and the shared sense. The sleeper sees his Lord in his sleep, just as the dead person sees his Lord after his death. However, the vision and meeting of the dead person is without return after his vision, while the sleeper awakens, sent forth until the appointed term. If the meeting is due to annihilation (fanā’) and not sleep, and then he is returned to the state of subsistence (baqā’), his ruling is like that of the dead person when he is resurrected on the Day of Resurrection: no veil falls upon him thereafter. This is the difference between the sleeper and the annihilated one (al-Fānī).\n\nThat is why ‘Amr ibn ‘Uthmān al-Makkī said concerning the description of the Gnostics (‘Ārifīn): \"They are today as they will be tomorrow, if Allah wills.\" He saw nothing more astonishing than the ruling of Mercy. Do you not see the physician who feels mercy for the patient with a gangrenous wound, yet cannot execute that mercy upon him except by causing him pain? The measure of that physician’s mercy for the patient is the measure of his own pain, due to his inability to execute the mercy without causing pain. If he did not have mercy for him, he would not feel pain. Do you not see how the one being treated does not feel pain, but rather finds pleasure?\n\nReflect upon what I have mentioned to you in Divine Knowledge. I have seen it in authentic Unveiling (al-Kashf al-Ṣaḥīḥ) and clear Witnessing (al-Mashhad al-Ṣarīḥ), with the Messenger of Allah (PBUH) beside me. Allah commanded the killing of the Dajjāl (Antichrist) for his claim to divinity, and yet He wept and offered excuses for him regarding the punishment he would receive because of him, saying that he had no control over it. His weeping is like the pain in the soul of the compassionate one who lacks the power to execute his mercy due to a barrier. There is no greater perplexity (ḥīra) in Divine Knowledge than this perplexity. If it were not immense, the Real would not have described Himself with hesitation (al-taraddud), and hesitation is perplexity. Understand this.\n\nThe origination of the form of the Eighth *Rak‘ah* of the Witr originated a man from the men of Allah the Exalted, called ‘Abd al-Malik (Servant of the King).\n\n### [The Creature is a King Absolutely, and the Real is the King of the King]\n\nKnow that the King (al-Malik) is the one who brought into existence this reality called kingship (mulk). When the servant is named by it, and the Real is characterized by Kingship, He is not characterized by it in the same way as the created being. For the created being is a king (ملك) absolutely, and the Real is the King of the King (ملك الملك), not a King absolutely.\n\nHe is not a King to the servant until the servant’s servitude (‘ubūdiyya) to Him the Exalted appears, and until his being a king to his Sovereign (Malīk), who is Allah the Exalted, appears to him. We only said this because of a group whose speculation led them to believe that Allah does not know the particular (al-juz’) specifically, but only knows the whole (al-kull) that encompasses the particular—contrary to the People of the Real, the People of Unveiling and Existence (al-Kashf wa al-Wujūd).\n\nThis is why He has the Name *al-Malik* (The King) and *al-Malīk* (The Sovereign). This description appeared due to intensity, because the adherents of this rational speculation do not affirm it. Since the intellects did not agree upon it, a dispute arose. The Real appropriated the title *Malik* (King) for Himself, meaning intensely. And the knowing servant appropriated the Real as his *Malik* (Sovereign), meaning intensely, because of the disputant. He named Himself King of the King (Malik al-Malik) to differentiate between Himself and the created being’s kingship to Allah. The created being is characterized by servitude to Allah in his being a king to Him, while the Real is characterized by the Kingship of the King and is not characterized by servitude to Him. Even though there is an influence from creation upon the Real, as mentioned previously, He is still not characterized by servitude, because that influence is not due to abasement (dhilla), for He the Exalted is the origin of that influence. Nothing returns to Him except what originated from Him. This is contrary to creation, for what originated from the created being returns to him, and what did not originate from him resides in him by an initiation from the Real. Know this.\n\nThe origination of the form of the Ninth *Rak‘ah* of the Witr originated a man from the men of Allah called ‘Abd al-Hādī (Servant of the Guide).\n\nKnow that Guidance (al-Hidāya) is a Divine effect (أثر إلهي) in His saying: <<مَنْ يُضْلِلِ اللَّهُ فَلَا هَادِيَ لَهُ>> (Whomever Allah leads astray, there is no guide for him). And it is a cosmic effect (أثر كوني) in His saying: <<وَلِكُلِّ قَوْمٍ هَادٍ>> (And for every people there is a guide). The meaning of the latter returns to the former, for the cosmic guide is only a messenger from Allah. He is a conveyor (muballigh), not a guide in the sense of granting success (muwaffiq), but a guide in the sense of clarifying (mubayyin).\n\nHe the Exalted said concerning the clarification and explanation that Allah made incumbent upon them: <<لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ>> (That you may clarify to the people what was sent down to them). And He said concerning the guidance that is success: <<لَيْسَ عَلَيْكَ هُدَاهُمْ>> (It is not upon you to guide them), meaning, it is not upon you to grant them success in accepting what I sent you with and commanded you to clarify, <<وَلَكِنَّ اللَّهَ يَهْدِي>> (But Allah guides), meaning, grants success to <<مَنْ يَشَاءُ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ>> (whomever He wills, and He is most knowing of the guided ones), meaning, those who are receptive to success, for He created them upon a specific disposition (مزاج خاص).\n\nThese guides are guides of clarification, not guides of success. The Guide who is Allah possesses both clarification and success. The guide who is a created being possesses only clarification.\n\nWe said this and cited this evidence because it is established among those who lack knowledge of realities that if the servant is truthful in what he conveys from Allah in his clarification, it will influence the souls of the listeners. This is not as they claim. For there is none closer to Allah, nor more truthful in conveying from Allah, nor more beloved in acceptance of what he brought from Allah, than the Messengers (may Allah’s prayers and peace be upon them). Yet, acceptance was not universal among the listeners. Rather, the truthful Messenger said in his conveyance: <<وَمَا يَزِيدُهُمْ دُعَائِي إِلَّا فِرَارًا>> (And my call only increases their flight). Since acceptance was not universal despite the certainty of this spiritual aspiration (himma), we knew that the aspiration has no effect whatsoever upon the one being called.\n\nThe acceptance that occurred among the listeners did not result from the effect of the aspiration of the caller (the conveyor). Rather, it was accepted because of the disposition (مزاج) that Allah bestowed upon him in his creation, which necessitates his acceptance of this and similar things. This specific disposition is known only to Allah who created them upon it, which is His saying: <<وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ>> (And He is most knowing of the guided ones).\n\nTherefore, do not say after this: If you attend the gathering of a reminder/caller to Allah and find no effect of his speech in you, that this is due to the lack of truthfulness of the reminder. No, rather the fault is from you, from your own essence, since Allah did not create you at that time upon acceptance. The fair-minded person looks at what this reminder/caller brought. If it is the Truth (Ḥaqq) and he does not accept it, he knows with certainty that the fault is with the listener, not the reminder. If he attends the gathering of another reminder, who brings the exact same remembrance, and it affects him, the listener says, out of his ignorance, \"This reminder is truthful, for his speech affected my heart.\" The fault is with you, and you do not know it.\n\nKnow that this influence did not occur because of your acceptance of the Truth, for it was the Truth in both reminders in reality. Rather, the influence occurred in this gathering and not the other due to a relationship (nisba) between you and this reminder, or between you and the time, which influenced you with this remembrance. The influence was not due to the reminder, since the remembrance was present before and had no effect on you. Rather, the suitability (المناسبة) that I clarified to you—whether temporal or the relationship between you and this reminder—was the cause. Perhaps it was influenced by your belief in him, while you had no belief in the other. Thus, nothing influenced you but yourself, or something similar.\n\nThis is why we said in the interpretation of Divine Guidance (الهداية الإلهية) that it is both success (التوفيق) and clarification (البيان). Our saying \"success\" means the agreement of the relationship between the listener and the reminder, not the clarification, for we assumed clarification occurred in both cases from the reminders, yet acceptance occurred in only one of the cases. Know this and realize it, and you will be rightly guided, God willing.\n\nThe least benefit in this issue is the safety of the reminder from your accusation of untruthfulness in his reminder and your rejection of the Truth. For the sound intellect is influenced by the Truth, no matter who brings it, even if it comes upon the tongue of a polytheist, an enemy of Allah, a liar against Allah, and one hated by Allah. But what he brought is the Truth, and the rational person accepts it because it is the Truth, not because of the vessel through which it appeared. By this, the seeker of the Truth is distinguished from others.\n\nThe origination of the form of the Tenth *Rak‘ah* of the Witr originated a man from the men of Allah called ‘Abd Rabbih (Servant of his Lord).\n\n### [Lordship is Contingent upon Two]\n\nKnow that Lordship (الربوبية) is a relative attribute (نعت إضافي). It is not held exclusively by one of the two correlatives (المتضايفين) apart from the other. It is contingent upon two. It is not necessary that they be distinct; they may be distinct, or they may not be distinct. A king (malik) without a kingdom (mulk) cannot exist in reality or estimation. A sovereign (malīk) without a king is likewise impossible. A Lord (Rabb) without an object of Lordship (marbūb) is not valid in existence or estimation. This is the case for all correlatives.\n\nThe relationship of the world to what the realities of some Divine Names grant is the relationship of correlatives from both sides. The world seeks those Divine Names, and those Divine Names seek the world, such as the Name Lord (al-Rabb), the Powerful (al-Qādir), the Creator (al-Khāliq), the Benefactor (al-Nāfi‘), the Harmful (al-Ḍārr), the Giver of Life (al-Muḥyī), the Giver of Death (al-Mumīt), the Dominant (al-Qāhir), the Honorer (al-Mu‘izz), and the Humiliator (al-Mudhill), and similar Names.\n\nThere are other Divine Names that do not seek the world, but from which the soul of the world finds spiritual relief (yastarwih) without specific detail, unlike the detailed Names we just mentioned. The Names of spiritual relief are like the Rich (al-Ghanī), the Mighty (al-‘Azīz), and the Holy (al-Quddūs), and similar Names.\n\nWe have not found any Names for Allah that specifically indicate His Essence (Dhāt) without implying an additional meaning beyond the Essence. For there is no Name except for one of two things: either what indicates an Act (which necessarily requires the world), or what indicates Transcendence (which provides spiritual relief from attributes of cosmic deficiency that the Real is exalted above). Allah has not granted us anything other than this.\n\nThere is no proper noun (ism ‘alam) that contains nothing but the quality of being a proper noun for Allah at all, unless it is in His Knowledge or what Allah has reserved in His Unseen (ghayb) and has not revealed to us. The reason for this is that He the Exalted only manifested His Names to us so that we might praise Him with them. It is impossible for there to be a proper noun among them at all, because proper nouns do not convey praise for the named entity. Rather, they are proper nouns for the meanings they indicate, and those meanings are what are used to praise the one whose ruling appeared in us through them—the one named by their meanings. The meanings are what are named by these verbal Names, such as the Knowing (al-‘Ālim) and the Powerful (al-Qādir), and the rest of the Names.\n\nTo Allah belong the Most Beautiful Names (الأسماء الحسنى), and these are only the meanings, not these words. For words are not characterized by beauty or ugliness except by dependence on the meanings they indicate. They have no consideration in terms of their essence, for they are nothing more than composed letters and a specific arrangement called convention (iṣṭilāḥ). Understand this.\n\nThe origination of the form of the Eleventh *Rak‘ah* of the Witr originated a man from the men of Allah called ‘Abd al-Fard (Servant of the Unique/Odd).\n\n### [That the Unique Quality is only understood by the Just Observer through understanding another matter]\n\nKnow that the unique quality (الفردية) is only rationally understood by the just observer through understanding another matter from which this entity, called unique (fard), is distinguished by an attribute that is not present in the entity from which it is distinguished. If it were present in it, it would not be valid for it to be distinguished by it, and the name *fard* would not apply to it.\n\nThat from which the unique entity is distinguished must be rationally understood, and it is none other than the even (al-shaf‘). The matter by which the unique entity is distinguished is resemblance to the Oneness (al-Aḥadiyya). The first of the unique numbers is three. Allah described as disbelievers those who said: <<إِنَّ اللَّهَ ثَالِثُ ثَلَاثَةٍ>> (Indeed, Allah is the third of three). If they had said the third of two, they would not have been disbelievers, for He the Exalted is the third of two, the fourth of three, the fifth of four, and so on, reaching whatever number it may. This is His saying: <<وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ>> (And He is with you wherever you are).\n\nWhoever is in his oneness (aḥadiyya), He the Exalted is the second of one. Whoever is in his twoness (tathniyya), He is the third of his twoness. Whoever is in his threeness (tathlīth), He the Exalted is the fourth of three, reaching whatever number it may. He is with the created beings wherever they are. The Creator does not separate from them, because the reliance of creation is upon the Name al-Khāliq (The Creator) with a sound reliance, without doubt. Even though this Name requires several meanings, it seeks them—meaning the Name al-Khāliq—by its Essence. Each meaning has an effect in the created being, not in the Creator. The Creator for these meanings is merely the Comprehender (al-Jāmi‘), and their effect is in the created being, not in Him.\n\nThe Real is not the fourth in the four, but He is the fifth in the four, because <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like Him). If He were the very fourth of the four, He would be like them. Every one of the four is the very fourth of the four, without specification. If this were the case, the One of the four would make the Real four by His existence, and the matter is not so. This is the case for every number. Whenever you hypothesize a number, make the Real the One who comes immediately after that number, for He necessarily encompasses it. The fifth of the four encompasses the four, but the four do not encompass Him. He makes them five, but they do not make Him five, for they are four unto themselves. This is the case for every number.\n\nThis is so that the number may be preserved for the counted objects, and preservation (al-ḥifẓ) belongs only to Allah. Allah is none other than the One (al-Waḥd). The One must always preserve what is below Him, whether even or odd. He makes the even odd (yūtir al-shaf‘) and makes the odd even (yashfa‘ al-witr). So it is said, \"the fourth of three\" and \"the fifth of four,\" but it is not said, \"the fifth of five\" or \"the fourth of four\" or \"the tenth of ten.\"\n\nThe philosophers say concerning uniqueness (al-fardiyya) that it is the odd number (al-witr) from three upwards, in every odd number, such as the fifth, the seventh, and the ninth. Between every two unique numbers is the station of evenness (shaf‘iyya), and between every two even numbers is the station of uniqueness. This is according to the philosophers.\n\nAccording to us, it is not so. For uniqueness belongs to the One who makes the odd number even, and to the One who makes the even number odd, which the philosophers consider unique. If it were not so, it would not be valid to say concerning the uniqueness of the Real that He is the fourth of three and the sixth of five, and less than that and more. He is unique in every relation. Sometimes He is unique by making the odd number even, and sometimes by making the even number odd. This is His saying: <<مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ>> (There is no secret counsel of three but that He is their fourth, nor of five but that He is their sixth). He only clarified His uniqueness by specific mention as the uniqueness of making the odd number even, which the philosophers do not accept in their terminology of uniqueness. Then He said generally: <<وَلَا أَدْنَى مِنْ ذَلِكَ وَلَا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ>> (Nor less than that nor more, but that He is with them), whether their number is odd or even.\n\nAllah is not one of their evenness nor one of their oddness. Rather, He is the Observer (al-Raqīb) and the Preserver (al-Ḥafīẓ) who <<مِنْ وَرَائِهِمْ مُحِيطٌ>> (encompasses them from behind). Whenever creation moves to the rank that the Real was in, the Real moves to the rank immediately following it. It is impossible for Him to remain in the rank He was in when creation moves to it.\n\nLook at this Divine secret, how subtle and how magnificent it is in Transcendence (al-Tanzīh), in which no participation is valid for creation with the Real. Creation always seeks to catch up with the Real, but is unable to do so because the Real moves away from that rank. This is why number is endless, for if it ended, creation would catch up with the Real, and that will never be. Creation is creation unto itself, and the Real is the Real unto Himself.\n\nAn example of this is a group of three in secret counsel gathered in a session. Allah is undoubtedly the fourth of that group. If their fourth is another person who comes and sits with them, the Real moves from the fourth rank, merely by the arrival of that man or person who made them four, to the fifth rank. If they prolong the sitting such that someone comes who makes the group five, the Real moves to the sixth rank. He becomes the sixth of five, meaning the sixth of this group, after He was the fifth of the group that the one person made five. Know this, for I have alerted you to a great knowledge for which you will thank me before Allah. I hope that Allah will benefit me through whoever learns from me what I have mentioned in this discourse concerning the knowledge of Allah, which you will not find in the preceding books of authors in this field.\n\nAll of this is a drop from a word of the Glorious Quran. We have nothing from Allah except the understanding of it from Allah, which is the Divine Revelation (al-Waḥy al-Ilāhī) that the Real preserved for us.\n\nThis which we have mentioned was the Witr of the Messenger of Allah (PBUH) from the night prayer. As for the completion of the twelve, that is the one called the Guardian (al-Muhaymin), who is outside the origination of the powerful Witr. He is the First One (الواحد الأول), and He is none other than Allah. He is the Originator (al-Munshi’), Glory and Exalted is He in His Grandeur, the One, the Unique (al-Aḥad), who <<لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ>> (has not begotten and has not been begotten, and there is none comparable to Him).\n\nThe man by whom the twelve is completed, just as the months are completed by Ramadan—which is only completed by a Name of His Names, Ramadan, the Mighty and Majestic—by Him everything is completed. The completion of the four is by the fifth, when Allah is the fifth of four, for He is the one who preserves their fourness for them. If one of their kind comes who makes them five, the fourness is gone, and Allah is the sixth of the five, preserving their fiveness for them, because He is the Preserver (al-Ḥafīẓ). Look at how astonishing this matter is.\n\nFrom this, the existing flight (al-firār al-mawjūd) and the transition from state to state are validated, for Allah transitions in the ranks of the numbers for the reason we mentioned.\n\nThe name of this man by whom Allah completed the twelve is ‘Abd Allāh (Servant of Allah). He is only named ‘Abd Allāh because Allah manifests to him through the reality of every Name of His Names. This is His saying: <<وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَى فَادْعُوهُ بِهَا>> (And to Allah belong the Most Beautiful Names, so invoke Him by them). If you invoke Him by one of them, He manifests, responding to you in the essence of that Name.\n\nThis is like the fasting of the month of Ramadan, for its fasting is obligatory among the twelve months. Every fast in the other eleven months is merely a resemblance to the fast of a day in the month of Ramadan, because it is supererogatory (nāfila). The obligatory fast is only Ramadan by the initial Divine obligation (al-wujūb al-ilāhī al-ibtidā’ī). We said \"initial\" because of the vow (nadhir) to fast, which Allah made obligatory upon you by your own imposition upon yourself, as a punishment for you, and so that He may reward you with the reward of the obligatory if you fulfill it.\n\nHowever, the difference between it and the initially obligatory is that the initially obligatory fast must be made up (qaḍā’) if the time of its obligation passes, even if you forgot it or were sick and unable to perform it. But the cosmic obligation (al-wājib al-kawnī) is not made up if its time passes. This is the difference between the Divine Obligation and the Cosmic Obligation.\n\nWhoever knows what we have mentioned concerning these twelve has attained Divine treasures, just as it was said concerning the Fātiḥa that Allah gave it specifically to His Prophet Muhammad (PBUH), excluding other Messengers, from a treasure of the treasures of the Throne (al-‘Arsh) that was not found in any revealed Book or scroll except specifically in the Quran. By this, it was named Quran, because it combined what was revealed in the Books and scrolls and what was not revealed. In it is everything in all the revealed Books, and in it is what was not revealed in any Book or scroll.\n\nIn this Station are the sciences of Loosing and Binding (al-Ḥall wa al-‘Aqd), the science of the lawful and the forbidden (al-Ḥalāl wa al-Ḥarām), the science of what gathers the disbeliever and the believer and creates harmony between them, the science of attaching animals to humans in the ruling of some legal judgments, the science related to the perfection of certain individuals, the science of sanctification (al-Taqdīs) and its causes and types, the science of Divine blessings and favors (al-Ālā’ wa al-Minan), the science of covenants and pledges, the science of the origination of the forms of bodily worship, the science of cosmic magnification (al-Ta‘ẓīm al-Kawnī), the science of Divine debts (al-Mudāyanāt al-Ilāhiyya), the science of Faith (al-Īmān), the science of the Substitutes (al-Abdāl), the science of the Divine Call (al-Nidā’ al-Ilāhī), the science of definition, the science of establishing proofs for claims, the science of the People of the Intervals (Aṣḥāb al-Fatarāt) and their ruling with Allah, the science of what pertains to the king and the common people, the science of deputation in the call, the science of rejection and acceptance, the science of delegation and submission (al-Tafwīḍ wa al-Taslīm) in souls, the science of veiling and returning things to their origins, the science of establishing the One in the place of the whole in any station, the science of agreement and disagreement, the science of the accountability of the compelled (al-Majbūr), the science of audition (al-Samā‘), the science of light and spiritual meaning and guidance, the science of parables, the science of following and followers, the science of testimonies, the science of the Return (al-Ma‘ād) and its ruling, the science of fear and caution, the science of homogeneity between things, the science of love and its nobility and the types of lovers, the science of casting off restraint in it, the science of specialization, the science of the abrogation of inner realities in general and specific terms, the science of likening the Real to creation (tashbīh al-Ḥaqq bi al-Khalq) and what is permissible of that and what is not, and its relation to hearing, in which the intellect has no entry by its own speculation, the science of gift and acquisition (al-Wahb wa al-Kasb), the science of what is incumbent upon the Messenger, the science of the ruling in Unity (al-Tawḥīd) for one who names Allah with a name other than His, the science of the degrees of misguidance and leading astray and the differences therein, the science of commanding the good and forbidding the evil, the science of the influence of creation upon the Real, the science of what caused the People of the Books wretchedness, the science of lifting hardship and the ranks of the pious, the science of choice, the science of the nobility of places over one another and what it returns to, the science of the control of the lower over the lower, the science of relating things to their origins, and the science of hinting at goodness.\n\n<<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "\"باب تین سو اناسی\" حل و عقد، اکرام و اہانت کے مقام کی معرفت میں، اور دعا کا خبر کی صورت میں پیدا ہونا، اور یہ مقام محمدی ہے۔\n\n> چاندی کے پیالے ہیں *** اور جوہر و عین کے\n>\n> انہیں لائے ہیں کرم والے *** جن پر پردے ہیں حفاظت کے\n>\n> جب وہ ہمارے سامنے ظاہر ہوئے *** تو ہم نے ہر رنگ سے کھایا\n>\n> ان میں سے کچھ علوم و نعت ہیں *** اور کچھ علومِ کائنات\n>\n> اور کچھ علومِ حال ہیں *** اور کچھ علومِ عین\n>\n> پس کوئی وصل کا قائل ہے *** اور کوئی جدائی کا قائل\n>\n> پاک ہے وہ ذات جو بلند ہے *** ہر عین کی تشبیہ کے ساتھ\n>\n> نہ اس کا وجود اس کے سوا ہے *** اور نہ اس کا وجود میرے وجود سے ہے۔\n\n### [اعداد میں سے بسیط اعداد کی انتہا بارہ (12) ہے]\n\nجان لو کہ بارہ (12) اعداد میں سے بسیط اعداد کی انتہا ہے، جو انگلیوں اور گرہوں پر مشتمل ہے۔ ان میں سے نو انگلیاں ہیں اور تین گرہیں، تو مجموعہ بارہ ہوا۔ اور ان بارہ میں سے ہر ایک کا ایک حکم ہے جو دوسرے کے لیے نہیں، اور ایک الٰہی مشہد ہے جو اس کے سوا کسی اور کے لیے نہیں ہے۔ اور اس عدد میں سے ہر ایک کے لیے اللہ کے بندوں میں سے ایک مرد ہے جو اس عدد کا حکم رکھتا ہے۔ پس واحد (الواحد) ان اعداد میں سے نہیں ہے، اور اسی لیے رسول اللہ صلی اللہ علیہ وسلم کا وتر گیارہ رکعت تھا، کیونکہ واحد (الواحد) اعداد میں سے نہیں ہے۔ اگر واحد اعداد میں سے ہوتا تو وتر ہونا سرے سے صحیح نہ ہوتا، نہ عدد میں اور نہ معدود میں۔\n\nپس رسول اللہ صلی اللہ علیہ وسلم کا وتر گیارہ رکعت تھا، ان میں سے ہر رکعت آپ کی امت کے ایک مرد کی نشأت ہے، جس کا قلب اس رکعت میں نبی صلی اللہ علیہ وسلم کے قلب کی صورت پر ہوتا ہے۔ اور جہاں تک بارہویں کا تعلق ہے، تو وہ گیارہ کو جامع ہے، اور وہ مرد جس کا مقام بارہ (12) ہے، وہ ظاہر اور باطن میں مکمل حق (الحق) ہے، وہ جانتا ہے اور نہیں بھی جانتا، اور وہ واحدِ اوّل (الواحد الأول) ہے۔ کیونکہ اعداد کی ابتدا دو سے ہوتی ہے، پس جب تم بارہ تک پہنچتے ہو تو درحقیقت تم اعداد میں سے گیارہ تک ہی پہنچتے ہو، کیونکہ واحدِ اوّل (الواحد الأول) ان میں سے نہیں ہے۔ اور بارہ کا وجود واحدِ اوّل کے بغیر صحیح نہیں ہو سکتا، باوجود اس کے کہ وہ اعداد میں سے نہیں ہے۔ اور اسی لیے اس کا یہ حکم ہے کہ وہ بارہ میں ہے مگر وہ بارہ نہیں ہے، جیسا کہ کہا جاتا ہے: \"تو تو ہے، تو تو نہیں ہے۔\"\n\nاور یہ بارہ (12) ہی وہ لوگ ہیں جو معارف کے ان خزانوں کو نکالتے ہیں جو عالم کی صورتوں میں پوشیدہ ہیں۔ پس عالم کے لیے عالم کی صورتوں کا علم ہے، اور ان (بارہ مردوں) کے لیے ان صورتوں کے اندر موجود چیزوں کا علم ہے، اور وہ خزانہ جو ان میں ہے، جسے وہ واحدِ اوّل (الواحد الأول) کے ذریعے نکالتے ہیں۔ پس وہ توحید اور عبادت کے بارے میں سب سے زیادہ جاننے والے ہیں۔ اور ان کے لیے اللہ کے ساتھ دائمی مناجات (المناجاۃ) ہے جو ذاتی ہے، اور جو اعداد کے لیے واحد (الواحد) کے استصحاب کی طرح مستصحب ہے، جیسا کہ اس کا فرمان ہے:\n**﴿وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ﴾** (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)۔\nیعنی واحد (الواحد) کے بغیر تمہارا کوئی معین وجود نہیں ہے۔ پس واحد کے ذریعے ہی اعداد کے اعیان ظاہر ہوتے ہیں، لہٰذا وہ ان کا مظہر اور ان کو بے نیاز کرنے والا ہے۔ پس الف (ہزار) اس کی صفت ہے، جب الف کے ذریعے واحد کی الفت اعداد کے مراتب کے ساتھ اس کے ظہور کے لیے واقع ہوئی، پس **﴿هُوَ الْأَوَّلُ وَالْآخِرُ﴾** (وہ ہی اوّل ہے اور آخر ہے)۔\n\nاور جب تم واحد کو خود اس سے ضرب دیتے ہو تو ضرب کے بعد خارج میں اس کے سوا کچھ ظاہر نہیں ہوتا، اور تم واحد کو جس چیز میں بھی ضرب دو، وہ چیز نہ دوگنی ہوتی ہے اور نہ بڑھتی ہے۔ کیونکہ تم نے جس واحد کو اس کثرت میں ضرب دیا ہے، تم نے اسے اس کی احدیت میں ضرب دیا ہے، اسی لیے اس میں کوئی اضافہ ظاہر نہیں ہوتا۔ کیونکہ واحد اپنے آپ میں اور جس میں اسے ضرب دیا جائے، زیادتی قبول نہیں کرتا، پس وہ دوگنا نہیں ہوتا۔ وہ جہاں بھی ہو واحد ہی رہتا ہے۔ پس تم کہتے ہو: ایک ضرب ایک لاکھ برابر ایک لاکھ، اور ایک ضرب دو برابر دو، اور ایک ضرب دس برابر دس۔ ضرب دیے گئے عدد میں اس کی طرف سے کوئی اضافہ نہیں ہوتا، کیونکہ واحد کا مقام اس سے بلند ہے کہ وہ کسی چیز میں حلول کرے یا کوئی چیز اس میں حلول کرے۔ اور اس سے کوئی فرق نہیں پڑتا کہ وہ صحیح عدد ہو یا کسر والا۔ پس واحد (الواحد) حقائق کو ان کی اصل حالت پر چھوڑ دیتا ہے، وہ اپنی ذات سے تبدیل نہیں ہوتیں، کیونکہ اگر وہ تبدیل ہوتیں تو واحد خود تبدیل ہو جاتا، اور حق (الحق) خود تبدیل ہو جاتا، اور حقائق کا تبدیل ہونا محال ہے۔ اور اس صورت میں سرے سے کوئی علم ثابت نہ ہوتا، نہ حق (الحق) کا اور نہ خلق کا۔ پس یہ ثابت ہوا کہ حقائق کبھی بھی پلٹتے نہیں، اور اسی لیے اس پر اعتماد کیا جاتا ہے جس پر اعتماد کیا جاتا ہے، اور جسے علم (العلم) کہا جاتا ہے۔\n\nاب ہم ان گیارہ مردوں میں سے ہر ایک کا ذکر کرتے ہیں جو رسول اللہ صلی اللہ علیہ وسلم کے وتر سے نشأت پذیر ہوئے، بلکہ یہ صورتیں شاید رسول اللہ صلی اللہ علیہ وسلم کو ظاہری صورت میں گیارہ رکعتوں کے ساتھ وتر پڑھنے والا بناتی ہیں۔ اور یہ صورتیں باطن میں آپ صلی اللہ علیہ وسلم سے ہیں، کیونکہ آپ اس وقت بھی نبی تھے جب آدم پانی اور مٹی کے درمیان تھے۔ پس آپ نے انہیں پیدا کیا جب یہ آپ کی صفت تھی۔ پھر جب آپ صلی اللہ علیہ وسلم اپنے جسم کے ساتھ ظاہر ہوئے تو آپ نے ان معنوی صورتوں کو اپنے ساتھ رکھا، پس انہوں نے رات کو آپ کے جسم کو غیب کی مناسبت کی وجہ سے قیام کروایا، اور آپ کے ظاہر پر گیارہ رکعتوں کے ساتھ حکم لگایا جن سے آپ وتر پڑھتے تھے۔ پس وہ آپ کا وتر تھیں، اور وہ آپ کے لیے حاکم بھی تھیں اور محکوم بھی۔ پس آپ صلی اللہ علیہ وسلم سے ہی وہ نشأت پذیر ہوئے، اور آپ صلی اللہ علیہ وسلم میں ہی وہ ظاہر ہوئے، اور آپ پر دو مختلف وجوہ سے حکم لگایا۔\n\nان میں سے پہلی رکعت کی صورت سے اللہ کے مردوں میں سے ایک مرد نشأت پذیر ہوا جسے صفت کے لحاظ سے عبد الکبیر (عبد الكبير) کہا جاتا ہے، اگرچہ یہ اس کا نام ہے۔ اور یہ ایک معقول روحانی نشأت ہے، جو جب مجسم ہوتی ہے تو ایک انسان کی صورت میں ہوتی ہے جس کی صفت وہی ہوتی ہے جس سے اسے پکارا جاتا ہے۔ اور اسی طرح ان بارہ کی ہر صورت ہے۔\n\n### [اسماء الٰہیہ میں فضیلت]\n\nاور جان لو کہ اسماء الٰہیہ میں فضیلت (المفاضلة) ایک اعلیٰ اور عظیم مثال ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم کے اس قول میں ہے جب مشرکین نے اپنے رجز میں کہا: \"ہبل بلند ہو، ہبل بلند ہو\" (أعل هبل أعل هبل)، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"کہو!\" تو انہوں نے عرض کیا: \"یا رسول اللہ! ہم کیا کہیں؟\" آپ نے فرمایا: \"کہو: اللہ بلند اور عظیم ہے\" (الله أعلى وأجل)۔\n\nاور وہ اس قدر کو تسلیم کرتے ہیں، کیونکہ وہ ہی کہنے والے ہیں: **﴿مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى﴾** (ہم ان کی عبادت صرف اس لیے کرتے ہیں تاکہ وہ ہمیں اللہ کے قریب کر دیں)۔ پس وہ ان کے نزدیک بلند اور عظیم ہے۔ اگر وہ رسول اللہ صلی اللہ علیہ وسلم کی اس بات میں تصدیق کرتے کہ آپ اس اللہ کی طرف سے رسول ہیں جس کے قریب ہونے کے لیے وہ ان معبودوں کی عبادت کرتے ہیں، تو انہوں نے انہیں معبود (آلہة) صرف اس لیے کہا کہ انہوں نے انہیں اپنے لیے معبود بنا لیا تھا، کیونکہ الٰہ (إله) معبود کو کہتے ہیں، اور آلہة (آلهة) عبادت کو۔ اور ایک قراءت میں ہے: **﴿وَيَذَرَكَ وَآلِهَتَكَ﴾** (اور وہ تجھے اور تیری عبادت کو چھوڑ دے)، اور جب وہ کہتے ہیں: **﴿وَآلِهَتَكَ﴾** (اور تیرے معبودوں کو)، تو اس کا مطلب ہے: \"اور وہ معبود جن کی ہم عبادت کرتے ہیں۔\" پس جب انہوں نے ان معبودوں کی طرف الوہیت کی نسبت کی جن کی وہ عبادت کرتے تھے، تو اللہ کی طرف اس کی نسبت ان کے اعتراف کے مطابق زیادہ مکمل اور عظیم تھی۔ اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے اس میں فضیلت (المفاضلة) کے صیغے کے ساتھ فرمایا، یعنی یہ تمہارا قول اور تمہارا عقیدہ ہے۔ اور اسی لیے نماز میں تکبیر میں لفظ \"اللہ اکبر\" فضیلت کے صیغے کے ساتھ آیا ہے، نہ اس لیے کہ پتھر افضل ہیں، نہ وہ جنہیں انہوں نے تراشا، اور نہ وہ جن کی طرف انہوں نے الوہیت کی نسبت کی، جیسے ستارہ وغیرہ۔ بلکہ فضیلت مناسبت میں واقع ہوئی ہے، نہ کہ اعیان میں، کیونکہ اعیان میں کوئی فضیلت نہیں ہے، کیونکہ بندے اور آقا کے درمیان، یا رب اور مربوب کے درمیان، یا خالق اور مخلوق کے درمیان کوئی فضیلت نہیں ہے۔\n\nپس اگر تم نے اس بات کو سمجھ لیا جس کی طرف ہم نے اس صورت کی نشأت میں اشارہ کیا ہے، تو تم جان لو گے کہ مشرک کا انجام مواخذے کے بعد کیا ہوتا ہے۔\n\nوتر کی دوسری رکعت کی صورت سے اللہ تعالیٰ کے مردوں میں سے ایک مرد نشأت پذیر ہوا جسے عبد المجيب (عبد المجيب) کہا جاتا ہے۔\n\n### [اجابت سوال کی شاخ ہے]\n\nاور جان لو کہ اجابت (الإجابة) سوال کی شاخ ہے۔ پس یہ عبد (بندہ) اپنے سوال اور دعا کے ذریعے اپنے آقا میں مؤثر ہے، اور آقا اپنے بندے کے لیے اجابت میں مؤثر ہے۔\n\nکیونکہ اللہ عزوجل نے اپنے رسول صلی اللہ علیہ وسلم کی زبان سے اپنے لیے یہ ثابت کیا ہے کہ بندہ اللہ کو راضی کرتا ہے تو وہ راضی ہوتا ہے، اور اللہ کو غضبناک کرتا ہے تو وہ غضبناک ہوتا ہے، اور اللہ کو ناراض کرتا ہے تو وہ ناراض ہوتا ہے، اور اللہ کو ہنساتا ہے تو وہ ہنستا ہے۔\n\nاور اسی طرح کی چیزیں جو کتاب و سنت میں وارد ہوئی ہیں۔ اور حق تعالیٰ بندے میں سوال کو مؤثر کرتا ہے تاکہ وہ جواب دے، اور اس فعل کو مؤثر کرتا ہے جو حق کو ناراض کرے تاکہ وہ ناراض ہو۔ اور یہ اس لیے ہے تاکہ تم جان لو کہ معاملہ دوری (چکر دار) اور کروی (گول) ہے، اور دائرے کی انتہا اپنے نقطہ آغاز کی طرف لوٹتی ہے، پس آخر اوّل پر پلٹتا ہے تاکہ وہ اوّل اور آخر ہو۔ پس اسے راضی کرنے والا اس کے سوا کوئی نہیں، اور اسے ناراض کرنے والا بھی اس کے سوا کوئی نہیں۔ کیونکہ وہ اس سے بلند ہے کہ اس کے سوا کوئی اور مؤثر ہو۔ پس سمجھ لو! اور اللہ کا عالم میں کوئی حکم نہیں ہے سوائے اس کے جو ہم نے ذکر کیا۔ کیا تم نہیں دیکھتے کہ وہ فرماتا ہے: **﴿سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ﴾** (عنقریب ہم تمہاری طرف متوجہ ہوں گے، اے دونوں بوجھو!)۔ اور اس کا ہمارے سوا کوئی شغل نہیں ہے۔ پس وہ ہم سے ہمارے لیے فارغ ہوتا ہے۔ اگر ہم زائل ہو جائیں تو وہ ہوتا، مگر وجوداً اور تقدیراً نہ ہوتا۔ اور معاملہ اسی طرح سمجھا جا سکتا ہے، ورنہ اضافات (الاضافات) باطل ہو جاتیں، اور وہ باطل نہیں ہوتیں کیونکہ وہ اپنی ذات کے لیے اضافات ہیں۔ پس رب کا تصور بغیر مضاف کے نہیں کیا جا سکتا۔ اور اسی لیے قرآن میں وہ کبھی بھی مطلقاً بغیر اضافت کے نہیں آیا، اگرچہ اس کی اضافات مختلف ہوتی ہیں۔ پس کبھی اسے ضمیر کے اسماء کی طرف مضاف کیا جاتا ہے، اور کبھی اعیان کی طرف، اور کبھی احوال کی طرف۔\n\nاگر تم اپنے رب کی معرفت کو اس طرح نہ سمجھو تو تم نے اپنے رب کو سرے سے پہچانا ہی نہیں۔ بلکہ تم نے صرف عقلی تقسیم کے ذریعے یہ جانا کہ واجب الوجود لذاتہ کا حکم یہ ہونا چاہیے، اور کیا وہاں واجب الوجود لذاتہ ہے یا نہیں؟ پس تم اسے اپنے ذریعے ہی جانتے ہو۔ اور جسے ہم نے تمہارے ذریعے ہی جانا ہے، تو اس کا علم لازماً تمہارے اپنے علم پر موقوف ہو گا۔ پس تمہارا وجود اس کے وجود پر موقوف ہے، اور تم پر اس کی ربوبیت کا علم تمہارے علم پر موقوف ہے۔ پس وجود میں اصل اس کے لیے ہے اور وجود میں فرع کا حکم تمہارے لیے ہے، اور علم میں اصل تمہارے لیے ہے اور علم میں فرع کا حکم اس کے لیے ہے۔\n\nوتر کی تیسری رکعت کی صورت سے اللہ کے مردوں میں سے ایک مرد نشأت پذیر ہوا جسے عبد الحمید (عبد الحميد) کہا جاتا ہے۔\n\n### [اللہ کی ثنا دو قسم کی ہے: مطلق اور مقید]\n\nجان لو کہ اللہ کی ثنا (الثناء) دو قسم کی ہے: مطلق (مطلق) اور مقید (مقید)۔ پس مطلق ثنا صرف عجز کے ساتھ ہی ہو سکتی ہے، جیسا کہ آپ صلی اللہ علیہ وسلم کا فرمان ہے:\n**«لا أحصي ثناء عليك أنت كما أثنيت على نفسك»** (میں آپ کی ثنا کا احاطہ نہیں کر سکتا، آپ ویسے ہی ہیں جیسے آپ نے خود اپنی ثنا کی ہے)۔\n\n> ان کے کہنے والے نے کہا: جب ہم آپ کی ثنا اچھی باتوں سے کرتے ہیں *** تو آپ ہی ہیں جن کی ہم ثنا کرتے ہیں اور اس سے بھی بلند ہیں جس کی ہم ثنا کرتے ہیں۔\n\nاور کسی مخلوق کے لیے یہ ممکن نہیں کہ وہ اس ثنا کا احاطہ کر سکے جو اللہ تعالیٰ کے لیے واجب ہے، کیونکہ تمام ممکنات کا وجود میں آنا ممکن نہیں ہے۔ اور ہر ممکن کے لیے اللہ کی طرف ایک خاص رُخ ہے، جس سے اللہ اسے وجود دیتا ہے، اور اسی سے وہ ممکن اسے جانتا ہے، اور اسی سے وہ اس کی ایسی ثنا کرتا ہے جسے اس رُخ کا مالک ہی جانتا ہے، اور کوئی دوسرا اسے نہیں جان سکتا، اور نہ وہ اسے لفظ یا اشارے سے بیان کر سکتا ہے۔ پس یہ ہر زبان سے اللہ کی مطلق ثنا ہے، جو کچھ تھا اور جو کچھ ہو گا۔ اور اسی لیے کہنے والے کے قول \"سبحان اللہ عدد خلقه\" (اللہ پاک ہے اپنی مخلوق کی تعداد کے برابر) کا ثواب ایسا ہے جس کا وجود میں واقع ہونا متصور نہیں، لیکن اس کا ثواب ہمیشہ، حال کے بعد حال، دوام کے ساتھ لا متناہی طور پر پیدا ہوتا رہتا ہے۔ اور اسی لیے شریعت میں اسے تین مرتبہ کہنے کا حکم آیا ہے، تاکہ اس سے محسوس ثواب، متخیل ثواب، اور معنوی ثواب حاصل ہو، پس وہ حِس، خیال اور عقل کے ذریعے نعمت پائے، جیسا کہ وہ حِس، خیال اور عقل کے ذریعے ذکر کرتا ہے، اور جیسا کہ وہ حِس، خیال اور عقل کے ذریعے عبادت کرتا ہے۔\n\nاور اسی طرح بندے کا الٰہی کلمات کی سیاہی (مداد الکلمات الإلهية) کا ذکر کرنا، اور اسی طرح اس کے عرش کے وزن کا ذکر کرنا، جب عرش اپنے محیط کے ساتھ پورا عالم ہو۔ اور اسی طرح اس کی رضا کا ذکر کرنا ان کاموں میں جو اہل جنت اور اہل جہنم کرتے ہیں، کیونکہ وہ جو کچھ کرتے ہیں اور جو تصرف کرتے ہیں وہ صرف الٰہی رضامندیوں میں ہی ہوتا ہے، کیونکہ وہ مقام انہیں یہ عطا کرتا ہے، برخلاف دنیا اور تکلیف کے مقام کے، جہاں وہ دنیا کے مقام میں ایسے تصرفات کرتے ہیں جو اللہ کو راضی بھی کرتے ہیں اور ناراض بھی۔ اور یہ اس لیے ہے کہ اللہ نے جہنم کو اس شخص کا گھر بنایا جس پر وہ ناراض ہوا، پس ضروری ہے کہ اس کے اہل دنیا کے گھر میں وہ کام کریں جو اللہ کو ناراض کرتے ہیں۔ لیکن جب وہ جہنم کے گھر میں سکونت اختیار کر لیتے ہیں اور اسے آباد کرتے ہیں، تو وہ صرف اللہ کی رضامندی میں ہی حرکت کر سکتے ہیں۔ اور اسی لیے ان کا انجام اس رحمت کی طرف ہو گا جو **﴿وَسِعَتْ كُلَّ شَيْءٍ﴾** (ہر چیز پر چھا گئی ہے)، اگرچہ وہ بدبختی کا گھر ہے۔ جیسا کہ ہم اس رسول کے بارے میں کہتے ہیں جس کی رسالت ختم ہو گئی اور وہ اس سے فارغ ہو کر اللہ کی طرف پلٹ گیا کہ وہ اللہ کا رسول ہے، اگرچہ اس حال میں وہ رسول نہیں ہوتا۔ اسی طرح ہم بدبختی کے گھر کے بارے میں کہتے ہیں کہ وہ بدبختی کا گھر ہے، اگرچہ اس میں رہنے والوں سے بدبختی زائل ہو چکی ہو۔\n\nاور جہاں تک مقید ثنا کا تعلق ہے، تو حکماء اسے صرف تنزیہ (التنزيه) کی صفت کے ساتھ مقید کرتے ہیں، اور اگر وہ فعل کی صفت کے ساتھ ثنا کرتے ہیں تو وہ کُل کے حکم سے یا اصالت کے حکم سے کرتے ہیں، کسی شخص کے لیے حکم نہیں لگاتے۔ اور حکماء کے علاوہ دوسرے لوگ ثنا کو صفتِ فعل اور صفتِ تنزیہ دونوں کے ساتھ مقید کرتے ہیں، اور یہ کامل لوگ ہیں، کیونکہ انہوں نے حکماء کے ساتھ اس علم میں شرکت کی جو وہ جانتے تھے، اور ان پر اس علم میں اضافہ کیا جسے حکماء نے جہالت کی وجہ سے نہیں جانا، کیونکہ ان کی ہمت میں اس شبہ کی وجہ سے کمی تھی جو ان کے لیے قائم ہوا اور ان پر یہ حکم لگایا کہ اللہ تعالیٰ سے صرف واحد (الواحد) ہی صادر ہوا ہے جس کی طرف اشارہ کیا گیا ہے، اور یہ کہ اللہ تعالیٰ پر وہ چیزیں جائز نہیں جو اس نے اپنی کتاب میں اپنی صفت بیان کی ہیں، کیونکہ ان کے نزدیک ان کی عقلی نظر میں کوئی نازل شدہ کتاب یا بھیجا گیا شخص اس طریقے پر ثابت نہیں ہوا جو حقیقت میں اور اہل کشف (الکشف) اور ایمان کے نزدیک ہے۔ اور بعض عقلی نظریہ رکھنے والے جیسے متکلمین وغیرہ جو عقلی نظر سے یہ کہتے ہیں، وہ اس سے پھر گئے۔\n\nاور ان نبوی وتر کی رکعتوں کی صورتوں کا حکم عالم میں اس وقت سے جاری ہے جب آپ صلی اللہ علیہ وسلم نبی تھے اور آدم پانی اور مٹی کے درمیان تھے، قیامت کے دن تک۔\n\nوتر کی چوتھی رکعت کی صورت سے اللہ کے مردوں میں سے ایک مرد نشأت پذیر ہوا جسے عبد الرحمن (عبد الرحمن) کہا جاتا ہے۔\n\n### [وہ الٰہی رحمت جو اللہ نے اپنے بندوں میں پیدا کی ہے، وہ ذاتی رحمت سے مخلوق ہے]\n\nجان لو کہ وہ الٰہی رحمت جو اللہ نے اپنے بندوں میں پیدا کی ہے تاکہ وہ اس کے ذریعے ایک دوسرے پر رحم کریں، وہ اس ذاتی رحمت (الرحمة الذاتية) سے مخلوق ہے جس کے ذریعے اللہ نے عالم کو وجود بخشا جب اس نے چاہا کہ وہ پہچانا جائے، اور اسی کے ذریعے اس نے **﴿كَتَبَ عَلَى نَفْسِهِ الرَّحْمَةَ﴾** (اپنے اوپر رحمت لکھ لی)۔ اور یہ لکھی ہوئی رحمت (الرحمة المكتوبة) ذاتی رحمت سے منفعل (متاثر) ہے۔ اور رحمتِ امتنان (الرحمة الامتنانية) ہی وہ ہے جو **﴿وَسِعَتْ كُلَّ شَيْءٍ﴾** (ہر چیز پر چھا گئی ہے)۔ پس کسی چیز کی اپنے لیے رحمت کو ذاتی رحمت مدد دیتی ہے اور اس کی طرف دیکھتی ہے، اور اسی میں ہر اس شخص کا شہود (الشہود) واقع ہوتا ہے جو اپنے آپ پر رحم کرنے والا ہے۔ کیونکہ اللہ نے اپنی صفت محبت اور اپنے محبوبوں سے ملاقات کے شدید شوق سے بیان کی ہے۔ پس وہ ان سے صرف اسی رحمت کے حکم سے ملا جس کا مشاہدہ اس رحمت کا مالک کرتا ہے، اور یہ وہ رحمت ہے جو اس نے اپنے اوپر لکھ لی ہے، اس کا ذاتی رحمت (الرحمة الذاتية) میں یا امتنان کی رحمت (الرحمة الامتنانية) میں کوئی مشہد نہیں ہے۔\n\nاور جہاں تک رحم کرنے والے کی اس شخص پر رحمت کا تعلق ہے جس نے اس کے ساتھ برا کیا، اور جو الٰہی انعام کے شمول اور جود کی وسعت کا تقاضا کرتا ہے، تو اس کا مشہد صرف رحمتِ امتنان (الرحمة الامتنانية) ہے، اور یہ وہ رحمت ہے جس کی امید ابلیس اور اس سے نیچے والے رکھتے ہیں۔ ان لوگوں کے لیے لکھی ہوئی رحمت (الرحمة المكتوبة) میں اور نہ ہی ذاتی رحمت (الرحمة الذاتية) میں کوئی مشہد ہے۔\n\nاور اسی وجہ سے اللہ (اللہ) اور رحمن (الرحمن) کا نام دوسرے اسماء کے مقابلے میں زیادہ اہم تھا، کیونکہ **﴿لِلَّهِ الْأَسْمَاءُ الْحُسْنَى﴾** (اللہ ہی کے لیے بہترین نام ہیں)۔ پس تمام اسماء اسمِ رحمن (الرحمن) اور اسمِ اللہ (اللہ) پر دلالت کرتے ہیں، لیکن اکثر لوگ نہیں جانتے۔ اور میں نے اہل اللہ میں سے کسی کو نہیں دیکھا جس نے رحمت کی اس تثلیث پر اس تقسیم کے ساتھ تنبیہ کی ہو، کیونکہ یہ ایک عجیب تقسیم ہے جیسا کہ یہ حقیقت میں ہے۔ پس ہم نے اسے صرف کشف (الکشف) سے جانا، اور میں نہیں جانتا کہ ہمارے ساتھیوں نے اس کے بیان کو کیوں چھوڑ دیا، حالانکہ میرا گمان ہے کہ اللہ نے ان پر بھی اس کا کشف کیا ہو گا۔\n\nاور جہاں تک نبوتوں کا تعلق ہے، تو تم جانتے ہو کہ وہ اس پر عین الیقین کے ساتھ مطلع ہوئے، اور ہم نے ان کے چراغ کے نور سے اسے جانا، کیونکہ اللہ نے ہمیں اتباعِ الٰہی (الاتباع الإلهي) اور اتباعِ نبوی (الاتباع النبوي) عطا فرمایا ہے۔\n\nپس اتباعِ الٰہی یہ ہے کہ اللہ کا فرمان ہے: **﴿وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ﴾** (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)۔ پس اللہ اس معیت میں بندے کی پیروی کرتا ہے جہاں کہیں بھی وہ ہو۔ پس ہم بھی اس کی پیروی کرتے ہیں جہاں وہ حکم کے ساتھ ظاہر ہوتا ہے۔ پس ہم منتظر رہتے ہیں یہاں تک کہ وہ کسی ایسے امر کے ساتھ ظاہر ہو جو وجود میں ایک خاص حکم عطا کرے، پس ہم اس میں اس کی پیروی کرتے ہیں، اور عام لوگوں میں اس کے خلاف ظاہر نہیں ہوتے، جیسے کہ ہم اس کی تعریف کرنے سے خاموش رہتے ہیں جب وہ کسی ایسی صورت میں تجلی (التجلی) کرتا ہے جس میں انکار کیا جاتا ہے، باوجود اس کے کہ ہم اسے جانتے ہیں۔ پس وہ تجلی میں مقدم ہے اور انکار کے حکم میں بھی۔ پس ہم خاموشی کے ذریعے اس کی پیروی کرتے ہیں، اگرچہ ہم نہ انکار کرتے ہیں اور نہ اقرار۔ پس یہ ہے اتباعِ الٰہی۔\n\nاور جہاں تک اتباعِ نبوی کا تعلق ہے جو اللہ نے ہمیں عطا فرمایا ہے، تو وہ اس کا فرمان ہے: **﴿لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ﴾** (بے شک تمہارے لیے رسول اللہ (صلی اللہ علیہ وسلم) میں بہترین نمونہ ہے)۔ پھر یہ کہ آپ نے ہماری پیروی کی اور ہماری اقتدا کی جب آپ نے جماعت کے ساتھ نماز پڑھی، تو اس میں کمزور، بیمار اور حاجت مند ہوتے تھے، پس آپ ان کی نماز کے مطابق نماز پڑھتے تھے۔ پس آپ صلی اللہ علیہ وسلم متبع (پیروی کرنے والے) بھی تھے اور متبوع (جس کی پیروی کی جائے) بھی۔\n\nپھر ہمیں حکم دیا گیا کہ جب ہم امام ہوں تو کمزوری کے سوا کسی کی نماز کے مطابق نماز نہ پڑھیں۔ پس ہم نے رحمن کی پیروی کی جیسا کہ ہم نے ذکر کیا، پس ہم تابع ہیں، اور ہم نے رحمن کی پیروی کی اس چیز میں جو ہماری حقائق (حقائق) احتیاج اور فاقہ سے عطا کرتی ہیں، پس وہ اس پر چلتا ہے جس پر ہم ہیں۔ پس ہم متبوع ہیں۔ پس دیکھو کہ سیادت کی حقائق بندوں میں کیا عطا کرتی ہیں، اور عبادت اور عبودیت کی حقائق سیادت میں کیا عطا کرتی ہیں۔ پس یہ مرد عالم میں اس صفت کا حامل ہے، اور اس چوتھی رکعت کے ذریعے چار الٰہی اسماء کے احکام، اور طبعی نشأت میں طبیعت کے احکام، اور ان تینوں رحموں والی تینوں مولدات میں عناصر کے احکام، اور حیوانی نشأت میں اخلاط کے احکام ظاہر ہوئے۔ پس اس مرد کے لیے ان سب پر مہیمنیت (غلبہ) ہے۔\n\nوتر کی پانچویں رکعت کی صورت سے اللہ کے مردوں میں سے ایک مرد نشأت پذیر ہوا جسے عبد المعطي (عبد المعطي) کہا جاتا ہے۔ پس کبھی اس کی عطا ہبہ (تحفہ) ہوتی ہے، تو وہ عبد الوہاب (عبد الوهاب) ہوتا ہے، اور کبھی اس کی عطا انعام ہوتی ہے، تو وہ عبد المنعم (عبد المنعم) ہوتا ہے، اور کبھی اس کی عطا کرم ہوتی ہے، تو وہ عبد الکریم (عبد الكريم) ہوتا ہے، اور کبھی اس کی عطا جود (سخاوت) ہوتی ہے، تو وہ عبد الجواد (عبد الجواد) ہوتا ہے، اور کبھی اس کی عطا سخاوت ہوتی ہے، تو وہ عبد المقیت (عبد المقيت) اور عبد السخی (عبد السخي) ہوتا ہے، اور کبھی اس کی عطا ایثار (إيثار) ہوتی ہے، تو وہ عبد الغنی (عبد الغني) ہوتا ہے۔\n\nاور یہ عطا سب سے زیادہ پوشیدہ عطا ہے اور تصور میں سب سے زیادہ مشکل ہے، بلکہ سب اس سے منع کرتے ہیں سوائے ہمارے۔ اور میں نے کسی کو نہیں دیکھا جس نے الٰہیات میں اس عطا کو ثابت کیا ہو، اور اسے صرف وہی ثابت کرتا ہے جو اس کے نام الغنی (الغني) کا معنی جانتا ہے۔ اور وہ یہ ہے کہ صحیح حدیث میں ثابت ہے کہ بندہ ایک ایسے مقام پر پہنچ جاتا ہے جہاں حق (الحق) اپنی ہویت (ذات) کے لحاظ سے اس کی تمام قوتیں بن جاتا ہے، جیسا کہ اس کے قول میں ہے:\n**«كنت سمعه وبصره ويده»** (میں اس کا کان، اس کی آنکھ اور اس کا ہاتھ بن جاتا ہوں)۔\nاور اس کے علاوہ اس کے اعضاء اور قوتیں، جیسا کہ حدیث میں ہے۔ اور وہ سبحانہ اپنی ذات کے لیے غنی (الغني) ہے، ایسا غناء (بے نیازی) جسے اس سے زائل کرنا ممکن نہیں۔ پس جب بندہ اس مقام پر قائم ہوتا ہے، تو اس نے اسے اپنے سے اور ہر چیز سے بے نیازی کی صفت عطا کر دی، کیونکہ اس کی ہویت (ذات) اس بندے کی قوتوں کے اعیان ہیں۔ اور یہ عطا کی تقسیم میں صرف ایثار (إيثار) کے لیے ہے، پس اس نے اپنے بندے کو وہ چیز عطا کر دی جو اس کی ہویت کے لیے ہے۔ اللہ تعالیٰ فرماتا ہے: **﴿وَيُؤْثِرُونَ عَلَى أَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ﴾** (اور وہ اپنے آپ پر دوسروں کو ترجیح دیتے ہیں، اگرچہ انہیں خود بھی شدید ضرورت ہو)۔ بلکہ انہیں شدید ضرورت ہوتی ہے۔\n\nاور چونکہ ایثار کی عطا ایک فضل ہے جو عطا کرنے والے پر لوٹتا ہے، اس لیے حق (الحق) صفتِ فضل کا زیادہ حقدار ہے۔ پس ایثار کی عطا حق کے حق میں زیادہ حقدار ہے اور بندے کے حق میں زیادہ مکمل ہے۔ اور یہ اسرار کے علوم میں سے ہے جس کی تعریف کو اس کے اہل کے لیے صرف اشارے سے ہی بیان کیا جا سکتا ہے، تاکہ وہ اس پر عمل کرنے کے لیے زیادہ بہادر ہوں، کیونکہ وہ اسے قبول کرنے سے بھی انتہائی خوف میں ہوتے ہیں، تو اس سے متصف ہونے کا کیا حال ہو گا! اور باقی اسماء کا معاملہ آسان ہے۔\n\nوتر کی چھٹی رکعت کی صورت سے اللہ کے مردوں میں سے ایک مرد نشأت پذیر ہوا جسے عبد المؤمن (عبد المؤمن) کہا جاتا ہے۔\n\n### [ایمان ایک الٰہی صفت ہے]\n\nجان لو کہ ایمان (الايمان) جب ایک الٰہی صفت (نعت إلهى) ہو، تو وہ تمام دلائل کا ظاہر ہونا ہے، اس دعویٰ کی صحت کے رُخ پر جو کوئی بھی دعویٰ کرنے والا کرے، کسی بھی حالت میں، اس شرط پر کہ وہ دلیل حقیقت میں دلیل ہو، جیسا کہ حِس اس کی گواہی دے اگر دلیل محسوس ہو۔ یہاں تک کہ اگر حاکم کے نفس میں اس دعویٰ کی سچائی کا علمِ ضروری (العلم الضروري) حاصل ہو جائے، تو وہ علمِ ضروری ہی اس دعویٰ کرنے والے کی سچائی پر دلیل ہو گا۔ پس ان دلائل کو قائم کرنے والا ہی اس دعویٰ کے مالک کی تصدیق کرنے والا ہے۔ پس جب اس کی تصدیق کرنے والے نے اس کی تصدیق کی، اور یہ علم اس شخص کے نفس میں حاصل ہو گیا جسے یہ حاصل ہوا، تو یہ اس شخص کے لیے جس کے پاس یہ دلیل حاصل ہوئی، اس دعویٰ کے مالک کی تصدیق کرنے والا بن گیا، اور تصدیق کونی (خلق میں) ہو گئی، جیسا کہ وہ حق (الحق) میں ہے۔ پس دعویٰ کا مالک دو تصدیق کرنے والوں کے درمیان محصور ہو گیا، وہ جس طرف بھی متوجہ ہو، اسے صرف وہی ملے گا جو اس کے دعویٰ میں لایا ہے، اس کی تصدیق کرنے والا۔ پس اس حال نے اسے اپنے نفس میں ان دونوں طرفوں سے تکذیب سے امان (الأمان) عطا کر دی، اگرچہ کائنات انکار کر دے، کیونکہ وہ اپنے نفس میں اس دعویٰ کرنے والے کی سچائی کا یقین رکھتا ہے، اور مراد صرف یہی ہے، یعنی اس کی سچائی کا علم حاصل ہونا۔\n\nپس اس رکعت کی صورت کے ذریعے تصدیق انسانوں اور جنوں کے عالم میں ان کے باطن میں سرایت کر گئی، اور یہ اس وقت ہوا جب یہ رکعت باطنی امر میں واقع ہوئی، جب آپ نبی تھے اور آدم پانی اور مٹی کے درمیان تھے۔ پس وہ ایک مجرد روح کی صورت میں ہر تصدیق کرنے والے میں سرایت کرتی رہی، یہاں تک کہ آپ صلی اللہ علیہ وسلم نے اسے اپنے جسم کی صورت میں رکوع کیا، تو وہ مجسم ہو گئی۔ اور وہ روح آپ کے فعل سے جسمانی صورت نہیں بنی، کیونکہ وہ محسوس حرکات سے تھی، پس ہمارے نزدیک اس کا فعل دونوں صورتوں کو جمع کرنے کے لیے زیادہ قوی تھا۔ جیسا کہ آپ صلی اللہ علیہ وسلم کا اثر آپ کے جسم کے ظہور کے ساتھ آپ کی بعثت میں زیادہ قوی تھا، اس سے جب آپ نبی تھے اور آدم پانی اور مٹی کے درمیان تھے۔ کیونکہ آپ کی بعثت کی صورت نے تمام شریعتوں کو منسوخ کر دیا، اور کسی شریعت کا کوئی حکم باقی نہیں رہا سوائے اس کے جو آپ نے باقی رکھا، اس حیثیت سے کہ وہ آپ کے لیے شریعت ہے، نہ صرف اس حیثیت سے کہ وہ شریعت ہے۔\n\nوتر کی ساتویں رکعت کی صورت سے اللہ کے مردوں میں سے ایک مرد نشأت پذیر ہوا جسے عبد الرحیم (عبد الرحيم) کہا جاتا ہے۔\n\nجان لو کہ رحمت (الرحمة) اس شخص کے حق میں جو اس کے حکم کو ظاہر کرنے پر قادر نہ ہو، دردناک عذاب (عذاب أليم) بن جاتی ہے، کیونکہ وہ اپنی ذات سے مرحوم (جس پر رحم کیا جائے) کی طرف تجاوز اور اس میں اپنے اثر کو بالفعل ظاہر کرنے کا تقاضا کرتی ہے۔ پس جب وہ اس شخص میں قائم ہو جو مرحوم میں اسے نافذ کرنے پر قادر ہو، تو اس کا ایک اثر رحم کرنے والے میں ہوتا ہے، اور وہ یہ ہے کہ اس سے وہ درد زائل ہو جاتا ہے جو مرحوم میں اس کے اثر کے حصول سے ہوتا ہے۔ پس رحم کرنے والا اس کے ذریعے مرحوم ہوتا ہے، اس حیثیت سے کہ وہ اسے نافذ کرنے پر قادر ہے۔ اور جس میں وہ نافذ ہوئی وہ بھی اس کے ذریعے اور رحم کرنے والے کی اسے نافذ کرنے کی قدرت کے ذریعے مرحوم ہوتا ہے۔ پس اس کا اثر اس میں دو وجوہ سے ہوتا ہے۔ اور اثر اس چیز کو زائل کرنا ہے جس نے رحم کرنے والے کو اس مرحوم سے رحمت کے تعلق کی طرف لے جایا۔\n\nپس ہر رحمت نعمت نہیں ہوتی، مگر جب رحم کرنے والا اسے نافذ کرنے پر قادر ہو۔ پس رحمت کی تجلی (التجلی) عذاب کی صورت میں ہوتی ہے اس رحم کرنے والے کے حق میں جس سے اقتدار کی نفی کر دی گئی ہو، اور اس کی تجلی نعمت کی صورت میں ہوتی ہے رحم کرنے والے اور مرحوم دونوں کے حق میں، اگر وہ اسے نافذ کرنے پر قادر ہو۔ پس اس نے دو متقابل صورتوں کو پلٹ دیا۔ اور یہ سب سے زیادہ عجیب امور میں سے ہے کہ رحمت درد اور عذاب پیدا کرتی ہے۔ اگر رحمت اس میں قائم نہ ہوتی تو وہ اس درد سے متصف نہ ہوتا جو اس شخص کو ہوتا ہے جسے اقتدار حاصل نہ ہو۔\n\nپھر اس مسئلے میں جو سب سے زیادہ عجیب ہے وہ یہ ہے کہ وہ رحمت جو نفاذِ اقتدار کی صفت سے متصف شخص میں قائم ہو، اسے اپنی ذات کی طرف سے اسے نافذ کرنے میں کوئی رکاوٹ ہو سکتی ہے، تو اس میں کراہت کا درد پیدا ہوتا ہے، اور یہ اس رکاوٹ کا حکم ہے، باوجود اس کے کہ وہ اسے نافذ کرنے کی قدرت سے متصف ہے۔ اور یہ مسئلہ علمِ الٰہی (العلم الإلهي) کے مشکل ترین مسائل میں سے ہے۔ اور اس کا حکم صحیح الٰہی اخبار میں اس کی ذات عزوجل کے بارے میں ظاہر ہوا ہے:\n**«ما ترددت في شي‏ء أنا فاعله ترددي في قبض نسمة المؤمن يكره الموت وأنا أكره مساءته ولا بد له من لقائي»** (میں نے کسی ایسے کام میں تردد (حیرت) نہیں کیا جسے میں کرنے والا ہوں، جتنا کہ مومن کی روح قبض کرنے میں تردد کرتا ہوں، وہ موت کو ناپسند کرتا ہے اور میں اسے تکلیف دینا ناپسند کرتا ہوں، حالانکہ اسے مجھ سے ملنا ضروری ہے)۔\n\nاور وہ ہی ہے جس نے اسے موت کو ناپسند کرنے والا بنایا، اور اس بات پر دلالت کی کہ اس کی ملاقات صرف موت کے ذریعے ہی ہو سکتی ہے، اور وہ مطلق حِس سے مشترک حِس کی طرف نکل جانا ہے، جیسا کہ تم اسے نیند میں دیکھتے ہو، کیونکہ نیند موت کی ایک قسم ہے، کیونکہ یہ وفات ہے اور عالمِ حِس سے عالمِ خیال اور مشترک حِس کی طرف انتقال ہے۔ پس سونے والا اپنے رب کو اپنی نیند میں دیکھتا ہے، جیسا کہ میت اپنی موت کے بعد دیکھتا ہے، مگر میت کی رؤیت اور اس کے رب سے ملاقات کے بعد اس سے کوئی واپسی نہیں ہوتی، اور سونے والا بیدار ہو کر مقررہ مدت کی طرف بھیجا جاتا ہے۔ پس اگر ملاقات فنا (الفناء) کے ذریعے ہو، نہ کہ نیند کے ذریعے، پھر اسے بقا (البقاء) کی حالت کی طرف لوٹا دیا جائے، تو اس کا حکم قیامت کے دن اٹھائے جانے والے میت کا سا ہو گا، اس پر اس سے کوئی حجاب واقع نہیں ہو گا۔ پس یہ سونے والے اور فانی (الفانی) کے درمیان فرق ہے۔\n\nاور اسی لیے عمرو بن عثمان مکی نے عارفین کی صفت میں کہا: \"وہ آج جیسے ہیں، کل بھی ویسے ہی ہوں گے، ان شاء اللہ تعالیٰ۔\"\n\nپس اس نے رحمت کے حکم سے زیادہ عجیب کوئی چیز نہیں دیکھی۔ کیا تم نہیں دیکھتے کہ طبیب کو آکلہ (زخم) والے مریض پر رحمت آتی ہے، اور وہ اسے نافذ کرنے پر قادر نہیں ہوتا مگر اسے تکلیف پہنچا کر؟ پس اس طبیب کی اس مریض پر رحمت کی مقدار کے مطابق، اسے اپنے نفس میں درد ہوتا ہے، کیونکہ وہ اسے تکلیف پہنچائے بغیر نافذ نہیں کر سکتا۔ اگر اسے اس پر رحمت نہ ہوتی تو اسے درد نہ ہوتا۔ کیا تم نہیں دیکھتے کہ شفا پانے والا کیسے درد محسوس نہیں کرتا، بلکہ لذت محسوس کرتا ہے؟ پس اس پر غور کرو جو میں نے تمہیں علمِ الٰہی میں ذکر کیا۔\n\nاور میں نے اسے صحیح کشف (الکشف) اور صریح مشہد میں دیکھا، اور رسول اللہ صلی اللہ علیہ وسلم میرے ساتھ تھے۔ اور اللہ تعالیٰ نے دجال کو اس کے الوہیت کے دعوے کی وجہ سے قتل کرنے کا حکم دیا، اور آپ رو رہے تھے اور اس کی طرف سے اس سزا کے بارے میں عذر پیش کر رہے تھے جو اسے اس کی وجہ سے دی جائے گی، اور یہ کہ اس کے ہاتھ میں اس بارے میں کچھ نہیں ہے۔ پس آپ کا رونا اس رحم کرنے والے کے نفس میں درد کی طرح ہے جسے رکاوٹ کی وجہ سے اپنی رحمت کو نافذ کرنے کا اقتدار حاصل نہ ہو۔ پس علمِ الٰہی میں اس حیرت سے بڑی کوئی حیرت نہیں، اور اگر یہ اتنی عظیم نہ ہوتی تو حق (الحق) خود کو تردد (التردد) سے متصف نہ کرتا، اور تردد حیرت ہے۔ پس سمجھ لو!\n\nوتر کی آٹھویں رکعت کی صورت سے اللہ تعالیٰ کے مردوں میں سے ایک مرد نشأت پذیر ہوا جسے عبد الملک (عبد الملك) کہا جاتا ہے۔\n\n### [مخلوق مطلقاً بادشاہ ہے اور حق بادشاہت کا بادشاہ ہے]\n\nجان لو کہ ملک (الملك) وہ ہے جس نے اس حقیقت کو پیدا کیا جسے ملک (بادشاہت) کہا جاتا ہے۔ پس جب بندہ اس سے موسوم ہوتا ہے، اور حق (الحق) ملک (بادشاہت) سے متصف ہوتا ہے، تو وہ مخلوق کی طرح متصف نہیں ہوتا۔ کیونکہ مخلوق مطلقاً بادشاہ (ملك) ہے، اور حق (الحق) ملک الملک (بادشاہت کا بادشاہ) ہے، مطلقاً بادشاہ نہیں۔ کیونکہ بندے کے لیے بادشاہ ہونا تب تک نہیں ہوتا جب تک بندے کے پاس اس کی عبودیت (العبودية) ظاہر نہ ہو، اور اس کے پاس اس کا اپنے بادشاہ (ملیک) یعنی اللہ تعالیٰ کا بادشاہ ہونا ظاہر نہ ہو۔\n\nاور ہم نے یہ اس گروہ کی وجہ سے کہا جسے ان کی نظر نے اللہ کی طرف یہ عطا کیا کہ اللہ جزو کو متعین طور پر نہیں جانتا، بلکہ صرف کُل کو جانتا ہے جو جزو کو شامل کرتا ہے، برخلاف اہل حق، اہل کشف (الکشف) اور وجود کے۔ اور اسی لیے اس کے لیے اسم الملک (الملك) اور الملیک (المليك) ہے، یعنی یہ صفت شدت کی وجہ سے ظاہر ہوئی، کیونکہ اس عقلی نظر کے حامل لوگ اسے ثابت نہیں کرتے۔ پس جب عقلیں اس پر متفق نہ ہوئیں تو اس میں تنازع واقع ہوا، پس حق نے اسے شدت کے ساتھ بادشاہ (ملك) کے طور پر منتخب کیا، اور عارف بندے نے حق کو شدت کے ساتھ اپنا بادشاہ منتخب کیا، تنازع کرنے والے کی وجہ سے۔ پس اس نے اسے ملک الملک (ملك الملك) نام دیا تاکہ اس کے اور مخلوق کے اللہ کے لیے بادشاہ ہونے کے درمیان فرق کرے، پس مخلوق اللہ کے لیے بادشاہ ہونے میں اللہ کے لیے عبودیت (العبودية) سے متصف ہوتی ہے، اور حق ملک الملک سے متصف ہوتا ہے، اور وہ اس کے لیے عبودیت سے متصف نہیں ہوتا، اگرچہ حق میں خلق کی طرف سے تاثیر ہوتی ہے جیسا کہ پہلے بیان ہوا، اس کے باوجود وہ عبودیت سے متصف نہیں ہوتا، کیونکہ یہ ذلت کی وجہ سے نہیں ہے، کیونکہ وہ تعالیٰ اس تاثیر میں اصل ہے۔ پس اس پر وہی لوٹا جو اس کی طرف سے تھا، برخلاف خلق کے، کیونکہ مخلوق پر وہ لوٹتا ہے جو اس کی طرف سے تھا، اور اس میں وہ قائم ہوتا ہے جو اس کی طرف سے نہیں تھا، حق کی طرف سے ابتدا کے ساتھ۔ پس یہ جان لو!\n\nوتر کی نویں رکعت کی صورت سے اللہ کے مردوں میں سے ایک مرد کی صورت نشأت پذیر ہوئی جسے عبد الہادی (عبد الهادي) کہا جاتا ہے۔\n\nجان لو کہ ہدایت (الهداية) ایک الٰہی اثر ہے، جیسا کہ اس کے قول میں ہے: **﴿مَنْ يُضْلِلِ اللَّهُ فَلَا هَادِيَ لَهُ﴾** (جسے اللہ گمراہ کر دے تو اس کے لیے کوئی ہدایت دینے والا نہیں)، اور ایک کونی اثر ہے، جیسا کہ اس کے قول میں ہے: **﴿وَلِكُلِّ قَوْمٍ هَادٍ﴾** (اور ہر قوم کے لیے ایک ہادی (رہنما) ہے)۔ اور اس کا معنی پہلے کی طرف لوٹتا ہے، کیونکہ ہادیِ کونی (الھادی الکونی) اللہ کی طرف سے رسول ہی ہوتا ہے۔ پس وہ مبلغ ہے، نہ کہ ہادی بمعنی توفیق دینے والا، بلکہ وہ ہادی بمعنی بیان کرنے والا ہے۔ اللہ تعالیٰ نے ان کے لیے بیان کے بارے میں اور اس تبیان کے بارے میں جو اللہ نے ان پر واجب کیا، فرمایا: **﴿لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ﴾** (تاکہ تم لوگوں کے لیے وہ بیان کر دو جو ان کی طرف نازل کیا گیا ہے)۔ اور اس ہدایت کے بارے میں جو توفیق ہے، فرمایا: **﴿لَيْسَ عَلَيْكَ هُدَاهُمْ﴾** (ان کی ہدایت آپ کے ذمے نہیں ہے)، یعنی آپ کے ذمے یہ نہیں کہ آپ انہیں اس چیز کو قبول کرنے کی توفیق دیں جس کے ساتھ میں نے آپ کو بھیجا اور آپ کو اس کے بیان کا حکم دیا، **﴿وَلَكِنَّ اللَّهَ يَهْدِي﴾** (بلکہ اللہ ہدایت دیتا ہے)، یعنی توفیق دیتا ہے، **﴿مَنْ يَشَاءُ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ﴾** (جسے چاہتا ہے، اور وہ ہدایت پانے والوں کو خوب جانتا ہے)، یعنی قبول کرنے والوں کو، کیونکہ اس نے انہیں ایک خاص مزاج پر پیدا کیا ہے۔\n\nپس یہ ہادی (رہنما) بیان کے ہادی ہیں، نہ کہ توفیق کے ہادی۔ اور ہادی جو اللہ ہے، اس کے لیے بیان اور توفیق دونوں ہیں، اور ہادی جو مخلوق ہے، اس کے لیے صرف بیان ہے۔\n\nاور ہم نے یہ اس لیے کہا اور اس پر گواہی دی جس پر ہم نے گواہی دی، کیونکہ ان لوگوں کے نزدیک جنہیں حقائق کا علم نہیں، یہ بات مقرر ہے کہ جب بندہ اس چیز میں سچا ہو جو وہ اللہ کی طرف سے بیان کرتا ہے، تو وہ سننے والوں کے نفوس میں اثر کرتا ہے، اور یہ ویسا نہیں جیسا انہوں نے گمان کیا۔ کیونکہ اللہ اور اللہ سے قریب تر، اور اللہ کی طرف سے تبلیغ میں زیادہ سچا، اور اللہ کی طرف سے لائی گئی چیز کو قبول کرنے میں زیادہ محبوب، رسولوں (صلوات اللہ علیہم وسلامہ) سے بڑھ کر کوئی نہیں۔ اس کے باوجود قبولیت سننے والوں میں عام نہیں ہوئی۔ بلکہ سچے مبلغ رسول نے کہا: **﴿وَمَا يَزِيدُهُمْ دُعَائِي إِلَّا فِرَارًا﴾** (اور میری پکار ان کے فرار میں ہی اضافہ کرتی ہے)۔ پس جب یہ ہمت کے باوجود عام نہیں ہوئی، تو ہم نے جان لیا کہ ہمت کا مدعو (جسے پکارا جائے) میں سرے سے کوئی اثر نہیں ہے۔ اور سننے والوں میں سے جس نے قبول کیا، اس نے داعی (پکارنے والے) جو مبلغ ہے، کی ہمت کے اثر سے قبول نہیں کیا، بلکہ اس نے اس مزاج کی وجہ سے قبول کیا جو اللہ نے اسے اس کی تخلیق میں عطا کیا ہے، جو اس اور اس جیسی چیزوں کو قبول کرنے کا تقاضا کرتا ہے۔ اور اس خاص مزاج کو صرف اللہ ہی جانتا ہے جس نے انہیں اس پر پیدا کیا، اور یہ اس کا فرمان ہے: **﴿وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ﴾** (اور وہ ہدایت پانے والوں کو خوب جانتا ہے)۔\n\nپس اس کے بعد یہ نہ کہو کہ جب تم کسی نصیحت کرنے والے داعی الی اللہ کی مجلس میں حاضر ہوئے اور تمہیں اس کی بات کا کوئی اثر اپنے اندر نہ ملا، تو یہ نصیحت کرنے والے کی عدمِ سچائی کی وجہ سے ہے۔ نہیں، بلکہ یہ عیب تمہاری اپنی ذات سے ہے، جہاں اللہ نے تمہیں اس وقت قبولیت پر فطرت نہیں دی۔ کیونکہ انصاف پسند شخص اس چیز کو دیکھتا ہے جو یہ داعیِ نصیحت کرنے والا لایا ہے، پس اگر وہ حق ہو اور اس نے اسے قبول نہ کیا ہو، تو وہ یقین کے ساتھ جانتا ہے کہ عیب سننے والے میں ہے، نہ کہ نصیحت کرنے والے میں۔ پس اگر وہ کسی دوسرے نصیحت کرنے والے کی مجلس میں حاضر ہوا اور وہ وہی ذکر لایا، اور اس نے اس میں اثر کیا، تو سننے والا اپنی جہالت کی وجہ سے کہتا ہے: \"یہ نصیحت کرنے والا سچا ہے، کیونکہ اس کی بات نے میرے دل میں اثر کیا ہے۔\" حالانکہ عیب تم میں ہے اور تم نہیں جانتے۔ پس جان لو کہ وہ تاثیر حق کو قبول کرنے کی وجہ سے نہیں تھی، کیونکہ وہ دونوں نصیحت کرنے والوں میں حقیقت میں حق تھا۔ بلکہ تم میں اس مجلس میں تاثیر اس مجلس کے علاوہ اس لیے واقع ہوئی کہ تمہارے اور اس نصیحت کرنے والے کے درمیان کوئی نسبت تھی، یا تمہارے اور وقت کے درمیان، پس اس ذکر نے تم میں اثر کیا، اور اثر نصیحت کرنے والے کے لیے نہیں تھا، کیونکہ ذکر تو تھا مگر اس کا تم میں کوئی اثر نہیں ہوا تھا۔ بلکہ اس مناسبت نے اثر کیا جو میں نے تمہارے لیے بیان کی، جو زمانی تھی، یا وہ نسبت جو تمہارے اور اس نصیحت کرنے والے کے درمیان تھی۔ اور شاید اس نے تمہارے اس پر اعتقاد کی وجہ سے اثر کیا، اور تمہارا اس دوسرے پر اعتقاد نہیں تھا، پس تمہارے سوا کسی اور نے تم میں اثر نہیں کیا، یا اس سے ملتی جلتی کوئی چیز۔\n\nاور اسی لیے ہم نے الٰہی ہدایت کی تفسیر توفیق (التوفیق) اور بیان (البیان) سے کی۔ پس ہمارا قول \"توفیق سے\" یعنی سننے والے اور نصیحت کرنے والے کے درمیان نسبت کی موافقت سے، نہ کہ بیان سے، کیونکہ ہم نے بیان کو دونوں نصیحت کرنے والوں میں واقع فرض کیا، اور قبولیت صرف ایک حالت میں واقع ہوئی۔ پس یہ جان لو اور اسے سمجھ لو، تو تم ہدایت پاؤ گے، ان شاء اللہ۔ اور اس مسئلے میں کم از کم فائدہ یہ ہے کہ نصیحت کرنے والا تمہاری طرف سے اس پر عدمِ سچائی کی تہمت سے محفوظ رہے گا، اور تمہارے حق کو رد کرنے سے محفوظ رہے گا۔ کیونکہ سلیم العقل شخص میں حق اثر کرتا ہے، خواہ وہ جس کے ہاتھ پر بھی آئے، اگرچہ وہ اللہ کے ساتھ شرک کرنے والے، اللہ کے دشمن، اللہ پر جھوٹ بولنے والے، اللہ کے نزدیک ناپسندیدہ شخص کی زبان پر ہی کیوں نہ آئے۔ لیکن جو کچھ وہ لایا ہے وہ حق ہے، پس عاقل اسے اس حیثیت سے قبول کرتا ہے کہ وہ حق ہے، نہ کہ اس محل کی حیثیت سے جس میں وہ ظاہر ہوا۔ اور اسی سے حق کے طالب اور غیر طالب میں فرق ہوتا ہے۔\n\nوتر کی دسویں رکعت کی صورت سے اللہ کے مردوں میں سے ایک مرد نشأت پذیر ہوا جسے عبد ربہ (عبد ربه) کہا جاتا ہے۔\n\n### [ربوبیت دو پر موقوف ہے]\n\nجان لو کہ ربوبیت (الربوبية) ایک اضافی صفت (نعت إضافي) ہے، جو دو متضائفین (باہمی تعلق رکھنے والے) میں سے کسی ایک کے بغیر منفرد نہیں ہو سکتی۔ پس وہ دو پر موقوف ہے، اور یہ ضروری نہیں کہ وہ دونوں متباین (مختلف) نہ ہوں۔ پس وہ متباین بھی ہو سکتے ہیں اور غیر متباین بھی۔ پس بادشاہت کے بغیر بادشاہ کا وجوداً اور تقدیراً وجود نہیں ہو سکتا، اور بادشاہ کے بغیر بادشاہت کا بھی ایسا ہی ہے۔ اور مربوب کے بغیر رب کا وجوداً اور تقدیراً صحیح نہیں ہو سکتا۔ اور اسی طرح ہر دو متضائفین۔\n\nپس عالم کی نسبت بعض الٰہی اسماء کی حقائق کے تقاضوں کی طرف، دو طرفوں سے متضائفین کی نسبت ہے۔ پس عالم ان الٰہی اسماء کا طالب ہے، اور وہ الٰہی اسماء عالم کی طالب ہیں، جیسے اسم الرب (الرب)، القادر (القادر)، الخالق (الخالق)، النافع (النافع)، الضار (الضار)، المحيي (المحيي)، المميت (المميت)، القاهر (القاهر)، المعز (المعز)، المذل (المذل)، اور اسی طرح کے اسماء۔\n\nاور کچھ الٰہی اسماء ایسے ہیں جو عالم کے طالب نہیں ہیں، لیکن عالم کے نفوس میں سے ایک نفس ان سے راحت پاتا ہے، بغیر تفصیل کے، جیسا کہ ہم نے ابھی ذکر کیے گئے اسماء میں تفصیل کی۔ پس استرواح (روحانی راحت) کے اسماء جیسے الغنی (الغني)، العزیز (العزيز)، اور القدوس (القدوس) اور اسی طرح کے اسماء ہیں۔\n\nاور ہم نے اللہ کے لیے ایسے اسماء نہیں پائے جو صرف اس کی ذات پر دلالت کریں، بغیر ذات پر زائد معنی کے تصور کے۔ کیونکہ وہاں کوئی اسم نہیں ہے مگر وہ دو میں سے ایک پر دلالت کرتا ہے: یا تو وہ فعل پر دلالت کرتا ہے، اور وہ لازماً عالم کا متقاضی ہے، یا وہ تنزیہ (التنزيه) پر دلالت کرتا ہے، اور وہ وہ ہے جس سے کونی نقص کی صفات سے راحت ملتی ہے جن سے حق (الحق) پاک ہے۔ اس کے علاوہ اللہ نے ہمیں کچھ نہیں دیا۔ پس وہاں کوئی اسمِ علم نہیں ہے جس میں صرف علمیت ہو، سوائے اللہ کے لیے، مگر یہ کہ وہ اس کے علم میں ہو، یا وہ جو اللہ نے اپنے غیب میں اپنے لیے مخصوص کر رکھا ہو جسے اس نے ہم پر ظاہر نہیں کیا۔\n\nاور اس کی وجہ یہ ہے کہ اس نے اپنے اسماء ہم پر صرف اس لیے ظاہر کیے ہیں تاکہ ہم ان کے ذریعے اس کی ثنا کریں۔ پس یہ محال ہے کہ ان میں کوئی اسمِ علمی (اسم علم) ہو، کیونکہ اسمائے اَعلام سے مسمیٰ کی ثنا نہیں ہوتی، بلکہ وہ ان معانی کے لیے اسمائے اَعلام ہوتے ہیں جن پر وہ دلالت کرتے ہیں، اور وہ معانی ہی ہیں جن کے ذریعے اس کی ثنا کی جاتی ہے جس کا حکم ہم پر ان کے ذریعے ظاہر ہوا، اور وہ ان کے معانی سے موسوم ہے۔ اور معانی ہی ان لفظی اسماء سے موسوم ہیں، جیسے العالم (العالم) اور القادر (القادر) اور باقی اسماء۔ پس اللہ ہی کے لیے اسماء الحسنیٰ (الأسماء الحسنى) ہیں، اور وہ صرف معانی ہیں، نہ کہ یہ الفاظ، کیونکہ الفاظ حسن و قبح سے متصف نہیں ہوتے مگر اپنے معانی کی تبعیت کے حکم سے جن پر وہ دلالت کرتے ہیں۔ پس ان کی اپنی ذات کے لحاظ سے کوئی اہمیت نہیں، کیونکہ وہ صرف مرکب حروف اور ایک خاص نظم سے زیادہ کچھ نہیں جسے اصطلاح کہا جاتا ہے۔ پس یہ سمجھ لو!\n\nوتر کی گیارہویں رکعت کی صورت سے اللہ کے مردوں میں سے ایک مرد کی صورت نشأت پذیر ہوئی جسے عبد الفرد (عبد الفرد) کہا جاتا ہے۔\n\n### [فردیت کو انصاف پسند شخص کسی دوسری چیز کے تصور کے بغیر نہیں سمجھ سکتا]\n\nجان لو کہ فردیت (الفردية) کو انصاف پسند شخص کسی دوسری چیز کے تصور کے بغیر نہیں سمجھ سکتا جس سے یہ موسوم بہ فرد (الفرد) ایک ایسی صفت کے ساتھ منفرد ہوا جو اس میں نہیں ہے جس سے وہ منفرد ہوا، کیونکہ اگر وہ اس میں ہوتی تو اس کے لیے اس کے ساتھ منفرد ہونا صحیح نہ ہوتا۔ پس اس پر اسمِ فرد کا اطلاق نہ ہوتا۔ پس ضروری ہے کہ وہ چیز جس سے وہ منفرد ہوا، معقول ہو، اور وہ صرف شفع (جفت) ہے۔\n\nاور وہ امر جس کے ساتھ فرد منفرد ہوا، وہ صرف احدیت (الأحدية) سے مشابہت ہے۔ اور افراد میں سے پہلا تین ہے۔ پس واحد (الواحد) فرد نہیں ہے۔ کیونکہ اللہ نے اس شخص کو کافر قرار دیا جس نے کہا: **﴿إِنَّ اللَّهَ ثَالِثُ ثَلَاثَةٍ﴾** (بے شک اللہ تین میں سے تیسرا ہے)۔ اگر وہ کہتا: \"دو کا تیسرا\"، تو وہ کافر نہ ہوتا۔ کیونکہ وہ تعالیٰ دو کا تیسرا ہے، اور تین کا چوتھا، اور چار کا پانچواں، جہاں تک بھی پہنچے۔ اور یہ اس کا فرمان ہے: **﴿وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ﴾** (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)۔ پس جو اپنی احدیت میں ہو، وہ تعالیٰ ایک کا دوسرا ہے۔ اور جو اپنی تثنیہ میں ہو، وہ دو کا تیسرا ہے۔ اور جو اپنی تثلیث میں ہو، وہ تین کا چوتھا ہے، جہاں تک بھی پہنچے۔ پس وہ مخلوق کے ساتھ ہے جہاں کہیں بھی وہ ہوں۔ خالق ان سے جدا نہیں ہوتا، کیونکہ خلق کا مستند اسمِ خالق (الخالق) کی طرف ہے، ایک صحیح استناد جس میں کوئی شک نہیں، اگرچہ یہ اسم کئی معانی کا متقاضی ہے۔ پس وہ ان معانی کا طالب ہے، یعنی اسمِ خالق اپنی ذات کے ساتھ، ان میں سے ہر معنی کا مخلوق میں اثر ہے، نہ کہ خالق میں۔ پس خالق ان معانی کے لیے صرف جامع کی طرح ہے، اور ان کا اثر مخلوق میں ہے، نہ کہ اس میں۔\n\nپس حق (الحق) چار میں چوتھے کے ساتھ منفرد نہیں ہوتا، بلکہ وہ چار میں پانچویں کے ساتھ منفرد ہوتا ہے، کیونکہ **﴿لَيْسَ كَمِثْلِهِ شَيْءٌ﴾** (اس کی مثل کوئی چیز نہیں)۔ اور اگر وہ چار میں سے چوتھے کا عین ہوتا تو وہ ان کی مثل ہوتا۔ حالانکہ چار میں سے ہر ایک چار کا چوتھا ہے، بغیر کسی تخصیص کے۔ اور اگر ایسا ہوتا تو چار میں سے واحد حق کو اپنے وجود سے چار بنا دیتا، اور معاملہ ایسا نہیں ہے۔ اور اسی طرح ہر عدد میں۔ پس جب بھی تم کسی عدد کو فرض کرو، تو حق کو وہ واحد بناؤ جو اس عدد کے بعد اس سے متصل ہو، اور یہ ضروری ہے، کیونکہ وہ اسے شامل ہوتا ہے۔ پس چار کا پانچواں چار کو شامل ہوتا ہے، اور چار اسے شامل نہیں ہوتے۔ پس وہ انہیں پانچ بناتا ہے اور وہ اسے پانچ نہیں بناتے، کیونکہ وہ اپنے لیے چار ہیں۔ اور اسی طرح ہر عدد میں۔\n\nاور یہ اس لیے ہے تاکہ معدودات پر عدد کی حفاظت ہو، اور حفاظت صرف اللہ کے لیے ہے۔ اور اللہ واحد (الواحد) کے سوا کوئی نہیں ہے۔ پس ضروری ہے کہ واحد ہمیشہ اپنے سے کم کی حفاظت کرے، خواہ وہ شفع (جفت) ہو یا وتر (طاق)۔ پس وہ شفع کو وتر بناتا ہے اور وتر کو شفع بناتا ہے۔ پس کہا جاتا ہے: \"تین کا چوتھا\" اور \"چار کا پانچواں\"، اور یہ نہیں کہا جاتا: \"پانچ کا پانچواں\" اور \"چار کا چوتھا\" اور \"دس کا دسواں\"۔\n\nپس حکماء فردیت (الفردية) کے بارے میں کہتے ہیں کہ وہ ہر عدد میں تین سے اوپر ہر وتر (طاق) عدد ہے، جیسے پانچواں، ساتواں، اور نواں۔ پس ہر دو فردوں کے درمیان شفعیت (جفت ہونے) کا مقام ہے، اور ہر دو شفعوں کے درمیان فردیت کا مقام ہے۔ یہ حکماء کے نزدیک ہے۔\n\nاور ہمارے نزدیک ایسا نہیں ہے۔ کیونکہ فردیت اس واحد (الواحد) کے لیے ہوتی ہے جو وتر کو شفع بناتا ہے، اور اس واحد کے لیے جو شفع کو وتر بناتا ہے، جو حکماء کے نزدیک فرد ہے۔ اور اگر ایسا نہ ہوتا تو حق کی فردیت کے بارے میں یہ کہنا صحیح نہ ہوتا کہ وہ تین کا چوتھا ہے اور پانچ کا چھٹا، اور اس سے کم اور زیادہ۔ اور وہ ہر نسبت میں فرد ہے۔ پس کبھی وہ وتر کو شفع بنانے میں منفرد ہوتا ہے، اور کبھی شفع کو وتر بنانے میں۔ اور یہ اس کا فرمان ہے: **﴿مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ﴾** (جب تین سرگوشی کرتے ہیں تو وہ ان کا چوتھا ہوتا ہے، اور نہ پانچ سرگوشی کرتے ہیں تو وہ ان کا چھٹا ہوتا ہے)۔ پس اس نے اپنی فردیت کو معین ذکر کے ساتھ صرف وتر کو شفع بنانے کی فردیت میں بیان کیا، جسے حکماء فردیت کی اصطلاح میں نہیں مانتے۔ پھر اس نے عام طور پر فرمایا: **﴿وَلَا أَدْنَى مِنْ ذَلِكَ وَلَا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ﴾** (اور نہ اس سے کم اور نہ اس سے زیادہ، مگر وہ ان کے ساتھ ہوتا ہے)، خواہ ان کا عدد وتر ہو یا شفع۔ کیونکہ اللہ ان کی شفعیت کا ایک نہیں ہوتا، اور نہ ان کی وتریت کا ایک ہوتا ہے، بلکہ وہ ان پر نگران، محافظ ہے جو **﴿مِنْ وَرَائِهِمْ مُحِيطٌ﴾** (ان کے پیچھے سے گھیرے ہوئے ہے)۔\n\nپس جب بھی خلق اس مرتبے کی طرف منتقل ہوتی ہے جو حق کے لیے تھی، تو حق اس سے اگلی مرتبے کی طرف منتقل ہو جاتا ہے، اس کے لیے اس مرتبے پر ٹھہرنا ممکن نہیں ہوتا جس میں وہ تھا جب خلق اس کی طرف منتقل ہوئی۔ پس اس الٰہی راز میں غور کرو کہ یہ کتنا دقیق اور کتنا عظیم ہے اس تنزیہ (التنزيه) میں جس میں خلق کے لیے حق کے ساتھ کوئی شرکت صحیح نہیں ہے۔ پس خلق ہمیشہ حق سے ملنے کی کوشش کرتی ہے، اور اس پر قادر نہیں ہوتی، کیونکہ حق اس مرتبے سے منتقل ہو جاتا ہے۔ اور اسی لیے عدد لا متناہی ہے، کیونکہ اگر وہ متناہی ہوتا تو خلق حق کو پا لیتی، اور یہ کبھی نہیں ہو گا۔ پس خلق اپنے لیے خلق ہے، اور حق اپنے لیے حق ہے۔\n\nاور اس کی مثال یہ ہے کہ تین افراد کسی سرگوشی میں ہوں، جو ایک مجلس میں جمع ہوں۔ تو اللہ بلا شک اس جماعت کا چوتھا ہے۔ پس اگر ان کا چوتھا کوئی دوسرا انسان آ کر ان کے پاس بیٹھ جائے، تو حق اس چوتھے مرتبے سے اس شخص کے محض آنے سے جو انہیں چار بنا رہا تھا، پانچویں مرتبے کی طرف منتقل ہو جاتا ہے۔ پس اگر وہ زیادہ دیر بیٹھے رہیں، یہاں تک کہ کوئی ایسا شخص آ جائے جو قوم کو پانچ بنا دے، تو حق چھٹے مرتبے کی طرف منتقل ہو جاتا ہے، پس وہ پانچ کا چھٹا ہوتا ہے، یعنی اس جماعت کا چھٹا، اس کے بعد جب وہ اس جماعت کا پانچواں تھا جسے اس واحد نے پانچ بنایا تھا۔ پس جان لو، میں نے تمہیں ایک عظیم علم پر متنبہ کیا ہے جس پر تم اللہ کے نزدیک میرا شکریہ ادا کرو گے، کیونکہ میں اللہ سے امید کرتا ہوں کہ وہ مجھے اس علم باللہ کے ذریعے نفع دے گا جو میں نے اپنی اس کلام میں ذکر کیا ہے، جو تمہیں اس فن میں تصنیف کرنے والے متقدمین کی کتابوں میں نہیں ملے گا۔\n\nاور یہ سب قرآنِ عزیز کے ایک کلمے کا ایک نقطہ ہے۔ پس ہمارے پاس اللہ کی طرف سے صرف اس میں اللہ کی طرف سے فہم ہے، اور وہ الٰہی وحی ہے جسے حق نے ہم پر باقی رکھا ہے۔\n\nپس یہ جو ہم نے ذکر کیا، یہ رسول اللہ صلی اللہ علیہ وسلم کی رات کی نماز کا وتر تھا۔ اور جہاں تک بارہ کی تکمیل کا تعلق ہے، تو وہ مہیمن (المهيمن) کہلاتا ہے جو قوی وتر کی نشأت کی صورت سے خارج ہے، اور وہ واحدِ اوّل (الواحد الأول) ہے، اور وہ صرف اللہ ہے۔ پس وہ سبحانہ و تعالیٰ اپنی کبریائی میں پیدا کرنے والا ہے، وہ واحد، احد (الأحد) ہے جس نے **﴿لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ﴾** (نہ اس نے کسی کو جنا، نہ وہ جنا گیا، اور نہ کوئی اس کا ہمسر ہے)۔\n\nاور وہ مرد جس کے ذریعے بارہ مکمل ہوئے، جیسا کہ مہینے رمضان کے ذریعے مکمل ہوئے، اور اس نے انہیں صرف اپنے اسماء میں سے ایک اسم کے ذریعے مکمل کیا، اور وہ رمضان عزوجل ہے۔ پس اس کے ذریعے ہر چیز مکمل ہوئی۔ پس چار کی تکمیل پانچویں کے ذریعے ہوتی ہے، جب اللہ چار کا پانچواں ہو، کیونکہ وہ ہی ان چاروں کی حفاظت کرتا ہے۔ پس جب ان کی جنس میں سے کوئی آ کر انہیں پانچ بنا دیتا ہے، تو چار چلے جاتے ہیں، اور اللہ ان پانچ کا چھٹا ہوتا ہے، ان پانچ کی حفاظت کرتا ہے، کیونکہ وہ الحفیظ (محافظ) ہے۔ پس دیکھو یہ معاملہ کتنا عجیب ہے۔ اور اسی سے موجود فرار (انتقال) اور حال سے حال کی طرف انتقال صحیح ہوا، کیونکہ اللہ اعداد کے مراتب میں منتقل ہوتا ہے جیسا کہ ہم نے ذکر کیا۔\n\nاور اس مرد کا نام جس کے ذریعے اللہ نے بارہ کو مکمل کیا، عبد اللہ (عبد الله) ہے۔ اور اسے عبد اللہ اس لیے کہا گیا کہ اللہ اس پر اپنے ہر اسم کی حقیقت کے ساتھ تجلی (التجلی) کرتا ہے، اور یہ اس کا فرمان ہے: **﴿وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَى فَادْعُوهُ بِهَا﴾** (اور اللہ ہی کے لیے بہترین نام ہیں، پس تم اسے انہی ناموں سے پکارو)۔ پس جب تم اسے ان میں سے کسی نام سے پکارتے ہو، تو وہ اسی اسم کے عین میں تمہاری اجابت کرتے ہوئے تجلی کرتا ہے۔\n\nجیسے رمضان کے مہینے کا روزہ، پس اس کا روزہ بارہ مہینوں میں واجب ہے۔ پس گیارہ مہینوں میں ہر مہینے کا روزہ صرف رمضان کے مہینے کے دنوں میں سے کسی دن کے روزے سے تشبیہ ہے، کیونکہ وہ نفل ہے، اور واجب صرف رمضان ہی ہے، الٰہی وجوبِ ابتدائی کے ساتھ۔ اور ہم نے \"ابتدائی\" اس لیے کہا کہ اس روزے کی نذر کی وجہ سے جسے اللہ نے تم پر واجب کیا تمہارے اپنے اوپر واجب کرنے سے، تمہاری سزا کے طور پر، اور تاکہ تم اسے ادا کرنے پر واجب کا ثواب پاؤ۔ لیکن اس میں اور واجبِ ابتدائی میں فرق یہ ہے کہ واجبِ ابتدائی کو تم اس کے وجوب کا وقت گزر جانے کے بعد قضا کرتے ہو، اور کونی واجب کو اگر تم بھول جاؤ یا بیمار ہو جاؤ اور اسے ادا نہ کر سکو اور اس کا وقت گزر جائے تو تم اسے قضا نہیں کرتے۔ پس یہ الٰہی واجب اور کونی واجب کے درمیان فرق ہے۔\n\nپس جس نے ان بارہ کے معاملے میں جو کچھ ہم نے ذکر کیا اسے جان لیا، تو اس نے الٰہی خزانوں کو حاصل کر لیا، جیسا کہ سورۃ فاتحہ کے بارے میں کہا گیا ہے کہ اللہ نے اسے اپنے نبی محمد صلی اللہ علیہ وسلم کو خاص طور پر عطا کیا، دوسرے رسولوں کے بغیر، عرش کے خزانوں میں سے ایک خزانے سے، جو کسی نازل شدہ کتاب یا صحیفے میں نہیں پایا گیا، مگر صرف قرآن میں۔ اور اسی وجہ سے اسے قرآن کہا گیا، کیونکہ اس نے ان چیزوں کو جمع کیا جو کتابوں اور صحیفوں میں نازل ہوئیں اور جو نازل نہیں ہوئیں۔\n\nاور اس مقام (منزل) میں جو علوم ہیں، ان میں حل و عقد (حل والعقد) کا علم ہے، اور اس میں حلال و حرام کا علم ہے، اور اس میں اس چیز کا علم ہے جو کافر اور مومن کو جمع کرتی ہے اور ان کے درمیان الفت پیدا کرتی ہے، اور اس میں شرعی احکام میں سے کسی حکم میں چوپایوں کو انسان کے ساتھ ملانے کا علم ہے، اور اس میں بعض اشخاص کے ساتھ کمال کے تعلق کا علم ہے، اور اس میں تقدیس (التقديس) اور اس کے اسباب و انواع کا علم ہے، اور اس میں الٰہی نعمتوں اور احسانات کا علم ہے، اور اس میں مواثیق (عہد و پیمان) اور عہود کا علم ہے، اور اس میں بدنی عبادات کی صورتوں کی نشأت کا علم ہے، اور اس میں کونی تعظیم کا علم ہے، اور اس میں الٰہی قرضوں (المداينات الإلهية) کا علم ہے، اور اس میں ایمان (الايمان) کا علم ہے، اور اس میں ابدال (الإبدال) کا علم ہے، اور اس میں الٰہی ندا کا علم ہے، اور اس میں تعریف کا علم ہے، اور اس میں دعووں پر دلائل قائم کرنے کا علم ہے، اور اس میں فترت (فترات) والوں کا علم ہے کہ اللہ کے نزدیک ان کا کیا حکم ہے، اور اس میں اس چیز کا علم ہے جو بادشاہ اور عام آدمی کے لیے خاص ہے، اور اس میں ندا میں نیابت کا علم ہے، اور اس میں رد اور قبول کا علم ہے، اور اس میں نفوس میں تفویض (سپردگی) اور تسلیم کا علم ہے، اور اس میں پردہ پوشی اور چیزوں کو ان کی اصول کی طرف لوٹانے کا علم ہے، اور اس میں کسی بھی مقام پر واحد کو سب کے مقام پر قائم کرنے کا علم ہے، اور اس میں موافقت اور اختلاف کا علم ہے، اور اس میں مجبور (مجبور) کی گرفت کا علم ہے، اور اس میں سماع (سننے) کا علم ہے، اور اس میں نور اور معنوی اور ہدایت کا علم ہے، اور اس میں امثال (مثالوں) کا علم ہے، اور اس میں اتباع (پیروی) اور اَتباع (پیروکاروں) کا علم ہے، اور اس میں شہادتوں کا علم ہے، اور اس میں معاد (آخرت) اور اس کے حکم کا علم ہے، اور اس میں خوف اور احتیاط کا علم ہے، اور اس میں چیزوں کے درمیان تجانس کا علم ہے، اور اس میں محبت اور اس کے شرف اور محبین کی اقسام کا علم ہے، اور اس میں اس میں بے پردگی کا علم ہے، اور اس میں اختصاص کا علم ہے، اور اس میں عموم و خصوص میں باطنوں کے نسخ کا علم ہے، اور اس میں حق (الحق) کو خلق سے تشبیہ دینے کا علم ہے، اور اس میں جو جائز ہے اور جو جائز نہیں، اور اس کا تعلق سمع سے ہے، عقل کو اس میں دخل نہیں ہے جس میں وہ غور کرتی ہے، اور اس میں وہب (عطا) اور کسب (کمائی) کا علم ہے، اور اس میں اس چیز کا علم ہے جو رسول پر واجب ہے، اور اس میں اس شخص کا علم ہے جس نے اللہ کو اس کے نام کے علاوہ کسی اور نام سے پکارا، تو توحید میں اس کا کیا حکم ہے، اور اس میں گمراہی اور گمراہ کرنے کے مراتب اور ان میں تفاوت کا علم ہے، اور اس میں نیکی کا حکم دینے اور برائی سے روکنے کا علم ہے، اور اس میں خلق کی حق (الحق) میں تاثیر کا علم ہے، اور اس میں اس چیز کا علم ہے جس سے اہل کتاب بدبخت ہوئے، اور اس میں حرج کو اٹھانے کا علم ہے، اور متقین کے مراتب کا علم ہے، اور اس میں اختیار کا علم ہے، اور اس میں مقامات کے ایک دوسرے پر شرف کا علم ہے کہ وہ کس چیز کی طرف لوٹتا ہے، اور اس میں ادنیٰ کا ادنیٰ پر حکم چلانے کا علم ہے، اور اس میں چیزوں کو ان کی اصول کی طرف مضاف کرنے کا علم ہے، اور اس میں خیر کے ساتھ تعریض (اشارہ) کا علم ہے، اور **﴿وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ﴾** (اور اللہ حق کہتا ہے اور وہ ہی راستہ دکھاتا ہے)۔",
    "fa": "«باب سیصد و هفتاد و نهم» در معرفت منزل حل و عقد، اکرام و اهانت، و پیدایش دعا در صورت خبر؛ و آن منزل محمدی است.\n\n(صحاف من اللجين *** ومن جوهر وعين)\nجام‌هایی از سیم ناب *** و از گوهر و چشمه (عین)\n(أتتنا بها كرام *** عليها ستور صون)\nبزرگانی آن‌ها را برای ما آوردند *** که پرده‌های صیانت بر آن‌ها بود\n(فلما بدت إلينا *** أكلنا من كل لون)\nچون بر ما آشکار شدند *** از هر رنگی خوردیم\n(فمنها علوم ونعت *** ومنها علوم كون)\nپس از آن‌ها علوم وصف (نعت) است *** و از آن‌ها علوم هستی (کون)\n(ومنها علوم حال *** ومنها علوم عين)\nو از آن‌ها علوم حال است *** و از آن‌ها علوم شهود (عین)\n(فمن قائل بوصل *** ومن قائل ببين)\nپس برخی گوینده به وصل‌اند *** و برخی گوینده به فراق (بین)\n(فسبحان من تعالى *** بتشبيه كل عين)\nپاک است آن که برتر است *** با تشبیه هر چشمه (عین)\n(فما كونه سواه *** وما كونه بكوني)\nپس هستی او غیر او نیست *** و هستی او به هستی من نیست.\n\n### [دوازده، نهایت اعداد بسیط]\n\nبدان که دوازده، نهایت اعداد بسیط (بسائط) است؛ شامل انگشتان (أصابع) و بندها (عقد). انگشتان نُه تا و بندها سه تا هستند، که مجموعاً دوازده می‌شود. و هر یک از این دوازده، حکمی دارد که دیگری ندارد و مشهد (مشهد) الهی‌ای دارد که برای غیر او نیست. و برای هر یک از این عدد، مردی از بندگان خدا هست که حکم آن عدد را دارد. واحد (الواحد) از این‌ها جزو عدد نیست، و به همین دلیل نماز وتر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) یازده رکعت بود، زیرا واحد (الواحد) جزو عدد نیست. اگر واحد (الواحد) جزو عدد بود، وتر بودن (الوتریة) اصلاً صحیح نبود، نه در عدد و نه در معدود. پس نماز وتر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) یازده رکعت بود، که هر رکعت آن نشأت (نشأة) مردی از امت اوست که قلب آن مرد در آن رکعت بر صورت قلب پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) است. اما دوازدهمین، جامع یازده تای دیگر است. و مردی که مقام دوازده را دارد، در ظاهر و باطن تماماً حق (حق) است؛ می‌داند و دانسته نمی‌شود، و او همان واحد اول (الواحد الأول) است. زیرا آغاز عدد از دو است. پس هنگامی که به دوازده می‌رسی، در واقع نهایت تو به یازده عدد است، زیرا واحد اول (الواحد الأول) جزو آن نیست. و وجود دوازده صحیح نیست مگر به واسطه واحد اول (الواحد الأول)، با وجود اینکه او جزو عدد نیست و این حکم را دارد. پس او در دوازده هست، اما خود دوازده نیست، همان‌طور که گفته می‌شود: «تو، نه تویی». و این دوازده نفر کسانی هستند که گنجینه‌های معارفی را که در صور (صور) عالم نهفته شده‌اند، استخراج می‌کنند. عالم، علم صور (صور) را از عالم دارد، و این دوازده نفر، علم آنچه را که این صور (صور) در بر دارند، یعنی گنج نهفته در آن‌ها، دارند و آن را به واسطه واحد اول (الواحد الأول) استخراج می‌کنند. پس آن‌ها داناترین مردم به توحید و عبادت هستند و مناجات دائمی ذاتی با خدا دارند که همراهی‌اش، همراهی واحد (الواحد) با اعداد است، مانند این سخن او: (وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ) [الحديد: ۴] یعنی: «و او با شماست هر کجا که باشید.» یعنی شما بدون واحد (الواحد) وجود معینی ندارید. پس به واسطه واحد (الواحد) است که اعیان اعداد ظاهر می‌شوند؛ اوست که آن‌ها را ظاهر می‌سازد و بی‌نیازشان می‌کند. پس الف (الألف) صفت اوست، زیرا با الف، الفت واحد (الواحد) با مراتب عدد به دلیل ظهورش واقع شده است. پس (هُوَ الْأَوَّلُ وَالْآخِرُ) [الحديد: ۳] یعنی: «اوست اول و آخر.» و هنگامی که واحد (الواحد) را در خودش ضرب کنی، پس از ضرب، جز خودش در خارج ظاهر نمی‌شود. و واحد (الواحد) را در هر چیزی ضرب کنی، آن چیز مضاعف نمی‌شود و افزایش نمی‌یابد. زیرا واحدی (الواحد) که در آن کثرت ضرب کردی، در واقع آن را در احدیتش ضرب کرده‌ای، به همین دلیل افزایشی در آن ظاهر نمی‌شود. زیرا واحد (الواحد) نه در ذات خود و نه در آنچه در آن ضرب می‌شود، افزایش را نمی‌پذیرد، پس مضاعف نمی‌شود. او هر کجا که باشد، واحد است. پس می‌گویی: یک در صد هزار، می‌شود صد هزار؛ و یک در دو، می‌شود دو؛ و یک در ده، می‌شود ده. اصلاً چیزی به عدد مضروب اضافه نمی‌شود، زیرا مقام واحد (الواحد) متعالی‌تر از آن است که در چیزی حلول کند یا چیزی در او حلول کند. و فرقی نمی‌کند که از عدد صحیح باشد یا کسری. پس او، یعنی واحد (الواحد)، حقایق (الحقائق) را بر همان حال که هستند، بدون تغییر از ذاتشان، رها می‌کند، زیرا اگر تغییر می‌کردند، واحد (الواحد) نیز در ذات خود تغییر می‌کرد و حق (الحق) در ذات خود تغییر می‌کرد و تغییر حقایق (الحقائق) محال است و هیچ علمی، نه حق و نه خلق، اصلاً ثابت نمی‌ماند. پس ثابت شد که حقایق (الحقائق) اصلاً دگرگون نمی‌شوند و به همین دلیل است که بر آنچه تکیه می‌شود، تکیه می‌شود و آن را علم می‌نامند. حال، هر یک از این یازده مرد را که از نماز وتر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) نشأت یافته‌اند، ذکر می‌کنیم. بلکه این صور (صور) شاید رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را در صورت ظاهری به نماز وتر یازده رکعتی واداشته باشند، و این صور (صور) در باطن از او (صَلَّى اللهُ عَليهِ وسَلَّم) هستند، زیرا او پیامبر بود در حالی که آدم میان آب و گِل بود. پس چون این صفت او بود، آن‌ها را ایجاد کرد. هنگامی که او (صَلَّى اللهُ عَليهِ وسَلَّم) با جسم خود ظاهر شد، آن صور (صور) معنوی را همراه خود داشت، پس آن‌ها جسم او را شب‌هنگام به دلیل مناسبت با غیب، به پا داشتند و بر ظاهر او به یازده رکعت حکم کردند که با آن‌ها نماز وتر می‌خواند. پس آن‌ها وتر او بودند؛ آن‌ها حاکم و محکوم او بودند. پس از او (صَلَّى اللهُ عَليهِ وسَلَّم) نشأت یافتند و در او (صَلَّى اللهُ عَليهِ وسَلَّم) ظاهر شدند و بر او به دو وجه مختلف حکم کردند. از آن جمله، صورت رکعت اول است که از آن مردی از رجال الله نشأت یافت که به لحاظ صفت، عبد الکبیر (بنده بزرگ) نامیده می‌شود، هرچند این نامی است برای او. و این نشأت (نشأة) روحانی معقولی است که اگر جسمانی شود، در صورت انسانی خواهد بود که صفتش همان است که به آن خوانده می‌شود. و هر صورت از صور این دوازده نفر نیز چنین است.\n\n### [برتری‌جویی (مفاضله) در اسماء الهی]\n\nبدان که برتری‌جویی (المفاضلة) در اسماء الهی، مانند «أعلی» (برتر) و «أجل» (بزرگ‌تر) است، در:\nسخن رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) هنگامی که مشرکان در رجز خود گفتند: «أعل هبل، أعل هبل» (هبل برتر باد، هبل برتر باد). رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «بگویید.» گفتند: «ای رسول خدا، چه بگوییم؟» فرمود: «بگویید: الله أعلى وأجل» (خداوند برتر و بزرگ‌تر است).\nو آن‌ها این مقدار را می‌پذیرند، زیرا خودشان می‌گویند: (مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى) [الزمر: ۳] یعنی: «ما آن‌ها را نمی‌پرستیم مگر برای اینکه ما را به خداوند نزدیک سازند.» پس او نزد آن‌ها برتر و بزرگ‌تر است. اگر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را در اینکه فرستاده‌ای از جانب خدایی است که آن‌ها به واسطه پرستش این خدایان، تقرب به او را می‌جویند، تصدیق می‌کردند، [ایمان می‌آوردند]. آن‌ها این‌ها را «آلهة» (خدایان) ننامیدند مگر به این دلیل که آن‌ها را معبود خود قرار دادند، زیرا «إله» (خدا) همان معبود است و «آلهة» (آلهه) به معنای عبادت است. و قرائت شده است: (وَيَذَرَكَ وَآلِهَتَكَ) [الأعراف: ۱۲۷] یعنی: «و تو و عبادتت را رها کند.» و اگر بگوید: «و آلهتک» (و خدایانت)، یعنی معبودانی که ما می‌پرستیم. پس چون آن‌ها الوهیت را به این‌هایی که می‌پرستیدند نسبت دادند، و نسبت الوهیت به الله نزد آن‌ها کامل‌تر و عظیم‌تر است، به اعتراف خودشان، رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) با ساختار برتری‌جویی (المفاضلة) در این باره سخن گفت، یعنی به آن‌ها می‌گوید: این سخن و اعتقاد شماست. و به همین دلیل در تکبیر نماز، لفظ «الله اکبر» با ساختار برتری‌جویی (المفاضلة) آمده است، نه به این معنا که سنگ‌ها یا آنچه تراشیده‌اند یا آنچه الوهیت را به آن نسبت داده‌اند، مانند ستاره و غیره، برتر باشند. بلکه برتری‌جویی (المفاضلة) در مناسبت واقع شده است، نه در اعیان (الأعیان)، زیرا در اعیان (الأعیان) برتری‌جویی وجود ندارد، چرا که میان بنده و آقا، یا رب (الرب) و مربوب (المربوب)، یا خالق و مخلوق، برتری‌جویی نیست. اگر آنچه را که در نشأت (نشأة) این صورت به آن اشاره کردیم، درک کنی، خواهی دانست که سرانجام مشرک پس از مؤاخذه چه خواهد شد. نشأت (نشأة) صورت رکعت دوم نماز وتر، مردی از رجال الله از آن نشأت یافت که به او عبد المجيب (بنده اجابت‌کننده) گفته می‌شود.\n\n### [اجابت، فرع سؤال است]\n\nبدان که اجابت، فرع سؤال است. پس این بنده (عبد) با سؤال و دعای خود در مولای خویش تأثیر می‌گذارد، و مولا نیز با اجابت در بنده خود تأثیر می‌گذارد.\nزیرا خداوند عز و جل بر زبان رسولش (صَلَّى اللهُ عَليهِ وسَلَّم) برای خود ثابت کرده است که بنده، خدا را راضی می‌کند پس او راضی می‌شود، و خدا را به خشم می‌آورد پس او خشمگین می‌شود، و خدا را ناخشنود می‌کند پس او ناخشنود می‌شود، و خدا را می‌خنداند پس او می‌خندد.\nو مانند این‌ها که در کتاب و سنت آمده است. و حق تعالی (الحق تعالی) در بنده تأثیر می‌گذارد تا سؤال کند و او اجابت نماید، و فعل ناخشنودکننده را در او تأثیر می‌گذارد تا او ناخشنود شود. و این برای آن است که بدانی امر، دوری و کروی است و نهایت دایره به نقطه آغازش باز می‌گردد، پس آخر بر اول عطف می‌شود تا او اول و آخر باشد. پس جز او کسی او را راضی نکرده و جز او کسی او را ناخشنود نساخته است، زیرا او متعالی‌تر از آن است که غیر او در او تأثیر بگذارد. پس بفهم. و برای خدا در عالم حکمی جز آنچه ذکر کردیم نیست. آیا نمی‌بینی که می‌فرماید: (سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ) [الرحمن: ۳۱] یعنی: «به زودی به حساب شما می‌پردازیم ای جن و انس.» و او جز به ما شغلی ندارد، پس از ما برای ما فارغ می‌شود. اگر ما زائل شویم، او وجوداً و تقدیراً نخواهد بود. و امر جز این‌گونه معقول نیست، وگرنه اضافات باطل می‌شدند، در حالی که باطل نمی‌شوند، زیرا آن‌ها به خودی خود اضافات هستند. پس رب (الرب) بدون اضافه معقول نیست. و به همین دلیل در قرآن هرگز به صورت مطلق و بدون اضافه نیامده است، هرچند اضافاتش متفاوت است؛ گاهی به اسم‌های ضمایر اضافه می‌شود، گاهی به اعیان (الأعیان) و گاهی به احوال. اگر معرفت (المعرفة) تو به پروردگارت این‌گونه نباشد، اصلاً پروردگارت را نشناخته‌ای. بلکه تو او را با تقسیم عقلی شناخته‌ای که حکم واجب الوجود لذاته این است که چنین باشد، و آیا واجب الوجود لذاته وجود دارد یا نه؟ پس او را جز به واسطه خودت نمی‌شناسی. و آنچه را جز به واسطه تو نشناسیم، ناگزیر علم به آن متوقف بر علم تو به خودت است. پس وجود تو متوقف بر وجود اوست، و علم به ربوبیت (الربوبية) او بر تو متوقف بر علم تو به خودت است. پس او در وجود، اصل است و تو در وجود، حکم فرع را داری؛ و تو در علم به او، اصل هستی و او در علم، حکم فرع را دارد. نشأت (نشأة) صورت رکعت سوم نماز وتر، مردی از رجال الله از آن نشأت یافت که عبد الحمید (بنده ستوده) نامیده می‌شود.\n\n### [ستایش خداوند بر دو نوع است: مطلق و مقید]\n\nبدان که ستایش (الثناء) خداوند بر دو نوع است: مطلق و مقید. ستایش مطلق جز با عجز (ناتوانی) محقق نمی‌شود، مانند:\nسخن او (صَلَّى اللهُ عَليهِ وسَلَّم): (لا أحصي ثناء عليك أنت كما أثنيت على نفسك)\n«من نمی‌توانم ستایش تو را به شمار آورم، تو آن‌گونه‌ای که خودت خویشتن را ستوده‌ای.»\n(قال قائلهم إذا نحن أثنينا عليك بصالح *** فأنت الذي نثني وفوق الذي نثني)\nگوینده‌شان گفت: اگر ما تو را به نیکی ستایش کنیم *** تو آنی که ما می‌ستاییم و فراتر از آنی که می‌ستاییم.\nو ممکن نیست که مخلوقی بتواند آنچه را که شایسته ستایش خداوند تعالی است، احاطه کند، زیرا ممکن نیست که تمام ممکنات در هستی (الوجود) وارد شوند. و هر ممکنی وجه خاصی به سوی خدا دارد که از آن وجه، خدا او را ایجاد می‌کند، و از آن وجه، آن ممکن خدا را می‌شناسد، و از آن وجه، او را با ستایشی می‌ستاید که جز صاحب آن وجه، کسی آن را نمی‌داند و غیر او نمی‌تواند آن را با لفظ یا اشاره‌ای بیان کند. پس این، ستایش مطلق خداوند است به هر زبانی که بوده و خواهد بود. و به همین دلیل، ثواب سخن گوینده: «سبحان الله عدد خلقه» (پاک است خدا به تعداد آفریدگانش)، تصور وقوعش در هستی (الوجود) ممکن نیست، اما ثوابش پیوسته، حال به حال، به طور دائم تا بی‌نهایت وجود می‌یابد. و به همین دلیل نیز شریعت آن را به صورت تثلیث (سه بار) آورده است که بنده آن را سه مرتبه بگوید تا ثواب محسوس، ثواب متخیّل و ثواب معنوی حاصل شود. پس از نظر حس، خیال و عقل متنعم می‌شود، همان‌طور که از نظر حس، خیال و عقل ذکر می‌کند، و همان‌طور که از نظر حس، خیال و عقل عبادت می‌کند. و همچنین ذکر بنده به اندازه مداد کلمات الهی، و همچنین به وزن عرش او، اگر عرش تمام عالم با محدوده‌اش باشد. و همچنین رضای نفس او در آنچه اهل بهشت و اهل دوزخ انجام می‌دهند، زیرا آن‌ها جز در موارد رضایت الهی کاری نمی‌کنند و تصرفی ندارند، چون آن موطن این را به آن‌ها می‌دهد. برخلاف موطن دنیا و تکلیف، که در موطن دنیا با آنچه خدا را راضی می‌کند و آنچه او را ناخشنود می‌سازد، تصرف می‌کنند. و این بدان سبب است که خداوند دوزخ را سرای کسی قرار داده که بر او خشم گرفته است، پس ناگزیر اهل آن در دار دنیا در آنچه خدا را ناخشنود می‌سازد، حرکت می‌کنند. اما هنگامی که در سرای دوزخ ساکن شوند و آن را آباد کنند، ممکن نیست جز در رضایت خدا حرکت کنند. و به همین دلیل، سرانجام اهل آن به حکم رحمتی است که (وَسِعَتْ كُلَّ شَيْءٍ) [الأعراف: ۱۵۶] یعنی: «همه چیز را فرا گرفته است»، هرچند آن سرای شقاوت باشد. همان‌طور که درباره رسولی که رسالتش پایان یافته و از آن فارغ شده و به سوی خدا بازگشته است، می‌گوییم: او رسول خداست، هرچند در آن حال رسول نیست. همچنین درباره سرای شقاوت می‌گوییم: آن سرای شقاوت است، هرچند شقاوت از اهل آن در آنجا زائل شده باشد. اما ستایش مقید (الثناء المقید)، حکما آن را فقط به صفت تنزیه (التنزیه) مقید می‌کنند، و اگر او را به صفت فعل ستایش کنند، به حکم کل یا اصالت است، نه اینکه حکم به شخص خاصی داده شود. و غیر از حکما، ستایش خداوند را به صفت فعل و صفت تنزیه (التنزیه) با هم مقید می‌کنند. و اینان همان کاملان (الکمل) هستند، زیرا در آنچه حکما دانسته‌اند، شریک بوده‌اند و بر آن‌ها افزوده‌اند به آنچه حکما ندانسته‌اند و به دلیل کوتاهی همتشان، به سبب شبهه‌ای که برایشان پیش آمده و بر آن‌ها حکم کرده است که از خداوند تعالی جز همان واحد مورد اشاره صادر نشده است، و اینکه آنچه خداوند خود را در کتابش به آن وصف کرده، بر او جایز نیست، زیرا در نظر آن‌ها کتاب نازل‌شده و شخص فرستاده‌شده‌ای به آن وجهی که امر در نفس خود و نزد اهل کشف (الکشف) و ایمان است، ثابت نشده است. و برخی از عقول نظریه‌پردازان مانند متکلمین و دیگرانی که از جهت نظر عقلی به آن قائل‌اند، [نیز چنین‌اند]. و حکم صور (صور) این رکعات وتری نبوی از زمان پیامبر بودن او (صَلَّى اللهُ عَليهِ وسَلَّم) در حالی که آدم میان آب و گِل بود، تا روز قیامت در تمام عالم جاری شده است. نشأت (نشأة) صورت رکعت چهارم نماز وتر، مردی از رجال الله از آن نشأت یافت که عبد الرحمن (بنده رحمان) نامیده می‌شود.\n\n### [رحمت الهی که خداوند در بندگانش ایجاد کرده، مخلوق از رحمت ذاتی است]\n\nبدان که رحمت الهی که خداوند در بندگانش ایجاد کرده تا به واسطه آن به یکدیگر رحم کنند، مخلوق از رحمت ذاتی است که خداوند به واسطه آن عالم را ایجاد کرد، هنگامی که دوست داشت شناخته شود، و به واسطه آن (كَتَبَ عَلَى نَفْسِهِ الرَّحْمَةَ) [الأنعام: ۱۲] یعنی: «رحمت را بر خود واجب گردانید.» و این رحمت مکتوب، منفعل از رحمت ذاتی است. و رحمت امتنان (رحمت از روی بخشش) همان است که (وَسِعَتْ كُلَّ شَيْءٍ) [الأعراف: ۱۵۶] یعنی: «همه چیز را فرا گرفته است.» پس رحمت شیء برای خودش، توسط رحمت ذاتی مدد می‌یابد و به آن نظر می‌کند، و در آن، شهود (الشهود) برای هر رحیم به نفس خود واقع می‌شود. زیرا خداوند خود را به محبت و شدت اشتیاق به دیدار دوستانش وصف کرده است، و آن‌ها را ملاقات نکرد مگر به حکم همین رحمتی که صاحب این رحمت آن را مشاهده می‌کند؛ این همان رحمتی است که بر خود واجب گردانیده است و در رحمت ذاتی و امتنان مشهدی ندارد. اما رحمت رحم‌کننده بر کسی که به او بدی کرده است، و آنچه شمول انعام الهی و وسعت جود (بخشندگی) اقتضا می‌کند، مشهدی جز رحمت امتنان ندارد، و این همان رحمتی است که ابلیس و مادون او به آن امید دارند. اینان در رحمت مکتوب و رحمت ذاتی مشهدی ندارند. و به همین دلیل، «الله» و «الرحمن» بر دیگر اسماء برتری دارند، زیرا (لِلَّهِ الْأَسْمَاءُ الْحُسْنَى) [الأعراف: ۱۸۰] یعنی: «برای خداست نام‌های نیکو.» پس تمام اسماء، دلایلی بر اسم «الرحمن» و اسم «الله» هستند، اما بیشتر مردم درک نمی‌کنند. و من ندیدم کسی از اهل الله به تثلیث (سه گانه بودن) رحمت با این تقسیم‌بندی توجه داده باشد، زیرا این تقسیم‌بندی غریبی است، همان‌طور که در نفس امر چنین است. ما آن را جز از طریق کشف (الکشف) ندانستیم، و نمی‌دانم چرا اصحاب ما از بیان آن خودداری کرده‌اند، با اینکه گمان می‌کنم خداوند این را بر آن‌ها کشف (کشف) کرده است. اما نبوت‌ها، می‌دانم که آن‌ها به آن وقوف عین (وقوف شهودی) یافته‌اند، و ما آن را از نور مشکات آن‌ها شناختیم، زیرا خداوند به ما پیروی الهی و پیروی نبوی را روزی کرده است. اما پیروی الهی، همان سخن خداوند تعالی است: (وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ) [الحديد: ۴] یعنی: «و او با شماست هر کجا که باشید.» پس خداوند در این معیت، بنده را هر کجا که باشد، دنبال می‌کند. پس ما نیز او تعالی را هر کجا که با حکمی ظاهر شود، دنبال می‌کنیم. ما منتظر می‌مانیم تا او با امری ظاهر شود که آن امر، حکم خاصی در هستی (الوجود) بدهد، پس ما در آن از او پیروی می‌کنیم و در میان عموم برخلاف آن ظاهر نمی‌شویم، مانند سکوت ما از معرفی او که اوست، هنگامی که در صورتی تجلی (تجلی) می‌کند که در آن انکار می‌شود، با وجود معرفت ما به او. پس او در تجلی (التجلی) و حکم انکار، پیش‌قدم است، و ما با سکوت از او پیروی می‌کنیم، هرچند نه انکار می‌کنیم و نه اقرار. این همان پیروی الهی است. و اما پیروی نبوی که خداوند به ما روزی کرده است، همان سخن اوست: (لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ) [الأحزاب: ۲۱] یعنی: «قطعاً برای شما در رسول خدا سرمشقی نیکوست.» سپس او از ما پیروی کرد و به ما اقتدا نمود در نمازش هنگامی که با جماعت نماز می‌خواند، که در آن ضعیف و بیمار و نیازمند هست، پس با نماز آن‌ها نماز می‌خواند. پس او (صَلَّى اللهُ عَليهِ وسَلَّم) هم متبوع (پیروی‌شده) است و هم تابع (پیروی‌کننده)؛ اسم مفعول و اسم فاعل است. سپس به ما امر کرد که اگر امام جماعت بودیم، با نماز ضعیف‌ترین نماز بخوانیم، پس ما از رحمان در آنچه ذکر کردیم، پیروی کردیم، پس ما تابع هستیم. و رحمان از ما پیروی کرد به آنچه حقایق (الحقائق) ما از احتیاج و فقر اقتضا می‌کند، پس او بر اساس آنچه ما بر آن هستیم، رفتار می‌کند، پس ما متبوع هستیم. پس بنگر که حقایق (الحقائق) سیادت در بندگان و حقایق عبادت و عبودیت (العبودية) در سیادت چه چیزی را می‌بخشد. این مرد، صفتش در عالم این است. و به واسطه این رکعت چهارم، احکام اسماء چهارگانه الهی، و احکام طبیعت در نشأت (النشأة) طبیعی، و احکام عناصر در موالید سه‌گانه که این رحمت‌های سه‌گانه را دارند، و احکام اخلاط در نشأت (النشأة) حیوانی ظاهر شد. پس این مرد بر همه این‌ها مهیمنیّت (تسلط) دارد. نشأت (نشأة) صورت رکعت پنجم نماز وتر، مردی از رجال الله از آن نشأت یافت که به او عبد المعطی (بنده عطا کننده) گفته می‌شود.\n\nنشأت (نشأة) صورت رکعت پنجم نماز وتر، مردی از رجال الله از آن نشأت یافت که به او عبد المعطی (بنده عطا کننده) گفته می‌شود. پس گاهی عطای او بخشش (وهب) است، در این صورت عطا کننده عبد الوهاب (بنده بخشنده) است. و گاهی عطای او انعام است، در این صورت عبد المنعم (بنده نعمت دهنده) است. و گاهی عطای او کرم است، در این صورت عبد الکریم (بنده کریم) است. و گاهی عطای او جود (سخاوت) است، در این صورت عبد الجواد (بنده جواد) است. و گاهی عطای او سخاوت است، در این صورت عبد المقیت و عبد السخی (بنده روزی دهنده و بنده سخاوتمند) است. و گاهی عطای او ایثار است، در این صورت عبد الغنی (بنده بی‌نیاز) است. و این عطا، پنهان‌ترین عطایا و دشوارترین آن‌ها برای تصور است، بلکه همه جز ما آن را منع می‌کنند. و ما ندیده‌ایم کسی این عطا را در الهیات ثابت کرده باشد، و آن را ثابت نمی‌کند مگر کسی که معنای اسم «الغنی» (بی‌نیاز) تعالی را بداند. و آن این است که در حدیث صحیح ثابت شده است که بنده به مقامی می‌رسد که حق (الحق) از حیث هویتش، تمام قوای او می‌شود، در:\n(قوله كنت سمعه وبصره ويده)\n«سخن او: من گوش او و چشم او و دست او بودم.»\nو دیگر اعضا و قوای او که در حدیث آمده است. و او سبحانه، غنی (بی‌نیاز) لذاته است؛ بی‌نیازی‌ای که زوالش از او ممکن نیست. پس هنگامی که بنده در این مقام قرار گیرد، خداوند صفت بی‌نیازی از خود و از هر چیز را به او عطا کرده است، زیرا هویت او، اعیان قوای این بنده است. و این در تقسیمات عطا، جز برای ایثار نیست. پس او بنده خود را به آنچه برای هویت اوست، ایثار کرده است. خداوند تعالی می‌فرماید: (وَيُؤْثِرُونَ عَلَى أَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ) [الحشر: ۹] یعنی: «و دیگران را بر خود مقدم می‌دارند، هرچند خودشان نیازمند باشند.» بلکه آن‌ها خودشان نیازمند هستند. و چون عطای ایثار، فضلی است که به عطا کننده باز می‌گردد، حق (الحق) به صفت فضل سزاوارتر است. پس عطای ایثار در حق حق (الحق) سزاوارتر و در حق بنده کامل‌تر است. و این از علوم اسراری است که بسط تعریف آن ممکن نیست، مگر با اشاره برای اهلش، تا آن‌ها را به عمل بر آن تشویق کند، زیرا آن‌ها از پذیرش آن در نهایت ترس هستند، چه رسد به متصف شدن به آن. و باقی اسماء، اهمیت کمتری دارند. نشأت (نشأة) صورت رکعت ششم نماز وتر، مردی از رجال الله از آن نشأت یافت که به او عبد المؤمن (بنده مؤمن) گفته می‌شود.\n\n### [ایمان، وصفی الهی است]\n\nبدان که ایمان (الایمان)، اگر وصفی الهی باشد، همان چیزی است که از تمام دلایل، بر وجه صحت آنچه مدعی ادعا می‌کند، ظاهر می‌شود، هر مدعی‌ای که باشد و بر هر حالتی که باشد، بدون تعیین، به شرط آنکه در نفس امر دلیل باشد، همان‌طور که حس، اگر دلیل محسوس باشد، بر آن گواهی می‌دهد. حتی اگر علم ضروری به صدق این ادعا در نفس حاکم حاصل شود، آن علم ضروری عین دلیل بر صدق ادعای این مدعی خواهد بود. پس برپا کننده این دلایل، همان تصدیق کننده صاحب این ادعا است. پس هنگامی که هر کس او را تصدیق کرد و علم به آن در نفس کسی که دلیل نزد او حاصل شده، به وجود آمد، آن شخص که این دلیل نزد او حاصل شده، تصدیق کننده صاحب این ادعا خواهد بود و تصدیق، کونی (در خلق) باز می‌گردد، همان‌طور که در حق (الحق) است. پس صاحب ادعا میان دو تصدیق کننده محصور می‌شود؛ از هر طرف که بنگرد، جز تصدیق کننده‌ای برای آنچه در ادعایش آورده است، نمی‌یابد. پس این حال، به او در نفس خود، از تکذیب شدن از سوی این دو طرف، امان می‌دهد. و اگر عالم (الکون) انکار کند، او در نفس خود به صدق این مدعی یقین دارد، و مراد جز این نیست، یعنی حصول علم به صدق او. پس به واسطه صورت این رکعت، تصدیق در عالم انس و جن در بواطن آن‌ها جاری شد، و این هنگامی بود که این رکعت در باطن امر از او واقع شد، زیرا او پیامبر بود در حالی که آدم میان آب و گِل بود. و پیوسته به صورت روحی مجرد در هر تصدیق کننده‌ای جاری بود تا اینکه او (صَلَّى اللهُ عَليهِ وسَلَّم) آن را به صورت جسم خود به رکوع برد، پس جسمانی شد. و آن روح، صورت جسمانی از فعل او نیست، زیرا از حرکات محسوس است. پس فعل آن نزد ما برای جمع بین دو صورت قوی‌تر بود، همان‌طور که تأثیر او (صَلَّى اللهُ عَليهِ وسَلَّم) با ظهور جسمش در بعثت او قوی‌تر بود از زمانی که پیامبر بود در حالی که آدم میان آب و گِل بود. زیرا او با صورت بعثت خود، تمام شرایع را نسخ کرد و برای هیچ شریعتی حکمی باقی نماند، جز آنچه او از آن باقی گذاشت، از آن جهت که شرع برای اوست، نه فقط از آن جهت که شرع است. نشأت (نشأة) صورت رکعت هفتم نماز وتر، مردی از رجال الله از آن نشأت یافت که به او عبد الرحیم (بنده رحیم) گفته می‌شود. بدان که رحمت در عین کسی که قادر به اظهار حکم آن است، بر کسی که رحمت در او قائم شده، به عذابی دردناک تبدیل می‌شود، زیرا رحمت از ذات خود، تعدی به مرحوم و اظهار اثر خود را به فعل در او می‌طلبد. پس اگر رحمت در کسی که قادر به اجرای آن در مرحوم است، قائم شود، اثری دارد که در رحم‌کننده تأثیر می‌گذارد، و آن همان زوال دردی است که با حصول اثر رحمت در مرحوم از او برطرف می‌شود. پس رحم‌کننده از حیث توانایی‌اش بر اجرای رحمت، مورد رحمت قرار می‌گیرد، و کسی که رحمت در او اجرا شده نیز به واسطه آن و به واسطه قدرت رحم‌کننده بر اجرای آن، مورد رحمت قرار می‌گیرد. پس اثر رحمت در او از دو جهت است. و اثر، از بین بردن چیزی است که رحم‌کننده را به تعلق رحمت به آن مرحوم واداشته است. پس هر رحمتی نعمت نیست، مگر هنگامی که رحم‌کننده قادر به اجرای آن باشد. پس رحمت در حق رحم‌کننده‌ای که قدرت از او سلب شده است، در صورت عذاب تجلی (تجلی) می‌کند، و در حق رحم‌کننده و مرحوم، اگر در قادر بر اجرای آن باشد، در صورت نعمت تجلی (تجلی) می‌کند. پس دو صورت متقابل را دگرگون کرده است. و این از عجیب‌ترین امور است که رحمت، درد و عذاب به بار می‌آورد. اگر رحمت در او قائم نمی‌شد، این شخص ناتوان به درد متصف نمی‌شد. سپس، آنچه در این مسئله از عجایب است، این است که رحمتی که در موصوف به نفوذ اقتدار قائم است، ممکن است مانعی از اجرای آن از ذات خود داشته باشد، پس درد کراهت در او پدید می‌آید، و این حکم آن مانع است، با وجود اینکه او متصف به اقتدار بر اجرای آن است. و این مسئله از دشوارترین مسائل در علم الهی است، و حکم آن در اخبار صحیح الهی درباره خودش تعالی عز و جل ظاهر شده است:\nآنجا که فرمود: (ما ترددت في شي‏ء أنا فاعله ترددي في قبض نسمة المؤمن يكره الموت وأنا أكره مساءته ولا بد له من لقائي)\n«من در هیچ کاری که انجام می‌دهم، به اندازه ترددم در گرفتن جان مؤمن، که مرگ را ناخوش می‌دارد و من ناخوش داشتن او را ناخوش می‌دارم، تردید نکرده‌ام، در حالی که چاره‌ای جز دیدار من ندارد.»\nو اوست که مرگ را برای مؤمن ناخوشایند ساخته است، و دلالت دارد بر اینکه دیدار او تعالی جز با مرگ ممکن نیست، و مرگ همان خروج از حس مطلق به حس مشترک است، همان‌طور که در خواب می‌بینی، زیرا خواب نوعی از انواع مرگ است. پس آن وفات و انتقال از عالم حس به عالم خیال و حس مشترک است. پس شخص خوابیده پروردگارش را در خواب می‌بیند، همان‌طور که مرده پس از مرگش او را می‌بیند. با این تفاوت که دیدار مرده و ملاقات او با پروردگارش، پس از دیدن او بازگشتی ندارد، اما شخص خوابیده بیدار می‌شود و به سوی اجل معین فرستاده می‌شود. پس اگر دیدار از روی فنا (الفناء) باشد نه از روی خواب، و سپس به حال بقا (البقاء) بازگردانده شود، حکمش حکم مرده‌ای است که روز قیامت مبعوث می‌شود و هیچ حجابی برای او واقع نمی‌شود. پس این تفاوت میان خوابیده و فانی است. و به همین دلیل عمرو بن عثمان مکی در وصف عارفان گفته است: «آن‌ها همان‌طور که امروز هستند، فردا نیز خواهند بود، ان شاء الله تعالی.» پس چیزی عجیب‌تر از حکم رحمت ندیده است. آیا نمی‌بینی که رحمت برای طبیب نسبت به صاحب آکله (زخم خورنده) قائم می‌شود، اما نمی‌تواند آن را در او اجرا کند مگر با درد دادن به او؟ پس به اندازه رحمت آن طبیب به صاحب این بیماری، درد او در نفسش به دلیل عدم اجرای رحمت بدون درد دادن به اوست. اگر رحمت او به بیمار نبود، درد نمی‌کشید. آیا نمی‌بینی که کسی که شفا می‌یابد، چگونه دردی نمی‌یابد، بلکه لذت می‌یابد؟ پس در آنچه برایت در علم الهی ذکر کردم، تدبر کن. و من آن را در کشف (الکشف) صحیح و مشهد (المشهد) صریح دیده‌ام، در حالی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) با من بود. و خداوند تعالی به کشتن دجال به دلیل ادعای الوهیتش امر کرده است، در حالی که او می‌گرید و درباره آنچه به خاطر او مجازات می‌شود، عذرخواهی می‌کند و می‌گوید که در این باره چیزی در دست ندارد. پس گریه او مانند درد در نفس رحم‌کننده‌ای است که به دلیل مانع، قدرت اجرای رحمت خود را ندارد. پس در علم الهی حیرتی بزرگ‌تر از این حیرت نیست، و اگر عظمت نداشت، حق (الحق) خود را به تردد وصف نمی‌کرد، و تردد همان حیرت است. پس بفهم. نشأت (نشأة) صورت رکعت هشتم نماز وتر، مردی از رجال الله تعالی از آن نشأت یافت که به او عبد الملک (بنده فرمانروا) گفته می‌شود.\n\n### [مخلوق، فرمانروا (ملک) به طور مطلق است و حق، فرمانروای فرمانروا (ملک الملک) است]\n\nبدان که ملک (فرمانروا) کسی است که این حقیقت را که «ملک» نامیده می‌شود، ایجاد کرده است. پس هنگامی که بنده به آن نامیده شود و حق (الحق) به «ملک» وصف شود، وصف شدن او مانند وصف شدن مخلوق نیست. زیرا مخلوق، ملک (فرمانروا) به طور مطلق است، و حق (الحق)، ملک الملک (فرمانروای فرمانروا) است، نه ملک به طور مطلق. زیرا بنده، ملک (فرمانروا) نمی‌شود مگر هنگامی که عبودیت (العبودية) او برای خداوند تعالی نزد او ظاهر شود و نزد او ظاهر شود که او ملک (فرمانروا) برای فرمانروای خود، یعنی الله تعالی، است. و ما این را به خاطر گروهی گفتیم که نظرشان به خدا این است که خداوند جزء را به طور معین نمی‌داند، بلکه کلی را می‌داند که جزء را در بر می‌گیرد، برخلاف اهل حق (أهل الحق)، یعنی اهل کشف (الکشف) و شهود (الوجود). و به همین دلیل، اسم «الملک» و «المالک» برای او بود، یعنی این وصف از روی شدت ظاهر شد، زیرا صاحبان این نظر عقلی آن را ثابت نمی‌کنند. پس چون عقول بر آن اجماع نکردند، نزاع در آن واقع شد. پس حق (الحق) آن را به عنوان «ملک» (فرمانروا) از روی شدت برای خود خالص کرد، و بنده عارف نیز حق (الحق) را به عنوان «ملک» (فرمانروا) برای خود از روی شدت به خاطر نزاع‌کننده خالص کرد. پس او را «ملک الملک» (فرمانروای فرمانروا) نامید تا میان او و ملک بودن مخلوق برای خدا تفاوت بگذارد. پس مخلوق در ملک بودن برای خدا، به عبودیت (العبودية) برای خدا متصف می‌شود، و حق (الحق) به ملک الملک متصف می‌شود و به عبودیت (العبودية) برای او متصف نمی‌شود، هرچند در حق (الحق) تأثیری از خلق باشد، همان‌طور که پیش‌تر گفته شد. با این حال، به عبودیت (العبودية) متصف نمی‌شود، زیرا آن از روی ذلت نیست، چون او تعالی اصل در آن تأثیر است، پس جز آنچه از او بوده، به او باز نمی‌گردد. برخلاف خلق، که آنچه از او بوده به او باز می‌گردد و آنچه از او نبوده، با آغاز از حق (الحق)، در او قائم می‌شود. پس این را بدان. نشأت (نشأة) صورت رکعت نهم نماز وتر، صورت مردی از رجال الله از آن نشأت یافت که به او عبد الهادی (بنده هدایت‌کننده) گفته می‌شود. بدان که هدایت، اثری الهی است در سخن او: (مَنْ يُضْلِلِ اللَّهُ فَلَا هَادِيَ لَهُ) [الرعد: ۳۳] یعنی: «هر کس را خدا گمراه کند، پس هدایت‌کننده‌ای برای او نیست.» و اثری کونی (جهانی) است در سخن او: (وَلِكُلِّ قَوْمٍ هَادٍ) [الرعد: ۷] یعنی: «و برای هر قومی هدایت‌کننده‌ای است.» و معنای آن به اول باز می‌گردد. زیرا هادی کونی (جهانی) جز رسولی از جانب خدا نیست. پس او ابلاغ کننده است، نه هادی به معنای موفق کننده. بلکه هادی به معنای بیان کننده است. خداوند تعالی درباره بیانی که برای آن‌هاست و تبیینی که خداوند بر آن‌ها واجب کرده است، می‌فرماید: (لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ) [النحل: ۴۴] یعنی: «تا برای مردم آنچه را که به سوی آن‌ها نازل شده، بیان کنی.» و درباره هدایتی که همان توفیق است، می‌فرماید: (لَيْسَ عَلَيْكَ هُدَاهُمْ) [البقرة: ۲۷۲] یعنی: «هدایت آن‌ها بر عهده تو نیست»، یعنی توفیق دادن آن‌ها برای پذیرش آنچه تو را به آن فرستاده و امر به بیانش کرده‌ام، بر عهده تو نیست، (وَلَكِنَّ اللَّهَ يَهْدِي) [البقرة: ۲۷۲] یعنی: «بلکه خداوند توفیق می‌دهد» (مَنْ يَشَاءُ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ) [البقرة: ۲۷۲] یعنی: «هر که را بخواهد، و او به هدایت‌شوندگان داناتر است»، یعنی به کسانی که پذیرای توفیق هستند، زیرا او آن‌ها را بر مزاج خاصی آفریده است. پس این هادیان، هادیان بیان هستند، نه هادیان توفیق. و برای هادی که همان خداست، هم ایضاح و هم توفیق است، و برای هادی که مخلوق است، فقط ایضاح است. و ما این را گفتیم و به آنچه استشهاد کردیم، استشهاد نمودیم، به دلیل آنچه نزد کسی که علم به حقایق (الحقائق) ندارد، مقرر شده است که اگر بنده در آنچه از جانب خدا ابلاغ می‌کند، صادق باشد، آن در نفوس شنوندگان تأثیر می‌گذارد. و این‌گونه نیست که آن‌ها گمان می‌کنند. زیرا هیچ کس نزدیک‌تر به خدا و از جانب خدا و صادق‌تر در ابلاغ از جانب خدا و محبوب‌تر در پذیرش آنچه از جانب خدا آورده است، از رسولان (صلوات الله علیهم و سلامه) نیست. با این حال، پذیرش از سوی شنوندگان عمومیت نیافت، بلکه رسول صادق در ابلاغ گفت: (وَمَا يَزِيدُهُمْ دُعَائِي إِلَّا فِرَارًا) [نوح: ۶] یعنی: «و دعوت من جز بر فرار آن‌ها نمی‌افزاید.» پس هنگامی که با وجود تحقق این همت، عمومیت نیافت، دانستیم که همت اصلاً در مدعو تأثیری ندارد. و آنچه از شنوندگان پذیرفته شد، از اثر همت داعی که ابلاغ کننده است، پذیرفته نشد، بلکه از آن جهت پذیرفته شد که خداوند در خلقت او مزاجی به او بخشیده است که اقتضای پذیرش این و امثال آن را دارد. و این مزاج خاص را جز خدایی که آن‌ها را بر آن آفریده است، نمی‌داند، و این همان سخن خداوند تعالی است: (وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ). پس بعد از این، اگر در مجلس واعظی که به سوی خدا دعوت می‌کند، حاضر شدی و اثری از کلام او در خود نیافتی، نگو که این از عدم صدق واعظ است. نه، بلکه عیب از خود توست، زیرا خداوند تو را در آن زمان بر پذیرش فطرت نداده است. زیرا شخص منصف به آنچه این داعی واعظ آورده است، می‌نگرد. اگر حق بود و او آن را نپذیرفت، قطعاً می‌داند که عیب از شنونده است نه از واعظ. پس اگر در مجلس واعظ دیگری حاضر شد و همان ذکر را آورد و در او تأثیر گذاشت، شنونده از روی جهل می‌گوید: این واعظ راست گفت، زیرا کلامش در قلب من تأثیر گذاشت. در حالی که عیب از توست و تو نمی‌دانی. پس بدان که آن تأثیر به دلیل پذیرش حق از سوی تو نبوده است، زیرا آن در نفس امر در هر دو واعظ حق است. بلکه تأثیر در این مجلس و نه در آن، به دلیل نسبتی میان تو و این واعظ یا میان تو و زمان واقع شده است، پس این ذکر در تو تأثیر گذاشته است. و تأثیر از واعظ نبوده است، زیرا ذکر وجود داشته و در تو اثری نداشته است. بلکه مناسبتی که برایت بیان کردم، یعنی مناسبت زمانی یا نسبتی که میان تو و این واعظ است، تأثیر گذاشته است. و شاید به دلیل اعتقاد تو به او تأثیر گذاشته باشد، در حالی که به آن دیگری اعتقادی نداشتی. پس جز خودت یا آنچه شبیه آن است، در تو تأثیر نگذاشته است. و به همین دلیل ما در تفسیر هدایت الهی، آن را به توفیق و بیان گفتیم. پس سخن ما به «توفیق»، یعنی به موافقت نسبت میان شنونده و واعظ است، نه به «بیان»، زیرا بیان را در هر دو حالت از واعظان واقع شده فرض کردیم، اما پذیرش جز در یکی از دو حالت واقع نشد. پس این را بدان و آن را محقق کن تا ان شاء الله هدایت یابی. و کمترین فایده در این مسئله، سلامت واعظ از تهمت تو به عدم صدق در تذکرش و رد کردن حق از سوی توست. زیرا حق در عاقل سلیم تأثیر می‌گذارد، از دست هر کس که بیاید، حتی اگر بر زبان مشرکی به خدا، دشمن خدا، دروغگو بر خدا، و مورد نفرت نزد خدا جاری شود، اما آنچه او آورده، حق است، پس عاقل آن را از آن جهت که حق است، می‌پذیرد، نه از جهت محلی که به واسطه آن ظاهر شده است. و به این وسیله، طالب حق از غیر او متمایز می‌شود. نشأت (نشأة) صورت رکعت دهم نماز وتر، مردی از رجال الله از آن نشأت یافت که به او عبد ربه (بنده پروردگارش) گفته می‌شود.\n\n### [ربوبیت (پروردگاری) متوقف بر دو چیز است]\n\nبدان که ربوبیت (الربوبية) وصفی اضافی است که هیچ یک از دو متضایف (دو طرف اضافه) از دیگری مستقل نمی‌شود. پس ربوبیت (الربوبية) متوقف بر دو چیز است. و لازم نیست که آن دو متباین (جدا از هم) نباشند؛ گاهی متباین هستند و گاهی غیر متباین. پس مالکی که مملوکی (ملک) نداشته باشد، وجوداً و تقدیراً محقق نمی‌شود، و مملوکی که مالکی نداشته باشد نیز چنین است. و رب (الرب) بدون مربوب (پرورش یافته) وجوداً و تقدیراً صحیح نیست. و هر دو متضایف (متضایفین) چنین هستند. پس نسبت عالم به آنچه حقایق (الحقائق) برخی از اسماء الهی می‌بخشد، نسبت متضایفین از دو طرف است. پس عالم آن اسماء الهی را می‌طلبد و آن اسماء الهی عالم را می‌طلبند، مانند اسم «الرب» (پروردگار)، «القادر» (توانا)، «الخالق» (آفریننده)، «النافع» (سودرسان)، «الضار» (زیان‌رسان)، «المحیی» (زنده‌کننده)، «الممیت» (میراننده)، «القاهر» (چیره)، «المعز» (عزت‌بخش) و «المذل» (خوارکننده) و امثال این اسماء. و اسماء الهی دیگری نیز هستند که عالم را نمی‌طلبند، اما نفسی از انفاس عالم از آن‌ها استراحت می‌یابد، بدون تفصیل، همان‌طور که میان این اسم‌هایی که ذکر کردیم، تفصیل داده می‌شود. پس اسماء استراحت مانند «الغنی» (بی‌نیاز)، «العزیز» (عزیز) و «القدوس» (پاک) و امثال این اسماء هستند. و ما برای خدا اسم‌هایی که فقط بر ذات او دلالت کند، بدون تعقل معنایی زائد بر ذات، نیافتیم. زیرا هیچ اسمی نیست مگر بر یکی از دو امر: یا بر فعلی دلالت می‌کند که ناگزیر عالم را می‌طلبد، و یا بر تنزیه (التنزیه) دلالت می‌کند که صفات نقص کونی (جهانی) را که حق (الحق) از آن‌ها منزه است، از آن استراحت می‌یابد. غیر از این، خداوند به ما نداده است. پس هیچ اسم عَلَمی (اسم خاص) وجود ندارد که جز علمیت (خاص بودن) برای خدا در آن باشد، مگر اینکه آن در علم او باشد یا آنچه خداوند در غیب خود به آن اختصاص داده و برای ما آشکار نکرده است. و دلیل آن این است که او تعالی اسماء خود را برای ما آشکار نکرده است مگر برای ستایش او به واسطه آن‌ها. پس محال است که در آن‌ها اصلاً اسم عَلَمی باشد، زیرا اسماء عَلَم (نام‌های خاص) به واسطه آن‌ها ستایشی بر مسمی واقع نمی‌شود، بلکه آن‌ها اسم‌های عَلَم برای معانی‌ای هستند که بر آن‌ها دلالت می‌کنند، و آن معانی هستند که به واسطه آن‌ها کسی که حکم آن معانی در ما از او ظاهر شده است، ستایش می‌شود، و او همان کسی است که به معانی آن‌ها نامیده شده است. و معانی همان‌هایی هستند که به این اسم‌های لفظی نامیده می‌شوند، مانند «العالم» (دانا) و «القادر» (توانا) و باقی اسماء. پس (لِلَّهِ الْأَسْمَاءُ الْحُسْنَى) [الأعراف: ۱۸۰] یعنی: «برای خداست نام‌های نیکو»، و آن‌ها جز معانی نیستند، نه این الفاظ. زیرا الفاظ جز به حکم تبعیت از معانی دال بر آن‌ها، به حسن و قبح متصف نمی‌شوند. پس از حیث ذات خود اعتباری ندارند، زیرا آن‌ها چیزی جز حروف مرکب و نظم خاصی که اصطلاح نامیده می‌شود، نیستند. پس این را بفهم. نشأت (نشأة) صورت رکعت یازدهم نماز وتر، صورت مردی از رجال الله از آن نشأت یافت که به او عبد الفرد (بنده فرد) گفته می‌شود.\n\n### [فردیت را شخص منصف درک نمی‌کند مگر با تعقل امر دیگری]\n\nبدان که فردیت (الفردية) را شخص منصف درک نمی‌کند مگر با تعقل امر دیگری که این فرد نامیده شده، به واسطه وصفی از آن امر منفرد شده باشد که در آن دیگری نباشد. زیرا اگر در آن دیگری بود، صحیح نبود که به واسطه آن منفرد شود، پس نام فرد بر او اطلاق نمی‌شد. پس ناگزیر آن چیزی که فرد از آن منفرد شده، باید معقول باشد، و آن چیزی جز شفع (زوج) نیست. و امری که فرد به واسطه آن منفرد شده، همان تشبه به احدیت (الأحدية) و اولین افراد سه‌گانه است. پس واحد (الواحد) فرد نیست. زیرا خداوند کسی را که گفت: (إِنَّ اللَّهَ ثَالِثُ ثَلَاثَةٍ) [المائدة: ۷۳] یعنی: «خداوند سومین سه تاست»، کافر وصف کرده است. اما اگر می‌گفت: «سومین دو تا»، کافر نبود. زیرا او تعالی سومین دو تا، و چهارمین سه تا، و پنجمین چهار تاست، تا هر کجا که برسد، و این همان سخن خداوند تعالی است: (وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ) [الحديد: ۴] یعنی: «و او با شماست هر کجا که باشید.» پس هر کس در احدیت (الأحدية) خود باشد، او تعالی دومین آن واحد است. و هر کس در تثنیه (دوگانگی) خود باشد، او سومین آن دوگانگی است. و هر کس در تثلیث (سه‌گانگی) خود باشد، او تعالی چهارمین آن سه تاست، تا هر کجا که برسد. پس او با مخلوقات است هر کجا که باشند. خالق از آن‌ها جدا نمی‌شود، زیرا مستند خلق، به اسم «الخالق» استناد صحیح و بی‌شک دارد. و اگرچه این اسم چندین معنا را می‌طلبد، اما او آن‌ها را می‌طلبد، یعنی اسم «الخالق» به ذات خود، و برای هر معنایی از آن‌ها اثری در مخلوق است، نه در خالق. پس خالق برای این معانی، به ویژه مانند جامع است، و اثر آن‌ها در مخلوق است نه در او. پس حق (الحق) در چهار، به چهارمین منفرد نمی‌شود، بلکه در چهار به پنجمین منفرد می‌شود، زیرا (لَيْسَ كَمِثْلِهِ شَيْءٌ) [الشوری: ۱۱] یعنی: «چیزی مانند او نیست.» و اگر او عین چهارمین از چهار بود، مانند آن‌ها می‌شد، در حالی که هر یک از چهار، عین چهارمین برای چهار است، بدون تخصیص. و اگر چنین بود، واحد (الواحد) از چهار، حق (الحق) را با وجود خود، چهارم می‌کرد، در حالی که امر چنین نیست. و در هر عددی نیز چنین است. پس هرگاه عددی را فرض کردی، حق (الحق) را همان واحدی قرار ده که بعد از آن عدد است و ناگزیر به آن چسبیده است، زیرا او آن را در بر می‌گیرد. پس پنجمین برای چهار، چهار را در بر می‌گیرد، اما چهار او را در بر نمی‌گیرد. پس او آن‌ها را پنج‌تا می‌کند و آن‌ها او را پنج‌تا نمی‌کنند، زیرا آن‌ها چهار لنفسه هستند. و در هر عددی نیز چنین است. و این بدان سبب است که عدد بر معدودات حفظ شود، و حفظ جز برای خدا نیست، و خدا جز واحد (الواحد) نیست. پس ناگزیر واحد (الواحد) همیشه حافظ مادون خود از شفع (زوج) و وتر (فرد) است. پس او شفع را وتر می‌کند و وتر را شفع می‌کند. پس گفته می‌شود: چهارمین سه تا، و پنجمین چهار تا. و گفته نمی‌شود: پنجمین پنج تا، یا چهارمین چهار تا، یا دهمین ده تا. حکما در مورد فردیت (الفردية) می‌گویند: آن وتر (فرد) از هر عددی از سه به بالا در هر وتر از آن‌هاست، مانند پنجم، هفتم و نهم. پس میان هر دو فرد، مقام شفعیت (زوجیت) است و میان هر دو شفع، مقام فردیت (الفردية) است. این نزد حکماست. و نزد ما چنین نیست. زیرا فردیت (الفردية) برای واحدی است که وتر را شفع می‌کند، و برای واحدی است که شفع را وتر می‌کند، که نزد حکما فرد است. و اگر چنین نبود، صحیح نبود که در فردیت (الفردية) حق (الحق) بگویی: او چهارمین سه تا و ششمین پنج تا و کمتر و بیشتر از آن است. و او در هر نسبتی فرد است. پس گاهی به تشفیع وتر (زوج کردن فرد) منفرد می‌شود و گاهی به ایثار شفع (فرد کردن زوج)، و این همان سخن اوست: (مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ) [المجادلة: ۷] یعنی: «هیچ رازگویی سه نفری نیست مگر اینکه او چهارمین آن‌هاست، و نه پنج نفری مگر اینکه او ششمین آن‌هاست.» پس در فردیت (الفردية) او با ذکر معین، جز فردیت (الفردية) تشفیع وتر (زوج کردن فرد) بیان نشده است که حکما در اصطلاح فردیت (الفردية) به آن قائل نیستند. سپس در حالت عام فرمود: (وَلَا أَدْنَى مِنْ ذَلِكَ وَلَا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ) [المجادلة: ۷] یعنی: «و نه کمتر از آن و نه بیشتر، مگر اینکه او با آن‌هاست»، چه عدد آن‌ها وتر (فرد) باشد و چه شفع (زوج). زیرا خداوند نه یکی از شفعیت (زوجیت) آن‌هاست و نه یکی از وتریت (فردیت) آن‌ها، بلکه او مراقب و حافظی است که (مِنْ وَرَائِهِمْ مُحِيطٌ) [البروج: ۲۰] یعنی: «از پشت سر بر آن‌ها احاطه دارد.» پس هرگاه خلق به مرتبه‌ای که برای حق (الحق) بود، منتقل شوند، حق (الحق) به مرتبه بعدی منتقل می‌شود و ممکن نیست که در آن مرتبه‌ای که هنگام انتقال خلق به آن، در آن بود، توقف کند. پس در این سر الهی بنگر که چقدر دقیق و چقدر عظیم است در تنزیهی (التنزیه) که مشارکت خلق با حق (الحق) در آن صحیح نیست. پس خلق همیشه می‌خواهد به حق (الحق) برسد، اما نمی‌تواند، زیرا حق (الحق) از آن مرتبه منتقل می‌شود. و به همین دلیل است که عدد پایان نمی‌پذیرد، زیرا اگر پایان می‌پذیرفت، خلق به حق (الحق) می‌رسید، و این هرگز نخواهد بود. پس خلق، خلق برای خود است و حق (الحق)، حق برای خود است. و مثال آن این است که گروهی سه نفره در حال رازگویی باشند که مجلسی آن‌ها را گرد آورده است. پس خداوند بدون شک چهارمین آن گروه است. اگر چهارمین آن‌ها انسان دیگری باشد و بیاید و نزد آن‌ها بنشیند، حق (الحق) به محض آمدن آن مرد یا شخصی که آن‌ها را چهار تا کرد، از مرتبه چهارم به مرتبه پنجم منتقل می‌شود. اگر نشستن را طولانی کنند به طوری که کسی بیاید که قوم را پنج تا کند، حق (الحق) به مرتبه ششم منتقل می‌شود، پس او ششمین پنج تاست، یعنی ششمین این گروه، پس از آنکه پنجمین گروهی بود که آن واحد آن‌ها را پنج تا کرده بود. پس بدان، که تو را به علم عظیمی آگاه کردم که به خاطر آن نزد خدا از من سپاسگزاری خواهی کرد، زیرا از خدا امید دارم که مرا به واسطه کسی که آنچه را در این کلامم از علم به خدا ذکر کردم و در کتب پیشینیان در این فن نمی‌یابی، از من بهره‌مند سازد. و این همه، نقطه‌ای از کلمه‌ای از قرآن عزیز است. پس آنچه نزد ما از خداست، جز فهم در آن از جانب خدا نیست، و آن همان وحی الهی است که حق (الحق) بر ما باقی گذاشته است. پس این که ذکر کردیم، نماز وتر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) از نماز شب بود. و اما تمام شدن دوازده، آن همان مهیمن (المهیمن) نامیده شده است که خارج از نشأت (نشأة) صورت وتر قوی است، و او همان واحد اول (الواحد الأول) است و جز الله نیست. پس اوست ایجاد کننده سبحانه و تعالی در کبریایی خود، واحد احد (الواحد الأحد) که (لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ) [الإخلاص: ۳-۴] یعنی: «نزاده و زاده نشده و هیچ کس همتای او نبوده است.»\nو مردی که دوازده به واسطه او کامل شد، همان‌طور که ماه‌ها به واسطه رمضان کامل شدند، ماه‌ها جز به واسطه اسمی از اسماء او که همان رمضان عز و جل است، کامل نشدند. پس به واسطه او همه چیز کامل شد. پس کمال چهار به واسطه پنجم است، هنگامی که خدا پنجمین چهار باشد، زیرا اوست که چهار تای آن‌ها را حفظ می‌کند. پس اگر کسی از جنس آن‌ها بیاید که آن‌ها را پنج تا کند، چهار از بین می‌رود و خدا ششمین پنج تا می‌شود و پنج تای آن‌ها را حفظ می‌کند، زیرا او «الحفیظ» (نگهدارنده) است. پس بنگر که این امر چقدر عجیب است. و از اینجا فرار موجود و انتقال از حالی به حال دیگر صحیح است، زیرا خداوند در مراتب اعداد منتقل می‌شود به دلیل آنچه ذکر کردیم. و نام این مردی که خداوند دوازده را به واسطه او کامل کرد، عبد الله (بنده خدا) است. و او عبد الله نامیده شد، زیرا خداوند به حقیقت هر اسمی از اسم‌هایش بر او تجلی (تجلی) می‌کند، و این همان سخن اوست: (وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَى فَادْعُوهُ بِهَا) [الأعراف: ۱۸۰] یعنی: «و برای خداست نام‌های نیکو، پس او را به آن‌ها بخوانید.» پس هنگامی که او را به اسمی از آن‌ها بخوانی، در عین آن اسم، اجابت کننده بر تو تجلی (تجلی) می‌کند. مانند روزه ماه رمضان، که روزه آن در دوازده ماه واجب است. پس هر روزه‌ای در ماهی از ماه‌های یازده‌گانه، تنها تشبیهی به روزه‌ای از روزهای ماه رمضان است، زیرا آن نافله است، و واجب جز رمضان با وجوب الهی ابتدایی نیست. و ما «ابتدایی» گفتیم به خاطر نذر روزه که خداوند آن را بر تو واجب کرده است به واسطه واجب کردن تو آن را بر خودت، به عنوان عقوبتی برای تو، و تا تو را به واسطه آن ثواب واجب بدهد. اما تفاوت میان آن و واجب ابتدایی این است که واجب ابتدایی را اگر زمان وجوبش بگذرد، قضا می‌کنی، اما واجب کونی (جهانی) را اگر فراموش کنی یا بیمار شوی و نتوانستی آن را انجام دهی و زمانش بگذرد، قضا نمی‌کنی. پس این تفاوت میان واجب الهی و واجب کونی است. پس هر کس آنچه را درباره این دوازده ذکر کردیم، بشناسد، به گنجینه‌های الهی دست یافته است، همان‌طور که درباره فاتحه گفته شده است که خداوند آن را به پیامبرش محمد (صَلَّى اللهُ عَليهِ وسَلَّم) به طور خاص، نه به دیگر رسولان، از گنجی از گنجینه‌های عرش عطا کرد که در هیچ کتاب نازل شده‌ای از جانب خدا و هیچ صحیفه‌ای یافت نشد، مگر به طور خاص در قرآن. و به همین دلیل قرآن نامیده شد، زیرا آنچه در کتب و صحیفه‌ها نازل شده و آنچه نازل نشده است را جمع کرده است. پس در آن تمام آنچه در کتب نازل شده است، وجود دارد و آنچه در هیچ کتاب و صحیفه‌ای نازل نشده است نیز در آن هست. و در این منزل از علوم، علم حل و عقد (گشودن و بستن)، و علم حلال و حرام، و علم آنچه کافر و مؤمن را جمع می‌کند و میان آن‌ها الفت می‌اندازد، و علم ملحق کردن چهارپایان به انسان در حکمی از احکام شرایع، و علم تعلق کمال به برخی اشخاص، و علم تقدیس و اسباب و انواع آن، و علم نعمت‌ها و منت‌های الهی (الآلاء والمنن الإلهية)، و علم پیمان‌ها و عهدها، و علم نشأت (نشأة) صور عبادات بدنی، و علم تعظیم کونی (جهانی)، و علم بدهی‌های الهی (المداینات الإلهية)، و علم ایمان (الایمان)، و علم ابدال، و علم ندای الهی، و علم تعریف، و علم اقامه براهین بر ادعاها، و علم اصحاب فترات و حکم آن‌ها نزد خدا، و علم آنچه مخصوص فرمانروا (الملک) و مردم عادی (السوقة) است، و علم نیابت در ندا، و علم رد و قبول، و علم تفویض و تسلیم در نفوس، و علم پوشاندن (الستر) و بازگرداندن اشیاء به اصولشان، و علم قرار دادن واحد به جای همه در هر موطنی که باشد،\nو علم موافقت و اختلاف، و علم مؤاخذه مجبور، و علم سماع، و علم نور و معنوی و هدایت، و علم امثال، و علم اتباع (پیروی) و اَتباع (پیروان)، و علم شهادات، و علم معاد و حکم آن، و علم خوف و حذر، و علم تجانس میان اشیاء، و علم حب (عشق) و شرافت آن و انواع محبین، و علم خلع عذار در آن، و علم اختصاص، و علم نسخ بواطن در عموم و خصوص، و علم تشبیه حق (الحق) به خلق و آنچه از آن جایز است و آنچه جایز نیست، و آنچه متعلق به سمع است و عقل در آن دخالتی ندارد به آنچه در آن نظر می‌کند، و علم وهب (بخشیدن) و کسب، و علم آنچه بر رسول واجب است، و علم کسی که خدا را به غیر اسمش نامیده و حکم او در توحید، و علم مراتب ضلال (گمراهی) و اضلال (گمراه کردن) و تفاوت در آن، و علم امر به معروف و نهی از منکر، و علم تأثیر خلق در حق (الحق)، و علم آنچه اهل کتاب به واسطه آن شقی شدند، و علم رفع حرج و مراتب متقین، و علم اختیار، و علم شرافت مکان‌ها بر یکدیگر که به چه چیزی باز می‌گردد، و علم تحکم (حکم راندن) پایین‌تر بر پایین‌تر، و علم اضافه اشیاء به اصولشان، و علم تعریض به خیر. و (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ) [الأحزاب: ۴] یعنی: «و خداوند حق را می‌گوید و او راه را هدایت می‌کند.»"
  },
  "page_count": 9
}