{
  "id": 1,
  "title": {
    "ar": "الباب الأول في معرفة الروح‏",
    "en": "Chapter One: Concerning the Knowledge of the Spirit",
    "ur": "پہلا باب روح کی معرفت میں",
    "fa": "باب اول در معرفت روح"
  },
  "content": {
    "ar": "## (الباب الأول) في معرفة الروح‏\n\n\nالذي أخذت من تفصيل نشأته ما سطرته في هذا الكتاب وما كان بيني وبينه من الأسرار فمن ذلك نظم‏\n\n\n> قلت عند الطواف كيف أطوف *** وهو عن درك سرنا مكفوف‏\n\n\n> جلمد غير عاقل حركاتي *** قيل أنت المحير المتلوف‏\n\n\n> انظر البيت نوره يتلألأ *** لقلوب تطهرت مكشوف‏\n\n\n> نظرته بالله دون حجاب *** فبدا سره العلي المنيف‏\n\n\n> وتجلى لها من أفق جلالي *** قمر الصدق ما اعتراه خسوف‏\n\n\n> لو رأيت الولي حين يراه *** قلت فيه مدله ملهوف‏\n\n\n> يلثم السر في سواد يميني *** أي سر لو أنه معروف‏\n\n\n> جهلت ذاته فقيل كثيف *** عند قوم وعند قوم لطيف‏\n\n\n> قال لي حين قلت لم جهلوه *** إنما يعرف الشريف الشريف‏\n\n\n> عرفوه فلازموه زمانا *** فتولاهم الرحيم الرءوف‏\n\n\n> واستقاموا فما يرى قط فيهم *** عن طواف بذاته تحريف‏\n\n\n> قم فبشر عني مجاور بيتي *** بأمان ما عنده تخويف‏\n\n\n> إن أمتهم فرحتهم بلقائي *** أو يعيشوا فالثوب منهم نظيف‏\n\n\n### [الفتى الفائت المتكلم الصامت‏]\n\n\nاعلم أيها الولي الحميم والصفي الكريم أني لما وصلت إلى مكة البركات ومعدن السكنات الروحانية والحركات وكان من شأني فيه ما كان طفت ببيته العتيق في بعض الأحيان فبينا أنا أطوف مسبحا وممجدا ومكبرا ومهللا تارة ألثم واستلم وتارة للملتزم التزم إذ لقيت وأنا عند الحجر الأسود باهت الفتى الفائت المتكلم الصامت الذي ليس بحي ولا مائت المركب البسيط المحاط المحيط فعند ما أبصرته يطوف بالبيت طواف الحي بالميت عرفت حقيقته ومجازه وعلمت إن الطواف بالبيت كالصلاة على الجنازة وأنشدت الفتى المذكور ما تسمعه من الأبيات عند ما رأيت الحي طائفا بالأموات شعر\n\n\n> ولما رأيت البيت طافت بذاته *** شخوص لهم سر الشريعة غيبي‏\n\n\n> وطاف به قوم هم الشرع والحجا *** وهم كحل عين الكشف ما هم به عمى‏\n\n\n> تعجبت من ميت يطوف به حي *** عزيز وحيد الدهر ما مثله شي‏ء\n\n\n> تجلى لنا من نور ذات مجله *** وليس من الأملاك بل هو أنسي‏\n> تيقنت أن الأمر غيب وأنه *** لدى الكشف والتحقيق حي ومرئي‏\n\n\nقلت فعند ما وقعت مني هذه الأبيات وألحقت بيته المكرم من جهة ما بجانب الأموات خطفني مني خطفة قاهر وقال لي قولة رادع زاجر انظر إلى سر البيت قبل الفوت تجده زاهيا بالمطيفين والطائفين بأحجاره ناظرا إليهم من خلف حجبه وأستاره فرأيته يزهو كما قال فأفصحت له في المقال وأنشدته في عالم المثال على الارتجال‏\n\n\n> أرى البيت يزهو بالمطيفين حوله *** وما الزهو إلا من حكيم له صنع‏\n\n\n> وهذا جماد لا يحس ولا يرى *** وليس له عقل وليس له سمع‏\n\n\n> فقال شخيص هذه طاعة لنا *** قد أثبتها طول الحياة لنا الشرع‏\n\n\n> فقلت له هذا بلاغك فاستمع *** مقالة من أبدى له الحكمة الوضع‏\n\n\n> رأيت جمادا لا حياة بذاته *** وليس له ضر وليس له نفع‏\n\n\n> ولكن لعين القلب فيه مناظر *** إذا لم يكن بالعين ضعف ولا صدع‏\n\n\n> يراه عزيزا إن تجلى بذاته *** فليس لمخلوق على حمله وسع‏\n\n\n> فكنت أبا حفص وكنت علينا *** فمني العطاء الجزل والقبض والمنع‏\n\n\n### (وصل) [منزلة الفتى الفائت المتكلم الصامت‏]\n\n\nثم إنه أطلعني على منزلة ذلك الفتى ونزاهته عن أين ومتى فلما عرفت منزلته وإنزاله وعانيت مكانته من الوجود وأحواله قبلت يمينه ومسحت من عرق الوحي جبينه وقلت له انظر من طالب مجالستك وراغب في مؤانستك فأشار إلى إيماء ولغزا إنه فطر على أن لا يكلم أحدا إلا رمزا وإن رمزى إذا علمته وتحققته وفهمته علمت أنه لا تدركه فصاحة الفصحاء ونطقه لا تبلغه بلاغة البلغاء فقلت له يا أيها البشير وهذا خير كثير فعرفني باصطلاحك وأوقفني على كيفية حركات مفتاحك فإني أريد مسامرتك وأحب مصاهرتك فإن عندك الكفؤ والنظير وهو النازل بذاتك والأمير ولو لا ما كانت لك حقيقة ظاهرة ما تطلعت إليه وجوه ناضرة ناظرة فأشار فعلمت وجلى لي حقيقة جماله فهيمت فسقط في يدي وغلبني في الحين علي فعند ما أفقت من الغشية وأرعدت فرائصى من الخشية علم أن العلم به قد حصل وألقى عصا سيره ونزل فتلا حاله على ما جاءت به الأنباء وتنزلت به الملائكة الأمناء إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ فجعلها دليلا واتخذها إلى معرفة العلم الحاصل به سبيلا فقلت له أطلعني على بعض أسرارك حتى أكون من جملة أحبارك فقال انظر في تفاصيل نشأتي وفي ترتيب هيأتي تجد ما سألتني عنه في مرقوما فإني لا أكون مكلما ولا كليما فليس علمي بسواي وليست ذاتي مغايرة لأسمائي فأنا العلم والمعلوم والعليم وأنا الحكمة والمحكم والحكيم ثم قال لي طف على أثري وانظر إلي بنور قمري حتى تأخذ من نشأتي ما تسطره في كتابك وتمليه على كتابك وعرفني ما أشهدك الحق في طوافك من اللطائف مما لا يشهده كل طائف حتى أعرف همتك ومعناك فأذكرك على ما علمت منك هناك‏\n\n\n### [تلويحات ببعض أسرار الوجود واكتشاف الذاتية]\n\n\nفقلت أنا أعرفك أيها الشاهد المشهود ببعض ما أشهدني من أسرار الوجود المترفلات في غلائل النور والمتحدات العين من وراء الستور التي أنشأها الحق حجابا مرفوعا وسماء موضوعا والفعل إلى الذات لطيف ولعدم دركه على شريف‏\n\n\n> فوصفه ألطف من ذاته *** وفعله ألطف من وصفه‏\n\n\n> وأودع الكل بذاتي كما *** أودع معنى الشي‏ء في حرفه‏\n\n\n> فالخلق مطلوب لمعنى كما *** يطلب ذات المسك من عرفه‏\n\n\nولو لا ما أودع في ما اقتضته حقيقتي ووصلت إليه طريقتي لم أجد لمشربه نيلا ولا إلى معرفته ميلا ولذلك أعود علي عند النهاية ولهذا يرجع فخذ البركار في فتح الدائرة عند الوصول إلى غاية وجودها إلى نقطة البداية فارتبط آخر الأمر بأوله وانعطف أبده على أزله فليس إلا وجود مستمر وشهود ثابت مستقر وإنما طال الطريق من أجل رؤية المخلوق فلو صرف العبد وجهه إلى الذي يليه من غير أن يخل فيه لنظر إلى السالكين إذا وصلوا بعين بئس والله‏\nما فعلوا ولو عرفوا من مكانهم ما انتقلوا لكن حجبوا بشفعية الحقائق عن وترية الحق الخالق الذي خلق الله به الأرض والطرائق فنظروا مدارج الأسماء وطلبوا معارج الإسراء وتخيلوها أعظم منزلة تطلب وأسنى حالة يقصد الحق تعالى فيها ويرغب فسير بهم على براق الصدق ورفارفه وحققهم بما عاينوه من آياته ولطائفه وذلك لما كانت النظرة شمالية وكانت الفطرة على النشأة الكمالية تقابل بوجهها في أصل الوضع نقطة الدائرة فشطر مهجتها من الجانب الأيمن منقبة ومن الجانب الغربي سافرة فلو سفرت عن اليمين لنالت من أول طرفتها مقام التمكين في مشاهدة التعيين ويا عجبا لمن هو في أعلى عليين ويتخيل أنه في أسفل سافلين أَعُوذُ بِاللَّهِ أَنْ أَكُونَ من الْجاهِلِينَ فشمالها يمين مديرها ووقوفها في موضعها الذي وجدت فيه غاية مسيرها فإذا ثبت عند العاقل ما أشرت إليه وصح وعلم إن إليه المرجع فمن موقفه لم يبرح لكن يتخيل المسكين القرع والفتح ويقول وهل في مقابلة الضيق والحرج إلا السعة والشرح ثم يتلو ذلك قرآنا على الخصماء فَمَنْ يُرِدِ الله أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلامِ ومن يُرِدْ أَنْ يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقاً حَرَجاً كَأَنَّما يَصَّعَّدُ في السَّماءِ فكما إن الشرح لا يكون إلا بعد الضيق كذلك المطلوب لا يحصل إلا بعد سلوك الطريق وغفل المسكين عن تحصيل ما حصل له بالإلهام مما لا يحصل إلا بالفكر والدليل عند أهل النهي والأفهام ولقد صدق فيما قال فإنه ناظر بعين الشمال فسلموا له حاله وثبتوا له محاله وضعفوا منه محاله وقولوا له عليك بالاستعانة إن أردت الوصول إلى ما منه خرجت لا محالة واستروا عنه مقام المجاورة وعظموا له أجر التزاور والمزاورة والموازرة فسيحزن عند الوصول إلى ما منه سار وسيفرح بما حصل في طريقه من الأسرار وصار ولو لا ما طلب الرسول صلى الله عليه وسلم بالمعراج ما رحل ولا صعد إلى السماء ولا نزل وكان يأتيه شأن الملإ الأعلى وآيات ربه في موضعه كما زويت له الأرض وهو في مضجعه ولكنه سر إلهي لينكره من شاء لأنه لا يعطيه الإنشاء ويؤمن به من شاء لأنه جامع للأشياء فعند ما أتيت على هذا العلم الذي لا يبلغه العقل وحده ولا يحصله على الاستيفاء الفهم قال لقد أسمعتني سرا غريبا وكشفت لي معنى عجيبا ما سمعته من ولي قبلك ولا رأيت أحدا تممت له هذه الحقائق مثلك على أنها عندي معلومة وهي بذاتي مرقومة ستبدو لك عند رفع ستاراتي واطلاعك على إشاراتي ولكن أخبرني ما أشهدك عند ما أنزلك بحرمه وأطلعك على حرمه‏\n\n\n### «مشاهدة مشهد البيعة الإلهية»\n\n\nقلت اعلم يا فصيحا لا يتكلم وسائلا عما يعلم لما وصلت إليه من الايمان ونزلت عليه في حضرة الإحسان أنزلني في حرمه وأطلعني على حرمه وقال إنما أكثرت المناسك رغبة في التماسك فإن لم تجدني هنا وجدتني هنا وإن احتجبت عنك في جمع تجليت لك في منى مع أني قد أعلمتك في غير ما موقف من مواقفك وأشرت به إليك غير مرة في بعض لطائفك إني وإن احتجبت فهو تجل لا يعرفه كل عارف إلا من أحاط علما بما أحطت به من المعارف أ لا تراني أتجلي لهم في القيامة في غير الصورة التي يعرفونها والعلامة فينكرون ربوبيتي ومنها يتعوذون وبها يتعوذون ولكن لا يشعرون ولكنهم يقولون لذلك المنجلي نعوذ بالله منك وها نحن لربنا منتظرون فحينئذ أخرج عليهم في الصورة التي لديهم فيقرون لي بالربوبية وعلى أنفسهم بالعبودية فهم لعلامتهم عابدون وللصورة التي تقررت عندهم مشاهدون فمن قال منهم إنه عبدني فقوله زور وقد باهتني وكيف يصح منه ذلك وعند ما تجليت له أنكرني فمن قيدني بصورة دون صورة فتخيله عبد وهو الحقيقة الممكنة في قلبه المستورة فهو يتخيل أنه يعبدني وهو يجحدني والعارفون ليس في الإمكان خفائي عن أبصارهم لأنهم غابوا عن الخلق وعن أسرارهم فلا يظهر لهم عندهم سوائي ولا يعقلون من الموجودات سوى أسمائي فكل شي‏ء ظهر لهم وتجلى قالوا أنت المسبح الأعلى فليسوا سواء فالناس بين غائب وشاهد وكلاهما عندهم شي‏ء واحد فلما سمعت كلامه وفهمت إشارته وإعلامه جذبني غيور إليه وأوقفني بين يديه‏\n\n\n(مخاطبات التعليم والألطاف بسر الكعبة من الوجود والطواف)\n\n\nومد اليمين فقبلتها ووصلتني الصورة التي تعشقتها فتحول لي في صورة الحياة فتحولت له في صورة الممات فطلبت الصورة تبايع الصورة فقالت لها لم تحسني السيرة وقبضت يمينها عنها وقالت لها ما عرفت لها في عالم الشهادة كنها ثم تحول لي في صورة البصر\nفتحولت له في صورة من عمي عن النظر وذلك بعد انقضاء شوط وتخيل نقض شرط فطلبت الصورة تبايع الصورة فقالت لها مثل المقالة المذكورة ثم تحول لي في صورة العلم الأعم فتحولت له في صورة الجهل الأتم فطلبت الصورة تبايع الصورة فقالت لها المقالة المشهورة ثم تحول لي في صورة سماع النداء فتحولت له في صورة الصمم عن الدعاء فطلبت الصورة تبايع الصورة فأسدل الحق بينهما ستوره ثم تحول لي في صورة الخطاب فتحولت له في صورة الخرس عن الجواب فطلبت الصورة تبايع الصورة فأرسل الحق بينهما رقوم اللوح وسطوره ثم تحول لي في صورة الإرادة فتحولت له في صورة قصور الحقيقة والعادة فطلبت الصورة تبايع الصورة فأفاض الحق بينهما ضياءه ونوره ثم تحول لي في صورة القدرة والطاقة فتحولت له في صورة العجز والفاقة فطلبت الصورة تبايع الصورة فأبدى الحق للعبد تقصيره فقلت لما رأيت ذلك الإعراض وما حصل لي تمام الآمال والأغراض لم أبيت علي ولم تف بعهدي فقال لي أنت أبيت على نفسك يا عبدي لو قبلت الحجر في كل شوط أيها الطائف لقبلت يميني هنا في هذه الصور اللطائف فإن بيتي هناك بمنزلة الذات وأشواط الطواف بمنزلة السبع الصفات صفات الكمال لا صفات الجلال لأنها صفات الاتصال بك والانفصال فسبعة أشواط لسبع صفات وبيت قائم يدل على ذات غير أني أنزلته في فرشي وقلت للعامة هذا عندكم بمنزلة عرشي وخليفتي في الأرض هو المستوي عليه والمحتوي فانظر إلى الملك معك طائفا وإلى جانبك واقفا فنظرت إليه فعاد إلى عرشه وتاه علي بسمو نعشه فتبسمت جذلا وقلت مرتجلا\n\n\n> يا كعبة طاف بها المرسلون *** من بعد ما طاف بها المكرمون‏\n\n\n> ثم أتى من بعدهم عالم *** طافوا بها من بين عال ودون‏\n\n\n> أنزلها مثلا إلى عرشه *** ونحن حافون لها مكرمون‏\n\n\n> فإن يقل أعظم حاف به *** إني أنا خير فهل تسمعون‏\n\n\n> والله ما جاء بنص ولا *** أتى لنا إلا بما لا يبين‏\n\n\n> هل ذاك إلا النور حفت به *** أنوارهم ونحن ماء مهين‏\n\n\n> فانجذب الشي‏ء إلى مثله *** وكلنا عبد لديه مكين‏\n\n\n> هلا رأوا ما لم يروا أنهم *** طافوا بما طفنا وليسوا بطين‏\n\n\n> لو جرد الألطف منا استوى *** على الذي حفوا به طائفين‏\n\n\n> قد سهموا أن يجهلوا حق من *** قد سخر الله له العالمين‏\n\n\n> كيف لهم وعلمهم إنني *** ابن الذي خروا له ساجدين‏\n\n\n> واعترفوا بعد اعتراض على *** والدنا بكونهم جاهلين‏\n\n\n> وأبلس الشخص الذي قد أبي *** وكان للفضل من الجاحدين‏\n\n\n> قد سهموا قد سهموا إنهم *** قد عصموا من خطأ المخطئين‏\n\n\nقلت ثم صرفت عنه وجه قلبي وأقبلت به على ربي فقال لي انتصرت لأبيك حلت بركتي فيك اسمع منزلة من أثنيت عليها وما قدمته من الخير بين يديها وأين منزلتك من منازل الملائكة المقربين صلوات الله عليكم وعليهم أجمعين كعبتي هذه قلب الوجود وعرشي لهذا القلب جسم محدود وما وسعني واحد منهما ولا أخبر عني بالذي أخبرت عنهما وبيتي الذي وسعني قلبك المقصود المودع في جسدك المشهود فالطائفون بقلبك الأسرار فهم بمنزلة أجسادكم عند طوافها بهذه الأحجار فالطائفون الحافون بعرشنا المحيط كالطائفين منك بعالم التخطيط فكما إن الجسم منك في الرتبة دون قلبك البسيط كذلك هي الكعبة مع العرش المحيط فالطائفون بالكعبة بمنزلة الطائفين بقلبك لاشتراكهما في القلبية والطائفون بجسمك كالطائفين بالعرش لاشتراكهما في الصفة الإحاطية فكما أن عالم الأسرار الطائفين بالقلب الذي وسعني أسنى منزلة من غيرهم وأعلى كذلك أنتم بنعت الشرف والسيادة على\nالطائفين بالعرش المحيط أولى فإنكم الطائفون بقلب وجود العالم فأنتم بمنزلة أسرار العلماء وهم الطائفون بجسم العالم فهم بمنزلة الماء والهواء فكيف تكونون سواء وما وسعني سواكم وما تجليت في صورة كمال إلا في معناكم فاعرفوا قدر ما وهبتكموه من الشرف العالي وبعد هذا فأنا الكبير المتعالي لا يحدني الحد ولا يعرفني السيد ولا العبد تقدست الألوهة فتنزهت أن تدرك وفي منزلتها أن تشرك أنت الأنا وأنا فلا تطلبني فيك فتعنى ولا من خارج فما تتهنى ولا تترك طلبي فتشقى فاطلبني حتى تلقاني فترقى ولكن تأدب في طلبك واحضر عند شروعك في مذهبك وميز بيني وبينك فإنك لا تشهدني وإنما تشهد عينك فقف في صفة الاشتراك وإلا فكن عبدا وقل العجز عن درك الإدراك إدراك تلحق في ذلك عتيقا وتكن المكرم الصديقا ثم قال لي اخرج عن حضرتي‏\n\n\nفمثلك لا يصلح لخدمتي فخرجت طريدا فضج الحاضر فقال ذَرْنِي ومن خَلَقْتُ وَحِيداً ثم قال ردوه فرددت وبين يديه من ساعتي وجدت وكأني ما زلت عن بساط شهوده وما برحت من حضرة وجوده فقال كيف يدخل علي في حضرتي من لا يصلح لخدمتي لو لم تكن عندك الحرمة التي توجب الخدمة ما قبلتك الحضرة ولرمت بك في أول نظره وها أنت فيها وقد رأيت من برهانك وتخفيها ما يزيدك احتراما وعند تجليها احتشاما ثم قال لم لم تسألني حين أمرت بإخراجك وردك على معراجك وأعرفك صاحب حجة ولسان ما أسرع ما نسيت أيها الإنسان فقلت بهرني عظيم مشاهدة ذاتك وسقط في يدي لقبضك يمين البيعة في تجلياتك وبقيت أردد النظر ما الذي طرأ في الغيب من الخبر فلو التفت في ذلك الوقت إلي لعلمت أن مني أتى علي ولكن الحضرة تعطي أن لا يشهد سواها وأن لا ينظر إلى محيا غير محياها فقال صدقت يا محمد فأثبت في المقام الأوحد وإياك والعدد فإن فيه هلاك الأبد ثم اتفقت مخاطبات وأخبار أذكرها في باب الحج ومكة مع جملة أسرار\n\n\n### (وصل) [الدخول في كعبة الحجر: البيت المتعالي عن الستر]\n\n\nفقال النجي الوفي يا أكرم ولي وصفي ما ذكرت لي أمرا إلا أنا به عالم وهو بذاتي مسطر قائم قلت لقد شوقتني إلى التطلع إليك منك حتى أخبر عنك فقال نعم أيها الغريب الوارد والطالب القاصد أدخل معي كعبة الحجر فهو البيت المتعالي عن الحجاب والستر وهو مدخل العارفين وفيه راحة الطائفين فدخلت معه بيت الحجر في الحال وألقى يده على صدري وقال أنا السابع في مرتبة الإحاطة بالكون وبأسرار وجود العين والأين أوجدني الحق قطعة نور حوائي ساذجة وجعلني للكليات ممازجة فبينا أنا متطلع لما يلقى لدي أو ينزل علي وإذا بالعلم القلمي الأعلى قد نزل بذاتي من منازله العلى راكبا على جواد قائم على ثلاث قوائم فنكس رأسه إلى ذاتي فانتشرت الأنوار والظلمات ونفث في روعي جميع الكائنات ففتق أرضي وسمائي وأطلعني على جميع أسمائي فعرفت نفسي وغيري وميزت بين شري وخيري وفصلت ما بين خالقي وحقائقي ثم انصرف عني ذلك الملك وقال تعلم أنك حضرة الملك فتهيأت للنزول وورود الرسول فتجارت الأملاك إلي ودارت الأفلاك علي والكل ليميني مقبلون وعلى حضرتي مقبلون وما رأيت ملكا نزل ولا ملكا عن الوقوف بين يدي انتقل ولحظت في بعض جوانبي فرأيت صورة الأزل فعلمت إن النزول محال فثبت على ذلك الحال وأعلمت بعض الخاصة ما شهدت وأطلعتهم مني على ما وجدت فأنا الروضة اليانعة والثمرة الجامعة فارفع ستوري واقرأ ما تضمنته سطوري فما وفقت عليه مني فاجعله في كتابك وخاطب به جميع أحبابك فرفعت ستوره ولحظت مسطوره فأبدى لعيني نوره المودع فيه ما يتضمنه من العلم المكنون ويحويه فأول سطر قرأته وأول سر من ذلك السطر علمته ما أذكره الآن في هذا الباب الثاني والله سبحانه يهدي إلى العلم وإِلى‏ طَرِيقٍ مُسْتَقِيمٍ‏\n\n",
    "en": "(Chapter One) Concerning the Knowledge of the Spirit\n\nThe details of its origination (نشأته) from which I took what I have recorded in this book, and the secrets that passed between me and it, include the following verses:\n\nI said during the circumambulation: How shall I circumambulate, when it is veiled from perceiving our secret?\nA senseless stone, my movements—it was said: You are the bewildered, the lost one.\nLook at the House (البيت); its light shines forth, unveiled for hearts that have been purified.\nI gazed upon it by The Real (بالله) without a veil, and its lofty, exalted secret became manifest.\nThe moon of sincerity, untouched by eclipse, disclosed itself to it from the horizon of my Majesty.\nIf you saw the saint (الولي) when he beholds it, you would say he is passionately enamored, yearning.\nHe kisses the secret in the blackness of my right hand—what a secret, if only it were known!\nIts Essence (ذاته) was unknown, so some called it dense (كثيف), and others called it subtle (لطيف).\nIt said to me when I asked why they were ignorant of it: Only the noble knows the noble.\nThey knew it, so they clung to it for a time, and the Compassionate, the Merciful (الرحيم الرءوف) took charge of them.\nThey became upright, and never is any deviation seen in them from the circumambulation of its Essence (بذاته).\nArise, and give glad tidings on my behalf to the dweller near My House (بيتي): of security, where there is no fear.\nIf they die, their joy is in meeting Me; or if they live, their garment is pure.\n\n### The Vanishing Youth, the Speaking Silent One (الفتى الفائت المتكلم الصامت)\n\nKnow, O intimate saint (الولي الحميم) and noble chosen one (الصفي الكريم), that when I arrived at Mecca of Blessings (مكة البركات), the source of spiritual stillness (السكنات الروحانية) and movements, and what happened to me there happened, I circumambulated its Ancient House (بيته العتيق) at certain times. While I was circumambulating, glorifying, magnifying, declaring the greatness of God, and proclaiming His oneness—sometimes kissing and touching, and sometimes clinging to the Multazam—I met, near the Black Stone (الحجر الأسود), the bewildered Vanishing Youth, the Speaking Silent One (الفتى الفائت المتكلم الصامت), who is neither living nor dead, the composite simple (المركب البسيط), the encompassed encompasser (المحاط المحيط). When I saw him circumambulating the House (البيت) with the circumambulation of the living around the dead, I recognized his reality (حقيقته) and his metaphor (مجازه), and I knew that the circumambulation of the House is like the prayer over the deceased. I recited to the aforementioned Youth the verses you hear, when I saw the living circumambulating the dead:\n\nAnd when I saw the House, its Essence (بذاته) was circumambulated by persons whose secret of the Law (سر الشريعة) is hidden.\nAnd people circumambulated it who are the Law and the intellect, and they are the kohl of the eye of Unveiling (الكشف); they are not blind to it.\nI wondered at a dead thing being circumambulated by a living one, precious, unique in time, nothing is like him.\nHe disclosed himself to us from the light of the Essence (نور ذات) of his manifestation, and he is not of the angels, but he is human.\nI became certain that the matter is hidden (غيب), and that in Unveiling (الكشف) and verification (التحقيق), he is living and visible.\n\nI said: When these verses came from me, and I likened His honored House (بيته المكرم) to the side of the dead, a Conqueror (قاهر) snatched me away from myself with a snatch, and said to me with a repelling, restraining word: Look at the secret of the House before it vanishes (الفوت); you will find it radiant with those who surround it and those who circumambulate its stones, looking at them from behind its veils and curtains. I saw it radiating as he said, so I spoke clearly to him and recited to him in the world of similitude (عالم المثال) extemporaneously:\n\nI see the House radiating with those who surround it, and radiance is only from a Wise One (حكيم) who has a making (صنع).\nYet this is an inanimate object (جماد); it neither feels nor sees, nor does it have intellect, nor does it have hearing.\nHe said: This personification is obedience to us, which the Law (الشرع) has established for us throughout life.\nI said to him: This is your message, so listen to the saying of one for whom the disposition (الوضع) has revealed wisdom (الحكمة).\nI saw an inanimate object (جمادا) with no life in its Essence (بذاته), and it has neither harm nor benefit.\nBut for the eye of the heart (عين القلب), there are sights within it, provided the eye has neither weakness nor fissure.\nIt sees it as precious if it discloses itself in its Essence (بذاته), for no creature has the capacity to bear it.\nYou were Abu Hafs, and you were upon us, so from me comes the abundant giving, the withholding, and the denial.\n\n### (Connection) The Level of the Vanishing Youth, the Speaking Silent One\n\nThen he informed me of the level (منزلة) of that Youth and his transcendence (نزاهته) beyond 'where' (أين) and 'when' (متى). When I knew his level and his descent (إنزاله), and I witnessed his station (مكانته) in Being (الوجود) and his states (أحواله), I kissed his right hand and wiped the sweat of revelation (عرق الوحي) from his brow. I said to him: Look at who seeks your company and desires your intimacy. He gestured to me with a hint (إيماء) and a riddle (لغز), that he was created upon the principle of speaking to no one except symbolically (رمزا). If you know, verify, and understand my symbol, you will know that the eloquence of the eloquent cannot grasp it, and the rhetoric of the rhetoricians cannot reach his speech. I said to him: O bearer of glad tidings, this is abundant good! So, inform me of your terminology (اصطلاحك) and show me the manner of your key's movements, for I desire to converse with you and love to be related to you, for you possess the equal (الكفؤ) and the peer (النظير), who is the one dwelling in your Essence (النازل بذاتك) and the Commander (الأمير). Were it not for your manifest reality (حقيقة ظاهرة), no fresh, gazing faces would turn toward it. He gestured, and I understood, and the reality of his beauty (جماله) was unveiled to me, so I became passionately bewildered. I fell into despair and he instantly overcame me. When I recovered from the swoon (الغشية) and my joints trembled from awe (الخشية), he knew that the Knowledge (العلم) of him had been attained, and he cast down the staff of his journey and descended. His state recited what the tidings brought and what the trustworthy angels (الملائكة الأمناء) revealed: <<إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ>> (Indeed, only those of His servants who have knowledge fear Allah). He made this a proof and took it as a path to the knowledge attained through him. I said to him: Inform me of some of your secrets so that I may be among your scholars (أحبارك). He said: Look into the details of my origination (نشأتي) and the arrangement of my form (هيأتي); you will find what you asked me about inscribed therein, for I am neither a speaker (مكلما) nor one spoken to (كليما). My knowledge is not by means of other than myself, and my Essence (ذاتي) is not different from my Names (أسمائي). I am the Knowledge (العلم), the Known (المعلوم), and the Knower (العليم); and I am the Wisdom (الحكمة), the Decisive (المحكم), and the Wise (الحكيم). Then he said to me: Circumambulate following my trace, and look at me with the light of my moon, so that you may take from my origination what you record in your book and dictate to your scribes. And inform me of the subtleties (اللطائف) that The Real (الحق) made you witness in your circumambulation, which not every circumambulator witnesses, so that I may know your aspiration (همتك) and your meaning, and mention you according to what I knew of you there.\n\n### Hints at some secrets of Being and the discovery of the Essence\n\nI said: I will inform you, O Witness (الشاهد) and Witnessed (المشهود), of some of the secrets of Being (أسرار الوجود) that He made me witness—those secrets trailing in the veils of light (غلائل النور) and unified in Essence (المتحدات العين) from behind the curtains (الستور) which The Real (الحق) established as a raised veil (حجابا مرفوعا) and a laid-out heaven (سماء موضوعا). The Act (الفعل) is subtle in relation to the Essence (الذات), and the inability to grasp it is noble in relation to the noble one (شريف).\n\nHis description (وصفه) is subtler than His Essence (ذاته), and His Act (فعله) is subtler than His description.\nAnd He deposited the whole in my Essence (بذاتي), just as He deposited the meaning of the thing in its letter.\nThus, Creation (الخلق) is sought for a meaning, just as the Essence (ذات) of musk is sought from its fragrance.\n\nWere it not for what was deposited within me, which my reality (حقيقتي) necessitated and my path (طريقتي) reached, I would find no attainment of its drink nor any inclination toward its gnosis (معرفته). Therefore, it returns to me at the end, and for this reason, the leg of the compass returns to the starting point (نقطة البداية) when opening the circle (الدائرة) upon reaching the limit of its existence (غاية وجودها). Thus, the end of the matter is connected to its beginning, and its eternity (أبده) bends back upon its pre-eternity (أزله). There is nothing but continuous Being (وجود مستمر) and fixed, stable Witnessing (شهود ثابت مستقر). The path only lengthened due to the sight of the creature (رؤية المخلوق). If the servant (العبد) were to turn his face toward that which is next to him, without failing therein, he would look at the travelers (السالكين) when they arrive with an eye of despair—by God, what they did! Had they known their station (مكانهم), they would not have moved. But they were veiled by the duality (شفعية) of the realities (الحقائق) from the Oneness (وترية) of The Real, the Creator (الحق الخالق), by whom Allah created the earth and the paths (الطرائق). So they looked at the steps of the Names (مدارج الأسماء) and sought the ascents of the Night Journey (معارج الإسراء), imagining them to be the greatest station to seek and the highest state in which The Real (الحق تعالى) is desired and longed for. So they were journeyed upon the Buraq of sincerity and its cushions, and He verified them with what they witnessed of His signs and subtleties (لطائفه). This was because the gaze was northern (شمالية), and the innate disposition (الفطرة) upon the perfect origination (النشأة الكمالية) faces the point of the circle (نقطة الدائرة) in its original position. Thus, its core (مهجتها) is split: from the right side, it is veiled (منقبة), and from the western side, it is unveiled (سافرة). If it had unveiled itself from the right, it would have attained the station of establishment (مقام التمكين) in the witnessing of determination (مشاهدة التعيين) from its very first glance. O wonder at one who is in the highest of the high (أعلى عليين) yet imagines himself to be in the lowest of the low (أسفل سافلين)! <<أَعُوذُ بِاللَّهِ أَنْ أَكُونَ من الْجاهِلِينَ>> (I seek refuge in Allah from being among the ignorant). Thus, its north is the right hand of its director, and its standing in the place where it was found is the limit of its journey. If what I have hinted at is established and verified by the rational person (العاقل), and he knows that the return is to Him, then he has not departed from his station. But the poor wretch imagines the knocking and the opening (القرع والفتح) and says: Is there anything in opposition to narrowness (الضيق) and constraint (الحرج) except spaciousness (السعة) and relief (الشرح)? Then he recites this as a Quranic verse against the adversaries: <<فَمَنْ يُرِدِ الله أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلامِ ومن يُرِدْ أَنْ يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقاً حَرَجاً كَأَنَّما يَصَّعَّدُ في السَّماءِ>> (So whoever Allah wills to guide, He expands his breast to Islam; and whoever He wills to send astray, He makes his breast tight and constricted as if he were ascending into the sky). Just as relief (الشرح) only occurs after narrowness (الضيق), so too the desired object is only attained after traversing the path (سلوك الطريق). The poor wretch was heedless of attaining through inspiration (بالإلهام) what is only attained through reflection and proof (بالفكر والدليل) according to people of understanding and intellect (أهل النهي والأفهام). He was truthful in what he said, for he was looking with the northern eye. So, concede his state (حاله) to him, confirm his impossibility (محاله) for him, weaken his impossibility from him, and say to him: You must seek assistance if you wish to reach that from which you inevitably emerged. Conceal the station of dwelling (مقام المجاورة) from him, and magnify for him the reward of visiting, mutual visiting, and support. He will grieve upon reaching that from which he traveled, but he will rejoice in the secrets (الأسرار) he attained and became during his journey. Were it not that the Messenger (peace and blessings be upon him) sought the Ascension (المعراج), he would not have traveled, nor ascended to the heaven, nor descended. The affair of the Highest Assembly (الملإ الأعلى) and the signs of his Lord would have come to him in his place, just as the earth was folded up for him while he was in his resting place. But this is a Divine secret (سر إلهي), so let whoever wills deny it, because the origination (الإنشاء) does not grant it, and let whoever wills believe in it, because it encompasses all things (جامع للأشياء). When I reached this knowledge (العلم) which the intellect alone cannot attain, nor can the understanding fully acquire, he said: You have made me hear a strange secret (سرا غريبا) and unveiled to me a wondrous meaning (معنى عجيبا). I have not heard it from any saint (ولي) before you, nor have I seen anyone for whom these realities (الحقائق) were completed as they are for you, even though they are known to me and inscribed in my Essence (بذاتي مرقومة). They will become manifest to you when my curtains are lifted and you are informed of my signs. But tell me, what did He make you witness when He caused you to descend into His Sanctuary (حرمه) and informed you of His sacred precincts (حرمه)?\n\n### Witnessing the Scene of the Divine Pledge of Allegiance\n\nI said: Know, O eloquent one who does not speak, and O questioner about what he knows: When I reached the faith (الايمان) and descended upon Him in the Presence of Excellence (حضرة الإحسان), He caused me to descend into His Sanctuary (حرمه) and informed me of His sacred precincts (حرمه). He said: I only multiplied the rites (المناسك) out of desire for cohesion (التماسك). If you do not find Me here, you will find Me there. And if I am veiled from you in the gathering (جمع), I will disclose Myself to you in Mina. Furthermore, I have informed you in more than one of your stations (مواقفك) and hinted to you more than once in some of your subtleties (لطائفك) that even if I am veiled, it is a Theophany (تجلي) that not every Gnostic (عارف) knows, except for one who has encompassed knowledge of the gnoses (المعارف) that I have encompassed. Do you not see that I disclose Myself to them on the Day of Resurrection (القيامة) in a form (الصورة) and sign (العلامة) that they do not recognize? They deny My Lordship (ربوبيتي) and seek refuge from it, and by it they seek refuge, but they do not perceive. Rather, they say to that Manifestation: We seek refuge in Allah from you, and we are waiting for our Lord. Then I emerge to them in the form that is established with them, and they acknowledge My Lordship and their own servitude (العبودية). Thus, they are worshipers of their sign (علامتهم) and witnesses of the form that has been established in their minds. Whoever among them says that he worshiped Me, his saying is false (زور) and he has contradicted Me. How can that be correct from him when he denied Me when I disclosed Myself to him? So, whoever restricts Me to one form rather than another, his imagination is that he is a servant, while the reality is hidden in his heart. He imagines that he worships Me while he denies Me. As for the Gnostics (العارفون), it is impossible for Me to be hidden from their sight, because they have vanished from creation (الخلق) and their secrets. Nothing appears to them except Me, and they comprehend none of the existents except My Names (أسمائي). Everything that appears and discloses itself to them, they say: You are the Most Glorified, the Highest (المسبح الأعلى). Thus, they are not equal. People are between the absent and the present, and both are one thing to them. When I heard his speech and understood his hint and his information, a jealous one (غيور) drew me to Him and made me stand before Him.\n\n### Discourses of Instruction and Subtleties concerning the Secret of the Kaaba of Being and the Circumambulation\n\nHe extended the right hand, and I kissed it, and the form (الصورة) I longed for reached me. He transformed for me into the form of Life (الحياة), and I transformed for him into the form of Death (الممات). The form sought to pledge allegiance (تبايع) to the form, but it said to it: You have not perfected the conduct (السيرة). And it withdrew its right hand from it and said to it: I have not known its essence (كنها) in the world of witnessing (عالم الشهادة). Then he transformed for me into the form of Sight (البصر), and I transformed for him into the form of one who is blind to vision (عمي عن النظر). This was after the completion of one circuit (شوط) and the imagination of breaking a condition (نقض شرط). The form sought to pledge allegiance to the form, but it said to it the aforementioned saying. Then he transformed for me into the form of Universal Knowledge (العلم الأعم), and I transformed for him into the form of Utter Ignorance (الجهل الأتم). The form sought to pledge allegiance to the form, but it said to it the famous saying. Then he transformed for me into the form of Hearing the Call (سماع النداء), and I transformed for him into the form of Deafness to the Supplication (الصمم عن الدعاء). The form sought to pledge allegiance to the form, but The Real (الحق) lowered His curtains between them. Then he transformed for me into the form of Address (الخطاب), and I transformed for him into the form of Muteness to the Reply (الخرس عن الجواب). The form sought to pledge allegiance to the form, but The Real sent forth the inscriptions and lines of the Tablet (رقوم اللوح وسطوره) between them. Then he transformed for me into the form of Will (الإرادة), and I transformed for him into the form of the Deficiency of Reality and Custom (قصور الحقيقة والعادة). The form sought to pledge allegiance to the form, but The Real poured forth His light and illumination (ضياءه ونوره) between them. Then he transformed for me into the form of Power and Capacity (القدرة والطاقة), and I transformed for him into the form of Incapacity and Need (العجز والفاقة). The form sought to pledge allegiance to the form, but The Real revealed the servant's shortcoming. When I saw that turning away and the failure to achieve the fulfillment of my hopes and purposes, I said: Did I turn away from You, and did You not fulfill Your covenant with me? He said to me: You turned away from yourself, O My servant. If you had kissed the Stone (الحجر) in every circuit, O circumambulator, My right hand would have accepted you here in these subtle forms (الصور اللطائف). For My House there is in the position of the Essence (الذات), and the circuits of the circumambulation are in the position of the Seven Attributes (السبع الصفات)—the Attributes of Perfection (صفات الكمال), not the Attributes of Majesty (صفات الجلال), because they are the attributes of connection (الاتصال) and separation (الانفصال) with you. So, seven circuits for seven attributes, and a standing House indicating the Essence (ذات). However, I caused it to descend into My couch and said to the common people: This is in the position of My Throne (عرشي) for you. And My Caliph (خليفتي) on earth is the one established upon it and encompassing it. Look at the King circumambulating with you and standing by your side. I looked at Him, and He returned to His Throne and became exalted above me by the loftiness of His bier. I smiled with joy and said extemporaneously:\n\nO Kaaba, around which the Messengers circumambulated, after the honored ones had circumambulated it.\nThen came after them a world, who circumambulated it, among the high and the low.\nHe caused it to descend as a similitude (مثلا) to His Throne (عرشه), and we are surrounding it, honored.\nIf the greatest one surrounding it says, \"I am better,\" do you hear?\nBy God, he came neither with a text nor brought us anything but what is unclear.\nIs that anything but the Light (النور) surrounded by their lights, while we are despised water (ماء مهين)?\nSo the thing was drawn to its like, and all of us are established servants before Him.\nWhy did they not see what they did not see: that they circumambulated what we circumambulated, and they are not clay?\nIf the subtlest among us were stripped bare, he would be established upon that which they surrounded as circumambulators.\nThey have aimed to be ignorant of the right of the one for whom Allah has subjugated the worlds.\nHow can they, when they know that I am the son of the one before whom they fell prostrate?\nAnd they confessed, after objecting to our father, that they were ignorant.\nAnd the person who refused became despairing (أبلس), and he was among those who deny grace.\nThey have aimed, they have aimed, that they are protected from the error of the erring ones.\n\nI said: Then I turned the face of my heart away from him and turned toward my Lord. He said to me: You championed your father; My blessing has settled in you. Listen to the station (منزلة) of the one you praised and the good you put forth before her. And where is your station compared to the stations of the Archangels (الملائكة المقربين)? May the blessings of Allah be upon you and upon them all. This Kaaba of Mine is the heart of Being (قلب الوجود), and My Throne (عرشي) is a limited body (جسم محدود) for this heart. Neither of them encompassed Me, nor did they inform about Me with what I informed about them. My House that encompassed Me is your intended heart (قلبك المقصود), deposited in your witnessed body (جسدك المشهود). The circumambulators of your heart are the secrets (الأسرار); they are in the position of your bodies when they circumambulate these stones. The surrounding circumambulators of Our encompassing Throne (عرشنا المحيط) are like those who circumambulate the world of delineation (عالم التخطيط) from you. Just as the body is lower in rank than your simple heart, so too is the Kaaba compared to the encompassing Throne. The circumambulators of the Kaaba are in the position of the circumambulators of your heart, due to their shared quality of 'heartness' (القلبية). And the circumambulators of your body are like the circumambulators of the Throne, due to their shared quality of 'encompassment' (الإحاطية). Just as the world of secrets (عالم الأسرار) circumambulating the heart that encompassed Me is a nobler and higher station than others, so too are you, by the description of honor and mastery, more worthy than those who circumambulate the encompassing Throne. For you are the circumambulators of the heart of the world's Being (قلب وجود العالم), so you are in the position of the secrets of the scholars (أسرار العلماء), while they are the circumambulators of the body of the world, so they are in the position of water and air. How can you be equal? Nothing encompassed Me but you, and I did not disclose Myself in a form of perfection except in your meaning. So, know the measure of the high honor I have bestowed upon you. After this, I am the Great, the Exalted (الكبير المتعالي). No limit defines Me, nor does the master or the servant know Me. Divinity (الألوهة) is sanctified, transcending comprehension, and too exalted in its station to be associated with partners. You are the 'I' (الأنا) and I am the 'I' (أنا). So do not seek Me within yourself, lest you be wearied, nor from outside, lest you be deprived of bliss. Nor abandon seeking Me, lest you be wretched. So seek Me until you find Me, and thus ascend. But be courteous in your seeking, and be present when you begin your doctrine, and distinguish between Me and you, for you do not witness Me; rather, you witness your own essence (عينك). So stand in the attribute of partnership, otherwise be a servant and say: The inability to grasp comprehension is comprehension (العجز عن درك الإدراك إدراك). In doing so, you will join the Ancient One (عتيق) and become the honored Sincere One (الصديقا). Then He said to me: Depart from My Presence (حضرتي).\n\nFor one like you is not fit for My service. I departed, banished. The present ones cried out, and He said: <<ذَرْنِي ومن خَلَقْتُ وَحِيداً>> (Leave Me and him whom I created alone). Then He said: Bring him back. So I was brought back and found myself before Him instantly, as if I had never left the carpet of His Witnessing (بساط شهوده) nor departed from the Presence of His Being (حضرة وجوده). He said: How can one who is unfit for My service enter My Presence? Had you not possessed the sanctity (الحرمة) that necessitates service, the Presence would not have accepted you and would have cast you out at the first glance. But here you are in it, and you have seen from your proof and its concealment what increases your reverence and your modesty upon its disclosure. Then He said: Why did you not ask Me when I commanded your expulsion and your return upon your ascension (معراجك)? I know you are a man of argument and tongue. How quickly you forgot, O human! I said: The greatness of witnessing Your Essence (مشاهدة ذاتك) overwhelmed me, and I fell into despair when You withdrew the right hand of the pledge (يمين البيعة) in Your Theophanies (تجلياتك). I kept repeating the gaze, wondering what news had occurred in the Unseen (الغيب). Had You turned to me at that moment, You would have known that the affliction came from me. But the Presence grants that nothing but itself is witnessed, and that no face other than its face is looked upon. He said: You have spoken truly, O Muhammad. So be established in the Singular Station (المقام الأوحد), and beware of multiplicity (العدد), for in it lies eternal ruin. Then followed discourses and tidings which I shall mention in the chapter on the Hajj and Mecca, along with a collection of secrets.\n\n### (Connection) Entering the Kaaba of the Hijr: The House Transcendent of the Veil\n\nThen the faithful confidant (النجي الوفي) said: O noblest saint (ولي) and chosen one (صفي), you have not mentioned anything to me except that I know it, and it is inscribed and established in my Essence (بذاتي مسطر قائم). I said: You have made me yearn to look toward you from yourself so that I may speak about you. He said: Yes, O strange arrival (الغريب الوارد) and purposeful seeker (الطالب القاصد), enter with me the Kaaba of the Hijr (كعبة الحجر), for it is the House transcendent of the veil and the curtain (الحجاب والستر). It is the entrance of the Gnostics (العارفين), and in it is the rest of the circumambulators. So I entered the House of the Hijr (بيت الحجر) with him immediately, and he placed his hand on my chest and said: I am the seventh in the level (مرتبة) of encompassing the Cosmos (الكون) and the secrets of the existence of 'essence' (العين) and 'where' (الأين). The Real (الحق) brought me into existence as a piece of simple, airy light (قطعة نور حوائي ساذجة) and made me mingled with the universals (للكليات ممازجة). While I was looking forward to what would be cast upon me or descend upon me, behold, the Supreme Pen Knowledge (العلم القلمي الأعلى) descended upon my Essence (بذاتي) from its high stations, riding a steed standing on three legs. It bowed its head toward my Essence, and the lights and darknesses spread forth, and it breathed into my spirit all the created things (الكائنات). It split my earth and my heaven and informed me of all my Names (أسمائي). So I knew myself and others, and I distinguished between my evil and my good, and I separated what is between my Creator and my realities (حقائقي). Then that Angel departed from me and said: Know that you are the Presence of the King (حضرة الملك). So I prepared myself for the descent and the arrival of the Messenger. The angels (الأملاك) rushed toward me, and the celestial spheres (الأفلاك) revolved around me, and all were kissing my right hand and turning toward my Presence. I did not see an angel descend, nor an angel move away from standing before me. I glanced at some of my sides and saw the form of Pre-eternity (صورة الأزل). So I knew that descent was impossible, and I remained established upon that state. I informed some of the elite (الخاصة) of what I witnessed and revealed to them what I found within myself. I am the flourishing garden (الروضة اليانعة) and the comprehensive fruit (الثمرة الجامعة). So lift my curtains and read what my lines contain. Whatever you find in me, place it in your book and address all your beloved ones (أحبابك) with it. So I lifted his curtains and gazed at his inscription, and he revealed to my eye the light deposited within him, containing the hidden knowledge (العلم المكنون) that he holds. The first line I read, and the first secret from that line I learned, is what I shall now mention in this Second Chapter. And Allah guides to Knowledge and to a straight path (إِلى‏ طَرِيقٍ مُسْتَقِيمٍ).",
    "ur": "(پہلا باب) روح کی معرفت میں\n\nجس کی نشوونما کی تفصیل سے میں نے وہ کچھ لیا جو اس کتاب میں لکھا ہے، اور جو راز میرے اور اس کے درمیان تھے، ان میں سے یہ نظم ہے:\n\n> میں نے طواف کے وقت کہا: میں کیسے طواف کروں؟ *** جبکہ وہ (بیت) ہمارے راز کے ادراک سے محروم ہے۔\n>\n> یہ ایک جماد (بے جان) ہے، غیر عاقل ہے، میری حرکات کو کیا سمجھے گا؟ *** کہا گیا: تم ہی حیران اور پریشان ہو۔\n>\n> گھر کو دیکھو، اس کا نور چمک رہا ہے *** ان قلوب کے لیے جو پاک ہو چکے ہیں، یہ ان پر منکشف ہے۔\n>\n> میں نے اسے ذات حق (الحق) کے نور سے بغیر کسی حجاب کے دیکھا *** تو اس کا بلند اور شاندار راز ظاہر ہو گیا۔\n>\n> اور میرے جلال کے افق سے اس کے لیے ظہور الٰہی (التجلی) ہوا *** صدق کا چاند جسے کبھی گہن نہیں لگا۔\n>\n> اگر تم ولی کو دیکھو جب وہ اسے دیکھتا ہے *** تو تم کہو گے کہ وہ اس میں مدہوش اور بے قرار ہے۔\n>\n> وہ میرے دائیں ہاتھ کی سیاہی میں راز کو چومتا ہے *** کیسا راز ہے، کاش وہ معروف ہوتا۔\n>\n> اس کی ذات سے ناواقفیت کی وجہ سے کہا گیا کہ وہ کثیف ہے *** ایک قوم کے نزدیک، اور ایک قوم کے نزدیک لطیف ہے۔\n>\n> اس نے مجھ سے کہا جب میں نے پوچھا کہ انہوں نے اسے کیوں نہ پہچانا؟ *** شریف کو صرف شریف ہی پہچانتا ہے۔\n>\n> انہوں نے اسے پہچانا اور ایک زمانے تک اس کے ساتھ رہے *** تو رحیم و رؤف (الرحيم الرءوف) نے انہیں اپنا لیا۔\n>\n> اور وہ استقامت پر قائم رہے، پس ان میں کبھی نہیں دیکھا جاتا *** کہ وہ اس کی ذات کے طواف سے انحراف کریں۔\n>\n> اٹھو اور میری طرف سے میرے گھر کے مجاور کو بشارت دو *** کہ اسے امان ہے، اس کے پاس کوئی خوف نہیں۔\n>\n> اگر وہ میری ملاقات کی خوشی میں مر جائیں *** یا زندہ رہیں تو ان کا لباس پاکیزہ ہے۔\n\n### [فوت شدہ، گویا، خاموش جوان (الفتى الفائت المتكلم الصامت)]\n\nاے میرے جگری دوست (الولي الحميم) اور اے میرے معزز برگزیدہ (الصفي الكريم)! جان لو کہ جب میں برکات کی جگہ اور روحانی سکون اور حرکات کے معدن، مکہ پہنچا، اور وہاں میرا جو معاملہ ہوا، تو میں بعض اوقات اس کے بیت عتیق کا طواف کر رہا تھا۔ میں طواف کر رہا تھا، تسبیح، تمجید، تکبیر اور تہلیل کر رہا تھا، کبھی حجر اسود کو چومتا اور استلام کرتا، اور کبھی ملتزم سے چمٹتا، اسی اثنا میں، حجر اسود کے پاس میری ملاقات فوت شدہ، گویا، خاموش جوان (الفتى الفائت المتكلم الصامت) سے ہوئی، جو نہ زندہ ہے نہ مردہ، مرکب بھی ہے اور بسیط بھی، محیط بھی ہے اور محاط بھی۔ جب میں نے اسے بیت اللہ کا طواف کرتے دیکھا، جیسے کوئی زندہ کسی مردہ کا طواف کرتا ہے، تو میں نے اس کی حقیقت اور اس کے مجاز کو پہچان لیا، اور جان لیا کہ بیت اللہ کا طواف جنازے کی نماز کی مانند ہے۔ اور جب میں نے زندہ کو مردوں کا طواف کرتے دیکھا تو میں نے اس مذکورہ جوان کو وہ اشعار سنائے جو تم سنتے ہو:\n\n> اور جب میں نے دیکھا کہ بیت اللہ کی ذات کا طواف کر رہے ہیں *** ایسے اشخاص جن کے لیے شریعت کا راز غیب ہے۔\n>\n> اور اس کا طواف ایسی قوم نے کیا جو خود شریعت اور عقل ہیں *** اور وہ کشف (الکشف) کی آنکھ کا سرمہ ہیں، وہ اس سے اندھے نہیں۔\n>\n> مجھے تعجب ہوا ایک مردہ پر جس کا طواف ایک زندہ کر رہا ہے *** جو عزیز ہے، زمانے میں یکتا ہے، اس جیسا کوئی نہیں۔\n>\n> وہ ہمارے لیے اپنے جلال کی ذات کے نور سے ظاہر ہوا *** اور وہ فرشتوں میں سے نہیں بلکہ انسانوں میں سے ہے۔\n>\n> مجھے یقین ہو گیا کہ یہ معاملہ غیب ہے اور یہ کہ *** کشف (الکشف) اور تحقیق کے نزدیک وہ زندہ اور مرئی ہے۔\n\nمیں نے کہا: جب یہ اشعار مجھ سے صادر ہوئے اور میں نے اس کے مکرم گھر کو ایک پہلو سے مردوں کے ساتھ لاحق کیا، تو ایک قاہر نے مجھے مجھ سے اچک لیا اور ایک روکنے والے، ڈانٹنے والے کی بات کہی: فوت ہونے سے پہلے بیت اللہ کے راز کو دیکھو، تم اسے طواف کرنے والوں اور اس کے پتھروں کا طواف کرنے والوں کے ساتھ چمکتا ہوا پاؤ گے، وہ اپنے پردوں اور حجابوں کے پیچھے سے انہیں دیکھ رہا ہے۔ میں نے اسے ویسا ہی چمکتا ہوا دیکھا جیسا اس نے کہا تھا، تو میں نے اس کے سامنے اپنے قول کو واضح کیا اور عالم مثال میں فی البور یہ اشعار سنائے:\n\n> میں دیکھتا ہوں کہ بیت اللہ اپنے گرد طواف کرنے والوں سے چمک رہا ہے *** اور یہ چمک کسی حکیم کے سوا نہیں جس کا یہ فعل ہے۔\n>\n> اور یہ تو جماد ہے، نہ محسوس کرتا ہے نہ دکھائی دیتا ہے *** اور نہ اس کے پاس عقل ہے اور نہ اس کے پاس سماعت ہے۔\n>\n> تو اس شخص نے کہا: یہ ہماری اطاعت ہے *** جسے شریعت نے ہمارے لیے زندگی بھر ثابت کیا ہے۔\n>\n> تو میں نے اس سے کہا: یہ تمہارا پیغام ہے، پس اس بات کو سنو *** جو اس شخص کا قول ہے جس کے لیے حکمت نے وضع کو ظاہر کیا۔\n>\n> میں نے ایک جماد کو دیکھا جس کی ذات میں کوئی زندگی نہیں *** اور نہ وہ نقصان پہنچا سکتا ہے اور نہ فائدہ دے سکتا ہے۔\n>\n> لیکن قلب کی آنکھ کے لیے اس میں مناظر ہیں *** بشرطیکہ آنکھ میں کوئی کمزوری یا دراڑ نہ ہو۔\n>\n> وہ اسے عزیز دیکھتا ہے اگر وہ اپنی ذات میں ظہور الٰہی (التجلی) کرے *** پس کسی مخلوق میں اسے اٹھانے کی وسعت نہیں۔\n>\n> پس تم ابو حفص تھے اور تم ہم پر تھے *** پس مجھ ہی سے ہے بڑا عطیہ، اور قبض و منع بھی مجھ ہی سے ہے۔\n\n### (وصل) [فوت شدہ، گویا، خاموش جوان (الفتى الفائت المتكلم الصامت) کا مرتبہ]\n\nپھر اس نے مجھے اس جوان کے مرتبے اور اس کے \"کہاں\" اور \"کب\" سے پاک ہونے پر مطلع کیا۔ جب میں نے اس کا مرتبہ اور اس کا مقام جان لیا، اور ہستی (الوجود) میں اس کے مقام اور اس کے احوال کا مشاہدہ کیا، تو میں نے اس کا دایاں ہاتھ چوما اور وحی کے پسینے سے اس کی پیشانی پونچھی، اور اس سے کہا: دیکھو کون تمہاری مجلس کا طالب ہے اور تمہاری انسیت کا خواہشمند ہے؟ تو اس نے اشارے اور رمز سے میری طرف اشارہ کیا کہ وہ اس پر فطرت کیا گیا ہے کہ وہ کسی سے بات نہ کرے مگر رمز کے ذریعے۔ اور اگر تم میرے رمز کو جان لو، اس کی تحقیق کر لو اور اسے سمجھ لو، تو تم جان لو گے کہ فصیحوں کی فصاحت اسے نہیں پا سکتی، اور اس کے نطق کو بلیغوں کی بلاغت نہیں پہنچ سکتی۔ میں نے اس سے کہا: اے بشارت دینے والے! یہ تو بہت بڑی خیر ہے۔ پس مجھے اپنے اصطلاح سے آگاہ کرو اور اپنی چابی کی حرکات کی کیفیت پر مجھے مطلع کرو، کیونکہ میں تمہارے ساتھ ہم کلامی چاہتا ہوں اور تمہاری مصاہرت کو پسند کرتا ہوں۔ کیونکہ تمہارے پاس کفو اور نظیر ہے، اور وہ تمہاری ذات میں نازل ہونے والا امیر ہے۔ اور اگر تمہاری کوئی ظاہری حقیقت نہ ہوتی تو کوئی چمکتا ہوا چہرہ تمہاری طرف متوجہ نہ ہوتا۔ تو اس نے اشارہ کیا، پس میں نے جان لیا اور اس کے جمال کی حقیقت مجھ پر واضح ہو گئی، تو میں مدہوش ہو گیا اور میرے ہاتھ پاؤں ڈھیلے پڑ گئے اور اسی وقت اس نے مجھ پر غلبہ پا لیا۔ جب میں اس غشی سے بیدار ہوا اور خوف (الخشیۃ) سے میرے اعضاء کانپ اٹھے، تو اس نے جان لیا کہ اس کی معرفت (المعرفۃ) حاصل ہو چکی ہے، اور اس نے اپنی سیر کی لاٹھی پھینک دی اور اتر آیا۔ پس اس کا حال اس کے مطابق تھا جو انبیاء لے کر آئے اور امین فرشتے نازل ہوئے: إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ (اللہ کے بندوں میں سے صرف علماء ہی اس سے ڈرتے ہیں) [فاطر: 28]۔ پس اس نے اسے دلیل بنایا اور اس کے ذریعے حاصل ہونے والے علم کی معرفت کا راستہ اختیار کیا۔ میں نے اس سے کہا: مجھے اپنے کچھ رازوں پر مطلع کرو تاکہ میں تمہارے علماء میں شامل ہو جاؤں۔ اس نے کہا: میری نشوونما کی تفصیلات اور میری ہیئت کی ترتیب میں دیکھو، جو تم نے مجھ سے پوچھا ہے وہ اس میں لکھا ہوا (مرقوما) پاؤ گے۔ کیونکہ میں نہ کلام کرنے والا ہوں اور نہ کلیم۔ میرا علم میرے غیر سے نہیں ہے، اور میری ذات میرے اسماء سے مختلف نہیں ہے۔ پس میں ہی علم (العلم) ہوں، معلوم (المعلوم) ہوں اور علیم (العليم) ہوں، اور میں ہی حکمت (الحكمة) ہوں، محکم (المحكم) ہوں اور حکیم (الحكيم) ہوں۔ پھر اس نے مجھ سے کہا: میرے نقش قدم پر طواف کرو اور میرے چاند کے نور سے میری طرف دیکھو، تاکہ تم میری نشوونما سے وہ کچھ لے سکو جو تم اپنی کتاب میں لکھو اور اپنے کاتبوں کو املا کراؤ۔ اور مجھے ان لطائف سے آگاہ کرو جو ذات حق (الحق) نے تمہیں تمہارے طواف میں دکھائے، جو ہر طواف کرنے والے کو نہیں دکھائے جاتے، تاکہ میں تمہاری ہمت اور تمہارے معنی کو جانوں، اور میں تمہیں اس علم کی بنا پر یاد کروں جو میں نے تم میں وہاں پایا۔\n\n### [ہستی (الوجود) کے بعض رازوں اور ذات کے انکشاف کی طرف اشارے]\n\nمیں نے کہا: اے حاضر و مشہود (الشاهد المشهود)! میں تمہیں ہستی (الوجود) کے بعض رازوں سے آگاہ کرتا ہوں جو نور کی چادروں میں لپٹے ہوئے ہیں، اور پردوں کے پیچھے سے متحد العین ہیں، جنہیں ذات حق (الحق) نے ایک بلند حجاب اور ایک بچھا ہوا آسمان بنا کر پیدا کیا ہے۔ اور فعل ذات کے لیے لطیف ہے، اور شریف کے لیے اس کا ادراک نہ کرنا ہے۔\n\n> اس کی صفت اس کی ذات سے زیادہ لطیف ہے *** اور اس کا فعل اس کی صفت سے زیادہ لطیف ہے۔\n>\n> اور اس نے سب کو میری ذات میں ودیعت کر دیا، جیسے *** وہ کسی شے کے معنی کو اس کے حرف میں ودیعت کرتا ہے۔\n>\n> پس مخلوق معنی کے لیے مطلوب ہے، جیسے *** کستوری کی ذات اس کی خوشبو سے طلب کی جاتی ہے۔\n\nاور اگر وہ چیز جو میری حقیقت کا تقاضا تھا اور جس تک میرا طریقہ پہنچا، مجھ میں ودیعت نہ کی جاتی، تو میں اس کے مشرب کے لیے کوئی نیل نہ پاتا اور نہ اس کی معرفت (المعرفۃ) کی طرف کوئی میلان پاتا۔ اور اسی لیے میں انتہا پر اس کی طرف لوٹتا ہوں، اور اسی لیے پرکار کا فخذ دائرے کو کھولنے میں، جب وہ اپنے وجود کی انتہا کو پہنچتا ہے، تو نقطہ آغاز کی طرف واپس آتا ہے۔ پس آخری امر پہلے سے جڑ گیا، اور اس کا ابد اس کے ازل پر پلٹ آیا۔ پس ہستی (الوجود) کے سوا کچھ نہیں جو مسلسل ہے، اور شہود (الشہود) کے سوا کچھ نہیں جو ثابت اور مستقر ہے۔ اور راستہ صرف مخلوق کو دیکھنے کی وجہ سے لمبا ہوا ہے۔ اگر بندہ اپنا رخ اس کی طرف پھیر لے جو اس کے قریب ہے، بغیر اس میں خلل ڈالے، تو وہ سالکین کو جب وہ پہنچتے ہیں تو افسوس کی نگاہ سے دیکھے گا، خدا کی قسم! انہوں نے کیا کیا! اور اگر وہ اپنے مقام کو جانتے تو وہاں سے حرکت نہ کرتے۔ لیکن وہ خالق ذات حق (الحق الخالق) کی وتریت (یکتائی) سے حقائق کی شفعیت (دوئی) کے پردے میں چھپ گئے، جس سے اللہ نے زمین اور طریقوں کو پیدا کیا۔ پس انہوں نے اسماء کی سیڑھیوں کو دیکھا اور معراج کی بلندیوں کو طلب کیا، اور انہیں سب سے بڑا مطلوب مقام اور سب سے اعلیٰ حالت سمجھا جس میں ذات حق (الحق) کی طرف رغبت کی جاتی ہے۔ پس انہیں صدق کے براق اور اس کے رفارف پر سیر کرائی گئی، اور انہیں ان نشانیوں اور لطائف سے محقق کیا گیا جن کا انہوں نے مشاہدہ کیا۔ اور یہ اس لیے ہوا کہ نگاہ شمالی تھی، اور فطرت کمالی نشوونما پر تھی، جو اصل وضع میں دائرے کے نقطے کا سامنا کرتی ہے۔ پس اس نے اپنے دل کو دائیں جانب سے منقبت (فضیلت) اور مغربی جانب سے سافرہ (بے پردہ) کر دیا۔ اگر وہ دائیں طرف سے بے پردہ ہوتی تو پہلی ہی نظر میں تعین کے مشاہدے میں تمکین کا مقام حاصل کر لیتی۔ اور مجھے اس شخص پر تعجب ہے جو اعلیٰ علیین میں ہے اور یہ گمان کرتا ہے کہ وہ اسفل سافلین میں ہے! أَعُوذُ بِاللَّهِ أَنْ أَكُونَ من الْجاهِلِينَ (میں اللہ کی پناہ مانگتا ہوں کہ میں جاہلوں میں سے ہو جاؤں) [بقرہ: 67]۔ پس اس کا شمال ہی اس کے چلانے والے کا یمین ہے، اور اس کا اپنے مقام پر ٹھہرنا جہاں وہ پایا گیا، اس کی سیر کی انتہا ہے۔ پس جب عاقل کے نزدیک وہ بات ثابت ہو جائے جس کی طرف میں نے اشارہ کیا اور یہ صحیح ہو جائے اور وہ جان لے کہ اسی کی طرف لوٹنا ہے، تو وہ اپنے مقام سے نہیں ہٹے گا۔ لیکن مسکین قرع (کھٹکھٹانے) اور فتح کا گمان کرتا ہے اور کہتا ہے: کیا تنگی اور حرج کے مقابلے میں وسعت اور شرح نہیں ہے؟ پھر وہ اس پر مخالفین کے سامنے قرآن کی تلاوت کرتا ہے: فَمَنْ يُرِدِ الله أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلامِ ومن يُرِدْ أَنْ يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقاً حَرَجاً كَأَنَّما يَصَّعَّدُ في السَّماءِ (پس جسے اللہ ہدایت دینا چاہے، وہ اس کا سینہ اسلام کے لیے کھول دیتا ہے، اور جسے گمراہ کرنا چاہے، وہ اس کا سینہ تنگ، نہایت تنگ کر دیتا ہے، گویا وہ آسمان میں چڑھ رہا ہو) [انعام: 125]۔ پس جیسے شرح تنگی کے بعد ہی ہوتی ہے، اسی طرح مطلوب بھی راستہ طے کرنے کے بعد ہی حاصل ہوتا ہے۔ اور مسکین اس چیز کے حصول سے غافل رہا جو اسے الہام سے حاصل ہوئی، جو اہل عقل و فہم کے نزدیک فکر اور دلیل کے بغیر حاصل نہیں ہوتی۔ اور اس نے جو کہا اس میں سچ کہا، کیونکہ وہ شمالی آنکھ سے دیکھ رہا ہے۔ پس تم اس کے حال کو تسلیم کرو اور اس کے محال کو ثابت کرو، اور اس کے محال کو کمزور کرو، اور اس سے کہو: اگر تم وہاں پہنچنا چاہتے ہو جہاں سے تم نکلے ہو تو تمہیں استعانت کی ضرورت ہے، اس میں کوئی شک نہیں۔ اور اس سے مجاورت کے مقام کو چھپاؤ، اور اس کے لیے زیارت اور ملاقات کے اجر کو بڑا کرو۔ پس وہ اس مقام پر پہنچ کر غمگین ہو گا جہاں سے اس نے سفر شروع کیا تھا، اور وہ ان رازوں پر خوش ہو گا جو اسے راستے میں حاصل ہوئے اور بن گئے۔ اور اگر رسول صلی اللہ علیہ وسلم نے معراج کی طلب نہ کی ہوتی تو نہ وہ سفر کرتے اور نہ آسمان پر چڑھتے اور نہ اترتے۔ اور ان کے پاس ملأ اعلیٰ کا معاملہ اور ان کے رب کی نشانیاں ان کے مقام پر ہی آتیں، جیسے ان کے لیے زمین لپیٹ دی گئی جب وہ اپنے بستر پر تھے۔ لیکن یہ ایک الٰہی راز ہے تاکہ جو چاہے اس کا انکار کرے، کیونکہ وہ اسے انشاء نہیں دیتا، اور جو چاہے اس پر ایمان لائے، کیونکہ وہ اشیاء کو جمع کرنے والا ہے۔ جب میں اس علم پر پہنچا جسے عقل اکیلے نہیں پا سکتی اور نہ فہم اسے پوری طرح حاصل کر سکتا ہے، تو اس نے کہا: تم نے مجھے ایک عجیب راز سنایا اور ایک حیرت انگیز معنی مجھ پر منکشف کیا، جو میں نے تم سے پہلے کسی ولی سے نہیں سنا، اور نہ میں نے کسی کو دیکھا جس کے لیے تم جیسی یہ حقائق مکمل کی گئی ہوں۔ حالانکہ یہ میرے نزدیک معلوم ہیں اور میری ذات میں لکھی ہوئی (مرقومة) ہیں۔ یہ تمہارے لیے اس وقت ظاہر ہوں گی جب تم میرے پردے اٹھاؤ گے اور میرے اشاروں پر مطلع ہو گے۔ لیکن مجھے بتاؤ کہ جب ذات حق (الحق) نے تمہیں اپنے حرم میں اتارا اور تمہیں اپنے حرم پر مطلع کیا تو اس نے تمہیں کیا دکھایا؟\n\n### «بیعت الٰہیہ کے مشہد کا مشاہدہ»\n\nمیں نے کہا: اے فصیح جو کلام نہیں کرتا، اور اے اس چیز کے بارے میں پوچھنے والے جسے تم جانتے ہو! جب میں ایمان کے مقام پر پہنچا اور احسان کی بارگاہ میں اترا، تو اس نے مجھے اپنے حرم میں اتارا اور اپنے حرم پر مطلع کیا، اور کہا: میں نے مناسک کو صرف باہمی تعلق (تماسک) کی رغبت میں زیادہ کیا ہے۔ اگر تم مجھے یہاں نہ پاؤ تو وہاں پاؤ گے، اور اگر میں تم سے جمع میں چھپ جاؤں تو میں تمہارے لیے منیٰ میں ظہور الٰہی (التجلی) کروں گا۔ حالانکہ میں نے تمہیں تمہارے کئی مقامات پر آگاہ کیا ہے اور تمہارے بعض لطائف میں ایک سے زیادہ بار تمہاری طرف اشارہ کیا ہے کہ اگرچہ میں چھپ جاتا ہوں، لیکن یہ ایک ظہور الٰہی (التجلی) ہے جسے ہر عارف نہیں پہچانتا، مگر وہ جو ان معارف کا علمی احاطہ کر چکا ہو جن کا میں نے احاطہ کیا ہے۔ کیا تم نہیں دیکھتے کہ میں قیامت کے دن ان کے لیے اس صورت کے علاوہ کسی اور صورت میں ظہور الٰہی (التجلی) کروں گا جسے وہ پہچانتے ہیں اور اس علامت کے علاوہ کسی اور علامت میں؟ تو وہ میری ربوبیت کا انکار کریں گے اور اس سے پناہ مانگیں گے، اور اسی کے ذریعے پناہ مانگیں گے، لیکن انہیں شعور نہیں ہو گا۔ بلکہ وہ اس ظہور الٰہی (التجلی) کرنے والے سے کہیں گے: ہم اللہ کی پناہ مانگتے ہیں تم سے، اور ہم اپنے رب کے منتظر ہیں۔ تب میں ان کے سامنے اس صورت میں ظاہر ہوں گا جو ان کے پاس ہے، تو وہ میرے لیے ربوبیت کا اقرار کریں گے اور اپنے لیے عبودیت کا۔ پس وہ اپنی علامت کے پجاری ہیں اور اس صورت کے مشاہدہ کرنے والے ہیں جو ان کے نزدیک مقرر ہو چکی ہے۔ پس ان میں سے جو کہتا ہے کہ اس نے میری عبادت کی، تو اس کا قول جھوٹ ہے اور اس نے مجھ سے جھگڑا کیا، اور یہ اس سے کیسے صحیح ہو سکتا ہے جبکہ جب میں نے اس کے لیے ظہور الٰہی (التجلی) کیا تو اس نے میرا انکار کر دیا؟ پس جس نے مجھے ایک صورت کے ساتھ مقید کیا دوسری صورت کے بغیر، تو اس کا گمان ہے کہ وہ عبادت کر رہا ہے، حالانکہ وہ حقیقت ممکنہ ہے جو اس کے دل میں پوشیدہ ہے۔ پس وہ گمان کرتا ہے کہ وہ میری عبادت کر رہا ہے، حالانکہ وہ میرا انکار کر رہا ہے۔ اور عارفین کے لیے یہ ممکن نہیں کہ میں ان کی نگاہوں سے چھپا رہوں، کیونکہ وہ مخلوق اور ان کے رازوں سے غائب ہو چکے ہیں۔ پس ان کے نزدیک میرے سوا کوئی ظاہر نہیں ہوتا، اور وہ موجودات میں میرے اسماء کے سوا کسی کو نہیں سمجھتے۔ پس ہر وہ شے جو ان کے لیے ظاہر ہوئی اور ظہور الٰہی (التجلی) کیا، انہوں نے کہا: تو ہی سب سے بلند تسبیح کیا گیا ہے۔ پس وہ برابر نہیں ہیں۔ پس لوگ غائب اور حاضر کے درمیان ہیں، اور دونوں ان کے نزدیک ایک ہی شے ہیں۔ جب میں نے اس کی بات سنی اور اس کے اشارے اور اس کے اعلان کو سمجھا، تو ایک غیور نے مجھے اپنی طرف کھینچ لیا اور مجھے اپنے سامنے کھڑا کر دیا۔\n\n(وجود اور طواف کے ذریعے کعبہ کے راز کے بارے میں تعلیم اور الطاف کی گفتگو)\n\nاور اس نے اپنا دایاں ہاتھ بڑھایا تو میں نے اسے چوما، اور وہ صورت مجھ سے مل گئی جس کا میں عاشق تھا۔ پس وہ میرے لیے حیات کی صورت میں بدل گیا، تو میں اس کے لیے ممات کی صورت میں بدل گیا۔ پس صورت نے صورت سے بیعت طلب کی، تو اس نے اس سے کہا: تم نے اچھی سیرت اختیار نہیں کی، اور اس نے اپنا دایاں ہاتھ اس سے کھینچ لیا اور اس سے کہا: میں نے عالم شہادت میں اس کی حقیقت کو نہیں پہچانا۔ پھر وہ میرے لیے بصر (بینائی) کی صورت میں بدل گیا، تو میں اس کے لیے اس شخص کی صورت میں بدل گیا جو نظر سے اندھا ہو گیا، اور یہ ایک چکر کے ختم ہونے اور ایک شرط کے ٹوٹنے کے گمان کے بعد ہوا۔ پس صورت نے صورت سے بیعت طلب کی، تو اس نے اس سے وہی بات کہی جو پہلے ذکر کی گئی۔ پھر وہ میرے لیے علم اعم (عام علم) کی صورت میں بدل گیا، تو میں اس کے لیے جہل اتم (کامل جہالت) کی صورت میں بدل گیا۔ پس صورت نے صورت سے بیعت طلب کی، تو اس نے اس سے وہی مشہور بات کہی۔ پھر وہ میرے لیے نداء (پکار) سننے کی صورت میں بدل گیا، تو میں اس کے لیے دعا سے بہرے پن کی صورت میں بدل گیا۔ پس صورت نے صورت سے بیعت طلب کی، تو ذات حق (الحق) نے ان دونوں کے درمیان اپنے پردے ڈال دیے۔ پھر وہ میرے لیے خطاب (گفتگو) کی صورت میں بدل گیا، تو میں اس کے لیے جواب سے گونگے پن کی صورت میں بدل گیا۔ پس صورت نے صورت سے بیعت طلب کی، تو ذات حق (الحق) نے ان دونوں کے درمیان لوح کی لکیریں اور سطریں بھیج دیں۔ پھر وہ میرے لیے ارادہ (خواہش) کی صورت میں بدل گیا، تو میں اس کے لیے حقیقت اور عادت کی کمی کی صورت میں بدل گیا۔ پس صورت نے صورت سے بیعت طلب کی، تو ذات حق (الحق) نے ان دونوں کے درمیان اپنا نور اور ضیاء بہا دیا۔ پھر وہ میرے لیے قدرت اور طاقت کی صورت میں بدل گیا، تو میں اس کے لیے عجز اور فاقہ کی صورت میں بدل گیا۔ پس صورت نے صورت سے بیعت طلب کی، تو ذات حق (الحق) نے بندے کے لیے اس کی کوتاہی ظاہر کر دی۔ جب میں نے یہ اعراض دیکھا اور میری امیدیں اور مقاصد پورے نہ ہوئے، تو میں نے کہا: تم نے مجھ پر شب خون کیوں مارا اور میرے عہد کو پورا کیوں نہیں کیا؟ تو اس نے مجھ سے کہا: تم نے خود پر شب خون مارا ہے، اے میرے بندے! اے طواف کرنے والے! اگر تم ہر چکر میں حجر اسود کو چومتے تو یہاں ان لطیف صورتوں میں میرے دائیں ہاتھ کو چوم لیتے۔ کیونکہ وہاں میرا گھر ذات (الذات) کے مقام پر ہے، اور طواف کے چکر سات صفات (الصفات) کے مقام پر ہیں، صفات کمال کے، نہ کہ صفات جلال کے، کیونکہ وہ تم سے اتصال اور انفصال کی صفات ہیں۔ پس سات چکر سات صفات کے لیے ہیں، اور ایک قائم گھر ذات (الذات) پر دلالت کرتا ہے۔ مگر یہ کہ میں نے اسے اپنے فرش میں اتارا اور عام لوگوں سے کہا: یہ تمہارے نزدیک میرے عرش کے مقام پر ہے، اور زمین میں میرا خلیفہ وہ ہے جو اس پر مستوی ہے اور اس کا احاطہ کیے ہوئے ہے۔ پس تم بادشاہ کو اپنے ساتھ طواف کرتے ہوئے اور اپنے پہلو میں کھڑا دیکھو۔ تو میں نے اس کی طرف دیکھا، تو وہ اپنے عرش پر واپس چلا گیا اور اپنے بلند تخت کی وجہ سے مجھ پر فخر کیا۔ تو میں خوشی سے مسکرایا اور فی البور کہا:\n\n> اے کعبہ جس کا طواف رسولوں نے کیا *** اس کے بعد جب مکرم لوگوں نے طواف کیا۔\n>\n> پھر ان کے بعد ایک عالم آیا *** انہوں نے اس کا طواف کیا، بلند اور پست کے درمیان۔\n>\n> اس نے اسے اپنے عرش کے لیے مثال بنا کر اتارا *** اور ہم اس کے گرد لپٹے ہوئے، مکرم ہیں۔\n>\n> اگر کوئی کہے کہ اس کا سب سے بڑا طواف کرنے والا *** میں ہوں، تو کیا تم سنتے ہو؟\n>\n> خدا کی قسم! وہ نہ کوئی نص لایا *** اور نہ ہمارے پاس آیا مگر اس کے ساتھ جو واضح نہیں۔\n>\n> کیا یہ نور کے سوا کچھ ہے جس کے گرد *** ان کے انوار لپٹے ہوئے ہیں، اور ہم حقیر پانی ہیں۔\n>\n> پس شے اپنی مثل کی طرف کھنچ گئی *** اور ہم سب اس کے نزدیک مضبوط بندے ہیں۔\n>\n> کیا انہوں نے نہیں دیکھا جو انہوں نے نہیں دیکھا کہ وہ *** اس چیز کا طواف کر رہے ہیں جس کا ہم نے طواف کیا، اور وہ مٹی نہیں۔\n>\n> اگر ہم میں سے لطیف ترین کو الگ کر دیا جائے *** تو وہ اس پر مستوی ہو جائے گا جس کا وہ طواف کر رہے ہیں۔\n>\n> انہوں نے یہ گمان کیا کہ وہ اس کے حق سے ناواقف ہیں *** جس کے لیے اللہ نے تمام جہانوں کو مسخر کیا۔\n>\n> یہ ان کے لیے کیسے ہو سکتا ہے جبکہ ان کا علم یہ ہے کہ میں *** اس کا بیٹا ہوں جس کے لیے وہ سجدہ ریز ہوئے۔\n>\n> اور انہوں نے ہمارے والد پر اعتراض کے بعد اعتراف کیا *** کہ وہ جاہل تھے۔\n>\n> اور وہ شخص جو انکار کر گیا وہ مایوس ہو گیا *** اور وہ فضل کا انکار کرنے والوں میں سے تھا۔\n>\n> انہوں نے گمان کیا، انہوں نے گمان کیا کہ وہ *** غلطی کرنے والوں کی غلطی سے محفوظ ہیں۔\n\nمیں نے کہا: پھر میں نے اپنا قلبی رخ اس سے پھیر لیا اور اپنے رب کی طرف متوجہ ہوا۔ تو اس نے مجھ سے کہا: تم نے اپنے والد کی مدد کی، میری برکت تم میں حلول کر گئی۔ اس شخص کا مرتبہ سنو جس کی تم نے تعریف کی اور جو خیر تم نے اس کے سامنے پیش کی، اور تمہارا مرتبہ مقرب فرشتوں کے مراتب سے کہاں ہے، اللہ کی صلوات ہو تم پر اور ان سب پر۔ یہ میری کعبہ وجود (الوجود) کا قلب ہے، اور میرا عرش اس قلب کے لیے ایک محدود جسم ہے۔ اور ان دونوں میں سے کسی نے بھی مجھے نہیں سمویا، اور نہ میں نے اپنے بارے میں اس طرح خبر دی جس طرح ان دونوں کے بارے میں خبر دی۔ اور میرا وہ گھر جو مجھے سمو سکتا ہے، وہ تمہارا مقصود قلب ہے جو تمہارے مشہود جسم میں ودیعت ہے۔ پس تمہارے قلب کا طواف کرنے والے راز ہیں، پس وہ تمہارے اجسام کے مقام پر ہیں جب وہ ان پتھروں کا طواف کرتے ہیں۔ پس ہمارے محیط عرش کا طواف کرنے والے طواف کرنے والے تمہاری طرف سے عالم تخطیط (نقشہ سازی) کا طواف کرنے والوں کی مانند ہیں۔ پس جیسے تمہارا جسم تمہارے بسیط قلب سے مرتبے میں کم ہے، اسی طرح کعبہ بھی محیط عرش کے ساتھ ہے۔ پس کعبہ کا طواف کرنے والے تمہارے قلب کا طواف کرنے والوں کے مقام پر ہیں، کیونکہ وہ قلبی ہونے میں شریک ہیں۔ اور تمہارے جسم کا طواف کرنے والے عرش کا طواف کرنے والوں کی مانند ہیں، کیونکہ وہ احاطہ کرنے کی صفت میں شریک ہیں۔ پس جیسے قلب کا طواف کرنے والے اسرار کا عالم دوسروں سے زیادہ بلند اور اعلیٰ ہے، اسی طرح تم شرف اور سیادت کی صفت کے ساتھ محیط عرش کا طواف کرنے والوں سے زیادہ اولیٰ ہو۔ کیونکہ تم عالم کے وجود کے قلب کا طواف کرنے والے ہو، پس تم علماء کے اسرار کے مقام پر ہو، اور وہ عالم کے جسم کا طواف کرنے والے ہیں، پس وہ پانی اور ہوا کے مقام پر ہیں۔ پس تم کیسے برابر ہو سکتے ہو؟ اور میرے سوا کسی نے مجھے نہیں سمویا، اور میں نے کمال کی صورت میں ظہور الٰہی (التجلی) نہیں کیا مگر تمہارے معنی میں۔ پس اس شرف کی قدر پہچانو جو میں نے تمہیں عطا کیا ہے، اور اس کے بعد میں ہی بڑا، بلند ذات (الکبیر المتعالی) ہوں۔ مجھے نہ حد محدود کر سکتی ہے اور نہ سید اور نہ بندہ مجھے پہچان سکتا ہے۔ الوہیت پاک ہے، پس وہ ادراک سے منزہ ہے، اور اپنے مرتبے میں شریک ہونے سے منزہ ہے۔ تم ہی \"انا\" (میں) ہو اور میں \"انا\" ہوں۔ پس مجھے اپنے اندر مت تلاش کرو کہ تم تھک جاؤ، اور نہ باہر سے، کہ تم خوش نہ ہو سکو، اور نہ میری طلب کو چھوڑو کہ تم بدبخت ہو جاؤ۔ پس مجھے تلاش کرو یہاں تک کہ تم مجھے پاؤ تو بلند ہو جاؤ۔ لیکن اپنی طلب میں ادب اختیار کرو اور اپنے مذہب میں شروع ہوتے وقت حاضر رہو، اور میرے اور اپنے درمیان تمیز کرو، کیونکہ تم میرا شہود (الشہود) نہیں کرتے، بلکہ تم اپنی آنکھ کا شہود کرتے ہو۔ پس اشتراک کی صفت میں ٹھہرو، ورنہ بندہ بنو اور کہو کہ ادراک کے ادراک سے عاجز ہونا ہی ادراک ہے۔ تم اس میں عتیق (قدیم) سے مل جاؤ گے اور مکرم صدیق بن جاؤ گے۔ پھر اس نے مجھ سے کہا: میری بارگاہ سے نکل جاؤ۔\n\nپس تمہارا جیسا میری خدمت کے لائق نہیں۔ تو میں دھتکارا ہوا نکل گیا، تو حاضرین نے شور مچایا، تو اس نے کہا: ذَرْنِي ومن خَلَقْتُ وَحِيداً (مجھے اور اس شخص کو چھوڑ دو جسے میں نے اکیلا پیدا کیا) [مدثر: 11]۔ پھر اس نے کہا: اسے واپس لاؤ۔ تو مجھے واپس لایا گیا اور میں اسی وقت اس کے سامنے موجود تھا، گویا میں اس کے شہود (الشہود) کے بساط سے ہٹا ہی نہیں اور اس کی ہستی (الوجود) کی بارگاہ سے نکلا ہی نہیں۔ اس نے کہا: میری بارگاہ میں وہ کیسے داخل ہو سکتا ہے جو میری خدمت کے لائق نہیں؟ اگر تمہارے پاس وہ حرمت نہ ہوتی جو خدمت کو واجب کرتی ہے، تو بارگاہ تمہیں قبول نہ کرتی اور پہلی ہی نظر میں تمہیں پھینک دیتی۔ اور اب تم اس میں ہو اور تم نے اپنی دلیل اور اس کے چھپنے کا وہ برہان دیکھا ہے جو تمہارے احترام میں اضافہ کرتا ہے اور اس کے ظہور الٰہی (التجلی) کے وقت تمہاری حیا میں اضافہ کرتا ہے۔ پھر اس نے کہا: تم نے مجھ سے کیوں نہیں پوچھا جب تمہیں نکالنے کا حکم دیا گیا اور تمہیں تمہاری معراج پر واپس لایا گیا؟ اور میں تمہیں حجت اور زبان والا جانتا ہوں۔ اے انسان! تم کتنی جلدی بھول گئے! میں نے کہا: تمہاری ذات کے عظیم مشاہدے نے مجھے مبہوت کر دیا، اور تمہارے ظہور الٰہی (التجلی) میں بیعت کا دایاں ہاتھ کھینچ لینے سے میرے ہاتھ پاؤں ڈھیلے پڑ گئے، اور میں بار بار یہ دیکھتا رہا کہ غیب میں کیا خبر آئی ہے۔ اگر تم اس وقت میری طرف متوجہ ہوتے تو تم جان لیتے کہ مجھ سے ہی مجھ پر یہ معاملہ آیا، لیکن بارگاہ یہ عطا کرتی ہے کہ اس کے سوا کسی کا شہود (الشہود) نہ کیا جائے اور اس کے چہرے کے سوا کسی اور چہرے کی طرف نہ دیکھا جائے۔ اس نے کہا: تم نے سچ کہا، اے محمد! پس مقام اوحد (الأوحد) میں ثابت قدم رہو، اور کثرت (العدد) سے بچو، کیونکہ اس میں ابدی ہلاکت ہے۔ پھر کچھ گفتگوئیں اور خبریں ہوئیں جن کا ذکر میں حج اور مکہ کے باب میں کچھ رازوں کے ساتھ کروں گا۔\n\n### (وصل) [حجر کی کعبہ میں داخل ہونا: وہ گھر جو پردے سے بلند ہے]\n\nپس وفادار رازدار (النجي الوفي) نے کہا: اے سب سے معزز ولی اور میرے برگزیدہ! تم نے میرے لیے کوئی ایسا معاملہ ذکر نہیں کیا جس کا میں عالم نہ ہوں اور جو میری ذات میں لکھا ہوا (مسطر قائم) نہ ہو۔ میں نے کہا: تم نے مجھے اپنی طرف سے تمہاری طرف متوجہ ہونے کا شوق دلایا ہے تاکہ میں تمہارے بارے میں خبر دوں۔ اس نے کہا: ہاں، اے وارد ہونے والے غریب اور قصد کرنے والے طالب! میرے ساتھ حجر کی کعبہ میں داخل ہو جاؤ، کیونکہ وہ حجاب اور پردے سے بلند گھر ہے، اور وہ عارفین کا داخل ہونے کا مقام ہے اور اس میں طواف کرنے والوں کے لیے راحت ہے۔ پس میں اسی وقت اس کے ساتھ حجر کے گھر میں داخل ہوا، اور اس نے اپنا ہاتھ میرے سینے پر رکھا اور کہا: میں کائنات اور عین و این (کہاں) کے وجود کے رازوں کے احاطہ کرنے کے مرتبے میں ساتواں ہوں۔ ذات حق (الحق) نے مجھے نور حوائی (ہوائی نور) کا ایک سادہ ٹکڑا بنا کر پیدا کیا، اور مجھے کلیات کے ساتھ ملا دیا۔ پس جب میں اس چیز کی طرف متوجہ تھا جو میرے پاس ڈالی جائے گی یا مجھ پر نازل ہو گی، تو اچانک قلم اعلیٰ (القلم الأعلى) کا علم اپنے بلند مقامات سے میری ذات پر نازل ہوا، جو تین پاؤں پر کھڑے گھوڑے پر سوار تھا۔ پس اس نے اپنا سر میری ذات کی طرف جھکایا، تو انوار اور ظلمات پھیل گئیں، اور اس نے میرے دل میں تمام کائنات (الکائنات) پھونک دیں۔ پس اس نے میری زمین اور میرے آسمان کو کھول دیا اور مجھے میرے تمام اسماء پر مطلع کیا۔ پس میں نے اپنے نفس اور اپنے غیر کو پہچانا، اور اپنے شر اور خیر کے درمیان تمیز کی، اور اپنے خالق اور اپنی حقائق کے درمیان تفصیل کی۔ پھر وہ فرشتہ مجھ سے واپس چلا گیا اور کہا: جان لو کہ تم بادشاہ کی بارگاہ ہو۔ پس میں نزول اور رسول کے ورود کے لیے تیار ہو گیا۔ پس فرشتے میری طرف دوڑے اور افلاک میرے گرد گھومے، اور سب میرے دائیں ہاتھ کو چومنے والے اور میری بارگاہ کی طرف متوجہ ہونے والے تھے۔ اور میں نے کسی فرشتے کو اترتے ہوئے نہیں دیکھا اور نہ کسی فرشتے کو اپنے سامنے کھڑے ہونے سے ہٹتے ہوئے دیکھا۔ اور میں نے اپنے بعض پہلوؤں میں جھانکا تو ازل کی صورت دیکھی۔ پس میں نے جان لیا کہ نزول محال ہے، تو میں اسی حال پر ثابت قدم رہا۔ اور میں نے بعض خاص لوگوں کو اس کا علم دیا جس کا میں نے مشاہدہ کیا اور انہیں اس پر مطلع کیا جو میں نے اپنے اندر پایا۔ پس میں ہی سرسبز و شاداب باغ (الروضة اليانعة) اور جامع پھل (الثمرة الجامعة) ہوں۔ پس میرے پردے اٹھاؤ اور میری سطروں میں جو کچھ ہے اسے پڑھو۔ پس جو کچھ تم مجھ میں پاؤ، اسے اپنی کتاب میں شامل کرو اور اپنے تمام دوستوں کو اس سے مخاطب کرو۔ پس میں نے اس کے پردے اٹھائے اور اس کی لکھی ہوئی چیز کو دیکھا، تو اس نے میری آنکھ کے لیے اپنا نور ظاہر کیا، جو اس میں پوشیدہ علم کو شامل کیے ہوئے ہے۔ پس پہلی سطر جو میں نے پڑھی اور اس سطر کا پہلا راز جو میں نے جانا، وہ ہے جسے میں اب اس دوسرے باب میں ذکر کروں گا۔ اور اللہ سبحانہ و تعالیٰ علم اور سیدھے راستے (طَرِيقٍ مُسْتَقِيمٍ) کی طرف ہدایت دیتا ہے۔",
    "fa": "(باب اول) در معرفت روح\n\nآنچه از تفصیل نشأت آن (روح) در این کتاب نگاشته‌ام و آنچه از اسرار میان من و آن بوده است، از جمله آن اسرار این نظم است:\n\n> گفتم هنگام طواف که چگونه طواف کنم *** در حالی که او از درک سرّ ما بازداشته شده است\n> حرکات من سنگی است بی‌عقل *** گفته شد: تویی حیران و سرگشته\n> بنگر به خانه (کعبه) که نورش می‌درخشد *** برای قلب‌هایی که پاک شده‌اند، آشکار است\n> آن را به واسطه حق (الحق) بدون حجاب نگریستم *** پس سرّ بلند و والای آن آشکار شد\n> و از افق جلال من بر آن قلب‌ها تجلی (التجلی) کرد *** ماه صدق که هرگز کسوفی بر آن عارض نشد\n> اگر ولی (الولی) را ببینی هنگامی که آن را می‌بیند *** می‌گویی که او شیفته و مشتاق است\n> سرّ را در سیاهی دست راستم می‌بوسد *** چه سرّی است اگر شناخته شود\n> ذاتش ناشناخته ماند، پس نزد قومی گفته شد کثیف است *** و نزد قومی دیگر لطیف است\n> هنگامی که گفتم چرا آن را نشناختند، به من گفت *** همانا شریف، شریف را می‌شناسد\n> او را شناختند و مدتی ملازمش شدند *** پس رحیم و رئوف (خداوند) سرپرستی آنان را بر عهده گرفت\n> و استقامت ورزیدند، پس هرگز در آنان دیده نمی‌شود *** انحرافی از طواف به ذات او\n> برخیز و از جانب من به مجاور خانه‌ام بشارت ده *** به امانی که در آن ترسی نیست\n> اگر بمیرند، شادی‌شان به دیدار من است *** و اگر زندگی کنند، جامه‌شان پاک است\n\n### [جوان از دست رفته، سخنگوی خاموش]\n\nبدان ای ولی (الولی) صمیمی و ای برگزیده گرامی، هنگامی که به مکه برکات و معدن آرامش‌های روحانی و حرکات رسیدم و آنچه در آنجا برایم مقدر بود، در برخی اوقات به طواف خانه عتیق (کعبه) پرداختم. در حالی که طواف می‌کردم و تسبیح و تمجید و تکبیر و تهلیل می‌گفتم، گاهی می‌بوسیدم و استلام می‌کردم و گاهی به ملتزم می‌چسبیدم، در آن هنگام که نزد حجرالأسود بودم، با جوان از دست رفته، سخنگوی خاموش، که نه زنده است و نه مرده، مرکب بسیط، احاطه شده و احاطه‌کننده، روبرو شدم. هنگامی که او را دیدم که به دور خانه طواف می‌کند، طواف زنده بر مرده، حقیقت و مجاز او را شناختم و دانستم که طواف به دور خانه مانند نماز بر جنازه است. و هنگامی که دیدم زنده بر گرد مردگان طواف می‌کند، ابیاتی را که می‌شنوی برای آن جوان خواندم:\n\n> و چون دیدم که به دور ذات خانه (کعبه) طواف می‌کنند *** اشخاصی که سرّ شریعت برایشان غیبی است\n> و قومی به دور آن طواف کردند که خود شریعت و عقل‌اند *** و سرمه چشم کشف (الکشف) هستند و کور نیستند\n> تعجب کردم از مرده‌ای که زنده‌ای به دورش طواف می‌کند *** عزیزی یگانه در روزگار که هیچ چیز مانند او نیست\n> از نور ذات محل تجلی‌اش بر ما تجلی (التجلی) کرد *** و او از فرشتگان نیست، بلکه انسانی است\n> یقین کردم که امر غیب است و همانا *** نزد کشف (الکشف) و تحقیق، زنده و دیدنی است\n\nگفتم: پس هنگامی که این ابیات از من صادر شد و خانه مکرم او را از جهتی در کنار مردگان قرار دادم، او مرا با ربایشی قاهرانه از خودم ربود و با سخنی بازدارنده و سرزنش‌گر به من گفت: به سرّ خانه (کعبه) بنگر پیش از آنکه از دست برود؛ آن را می‌یابی که به طواف‌کنندگان و کسانی که به دور سنگ‌هایش می‌گردند، می‌بالد، در حالی که از پشت پرده‌ها و حجاب‌هایش به آنان می‌نگرد. پس دیدم که همان‌گونه که گفت، می‌بالد. پس در سخن برایش آشکار ساختم و در عالم مثال به بداهه برایش خواندم:\n\n> می‌بینم که خانه به طواف‌کنندگان اطرافش می‌بالد *** و بالیدن جز از حکیمی که صنع دارد، نیست\n> و این جمادی است که حس نمی‌کند و دیده نمی‌شود *** و نه عقلی دارد و نه شنوایی\n> پس گفت: این شخص‌سازی است، این طاعتی است برای ما *** که شریعت در طول زندگی برای ما ثابت کرده است\n> پس به او گفتم: این ابلاغ توست، پس بشنو *** سخن کسی را که حکمت وضع برایش آشکار شده است\n> جمادی دیدم که در ذاتش حیاتی نیست *** و نه زیانی دارد و نه سودی\n> اما برای چشم قلب در آن مناظری است *** اگر در چشم ضعفی یا شکافی نباشد\n> آن را عزیز می‌بیند اگر به ذاتش تجلی (التجلی) کند *** پس هیچ مخلوقی توان حمل آن را ندارد\n> پس تو ابوحفص بودی و بر ما بودی *** پس بخشش فراوان و گرفتن و منع کردن از من است\n\n### (وصل) [منزلت جوان از دست رفته، سخنگوی خاموش]\n\nسپس او مرا بر منزلت آن جوان و پاکی او از «أین» (کجا) و «متی» (چه وقت) آگاه ساخت. هنگامی که منزلت و جایگاه او را شناختم و مقام او را در هستی (الوجود) و احوالش را مشاهده کردم، دست راستش را بوسیدم و عرق وحی را از پیشانی‌اش پاک کردم و به او گفتم: بنگر چه کسی طالب همنشینی و مشتاق انس گرفتن با توست. او با اشاره و رمزی پاسخ داد که سرشت او بر این نهاده شده که با هیچ کس جز به رمز سخن نگوید، و اگر رمز مرا بدانی و به آن تحقق یابی و بفهمی، خواهی دانست که فصاحت فصیحان به درک آن نمی‌رسد و بلاغت بلیغان به بیان آن نائل نمی‌شود. پس به او گفتم: ای بشارت‌دهنده، این خیر کثیری است. پس اصطلاح خود را به من بشناسان و مرا بر کیفیت حرکات کلیدت آگاه ساز، زیرا من خواهان شب‌نشینی با تو و دوستدار وصلت با تو هستم، چرا که کفو و نظیر نزد توست و اوست که در ذات تو فرود آمده و امیر است. و اگر تو را حقیقتی آشکار نبود، روی‌های شاداب و بینا به سوی تو نمی‌نگریستند. پس او اشاره کرد و من دانستم و حقیقت جمالش بر من آشکار شد، پس شیفته شدم و از خود بیخود گشتم و در همان لحظه بر من غلبه کرد. هنگامی که از غشوه به هوش آمدم و از خشیت لرزه بر اندامم افتاد، دانست که علم به او حاصل شده است، پس عصای سیرش را انداخت و فرود آمد. حال او بر آنچه اخبار آورده و فرشتگان امین نازل کرده‌اند، تلاوت شد: **إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ** (همانا از میان بندگان خدا، تنها دانایان از او می‌ترسند). پس آن را دلیلی قرار داد و آن را راهی برای معرفت (المعرفة) علمی که به واسطه او حاصل شده بود، برگزید. به او گفتم: مرا بر برخی از اسرارت آگاه ساز تا از جمله دانشمندان تو باشم. گفت: در جزئیات نشأت من و در ترتیب هیئت من بنگر، آنچه را که از من خواستی، در آن نگاشته شده می‌یابی، زیرا من نه سخنگو هستم و نه کلیم. علم من غیر از من نیست و ذات من با اسم‌هایم مغایرت ندارد. پس من علم و معلوم و علیم هستم، و من حکمت و محکم و حکیم هستم. سپس به من گفت: بر اثر من طواف کن و با نور ماه من به من بنگر تا از نشأت من آنچه را که در کتابت می‌نگاری و بر کاتبت املا می‌کنی، برگیری. و مرا از لطایفی که حق (الحق) در طوافت بر تو شهود (الشهود) کرده است، آگاه ساز، لطایفی که هر طواف‌کننده‌ای آن را شهود نمی‌کند، تا همت و معنای تو را بشناسم و تو را بر اساس آنچه در آنجا از تو دانستم، یاد کنم.\n\n### [اشاراتی به برخی اسرار هستی (الوجود) و کشف ذاتیت]\n\nپس گفتم: ای شاهد مشهود، من تو را به برخی از اسرار هستی (الوجود) که بر من شهود (الشهود) کرده است، آگاه می‌سازم؛ اسراری که در پرده‌های نور آویزان‌اند و از پشت پرده‌هایی که حق (الحق) آن‌ها را حجابی برافراشته و آسمانی نهاده شده ایجاد کرده است، متحدالعین هستند. و فعل نسبت به ذات لطیف است و به دلیل عدم درک آن بر شریف است.\n\n> پس وصف او لطیف‌تر از ذات اوست *** و فعل او لطیف‌تر از وصف اوست\n> و همه را در ذات من به ودیعه نهاد، همان‌گونه که *** معنای شیء را در حرفش به ودیعه نهاد\n> پس خلق برای معنایی مطلوب است، همان‌گونه که *** ذات مشک از بوی آن طلب می‌شود\n\nو اگر آنچه در من به ودیعه نهاده شده، مقتضای حقیقت من نبود و طریقت من به آن نمی‌رسید، برای نوشیدن آن نه دستیابی می‌یافتم و نه میلی به معرفت (المعرفة) آن. و به همین دلیل است که در نهایت به من باز می‌گردد، و به همین دلیل است که پای پرگار در گشودن دایره، هنگام رسیدن به غایت هستی (الوجود) خود، به نقطه آغاز باز می‌گردد. پس آخر امر به اولش پیوند خورد و ابدش بر ازلش عطف شد. پس جز هستی (الوجود) مستمر و شهود (الشهود) ثابت و پایدار نیست. و همانا راه طولانی شد به خاطر دیدن مخلوق. پس اگر بنده روی خود را به سوی آنکه در کنار اوست، بدون آنکه در آن خللی وارد کند، برگرداند، به سالکان هنگامی که می‌رسند، با چشمی می‌نگرد که: به خدا سوگند چه کار بدی کردند! و اگر جایگاه خود را می‌دانستند، از آن منتقل نمی‌شدند. اما به واسطه زوجیت حقایق، از فردیت حق (الحق) خالق که خداوند زمین و طریقت‌ها را به واسطه او خلق کرد، محجوب شدند. پس به مدارج اسماء نگریستند و معارج اسراء را طلب کردند و آن را بزرگترین منزلتی که باید طلب شود و والاترین حالتی که حق تعالی در آن قصد می‌شود و مورد رغبت قرار می‌گیرد، تصور کردند. پس آنان را بر براق صدق و رفرف‌هایش سیر داد و به آنچه از آیات و لطایفش مشاهده کردند، محقق ساخت. و این بدان سبب بود که نظر، شمالی بود و فطرت بر نشأت کمالی، در اصل وضع، روبروی نقطه دایره قرار می‌گرفت. پس جان او از جانب راست پوشیده و از جانب غربی آشکار بود. اگر از سمت راست آشکار می‌شد، از همان اولین نگاه، مقام تمکین را در مشاهده تعیین به دست می‌آورد. و شگفتا از کسی که در بالاترین علیین است و تصور می‌کند که در پایین‌ترین سافلین است. **أَعُوذُ بِاللَّهِ أَنْ أَكُونَ من الْجاهِلِينَ** (پناه می‌برم به خدا از اینکه از جاهلان باشم). پس شمال او، یمین مدیر اوست و توقف او در موضعی که در آن یافت شده، نهایت سیر اوست. پس اگر آنچه به آن اشاره کردم نزد عاقل ثابت شود و صحیح باشد و بداند که بازگشت به سوی اوست، از جایگاه خود حرکت نمی‌کند. اما مسکین، گشایش و فتح را تصور می‌کند و می‌گوید: آیا در مقابل تنگی و حرج، جز وسعت و شرح نیست؟ سپس این آیه قرآن را بر خصماء تلاوت می‌کند: **فَمَنْ يُرِدِ الله أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلامِ ومن يُرِدْ أَنْ يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقاً حَرَجاً كَأَنَّما يَصَّعَّدُ في السَّماءِ** (پس هر که را خدا بخواهد هدایت کند، سینه‌اش را برای اسلام می‌گشاید، و هر که را بخواهد گمراه کند، سینه‌اش را تنگ و سخت می‌گرداند، چنان که گویی به آسمان صعود می‌کند). پس همان‌گونه که شرح جز پس از ضیق نیست، مطلوب نیز جز پس از سلوک راه حاصل نمی‌شود. و مسکین از تحصیل آنچه با الهام برایش حاصل شده، غافل ماند، در حالی که آن (علم) نزد صاحبان خرد و فهم جز با فکر و دلیل حاصل نمی‌شود. و او در آنچه گفت صادق بود، زیرا با چشم شمال می‌نگریست. پس حال او را بپذیرید و محال او را ثابت کنید و محال او را ضعیف شمارید و به او بگویید: اگر می‌خواهی به آنچه ناگزیر از آن خارج شدی، برسی، بر تو باد استعانت. و مقام مجاوره را از او پنهان کنید و اجر زیارت و ملاقات و یاری را برایش بزرگ شمارید. پس هنگام رسیدن به آنچه از آنجا حرکت کرده، اندوهگین خواهد شد و به آنچه در راهش از اسرار به دست آورده و شده است، شادمان خواهد گشت. و اگر رسول (صلی الله علیه و سلم) معراج را طلب نمی‌کرد، سفر نمی‌کرد و به آسمان صعود نمی‌کرد و پایین نمی‌آمد، در حالی که شأن ملأ اعلی و آیات پروردگارش در جایگاه او به او می‌رسید، همان‌گونه که زمین برای او در بسترش در هم پیچیده شد. اما این سرّی الهی است تا هر که می‌خواهد آن را انکار کند، زیرا به او انشا نمی‌دهد، و هر که می‌خواهد به آن ایمان آورد، زیرا جامع اشیاء است. هنگامی که من این علم را که عقل به تنهایی به آن نمی‌رسد و فهم به طور کامل آن را تحصیل نمی‌کند، بیان کردم، گفت: سرّی غریب به من شناندای و معنایی شگفت‌انگیز بر من کشف (الکشف) کردی که پیش از تو از هیچ ولی (الولی) نشنیده بودم و کسی را ندیدم که این حقایق را مانند تو برایش کامل کرده باشند، با وجود اینکه این حقایق نزد من معلوم است و در ذات من نگاشته شده است و هنگام برداشتن پرده‌هایم و آگاهی تو بر اشاراتم بر تو آشکار خواهد شد. اما به من خبر ده که حق (الحق) هنگام فرود آوردن تو در حرمش و آگاه ساختن تو بر حرمش، چه چیزی را بر تو شهود (الشهود) کرد؟\n\n### «مشاهده مشهد بیعت الهی»\n\nگفتم: بدان ای فصیحی که سخن نمی‌گوید و ای پرسنده‌ای از آنچه می‌داند، هنگامی که به ایمان رسیدم و در محضر احسان بر او فرود آمدم، مرا در حرمش فرود آورد و بر حرمش آگاه ساخت و گفت: همانا مناسک را زیاد کردم به دلیل رغبت در تمسک. پس اگر مرا اینجا نیافتی، آنجا خواهی یافت. و اگر در جمع از تو محجوب شوم، در مِنی بر تو تجلی (التجلی) خواهم کرد. با وجود اینکه در مواقف متعددی تو را آگاه ساختم و در برخی لطایفم بارها به تو اشاره کردم که من اگرچه محجوب شوم، این تجلی (التجلی) است که هر عارفی آن را نمی‌شناسد، مگر کسی که به معارفی که من به آن احاطه دارم، احاطه علمی داشته باشد. آیا نمی‌بینی که در قیامت بر آنان در غیر صورتی که می‌شناسند و علامتی که می‌دانند، تجلی (التجلی) می‌کنم؟ پس ربوبیت مرا انکار می‌کنند و از آن پناه می‌جویند و به آن پناه می‌برند، اما نمی‌دانند. بلکه به آن متجلی می‌گویند: نعوذ بالله منك وها نحن لربنا منتظرون (به خدا از تو پناه می‌بریم و ما منتظر پروردگارمان هستیم). پس در آن هنگام در صورتی که نزد آنان است، بر آنان ظاهر می‌شوم، پس به ربوبیت من اقرار می‌کنند و به عبودیت خودشان. پس آنان پرستش‌کنندگان علامت خود و مشاهده‌کنندگان صورتی هستند که نزدشان مقرر شده است. پس هر کس از آنان بگوید که مرا پرستیده است، سخنش دروغ است و به من افترا بسته است. و چگونه این از او صحیح باشد در حالی که هنگامی که بر او تجلی (التجلی) کردم، مرا انکار کرد؟ پس هر کس مرا به صورتی دون صورتی مقید کند، تصور می‌کند که بنده است، در حالی که او حقیقت ممکنه پنهان در قلب اوست. پس او تصور می‌کند که مرا می‌پرستد، در حالی که مرا انکار می‌کند. و عارفان (المعرفة) محال است که من از دیدگانشان پنهان شوم، زیرا آنان از خلق و از اسرارشان غایب شده‌اند. پس نزد آنان جز من ظاهر نمی‌شود و از موجودات جز اسم‌های مرا تعقل نمی‌کنند. پس هر چیزی که بر آنان ظاهر شود و تجلی (التجلی) کند، می‌گویند: تویی تسبیح شده برتر. پس آنان یکسان نیستند. مردم میان غایب و شاهد هستند و هر دو نزد آنان یک چیز است. هنگامی که سخن او را شنیدم و اشاره و آگاه ساختن او را فهمیدم، غیوری مرا به سوی خود جذب کرد و در برابر خود متوقف ساخت.\n\n(مخاطبات تعلیم و لطایف به سرّ کعبه از هستی (الوجود) و طواف)\n\nو دست راست را دراز کرد، پس آن را بوسیدم و صورتی که عاشقش بودم به من رسید. پس او در صورت حیات بر من متحول شد، و من در صورت ممات بر او متحول شدم. پس صورت خواست که با صورت بیعت کند، صورت به آن گفت: نیکو سیرت نبودی. و دست راستش را از آن باز کشید و به آن گفت: در عالم شهادت کنهی برای آن نشناختم. سپس او در صورت بصر بر من متحول شد، و من در صورت کسی که از نظر کور است بر او متحول شدم. و این پس از پایان یک شوط و تصور نقض یک شرط بود. پس صورت خواست که با صورت بیعت کند، صورت همان سخن مذکور را به آن گفت. سپس او در صورت علم فراگیر بر من متحول شد، و من در صورت جهل کامل بر او متحول شدم. پس صورت خواست که با صورت بیعت کند، صورت همان سخن مشهور را به آن گفت. سپس او در صورت شنیدن ندا بر من متحول شد، و من در صورت کری از دعا بر او متحول شدم. پس صورت خواست که با صورت بیعت کند، حق (الحق) پرده‌هایش را میان آن دو فرو انداخت. سپس او در صورت خطاب بر من متحول شد، و من در صورت گنگی از جواب بر او متحول شدم. پس صورت خواست که با صورت بیعت کند، حق (الحق) نوشته‌های لوح و سطور آن را میان آن دو فرستاد. سپس او در صورت اراده بر من متحول شد، و من در صورت قصور حقیقت و عادت بر او متحول شدم. پس صورت خواست که با صورت بیعت کند، حق (الحق) نور و روشنایی خود را میان آن دو جاری ساخت. سپس او در صورت قدرت و توان بر من متحول شد، و من در صورت عجز و فقر بر او متحول شدم. پس صورت خواست که با صورت بیعت کند، حق (الحق) تقصیر بنده را آشکار ساخت. پس هنگامی که آن رویگردانی را دیدم و دیدم که آمال و اغراضم به کمال نرسید، گفتم: چرا بر من شب را به روز نیاوردی و به عهد من وفا نکردی؟ به من گفت: تو بر خودت شب را به روز نیاوردی ای بنده من. اگر ای طواف‌کننده، حجر را در هر شوط می‌بوسیدی، دست راست مرا در این صور لطیف می‌بوسیدی. زیرا خانه من در آنجا به منزله ذات است و اشواط طواف به منزله صفات هفت‌گانه، صفات کمال نه صفات جلال، زیرا آن‌ها صفات اتصال و انفصال تو هستند. پس هفت شوط برای هفت صفت است و خانه‌ای قائم که بر ذات دلالت می‌کند. جز اینکه من آن را در بستر خود فرود آوردم و به عوام گفتم: این نزد شما به منزله عرش من است و خلیفه من در زمین کسی است که بر آن مستوی و محیط است. پس بنگر به ملک که با تو طواف می‌کند و در کنار تو ایستاده است. پس به او نگریستم، او به عرش خود بازگشت و با بلندی تختش بر من فخر فروخت. پس از سر شادی تبسم کردم و بداهتاً گفتم:\n\n> ای کعبه‌ای که رسولان به دور تو طواف کردند *** پس از آنکه گرامی‌داشتگان به دور تو طواف کردند\n> سپس عالمی پس از آنان آمد *** که از میان والا و فروتر به دور تو طواف کردند\n> آن را به عنوان مثالی برای عرش خود فرود آورد *** و ما گرامی‌داشتگان اطراف آن هستیم\n> پس اگر بزرگترین کسی که اطراف آن است بگوید *** من بهترم، آیا می‌شنوید؟\n> به خدا سوگند که او با نص نیامد *** و برای ما جز آنچه آشکار نیست، نیاورد\n> آیا آن جز نوری است که *** انوار آنان اطرافش را گرفته و ما آبی پست هستیم؟\n> پس شیء به سوی مثل خود جذب شد *** و همه ما بندگانی هستیم که نزد او جایگاه داریم\n> آیا ندیدند آنچه را که ندیدند که آنان *** به دور چیزی طواف کردند که ما طواف کردیم و آنان از گِل نیستند؟\n> اگر لطیف‌ترین ما مجرد می‌شد، مستوی می‌گشت *** بر آنچه طواف‌کنندگان اطرافش را گرفته‌اند\n> آنان سهم خود را گرفتند که حق کسی را نادیده بگیرند *** که خداوند عالمیان را مسخر او ساخت\n> چگونه برای آنان ممکن است، در حالی که می‌دانند من *** فرزند کسی هستم که آنان برایش سجده کردند\n> و پس از اعتراض بر پدر ما *** به جاهل بودن خود اعتراف کردند\n> و آن شخصی که سر باز زد، مأیوس شد *** و از منکران فضل بود\n> آنان سهم خود را گرفتند، آنان سهم خود را گرفتند که *** از خطای خطاکاران مصون شدند\n\nگفتم: سپس روی قلبم را از او برگرداندم و با آن به سوی پروردگارم روی آوردم. پس به من گفت: برای پدرت یاری جستی، برکت من در تو جاری شد. بشنو منزلت کسی را که او را ستودی و خیری را که پیشاپیش او فرستادی، و منزلت تو کجاست از منازل فرشتگان مقرب، درود خدا بر شما و بر آنان باد. این کعبه من قلب هستی (الوجود) است و عرش من برای این قلب، جسمی محدود است. و هیچ یک از آن دو مرا در بر نگرفت و از من به آنچه از آن دو خبر دادم، خبر نداد. و خانه‌ای که مرا در بر گرفت، قلب مقصود توست که در جسد مشهود تو به ودیعه نهاده شده است. پس اسراری که به دور قلب تو طواف می‌کنند، به منزله اجساد شما هستند هنگامی که به دور این سنگ‌ها طواف می‌کنند. پس طواف‌کنندگان و احاطه‌کنندگان به عرش محیط ما، مانند طواف‌کنندگان تو به عالم تخطیط هستند. همان‌گونه که جسم تو در رتبه پایین‌تر از قلب بسیط توست، کعبه نیز نسبت به عرش محیط چنین است. پس طواف‌کنندگان به کعبه به منزله طواف‌کنندگان به قلب تو هستند، به دلیل اشتراکشان در قلبی بودن. و طواف‌کنندگان به جسم تو مانند طواف‌کنندگان به عرش هستند، به دلیل اشتراکشان در صفت احاطه. همان‌گونه که عالم اسرار که به دور قلبی که مرا در بر گرفته طواف می‌کنند، والاترین و بالاترین منزلت را نسبت به دیگران دارند، شما نیز به وصف شرف و سیادت بر طواف‌کنندگان به عرش محیط سزاوارترید. زیرا شما طواف‌کنندگان به قلب هستی (الوجود) عالم هستید، پس به منزله اسرار دانشمندان هستید، و آنان طواف‌کنندگان به جسم عالم هستند، پس به منزله آب و هوا هستند. پس چگونه می‌توانید برابر باشید؟ و جز شما مرا در بر نگرفت و در هیچ صورت کمالی تجلی (التجلی) نکردم مگر در معنای شما. پس قدر شرف والایی را که به شما بخشیدم، بشناسید. و پس از این، من بزرگ متعالی هستم که نه حد مرا محدود می‌کند و نه سید و نه بنده مرا می‌شناسد. الوهیت تقدیس شده است، پس منزه است از اینکه درک شود و در منزلتش شریک آورده شود. تو «أنا» (من) هستی و من «أنا» هستم. پس مرا در خودت نطلب که رنج می‌بری و نه از خارج، که آسوده نمی‌شوی. و طلب مرا ترک مکن که شقی می‌شوی. پس مرا بطلب تا مرا بیابی و ارتقا یابی. اما در طلب خود ادب داشته باش و هنگام شروع در مذهب خود حاضر باش و میان من و خودت تمایز قائل شو، زیرا تو مرا شهود (الشهود) نمی‌کنی، بلکه چشم خود را شهود می‌کنی. پس در صفت اشتراک بایست، وگرنه بنده باش و بگو: عجز از درک، خود درک است. در این صورت به عتیق ملحق می‌شوی و صدیق گرامی می‌گردی. سپس به من گفت: از محضر من خارج شو.\n\nزیرا کسی چون تو شایسته خدمت من نیست. پس رانده شده خارج شدم. حاضران ضجه زدند. پس گفت: **ذَرْنِي ومن خَلَقْتُ وَحِيداً** (مرا با کسی که او را تنها آفریدم، واگذار). سپس گفت: او را بازگردانید. پس بازگردانده شدم و در همان ساعت در برابر او یافت شدم، گویی هرگز از بساط شهود (الشهود) او دور نشده و از محضر هستی (الوجود) او خارج نگشته بودم. پس گفت: چگونه کسی که شایسته خدمت من نیست، وارد محضر من می‌شود؟ اگر حرمتی که موجب خدمت است نزد تو نبود، محضر تو را نمی‌پذیرفت و در اولین نگاه تو را دور می‌انداخت. و اکنون تو در آن هستی و از برهان و پنهان شدن آن چیزی دیدی که بر احترام تو می‌افزاید و هنگام تجلی (التجلی) آن بر حشمت تو. سپس گفت: چرا هنگامی که به اخراج تو و بازگرداندن تو بر معراجت امر کردم، از من نپرسیدی؟ و من تو را صاحب حجت و زبان می‌دانم. ای انسان، چه زود فراموش کردی! گفتم: عظمت مشاهده ذات تو مرا مبهوت ساخت و از اینکه دست راست بیعت را در تجلیاتت گرفتی، درمانده شدم. و پیوسته نظر را تکرار می‌کردم که چه خبری در غیب رخ داده است. فلو التفت في ذلك الوقت إلي لعلمت أن مني أتى علي (اگر در آن هنگام به من توجه می‌کردی، می‌دانستی که آنچه بر من آمد، از من بود). اما محضر اقتضا می‌کند که جز او شهود (الشهود) نشود و به چهره‌ای جز چهره او نگریسته نشود. پس گفت: راست گفتی ای محمد، پس در مقام یگانه ثابت باش و از عدد بپرهیز، زیرا هلاکت ابدی در آن است. سپس مخاطبات و اخباری رخ داد که آن‌ها را در باب حج و مکه همراه با مجموعه‌ای از اسرار ذکر خواهم کرد.\n\n### (وصل) [ورود به کعبه حجر: خانه‌ای که از پرده و پوشش برتر است]\n\nپس آن رازدار وفادار گفت: ای گرامی‌ترین ولی (الولی) و برگزیده من، هیچ امری را برایم ذکر نکردی مگر آنکه من به آن عالم هستم و آن در ذات من نگاشته و برقرار است. گفتم: مرا به تطلع به سوی خودت از جانب خودت مشتاق ساختی تا از تو خبر دهم. گفت: آری ای غریب وارد شده و ای طالب قصدکننده، با من وارد کعبه حجر شو، زیرا آن خانه‌ای است که از حجاب و پوشش برتر است و مدخل عارفان (المعرفة) است و در آن آسایش طواف‌کنندگان است. پس در همان حال با او وارد بیت حجر شدم و دستش را بر سینه‌ام نهاد و گفت: من هفتمین در مرتبه احاطه به کائنات و به اسرار هستی (الوجود) «عین» و «أین» هستم. حق (الحق) مرا قطعه‌ای نور هوایی ساده آفرید و مرا با کلیات ممزوج ساخت. در حالی که من متطلع به آنچه نزد من القا می‌شود یا بر من نازل می‌گردد بودم، ناگهان علم قلمی اعلی از منازل والای خود بر ذات من نازل شد، در حالی که بر اسبی سوار بود که بر سه پایه ایستاده بود. پس سرش را به سوی ذات من خم کرد و انوار و ظلمات منتشر شدند و تمام کائنات را در ضمیر من دمید. پس زمین و آسمان مرا شکافت و مرا بر تمام اسم‌هایم آگاه ساخت. پس خود و غیر خود را شناختم و میان شر و خیر خود تمایز قائل شدم و میان خالق و حقایق خود فصل گذاشتم. سپس آن ملک از من منصرف شد و گفت: بدان که تو محضر ملک هستی. پس برای نزول و ورود رسول آماده شدم. پس فرشتگان به سوی من تجارت کردند و افلاک به دور من چرخیدند و همه به دست راست من روی آوردند و به محضر من روی آوردند. و هیچ ملکی را ندیدم که فرود آید و هیچ ملکی را ندیدم که از ایستادن در برابر من منتقل شود. و در برخی جوانب خود نگریستم، پس صورت ازل را دیدم. پس دانستم که نزول محال است. پس بر آن حال ثابت ماندم و برخی از خواص را از آنچه شهود (الشهود) کردم آگاه ساختم و آنان را بر آنچه در خود یافتم مطلع ساختم. پس من باغ سرسبز و میوه جامع هستم. پس پرده‌های مرا بردار و آنچه را که سطور من در بر دارد، بخوان. پس آنچه را که از من بر آن توفیق یافتی، در کتابت قرار ده و با همه دوستانت در میان بگذار. پس پرده‌های او را برداشتم و به نوشته‌هایش نگریستم. پس نور خود را که علم مکنون در آن به ودیعه نهاده شده و آن را در بر دارد، بر چشم من آشکار ساخت. پس اولین سطری که خواندم و اولین سرّی که از آن سطر دانستم، همان است که اکنون در این باب دوم ذکر می‌کنم. و خداوند سبحان به سوی علم و **إِلى‏ طَرِيقٍ مُسْتَقِيمٍ‏** (به سوی راهی مستقیم) هدایت می‌کند."
  },
  "page_count": 5
}