{
  "id": 304,
  "title": {
    "ar": "الباب الرابع وثلاثمائة في معرفة منزل إيثار الغناء على الفقر من المقام الموسوي وإيثار الفقر على الغناء من الحضرة العيسوية",
    "en": "Chapter Three Hundred and Four: Concerning the knowledge of the Station (منزل) of preferring Independence (الغناء) over Poverty (الفقر) from the Mosaic Station (المقام الموسوي), and preferring Poverty (الفقر) over Independence (الغناء) from the Isaian Presence (الحضرة العيسوية).",
    "ur": "باب تین سو چار: مقام موسوی سے فقر پر غنا (الغناء) کے ایثار کی منزل کی معرفت، اور حضرت عیسوی سے غنا پر فقر (الفقر) کے ایثار کی منزل کی معرفت کے بیان میں۔",
    "fa": "باب سیصد و چهارم در معرفت منزل ترجیح بی‌نیازی (الغناء) بر فقر از مقام موسوی و ترجیح فقر بر بی‌نیازی از حضرت عیسوی."
  },
  "content": {
    "ar": "## «الباب الرابع وثلاثمائة في معرفة منزل إيثار الغناء على الفقر من المقام الموسوي وإيثار الفقر على الغناء من الحضرة العيسوية»\n\n\n> غنى نفس المحقق مستعار *** وفقر النفس ذل وانكسار\n\n\n> فلو أن الفقير يكون ملكا *** لزار العالمين ولا يزار\n\n\n> ولو أن الغني يكون عبدا *** لكان له التقدم والفخار\n\n\n> فحكم الجهل قد عم البرايا *** ولا تدري لحكم العلم دار\n\n\n### «و من هذا المنزل أيضا قولنا»\n> الكون أعمى لنقص كامن فيه *** والنور ليس به نقص فيخفيه‏\n\n\n> لك الكمال ولي ضد الكمال لذا *** بيني وبينك وعدما نوفيه‏\n\n\n> قد قلت إنك معروف بمعرفتي *** وبحر جهلي عقلي مغرق فيه‏\n\n\n> هبني من الحال ما قد كنت فيه لكم *** لا لي فإن حجابي في تجليه‏\n\n\n> إني لا عجب مني حين أسرى بي *** وكيف أثر قربى في تدليه‏\n\n\n> لو لا دنوي لما قام التدلل به *** وما أنا علة فيما يؤديه‏\n\n\n> فقل لعلمك لا تفرح فما ظفرت *** يداك إلا بجهل ظاهر فيه‏\n\n\n### «و من هذا المنزل أيضا قولنا»\n\n\n> لو لا دنوي لما تدلى *** ولا تدانى ولا تجلى‏\n\n\n> فآب عنه وجود عيني *** وقد تعالى لما تحلى‏\n\n\n> فقمت في أرضه إماما *** خليفة سيدا معلى‏\n\n\n> أحكم فيه بحكم ربي *** وهو عن العين ما تخلى‏\n\n\n> فعند ما تم لي مرادي *** ناديت مولاي قال مهلا\n\n\n> خذني إلى ما خرجت منه *** فقال أهلا بكم وسهلا\n\n\n### [أن الله سبحانه يغار لعبده المنكسر الفقير أشد مما يغار لنفسه‏]\n\n\nاعلم وفقك الله تعالى أن الله سبحانه يغار لعبده المنكسر الفقير أشد مما يغار لنفسه فإنه طلب من عباده أن يغار والله إذا انتهكت حرماته غير إن غيرتك لله تعود محمدتها عليك وغيرته عز وجل لك تعود محمدتها أيضا عليك لا عليه فهو سبحانه وتعالى يثني عليك بغيرته لك ويثني عليك بغيرتك له فأنت المحمود على كل حال وبكل وجه وهذا الفصل أرفع مقام يكون للعبد ليس وراء مقام أصلا فينبغي للعبد أن يغار لنفسه في هذا المقام ولا بد فإن الله يغار له فإذا حضر ملك مطاع نافذ الأمر وقد جاءك مع عظم مرتبته زائرا وجاءك فقير ضعيف في ذلك الوقت زائرا أيضا فليكن قبولك على الفقير وشغلك به إلى أن يفرغ من شأنه الذي جاء إليه فإن تجلى الحق عند ذلك الفقير أعلى وأجل من تجليه في صورة ذلك الملك فإنك تعاين الحق في الملك المطاع تجليا في غير موطنه اللائق به على غير وجه التنزيه الذي ينبغي له وأنى للعبد برتبة السيادة فإذا ظهر فيها وبها فقد أخل بها وأشكل الأمر على الأجانب فما عرفوا السيد من العبد إذا رأوه على صورته في مرتبته ولذلك قال تعالى واصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَداةِ والْعَشِيِّ يُرِيدُونَ وَجْهَهُ ولا تَعْدُ عَيْناكَ عَنْهُمْ تُرِيدُ زِينَةَ الْحَياةِ الدُّنْيا ولا تُطِعْ من أَغْفَلْنا قَلْبَهُ عَنْ ذِكْرِنا واتَّبَعَ هَواهُ وكانَ أَمْرُهُ فُرُطاً وقُلِ الْحَقُّ من رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ أي لا تأخذكم في الله لومة لائم وكان سبب هذه الآية أن زعماء الكفار من المشركين كالأقرع بن حابس وأمثاله قالوا ما يمنعنا من مجالسة محمد إلا مجالسته لهؤلاء الأعبد يريدون بلالا وخباب بن الأرت وغيرهما فكبر عليهم إن يجمعهم والأعبد مجلس واحد وكان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حريصا على إيمان مثل هؤلاء فأمر أولئك الأعبد إذا رأوه مع هؤلاء الزعماء لا يقربوه إلى أن يفرغ من شأنهم أو إذا قبل الزعماء والأعبد عنده إن يخلو لهم المجلس فأنزل الله هذه الآية غيرة لمقام العبودية والفقر أن يستهضم بصفة عز وتأله ظهر في غير محله فكان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بعد ذلك إذا جالس هؤلاء الأعبد وأمثالهم لا يقوم حتى يكونوا هم الذين يقومون من عنده ولو أطالوا الجلوس وكان يقول صَلَّى اللهُ عَليهِ وسَلَّم إن الله أمرني أن أحبس نفسي معهم فكان إذا أطالوا الجلوس معه يشير إليهم بعض الصحابة مثل أبي بكر وغيره إن يقوموا حتى يتسرح رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لبعض شئونه‏\n\n\nفهذا من غيرة الله لعبده الفقير المنكسر وهو من أعظم دليل على شرف العبودة والإقامة عليها وهو المقام الذي ندعو له الناس فإن جميع النفوس يكبر عندهم رب الجاه ورب المال لأن العزة والغني لله تعالى فحيثما تجلت هذه الصفة تواضع الناس وافتقروا إليها ولا يفرقون بين ما هو عز وغني ذاتي وبين ما هو منهما عرضي إلا بمجرد مشاهدة هذه الصفة ولهذا يعظم في عيون الناس من استغنى عنهم وزهد فيما في أيديهم فترى الملوك على ما هم عليه من العزة والسلطان كالعبيد بين يدي الزهاد وذلك لغناهم بالله وعدم افتقارهم إليهم في عزهم وما في أيديهم من عرض الدنيا فإذا التمس الفقير من الغني بالمال شيئا من عز أو مال سقط من عينه بقدر ذلك مع كونه يبادر لقضاء حاجته حتى لو وزنت‏\nمرتبته في قلب الملك قبل طلب تلك الحاجة ووزنتها بعد طلب الحاجة نقصت عنها بقدر ما طلب فصفة الحق تعالى حيثما ظهرت محبوبة مطلوبة عند الناس الذين لا يفرقون بين ظهورها عند من يستحقها وبين ظهورها عند من لا يستحقها ولو علم هذا الجاهل أن أفقر الناس إلى المال أكثرهم مالا وذلك أن صاحب الفقر المدقع محتاج بالضرورة إلى ما يسد به خلته فهو فقر ذاتي والغني بالمال مع كثرة ماله بحيث لو قسمه على عمره وعمر بنيه وحفدته لكفاهم ومع هذا يترك أهله وولده ويسافر بماله ويخاطر به في البحار والأعداء وقطع المفازات إلى البلاد القاصية شرقا وغربا في اقتناء درهم زائد على ما عنده لشدة فقره إليه وربما هلك في طلب هذه الزيادة وغرق ماله أو أخذ وربما استؤسر في سفره أو قتل ومع هذه المعضلات كلها لا يترك سفرا في طلب هذه الزيادة فلو لا جهله وشدة فقره ما خاطر بالأنفس في طلب الأخس فالفقير الزاهد يرى أن هذا الغني أفقر منه بكثير وهو في فقره مذموم وأن هذا الزاهد لو لا غناه بربه عن هذه الأعراض لكان أشد حرصا في طلبها من التجار والملوك ولنا في هذا المعنى أبيات منها\n\n\n> بالمال ينقاد كل صعب *** من عالم الأرض والسماء\n\n\n> يحسبه عالم حجابا *** لم يعرفوا لذة العطاء\n\n\n> لو لا الذي في النفوس منه *** لم يجب الله في دعاء\n\n\n> لا تحسب المال ما تراه *** من عسجد مشرق الراء\n\n\n> بل هو ما كنت يا بنيي *** به غنيا عن السواء\n\n\n> فكن برب العلا غنيا *** وعامل الحق بالوفاء\n\n\nولنا فيه أيضا من قصيدة\n\n\n> المال يصلح كل شي‏ء فاسد *** وبه يزول عن الجواد عثارة\n\n\nوهذه طريقة أغفلها أهل طريقنا ورأوا أن الغني بالله تعالى من أعظم المراتب وحجبهم ذلك عن التحقيق بالتنبيه على الفقر إلى الله الذي هو صفتهم الحقيقية فجعلوها في الغني بالله بحكم التضمين لمحبتهم في الغني الذي هو خروج عن صفتهم والرجل إنما هو من عرف قدره وتحقق بصفته ولم يخرج عن موطنه وأبقى على نفسه خلعة ربه ولقبه واسمه\n\n\nالذي لقبه به وسماه فقال أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ فلرعونة النفس وجهالتها أرادت أن تشارك ربها في اسم الغني فرأت إن تتسمى بالغنى بالله وتتصف به حتى ينطلق عليها اسم الغني وتخرج عن اسم الفقير فانظر ما بين الرجلين وما رأيت أحدا من أهل طريقنا أشار إلى ما ذكرناه أصلا من غوائل النفوس المبطونة فيها إلا الله تعالى فهو الذي نبه عباده عليها وبعد هذا فما سمعوا وتعاموا وكم جهدت أن أرى لأحد في ذلك تنبيها عليه فما وجدت وأسأل من الله تعالى أن لا يجعلنا ممن انفرد بها وأن يشاركنا فيها إخواننا من العارفين وأما أصحابنا فإنهم أخذوها عنا وتحققوا بها في نفوسهم وما بقي عليهم فيها إلا التخلق بها وأن تكون صفتهم دائما ولكن بعد أن عرفنا أولادنا فعرفوا هذه المرتبة وتنبهوا إلى ما جهل الناس من العارفين من ذلك فقد حصل لهم خير كثير منعهم هذا القدر إن يسيئوا الأدب مع الله تعالى‏\n\n\n### [من إساءة الأدب في طريق الله تعالى‏]\n\n\nومن إساءة الأدب في طريق الله تعالى وهو مما يستدرج الله به العارفين عزة الشيوخ على أتباعهم من المريدين بما افتقروا إليهم فيه من التربية وامتيازهم عنهم فإن الشيخ إذا لم يوف هذا المقام حقه يحجبه فقر المريد إليه عن فقره إلى ربه حالا ويكون مشهده عند ذلك غناه بالله والغني بالله يطلب العزة وحال المحقق صاحب هذا المقام إذا رأى المريدين يفتقرون إليه فيما عنده من الله شكر الله على ذلك حيث ألزم الله به فقراء إليه يثبتونه بصفة فقرهم إليه على فقره إلى الله تعالى فإنه ربما لو لم يظهر صفة فقرهم إليه نسي فقره إلى الله تعالى فهكذا هو حال الشيخ المحقق فينظر هذا الشيخ المريدين المفتقرين إليه بعين من يثبته على طريقه لئلا تزل به القدم فيه فهو كغريق وجد من يأخذ بيده كيف يكون حب ذلك الغريق فيه حيث أمسك عليه حياته فيرى هذا الشيخ حق المريد عليه أعظم من حقه على المريد فالمريد هو شيخ الشيخ بالحال والشيخ هو شيخ المريد بالقول والتربية وإن كنت عاقلا فقد نبهتك على الطريق الأنفس فاعمل عليه فما أبقيت لك في النصيحة ولنا\n\n\n> أنا عبد والذل بالعبد أولى *** لا أراني للعز بالحق أهلا\n\n\n> فانظروني فكلما قلت قولا *** كان قولي حالا وعقدا وفعلا\n> إن غيري يقول إني عبد *** فإذا ما سببته قال مهلا\n\n\n### [فإن الفقير المؤمن هو مجلى حقيقتك وأنت مأمور بمشاهدة نفسك‏]\n\n\nفيا أيها الولي الحميم لا ننسخ العلم بالظن فأخسر الأخسرين من كانت حاله هذه عزة الايمان أعلى وعزة الفقر أولى فليكن شأنك تعظيم المؤمن الفقير على المؤمن الغني بماله العزيز بجاهه المحجوب عن نفسه فإن الفقير المؤمن هو مجلى حقيقتك وأنت مأمور بمشاهدة نفسك حذر الخروج عن طريقها فالفقير المؤمن مرآتك ترى فيه نفسك والمؤمن الغني بالمال عنك هو مرآة لك صدئت فلا ترى نفسك فيها فلا تعرف ما طرا على وجهك من التغير فما عتب الله نبيه سدى بل أبان والله في ذلك عن أرفع طريق الهدى وزجر عن طريق الردي فقال كلا ردعا وزجرا لحالة تحجبك عما ذكرته وقررته لك في هذه النصيحة فلا تعدل بالغنى والعزة مستحقهما وهو الله تعالى تكن من العلماء الكمل الذين لم يدنسوا علمهم بغفلة ولا نسيان معذرة وبعد أن أبنت لك عن الطريقة المثلى التي غاب عنها الرجال الذين شهد لهم بالكمال‏\n\n\n### [إن الإنسان تملك الأحوال‏]\n\n\nفاعلم إن الأحوال تملك الإنسان لا بد من ذلك وإذا سمعت بشخص يملك الأحوال فإنه لا يملك حالا ما إلا بحال آخر فالحال الذي أوجب له ملك هذا الحال هو الحاكم عليه في الوقت فإن الوقت له فإن بعض الناس غلط في هذه المسألة من أهل طريقنا وجعلوا من الفروق بين الأنبياء عليه السلام وبين الأولياء ملك الحال فقالوا الأنبياء يملكون الأحوال والأولياء تصرفهم الأحوال وهو غلط كبير من كل وجه فإن الإنسان لا يخلو أبدا عن حال يكون عليه به يعامل وقته وهو الحاكم عليه‏\n\n\n### [أن الله قد قرر في نفوس الأكابر تعظيم صفات الحق‏]\n\n\nواعلم أن الله قد قرر في نفوس الأكابر من رجال الله تعظيم صفات الحق حيثما ظهرت فإن ظهرت على من هي فيه بحكم العرض كان تعظيم هذا الرجل الولي لصفة الحق لا للمحل الظاهرة فيه فإن غفل انحجب بالموصوف عن الصفة فعظمها من أجلها وينبغي أن لا يكون ذلك إلا فيمن ألبسه الحق إياها لا فيمن سرقها فكان كلابس ثوبي زور كالمتشبع بما لا يملك وإذا عظم الولي صفة الحق إذا ظهرت له في شخص وبدت له صفته في شخص آخر أعرض عن صفته إعظاما أن يعرض عن الحق بمشاهدة نفسه فلم يقصد إلا التعظيم وينجر مع ذلك تعظيم المحل الذي ظهرت فيه صفة الحق وإن كان ليس مقصودا للمعظم ومع هذا فالذي نبهناك عليه أولى وأحق بالتقديم من هذا وما أحسن‏\n\n\nقول النبي صَلَّى اللهُ عَليهِ وسَلَّم حيث قال انزلوا الناس منازلهم أو قال أمرت أن أنزل الناس منازلهم‏\n\n\nومنازل الناس والله معلومة ولم يقل كل أحد منزلته وإنما قال الناس فالصفة التي تعمهم هي التي أمر النبي صَلَّى اللهُ عَليهِ وسَلَّم أن ننزلهم فيها وهي التي ذكرناها ونبهناك عليها من الذلة والافتقار وكل ما ورد في القرآن من وصف الإنسان بما ليس له بحقيقة فإنما هو في مقابلة أمر قد ادعاه من ليس من أهله فقوبل به من جنسه ليكون أنكى في حقه‏\n\n\nقال في ذلك عبد الله بن أبي ابن سلول لَئِنْ رَجَعْنا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ فنخرج منها محمدا وأصحابه فجاء ولده فأخبر بذلك رسول الله صَلَّى اللهُ عَليهِ وسَلَّم واستأذنه في قتل أبيه لما سمع الله يقول لا تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ وكان من المنافقين فقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ما أريد أن يتحدث بأن محمدا يقتل أصحابه فأضاف الله العزة لرسوله وللمؤمنين في مقابلة دعوى المنافقين إياها فقال تعالى يَقُولُونَ لَئِنْ رَجَعْنا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ ولِلَّهِ الْعِزَّةُ ولِرَسُولِهِ ولِلْمُؤْمِنِينَ ولكِنَّ الْمُنافِقِينَ لا يَعْلَمُونَ لمن ينسبون العزة فكيف ينسبونها إلى غير الله من المؤمنين وما حظ الرسول والمؤمن منها ولم يقل تعالى بإخراجهم وكذلك ما أخرجهم بل هذا القائل لم يزل بالمدينة إلى أن مات ودفع لكفنه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ثوبه جزاء ليد كانت له عند النبي صَلَّى اللهُ عَليهِ وسَلَّم من جهة عمه العباس حين أسره في غزوة بدر فكساه هذا المنافق ثوبه فلم يبق للمنافق يوم القيامة مطالبة للنبي صَلَّى اللهُ عَليهِ وسَلَّم من أجل ذلك‏\n\n\nإذا رأيت عارفا قد وقع في مثل هذا فاعلم أنه ما قصد سوى تعظيم صفة الحق وتصغير نفسه فإن كنت مثله في المقام أو أكبر منه فاذكره بما عرفتك به وإذا كان هذا المقام لك وأنت شاهد له فبالضرورة تكون أكبر منه في تلك الحالة وإن كنت نازلا عنه في غيرها فعلى كل وجه ذكره وإن كان حاله الايمان في ذلك الوقت فإنه يقبل الذكرى فإن انتهرك وقال لك لمثلي تقول هذا فاعلم أنه قد سقط من عين الله وقد حجبه الله عن عبوديته وعن الايمان فاتركه فقد فعلت ما فرضه الله عليك وادع له فإن الله قد أعمى بصيرته عن سبيل‏\n### [أرفع المنازل عند الله‏]\n\n\nواعلم أن هذه الصفة التي نبهتك عليها أعطتنا حالا ومشاهدة من حضرة القدس فهي مقرها ولا يتصف بها إلا من له عند الله أرفع المنازل فإن كان رسولا فارفع المنازل في الرسالة وإن كان نبيا فارفع المنازل في النبوة وإن كان وليا فارفع المنازل في الولاية وإن كان مؤمنا فارفع المنازل في الايمان وإن كان نصرانيا أو مجوسيا أو يهوديا أو معطلا فهو في أرفع المنازل بها في صنفه وفي مقامه‏\n\n\n> أن الكبير من الرجال هو الذي *** لا يدعيه مقيدا ومسودا\n\n\n> ومهودا ومنصرا وممجسا *** ومعطلا ومشركا وموحدا\n\n\n> ومنزها ومشبها ومحيزا *** وممكنا ومروحنا ومجسدا\n\n\n> عمت صفات جلاله وجماله *** كل الأنام وكان حتى يقصدا\n\n\n> إن الغيور هو الذي لا ينثني *** عن نفسه حال الضلالة والهدى‏\n\n\nوأن المحل الذي تقوم به هذه الصفة لا بد لصاحبها إن كان على أي ملة كان أو نحلة أن يرجع إلى دين الهدى ويسلم ويؤمن ويبادر إلى مكارم الأخلاق عن كشف محقق وعلم صحيح فيكون أكمل الناس إيمانا وأعظمهم منزلة عند الله عارفا بمنازل الرسل والأنبياء عليه السلام وفضل بعضهم على بعض والأولياء والمؤمنين فإن الصفة التي قادته إلى الإسلام أعظم الصفات عند الله قدرا في حق العبد فتنزله المنازل العلية وترفعه في عليين ويتلقاه من الملائكة كل ملك كريم على الله محسن في عبادة ربه هو الذي ينزل إلى هذا العبد من عند الله للمناسبة التي بين هذا الملك وبينه فيأخذ بيده فيرفعه إلى منزل هذه الصفة في عليين فلا يكون في صنفه أعلى منه منزلة إلا من عمل بعمله فإنه في درجته ومعه ويكفي هذا القدر من هذا المنزل وأما ما يحوي عليه من المسائل والعلوم فعلم كفران النعم وتفاصيل الكفر وأين ينتهي كل كفر بصاحبه مثل كفر الآبق وتارك الصلاة والكافر ببعض ما أنزل الله وعلم البدو وعلم وضع الشرائع وعلم البرازخ وعلم البعث وعلم أقوات الأرض وأمر السموات وما يتولد بين السماء والأرض وبين توجهات الحق والكون وبين كل زوجين وعلم الإنسان والحيوان وعلم الساعة ولم سميت ساعة وهل هي في كل لسان بهذا المعنى المفهوم من اسم الساعة أم لا وهل للساعة صورة لها إدراك سمع وبصر وتميز أم لا وعلم الصفات المقومة لكل مرتبة حتى يمتاز بها أهلها وعلم الكتابين اللذين خرج بهما رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في يديه على أصحابه‏\n\n\nفقال صَلَّى اللهُ عَليهِ وسَلَّم إن في الكتاب الواحد أسماء أهل الجنة وأسماء آبائهم وقبائلهم وعشائرهم وفي الكتاب الآخر أسماء أهل النار وأسماء آبائهم وقبائلهم وعشائرهم‏\n\n\nمع صغر حجم الكتابين وكثرة الأسماء فيعلم من ذلك إيراد الكبير على الصغير من غير تصغير الكبير أو تكبير الصغير وإلا فأي ديوان يحصر أسماء هؤلاء ويعلم أن الأمر الذي يحيله العقل لا يستحيل نسبة إلهية فتعلم أن الله قادر على المحال العقلي كإدخال الجمل في سم الخياط مع بقاء هذا على صغره وهذا على كبره ويشاهد من هذا المنزل المقام الذي وراء طور العقل من حيث ما يستقل بإدراكه من كونه مفكرا وإلا فعقل الأنبياء عليه السلام والأولياء قبل هذا الأمر من كونه قابلا لا من كونه ما ذكرناه فللعقول حد تقف عنده وليس لله حد يقف عنده بل هو خالق الحدود فلا حد له سبحانه فهو القادر على الإطلاق والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 304: On the Gnosis of the Station of Preferring Sufficiency over Poverty from the Musawi (Mosaic) Station, and Preferring Poverty over Sufficiency from the ‘Isawi (Christic) Presence\n\n> The sufficiency (غنى) of the realized soul is borrowed,\n> And the soul’s poverty (فقر) is abasement and brokenness.\n> If the poor man were a king,\n> He would visit the worlds, yet remain unvisited.\n> And if the rich man were a slave,\n> Precedence and glory would be his.\n> The rule of ignorance has encompassed all creatures,\n> And they know not the dwelling place of the rule of Knowledge (العلم).\n\n### And also from this Station is our saying:\n\n> The Cosmos is blind due to a hidden flaw within it,\n> And the Light has no flaw that would conceal it.\n> Yours is Perfection, and mine is the opposite of Perfection; thus,\n> Between You and me is a promise we fail to keep.\n> I have said You are known through my gnosis (معرفتي),\n> And the sea of my ignorance is where my intellect drowns.\n> Grant me of the State (الحال) that which I was in for You,\n> Not for myself, for my veil lies within His Theophany (تجليه).\n> I am not amazed by myself when I was journeyed with (Mi'raj),\n> And how my proximity affected His descent (تدليه).\n> Were it not for my nearness, the manifestation of self-display would not have arisen through Him,\n> And I am not the cause of what He brings forth.\n> So tell your knowledge (علمك) not to rejoice, for\n> Your hands have only grasped an ignorance manifest within it.\n\n### And also from this Station is our saying:\n\n> Were it not for my nearness, He would not have descended,\n> Nor drawn near, nor made Theophany (تجلى).\n> So the existence of my essence (وجود عيني) returned from Him,\n> And He became exalted when He adorned Himself.\n> So I stood upon His earth as an Imam,\n> A Caliph, a master, exalted.\n> I rule therein by the decree of my Lord,\n> While He has not abandoned the Essence (العين).\n> When my desire was fulfilled for me,\n> I called my Master, and He said, \"Wait!\"\n> \"Take me back to that from which I came out.\"\n> He said, \"Welcome and greetings.\"\n\n### [That Allah, Exalted is He, is jealous for His broken, poor servant more intensely than He is jealous for Himself]\n\nKnow, may God grant you success, that Allah the Exalted is jealous (يغار) for His broken and poor servant more intensely than He is jealous for Himself. For He requested His servants to be jealous, and God is jealous when His sanctities are violated. However, your jealousy for God returns its praise upon you, and His jealousy, Mighty and Majestic, for you also returns its praise upon you, not upon Him. Thus, He, Exalted is He, praises you for His jealousy for you, and praises you for your jealousy for Him. So you are the praised one in every state and in every aspect.\n\nAnd this section describes the highest station (مقام) a servant can attain; there is absolutely no station beyond it. Therefore, the servant must necessarily be jealous for himself in this station, for God is jealous for him.\n\nIf an obeyed king, whose command is executed, comes to you as a visitor despite the greatness of his rank, and a poor, weak man also comes to you as a visitor at that same time, let your acceptance be directed toward the poor man and your attention occupied with him until he finishes the matter for which he came. For the Theophany (تجلي) of the Real (الحق) in that poor man is higher and more glorious than His Theophany in the form of that king. For you witness the Real in the obeyed king as a Theophany (تجليا) in a place not befitting Him, and not upon the aspect of transcendence (تنزيه) that is proper for Him.\n\nAnd how can a servant attain the rank of mastery? If he appears in it and through it, he has violated it, and the matter becomes confusing for strangers, who cannot distinguish the master from the servant when they see him in his form in his rank. Therefore, the Exalted said: <<وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَداةِ والْعَشِيِّ يُرِيدُونَ وَجْهَهُ ولا تَعْدُ عَيْناكَ عَنْهُمْ تُرِيدُ زِينَةَ الْحَياةِ الدُّنْيا ولا تُطِعْ من أَغْفَلْنا قَلْبَهُ عَنْ ذِكْرِنا واتَّبَعَ هَواهُ وكانَ أَمْرُهُ فُرُطاً وقُلِ الْحَقُّ من رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ>> (And keep yourself patient with those who call upon their Lord morning and evening, seeking His Countenance. And let not your eyes pass beyond them, desiring the adornment of the worldly life. And do not obey one whose heart We have made heedless of Our remembrance and who follows his desire and whose affair is excessive. And say, \"The truth is from your Lord, so whoever wills - let him believe; and whoever wills - let him disbelieve.\") Meaning: let not the blame of any blamer affect you regarding God.\n\nThe reason for this verse was that the leaders of the disbelievers among the polytheists, such as Al-Aqra’ ibn Habis and his like, said: \"What prevents us from sitting with Muhammad is only his sitting with these slaves,\" meaning Bilal, Khabbab ibn al-Aratt, and others. It was too great for them that they and the slaves should share one gathering. The Messenger of God, peace and blessings be upon him, was eager for the faith of such people, so he ordered those slaves not to approach him when they saw him with these leaders until he finished his business with them, or that if the leaders and the slaves were accepted by him, he should clear the assembly for the leaders. Then God revealed this verse out of jealousy (غيرة) for the station of servanthood (‘ubudiyya) and poverty (faqr), lest it be diminished by a quality of might and divinity that appeared in an improper place.\n\nThereafter, when the Messenger of God, peace and blessings be upon him, sat with these slaves and their like, he would not rise until they were the ones who rose from his presence, even if they prolonged their sitting. And he used to say, peace and blessings be upon him: \"Indeed, God commanded me to restrain myself with them.\" When they prolonged their sitting with him, some Companions, such as Abu Bakr and others, would signal to them to rise so that the Messenger of God, peace and blessings be upon him, could attend to some of his affairs.\n\nThis is part of God's jealousy for His poor, broken servant, and it is one of the greatest proofs of the nobility of servanthood (‘ubudiyya) and persistence in it. This is the station (مقام) to which we invite people. For all souls hold in high esteem the possessor of rank and the possessor of wealth, because Might (‘izza) and Sufficiency (ghina) belong to God the Exalted. Wherever this Attribute manifests, people humble themselves and feel need toward it. They do not distinguish between what is essential Might and Sufficiency (dhati) and what is accidental (‘aradi) of them, except merely by witnessing this Attribute.\n\nFor this reason, the one who is self-sufficient from people and ascetic regarding what is in their hands is magnified in their eyes. Thus, you see kings, despite their might and authority, like servants before the ascetics, and that is due to the ascetics’ sufficiency in God and their lack of need for the kings’ might or for the worldly goods in their hands. If the poor man seeks from the wealthy man something of might or wealth, he falls in the wealthy man’s estimation by that amount, even though the wealthy man hastens to fulfill his need. Even if you weighed his rank in the heart of the king before requesting that need, and weighed it after requesting the need, it would be diminished by the amount requested.\n\nThus, the Attribute of the Real, Exalted is He, wherever it appears, is beloved and sought after by people who do not distinguish between its manifestation in one who deserves it and its manifestation in one who does not deserve it. If this ignorant person knew that the people most in need of money are those who possess the most money! This is because the person in abject poverty is necessarily in need of what covers his deficiency, and this is essential poverty (فقر ذاتي). As for the wealthy man, despite the abundance of his wealth—such that if he divided it over his lifetime and the lifetimes of his children and grandchildren, it would suffice them—he still leaves his family and children, travels with his wealth, and risks it in the seas, among enemies, and crossing deserts to distant lands, East and West, in order to acquire one extra coin beyond what he already possesses, due to the intensity of his need for it. He may perish in the pursuit of this increase, or his wealth may drown or be seized. He may be taken captive during his journey or killed. Yet, despite all these calamities, he does not abandon travel in search of this increase. Were it not for his ignorance and the intensity of his poverty, he would not risk lives in pursuit of the basest things.\n\nThe ascetic poor man sees that this wealthy man is far poorer than himself, and he is blameworthy in his poverty. And this ascetic, were it not for his sufficiency in his Lord from these accidental things, would be more eager in seeking them than merchants and kings. And we have verses concerning this meaning, among them:\n\n> By wealth every difficulty is subdued,\n> From the world of the earth and the heaven.\n> The scholar considers it a veil,\n> They have not known the pleasure of giving.\n> Were it not for that which is in the souls concerning it,\n> God would not be answered in supplication.\n> Do not consider wealth what you see,\n> Of shining gold.\n> Rather, it is that by which, O my son,\n> You are sufficient from all else.\n> So be sufficient in the Lord of Loftiness,\n> And deal with the Real (الحق) with faithfulness.\n\nAnd we also have concerning it, from a poem:\n\n> Wealth mends every corrupt thing,\n> And by it the stumble of the generous one is removed.\n\nThis is a path neglected by the people of our way (طريقة). They saw that sufficiency in God (الغني بالله) is one of the greatest levels, and that veiled them from realization (تحقيق) by drawing attention away from poverty toward God (الفقر إلى الله), which is their true attribute. So they placed it in sufficiency in God by way of implication, due to their love for sufficiency, which is an exit from their attribute. The true man is only he who knows his measure, realizes his attribute, does not depart from his station, and keeps upon himself the robe, title, and Name given by his Lord, which He titled him with and named him, saying: <<أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ>> (It is you who are the poor [al-fuqara’] in need of Allah, while Allah is the Self-Sufficient [al-Ghani], the Praiseworthy.)\n\nDue to the soul's recklessness and ignorance, it desired to share the Name of the Self-Sufficient (الغني) with its Lord, so it sought to be named with sufficiency in God and to be described by it, so that the Name of the Self-Sufficient would apply to it and it would exit the Name of the Poor (الفقير). Look at the difference between the two men. I have not seen anyone among the people of our way who has pointed out what we have mentioned concerning the hidden dangers of the souls within them, except God the Exalted, for He is the One who alerts His servants to them. And after this, they did not listen and acted blindly. How much I strove to see an alert regarding this from anyone, but I found none. I ask God the Exalted not to make us among those who are unique in this knowledge, but that our brethren among the Gnostics (العارفين) share it with us. As for our companions, they have taken it from us and realized it within themselves, and all that remains for them is to embody it ethically and for it to be their permanent attribute. But after we taught our spiritual children, they recognized this level and became aware of what the Gnostics generally ignored concerning it. They have thus attained great good, and this realization prevents them from acting improperly toward God the Exalted.\n\n### [Among the improper conduct on the path of God the Exalted]\n\nAmong the improper conduct (إساءة الأدب) on the path of God the Exalted—and this is one of the ways God gradually leads the Gnostics astray—is the pride (‘izza) of the Shaykhs over their followers, the disciples (مريدين), due to the disciples’ need for them in spiritual training (تربية) and the Shaykhs’ distinction from them. If the Shaykh does not give this station its due, the disciple’s need for him immediately veils the Shaykh from his own need for his Lord, and his witnessing (مشهد) at that moment becomes his sufficiency in God. Sufficiency in God seeks might. But the state of the realized one (المحقق), the possessor of this station, when he sees the disciples needing him for what he possesses from God, he thanks God for that, since God has bound to him those who are poor toward Him, thereby confirming him in his poverty toward God the Exalted through the attribute of their poverty toward him. For perhaps, if the attribute of their poverty toward him did not appear, he might forget his poverty toward God the Exalted.\n\nThus is the state of the realized Shaykh: he looks upon the disciples who are poor toward him with the eye of one who confirms him upon his path, lest his foot should slip therein. He is like a drowning man who finds someone to take his hand. How great is the drowning man’s love for him, since he held onto his life! Thus, this Shaykh sees the right of the disciple upon him as greater than his right upon the disciple. The disciple is the Shaykh’s Shaykh by state (حال), and the Shaykh is the disciple’s Shaykh by word and training (تربية). If you are intelligent, I have alerted you to the most precious path, so act upon it, for I have held nothing back in this advice. And we have:\n\n> I am a servant, and abasement is more fitting for the servant,\n> I do not see myself worthy of Might (‘izz) through the Real (الحق).\n> So look at me, for whenever I speak a word,\n> My saying is a state (حال), a covenant, and an act.\n> Indeed, another says, \"I am a servant,\"\n> But if I insult him, he says, \"Wait!\"\n\n### [For the poor believer is the locus of manifestation of your Reality, and you are commanded to witness your own soul]\n\nO intimate friend (ولي حميم), do not abrogate Knowledge (العلم) with conjecture, for the most losing of the losers is he whose state is this. The might of faith is higher, and the might of poverty is more fitting. Let your concern be the magnification of the poor believer over the believer who is rich in wealth, mighty in rank, and veiled from his own soul. For the poor believer is the locus of manifestation (مجلى) of your Reality (حقيقتك), and you are commanded to witness your own soul, beware of departing from its path. The poor believer is your mirror in which you see your soul, while the believer who is rich in wealth, being sufficient from you, is a mirror for you that has rusted, so you do not see your soul in it, and thus you do not know what change has occurred upon your face.\n\nGod did not admonish His Prophet in vain; rather, He clearly showed therein the highest path of guidance and warned against the path of ruin, saying: <<كَلَّا>> (Never!)—a deterrent and a warning against a state that would veil you from what I have mentioned and established for you in this advice. So do not equate the one deserving of Sufficiency (غنى) and Might (‘izza), who is God the Exalted, with others, and you will be among the perfect scholars who did not defile their knowledge with heedlessness or forgetfulness. And after I have made clear to you the exemplary path (الطريقة المثلى) which was missed by men who were nonetheless testified to be perfect:\n\n### [That the spiritual states possess the human being]\n\nKnow that the spiritual states (الأحوال) necessarily possess the human being. If you hear of a person who possesses the states, he only possesses one state by means of another state. The state that necessitated his possession of this state is the ruler over him in the moment (الوقت), for the moment belongs to it. Some people among the adherents of our path erred in this matter and made the possession of the state one of the distinctions between the Prophets, peace be upon them, and the Saints (الأولياء). They said: \"The Prophets possess the states, while the Saints are governed by the states.\" This is a great error in every respect. For the human being is never devoid of a state upon which he acts in his moment, and that state is the ruler over him.\n\n### [That God has established in the souls of the great ones the magnification of the Attributes of the Real]\n\nKnow that God has established in the souls of the great ones among the men of God the magnification of the Attributes (صفات) of the Real (الحق) wherever they appear. If they appear upon one who possesses them by accidental decree, the magnification of this saintly man is for the Attribute of the Real, not for the locus in which it appears. If he is heedless, he is veiled by the described one from the Attribute, so he magnifies the described one because of the Attribute. And this should only occur regarding one whom the Real (الحق) has clothed with it, not one who stole it, becoming like one who wears two garments of falsehood, pretending to possess what he does not own.\n\nWhen the saint magnifies the Attribute of the Real when it appears to him in one person, and his own attribute appears to him in another person, he turns away from his own attribute, out of reverence, lest he turn away from the Real by witnessing his own soul. He intends nothing but magnification, and along with that comes the magnification of the locus in which the Attribute of the Real appeared, even if that locus was not the direct object of the magnifier’s intention. Nevertheless, what we alerted you to first is more fitting and deserving of precedence than this. And how excellent is the saying of the Prophet, peace and blessings be upon him, when he said: \"Treat people according to their stations,\" or he said: \"I was commanded to treat people according to their stations.\"\n\nThe stations of people are known to God. He did not say, \"Every person according to his station,\" but rather, \"people.\" Thus, the attribute that encompasses them is the one in which the Prophet, peace and blessings be upon him, commanded us to place them, and that is what we mentioned and alerted you to: abasement (ذلة) and need (افتقار).\n\nEverything mentioned in the Quran describing man with something that is not his reality is only in response to a claim made by one who is not worthy of it, so he is countered with something of the same kind, to be more painful to him. Abdullah ibn Ubayy ibn Salul said concerning this: <<لَئِنْ رَجَعْنا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ>> (If we return to Al-Madinah, the more honored will surely expel therefrom the more abased), meaning: \"We will expel Muhammad and his companions from it.\" His son came and informed the Messenger of God, peace and blessings be upon him, of this, and sought permission to kill his father, having heard God say: <<لا تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ>> (You will not find a people who believe in Allah and the Last Day having affection for those who oppose Allah and His Messenger, even if they were their fathers). And he was one of the hypocrites. The Messenger of God, peace and blessings be upon him, said: \"I do not wish it to be rumored that Muhammad kills his companions.\"\n\nSo God attributed Might [al-’izza] to His Messenger and to the believers in response to the hypocrites’ claim to it, and the Exalted said: <<يَقُولُونَ لَئِنْ رَجَعْنا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ ولِلَّهِ الْعِزَّةُ ولِرَسُولِهِ ولِلْمُؤْمِنِينَ ولكِنَّ الْمُنافِقِينَ لا يَعْلَمُونَ>> (They say, \"If we return to Al-Madinah, the more honored will surely expel therefrom the more abased.\" But Might belongs to Allah and to His Messenger and to the believers, but the hypocrites do not know.) They do not know to whom Might is attributed, so how can they attribute it to others besides God among the believers? And what share does the Messenger and the believer have of it? The Exalted did not command their expulsion, nor were they expelled. Rather, this speaker remained in Madinah until he died. The Messenger of God, peace and blessings be upon him, gave his garment for his shroud, in recompense for a favor he had done for the Prophet, peace and blessings be upon him, through his uncle Al-Abbas when he was captured in the Battle of Badr, for this hypocrite had clothed him with his garment. Thus, the hypocrite would have no claim against the Prophet, peace and blessings be upon him, on the Day of Resurrection because of that.\n\nIf you see a Gnostic (‘arif) who has fallen into something like this, know that he intended nothing but the magnification of the Attribute of the Real (صفة الحق) and the belittling of his own soul. If you are equal to him in the station (مقام) or greater than him, remind him of what I have taught you. If this station belongs to you and you are witnessing it, you are necessarily greater than him in that state, even if you are lower than him in others. In every case, remind him. If his state at that time is faith, he will accept the reminder. But if he rebukes you and says, \"Do you say this to someone like me?\" then know that he has fallen from God’s sight, and God has veiled him from his servanthood (‘ubudiyya) and from faith. Leave him, for you have done what God obligated upon you, and supplicate for him, for God has blinded his inner sight from the path.\n\n### [The Highest Stations with God]\n\nKnow that this attribute which I have alerted you to has granted us a state (حال) and a witnessing (مشاهدة) from the Holy Presence (حضرة القدس); it is its dwelling place, and no one is described by it except he who holds the highest stations (منازل) with God. If he is a Messenger, he holds the highest stations in Messengership; if he is a Prophet, the highest stations in Prophethood; if he is a Saint, the highest stations in Sainthood; if he is a believer, the highest stations in faith; and if he is a Christian, a Magian, a Jew, or an atheist (معطلا), he is in the highest stations by means of it within his category and his station.\n\n> The great one among men is he who\n> Does not claim him as bound or mastered,\n> Nor as guided, nor Christian, nor Magian,\n> Nor atheist, nor polytheist, nor monotheist,\n> Nor transcendent, nor anthropomorphic, nor localized,\n> Nor contingent, nor spiritualized, nor embodied.\n> The Attributes of His Majesty (جلاله) and Beauty (جماله) encompassed\n> All creatures, and He was, until He was sought.\n> Indeed, the jealous one is he who does not turn away\n> From his own soul, whether in the state of error or guidance.\n\nThe locus in which this attribute is established—its possessor, regardless of his religion or sect, must necessarily return to the religion of guidance, submit [islam], believe [iman], and hasten to noble character, based on realized unveiling (كشف محقق) and sound knowledge (علم صحيح). Thus, he becomes the most perfect of people in faith and the greatest in station with God. He is a Gnostic of the stations of the Messengers and Prophets, peace be upon them, and the superiority of some over others, as well as the Saints (الأولياء) and the believers. For the attribute that led him to Islam is the greatest of attributes in worth before God concerning the servant. It causes him to descend into the lofty stations (المنازل العلية) and raises him in the highest heaven (‘Illiyyin). He is received by every angel who is noble before God and excellent in the worship of his Lord—it is this angel who descends to this servant from God due to the affinity between this angel and him. He takes him by the hand and raises him to the station (منزل) of this attribute in the highest heaven (‘Illiyyin). There is no one in his category higher in station than him, except one who acted according to his action, for he is in his degree and with him. This much suffices concerning this station.\n\nAs for the issues and sciences it contains, they include the science of ingratitude for blessings, the details of disbelief [kufr] and where each type of disbelief leads its possessor—such as the disbelief of the runaway slave, the one who abandons prayer, and the one who disbelieves in part of what God revealed—the science of beginning [al-badw], the science of establishing divine laws [shara’i’], the science of the Isthmuses (البرازخ), the science of the Resurrection [al-ba’th], the science of the sustenance of the earth and the affair of the heavens, and what is generated between the heaven and the earth, and between the orientations of the Real and the Cosmos, and between every pair; the science of man and animal; the science of the Hour [al-sa’a], why it was named the Hour, whether it carries this understood meaning of the name ‘Hour’ in every language or not, and whether the Hour has a form possessing the perception of hearing, sight, and discernment or not; and the science of the attributes that establish every level, so that its people are distinguished by them; and the science of the two books with which the Messenger of God, peace and blessings be upon him, came out to his Companions, holding them in his hands.\n\nHe, peace and blessings be upon him, said: \"Indeed, in one book are the names of the people of Paradise, and the names of their fathers, tribes, and clans; and in the other book are the names of the people of the Fire, and the names of their fathers, tribes, and clans.\"\n\nDespite the small size of the two books and the multitude of names, one learns from this the inclusion of the great within the small without diminishing the great or magnifying the small. Otherwise, what register could encompass the names of all these? And one learns that the matter which the intellect deems impossible is not impossible when attributed divinely. Thus, you learn that God is capable of the rationally impossible, such as the entry of the camel into the eye of a needle, while the latter remains small and the former remains large. From this station, one witnesses the level (مقام) that lies beyond the sphere of the intellect, in terms of what the intellect independently perceives by being a thinker. Otherwise, the intellect of the Prophets, peace be upon them, and the Saints, prior to this matter, is receptive, not what we have mentioned. For intellects have a limit at which they stop, but God has no limit at which He stops; rather, He is the Creator of limits, so He has no limit, Exalted is He. He is the Absolutely Capable. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way.)",
    "ur": "باب نمبر تین سو چار: مقام موسوی سے فقر پر غنا (بے نیازی) کو ترجیح دینے کی منزل کی معرفت میں، اور حضرت عیسویہ سے غنا پر فقر کو ترجیح دینے کی منزل کی معرفت میں۔\n\nمحقق کی نفس کا غنا (بے نیازی) مستعار ہے، اور نفس کا فقر (محتاجی) ذلت اور انکسار ہے۔\nاگر فقیر بادشاہ بن جائے، تو وہ تمام جہانوں کی زیارت کرے گا مگر اس کی زیارت نہیں کی جائے گی۔\nاور اگر غنی (مالدار) بندہ بن جائے، تو اس کے لیے تقدم اور فخر ہوگا۔\nپس جہالت کا حکم مخلوقات پر غالب آ چکا ہے، اور وہ علم کے حکم کی جگہ نہیں جانتے۔\n\n### «اور اسی منزل سے ہمارا یہ قول بھی ہے»\nکون (کائنات) اس میں پوشیدہ نقص کی وجہ سے اندھا ہے، اور نور میں کوئی نقص نہیں جو اسے چھپا سکے۔\nکمال آپ کے لیے ہے اور کمال کی ضد میرے لیے، اسی لیے میرے اور آپ کے درمیان ایک وعدہ ہے جسے ہم پورا نہیں کرتے۔\nقد قلت إنك معروف بمعرفتي *** وبحر جهلي عقلي مغرق فيه‏\nمیں نے کہا کہ آپ میری معرفت (المعرفۃ) سے معروف ہیں، اور میرے عقل کا جہل کا سمندر اس میں غرق ہے۔\nمجھے وہ حال عطا کیجیے جس میں میں آپ کے لیے تھا، نہ کہ میرے لیے، کیونکہ میرا حجاب میرے ظہور الٰہی (التجلی) میں ہے۔\nجب مجھے سیر کرائی گئی تو مجھے اپنے آپ پر تعجب نہیں ہوا، اور میرے قرب نے اس کے تدلی (جھکنے) میں کیسے اثر کیا۔\nاگر میرا دنو (قرب) نہ ہوتا تو تدلل قائم نہ ہوتا، اور جو کچھ وہ ادا کرتا ہے میں اس میں علت نہیں ہوں۔\nپس اپنے علم سے کہہ دو کہ خوش نہ ہو، کیونکہ تیرے ہاتھوں نے صرف اس جہل کو پایا ہے جو اس میں ظاہر ہے۔\n\n### «اور اسی منزل سے ہمارا یہ قول بھی ہے»\nاگر میرا دنو (قرب) نہ ہوتا تو وہ نہ تدلی کرتا، نہ تدانی کرتا اور نہ ہی تجلی کرتا۔\nفآب عنه وجود عيني *** وقد تعالى لما تحلى‏\nپس میری عین کا وجود اس سے لوٹ آیا، اور جب وہ مزین ہوا تو بلند ہو گیا۔\nفقمت في أرضه إماما *** خليفة سيدا معلى‏\nپس میں اس کی زمین میں امام، خلیفہ، سردار اور بلند مرتبہ بن کر کھڑا ہوا۔\nأحكم فيه بحكم ربي *** وهو عن العين ما تخلى‏\nمیں اس میں اپنے رب کے حکم سے حکم کرتا ہوں، اور وہ عین (ذات) سے جدا نہیں ہوا۔\nفعند ما تم لي مرادي *** ناديت مولاي قال مهلا\nپس جب میری مراد پوری ہو گئی، تو میں نے اپنے مولا کو پکارا، اس نے کہا: ٹھہرو!\nخذني إلى ما خرجت منه *** فقال أهلا بكم وسهلا\nمجھے اس کی طرف لے چلو جہاں سے میں نکلا تھا، تو اس نے کہا: خوش آمدید!\n\n### [بے شک اللہ سبحانہ اپنے منکسر اور فقیر بندے کے لیے اس سے زیادہ غیرت کرتا ہے جتنا وہ اپنی ذات کے لیے کرتا ہے]\n\nجان لو، اللہ تعالیٰ تمہیں توفیق دے، کہ اللہ سبحانہ اپنے منکسر (ٹوٹے ہوئے) اور فقیر (محتاج) بندے کے لیے اس سے زیادہ غیرت کرتا ہے جتنا وہ اپنی ذات کے لیے کرتا ہے۔ کیونکہ اس نے اپنے بندوں سے غیرت کرنے کا مطالبہ کیا ہے، اور جب اللہ کی حرمتوں کو پامال کیا جاتا ہے تو وہ غیرت کرتا ہے۔ لیکن تمہاری اللہ کے لیے غیرت کا فائدہ تم پر لوٹتا ہے، اور اس کی تمہارے لیے غیرت کا فائدہ بھی تم پر ہی لوٹتا ہے، نہ کہ اس پر۔ پس وہ سبحانہ و تعالیٰ تمہارے لیے اپنی غیرت کے سبب تمہاری تعریف کرتا ہے، اور تمہاری اس کے لیے غیرت کے سبب بھی تمہاری تعریف کرتا ہے۔ پس تم ہر حال میں اور ہر طرح سے محمود ہو۔ اور یہ فصل بندے کے لیے سب سے بلند مقام ہے، اس کے بعد کوئی مقام نہیں ہے۔ لہٰذا بندے کے لیے ضروری ہے کہ وہ اس مقام پر اپنے نفس کے لیے غیرت کرے، کیونکہ اللہ اس کے لیے غیرت کرتا ہے۔\n\nپس جب کوئی مطیع، نافذ الامر بادشاہ حاضر ہو، اور وہ اپنی عظمت کے باوجود تمہارے پاس بطور زائر آیا ہو، اور اسی وقت کوئی کمزور فقیر بھی بطور زائر آیا ہو، تو تمہارا قبول اور تمہاری توجہ اس فقیر پر ہونی چاہیے، یہاں تک کہ وہ اپنے اس کام سے فارغ ہو جائے جس کے لیے وہ آیا ہے۔ کیونکہ اس فقیر کے پاس ذات حق (الحق) کا ظہور (التجلی) اس بادشاہ کی صورت میں ہونے والے ظہور سے زیادہ بلند اور عظیم ہے۔ کیونکہ تم مطیع بادشاہ میں ذات حق کا ظہور (التجلی) ایک ایسی جگہ دیکھتے ہو جو اس کے لائق نہیں ہے، اور اس تنزیہ کے خلاف ہے جو اس کے لیے ضروری ہے۔ اور بندے کو سیادت (سرداری) کا مرتبہ کہاں؟ پس جب وہ اس میں اور اس کے ذریعے ظاہر ہوتا ہے، تو اس نے اس میں خلل ڈالا اور اجنبیوں پر معاملہ مشتبہ کر دیا۔ پس جب انہوں نے اسے اس کے مرتبے میں اس کی صورت پر دیکھا تو سردار کو بندے سے پہچان نہ سکے۔\n\nاسی لیے اللہ تعالیٰ نے فرمایا:\n**وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَداةِ والْعَشِيِّ يُرِيدُونَ وَجْهَهُ ولا تَعْدُ عَيْناكَ عَنْهُمْ تُرِيدُ زِينَةَ الْحَياةِ الدُّنْيا ولا تُطِعْ من أَغْفَلْنا قَلْبَهُ عَنْ ذِكْرِنا واتَّبَعَ هَواهُ وكانَ أَمْرُهُ فُرُطاً وقُلِ الْحَقُّ من رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ**\n(اور اپنے آپ کو ان لوگوں کے ساتھ روکے رکھو جو صبح و شام اپنے رب کو پکارتے ہیں، اس کی رضا چاہتے ہیں، اور تمہاری آنکھیں ان سے نہ ہٹیں کہ تم دنیاوی زندگی کی زینت چاہو، اور اس شخص کی اطاعت نہ کرو جس کے دل کو ہم نے اپنے ذکر سے غافل کر دیا اور جس نے اپنی خواہش کی پیروی کی اور جس کا معاملہ حد سے تجاوز کر گیا۔ اور کہہ دو کہ حق تمہارے رب کی طرف سے ہے، پس جو چاہے ایمان لائے اور جو چاہے کفر کرے۔)\nیعنی تمہیں اللہ کے معاملے میں کسی ملامت کرنے والے کی ملامت نہ پکڑے۔\n\nاس آیت کا سبب یہ تھا کہ مشرکین کے سردار، جیسے اقرع بن حابس اور ان جیسے دیگر لوگوں نے کہا: ہمیں محمد (صلی اللہ علیہ وسلم) کی مجلس میں بیٹھنے سے صرف ان غلاموں کے ساتھ ان کا بیٹھنا روکتا ہے، ان کا اشارہ بلال، خباب بن ارت اور دیگر کی طرف تھا۔ ان پر یہ بات گراں گزری کہ وہ اور غلام ایک ہی مجلس میں جمع ہوں۔ رسول اللہ صلی اللہ علیہ وسلم ایسے لوگوں کے ایمان لانے کے خواہشمند تھے، لہٰذا آپ نے ان غلاموں کو حکم دیا کہ جب وہ ان سرداروں کے ساتھ ہوں تو وہ قریب نہ آئیں، یہاں تک کہ آپ ان کے معاملے سے فارغ ہو جائیں، یا اگر سردار اور غلام آپ کے پاس قبول کیے جائیں تو آپ ان کے لیے مجلس خالی کر دیں۔\n\nپس اللہ نے یہ آیت نازل فرمائی، جو مقام عبودیت اور فقر کے لیے غیرت تھی کہ اسے کسی ایسی عزت اور الوہیت کی صفت سے کم نہ سمجھا جائے جو اپنے محل کے علاوہ کہیں اور ظاہر ہوئی ہو۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم جب ان غلاموں اور ان جیسے لوگوں کے ساتھ بیٹھتے تھے تو اس وقت تک کھڑے نہیں ہوتے تھے جب تک کہ وہ خود آپ کے پاس سے نہ اٹھتے، خواہ وہ کتنا ہی لمبا بیٹھتے۔ آپ صلی اللہ علیہ وسلم فرمایا کرتے تھے: **\"إن الله أمرني أن أحبس نفسي معهم\"** (بے شک اللہ نے مجھے حکم دیا ہے کہ میں اپنے آپ کو ان کے ساتھ روکے رکھوں)۔ جب وہ زیادہ دیر بیٹھتے تو بعض صحابہ جیسے ابوبکر وغیرہ انہیں اشارہ کرتے کہ وہ اٹھ جائیں تاکہ رسول اللہ صلی اللہ علیہ وسلم اپنے بعض کاموں کے لیے فارغ ہو سکیں۔\n\nیہ اللہ کی اپنے فقیر، منکسر بندے کے لیے غیرت میں سے ہے، اور یہ عبودیت کے شرف اور اس پر قائم رہنے کی سب سے بڑی دلیل ہے۔ یہ وہ مقام ہے جس کی طرف ہم لوگوں کو دعوت دیتے ہیں۔ کیونکہ تمام نفوس کے نزدیک صاحب جاہ اور صاحب مال کی تعظیم ہوتی ہے، اس لیے کہ عزت اور غنا (بے نیازی) اللہ تعالیٰ کے لیے ہے۔ پس جہاں کہیں یہ صفت جلوہ گر ہوتی ہے، لوگ تواضع اختیار کرتے ہیں اور اس کے سامنے محتاج ہو جاتے ہیں۔ اور وہ اس میں فرق نہیں کرتے جو ذاتی عزت اور غنا ہے اور جو ان میں سے عرضی ہے، مگر صرف اس صفت کے مشاہدے کی بنا پر۔\n\nاسی لیے لوگوں کی نظروں میں وہ شخص عظیم ہوتا ہے جو ان سے بے نیاز ہو جائے اور ان کے ہاتھوں میں موجود چیزوں سے زہد اختیار کرے۔ پس تم بادشاہوں کو، ان کی عزت اور سلطنت کے باوجود، زاہدوں کے سامنے غلاموں کی طرح دیکھتے ہو، اور یہ ان کے اللہ کے ساتھ غنا (بے نیازی) اور ان کی عزت اور دنیاوی مال و متاع میں ان کی محتاجی نہ ہونے کی وجہ سے ہے۔\n\nپس اگر فقیر کسی مالدار سے عزت یا مال میں سے کچھ طلب کرے، تو وہ اس کی آنکھ سے اسی قدر گر جاتا ہے، باوجود اس کے کہ وہ اس کی حاجت پوری کرنے میں جلدی کرتا ہے۔ یہاں تک کہ اگر بادشاہ کے دل میں اس کی مرتبت کو اس حاجت کے طلب کرنے سے پہلے تولا جائے اور اس کے بعد تولا جائے، تو وہ اس قدر کم ہو جائے گی جتنا اس نے طلب کیا تھا۔\n\nپس ذات حق (الحق) کی صفت جہاں کہیں بھی ظاہر ہوتی ہے، وہ ان لوگوں کے نزدیک محبوب اور مطلوب ہوتی ہے جو اس کے مستحق کے پاس اس کے ظہور اور اس کے غیر مستحق کے پاس اس کے ظہور میں فرق نہیں کرتے۔\n\nاگر یہ جاہل جان لیتا کہ مال کا سب سے زیادہ محتاج وہ ہے جس کے پاس سب سے زیادہ مال ہے۔ اس کی وجہ یہ ہے کہ شدید فقر والا شخص اپنی ضرورت کو پورا کرنے کے لیے لازمی طور پر محتاج ہوتا ہے، یہ فقر ذاتی ہے۔ جبکہ مالدار شخص، اس کے مال کی کثرت کے باوجود، اگر وہ اسے اپنی عمر، اپنے بیٹوں اور پوتوں کی عمر پر تقسیم کر دے تو بھی انہیں کافی ہو جائے، اس کے باوجود وہ اپنے اہل و عیال کو چھوڑ کر اپنے مال کے ساتھ سفر کرتا ہے اور سمندروں، دشمنوں اور دور دراز کے علاقوں میں مشرق و مغرب میں صحراؤں کو عبور کرتے ہوئے خطرہ مول لیتا ہے تاکہ اپنے پاس موجود مال پر ایک اضافی درہم حاصل کر سکے۔ یہ اس کی شدید محتاجی کی وجہ سے ہے۔ اور بسا اوقات وہ اس اضافے کی طلب میں ہلاک ہو جاتا ہے، یا اس کا مال ڈوب جاتا ہے یا چھین لیا جاتا ہے، اور بسا اوقات وہ اپنے سفر میں قید ہو جاتا ہے یا مارا جاتا ہے۔ ان تمام مشکلات کے باوجود وہ اس اضافے کی طلب میں سفر نہیں چھوڑتا۔ اگر اس کی جہالت اور شدید فقر نہ ہوتا تو وہ حقیر چیز کی طلب میں جانوں کو خطرے میں نہ ڈالتا۔\n\nپس فقیر زاہد دیکھتا ہے کہ یہ مالدار اس سے کہیں زیادہ فقیر ہے، اور وہ اپنے فقر میں مذموم ہے۔ اور یہ زاہد اگر اپنے رب کے ساتھ ان دنیاوی چیزوں سے بے نیاز نہ ہوتا تو وہ تاجروں اور بادشاہوں سے بھی زیادہ ان کی طلب میں حریص ہوتا۔\n\nہمارے اس معنی میں کچھ اشعار ہیں، جن میں سے:\n**بالمال ينقاد كل صعب *** من عالم الأرض والسماء**\nمال کے ذریعے زمین و آسمان کے عالم کی ہر مشکل چیز مطیع ہو جاتی ہے۔\n**يحسبه عالم حجابا *** لم يعرفوا لذة العطاء**\nعالم اسے حجاب سمجھتے ہیں، انہوں نے عطا کی لذت کو نہیں جانا۔\n**لو لا الذي في النفوس منه *** لم يجب الله في دعاء**\nاگر وہ چیز نہ ہوتی جو نفوس میں اس سے ہے، تو اللہ دعا میں قبول نہ کرتا۔\n**لا تحسب المال ما تراه *** من عسجد مشرق الراء**\nاس مال کو نہ سمجھو جو تم دیکھتے ہو، چمکدار سونے کی صورت میں۔\n**بل هو ما كنت يا بنيي *** به غنيا عن السواء**\nبلکہ اے میرے بیٹے! وہ مال وہ ہے جس کے ذریعے تو غیر سے بے نیاز ہو جائے۔\n**فكن برب العلا غنيا *** وعامل الحق بالوفاء**\nپس ربِ اعلیٰ کے ساتھ غنی (بے نیاز) ہو جا، اور ذات حق (الحق) کے ساتھ وفاداری سے معاملہ کر۔\n\nاور اسی بارے میں ہماری ایک قصیدے سے بھی ہے:\n**المال يصلح كل شي‏ء فاسد *** وبه يزول عن الجواد عثارة**\nمال ہر فاسد چیز کی اصلاح کرتا ہے، اور اسی سے سخی کی لغزش دور ہوتی ہے۔\n\nیہ ایک ایسا طریقہ ہے جسے ہمارے اہل طریق نے نظر انداز کر دیا، اور انہوں نے اللہ کے ساتھ غنا (بے نیازی) کو سب سے بڑا مرتبہ سمجھا، اور اس چیز نے انہیں اللہ کی طرف فقر (محتاجی) پر تنبیہ کے ذریعے تحقیق سے حجاب میں ڈال دیا، جو ان کی حقیقی صفت ہے۔ پس انہوں نے اسے اللہ کے ساتھ غنا میں شامل کر دیا، اپنے غنا کی محبت کے ضمن میں، جو ان کی صفت سے خروج ہے۔\n\nاور مرد وہی ہے جس نے اپنی قدر کو پہچانا اور اپنی صفت کے ساتھ متحقق ہوا، اور اپنے مقام سے باہر نہیں نکلا، اور اپنے رب کی خلعت، اس کے لقب اور اس کے نام کو اپنے اوپر باقی رکھا، جس سے اس نے اسے ملقب کیا اور نام دیا، پس فرمایا: **أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ** (تم سب اللہ کے محتاج ہو، اور اللہ ہی بے نیاز، قابل تعریف ہے)۔\n\nپس نفس کی رعونت اور جہالت کی وجہ سے اس نے اپنے رب کے نام الغنی (بے نیاز) میں شریک ہونا چاہا، لہٰذا اس نے اللہ کے ساتھ غنی کہلانا اور اس سے متصف ہونا چاہا تاکہ اس پر الغنی کا نام لاگو ہو جائے اور وہ الفقیر کے نام سے نکل جائے۔ پس ان دو آدمیوں کے درمیان فرق دیکھو۔\n\nاور میں نے اپنے اہل طریق میں سے کسی کو نہیں دیکھا جس نے ان باطنی نفسانی آفات کی طرف اشارہ کیا ہو جو ہم نے ذکر کی ہیں، سوائے اللہ تعالیٰ کے۔ وہی ہے جس نے اپنے بندوں کو ان پر متنبہ کیا۔ اور اس کے بعد بھی انہوں نے سنا اور اندھے بن گئے۔ اور میں نے کتنی کوشش کی کہ کسی میں اس پر کوئی تنبیہ دیکھوں، مگر مجھے نہیں ملی۔ اور میں اللہ تعالیٰ سے دعا کرتا ہوں کہ ہمیں ان لوگوں میں شامل نہ کرے جو اس میں منفرد ہوں، اور ہمارے عارف بھائیوں کو اس میں ہمارا شریک بنائے۔ جہاں تک ہمارے ساتھیوں کا تعلق ہے، تو انہوں نے اسے ہم سے لیا اور اپنے نفوس میں اس کے ساتھ متحقق ہوئے، اور اب ان پر صرف اس کے ساتھ متخلق ہونا باقی ہے، اور یہ کہ یہ ہمیشہ ان کی صفت رہے، لیکن اس کے بعد جب ہم نے اپنے بیٹوں کو پہچانا تو انہوں نے اس مرتبے کو پہچانا اور اس چیز پر متنبہ ہوئے جسے عارفین میں سے لوگوں نے جہالت میں رکھا۔ پس انہیں بہت زیادہ خیر حاصل ہوا، اور اس قدر نے انہیں اللہ تعالیٰ کے ساتھ سوءِ ادب سے روکا۔\n\n### [اللہ تعالیٰ کے راستے میں سوءِ ادب میں سے]\n\nاور اللہ تعالیٰ کے راستے میں سوءِ ادب میں سے، اور یہ وہ چیز ہے جس کے ذریعے اللہ عارفین کو استدراج کرتا ہے، وہ یہ ہے کہ شیوخ اپنے مریدین پر اس چیز کی وجہ سے عزت کا اظہار کریں جس میں مریدین ان کے محتاج ہیں، یعنی تربیت میں، اور ان سے امتیاز حاصل کریں۔\n\nپس اگر شیخ اس مقام کا حق ادا نہ کرے تو مرید کا اس کی طرف فقر (محتاجی) اسے اپنے رب کی طرف فقر سے حجاب میں ڈال دیتا ہے، اور اس وقت اس کا مشاہدہ اللہ کے ساتھ اس کا غنا (بے نیازی) ہوتا ہے۔ اور اللہ کے ساتھ غنی عزت کا طالب ہوتا ہے۔\n\nجبکہ اس مقام کے محقق صاحب کا حال یہ ہوتا ہے کہ جب وہ مریدین کو اپنے پاس موجود اللہ کی عطا کردہ چیزوں میں اپنا محتاج دیکھتے ہیں، تو وہ اللہ کا شکر ادا کرتے ہیں کہ اللہ نے اپنے محتاجوں کو اس کے ساتھ لازم کر دیا ہے جو ان کے فقر کی صفت کے ذریعے اسے اللہ تعالیٰ کی طرف اس کے فقر پر ثابت رکھتے ہیں۔ کیونکہ بسا اوقات اگر ان کے فقر کی صفت اس کی طرف ظاہر نہ ہوتی تو وہ اللہ تعالیٰ کی طرف اپنے فقر کو بھول جاتا۔\n\nپس محقق شیخ کا حال ایسا ہی ہوتا ہے۔ یہ شیخ اپنے محتاج مریدین کو اس شخص کی آنکھ سے دیکھتا ہے جو اسے اس کے راستے پر ثابت رکھتا ہے تاکہ اس میں اس کا قدم نہ پھسلے۔ وہ اس ڈوبنے والے کی طرح ہے جسے کوئی ہاتھ پکڑنے والا مل جائے، اس ڈوبنے والے کی اس شخص سے کتنی محبت ہوگی جس نے اس کی زندگی کو تھام لیا۔\n\nپس یہ شیخ مرید کا حق اپنے اوپر مرید کے حق سے زیادہ عظیم سمجھتا ہے۔ پس مرید حال کے اعتبار سے شیخ کا شیخ ہے، اور شیخ قول اور تربیت کے اعتبار سے مرید کا شیخ ہے۔ اگر تم عاقل ہو تو میں نے تمہیں سب سے نفیس راستے پر متنبہ کر دیا ہے، پس اس پر عمل کرو، میں نے تمہیں نصیحت میں کوئی کسر نہیں چھوڑی۔\n\nاور ہمارے لیے:\n**أنا عبد والذل بالعبد أولى *** لا أراني للعز بالحق أهلا**\nمیں بندہ ہوں اور ذلت بندے کے لیے زیادہ لائق ہے، میں اپنے آپ کو ذات حق (الحق) کے ساتھ عزت کے لائق نہیں سمجھتا۔\n**فانظروني فكلما قلت قولا *** كان قولي حالا وعقدا وفعلا**\nپس مجھے دیکھو، میں جب بھی کوئی قول کہتا ہوں، میرا قول حال، عقد اور فعل ہوتا ہے۔\n**إن غيري يقول إني عبد *** فإذا ما سببته قال مهلا**\nبے شک میرے علاوہ کوئی کہتا ہے کہ میں بندہ ہوں، پس جب میں اسے برا کہتا ہوں تو وہ کہتا ہے: ٹھہرو!\n\n### [پس بے شک فقیر مومن تمہاری حقیقت کا مظہر ہے اور تمہیں اپنے نفس کے مشاہدے کا حکم دیا گیا ہے]\n\nپس اے ولی حمیم! علم کو گمان سے منسوخ نہ کرو، پس سب سے زیادہ خسارہ پانے والا وہ ہے جس کا حال یہ ہو۔ ایمان کی عزت بلند ہے اور فقر (محتاجی) کی عزت زیادہ لائق ہے۔ تمہارا کام یہ ہونا چاہیے کہ تم فقیر مومن کی تعظیم کرو، اس مومن پر جو اپنے مال سے غنی اور اپنے جاہ سے عزیز ہے اور اپنے نفس سے محجوب ہے۔\n\nکیونکہ فقیر مومن تمہاری حقیقت کا مظہر (مجلی) ہے، اور تمہیں اپنے نفس کے مشاہدے کا حکم دیا گیا ہے، اس کے راستے سے نکلنے سے بچنے کے لیے۔ پس فقیر مومن تمہارا آئینہ ہے جس میں تم اپنے نفس کو دیکھتے ہو، اور وہ مومن جو مال کے ذریعے تم سے بے نیاز ہے، وہ تمہارے لیے زنگ آلود آئینہ ہے، جس میں تم اپنے آپ کو نہیں دیکھ سکتے، پس تم نہیں جان سکتے کہ تمہارے چہرے پر کیا تبدیلی آئی ہے۔\n\nاللہ نے اپنے نبی کو بے فائدہ ملامت نہیں کی، بلکہ اللہ نے اس میں ہدایت کے سب سے بلند راستے کو واضح کیا اور ہلاکت کے راستے سے روکا، پس فرمایا: **كَلَّا** (ہرگز نہیں)، یہ اس حالت سے روکنے اور ڈانٹنے کے لیے تھا جو تمہیں اس چیز سے حجاب میں ڈالتی ہے جو میں نے تمہیں اس نصیحت میں ذکر کی اور مقرر کی۔\n\nپس تم غنا (بے نیازی) اور عزت کو ان کے مستحق، یعنی اللہ تعالیٰ کے برابر نہ ٹھہراؤ، تاکہ تم ان کامل علماء میں سے ہو جاؤ جنہوں نے اپنے علم کو غفلت اور نسیان سے آلودہ نہیں کیا۔ معذرت کے بعد، جب میں نے تمہیں اس بہترین طریقے سے آگاہ کر دیا جس سے وہ لوگ غائب رہے جن کے لیے کمال کی گواہی دی گئی تھی۔\n\n### [بے شک انسان کو احوال قابو کر لیتے ہیں]\n\nجان لو کہ احوال انسان کو قابو کر لیتے ہیں، یہ لازمی ہے۔ اور اگر تم کسی ایسے شخص کے بارے میں سنو جو احوال کا مالک ہے، تو وہ کسی حال کا مالک نہیں ہوتا مگر کسی دوسرے حال کے ذریعے، پس وہ حال جس نے اسے اس حال کی ملکیت کا سبب بنایا، وہی اس وقت اس پر حاکم ہوتا ہے، کیونکہ وقت اسی کا ہے۔\n\nہمارے اہل طریق میں سے بعض لوگ اس مسئلے میں غلطی کر گئے اور انہوں نے انبیاء علیہم السلام اور اولیاء کے درمیان فرق کو حال کی ملکیت قرار دیا۔ انہوں نے کہا کہ انبیاء احوال کے مالک ہوتے ہیں اور اولیاء کو احوال تصرف کرتے ہیں، اور یہ ہر لحاظ سے ایک بڑی غلطی ہے۔ کیونکہ انسان کبھی بھی کسی حال سے خالی نہیں ہوتا جس پر وہ قائم ہو کر اپنے وقت کے ساتھ معاملہ کرتا ہے، اور وہی اس پر حاکم ہوتا ہے۔\n\n### [بے شک اللہ نے اکابر کے نفوس میں ذات حق کی صفات کی تعظیم مقرر کر دی ہے]\n\nاور جان لو کہ اللہ نے اللہ کے اکابر رجال کے نفوس میں ذات حق (الحق) کی صفات کی تعظیم مقرر کر دی ہے جہاں کہیں بھی وہ ظاہر ہوں۔ پس اگر وہ کسی ایسے شخص پر ظاہر ہوں جس میں وہ عرضی طور پر ہیں، تو اس ولی کا تعظیم ذات حق کی صفت کے لیے ہوتا ہے، نہ کہ اس محل کے لیے جس میں وہ ظاہر ہوئی ہے۔\n\nاگر وہ غافل ہو جائے تو وہ موصوف کے ذریعے صفت سے محجوب ہو جاتا ہے، پس وہ اس کی وجہ سے اس کی تعظیم کرتا ہے۔ اور یہ صرف اسی شخص میں ہونا چاہیے جسے ذات حق نے وہ صفت پہنائی ہو، نہ کہ اس میں جس نے اسے چوری کیا ہو، جیسے وہ شخص جو جھوٹ کے دو کپڑے پہننے والا ہو، اس شخص کی طرح جو اس چیز سے سیر ہو جو اس کی ملکیت میں نہیں ہے۔\n\nاور جب ولی ذات حق کی صفت کی تعظیم کرتا ہے جب وہ اسے کسی شخص میں ظاہر ہوتی ہے، اور اس کی اپنی صفت کسی دوسرے شخص میں ظاہر ہوتی ہے، تو وہ اپنی صفت سے اعراض کرتا ہے، اس تعظیم کی وجہ سے کہ وہ اپنے نفس کے مشاہدے سے ذات حق سے اعراض نہ کرے۔ پس اس کا مقصد صرف تعظیم ہوتا ہے، اور اس کے ساتھ اس محل کی تعظیم بھی شامل ہو جاتی ہے جس میں ذات حق کی صفت ظاہر ہوئی، اگرچہ وہ تعظیم کرنے والے کا مقصود نہیں ہوتا۔ اس کے باوجود، جس چیز پر ہم نے تمہیں متنبہ کیا ہے، وہ اس سے زیادہ اولیٰ اور تقدیم کی حقدار ہے۔\n\nاور نبی صلی اللہ علیہ وسلم کا یہ قول کتنا عمدہ ہے جہاں آپ نے فرمایا: **\"انزلوا الناس منازلهم\"** (لوگوں کو ان کے مرتبوں پر رکھو) یا فرمایا: **\"أمرت أن أنزل الناس منازلهم\"** (مجھے حکم دیا گیا ہے کہ میں لوگوں کو ان کے مرتبوں پر رکھوں)۔\n\nاور اللہ کی قسم! لوگوں کے مرتبے معلوم ہیں۔ اور آپ نے یہ نہیں فرمایا کہ ہر ایک کو اس کا مرتبہ دو، بلکہ فرمایا: \"لوگوں کو\"۔ پس وہ صفت جو ان سب کو شامل ہے، وہی ہے جس میں نبی صلی اللہ علیہ وسلم نے ہمیں انہیں رکھنے کا حکم دیا، اور وہ وہی ہے جو ہم نے ذکر کی اور تمہیں اس پر متنبہ کیا، یعنی ذلت اور افتقار (محتاجی)۔\n\nاور قرآن میں انسان کو جس چیز سے بھی وصف کیا گیا ہے جو اس کی حقیقت نہیں ہے، وہ صرف اس دعوے کے مقابلے میں ہے جو کسی غیر اہل نے کیا ہو، پس اس کا مقابلہ اس کی جنس سے کیا گیا تاکہ اس کے حق میں زیادہ تکلیف دہ ہو۔\n\nاس بارے میں عبداللہ بن ابی ابن سلول نے کہا تھا: **لَئِنْ رَجَعْنا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ** (اگر ہم مدینہ واپس لوٹے تو جو زیادہ عزت والا ہے وہ کم عزت والے کو وہاں سے نکال دے گا)۔ اس کا مطلب تھا کہ وہ محمد (صلی اللہ علیہ وسلم) اور ان کے ساتھیوں کو وہاں سے نکال دے گا۔ پس اس کا بیٹا آیا اور اس نے رسول اللہ صلی اللہ علیہ وسلم کو اس کی خبر دی اور اپنے باپ کو قتل کرنے کی اجازت مانگی، جب اس نے اللہ کا یہ قول سنا: **لَا تَجِدُ قَوْمًا يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ يُوَادُّونَ مَنْ حَادَّ اللَّهَ وَرَسُولَهُ وَلَوْ كَانُوا آبَاءَهُمْ** (تم ایسی کوئی قوم نہیں پاؤ گے جو اللہ اور یوم آخرت پر ایمان رکھتی ہو اور ان لوگوں سے دوستی رکھے جو اللہ اور اس کے رسول کی مخالفت کرتے ہیں، خواہ وہ ان کے باپ ہی کیوں نہ ہوں)۔ اور وہ منافقوں میں سے تھا۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں یہ نہیں چاہتا کہ لوگ یہ کہیں کہ محمد اپنے ساتھیوں کو قتل کرتا ہے۔\n\nپس اللہ نے منافقین کے اس دعوے کے مقابلے میں عزت کو اپنے رسول اور مومنین کے لیے ثابت کیا، پس اللہ تعالیٰ نے فرمایا: **يَقُولُونَ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ وَلِلَّهِ الْعِزَّةُ وَلِرَسُولِهِ وَلِلْمُؤْمِنِينَ وَلَكِنَّ الْمُنَافِقِينَ لَا يَعْلَمُونَ** (وہ کہتے ہیں کہ اگر ہم مدینہ واپس لوٹے تو جو زیادہ عزت والا ہے وہ کم عزت والے کو وہاں سے نکال دے گا، حالانکہ عزت تو اللہ کے لیے ہے اور اس کے رسول کے لیے اور مومنوں کے لیے ہے، لیکن منافقین نہیں جانتے)۔\n\nوہ نہیں جانتے کہ عزت کس کی طرف منسوب کی جاتی ہے، تو وہ اسے مومنین میں سے غیر اللہ کی طرف کیسے منسوب کرتے ہیں؟ اور رسول اور مومن کا اس میں کیا حصہ ہے؟ اور اللہ تعالیٰ نے ان کے نکالے جانے کا ذکر نہیں کیا، اور نہ ہی انہیں نکالا گیا۔ بلکہ یہ کہنے والا مدینہ میں ہی رہا یہاں تک کہ مر گیا، اور رسول اللہ صلی اللہ علیہ وسلم نے اس کے کفن کے لیے اپنا کپڑا دیا، یہ اس احسان کا بدلہ تھا جو اس نے نبی صلی اللہ علیہ وسلم پر کیا تھا جب آپ کے چچا عباس غزوہ بدر میں قیدی بنائے گئے تھے، تو اس منافق نے انہیں اپنا کپڑا پہنایا تھا۔ پس قیامت کے دن اس منافق کے لیے نبی صلی اللہ علیہ وسلم سے اس وجہ سے کوئی مطالبہ باقی نہیں رہے گا۔\n\nاگر تم کسی عارف کو اس طرح کے معاملے میں پڑا ہوا دیکھو، تو جان لو کہ اس کا مقصد صرف ذات حق کی صفت کی تعظیم اور اپنے نفس کو حقیر سمجھنا ہے۔ اگر تم مقام میں اس کے برابر ہو یا اس سے بڑے ہو، تو اسے اس چیز کی یاد دہانی کراؤ جو میں نے تمہیں بتائی ہے۔ اور اگر یہ مقام تمہارا ہے اور تم اس کے شاہد ہو، تو لازمی طور پر تم اس حالت میں اس سے بڑے ہو، اگرچہ تم کسی اور حالت میں اس سے کم ہو۔ پس ہر صورت میں اسے یاد دہانی کراؤ۔ اور اگر اس وقت اس کا حال ایمان کا ہے، تو وہ نصیحت قبول کرے گا۔ اگر وہ تمہیں جھڑک دے اور کہے کہ کیا تم مجھ جیسے شخص سے یہ کہتے ہو، تو جان لو کہ وہ اللہ کی نظر سے گر چکا ہے اور اللہ نے اسے اپنی عبودیت اور ایمان سے حجاب میں ڈال دیا ہے۔ پس اسے چھوڑ دو، تم نے وہ کر دیا جو اللہ نے تم پر فرض کیا تھا، اور اس کے لیے دعا کرو، کیونکہ اللہ نے اس کی بصیرت کو راستے سے اندھا کر دیا ہے۔\n\n### [اللہ کے نزدیک سب سے بلند منازل]\n\nاور جان لو کہ یہ صفت جس پر میں نے تمہیں متنبہ کیا ہے، اس نے ہمیں حضور قدس سے ایک حال اور مشاہدہ عطا کیا ہے، پس یہی اس کا ٹھکانہ ہے۔ اور اس سے وہی متصف ہوتا ہے جس کے لیے اللہ کے نزدیک سب سے بلند منازل ہوں۔ پس اگر وہ رسول ہے تو رسالت میں سب سے بلند منازل، اگر نبی ہے تو نبوت میں سب سے بلند منازل، اگر ولی ہے تو ولایت میں سب سے بلند منازل، اگر مومن ہے تو ایمان میں سب سے بلند منازل، اور اگر نصرانی، مجوسی، یہودی یا معطل ہے، تو وہ اپنے صنف اور اپنے مقام میں اس کے ذریعے سب سے بلند منازل پر ہے۔\n\n**أن الكبير من الرجال هو الذي *** لا يدعيه مقيدا ومسودا**\nمردوں میں بڑا وہ ہے جو اس کا دعویٰ نہیں کرتا، نہ مقید ہونے کا اور نہ سردار ہونے کا۔\n**و مهودا ومنصرا وممجسا *** ومعطلا ومشركا وموحدا**\nاور نہ یہودی ہونے کا، نہ نصرانی ہونے کا، نہ مجوسی ہونے کا، اور نہ معطل ہونے کا، نہ مشرک ہونے کا، نہ موحد ہونے کا۔\n**و منزها ومشبها ومحيزا *** وممكنا ومروحنا ومجسدا**\nاور نہ منزہ ہونے کا، نہ مشبہ ہونے کا، نہ محدود کرنے والا ہونے کا، اور نہ ممکن ہونے کا، نہ روحانی ہونے کا، نہ جسمانی ہونے کا۔\n**عمت صفات جلاله وجماله *** كل الأنام وكان حتى يقصدا**\nاس کے جلال اور جمال کی صفات تمام مخلوقات پر محیط ہیں، اور وہ تھا یہاں تک کہ اس کا قصد کیا جائے۔\n**إن الغيور هو الذي لا ينثني *** عن نفسه حال الضلالة والهدى‏**\nبے شک غیور وہ ہے جو گمراہی اور ہدایت کے حال میں اپنے نفس سے باز نہیں آتا۔\n\nاور وہ محل جس پر یہ صفت قائم ہوتی ہے، اس کے صاحب کے لیے ضروری ہے، خواہ وہ کسی بھی ملت یا مذہب پر ہو، کہ وہ ہدایت کے دین کی طرف لوٹے، اسلام قبول کرے، ایمان لائے، اور محقق کشف (الکشف) اور صحیح علم کے ذریعے مکارم اخلاق کی طرف سبقت کرے۔ پس وہ لوگوں میں ایمان کے لحاظ سے سب سے کامل اور اللہ کے نزدیک سب سے عظیم مرتبے والا ہو گا، جو رسولوں اور انبیاء علیہم السلام کے مراتب اور ان میں سے بعض کی بعض پر فضیلت، اور اولیاء اور مومنین کے مراتب کو جانتا ہو گا۔ کیونکہ وہ صفت جو اسے اسلام کی طرف لے گئی، وہ بندے کے حق میں اللہ کے نزدیک قدر و منزلت میں سب سے عظیم صفات میں سے ہے۔ پس وہ اسے بلند منازل پر اتارتی ہے اور اسے علیین میں بلند کرتی ہے۔ اور فرشتے جو اس کا استقبال کرتے ہیں، وہ ہر وہ فرشتہ ہے جو اللہ کے نزدیک کریم ہے اور اپنے رب کی عبادت میں احسان کرنے والا ہے، وہی اس بندے کے پاس اللہ کی طرف سے نازل ہوتا ہے، اس مناسبت کی وجہ سے جو اس فرشتے اور اس بندے کے درمیان ہے۔ پس وہ اس کا ہاتھ پکڑتا ہے اور اسے اس صفت کی منزل کی طرف علیین میں بلند کرتا ہے۔ پس اس کی صنف میں اس سے بلند مرتبے والا کوئی نہیں ہوتا، سوائے اس کے جس نے اس کا عمل کیا ہو، کیونکہ وہ اس کے درجے میں اور اس کے ساتھ ہے۔ اور اس منزل کے لیے یہ قدر کافی ہے۔\n\nجہاں تک ان مسائل اور علوم کا تعلق ہے جو اس میں شامل ہیں، تو وہ نعمتوں کی ناشکری کا علم، کفر کی تفصیلات، اور ہر کفر اپنے صاحب کو کہاں تک پہنچاتا ہے، جیسے بھاگ جانے والے غلام کا کفر، نماز چھوڑنے والے کا کفر، اور اللہ کی نازل کردہ بعض چیزوں کا انکار کرنے والے کا کفر۔ اور علم البدو (ابتداء کا علم)، اور شرائع کو وضع کرنے کا علم، اور برازخ (برزخوں) کا علم، اور بعث (دوبارہ اٹھائے جانے) کا علم، اور زمین کی خوراکوں کا علم، اور آسمانوں کا معاملہ، اور جو کچھ آسمان اور زمین کے درمیان، اور ذات حق (الحق) اور کون (کائنات) کی توجہات کے درمیان، اور ہر دو جوڑوں کے درمیان پیدا ہوتا ہے۔ اور انسان اور حیوان کا علم، اور قیامت (الساعۃ) کا علم، اور اسے ساعۃ کیوں کہا گیا، اور کیا ہر زبان میں اس کا یہی معنی ہے جو اسم الساعۃ سے سمجھا جاتا ہے یا نہیں؟ اور کیا ساعۃ کی کوئی صورت ہے جس میں سننے، دیکھنے اور تمیز کرنے کی ادراک ہو یا نہیں؟ اور ہر مرتبے کو قائم رکھنے والی صفات کا علم، تاکہ اس کے اہل اس کے ذریعے ممتاز ہو سکیں۔\n\nاور ان دو کتابوں کا علم جنہیں رسول اللہ صلی اللہ علیہ وسلم اپنے ہاتھوں میں لے کر اپنے صحابہ کے پاس نکلے، پس آپ صلی اللہ علیہ وسلم نے فرمایا: **\"إن في الكتاب الواحد أسماء أهل الجنة وأسماء آبائهم وقبائلهم وعشائرهم وفي الكتاب الآخر أسماء أهل النار وأسماء آبائهم وقبائلهم وعشائرهم\"** (بے شک ایک کتاب میں اہل جنت کے نام، ان کے باپوں کے نام، ان کے قبیلوں اور خاندانوں کے نام ہیں، اور دوسری کتاب میں اہل جہنم کے نام، ان کے باپوں کے نام، ان کے قبیلوں اور خاندانوں کے نام ہیں)۔\n\nان دونوں کتابوں کے چھوٹے حجم اور ناموں کی کثرت کے باوجود، اس سے یہ معلوم ہوتا ہے کہ بڑے کو چھوٹے پر وارد کرنا، بڑے کو چھوٹا کیے بغیر یا چھوٹے کو بڑا کیے بغیر ممکن ہے۔ ورنہ کون سا رجسٹر ان تمام ناموں کو محدود کر سکتا ہے؟ اور یہ معلوم ہوتا ہے کہ وہ امر جسے عقل محال قرار دیتی ہے، وہ نسبت الٰہیہ کے لحاظ سے محال نہیں ہے۔ پس تم جانتے ہو کہ اللہ عقلی محال پر قادر ہے، جیسے اونٹ کو سوئی کے ناکے میں داخل کرنا، جبکہ اونٹ اپنے بڑے پن پر اور سوئی کا ناکہ اپنے چھوٹے پن پر باقی رہے۔ اور اس منزل سے وہ مقام مشاہدہ کیا جاتا ہے جو عقل کی حد سے ماورا ہے، اس لحاظ سے کہ وہ مفکر ہونے کی حیثیت سے ادراک میں مستقل ہے۔ ورنہ انبیاء علیہم السلام اور اولیاء کی عقل اس امر سے پہلے قبول کرنے والی ہونے کی حیثیت سے ہے، نہ کہ اس حیثیت سے جو ہم نے ذکر کی۔ پس عقلوں کی ایک حد ہے جہاں وہ رک جاتی ہیں، اور اللہ کی کوئی حد نہیں جہاں وہ رک جائے، بلکہ وہ حدود کا خالق ہے، پس وہ سبحانہ و تعالیٰ بے حد ہے۔ **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و چهارم: در شناخت منزل ترجیح بی‌نیازی (الغناء) بر فقر از مقام موسوی و ترجیح فقر بر بی‌نیازی از حضرت عیسوی.\n\nبی‌نیازی نفس محقق عاریتی است *** و فقر نفس، خواری و شکستگی است.\n\nاگر فقیر، پادشاه باشد *** جهانیان را زیارت کند و زیارت نشود (مورد زیارت قرار نگیرد).\n\nو اگر غنی، بنده باشد *** پیشی و فخر از آن او خواهد بود.\n\nحکم جهل بر خلایق فراگیر شده است *** و برای حکم علم، خانه‌ای (جایگاهی) نمی‌دانند.\n\n### و از این منزل نیز سخن ماست:\n\nهستی (الکون) کور است به دلیل نقصی که در آن نهفته است *** و نور نقصی ندارد که آن را پنهان کند.\n\nکمال از آن توست و ضد کمال از آن من، از این رو *** میان من و تو پیمانی است که به آن وفا نمی‌کنیم.\n\nگفته‌ام که تو با معرفت (المعرفة) من شناخته می‌شوی *** و دریای جهل من، عقل مرا در خود غرق کرده است.\n\nحالی را که در آن برای شما بودم، نه برای من، به من ببخش *** زیرا حجاب من در تجلی (التجلی) اوست.\n\nمن از خود تعجب نمی‌کنم هنگامی که مرا به معراج بردند *** و چگونه نزدیکی من در تدلی (نزدیک شدن) او اثر گذاشت.\n\nاگر نزدیکی من نبود، تدلل (ناز کردن) به واسطه او برپا نمی‌شد *** و من علت آنچه او انجام می‌دهد نیستم.\n\nپس به علم خود بگو شاد مباش، زیرا *** دستانت جز به جهلی آشکار در آن دست نیافته است.\n\n### و از این منزل نیز سخن ماست:\n\nاگر نزدیکی من نبود، تدلی (نزدیک شدن) نمی‌کرد *** و نه نزدیک می‌شد و نه تجلی (التجلی) می‌نمود.\n\nپس وجود (الوجود) عین من از او بازگشت *** و چون آراسته شد، متعالی گشت.\n\nپس در زمین او به عنوان امام ایستادم *** خلیفه‌ای، سروری والا.\n\nدر آن به حکم پروردگارم حکم می‌رانم *** و او از عین (ذات) دست نکشیده است.\n\nهنگامی که مرادم کامل شد *** مولایم را ندا دادم، گفت: درنگ کن.\n\nمرا به سوی آنچه از آن خارج شدم ببر *** پس گفت: خوش آمدید.\n\n### [همانا خداوند سبحان برای بنده شکسته و فقیر خود بیشتر از آنچه برای خود غیرت می‌ورزد، غیرت می‌ورزد.]\n\nبدان، خداوند متعال تو را توفیق دهد، که خداوند سبحان برای بنده شکسته و فقیر خود بیشتر از آنچه برای خود غیرت می‌ورزد، غیرت می‌ورزد. زیرا او از بندگانش خواسته است که غیرت بورزند، و خداوند هنگامی که حرمت‌هایش شکسته شود، غیرت می‌ورزد. اما غیرت تو برای خدا، نیکویی‌اش به خودت بازمی‌گردد، و غیرت او عز و جل برای تو نیز نیکویی‌اش به خودت بازمی‌گردد نه به او. پس او سبحانه و تعالی تو را به خاطر غیرتش برای تو می‌ستاید و تو را به خاطر غیرتت برای او می‌ستاید. بنابراین، تو در هر حال و به هر وجهی ستوده‌ای. این فصل، والاترین مقامی است که برای بنده می‌تواند باشد و هیچ مقامی بالاتر از آن نیست. پس بر بنده لازم است که در این مقام برای نفس خود غیرت بورزد و این ضروری است، زیرا خداوند برای او غیرت می‌ورزد.\n\nپس اگر پادشاهی مطاع و نافذالامر با عظمت مرتبه‌اش به عنوان زائر نزد تو آمد، و در همان زمان فقیری ضعیف نیز به عنوان زائر آمد، باید توجه و پذیرش تو نسبت به فقیر باشد و مشغول او شوی تا از کارش که برای آن آمده است فارغ شود. زیرا تجلی (التجلی) حق (الحق) نزد آن فقیر، بالاتر و والاتر از تجلی او در صورت آن پادشاه است. تو حق را در پادشاه مطاع، تجلی‌ای می‌بینی که در غیر موطن شایسته خود و بر غیر وجه تنزیهی که سزاوار اوست، ظاهر شده است. و بنده را چه به مرتبه سیادت (سروری)؟ پس اگر در آن و به واسطه آن ظاهر شود، به آن خلل وارد کرده و امر بر بیگانگان مشتبه می‌شود، به طوری که اگر او را در صورتش در مرتبه‌اش ببینند، سرور را از بنده تشخیص نمی‌دهند. و به همین دلیل خداوند متعال فرمود: **«و با کسانی که پروردگار خود را صبح و شام می‌خوانند و رضای او را می‌خواهند، شکیبایی کن. و چشمانت را از آنان برمگیر که زینت زندگی دنیا را بخواهی. و از کسی که قلبش را از یاد خود غافل کرده‌ایم و از هوای نفس خود پیروی کرده و کارش زیاده‌روی است، اطاعت مکن. و بگو: حق از جانب پروردگار شماست؛ پس هر که می‌خواهد ایمان بیاورد و هر که می‌خواهد کفر ورزد.»** (الکهف: ۲۸-۲۹) یعنی در راه خدا سرزنش هیچ سرزنش‌کننده‌ای شما را نگیرد. و سبب نزول این آیه آن بود که سران کفار از مشرکین، مانند اقرع بن حابس و امثال او، گفتند: چیزی ما را از همنشینی با محمد بازنمی‌دارد مگر همنشینی او با این بردگان (منظورشان بلال و خباب بن ارت و دیگران بود). بر آنان گران بود که یک مجلس، آنان و بردگان را گرد آورد. رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) بر ایمان آوردن امثال این افراد حریص بود، پس به آن بردگان دستور داد که هرگاه او را با این سران دیدند، نزدیک نشوند تا از کارشان فارغ شود، یا اگر سران و بردگان نزد او پذیرفته شدند، مجلس را برای سران خلوت کنند. پس خداوند این آیه را نازل کرد، از روی غیرت برای مقام عبودیت و فقر، تا مبادا با صفتی از عزت و الوهیت که در غیر محل خود ظاهر شده است، مورد تحقیر قرار گیرد. پس از آن، رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) هرگاه با این بردگان و امثالشان همنشین می‌شد، برنمی‌خاست تا اینکه خودشان از نزد او برخیزند، حتی اگر نشستن را طولانی می‌کردند. و می‌فرمود (صَلَّى اللهُ عَليهِ وسَلَّم): «خداوند به من امر کرده است که نفسم را با آنان حبس کنم.» و اگر نشستن را طولانی می‌کردند، برخی از صحابه مانند ابوبکر و دیگران به آنان اشاره می‌کردند که برخیزند تا رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) برای برخی از کارهای خود آسوده شود.\n\nاین از غیرت خداوند برای بنده فقیر و شکسته است و بزرگترین دلیل بر شرافت عبودیت و پایداری بر آن است، و این همان مقامی است که مردم را به سوی آن فرامی‌خوانیم. زیرا همه نفوس، صاحب جاه و صاحب مال را بزرگ می‌شمارند، چون عزت و بی‌نیازی (الغنی) از آن خداوند متعال است. پس هر جا که این صفت تجلی (التجلی) کند، مردم در برابر آن فروتنی کرده و به آن نیازمند می‌شوند، و تفاوت نمی‌گذارند میان آنچه عزت و بی‌نیازی ذاتی است و آنچه از آن دو عرضی است، مگر صرفاً با مشاهده این صفت. به همین دلیل، کسی که از مردم بی‌نیاز باشد و نسبت به آنچه در دست آنان است زهد ورزد، در چشم مردم بزرگ می‌شود. پس پادشاهان را با وجود عزت و سلطنتشان، مانند بردگان در برابر زاهدان می‌بینی، و این به دلیل بی‌نیازی (الغنی) زاهدان به خدا و عدم نیازشان به پادشاهان در عزت و متاع دنیوی است که در دست دارند. پس اگر فقیر از غنیِ دارای مال، چیزی از عزت یا مال طلب کند، به همان اندازه از چشم او می‌افتد، با وجود اینکه غنی برای برآوردن حاجت او شتاب می‌کند. حتی اگر مرتبه فقیر در قلب پادشاه قبل از طلب آن حاجت وزن شود و پس از طلب حاجت وزن شود، به اندازه آنچه طلب کرده است، از آن کاسته شده است.\n\nپس صفت حق تعالی هر جا که ظاهر شود، نزد مردمی که تفاوت نمی‌گذارند میان ظهور آن نزد کسی که شایسته آن است و ظهور آن نزد کسی که شایسته آن نیست، محبوب و مطلوب است. اگر این جاهل می‌دانست که فقیرترین مردم به مال، پرمال‌ترین آنان است. زیرا صاحب فقر شدید، به ناچار به آنچه نیاز دارد که کمبودش را برطرف کند، و این فقر ذاتی است. اما غنیِ دارای مال، با وجود کثرت مالش به گونه‌ای که اگر آن را بر عمر خود و عمر فرزندان و نوادگانش تقسیم کند، کفایتشان می‌کند، با این حال خانواده و فرزندانش را ترک می‌کند و با مال خود سفر می‌کند و در دریاها و در برابر دشمنان و در پیمودن بیابان‌ها به سوی سرزمین‌های دوردست در شرق و غرب، برای به دست آوردن یک درهم بیشتر از آنچه دارد، به دلیل شدت نیازش به آن، خطر می‌کند. و چه بسا در طلب این زیاده هلاک شود و مالش غرق یا گرفته شود، و چه بسا در سفرش اسیر یا کشته شود. با وجود همه این مشکلات، سفر در طلب این زیاده را ترک نمی‌کند. اگر جهل و شدت فقرش نبود، جان‌ها را در طلب پست‌ترین چیزها به خطر نمی‌انداخت. پس فقیر زاهد می‌بیند که این غنی بسیار فقیرتر از اوست و در فقر خود مذموم است، و اگر این زاهد به پروردگارش از این اعراض بی‌نیاز نبود، در طلب آن‌ها حریص‌تر از تاجران و پادشاهان می‌بود. و ما را در این معنی ابیاتی است، از جمله:\n\nبا مال هر امر دشواری رام می‌شود *** از عالم زمین و آسمان.\n\nعالمان آن را حجاب می‌پندارند *** کسانی که لذت بخشش را نشناخته‌اند.\n\nاگر آنچه از آن در نفوس است نبود *** خداوند در دعایی اجابت نمی‌کرد.\n\nمال را آنچه می‌بینی مپندار *** از طلای درخشان.\n\nبلکه ای فرزندم، مال آن چیزی است *** که با آن از غیر خدا بی‌نیاز باشی.\n\nپس به پروردگار والا بی‌نیاز باش *** و با حق (الحق) با وفاداری معامله کن.\n\nو ما را در این باره نیز از قصیده‌ای است:\n\nمال هر چیز فاسدی را اصلاح می‌کند *** و به واسطه آن لغزش از شخص بخشنده برطرف می‌شود.\n\nاین روشی است که اهل طریقت ما از آن غفلت ورزیده‌اند و بی‌نیازی (الغنی) به خداوند متعال را از بزرگترین مراتب دانسته‌اند، و این امر آنان را از تحقق یافتن به تنبیه بر فقر الی الله (فقر به سوی خدا) که صفت حقیقی آنان است، محجوب ساخته است. پس آن را در بی‌نیازی به خدا قرار دادند، به حکم دربرگیریِ محبتشان به بی‌نیازی که خروج از صفتشان است. در حالی که مرد کسی است که قدر خود را بشناسد و به صفت خود تحقق یابد و از موطن خود خارج نشود و جامه و لقب و نام پروردگارش را که او را بدان ملقب و نامیده است، بر خود باقی بگذارد. پس فرمود: **«شما نیازمندان (الفقراء) به سوی خدا هستید و خداوند همان بی‌نیاز ستوده است.»** (فاطر: ۱۵) پس به دلیل سرکشی و جهالت نفس، خواست که در اسم غنی (بی‌نیاز) با پروردگارش شریک شود، از این رو تصمیم گرفت که خود را به غنی بالله (بی‌نیاز به خدا) نامیده و به آن متصف شود تا نام غنی بر او اطلاق شود و از نام فقیر خارج گردد. پس بنگر که میان این دو مرد چه تفاوتی است. و من هیچ کس از اهل طریقت خود را ندیدم که به آنچه ذکر کردیم، یعنی خطرات پنهان نفوس، اشاره کرده باشد، مگر خداوند متعال. اوست که بندگانش را بر این امور آگاه ساخته است. و پس از این، نشنیدند و خود را به کوری زدند. و چقدر تلاش کردم که برای کسی در این باره تنبیهی ببینم، اما نیافتم. و از خداوند متعال می‌خواهم که ما را از کسانی قرار ندهد که در این امر تنها مانده‌اند و برادران عارف ما را در آن شریک سازد. اما اصحاب ما، آن را از ما گرفته و در نفوس خود به آن تحقق یافته‌اند و تنها تخلق به آن و اینکه صفت دائمی‌شان باشد، بر آنان باقی مانده است. اما پس از آنکه فرزندانمان را آگاه ساختیم، این مرتبه را شناختند و به آنچه مردم از عارفان در این باره جاهل بودند، آگاه شدند. پس خیر بسیاری نصیبشان شد که همین مقدار، آنان را از سوء ادب با خداوند متعال بازداشت.\n\n### [از سوء ادب در راه خداوند متعال]\n\nو از سوء ادب در راه خداوند متعال، که خداوند عارفان را با آن به تدریج می‌گیرد، عزت شیوخ بر پیروانشان از مریدان است، به دلیل نیازی که مریدان در تربیت به آنان دارند و امتیاز شیوخ بر آنان. زیرا اگر شیخ حق این مقام را ادا نکند، فقر مرید به او، شیخ را از فقرش به پروردگارش در حال، محجوب می‌سازد. و مشهد او در آن هنگام، بی‌نیازی (الغنی) به خدا خواهد بود، و غنی بالله (بی‌نیاز به خدا) طالب عزت است. و حال محقق صاحب این مقام آن است که وقتی مریدان را می‌بیند که به آنچه نزد او از خداست نیازمندند، خدا را بر آن شکر می‌کند، زیرا خداوند فقیرانی را به او ملزم ساخته که با صفت فقرشان به او، فقر او به خداوند متعال را تثبیت می‌کنند. زیرا چه بسا اگر صفت فقر آنان به او ظاهر نمی‌شد، فقر خود به خداوند متعال را فراموش می‌کرد. حال شیخ محقق این‌گونه است. این شیخ به مریدان نیازمند به خود، با چشم کسی می‌نگرد که او را بر راهش ثابت می‌دارند تا قدمش در آن نلغزد. او مانند غریقی است که کسی را یافته که دستش را بگیرد؛ محبت آن غریق به کسی که جانش را حفظ کرده، چگونه خواهد بود؟ پس این شیخ، حق مرید بر خود را بزرگتر از حق خود بر مرید می‌بیند. پس مرید، شیخِ شیخ است به حال، و شیخ، شیخِ مرید است به قول و تربیت. اگر عاقل باشی، تو را بر نفیس‌ترین راه آگاه ساختم، پس بر آن عمل کن، زیرا در نصیحت برای تو کوتاهی نکردم. و ما راست:\n\nمن بنده‌ام و خواری برای بنده سزاوارتر است *** خود را شایسته عزت به حق (الحق) نمی‌بینم.\n\nپس به من بنگرید، هرگاه سخنی گفتم *** سخن من حال و عهد و فعل بود.\n\nدیگری می‌گوید من بنده‌ام *** اما اگر او را سرزنش کنم، می‌گوید: درنگ کن.\n\n### [همانا مؤمن فقیر، مظهر حقیقت توست و تو مأمور به مشاهده نفس خود هستی.]\n\nای ولیّ صمیمی، علم را با گمان نسخ مکن، زیرا زیانکارترین زیانکاران کسی است که حالش این باشد. عزت ایمان بالاتر است و عزت فقر سزاوارتر. پس باید کار تو تعظیم مؤمن فقیر باشد بر مؤمن غنی به مال و عزیز به جاه که از نفس خود محجوب است. زیرا مؤمن فقیر، مجلای (مظهر) حقیقت توست و تو مأمور به مشاهده نفس خود هستی، تا مبادا از راه آن خارج شوی. مؤمن فقیر آینه توست که خود را در آن می‌بینی، و مؤمن غنی به مال، آینه‌ای است که زنگار گرفته و تو خود را در آن نمی‌بینی. پس نمی‌دانی چه تغییری بر چهره‌ات عارض شده است. خداوند پیامبرش را بیهوده سرزنش نکرد، بلکه به خدا سوگند در آن، والاترین راه هدایت را آشکار ساخت و از راه هلاکت بازداشت. پس فرمود: **«کلا»** (هرگز)، برای بازداشتن و منع از حالتی که تو را از آنچه در این نصیحت برایت ذکر و مقرر کردم، محجوب می‌سازد. پس بی‌نیازی و عزت را با مستحق آن، که خداوند متعال است، معاوضه مکن تا از علمای کامل باشی که علم خود را با غفلت و نسیان آلوده نکرده‌اند. با پوزش، پس از آنکه بهترین روش را که مردانی که به کمالشان شهادت داده شده، از آن غافل مانده‌اند، برایت آشکار ساختم.\n\n### [همانا احوال، انسان را مالک می‌شوند.]\n\nپس بدان که احوال (الأحوال)، انسان را مالک می‌شوند و این ضروری است. و اگر شنیدی که شخصی مالک احوال است، او هیچ حالی را مالک نمی‌شود مگر به واسطه حال دیگر. پس حالی که موجب مالکیت این حال برای او شده، در آن وقت حاکم بر اوست، زیرا وقت از آن اوست. برخی از اهل طریقت ما در این مسئله دچار اشتباه شده‌اند و مالکیت حال را یکی از تفاوت‌های میان انبیا (علیهم السلام) و اولیا قرار داده‌اند و گفته‌اند: انبیا مالک احوال هستند و اولیا تحت تصرف احوال قرار دارند. این از هر جهت اشتباه بزرگی است، زیرا انسان هرگز از حالی که بر آن است و با آن با وقت خود معامله می‌کند، خالی نیست و آن حال بر او حاکم است.\n\n### [همانا خداوند در نفوس بزرگان، تعظیم صفات حق (الحق) را مقرر داشته است.]\n\nو بدان که خداوند در نفوس بزرگان از مردان خدا، تعظیم صفات حق (الحق) را هر جا که ظاهر شوند، مقرر داشته است. پس اگر بر کسی که در اوست به حکم عرض ظاهر شوند، تعظیم این مرد ولی برای صفت حق است نه برای محلی که در آن ظاهر شده است. اگر غفلت کند، به واسطه موصوف از صفت محجوب می‌شود و آن را به خاطر موصوف تعظیم می‌کند. و شایسته است که این تعظیم فقط در مورد کسی باشد که حق (الحق) آن صفت را به او پوشانده است، نه کسی که آن را دزدیده و مانند کسی باشد که دو جامه دروغ پوشیده، یا مانند کسی که خود را به آنچه ندارد سیر نشان می‌دهد. و هنگامی که ولی، صفت حق را در شخصی که برای او ظاهر شده تعظیم کند و صفت خودش در شخص دیگری برایش آشکار شود، از صفت خود روی برمی‌گرداند، از باب بزرگداشت اینکه مبادا با مشاهده نفس خود از حق (الحق) روی برگرداند. پس او قصدی جز تعظیم ندارد. و با این حال، تعظیم محلی که صفت حق در آن ظاهر شده نیز به دنبال آن می‌آید، اگرچه مقصودِ تعظیم‌کننده نیست. با این وجود، آنچه ما تو را بر آن آگاه ساختیم، اولی و شایسته‌تر به تقدیم است. و چه نیکوست سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) که فرمود: «مردم را در منازلشان جای دهید» یا فرمود: «مأمور شده‌ام که مردم را در منازلشان جای دهم.» و به خدا سوگند، منازل مردم معلوم است. و نفرمود: «هر کس را در منزلتش»، بلکه فرمود: «مردم». پس صفتی که همه آنان را در بر می‌گیرد، همان است که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) امر فرمود که آنان را در آن جای دهیم، و آن همان است که ذکر کردیم و تو را بر آن آگاه ساختیم: خواری و نیازمندی (الافتقار). و هر آنچه در قرآن از وصف انسان به آنچه حقیقت او نیست آمده، تنها در مقابل امری است که کسی که اهل آن نبوده، ادعا کرده است، پس با چیزی از جنس آن با او مقابله شده تا در حق او دردناک‌تر باشد. عبدالله بن ابی بن سلول در این باره گفت: **«اگر به مدینه بازگردیم، قطعاً عزیزتر، ذلیل‌تر را از آن بیرون خواهد کرد.»** (المنافقون: ۸) یعنی محمد و اصحابش را از آن بیرون می‌کنیم. پس فرزندش آمد و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را از این امر باخبر ساخت و چون شنیده بود که خداوند می‌فرماید: **«قومی را که به خدا و روز قیامت ایمان دارند، نمی‌یابی که با کسانی که با خدا و رسولش دشمنی می‌کنند، دوستی ورزند، هرچند آنان پدرانشان باشند.»** (المجادلة: ۲۲)، از آن حضرت برای کشتن پدرش که از منافقان بود، اجازه خواست. رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «نمی‌خواهم گفته شود که محمد اصحاب خود را می‌کشد.» پس خداوند عزت را در مقابل ادعای منافقان، به رسولش و مؤمنان نسبت داد و فرمود: **«می‌گویند: اگر به مدینه بازگردیم، قطعاً عزیزتر، ذلیل‌تر را از آن بیرون خواهد کرد. در حالی که عزت از آن خدا و رسول او و مؤمنان است، ولی منافقان نمی‌دانند.»** (المنافقون: ۸) (منافقان) نمی‌دانند عزت را به چه کسی نسبت می‌دهند، پس چگونه آن را به غیر خدا از مؤمنان نسبت می‌دهند؟ و سهم رسول و مؤمن از آن چیست؟ و خداوند متعال نفرمود که آنان را بیرون می‌کند، و همچنین آنان را بیرون نکرد. بلکه این گوینده (عبدالله بن ابی) تا زمان مرگش در مدینه ماند و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) پیراهن خود را برای کفن او داد، در پاداش لطفی که او نسبت به پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) داشت، از جهت عمویش عباس، هنگامی که او را در غزوه بدر اسیر کرده بود و این منافق پیراهن خود را به او پوشانده بود. پس برای این منافق در روز قیامت، طلبی از پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) به خاطر آن باقی نماند.\n\nاگر عارفی را دیدی که در چنین امری افتاده است، بدان که او قصدی جز تعظیم صفت حق (الحق) و کوچک شمردن نفس خود نداشته است. اگر در مقام با او برابر یا بزرگتر از او هستی، او را به آنچه تو را آگاه ساختم، یادآوری کن. و اگر این مقام از آن توست و تو شاهد او هستی، به ناچار در آن حالت از او بزرگتر خواهی بود، حتی اگر در غیر آن از او پایین‌تر باشی. پس به هر روی او را یادآوری کن. و اگر حال او در آن وقت ایمان باشد، تذکر را می‌پذیرد. اما اگر تو را راند و گفت: آیا به کسی مثل من این را می‌گویی؟ بدان که او از چشم خدا افتاده و خداوند او را از عبودیت و از ایمان محجوب ساخته است. پس او را رها کن، زیرا آنچه خداوند بر تو واجب کرده بود، انجام دادی و برایش دعا کن، زیرا خداوند بصیرت او را از راه کور کرده است.\n\n### [والاترین منازل نزد خداوند]\n\nو بدان که این صفتی که تو را بر آن آگاه ساختم، به ما حالی و مشاهده‌ای از حضرت قدس بخشیده است و آنجا مقر آن است. و کسی به آن متصف نمی‌شود مگر کسی که نزد خداوند والاترین منازل را داشته باشد. اگر رسول باشد، والاترین منازل در رسالت؛ اگر نبی باشد، والاترین منازل در نبوت؛ اگر ولی باشد، والاترین منازل در ولایت؛ اگر مؤمن باشد، والاترین منازل در ایمان؛ و اگر نصرانی یا مجوسی یا یهودی یا معطل باشد، در صنف و مقام خود در والاترین منازل است.\n\nهمانا بزرگ از مردان کسی است که *** او را مقید و سرور نمی‌خواند.\n\nو نه یهودی و نه نصرانی و نه مجوسی *** و نه معطل و نه مشرک و نه موحد.\n\nو نه منزه و نه مشبه و نه محدودکننده *** و نه ممکن و نه روح‌دهنده و نه جسم‌دهنده.\n\nصفات جلال و جمال او همه خلایق را فراگرفته است *** و او بوده است تا قصد شود.\n\nهمانا غیور کسی است که در حال گمراهی و هدایت *** از نفس خود روی برنمی‌گرداند.\n\nو محلی که این صفت در آن برپا می‌شود، صاحب آن، بر هر دین و آیینی که باشد، ناگزیر باید به دین هدایت بازگردد و اسلام آورد و ایمان بیاورد و به مکارم اخلاق بشتابد، از روی کشف (الکشف) محقق و علم صحیح. پس کامل‌ترین مردم در ایمان و عظیم‌ترین آنان در منزلت نزد خداوند خواهد بود، در حالی که به منازل رسولان و انبیا (علیهم السلام) و برتری برخی بر برخی دیگر، و اولیا و مؤمنان، عارف است. زیرا صفتی که او را به اسلام کشانده، عظیم‌ترین صفات نزد خداوند از نظر قدر در حق بنده است. پس او را در منازل عالی جای می‌دهد و در علیین بالا می‌برد. و هر فرشته کریمی که نزد خدا گرامی و در عبادت پروردگارش نیکوکار است، او را استقبال می‌کند. این فرشته است که به دلیل مناسبتی که میان او و بنده است، از نزد خدا بر این بنده نازل می‌شود، پس دست او را می‌گیرد و او را به منزل این صفت در علیین بالا می‌برد. پس در صنف خود، کسی بالاتر از او در منزلت نخواهد بود، مگر کسی که به عمل او عمل کند، که او در درجه او و همراه اوست. و این مقدار از این منزل کافی است. اما آنچه از مسائل و علوم در بر دارد، عبارت است از: علم کفران نعمت‌ها، و جزئیات کفر و اینکه هر کفر به کجا می‌انجامد، مانند کفر بنده فراری، و ترک‌کننده نماز، و کافر به بخشی از آنچه خداوند نازل کرده است. و علم بداء (آغاز)، و علم وضع شرایع، و علم برزخ‌ها، و علم بعث (رستاخیز)، و علم قوت‌های زمین و امر آسمان‌ها، و آنچه میان آسمان و زمین متولد می‌شود، و میان توجهات حق (الحق) و هستی (الکون)، و میان هر دو زوج، و علم انسان و حیوان، و علم ساعت (قیامت)، و اینکه چرا ساعت نامیده شده است، و آیا در هر زبانی به این معنای مفهوم از اسم ساعت است یا خیر، و آیا ساعت صورتی دارد که دارای ادراک شنیداری و بینایی و تمییز باشد یا خیر. و علم صفات مقوم هر مرتبه تا اهل آن به واسطه آن متمایز شوند. و علم دو کتابی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) با آن دو در دستانش بر اصحاب خود خارج شد. پس فرمود (صَلَّى اللهُ عَليهِ وسَلَّم): «همانا در یک کتاب، نام‌های اهل بهشت و نام‌های پدران و قبایل و عشایرشان است، و در کتاب دیگر، نام‌های اهل آتش و نام‌های پدران و قبایل و عشایرشان است.» با وجود کوچکی حجم دو کتاب و کثرت نام‌ها، از این امر، وارد کردن بزرگ بر کوچک دانسته می‌شود، بدون کوچک کردن بزرگ یا بزرگ کردن کوچک. وگرنه کدام دیوانی است که نام‌های این افراد را در خود جای دهد؟ و دانسته می‌شود که امری که عقل آن را محال می‌داند، نسبت الهی آن محال نیست. پس می‌دانی که خداوند بر محال عقلی قادر است، مانند داخل کردن شتر در سوراخ سوزن، در حالی که این (سوراخ) بر کوچکی خود و آن (شتر) بر بزرگی خود باقی بماند. و از این منزل، مقامی مشاهده می‌شود که ورای طور عقل است، از آن جهت که عقل به تنهایی و به عنوان موجودی متفکر، قادر به ادراک آن است. وگرنه عقل انبیا (علیهم السلام) و اولیا قبل از این امر، از آن جهت که پذیرنده است، نه از آن جهت که متفکر است، آن را درک می‌کند. پس عقول را حدی است که در آن متوقف می‌شوند، اما خداوند را حدی نیست که در آن متوقف شود، بلکه او خالق حدود است و سبحانه و تعالی حدی ندارد. پس او قادر مطلق است. و خداوند **«حق (الحق) را می‌گوید و او راه را می‌نمایاند.»** (الأحزاب: ۴)"
  },
  "page_count": 5
}