{
  "id": 103,
  "title": {
    "ar": "الباب الثالث ومائة في ترك الرجاء",
    "en": "Chapter 103: On the Abandonment of Hope",
    "ur": "باب ایک سو تین: رجا (امید) کو ترک کرنے کے بیان میں",
    "fa": "باب صد و سوم در ترک امید (رجاء)"
  },
  "content": {
    "ar": "## (الباب الثالث ومائة في ترك الرجاء)\n\n\n> لا تركنن إلى الرجاء فربما *** أصبحت من حكم الرجاء على رجا\n\n\n> فاضرع إلى الرحمن في تحصيله *** فيه نجاتك فالسعيد من التجأ\n\n\n### [ترك الرجاء الشهود النفس ما يطلبه الله‏]\n\n\nاعلم أيدك الله أن حكم صاحب هذا المقام شهود نفسه من حيث ما تطلبه به الحضرة الإلهية وضعف العبودية عن الوفاء بما تستحقه أو بما يمكن أن يوفيها من طاقتها المأمور بها في قوله تعالى فَاتَّقُوا الله ما اسْتَطَعْتُمْ هذا من جهتنا وأما من جانب ما تستحقه الربوبية على العبودية فقوله اتَّقُوا الله حَقَّ تُقاتِهِ ولا تَمُوتُنَّ إِلَّا وأَنْتُمْ مُسْلِمُونَ وليس لهم من الأمر شي‏ء فقطع بهم هذا الأمر فهو مقام صعب وحالة شديدة\n\n\n### [الإيمان نصفان: خوف ورجاء وكلاهما متعلقهما عدم‏]\n\n\nفمن ترك الرجاء فقد ترك نصف الايمان فالإيمان نصفان نصف خوف ونصف رجاء وكلاهما متعلقهما عدم فإذا حصل العلم حصل الوجود وزال العدم وأزال العلم حكم الايمان لأنه شهد ما آمن به فصار صاحب علم والايمان تقليد والتقليد يناقض العلم إلا أن يكون المخبر معصوما عند المؤمن وفي نفسه من الكذب وليس بينك وبينه واسطة في إخباره فإن الدليل الذي حكم لك بصدقه وعصمته عن الخطاء والكذب فكنت فيه على بصيرة وهي العلم ينسحب لك على ما يخبرك به عن الله فيكون عندك خبره علما لا تقليدا وهذا لا يكون اليوم إلا عند أهل الكشف والوجود خاصة وأما عند أهل النقل فلا سبيل فالصحابة الذين سمعوا شفاها من الرسول ما لا يحتمله التأويل بما هو نص في الباب لا فرق بينهم وبين أهل الكشف والوجود فهم علماء غير مقلدين ما داموا ذاكرين لدليلهم فإن غابوا عن الدليل في وقت الإخبار فهم مقلدون مع ارتفاع الوسائط\n\n\n### [اجعل دليلك على الأشياء ربك تكن صاحب علم محقق‏]\n\n\nفاجعل دليلك ربك على الأشياء فلا تغفل عنه فإنك إذا كنت بهذه المثابة كنت صاحب علم وهو أرفع ما يكون من عند الله ولهذا أمر نبيه صَلَّى اللهُ عَليهِ وسَلَّم بالزيادة منه دون غيره من الصفات فمن علم الماضي والحال والمستأنف لم يبق له عدم فلم يبق له متعلق رجاء فلم يبق له رجاء\n\n\n> من إنما أجزع مما أتقى *** فإذا حل فما لي والجزع‏\n\n\n> وكذا أطمع فيما أبتغي *** فإذا فات فما لي والطمع‏\n\n\nفهذان البيتان جمعا ترك الرجاء والخوف بحصول المخوف وقوعه وفوت المرجو حصوله إلى وهذا وإن كان صحيحا في الرجاء فلا يكون هذا في رجاء المقام فإنه ما له خوف فوت الماضي وإنما له خوف فوت المستأنف لفوت سببه الذي مضى‏\n\n",
    "en": "Chapter One Hundred and Three: On Abandoning Hope\n\nDo not rely upon hope, for you may find yourself\nSubject to the rule of hope, hoping for hope itself.\n\nSo supplicate to the All-Merciful for its realization;\nIn it is your salvation, for the fortunate one is he who takes refuge.\n\n### [Abandoning Hope: The Witnessing (الشهود) of the Self in terms of what Allah demands]\n\nKnow—may Allah support you—that the ruling principle of the possessor of this Station (المقام) is the witnessing (شهود) of his self in terms of what the Divine Presence (الحضرة الإلهية) demands of him, and the weakness of his servitude (العبودية) in fulfilling what is due, or in fulfilling what is possible within the capacity commanded in His saying, the Exalted: <<فَاتَّقُوا الله ما اسْتَطَعْتُمْ>> (So fear Allah as much as you are able). This is from our side. As for the side of what Lordship (الربوبية) deserves from servitude (العبودية), it is His saying: <<اتَّقُوا الله حَقَّ تُقاتِهِ ولا تَمُوتُنَّ إِلَّا وأَنْتُمْ مُسْلِمُونَ>> (Fear Allah with the fear due to Him, and do not die except as Muslims). And they possess nothing of the command, so this matter cuts them off entirely. Thus, it is a difficult Station (مقام) and a severe state.\n\n### [Faith (الإيمان) is Two Halves: Fear (خوف) and Hope (رجاء), and the object of both is Non-existence (عدم)]\n\nWhoever abandons hope (الرجاء) has abandoned half of Faith (الإيمان). For Faith is two halves: half fear (خوف) and half hope (رجاء), and the object of both is Non-existence (عدم). When Knowledge (العلم) is attained, Existence (الوجود) is attained, and Non-existence vanishes. Knowledge removes the ruling principle of Faith because the knower witnesses what he previously believed in, thus becoming a possessor of Knowledge. Faith is imitation (تقليد), and imitation contradicts Knowledge, unless the informant is considered infallible by the believer and is inherently free from falsehood, and there is no intermediary between you and him in his reporting. For the proof (دليل) that established for you his truthfulness and his infallibility from error and falsehood—in which you were upon insight, which is Knowledge—extends to what he reports to you about Allah. Thus, his report becomes Knowledge for you, not imitation. This, today, occurs only specifically among the People of Unveiling (الكشف) and Existence (الوجود). As for the People of Transmission (أهل النقل), there is no path. The Companions who heard directly from the Messenger that which bears no interpretation, being a clear text (نص) on the matter, there is no difference between them and the People of Unveiling and Existence. They are knowers, not imitators (مقلدين), as long as they remember their proof. If they are heedless of the proof at the time of reporting, they are imitators, even though the intermediaries are removed.\n\n### [Make your Lord your Proof (دليل) concerning things, and you will be a possessor of Verified Knowledge (علم محقق)]\n\nTherefore, make your Lord your proof (دليل) concerning all things, and do not be heedless of Him. For if you are in this state, you will be a possessor of Knowledge (علم), and this is the highest thing that comes from Allah. For this reason, He commanded His Prophet (peace and blessings be upon him) to seek increase in it [Knowledge] and not in any other Attributes (صفات). Whoever knows the past, the present, and the future will have no Non-existence (عدم) remaining, and thus no object for hope (رجاء) remaining, and thus no hope remaining.\n\nI only fear that which I dread,\nBut if it occurs, what use is my fear?\n\nLikewise, I hope for that which I seek,\nBut if it is missed, what use is my hope?\n\nThese two couplets combine the abandonment of hope (الرجاء) and fear (الخوف) through the occurrence of the feared thing and the missing of the hoped-for attainment. Although this is true regarding hope, it does not apply to the hope associated with the Station (المقام), for the possessor of the Station has no fear of missing the past, but rather fears missing the future due to the loss of its cause which has already passed.</blockquote>",
    "ur": "(باب ایک سو تین: رجاء (امید) کو ترک کرنے کے بیان میں)\n\nرجاء (امید) پر ہرگز بھروسہ نہ کر، کیونکہ بسا اوقات\nتو رجاء کے حکم سے خود رجاء پر آ جاتا ہے۔\n\nپس اس کے حصول کے لیے رحمن کے حضور گڑگڑا\nاسی میں تیری نجات ہے، پس خوش نصیب وہ ہے جس نے پناہ لی۔\n\n### [رجاء (رجاء) کو ترک کرنا: نفس کا شہود (شہود) جو اللہ اس سے طلب کرتا ہے]\n\nجان لو، اللہ تمہاری تائید کرے، کہ اس مقام کے صاحب کا حکم یہ ہے کہ وہ اپنے نفس کا شہود (شہود) کرے اس لحاظ سے کہ حضور الٰہی (الحضرة الإلهية) اس سے کیا طلب کرتا ہے، اور بندگی (العبودية) کی کمزوری کو دیکھے کہ وہ اس حق کو پورا کرنے سے قاصر ہے جو اس پر واجب ہے، یا اس طاقت کے ذریعے بھی پورا کرنے سے قاصر ہے جس کا اسے حکم دیا گیا ہے، جیسا کہ اللہ تعالیٰ کا فرمان ہے: فَاتَّقُوا الله ما اسْتَطَعْتُمْ (پس اللہ سے ڈرو جتنی تم طاقت رکھتے ہو)۔ یہ ہماری طرف سے ہے۔ لیکن جہاں تک ربوبیت کا بندگی پر جو حق ہے اس کا تعلق ہے، تو وہ اللہ کا یہ فرمان ہے: اتَّقُوا الله حَقَّ تُقاتِهِ ولا تَمُوتُنَّ إِلَّا وأَنْتُمْ مُسْلِمُونَ (اللہ سے ڈرو جیسا کہ اس سے ڈرنے کا حق ہے، اور تمہیں موت نہ آئے مگر اس حال میں کہ تم مسلمان ہو)۔ اور ان کے لیے امر میں سے کچھ بھی نہیں ہے، پس اس امر نے انہیں منقطع کر دیا ہے۔ لہٰذا یہ ایک مشکل مقام اور سخت حالت ہے۔\n\n### [ایمان (الإيمان) دو حصے ہیں: خوف اور رجاء (رجاء)، اور دونوں کا تعلق عدم (العدم) سے ہے]\n\nپس جس نے رجاء (رجاء) کو ترک کیا، اس نے ایمان (الإيمان) کے نصف کو ترک کر دیا۔ ایمان دو حصے ہیں: نصف خوف اور نصف رجاء (رجاء)، اور ان دونوں کا تعلق عدم (العدم) سے ہے۔ پس جب علم (العلم) حاصل ہو جاتا ہے تو ہستی (الوجود) حاصل ہو جاتی ہے اور عدم (العدم) زائل ہو جاتا ہے۔ اور علم، ایمان کے حکم کو زائل کر دیتا ہے، کیونکہ اس نے اس چیز کا شہود (شہود) کر لیا جس پر وہ ایمان لایا تھا، پس وہ صاحب علم بن گیا۔ اور ایمان تقلید ہے، اور تقلید علم کے منافی ہے، سوائے اس صورت کے جب خبر دینے والا مؤمن کے نزدیک معصوم ہو اور اس کے نفس میں جھوٹ نہ ہو، اور اس کی خبر دینے میں تمہارے اور اس کے درمیان کوئی واسطہ نہ ہو۔ کیونکہ وہ دلیل جس نے تمہارے لیے اس کی سچائی اور غلطی و جھوٹ سے اس کی معصومیت کا حکم دیا، اور تم اس میں بصیرت پر تھے جو کہ علم (العلم) ہے، وہ دلیل تمہارے لیے اس چیز پر بھی لاگو ہو جاتی ہے جو وہ تمہیں اللہ کی طرف سے خبر دیتا ہے۔ پس اس کی خبر تمہارے نزدیک علم بن جاتی ہے نہ کہ تقلید۔ اور یہ آج کے دور میں صرف اہل کشف (الکشف) اور ہستی (الوجود) کے پاس ہی ہوتا ہے، جبکہ اہل نقل کے پاس اس کا کوئی راستہ نہیں۔ پس وہ صحابہ جنہوں نے رسول اللہ صلی اللہ علیہ وسلم سے براہ راست ایسی باتیں سنیں جن میں تاویل کی گنجائش نہیں تھی اور جو اس باب میں نص تھیں، ان میں اور اہل کشف (الکشف) و ہستی (الوجود) میں کوئی فرق نہیں ہے۔ وہ عالم ہیں، مقلد نہیں، جب تک کہ وہ اپنی دلیل کو یاد رکھتے ہیں۔ لیکن اگر وہ خبر دینے کے وقت دلیل سے غافل ہو جائیں تو وہ مقلد ہیں، اگرچہ واسطے ختم ہو چکے ہوں۔\n\n### [اشیاء پر اپنی دلیل اپنے رب کو بناؤ، تاکہ تم محقق صاحب علم بن جاؤ]\n\nپس اشیاء پر اپنی دلیل اپنے رب کو بناؤ اور اس سے غافل نہ ہو، کیونکہ جب تم اس مرتبے پر ہو گے تو تم صاحب علم (العلم) ہو گے، اور یہ اللہ کی طرف سے سب سے بلند چیز ہے۔ اسی لیے اللہ نے اپنے نبی صلی اللہ علیہ وسلم کو اس (علم) میں اضافے کا حکم دیا، نہ کہ دیگر صفات میں۔ پس جس نے ماضی، حال اور مستقبل کو جان لیا، اس کے لیے عدم (العدم) باقی نہیں رہا، پس اس کے لیے رجاء (رجاء) کا کوئی تعلق باقی نہیں رہا، پس اس کے لیے رجاء باقی نہیں رہی۔\n\nمیں تو صرف اس چیز سے گھبراتا ہوں جس سے ڈرتا ہوں\nپس جب وہ واقع ہو جائے تو مجھے گھبراہٹ سے کیا کام؟\n\nاور اسی طرح میں اس چیز کی طمع کرتا ہوں جسے چاہتا ہوں\nپس جب وہ فوت ہو جائے تو مجھے طمع سے کیا کام؟\n\nان دونوں اشعار نے خوف اور رجاء (رجاء) کو ترک کرنے کو جمع کر دیا ہے، اس طرح کہ خوف زدہ چیز واقع ہو جائے اور مرجو (جس کی امید کی گئی تھی) کا حصول فوت ہو جائے۔ اور اگرچہ یہ بات رجاء (رجاء) کے معاملے میں درست ہے، لیکن یہ مقام کی رجاء میں نہیں ہو سکتی، کیونکہ اسے ماضی کے فوت ہونے کا خوف نہیں ہوتا، بلکہ اسے مستقبل کے فوت ہونے کا خوف ہوتا ہے، اس سبب کے فوت ہونے کی وجہ سے جو گزر چکا ہے۔",
    "fa": "(باب صد و سوم در ترک امید (رجاء))\n\nبه امید (رجاء) تکیه مکن، زیرا چه بسا\nاز حکم امید، خود بر امیدی دیگر قرار گیری.\n\nپس برای دستیابی به آن (نجات)، به سوی رحمان تضرع کن\nنجات تو در آن است، و سعادتمند کسی است که پناه برد.\n\n[ترک امید (رجاء): شهود نفس در آنچه خداوند از آن می‌طلبد]\n\nبدان، خداوند تو را یاری کند، که حکم صاحب این مقام، شهود نفس خویش است از آن حیث که حضرت الهی (الحضرة الإلهية) آن را می‌طلبد، و ضعف بندگی (العبودية) در وفای به آنچه شایسته آن است، یا آنچه می‌تواند از توانایی مأمور به آن وفا کند، در این سخن خداوند متعال: «پس تا می‌توانید از خدا پروا کنید» (فَاتَّقُوا الله ما اسْتَطَعْتُمْ). این از جانب ماست. اما از جانب آنچه ربوبیت (الربوبية) بر بندگی (العبودية) شایسته می‌داند، سخن اوست: «از خدا آن‌گونه که شایسته پروا کردن است، پروا کنید و نمیرید مگر در حالی که مسلمان باشید» (اتَّقُوا الله حَقَّ تُقاتِهِ ولا تَمُوتُنَّ إِلَّا وأَنْتُمْ مُسْلِمُونَ). و ایشان را از امر (الهی) چیزی نیست. پس این امر آنان را قطع کرده است. از این رو، این مقامی دشوار و حالتی سخت است.\n\n[ایمان دو نیمه است: خوف و رجاء و متعلق هر دو عدم است]\n\nپس هر کس امید (رجاء) را ترک کند، نیمی از ایمان را ترک کرده است. زیرا ایمان دو نیمه است: نیمی خوف (ترس) و نیمی رجاء (امید)، و متعلق هر دوی آن‌ها عدم است. پس هرگاه علم حاصل شود، هستی (الوجود) حاصل شده و عدم زائل می‌گردد. و علم، حکم ایمان را از بین می‌برد، زیرا او آنچه را که به آن ایمان آورده بود، شهود کرده است و صاحب علم شده است. و ایمان تقلید است، و تقلید با علم در تناقض است، مگر آنکه خبردهنده نزد مؤمن معصوم باشد و در ذات خود از دروغ مبرا باشد و در خبر دادن او واسطه‌ای میان تو و او نباشد. زیرا دلیلی که برای تو به صدق و عصمت او از خطا و دروغ حکم کرده است، و تو در آن بر بصیرت (که همان علم است) بوده‌ای، بر آنچه او از جانب خداوند به تو خبر می‌دهد نیز جاری می‌شود، و در نتیجه خبر او نزد تو علم خواهد بود نه تقلید. و این امر امروز جز برای اهل کشف (الکشف) و هستی (الوجود) به طور خاص میسر نیست، اما نزد اهل نقل (نقلیات) راهی نیست. پس صحابه‌ای که آنچه را که تأویل نمی‌پذیرد و نص در باب است، مستقیماً از پیامبر شنیدند، تفاوتی میان آن‌ها و اهل کشف (الکشف) و هستی (الوجود) نیست. آنان عالمان غیر مقلد هستند، مادامی که دلیل خود را به یاد دارند. اما اگر در هنگام خبر دادن از دلیل غافل شوند، با وجود برداشته شدن واسطه‌ها، مقلد خواهند بود.\n\n[پروردگارت را دلیل خود بر اشیاء قرار ده تا صاحب علم محقق شوی]\n\nپس پروردگارت را دلیل خود بر اشیاء قرار ده و از او غافل مشو. زیرا اگر در این مرتبه باشی، صاحب علم خواهی بود، و این بالاترین چیزی است که از جانب خداوند حاصل می‌شود. و به همین دلیل پیامبرش (صلی الله علیه و سلم) را به طلب افزایش آن (علم) امر کرد، نه صفات دیگر. پس کسی که گذشته، حال و آینده را بداند، برای او عدمی باقی نمی‌ماند، و متعلق امیدی (رجاء) برایش نمی‌ماند، و در نتیجه امیدی (رجاء) برایش باقی نمی‌ماند.\n\nمن تنها از چیزی که می‌ترسم، بی‌تابی می‌کنم\nپس اگر واقع شود، مرا با بی‌تابی چه کار؟\n\nو همچنین به آنچه می‌خواهم، طمع می‌ورزم\nپس اگر از دست برود، مرا با طمع چه کار؟\n\nاین دو بیت، ترک امید (رجاء) و خوف (ترس) را با وقوع آنچه از آن می‌ترسیدند و فوت آنچه امید به حصولش داشتند، جمع کرده‌اند. و این (ترک رجاء و خوف) اگرچه در مورد امید (رجاء) صحیح است، اما در مورد امید (رجاء) مقام (عرفانی) چنین نیست؛ زیرا او خوف فوت گذشته را ندارد، بلکه خوف فوت آینده را به دلیل فوت سبب آن که در گذشته بوده است، دارد."
  },
  "page_count": 1
}