{
  "id": 433,
  "title": {
    "ar": "الباب الثالث والثلاثون وأربعمائة في معرفة منازلة انظر أي تجل يعدمك فلا تسألنيه فنعطيك فلا أجد من يأخذه",
    "en": "Chapter Four Hundred and Thirty-Three: Concerning the Knowledge of His Stations. Behold which Theophany (التجلي) brings you to non-existence, so do not ask Me for it, that We may grant it to you, for I do not find anyone who receives it.",
    "ur": "باب چار سو تینتیس: اس روحانی مقام کی معرفت میں: دیکھو کون سا ظہور الٰہی (التجلی) تمہیں معدوم کر دیتا ہے، تو مجھ سے اس کا سوال نہ کرو، اور ہم تمہیں وہ عطا کر دیں گے، کیونکہ مجھے کوئی ایسا نہیں ملتا جو اسے قبول کرے۔",
    "fa": "باب چهارصد و سی و سوم در معرفت منازل [تجلی] «بنگر کدام تجلی تو را معدوم می‌سازد، پس آن را از من مخواه تا به تو عطا کنم، زیرا کسی را نمی‌یابم که آن را بپذیرد.»"
  },
  "content": {
    "ar": "## «الباب الثالث والثلاثون وأربعمائة في معرفة منازلة انظر أي تجل يعدمك فلا تسألنيه فنعطيك فلا أجد من يأخذه»\n\n\n> لا تطلبن تجليا *** يفنيك عنك فإنني‏\n> أعطى ولست بآخذ *** لفناء عينك فانثنى‏\n\n\n> عن مثل هذا واطلبن *** أمرا عليه ينبني‏\n\n\n> عين البقاء ولا تكن *** بما تسمى تكنني‏\n\n\nقال الله تعالى لا تَسْئَلُوا عَنْ أَشْياءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ‏\n\n\n### [أن البقاء والفناء مضافين‏]\n\n\nاعلم أن البقاء والفناء لا يعقلان في هذا الطريق إلا مضافين الفناء عن كذا والبقاء مع كذا ولا يصح الفناء عن الله أصلا فإنه ما ثم إلا هو فإن الاضطرار يردك إليه ولهذا تسمى تعالى لنا بالصمد لأن الكون يلجأ إليه في جميع أموره وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فلم يبق أن يكون فناؤك إلا عنك ولا تفني عنك حتى تفني عن جميع الأكوان والأعيان أعني فناء أهل الله فإن أتحفك الحق بتحفة منه تعالى فتحفه من جملة أكوانه فهي محدثة فتطلبك التحفة لتقبلها فتجدك فانيا عنها فعادت إلى معطيها فكان ذلك سوء أدب منك في الأصل حيث سألت ما قادك إلى مثل هذا فإن الله يعطي دائما فينبغي للعبد أن يكون قابلا دائما فلا تسأل إن كنت من أهل الله إلا عن أمر إلهي أعني على التعيين وإلا فاسأل الله من فضله من غير تعيين‏\n\n\n### [أن تجليات الحق على نوعين‏]\n\n\nواعلم أن تجليات الحق على نوعين تجل يفنيك عنك وعن أحكامك وتجل يبقيك معك ومع أحكامك ومن أحكامك ملازمة الأدب في الأخذ والعطاء فمثل هذا التجلي فاسأل ما دمت في دار التكليف فإذا انتقلت إلى غير هذا الموطن فكن بحسب ذلك الموطن ولو لا التكليف ما وقعت من الله وصية لأحد من عباد الله فما أوصى العليم بالأمور إلا وقد علم أن للوصية أثرا في الأمور وسيرد الكلام في تحقيق الوصايا في آخر باب من أبواب هذا الكتاب إن شاء الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Thirty-Third: Concerning the Knowledge of its Stations. Look at which theophany annihilates you, so do not ask Me for it, for I give, but I find none who takes it.\n\nDo not seek a theophany (تجلي)\nThat annihilates you from yourself, for I\nGive, yet I am not a taker,\nDue to the annihilation (فناء) of your essence (عينك), so turn away.\nFrom the like of this, and seek\nAn affair upon which is built\nThe very essence of Subsistence (عين البقاء), and do not be\nWhat you are named, for it shelters me.\n\nAllah the Exalted said: <<Do not ask about things which, if they are shown to you, would distress you.>> (Quran 5:101)\n\n### That Subsistence and Annihilation are Relative\n\nKnow that Subsistence (البقاء) and Annihilation (الفناء) are not rationally understood on this Path (الطريق) except as relative: annihilation *from* such-and-such, and subsistence *with* such-and-such. Annihilation *from* Allah (الحق) is fundamentally impossible, for there is nothing there except Him. Indeed, necessity (الاضطرار) returns you to Him. This is why He, the Exalted, named Himself to us as *al-Samad* (The Eternal Refuge), because the cosmos (الكون) seeks refuge in Him in all its affairs, and <<To Him is referred the whole affair.>> (Quran 11:123). Therefore, your annihilation (فناؤك) can only be from yourself. You cannot be annihilated from yourself until you are annihilated from all existent things (الأكوان) and fixed entities (الأعيان), meaning the annihilation (فناء) experienced by the People of Allah (أهل الله).\n\nIf the Real (الحق) favors you with a gift (تحفة) from Himself—and that gift is from the totality of His existent things—it is created (محدثة). The gift seeks you out so that you may accept it, but it finds you annihilated from it, so it returns to its Giver. This constitutes a lack of proper spiritual etiquette (سوء أدب) on your part in the first place, since you asked for something that led you to such a state. Indeed, Allah gives perpetually, so the servant ought to be perpetually receptive. If you are among the People of Allah, do not ask except for a Divine matter (أمر إلهي)—meaning, specifically designated—otherwise, ask Allah for His bounty (فضله) without designation.\n\n### That the Theophanies of the Real are of Two Kinds\n\nKnow that the theophanies (تجليات) of the Real (الحق) are of two kinds: a theophany that annihilates (يفنيك) you from yourself and from your rulings (أحكامك), and a theophany that causes you to subsist (يبقيك) with yourself and with your rulings. Among your rulings is the adherence to proper spiritual etiquette (الأدب) in giving and receiving. Ask for this second type of theophany as long as you are in the Abode of Responsibility (دار التكليف). When you transition to a station other than this, then be according to the nature of that station. Were it not for responsibility (التكليف), no injunction (وصية) would have been issued by Allah to any of His servants. The Knower of Affairs (العليم بالأمور) only enjoined something because He knew that the injunction would have an effect on affairs. The discussion concerning the verification of injunctions (الوصايا) will be presented in the final chapter of this book, if Allah wills. And Allah speaks the Truth, and He guides to the Way.",
    "ur": "باب نمبر ۴۳۳: اس منزل کی معرفت میں: دیکھو کون سا ظہور الٰہی (التجلی) تمہیں معدوم کر دیتا ہے، تو مجھ سے اس کا سوال نہ کرو، کیونکہ میں تمہیں عطا کرتا ہوں، لیکن مجھے کوئی لینے والا نہیں ملتا۔\n\n> کسی ایسے ظہور الٰہی (التجلی) کا سوال نہ کر جو تجھے تجھ سے فنا کر دے، کیونکہ میں\n>\n> عطا کرتا ہوں اور تیری عین (ذات) کے فنا (الفناء) ہونے کی وجہ سے لینے والا نہیں ہوں، لہٰذا باز آ جا۔\n>\n> اس طرح کی چیز سے (باز آ)، اور کسی ایسے امر کا سوال کر جس پر\n>\n> عین بقا (البقاء) کی بنیاد ہو، اور وہ نہ بن جس سے تیرا نام لیا جاتا ہے، تاکہ تو مجھے چھپا نہ دے۔\n\nاللہ تعالیٰ نے فرمایا: \"ایسی چیزوں کے بارے میں سوال نہ کرو کہ اگر وہ تم پر ظاہر کر دی جائیں تو تمہیں ناگوار گزریں۔\" (المائدہ: ۱۰۱)\n\n### یہ کہ بقا (البقاء) اور فنا (الفناء) اضافی ہیں\n\nجان لو کہ اس راہ میں بقا (البقاء) اور فنا (الفناء) کو اضافی ہوئے بغیر نہیں سمجھا جا سکتا، یعنی فلاں سے فنا (الفناء) اور فلاں کے ساتھ بقا (البقاء)۔ اور اللہ سے فنا ہونا بالکل درست نہیں، کیونکہ وہاں اس کے سوا کچھ نہیں ہے، اس لیے کہ اضطرار تجھے اسی کی طرف لوٹاتا ہے۔ اور اسی لیے اس نے ہمارے لیے خود کو الصمد (بے نیاز) نام دیا، کیونکہ کائنات اپنے تمام معاملات میں اسی کی پناہ لیتی ہے، اور \"اسی کی طرف تمام معاملات لوٹائے جاتے ہیں۔\" (ہود: ۱۲۳)\n\nپس یہ باقی نہیں رہا کہ تیری فنا (الفناء) تیرے سوا کسی اور سے ہو، اور تو خود سے فنا نہیں ہو سکتا جب تک کہ تمام اکوان (کائناتوں) اور اعیان (ذوات) سے فنا نہ ہو جائے، میرا مطلب ہے اہل اللہ کی فنا (الفناء)۔ پس اگر ذات حق (الحق) تجھے اپنی طرف سے کوئی تحفہ عطا کرے، اور وہ تحفہ اس کی کائناتوں میں سے ہو، تو وہ محدث (نئی پیدا شدہ) ہے، اور وہ تحفہ تجھ سے مطالبہ کرتا ہے کہ تو اسے قبول کرے، لیکن تو خود کو اس سے فنا (الفناء) پاتا ہے، تو وہ اپنے عطا کرنے والے کی طرف لوٹ جاتا ہے۔ پس یہ اصل میں تیری طرف سے سوءِ ادب تھا، جہاں تو نے ایسی چیز کا سوال کیا جو تجھے اس طرح کے انجام تک لے گئی۔ کیونکہ اللہ ہمیشہ عطا کرتا ہے، لہٰذا بندے کو چاہیے کہ وہ ہمیشہ قبول کرنے والا ہو۔ پس اگر تو اہل اللہ میں سے ہے تو کسی امرِ الٰہی کا سوال نہ کر، میرا مطلب ہے تعین کے ساتھ، ورنہ اللہ سے اس کے فضل کا سوال کر بغیر تعین کے۔\n\n### یہ کہ ذات حق (الحق) کے ظہور الٰہی (التجلی) دو قسم کے ہیں\n\nاور جان لو کہ ذات حق (الحق) کے ظہور الٰہی (التجلی) دو قسم کے ہیں: ایک ظہور الٰہی (التجلی) جو تجھے تجھ سے اور تیرے احکام سے فنا (الفناء) کر دیتا ہے، اور ایک ظہور الٰہی (التجلی) جو تجھے تیرے ساتھ اور تیرے احکام کے ساتھ باقی رکھتا ہے۔ اور تیرے احکام میں سے ایک یہ ہے کہ لینے اور دینے میں ادب کو لازم پکڑے، پس ایسے ظہور الٰہی (التجلی) کا سوال کر جب تک تو دارِ تکلیف (دنیا) میں ہے۔ اور جب تو اس مقام سے کسی دوسرے مقام کی طرف منتقل ہو جائے تو اس مقام کے مطابق ہو جا۔ اور اگر تکلیف (شرعی ذمہ داری) نہ ہوتی تو اللہ کی طرف سے اس کے کسی بندے کے لیے کوئی وصیت نہ ہوتی۔ پس امور کا جاننے والا (اللہ) نے وصیت نہیں کی مگر اس لیے کہ وہ جانتا تھا کہ وصیت کا معاملات میں اثر ہوتا ہے۔ اور وصایا کی تحقیق کے بارے میں کلام ان شاء اللہ اس کتاب کے آخری باب میں آئے گا۔ اور اللہ حق کہتا ہے اور وہی راہ دکھاتا ہے۔",
    "fa": "باب چهارصد و سی و سوم در معرفت منزلتی که: بنگر کدام تجلی تو را معدوم می‌سازد، پس آن را از من مخواه تا به تو عطا کنم، زیرا کسی را نمی‌یابم که آن را بپذیرد.\n\nتجلی‌ای را مخواه که تو را از خودت فانی سازد، زیرا من\nعطا می‌کنم و گیرنده نیستم، به خاطر فنای عین تو، پس بازگشت.\nاز مانند این (تجلی) روی بگردان و امری را طلب کن که بر آن\nعین بقا (البقاء) بنا شود، و با آنچه نامیده می‌شوی، مرا مپوشان.\n\nخداوند متعال فرمود: «از چیزهایی نپرسید که اگر برای شما آشکار شوند، شما را ناخوش آید.» (لا تَسْئَلُوا عَنْ أَشْياءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ)\n\n### [اینکه بقا و فنا اضافی (مضاف) هستند]\n\nبدان که بقا (البقاء) و فنا (الفناء) در این طریق (عرفان) جز به صورت اضافی (مضافین) معقول نیستند: فنا (الفناء) از فلان چیز، و بقا (البقاء) با فلان چیز. و فنا (الفناء) از حق (الحق) اصلاً صحیح نیست، زیرا در آنجا جز او نیست. چرا که اضطرار تو را به سوی او باز می‌گرداند. به همین دلیل، خداوند متعال برای ما به نام صمد نامیده شده است، زیرا هستی (الوجود) در تمامی امور خود به او پناه می‌برد و «همه امور به سوی او بازگردانده می‌شود» (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ). پس باقی نمی‌ماند که فنای تو جز از خودت باشد. و از خودت فانی نمی‌شوی مگر آنکه از تمامی اکوان و اعیان فانی شوی؛ منظورم فنای اهل الله است. پس اگر حق (الحق) تو را به تحفه‌ای از جانب خود گرامی داشت، و آن تحفه از جمله اکوان اوست و حادث است، آن تحفه تو را می‌طلبد تا آن را بپذیری، اما تو را فانی از آن می‌یابد، پس به سوی عطا کننده‌اش باز می‌گردد. و این در اصل سوء ادبی از جانب تو بود، زیرا چیزی را خواستی که تو را به چنین وضعیتی کشانید. همانا خداوند همیشه عطا می‌کند، پس شایسته است که بنده همیشه پذیرنده باشد. اگر از اهل الله هستی، جز امری الهی را، یعنی به صورت معین، درخواست مکن؛ وگرنه، فضل خدا را بدون تعیین بخواه.\n\n### [اینکه تجلیات حق بر دو نوع است]\n\nو بدان که تجلیات حق (التجلیات الحق) بر دو نوع است: تجلی (التجلی) که تو را از خودت و از احکامت فانی می‌سازد، و تجلی (التجلی) که تو را با خودت و با احکامت باقی می‌دارد. و از جمله احکام تو، ملازمت ادب در گرفتن و دادن است. پس تا زمانی که در سرای تکلیف هستی، چنین تجلی‌ای را درخواست کن. و چون به غیر این موطن منتقل شدی، بر حسب آن موطن باش. و اگر تکلیف نبود، هیچ وصیتی از جانب خداوند برای هیچ یک از بندگانش واقع نمی‌شد. پس دانای به امور وصیت نکرد، مگر آنکه می‌دانست که وصیت در امور اثری دارد. و سخن در تحقیق وصایا در آخرین باب از ابواب این کتاب خواهد آمد، ان شاء الله. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}