{
  "id": 362,
  "title": {
    "ar": "الباب الثاني والستون وثلاثمائة في معرفة منزل سجود القلب والوجه والكل والجزء وهما منزل السجودين والسجدتين",
    "en": "Chapter Three Hundred and Sixty-Two: Concerning the knowledge of the station (منزل) of the prostration (سجود) of the Heart and the Face, and the Whole (الكل) and the Part (الجزء), which is the station of the Two Prostrations (السجودين) and the Two Acts of Prostration (السجدتين).",
    "ur": "باب تین سو باسٹھ (۳۶۲): قلب اور وجہ (چہرہ) کے سجود، اور کل اور جز کے سجود کی منزل کی معرفت کے بیان میں، اور یہ دونوں (کل اور جز) دو سجود (السجودين) اور دو سجدوں (السجدتين) کی منزل ہیں۔",
    "fa": "باب سیصد و شصت و دوم در معرفت منزل سجود قلب و وجه و کل و جزء، و آن دو منزل سجودین و سجدتین هستند."
  },
  "content": {
    "ar": "## «الباب الثاني والستون وثلاثمائة في معرفة منزل سجود القلب والوجه والكل والجزء وهما منزل السجودين والسجدتين»\n\n\n> مقام سهل سجود القلب ليس له *** في غير سهل من الأكوان أحكام‏\n\n\n> لا يرفع القلب رأسا بعد سجدته *** والوجه يرفع والتغيير إعلام‏\n\n\n> فإنه غير مشهود بقبلته *** وقبلة القلب أسماء وأعلام‏\n> تبدي حقيقته تأييد سجدته *** وما له في علوم الخلق أقدام‏\n\n\nهذا المنزل يسمى منزل التمكين وإلى ما يؤول إليه أمر كل ما سوى الله ويسمى أيضا منزل العصمة\n\n\n### [أن الله تعالى لما خلق العالم جعل له ظاهرا وباطنا]\n\n\nاعلم أن الله تعالى لما خلق العالم جعل له ظاهرا وباطنا وجعل منه غيبا وشهادة لنفس العالم فما غاب من العالم عن العالم فهو الغيب وما شاهد العالم من العالم فهو شهادة وكله لله شهادة وظاهر فجعل القلب من عالم الغيب وجعل الوجه من عالم الشهادة وعين للوجه جهة يسجد لها سماها بيته وقبلته أي يستقبلها بوجهه إذا صلى وجعل استقبالها عبادة وجعل أفضل أفعال الصلاة السجود وأفضل أقوالها ذكر الله بالقرآن وعين للقلب نفسه سبحانه فلا يقصد غيره وأمره أن يسجد له فإن سجد عن كشف لم يرفع رأسه أبدا من سجدته دنيا وآخرة ومن سجد من غير كشف رفع رأسه ورفعه المعبر عنه بالغفلة عن الله ونسيان الله في الأشياء فمن لم يرفع رأسه في سجود قلبه فهو الذي لا يزال يشهد الحق دائما في كل شي‏ء فلا يرى شيئا إلا ويرى الله قبل ذلك الشي‏ء وهذه حالة أبي بكر الصديق ولا تظن في العالم أنه لم يكن ساجدا ثم سجد بل لم يزل ساجدا فإن السجود له ذاتي وإنما بعض العالم كشف له عن سجوده فعلمه وبعض العالم لم يكشف له عن سجوده فجهله فتخيل أنه يرفع ويسجد ويتصرف كيف يشاء واعلم أن السجود الظاهر لما كان نقلة من حال قيام أو ركوع أو قعود إلى تطأطؤ ووضع وجه على الأرض يسمى ذلك التطاطؤ سجودا علمنا أنه طرأ على الساجد حالة لم يكن عليها في الظاهر المرئي لأبصارنا فطلبنا من الله الوقوف على منقل هذا المنقول من حال إلى حال فمن الناس من جعل ذلك وأمثاله نسبا وهو الذي أعطاه الكشف الإلهي في العلم بالأكوان التي هي الحركة والسكون والاجتماع والافتراق فالحركة عبارة عن كون الجسم أو الجوهر قد شوهد في زمان في حيز أو في مكان ثم شوهد في الزمان الآخر في حيز آخر أو في مكان آخر فقيل قد تحرك وانتقل والسكون أن يشاهد الجوهر أو الجسم في حيز واحد زمانين فصاعدا فسمى إقامته في حيزه سكونا والاجتماع عبارة عن جوهرين أو جسمين في حيزين متجاورين ليس بين الحيزين حيز ثالث والافتراق عبارة عن جوهرين أو جسمين في حيزين غير متجاورين بينهما حيز ليس فيه أحدهما فليس الأمر سوى هذا ووافق بعض أهل الكلام أهل الكشف في هذا وبقي من المسألة من هو المحرك هل المتحرك أو أمر آخر فمن الناس من قال المحرك هي الحركة قامت بالجسم فأوجبت له التحرك والانتقال واختلفوا في الحركة التي أوجبت التحرك للجسم هل تعلقت بها مشيئة العبد فتسمى اختيارية أي حركة اختيار أو لم يتعلق بها مشيئة المتحرك فتسمى اضطرارية كحركة المرتعش وهذا كله إذا ثبت أن ثم حركة كما زعم بعضهم ولم يختلفوا في إن هذه الأكوان أعراض سواء كانت نسبا أو معاني قائمة بالمحال الموصوفة بها فإنا لا نشك أنه قد عرض لها حال لم تكن عليه ومن المحال أن يكون واحد من تلك الأعراض ذاتيا لها وإنما الذاتي لها قبولها واختلفوا فيمن أوجد تلك الحركة أو السكون إذا ثبت أن ذلك عين موجودة هل هو الله تعالى أو غير الله فمن قائل بهذا الوجه ومن قائل بهذا الوجه وسواء في ذلك المرتعش وغير المرتعش ومن قائل إن الأكوان لا وجود لها وإنما هي نسب فلمن تستند ونحن نقول في النسبة الاختيارية إن الله خلق للعبد مشيئة شاء بها حكم هذه النسبة وتلك المشيئة الحادثة عن مشيئة الله يقول الله عز وجل وما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله فأثبت سبحانه المشيئة له ولنا وجعل مشيئتنا موقوفة على مشيئته هذا في الحركة الاختيارية وأما في الاضطرارية فالأمر عندنا واحد فالسبب الأول مشيئة الحق والسبب الثاني المشيئة التي وجدت عن مشيئة الحق غير إن هنا لطيفة أعطاها الكشف وأشار بها من خلف حجاب الكون وهي قوله وما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله فالله هو المشي‏ء بالكشف وإن وجد العبد في نفسه إرادة لذلك فالحق عين إرادته لا غيره كما ثبت أنه إذا أحبه كان سمعه وبصره ويده وجميع قواه فحكم المشيئة التي يجدها في نفسه ليست سوى الحق فإذا شاء الله كان ما شاءه فهو عين مشيئة كل مشي‏ء كما يقول مثبت الحركة إن زيدا تحرك أو إنه حرك يده فإذا حققت قوله‏\n\n\nعلى مذهبه وجدت أن الذي حرك يده إنما هي الحركة القائمة بيده وإن كنت لا تراها فإنك تدرك أثرها ومع هذا تقول إن زيدا حرك يده كذلك تقول إن زيدا حرك يده والمحرك إنما هو الله تعالى‏\n\n\n### [ليس في العالم سكون البتة]\n\n\nواعلم أنه ليس‏\nفي العالم سكون البتة وإنما هو متقلب أبدا دائما من حال إلى حال دنيا وآخرة ظاهرا وباطنا إلا إن ثم حركة خفية وحركة مشهودة فالأحوال تتردد وتذهب على الأعيان القابلة لها والحركات تعطي في العالم آثارا مختلفة ولولاها لما تناهت المدد ولا وجد حكم للعدد ولا جرت الأشياء إلى أجل مسمى ولا كان انتقال من دار إلى دار وأصل وجود هذه الأحوال النعوت الإلهية من نزول الحق إلى السماء الدنيا كل ليلة واستواءه على عرش محدث وكونه ولا عرش في عماء وهذا الذي أوجب أن يكون الحق سمع العبد وبصره وعين مشيئته فبه يسمع ويبصر ويتحرك ويشاء فسبحان من خفي في ظهوره وظهر في خفائه ووصف نفسه بما يقال فيه إنه صمد لا إله إلا هو يصورنا في الْأَرْحامِ كَيْفَ يَشاءُ ويقلب الليل والنهار وهو معنا أينما كنا وهو أقرب إلينا منا فكثرناه بنا ووحدناه به ثم طلب منا أن نوحده بلا إله إلا الله فوحدناه بأمره وكثرناه بنا\n\n\n> ما كل وقت يريك الحق حكمته *** في كل وقت ولا يخليه عن حكم‏\n\n\n> فانظر إلى فرح في القلب من ترح *** من الطباق عن الألواح عن قلم‏\n\n\n> جاءت بها رسل الأرواح نازلة *** على سرائرنا من حضرة الكلم‏\n\n\n> فكل علم خفي عز مطلبه *** على العقول التي لم تحظ بالقدم‏\n\n\n> فقمت حبا وإجلالا لمنزلها *** أمشي على الرأس سعيا لا على القدم‏\n\n\nولما لم تكن الأكوان سوى هذه الأربعة الأحوال فبقي الكلام في الساكن إذا سكن فبمن وإذا تحرك فإلى من وإذا اجتمع فبمن وإذا افترق فعمن‏\n\n\n> فما ثم إلا الله ما ثم غيره *** وما ثم إلا عينه وإرادته‏\n\n\nفسكن في الله فهو حيزه إذ كان في علمه ولا عين له فهو هيولاه فتصور بصورة العبد فكان له حكم ما خلق ولَهُ ما سَكَنَ في اللَّيْلِ والنَّهارِ ومن المحال أن يكون الأمر خلاف هذا فبه تلبس وعليه أسس بنيانه وثبت‏\n\n\n> فإن شهدت سواه فهو صورته *** وإن تكثرت الآيات والصور\n\n\n> ليست بغير سوى من كان منزلها *** لكنها سور تعنو لها سور\n\n\nفما في الكون حركة معقولة كما أنه ما ثم سكون مشهود\n\n\n> فانظر إلى الضد كيف يخفى *** وليس شي‏ء سواه يبدوفأعجب لحركة في عين سكون فإن الخلأ قد امتلأ فالعالم ساكن في خلائه والحركة لا تكون إلا في خلاء هذه حركة الأجسام والخلأ ملآن فلا يقبل الزيادة فإنه ما لها أين وكما سكن في الله تحرك إلى الله كما قال وتُوبُوا إِلَى الله جَمِيعاً أي ارجعوا إلى ما منه خرجتم فإنهم خرجوا مقرين بربوبيته ثم فزعوا فيها فقيل لهم ارجعوا إلى ما منه خرجتم وليس إلا الله ولا رجوع إليه إلا به إذ هو الصاحب في السفر فإن رجع رجعنا فإن الرجوع لا يكون إلا لمن له الحكم ولا حكم إلا لله ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا\n\n\n> فهذا صدق ما قلنا *** فلا تعدل عن الرشد\n\n\n> فكونوا كيفما شئتم *** فإن الحق بالرصد\n\n\nوإذا تحركت إليه فهو الهادي أو منه فمن اسمه المضل فحيرك ثم هداك فتاب عليك بالهدى فتحركت إليه بالتوبة فمن مضل إلى هاد وإِنَّ إِلى‏ رَبِّكَ الرُّجْعى‏ وأما قولنا إذا اجتمع فبمن فنقول اجتمع بالله في عين كونه تولاه الله وهو قوله لعبده هل واليت في وليا فإنه عند وليه فمن والى وليا في الله فقد والى الله وليس الاجتماع سوى ما ذكرناه‏\n\n\nورد في الخبر أن الله يقول يا عبدي مرضت فلم تعدني فيقول يا رب كيف أعودك وأنت رب العالمين فقال يا عبدي أما علمت إن عبدي فلانا مرض فلم تعده أما أنك لو عدته لوجدتني عنده‏\n\n\nفإن المريض لا يزال ذاكر الله ذكر اضطرار وافتقار وهو الذكر الأصلي الذي أنبنى عليه وجود الممكن والحق تعالى جليس الذاكر له فمن والى في الله وليا فقد اجتمع بالله فإن كنت أنت وليا\n\n\n### [إن الله إذا والى وليا هو معه‏]\n\n\nفاعلم إن الله أيضا معك فإذا واليت وليا والله معه فقد اجتمع الله بالله فجمعت بين الله ونفسه فحصل لك أجر ما يستحقه صاحب هذه الجمعية فرأيت الله برؤية وليه فإن كان في الولاية أكبر منك فالله عنده أعظم وأكبر مما هو عندك فإن الله عند أوليائه‏\nعلى قدر معرفتهم به فأكثرهم جهلا به وحيرة فيه أعظمهم علما به وإذا لم تحصل لك بولاية ولي الله نسبة الله إلى ذلك الولي الخاص حتى تفرق بين نسبته سبحانه إليك ونسبته تعالى إلى ذلك الولي فما واليته جملة واحدة فيكلمك الحق على لسان ذلك الولي بما يسمع ليفيدك علما لم يكن عندك أو يذكرك وتسمع أنت منه إن كنت وليا تشهد ولايتك فتسمع بالحق إذ هو سمعك ما يتكلم به الحق على لسان ذلك الولي فيكون الأمر كمن يحدث نفسه بنفسه فيكون المحدث عين السامع وهذا ذوق يجده كل أحد من نفسه ولا يعرف ما هو إلا من شهد الأمر على ما هو عليه وأما قولنا الافتراق فعمن فتمام الخبر وهو قوله أو عاديت في عدو أو من عاديته فقد فارقته فإن الهادي يفارق المضل والضار يفارق النافع فمن أحكم الأسماء الإلهية انفتح له في العلم بالله باب عظيم لا يضيق عن شي‏ء\n\n\n> فلو علمت الذي أقول *** لم تك غير الذي يقول‏\n\n\n> ما أنت مثلي بل أنت عيني *** فلا قئول ولا مقول‏\n\n\n> تحيرت في الذي عنينا *** فيما أتتنا به العقول‏\n\n\nفالمحقق إذا اعتبر ما يشاهده صاحب الكشف ربما عثر على الحق المطلوب فإنه في غاية الوضوح والظهور لذي عينين‏\n\n\n> فالحال يلعب بالعقول وبالنهي *** كتلاعب الأسماء بالأكوان‏\n\n\nفالعداوة والمعاداة من هناك ظهرت في الكون فالعالم المشاهد لا يتغير عليه الحال في عينه بقيام الأضداد به فإنه حق كله فإن فهمت ما أشرنا إليه علمت كيف توالي وكيف تعادي ومن تعادي ومن يعادي ومن تولى ومن يولي فسبحان من أوجدك منك وأشهدك إياك وامتن عليك بك ف\n\n\nمن عرف نفسه عرف ربه‏\n\n\nفلم ينسب شيئا إلا إليه والله غَنِيٌّ عَنِ الْعالَمِينَ‏\n\n\n### [أن الله نسب الألوهة للهوى‏]\n\n\nواعلم أن الله لما نسب الألوهة للهوى وجعله مقابلا له فقال لنبيه عليه السلام داود فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ ولا تَتَّبِعِ الْهَوى‏ وقال أَ فَرَأَيْتَ من اتَّخَذَ إِلهَهُ هَواهُ وليس الهوى سوى إرادة العبد إذا خالفت الميزان المشروع الذي وضع الله له في الدنيا وقد تقرر قوله وما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله فقد علمت بمن حكم من حكم بهواه ولهذا قال وأَضَلَّهُ الله عَلى‏ عِلْمٍ أي حيره فإن العلم بالله أوجب له الحيرة في الله إذ لا حاكم إلا الله‏\n\n\n> فقد زلزل الْأَرْضُ زِلْزالَها *** وقال لنا ما لَها ما لَها\n\n\n> فلو نظرت أعين أدركت *** إلى ربها حين أَوْحى‏ لَها\n\n\n> وحدثت الأرض أخبارها *** كما أخرجت لك أثقالها\n\n\nفمن لم يشاهد هذا المشهد لم يشهد عظمة الله في الوجود وفاته علم كثير يفوت هذا المشهود\n\n\n### [أن الأمر كان محصورا في أربع حقائق‏]\n\n\nواعلم أن الأمر لما كان محصورا في أربع حقائق الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ وقامت نشأة العلم على التربيع لم يكن في طريق الله تعالى صاحب تمكين إلا من شاهد التربيع في نفسه وأفعاله فأقام الفرائض وهي الإقامة الأولى وأقام النوافل وهي الإقامة الأخرى في ظاهره وفي باطنه فإن حكم ذلك في الظاهر وفي الباطن فعم حكم الله نشأته فإذا شهد هذا ذوقا من نفسه علم ما يثمر له هذا الأمر فله في ظاهره ست جهات والستة لها الكمال فإنها أول عدد كامل فإن سدسها إذا أضفته إلى ثلثها ونصفها كان كالكل والقلب له ستة وجوه لكل جهة وجه من القلب هو عين تلك الجهة بتلك العين يدرك الحق إذا تجلى له في الاسم الظاهر فإن عم التجلي الجهات كلها من كونه بكل شي‏ء محيطا عم القلب بوجوهه ما بدا له من الحق في كل جهة فكان نورا كله وهناك يقول العبد فعلت يا رب ويخاطبه ويقول أنت كما قال العبد الصالح كُنْتَ أَنْتَ الرَّقِيبَ عَلَيْهِمْ فظهر الضمير مع كونه ضميرا والمضمر يخالف الظاهر وقد ظهر مع كونه مضمرا في حال ظهوره فيقول في الحق أنه الظاهر في حال بطونه والباطن في حال ظهوره من وجه واحد فإن كلمة أنت ضمير مخاطب وليس سوى عينك وأنت مشهود بالخطاب فأنت المضمر الظاهر بخلاف الاسم فأسماء المضمرات أعظم قوة وأمكن في العلم بالله من الأسماء (و حكي) عن بعض العارفين ورأيته منقولا عن أبي يزيد البسطامي أنه قال في بعض مشاهده مع الحق في حال من الأحوال أنانيتي أنانيتك أي كما ينطلق على الاسم المضمر بحقيقته كذلك ينطلق عليك ما هو مثل الاسم الظاهر ولا مثل الوصف الظاهر وهذا عين ما قلناه‏\nمن قوة المضمرات ولما وقع في الكون التشبيه والاشتراك في الصور بحيث أن يغيب أحد الشخصين ويحضر الآخر فيتخيل الناظر إلى الحاضر أن الحاضر عين الغائب وضع الله في العالم الإشارات في الإخبارات والضمائر لارتفاع هذا اللبس والفصل بين ما هو وبين من يظهر بصورته واعتمدوا عليه ولما أخبر الله تعالى أن الإنسان مخلوق على الصورة قال عيسى عليه السلام كُنْتَ أَنْتَ الرَّقِيبَ عَلَيْهِمْ ففصل بين الحق وبين من هو على الصورة فكأنه قال كنت من حيث عينك لا من هو على صورتك الرقيب عليهم فناب أنت في هذا الموضع مناب العين المقصودة ولنا جزء في هذه الأسماء المضمرات سميناه كتاب الهو وهو جزء حسن بالغنا فيه في هذه الأسماء المضمرة وهي تقبل كل صورة قديمة وحديثة لتمكنها وعلو مقامها والعالم وإن تكثر فهو راجع إلى عين واحدة\n\n\n> فكل من في الوجود حق *** وكل من في الشهود خلق‏\n\n\n> فانظر إلى حكمة تجلت *** في عين حق يحويه حق‏\n\n\n> فالعبد محق والحق محق *** فليس حق ولا محق‏\n\n\nفيا ولي لا تعطل زمانك في النظر في الحركات وتحقيقها فإن الوقت عزيز وانظر إلى ما نتجه فاعتمد عليه بما يعطيك من حقيقته فإنك إن كنت نافذ البصيرة عرفت من عين النتيجة عين الحركة والمحرك فإن الحركة حقيقة العين والمحرك من وراء حجاب الكون والنتيجة ظاهرة سافرة معربة عن شأنها فاعتمد عليها فهذه نصيحتي لك يا ولي ولهذا ما نسب الحق إلى نفسه انتقالا إلا وذكر النتيجة ليعرفك ما هو عين الانتقال المنسوب إليه في نازلة ما مثل‏\n\n\nقوله ينزل ربنا إلى السماء الدنيا في الثلث الباقي من الليل ثم ذكر النتيجة فقال فيقول هل من تائب هل من داع هل من مستغفر\n\n\nوقال مثل هذا كثيرا ليريح عباده من تعب الفكر والاعتذار فإن المقصود من الحركات ما تنتج لا أعينها وكذا كل شي‏ء فالمبتدأ لو لا الخبر ما كان له فائدة ولكان عبثا الإتيان به ومن هنا يعرف قوله أَ فَحَسِبْتُمْ أَنَّما خَلَقْناكُمْ عَبَثاً وقوله وما خَلَقْنَا السَّماءَ والْأَرْضَ وما بَيْنَهُما باطِلًا ومن هنا يقع التنبيه على معرفة الحكمة التي أوجد الله لها العالم وأن اسمه الحق تعالى حق وقوله فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ إن معناه غني عن وجوده لا عن ثبوته فإن العالم في حال ثبوته يقع به الاكتفاء والاستغناء عن وجوده لأنه وفي الألوهة حقها بإمكانه ولو لا طلب الممكنات وافتقارها إلى ذوق الحالات وأرادت أن تذوق حال‏\n\n\nالوجود كما ذاقت حال العدم فسألت بلسان ثبوتها واجب الوجود أن يوجد أعيانها ليكون العلم لها ذوقا فأوجدها لها لا له فهو الغني عن وجودها وعن إن يكون وجودها دليلا عليه وعلامة على ثبوته بل عدمها في الدلالة عليه كوجودها فأي شي‏ء رجح من عدم أو وجود حصل به المقصود من العلم بالله فلهذا علمنا إن غناه سبحانه عن العالم عين غناه عن وجود العالم وهذه مسألة غريبة لاتصاف الممكن بالعدم في الأزل وكون الأزل لا يقبل الترجيح وكيف قبله عدم الممكن مع أزليته وذلك أنه من حيث ما هو ممكن لنفسه استوى في حقه القبول للحكمين فيما يفرض له حال عدم إلا ويفرض له حال وجود فما كان له الحكم فيه في حال الفرض فهو مرجح فالترجيح ينسحب على الممكن أزلا في حال عدمه وإنه منعوت بعدم مرجح والترجيح من المرجح الذي هو اسم الفاعل لا يكون إلا بقصد لذلك والقصد حركة معنوية يظهر حكمها في كل واحد بحسب ما تعطيه حقيقته فإن كان محسوسا فرغ حيزا وشغل حيزا وإن كان معقولا أزال معنى وأثبت معنى ونقل من حال إلى حال وفي هذا المنزل من العلوم علوم شتى منها علم الدعاء المقيد والدعاء المطلق وما ينبغي أن يقال لكل مدعو ويعامل به ومنها علم الحركات وأسبابها ونتائجها ومنها علم منزلة من تكلم فيما لا يعلم ويتخيل أنه يعلم هل ما تكلم به علم في نفس الأمر أم ليس بعلم أم يستحيل أن يكون إلا علما لكن لا يعلمه هذا المتكلم وهل ظهر مثل هذا في العالم وهو خلق لله لتمييز المراتب فيعلم به مرتبة الجهل من العلم والجاهل من العالم أو ما ثم إلا علم ومنها علم تعيين من جعل الله الحيرة في العالم على يديه وهل الحيرة تعطي سعادة على الإطلاق أو شقاوة أو فيها تفصيل منها ما يعطي سعادة ومنها ما يعطي شقاوة وهل المتحير فيه هل كونه متحيرا فيه اسم مفعول لذاته أم يمكن أن لا يتحير فيه وفيه علم سبب الاحتراق الذي يجده صاحب الحيرة في باطنه في حال حيرته وهل إذا علم الحائر أن الذي تحير فيه‏\nلا يكون العلم به إلا عين التحير فيه فيزول عنه ألم الاحتراق ومنها علم نصب الأدلة كيف رتبها الله للعقلاء أصحاب النظر والإستبصار ومنها علم غريب وهو هل يمكن أن يمر على القابل للعلوم زمان لا يستفيد فيه علما أم لا ومنها علم الرتبة الإلهية هل تحجب عن الله أو تدل على الله وصفة من تحجبه وصفة من تكون له دلالة على خالقه ومنها علم كون الله ما أوجد واحدا قط ولا يصح وإنما أوجد اثنين فصاعدا معا من غير تقدم في الوجود ولا تأخر ومنها علم كون الحق لا تثبت له أحدية إلا في ألوهيته وأما في وجوده فلا بد من معقولين فصاعدا فاجعل ذلك ما شئت إما نسبا أو صفات بعد أن لا تعقل أحدية ومنها علم تعلق الأسماء الإلهية بالكائنات ومنها علم سعى الآخرة إلى أن تجي‏ء ومن أين جاءت وما هذه الحركة المنسوبة إليها ومنها علم معقول الدنيا والآخرة ما هو ومنها علم جهل من أعرض عن الله وأينما تُوَلُّوا فَثَمَّ وَجْهُ الله فكيف يشقى من أقبل على وجه الله وإن لم يقصد الإقبال على وجه الله وهو في نفس الأمر مقبل على وجه الله معرض عن وجه الله ومتى ينطلق على الإنسان الإقبال على الله بكل وجه وذلك إذا كان الإنسان وجها كله وعينا كله لم يصح في حق من هذه صفته إعراض عن الله ومنها علم غريب وهو أنه لا يرجع إلى الإنسان إلا ما خرج منه للأصل الذي يعضده وهو قوله وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ ومنه بدا الأمر كله وإليه يعود وهذا معنى‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم إنما هي أعمالكم ترد عليكم‏\n\n\nفاجهد إن لا يخرج عنك إلا ما تحمد رجوعه إليك ومنها علم من يكون مع الله على آخر قدم ما يصنع ولا يكون ذلك إلا في حضرة التكليف إذ لا أجر إلا فيه فابحث على علم هذا ومنها علم الربح والخسران وما يقع فيه الربح والخسران وهل ثم موطن للإنسان يكون فيه لا يكون دنيا ولا آخرة وأعني بالآخرة الدار الآخرة التي جاءت الشرائع بها عن الله ومنها علم ما انقسم بالحال في الدنيا انقسم بالدار في الأخرى ففي الآخرة منزلان جنة وجهنم وفي الدنيا منزلتان عذاب ونعيم أو ألم ولذة فإذا كان الإنسان في حال يقال فيه إنه لا صفة له كدعوى أبي يزيد فهل صاحب هذه الدعوى هو الذي له الموطن الذي ليس بدنيا ولا آخرة ومنها علم ما يؤول إليه حال من ترك الأخذ بالأهم فالأهم وفيه علم الأمور العوارض ما لها من الأثر في العالم ومنها علم خزائن الأرزاق وقول بعض الصالحين وقد شكى إليه شخص كثرة العائلة فقال له أدخل إلى بيتك وانظر كل من ليس له رزق على الله فأخرجه فقال له كلهم رزقهم على الله فقال له فما تضرك كثرتهم أو قلتهم ومنها علم الفصل بالشهود والكشف بالحكم وفيه علم الفرق بين الإرادة والمشيئة والهمة والعزم والقصد والنية وفيه علم ما للنائب من صفات من استنابه هل يقوم بها كلها أو ما يطلبه من استنيب فيه ومنها علم مراتب القول وبما ذا ينسب السوء إليه من الحسن من الطيب ومنها علم بيان الطرق الموصلة إلى الثناء على الله بطريق التنزيه والإثبات ومنها علم ما يقع به التساوي بين الأشقياء والسعداء في الدنيا ومنها علم الميل إلى الأكوان والميل إلى جانب الحق وما يحمد من ذلك وما يذم ومنها علم إقامة نشأة ما نسب الحق إلى نفسه مما لا يقوم إلا على أيدي عباده ومنها علم الكور والحور واللازم والقائم والخاضع والنازل ومنها علم الإعلام بتكرار القصد إلى الحق في الأمور التي دعا الحق عباده إليها من العبادات ومنها علم السبل القريبة والبعيدة والسالكين فيها واحتساب الآثار إذا كان السلوك فيها وعليها مشروعا وغير مشروع لكن يقتضيه العقل السليم والنظر الصحيح وتعيين القرب الإلهية في ذلك من غير توقيف وما يصح من ذلك وما لا يصح ومنها علم الحمد لله على آلائه القريبة المناسبة من الإنسان ومنها علم ما لكل موجود من المنافع في العالم ومنها علم الموانع في العالم وما منعت عقلا وشرعا ومنها علم ظهور المعدوم في صورة الموجود وتميزه في الوجود من الوجود الحقيقي ومنها علم النحل والملل ومنها علم ما لا ينتفع به إلا بعد إزالة ما ينتفع به منه ومنها علم أحوال السائلين وما يليق بكل سائل من الجواب ومنها علم ما يقبل الحق من أعمال عباده مما لا يقبل مع كونه ليس بمحرم ولا مذموم ومنها علم الفرق بين العظمة الإلهية والكبرياء ومنها علم الإحسان ومعرفة ماهيته ومنها علم صفة من ينوب الحق عنه في صرف ما يسوءه مع وجود ما يسوءه ومنها علم المعارضة بالمثل ومنها علم عواقب الأسماء الحسنى ومنها علم العمارة والخراب وحكمهما في الدنيا والآخرة ومنها علم الرجوع عن الحق ما يؤثر في الراجع ومنها علم تقدير الواحد بالكثير كما قال بعضهم‏\n\n\n> وما على الله بمستنكر *** أن يجمع العالم في واحد\nومنها علم تقدير التخالج في الحديث وما يرفع من ذلك وما لا يرفع ومنها علم عرض الفتن على القلوب وحكم من أنس بها من غيره ومنها علم السبب المبقي للشاك على شكه مع التمكن من النظر المخرج عن الشك فلم يفعل ومنها علم الفرق بين الايمان والعلم وما بين العالم والمؤمن من المراتب ومنها علم تتبع الحق مراضي عباده الذين تتبعوا مراضيه جزاء وفاقا ومنها علم تأخير البيان مع التمكن من استعجال إيضاحه لأمر يراه العالم مع الحاجة إليه ومنها علم صفة من يطلبه العفو الإلهي ومنها علم ما ينبغي أن يكشف من العلوم وما ينبغي أن يستر منها ومنها علم تداخل عالم الغيب في الشهادة وعالم الشهادة في الغيب ومنها علم الاستدراج والمكر ومنها علم كل علم غايته العمل فلم تظهر غايته ما العلة في ذلك ومنها علم كون السماء كالخيمة لا كالكرة المجوفة وأن هيأة السموات على خلاف ما ذكره أصحاب علم الهيئة ولما ذا يرجع سير الكواكب هل لأنفسها أو لفلك دائر بها وفيه علم ما لا ينبغي فيه تنازع لوجود الإمكان العقلي فيه ومنها علم ما يؤثر العلم به في نفس العالم به ومنها علم استحالة خلق العالم أعيان الجواهر ومنها علم المصطفى المختار من كل نوع من العالم ومن كل جنس ومنها علم الآباء والأبناء في المعاني وغير المعاني ومنها علم التعلق بالأسباب وترك التعلق بها والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى السفر الرابع والعشرون‏\n\n\n( (بسم الله الرحمن الرحيم))\n\n",
    "en": "## Chapter 362: On the Knowledge of the Station of the Prostration of the Heart and the Face, the Whole and the Part, which are the Station of the Two Prostrations and the Two Acts of Prostration\n\n> The station of the heart’s prostration is easy, having no rulings\n> In the realms of existence other than the easy.\n\n> The heart does not raise its head after its prostration,\n> While the face does raise it, and this change is a sign.\n\n> For [the face] is not witnessed by its Qibla,\n> But the Qibla of the heart consists of Names and signs.\n> Its Reality reveals the confirmation of its prostration,\n> And it has no footing in the sciences of Creation.\n\nThis station is called the Station of Establishment [or Empowerment] (منزل التمكين), and it relates to the ultimate destiny of everything other than Allah. It is also called the Station of Infallibility (منزل العصمة).\n\n### On the fact that when Allah created the World, He made for it an outer and an inner aspect\n\nKnow that when Allah the Exalted created the World (العالم), He made for it an outer (ظاهرا) and an inner (باطنا) aspect. He made from it the Unseen (غيبا) and the Visible (شهادة) for the World itself. Thus, what is absent from the World to the World is the Unseen, and what the World witnesses of the World is the Visible. Yet, all of it is Visible and Outer for Allah.\n\nHe made the Heart (القلب) to be from the realm of the Unseen (عالم الغيب) and the Face (الوجه) to be from the realm of the Visible (عالم الشهادة). He designated a direction for the face to prostrate towards, which He called His House and His Qibla—meaning, the direction it faces when praying. He made facing it an act of worship. He made the best of the acts of prayer the Prostration (السجود), and the best of its utterances the remembrance of Allah through the Quran.\n\nHe designated Himself, Glory be to Him, for the heart, so that it intends none other than Him, and He commanded it to prostrate to Him. If the heart prostrates out of Unveiling (كشف), it never raises its head from its prostration, neither in this world nor the Hereafter. But whoever prostrates without Unveiling raises his head, and his raising it is expressed as heedlessness (الغفلة) of Allah and forgetting Allah in things.\n\nWhoever does not raise his head in the prostration of his heart is the one who constantly witnesses The Real (الحق) in everything. He sees nothing except that he sees Allah before that thing. This is the state of Abu Bakr al-Siddiq.\n\nDo not imagine that anyone in the World was not prostrating and then prostrated; rather, he has never ceased prostrating, for prostration is intrinsic (ذاتي) to him. It is only that some of the World has been unveiled to see its prostration, so it knows it, while some of the World has not been unveiled to see its prostration, so it is ignorant of it and imagines that it raises its head, prostrates, and acts as it wills.\n\nKnow that since the outward prostration (السجود الظاهر) is a transition from a state of standing, bowing, or sitting, to a state of bending down and placing the face on the ground—and this bending down is called prostration—we know that a state has occurred to the prostrator that he was not in before, in the visible aspect perceived by our eyes. Therefore, we sought from Allah knowledge of the source of this transition from one state to another.\n\nSome people considered this and similar transitions to be relations (نسبا), and this is what Divine Unveiling (الكشف الإلهي) granted him in the knowledge of the Existential States (الأكوان), which are movement, rest, conjunction, and separation.\n\nMovement (الحركة) is the expression for a body or substance being observed in a space or place at one time, and then observed in a different space or place at another time. Thus, it is said that it has moved and transitioned. Rest (السكون) is when the substance or body is observed in the same space for two or more times. Its remaining in its space is called rest. Conjunction (الاجتماع) is the expression for two substances or bodies being in two adjacent spaces, with no third space between them. Separation (الافتراق) is the expression for two substances or bodies being in two non-adjacent spaces, with a space between them that neither occupies. The matter is nothing more than this.\n\nSome of the People of Scholastic Theology (أهل الكلام) agreed with the People of Unveiling (أهل الكشف) on this. What remained of the issue is: Who is the mover? Is it the moving object or something else? Some people said that the mover is the movement itself, which subsists in the body and necessitates its movement and transition. They differed on whether the movement that necessitated the body's transition was connected to the servant's will (مشيئة العبد), in which case it is called voluntary movement (حركة اختيارية), or whether the will of the moving object was not connected to it, in which case it is called involuntary movement (اضطرارية), like the movement of a tremor.\n\nAll this is based on the premise that there is movement, as some claimed. They did not differ on the fact that these Existential States (الأكوان) are accidents (أعراض), whether they are relations or meanings subsisting in the loci described by them. We do not doubt that a state has occurred to them that they were not in before, and it is impossible for any of those accidents to be intrinsic (ذاتيا) to them. What is intrinsic to them is only their capacity to receive.\n\nThey differed on who brought that movement or rest into existence, assuming that it is an existing entity (عين موجودة): Is it Allah the Exalted or other than Allah? Some held one view, and some held the other, applying equally to the trembling person and the non-trembling person.\n\nOthers said that the Existential States have no existence; they are merely relations (نسب). To whom, then, are they attributed?\n\nRegarding the voluntary relation (النسبة الاختيارية), we say that Allah creates for the servant a will (مشيئة) by which he wills the ruling of this relation. Concerning that contingent will arising from the Will of Allah, Allah the Mighty and Majestic says: <<وما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله>> (And you do not will except that Allah wills). Thus, He established the will for Himself and for us, and made our will dependent on His Will. This is concerning voluntary movement.\n\nAs for involuntary movement, the matter is the same for us. The first cause is the Will of The Real (مشيئة الحق), and the second cause is the will that came into existence from the Will of The Real. However, there is a subtlety here, granted by Unveiling and indicated by the one behind the veil of contingency, which is His saying: <<وما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله>>. By Unveiling, Allah is the one who wills, even if the servant finds an intention for that in himself. The Real is the very essence of his intention, nothing else, just as it is established that if He loves him, He is his hearing, his sight, his hand, and all his powers. Thus, the ruling of the will that he finds in himself is none other than The Real. When Allah wills, what He wills comes to be, and He is the very will of every willing agent.\n\nJust as the one who affirms movement says that Zayd moved or that he moved his hand, if you verify his statement according to his doctrine, you will find that what moved his hand is the movement subsisting in his hand, and even though you do not see it, you perceive its effect. Despite this, you say that Zayd moved his hand. Likewise, you say that Zayd moved his hand, but the Mover is none other than Allah the Exalted.\n\n### There is absolutely no rest in the World\n\nKnow that there is absolutely no rest (سكون) in the World (العالم). Rather, it is perpetually and constantly transitioning (متقلب أبدا دائما) from state to state, in this world and the Hereafter, outwardly and inwardly. However, there is a hidden movement (حركة خفية) and a witnessed movement (حركة مشهودة).\n\nThe states (الأحوال) alternate and pass over the Immutable Essences (الأعيان القابلة لها). Movements produce different effects in the World. Were it not for them, the periods of time would not be finite, the ruling of number would not exist, things would not proceed to a fixed term (أجل مسمى), and there would be no transition from one abode to another.\n\nThe origin of the existence of these states lies in the Divine Attributes (النعوت الإلهية), such as the descent of The Real (نزول الحق) to the lowest heaven every night, His establishment upon a newly created Throne, and His being in the Cloud (عماء) when there was no Throne. This is what necessitated that The Real be the servant's hearing and sight, and the essence of his will. By Him, he hears, sees, moves, and wills.\n\nGlory be to Him who was concealed in His manifestation and manifested in His concealment, and described Himself with what is said of Him: He is the Eternal Refuge (صمد), there is no god but He. He fashions us in the wombs as He wills <<يُصَوِّرُكُمْ فِي الْأَرْحامِ كَيْفَ يَشاءُ>>, and He alternates the night and the day. He is with us wherever we are, and He is closer to us than we are to ourselves. Thus, we multiplied Him through ourselves (كثرناه بنا) and unified Him through Him (ووحدناه به). Then He asked us to unify Him with \"There is no god but Allah.\" So we unified Him by His command and multiplied Him through ourselves.\n\n> Not every time does The Real show you His wisdom,\n> Nor does He leave any time devoid of a ruling.\n\n> Look then at the joy in the heart arising from sorrow,\n> From the layers, from the tablets, from the Pen.\n\n> Messengers of the Spirits (رسل الأرواح) brought them, descending\n> Upon our innermost secrets from the Presence of the Word (حضرة الكلم).\n\n> Every hidden knowledge is difficult to attain\n> For the intellects that have not been granted precedence.\n\n> So I stood up in love and reverence for its station,\n> Walking on my head in striving, not on my feet.\n\nSince the Existential States (الأكوان) are nothing but these four states, the discussion remains: If the quiescent rests, by whom does he rest? And if he moves, to whom does he move? And if he joins, by whom does he join? And if he separates, from whom does he separate?\n\n> There is nothing there but Allah, there is none other than Him,\n> And there is nothing there but His Essence and His Will.\n\nHe rests *in* Allah, for He is his space (حيزه), since he was in His Knowledge and had no fixed entity (عين له). He is his primordial matter (هيولاه), so he was fashioned in the form of the servant, and the ruling of what was created became his. <<وَلَهُ ما سَكَنَ فِي اللَّيْلِ وَالنَّهارِ>> (And to Him belongs whatever rests in the night and the day). It is impossible for the matter to be otherwise. By Him, he is clothed, and upon Him, his structure is founded and established.\n\n> If you witness other than Him, it is His form,\n> Even if the signs and forms multiply.\n\n> They are not other than the one whose station they are,\n> But they are walls to which other walls submit.\n\nThere is no intelligible movement in the cosmos, just as there is no witnessed rest.\n\n> Look at how the opposite is concealed,\n> And nothing other than Him appears.\n\nMarvel at a movement in the very essence of rest! For the void (الخلأ) has been filled, and the World is resting in its void. Movement only occurs in a void—this is the movement of bodies—yet the void is full and accepts no increase, for it has no \"where.\"\n\nJust as he rested *in* Allah, he moved *to* Allah, as He said: <<وَتُوبُوا إِلَى اللهِ جَمِيعاً>> (And turn in repentance to Allah, all of you)—meaning, return to that from which you came forth. For they came forth acknowledging His Lordship, then they were terrified within it, so they were told to return to that from which they came forth. There is none but Allah, and there is no return to Him except by Him, since He is the Companion (الصاحب) on the journey. If He returns, we return, for the return is only for the one who has the ruling, and there is no ruling except for Allah. <<ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا>> (Then He turned to them in mercy, that they might repent).\n\n> This is the truth of what we have said,\n> So do not deviate from guidance.\n\n> Be as you wish,\n> For The Real is in wait.\n\nIf you move *to* Him, He is the Guide (الهادي); or if you move *from* Him, it is from His Name, the Misleader (المضل). So He caused you to be bewildered, then guided you, and turned to you in mercy with guidance, so you moved to Him through repentance—from the Misleader to the Guide. <<وَإِنَّ إِلى رَبِّكَ الرُّجْعى>> (And indeed, to your Lord is the return).\n\nAs for our saying, \"If he joins, by whom does he join?\" We say: He joins *by* Allah, in the very essence of his being taken as a friend (تولاه الله). This is His saying to His servant: \"Have you befriended a friend of Mine?\" For He is with His friend. Thus, whoever befriends a friend of Allah *in* Allah has befriended Allah. Conjunction is nothing other than what we have mentioned.\n\nIt is related in the Hadith that Allah says: \"O My servant, I was sick, and you did not visit Me.\" He says: \"O Lord, how could I visit You, when You are the Lord of the Worlds?\" He said: \"O My servant, did you not know that My servant so-and-so was sick, and you did not visit him? Had you visited him, you would have found Me with him.\"\n\nThe sick person is constantly remembering Allah, a remembrance of necessity and poverty (ذكر اضطرار وافتقار), which is the original remembrance upon which the existence of the contingent (الممكن) is built. The Real (الحق) is the companion of the one who remembers Him. Thus, whoever befriends a friend of Allah *in* Allah has joined with Allah. If you are a friend of Allah (وليا)...\n\n### On the fact that when Allah takes a friend, He is with him\n\nKnow that Allah is also with you. If you befriend a friend of Allah, and Allah is with him, then Allah has joined with Allah (اجتمع الله بالله). Thus, you have combined Allah and Himself, and you have attained the reward deserved by the possessor of this combination. You saw Allah through the vision of His friend. If that friend is greater than you in sainthood (الولاية), then Allah is greater and mightier with him than He is with you, for Allah is with His friends according to their knowledge of Him. The most ignorant and bewildered among them concerning Him are the greatest in knowledge of Him.\n\nIf you do not attain, through befriending a friend of Allah, the specific relation of Allah to that particular friend—so that you distinguish between His relation, Glory be to Him, to you and His relation, the Exalted, to that friend—then you have not befriended him completely.\n\nThe Real speaks to you through the tongue of that friend with what is heard, to grant you knowledge you did not possess, or to remind you. If you are a friend of Allah who witnesses your sainthood, you hear from him by The Real, since He is your hearing, what The Real speaks through the tongue of that friend. The matter is then like someone speaking to himself, where the speaker is the very essence of the listener. This is a taste (ذوق) that everyone finds in himself, but only those who witness the matter as it truly is know what it is.\n\nAs for our saying, \"Separation, from whom does he separate?\" It is the completion of the Hadith, which is His saying: \"Or have you taken an enemy *in* Me?\" Whoever you take as an enemy has separated from you. For the Guide separates from the Misleader, and the Harmful separates from the Beneficial. Whoever masters the Divine Names (الأسماء الإلهية) will have a great door opened for him in the Knowledge of Allah, a door that is not too narrow for anything.\n\n> If you knew what I say,\n> You would be none other than the one who says it.\n\n> You are not like me, rather you are my very Essence,\n> So there is neither speaker nor spoken.\n\n> I was bewildered by what we meant,\n> In what the intellects brought to us.\n\nThe verifier (المحقق), when he considers what the possessor of Unveiling witnesses, may stumble upon the sought-after Truth, for it is in the utmost clarity and manifestation for the one with two eyes.\n\n> The state plays with the intellects and the minds,\n> Like the Names playing with the Existential States.\n\nEnmity and taking an enemy (العداوة والمعاداة) appeared in the cosmos from that source. The witnessed World does not change its state in its essence due to the subsistence of opposites within it, for it is all The Real (حق كله). If you understand what we have indicated, you will know how to befriend and how to take an enemy, whom to take as an enemy, who takes an enemy, who takes a friend, and who is taken as a friend.\n\nGlory be to Him who brought you into existence from yourself, made you witness yourself, and conferred favor upon you through yourself.\n\n> Whoever knows himself knows his Lord.\n\nThus, he attributes nothing except to Him. And Allah is <<غَنِيٌّ عَنِ الْعالَمِينَ>> (Self-Sufficient above the Worlds).\n\n### On the fact that Allah attributed Divinity to Caprice\n\nKnow that when Allah attributed Divinity (الألوهة) to caprice (الهوى) and made it opposite to Him, He said to His Prophet David, peace be upon him: <<فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ وَلا تَتَّبِعِ الْهَوى>> (So judge between the people with the truth and do not follow caprice). And He said: <<أَ فَرَأَيْتَ مَنِ اتَّخَذَ إِلهَهُ هَواهُ>> (Have you seen him who takes his caprice as his god?).\n\nCaprice is nothing but the servant's will (إرادة العبد) when it contradicts the prescribed balance (الميزان المشروع) that Allah established for him in this world. It has already been established by His saying: <<وما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله>>. Thus, you know by whom the one who judges by his caprice has judged. For this reason, He said: <<وَأَضَلَّهُ اللهُ عَلى عِلْمٍ>> (And Allah led him astray upon knowledge)—meaning, He caused him to be bewildered. For knowledge of Allah necessitated bewilderment (الحيرة) in Allah, since there is no ruler but Allah.\n\n> The earth was shaken with its earthquake,\n> And He said to us: What is wrong with it?\n\n> If eyes had looked, they would have perceived,\n> When its Lord inspired it.\n\n> And the earth would have recounted its news,\n> Just as it brought forth its burdens for you.\n\nWhoever does not witness this scene has not witnessed the Majesty of Allah in Existence (الوجود), and much knowledge that this witnessed reality affords has escaped him.\n\n### On the fact that the Matter was confined to Four Realities\n\nKnow that since the Matter (الأمر) was confined to four Realities: <<الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْباطِنُ>> (The First, the Last, the Outer, and the Inner), and the structure of Knowledge (نشأة العلم) is based on the Quaternary (التربيع), no one on the path of Allah the Exalted is a possessor of Establishment (صاحب تمكين) except the one who witnesses the Quaternary in himself and his actions. Thus, he establishes the obligatory duties (الفرائض), which is the first establishment, and he establishes the supererogatory acts (النوافل), which is the other establishment, in his outer and his inner aspects. When the ruling of this is established in the outer and the inner, the ruling of Allah encompasses his structure.\n\nWhen he witnesses this as a taste (ذوقا) from himself, he knows what this matter yields for him. In his outer aspect, he has six directions, and the number six possesses perfection, for it is the first perfect number (أول عدد كامل). If its sixth is added to its third and its half, the result is equal to the whole.\n\nThe heart has six faces. For every direction, there is a face of the heart, which is the very essence of that direction. With that essence, he perceives The Real when He discloses Himself (تجلى) to him in the Outer Name (الاسم الظاهر). If the Self-disclosure (التجلي) encompasses all directions, by virtue of His encompassing everything, the heart, with its faces, is encompassed by what appears to it of The Real in every direction, and thus becomes entirely Light.\n\nIt is there that the servant says, \"I did, O Lord,\" and addresses Him, saying, \"You are,\" just as the righteous servant said: <<كُنْتَ أَنْتَ الرَّقِيبَ عَلَيْهِمْ>> (You were the Watcher over them). The pronoun (الضمير) appeared despite being a pronoun, and the concealed (المضمر) differs from the manifest (الظاهر). Yet, it appeared despite being concealed in its state of manifestation.\n\nThus, one says concerning The Real that He is the Outer in the state of His Innerness, and the Inner in the state of His Outerness, from a single perspective. For the word \"You\" (أنت) is a pronoun of address, and it is none other than your very essence, and you are witnessed by the address. Thus, you are the concealed-manifest, unlike the Name (الاسم). The names of the concealed pronouns are greater in power and more established in the Knowledge of Allah than the explicit Names.\n\nIt is related (و حكي) concerning some Gnostics, and I have seen it transmitted from Abu Yazid al-Bistami, that he said in one of his witnessings with The Real in a certain state: \"My I-ness is Your I-ness\" (أنانيتي أنانيتك)—meaning, just as the concealed Name is applied according to its reality, so too is applied to you what is like the manifest Name, but not like the manifest Attribute. This is the very essence of what we said regarding the power of the concealed pronouns.\n\nSince similitude (التشبيه) and participation (الاشتراك) occurred in the cosmos in forms, such that one of two persons might be absent while the other is present, and the observer imagines that the present one is the very essence of the absent one, Allah established in the World the use of indications in reports and pronouns to remove this confusion and to distinguish between what a thing is and the one who appears in its form. They relied upon this.\n\nWhen Allah the Exalted informed that man was created upon the Form (على الصورة), Jesus, peace be upon him, said: <<كُنْتَ أَنْتَ الرَّقِيبَ عَلَيْهِمْ>>. Thus, he distinguished between The Real and the one who is upon the Form. It is as if he said: \"You, from the perspective of Your Essence, not the one who is upon Your Form, were the Watcher over them.\" In this context, the word \"You\" (أنت) substitutes for the intended Essence (العين المقصودة). We have a section on these concealed Names, which we called *Kitāb al-Huwa* (The Book of He), and it is a fine section in which we elaborated on these concealed Names. They accept every form, ancient and recent, due to their establishment and the loftiness of their station.\n\nThe World, though multiplied, returns to a single Essence (عين واحدة).\n\n> Everyone in Existence is The Real,\n> And everyone in Witnessing is Creation.\n\n> Look then at a wisdom that manifested\n> In the essence of The Real that encompasses The Real.\n\n> The servant is right (muḥiq) and The Real is right (muḥiq),\n> So there is neither The Real nor the right-doer.\n\nO friend of Allah (ولي), do not waste your time contemplating movements and verifying them, for time is precious. Look at what we are heading towards and rely upon it with what it grants you of its reality. If you are penetrating in insight, you will know from the very essence of the result (النتيجة) the very essence of the movement and the mover. For movement is the reality of the Essence, and the mover is from behind the veil of contingency, while the result is manifest, unveiled, and expressive of its state. Rely upon it. This is my advice to you, O friend of Allah.\n\nFor this reason, The Real never attributed a transition (انتقالا) to Himself without mentioning the result, so that He might inform you of the very essence of the transition attributed to Him in a specific instance. For example, His saying: \"Our Lord descends to the lowest heaven in the last third of the night,\" and then He mentioned the result, saying: \"Then He says: Is there any penitent? Is there any supplicant? Is there any seeker of forgiveness?\"\n\nHe said things like this often to relieve His servants from the burden of thought and justification. For the purpose of movements is what they produce, not their essences. This is true of everything. Were it not for the predicate (الخبر), the subject (المبتدأ) would have no benefit, and bringing it would be futile. From this, one understands His saying: <<أَ فَحَسِبْتُمْ أَنَّما خَلَقْناكُمْ عَبَثاً>> (Did you think that We created you uselessly?), and His saying: <<وَما خَلَقْنَا السَّماءَ وَالْأَرْضَ وَما بَيْنَهُما باطِلًا>> (And We did not create the heaven and the earth and what is between them in vain).\n\nFrom this, attention is drawn to the knowledge of the wisdom for which Allah brought the World into existence, and that His Name, The Real (الحق), the Exalted, is true.\n\nHis saying: <<فَإِنَّ اللهَ غَنِيٌّ عَنِ الْعالَمِينَ>> (Indeed, Allah is Self-Sufficient above the Worlds) means that He is self-sufficient from its *existence* (وجوده), but not from its *fixity* (ثبوته). For the World, in its state of fixity (the Immutable Essences), fulfills the requirement of self-sufficiency and independence from its existence, because it fulfilled the right of Divinity (الألوهة) through its possibility (إمكانه).\n\nWere it not for the demand of the possibilities (الممكنات) and their need to taste the states (ذوق الحالات), and their desire to taste the state of Existence (حال الوجود) just as they tasted the state of non-existence (حال العدم), they would not have asked the Necessary Existent (واجب الوجود) with the tongue of their fixity (لسان ثبوتها) to bring their essences into existence, so that knowledge might be a taste for them. So He brought them into existence for them, not for Himself. Thus, He is Self-Sufficient from their existence and from their existence being a proof (دليلا) for Him or a sign (علامة) of His fixity. Rather, their non-existence is, in its indication of Him, like their existence. Whichever is preferred, non-existence or existence, the intended goal of the Knowledge of Allah is achieved by it.\n\nFor this reason, we know that His Self-Sufficiency, Glory be to Him, from the World is the very essence of His Self-Sufficiency from the World's existence. This is a strange issue concerning the contingent being described by non-existence in pre-eternity (الأزل), and the fact that pre-eternity does not accept preference (الترجيح). How, then, did the non-existence of the contingent accept it despite its pre-eternity?\n\nThis is because, from the perspective of its being contingent in itself, it was equally receptive to both rulings regarding what is hypothesized for it: a state of non-existence and a state of existence. Whatever ruling it has in the state of hypothesis is preferred. Thus, preference (الترجيح) extends to the contingent pre-eternally in its state of non-existence, and it is described by a preferred non-existence. Preference from the Preferring Agent (المرجح), who is the active name, only occurs through an intention (قصد) for that. Intention is a conceptual movement (حركة معنوية) whose ruling appears in every individual according to what its reality grants. If it is sensible, it empties a space and occupies a space. If it is intelligible, it removes a meaning and establishes a meaning, and transitions from one state to another.\n\nIn this station (المنزل) are various sciences (علوم شتى), including:\n\nThe science of restricted supplication (الدعاء المقيد) and absolute supplication (الدعاء المطلق), and what should be said to every supplicated one and how he should be treated.\nThe science of movements, their causes, and their results.\nThe science of the station of one who speaks about what he does not know, yet imagines that he knows: Is what he spoke knowledge in reality, or is it not knowledge, or is it impossible for it to be anything but knowledge, but this speaker does not know it? And has such a thing appeared in the World, being a creation of Allah for distinguishing the Levels (المراتب), so that the level of ignorance is known from knowledge, and the ignorant from the knowledgeable, or is there nothing but knowledge?\nThe science of designating those through whose hands Allah established bewilderment (الحيرة) in the World, and whether bewilderment grants absolute felicity (سعادة) or wretchedness (شقاوة), or if there is a distinction: some granting felicity and some granting wretchedness.\nWhether the object of bewilderment (المتحير فيه) is, by virtue of its being bewildered in, a passive participle of its Essence, or if it is possible not to be bewildered in it.\nThe science of the cause of the burning (الاحتراق) that the possessor of bewilderment finds in his inner being during his state of bewilderment. And if the bewildered person knows that knowledge of the object of his bewilderment is the very essence of bewilderment in it, does the pain of burning cease for him?\nThe science of establishing proofs (الأدلة): how Allah arranged them for the rational people (العقلاء) who possess contemplation and insight.\nA strange science: Is it possible for a period of time to pass over the recipient of sciences without him gaining any knowledge, or not?\nThe science of the Divine Rank (الرتبة الإلهية): Does it veil from Allah or indicate Allah? And the description of the one whom it veils, and the description of the one for whom it serves as an indication of his Creator.\nThe science of the fact that Allah never brought one thing into existence alone, nor is it valid; rather, He brought two or more things into existence simultaneously, without precedence or delay in existence.\nThe science of the fact that Oneness (أحدية) is not established for The Real except in His Divinity (ألوهيته). As for His Existence (وجوده), there must be two or more intelligibles (معقولين). Make that whatever you wish, either relations or attributes, provided that you do not conceive of Oneness.\nThe science of the connection of the Divine Names to the existents (الكائنات).\nThe science of the striving of the Hereafter until it arrives, and from where it came, and what is this movement attributed to it.\nThe science of what the intelligible meaning of this world and the Hereafter is.\nThe science of the ignorance of the one who turns away from Allah, when <<فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ اللهِ>> (So wherever you turn, there is the Face of Allah). How can one who turns towards the Face of Allah be wretched, even if he did not intend to turn towards the Face of Allah?\nWhen is turning towards Allah applicable to a person in every respect? That is when the human being is entirely a face and entirely an essence. It is not valid for one whose description is this to turn away from Allah.\nA strange science: Nothing returns to the human being except what came forth from him, based on the principle supported by His saying: <<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him is returned the whole matter). From Him the whole matter began, and to Him it returns. This is the meaning of:\n\nHis saying, peace and blessings be upon him: \"They are only your deeds that are returned to you.\"\n\nStrive, then, that nothing comes forth from you except what you would praise its return to you.\nThe science of what the one who is with Allah on the last step does. This only occurs in the Presence of Responsibility (حضرة التكليف), as there is no reward except therein. Seek knowledge of this.\nThe science of profit and loss, and where profit and loss occur. Is there a station for man that is neither this world nor the Hereafter? By the Hereafter, I mean the Final Abode brought by the Divine Laws.\nThe science of the fact that what is divided by state in this world is divided by abode in the Hereafter. In the Hereafter, there are two stations: Paradise and Hell. In this world, there are two stations: torment and bliss, or pain and pleasure. If a person is in a state where it is said that he has no attribute, as claimed by Abu Yazid, is the claimant of this the one who has the station that is neither this world nor the Hereafter?\nThe science of the destiny of one who neglects to take the most important things first.\nThe science of the incidental matters (الأمور العوارض) and their effect on the World.\nThe science of the treasuries of provisions (خزائن الأرزاق) and the saying of one of the righteous men when a person complained to him about a large family: \"Go into your house and look for everyone whose provision is not upon Allah, and turn him out.\" The man replied: \"All of them have their provision upon Allah.\" The righteous man said: \"Then how can their multitude or scarcity harm you?\"\nThe science of distinction by Witnessing (الشهود) and Unveiling (الكشف) by ruling.\nThe science of the difference between Intention (الإرادة), Will (المشيئة), Aspiration (الهمة), Resolve (العزم), Aim (القصد), and Purpose (النية).\nThe science of the attributes of the deputy (النائب): Does he fulfill all the attributes of the one who appointed him, or only what he was appointed for?\nThe science of the levels of speech and by what criterion evil is attributed to it, distinguishing it from good and pure speech.\nThe science of clarifying the paths leading to the praise of Allah through the way of Transcendence (التنزيه) and Affirmation (الإثبات).\nThe science of what causes equality between the wretched and the felicitous in this world.\nThe science of inclination towards the Existential States and inclination towards the side of The Real, and what is praiseworthy and what is blameworthy of that.\nThe science of establishing the structure of what The Real attributed to Himself, which cannot be established except through the hands of His servants.\nThe science of Repetition (الكور) and Return (الحور), the Necessary (اللازم), the Subsisting (القائم), the Submissive (الخاضع), and the Descending (النازل).\nThe science of informing about the repetition of intention towards The Real in the matters of worship to which The Real called His servants.\nThe science of the near and far paths, and the travelers upon them, and the reckoning of effects when the journey upon them is prescribed or not prescribed, but is necessitated by sound intellect and correct contemplation, and the designation of Divine Proximities (القرب الإلهية) in that without explicit textual warrant, and what of that is valid and what is not.\nThe science of praising Allah for His near bounties (آلائه القريبة) that are appropriate to man.\nThe science of the benefits of every existent thing in the World.\nThe science of obstacles (الموانع) in the World, and what they prevent rationally and legally.\nThe science of the appearance of the non-existent (المعدوم) in the form of the existent, and its distinction in existence from true Existence.\nThe science of sects (النحل) and religions (الملل).\nThe science of what is only beneficial after removing what is beneficial from it.\nThe science of the states of the questioners and the appropriate answer for each questioner.\nThe science of what Allah accepts of His servants' deeds and what He does not accept, even though it is neither forbidden nor blameworthy.\nThe science of the difference between Divine Majesty (العظمة الإلهية) and Grandeur (الكبرياء).\nThe science of Benevolence (الإحسان) and the knowledge of its essence.\nThe science of the description of the one who acts as a deputy for The Real in averting what is displeasing to Him, even when the displeasing thing exists.\nThe science of opposition by analogy (المعارضة بالمثل).\nThe science of the consequences of the Beautiful Names (الأسماء الحسنى).\nThe science of cultivation (العمارة) and ruin (الخراب) and their ruling in this world and the Hereafter.\nThe science of the effect of returning from The Real upon the one who returns.\nThe science of estimating the one by the many, as some said:\n\n> And it is not strange for Allah\n> To gather the World in one.\n\nThe science of estimating the confusion (التخالج) in the Hadith, and what of that is lifted and what is not.\nThe science of the presentation of trials (الفتن) to the hearts, and the ruling of one who is familiar with them compared to others.\nThe science of the cause that keeps the doubter in his doubt, despite having the ability to contemplate and exit doubt, yet he does not do so.\nThe science of the difference between Faith (الإيمان) and Knowledge (العلم), and the levels between the knowledgeable and the believer.\nThe science of The Real seeking the satisfactions of His servants who sought His satisfactions, as a fitting recompense.\nThe science of delaying clarification (تأخير البيان) when it is possible to hasten its explanation, due to a matter perceived by the knowledgeable person, despite the need for it.\nThe science of the description of the one whom Divine Pardon (العفو الإلهي) seeks.\nThe science of what should be unveiled of the sciences and what should be concealed of them.\nThe science of the interpenetration of the realm of the Unseen into the Visible, and the realm of the Visible into the Unseen.\nThe science of gradual enticement (الاستدراج) and cunning (المكر).\nThe science of every knowledge whose goal is action, but whose goal does not appear: What is the reason for that?\nThe science of the heaven being like a tent, not a hollow sphere, and that the structure of the heavens is contrary to what the astronomers mentioned. Why do the stars reverse their course? Is it due to themselves or to a sphere rotating around them? This includes the science of what should not be disputed due to the existence of rational possibility therein.\nThe science of what the knowledge of a thing affects in the soul of the one who knows it.\nThe science of the impossibility of creating the essences of substances (أعيان الجواهر) in the World.\nThe science of the chosen elect (المصطفى المختار) from every species of the World and from every genus.\nThe science of fathers and sons in conceptual and non-conceptual meanings.\nThe science of reliance on causes (الأسباب) and abandoning reliance on them. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).\n\nEnd of the Twenty-Fourth Journey.\n\n(In the Name of Allah, the Most Compassionate, the Most Merciful)",
    "ur": "باب تین سو باسٹھ: قلب، چہرے، کل اور جز کے سجدے کے مقام کی معرفت میں، اور یہ دونوں سجدوں اور دو سجدوں کا مقام ہے۔\n\nقلب کے سجدے کا آسان مقام، کائنات میں آسان کے سوا اس کے لیے کوئی احکام نہیں۔\nقلب اپنے سجدے کے بعد سر نہیں اٹھاتا، جبکہ چہرہ اٹھاتا ہے، اور یہ تبدیلی ایک علامت ہے۔\nکیونکہ وہ (قلب) اپنے قبلے کے ساتھ مشہود نہیں ہوتا، اور قلب کا قبلہ اسماء اور نشانیاں ہیں۔\nاس کی حقیقت اس کے سجدے کی تائید ظاہر کرتی ہے، اور مخلوق کے علوم میں اس کے قدم نہیں ہیں۔\n\nیہ مقام منزل التمکین (تمکین کا مقام) کہلاتا ہے، اور اس کی طرف ہر وہ چیز لوٹتی ہے جو اللہ کے سوا ہے۔ اسے منزل العصمة (عصمت کا مقام) بھی کہا جاتا ہے۔\n\n### [یہ کہ اللہ تعالیٰ نے جب عالم کو پیدا کیا تو اس کے لیے ظاہر اور باطن بنایا]\n\nجان لو کہ اللہ تعالیٰ نے جب عالم کو پیدا کیا تو اس کے لیے ظاہر اور باطن بنایا، اور اسی عالم کے لیے اس میں سے غیب اور شہادت (شہود) بنایا۔ پس جو عالم سے عالم کے لیے غائب ہے وہ الغیب (غیب) ہے، اور جو عالم نے عالم سے مشاہدہ کیا وہ الشہود (شہود) ہے۔ اور یہ سب اللہ کے لیے الشہود (شہود) اور ظاہر ہے۔ پس اس نے قلب کو عالم الغیب (عالم غیب) سے بنایا اور چہرے کو عالم الشہادة (عالم شہادت) سے بنایا۔ اور چہرے کے لیے ایک سمت مقرر کی جس کی طرف وہ سجدہ کرے، اسے اپنا گھر اور قبلہ نام دیا، یعنی جب وہ نماز پڑھے تو اپنے چہرے سے اس کا استقبال کرے۔ اور اس استقبال کو عبادت قرار دیا۔ اور نماز کے افعال میں سب سے افضل سجدے کو قرار دیا، اور اس کے اقوال میں سب سے افضل قرآن کے ذریعے اللہ کا ذکر قرار دیا۔ اور قلب کے لیے خود اپنی ذات سبحانہ کو مقرر کیا، پس وہ اس کے سوا کسی اور کا قصد نہ کرے۔ اور اسے حکم دیا کہ وہ اس کے لیے سجدہ کرے۔ پس اگر کسی نے الکشف (کشف) کے ذریعے سجدہ کیا تو وہ دنیا و آخرت میں کبھی بھی اپنے سجدے سے سر نہیں اٹھائے گا۔ اور جس نے بغیر الکشف (کشف) کے سجدہ کیا، وہ اپنا سر اٹھائے گا، اور اس کا سر اٹھانا اللہ سے غفلت اور چیزوں میں اللہ کو بھول جانے سے تعبیر کیا جاتا ہے۔ پس جس نے اپنے قلب کے سجدے میں سر نہیں اٹھایا، وہ وہ ہے جو ہمیشہ ہر چیز میں الحق (ذات حق) کا الشہود (شہود) کرتا رہتا ہے، پس وہ کوئی چیز نہیں دیکھتا مگر اس چیز سے پہلے اللہ کو دیکھتا ہے۔ اور یہ حضرت ابوبکر صدیق رضی اللہ عنہ کا حال ہے۔ اور عالم کے بارے میں یہ گمان نہ کرو کہ وہ سجدہ نہیں کر رہا تھا پھر اس نے سجدہ کیا، بلکہ وہ ہمیشہ سجدہ میں رہا ہے، کیونکہ سجدہ اس کے لیے ذاتی ہے۔ درحقیقت، عالم کے بعض حصے کے لیے اس کے سجدے کا الکشف (کشف) ہوا تو اس نے اسے جان لیا، اور عالم کے بعض حصے کے لیے اس کے سجدے کا الکشف (کشف) نہیں ہوا تو اس نے اسے جہالت میں رکھا، پس اس نے یہ خیال کیا کہ وہ جب چاہے سر اٹھاتا ہے، سجدہ کرتا ہے اور تصرف کرتا ہے۔\n\nاور جان لو کہ جب ظاہر سجدہ قیام، رکوع یا قعود کی حالت سے جھکنے اور چہرے کو زمین پر رکھنے کی طرف منتقل ہوتا ہے، اور اس جھکنے کو سجدہ کہا جاتا ہے، تو ہم نے جانا کہ سجدہ کرنے والے پر ایک ایسی حالت طاری ہوئی جو ہماری آنکھوں سے نظر آنے والے ظاہر میں موجود نہیں تھی۔ پس ہم نے اللہ سے اس منقول (منتقل ہونے والے) کے ایک حال سے دوسرے حال میں منتقل ہونے کی جگہ پر مطلع ہونے کی درخواست کی۔ پس لوگوں میں سے بعض نے اسے اور اس جیسی چیزوں کو نسبتیں قرار دیا، اور یہ وہ شخص ہے جسے الکشف (کشف) الٰہی عطا ہوا ہے، کائناتوں (الأکوان) کے علم میں جو کہ حرکت، سکون، اجتماع اور افتراق ہیں۔ حرکت سے مراد یہ ہے کہ جسم یا جوہر ایک وقت میں ایک حیز (جگہ) یا مقام میں دیکھا گیا، پھر دوسرے وقت میں کسی دوسرے حیز یا دوسرے مقام میں دیکھا گیا، تو کہا گیا کہ وہ حرکت کر گیا اور منتقل ہو گیا۔ اور سکون یہ ہے کہ جوہر یا جسم کو ایک ہی حیز میں دو یا زیادہ وقتوں تک دیکھا جائے، تو اس کے اپنے حیز میں ٹھہرنے کو سکون کہا گیا۔ اور اجتماع سے مراد دو جوہر یا دو جسم ہیں جو دو متصل حیزوں میں ہوں اور ان دونوں حیزوں کے درمیان کوئی تیسرا حیز نہ ہو۔ اور افتراق سے مراد دو جوہر یا دو جسم ہیں جو دو غیر متصل حیزوں میں ہوں اور ان کے درمیان ایک ایسا حیز ہو جس میں ان میں سے کوئی بھی موجود نہ ہو۔ پس معاملہ اس کے سوا کچھ نہیں۔ اور بعض اہل کلام نے اس معاملے میں اہل الکشف (کشف) سے اتفاق کیا۔ اور اس مسئلے میں یہ بات باقی رہی کہ محرک کون ہے؟ کیا وہ متحرک ہے یا کوئی اور امر؟ پس لوگوں میں سے بعض نے کہا کہ محرک وہ حرکت ہے جو جسم کے ساتھ قائم ہوئی اور اس کے لیے حرکت اور انتقال کو واجب کر دیا۔ اور انہوں نے اس حرکت کے بارے میں اختلاف کیا جس نے جسم کے لیے حرکت کو واجب کیا، کہ کیا اس کا تعلق بندے کی مشیئت (ارادہ) سے ہے، تو اسے اختیاری حرکت کہا جائے گا، یا اس کا تعلق متحرک کی مشیئت سے نہیں ہے، تو اسے اضطراری حرکت کہا جائے گا، جیسے کانپنے والے کی حرکت۔ اور یہ سب اس صورت میں ہے جب یہ ثابت ہو کہ وہاں حرکت موجود ہے، جیسا کہ بعض نے دعویٰ کیا۔ اور وہ اس بات میں اختلاف نہیں کرتے کہ یہ کائناتیں (الأکوان) اعراض (عارضی صفات) ہیں، خواہ وہ نسبتیں ہوں یا وہ معانی جو ان موصوفہ محال (جگہوں) کے ساتھ قائم ہیں۔ کیونکہ ہمیں کوئی شک نہیں کہ ان پر ایک ایسی حالت طاری ہوئی جو پہلے نہیں تھی، اور یہ محال ہے کہ ان اعراض میں سے کوئی ایک بھی ان کے لیے ذاتی ہو، بلکہ ان کے لیے ذاتی صرف ان کا قبول کرنا ہے۔ اور انہوں نے اس بارے میں اختلاف کیا کہ اس حرکت یا سکون کو کس نے الوجود (ہستی) بخشا، اگر یہ ثابت ہو کہ وہ ایک موجود عین ہے، تو کیا وہ اللہ تعالیٰ ہے یا اللہ کے سوا کوئی اور؟ پس بعض اس رائے کے قائل ہیں اور بعض اس رائے کے قائل ہیں، اور اس میں کانپنے والا اور غیر کانپنے والا برابر ہے۔ اور بعض کا کہنا ہے کہ کائناتوں (الأکوان) کا کوئی الوجود (ہستی) نہیں ہے، بلکہ وہ صرف نسبتیں ہیں، تو وہ کس پر مستند ہوں گی؟ اور ہم اختیاری نسبت کے بارے میں کہتے ہیں کہ اللہ نے بندے کے لیے ایک مشیئت (ارادہ) پیدا کی جس کے ذریعے اس نے اس نسبت کے حکم کا ارادہ کیا۔ اور وہ مشیئت جو اللہ کی مشیئت سے حادث ہوئی ہے، اللہ عزوجل فرماتا ہے: **وَمَا تَشَاءُونَ إِلَّا أَن يَشَاءَ اللَّهُ** (اور تم نہیں چاہتے مگر یہ کہ اللہ چاہے۔) (التکویر: ۲۹)۔ پس اس نے سبحانہ نے مشیئت کو اپنے لیے اور ہمارے لیے ثابت کیا، اور ہماری مشیئت کو اپنی مشیئت پر موقوف کر دیا۔ یہ اختیاری حرکت کے بارے میں ہے۔ اور اضطراری حرکت کے بارے میں، تو ہمارے نزدیک معاملہ ایک ہی ہے۔ پس پہلا سبب الحق (ذات حق) کی مشیئت ہے، اور دوسرا سبب وہ مشیئت ہے جو الحق (ذات حق) کی مشیئت سے الوجود (ہستی) میں آئی۔ البتہ یہاں ایک لطیف نکتہ ہے جو الکشف (کشف) نے عطا کیا ہے اور جس کی طرف حجابِ کون (کائنات کے پردے) کے پیچھے سے اشارہ کیا گیا ہے، اور وہ اس کا قول ہے: **وَمَا تَشَاءُونَ إِلَّا أَن يَشَاءَ اللَّهُ**۔ پس الکشف (کشف) کے ذریعے اللہ ہی المشيء (چاہنے والا) ہے، اگرچہ بندہ اپنے اندر اس کا ارادہ پائے، تو الحق (ذات حق) ہی اس کا عین ارادہ ہے، کوئی اور نہیں۔ جیسا کہ یہ ثابت ہے کہ جب وہ اس سے محبت کرتا ہے تو وہ اس کی سماعت، اس کی بصارت، اس کا ہاتھ اور اس کی تمام قوتیں بن جاتا ہے۔ پس وہ مشیئت جو بندہ اپنے اندر پاتا ہے، اس کا حکم الحق (ذات حق) کے سوا کچھ نہیں۔ پس جب اللہ چاہتا ہے تو جو وہ چاہتا ہے وہ ہو جاتا ہے، پس وہ ہر چاہنے والے کی عین مشیئت ہے۔ جیسا کہ حرکت کو ثابت کرنے والا کہتا ہے کہ زید نے حرکت کی یا اس نے اپنا ہاتھ ہلایا۔ پس اگر تم اس کے قول کی اس کے مذہب کے مطابق تحقیق کرو تو تم پاؤ گے کہ جس چیز نے اس کا ہاتھ ہلایا وہ درحقیقت وہ حرکت ہے جو اس کے ہاتھ کے ساتھ قائم ہے، اگرچہ تم اسے نہیں دیکھتے، لیکن تم اس کا اثر محسوس کرتے ہو۔ اس کے باوجود تم کہتے ہو کہ زید نے اپنا ہاتھ ہلایا۔ اسی طرح تم کہتے ہو کہ زید نے اپنا ہاتھ ہلایا، حالانکہ محرک صرف اللہ تعالیٰ ہے۔\n\n### [عالم میں مطلقاً کوئی سکون نہیں ہے]\n\nاور جان لو کہ عالم میں مطلقاً کوئی سکون نہیں ہے، بلکہ وہ ہمیشہ، ہمیشہ، دنیا و آخرت میں، ظاہر اور باطن میں، ایک حال سے دوسرے حال کی طرف پلٹتا رہتا ہے۔ البتہ وہاں ایک خفی حرکت ہے اور ایک مشہود حرکت ہے۔ پس احوال ان اعیان (ذوات) پر جو انہیں قبول کرنے والی ہیں، آتے جاتے رہتے ہیں۔ اور حرکات عالم میں مختلف اثرات پیدا کرتی ہیں۔ اگر یہ نہ ہوتیں تو مدتیں ختم نہ ہوتیں، اور عدد کا کوئی حکم نہ پایا جاتا، اور چیزیں ایک مقررہ مدت تک نہ چلتیں، اور نہ ہی ایک گھر سے دوسرے گھر کی طرف انتقال ہوتا۔ اور ان احوال کے الوجود (ہستی) کی اصل صفاتِ الٰہیہ ہیں، جیسے ہر رات الحق (ذات حق) کا آسمان دنیا کی طرف نزول، اور اس کا ایک حادث عرش پر استواء، اور اس کا عماء (گہرے بادل) میں ہونا جبکہ کوئی عرش نہ ہو۔ اور یہی وہ چیز ہے جس نے واجب کیا کہ الحق (ذات حق) بندے کی سماعت، اس کی بصارت اور اس کی عین مشیئت ہو۔ پس اسی کے ذریعے وہ سنتا ہے، دیکھتا ہے، حرکت کرتا ہے اور چاہتا ہے۔ پاک ہے وہ ذات جو اپنے ظہور میں پوشیدہ ہے اور اپنے خفا (پوشیدگی) میں ظاہر ہے، اور جس نے اپنے آپ کو اس چیز سے موصوف کیا جس کے بارے میں کہا جاتا ہے کہ وہ صمد ہے، اس کے سوا کوئی معبود نہیں۔ وہ ہمیں **فِي الْأَرْحَامِ كَيْفَ يَشَاءُ** (رحموں میں جس طرح چاہتا ہے صورت دیتا ہے) (آل عمران: ۶)۔ اور وہ رات اور دن کو پلٹتا ہے، اور وہ ہمارے ساتھ ہے جہاں کہیں بھی ہم ہوں، اور وہ ہم سے بھی زیادہ ہمارے قریب ہے۔ پس ہم نے اسے اپنی ذات کے ذریعے کثیر کیا اور اس کے ذریعے اسے واحد جانا۔ پھر اس نے ہم سے مطالبہ کیا کہ ہم اسے \"لا إله إلا الله\" کے ذریعے واحد جانیں، پس ہم نے اس کے حکم سے اسے واحد جانا اور اپنی ذات کے ذریعے اسے کثیر کیا۔\n\nالحق (ذات حق) ہر وقت تمہیں اپنی حکمت ہر وقت نہیں دکھاتا، اور نہ ہی اسے کسی حکم سے خالی رکھتا ہے۔\nپس قلب میں غم سے پیدا ہونے والی خوشی کو دیکھو، جو طبقات سے، الواح سے، قلم سے آئی ہے۔\nاسے ارواح کے رسول لے کر آئے، جو ہمارے باطن پر حضرة الکلم (کلمات کی بارگاہ) سے نازل ہوئے۔\nپس ہر وہ خفی علم جس کا حصول ان عقلوں پر مشکل ہے جنہوں نے قدم (سبقت) حاصل نہیں کی۔\nپس میں اس کے مقام کی محبت اور تعظیم میں کھڑا ہوا، میں سر کے بل چلتا ہوں، قدموں کے بل نہیں۔\n\nاور چونکہ کائناتیں (الأکوان) ان چار احوال کے سوا کچھ نہیں ہیں، تو اب کلام اس بارے میں باقی ہے کہ جب ساکن سکون اختیار کرتا ہے تو کس کے ذریعے؟ اور جب حرکت کرتا ہے تو کس کی طرف؟ اور جب جمع ہوتا ہے تو کس کے ذریعے؟ اور جب جدا ہوتا ہے تو کس سے؟\n\nپس وہاں اللہ کے سوا کچھ نہیں، وہاں اس کے سوا کوئی نہیں، اور وہاں اس کی عین ذات اور اس کا ارادہ ہی ہے۔\n\nپس اس نے اللہ میں سکون اختیار کیا، پس وہی اس کا حیز (جگہ) ہے، کیونکہ وہ اس کے علم میں تھا اور اس کی کوئی عین (ذات) نہیں تھی، پس وہ اس کا ہیولیٰ (مادہ اولیہ) ہے۔ پس اس نے بندے کی صورت میں تصور اختیار کیا، تو اس کے لیے وہ حکم ہوا جو پیدا کیا گیا، اور **وَلَهُ مَا سَكَنَ فِي اللَّيْلِ وَالنَّهَارِ** (اور اسی کا ہے جو رات اور دن میں سکون پذیر ہے) (الانعام: ۱۳)۔ اور یہ محال ہے کہ معاملہ اس کے خلاف ہو۔ پس اسی سے اس نے لباس پہنا اور اسی پر اس کی بنیاد قائم ہوئی اور ثابت ہوئی۔\n\nپس اگر تم نے اس کے سوا کسی کا الشہود (شہود) کیا تو وہ اس کی صورت ہے، اگرچہ آیات اور صورتیں کثیر ہو جائیں۔\nوہ اس کے سوا کسی اور کی نہیں جس کا وہ مقام ہے، لیکن وہ ایسی دیواریں ہیں جن کے سامنے دیواریں جھکتی ہیں۔\n\nپس کائنات میں کوئی معقول حرکت نہیں ہے، جیسا کہ وہاں کوئی مشہود سکون نہیں ہے۔\n\nپس دیکھو کہ ضد کیسے پوشیدہ ہوتی ہے، اور اس کے سوا کوئی چیز ظاہر نہیں ہوتی۔\n\nپس سکون کے عین میں حرکت پر تعجب کرو، کیونکہ خلاء بھر چکا ہے، پس عالم اپنے خلاء میں ساکن ہے۔ اور حرکت صرف خلاء میں ہوتی ہے، یہ اجسام کی حرکت ہے۔ اور خلاء بھرا ہوا ہے، پس وہ زیادتی قبول نہیں کرتا، کیونکہ اس کے لیے کوئی \"کہاں\" نہیں ہے۔ اور جس طرح اس نے اللہ میں سکون اختیار کیا، اسی طرح اللہ کی طرف حرکت کی، جیسا کہ اس نے فرمایا: **وَتُوبُوا إِلَى اللَّهِ جَمِيعًا** (اور تم سب اللہ کی طرف توبہ کرو) (النور: ۳۱)، یعنی اس کی طرف لوٹ آؤ جہاں سے تم نکلے تھے۔ کیونکہ وہ اس کی ربوبیت کا اقرار کرتے ہوئے نکلے، پھر اس میں گھبراہٹ کا شکار ہوئے، تو ان سے کہا گیا کہ اس کی طرف لوٹ آؤ جہاں سے تم نکلے تھے۔ اور اللہ کے سوا کوئی نہیں، اور اس کی طرف رجوع اس کے بغیر نہیں ہو سکتا، کیونکہ وہ سفر میں ساتھی ہے۔ پس اگر وہ لوٹا تو ہم لوٹے، کیونکہ رجوع صرف اسی کے لیے ہوتا ہے جس کا حکم ہو، اور حکم صرف اللہ کا ہے۔ **ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا** (پھر اس نے ان پر توبہ کی تاکہ وہ توبہ کریں) (التوبہ: ۱۱۸)۔\n\nپس یہ ہمارے قول کی سچائی ہے، لہٰذا ہدایت سے منہ نہ موڑو۔\nپس تم جیسے چاہو ہو جاؤ، کیونکہ الحق (ذات حق) گھات میں ہے۔\n\nاور جب تم اس کی طرف حرکت کرتے ہو تو وہ الہادی (ہدایت دینے والا) ہے، یا اس کی طرف سے حرکت کرتے ہو تو وہ اس کے نام المضل (گمراہ کرنے والا) سے ہے۔ پس اس نے تمہیں حیران کیا، پھر تمہیں ہدایت دی، پس اس نے ہدایت کے ذریعے تم پر توبہ کی، تو تم نے توبہ کے ذریعے اس کی طرف حرکت کی، پس گمراہ کرنے والے سے ہدایت دینے والے کی طرف۔ **وَإِنَّ إِلَى رَبِّكَ الرُّجْعَى** (اور بے شک تمہارے رب ہی کی طرف لوٹنا ہے) (العلق: ۸)۔ اور جہاں تک ہمارے قول کا تعلق ہے کہ جب وہ جمع ہوتا ہے تو کس کے ذریعے؟ تو ہم کہتے ہیں کہ وہ اللہ کے ذریعے جمع ہوا، اس کے عین ہونے میں کہ اللہ نے اسے اپنا ولی بنا لیا، اور یہ اس کا اپنے بندے سے یہ کہنا ہے کہ کیا تم نے میری خاطر کسی ولی سے دوستی کی؟ کیونکہ وہ اپنے ولی کے پاس ہوتا ہے۔ پس جس نے اللہ کی خاطر کسی ولی سے دوستی کی، اس نے اللہ سے دوستی کی۔ اور اجتماع اس کے سوا کچھ نہیں جو ہم نے ذکر کیا۔\n\nخبر میں آیا ہے کہ اللہ فرماتا ہے: \"اے میرے بندے، میں بیمار ہوا تو تو نے میری عیادت نہیں کی۔\" وہ کہتا ہے: \"اے رب، میں تیری عیادت کیسے کرتا جبکہ تو رب العالمین ہے؟\" اللہ فرماتا ہے: \"اے میرے بندے، کیا تجھے معلوم نہیں کہ میرا فلاں بندہ بیمار ہوا تو تو نے اس کی عیادت نہیں کی؟ اگر تو اس کی عیادت کرتا تو مجھے اس کے پاس پاتا۔\"\n\nپس بیمار ہمیشہ اللہ کا ذکر کرنے والا ہوتا ہے، اضطرار اور افتقار کا ذکر، اور یہی وہ اصلی ذکر ہے جس پر ممکن (ممکن الوجود) کا الوجود (ہستی) قائم ہے۔ اور الحق (ذات حق) تعالیٰ اپنے ذاکر کا ہم نشین ہوتا ہے۔ پس جس نے اللہ کی خاطر کسی ولی سے دوستی کی، اس نے اللہ سے اجتماع کیا۔ پس اگر تم خود ولی ہو،\n\n### [یہ کہ جب اللہ کسی ولی سے دوستی کرتا ہے تو وہ اس کے ساتھ ہوتا ہے]\n\nتو جان لو کہ اللہ بھی تمہارے ساتھ ہے۔ پس جب تم کسی ولی سے دوستی کرتے ہو اور اللہ اس کے ساتھ ہے، تو اللہ کا اللہ سے اجتماع ہو گیا، پس تم نے اللہ اور اپنی ذات کو جمع کر دیا، تو تمہیں اس اجتماع والے کے مستحق اجر کا ثواب حاصل ہوا۔ پس تم نے اللہ کو اس کے ولی کے دیکھنے سے دیکھا۔ پس اگر وہ ولایت میں تم سے بڑا ہے، تو اللہ اس کے نزدیک اس سے زیادہ عظیم اور بڑا ہے جو تمہارے نزدیک ہے۔ کیونکہ اللہ اپنے اولیاء کے پاس ان کی اس کی المعرفۃ (معرفت) کے مطابق ہوتا ہے۔ پس ان میں سے جو اس سے زیادہ جاہل اور اس میں زیادہ حیران ہوتا ہے، وہی اس کا سب سے بڑا عالم ہوتا ہے۔ اور اگر تمہیں ولی اللہ کی ولایت کے ذریعے اس خاص ولی کے ساتھ اللہ کی نسبت حاصل نہ ہو، یہاں تک کہ تم اس کی نسبت سبحانہ تمہاری طرف اور اس کی نسبت تعالیٰ اس ولی کی طرف میں فرق نہ کر سکو، تو تم نے اس سے مکمل طور پر دوستی نہیں کی۔ پس الحق (ذات حق) اس ولی کی زبان پر تم سے ایسی بات کرے گا جو سنی جائے گی، تاکہ تمہیں ایسا علم دے جو تمہارے پاس نہیں تھا، یا تمہیں یاد دہانی کرائے۔ اور تم اس سے سنو گے، اگر تم ولی ہو اور اپنی ولایت کا الشہود (شہود) کرتے ہو، تو تم الحق (ذات حق) کے ذریعے سنو گے، کیونکہ وہ تمہاری سماعت ہے، جو الحق (ذات حق) اس ولی کی زبان پر بولتا ہے۔ پس معاملہ ایسا ہو گا جیسے کوئی شخص خود سے بات کر رہا ہو، تو بات کرنے والا عین سننے والا ہو گا۔ اور یہ ایک ذوق ہے جسے ہر کوئی اپنی ذات میں پاتا ہے، اور اسے صرف وہی جانتا ہے جس نے معاملے کا الشہود (شہود) ویسا ہی کیا جیسا کہ وہ ہے۔ اور جہاں تک ہمارے قول کا تعلق ہے کہ افتراق کس سے؟ تو یہ خبر کا تتمہ ہے، اور وہ اس کا قول ہے: \"یا تو نے میری خاطر کسی دشمن سے دشمنی کی؟\" پس جس سے تم نے دشمنی کی، تم نے اسے چھوڑ دیا۔ کیونکہ الہادی (ہدایت دینے والا) المضل (گمراہ کرنے والے) سے جدا ہوتا ہے، اور الضار (نقصان پہنچانے والا) النافع (نفع دینے والے) سے جدا ہوتا ہے۔ پس جس نے اسماء الٰہیہ کو مضبوطی سے تھام لیا، اس کے لیے اللہ کے علم میں ایک عظیم دروازہ کھل گیا جو کسی چیز کے لیے تنگ نہیں ہوتا۔\n\nپس اگر تم وہ جان لیتے جو میں کہتا ہوں، تو تم اس کے سوا نہ ہوتے جو وہ کہتا ہے۔\nتم میرے جیسے نہیں ہو، بلکہ تم میری عین ذات ہو، پس نہ کوئی کہنے والا ہے اور نہ کوئی کہا جانے والا۔\nہم اس چیز میں حیران ہو گئے جس کا ہم نے ارادہ کیا، اس میں جو عقلیں ہمارے پاس لائیں۔\n\nپس محقق جب اس چیز پر غور کرتا ہے جس کا صاحب الکشف (کشف والا) الشہود (شہود) کرتا ہے، تو بسا اوقات وہ مطلوبہ الحق (ذات حق) کو پا لیتا ہے، کیونکہ وہ دو آنکھوں والے کے لیے انتہائی وضاحت اور ظہور میں ہے۔\n\nپس حال عقلوں اور نہی (دانش) سے ایسے کھیلتا ہے جیسے اسماء کائناتوں (الأکوان) سے کھیلتے ہیں۔\n\nپس عداوت اور دشمنی وہیں سے کائنات میں ظاہر ہوئی۔ پس مشاہدہ کیا جانے والا عالم اپنی عین ذات میں اضداد کے قیام کی وجہ سے حال میں تبدیل نہیں ہوتا، کیونکہ وہ سب الحق (ذات حق) ہے۔ پس اگر تم نے وہ سمجھ لیا جس کی طرف ہم نے اشارہ کیا، تو تم جان لو گے کہ کیسے دوستی کرنی ہے اور کیسے دشمنی، اور تم کس سے دشمنی کرتے ہو اور کون دشمنی کرتا ہے، اور کس نے دوستی کی اور کون دوستی کرتا ہے۔ پس پاک ہے وہ ذات جس نے تمہیں تم سے پیدا کیا، اور تمہیں تمہارا الشہود (شہود) کرایا، اور تم پر تمہارے ذریعے احسان کیا۔ پس **من عرف نفسه عرف ربه** (جس نے اپنے نفس کو پہچانا اس نے اپنے رب کو پہچانا)۔ پس اس نے کسی چیز کو اس (اللہ) کے سوا کسی کی طرف منسوب نہیں کیا، اور **وَاللَّهُ غَنِيٌّ عَنِ الْعَالَمِينَ** (اور اللہ تمام جہانوں سے بے نیاز ہے) (آل عمران: ۹۷)۔\n\n### [یہ کہ اللہ نے الوہیت کو خواہش نفس کی طرف منسوب کیا]\n\nاور جان لو کہ جب اللہ نے الوہیت کو خواہش نفس (الہویٰ) کی طرف منسوب کیا اور اسے اپنے مقابل قرار دیا، تو اپنے نبی داؤد علیہ السلام سے فرمایا: **فَاحْكُم بَيْنَ النَّاسِ بِالْحَقِّ وَلَا تَتَّبِعِ الْهَوَى** (پس لوگوں کے درمیان حق کے ساتھ فیصلہ کرو اور خواہش نفس کی پیروی نہ کرو) (ص: ۲۶)۔ اور فرمایا: **أَفَرَأَيْتَ مَنِ اتَّخَذَ إِلَٰهَهُ هَوَاهُ** (کیا تم نے اس شخص کو دیکھا جس نے اپنی خواہش نفس کو اپنا معبود بنا لیا؟) (الجاثیہ: ۲۳)۔ اور خواہش نفس (الہویٰ) بندے کے ارادے کے سوا کچھ نہیں ہے جب وہ اس مشروع میزان کی مخالفت کرتا ہے جو اللہ نے اس کے لیے دنیا میں مقرر کیا ہے۔ اور اس کا قول **وَمَا تَشَاءُونَ إِلَّا أَن يَشَاءَ اللَّهُ** (اور تم نہیں چاہتے مگر یہ کہ اللہ چاہے) (التکویر: ۲۹) مقرر ہو چکا ہے۔ پس تم نے جان لیا کہ جس نے اپنی خواہش نفس سے حکم کیا، اس نے کس کے ذریعے حکم کیا۔ اور اسی لیے اس نے فرمایا: **وَأَضَلَّهُ اللَّهُ عَلَىٰ عِلْمٍ** (اور اللہ نے اسے علم کے باوجود گمراہ کر دیا) (الجاثیہ: ۲۳)، یعنی اسے حیران کر دیا۔ کیونکہ اللہ کا علم اس کے لیے اللہ میں حیرت کا سبب بنا، کیونکہ اللہ کے سوا کوئی حاکم نہیں۔\n\nپس زمین نے اپنا زلزال (زلزلہ) برپا کیا، اور ہم سے کہا: \"اسے کیا ہوا، اسے کیا ہوا؟\"\nپس اگر آنکھیں دیکھتیں تو وہ اپنے رب کی طرف دیکھتیں جب اس نے اسے وحی کی۔\nاور زمین اپنی خبریں بیان کرتی، جیسا کہ اس نے تمہارے لیے اپنے بوجھ نکالے۔\n\nپس جس نے اس مشہد (منظر) کا الشہود (شہود) نہیں کیا، اس نے الوجود (ہستی) میں اللہ کی عظمت کا الشہود (شہود) نہیں کیا، اور اس سے بہت سا علم فوت ہو گیا جو اس مشہود (منظر) سے فوت ہوتا ہے۔\n\n### [یہ کہ معاملہ چار حقائق میں محدود تھا]\n\nاور جان لو کہ جب معاملہ چار حقائق: الْأَوَّلُ (اول)، الْآخِرُ (آخر)، الظَّاهِرُ (ظاہر) اور الْبَاطِنُ (باطن) میں محدود تھا، اور علم کی نشأت تربيع (چوکور پن) پر قائم ہوئی، تو اللہ تعالیٰ کے راستے میں کوئی صاحب تمکین (مضبوطی والا) نہیں ہو سکتا مگر وہ جو اپنی ذات اور اپنے افعال میں تربيع کا الشہود (شہود) کرے۔ پس اس نے فرائض کو قائم کیا، اور یہ پہلی اقامت ہے، اور نوافل کو قائم کیا، اور یہ دوسری اقامت ہے، اپنے ظاہر میں اور اپنے باطن میں۔ پس جب اس نے ظاہر اور باطن میں اس کا حکم کیا، تو اللہ کا حکم اس کی نشأت پر عام ہو گیا۔ پس جب اس نے ذوقاً اس کا الشہود (شہود) کیا، تو اس نے جان لیا کہ یہ امر اس کے لیے کیا ثمر لائے گا۔ پس اس کے ظاہر میں چھ جہات ہیں، اور چھ میں کمال ہے، کیونکہ یہ پہلا کامل عدد ہے، اس لیے کہ اگر اس کا چھٹا حصہ اس کے تہائی اور اس کے نصف میں شامل کیا جائے تو وہ کل کے برابر ہو جاتا ہے۔ اور قلب کے لیے چھ چہرے ہیں، ہر جہت کے لیے قلب کا ایک چہرہ ہے جو عین وہ جہت ہے۔ اس عین کے ذریعے وہ الحق (ذات حق) کو پاتا ہے جب وہ اس پر اسم الظاہر (ظاہر نام) میں التجلی (ظہور الٰہی) کرتا ہے۔ پس اگر التجلی (ظہور الٰہی) تمام جہات کو عام ہو جائے، اس کے ہر چیز پر محیط ہونے کی وجہ سے، تو قلب اپنے چہروں کے ذریعے اس الحق (ذات حق) کو عام کر دیتا ہے جو اسے ہر جہت میں ظاہر ہوتا ہے، پس وہ سارا نور بن جاتا ہے۔ اور وہاں بندہ کہتا ہے: \"میں نے کیا، اے رب!\" اور وہ اس سے مخاطب ہوتا ہے اور کہتا ہے: \"تو\"، جیسا کہ نیک بندے نے کہا: **كُنتَ أَنتَ الرَّقِيبَ عَلَيْهِمْ** (تو ہی ان پر نگہبان تھا) (المائدہ: ۱۱۷)۔ پس ضمیر ظاہر ہوئی، باوجود اس کے کہ وہ ضمیر ہے، اور مضمر (پوشیدہ) ظاہر کے مخالف ہوتا ہے، لیکن وہ اپنے ظہور کی حالت میں مضمر ہونے کے باوجود ظاہر ہوا۔ پس وہ الحق (ذات حق) کے بارے میں کہتا ہے کہ وہ اپنے بطون (پوشیدگی) کی حالت میں الظاہر (ظاہر) ہے، اور اپنے ظہور کی حالت میں الباطن (باطن) ہے، ایک ہی پہلو سے۔ کیونکہ لفظ \"أنت\" (تو) ضمیر مخاطب ہے اور تمہاری عین ذات کے سوا کچھ نہیں، اور تم خطاب کے ذریعے مشہود ہو۔ پس تم الظاہر (ظاہر) مضمر ہو، اسم کے برعکس۔ پس مضمرات کے اسماء اسماء سے زیادہ قوت والے اور اللہ کے علم میں زیادہ مضبوط ہیں۔ اور بعض عارفین سے حکایت کی گئی ہے، اور میں نے اسے ابویزید بسطامی سے منقول دیکھا ہے کہ انہوں نے الحق (ذات حق) کے ساتھ اپنے بعض مشاہدات میں، احوال میں سے ایک حال میں کہا: \"میری انانیت تیری انانیت ہے،\" یعنی جس طرح مضمر اسم پر اس کی حقیقت کے ساتھ اطلاق ہوتا ہے، اسی طرح تم پر بھی اس چیز کا اطلاق ہوتا ہے جو ظاہر اسم کی طرح ہے، نہ کہ ظاہر وصف کی طرح۔ اور یہ عین وہی ہے جو ہم نے مضمرات کی قوت کے بارے میں کہا ہے۔ اور جب کائنات میں تشبیہ اور صورتوں میں اشتراک واقع ہوا، اس طرح کہ دو اشخاص میں سے ایک غائب ہو جائے اور دوسرا حاضر ہو، تو دیکھنے والا حاضر کو عین غائب سمجھ لیتا ہے، تو اللہ نے اس التباس کو دور کرنے اور اس کے درمیان فرق کرنے کے لیے جو وہ ہے اور جو اس کی صورت میں ظاہر ہوتا ہے، عالم میں خبروں اور ضمائر میں اشارات رکھے۔ اور انہوں نے اس پر بھروسہ کیا۔ اور جب اللہ تعالیٰ نے خبر دی کہ انسان صورت پر پیدا کیا گیا ہے، تو عیسیٰ علیہ السلام نے کہا: **كُنتَ أَنتَ الرَّقِيبَ عَلَيْهِمْ**۔ پس اس نے الحق (ذات حق) اور اس کے درمیان جو صورت پر ہے، فرق کر دیا۔ گویا اس نے کہا: \"تو اپنی عین ذات کے لحاظ سے ان پر نگہبان تھا، نہ کہ وہ جو تیری صورت پر ہے۔\" پس \"أنت\" (تو) نے اس مقام پر مقصود عین کی جگہ لے لی۔ اور ہمارے پاس ان اسماء مضمرات کے بارے میں ایک جزء ہے جسے ہم نے \"کتاب الہو\" (کتاب وہ) کا نام دیا ہے، اور یہ ایک عمدہ جزء ہے جس میں ہم نے ان مضمر اسماء کے بارے میں مبالغہ کیا ہے، اور وہ اپنی تمکین اور مقام کی بلندی کی وجہ سے ہر قدیم اور جدید صورت کو قبول کرتے ہیں۔ اور عالم اگرچہ کثیر ہے، لیکن وہ ایک ہی عین کی طرف لوٹتا ہے۔\n\nپس الوجود (ہستی) میں ہر کوئی الحق (ذات حق) ہے، اور الشہود (شہود) میں ہر کوئی خلق (مخلوق) ہے۔\nپس اس حکمت کو دیکھو جو ظاہر ہوئی، ایک الحق (ذات حق) کی عین ذات میں جسے الحق (ذات حق) نے گھیر رکھا ہے۔\nپس بندہ محق (حق پر) ہے اور الحق (ذات حق) محق (حق والا) ہے، پس نہ کوئی حق ہے اور نہ کوئی محق۔\n\nپس اے ولی! اپنا وقت حرکتوں پر غور کرنے اور ان کی تحقیق میں ضائع نہ کرو، کیونکہ وقت قیمتی ہے۔ اور اس چیز کو دیکھو جو نتیجہ خیز ہو، پس اس پر بھروسہ کرو جو وہ تمہیں اپنی حقیقت سے عطا کرے۔ کیونکہ اگر تم نافذ البصیرت ہو، تو تم عین نتیجے سے عین حرکت اور محرک کو جان لو گے۔ کیونکہ حرکت عین کی حقیقت ہے، اور محرک حجابِ کون (کائنات کے پردے) کے پیچھے سے ہے، جبکہ نتیجہ ظاہر، بے پردہ اور اپنے شأن کو بیان کرنے والا ہے۔ پس اس پر بھروسہ کرو۔ پس اے ولی! یہ میری تمہیں نصیحت ہے۔ اور اسی لیے الحق (ذات حق) نے جب بھی اپنی طرف کسی انتقال کو منسوب کیا تو نتیجہ ضرور ذکر کیا، تاکہ تمہیں معلوم ہو جائے کہ اس سے منسوب انتقال کی عین ذات کیا ہے، جیسے اس کا قول: \"ہمارا رب ہر رات کے آخری تہائی حصے میں آسمان دنیا کی طرف نزول فرماتا ہے،\" پھر اس نے نتیجہ ذکر کیا اور فرمایا: \"پس وہ کہتا ہے: کیا کوئی توبہ کرنے والا ہے؟ کیا کوئی دعا کرنے والا ہے؟ کیا کوئی مغفرت طلب کرنے والا ہے؟\" اور اس نے ایسی بہت سی باتیں فرمائیں تاکہ اپنے بندوں کو فکر اور عذر خواہی کی مشقت سے راحت دے۔ کیونکہ حرکتوں کا مقصود وہ ہے جو وہ نتیجہ دیتی ہیں، نہ کہ ان کی عین ذاتیں۔ اور اسی طرح ہر چیز ہے۔ پس اگر مبتدا (شروع کرنے والا) خبر کے بغیر ہو تو اس کا کوئی فائدہ نہیں، اور اسے لانا عبث ہو گا۔ اور یہیں سے اس کا قول معلوم ہوتا ہے: **أَفَحَسِبْتُمْ أَنَّمَا خَلَقْنَاكُمْ عَبَثًا** (کیا تم نے یہ گمان کیا تھا کہ ہم نے تمہیں بے کار پیدا کیا ہے؟) (المؤمنون: ۱۱۵)۔ اور اس کا قول: **وَمَا خَلَقْنَا السَّمَاءَ وَالْأَرْضَ وَمَا بَيْنَهُمَا بَاطِلًا** (اور ہم نے آسمان اور زمین اور جو کچھ ان کے درمیان ہے، باطل پیدا نہیں کیا) (ص: ۲۷)۔ اور یہیں سے اس حکمت کی المعرفۃ (معرفت) پر تنبیہ ہوتی ہے جس کے لیے اللہ نے عالم کو الوجود (ہستی) بخشا، اور یہ کہ اس کا نام الحق (ذات حق) تعالیٰ حق ہے۔ اور اس کے قول **فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ** (پس بے شک اللہ جہانوں سے بے نیاز ہے) (آل عمران: ۹۷) کا مطلب یہ ہے کہ وہ اس کے الوجود (ہستی) سے بے نیاز ہے، نہ کہ اس کے ثبوت سے۔ کیونکہ عالم اپنی ثبوت کی حالت میں اس کے الوجود (ہستی) سے بے نیازی اور اکتفاء کا سبب بنتا ہے، کیونکہ وہ اپنے امکان کے ذریعے الوہیت کا حق ادا کرتا ہے۔ اور اگر ممکنات کا مطالبہ اور ان کا احوال کا ذوق حاصل کرنے کا افتقار نہ ہوتا، اور وہ یہ نہ چاہتیں کہ وہ الوجود (ہستی) کے حال کا ذوق حاصل کریں جیسا کہ انہوں نے عدم کے حال کا ذوق حاصل کیا تھا، تو وہ اپنی ثبوت کی زبان سے واجب الوجود سے یہ سوال نہ کرتیں کہ وہ ان کی اعیان (ذوات) کو الوجود (ہستی) بخشے تاکہ علم ان کے لیے ذوق بن جائے۔ پس اس نے انہیں ان کے لیے الوجود (ہستی) بخشا، نہ کہ اپنے لیے۔ پس وہ ان کے الوجود (ہستی) سے بے نیاز ہے، اور اس سے بھی کہ ان کا الوجود (ہستی) اس پر دلیل یا اس کے ثبوت کی علامت ہو۔ بلکہ اس پر دلالت کرنے میں ان کا عدم ان کے الوجود (ہستی) کی طرح ہے۔ پس عدم یا الوجود (ہستی) میں سے جو بھی ترجیح پائے، اس سے اللہ کے علم کا مقصود حاصل ہو جاتا ہے۔ اسی لیے ہم نے جانا کہ اس کا سبحانہ کا عالم سے بے نیاز ہونا عین اس کے عالم کے الوجود (ہستی) سے بے نیاز ہونا ہے۔ اور یہ ایک عجیب مسئلہ ہے کہ ممکن ازل میں عدم سے متصف ہے، اور ازل ترجیح کو قبول نہیں کرتا، تو ممکن کے عدم نے اپنی ازلیت کے باوجود اسے کیسے قبول کیا؟ اور یہ اس طرح ہے کہ چونکہ وہ اپنی ذات کے لحاظ سے ممکن ہے، اس لیے اس کے حق میں دونوں حکموں کا قبول کرنا برابر ہے، کہ اس کے لیے عدم کا حال فرض کیا جائے یا الوجود (ہستی) کا حال فرض کیا جائے۔ پس جس میں اس کے لیے فرض کی حالت میں حکم ہو، وہی مرجح (ترجیح دیا گیا) ہے۔ پس ترجیح ازل میں ممکن پر اس کے عدم کی حالت میں بھی لاگو ہوتی ہے، اور وہ عدم مرجح سے موصوف ہے۔ اور مرجح (ترجیح دینے والا) جو کہ اسم فاعل ہے، کی طرف سے ترجیح اس کے لیے قصد کے بغیر نہیں ہو سکتی۔ اور قصد ایک معنوی حرکت ہے جس کا حکم ہر ایک میں اس کی حقیقت کے مطابق ظاہر ہوتا ہے۔ پس اگر وہ محسوس ہو تو ایک حیز کو خالی کرتا ہے اور دوسرے حیز کو بھرتا ہے، اور اگر وہ معقول ہو تو ایک معنی کو زائل کرتا ہے اور دوسرے معنی کو ثابت کرتا ہے، اور ایک حال سے دوسرے حال کی طرف منتقل کرتا ہے۔\n\nاور اس میں مقید دعا اور مطلق دعا کا علم ہے، اور یہ کہ ہر مدعو (جسے پکارا جائے) سے کیا کہنا چاہیے اور اس کے ساتھ کیسا معاملہ کرنا چاہیے۔ اور ان میں سے حرکتوں، ان کے اسباب اور ان کے نتائج کا علم ہے۔ اور ان میں سے اس شخص کے مقام کا علم ہے جو ایسی بات کرتا ہے جسے وہ نہیں جانتا لیکن خیال کرتا ہے کہ وہ جانتا ہے، کہ کیا جو اس نے کہا وہ نفس الامر میں علم ہے یا علم نہیں ہے، یا یہ محال ہے کہ وہ علم نہ ہو لیکن یہ متکلم اسے نہیں جانتا؟ اور کیا ایسی چیز عالم میں ظاہر ہوئی ہے، اور کیا یہ اللہ کی تخلیق ہے تاکہ مراتب میں تمیز ہو، اور اس کے ذریعے جہل کا مرتبہ علم سے اور جاہل کا عالم سے معلوم ہو، یا وہاں صرف علم ہی ہے؟ اور ان میں سے اس شخص کے تعین کا علم ہے جس کے ہاتھوں اللہ نے عالم میں حیرت پیدا کی، اور کیا حیرت مطلقاً سعادت دیتی ہے یا شقاوت، یا اس میں تفصیل ہے کہ بعض سعادت دیتی ہیں اور بعض شقاوت؟ اور کیا جس میں حیرت ہے، اس کا متحیر ہونا اس کی ذات کے لیے اسم مفعول ہے، یا یہ ممکن ہے کہ اس میں حیرت نہ ہو؟ اور اس میں اس جلن کے سبب کا علم ہے جو صاحبِ حیرت اپنے باطن میں اپنی حیرت کی حالت میں پاتا ہے۔ اور کیا اگر حیران شخص یہ جان لے کہ جس چیز میں وہ حیران ہے، اس کا علم عین حیرت کے سوا نہیں ہو سکتا، تو اس سے جلن کا درد دور ہو جائے گا؟ اور ان میں سے دلائل قائم کرنے کا علم ہے کہ اللہ نے انہیں عقل مندوں، اصحابِ نظر اور بصیرت والوں کے لیے کیسے ترتیب دیا۔ اور ان میں سے ایک عجیب علم ہے، کہ کیا علوم کو قبول کرنے والے پر کوئی ایسا وقت گزر سکتا ہے جس میں وہ کوئی علم حاصل نہ کرے یا نہیں؟ اور ان میں سے رتبہ الٰہیہ کا علم ہے، کہ کیا وہ اللہ سے حجاب بنتا ہے یا اللہ کی طرف دلالت کرتا ہے، اور اس کی صفت کیا ہے جو اسے حجاب بناتا ہے، اور اس کی صفت کیا ہے جو اس کے خالق پر دلالت کرتا ہے؟ اور ان میں سے اس بات کا علم ہے کہ اللہ نے کبھی بھی ایک کو الوجود (ہستی) نہیں بخشا اور نہ ہی یہ صحیح ہے، بلکہ اس نے دو یا زیادہ کو ایک ساتھ الوجود (ہستی) بخشا، بغیر الوجود (ہستی) میں تقدم یا تاخر کے۔ اور ان میں سے اس بات کا علم ہے کہ الحق (ذات حق) کے لیے احدیت صرف اس کی الوہیت میں ثابت ہوتی ہے، اور جہاں تک اس کے الوجود (ہستی) کا تعلق ہے، تو دو یا زیادہ معقولات کا ہونا ضروری ہے، پس تم اسے جو چاہو بنا لو، خواہ نسبتیں یا صفات، بشرطیکہ تم احدیت کا تصور نہ کرو۔ اور ان میں سے اسماء الٰہیہ کا کائنات سے تعلق کا علم ہے۔ اور ان میں سے آخرت کی کوشش کا علم ہے کہ وہ کیسے آئے گی، اور کہاں سے آئی، اور یہ حرکت کیا ہے جو اس کی طرف منسوب کی جاتی ہے۔ اور ان میں سے دنیا اور آخرت کے معقول کا علم ہے کہ وہ کیا ہے۔ اور ان میں سے اس شخص کی جہالت کا علم ہے جس نے اللہ سے اعراض کیا، حالانکہ **فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ** (پس تم جدھر بھی رخ کرو گے، وہیں اللہ کا چہرہ ہے) (البقرہ: ۱۱۵)۔ پس وہ کیسے بدبخت ہو سکتا ہے جس نے اللہ کے چہرے کی طرف رخ کیا، اگرچہ اس نے اللہ کے چہرے کی طرف رخ کرنے کا قصد نہ کیا ہو، اور وہ نفس الامر میں اللہ کے چہرے کی طرف رخ کرنے والا ہے، اللہ کے چہرے سے اعراض کرنے والا ہے۔ اور انسان پر ہر پہلو سے اللہ کی طرف رخ کرنا کب صادق آتا ہے؟ اور یہ تب ہوتا ہے جب انسان سارا چہرہ اور ساری عین ذات ہو، تو اس صفت والے کے حق میں اللہ سے اعراض کرنا صحیح نہیں ہے۔ اور ان میں سے ایک عجیب علم ہے، کہ انسان کی طرف صرف وہی لوٹتا ہے جو اس سے نکلا ہے، اس اصل کی بنا پر جو اس کی تائید کرتی ہے، اور وہ اس کا قول ہے: **وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ** (اور اسی کی طرف تمام معاملات لوٹائے جاتے ہیں) (ہود: ۱۲۳)۔ اور اسی سے تمام معاملہ شروع ہوا اور اسی کی طرف لوٹتا ہے۔ اور یہ اس کے قول صلی اللہ علیہ وسلم کا معنی ہے: **إنما هي أعمالكم ترد عليكم** (یہ تمہارے اعمال ہی ہیں جو تم پر لوٹائے جاتے ہیں)۔ پس کوشش کرو کہ تم سے صرف وہی نکلے جس کا تمہاری طرف لوٹنا قابل تعریف ہو۔ اور ان میں سے اس شخص کا علم ہے جو اللہ کے ساتھ آخری قدم پر ہو، وہ کیا کرے گا، اور یہ صرف حضرۃ التکلیف (تکلیف کی بارگاہ) میں ہی ہو سکتا ہے، کیونکہ اجر صرف اسی میں ہے۔ پس اس علم کی تلاش کرو۔ اور ان میں سے نفع اور نقصان کا علم ہے، اور کس چیز میں نفع اور نقصان واقع ہوتا ہے۔ اور کیا انسان کے لیے کوئی ایسا مقام ہے جو نہ دنیا ہو اور نہ آخرت؟ اور آخرت سے میری مراد وہ دار آخرت ہے جو شرائع اللہ کی طرف سے لائی ہیں۔ اور ان میں سے اس علم کا علم ہے کہ جو دنیا میں حال کے ذریعے تقسیم ہوا، وہ آخرت میں دار کے ذریعے تقسیم ہو گا۔ پس آخرت میں دو منزلیں ہیں: جنت اور جہنم، اور دنیا میں دو منزلیں ہیں: عذاب اور نعمت، یا درد اور لذت۔ پس اگر انسان ایسی حالت میں ہو جس کے بارے میں کہا جائے کہ اس کی کوئی صفت نہیں، جیسا کہ ابویزید کا دعویٰ ہے، تو کیا اس دعوے کا مالک وہ ہے جس کے لیے وہ موطن ہے جو نہ دنیا ہے اور نہ آخرت؟ اور ان میں سے اس شخص کے حال کا علم ہے جو اہم سے اہم کو چھوڑ دیتا ہے۔ اور اس میں عارضی امور کا علم ہے کہ عالم میں ان کا کیا اثر ہے۔ اور ان میں سے خزانۂ رزق کا علم ہے، اور بعض صالحین کا قول ہے جب ایک شخص نے ان سے کثرت عیال کی شکایت کی، تو انہوں نے اس سے کہا: \"اپنے گھر میں داخل ہو اور دیکھو کہ جس کا رزق اللہ پر نہیں ہے، اسے نکال دو۔\" تو اس نے کہا: \"ان سب کا رزق اللہ پر ہے۔\" تو انہوں نے کہا: \"تو پھر ان کی کثرت یا قلت تمہیں کیا نقصان پہنچاتی ہے؟\" اور ان میں سے الشہود (شہود) کے ذریعے فصل اور حکم کے ذریعے الکشف (کشف) کا علم ہے۔ اور اس میں ارادہ، مشیئت، ہمت، عزم، قصد اور نیت کے درمیان فرق کا علم ہے۔ اور اس میں نائب کے لیے اس شخص کی صفات کا علم ہے جس نے اسے نائب بنایا، کہ کیا وہ ان سب کو قائم کرتا ہے یا صرف اس چیز کو جس کے لیے اسے نائب بنایا گیا ہے؟ اور ان میں سے قول کے مراتب کا علم ہے، اور برائی کو اچھائی اور پاکیزگی سے کس چیز کے ذریعے منسوب کیا جاتا ہے۔ اور ان میں سے تنزیہ اور اثبات کے طریقے سے اللہ کی ثناء تک پہنچنے والے راستوں کا علم ہے۔ اور ان میں سے اس چیز کا علم ہے جس سے دنیا میں بدبختوں اور نیک بختوں کے درمیان برابری واقع ہوتی ہے۔ اور ان میں سے کائناتوں (الأکوان) کی طرف میلان اور الحق (ذات حق) کی طرف میلان کا علم ہے، اور ان میں سے کیا قابل تعریف ہے اور کیا قابل مذمت۔ اور ان میں سے اس نشأت کو قائم کرنے کا علم ہے جسے الحق (ذات حق) نے اپنی طرف منسوب کیا ہے، جو صرف اس کے بندوں کے ہاتھوں ہی قائم ہوتی ہے۔ اور ان میں سے الکور (لپیٹنا)، الحور (لوٹنا)، اللازم (لازم)، القائم (قائم)، الخاضع (جھکنے والا) اور النازل (نازل ہونے والا) کا علم ہے۔ اور ان میں سے ان امور میں الحق (ذات حق) کی طرف قصد کے تکرار کی اطلاع کا علم ہے جن کی طرف الحق (ذات حق) نے اپنے بندوں کو عبادات میں بلایا ہے۔ اور ان میں سے قریب اور دور کے راستوں کا علم ہے، اور ان میں چلنے والوں کا، اور ان آثار کا حساب جو ان میں چلنے پر مرتب ہوتے ہیں، خواہ وہ مشروع ہوں یا غیر مشروع، لیکن عقل سلیم اور صحیح نظر کا تقاضا کرتے ہوں، اور اس میں الٰہی قربتوں کا تعین بغیر توقیف کے، اور جو اس میں صحیح ہے اور جو صحیح نہیں ہے۔ اور ان میں سے اللہ کی ان نعمتوں پر حمد کا علم ہے جو انسان کے قریب اور مناسب ہیں۔ اور ان میں سے ہر موجود کے لیے عالم میں موجود منافع کا علم ہے۔ اور ان میں سے عالم میں رکاوٹوں کا علم ہے، اور جو چیزیں عقلی اور شرعی طور پر رکاوٹ بنتی ہیں۔ اور ان میں سے معدوم کا موجود کی صورت میں ظاہر ہونے کا علم ہے، اور الوجود (ہستی) میں حقیقی الوجود (ہستی) سے اس کی تمیز کا علم ہے۔ اور ان میں سے فرقوں اور ملتوں کا علم ہے۔ اور ان میں سے اس چیز کا علم ہے جس سے فائدہ نہیں اٹھایا جاتا مگر اس کے اس حصے کو ہٹانے کے بعد جس سے فائدہ اٹھایا جاتا ہے۔ اور ان میں سے سائلین کے احوال کا علم ہے، اور ہر سائل کے لیے مناسب جواب کا علم ہے۔ اور ان میں سے اس چیز کا علم ہے جسے الحق (ذات حق) اپنے بندوں کے اعمال میں سے قبول کرتا ہے اور جسے قبول نہیں کرتا، باوجود اس کے کہ وہ حرام یا مذموم نہیں ہے۔ اور ان میں سے عظمت الٰہیہ اور کبریاء کے درمیان فرق کا علم ہے۔ اور ان میں سے الإحسان (احسان) اور اس کی ماہیت کی المعرفۃ (معرفت) کا علم ہے۔ اور ان میں سے اس شخص کی صفت کا علم ہے جو الحق (ذات حق) کی طرف سے اس چیز کو دور کرنے میں نائب ہوتا ہے جو اسے ناگوار گزرتی ہے، باوجود اس کے کہ وہ ناگوار چیز موجود ہو۔ اور ان میں سے بالمثل معارضہ کا علم ہے۔ اور ان میں سے اسماء الحسنیٰ کے نتائج کا علم ہے۔ اور ان میں سے عمارت اور خرابی کا علم ہے، اور دنیا و آخرت میں ان کا حکم۔ اور ان میں سے الحق (ذات حق) سے رجوع کرنے کا علم ہے کہ وہ رجوع کرنے والے پر کیا اثر ڈالتا ہے۔ اور ان میں سے ایک کو کثیر کے ساتھ تقدیر کرنے کا علم ہے، جیسا کہ بعض نے کہا:\n\nاور اللہ پر یہ کوئی انوکھی بات نہیں کہ وہ عالم کو ایک میں جمع کر دے۔\n\nاور ان میں سے حدیث میں تخالج (اختلاف) کی تقدیر کا علم ہے، اور اس میں سے کیا رفع کیا جاتا ہے اور کیا رفع نہیں کیا جاتا۔ اور ان میں سے فتنوں کا دلوں پر پیش کیا جانا، اور اس شخص کا حکم جو ان سے مانوس ہو جائے، اور اس کے علاوہ کا حکم۔ اور ان میں سے اس سبب کا علم ہے جو شک کرنے والے کو اس کے شک پر باقی رکھتا ہے، باوجود اس کے کہ وہ شک سے نکالنے والی نظر کی قدرت رکھتا ہے، لیکن اس نے ایسا نہیں کیا۔ اور ان میں سے ایمان اور علم کے درمیان فرق کا علم ہے، اور عالم اور مومن کے درمیان مراتب کا علم ہے۔ اور ان میں سے الحق (ذات حق) کا اپنے ان بندوں کی رضاؤں کی پیروی کا علم ہے جنہوں نے اس کی رضاؤں کی پیروی کی، یہ ایک موافق جزا کے طور پر ہے۔ اور ان میں سے بیان کو مؤخر کرنے کا علم ہے، باوجود اس کے کہ اسے جلدی واضح کرنے کی قدرت ہو، ایک ایسے امر کے لیے جسے عالم دیکھتا ہے، جبکہ اس کی ضرورت بھی ہو۔ اور ان میں سے اس شخص کی صفت کا علم ہے جسے عفو الٰہی طلب کرتا ہے۔ اور ان میں سے اس علم کا علم ہے کہ علوم میں سے کیا ظاہر کرنا چاہیے اور کیا چھپانا چاہیے۔ اور ان میں سے عالم الغیب (عالم غیب) کا الشہادة (شہود) میں اور عالم الشہادة (عالم شہادت) کا الغیب (غیب) میں داخل ہونے کا علم ہے۔ اور ان میں سے استدراج اور مکر کا علم ہے۔ اور ان میں سے ہر اس علم کا علم ہے جس کی غایت عمل ہو، لیکن اس کی غایت ظاہر نہ ہو، تو اس کی کیا وجہ ہے؟ اور ان میں سے اس بات کا علم ہے کہ آسمان خیمے کی طرح ہے نہ کہ کھوکھلے گولے کی طرح، اور یہ کہ آسمانوں کی ہیئت اس کے خلاف ہے جو علم ہیئت کے ماہرین نے ذکر کیا ہے۔ اور ستارے کیوں پلٹتے ہیں، کیا اپنی ذات کی وجہ سے یا اپنے گرد گھومنے والے فلک کی وجہ سے؟ اور اس میں اس چیز کا علم ہے جس میں عقلی امکان موجود ہونے کی وجہ سے جھگڑا نہیں کرنا چاہیے۔ اور ان میں سے اس علم کا علم ہے جو عالم کی ذات میں اثر کرتا ہے۔ اور ان میں سے عالم کو جواہر کی اعیان (ذوات) کے طور پر پیدا کرنے کے محال ہونے کا علم ہے۔ اور ان میں سے عالم کی ہر نوع اور ہر جنس سے چنے ہوئے مصطفیٰ کا علم ہے۔ اور ان میں سے معانی اور غیر معانی میں آباء (باپ) اور أبناء (بیٹے) کا علم ہے۔ اور ان میں سے اسباب سے تعلق رکھنے اور ان سے تعلق چھوڑنے کا علم ہے۔ **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے) (الاحزاب: ۴)۔ چوبیسواں سفر مکمل ہوا۔\n\n(شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے)",
    "fa": "باب سیصد و شصت و دوم در معرفت منزل سجده قلب و وجه و کل و جزء، و این دو (قلب و وجه) منزل دو سجده و دو سجدگاه هستند.\n\nمقام آسان سجده قلب (سجود القلب) را *** در غیرِ آسانِ اکوان (الأكوان) حکمی نیست\n\nقلب (القلب) پس از سجده‌اش هرگز سر برنمی‌دارد *** اما وجه (الوجه) سر برمی‌دارد و این تغییر، اعلامی است\n\nزیرا او (وجه) به قبله‌اش مشهود نیست *** و قبله قلب (القلب) اسماء و نشانه‌هاست\nحقیقتش تأیید سجده‌اش را آشکار می‌سازد *** و او را در علوم خلق قدمی نیست\n\nاین منزل، منزل تمکین (التمكين) نامیده می‌شود و به آنچه سرانجامِ هر آنچه غیر خداست، بازمی‌گردد. همچنین منزل عصمت (العصمة) نیز نامیده می‌شود.\n\n### [اینکه خداوند متعال چون عالم را آفرید، برای آن ظاهر و باطنی قرار داد]\n\nبدان که خداوند متعال چون عالم را آفرید، برای آن ظاهر و باطنی قرار داد و از آن برای خود عالم، غیب و شهودی مقرر کرد. آنچه از عالم بر عالم غایب است، غیب است؛ و آنچه عالم از عالم مشاهده می‌کند، شهود (شهادة) است. و همه آن برای خدا شهود و ظاهر است. پس قلب (القلب) را از عالم غیب قرار داد و وجه (الوجه) را از عالم شهود (الشهادة). و برای وجه، جهتی را تعیین کرد که به سوی آن سجده کند و آن را خانه و قبله‌اش نامید؛ یعنی هنگام نماز رو به آن کند. و رو کردن به آن را عبادت قرار داد. و بهترین افعال نماز را سجده (السجود) و بهترین اقوال آن را ذکر خدا با قرآن قرار داد. و برای قلب، ذات خود سبحانه را تعیین کرد، پس قلب غیر او را قصد نمی‌کند و به او امر کرد که برایش سجده کند. اگر از روی کشف (كشف) سجده کند، هرگز سر از سجده‌اش برنمی‌دارد، نه در دنیا و نه در آخرت. و هر کس از غیر کشف سجده کند، سر برمی‌دارد، و این سر برداشتن همان غفلت از خدا و فراموشی خدا در اشیاست. پس کسی که در سجده قلبش (سجود قلبه) سر برنمی‌دارد، او کسی است که پیوسته حق (الحق) را دائماً در هر چیزی مشاهده می‌کند، و هیچ چیزی را نمی‌بیند مگر اینکه خدا را پیش از آن چیز می‌بیند. و این حالت ابوبکر صدیق است. و در عالم گمان مبر که کسی سجده‌کننده نبوده و سپس سجده کرده است، بلکه پیوسته سجده‌کننده بوده است، زیرا سجده برای او ذاتی است. و تنها برای برخی از اهل عالم، سجده‌شان مکشوف شده و آن را دانسته‌اند، و برای برخی دیگر مکشوف نشده و آن را نادانسته‌اند، پس گمان کرده‌اند که سر برمی‌دارند و سجده می‌کنند و هر طور که بخواهند تصرف می‌کنند. و بدان که چون سجده ظاهری، انتقال از حالت قیام یا رکوع یا قعود به حالت خم شدن و نهادن صورت بر زمین است، و این خم شدن سجده نامیده می‌شود، دانستیم که حالتی بر سجده‌کننده عارض شده که در ظاهر مرئی برای چشمان ما بر آن حالت نبوده است. پس از خدا خواستیم که بر محل انتقال این منتقل‌شونده از حالی به حالی دیگر آگاه شویم. برخی از مردم این و امثال آن را نسبت (نسب) قرار دادند، و او کسی است که کشف الهی (الكشف الإلهي) در علم به اکوان (الأكوان) که همان حرکت و سکون (الحركة والسكون) و اجتماع و افتراق (الاجتماع والافتراق) هستند، به او عطا شده است. حرکت عبارت است از اینکه جسم یا جوهر در زمانی در حیز یا مکانی مشاهده شود، سپس در زمان دیگر در حیز یا مکان دیگری مشاهده شود، پس گفته می‌شود که حرکت کرده و منتقل شده است. و سکون آن است که جوهر یا جسم در یک حیز برای دو زمان یا بیشتر مشاهده شود، پس اقامت آن در حیزش سکون نامیده می‌شود. و اجتماع عبارت است از دو جوهر یا دو جسم در دو حیز مجاور که بین آن دو حیز سومی نباشد. و افتراق عبارت است از دو جوهر یا دو جسم در دو حیز غیر مجاور که بین آن دو حیز سومی باشد که هیچ یک از آن دو در آن نباشد. پس امر جز این نیست. و برخی از متکلمین (أهل الكلام) در این مورد با اهل کشف (أهل الكشف) موافقت کردند. و از این مسئله باقی ماند که محرک کیست؟ آیا متحرک است یا امری دیگر؟ برخی از مردم گفتند که محرک همان حرکت است که در جسم قائم شده و موجب تحرک و انتقال آن گشته است. و در مورد حرکتی که موجب تحرک جسم شده است اختلاف کردند که آیا مشیت (مشيئة) بنده به آن تعلق گرفته است، پس حرکت اختیاری نامیده می‌شود، یا مشیت متحرک به آن تعلق نگرفته است، پس اضطراری نامیده می‌شود، مانند حرکت لرزان. و این همه در صورتی است که ثابت شود حرکتی وجود دارد، چنانکه برخی گمان کرده‌اند. و در این مورد اختلاف نکردند که این اکوان (الأكوان) اعراض هستند، چه نسبت باشند و چه معانی قائم به محل‌هایی که به آن وصف شده‌اند. زیرا ما شک نداریم که حالتی بر آن‌ها عارض شده که پیش از آن بر آن نبوده‌اند. و محال است که یکی از این اعراض ذاتی آن‌ها باشد، بلکه ذاتی آن‌ها قبول این اعراض است. و در مورد اینکه چه کسی آن حرکت یا سکون را ایجاد کرده است، اگر ثابت شود که آن عین موجودی است، اختلاف کردند که آیا خداوند متعال است یا غیر خدا؟ پس برخی قائل به این وجه و برخی قائل به آن وجه هستند. و در این مورد لرزان و غیر لرزان یکسان هستند. و برخی قائلند که اکوان وجودی ندارند، بلکه تنها نسبت‌ها هستند، پس به چه کسی مستند می‌شوند؟ و ما در مورد نسبت اختیاری می‌گوییم که خداوند برای بنده مشیتی خلق کرده که به واسطه آن حکم این نسبت را خواسته است. و آن مشیت حادث از مشیت خداست که خداوند عز و جل می‌فرماید: **«وَمَا تَشَاءُونَ إِلَّا أَن يَشَاءَ اللَّهُ»** (و شما نمی‌خواهید مگر اینکه خدا بخواهد). پس خداوند سبحان مشیت را برای خود و برای ما اثبات کرد و مشیت ما را موقوف بر مشیت خود قرار داد. این در مورد حرکت اختیاری است. اما در مورد اضطراری، امر نزد ما یکی است. پس سبب اول مشیت حق (مشيئة الحق) است و سبب دوم مشیتی است که از مشیت حق به وجود آمده است. جز اینکه در اینجا لطیفه‌ای است که کشف (الكشف) آن را عطا کرده و کسی که از پس حجاب کون اشاره کرده، به آن اشاره نموده است، و آن قول اوست: **«وَمَا تَشَاءُونَ إِلَّا أَن يَشَاءَ اللَّهُ»**. پس حق (الحق) به واسطه کشف، همان مشیت‌کننده است، اگرچه بنده در خود اراده‌ای برای آن بیابد. پس حق عین اراده اوست و نه غیر او، چنانکه ثابت شده است که اگر او را دوست بدارد، گوش و چشم و دست و تمام قوای او خواهد بود. پس حکم مشیتی که در خود می‌یابد، جز حق نیست. پس چون خدا بخواهد، آنچه خواسته است، همان عین مشیت هر مشیت‌کننده‌ای است. چنانکه قائل به اثبات حرکت می‌گوید که زید حرکت کرد یا دستش را حرکت داد. پس اگر قول او را تحقیق کنی، بر مذهب او خواهی یافت که آنچه دست او را حرکت داده، همان حرکتی است که در دست او قائم است، اگرچه آن را نمی‌بینی، اما اثرش را درک می‌کنی. با این حال می‌گویی که زید دستش را حرکت داد. همچنین می‌گویی که زید دستش را حرکت داد، در حالی که محرک تنها خداوند متعال است.\n\n### [در عالم مطلقاً سکونی نیست]\n\nو بدان که در عالم مطلقاً سکونی نیست، بلکه پیوسته و دائماً از حالی به حالی دیگر در حال دگرگونی است، در دنیا و آخرت، ظاهر و باطن. جز اینکه در آنجا حرکتی پنهان و حرکتی مشهود وجود دارد. احوال بر اعیان پذیرنده آن‌ها تردد می‌کنند و می‌روند، و حرکات در عالم آثار مختلفی ایجاد می‌کنند. و اگر این حرکات نبودند، مدت‌ها به پایان نمی‌رسید و حکمی برای عدد یافت نمی‌شد و اشیا تا اجل مسمی جریان نمی‌یافتند و انتقالی از سرایی به سرای دیگر نبود. و اصل وجود این احوال، صفات الهی (النعوت الإلهية) است، از جمله نزول حق (الحق) به آسمان دنیا هر شب و استوای او بر عرش حادث و بودن او در عماء (فضای ابری) در حالی که عرشی نبوده است. و این همان چیزی است که موجب شده است حق، گوش و چشم بنده و عین مشیت او باشد. پس به واسطه او می‌شنود و می‌بیند و حرکت می‌کند و می‌خواهد. پس منزه است کسی که در ظهورش پنهان است و در پنهانی‌اش ظاهر است، و خود را به آنچه درباره‌اش گفته می‌شود وصف کرده است که او صمد است، معبودی جز او نیست، ما را در **«الْأَرْحَامِ كَيْفَ يَشَاءُ»** (رحم‌ها هرگونه که بخواهد) تصویر می‌کند و شب و روز را دگرگون می‌سازد، و هر کجا که باشیم با ماست، و از ما به ما نزدیک‌تر است. پس ما او را به واسطه خودمان کثرت بخشیدیم و به واسطه او وحدت بخشیدیم. سپس از ما خواست که او را با «لا إله إلا الله» یگانه بدانیم. پس ما او را به امر او یگانه دانستیم و به واسطه خودمان کثرت بخشیدیم.\n\nحق (الحق) حکمتش را در هر وقت به تو نشان نمی‌دهد *** اما هیچ وقتی را از حکم خالی نمی‌گذارد\n\nپس بنگر به شادی در قلب (القلب) که از اندوهی می‌آید *** از طبقات، از الواح، از قلم\n\nرسولان ارواح آن‌ها را آورده‌اند، نازل‌شونده *** بر سرّهای ما از حضرت کلمات\n\nپس هر علم پنهانی که طلبش دشوار است *** بر عقل‌هایی که بهره‌ای از قدمت نبرده‌اند\n\nپس من از روی محبت و تعظیم برای منزل آن برخاستم *** از روی سعی بر سر راه می‌روم نه بر قدم\n\nو چون اکوان (الأكوان) جز این چهار حالت نیستند، سخن در مورد ساکن باقی می‌ماند که اگر ساکن شد، به واسطه کیست؟ و اگر حرکت کرد، به سوی کیست؟ و اگر جمع شد، به واسطه کیست؟ و اگر جدا شد، از کیست؟\n\nپس در آنجا جز خدا نیست، و در آنجا غیر او نیست *** و در آنجا جز عین و اراده او نیست\n\nپس در خدا ساکن شد، و او حیز (مکان) اوست، زیرا در علم او بود و عینی نداشت، پس او هیولای اوست. پس به صورت بنده تصویر شد و حکم آنچه خلق شد را یافت. و **«وَلَهُ مَا سَكَنَ فِي اللَّيْلِ وَالنَّهَارِ»** (و آنچه در شب و روز آرام گرفته، از آن اوست). و محال است که امر خلاف این باشد. پس به واسطه او جامه پوشید و بنای او بر او تأسیس و ثابت شد.\n\nپس اگر غیر او را شهود (شهدت) کنی، آن صورت اوست *** اگرچه آیات و صورت‌ها کثیر شوند\n\nآن‌ها غیر از کسی که منزل آن‌ها بوده، نیستند *** بلکه دیوارهایی هستند که دیوارهای دیگر در برابر آن‌ها سر فرود می‌آورند\n\nپس در کون (الكون) حرکت معقولی نیست، چنانکه سکون مشهودی نیز نیست.\n\nپس بنگر که ضد چگونه پنهان می‌شود *** و جز او چیزی آشکار نمی‌گردد\n\nپس از حرکتی در عین سکون تعجب کن، زیرا خلأ (فضای خالی) پر شده است، پس عالم در خلأ خود ساکن است. و حرکت جز در خلأ رخ نمی‌دهد. این حرکت اجسام است، در حالی که خلأ پر است و افزایش نمی‌پذیرد، زیرا برای آن «کجا»یی نیست. و همانطور که در خدا ساکن شد، به سوی خدا حرکت کرد، چنانکه فرمود: **«وَتُوبُوا إِلَى اللَّهِ جَمِيعًا»** (و همگی به سوی خدا بازگردید)، یعنی به آنچه از آن خارج شدید بازگردید. زیرا آن‌ها با اقرار به ربوبیت او خارج شدند، سپس در آن (ربوبیت) به فزع افتادند، پس به آن‌ها گفته شد: به آنچه از آن خارج شدید بازگردید. و جز خدا نیست، و بازگشت به سوی او جز به واسطه او نیست، زیرا او در سفر همراه است. اگر او بازگردد، ما بازمی‌گردیم، زیرا بازگشت تنها برای کسی است که حکم از آن اوست، و حکمی جز برای خدا نیست. **«ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا»** (سپس توبه آن‌ها را پذیرفت تا توبه کنند).\n\nپس این صدق گفتار ماست *** از راه رشد منحرف مشو\n\nپس هرگونه که می‌خواهید باشید *** زیرا حق (الحق) در کمین است\n\nو اگر به سوی او حرکت کردی، او هادی است، یا اگر از او حرکت کردی، از اسم گمراه‌کننده (المضل) اوست. پس تو را متحیر ساخت، سپس هدایت کرد، پس با هدایت بر تو توبه کرد، و تو با توبه به سوی او حرکت کردی. پس از گمراه‌کننده به سوی هادی. و **«وَإِنَّ إِلَى رَبِّكَ الرُّجْعَى»** (و همانا بازگشت به سوی پروردگار توست). و اما قول ما که «اگر جمع شد، به واسطه کیست؟» می‌گوییم: به واسطه خدا جمع شد، در عین اینکه خدا سرپرستی او را بر عهده گرفت، و این همان قول او به بنده‌اش است: «آیا در مورد ولی‌ای از من، با او دوستی کردی؟» زیرا او نزد ولی خود است. پس هر کس در راه خدا با ولی‌ای دوستی کند، با خدا دوستی کرده است. و اجتماع جز آنچه ذکر کردیم، نیست.\n\nدر خبر آمده است که خداوند می‌فرماید: «ای بنده من، بیمار شدم و به عیادتم نیامدی.» بنده می‌گوید: «پروردگارا، چگونه به عیادت تو بیایم در حالی که تو پروردگار جهانیانی؟» خداوند می‌فرماید: «آیا ندانستی که بنده من فلان بیمار شد و به عیادتش نرفتی؟ بدان که اگر به عیادتش می‌رفتی، مرا نزد او می‌یافتی.»\n\nزیرا بیمار پیوسته ذاکر خداست، ذکر اضطرار و افتقار، و این همان ذکر اصلی است که وجود ممکن بر آن بنا شده است. و حق تعالی (الحق تعالى) همنشین ذاکر خود است. پس هر کس در راه خدا با ولی‌ای دوستی کند، با خدا جمع شده است. اگر تو ولی هستی،\n\n### [اینکه خداوند چون ولی‌ای را دوست بدارد، با اوست]\n\nپس بدان که خدا نیز با توست. پس اگر با ولی‌ای دوستی کنی و خدا با او باشد، خدا با خدا جمع شده است. پس تو خدا و ذات او را با هم جمع کرده‌ای، و پاداش آنچه صاحب این جمعیت استحقاق دارد، به تو می‌رسد. پس خدا را با رؤیت ولی او دیده‌ای. اگر او در ولایت از تو بزرگ‌تر باشد، خدا نزد او عظیم‌تر و بزرگ‌تر از آن است که نزد توست. زیرا خدا نزد اولیای خود به اندازه معرفت آن‌ها به اوست. پس جاهل‌ترین و متحیرترین آن‌ها در مورد او، داناترین آن‌ها به اوست. و اگر به واسطه دوستی با ولی خدا، نسبت خدا به آن ولی خاص برای تو حاصل نشود تا بین نسبت سبحانه به تو و نسبت تعالی به آن ولی فرق بگذاری، پس تو به طور کامل با او دوستی نکرده‌ای. پس حق (الحق) بر زبان آن ولی با تو سخن می‌گوید، به گونه‌ای که شنیده می‌شود تا علمی را که نزد تو نبوده به تو فایده دهد یا تو را متذکر سازد. و تو از او می‌شنوی، اگر ولی باشی و ولایت خود را شهود (تشهد) کنی، پس با حق می‌شنوی، زیرا او گوش توست، آنچه را که حق بر زبان آن ولی سخن می‌گوید. پس امر مانند کسی می‌شود که با خودش سخن می‌گوید، و سخن‌گو عین شنونده است. و این ذوقی است که هر کس از خود می‌یابد و نمی‌داند چیست، مگر کسی که امر را بر آنچه هست شهود (شهد) کرده باشد. و اما قول ما که «افتراق از کیست؟» تمام خبر این است، و آن قول اوست: «یا در مورد دشمنی از من، با او دشمنی کردی؟» پس هر کس با او دشمنی کنی، از او جدا شده‌ای. زیرا هادی از گمراه‌کننده جدا می‌شود و زیان‌رسان از سودبخش جدا می‌شود. پس هر کس اسماء الهی را محکم کند، دری عظیم در علم به خدا برای او گشوده می‌شود که از هیچ چیز تنگ نمی‌آید.\n\nاگر آنچه را می‌گویم بدانی *** جز آنکه می‌گوید نخواهی بود\n\nتو مانند من نیستی، بلکه تو عین منی *** پس نه گوینده‌ای هست و نه گفته‌شده‌ای\n\nدر آنچه قصد کردیم، متحیر شدم *** در آنچه عقل‌ها برای ما آوردند\n\nپس محقق اگر آنچه را صاحب کشف (الكشف) مشاهده می‌کند، در نظر بگیرد، شاید بر حق مطلوب دست یابد، زیرا آن برای صاحب دو چشم در نهایت وضوح و ظهور است.\n\nپس حال با عقل‌ها و خردها بازی می‌کند *** مانند بازی اسماء با اکوان (الأكوان)\n\nپس عداوت و دشمنی از آنجا در کون (الكون) ظاهر شد. حال بر عین عالم مشهود به واسطه قیام اضداد در آن تغییر نمی‌کند، زیرا همه آن حق (حق) است. اگر آنچه را اشاره کردیم فهمیدی، خواهی دانست که چگونه دوستی کنی و چگونه دشمنی کنی، و با چه کسی دشمنی کنی و چه کسی دشمنی می‌کند، و چه کسی سرپرستی کرد و چه کسی سرپرستی می‌کند. پس منزه است کسی که تو را از خودت به وجود آورد و تو را به خودت شهود (أشهدك) کرد و به واسطه تو بر تو منت نهاد. پس **«مَن عَرَفَ نَفسَهُ فَقَد عَرَفَ رَبَّهُ»** (هر کس خود را شناخت، پروردگارش را شناخت). پس هیچ چیزی را جز به او نسبت نداد. و **«وَاللَّهُ غَنِيٌّ عَنِ الْعَالَمِينَ»** (و خداوند از جهانیان بی‌نیاز است).\n\n### [اینکه خداوند الوهیت را به هوی (هوس) نسبت داد]\n\nو بدان که خداوند چون الوهیت را به هوی (الهوى) نسبت داد و آن را مقابل خود قرار داد، به پیامبرش داوود علیه السلام فرمود: **«فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ وَلَا تَتَّبِعِ الْهَوَى»** (پس میان مردم به حق داوری کن و از هوی پیروی مکن). و فرمود: **«أَفَرَأَيْتَ مَنِ اتَّخَذَ إِلَهَهُ هَوَاهُ»** (آیا دیدی کسی را که هوای خود را معبود خویش گرفت؟). و هوی جز اراده بنده نیست، هنگامی که با میزان مشروعی که خدا برای او در دنیا وضع کرده، مخالفت کند. و قول او که **«وَمَا تَشَاءُونَ إِلَّا أَن يَشَاءَ اللَّهُ»** (و شما نمی‌خواهید مگر اینکه خدا بخواهد) مقرر شده است. پس دانستی که چه کسی به هوای خود حکم کرده است. و به همین دلیل فرمود: **«وَأَضَلَّهُ اللَّهُ عَلَى عِلْمٍ»** (و خدا او را با وجود علم گمراه کرد)، یعنی او را متحیر ساخت. زیرا علم به خدا موجب حیره (الحيرة) در خدا شد، چرا که حاکمی جز خدا نیست.\n\nزمین **«زِلْزَالَهَا»** (زلزله‌اش) را به لرزه درآورد *** و به ما گفت: **«مَا لَهَا»** (او را چه شده است؟)\n\nاگر چشمانی که درک می‌کنند، نگاه می‌کردند *** به پروردگارشان می‌نگریستند، هنگامی که **«أَوْحَى لَهَا»** (به او وحی کرد)\n\nو زمین اخبار خود را بازگو کرد *** همانطور که **«أَخْرَجَتْ أَثْقَالَهَا»** (بارهای سنگینش را بیرون آورد)\n\nپس کسی که این مشهد را مشاهده نکند، عظمت خدا را در هستی (الوجود) شهود نکرده است و علم بسیاری را که از این مشهود فوت می‌شود، از دست داده است.\n\n### [اینکه امر در چهار حقیقت محصور بود]\n\nو بدان که چون امر در چهار حقیقت **«الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ»** محصور بود و نشأت علم بر تربیع (چهارگانه) بنا شد، در طریق خداوند متعال صاحب تمکین (تمكين) نبود مگر کسی که تربیع را در ذات و افعال خود مشاهده کند. پس فرایض را که اقامه اولی است، و نوافل را که اقامه دیگری است، در ظاهر و باطن خود اقامه کند. پس حکم آن در ظاهر و باطن جاری شود و حکم خدا نشأت او را فرا گیرد. هنگامی که این را از خود به صورت ذوقی شهود کند، می‌داند که این امر چه ثمری برای او دارد. پس برای او در ظاهر شش جهت است، و شش دارای کمال است، زیرا اولین عدد کامل است؛ چرا که اگر سدس (یک ششم) آن را به ثلث (یک سوم) و نصف (نصف) آن اضافه کنی، مانند کل خواهد بود. و قلب (القلب) شش وجه دارد، و برای هر جهت، وجهی از قلب است که عین آن جهت است. به واسطه آن عین، حق (الحق) را درک می‌کند، هنگامی که در اسم ظاهر بر او تجلی (تجلى) کند. پس اگر تجلی (التجلي) همه جهات را فرا گیرد، از آن جهت که او به هر چیزی محیط است، قلب نیز با وجوه خود آنچه را که از حق در هر جهت برایش آشکار شده، فرا می‌گیرد. پس تماماً نور می‌شود. و در آنجاست که بنده می‌گوید: «پروردگارا، تو انجام دادی» و او را مخاطب قرار می‌دهد و می‌گوید: «تو هستی»، چنانکه بنده صالح گفت: **«كُنْتَ أَنْتَ الرَّقِيبَ عَلَيْهِمْ»** (تو خود مراقب آن‌ها بودی). پس ضمیر با وجود ضمیر بودنش ظاهر شد، در حالی که مضمر با ظاهر مخالف است. و با وجود مضمر بودنش در حال ظهور، ظاهر شد. پس در مورد حق می‌گوید که او ظاهر است در حال بطونش، و باطن است در حال ظهورش، از یک وجه. زیرا کلمه «أنت» (تو) ضمیر مخاطب است و جز عین تو نیست، و تو با خطاب مشهود هستی. پس تو مضمر ظاهر هستی، برخلاف اسم. پس اسماء مضمرات (ضمایر) از اسماء (اسم‌های ظاهر) در علم به خدا قوتی عظیم‌تر و جایگاهی استوارتر دارند. و حکایت شده است از برخی عارفان، و من آن را منقول از ابویزید بسطامی دیدم که در برخی مشاهدات خود با حق در یکی از احوال گفت: «أنانیتی أنانیتک» (منیت من، منیت توست). یعنی همانطور که اسم مضمر با حقیقتش بر او اطلاق می‌شود، آنچه مانند اسم ظاهر است بر تو اطلاق می‌شود، نه مانند وصف ظاهر. و این عین همان چیزی است که ما در مورد قوت مضمرات گفتیم. و چون در کون (الكون) تشبیه و اشتراک در صورت‌ها رخ داد، به طوری که یکی از دو شخص غایب شود و دیگری حاضر، و بیننده به حاضر گمان کند که حاضر عین غایب است، خداوند در عالم اشاراتی را در اخبارات و ضمایر قرار داد تا این اشتباه برطرف شود و بین آنچه هست و کسی که به صورت او ظاهر می‌شود، جدایی افکنده شود. و بر آن اعتماد کردند. و چون خداوند متعال خبر داد که انسان مخلوق بر صورت (صورة) است، عیسی علیه السلام گفت: **«كُنْتَ أَنْتَ الرَّقِيبَ عَلَيْهِمْ»**. پس بین حق و کسی که بر صورت اوست، جدایی افکند. گویی گفت: تو از حیث عین خودت، نه کسی که بر صورت توست، مراقب آن‌ها بودی. پس «أنت» (تو) در این موضع، جایگزین عین مقصود شد. و ما جزئی در مورد این اسماء مضمرات (ضمایر) داریم که آن را «کتاب الهو» نامیده‌ایم، و آن جزء نیکویی است که در مورد این اسماء مضمر به تفصیل سخن گفته‌ایم. و آن‌ها هر صورت قدیم و جدیدی را می‌پذیرند، به دلیل تمکن و علو مقامشان. و عالم اگرچه کثیر شود، به یک عین واحد بازمی‌گردد.\n\nپس هر کس در هستی (الوجود) است، حق است *** و هر کس در شهود (الشهود) است، خلق است\n\nپس بنگر به حکمتی که تجلی (تجلت) کرد *** در عین حقی که حق آن را در بر می‌گیرد\n\nپس بنده محق است و حق محق است *** پس نه حقی هست و نه محقی\n\nای ولی، زمان خود را در نگریستن به حرکات و تحقیق آن‌ها تلف مکن، زیرا وقت عزیز است. و به آنچه نتیجه می‌گیری بنگر و بر آن اعتماد کن، به واسطه آنچه از حقیقتش به تو می‌دهد. زیرا اگر نافذالبصیره باشی، از عین نتیجه، عین حرکت و محرک را خواهی شناخت. زیرا حرکت حقیقت عین است و محرک از پشت حجاب کون (الكون) است، و نتیجه آشکار و بی‌پرده است و از شأن خود خبر می‌دهد. پس بر آن اعتماد کن. این نصیحت من به توست ای ولی. و به همین دلیل، حق هیچ انتقالی را به خود نسبت نداد مگر اینکه نتیجه (النتيجة) را ذکر کرد تا تو را به آنچه عین انتقال منسوب به او در آن واقعه است، آگاه سازد. مانند قول او: «پروردگار ما در ثلث باقی‌مانده از شب به آسمان دنیا نازل می‌شود.» سپس نتیجه را ذکر کرد و فرمود: «پس می‌گوید: آیا توبه‌کننده‌ای هست؟ آیا دعاکننده‌ای هست؟ آیا آمرزش‌خواهی هست؟» و مانند این را بسیار فرمود تا بندگانش را از رنج فکر و عذرخواهی آسوده سازد. زیرا مقصود از حرکات، نتایجی است که به بار می‌آورند، نه اعیان آن‌ها. و همچنین هر چیزی؛ اگر مبتدا خبر نداشت، فایده‌ای نداشت و آوردن آن عبث بود. و از اینجاست که قول او شناخته می‌شود: **«أَفَحَسِبْتُمْ أَنَّمَا خَلَقْنَاكُمْ عَبَثًا»** (آیا گمان کردید که ما شما را بیهوده آفریدیم؟) و قول او: **«وَمَا خَلَقْنَا السَّمَاءَ وَالْأَرْضَ وَمَا بَيْنَهُمَا بَاطِلًا»** (و ما آسمان و زمین و آنچه بین آن دو است را باطل نیافریدیم). و از اینجاست که تنبه بر معرفت حکمتی که خدا عالم را برای آن به وجود آورد، حاصل می‌شود و اینکه اسم او حق (الحق) تعالی، حق است. و قول او: **«فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ»** (پس همانا خداوند از جهانیان بی‌نیاز است)، معنایش این است که از وجود (وجود) آن بی‌نیاز است، نه از ثبوت (ثبوت) آن. زیرا عالم در حال ثبوتش، کفایت و بی‌نیازی از وجودش حاصل می‌شود، چرا که حق الوهیت را با امکان خود ادا کرده است. و اگر طلب ممکنات و افتقار آن‌ها به چشیدن حالات نبود، و نمی‌خواستند حال هستی (الوجود) را بچشند، همانطور که حال عدم را چشیدند، پس با زبان ثبوت خود از واجب الوجود نخواستند که اعیان آن‌ها را به وجود آورد تا علم برای آن‌ها ذوق باشد، پس آن‌ها را برای خودشان به وجود آورد نه برای خود. پس او از وجود آن‌ها بی‌نیاز است و از اینکه وجود آن‌ها دلیلی بر او و نشانه‌ای بر ثبوت او باشد. بلکه عدم آن‌ها در دلالت بر او مانند وجود آن‌هاست. پس هر چیزی که از عدم یا وجود ترجیح داده شود، مقصود از علم به خدا به واسطه آن حاصل می‌شود. به همین دلیل دانستیم که بی‌نیازی سبحانه از عالم، عین بی‌نیازی او از وجود عالم است. و این مسئله‌ای غریب است، به دلیل متصف شدن ممکن به عدم در ازل، و اینکه ازل ترجیح را نمی‌پذیرد، و چگونه عدم ممکن با ازلیت آن، ترجیح را پذیرفت؟ و آن به این دلیل است که از حیث اینکه برای خودش ممکن است، قبول حکم دوگانه در حق او مساوی است؛ هر حالتی از عدم که برای او فرض شود، حالت وجود نیز برای او فرض می‌شود. پس آنچه حکم در آن در حال فرض برای اوست، مرجح است. پس ترجیح ازلاً در حال عدم ممکن بر او کشیده می‌شود، و او به عدم مرجح وصف شده است. و ترجیح از مرجح که اسم فاعل است، جز با قصدی برای آن رخ نمی‌دهد. و قصد، حرکتی معنوی است که حکم آن در هر چیزی بر حسب آنچه حقیقتش اقتضا می‌کند، ظاهر می‌شود. اگر محسوس باشد، حیز (مکان) را خالی می‌کند و حیز دیگری را اشغال می‌کند. و اگر معقول باشد، معنایی را زایل می‌کند و معنایی را اثبات می‌کند و از حالی به حالی منتقل می‌کند. و در این منزل، علوم گوناگونی وجود دارد، از جمله: علم دعای مقید و دعای مطلق و آنچه شایسته است برای هر مدعو گفته شود و با او رفتار شود. و از جمله: علم حرکات و اسباب و نتایج آن‌ها. و از جمله: علم منزلت کسی که در مورد آنچه نمی‌داند سخن می‌گوید و گمان می‌کند که می‌داند؛ آیا آنچه گفته است در نفس الامر علم است یا علم نیست؟ یا محال است که جز علم باشد، اما این گوینده آن را نمی‌داند؟ و آیا چنین چیزی در عالم ظاهر شده است، و آن خلقی از خداست برای تمییز مراتب، تا به واسطه آن مرتبه جهل از علم و جاهل از عالم شناخته شود؟ یا جز علم نیست؟ و از جمله: علم تعیین کسی که خداوند حیره (الحيرة) را در عالم به دست او قرار داده است. و آیا حیره مطلقاً سعادت می‌بخشد یا شقاوت؟ یا در آن تفصیل است که برخی سعادت و برخی شقاوت می‌بخشد؟ و آیا متحیرٌ فیه (آنچه در آن متحیر شده) آیا متحیر بودن در آن، اسم مفعول برای ذات اوست؟ یا ممکن است در آن متحیر نشود؟ و در آن علم سبب احتراقی است که صاحب حیره در باطن خود در حال حیره می‌یابد. و آیا اگر حائر بداند که علم به آنچه در آن متحیر شده، جز عین تحیر در آن نیست، آیا درد احتراق از او زایل می‌شود؟ و از جمله: علم نصب ادله؛ چگونه خداوند آن‌ها را برای عقلا، صاحبان نظر و استبصار، مرتب کرده است. و از جمله: علم غریبی است، و آن اینکه آیا ممکن است زمانی بر پذیرنده علوم بگذرد که در آن علمی کسب نکند یا نه؟ و از جمله: علم رتبه الهی؛ آیا از خدا حجاب می‌شود یا بر خدا دلالت می‌کند؟ و صفت کسی که آن را حجاب می‌کند و صفت کسی که برای او دلالت بر خالقش است. و از جمله: علم اینکه خداوند هرگز یکی را به وجود نیاورده و صحیح نیست، بلکه دو یا بیشتر را با هم به وجود آورده است، بدون تقدم و تأخر در وجود. و از جمله: علم اینکه احدیت برای حق ثابت نمی‌شود مگر در الوهیت او. اما در وجود او، ناگزیر از دو معقول یا بیشتر است. پس آن را هر چه می‌خواهی قرار ده، چه نسبت‌ها و چه صفات، به شرط آنکه احدیت را تعقل نکنی. و از جمله: علم تعلق اسماء الهی به کائنات. و از جمله: علم سعی آخرت تا زمانی که بیاید، و از کجا آمده است و این حرکت منسوب به آن چیست؟ و از جمله: علم معقول دنیا و آخرت چیست؟ و از جمله: علم جهل کسی که از خدا روی گردانده است، در حالی که **«فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ»** (پس به هر سو رو کنید، وجه خدا آنجاست). پس چگونه کسی که رو به وجه خدا کرده است، شقی می‌شود، اگرچه قصد رو کردن به وجه خدا را نداشته باشد، در حالی که در نفس الامر رو به وجه خداست؟ و روی گردان از وجه خدا کیست؟ و چه زمانی اطلاق می‌شود که انسان با هر وجهی رو به خدا کرده است؟ و آن زمانی است که انسان تماماً وجه و تماماً عین باشد. در حق کسی که صفتش این است، روی گردانی از خدا صحیح نیست. و از جمله: علم غریبی است، و آن اینکه جز آنچه از انسان خارج شده، به او بازنمی‌گردد، به دلیل اصلی که آن را تأیید می‌کند، و آن قول اوست: **«وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ»** (و همه امور به سوی او بازگردانده می‌شود). و امر همه از او آغاز شده و به سوی او بازمی‌گردد. و این معنای\n\nقول پیامبر صلی الله علیه و سلم است که: **«إِنَّمَا هِيَ أَعْمَالُكُمْ تُرَدُّ عَلَيْكُمْ»** (همانا آن‌ها اعمال شما هستند که به شما بازگردانده می‌شوند).\n\nپس بکوش که جز آنچه بازگشتش را می‌پسندی، از تو خارج نشود. و از جمله: علم کسی که با خدا بر آخرین قدم است، چه می‌کند؟ و این تنها در حضرت تکلیف است، زیرا پاداشی جز در آن نیست. پس در جستجوی علم این باش. و از جمله: علم سود و زیان و آنچه سود و زیان در آن رخ می‌دهد. و آیا موطنی برای انسان وجود دارد که نه دنیا باشد و نه آخرت؟ و منظورم از آخرت، سرای آخرتی است که شرایع از جانب خدا آورده‌اند. و از جمله: علم اینکه آنچه در دنیا به حال تقسیم شده، در آخرت به دار تقسیم می‌شود. پس در آخرت دو منزل است: بهشت و جهنم، و در دنیا دو منزل: عذاب و نعمت، یا درد و لذت. پس اگر انسان در حالی باشد که گفته شود صفتی ندارد، مانند ادعای ابویزید، آیا صاحب این ادعا همان کسی است که موطنی دارد که نه دنیاست و نه آخرت؟ و از جمله: علم آنچه سرانجام کسی است که گرفتن مهم‌تر را رها کرده است. و در آن علم امور عارضی است که چه اثری در عالم دارند. و از جمله: علم خزانه‌های روزی‌ها و قول برخی صالحان که شخصی از کثرت عائله به او شکایت کرد، پس به او گفت: «به خانه‌ات برو و ببین هر کس روزی‌اش بر خدا نیست، او را بیرون کن.» آن شخص گفت: «همه روزی‌شان بر خداست.» او گفت: «پس کثرت یا قلت آن‌ها چه ضرری به تو می‌رساند؟» و از جمله: علم فصل با شهود (الشهود) و کشف (الكشف) با حکم. و در آن علم فرق بین اراده (الإرادة) و مشیت (المشيئة) و همت (الهمة) و عزم (العزم) و قصد (القصد) و نیت (النية) است. و در آن علم صفات نایب از کسی است که او را نایب کرده است؛ آیا به همه آن‌ها قیام می‌کند یا تنها به آنچه برای آن نایب شده است؟ و از جمله: علم مراتب قول و اینکه بدی از خوبی و پاکی به چه چیزی نسبت داده می‌شود. و از جمله: علم بیان راه‌هایی که به ستایش خدا از طریق تنزیه و اثبات می‌رساند. و از جمله: علم آنچه موجب تساوی بین اشقیا و سعدا در دنیا می‌شود. و از جمله: علم میل به اکوان (الأكوان) و میل به جانب حق (الحق) و آنچه از آن ستوده و آنچه مذموم است. و از جمله: علم اقامه نشأتی که حق آن را به خود نسبت داده و جز به دست بندگانش برپا نمی‌شود. و از جمله: علم کور و حور و لازم و قائم و خاضع و نازل. و از جمله: علم اعلام به تکرار قصد به حق در اموری که حق بندگانش را به آن از عبادات فراخوانده است. و از جمله: علم راه‌های نزدیک و دور و سالکان در آن‌ها و محاسبه آثار، هنگامی که سلوک در آن‌ها و بر آن‌ها مشروع و غیر مشروع باشد، اما عقل سلیم و نظر صحیح آن را اقتضا کند، و تعیین قربت‌های الهی در آن بدون توقیف (توقف) و آنچه از آن صحیح و آنچه صحیح نیست. و از جمله: علم حمد خدا بر نعمت‌های نزدیک و مناسب با انسان. و از جمله: علم منافع هر موجودی در عالم. و از جمله: علم موانع در عالم و آنچه عقلاً و شرعاً منع کرده‌اند. و از جمله: علم ظهور معدوم در صورت موجود و تمایز آن در هستی (الوجود) از وجود حقیقی. و از جمله: علم نحل و ملل (فرقه‌ها و ادیان). و از جمله: علم آنچه جز پس از ازاله آنچه از آن سود برده می‌شود، سودی نمی‌دهد. و از جمله: علم احوال سائلان و آنچه شایسته هر سائل از جواب است. و از جمله: علم آنچه حق از اعمال بندگانش می‌پذیرد و آنچه نمی‌پذیرد، با وجود اینکه حرام و مذموم نیست. و از جمله: علم فرق بین عظمت الهی و کبریا. و از جمله: علم احسان و معرفت ماهیت آن. و از جمله: علم صفت کسی که حق از جانب او در دفع آنچه او را ناخوشایند است، نیابت می‌کند، با وجود آنچه او را ناخوشایند است. و از جمله: علم معارضه به مثل. و از جمله: علم عواقب اسماء حسنی. و از جمله: علم عمارت و خرابی و حکم آن دو در دنیا و آخرت. و از جمله: علم بازگشت از حق و تأثیر آن در بازگشت‌کننده. و از جمله: علم تقدیر واحد به کثیر، چنانکه برخی گفته‌اند:\n\nو بر خدا ناپسند نیست *** که عالم را در یک واحد جمع کند\n\nو از جمله: علم تقدیر تخالج (تداخل) در حدیث و آنچه از آن رفع می‌شود و آنچه رفع نمی‌شود. و از جمله: علم عرضه شدن فتنه‌ها بر قلب‌ها و حکم کسی که با آن‌ها انس می‌گیرد نسبت به غیر او. و از جمله: علم سبب باقی ماندن شکاک بر شک خود با وجود امکان نظر که او را از شک خارج می‌کند، اما انجام نداده است. و از جمله: علم فرق بین ایمان و علم و مراتب بین عالم و مؤمن. و از جمله: علم پیگیری رضایت بندگانش توسط حق، که رضایت او را پیگیری کرده‌اند، به عنوان جزای موافق. و از جمله: علم تأخیر بیان با وجود امکان تعجیل در توضیح آن، به دلیل امری که عالم آن را می‌بیند، با وجود نیاز به آن. و از جمله: علم صفت کسی که عفو الهی او را می‌طلبد. و از جمله: علم آنچه شایسته است از علوم کشف شود و آنچه شایسته است پنهان بماند. و از جمله: علم تداخل عالم غیب در شهود (الشهادة) و عالم شهود در غیب. و از جمله: علم استدراج و مکر. و از جمله: علم هر علمی که غایت آن عمل است، اما غایتش ظاهر نشده است، علت آن چیست؟ و از جمله: علم اینکه آسمان مانند خیمه است نه مانند کره توخالی، و هیئت آسمان‌ها برخلاف آنچه اصحاب علم هیئت ذکر کرده‌اند، است. و چرا سیر کواکب بازمی‌گردد؟ آیا به دلیل خودشان است یا به دلیل فلکی که به دور آن‌ها می‌چرخد؟ و در آن علم آنچه شایسته نیست در آن نزاع شود، به دلیل وجود امکان عقلی در آن. و از جمله: علم آنچه علم به آن در نفس عالم به آن تأثیر می‌گذارد. و از جمله: علم محال بودن خلق اعیان جواهر توسط عالم. و از جمله: علم مصطفای مختار از هر نوعی از عالم و از هر جنسی. و از جمله: علم پدران و پسران در معانی و غیر معانی. و از جمله: علم تعلق به اسباب و ترک تعلق به آن‌ها. و **«وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ»** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند). سفر بیست و چهارم به پایان رسید.\n\n(به نام خداوند بخشنده مهربان)"
  },
  "page_count": 7
}