{
  "id": 504,
  "title": {
    "ar": "الباب الرابع وخمسمائة في معرفة حال قطب كان منزله قُلِ الله ثُمَّ ذَرْهُمْ إلى هنا كان هجير شيخنا أبي مدين رحمه الله وزاد بعضهم قوله تعالى في خَوْضِهِمْ يَلْعَبُونَ",
    "en": "The Five Hundred and Fourth Chapter: Concerning the knowledge of the state (حال) of a Pole (قطب) whose station (منزل) was [the verse]: <<قُلِ الله ثُمَّ ذَرْهُمْ>> (Say: \"Allah,\" then leave them...). Up to this point was the constant refrain (هجير) of our Shaykh Abu Madyan, may Allah have mercy on him. And some added His exalted saying: <<فِي خَوْضِهِمْ يَلْعَبُونَ>> (...in their vain discourse, playing).",
    "ur": "باب پانچ سو چار: ایک قطب (Quṭb) کے حال کی معرفت میں جس کا روحانی مقام (Manzil) یہ تھا: \"قُلِ الله ثُمَّ ذَرْهُمْ\" (کہہ دیجیے: اللہ، پھر انہیں چھوڑ دیجیے)۔ یہاں تک ہمارے شیخ ابو مدین، اللہ ان پر رحم فرمائے، کا دائمی ورد تھا۔ اور بعض نے اللہ تعالیٰ کے اس قول کا اضافہ کیا: \"فِي خَوْضِهِمْ يَلْعَبُونَ\" (کہ وہ اپنی باطل باتوں میں کھیلتے رہیں)۔",
    "fa": "باب پانصد و چهارم: در شناخت حال قطبی (قطب) که مقام او «قُلِ اللَّهُ ثُمَّ ذَرْهُمْ» (بگو: خدا، سپس رهایشان کن) بود. تا این حد، این [آیه] ورد دائم (هجير) شیخ ما ابومدین، رحمت الله علیه، بود. و برخی دیگر این سخن خداوند متعال را افزودند: «فِي خَوْضِهِمْ يَلْعَبُونَ» (تا در ژرفای باطل خود بازی کنند)."
  },
  "content": {
    "ar": "## «الباب الرابع وخمسمائة في معرفة حال قطب كان منزله قُلِ الله ثُمَّ ذَرْهُمْ إلى هنا كان هجير شيخنا أبي مدين رحمه الله وزاد بعضهم قوله تعالى في خَوْضِهِمْ يَلْعَبُونَ»\n\n\n> إلى الله من كوننا المهرب *** وإياه في رفعه أرغب‏\n\n\n> ذر الكل في خوضه يلعب *** فليس لنا غيره مذهب‏\n\n\n> فإنك إن جئته تقرب *** وفيه الورى كله يرغب‏\n\n\n> ولما رأيت الذي يعجب *** من الله فزت بما أطلب‏\n\n\n### [إن الله وصف نفسه بالتعجب والضحك وأشباه هذه الصفات الخلقية]\n\n\nاعلم أيدنا الله وإياك بِرُوحٍ مِنْهُ أن هذا الباب قريب من الذي قبله فإن الله وصف نفسه بالتعجب والضحك والفرح والتبشيش وأشباه هذه الصفات الخلقية ووصف نفسه ب لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ يعني فيها وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ فخلصنا له منه أمرنا الحق أن نقول الله ثم نذرهم أي نترك ضميرهم وهو ضميرهم ضمير الجمع لا هو الذي هو ضمير الإفراد فإنا للفرد نخلص العبادة من الجمع فإن الجمع أظهر القسمة بين الله وبين عبده في العبادة وهي لله لا للمكلف من حيث صورته وإن كانت له من حيث جمعيته بالله فهنا رسخت قدم الشيخ أبي مدين رضي الله عنه ولم يتعد وغيره يتمم الآية فقال في خَوْضِهِمْ يَلْعَبُونَ فوقف أبو مدين رضي الله عنه مع قوله وإِذا رَأَيْتَ الَّذِينَ يَخُوضُونَ في آياتِنا وكل ما في العالم آياته فإنها\nدلائل عليه فأعرض عنهم فامتثل أمر الله فأعرض ووقف غيره مع أمره أن يتركهم في خَوْضِهِمْ يَلْعَبُونَ فامتثلنا أمر الله وتركنا هم فكشف الغطاء عن أبصارنا فعلمنا على الشهود من الخائض اللاعب وما هو هذا الجمع الذي أظهره ضمير لفظة هم في قوله ثُمَّ ذَرْهُمْ في خَوْضِهِمْ يَلْعَبُونَ وقد تقدم أنه ما ثم أثر إلا للأسماء الإلهية فثبت الجمع لله بأسمائه وثبت التوحيد بهويته‏\n\n\n> فما ثم جمع ولا واحد *** سوى الحق فاشهد وذر من أمر\n\n\n> كما قال في خوضه لاعبا *** لحكم القضاء وحكم القدر\n\n\n> فما ثم فيما ترى لاعب *** سوى من يصرف هذي الصور\n\n\n> فتبصره وهو يلهو بها *** كما شاءه حين يقضي الوطر\n\n\n> هي الصولجان وميدانها *** وجودي لتصريف هذي الكور\n\n\n> تجول الخيول بميدانها *** مراكب أرواحها في البشر\n\n\n> وهم في الركوب على ظهرها *** وإن سلموا فوق متن الخطر\n\n\nفَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ فهو القاتل وإن لم يرد هذا الاسم وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ فهو الرامي بالصورة المحمدية وإن لم يرد هذا الاسم تَرْمِيهِمْ بِحِجارَةٍ من سِجِّيلٍ في صورة طير وإن لم يرد سَرابِيلَ تَقِيكُمُ الْحَرَّ وهو الواقي وإن لم يرد والسرابيل اسم‏\n\n\n> فهذا من الخوض فاعلم به *** لتعلم من ذلك الخائض‏\n\n\n> وأبرم وما أنت أبرمته *** وكن ناقضا فهو الناقض‏\n\n\n> وقل للذي يجبن انهض به *** فتحمد نهوضك يا ناهض‏\n\n\n> فَلَمْ تَقْتُلُوهُمْ ولكنه *** هو القاتل الفارس الفارض‏\n\n\nليس مسمى اللعب باللعب على طريق الذم فإن اللعب مفرحة النفوس إلا أن الحق جعل لهذا اللعب مواطن فإذا تعدى العبد بلعبه تلك المواطن تعلق به الذم لا من كونه لعبا بل من كونه في ذلك الموطن ثم لتعلم إن الأمور تختلف بالقصد وإن اجتمعت في الصورة وقد بينا هذا المعنى فيما جبل عليه الإنسان في أصل خلقه من البخل والجبن والحرص والشرة وهي في العامة خلق مذمومة عرفا فبين الحق لها مصارف تحمد فيه فلو لا أنها قابلة\n\n\nللحمد بالذات ما حمدت في المصارف الإلهية التي عين لها الحق واللعب منها وقد أمرنا الحق أن نذر الخائض يلعب في خوضه وقد أمرنا بالنصح وتغيير المنكر بالمعروف وهو أن نبين وجه المعروف في المنكر فنزيل عنه اسم المنكر كما هو في نفس الأمر معروف فإنه ما في الوجود من يقع عليه نعت النكرة فإن كل شخص قد عينته شخصيته فأين المنكور\n\n\n> فإذا فهمت مقالتي فافرح بها *** فالقول قول الله في المخلوق‏\n\n\n> إذ كان من فهم الذي قد قلته *** من حكمة أدى إلي حقوقي‏\n\n\nهذا ما أنتجه المقال فكيف يكون ما ينتجه العمل فإن الله ما أمرنا إلا أن نقول الله ونترك كل حرف بما عنده فارحا ما كلفني غير ذلك فقال قُلِ الله ثُمَّ ذَرْهُمْ في خَوْضِهِمْ يَلْعَبُونَ عن بصيرة فإنهم بين أن يحمدوا ذلك الخوض أو يذموه عقدا فإن حمدوه فقد قلنا إنه تعالى عند كل معتقد وإن وجدوه في تصور من تصوره لا يزول بزوال تصور من تصوره إلى تصور آخر بل يكون له أيضا وجود في ذلك التصور الآخر كما يتحول يوم القيامة في التجلي من صورة إلى صورة وما زالت عنه تلك الصورة التي تحول عنها لأن الذي كانت معتقده فيها يراه فما هو إلا كشف منه تعالى عن عين هذا الذي يدركها لا غير فهم على بصيرة وإن ذموه فهم الذين تحول في حقهم إلى الصورة التي تحول إليها بعلامتهم فهم في ذمهم على بصيرة لأنه لذلك خلقهم كما تعبد كل مجتهد بما أداه إليه اجتهاده وحرم عليه إن يعبده باجتهاد غيره إذا كان من أهل الاجتهاد سواء فالمقلد مطلق فيما يجي‏ء به المجتهدون ويختار ما شاء فله الاتساع في الشرع وليس للمجتهد ذلك فإنه مقيد بدليله وإن‏\nأصاب الحق أو أخطأه كما هو نعت هذا الخائض إن حمد خوضه أو ذمه فهو في الحالتين على بصيرة ولهذا أمرنا الحق أن نتركهم في خَوْضِهِمْ يَلْعَبُونَ ولو لم يكن في هذا الذكر من الفائدة إلا كون الله يتخلق لعباده في اعتقادهم فإن الناظر في الله خالق في نفسه بنظره ما يعتقده فما عبد إلا إلها خلقه بنظره وقال له كُنْ فكان ولهذا أمرنا الناس أن يعبدوا الله الذي جاء به الرسول ونطق به الكتاب فإنك إذا عبدت ذلك الإله عبدت ما لم تخلق بل عبدت خالقك فأعطيت العبادة حقها موفى فإن العلم بالله لا يصح أن يكون علما إلا عن تقليد محال أن يكون عن دليل ولهذا منعنا عن التفكر في ذات الله ولم نمنع بل أمرنا أن نفرد الرتبة إليه فلا إله إلا هو والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Five Hundred and Four: Concerning the knowledge of the state of a Pole (قطب) whose station was <<Say: Allah, then leave them>> (قُلِ الله ثُمَّ ذَرْهُمْ). Up to this point was the constant recitation of our Shaykh Abu Madyan, may Allah have mercy on him, while some others added His saying, the Exalted, <<in their discourse, playing>> (في خَوْضِهِمْ يَلْعَبُونَ).\n\nTo Allah is the refuge from our existence,\nAnd Him alone I desire in His elevation.\n\nLeave all in their discourse, playing,\nFor we have no path other than Him.\n\nFor if you come to Him, you draw near,\nAnd in Him all creation desires.\n\nAnd when I saw that which causes wonder\nFrom Allah, I attained what I sought.\n\n[Indeed, Allah described Himself with wonder, laughter, and similar created Attributes]\n\nKnow, may Allah support us and you with a Spirit from Him (بِرُوحٍ مِنْهُ), that this chapter is close to the one preceding it. For Allah described Himself with wonder, laughter, joy, cheerfulness, and similar created Attributes (الصفات الخلقية). Yet, He also described Himself with <<There is nothing like unto Him>> (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ), meaning in respect to these [attributes]. And <<You threw not when you threw, but Allah threw>> (وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏).\n\nThus, we were purified for Him from Him. The Real (الحق) commanded us to say \"Allah,\" and then to leave them (نذرهم)—meaning, we leave their pronoun, which is the plural pronoun *hum* (هم), not the singular pronoun *huwa* (هو). For we purify the worship for the Singular (الفرد) from the Multiplicity (الجمع), since the Multiplicity reveals the division between Allah and His servant in worship. This worship belongs to Allah, not to the responsible person (المكلف) in terms of his form, even though it belongs to him in terms of his collectivity (جمعية) with Allah.\n\nHere, the foot of Shaykh Abu Madyan, may Allah be pleased with him, was firmly established, and he did not exceed [this point]. Others completed the verse, saying: <<in their discourse, playing>> (في خَوْضِهِمْ يَلْعَبُونَ). Abu Madyan, may Allah be pleased with him, stopped at the saying: <<And when you see those who engage in discourse concerning Our signs>> (وإِذا رَأَيْتَ الَّذِينَ يَخُوضُونَ في آياتِنا)—and everything in the World (العالم) is His signs, for they are proofs pointing to Him—<<then turn away from them>> (فأعرض عنهم). Thus, he obeyed Allah’s command and turned away. Others stopped at the command to leave them <<in their discourse, playing>> (في خَوْضِهِمْ يَلْعَبُونَ). So, we obeyed Allah’s command and left them.\n\nThen the veil (الغطاء) was lifted from our sight, and we knew, through Witnessing (الشهود), who the engaging player (الخائض اللاعب) is, and what this Multiplicity (الجمع) is that is revealed by the pronoun *hum* (هم) in His saying: <<then leave them>> (ثُمَّ ذَرْهُمْ) <<in their discourse, playing>> (في خَوْضِهِمْ يَلْعَبُونَ). It has already been established that there is no effect (أثر) except for the Divine Names (الأسماء الإلهية). Thus, Multiplicity is established for Allah through His Names, and Unity (التوحيد) is established through His Ipseity (هوية).\n\nThere is neither Multiplicity nor Singularity\nSave The Real (الحق); so witness and leave the matter.\n\nAs He said, in His discourse, playing,\nBy the ruling of the Decree (القضاء) and the ruling of Destiny (القدر).\n\nThere is no player in what you see\nExcept the One who directs these forms.\n\nSo you perceive Him, while He amuses Himself with them,\nAs He willed when He fulfills the need.\n\nThey are the polo stick, and their field\nIs my Existence (وجودي) for the direction of these spheres.\n\nThe horses roam in their field,\nTheir spirits’ mounts are in humanity.\n\nAnd they are riding upon their backs,\nEven if they are safe upon the surface of danger.\n\n<<You did not kill them, but Allah killed them>> (فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ). Thus, He is the Killer, even if this Name is not intended. <<You threw not when you threw, but Allah threw>> (وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏). Thus, He is the Thrower, through the Muhammadan Reality (الصورة المحمدية), even if this Name is not intended. <<Striking them with stones of baked clay>> (تَرْمِيهِمْ بِحِجارَةٍ من سِجِّيلٍ) in the form of a bird, even if [the Name] is not intended. <<Garments that protect you from the heat>> (سَرابِيلَ تَقِيكُمُ الْحَرَّ). And He is the Protector (الواقي), even if [the Name] is not intended, and the garments (السرابيل) are a Name.\n\nThis is part of the discourse (الخوض), so know it,\nThat you may know who that engager (الخائض) is.\n\nAnd confirm, though you did not confirm it,\nAnd be a nullifier, for He is the Nullifier.\n\nAnd say to the one who is cowardly, \"Rise up with it,\"\nSo your rising, O riser, may be praised.\n\n<<You did not kill them, but>>\nHe is the Killer, the Horseman, the Ordainer (الفارض).\n\nThe designation of play (اللعب) is not play in a manner of blame, for play is a source of joy for the souls (النفوس). However, The Real established specific stations (مواطن) for this play. If the servant exceeds those stations with his play, blame attaches to him, not because it is play, but because it occurs in that specific station.\n\nFurthermore, know that matters differ according to intention (القصد), even if they are identical in form (الصورة). We have already explained this meaning concerning what humanity was naturally disposed to in its original creation: stinginess, cowardice, greed, and gluttony. These are conventionally blameworthy traits (خلق مذمومة) among the common people. But The Real clarified outlets (مصارف) for them in which they are praised. If they were not inherently capable of praise (قابلة للحمد بالذات), they would not be praised in the Divine Outlets (المصارف الإلهية) that The Real designated for them. And play is one of these.\n\nThe Real commanded us to leave the engager (الخائض) playing in his discourse. Yet, He also commanded us to give sincere advice (النصح) and to change the reprehensible (المنكر) with the recognized good (المعروف). This means that we clarify the aspect of the recognized good within the reprehensible, thereby removing the name of \"reprehensible\" from it, since in reality (في نفس الأمر) it is recognized good. For there is nothing in Existence (الوجود) upon which the description of \"indefinite/unknown\" (النكرة) falls, since every person has been specified by his personality. So, where is the unknown?\n\nIf you understand my saying, then rejoice in it,\nFor the saying is the saying of Allah concerning the created.\n\nSince whoever understands what I have said\nOf wisdom has rendered my rights to me.\n\nThis is what the discourse produced; so what will the action produce? For Allah only commanded us to say \"Allah\" and to leave every letter (حرف) rejoicing in what it possesses. He did not burden me with anything other than that, saying: <<Say: Allah, then leave them in their discourse, playing>> (قُلِ الله ثُمَّ ذَرْهُمْ في خَوْضِهِمْ يَلْعَبُونَ) with insight (بصيرة).\n\nFor they are either praising that discourse or blaming it by conviction (عقدا). If they praise it, then we have said that He, the Exalted, is present with every believer (معتقد), even if they find Him in the conception of one who conceives Him. He does not vanish with the vanishing of the conception of the one who conceives Him into another conception; rather, He also has Existence (وجود) in that other conception. Just as He transforms on the Day of Resurrection in the Theophany (التجلي) from one form to another, yet the form from which He transformed does not cease to exist, because the one whose belief (معتقد) was in that form sees Him.\n\nThus, it is nothing but an Unveiling (كشف) from Him, the Exalted, concerning the very essence of the one who perceives it, and nothing else. So, they possess insight. And if they blame Him, they are the ones for whom He transformed into the form He transformed into, according to their sign. Thus, in their blame, they possess insight, because He created them for that purpose.\n\nJust as every independent jurist (مجتهد) worships according to what his independent judgment (اجتهاد) led him to, and it is forbidden for him to worship Him according to the judgment of another, provided he is among the people of independent judgment. The follower (المقلد) is unrestricted regarding what the independent jurists bring forth, and he may choose what he wishes; thus, he has breadth in the Law (الشرع). The independent jurist does not have this, for he is restricted by his evidence, whether he hits The Real (الحق) or misses it.\n\nThis is also the description of this engager (الخائض): whether he praises his discourse or blames it, he is in both states upon insight. For this reason, The Real commanded us to leave them <<in their discourse, playing>> (في خَوْضِهِمْ يَلْعَبُونَ).\n\nAnd even if there were no benefit in this mention except that Allah assumes the character (يتخلق) of His servants in their belief (اعتقاد), then the one who contemplates Allah is creating within himself, through his contemplation, that which he believes. Thus, he worships nothing but a god he created through his contemplation, to whom he said, \"Be!\" (كُنْ), and it was. For this reason, we commanded people to worship the Allah brought by the Messenger and spoken of by the Book. For if you worship that God, you worship what you did not create; rather, you worship your Creator, and thus you render the full right of worship.\n\nFor Knowledge (العلم) of Allah cannot be valid knowledge except through following (تقليد); it is impossible for it to be based on evidence. For this reason, we were forbidden from contemplating the Essence (الذات) of Allah. We were not forbidden, but rather commanded, to single out the Degree (الرتبة) to Him: <<There is no god but He>> (فلا إله إلا هو). And <<Allah speaks the Truth, and He guides to the Way>> (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏).",
    "ur": "باب نمبر پانچ سو چار قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"کہہ دیجیے: اللہ، پھر انہیں چھوڑ دیجیے\" (قُلِ الله ثُمَّ ذَرْهُمْ)۔ یہاں تک ہمارے شیخ ابو مدین رحمۃ اللہ علیہ کا معمول تھا، اور بعض نے اس میں اللہ تعالیٰ کا یہ قول بھی شامل کیا: \"کہ وہ اپنے خوض (بحث و مباحثہ) میں کھیلتے رہیں\" (فِي خَوْضِهِمْ يَلْعَبُونَ)۔\n\nاللہ کی طرف ہی ہمارے وجود سے فرار ہے،\nاور اسی کی بلندی میں میں رغبت رکھتا ہوں۔\n\nسب کو چھوڑ دو کہ وہ اپنے خوض میں کھیلتے رہیں،\nکیونکہ ہمارے لیے اس کے سوا کوئی راستہ (مذہب) نہیں۔\n\nپس اگر تو اس کے پاس آئے گا تو قربت پائے گا،\nاور اسی میں ساری مخلوق رغبت رکھتی ہے۔\n\nاور جب میں نے وہ دیکھا جو اللہ کی طرف سے تعجب خیز ہے،\nتو میں نے وہ پا لیا جس کی میں طلب کرتا تھا۔\n\n[بے شک اللہ نے اپنی ذات کو تعجب، ہنسنے اور ان جیسی صفاتِ خلقیہ سے متصف کیا ہے]\n\nجان لو، اللہ ہمیں اور تمہیں اپنی طرف سے ایک روح (بِرُوحٍ مِنْهُ) کے ذریعے تائید بخشے، کہ یہ باب پچھلے باب کے قریب ہے۔ بے شک اللہ نے اپنی ذات کو تعجب، ہنسنے، خوشی، اور خوش دلی (التبشيش) جیسی صفاتِ خلقیہ سے متصف کیا ہے، اور ساتھ ہی اپنی ذات کو اس سے بھی متصف کیا ہے کہ \"اس کی مثل کوئی شے نہیں\" (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)۔ یعنی ان صفات میں بھی (اس کی مثل کوئی نہیں)۔ اور (فرمایا): \"اور جب تم نے پھینکا تو تم نے نہیں پھینکا بلکہ اللہ نے پھینکا\" (وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏)۔ پس اس نے ہمیں اس سے نجات دلائی۔ ہمارے رب (الحق) نے ہمیں حکم دیا کہ ہم کہیں: \"اللہ\"، پھر انہیں چھوڑ دیں (ثُمَّ ذَرْهُمْ)۔ یعنی ہم ان کے ضمیر کو چھوڑ دیں، اور وہ ضمیر جمع کا ضمیر ہے، نہ کہ وہ (ہو) جو ضمیرِ افراد ہے۔ کیونکہ ہم فرد (اللہ) کے لیے عبادت کو جمع سے خالص کرتے ہیں۔ اس لیے کہ جمع نے اللہ اور اس کے بندے کے درمیان عبادت میں تقسیم کو ظاہر کیا، حالانکہ وہ (عبادت) اللہ کے لیے ہے نہ کہ مکلف کے لیے اس کی صورت کے اعتبار سے، اگرچہ وہ اس کے لیے ہے اس کی اللہ کے ساتھ جامعیت کے اعتبار سے۔ پس یہاں شیخ ابو مدین رضی اللہ عنہ کا قدم مضبوطی سے جما اور وہ آگے نہیں بڑھے۔ جبکہ دوسرے لوگ آیت کو مکمل کرتے ہوئے کہتے ہیں: \"کہ وہ اپنے خوض میں کھیلتے رہیں\" (فِي خَوْضِهِمْ يَلْعَبُونَ)۔ پس ابو مدین رضی اللہ عنہ اس قول پر ٹھہر گئے: \"اور جب تم ان لوگوں کو دیکھو جو ہماری آیات میں خوض (بحث) کر رہے ہوں\" (وإِذا رَأَيْتَ الَّذِينَ يَخُوضُونَ في آياتِنا)۔ اور جو کچھ بھی عالم میں ہے وہ اس کی آیات ہیں، کیونکہ وہ اس پر دلائل ہیں۔ پس ان سے اعراض کرو۔ چنانچہ انہوں نے اللہ کے حکم کی تعمیل کی اور اعراض کیا۔ اور دوسرے لوگ اس حکم پر ٹھہر گئے کہ انہیں چھوڑ دیا جائے کہ وہ اپنے خوض میں کھیلتے رہیں (فِي خَوْضِهِمْ يَلْعَبُونَ)۔ پس ہم نے اللہ کے حکم کی تعمیل کی اور انہیں چھوڑ دیا۔ چنانچہ ہماری آنکھوں سے پردہ (الغطاء) ہٹا دیا گیا، تو ہم نے شہود (الشہود) کے ذریعے جان لیا کہ خوض کرنے والا اور کھیلنے والا کون ہے، اور یہ کون سی جمع ہے جسے لفظ \"ہم\" (ھم) کے ضمیر نے ظاہر کیا ہے اس کے قول میں: \"پھر انہیں چھوڑ دو کہ وہ اپنے خوض میں کھیلتے رہیں\" (ثُمَّ ذَرْهُمْ فِي خَوْضِهِمْ يَلْعَبُونَ)۔ اور یہ پہلے بیان ہو چکا ہے کہ وہاں اسماء الٰہیہ کے سوا کوئی اثر نہیں ہے۔ پس جمع اللہ کے لیے اس کے اسماء کے ذریعے ثابت ہوئی، اور توحید اس کی ہویت (ذات) کے ذریعے ثابت ہوئی۔\n\nپس وہاں نہ کوئی جمع ہے اور نہ کوئی واحد،\nسوائے ذات حق (الحق) کے۔ پس شہود کر اور جو حکم دیا گیا ہے اسے چھوڑ دے۔\n\nجیسا کہ اس نے اپنے خوض میں کھیلتے ہوئے کہا،\nقضا کے حکم اور قدر کے حکم کے لیے۔\n\nپس جو کچھ تو دیکھتا ہے اس میں کوئی کھیلنے والا نہیں،\nسوائے اس کے جو ان صورتوں کو پھیرتا ہے۔\n\nپس تو اسے دیکھتا ہے جبکہ وہ ان سے کھیل رہا ہوتا ہے،\nجیسا کہ اس نے چاہا جب وہ اپنی حاجت پوری کرتا ہے۔\n\nیہ (صورتیں) چوگان ہیں اور ان کا میدان میرا وجود (وجودي) ہے،\nان گیندوں کو پھیرنے کے لیے۔\n\nگھوڑے اپنے میدان میں چکر لگاتے ہیں،\nوہ انسانوں میں ان کی روحوں کی سواریاں ہیں۔\n\nاور وہ ان کی پیٹھ پر سوار ہیں،\nاگرچہ وہ خطرے کی پشت پر سلامتی سے ہوں۔\n\n\"پس تم نے انہیں قتل نہیں کیا بلکہ اللہ نے انہیں قتل کیا\" (فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ)۔ پس وہی قاتل ہے، اگرچہ یہ اسم (قاتل) مراد نہ ہو۔ \"اور جب تم نے پھینکا تو تم نے نہیں پھینکا بلکہ اللہ نے پھینکا\" (وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏)۔ پس وہی رامی (پھینکنے والا) ہے محمدی صورت کے ذریعے، اگرچہ یہ اسم (رامی) مراد نہ ہو۔ \"وہ ان پر کنکریلے پتھر پھینک رہے تھے\" (تَرْمِيهِمْ بِحِجارَةٍ مِنْ سِجِّيلٍ) پرندے کی صورت میں، اگرچہ یہ (پرندہ) مراد نہ ہو۔ \"ایسی قمیصیں جو تمہیں گرمی سے بچاتی ہیں\" (سَرابِيلَ تَقِيكُمُ الْحَرَّ) اور وہی بچانے والا (الواقي) ہے، اگرچہ یہ اسم مراد نہ ہو، اور سرابیل (قمیصیں) ایک اسم ہے۔\n\nپس یہ خوض میں سے ہے، اسے جان لو،\nتاکہ تم اس خوض کرنے والے کو جان سکو۔\n\nاور پختہ کر، حالانکہ تو نے اسے پختہ نہیں کیا،\nاور توڑنے والا بن، حالانکہ وہی توڑنے والا (الناقض) ہے۔\n\nاور اس سے کہہ جو بزدل ہے کہ اس کے ساتھ اٹھ کھڑا ہو،\nپس اے اٹھنے والے! تیرا اٹھنا قابل تعریف ہو گا۔\n\n\"پس تم نے انہیں قتل نہیں کیا\" (فَلَمْ تَقْتُلُوهُمْ) لیکن وہی قاتل، شہسوار اور فرض کرنے والا (الفارض) ہے۔\n\nلعب (کھیل) کا مسمیٰ مذمت کے طریقے پر لعب نہیں ہے، کیونکہ لعب نفوس کے لیے فرحت کا باعث ہوتا ہے۔ مگر ذات حق (الحق) نے اس لعب کے لیے مقامات مقرر کیے ہیں۔ پس جب بندہ اپنے لعب کے ذریعے ان مقامات سے تجاوز کرتا ہے تو اس کے ساتھ مذمت وابستہ ہو جاتی ہے، نہ اس وجہ سے کہ وہ لعب ہے، بلکہ اس وجہ سے کہ وہ اس مقام پر ہے۔ پھر تمہیں یہ جاننا چاہیے کہ امور قصد (القصد) کے اختلاف سے مختلف ہو جاتے ہیں، اگرچہ وہ صورت میں یکجا ہوں۔ ہم اس معنی کو بیان کر چکے ہیں جو انسان کی اصل خلقت میں بخل، بزدلی، حرص اور شرہ (لالچ) کی صورت میں جبلت میں شامل کیا گیا ہے۔ یہ عام لوگوں میں عرفاً مذموم اخلاق ہیں۔ پس ذات حق نے ان کے لیے ایسے مصارف بیان کیے جہاں وہ قابل تعریف ہو جاتے ہیں۔ اگر وہ بذات خود تعریف قبول کرنے کے قابل نہ ہوتے تو وہ ان الٰہی مصارف میں قابل تعریف نہ ہوتے جو حق نے ان کے لیے مقرر کیے ہیں۔ اور لعب بھی انہی میں سے ہے۔\n\nاور حق نے ہمیں حکم دیا ہے کہ ہم خوض کرنے والے کو اس کے خوض میں کھیلتے رہنے دیں، حالانکہ ہمیں نصیحت (النصح) کرنے اور منکر کو معروف کے ذریعے بدلنے کا حکم دیا گیا ہے۔ اور وہ یہ ہے کہ ہم منکر میں معروف کا پہلو واضح کریں، تاکہ اس سے منکر کا نام زائل ہو جائے، کیونکہ وہ فی نفس الامر معروف ہے۔ اس لیے کہ وجود (الوجود) میں کوئی ایسا نہیں جس پر نکرہ (النكرة) کی صفت صادق آئے، کیونکہ ہر شخص کو اس کی شخصیت نے متعین کر دیا ہے۔ تو پھر منکور (غیر متعین) کہاں ہے؟\n\nپس جب تو میری بات سمجھ لے تو اس پر خوش ہو جا،\nکیونکہ یہ قول مخلوق کے بارے میں اللہ کا قول ہے۔\n\nکیونکہ جو شخص اس حکمت کو سمجھ لے جو میں نے کہی ہے،\nتو اس نے میرے حقوق ادا کر دیے۔\n\nیہ وہ ہے جو کلام نے پیدا کیا، تو عمل کیا پیدا کرے گا؟ بے شک اللہ نے ہمیں صرف یہ حکم دیا ہے کہ ہم \"اللہ\" کہیں اور ہر حرف کو اس کے پاس چھوڑ دیں، خوش ہوتے ہوئے، اس نے مجھے اس کے سوا کوئی تکلیف نہیں دی۔ پس اس نے فرمایا: \"کہہ دیجیے: اللہ، پھر انہیں چھوڑ دیجیے کہ وہ اپنے خوض میں کھیلتے رہیں\" (قُلِ الله ثُمَّ ذَرْهُمْ فِي خَوْضِهِمْ يَلْعَبُونَ)۔ یہ بصیرت کے ساتھ ہے، کیونکہ وہ اس خوض کی یا تو عقد (عقیدہ) کے طور پر تعریف کریں گے یا مذمت۔ اگر انہوں نے تعریف کی، تو ہم کہہ چکے ہیں کہ وہ (اللہ تعالیٰ) ہر معتقد کے پاس ہے، اور اگرچہ وہ اسے کسی تصور میں پائیں، تو وہ اس تصور کرنے والے کے تصور کے زائل ہونے سے زائل نہیں ہوتا، بلکہ دوسرے تصور میں بھی اس کا وجود ہوتا ہے۔ جیسا کہ قیامت کے دن ظہور الٰہی (التجلی) ایک صورت سے دوسری صورت میں منتقل ہو گا، اور وہ صورت جس سے وہ منتقل ہوا ہے، وہ زائل نہیں ہو گی، کیونکہ جو اس کا معتقد تھا وہ اسے اسی میں دیکھے گا۔ پس یہ اللہ تعالیٰ کی طرف سے اس شخص کی آنکھ سے پردہ (کشف) ہٹانا ہے جو اسے ادراک کرتا ہے، اور کچھ نہیں۔ پس وہ بصیرت پر ہیں۔ اور اگر انہوں نے مذمت کی، تو وہ وہی لوگ ہیں جن کے حق میں وہ اس صورت میں منتقل ہوا جس کی طرف وہ ان کی علامت کے ساتھ منتقل ہوا تھا۔ پس وہ اپنی مذمت میں بصیرت پر ہیں، کیونکہ اس نے انہیں اسی لیے پیدا کیا ہے۔ جیسا کہ ہر مجتہد اس چیز کی عبادت کرتا ہے جس کی طرف اس کا اجتہاد اسے لے گیا، اور اس پر حرام ہے کہ وہ کسی دوسرے کے اجتہاد سے عبادت کرے، اگر وہ اہل اجتہاد میں سے ہو۔ جبکہ مقلد اس میں مطلق ہے جو مجتہدین لاتے ہیں، اور وہ جو چاہے اختیار کر سکتا ہے۔ پس اس کے لیے شریعت میں وسعت ہے، اور مجتہد کے لیے یہ نہیں ہے، کیونکہ وہ اپنی دلیل کا پابند ہے، خواہ وہ حق کو پائے یا اس سے خطا کرے، جیسا کہ اس خوض کرنے والے کی صفت ہے کہ خواہ وہ اپنے خوض کی تعریف کرے یا مذمت، وہ دونوں حالتوں میں بصیرت پر ہے۔ اور اسی لیے حق نے ہمیں حکم دیا کہ ہم انہیں چھوڑ دیں کہ وہ اپنے خوض میں کھیلتے رہیں (فِي خَوْضِهِمْ يَلْعَبُونَ)۔ اور اگر اس ذکر میں کوئی فائدہ نہ ہوتا سوائے اس کے کہ اللہ اپنے بندوں کے لیے ان کے اعتقاد میں اخلاق اختیار کرتا ہے، تو (یہی کافی تھا)۔ کیونکہ اللہ میں دیکھنے والا اپنے دیکھنے کے ذریعے اپنے نفس میں اس چیز کو تخلیق کرتا ہے جس کا وہ اعتقاد رکھتا ہے۔ پس اس نے صرف اسی معبود کی عبادت کی جسے اس نے اپنے دیکھنے سے تخلیق کیا اور اسے کہا: \"ہو جا\" (كُنْ) تو وہ ہو گیا۔ اور اسی لیے ہمیں لوگوں کو حکم دیا گیا کہ وہ اس اللہ کی عبادت کریں جسے رسول لائے اور جس کا ذکر کتاب نے کیا۔ کیونکہ جب تم اس الٰہ کی عبادت کرو گے تو تم اس کی عبادت کرو گے جسے تم نے تخلیق نہیں کیا، بلکہ تم اپنے خالق کی عبادت کرو گے، پس تم نے عبادت کا حق پورا پورا ادا کر دیا۔ کیونکہ اللہ کی معرفت (العلم بالله) کا علم ہونا صحیح نہیں ہو سکتا مگر تقلید کے ذریعے، محال ہے کہ وہ دلیل کے ذریعے ہو۔ اور اسی لیے ہمیں ذات اللہ میں تفکر کرنے سے منع کیا گیا، اور ہمیں منع نہیں کیا گیا بلکہ حکم دیا گیا کہ ہم رتبہ کو صرف اسی کے لیے خاص کریں، پس اس کے سوا کوئی معبود نہیں (لا إله إلا هو)۔ اور \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏)۔",
    "fa": "باب پانصد و چهارم در شناخت حال قطبی که منزل او «قُلِ الله ثُمَّ ذَرْهُمْ» (بگو: الله، سپس رهایشان کن) بود. تا اینجا ورد (هجیر) شیخ ما ابومدین (رحمه الله) بود و برخی دیگر این سخن خداوند متعال را افزودند: «فِي خَوْضِهِمْ يَلْعَبُونَ» (تا در ژرفای [باطل] خود بازی کنند).\n\nگریز ما از هستی (الوجود)، سوی حق (الحق) است / و در رفعت اوست که رغبت می‌نمایم\nبگذار همه در ژرفای [باطل] خود بازی کنند / که ما را جز او مذهبی نیست\nزیرا اگر به سوی او آیی، نزدیک می‌شوی / و همه خلق در او رغبت دارند\nو چون دیدم آنچه را که شگفت‌انگیز است / از جانب حق، به آنچه می‌طلبیدم دست یافتم.\n\n### [همانا خداوند خود را به تعجب، خنده و مانند این صفات خلقی وصف کرده است]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که این باب به باب پیشین نزدیک است؛ زیرا خداوند خود را به تعجب، خنده، شادی، بشاشت و مانند این صفات خلقی وصف کرده است و همچنین خود را به «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی مانند او نیست) وصف کرده است، یعنی در این صفات. و [همچنین فرمود:] «وَ ما رَمَيْتَ إِذْ رَمَيْتَ وَ لكِنَّ اللَّهَ رَمى‏» (و تو پرتاب نکردی آنگاه که پرتاب کردی، بلکه خدا پرتاب کرد). پس حق ما را از این امر رهایی بخشید و به ما فرمان داد که بگوییم: «الله»، سپس «نَذَرْهُمْ» (رهایشان کنیم)، یعنی ضمیر جمع (هم) را رها کنیم، نه ضمیر مفرد (هو) را. زیرا ما عبادت را برای فرد (حق) از جمع خالص می‌کنیم. چرا که جمع، تقسیم و جدایی میان خدا و بنده را در عبادت آشکار می‌سازد، در حالی که عبادت از حیث صورت برای مکلف نیست، اگرچه از حیث جامعیتش با حق (الله) برای اوست. در اینجا بود که قدم شیخ ابومدین (رضی الله عنه) راسخ شد و فراتر نرفت، اما دیگران آیه را کامل کردند و گفتند: «فِي خَوْضِهِمْ يَلْعَبُونَ» (تا در ژرفای [باطل] خود بازی کنند). ابومدین (رضی الله عنه) با این سخن حق توقف کرد: «وَ إِذا رَأَيْتَ الَّذِينَ يَخُوضُونَ فِي آياتِنا» (و چون کسانی را دیدی که در آیات ما ژرف‌کاوی می‌کنند) و هر آنچه در عالم است آیات اوست، زیرا آنها دلایل بر او هستند، پس «فَأَعْرِضْ عَنْهُمْ» (از ایشان روی بگردان). پس او امر حق را امتثال کرد و روی گرداند. اما دیگران با امر حق مبنی بر اینکه آنها را در «فِي خَوْضِهِمْ يَلْعَبُونَ» رها کنیم، توقف کردند. پس ما امر حق را امتثال کردیم و آنها را رها کردیم. در نتیجه، پرده از دیدگان ما برداشته شد و ما با شهود (الشهود) دانستیم که آن ژرف‌کاوِ بازیگر کیست و این جمعی که ضمیر «هم» در سخن او «ثُمَّ ذَرْهُمْ فِي خَوْضِهِمْ يَلْعَبُونَ» آشکار ساخت، چیست. پیشتر بیان شد که هیچ اثری جز برای اسماء الهی نیست. پس جمع به واسطه اسماء الهی برای حق ثابت شد و توحید به واسطه هویت (ذات) او ثابت گردید.\n\nپس نه جمعی هست و نه واحدی / جز حق (الحق)، پس شهود کن و هر که امر کرد را رها ساز\nچنان که در ژرفای [باطل] خود بازی‌کنان گفت / برای حکم قضا و حکم قدر\nپس در آنچه می‌بینی بازیگری نیست / جز آنکه این صورت‌ها را می‌گرداند\nاو را می‌بینی که با آنها سرگرم است / آن‌گونه که خواست، هنگامی که حاجت را برآورد\nاینها چو چوگان و میدان آنند / و هستی (وجود) من برای گرداندن این گوی‌هاست\nاسب‌ها در میدان خود جولان می‌دهند / که مرکب‌های ارواحشان در میان بشرند\nو آنان بر پشت این اسب‌ها سوارند / و اگرچه سالم باشند، بر فراز خطرند\n\n«فَلَمْ تَقْتُلُوهُمْ وَ لكِنَّ اللَّهَ قَتَلَهُمْ» (شما آنان را نکشتید، بلکه خدا آنان را کشت). پس اوست قاتل، اگرچه این اسم (قاتل) را اراده نکرده باشد. و «وَ ما رَمَيْتَ إِذْ رَمَيْتَ وَ لكِنَّ اللَّهَ رَمى‏» (و تو پرتاب نکردی آنگاه که پرتاب کردی، بلکه خدا پرتاب کرد). پس اوست پرتاب‌کننده به واسطه صورت محمدیه (الصورة المحمدیة)، اگرچه این اسم (پرتاب‌کننده) را اراده نکرده باشد. «تَرْمِيهِمْ بِحِجارَةٍ مِنْ سِجِّيلٍ» (بر آنان سنگ‌هایی از گِل سخت پرتاب می‌کرد) در صورت پرنده، اگرچه این اسم را اراده نکرده باشد. «سَرابِيلَ تَقِيكُمُ الْحَرَّ» (جامه‌هایی که شما را از گرما حفظ می‌کند) و اوست محافظ (الواقي)، اگرچه این اسم را اراده نکرده باشد، و سرابیل (جامه‌ها) یک اسم است.\n\nپس این از ژرف‌کاوی است، آن را بدان / تا آن ژرف‌کاو را بشناسی\nو محکم کن، در حالی که تو آن را محکم نکرده‌ای / و شکننده باش، که اوست شکننده\nو به آنکه می‌ترسد بگو: به واسطه او برخیز / تا برخاستن خود را ستایش کنی، ای برخیزنده\n«فَلَمْ تَقْتُلُوهُمْ وَ لكِنَّهُ» / اوست قاتل، سوارکار و حکم‌کننده (الفارض)\n\nنامیده شدن بازی به بازی از باب مذمت نیست، زیرا بازی شادی‌بخش جان‌هاست، جز اینکه حق برای این بازی جایگاه‌هایی قرار داده است. پس اگر بنده با بازی خود از آن جایگاه‌ها فراتر رود، مذمت به او تعلق می‌گیرد، نه از آن جهت که بازی است، بلکه از آن جهت که در آن جایگاه خاص قرار گرفته است. سپس باید بدانی که امور به واسطه قصد متفاوت می‌شوند، اگرچه در صورت یکی باشند. ما این معنا را در آنچه انسان در اصل خلقتش بر آن سرشته شده است، مانند بخل، ترس، حرص و شره (حرص شدید)، بیان کردیم. این صفات در میان عموم، عرفاً اخلاق مذمومی هستند. پس حق برای آنها مجراهایی (مصارف) را بیان کرد که در آن ستوده می‌شوند. اگر این صفات ذاتاً قابلیت ستایش نداشتند، در مجراهای الهی که حق برای آنها تعیین کرده است، ستوده نمی‌شدند، و بازی نیز از جمله آنهاست. حق به ما امر کرده است که ژرف‌کاو را رها کنیم تا در ژرفای [باطل] خود بازی کند. و به ما امر شده است که نصیحت کنیم و منکر را به معروف تغییر دهیم، و این به آن معناست که وجه معروف را در منکر بیان کنیم، پس نام منکر را از آن برداریم، زیرا در نفس‌الامر (حقیقت امر) معروف است. چرا که در هستی (الوجود) چیزی نیست که وصف نکره (ناشناخته) بر آن واقع شود، زیرا هر شخصیتی به واسطه شخص بودن خود معین شده است، پس منکور (ناشناخته) کجاست؟\n\nپس اگر گفتار مرا فهمیدی، به آن شاد باش / که این سخن، سخن حق (الله) در مخلوق است\nزیرا هر کس آنچه را گفتم فهمید / از حکمت، حقوق مرا ادا کرد\n\nاین نتیجه گفتار است، پس نتیجه عمل چگونه خواهد بود؟ همانا خداوند ما را جز به گفتن «الله» امر نکرده است و اینکه هر حرفی را با آنچه نزد اوست، شادمانه رها کنیم. او مرا به غیر از این مکلف نساخت و فرمود: «قُلِ اللَّهُ ثُمَّ ذَرْهُمْ فِي خَوْضِهِمْ يَلْعَبُونَ» (بگو: الله، سپس رهایشان کن تا در ژرفای [باطل] خود بازی کنند) از روی بصیرت. زیرا آنان یا آن ژرف‌کاوی را از روی اعتقاد می‌ستایند یا آن را مذمت می‌کنند. اگر آن را ستایش کنند، ما گفتیم که او (تعالی) نزد هر معتقدی است. و اگر او را در تصوری که تصور کرده‌اند بیابند، با زوال تصور آن شخص به تصور دیگر، زایل نمی‌شود، بلکه در آن تصور دیگر نیز وجودی برای او خواهد بود، همان‌گونه که در روز قیامت در تجلی (التجلی) از صورتی به صورتی دیگر درمی‌آید، و آن صورتی که از آن متحول شده است، از او زایل نشده است، زیرا کسی که اعتقادش بر آن بوده، او را می‌بیند. پس این جز کشفی (الکشف) از جانب حق (تعالی) از عین این شخص که آن را درک می‌کند، نیست. پس آنان بر بصیرت هستند. و اگر آن را مذمت کنند، آنان کسانی هستند که حق در حقشان به صورتی که با علامت‌هایشان به آن متحول شده، درآمده است. پس آنان در مذمت خود بر بصیرت هستند، زیرا حق آنان را برای همین خلق کرده است. همان‌گونه که هر مجتهدی به آنچه اجتهادش او را به آن رسانده، عبادت می‌کند و بر او حرام است که با اجتهاد غیر خود عبادت کند، اگر از اهل اجتهاد باشد. اما مقلد در آنچه مجتهدان می‌آورند آزاد است و هر چه بخواهد انتخاب می‌کند، پس برای او در شریعت وسعت است، در حالی که مجتهد چنین نیست، زیرا او مقید به دلیل خود است، چه به حق برسد و چه خطا کند. همان‌گونه که وصف این ژرف‌کاو چنین است؛ چه ژرف‌کاوی خود را ستایش کند و چه مذمت، در هر دو حالت بر بصیرت است. و به همین دلیل حق به ما امر کرد که آنان را در «فِي خَوْضِهِمْ يَلْعَبُونَ» رها کنیم. و اگر در این ذکر (یادآوری) فایده‌ای جز این نبود که خداوند در اعتقاد بندگانش به صورت اخلاق آنان درمی‌آید، کافی بود. زیرا کسی که در حق (الله) نظر می‌کند، با نظر خود در نفس خویش آنچه را اعتقاد دارد، خلق می‌کند. پس او جز خدایی را که با نظر خود خلق کرده و به او گفته: «کُنْ» (باش)، و او موجود شده است، عبادت نکرده است. و به همین دلیل به مردم امر شده است که خدایی را عبادت کنند که رسول آورده و کتاب به آن نطق کرده است. زیرا اگر آن اله را عبادت کنی، چیزی را عبادت کرده‌ای که خلق نکرده‌ای، بلکه خالق خود را عبادت کرده‌ای، پس حق عبادت را به طور کامل ادا کرده‌ای. همانا علم به حق (الله) صحیح نیست که علم باشد مگر از طریق تقلید (پیروی)، و محال است که از طریق دلیل باشد. و به همین دلیل ما از تفکر در ذات حق (الله) منع شده‌ایم، اما منع نشده‌ایم، بلکه امر شده‌ایم که رتبه را به او اختصاص دهیم، پس «لا إِلهَ إِلَّا هُوَ» (هیچ معبودی جز او نیست). و «وَ اللَّهُ يَقُولُ الْحَقَّ وَ هُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 3
}