{
  "id": 186,
  "title": {
    "ar": "الباب السادس والثمانون ومائة في معرفة مقام خرق العادات",
    "en": "Chapter One Hundred and Eighty-Six, Concerning the Knowledge of the Station of the Breaking of Norms (خرق العادات)",
    "ur": "سولہ سو چھیاسیواں باب: خرق العادات (خرق العادات) کے مقام کی معرفت میں",
    "fa": "باب صد و هشتاد و ششم در معرفت مقام خرق عادات (خرق العادات)"
  },
  "content": {
    "ar": "## (الباب السادس والثمانون ومائة في معرفة مقام خرق العادات)\n\n\n> خرق العوائد أقسام مقسمة *** أتى بها النظر الفكري محصورة\n\n\n> منها معينة بالحق قائمة *** كالمعجزات على الإرسال مقصورة\n\n\n> وما سواها من الأقسام محتمل *** وليس للعلم في تعيينه صوره‏\n\n\n> وكلها في كتاب الله بينة *** فقف عليه تجدها فيه مسطورة\n\n\n> بشرى وسحر ومكر أو علامته *** وكلها في كتاب الله مذكوره‏\n\n\n> فهذه خمسة أقسامها انحصرت *** للناظرين وفي الأكوان مشهورة\n\n\n### [أن خرق العادات على وجوه كثيرة]\n\n\nاعلم أن مقام خرق العادات على وجوه كثيرة منها ما يكون عن قوى نفسية فإن أجرام العالم تنفعل للهمم النفسية هكذا جعل الله تعالى الأمر فيها وقد تكون عن حيل طبيعية معلومة كالفلقطيرات وغيرها وبابها معلوم عند العلماء وقد تكون عن نظم حروف بطوالع وذلك لأهل الرصد وقد تكون بأسماء يتلفظ بها ذاكرها فيظهر عنها ذلك الفعل المسمى خرق عادة في ناظر عين الرائي لا في نفس الأمر وقد تكون في نفس الأمر على قدر قوة ذلك الاسم وهذه كلها تحت قدرة المخلوق بجعل الله وثم خرق عوائد مختصة بالجناب الإلهي ليس للعبد فيها تعمل ولا قوة ولكن يظهرها الله عليه أو تظهر عنه بأمر الله وإعلامه وهي على مراتب منها ما تسمى معجزة ولها شروط ونعت خاص معلوم ومنها ما تسمى آية\nلا معجزة ومنها ما تكون كرامة ومنها ما تكون مؤيدة ومنها ما تكون منبهة وباعثة ومنها ما يكون جزاء ومنها ما يكون مكرا واستدراجا وكلها لها علامات عند أهل الله مع كون هؤلاء لا علم لهم بشي‏ء من ذلك بخلاف الصنف الأول فإنهم على علم ما يصدر منهم وما من شي‏ء مما ذكرناه في الصنف الثاني المضاف عمله إلى الله تعالى إلا والاحتمال يدخله هل هو عن عناية أولا عن عناية إلا المعجزة والآية فإنها عن عناية ولا بد إنها الصدق المخبر والمؤيدة كذلك وما عدا هذين فيتطرق إليه الاحتمال كما ذكرنا ثم نرجع إلى ما تقضي به طريقنا إن خرق العادة في الأولياء لا يكون إلا لمن خرق العادة في نفسه بإخراجها عن حكم ما تعطيه حقيقتها وهو تصرفها في المباح أو ما يلقي إليها الشيطان بالتزيين من إتيان المحظور أو ترك الواجب فمن خرق في نفسه هذه العادة خرق الله له عادة في الكون بأمر يسمى كلاما على الخاطر أو مشيا في الهواء أو ما كان وقد ذكرنا فصول هذه الكرامات وبينا مراتبها وما ينتجها في كتاب مواقع النجوم ما سبقنا إليه في علمنا أعني إلى ترتيبه لا إلى علم ما فيه وهو كتاب صحيح الطريق عظيم الفائدة صغير الجرم بنيناه على المناسبة فإن المناسبة أصل وجود العالم وخرق العوائد من العالم وقد جعل الله آياته في العالم معتادة وغير معتادة فالمعتادة لا يعتبرها إلا أهل الفهم عن الله خاصة وما سواهم فلا علم لهم بإرادة الله فيها وقد ملأ الله القرآن من الآيات المعتادة من اختلاف الليل والنهار ونزول الأمطار وإخراج النبات وجرى الجواري في البحر واختلاف الألسنة والألوان والمنام بالليل والنهار لابتغاء الفضل وكل ما ذكر في القرآن أنه آية لِقَوْمٍ يَعْقِلُونَ ويَسْمَعُونَ ويَفْقَهُونَ ويُؤْمِنُونَ ويَعْلَمُونَ ويُوقِنُونَ ويَتَفَكَّرُونَ ومع هذا كله فلا يرفع بذلك أحد من الناس رأسا إلا أهل الله وهم أهل القرآن خاصة الله وأما الآيات الغير المعتادة وهي خرق العوائد فهي التي تؤثر في نفوس العامة مثل الزلازل والرجفات والكسوف ونطق حيوان ومشي على ماء واختراق هواء وإعلام بكوائن في المستقبل تقع على حد ما أعلم والكلام على الخواطر والأكل من الكون وإشباع القليل من الطعام الكثير من الناس هذا تعتبره العامة خاصة ومتى لم يكن خرق العادة عن استقامة أو منبها وباعثا على الرجوع إلى الله ويرجع وليس له فيه تعمل فهو مكر واستدراج من حيث لا يعلم وهذا هو الكيد المتين تحف الله مع المخالفات وفيه سر عجيب للعارفين لو لا ما في إذاعته من الضرر في العموم لذكرناه وما كل ما يدرى يقال وليس خرق العوائد إلا أول مرة فإذا عاد ثانية صار عادة وأما في الحقيقة فالأمر جديد أبدا وما ثم ما يعود فما ثم خرق عادة وإنما هو أمر يظهر زي مثله لا عينه فلم يعد فما هو عادة فلو عاد لكان عادة وانحجب الناس عن هذه الحقيقة وقد نبهتك على ما هو الأمر عليه إن كنت تعقل ما أقول فالألوهة أوسع من أن تعيد ولكن الأمثال حجب على أعين العمي الذين يَعْلَمُونَ ظاهِراً من الْحَياةِ الدُّنْيا وهُمْ عَنِ الْآخِرَةِ وهو وجود عين المثل الثاني هُمْ غافِلُونَ ف هُمْ في لَبْسٍ من خَلْقٍ جَدِيدٍ فالممكنات غير متناهية والقدرة نافذة والحق خلاق فأين التكرار إذ لا يعقل إلا بالإعادة فالإعادة خرق العادة (انتهى النصف الأول من الجزء الثاني من الفتوحات المكية ويليه النصف الثاني أوله الباب السابع والثمانون ومائة في معرفة مقام المعجزة)\nالفتوحات المكية التي فتح الله بها على الشيخ الإمام العامل الراسخ الكامل خاتم الأولياء الوارثين برزخ البرازخ محيي الحق والدين أبي عبد الله محمد بن علي المعروف بابن عربي الحاتمي الطائي قدس الله روحه ونور ضريحه آمين بقية الجزء الثاني‏\nبسم الله الرحمن الرحيم‏\n\n",
    "en": "Chapter 186: Concerning the Gnosis of the Station of the Breaking of Norms (خرق العادات)\n\nThe breaking of norms (خرق العوائد) are divided categories,\nDelimited by intellectual contemplation (النظر الفكري).\nSome are specifically designated and established by The Real (الحق),\nSuch as miracles (المعجزات) restricted to the Prophetic mission.\nAnd what is other than these categories is subject to possibility,\nAnd Knowledge (العلم) has no fixed form in its designation.\nAll of them are clear in the Book of Allah,\nSo pause upon it, and you will find them inscribed therein:\nGlad tidings, sorcery, cunning (مكر), or its sign—\nAll of them are mentioned in the Book of Allah.\nThese are five categories confined for those who contemplate,\nAnd they are well-known in the cosmos (الأكوان).\n\n### [That the Breaking of Norms (خرق العادات) occurs in many ways]\n\nKnow that the station (مقام) of the breaking of norms (خرق العادات) occurs in many ways. Some of these are due to psychic powers (قوى نفسية), for the bodies of the world (أجرام العالم) are responsive to psychic aspirations (الهمم النفسية); thus has Allah Almighty established the matter concerning them. They may also be due to known natural artifices, such as talismans (الفلقطيرات) and the like, the category of which is known to scholars. They may be due to the arrangement of letters (حروف) according to astrological ascendants (طوالع), which is for the people of observation (أهل الرصد). They may also be through Names (أسماء) uttered by the one who remembers them, from which that action called the breaking of a norm appears, but only in the eye of the beholder, not in the reality of the matter (نفس الأمر). And they may occur in the reality of the matter (نفس الأمر) according to the power of that Name. All of these are under the capacity of the created being (المخلوق) by Allah’s establishment.\n\nFurthermore, there are breakings of norms (خرق عوائد) specific to the Divine Presence (الجناب الإلهي), in which the servant has neither agency nor power. Rather, Allah manifests them upon him, or they appear through him by the command and notification of Allah. These are of various levels (مراتب): some are called a miracle (معجزة), which has known conditions and a specific description; some are called a sign (آية), but not a miracle; some are a spiritual favor (كرامة); some are supportive (مؤيدة); some are awakening and motivating (منبهة وباعثة); some are a recompense (جزاء); and some are cunning (مكر) and gradual enticement (استدراج). All of these have signs known to the People of Allah (أهل الله), even though the recipients of the latter category may have no knowledge of the nature of the event, unlike the first category, who are aware of what issues from them.\n\nThere is nothing among what we mentioned in the second category—whose action is attributed to Allah Almighty—that is not subject to doubt as to whether it stems from Divine solicitude ('Inaya) or not, except for the miracle (المعجزة) and the sign (الآية), for these must necessarily stem from solicitude, confirming the truthfulness of the messenger. The supportive (المؤيدة) event is likewise. As for what is other than these two, possibility enters into it, as we mentioned.\n\nThen we return to what our path (طريقنا) dictates: the breaking of a norm (خرق العادة) in the saints (الأولياء) only occurs for one who has broken the norm within his own soul (نفسه), by removing it from the ruling of what its reality (حقيقتها) naturally yields. This includes its engagement in the permissible (المباح), or what Satan casts into it through adornment (التزيين), such as committing the forbidden (المحظور) or abandoning the obligatory (الواجب). So, whoever breaks this norm within his soul, Allah breaks a norm for him in the cosmos (الكون) through an event, whether it is called speech upon the inner thought (كلاما على الخاطر), walking in the air, or whatever it may be.\n\nWe have already mentioned the sections concerning these spiritual favors (كرامات), explained their levels (مراتب), and what produces them, in the book *Mawāqi‘ al-Nujūm* (The Settings of the Stars)—a work in which we were not preceded in our knowledge, meaning in its arrangement, not in the knowledge contained within it. It is a book of sound methodology, immense benefit, and small volume. We constructed it upon the principle of correspondence (المناسبة), for correspondence is the origin of the existence of the world (العالم), and the breaking of norms is part of the world.\n\nAllah has established His signs (آيات) in the world as both customary (معتادة) and non-customary (غير معتادة). The customary signs are only contemplated by the People of Understanding (أهل الفهم) specifically, who understand from Allah; those besides them have no knowledge of Allah’s Will concerning them. Allah has filled the Quran with customary signs: the alternation of night and day, the descent of rains, the emergence of vegetation, the sailing of ships upon the sea, the diversity of languages and colors, and sleep by night and day seeking bounty. Everything mentioned in the Quran as a sign is for a people who reflect (يَعْقِلُونَ), who hear (يَسْمَعُونَ), who understand (يَفْقَهُونَ), who believe (يُؤْمِنُونَ), who know (يَعْلَمُونَ), who are certain (يُوقِنُونَ), and who contemplate (يَتَفَكَّرُونَ). Despite all this, none of mankind pays heed to these signs except the People of Allah (أهل الله), who are the People of the Quran, Allah’s elect.\n\nAs for the non-customary signs, which are the breakings of norms (خرق العوائد), these are what affect the souls of the common people, such as earthquakes, tremors, eclipses, the speech of an animal, walking on water, traversing the air, informing of future events that occur exactly as foretold, speech upon inner thoughts (الخواطر), eating from the cosmos (الكون), and satisfying many people with little food. The common people regard these specifically.\n\nWhenever the breaking of a norm is not based on uprightness (استقامة), or is not an awakening and motivating factor for returning to Allah—and the person returns, having no agency in the event—then it is cunning (مكر) and gradual enticement (استدراج) from where he does not know. This is the firm plot (الكيد المتين) of Allah accompanying transgressions. It contains a marvelous secret for the Gnostics (العارفين); were it not for the general harm in disclosing it, we would have mentioned it. Not everything that is known can be said.\n\nThe breaking of norms (خرق العوائد) only occurs the first time; if it recurs a second time, it becomes a norm ('āda). However, in reality (الحقيقة), the matter is always new, and there is nothing that recurs. Therefore, there is no breaking of a norm. Rather, it is an event that appears in the guise of its like, not its exact self, so it has not recurred, and thus it is not a norm. If it had recurred, it would have been a norm. People are veiled from this Reality (الحقيقة). I have alerted you to the true state of the matter, if you comprehend what I am saying. For Divinity (الألوهة) is too vast to repeat, but similitudes (الأمثال) are veils over the eyes of the blind, those <<who know only the outward appearance of the life of this world, while they are heedless of the Hereafter>> (الْحَياةِ الدُّنْيا وهُمْ عَنِ الْآخِرَةِ هُمْ غافِلُونَ)—which is the existence of the exact self of the second similitude. Thus, <<they are in confusion concerning a new creation>> (ف هُمْ في لَبْسٍ من خَلْقٍ جَدِيدٍ). The possibilities (الممكنات) are infinite, the Power (القدرة) is effective, and The Real (الحق) is the Creator (خلاق). So where is repetition, since it is only conceived through recurrence? Thus, recurrence itself is the breaking of a norm (خرق العادة).\n\n(End of the first half of the second volume of *Al-Futūḥāt al-Makkiyya*. The second half follows, beginning with Chapter 187: Concerning the Gnosis of the Station of the Miracle [المعجزة]).\n\n*Al-Futūḥāt al-Makkiyya* (The Meccan Revelations), which Allah disclosed to the Shaykh, the Imam, the Practicing, the Firmly Rooted, the Perfect, the Seal of the Inheriting Saints (خاتم الأولياء الوارثين), the Isthmus of Isthmuses (برزخ البرازخ), Muḥyī al-Ḥaqq wa al-Dīn Abū ‘Abd Allāh Muḥammad ibn ‘Alī, known as Ibn Arabi al-Ḥātimī al-Ṭā’ī. May Allah sanctify his soul and illuminate his shrine. Amen. (Remainder of Volume Two).\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "(باب ایک سو چھیاسی: خرق عادات (عادات کا توڑنا) کے مقام کی معرفت میں)\n\nخرق عادات تقسیم شدہ اقسام ہیں،\nجنہیں فکری نظر نے محدود کر دیا ہے۔\n\nان میں سے کچھ حق (الحق) کے ذریعے معین اور قائم ہیں،\nجیسے کہ معجزات جو رسالت پر منحصر ہیں۔\n\nاور ان کے علاوہ دیگر اقسام میں احتمال پایا جاتا ہے،\nاور علم کے لیے ان کی تعیین میں کوئی صورت نہیں ہے۔\n\nاور یہ سب اللہ کی کتاب میں واضح ہیں،\nپس اس پر غور کرو تو تم انہیں اس میں لکھا ہوا پاؤ گے۔\n\n(یہ) بشارت، اور جادو، اور مکر، یا اس کی علامت ہے،\nاور یہ سب اللہ کی کتاب میں مذکور ہیں۔\n\nپس یہ پانچ اقسام ہیں جو دیکھنے والوں کے لیے محدود ہو گئیں،\nاور کائنات میں مشہور ہیں۔\n\n### [کہ خرق عادات کئی طریقوں پر ہیں]\n\nجان لو کہ خرق عادات (عادات کا توڑنا) کا مقام کئی طریقوں پر ہے، ان میں سے کچھ نفسانی قوتوں (قوى نفسية) کے ذریعے ہوتے ہیں، کیونکہ عالم کے اجسام نفسانی ہمتوں (همم نفسية) کے تابع ہو جاتے ہیں، اللہ تعالیٰ نے اس معاملے کو اسی طرح بنایا ہے۔ اور یہ معلوم طبعی حیلوں (حيل طبيعية) کے ذریعے بھی ہو سکتے ہیں، جیسے کہ طلسمات وغیرہ، اور ان کا باب علماء کے ہاں معلوم ہے۔ اور یہ حروف کو طوالع کے ساتھ منظم کرنے سے بھی ہو سکتے ہیں، اور یہ ماہرین فلکیات (أهل الرصد) کا کام ہے۔ اور یہ ایسے اسماء کے ذریعے بھی ہو سکتے ہیں جنہیں ان کا ذکر کرنے والا زبان سے ادا کرے، تو اس سے وہ فعل ظاہر ہوتا ہے جسے دیکھنے والے کی آنکھ میں خرق عادت کہا جاتا ہے، نہ کہ نفسِ امر میں۔ اور کبھی یہ نفسِ امر میں بھی اس اسم کی قوت کے مطابق ہو سکتا ہے۔ اور یہ سب اللہ کے بنائے ہوئے قانون کے تحت مخلوق کی قدرت میں ہیں۔\n\nاور پھر خرق عوائد (عادات کا توڑنا) وہ ہیں جو جناب الٰہی (الجناب الإلهي) کے ساتھ خاص ہیں، جن میں بندے کا کوئی عمل یا قوت نہیں ہوتی، لیکن اللہ انہیں اس پر ظاہر کرتا ہے یا وہ اللہ کے حکم اور اطلاع سے اس سے ظاہر ہوتے ہیں۔ اور یہ کئی مراتب پر ہیں: ان میں سے کچھ کو معجزہ کہا جاتا ہے، اور اس کی معلوم شرائط اور خاص وصف ہے۔ اور ان میں سے کچھ کو آیت (نشانی) کہا جاتا ہے، معجزہ نہیں۔ اور ان میں سے کچھ کرامت (كرامة) ہوتی ہے۔ اور ان میں سے کچھ مؤید (تائید کرنے والی) ہوتی ہے۔ اور ان میں سے کچھ تنبیہ کرنے والی اور ابھارنے والی ہوتی ہے۔ اور ان میں سے کچھ جزا ہوتی ہے۔ اور ان میں سے کچھ مکر اور استدراج (فریب اور ڈھیل) ہوتی ہے۔\n\nاور اہلِ اللہ (أهل الله) کے نزدیک ان سب کی علامات ہیں، باوجود اس کے کہ ان (اہلِ اللہ) کو ان میں سے کسی چیز کا علم نہیں ہوتا، برخلاف پہلی قسم کے، کیونکہ وہ جانتے ہیں کہ ان سے کیا صادر ہو رہا ہے۔ اور دوسری قسم میں، جس کا عمل اللہ تعالیٰ کی طرف منسوب ہے، جو کچھ بھی ہم نے ذکر کیا ہے، اس میں احتمال داخل ہوتا ہے کہ آیا یہ عنایت سے ہے یا عنایت کے بغیر، سوائے معجزہ اور آیت کے، کیونکہ یہ لازمی طور پر عنایت سے ہوتے ہیں، اور یہ خبر دینے والے کی سچائی کی دلیل ہیں، اور مؤید (تائید کرنے والی) بھی اسی طرح ہے۔ اور ان دونوں کے علاوہ میں احتمال داخل ہو سکتا ہے جیسا کہ ہم نے ذکر کیا۔\n\nپھر ہم اس طرف لوٹتے ہیں جس کا تقاضا ہمارا طریقہ کرتا ہے کہ اولیاء میں خرق عادت (عادات کا توڑنا) صرف اسی کے لیے ہوتا ہے جس نے اپنے نفس میں عادت کو توڑا ہو، اسے اس حکم سے نکال کر جو اس کی حقیقت دیتی ہے، اور وہ ہے مباح میں تصرف کرنا یا وہ جو شیطان زینت دے کر اس کی طرف ڈالتا ہے، یعنی ممنوع کا ارتکاب یا واجب کا ترک۔ پس جس نے اپنے نفس میں اس عادت کو توڑا، اللہ اس کے لیے کائنات میں عادت کو توڑ دیتا ہے، کسی ایسے امر کے ذریعے جسے خاطر (الخاطر) پر کلام کہا جاتا ہے، یا ہوا میں چلنا، یا جو کچھ بھی ہو۔\n\nاور ہم نے ان کرامات کے ابواب ذکر کیے ہیں اور ان کے مراتب اور ان کے نتائج کو کتاب *مواقع النجوم* میں بیان کیا ہے، جس میں ہم سے پہلے کسی نے ہمارے علم میں سبقت نہیں کی، یعنی اس کی ترتیب میں، نہ کہ اس کے علم میں۔ اور یہ صحیح طریقہ پر مبنی، عظیم فائدہ مند، چھوٹا حجم رکھنے والی کتاب ہے، جسے ہم نے مناسبت (المناسبة) پر بنایا ہے، کیونکہ مناسبت عالم کے وجود کی اصل ہے، اور خرق عوائد (عادات کا توڑنا) عالم میں سے ہے۔\n\nاور اللہ نے اپنی آیات (نشانیاں) عالم میں معتاد (عادی) اور غیر معتاد (غیر عادی) دونوں طرح کی بنائی ہیں۔ پس معتاد (عادی) آیات پر صرف وہی غور کرتے ہیں جو خاص طور پر اللہ سے سمجھ رکھتے ہیں، اور ان کے علاوہ کسی کو ان میں اللہ کے ارادے کا علم نہیں ہوتا۔ اور اللہ نے قرآن کو معتاد آیات سے بھر دیا ہے، جیسے رات اور دن کا اختلاف، بارشوں کا نزول، نباتات کا اگانا، سمندر میں کشتیوں کا چلنا، زبانوں اور رنگوں کا اختلاف، اور رات اور دن میں سونا تاکہ فضل تلاش کیا جائے۔ اور ہر وہ چیز جو قرآن میں آیت (نشانی) کے طور پر ذکر کی گئی ہے، وہ لِقَوْمٍ يَعْقِلُونَ (ان لوگوں کے لیے جو عقل رکھتے ہیں)، ويَسْمَعُونَ (اور سنتے ہیں)، ويَفْقَهُونَ (اور سمجھتے ہیں)، ويُؤْمِنُونَ (اور ایمان لاتے ہیں)، ويَعْلَمُونَ (اور جانتے ہیں)، ويُوقِنُونَ (اور یقین رکھتے ہیں)، ويَتَفَكَّرُونَ (اور غور و فکر کرتے ہیں) کے لیے ہے۔ اور اس سب کے باوجود، اہلِ اللہ (أهل الله) کے علاوہ کوئی بھی شخص اس پر توجہ نہیں دیتا، اور وہ خاص طور پر اللہ کے اہلِ قرآن ہیں۔\n\nاور جہاں تک غیر معتاد آیات کا تعلق ہے، جو کہ خرق عوائد (عادات کا توڑنا) ہیں، تو یہ وہ ہیں جو عام لوگوں کے نفوس پر اثر انداز ہوتی ہیں، جیسے زلزلے، لرزشیں، سورج گرہن، جانور کا بولنا، پانی پر چلنا، ہوا میں اڑنا، اور مستقبل میں ہونے والے واقعات کی اطلاع دینا جو بالکل اسی طرح واقع ہوں جیسا کہ اطلاع دی گئی، اور خواطر (الخواطر) پر کلام کرنا، اور کائنات سے کھانا، اور تھوڑے کھانے سے بہت سے لوگوں کو سیر کرنا۔ عام لوگ خاص طور پر اسی کو اہمیت دیتے ہیں۔\n\nاور جب خرق عادت (عادات کا توڑنا) استقامت (استقامة) کی وجہ سے نہ ہو، یا تنبیہ کرنے والا اور اللہ کی طرف رجوع پر ابھارنے والا نہ ہو، اور وہ رجوع کرتا ہو، اور اس میں اس کا کوئی عمل نہ ہو، تو یہ مکر اور استدراج (فریب اور ڈھیل) ہے جہاں سے اسے علم نہیں ہوتا۔ اور یہی وہ مضبوط تدبیر (الکید المتین) ہے جو اللہ نافرمانیوں کے ساتھ چھپاتا ہے۔ اور اس میں عارفین کے لیے ایک عجیب راز ہے، اگر اسے عام کرنے میں عمومی نقصان نہ ہوتا تو ہم اسے ضرور ذکر کرتے۔ اور ہر وہ چیز جو جانی جاتی ہے، کہی نہیں جاتی۔\n\nاور خرق عوائد (عادات کا توڑنا) صرف پہلی بار ہوتا ہے، پھر جب وہ دوسری بار لوٹتا ہے تو وہ عادت بن جاتا ہے۔ لیکن حقیقت میں، امر ہمیشہ نیا ہوتا ہے، اور کوئی چیز لوٹتی نہیں، لہٰذا کوئی خرق عادت (عادات کا توڑنا) نہیں ہے۔ بلکہ یہ ایک ایسا امر ہے جو اپنے جیسے کی صورت میں ظاہر ہوتا ہے، نہ کہ بعینہٖ وہی۔ پس وہ لوٹا نہیں، لہٰذا وہ عادت نہیں ہے۔ اگر وہ لوٹتا تو عادت بن جاتا۔ اور لوگ اس حقیقت سے پردہ میں ہیں۔ اور میں نے تمہیں اس امر پر متنبہ کر دیا ہے جو حقیقت میں ہے، اگر تم میری بات کو سمجھتے ہو۔ پس الوہیت (الألوهة) اس سے کہیں زیادہ وسیع ہے کہ وہ کسی چیز کو دہرائے، لیکن مثالیں ان اندھوں کی آنکھوں پر پردہ ہیں جو يَعْلَمُونَ ظاهِراً من الْحَياةِ الدُّنْيا (دنیا کی زندگی کا صرف ظاہری پہلو جانتے ہیں) اور وهُمْ عَنِ الْآخِرَةِ (اور وہ آخرت سے) – جو کہ عین دوسرے مثل کا وجود ہے – هُمْ غافِلُونَ (غافل ہیں)۔ ف هُمْ في لَبْسٍ من خَلْقٍ جَدِيدٍ (پس وہ ایک نئی تخلیق کے بارے میں شک میں ہیں)۔ پس ممکنات (الممكنات) غیر متناہی ہیں، اور قدرت نافذ ہے، اور الحق (ذات حق) ہمیشہ خالق ہے۔ تو تکرار کہاں ہے، جبکہ تکرار کا تصور اعادہ (دہرانے) کے بغیر نہیں کیا جا سکتا؟ پس اعادہ ہی خرق عادت (عادات کا توڑنا) ہے۔\n\n(الفتوحات المکیہ کے دوسرے جزء کا پہلا نصف مکمل ہوا، اور اس کے بعد دوسرا نصف شروع ہوتا ہے جس کا پہلا باب ایک سو ستاسی معجزہ کے مقام کی معرفت میں ہے۔)\n\nالفتوحات المکیہ جو اللہ نے شیخ، امام، عامل، راسخ، کامل، خاتم الاولیاء الوارثین، برزخ البرازخ، محی الحق والدین، ابو عبداللہ محمد بن علی المعروف بہ ابن عربی الحاتمی الطائی پر کھولیں، اللہ ان کی روح کو پاک کرے اور ان کی قبر کو منور کرے، آمین۔ (جزء دوم کا بقیہ حصہ)\n\nشروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
    "fa": "## (باب صد و هشتاد و ششم در معرفت مقام خرق عادات)\n\n> خرق عادات، بخش‌هایی تقسیم شده‌اند *** که نظر فکری آن‌ها را محدود کرده است\n\n> برخی از آن‌ها به واسطه حق (الحق) معین و قائم هستند *** مانند معجزاتی که به رسالت محدود شده‌اند\n\n> و آنچه غیر از این بخش‌هاست، محتمل است *** و علم در تعیین آن صورتی ندارد\n\n> و همه آن‌ها در کتاب خدا آشکارند *** پس بر آن توقف کن تا آن‌ها را در آنجا نگاشته بیابی\n\n> بشارت، سحر، مکر یا علامت آن *** و همه آن‌ها در کتاب خدا ذکر شده‌اند\n\n> پس این‌ها پنج بخش هستند که محدود شده‌اند *** برای ناظران و در هستی‌ها (الأکوان) مشهورند\n\n### [اینکه خرق عادات بر وجوه بسیاری است]\n\nبدان که مقام خرق عادات بر وجوه بسیاری است. برخی از آن‌ها ناشی از قوای نفسانی هستند، زیرا اجرام عالم تحت تأثیر همت‌های نفسانی قرار می‌گیرند؛ خداوند امر را در آن‌ها چنین قرار داده است. و گاهی ممکن است ناشی از حیله‌های طبیعی معلوم باشد، مانند طلسمات (الفلقطيرات) و غیره، که باب آن نزد دانشمندان معلوم است. و گاهی ممکن است به واسطه نظم حروف با طوالع باشد، که مخصوص اهل رصد است. و گاهی به واسطه اسم‌هایی است که ذاکر آن‌ها را بر زبان می‌آورد و آن فعل که خرق عادت نامیده می‌شود، در چشم بیننده ظاهر می‌گردد، نه در نفس امر. و گاهی در نفس امر است به اندازه قوت آن اسم. و همه این‌ها تحت قدرت مخلوق است به جعل الهی. و سپس خرق عاداتی وجود دارد که مختص به جناب الهی است و بنده در آن هیچ تصرف و قوتی ندارد، بلکه خداوند آن‌ها را بر او ظاهر می‌سازد یا به امر و اعلام خداوند از او ظاهر می‌شوند. و این‌ها بر مراتبی هستند: برخی از آن‌ها معجزه نامیده می‌شوند و دارای شروط و وصف خاص معلومی هستند؛ و برخی از آن‌ها آیه نامیده می‌شوند نه معجزه؛ و برخی کرامت هستند؛ و برخی مؤید (تأیید کننده) هستند؛ و برخی منبه (هشدار دهنده) و باعث (برانگیزاننده) هستند؛ و برخی جزا هستند؛ و برخی مکر و استدراج هستند. و همه این‌ها نزد اهل الله علاماتی دارند، با وجود اینکه این افراد (اهل الله) از هیچ یک از این امور علمی ندارند، برخلاف صنف اول که بر آنچه از آن‌ها صادر می‌شود، علم دارند. و هیچ یک از آنچه در صنف دوم ذکر کردیم که عملش به خداوند تعالی اضافه می‌شود، نیست مگر اینکه احتمال در آن وارد می‌شود که آیا از عنایت است یا نه، مگر معجزه و آیه، که قطعاً از عنایت هستند و باید صدق مخبر باشند. و مؤیده نیز چنین است. و غیر از این دو، احتمال در آن‌ها راه می‌یابد، همانطور که ذکر کردیم. سپس به آنچه طریق ما اقتضا می‌کند باز می‌گردیم: خرق عادت در اولیا تنها برای کسی رخ می‌دهد که عادت را در نفس خود شکسته باشد، به این صورت که نفس را از حکم آنچه حقیقتش اقتضا می‌کند خارج سازد، یعنی تصرف آن در مباح یا آنچه شیطان با زینت‌بخشی از ارتکاب محظور یا ترک واجب به آن القا می‌کند. پس کسی که این عادت را در نفس خود بشکند، خداوند عادتی را در هستی (الکون) برای او می‌شکند، به واسطه امری که کلام بر خاطر (الخاطر) نامیده می‌شود، یا راه رفتن در هوا، یا هر چیز دیگری. و ما فصول این کرامات را ذکر کرده‌ایم و مراتب آن‌ها و آنچه را که نتیجه می‌دهند، در کتاب \"مواقع النجوم\" بیان کرده‌ایم، که هیچ کس در علم ما بر ما سبقت نگرفته است، منظورم در ترتیب آن است نه در علم به محتوای آن. و آن کتابی است صحیح الطریق، عظیم الفائده و کوچک حجم. ما آن را بر اساس مناسبت بنا نهادیم، زیرا مناسبت اصل وجود عالم است و خرق عادات از عالم است. و خداوند آیات خود را در عالم، معتاد و غیر معتاد قرار داده است. پس آیات معتاد را جز اهل فهم از جانب خداوند، کسی در نظر نمی‌گیرد، و غیر از آن‌ها علمی به اراده خداوند در آن ندارند. و خداوند قرآن را از آیات معتاد پر کرده است، از اختلاف شب و روز، نزول باران‌ها، خارج ساختن گیاهان، حرکت کشتی‌ها در دریا، اختلاف زبان‌ها و رنگ‌ها، و خوابیدن در شب و روز برای طلب فضل. و هر آنچه در قرآن ذکر شده که آیه است: **لِقَوْمٍ يَعْقِلُونَ** (برای گروهی که تعقل می‌کنند) و **يَسْمَعُونَ** (می‌شنوند) و **يَفْقَهُونَ** (می‌فهمند) و **يُؤْمِنُونَ** (ایمان می‌آورند) و **يَعْلَمُونَ** (می‌دانند) و **يُوقِنُونَ** (یقین دارند) و **يَتَفَكَّرُونَ** (تفکر می‌کنند). با وجود همه این‌ها، هیچ کس از مردم به آن توجهی نمی‌کند مگر اهل الله، و آن‌ها خاصان اهل قرآن هستند. اما آیات غیر معتاد، که همان خرق عادات هستند، آن‌هایی هستند که در نفوس عوام تأثیر می‌گذارند، مانند زلزله‌ها، لرزش‌ها، کسوف، سخن گفتن حیوان، راه رفتن بر آب، عبور از هوا، و خبر دادن از حوادث آینده که دقیقاً مطابق با آنچه خبر داده شده، رخ می‌دهد، و سخن گفتن بر خواطر، و خوردن از هستی (الکون)، و سیر کردن تعداد زیادی از مردم با غذای کم. این‌ها را عوام به طور خاص در نظر می‌گیرند. و هرگاه خرق عادت ناشی از استقامت نباشد، یا منبه و برانگیزاننده به بازگشت به سوی خداوند نباشد و شخص بازگردد و در آن تصرفی نداشته باشد، آن مکر و استدراج است از جایی که نمی‌داند. و این همان کید متین (مکر محکم) است که خداوند با مخالفات همراه می‌سازد. و در آن سری عجیب برای عارفان است که اگر ضرری در افشای آن برای عموم نبود، آن را ذکر می‌کردیم. و نه هر آنچه دانسته می‌شود، گفته می‌شود. و خرق عادات تنها بار اول است، پس اگر بار دوم تکرار شود، عادت می‌گردد. اما در حقیقت، امر همیشه جدید است و چیزی نیست که بازگردد. پس خرق عادتی وجود ندارد، بلکه امری ظاهر می‌شود که شبیه آن است نه عین آن. پس بازنگشته است و عادت نیست. اگر باز می‌گشت، عادت می‌شد. و مردم از این حقیقت محجوب شده‌اند. و من تو را بر آنچه امر بر آن است، آگاه ساختم، اگر آنچه می‌گویم را تعقل کنی. زیرا الوهیت گسترده‌تر از آن است که تکرار کند، اما امثال، حجاب‌هایی بر چشمان کورانی هستند که **يَعْلَمُونَ ظاهِراً من الْحَياةِ الدُّنْيا وهُمْ عَنِ الْآخِرَةِ** (ظاهری از زندگی دنیا را می‌دانند و آن‌ها از آخرت) که همان وجود عین مثل دوم است، **هُمْ غافِلُونَ** (غافل هستند). پس **هُمْ في لَبْسٍ من خَلْقٍ جَدِيدٍ** (آن‌ها در اشتباهی از خلق جدید هستند). پس ممکنات نامتناهی هستند و قدرت نافذ است و حق (الحق) همواره خالق است. پس تکرار کجاست، در حالی که تکرار تنها با اعاده قابل تصور است؟ پس اعاده، خرق عادت است. (پایان نیمه اول از جزء دوم فتوحات مکیه و به دنبال آن نیمه دوم است که آغاز آن باب صد و هشتاد و هفتم در معرفت مقام معجزه است)\n\nالفتوحات المکیه که خداوند آن را بر شیخ، امام عامل، راسخ، کامل، خاتم اولیای وارثین، برزخ البرازخ، محیی الحق و الدین، ابوعبدالله محمد بن علی معروف به ابن عربی حاتمی طائی گشود. قدس الله روحه و نور ضریحه آمین. بقیه جزء دوم.\n\nبسم الله الرحمن الرحیم."
  },
  "page_count": 4
}