{
  "id": 500,
  "title": {
    "ar": "الباب الموفي خمسمائة في معرفة حال قطب كان منزله ومن يَقُلْ مِنْهُمْ إِنِّي إِلهٌ من دُونِهِ فَذلِكَ نَجْزِيهِ جَهَنَّمَ أي نرده إلى أصله وهو البعد يقال بئر جهنام إذا كانت بعيدة القعر",
    "en": "Chapter Five Hundred: Concerning the Knowledge of the State of a Pole (قطب) whose Station (منزله) is defined by the verse: <<وَمَن يَقُلْ مِنْهُمْ إِنِّي إِلَٰهٌ مِّن دُونِهِ فَذَٰلِكَ نَجْزِيهِ جَهَنَّمَ>> (And whoever of them says, 'Indeed, I am a god besides Him' - that one We will recompense with Hell), meaning We return him to his origin, which is remoteness (البعد). It is said that a well is *jahnam* if it is deep-bottomed.",
    "ur": "پانچ سوواں باب: قطب (قطب) کے حال کی معرفت (معرفت) میں، جس کا مقام اس آیت سے متعلق تھا: \"اور ان میں سے جو کوئی کہے کہ میں اس کے سوا معبود ہوں، تو ہم اسے جہنم کی سزا دیں گے۔\" (الانبیاء ۲۱:۲۹) یعنی ہم اسے اس کی اصل کی طرف لوٹا دیں گے جو کہ دوری (بعد) ہے۔ کہا جاتا ہے کہ کنواں جہنام (جهنام) ہے جب وہ گہرے پیندے والا ہو۔",
    "fa": "باب پانصدم در معرفت حال قطبی که منزل او [این آیه] بود: «وَمَن يَقُلْ مِنْهُمْ إِنِّي إِلَهٌ مِّن دُونِهِ فَذَلِكَ نَجْزِيهِ جَهَنَّمَ» (و هر کس از ایشان بگوید: «من معبودی جز او هستم»، او را به جهنم جزا می‌دهیم)؛ یعنی او را به اصلش که دوری (بعد) است باز می‌گردانیم. گفته می‌شود چاه «جهنام» هنگامی که عمیق‌القعر باشد."
  },
  "content": {
    "ar": "## «الباب الموفي خمسمائة في معرفة حال قطب كان منزله ومن يَقُلْ مِنْهُمْ إِنِّي إِلهٌ من دُونِهِ فَذلِكَ نَجْزِيهِ جَهَنَّمَ أي نرده إلى أصله وهو البعد يقال بئر جهنام إذا كانت بعيدة القعر»\n\n\n> من يقل إني إله *** فكلام ليس يصدق‏\n\n\n> أو يقل إني خلق *** لحقيقة التخلق‏\n\n\n> فهما سيان فيه *** هكذا يعطي التحقق‏\n\n\n> والذي ليس له *** ذان له حال التعلق‏\n\n\n> فله الجمع المسمى *** مثل ما له التفرق‏\n\n\n### [من كان جزاؤه جهنم فهو في غاية البعد عن السعادة]\n\n\nقال الله عز وجل إِنَّ جَهَنَّمَ كانَتْ مِرْصاداً لِلطَّاغِينَ مَآباً إِنَّ رَبَّكَ لَبِالْمِرْصادِ فحقق وانظر تعثر والله الموفق فحصلوا في نقيض دعواهم فإن الطاغي المرتفع طغى الماء إذا ارتفع يقول الله تعالى إِنَّا لَمَّا طَغَى الْماءُ حَمَلْناكُمْ في الْجارِيَةِ فمن قال إني إله فقد جعل نفسه في غاية القرب فأخبر الله أن جزاء هذا القائل يكون غاية البعد عن سعادته إذ كان جزاؤه جهنم فينزل إلى قعرها من طغى إلى الألوهة التي لها الاستواء على العرش بالاسم الرحمن واعلم أنه ما في علمي إن أحدا يقع منه هذا القول وهو يجوع ويمرض ويغوط وأمثال هذا إلا فرعون لما فَاسْتَخَفَّ قَوْمَهُ قال يا أَيُّهَا الْمَلَأُ ما عَلِمْتُ لَكُمْ من إِلهٍ غَيْرِي ثم جعل ذلك ظنا بعد شك أو إثباتا في قوله فَأَطَّلِعَ إِلى‏ إِلهِ مُوسى‏ وإِنِّي لَأَظُنُّهُ كاذِباً وأما القائلون بأن الله هُوَ الْمَسِيحُ ابْنُ مَرْيَمَ فما هم في حكم هذا الذكر لأمرين الأمر الواحد إنهم فرقوا بين الناسوت واللاهوت والقائل بهذا الذكر لا يفرق والأمر الثاني إنما يدل هذا الذكر على من قال عن نفسه ذلك لا من قيل عنه والذي ينتج هذا الذكر لصاحبه أحد أمرين أو كلاهما الأمر الواحد أحدية هذا القائل في الألوهة فيكون العالم كله عند صاحب هذا الذكر عين الحق فله أحدية الكثرة كما لغيره أحدية كثرة الأسماء الإلهية وتكون الكثرة في النسب والأحكام لا في العين والعالم كله عنده عرض عرض لهذه العين من أعيان الممكنات الثابتة التي لا يصح لها وجود والأمر الآخر أن يكون قوله من دونه نزولا عن المرتبة التي لله وهذا مثل قولهم ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏ فهو وإن كان أنزل منه في الرتبة فهو عنده إنه إله فيكون هذا القائل إذا كان صاحب هذا الذكر يرى أن تجلى الحق في الصور أنزل منه لو تجلى في كونه غنيا عن العالمين فلو صح هناك تجل لكان أكمل من تجليه في الصور فتعقل رتبة غناه عن العالم بنفسه وقد يكون هذا لمن يراه عين العالم فعلامته هويته فهو الدليل له عليه كقوله أعوذ بك منك واستعاذ به منه إذ لا مقابل له غير ذاته فهو المعز المذل ثم هنا تنبيه إلهي حيث قرن هذا الحال بالقول لا بالعلم والحسبان فإن قال ما نظن أنه قد علم إن الأمر كذا فتخيل إن قوله مطابق لعلمه وهذا يستحيل وقوعه من أحد علما لعلمه بذلته وافتقاره وقصوره في نفسه فإذا قال مثل هذا وهو يعلم قصوره فيقولها بوجه لا يقع عليه فيه مؤاخذة ويكون جزاؤه على هذا القول جهنم أي بعده في نفسه عما يقول به على لسانه وهو خير جزاء لأنه علم ويكون كَذلِكَ نَجْزِي الظَّالِمِينَ جزاء الظالم الذي ورث الكتاب من المصطفين فإن الله أطلق على بعض الورثة اسم الظالم مع كونه من أهل الحق فيتخصص الظالم هنا كما تخصص في قوله ولَمْ يَلْبِسُوا إِيمانَهُمْ بِظُلْمٍ وهو ظلم خاص مع كونه نكرة فهو نكرة عند السامع لا عند المتكلم به ولهذا فسره رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بأنه الشرك خاصة\n\n\nفمثل هذا الهجير يكون موجها فيما ينتج‏\nلأنه في وضعه على ذلك فيأخذ كل صاحب وجه منه بنصيب لأنه صالح لذلك وكل آية في الهجيرات إنما تؤخذ على انفرادها كما سطرت وعند أهل التحقيق هذا المأخذ وإن كان عالي الأوج فإن مسمى الآية إذا لزمتها أمور من قبل أو بعد يظهر من قوة الكلام إن الآية تطلب تلك اللوازم فلا تكمل الآية إلا بها وهو نظر الكامل من الرجال فمن ينظر في كلام الله على هذا النمط فإنه يفوز بعلم كبير وخير كثير كما تقول في بِسْمِ الله الرَّحْمنِ الرَّحِيمِ إنها آية مستقلة وتقول فيها في سورة النمل إنها جزء آية فلا كمال لها في الآي إلا بزيادة فاعلم أنه كما لِكُلِّ أَجَلٍ كِتابٌ كذلك لكل عمل جزاء والقول عمل فله جزاء إن الله عند لسان كل قائل وليس بعد الخواطر أسرع عملا منه أعني من اللسان فالقول أسرع الأعمال ولا يتولى حساب صاحبه إلا أسرع الحاسبين لأن متولي الحساب على الأعمال من الأسماء الإلهية ما يناسب ذلك العمل إن فهمت والله بِكُلِّ شَيْ‏ءٍ عَلِيمٌ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "The Chapter Completing Five Hundred, concerning the knowledge of the state of a Pole (*Qutb*) whose station was [related to the verse]: <<and whoever among them says, 'Indeed, I am a god besides Him'—that one We shall recompense with Hell (Jahannam)>>. That is, We return him to his origin, which is distance (*al-bu'd*). It is said, 'A well is *jahnam*' if it is deep-bottomed (far in depth).\n\nWhoever says, \"I am a god,\"\nthat is speech that is not truthful.\n\nOr says, \"I am a creature,\"\nfor the Reality of self-creation.\n\nBoth are equal in Him,\nthus Gnosis (*al-taḥaqquq*) grants this understanding.\n\nAnd he who does not possess\nthese two has the state of dependence (*al-ta'alluq*).\n\nFor him is the named Gathering (*al-jam’*),\njust as for him is the separation (*al-tafarruq*).\n\n[Whoever is recompensed with Hell (Jahannam) is in the utmost distance from Felicity (Sa'ada)]\n\nAllah Almighty said: <<Indeed, Hell (Jahannam) has been an observation post (mirṣād), a return for the transgressors (al-ṭāghīn)>> [and] <<Indeed, your Lord is in observation (la-bil-mirṣād)>>. Therefore, verify and look, lest you stumble, and Allah is the Granter of Success. Thus, they found themselves in the opposite of their claim. For the transgressor (*al-ṭāghī*) is the one who rises up, just as water *ṭaghā* (transgressed/rose) when it became high. Allah the Exalted says: <<Indeed, when the water transgressed (ṭaghā), We carried you upon the running [ship]>>.\n\nSo, whoever says, \"I am a god,\" has placed himself in the utmost proximity. Yet Allah informs us that the recompense of this speaker will be the utmost distance from his felicity, since his recompense is Hell (Jahannam). He descends to its depth because he transgressed (*ṭaghā*) toward the Divinity (al-Ulūhiyya) which possesses the establishment (al-Istiwā’) upon the Throne by the Name *al-Raḥmān* (The All-Merciful).\n\nKnow that, to my knowledge, no one makes this statement while simultaneously experiencing hunger, sickness, excretion, and similar things—except Pharaoh, when <<he made his people lightheaded (fāstakhaffa qawmahu)>> and said: <<O assembly, I do not know of any god for you other than me>>. Then he made that a mere conjecture after doubt, or an affirmation, in his saying: <<that I may look upon the God of Moses, and indeed, I think he is a liar>>.\n\nAs for those who say that <<Allah is the Messiah, son of Mary>>, they are not subject to the ruling of this mention, due to two matters. The first matter is that they differentiate between the Humanity (*Nāsūt*) and the Divinity (*Lāhūt*), whereas the speaker of the statement mentioned [in the verse] does not differentiate. The second matter is that this mention only refers to one who said that about himself, not one about whom it was said.\n\nThat which results from this mention for its speaker is one of two matters, or both of them. The first matter is the speaker’s Unity (*Aḥadiyya*) in Divinity (al-Ulūhiyya). In this case, the entire World (*al-’Ālam*) is, for the speaker of this mention, the very Essence of the Real (*‘Ayn al-Ḥaqq*). Thus, he possesses the Unity of Multiplicity (*Aḥadiyyat al-Kathra*), just as others possess the Unity of the Multiplicity of the Divine Names (al-Asmā’ al-Ilāhiyya). The multiplicity exists in the relations and rulings, not in the Essence (*al-’Ayn*). The entire World, in his view, is an accident (*‘araḍ*) that appears to this Essence from the Fixed Entities of the Possibles (*al-A’yān al-Mumkināt al-Thābita*) which cannot properly possess existence.\n\nThe other matter is that his saying \"besides Him\" (*min dūnihi*) constitutes a descent from the Level (*al-Martaba*) that belongs to Allah. This is similar to the saying of [the idolaters]: <<We only worship them that they may bring us nearer to Allah in proximity (zulfā)>>. Although [the claimed god] is lower than Him in rank, the speaker considers him a god. Thus, if this speaker is the master of this mention, he sees that the Self-disclosure (*Tajallī*) of the Real (*al-Ḥaqq*) in forms is lower than if He were to disclose Himself in His state of being Independent of the Worlds. If a Self-disclosure were valid there [in the state of Independence], it would be more perfect than His Self-disclosure in forms. Therefore, understand the rank of His Independence from the World by His very Essence (*Dhāt*).\n\nThis may also apply to one who sees Him as the very Essence of the World (*‘Ayn al-’Ālam*). His sign (*‘alāma*) is His Identity (*Huwiyya*). He is thus the proof for Himself upon Himself, like the saying: \"I seek refuge in You from You,\" seeking refuge in Him from Him, since there is no opposite to Him other than His own Essence (*Dhāt*). He is The Giver of Honor (*al-Mu’izz*), The Humiliator (*al-Mudhill*).\n\nFurthermore, there is a Divine warning here, where this state is linked to the statement (*al-qawl*), not to knowledge (*al-’ilm*) or conjecture (*al-ḥusbān*). If one says, \"We do not think that he knew the matter was such,\" then imagine that his statement corresponds to his knowledge. This is impossible for anyone to assert based on knowledge, due to his knowledge of his own lowliness, need, and inherent deficiency. If he says something like this while knowing his deficiency, he says it in a manner for which he incurs no blame. His recompense for this statement is Hell (Jahannam)—meaning, his internal distance from what he pronounces with his tongue. This is the best recompense, because it is knowledge.\n\nAnd it is <<Thus We recompense the wrongdoers (al-ẓālimīn)>>—the recompense of the wrongdoer who inherited the Book from the Chosen Ones (*al-Muṣṭafīn*). For Allah applied the name *al-ẓālim* (the wrongdoer) to some of the inheritors, despite their being among the People of the Real (*Ahl al-Ḥaqq*). Thus, the term *al-ẓālim* is specialized here, just as it was specialized in His saying: <<and have not mixed their faith with wrongdoing (ẓulm)>>. This is a specific wrongdoing, even though it is indefinite [in the Arabic grammar]. It is indefinite to the listener, but not to the speaker of it. For this reason, the Messenger of Allah (peace and blessings be upon him) interpreted it specifically as polytheism (*al-shirk*).\n\nA statement (*al-hajīr*) such as this must be directed toward what it produces, because it is placed in that context. Thus, every person of insight takes a share from it, because he is fit for that. Every verse concerning these statements is taken individually, just as it was written. However, according to the People of Gnosis (*Ahl al-Taḥqīq*), even though this approach is highly elevated, if the meaning of the verse requires matters preceding or following it, the strength of the discourse reveals that the verse demands those necessary connections. The verse is not complete without them. This is the perspective of the Perfect Men (*al-Kāmil min al-Rijāl*). Whoever looks at the Word of Allah in this manner will attain great knowledge and abundant good.\n\nJust as you say regarding <<In the Name of Allah, the Most Compassionate, the Most Merciful (Bismi Llāhi r-Raḥmāni r-Raḥīm)>> that it is an independent verse, yet you say regarding it in Sūrat al-Naml that it is part of a verse, and thus its completeness among the verses requires an addition. Know that just as <<for every term there is a decree (kitāb)>>, likewise for every action there is a recompense. Speech (*al-qawl*) is an action, and thus it has a recompense. Indeed, Allah is present at the tongue of every speaker. Nothing is faster in action after the inner thoughts (*al-khawāṭir*) than it—meaning, the tongue. Thus, speech is the fastest of actions, and only the Swiftest of Reckoners (*Asra’ al-Ḥāsibīn*) undertakes the reckoning of its speaker, because the one who undertakes the reckoning of actions, among the Divine Names (*al-Asmā’ al-Ilāhiyya*), is that which is appropriate for that action, if you understand. <<And Allah is All-Knowing of everything>>. <<And Allah speaks the Truth, and He guides to the Way>>.",
    "ur": "پانچ سوواں باب: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا (اور ان میں سے جو کوئی کہے کہ میں اس کے سوا کوئی اور معبود ہوں، تو ہم اسے جہنم کی سزا دیں گے) [سورۃ الأنبیاء: ۲۹] یعنی ہم اسے اس کی اصل کی طرف لوٹا دیں گے جو کہ دوری (بعد) ہے۔ کہا جاتا ہے کہ \"بئر جہنام\" (جہنم کا کنواں) جب وہ گہرا ہو۔\n\nجو کہے کہ میں معبود ہوں\nتو یہ بات سچی نہیں ہے\n\nیا جو کہے کہ میں مخلوق ہوں\nتخلیق کی حقیقت کے لیے\n\nتو وہ دونوں اس میں برابر ہیں\nتحقق (At-Taḥaqquq) اسی طرح عطا کرتا ہے\n\nاور جس کے لیے یہ دونوں نہیں ہیں\nاس کے لیے تعلق (At-Ta‘alluq) کی حالت ہے\n\nتو اس کے لیے وہ مسمیٰ جمع (Al-Jam‘) ہے\nجیسا کہ اس کے لیے تفرق (At-Tafarruq) ہے۔\n\n[جس کی سزا جہنم ہو، وہ سعادت سے انتہائی دوری پر ہے]\n\nاللہ عز و جل نے فرمایا: (بیشک جہنم گھات میں ہے، سرکشوں کے لیے ٹھکانہ ہے) [سورۃ النبأ: ۲۱-۲۲] (بیشک آپ کا رب ضرور گھات میں ہے) [سورۃ الفجر: ۱۴] پس تحقیق کرو اور دیکھو، تم ٹھوکر کھاؤ گے، اور اللہ ہی توفیق دینے والا ہے۔ پس وہ اپنی دعوے کے برعکس حالت میں جا پڑے۔ کیونکہ طغیان کرنے والا (طاغی) وہ ہے جو بلند ہو، جیسے پانی طغیانی کرتا ہے جب وہ بلند ہوتا ہے۔ اللہ تعالیٰ فرماتا ہے: (بیشک جب پانی نے طغیانی کی تو ہم نے تمہیں چلنے والی کشتی میں سوار کیا) [سورۃ الحاقہ: ۱۱] پس جس نے کہا کہ میں معبود ہوں، اس نے اپنے آپ کو انتہائی قرب میں رکھا، تو اللہ نے خبر دی کہ اس کہنے والے کی سزا اس کی سعادت سے انتہائی دوری ہوگی، کیونکہ اس کی سزا جہنم (Jahannam) ہے، پس وہ اس کی گہرائی میں اترے گا جو اس الوہیت کی طرف طغیانی کرتا ہے جس کے لیے اسمِ رحمن کے ذریعے عرش پر استواء ہے۔\n\nاور جان لو کہ میرے علم میں کوئی ایسا شخص نہیں ہے جس سے یہ قول صادر ہوا ہو جبکہ وہ بھوک محسوس کرتا ہو، بیمار ہوتا ہو، رفع حاجت کرتا ہو اور اس جیسی دیگر چیزیں، سوائے فرعون کے، جب اس نے (اپنی قوم کو ہلکا سمجھا) [سورۃ الزخرف: ۵۴] اور کہا: (اے دربار والو! میں تمہارے لیے اپنے سوا کسی معبود کو نہیں جانتا) [سورۃ القصص: ۳۸] پھر اس نے اس بات کو شک کے بعد گمان یا اثبات بنا دیا اپنے اس قول میں: (تاکہ میں موسیٰ کے معبود کو جھانک لوں) [سورۃ غافر: ۳۷] اور (بیشک میں اسے جھوٹا گمان کرتا ہوں) [سورۃ القصص: ۳۷]۔ اور جہاں تک ان لوگوں کا تعلق ہے جو کہتے ہیں کہ (اللہ ہی مسیح ابن مریم ہے) [سورۃ المائدہ: ۱۷] تو وہ اس ذکر کے حکم میں نہیں آتے، دو وجوہات کی بنا پر: پہلی وجہ یہ کہ انہوں نے ناسوت (بشریت) اور لاہوت (الوہیت) کے درمیان فرق کیا، جبکہ اس ذکر کا قائل فرق نہیں کرتا۔ دوسری وجہ یہ کہ یہ ذکر صرف اس شخص پر دلالت کرتا ہے جس نے یہ بات اپنے بارے میں کہی ہو، نہ کہ اس کے بارے میں کہی گئی ہو۔\n\nاور جو چیز اس ذکر کو اس کے قائل کے لیے نتیجہ خیز بناتی ہے، وہ دو چیزوں میں سے ایک یا دونوں ہیں: پہلی چیز یہ کہ اس قائل کی الوہیت میں احدیت (Aḥadiyyah) ہو۔ پس اس ذکر کے قائل کے نزدیک سارا عالم عین ذات حق (Al-Ḥaqq) ہو، تو اس کے لیے کثرت کی احدیت (Aḥadiyyah) ہے، جیسا کہ دوسروں کے لیے اسماء الٰہیہ کی کثرت کی احدیت ہے۔ اور کثرت نسبتوں اور احکام میں ہوگی نہ کہ عین (ذات) میں۔ اور سارا عالم اس کے نزدیک ایک عرض (Accident) ہے جو ممکنات ثابتہ کے ان اعیان (Essences) کے لیے عارض ہوا ہے جن کا وجود صحیح نہیں ہے۔ دوسری چیز یہ کہ اس کا قول \"اس کے سوا\" اس مرتبے سے نیچے اترنا ہو جو اللہ کے لیے ہے۔ اور یہ ان کے اس قول کی طرح ہے: (ہم ان کی عبادت صرف اس لیے کرتے ہیں کہ وہ ہمیں اللہ کے قریب کر دیں) [سورۃ الزمر: ۳] پس اگرچہ وہ مرتبے میں اس سے نیچے ہے، لیکن اس کے نزدیک وہ معبود ہے۔ تو یہ قائل، اگر وہ اس ذکر کا حامل ہے، یہ دیکھتا ہے کہ ذات حق (Al-Ḥaqq) کا ظہور الٰہی (At-Tajallī) صورتوں میں اس سے کم تر ہے اگر وہ عالمین سے بے نیاز ہونے کی حالت میں ظہور الٰہی (At-Tajallī) کرتا۔ پس اگر وہاں ظہور الٰہی (At-Tajallī) صحیح ہوتا تو وہ صورتوں میں ظہور الٰہی (At-Tajallī) سے زیادہ کامل ہوتا۔ پس تم اس کے عالم سے اپنی ذات کے ذریعے بے نیاز ہونے کے مرتبے کو سمجھو۔ اور یہ اس شخص کے لیے بھی ہو سکتا ہے جو اسے عین عالم دیکھتا ہے، پس اس کی علامت اس کی ہویت (Identity) ہے، تو وہ اس کے لیے اس پر دلیل ہے، جیسا کہ اس کا قول: \"میں تیری پناہ مانگتا ہوں تجھ سے\" اور اس نے اس سے اس کی پناہ مانگی، کیونکہ اس کی ذات کے سوا اس کا کوئی مقابل نہیں ہے۔ پس وہی عزت دینے والا اور ذلت دینے والا ہے۔\n\nپھر یہاں ایک الٰہی تنبیہ ہے، جہاں اس حال کو قول کے ساتھ جوڑا گیا ہے نہ کہ علم اور گمان کے ساتھ۔ اگر اس نے کہا کہ ہم نہیں سمجھتے کہ اس نے جان لیا ہے کہ معاملہ ایسا ہے، تو یہ تصور کیا جائے گا کہ اس کا قول اس کے علم کے مطابق ہے۔ اور یہ کسی بھی شخص سے علمی طور پر واقع ہونا محال ہے، کیونکہ وہ اپنی ذلت، اپنی محتاجی اور اپنی ذات میں اپنی کمی کو جانتا ہے۔ پس جب وہ ایسی بات کہتا ہے جبکہ وہ اپنی کمی کو جانتا ہے، تو وہ اسے اس انداز میں کہتا ہے جس پر اس سے کوئی مؤاخذہ نہیں ہوتا۔ اور اس قول پر اس کی سزا جہنم (Jahannam) ہوگی، یعنی اس کی ذات میں اس چیز سے دوری جو وہ اپنی زبان سے کہتا ہے، اور یہ بہترین جزا ہے کیونکہ یہ علم ہے۔ اور یہ (اسی طرح ہم ظالموں کو سزا دیتے ہیں) [سورۃ الأنعام: ۱۲۹] ان ظالموں کی سزا ہوگی جنہوں نے مصطفین (چنے ہوئے لوگوں) سے کتاب ورثے میں پائی۔ کیونکہ اللہ نے بعض وارثوں پر ظالم کا نام اطلاق کیا ہے باوجود اس کے کہ وہ اہل حق میں سے ہیں۔ پس یہاں ظالم خاص ہو جاتا ہے، جیسا کہ اللہ کے اس قول میں خاص ہوا: (اور انہوں نے اپنے ایمان کو ظلم کے ساتھ نہیں ملایا) [سورۃ الأنعام: ۸۲] اور یہ ایک خاص ظلم ہے، باوجود اس کے کہ یہ نکرہ (عام) ہے۔ پس یہ سننے والے کے نزدیک نکرہ ہے نہ کہ کہنے والے کے نزدیک۔ اور اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے اس کی تفسیر خاص طور پر شرک سے فرمائی۔\n\nپس اس طرح کا ہجیر (تکرار یا تکراری کلام) اس چیز میں موثر ہوتا ہے جو نتیجہ خیز ہو، کیونکہ وہ اس پر اپنی جگہ پر ہے۔ پس ہر صاحبِ وجہ اس میں سے اپنا حصہ لیتا ہے کیونکہ وہ اس کے لیے موزوں ہے۔ اور ہجیرات میں ہر آیت کو انفرادی طور پر لیا جاتا ہے جیسا کہ وہ لکھی گئی ہے۔ اور اہل تحقق (At-Taḥaqquq) کے نزدیک یہ ماخذ اگرچہ بلند ترین ہے، لیکن آیت کا مسمیٰ جب اس کے ساتھ پہلے یا بعد کے امور لازم ہوں، تو کلام کی قوت سے ظاہر ہوتا ہے کہ آیت ان لوازم کا تقاضا کرتی ہے، پس آیت ان کے بغیر مکمل نہیں ہوتی۔ اور یہ کامل مردوں کی نظر ہے۔ پس جو شخص کلام اللہ میں اس انداز پر غور کرتا ہے، وہ بڑے علم اور بہت زیادہ خیر سے کامیاب ہوتا ہے۔ جیسا کہ تم (بِسْمِ الله الرَّحْمنِ الرَّحِيمِ) کے بارے میں کہتے ہو کہ یہ ایک مستقل آیت ہے، اور سورۃ النمل میں اس کے بارے میں کہتے ہو کہ یہ ایک آیت کا جزو ہے، پس آیات میں اس کی تکمیل اضافہ کے بغیر نہیں ہوتی۔ پس جان لو کہ جیسا (ہر مدت کے لیے ایک نوشتہ ہے) [سورۃ الرعد: ۳۸] اسی طرح ہر عمل کے لیے جزا ہے۔ اور قول ایک عمل ہے، پس اس کی جزا ہے۔ بیشک اللہ ہر کہنے والے کی زبان کے پاس ہے۔ اور خواطر (خیالات) کے بعد اس سے زیادہ تیزی سے کوئی عمل نہیں ہوتا، یعنی زبان سے۔ پس قول سب سے تیز عمل ہے، اور اس کے صاحب کا حساب سب سے تیز حساب لینے والے کے سوا کوئی نہیں لیتا، کیونکہ اعمال پر حساب لینے والا اسماء الٰہیہ میں سے وہ ہے جو اس عمل کے مناسب ہو، اگر تم سمجھو۔ اور اللہ (ہر چیز کو جاننے والا ہے) [سورۃ البقرہ: ۲۸۲] اور اللہ (حق کہتا ہے اور وہی راستہ دکھاتا ہے) [سورۃ الأحزاب: ۴]۔",
    "fa": "باب پانصد و شصتم (۵۶۰) در معرفت حال قطبی (قطب) که منزل او بود و [تفسیر آیه] «و هر کس از ایشان بگوید من معبودی جز او هستم، پس او را به جهنم جزا می‌دهیم» (مريم: ۹۶). یعنی او را به اصلش باز می‌گردانیم که همان دوری است. گفته می‌شود چاه «جهنام» (جهنم) چاهی است که قعر آن دور باشد.\n\n> هر که گوید من إله هستم *** سخنی است که تصدیق نمی‌شود\n>\n> یا گوید من خلق هستم *** برای حقیقت تخلق (تخلق)\n>\n> پس هر دو در آن یکسانند *** تحقق (تحقق) این‌گونه عطا می‌کند\n>\n> و آن کس که این دو را ندارد *** حال تعلق (تعلق) دارد\n>\n> پس برای اوست جمع (جمع) نامیده شده *** همان‌طور که برای اوست تفرق (تفرق)\n\n### [کسی که جزای او جهنم است، در نهایت دوری از سعادت قرار دارد]\n\nخداوند عز و جل می‌فرماید: «همانا جهنم کمینگاهی (مِرْصاداً) است، بازگشتگاهی (مَآباً) برای طاغیان (الطَّاغِينَ)» (النبأ: ۲۱-۲۲). «همانا پروردگار تو در کمینگاه (لَبِالْمِرْصادِ) است» (الفجر: ۱۴). پس تحقیق کن و بنگر تا به لغزش نیفتی، و خداوند توفیق‌دهنده است.\n\nپس کسانی که چنین ادعایی می‌کنند، در نقیض دعوای خود قرار می‌گیرند. زیرا طاغی (سرکش) کسی است که بالا می‌رود؛ آب طغیان کرد (طَغَى) یعنی بالا رفت. خداوند متعال می‌فرماید: «ما هنگامی که آب طغیان کرد (طَغَى الْماءُ)، شما را در کشتی روان (الْجارِيَةِ) حمل کردیم» (الحاقة: ۱۱).\n\nپس هر کس بگوید «من إله هستم»، خود را در نهایت قرب قرار داده است. اما خداوند خبر می‌دهد که جزای این گوینده، نهایت دوری از سعادت او خواهد بود، زیرا جزای او جهنم (جهنم) است. پس او به قعر آن فرو می‌رود، همان کسی که به سوی الوهیتی طغیان کرد که استواء بر عرش را به واسطه اسم «الرحمن» دارد.\n\nو بدان که در علم من کسی نیست که این قول از او سر بزند، در حالی که گرسنه می‌شود، بیمار می‌گردد، مدفوع می‌کند و امثال اینها، مگر فرعون، هنگامی که قومش را سبک شمرد (فَاسْتَخَفَّ قَوْمَهُ) و گفت: «ای بزرگان، من معبودی جز خودم برای شما نمی‌شناسم» (ما عَلِمْتُ لَكُمْ من إِلهٍ غَيْرِي) (القصص: ۳۸). سپس آن را پس از شک، به گمان یا اثبات تبدیل کرد در سخنش: «تا از خدای موسی آگاه شوم (فَأَطَّلِعَ إِلى‏ إِلهِ مُوسى‏) و همانا من او را دروغگو می‌پندارم (إِنِّي لَأَظُنُّهُ كاذِباً)» (غافر: ۳۷).\n\nاما کسانی که می‌گویند خداوند همان مسیح پسر مریم است، در حکم این ذکر [آیه] نیستند، به دو دلیل: دلیل اول اینکه آنها بین ناسوت (ناسوت) و لاهوت (لاهوت) فرق گذاشتند، در حالی که گوینده این ذکر فرق نمی‌گذارد. دلیل دوم اینکه این ذکر فقط به کسی اشاره دارد که آن را درباره خودش گفته باشد، نه کسی که درباره او گفته شده است.\n\nو آنچه این ذکر برای صاحبش نتیجه می‌دهد، یکی از دو امر یا هر دوی آنهاست: امر اول، احدیت (أحدية) این گوینده در الوهیت است. پس کل عالم نزد صاحب این ذکر، عین الحق (حق) است. پس او احدیت کثرت (أحدية الكثرة) را دارد، همان‌طور که دیگری احدیت کثرت اسماء الهی (الأسماء الإلهية) را دارد. و کثرت در نَسَب‌ها و احکام است، نه در عین (ذات). و کل عالم نزد او عَرَضی است که برای این عین از اعیان ممکنات ثابت که وجود برایشان صحیح نیست، عارض شده است.\n\nامر دیگر اینکه، قول «من دونه» (جز او) نزول از مرتبه‌ای باشد که برای خداست. و این مانند سخن آنهاست که می‌گویند: «ما آنها را نمی‌پرستیم مگر برای اینکه ما را به خداوند نزدیک کنند (زُلْفى)» (الزمر: ۳). پس اگرچه او [معبود] را در رتبه پایین‌تری قرار داده، اما نزد او إله است. پس این گوینده، اگر صاحب این ذکر باشد، می‌بیند که تجلی الحق (تجلی) در صور، پایین‌تر از آن است که اگر در غنای او از عالمیان تجلی می‌کرد. پس اگر در آنجا تجلی‌ای صحیح بود، کامل‌تر از تجلی او در صور بود. پس رتبه غنای او از عالم به ذات خود را درک کن.\n\nو این [حال] ممکن است برای کسی باشد که او را عین عالم می‌بیند. پس نشانه او، هویت (هویت) اوست. پس او (الحق) دلیل او (سالک) بر خودش است، مانند سخن او: «أعوذ بك منك» (به تو از تو پناه می‌برم). و به او از خودش پناه برد، زیرا مقابلی جز ذات او ندارد. پس اوست المعز (عزت‌دهنده) و المذل (خوارکننده).\n\nسپس در اینجا یک تنبیه الهی (تنبيه إلهي) وجود دارد، زیرا این حال را به قول (گفتار) پیوند داده است، نه به علم (علم) و گمان (حسبان). اگر بگوید: «ما گمان نمی‌کنیم که او دانسته باشد که امر چنین است»، پس تصور می‌کند که گفتار او مطابق با علم اوست. و این محال است که از کسی به صورت علم واقع شود، زیرا او به پستی، نیاز و قصور خود در نفسش آگاه است.\n\nپس اگر چنین چیزی بگوید، در حالی که قصور خود را می‌داند، آن را به وجهی می‌گوید که در آن مؤاخذه‌ای بر او واقع نمی‌شود. و جزای او بر این قول، جهنم (جهنم) خواهد بود، یعنی دوری او در نفسش از آنچه بر زبان می‌آورد. و این بهترین جزا است، زیرا او علم دارد.\n\nو این «این‌گونه ستمکاران (الظَّالِمِينَ) را جزا می‌دهیم» (الأنعام: ۱۲۹) است؛ جزای ظالمی که کتاب را از مصطفین (برگزیدگان) به ارث برده است. زیرا خداوند بر برخی از وارثان، نام ظالم را اطلاق کرده، با وجود اینکه از اهل حق هستند. پس ظالم در اینجا تخصیص می‌یابد، همان‌طور که در سخن او تخصیص یافت: «و ایمان خود را به ظلم (ظُلْمٍ) نیامیختند» (الأنعام: ۸۲). و آن ظلمی خاص است، با وجود اینکه نکره است. پس نزد شنونده نکره است، نه نزد گوینده آن. و به همین دلیل، رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آن را به شرک (الشرك) به طور خاص تفسیر کرد.\n\nپس چنین سخنانی (الهجير) در آنچه نتیجه می‌دهد، جهت‌دار است. زیرا در وضع خود بر آن [معنا] قرار دارد. پس هر صاحب وجهی از آن بهره‌ای می‌گیرد، زیرا شایسته آن است. و هر آیه‌ای در سخنان [الهی]، همان‌طور که نگاشته شده، به صورت انفرادی گرفته می‌شود. و نزد اهل التحقیق (اهل تحقیق)، اگرچه این مأخذ (روش) اوجی بلند دارد، اما اگر مسمای آیه با اموری از قبل یا بعد همراه شود، از قوت کلام آشکار می‌شود که آیه آن لوازم را می‌طلبد. پس آیه جز با آنها کامل نمی‌شود. و این نظر کاملان از مردان است.\n\nپس هر کس در کلام خدا به این شیوه بنگرد، به علم بزرگ و خیر کثیر دست می‌یابد. همان‌طور که درباره «بِسْمِ الله الرَّحْمنِ الرَّحِيمِ» می‌گویی که آیه‌ای مستقل است، و در سوره نمل می‌گویی که جزئی از یک آیه است، پس کمالی برای آن در آیات نیست مگر با افزودن [به آن].\n\nپس بدان که همان‌طور که «برای هر اجلی کتابی (کِتابٌ) است» (الرعد: ۳۸)، همچنین برای هر عملی جزایی است. و قول (گفتار) یک عمل است، پس جزایی دارد. همانا خداوند نزد زبان هر گوینده‌ای است. و هیچ عملی پس از خواطر (افکار درونی) سریع‌تر از آن نیست، منظورم زبان است. پس قول سریع‌ترین اعمال است و حساب صاحب آن را جز سریع‌ترین حسابگران (أَسْرَعُ الْحاسِبِينَ) بر عهده نمی‌گیرد، زیرا متولی حساب بر اعمال، از اسماء الهی (الأسماء الإلهية) چیزی است که مناسب آن عمل باشد، اگر فهمیدی. و خداوند به هر چیزی (بِكُلِّ شَيْ‏ءٍ) دانا (عَلِيمٌ) است. و خداوند حق (الْحَقَّ) را می‌گوید و او راه (السَّبِيلَ) را هدایت می‌کند."
  },
  "page_count": 2
}