{
  "id": 338,
  "title": {
    "ar": "الباب الثامن والثلاثون وثلاثمائة في معرفة منزل عقبات السويق وهو من الحضرة المحمدية",
    "en": "Chapter 338: Concerning the Knowledge of the Station of the Obstacles of the *Sawiq*, and it is from the Muhammadan Presence (الحضرة المحمدية)",
    "ur": "باب تین سو اڑتیس، منزل عقبات السویق کی معرفت میں، اور یہ حضرة محمدیہ (الحضرة المحمدية) سے ہے۔",
    "fa": "باب سیصد و سی و هشتم در معرفت منزل عقبات السویق، و آن از حضرت محمدیه است."
  },
  "content": {
    "ar": "## «الباب الثامن والثلاثون وثلاثمائة في معرفة منزل عقبات السويق وهو من الحضرة المحمدية»\n\n\n> الفتح فتحان في المعنى وفي الكلم *** فمن تكمل يدعي جامع الحكم‏\n\n\n> ولو تسافل في الأكوان منزله *** كان العلو له في حضرة الكلم‏\n\n\n> هو المقدم في المعنى برتبته *** في عالم النور لا في عالم الظلم‏\n\n\n> لا تحقرن عباد الله أن لهم *** حظا من الله ذي الآلاء والنعم‏\n\n\n> فعظم الكون فالمدلول يطلبه *** وهو البري‏ء من الآفات والتهم‏\n\n\n### [أن لله في المقام المحمود سبعة ألوية]\n\n\nاعلم أن لله في المقام المحمود الذي يقام فيه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يوم القيامة باسمه الحميد سبعة ألوية تسمى ألوية الحمد تعطي لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم وورثته المحمديين في الألوية أسماء الله التي يثني بها صَلَّى اللهُ عَليهِ وسَلَّم على ربه إذا أقيم في المقام المحمود يوم القيامة وهوقوله صَلَّى اللهُ عَليهِ وسَلَّم إذا سئل في الشفاعة قال فأحمد الله بمحامد لا أعلمها الآن‏\n\n\nوهي الثناء عليه سبحانه بهذه الأسماء التي يقتضيها ذلك الموطن والله تعالى لا يثنى عليه إلا بأسمائه الحسنى خاصة وأسماؤه سبحانه لا يحاط بها علما فإنا نعلم‏\n\n\nأن في الجنة ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n\n\nونعلم أنا لا نعلم ما أخفي لنا من قرة أعين وما من شي‏ء من ذلك إلا وهو مستند إلى الاسم الإلهي الذي ظهر به حين أظهره والاسم الإلهي الذي امتن علينا تعالى بإظهاره لنا فلا بد أن نعلمه ونثني على الله به ونحمده إما ثناء تسبيح أو ثناء إثبات فلما عرفت بذلك سألت عن توقيت تلك الأسماء التي يحمد الله تعالى بها يوم القيامة في المقام المحمود\n\n\nفإني علمت أني لا أعلمها الآن ولا يعلمنيها الله فإنها من المحامد التي يختص بها صَلَّى اللهُ عَليهِ وسَلَّم يوم القيامة فإذا سمعناه يحمده بها يوم القيامة في المقام المحمود وانتشرت الألوية بها والمحامد مرقومة فيها ففي ذلك الموطن نعلمها فقيل لي إن عدد تلك الأسماء ألف اسم وستمائة اسم وأربعة وستون اسما كل لواء منها فيه مرقوم تسعة وتسعون اسما من أحصاها هناك دخل الجنة غير لواء واحد من هذه الألوية فإن فيه مرقوما من هذه الأسماء سبع مائة وسبعون اسما يحمده ص‏\nبهذه المحامد كلها وكلها تتضمن طلب الشفاعة من الله وهذا المنزل مما يعطي من ينزله مشاهدة كل لواء من تلك الألوية وعلما بما فيه من الأسماء ليثني هذا الوارث على الله بها هنالك ولكل لواء منها منزل هنا ناله صَلَّى اللهُ عَليهِ وسَلَّم وتناله الورثة الكمل من أتباعه وهذا المنزل منزل شامخ صعب المرتقى ولهذا سمي عقبة وأضيفت إلى السويق لعدم ثبوت الاقدام فيها لأنها مزلة الاقدام فلا يقطعها إلا رجل كامل من رسول ونبي ووارث كامل يحجب كل وارث في زمانه وهذا هو المنزل الذي سماه النفري في موافقة موقف السواء لظهور العبد فيه بصورة الحق فإن لم يمن الله على هذا العبد بالعصمة والحفظ ويثبت قدمه في هذه العقبة بأن يبقى عليه في هذا الظهور شهود عبوديته لا تزال نصب عينيه وإن لم تكن حالته هذه وإلا زلت به القدم وحيل بينه وبين شهود عبوديته بما رأى نفسه عليه من صورة الحق ورأى الحق في صورة عبوديته وانعكس عليه الأمر وهو مشهد صعب فإن الله نزل من مقام غناه عن العالمين إلى طلب القرض من عباده ومن هنا قال من قال إِنَّ الله فَقِيرٌ وهو الغني ونَحْنُ أَغْنِياءُ وهم الفقراء فانعكست عندهم القضية وهذا من المكر الإلهي الذي لا يشعر به فمن أراد الطريق إلى العصمة من المكر الإلهي فليلزم عبوديته في كل حال ولوازمها فتلك علامة على عصمته من مكر الله ويبقى كونه لا يأمنه في المستقبل بمعنى أنه ما هو على أمن إن تبقي له هذه الحالة في المستقبل إلا بالتعريف الإلهي الذي لا يدخله تأويل ولا يحكم عليه إجمال وفي هذا المنزل يشاهد قوله ولكِنَّ الله رَمى‏ ومحمد صَلَّى اللهُ عَليهِ وسَلَّم هو الرامي في الحس الذي وقع عليه البصر ويقوم له في هذا المنزل والله خَلَقَكُمْ وما تَعْمَلُونَ‏\n\n\n### [أن الأمر محصور بين رب وبين عبد فللرب طريق وللعبد طريق‏]\n\n\nواعلم أن السواء بين طريقين لأن الأمر محصور بين رب وبين عبد فللرب طريق وللعبد طريق فالعبد طريق الرب فإليه غايته والرب طريق العبد فإليه غايته فالطريق الواحدة العامة في الخلق كلهم هي ظهور الحق بأحكام صفات الخلق فهي في العموم إنها أحكام صفات الخلق وهي عندنا صفات الحق لا الخلق وهذا معنى السواء والطريق الأخرى ظهور الخلق بصفات الحق التي تتميز في العموم أنها صفات الحق كالاسماء الحسنى وأمثالها وهذا مبلغ علم العامة وعندنا وعند الخصوص كلها صفات الحق بالأصالة ما أضيف إلى الخلق منها مما تجعله العامة نزولا من الله إلينا بها وهي عندنا صفات الحق وإن العبد علت منزلته عند الله حتى تحلى بها فهي عند العامة أسماء نقص وعندنا أسماء كمال فإنه ما ثم مسمى بالأصالة إلا الله ولما أظهر الخلق أعطاهم من أسمائه ما شاء وحققهم بها والخلق في مقام النقص لإمكانه وافتقاره إلى المرجح فما يتخيل أنه أصل فيه وحق له اتبعوه في الحكم نفسه فحكموا على هذه الأسماء الخلقية بالنقص وإذا بلغهم أن الحق تسمى بها ويصف نفسه بها يجعلون ذلك نزولا من الحق تعالى إليهم بصفاتهم وما يعلمون أنها أسماء حق بالأصالة فعلى مذهبنا في ظهور الخلق بصفات الحق تعم الخلق أجمعه فكل اسم لهم هو حق للحق مستعار للخلق وعلى مذهب الجماعة لا يكون ذلك إلا لأهل الخصوص أعني الأسماء الحسنى منها خاصة وعندنا لا يكون العلم بذلك إلا للخصوص من أهل الله وفرق عظيم بين قولنا لا يكون ذلك وبين قولنا لا يكون العلم بذلك فإن الحق هو المشهود بكل عين في نفس الأمر ولا يعلم ذلك إلا آحاد من أهل الله وهو مثل قول الصديق ما رأيت شيئا إلا رأيت الله قبله فعرفته فإذا ظهر ذلك الشي‏ء لعينه المقيد وقد رأى الله قبله ميزه في ذلك الشي‏ء وعلم إن ذلك الشي‏ء ملبس من ملابس الحق ظهر فيه للزينة فتلك زينة الله التي تزين بها لعباده هذا مقام الصديق فلا يتميز أهل الله من غيرهم إلا بالعلم بذلك لأن الأمر في نفسه على ذلك وعند العامة لا يكون ذلك إلا لأهل العناية المتحققين بالحق وغيرهم هو عندهم خلق بلا حق ثم نرجع فنقول إن الله جعل لهذا المنزل بابا يسمى باب الرحمة منه يكون الدخول إليه فيعصمه مما فيه من الآفات المهلكة التي أشرنا إليها آنفا من حكم السواء فإنه لهذا المنزل أعني هذا الباب كالنية في العمل فما تخلل العمل من غفلة وسهو لم يؤثر في صحة العمل فإن النية تجبر ذلك لأنها أصل في إنشاء ذلك العمل فهي تحفظه وكذلك البسملة جعلها الله في أول كل سورة من القرآن فهي للسورة كالنية للعمل فكل وعيد وكل صفة توجب الشقاء مذكورة في تلك السورة فإن البسملة بما فيها من الرحمن في العموم والرحيم في الخصوص تحكم على ما في تلك السورة من الأمور التي تعطي من قامت به الشقاء فيرحم الله ذلك العبد إما بالرحمة الخاصة وهي الواجبة أو بالرحمة العامة وهي رحمة الامتنان‏\nفالمال إلى الرحمة لأجل البسملة فهي بشرى وأما سورة التوبة على من يجعلها سورة على حدة منفصلة عن سورة الأنفال فسماها سورة التوبة وهو الرجعة الإلهية على العباد بالرحمة والعطف فإنه قال للمسرفين على أنفسهم ولم يخص مسرفا من مسرف يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ لا تَقْنَطُوا من رَحْمَةِ الله إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً فلو قال إن الرحمن لم يعذب أحدا من المسرفين فلما جاء بالاسم الله قد تكون المغفرة قبل الأخذ وقد تكون بعد الأخذ ولذلك ختم الآية بقوله إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ فجاء بالرحيم آخرا أي مآلهم وإن أوخذوا إلى الرحمة وإن الرجعة الإلهية لا تكون إلا بالرحمة لا يرجع على عباده بغيرها فإن كانت الرجعة في الدنيا ردهم بها إليه وهو قوله ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا وإن كانت في الآخرة فتكون رجعتهم مقدمة على رجعته لأن الموطن يقتضي ذلك فإن كل من حضر من الخلق في ذلك المشهد سقط في يديه ورجع بالضرورة إلى ربه فيرجع الله إليهم وعليهم فمنهم من يرجع الله عليه بالرحمة في القيامة ومنازلها ومنهم من يرجع عليه بالرحمة بعد دخول النار وذلك بحسب ما تعطيه الأحوال ويقع به الشهود والأمر في ذلك كله حسي ومعنوي فإن العالم كله حرف جاء لمعنى معناه الله ليظهر فيه أحكامه إذ لا يكون في نفسه محلا لظهور أحكامه فلا يزال المعنى مرتبطا بالحرف فلا يزال الله مع العالم قال تعالى وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ فالداخل إلى هذا المنزل في أول قدم يضعه فيه يحصل له من الله تسعة وتسعون تجليا مائة إلا واحدا تتقدم إليه منها تسعة يرى فيها صورته فيعلم حقيقته ثم بعد ذلك يقام في التسعين فيرى ما لم يكن يعلم من حضرة جمع ومنعة وعلو عن المقاوم فينزل الحق إليه معلما له علما من لدنه وقد تقدمت الرحمة له عند دخوله وهذا منزل خضر صاحب موسى ع‏\n\n\n### [أن أهلية الشي‏ء لأمر ما أنما هو نعت ذاتي‏]\n\n\nواعلم أن أهلية الشي‏ء لأمر ما أنما هو نعت ذاتي فلا يقع فيها مشاركة لغيره إلا بنسبة بعيدة إذا حققتها لم تثبت وزلت قدمك فيها\n\n\nكما قال صَلَّى اللهُ عَليهِ وسَلَّم في الصحيح أما أهل النار الذين هم أهلها وهم الذين لا يخرجون منها رأسا لأنهم أهلها فإنهم لا يموتون فيها ولا يحيون‏\n\n\nفجعل نعتهم نفي الحياة والموت ثم استدرك نعت من دخلها وما هو بأهلها\n\n\nفقال ولكن ناس أصابتهم النار بذنوبهم فأماتهم الله فيها إماتة\n\n\nفنعتهم بالموت وهو خلاف نعت من هو لها أهل ثم ذكر خروج هؤلاء من النار فتنبه لكون الحق أنطق العالم كله بالتسبيح بحمده والتسبيح تنزيه ما هو ثناء بأمر ثبوتي لأنه لا يثنى عليه إلا بما هو أهل له وما هو له لا يقع فيه المشاركة وما أثنى عليه إلا بأسمائه وما من اسم له سبحانه عندنا معلوم إلا وللعبد التخلق به والاتصاف به على قدر ما ينبغي له فلما لم يتمكن في العالم أن يثنى عليه بما هو أهله جعل الثناء عليه تسبيحا من كل شي‏ء ولهذا أضاف الحمد إليه فقال يُسَبِّحُ بِحَمْدِهِ أي بالثناء الذي يستحقه وهو أهله وليس إلا التسبيح فإنه سبحانه يقول سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ والعزة المنع من الوصول إليه بشي‏ء من الثناء عليه الذي لا يكون الإله عما يصفون وكل مثن واصف فذكر سبحانه تسبيحه في كل حال ومن كل عين فقال تُسَبِّحُ لَهُ السَّماواتُ السَّبْعُ والْأَرْضُ ومن فِيهِنَّ وما ثم إلا هؤلاء وقال آمرا لمحمد عند انقضاء رسالته وما شرع له أن يشرع من الثناء عليه فَسَبِّحْ بِحَمْدِ رَبِّكَ واسْتَغْفِرْهُ فقال أنت كما أثنيت على نفسك هذا هو التسبيح بحمده فلما كان الأمر بالثناء على الله على ما قررناه لم يتمكن لنا أن نستنبط له ثناء وإنما نذكره بما ذكر عن نفسه فيما أنزله في كتبه على حد ما يعلمه هو لا على حد ما نفهمه نحن فنكون في الثناء عليه حاكين تالين لأن الثناء على المثنى عليه مجهول الذات لا يقبل الحدود والرسوم ولا يدخل تحت الكيفية ولا يعرف كما هو عليه في نفسه وهو الغني عن العالمين فلا تدل على المعرفة به الدلالات وإنما تدل على استنادنا إليه من حيث لا يشبهنا أو لا يقبل وصفنا وما من اسم إلهي إلا ونتصف به فما تلك هي المعرفة المقصودة التي يعلم بها نفسه فشرع التسبيح وفطر عليه كل شي‏ء وهو نفي عن كل وصف لا إثبات ولهذا بعض أهل النظر تنهوا إلى شي‏ء من هذا وإن كان العلماء لم يرتضوا ما ذهبوا إليه ولكن هو حق في نفس الأمر من وجه ما مليح وذلك أنهم رأوا أن المشاركة بين المحدث والله لا تصح حتى في إطلاق الألفاظ عليه فإذا قيل لهم الله موجود يقولون ليس بمعدوم فإن المحدث موصوف بالوجود ولا مشاركة فإذا قيل لهم الله حي يقولون ليس بميت الله عالم يقولون ليس بجاهل الله قادر يقولون ليس بعاجز الله مريد يقولون ليس بقاصر فأتوا بلفظة النفي والتسبيح تنزيه ونفي لا إثبات فجروا على الأصل الذي نطق الله به كل شي‏ء فسلكوا مسلكا غريبا بين النظار\nوالثناء على الله بالتسبيح لا تكل به الألسنة بخلاف الثناء بالأسماء فإن الألسنة تكل وتعيا وتقف فيها ولهذا قال من قال مما شرع له أن يقول من الثناء على الله فقال خاتما عند الإعياء والحصر لا أحصي ثناء عليك أنت كما أثنيت على نفسك وانظر حكمة الله تعالى في\n\n\nكونه لم يجعل له صفة في كتبه بل نزه نفسه عن الوصف فقال ولِلَّهِ الْأَسْماءُ الْحُسْنى‏ فجعلها أسماء وما جعلها نعوتا ولا صفات وقال فَادْعُوهُ بِها وبها كان الثناء والاسم ما يعطي الثناء والاسم ما يعطي الثناء وإنما يعطيه النعت والصفة وما شعر أكثر الناس لكون الحق ما ذكر له نعتا في خلقه وإنما جعل ذلك أسماء كأسماء الأعلام التي ما جاءت للثناء وإنما جاءت للدلالة وتلك الأسماء الإلهية الحسنى هي لنا نعوت يثنى علينا بها وأثنينا علينا بها وأثنى الله على نفسه بها لأنا قدمنا إن نزول الشرائع في العالم من الله إنما تنزل بحكم ما تواطأ عليه أهل ذلك اللسان سواء صادف أهل ذلك اللسان الحق في ذلك أو لا وقد تواطأ الناس على إن هذه الأسماء التي سمي الحق بها نفسه مما يثنى بها في المحدثات إذا قامت بمن تقوم به نعتا أو صفة فأثنى الله على نفسه بها ونبه على أنها أسماء لا نعوت ليفهم السامع الفهم الفطن أن ذلك من حكم التواطؤ لا حكم الأمر في نفسه كما دل دليل الشرع ب لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ من جميع الوجوه فلا يقبل الأينية فإنه لو قبلها لم يصدق لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ على الإطلاق فإن قبول الأينية مماثلة وأما الدليل العقلي فلا يقول بها أصلا ومع هذا الحكم للتواطئ‏\n\n\nفقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم للسوداء الخرساء أين الله فأطلق عليه لفظ الأينية لعلمه أن الأينية في حقه بمنزلة الاسم لا بمنزلة النعت فقالت السوداء في السماء بالإشارة فقبل ما أشارت به وجعلها مؤمنة\n\n\nلأن الله أخبر عن نفسه أنه في السماء فصدقته في خبره فكانت مؤمنة ولم يقل صَلَّى اللهُ عَليهِ وسَلَّم فيها عند ذلك إنها عالمة وأمر بعتقها والعتق سراح من قيد العبودية تنبيه من النبي صَلَّى اللهُ عَليهِ وسَلَّم بالعتق في حقها من قيد العبودية والملك على أنه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ سراح من قيد الأينية وفاء الظرف التي أتت به السوداء في الجواب فانظر ما أعجب الشارع العارف بالله وهذا كله تنزيه فالثناء على الله بصفات الإثبات التي جعلها أسماء وجعلها الخلق نعوتا كما هي لهم نعوت إذا وقع هذا الثناء من العبد صورة لا يكون روح تلك الصورة تسبيحا بليس كمثله شي‏ء كان جهلا بما يستحقه المثنى عليه فإنه أدخله تحت الحد والحصر بخلاف كون ذلك أسماء لا نعوتا فيا ولي لا يفارق التسبيح ثناؤك على الله جملة واحدة فإنك إذا كنت بهذه المثابة نفخت روحا في صورة ثنائك التي أنشأتها فلا تكن من المصورين الذين يعذبون يوم القيامة بأن يقال لهم أحيوا ما خلقتم ولا قدرة لهم على ذلك هناك لأن الدعوى هناك لا تقع لما هو عليه من كشف الأمور وفي الدنيا ليس كذلك ثم انظر في تحقيق ما ذكرناه من إنشاء صورة الثناء إذا لم تنفخ فيها روح التسبيح قوله لطائفة قُلْ أَ رَأَيْتُمْ ما تَدْعُونَ من دُونِ الله أَرُونِي ما ذا خَلَقُوا من الْأَرْضِ فلو قالوا عيسى دعي إلها من دون الله وقد خلق من الأرض لما عجنه طينا لانتظام الأجزاء الترابية بما في الماء من الرطوبة والبرودة فزادت كمية برودة التراب فثقل عن التحليل وعدم الانتظام وأزالت الرطوبة اليبوسة التي في التراب فالتأمت أجزاؤه لظهور شكل الطائر فقدم الحق لأجل هذا القول إن خلق عيسى للطير كان بإذن الله فكان خلقه له عبادة يتقرب بها إلى الله لأنه مأذون له في ذلك فقال وإِذْ تَخْلُقُ من الطِّينِ كَهَيْئَةِ الطَّيْرِ بِإِذْنِي فَتَنْفُخُ فِيها فَتَكُونُ طَيْراً بِإِذْنِي فما أضاف خلقه إلا لإذن الله والمأمور عبد والعبد لا يكون إلها وإنما جئنا بهذه المسألة لعموم كلمة ما فإنها لفظة تطلق على كل شي‏ء ممن يعقل ومما لا يعقل كذا قال سيبويه وهو المرجوع إليه في العلم باللسان فإن بعض المنتحلين لهذا الفن يقولون إن لفظة ما تختص بما لا يعقل ومن تختص بمن يعقل وهو قول غير محرر وقد رأينا في كلام العرب جمع من لا يعقل جمع من يعقل وإطلاق ما على من يعقل وإنما قلنا هذا لئلا يقال في قوله ما تَدْعُونَ من دُونِ الله إنما أراد من لا يعقل وعيسى يعقل فلا يدخل في هذا الخطاب وقول سيبويه أولى فهذا قد ترجمنا عن هذا المنزل بما فيه تنبيه على شموخه وتفلته من العالم به إن لم يكن له مراقبا دائما وهو يحوي على علوم منها علم ما خص الله به أولية الحمد من الرحمة هل أعطاها الرحمة العامة أو الخاصة فإن التي تجاوره الرحمة الواجبة وهي جزء من الرحمة العامة فهل لواء الحمد يقتصر عليها وهو أن لا يثني على الله إلا بالأسماء الحسنى في العرف أو يتعداها إلى الرحمة العامة في الثناء على الله بجميع الأسماء والكنايات إذ له الفعل المطلق من غير تقييد وله كل اسم يطلبه الفعل وإن لم يطلق عليه فإن الرحمة الإلهية العامة تعم هذه‏\nالأسماء التي لم يجر العرف بأن تطلق عليه فتطلق عليه رحمة بها فتجدها مرقومة في اللواء وهو علم شريف كنا قد عزمنا إن نضع فيه كتابا فاقتصرنا منه على جزء صغير سميناه معرفة المدخل إلى الأسماء والكنايات وهو أسلوب عجيب غريب ما رأيت أحدا نبه عليه من المتقدمين مع معرفتهم به ومن علوم هذا المنزل علم الإجمال الذي يعقبه التفصيل من غير تأخير وفيه علم إنزال الكتب من أين تنزل وما حضرتها من الأسماء الإلهية وهل جميع الكتب المنزلة من حضرة واحدة من الأسماء أو تختلف حضراتها باختلاف سبب نزولها فإن التوراة وإن كتبها الله بيده فما نزلت للاعجاز عن المعارضة والقرآن نزل معجزا فلا بد أن تختلف حضرة أسماء الله فيضاف كل كتاب إلى اسمه الخاص به من الأسماء الإلهية وفيه العلم بالحق المخلوق به وهو العدل عند سهل بن عبد الله وفيه علم أهل الحجب في إعراضهم عن دعوة الحق هل إعراضهم جهل أو عناد وجحد وفيه علم ما يتميز به الله عمن تدعى فيه الألوهة وليس فيه خصوص وصف الإله وفيه علم ما آخذ الأدلة للعقل بالقوة الفكرية وفيه علم تأخير الإجابة عند الدعاء ما سبب ذلك وفيه علم صيرورة الولي عدوا ما سببه وفيه علم التفاضل في الفهم عن الله هل يرجع إلى الاستعداد أو إلى المشيئة وفيه علم الشهادة الإلهية للمشهود له وعليه واجتماع المشهود له وعليه في الرحمة بعد الأداء ولم يكن الصلح أو لا ولا يحتاج إلى دعوى وإلى شهادة وإذا كان الحق شهيدا فمن الحاكم حتى يشهد عنده فلو حكم بعلمه لم يكن شاهدا ويتعلق بهذا العلم علم الشهادة ومراتب الشهداء والشهود فيها وهل للحاكم أن يحكم بعلمه أو يترك علمه لشهادة الشهود إذا لم تكن شهادتهم شهادة زور مثل أن تشهد شهود على إن زيدا يستحق على عمرو كذا وكذا درهما وهو عندهم كما شهدوا وكان الحاكم قد علم إن عمرا قد دفع له هذا المستحق بيقين وليس لزيد شهود إلا علم الحاكم ويعلم الحاكم أن الشهود شهدوا بما علموا ولم يكن لهم علم بأن عمرا قد أوصل إلى زيد ما كانت الشهادة قد وقعت عليه وفيه علم تكذيب الصادق من أين يكذبه من يكذبه مع جواز الإمكان فيما يدعيه في أخباره وفيه علم أسباب ارتفاع الخوف في مواطن الخوف وفيه علم المناسبة في الجزاء الوفاق وهل ما زاد على الجزاء الوفاق يكون جزاء أو يكون هبة وهل الجزاء المؤلم يساوي الجزاء الملذ في الزيادة أم لا تكون الزيادة إلا في جزاء ما يقع به النعيم وأما في الآلام فلا يزيد على الوفاق شي‏ء وقوله تعالى زِدْناهُمْ عَذاباً فَوْقَ الْعَذابِ لما ذا ترجع هذه الزيادة وقوله كُلَّما نَضِجَتْ جُلُودُهُمْ بَدَّلْناهُمْ جُلُوداً غَيْرَها لِيَذُوقُوا الْعَذابَ فهل هذه الجلود المجددة هل هي من الجزاء الوفاق أو من الزيادة وقولهم لَنْ تَمَسَّنَا النَّارُ إِلَّا أَيَّاماً مَعْدُودَةً هل لهم في هذا القول وجه يصدقون فيه أم لا وجه لهم وقول الله في حق هؤلاء بَلى‏ من كَسَبَ سَيِّئَةً وأَحاطَتْ به خَطِيئَتُهُ فَأُولئِكَ أَصْحابُ النَّارِ هُمْ فِيها خالِدُونَ هل هو معارض لقولهم لَنْ تَمَسَّنَا النَّارُ إِلَّا أَيَّاماً مَعْدُودَةً فإنه ما كل من دخل النار تمسه فإن ملائكة العذاب في النار وهي دارهم وما تمسهم النار وما قال الله بعد قوله وأَحاطَتْ به خَطِيئَتُهُ فأولئك الذين تمسهم النار وفيه علم نش‏ء بنى آدم وصورته الطبيعية والروحانية وفيه علم الوصف الذي إذا أقيم العبد فيه تجاوز الله عنه فيما أساء فيه وفيه علم الحقوق والمستحقين لها وفيه علم الفرق بين العرض والوقوف فإنه ورد ولَوْ تَرى‏ إِذْ وُقِفُوا عَلى‏ رَبِّهِمْ وورد يَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى (النَّارِ) ربهم وورد ولَوْ تَرى‏ إِذْ وُقِفُوا عَلَى النَّارِ وورد ويَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى النَّارِ وهل العرض دخول أم لا وفيه علم المطابقة وهو علم عزيز وفيه علم مضادة الأمثال وفيه علم ما يجب على الرسل مما لا يجب وفيه علم عدم الثقة بالأسباب المعهودة لأمر ما يكون عنها فيظهر عنها خلاف ذلك من أين وقع الغلط للذي وثق بها وفيه علم ما يفنى من الأشياء مما لا يفنى وما يفنى منها هل يفنى بالذات أم لا\n\n\nوفيه علم كل شي‏ء فيك ومنك فلا يطرأ عليك أمر غريب ما هو عندك فلا يكشف لك إلا عنك وهو علم عزيز أيضا ما يعلمه كل أحد من أهل الله وفيه علم الفرق بين أصناف العالم وفيه علم الاقتداء وفيه علم الزمان الكبير من الزمان الصغير وظهور الزمان الكبير قصيرا كزمان النعيم والوصال وظهور الزمان القصير كبيرا كزمان الآلام والهجران والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 338: Concerning the Knowledge of the Station of the Ascents of the Sawiq, and it is from the Muhammadan Presence (الحضرة المحمدية)\n\nThe revelation (الفتح) is twofold: in the meaning (المعنى) and in the word (الكلم);\nSo whoever is perfected claims the comprehensive wisdom (جامع الحكم).\nEven if his station (منزله) descends in the worlds (الأكوان),\nThe height (العلو) belongs to him in the Presence of the Word (حضرة الكلم).\nHe is the foremost (المقدم) in meaning by his rank (رتبته),\nIn the world of Light (عالم النور), not in the world of darkness (عالم الظلم).\nDo not despise the servants of Allah, for they possess\nA portion (حظا) from Allah, the Possessor of Bounties (الآلاء) and Graces (النعم).\nTherefore, magnify the Cosmos (الكون), for the Signified (المدلول) seeks it,\nAnd He (the Signified) is innocent of defects (الآفات) and accusations (التهم).\n\n### [That Allah possesses Seven Banners in the Praiseworthy Station (المقام المحمود)]\n\nKnow that Allah possesses seven banners in the Praiseworthy Station (المقام المحمود) where the Messenger of Allah, peace and blessings be upon him, will be established on the Day of Resurrection by His Name, *al-Hamid* (The Praiseworthy). These are called the Banners of Praise (ألوية الحمد). They are given to the Messenger of Allah, peace and blessings be upon him, and to his Muhammadan inheritors. In these banners are the Names of Allah with which the Prophet, peace and blessings be upon him, praises his Lord when he is established in the Praiseworthy Station on the Day of Resurrection. This is what he, peace and blessings be upon him, referred to when he was asked about intercession (الشفاعة) and said: \"I will praise Allah with praises I do not know now.\"\n\nThese praises constitute the glorification (الثناء) of the Exalted One by those Names which that specific moment requires. Allah the Exalted is only praised specifically by His Beautiful Names (أسمائه الحسنى), and His Names, Exalted is He, cannot be encompassed by knowledge (علما). For we know that in Paradise there is:\n\n<<مَا لَا عَيْنٌ رَأَتْ وَلَا أُذُنٌ سَمِعَتْ وَلَا خَطَرَ عَلَى قَلْبِ بَشَرٍ>> (What no eye has seen, nor ear has heard, nor has occurred to the heart of man.)\n\nAnd we know that we do not know what has been hidden for us of the comfort of the eyes (قرة أعين). There is nothing of that except that it is based upon the Divine Name (الاسم الإلهي) through which it appeared when He manifested it, and the Divine Name which the Exalted One bestowed upon us by manifesting it to us. Thus, we must know it and praise Allah with it and laud Him, whether it be praise of glorification (ثناء تسبيح) or praise of affirmation (ثناء إثبات).\n\nWhen I learned this, I inquired about the specification (توقيت) of those Names with which Allah the Exalted is praised on the Day of Resurrection in the Praiseworthy Station (المقام المحمود). I knew that I do not know them now, nor will Allah teach them to me, for they are among the praises specific to him, peace and blessings be upon him, on the Day of Resurrection. When we hear him praise Him with them on the Day of Resurrection in the Praiseworthy Station, and the banners are unfurled with them, and the praises are inscribed upon them, it is at that moment that we shall know them.\n\nI was told that the number of those Names is one thousand six hundred and sixty-four Names. Each banner has inscribed upon it ninety-nine Names, and whoever enumerates them there shall enter Paradise, except for one banner among these, which has inscribed upon it seven hundred and seventy Names. He, peace and blessings be upon him, praises Him with all these praises, and all of them entail the request for intercession (الشفاعة) from Allah.\n\nThis station (منزل) grants the one who enters it the witnessing (مشاهدة) of every one of those banners and the knowledge (علما) of the Names contained within them, so that this inheritor may praise Allah with them there. Each banner has a corresponding station here which the Prophet, peace and blessings be upon him, attained, and which the perfect inheritors (الورثة الكمل) among his followers attain.\n\nThis station is lofty and difficult to ascend (صعب المرتقى), which is why it is called an Ascent (عقبة). It is attributed to the Sawiq (السويق) because of the lack of firm footing in it, as it is a place where feet slip. Only a perfect man—whether a Messenger, a Prophet, or a perfect inheritor who veils every other inheritor in his time—can traverse it.\n\nThis is the station that Al-Niffari (النفري) called the Station of Symmetry (موقف السواء), due to the servant’s manifestation therein in the image of the Real (صورة الحق). If Allah does not bestow upon this servant preservation and protection (العصمة والحفظ) and establish his foot in this Ascent by ensuring that the witnessing of his servitude (شهود عبوديته) remains before his eyes during this manifestation, then his foot will slip. He will be prevented from witnessing his servitude by what he sees of the image of the Real upon himself, and he will see the Real in the image of his servitude. The matter will be inverted for him.\n\nThis is a difficult witnessing (مشهد صعب), for Allah descended from the station of His independence from the worlds to the request for a loan from His servants. It is from this perspective that some have said: <<إِنَّ اللهَ فَقِيرٌ>> (Indeed, Allah is poor)—while He is the Rich—and <<وَنَحْنُ أَغْنِيَاءُ>> (And we are rich)—while they are the poor. The matter was inverted for them. This is part of the Divine Deception (المكر الإلهي) which is not perceived.\n\nWhoever desires the path to preservation (العصمة) from the Divine Deception must adhere to his servitude (عبوديته) and its requirements in every state. That is the sign of his preservation from the deception of Allah. However, his lack of future security remains, meaning that he is not secure that this state will remain for him in the future except through Divine definition (التعريف الإلهي) which admits no interpretation and is not governed by generality.\n\nIn this station, one witnesses the meaning of His saying: <<وَلَكِنَّ اللهَ رَمَى>> (But Allah threw), even though Muhammad, peace and blessings be upon him, was the one who threw in the sensory act perceived by the eye. And for him, in this station, is established the meaning of: <<وَاللهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ>> (And Allah created you and what you do).\n\n### [That the Matter is confined between a Lord and a Servant, so the Lord has a path and the Servant has a path]\n\nKnow that Symmetry (السواء) lies between two paths, because the matter is confined between a Lord and a Servant. The Lord has a path, and the Servant has a path. The Servant is the path of the Lord, for to Him is his ultimate end. And the Lord is the path of the Servant, for to Him is his ultimate end.\n\nThe single, general path for all creation is the manifestation of the Real (الحق) through the rulings of the attributes of creation (صفات الخلق). In general terms, these are the rulings of the attributes of creation, but for us [the mystics], they are the attributes of the Real, not of creation. This is the meaning of Symmetry (السواء).\n\nThe other path is the manifestation of creation (الخلق) through the attributes of the Real, which are generally distinguished as the attributes of the Real, such as the Beautiful Names (الأسماء الحسنى) and their likes. This is the limit of the knowledge of the general public (العامة).\n\nFor us and for the elite (الخصوص), all of them are fundamentally (بالأصالة) attributes of the Real, even those attributed to creation, which the general public considers a descent from Allah to us through their attributes. For us, they are attributes of the Real, even if the servant’s station is elevated with Allah until he is adorned by them. The general public considers them names of deficiency (أسماء نقص), but for us, they are names of perfection (أسماء كمال), for there is fundamentally no named entity (مسمى بالأصالة) except Allah.\n\nWhen He manifested creation, He gave them whatever He willed of His Names and realized them through those Names. Creation is in the station of deficiency due to its contingency (إمكانه) and its need for a preponderant factor (المرجح). Thus, what they imagine to be fundamental to them and their right, they follow in the ruling itself, judging these created names as deficient. When they are informed that the Real names Himself with them and describes Himself by them, they consider this a descent of the Real, Exalted is He, to them through their attributes. They do not know that these are fundamentally Names of the Real.\n\nAccording to our doctrine, the manifestation of creation through the attributes of the Real encompasses all creation, so every name they possess is fundamentally the right of the Real, borrowed by creation. According to the doctrine of the community [the general public], this only occurs for the people of distinction (أهل الخصوص)—meaning specifically the Beautiful Names.\n\nFor us, the knowledge of this reality is only granted to the elite among the People of Allah (أهل الله). There is a great difference between our saying \"this does not occur\" and our saying \"the knowledge of this does not occur.\" For the Real is the one witnessed by every eye in reality (في نفس الأمر), but only a few unique individuals (آحاد) among the People of Allah know this. This is like the saying of the Veracious One (Al-Siddiq): \"I did not see a thing except that I saw Allah before it, and thus I knew Him.\" When that specific thing appears to his limited eye, and he has already seen Allah before it, he distinguishes Him in that thing and knows that the thing is a garment (ملبس) from the garments of the Real, manifested therein for adornment. That is the adornment of Allah with which He adorns Himself for His servants. This is the station of the Veracious One.\n\nThe People of Allah are distinguished from others only by the knowledge of this, because the matter in itself is thus. But for the general public, this only occurs for the people of Divine care (أهل العناية) who are realized in the Real; others are, in their view, creation without the Real.\n\nThen we return and say that Allah made a gate for this station called the Gate of Mercy (باب الرحمة). Entry to the station occurs through it, and it preserves the entrant from the destructive defects (الآفات المهلكة) inherent in the ruling of Symmetry (السواء) that we mentioned earlier. This gate is to this station what the Intention (النية) is to the action. Any heedlessness or oversight that occurs during the action does not affect the validity of the action, because the Intention compensates for that, as it is the origin of the initiation of that action, and thus preserves it.\n\nSimilarly, Allah placed the *Basmala* (In the Name of Allah, the Most Compassionate, the Most Merciful) at the beginning of every Surah of the Quran. It is to the Surah what the Intention is to the action. Every threat and every attribute that necessitates wretchedness mentioned in that Surah is governed by the *Basmala*, due to *al-Rahman* (The Compassionate) in generality and *al-Rahim* (The Merciful) in particularity contained within it. This rules over the matters in that Surah which would bring wretchedness upon the one characterized by them. Thus, Allah shows mercy to that servant, either through the specific Mercy (الرحمة الخاصة), which is obligatory, or through the general Mercy (الرحمة العامة), which is the mercy of favor.\n\nThe ultimate destination is Mercy because of the *Basmala*; thus, it is good tidings. As for *Surat al-Tawba* (Chapter of Repentance)—for those who consider it a separate Surah distinct from *Surat al-Anfal*—it is named the Surah of Repentance, which is the Divine Return (الرجعة الإلهية) to the servants with Mercy and affection. For He said to those who transgressed against themselves, without specifying one transgressor from another:\n\n<<يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا>> (O My servants who have transgressed against themselves, do not despair of the Mercy of Allah. Indeed, Allah forgives all sins.)\n\nIf He had said, \"Indeed, *al-Rahman* (The Compassionate) forgives all sins,\" no transgressor would have been punished. But since He used the Name *Allah*, forgiveness may occur before punishment or after punishment. Therefore, He concluded the verse by saying: <<إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ>> (Indeed, He is the Forgiving, the Merciful), bringing *al-Rahim* (The Merciful) last, meaning that their ultimate destination, even if they are punished, is Mercy.\n\nThe Divine Return (الرجعة الإلهية) only occurs through Mercy; He does not return to His servants with anything else. If the Return is in this world, He returns them to Him through it, which is His saying: <<ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا>> (Then He turned to them so that they might repent). If it is in the Hereafter, their return precedes His Return, because the moment requires that. For everyone among creation who attends that scene will be utterly defeated and will necessarily return to his Lord. Then Allah returns to them and upon them. Some of them Allah returns to with Mercy in the Resurrection and its stations, and some He returns to with Mercy after entering the Fire. This depends on what the states necessitate and what the witnessing (الشهود) brings about.\n\nThe matter in all of this is both sensory and spiritual (حسي ومعنوي). The entire world (العالم) is a letter (حرف) that came for a meaning (معنى)—its meaning is Allah—so that His rulings may manifest in it, since it cannot be a locus for the manifestation of His rulings in itself. Thus, the meaning remains connected to the letter, and Allah remains with the world. The Exalted said: <<وَهُوَ مَعَكُمْ أَيْنَ مَا كُنتُمْ>> (And He is with you wherever you are).\n\nThe one who enters this station receives from Allah ninety-nine Theophanies (تجليات)—one hundred minus one—in the very first step he takes. Nine of these Theophanies advance toward him, in which he sees his own form, thereby knowing his reality. Then, after that, he is established in the ninety, where he sees what he did not know before concerning the Presence of Gathering (حضرة جمع), invulnerability, and loftiness above opposition. The Real then descends to him, teaching him knowledge from His Presence (علما من لدنه). Mercy has already preceded him upon his entry. This is the station of Khidr, the companion of Moses, peace be upon him.\n\n### [That the fitness of a thing for a certain matter is only an essential attribute (نعت ذاتي)]\n\nKnow that the fitness (أهلية) of a thing for a certain matter is only an essential attribute (نعت ذاتي). No participation by another occurs in it, except by a remote relationship which, if you investigate it, will not be established, and your foot will slip therein.\n\nAs the Prophet, peace and blessings be upon him, said in the *Sahih*: \"As for the people of the Fire who are its people—and they are those who will never leave it—because they are its people, they will neither die therein nor live.\"\n\nHe made their attribute the negation of life and death. Then he corrected the attribute of those who entered it but are not essentially its people, saying: \"But people whom the Fire afflicted due to their sins, Allah will cause them to die therein, a death.\"\n\nHe attributed death to them, which is contrary to the attribute of those who are essentially its people. Then he mentioned the departure of these people from the Fire.\n\nPay attention to the fact that the Real caused the entire world to speak with Glorification (التسبيح) with His Praise. Glorification is transcendence (تنزيه), not praise by way of affirmation (أمر ثبوتي), because He is only praised with what is fitting for Him (أهل له), and what is fitting for Him admits no participation. He is only praised by His Names. There is no Name of the Exalted known to us except that the servant can be characterized by it and described by it to the extent appropriate for him.\n\nSince the world was unable to praise Him with what is fitting for Him, He made the praise of Him Glorification (تسبيحا) from everything. Therefore, He added Praise (الحمد) to it, saying: <<يُسَبِّحُ بِحَمْدِهِ>> (Glorifies with His Praise), meaning with the praise that He deserves and is fitting for Him, which is nothing but Glorification. For the Exalted says: <<سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ>> (Glorified be your Lord, the Lord of Might, above what they describe). Might (*al-Izza*) is the prevention of reaching Him through any praise that the Deity is above being described by. Every praiser is a describer.\n\nThus, the Exalted mentioned His Glorification in every state and from every eye, saying: <<تُسَبِّحُ لَهُ السَّمَاوَاتُ السَّبْعُ وَالْأَرْضُ وَمَن فِيهِنَّ>> (The seven heavens and the earth and whoever is in them glorify Him). And there is nothing but these.\n\nAnd He commanded Muhammad, at the conclusion of his mission and what was legislated for him to legislate concerning praise of Him: <<فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ>> (So glorify with the praise of your Lord and ask His forgiveness). He said: \"You are as You have praised Yourself.\" This is the Glorification with His Praise.\n\nSince the matter of praising Allah is as we have established, it is not possible for us to derive praise for Him. Rather, we mention Him by what He mentioned about Himself in what He revealed in His Books, according to the limit that He knows, not according to the limit that we understand. Thus, in praising Him, we are merely narrators and reciters (حاكين تالين), because the Praised One is unknown in Essence (مجهول الذات), does not accept limits or definitions (الحدود والرسوم), does not fall under modality (الكيفية), and is not known as He is in Himself. He is independent of the worlds. Indications (الدلالات) do not lead to the Gnosis (المعرفة) of Him; rather, they indicate our reliance upon Him from the perspective that He does not resemble us or accept our description. Since there is no Divine Name by which we are not characterized, that is not the intended Gnosis by which He knows Himself.\n\nTherefore, Glorification (التسبيح) was legislated, and everything was created upon it. It is negation of every description, not affirmation. For this reason, some speculative theologians (أهل النظر) reached something of this, even though the scholars did not approve of their approach. However, it is true in reality from a subtle perspective. They saw that participation (مشاركة) between the created (المحدث) and Allah is not valid, even in the application of terms to Him. So, if they were asked, \"Allah is Existent,\" they would say, \"He is not non-existent,\" because the created is described by existence, and there is no participation. If they were asked, \"Allah is Living,\" they would say, \"He is not dead.\" \"Allah is Knowing,\" they would say, \"He is not ignorant.\" \"Allah is Powerful,\" they would say, \"He is not incapable.\" \"Allah is Willing,\" they would say, \"He is not deficient.\" Thus, they used the word of negation. Glorification is transcendence and negation, not affirmation. They followed the principle with which Allah caused everything to speak, thus pursuing a strange path among the speculative thinkers.\n\nPraising Allah through Glorification (التسبيح) does not tire the tongues, unlike praising Him through the Names, where the tongues tire, become exhausted, and stop. For this reason, the one who was legislated to speak of the praise of Allah concluded, upon exhaustion and limitation, by saying: \"I cannot enumerate Your praise; You are as You have praised Yourself.\"\n\nConsider the wisdom of Allah the Exalted in that He did not assign Himself an Attribute (*Sifa*) in His Books, but rather transcended Himself from description, saying: <<وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَى>> (And to Allah belong the Beautiful Names). He made them Names (أسماء) and did not make them Attributes (نعوت) or Qualities (صفات). He said: <<فَادْعُوهُ بِهَا>> (So call upon Him by them). And by them was the praise.\n\nThe Name is what gives praise, and what gives praise is the Attribute and the Quality. Most people are unaware that the Real did not mention an Attribute for Himself in His creation, but rather made them Names, like proper nouns (أسماء الأعلام) which are not intended for praise but for indication (الدلالة).\n\nThose Beautiful Divine Names are Attributes for us, by which we are praised, and by which we praise ourselves, and by which Allah praised Himself. This is because we established earlier that the descent of the Divine Laws (الشرائع) into the world from Allah only descends according to the convention (حكم ما تواطأ عليه) of the people of that language, whether the people of that language agree with the truth in that or not.\n\nPeople have conventionally agreed that these Names by which the Real named Himself are used for praise in created things when they characterize the one they characterize as an attribute or quality. So Allah praised Himself with them, but He drew attention to the fact that they are Names, not Attributes, so that the perceptive listener understands that this is due to the ruling of convention, not the ruling of the matter in itself, as the legal evidence indicates: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him) in all respects. He does not accept whereness (*Ayniyya*), for if He accepted it, the absolute statement <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> would not be true, since accepting whereness is a form of resemblance. As for the rational proof, it does not affirm it at all. Yet, the ruling is based on convention.\n\nThe Messenger of Allah, peace and blessings be upon him, asked the mute black slave girl: \"Where is Allah?\" He applied the term of whereness (*Ayniyya*) to Him, knowing that *Ayniyya* in His regard is in the position of a Name, not an Attribute. The slave girl pointed to the sky. He accepted what she indicated and deemed her a believer, because Allah informed about Himself that He is in the sky, and she affirmed His report, so she was a believer. The Prophet, peace and blessings be upon him, did not say at that point that she was a scholar. He ordered her manumission (عتق). Manumission is liberation from the bond of servitude. The Prophet, peace and blessings be upon him, signaled by her manumission from the bond of servitude and ownership that <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> is liberation from the bond of whereness (*Ayniyya*) and the fulfillment of the spatial term that the slave girl used in her answer.\n\nLook at the wonder of the Lawgiver, the Gnostic of Allah! All of this is transcendence (تنزيه). If the praise of Allah with the attributes of affirmation, which He made Names and which creation made Attributes (as they are attributes for them), occurs from the servant merely as a form (صورة), and the spirit (روح) of that form is not Glorification (تسبيح) with \"There is nothing like unto Him,\" then it is ignorance of what the Praised One deserves, for he has subjected Him to limit and confinement. This is contrary to them being Names, not Attributes.\n\nO friend of Allah, let your praise of Allah never be separated from Glorification (التسبيح) entirely! For if you are in this state, you have breathed a spirit into the form of your praise that you initiated. Do not be among the image-makers (المصورين) who will be punished on the Day of Resurrection by being told, \"Give life to what you have created,\" while they have no power to do so there, because claims there are not accepted due to the unveiling of matters. In this world, it is not so.\n\nThen look at the verification of what we mentioned concerning the initiation of the form of praise when the spirit of Glorification is not breathed into it, in His saying to a group: <<قُلْ أَرَأَيْتُم مَّا تَدْعُونَ مِن دُونِ اللَّهِ أَرُونِي مَاذَا خَلَقُوا مِنَ الْأَرْضِ>> (Say, 'Have you considered what you invoke besides Allah? Show me what they have created of the earth.')\n\nIf they had said that Jesus was invoked as a god besides Allah, and he created from the earth when he kneaded it into clay—by the integration of the earthy parts with the moisture and coolness in the water, which increased the coolness of the earth and made it too heavy for dissolution, and the moisture removed the dryness in the earth, so its parts cohered for the appearance of the bird's shape—the Real would have presented, because of this statement, that Jesus's creation of the bird was by the permission of Allah. Thus, his creation was an act of worship by which he drew near to Allah, because he was authorized to do so. So He said: <<وَإِذْ تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ بِإِذْنِي فَتَنفُخُ فِيهَا فَتَكُونُ طَيْرًا بِإِذْنِي>> (And when you created from clay the shape of a bird by My permission, and you breathed into it, and it became a bird by My permission). He only attributed his creation to the permission of Allah. The commanded one is a servant, and a servant cannot be a god.\n\nWe only brought up this issue because of the generality of the word *ma* (ما), for it is a word applied to everything, whether rational or non-rational, as Sibawayh said, and he is the authority in the science of language. Some who claim expertise in this field say that the word *ma* is specific to the non-rational, and *man* (من) is specific to the rational. This is an unverified statement. We have seen in the speech of the Arabs the pluralization of the non-rational with the rational, and the application of *ma* to the rational. We only said this so that it is not claimed that in His saying <<مَا تَدْعُونَ مِن دُونِ اللَّهِ>> (what you invoke besides Allah), He only meant the non-rational, and since Jesus is rational, he would not be included in this address. The saying of Sibawayh is more appropriate.\n\nWe have thus translated concerning this station, including a warning about its loftiness and its elusiveness for the one who enters it if he is not constantly vigilant. It contains sciences, including the knowledge of what Allah specified for the primacy of Praise (أولية الحمد) concerning Mercy: did He grant it the general Mercy (الرحمة العامة) or the specific Mercy (الرحمة الخاصة)? For the Mercy adjacent to it is the obligatory Mercy, which is a part of the general Mercy. Does the Banner of Praise restrict itself to this, meaning that He is only praised with the Beautiful Names according to convention, or does it extend to the general Mercy in praising Allah with all Names and metaphors (الكنايات)? For He has absolute action without restriction, and He has every Name that action requires, even if it is not applied to Him. The general Divine Mercy encompasses these Names which convention does not allow to be applied to Him, so they are applied to Him out of Mercy for them, and you find them inscribed on the banner. This is a noble science concerning which we had intended to write a book, but we limited ourselves to a small part of it, which we named *The Knowledge of the Entrance to the Names and Metaphors* (معرفة المدخل إلى الأسماء والكنايات). It is a strange and unique method that I have not seen anyone among the predecessors draw attention to, despite their knowledge of it.\n\nAmong the sciences of this station is the knowledge of the general (علم الإجمال) which is followed by detail without delay. It contains the knowledge of the descent of the Books: from where they descend, what Divine Presence (حضرة) they originate from among the Divine Names, and whether all revealed Books descend from a single Presence of Names or if their Presences differ according to the difference in the reason for their descent. For the Torah, even though Allah wrote it with His Hand, did not descend for the purpose of miraculous challenge (الإعجاز عن المعارضة), while the Quran descended as a miracle. Thus, the Presence of Allah’s Names must differ, and each Book must be attributed to its specific Name among the Divine Names.\n\nIt contains the knowledge of the Real created by Him (الحق المخلوق به), which Sahl ibn Abdullah considered to be Justice (العدل). It contains the knowledge of the People of the Veils (أهل الحجب) in their turning away from the call of the Real: is their turning away due to ignorance, obstinacy, or denial? It contains the knowledge of what distinguishes Allah from those who are claimed to possess divinity but lack the specific attribute of the Deity. It contains the knowledge of what the intellectual proofs seize by the power of thought. It contains the knowledge of the reason for the delay of the answer when supplicating. It contains the knowledge of the cause of a saint becoming an enemy. It contains the knowledge of whether superiority in understanding Allah is due to preparedness (الاستعداد) or to the Will (المشيئة).\n\nIt contains the knowledge of Divine Witnessing (الشهادة الإلهية) for the one witnessed for and against, and the gathering of the one witnessed for and against in Mercy after the performance [of the testimony], even if there was no reconciliation initially, and without the need for a claim or testimony. If the Real is the Witness, who is the Judge before whom He testifies? If He judged by His knowledge, He would not be a witness. Related to this science is the knowledge of testimony and the levels of witnesses and witnessing therein. Does the Judge have the right to judge by his knowledge, or must he abandon his knowledge for the testimony of witnesses, even if their testimony is not false testimony? For example, if witnesses testify that Zayd is owed such-and-such a number of dirhams by Amr, and this is true according to their knowledge, but the Judge knows with certainty that Amr has already paid Zayd this due, and Zayd has no witnesses except the Judge's knowledge, and the Judge knows that the witnesses testified based on what they knew and were unaware that Amr had delivered the payment to Zayd.\n\nIt contains the knowledge of the source from which the truthful person is denied by those who deny him, despite the possibility of what he claims in his reports. It contains the knowledge of the reasons for the removal of fear in moments of fear. It contains the knowledge of proportionality in recompense (الجزاء الوفاق): is what exceeds the proportional recompense considered recompense or a gift? Does painful recompense equal pleasurable recompense in increase, or does increase only occur in the recompense that brings bliss, while in pains, nothing is added beyond proportionality? And to what does His saying <<زِدْنَاهُمْ عَذَابًا فَوْقَ الْعَذَابِ>> (We will increase them in torment over the torment) refer? And His saying: <<كُلَّمَا نَضِجَتْ جُلُودُهُمْ بَدَّلْنَاهُمْ جُلُودًا غَيْرَهَا لِيَذُوقُوا الْعَذَابَ>> (Every time their skins are roasted through, We will replace them with other skins so they may taste the punishment)—are these renewed skins part of the proportional recompense or part of the increase? And their saying: <<لَن تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَّعْدُودَةً>> (The Fire will not touch us except for a few days)—do they have a valid basis for this statement, or not? And Allah’s saying concerning these people: <<بَلَى مَن كَسَبَ سَيِّئَةً وَأَحَاطَتْ بِهِ خَطِيئَتُهُ فَأُولَئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ>> (Yes, whoever earns evil and is surrounded by his sin—those are the companions of the Fire; they will abide therein eternally)—does this contradict their saying: <<لَن تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَّعْدُودَةً>>? For not everyone who enters the Fire is touched by it, as the angels of torment are in the Fire, and it is their abode, yet the Fire does not touch them. Allah did not say after <<وَأَحَاطَتْ بِهِ خَطِيئَتُهُ>> that those are the ones whom the Fire touches.\n\nIt contains the knowledge of the origin of the children of Adam and their natural and spiritual form. It contains the knowledge of the description (الوصف) in which, if the servant is established, Allah overlooks his misdeeds. It contains the knowledge of rights and those entitled to them. It contains the knowledge of the difference between Presentation (*‘Ard*) and Standing (*Wuqūf*). For it is reported: <<وَلَوْ تَرَى إِذْ وُقِفُوا عَلَى رَبِّهِمْ>> (And if you could but see when they are made to stand before their Lord), and it is reported: <<يَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى النَّارِ>> (The Day when those who disbelieved are presented to the Fire), and it is reported: <<وَلَوْ تَرَى إِذْ وُقِفُوا عَلَى النَّارِ>> (And if you could but see when they are made to stand before the Fire). Is Presentation (*‘Ard*) entry or not?\n\nIt contains the knowledge of Correspondence (علم المطابقة), which is a rare science. It contains the knowledge of the opposition of similitudes. It contains the knowledge of what is obligatory upon the Messengers and what is not. It contains the knowledge of the lack of trust in known causes for a certain matter that should result from them, but the opposite appears—from where did the error occur for the one who trusted them? It contains the knowledge of which things perish and which do not, and whether those that perish do so essentially (بالذات) or not.\n\nIt contains the knowledge that everything is in you and from you, so no strange matter that is not already within you will ever occur to you. Thus, nothing is unveiled to you except yourself. This is also a rare science that not everyone among the People of Allah knows. It contains the knowledge of the difference between the categories of the world. It contains the knowledge of Emulation (الاقتداء). It contains the knowledge of the Great Time (الزمان الكبير) from the Small Time (الزمان الصغير), and the appearance of the Great Time as short, like the time of bliss and union, and the appearance of the Small Time as long, like the time of pains and separation.\n\n<<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).",
    "ur": "## باب نمبر تین سو اڑتیس: عقبات السویق (عقبات السويق) کی منزل کی معرفت میں، اور یہ حضرت محمدیہ (الحضرة المحمدية) سے ہے\n\nفتح دو طرح کی ہے، معنی میں اور کلام میں،\nپس جو کامل ہو جائے وہ جامع الحکم (جامع الحكم) کہلاتا ہے۔\n\nاور اگرچہ کائنات (الأكوان) میں اس کی منزل پست ہو،\nکلام کی حضرت (حضرة الكلم) میں اس کے لیے بلندی ہوتی ہے۔\n\nوہ معنی میں اپنے مرتبے کے لحاظ سے مقدم ہے،\nعالم نور (عالم النور) میں، نہ کہ عالم ظلمت (عالم الظلم) میں۔\n\nاللہ کے بندوں کو حقیر نہ جانو کہ ان کے لیے\nاللہ، صاحبِ انعامات و نعمتوں کی طرف سے ایک حصہ ہے۔\n\nپس کائنات کو عظیم جانو، کیونکہ مدلول اس کا طالب ہے،\nاور وہ (مدلول) آفات اور الزامات سے پاک ہے۔\n\n### [یہ کہ اللہ کے لیے مقام محمود (المقام المحمود) میں سات جھنڈے ہیں]\n\nجان لو کہ اللہ کے لیے مقام محمود (المقام المحمود) میں، جہاں رسول اللہ صلی اللہ علیہ وسلم کو قیامت کے دن ان کے نام حمید کے ساتھ کھڑا کیا جائے گا، سات جھنڈے ہیں جنہیں \"الویۃ الحمد\" (ألوية الحمد) کہا جاتا ہے۔ یہ رسول اللہ صلی اللہ علیہ وسلم اور ان کے محمدی وارثوں کو دیے جائیں گے۔ ان جھنڈوں میں اللہ کے وہ اسماء درج ہوں گے جن کے ذریعے آپ صلی اللہ علیہ وسلم قیامت کے دن مقام محمود (المقام المحمود) میں کھڑے ہو کر اپنے رب کی ثنا کریں گے۔ اور یہ آپ صلی اللہ علیہ وسلم کا وہ قول ہے جب آپ سے شفاعت کے بارے میں پوچھا جائے گا تو آپ فرمائیں گے: \"میں اللہ کی ایسی تعریفیں کروں گا جنہیں میں ابھی نہیں جانتا۔\"\n\nیہ (محامد) ان اسماء کے ذریعے اللہ سبحانہ کی ثنا کرنا ہے جن کا تقاضا وہ مقام کرتا ہے۔ اللہ تعالیٰ کی ثنا صرف اس کے اسماء حسنیٰ (الأسماء الحسنى) کے ذریعے ہی کی جاتی ہے، اور اس کے اسماء سبحانہ کا علم احاطہ نہیں کیا جا سکتا۔ کیونکہ ہم جانتے ہیں کہ:\n\n> إِنَّ فِي الْجَنَّةِ مَا لَا عَيْنٌ رَأَتْ وَلَا أُذُنٌ سَمِعَتْ وَلَا خَطَرَ عَلَى قَلْبِ بَشَرٍ\n> (بے شک جنت میں وہ کچھ ہے جو نہ کسی آنکھ نے دیکھا، نہ کسی کان نے سنا، اور نہ کسی انسان کے دل میں اس کا خیال گزرا۔)\n\nاور ہم جانتے ہیں کہ ہم نہیں جانتے کہ ہمارے لیے آنکھوں کی ٹھنڈک میں سے کیا کچھ چھپا رکھا گیا ہے۔ اور ان میں سے کوئی بھی چیز ایسی نہیں ہے جو اس اسم الٰہی (الاسم الإلهي) پر مبنی نہ ہو جس کے ذریعے وہ ظاہر ہوئی جب اللہ نے اسے ظاہر کیا۔ اور وہ اسم الٰہی جس کے ذریعے اللہ تعالیٰ نے ہم پر احسان کیا کہ اسے ہمارے لیے ظاہر کیا، تو لازمی ہے کہ ہم اسے جانیں اور اس کے ذریعے اللہ کی ثنا کریں اور اس کی حمد کریں، خواہ وہ ثنائے تنزیہ (ثناء تسبيح) ہو یا ثنائے اثبات (ثناء إثبات)۔ جب مجھے یہ معلوم ہوا تو میں نے ان اسماء کی تعداد کے بارے میں پوچھا جن کے ذریعے اللہ تعالیٰ کی حمد قیامت کے دن مقام محمود (المقام المحمود) میں کی جائے گی۔\n\nکیونکہ میں جانتا تھا کہ میں انہیں ابھی نہیں جانتا اور نہ ہی اللہ مجھے ان کا علم دے گا، کیونکہ یہ ان محامد میں سے ہیں جو قیامت کے دن آپ صلی اللہ علیہ وسلم کے ساتھ خاص ہیں۔ پس جب ہم آپ صلی اللہ علیہ وسلم کو قیامت کے دن مقام محمود (المقام المحمود) میں ان کے ذریعے حمد کرتے ہوئے سنیں گے، اور جھنڈے پھیلائے جائیں گے اور محامد ان میں درج ہوں گے، تو اس مقام پر ہم انہیں جان لیں گے۔ مجھے بتایا گیا کہ ان اسماء کی تعداد ایک ہزار چھ سو چونسٹھ (۱۶۶۴) اسماء ہے۔ ان میں سے ہر جھنڈے پر ننانوے (۹۹) اسماء درج ہوں گے، جو شخص وہاں ان کا احصاء کرے گا وہ جنت میں داخل ہو گا، سوائے ان جھنڈوں میں سے ایک جھنڈے کے، جس میں سات سو ستر (۷۷۰) اسماء درج ہوں گے، جن کے ذریعے آپ صلی اللہ علیہ وسلم اپنے رب کی حمد کریں گے۔ یہ تمام محامد شفاعت کی طلب کو متضمن ہیں۔ اور یہ منزل ان لوگوں کو مشاہدہ عطا کرتی ہے جو اس میں اترتے ہیں، تاکہ وہ ان جھنڈوں میں سے ہر ایک کا مشاہدہ کریں اور ان اسماء کا علم حاصل کریں جو ان میں درج ہیں، تاکہ یہ وارث وہاں اللہ کی ثنا کرے۔ اور ان میں سے ہر جھنڈے کے لیے یہاں ایک منزل ہے جسے آپ صلی اللہ علیہ وسلم نے حاصل کیا اور آپ کے کامل پیروکاروں میں سے کامل وارث اسے حاصل کرتے ہیں۔ یہ منزل ایک بلند اور مشکل چڑھائی والی منزل ہے، اسی لیے اسے \"عقبہ\" (عقبة) کہا گیا، اور اسے \"السویق\" (السويق) کی طرف اس لیے منسوب کیا گیا کہ اس میں قدموں کو ثبات نہیں ملتا، کیونکہ یہ قدموں کے پھسلنے کی جگہ ہے۔ پس اسے صرف ایک کامل شخص ہی عبور کر سکتا ہے، خواہ وہ رسول ہو، نبی ہو، یا کامل وارث ہو جو اپنے زمانے میں ہر وارث کو حجاب میں رکھتا ہو۔ اور یہی وہ منزل ہے جسے نفری نے \"موقف السواء\" (موقف السواء) کا نام دیا ہے، کیونکہ اس میں بندہ ذات حق (الحق) کی صورت میں ظاہر ہوتا ہے۔ اگر اللہ تعالیٰ اس بندے پر عصمت (العصمۃ) اور حفاظت کا احسان نہ کرے اور اس عقبہ میں اس کے قدم کو ثابت نہ رکھے، اس طرح کہ اس ظہور میں اس کا اپنی عبودیت (عبوديته) کا شہود (شہود) اس کی آنکھوں کے سامنے قائم رہے، اور اگر اس کی حالت یہ نہ ہو، تو اس کا قدم پھسل جائے گا اور اس کے اور اس کی عبودیت کے شہود کے درمیان رکاوٹ ڈال دی جائے گی، اس صورت حق (صورة الحق) کی وجہ سے جو اس نے اپنے آپ میں دیکھی، اور اس نے حق کو اپنی عبودیت کی صورت میں دیکھا، اور معاملہ اس پر الٹ ہو گیا۔ یہ ایک مشکل مشہد ہے۔ کیونکہ اللہ تعالیٰ اپنے غنیٰ عن العالمین (عالموں سے بے نیازی) کے مقام سے نیچے اتر کر اپنے بندوں سے قرض طلب کرتا ہے۔ اور اسی وجہ سے بعض نے کہا:\n\n> إِنَّ الله فَقِيرٌ وَنَحْنُ أَغْنِياءُ\n> (بے شک اللہ فقیر ہے اور ہم غنی ہیں)\n\nحالانکہ وہ (اللہ) غنی ہے اور وہ (بندے) فقیر ہیں۔ پس ان کے نزدیک معاملہ الٹ ہو گیا۔ اور یہ مکر الٰہی (المكر الإلهي) میں سے ہے جس کا انہیں شعور نہیں ہوتا۔ پس جو شخص مکر الٰہی (المكر الإلهي) سے عصمت (العصمۃ) کا راستہ چاہتا ہے، اسے ہر حال میں اپنی عبودیت اور اس کے لوازم کو لازم پکڑنا چاہیے، کیونکہ یہ اس کی مکر الٰہی سے عصمت کی علامت ہے۔ اور یہ بات باقی رہتی ہے کہ وہ مستقبل میں اس سے بے خوف نہیں ہوتا، یعنی وہ اس بات پر مطمئن نہیں ہوتا کہ یہ حالت مستقبل میں اس کے لیے باقی رہے گی، سوائے اس تعریف الٰہی کے جو تاویل سے پاک ہو اور جس پر اجمال کا حکم نہ لگایا جا سکے۔ اور اس منزل میں وہ اللہ تعالیٰ کے اس قول کا مشاہدہ کرتا ہے:\n\n> وَلَكِنَّ الله رَمَى\n> (بلکہ اللہ نے پھینکا)\n\nاور محمد صلی اللہ علیہ وسلم حسی طور پر پھینکنے والے ہیں جس پر نظر پڑی، اور اس منزل میں اس کے لیے اللہ کا یہ قول قائم ہوتا ہے:\n\n> وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ\n> (اور اللہ نے تمہیں اور تمہارے اعمال کو پیدا کیا)\n\n### [یہ کہ معاملہ رب اور بندے کے درمیان محدود ہے، پس رب کے لیے ایک راستہ ہے اور بندے کے لیے ایک راستہ ہے]\n\nاور جان لو کہ مساوات (السواء) دو راستوں کے درمیان ہے۔ کیونکہ معاملہ رب اور بندے کے درمیان محدود ہے۔ پس رب کے لیے ایک راستہ ہے اور بندے کے لیے ایک راستہ ہے۔ بندہ رب کا راستہ ہے، پس اس کی انتہا رب کی طرف ہے۔ اور رب بندے کا راستہ ہے، پس اس کی انتہا رب کی طرف ہے۔ پس پہلا عام راستہ جو تمام مخلوق میں ہے، وہ یہ ہے کہ ذات حق (الحق) مخلوق کی صفات کے احکام کے ساتھ ظاہر ہوتی ہے۔ یہ عموم میں مخلوق کی صفات کے احکام ہیں، اور ہمارے نزدیک یہ ذات حق (الحق) کی صفات ہیں نہ کہ مخلوق کی۔ اور یہی مساوات (السواء) کا معنی ہے۔ اور دوسرا راستہ یہ ہے کہ مخلوق ذات حق (الحق) کی صفات کے ساتھ ظاہر ہو، جو عموم میں ذات حق (الحق) کی صفات کے طور پر ممتاز ہوتی ہیں، جیسے اسماء حسنیٰ (الأسماء الحسنى) اور ان جیسی صفات۔ اور یہ عام لوگوں کے علم کی حد ہے۔ اور ہمارے نزدیک اور خواص کے نزدیک، یہ سب اصالتاً ذات حق (الحق) کی صفات ہیں، خواہ ان میں سے جو مخلوق کی طرف منسوب کی جاتی ہیں جنہیں عام لوگ اللہ کی طرف سے ہماری طرف نزول سمجھتے ہیں، وہ ہمارے نزدیک ذات حق (الحق) کی صفات ہیں، اگرچہ بندے کا مرتبہ اللہ کے نزدیک بلند ہو جائے یہاں تک کہ وہ ان سے مزین ہو جائے۔ پس یہ عام لوگوں کے نزدیک نقص کے اسماء ہیں، اور ہمارے نزدیک کمال کے اسماء ہیں۔ کیونکہ اصالتاً کوئی مسمیٰ نہیں ہے سوائے اللہ کے۔ اور جب اس نے مخلوق کو ظاہر کیا تو انہیں اپنے اسماء میں سے جو چاہا عطا کیا اور انہیں ان کے ذریعے متحقق کیا۔ اور مخلوق اپنے امکانی وجود اور مرجح (ترجیح دینے والے) کی محتاجی کی وجہ سے نقص کے مقام پر ہے۔ پس جو کچھ وہ گمان کرتے ہیں کہ وہ ان میں اصل ہے اور ان کا حق ہے، وہ اسی حکم میں ان کی پیروی کرتے ہیں، پس وہ ان خلقی اسماء پر نقص کا حکم لگاتے ہیں۔ اور جب انہیں یہ خبر پہنچتی ہے کہ ذات حق (الحق) نے ان اسماء سے اپنا نام رکھا ہے اور ان سے اپنی صفت بیان کی ہے، تو وہ اسے حق تعالیٰ کی طرف سے ان کی صفات کے ساتھ ان کی طرف نزول قرار دیتے ہیں۔ اور وہ نہیں جانتے کہ یہ اصالتاً حق کے اسماء ہیں۔ پس ہمارے مذہب کے مطابق، مخلوق کا ذات حق (الحق) کی صفات کے ساتھ ظہور تمام مخلوق کو شامل ہے۔ پس ان کا ہر نام حق کے لیے حق ہے جو مخلوق کے لیے مستعار ہے۔ اور جماعت کے مذہب کے مطابق، یہ صرف اہل خصوص کے لیے ہوتا ہے، یعنی صرف اسماء حسنیٰ (الأسماء الحسنى) میں سے۔ اور ہمارے نزدیک، اس کا علم صرف اہل اللہ کے خواص کو ہی ہوتا ہے۔ اور ہمارے اس قول میں کہ \"یہ نہیں ہوتا\" اور ہمارے اس قول میں کہ \"اس کا علم نہیں ہوتا\" میں بہت بڑا فرق ہے۔ کیونکہ ذات حق (الحق) نفس الامر میں ہر آنکھ سے مشہود ہے، اور اس کا علم صرف اہل اللہ کے چند افراد کو ہی ہوتا ہے۔ اور یہ صدیق اکبر رضی اللہ عنہ کے اس قول کی طرح ہے: \"میں نے کوئی چیز نہیں دیکھی مگر یہ کہ میں نے اس سے پہلے اللہ کو دیکھا اور اسے پہچانا۔\" پس جب وہ چیز اپنی مقید آنکھ کے لیے ظاہر ہوتی ہے، اور اس نے اس سے پہلے اللہ کو دیکھا ہوتا ہے، تو وہ اس چیز میں اسے ممتاز کرتا ہے اور جانتا ہے کہ وہ چیز حق کے لباسوں میں سے ایک لباس ہے جو زینت کے لیے اس میں ظاہر ہوا ہے۔ پس یہ اللہ کی وہ زینت ہے جس سے اس نے اپنے بندوں کے لیے زینت اختیار کی۔ یہ صدیق کا مقام ہے۔ پس اہل اللہ دوسروں سے صرف اس علم کے ذریعے ممتاز ہوتے ہیں، کیونکہ معاملہ بذات خود اسی پر ہے۔ اور عام لوگوں کے نزدیک، یہ صرف اہل عنایت کے لیے ہوتا ہے جو حق کے ساتھ متحقق ہوتے ہیں، اور ان کے علاوہ دوسرے ان کے نزدیک حق کے بغیر مخلوق ہیں۔ پھر ہم واپس آتے ہیں اور کہتے ہیں کہ اللہ نے اس منزل کے لیے ایک دروازہ بنایا ہے جسے \"باب الرحمۃ\" (باب الرحمة) کہا جاتا ہے، اسی سے اس میں داخلہ ہوتا ہے، پس وہ اسے ان ہلاک کرنے والی آفات سے بچاتا ہے جن کی طرف ہم نے ابھی مساوات (السواء) کے حکم سے اشارہ کیا ہے۔ کیونکہ یہ دروازہ اس منزل کے لیے ایسا ہے جیسے عمل میں نیت ہوتی ہے۔ پس جو غفلت اور بھول عمل میں داخل ہو جائے، وہ عمل کی صحت پر اثر انداز نہیں ہوتی، کیونکہ نیت اس کی تلافی کر دیتی ہے، کیونکہ وہ اس عمل کے آغاز میں اصل ہے۔ پس وہ اس کی حفاظت کرتی ہے۔ اسی طرح اللہ نے بسم اللہ کو قرآن کی ہر سورت کے شروع میں رکھا ہے، پس وہ سورت کے لیے ایسی ہے جیسے عمل کے لیے نیت۔ پس ہر وعید اور ہر صفت جو شقاوت کو واجب کرتی ہے جو اس سورت میں مذکور ہے، تو بسم اللہ، جو اس میں موجود ہے، رحمن (الرحمن) عموم میں اور رحیم (الرحيم) خصوص میں، اس سورت میں موجود ان امور پر حکم لگاتی ہے جو اس بندے کو شقاوت دیتے ہیں جس میں وہ قائم ہوں، پس اللہ اس بندے پر رحم کرتا ہے، خواہ وہ رحمت خاصہ (الرحمة الخاصة) ہو جو واجب ہے، یا رحمت عامہ (الرحمة العامة) ہو جو رحمت امتنان ہے۔\n\nپس انجام رحمت کی طرف ہے بسم اللہ کی وجہ سے، پس یہ بشارت ہے۔ اور جہاں تک سورۃ التوبہ کا تعلق ہے، ان لوگوں کے نزدیک جو اسے سورۃ الانفال سے الگ ایک علیحدہ سورت قرار دیتے ہیں، تو اسے سورۃ التوبہ (الرجوع الٰہی) کہا گیا ہے، جو بندوں پر رحمت اور شفقت کے ساتھ اللہ کی طرف سے رجوع ہے۔ کیونکہ اس نے اپنی جانوں پر زیادتی کرنے والوں سے کہا، اور کسی ایک زیادتی کرنے والے کو خاص نہیں کیا:\n\n> يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا\n> (اے میرے بندو جنہوں نے اپنی جانوں پر زیادتی کی ہے، اللہ کی رحمت سے مایوس نہ ہو، بے شک اللہ تمام گناہوں کو بخش دیتا ہے)\n\nاگر وہ کہتا کہ رحمن (الرحمن) مسرفین میں سے کسی کو عذاب نہیں دے گا، تو جب اس نے اسم \"اللہ\" کا استعمال کیا، تو مغفرت پکڑ سے پہلے بھی ہو سکتی ہے اور پکڑ کے بعد بھی۔ اور اسی لیے اس نے آیت کو اس قول پر ختم کیا:\n\n> إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ\n> (بے شک وہی بخشنے والا، نہایت رحم والا ہے)\n\nپس اس نے آخر میں رحیم (الرحيم) کا ذکر کیا، یعنی ان کا انجام، اگرچہ انہیں پکڑا جائے، رحمت کی طرف ہے۔ اور رجوع الٰہی (الرجعة الإلهية) صرف رحمت کے ساتھ ہی ہوتا ہے، وہ اس کے بغیر اپنے بندوں کی طرف رجوع نہیں کرتا۔ پس اگر رجوع دنیا میں ہو، تو وہ انہیں اس کے ذریعے اپنی طرف لوٹا دیتا ہے، اور یہ اس کا قول ہے:\n\n> ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا\n> (پھر اس نے ان پر رجوع کیا تاکہ وہ توبہ کریں)\n\nاور اگر آخرت میں ہو، تو ان کا رجوع اس کے رجوع سے مقدم ہو گا، کیونکہ مقام اس کا تقاضا کرتا ہے۔ کیونکہ اس مشہد میں حاضر ہونے والی ہر مخلوق اپنے ہاتھوں میں گر جائے گی اور ضرورت کے تحت اپنے رب کی طرف رجوع کرے گی۔ پس اللہ ان کی طرف اور ان پر رجوع کرے گا۔ پس ان میں سے بعض وہ ہوں گے جن پر اللہ قیامت اور اس کی منزلوں میں رحمت کے ساتھ رجوع کرے گا، اور ان میں سے بعض وہ ہوں گے جن پر آگ میں داخل ہونے کے بعد رحمت کے ساتھ رجوع کرے گا، اور یہ احوال کے تقاضے اور شہود (الشهود) کے وقوع کے مطابق ہو گا۔ اور یہ سارا معاملہ حسی اور معنوی ہے۔ کیونکہ پوری کائنات ایک حرف ہے جو ایک معنی کے لیے آیا ہے، اور اس کا معنی اللہ ہے، تاکہ اس میں اپنے احکام کو ظاہر کرے، کیونکہ وہ بذات خود اپنے احکام کے ظہور کا محل نہیں ہو سکتا۔ پس معنی ہمیشہ حرف سے جڑا رہتا ہے، پس اللہ ہمیشہ عالم کے ساتھ رہتا ہے۔ اللہ تعالیٰ فرماتا ہے:\n\n> وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ\n> (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)\n\nپس جو شخص اس منزل میں داخل ہوتا ہے، اپنے پہلے قدم پر ہی اسے اللہ کی طرف سے ننانوے (۹۹) تجلیات (التجلی) حاصل ہوتی ہیں، سو میں سے ایک کم۔ ان میں سے نو تجلیات اس کی طرف پیش قدمی کرتی ہیں جن میں وہ اپنی صورت دیکھتا ہے، پس وہ اپنی حقیقت کو جانتا ہے۔ پھر اس کے بعد اسے نوے (۹۰) تجلیات میں کھڑا کیا جاتا ہے، پس وہ وہ کچھ دیکھتا ہے جو وہ نہیں جانتا تھا، جمع، قوت اور مقابلہ سے بلندی کی حضرت (حضرة جمع) سے۔ پس ذات حق (الحق) اس کی طرف نازل ہوتی ہے، اسے اپنے پاس سے علم سکھاتی ہے، اور اس کے داخلے کے وقت رحمت اس کے لیے پہلے ہی آ چکی ہوتی ہے۔ اور یہ حضرت موسیٰ علیہ السلام کے ساتھی خضر علیہ السلام کی منزل ہے۔\n\n### [یہ کہ کسی چیز کی کسی امر کے لیے اہلیت صرف ایک ذاتی صفت ہے]\n\nاور جان لو کہ کسی چیز کی کسی امر کے لیے اہلیت صرف ایک ذاتی صفت (نعت ذاتي) ہے، پس اس میں کسی دوسرے کی شرکت واقع نہیں ہوتی، سوائے ایک دور کی نسبت کے، جسے اگر تم تحقیق کرو تو وہ ثابت نہیں ہو گی اور تمہارا قدم اس میں پھسل جائے گا۔\n\nجیسا کہ صحیح حدیث میں آپ صلی اللہ علیہ وسلم نے فرمایا:\n> أَمَّا أَهْلُ النَّارِ الَّذِينَ هُمْ أَهْلُهَا وَهُمُ الَّذِينَ لَا يَخْرُجُونَ مِنْهَا رَأْسًا لِأَنَّهُمْ أَهْلُهَا فَإِنَّهُمْ لَا يَمُوتُونَ فِيهَا وَلَا يَحْيَوْنَ\n> (جہاں تک اہل نار کا تعلق ہے جو اس کے اہل ہیں، اور وہ جو اس سے بالکل نہیں نکلیں گے کیونکہ وہ اس کے اہل ہیں، تو وہ اس میں نہ مریں گے اور نہ زندہ رہیں گے۔)\n\nپس آپ صلی اللہ علیہ وسلم نے ان کی صفت زندگی اور موت کی نفی قرار دی، پھر آپ نے اس شخص کی صفت بیان کی جو اس میں داخل ہوا لیکن اس کا اہل نہیں تھا۔\n\nپس آپ نے فرمایا:\n> وَلَكِنْ نَاسٌ أَصَابَتْهُمُ النَّارُ بِذُنُوبِهِمْ فَأَمَاتَهُمُ اللَّهُ فِيهَا إِمَاتَةً\n> (لیکن کچھ لوگ ایسے ہیں جنہیں ان کے گناہوں کی وجہ سے آگ لگی، تو اللہ انہیں اس میں موت دے دے گا۔)\n\nپس آپ نے انہیں موت سے موصوف کیا، جو اس کی اہلیت رکھنے والے کی صفت کے خلاف ہے۔ پھر آپ نے ان لوگوں کے آگ سے نکلنے کا ذکر کیا۔ پس اس بات پر غور کرو کہ ذات حق (الحق) نے پوری کائنات کو اپنی حمد کے ساتھ تسبیح کرنے پر گویا کیا ہے۔ اور تسبیح تنزیہ ہے، نہ کہ کسی اثباتی امر کے ساتھ ثنا، کیونکہ اس کی ثنا صرف اسی سے کی جاتی ہے جس کا وہ اہل ہو، اور جو اس کے لیے ہے اس میں شرکت واقع نہیں ہوتی۔ اور اس نے اپنی ثنا صرف اپنے اسماء کے ذریعے کی ہے۔ اور ہمارے نزدیک اس کا کوئی بھی معلوم اسم ایسا نہیں ہے جس کے ساتھ بندے کے لیے تخلق اور اتصاف اس کی شان کے مطابق ممکن نہ ہو۔ پس جب عالم میں یہ ممکن نہ ہوا کہ وہ اس کی ثنا اس طرح کرے جس کا وہ اہل ہے، تو اس کی ثنا کو ہر چیز کی طرف سے تسبیح (تنزیہ) قرار دیا گیا۔ اور اسی لیے اس نے حمد کو اس کی طرف منسوب کیا، پس فرمایا:\n\n> يُسَبِّحُ بِحَمْدِهِ\n> (وہ اس کی حمد کے ساتھ تسبیح کرتا ہے)\n\nیعنی اس ثنا کے ساتھ جس کا وہ مستحق ہے اور جس کا وہ اہل ہے، اور وہ صرف تسبیح ہے۔ کیونکہ وہ سبحانہ فرماتا ہے:\n\n> سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ\n> (تیرا رب پاک ہے، جو عزت کا رب ہے، ان چیزوں سے جو وہ بیان کرتے ہیں)\n\nاور عزت (العزة) اس تک کسی بھی ثنا کے ذریعے پہنچنے سے روکنا ہے جو الٰہ کے لیے نہ ہو، اس سے جو وہ بیان کرتے ہیں۔ اور ہر ثنا کرنے والا وصف بیان کرنے والا ہے۔ پس اس نے ہر حال میں اور ہر آنکھ سے اپنی تسبیح کا ذکر کیا، پس فرمایا:\n\n> تُسَبِّحُ لَهُ السَّمَاوَاتُ السَّبْعُ وَالْأَرْضُ وَمَنْ فِيهِنَّ\n> (ساتوں آسمان اور زمین اور جو کچھ ان میں ہے، سب اس کی تسبیح کرتے ہیں)\n\nاور ان کے علاوہ کچھ نہیں ہے۔ اور اس نے محمد صلی اللہ علیہ وسلم کو ان کی رسالت کے اختتام پر اور اس ثنا کے بارے میں جو ان کے لیے مشروع کی گئی تھی، حکم دیتے ہوئے فرمایا:\n\n> فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ\n> (پس اپنے رب کی حمد کے ساتھ تسبیح کرو اور اس سے مغفرت طلب کرو)\n\nپس اس نے فرمایا: \"تم ویسے ہی ہو جیسے تم نے اپنی ثنا کی ہے۔\" یہی تسبیح بحمدہ ہے۔ پس جب اللہ کی ثنا کا معاملہ اس پر تھا جو ہم نے طے کیا، تو ہمارے لیے یہ ممکن نہ ہوا کہ ہم اس کے لیے کوئی ثنا اخذ کریں، بلکہ ہم اسے صرف اسی سے یاد کرتے ہیں جو اس نے اپنی کتابوں میں نازل کیا ہے، اس حد تک جو وہ خود جانتا ہے، نہ کہ اس حد تک جو ہم سمجھتے ہیں۔ پس ہم اس کی ثنا میں صرف حکایت کرنے والے اور تلاوت کرنے والے ہوتے ہیں، کیونکہ جس کی ثنا کی جا رہی ہے وہ ذات میں مجہول ہے، وہ حدود و رسوم کو قبول نہیں کرتا، اور کیفیت کے تحت داخل نہیں ہوتا، اور نہ ہی اسے ویسا جانا جا سکتا ہے جیسا کہ وہ بذات خود ہے۔ اور وہ غنی عن العالمین (عالموں سے بے نیاز) ہے۔ پس دلائل اس کی معرفت (المعرفۃ) پر دلالت نہیں کرتے، بلکہ وہ صرف اس پر دلالت کرتے ہیں کہ ہم اس کی طرف اس حیثیت سے منسوب ہیں کہ وہ ہماری مشابہت نہیں رکھتا یا ہمارے وصف کو قبول نہیں کرتا۔ اور کوئی اسم الٰہی ایسا نہیں ہے جس سے ہم متصف نہ ہوں، پس وہ مطلوبہ معرفت نہیں ہے جس سے وہ خود کو جانتا ہے۔ پس اس نے تسبیح کو مشروع کیا اور ہر چیز کو اس پر فطرت دی، اور یہ ہر وصف کی نفی ہے، نہ کہ اثبات۔ اور اسی لیے بعض اہل نظر اس میں سے کسی چیز تک پہنچے، اگرچہ علماء نے ان کے مسلک کو پسند نہیں کیا، لیکن وہ نفس الامر میں کسی خوبصورت پہلو سے حق ہے۔ اور وہ یہ ہے کہ انہوں نے دیکھا کہ محدث (پیدا کی گئی چیز) اور اللہ کے درمیان شرکت صحیح نہیں ہے، یہاں تک کہ الفاظ کے اطلاق میں بھی۔ پس جب ان سے کہا جاتا ہے کہ \"اللہ موجود ہے\"، تو وہ کہتے ہیں: \"وہ معدوم نہیں ہے۔\" کیونکہ محدث وجود سے موصوف ہے اور کوئی شرکت نہیں ہے۔ جب ان سے کہا جاتا ہے کہ \"اللہ حی (زندہ) ہے\"، تو وہ کہتے ہیں: \"وہ میت نہیں ہے۔\" \"اللہ عالم (جاننے والا) ہے\"، تو وہ کہتے ہیں: \"وہ جاہل نہیں ہے۔\" \"اللہ قادر (طاقتور) ہے\"، تو وہ کہتے ہیں: \"وہ عاجز نہیں ہے۔\" \"اللہ مرید (ارادہ کرنے والا) ہے\"، تو وہ کہتے ہیں: \"وہ قاصر نہیں ہے۔\" پس وہ نفی کا لفظ لائے، اور تسبیح تنزیہ اور نفی ہے، نہ کہ اثبات۔ پس وہ اس اصل پر چلے جس کے ساتھ اللہ نے ہر چیز کو گویا کیا۔ پس انہوں نے اہل نظر کے درمیان ایک عجیب راستہ اختیار کیا۔\n\nاور اللہ کی تسبیح کے ساتھ ثنا کرنے سے زبانیں نہیں تھکتیں، برخلاف اسماء کے ساتھ ثنا کرنے کے، کیونکہ زبانیں تھک جاتی ہیں، عاجز ہو جاتی ہیں اور رک جاتی ہیں۔ اور اسی لیے جس کو اللہ کی ثنا کرنے کی اجازت دی گئی تھی، اس نے عاجزی اور درماندگی کے وقت آخر میں کہا: \"میں تیری ثنا کا احصاء نہیں کر سکتا، تو ویسا ہی ہے جیسا تو نے خود اپنی ثنا کی ہے۔\" اور اللہ تعالیٰ کی حکمت پر غور کرو کہ:\n\nاس نے اپنی کتابوں میں اپنے لیے کوئی صفت مقرر نہیں کی، بلکہ اس نے خود کو وصف سے پاک قرار دیا، پس فرمایا:\n\n> وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَى\n> (اور اللہ ہی کے لیے اسماء حسنیٰ ہیں)\n\nپس اس نے انہیں اسماء قرار دیا اور انہیں نعوت (صفات) یا صفات نہیں بنایا۔ اور فرمایا:\n\n> فَادْعُوهُ بِهَا\n> (پس تم اسے ان کے ذریعے پکارو)\n\nاور انہی کے ذریعے ثنا کی جاتی تھی۔ اور اسم وہ نہیں ہے جو ثنا عطا کرے، بلکہ ثنا تو نعت اور صفت عطا کرتی ہے۔ اور اکثر لوگوں کو اس بات کا شعور نہیں ہوا کہ ذات حق (الحق) نے اپنی مخلوق میں اپنے لیے کوئی نعت ذکر نہیں کی، بلکہ اس نے انہیں اسماء قرار دیا، جیسے اسماء اعلام (نام) جو ثنا کے لیے نہیں آئے، بلکہ دلالت کے لیے آئے۔ اور وہ اسماء الٰہیہ حسنیٰ (الأسماء الإلهية الحسنى) ہمارے لیے نعوت ہیں جن کے ذریعے ہماری ثنا کی جاتی ہے، اور ہم نے اپنی ثنا کی، اور اللہ نے خود اپنی ثنا کی، کیونکہ ہم پہلے بیان کر چکے ہیں کہ دنیا میں شرائع کا اللہ کی طرف سے نزول صرف اس حکم کے مطابق ہوتا ہے جس پر اس زبان کے لوگ متفق ہوں، خواہ اس زبان کے لوگ اس میں حق کو پائیں یا نہ پائیں۔ اور لوگ اس بات پر متفق ہیں کہ یہ اسماء جن سے حق نے اپنا نام رکھا ہے، ان محدثات میں ثنا کے لیے استعمال ہوتے ہیں جب وہ کسی میں نعت یا صفت کے طور پر قائم ہوں۔ پس اللہ نے خود اپنی ثنا ان کے ذریعے کی اور اس بات پر متنبہ کیا کہ یہ اسماء ہیں نہ کہ نعوت، تاکہ سننے والا سمجھدار شخص یہ سمجھے کہ یہ توافق (تواطؤ) کا حکم ہے، نہ کہ نفس الامر کا حکم، جیسا کہ شرعی دلیل نے دلالت کی:\n\n> لَيْسَ كَمِثْلِهِ شَيْءٌ\n> (اس کی مثل کوئی چیز نہیں)\n\nتمام پہلوؤں سے۔ پس وہ \"کہاں\" (الأينية) کو قبول نہیں کرتا، کیونکہ اگر وہ اسے قبول کرتا تو \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" کا اطلاق صحیح نہ ہوتا، کیونکہ \"کہاں\" کو قبول کرنا مماثلت ہے۔ اور جہاں تک عقلی دلیل کا تعلق ہے، وہ اسے بالکل نہیں کہتی۔ اس کے باوجود، حکم توافق کا ہے۔\n\nپس رسول اللہ صلی اللہ علیہ وسلم نے گونگی سیاہ فام عورت سے پوچھا: \"اللہ کہاں ہے؟\" پس آپ نے اس پر \"کہاں\" (الأينية) کا لفظ استعمال کیا، کیونکہ آپ جانتے تھے کہ اس کے حق میں \"کہاں\" اسم کے درجے میں ہے نہ کہ نعت کے درجے میں۔ پس اس سیاہ فام عورت نے اشارے سے کہا: \"آسمان میں۔\" پس آپ نے اس کے اشارے کو قبول کیا اور اسے مومنہ قرار دیا۔\n\nکیونکہ اللہ نے خود اپنے بارے میں خبر دی ہے کہ وہ آسمان میں ہے، پس اس نے اس کی خبر کی تصدیق کی، پس وہ مومنہ تھی۔ اور آپ صلی اللہ علیہ وسلم نے اس وقت اس کے بارے میں یہ نہیں کہا کہ وہ عالمہ ہے۔ اور آپ نے اسے آزاد کرنے کا حکم دیا، اور آزادی عبودیت کی قید سے رہائی ہے۔ نبی صلی اللہ علیہ وسلم کی طرف سے اس کے حق میں عبودیت اور ملکیت کی قید سے آزادی کا تنبیہ اس بات پر ہے کہ \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" \"کہاں\" (الأينية) کی قید سے رہائی ہے، جو اس ظرف (جگہ) کی نفی ہے جسے اس سیاہ فام عورت نے جواب میں لایا تھا۔ پس اللہ کے عارف شارع کی حکمت پر غور کرو۔ اور یہ سب تنزیہ ہے۔ پس اللہ کی ثنا اثباتی صفات کے ساتھ کرنا جنہیں اس نے اسماء بنایا اور مخلوق نے انہیں نعوت بنایا، جیسا کہ وہ ان کے لیے نعوت ہیں، جب یہ ثنا بندے کی طرف سے صورت کے طور پر واقع ہو، اور اس صورت کی روح \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" کی تسبیح نہ ہو، تو یہ اس چیز سے جہالت ہو گی جس کا مثنیٰ علیہ مستحق ہے۔ کیونکہ اس نے اسے حد اور حصر کے تحت داخل کر دیا، برخلاف اس کے کہ وہ اسماء ہوں نہ کہ نعوت۔ پس اے ولی! تیری اللہ کی ثنا سے تسبیح کبھی جدا نہ ہو، ایک ہی جملے میں۔ کیونکہ جب تو اس مقام پر ہو گا، تو تو اپنی ثنا کی اس صورت میں روح پھونکے گا جسے تو نے ایجاد کیا ہے۔ پس تو ان صورت گروں میں سے نہ ہو جنہیں قیامت کے دن عذاب دیا جائے گا کہ ان سے کہا جائے گا: \"تم نے جو پیدا کیا ہے اسے زندہ کرو،\" اور وہاں ان میں اس کی قدرت نہیں ہو گی، کیونکہ وہاں دعویٰ اس چیز کے لیے واقع نہیں ہوتا جو امور کے کشف (الکشف) سے ظاہر ہو، اور دنیا میں ایسا نہیں ہے۔ پھر اس بات کی تحقیق میں غور کرو جو ہم نے ذکر کیا کہ ثنا کی صورت کو ایجاد کرنا جب اس میں تسبیح کی روح نہ پھونکی جائے، اللہ کا ایک گروہ سے یہ قول ہے:\n\n> قُلْ أَرَأَيْتُمْ مَا تَدْعُونَ مِنْ دُونِ اللَّهِ أَرُونِي مَاذَا خَلَقُوا مِنَ الْأَرْضِ\n> (کہو، کیا تم نے ان چیزوں کو دیکھا جنہیں تم اللہ کے سوا پکارتے ہو؟ مجھے دکھاؤ کہ انہوں نے زمین میں کیا پیدا کیا ہے؟)\n\nاگر وہ کہتے کہ عیسیٰ کو اللہ کے سوا معبود پکارا گیا، اور اس نے مٹی کو گوندھ کر زمین سے پیدا کیا، کیونکہ مٹی کے اجزاء پانی میں موجود رطوبت اور ٹھنڈک کی وجہ سے منظم ہو گئے، پس مٹی کی ٹھنڈک کی مقدار بڑھ گئی، پس وہ تحلیل سے بھاری ہو گئی اور تنظیم سے محروم ہو گئی، اور رطوبت نے مٹی میں موجود خشکی کو دور کر دیا، پس اس کے اجزاء پرندے کی شکل کے ظہور کے لیے آپس میں مل گئے۔ پس ذات حق (الحق) نے اس قول کی وجہ سے یہ بات پیش کی کہ عیسیٰ کا پرندے کو پیدا کرنا اللہ کے اذن سے تھا، پس اس کا پیدا کرنا ایک عبادت تھی جس کے ذریعے وہ اللہ کا قرب حاصل کرتا تھا، کیونکہ اسے اس کی اجازت دی گئی تھی۔ پس اس نے فرمایا:\n\n> وَإِذْ تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ بِإِذْنِي فَتَنْفُخُ فِيهَا فَتَكُونُ طَيْرًا بِإِذْنِي\n> (اور جب تم مٹی سے پرندے کی شکل بناتے تھے میرے اذن سے، پھر تم اس میں پھونکتے تھے تو وہ میرے اذن سے پرندہ بن جاتا تھا)\n\nپس اس نے اس کی تخلیق کو صرف اللہ کے اذن کی طرف منسوب کیا، اور مامور بندہ ہے، اور بندہ الٰہ نہیں ہو سکتا۔ اور ہم یہ مسئلہ اس لیے لائے کہ لفظ \"ما\" (ما) کا عموم ہے۔ کیونکہ یہ لفظ ہر چیز پر بولا جاتا ہے، خواہ وہ عقل رکھنے والا ہو یا عقل نہ رکھنے والا، جیسا کہ سیبویہ نے کہا ہے، اور وہ زبان کے علم میں مرجع ہے۔ کیونکہ اس فن کے بعض دعویدار کہتے ہیں کہ لفظ \"ما\" صرف عقل نہ رکھنے والے کے لیے خاص ہے اور \"من\" صرف عقل رکھنے والے کے لیے خاص ہے، اور یہ ایک غیر محرر قول ہے۔ اور ہم نے عربوں کے کلام میں دیکھا ہے کہ عقل نہ رکھنے والے کو عقل رکھنے والے کے ساتھ جمع کیا گیا ہے، اور \"ما\" کا اطلاق عقل رکھنے والے پر بھی کیا گیا ہے۔ اور ہم نے یہ اس لیے کہا تاکہ یہ نہ کہا جائے کہ اس کے قول: \"مَا تَدْعُونَ مِنْ دُونِ اللَّهِ\" میں صرف عقل نہ رکھنے والے مراد ہیں، اور عیسیٰ عقل رکھتے ہیں، پس وہ اس خطاب میں داخل نہیں ہوں گے۔ اور سیبویہ کا قول زیادہ اولیٰ ہے۔ پس ہم نے اس منزل کے بارے میں ترجمہ کیا ہے جس میں اس کی بلندی اور اس سے عالم کا چھٹکارا پانا شامل ہے، اگر اس کے لیے کوئی مستقل مراقب نہ ہو۔ اور یہ کئی علوم پر مشتمل ہے، جن میں سے ایک یہ علم ہے کہ اللہ نے الویۃ الحمد (ألوية الحمد) کی اولیت کو رحمت کے ساتھ خاص کیا ہے، کیا اس نے اسے رحمت عامہ (الرحمة العامة) عطا کی ہے یا خاصہ؟ کیونکہ جو اس کے پڑوس میں ہے وہ رحمت واجبہ (الرحمة الواجبة) ہے، اور وہ رحمت عامہ (الرحمة العامة) کا ایک حصہ ہے۔ پس کیا لواء الحمد (لواء الحمد) صرف اسی پر اکتفا کرے گا، یعنی اللہ کی ثنا صرف عرف میں اسماء حسنیٰ (الأسماء الحسنى) کے ذریعے کی جائے گی، یا وہ اس سے تجاوز کر کے رحمت عامہ (الرحمة العامة) تک جائے گا، جس میں تمام اسماء اور کنایات کے ذریعے اللہ کی ثنا کی جائے گی؟ کیونکہ اس کے لیے مطلق فعل ہے بغیر کسی قید کے، اور اس کے لیے ہر وہ اسم ہے جس کا فعل تقاضا کرتا ہے، اگرچہ اس پر اس کا اطلاق نہ کیا جائے۔ کیونکہ رحمت الٰہیہ عامہ (الرحمة الإلهية العامة) ان اسماء کو بھی شامل کرتی ہے جن کا عرف میں اس پر اطلاق نہیں ہوتا، پس ان پر رحمت کے طور پر اطلاق کیا جاتا ہے، پس تم انہیں جھنڈے میں درج پاؤ گے۔ اور یہ ایک شریف علم ہے، جس پر ہم نے ایک کتاب لکھنے کا ارادہ کیا تھا، لیکن ہم نے اس میں سے ایک چھوٹا سا حصہ پر اکتفا کیا جسے ہم نے \"معرفۃ المدخل إلی الأسماء والکنایات\" (معرفة المدخل إلى الأسماء والكنايات) کا نام دیا، اور یہ ایک عجیب و غریب اسلوب ہے جسے میں نے متقدمین میں سے کسی کو بھی اس پر متنبہ کرتے ہوئے نہیں دیکھا، باوجود اس کے کہ وہ اسے جانتے تھے۔ اور اس منزل کے علوم میں سے ایک علم اجمال کا ہے جس کے بعد بغیر تاخیر کے تفصیل آتی ہے۔ اور اس میں کتب کے نزول کا علم ہے کہ وہ کہاں سے نازل ہوتی ہیں اور اسماء الٰہیہ (الأسماء الإلهية) میں ان کی حضرات کیا ہیں؟ اور کیا تمام نازل شدہ کتب اسماء کی ایک ہی حضرت سے ہیں یا ان کے نزول کے سبب کے اختلاف سے ان کی حضرات مختلف ہوتی ہیں؟ کیونکہ تورات، اگرچہ اللہ نے اسے اپنے ہاتھ سے لکھا، لیکن وہ معارضہ سے عاجز کرنے کے لیے نازل نہیں ہوئی، اور قرآن معجزہ کے طور پر نازل ہوا، پس ضروری ہے کہ اللہ کے اسماء کی حضرات مختلف ہوں، پس ہر کتاب کو اس کے خاص اسم الٰہی کی طرف منسوب کیا جائے۔ اور اس میں اس حق کا علم ہے جس کے ذریعے مخلوق پیدا کی گئی، اور وہ سہل بن عبد اللہ کے نزدیک عدل (العدل) ہے۔ اور اس میں اہل حجاب کا علم ہے کہ وہ حق کی دعوت سے کیوں اعراض کرتے ہیں، کیا ان کا اعراض جہالت کی وجہ سے ہے یا عناد اور انکار کی وجہ سے؟ اور اس میں اس وصف کا علم ہے جس کے ذریعے اللہ اس سے ممتاز ہوتا ہے جس میں الوہیت کا دعویٰ کیا جاتا ہے، حالانکہ اس میں الٰہ کی صفت کی خصوصیت نہیں ہے۔ اور اس میں اس علم کا علم ہے کہ فکری قوت کے ذریعے عقل کے لیے دلائل کہاں سے حاصل ہوتے ہیں۔ اور اس میں دعا کے وقت اجابت میں تاخیر کا علم ہے، اس کا سبب کیا ہے؟ اور اس میں ولی کے دشمن بن جانے کا علم ہے، اس کا سبب کیا ہے؟ اور اس میں اللہ کی طرف سے سمجھنے میں تفاضل کا علم ہے، کیا یہ استعداد کی طرف لوٹتا ہے یا مشیئت (ارادہ) کی طرف؟ اور اس میں مشہود لہ اور مشہود علیہ کے لیے الٰہی شہادت کا علم ہے، اور ادائیگی کے بعد رحمت میں مشہود لہ اور مشہود علیہ کا جمع ہونا، اور پہلے صلح نہیں ہوئی تھی، اور نہ ہی دعویٰ اور شہادت کی ضرورت ہے۔ اور جب ذات حق (الحق) شاہد ہو، تو حاکم کون ہے جس کے پاس وہ شہادت دے؟ اگر وہ اپنے علم سے فیصلہ کرے تو وہ شاہد نہیں ہو گا۔ اور اس علم سے شہادت کا علم، اور شہداء کے مراتب اور ان میں شہود (الشهود) کا تعلق ہے۔ اور کیا حاکم کو اپنے علم سے فیصلہ کرنے کا حق ہے یا وہ اپنے علم کو گواہوں کی شہادت کے لیے چھوڑ دے، اگر ان کی شہادت جھوٹی شہادت نہ ہو، مثلاً گواہ یہ گواہی دیں کہ زید عمرو سے اتنا درہم کا مستحق ہے، اور ان کے نزدیک یہ ویسا ہی ہے جیسا انہوں نے گواہی دی، اور حاکم کو یقین سے معلوم ہو کہ عمرو نے یہ مستحق ادا کر دیا ہے، اور زید کے پاس حاکم کے علم کے علاوہ کوئی گواہ نہیں ہے، اور حاکم جانتا ہے کہ گواہوں نے وہی گواہی دی جو انہیں معلوم تھا، اور انہیں یہ علم نہیں تھا کہ عمرو نے زید کو وہ چیز پہنچا دی تھی جس پر شہادت واقع ہوئی تھی۔ اور اس میں صادق کو جھٹلانے کا علم ہے کہ اسے جھٹلانے والا کہاں سے جھٹلاتا ہے، حالانکہ اس کے دعووں میں امکان جائز ہے۔ اور اس میں خوف کے مقامات پر خوف کے ختم ہونے کے اسباب کا علم ہے۔ اور اس میں جزاء وفاق (بدلے کی مطابقت) میں مناسبت کا علم ہے۔ اور کیا جو جزاء وفاق سے زیادہ ہو، وہ جزاء ہو گا یا ہبہ ہو گا؟ اور کیا تکلیف دہ جزاء لذت بخش جزاء کے برابر ہو گی؟ یا زیادتی صرف اس جزاء میں ہو گی جس سے نعمت حاصل ہو، اور جہاں تک تکالیف کا تعلق ہے، تو وفاق سے زیادہ کچھ نہیں ہو گا؟ اور اللہ تعالیٰ کا یہ قول:\n\n> زِدْنَاهُمْ عَذَابًا فَوْقَ الْعَذَابِ\n> (ہم نے انہیں عذاب پر عذاب بڑھا دیا)\n\nیہ زیادتی کس چیز کی طرف لوٹتی ہے؟ اور اس کا یہ قول:\n\n> كُلَّمَا نَضِجَتْ جُلُودُهُمْ بَدَّلْنَاهُمْ جُلُودًا غَيْرَهَا لِيَذُوقُوا الْعَذَابَ\n> (جب بھی ان کی کھالیں پک جائیں گی، ہم انہیں دوسری کھالوں سے بدل دیں گے تاکہ وہ عذاب چکھیں)\n\nکیا یہ نئی کھالیں جزاء وفاق (الجزاء الوفاق) میں سے ہیں یا زیادتی میں سے؟ اور ان کا یہ قول:\n\n> لَنْ تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَعْدُودَةً\n> (ہمیں آگ صرف گنتی کے چند دن ہی چھوئے گی)\n\nکیا ان کے اس قول میں کوئی ایسا پہلو ہے جس میں وہ سچے ہوں یا ان کے لیے کوئی پہلو نہیں ہے؟ اور اللہ کا ان کے حق میں یہ قول:\n\n> بَلَى مَنْ كَسَبَ سَيِّئَةً وَأَحَاطَتْ بِهِ خَطِيئَتُهُ فَأُولَئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ\n> (کیوں نہیں، جس نے برائی کمائی اور اس کے گناہ نے اسے گھیر لیا، تو وہی دوزخی ہیں، وہ اس میں ہمیشہ رہیں گے)\n\nکیا یہ ان کے اس قول کے معارض ہے: \"لَنْ تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَعْدُودَةً\"؟ کیونکہ ہر وہ شخص جو آگ میں داخل ہو گا، اسے آگ نہیں چھوئے گی، کیونکہ عذاب کے فرشتے آگ میں ہیں اور وہ ان کا گھر ہے، اور آگ انہیں نہیں چھوتی۔ اور اللہ نے اپنے اس قول کے بعد یہ نہیں کہا: \"وَأَحَاطَتْ بِهِ خَطِيئَتُهُ\" تو وہی ہیں جنہیں آگ چھوئے گی۔ اور اس میں بنی آدم کی نشوونما اور ان کی طبعی اور روحانی صورت کا علم ہے۔ اور اس میں اس وصف کا علم ہے کہ جب بندہ اس میں قائم ہو جائے تو اللہ اس کی برائیوں سے درگزر کر دیتا ہے۔ اور اس میں حقوق اور ان کے مستحقین کا علم ہے۔ اور اس میں \"عرض\" (پیشی) اور \"وقوف\" (کھڑے ہونے) کے درمیان فرق کا علم ہے، کیونکہ یہ وارد ہوا ہے:\n\n> وَلَوْ تَرَى إِذْ وُقِفُوا عَلَى رَبِّهِمْ\n> (اور اگر تم دیکھو جب وہ اپنے رب کے سامنے کھڑے کیے جائیں گے)\n\nاور یہ وارد ہوا ہے:\n\n> يَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى (النَّارِ) رَبِّهِمْ\n> (جس دن کافروں کو ان کے رب کے سامنے پیش کیا جائے گا)\n\nاور یہ وارد ہوا ہے:\n\n> وَلَوْ تَرَى إِذْ وُقِفُوا عَلَى النَّارِ\n> (اور اگر تم دیکھو جب وہ آگ کے سامنے کھڑے کیے جائیں گے)\n\nاور یہ وارد ہوا ہے:\n\n> وَيَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى النَّارِ\n> (اور جس دن کافروں کو آگ پر پیش کیا جائے گا)\n\nاور کیا عرض (پیشی) دخول ہے یا نہیں؟ اور اس میں مطابقت کا علم ہے، اور یہ ایک نایاب علم ہے۔ اور اس میں امثال کی تضاد کا علم ہے۔ اور اس میں ان چیزوں کا علم ہے جو رسولوں پر واجب ہیں اور جو واجب نہیں ہیں۔ اور اس میں کسی امر کے لیے معروف اسباب پر عدم اعتماد کا علم ہے جو ان سے واقع ہونا چاہیے، لیکن اس کے برعکس ظاہر ہوتا ہے، تو جس نے ان پر بھروسہ کیا اسے غلطی کہاں سے لگی؟ اور اس میں ان چیزوں کا علم ہے جو فنا ہو جائیں گی اور جو فنا نہیں ہوں گی، اور جو فنا ہوں گی کیا وہ بذات خود فنا ہوں گی یا نہیں؟\n\nاور اس میں ہر اس چیز کا علم ہے جو تم میں ہے اور تم سے ہے، پس تم پر کوئی اجنبی امر وارد نہیں ہوتا جو تمہارے پاس نہ ہو، پس تمہارے لیے صرف تمہارے بارے میں ہی کشف (الکشف) کیا جاتا ہے۔ اور یہ بھی ایک نایاب علم ہے جسے اہل اللہ میں سے ہر کوئی نہیں جانتا۔ اور اس میں عالم کی اقسام کے درمیان فرق کا علم ہے۔ اور اس میں اقتداء (پیروی) کا علم ہے۔ اور اس میں بڑے زمانے اور چھوٹے زمانے کا علم ہے، اور بڑے زمانے کا چھوٹا ظاہر ہونا، جیسے نعمت اور وصال کا زمانہ، اور چھوٹے زمانے کا بڑا ظاہر ہونا، جیسے تکالیف اور ہجران کا زمانہ۔\n\n> وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\n> (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)",
    "fa": "باب سیصد و سی و هشتم در معرفت منزل عقبات السویق (عقبات السويق) و آن از حضرت محمدیه (الحضرة المحمدية) است.\n\nفتح دو گونه است: در معنا و در کلام؛ پس هر که کامل شود، مدعی جامعیت حکمت‌هاست.\nو اگر منزل او در عوالم (الأكوان) پایین باشد، علوّ برای او در حضرت کلام است.\nاو در معنا به رتبه خود پیشرو است، در عالم نور نه در عالم ظلمت.\nبندگان خدا را خوار مشمارید، زیرا آنان بهره‌ای از خداوند صاحب نعمت‌ها و بخشش‌ها دارند.\nپس کائنات را بزرگ شمار، زیرا مدلول آن را می‌طلبد، و او (مدلول) از آفات و اتهامات مبراست.\n\n### [در اینکه خداوند در مقام محمود هفت پرچم دارد]\n\nبدان که خداوند در مقام محمود (المقام المحمود) که رسول خدا (صلی الله علیه و سلم) در روز قیامت به نام حمیدش در آن برپا می‌شود، هفت پرچم دارد که «پرچم‌های حمد» نامیده می‌شوند. این پرچم‌ها به رسول خدا (صلی الله علیه و سلم) و وارثان محمدی (الورثة المحمديين) او داده می‌شود. در این پرچم‌ها، نام‌های خداوند که پیامبر (صلی الله علیه و سلم) با آن‌ها پروردگارش را می‌ستاید، نقش بسته است. این همان است که پیامبر (صلی الله علیه و سلم) هنگامی که در روز قیامت در مقام محمود برپا می‌شود، انجام می‌دهد. و این همان فرموده پیامبر (صلی الله علیه و سلم) است که وقتی درباره شفاعت از او سؤال می‌شود، می‌گوید: «پس خداوند را با ستایش‌هایی حمد می‌کنم که اکنون آن‌ها را نمی‌دانم.»\n\nاین ستایش‌ها، ثنا گفتن بر او سبحانه با این نام‌هایی است که آن موطن اقتضا می‌کند. خداوند متعال جز با اسماء حسنای (الأسماء الحسنى) خود ستوده نمی‌شود، و علم به اسماء او سبحانه احاطه نمی‌شود. زیرا ما می‌دانیم که:\n\n«در بهشت چیزی است که نه چشمی دیده و نه گوشی شنیده و نه بر قلب بشری خطور کرده است.»\n\nو می‌دانیم که ما نمی‌دانیم چه چیزهایی از روشنی چشم‌ها (قرة أعين) برای ما پنهان شده است. و هیچ یک از این امور نیست مگر اینکه مستند به اسم الهی (الاسم الإلهي) است که هنگام ظهور آن شیء، با آن ظاهر شده است. و اسم الهی که خداوند متعال با اظهار آن بر ما منت نهاده است، ناگزیر باید آن را بدانیم و با آن بر خداوند ثنا گوییم و او را حمد کنیم، خواه ثنای تنزیهی (تسبیح) باشد یا ثنای اثباتی. چون این را دانستم، درباره تعیین زمان آن نام‌هایی که خداوند متعال در روز قیامت در مقام محمود با آن‌ها حمد می‌شود، پرسیدم.\n\nزیرا دانستم که اکنون آن‌ها را نمی‌دانم و خداوند نیز آن‌ها را به من نمی‌آموزد، چرا که آن‌ها از ستایش‌هایی هستند که مخصوص پیامبر (صلی الله علیه و سلم) در روز قیامت است. پس هنگامی که بشنویم او در روز قیامت در مقام محمود، خداوند را با آن‌ها حمد می‌کند و پرچم‌ها با آن‌ها گسترده می‌شوند و ستایش‌ها در آن‌ها نقش بسته‌اند (مرقومة)، در آن موطن آن‌ها را خواهیم دانست. به من گفته شد که تعداد آن نام‌ها هزار و ششصد و شصت و چهار اسم است. در هر یک از این پرچم‌ها نود و نه اسم نقش بسته است که هر کس آن‌ها را در آنجا احصا کند، وارد بهشت می‌شود؛ به جز یک پرچم از این پرچم‌ها که در آن هفتصد و هفتاد اسم از این نام‌ها نقش بسته است. پیامبر (صلی الله علیه و سلم) خداوند را با تمام این ستایش‌ها حمد می‌کند و همه آن‌ها متضمن طلب شفاعت از خداوند هستند. و این منزل (منزل عقبات السویق) به کسی که در آن فرود آید، مشاهده هر یک از آن پرچم‌ها و علم به نام‌های موجود در آن‌ها را عطا می‌کند تا این وارث در آنجا خداوند را با آن‌ها ستایش کند. و برای هر پرچمی در اینجا منزلی است که پیامبر (صلی الله علیه و سلم) به آن دست یافته و وارثان کامل از پیروان او نیز به آن می‌رسند. این منزل، منزلی رفیع و صعب‌العبور است و به همین دلیل «عقبه» نامیده شده و به «سویق» (السويق) اضافه شده است، به دلیل عدم ثبات قدم‌ها در آن، زیرا لغزشگاه قدم‌هاست. پس جز مردی کامل از رسول یا نبی یا وارث کاملی که حجاب هر وارثی در زمان خود باشد، آن را طی نمی‌کند. و این همان منزلی است که نفری آن را «موقف السواء» (موقف السواء) نامیده است، به دلیل ظهور بنده در آن به صورت حق (الحق). اگر خداوند این بنده را به عصمت (العصمة) و حفظ خود منت ننهد و قدمش را در این عقبه ثابت نکند، به این صورت که شهود عبودیتش را در این ظهور برای او باقی بگذارد و آن را همواره نصب‌العین او قرار دهد، و اگر حال او این نباشد، قدمش می‌لغزد و میان او و شهود عبودیتش حائل می‌شود، به سبب آنچه خود را بر آن از صورت حق می‌بیند و حق را در صورت عبودیت خود می‌بیند، و امر بر او معکوس می‌شود. این مشهدی دشوار است، زیرا خداوند از مقام بی‌نیازی خود از عالمیان، به طلب قرض از بندگانش نزول کرده است. و از اینجاست که برخی گفتند: **إِنَّ الله فَقِيرٌ** (همانا خداوند فقیر است) در حالی که او غنی است و **وَنَحْنُ أَغْنِياءُ** (و ما بی‌نیازیم) در حالی که آن‌ها فقیرند. پس قضیه نزد آن‌ها معکوس شده است. و این از مکر الهی است که کسی آن را درک نمی‌کند. پس هر کس راهی برای عصمت (العصمة) از مکر الهی می‌خواهد، باید در هر حال ملازم عبودیت خود و لوازم آن باشد. این نشانه عصمت او از مکر خداست. و باقی می‌ماند که در آینده از آن ایمن نیست، به این معنا که او بر امان نیست که این حالت در آینده برایش باقی بماند، مگر با تعریف الهی که تأویل در آن راه نیابد و اجمال بر آن حکم نکند. و در این منزل، قول خداوند را مشاهده می‌کند: **وَلَكِنَّ الله رَمى‏** (و لیکن خداوند انداخت). و محمد (صلی الله علیه و سلم) در حسی که چشم بر آن افتاده، همان اندازه‌گر است. و در این منزل برای او برپا می‌شود: **وَالله خَلَقَكُمْ وَما تَعْمَلُونَ‏** (و خداوند شما و آنچه را عمل می‌کنید، آفریده است).\n\n### [در اینکه امر میان رب و عبد محصور است، پس برای رب راهی است و برای عبد راهی]\n\nبدان که سَواء (السواء) میان دو راه است، زیرا امر میان رب و عبد محصور است. پس برای رب راهی است و برای عبد راهی. عبد راه رب است، پس نهایت او به سوی رب است. و رب راه عبد است، پس نهایت او به سوی رب است. راه واحد عام در همه خلق، ظهور حق (الحق) با احکام صفات خلق است. این صفات در عموم، احکام صفات خلق هستند، اما نزد ما صفات حق (صفات الحق) هستند نه صفات خلق. و این معنای سَواء (السواء) است. راه دیگر، ظهور خلق با صفات حق است که در عموم متمایز می‌شوند که صفات حق هستند، مانند اسماء حسنی و امثال آن‌ها. این نهایت علم عامه است. اما نزد ما و نزد خواص، همه آن‌ها صفات حق به اصالت هستند. آنچه از آن‌ها به خلق اضافه شده و عامه آن را نزولی از خداوند به سوی ما می‌دانند، نزد ما صفات حق است، هرچند بنده منزلتی نزد خداوند یافته باشد که با آن‌ها متخلق شود. این صفات نزد عامه، اسماء نقص هستند و نزد ما اسماء کمال، زیرا مسمایی به اصالت جز خداوند نیست. و هنگامی که خلق را ظاهر کرد، از نام‌های خود آنچه را خواست به آن‌ها عطا کرد و آن‌ها را با آن‌ها محقق ساخت. خلق در مقام نقص است به دلیل امکان و احتیاجش به مرجح. پس آنچه را که گمان می‌کنند اصل در آن‌ها و حق آن‌هاست، در همان حکم از آن پیروی کردند و بر این نام‌های خلقی حکم به نقص کردند. و هنگامی که به آن‌ها می‌رسد که حق با آن‌ها نامیده شده و خود را با آن‌ها وصف می‌کند، این را نزولی از حق تعالی به سوی آن‌ها با صفات خودشان می‌دانند، و نمی‌دانند که آن‌ها اسماء حق به اصالت هستند. پس بر مذهب ما در ظهور خلق با صفات حق، این امر شامل همه خلق می‌شود. پس هر نامی که برای آن‌هاست، حقِ حق است که به خلق عاریه داده شده است. و بر مذهب جماعت، این امر جز برای اهل خصوص (یعنی اسماء حسنی خاصه) نیست. و نزد ما، علم به این امر جز برای خواص از اهل الله حاصل نمی‌شود. و فرق بزرگی است میان قول ما که «این امر حاصل نمی‌شود» و قول ما که «علم به این امر حاصل نمی‌شود». زیرا حق (الحق) در نفس الأمر با هر چشمی مشهود است، اما جز آحاد اهل الله این را نمی‌دانند. و این مانند قول صدیق (ابوبکر) است که: «چیزی را ندیدم مگر اینکه خداوند را قبل از آن دیدم و او را شناختم.» پس هنگامی که آن شیء برای چشم مقید او ظاهر شد و او خداوند را قبل از آن دیده بود، آن را در آن شیء متمایز ساخت و دانست که آن شیء لباسی از لباس‌های حق است که برای زینت در آن ظاهر شده است. این زینت خداست که با آن برای بندگانش زینت یافته است. این مقام صدیق است. پس اهل الله از غیر خود متمایز نمی‌شوند مگر به علم به این امر، زیرا امر در نفس خود بر این منوال است. و نزد عامه، این امر جز برای اهل عنایت که به حق متحقق شده‌اند، حاصل نمی‌شود و غیر آن‌ها نزد عامه، خلق بدون حق هستند. سپس باز می‌گردیم و می‌گوییم که خداوند برای این منزل، بابی قرار داده است که «باب رحمت» نامیده می‌شود. ورود به این منزل از طریق آن باب است، و این باب او را از آفات مهلکی که پیش‌تر به آن‌ها اشاره کردیم (از حکم سَواء) حفظ می‌کند. زیرا این باب برای این منزل، مانند نیت در عمل است. پس هر غفلت و سهوی که در عمل رخنه کند، در صحت عمل تأثیر نمی‌گذارد، زیرا نیت آن را جبران می‌کند، چون نیت اصل در ایجاد آن عمل است و آن را حفظ می‌کند. همچنین بسمله (بسم الله الرحمن الرحیم) که خداوند آن را در ابتدای هر سوره از قرآن قرار داده است، برای سوره مانند نیت برای عمل است. پس هر وعید و هر صفتی که موجب شقاوت است و در آن سوره ذکر شده است، بسمله به واسطه «الرحمن» در عموم و «الرحیم» در خصوص، بر اموری که در آن سوره است و به کسی که آن را داراست شقاوت می‌دهد، حکم می‌کند. پس خداوند بر آن بنده رحم می‌آورد، یا با رحمت خاصه (الرحمة الخاصة) که واجب است، یا با رحمت عامه (الرحمة العامة) که رحمت امتنان است.\n\nپس سرانجام به خاطر بسمله، به سوی رحمت است و این بشارتی است. اما سوره توبه، بنا بر نظر کسانی که آن را سوره‌ای جداگانه و منفصل از سوره انفال می‌دانند، «سوره توبه» نامیده شده است، و آن بازگشت الهی (الرجعة الإلهية) بر بندگان با رحمت و عطوفت است. زیرا خداوند به کسانی که بر خود اسراف کرده‌اند، فرموده است و اسراف‌کننده‌ای را از اسراف‌کننده دیگر جدا نکرده است: **يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ لا تَقْنَطُوا من رَحْمَةِ الله إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً** (ای بندگان من که بر خود اسراف کرده‌اید، از رحمت خدا ناامید نشوید، همانا خداوند همه گناهان را می‌آمرزد). اگر می‌فرمود که «الرحمن» هیچ یک از اسراف‌کنندگان را عذاب نمی‌دهد، (معنا فرق می‌کرد). اما چون اسم «الله» را آورده است، مغفرت ممکن است قبل از مؤاخذه باشد و ممکن است بعد از مؤاخذه باشد. به همین دلیل آیه را با این قول ختم کرد: **إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ** (همانا اوست آمرزنده مهربان). پس «الرحیم» را در آخر آورد، یعنی سرانجام آن‌ها، حتی اگر مؤاخذه شوند، به سوی رحمت است. و بازگشت الهی (الرجعة الإلهية) جز با رحمت نخواهد بود؛ خداوند با غیر آن به سوی بندگانش باز نمی‌گردد. اگر بازگشت در دنیا باشد، آن‌ها را با آن به سوی خود باز می‌گرداند، و این همان قول اوست: **ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا** (سپس بر آنان توبه کرد تا توبه کنند). و اگر در آخرت باشد، بازگشت آن‌ها مقدم بر بازگشت اوست، زیرا آن موطن این را اقتضا می‌کند. زیرا هر کس از خلق که در آن مشهد حاضر شود، در دست‌هایش ساقط می‌شود و به ناچار به سوی پروردگارش باز می‌گردد. پس خداوند به سوی آن‌ها و بر آن‌ها باز می‌گردد. برخی از آن‌ها کسانی هستند که خداوند در قیامت و منازل آن با رحمت بر آن‌ها باز می‌گردد، و برخی دیگر کسانی هستند که پس از ورود به آتش با رحمت بر آن‌ها باز می‌گردد، و این بر حسب اقتضای احوال و وقوع شهود (الشهود) است. و امر در همه این‌ها حسی و معنوی است. زیرا عالم تماماً حرفی است که برای معنایی آمده است، و معنای آن خداست، تا احکام خود را در آن ظاهر کند، زیرا عالم در نفس خود محلی برای ظهور احکام او نیست. پس معنا همواره به حرف مرتبط است، و خداوند همواره با عالم است. خداوند متعال می‌فرماید: **وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ** (و او با شماست هر کجا که باشید). پس کسی که در اولین قدم به این منزل وارد می‌شود، نود و نه تجلی (التجلی) از خداوند برای او حاصل می‌شود، صد منهای یکی. نُه تجلی از آن‌ها پیش می‌آید که در آن‌ها صورت خود را می‌بیند و حقیقت خود را می‌شناسد. سپس در نود تجلی دیگر برپا می‌شود و آنچه را که نمی‌دانست، از حضرت جمع و منعت و علو از مقاومت‌ها می‌بیند. پس حق (الحق) به سوی او نزول می‌کند و علمی لدنی (علم من لدنه) به او می‌آموزد، در حالی که رحمت هنگام ورودش بر او پیشی گرفته است. و این منزل خضر، صاحب موسی (علیه السلام) است.\n\n### [در اینکه شایستگی شیء برای امری، نعت ذاتی است]\n\nبدان که شایستگی شیء برای امری، نعت ذاتی (نعت ذاتي) است. پس مشارکت دیگری در آن رخ نمی‌دهد، مگر با نسبتی دور که اگر آن را تحقیق کنی، ثابت نمی‌شود و قدمت در آن می‌لغزد.\nچنانکه پیامبر (صلی الله علیه و سلم) در صحیح فرمود: «اما اهل آتش که اهل آن هستند و هرگز از آن خارج نمی‌شوند، زیرا اهل آن هستند، در آن نه می‌میرند و نه زنده می‌شوند.»\nپس نعت آن‌ها را نفی حیات و موت قرار داد. سپس نعت کسی را که وارد آن شده ولی اهل آن نیست، استدراک کرد و فرمود: «بلکه مردمی هستند که آتش به سبب گناهانشان به آن‌ها رسیده است، پس خداوند آن‌ها را در آن می‌میراند، میراندنی.»\nپس آن‌ها را به موت وصف کرد که خلاف نعت کسی است که اهل آن است. سپس خروج این افراد از آتش را ذکر کرد. پس توجه کن به اینکه حق (الحق) تمام عالم را به تسبیح به حمد خود گویا ساخت. و تسبیح، تنزیه است، نه ثنا به امری اثباتی، زیرا بر او ثنا گفته نمی‌شود مگر به آنچه که شایسته آن است. و آنچه شایسته اوست، مشارکت در آن رخ نمی‌دهد. و بر او ثنا گفته نشده مگر با نام‌هایش. و هیچ نامی از نام‌های او سبحانه که نزد ما معلوم است، نیست مگر اینکه بنده می‌تواند به اندازه شایستگی خود به آن متخلق و متصف شود. پس چون در عالم ممکن نبود که بر او ثنا گفته شود به آنچه که شایسته اوست، ثنا گفتن بر او را تسبیح از هر شیء قرار داد. و به همین دلیل حمد را به آن اضافه کرد و فرمود: **يُسَبِّحُ بِحَمْدِهِ** (به حمد او تسبیح می‌گوید)، یعنی با ثنایی که سزاوار آن است و اهل آن است، و آن جز تسبیح نیست. زیرا او سبحانه می‌فرماید: **سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصْفُونَ** (منزه است پروردگار تو، پروردگار عزت، از آنچه وصف می‌کنند). و عزت، منع از رسیدن به او با هر گونه ثنایی است که اله از آنچه وصف می‌کنند، نباشد. و هر ثناگویی، واصف است. پس او سبحانه تسبیح خود را در هر حال و از هر چشمی ذکر کرد و فرمود: **تُسَبِّحُ لَهُ السَّماواتُ السَّبْعُ وَالْأَرْضُ وَمَنْ فِيهِنَّ** (آسمان‌های هفت‌گانه و زمین و هر که در آن‌هاست، او را تسبیح می‌گویند). و جز این‌ها نیست. و هنگام پایان رسالت محمد (صلی الله علیه و سلم) و آنچه برای او تشریع شده بود که از ثنا بر او تشریع کند، به او امر کرد و فرمود: **فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ** (پس پروردگارت را با حمدش تسبیح گوی و از او آمرزش بخواه). پس فرمود: «تو همان‌گونه هستی که خودت بر خود ثنا گفته‌ای.» این همان تسبیح به حمد اوست. چون امر ثنا گفتن بر خداوند بر اساس آنچه مقرر کردیم بود، برای ما ممکن نشد که ثنایی برای او استنباط کنیم، بلکه او را با آنچه خود از خود در کتاب‌هایش نازل کرده، ذکر می‌کنیم، بر حدی که او می‌داند، نه بر حدی که ما می‌فهمیم. پس ما در ثنا گفتن بر او، حکایت‌کننده و تلاوت‌کننده هستیم، زیرا ثنا بر مثنی‌علیه که ذاتش مجهول است، حدود و رسوم را نمی‌پذیرد و تحت کیفیت در نمی‌آید و آن‌گونه که در نفس خود هست، شناخته نمی‌شود. و او بی‌نیاز از عالمیان است. پس دلالت‌ها بر معرفت (المعرفة) او دلالت نمی‌کنند، بلکه تنها بر استناد ما به او دلالت می‌کنند، از آن جهت که او شبیه ما نیست یا وصف ما را نمی‌پذیرد. و هیچ اسم الهی نیست مگر اینکه ما به آن متصف می‌شویم. پس آن معرفت مقصودی که او با آن خود را می‌شناسد، این نیست. پس تسبیح را تشریع کرد و هر شیء را بر آن سرشت. و تسبیح نفی از هر وصفی است، نه اثبات. به همین دلیل، برخی از اهل نظر به چیزی از این رسیدند، هرچند علما آنچه را که آن‌ها بدان رفته‌اند، نپسندیده‌اند، اما آن در نفس الأمر از وجهی نیکو حق است. و آن این است که آن‌ها دیدند که مشارکت میان مُحدَث و خداوند حتی در اطلاق الفاظ بر او صحیح نیست. پس اگر به آن‌ها گفته شود: «خداوند موجود است»، می‌گویند: «نیست که معدوم باشد»، زیرا مُحدَث به وجود موصوف است و مشارکتی نیست. اگر به آن‌ها گفته شود: «خداوند زنده است»، می‌گویند: «نیست که مرده باشد». «خداوند عالم است»، می‌گویند: «نیست که جاهل باشد». «خداوند قادر است»، می‌گویند: «نیست که عاجز باشد». «خداوند مرید است»، می‌گویند: «نیست که قاصر باشد». پس لفظ نفی را آوردند، و تسبیح تنزیه و نفی است، نه اثبات. پس بر اصلی که خداوند هر شیء را به آن گویا ساخت، جاری شدند و راهی غریب میان اهل نظر پیمودند.\n\nو ثنا گفتن بر خداوند با تسبیح، زبان‌ها را خسته نمی‌کند، برخلاف ثنا با اسماء که زبان‌ها در آن خسته و درمانده می‌شوند و می‌ایستند. و به همین دلیل است که کسی که برایش تشریع شده بود که ثنا بگوید، در هنگام درماندگی و حصر، سخن خود را با این جمله به پایان رساند: «من نمی‌توانم ثنای تو را احصا کنم، تو همان‌گونه هستی که خودت بر خود ثنا گفته‌ای.» و به حکمت خداوند متعال بنگر در اینکه:\n\nدر کتاب‌هایش برای خود صفتی قرار نداد، بلکه خود را از وصف منزه ساخت و فرمود: **وَلِلَّهِ الْأَسْماءُ الْحُسْنى‏** (و برای خداوند است نام‌های نیکو). پس آن‌ها را «اسماء» قرار داد و آن‌ها را «نعوت» یا «صفات» قرار نداد و فرمود: **فَادْعُوهُ بِها** (پس او را با آن‌ها بخوانید). و ثنا با آن‌ها بود. و اسم چیزی است که ثنا را عطا می‌کند، و اسم چیزی است که ثنا را عطا می‌کند، بلکه این نعت و صفت است که آن را عطا می‌کند. و بیشتر مردم درک نکردند که حق (الحق) در خلق خود نعتی برای خود ذکر نکرده است، بلکه آن را اسماء قرار داده است، مانند اسماء عَلَم که برای ثنا نیامده‌اند، بلکه برای دلالت آمده‌اند. و آن اسماء حسنای الهی، برای ما نعوت هستند که با آن‌ها بر ما ثنا گفته می‌شود و ما بر خود ثنا گفته‌ایم و خداوند بر خود با آن‌ها ثنا گفته است. زیرا پیش‌تر بیان کردیم که نزول شرایع در عالم از جانب خداوند، تنها به حکم آنچه اهل آن زبان بر آن توافق کرده‌اند، نازل می‌شود، خواه اهل آن زبان در آن با حق موافق باشند یا نه. و مردم توافق کرده‌اند که این نام‌هایی که حق خود را با آن‌ها نامیده است، از جمله چیزهایی هستند که در مُحدَثات با آن‌ها ثنا گفته می‌شود، هنگامی که به عنوان نعت یا صفت در کسی که در او قرار می‌گیرد، برپا شوند. پس خداوند بر خود با آن‌ها ثنا گفت و متذکر شد که آن‌ها اسماء هستند نه نعوت، تا شنونده زیرک بفهمد که این از حکم توافق (التواطؤ) است، نه حکم امر در نفس خود، چنانکه دلیل شرع دلالت کرد به: **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست) از جمیع وجوه. پس «أینیت» (کجا بودن) را نمی‌پذیرد، زیرا اگر آن را بپذیرد، **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** به طور مطلق صادق نخواهد بود، زیرا پذیرش أینیت، مماثلت است. اما دلیل عقلی اصلاً به آن قائل نیست. با این حال، حکم برای توافق است.\n\nپس رسول خدا (صلی الله علیه و سلم) از زن سیاه و لال پرسید: «خدا کجاست؟» و لفظ أینیت (کجا بودن) را بر او اطلاق کرد، زیرا می‌دانست که أینیت در حق او به منزله اسم است نه به منزله نعت. پس زن سیاه با اشاره گفت: «در آسمان.» و پیامبر آنچه را که او اشاره کرد، پذیرفت و او را مؤمن دانست.\n\nزیرا خداوند از خود خبر داده است که در آسمان است، پس زن او را در خبرش تصدیق کرد و مؤمن بود. و پیامبر (صلی الله علیه و سلم) در آن هنگام درباره او نگفت که «او عالم است» و دستور به آزاد کردن او داد. و عتق (آزاد کردن)، رهایی از قید عبودیت است. این تنبیهی از پیامبر (صلی الله علیه و سلم) با عتق در حق او از قید عبودیت و مِلک است، بر اینکه **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست)، رهایی از قید أینیت و وفای ظرفی است که زن سیاه در جواب آورده بود. پس بنگر که این شارع عارف بالله چقدر شگفت‌انگیز است. و همه این‌ها تنزیه است. پس ثنا گفتن بر خداوند با صفات اثباتی که آن‌ها را اسماء قرار داده و خلق آن‌ها را نعوت قرار داده‌اند (همان‌گونه که برای خودشان نعوت هستند)، اگر این ثنا از بنده به صورت (صورة) واقع شود، اما روح آن صورت، تسبیح به «لیس کمثله شیء» نباشد، جهل به آنچه مثنی‌علیه سزاوار آن است، خواهد بود. زیرا او را تحت حد و حصر درآورده است، برخلاف اینکه آن‌ها اسماء باشند نه نعوت. پس ای ولی، نباید تسبیح از ثنای تو بر خداوند به طور کلی جدا شود. زیرا اگر تو در این مرتبه باشی، روحی در صورت ثنای خود که ایجاد کرده‌ای، دمیده‌ای. پس از مصورانی مباش که در روز قیامت عذاب می‌شوند، به این صورت که به آن‌ها گفته می‌شود: «آنچه را آفریدید، زنده کنید»، در حالی که در آنجا قدرتی بر این کار ندارند، زیرا ادعا در آنجا به دلیل کشف امور واقع نمی‌شود، در حالی که در دنیا چنین نیست. سپس در تحقق آنچه ذکر کردیم، یعنی ایجاد صورت ثنا در صورتی که روح تسبیح در آن دمیده نشود، به قول خداوند به گروهی بنگر: **قُلْ أَ رَأَيْتُمْ ما تَدْعُونَ من دُونِ الله أَرُونِي ما ذا خَلَقُوا من الْأَرْضِ** (بگو: آیا دیدید آنچه را که به جای خدا می‌خوانید؟ به من نشان دهید که چه چیزی را از زمین آفریده‌اند؟). اگر می‌گفتند: «عیسی به جای خدا، معبود خوانده شد و او از زمین آفرید»، به دلیل ورز دادن گِل که اجزای خاکی با رطوبت و سردی آب به هم پیوستند، و کمیت سردی خاک افزایش یافت و از تحلیل و عدم انتظام سنگین شد، و رطوبت، خشکی موجود در خاک را از بین برد، پس اجزای آن به هم پیوستند تا شکل پرنده ظاهر شود. حق (الحق) به خاطر این قول، این را مقدم داشت که آفرینش پرنده توسط عیسی به اذن خدا بود. پس آفرینش او برای پرنده، عبادتی بود که با آن به خدا تقرب می‌جست، زیرا به او اجازه داده شده بود. پس فرمود: **وَإِذْ تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ بِإِذْنِي فَتَنْفُخُ فِيها فَتَكُونُ طَيْراً بِإِذْنِي** (و هنگامی که از گِل، چیزی شبیه پرنده به اذن من می‌آفریدی، پس در آن می‌دمیدی و به اذن من پرنده می‌شد). پس آفرینش خود را جز به اذن خدا اضافه نکرد. و مأمور، عبد است و عبد نمی‌تواند اله باشد. و ما این مسئله را آوردیم به دلیل عمومیت کلمه «ما» (آنچه)؛ زیرا این لفظ بر هر شیء اطلاق می‌شود، چه عاقل باشد و چه غیر عاقل. سیبویه که مرجع علم زبان است، چنین گفته است. زیرا برخی از مدعیان این فن می‌گویند که لفظ «ما» مخصوص غیر عاقل است و «مَن» مخصوص عاقل، که قولی غیر محقق است. و ما در کلام عرب دیده‌ایم که جمع غیر عاقل با جمع عاقل آمده و «ما» بر عاقل اطلاق شده است. و این را گفتیم تا گفته نشود که در قول خداوند: **ما تَدْعُونَ من دُونِ الله** (آنچه را به جای خدا می‌خوانید)، تنها غیر عاقل را اراده کرده است، در حالی که عیسی عاقل است و در این خطاب داخل نمی‌شود. و قول سیبویه اولی است. پس ما از این منزل ترجمه کردیم، به گونه‌ای که بر رفعت و گریزپایی آن از کسی که در آن است، تنبیه شود، مگر اینکه دائماً مراقب آن باشد. و این منزل شامل علومی است، از جمله علم آنچه خداوند به اولویت حمد از رحمت اختصاص داده است، که آیا رحمت عامه را به آن عطا کرده یا خاصه را؟ زیرا آنچه در مجاورت آن است، رحمت واجبه است که جزئی از رحمت عامه است. پس آیا پرچم حمد به آن محدود می‌شود، یعنی اینکه خداوند جز با اسماء حسنی در عرف ستایش نشود، یا از آن فراتر رفته و به رحمت عامه می‌رسد، در ستایش خداوند با جمیع اسماء و کنایات؟ زیرا او فعل مطلق دارد بدون قید، و هر اسمی که فعل آن را بطلبد، برای اوست، حتی اگر بر او اطلاق نشود. زیرا رحمت عامه الهی شامل این نام‌هایی می‌شود که عرف بر اطلاق آن‌ها بر او جاری نشده است. پس با رحمت بر او اطلاق می‌شوند و آن‌ها را در پرچم نقش بسته می‌یابی. و این علم شریفی است که ما تصمیم داشتیم در آن کتابی بنویسیم، اما به بخش کوچکی از آن اکتفا کردیم که آن را «معرفة المدخل إلى الأسماء والكنايات» (معرفت مدخل به اسماء و کنایات) نامیدیم، که سبکی شگفت‌انگیز و غریب است و با وجود معرفت متقدمین به آن، ندیده‌ام کسی به آن توجه کرده باشد. و از علوم این منزل، علم اجمالی است که تفصیل بدون تأخیر به دنبال آن می‌آید. و در آن علم نزول کتب است که از کجا نازل می‌شوند و حضرت آن‌ها از اسماء الهی کدام است؟ و آیا همه کتب نازل شده از یک حضرت از اسماء هستند یا حضرات آن‌ها با اختلاف سبب نزولشان متفاوت است؟ زیرا تورات، اگرچه خداوند آن را با دست خود نوشت، اما برای اعجاز در برابر معارضه نازل نشد. و قرآن معجز نازل شد. پس ناگزیر باید حضرت اسماء خداوند متفاوت باشد و هر کتاب به اسم خاص خود از اسماء الهی اضافه شود. و در آن علم به حق (الحق) است که خلق با آن صورت گرفته است، و آن همان عدل نزد سهل بن عبدالله است. و در آن علم اهل حجاب در اعراضشان از دعوت حق است، که آیا اعراض آن‌ها جهل است یا عناد و انکار؟ و در آن علم به چیزی است که خداوند با آن از کسی که ادعای الوهیت در او می‌شود، متمایز می‌گردد، در حالی که خصوصیت وصف اله در او نیست. و در آن علم به آنچه ادله عقل را با نیروی فکری در بر می‌گیرد، است. و در آن علم به تأخیر اجابت هنگام دعا است، که سبب آن چیست؟ و در آن علم به تبدیل ولی به دشمن است، که سبب آن چیست؟ و در آن علم به برتری در فهم از خداوند است، که آیا به استعداد باز می‌گردد یا به مشیت؟ و در آن علم به شهادت الهی برای کسی که به نفع او و علیه او شهادت داده می‌شود، و اجتماع مشهود له و علیه در رحمت پس از ادا است، در حالی که صلح در ابتدا نبوده و نیازی به دعوی و شهادت نیست. و اگر حق (الحق) شاهد باشد، حاکم کیست که نزد او شهادت دهد؟ اگر با علم خود حکم کند، شاهد نخواهد بود. و علم شهادت و مراتب شهدا و شهود در آن به این علم مرتبط است. و آیا حاکم می‌تواند با علم خود حکم کند یا باید علم خود را به خاطر شهادت شهود ترک کند، در صورتی که شهادت آن‌ها شهادت زور نباشد؟ مثلاً شهود شهادت دهند که زید مستحق فلان مقدار درهم از عمرو است، و این نزد آن‌ها همان‌گونه است که شهادت داده‌اند، در حالی که حاکم به یقین می‌داند که عمرو این مستحق را به او داده است، و زید شاهدی جز علم حاکم ندارد، و حاکم می‌داند که شهود بر اساس آنچه می‌دانستند شهادت داده‌اند و علم نداشتند که عمرو آنچه را که شهادت بر آن واقع شده بود، به زید رسانده است. و در آن علم به تکذیب صادق است، که چرا کسی که او را تکذیب می‌کند، با وجود جواز امکان در آنچه در اخبارش ادعا می‌کند، او را تکذیب می‌کند؟ و در آن علم به اسباب رفع خوف در مواطن خوف است. و در آن علم به تناسب در جزای وفاق است، و آیا آنچه بر جزای وفاق افزوده می‌شود، جزا است یا هبه؟ و آیا جزای دردناک در افزایش با جزای لذت‌بخش برابر است یا افزایش تنها در جزای آنچه نعیم به آن واقع می‌شود، است؟ و اما در آلام، چیزی بر وفاق افزوده نمی‌شود. و قول خداوند متعال: **زِدْناهُمْ عَذاباً فَوْقَ الْعَذابِ** (عذابی بر عذابشان افزودیم)، این افزایش به چه چیزی باز می‌گردد؟ و قول خداوند: **كُلَّما نَضِجَتْ جُلُودُهُمْ بَدَّلْناهُمْ جُلُوداً غَيْرَها لِيَذُوقُوا الْعَذابَ** (هرگاه پوست‌هایشان پخته شود، پوست‌هایی غیر از آن را جایگزین می‌کنیم تا عذاب را بچشند)، آیا این پوست‌های تجدید شده از جزای وفاق هستند یا از افزایش؟ و قول آن‌ها: **لَنْ تَمَسَّنَا النَّارُ إِلَّا أَيَّاماً مَعْدُودَةً** (آتش جز روزهایی معدود به ما نخواهد رسید)، آیا آن‌ها در این قول وجهی دارند که در آن صادق باشند یا هیچ وجهی ندارند؟ و قول خداوند در حق این افراد: **بَلى‏ مَنْ كَسَبَ سَيِّئَةً وَأَحاطَتْ بِهِ خَطِيئَتُهُ فَأُولئِكَ أَصْحابُ النَّارِ هُمْ فِيها خالِدُونَ** (آری، هر کس بدی کسب کند و گناهش او را احاطه کند، پس آنان اهل آتشند و در آن جاودان خواهند بود)، آیا این با قول آن‌ها: **لَنْ تَمَسَّنَا النَّارُ إِلَّا أَيَّاماً مَعْدُودَةً** معارض است؟ زیرا هر کس که وارد آتش شود، آتش به او نمی‌رسد. فرشتگان عذاب در آتش هستند و آن خانه آن‌هاست و آتش به آن‌ها نمی‌رسد. و خداوند پس از قول: **وَأَحاطَتْ بِهِ خَطِيئَتُهُ** (و گناهش او را احاطه کند)، نفرموده است که اینان کسانی هستند که آتش به آن‌ها می‌رسد. و در آن علم به نشأت بنی آدم و صورت طبیعی و روحانی اوست. و در آن علم به وصفی است که اگر بنده در آن برپا شود، خداوند از آنچه در آن بدی کرده، در می‌گذرد. و در آن علم به حقوق و مستحقین آن‌هاست. و در آن علم به فرق میان «عرض» و «وقوف» است. زیرا وارد شده است: **وَلَوْ تَرى‏ إِذْ وُقِفُوا عَلى‏ رَبِّهِمْ** (و اگر ببینی هنگامی که در برابر پروردگارشان متوقف می‌شوند). و وارد شده است: **يَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى (النَّارِ)** (روزی که کافران بر آتش عرضه می‌شوند). و وارد شده است: **وَلَوْ تَرى‏ إِذْ وُقِفُوا عَلَى النَّارِ** (و اگر ببینی هنگامی که بر آتش متوقف می‌شوند). و وارد شده است: **وَيَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى النَّارِ** (و روزی که کافران بر آتش عرضه می‌شوند). و آیا عرض، دخول است یا نه؟ و در آن علم به مطابقت است که علم عزیزی است. و در آن علم به تضاد امثال است. و در آن علم به آنچه بر رسولان واجب است و آنچه واجب نیست، است. و در آن علم به عدم اعتماد به اسباب معهود برای امری است که از آن‌ها انتظار می‌رود، اما خلاف آن ظاهر می‌شود؛ غلط از کجا برای کسی که به آن‌ها اعتماد کرده، رخ داده است؟ و در آن علم به آنچه از اشیاء فانی می‌شود و آنچه فانی نمی‌شود، است. و آنچه از آن‌ها فانی می‌شود، آیا به ذات فانی می‌شود یا نه؟\n\nو در آن علم به هر چیزی است که در تو و از توست. پس امر غریبی که نزد تو نیست، بر تو عارض نمی‌شود. پس جز از خودت، برای تو کشف (الکشف) نمی‌شود. و این نیز علم عزیزی است که هر کسی از اهل الله آن را نمی‌داند. و در آن علم به فرق میان اصناف عالم است. و در آن علم به اقتدا است. و در آن علم به زمان بزرگ از زمان کوچک است، و ظهور زمان بزرگ به صورت کوتاه مانند زمان نعیم و وصال، و ظهور زمان کوتاه به صورت بزرگ مانند زمان آلام و هجران. **وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ‏** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}