{
  "id": 202,
  "title": {
    "ar": "الباب الثاني ومائتان في حال الأدب",
    "en": "Chapter 202: Concerning the Spiritual State of Proper Conduct (حال الأدب)",
    "ur": "باب نمبر دو سو دو: ادب کے حال میں",
    "fa": "باب دویست و دوم در بیان حال ادب"
  },
  "content": {
    "ar": "## «الباب الثاني ومائتان في حال الأدب»\n\n\n> أدب الشريعة أن تقوم برسمها *** فتكون مكتوبا من الأدباء\n\n\n> فإذا فنيت من القيام وأنت في *** جهد فأنت به من الخدماء\n\n\n> وإذا دفعت لكل طالب حقه *** ما يستحق لحقت بالأمناء\n\n\n> وأتيت بالشرع المطهر حكمه *** وبذاك قالوا جملة القدماء\n\n\n### [أن الأدب على أقسام‏]\n\n\nاعلم أن الأدب على أقسام‏\n\n\nأما أدب الشريعة\n\n\nفهو أن لا يتعدى بالحكم موضعه في جوهر كان أو في عرض أو في زمان أو في مكان أو في وضع أو في إضافة أو في حال أو في مقدار أو في مؤثر أو في مؤثر فيه وانحصرت أقسام محل ظهور أدب الشريعة فأما أدبها في الذوات القائمة بأنفسها فبحسب ما هي عليه من معدن ونبات وحيوان وإنسان وعروض وما يقبل التغيير منه وما لا يقبل التغيير وما يقبل الفساد وما لا يقبل الفساد فيعلم حكم الشرع في ذلك كله فيجريه فيه بحسبه وأما آدابها في الأعراض فهو ما يتعلق بأفعال المكلفين من وجوب وحظر وندب وكراهة وإباحة وأما الآداب الزمانية فما يتعلق بأوقات العبادات المرتبطة بالأوقات فكل وقت له حكم في المكلف ومنه ما يضيق وقته ومنه ما يتسع وأما الآداب المكانية كمواضع العبادات مثل بيوت الله الذي أَذِنَ الله فيها أَنْ تُرْفَعَ ويُذْكَرَ فِيهَا اسْمُهُ وأما الآداب الوضعية فهي أن لا يسمى الشي‏ء بغير اسمه ليتغير عليه حكم الشرع بتغير الاسم فيحلل ما كان محرما أو يحرم ما كان محللا كما\n\n\nقال عليه السلام سيأتي على الناس زمان يظهر فيه أقوام يسمون الخمر بغير اسمها\n\n\nوذلك ليستحلوها بالاسم كما سئل مالك عن خنزير البحر فقال هو حرام فقيل له إنه من جملة سمك البحر فقال أنتم سميتموه خنزيرا فانسحب عليه لأجل الاسم حكم التحريم كما سموا الخمر نبيذا أو ربا أو تزيزا فاستحلوها بالاسم وأما أدب الإضافة فمثل قول خضر فَأَرَدْتُ أَنْ أَعِيبَها وقوله فَأَرَدْنا أَنْ يُبْدِلَهُما للاشتراك بين ما يحمد ويذم وقوله فَأَرادَ رَبُّكَ لتخليص المحمدة فيه فيكتسب الشي‏ء الواحد بالنسبة ذما وبالإضافة إلى جهة أخرى حمدا وهو عينه وتغير الحكم بالنسبة وأما آداب الأحوال كحال السفر في الطاعة وحاله في المعصية فيختلف الحكم بالحال وحال السفر أيضا من حال الإقامة في صوم رمضان وفطره والمسح على الخفين في التوقيت وعدم التوقيت وأما الآداب في الأعداد فهو ما يتعلق بعدد أفعال الطهارة ومقاديرها والزكاة وعدد الصلوات وما لا يزاد فيه ولا ينقص بحسب حكم الشرع في ذلك وكذلك توقيت ما يغتسل به ويتوضأ به كالمد والصاع هذا أدبه في العدد وأما الأدب في المؤثر كحكمه في القاتل والغاصب وكل ما أضيف إليه فعل ما من الأفعال وأما أدبه في المؤثر فيه كالمقتول قود أهل بصفة ما قتل به أو بأمر آخر وكالمغصوب إذا وجد بغير يد الذي باشر الغصب هذا قسم أدب الشريعة\n\n\nوأما قسم أدب الخدمة\n\n\nفأما أن يكون أعلى إلى أدنى أو من أدنى إلى أعلى فأما خدمة الأعلى إلى من هو دونه فالقيام بمصالحه ومراعاتها والتنبيه في ذلك على ما وقعت فيه الغفلة والتعريف بما جهل منها وتعيينه أوقاتها وأمكنتها وحالاتها وإيضاح مبهماتها والإفصاح عن مشكلاتها بإقامة أعلامها كالأستاذ مع التلميذ والعالم مع الجاهل والسلطان مع الرعية وأما خدمة الأدون من هو أعلى منه فبامتثال أوامره ونواهيه والوقوف عند مراسمه وحدوده والمبادرة إلى محابه والمسارعة إلى مراضيه ومراقبة إشاراته وموافقة أغراضه هذا قسم أدب الخدمة\n\n\nوأما قسم أدب الحق‏\n\n\nفهو إعطاؤه ما يستحقه مما ينبغي له وإعطاؤه ما يستحقه مني كما أنه أعطاني خلقي حين أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ فإذا أعطيته ما يستحقه بما هو هو وأعطيته ما يستحقه منك بما أنت له فقد\nقمت بآداب الحق في إعطائه كل شي‏ء خلقه هذا قسم آداب الحق‏\n\n\nوأما قسم آداب الحقيقة\n\n\nفحاله أن يراه في الأشياء عينها لا هي ثم يحكم على ما يراه من الزيادة والنقص بما أعطته استعدادات الأشياء فينسب ذلك إليها لا إليه كمالا كان أو نقصا أو موافقا أو مخالفا لا يحاشي شيئا فإن حال الحقيقة يعطي ما قلناه فإذا كان حالك في كل مقام ما ذكرناه فقد قمت بالأدب وأخذت الخير أجمعه بكلتا يديك وملأتهما خيرا وهذا غاية وسع المخلوق والله يَهْدِي من يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ والكلام على الأحوال لا يحتمل البسط وتكفي فيه الإشارة إلى المقصود ومهما بسطت القول فيه أفسدته والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\n( «بسم الله الرحمن الرحيم»)\n\n",
    "en": "## Chapter Two Hundred and Two: Concerning the State of Spiritual Etiquette (Adab)\n\nThe discipline (Adab) of the Sacred Law (Shari'a) is that you uphold its form,\nThus you become inscribed among those of proper conduct (Adab).\n\nAnd if you are annihilated (fanīt) from the upholding, while you are in\nEffort, then by it you are among the servants (khudamā').\n\nAnd if you render to every claimant his due,\nWhat he deserves, you join the trustworthy (umanā').\n\nAnd you bring forth the judgment of the purified Law,\nAnd by this, the entirety of the ancients spoke.\n\n### [That Spiritual Etiquette (Adab) is of Divisions]\n\nKnow that Spiritual Etiquette (Adab) is of divisions.\n\nAs for the discipline of the Sacred Law (Adab al-Sharī‘a):\n\nIt is that one does not transgress the judgment beyond its proper place, whether that be in substance (jawhar), or in accident ('araḍ), or in time (zamān), or in place (makān), or in position (waḍ‘), or in relation (iḍāfa), or in state (ḥāl), or in measure (miqdār), or in the agent (mu’aththir), or in the recipient of the effect (mu’aththar fīh). The divisions of the locus of the manifestation of the discipline of the Sacred Law are thus encompassed.\n\nAs for its discipline concerning the self-subsistent essences (al-Dhawāt al-Qā’ima bi-anfusihā), it is according to what they are: mineral, plant, animal, human, and accidents (al-A'rāḍ); and what among them accepts change and what does not accept change; and what accepts corruption and what does not accept corruption. One must know the ruling of the Sacred Law concerning all of that and apply it accordingly.\n\nAs for its disciplines concerning the accidents (al-A'rāḍ), this relates to the actions of those legally responsible (al-mukallafīn), such as obligation (wujūb), prohibition (ḥaẓr), recommendation (nadb), disapproval (karāha), and permissibility (ibāḥa).\n\nAs for the temporal disciplines (al-Ādāb al-Zamāniyya), they relate to the times of worship (al-‘ibādāt) connected to specific periods. Every time has a ruling concerning the legally responsible person, and among these are times whose duration is narrow and times whose duration is wide.\n\nAs for the spatial disciplines (al-Ādāb al-Makāniyya), such as the places of worship, like the Houses of Allah concerning which Allah has permitted <<أَنْ تُرْفَعَ ويُذْكَرَ فِيهَا اسْمُهُ>> (that they be raised and His Name be mentioned therein).\n\nAs for the positional disciplines (al-Ādāb al-Waḍ‘iyya), they dictate that a thing should not be named other than its proper name, lest the ruling of the Sacred Law change upon it due to the change of the name, thereby making lawful what was forbidden, or forbidding what was lawful. This is as the Prophet, peace be upon him, said: \"A time will come upon people when groups will appear who call wine (al-khamr) by other than its name,\" and that is so they may deem it lawful by the name. Similarly, when Malik was asked about the \"sea pig\" (khinzīr al-baḥr), he said it was forbidden. When it was said to him that it was merely a type of sea fish, he replied: \"You yourselves named it 'pig' (khinzīr), so the ruling of prohibition was extended to it because of the name.\" Likewise, when they named wine *nabīdh* or *ribā* or *tazīz*, they deemed it lawful by the name.\n\nAs for the discipline of relation (adab al-iḍāfa), it is exemplified by the saying of Khidr (regarding the boat): <<فَأَرَدْتُ أَنْ أَعِيبَها>> (So I intended to make it defective), and his saying (regarding the boy): <<فَأَرَدْنا أَنْ يُبْدِلَهُما>> (So We intended that their Lord should substitute for them), due to the shared nature between what is praised and what is blamed. And His saying (regarding the wall): <<فَأَرادَ رَبُّكَ>> (So your Lord intended) is to purify the praise therein. Thus, a single thing acquires blame by one relation and praise by relation to another aspect, yet it is the same thing, and the ruling changes according to the relation.\n\nAs for the disciplines of states (ādāb al-aḥwāl), such as the state of traveling in obedience and the state of traveling in disobedience—the ruling differs according to the state. Also, the state of travel differs from the state of residence regarding fasting and breaking the fast in Ramadan, and wiping over the leather socks (al-khuffayn) regarding the time limit and the absence of a time limit.\n\nAs for the disciplines in numbers (ādāb fī al-a‘dād), this relates to the number and measures of the acts of purification (ṭahāra), the Zakat, the number of prayers, and what may not be increased or decreased according to the ruling of the Sacred Law concerning it. Likewise, the prescribed measure for what one bathes and performs ablution with, such as the *mudd* and the *ṣā‘*. This is its discipline concerning number.\n\nAs for the discipline concerning the agent (al-mu’aththir), such as the ruling concerning the murderer and the usurper, and everything to which a specific act is attributed.\n\nAs for its discipline concerning the recipient of the effect (al-mu’aththar fīh), such as the slain person whose next of kin demand retribution (qawd) based on the manner in which he was killed or by another matter; and like the usurped property when it is found not in the possession of the one who directly committed the usurpation. This concludes the division of the discipline of the Sacred Law (Shari'a).\n\nAs for the division of the discipline of Service (adab al-Khidma):\n\nIt is either from the superior to the inferior, or from the inferior to the superior.\n\nAs for the service rendered by the superior to those below him, it is the upholding and observation of their welfare (maṣāliḥ), drawing attention to what has been neglected therein, clarifying what is unknown of it, specifying its times, places, and states, elucidating its ambiguities, and articulating its difficulties by establishing its guiding signs—such as the master with the student, the scholar with the ignorant, and the ruler with the subjects.\n\nAs for the service rendered by the inferior to those above him, it is by complying with their commands and prohibitions, adhering strictly to their customs and boundaries, hastening to what they love, rushing toward what pleases them, observing their signs, and conforming to their aims. This concludes the division of the discipline of Service (adab al-Khidma).\n\nAs for the division of the discipline of The Real (adab al-Ḥaqq):\n\nIt is giving Him what He deserves of what is proper to Him, and giving Him what He deserves from me, just as He gave me my creation when He said: <<أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ>> (He gave everything its creation). Thus, if you give Him what He deserves by virtue of what He is, and you give Him what He deserves from you by virtue of what you are to Him, then you have fulfilled the disciplines of The Real (al-Ḥaqq) in His giving everything its creation. This concludes the division of the disciplines of The Real.\n\nAs for the division of the disciplines of Reality (adab al-Ḥaqīqa):\n\nIts state is that you see Him in the very essence of things, yet not as the things themselves. Then you judge what you see of increase and decrease according to what the preparednesses (isti'dādāt) of the things have granted, and you attribute that [judgment] to them, not to Him, whether it be perfection, deficiency, conformity, or opposition, excluding nothing. For the state of Reality (al-Ḥaqīqa) yields what we have stated. If your state in every station is what we have mentioned, then you have fulfilled the discipline (Adab) and have taken all goodness with both hands, filling them with good. This is the utmost capacity of the created being. And Allah <<يَهْدِي من يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ>> (guides whom He wills to a straight path). Discourse upon the spiritual states (al-aḥwāl) does not bear elaboration; a mere indication of the intended meaning suffices. Whenever one elaborates upon it, one spoils it. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides the way).\n\n(In the Name of Allah, the Most Compassionate, the Most Merciful)",
    "ur": "**«باب نمبر دو سو دو: ادب کے حال میں»**\n\nشریعت کا ادب یہ ہے کہ تم اس کے نقشے پر قائم ہو جاؤ\nپس تم اہل ادب میں لکھے جاؤ گے۔\nاور جب تم قیام (فریضہ کی ادائیگی) سے فنا ہو جاؤ، اور تم کوشش میں ہو،\nتو تم اس کے ذریعے خادموں میں سے ہو جاؤ گے۔\nاور جب تم ہر طالب کو اس کا حق دو گے،\nجو وہ مستحق ہے، تو تم امانت داروں میں شامل ہو جاؤ گے۔\nاور تم شریعت مطہرہ کا حکم لے کر آؤ گے،\nاور اسی بات کو تمام قدماء نے کہا ہے۔\n\n**[کہ ادب کئی اقسام پر ہے]**\n\nجان لو کہ ادب کئی اقسام پر ہے۔\n\nجہاں تک شریعت کے ادب کا تعلق ہے،\n\nتو وہ یہ ہے کہ حکم کو اس کی جگہ سے تجاوز نہ کیا جائے، خواہ وہ جوہر میں ہو یا عرض میں، یا زمان میں یا مکان میں، یا وضع (طریقہ) میں یا اضافت (نسبت) میں، یا حال میں یا مقدار میں، یا مؤثر (اثر کرنے والے) میں یا مؤثر فیہ (جس پر اثر کیا جائے) میں۔ اور شریعت کے ادب کے ظہور کے محل کی اقسام محدود ہیں۔ جہاں تک ان ذوات میں اس کے ادب کا تعلق ہے جو بذات خود قائم ہیں، تو یہ اس کے مطابق ہے کہ وہ معدن، نباتات، حیوان، انسان اور عروض (عارضی چیزیں) میں سے کیا ہیں، اور ان میں سے کیا تبدیلی قبول کرتا ہے اور کیا تبدیلی قبول نہیں کرتا، اور کیا فساد قبول کرتا ہے اور کیا فساد قبول نہیں کرتا۔ پس ان سب میں شرع کا حکم معلوم کیا جائے گا اور اس کے مطابق اس پر نافذ کیا جائے گا۔ اور جہاں تک اعراض (عارضی صفات) میں اس کے آداب کا تعلق ہے، تو وہ مکلفین کے افعال سے متعلق ہیں، جیسے وجوب (فرض ہونا)، حظر (حرام ہونا)، ندب (مستحب ہونا)، کراہت (مکروہ ہونا) اور اباحت (جائز ہونا)۔ اور جہاں تک زمانی آداب کا تعلق ہے، تو وہ عبادات کے ان اوقات سے متعلق ہیں جو وقتوں سے جڑے ہوئے ہیں۔ پس ہر وقت کا مکلف کے حق میں ایک حکم ہے، اور ان میں سے کچھ ایسے ہیں جن کا وقت تنگ ہوتا ہے اور کچھ ایسے جن کا وقت وسیع ہوتا ہے۔ اور جہاں تک مکانی آداب کا تعلق ہے، جیسے عبادات کی جگہیں، مثلاً اللہ کے گھر جن کے بارے میں اللہ نے اجازت دی ہے کہ **\"وہ بلند کیے جائیں اور ان میں اس کا نام لیا جائے\"** (أَذِنَ الله فيها أَنْ تُرْفَعَ ويُذْكَرَ فِيهَا اسْمُهُ)۔ اور جہاں تک وضعی آداب کا تعلق ہے، تو وہ یہ ہے کہ کسی چیز کو اس کے نام کے علاوہ کسی اور نام سے نہ پکارا جائے تاکہ نام کی تبدیلی سے اس پر شرعی حکم تبدیل نہ ہو جائے، اور وہ حرام کو حلال کر دے یا حلال کو حرام کر دے۔ جیسا کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: **\"لوگوں پر ایک ایسا زمانہ آئے گا جس میں کچھ لوگ ظاہر ہوں گے جو شراب کو اس کے نام کے علاوہ کسی اور نام سے پکاریں گے\"** (سيأتي على الناس زمان يظهر فيه أقوام يسمون الخمر بغير اسمها)۔ اور یہ اس لیے ہوگا تاکہ وہ نام کے ذریعے اسے حلال کر لیں۔ جیسا کہ امام مالک سے دریائی خنزیر کے بارے میں پوچھا گیا تو انہوں نے فرمایا کہ وہ حرام ہے۔ ان سے کہا گیا کہ یہ تو سمندری مچھلیوں میں سے ہے۔ تو انہوں نے فرمایا: تم نے ہی اسے خنزیر نام دیا ہے، لہٰذا نام کی وجہ سے اس پر حرمت کا حکم لاگو ہو گیا۔ جیسا کہ انہوں نے شراب کو نبیذ یا ربا یا تزیز نام دیا اور نام کی وجہ سے اسے حلال کر لیا۔ اور جہاں تک اضافت (نسبت) کے ادب کا تعلق ہے، تو یہ خضر علیہ السلام کے اس قول کی طرح ہے: **\"تو میں نے چاہا کہ اسے عیب دار کر دوں\"** (فَأَرَدْتُ أَنْ أَعِيبَها) اور ان کا یہ قول: **\"تو ہم نے چاہا کہ ان کے بدلے میں دوسرا دے دیں\"** (فَأَرَدْنا أَنْ يُبْدِلَهُما)۔ یہ اس لیے ہے کہ جو چیز قابل تعریف ہے اور جو قابل مذمت ہے ان کے درمیان اشتراک ہے۔ اور ان کا یہ قول: **\"تو تمہارے رب نے چاہا\"** (فَأَرادَ رَبُّكَ) اس میں تعریف کو خالص کرنے کے لیے ہے۔ پس ایک ہی چیز نسبت کے اعتبار سے مذمت حاصل کرتی ہے اور دوسری جہت کی اضافت سے تعریف حاصل کرتی ہے، حالانکہ وہ بعینہٖ وہی چیز ہے۔ اور حکم نسبت کے ساتھ بدل جاتا ہے۔ اور جہاں تک احوال کے آداب کا تعلق ہے، جیسے طاعت میں سفر کا حال اور معصیت میں اس کا حال، تو حکم حال کے ساتھ مختلف ہو جاتا ہے۔ اور سفر کا حال بھی اقامت کے حال سے مختلف ہوتا ہے، جیسے رمضان کے روزے میں روزہ رکھنا یا افطار کرنا، اور موزوں پر مسح کرنے میں وقت کی تعیین اور عدم تعیین۔ اور جہاں تک اعداد میں آداب کا تعلق ہے، تو وہ طہارت کے افعال کی تعداد اور ان کی مقداروں، زکوٰۃ اور نمازوں کی تعداد سے متعلق ہے، اور وہ چیزیں جن میں شرعی حکم کے مطابق نہ اضافہ کیا جا سکتا ہے اور نہ کمی۔ اسی طرح غسل اور وضو میں استعمال ہونے والے پانی کی مقدار کی تعیین، جیسے مُد اور صاع۔ یہ اعداد میں اس کا ادب ہے۔ اور جہاں تک مؤثر (اثر کرنے والے) میں ادب کا تعلق ہے، جیسے قاتل اور غاصب کے بارے میں اس کا حکم، اور ہر وہ شخص جس کی طرف کوئی فعل منسوب کیا جائے۔ اور جہاں تک مؤثر فیہ (جس پر اثر کیا جائے) میں اس کے ادب کا تعلق ہے، جیسے مقتول کا قصاص لینا اس صفت کے ساتھ جس سے اسے قتل کیا گیا یا کسی دوسرے امر کے ساتھ، اور جیسے مغصوبہ (غصب کی گئی) چیز جب وہ اس شخص کے ہاتھ کے علاوہ کسی اور کے ہاتھ میں پائی جائے جس نے غصب کا ارتکاب کیا تھا۔ یہ شریعت کے ادب کی قسم ہے۔\n\nاور جہاں تک خدمت کے ادب کی قسم کا تعلق ہے،\n\nتو یا تو وہ اعلیٰ سے ادنیٰ کی طرف ہوتی ہے یا ادنیٰ سے اعلیٰ کی طرف۔ جہاں تک اعلیٰ کی خدمت کا تعلق ہے جو اس سے کم درجے کا ہے، تو وہ اس کے مصالح کی دیکھ بھال کرنا اور ان کی رعایت کرنا ہے، اور اس میں ان چیزوں پر متنبہ کرنا ہے جن میں غفلت واقع ہوئی ہو، اور ان چیزوں کی تعریف کرنا ہے جن سے وہ ناواقف ہو، اور ان کے اوقات، مقامات اور حالات کی تعیین کرنا ہے، اور ان کی مبہم باتوں کو واضح کرنا ہے، اور ان کے مشکل مسائل کو ان کے نشانات قائم کر کے کھول کر بیان کرنا ہے، جیسے استاد کا شاگرد کے ساتھ، عالم کا جاہل کے ساتھ، اور سلطان کا رعایا کے ساتھ۔ اور جہاں تک ادنیٰ کی خدمت کا تعلق ہے جو اس سے اعلیٰ ہے، تو وہ اس کے اوامر و نواہی کی تعمیل کرنا، اس کے طریقوں اور حدود پر قائم رہنا، اس کی پسندیدہ چیزوں کی طرف پہل کرنا، اس کی رضا کی طرف تیزی سے بڑھنا، اس کے اشاروں کی نگرانی کرنا اور اس کے مقاصد سے موافقت کرنا ہے۔ یہ خدمت کے ادب کی قسم ہے۔\n\nاور جہاں تک ذات حق (الحق) کے ادب کی قسم کا تعلق ہے،\n\nتو وہ یہ ہے کہ اسے وہ دیا جائے جس کا وہ مستحق ہے اور جو اس کے لائق ہے، اور اسے وہ دیا جائے جس کا وہ مجھ سے مستحق ہے، جیسا کہ اس نے مجھے میری تخلیق عطا کی جب **\"اس نے ہر چیز کو اس کی تخلیق عطا کی\"** (أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ)۔ پس جب تم نے اسے وہ دیا جس کا وہ مستحق ہے، اس حیثیت سے کہ وہ کیا ہے، اور تم نے اسے وہ دیا جس کا وہ تم سے مستحق ہے، اس حیثیت سے کہ تم کیا ہو، تو تم نے ذات حق (الحق) کے آداب کو پورا کیا کہ **\"اس نے ہر چیز کو اس کی تخلیق عطا کی\"** (أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ)۔ یہ ذات حق (الحق) کے آداب کی قسم ہے۔\n\nاور جہاں تک حقیقت (الحقيقة) کے آداب کی قسم کا تعلق ہے،\n\nتو اس کا حال یہ ہے کہ وہ ذات حق (الحق) کو اشیاء میں بعینہٖ دیکھے، نہ کہ وہ اشیاء (خود ذات حق) ہیں۔ پھر وہ اس زیادتی اور کمی پر حکم لگائے جو اسے اشیاء میں نظر آتی ہے، اس کے مطابق جو اشیاء کی استعدادات (استعدادات) نے اسے عطا کیا ہے۔ پس وہ اس (کمال یا نقص) کو اشیاء کی طرف منسوب کرے، نہ کہ ذات حق (الحق) کی طرف، خواہ وہ کمال ہو یا نقص، یا موافقت ہو یا مخالفت۔ وہ کسی چیز کو مستثنیٰ نہ کرے۔ کیونکہ حقیقت (الحقيقة) کا حال وہی دیتا ہے جو ہم نے کہا ہے۔ پس جب تمہارا حال ہر مقام میں وہی ہو جو ہم نے ذکر کیا، تو تم نے ادب کو پورا کیا اور تمام خیر کو اپنے دونوں ہاتھوں سے لے لیا اور انہیں خیر سے بھر لیا۔ اور یہ مخلوق کی وسعت کی انتہا ہے۔ اور اللہ **\"جسے چاہتا ہے سیدھے راستے کی طرف ہدایت دیتا ہے\"** (يَهْدِي من يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ)۔ اور احوال پر کلام تفصیل کا متحمل نہیں ہوتا، اور اس میں مقصود کی طرف اشارہ ہی کافی ہے۔ اور جب بھی تم اس میں بات کو پھیلاؤ گے، تو اسے بگاڑ دو گے۔ اور اللہ **\"حق کہتا ہے اور وہی راستہ دکھاتا ہے\"** (يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب دویست و دوم در بیان حال ادب\n\nادب شریعت آن است که به رسم آن قیام کنی *** پس از ادیبان (صاحبان ادب) نوشته شوی\n\nو چون از قیام (به آن) فانی شوی، در حالی که در *** کوشش هستی، پس تو به واسطه آن از خادمان هستی\n\nو چون حق هر طالب را *** آنچه سزاوار است بپردازی، به امینان ملحق شوی\n\nو حکم شرع مطهر را بیاوری *** و این همان است که همه قدما (پیشینیان) گفته‌اند.\n\n### [اینکه ادب بر چند قسم است]\n\nبدان که ادب بر چند قسم است.\n\nاما ادب شریعت، آن است که حکم را از جایگاهش تجاوز ندهی، خواه در جوهر باشد یا در عرض، یا در زمان، یا در مکان، یا در وضع (چگونگی)، یا در اضافه (نسبت)، یا در حال، یا در مقدار، یا در مؤثر (فاعل)، یا در مؤثر فیه (مفعول). و اقسام محل ظهور ادب شریعت در این موارد منحصر شده است.\n\nاما ادب آن (شریعت) در ذات‌هایی که قائم به خود هستند، بر حسب آنچه هستند، از معدن و نبات و حیوان و انسان و عوارض (اعراض)، و آنچه تغییر می‌پذیرد و آنچه تغییر نمی‌پذیرد، و آنچه فساد می‌پذیرد و آنچه فساد نمی‌پذیرد، می‌باشد. پس حکم شرع در همه اینها دانسته می‌شود و بر حسب آن در آنها جاری می‌گردد. و اما آداب آن در اعراض (عوارض)، مربوط به افعال مکلفین است از وجوب و حظر (حرام بودن) و ندب (مستحب بودن) و کراهت و اباحه (جواز). و اما آداب زمانی، مربوط به اوقات عباداتی است که به زمان‌ها گره خورده‌اند؛ پس هر وقتی حکمی در مکلف دارد، و از آن جمله است آنچه وقتش تنگ است و آنچه وقتش گشاده است. و اما آداب مکانی، مانند مواضع عبادات است، همچون خانه‌های خدا که خداوند اجازه داده است «أَنْ تُرْفَعَ وَيُذْكَرَ فِيهَا اسْمُهُ» (که رفعت یابند و نام او در آنها ذکر شود).\n\nو اما آداب وضعی (چگونگی)، آن است که شیء به غیر نام خود خوانده نشود تا حکم شرع با تغییر نام بر آن تغییر کند، و آنچه حرام بوده حلال شود یا آنچه حلال بوده حرام گردد. چنانکه پیامبر (ص) فرمود: «سَيَأْتِي عَلَى النَّاسِ زَمَانٌ يَظْهَرُ فِيهِ أَقْوَامٌ يُسَمُّونَ الْخَمْرَ بِغَيْرِ اسْمِهَا» (زمانی بر مردم خواهد آمد که در آن اقوامی ظاهر می‌شوند که شراب را به غیر نامش می‌خوانند) و این برای آن است که آن را به واسطه نام حلال شمارند. چنانکه از مالک (امام مالک) درباره خوک دریایی سؤال شد، فرمود: حرام است. به او گفته شد: این از جمله ماهی‌های دریاست. فرمود: شما آن را خوک نامیده‌اید، پس به خاطر این نام، حکم تحریم بر آن جاری شده است. همان‌گونه که شراب را نبیذ یا ربا یا تزیز نامیدند و به واسطه نام آن را حلال شمردند.\n\nو اما ادب اضافه (نسبت)، مانند سخن خضر است: «فَأَرَدْتُ أَنْ أَعِيبَهَا» (پس خواستم آن را معیوب سازم) و سخن او: «فَأَرَدْنَا أَنْ يُبْدِلَهُمَا» (پس خواستیم که آن دو را تبدیل کنیم) به دلیل اشتراک میان آنچه ستوده و آنچه نکوهیده است. و سخن او: «فَأَرَادَ رَبُّكَ» (پس پروردگارت خواست) برای خالص کردن ستایش در آن است. پس یک شیء واحد به واسطه یک نسبت، نکوهش کسب می‌کند و به واسطه اضافه‌اش به جهتی دیگر، ستایش کسب می‌کند، در حالی که همان شیء است و حکم به واسطه نسبت تغییر می‌کند.\n\nو اما آداب احوال (حالات)، مانند حال سفر در طاعت و حال سفر در معصیت است، که حکم به واسطه حال متفاوت می‌شود. و همچنین حال سفر با حال اقامت در روزه رمضان و افطار آن، و مسح بر خفین (کفش‌های چرمی) در توقیت (مدت‌دار بودن) و عدم توقیت (بدون مدت بودن) متفاوت است.\n\nو اما آداب در اعداد، مربوط به تعداد افعال طهارت و مقادیر آنها، و زکات، و تعداد نمازهاست، و آنچه بر حسب حکم شرع در آن نه افزوده می‌شود و نه کاسته. و همچنین تعیین مقدار آنچه با آن غسل و وضو گرفته می‌شود، مانند مُد و صاع. این ادب آن در عدد است.\n\nو اما ادب در مؤثر (فاعل)، مانند حکم آن در قاتل و غاصب و هر آنچه فعلی از افعال به او نسبت داده شود. و اما ادب آن در مؤثر فیه (مفعول)، مانند مقتولی که قصاص اهلش به همان صفتی که کشته شده یا به امری دیگر انجام می‌گیرد، و مانند مال غصب شده‌ای که در دست غیر از کسی که مباشرت غصب را داشته، یافت شود. این بخش ادب شریعت است.\n\nو اما بخش ادب خدمت (الخدمة)، یا از بالاتر به پایین‌تر است یا از پایین‌تر به بالاتر.\n\nاما خدمت بالاتر به کسی که پایین‌تر از اوست، عبارت است از قیام به مصالح او و رعایت آنها، و آگاه ساختن در مورد آنچه غفلت در آن رخ داده، و شناساندن آنچه از آن نادانسته مانده، و تعیین اوقات و مکان‌ها و حالات آن، و روشن ساختن امور مبهم و آشکار ساختن مشکلات آن با برپایی نشانه‌هایش؛ مانند استاد با شاگرد، و عالم با جاهل، و سلطان با رعیت. و اما خدمت پایین‌تر به کسی که بالاتر از اوست، با امتثال اوامر و نواهی او، و توقف در حدود و رسوم او، و مبادرت به خواسته‌های او، و شتاب در کسب رضایت او، و مراقبت اشارات او، و موافقت با مقاصد اوست. این بخش ادب خدمت (الخدمة) است.\n\nو اما بخش ادب حق (الحق)، آن است که آنچه را سزاوار اوست و شایسته اوست به او بدهی، و آنچه را که سزاوار است از من به او بدهی، همان‌گونه که او خلقت مرا به من داد آنگاه که «أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ» (به هر چیزی خلقتش را عطا کرد). پس هنگامی که آنچه را سزاوار اوست به واسطه آنچه اوست به او دادی، و آنچه را سزاوار است از تو به او دادی به واسطه آنچه تو برای او هستی، در این صورت به آداب حق (الحق) در عطا کردن خلقت هر شیء به آن شیء قیام کرده‌ای. این بخش آداب حق (الحق) است.\n\nو اما بخش آداب حقیقت (الحقیقة)، حال آن این است که او (حق) را در عین اشیاء ببینی، نه اینکه او خود اشیاء باشد. سپس بر آنچه از فزونی و کاستی می‌بینی، بر اساس آنچه استعدادات اشیاء به آن داده‌اند، حکم کنی. پس آن را به خود اشیاء نسبت دهی نه به او (حق)، خواه کمال باشد یا نقص، یا موافق باشد یا مخالف، و هیچ چیز را استثنا نکنی؛ زیرا حال حقیقت (الحقیقة) همین را که گفتیم اقتضا می‌کند.\n\nپس اگر حال تو در هر مقام همان باشد که ذکر کردیم، به ادب قیام کرده‌ای و همه خیر را با هر دو دست خود گرفته‌ای و آنها را از خیر پر ساخته‌ای. و این نهایت وسع مخلوق است. و خداوند «يَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ» (هر که را بخواهد به راه راست هدایت می‌کند). و سخن گفتن درباره احوال، گستردگی را برنمی‌تابد و در آن اشاره به مقصود کافی است، و هرگاه سخن را در آن بسط دهی، آن را تباه کرده‌ای. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را می‌نمایاند).\n\n(به نام خداوند بخشنده مهربان)"
  },
  "page_count": 2
}