{
  "id": 457,
  "title": {
    "ar": "الباب السابع والخمسون وأربعمائة في معرفة منازلة التكليف المطلق",
    "en": "Chapter Four Hundred and Fifty-Seven: Concerning the Knowledge of the Stations (منازلة) of Absolute Divine Obligation (التكليف المطلق)",
    "ur": "باب چار سو ستاون: مطلق تکلیف (التكليف المطلق) کے منازل کی معرفت میں۔",
    "fa": "باب چهارصد و پنجاه و هفتم در معرفت منازل تکلیف مطلق"
  },
  "content": {
    "ar": "## «الباب السابع والخمسون وأربعمائة في معرفة منازلة التكليف المطلق»\n\n\n> حكم التكاليف بين الله والناس *** من عهد والدنا المنعوت بالناسي‏\n\n\n> فالأمر مني له كالأمر منه لنا *** فإن دعانا أتيناه على الرأس‏\n\n\n### [المنازعة بين القلب والعين في المعارف الإلهية]\n\n\nقال الله تعالى وإِذا سَأَلَكَ عِبادِي عَنِّي يقول للرسول أن يقول فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ فَلْيَسْتَجِيبُوا لِي يعني إذا دعوتهم إلى القيام بما شرعته لهم وكل ذلك شرع فقد أدخل نفسه فيما كلف به عباده وجعل الأمر بأيديهم في ذلك فهو إعلام على الحقيقة بما هو الأمر عليه ما هو بالجعل فإنه يتعالى عن الجعل فيما ينسبه لهويته إلا إذا ظهر بصورة خلق فيقضي ما يعطيه البصر ان أحكام ما وقعت عليه العين مجعولة وتعطي الحقيقة أن الأمر ما هو كما تدركه العين فلا تزال المنازعة بين القلب والعين في المعارف الإلهية في الخصوص كما تعرفه العامة في العموم في المحبة ولنا في ذلك في التشبيب على ما وقع في العموم‏\n\n\n> يسوق روحي بلا شك إلى التلف *** هذا الذي بفؤادى من هوى شرف‏\n\n\n> أقول للقلب قد أورثتني سقما *** فقال عينك قادتني إلى التلف‏\n\n\n> لو لم تر العين ما أمسيت حلف *** فإن أمت فيه ما للحب من خلف‏\n> لذاك قسمت ما عندي على بدني *** من الضنا والجوى والدمع والأسف‏\n\n\nفالتكليف المطلق يطلق ويراد به أمران الأمر الواحد أن يعم الإنسان أجمعه مثل قوله يصبح على كل سلامي منكم صدقة وهو قوله إِيَّاكَ نَعْبُدُ بنون الجمع لعموم التكليف وإطلاقه في ذات المكلف ومن هذا الباب أعني إطلاق التكليف ما اجتمعت فيه جميع الشرائع ولم تنفرد به شريعة دون أخرى وهو قوله أَنْ أَقِيمُوا الدِّينَ ولا تَتَفَرَّقُوا فِيهِ فعم وأطلق والأمر الآخر من الإطلاق إدخاله نفسه معنا تعريفا أنه مأمور وآمر وناه ومنهي ربنا لا تُؤاخِذْنا ... رَبَّنا ولا تَحْمِلْ عَلَيْنا ... رَبَّنا ولا تُحَمِّلْنا ما لا طاقَةَ لَنا به والأمر واغْفِرْ لَنا وارْحَمْنا ... فَانْصُرْنا هذا منا عن أمر مشروع والجواب منه في الصحيح قد فعلت قد فعلت والأمر منه أَقِيمُوا الصَّلاةَ (وَ) آتُوا الزَّكاةَ (وَ) أَقْرِضُوا الله الجواب منا على قسمين بخلاف ما كان منه فجواب موافق لجوابه وهو قولنا سَمِعْنا وأَطَعْنا وجواب غير موافق من جميع الجهات لإجابته وهو قوله سَمِعْنا وعَصَيْنا وهذا كلام من أبعده الله عن سعادته وقرب إليه بهذه الإجابة شقاوته فقد أبنت لك عن إطلاق التكليف وهذا من إنصاف الحق عباده ليطلب منهم النصف ثم إنه في موطن آخر جعل لقوم آخرين ممن كتب عليهم شقاء مستندا إلهيا لم يقم فيه مقام الإنصاف فأعمى عليهم فعموا فنسب إليهم ما هو إليه وأشقاهم به ثم قال فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ لأن النزاع وقع بينه وبينه لأنه في نفس الأمر ما ثم إلا حكمان ما ثم ذاتان فافهم وعندنا ما كانت الحجة البالغة لله على عباده إلا من كون العلم تابعا للمعلوم ما هو حاكم على المعلوم فإن قال المعلوم شيئا كان لله الحجة البالغة عليه بأن يقول له ما علمت هذا منك إلا بكونك عليه في حال عدمك وما أبرزتك في الوجود إلا على قدر ما أعطيتني من ذاتك بقبولك فيعرف العبد أنه الحق فتندحض حجة الخلق في موقف العرفان الإلهي الخاص وأما في العموم فالأمر فيه قريب والحكم يختلف بحسب فهم الرجال فيه فما كل أحد تقام عليه حجة تقام على الآخر فلكل صنف حجة عند الله بها يظهر على عباده وهُوَ الْقاهِرُ بالحجة فَوْقَ عِبادِهِ وهُوَ الْحَكِيمُ الْخَبِيرُ حيث يظهر على كل صنف بما تقوم به الحجة لله عليه فلو لا إطلاق التكليف ما كان خصما ولا عمل لنا معه مجلس حكم ولا ناظرناه فافهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 457: On the Knowledge of the Station of Absolute Obligation\n\nThe law of obligations between God and mankind\nDates from the time of our father, described as the forgetful one.\n\nThe command from me to Him is like the command from Him to us,\nFor if He calls us, we come to Him immediately and willingly.\n\n### [The Contention between the Heart and the Eye concerning Divine Gnosis]\n\nAllah the Exalted said: <<And when My servants ask you concerning Me>> (He tells the Messenger to say) <<then indeed I am near. I answer the invocation of the invoker when he invokes Me. So let them respond to Me>> (Quran 2:186). Meaning, when I call them to fulfill what I have legislated for them—and all of that is legislation—He has included Himself in what He obligated upon His servants, and He has placed the matter in their hands concerning this.\n\nThis is therefore a declaration of the Reality (الحقيقة) concerning what the matter truly is, not by way of imposition (الجعل), for He is exalted above imposition regarding what is attributed to His Ipseity (هويته). Except when He manifests in the form of creation (خلق), He then decrees what the sight (البصر) grants: that the rulings upon which the eye (العين) falls are imposed (مجعولة). Yet the Reality (الحقيقة) grants that the matter is not as the eye perceives it. Thus, the contention between the Heart (القلب) and the Eye (العين) persists concerning Divine Gnosis (المعارف الإلهية) in particular, just as the common people know it generally in love (المحبة). We have a poetic expression concerning this, based on what occurs generally:\n\nWithout doubt, this love of nobility in my heart\nDrives my soul toward destruction.\n\nI say to the heart, \"You have bequeathed sickness to me,\"\nAnd it replies, \"Your eye led me to destruction.\"\n\nHad the eye not seen, I would not have sworn allegiance,\nAnd if I die in it, there is no successor to this love.\n\nTherefore, I divided what I possess among my body,\nOf wasting, deep sorrow, tears, and regret.\n\nThe Absolute Obligation (التكليف المطلق) is used and intended in two ways. The first way is that it encompasses the human being entirely, such as His saying: \"Every joint (سلامي) of yours must give charity every morning\" (Hadith), and His saying: <<You we worship>> (Quran 1:5), using the plural *nūn* for the generality and absoluteness of the obligation within the essence (ذات) of the obligated one. Also belonging to this category—meaning the absoluteness of the obligation—is that which all Divine Laws (الشرائع) agree upon and which no single law is unique to, namely His saying: <<Establish the Religion (الدين) and do not be divided therein>> (Quran 42:13). Thus, it is general and absolute.\n\nThe second way of absoluteness is His inclusion of Himself with us, making known that He is both commanded and Commander, both forbidden and Forbidder. [Such as our saying:] <<Our Lord, do not impose blame upon us... Our Lord, and lay not upon us a burden... Our Lord, and burden us not with that which we have no ability to bear. And pardon us, and forgive us, and have mercy upon us... and grant us victory>> (Quran 2:286). This is from us, based on a legislated command, and the response from Him, according to the sound tradition (Hadith), is: \"I have done so, I have done so.\"\n\nAs for the command from Him: <<Establish the prayer, and give the alms (Zakat), and lend to Allah a goodly loan>> (Quran 73:20, 2:245), our response is of two kinds, unlike His response. One response is in agreement with His response, which is our saying: <<We hear and we obey>> (Quran 2:285). The other response is not in agreement with His response in any respect, which is their saying: <<We hear and we disobey>> (Quran 2:286). This is the speech of one whom Allah has distanced from his felicity and brought his wretchedness near through this response.\n\nI have thus clarified for you the absoluteness of the obligation. This is part of the Real's (الحق) fairness toward His servants, so that He may seek fairness from them. Then, in another context, He established for other people—those upon whom wretchedness (شقاء) was decreed—a Divine basis (مستندا إلهيا) where He did not stand in the position of fairness. He blinded them, and they became blind. He then attributed to them what belongs to Him and made them wretched by it. Then He said: <<Thus the conclusive argument (الحجة البالغة) belongs to Allah>> (Quran 6:149). This is because the dispute occurred between Him and Him, for in the reality of the matter (نفس الأمر), there are only two rulings, not two Essences (ذاتان). Understand this.\n\nIn our view, the conclusive argument (الحجة البالغة) belonged to Allah against His servants only because Knowledge (العلم) follows the known (المعلوم); it does not rule over the known. If the known entity says something, Allah has the conclusive argument against it by saying to it: \"I only knew this from you because you were upon it in your state of non-existence, and I only brought you forth into Existence (الوجود) according to what you granted Me from your Essence (ذاتك) through your acceptance.\" Thus, the servant knows that He is the Real (الحق), and the argument of creation (الخلق) is refuted in the station of specific Divine Gnosis (العرفان الإلهي الخاص).\n\nAs for the general public (العموم), the matter is straightforward, and the ruling differs according to the understanding of men regarding it. Not every argument established against one person is established against another. For every category, there is an argument with Allah by which He manifests His dominance over His servants. <<And He is the Subduer (القاهر) over His servants by the argument, and He is the All-Wise, the All-Aware (الحكيم الخبير)>> (Quran 6:18). He manifests to every category that by which the argument of Allah is established against them. Were it not for the Absolute Obligation (إطلاق التكليف), there would be no adversary, nor would we hold a court of judgment with Him, nor would we debate Him. Understand this. <<And Allah speaks the Truth (الحق), and He guides to the way>> (Quran 33:4).",
    "ur": "باب نمبر چار سو ستاون: مطلق تکلیف (التکلیف المطلق) کے مقام کی معرفت میں\n\nاللہ اور لوگوں کے درمیان تکالیف کا حکم *** ہمارے والد (آدم) کے زمانے سے ہے جنہیں بھولنے والا کہا گیا\n\nپس میرا حکم اس کے لیے ایسا ہی ہے جیسا اس کا حکم ہمارے لیے ہے *** اگر وہ ہمیں بلائے تو ہم سر کے بل حاضر ہوتے ہیں۔\n\n### [معارف الٰہیہ میں قلب اور آنکھ کے درمیان کشمکش]\n\nاللہ تعالیٰ نے فرمایا: **وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ فَلْيَسْتَجِيبُوا لِي** (اور جب میرے بندے آپ سے میرے بارے میں پوچھیں تو (کہہ دیجیے کہ) میں قریب ہوں، جب کوئی پکارنے والا مجھے پکارتا ہے تو میں اس کی دعا قبول کرتا ہوں، پس چاہیے کہ وہ میری بات مانیں)۔\n\nیہ رسول سے کہتا ہے کہ وہ کہیں: **فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ فَلْيَسْتَجِيبُوا لِي** (پس چاہیے کہ وہ میری بات مانیں)۔ یعنی جب میں انہیں اس چیز کے قیام کی طرف بلاؤں جو میں نے ان کے لیے مشروع کی ہے، اور یہ سب شریعت ہے۔ پس اس نے خود کو اس چیز میں داخل کر لیا جس کا اس نے اپنے بندوں کو مکلف بنایا، اور اس معاملے میں اختیار ان کے ہاتھوں میں دے دیا۔ یہ حقیقت پر مبنی ایک اطلاع ہے کہ معاملہ کس طرح ہے، یہ جعل (تخلیق/بنانا) سے نہیں ہے، کیونکہ وہ اپنی ہویت (ذات) سے منسوب چیزوں میں جعل (تخلیق) سے بلند ہے۔ مگر یہ کہ جب وہ کسی مخلوق کی صورت میں ظاہر ہو، تو وہ اس چیز کا فیصلہ کرتا ہے جو بصر (آنکھ) اسے دیتی ہے کہ جن احکام پر آنکھ پڑی ہے وہ مجعول (بنائے گئے) ہیں، جبکہ حقیقت یہ بتاتی ہے کہ معاملہ ویسا نہیں ہے جیسا آنکھ اسے ادراک کرتی ہے۔ پس معارف الٰہیہ میں قلب اور آنکھ کے درمیان کشمکش (منازعۃ) ہمیشہ جاری رہتی ہے، خاص طور پر جیسا کہ عام لوگ اسے محبت کے عموم میں جانتے ہیں۔ اور اس بارے میں ہمارے پاس تشبیب (غزل) میں وہ ہے جو عموم میں واقع ہوا ہے:\n\nیہ جو میرے دل میں شرف کی محبت ہے *** بلاشبہ میری روح کو ہلاکت کی طرف لے جا رہی ہے۔\n\nمیں نے دل سے کہا: تو نے مجھے بیماری میں مبتلا کر دیا *** تو اس نے کہا: تیری آنکھ نے مجھے ہلاکت کی طرف لے جایا۔\n\nاگر آنکھ نہ دیکھتی تو میں قسم نہ کھاتا *** اور اگر میں اس میں مر جاؤں تو محبت کا کوئی بدل نہیں ہے۔\n\nاسی لیے میں نے جو کچھ میرے پاس تھا اپنے بدن پر تقسیم کر دیا *** یعنی کمزوری، اندرونی غم، آنسو اور افسوس۔\n\nپس مطلق تکلیف (التکلیف المطلق) کا اطلاق ہوتا ہے اور اس سے دو چیزیں مراد ہوتی ہیں۔ پہلی چیز یہ کہ وہ پورے انسان کو شامل ہو، جیسا کہ اس کا فرمان ہے: \"تم میں سے ہر ایک کے ہر جوڑ پر صدقہ واجب ہوتا ہے\"۔ اور یہ اس کا قول ہے: **إِيَّاكَ نَعْبُدُ** (ہم تیری ہی عبادت کرتے ہیں) جمع کے نون کے ساتھ، جو تکلیف کے عموم اور مکلف کی ذات میں اس کے اطلاق کی وجہ سے ہے۔ اور اسی باب سے، یعنی تکلیف کے اطلاق سے، وہ ہے جس میں تمام شرائع جمع ہو گئیں اور کوئی ایک شریعت اس سے منفرد نہ ہوئی، اور وہ اس کا قول ہے: **أَنْ أَقِيمُوا الدِّينَ وَلَا تَتَفَرَّقُوا فِيهِ** (کہ دین کو قائم کرو اور اس میں تفرقہ نہ ڈالو)، پس یہ عام اور مطلق ہے۔\n\nاور اطلاق کی دوسری چیز یہ ہے کہ وہ خود کو ہمارے ساتھ داخل کرتا ہے، یہ بتاتے ہوئے کہ وہ مامور (حکم دیا گیا) بھی ہے، آمر (حکم دینے والا) بھی ہے، ناہی (منع کرنے والا) بھی ہے، اور منہی (منع کیا گیا) بھی ہے۔ (جیسا کہ ہمارا قول ہے): **رَبَّنَا لَا تُؤَاخِذْنَا... رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا... رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ** (اے ہمارے رب! ہمارا مؤاخذہ نہ فرما... اے ہمارے رب! ہم پر بوجھ نہ ڈال... اے ہمارے رب! ہم پر وہ بوجھ نہ ڈال جس کی ہم میں طاقت نہ ہو)۔ اور (ہمارا) حکم ہے: **وَاغْفِرْ لَنَا وَارْحَمْنَا... فَانْصُرْنَا** (اور ہمیں بخش دے اور ہم پر رحم فرما... پس ہماری مدد فرما)۔ یہ ہماری طرف سے ایک مشروع حکم کے تحت ہے۔ اور اس کی طرف سے صحیح حدیث میں جواب ہے: \"میں نے کر دیا، میں نے کر دیا\"۔\n\nاور اس کی طرف سے حکم ہے: **أَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَأَقْرِضُوا اللَّهَ** (نماز قائم کرو، اور زکوٰۃ دو، اور اللہ کو قرض دو)۔ ہمارا جواب دو قسموں پر ہے، اس کے جواب کے برعکس جو اس کی طرف سے تھا۔ ایک جواب اس کے جواب کے موافق ہے، اور وہ ہمارا قول ہے: **سَمِعْنَا وَأَطَعْنَا** (ہم نے سنا اور اطاعت کی)۔ اور ایک جواب اس کے جواب کے کسی بھی پہلو سے موافق نہیں ہے، اور وہ اس کا قول ہے: **سَمِعْنَا وَعَصَيْنَا** (ہم نے سنا اور نافرمانی کی)۔ اور یہ اس شخص کا کلام ہے جسے اللہ نے اس کی سعادت سے دور کر دیا اور اس جواب کے ذریعے اس کی شقاوت (بدبختی) کو اس کے قریب کر دیا۔\n\nپس میں نے تمہارے سامنے مطلق تکلیف (التکلیف المطلق) کو واضح کر دیا۔ اور یہ الحق (ذات حق) کا اپنے بندوں کے ساتھ انصاف ہے تاکہ وہ ان سے انصاف کا مطالبہ کرے۔ پھر وہ ایک دوسرے مقام پر کچھ دوسرے لوگوں کے لیے، جن پر شقاوت (بدبختی) لکھ دی گئی ہے، ایک الٰہی سند (مستند) مقرر کرتا ہے جس میں وہ انصاف کے مقام پر قائم نہیں ہوتا، پس وہ ان پر اندھا پن طاری کر دیتا ہے اور وہ اندھے ہو جاتے ہیں، پس وہ ان کی طرف وہ چیز منسوب کرتا ہے جو اس کی طرف ہے اور اس کے ذریعے انہیں بدبخت بنا دیتا ہے۔ پھر فرماتا ہے: **فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ** (پس اللہ ہی کے لیے کامل دلیل ہے)۔ کیونکہ نزاع اس کے اور اس کے درمیان واقع ہوا، اس لیے کہ نفس الامر میں دو ہی حکم ہیں، دو ذاتیں نہیں ہیں، پس سمجھو۔\n\nاور ہمارے نزدیک، اللہ کی طرف سے بندوں پر کامل دلیل (الحجۃ البالغۃ) صرف اس وجہ سے قائم ہوئی کہ علم معلوم کے تابع ہے، وہ معلوم پر حاکم نہیں ہے۔ اگر معلوم نے کوئی بات کہی، تو اللہ کے لیے اس پر کامل دلیل قائم ہو گئی کہ وہ اس سے کہے: میں نے تمہارے بارے میں یہ نہیں جانا مگر اس وجہ سے کہ تم اپنی عدم کی حالت میں اس پر تھے، اور میں نے تمہیں الوجود (ہستی) میں ظاہر نہیں کیا مگر اسی قدر جتنا تم نے اپنی ذات سے اپنے قبول کے ذریعے مجھے دیا۔ پس بندہ جان لیتا ہے کہ الحق (ذات حق) ہی ہے، اور خاص عرفان الٰہی کے مقام پر مخلوق کی دلیل باطل ہو جاتی ہے۔\n\nاور جہاں تک عموم کا تعلق ہے، تو اس میں معاملہ قریب ہے اور حکم اس میں لوگوں کی سمجھ کے مطابق مختلف ہوتا ہے۔ پس ہر شخص پر وہ دلیل قائم نہیں ہوتی جو دوسرے پر قائم ہوتی ہے۔ پس ہر صنف کے لیے اللہ کے پاس ایک دلیل ہے جس کے ذریعے وہ اپنے بندوں پر غالب آتا ہے، اور **وَهُوَ الْقَاهِرُ** (اور وہ غالب ہے) دلیل کے ساتھ **فَوْقَ عِبَادِهِ وَهُوَ الْحَكِيمُ الْخَبِيرُ** (اپنے بندوں پر، اور وہ حکمت والا، خبردار ہے)۔ جہاں وہ ہر صنف پر اس چیز کے ساتھ ظاہر ہوتا ہے جس کے ذریعے اللہ کے لیے اس پر دلیل قائم ہوتی ہے۔ اگر مطلق تکلیف (التکلیف المطلق) نہ ہوتا تو نہ کوئی فریق مخالف ہوتا اور نہ ہی ہمارا اس کے ساتھ کوئی مجلس حکم ہوتی اور نہ ہم اس سے مناظرہ کرتے، پس سمجھو۔ اور **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و پنجاه و هفتم در معرفت منزلگاه تکلیف مطلق (التكليف المطلق)\n\nحکم تکالیف میان حق (الحق) و مردمان، از عهد پدرمان که به «فراموشکار» وصف شد (آدم).\nپس امر من به او مانند امر او به ماست؛ اگر ما را بخواند، با سر (با کمال اطاعت) نزدش می‌آییم.\n\n### [نزاع میان قلب و چشم در معارف الهی]\n\nخداوند متعال فرمود: «و چون بندگانم از تو درباره من بپرسند، [بگو] همانا من نزدیکم، دعای دعا کننده را هنگامی که مرا بخواند، اجابت می‌کنم.» (وَإِذا سَأَلَكَ عِبادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ). پس «باید مرا اجابت کنند» (فَلْيَسْتَجِيبُوا لِي)؛ یعنی هنگامی که آنان را به انجام آنچه برایشان تشریع کرده‌ام فرا می‌خوانم، و همه آن تشریع است. پس او (حق) خود را در آنچه بندگانش را بدان مکلف ساخته، وارد کرده و امر را در آن به دست ایشان قرار داده است. این در حقیقت اعلامی است بر آنچه امر بر آن است، نه از طریق «جعل» (قرار دادن و وضع کردن)، زیرا او متعالی است از جعل در آنچه به هویت (ذات) او نسبت داده می‌شود، مگر آنکه به صورت خلق ظاهر شود، پس حکم می‌کند به آنچه بصر (بینایی) می‌دهد که احکام آنچه چشم بر آن افتاده، مجعول (وضع شده) است. و حقیقت (الحقیقة) می‌دهد که امر آن‌گونه نیست که چشم آن را درک می‌کند. پس نزاع میان قلب و چشم در معارف الهی (المعارف الإلهية) در خصوص (خاص) همچنان باقی است، همان‌گونه که عامه آن را در عموم در باب محبت می‌شناسند. و ما در این باره در تشبیب (شعر عاشقانه) بر آنچه در عموم واقع شده، سخن داریم:\n\nاین عشقی شریف که در دل من است، بی‌شک روحم را به سوی هلاکت می‌کشاند.\nبه قلب می‌گویم: مرا بیمار کردی. پس گفت: چشمت مرا به سوی هلاکت کشاند.\nاگر چشم نمی‌دید، من سوگند خورده (پایبند) نمی‌شدم؛ و اگر در این راه بمیرم، عشق را جانشینی نیست.\nاز این رو، آنچه داشتم از رنجوری و اندوه و اشک و تأسف، بر بدنم تقسیم کردم.\n\nپس تکلیف مطلق (التكليف المطلق) اطلاق می‌شود و دو امر از آن اراده می‌شود: امر اول این است که همه انسان را در بر گیرد، مانند این سخن پیامبر که «بر هر بند انگشت (سلامی) از شما صدقه‌ای است» و نیز سخن خداوند: «تنها تو را می‌پرستیم» (إِيَّاكَ نَعْبُدُ) با نون جمع، برای عمومیت تکلیف و اطلاق آن در ذات مکلف. و از این باب، یعنی اطلاق تکلیف، چیزی است که همه شرایع بر آن اتفاق دارند و شریعتی بدون دیگری بدان منفرد نشده است، و آن سخن خداوند است: «که دین را برپا دارید و در آن تفرقه نکنید» (أَنْ أَقِيمُوا الدِّينَ ولا تَتَفَرَّقُوا فِيهِ). پس عمومیت داد و مطلق ساخت.\n\nو امر دیگر از اطلاق، وارد کردن خود (حق) با ماست، برای شناساندن اینکه او هم مأمور است و هم آمر، و هم ناهی است و هم منهی. [مانند دعای ما:] «پروردگارا، ما را مؤاخذه مکن... پروردگارا، بار سنگینی بر دوش ما مگذار... پروردگارا، آنچه را که طاقت آن را نداریم، بر ما تحمیل مکن» (رَبَّنا لا تُؤاخِذْنا ... رَبَّنا ولا تَحْمِلْ عَلَيْنا ... رَبَّنا ولا تُحَمِّلْنا ما لا طاقَةَ لَنا به). و امر [دیگر]: «و ما را ببخش و بر ما رحم کن... پس ما را یاری ده» (وَاغْفِرْ لَنا وارْحَمْنا ... فَانْصُرْنا). این از جانب ما بر اساس امری مشروع است و پاسخ او در حدیث صحیح این است: «انجام دادم، انجام دادم.» و امر از جانب او: «نماز را برپا دارید» (أَقِيمُوا الصَّلاةَ)، «و زکات را بپردازید» (وَ آتُوا الزَّكاةَ)، «و به خدا قرض نیکو دهید» (وَ أَقْرِضُوا الله). پاسخ ما بر دو قسم است، برخلاف آنچه از جانب او بود: پاسخی موافق با پاسخ او، و آن سخن ماست: «شنیدیم و اطاعت کردیم» (سَمِعْنا وأَطَعْنا). و پاسخی که از همه جهات با اجابت او موافق نیست، و آن سخن [کسانی است که می‌گویند]: «شنیدیم و نافرمانی کردیم» (سَمِعْنا وعَصَيْنا). و این سخن کسی است که خداوند او را از سعادتش دور ساخته و با این پاسخ، شقاوتش را به او نزدیک کرده است. پس من اطلاق تکلیف را برای تو روشن ساختم، و این از انصاف حق (الحق) با بندگانش است تا از آنان انصاف بخواهد.\n\nسپس او در موطن دیگری برای گروهی دیگر که شقاوت بر آنان نوشته شده، مستندی الهی قرار داد که در آن مقام انصاف را برپا نداشت؛ پس بر آنان پرده افکند و آنان کور شدند. پس آنچه را که به او (حق) تعلق داشت، به آنان نسبت داد و آنان را به واسطه آن شقی ساخت، سپس فرمود: «پس حجت رسا از آن خداست» (فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ). زیرا نزاع میان او و او (حق و خلق) واقع شد، چرا که در نفس امر، جز دو حکم نیست، نه دو ذات (ذاتان). پس بفهم. و نزد ما، حجت رسا (الحجة البالغة) برای خداوند بر بندگانش نبود، مگر از این جهت که علم تابع معلوم است، نه حاکم بر معلوم. پس اگر معلوم چیزی بگوید، خداوند حجت رسای خود را بر او دارد، به اینکه به او بگوید: من این را از تو ندانستم، مگر به سبب اینکه تو در حال عدمت بر آن بودی. و تو را در هستی (الوجود) آشکار نساختم، مگر به اندازه‌ای که از ذات خودت با پذیرش (قبول) به من دادی. پس بنده می‌شناسد که او حق (الحق) است، و در موقف عرفان (المعرفة) الهی خاص، حجت خلق باطل می‌شود. اما در عموم، امر در آن نزدیک است و حکم بر حسب فهم مردمان در آن متفاوت است. پس حجتی که بر یک نفر اقامه می‌شود، بر دیگری اقامه نمی‌شود. پس برای هر صنفی حجتی نزد خداوند است که به واسطه آن بر بندگانش غالب می‌شود، و «اوست که با حجت بر بندگانش قاهر است» (وَهُوَ الْقاهِرُ فَوْقَ عِبادِهِ) و «اوست حکیم و آگاه» (وَهُوَ الْحَكِيمُ الْخَبِيرُ). آنجا که بر هر صنفی با آنچه حجت خدا بر او اقامه می‌شود، ظاهر می‌گردد. و اگر اطلاق تکلیف (التكليف المطلق) نبود، او خصم ما نمی‌شد و ما با او مجلس حکمی تشکیل نمی‌دادیم و با او مناظره نمی‌کردیم. پس بفهم. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}