{
  "id": 315,
  "title": {
    "ar": "الباب الخامس عشر وثلاثمائة في معرفة منزل وجوب العذاب من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Fifteen: Concerning the Gnosis (معرفة) of the Station (منزل) of the Obligation of Torment (وجوب العذاب) within the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو پندرہ: الحضرة المحمدية (الحضرة المحمدية) سے عذاب کے وجوب کے منزل کی معرفت (معرفة) کے بارے میں۔",
    "fa": "باب سیصد و پانزدهم در معرفت منزل وجوب عذاب از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب الخامس عشر وثلاثمائة في معرفة منزل وجوب العذاب من الحضرة المحمدية»\n\n\n> إذا حقت حقائقنا اتحدنا *** ولكن لا سبيل إلى الوصول‏\n\n\n> إلى هذا المقام بكل وجه *** من أجل الاستواء مع النزول‏\n\n\n> وكيف يصح أن يرقى إليه *** وأين سنا الجليل من الخليل‏\n\n\n> رأيت حبيبه صلى عليه *** كما صلى على نفس الخليل‏\n\n\n> فعين الجمع عين الفرق فيه *** كذا جاء الحديث عن الرسول‏\n\n\n> إذا أفلت شموس العلم تاهت *** عقول حظها علم الدليل‏\n\n\n> لو أن الغيب تشهده عيون *** لكان طلوعها عين الأفول‏\n\n\n### [أن وجوب العذاب وقوعه بالمعذب‏]\n\n\nاعلم أيها الولي الحميم أن وجوب العذاب وقوعه بالمعذب يقال وجب الحائط إذا سقط ولا يكون السقوط إلا ممن لم يكن له علو ذاتي ولم يستحق العلو لذاته فلما علا من هذه صفته لم يكن له حقيقة تمسك عليه علوه فسقط تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُها لِلَّذِينَ لا يُرِيدُونَ عُلُوًّا في الْأَرْضِ والصفات النفسية لا تكون مرادة للموصوف بها فمن علا بغيره ولم يكن له حافظ يحفظ عليه علوه سقط وقوتل فالعالي من أعلى الله منزلته كما قال ورَفَعْناهُ مَكاناً عَلِيًّا فلما كانت الرفعة من الله الذي له العلو الذاتي حفظ على كل من أعلى الله منزلته علوه ومن علا بنفسه من الجبارين والمتكبرين قصمه الله وأخذه ولهذا قال والْعاقِبَةُ لِلْمُتَّقِينَ أي عاقبة العلو الذي علا به من أراد علوا في الأرض يكون للمتقين أي يعطيهم الله العلو في المنزلة في الدنيا والآخرة فأما في الآخرة فأمر لازم لا بد منه لأن وعده صدق وكلامه حق والدار الآخرة محل تميز المراتب وتعيين مقادير الخلق عند الله ومنزلتهم منه تعالى فلا بد من علو المتقين يوم القيامة وأما في الدنيا فإنه كل من تحقق صدقه في تقواه وزهده فإن نفوس الجبارين والمتكبرين تتوفر دواعيهم إلى تعظيمه لكونهم ما زاحموهم في مراتبهم فأنزلهم ما حصل في نفوسهم من تعظيم المتقين عن علوهم وقصدوا خدمتهم والتبرك بهم وانتقل ذلك العلو الذي ظهروا به إلى هذا المتقي وكان عاقبة العلو للمتقي والجبار لا يشعر ويلتذ الجبار إذا قيل فيه إنه قد تواضع ونزل إلى هذا المتقي فيتخيل الجبار أن المتقي هو الأسفل وأن الجبار نزل إليه بل علو الجبار انتقل إلى المتقي من حيث لا يشعر ونزل الجبار تحت علو هذا المتقي ولو سئل المتقي عن علوه ما وجد عنده منه شي‏ء فثبت إن العلو في الإنسان إنما هو تحققه بعبوديته وعدم خروجه واتصافه بما ليس له بحقيقة أ لا ترى حكمة الله تعالى في قوله لَمَّا طَغَى الْماءُ أي علا وارتفع وأضاف العلو له وما أضافه الحق إلى نفسه فلما علا للماء وارتفع حمل الله من أراد نجاته من سطوة ارتفاع الماء في أخشاب ضم بعضها إلى بعض حتى كانت سفينة فدخل فيها كل من أراد الله نجاته من المؤمنين فعلت السفينة بمن فيها على علو الماء وصار الماء تحتها وزال في حق السفينة طغيان الماء فانكسر في نفسه وسبب ذلك إضافة العلو له وإن كان من عند الله وبأمر الله ولكن ما أضاف الله العلو إلا للماء فلو أضاف علو الماء إلى الله تعالى لحفظ علوه عليه فلم يكن تعلو عليه سفينة ولا يطفو على وجه الماء شي‏ء أبدا فهذا شؤم الدعوى فسقوط العذاب بالمعذب إنما كان سقوطه من ارتفاعه في نفسه لكونه صفة ملكية للاسم الله المعذب فأعطته هذه النسمة سمة العلو لأنه صفة من له العلو وهو الاسم المعذب فلما رأى الاسم المعذب ما قام في نفس العذاب من العلو بسببه أسقطه على المعذب به فزال عن العلو الذي كان يزهو به حين كان المعذب موصوفا به فلهذا يقال بوجوب العذاب على المعذب وتحقيق ذلك أن الأمر الصحيح أن الملك لا يعذب أحدا إلا حتى يقوم به الغضب على ذلك الذي يريد تعذيبه لأمر صدر منه يستوجب به العذاب فأثر ذلك الأمر في نفس الملك غضبا تأذى به الملك والملك جليل القدر لا يليق بمكانته لعلو منصبه أن يتعذب بشي‏ء وقد فعل هذا\nالشخص أمرا أغضب الملك فأنزل الملك العذاب الذي كان يجده الملك في نفسه المعبر عنه بالغضب أو الذي أثمر الغضب في نفس الملك أوجبه بهذا الشخص أي أسقطه عليه فإذا وجب العذاب على هذا الشخص وجد الملك راحته بعذاب هذا الشخص وليس الأمر كذلك هنا وإنما وجود الراحة بزوال العذاب الذي كان في نفس الملك الذي أورثه فعل هذا الشخص فتعذب الملك به فلما أنزله بهذا الشخص انتقل عنه فوجد الراحة بانتقاله ويسمى في العامة التشفي وهو من الشفاء والشفاء زوال العلة لا نزول العلة التي كانت في العليل بشخص آخر هذا تحقيق الشفاء والراحة ثم كونه نزل ذلك الألم بشخص آخر لهذا به لذة فتلك لذة أخرى زائدة على لذة زوال العذاب والعلو هنا حقيقة للاسم الإلهي فلهذا اتصف العذاب بالسقوط وهو الوجوب قال تعالى أَ فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ أي وجبت وسقطت فإن قلت هذا يصح في حق المخلوقين كيف يتمشى ذلك في حق الجناب العالي سبحانه قلنا فلما عجزنا عن معرفة الله ويحق لنا العجز فينبغي لنا إذا تركنا وعقولنا وحقائقنا أن نلتزم ذلك وننفي عنه مثل هذا وغيره فإن قوة العقل تعطي ذلك غير إن قوة العقل والدليل الواضح قاما للعقل على تصديق الرسول الذي بعثه إلينا في إخباره الذي يخبر به عن ربه بما يكون منه سبحانه في خلقه وبما يكون عليه سبحانه في نفسه ومما يصف به نفسه مما يحيله عليه العقل إذا انفرد بدليله دون الشارع فالعاقل الحازم يقف ذليلا مشدود الوسط في خدمة الشرع قابلا لكل ما يخبر به عن ربه سبحانه وتعالى مما\n\n\nيكون عليه ومنه فكان مما قد أخبر الحق عن نفسه إن قال إِنَّ الَّذِينَ يُؤْذُونَ الله وقال صَلَّى اللهُ عَليهِ وسَلَّم لا أحد أصبر على أذى من الله‏\n\n\nوقال تعالى كذبني ابن آدم وشتمني ابن آدم‏\n\n\nوقال تعالى وغَضِبَ الله عَلَيْهِمْ وقالت الأنبياء قاطبة إن الله يوم القيامة يغضب غضبا لم يغضب قبله مثله ولن يغضب بعده مثله‏\n\n\nوسلم العاقل ذلك كله إلى الله في خبره عن نفسه كما سلم إليه سبحانه أنه يفرح بتوبة عبده وكل من اتصف بالفرح فيتصف بنقيضه ووصف نفسه بأنه يتعجب من الشاب ليست له صبوة ووصف نفسه بأنه يضحك إذا قال هناد يوم القيامة أ تستهزئ بي وأنت رب العالمين ووصف نفسه بأنه يتبشبش لعبده إذا جاء المسجد يريد الصلاة ووصف نفسه بأنه يكره لعباده الكفر ويرضى لهم الشكر والايمان فهذا كله واجب على كل مسلم الايمان به ولا يقول العقل هنا كيف ولا لم كان كذا بل يسلم ويستسلم ويصدق ولا يكيف فإنه ليس كمثله شي‏ء فلما رأيناه وصف نفسه بالغضب والأذى ووصف العذاب بالوجوب والسقوط لا يكون إلا من العلو والعلو لا ينبغي إلا لله تعالى فعلمنا إن الأذى الذي وصف الحق به نفسه هو هذا فعلا الأذى بعلو من اتصف به فأسقطه عن ذلك العلو على من يستحقه وهو الذي آذى الله ورسوله فحل به العذاب في دار الخزي والهوان فإن علمت ما قررناه جمعت بين الايمان الذي هو الدِّينُ الْخالِصُ وبين ما تستحقه مرتبتك من التسليم لله في كل ما يخبر به عن نفسه ولا يتمكن في الإفصاح عن هذا المقام بأكثر من هذا ولا أبلغ إلا أن يخبر الحق بما هو أجلي في النسبة وأوضح وإنما غاية المخلوق من هذا الأمر بمجرد عقله هذا الذي قررناه إلا عقولا أدركها الفضول فتأولت هذه الأمور فنحن نسلم لهم حالهم ولا نشاركهم في ذلك التأويل فإنا لا ندري هل ذلك مراد الله بما قاله فنعتمد عليه أو ليس بمراده فنرده فلهذا التزمنا التسليم فإذا سألنا عن مثل هذا قلنا إنا مؤمنون بما جاء من عند الله على مراد الله به وإنا مؤمنون بما جاء عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ورسله عليه السلام على مراد رسوله صَلَّى اللهُ عَليهِ وسَلَّم ومراد رسله عليه السلام ونكل العلم في كل ذلك إليه سبحانه وإليهم وقد تكون الرسل بالنسبة إلى الله في هذا الأمر مثلنا يرد عليها هذا الإخبار من الله فتسلمه إليه سبحانه وتعالى كما سلمناه ولا تعرف تأويله هذا لا يبعد وقد تكون تعرف تأويله بتعريف الله تعالى بأي وجه كان هذا أيضا لا يبعد وهذه كانت طريقة السلف جعلنا الله لهم خلفا بمنه فطوبى لمن راقب ربه وخاف ذنبه وعمر بذكر الله قلبه وأخلص لله حبه فهذا قد أعلمتك بمعنى وجوب العذاب على من وجب عليه وأكثر من هذا فلا يحتمل هذا الباب فإن مجاله ضيق في العامة وإن كان المجال فيه رحبا فيه رحبا عند أمثالنا بما منحنا الله به من المعرفة بالله ولكن العقول المحجوبة بالهوى وبطلب الرئاسة والنفاسة والعلو على أبناء الجنس يمنعهم ذلك من القبول والانقياد ونحن فما نحن رسل من الله حتى نتكلف إيصال‏\nمثل هذه العلوم بالتبليغ وما نذكر منها ما نذكر إلا للمؤمنين العقلاء الذين اشتغلوا بتصفية نفوسهم مع الله وألزموا نفوسهم التحقق بذلة العبودية والافتقار إلى الله في جميع الأحوال فنور الله بصيرتهم إما بالعلم وإما بالإيمان والتسليم لما جاء به الخبر عن الله وكتبه ورسله فتلك العناية الكبرى والمكانة الزلفى والطريقة المثلى والسعادة العظمى ألحقنا الله بمن هذه صفته وأما ما يتضمن هذا المنزل من العلوم فهو يتضمن علم الحق ومنه ما كنا بسبيله في شرح وجوب العذاب وفيه أيضا علم الاسم الإلهي الذي يستفهم منه الحق عباده مثل قوله يوم يجمع الله الرسل فيقول ما ذا أجبتم وهو أعلم ومثل قوله كيف تركتم عبادي يقوله للملائكة الذين باتوا فينا ثم عرجوا إليه وهو علم شريف وفيه الزواجر الإلهية وهل هي كونية أو إلهية وعلم السبب الموجب لهلاك الأمم عند كفرهم ومن هلك من المؤمنين بهلاكهم وهلاك المقلدة معهم كل ذلك في الدنيا ومن يخرج من هذا الهلاك في الآخرة ولما ذا وقع الهلاك بالمؤمنين حين وقع بالكافرين فعم الجميع واختلفت الصفة وهل هذا من الركون كما قال ولا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا وعلم الركون الموجب لمس النار إياهم هل هو ركون حسي أو معنوي وقوله بتضعيف العذاب على الركون وإن قصد خيرا قال تعالى لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا إِذاً لَأَذَقْناكَ ضِعْفَ الْحَياةِ وضِعْفَ الْمَماتِ ما سبب هذا الضعف الذي هو أشد من العذاب المستحق بالأصالة وما مراد الله في مثل هذه الآية التي لا يعلم ما فيها إلا بتعريف الله وهو علم عظيم بتضمنه هذا المنزل ومن أهلك بنفسه ومن أهلك بغيره وما حد الهلاك بالغير وما حد الهلاك بالنفس وما مقدار زمانه وهل الهلاك في اختلاف أنواعه لاختلاف الأحوال في الهالكين أو لاختلاف حقائق الأسماء الإلهية حتى يأخذ كل اسم إلهي بهذا المقام قسطه من العذاب وما ينعدم من الأسماء بعد وجودها وما يبقى ولا ينعدم بهلاك أو غيره وعلم الفرق بين من عصى الله وعصى رسوله وعصى أولي الأمر وما يتضمنه عصيان الرسول وعصيان أولي الأمر من معصية الله فإن في عصيانهم عصيان أمر الله وليس في عصيان الله عصيانهم إلا في الرسول خاصة فإن في عصيان الله عصيان رسول الله إذ متعلق المعصية الأمر الإلهي والنهي ولا يعرف ذلك إلا بتبليغ الرسول وعلى لسانه فإن الله لا يبلغ أمره إلا رسل الله وليس لغير الرسل من البشر هذا المقام ومع هذا فلله أمر يعصى فيه وللرسول أمر يعصى فيه وثم أمر بجمع فيه معصية الله ورسوله فكل أمر يتعلق بجناب الله ليس لمخلوق فيه دخول فتلك معصية الله وكل أمر يتعلق بجناب المخلوق الذي هو رسول الله فتلك معصية الرسول وكل أمر يتضمن الجانبين فتلك معصية الله ورسوله قال الله تعالى ومن يَعْصِ الله ورَسُولَهُ وقال ومعصية الرسول فأفرده وقال ومن يُشْرِكْ بِاللَّهِ فَقَدْ ضَلَّ فأفرد نفسه وعلم من يستحق العظمة والصفة التي تطلبها وعلم التذكير وعلم السماع من الحق وعلم الملك وملك الملك وعلم ملك العزة وعلم الملك الحامل وعلم الملك المحمول وعلم ملك الهباء وعلم الهول الأعظم وعلم الكنز الذي تحت العرش‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم إن لا حول ولا قوة إلا بالله خرجت من كنز تحت العرش‏\n\n\nوما هو الكنز وما يتضمن من الذكر المكنوز فيه سوى لا حول ولا قوة إلا بالله وعلم القوة الإلهية والكونية وعلم ضم المعاني بعضها إلى بعض في حضرة الكلمات وهل لها انضمام في أنفسها مجردة عن مواد الكلمات أو ليس لها ضم في أنفسها وإذا لم يكن لها ضم فهل ذلك لاستحالة الأمر في نفسه فلا يقبل الانضمام أو بإرادة الله وما الفرق بين كتابة المخلوق وكتابة الخالق وهو علم عجيب رأيناه وشاهدناه‏\n\n\nفإن النبي صَلَّى اللهُ عَليهِ وسَلَّم خرج وفي يديه كتابان مطويان قابض بكل يد على كتاب فسأل أصحابه أ تدرون ما هذان الكتابان فأخبرهم إن في الكتاب الذي بيده اليمنى أسماء أهل الجنة وأسماء آبائهم وقبائلهم وعشائرهم من أول من خلقه الله إلى يوم القيامة وفي اليد الأخرى في الكتاب الآخر أسماء أهل النار وأسماء آبائهم وقبائلهم وعشائرهم إلى يوم القيامة ولو أخذ المخلوق يكتب هذه الأسماء على ما هي عليه في هذين الكتابين لما قام بذلك كل ورق في العالم‏\n\n\nفمن هنا يعرف كتابة الله من كتابة المخلوقين (و قد حكي) عن بعض البله من أهل الحاج أنه لقي رجلا وهو يطوف طواف الوداع فأخذ ذلك الرجل يمازح هذا الأبله هل أخذت من الله براءتك من النار فقال الأبله لا وهل أخذ الناس ذلك قال له نعم فبكى ذلك الأبله ودخل الحجر وتعلق بأستار الكعبة وجعل يبكي ويطلب‏\nمن الله أن يعطيه كتابه بعتقه من النار فجعل الناس وأصحابه يلومونه ويعرفونه أن فلانا مزح معك وهو لا يصدقهم بل بقي مستمرا على حاله فبينا هو كذلك إذ سقطت عليه ورقة من الجو من جهة الميزاب فيها مكتوب عتقه من النار فسر بها وأوقف الناس عليها وكان من آية ذلك الكتاب أنه يقرأ من كل ناحية على السواء لا يتغير كلما قلبت الورقة انقلبت الكتابة لانقلابها فعلم الناس أنه من عند الله وأما في زماننا فاتفق لامرأة أنها رأت في المنام كأن القيامة قد قامت وأعطاها الله ورقة شجرة فيها مكتوب عتقها من النار فمسكتها في يدها واتفق أنها استيقظت من نومها والورقة قد انقبضت عليها يدها ولا نقدر على فتح يدها وتحس بالورقة في كفها واشتد قبض يدها عليها بحيث إنه كان يؤلمها فاجتمع الناس عليها وطمعوا أن يقدروا على فتح يدها فما استطاع أحد على فتح يدها من أشد ما يمكن من الرجال فسألوا عن ذلك أهل طريقنا فما منهم من عرف سر ذلك وأما علماء الرسم من الفقهاء فلا علم لهم بذلك وأما الأطباء فجعلوا ذلك لخلط قوى أنصب إلى ذلك العضو فأثر فيه ما أثر فقال بعض الناس لو سألنا فلانا يريدون إياي بذلك ربما وجدنا عنده علما بذلك فجاءوني بالمرأة وكانت عجوزا ويدها مقبوضة قبضا يؤلمها فسألتها عن رؤياها فأخبرتني كما أخبرت الناس فعرفت السبب الموجب لقبض يدها عليها فجئت إلى أذنها وساررتها فقلت لها قربى يدك من فمك وانوي مع الله إنك تبتلعين تلك الورقة التي تحسين بها في كفك فإنك إذا نويت ذلك وعلم الله صدقك في ذلك فإن يدك تنفتح فقربت المرأة يدها من فيها وألزقته وفتحت فاها ونوت مع الله ابتلاع الورقة فانفتحت يدها وحصلت الورقة في فمها فابتلعتها وانفتح يدها فتعجب الحاضرون من ذلك فسألوني عن علم ذلك فقلت لهم إن مالك بن أنس إمام دار الهجرة اتفق في زمانه وهو ابن ثلاث عشرة سنة وكان يقرأ الفقه على شيوخه وكان ذا فطنة وذكاء فاتفق في ذلك الزمان أن امرأة غسلت ميتة فلما وصلت إلى فرجها ضربت بيدها على فرج الميتة وقالت يا فرج ما كان أزناك فالتصقت يدها بالفرج والتحمت به فما استطاع أحد على إزالة يدها فسئل فقهاء المدينة ما الحكم في ذلك فمن قائل يقطع يدها ومن قائل يقطع من بدن الميتة قدر ما مسكت عليه اليد وطال النزاع في ذلك بين الفقهاء أي حرمة أوجب علينا حرمة الميت فلا نقطع منه شيئا أو حرمة الحي فلا يقطع فقال لهم مالك أرى أن الحكم في ذلك أن تجلد الغاسلة حد الفرية فإن كانت افترت فإن يدها تنطلق فجلدت الغاسلة حد الفرية فانطلقت يدها فتعجب الفقهاء من ذلك ونظروا مالكا من ذلك الوقت بعين التعظيم وألحقوه بالشيوخ كما كان عمر بن الخطاب يلحق عبد الله بن عباس بأهل بدر في التعظيم لعظم قدره في العلم ولما علمت أنا بما ألقى الله في نفسي أن الله غار على تلك الورقة أن لا يطلع عليها أحد من خلق الله وأن ذلك سر خص الله به تلك المرأة قلت لها ما قلت فانفتحت يدها وابتلعت تلك الورقة ويحوي هذا المنزل‏\n\n\nعلى علم الجنان والنار وعلم مواقف القيامة وعلم الأحوال الأخروية وعلم الشرائع وعلم ما السبب الموجب الذي لأجله عرفت الرسل مقاديرها مع علو منزلتهم عند الله والفرق بين منزلتهم عند الله ومنزلتهم عند الناس المؤمنين بهم وبأي عين ينظر إليهم الحق وبأي اسم يخاطبهم وعلم التنزيه والتقديس والعظمة وما حضرة الربوبية من حضرات بقية الأسماء المقيدة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 315: Concerning the Knowledge of the Station of the Necessity of Punishment, derived from the Muhammadan Presence (الحضرة المحمدية)\n\nIf our realities (حقائقنا) were truly realized, we would unite,\nBut there is no path to reach [that union].\nTo this station (المقام) in every aspect,\nBecause of the simultaneous establishment (الاستواء) and descent (النزول).\nAnd how can it be right to ascend to it?\nWhere is the light of the Majestic (الجليل) compared to the Intimate Friend (الخليل)?\nI saw His Beloved praying upon Him,\nJust as He prayed upon the very soul of the Intimate Friend.\nThe essence of Gathering (الجمع) is the essence of Separation (الفرق) within him,\nThus came the tradition (حديث) from the Messenger.\nWhen the suns of Gnosis (العلم) set,\nThe minds whose portion is the knowledge of proof (علم الدليل) are lost.\nIf eyes were to witness the Unseen (الغيب),\nTheir rising would be the very essence of their setting.\n\n[That the necessity of punishment is its falling upon the punished one]\n\nKnow, O intimate friend (الولي الحميم), that the necessity of punishment (وجوب العذاب) is its falling (وقوعه) upon the punished one (المعذب). It is said, \"The wall became necessary (وجب)\" when it fell (سقط). Falling only occurs to that which did not possess inherent elevation (علو ذاتي) and did not deserve elevation by its own essence (لذاته). When something of this description rises, it lacks a reality (حقيقة) to sustain its elevation, and thus it falls. <<تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُها لِلَّذِينَ لا يُرِيدُونَ عُلُوًّا في الْأَرْضِ>> (That is the Home of the Hereafter, We assign it to those who do not desire high-handedness [or elevation] in the earth). And the psychic attributes (الصفات النفسية) are not desired by the one described by them. Thus, whoever achieves elevation through another, and lacks a guardian to preserve his elevation, falls and is fought against. The truly elevated is he whose station God elevates, as He said: <<ورَفَعْناهُ مَكاناً عَلِيًّا>> (And We raised him to a high station). Since the elevation came from God, Who possesses inherent elevation (العلو الذاتي), He preserves the elevation of everyone whose station God elevates. But whoever elevates himself—among the tyrants (الجبارين) and the arrogant (المتكبرين)—God crushes him and seizes him. For this reason, He said: <<والْعاقِبَةُ لِلْمُتَّقِينَ>> (And the [good] end is for the pious). Meaning, the consequence of the elevation sought by those who desired high-handedness in the earth belongs to the pious (المتقين). That is, God grants them elevation in station (المنزلة) in this world and the Hereafter. As for the Hereafter, it is an inevitable matter, for His promise is true and His word is The Real (حق). The Hereafter is the place where the Levels (المراتب) are distinguished and the measures of creation (مقادير الخلق) and their station with Him are determined. Therefore, the elevation of the pious on the Day of Resurrection is necessary.\n\nAs for this world, whenever someone realizes the truth of his piety (تقواه) and asceticism (زهده), the motives of the souls of the tyrants and the arrogant are directed toward honoring him, because the pious have not competed with them in their stations. What arises in their souls—the honoring of the pious—causes them to descend from their own elevation, and they seek to serve the pious and seek blessing (التبرك) from them. That elevation which the tyrants manifested then transfers to this pious person. Thus, the consequence of elevation belongs to the pious, while the tyrant does not perceive it. The tyrant feels pleasure when it is said of him that he has humbled himself and descended to this pious person, imagining that the pious person is the lower one and that the tyrant has descended to him. Rather, the tyrant's elevation has transferred to the pious person without the tyrant realizing it, and the tyrant has descended beneath the elevation of this pious person. Yet, if the pious person were asked about his elevation, he would find nothing of it with himself.\n\nThus, it is established that elevation in the human being is only achieved through his realization of his servitude (عبوديته), his non-departure [from it], and his avoidance of being described by what is not truly his. Do you not see God's wisdom in His saying: <<لَمَّا طَغَى الْماءُ>> (When the water overflowed/rebelled)? That is, it rose and became elevated. He attributed the elevation to the water, not to The Real (الحق) Himself. When the water rose and became elevated, God carried those He wished to save from the might of the water's rise upon timbers joined together until they formed an Ark (سفينة). Everyone whom God willed to save among the believers entered it. The Ark, with those in it, rose above the water's elevation, and the water became beneath it. The water's rebellion (طغيان) ceased regarding the Ark; it was broken in itself. The reason for this was the attribution of the elevation to the water, even though it was from God and by God's command. But God only attributed the elevation to the water. Had God attributed the water's elevation to Himself, He would have preserved its elevation, and no Ark would have risen above it, nor would anything ever have floated upon the water's surface. This is the ill-omen of the claim [of self-elevation].\n\nTherefore, the falling (سقوط) of the punishment upon the punished one is only its falling from its self-elevation (ارتفاعه في نفسه), because it is an attribute (صفة) belonging to the Kingly aspect of the Name 'The Punisher' (الاسم الله المعذب). This aspect granted it the mark of elevation, because it is an attribute of the One who possesses elevation, which is the Name 'The Punisher.' When the Name 'The Punisher' saw the elevation that arose in the soul of the punishment because of it, He cast it down upon the one being punished by it. Thus, it lost the elevation it boasted of when the punished one was described by it. For this reason, it is said that the punishment is necessary (وجوب) for the punished one.\n\nThe realization of this is that the sound matter is that the King does not punish anyone unless anger (الغضب) arises within him toward the one he wishes to punish, due to an action committed by that person that necessitates the punishment. That action affects the King's soul with anger, by which the King is afflicted (تأذى). The King is majestic (جليل القدر), and it is not fitting for his status, due to the loftiness of his position, to be afflicted by anything. Yet, this person committed an act that angered the King. So, the King casts down the punishment—which he felt within himself, expressed as anger, or which the anger produced in the King's soul—and makes it necessary (أوجبه) upon this person, meaning, he casts it upon him. When the punishment becomes necessary for this person, the King finds relief (راحة) in the punishment of this person.\n\nBut the matter is not exactly so here. Rather, the finding of relief is due to the removal of the affliction (العذاب) that was in the King's soul, which the person's action had caused, thereby afflicting the King. When the King casts it down upon this person, it transfers away from him, and he finds relief in its transference. This is commonly called 'satisfaction' (التشفي), which derives from 'healing' (الشفاء). Healing is the removal of the ailment, not the descent of the ailment that was in the sick person upon another person. This is the realization of healing and relief. Furthermore, the fact that this pain descends upon another person brings pleasure to the King; that is another pleasure, additional to the pleasure of the removal of the affliction.\n\nElevation (العلو) here is a reality (حقيقة) belonging to the Divine Name (الاسم الإلهي). For this reason, the punishment is characterized by falling, which is the necessity (الوجوب). God Almighty said: <<أَ فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ>> (Is he then upon whom the word of punishment has been realized?), meaning, it has become necessary (وجبت) and has fallen (سقطت).\n\nIf you say: \"This is valid concerning creatures, but how can it apply to the High Divine Presence (الجناب العالي), glory be to Him?\" We reply: Since we are incapable of knowing God—and incapacity is fitting for us—it is incumbent upon us, when left to our intellects and realities, to adhere to that [incapacity] and negate such things and others from Him. The power of the intellect dictates this. However, the power of the intellect and clear proof (الدليل الواضح) have established for the intellect the necessity of believing the Messenger (الرسول) sent to us, in his reports about his Lord concerning what proceeds from Him, glory be to Him, in His creation, and concerning what He is, glory be to Him, in Himself, and concerning what He describes Himself with, even if the intellect, relying solely on its own proof without the Lawgiver (الشارع), deems it impossible.\n\nThe prudent, resolute rational person stands humbly, girded for service to the Law (الشرع), accepting everything reported about his Lord, glory be to Him, concerning what He is and what proceeds from Him. Among what The Real (الحق) has reported about Himself is His saying: <<إِنَّ الَّذِينَ يُؤْذُونَ اللهَ>> (Indeed, those who harm Allah). And the Prophet (peace and blessings be upon him) said: \"No one is more patient concerning harm (أذى) than Allah.\"\n\nAnd God Almighty said: \"The son of Adam denied Me, and the son of Adam insulted Me.\"\n\nAnd God Almighty said: <<وغَضِبَ الله عَلَيْهِمْ>> (And the wrath of Allah is upon them). And the Prophets unanimously said that on the Day of Resurrection, God will be angry with an anger He has never been angry with before, and will never be angry with after.\n\nThe rational person submits (سلم) all of this to God, based on His report about Himself, just as he submits that He, glory be to Him, rejoices (يفرح) at the repentance of His servant—and whoever is characterized by joy is also characterized by its opposite. He described Himself as being astonished (يتعجب) by the youth who has no youthful folly. He described Himself as laughing (يضحك) when the one who is punished says on the Day of Resurrection, \"Are You mocking me, though You are the Lord of the Worlds?\" He described Himself as being cheerful (يتبشبش) toward His servant when he comes to the mosque intending prayer. He described Himself as hating disbelief (الكفر) for His servants and being pleased with their gratitude (الشكر) and faith (الايمان).\n\nAll of this is obligatory for every Muslim to believe. The intellect should not ask 'how' or 'why' here. Rather, one submits (يسلم), surrenders (يستسلم), and affirms (يصدق), without asking 'how' (لا يكيف), for <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). Since we see that He described Himself with anger and harm (الأذى), and described punishment with necessity (الوجوب) and falling (السقوط)—which only occurs from elevation (العلو), and elevation is only fitting for God Almighty—we know that the harm (الأذى) with which The Real described Himself is this very thing. The harm rose with the elevation of the one characterized by it, and He cast it down from that elevation upon the one who deserves it, who is the one who harmed God and His Messenger. Thus, the punishment settled upon him in the abode of disgrace and humiliation.\n\nIf you understand what we have established, you will combine faith (الايمان), which is the pure religion (الدِّينُ الْخالِصُ), with the submission (التسليم) that your station requires toward God in everything He reports about Himself. It is not possible to articulate more clearly or eloquently concerning this station, unless The Real Himself reports something clearer in relation and more evident. The utmost reach of the creature concerning this matter, using only his intellect, is what we have established—except for those intellects overtaken by curiosity (الفضول) who interpret (تأولت) these matters. We concede their state to them, but we do not share in that interpretation, for we do not know whether that is God's intended meaning by what He said, so that we might rely upon it, or if it is not His intended meaning, so that we might reject it. Therefore, we adhere to submission (التسليم).\n\nIf we are asked about such matters, we say: \"We believe in what came from God according to God's intention for it, and we believe in what came from the Messenger of God (peace and blessings be upon him) and His Messengers (peace be upon them) according to the intention of His Messenger and His Messengers.\" We entrust the knowledge of all of that to Him, glory be to Him, and to them. It may be that the Messengers, in relation to God concerning this matter, are like us: this report comes to them from God, and they submit it to Him, glory be to Him, just as we submit it, and they do not know its interpretation (تأويله). This is not far-fetched. It may also be that they know its interpretation through God's instruction, in whatever manner. This, too, is not far-fetched. This was the method (طريقة) of the Pious Predecessors (السلف). May God make us their successors through His grace. Blessed is he who watches over his Lord, fears his sin, fills his heart with the remembrance of God, and makes his love purely for God.\n\nI have now informed you of the meaning of the necessity of punishment for the one upon whom it is necessary. More than this cannot be contained in this chapter, for its scope is narrow for the common people (العامة), even though the field is wide for those like us, due to the Gnosis (المعرفة بالله) with which God has favored us. However, the intellects veiled by caprice (الهوى), the pursuit of leadership (الرئاسة), preciousness (النفاسة), and elevation over their peers prevent them from acceptance and submission. We are not Messengers from God that we should undertake the delivery of such knowledge through proclamation. We only mention what we mention of it for the believing, rational people who have occupied themselves with purifying their souls with God and have committed themselves to realizing the humility of servitude (ذلة العبودية) and dependence (الافتقار) upon God in all states. God illuminates their insight, either through Knowledge (العلم) or through Faith and Submission (الإيمان والتسليم) to what has been reported by God, His Books, and His Messengers. That is the greatest providence (العناية الكبرى), the nearest station (المكانة الزلفى), the most excellent path (الطريقة المثلى), and the supreme felicity (السعادة العظمى). May God join us with those who possess this description.\n\nAs for the sciences contained within this station (المنزل), they include the science of The Real (علم الحق), part of which we were discussing in the explanation of the necessity of punishment. It also contains the science of the Divine Name (الاسم الإلهي) through which The Real questions His servants, such as His saying on the Day God gathers the Messengers: <<فَيَقُولُ مَاذَا أُجِبْتُمْ>> (Then He will say: 'What was the response given to you?')—though He is All-Knowing. And His saying: \"How did you leave My servants?\" which He says to the angels who spent the night among us and then ascended to Him. This is a noble science. It also contains the Divine deterrents (الزواجر الإلهية), and whether they are cosmic (كونية) or divine (إلهية); the science of the necessary cause for the destruction of nations when they disbelieve; who among the believers perished with their destruction; and the destruction of the imitators (المقلدة) along with them—all of this in this world. And who escapes this destruction in the Hereafter, and why destruction befell the believers when it befell the disbelievers, encompassing everyone, though the description differed. And whether this is due to 'inclination' (الركون), as He said: <<وَلَا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا>> (And do not incline toward those who do wrong).\n\nAnd the science of the inclination (الركون) that necessitates the touching of the Fire (مس النار) upon them: is it a physical or a spiritual inclination? And His saying concerning the doubling of the punishment for inclination, even if good was intended. God Almighty said: <<لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئًا قَلِيلًا إِذًا لَأَذَقْنَاكَ ضِعْفَ الْحَيَاةِ وَضِعْفَ الْمَمَاتِ>> (You were almost inclining toward them slightly. If you had, We would certainly have made you taste double [punishment] in life and double in death). What is the cause of this doubling, which is more severe than the punishment deserved fundamentally? And what is God's intention in such a verse, the meaning of which is known only through God's instruction? This is a great science contained within this station.\n\nAnd who perishes by himself and who perishes by another; the limit of perishing by another and the limit of perishing by oneself; the duration of its time; and whether the variation in the types of destruction is due to the variation in the states of the perishing ones, or due to the variation in the realities of the Divine Names (الأسماء الإلهية), so that every Divine Name takes its share of the punishment in this station. And what Names cease to exist after their existence, and what remains and does not cease to exist, whether by destruction or otherwise. And the science of the difference between disobeying God, disobeying His Messenger, and disobeying those in authority (أولي الأمر); and what the disobedience of the Messenger and the disobedience of those in authority entails of the disobedience of God. For in disobeying them, there is disobedience to God's command, but in disobeying God, there is no disobedience to them, except specifically in the case of the Messenger. For in disobeying God, there is disobedience to the Messenger of God, since the object of disobedience is the Divine Command and Prohibition, which is known only through the Messenger's conveyance and upon his tongue. For God conveys His command only through the Messengers of God, and no human other than the Messengers holds this station.\n\nDespite this, God has a command in which He is disobeyed, and the Messenger has a command in which he is disobeyed, and there is a command that combines the disobedience of God and His Messenger. Every command related to the Divine Presence (جناب الله) in which no creature has involvement is disobedience to God. Every command related to the presence of the creature who is the Messenger of God is disobedience to the Messenger. And every command that involves both aspects is disobedience to God and His Messenger. God Almighty said: <<وَمَنْ يَعْصِ اللهَ وَرَسُولَهُ>> (And whoever disobeys Allah and His Messenger). And He mentioned the disobedience of the Messenger separately. And He said: <<وَمَنْ يُشْرِكْ بِاللَّهِ فَقَدْ ضَلَّ>> (And whoever associates partners with Allah has certainly gone astray), mentioning Himself separately. And the science of who deserves majesty (العظمة) and the attribute that seeks it; the science of remembrance (التذكير); the science of hearing from The Real (السماع من الحق); the science of the King (الملك) and the King of the King (ملك الملك); the science of the King of Might (ملك العزة); the science of the Bearing King (الملك الحامل); the science of the Borne King (الملك المحمول); the science of the King of the Dust (ملك الهباء); the science of the Greatest Terror (الهول الأعظم); and the science of the Treasure beneath the Throne (الكنز الذي تحت العرش).\n\nThe Prophet (peace and blessings be upon him) said: \"Indeed, there is no might nor power except with Allah (لا حول ولا قوة إلا بالله) came forth from a treasure beneath the Throne.\"\n\nAnd what is the Treasure, and what remembrance (الذكر) is contained within the stored treasure besides 'There is no might nor power except with Allah'? And the science of Divine and Cosmic Power (القوة الإلهية والكونية); and the science of joining meanings together in the Presence of the Words (حضرة الكلمات); and whether they have conjunction in themselves, abstracted from the materials of the Words, or if they have no conjunction in themselves. And if they have no conjunction, is that because the matter is inherently impossible and does not accept conjunction, or is it by God's Will? And the difference between the writing of the creature and the writing of the Creator. This is a marvelous science that we have seen and witnessed.\n\nThe Prophet (peace and blessings be upon him) came out holding two folded books in his hands, grasping a book in each hand. He asked his Companions, \"Do you know what these two books are?\" He then informed them that the book in his right hand contained the names of the people of Paradise, and the names of their fathers, tribes, and clans, from the first person God created until the Day of Resurrection. And the other book, in the other hand, contained the names of the people of the Fire, and the names of their fathers, tribes, and clans, until the Day of Resurrection. If a creature were to take up the task of writing these names as they are in those two books, all the paper in the world would not suffice.\n\nFrom this, one knows the writing of God from the writing of creatures. It is related that one of the simple-minded (البله) pilgrims met a man while performing the Farewell Circumambulation (طواف الوداع). That man joked with the simpleton, asking, \"Did you receive your writ of immunity (براءة) from the Fire from God?\" The simpleton said, \"No. Did the people receive that?\" The man said, \"Yes.\" The simpleton wept and entered the Hijr, clinging to the curtains of the Kaaba, weeping and asking God to give him his writ of freedom from the Fire. The people and his companions began to blame him, informing him that the man had only joked with him, but he did not believe them and remained persistent in his state. While he was thus, a piece of paper fell upon him from the air, from the direction of the water spout (الميزاب), upon which was written his freedom from the Fire. He rejoiced in it and showed it to the people. A sign of that writing was that it could be read equally from every direction; whenever the paper was turned over, the writing inverted with the turning. Thus, the people knew it was from God.\n\nAs for our time, it happened to a woman that she saw in a dream that the Resurrection had begun, and God gave her a leaf from a tree upon which was written her freedom from the Fire. She held it in her hand. It happened that she woke up from her sleep, and her hand was clenched upon the leaf, and she could not open her hand, yet she felt the leaf in her palm. Her grip tightened so much that it caused her pain. People gathered around her, hoping to open her hand, but no one, even the strongest men, could open it. They asked the people of our Path (أهل طريقنا) about it, but none of them knew the secret. As for the scholars of external law (علماء الرسم من الفقهاء), they had no knowledge of it. The doctors attributed it to a strong humor (خلط قوى) that had settled in that limb, causing the effect. Some people said, \"If we ask so-and-so\"—meaning me—\"perhaps we will find knowledge of this with him.\" So they brought the woman to me. She was an old woman, and her hand was clenched painfully. I asked her about her dream, and she told me what she had told the others. I understood the reason necessitating the clenching of her hand upon it. I approached her ear and whispered to her, saying: \"Bring your hand close to your mouth and intend with God that you will swallow that leaf which you feel in your palm. If you intend that, and God knows your sincerity, your hand will open.\" The woman brought her hand close to her mouth, pressed it against it, opened her mouth, and intended with God to swallow the leaf. Her hand opened, the leaf was in her mouth, and she swallowed it, and her hand was released. The attendees were astonished by this.\n\nThey asked me about the knowledge behind this. I told them that Malik ibn Anas, the Imam of the Abode of Migration (Medina), was thirteen years old when this happened in his time. He was studying jurisprudence (الفقه) under his shaykhs, and he was sharp and intelligent. It happened then that a woman was washing a deceased woman. When she reached her private parts, she struck the deceased woman's private parts with her hand and said, \"O private parts, how adulterous you were!\" Her hand stuck to the private parts and fused with them. No one could remove her hand. The jurists of Medina were asked for a ruling. Some said her hand should be cut off, and others said a portion of the deceased woman's body, corresponding to where the hand was stuck, should be cut off. The dispute among the jurists was prolonged: which sanctity is more obligatory upon us—the sanctity of the deceased, so we cut nothing from her, or the sanctity of the living, so we do not cut her hand? Malik said to them, \"I believe the ruling is that the washerwoman should be lashed the prescribed punishment for slander (حد الفرية). If she has slandered, her hand will be released.\" The washerwoman was lashed the prescribed punishment for slander, and her hand was released. The jurists were astonished by this and regarded Malik with reverence from that time onward, joining him with the shaykhs, just as Umar ibn al-Khattab used to join Abdullah ibn Abbas with the people of Badr in reverence due to the greatness of his stature in knowledge.\n\nWhen I knew, by what God cast into my soul, that God was jealous over that leaf, lest any of His creation see it, and that it was a secret God had singled out for that woman, I told her what I told her. Her hand opened, and she swallowed the leaf.\n\nThis station also encompasses the science of Paradise (الجنان) and the Fire (النار); the science of the stations of the Resurrection (مواقف القيامة); the science of the states of the Hereafter (الأحوال الأخروية); the science of the Divine Laws (الشرائع); and the science of the necessary cause for which the Messengers knew their measures, despite the loftiness of their station with God; and the difference between their station with God and their station with the believing people; and by what Eye The Real looks upon them, and by what Name He addresses them; and the science of Transcendence (التنزيه), Sanctification (التقديس), and Majesty (العظمة); and the Presence of Lordship (حضرة الربوبية) among the Presences of the remaining restricted Names. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تین سو پندرہ: حضرۃ محمدیہ (الحضرۃ المحمدیۃ) سے وجوب العذاب (عذاب کا لازم ہونا) کے مقام کی معرفت میں\n\nجب ہماری حقیقتیں (حقائقنا) ثابت ہو جاتی ہیں تو ہم متحد ہو جاتے ہیں،\nلیکن اس مقام تک پہنچنے کا کوئی راستہ نہیں،\nہر لحاظ سے، نزول کے ساتھ استواء (برابری) کی وجہ سے۔\nاور کیسے صحیح ہو سکتا ہے کہ کوئی اس کی طرف عروج کرے؟\nاور جلیل (عظیم ذات) کی چمک خلیل (حضرت ابراہیم) سے کہاں؟\nمیں نے اس کے حبیب (صلی اللہ علیہ وسلم) کو دیکھا، اس نے ان پر درود بھیجا،\nجیسا کہ اس نے خود خلیل پر درود بھیجا تھا۔\nپس ان میں عین الجمع (جمع کا نقطہ) ہی عین الفرق (فرق کا نقطہ) ہے،\nاسی طرح رسول (صلی اللہ علیہ وسلم) سے حدیث آئی ہے۔\nجب علم کے سورج غروب ہوتے ہیں تو وہ عقلیں بھٹک جاتی ہیں، جن کا حصہ صرف دلیل کا علم ہے۔\nاگر غیب کا مشاہدہ آنکھیں کرتیں، تو ان کا طلوع ہی ان کا غروب ہوتا۔\n\n[یہ کہ وجوب العذاب (عذاب کا لازم ہونا) معذَّب (جسے عذاب دیا جا رہا ہے) پر اس کا واقع ہونا ہے]\n\nاے میرے قریبی ولی (الولی الحمیم)! جان لو کہ وجوب العذاب (وجوب العذاب) معذَّب (جسے عذاب دیا جا رہا ہے) پر اس کا واقع ہونا ہے۔ کہا جاتا ہے: \"دیوار وجب (وجب) ہو گئی\" جب وہ گر گئی۔ اور گرنا صرف اسی سے ہوتا ہے جسے ذاتی بلندی (علو ذاتی) حاصل نہ ہو اور جو اپنی ذات کی وجہ سے بلندی کا مستحق نہ ہو۔ پس جب اس صفت والا بلند ہوا تو اس کے پاس کوئی ایسی حقیقت (حقیقۃ) نہ تھی جو اس کی بلندی کو تھامے رکھتی، لہٰذا وہ گر گیا۔ (قرآن: القصص ۲۸:۸۳) تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُها لِلَّذِينَ لا يُرِيدُونَ عُلُوًّا في الْأَرْضِ (یہ آخرت کا گھر ہم ان لوگوں کے لیے بناتے ہیں جو زمین میں بلندی نہیں چاہتے)۔ اور نفسانی صفات ان کے موصوف کے لیے مراد نہیں ہوتیں۔ پس جو شخص کسی دوسرے کے ذریعے بلند ہوا اور اس کے پاس کوئی محافظ نہ ہو جو اس کی بلندی کو محفوظ رکھے، وہ گر جاتا ہے اور اس سے جنگ کی جاتی ہے۔ پس بلند وہ ہے جس کے مرتبے کو اللہ نے بلند کیا، جیسا کہ فرمایا: (قرآن: مریم ۱۹:۵۷) ورَفَعْناهُ مَكاناً عَلِيًّا (اور ہم نے اسے بلند مقام پر اٹھا لیا)۔ چونکہ یہ رفعت اللہ کی طرف سے تھی، جو ذاتی بلندی (العلو الذاتی) کا مالک ہے، اس لیے اللہ نے ہر اس شخص کی بلندی کو محفوظ رکھا جس کے مرتبے کو اللہ نے بلند کیا۔ اور جو شخص اپنی ذات سے بلند ہوا، جیسے جبار اور متکبر، اللہ نے اسے توڑ دیا اور پکڑ لیا۔ اسی لیے فرمایا: (قرآن: القصص ۲۸:۸۳) والْعاقِبَةُ لِلْمُتَّقِينَ (اور انجام متقیوں کے لیے ہے)۔ یعنی اس بلندی کا انجام جس کے ذریعے وہ شخص بلند ہوا جس نے زمین میں بلندی چاہی، وہ متقیوں کے لیے ہو گا، یعنی اللہ انہیں دنیا اور آخرت میں مرتبے کی بلندی عطا کرے گا۔ آخرت میں تو یہ ایک لازمی امر ہے، جس کا ہونا ضروری ہے، کیونکہ اس کا وعدہ سچا ہے اور اس کا کلام حق ہے۔ اور دارِ آخرت مراتب کے امتیاز اور اللہ کے ہاں مخلوق کے مقام اور اس سے ان کے مرتبے کے تعین کی جگہ ہے۔ لہٰذا قیامت کے دن متقیوں کی بلندی لازمی ہے۔ جہاں تک دنیا کا تعلق ہے، تو جو شخص بھی اپنے تقویٰ اور زہد میں اپنی سچائی کو ثابت کرتا ہے، جباروں اور متکبروں کے نفوس اس کی تعظیم کی طرف مائل ہوتے ہیں، کیونکہ انہوں نے ان کے مراتب میں مداخلت نہیں کی۔ پس متقیوں کی تعظیم کا جو جذبہ ان کے نفوس میں پیدا ہوا، اس نے انہیں ان کی بلندی سے نیچے اتار دیا اور انہوں نے ان کی خدمت اور ان سے برکت حاصل کرنے کا ارادہ کیا۔ اور وہ بلندی جس کے ساتھ وہ ظاہر ہوئے تھے، اس متقی کی طرف منتقل ہو گئی، اور بلندی کا انجام متقی کے لیے ہو گیا۔ اور جبار کو اس کا احساس بھی نہیں ہوتا، بلکہ جبار اس بات سے لذت محسوس کرتا ہے جب کہا جاتا ہے کہ اس نے تواضع اختیار کی اور اس متقی کے پاس نیچے آیا۔ پس جبار یہ خیال کرتا ہے کہ متقی نیچے ہے اور جبار اس کے پاس نیچے آیا ہے، حالانکہ جبار کی بلندی اس متقی کی طرف منتقل ہو گئی، جہاں سے اسے احساس بھی نہیں ہوا، اور جبار اس متقی کی بلندی کے نیچے آ گیا۔ اور اگر اس متقی سے اس کی بلندی کے بارے میں پوچھا جائے تو اسے اپنے پاس اس میں سے کچھ نہیں ملے گا۔ پس یہ ثابت ہوا کہ انسان میں بلندی صرف اس کی اپنی بندگی (عبودیت) کے ساتھ متحقق ہونے اور اس سے باہر نہ نکلنے اور ایسی صفات سے متصف نہ ہونے میں ہے جو اس کی حقیقت (حقیقۃ) نہیں ہیں۔ کیا تم اللہ تعالیٰ کی حکمت کو نہیں دیکھتے جب اس نے فرمایا: (قرآن: الحاقۃ ۶۹:۱۱) لَمَّا طَغَى الْماءُ (جب پانی نے طغیانی کی) یعنی بلند ہوا اور اوپر اٹھا۔ اور اس نے بلندی کو پانی کی طرف منسوب کیا اور حق (الحق) نے اسے اپنی طرف منسوب نہیں کیا۔ پس جب پانی بلند ہوا اور اوپر اٹھا، تو اللہ نے ان لوگوں کو بچایا جن کی نجات وہ پانی کے ارتفاع کی سختی سے چاہتا تھا، لکڑیوں میں، جنہیں ایک دوسرے سے جوڑ کر کشتی بنائی گئی تھی۔ پس ہر وہ شخص جس کی نجات اللہ نے چاہی، اس میں داخل ہو گیا، اور کشتی اپنے اندر موجود لوگوں کے ساتھ پانی کی بلندی پر بلند ہو گئی اور پانی اس کے نیچے ہو گیا، اور کشتی کے حق میں پانی کی طغیانی زائل ہو گئی، اور وہ اپنے آپ میں ٹوٹ گئی۔ اور اس کا سبب بلندی کو اس کی طرف منسوب کرنا تھا، اگرچہ وہ اللہ کی طرف سے اور اللہ کے حکم سے تھا۔ لیکن اللہ نے بلندی کو صرف پانی کی طرف منسوب کیا، پس اگر اللہ پانی کی بلندی کو اپنی طرف منسوب کرتا تو وہ اس کی بلندی کو محفوظ رکھتا، اور پھر کوئی کشتی اس پر بلند نہ ہوتی اور نہ ہی کوئی چیز کبھی پانی کی سطح پر تیرتی۔ پس یہ دعوے کی نحوست ہے۔\n\nپس معذَّب پر عذاب کا گرنا (سقوط العذاب) صرف اس کے اپنے نفس میں بلند ہونے کی وجہ سے ہوا، کیونکہ یہ اسم اللہ المعذِّب (عذاب دینے والے) کی ایک ملکی صفت (صفۃ ملکیۃ) ہے۔ پس اس صفت نے اسے بلندی کی علامت دی، کیونکہ یہ اس ذات کی صفت ہے جسے بلندی حاصل ہے، اور وہ اسم المعذِّب (عذاب دینے والا) ہے۔ پس جب اسم المعذِّب نے دیکھا کہ عذاب کے نفس میں اس کی وجہ سے بلندی پیدا ہو گئی ہے، تو اس نے اسے اس شخص پر گرا دیا جسے عذاب دیا جا رہا ہے، پس وہ اس بلندی سے زائل ہو گیا جس پر وہ فخر کر رہا تھا جب معذَّب اس سے متصف تھا۔ اسی لیے کہا جاتا ہے کہ معذَّب پر عذاب کا واجب ہونا (وجوب العذاب) ہے۔ اور اس کی تحقیق یہ ہے کہ صحیح امر یہ ہے کہ بادشاہ کسی کو عذاب نہیں دیتا مگر یہ کہ اس شخص پر غضب (الغضب) قائم ہو جائے جسے وہ عذاب دینا چاہتا ہے، کسی ایسے فعل کی وجہ سے جو اس سے سرزد ہوا ہو اور وہ عذاب کا مستوجب ہو۔ پس اس فعل نے بادشاہ کے نفس میں غضب کا اثر ڈالا، جس سے بادشاہ کو تکلیف پہنچی۔ اور بادشاہ جلیل القدر ہوتا ہے، اس کے مرتبے کی بلندی کے لحاظ سے یہ مناسب نہیں کہ اسے کسی چیز سے تکلیف پہنچے۔ اور اس شخص نے ایک ایسا کام کیا جس نے بادشاہ کو غضبناک کر دیا۔ پس بادشاہ نے اس عذاب کو جو وہ اپنے نفس میں محسوس کر رہا تھا، جسے غضب سے تعبیر کیا جاتا ہے، یا جس نے بادشاہ کے نفس میں غضب پیدا کیا، اس شخص پر واجب کر دیا، یعنی اسے اس پر گرا دیا۔ پس جب عذاب اس شخص پر واجب ہو گیا، تو بادشاہ نے اس شخص کو عذاب دے کر راحت محسوس کی۔ لیکن یہاں معاملہ ایسا نہیں ہے۔ بلکہ راحت کا وجود اس عذاب کے زائل ہونے سے ہے جو بادشاہ کے نفس میں تھا، جسے اس شخص کے فعل نے پیدا کیا تھا، اور بادشاہ کو اس سے تکلیف پہنچی تھی۔ پس جب اس نے اسے اس شخص پر نازل کیا تو وہ اس سے منتقل ہو گیا، اور اس کے منتقل ہونے سے راحت محسوس ہوئی۔ اور عام لوگوں میں اسے تشفی (دل کا ٹھنڈا ہونا) کہا جاتا ہے، اور یہ شفاء (شفا) سے ہے۔ اور شفاء بیماری کا زائل ہونا ہے، نہ کہ بیمار میں موجود بیماری کا کسی دوسرے شخص پر نازل ہونا۔ یہ شفاء اور راحت کی تحقیق ہے۔ پھر یہ کہ وہ تکلیف کسی دوسرے شخص پر نازل ہوئی، اس لیے اس میں لذت ہے، تو یہ ایک دوسری لذت ہے جو عذاب کے زائل ہونے کی لذت سے زیادہ ہے۔ اور یہاں بلندی (العلو) اسم الٰہی (الاسم الإلہی) کی حقیقت (حقیقۃ) ہے، اسی لیے عذاب کو گرنے (السقوط) سے متصف کیا گیا، اور یہی وجوب (الوجوب) ہے۔ اللہ تعالیٰ نے فرمایا: (قرآن: الزمر ۳۹:۱۹) أَ فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ (تو کیا وہ شخص جس پر عذاب کا فیصلہ ثابت ہو چکا ہے) یعنی واجب ہو گیا اور گر گیا۔ اگر تم کہو کہ یہ مخلوق کے حق میں تو صحیح ہے، لیکن جناب عالی (الجناب العالی) سبحانہ و تعالیٰ کے حق میں یہ کیسے ہو سکتا ہے؟ ہم کہیں گے: چونکہ ہم اللہ کی معرفت (المعرفۃ) سے عاجز ہیں، اور ہمیں عاجز ہونا ہی چاہیے، لہٰذا جب ہم اپنی عقلوں اور اپنی حقیقتوں (حقائقنا) کے ساتھ چھوڑ دیے جائیں، تو ہمیں چاہیے کہ ہم اس بات کو لازم پکڑیں اور اس سے اس طرح کی چیزوں کی نفی کریں۔ کیونکہ عقل کی قوت اس بات کا تقاضا کرتی ہے، مگر عقل کی قوت اور واضح دلیل نے عقل پر یہ بات قائم کر دی ہے کہ وہ اس رسول کی تصدیق کرے جسے اللہ نے ہماری طرف بھیجا ہے، اس کی خبروں میں جو وہ اپنے رب کی طرف سے دیتا ہے، ان چیزوں کے بارے میں جو اس کی مخلوق میں اس کی طرف سے ہوتی ہیں، اور ان چیزوں کے بارے میں جو وہ سبحانہ و تعالیٰ اپنے نفس کے بارے میں بیان کرتا ہے، اور ان صفات کے بارے میں جن سے وہ اپنے آپ کو متصف کرتا ہے، جنہیں عقل اگر شارع کے بغیر صرف اپنی دلیل پر انحصار کرے تو محال قرار دیتی ہے۔ پس عقلمند اور محتاط شخص شرع کی خدمت میں ذلیل اور کمر بستہ ہو کر کھڑا ہوتا ہے، اور ہر اس چیز کو قبول کرتا ہے جس کی خبر وہ اپنے رب سبحانہ و تعالیٰ کی طرف سے دیتا ہے، جو اس پر ہو اور اس کی طرف سے ہو۔\n\nاور ان چیزوں میں سے جن کی خبر حق (الحق) نے اپنے بارے میں دی ہے، یہ ہے کہ اس نے فرمایا: (قرآن: الاحزاب ۳۳:۵۷) إِنَّ الَّذِينَ يُؤْذُونَ الله (بے شک وہ لوگ جو اللہ کو اذیت دیتے ہیں)۔ اور نبی صلی اللہ علیہ وسلم نے فرمایا: (حدیث) لَا أَحَدَ أَصْبَرُ عَلَى أَذًى مِنَ اللَّهِ (اللہ سے زیادہ اذیت پر صبر کرنے والا کوئی نہیں)۔ اور اللہ تعالیٰ نے فرمایا: (حدیث قدسی) كَذَّبَنِي ابْنُ آدَمَ وَشَتَمَنِي ابْنُ آدَمَ (ابن آدم نے مجھے جھٹلایا اور ابن آدم نے مجھے گالی دی)۔ اور اللہ تعالیٰ نے فرمایا: (قرآن: الفتح ۴۸:۶) وغَضِبَ الله عَلَيْهِمْ (اور اللہ ان پر غضبناک ہوا)۔ اور تمام انبیاء نے کہا کہ اللہ قیامت کے دن ایسا غضب (الغضب) کرے گا جیسا اس نے اس سے پہلے کبھی نہیں کیا اور نہ اس کے بعد کبھی کرے گا۔ عقلمند شخص یہ سب کچھ اللہ کے حوالے کر دیتا ہے، اس کی خبر میں جو وہ اپنے نفس کے بارے میں دیتا ہے، جیسا کہ اس نے اس بات کو تسلیم کیا کہ وہ اپنے بندے کی توبہ پر خوش ہوتا ہے، اور جو شخص خوشی (فرح) سے متصف ہو، وہ اس کی ضد سے بھی متصف ہوتا ہے۔ اور اس نے اپنے آپ کو اس صفت سے متصف کیا کہ وہ اس نوجوان پر تعجب کرتا ہے جس میں کوئی جوانی کی غلطی نہ ہو۔ اور اس نے اپنے آپ کو اس صفت سے متصف کیا کہ وہ ہنستا ہے جب قیامت کے دن ہناد کہے گا: کیا تو مجھ سے مذاق کر رہا ہے حالانکہ تو رب العالمین ہے؟ اور اس نے اپنے آپ کو اس صفت سے متصف کیا کہ وہ اپنے بندے سے خوش ہوتا ہے جب وہ نماز کے ارادے سے مسجد آتا ہے۔ اور اس نے اپنے آپ کو اس صفت سے متصف کیا کہ وہ اپنے بندوں کے لیے کفر کو ناپسند کرتا ہے اور ان کے لیے شکر اور ایمان کو پسند کرتا ہے۔ پس یہ سب کچھ ہر مسلمان پر واجب ہے کہ وہ اس پر ایمان لائے، اور عقل یہاں یہ نہیں کہے گی کہ 'کیسے' اور 'ایسا کیوں ہوا'، بلکہ وہ تسلیم کرے گا، سر تسلیم خم کرے گا، اور تصدیق کرے گا، اور کیفیت بیان نہیں کرے گا، کیونکہ لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں)۔ پس جب ہم نے دیکھا کہ اس نے اپنے آپ کو غضب (الغضب) اور اذیت (الأذى) سے متصف کیا، اور عذاب کو وجوب (الوجوب) اور سقوط (گرنے) سے متصف کیا، اور سقوط صرف بلندی (العلو) سے ہوتا ہے، اور بلندی صرف اللہ تعالیٰ کے لیے ہی مناسب ہے، تو ہم نے جان لیا کہ وہ اذیت جس سے حق (الحق) نے اپنے آپ کو متصف کیا ہے، وہ یہی ہے۔ پس اذیت اس شخص کی بلندی کے ساتھ بلند ہوئی جو اس سے متصف ہوا، اور اس نے اسے اس بلندی سے اس شخص پر گرا دیا جو اس کا مستحق ہے، اور وہ وہی ہے جس نے اللہ اور اس کے رسول کو اذیت دی، پس عذاب ذلت اور رسوائی کے گھر میں اس پر نازل ہوا۔\n\nاگر تم نے وہ جان لیا جو ہم نے بیان کیا ہے، تو تم نے ایمان (جو کہ الدِّينُ الْخالِصُ ہے) اور اس بات کے درمیان جمع کر دیا جو تمہارا مرتبہ اللہ کے حوالے کرنے کا مستحق ہے، ہر اس چیز میں جس کی خبر وہ اپنے نفس کے بارے میں دیتا ہے۔ اور اس مقام کی وضاحت میں اس سے زیادہ اور بلیغ انداز میں بات کرنا ممکن نہیں، مگر یہ کہ حق (الحق) کسی ایسی چیز کی خبر دے جو نسبت میں زیادہ واضح اور روشن ہو۔ اور مخلوق کی اس معاملے میں اپنی عقل کے ذریعے زیادہ سے زیادہ رسائی وہی ہے جو ہم نے بیان کی ہے، سوائے ان عقلوں کے جنہیں فضول باتوں نے آ لیا، اور انہوں نے ان امور کی تاویل (التأویل) کی۔ پس ہم ان کے حال کو تسلیم کرتے ہیں، لیکن ہم اس تاویل میں ان کے شریک نہیں ہوتے، کیونکہ ہم نہیں جانتے کہ کیا اللہ نے اپنے اس قول سے یہی مراد لیا ہے کہ ہم اس پر بھروسہ کریں، یا یہ اس کی مراد نہیں ہے کہ ہم اسے رد کر دیں۔ اسی لیے ہم نے تسلیم (التسلیم) کو لازم پکڑا ہے۔ پس جب ہم سے اس طرح کے بارے میں پوچھا جاتا ہے، تو ہم کہتے ہیں کہ ہم اس پر ایمان رکھتے ہیں جو اللہ کی طرف سے آیا، اللہ کی مراد کے مطابق، اور ہم اس پر ایمان رکھتے ہیں جو رسول اللہ صلی اللہ علیہ وسلم اور ان کے رسولوں علیہم السلام کی طرف سے آیا، رسول اللہ صلی اللہ علیہ وسلم اور ان کے رسولوں علیہم السلام کی مراد کے مطابق، اور ہم ان سب میں علم کو اللہ سبحانہ و تعالیٰ اور ان کے حوالے کرتے ہیں۔ اور ہو سکتا ہے کہ رسول اس معاملے میں اللہ کے مقابلے میں ہماری طرح ہوں، کہ یہ خبر اللہ کی طرف سے ان پر وارد ہو، اور وہ اسے اللہ سبحانہ و تعالیٰ کے حوالے کر دیں جیسا کہ ہم نے کیا، اور اس کی تاویل (التأویل) نہ جانتے ہوں۔ یہ بعید نہیں ہے۔ اور یہ بھی ہو سکتا ہے کہ وہ اللہ کے بتانے سے اس کی تاویل جانتے ہوں، کسی بھی طریقے سے۔ یہ بھی بعید نہیں ہے۔ اور یہی سلف کا طریقہ تھا، اللہ ہمیں اپنے فضل سے ان کا جانشین بنائے۔ پس خوشخبری ہے اس شخص کے لیے جس نے اپنے رب کی نگرانی کی، اپنے گناہ سے ڈرا، اور اللہ کے ذکر سے اپنے دل کو آباد کیا، اور اللہ کے لیے اپنی محبت کو خالص کیا۔ پس میں نے تمہیں اس شخص پر وجوب العذاب (وجوب العذاب) کے معنی سے آگاہ کر دیا جس پر وہ واجب ہوا۔ اور اس سے زیادہ اس باب میں گنجائش نہیں ہے، کیونکہ عام لوگوں میں اس کا میدان تنگ ہے، اگرچہ ہمارے جیسے لوگوں کے نزدیک اس کا میدان وسیع ہے، اس معرفت (المعرفۃ) کی وجہ سے جو اللہ نے ہمیں عطا کی ہے۔ لیکن وہ عقلیں جو خواہشات، سرداری کی طلب، نفیس ہونے کی طلب، اور ہم جنسوں پر بلندی کی طلب سے پردہ میں ہیں، یہ چیزیں انہیں قبول کرنے اور سر تسلیم خم کرنے سے روکتی ہیں۔ اور ہم اللہ کی طرف سے رسول نہیں ہیں کہ ہم اس طرح کے علوم کو تبلیغ کے ذریعے پہنچانے کی تکلیف اٹھائیں۔ اور ہم ان میں سے جو کچھ بھی ذکر کرتے ہیں، وہ صرف ان عقلمند مومنوں کے لیے ہے جنہوں نے اللہ کے ساتھ اپنے نفوس کی تصفیہ میں مشغولیت اختیار کی، اور ہر حال میں اپنے نفوس کو بندگی (العبودیۃ) کی ذلت اور اللہ کی محتاجی (الافتقار) کے ساتھ متحقق ہونے پر لازم کیا۔ پس اللہ نے ان کی بصیرت کو منور کر دیا، یا تو علم کے ذریعے، یا ایمان اور اس خبر کو تسلیم کرنے کے ذریعے جو اللہ، اس کی کتابوں اور اس کے رسولوں کی طرف سے آئی۔ پس یہی سب سے بڑی عنایت، قربت کا مقام (المکانۃ الزلفی)، بہترین طریقہ (الطریقۃ المثلی)، اور سب سے بڑی سعادت ہے۔ اللہ ہمیں ان لوگوں میں شامل کرے جن کی یہ صفت ہے۔ جہاں تک ان علوم کا تعلق ہے جو یہ مقام اپنے اندر رکھتا ہے، تو یہ علم الحق (ذات حق کا علم) کو شامل کرتا ہے، اور اسی میں وہ بھی شامل ہے جس کے بارے میں ہم وجوب العذاب (وجوب العذاب) کی شرح میں تھے۔ اور اس میں اسم الٰہی (الاسم الإلہی) کا علم بھی ہے جس سے حق (الحق) اپنے بندوں سے سوال کرتا ہے، جیسے اس کا قول: (قرآن: المائدۃ ۵:۱۰۹) يَوْمَ يَجْمَعُ الله الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ (جس دن اللہ رسولوں کو جمع کرے گا، پھر فرمائے گا کہ تمہیں کیا جواب دیا گیا؟) حالانکہ وہ زیادہ جانتا ہے۔ اور جیسے اس کا قول: \"تم نے میرے بندوں کو کیسے چھوڑا؟\" جو وہ فرشتوں سے کہے گا جو ہمارے درمیان رات گزار کر اس کی طرف عروج کر گئے تھے۔ اور یہ ایک شریف علم ہے۔ اور اس میں زواجر الٰہیہ (اللہ کی طرف سے ڈرانے والی چیزیں) کا علم ہے، اور آیا وہ کونی ہیں یا الٰہی۔ اور امتوں کی ہلاکت کا سبب بننے والے امر کا علم جب انہوں نے کفر کیا، اور ان کی ہلاکت کے ساتھ مومنوں میں سے کون ہلاک ہوا، اور ان کے ساتھ مقلدین کی ہلاکت، یہ سب دنیا میں۔ اور آخرت میں اس ہلاکت سے کون نکلے گا، اور مومنوں پر ہلاکت کیوں واقع ہوئی جب کافروں پر واقع ہوئی، اور سب کو شامل کر لیا، حالانکہ صفت مختلف تھی۔ اور کیا یہ رُکون (جھکاؤ) کی وجہ سے تھا، جیسا کہ فرمایا: (قرآن: ہود ۱۱:۱۱۳) ولا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا (اور ظالموں کی طرف نہ جھکنا)۔ اور رُکون کا علم جو انہیں آگ کے چھونے کا سبب بنتا ہے، کیا وہ حسی رُکون ہے یا معنوی؟ اور اس کا قول کہ رُکون پر عذاب کو دوگنا کر دیا جائے گا، اگرچہ اس کا ارادہ خیر کا ہو، اللہ تعالیٰ نے فرمایا: (قرآن: الإسراء ۱۷:۷۴-۷۵) لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا إِذاً لَأَذَقْناكَ ضِعْفَ الْحَياةِ وضِعْفَ الْمَماتِ (یقیناً قریب تھا کہ آپ ان کی طرف تھوڑا سا جھک جاتے، تب تو ہم آپ کو زندگی کا دوہرا اور موت کا دوہرا عذاب چکھاتے)۔ اس دوگنے عذاب کا سبب کیا ہے جو اصل میں مستحق عذاب سے بھی زیادہ سخت ہے؟ اور اللہ کی مراد اس طرح کی آیت میں کیا ہے، جسے اللہ کے بتائے بغیر کوئی نہیں جان سکتا؟ اور یہ ایک عظیم علم ہے جو یہ مقام اپنے اندر رکھتا ہے۔ اور اس کا علم کہ کس نے اپنے نفس کی وجہ سے ہلاک کیا اور کس نے دوسرے کی وجہ سے ہلاک کیا، اور دوسرے کی وجہ سے ہلاکت کی حد کیا ہے، اور نفس کی وجہ سے ہلاکت کی حد کیا ہے، اور اس کا وقت کتنا ہے؟ اور کیا ہلاکت اپنی مختلف انواع میں ہلاک ہونے والوں کے حالات کے اختلاف کی وجہ سے ہے، یا اسماء الٰہیہ (الأسماء الإلہیۃ) کی حقیقتوں کے اختلاف کی وجہ سے، تاکہ ہر اسم الٰہی اس مقام سے عذاب کا اپنا حصہ لے؟ اور وہ اسماء جو وجود میں آنے کے بعد معدوم ہو جاتے ہیں، اور وہ جو باقی رہتے ہیں اور ہلاکت یا کسی اور چیز سے معدوم نہیں ہوتے۔ اور اس کا علم کہ جس نے اللہ کی نافرمانی کی، اور جس نے اس کے رسول کی نافرمانی کی، اور جس نے اولی الامر کی نافرمانی کی، ان کے درمیان کیا فرق ہے؟ اور رسول کی نافرمانی اور اولی الامر کی نافرمانی میں اللہ کی نافرمانی کیا شامل ہے؟ کیونکہ ان کی نافرمانی میں اللہ کے حکم کی نافرمانی شامل ہے، لیکن اللہ کی نافرمانی میں ان کی نافرمانی شامل نہیں ہے، سوائے رسول کے خاص طور پر، کیونکہ اللہ کی نافرمانی میں رسول اللہ کی نافرمانی شامل ہے، کیونکہ نافرمانی کا تعلق حکم الٰہی اور نہی سے ہے، اور یہ صرف رسول کی تبلیغ اور ان کی زبان سے ہی معلوم ہوتا ہے، کیونکہ اللہ اپنا حکم صرف اللہ کے رسولوں کے ذریعے ہی پہنچاتا ہے، اور انسانوں میں رسولوں کے علاوہ کسی کو یہ مقام حاصل نہیں ہے۔ اس کے باوجود، اللہ کا ایک حکم ہے جس میں اس کی نافرمانی کی جاتی ہے، اور رسول کا ایک حکم ہے جس میں ان کی نافرمانی کی جاتی ہے، اور پھر ایک حکم ایسا ہے جس میں اللہ اور اس کے رسول دونوں کی نافرمانی جمع ہو جاتی ہے۔ پس ہر وہ حکم جو جنابِ الٰہی سے متعلق ہو اور اس میں مخلوق کا کوئی دخل نہ ہو، وہ اللہ کی نافرمانی ہے۔ اور ہر وہ حکم جو مخلوق کے جناب سے متعلق ہو جو رسول اللہ ہیں، وہ رسول کی نافرمانی ہے۔ اور ہر وہ حکم جو دونوں پہلوؤں کو شامل ہو، وہ اللہ اور اس کے رسول کی نافرمانی ہے۔ اللہ تعالیٰ نے فرمایا: (قرآن: النساء ۴:۱۴) ومن يَعْصِ الله ورَسُولَهُ (اور جو اللہ اور اس کے رسول کی نافرمانی کرے)۔ اور فرمایا: اور رسول کی نافرمانی، پس اسے اکیلا ذکر کیا۔ اور فرمایا: (قرآن: النساء ۴:۱۱۶) ومن يُشْرِكْ بِاللَّهِ فَقَدْ ضَلَّ (اور جو اللہ کے ساتھ شرک کرے، تو وہ بھٹک گیا) پس اس نے اپنی ذات کو اکیلا ذکر کیا۔ اور اس کا علم کہ کون عظمت کا مستحق ہے اور وہ صفت کیا ہے جو اسے طلب کرتی ہے؟ اور تذکیر (یاد دہانی) کا علم، اور حق (الحق) سے سننے کا علم، اور ملک (فرشتہ) کا علم، اور ملک الملک (بادشاہ کا فرشتہ)، اور ملک العزۃ (عزت کا فرشتہ)، اور ملک الحامل (اٹھانے والا فرشتہ)، اور ملک المحمول (اٹھایا جانے والا فرشتہ)، اور ملک الہباء (ہباء کا فرشتہ)، اور الهول الأعظم (سب سے بڑی دہشت) کا علم، اور اس خزانے کا علم جو عرش کے نیچے ہے۔\n\nنبی صلی اللہ علیہ وسلم نے فرمایا: (حدیث) إِنَّ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ خَرَجَتْ مِنْ كَنْزٍ تَحْتَ الْعَرْشِ (بے شک 'لا حول ولا قوۃ الا باللہ' عرش کے نیچے ایک خزانے سے نکلا ہے)۔ اور وہ خزانہ کیا ہے؟ اور اس میں 'لا حول ولا قوۃ الا باللہ' کے علاوہ کون سا پوشیدہ ذکر شامل ہے؟ اور قوت الٰہیہ (القوۃ الإلہیۃ) اور کونیہ (الکونیۃ) کا علم۔ اور کلمات (الکلمات) کی حضرۃ (حضرۃ) میں معانی کو ایک دوسرے سے ملانے کا علم، اور کیا ان معانی کا کلمات کے مواد سے مجرد ہو کر آپس میں ملنا ممکن ہے یا نہیں؟ اور اگر ان کا آپس میں ملنا ممکن نہیں، تو کیا یہ امر اپنی ذات میں محال ہونے کی وجہ سے ہے کہ وہ ملنے کو قبول نہ کرے، یا اللہ کے ارادے سے؟ اور مخلوق کی کتابت اور خالق کی کتابت میں کیا فرق ہے؟ اور یہ ایک عجیب علم ہے جسے ہم نے دیکھا اور مشاہدہ کیا۔\n\nنبی صلی اللہ علیہ وسلم باہر تشریف لائے اور ان کے ہاتھ میں دو لپی ہوئی کتابیں تھیں، ہر ہاتھ میں ایک کتاب پکڑی ہوئی تھی۔ آپ نے اپنے صحابہ سے پوچھا: کیا تم جانتے ہو کہ یہ دو کتابیں کیا ہیں؟ پھر آپ نے انہیں بتایا کہ ان کے دائیں ہاتھ میں جو کتاب ہے، اس میں اہل جنت کے نام، ان کے آباؤ اجداد کے نام، ان کے قبیلوں اور خاندانوں کے نام ہیں، جب سے اللہ نے پہلا شخص پیدا کیا قیامت کے دن تک۔ اور دوسرے ہاتھ میں جو دوسری کتاب ہے، اس میں اہل جہنم کے نام، ان کے آباؤ اجداد کے نام، ان کے قبیلوں اور خاندانوں کے نام ہیں قیامت کے دن تک۔ اور اگر مخلوق ان ناموں کو اسی طرح لکھنا شروع کر دے جس طرح وہ ان دو کتابوں میں ہیں، تو دنیا کا سارا کاغذ بھی اس کے لیے کافی نہ ہو۔\n\nپس یہاں سے اللہ کی کتابت اور مخلوق کی کتابت کا فرق معلوم ہوتا ہے۔ (اور حکایت بیان کی گئی ہے) کہ اہل حج میں سے ایک سادہ لوح شخص سے ملاقات ہوئی جب وہ طواف وداع کر رہا تھا۔ اس شخص نے اس سادہ لوح سے مذاق کرتے ہوئے پوچھا: کیا تم نے اللہ سے جہنم سے اپنی براءت (آزادی) کا کاغذ لے لیا ہے؟ سادہ لوح نے کہا: نہیں۔ اور کیا لوگوں نے وہ لے لیا ہے؟ اس نے کہا: ہاں۔ تو وہ سادہ لوح رونے لگا اور حجر (حطیم) میں داخل ہو گیا اور کعبہ کے پردوں سے چمٹ گیا اور رونے لگا اور اللہ سے مطالبہ کرنے لگا کہ وہ اسے جہنم سے آزادی کا اپنا کاغذ عطا کرے۔ لوگ اور اس کے ساتھی اسے ملامت کرنے لگے اور اسے بتانے لگے کہ فلاں نے تمہارے ساتھ مذاق کیا ہے، لیکن وہ ان کی تصدیق نہیں کر رہا تھا، بلکہ اپنے حال پر قائم رہا۔ اسی دوران، میزاب (پرنالے) کی سمت سے فضا سے ایک کاغذ اس پر گرا، جس میں جہنم سے اس کی آزادی لکھی ہوئی تھی۔ وہ اس سے بہت خوش ہوا اور لوگوں کو دکھایا۔ اور اس کتاب کی نشانی یہ تھی کہ وہ ہر طرف سے یکساں پڑھی جاتی تھی، جب بھی کاغذ کو پلٹا جاتا، تحریر بھی پلٹ جاتی۔ پس لوگوں نے جان لیا کہ یہ اللہ کی طرف سے ہے۔ اور ہمارے زمانے میں ایک عورت کے ساتھ یہ واقعہ پیش آیا کہ اس نے خواب میں دیکھا گویا قیامت قائم ہو گئی ہے اور اللہ نے اسے ایک درخت کا پتا دیا ہے جس میں جہنم سے اس کی آزادی لکھی ہوئی ہے۔ اس نے اسے اپنے ہاتھ میں پکڑ لیا۔ اور اتفاق یہ ہوا کہ وہ اپنی نیند سے بیدار ہوئی اور پتا اس کے ہاتھ میں بند تھا، اور وہ اپنا ہاتھ کھولنے پر قادر نہیں تھی، اور وہ اپنی ہتھیلی میں پتے کو محسوس کر رہی تھی۔ اور اس کی مٹھی اتنی سختی سے بند تھی کہ اسے تکلیف ہو رہی تھی۔ پس لوگ اس کے گرد جمع ہو گئے اور اس امید پر تھے کہ وہ اس کا ہاتھ کھولنے میں کامیاب ہو جائیں گے، لیکن کوئی بھی شخص، بڑے سے بڑے مرد بھی، اس کا ہاتھ کھولنے میں کامیاب نہ ہو سکا۔ پس انہوں نے ہمارے طریقے (طریقنا) کے لوگوں سے اس بارے میں پوچھا، لیکن ان میں سے کسی کو بھی اس کا راز معلوم نہ ہوا۔ اور فقہاء میں سے رسمی علماء کو تو اس کا علم ہی نہیں تھا۔ اور اطباء نے اسے کسی قوی خلط (مادے) کی وجہ قرار دیا جو اس عضو کی طرف زیادہ ہو گیا تھا اور اس نے اس پر اثر ڈالا۔ بعض لوگوں نے کہا: اگر ہم فلاں سے پوچھیں (ان کا اشارہ میری طرف تھا)، تو شاید ہمیں اس کا علم مل جائے۔ پس وہ عورت کو میرے پاس لائے، جو ایک بوڑھی عورت تھی اور اس کا ہاتھ اس طرح بند تھا کہ اسے تکلیف ہو رہی تھی۔ میں نے اس سے اس کے خواب کے بارے میں پوچھا، تو اس نے مجھے وہی بتایا جو اس نے لوگوں کو بتایا تھا۔ پس میں نے اس کے ہاتھ کے بند ہونے کا سبب جان لیا۔ میں اس کے کان کے قریب گیا اور سرگوشی میں کہا: اپنا ہاتھ اپنے منہ کے قریب لاؤ اور اللہ کے ساتھ نیت کرو کہ تم اس پتے کو نگل لو گی جسے تم اپنی ہتھیلی میں محسوس کر رہی ہو۔ اگر تم نے ایسا نیت کیا اور اللہ نے تمہاری سچائی کو جان لیا، تو تمہارا ہاتھ کھل جائے گا۔ پس عورت نے اپنا ہاتھ اپنے منہ کے قریب کیا اور اسے لگایا، اور اپنا منہ کھولا اور اللہ کے ساتھ پتے کو نگلنے کی نیت کی، تو اس کا ہاتھ کھل گیا اور پتا اس کے منہ میں آ گیا، اور اس نے اسے نگل لیا، اور اس کا ہاتھ کھل گیا۔ حاضرین کو اس پر تعجب ہوا۔ انہوں نے مجھ سے اس علم کے بارے میں پوچھا۔ میں نے انہیں بتایا کہ امام دار الہجرۃ مالک بن انس کے زمانے میں، جب وہ تیرہ سال کے تھے اور اپنے شیوخ سے فقہ پڑھ رہے تھے، اور وہ ذہین اور فطین تھے، یہ واقعہ پیش آیا کہ ایک عورت نے ایک میت کو غسل دیا، جب وہ اس کی شرمگاہ تک پہنچی تو اس نے اپنا ہاتھ میت کی شرمگاہ پر مارا اور کہا: اے شرمگاہ، تو کتنی زنا کار تھی! تو اس کا ہاتھ شرمگاہ سے چپک گیا اور اس سے جڑ گیا۔ کوئی بھی اس کا ہاتھ ہٹا نہ سکا۔ مدینہ کے فقہاء سے پوچھا گیا کہ اس کا حکم کیا ہے؟ بعض نے کہا کہ اس کا ہاتھ کاٹ دیا جائے، اور بعض نے کہا کہ میت کے بدن کا وہ حصہ کاٹ دیا جائے جسے ہاتھ نے پکڑا ہوا ہے۔ فقہاء کے درمیان اس پر طویل بحث ہوئی کہ کون سی حرمت ہم پر واجب ہے: میت کی حرمت کہ ہم اس میں سے کچھ نہ کاٹیں، یا زندہ کی حرمت کہ ہم اسے نہ کاٹیں۔ مالک نے ان سے کہا: میری رائے میں اس کا حکم یہ ہے کہ غسل دینے والی کو تہمت (فریہ) کی حد لگائی جائے، اگر اس نے تہمت لگائی تھی تو اس کا ہاتھ کھل جائے گا۔ پس غسل دینے والی کو تہمت کی حد لگائی گئی، تو اس کا ہاتھ کھل گیا۔ فقہاء کو اس پر تعجب ہوا اور انہوں نے اس وقت سے مالک کو تعظیم کی نگاہ سے دیکھا اور انہیں شیوخ میں شامل کر لیا، جیسا کہ عمر بن خطاب رضی اللہ عنہ عبداللہ بن عباس کو علم میں ان کی عظمت کی وجہ سے اہل بدر کے ساتھ تعظیم میں شامل کرتے تھے۔ اور جب مجھے وہ بات معلوم ہوئی جو اللہ نے میرے دل میں ڈالی کہ اللہ کو اس پتے پر غیرت آئی کہ اس کی مخلوق میں سے کوئی اس پر مطلع نہ ہو، اور یہ ایک راز تھا جو اللہ نے اس عورت کے ساتھ خاص کیا تھا، تو میں نے اسے وہ بات کہی جو میں نے کہی، پس اس کا ہاتھ کھل گیا اور اس نے وہ پتا نگل لیا۔\n\nاور یہ مقام جنت اور دوزخ کے علم، اور قیامت کے مواقف (ٹھہرنے کی جگہوں) کے علم، اور اخروی حالات کے علم، اور شرائع (شریعتوں) کے علم، اور اس سبب کا علم جو رسولوں کے لیے ان کے مراتب کو جاننے کا موجب بنا، باوجود اس کے کہ اللہ کے ہاں ان کا مرتبہ بلند ہے، اور اللہ کے ہاں ان کے مرتبے اور ان لوگوں کے درمیان فرق جو ان پر ایمان لائے، اور حق (الحق) انہیں کس آنکھ سے دیکھتا ہے اور کس اسم سے انہیں مخاطب کرتا ہے، اور تنزیہ (التنزیہ)، تقدیس (التقدیس)، اور عظمت (العظمۃ) کا علم، اور ربوبیت (الربوبیۃ) کی حضرۃ (حضرۃ) کا علم، مقید اسماء کی باقی حضرات سے۔ (قرآن: الاحزاب ۳۳:۴) واللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و پانزدهم در معرفت منزل وجوب عذاب (وجوب العذاب) از حضرت محمدیه (الحضرة المحمدية).\n\nچون حقایق ما محقق شوند، متحد می‌گردیم؛\nاما راهی به وصول نیست،\n\nبه این مقام از هیچ روی،\nبه سبب استواء (برابری) با نزول (فرود آمدن).\n\nو چگونه رواست که به سوی آن صعود کند؟\nو نور جلیل (بزرگ) کجا و خلیل (دوست) کجا؟\n\nدیدم که حبیبش بر او درود فرستاد،\nچنانکه بر نفس خلیل (ابراهیم) درود فرستاد.\n\nپس عین جمع (عین الجمع) در او عین فرق (عین الفرق) است؛\nچنین حدیث از رسول (صلی الله علیه و آله) آمده است.\n\nچون خورشیدهای علم غروب کنند،\nعقل‌هایی که بهره‌شان علم دلیل است، سرگردان شوند.\n\nاگر غیب را چشم‌ها شهود (الشهود) کنند،\nطلوع آن‌ها عین غروب خواهد بود.\n\n### [اینکه وجوب عذاب (الزام عذاب)، سقوط آن بر معذَّب است.]\n\nای ولیّ صمیمی، بدان که وجوب عذاب (وجوب العذاب)، سقوط آن بر معذَّب است. گفته می‌شود: «دیوار واجب شد» یعنی سقوط کرد. و سقوط جز از کسی که علوّ ذاتی نداشته و علوّ را به ذات خود مستحق نبوده، رخ نمی‌دهد. پس چون کسی با این صفت، علوّ یافت، حقیقتی نداشت که علوّش را حفظ کند، لذا سقوط کرد. تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُها لِلَّذِينَ لا يُرِيدُونَ عُلُوًّا في الْأَرْضِ (آن سرای آخرت را برای کسانی قرار می‌دهیم که در زمین اراده برتری و علوّ ندارند). و صفات نفسانی مرادِ موصوف به آن‌ها نیستند. پس هر کس به غیر خود علوّ یابد و حافظی نداشته باشد که علوّش را حفظ کند، سقوط کرده و با او جنگیده می‌شود. پس عالی کسی است که خداوند منزلتش را بالا برده، چنانکه فرمود: ورَفَعْناهُ مَكاناً عَلِيًّا (و او را به جایگاهی بلند بالا بردیم). چون رفعت از جانب خداوند است که علوّ ذاتی از آن اوست، علوّ هر کس را که خداوند منزلتش را بالا برده، حفظ می‌کند. و هر کس به نفس خود علوّ یابد، از جباران و متکبران، خداوند او را درهم می‌شکند و می‌گیرد. از این رو فرمود: والْعاقِبَةُ لِلْمُتَّقِينَ (و عاقبت از آن پرهیزکاران است). یعنی عاقبت علوّی که کسی به آن علوّ یافته و اراده علوّ در زمین کرده، برای متقین (پرهیزکاران) خواهد بود؛ یعنی خداوند علوّ منزلت را در دنیا و آخرت به آنان عطا می‌کند. اما در آخرت، امری لازم و حتمی است، زیرا وعده او راست و کلام او حق است. و سرای آخرت محل تمایز مراتب و تعیین مقادیر خلق نزد خداوند و منزلتشان از او تعالی است. پس علوّ متقین در روز قیامت حتمی است. اما در دنیا، هر کس صدقش در تقوا و زهد محقق شود، انگیزه‌های نفوس جباران و متکبران برای تعظیم او فراهم می‌شود، زیرا آن‌ها در مراتبشان با متقین مزاحمت نکرده‌اند. پس آنچه از تعظیم متقین در نفوس جباران حاصل شده، آن‌ها را از علوّشان پایین می‌آورد و قصد خدمت و تبرک جستن به متقین می‌کنند. و آن علوّی که جباران به آن ظاهر شده بودند، به این متقی منتقل می‌شود و عاقبت علوّ برای متقی است. و جبار درک نمی‌کند و لذت می‌برد اگر گفته شود که او تواضع کرده و نزد این متقی فرود آمده است. پس جبار خیال می‌کند که متقی پایین‌تر است و او به سوی متقی فرود آمده است. بلکه علوّ جبار از جایی که او درک نمی‌کند، به متقی منتقل شده و جبار زیر علوّ این متقی فرود آمده است. و اگر از متقی درباره علوّش سؤال شود، چیزی از آن نزد خود نمی‌یابد. پس ثابت شد که علوّ در انسان، تنها تحقق او به عبودیتش و عدم خروج او و متصف نشدن به آنچه حقیقتش نیست، می‌باشد. آیا حکمت خداوند تعالی را در این قول نمی‌بینی: لَمَّا طَغَى الْماءُ (هنگامی که آب طغیان کرد) یعنی بالا رفت و مرتفع شد. و علوّ را به آب نسبت داد و حق (الحق) آن را به خود نسبت نداد. پس چون آب علوّ یافت و مرتفع شد، خداوند کسانی را که نجاتشان را از سطوت ارتفاع آب می‌خواست، در تخته‌هایی که به هم پیوسته بودند تا کشتی شدند، حمل کرد. پس هر کس از مؤمنان که خداوند نجاتش را می‌خواست، وارد آن شد. کشتی با سرنشینانش بر علوّ آب بالا رفت و آب زیر آن قرار گرفت و طغیان آب در حق کشتی زائل شد. پس آب در نفس خود شکست خورد. و سبب آن، نسبت دادن علوّ به آب بود، هرچند که از جانب خداوند و به امر خداوند بود. اما خداوند علوّ را جز به آب نسبت نداد. اگر خداوند علوّ آب را به خود تعالی نسبت می‌داد، علوّش را بر آن حفظ می‌کرد و هرگز کشتی بر آن بالا نمی‌رفت و هیچ چیز بر روی آب شناور نمی‌شد. این شومیِ ادعاست. پس سقوط عذاب بر معذَّب، تنها سقوط آن از ارتفاعش در نفس خود بود، زیرا عذاب صفتی ملکی برای اسم «الله المعذِّب» است. پس این نَسَمه (بوی خوش) به عذاب، نشان علوّ داد، زیرا علوّ صفتی از آنِ کسی است که علوّ دارد و او اسم «المعذِّب» است. پس چون اسم «المعذِّب» دید که علوّی در نفس عذاب به سبب او پدید آمده، آن را بر معذَّب (شخص عذاب‌شونده) ساقط کرد. پس عذاب از علوّی که به آن فخر می‌کرد، هنگامی که معذَّب به آن متصف بود، زائل شد. از این رو گفته می‌شود: وجوب عذاب (وجوب العذاب) بر معذَّب. و تحقیق این امر آن است که امر صحیح این است که پادشاه کسی را عذاب نمی‌کند مگر اینکه غضب بر آن کسی که می‌خواهد عذابش کند، در او پدید آید، به سبب امری که از آن شخص سر زده و مستوجب عذاب شده است. پس آن امر در نفس پادشاه غضبی را تأثیر می‌گذارد که پادشاه از آن آزرده می‌شود. و پادشاه جلیل‌القدر است و شایسته مقام او به سبب علوّ منصبش نیست که به چیزی عذاب شود. و این شخص کاری کرده که پادشاه را به غضب آورده است. پس پادشاه عذابی را که در نفس خود می‌یافت و از آن به غضب تعبیر می‌شد، یا عذابی که غضب در نفس پادشاه به ثمر آورده بود، بر این شخص واجب کرد (أوجبه)، یعنی آن را بر او ساقط کرد. پس هنگامی که عذاب بر این شخص واجب شد، پادشاه با عذاب این شخص، راحتی خود را یافت. و امر چنین نیست، بلکه وجود راحتی به زوال عذابی است که در نفس پادشاه بود و فعل این شخص آن را به ارث گذاشته بود. پس پادشاه به آن عذاب می‌شد. هنگامی که آن را بر این شخص نازل کرد، از او منتقل شد و با انتقال آن، راحتی یافت. و در میان عوام به «تشفی» (انتقام‌گیری) نامیده می‌شود و آن از «شفاء» (بهبودی) است. و شفا، زوال بیماری است، نه نزول بیماری که در بیمار بود، بر شخص دیگری. این تحقیق شفا و راحتی است. سپس اینکه آن درد بر شخص دیگری نازل شده، برای او لذتی دارد، و آن لذتی دیگر است، افزون بر لذت زوال عذاب. و علوّ در اینجا حقیقتی برای اسم الهی است. از این رو عذاب به سقوط متصف شد و آن همان وجوب است. خداوند تعالی می‌فرماید: أَ فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ (آیا کسی که کلمه عذاب بر او محقق شده است) یعنی واجب شده و سقوط کرده است. اگر بگویی: این در حق مخلوقات صحیح است، چگونه در حق جناب عالی سبحانه جاری می‌شود؟ می‌گوییم: چون ما از معرفت (المعرفة) خداوند عاجزیم و این عجز برای ما رواست، پس شایسته است که اگر ما را به عقل‌ها و حقایقمان واگذارند، به آن ملتزم شویم و چنین امری و غیر آن را از او نفی کنیم. زیرا قدرت عقل این را اقتضا می‌کند، جز اینکه قدرت عقل و دلیل واضح، عقل را بر تصدیق رسولی که به سوی ما فرستاده شده، وادار کرده است؛ در اخباری که از پروردگارش می‌دهد، درباره آنچه از او سبحانه در خلقش صادر می‌شود و آنچه سبحانه در نفس خود بر آن است و آنچه خود را به آن وصف می‌کند و عقل اگر به تنهایی و بدون شارع به دلیل خود اعتماد کند، آن را محال می‌داند. پس عاقل دوراندیش، ذلیلانه و کمر بسته در خدمت شرع می‌ایستد و هر آنچه را که شرع از پروردگار سبحانه و تعالی درباره آنچه بر اوست و از او صادر می‌شود، خبر می‌دهد، می‌پذیرد.\n\nو از جمله آنچه حق (الحق) از نفس خود خبر داده، این است که فرمود: إِنَّ الَّذِينَ يُؤْذُونَ الله (همانا کسانی که خدا را آزار می‌دهند). و پیامبر (صلی الله علیه و آله) فرمود: «هیچ کس بر آزار، صبورتر از خداوند نیست.» و خداوند تعالی فرمود: «فرزند آدم مرا تکذیب کرد و فرزند آدم مرا دشنام داد.» و خداوند تعالی فرمود: وغَضِبَ الله عَلَيْهِمْ (و خداوند بر آنان غضب کرد). و پیامبران همگی گفتند که خداوند در روز قیامت چنان غضبی می‌کند که پیش از آن مانندش را نکرده و پس از آن نیز مانندش را نخواهد کرد. و عاقل همه این‌ها را در خبری که خداوند از نفس خود داده، به او تسلیم می‌کند، چنانکه تسلیم کرده است که او سبحانه از توبه بنده‌اش شاد می‌شود. و هر کس به فرح متصف شود، به نقیض آن نیز متصف می‌شود. و خود را وصف کرده که از جوانی که صبوه‌ای (میل به لهو) ندارد، تعجب می‌کند. و خود را وصف کرده که می‌خندد هنگامی که در روز قیامت می‌گوید: «آیا مرا مسخره می‌کنی در حالی که تو پروردگار جهانیانی؟» و خود را وصف کرده که هنگامی که بنده‌اش برای نماز به مسجد می‌آید، به او تبشبش (روی خوش) نشان می‌دهد. و خود را وصف کرده که کفر را برای بندگانش ناخوش می‌دارد و شکر و ایمان را برایشان می‌پسندد. پس ایمان به همه این‌ها بر هر مسلمانی واجب است و عقل در اینجا نمی‌گوید: چگونه و چرا چنین بود؟ بلکه تسلیم می‌شود و گردن می‌نهد و تصدیق می‌کند و کیفیت نمی‌جوید، زیرا لَيْسَ كَمِثْلِهِ شَيْءٌ (هیچ چیز مانند او نیست). پس چون دیدیم که خود را به غضب و آزار وصف کرده و عذاب را به وجوب و سقوط وصف کرده است، و سقوط جز از علوّ نیست و علوّ جز برای خداوند تعالی شایسته نیست، دانستیم که آزار (الأذى) که حق (الحق) خود را به آن وصف کرده، همین است. پس آزار به علوّ کسی که به آن متصف شده، بالا رفت و آن را از آن علوّ بر کسی که مستحق آن است، یعنی کسی که خدا و رسولش را آزار داده، ساقط کرد. پس عذاب در سرای خواری و پستی بر او فرود آمد. اگر آنچه را مقرر کردیم، دانستی، بین ایمان که همان الدِّينُ الْخالِصُ (دین خالص) است و آنچه مرتبه‌ات از تسلیم در برابر خداوند در هر آنچه از نفس خود خبر می‌دهد، مستحق است، جمع کرده‌ای. و در افصاح (آشکار کردن) این مقام، بیش از این ممکن نیست و رساتر نخواهد بود، مگر اینکه حق (الحق) به آنچه در نسبت آشکارتر و واضح‌تر است، خبر دهد. و نهایت مخلوق از این امر، با مجرد عقلش، همین است که ما مقرر کردیم، مگر عقل‌هایی که فضول (کنجکاوی‌های بیجا) آن‌ها را درک کرده و این امور را تأویل کرده‌اند. پس ما حال آن‌ها را تسلیم می‌کنیم و در آن تأویل با آن‌ها شریک نمی‌شویم، زیرا نمی‌دانیم آیا آن تأویل مراد خداوند از آنچه گفته است، هست تا بر آن اعتماد کنیم، یا مراد او نیست تا آن را رد کنیم. از این رو، ما التزام به تسلیم را برگزیدیم. پس اگر از ما درباره چنین امری سؤال شود، می‌گوییم: ما به آنچه از جانب خداوند آمده، بر مراد خداوند از آن، ایمان داریم. و ما به آنچه از رسول خدا (صلی الله علیه و آله) و رسولانش (علیهم السلام) آمده، بر مراد رسولش (صلی الله علیه و آله) و مراد رسولانش (علیهم السلام) ایمان داریم. و علم همه این‌ها را به او سبحانه و به ایشان واگذار می‌کنیم. و ممکن است رسولان در این امر نسبت به خداوند مانند ما باشند؛ این اخبار از جانب خداوند بر آن‌ها وارد می‌شود و آن را به او سبحانه و تعالی تسلیم می‌کنند، چنانکه ما تسلیم کردیم و تأویل آن را نمی‌دانند. این بعید نیست. و ممکن است تأویل آن را به تعریف خداوند، به هر وجهی که باشد، بدانند. این نیز بعید نیست. و این روش سلف بود. خداوند ما را به منّت خود، جانشین آن‌ها قرار دهد. پس خوشا به حال کسی که پروردگارش را مراقبت کند و از گناهش بترسد و قلبش را با ذکر خدا آباد سازد و محبتش را برای خدا خالص گرداند. اینک تو را به معنای وجوب عذاب (وجوب العذاب) بر کسی که بر او واجب شده، آگاه ساختم. و بیش از این، این باب گنجایش ندارد، زیرا میدان آن در میان عوام تنگ است، هرچند که میدان آن نزد امثال ما، به آنچه خداوند از معرفت (المعرفة) به ما عطا کرده، گشاده است. اما عقل‌هایی که با هوی و هوس و طلب ریاست و نفاس و برتری بر همنوعان محجوب شده‌اند، این امر آن‌ها را از پذیرش و انقیاد باز می‌دارد. و ما رسولانی از جانب خداوند نیستیم که خود را به ابلاغ چنین علومی مکلف سازیم. و آنچه از آن ذکر می‌کنیم، جز برای مؤمنان عاقلی نیست که به تصفیه نفوس خود با خداوند مشغول شده‌اند و نفوس خود را به تحقق ذلت عبودیت و افتقار به خداوند در همه احوال ملزم ساخته‌اند. پس خداوند بصیرت آن‌ها را یا با علم و یا با ایمان و تسلیم به آنچه خبر از جانب خداوند و کتب و رسولانش آورده، نورانی کرده است. پس آن، عنایت کبری و جایگاه زلفی (نزدیکی) و روش مثلی (برتر) و سعادت عظمی است. خداوند ما را به کسی که این صفت اوست، ملحق سازد. و اما آنچه این منزل از علوم در بر دارد، شامل علم حق (علم الحق) است و از جمله آن، آنچه در شرح وجوب عذاب (وجوب العذاب) در پی آن بودیم. و در آن، علم اسم الهی نیز هست که حق (الحق) بندگانش را با آن مورد استفهام قرار می‌دهد، مانند قولش: يَوْمَ يَجْمَعُ الله الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ (روزی که خداوند رسولان را جمع می‌کند و می‌گوید: چه پاسخی شنیدید؟) در حالی که او داناتر است. و مانند قولش: «چگونه بندگانم را ترک کردید؟» که به فرشتگانی می‌گوید که شب را نزد ما گذراندند و سپس به سوی او عروج کردند. و آن علمی شریف است. و در آن، زواجر الهی (بازدارنده‌های الهی) هست و اینکه آیا آن‌ها کونی (مربوط به عالم خلق) هستند یا الهی. و علم سبب موجِب هلاکت امت‌ها هنگام کفرشان، و اینکه چه کسانی از مؤمنان با هلاکت آن‌ها هلاک شدند و هلاکت مقلدان همراه آن‌ها، همه این‌ها در دنیاست. و اینکه چه کسی در آخرت از این هلاکت خارج می‌شود و چرا هلاکت بر مؤمنان واقع شد، هنگامی که بر کافران واقع شد، و همه را فرا گرفت و صفت متفاوت بود. و آیا این از باب رکون (تکیه کردن) است، چنانکه فرمود: ولا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا (و بر کسانی که ستم کردند، تکیه نکنید). و علم رکونی که موجب مسّ آتش می‌شود، آیا رکون حسی است یا معنوی؟ و قول او درباره مضاعف شدن عذاب بر رکون، حتی اگر قصد خیری داشته باشد. خداوند تعالی می‌فرماید: لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا إِذاً لَأَذَقْناكَ ضِعْفَ الْحَياةِ وضِعْفَ الْمَماتِ (نزدیک بود که اندکی به آن‌ها تکیه کنی، در آن صورت، دو برابر عذاب زندگی و دو برابر عذاب مرگ را به تو می‌چشاندیم). سبب این مضاعف شدن که شدیدتر از عذاب مستحق به اصالت است، چیست؟ و مراد خداوند در چنین آیه‌ای که جز با تعریف خداوند دانسته نمی‌شود، چیست؟ و آن علمی عظیم است که این منزل در بر دارد. و علم کسی که به نفس خود هلاک می‌شود و کسی که به غیر خود هلاک می‌شود، و حد هلاکت به غیر و حد هلاکت به نفس چیست؟ و مقدار زمان آن چقدر است؟ و آیا هلاکت در انواع مختلفش به دلیل اختلاف احوال در هلاک‌شوندگان است یا به دلیل اختلاف حقایق اسماء الهی (الأسماء الإلهية)، تا هر اسم الهی سهم خود را از عذاب در این مقام بگیرد؟ و علم آنچه از اسماء پس از وجودشان معدوم می‌شود و آنچه باقی می‌ماند و با هلاکت یا غیر آن معدوم نمی‌شود. و علم فرق بین کسی که خدا را نافرمانی کرده و کسی که رسولش را نافرمانی کرده و کسی که اولی‌الامر را نافرمانی کرده است. و آنچه نافرمانی رسول و نافرمانی اولی‌الامر از معصیت خداوند در بر دارد، زیرا در نافرمانی آن‌ها، نافرمانی امر خداوند است، در حالی که در نافرمانی خداوند، نافرمانی آن‌ها نیست، مگر در خصوص رسول، زیرا در نافرمانی خداوند، نافرمانی رسول خدا نیز هست. چون متعلق معصیت، امر و نهی الهی است و این جز با ابلاغ رسول و بر زبان او شناخته نمی‌شود، زیرا خداوند امر خود را جز به رسولان ابلاغ نمی‌کند و غیر رسولان از بشر این مقام را ندارند. با این حال، خداوند امری دارد که در آن نافرمانی می‌شود و رسول امری دارد که در آن نافرمانی می‌شود و سپس امری هست که معصیت خدا و رسول در آن جمع می‌شود. پس هر امری که به جناب خداوند مربوط است و مخلوقی در آن دخالت ندارد، آن معصیت خداوند است. و هر امری که به جناب مخلوق که رسول خداست مربوط است، آن معصیت رسول است. و هر امری که هر دو جانب را در بر دارد، آن معصیت خدا و رسول اوست. خداوند تعالی فرمود: ومن يَعْصِ الله ورَسُولَهُ (و هر کس خدا و رسولش را نافرمانی کند). و فرمود: و معصية الرسول (و نافرمانی رسول) و آن را مفرد آورد. و فرمود: ومن يُشْرِكْ بِاللَّهِ فَقَدْ ضَلَّ (و هر کس به خدا شرک ورزد، قطعاً گمراه شده است) و خود را مفرد آورد. و علم کسی که مستحق عظمت است و صفتی که آن را می‌طلبد. و علم تذکیر (یادآوری). و علم شنیدن از حق (الحق). و علم ملک (پادشاهی). و ملکِ ملک. و علم ملک عزّت. و علم ملک حامل. و علم ملک محمول. و علم ملک هباء (ذرات معلق). و علم هول اعظم. و علم گنجی که زیر عرش است.\n\nپیامبر (صلی الله علیه و آله) فرمود: «همانا لا حول ولا قوة إلا بالله (هیچ نیرو و قدرتی جز به یاری خدا نیست) از گنجی زیر عرش خارج شده است.»\n\nو آن گنج چیست و چه ذکری در آن نهفته است، غیر از لا حول ولا قوة إلا بالله؟ و علم نیروی الهی و کونی. و علم ضمیمه کردن معانی به یکدیگر در حضرت کلمات. و آیا آن‌ها در نفس خود، مجرد از مواد کلمات، انضمام دارند یا در نفس خود ضمیمه‌ای ندارند؟ و اگر ضمیمه‌ای ندارند، آیا به دلیل محال بودن امر در ذات خود است که انضمام را نمی‌پذیرد یا به اراده خداوند است؟ و فرق بین کتابت مخلوق و کتابت خالق چیست؟ و آن علمی شگفت‌انگیز است که ما آن را دیده‌ایم و شهود (الشهود) کرده‌ایم.\n\nزیرا پیامبر (صلی الله علیه و آله) خارج شد در حالی که دو کتاب پیچیده در دستانش بود و با هر دست کتابی را گرفته بود. پس از اصحابش پرسید: «آیا می‌دانید این دو کتاب چیستند؟» سپس به آن‌ها خبر داد که در کتابی که در دست راستش بود، اسامی اهل بهشت و اسامی پدران و قبایل و عشایرشان از اولین کسی که خداوند خلق کرده تا روز قیامت نوشته شده است. و در دست دیگر، در کتاب دیگر، اسامی اهل آتش و اسامی پدران و قبایل و عشایرشان تا روز قیامت نوشته شده است. و اگر مخلوق بخواهد این اسامی را بر آنچه در این دو کتاب است، بنویسد، تمام کاغذهای دنیا کفایت نمی‌کند.\n\nاز اینجا کتابت خداوند از کتابت مخلوقین شناخته می‌شود. (و حکایت شده است) که یکی از ساده‌لوحان اهل حج، مردی را در طواف وداع دید. آن مرد با این ساده‌لوح شوخی کرد که آیا برائت خود را از آتش از خداوند گرفته‌ای؟ ساده‌لوح گفت: نه. آیا مردم آن را گرفته‌اند؟ مرد گفت: بله. پس آن ساده‌لوح گریه کرد و وارد حجر شد و به پرده‌های کعبه آویخت و شروع به گریه و درخواست از خداوند کرد که کتاب آزادی‌اش از آتش را به او بدهد. مردم و دوستانش شروع به سرزنش او کردند و به او فهماندند که فلان شخص با تو شوخی کرده است، اما او آن‌ها را باور نمی‌کرد و بر حال خود اصرار داشت. در همین حال، کاغذی از هوا، از سمت ناودان (میزاب) بر او افتاد که در آن آزادی او از آتش نوشته شده بود. او شاد شد و آن را به مردم نشان داد. و از نشانه آن کتاب این بود که از هر طرف به طور یکسان خوانده می‌شد و هرگاه کاغذ را برمی‌گرداندی، نوشته نیز برمی‌گشت. پس مردم دانستند که آن از جانب خداوند است. و اما در زمان ما، برای زنی اتفاق افتاد که در خواب دید قیامت برپا شده و خداوند برگی از درخت به او داده که در آن آزادی او از آتش نوشته شده است. او آن را در دست گرفت و اتفاقاً از خواب بیدار شد در حالی که دستش بر آن برگ بسته شده بود و نمی‌توانست دستش را باز کند و برگ را در کف دستش حس می‌کرد. و قبضه دستش چنان محکم شده بود که او را به درد می‌آورد. مردم بر گرد او جمع شدند و طمع داشتند که بتوانند دستش را باز کنند، اما هیچ کس، حتی قوی‌ترین مردان، نتوانست دستش را باز کند. پس از اهل طریقت ما درباره آن سؤال کردند، اما هیچ یک از آن‌ها راز آن را نمی‌دانست. و اما علمای رسم (فقها) از آن علمی نداشتند. و اما پزشکان، آن را به خلط قوی نسبت دادند که به آن عضو سرازیر شده و تأثیر خود را گذاشته است. برخی از مردم گفتند: اگر از فلان شخص بپرسیم (منظورشان من بودم)، شاید علمی در این باره نزد او بیابیم. پس زن را نزد من آوردند. او پیرزنی بود و دستش چنان بسته بود که او را آزار می‌داد. از او درباره رؤیایش پرسیدم. او همان‌طور که به مردم گفته بود، به من خبر داد. پس من سبب موجِب بسته شدن دستش را دانستم. به گوش او نزدیک شدم و آهسته گفتم: دستت را به دهانت نزدیک کن و با خداوند نیت کن که آن برگی را که در کف دستت حس می‌کنی، می‌بلعی. اگر چنین نیت کنی و خداوند صدق تو را بداند، دستت باز خواهد شد. زن دستش را به دهانش نزدیک کرد و چسباند و دهانش را باز کرد و با خداوند نیت بلعیدن برگ را کرد. دستش باز شد و برگ در دهانش قرار گرفت و آن را بلعید و دستش باز شد. حاضران از این امر تعجب کردند. از من درباره علم آن پرسیدند. به آن‌ها گفتم: مالک بن انس، امام دارالهجره، در زمان خود در سن سیزده سالگی بود و فقه را نزد شیوخ خود می‌خواند و دارای فطانت و ذکاوت بود. در آن زمان اتفاق افتاد که زنی مرده‌ای را غسل می‌داد. هنگامی که به فرج میّته رسید، دستش را بر فرج میّته زد و گفت: «ای فرج، چقدر زناکار بودی!» دستش به فرج چسبید و به آن پیوست. هیچ کس نتوانست دستش را جدا کند. از فقهای مدینه سؤال شد که حکم در این باره چیست؟ برخی گفتند: دستش قطع شود. برخی گفتند: به اندازه آنچه دست گرفته، از بدن میّته قطع شود. نزاع در این باره بین فقها طولانی شد که کدام حرمت بر ما واجب‌تر است: حرمت میّت که چیزی از او قطع نکنیم، یا حرمت زنده که دستش قطع نشود؟ مالک به آن‌ها گفت: نظر من این است که حکم در این باره این است که غسل‌دهنده را حدّ افترا بزنند. اگر افترا زده باشد، دستش رها می‌شود. پس غسل‌دهنده را حدّ افترا زدند و دستش رها شد. فقها از این امر تعجب کردند و از آن زمان به بعد با دیده تعظیم به مالک نگریستند و او را به شیوخ ملحق کردند، چنانکه عمر بن خطاب، عبدالله بن عباس را به دلیل عظمت قدرش در علم، در تعظیم به اهل بدر ملحق می‌کرد. و چون من دانستم که خداوند در نفس من القا کرده که خداوند بر آن برگ غیرت ورزیده که هیچ یک از خلق خدا بر آن مطلع نشود و آن رازی است که خداوند آن زن را به آن اختصاص داده است، آنچه را گفتم، به او گفتم. پس دستش باز شد و آن برگ را بلعید.\n\nو این منزل شامل علم بهشت و آتش، و علم مواقف قیامت، و علم احوال اخروی، و علم شرایع، و علم سبب موجِب که به خاطر آن رسولان مقادیر خود را شناختند، با وجود علوّ منزلتشان نزد خداوند، و فرق بین منزلتشان نزد خداوند و منزلتشان نزد مردم مؤمن به آن‌ها، و اینکه حق (الحق) با چه چشمی به آن‌ها می‌نگرد و با چه اسمی آن‌ها را خطاب می‌کند. و علم تنزیه و تقدیس و عظمت. و اینکه حضرت ربوبیت (حضرة الربوبية) از حضرات بقیه اسماء مقید چیست. والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 4
}