{
  "id": 415,
  "title": {
    "ar": "الباب الخامس عشر وأربعمائة في معرفة منازلة من دعاني فقد أدى حق عبوديته ومن أنصف نفسه فقد أنصفني",
    "en": "Chapter Four Hundred and Fifteen: Concerning the Knowledge of the Spiritual Station (منازلة) of the one who said: \"Whoever calls upon Me has fulfilled the right of his servitude (عبودية), and whoever deals justly with his soul has dealt justly with Me.\"",
    "ur": "باب چار سو پندرہ: ان منازل کی معرفت میں کہ جس نے مجھے پکارا تو اس نے اپنی عبودیت (عبودية) کا حق ادا کیا، اور جس نے اپنی نفس کے ساتھ انصاف کیا تو اس نے میرے ساتھ انصاف کیا۔",
    "fa": "باب چهارصد و پانزدهم: در معرفت منازل کسی که مرا خوانده، حق عبودیتش را ادا کرده است و کسی که با نفس خود انصاف ورزیده، با من انصاف ورزیده است."
  },
  "content": {
    "ar": "## «الباب الخامس عشر وأربعمائة في معرفة منازلة من دعاني فقد أدى حق عبوديته ومن أنصف نفسه فقد أنصفني»\n\n\n> إذا ما دعوت الله من غير أمره *** فلست له عبد أو ما أنصف العبد\n\n\n> وأصبحت عبدا للحظوظ وما لنا *** وفاء ولا عهد وقد ثبت العهد\n\n\n> ولو لا قيام العبد في عهد ربه *** لما صح أَوْفُوا بِالْعُقُودِ ولا وعد\n\n\n> وليس سوى التكليف قربا مخصصا *** يعينه أمر ويثبته عقد\n\n\n> وقامت حقوق الحق من كل جانب *** علينا ولو لا القرب ما عرف البعد\n\n\n> فمن أنصف الأكوان أنصف ربه *** وكان له في ذات خالقه الخلد\n\n\n> وصح له مجد تليد وطارف *** وكان له بين الملائكة الحمد\n\n\n> إلا إنما العبد الذي لم يزل به *** يموت ويحيا والوقوف له حد\n\n\n> وما كلف الرحمن نفسا سوى الذي *** تقوم به فاجهد فقد ينفع الجهد\n\n\n> فمن قام بالرحمن كان له الجد *** ومن قام للرحمن كان له الجد\n\n\n> وخصص بالآيات في عين نفسه *** وآفاقه فاحمد بما حمد الحمد\n\n\n### [أن الحق عين قوى العبد]\n\n\nقال الله تعالى ادْعُونِي أَسْتَجِبْ لَكُمْ وقال إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبادَتِي سَيَدْخُلُونَ جَهَنَّمَ داخِرِينَ فوصفهم بأنهم لا يخرجون عن العبودية وأن الذلة حقيقتهم وهو قوله داخِرِينَ فمن لم يرد أن يكون عبدا لي كما هو في نفس الأمر فإنه سيكون عبد الطبيعة التي هي جهنم ويذل تحت سلطانها كما هو ليس هو في نفس الأمر فترك العلم واتصف بالجهل فلو علم لكان عبدا لي وما دعا غيري كما هو في نفس الأمر عبد لي أحب أم كره وجهل أو علم وإذا كان عبدا لي بدعائه إياي ولم يتكبر في نفسه أن يكون عبد إلى عند نفسه أعطيته التصريف في الطبيعة فكان سيدا لها وعليها ومصرفا لها ومتصرفا فيها وكانت أمته فانظر ما فاته من العز والسلطان من استكبر عن عبادتي ولم يدعني في السراء وكشف الضر تعبدته الأسباب فكان من الجاهلين ومما يؤيد أن الحق عين قوى العبد فالتصريف له لأن العبد لا تصرفه إلا قواه ولا يصرفه إلا الحق فقواه عين الحق دليلنا ما قالته الرسل سلام الله عليهم في ذلك‏\n\n\nفأخبر محمد صَلَّى اللهُ عَليهِ وسَلَّم عن الله أنه قال كنت سمعه وبصره ويده‏\n\n\nيعني العبد إذا تقرب إليه بالنوافل حتى يحبه وذكر قواه التي تصرفه ونزل في القرآن تصديق هذا القول وهو قوله والله خَلَقَكُمْ وما تَعْمَلُونَ والعمل ليس لجسم الإنسان بما هو جسم وإنما العمل فيه لقواه وقد أخبر أن العمل الذي يظهر من الإنسان المضاف إليه أنه لله خلق فالحق قواه وأما موسى فأخذ العالم في ماهية الحق لما دعا فرعون إلى الله رب العالمين فقال له فرعون وما رَبُّ الْعالَمِينَ يسأله عن الماهية فقال له موسى عليه السلام رَبُّ السَّماواتِ والْأَرْضِ وما بَيْنَهُمَا إِنْ كُنْتُمْ مُوقِنِينَ يقول إن استقر في قلوبكم ما يعطيه الدليل والنظر الصحيح من الدال فأخذ موسى عليه السلام العالم في التعريف بماهية الحق والرسل عندنا أعلم الخلق بالله فقال فرعون وقد علم إن الحق مع موسى فيما أجابه به إلا أنه أوهم الحاضرين واستخفهم لأن السؤال منه إنما وقع بما طابقه الحق وهو قوله وما رَبُّ الْعالَمِينَ فما سأله إلا بذكر العالمين فطابق الجواب السؤال فقال فرعون لقومه أَ لا تَسْتَمِعُونَ أسأله عن الماهية فيجيبني بالأمور الإضافية فغالطهم وهو ما سأل إلا عن الرب المضاف فقال له موسى رَبُّكُمْ ورَبُّ آبائِكُمُ الْأَوَّلِينَ فخصص الإضافة لدعوى فرعون في قومه إنه ربهم الأعلى فقال فرعون إِنَّ رَسُولَكُمُ الَّذِي أُرْسِلَ إِلَيْكُمْ لَمَجْنُونٌ أي قد ستر عنه عقله لأن العاقل لا يسأل عن ماهية شي‏ء فيجيب بمثل هذا الجواب فقال له موسى لقرينة حال اقتضاها المجلس ما قال إبراهيم عليه السلام لنمرود رَبُّ الْمَشْرِقِ والْمَغْرِبِ وما بَيْنَهُما إِنْ كُنْتُمْ تَعْقِلُونَ ولو لم يقل هنا\nوما بينهما لجاز لأنه ليس بينهما شي‏ء وذلك لأن عين حال الشروق في ذلك الحيز هو عين استوائها هو عين غروبها فكل حركة واحدة منها في حيز واحد شروق واستواء وغروب فما ثم ما ينبغي أن يقال ما بينهما لكنه قال وما بينهما لغموضه على الحاضرين فإنهم لا يعرفون ما فصلناه في إجمال وما بينهما فجاء بالمشرق والمغرب المعروف في العرف ثم قال لهم إِنْ كُنْتُمْ تَعْقِلُونَ فأحالهم على النظر العقلي فما عرف الحق إلا بنا ولا وجد الخلق إلا به‏\n\n\n> فمنه إلينا ومنا إليه *** فيثني علينا ونثني عليه‏\n\n\nوكذا ذكر إبراهيم عليه السلام الذي ذكر الله عنه أنه آتاه الحجة على قومه وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّماواتِ والْأَرْضَ فما ذكره إلا بالعالم فالعالم ظاهره خلق وباطنه حق ومن حكم باطنه يتصرف وما يؤثر في باطنه التصرف إلا تصرف في ظاهر من باطن فما تصرف في باطنه الذي هو الحق إلا الحق لا غير فتصريفه حكم عليه بالتصريف فالصورة الظاهرة مماثلة للصورة الباطنة حتى إن بعض المتكلمين ذهب في كتابة القرآن وفي تلاوته المحدثة أن لكل حرف يكتبه الكاتب من القرآن أو يتلوه التالي من القرآن في ذلك الحرف المنطوق به الحادث أو المكتوب حرف مثله هو قديم وأضطره إلى ذلك كون الحادث لا يستقل في وجوده فلا بد من استصحاب القديم له وهذا مذهب رئيس من رؤساء المعتزلة ثم إن هذا القديم إن لم يكن على صورة ما خرج عنه وظهر وهو الحادث وإلا فليس هو له ولذلك كان العالم على صورة الحق وكان الإنسان الكامل على صورة العالم وصورة الحق وهوقوله إن الله خلق آدم على صورته‏\n\n\nفليس في الإمكان أبدع ولا أكمل من هذا العالم إذ لو كان لكان في الإمكان ما هو أكمل من الله فإن آدم وهو من العالم قد خلقه الله على صورته وأكمل من صورة الحق فلا يكون وذلك أن ظهور العالم عن الحق ظهور ذاتي فالحق مرآة للعالم ظهر فيها صور العالم فرأت الممكنات نفسها في مرآة الحق الوجود فتوقفت في الوجود عليه وتوقف في العلم به على العلم بها\n\n\n> فلم يكن إلا بها *** ولم تكن إلا به‏\n\n\n> فما لها من مشبه *** وما له من مشبه‏\n\n\n> يا غافلا عن قولنا *** فكن بها تكن به‏\n\n\nفإذا كان الأمر كما ذكرناه فمن أنصف نفسه وأعطاها حقها فإنما أنصف الحق وأعطاه حقه لأنه أفرد نفسه بما يستحقه وأفرد ربه بما يستحقه ومن تميز عن شي‏ء فما هو عينه ولا مثله فيما تتميز به عنه لكنه مثله في كونه تميز فافهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ واجعل بالك في كل منظوم في أول كل باب من أبواب هذا الكتاب فإنه يتضمن من علوم ذلك الباب على قدر ما أردت أن أنبه فيه عليها تجد في النظم ما ليس في الكلام في ذلك الباب فتزيد علما بما هو عليه ما ذكرته في النظم وعَلَى الله قَصْدُ السَّبِيلِ‏\n\n",
    "en": "Chapter Four Hundred and Fifteen: Concerning the knowledge of the station of the one who calls upon Me, for he has fulfilled the right of his servitude, and the one who is just to himself has been just to Me.\n\nIf you call upon Allah without His command,\nYou are not His servant, nor has the servant been just.\n\nAnd you become a slave to fortunes (حظوظ), and we have\nNeither loyalty nor covenant, though the covenant is established.\n\nWere it not for the servant standing by the covenant of his Lord,\nThe command <<أَوْفُوا بِالْعُقُودِ>> (Fulfill the covenants) would not be valid, nor any promise.\n\nAnd there is no specific proximity (قرب) other than the divine assignment (التكليف),\nWhich a command designates and a covenant confirms.\n\nThe rights of the Real (الحق) are established upon us from every side,\nAnd were it not for proximity, distance (البعد) would not be known.\n\nSo whoever is just to the cosmos (الأكوان) is just to his Lord,\nAnd for him is eternity (الخلد) in the Essence (ذات) of his Creator.\n\nAnd for him is validated glory, both ancient and newly acquired,\nAnd for him is praise (الحمد) among the angels.\n\nIndeed, the servant is only the one through whom He perpetually\nDies and lives, and standing still is his limit.\n\nThe All-Merciful has not assigned a soul anything other than that\nWhich it can fulfill, so strive, for striving may be beneficial.\n\nSo whoever stands *by* the All-Merciful (بالرحمن) has seriousness,\nAnd whoever stands *for* the All-Merciful (للرحمن) has fortune.\n\nAnd he is specified by the signs (الآيات) in the very essence of himself\nAnd in his horizons (آفاقه), so praise with that by which praise (الحمد) is praised.\n\n***\n\n### [That the Real is the very essence of the servant's powers]\n\nAllah the Exalted said: <<Call upon Me; I will respond to you.>> And He said: <<Indeed, those who disdain My worship will enter Hell in humiliation.>> He described them as not escaping servitude (العبودية) and that abasement is their reality, which is His saying <<داخِرِينَ>> (in humiliation). So whoever does not wish to be My servant, as he is in reality (في نفس الأمر), will be a servant of Nature (الطبيعة), which is Hell, and will be abased under its dominion. This is because he is not as he is in reality, having abandoned Knowledge (العلم) and adopted ignorance (الجهل). If he had known, he would have been My servant and would not have called upon other than Me, just as he is, in reality, My servant, whether he likes it or dislikes it, and whether he is ignorant or knowledgeable.\n\nAnd when he is My servant by calling upon Me, and does not inwardly disdain being My servant in his own estimation, I grant him the disposal (التصريف) over Nature. Thus, he becomes its master and ruler, directing it and acting within it, and it becomes his servant. Look then at the glory (العز) and authority (السلطان) missed by the one who disdains My worship and does not call upon Me in prosperity or for the removal of harm. The causes (الأسباب) enslave him, and thus he is among the ignorant (الجاهلين).\n\nWhat confirms that the Real (الحق) is the very essence of the servant's powers (قوى العبد) is that the disposal belongs to him, because the servant is only directed by his powers, and he is only directed by the Real. Therefore, his powers are the very essence of the Real. Our proof for this is what the Messengers, peace be upon them, stated regarding this matter.\n\nMuhammad, peace and blessings be upon him, reported from Allah that He said: \"I was his hearing, his sight, and his hand.\" Meaning, when the servant draws near to Him through supererogatory acts (النوافل) until He loves him. He mentioned his powers that direct him. The confirmation of this saying descended in the Quran, which is His saying: <<And Allah created you and what you do.>> The action (العمل) does not belong to the human body merely as a body; rather, the action within it belongs to his powers. He has informed us that the action which appears from the human, and is attributed to him, is created by Allah. Thus, the Real is his powers.\n\nAs for Moses, he took the cosmos (العالم) in defining the quiddity (ماهية) of the Real when he called Pharaoh to Allah, the Lord of the Worlds. Pharaoh said to him: <<And what is the Lord of the Worlds?>> asking him about the quiddity. Moses, peace be upon him, replied to him: <<The Lord of the heavens and the earth and whatever is between them, if you would be certain.>> He means: if what the sound proof (الدليل) and correct contemplation (النظر الصحيح) provide concerning the indicator is established in your hearts. Thus, Moses, peace be upon him, took the cosmos in defining the quiddity of the Real, and the Messengers, in our view, are the most knowledgeable of creation concerning Allah.\n\nPharaoh then spoke, knowing that the truth was with Moses in his reply, but he sought to mislead the attendees and treat them lightly, because his question was posed in a manner that corresponded to the Real, which was his saying: <<And what is the Lord of the Worlds?>> He only asked by mentioning the worlds, so the answer corresponded to the question. Pharaoh said to his people: <<Do you not hear?>> I ask him about the quiddity, and he answers me with relational matters (الأمور الإضافية). Thus, he deceived them, though he had only asked about the Lord in relation (الرب المضاف). Moses then said to him: <<Your Lord and the Lord of your forefathers.>> He specified the relation due to Pharaoh's claim among his people that he was their supreme lord. Pharaoh said: <<Indeed, your messenger who has been sent to you is surely mad,>> meaning his intellect has been veiled from him, because a rational person does not ask about the quiddity of something and reply with such an answer. Moses then said to him, due to a contextual clue necessitated by the assembly, what Abraham, peace be upon him, said to Nimrod: <<The Lord of the East and the West and whatever is between them, if you would reason.>>\n\nHad he not said \"and whatever is between them\" here, it would have been permissible, because there is nothing between them. This is because the very state of rising (الشروق) in that domain is the very state of its culmination (استوائها), which is the very state of its setting (غروبها). Every single movement of it in one domain is rising, culmination, and setting. Thus, there is nothing there that necessitates saying \"and whatever is between them.\" However, he said \"and whatever is between them\" because of its obscurity to the attendees, for they do not know what we have detailed concerning the generality of \"and whatever is between them.\" So he presented the East and the West known in common usage, and then said to them: <<if you would reason,>> thereby referring them to rational contemplation (النظر العقلي). The Real was not known except through us, and Creation (الخلق) was not found except through Him.\n\nFrom Him to us, and from us to Him,\nSo He praises us, and we praise Him.\n\nLikewise, the mention of Abraham, peace be upon him, whom Allah mentioned that He gave him the argument (الحجة) against his people: <<I have turned my face toward He who originated the heavens and the earth.>> He only mentioned Him through the cosmos. The cosmos is outwardly Creation (خلق) and inwardly the Real (حق). It acts according to the ruling of its inward aspect. And nothing affects the disposal (التصرف) in its inward aspect except a disposal in the outward from the inward. Thus, nothing acts in its inward aspect, which is the Real, except the Real and nothing else. Therefore, His disposal is a ruling upon it by disposal.\n\nThe outward form (الصورة الظاهرة) is thus analogous to the inward form (الصورة الباطنة), to the extent that some theologians (المتكلمين) held, concerning the writing of the Quran and its originated recitation, that for every letter written by the scribe of the Quran, or recited by the reciter of the Quran—in that originated spoken or written letter—there is a corresponding letter that is eternal (قديم). They were compelled to this view by the fact that the originated (الحادث) cannot be independent in its existence (وجود), so the eternal must necessarily accompany it. This is the doctrine of a chief among the Mu'tazila. Furthermore, if this eternal entity were not in the form of that which emerged and appeared from it—which is the originated—then it would not belong to it. For this reason, the World (العالم) is in the form of the Real (الحق), and the Perfect Human (الإنسان الكامل) is in the form of the World and the form of the Real, which is His saying: \"Indeed, Allah created Adam upon His form.\"\n\nThere is nothing more wondrous or more perfect in possibility than this World, for if there were, there would be something in possibility more perfect than Allah. Since Adam, who is part of the World, was created by Allah upon His form, and nothing can be more perfect than the form of the Real, this is impossible. This is because the manifestation (ظهور) of the World from the Real is an essential manifestation (ظهور ذاتي). The Real is a mirror for the World, in which the forms of the World appeared. The possibles (الممكنات) saw themselves in the mirror of the Real's Existence (الوجود), so they depended upon Him for existence, and His Knowledge (العلم) of them depended upon His Knowledge of Himself.\n\nSo He was not except through them,\nAnd they were not except through Him.\n\nSo they have no likeness,\nAnd He has no likeness.\n\nO heedless one concerning our saying,\nBe through them, and you will be through Him.\n\nIf the matter is as we have mentioned, then whoever is just to himself and gives it its due right has only been just to the Real and given Him His due right, because he has singled out himself with what it deserves and singled out his Lord with what He deserves. And whoever is distinguished from something is neither its essence (عينه) nor its likeness in the aspect by which he is distinguished from it, but he is its likeness in the fact that he is distinguished. Understand this. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way). Pay attention to every poem (منظوم) at the beginning of every chapter (باب) of this book, for it contains the sciences (علوم) of that chapter to the extent that I intended to draw attention to them within it. You will find in the poetry what is not in the prose of that chapter, thereby increasing your knowledge of what I have mentioned in the poem. And <<عَلَى الله قَصْدُ السَّبِيلِ>> (upon Allah is the direction of the way).",
    "ur": "باب نمبر چار سو پندرہ: اس شخص کے مقام کی معرفت میں جس نے مجھے پکارا تو اس نے اپنی بندگی (العبودیۃ) کا حق ادا کیا، اور جس نے اپنے نفس کے ساتھ انصاف کیا تو اس نے میرے ساتھ انصاف کیا\n\nاگر تو نے اللہ کو اس کے حکم کے بغیر پکارا (إذا ما دعوت الله من غير أمره)\nتو تو نہ اس کا بندہ ہے اور نہ ہی بندے نے انصاف کیا (فلست له عبد أو ما أنصف العبد)\n\nاور تو خواہشات کا بندہ بن گیا، اور ہمارے لیے (تیرے ساتھ) (وأصبحت عبدا للحظوظ وما لنا)\nنہ کوئی وفا ہے اور نہ کوئی عہد، حالانکہ عہد ثابت ہو چکا ہے (وفاء ولا عهد وقد ثبت العهد)\n\nاور اگر بندے کا اپنے رب کے عہد پر قائم رہنا نہ ہوتا (ولو لا قيام العبد في عهد ربه)\nتو یہ بات صحیح نہ ہوتی: \"اپنے عہد پورے کرو\" (لما صح أَوْفُوا بِالْعُقُودِ ولا وعد)\n(قرآن: اے ایمان والو! اپنے عہد پورے کرو)\n\nاور قربت صرف اس تکلیف (ذمہ داری) کے سوا کچھ نہیں جو مخصوص ہے (وليس سوى التكليف قربا مخصصا)\nجسے ایک حکم متعین کرتا ہے اور ایک معاہدہ اسے ثابت کرتا ہے (يعينه أمر ويثبته عقد)\n\nاور ذات حق (الحق) کے حقوق ہر طرف سے ہم پر قائم ہو گئے (وقامت حقوق الحق من كل جانب)\nاور اگر قربت نہ ہوتی تو دوری (البعد) کی معرفت نہ ہوتی (علينا ولو لا القرب ما عرف البعد)\n\nپس جس نے کائناتوں کے ساتھ انصاف کیا، اس نے اپنے رب کے ساتھ انصاف کیا (فمن أنصف الأكوان أنصف ربه)\nاور اس کے لیے اپنے خالق کی ذات میں ہمیشگی (الخلد) ہے (وكان له في ذات خالقه الخلد)\n\nاور اس کے لیے قدیم اور جدید بزرگی (مجد) صحیح ہو گئی (وصح له مجد تليد وطارف)\nاور فرشتوں کے درمیان اس کے لیے حمد و ستائش ہے (وكان له بين الملائكة الحمد)\n\nخبردار! بندہ وہی ہے جو ہمیشہ (إلا إنما العبد الذي لم يزل به)\nاس کے ذریعے مرتا اور جیتا ہے، اور ٹھہرنا اس کے لیے حد ہے (يموت ويحيا والوقوف له حد)\n\nاور رحمن نے کسی نفس کو اس کے سوا مکلف نہیں کیا (وما كلف الرحمن نفسا سوى الذي)\nجس پر وہ قائم ہو سکے، پس کوشش کر، کیونکہ کوشش فائدہ دیتی ہے (تقوم به فاجهد فقد ينفع الجهد)\n\nپس جو رحمن کے ساتھ قائم ہوا، اس کے لیے عظمت (الجد) ہے (فمن قام بالرحمن كان له الجد)\nاور جو رحمن کے لیے قائم ہوا، اس کے لیے بھی عظمت (الجد) ہے (ومن قام للرحمن كان له الجد)\n\nاور وہ اپنی ذات کی آنکھ میں آیات کے ساتھ مخصوص کیا گیا (وخصص بالآيات في عين نفسه)\nاور اپنے آفاق میں، پس حمد کر اس حمد کے ساتھ جس کی حمد کی گئی (وآفاقه فاحمد بما حمد الحمد)\n\n***\n\n### [کہ ذات حق (الحق) بندے کی قوتوں کا عین ہے]\n\nاللہ تعالیٰ نے فرمایا: ادْعُونِي أَسْتَجِبْ لَكُمْ (مجھے پکارو، میں تمہاری دعا قبول کروں گا) اور فرمایا: إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبادَتِي سَيَدْخُلُونَ جَهَنَّمَ داخِرِينَ (بے شک جو لوگ میری عبادت (عبادت) سے تکبر کرتے ہیں، وہ عنقریب ذلیل ہو کر جہنم میں داخل ہوں گے)۔ پس اللہ نے انہیں اس طرح بیان کیا کہ وہ بندگی (العبودیۃ) سے باہر نہیں نکلتے اور یہ کہ ذلت ان کی حقیقت ہے، اور یہی اس کا قول ہے: داخِرِينَ (ذلیل ہو کر)۔ پس جو شخص یہ نہیں چاہتا کہ وہ میرا بندہ ہو جیسا کہ وہ نفس الامر میں ہے، تو وہ اس طبیعت کا بندہ ہو گا جو جہنم ہے، اور اس کے تسلط کے تحت ذلیل ہو گا، جیسا کہ وہ نفس الامر میں نہیں ہے۔ پس اس نے علم کو چھوڑ دیا اور جہالت سے متصف ہو گیا، اگر وہ جانتا تو میرا بندہ ہوتا اور میرے سوا کسی کو نہ پکارتا، جیسا کہ وہ نفس الامر میں میرا بندہ ہے، چاہے وہ پسند کرے یا ناپسند کرے، اور چاہے وہ جاہل ہو یا عالم۔ اور جب وہ مجھے پکارنے کے ذریعے میرا بندہ ہو گیا اور اپنے نفس میں یہ تکبر نہیں کیا کہ وہ اپنے نزدیک میرا بندہ ہو، تو میں اسے طبیعت میں تصرف (التصريف) عطا کروں گا، پس وہ اس کا اور اس پر آقا ہو گا، اور اس میں تصرف کرنے والا ہو گا، اور وہ (طبیعت) اس کی لونڈی ہو گی۔ پس دیکھو کہ جس نے میری عبادت (عبادت) سے تکبر کیا اور خوشحالی میں مجھے نہیں پکارا اور نہ ہی تکلیف دور کرنے کے لیے، اس نے عزت اور سلطنت میں سے کیا کھو دیا! اسباب نے اسے اپنا بندہ بنا لیا، پس وہ جاہلوں میں سے ہو گیا۔\n\nاور جو چیز اس بات کی تائید کرتی ہے کہ ذات حق (الحق) بندے کی قوتوں (قوی) کا عین ہے، تو تصرف (التصريف) اسی کے لیے ہے، کیونکہ بندے کو اس کی قوتوں کے سوا کوئی چیز متصرف نہیں کرتی، اور اسے ذات حق (الحق) کے سوا کوئی متصرف نہیں کرتا۔ پس اس کی قوتیں ذات حق (الحق) کا عین ہیں۔ ہماری دلیل وہ ہے جو رسولوں (سلام اللہ علیہم) نے اس بارے میں کہا ہے۔\n\nپس محمد صلی اللہ علیہ وسلم نے اللہ کی طرف سے خبر دی کہ اس نے فرمایا: \"میں اس کا کان، اس کی آنکھ اور اس کا ہاتھ بن جاتا ہوں\" (یعنی بندہ جب نوافل کے ذریعے اس کا قرب حاصل کرتا ہے یہاں تک کہ وہ اس سے محبت کرنے لگتا ہے)۔ اور اس نے ان قوتوں کا ذکر کیا جو اسے متصرف کرتی ہیں، اور قرآن میں اس قول کی تصدیق نازل ہوئی، اور وہ اس کا قول ہے: وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ (اور اللہ نے تمہیں اور تمہارے اعمال کو پیدا کیا)۔ اور عمل انسان کے جسم کے لیے نہیں ہے، اس حیثیت سے کہ وہ جسم ہے، بلکہ عمل اس میں اس کی قوتوں (قوی) کے لیے ہے۔ اور اس نے خبر دی کہ وہ عمل جو انسان سے ظاہر ہوتا ہے اور اس کی طرف منسوب کیا جاتا ہے، وہ اللہ کی تخلیق ہے۔ پس ذات حق (الحق) اس کی قوتیں ہیں۔\n\nاور جہاں تک موسیٰ علیہ السلام کا تعلق ہے، جب انہوں نے فرعون کو اللہ رب العالمین کی طرف بلایا تو انہوں نے ذات حق (الحق) کی ماہیت کے بارے میں عالم کو لے لیا۔ فرعون نے ان سے کہا: وَمَا رَبُّ الْعَالَمِينَ (رب العالمین کیا ہے؟) وہ اس سے ماہیت کے بارے میں پوچھ رہا تھا۔ موسیٰ علیہ السلام نے اسے جواب دیا: رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا إِنْ كُنْتُمْ مُوقِنِينَ (آسمانوں اور زمین کا اور جو کچھ ان کے درمیان ہے، ان سب کا رب ہے، اگر تم یقین کرنے والے ہو)۔ وہ کہہ رہے ہیں کہ اگر تمہارے دلوں میں وہ چیز ٹھہر جائے جو دلیل اور صحیح نظر، دال (دلالت کرنے والے) سے دیتی ہے۔ پس موسیٰ علیہ السلام نے ذات حق (الحق) کی ماہیت کی تعریف میں عالم کو لے لیا، اور ہمارے نزدیک رسول مخلوق میں اللہ کو سب سے زیادہ جاننے والے ہیں۔\n\nفرعون نے کہا، حالانکہ وہ جانتا تھا کہ موسیٰ کے ساتھ حق ہے جو انہوں نے جواب دیا، لیکن اس نے حاضرین کو وہم میں ڈالا اور انہیں ہلکا سمجھا، کیونکہ اس کا سوال اسی چیز کے مطابق تھا جو حق تھا، اور وہ اس کا قول ہے: وَمَا رَبُّ الْعَالَمِينَ (رب العالمین کیا ہے؟) اس نے صرف عالمین کے ذکر کے ساتھ سوال کیا، تو جواب سوال کے مطابق آیا۔ فرعون نے اپنی قوم سے کہا: أَ لَا تَسْتَمِعُونَ (کیا تم سنتے نہیں ہو؟) میں اس سے ماہیت کے بارے میں پوچھتا ہوں تو وہ مجھے اضافی امور سے جواب دیتا ہے۔ پس اس نے ان کے ساتھ مغالطہ کیا، حالانکہ اس نے صرف مضاف رب کے بارے میں سوال کیا تھا۔\n\nموسیٰ نے اسے جواب دیا: رَبُّكُمْ وَرَبُّ آبَائِكُمُ الْأَوَّلِينَ (تمہارا رب اور تمہارے پہلے باپ دادا کا رب)۔ پس انہوں نے اضافت کو مخصوص کر دیا، کیونکہ فرعون اپنی قوم میں یہ دعویٰ کرتا تھا کہ وہ ان کا رب اعلیٰ ہے۔ فرعون نے کہا: إِنَّ رَسُولَكُمُ الَّذِي أُرْسِلَ إِلَيْكُمْ لَمَجْنُونٌ (بے شک تمہارا وہ رسول جو تمہاری طرف بھیجا گیا ہے، یقیناً دیوانہ ہے)۔ یعنی اس کی عقل اس سے چھپ گئی ہے، کیونکہ عقل مند شخص کسی چیز کی ماہیت کے بارے میں سوال نہیں کرتا اور اس طرح کا جواب دیتا ہے۔\n\nموسیٰ نے اسے اس مجلس کے تقاضے کے مطابق کہا جو ابراہیم علیہ السلام نے نمرود سے کہا تھا: رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ وَمَا بَيْنَهُما إِنْ كُنْتُمْ تَعْقِلُونَ (مشرق اور مغرب کا رب اور جو کچھ ان کے درمیان ہے، اگر تم عقل رکھتے ہو)۔ اور اگر وہ یہاں \"وما بینهما\" (اور جو کچھ ان کے درمیان ہے) نہ کہتے تو بھی جائز تھا، کیونکہ ان کے درمیان کوئی چیز نہیں ہے۔ اور یہ اس لیے کہ اس حیز (جگہ) میں طلوع (شروق) کی حالت کا عین ہی اس کے استواء کا عین ہے، جو اس کے غروب کا عین ہے۔ پس ان میں سے ہر ایک حرکت ایک ہی حیز میں طلوع، استواء اور غروب ہے۔ پس وہاں کوئی ایسی چیز نہیں ہے جس کے بارے میں کہا جائے کہ \"جو کچھ ان کے درمیان ہے\"۔ لیکن انہوں نے \"وما بینهما\" کہا تاکہ حاضرین پر یہ بات پوشیدہ رہے، کیونکہ وہ اس تفصیل کو نہیں جانتے جو ہم نے \"وما بینهما\" کے اجمال میں بیان کی ہے۔ پس وہ مشرق اور مغرب کو لائے جو عرف میں معروف ہیں، پھر ان سے کہا: إِنْ كُنْتُمْ تَعْقِلُونَ (اگر تم عقل رکھتے ہو)۔ پس انہوں نے انہیں عقلی نظر پر حوالہ کر دیا۔\n\nپس ذات حق (الحق) کی معرفت صرف ہمارے ذریعے ہوئی، اور مخلوق کا وجود صرف اس کے ذریعے ہوا۔\n\nپس اسی کی طرف سے ہماری طرف، اور ہماری طرف سے اس کی طرف (فمنه إلينا ومنا إليه)\nپس وہ ہم پر ثنا کرتا ہے اور ہم اس پر ثنا کرتے ہیں (فيثني علينا ونثني عليه)\n\nاور اسی طرح ابراہیم علیہ السلام کا ذکر ہے، جن کے بارے میں اللہ نے ذکر کیا کہ اس نے انہیں ان کی قوم پر حجت عطا کی: وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَالْأَرْضَ (میں نے اپنا رخ اس ذات کی طرف کر لیا جس نے آسمانوں اور زمین کو پیدا کیا)۔ پس انہوں نے اس کا ذکر صرف عالم (کائنات) کے ساتھ کیا۔ پس عالم کا ظاہر خلق (مخلوق) ہے اور اس کا باطن حق (ذات حق) ہے۔ اور جو اس کے باطن کے حکم سے متصرف ہوتا ہے، اور اس کے باطن میں تصرف صرف باطن سے ظاہر میں تصرف کے ذریعے ہی مؤثر ہوتا ہے۔ پس اس کے باطن میں جو کہ ذات حق (الحق) ہے، ذات حق (الحق) کے سوا کسی نے تصرف نہیں کیا، پس اس کا تصرف اس پر تصرف کا حکم ہے۔\n\nپس ظاہری صورت باطنی صورت کے مماثل ہے، یہاں تک کہ بعض متکلمین قرآن کی کتابت اور اس کی حادث تلاوت کے بارے میں اس طرف گئے ہیں کہ قرآن کے ہر حرف کے لیے جسے کاتب لکھتا ہے یا تلاوت کرنے والا تلاوت کرتا ہے، اس منطوق حادث یا مکتوب حرف میں اس جیسا ایک حرف ہے جو قدیم ہے۔ اور اس بات نے انہیں مجبور کیا کہ حادث اپنے وجود میں خود مختار نہیں ہوتا، لہٰذا قدیم کا اس کے ساتھ ہونا ضروری ہے۔ اور یہ معتزلہ کے ایک بڑے رئیس کا مذہب ہے۔ پھر اگر یہ قدیم اس صورت پر نہ ہو جو اس سے نکلی اور ظاہر ہوئی، یعنی حادث، تو وہ اس کے لیے نہیں ہے۔ اور اسی وجہ سے عالم ذات حق (الحق) کی صورت پر تھا، اور انسان کامل (الإنسان الکامل) عالم کی صورت اور ذات حق (الحق) کی صورت پر تھا، اور یہی اس کا قول ہے: إِنَّ اللَّهَ خَلَقَ آدَمَ عَلَى صُورَتِهِ (بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا)۔\n\nپس امکان میں اس عالم سے زیادہ حسین اور کامل کوئی چیز نہیں ہے، کیونکہ اگر ہوتی تو امکان میں وہ چیز ہوتی جو اللہ سے زیادہ کامل ہوتی، کیونکہ آدم جو عالم میں سے ہے، اللہ نے اسے اپنی صورت پر پیدا کیا ہے، اور ذات حق (الحق) کی صورت سے زیادہ کامل نہیں ہو سکتا۔ اور یہ اس لیے ہے کہ عالم کا حق سے ظہور ذاتی ظہور ہے۔ پس ذات حق (الحق) عالم کے لیے ایک آئینہ ہے، جس میں عالم کی صورتیں ظاہر ہوئیں، پس ممکنات نے اپنے آپ کو ذات حق (الحق) کی ہستی (الوجود) کے آئینے میں دیکھا، اور وجود میں اس پر موقوف ہو گئیں، اور اس کی معرفت (المعرفۃ) میں ان کی معرفت پر موقوف ہو گئیں۔\n\nپس وہ ان کے بغیر نہ تھا (فلم يكن إلا بها)\nاور وہ اس کے بغیر نہ تھیں (ولم تكن إلا به)\n\nپس ان کے لیے کوئی مشابہ نہیں (فما لها من مشبه)\nاور اس کے لیے کوئی مشابہ نہیں (وما له من مشبه)\n\nاے ہمارے قول سے غافل! (يا غافلا عن قولنا)\nپس تو ان کے ساتھ ہو جا، تو اس کے ساتھ ہو جائے گا (فكن بها تكن به)\n\nپس جب معاملہ ایسا ہے جیسا کہ ہم نے ذکر کیا، تو جس نے اپنے نفس کے ساتھ انصاف کیا اور اسے اس کا حق دیا، تو اس نے ذات حق (الحق) کے ساتھ انصاف کیا اور اسے اس کا حق دیا، کیونکہ اس نے اپنے نفس کو اس چیز کے ساتھ منفرد کیا جس کا وہ مستحق ہے، اور اپنے رب کو اس چیز کے ساتھ منفرد کیا جس کا وہ مستحق ہے۔ اور جو کسی چیز سے ممتاز ہو جائے تو وہ نہ اس کا عین ہوتا ہے اور نہ ہی اس کی مثل ہوتا ہے اس چیز میں جس کے ذریعے وہ اس سے ممتاز ہوتا ہے، لیکن وہ اس کی مثل ہوتا ہے اس اعتبار سے کہ وہ ممتاز ہوا۔ پس سمجھو۔ اور وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔ اور اس کتاب کے ہر باب کے شروع میں ہر منظوم (شعر) پر اپنی توجہ مرکوز رکھو، کیونکہ وہ اس باب کے علوم میں سے اتنا کچھ شامل کرتا ہے جتنا میں نے اس میں تنبیہ کرنا چاہا ہے۔ تم نظم میں وہ چیز پاؤ گے جو اس باب کے کلام میں نہیں ہے، پس تم اس علم میں اضافہ کرو گے جو میں نے نظم میں ذکر کیا ہے۔ وَعَلَى اللَّهِ قَصْدُ السَّبِيلِ (اور سیدھے راستے کی رہنمائی اللہ کے ذمہ ہے)۔",
    "fa": "باب چهارصد و پانزدهم: در معرفت جایگاه کسی که مرا خواند، پس حق عبودیت خود را ادا کرده است، و کسی که با نفس خود انصاف ورزید، با من انصاف ورزیده است.\n\nاگر خدا را بدون امر او بخوانی\nنه بنده او هستی و نه بنده انصاف ورزیده است\n\nو بنده بخت‌ها (حظوظ) شده‌ای و ما را\nوفایی و عهدی نیست، در حالی که عهد ثابت شده است\n\nو اگر قیام بنده در عهد پروردگارش نبود\n«أَوْفُوا بِالْعُقُودِ» (به پیمان‌ها وفا کنید) و هیچ وعده‌ای صحیح نمی‌شد\n\nو جز تکلیف، قرب (نزدیکی) خاصی نیست\nکه امری آن را تعیین می‌کند و عقدی آن را ثابت می‌سازد\n\nو حقوق حق (الحق) از هر سو\nبر ما قائم شد، و اگر قرب (نزدیکی) نبود، بُعد (دوری) شناخته نمی‌شد\n\nپس هر که با اکوان (موجودات) انصاف ورزد، با پروردگارش انصاف ورزیده\nو برای او در ذات خالقش جاودانگی (الخلد) است\n\nو برای او مجد دیرینه و تازه صحیح می‌شود\nو برای او در میان فرشتگان ستایش (الحمد) است\n\nآگاه باش که بنده کسی است که پیوسته به واسطه او\nمی‌میرد و زنده می‌شود و وقوف (ایستادن) برای او حد است\n\nو خداوند رحمان هیچ نفسی را مکلف نکرد جز به آنچه\nکه توان انجامش را دارد، پس بکوش که کوشش سودمند است\n\nپس هر که به واسطه رحمان قیام کند، برای او جدّ (عظمت) است\nو هر که برای رحمان قیام کند، برای او جدّ (کوشش) است\n\nو به آیات در عین نفس خود\nو آفاقش اختصاص یافت، پس ستایش کن به آنچه ستایش، ستایش شده است\n\n### [حق (الحق) عین قوای بنده است]\n\nخداوند متعال فرمود: «ادْعُونِي أَسْتَجِبْ لَكُمْ» (مرا بخوانید تا شما را اجابت کنم) و فرمود: «إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبادَتِي سَيَدْخُلُونَ جَهَنَّمَ داخِرِينَ» (همانا کسانی که از عبادت من تکبر می‌ورزند، به زودی با خواری وارد جهنم خواهند شد). پس آنان را چنین وصف کرد که از عبودیت خارج نمی‌شوند و ذلت حقیقت (حقيقة) آنهاست، و این همان قول اوست: «داخِرِينَ» (با خواری). پس هر کس نخواهد بنده من باشد، چنانکه در نفس‌الامر (نفس الأمر) هست، بنده طبیعت خواهد بود که همان جهنم است و تحت سلطه آن خوار می‌شود، چنانکه او در نفس‌الامر نیست. پس علم را ترک کرده و به جهل متصف شده است. اگر می‌دانست، بنده من بود و غیر مرا نمی‌خواند، چنانکه در نفس‌الامر (نفس الأمر) بنده من است، چه دوست داشته باشد چه کراهت، و چه جاهل باشد چه عالم. و چون با خواندن من، بنده من باشد و در نفس خود تکبر نورزد که بنده من باشد، به او تصرف (التصريف) در طبیعت را عطا می‌کنم، پس او سرور و حاکم بر آن می‌شود و آن را به کار می‌گیرد و در آن تصرف می‌کند و طبیعت بنده او خواهد بود. پس بنگر که چه عزّت و سلطانی از دست کسی رفت که از عبادت من تکبر ورزید و مرا در آسایش و هنگام برطرف شدن سختی نخواند؛ اسباب او را به بندگی گرفتند و او از جاهلان شد.\n\nو از جمله آنچه تأیید می‌کند که حق (الحق) عین قوای بنده است، این است که تصرف (التصريف) از آنِ اوست، زیرا بنده را جز قوای او به کار نمی‌گیرد و او را جز حق (الحق) به کار نمی‌گیرد، پس قوای او عین حق (الحق) است. دلیل ما بر این، چیزی است که رسولان (سلام الله علیهم) در این باره گفته‌اند.\n\nپس محمد (صَلَّى اللهُ عَليهِ وسَلَّم) از جانب خداوند خبر داد که فرمود: «گوش و چشم و دست او بودم.» یعنی بنده چون با نوافل به او تقرب جوید تا جایی که او را دوست بدارد. و قوای او را که او را به کار می‌گیرد، ذکر کرد. و در قرآن تصدیق این قول نازل شده است، و آن قول خداوند است: «والله خَلَقَكُمْ وما تَعْمَلُونَ» (و خداوند شما و آنچه را که عمل می‌کنید، آفریده است). و عمل برای جسم انسان به اعتبار جسم بودنش نیست، بلکه عمل در آن برای قوای اوست. و خبر داده است که عملی که از انسان ظاهر می‌شود و به او نسبت داده می‌شود، مخلوق خداست. پس حق (الحق) قوای اوست.\n\nو اما موسی (علیه السلام)، هنگامی که فرعون را به سوی خداوند، پروردگار جهانیان، دعوت کرد، عالم را در ماهیت حق (الحق) گرفت. فرعون به او گفت: «وما رَبُّ الْعالَمِينَ» (و پروردگار جهانیان چیست؟) و از ماهیت سؤال کرد. موسی (علیه السلام) به او گفت: «رَبُّ السَّماواتِ والْأَرْضِ وما بَيْنَهُمَا إِنْ كُنْتُمْ مُوقِنِينَ» (پروردگار آسمان‌ها و زمین و آنچه میان آنهاست، اگر یقین دارید). یعنی اگر آنچه دلیل و نظر صحیح از دال (راهنما) به شما می‌دهد، در قلب‌هایتان مستقر شود. پس موسی (علیه السلام) عالم را در تعریف ماهیت حق (الحق) گرفت، و رسولان نزد ما داناترین خلق به خداوند هستند.\n\nپس فرعون گفت، در حالی که می‌دانست حق (الحق) با موسی در پاسخی است که داده است، اما خواست حاضران را به وهم اندازد و سبک شمارد، زیرا سؤال او تنها با آنچه حق (الحق) با آن مطابقت داشت، واقع شد، و آن قول او بود: «وما رَبُّ الْعالَمِينَ». او جز با ذکر عالمیان سؤال نکرد، پس جواب با سؤال مطابقت داشت. فرعون به قومش گفت: «أَ لا تَسْتَمِعُونَ» (آیا نمی‌شنوید؟) از ماهیت می‌پرسم و او با امور اضافی به من پاسخ می‌دهد. پس با آنان مغالطه کرد، در حالی که او جز از ربّ مضاف (پروردگار نسبت داده شده) سؤال نکرده بود. موسی به او گفت: «رَبُّكُمْ ورَبُّ آبائِكُمُ الْأَوَّلِينَ» (پروردگار شما و پروردگار پدران پیشین شما). پس اضافه (نسبت) را به دلیل ادعای فرعون در میان قومش که او پروردگار برتر آنهاست، تخصیص داد. فرعون گفت: «إِنَّ رَسُولَكُمُ الَّذِي أُرْسِلَ إِلَيْكُمْ لَمَجْنُونٌ» (همانا رسول شما که به سوی شما فرستاده شده، دیوانه است). یعنی عقلش از او پوشیده شده است، زیرا عاقل از ماهیت چیزی سؤال نمی‌کند و با چنین پاسخی جواب نمی‌دهد. موسی به دلیل قرینه‌ای که حال مجلس اقتضا می‌کرد، آنچه را که ابراهیم (علیه السلام) به نمرود گفت، بیان کرد: «رَبُّ الْمَشْرِقِ والْمَغْرِبِ وما بَيْنَهُما إِنْ كُنْتُمْ تَعْقِلُونَ» (پروردگار مشرق و مغرب و آنچه میان آنهاست، اگر تعقل کنید). و اگر در اینجا «و ما بینهما» (و آنچه میان آنهاست) را نمی‌گفت، جایز بود، زیرا چیزی میان آنها نیست. و این بدان سبب است که عین حالت طلوع در آن حیز (مکان) عین استوای آن و عین غروب آن است. پس هر حرکت واحدی از آن در یک حیز، طلوع و استوا و غروب است. بنابراین، چیزی نیست که شایسته باشد گفته شود «ما بینهما». اما او «و ما بینهما» را گفت تا بر حاضران پوشیده بماند، زیرا آنان آنچه را که ما در اجمال «و ما بینهما» تفصیل دادیم، نمی‌دانند. پس مشرق و مغرب معروف در عرف را آورد، سپس به آنان گفت: «إِنْ كُنْتُمْ تَعْقِلُونَ» (اگر تعقل کنید). پس آنان را به نظر عقلی ارجاع داد. حق (الحق) جز به واسطه ما شناخته نشد و خلق جز به واسطه او موجود نشد.\n\nپس از او به سوی ما و از ما به سوی اوست\nاو ما را می‌ستاید و ما او را می‌ستاییم\n\nو همچنین ذکر ابراهیم (علیه السلام) که خداوند درباره او فرمود که حجت را بر قومش به او عطا کرد: «وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّماواتِ والْأَرْضَ» (روی خود را به سوی کسی گرداندم که آسمان‌ها و زمین را آفرید). پس او را جز به واسطه عالم ذکر نکرد. پس عالم، ظاهرش خلق و باطنش حق (الحق) است. و از حکم باطن خود تصرف می‌کند. و تصرف در باطن او تأثیر نمی‌گذارد، مگر تصرفی در ظاهر از باطن. پس در باطن او که حق (الحق) است، جز حق (الحق) تصرف نمی‌کند و بس. پس تصرف او، حکم بر او به تصریف است.\n\nپس صورت ظاهر مشابه صورت باطن است، تا جایی که برخی از متکلمان در مورد نوشتن قرآن و تلاوت حادث (محدثه) آن بر این عقیده‌اند که برای هر حرفی که کاتب از قرآن می‌نویسد یا تلاوت‌کننده از قرآن می‌خواند، در آن حرف ملفوظ حادث یا مکتوب، حرفی مشابه آن وجود دارد که قدیم است. و آنچه او را به این امر واداشته، این است که حادث (محدث) در هستی (الوجود) خود مستقل نیست، پس ناگزیر باید قدیم (القديم) همراه آن باشد. و این مذهب یکی از رؤسای معتزله است. سپس، اگر این قدیم (القديم) بر صورت آنچه از آن خارج شده و ظاهر گشته که همان حادث است، نباشد، پس از آنِ او نیست. و به همین دلیل، عالم بر صورت حق (الحق) بود و انسان کامل (الإنسان الکامل) بر صورت عالم و صورت حق (الحق) بود، و این همان قول اوست: «إن الله خلق آدم على صورته» (همانا خداوند آدم را بر صورت خود آفرید).\n\nپس در امکان، بدیع‌تر و کامل‌تر از این عالم نیست، زیرا اگر بود، در امکان چیزی کامل‌تر از خداوند وجود داشت. چرا که آدم که از عالم است، خداوند او را بر صورت خود آفرید، و کامل‌تر از صورت حق (الحق) وجود ندارد. و این بدان سبب است که ظهور عالم از حق (الحق)، ظهور ذاتی است. پس حق (الحق) آینه‌ای برای عالم است که صورت‌های عالم در آن ظاهر شد. پس ممکنات خود را در آینه حق (الحق) هستی (الوجود) دیدند. پس در هستی (الوجود) بر او توقف کردند و در علم به او بر علم به خودشان توقف کردند.\n\nپس او جز به واسطه آنها نبود\nو آنها جز به واسطه او نبودند\n\nپس برای آنها هیچ شبیهی نیست\nو برای او هیچ شبیهی نیست\n\nای غافل از سخن ما\nبه واسطه آنها باش تا به واسطه او باشی\n\nپس اگر امر چنان است که ذکر کردیم، هر کس با نفس خود انصاف ورزد و حقش را به آن بدهد، در واقع با حق (الحق) انصاف ورزیده و حقش را به او داده است، زیرا نفس خود را به آنچه شایسته آن است، اختصاص داده و پروردگارش را به آنچه شایسته آن است، اختصاص داده است. و هر کس از چیزی متمایز شود، در آنچه به واسطه آن از آن متمایز می‌شود، نه عین آن است و نه مثل آن، اما در اینکه متمایز شده، مثل آن است. پس بفهم. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند). و توجه خود را به هر منظومه‌ای که در ابتدای هر باب از ابواب این کتاب آمده است، معطوف دار، زیرا آن منظومه به اندازه‌ای که خواستم در آن باب به علوم آن تنبه دهم، در بردارنده آن علوم است. در نظم چیزی را می‌یابی که در کلام آن باب نیست، پس بر علم خود به آنچه در نظم ذکر کرده‌ام، می‌افزایی. و «عَلَى الله قَصْدُ السَّبِيلِ» (و بر خداوند است که راه را راست گرداند)."
  },
  "page_count": 2
}