{
  "id": 451,
  "title": {
    "ar": "الباب الحادي والخمسون وأربعمائة في معرفة منازلة في المخارج معرفة المعارج",
    "en": "Chapter Four Hundred and Fifty-One: Concerning the Knowledge (معرفة) of his Stations (منازلة) in the Exits (المخارج) and the Knowledge of the Ascensions (المعارج)",
    "ur": "باب چار سو اکاون: مخارج (Makhārij) میں اس کی منازل (Manāzil) کی معرفت (Ma'rifa) اور معارج (Ma'ārij) کی معرفت (Ma'rifa) کے بیان میں۔",
    "fa": "باب چهارصد و پنجاه و یکم در شناخت منازل سالک در خروج‌ها و شناخت معراج‌ها."
  },
  "content": {
    "ar": "## «الباب الحادي والخمسون وأربعمائة في معرفة منازلة في المخارج معرفة المعارج»\n\n\n> لو لا وجود الكون في المعارج *** ما لاح عين الحرف بالمخارج‏\n\n\n> أخرجه ضرب مثال للذي *** قد ارتقى في رتب المعارج‏\n\n\n> فالنفس الدارج في طريقه *** يبين عن منازل المدارج‏\n\n\nقال الله تعالى تَعْرُجُ الْمَلائِكَةُ والرُّوحُ إِلَيْهِ وقال تعالى إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وقال تعالى رَفِيعُ الدَّرَجاتِ ذُو الْعَرْشِ‏\n\n\n### [إن كلمات الله التي لا تنفد]\n\n\nاعلم أن الممكنات هي كلمات الله التي لا تنفدوا بها يظهر سلطانها الذي لا يبعد وهي مركبات لأنها أتت للافادة فصدرت عن تركيب يعبر عنه في اللسان العربي بلفظة كُنْ فلا يتكون عنه إلا مركب من روح وصورة ثم تلتحم الصور بعضها ببعض لما بينهما من المناسبات فتحدث المعاني فينا بحدوث تأليفها الوضعي وما وقع فيها الوضع في الصور المخصوصة إلا لذاتها لا بحكم الإنفاق ولا بحكم الاختيار لأنها بأعيانها أعطت العلم الذي لا يتحول والقول الذي لا يتبدل والمشيئة الماضية فهي في الشهادة بحسب ما هي عليه في الغيب فهي في الغيب بصورة كل ما تتقلب إليه في الظاهر مما لا نهاية له في الغيب من التقليب وهو في الظاهر يبدو مع الآيات إذ لا يصح دخول ما لا يتناهى في الوجود لأن ما لا يتناهى لا ينقضي فلا يقف عند حد والمادة التي ظهرت فيها كلمات الله التي هي العالم هي نفس الرحمن ولهذا عبر عنه بالكلمات وقيل في عيسى عليه السلام إنه كلمة الله‏\n\n\n### [الأرواح النورية والنارية والترابية]\n\n\nثم اعلم أن الله تعالى لما أظهر من كلماته ما أظهر قدر لهم من المراتب ما قدر فمنهم الأرواح النورية والنارية والترابية وهم على مراتب مختلفة وكلهم أوقفهم مع نفوسهم وأشهدهم إياها واحتجب لهم فيها ثم طلب منهم أن يطلبوه ونصب لهم معارج يعرجون عليها في طلبها إياه فدخل لهم بهذه المعارج في حكم الحد وجعل لهم قلوبا يعقلون بها ولبعضهم فكرا\nيتفكرون به ثم جعل من معارجهم نفي المثلية عنه من جميع الوجوه ثم تشبه لهم بهم فأثبت عين ما نفى ثم نصب لهم الدلالة على صدق خبره إذا أخبرهم فتفاضلت أفهامهم لتفاضل حقائقهم في نشأتهم فكل طائفة سلكت فيه مسالك ما خرجت فيها عما هي عليه فلم يجدوا في انتهاء طلبهم إياه غير نفوسهم فمنهم من قال بأنه هو ومنهم من قال بالعجز عن ذلك وقال لم يكن المطلوب منا إلا أن نعلم أنه لا يعلم فهذا معنى العجز ومنهم من قال يعلم من وجه ويعجز عن العلم به من وجه ومنهم من قال كل طائفة مصيبة فيما ذهبت إليه وأنه الحق سواء سعد أو شقي فإن السعادة والشقاء من جملة النسب المضافة إلى الخلق كما نعلم أن الحق والصدق نسبتان محمودتان ومع هذا فلها مواطن تذم فيه شرعا وعقلا فما ثم شي‏ء لنفسه وما ثم شي‏ء إلا لنفسه وبالجملة فالخلق كله مرتبط بالله ارتباط ممكن بواجب سواء عدم أو وجد وسعد أو شقي والحق من حيث أسماؤه مرتبط بالخلق فإن الأسماء الإلهية تطلب العالم طلبا ذاتيا فما في الوجود خروج عن التقييد من الطرفين فكما نحن به وله فهو بنا ولنا وإلا فليس لنا برب ولا خالق وهو ربنا وخالقنا فبنا لكونه به ولنا لكونه له إلا أن له الإمداد فينا الوجودي ولنا فيه الإمداد العلمي فتكليفه إيانا تكليف له فبنا تكلف للتكليف فما كلفنا سوانا ولكن به لا بنا فتداخلت المراتب فهو الرفيع الدرجات مع النزول الذاتي والخلق في النزول مع العروج والصعود الذاتي فما خرج موجود عن تأثير وجودي وعدمي ولا مؤثر في الحقيقة إلا النسب وهي أمور عدمية عليها روائح وجودية فالعدم لا يؤثر من غير أن تشم منه روائح الوجود والوجود لا أثر له إلا بنسبة عدمية فإذا ارتبط النقيضان وهما الوجود والعدم فارتباط الموجدين أقرب فما ثم إلا ارتباط والتفاف كما نبه تعالى والْتَفَّتِ السَّاقُ بِالسَّاقِ أي التف أمرنا بأمره وانعقد فلا ننحل عن عقده أبدا ولما تمم وهو الصادق بقوله إِلى‏ رَبِّكَ أثبت وجود رتبته بك يَوْمَئِذٍ يعني يوم يكشف عن الساق الْمَساقُ رجوع الكل إليه من سعد أو من شقي أو من تعب أو من استراح‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم في الدجال إن جنته نار وناره جنة\n\n\nفأثبت الأمرين ولم يزلهما فالجنة جنة ثابتة والنار نار ثابتة والصور الظاهرة لرأي العين قد تكون مطابقة لما هو الأمر عليه في نفسه وقد لا تكون وعلى كل حال فهما أمران لا بد منهما خيالا كان أو غير خيال وإذا ارتبط الأمران كما قلنا هذا الارتباط فلا بد من جامع بينهما وهو الرابط وليس إلا ما تقتضيه ذات كل واحد منهما لا يحتاج إلى أمر وجودي زائد فارتبطا لا نفسهما لأنه ما ثم إلا خلق وحق فلا بد أن يكون الرابط أحدهما أو كلاهما ومن المحال أن ينفرد واحد منهما بهذا الحكم دون الآخر لأنه لا بد أن يكونا عليه من قبول هذا الارتباط فبهما يظهر لا بواحد منهما ومع هذا الارتباط فما هما مثلان بل كل واحد منهما ليس مثله شي‏ء فلا بد أن يتميزا بأمر آخر ليس في واحد منهما أمر الآخر به يشار إلى كل واحد منهما فالافتقار موجب للميل وقبول الحركة والغناء ليس حكمه ذلك في الغني فإنا نعلم أن بين المغناطيس والحديد مناسبة وارتباط لا بد منه كارتباط الخلق والخالق ولكن إذا مسكنا المغناطيس جذب الحديد إليه فعلمنا إن في المغناطيس الجذب وفي الحديد القبول ولهذا انفعل بالحركة إليه وإذا مسكنا الحديد لم ينجذب إليه المغناطيس فهما وإن ارتبطا فقد افترقا وتميزا فالناس بل العالم فقراء إلى الله فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ‏\n\n\n> هكذا صورة الوجود *** فلا تلتفت إلى سواه‏\n\n\n> فبه كان شفعنا *** وهو الواحد الإله‏\n\n\nوالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 451: Concerning the Knowledge of Its Descent in the Articulations and the Knowledge of the Ascents\n\nWere it not for the existence of the Cosmos in the ascents (المعارج),\nThe essence (عين) of the letter (الحرف) would not have shone forth through the articulations (المخارج).\n\nHe brought it forth as an example for the one\nWho has ascended through the degrees of the ascents.\n\nThus, the soul (النفس) traversing its path\nReveals the stations (منازل) of the degrees.\n\nAllah the Exalted said: <<تَعْرُجُ الْمَلائِكَةُ والرُّوحُ إِلَيْهِ>> (The angels and the Spirit ascend unto Him) [Q 70:4]. And He said: <<إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ>> (Unto Him ascend the good words) [Q 35:10]. And He said: <<رَفِيعُ الدَّرَجاتِ ذُو الْعَرْشِ>> (Exalter of Ranks, Possessor of the Throne) [Q 40:15].\n\n### [Indeed, the Inexhaustible Words of Allah]\n\nKnow that the possibles (الممكنات) are the inexhaustible Words of Allah, and through them His irresistible sovereignty (سلطانها) is manifested. They are compounds (مركبات) because they came forth to convey meaning, originating from a composition (تركيب) expressed in the Arabic tongue by the word *Kun* (كُنْ - Be!). Nothing is formed from it except a compound of spirit (روح) and form (صورة). Then the forms adhere to one another due to the affinities (المناسبات) between them, and meanings arise within us through the occurrence of their conventional composition (تأليفها الوضعي).\n\nThe specific forms were assigned their position (الوضع) only due to their own essences (لذاتها), not by chance (الإنفاق) nor by choice (الاختيار), because they, by their immutable essences (أعيانها الثابتة), yielded the Knowledge (العلم) that does not change, the Word (القول) that does not alter, and the effective Will (المشيئة الماضية). Thus, they are in the realm of witnessing (الشهادة) according to what they are in the Unseen (الغيب). They are in the Unseen in the form of everything they turn into in the manifest realm, an endless turning over (التقليب) in the Unseen. This appears in the manifest realm along with the signs (الآيات), since the entry of the infinite into Existence (الوجود) is not valid, for that which is infinite does not cease and thus does not stop at a limit. The matter (المادة) in which the Words of Allah—which constitute the World (العالم)—appeared is the very Breath of the All-Merciful (نفس الرحمن). This is why they are referred to as Words (الكلمات), and why Jesus (peace be upon him) was called the Word of Allah.\n\n### [The Luminous, Fiery, and Earthly Spirits]\n\nThen know that when Allah the Exalted manifested what He manifested of His Words, He decreed for them the levels (المراتب) He decreed. Among them are the luminous spirits (الأرواح النورية), the fiery spirits (النارية), and the earthly spirits (الترابية). They are all at different levels, and He caused all of them to stand with their own souls (نفوسهم), made them witness their souls, and veiled Himself for them within those souls. Then He requested them to seek Him, and He established for them ascents (معارج) upon which they might ascend in their seeking of Him. By means of these ascents, He introduced them into the rule of limitation (الحد). He gave them hearts (قلوبا) by which they understand, and to some of them, intellects (فكرا) by which they reflect.\n\nThen He made one of their ascents the negation of likeness (نفي المثلية) to Him in all respects. Then He likened Himself to them (تشبه لهم بهم), thereby affirming the very essence (عين) of what He had negated. Then He established for them the proof (الدلالة) of the truth of His report when He informed them. Their understandings (أفهامهم) differed due to the differences in their realities (حقائقهم) in their origination (نشأتهم). Every group (طائفة) followed paths (مسالك) in this matter, yet they did not depart from what they inherently are. In the culmination of their seeking Him, they found nothing other than their own souls.\n\nThus, some of them claimed that He is the self, while others declared their inability (العجز) to attain this, saying: \"What was required of us was only to know that He cannot be known.\" This is the meaning of inability. Others said He is known from one perspective and unknowable from another. Still others said that every group is correct (مصيبة) in what it has concluded, and that this is the Truth (الحق), whether one is happy (سعد) or wretched (شقي). For happiness and wretchedness are among the relations (النسب) attributed to creation (الخلق). Just as we know that truthfulness (الحق) and veracity (الصدق) are praiseworthy relations, yet they have contexts where they are legally and rationally condemned. Therefore, nothing exists for itself, yet nothing exists except for itself.\n\nIn summary, the entire creation (الخلق) is linked to Allah by the linkage of the possible (ممكن) to the necessary (واجب), whether it is non-existent or existent, happy or wretched. The Real (الحق), in terms of His Names (أسماؤه), is linked to creation, for the Divine Names demand the World (العالم) by an essential demand (طلبا ذاتيا). There is no existence that escapes limitation (التقييد) from both sides. Just as He is by us and for us, so too are we by Him and for Him. Otherwise, He would not be our Lord (رب) or our Creator (خالق). He is our Lord and Creator, so He is by us because He is by Him, and He is for us because He is for Him. However, He has the existential sustenance (الإمداد الوجودي) in us, and we have the scientific sustenance (الإمداد العلمي) in Him. His imposition of duties (تكليفه إيانا) upon us is a duty upon Him, for by us He undertakes the duty (تكلف للتكليف). He did not impose duties upon anyone other than ourselves, but He did so by Him, not by us.\n\nThus, the levels (المراتب) interpenetrated. He is the Exalter of Ranks (الرفيع الدرجات) despite the essential descent (النزول الذاتي), and creation is in descent despite the essential ascent (العروج والصعود الذاتي). No existent thing has escaped the influence of existence (وجودي) or non-existence (عدمي). In reality, nothing influences except the relations (النسب), which are non-existent matters (أمور عدمية) bearing the scents of existence (روائح وجودية). Non-existence does not influence unless the scents of existence are perceived from it, and existence has no effect except through a non-existent relation. If the two opposites, existence (الوجود) and non-existence (العدم), are linked, then the linkage of the two originators (الموجدين) is closer. There is nothing but linkage and intertwining, as the Exalted warned: <<وَالْتَفَّتِ السَّاقُ بِالسَّاقِ>> (And the leg is intertwined with the leg) [Q 75:29], meaning: Our affair is intertwined with His affair and is bound, and we shall never be released from its bond. When He completed this, and He is truthful in His saying: <<إِلَى رَبِّكَ يَوْمَئِذٍ الْمَسَاقُ>> (To your Lord, that Day, is the driving) [Q 75:30], He affirmed the existence of His rank through you, meaning: the day the leg is uncovered, the driving (الْمَسَاقُ) is the return of all to Him, whether happy or wretched, weary or rested.\n\nThe Prophet (peace and blessings be upon him) said concerning the Dajjal (Antichrist): \"Indeed, his Paradise is a Fire, and his Fire is a Paradise.\" Thus, He affirmed both matters and did not remove them. Paradise is a fixed Paradise, and Fire is a fixed Fire. The forms apparent to the eye may correspond to the reality of the matter itself, or they may not. In any case, they are two necessary matters, whether they are Imagination (خيال) or otherwise.\n\nIf the two matters are linked, as we have said, by this linkage, there must be a connector (جامع) between them, which is the link (الرابط). This link is nothing other than what the Essence (الذات) of each one of them necessitates; it does not require an additional existent matter. They are linked not for themselves, because there is nothing but creation (خلق) and the Real (حق). Therefore, the link must be one of them or both of them. It is impossible for one of them to be singled out for this ruling without the other, because both must accept this linkage. It is manifested by both of them, not by one alone.\n\nDespite this linkage, they are not alike; rather, neither of them is like anything else. Therefore, they must be distinguished by another matter that is not present in either of them, by which each one is indicated. Need (الافتقار) necessitates inclination and the acceptance of movement, while richness (الغناء) does not have that ruling in the Rich One. We know that there is an affinity and necessary linkage between a magnet and iron, like the linkage between the creation and the Creator. However, if we hold the magnet, it attracts the iron to it, so we know that the magnet possesses attraction and the iron possesses acceptance. This is why the iron is affected by moving towards it. But if we hold the iron, the magnet is not attracted to it. Thus, although they are linked, they are separated and distinguished. Humanity, indeed the entire World (العالم), is poor toward Allah: <<فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ>> (Indeed, Allah is free from need of the worlds) [Q 3:97].\n\nSuch is the form of Existence (الوجود),\nSo do not turn to anything other than Him.\n\nFor by Him was our pairing (شفعنا),\nAnd He is the One God (الإله).\n\n<<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way) [Q 33:4].",
    "ur": "باب نمبر چار سو اکیاون، مخارج (المخارج) میں منازل کے علم اور معارج (المعارج) کے علم کے بیان میں۔\n\nاگر معارج (المعارج) میں کائنات (الکون) کا وجود نہ ہوتا\nتو مخارج (المخارج) کے ذریعے حرف کی اصل (عین الحرف) ظاہر نہ ہوتی۔\n\nاس نے اسے اس شخص کے لیے مثال کے طور پر نکالا\nجو معارج (المعارج) کے مراتب میں بلند ہوا ہے۔\n\nپس وہ نفس جو اپنے راستے پر چل رہا ہے\nوہ مدارج (المدارج) کی منازل کو واضح کرتا ہے۔\n\nاللہ تعالیٰ نے فرمایا: تَعْرُجُ الْمَلائِكَةُ والرُّوحُ إِلَيْهِ (فرشتے اور روح اس کی طرف چڑھتے ہیں)۔ اور فرمایا: إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ (اسی کی طرف پاکیزہ کلمات چڑھتے ہیں)۔ اور فرمایا: رَفِيعُ الدَّرَجاتِ ذُو الْعَرْشِ‏ (بلند درجات والا، عرش کا مالک ہے)۔\n\n### [اللہ کے وہ کلمات جو ختم نہیں ہوتے]\n\nجان لو کہ ممکنات (الممکنات) ہی اللہ کے وہ کلمات (کلمات اللہ) ہیں جو کبھی ختم نہیں ہوتے، اور ان کے ذریعے ہی اس کی وہ سلطنت ظاہر ہوتی ہے جو دور نہیں ہے۔ یہ مرکبات ہیں کیونکہ یہ افادہ (فائدہ پہنچانے) کے لیے آئے ہیں، لہٰذا یہ ایک ترکیب سے صادر ہوئے ہیں جسے عربی زبان میں لفظ \"کُنْ\" (ہو جا) سے تعبیر کیا جاتا ہے۔ پس اس سے روح اور صورت کا مرکب ہی وجود میں آتا ہے۔ پھر یہ صورتیں آپس میں ایک دوسرے سے مل جاتی ہیں کیونکہ ان کے درمیان مناسبتیں (المناسبات) پائی جاتی ہیں، چنانچہ ان کی وضعی تالیف کے وجود میں آنے سے ہم میں معانی پیدا ہوتے ہیں۔ اور مخصوص صورتوں میں یہ وضع (جگہ دینا) محض ان کی ذات کی وجہ سے واقع ہوئی ہے، نہ کہ اتفاق کے حکم سے اور نہ ہی اختیار کے حکم سے، کیونکہ انہوں نے اپنی ذاتوں کے ذریعے ہی وہ علم عطا کیا ہے جو تبدیل نہیں ہوتا، اور وہ قول عطا کیا ہے جو بدلتا نہیں، اور وہ مشیئت (ارادہ) عطا کی ہے جو نافذ ہو چکی ہے۔ پس وہ شہادت (الشهادة) میں اسی کے مطابق ہیں جو وہ غیب (الغیب) میں ہیں۔ لہٰذا وہ غیب میں ہر اس صورت میں ہیں جس کی طرف وہ ظاہر میں پلٹتے ہیں، اور غیب میں اس پلٹنے کی کوئی انتہا نہیں ہے۔ اور یہ ظاہر میں آیات (نشانات) کے ساتھ ظاہر ہوتا ہے، کیونکہ جو لامتناہی ہو اس کا وجود (الوجود) میں داخل ہونا درست نہیں، اس لیے کہ جو لامتناہی ہو وہ ختم نہیں ہوتا اور کسی حد پر نہیں ٹھہرتا۔ اور وہ مادہ جس میں اللہ کے کلمات (کلمات اللہ) یعنی عالم ظاہر ہوا ہے، وہ نفسِ رحمان (نفس الرحمن) ہے۔ اسی لیے اسے کلمات سے تعبیر کیا گیا ہے، اور عیسیٰ علیہ السلام کے بارے میں کہا گیا ہے کہ وہ کلمۃ اللہ (اللہ کا کلمہ) ہیں۔\n\n### [نوری، ناری اور ترابی ارواح]\n\nپھر جان لو کہ اللہ تعالیٰ نے جب اپنے کلمات (کلمات) میں سے جو کچھ ظاہر کرنا تھا وہ ظاہر کیا، تو ان کے لیے وہ مراتب (المراتب) مقرر کیے جو مقرر کرنے تھے۔ پس ان میں سے نوری ارواح (الأرواح النوریۃ)، ناری ارواح (الأرواح الناریۃ) اور ترابی ارواح (الأرواح الترابیۃ) ہیں۔ اور وہ مختلف مراتب پر ہیں۔ اور ان سب کو اللہ نے ان کے نفوس (نفوس) کے ساتھ ٹھہرایا، اور انہیں ان کا شہود (الشهود) کرایا، اور ان کے لیے ان میں پردہ ڈال دیا۔ پھر ان سے مطالبہ کیا کہ وہ اسے طلب کریں، اور ان کے لیے معارج (المعارج) نصب کیے جن پر چڑھ کر وہ اس کی طلب میں عروج کریں۔ پس ان معارج (المعارج) کے ذریعے وہ حد (الحد) کے حکم میں داخل ہو گئے، اور ان کے لیے ایسے دل بنائے جن سے وہ عقل کرتے ہیں، اور بعض کے لیے فکر بنائی جس سے وہ غور و فکر کرتے ہیں۔ پھر ان کے معارج (المعارج) میں سے یہ بنایا کہ وہ ہر لحاظ سے اس سے مماثلت (المثلیۃ) کی نفی کریں۔ پھر اس نے ان کے لیے ان سے تشبیہ اختیار کی، پس اس نے عین اسی چیز کو ثابت کر دیا جس کی نفی کی گئی تھی۔ پھر اس نے ان کے لیے اپنی خبر کی سچائی پر دلیل قائم کی جب اس نے انہیں خبر دی۔ پس ان کی پیدائش میں ان کی حقائق (حقائق) کے تفاوت کی وجہ سے ان کی سمجھوں میں فرق آ گیا۔ پس ہر گروہ نے اس میں ایسے راستے اختیار کیے جن میں وہ اس چیز سے باہر نہیں نکلے جو وہ خود ہیں۔ چنانچہ انہوں نے اس کی طلب کے اختتام پر اپنے نفوس (نفوس) کے سوا کچھ نہ پایا۔ پس ان میں سے بعض نے کہا کہ وہ (الحق) خود ہی ہے۔ اور بعض نے اس سے عاجزی کا اظہار کیا اور کہا کہ ہم سے مطلوب صرف یہ تھا کہ ہم یہ جان لیں کہ اسے نہیں جانا جا سکتا۔ پس یہی عاجزی کا معنی ہے۔ اور بعض نے کہا کہ اسے ایک پہلو سے جانا جا سکتا ہے اور ایک پہلو سے اس کے علم سے عاجز رہا جا سکتا ہے۔ اور بعض نے کہا کہ ہر گروہ اپنے مسلک میں حق پر ہے، اور وہ حق (الحق) ہے، خواہ وہ سعید ہو یا شقی۔ کیونکہ سعادت اور شقاوت ان نسبتوں میں سے ہیں جو مخلوق کی طرف منسوب کی جاتی ہیں، جیسا کہ ہم جانتے ہیں کہ حق اور صدق دو قابل تعریف نسبتیں ہیں، اس کے باوجود ان کے ایسے مقامات ہیں جہاں شرعاً اور عقلاً ان کی مذمت کی جاتی ہے۔ پس وہاں کوئی شے اپنی ذات کے لیے نہیں ہے، اور وہاں کوئی شے نہیں ہے مگر اپنی ذات کے لیے۔ خلاصہ یہ کہ تمام مخلوق اللہ کے ساتھ ممکن (ممکن) کا واجب (واجب) کے ساتھ ایسا تعلق رکھتی ہے، خواہ وہ معدوم ہو یا موجود، اور خواہ وہ سعید ہو یا شقی۔ اور حق (الحق) اپنے اسماء (الأسماء) کے لحاظ سے مخلوق کے ساتھ مربوط ہے، کیونکہ اسماء الٰہیہ (الأسماء الإلٰہیۃ) عالم کو ذاتی طلب کے ساتھ طلب کرتے ہیں۔ پس وجود (الوجود) میں دونوں طرف سے تقیید (پابندی) سے باہر نکلنا ممکن نہیں۔ پس جس طرح ہم اس کے ذریعے اور اس کے لیے ہیں، اسی طرح وہ ہمارے ذریعے اور ہمارے لیے ہے۔ ورنہ وہ ہمارا رب اور خالق نہیں، حالانکہ وہ ہمارا رب اور خالق ہے۔ پس وہ ہمارے ذریعے ہے کیونکہ وہ اس کے ذریعے ہے، اور وہ ہمارے لیے ہے کیونکہ وہ اس کے لیے ہے۔ مگر یہ کہ اس کے لیے ہم میں وجودی امداد (الإمداد الوجودی) ہے اور ہمارے لیے اس میں علمی امداد (الإمداد العلمی) ہے۔ پس اس کا ہمیں مکلف بنانا اس کے لیے تکلیف ہے۔ پس وہ ہمارے ذریعے تکلیف کے لیے مکلف ہوا ہے۔ اس نے ہمیں ہمارے سوا کسی کا مکلف نہیں بنایا، لیکن اس کے ذریعے، نہ کہ ہمارے ذریعے۔ پس مراتب (المراتب) آپس میں داخل ہو گئے ہیں۔ پس وہ ذاتی نزول کے ساتھ رفیع الدرجات (بلند درجات والا) ہے، اور مخلوق ذاتی عروج اور صعود کے ساتھ نزول میں ہے۔ پس کوئی موجود وجودی اور عدمی تاثیر سے باہر نہیں نکلا، اور حقیقت میں مؤثر صرف نسبتیں (النسب) ہیں، اور وہ عدمی امور ہیں جن پر وجودی خوشبوئیں ہیں۔ پس عدم (العدم) اس کے بغیر اثر نہیں کرتا کہ اس سے وجود (الوجود) کی خوشبوئیں سونگھی جائیں، اور وجود کا کوئی اثر نہیں مگر ایک عدمی نسبت کے ساتھ۔ پس جب دو متضاد چیزیں یعنی وجود اور عدم آپس میں مربوط ہو گئے، تو دو موجود کرنے والوں کا ربط زیادہ قریب ہے۔ پس وہاں ربط اور لپیٹنے کے سوا کچھ نہیں، جیسا کہ اللہ تعالیٰ نے تنبیہ فرمائی: وَالْتَفَّتِ السَّاقُ بِالسَّاقِ (اور پنڈلی پنڈلی سے لپٹ جائے گی) یعنی ہمارا معاملہ اس کے معاملے سے لپٹ گیا اور بندھ گیا، پس ہم اس کی گرہ سے کبھی نہیں کھلیں گے۔ اور جب اس نے اپنی بات کو مکمل کیا، اور وہ اپنے اس قول میں سچا ہے: إِلى‏ رَبِّكَ (اپنے رب کی طرف) تو اس نے تمہارے ذریعے اس کے مرتبے کے وجود کو ثابت کیا: يَوْمَئِذٍ الْمَساقُ (اس دن سب کو ہانکا جائے گا) یعنی جس دن پنڈلی کھولی جائے گی، سب کا لوٹنا اسی کی طرف ہو گا، خواہ وہ سعید ہو یا شقی، یا خواہ وہ تھکا ہو یا آرام پایا ہو۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے دجال کے بارے میں فرمایا: \"بے شک اس کی جنت آگ ہے اور اس کی آگ جنت ہے۔\"\n\nپس اس نے دونوں امور کو ثابت کیا اور انہیں زائل نہیں کیا۔ پس جنت ثابت شدہ جنت ہے اور آگ ثابت شدہ آگ ہے۔ اور آنکھوں کو نظر آنے والی ظاہری صورتیں کبھی تو اس امر کے مطابق ہوتی ہیں جو وہ اپنی ذات میں ہے اور کبھی نہیں ہوتیں۔ اور بہر حال، یہ دونوں ایسے امور ہیں جو ناگزیر ہیں، خواہ وہ خیال ہوں یا غیر خیال۔ اور جب یہ دونوں امور اس طرح مربوط ہو گئے جیسا کہ ہم نے کہا، تو ان کے درمیان ایک جامع (جمع کرنے والا) کا ہونا ضروری ہے، اور وہی رابط (جوڑنے والا) ہے۔ اور وہ صرف وہی ہے جو ان میں سے ہر ایک کی ذات کا تقاضا ہے، اسے کسی زائد وجودی امر کی ضرورت نہیں۔ پس وہ آپس میں مربوط ہوئے، نہ کہ خود ان کے لیے، کیونکہ وہاں مخلوق (خلق) اور حق (الحق) کے سوا کچھ نہیں۔ پس ضروری ہے کہ رابط ان میں سے کوئی ایک ہو یا دونوں ہوں۔ اور یہ محال ہے کہ ان میں سے کوئی ایک دوسرے کے بغیر اس حکم میں منفرد ہو، کیونکہ ضروری ہے کہ وہ دونوں اس ربط کو قبول کرنے والے ہوں۔ پس وہ ان دونوں کے ذریعے ظاہر ہوتا ہے، نہ کہ ان میں سے کسی ایک کے ذریعے۔ اور اس ربط کے باوجود وہ دونوں ایک دوسرے کی مثال نہیں ہیں، بلکہ ان میں سے ہر ایک کی کوئی مثال نہیں۔ پس ضروری ہے کہ وہ ایک دوسرے سے کسی ایسے امر کے ذریعے ممتاز ہوں جو ان میں سے کسی ایک میں دوسرے کا امر نہ ہو، جس کے ذریعے ان میں سے ہر ایک کی طرف اشارہ کیا جائے۔ پس افتقار (محتاجی) میلان اور حرکت کو قبول کرنے کا موجب ہے، اور غنا (بے نیازی) کا حکم غنی (بے نیاز) میں ایسا نہیں ہے۔ کیونکہ ہم جانتے ہیں کہ مقناطیس اور لوہے کے درمیان ایک مناسبت اور ربط ہے جو ناگزیر ہے، جیسے خالق اور مخلوق کا ربط، لیکن جب ہم مقناطیس کو پکڑتے ہیں تو وہ لوہے کو اپنی طرف کھینچتا ہے، پس ہم نے جانا کہ مقناطیس میں کشش ہے اور لوہے میں قبولیت، اور اسی لیے وہ اس کی طرف حرکت سے متاثر ہوا۔ اور جب ہم لوہے کو پکڑتے ہیں تو مقناطیس اس کی طرف نہیں کھنچتا۔ پس اگرچہ وہ مربوط ہیں، لیکن وہ جدا اور ممتاز ہیں۔ پس لوگ، بلکہ سارا عالم، اللہ کے محتاج ہیں، فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ (بے شک اللہ تمام جہانوں سے بے نیاز ہے)۔\n\nوجود (الوجود) کی صورت ایسی ہی ہے\nپس اس کے سوا کسی اور کی طرف متوجہ نہ ہو\n\nپس اسی کے ذریعے ہمارا شفع (جوڑا) تھا\nاور وہی اکیلا معبود ہے\n\nوَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب چهارصد و پنجاه و یکم: در معرفت منازل آن در مخارج و معرفت معارج (al-Ma'ārij)»\n\nاگر هستی (al-Wujūd) کائنات در معارج (al-Ma'ārij) نبود، *** عین حرف در مخارج (al-Makhārij) آشکار نمی‌شد.\nآن را مثالی برای کسی که *** در مراتب معارج (al-Ma'ārij) ارتقا یافته، بیرون آور.\nپس نفس سالکی که در راه است، *** از منازل مدارج (al-Madārij) پرده برمی‌دارد.\n\nخداوند متعال فرمود: «فرشتگان و روح به سوی او عروج می‌کنند.» (تَعْرُجُ الْمَلائِكَةُ والرُّوحُ إِلَيْهِ)\nو فرمود: «سخنان پاکیزه به سوی او بالا می‌رود.» (إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ)\nو فرمود: «بالابرنده درجات، صاحب عرش است.» (رَفِيعُ الدَّرَجاتِ ذُو الْعَرْشِ)\n\n### [کلمات خداوند که پایان نمی‌پذیرند]\n\nبدان که ممکنات (al-Mumkināt) همان کلمات خداوند هستند که پایان نمی‌پذیرند و به واسطه آنها سلطنت او که دور نیست، آشکار می‌شود. و آنها مرکباتی هستند، زیرا برای افاده (فایده‌رسانی) آمده‌اند و از ترکیبی صادر شده‌اند که در زبان عربی با لفظ «کُنْ» (باش) از آن تعبیر می‌شود. پس از آن جز مرکبی از روح و صورت پدید نمی‌آید. سپس صورت‌ها به دلیل مناسباتی که بینشان است، به یکدیگر می‌پیوندند و معانی در ما با حدوث تألیف وضعی آنها ایجاد می‌شود. و این وضع در صورت‌های مخصوصه جز به خاطر ذات آنها واقع نشده است، نه به حکم اتفاق و نه به حکم اختیار؛ زیرا آنها به عین خود، علمی را که دگرگون نمی‌شود، و قولی را که تبدیل نمی‌گردد، و مشیت نافذ را اعطا کرده‌اند. پس آنها در عالم شهادت (ظاهر) مطابق آنچه در غیب هستند، می‌باشند. و در غیب به صورت هر آنچه در ظاهر به آن دگرگون می‌شوند، وجود دارند؛ دگرگونی‌ای که در غیب بی‌نهایت است. و این (دگرگونی) در ظاهر همراه با آیات پدیدار می‌شود، زیرا ورود آنچه نامتناهی است در هستی (al-Wujūd) صحیح نیست، چرا که نامتناهی پایان نمی‌پذیرد و در حدی متوقف نمی‌شود. و ماده‌ای که کلمات خداوند (که همان عالم است) در آن ظاهر شده‌اند، نَفَس رحمان است. به همین دلیل از آن به کلمات تعبیر شده است و درباره عیسی (علیه السلام) گفته شده که او کلمة الله است.\n\n### [ارواح نوری، ناری و ترابی]\n\nسپس بدان که چون خداوند متعال آنچه را که از کلماتش آشکار کرد، مراتب و درجاتی را که مقدر کرده بود، برای آنها نیز مقدر ساخت. از جمله آنها ارواح نوری، ناری و ترابی هستند که در مراتب مختلف قرار دارند. خداوند همه آنها را با نفوسشان متوقف ساخت و آنها را شاهد (Shāhid) بر نفوسشان قرار داد و در آن نفوس برایشان محجوب شد. سپس از آنها خواست که او را طلب کنند و برایشان معارجی (al-Ma'ārij) برپا کرد تا در طلب او بر آنها عروج کنند. بدین ترتیب، با این معارج (al-Ma'ārij) در حکم حد (محدودیت) وارد شدند. و برایشان قلب‌هایی قرار داد که با آنها تعقل کنند و برای برخی از آنها فکری قرار داد که با آن تفکر کنند. سپس از جمله معارج (al-Ma'ārij) آنها، نفی مثلیت از او از جمیع وجوه قرار داد، سپس خود را به صورت آنها تشبیه کرد و عین آنچه را نفی کرده بودند، اثبات نمود. سپس برایشان دلالت بر صدق خبر خود را هنگامی که به آنها خبر می‌داد، برپا ساخت. پس فهم‌هایشان به دلیل تفاوت حقایقشان در نشأتشان متفاوت شد. هر طایفه‌ای در این راه مسالکی را پیمود که در آن از آنچه بر آن بودند، خارج نشدند. در نهایت طلب خود، جز نفوس خویش را نیافتند. پس برخی از آنها گفتند که او (حق) همان نفس است، و برخی دیگر به عجز از آن قائل شدند و گفتند: مطلوب از ما جز این نبوده که بدانیم او دانسته نمی‌شود؛ و این معنای عجز است. و برخی گفتند: از جهتی دانسته می‌شود و از جهتی از علم به او عاجز است. و برخی گفتند: هر طایفه‌ای در آنچه بدان رفته، بر صواب است و آن حق (al-Ḥaqq) است، چه سعادتمند باشد و چه شقاوتمند؛ زیرا سعادت و شقاوت از جمله نسبت‌هایی (al-Nisab) هستند که به خلق اضافه می‌شوند، همان‌طور که می‌دانیم حق و صدق دو نسبت ستوده هستند، با این حال، مواطنی دارند که شرعاً و عقلاً در آن مذمت می‌شوند. پس هیچ چیزی برای خودش نیست و هیچ چیزی نیست مگر برای خودش. به طور کلی، تمام خلق به خداوند مرتبط هستند، ارتباط ممکن (al-Mumkin) به واجب، چه معدوم باشد و چه موجود، و چه سعادتمند باشد و چه شقاوتمند. و حق (al-Ḥaqq) از حیث اسمائش به خلق مرتبط است، زیرا اسماء الهی ذاتاً طالب عالم هستند. پس در هستی (al-Wujūd) خروجی از تقیید از دو طرف وجود ندارد. همان‌طور که ما به واسطه او و برای او هستیم، او نیز به واسطه ما و برای ماست. وگرنه او برای ما پروردگار و خالق نیست، در حالی که او پروردگار و خالق ماست. پس او به واسطه ماست، چون به واسطه اوست؛ و برای ماست، چون برای اوست. جز اینکه او در ما امداد وجودی دارد و ما در او امداد علمی داریم. پس تکلیف او به ما، تکلیفی برای اوست. پس او به واسطه ما متکلف تکلیف شد. او ما را مکلف به غیر خود نکرد، بلکه به واسطه او (مکلف شدیم) نه به واسطه ما. پس مراتب در هم تنیده‌اند. اوست که رفیع الدرجات است با نزول ذاتی، و خلق در نزول هستند با عروج و صعود ذاتی. پس هیچ موجودی از تأثیر وجودی و عدمی خارج نشده است، و در حقیقت هیچ مؤثری جز نسبت‌ها (al-Nisab) نیستند، که آنها اموری عدمی هستند که بر آنها روایح وجودی (بوی‌های هستی) وجود دارد. پس عدم تأثیر نمی‌کند مگر اینکه روایح هستی (al-Wujūd) از آن استشمام شود، و هستی (al-Wujūd) اثری ندارد مگر به نسبت عدمی. پس هنگامی که دو نقیض، یعنی هستی (al-Wujūd) و عدم، به هم مرتبط شدند، ارتباط دو مُوجِد (ایجادکننده) نزدیک‌تر است. پس در آنجا جز ارتباط و التفات (پیچیدن) نیست، همان‌طور که خداوند متعال هشدار داد: «و ساق به ساق پیچیده شود.» (وَالْتَفَّتِ السَّاقُ بِالسَّاقِ) یعنی امر ما به امر او پیچیده شد و منعقد گشت، پس هرگز از عقد آن گشوده نمی‌شویم. و چون تمام کرد، و او در قولش صادق است: «به سوی پروردگارت» (إِلى‏ رَبِّكَ)، وجود رتبه خود را به واسطه تو اثبات کرد: «آن روز» (يَوْمَئِذٍ)، یعنی روزی که ساق آشکار شود، «بازگشت» (الْمَساقُ) بازگشت همه به سوی اوست، چه سعادتمند باشد و چه شقاوتمند، چه خسته باشد و چه آسوده.\n\nپیامبر (صلی الله علیه و سلم) درباره دجال فرمود: «همانا بهشت او آتش است و آتش او بهشت.»\n\nپس هر دو امر را اثبات کرد و آنها را از بین نبرد. پس بهشت، بهشت ثابت است و آتش، آتش ثابت. و صورت‌های ظاهری برای چشم بیننده ممکن است مطابق با آنچه امر در نفس خود بر آن است باشد و ممکن است نباشد. در هر حال، این دو امری هستند که ناگزیرند، چه خیال باشند و چه غیر خیال. و هنگامی که این دو امر، همان‌طور که گفتیم، این‌گونه مرتبط شدند، ناگزیر باید جامعی بین آنها باشد که همان رابط است. و آن رابط چیزی نیست جز آنچه ذات هر یک از آن دو اقتضا می‌کند و نیازی به امر وجودی (al-Wujūdī) زائد ندارد. پس آن دو به هم مرتبط شدند، نه به واسطه خودشان، زیرا در آنجا جز خلق و حق (al-Ḥaqq) نیست. پس ناگزیر باید رابط یکی از آن دو یا هر دوی آنها باشد. و محال است که یکی از آن دو بدون دیگری در این حکم منفرد شود، زیرا هر دو باید پذیرای این ارتباط باشند. پس این ارتباط به واسطه هر دوی آنها ظاهر می‌شود، نه به واسطه یکی از آنها. و با وجود این ارتباط، آن دو مثل یکدیگر نیستند، بلکه هیچ یک از آنها چیزی مانندش نیست. پس ناگزیر باید به امر دیگری متمایز شوند که امر دیگری در هیچ یک از آنها نیست و به واسطه آن به هر یک از آنها اشاره می‌شود. پس افتقار، موجب میل و پذیرش حرکت است، در حالی که غنا (بی‌نیازی) حکم آن در غنی چنین نیست. ما می‌دانیم که بین آهنربا و آهن مناسبت و ارتباطی ناگزیر وجود دارد، مانند ارتباط خلق و خالق. اما اگر آهنربا را بگیریم، آهن را به سوی خود جذب می‌کند. پس دانستیم که در آهنربا جذب و در آهن قبول وجود دارد و به همین دلیل آهن با حرکت به سوی آن منفعل می‌شود. اما اگر آهن را بگیریم، آهنربا به سوی آن جذب نمی‌شود. پس این دو، اگرچه مرتبط هستند، اما از هم جدا شده و متمایز گشته‌اند. پس مردم، بلکه تمام عالم، فقیر به سوی خداوند هستند: «همانا خداوند از جهانیان بی‌نیاز است.» (فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ)\n\nاین‌چنین است صورت هستی (al-Wujūd)، *** پس به غیر او توجه مکن.\nبه واسطه او جفت ما بود، *** و اوست خدای یگانه.\n\nو خداوند حق (al-Ḥaqq) را می‌گوید و او راه را هدایت می‌کند. (وَهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 2
}