{
  "id": 215,
  "title": {
    "ar": "الباب الخامس عشر ومائتان في معرفة اللطيفة وأسرارها",
    "en": "Chapter Two Hundred and Fifteen concerning the Gnosis of the Subtle Essence (اللطيفة) and its Mysteries.",
    "ur": "باب نمبر دو سو پندرہ: لطیفہ (اللطيفة) کی معرفت اور اس کے اسرار کا بیان۔",
    "fa": "باب دویست و پانزدهم در معرفت لطیفه و اسرار آن"
  },
  "content": {
    "ar": "## «الباب الخامس عشر ومائتان في معرفة اللطيفة وأسرارها»\n\n\n> إذا عزت عن الشرح المعاني *** فتلك لطائف الرحمن فينا\n\n\n> يشاربها إلينا من بعيد *** فنحيي من إشارتها سنينا\n\n\n> وإن الله يمنحها قلوبا *** يهيمها الهوى حينا فحينا\n\n\n> وما ذاك الهوى المذموم لكن *** هو الحب الذي منه ابتلينا\n\n\n### [أن اللطيفة يطلق على معنيين‏]\n\n\nاعلم أيدنا الله وإياك بروح القدس أن أهل الله يطلقون لفظ اللطيفة على معنيين يطلقونه ويريدون به حقيقة الإنسان وهو المعنى الذي البدن مركبه ومحل تدبيره وآلات تحصيل معلوماته المعنوية والحسية ويطلقونه أيضا ويريدون به كل إشارة دقيقة المعنى تلوح في الفهم لا تسعها العبارة وهي من علوم الأذواق والأحوال فهي تعلم ولا تنقال لا تأخذها الحدود وإن كانت محدودة في نفس الأمر ولكن ما يلزم من له حد وحقيقة في نفس الأمر أن يعبر عنه وهذا معنى قول أهل الفهم أن الأمور منها ما يحد ومنها ما لا يحد أي تتعذر العبارة عن إيضاح حقيقته وحده للسامع حتى يفهمه وعلوم الأذواق من هذا القبيل ثم يتوسعون في اللطائف فيسمون كل معنى دقيق عزيز المثال وإن قيل ينفرد به أفراد الرجال لطيفة ومن الأسماء الإلهية الاسم اللطيف ومن حكم هذا الاسم الإلهي إيصال أرزاق العباد المحسوسة والمعنوية المقطوعة الأسباب من حيث لا يشعر بها المرزوق وهو قوله تعالى ويَرْزُقْهُ من حَيْثُ لا يَحْتَسِبُ ومن الاسم اللطيف‏\n\n\nقوله عليه السلام في نعيم الجنة فيها ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n\n\n### [إن اللطيفة تحصل للعبد من الله باسم اللطيف‏]\n\n\nفاعلم وفقك الله أن اللطيفة التي تحصل للعبد من الله من حيث لا يشعر إذا أوصلها العبد بهمته لتلميذه أو لمن شاء من عباد الله من حيث لا يشعر ذلك الشخص عن قصد من الشيخ حينئذ يقال فيه إنه صاحب لطيفة ولا يصح هذا إلا للمتخلق بالاسم الإلهي اللطيف فإن وقع الشعور بها فليس بصاحب لطيفة وإن وقع للتلميذ أو للموصل إليه ذلك المعنى أنه وصل إليه من هذا الشيخ عن علم محقق لا عن حسبان ولا حسن ظن ولا تخمين فذلك الشيخ ليس بصاحب لطيفة في تلك المسألة فإنه من شأن صاحب هذا المقام العزة والمنع أن يشعر به إن ذلك من عنده على تفصيل ما وقع منه الإيصال لا على الإجمال كما تعلم أن الرزاق هو الله على الإجمال ولكن ما تعرف كيف إيصال الرزق للمرزوق على التفصيل والتعيين الذي يعلمه الحق من اسمه اللطيف فإن علم فمن حكم اسم آخر إلهي لا من الاسم اللطيف وليس ذلك بلطيفة فلا بد من الجهل بالإيصال ولهذا المعنى سميت حقيقة الإنسان لطيفة لأنها ظهرت بالنفخ عند تسوية البدن للتدبير من الروح المضاف إلى الله في قوله فَإِذا سَوَّيْتُهُ ونَفَخْتُ فِيهِ من رُوحِي وهو النفس الإلهي وقد مضى بابه فهو سر إلهي لطيف ينسب إلى الله على الإجمال من غير تكييف فلما ظهر عينه بالنفخ عند التسوية وكان ظهوره عن وجود لا عن عدم فما حدث إلا إضافة التولية إليه بتدبير هذا البدن مثل ظهور الحرف عن نفس المتكلم وأعطى في هذا المركب الآلات الروحانية والحسية لإدراك علوم لا يعرفها إلا بوساطة هذه الآلات وهذا من كونه لطيفا أيضا فإنه في الإمكان العقلي فيما يظهر لبعض العقلاء من المتكلمين أن يعرف ذلك الأمر من غير وساطة هذه الآلات وهذا ضعيف في النظر فإنا ما نعني بالآلات إلا المعاني القائمة بالمحل فنحن نريد السمع والبصر والشم لا الأذن والعين والأنف وهو لا يدرك المسموع إلا من كونه صاحب سمع لا صاحب أذن وكذلك لا يدرك المبصر إلا من كونه صاحب بصر لا صاحب حدقة وأجفان فإذا إضافات هذه الآلات لا يصح ارتفاعها وما بقي لما ذا ترجع حقائقها هل ترجع لأمور زائدة على عين اللطيفة أو ليست ترجع إلا إلى عين اللطيفة وتختلف الأحكام فيها باختلاف المدركات والعين واحدة وهو مذهب المحققين من أهل الكشف والنظر الصحيح العقلي فلما ظهر عين هذه اللطيفة التي هي‏\nحقيقة الإنسان كان هذا أيضا عين تدبيرها لهذا البدن من باب اللطائف لأنه لا يعرف كيف ارتباط الحياة لهذا البدن بوجود هذا الروح اللطيف لمشاركة ما تقتضيه الطبيعة فيه من وجود الحياة التي هي الروح الحيواني فظهر نوع اشتراك فلا يدرى على الحقيقة هذه الحياة البدنية الحيوانية هل هي لهذه اللطيفة الظاهرة عن النفخ الإلهي المخاطبة المكلفة أو للطبيعة أو للمجموع إلا أهل الكشف والوجود فإنهم عارفون بذلك ذوقا إذ قد علموا أنه ما في العالم إلا حي ناطق بتسبيح ربه تعالى بلسان فصيح ينسب إليه بحسب ما تقتضيه حقيقته عند أهل الكشف وأما ما عدا أهل الكشف فلا يعلمون ذلك أصلا فهم أهل الجماد والنبات والحيوان ولا يعلمون أن الكل حي ولكن لا يشعرون كما لا يشعرون بحياة\n\n\nالشهداء المقتولين في سبيل الله قال تعالى ولا تَقُولُوا لِمَنْ يُقْتَلُ في سَبِيلِ الله أَمْواتٌ بَلْ أَحْياءٌ ولكِنْ لا تَشْعُرُونَ ثم إن تدبير هذه اللطيفة هذا البدن لبقاء الصحبة لما اقتنته من المعارف والعلوم بصحبة هذا الهيكل ولا سيما أهل الهياكل المنورة وهنا ينقسم أهل الله إلى قسمين قسم يقول بالتجريد عند مفارقة هذا البدن فإنها تكتسب من خلقها وعلومها ومعارفها أحوالا وهيأت يعلمون بها في عالم التجريد من أخواتها فتطلب درجة الكمال وهذا الصنف وإن كان من أهل الله فليس من أهل الكشف بل الفكر عليه غالب والنظر العقلي عليه حاكم والقسم الآخر من أهل الله وهم أهل الحق لا يبالون بالمفارقة متى كانت لأنهم في مزيد علم أبدا دائما وإنهم ملوك أهل تدبير لمواد طبيعية أو عنصرية دنيا وبرزخا وآخرة وهم المؤمنون القائلون بحشر الأجساد وهؤلاء لهم الكشف الصحيح فإن اللطيفة الإلهية لم تظهر إلا عن تدبير وتفصيل وهيكل مدبر هو أصل وجودها مدبرة فلا تنفك عن هذه الحقيقة ومن تحقق ما يرى نفسه عليه في حال النوم في الرؤيا يعرف ما قلناه فإن الله ضرب ما يراه النائم في نومه مثلا وضرب اليقظة من ذلك النوم مثلا آخر للحشر والأول ما يؤول إليه الميت بعد مفارقة عالم الدنيا ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ يَعْلَمُونَ ظاهِراً من الْحَياةِ الدُّنْيا وهُمْ عَنِ الْآخِرَةِ هُمْ غافِلُونَ فنحن في ارتقاء دائم ومزيد علم دنيا وبرزخا وآخرة والآلات مصاحبة لا تنفك في هذه المنازل والمواطن والحالات عن هذه اللطيفة الإنسانية ثم إن الشقاء لهذه اللطيفة أمر عارض يعرض لها كما يعرض المرض في الدنيا لها لفساد هذه الأخلاط بزيادة أو نقص فإذا زيد في الناقص أو نقص من الزائد وحصل الاعتدال زال المرض وظهرت الصحة كذلك ما يطرأ عليها في الآخرة من الشقاء ثم المال إلى السعادة وهي استقامة النشأة في أي دار كان من جنة أو نار إذ قد ثبت أنه لكل واحد من الدارين ملؤها فالله يجعلنا ممن حفظت عليه صحة مزاج معارفه وعلومه فهذا طرف من حقيقة مسمى اللطيفة الإنسانية بل كل موجود من الأجسام له لطيفة روحانية إلهية تنظر إليه من حيث صورته لا بد من ذلك وفساد الصورة والهيئة موت حيث كان وأما اصطلاحهم اللطيفة على المعنى الآخر الذي هو كل إشارة تلوح في الفهم لا تسعها العبارة فاعلم إن أهل الله قد جعلوا الإشارة نداء على رأس البعد وبوحا بعين العلة ولكن في التقسيم في الإشارات يظهر فرقان وذلك أن الإشارة التي هي نداء على رأس البعد فهو حمل ما لا تبلغه العبارة كما إن الإشارة للذي لا يبلغه الصوت لبعد المسافة وهو ذو بصر فيشار إليه بما يراد منه فيفهم فهذا معنى قولهم نداء على رأس البعد فكل ما لا تسعه عبارة من العلوم فهو بمنزلة من لم يبلغه الصوت فهو بعيد عن المشير وليس ببعيد عما يراد منه فإن الإشارة قد أفهمته ما يفهمه الكلام أو يبلغه الصوت وقد علمت قطعا أن المشير إذا كان الحق فإنه بعيد عن الحد الذي يتميز به العبد فهذا بعد حقيقي لا بد منه ولا يكون الأمر إلا هكذا فلا بد من الإشارة وهي اللطيفة فإنه معنى لطيف لا يشعر به ثم إنه وإن لم يكن بعد فهو بوح بعين العلة وذلك أن الأصم يكون قريبا من المتكلم ولكن قربه لا تقع به الفائدة لأنه لا يصل إليه الصوت لعلة الصمم فيشير إليه مع القرب كما يقول الحق على لسان عبده سمع الله لمن‏\n\n\nحمده فهذا غاية القرب مع وجود العلة وظهورها وأكثر من هذا القرب ما يكون فإنه هو مع‏\n\n\nقوله قسمت الصلاة بيني وبين عبدي نصفين‏\n\n\nففرق وفصل وأين هذا ممن جعل قوله قوله وأنه المتكلم والقائل لا هو فهذا قرب معلول فهو قولهم وبوح بعين العلة ولهذا سميت لطيفة لأنها أدرجت الرب في العبد فقال تعالى فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله وكان المتكلم محمدا صلى الله‏\nعليه وسلم بكلام الله وقال تعالى كنت سمعه وبصره ولسانه‏\n\n\nوهذا من ألطف ما يكون ظهور رب في صورة خلق عن إعلام إلهي لا تعرف له كيفية ولا تنفك عنه بينية ف لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهُوَ السَّمِيعُ الْبَصِيرُ ثم إنه من هذا الباب حنين الأمهات إلى أولادها وعطفها عليهم والحنين إلى الأوطان والشوق إلى الآلاف وهي مناسبات في الجملة بين الأمرين إذا أراد الشخص أن يعرف عللها لم يقدر على ذلك ولكن يقارب إلا من حصل له التعريف الإلهي فذلك عالم بما هو الأمر عليه تلقاه من أصل الوجود بل من عين الوجود إذ الحق هو الوجود ليس إلا\n\n",
    "en": "## Chapter 215: On the Gnosis of the Subtle Essence (اللطيفة) and its Secrets\n\nWhen meanings are too precious for explanation,\nThose are the Subtleties (لطائف) of the All-Merciful within us.\n\nHe signals them to us from afar,\nAnd by their indication, we live for years.\n\nAnd indeed, Allah grants them to hearts\nThat love (الهوى) makes passionately devoted time after time.\n\nAnd that is not the blameworthy passion (الهوى), but rather\nIt is the Love (الحب) by which we are tested.\n\n### [That the Subtle Essence (اللطيفة) is applied to two meanings]\n\nKnow—may Allah support us and you with the Holy Spirit (روح القدس)—that the People of Allah (أهل الله) apply the term *al-Latifa* (the Subtle Essence) to two meanings.\n\nThey apply it intending the Reality of the Human (حقيقة الإنسان), which is the meaning for which the body is a vehicle, the locus of its governance, and the instruments for acquiring its spiritual and sensory knowledge.\n\nThey also apply it intending every subtle indication (إشارة دقيقة) of meaning that flashes in the understanding (الفهم) but cannot be contained by expression (العبارة). This belongs to the sciences of spiritual tastes (الأذواق) and states (الأحوال); thus, it is known but cannot be articulated. Boundaries do not encompass it, even though it is bounded in reality (في نفس الأمر). However, it is not necessary that what has a boundary and a reality in itself must be expressed. This is the meaning of the saying of the People of Understanding (أهل الفهم): that among things, some are defined and some are not defined—meaning that expression is impossible for clarifying its reality and definition to the listener so that he may comprehend it. The sciences of spiritual tastes (علوم الأذواق) are of this category.\n\nThen they expand the usage of *al-Latifa*, calling every subtle meaning (معنى دقيق) that is rare in its manifestation—even if it is said that only unique individuals attain it—a Subtle Essence (*Latifa*).\n\nAmong the Divine Names (الأسماء الإلهية) is the Name, The Subtle (اللطيف). One of the effects of this Divine Name is the delivery of the servants' sensory and spiritual provisions (أرزاق) whose means have been cut off, such that the recipient is unaware of them. This is His saying, the Exalted: <<وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ>> (And He provides for him from whence he does not expect).\n\nAnd from the Name The Subtle is his saying, peace be upon him, concerning the bliss of Paradise: \"In it is what no eye has seen, nor ear has heard, nor has occurred to the heart of man.\"\n\n### [That the Subtle Essence (اللطيفة) is attained by the servant from Allah through the Name The Subtle]\n\nKnow—may Allah grant you success—that the Subtle Essence (اللطيفة) which the servant attains from Allah, without being aware of it, if the servant conveys it through his spiritual aspiration (همته) to his disciple or to whomever Allah wills among His servants, without that person being aware of the Shaykh's intention, then that Shaykh is said to be a possessor of the Subtle Essence (*sahib latifa*).\n\nThis is only valid for the one who has morally embodied (المتخلق) the Divine Name, The Subtle. If awareness of it occurs, he is not a possessor of the Subtle Essence. And if it occurs to the disciple or the recipient of that meaning that it reached him from this Shaykh through verified knowledge (علم محقق)—not through conjecture, good opinion, or estimation—then that Shaykh is not a possessor of the Subtle Essence in that matter. For it is characteristic of the possessor of this station (المقام) that it is too precious and guarded (العزة والمنع) for him to be aware that it came from him, specifically regarding the detailed manner of the conveyance, not merely in general terms.\n\nJust as you know generally that the Provider (الرزاق) is Allah, but you do not know the detailed and specific manner by which the provision reaches the recipient, which The Real (الحق) knows through His Name, The Subtle. If it is known, then it is due to the effect of another Divine Name, not the Name The Subtle, and that is not a Subtle Essence. Therefore, ignorance of the conveyance is necessary.\n\nFor this reason, the Reality of the Human (حقيقة الإنسان) was named a Subtle Essence (*Latifa*), because it appeared through the Divine Inbreathing (النفخ) when the body was perfected for governance, originating from the Spirit (الروح) attributed to Allah in His saying: <<فَإِذَا سَوَّيْتُهُ وَنَفَخْتُ فِيهِ مِنْ رُوحِي>> (So when I have proportioned him and breathed into him of My Spirit). This is the Divine Breath (النفس الإلهي), the chapter on which has passed.\n\nIt is a subtle Divine Secret (سر إلهي لطيف) attributed to Allah generally, without modality (تكييف). When its essence appeared through the Inbreathing at the time of proportioning, and its appearance was from Being (وجود), not from non-existence (عدم), nothing new occurred except the attribution of authority to it for the governance of this body. This is like the appearance of a letter from the breath of the speaker. In this composite structure, it was given spiritual and sensory instruments (الآلات) for the perception of knowledge that it cannot know except through the mediation of these instruments. This, too, is part of its being subtle.\n\nFor it is intellectually possible, according to what appears to some rationalists among the theologians (المتكلمين), that this matter could be known without the mediation of these instruments. But this view is weak upon examination. For by instruments (الآلات), we only mean the meanings subsisting in the locus. We intend hearing, sight, and smell, not the ear, the eye, and the nose. The human does not perceive the audible except by being a possessor of hearing, not a possessor of an ear. Likewise, he does not perceive the visible except by being a possessor of sight, not a possessor of a pupil and eyelids.\n\nTherefore, the attributions of these instruments cannot be removed. What remains is: to what do their realities return? Do they return to matters supplementary to the essence of the Subtle Essence, or do they return only to the essence of the Subtle Essence, with the rulings differing according to the differences in the perceived objects, while the essence remains one? This is the doctrine of the Verifiers (المحققين) among the People of Unveiling (أهل الكشف) and sound rational consideration.\n\nWhen the essence of this Subtle Essence, which is the Reality of the Human, appeared, this was also the very essence of its governance of this body, belonging to the category of Subtleties (اللطائف). This is because the manner in which life is connected to this body through the existence of this subtle Spirit (الروح اللطيف) is unknown, due to the participation of what nature (الطبيعة) necessitates within it, namely the existence of life which is the animal spirit (الروح الحيواني).\n\nThus, a kind of partnership appeared. It is not truly known whether this animal, bodily life belongs to this Subtle Essence that appeared through the Divine Inbreathing—the one addressed and obligated—or to nature, or to the combination, except by the People of Unveiling (أهل الكشف) and Being (الوجود), for they know this through spiritual taste (ذوقا). Since they know that there is nothing in the World (العالم) except what is living and speaking, glorifying its Lord, the Exalted, with an eloquent tongue attributed to it according to what its reality necessitates, in the view of the People of Unveiling.\n\nAs for those other than the People of Unveiling, they do not know this at all. They are the people of the inanimate, the plant, and the animal, and they do not know that everything is alive, but they do not perceive it, just as they do not perceive the life of the martyrs killed in the path of Allah. The Exalted said: <<وَلَا تَقُولُوا لِمَنْ يُقْتَلُ فِي سَبِيلِ اللَّهِ أَمْوَاتٌ بَلْ أَحْيَاءٌ وَلَكِنْ لَا تَشْعُرُونَ>> (And do not say about those who are killed in the way of Allah that they are dead. Rather, they are alive, but you perceive not).\n\nFurthermore, the governance of this body by this Subtle Essence is for the continuation of companionship, due to the gnosis (المعارف) and knowledge (العلوم) it acquired through the companionship of this structure (الهيكل), especially the people of illuminated structures.\n\nHere, the People of Allah divide into two groups: one group affirms abstraction (التجريد) upon separation from this body. They acquire states and dispositions from their character, knowledge, and gnosis, by which they know their counterparts in the world of abstraction, thus seeking the degree of perfection. This category, although among the People of Allah, is not among the People of Unveiling; rather, speculation (الفكر) dominates them, and rational consideration (النظر العقلي) governs them.\n\nThe second group of the People of Allah, who are the People of The Real (أهل الحق), do not care when the separation occurs, because they are perpetually and eternally in increasing knowledge. They are the kings, the people of governance over natural or elemental substances, in this world, the Isthmus (برزخا), and the Hereafter. They are the believers who affirm the resurrection of bodies. These possess true Unveiling (الكشف الصحيح). For the Divine Subtle Essence (اللطيفة الإلهية) only appeared through governance and detail, and a governed structure is the origin of its existence as a governor. Thus, it does not separate from this reality.\n\nWhoever verifies what he sees himself upon during sleep in a vision (الرؤيا) will know what we have said. For Allah set what the sleeper sees in his sleep as one example, and He set waking from that sleep as another example for the Resurrection (الحشر). The first is what the deceased returns to after separating from the world of this life. <<وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ * يَعْلَمُونَ ظَاهِرًا مِنَ الْحَيَاةِ الدُّنْيَا وَهُمْ عَنِ الْآخِرَةِ هُمْ غَافِلُونَ>> (But most people do not know. They know only the outward appearance of the worldly life, and they are heedless of the Hereafter).\n\nThus, we are in perpetual ascent and increasing knowledge in this world, the Isthmus (برزخا), and the Hereafter. The instruments remain accompanying and do not separate from this human Subtle Essence (اللطيفة الإنسانية) in these stations, places, and states.\n\nFurthermore, wretchedness (الشقاء) for this Subtle Essence is an accidental matter that occurs to it, just as illness occurs to it in this world due to the corruption of the humors (الأخلاط) by excess or deficiency. When the deficient is increased or the excessive is decreased, and equilibrium is achieved, the illness vanishes and health appears. Likewise is the wretchedness that befalls it in the Hereafter, followed by the ultimate return to felicity (السعادة), which is the rectification of the constitution (النشأة) in whichever abode it may be, whether Paradise or the Fire, since it has been established that each of the two abodes has its fullness. May Allah make us among those whose health of temperament regarding their gnosis and knowledge is preserved.\n\nThis is one aspect of the reality designated by the human Subtle Essence (اللطيفة الإنسانية). Rather, every existing body has a spiritual Divine Subtle Essence (لطيفة روحانية إلهية) that regards it from the perspective of its form; this is necessary. The corruption of the form and structure is death, wherever it may be.\n\nAs for their technical usage of *al-Latifa* for the other meaning—which is every indication (إشارة) that flashes in the understanding but cannot be contained by expression—know that the People of Allah have made the indication a call from the peak of distance (نداء على رأس البعد) and a disclosure despite the very impediment (بوحا بعين العلة). However, in the classification of indications, a distinction (فرقان) appears.\n\nThe indication that is a call from the peak of distance is the conveyance of what expression cannot reach, just as an indication is made to one whom the voice cannot reach due to distance, provided he has sight. He is signaled what is intended from him, and he understands. This is the meaning of their saying: \"a call from the peak of distance.\" Thus, all knowledge that expression cannot contain is in the position of one whom the voice has not reached; he is distant from the signaler, but not distant from what is intended from him, for the indication has made him understand what speech or the voice would convey. You have certainly known that if the Signaler is The Real (الحق), then He is distant from the boundary by which the servant is distinguished. This is a necessary, true distance, and the matter cannot be otherwise. Therefore, the indication (الإشارة) is necessary, and that is the Subtle Essence (*Latifa*), for it is a subtle meaning of which one is unaware.\n\nFurthermore, even if there is no distance, it is a disclosure despite the very impediment (علة). This is because the deaf person may be close to the speaker, but his proximity yields no benefit because the sound does not reach him due to the impediment of deafness. So, one signals to him despite the proximity. This is like The Real speaking through the tongue of His servant: \"Allah hears the one who praises Him.\" This is the utmost proximity despite the existence and manifestation of the impediment. There is no greater proximity than this, for He is with His saying: \"I have divided the prayer between Myself and My servant into two halves,\" thus separating and distinguishing. How does this compare to one who makes His saying his own saying, believing that He is the Speaker and the Utterer, not the servant? This is a proximity that is conditioned by an impediment (قرب معلول). This is their saying: \"a disclosure despite the very impediment.\"\n\nFor this reason, it was named a Subtle Essence (*Latifa*), because it incorporated the Lord into the servant. The Exalted said: <<فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ>> (Then grant him protection until he hears the word of Allah), and the speaker of the word of Allah was Muhammad, peace and blessings be upon him. And the Exalted said: \"I was his hearing, his sight, and his tongue.\"\n\nThis is the subtlest manifestation possible: the appearance of a Lord in the form of creation, based on a Divine declaration (إعلام إلهي) whose modality (كيفية) is unknown, yet separation (بينية) does not cease from it. Thus, <<لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ>> (There is nothing like unto Him, and He is the All-Hearing, the All-Seeing).\n\nFurthermore, belonging to this category is the yearning of mothers for their children and their affection for them, the yearning for homelands, and the longing for familiar companions. These are general correspondences between the two matters. If a person wishes to know their causes, he will be unable to do so, but he may approximate, except for the one who has attained Divine definition (التعريف الإلهي). That person knows the matter as it truly is, having received it from the Origin of Being (أصل الوجود), indeed, from the very Essence of Being (عين الوجود), since The Real (الحق) is Existence (الوجود) and nothing else.",
    "ur": "باب نمبر دو سو پندرہ: لطیفہ (اللطيفة) اور اس کے اسرار کی معرفت (المعرفۃ) میں\n\nجب معانی شرح سے قاصر ہو جائیں\nتو وہ ہم میں رحمن کے لطائف (اللطائف) ہوتے ہیں\nوہ دور سے ان کی طرف اشارہ کرتا ہے\nتو ہم اس کے اشارے سے برسوں زندہ رہتے ہیں\nاور بے شک اللہ انہیں ایسے دلوں کو عطا کرتا ہے\nجنہیں عشق (الہویٰ) وقتاً فوقتاً مدہوش کرتا ہے\nاور وہ مذموم عشق نہیں ہے\nبلکہ وہ محبت ہے جس سے ہم آزمائے گئے ہیں۔\n\n[لطیفہ (اللطيفة) کا اطلاق دو معانی پر ہوتا ہے]\n\nجان لو، اللہ ہمیں اور تمہیں روح القدس (روح القدس) کے ذریعے تائید بخشے، کہ اہلِ اللہ (أهل الله) لفظ لطیفہ (اللطيفة) کا اطلاق دو معانی پر کرتے ہیں۔ وہ اس کا اطلاق کرتے ہیں اور اس سے حقیقت انسان (حقيقة الإنسان) مراد لیتے ہیں، اور یہ وہ معنی ہے جس کا بدن اس کی سواری ہے، اور اس کے تدبیر کا مقام ہے، اور اس کے معنوی اور حسی معلومات کے حصول کا آلہ ہے۔ اور وہ اس کا اطلاق اس پر بھی کرتے ہیں اور اس سے ہر وہ دقیق معنی والا اشارہ مراد لیتے ہیں جو فہم میں ظاہر ہو لیکن عبارت میں نہ سما سکے، اور یہ علومِ اذواق اور احوال میں سے ہے۔ پس یہ جانی جاتی ہے لیکن بیان نہیں کی جاتی، حدود اس کا احاطہ نہیں کرتیں، اگرچہ وہ نفسِ امر میں محدود ہی کیوں نہ ہو۔ لیکن یہ ضروری نہیں کہ جس کی نفسِ امر میں کوئی حد اور حقیقت ہو، اس کا اظہار عبارت سے کیا جائے۔ اور یہی اہلِ فہم کے اس قول کا معنی ہے کہ امور میں سے کچھ وہ ہیں جن کی حد بندی کی جاتی ہے اور کچھ وہ ہیں جن کی حد بندی نہیں کی جاتی، یعنی سامع کے لیے اس کی حقیقت اور حد کی وضاحت عبارت سے کرنا مشکل ہو جاتا ہے تاکہ وہ اسے سمجھ سکے۔ اور علومِ اذواق اسی قبیل سے ہیں۔ پھر وہ لطائف (اللطائف) میں وسعت پیدا کرتے ہیں، اور ہر اس دقیق معنی کو لطیفہ (اللطيفة) کہتے ہیں جو مثال میں نایاب ہو، اگرچہ کہا جائے کہ وہ صرف چند افراد کے لیے مخصوص ہے۔ اور اسماءِ الٰہیہ میں سے ایک اسم اللطیف ہے۔ اور اس اسمِ الٰہی کے حکم میں سے یہ ہے کہ بندوں کے محسوس اور معنوی رزق کو ایسے اسباب سے پہنچانا جو منقطع ہو چکے ہوں، جہاں سے رزق پانے والے کو شعور بھی نہ ہو۔ اور یہی اللہ تعالیٰ کا قول ہے:\n**وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ** (اور اسے وہاں سے رزق دیتا ہے جہاں سے وہ گمان بھی نہیں کرتا)۔\nاور اسم اللطیف (اللطيف) سے ہی ہے:\nآپ صلی اللہ علیہ وسلم کا جنت کی نعمتوں کے بارے میں یہ فرمان:\n\"اس میں وہ کچھ ہے جو نہ کسی آنکھ نے دیکھا، نہ کسی کان نے سنا، اور نہ کسی انسان کے دل پر اس کا خیال گزرا۔\"\n\n[لطیفہ (اللطيفة) بندے کو اللہ کی طرف سے اسم اللطیف (اللطيف) کے ذریعے حاصل ہوتا ہے]\n\nپس جان لو، اللہ تمہیں توفیق دے، کہ وہ لطیفہ (اللطيفة) جو بندے کو اللہ کی طرف سے اس طرح حاصل ہوتا ہے کہ اسے شعور نہیں ہوتا، جب بندہ اسے اپنی ہمت کے ذریعے اپنے شاگرد یا اللہ کے بندوں میں سے کسی کو پہنچاتا ہے، اور اس شخص کو شیخ کے قصد کا شعور نہیں ہوتا، تب اس کے بارے میں کہا جاتا ہے کہ وہ صاحبِ لطیفہ ہے۔ اور یہ صرف اسی شخص کے لیے صحیح ہے جو اسمِ الٰہی اللطیف (اللطيف) سے متخلق ہو۔ اگر اس کا شعور ہو جائے تو وہ صاحبِ لطیفہ نہیں ہے۔ اور اگر شاگرد کو یا جس تک وہ معنی پہنچایا گیا ہے، اسے یہ معلوم ہو جائے کہ یہ اس شیخ کی طرف سے کسی یقینی علم کے ذریعے پہنچا ہے، نہ کہ گمان، حسنِ ظن یا تخمینے سے، تو وہ شیخ اس مسئلے میں صاحبِ لطیفہ نہیں ہے۔ کیونکہ اس مقام کے صاحب کا خاصہ یہ ہے کہ اس پر شعور نہ ہو، اور یہ کہ یہ اس کی طرف سے ہے، اس ایصال کی تفصیل کے ساتھ جو واقع ہوا ہے، نہ کہ اجمال کے ساتھ۔ جیسا کہ تم جانتے ہو کہ رزاق (الرزاق) اجمالاً اللہ ہی ہے، لیکن تم نہیں جانتے کہ رزق پانے والے تک رزق کا ایصال کس طرح ہوتا ہے، اس تفصیل اور تعین کے ساتھ جو ذات حق (الحق) اپنے اسم اللطیف (اللطيف) سے جانتا ہے۔ اگر معلوم ہو جائے تو وہ کسی دوسرے اسمِ الٰہی کے حکم سے ہے، نہ کہ اسم اللطیف سے، اور وہ لطیفہ (اللطيفة) نہیں ہے۔ لہٰذا ایصال سے لاعلمی ضروری ہے۔ اور اسی معنی کی وجہ سے حقیقت انسان (حقيقة الإنسان) کو لطیفہ (اللطيفة) کہا گیا، کیونکہ یہ بدن کی تدبیر کے لیے اسے برابر کرنے کے وقت اس روح سے نفخ کے ذریعے ظاہر ہوئی جو اللہ کی طرف منسوب ہے، جیسا کہ اس کے قول میں ہے:\n**فَإِذَا سَوَّيْتُهُ وَنَفَخْتُ فِيهِ مِنْ رُوحِي** (پھر جب میں اسے برابر کر دوں اور اس میں اپنی روح پھونک دوں)۔\nاور یہ نفسِ الٰہی ہے، اور اس کا باب گزر چکا ہے۔ پس یہ ایک لطیف (اللطيف) الٰہی راز ہے جو اللہ کی طرف اجمالاً منسوب ہے بغیر کسی کیفیت کے۔ پس جب تسویہ (برابر کرنے) کے وقت نفخ کے ذریعے اس کی عینیت ظاہر ہوئی، اور اس کا ظہور ہستی (الوجود) سے تھا نہ کہ عدم سے، تو اس میں صرف اس بدن کی تدبیر کے ساتھ اس کی تولیت کا اضافہ ہوا، جیسے متکلم کے نفس سے حرف کا ظہور۔ اور اس مرکب میں اسے روحانی اور حسی آلات دیے گئے تاکہ وہ ایسے علوم کا ادراک کر سکے جنہیں وہ ان آلات کے واسطے کے بغیر نہیں جان سکتا۔ اور یہ بھی اس کے لطیف (اللطيف) ہونے کی وجہ سے ہے۔ کیونکہ متکلمین میں سے بعض عقلاء کے نزدیک عقلی امکان میں یہ ظاہر ہوتا ہے کہ وہ اس امر کو ان آلات کے واسطے کے بغیر جان لے، لیکن یہ نظر میں کمزور ہے۔ کیونکہ آلات سے ہماری مراد صرف وہ معانی ہیں جو محل کے ساتھ قائم ہیں، پس ہم سمع (سننے کی قوت)، بصر (دیکھنے کی قوت) اور شم (سونگھنے کی قوت) مراد لیتے ہیں، نہ کہ کان، آنکھ اور ناک۔ اور وہ سنی ہوئی چیز کا ادراک صرف اس لیے کرتا ہے کہ وہ صاحبِ سمع ہے، نہ کہ صاحبِ کان۔ اسی طرح وہ دیکھی ہوئی چیز کا ادراک صرف اس لیے کرتا ہے کہ وہ صاحبِ بصر ہے، نہ کہ صاحبِ حدقہ (آنکھ کی پتلی) اور پلکیں۔ لہٰذا ان آلات کے اضافات کا ختم ہونا صحیح نہیں ہے۔ اور جو باقی بچا، اس کی حقائق کس طرف لوٹتی ہیں؟ کیا وہ لطیفہ (اللطيفة) کی عینیت پر زائد امور کی طرف لوٹتی ہیں، یا صرف لطیفہ کی عینیت کی طرف لوٹتی ہیں، اور احکام مدرکات کے اختلاف سے مختلف ہوتے ہیں جبکہ عینیت ایک ہی ہے؟ اور یہی اہلِ کشف (الکشف) اور صحیح عقلی نظر رکھنے والے محققین کا مذہب ہے۔ پس جب اس لطیفہ (اللطيفة) کی عینیت جو کہ حقیقت انسان (حقيقة الإنسان) ہے، ظاہر ہوئی، تو یہ بھی اس بدن کی تدبیر کی عینیت تھی، لطائف (اللطائف) کے باب سے۔ کیونکہ یہ معلوم نہیں کہ اس لطیف روح کے وجود کے ساتھ اس بدن کی حیات کا تعلق کس طرح ہے، اس میں طبیعت کے تقاضے کی شرکت کے ساتھ جو حیاتِ حیوانی (الروح الحیوانی) کا وجود ہے۔ پس ایک قسم کی شراکت ظاہر ہوئی، لہٰذا حقیقت میں یہ بدنی حیوانی حیات کیا اس لطیفہ (اللطيفة) کے لیے ہے جو نفخِ الٰہی سے ظاہر ہوئی ہے اور جو مخاطب و مکلف ہے، یا طبیعت کے لیے ہے، یا مجموعے کے لیے؟ یہ صرف اہلِ کشف (الکشف) اور اہلِ ہستی (الوجود) ہی جانتے ہیں، کیونکہ وہ اسے ذوقاً جانتے ہیں۔ کیونکہ وہ جان چکے ہیں کہ عالم میں کوئی چیز نہیں مگر زندہ ہے جو اپنے رب کی تسبیح ایک فصیح زبان سے کر رہی ہے جو اہلِ کشف (الکشف) کے نزدیک اس کی حقیقت کے تقاضے کے مطابق اس کی طرف منسوب ہے۔ اور اہلِ کشف کے علاوہ لوگ اسے بالکل نہیں جانتے، پس وہ جمادات، نباتات اور حیوانات کے اہلِ ہیں، اور وہ نہیں جانتے کہ سب زندہ ہیں، لیکن انہیں شعور نہیں ہوتا، جیسا کہ انہیں ان شہیدوں کی زندگی کا شعور نہیں ہوتا جو اللہ کی راہ میں قتل کیے گئے:\nاللہ تعالیٰ کا فرمان ہے:\n**وَلَا تَقُولُوا لِمَن يُقْتَلُ فِي سَبِيلِ اللَّهِ أَمْوَاتٌ بَلْ أَحْيَاءٌ وَلَكِن لَّا تَشْعُرُونَ** (اور جو اللہ کی راہ میں قتل کیے جائیں انہیں مردہ نہ کہو، بلکہ وہ زندہ ہیں لیکن تمہیں شعور نہیں ہوتا)۔\nپھر اس لطیفہ (اللطيفة) کا اس بدن کی تدبیر کرنا، اس صحبت کو باقی رکھنے کے لیے ہے جو اس نے اس ہیکل کی صحبت سے معارف (المعارف) اور علوم حاصل کیے ہیں، خاص طور پر منور ہیکلوں والے اہلِ اللہ (أهل الله)۔ اور یہاں اہلِ اللہ دو قسموں میں تقسیم ہو جاتے ہیں: ایک قسم جو اس بدن سے مفارقت کے وقت تجرید (تجريد) کی قائل ہے، کیونکہ وہ اپنے اخلاق، علوم اور معارف سے ایسے احوال اور ہیئتیں حاصل کرتی ہے جن کے ذریعے وہ عالمِ تجرید میں اپنی ہم جنسوں سے علم حاصل کرتی ہے اور کمال (الکمال) کا درجہ طلب کرتی ہے۔ اور یہ صنف اگرچہ اہلِ اللہ میں سے ہے، لیکن اہلِ کشف (الکشف) میں سے نہیں، بلکہ ان پر فکر غالب ہے اور عقلی نظر ان پر حاکم ہے۔ اہلِ اللہ کی دوسری قسم وہ ہے جو اہلِ حق (أهل الحق) ہیں، وہ مفارقت کی پرواہ نہیں کرتے کہ وہ کب ہو، کیونکہ وہ دنیا، برزخ اور آخرت میں ہمیشہ علم میں اضافہ پاتے رہتے ہیں، اور وہ مادی یا عنصری مواد کی تدبیر کرنے والے بادشاہ ہیں، اور وہ جسموں کے حشر کے قائل مومن ہیں۔ اور ان کے لیے کشفِ صحیح (الکشف الصحیح) ہے۔ کیونکہ لطیفہ (اللطيفة) الٰہیہ تدبیر اور تفصیل کے بغیر ظاہر نہیں ہوئی، اور ایک مدبر ہیکل اس کے وجود کی اصل ہے جو مدبر ہے، لہٰذا وہ اس حقیقت سے جدا نہیں ہو سکتی۔ اور جو شخص نیند کی حالت میں رؤیا میں اپنے آپ کو جس حال پر دیکھتا ہے، وہ ہماری کہی ہوئی بات کو جان لے گا۔ کیونکہ اللہ نے سونے والے کے خواب میں دیکھی ہوئی چیز کو ایک مثال بنایا ہے، اور اس نیند سے بیداری کو حشر کے لیے دوسری مثال بنایا ہے۔ اور پہلی مثال وہ ہے جس کی طرف میت دنیا کے عالم سے مفارقت کے بعد لوٹتی ہے:\n**وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ يَعْلَمُونَ ظَاهِرًا مِّنَ الْحَيَاةِ الدُّنْيَا وَهُمْ عَنِ الْآخِرَةِ هُمْ غَافِلُونَ** (لیکن اکثر لوگ نہیں جانتے، وہ دنیا کی زندگی کا صرف ظاہری پہلو جانتے ہیں اور وہ آخرت سے غافل ہیں)۔\nپس ہم دنیا، برزخ اور آخرت میں ہمیشہ ترقی اور علم میں اضافے میں ہیں۔ اور آلات اس لطیفہ (اللطيفة) انسانی کے ساتھ ان منازل، مقامات اور حالات میں ہمیشہ ساتھ رہتے ہیں اور جدا نہیں ہوتے۔ پھر اس لطیفہ کے لیے شقاوت ایک عارضی امر ہے جو اسے لاحق ہوتا ہے، جیسا کہ دنیا میں اسے بیماری لاحق ہوتی ہے، ان اخلاط کے فساد کی وجہ سے جو زیادتی یا کمی سے پیدا ہوتے ہیں۔ پس جب ناقص میں اضافہ کیا جائے یا زائد میں کمی کی جائے اور اعتدال حاصل ہو جائے تو بیماری زائل ہو جاتی ہے اور صحت ظاہر ہو جاتی ہے۔ اسی طرح جو شقاوت آخرت میں اس پر طاری ہوتی ہے، پھر اس کا انجام سعادت کی طرف ہوتا ہے، اور وہ کسی بھی گھر میں ہو، جنت ہو یا دوزخ، نشأت کی استقامت ہے۔ کیونکہ یہ ثابت ہو چکا ہے کہ دونوں گھروں میں سے ہر ایک کے لیے اس کا بھرنا ضروری ہے۔ پس اللہ ہمیں ان لوگوں میں شامل کرے جن کے معارف (المعارف) اور علوم کے مزاج کی صحت محفوظ رکھی گئی ہے۔ پس یہ لطیفہ (اللطيفة) انسانی کے مسمیٰ کی حقیقت کا ایک حصہ ہے۔ بلکہ اجسام میں سے ہر موجود کے لیے ایک روحانی لطیفہ (اللطيفة) الٰہیہ ہے جو اس کی صورت کے لحاظ سے اس پر نظر رکھتی ہے، اور یہ ضروری ہے۔ اور صورت اور ہیئت کا فساد جہاں بھی ہو، موت ہے۔\nاور جہاں تک ان کے لطیفہ (اللطيفة) کو دوسرے معنی پر اصطلاحاً استعمال کرنے کا تعلق ہے، جو کہ ہر وہ اشارہ ہے جو فہم میں ظاہر ہو لیکن عبارت میں نہ سما سکے، تو جان لو کہ اہلِ اللہ (أهل الله) نے اشارے کو دوری کے سرے پر ندا اور علت کی عینیت کے ساتھ راز افشا کرنا قرار دیا ہے۔ لیکن اشارات کی تقسیم میں فرق ظاہر ہوتا ہے۔ اور وہ یہ کہ وہ اشارہ جو دوری کے سرے پر ندا ہے، وہ اس چیز کو اٹھانا ہے جہاں تک عبارت نہیں پہنچتی، جیسا کہ اشارہ اس شخص کے لیے ہوتا ہے جس تک آواز مسافت کی دوری کی وجہ سے نہیں پہنچتی، اور وہ صاحبِ بصر ہوتا ہے، تو اسے اس چیز کی طرف اشارہ کیا جاتا ہے جو اس سے مطلوب ہوتی ہے، اور وہ سمجھ جاتا ہے۔ پس یہ ان کے قول \"دوری کے سرے پر ندا\" کا معنی ہے۔ پس علوم میں سے ہر وہ چیز جو عبارت میں نہ سما سکے، وہ اس شخص کے مانند ہے جس تک آواز نہیں پہنچی، پس وہ اشارہ کرنے والے سے دور ہے، لیکن اس چیز سے دور نہیں جو اس سے مطلوب ہے، کیونکہ اشارے نے اسے وہ سمجھا دیا جو کلام سمجھاتا ہے یا آواز پہنچاتی ہے۔ اور تم یقیناً جان چکے ہو کہ جب اشارہ کرنے والا ذات حق (الحق) ہو، تو وہ اس حد سے دور ہے جس سے بندہ ممتاز ہوتا ہے۔ پس یہ ایک حقیقی دوری ہے جو ضروری ہے، اور معاملہ ایسا ہی ہونا چاہیے۔ لہٰذا اشارہ ضروری ہے، اور وہی لطیفہ (اللطيفة) ہے، کیونکہ یہ ایک لطیف معنی ہے جس کا شعور نہیں ہوتا۔ پھر یہ کہ اگرچہ دوری نہ ہو، تو وہ علت کی عینیت کے ساتھ راز افشا کرنا ہے۔ اور وہ یہ کہ بہرا شخص متکلم کے قریب ہوتا ہے، لیکن اس کا قرب فائدہ مند نہیں ہوتا، کیونکہ بہرے پن کی علت کی وجہ سے آواز اس تک نہیں پہنچتی، تو اسے قرب کے باوجود اشارہ کیا جاتا ہے، جیسا کہ ذات حق (الحق) اپنے بندے کی زبان پر کہتا ہے:\n**سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ** (اللہ نے سن لیا جس نے اس کی تعریف کی)۔\nپس یہ علت کے وجود اور اس کے ظاہر ہونے کے باوجود قرب کی انتہا ہے۔ اور اس سے زیادہ قرب نہیں ہو سکتا، کیونکہ وہ اس کے ساتھ ہے:\nاس کے اس قول کے باوجود:\n\"میں نے نماز کو اپنے اور اپنے بندے کے درمیان دو حصوں میں تقسیم کر دیا ہے۔\"\nپس اس نے فرق کیا اور تفصیل بیان کی، اور اس کا مقابلہ اس شخص سے کہاں جو اس کے قول کو اپنا قول قرار دیتا ہے، اور یہ کہ متکلم اور کہنے والا وہ (اللہ) ہے نہ کہ یہ (بندہ)۔ پس یہ قرب معلول ہے، لہٰذا یہ ان کا قول ہے: \"علت کی عینیت کے ساتھ راز افشا کرنا۔\" اور اسی وجہ سے اسے لطیفہ (اللطيفة) کہا گیا، کیونکہ اس نے رب کو بندے میں شامل کر دیا، چنانچہ اللہ تعالیٰ نے فرمایا:\n**فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ** (پس اسے پناہ دو تاکہ وہ اللہ کا کلام سن لے)۔\nاور کلامِ اللہ کے ساتھ متکلم محمد صلی اللہ علیہ وسلم تھے۔ اور اللہ تعالیٰ نے فرمایا:\n\"میں اس کا کان، اس کی آنکھ اور اس کی زبان بن جاتا ہوں۔\"\nاور یہ سب سے زیادہ لطیف (اللطيف) چیز ہے کہ ایک رب کا ظہور (التجلی) مخلوق کی صورت میں ہو، ایک الٰہی اعلام کے ذریعے جس کی کیفیت معلوم نہیں، اور اس سے دوئی (بینیت) جدا نہیں ہوتی۔ پس:\n**لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ** (اس کی مثل کوئی چیز نہیں اور وہ سننے والا، دیکھنے والا ہے)۔\nپھر اسی باب سے ماؤں کا اپنے بچوں کے لیے تڑپنا اور ان پر شفقت کرنا، اور وطن کی طرف تڑپنا، اور دوستوں کا شوق ہے۔ اور یہ دونوں امور کے درمیان اجمالی مناسبتیں ہیں، جب کوئی شخص ان کی علتیں جاننا چاہے تو وہ اس پر قادر نہیں ہوتا، لیکن قریب پہنچ جاتا ہے، سوائے اس کے جسے الٰہی تعریف حاصل ہو جائے، تو وہ اس امر کو جاننے والا ہوتا ہے کہ وہ کس حال پر ہے، اور اس نے اسے اصل ہستی (الوجود) سے، بلکہ عین ہستی (الوجود) سے حاصل کیا ہے، کیونکہ ذات حق (الحق) ہستی (الوجود) ہی ہے اور کچھ نہیں۔",
    "fa": "## «باب دویست و پانزدهم در معرفت لطیفه و اسرار آن»\n\n> چون معانی از شرح بازماند، *** آن لطایف‌های رحمان است در ما\n\n> از دور به ما اشاره می‌کند، *** و ما از اشارتش سال‌ها زنده می‌مانیم\n\n> و خداوند آن را به دل‌هایی می‌بخشد، *** که هوس (هوی) گاه‌به‌گاه آن‌ها را سرگشته می‌کند\n\n> و آن هوس، هوس نکوهیده نیست، *** بلکه همان محبتی است که ما به آن مبتلا شدیم\n\n### [اینکه لطیفه بر دو معنی اطلاق می‌شود]\n\nبدان، خداوند ما و تو را به روح‌القدس تأیید کند، که اهل الله لفظ لطیفه را بر دو معنی اطلاق می‌کنند: آن را اطلاق می‌کنند و منظورشان حقیقت انسان است، و آن معنایی است که بدن مرکب آن، محل تدبیر آن، و ابزارهای کسب معلومات معنوی و حسی آن است. و همچنین آن را اطلاق می‌کنند و منظورشان هر اشاره دقیق‌المعنایی است که در فهم می‌درخشد و عبارت گنجایش آن را ندارد. این از علوم اذواق و احوال است؛ پس دانسته می‌شود اما بیان نمی‌شود، حدود آن را در بر نمی‌گیرد، اگرچه در نفس‌الامر محدود است. اما لازم نیست آنچه در نفس‌الامر حد و حقیقتی دارد، بتوان آن را بیان کرد. و این معنای سخن اهل فهم است که امور برخی محدودند و برخی نامحدود؛ یعنی بیان حقیقت و حد آن برای شنونده دشوار است تا آن را بفهمد. و علوم اذواق از این قبیل است. سپس در لطایف توسعه می‌دهند و هر معنای دقیقی را که مثالش کمیاب است، اگرچه گفته شود که افراد خاصی از مردان به آن منفرد می‌شوند، لطیفه می‌نامند. و از اسماء الهی، اسم اللطیف است. و از احکام این اسم الهی، رساندن روزی‌های محسوس و معنوی بندگان است که اسبابشان قطع شده، از جایی که روزی‌گیرنده از آن آگاه نیست، و این همان قول خداوند متعال است: **وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ** (و او را از جایی که گمان نمی‌برد روزی می‌دهد). و از اسم اللطیف است\n\nقول پیامبر (صلی الله علیه و سلم) در وصف نعمت‌های بهشت: **فِيهَا مَا لَا عَيْنٌ رَأَتْ وَلَا أُذُنٌ سَمِعَتْ وَلَا خَطَرَ عَلَى قَلْبِ بَشَرٍ** (در آن چیزهایی است که نه چشمی دیده و نه گوشی شنیده و نه بر قلب بشری خطور کرده است).\n\n### [اینکه لطیفه از جانب خداوند به واسطه اسم اللطیف به بنده می‌رسد]\n\nپس بدان، خداوند تو را موفق بدارد، که لطیفه‌ای که از جانب خداوند به بنده می‌رسد، از جایی که او آگاه نیست، اگر بنده آن را با همت خود به شاگردش یا به هر کس از بندگان خدا که بخواهد برساند، در حالی که آن شخص از قصد شیخ آگاه نباشد، در این صورت گفته می‌شود که او صاحب لطیفه است. و این تنها برای کسی صحیح است که به اسم الهی اللطیف متخلق شده باشد. اگر آگاهی از آن حاصل شود، پس او صاحب لطیفه نیست. و اگر برای شاگرد یا کسی که آن معنی به او رسیده، معلوم شود که این از جانب این شیخ و از روی علم محقق به او رسیده است، نه از روی گمان و نه حسن ظن و نه تخمین، پس آن شیخ در آن مسئله صاحب لطیفه نیست. زیرا از شأن صاحب این مقام، عزت و منع است که آگاهی از آن حاصل شود که آن از جانب اوست، آن هم بر تفصیلی که ایصال از او واقع شده، نه بر اجمال. همان‌طور که می‌دانی روزی‌دهنده خداوند است بر اجمال، اما نمی‌دانی چگونه روزی به روزی‌گیرنده می‌رسد بر تفصیلی و تعیینی که حق از اسم اللطیف خود می‌داند. اگر دانسته شود، پس از حکم اسم الهی دیگری است، نه از اسم اللطیف، و آن لطیفه نیست. پس ناگزیر باید جهل به ایصال وجود داشته باشد. به همین دلیل، حقیقت انسان لطیفه نامیده شده است، زیرا هنگام تسویه بدن برای تدبیر، با نفخ از روح منسوب به خداوند در قولش: **فَإِذَا سَوَّيْتُهُ وَنَفَخْتُ فِيهِ مِنْ رُوحِي** (پس چون او را سامان دادم و از روح خود در او دمیدم) ظاهر شد، و آن نفس الهی است و باب آن گذشت. پس آن یک سر الهی لطیف است که به طور اجمالی و بدون تکییف به خداوند نسبت داده می‌شود. پس چون عین آن با نفخ هنگام تسویه ظاهر شد و ظهورش از وجود بود نه از عدم، چیزی جز اضافه تولیت به آن با تدبیر این بدن حادث نشد، مانند ظهور حرف از نفس متکلم. و در این مرکب، ابزارهای روحانی و حسی برای درک علومی به آن داده شد که جز به واسطه این ابزارها نمی‌تواند آن‌ها را بشناسد. و این نیز از لطیف بودن آن است. زیرا در امکان عقلی است، آن‌گونه که برای برخی از عقلای متکلمین ظاهر می‌شود، که آن امر را بدون واسطه این ابزارها بشناسد. و این در نظر ضعیف است. زیرا منظور ما از ابزارها جز معانی قائم به محل نیست. ما منظورمان شنیدن، دیدن و بوییدن است، نه گوش، چشم و بینی. و شنیده را درک نمی‌کند مگر از آن جهت که صاحب سمع است، نه صاحب گوش. و همچنین دیده را درک نمی‌کند مگر از آن جهت که صاحب بصر است، نه صاحب حدقه و پلک‌ها. پس اضافات این ابزارها صحیح نیست که مرتفع شوند. و اگر مرتفع شوند، حقایق آن‌ها به چه چیزی باز می‌گردد؟ آیا به اموری زائد بر عین لطیفه باز می‌گردد یا تنها به عین لطیفه باز می‌گردد و احکام در آن‌ها با اختلاف مدرکات متفاوت می‌شود، در حالی که عین یکی است؟ و این مذهب محققین از اهل کشف و نظر صحیح عقلی است. پس چون عین این لطیفه که حقیقت انسان است ظاهر شد، این نیز عین تدبیر آن برای این بدن از باب لطایف بود، زیرا دانسته نمی‌شود که چگونه حیات برای این بدن با وجود این روح لطیف مرتبط است، به دلیل مشارکت آنچه طبیعت در آن اقتضا می‌کند از وجود حیات که همان روح حیوانی است. پس نوعی اشتراک ظاهر شد. پس به حقیقت دانسته نمی‌شود که این حیات بدنی حیوانی آیا برای این لطیفه است که از نفخ الهی ظاهر شده و مورد خطاب و تکلیف است، یا برای طبیعت، یا برای مجموع؟ مگر اهل کشف و وجود، زیرا آن‌ها این را ذوقاً می‌دانند. چرا که دانسته‌اند در عالم جز حی ناطق نیست که با زبان فصیح پروردگارش را تسبیح می‌گوید و به حسب آنچه حقیقتش اقتضا می‌کند، نزد اهل کشف به او نسبت داده می‌شود. اما غیر از اهل کشف، اصلاً این را نمی‌دانند. آن‌ها اهل جماد، نبات و حیوان هستند و نمی‌دانند که همه زنده هستند، اما شعور ندارند، همان‌طور که از حیات\n\nشهدای کشته شده در راه خدا شعور ندارند. خداوند متعال می‌فرماید: **وَلَا تَقُولُوا لِمَنْ يُقْتَلُ فِي سَبِيلِ اللَّهِ أَمْوَاتٌ بَلْ أَحْيَاءٌ وَلَكِنْ لَا تَشْعُرُونَ** (و به کسانی که در راه خدا کشته می‌شوند، مرده نگویید، بلکه زنده‌اند، ولی شما درک نمی‌کنید). سپس تدبیر این لطیفه برای این بدن به خاطر بقای مصاحبت است، به دلیل معارف و علومی که با مصاحبت این هیکل کسب کرده است، به ویژه اهل هیکل‌های نورانی. و در اینجا اهل الله به دو دسته تقسیم می‌شوند: دسته‌ای که به تجرید هنگام مفارقت این بدن قائلند، زیرا لطیفه از خلق و علوم و معارف خود احوال و هیئت‌هایی کسب می‌کند که با آن‌ها در عالم تجرید از خواهران خود آگاه می‌شود و درجه کمال را می‌طلبد. و این صنف اگرچه از اهل الله است، اما از اهل کشف نیست، بلکه فکر بر او غالب و نظر عقلی بر او حاکم است. و دسته دیگر از اهل الله، که اهل حق هستند، از مفارقت باکی ندارند، هر زمان که باشد، زیرا آن‌ها همیشه در فزونی علم هستند و پادشاهان اهل تدبیر برای مواد طبیعی یا عنصری در دنیا، برزخ و آخرت هستند. و آن‌ها مؤمنانی هستند که به حشر اجساد قائلند. و این‌ها کشف صحیح دارند. زیرا لطیفه الهی جز از تدبیر و تفصیل و هیکل مدبر ظاهر نشده است، و آن اصل وجود مدبره آن است. پس از این حقیقت جدا نمی‌شود. و کسی که آنچه را در حال خواب در رؤیا بر خود می‌بیند، محقق کند، آنچه را گفتیم می‌شناسد. زیرا خداوند آنچه را که خوابیده در خواب می‌بیند، مثلی قرار داده و بیداری از آن خواب را مثلی دیگر برای حشر قرار داده است. و اولی همان چیزی است که میت پس از مفارقت عالم دنیا به آن باز می‌گردد. **وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ يَعْلَمُونَ ظَاهِرًا مِنَ الْحَيَاةِ الدُّنْيَا وَهُمْ عَنِ الْآخِرَةِ هُمْ غَافِلُونَ** (ولی بیشتر مردم نمی‌دانند. ظاهری از زندگی دنیا را می‌دانند و از آخرت غافلند). پس ما در ارتقای دائم و فزونی علم در دنیا، برزخ و آخرت هستیم، و ابزارها مصاحب هستند و در این منازل، مواطن و حالات از این لطیفه انسانی جدا نمی‌شوند. سپس شقاوت برای این لطیفه امری عارضی است که بر آن عارض می‌شود، همان‌طور که بیماری در دنیا به دلیل فساد این اخلاط با افزایش یا کاهش بر آن عارض می‌شود. پس اگر در ناقص افزوده شود یا از زائد کاسته شود و اعتدال حاصل شود، بیماری از بین می‌رود و سلامتی ظاهر می‌شود. همچنین آنچه در آخرت از شقاوت بر آن عارض می‌شود، سپس بازگشت به سعادت است، و آن استقامت نشأت در هر سرایی که باشد، از بهشت یا دوزخ، زیرا ثابت شده است که هر یک از این دو سرا پرکننده خود را دارد. پس خداوند ما را از کسانی قرار دهد که سلامت مزاج معارف و علومشان حفظ شده است. این بخشی از حقیقت مسمای لطیفه انسانی است. بلکه هر موجودی از اجسام، لطیفه روحانی الهی دارد که از حیث صورتش به آن نظر می‌کند، و این ناگزیر است. و فساد صورت و هیئت، مرگ است، هر جا که باشد. اما اصطلاح آن‌ها لطیفه بر معنی دیگر، که هر اشاره‌ای است که در فهم می‌درخشد و عبارت گنجایش آن را ندارد، پس بدان که اهل الله اشاره را ندایی بر سر دوری و بوحی به عین علت قرار داده‌اند. اما در تقسیم در اشارات، فرقانی ظاهر می‌شود. و آن این است که اشاره‌ای که ندایی بر سر دوری است، حمل چیزی است که عبارت به آن نمی‌رسد، همان‌طور که اشاره برای کسی است که صدا به دلیل دوری مسافت به او نمی‌رسد و او بیناست، پس به آنچه از او خواسته می‌شود اشاره می‌شود و او می‌فهمد. پس این معنای قول آن‌هاست: ندایی بر سر دوری. پس هر علمی که عبارت گنجایش آن را ندارد، به منزله کسی است که صدا به او نرسیده است، پس از اشاره‌کننده دور است، اما از آنچه از او خواسته می‌شود دور نیست، زیرا اشاره آنچه را که کلام می‌فهماند یا صدا می‌رساند، به او فهمانده است. و قطعاً دانسته‌ای که اگر اشاره‌کننده حق (الحق) باشد، از حدی که بنده با آن متمایز می‌شود، دور است. پس این دوری حقیقی است که ناگزیر است و امر جز این نمی‌تواند باشد. پس ناگزیر باید اشاره باشد، و آن لطیفه است، زیرا معنایی لطیف است که به آن شعور حاصل نمی‌شود. سپس، اگرچه دوری نباشد، بوحی به عین علت است. و آن این است که ناشنوا نزدیک متکلم است، اما نزدیکی او فایده‌ای ندارد، زیرا صدا به دلیل علت ناشنوایی به او نمی‌رسد، پس با وجود نزدیکی به او اشاره می‌شود، همان‌طور که حق بر زبان بنده‌اش می‌گوید: **سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ** (خداوند سخن کسی را که او را ستایش کرد، شنید).\n\nاین نهایت نزدیکی است با وجود و ظهور علت. و نزدیک‌تر از این نزدیکی، آن است که با\n\nقولش: **قَسَمْتُ الصَّلَاةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ** (نماز را بین خود و بنده‌ام دو نیم کردم)\n\nتفاوت و تفصیل قائل شد. و این کجا با کسی که قول حق را قول خود قرار داده و او متکلم و گوینده است نه حق، قابل مقایسه است؟ پس این نزدیکی معلول است. پس این قول آن‌هاست: بوحی به عین علت. و به همین دلیل لطیفه نامیده شده است، زیرا رب (الرب) را در بنده درج کرده است. پس خداوند متعال فرمود: **فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ** (پس او را پناه ده تا کلام خدا را بشنود)، در حالی که متکلم محمد (صلی الله علیه و سلم) بود با کلام خدا. و خداوند متعال فرمود: **كُنْتُ سَمْعَهُ وَبَصَرَهُ وَلِسَانَهُ** (من گوش او، چشم او و زبان او بودم).\n\nو این از لطیف‌ترین چیزهایی است که می‌تواند باشد: ظهور رب در صورت خلق، از اعلام الهی که کیفیت آن شناخته نمی‌شود و بینیت از آن جدا نمی‌شود. پس **لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ** (چیزی مانند او نیست و او شنوای بیناست). سپس از این باب است حنین مادران به فرزندانشان و عطوفتشان بر آن‌ها، و حنین به اوطان و شوق به آلف (آشنایان). و این‌ها مناسباتی در مجموع بین دو امر هستند. اگر شخص بخواهد علل آن‌ها را بشناسد، نمی‌تواند، اما نزدیک می‌شود، مگر کسی که تعریف الهی برایش حاصل شده باشد. پس او به آنچه امر بر آن است عالم است و آن را از اصل الوجود، بلکه از عین الوجود دریافت کرده است، زیرا حق (الحق) همان وجود (الوجود) است و بس."
  },
  "page_count": 3
}