{
  "id": 529,
  "title": {
    "ar": "الباب التاسع والعشرون وخمسمائة في معرفة حال قطب كان منزله والْبَلَدُ الطَّيِّبُ يَخْرُجُ نَباتُهُ بِإِذْنِ رَبِّهِ",
    "en": "Chapter Five Hundred and Twenty-Nine: Concerning the Knowledge of the State of a Pole (قطب) Whose Station (منزل) Was: <<وَالْبَلَدُ الطَّيِّبُ يَخْرُجُ نَباتُهُ بِإِذْنِ رَبِّهِ>> (And the good land—its vegetation emerges by the permission of its Lord).",
    "ur": "باب پانچ سو انتیس: ایک قطب کے حال کی معرفت میں جس کا مقام (منزل) تھا اور (آیت قرآنی): \"وَالْبَلَدُ الطَّيِّبُ يَخْرُجُ نَباتُهُ بِإِذْنِ رَبِّهِ\" (اور جو عمدہ زمین ہے اس کی پیداوار اللہ کے حکم سے خوب نکلتی ہے۔)",
    "fa": "باب پانصد و بیست و نهم در معرفت حال قطبی که منزل او و «سرزمین پاکیزه، گیاهش به اذن پروردگارش می‌روید» (وَالْبَلَدُ الطَّيِّبُ يَخْرُجُ نَباتُهُ بِإِذْنِ رَبِّهِ) بود."
  },
  "content": {
    "ar": "## «الباب التاسع والعشرون وخمسمائة في معرفة حال قطب كان منزله والْبَلَدُ الطَّيِّبُ يَخْرُجُ نَباتُهُ بِإِذْنِ رَبِّهِ»\n\n\n> إن الوفاق لمن طيب الأصول لما *** أتابه الله مما شاءه وشرع‏\n> فمن أبى فلخبث في طبيعته *** يدريه من يفتح الأبواب حين قرع‏\n\n\n> له بما في غيوب الطبع من عجب *** من صنعه في الذي أبداه حين صنع‏\n\n\n> كمن دعاه رسول الله حين دعا *** فجاءه بالذي قد كان قبل جمع‏\n\n\n> وجاءه غيره بشطر ما كسبت *** يداه والكل فيما في يديه طمع‏\n\n\n> ولو أكون لما قلنا بقولهما *** وقلت عبد دعاه ربه فسمع‏\n\n\n> وبادر الأمر لم ينظر إلى أحد *** ولا لمن ضر في تأخيره ونفع‏\n\n\n### [إن أهل العناية الإلهية الذين اعتنى الله بهم‏]\n\n\nاعلم أيدنا الله وإياك بروح القدس أن هذا الذكر كان لنا من الله عز وجل لما دعانا الله تعالى إليه فأجبناه إلى ما دعانا إليه مدة ثم حصلت عندنا فترة وهي الفترة المعلومة في الطريق عند أهل الله التي لا بد منها لكل داخل في الطريق ثم إذا حصلت الفترة إما أن يعقبها رجوع إلى الحال الأول من العبادة والاجتهاد وهم أهل العناية الإلهية الذين اعتنى الله عز وجل بهم وإما أن تصحبه الفترة فلا يفلح أبدا فلما أدركتنا الفترة وتحكمت فينا رأينا الحق في الواقعة فتلا علينا هذه الآيات وهُوَ الَّذِي يُرْسِلُ الرِّياحَ بُشْراً بَيْنَ يَدَيْ رَحْمَتِهِ حَتَّى إِذا أَقَلَّتْ سَحاباً ثِقالًا سُقْناهُ لِبَلَدٍ مَيِّتٍ فَأَنْزَلْنا به الْماءَ الآية ثم قال والْبَلَدُ الطَّيِّبُ يَخْرُجُ نَباتُهُ بِإِذْنِ رَبِّهِ فعلمت أني المراد بهذه الآية وقلت ينبه بما تلاه علينا على التوفيق الأول الذي هدانا الله به على يد عيسى وموسى ومحمد سلام الله على جميعهم فإن رجوعنا إلى هذا الطريق كان بمبشرة على يد عيسى وموسى ومحمد عليه السلام بين يدي رحمته وهي العناية بنا حَتَّى إِذا أَقَلَّتْ سَحاباً ثِقالًا وهو ترادف التوفيق سُقْناهُ لِبَلَدٍ مَيِّتٍ وهو أنا فَأَحْيَيْنا به الْأَرْضَ بَعْدَ مَوْتِها وهو ما ظهر علينا من أنوار القبول والعمل الصالح والتعشق به ثم مثل فقال كَذلِكَ نُخْرِجُ الْمَوْتى‏ لَعَلَّكُمْ تَذَكَّرُونَ يشير بذلك إلى خبر\n\n\nورد عن النبي صَلَّى اللهُ عَليهِ وسَلَّم في البعث أعني حشر الأجسام من أن الله يجعل السماء تمطر مثل مني الرجال‏\n\n\nالحديث ثم قال والْبَلَدُ الطَّيِّبُ يَخْرُجُ نَباتُهُ بِإِذْنِ رَبِّهِ وليس سوى الموافقة والسمع والطاعة لطهارة المحل والَّذِي خَبُثَ وهو الذي غلبت عليه نفسه والطبع وهو معتنى به في نفس الأمر لا يَخْرُجُ إِلَّا نَكِداً مثل‏\n\n\nقوله إن لله عبادا يقادون إلى الجنة بالسلاسل‏\n\n\nوقوله ولِلَّهِ يَسْجُدُ من في السَّماواتِ والْأَرْضِ طَوْعاً وكَرْهاً فقلنا طوعا يا إلهنا\n\n\n### [إن الله ابتدأ إنشاء هذه النشأة في ضعف وافتقار]\n\n\nواعلم أن الله تعالى لما خلق هذه النشأة الإنسانية لعبادته وأنشأها ابتداء في ضعف وافتقار فكانت عبادتها ذاتية وما زالت على ذلك إلى أن رزقها الله القوة وأظهر لها الأسباب الموجبة للقوة إذا استعملتها واحتجب الحق من ورائها فلم تشاهد إلا هي وغابت عن الحق تعالى فلم تشهده فناداها سبحانه من خلف تلك الأسباب بما كلفها به من الأعمال وسمي تلك الأعمال عبادة لتتنبه بذلك على أصلها فإنها لا تنكر عبوديتها لأن العبودة لها ذاتية ذوقا وبقي لمن مع معاينتها الأسباب التي تجد عندها دفع ضروراتها فهي تقبل عليها طبعا وترى الذي دعاها إليه غيبا فتعلم إن ثم ظاهرا وباطنا وغيبا وشهادة وتنظر في نفسها فتجدها مركبة من غيب وشهادة وأن الداعي منها إلى الحاجة غيب منها فإن تقوت عليها مناسبة الغيب على الشهادة كانت البلد الطيب الذي يَخْرُجُ نَباتُهُ بِإِذْنِ رَبِّهِ فسارعت إلى إجابة الداعي وهي من النفوس الذين يُسارِعُونَ في الْخَيْراتِ وهُمْ لَها سابِقُونَ لأنها رأت الأسباب مختلفة وأي سبب حضر منها أغناها عن سبب آخر فعلمت أنها مفتقرة بالذات إلى أمر ما غير معين فتعتمد عليه وهي قد شاهدت الأسباب وعلمت قيام بعضها عن بعض وتستغني ببعضها عن بعض ويغيب في وقت فلا يقدر عليه ويحضر في وقت فخطر لها ما خطر لإبراهيم الخليل عليه السلام إني لا أُحِبُّ الْآفِلِينَ ورأت أيضا أنها تخلق بعض أسبابها الموجبة استعمالها لدفع ضروراتها بما تتكلفه من الأعمال الموجبة لوجود ذلك السبب الذي تركن إليه فأنفت أن يتعبدها من له في وجوده افتقار إليها فأشبهها فأرادت الاستناد إلى غني لا افتقار له لعزة نفسها وشموخ أنفها وما جعل الله في طبعها من طلب العلو في الأرض والشفوف على الجنس فقالت أجيب هذا الداعي الغائب حتى أرى ما هو فلعله عين ما أطلبه فامتثلت أمر ما دعاها إليه وعملت عليه فأشرقت أرضها بِنُورِ رَبِّها فكانت البلد الطيب الذي يَخْرُجُ نَباتُهُ بِإِذْنِ رَبِّهِ ونفس أخرى على النقيض منها رجحت الشهادة على الغيب‏\nوأعمتها الحاجة عن اختلاف الأسباب وقيام كل سبب عن الآخر وقالت لعل هذا الغيب الذي دعاني إليه يكون مثل الشهادة كثيرين يغني الواحد منهم عن الآخر فأبقى على حالتي ولا أتعب ذاتي في مظنون فتثبطت عن إجابة الداعي ثم إن الله بحكمته في وقت قطع عنها الأسباب كلها واضطرها فلما لم تجد سببا تستند إليه ظاهرا جنحت إلى ذلك الغيب الذي دعاها لعل بيده فرجا يخرجها من الضيق الذي تجده فأجابته مضطرة وهو البلد الَّذِي خَبُثَ ف لا يَخْرُجُ نباته إِلَّا نَكِداً قال تعالى وإِذا مَسَّكُمُ الضُّرُّ في الْبَحْرِ فنبه على موضع انقطاع الأسباب ضَلَّ من تَدْعُونَ يعني الأسباب إِلَّا إِيَّاهُ فكان هو السبب الذي ينجي فلما نجاه الله وأغاثه واستقل قال هذا أيضا من جملة الأسباب التي يقوم بعضها عن بعض فيما نريده فجعله واحدا من الأسباب وهو المشرك فما خرج إلا نكدا ولهذا سارع في الرجعة إلى السبب الظاهر فتميز الفريقان وإنما كان فريقان في العالم بهذه المثابة لما حكم به الأصل فإن الأصل فيه جبر واختيار فبالاختيار لم يزل يسقط من الخمسين صلاة عشرا عشرا حتى انتهى إلى خمسة وبعدم الاختيار أثبتها خمسة وقال ما يُبَدَّلُ الْقَوْلُ لَدَيَّ وكان المجبر له ما أعطاه المعلوم فلم يتعد علمه فيه والذين يلجئون فيه إلى الله في حال الاضطرار الكلي استنادهم من حيث لا يعلمون إلى هذا الأصل في الحكم والفريق الآخر استناده إلى حكم الاختيار في أنه تعالى فَعَّالٌ لِما يُرِيدُ فأهل الضرورة في الرجعة أحق وأهل الاختيار في الرجعة أوفق وأسعد فالذي خرج نكدا له من الأحوال الإلهية\n\n\nقوله تعالى ما ترددت في شي‏ء أنا فاعله ترددي في قبض نسمة المؤمن يكره الموت وأكره مساءته ولا بد له من لقائي‏\n\n\nيقول لا بد أن أميته على كره مني وهو المعلوم الذي جعلني في هذا لأني علمت منه وقوع هذا فلو لا حصول العلم عنده من الممكنات كما هي في أنفسها عليه ما صح تردد ولا فعل ما فعله أو بعض ما فعله على كره فانظر فيما أعطاه هذا الذكر من العلم القريب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Five Hundred and Twenty-Nine: Concerning the Knowledge of the State of a Pole (قطب) Whose Station Was: <<And the good land—its vegetation emerges by the permission of its Lord>>\n\nIndeed, accord belongs to him whose origins are good, for what\nAllah brought him back to, of what He willed and legislated.\nBut whoever refuses, it is due to corruption in his nature,\nHe knows this who opens the doors when they are knocked.\n\nHe possesses, through the wonders in the hidden realms of nature (غيوب الطبع),\nOf His making, in that which He manifested when He created.\n\nLike one whom the Messenger of Allah called when he summoned,\nAnd he came to him with that which was gathered before.\n\nAnd another came to him with half of what his hands had earned,\nWhile everyone desired what was in his hands.\n\nIf I were not to speak according to their saying,\nI would say: A servant whom his Lord called, and he listened.\n\nAnd he hastened to the command, looking neither to anyone,\nNor to him who might harm or benefit by delaying it.\n\n### [The People of Divine Providence (أهل العناية الإلهية) Whom Allah Has Cared For]\n\nKnow—may Allah support us and you with the Holy Spirit (روح القدس)—that this remembrance came to us from Allah, the Mighty and Majestic, when Allah the Exalted called us to Him. We responded to what He called us to for a period, then a lull (فترة) occurred within us. This is the known period of slackening in the Path among the People of Allah (أهل الله), which is inevitable for every entrant into the Path. When this lull occurs, it will either be followed by a return to the initial state of worship and striving—and these are the People of Divine Providence (أهل العناية الإلهية) whom Allah, the Mighty and Majestic, has cared for—or the lull will persist, and he will never succeed.\n\nWhen the lull overtook us and gained control over us, we saw The Real (الحق) in a spiritual vision (الواقعة). He recited these verses to us: <<And He it is Who sends the winds as good tidings before His mercy, until, when they have carried heavy clouds, We drive them to a dead land and send down thereby the water...>> (Quran 7:57, partial). Then He said: <<And the good land—its vegetation emerges by the permission of its Lord>> (Quran 7:58, partial).\n\nI knew then that I was the one intended by this verse. I said: He is alerting me, by what He recited to us, to the initial Divine Grace (التوفيق) by which Allah guided us through the hands of Jesus, Moses, and Muhammad—peace of Allah be upon all of them. For our return to this Path was through a glad tiding (مبشرة) by the hands of Jesus, Moses, and Muhammad, peace be upon them, \"before His mercy,\" which is His Providence (العناية) toward us.\n\n<<Until, when they have carried heavy clouds>> (حَتَّى إِذَا أَقَلَّتْ سَحَابًا ثِقَالًا) refers to the succession of Divine Grace (التوفيق). <<We drive them to a dead land>> (سُقْنَاهُ لِبَلَدٍ مَيِّتٍ) refers to me. <<And We revive the earth thereby after its death>> (فَأَحْيَيْنَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا) refers to the lights of acceptance, righteous action, and passionate love for Him that appeared upon us.\n\nThen He gave a similitude, saying: <<Thus do We bring forth the dead; perhaps you may remember>> (كَذَلِكَ نُخْرِجُ الْمَوْتَى لَعَلَّكُمْ تَذَكَّرُونَ). This refers to the report that came from the Prophet, peace and blessings be upon him, concerning the Resurrection (البعث)—meaning the gathering of bodies—that Allah will cause the sky to rain a water like the semen of men. (The Hadith).\n\nThen He said: <<And the good land—its vegetation emerges by the permission of its Lord>> (وَالْبَلَدُ الطَّيِّبُ يَخْرُجُ نَبَاتُهُ بِإِذْنِ رَبِّهِ). This is nothing other than accord, listening, and obedience, due to the purity of the locus (المحل).\n\n<<But that which is corrupt>> (وَالَّذِي خَبُثَ)—which is the one whose ego (نفسه) and nature (الطبع) have overcome him, though he is cared for in reality (في نفس الأمر)—<<its vegetation emerges only scantily>> (لَا يَخْرُجُ إِلَّا نَكِدًا). This is like His saying:\n\n> Indeed, Allah has servants who are led to Paradise by chains. (Hadith)\n\nAnd His saying: <<And to Allah prostrates whoever is in the heavens and on the earth, willingly or unwillingly>> (وَلِلَّهِ يَسْجُدُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا). So we said: Willingly, O our God!\n\n### [Allah Began the Creation of this Existence in Weakness and Need]\n\nKnow that when Allah the Exalted created this human existence (النشأة الإنسانية) for His worship, He initiated its creation in weakness and need (افتفار). Thus, its worship was essential (ذاتية), and it remained upon that until Allah granted it strength and manifested to it the causes (الأسباب) that necessitate strength if it employs them. The Real (الحق) veiled Himself behind these causes, so the soul witnessed nothing but itself, and it was absent from Allah the Exalted, so it did not witness Him.\n\nThen, the Glorified One called it from behind those causes with the duties (الأعمال) He obligated upon it, and He named those duties \"worship\" (عبادة) so that the soul might be alerted to its origin. For it does not deny its servitude (عبوديتها), because servitude is essentially inherent (ذاتية ذوقا) to it.\n\nHowever, there remained for the soul the direct observation of the causes, through which it finds the repulsion of its necessities. It naturally turns toward these causes and sees the One Who called it as Unseen (غيبا). Thus, it knows that there is an apparent and a hidden, an Unseen and a Witnessed. It looks within itself and finds that it is composed of the Unseen and the Witnessed, and that the Caller to the need is the Unseen part of it.\n\nIf the affinity of the Unseen prevails over the Witnessed, that soul becomes the good land (البلد الطيب) <<whose vegetation emerges by the permission of its Lord>>. It hastens to answer the Caller, and these are the souls <<who hasten to good deeds, and they are foremost in them>> (يُسَارِعُونَ فِي الْخَيْرَاتِ وَهُمْ لَهَا سَابِقُونَ).\n\nThis is because it saw the causes as diverse, and any cause that presented itself satisfied its need for another cause. Thus, it knew that it was essentially in need of *something* unspecified, upon which it could rely. Yet, it had witnessed the causes and knew that some stood in place of others, and that it could dispense with some by means of others, and that a cause might be absent at one time and present at another.\n\nSo, there occurred to it what occurred to Abraham the Intimate (إبراهيم الخليل), peace be upon him: <<Indeed, I do not love those that set>> (إِنِّي لَا أُحِبُّ الْآفِلِينَ).\n\nIt also saw that it creates some of its own necessary causes—those it uses to repel its necessities—through the actions it undertakes, which necessitate the existence of the cause upon which it relies. Therefore, it disdained being worshipped by one who is dependent upon it for his existence, thus resembling it. It desired to rely upon a Rich One (غني) who has no need, due to its own self-respect and high spirit, and due to what Allah placed in its nature: the desire for elevation on earth and superiority over its kind.\n\nSo, it said: I will answer this Unseen Caller until I see what He is, for perhaps He is the very thing I seek. It complied with the command to which He called it and acted upon it. Thus, its land shone <<with the light of its Lord>> (بِنُورِ رَبِّهَا), and it became the good land (البلد الطيب) <<whose vegetation emerges by the permission of its Lord>>.\n\nAnother soul, contrary to this one, preferred the Witnessed (الشهادة) over the Unseen (الغيب). Its need blinded it to the diversity of causes and the fact that each cause stands in place of another. It said: Perhaps this Unseen to which He calls me is like the Witnessed—many, where one suffices for another. So, I will remain in my state and not tire myself for a mere supposition. Thus, it held back from answering the Caller.\n\nThen, Allah, by His Wisdom, at a certain time, cut off all causes from it and compelled it (اضطرها). When it found no apparent cause upon which to rely, it inclined toward that Unseen which had called it, hoping that perhaps He held a relief that would deliver it from the distress it felt. It answered Him under compulsion (مضطرة). This is the land <<which is corrupt>> (الَّذِي خَبُثَ), so <<its vegetation emerges only scantily>> (لَا يَخْرُجُ إِلَّا نَكِدًا).\n\nAllah the Exalted said: <<And when affliction touches you in the sea...>> (وَإِذَا مَسَّكُمُ الضُّرُّ فِي الْبَحْرِ). He alerts us to the point where causes are cut off: <<...lost are those you invoke>> (ضَلَّ مَنْ تَدْعُونَ)—meaning the causes—<<except Him>> (إِلَّا إِيَّاهُ). So He was the Cause that delivered. But when Allah delivered him, relieved him, and he settled, he said: This is also one of the general causes that stand in place of one another regarding what we desire. Thus, he made Him one of the causes, and he became the polytheist (المشرك). Therefore, his vegetation emerged only scantily (نكدا).\n\nFor this reason, he hastened back to the apparent cause.\n\nThe two teams (الفريقان) were distinguished. They became two teams in the world in this manner because of the ruling established by the Origin (الأصل). For the Origin contains both compulsion (جبر) and choice (اختيار). By choice, the fifty prayers were continually reduced, ten by ten, until they reached five. By the absence of choice, He confirmed them as five and said: <<The word is not changed with Me>> (مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ). The Compeller (المجبر) for him was what the Foreknown (المعلوم) granted, so His knowledge concerning him was not transgressed.\n\nThose who resort to Allah in a state of total compulsion (الاضطرار الكلي) rely, without knowing it, upon this Origin in the ruling. The other team relies upon the ruling of choice, in that He the Exalted is <<the Doer of what He intends>> (فَعَّالٌ لِمَا يُرِيدُ).\n\nThus, the people of necessity (أهل الضرورة) are more deserving in their return, and the people of choice (أهل الاختيار) are more agreeable and happier in their return.\n\nAs for the one whose vegetation emerged scantily (نكدا), he has a share in the Divine states (الأحوال الإلهية), such as His saying, the Exalted:\n\n> I have not hesitated concerning anything I am going to do as I hesitate concerning the soul of the believer; he dislikes death, and I dislike causing him distress, but there is no avoiding his meeting Me. (Hadith Qudsi)\n\nHe says: I must cause him to die against My will, and this is the Foreknown (المعلوم) that placed Me in this state, because I knew from him that this would occur. Were it not for the presence of Knowledge (العلم) with Him concerning the possibilities (الممكنات) as they are in themselves, it would not be correct for Him to hesitate, nor to do what He did, or part of what He did, against His will.\n\nLook into the near knowledge (العلم القريب) that this remembrance granted. And Allah <<speaks the Truth, and He guides to the Way>> (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ).",
    "ur": "باب نمبر پانچ سو انتیس قطب (قطب) کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور جو پاکیزہ زمین ہے، اس کی پیداوار اپنے رب کے حکم سے نکلتی ہے۔\" (القرآن ۷:۵۸)\n\nموافقت (وفاق) اس شخص کے لیے ہے جس کی جڑیں پاکیزہ ہوں، اس چیز کے لیے جو اللہ نے اسے توبہ کے طور پر دی جو اس نے چاہا اور شریعت بنائی۔\nاور جس نے انکار کیا تو وہ اس کی فطرت کی خباثت کی وجہ سے ہے، اسے وہ جانتا ہے جو دروازے کھولتا ہے جب دستک دی جائے۔\n\nاس کے لیے فطرت کے غیبوں میں تعجب خیز چیزیں ہیں، اس کے اس کام میں جو اس نے ظاہر کیا جب اس نے بنایا۔\n\nجیسے وہ شخص جسے رسول اللہ صلی اللہ علیہ وسلم نے بلایا جب آپ نے دعوت دی، تو وہ اس چیز کے ساتھ آیا جو جمع ہونے سے پہلے ہی موجود تھی۔\n\nاور اس کے علاوہ دوسرا شخص اس کے آدھے کے ساتھ آیا جو اس کے ہاتھوں نے کمایا تھا، اور ہر کوئی اس چیز کا لالچی تھا جو اس کے ہاتھ میں تھی۔\n\nاور اگر میں ان دونوں کی بات نہ کہتا تو میں کہتا کہ وہ بندہ جسے اس کے رب نے بلایا تو اس نے سن لیا۔\n\nاور اس نے حکم میں پہل کی، کسی کی طرف نہ دیکھا، اور نہ اس کی طرف جس نے تاخیر میں نقصان پہنچایا یا فائدہ دیا۔\n\n### [وہ لوگ جن پر اللہ کی عنایت (عنایۃ الٰہیہ) ہوئی]\n\nجان لو، اللہ ہمیں اور تمہیں روح القدس (روح القدس) کے ذریعے تائید عطا فرمائے، کہ یہ ذکر ہمیں اللہ عزوجل کی طرف سے اس وقت ہوا جب اللہ تعالیٰ نے ہمیں اپنی طرف بلایا، تو ہم نے ایک مدت تک اس کی دعوت پر لبیک کہا۔ پھر ہم پر ایک فتور (فترۃ) طاری ہوا، اور یہ وہ معلوم فتور ہے جو اہلِ اللہ کے ہاں سلوک میں ہر داخل ہونے والے کے لیے ناگزیر ہے۔ پھر جب فتور طاری ہوتا ہے تو یا تو اس کے بعد عبادت اور مجاہدہ کی پہلی حالت کی طرف واپسی ہوتی ہے، اور یہ وہ اہلِ عنایت الٰہیہ (عنایۃ الٰہیہ) ہیں جن پر اللہ عزوجل نے عنایت فرمائی، اور یا یہ کہ فتور اس کے ساتھ رہے تو وہ کبھی کامیاب نہیں ہوتا۔\n\nجب ہم پر فتور طاری ہوا اور ہم پر غالب آ گیا، تو ہم نے ایک واقعہ (واقعۃ) میں حق (الحق) کو دیکھا، تو اس نے ہم پر یہ آیات تلاوت فرمائیں:\n\"اور وہی ہے جو اپنی رحمت کے آگے ہواؤں کو خوشخبری بنا کر بھیجتا ہے، یہاں تک کہ جب وہ بھاری بادل اٹھا لیتی ہیں، تو ہم اسے کسی مردہ شہر کی طرف ہانک لے جاتے ہیں، پھر اس کے ذریعے پانی برساتے ہیں...\" (القرآن ۷:۵۷)\nپھر فرمایا:\n\"اور جو پاکیزہ زمین ہے، اس کی پیداوار اپنے رب کے حکم سے نکلتی ہے۔\" (القرآن ۷:۵۸)\n\nتو میں نے جان لیا کہ اس آیت سے مراد میں ہی ہوں۔ اور میں نے کہا کہ وہ اس کے ذریعے اس پہلی توفیق (توفیق) پر متنبہ کر رہا ہے جس کے ذریعے اللہ نے ہمیں عیسیٰ، موسیٰ اور محمد (سلام اللہ علیہم اجمعین) کے ہاتھوں ہدایت دی، کیونکہ اس راستے کی طرف ہماری واپسی عیسیٰ، موسیٰ اور محمد علیہم السلام کے ہاتھوں ایک بشارت کے ذریعے ہوئی تھی، جو اس کی رحمت کے آگے تھی، اور وہ ہم پر اس کی عنایت (عنایۃ) تھی۔ \"یہاں تک کہ جب وہ بھاری بادل اٹھا لیتی ہیں\" اور وہ توفیق (توفیق) کا پے در پے آنا ہے۔ \"تو ہم اسے کسی مردہ شہر کی طرف ہانک لے جاتے ہیں\" اور وہ میں ہوں۔ \"پھر اس کے ذریعے زمین کو اس کی موت کے بعد زندہ کر دیا\" اور وہ قبولیت اور عمل صالح کی وہ انوار ہیں جو ہم پر ظاہر ہوئیں اور ان سے محبت پیدا ہوئی۔ پھر اس نے مثال دی اور فرمایا:\n\"اسی طرح ہم مردوں کو نکالیں گے، تاکہ تم نصیحت حاصل کرو۔\" (القرآن ۷:۵۷)\nاس سے اشارہ اس خبر کی طرف ہے جو نبی صلی اللہ علیہ وسلم سے بعث (حشر) کے بارے میں وارد ہوئی ہے، یعنی اجسام کے حشر کے بارے میں کہ اللہ آسمان سے مردوں کے نطفے جیسا پانی برسائے گا۔ (الحدیث)\n\nپھر فرمایا: \"اور جو پاکیزہ زمین ہے، اس کی پیداوار اپنے رب کے حکم سے نکلتی ہے۔\" اور یہ محل (محل) کی طہارت کی وجہ سے موافقت (موافقۃ)، سننا اور اطاعت کرنا ہی ہے۔ اور \"جو ناپاک ہے\" (الَّذِي خَبُثَ) وہ ہے جس پر اس کا نفس اور طبع غالب آ گیا ہو، حالانکہ وہ فی نفسہٖ عنایت کردہ ہے، \"اس کی پیداوار نہیں نکلتی مگر تھوڑی سی مشکل سے۔\" (القرآن ۷:۵۸)\nجیسے اس کا فرمان ہے:\n\"بے شک اللہ کے کچھ بندے ایسے ہیں جو زنجیروں میں جکڑ کر جنت کی طرف لے جائے جائیں گے۔\" (الحدیث)\nاور اس کا فرمان:\n\"اور اللہ ہی کو سجدہ کرتے ہیں جو آسمانوں اور زمین میں ہیں، خوشی سے اور ناخوشی سے۔\" (القرآن ۱۳:۱۵)\nتو ہم نے کہا: اے ہمارے معبود! خوشی سے۔\n\n### [بے شک اللہ نے اس انسانی نشأت (نشأۃ) کو کمزوری اور محتاجی میں پیدا کرنا شروع کیا]\n\nاور جان لو کہ جب اللہ تعالیٰ نے اس انسانی نشأت (نشأۃ) کو اپنی عبادت کے لیے پیدا کیا اور اسے ابتداءً کمزوری اور محتاجی (افتقار) میں پروان چڑھایا، تو اس کی عبادت ذاتی (ذاتیۃ) تھی اور وہ اسی پر قائم رہی یہاں تک کہ اللہ نے اسے قوت عطا فرمائی اور اس کے لیے وہ اسباب ظاہر کیے جو قوت کا موجب بنتے ہیں جب وہ انہیں استعمال کرتی ہے۔ اور حق (الحق) ان اسباب کے پیچھے پردہ نشین ہو گیا، تو اس نے اپنے سوا کسی کا مشاہدہ نہ کیا اور حق تعالیٰ سے غائب ہو گئی، تو اس کا مشاہدہ نہ کر سکی۔\n\nپھر اللہ سبحانہ و تعالیٰ نے ان اسباب کے پیچھے سے اسے ان اعمال کے ذریعے پکارا جن کا اس نے اسے مکلف بنایا، اور ان اعمال کو عبادت (عبادۃ) کا نام دیا تاکہ وہ اس کے ذریعے اپنی اصل پر متنبہ ہو جائے، کیونکہ وہ اپنی عبودیت (عبودیۃ) کا انکار نہیں کر سکتی، اس لیے کہ عبودیت ذوقاً اس کے لیے ذاتی ہے۔ اور اس کے لیے وہ اسباب باقی رہے جن کے پاس وہ اپنی ضروریات کو پورا کرنا پاتی ہے، تو وہ طبعاً ان کی طرف متوجہ ہوتی ہے اور جو اسے بلاتا ہے اسے غیب (غیب) میں دیکھتی ہے۔ تو وہ جانتی ہے کہ وہاں ظاہر اور باطن، اور غیب اور شہادت (شہادۃ) ہے۔ اور وہ اپنے نفس میں غور کرتی ہے تو اسے غیب اور شہادت سے مرکب پاتی ہے، اور یہ کہ ضرورت کی طرف بلانے والا اس کا غیب ہے۔\n\nپس اگر غیب کی مناسبت شہادت (شہادۃ) پر غالب آ جائے تو وہ پاکیزہ زمین (البلد الطیب) ہوتی ہے جس کی پیداوار اپنے رب کے حکم سے نکلتی ہے۔ تو وہ بلانے والے کی اجابت میں تیزی دکھاتی ہے، اور وہ ان نفوس (نفوس) میں سے ہے جو \"نیکیوں میں سبقت کرنے والے ہیں اور وہ ان میں آگے نکلنے والے ہیں۔\" (القرآن ۲۳:۶۱) کیونکہ اس نے اسباب کو مختلف دیکھا، اور جو سبب بھی حاضر ہوتا ہے وہ اسے دوسرے سبب سے بے نیاز کر دیتا ہے۔ تو اس نے جان لیا کہ وہ بالذات کسی غیر متعین امر کی محتاج ہے، تو وہ اس پر بھروسہ کرتی ہے، حالانکہ اس نے اسباب کا مشاہدہ کیا ہے اور جانتی ہے کہ وہ ایک دوسرے کے قائم مقام ہوتے ہیں، اور وہ بعض کے ذریعے بعض سے بے نیاز ہو جاتی ہے، اور بعض اوقات کوئی سبب غائب ہو جاتا ہے تو اس پر قدرت نہیں ہوتی، اور بعض اوقات حاضر ہوتا ہے۔\n\nتو اس کے دل میں وہی خیال آیا جو ابراہیم خلیل علیہ السلام کے دل میں آیا تھا: \"میں ڈوب جانے والوں کو پسند نہیں کرتا۔\" (القرآن ۶:۷۶) اور اس نے یہ بھی دیکھا کہ وہ اپنی ضروریات کو پورا کرنے کے لیے بعض اسباب خود پیدا کرتی ہے، ان اعمال کے ذریعے جن کا وہ تکلف کرتی ہے جو اس سبب کے وجود کا موجب بنتے ہیں جس پر وہ بھروسہ کرتی ہے۔ تو اس نے اس بات سے نفرت کی کہ اسے وہ ہستی اپنی عبادت کا مکلف بنائے جسے اپنے وجود میں اس کی محتاجی ہو۔ تو وہ اس کے مشابہ ہو گئی، لہٰذا اس نے ایک ایسے غنی (غنی) پر بھروسہ کرنا چاہا جسے کوئی محتاجی نہ ہو، اپنی عزت نفس اور اپنی ناک کی بلندی کی وجہ سے، اور اس چیز کی وجہ سے جو اللہ نے اس کی فطرت میں زمین میں بلندی اور اپنی جنس پر فوقیت طلب کرنے کے لیے رکھی ہے۔\n\nتو اس نے کہا: میں اس غائب بلانے والے کی اجابت کرتی ہوں تاکہ میں دیکھوں کہ وہ کیا ہے، شاید وہی ہو جسے میں طلب کر رہی ہوں۔ تو اس نے اس حکم کی تعمیل کی جس کی طرف اسے بلایا گیا تھا اور اس پر عمل کیا، تو اس کی زمین اپنے رب کے نور (نور ربھا) سے چمک اٹھی، تو وہ پاکیزہ زمین (البلد الطیب) بن گئی جس کی پیداوار اپنے رب کے حکم سے نکلتی ہے۔\n\nاور ایک دوسرا نفس اس کے برعکس تھا، جس نے شہادت (شہادۃ) کو غیب (غیب) پر ترجیح دی۔ اور ضرورت نے اسے اسباب کے اختلاف اور ہر سبب کے دوسرے سے قائم مقام ہونے سے اندھا کر دیا۔ اور اس نے کہا: شاید یہ غیب جس کی طرف مجھے بلایا گیا ہے، شہادت کی طرح بہت سے اسباب میں سے ہو، جن میں سے ایک دوسرے سے بے نیاز کر دیتا ہے، تو میں اپنی حالت پر باقی رہوں گی اور اپنے آپ کو کسی گمان میں نہیں تھکاؤں گی۔ تو وہ بلانے والے کی اجابت سے سست پڑ گئی۔\n\nپھر اللہ نے اپنی حکمت سے ایک وقت میں اس سے تمام اسباب منقطع کر دیے اور اسے مجبور کر دیا (اضطرھا)۔ جب اسے کوئی ظاہری سبب نہ ملا جس پر وہ بھروسہ کر سکے، تو وہ اس غیب کی طرف مائل ہوئی جس نے اسے بلایا تھا، شاید اس کے ہاتھ میں کوئی کشادگی ہو جو اسے اس تنگی سے نکال دے جو وہ محسوس کر رہی تھی۔ تو اس نے مجبوراً اس کی اجابت کی، اور یہی وہ ناپاک زمین (الَّذِي خَبُثَ) ہے جس کی پیداوار نہیں نکلتی مگر تھوڑی سی مشکل سے (نَكِداً)۔\n\nاللہ تعالیٰ نے فرمایا:\n\"اور جب تمہیں سمندر میں کوئی تکلیف پہنچتی ہے...\" (القرآن ۱۷:۶۷)\nتو اس نے اسباب کے منقطع ہونے کی جگہ پر متنبہ کیا:\n\"...تو وہ سب گم ہو جاتے ہیں جنہیں تم پکارتے ہو\" یعنی اسباب، \"سوائے اس کے۔\" (القرآن ۱۷:۶۷)\nتو وہی سبب تھا جو نجات دیتا ہے۔ پھر جب اللہ نے اسے نجات دی اور اسے فریاد رسی کی اور وہ مطمئن ہو گیا، تو اس نے کہا: یہ بھی ان اسباب میں سے ایک ہے جو ہماری مطلوبہ چیزوں میں ایک دوسرے کے قائم مقام ہوتے ہیں۔ تو اس نے اسے اسباب میں سے ایک بنا دیا، اور وہ مشرک (مشرک) ہے۔ تو وہ نہیں نکلا مگر تھوڑی سی مشکل سے۔ اسی لیے اس نے ظاہری سبب کی طرف لوٹنے میں جلدی کی۔\n\nتو دونوں فریق ممتاز ہو گئے، اور دنیا میں یہ دو فریق اسی طرح ہیں جیسا کہ اصل نے حکم دیا ہے۔ کیونکہ اصل میں جبر (جبر) اور اختیار (اختیار) ہے۔ تو اختیار کی وجہ سے وہ پچاس نمازوں میں سے دس دس کم کرواتا رہا یہاں تک کہ پانچ پر پہنچ گیا، اور عدم اختیار کی وجہ سے اس نے انہیں پانچ ثابت رکھا اور فرمایا: \"میرے ہاں بات بدلی نہیں جاتی۔\" (القرآن ۵۰:۲۹) اور اسے مجبور کرنے والا وہ علم تھا جو اسے معلوم تھا، تو وہ اس میں اپنے علم سے تجاوز نہیں کیا۔\n\nاور وہ لوگ جو کلی اضطرار (اضطرار) کی حالت میں اللہ کی طرف پناہ لیتے ہیں، ان کا بھروسہ اس اصل پر ہوتا ہے جہاں سے وہ نہیں جانتے۔ اور دوسرا فریق اپنے اختیار کے حکم پر بھروسہ کرتا ہے کہ اللہ تعالیٰ \"جو چاہتا ہے وہ کرنے والا ہے۔\" (القرآن ۱۱:۱۰۷)\n\nپس اضطرار والے لوگ واپسی میں زیادہ حقدار ہیں، اور اختیار والے لوگ واپسی میں زیادہ موافق اور زیادہ خوش بخت ہیں۔ تو جو تھوڑی سی مشکل سے نکلا، اس کے لیے احوالِ الٰہیہ (احوال الٰہیہ) میں سے یہ فرمان ہے:\n\"میں نے کسی چیز میں جو میں کرنے والا ہوں، اتنا تردد (تردد) نہیں کیا جتنا مومن کی جان قبض کرنے میں کرتا ہوں، وہ موت کو ناپسند کرتا ہے اور میں اس کی ناگواری کو ناپسند کرتا ہوں، حالانکہ اسے مجھ سے ملنا ضروری ہے۔\" (الحدیث قدسی)\n\nوہ فرماتا ہے کہ مجھے اسے مارنا ضروری ہے، حالانانکہ مجھے ناگواری ہے، اور یہ وہ معلوم ہے جس نے مجھے اس میں ڈالا، کیونکہ میں نے اس سے اس کا وقوع جان لیا تھا۔ پس اگر ممکنات (ممکنات) کے بارے میں اس کے پاس علم نہ ہوتا جیسا کہ وہ فی نفسہٖ ہیں، تو نہ تردد (تردد) صحیح ہوتا اور نہ ہی وہ کام جو اس نے کیا یا اس کا کچھ حصہ ناگواری کے ساتھ کرنا صحیح ہوتا۔ پس غور کرو کہ اس ذکر نے تمہیں کتنا قریب کا علم عطا کیا ہے۔ اور اللہ حق (الحق) فرماتا ہے اور وہی سیدھے راستے کی ہدایت دیتا ہے۔",
    "fa": "باب پانصد و بیست و نهم در معرفت حال قطبی که منزل او این آیه بود: «و سرزمین پاک، گیاهش به اذن پروردگارش می‌روید.» (وَالْبَلَدُ الطَّيِّبُ يَخْرُجُ نَبَاتُهُ بِإِذْنِ رَبِّهِ)\n\nهمانا موافقت برای کسی است که ریشه‌هایش پاک است، به آنچه خداوند از خواست و شریعت خود به او عطا کرده است.\nپس هر که سر باز زند، به سبب پلیدی در طبیعت اوست؛ این را کسی می‌داند که در هنگام کوبیدن، درها را می‌گشاید.\nبرای او در شگفتی‌های غیب طبیعت، از صنع او در آنچه هنگام ساختن آشکار کرد، بهره‌ای است.\nمانند کسی که رسول خدا او را فراخواند، پس با آنچه پیش از جمع شدن بود، نزد او آمد.\nو دیگری با نیمی از آنچه دستانش کسب کرده بود نزد او آمد، در حالی که همه به آنچه در دستان او بود طمع داشتند.\nو اگر من بودم، به سخن آن دو نمی‌گفتم، بلکه می‌گفتم: بنده‌ای که پروردگارش او را خواند و او شنید.\nو به کار شتافت، به هیچ کس نگاه نکرد، و نه به کسی که در تأخیر او زیان یا سودی داشت.\n\n### [همانا اهل عنایت الهی (العناية الإلهية) کسانی هستند که خداوند به آنان توجه کرده است]\n\nبدان، خداوند ما و تو را به روح‌القدس تأیید کند، که این ذکر (یادآوری) از جانب خداوند عز و جل برای ما بود، هنگامی که خداوند متعال ما را به سوی خود فراخواند. ما مدتی به آنچه ما را به آن خوانده بود، پاسخ دادیم. سپس فترتی (سستی) برای ما حاصل شد، و آن فترت شناخته شده در سلوک نزد اهل الله است که برای هر سالکی ضروری است. سپس هنگامی که فترت حاصل می‌شود، یا به دنبال آن بازگشت به حال اول از عبادت و کوشش می‌آید، و اینان اهل عنایت الهی (العناية الإلهية) هستند که خداوند عز و جل به آنان توجه کرده است؛ یا اینکه فترت با او همراه می‌شود و هرگز رستگار نمی‌گردد.\n\nپس هنگامی که فترت ما را دربرگرفت و بر ما مسلط شد، حق (الحق) را در واقعه‌ای دیدیم. پس این آیات را بر ما تلاوت کرد: «و اوست که بادها را بشارت‌دهنده پیشاپیش رحمت خود می‌فرستد، تا هنگامی که ابرهای سنگین را برمی‌دارند، آن را به سوی سرزمینی مرده می‌رانیم، پس به وسیله آن آب را فرو می‌فرستیم...» (وَهُوَ الَّذِي يُرْسِلُ الرِّيَاحَ بُشْرًا بَيْنَ يَدَيْ رَحْمَتِهِ حَتَّى إِذَا أَقَلَّتْ سَحَابًا ثِقَالًا سُقْنَاهُ لِبَلَدٍ مَيِّتٍ فَأَنْزَلْنَا بِهِ الْمَاءَ) تا آخر آیه. سپس فرمود: «و سرزمین پاک، گیاهش به اذن پروردگارش می‌روید.» (وَالْبَلَدُ الطَّيِّبُ يَخْرُجُ نَبَاتُهُ بِإِذْنِ رَبِّهِ) پس دانستم که من مراد این آیه هستم. و گفتم: او با آنچه بر ما تلاوت کرد، بر توفیق اولیه‌ای که خداوند ما را به دست عیسی و موسی و محمد (سلام الله بر همگی آنان) بدان هدایت کرد، تنبیه می‌نماید. زیرا بازگشت ما به این طریق، با بشارتی به دست عیسی و موسی و محمد (علیهم السلام) بود، پیشاپیش رحمت او، و آن همان عنایت به ماست. «تا هنگامی که ابرهای سنگین را برمی‌دارند» (حَتَّى إِذَا أَقَلَّتْ سَحَابًا ثِقَالًا) که همان پی در پی آمدن توفیق است. «آن را به سوی سرزمینی مرده می‌رانیم» (سُقْنَاهُ لِبَلَدٍ مَيِّتٍ) که آن من هستم. «پس زمین را پس از مرگش به وسیله آن زنده کردیم» (فَأَحْيَيْنَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا) که همان انوار قبول و عمل صالح و عشق ورزیدن به آن است که بر ما ظاهر شد. سپس مَثَل زد و فرمود: «این گونه مردگان را بیرون می‌آوریم، شاید متذکر شوید.» (كَذَلِكَ نُخْرِجُ الْمَوْتَى لَعَلَّكُمْ تَذَكَّرُونَ) با این اشاره به خبری می‌کند که از پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) درباره بعث (برانگیختن) وارد شده است، یعنی حشر اجسام، مبنی بر اینکه خداوند آسمان را وامی‌دارد تا مانند منی مردان ببارد. (الحديث)\n\nسپس فرمود: «و سرزمین پاک، گیاهش به اذن پروردگارش می‌روید.» (وَالْبَلَدُ الطَّيِّبُ يَخْرُجُ نَبَاتُهُ بِإِذْنِ رَبِّهِ) و این چیزی جز موافقت و شنیدن و اطاعت به دلیل طهارت محل نیست. «و آن که ناپاک است» (وَالَّذِي خَبُثَ) که همان کسی است که نفس و طبیعتش بر او غلبه کرده است، و او در اصل امر مورد توجه است، «جز ناچیز (نکد) نمی‌روید.» (لَا يَخْرُجُ إِلَّا نَكِدًا) مانند این سخن: «همانا خداوند بندگانی دارد که با زنجیرها به سوی بهشت کشانده می‌شوند.» (حدیث) و سخن او: «و هر که در آسمان‌ها و زمین است، خواه ناخواه برای خدا سجده می‌کند.» (وَلِلَّهِ يَسْجُدُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا) پس ما گفتیم: ای معبود ما، از روی طاعت.\n\n### [همانا خداوند ایجاد این نشئه (نشأة) را در ضعف و نیازمندی آغاز کرد]\n\nو بدان که خداوند متعال هنگامی که این نشئه انسانی (النشأة الإنسانية) را برای عبادت خود آفرید و آن را در ابتدا در ضعف و نیازمندی ایجاد کرد، عبادت آن ذاتی بود و پیوسته بر همین حال بود تا اینکه خداوند به آن قوت بخشید و اسباب موجب قوت را برایش آشکار ساخت، در صورتی که از آن‌ها استفاده کند. و حق (الحق) از پشت آن اسباب پنهان شد، پس جز خود را مشاهده نکرد و از حق تعالی غایب شد و او را شهود (الشهود) نکرد. پس سبحانه او را از پشت آن اسباب، با آنچه از اعمال بر او تکلیف کرده بود، ندا داد و آن اعمال را عبادت نامید تا بدین وسیله به اصل خود متوجه شود، زیرا او بندگی خود را انکار نمی‌کند، چون عبودیت برای او ذاتی و ذوقی است.\n\nو برای کسی که اسبابی را که دفع ضروریات خود را نزد آن‌ها می‌یابد، معاینه می‌کند، باقی ماند. پس او طبعاً به سوی آن‌ها روی می‌آورد و آنچه را که به آن فراخوانده شده است، غیب می‌بیند. پس می‌داند که در آنجا ظاهری و باطنی، و غیبی و شهودی وجود دارد. و در نفس خود می‌نگرد و آن را مرکب از غیب و شهود می‌یابد، و آنکه از درون او به سوی حاجت فرا می‌خواند، غیبی از اوست. پس اگر مناسبت غیب بر شهود در او تقویت شود، آن سرزمین پاک (البلد الطيب) خواهد بود که «گیاهش به اذن پروردگارش می‌روید.» (يَخْرُجُ نَبَاتُهُ بِإِذْنِ رَبِّهِ) پس به سرعت به اجابت دعوت‌کننده می‌شتابد، و او از نفوسی است که «در خیرات شتاب می‌کنند و در آن پیشگام هستند.» (يُسَارِعُونَ فِي الْخَيْرَاتِ وَهُمْ لَهَا سَابِقُونَ) زیرا او اسباب را مختلف دیده است و هر سببی که حاضر شود، او را از سبب دیگر بی‌نیاز می‌کند. پس دانست که ذاتاً به امری نیازمند است که معین نیست، و بر آن اعتماد می‌کند. در حالی که اسباب را مشاهده کرده و دانسته است که برخی از آن‌ها جایگزین برخی دیگر می‌شوند و با برخی از آن‌ها از برخی دیگر بی‌نیاز می‌شود، و در زمانی غایب می‌شود و نمی‌توان به آن دست یافت، و در زمانی حاضر می‌شود. پس آنچه برای ابراهیم خلیل (علیه السلام) پیش آمد، برای او نیز خطور کرد: «من افول‌کنندگان را دوست ندارم.» (إِنِّي لَا أُحِبُّ الْآفِلِينَ) و همچنین دید که او برخی از اسباب خود را که موجب استفاده از آن‌ها برای دفع ضروریاتش است، با اعمالی که برای وجود آن سبب مورد اتکا لازم است، خلق می‌کند. پس از اینکه کسی او را به بندگی وادارد که در وجود خود به او نیازمند است، اِبا کرد، زیرا او شبیه اوست. پس خواست به غنی‌ای تکیه کند که نیازمندی ندارد، به دلیل عزت نفس و سربلندی‌اش و آنچه خداوند در طبیعت او از طلب برتری در زمین و تفوق بر جنس قرار داده است. پس گفت: این دعوت‌کننده غایب را اجابت می‌کنم تا ببینم او چیست، شاید همان چیزی باشد که من می‌طلبم. پس امر آنچه او را به آن فراخوانده بود، امتثال کرد و بر طبق آن عمل نمود. پس زمین او «به نور پروردگارش روشن شد.» (بِنُورِ رَبِّهَا) و او همان سرزمین پاک (البلد الطيب) بود که «گیاهش به اذن پروردگارش می‌روید.» (يَخْرُجُ نَبَاتُهُ بِإِذْنِ رَبِّهِ)\n\nو نفس دیگری بر خلاف آن، شهود را بر غیب ترجیح داد و نیازمندی، او را از اختلاف اسباب و جایگزینی هر سبب به جای دیگری کور کرد. و گفت: شاید این غیبی که مرا به آن فراخوانده، مانند شهود، بسیار باشد که یکی از آن‌ها مرا از دیگری بی‌نیاز کند. پس بر حال خود باقی می‌مانم و ذات خود را در مظنونی به زحمت نمی‌اندازم. پس از اجابت دعوت‌کننده سست شد. سپس خداوند به حکمت خود، در زمانی همه اسباب را از او قطع کرد و او را مضطر ساخت. پس چون سببی ظاهری برای تکیه نیافت، به سوی آن غیبی که او را فراخوانده بود متمایل شد، شاید فرجی در دست او باشد که او را از تنگی‌ای که احساس می‌کند، بیرون آورد. پس او را از روی اضطرار اجابت کرد، و او همان سرزمین «ناپاک» (الَّذِي خَبُثَ) است که «گیاهش جز ناچیز (نکد) نمی‌روید.» (لَا يَخْرُجُ نَبَاتُهُ إِلَّا نَكِدًا) خداوند متعال می‌فرماید: «و هنگامی که در دریا به شما زیانی رسد،» (وَإِذَا مَسَّكُمُ الضُّرُّ فِي الْبَحْرِ) و بدین وسیله به محل قطع اسباب تنبیه می‌کند، «هر که را می‌خوانید گم می‌شود،» (ضَلَّ مَنْ تَدْعُونَ) یعنی اسباب را، «مگر او.» (إِلَّا إِيَّاهُ) پس او همان سببی بود که نجات می‌داد. فلما نجاه الله وأغاثه واستقل قال هذا أيضا من جملة الأسباب التي يقوم بعضها عن بعض فيما نريده فجعله واحدا من الأسباب وهو المشرك فما خرج إلا نكدا ولهذا سارع في الرجعة إلى السبب الظاهر فتميز الفريقان وإنما كان فريقان في العالم بهذه المثابة لما حكم به الأصل فإن الأصل فيه جبر واختيار فبالاختيار لم يزل يسقط من الخمسين صلاة عشرا عشرا حتى انتهى إلى خمسة وبعدم الاختيار أثبتها خمسة وقال ما يُبَدَّلُ الْقَوْلُ لَدَيَّ وكان المجبر له ما أعطاه المعلوم فلم يتعد علمه فيه والذين يلجئون فيه إلى الله في حال الاضطرار الكلي استنادهم من حيث لا يعلمون إلى هذا الأصل في الحكم والفريق الآخر استناده إلى حكم الاختيار في أنه تعالى فَعَّالٌ لِما يُرِيدُ فأهل الضرورة في الرجعة أحق وأهل الاختيار في الرجعة أوفق وأسعد فالذي خرج نكدا له من الأحوال الإلهية\n\nپس هنگامی که خداوند او را نجات داد و به فریادش رسید و استقرار یافت، گفت: این نیز از جمله اسبابی است که برخی از آن‌ها در آنچه ما می‌خواهیم، جایگزین برخی دیگر می‌شوند. پس او را یکی از اسباب قرار داد، و او همان مشرک است. پس جز ناچیز (نکد) از او نرویید. و به همین دلیل در بازگشت به سبب ظاهر شتاب کرد. پس دو گروه متمایز شدند. و این دو گروه در عالم به این منزلت، تنها به دلیل حکمی بودند که اصل بر آن حکم کرده است. زیرا اصل در آن جبر و اختیار است. پس به واسطه اختیار، پیوسته از پنجاه نماز، ده تا ده تا کاسته شد تا به پنج رسید. و به واسطه عدم اختیار، آن را پنج ثابت کرد و فرمود: «سخن نزد من تبدیل نمی‌شود.» (مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ) و آنکه او را مجبور کرد، همان معلومی بود که به او عطا کرده بود، پس علم او در آن از حد خود تجاوز نکرد. و کسانی که در حال اضطرار کلی به خدا پناه می‌برند، تکیه آن‌ها از جایی که نمی‌دانند، به این اصل در حکم است. و گروه دیگر، تکیه آن‌ها به حکم اختیار است در اینکه او تعالی «هر چه بخواهد انجام می‌دهد.» (فَعَّالٌ لِمَا يُرِيدُ) پس اهل ضرورت در بازگشت، سزاوارترند و اهل اختیار در بازگشت، موافق‌تر و سعادتمندترند.\n\nو آنکه ناچیز (نکد) رویید، از احوال الهی برای او این سخن خداوند متعال است: «در هیچ کاری که انجام می‌دهم، تردیدی نکردم، مانند تردیدی که در گرفتن جان مؤمن می‌کنم؛ او مرگ را ناخوش می‌دارد و من ناخوش می‌دارم که او را ناراحت کنم، در حالی که چاره‌ای جز ملاقات من ندارد.» (حدیث قدسی)\n\nمی‌گوید: چاره‌ای نیست که او را بمیرانم، با اینکه من ناخوش می‌دارم، و این همان معلومی است که مرا در این حالت قرار داد، زیرا من وقوع این امر را از او می‌دانستم. پس اگر علم نزد او از ممکنات، آن گونه که در نفس خود هستند، حاصل نمی‌شد، تردیدی صحیح نبود و آنچه را انجام داد یا برخی از آنچه را انجام داد، از روی ناخوشایندی انجام نمی‌داد. پس در علمی که این ذکر نزدیک به تو عطا کرده است، بنگر. «و خداوند حق می‌گوید و او راه را هدایت می‌کند.» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 3
}