{
  "id": 331,
  "title": {
    "ar": "الباب الأحد والثلاثون وثلاثمائة في معرفة منزل الرؤية والقوة عليها والتداني والترقي والتلقي والتدلي وهو من الحضرة المحمدية والآدمية",
    "en": "Chapter Three Hundred and Thirty-One: Concerning the Gnosis (المعرفة) of the Station of Vision, the Power (القوة) over it, the Drawing Near (التداني), the Ascent (الترقي), the Reception (التلقي), and the Descent (التدلي); and this station is derived from the Muhammadan Presence (الحضرة المحمدية) and the Adamic Presence.",
    "ur": "باب تین سو اکتیس: رؤیت (الرؤية) کے مقام، اس پر قدرت، تدانی (التداني)، ترقی (الترقي)، تلقی (التلقي)، اور تدلی (التدلي) کی معرفت میں۔ اور یہ (مقام) الحضرة المحمدية (الحضرة المحمدية) اور الحضرة الآدمیہ (الآدمية) سے ہے۔",
    "fa": "باب سیصد و سی و یکم در معرفت منزل رؤیت و توانایی بر آن، و نزدیکی (التداني)، و ارتقاء (الترقي)، و دریافت (التلقي)، و فرود آمدن (التدلي)، و این منزل از حضرت محمدیه (الحضرة المحمدية) و آدمیه (الآدمية) است."
  },
  "content": {
    "ar": "## «الباب الأحد والثلاثون وثلاثمائة في معرفة منزل الرؤية والقوة عليها والتداني والترقي والتلقي والتدلي وهو من الحضرة المحمدية والآدمية»\n\n\n> عجبت لعين كيف تدرك عينها *** وتعجز عن إدراك من قال إنها\n\n\n> ولم يك مشهود سواه وإنما *** شهود ورود الغيب عنها أجنها\n\n\n### [صورة تجلى الحق لعباده‏]\n\n\nاعلم أيدك الله أن هذا المنزل بينه وبين المنزل الذي قبله تخالج‏\n\n\nلكون النبي صَلَّى اللهُ عَليهِ وسَلَّم شبه رؤيتنا الله برؤيتنا القمر ليلة إبداره والشمس ليس دونها سحاب وإنه لا يدركنا في رؤيته ضيم ولا انضمام‏\n\n\nولا ضرر يقوم بنا ولا مضاررة\nلغيرنا وقد أبان صَلَّى اللهُ عَليهِ وسَلَّم لأمته عن صورة تجلى الحق لعباده بقول ما قاله نبي لأمته قبله وبهذا أثنى الله عليه فقال بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ وأرسله رَحْمَةً لِلْعالَمِينَ ولم يخص مؤمنا من كافر\n\n\nفقال صَلَّى اللهُ عَليهِ وسَلَّم لما حذر من الدجال في دعواه الألوهية فقال أقول لكم فيه قولا ما قاله نبي لأمته وما من نبي إلا قد حذر أمته الدجال ألا إن الدجال أعور العين اليمنى كان عينه عنبة طافية وإن ربكم ليس بأعور\n\n\nفعرفنا بأي صورة نرى ربنا ولا يقال إنه أراد صورة لا تقبل العور فكانت فائدة الأخبار ترتفع فإن تلك الصورة كانت تعطي بذاتها نفي العور عنها وإنما لما كانت الصورة ممن يقبل ذلك بين لنا أنه ليس كذلك لما علم من وقوع الشبه فيما وقعت فيه السلامة من العيب وإنما كان الدجال أعور لأنه على نصف الصورة إذ لم يحز رتبة الكمال كما حازها أكثر الرجال ثم نرجع ونقول إن موسى لما كلمه ربه أدركه الطمع فقال رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ فسأل ما يجوز له السؤال فيه إذ كانت الرسل أعلم الناس بالله وأنه ذو إدراك يدركه به وأنه المدرك بالإدراك لا الإدراك فإنه عالم بأن الأبصار لا تدركه وإنما هي آلة يدرك بها وإنما منع موسى من الرؤية لكونه سألها عن غير أمر إلهي أوحي به إليه فإنهم أدباء لا يتبعون إلا ما يوحى به إليهم ولا سيما في الجناب الإلهي فلهذا قيل له لَنْ تَرانِي ثم استدرك استدراك لطيف بعبده لما انتهى فيه حد عقوبة فوت الأدب بالسؤال ابتداء الذي حمله عليه شوقه فكان مثل السكران فلما علم إن الياس قد قام به فيما طلبه استدرك بالإحالة على الجبل في استقراره عند التجلي والجبل من الممكنات فتجلى له ربه فاندك عند ذلك التجلي لكون روحه ما أوجده الله لحفظ الصورة على الجبل مثل الأرواح المدبرة وإنما أوجده ليكون مسبحا له فلذلك لم تحفظ عليه صورة الجبلية وأثر فيه التجلي وحفظ روح موسى عليه السلام على موسى في صعقه عند رؤية ما رآه الجبل الذي كان حجابا عليه صورة نشأته فَلَمَّا أَفاقَ رجع موسى موسى وما رجع الجبل جبلا علم موسى أنه قد وقع منه ما كان ينبغي له أن لا يقع إلا بأمر إلهي فقال تُبْتُ إِلَيْكَ لما علم إِنَّ الله يُحِبُّ التَّوَّابِينَ وأَنَا أَوَّلُ الْمُؤْمِنِينَ بوقوع هذا الجائز إذ ما تقدم لأحد من هذا النوع الإنساني إنه سأل ربه رؤيته ولا أنه رآه فلذلك ادعى موسى أنه أول المؤمنين‏\n\n\nثم أعلمنا صَلَّى اللهُ عَليهِ وسَلَّم إنه ما منا أحد إلا سيرى ربه ويكلمه كفاحا\n\n\nوهذا كله إعلام بالصورة التي يتجلى لنا فيها وهي الصورة التي خلقنا عليها ونحن نعلم قطعا إن ذوق الرسل فوق ذوق الأتباع بما لا يتقارب فلا تظن إن سؤال موسى رؤية ربه أنه فاقد للرؤية التي كانت حالة أبي بكر الصديق رضي الله عنه في قوله ما رأيت شيئا إلا رأيت الله قبله هذه الرؤية ما هي الرؤية التي طلبها موسى من ربه فإنها رؤية حاصلة له لعلو مرتبته فإن ذوق الصادق ما هو ذوق الصديق فالرؤية ثابتة بلا شك ذوقا ونقلا لا عقلا فإن رؤية الله تعالى من محارات العقول ومما يوقف عندها ولا يقطع عليها بحكم من أحكامها الثلاثة إذ ليس للأنبياء ولا للأولياء من أهل الله علم بالله يكون عن فكر قد طهرهم الله عن ذلك بل لهم فتوح المكاشفة بالحق فمن الرائين من يراه ولا يقيد ومنهم من يراه به ومنهم من يراه بنفسه ومنهم من لا يراه عنده وهو قد رآه ولا يعلم أنه رآه لأن هذا الصنف ليس بصاحب علامة في الحق ولا يعرف صورة ظهوره في الوجود ومنهم من لا يراه لعلمه بأن عينه لا تظهر هنا للعالم إلا بصور أحكام أعيان العالم وهو مجلاها فلا يقع الإدراك من الرائي إلا على صورة الحكم لا على العين فيعلم أنه ما رآه ولِلَّهِ الْمَثَلُ الْأَعْلى‏ وهو العزيز الذي لا يرى من حيث هويته الحكيم في تجليه حتى يقال إنه رأى انظر إلى الصورة الظاهرة للعين في الجسم الصقيل وحقق رؤيتك فتجد تلك الصورة قد حالت بينك وبين إدراكك عين الجسم الصقيل الذي هو مجلاها فلا تراه أبدا والحق مجلى صور الممكنات فلم ير العالم إلا العالم في الحق لا بالحق وبالحق ثم لتعلم إن المرئي الذي هو الحق نور وأن الذي يدركه به الرائي إنما هو نور فنور اندرج في نور فكأنه عاد إلى أصله الذي ظهر منه فما رآه سواه وأنت من حيث عينك عين الظل لا عين النور بل النور ما تدرك به كل شي‏ء والنور من الأشياء فلا تدركه إلا من كونك حاملا للنور في عين ظلك والظل راحة والظلمة حجاب فإذا طلع كوكب الحق ووقع في قلب العبد استنار به القلب وأضاء فأزال عن صاحبه الحيرة والخوف فأخبر عن ربه بالصريح والإيماء وأنواع الإخبارات‏\n\n\n### [أن الأنبياء اختارت النوم على ظهورها لعلمها]\n\n\nواعلم أن الأنبياء ما اختارت النوم على ظهورها إلا لعلمها أنه كل ما قابل الوجه فهو أفق له إذ كان لا يقابل الوجه إلا الأفق وثم أفق أدنى أي أقرب إلى الأرض وثم أفق أعلى وهو ما تقابله بوجهك عند استلقائك على‏\nظهرك وإذا كان التجلي في الصور دخله الحد والمقدار وأقرب القرب في ذلك أن يكون عين الخط الذي به تقسم الدائرة نصفين لظهور القوسين اللذين قرب بعضهما من بعض هو القرب الأول والقرب الثاني القرب الخطي الذي هو أقرب من حبل الوريد ولا تكون رؤية الحق أبدا حيث كانت إلا في منازلة بين عروج ونزول فالعروج منا والنزول منه فلنا التداني وله التدلي إذ لا يكون التدلي إلا من أعلى ولنا الترقي وله تلقي الوافدين عليه وذلك كله إعلام بالصورة التي يتجلى فيها لعباده وإنها ذات حد ومقدار ليدخل مع عباده تحت قوله في حكمه وما نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ وكُلَّ شَيْ‏ءٍ خَلَقْناهُ أي جعلناه بِقَدَرٍ والرؤية مخلوقة فهي بقدر والتنوع في التجلي ظهور محدث عند المتجلي له فهو بقدر أ لا ترى تجليه بالحكم في الأعيان المتخذة آلهة للغيرة الإلهية حيث حكم وقضى أنه لا يعبد إلا إياه وكذا أخبر فقال وقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ فعلماء الرسوم يحملون لفظ قضى على الأمر ونحن نحملها على الحكم كشفا وهو الصحيح فإنهم اعترفوا أنهم ما يعبدون هذه الأشياء إلا لتقربهم إلى الله زلفى فأنزلوهم منزلة النواب الظاهرة بصورة من استنابهم وما ثم صورة إلا الألوهية فنسبوها إليهم ولهذا يقضي الحق حوائجهم إذا توسلوا بها إليه غيرة منه على المقام أن يهتضم وإن أخطئوا في النسبة فما أخطئوا في المقام ولهذا قال إِنْ هِيَ إِلَّا أَسْماءٌ سَمَّيْتُمُوها أي أنتم قلتم عنها إنها آلهة وإلا فسموهم فلو سموهم لقالوا هذا حجر أو شجر أو ما كان فتتميز عندهم بالاسمية إذ ما كل حجر عبد ولا اتخذ إلها ولا كل شجر ولا كل جسم منير ولا كل حيوان فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ عليهم بقوله قُلْ سَمُّوهُمْ‏\n\n\n### [لو لا الهوى ما عبد الله في غيره‏]\n\n\nواعلم أنه لو لا الهوى ما عبد الله في غيره وإن الهوى أعظم إله متخذ عبد فإنه لنفسه حكم وهو الواضع كل ما عبد وفيه قلت‏\n\n\n> وحق الهوى إن الهوى سبب الهوى *** ولو لا الهوى في القلب ما عبد الهوى‏\n\n\nقال تعالى أَ فَرَأَيْتَ من اتَّخَذَ إِلهَهُ هَواهُ وأَضَلَّهُ الله عَلى‏ عِلْمٍ فلو لا قوة سلطانه في الإنسان ما أثر مثل هذا الأثر فيمن هو على علم بأنه ليس بإله فإذا كان يوم القيامة جسد الله الهوى كما يجسد الموت لقبول الذبح فإذا جسده قرره على ما حكم به فيمن قام به فحار وجاء بإله عليه فعذب في صورته وأفرد المحل عنه فحصل في النعيم وتجسد المعاني لا تنكر عندنا ولا عند علماء الرسوم فحكمه في هذا مثل الحكم الذي في‏\n\n\nقوله لا يدخل الجنة من في قلبه مثقال ذرة من كبر\n\n\nفكان شيخنا أبو مدين رضي الله عنه يقول صدق يزال فيدخل صاحبه الجنة دونه ويبقى هو في النار صورة مجسدة أو يعود الكبر إلى من هو له فيأخذ كل ذي حق حقه‏\n\n\n### [أن الآلهة المتخذة من دون الله آلهة طائفتان‏]\n\n\nواعلم أن الآلهة المتخذة من دون الله آلهة طائفتان منها من ادعت ما ادعى فيها مع علمهم في أنفسهم أنهم ليسوا كما ادعوا وإنما أحبوا الرئاسة وقصدوا إضلال العباد كفرعون وأمثاله وهم في الشقاء إلا أن تابوا وهم ممن تشهد عليهم ألسنتهم بما نطقت به من هذه الدعوى فما دونها مما يجب عنه السؤال فتنكر ومنها من ادعت ذلك على بصيرة وصحو وتحقق معرفة في مجلس لقرينة حال اقتضاها المجلس لما رأوا أن الحق عين قواهم وما هم هم إلا بقواهم وبقواهم يقولون ما يقولون فقواهم القائلة لا هم وهي عين الحق كما أخبر الحق وكما أعطاه الشهود بانخراق العادة في قولهم عندهم فقالوا أنا الله وإني أنا الله لا إله إلا أنا فاعبدون كأبي يزيد ممن نقل عنه مثل هذا مع صحوه وثبوته وعلمه بأن الحق هو الظاهر بأفعاله في أعيان الممكنات وإنه في بعض الأعيان قد نص أنه هو وفي بعض الأعيان لم يذكر أنه هو ولذلك قال بعض العارفين في حق التلميذ الذي استغنى بالله على زعمه عن رؤية أبي يزيد لأن يرى أبا يزيد مرة خير له من أن يرى الله ألف مرة فعبر أبو يزيد فقيل له هذا أبو يزيد فعند ما وقع بصره عليه مات التلميذ فقيل لأبي يزيد في موته فقال رأى ما لا يطيق لأنه تجلى له من حيث أنا فلم يطقه كما صعق موسى لأن الله من حيث أنا مجلاه أعظم من حيث المجلى الذي كان يشهده فيه ذلك المريد ومنها من ادعت ذلك في حال سكر كالحلاج فقال قول سكران فحبط وخلط لحكم السكر عليه وما أخلص‏\n\n\n> قد تصبرت وهل يصبر *** قلبي عن فؤادي‏\n\n\n> مازجت روحك روحي *** في دنوي وبعادي‏\n\n\n> فأنا أنت كما أنك *** أني ومرادي‏\nفهذا سعد وإن شقي به آخرون فلا جناح عليه ولا حرج لأنه سكران وهم المسئولون ومثل هذا أيضا يلحق بأهل السعادة وإن ضل به عالم فما إضلالهم بمقصود له فهؤلاء أصناف ثلاثة ادعوا الألوهة لأنفسهم فشقي بها واحد من الثلاثة وسعد اثنان وأما الطائفة الأخرى فادعيت فيها الألوهة ولم تدعها لنفسها كالأحجار والنبات والحيوان وبعض الأناسي والأملاك والكواكب والأنوار والجن وجميع من عبد واتخذ إلها من غير دعوى منه فهؤلاء كلهم سعداء والذين اتخذوهم إذا ماتوا على ذلك أشقياء ومن هؤلاء تقع البراءة يوم القيامة من الذين اتخذوهم آلهة من دون الله ما لم يتوبوا قبل الموت ممن يقبل صفة التوبة وليس إلا الجن وهذا النوع الإنساني ومهما علم بذلك المتخذ ولم ينصح ولا وقعت منه البراءة هنا مع كونه لم يدع ذلك ولكنه سكت فإذا عذب الله غدا المشركين الذين ذكرهم الله أنه لا يغفر لهم فإنما يعذبهم من حيث إنهم ظلموا أنفسهم ووقعوا في خلق بكلام ودعوى ساءتهم وتوجهت منهم عليهم حقوق في أغراضهم يطلبونهم بها فمؤاخذة المشركين لحق الغير لا من جهة نفسه تعالى وظلم أنفسهم أعظم من ظلم الغير عند الله بدليل ما جاء في الذي يقتل نفسه من تحريم الجنة عليه فعظم الوعيد في حقه فإذا كان يوم القيامة وأدخل المشركون دار الشقاء وهي جهنم أدخل معهم جميع من عبدوه إلا من هو من أهل الجنة وعمارها فإنهم لا يدخلون معهم لكن تدخل معهم المثل التي كانوا يصورونها في الدنيا فيعبدونها لكونها على صورة من اعتقدوا فيه أنه إله فهم يدخلون النار للعقاب والانتقام والمعبودون يدخلونها لا للانتقام فإنهم ما ادعوا ذلك ولا المثل وإنما أدخلوها نكاية في حق العابدين لها فيعذبهم الله بشهودهم إياهم حتى يعلموا أنهم لا يغنون عنهم من الله شيئا لكونهم ليسوا بآلهة كما ادعوه فيهم قال تعالى إِنَّكُمْ وما تَعْبُدُونَ من دُونِ الله حَصَبُ جَهَنَّمَ أَنْتُمْ لَها وارِدُونَ وقد قرئ حطب جهنم وقال وَقُودُهَا النَّاسُ والْحِجارَةُ وقال لَوْ كانَ هؤُلاءِ آلِهَةً ما وَرَدُوها وقال فيمن عبد من أهل السعادة كمحمد وعيسى عليه السلام والخلفاء من بعده ومن ذكرناه من مدع عن صحو وعن سكران الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنى‏ أُولئِكَ عَنْها مُبْعَدُونَ لا يَسْمَعُونَ حَسِيسَها وهُمْ في ما اشْتَهَتْ أَنْفُسُهُمْ خالِدُونَ فمن كان مشتهاه ربه فهذه صفته وإنما قال لا يَسْمَعُونَ حَسِيسَها وهُمْ في ما اشْتَهَتْ أَنْفُسُهُمْ خالِدُونَ لما يؤثر ذلك السماع في صاحبه من الخوف لأنه ليس هو في تلك الحال بصاحب غضب فيلتذ بالانتقام فإن الغضب لله إنما يقع في دار التكليف وهنالك لا نصيب للغضب في السعداء فإنه موطن شفاعة وشفقة ورحمة من السعداء فلا يغضب في ذلك الموطن إلا الله والسعداء مشغولون بالله في تسكين ذلك الغضب الإلهي بما تعطيه أنواع التسكين كما\n\n\nيقول محمد صَلَّى اللهُ عَليهِ وسَلَّم في بعض المواطن سحقا سحقا\n\n\nطلبا للتسكين والموافقة ثم بعد ذلك يشفع في تلك الطائفة عينها لتنوع ما يظهر الحق به في ذلك الموطن فمن سمع حسيسها من السعداء الأكابر أثر ذلك السماع فيهم خوفا على أممهم لا على نفوسهم فإذا بلغت بهم العقوبة حدها وانقضت فيهم بالعدل مدتها جسدت أهواؤهم التي بها عبدوا غير الله على صور ما اعتقدوه إلها حين عبدوه وعلى صور بواطنهم فوقع العذاب بصور مجسدة ليبقى حكم الأسماء دائما ويبقى سكان الدار من الناس حيث هم أهلها في نعيم بها ينظرون إلى صور أهوائهم معذبة فينعمون بها فإنها دار تتجسد فيها المعاني صورا قائمة يشهدها البصر كالموت في صورة كبش أملح فيذبحه يحيى عليه السلام بين الجنة والنار لأن الحياة ضد الموت فلا يزول الموت إلا بوجود الحياة وبهذه الصور المخلوقة يكون مل‏ء النار والجنة فإنه أخبر الجنة والنار أنه سبحانه يملأ كل واحدة فقال لهما إن لكل واحدة منكما ملأها فإذا نزلوا فيها وبقي منها أماكن لم يبلغها عمارة أهلها أنشأ إرادات أهل الدارين صورا قائمة ملأهما بها وهذه الصور من الفرقتين المعبر عنهما بالقدمين ففي أهل السعادة أَنَّ لَهُمْ قَدَمَ صِدْقٍ عِنْدَ رَبِّهِمْ أي سابق عناية بأن يخلق إرادتهم طاعة الله وعبادته صورا متجسدة وأعمالهم وقد ورد أن أعمال العباد ترد عليهم في قبورهم في صور حسنة تؤنسهم وفي صور قبيحة توحشهم فتلك الصور تدخل معهم في دار السعادة والشقاء وبها يكون ملؤهما وأما دار الشقاء إذا طلبت ملأها من الله وضع فيها الجبار قدمه فلهم قدم أيضا كما كان لأهل السعادة أي سابق عناية يظهر العذاب في ذلك القدم وهو أهواؤهم فدار السعداء التي هي الجنة نعيم كلها ليس فيها شي‏ء يغاير النعيم ودار الأشقياء ممتزجة بين منعم ومعذب فإن فيها ملائكة العذاب لهم نعيم في تعذيب من سلطهم الله عليه فلا نعيم لهم إلا بالانتقام‏\nلله وهم أصحاب تكليف بأمر لا بنهي فهم يسارعون إلى امتثال أوامر الله لا يَعْصُونَ الله ما أَمَرَهُمْ ويَفْعَلُونَ ما يُؤْمَرُونَ فلا يبقى عذاب في النار بعد انقضاء مدته إلا العذاب الممثل المتخيل في حضرة الخيال لبقاء أحكام الأسماء فإنه ليس للاسم إلا ما تطلبه حقيقته من ظهور حكمه وليس له تعيين حضرة ولا شخص وإنما ذلك من حكم الاسم العالم والمريد فحيث ظهر حكم المنتقم من جسد أو جسم أو ما كان فقد استوفى حقه بظهور حكمه وتأثيره فلا تزال الأسماء الإلهية مؤثرة حاكمة أبد الآبدين في الدارين وما أهلهما منهما بمخرجين ولما كانت الرؤية لأهل الجنان جعل الحجاب في مقابلته لأهل النار وحجابهم مدة عذابهم حتى لا تزيدهم الرؤية عذابا كما زادتهم السورة القرآنية هنا رِجْساً إِلَى رِجْسِهِمْ ومرضا إلى مرضهم فإذا انقضت المدة بقي الحجاب دونهم مسدلا لينعموا فإنه لو تجلى لهم هنالك مع ما تقدم لهم من الإساءة واستحقاق العقوبة أورثهم ذلك التجلي الإحساني حياء من الله مما جرى منهم والحياء عذاب وقد انقضت مدته وهم لا يعلمون لذة الشهود والرؤية فلهم نعيم بالحجاب والغرض النعيم وقد حصل ولكن بمن فأين النعيم برؤية الله من النعيم بالحجاب فهم عن ربهم يومئذ محجوبون والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ ويَهْدِي من يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ‏\n\n",
    "en": "## Chapter Three Hundred and Thirty-One concerning the Gnosis of the Station of Vision (الرؤية), the Power over it, Drawing Near (التداني), Ascent (الترقي), Reception (التلقي), and Descent (التدلي), which is from the Muhammadan and Adamic Presence (الحضرة المحمدية والآدمية)\n\nI wonder at an eye, how it perceives its own essence,\nYet fails to perceive Him who decreed its existence.\nAnd nothing is witnessed but Him, yet\nThe witnessing of the arrival of the Unseen conceals Him from it.\n\n### The Form of the Theophany (تجلى) of The Real (الحق) to His Servants\n\nKnow, may Allah strengthen you, that this Station (منزل) has a conflict (تخالج) with the Station preceding it, due to the Prophet (peace be upon him) likening our vision of Allah to our vision of the moon on the night it is full, or the sun when there is no cloud below it, and that no distress (ضيم) or crowding (انضمام) will afflict us in seeing Him, nor any harm (ضرر) befall us, nor mutual injury (مضاررة) to others.\n\nThe Prophet (peace be upon him) clarified for his community the form of the Theophany (تجلى) of The Real (الحق) to His servants with a statement no prophet before him had made to his community. Because of this, Allah praised him, saying: <<بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ>> (He is compassionate, merciful to the believers), and sent him as <<رَحْمَةً لِلْعالَمِينَ>> (a mercy to the worlds), not distinguishing between believer and disbeliever.\n\nThe Prophet (peace be upon him), when warning against the Dajjal (Antichrist) claiming divinity, said: \"I will tell you something about him that no prophet has told his nation before. Every prophet has warned his nation against the Dajjal. Behold, the Dajjal is blind in the right eye; his eye is like a floating grape. But your Lord is not one-eyed.\"\n\nThus, he informed us of the form in which we shall see our Lord. It cannot be said that he intended a form inherently incapable of being one-eyed, for that would negate the benefit of the warning. Rather, because the form is one that *could* accept that defect, he clarified that Allah is not like that, knowing that confusion might arise regarding the safety from defect. The Dajjal is one-eyed because he represents only half of the Form, having not attained the rank of perfection (الكمال) as most men have.\n\nReturning, we say that when Moses (peace be upon him) was addressed by his Lord, he was overcome by longing and said: <<رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ>> (My Lord, show me [Yourself] that I may look upon You). He asked for something permissible for him to ask, since the Messengers are the most knowledgeable of people concerning Allah, and that He possesses perception (إدراك) by which He is perceived, and that He is the Perceived by perception, not that perception *is* the perceiver. He knew that eyes (الأبصار) do not perceive Him; they are merely tools for perception.\n\nMoses was only prevented from the Vision (الرؤية) because he requested it without a Divine command (أمر إلهي) revealed to him. For they are disciplined (أدباء); they follow only what is revealed to them, especially concerning the Divine Presence (الجناب الإلهي). Therefore, he was told: <<لَنْ تَرانِي>> (You shall not see Me).\n\nThen, Allah provided a subtle correction (استدراك لطيف) for His servant when he reached the limit of punishment for the lack of proper conduct in making the initial request, which was driven by his longing, making him like one intoxicated (السكران). When Allah knew that despair had overcome him regarding his request, He provided the correction by referring him to the mountain (الجبل) and its stability during the Theophany (التجلي). The mountain is one of the contingent beings (الممكنات).\n\nHis Lord disclosed Himself to it, and the mountain crumbled (اندك) at that Theophany, because the spirit (روح) that Allah created to maintain the mountain’s form was not like the governing spirits (الأرواح المدبرة); He created it only to glorify Him (مسبحا له). Therefore, the mountain’s form was not preserved, and the Theophany affected it. However, the spirit of Moses (عليه السلام) was preserved for Moses during his swoon (صعقه) upon witnessing what the mountain saw—the form of his own creation (صورة نشأته) which was a veil (حجاب) for him.\n\n<<فَلَمَّا أَفاقَ>> (When he recovered), Moses returned as Moses, but the mountain did not return as a mountain. Moses knew that he had done something that should only have been done by Divine command. He said: <<تُبْتُ إِلَيْكَ>> (I turn in repentance to You), knowing that <<إِنَّ الله يُحِبُّ التَّوَّابِينَ>> (Indeed, Allah loves those who repent), and [he added] <<وَأَنَا أَوَّلُ الْمُؤْمِنِينَ>> (and I am the first of the believers) in the possibility of this permissible event, since no one of this human species (النوع الإنساني) before him had asked his Lord for vision or had seen Him. Therefore, Moses claimed to be the first of the believers.\n\nThen the Prophet (peace be upon him) informed us that every one of us shall see his Lord and speak to Him directly (كفاحا). All this is an announcement of the Form in which He will disclose Himself to us, which is the Form upon which we were created. We know with certainty that the spiritual taste (ذوق) of the Messengers is far superior to that of the followers, beyond comparison.\n\nDo not think that Moses’ request for vision meant he lacked the vision possessed by Abu Bakr al-Siddiq (may Allah be pleased with him) when he said: \"I have not seen anything except that I saw Allah before it.\" This vision is not the vision Moses requested from his Lord, for that vision was already attained by Moses due to his high rank. The taste of the Truthful (الصادق) is not the taste of the Veracious (الصديق).\n\nVision (الرؤية) is undoubtedly established by spiritual taste (ذوقا) and transmitted report (نقلا), but not by intellect (عقلا). For the vision of Allah (Exalted is He) is among the impossibilities for the intellect (محارات العقول), something at which the intellect must stop, without applying any of its three judgments. For the prophets and the Friends of Allah (أهل الله) do not possess knowledge (علم) of Allah derived from reflection (فكر); Allah has purified them from that. Rather, they receive the unveilings (فتوح المكاشفة) of The Real (الحق).\n\nAmong those who see (الرائين), some see Him without restriction, some see Him *by* Him, some see Him *by* themselves, and some do not see Him *at* themselves even though they have seen Him, because this last group does not possess a sign (علامة) in The Real and does not recognize the form of His manifestation (صورة ظهوره) in Existence (الوجود). Others do not see Him because they know that His Essence (عينه) does not appear here to the world (العالم) except in the forms of the rulings (أحكام) of the world's Fixed Entities (الأعيان الثابتة), which are His mirrors (مجلاها). Therefore, the perception (الإدراك) of the seer falls only upon the form of the ruling, not upon the Essence. Thus, he knows he has not seen Him. <<وَلِلَّهِ الْمَثَلُ الْأَعْلى>> (And to Allah belongs the highest example). He is the Mighty (العزيز) who is not seen from the perspective of His Ipseity (هويته), and the Wise (الحكيم) in His Theophany (تجلي) such that one can say He was seen.\n\nLook at the image (الصورة) visible to the eye in a polished body (الجسم الصقيل) and verify your vision. You will find that this image has come between you and your perception of the essence of the polished body, which is its mirror (مجلاها). Thus, you never see it. The Real (الحق) is the mirror (مجلى) for the forms of the contingent beings (الممكنات). Therefore, the world (العالم) sees nothing but the world *in* The Real, not *by* The Real, and *with* The Real.\n\nFurthermore, know that the Seen (المرئي), which is The Real, is Light (نور), and that which the seer perceives Him by is also Light. So, Light is absorbed into Light, and it is as if it returned to its origin from which it appeared, so nothing other than Him saw Him. You, from the perspective of your essence (عينك), are the essence of the shadow (الظل), not the essence of the Light. Rather, Light is that by which you perceive everything, and Light is one of the things. Thus, you perceive it only by virtue of carrying the Light within the essence of your shadow. Shadow is rest (راحة), and darkness (الظلمة) is a veil (حجاب). When the star of The Real (كوكب الحق) rises and falls into the servant's heart, the heart is illuminated and shines, removing confusion (الحيرة) and fear (الخوف) from its owner, who then speaks of his Lord clearly, by allusion, and through various forms of communication.\n\n### That the Prophets chose to sleep on their backs due to their knowledge\n\nKnow that the Prophets only chose to sleep on their backs (على ظهورها) because they knew that whatever faces the face (الوجه) is an horizon (أفق) for it, since only the horizon faces the face. There is a lower horizon (أفق أدنى), meaning closer to the earth, and a higher horizon (أفق أعلى), which is what faces your face when you lie on your back.\n\nIf the Theophany (التجلي) occurs in forms (الصور), it involves limit (الحد) and measure (المقدار). The closest proximity (أقرب القرب) in this regard is the very line (الخط) by which the circle is divided into two halves, for the appearance of the two arcs whose proximity to each other is the first proximity. The second proximity is the linear proximity (القرب الخطي) which is closer than the jugular vein (حبل الوريد).\n\nThe vision of The Real (الحق), wherever it occurs, is always in a state of encounter (منازلة) between ascent (عروج) and descent (نزول). The ascent is from us, and the descent is from Him. Thus, we have the drawing near (التداني), and He has the descent (التدلي), since descent can only be from above. We have the ascent (الترقي), and He has the reception (تلقي) of those who approach Him.\n\nAll this is an announcement of the Form in which He discloses Himself to His servants, and that it possesses limit and measure, so that He may enter with His servants under His ruling: <<وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ>> (And We do not send it down except with a known measure). And <<وَكُلَّ شَيْ‏ءٍ خَلَقْناهُ>> (And everything We created), meaning We made it, <<بِقَدَرٍ>> (by measure). Vision (الرؤية) is created, so it is by measure. The variation in the Theophany is a manifestation created for the recipient, so it is by measure.\n\nDo you not see His Theophany through the ruling (الحكم) concerning the entities (الأعيان) taken as deities, due to Divine jealousy (الغيرة الإلهية), where He ruled and decreed that none shall be worshipped but Him? He also informed us, saying: <<وَقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ>> (And your Lord has decreed that you worship none but Him). Scholars of external law (علماء الرسوم) interpret the word *qaḍā* (decreed) as a command. We interpret it, through unveiling (كشفا), as a ruling, which is the correct view. For [the idolaters] admitted that they only worshipped these things to bring them closer to Allah (زلفى). Thus, they placed them in the rank of deputies (النواب) appearing in the form of those who deputized them. Since there is no form but Divinity (الألوهية), they attributed it to them.\n\nThis is why The Real (الحق) fulfills their needs when they intercede through these [idols]—out of jealousy for the Station (المقام) that it should not be diminished, even if they erred in the attribution. They did not err concerning the Station. That is why He said: <<إِنْ هِيَ إِلَّا أَسْماءٌ سَمَّيْتُمُوها>> (They are nothing but names which you have named), meaning, *you* called them deities. Otherwise, He said: \"Call them by name\" (قُلْ سَمُّوهُمْ). If they named them, they would say: \"This is a stone,\" or \"a tree,\" or whatever it was, distinguishing them by their name, since not every stone, tree, luminous body, or animal was worshipped or taken as a god. <<فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ>> (So, to Allah belongs the conclusive argument) against them by His saying: <<قُلْ سَمُّوهُمْ>> (Say, name them).\n\n### Were it not for Passion (الهوى), Allah would not be worshipped in anything else\n\nKnow that were it not for Passion (الهوى), Allah would not be worshipped in anything else. Passion is the greatest deity (إله) taken and worshipped, for it rules over the self, and it is the one that establishes everything that is worshipped. Concerning this, I said:\n\nBy the truth of Passion, Passion is the cause of desire,\nAnd were it not for Passion in the heart, desire would not be worshipped.\n\nAllah (Exalted is He) said: <<أَ فَرَأَيْتَ من اتَّخَذَ إِلهَهُ هَواهُ وأَضَلَّهُ الله عَلى‏ عِلْمٍ>> (Have you seen he who takes his passion as his god, and whom Allah has led astray knowingly?). Were it not for the strength of its dominion (سلطانه) in man, it would not have such an effect on one who knows that it is not a god.\n\nOn the Day of Resurrection, Allah will embody Passion (جسد الله الهوى), just as He will embody Death (الموت) for the purpose of slaughtering it. When He embodies it, He will hold it accountable for what it decreed concerning those in whom it resided. The person will be confused, and Passion will come with its own god upon it, and the person will be punished in its form, while the locus is separated from it, thus attaining bliss (النعيم).\n\nThe embodiment of meanings (تجسد المعاني) is not denied by us, nor by the scholars of external law. The ruling concerning this is like the ruling in the saying: \"No one who has the weight of a mustard seed of arrogance (كبر) in his heart will enter Paradise.\" Our Shaykh, Abu Madyan (may Allah be pleased with him), used to say: \"The arrogance is removed, and its owner enters Paradise without it, while the arrogance remains in the Fire as an embodied form, or the arrogance returns to the one to whom it belongs, so that everyone who has a right receives his right.\"\n\n### That the Deities taken besides Allah are of two groups\n\nKnow that the deities taken besides Allah are of two groups. One group claimed the divinity attributed to them, even though they knew in themselves that they were not as claimed. They sought only leadership and intended to mislead the servants, like Pharaoh and his likes. They are in misery (الشقاء) unless they repent. They are those whose tongues will testify against them concerning the claims they made, or lesser claims for which they must be questioned, and they will deny them.\n\nThe second group claimed divinity based on insight (بصيرة), sobriety (صحو), and verified gnosis (تحقق معرفة) in a specific context (مجلس) necessitated by the state. They saw that The Real (الحق) is the essence of their powers (قواهم), and they are nothing but their powers, and by their powers they speak what they speak. Their powers are the speaker, not they themselves, and these powers are the very Essence of The Real (عين الحق), as The Real informed and as the witnessing (الشهود) granted them through the breaking of habit (انخراق العادة) in their saying. Thus, they said: \"I am Allah,\" and \"Verily, I am Allah, there is no god but I, so worship Me,\" like Abu Yazid [al-Bistami], from whom such a statement is transmitted, despite his sobriety and stability, and his knowledge that The Real is the Manifestor (الظاهر) through His Acts (أفعاله) in the Fixed Entities (أعيان الممكنات). In some entities, He explicitly stated that He is [the speaker], and in others, He did not mention that He is.\n\nBecause of this, one of the Gnostics (العارفين) said concerning a disciple who claimed to be self-sufficient in Allah from seeing Abu Yazid: \"To see Abu Yazid once is better for him than to see Allah a thousand times.\" Abu Yazid passed by, and it was said to the disciple, \"This is Abu Yazid.\" When his gaze fell upon him, the disciple died. Abu Yazid was asked about his death, and he replied: \"He saw what he could not bear, because I disclosed myself to him from the perspective of 'I' (من حيث أنا), and he could not bear it, just as Moses swooned (صعق). For Allah, from the perspective of 'I', is a greater mirror (مجلاه أعظم) than the mirror in which that disciple used to witness Him.\"\n\nAnother group claimed divinity in a state of intoxication (سكر), like al-Hallaj, who spoke the words of an intoxicated person. He failed and mixed things up due to the ruling of intoxication upon him, and he was not sincere:\n\nI have sought patience, but how can my heart\nbe patient away from my core?\nYour spirit mingled with my spirit\nin my proximity and my distance.\nSo I am You, just as You\nare I, and that is my desire.\n\nThis one is fortunate (سعد), even if others are made miserable by him. There is no blame or hardship upon him because he is intoxicated, and the others are the ones held accountable. This type is also counted among the people of felicity (أهل السعادة), even if a world is led astray by him, for their misguidance was not his intention.\n\nThese are three types who claimed divinity for themselves: one of the three is miserable, and two are felicitous. As for the other group, divinity was claimed *for* them, but they did not claim it for themselves, such as stones, plants, animals, some humans, angels, stars, lights, jinn, and everyone worshipped and taken as a god without a claim from them. All of these are felicitous (سعداء). Those who took them as gods, if they die upon that, are miserable (أشقياء).\n\nOn the Day of Resurrection, those who were worshipped will disavow those who took them as gods besides Allah, unless they repented before death—and repentance is only accepted from the Jinn and this human species. If the worshipped entity knew of this and did not advise against it or disavow it here [in the world], even though they did not claim divinity, but remained silent—then when Allah punishes the polytheists (المشركين) tomorrow, whom Allah said He will not forgive, He punishes them only because they wronged themselves and wronged creation (خلق) through words and claims that displeased the worshipped entities, and rights were established against them in their intentions, which they demand.\n\nThe accountability of the polytheists is due to the rights of others, not from the perspective of His Essence (نفسه تعالى). Wronging themselves is greater than wronging others in the sight of Allah, as evidenced by the severe threat against one who kills himself (تحريم الجنة عليه).\n\nWhen the Day of Resurrection comes and the polytheists are admitted to the Abode of Misery (دار الشقاء), which is Hell (جهنم), everyone they worshipped will be admitted with them, except those who are inhabitants of Paradise (أهل الجنة) and its builders. They will not enter with them, but the images (المثل) that the polytheists fashioned in the world and worshipped will enter with them, because they were in the form of the entity they believed to be a god. The polytheists enter the Fire for punishment (العقاب) and vengeance (الانتقام). The worshipped entities enter it, not for vengeance, for they did not claim divinity, nor did the images. Rather, they are admitted to spite (نكاية) the worshippers, so Allah punishes the worshippers by their witnessing (شهودهم) these entities, until they know that they can avail them nothing against Allah, because they are not deities as claimed.\n\nAllah (Exalted is He) said: <<إِنَّكُمْ وَمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ حَصَبُ جَهَنَّمَ أَنْتُمْ لَهَا وَارِدُونَ>> (Indeed, you and what you worship other than Allah are the fuel [ḥaṣab] of Hell; you will enter it). It has also been read as *ḥaṭab* (wood/fuel). And He said: <<وَقُودُهَا النَّاسُ وَالْحِجارَةُ>> (Whose fuel is men and stones). And He said: <<لَوْ كَانَ هَؤُلَاءِ آلِهَةً مَا وَرَدُوهَا>> (Had these been gods, they would not have entered it).\n\nConcerning those worshipped who are among the people of felicity, such as Muhammad and Jesus (peace be upon them), the Caliphs after him, and those we mentioned who claimed divinity out of sobriety or intoxication: <<الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنَى أُولَئِكَ عَنْهَا مُبْعَدُونَ>> (Indeed, those for whom the best [reward] has preceded from Us—those will be removed far from it). <<لَا يَسْمَعُونَ حَسِيسَهَا وَهُمْ فِي مَا اشْتَهَتْ أَنْفُسُهُمْ خالِدُونَ>> (They will not hear its sound, and they will abide eternally in what their souls desire). Whoever's desire is his Lord, this is his description. He said, \"They will not hear its sound, and they will abide eternally in what their souls desire,\" because hearing that sound would instill fear (الخوف) in the listener, as he is not in a state of wrath (غضب) to take pleasure in vengeance.\n\nWrath (الغضب) for Allah occurs only in the Abode of Responsibility (دار التكليف). There, wrath has no share among the felicitous, for it is a station of intercession (شفاعة), compassion (شفقة), and mercy (رحمة) from the felicitous. Only Allah is wrathful in that station. The felicitous are preoccupied with Allah in calming that Divine Wrath (الغضب الإلهي) through various means of appeasement, just as Muhammad (peace be upon him) says in some stations, \"Away! Away!\" (سحقا سحقا) seeking appeasement and agreement. Then, after that, he intercedes for that very group, due to the variety of ways The Real manifests in that station.\n\nIf the great felicitous ones hear the sound of the Fire, that hearing affects them with fear for their nations, not for themselves. When the punishment reaches its limit and its duration is completed by justice, their passions (أهواؤهم)—by which they worshipped other than Allah—will be embodied (جسدت) in the forms of what they believed to be a god when they worshipped it, and in the forms of their inner states (بواطنهم). The punishment will fall upon these embodied forms, so that the ruling of the Names (الأسماء) remains eternal, and the inhabitants of the Abode [Hell], who are its people, remain in bliss (نعيم) within it, looking at the forms of their passions being punished, and thus finding enjoyment in it.\n\nFor that Abode is one where meanings are embodied as standing forms witnessed by the eye, like Death in the form of a speckled ram (كبش أملح) slaughtered by [the command of] Life between Paradise and the Fire, because life is the opposite of death, and death is only removed by the existence of life. It is by these created forms that the Fire and Paradise are filled. Allah informed Paradise and the Fire that He will fill each one. He said to them that each of them has its fill. When the inhabitants descend into them, and there remain spaces not reached by their inhabitants, He will create the intentions (إرادات) of the people of the two Abodes as standing forms, filling them with these.\n\nThese forms are from the two groups referred to as the two Feet (القدمين). For the people of felicity: <<أَنَّ لَهُمْ قَدَمَ صِدْقٍ عِنْدَ رَبِّهِمْ>> (That they have a sure footing [qadam ṣidq] with their Lord), meaning a precedence of providence (سابق عناية) in that He creates their intentions for obedience to Allah and His worship as embodied forms, along with their deeds. It has been reported that the deeds of servants return to them in their graves in beautiful forms that comfort them, and in ugly forms that terrify them. These forms enter with them into the Abode of Felicity and Misery, and by them, the two are filled.\n\nAs for the Abode of Misery, when it requests its fill from Allah, the Almighty (الجبار) places His Foot (قدمه) in it. They also have a Foot, just as the people of felicity do, meaning a precedence of providence through which the punishment manifests in that Foot, which is their passions (أهواؤهم).\n\nThe Abode of the Felicitous, which is Paradise, is entirely bliss (نعيم); there is nothing in it contrary to bliss. The Abode of the Miserable is mixed between the blissful and the punished, for it contains the angels of punishment (ملائكة العذاب), who find bliss in punishing those over whom Allah has given them authority. Their bliss is only through vengeance for Allah. They are under obligation (أصحاب تكليف) by command, not by prohibition. They hasten to obey the commands of Allah: <<لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ>> (They do not disobey Allah in what He commands them and they do what they are commanded).\n\nNo punishment remains in the Fire after its duration has ended except the represented, imagined punishment (العذاب الممثل المتخيل) in the Presence of Imagination (حضرة الخيال), due to the persistence of the rulings of the Names (الأسماء). For the Name (الاسم) only requires the manifestation of its ruling, as demanded by its reality. It does not require the designation of a Presence (حضرة) or a person (شخص); that is only from the ruling of the Names the Knower (العالم) and the Willer (المريد). Wherever the ruling of the Avenger (المنتقم) manifests—whether in an embodied form, a body, or whatever it may be—He has fulfilled His right through the manifestation and effect of His ruling. Thus, the Divine Names (الأسماء الإلهية) remain effective and ruling for all eternity in the two Abodes, and their inhabitants will not be removed from them.\n\nSince the Vision (الرؤية) is for the people of the Gardens (أهل الجنان), the veil (الحجاب) is established opposite it for the people of the Fire. Their veil lasts for the duration of their punishment, so that the Vision does not increase their torment, just as the Quranic chapter here increased them in <<رِجْساً إِلَى رِجْسِهِمْ>> (filth upon their filth) and sickness upon their sickness. When the duration ends, the veil remains drawn before them so that they may enjoy bliss. For if He were to disclose Himself to them there, given their past misdeeds and deserved punishment, that benevolent Theophany (التجلي الإحساني) would cause them shame (حياء) before Allah for what they did, and shame is a torment. Their period of torment has ended, and they do not know the pleasure of Witnessing (الشهود) and Vision. Thus, they have bliss through the veil, and the goal is bliss, which has been achieved. But by whom? Where is the bliss of seeing Allah compared to the bliss of the veil? <<فَهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ مَحْجُوبُونَ>> (Indeed, from their Lord, that Day, they will be veiled). And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides the way) and <<وَيَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ>> (and guides whom He wills to a straight path).",
    "ur": "باب تین سو اکتیس: رؤیت (الرؤیۃ) کے منزل، اس پر قوت، قربت (التدانی)، ترقی (الترقي)، وصول (التلقي)، اور نزول (التدلی) کی معرفت میں، اور یہ حضور محمدیہ (الحضرۃ المحمدیۃ) اور آدمیہ سے ہے۔\n\nمیں اس آنکھ پر حیران ہوں کہ وہ اپنی ذات کو کیسے دیکھ لیتی ہے،\nاور اس ذات کے ادراک سے عاجز ہے جس نے اسے 'آنکھ' کہا۔\nاس کے سوا کوئی مشہود نہیں، اور حقیقت یہ ہے کہ\nغیب کے ورود کا شہود (الشہود) اسے اس سے بے خبر کر دیتا ہے۔\n\n### ذات حق کے اپنے بندوں پر ظہور الٰہی کی صورت\n\nجان لو، اللہ تمہاری تائید کرے، کہ اس منزل (المنزل) اور اس سے پچھلی منزل کے درمیان ایک کشمکش ہے۔\n\nکیونکہ نبی اکرم صلی اللہ علیہ وسلم نے اللہ کی ہماری رؤیت (الرؤیۃ) کو چودھویں رات کے چاند اور ایسے سورج کی رؤیت سے تشبیہ دی ہے جس کے نیچے کوئی بادل نہ ہو، اور یہ کہ اس کی رؤیت میں ہمیں کوئی ظلم، کوئی تنگی، نہ ہمیں کوئی نقصان پہنچے گا اور نہ ہی کسی دوسرے کو کوئی ضرر ہوگا۔\n\nاور آپ صلی اللہ علیہ وسلم نے اپنی امت کے لیے ذات حق (الحق) کے اپنے بندوں پر ظہور الٰہی (التجلی) کی صورت کو ایسے قول کے ذریعے واضح کیا جو آپ سے پہلے کسی نبی نے اپنی امت سے نہیں کہا تھا۔ اسی وجہ سے اللہ نے آپ کی تعریف کی اور فرمایا: **بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ** (مؤمنوں پر بہت مہربان، نہایت رحم والا ہے) اور آپ کو **رَحْمَةً لِلْعالَمِينَ** (تمام جہانوں کے لیے رحمت) بنا کر بھیجا، اور اس میں مؤمن اور کافر کی تخصیص نہیں کی۔\n\nچنانچہ آپ صلی اللہ علیہ وسلم نے جب دجال کے الوہیت کے دعوے سے ڈرایا تو فرمایا: \"میں تمہیں اس کے بارے میں ایک ایسی بات بتاتا ہوں جو کسی نبی نے اپنی امت سے نہیں کہی، اور کوئی نبی ایسا نہیں گزرا جس نے اپنی امت کو دجال سے نہ ڈرایا ہو۔ خبردار! دجال دائیں آنکھ سے کانا ہوگا، اس کی آنکھ ابھرے ہوئے انگور کی طرح ہوگی، اور تمہارا رب کانا نہیں ہے۔\"\n\nپس آپ نے ہمیں بتا دیا کہ ہم اپنے رب کو کس صورت میں دیکھیں گے، اور یہ نہیں کہا جائے گا کہ آپ کا مطلب ایسی صورت تھی جو کانے پن کو قبول نہ کرے، کیونکہ اس صورت میں خبر دینے کا فائدہ ختم ہو جاتا۔ اگرچہ وہ صورت اپنی ذات میں کانے پن کی نفی کرتی تھی، لیکن جب وہ صورت ایسی تھی جو اس عیب کو قبول کر سکتی تھی، تو آپ نے ہمارے لیے واضح کر دیا کہ وہ ایسا نہیں ہے، کیونکہ آپ کو معلوم تھا کہ جہاں عیب سے سلامتی ہو وہاں بھی مشابہت کا شبہ واقع ہو جاتا ہے۔ دجال کانا اس لیے ہے کہ وہ نصف صورت پر ہے، کیونکہ اس نے کمال کا مرتبہ حاصل نہیں کیا جیسا کہ اکثر مردوں نے حاصل کیا ہے۔\n\nپھر ہم پلٹتے ہیں اور کہتے ہیں کہ جب موسیٰ علیہ السلام سے ان کے رب نے کلام کیا تو ان پر طمع غالب آ گیا اور انہوں نے عرض کیا: **رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ** (اے میرے رب! مجھے دکھا کہ میں تجھے دیکھوں)۔ انہوں نے ایسی چیز کا سوال کیا جس کا سوال کرنا ان کے لیے جائز تھا، کیونکہ رسول اللہ کے بارے میں سب سے زیادہ علم رکھنے والے ہوتے ہیں، اور یہ کہ وہ (اللہ) ادراک والا ہے جس کے ذریعے اسے ادراک کیا جاتا ہے، اور وہ ادراک کے ذریعے ادراک کیا جانے والا ہے نہ کہ خود ادراک۔ کیونکہ وہ جانتے تھے کہ آنکھیں اسے ادراک نہیں کر سکتیں، بلکہ وہ صرف ایک آلہ ہیں جس کے ذریعے ادراک کیا جاتا ہے۔\n\nاور موسیٰ علیہ السلام کو رؤیت (الرؤیۃ) سے صرف اس لیے منع کیا گیا کہ انہوں نے یہ سوال کسی الٰہی حکم کے بغیر کیا جو ان کی طرف وحی کیا گیا ہو۔ کیونکہ وہ (انبیاء) باادب ہوتے ہیں اور صرف اسی کی پیروی کرتے ہیں جو ان کی طرف وحی کیا جائے، خاص طور پر حضور الٰہی (الجناب الإلهي) میں۔ اسی لیے ان سے کہا گیا: **لَنْ تَرانِي** (تم مجھے ہرگز نہیں دیکھ سکو گے)۔ پھر اللہ نے اپنے بندے کے لیے ایک لطیف تدارک کیا، جب وہ اس حد تک پہنچ گئے جہاں بے ادبی کی سزا سوال کی ابتدا میں ہی لازم ہو گئی تھی، جس پر ان کے شوق نے انہیں مجبور کیا تھا، تو وہ ایک نشے میں دھت شخص کی طرح تھے۔ جب اللہ نے جان لیا کہ جو کچھ انہوں نے طلب کیا ہے، اس میں ان کے اندر ایک پیاس موجود ہے، تو اس نے پہاڑ پر احالہ کر کے تدارک کیا کہ وہ ظہور الٰہی (التجلی) کے وقت اپنی جگہ پر قائم رہے۔ اور پہاڑ ممکنات میں سے ہے۔ پس ان کے رب نے ان پر ظہور الٰہی (التجلی) فرمایا، تو وہ اس ظہور الٰہی (التجلی) کے وقت ریزہ ریزہ ہو گیا، کیونکہ اللہ نے اس کی روح کو پہاڑ پر صورت کو محفوظ رکھنے کے لیے پیدا نہیں کیا تھا، جیسے کہ مدبر ارواح ہوتی ہیں، بلکہ اسے صرف تسبیح کرنے کے لیے پیدا کیا تھا۔ اسی لیے اس پر پہاڑی صورت محفوظ نہ رہی اور ظہور الٰہی (التجلی) نے اس پر اثر کیا۔ اور موسیٰ علیہ السلام کی روح کو ان پر محفوظ رکھا گیا، جب وہ اس چیز کو دیکھ کر بے ہوش ہوئے جو پہاڑ نے دیکھی تھی، جو ان کی نشأت کی صورت پر پردہ تھا۔ **فَلَمَّا أَفاقَ** (پھر جب وہ ہوش میں آئے) تو موسیٰ، موسیٰ ہی رہے اور پہاڑ، پہاڑ نہ رہا۔ موسیٰ علیہ السلام نے جان لیا کہ ان سے وہ کام سرزد ہوا ہے جو انہیں صرف الٰہی حکم سے ہی کرنا چاہیے تھا۔ چنانچہ انہوں نے عرض کیا: **تُبْتُ إِلَيْكَ** (میں تیری طرف توبہ کرتا ہوں) جب انہوں نے جان لیا کہ **إِنَّ الله يُحِبُّ التَّوَّابِينَ** (بے شک اللہ توبہ کرنے والوں کو پسند کرتا ہے) اور **أَنَا أَوَّلُ الْمُؤْمِنِينَ** (اور میں سب سے پہلا ایمان لانے والا ہوں) اس جائز امر کے وقوع پر، کیونکہ اس نوع انسانی میں سے کسی نے بھی اس سے پہلے اپنے رب کی رؤیت (الرؤیۃ) کا سوال نہیں کیا تھا اور نہ ہی اسے دیکھا تھا۔ اسی لیے موسیٰ علیہ السلام نے دعویٰ کیا کہ وہ سب سے پہلے ایمان لانے والے ہیں۔\n\nپھر ہمیں نبی اکرم صلی اللہ علیہ وسلم نے خبر دی کہ ہم میں سے ہر شخص اپنے رب کو دیکھے گا اور اس سے بالمشافہ (کفاحاً) کلام کرے گا۔\n\nاور یہ سب اس صورت کی خبر ہے جس میں وہ ہم پر ظہور الٰہی (التجلی) فرمائے گا، اور وہ وہی صورت ہے جس پر اس نے ہمیں پیدا کیا۔ اور ہم قطعی طور پر جانتے ہیں کہ رسولوں کا ذوق متبعین کے ذوق سے اس قدر بلند ہوتا ہے کہ ان میں کوئی قربت نہیں ہوتی۔ لہٰذا یہ گمان نہ کرو کہ موسیٰ علیہ السلام کا اپنے رب کی رؤیت (الرؤیۃ) کا سوال کرنا اس رؤیت سے محرومی کی وجہ سے تھا جو ابوبکر صدیق رضی اللہ عنہ کی حالت تھی، جب انہوں نے فرمایا: \"میں نے کوئی چیز نہیں دیکھی مگر یہ کہ میں نے اللہ کو اس سے پہلے دیکھا۔\" یہ رؤیت (الرؤیۃ) وہ رؤیت نہیں ہے جو موسیٰ علیہ السلام نے اپنے رب سے طلب کی تھی، کیونکہ یہ رؤیت تو ان کے بلند مرتبے کی وجہ سے انہیں حاصل تھی۔ کیونکہ صادق کا ذوق صدیق کے ذوق جیسا نہیں ہوتا۔ پس رؤیت (الرؤیۃ) بلا شک ذوقاً اور نقلاً ثابت ہے، عقلاً نہیں۔ کیونکہ اللہ تعالیٰ کی رؤیت عقلوں کے لیے حیرت کا مقام ہے، اور وہ مقام ہے جہاں ٹھہر جانا چاہیے اور عقل کے تین احکام میں سے کسی حکم کے ذریعے اس پر کوئی فیصلہ نہیں کرنا چاہیے۔ کیونکہ انبیاء اور اہل اللہ میں سے اولیاء کا اللہ کے بارے میں علم کسی فکر سے حاصل نہیں ہوتا، اللہ نے انہیں اس سے پاک رکھا ہے، بلکہ انہیں ذات حق (الحق) کے ذریعے کشف (الکشف) کے فتوحات حاصل ہوتے ہیں۔ پس دیکھنے والوں میں سے کچھ ایسے ہیں جو اسے دیکھتے ہیں اور کوئی قید نہیں لگاتے، اور کچھ ایسے ہیں جو اسے اس کے ذریعے دیکھتے ہیں، اور کچھ ایسے ہیں جو اسے اپنی ذات کے ذریعے دیکھتے ہیں، اور کچھ ایسے ہیں جو اسے اپنے پاس نہیں دیکھتے حالانکہ انہوں نے اسے دیکھا ہوتا ہے، اور وہ نہیں جانتے کہ انہوں نے اسے دیکھا ہے، کیونکہ یہ صنف ذات حق (الحق) میں صاحبِ علامت نہیں ہے اور نہ ہی ہستی (الوجود) میں اس کے ظہور کی صورت کو جانتی ہے۔ اور کچھ ایسے ہیں جو اسے نہیں دیکھتے، کیونکہ وہ جانتے ہیں کہ ان کی آنکھ یہاں عالم کے لیے صرف عالم کی اعیان کے احکام کی صورتوں میں ہی ظاہر ہوتی ہے، اور وہ (عالم) اس کا مظہر ہے۔ لہٰذا دیکھنے والے کا ادراک صرف حکم کی صورت پر واقع ہوتا ہے نہ کہ عین پر۔ پس وہ جانتا ہے کہ اس نے اسے نہیں دیکھا۔ **وَلِلَّهِ الْمَثَلُ الْأَعْلَى** (اور اللہ ہی کے لیے سب سے اعلیٰ مثال ہے) اور وہ عزیز ہے جو اپنی ہویت (ذات) کے اعتبار سے نہیں دیکھا جاتا، اور اپنے ظہور الٰہی (التجلی) میں حکیم ہے، یہاں تک کہ یہ کہا جائے کہ اس نے دیکھا۔ اس صورت کو دیکھو جو چمکدار جسم میں آنکھ کے لیے ظاہر ہوتی ہے، اور اپنی رؤیت (الرؤیۃ) کی تحقیق کرو، تو تم پاؤ گے کہ وہ صورت تمہارے اور چمکدار جسم کی عین کے ادراک کے درمیان حائل ہو گئی ہے جو اس کا مظہر ہے، پس تم اسے کبھی نہیں دیکھ پاؤ گے۔ اور ذات حق (الحق) ممکنات کی صورتوں کا مظہر ہے، لہٰذا عالم نے ذات حق (الحق) میں عالم کو ہی دیکھا ہے، نہ کہ ذات حق (الحق) کے ذریعے، اور ذات حق (الحق) کے ساتھ۔ پھر تمہیں معلوم ہونا چاہیے کہ مرئی (جسے دیکھا جاتا ہے) جو کہ ذات حق (الحق) ہے، وہ نور ہے، اور جس کے ذریعے دیکھنے والا اسے ادراک کرتا ہے وہ بھی نور ہے۔ پس نور نور میں داخل ہو گیا، گویا وہ اپنی اصل کی طرف لوٹ آیا جہاں سے وہ ظاہر ہوا تھا، تو اس نے اس کے سوا کسی کو نہیں دیکھا۔ اور تم اپنی عین کے اعتبار سے ظل (سایہ) کی عین ہو نہ کہ نور کی عین، بلکہ نور وہ ہے جس کے ذریعے تم ہر چیز کو ادراک کرتے ہو، اور نور اشیاء میں سے ہے۔ پس تم اسے ادراک نہیں کرتے مگر اس وجہ سے کہ تم اپنے ظل کی عین میں نور کو اٹھائے ہوئے ہو۔ اور ظل راحت ہے اور ظلمت حجاب ہے۔ پس جب ذات حق (الحق) کا ستارہ طلوع ہوتا ہے اور بندے کے دل میں واقع ہوتا ہے، تو دل اس سے روشن ہو جاتا ہے اور چمک اٹھتا ہے، اور اپنے صاحب سے حیرت اور خوف کو دور کر دیتا ہے، پس وہ اپنے رب کے بارے میں صریح اور اشاروں سے اور مختلف قسم کی خبروں سے آگاہ کرتا ہے۔\n\n### انبیاء کا اپنے پشت کے بل سونا اختیار کرنا ان کے علم کی وجہ سے\n\nاور جان لو کہ انبیاء نے اپنی پشت کے بل سونا صرف اس علم کی وجہ سے اختیار کیا کہ جو کچھ بھی چہرے کے مقابل ہوتا ہے وہ اس کے لیے افق ہوتا ہے، کیونکہ چہرے کے مقابل صرف افق ہی ہوتا ہے۔ اور ایک افق ادنیٰ (نیچے کا) ہوتا ہے، یعنی زمین کے قریب، اور ایک افق اعلیٰ (اوپر کا) ہوتا ہے، اور وہ وہ ہے جس کا تم اپنی پشت کے بل لیٹتے وقت اپنے چہرے سے مقابلہ کرتے ہو۔\n\nاور جب ظہور الٰہی (التجلی) صورتوں میں ہو تو اس میں حد اور مقدار داخل ہو جاتی ہے۔ اور اس میں قربت کی سب سے قریبی صورت یہ ہے کہ وہ اس خط کی عین ہو جس سے دائرے کو دو حصوں میں تقسیم کیا جاتا ہے، تاکہ دو قوسیں ظاہر ہوں جن میں سے ایک دوسرے کے قریب ہو۔ یہ پہلا قرب ہے، اور دوسرا قرب وہ خطی قرب ہے جو شہ رگ سے بھی زیادہ قریب ہے۔ اور ذات حق (الحق) کی رؤیت (الرؤیۃ) جہاں بھی ہو، وہ ہمیشہ عروج اور نزول (نزول) کے درمیان ایک منازلہ میں ہی ہوتی ہے۔ عروج ہماری طرف سے ہوتا ہے اور نزول (التدلی) اس کی طرف سے۔ پس قربت (التدانی) ہمارے لیے ہے اور نزول (التدلی) اس کے لیے، کیونکہ نزول (التدلی) ہمیشہ اوپر سے ہوتا ہے۔ اور ترقی (الترقي) ہمارے لیے ہے اور آنے والوں کا وصول (التلقي) اس کے لیے ہے۔ اور یہ سب اس صورت کی خبر ہے جس میں وہ اپنے بندوں پر ظہور الٰہی (التجلی) فرماتا ہے، اور یہ کہ وہ حد اور مقدار والی ہے، تاکہ وہ اپنے بندوں کے ساتھ اپنے اس حکم کے تحت داخل ہو جائے: **وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ** (اور ہم اسے ایک معلوم اندازے کے مطابق ہی نازل کرتے ہیں) اور **وَكُلَّ شَيْءٍ خَلَقْناهُ** (اور ہر چیز کو ہم نے پیدا کیا) یعنی ہم نے اسے **بِقَدَرٍ** (ایک اندازے کے مطابق) بنایا۔ اور رؤیت (الرؤیۃ) مخلوق ہے، لہٰذا وہ ایک اندازے کے مطابق ہے۔ اور ظہور الٰہی (التجلی) میں تنوع، متجلی لہ (جس پر ظہور ہوتا ہے) کے نزدیک ایک محدث ظہور ہے، لہٰذا وہ ایک اندازے کے مطابق ہے۔ کیا تم نہیں دیکھتے کہ اس کا ظہور الٰہی (التجلی) اعیان میں حکم کے ذریعے ہوتا ہے جنہیں الٰہی غیرت کی وجہ سے معبود بنا لیا گیا، جہاں اس نے حکم دیا اور فیصلہ کیا کہ اس کے سوا کسی کی عبادت نہ کی جائے؟ اور اسی طرح اس نے خبر دی اور فرمایا: **وَقَضَى رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ** (اور تمہارے رب نے فیصلہ کر دیا ہے کہ تم اس کے سوا کسی کی عبادت نہ کرو)۔ پس علماء رسوم لفظ 'قضیٰ' (فیصلہ کیا) کو امر (حکم) پر محمول کرتے ہیں، اور ہم اسے کشف (الکشف) کے طور پر حکم پر محمول کرتے ہیں، اور یہی صحیح ہے۔ کیونکہ انہوں نے اعتراف کیا کہ وہ ان چیزوں کی عبادت صرف اس لیے کرتے ہیں تاکہ وہ انہیں اللہ کے قریب کر دیں، **زُلْفَى** (قربت)۔ پس انہوں نے انہیں ان نائبوں کے مقام پر اتارا جو ان کی صورت میں ظاہر ہوئے جنہوں نے انہیں نائب بنایا، اور وہاں الوہیت کے سوا کوئی صورت نہیں ہے، پس انہوں نے اسے ان کی طرف منسوب کر دیا۔ اور اسی لیے ذات حق (الحق) ان کی حاجتیں پوری کرتا ہے جب وہ ان کے ذریعے اس سے توسل کرتے ہیں، یہ اس کی طرف سے مقام پر غیرت کی وجہ سے ہے کہ اس کی توہین نہ ہو، اگرچہ انہوں نے نسبت میں غلطی کی، لیکن مقام میں غلطی نہیں کی۔ اور اسی لیے اس نے فرمایا: **إِنْ هِيَ إِلَّا أَسْمَاءٌ سَمَّيْتُمُوهَا** (یہ محض نام ہیں جو تم نے رکھے ہیں) یعنی تم نے ان کے بارے میں کہا کہ یہ معبود ہیں، ورنہ انہیں نام دو۔ اگر وہ انہیں نام دیتے تو کہتے کہ یہ پتھر ہے یا درخت ہے یا جو کچھ بھی تھا، تو وہ ان کے نزدیک اسمیت کے ذریعے ممتاز ہو جاتے۔ کیونکہ ہر پتھر کی عبادت نہیں کی گئی، اور نہ ہی اسے معبود بنایا گیا، اور نہ ہر درخت، اور نہ ہر روشن جسم، اور نہ ہر حیوان۔ **فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ** (پس اللہ ہی کے لیے کامل حجت ہے) ان پر اپنے اس قول کے ذریعے: **قُلْ سَمُّوهُمْ** (کہو، انہیں نام دو)۔\n\n### اگر خواہش نہ ہوتی تو اللہ کی عبادت اس کے غیر میں نہ کی جاتی\n\nاور جان لو کہ اگر خواہش (ہویٰ) نہ ہوتی تو اللہ کی عبادت اس کے غیر میں نہ کی جاتی، اور خواہش (ہویٰ) سب سے بڑا معبود ہے جسے اختیار کر کے پوجا گیا، کیونکہ وہ اپنے لیے حکم رکھتا ہے اور وہی ہر اس چیز کو قائم کرنے والا ہے جس کی عبادت کی گئی، اور اسی کے بارے میں میں نے کہا:\n\nخواہش (ہویٰ) کی قسم، بے شک خواہش (ہویٰ) ہی محبت کا سبب ہے،\nاور اگر دل میں خواہش (ہویٰ) نہ ہوتی تو خواہش (ہویٰ) کی عبادت نہ کی جاتی۔\n\nاللہ تعالیٰ نے فرمایا: **أَ فَرَأَيْتَ مَنِ اتَّخَذَ إِلَهَهُ هَوَاهُ وَأَضَلَّهُ اللَّهُ عَلَى عِلْمٍ** (کیا تم نے اس شخص کو دیکھا جس نے اپنی خواہش کو اپنا معبود بنا لیا اور اللہ نے اسے علم کے باوجود گمراہ کر دیا؟) پس اگر انسان میں اس کی سلطنت کی قوت نہ ہوتی تو یہ ایسا اثر نہ کرتا اس شخص میں جو اس علم پر ہے کہ وہ معبود نہیں ہے۔ پس جب قیامت کا دن ہوگا تو اللہ خواہش (ہویٰ) کو مجسم کر دے گا، جیسا کہ موت کو ذبح کے لیے مجسم کیا جائے گا۔ پس جب وہ اسے مجسم کر دے گا تو اس پر اس حکم کا اقرار کرائے گا جو اس نے اس شخص میں نافذ کیا جس میں وہ قائم تھا، پس وہ حیران ہو جائے گا اور اس پر ایک معبود لے آئے گا۔ پس اسے اس کی صورت میں عذاب دیا جائے گا اور اس محل کو اس سے الگ کر دیا جائے گا، پس وہ نعمت میں حاصل ہو جائے گا۔ اور معانی کا مجسم ہونا نہ ہمارے نزدیک قابل انکار ہے اور نہ ہی علماء رسوم کے نزدیک۔ پس اس کا حکم اس حکم کی طرح ہے جو اس قول میں ہے: \"وہ شخص جنت میں داخل نہیں ہوگا جس کے دل میں رائی کے دانے کے برابر بھی تکبر (کبر) ہو۔\" پس ہمارے شیخ ابو مدین رضی اللہ عنہ فرمایا کرتے تھے: \"سچ ہے، اسے (تکبر کو) ہٹا دیا جائے گا اور اس کا صاحب اس کے بغیر جنت میں داخل ہو جائے گا، اور وہ (تکبر) ایک مجسم صورت میں جہنم میں باقی رہے گا، یا وہ تکبر اس شخص کی طرف لوٹ جائے گا جس کا وہ ہے، پس ہر حقدار کو اس کا حق مل جائے گا۔\"\n\n### اللہ کے سوا بنائے گئے معبود دو گروہ ہیں\n\nاور جان لو کہ اللہ کے سوا بنائے گئے معبود دو گروہ ہیں۔ ان میں سے ایک وہ ہے جس نے وہ دعویٰ کیا جو اس کے بارے میں کیا گیا، حالانکہ وہ اپنے دل میں جانتے تھے کہ وہ ویسے نہیں ہیں جیسا دعویٰ کیا گیا، بلکہ انہوں نے صرف ریاست کو پسند کیا اور بندوں کو گمراہ کرنے کا ارادہ کیا، جیسے فرعون اور اس کے ہم مثل۔ اور وہ شقاوت میں ہیں، مگر یہ کہ وہ توبہ کر لیں۔ اور یہ وہ لوگ ہیں جن پر ان کی زبانیں گواہی دیں گی جو انہوں نے اس دعوے سے لے کر اس سے کم تر تک کہا جس کے بارے میں سوال کیا جانا چاہیے، تو وہ انکار کر دیں گے۔\n\nاور ان میں سے ایک وہ ہے جس نے بصیرت، ہوش اور معرفت (المعرفۃ) کی تحقیق کے ساتھ کسی مجلس میں اس کا دعویٰ کیا، اس حال کے قرینے کی وجہ سے جو مجلس کا تقاضا تھا، جب انہوں نے دیکھا کہ ذات حق (الحق) ان کی قوتوں کی عین ہے، اور وہ اپنی قوتوں کے بغیر کچھ نہیں ہیں، اور اپنی قوتوں کے ذریعے ہی وہ کہتے ہیں جو کہتے ہیں۔ پس ان کی قوتیں ہی کہنے والی ہیں نہ کہ وہ خود، اور وہ ذات حق (الحق) کی عین ہیں، جیسا کہ ذات حق (الحق) نے خبر دی اور جیسا کہ ان کے نزدیک ان کے قول میں خرق عادت کے ذریعے شہود (الشہود) نے انہیں عطا کیا۔ پس انہوں نے کہا: \"میں اللہ ہوں\" اور \"بے شک میں ہی اللہ ہوں، میرے سوا کوئی معبود نہیں، پس میری عبادت کرو\"، جیسے ابو یزید، جن سے ہوش اور ثبات کی حالت میں ایسی بات منقول ہے، اور وہ جانتے تھے کہ ذات حق (الحق) ہی ممکنات کی اعیان میں اپنے افعال کے ذریعے ظاہر ہے، اور یہ کہ بعض اعیان میں اس نے خود نص دی ہے کہ وہ وہی ہے، اور بعض اعیان میں یہ ذکر نہیں کیا کہ وہ وہی ہے۔ اور اسی لیے بعض عارفین نے اس شاگرد کے حق میں کہا جس نے اپنے گمان میں ابو یزید کی رؤیت (الرؤیۃ) سے بے نیاز ہو کر اللہ سے استغنا حاصل کر لیا تھا کہ: \"اس کے لیے ایک بار ابو یزید کو دیکھنا ہزار بار اللہ کو دیکھنے سے بہتر ہے۔\" پس ابو یزید گزرے، تو ان سے کہا گیا کہ یہ ابو یزید ہیں۔ جب ان کی نظر ان پر پڑی تو شاگرد مر گیا۔ ابو یزید سے اس کی موت کے بارے میں پوچھا گیا تو انہوں نے فرمایا: \"اس نے وہ دیکھا جو وہ برداشت نہیں کر سکتا تھا، کیونکہ مجھ سے اس حیثیت سے ظہور الٰہی (التجلی) ہوا کہ 'میں' ہوں، تو وہ اسے برداشت نہ کر سکا، جیسا کہ موسیٰ علیہ السلام بے ہوش ہو گئے تھے، کیونکہ اللہ کا ظہور الٰہی (التجلی) اس حیثیت سے کہ 'میں' ہوں، اس مظہر سے کہیں زیادہ عظیم ہے جس میں وہ مرید اسے دیکھتا تھا۔\n\nاور ان میں سے ایک وہ ہے جس نے نشے (سکر) کی حالت میں اس کا دعویٰ کیا، جیسے حلاج، تو اس نے نشے میں دھت شخص کی بات کہی، پس وہ باطل ہو گئی اور اس نے گڑبڑ کی، کیونکہ اس پر نشے کا حکم غالب تھا اور وہ مخلص نہ ہو سکا۔\n\nمیں نے صبر کیا، اور کیا میرا دل میرے دل سے صبر کر سکتا ہے؟\nتیری روح میری روح میں گھل مل گئی ہے، میرے قرب اور دوری میں۔\nپس میں تو ہی ہوں، جیسا کہ تو میں ہے، اور یہی میرا مقصود ہے۔\n\nپس یہ شخص سعید ہے، اگرچہ دوسرے اس کی وجہ سے شقی ہو گئے، تو اس پر کوئی گناہ اور حرج نہیں، کیونکہ وہ نشے میں تھا اور وہ (دوسرے) خود ذمہ دار ہیں۔ اور ایسا شخص بھی اہل سعادت میں شامل ہوتا ہے، اگرچہ اس کی وجہ سے ایک عالم گمراہ ہو جائے، کیونکہ ان کو گمراہ کرنا اس کا مقصود نہیں تھا۔ پس یہ تین قسم کے لوگ ہیں جنہوں نے اپنے لیے الوہیت کا دعویٰ کیا، ان میں سے ایک شقی ہوا اور دو سعید ہوئے۔\n\nاور دوسرا گروہ وہ ہے جس میں الوہیت کا دعویٰ کیا گیا لیکن انہوں نے خود اپنے لیے دعویٰ نہیں کیا، جیسے پتھر، نباتات، حیوانات، بعض انسان، فرشتے، ستارے، انوار، جنات، اور ہر وہ چیز جس کی عبادت کی گئی اور اسے معبود بنایا گیا بغیر اس کے کہ اس نے خود دعویٰ کیا ہو۔ پس یہ سب سعید ہیں، اور جنہوں نے انہیں معبود بنایا، اگر وہ اسی حالت پر مر گئے تو وہ شقی ہیں۔ اور ان میں سے وہ لوگ ہیں جو قیامت کے دن ان لوگوں سے براءت کا اظہار کریں گے جنہوں نے انہیں اللہ کے سوا معبود بنایا، بشرطیکہ وہ موت سے پہلے توبہ نہ کریں، ان میں سے جو توبہ کی صفت کو قبول کرتے ہیں، اور وہ صرف جنات اور یہ نوع انسانی ہے۔ اور جب بھی معبود بنائے جانے والے کو اس کا علم ہو جائے اور وہ نصیحت نہ کرے اور نہ ہی یہاں براءت کا اظہار کرے، حالانکہ اس نے دعویٰ نہیں کیا تھا بلکہ خاموش رہا، تو جب اللہ کل مشرکوں کو عذاب دے گا جن کے بارے میں اللہ نے ذکر کیا ہے کہ وہ انہیں نہیں بخشے گا، تو وہ انہیں صرف اس حیثیت سے عذاب دے گا کہ انہوں نے اپنی جانوں پر ظلم کیا اور ایک مخلوق کے بارے میں ایسی بات اور دعویٰ کیا جس نے انہیں برا لگا اور ان کے اغراض میں ان پر حقوق واجب ہو گئے جن کا وہ ان سے مطالبہ کریں گے۔ پس مشرکوں کا مواخذہ غیر کے حق کی وجہ سے ہوگا نہ کہ خود اللہ تعالیٰ کی طرف سے۔ اور اپنی جانوں پر ظلم کرنا اللہ کے نزدیک غیر پر ظلم کرنے سے زیادہ بڑا ہے، اس دلیل سے جو اس شخص کے بارے میں آئی ہے جو خود کو قتل کرتا ہے کہ اس پر جنت حرام کر دی گئی ہے، پس اس کے حق میں سخت وعید آئی ہے۔\n\nپس جب قیامت کا دن ہوگا اور مشرکوں کو شقاوت کے گھر یعنی جہنم میں داخل کیا جائے گا، تو ان کے ساتھ ان تمام کو بھی داخل کیا جائے گا جن کی انہوں نے عبادت کی تھی، سوائے ان کے جو اہل جنت اور اس کے آباد کرنے والوں میں سے ہیں۔ وہ ان کے ساتھ داخل نہیں ہوں گے، لیکن وہ مثالیں ان کے ساتھ داخل ہوں گی جنہیں وہ دنیا میں صورتیں بنا کر پوجتے تھے، کیونکہ وہ اس کی صورت پر تھیں جس کے بارے میں انہوں نے اعتقاد رکھا تھا کہ وہ معبود ہے۔ پس وہ (مشرک) سزا اور انتقام کے لیے جہنم میں داخل ہوں گے، اور معبود بنائے گئے لوگ انتقام کے لیے داخل نہیں ہوں گے، کیونکہ انہوں نے اور نہ ہی ان مثالوں نے یہ دعویٰ کیا تھا۔ بلکہ انہیں عابدوں کے حق میں عبرت کے لیے داخل کیا جائے گا، پس اللہ انہیں ان کے شہود (الشہود) کے ذریعے عذاب دے گا، یہاں تک کہ وہ جان لیں کہ وہ اللہ کے مقابلے میں ان کے کسی کام نہیں آ سکتے، کیونکہ وہ معبود نہیں ہیں جیسا کہ انہوں نے ان کے بارے میں دعویٰ کیا تھا۔ اللہ تعالیٰ نے فرمایا: **إِنَّكُمْ وَمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ حَصَبُ جَهَنَّمَ أَنْتُمْ لَهَا وَارِدُونَ** (بے شک تم اور جن کی تم اللہ کے سوا عبادت کرتے ہو، وہ سب جہنم کا ایندھن ہیں، تم اس میں داخل ہونے والے ہو)۔ اور اسے 'حطب جہنم' (جہنم کی لکڑی) بھی پڑھا گیا ہے۔ اور فرمایا: **وَقُودُهَا النَّاسُ وَالْحِجَارَةُ** (اس کا ایندھن انسان اور پتھر ہیں)۔ اور فرمایا: **لَوْ كَانَ هَؤُلَاءِ آلِهَةً مَا وَرَدُوهَا** (اگر یہ معبود ہوتے تو اس میں داخل نہ ہوتے)۔ اور ان لوگوں کے بارے میں جن کی عبادت کی گئی اور وہ اہل سعادت میں سے تھے، جیسے محمد اور عیسیٰ علیہما السلام اور ان کے بعد کے خلفاء، اور جن کا ہم نے ذکر کیا جو ہوش یا نشے کی حالت میں دعویٰ کرنے والے تھے: **إِنَّ الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنَى أُولَئِكَ عَنْهَا مُبْعَدُونَ** (بے شک وہ لوگ جن کے لیے ہماری طرف سے بھلائی پہلے سے مقرر ہو چکی ہے، وہ اس سے دور رکھے جائیں گے)۔ **لَا يَسْمَعُونَ حَسِيسَهَا وَهُمْ فِي مَا اشْتَهَتْ أَنْفُسُهُمْ خَالِدُونَ** (وہ اس کی آہٹ بھی نہیں سنیں گے اور وہ ان چیزوں میں ہمیشہ رہیں گے جن کی ان کے دل خواہش کریں گے)۔ پس جس کی خواہش اس کا رب ہو، تو یہ اس کی صفت ہے۔ اور یہ اس لیے فرمایا: **لَا يَسْمَعُونَ حَسِيسَهَا وَهُمْ فِي مَا اشْتَهَتْ أَنْفُسُهُمْ خَالِدُونَ** (وہ اس کی آہٹ بھی نہیں سنیں گے اور وہ ان چیزوں میں ہمیشہ رہیں گے جن کی ان کے دل خواہش کریں گے) تاکہ وہ آواز ان کے صاحب پر خوف کا اثر نہ کرے، کیونکہ وہ اس حال میں غضب والے نہیں ہوں گے کہ انتقام سے لذت حاصل کریں۔ کیونکہ اللہ کے لیے غضب صرف دارِ تکلیف میں واقع ہوتا ہے، اور وہاں سعادت مندوں کے لیے غضب کا کوئی حصہ نہیں ہے۔ کیونکہ وہ شفاعت، شفقت اور رحمت کا مقام ہے۔ پس اس مقام پر صرف اللہ ہی غضبناک ہوگا، اور سعادت مند اللہ میں مشغول ہوں گے، اس الٰہی غضب کو تسکین دینے میں، جیسا کہ تسکین کی مختلف صورتیں عطا کرتی ہیں۔ جیسا کہ محمد صلی اللہ علیہ وسلم بعض مقامات پر فرمائیں گے: \"دوری ہو، دوری ہو\" (سحقا سحقا)، تسکین اور موافقت کی طلب میں۔ پھر اس کے بعد وہ اسی گروہ کے حق میں شفاعت کریں گے، اس تنوع کی وجہ سے جس کے ذریعے ذات حق (الحق) اس مقام پر ظاہر ہوتا ہے۔ پس سعادت مند اکابرین میں سے جو بھی اس کی آہٹ سنے گا، وہ سماع ان پر اپنی امتوں کے لیے خوف کا اثر کرے گا نہ کہ اپنی جانوں کے لیے۔ پس جب ان پر سزا اپنی حد کو پہنچ جائے گی اور عدل کے ساتھ ان کی مدت ختم ہو جائے گی، تو ان کی خواہشات (اہواء) جن کے ذریعے انہوں نے اللہ کے غیر کی عبادت کی تھی، مجسم ہو جائیں گی، ان صورتوں پر جنہیں انہوں نے معبود سمجھتے ہوئے پوجا تھا، اور ان کے باطن کی صورتوں پر۔ پس عذاب مجسم صورتوں میں واقع ہوگا تاکہ اسماء کا حکم ہمیشہ باقی رہے، اور اس گھر کے رہنے والے لوگ جہاں وہ اس کے اہل ہیں، اس میں نعمت میں رہیں گے، وہ اپنی خواہشات کی معذب صورتوں کو دیکھیں گے اور اس سے لطف اندوز ہوں گے۔ کیونکہ یہ وہ گھر ہے جہاں معانی کھڑی صورتوں میں مجسم ہو جاتے ہیں جنہیں آنکھ دیکھتی ہے، جیسے موت کا ایک خوبصورت مینڈھے کی صورت میں آنا جسے یحییٰ علیہ السلام جنت اور جہنم کے درمیان ذبح کریں گے، کیونکہ زندگی موت کی ضد ہے، اور موت زندگی کے وجود سے ہی زائل ہوتی ہے۔ اور ان مخلوق صورتوں کے ذریعے ہی جہنم اور جنت کا بھرنا ہوگا۔ کیونکہ اللہ نے جنت اور جہنم کو خبر دی کہ وہ ہر ایک کو بھر دے گا، پس ان دونوں سے فرمایا کہ تم میں سے ہر ایک کے لیے اس کا بھرنے والا ہے۔ پس جب لوگ ان میں داخل ہوں گے اور ان میں سے کچھ جگہیں باقی رہ جائیں گی جہاں اس کے اہل کی آبادی نہیں پہنچی ہوگی، تو وہ دونوں گھروں کے اہل کے ارادوں کو کھڑی صورتوں میں پیدا کرے گا اور ان کے ذریعے انہیں بھر دے گا۔ اور یہ صورتیں ان دو گروہوں میں سے ہیں جنہیں 'قدمین' (دو قدم) سے تعبیر کیا گیا ہے۔ پس اہل سعادت کے حق میں ہے: **أَنَّ لَهُمْ قَدَمَ صِدْقٍ عِنْدَ رَبِّهِمْ** (بے شک ان کے لیے ان کے رب کے پاس سچائی کا قدم ہے) یعنی سابقہ عنایت کہ وہ ان کے ارادوں کو اللہ کی اطاعت اور عبادت کی مجسم صورتوں میں پیدا کرے گا، اور ان کے اعمال کو۔ اور یہ وارد ہوا ہے کہ بندوں کے اعمال ان کی قبروں میں ان پر لوٹائے جاتے ہیں، خوبصورت صورتوں میں جو انہیں انس دیتی ہیں، اور بدصورت صورتوں میں جو انہیں وحشت میں ڈالتی ہیں۔ پس وہ صورتیں ان کے ساتھ دارِ سعادت اور شقاوت میں داخل ہوں گی اور ان کے ذریعے ہی وہ دونوں بھرے جائیں گے۔ اور جہاں تک دارِ شقاوت کا تعلق ہے، جب وہ اللہ سے اپنے بھرنے کا مطالبہ کرے گی، تو جبار اس میں اپنا قدم رکھے گا۔ پس ان کے لیے بھی قدم ہے، جیسا کہ اہل سعادت کے لیے تھا، یعنی سابقہ عنایت کہ اس قدم میں عذاب ظاہر ہوگا، اور وہ ان کی خواہشات (اہواء) ہیں۔ پس سعادت مندوں کا گھر جو کہ جنت ہے، وہ مکمل طور پر نعمت ہے، اس میں کوئی چیز نعمت کے خلاف نہیں ہے۔ اور شقیوں کا گھر ملا جلا ہے، نعمت پانے والے اور عذاب پانے والے کے درمیان۔ کیونکہ اس میں عذاب کے فرشتے ہیں جنہیں ان لوگوں کو عذاب دینے میں نعمت حاصل ہوتی ہے جن پر اللہ نے انہیں مسلط کیا ہے۔ پس انہیں اللہ کے لیے انتقام کے سوا کوئی نعمت نہیں ہے۔ اور وہ حکم کے ذریعے مکلف ہیں نہ کہ ممانعت کے ذریعے، پس وہ اللہ کے احکام کی تعمیل میں جلدی کرتے ہیں: **لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ** (وہ اللہ کی نافرمانی نہیں کرتے جو وہ انہیں حکم دیتا ہے، اور وہ وہی کرتے ہیں جس کا انہیں حکم دیا جاتا ہے)۔ پس جہنم میں مدت ختم ہونے کے بعد کوئی عذاب باقی نہیں رہے گا سوائے اس عذاب کے جو عالم خیال (حضرة الخیال) میں مثالی اور متخیل ہوگا، تاکہ اسماء کے احکام باقی رہیں۔ کیونکہ اسم کے لیے صرف وہی ہے جو اس کی حقیقت اپنے حکم کے ظہور سے طلب کرتی ہے، اور اس کے لیے کسی حضور (حضرۃ) یا شخص کا تعین نہیں ہے۔ بلکہ یہ اسم 'عالم' اور 'مرید' کے حکم سے ہے۔ پس جہاں بھی اسم 'منتقم' کا حکم کسی جسم یا جسد یا کسی بھی چیز سے ظاہر ہوا، تو اس نے اپنے حکم کے ظہور اور تاثیر کے ذریعے اپنا حق پورا کر لیا۔ پس الٰہی اسماء دونوں گھروں میں ہمیشہ ہمیشہ کے لیے مؤثر اور حاکم رہیں گے، اور ان کے اہل ان سے نکالے نہیں جائیں گے۔ اور چونکہ رؤیت (الرؤیۃ) اہل جنت کے لیے ہے، اس کے مقابلے میں اہل جہنم کے لیے حجاب (پردہ) رکھا گیا، اور ان کا حجاب ان کے عذاب کی مدت تک رہے گا، تاکہ رؤیت (الرؤیۃ) ان کے عذاب میں اضافہ نہ کرے، جیسا کہ یہاں قرآنی سورت نے ان کے لیے **رِجْساً إِلَى رِجْسِهِمْ** (نجاست پر نجاست) اور مرض پر مرض کا اضافہ کیا۔ پس جب مدت ختم ہو جائے گی تو حجاب ان کے سامنے لٹکا رہے گا تاکہ وہ نعمت حاصل کریں۔ کیونکہ اگر وہ وہاں ان پر ظہور الٰہی (التجلی) فرماتا، ان کی سابقہ برائی اور سزا کے استحقاق کے باوجود، تو وہ احسانی ظہور الٰہی (التجلی) ان میں اللہ سے حیا پیدا کرتا ان افعال کی وجہ سے جو ان سے سرزد ہوئے، اور حیا ایک عذاب ہے۔ اور ان کی مدت ختم ہو چکی ہے، اور وہ شہود (الشہود) اور رؤیت (الرؤیۃ) کی لذت نہیں جانتے۔ پس انہیں حجاب (پردے) میں نعمت حاصل ہوگی، اور مقصد نعمت ہے، اور وہ حاصل ہو چکی ہے۔ لیکن کس کے ذریعے؟ پس اللہ کی رؤیت (الرؤیۃ) کی نعمت حجاب کی نعمت کے مقابلے میں کہاں ہے؟ پس وہ اس دن اپنے رب سے محجوب (پردے میں) ہوں گے۔ اور اللہ **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق کہتا ہے اور وہی راستہ دکھاتا ہے) اور **وَيَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ** (اور جسے چاہتا ہے سیدھے راستے کی طرف ہدایت دیتا ہے)۔",
    "fa": "باب سیصد و سی و یکم در معرفت منزل رؤیت (دیدار)، قدرت بر آن، تدانی (نزدیک شدن)، ترقّی (بالا رفتن)، تلقّی (دریافت)، و تدلّی (پایین آمدن)؛ و این منزل از حضرت محمدیه (الحضرة المحمدية) و آدمیه (الحضرة الآدمية) است.\n\nشگفتا از چشمی که چگونه خود را درک می‌کند *** و از درک آن کس که گفت «اوست» عاجز می‌ماند.\nو مشهودی جز او نیست، و همانا *** شهودِ ورودِ غیب، آن چشم را پنهان می‌سازد.\n\n### [صورت تجلی حق بر بندگانش]\n\nبدان، خداوند تو را تأیید کند، که این منزل با منزل پیش از خود درآمیختگی (تخالج) دارد؛\nزیرا پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) رؤیت ما را نسبت به خداوند، به رؤیت ماه در شب بدر کامل و خورشید بدون ابر تشبیه کرده است، و اینکه در رؤیت او نه ستمی (ضیم) به ما می‌رسد، نه فشردگی (انضمام)، نه زیانی که بر ما وارد شود و نه زیان رساندنی به دیگری.\nو پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) برای امتش صورت تجلی حق (تجلی الحق) بر بندگانش را با کلامی آشکار ساخت که هیچ پیامبری پیش از او برای امتش نگفته بود. و خداوند به همین سبب او را ستود و فرمود: «بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ» (نسبت به مؤمنان بسیار مهربان و رحیم است) و او را «رَحْمَةً لِلْعالَمِينَ» (رحمتی برای جهانیان) فرستاد و مؤمن را از کافر جدا نساخت.\n\nپس پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) هنگامی که از دجال در ادعای الوهیتش برحذر می‌داشت، فرمود: «من درباره او سخنی به شما می‌گویم که هیچ پیامبری به امتش نگفته است. هیچ پیامبری نبوده مگر اینکه امتش را از دجال برحذر داشته است. بدانید که دجال کور چشم راست است، گویی چشمش انگوری شناور است، و همانا پروردگار شما کور نیست.»\n\nپس ما را آگاه ساخت که پروردگارمان را به چه صورتی می‌بینیم. و نباید گفته شود که او صورتی را اراده کرده که کوری را نمی‌پذیرد، زیرا در این صورت فایده این خبر از بین می‌رفت؛ چرا که آن صورت به ذات خود نفی کوری را ایجاب می‌کرد. بلکه چون آن صورت از کسانی بود که کوری را می‌پذیرفت، برای ما روشن ساخت که او این‌گونه نیست، زیرا می‌دانست که شباهت در جایی رخ می‌دهد که سلامت از عیب در آن وجود دارد.\nو دجال از این رو کور بود که بر نیمی از صورت قرار داشت، زیرا رتبه کمال را که بیشتر مردان به دست آورده‌اند، کسب نکرده بود. سپس باز می‌گردیم و می‌گوییم که موسی (علیه السلام) هنگامی که پروردگارش با او سخن گفت، طمع او را فرا گرفت و گفت: «رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ» (پروردگارا، خود را به من بنما تا تو را ببینم). او چیزی را درخواست کرد که مجاز به پرسش آن بود، زیرا پیامبران داناترین مردم به خداوند هستند و می‌دانست که او (خداوند) دارای ادراکی است که با آن درک می‌شود، و اوست که با ادراک، درک می‌شود نه خود ادراک؛ زیرا می‌دانست که چشم‌ها او را درک نمی‌کنند، بلکه چشم‌ها ابزاری هستند که با آن درک صورت می‌گیرد.\n\nو موسی از رؤیت منع شد، به این دلیل که آن را بدون امر الهی که به او وحی شده باشد، درخواست کرد. زیرا آنان (پیامبران) اهل ادب هستند و جز آنچه به ایشان وحی شود، پیروی نمی‌کنند، به ویژه در ساحت الهی. به همین دلیل به او گفته شد: «لَنْ تَرانِي» (هرگز مرا نخواهی دید). سپس خداوند با بنده‌اش به لطافت جبران کرد، هنگامی که حد مجازاتِ از دست دادن ادب به سبب سؤال ابتدایی که شوق او را بر آن واداشته بود (و او مانند مستی بود)، به پایان رسید.\n\nپس چون دانست که یأس (ناامیدی) در آنچه طلب کرده بود، بر او مستولی شده است، با ارجاع به کوه در پایداری‌اش هنگام تجلی (التجلی) جبران کرد. و کوه از ممکنات است. پس پروردگارش بر آن تجلی کرد و کوه در اثر آن تجلی متلاشی شد، زیرا خداوند روح کوه را برای حفظ صورت بر آن، مانند ارواح مدبّر، نیافریده بود، بلکه آن را آفریده بود تا تسبیح‌گوی او باشد. به همین دلیل صورت کوهی‌اش بر آن حفظ نشد و تجلی در آن اثر گذاشت. و روح موسی (علیه السلام) بر موسی در بیهوشی‌اش حفظ شد، هنگامی که آنچه را کوه دید، دید؛ کوهی که حجاب بر صورت نشأت او بود. پس «فَلَمَّا أَفاقَ» (هنگامی که به هوش آمد)، موسی، موسی بازگشت، اما کوه، کوه بازنگشت. موسی دانست که از او چیزی سر زده است که نباید رخ می‌داد مگر به امر الهی، پس گفت: «تُبْتُ إِلَيْكَ» (به سوی تو بازگشتم)، زیرا می‌دانست که «إِنَّ الله يُحِبُّ التَّوَّابِينَ» (همانا خداوند توبه‌کنندگان را دوست دارد) و «أَنَا أَوَّلُ الْمُؤْمِنِينَ» (و من اولین مؤمنان هستم) به وقوع این امر جایز؛ زیرا هیچ کس از این نوع انسانی پیش از او از پروردگارش رؤیت او را نخواسته بود و او را ندیده بود. به همین دلیل موسی ادعا کرد که اولین مؤمنان است.\n\nسپس پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) ما را آگاه ساخت که هیچ یک از ما نیست مگر اینکه پروردگارش را خواهد دید و بی‌واسطه (کفاحاً) با او سخن خواهد گفت.\n\nو این همه، آگاهی دادن به صورتی است که حق در آن بر ما تجلی می‌کند، و آن همان صورتی است که ما بر آن آفریده شده‌ایم. و ما قطعاً می‌دانیم که ذوق پیامبران فراتر از ذوق پیروان است، به گونه‌ای که قابل مقایسه نیست. پس گمان مبر که درخواست موسی برای رؤیت پروردگارش به این معناست که او فاقد آن رؤیتی بوده که حال ابوبکر صدیق (رضی الله عنه) بود، در این سخن که: «چیزی ندیدم مگر اینکه خداوند را پیش از آن دیدم.» این رؤیت، آن رؤیتی نیست که موسی از پروردگارش طلب کرد، زیرا آن رؤیت به دلیل والایی مرتبه‌اش برای او حاصل بود. چرا که ذوق صادق، ذوق صدیق نیست.\n\nپس رؤیت (دیدار) بدون شک از طریق ذوق (تجربه عرفانی) و نقل (روایات)، ثابت است، نه از طریق عقل. زیرا رؤیت خداوند متعال از اموری است که عقول در آن حیران می‌مانند و باید در آنجا توقف کرد و با هیچ یک از احکام سه‌گانه عقل (وجوب، جواز، امتناع) حکم قطعی صادر نکرد. زیرا نه پیامبران و نه اولیای اهل الله، علمی به خداوند ندارند که از تفکر حاصل شده باشد؛ خداوند آنان را از این امر پاک ساخته است، بلکه برای آنان فتوحات مکاشفه (الکشف) به حق (الحق) وجود دارد.\n\nپس از بین بینندگان، کسی هست که او را می‌بیند و مقید نمی‌سازد، و کسی هست که او را به واسطه او می‌بیند، و کسی هست که او را به واسطه خودش می‌بیند، و کسی هست که او را نزد خود نمی‌بیند در حالی که او را دیده است و نمی‌داند که او را دیده است، زیرا این دسته صاحب نشانه‌ای در حق (الحق) نیستند و صورت ظهور او را در هستی (الوجود) نمی‌شناسند. و کسی هست که او را نمی‌بیند، زیرا می‌داند که ذات او در اینجا برای عالَم ظاهر نمی‌شود مگر به صورت‌های احکام اعیان عالَم، و او (حق) مَجلای (محل تجلی) آن است. پس ادراک از سوی بیننده جز بر صورت حکم واقع نمی‌شود، نه بر ذات، و در نتیجه می‌داند که او را ندیده است. و «وَلِلَّهِ الْمَثَلُ الْأَعْلى‏» (و برای خداوند مَثَل برتر است). و او عزیز است که از حیث هویتش دیده نمی‌شود، و حکیم است در تجلی‌اش، تا جایی که گفته شود او دیده است.\n\nبه صورتی که در جسم صیقلی برای چشم ظاهر می‌شود بنگر و رؤیت خود را محقق ساز. خواهی یافت که آن صورت میان تو و ادراک ذات جسم صیقلی که مَجلای آن است، حائل شده است، پس هرگز آن را نمی‌بینی. و حق (الحق) مَجلای صورت‌های ممکنات است. پس عالَم جز عالَم را در حق (الحق) ندیده است، نه به واسطه حق و نه با حق. سپس بدان که مرئی (آنچه دیده می‌شود) که همان حق (الحق) است، نور است، و آنچه بیننده به واسطه آن او را درک می‌کند نیز نور است. پس نوری در نور درآمیخت، و گویی به اصل خود که از آن ظاهر شده بود، بازگشت. پس جز او، او را ندید. و تو از حیث ذات خود، ذات سایه هستی نه ذات نور. بلکه نور چیزی است که با آن هر چیزی را درک می‌کنی، و نور خود از اشیاء است. پس آن را درک نمی‌کنی مگر از آن جهت که حامل نور در ذات سایه خود هستی. و سایه، آسایش است و ظلمت، حجاب. پس هنگامی که کوکب حق (الحق) طلوع کند و در قلب بنده جای گیرد، قلب به واسطه آن روشن و نورانی می‌شود و حیرت و ترس را از صاحبش می‌زداید. پس او از پروردگارش با صراحت و اشاره و انواع خبرها سخن می‌گوید.\n\n### [اینکه پیامبران خوابیدن بر پشت خود را انتخاب کردند به دلیل علمشان بود]\n\nو بدان که پیامبران خوابیدن بر پشت خود را انتخاب نکردند مگر به دلیل علمشان به اینکه هر آنچه روبرو با چهره قرار گیرد، افق آن است؛ زیرا جز افق، چیزی روبروی چهره قرار نمی‌گیرد. و افق پایین‌تری وجود دارد، یعنی نزدیک‌تر به زمین، و افق بالاتری وجود دارد که همان چیزی است که هنگام دراز کشیدن بر پشت، چهره‌ات روبروی آن قرار می‌گیرد. و هنگامی که تجلی (التجلی) در صورت‌ها باشد، حد و مقدار در آن وارد می‌شود. و نزدیک‌ترین نزدیکی در این حالت آن است که همان خطی باشد که دایره را به دو نیم تقسیم می‌کند تا دو کمان که به یکدیگر نزدیک شده‌اند، ظاهر شوند؛ این نزدیکی اول است. و نزدیکی دوم، نزدیکی خطی است که از رگ گردن (حبل الورید) نیز نزدیک‌تر است.\n\nو رؤیت حق (الحق) هرگز، هر کجا که باشد، رخ نمی‌دهد مگر در منازله‌ای میان عروج (بالا رفتن) و نزول (پایین آمدن). پس عروج از ماست و نزول از او. از این رو، تدانی (نزدیک شدن) برای ماست و تدلّی (پایین آمدن) برای او، زیرا تدلّی جز از بالا صورت نمی‌گیرد. و ترقّی (بالا رفتن) برای ماست و تلقّی (دریافت) واردشوندگان بر او برای اوست. و این همه، آگاهی دادن به صورتی است که حق در آن بر بندگانش تجلی می‌کند، و اینکه آن صورت دارای حد و مقدار است تا با بندگانش تحت حکم خود درآید که می‌فرماید: «وَما نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ» (و ما آن را نازل نمی‌کنیم مگر به اندازه‌ای معلوم) و «وَكُلَّ شَيْ‏ءٍ خَلَقْناهُ» (و هر چیزی را آفریدیم)، یعنی آن را «بِقَدَرٍ» (به اندازه) قرار دادیم. و رؤیت (دیدار) مخلوق است، پس به اندازه است. و تنوع در تجلی (التجلی)، ظهوری حادث نزد کسی است که تجلی بر او صورت گرفته، پس آن نیز به اندازه است.\n\nآیا نمی‌بینی تجلی او را به حکم در اعیانی که به دلیل غیرت الهی به عنوان معبود گرفته شده‌اند، آنجا که حکم کرد و قضا نمود که جز او پرستیده نشود؟ و همچنین خبر داد و فرمود: «وَقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ» (و پروردگار تو حکم کرد که جز او را نپرستید). پس علمای رسوم (ظاهر شریعت) لفظ «قضی» را بر امر (دستور) حمل می‌کنند، اما ما آن را از طریق کشف (الکشف) بر حکم (قضاوت و تقدیر) حمل می‌کنیم و این صحیح است. زیرا آنان (مشرکان) اعتراف کردند که این اشیاء را نمی‌پرستند مگر برای اینکه آنان را «زُلْفى» (نزدیکی) به خداوند برسانند. پس آنان را به منزله نایبانی قرار دادند که به صورت کسی که آنان را نایب کرده، ظاهر شده‌اند، و در آنجا صورتی جز الوهیت نیست. پس آن را به ایشان نسبت دادند. و به همین دلیل حق (الحق) حوائج آنان را برآورده می‌کند، هنگامی که به واسطه آن اشیاء به او متوسل می‌شوند، از روی غیرت او بر مقام الوهیت که مبادا مورد تحقیر قرار گیرد. و اگرچه در نسبت دادن خطا کردند، اما در مقام (الوهیت) خطا نکردند. و به همین دلیل فرمود: «إِنْ هِيَ إِلَّا أَسْماءٌ سَمَّيْتُمُوها» (اینها نیستند مگر نام‌هایی که شما آنها را نامیده‌اید). یعنی شما درباره آنها گفتید که معبود هستند، وگرنه آنها را نام ببرید. اگر نام می‌بردند، می‌گفتند این سنگ است یا درخت یا هر چه که بود. پس نزد آنان با نام‌گذاری متمایز می‌شوند، زیرا نه هر سنگی پرستیده شده و معبود قرار گرفته، و نه هر درختی، و نه هر جسم نورانی، و نه هر حیوانی. پس «فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ» (حجت رسا و کامل برای خداوند است) بر آنان، با این سخن که: «قُلْ سَمُّوهُمْ» (بگو نامشان را ببرید).\n\n### [اگر هوای نفس نبود، خداوند در غیر خود پرستیده نمی‌شد]\n\nو بدان که اگر هوای نفس (الهوى) نبود، خداوند در غیر خود پرستیده نمی‌شد. و همانا هوای نفس بزرگترین معبودی است که پرستیده شده است، زیرا برای خود حکم می‌کند و اوست که هر آنچه پرستیده شده را وضع کرده است. و در این باره گفتم:\n\nبه حق هوای نفس، همانا هوای نفس سبب هوای نفس است *** و اگر هوای نفس در قلب نبود، هوای نفس پرستیده نمی‌شد.\n\nخداوند متعال فرمود: «أَ فَرَأَيْتَ مَنِ اتَّخَذَ إِلهَهُ هَواهُ وَأَضَلَّهُ اللهُ عَلى‏ عِلْمٍ» (آیا دیدی کسی را که هوای نفس خود را معبود خویش گرفت و خداوند او را با وجود علم گمراه ساخت؟). پس اگر نیروی سلطه هوای نفس در انسان نبود، چنین اثری در کسی که می‌داند آن معبود نیست، نمی‌گذاشت. پس چون روز قیامت شود، خداوند هوای نفس را جسمانی می‌کند، همان‌گونه که مرگ را برای پذیرش ذبح جسمانی می‌کند. هنگامی که آن را جسمانی کرد، او را بر آنچه در حق کسی که هوای نفس در او بود، حکم کرده بود، اقرار می‌دهد. پس در صورت هوای نفس عذاب می‌شود و محل (انسان) از آن جدا شده و در نعمت قرار می‌گیرد. و جسمانی شدن معانی نه نزد ما و نه نزد علمای رسوم (ظاهر شریعت) انکار نمی‌شود. پس حکم آن در این مورد مانند حکمی است که در این سخن آمده است: «کسی که در قلبش به اندازه ذره‌ای کبر باشد، وارد بهشت نمی‌شود.» و شیخ ما ابومدین (رضی الله عنه) می‌فرمود: «صدق (راستی) از بین می‌رود، پس صاحبش بدون آن وارد بهشت می‌شود و خودِ کبر به صورت جسمانی در آتش باقی می‌ماند، یا کبر به کسی که سزاوار آن است باز می‌گردد تا هر صاحب حقی حق خود را بگیرد.»\n\n### [معبودهایی که به جای خداوند گرفته شده‌اند، دو دسته‌اند]\n\nو بدان که معبودهایی که به جای خداوند گرفته شده‌اند، دو دسته‌اند: دسته‌ای از آنان کسانی هستند که آنچه درباره‌شان ادعا شده را خود ادعا کردند، با اینکه در درون خود می‌دانستند آن‌گونه که ادعا کرده‌اند نیستند، بلکه ریاست را دوست داشتند و قصد گمراه کردن بندگان را داشتند، مانند فرعون و امثال او. و آنان در شقاوت (بدبختی) هستند مگر اینکه توبه کنند. و آنان از کسانی هستند که زبان‌هایشان بر ضدشان شهادت می‌دهد به آنچه از این ادعا و کمتر از آن بر زبان آورده‌اند که باید درباره‌اش سؤال شود، پس انکار می‌کنند.\n\nو دسته‌ای دیگر کسانی هستند که آن را با بصیرت و هوشیاری و تحقق معرفت (المعرفة) در مجلسی ادعا کردند، به دلیل قرینه حالی که آن مجلس اقتضا می‌کرد؛ زیرا دیدند که حق (الحق) عین قوای آنان است و آنان جز به قوای خود، خود نیستند، و با قوای خود آنچه می‌گویند را می‌گویند. پس قوای آنان گوینده است نه خودشان، و آن قوا عین حق است، همان‌گونه که حق خبر داده و همان‌گونه که شهود (الشهود) با خرق عادت در سخن آنان به ایشان عطا کرده است. پس گفتند: «أنا الله» (من خدا هستم) و «إِنِّي أَنَا اللهُ لَا إِلَهَ إِلَّا أَنَا فَاعْبُدُونِ» (همانا منم خدا، معبودی جز من نیست، پس مرا بپرستید)، مانند ابویزید که چنین سخنی از او نقل شده است، با وجود هوشیاری و ثباتش و علمش به اینکه حق (الحق) همان است که با افعالش در اعیان ممکنات ظاهر می‌شود، و اینکه در برخی اعیان تصریح کرده که اوست و در برخی اعیان ذکر نکرده که اوست. و به همین دلیل برخی از عارفان درباره شاگردی که به گمان خود از رؤیت ابویزید به واسطه خداوند بی‌نیاز شده بود، گفتند: «اگر ابویزید را یک بار ببیند، بهتر است از اینکه خداوند را هزار بار ببیند.» پس ابویزید عبور کرد و به او گفته شد: «این ابویزید است.» هنگامی که چشمش به او افتاد، شاگرد مرد. از ابویزید درباره مرگ او پرسیدند، گفت: «چیزی را دید که طاقت آن را نداشت، زیرا حق از حیث \"من\" بر او تجلی کرد و او طاقت نیاورد، همان‌گونه که موسی بیهوش شد؛ زیرا خداوند از حیث \"من\" مَجلای (محل تجلی) او بزرگتر از مَجلایی بود که آن مرید در آن شهود می‌کرد.»\n\nو دسته‌ای دیگر کسانی هستند که آن را در حال سُکر (مستی عرفانی) ادعا کردند، مانند حلاج، که سخن مستی را گفت. پس عملش تباه شد و به دلیل حکم سُکر بر او، درآمیختگی (خلط) کرد و خالص نشد.\n\nصبر پیشه کردم، اما آیا قلبم *** از فؤادم صبر می‌کند؟\nروحت با روحم درآمیخت *** در نزدیکی و دوری‌ام.\nپس من تو هستم، همان‌گونه که تو *** من هستی و مراد من.\n\nپس این شخص (حلاج) سعادتمند است، اگرچه دیگران به واسطه او شقی شدند. بر او گناهی نیست و حرجی نیست، زیرا او مست بود و دیگران مسئول هستند. و چنین کسی نیز به اهل سعادت ملحق می‌شود، اگرچه عالمی به واسطه او گمراه شود، زیرا گمراهی آنان مقصود او نبوده است. پس اینها سه دسته هستند که الوهیت را برای خود ادعا کردند: یکی از این سه شقی شد و دو نفر سعادتمند شدند.\n\nو اما دسته دیگر، کسانی هستند که الوهیت در موردشان ادعا شد، اما خودشان آن را برای خود ادعا نکردند، مانند سنگ‌ها، گیاهان، حیوانات، برخی انسان‌ها، فرشتگان، ستارگان، انوار، جن و هر آنچه پرستیده شد و معبود قرار گرفت بدون ادعایی از جانب خودش. اینها همگی سعادتمند هستند. و کسانی که آنان را معبود گرفتند، اگر بر آن بمیرند، شقی هستند. و از میان این معبودان، کسانی که به جای خداوند معبود گرفته شدند، در روز قیامت از پرستش‌کنندگان خود بیزاری می‌جویند، مگر کسانی که پیش از مرگ توبه کنند، از جمله کسانی که صفت توبه را می‌پذیرند، و اینها جز جن و این نوع انسانی نیستند.\n\nو هرگاه آن معبودِ گرفته شده از این امر آگاه باشد و نصیحت نکند و در اینجا (در دنیا) بیزاری نجوید، با وجود اینکه خود ادعایی نکرده و سکوت کرده است، پس اگر خداوند فردا مشرکانی را که ذکر کرده است که آنان را نمی‌آمرزد، عذاب کند، تنها از آن جهت عذاب می‌کند که به خود ظلم کرده‌اند و با سخن و ادعایی که آنان را ناخوشایند ساخته، در حق مخلوقی مرتکب ظلم شده‌اند و حقوقی از اغراضشان بر عهده آنان (مشرکان) آمده که آن را مطالبه می‌کنند. پس مؤاخذه مشرکان به دلیل حق غیر است، نه از جهت ذات خود خداوند متعال. و ظلم به نفس خود نزد خداوند بزرگتر از ظلم به غیر است، به دلیل آنچه درباره کسی که خود را می‌کشد آمده است، مبنی بر حرام شدن بهشت بر او، پس وعید در حق او بزرگ شمرده شده است.\n\nپس چون روز قیامت شود و مشرکان وارد سرای شقاوت (بدبختی) که همان جهنم است، شوند، تمام کسانی که پرستیده‌اند نیز با آنان وارد می‌شوند، مگر کسانی که از اهل بهشت و آبادکنندگان آن هستند، که آنان با مشرکان وارد نمی‌شوند. اما بت‌هایی که در دنیا به صورت کسی که معتقد بودند معبود است، می‌ساختند و می‌پرستیدند، با آنان وارد می‌شوند. پس آنان (مشرکان) برای عقاب و انتقام وارد آتش می‌شوند، و معبودان (بت‌ها) وارد آن می‌شوند نه برای انتقام، زیرا نه آنان و نه بت‌ها ادعایی نکرده بودند، بلکه برای کینه‌توزی در حق پرستش‌کنندگانشان وارد آتش می‌شوند. پس خداوند آنان را با شهود (الشهود) آن معبودان عذاب می‌دهد تا بدانند که آنان در برابر خداوند هیچ سودی برایشان ندارند، زیرا آن‌گونه که درباره‌شان ادعا کرده بودند، معبود نیستند. خداوند متعال فرمود: «إِنَّكُمْ وَما تَعْبُدُونَ مِنْ دُونِ اللهِ حَصَبُ جَهَنَّمَ أَنْتُمْ لَها وارِدُونَ» (همانا شما و آنچه به جای خداوند می‌پرستید، هیزم جهنم هستید و شما وارد آن خواهید شد). و «حَطَبُ جَهَنَّم» (هیزم جهنم) نیز قرائت شده است. و فرمود: «وَقُودُهَا النَّاسُ وَالْحِجارَةُ» (سوخت آن مردم و سنگ‌ها هستند). و فرمود: «لَوْ كانَ هؤُلاءِ آلِهَةً ما وَرَدُوها» (اگر اینها معبود بودند، وارد آن نمی‌شدند).\n\nو درباره کسانی که از اهل سعادت پرستیده شدند، مانند محمد و عیسی (علیهما السلام) و خلفای پس از او، و کسانی که از مدعیان در حال هوشیاری و مستی ذکر کردیم، فرمود: «الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنى‏ أُولئِكَ عَنْها مُبْعَدُونَ» (کسانی که از جانب ما وعده نیکو به آنان داده شده است، آنان از آن [جهنم] دور داشته می‌شوند)، «لا يَسْمَعُونَ حَسِيسَها وَهُمْ فِي ما اشْتَهَتْ أَنْفُسُهُمْ خالِدُونَ» (صدای آن را نمی‌شنوند و آنان در آنچه دل‌هایشان بخواهد جاودان هستند). پس هر کس مشتهایش پروردگارش باشد، این صفت اوست. و اینکه فرمود: «لا يَسْمَعُونَ حَسِيسَها وَهُمْ فِي ما اشْتَهَتْ أَنْفُسُهُمْ خالِدُونَ» (صدای آن را نمی‌شنوند و آنان در آنچه دل‌هایشان بخواهد جاودان هستند)، به این دلیل است که آن شنیدن در صاحبش تأثیر ترس می‌گذارد، زیرا او در آن حال صاحب غضب نیست که از انتقام لذت ببرد. زیرا غضب برای خداوند تنها در سرای تکلیف (دنیا) رخ می‌دهد، و در آنجا (آخرت) سعادتمندان نصیبی از غضب ندارند، چرا که آنجا موطن شفاعت و شفقت و رحمت از سوی سعادتمندان است. پس در آن موطن جز خداوند کسی غضب نمی‌کند، و سعادتمندان مشغول خداوند هستند در تسکین آن غضب الهی، با آنچه انواع تسکین عطا می‌کند، همان‌گونه که محمد (صَلَّى اللهُ عَليهِ وسَلَّم) در برخی مواطن می‌فرماید: «سُحقاً سُحقاً» (دوری، دوری). این را برای طلب تسکین و موافقت می‌گوید. سپس پس از آن، برای همان دسته شفاعت می‌کند، به دلیل تنوع آنچه حق (الحق) در آن موطن با آن ظاهر می‌شود.\n\nپس هر کس از سعادتمندان بزرگ که صدای آن (جهنم) را بشنود، آن شنیدن در آنان تأثیر ترس می‌گذارد، اما بر امت‌هایشان، نه بر خودشان. پس هنگامی که عقوبت به حد خود برسد و مدت آن به عدالت در موردشان سپری شود، هواهای نفسانی آنان که به واسطه آن غیر خدا را پرستیدند، به صورت آنچه هنگام پرستش، معبود پنداشته بودند و به صورت باطن‌هایشان، جسمانی می‌شود. پس عذاب به صورت‌های جسمانی واقع می‌شود تا حکم اسماء (الهی) همیشه باقی بماند، و ساکنان آن سرا از مردم، در حالی که اهل آن هستند، در نعمتی باقی می‌مانند که به آن می‌نگرند و به صورت‌های هوای نفس خود که در عذاب است، نگاه می‌کنند و به واسطه آن متنعم می‌شوند. زیرا آنجا سرایی است که معانی در آن به صورت‌های قائم جسمانی می‌شوند که چشم آن را مشاهده می‌کند، مانند مرگ در صورت قوچی ابلق که یحیی (علیه السلام) آن را میان بهشت و جهنم ذبح می‌کند. زیرا حیات ضد مرگ است، پس مرگ جز با وجود حیات از بین نمی‌رود. و با همین صورت‌های مخلوق است که پر شدن آتش و بهشت صورت می‌گیرد. زیرا خداوند به بهشت و جهنم خبر داد که او هر یک را پر می‌کند، پس به آن دو فرمود که هر یک از شما پرشدنی دارد. پس هنگامی که اهل آن در آنجا ساکن شوند و مکان‌هایی باقی بماند که آبادانی اهلش به آن نرسیده باشد، اراده‌های اهل دو سرا را به صورت‌های قائم ایجاد می‌کند و آن دو را با آن پر می‌سازد.\n\nو این صورت‌ها از دو فرقه‌ای هستند که با «دو قدم» از آنها تعبیر می‌شود. پس در مورد اهل سعادت آمده است: «أَنَّ لَهُمْ قَدَمَ صِدْقٍ عِنْدَ رَبِّهِمْ» (که برای آنان نزد پروردگارشان قدم صدق است)، یعنی عنایت پیشین به اینکه اراده‌های آنان را در طاعت و عبادت خداوند به صورت‌های جسمانی و اعمالشان بیافریند. و وارد شده است که اعمال بندگان در قبرهایشان به صورت‌های نیکو که مونس آنان است و به صورت‌های زشت که آنان را به وحشت می‌اندازد، بر آنان باز می‌گردد. پس آن صورت‌ها با آنان وارد سرای سعادت و شقاوت می‌شوند و پر شدن آن دو به واسطه آنهاست. و اما سرای شقاوت (جهنم)، هنگامی که پر شدن خود را از خداوند طلب کند، جبار قدم خود را در آن می‌گذارد. پس برای آنان نیز قدمی است، همان‌گونه که برای اهل سعادت بود؛ یعنی عنایت پیشین که عذاب در آن قدم ظاهر می‌شود، و آن همان هواهای نفسانی آنان است.\n\nپس سرای سعادتمندان که همان بهشت است، تماماً نعمت است و چیزی که مغایر نعمت باشد در آن نیست. و سرای اشقیاء (بدبختان) آمیخته‌ای است میان متنعم و معذب، زیرا در آن فرشتگان عذاب هستند که در عذاب دادن کسانی که خداوند آنان را بر ایشان مسلط کرده است، نعمت دارند. پس نعمت آنان جز در انتقام برای خداوند نیست. و آنان صاحبان تکلیف به امر هستند نه نهی، پس در امتثال اوامر خداوند شتاب می‌ورزند: «لا يَعْصُونَ اللهَ ما أَمَرَهُمْ وَيَفْعَلُونَ ما يُؤْمَرُونَ» (از خداوند در آنچه به آنان امر کرده نافرمانی نمی‌کنند و آنچه را مأمورند انجام می‌دهند).\n\nپس در آتش، پس از سپری شدن مدت عذاب، جز عذاب تمثیلی و متخیّل در حضرة خیال (حضرة الخيال) باقی نمی‌ماند، به دلیل بقای احکام اسماء (الهی). زیرا برای اسم (الهی) جز آنچه حقیقتش از ظهور حکمش طلب می‌کند، وجود ندارد، و اسم تعیین حضرت یا شخص ندارد، بلکه این از حکم اسم «عالم» و «مرید» است. پس هر جا که حکم «منتقم» از جسم یا جسد یا هر چه که بود، ظاهر شد، حق خود را با ظهور حکم و تأثیرش استیفا کرده است. پس اسماء الهی همیشه و تا ابدالآبدین در دو سرا مؤثر و حاکم خواهند بود و اهل آن دو سرا از آن خارج نمی‌شوند.\n\nو چون رؤیت (دیدار) برای اهل بهشت قرار داده شده است، حجاب در مقابل آن برای اهل آتش قرار داده شد. و حجاب آنان به مدت عذابشان است تا رؤیت، عذابشان را افزایش ندهد، همان‌گونه که سوره قرآنی در اینجا «رِجْساً إِلَى رِجْسِهِمْ» (پلیدی بر پلیدی‌شان) و مرضی بر مرضشان افزود. پس هنگامی که مدت سپری شود، حجاب در برابر آنان آویخته باقی می‌ماند تا متنعم شوند. زیرا اگر حق در آنجا بر آنان تجلی می‌کرد، با وجود بدی‌هایی که از آنان سر زده و استحقاق عقوبت داشتند، آن تجلی احسانی در آنان حیایی نسبت به خداوند ایجاد می‌کرد از آنچه از ایشان سر زده است، و حیا خود عذاب است، در حالی که مدت عذابشان سپری شده است. و آنان لذت شهود (الشهود) و رؤیت را نمی‌دانند، پس برای آنان نعمتی در حجاب است. و هدف، نعمت است و آن حاصل شده است، اما به واسطه چه کسی؟ پس نعمت رؤیت خداوند کجا و نعمت حجاب کجا؟ پس آنان در آن روز «عَنْ رَبِّهِمْ يَوْمَئِذٍ مَحْجُوبُونَ» (از پروردگارشان در آن روز محجوب هستند). و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند) و «وَيَهْدِي مَنْ يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ» (و هر که را بخواهد به راه راست هدایت می‌کند)."
  },
  "page_count": 5
}