{
  "id": 359,
  "title": {
    "ar": "الباب التاسع والخمسون وثلاثمائة في معرفة منزل إياك أعني فاسمعي يا جارة وهو منزل تفريق الأمر وصورة الكتم في الكشف من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Fifty-Nine: Concerning the knowledge of the station (منزل) of \"It is you I mean, so listen, O neighbor!\" (إياك أعني فاسمعي يا جارة). And it is the station of the differentiation (تفريق) of the Command (الأمر) and the form (صورة) of concealment (الكتم) in the Unveiling (الكشف), derived from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو انسٹھ: \"میں تمہیں مخاطب کرتا ہوں، پس اے پڑوسن سنو\" (إياك أعني فاسمعي يا جارة) کے مقام کی معرفت کے بیان میں، اور یہ امر (الأمر) کی تفریق کا مقام ہے، اور حضرت محمدیہ (الحضرة المحمدية) سے کشف (الکشف) میں کتمان (الکتم) کی صورت کا بیان ہے۔",
    "fa": "باب سیصد و پنجاه و نهم: در معرفت (معرفة) منزل «إياك أعني فاسمعي يا جارة» (منظورم تو هستی، پس بشنو ای همسایه)؛ و آن منزل تفریق امر (تفريق الأمر) و صورت کتمان (الكتم) در کشف (الكشف) از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب التاسع والخمسون وثلاثمائة في معرفة منزل إياك أعني فاسمعي يا جارة وهو منزل تفريق الأمر وصورة الكتم في الكشف من الحضرة المحمدية»\n\n\n> انظر إلى نقص ظل الشخص فيه إذا *** ما الشمس تعلو فتفني ظله فيه‏\n\n\n> ذاك الدليل على تحريكه أبدا *** بدأ وفيئا وهذا القدر يكفيه‏\n\n\n> لو كان يسكن وقتا ما بدا أثر *** في الكون من كن وذاك الحكم من فيه‏\n\n\n> فالكون من نفس الرحمن ليس له *** أصل سواه فحكم القول يبديه‏\n\n\n> خلاف ما يقتضيه العقل فارم به *** فإن حكمة شرع الله تقضيه‏\n\n\n> ما إن رأيت له عينا ولا أثرا *** ولو يكون لكان العقل يخفيه‏\n\n\n### [إن الله ما خلق شيئا إلا وخلق له ضدا ومثلا وخلافا]\n\n\nاعلم أيدك الله بروح منه أن الأشياء لما خلقها الله على حكم ما اقتضاه الوجود الأصل الذي هو عليه وله وجد كل ما سوى الله تعالى فما خلق شيئا إلا وخلق له ضدا ومثلا وخلافا فجعل الموافقة في الخلاف والمنافرة في الضد والمناسبة في المثل فأشد الأشياء مواصلة ومحبة واتحادا الخلاف مع مخالفه ولهذا يكون الخلاف بحسب من يخالفه ولا يتميز عن صاحبه إلا بحكمه فيتحد الخلافان بالمحل ويتميزان بالحكم فيه وأما المثل مع مثله فإن المناسبة تجمع بينهما في المودة فيحب كل مثل مثله بما فيه من مناسبة المثلية وإن لم يجتمعا فيشبه المثل الخلاف في المحبة وإن كان بينهما فرقان بالحقائق فيهما ويشبه الضد في أنهما لا يجتمعان أبدا فهما كغائب أحب غائبا وهام فيه عشقا وحكمت الموانع بأن لا يجتمعا وأما الضد مع ضده فالمنافرة بينهما ذاتية وليس بينهما المودة التي بين الخلافين فكل واحد من الضدين يريد ذهاب عين ضده من الوجود بخلاف الخلافين فالمودة التي بينهما تمنع كل واحد منهما أن يريد ذهاب عين خلافه من الوجود لكن يريد ويشتهي أن لو يمكن الاتحاد به حتى لا تقع المشاهدة إلا على واحد بعينه ويغيب فيه الآخر إيثارا من كل خلاف على نفسه لخلافه لكنهما لا يجتمعان أبدا لذاتهما مثال المثلين بياضان ومثال الضدين بياض وسواد ومثال الخلافين لون ورائحة أو طعم‏\nفي محل واحد والمراد من هذا الذي ذكرناه تعريفك بنسبة العبد من الله ما له من هذه النسب‏\n\n\n### [إن الإنسان مجتمع الأضداد]\n\n\nفاعلم إن الإنسان الكامل جمع بذاته هذه الأمور كلها وليس ذلك لغيره فهو مع الحق مثل ضد خلاف كما إن ما ذكرناه له هذا الحكم أيضا على كل واحد من هؤلاء الثلاثة فإن البياض يخالف البياض بالمحل فإن المحل يميزه فيقال هذا البياض ما هو هذا البياض ويضاد مثله فإنهما لا يجمعهما محل واحد وهو مثل له لأن الحد والحقيقة تشملهما من جميع الوجوه فكل واحد مما ذكرناه يقبل ما يقبله الآخر من المثلية والضدية والخلافية والذي يحتاج إليه في هذا الباب معرفة الإنسان مع قرينه من الإنس إن عم أو مع غيره من العالم من حيث نسبة ما إن خص ومعرفة الإنسان مع الحق ليعلم صورته منه على ما ذا يكون فإنه قد اعتنى به غاية العناية ما لم يعتن بمخلوق بكونه جعله خليفة وأعطاه الكمال بعلم الأسماء وخلقه على الصورة الإلهية وأكمل من الصورة الإلهية ما يمكن أن يكون في الوجود فالإنسان الكامل مثل من حيث الصورة الإلهية ضد من حيث إنه لا يصح أن يكون في حال كونه عبدا ربا لمن هو له عبد خلاف من حيث إن الحق سمعه وبصره وقواه فأثبته وأثبت نفسه في عين واحدة فمن عرف نفسه عرف ربه معرفة مثل وضد وخلاف فهو الولي العدو قال تعالى لا تَتَّخِذُوا عَدُوِّي وعَدُوَّكُمْ يخاطب المؤمنين أَوْلِياءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ لكونهم أمثالا لكم لما بين المثلين من الضدية فقال للمؤمن عامل العدو بضدية المثل لا بمودة\n\n\nالمثل لأن حقيقتكما واحدة فافهم فإن العدو يريد إخراجك من الوجود كما قدمنا في معرفة الضد ولذلك قال تعالى في هذه الآية وقَدْ كَفَرُوا بِما جاءَكُمْ من الْحَقِّ يُخْرِجُونَ الرَّسُولَ وإِيَّاكُمْ فما عاملكم العدو وإن كان مثلكم إلا بضدية المثل لا بمودته وهذا عين ما ذكرناه من أن الضد يريد ذهاب عين ضده من الوجود فأمرنا إذا أرادوا ذلك بنا أن نقاتلهم فنذهب أعيانهم من الموضع الذي يكونون فيه فننقلهم إلى البرزخ بالقتل فانظر ما أعجب القرآن وما أعطى صَلَّى اللهُ عَليهِ وسَلَّم من العلم بالأمور وإن لم تسر هذه الضدية في ذات المثل فليس بمؤمن ولا هو عند الله بمكان ولكن يحتاج إلى ميزان وكشف صحيح حتى يعرف العدو الذاتي الذي ينبغي أن يعامله بمثل هذه المعاملة من العدو العرضي الذي تعرض له هذه العداوة ثم تزول عنه لزوال ذلك العارض الذي أوجبها كما قال تعالى يخبر عن بعض العباد بما يقول يوم القيامة يا لَيْتَنِي اتَّخَذْتُ مَعَ الرَّسُولِ سَبِيلًا يا وَيْلَتى‏ لَيْتَنِي لَمْ أَتَّخِذْ فُلاناً خَلِيلًا لَقَدْ أَضَلَّنِي عَنِ الذِّكْرِ بَعْدَ إِذْ جاءَنِي وكانَ الشَّيْطانُ يعني شيطان الإنس لا شيطان الجن لِلْإِنْسانِ خَذُولًا فإنه قال ما أضلني عن الذكر إلا فلان وسمي إنسانا مثله حيث أصغى إليه وقلده في مقالته وحال بينه وبين اتباع ما أمره الله باتباعه وهو ما جاء به رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وسبب ذلك ما جاءهم به عن الله من التحجير الجديد وإن كانوا في تحجير إذ لا بد منه لمصالح العالم ولكنهم كانوا قد ألفوه ونشئوا عليه ولم يعرفوا غيره فهم ما أنكروا التحجير وإنما أنكروا هذا التحجير الخاص ومفارقة المألوف بالطبع عسير ولهذا لا يألف الطبع الألم وإن تمادى به فإنه يسر بزواله لعدم ألفة الطبع به فلو ألفه لتالم بزواله ولما لم يتمكن أن يكون كل إنسان له مرتبة الكمال المطلوبة في الإنسانية وإن كان يفضل بعضهم بعضا فادناهم منزلة من هو إنسان حيواني وأعلاهم من هو ظل الله وهو الإنسان الكامل نائب الحق يكون الحق لسانه وجميع قواه وما بين هذين المقامين مراتب ففي زمان الرسل يكون الكامل رسولا وفي زمان انقطاع الرسالة يكون الكامل وارثا ولا ظهور للوارث مع وجود الرسول إذ الوارث لا يكون وارثا إلا بعد موت من يرثه فلم يتمكن للصاحب مع وجود الرسول أن تكون له هذه المرتبة فالأمر ينزل من الله على الدوام لا ينقطع فلا يقبله إلا الرسل خاصة على الكمال فإذا فقدوا حينئذ وجد ذلك الاستعداد في غير الرسل فقبلوا ذلك التنزل الإلهي في قلوبهم فسموا ورثة لم ينطلق عليهم اسم رسل مع كونهم يخبرون عن الله بالتنزل الإلهي فإن كان في ذلك التنزل الإلهي حكم أخذه هذا المنزل عليه وحكم به وهو المعبر عنه بلسان علماء الرسوم بالمجتهد الذي يستنبط الحكم عندهم وهو العالم بقول الله لَعَلِمَهُ الَّذِينَ يَسْتَنْبِطُونَهُ مِنْهُمْ فهذا\n\n\nحظ الناس اليوم من التشريع بعد رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ونحن نقول به ولكن لا نقول بأن الاجتهاد هو ما ذكره علماء الرسوم بل الاجتهاد عندنا بذل الوسع في تحصيل الاستعداد الباطن الذي به يقبل هذا التنزل الخاص الذي لا يقبله في زمان النبوة والرسالة إلا نبي أو رسول إلا أنه لا سبيل إلى مخالفة حكم ثابت قد تقرر من الرسول ص‏\nفي نفس الأمر فإن لم يكن ذلك في نفس الأمر فلا يلقى إلى هذا المجتهد الذي ذكرناه إلا ما هو الحكم عليه في نفس الأمر حتى أنه لو كان الرسول صَلَّى اللهُ عَليهِ وسَلَّم حيا لحكم به مع أنه قرر حكم المجتهد وإن أخطأ فما أخطأ المجتهد إلا في الاستعداد كما ذكرناه فلو أصاب في الاستعداد ما أخطأ مجتهد أبدا بل لا يكون مجتهدا في الحكم وإنما هو ناقل ما قبله من الحق النازل عليه في تجليه وهذا عزيز في الأمة ما يوجد إلا في أفراد وعلامتهم أنهم ما يختلفون في الحكم أصلا لوحدانية الرسالة في هذا الزمان فإذا اختلفوا فما هم الذين ذكرناهم فيكون صاحب الحق إذا كانت الأحكام منحصرة القسمة واحدا منهم فإن بقي قسم لم يقع به حكم ربما كان الحق فيه ومع هذا تعبد كل واحد بما أعطاه دليله فإن أصاب فله أجران وإن أخطأ فله أجر فوقع الاجتهاد في الاجتهاد وإذا تقرر أن التنزل الإلهي لم ينقطع وإنه على ضروب وكلها علم سواء كان تنزل حكم شرعي أو غير ذلك بحسب المواطن أ لا ترى موطن الآخرة في الجنة التنزل فيه دائم ولكن ليس فيه حكم تحجير جملة واحدة بخلاف تنزله في الدنيا فهذا أعني بحكم المواطن والكل تعريف إلهي ولما كان في الإنسان الكامل المثل والضد والخلاف كما هو في الأسماء الإلهية المثل كالرحمن الرحيم والخلاف كالرحمن الصبور والضد كالضار النافع‏\n\n\nقال النبي صَلَّى اللهُ عَليهِ وسَلَّم يرفع هممنا إلى الرتب العالية لو كنت متخذا خليلا لاتخذت أبا بكر خليلا لكن صاحبكم خليل الله!\n\n\nوالله يقول واتَّخَذَ الله إِبْراهِيمَ خَلِيلًا وقال صَلَّى اللهُ عَليهِ وسَلَّم لربه أنت الصاحب في السفر\n\n\nفإذا علمت أن الله لا يستحيل عليه خلة عباده فاجهد أن تكون أنت ذلك الخليل بأن تنظر إلى ما يؤدي إلى تحصيل هذه الخلة الشريفة فإنك لا تجد لها سببا إلا الموافقة ولا علم لنا بموافقتنا الحق إلا موافقتنا شرعه فما حرم حرمناه وما أحل حللناه وما أباحه أبحناه وما كرهه كرهناه وما ندب إليه ندبنا إليه وما أوجبه أوجبناه فإذا عمك هذا في نفسك وكانت هذه صفتك وقمت فيها مقام حق صحت لك الخلة لا بل المحبة التي هي أعظم وأخص من الخلة لأن الخليل يصحبك لك والمحب يصحبك لنفسه فشتان ما بين الخلة والمحبة وقد دللتك على تحصيل هذين المقامين فالخليل يعتضد بخليله والحبيب يبطن في محبه فيقيه بنفسه فالحق مجن المحبوب والخليل مجن خليله أ لا ترى إلى ما أجرى الله في نفوس العالم حيث يجعلون الخبز والملح سببا موجبا لأن يكون كل واحد من الشخصين اللذين بينهما الممالحة فداء لصاحبه يقيه من كل مكروه ويحفظ عليه حفظه على نفسه وكذلك هو الأمر عليه في عينه ولما شهدناه مع الحق مشاهدة عين ووقعت الممالحة ورأيت أثرها بحمد الله برهانا قاطعا قلت في ذلك‏\n\n\n> لآكلن الخبز والملحا *** حتى أرى البرهان والفتحا\n\n\n> وأنظر الأمر الذي قد بدا *** يثبت في اللوح فلا يمحي‏\n\n\n> وأطلب الحرب من أجل العدا *** لا أطلب السلم ولا الصلحا\n\n\n> فلو أتاني الأمر من عنده *** أمر يريني الكشف والشرحا\n\n\n> ألزمت نفسي طلبا للعلى *** أن تؤثر المعروف والنصحا\n\n\n> وقلت للباني ألا فابن لي *** من عمل الأرواح لي صرحا\n\n\n> عسى أرى بلقيس إذ شمرت *** عن ساقها إذ أبصرت صرحا\n\n\n> تخيلت بأنه لجة *** فأضربت عن عرشها صفحا\n\n\n> ما عرفت إذ أبصرت نفسها *** سترا ولا كشفا ولا لمحا\n\n\nفأعطاه الخبز والملح أن لا يتخذ عدوا لله محبوبا ولا محبا ولما علم الله ما هو عليه الإنسان في جبلته من حبه المحسن لإحسانه ومن استجلابه الود من أشكاله بالتودد إليهم علم أنه تعالى إذا قال لهم لا تَتَّخِذُوا عَدُوِّي إنهم لما ذكرناه لا يقومون في هذا النهي في جانب الحق مقام ما يستحقه الحق فزاد في الخطاب فقال وعَدُوَّكُمْ وذلك ليبغضهم إلينا لعلمه بأنا نحب أنفسنا ونؤثر أهواءنا عليه تعالى فليس في القرآن ذم في حقنا من الله أعظم من هذا فإنه لو علم منا إيثاره على أهوائنا لاكتفى بقوله عَدُوِّي ثم تمم على نسق واحد فقال يُخْرِجُونَ الرَّسُولَ يعني من موطنه فإن مفارقة الأوطان من‏\nأشق ما يجري على الإنسان فلما علم الله أنكم لا يقوم عندكم إخراج الرسول مع بقائكم في أوطانكم ذلك مقام ما يستحقه الرسول منكم قال وإِيَّاكُمْ فشرككم في الإخراج مع الرسول كما شرككم في العداوة مع الله لتكونوا أحرص على أن لا تلقوا إليهم بالمودة وأن تتخذوهم أعداء والمؤمنون هنا كل ما سوى الرسول فإن الرسول إذا تبين له أن شخصا ما عدو لله تبرأ منه قال تعالى في حق إبراهيم وأبيه آزر بعد ما وعظه وأظهر الشفقة عليه لكونه كان عنده في حد الإمكان أن يرجع إلى الله وتوحيده من شركه فلما بين الله له في وحيه وكشف له عن أمر أبيه وتبين إبراهيم أن أباه آزر عدو لله تبرأ منه مع كونه أباه فأثنى الله عليه فقال فَلَمَّا تَبَيَّنَ لَهُ أَنَّهُ عَدُوٌّ لِلَّهِ تَبَرَّأَ مِنْهُ وقد كان إبراهيم في حق أبيه أواها حليما لا الآن وقد ورد في الخبر أن إبراهيم يجد أباه بين رجليه في صورة ذيخ فيأخذه بيده فيرمي به في النار\n\n\nفانظر ما أثر عند الخليل إيثاره لجناب الحق من عداوة أبيه في الله تعالى فالله يجعلنا ممن آثر الحق على هواه وأن يجعل ذلك مناه فما أعظمها عندي من حسرة حيث لم نكن بهذه المثابة عند الله حتى نكتفي بذكر عداوتهم لله وإخراج الرسول فهنا ينبغي أن تسكب العبرات فالسعيد من وجد ذلك من نفسه فلم يدخل تحت هذا الخطاب وعلى قدر ما ينقصك من هذا الحال ينقصك من المعرفة بالله ومن الوقت الذي فتح الله علي في هذا الطريق ما لقيت أحدا على هذا القدم فعرفته به وإن كان عليه في نفس الأمر ولكن ما عرفني الله به وربما عرضت له به فلم أجد عنده إلا النقيض لكني أعلم أن في الأرض عبادا لهم هذا المقام فالحمد لله الذي فتح علي به ونرجو إن شاء الله البقاء عليه فإن أكثر أبواب المعرفة بالله تحول بين هذا المقام وبين المؤمنين والعلماء فهو مقام غامض صعب التصور تقدح فيه معارف إلهية كثيرة ومتى لم يحصل لأحد هذا المقام ذوقا\n\n\n### [إن بين الله وبين من هو عدو لله مناسبة]\n\n\nفاعلم أنه بينه وبين من هو عدو لله مناسبة ولتلك المناسبة لم يتبرأ منه إذا تبين له لأنه قبل التبيين يعذر قال تعالى ما كانَ لِلنَّبِيِّ والَّذِينَ آمَنُوا أَنْ يَسْتَغْفِرُوا لِلْمُشْرِكِينَ ولَوْ كانُوا أُولِي قُرْبى‏ من بَعْدِ ما تَبَيَّنَ لَهُمْ أَنَّهُمْ أَصْحابُ الْجَحِيمِ وقال ما كانَ لِأَهْلِ الْمَدِينَةِ ومن حَوْلَهُمْ من الْأَعْرابِ أَنْ يَتَخَلَّفُوا عَنْ رَسُولِ الله ولا يَرْغَبُوا بِأَنْفُسِهِمْ عَنْ نَفْسِهِ فليس بأصحاب الجحيم إلا أعداء الله تعالى الذين هم أهل الجحيم‏\n\n\n> فكن مع الحق لا تبغي به بدلا *** وأفرد الحق لا تضرب له مثلا\n\n\nوالله ولي الإعانة والتوفيق واعلم أن هذا المنزل يحوي على علم الزيادة من الخير وفيه علم ما يتميز به الحق من الباطل والحدود التي تفصل بين الأشياء وتميز بعضها عن بعض وفيه علم عبيد الكنايات لا عبيد الأسماء وما بينهما من المراتب في الرفعة والشرف ومن أشد وصلة في العبودية هل عبد الكناية أو عبد الاسم وفيه علم ما يتعلق بالعالم كله من العلوم وفيه علم ما يختص به الحق من الصفات دون خلقه وفيه علم التنزيه لما ذا يرجع هل لوجود أو لعدم وفيه علم الموازين وفيه علم ما أوجب اتخاذ الشريك في العالم وكل‏\n\n\nمولود فإنما يولد على الفطرة فمن أين كفر الأول وأبواه هما اللذان يهودانه أو ينصرانه أو يشركانه أو يمجسانه وهل العقل ينزل هنا من حيث فكره منزلة الأبوين في كون هذا الشخص قد أخرجه نظره من فطرته إلى إثبات الشريك وفيه علم ما يملكه الإنسان بذاته مما لا يملكه وتصرفه فيما لا يملكه لما ذا تصرف فيه وفيه علم ما يؤول إليه قائل الزور والشاهد به وكون الحاكم غير معصوم باتباع هواه ولما ذا أبقاه الله حاكما في ظاهر الأمر وإن كان معزولا في باطن الأمر فيما حكم فيه بهواه وقوله تعالى قالَ رَبِّ احْكُمْ بِالْحَقِّ وفيه علم العلامات التي يعرف بها الصادق من الكاذب وهي من العلامات التي لا تنقال بل يجدها الإنسان من نفسه إذا كان من أهل المراقبة لأحواله فلا يفوته علم ذلك ومن لم تكن المراقبة حاله فإنه لا يعرف تلك العلامات أصلا والمؤمنون أحق بمعرفتها من أصحاب النظر وفيه علم ما يختص به الشيوخ في هذا الطريق يعرف به حال المريدين متى يستحقون أن يكونوا مريدين وأن يقبل عليهم الشيخ قبول إفادة وليس للشيخ في هذا الطريق أن ينبه المريد على صورة ما يكون بحصول معناها في نفسه حصول الفتح له ونيل السعادة لئلا يظهر بالصورة في ذلك والباطن معرى عن المعنى الموجب لتلك الصورة فإن قلت فهذا لا ينبغي للشيخ أن يستره عن المريد قلنا بل ينبغي أن يستره عن المريد وواجب عليه ذلك لعلمه أن المعنى الموجب لظهور تلك الصورة إذا قام بالمريد أوجب له ظهور تلك الصورة فيعلم الشيخ عند ذلك أن الله قد أهل ذلك المريد\nلأن يكون من أهل الحق وإذا أعلمه الشيخ بذلك المعنى الموجب لإظهار هذه الصورة والنفس مجبولة على الخيانة وعدم الصدق ظهر بالصورة مع عدم المعنى فيقع الغلط كما يظهر المنافق بصورة المؤمن في العمل الظاهر والباطن معرى عن الموجب لذلك العمل وفيه علم الضيق في النار ما سببه مع ما فيه من السعة وفيه علم ما يقرن مع المؤمن في الجنة وما يقرن مع المشرك في النار والفرق بين الوجود والتوحيد فإن المشرك مؤمن بالوجود غير موحد والعذاب أوجبه في النار عدم التوحيد لا إثبات الوجود فمن هنا تعرف قرين المشرك من قرين المؤمن وفيه علم دخول جميع الممكنات في الوجود من حيث أجناسها وأنواعها لا من حيث أشخاصها وآحادها لا بل أشخاص بعضها لا كلها وهنا نظر دقيق يعطيه الكشف هل الخلق الجديد في الصور كلها في الوجود لحاملها التي بعض الناس في لبس منها أو لا فمن رأى التجديد قال لا تتناهى أشخاص كل نوع أبدا ومن رأى أن لا تجديد قال في الآخرة إنه قد تناهت أشخاص هذا النوع الإنساني فلا يوجد إنسان بعد ذلك وهي مسألة دقيقة لا يتمكن لنا الكلام فيها جملة واحدة فإنها من جملة الأسرار التي لا تذاع إلا لأهلها فإنها من العلوم التي تنقال إلا لأهل الروائح ومن لا شم له لا يقبل الأخبار عن حقيقتها وفيه علم ما يعطي مما لا يعطي وفيه علم ما هي السعادة في أن يجهل فإن العلم يعطي في العالم إذا علم أمرا ما فقد اكتفى به وصار يطلب علما آخر إذ الحاصل لا يبتغى فإذا قال علمت كذا فمن المحال أن تتشوق النفس إليه بعد حصوله فذلك لا يعلم أحد الله أبدا لأنه يؤدي إلى الاستغناء عنه من حيث علمه به فإن قلت بل علمه به جعله لا يستغني عنه قلنا لك ما هذا هو العلم به بل العلم الذي ذكرته هو العلم بكونه لا يستغني عنه والعلم به الذي أردناه أمر آخر فأنت عالم بالحكم لا به فلا تعارض بين ما اعترضت به علينا وبين ما قلنا فافهم وفيه علم ابتلاء العالم بعضه ببعض هل هو من باب الرحمة بالعالم أو من باب الشقاء وفيه علم الموانع التي منعت من قبول ما جاء من عند الله مع تشوق النفوس إلى رؤية الغريب إذا ورد والقبول عليه فإن رحمة الشريعة لا يدركها إلا العلماء خاصة ولهذا لا يردها عالم حيث يراها ولهذا أمرنا بالإيمان بها وإن كانت قد نسخت وارتفع حكمها وصار العمل بها حراما علينا وفيه علم نفع العلم وفيه علم ما تراه شيئا وليس بشي‏ء وهو شي‏ء لأنك رأيته شيئا مثاله السراب تراه ماء والآل الذي هو شخص الإنسان في السراب يعظم فلا يشك في عظمه فإذا جئته لم تجده كما رأيته ولا تشك فيما رأيته وغيرك في ذلك الحين ممن هو على المسافة التي رأيته أنت فيها عظيما يراه عظيما وأنت تراه ليس بعظيم حين جئته وهو علم إلهي شريف وفيه علم المفاضلة بين الضدين كالمفاضلة بين السواد والبياض وذلك لكون اللون جمعهما فوقعت المفاضلة فلا بد في كل مفاضلة في الوجود من جامع يجمع بينهما أي يجتمع فيه جميع من في الوجود ولهذا فرت الباطنية في الباري إذا قيل لها إنه موجودا لي ليس بمعدوم وما علمت أنها وقعت في عين ما فرت منه فإنه أيضا كما ينطلق على الموجود الحادث لفظة موجود ينطلق عليه اسم ليس بمعدوم فقد وقعت الشركة في أنه ليس بمعدوم وكذا جميع ما يسأل عنه الباطني ولهذا كانوا أجهل الناس بالحقائق وفيه علم الغمام وهو من الغم وكون الحق يأتي فيه يوم القيامة أو الملائكة أو الحق والملائكة فما يعطى من الغم وفيه علم متى ينفرد الحق بالملك أو لم يزل منفردا به ولكن جهل في موطن وعرف في موطن وهو هو ليس غيره فإنه تعالى ملك بالحقيقة والمخلوق ملك بالجعل قال تعالى وجَعَلَكُمْ مُلُوكاً ومن هنا تعلم من هو ملك الملك وفيه علم الظلم الذي أتت به الشرائع وما أثره وعلم الظلم الذي يعطيه العقل وما أثره وعلم الظلم المحمود والمذموم وفيه علم الفرق بين شياطين الإنس وبين شياطين الجن وما ينبغي أن يصحب ومن لا ينبغي أن‏\n\n\nيصحب مطلقا من هذا النوع الإنساني وفيه علم التجاء الدعاة إلى الله إذا لم تسمع دعوتهم سواء كان رسولا أو وارثا وفيه علم كون الحق جعل لكل شي‏ء ضدا وفيه علم اختصاص أحد الضدين بالحب الإلهي والآخر بالبغض الإلهي والصدور من عين واحدة أو هو من يدين مختلفتين في الحكم وفيه علم حدوث الأحكام بحدوث النوازل وأن الشرع ما انقطع ولا ينقطع إلى أن يرث الله الأرض ومن عليها وإن انقطعت النبوة فالشرع ما انقطع ما دام في العالم مجتهد وفيه علم المضاهاة الإلهية للاكوان فهل ذلك لعلو قدر الأكوان أو لأمر آخر مثل قوله تعالى ولا يَأْتُونَكَ بِمَثَلٍ إِلَّا جِئْناكَ بِالْحَقِّ وأَحْسَنَ تَفْسِيراً وفيه علم من يمشي على بطنه من الأناسي وفي أي صورة يحشر من هذا مشيه وفيه علم من حبس نفسه مع الأدنى مع معرفته بالأعلى‏\nوالأعلى يدعوه إليه والأدنى لا يدعوه إليه فمن يدعوه إلى الأدنى حتى يحبس نفسه عليه وفيه علم ما يتعدى الإنسان أي إنسان كان في علمه بغيره علمه بنفسه وفيه علم شهود الكيفيات ومن هو الموصوف عندنا بالكيفية وفيه علم إلحاق الإنسان الكامل بربه والغيرة الإلهية على المقام إذا ظهر الإنسان بالفعل بصورة ربه وأن حكم الشي‏ء بالفعل يعطي خلاف ما يعطيه بالقوة فإعطاؤه بالفعل أقوى وفيه علم الظهور والخفاء والراحة وفيه علم الأنفاس الظاهرة في العالم بالرحمة وما سبب ذلك وعموم دخول الخلق في هذه الأنفاس وفيه علم ما يريد الحق ظهوره ويريد الإنسان المخالف ستره وهو الذي يرى المصلحة في غير الواقع في الوجود ويحتاج صاحب هذا المقام إلى بصر حديد من أجل الموازين الشرعية فإن الجهل بما يراه الحق من المصالح أكثر من العلم بالمصالح الظاهرة في الكون إنها ليست مصالح في النظر العقلي عند العقلاء وهو علم دقيق إذا عمل به الإنسان عن كشف وتحقيق لم يخطئ أبدا وإذا عمل به من ليست له هذه الصفة أخطأ وهو الذي يقول العامة فيه خطأ السعيد صواب وصواب من ليس بسعيد خطأ ورأيت هذا في حطلحة بملطية وشافهني بذلك وفيه علم الامتزاج الذي لا يمكن فيه فصل وهو كل ضدين بينهما واسطة كالفاتر بين الحار والبارد لا يقدر أحد على فصل الحرارة من البرودة في هذا الفاتر وفيه علم الفرق بين من هو لله وبين من هو على الله وفيه علم الطريق إلى الله بالنية وإن لم تكن مشروعة فهي نافعة بكل وجه فإنه ما قصد إلا الله وعموم التجلي الإلهي معلوم فللعبد المشيئة في ذلك وفيه علم ما يختص بالاسم الرحمن دون غيره من الأسماء الإلهية وما ينبغي أن يعامل به الاسم الرحمن دون غيره من الأسماء الإلهية وفيه علم المسمى شيئا ما هو وفيه علم التناوب وأن المتناوبين لا يجتمعان وما يحدث في عالم الإنسان منهما وفيه علم التؤدة والسكون وأين يحمدان وفيه علم صفات السعداء من غيرهم عقلا وشرعا وفيه علم ما يقبل التبديل من الصفات مما لا يقبل وممن لا يقبله وفيه علم المحفوظين والمعصومين من العلماء العارفين بالله تعالى وفيه علم ما تنتج الذكرى من المؤمن وفيه علم من طلب الإمامة فأعين عليها وفيه علم عناية الدعاة إلى الله وشرف منزلتهم عند الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Three Hundred and Fifty-Nine: On the Knowledge of the Station \"It is You I mean, so listen, O neighbor,\" which is the station of the differentiation of the Command (تفريق الأمر) and the form of concealment (صورة الكتم) in the Unveiling (الكشف) from the Muhammadan Presence (الحضرة المحمدية)\n\nLook at the diminishing of the person’s shadow therein when\nThe sun rises high and annihilates its shadow within it.\n\nThat is the proof of its perpetual movement,\nBeginning and returning, and this measure suffices it.\n\nHad it rested for a moment, no trace would have appeared\nIn the Cosmos from the command 'Be!' (كن), and that ruling is from His mouth.\n\nThe Cosmos is from the Breath of the All-Merciful (نفس الرحمن); it has\nNo origin other than Him, so the ruling of the Word manifests it.\n\nContrary to what the intellect demands, cast it aside,\nFor the wisdom of Allah's Law (شرع الله) decrees it.\n\nI have not seen for it an essence (عينا) nor a trace,\nAnd if it were, the intellect would conceal it.\n\n### [Indeed, Allah created nothing except that He created for it an Opposite, a Like, and a Difference]\n\nKnow, may Allah support you with a spirit from Him, that when Allah created things according to the ruling necessitated by the Original Existence (الوجود الأصل) upon which He is and for which He is, everything other than Allah the Exalted came into being. He created nothing except that He created for it an Opposite (ضدا), a Like (مثلا), and a Difference (خلافا).\n\nThus, He placed agreement in the Difference, repulsion in the Opposite, and suitability in the Like. The strongest of things in connection, love, and union is the Difference (الخلاف) with its contrary. This is why the Difference is determined by the one who differs from it, and it is distinguished from its companion only by its ruling (حكمه). Thus, the two Differences unite in location (المحل) but are distinguished by the ruling therein.\n\nAs for the Like (المثل) with its like, suitability gathers them in affection (المودة), so every like loves its like due to the suitability of likeness inherent in it, even if they do not unite. Thus, the Like resembles the Difference in love, even though there are two distinctions between them in their realities (الحقائق), and it resembles the Opposite in that they never unite. They are like an absent person who loves an absent person and is passionately devoted to them, but obstacles decree that they shall not meet.\n\nAs for the Opposite (الضد) with its opposite, the repulsion between them is intrinsic (ذاتية), and there is not the affection between them that exists between the two Differences. Each of the two Opposites desires the annihilation of the essence (عين ضده) of its opposite from Existence. This is contrary to the two Differences, where the affection between them prevents either from desiring the annihilation of the essence of its difference from Existence. Rather, each desires and wishes for union, if possible, so that the Witnessing (المشاهدة) occurs only upon one specific entity, and the other is concealed within it, out of preference by each Difference for its difference over itself. However, they never unite due to their intrinsic natures.\n\nExamples of two Likes are two whites; examples of two Opposites are white and black; and examples of two Differences are a color and a scent or a taste in a single location. The purpose of what we have mentioned is to inform you of the servant’s relationship to Allah regarding the proportions of these relationships that he possesses.\n\n### [Indeed, the Perfect Human is the gathering place of Opposites]\n\nKnow that the Perfect Human (الإنسان الكامل) gathers all these matters in his essence (بذاته), and this is not granted to anyone else. Thus, he is with The Real (الحق) a Like, an Opposite, and a Difference. This ruling also applies to what we mentioned regarding each of these three: for white differs from white by location, as the location distinguishes it, so it is said, \"This white is not that white.\" It opposes its like, for a single location does not gather them. And it is a Like to it, because the definition and the reality encompass them from all aspects.\n\nThus, everything we mentioned accepts what the other accepts of likeness, opposition, and difference. What is needed in this chapter is the knowledge of the human being with his counterpart among humans, if generalized, or with others in the Cosmos, if specialized in terms of relationship; and the knowledge of the human being with The Real, so that he may know what his form from Him is based upon. For The Real has cared for him with the utmost care, a care not given to any other creature, by making him a Caliph (خليفة), granting him perfection through the knowledge of the Names (علم الأسماء), creating him upon the Divine Form (الصورة الإلهية), and perfecting him beyond what is possible to exist in Existence.\n\nThe Perfect Human is a Like (مثل) in terms of the Divine Form; he is an Opposite (ضد) in terms of the fact that it is not correct for him, while being a servant (عبدا), to be a Lord (ربا) to the One whose servant he is; and he is a Difference (خلاف) in terms of The Real being his hearing, his sight, and his powers, thus establishing Him and establishing Himself in a single essence (عين واحدة).\n\nWhoever knows himself knows his Lord with the knowledge of Like, Opposite, and Difference. Thus, he is the Friend (الولي) and the Enemy (العدو). Allah the Exalted said, <<لا تَتَّخِذُوا عَدُوِّي وعَدُوَّكُمْ>> (Do not take My enemy and your enemy) addressing the believers, <<أَوْلِياءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ>> (as allies, showing them affection) because they are Likes (أمثالا) to you, due to the opposition (الضدية) that exists between two Likes. So He told the believer to treat the enemy with the opposition of the Like, not the affection of the Like, because your reality is one. Understand this, for the enemy desires your expulsion from Existence, as we previously established in the knowledge of the Opposite.\n\nTherefore, Allah the Exalted said in this verse, <<وقَدْ كَفَرُوا بِما جاءَكُمْ من الْحَقِّ يُخْرِجُونَ الرَّسُولَ وإِيَّاكُمْ>> (And they have disbelieved in what has come to you of the Truth, driving out the Messenger and yourselves). The enemy, though he is your Like, treats you only with the opposition of the Like, not its affection. This is precisely what we mentioned: that the Opposite desires the annihilation of the essence of its opposite from Existence. Thus, when they desire this of us, we are commanded to fight them and remove their essences from the place where they are, transferring them to the Isthmus (البرزخ) through killing.\n\nLook at how wondrous the Quran is, and what knowledge of affairs was granted to the Prophet, peace and blessings be upon him! If this opposition does not run through the essence of the Like, then he is not a believer, nor does he hold a place with Allah. However, a balance (ميزان) and a sound Unveiling (كشف صحيح) are needed to distinguish the intrinsic enemy (العدو الذاتي), who should be treated with such opposition, from the accidental enemy (العدو العرضي), whose enmity is temporary and will cease when the cause that necessitated it disappears.\n\nAs Allah the Exalted relates concerning some servants on the Day of Resurrection, they will say: <<يا لَيْتَنِي اتَّخَذْتُ مَعَ الرَّسُولِ سَبِيلًا يا وَيْلَتى‏ لَيْتَنِي لَمْ أَتَّخِذْ فُلاناً خَلِيلًا لَقَدْ أَضَلَّنِي عَنِ الذِّكْرِ بَعْدَ إِذْ جاءَنِي وكانَ الشَّيْطانُ>> (Oh, would that I had taken a path with the Messenger! Oh, woe is me! Would that I had not taken so-and-so as a friend! He led me astray from the Remembrance after it had come to me. And Satan)—meaning the human devil (شيطان الإنس), not the jinn devil—<<لِلْإِنْسانِ خَذُولًا>> (is ever a betrayer of man). For he said, \"No one led me astray from the Remembrance except so-and-so,\" naming a human like himself, because he listened to him and imitated him in his speech, thus preventing himself from following what Allah commanded him to follow, which is what the Messenger of Allah, peace and blessings be upon him, brought.\n\nThe reason for this was the new restriction (التحجير الجديد) that the Messenger brought them from Allah. Although they were already under restriction, which is necessary for the welfare of the Cosmos, they had become accustomed to the old one, grew up with it, and knew no other. Thus, they did not reject restriction itself, but they rejected this specific restriction. It is difficult for the nature (الطبع) to abandon what it is accustomed to. This is why nature does not become accustomed to pain, even if it persists, for it rejoices at its removal due to the lack of familiarity with it. Had it been accustomed to it, it would grieve at its removal.\n\nSince it is not possible for every human to attain the absolute rank of perfection required in humanity, even though some excel others, the lowest in rank is the animalistic human (إنسان حيواني), and the highest is the Shadow of Allah (ظل الله), who is the Perfect Human (الإنسان الكامل), the Deputy of The Real (نائب الحق). The Real becomes his tongue and all his powers. Between these two stations are various levels (مراتب).\n\nIn the time of the Messengers, the Perfect Human is a Messenger. In the time when Messengership ceases, the Perfect Human is an Inheritor (وارث). The Inheritor has no manifestation while the Messenger is present, for the Inheritor is only an inheritor after the death of the one he inherits from. Thus, the Companion (الصاحب) could not attain this rank while the Messenger was present.\n\nThe Command descends continuously from Allah and never ceases. Only the Messengers receive it perfectly. When they are absent, that preparedness (الاستعداد) is found in others besides the Messengers, and they receive that Divine Descent (التنزل الإلهي) in their hearts. They are called Inheritors, but the name Messenger is not applied to them, even though they convey information from Allah through the Divine Descent.\n\nIf that Divine Descent contains a legal ruling (حكم), the one who receives it takes it and rules by it. This is what the scholars of external forms (علماء الرسوم) call the *Mujtahid* (Jurist who exercises independent reasoning) who deduces the ruling, and he is the one referred to in Allah’s saying: <<لَعَلِمَهُ الَّذِينَ يَسْتَنْبِطُونَهُ مِنْهُمْ>> (Those who can deduce it among them would know it).\n\nThis is the share of people today in legislation after the Messenger of Allah, peace and blessings be upon him. We affirm this, but we do not say that *Ijtihad* (independent reasoning) is what the scholars of external forms mention. Rather, *Ijtihad* for us is the exertion of effort to achieve the inner preparedness (الاستعداد الباطن) by which one receives this specific Descent, which, during the time of Prophethood and Messengership, is received only by a Prophet or a Messenger.\n\nHowever, there is no way to contradict a fixed ruling that has been established by the Messenger, peace and blessings be upon him, in the matter itself (في نفس الأمر). If such a ruling was not established in the matter itself, then nothing is cast upon this *Mujtahid* whom we mentioned except what is the ruling upon him in the matter itself, such that if the Messenger, peace and blessings be upon him, were alive, he would rule by it. Even though the ruling of the *Mujtahid* is affirmed even if he errs, the *Mujtahid* only erred in the preparedness (الاستعداد), as we mentioned. If he had succeeded in the preparedness, no *Mujtahid* would ever err. Rather, he would not be a *Mujtahid* in the ruling, but merely a conveyor of what he received from The Real that descended upon him in His Theophany (تجليه). This is rare in the Community; it is found only in individuals. Their sign is that they never differ in the ruling, due to the singularity of the Messengership in this time. If they differ, they are not the ones we mentioned.\n\nThus, the possessor of The Real (صاحب الحق), if the rulings are confined to a division, is one of them. If a division remains upon which no ruling has fallen, The Real may be found therein. Despite this, each one is bound by what his evidence grants him. If he is correct, he has two rewards; if he errs, he has one reward. Thus, *Ijtihad* occurs within *Ijtihad*.\n\nSince it is established that the Divine Descent (التنزل الإلهي) has not ceased, and that it is of various kinds, all of which are Knowledge (*‘Ilm*), whether it is the descent of a legal ruling or otherwise, according to the stations (المواطن)—do you not see that the station of the Hereafter in Paradise has a continuous Descent, but it contains no ruling of restriction whatsoever, unlike its descent in the world? This is what I mean by the ruling of the stations, and all of it is Divine instruction.\n\nSince the Perfect Human contains the Like, the Opposite, and the Difference, just as they are found in the Divine Names (الأسماء الإلهية)—the Like, such as the All-Merciful (الرحمن) and the Compassionate (الرحيم); the Difference, such as the All-Merciful and the Patient (الصبور); and the Opposite, such as the Harmful (الضار) and the Beneficial (النافع)—\n\nThe Prophet, peace and blessings be upon him, raising our aspirations to high ranks, said: \"Had I taken an intimate friend (خليلا), I would have taken Abu Bakr as an intimate friend, but your companion is the Intimate Friend of Allah (خليل الله)!\"\n\nAnd Allah says, <<واتَّخَذَ الله إِبْراهِيمَ خَلِيلًا>> (And Allah took Abraham as an intimate friend). And the Prophet, peace and blessings be upon him, said to his Lord, \"You are the Companion (الصاحب) in travel.\"\n\nIf you know that intimate friendship (خلة) with His servants is not impossible for Allah, then strive to be that intimate friend by looking at what leads to the attainment of this noble intimate friendship. You will find no cause for it except conformity (الموافقة). We have no knowledge of our conformity to The Real except through our conformity to His Law (شرعه). What He forbade, we forbid; what He permitted, we permit; what He made allowable, we make allowable; what He disliked, we dislike; what He recommended, we recommend; and what He obligated, we obligate.\n\nIf this encompasses you in your soul, and this is your description, and you stand in it in the station of The Real, then intimate friendship (الخلة) becomes sound for you—nay, rather, Love (المحبة), which is greater and more specific than intimate friendship. For the intimate friend accompanies you *for your sake*, while the lover accompanies you *for His own sake*. How vast is the difference between intimate friendship and love! I have guided you to the attainment of these two stations.\n\nThe intimate friend is supported by his intimate friend, while the beloved is internalized by his lover, who protects him with Himself. The Real is the shield (مجن) of the beloved, and the intimate friend is the shield of his intimate friend. Do you not see what Allah has established in the souls of the world, where they make bread and salt (الخبز والملح) a cause necessitating that each of the two persons between whom the covenant of salt (الممالحة) exists should be a ransom for his companion, protecting him from all harm and guarding him as he guards himself? This is also the case in its essence.\n\nWhen we witnessed this with The Real, a witnessing of the essence (مشاهدة عين), and the covenant of salt occurred, and I saw its effect, praise be to Allah, as a decisive proof, I said concerning that:\n\nI shall surely eat the bread and the salt,\nUntil I see the Proof and the Opening (الفتحا).\n\nAnd I shall look at the Command that has appeared,\nWhich is established in the Tablet and is not erased.\n\nI seek war for the sake of the enemies,\nI seek neither peace nor reconciliation.\n\nIf the Command came to me from Him,\nA command that shows me the Unveiling and the Explanation.\n\nI obligated myself, seeking high rank,\nTo prefer kindness and sincere counsel.\n\nAnd I said to the Builder, \"Build for me\nA palace (صرحا) from the work of the spirits.\"\n\nPerhaps I shall see Bilqis when she tucked up\nHer skirt when she saw the palace.\n\nShe imagined it to be a deep pool,\nSo she turned away from her throne.\n\nShe did not know, when she saw herself,\nConcealment, nor Unveiling, nor a glimpse.\n\nThus, the bread and salt granted that one should not take an enemy of Allah as a beloved or a lover. Since Allah knew the intrinsic nature of man—his love for the benefactor due to his beneficence, and his seeking affection from his likes through friendliness—He knew that when He said to them, <<لا تَتَّخِذُوا عَدُوِّي>> (Do not take My enemy), they would not stand in this prohibition on the side of The Real in the manner that The Real deserves, due to what we mentioned. So He added to the address, saying, <<وعَدُوَّكُمْ>> (and your enemy). This was to make them hateful to us, knowing that we love ourselves and prefer our desires over Him, the Exalted.\n\nThere is no greater censure against us in the Quran from Allah than this. For if He had known that we would prefer Him over our desires, He would have sufficed with His saying, \"My enemy.\" Then He completed it in a single sequence, saying, <<يُخْرِجُونَ الرَّسُولَ>> (They drive out the Messenger), meaning from his homeland, for separation from homelands is one of the hardest things for a human. Since Allah knew that the expulsion of the Messenger, while you remained in your homelands, would not hold the rank that the Messenger deserves from you, He said, <<وإِيَّاكُمْ>> (and yourselves). Thus, He made you partners in the expulsion with the Messenger, just as He made you partners in the enmity with Allah, so that you would be more eager not to show them affection and to take them as enemies.\n\nThe believers here include everyone other than the Messenger. For when it becomes clear to the Messenger that a person is an enemy of Allah, he disavows him. Allah the Exalted said concerning Abraham and his father Azar: after Abraham advised him and showed compassion, because he considered it possible for him to return to Allah and His Unity (توحيده) from his polytheism (شركه). But when Allah clarified to him in His revelation and unveiled to him the matter of his father, and it became clear to Abraham that his father Azar was an enemy of Allah, he disavowed him, despite him being his father. Allah praised him, saying, <<فَلَمَّا تَبَيَّنَ لَهُ أَنَّهُ عَدُوٌّ لِلَّهِ تَبَرَّأَ مِنْهُ>> (But when it became clear to him that he was an enemy of Allah, he disavowed him). Abraham had been compassionate and forbearing regarding his father, but not now. It is mentioned in the Hadith that Abraham will find his father between his feet in the form of a hyena, and he will take him by the hand and throw him into the Fire.\n\nLook at the effect of the Intimate Friend’s preference for the Divine Presence (جناب الحق) over the enmity of his father in Allah the Exalted. May Allah make us among those who prefer The Real over their desires and make that their ultimate wish. How great is my regret that we were not of this stature before Allah, such that He would have sufficed with mentioning their enmity toward Allah and the expulsion of the Messenger! It is here that tears should be shed. Happy is the one who finds this state within himself and does not fall under this address. To the extent that you lack this state, you lack Gnosis (المعرفة) of Allah.\n\nSince the time Allah granted me the opening (الفتح) in this path, I have not met anyone upon this footing whom I recognized by it, even if he possessed it in the matter itself, but Allah did not make him known to me. Perhaps I presented it to him, but I found nothing from him except the opposite. However, I know that there are servants on earth who possess this station. Praise be to Allah who granted me the opening to it, and we hope, God willing, to remain upon it. For most doors of Gnosis of Allah intervene between this station and the believers and scholars. It is an obscure station, difficult to conceive, into which many Divine Gnositic insights (معارف إلهية) penetrate. If someone does not attain this station by taste (ذوقا)—\n\n### [Indeed, there is a suitability between Allah and whoever is an enemy of Allah]\n\n—then know that there is a suitability (مناسبة) between him and whoever is an enemy of Allah. Because of that suitability, he did not disavow him when it became clear to him, for before the clarification, he is excused. Allah the Exalted said, <<ما كانَ لِلنَّبِيِّ والَّذِينَ آمَنُوا أَنْ يَسْتَغْفِرُوا لِلْمُشْرِكِينَ ولَوْ كانُوا أُولِي قُرْبى‏ من بَعْدِ ما تَبَيَّنَ لَهُمْ أَنَّهُمْ أَصْحابُ الْجَحِيمِ>> (It is not for the Prophet and those who have believed to ask forgiveness for the polytheists, even if they were relatives, after it has become clear to them that they are companions of the Blazing Fire). And He said, <<ما كانَ لِأَهْلِ الْمَدِينَةِ ومن حَوْلَهُمْ من الْأَعْرابِ أَنْ يَتَخَلَّفُوا عَنْ رَسُولِ الله ولا يَرْغَبُوا بِأَنْفُسِهِمْ عَنْ نَفْسِهِ>> (It was not for the people of Medina and those around them of the Bedouins to remain behind the Messenger of Allah or to prefer themselves over his soul). None are companions of the Blazing Fire except the enemies of Allah the Exalted, who are the people of the Blazing Fire.\n\nSo be with The Real, seeking no substitute for Him,\nAnd single out The Real, setting no likeness for Him.\n\nAnd Allah is the Guardian of assistance and success.\n\nKnow that this station encompasses the knowledge of the increase of good, and it contains the knowledge of what distinguishes The Real from falsehood, and the boundaries (الحدود) that separate things and distinguish some from others. It contains the knowledge of the servants of allusions (عبيد الكنايات), not the servants of the Names (عبيد الأسماء), and the ranks between them in elevation and honor, and which is the stronger connection in servitude: the servant of the allusion or the servant of the Name.\n\nIt contains the knowledge of all the sciences related to the entire Cosmos (العالم). It contains the knowledge of the Attributes (الصفات) specific to The Real, excluding His creation. It contains the knowledge of why Transcendence (التنزيه) returns—is it to Existence (وجود) or to non-existence ('adam)? It contains the knowledge of the Scales (الموازين). It contains the knowledge of what necessitated the taking of partners (الشريك) in the Cosmos.\n\nAnd every newborn is born upon the Primordial Nature (الفطرة). So from where did the first one disbelieve? And his parents are the ones who Judaize him, or Christianize him, or make him a polytheist, or Magianize him. Does the intellect, in its thought here, descend to the rank of the parents in that its consideration has led this person away from his Primordial Nature to the affirmation of a partner?\n\nIt contains the knowledge of what the human owns by his essence and what he does not own, and why he acts in what he does not own. It contains the knowledge of the fate of the one who speaks falsehood and the one who witnesses to it, and the fact that the ruler is not infallible (غير معصوم) when following his desire, and why Allah kept him as a ruler in the external matter, even though he is dismissed in the internal matter regarding what he ruled by his desire. And His saying, the Exalted, <<قالَ رَبِّ احْكُمْ بِالْحَقِّ>> (He said, \"My Lord, judge in truth\").\n\nIt contains the knowledge of the signs by which the truthful is known from the liar, which are signs that cannot be spoken, but which the human finds within himself if he is among the people of spiritual vigilance (المراقبة) over his states, so the knowledge of that does not escape him. The believers are more entitled to know them than the people of intellectual speculation.\n\nIt contains the knowledge specific to the Shaykhs in this path, by which they know the state of the disciples (المريدين): when they deserve to be disciples and when the Shaykh should turn to them with the acceptance of benefit. The Shaykh in this path should not alert the disciple to the form (صورة) of what occurs when its meaning is attained in his soul—the attainment of the opening (الفتح) and the achievement of felicity—lest he manifest the form while the inner reality (الباطن) is stripped of the meaning that necessitates that form.\n\nIf you say, \"Then the Shaykh should not conceal this from the disciple,\" we say, \"Rather, he should conceal it from the disciple, and it is obligatory upon him to do so.\" This is because he knows that if the meaning that necessitates the appearance of that form arises in the disciple, it will necessitate the appearance of that form for him. The Shaykh will then know that Allah has qualified that disciple to be among the people of The Real. If the Shaykh informs him of that meaning which necessitates the manifestation of this form, and the soul is naturally inclined to treachery and lack of sincerity, he will manifest the form without the meaning, and error will occur, just as the hypocrite manifests the form of the believer in external action while the inner reality is stripped of what necessitates that action.\n\nIt contains the knowledge of the cause of the narrowness (الضيق) in the Fire, despite the vastness within it. It contains the knowledge of what is coupled with the believer in Paradise and what is coupled with the polytheist in the Fire, and the difference between Existence (الوجود) and Unity (التوحيد). For the polytheist believes in Existence but is not a Unitarian (موحد). The punishment in the Fire is necessitated by the lack of Unity, not the affirmation of Existence. From this, you know the companion of the polytheist from the companion of the believer.\n\nIt contains the knowledge of the entry of all possibilities (الممكنات) into Existence in terms of their genera and species, not in terms of their individuals and singular entities—nay, rather, the individuals of some of them, but not all. Here is a subtle consideration granted by the Unveiling: Is the new creation (الخلق الجديد) in all the forms in Existence for their bearers, which some people are confused about, or not?\n\nWhoever sees the renewal says that the individuals of every species never cease. Whoever sees no renewal says that in the Hereafter, the individuals of this human species have ceased, and no human will exist after that. This is a subtle issue that we cannot discuss entirely, for it is among the secrets that are not divulged except to their people. It is among the sciences that are only spoken of to the people of fragrances (أهل الروائح), and whoever has no sense of smell does not accept reports about its reality.\n\nIt contains the knowledge of what is given and what is not given. It contains the knowledge of what felicity (السعادة) is in being ignorant of. For knowledge grants that when one knows a matter in the Cosmos, he is satisfied with it and begins to seek other knowledge, since what is attained is not sought. If he says, \"I know such-and-such,\" it is impossible for the soul to long for it after its attainment. Therefore, no one ever knows Allah absolutely, because that would lead to independence from Him in terms of knowing Him. If you say, \"Rather, knowing Him makes him not independent of Him,\" we say to you, \"That is not the knowledge of Him, but the knowledge you mentioned is the knowledge of the fact that he is not independent of Him, and the knowledge of Him that we intended is another matter. You are knowledgeable of the ruling, not of Him. Thus, there is no contradiction between your objection and what we said. Understand this.\"\n\nIt contains the knowledge of the trial of the Cosmos, one part by another: is it from the door of mercy for the Cosmos or from the door of wretchedness? It contains the knowledge of the obstacles that prevented the acceptance of what came from Allah, despite the souls' longing to see the strange when it arrives and to accept it. For the mercy of the Law (الشريعة) is understood only by the scholars specifically. This is why no scholar rejects it when he sees it. This is why we were commanded to believe in it, even if it has been abrogated and its ruling lifted, and acting upon it has become forbidden for us.\n\nIt contains the knowledge of the benefit of knowledge. It contains the knowledge of what you see as a thing, yet it is not a thing, but it is a thing because you saw it as a thing. An example of this is the mirage (السراب): you see it as water, and the reflection (الآل), which is the person's image in the mirage, appears magnified, and you do not doubt its magnitude. When you approach it, you do not find it as you saw it, yet someone else at that moment, who is at the distance where you saw it as magnified, sees it as magnified, while you, having approached it, see it as not magnified. This is a noble Divine science.\n\nIt contains the knowledge of preference between two Opposites, such as the preference between black and white. This is because color gathers them, so the preference occurs. In every preference in Existence, there must be a comprehensive element (جامع) that gathers them—meaning, that gathers all those in Existence. This is why the Esotericists (الباطنية) fled from The Creator (الباري) when it was said to them that He is an existent (موجود) who is not non-existent (معدوم). They did not know that they fell into the very thing they fled from, for just as the word 'existent' is applied to the contingent existent, the name 'not non-existent' is also applied to it. Thus, partnership occurred in the fact that He is 'not non-existent,' and likewise for everything the Esotericist asks about. This is why they are the most ignorant of people concerning the realities (الحقائق).\n\nIt contains the knowledge of the Cloud (الغمام), which is from distress (الغم), and whether The Real comes in it on the Day of Resurrection, or the angels, or The Real and the angels. What is granted from distress? It contains the knowledge of when The Real is singular in Sovereignty (الملك), or if He has never ceased to be singular in it, but is unknown in one station and known in another, yet He is He and no other. For He, the Exalted, is a Sovereign by reality, and the creature is a sovereign by appointment. He said, <<وجَعَلَكُمْ مُلُوكاً>> (And He made you sovereigns). From this, you know who the Sovereign of Sovereignty (ملك الملك) is.\n\nIt contains the knowledge of the injustice (الظلم) brought by the Divine Laws (الشرائع) and its effect, and the knowledge of the injustice granted by the intellect and its effect, and the knowledge of praiseworthy and blameworthy injustice. It contains the knowledge of the difference between the devils of mankind (شياطين الإنس) and the devils of the jinn, and who should be accompanied and who should never be accompanied from this human species.\n\nIt contains the knowledge of the recourse of the callers to Allah (الدعاة) when their call is not heard, whether they are a Messenger or an Inheritor. It contains the knowledge of The Real making an Opposite for everything. It contains the knowledge of the specification of one of the two Opposites with Divine Love and the other with Divine Hatred, and whether they originate from a single essence (عين واحدة) or from two hands (يدين) differing in ruling.\n\nIt contains the knowledge of the occurrence of rulings with the occurrence of new events (النوازل), and that the Law (الشرع) has not ceased and will not cease until Allah inherits the earth and those upon it, even if Prophethood has ceased. The Law has not ceased as long as there is a *Mujtahid* in the Cosmos.\n\nIt contains the knowledge of the Divine resemblance (المضاهاة الإلهية) to the existents (الأكوان): is that due to the high rank of the existents or for another reason, such as His saying, the Exalted, <<ولا يَأْتُونَكَ بِمَثَلٍ إِلَّا جِئْناكَ بِالْحَقِّ وأَحْسَنَ تَفْسِيراً>> (And they do not come to you with an example except that We bring you the Truth and the best explanation)?\n\nIt contains the knowledge of who walks on his belly among mankind, and in what form he will be resurrected from this manner of walking. It contains the knowledge of who confines himself to the lower (الأدنى) despite his knowledge of the higher (الأعلى), and the higher calls him to it, while the lower does not call him to it. So who calls him to the lower such that he confines himself to it?\n\nIt contains the knowledge of what the human—any human—exceeds in his knowledge of others over his knowledge of himself. It contains the knowledge of the Witnessing of the Qualities (الكيفيات), and who is described by us as having Quality. It contains the knowledge of the attachment of the Perfect Human to his Lord, and the Divine Jealousy (الغيرة الإلهية) over the station when the human manifests the form of his Lord by action, and that the ruling of a thing by action grants the opposite of what it grants by potentiality, so its granting by action is stronger.\n\nIt contains the knowledge of manifestation and concealment, and rest. It contains the knowledge of the breaths (الأنفاس) manifested in the Cosmos by mercy, and the cause of that, and the generality of creation's entry into these breaths. It contains the knowledge of what The Real desires to manifest and what the opposing human desires to conceal, which is the one who sees benefit in what is not realized in Existence. The possessor of this station needs sharp insight (بصر حديد) because of the legal balances (الموازين الشرعية), for ignorance of the benefits that The Real sees is greater than knowledge of the apparent benefits in the Cosmos that are not benefits in the rational view of the intelligent. This is a subtle science: if a human acts upon it based on Unveiling and verification, he never errs. If one who lacks this quality acts upon it, he errs. This is what the common people say: \"The error of the felicitous is correctness, and the correctness of the one who is not felicitous is error.\" I saw this in Hatlaha in Malatya, and he spoke to me about it directly.\n\nIt contains the knowledge of the mixture (الامتزاج) in which separation is impossible, which is every two Opposites between which there is an intermediary, like lukewarm (الفاتر) between hot and cold. No one can separate the heat from the cold in this lukewarm state.\n\nIt contains the knowledge of the difference between one who is *for* Allah and one who is *against* Allah. It contains the knowledge of the path to Allah through intention (النية), even if it is not legislated; it is beneficial in every aspect, for one intended none but Allah, and the generality of the Divine Theophany (التجلي الإلهي) is known, so the servant has free will in that.\n\nIt contains the knowledge specific to the Name the All-Merciful (الرحمن) apart from the other Divine Names, and how the Name the All-Merciful should be treated apart from the other Divine Names. It contains the knowledge of what the named thing is. It contains the knowledge of alternation (التناوب), and that the alternating entities do not unite, and what occurs in the human world from them. It contains the knowledge of deliberation (التؤدة) and stillness, and where they are praiseworthy. It contains the knowledge of the attributes of the felicitous (السعداء) as distinct from others, rationally and legally. It contains the knowledge of which attributes accept change and which do not, and from whom they are not accepted. It contains the knowledge of the Protected (المحفوظين) and the Infallible (المعصومين) among the scholars who have Gnosis of Allah the Exalted. It contains the knowledge of what remembrance (الذكرى) produces from the believer. It contains the knowledge of who sought leadership (الإمامة) and was aided in it. It contains the knowledge of the care given to the callers to Allah and the honor of their station with Allah. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تین سو انسٹھ: \"میں تمہیں مخاطب کرتا ہوں، اے پڑوسن، سنو\" کی منزل کی معرفت میں۔ یہ امر کی تقسیم اور حقیقت محمدیہ (الحقیقۃ المحمدیۃ) سے کشف (الکشف) میں راز کو چھپانے کی صورت کی منزل ہے۔\n\n> دیکھو اس شخص کے سائے کی کمی کو جب *** سورج بلند ہوتا ہے اور اس کے سائے کو فنا کر دیتا ہے\n>\n> یہ اس کے ہمیشہ کی حرکت کی دلیل ہے *** ابتدا میں اور واپسی میں، اور یہ مقدار اس کے لیے کافی ہے\n>\n> اگر وہ ایک لمحے کے لیے بھی ٹھہر جاتا تو *** کُن (ہو جا) سے کائنات میں کوئی اثر ظاہر نہ ہوتا، اور یہ حکم اس کے منہ سے ہے\n>\n> پس کائنات رحمن کے سانس سے ہے، اس کے لیے *** اس کے سوا کوئی اصل نہیں، لہٰذا قول کا حکم اسے ظاہر کرتا ہے\n>\n> جو عقل کے تقاضے کے خلاف ہے، اسے پھینک دو *** کیونکہ شریعت الٰہی کی حکمت اسے پورا کرتی ہے\n>\n> میں نے اس کی نہ کوئی آنکھ دیکھی نہ کوئی اثر *** اور اگر ہوتا تو عقل اسے چھپا دیتی\n\n### [بے شک اللہ نے کوئی چیز پیدا نہیں کی مگر اس کے لیے ضد، مثل اور خلاف پیدا کیا]\n\nاللہ تمہیں اپنی روح سے مدد دے، جان لو کہ جب اللہ نے اشیاء کو اس حکم کے مطابق پیدا کیا جس کا تقاضا وجودِ اصل (الوجود الأصل) نے کیا جو اس پر اور اس کے لیے ہے، تو اللہ تعالیٰ کے سوا ہر چیز وجود میں آئی۔ پس اس نے کوئی چیز پیدا نہیں کی مگر اس کے لیے ضد (الضد)، مثل (المثل) اور خلاف (الخلاف) پیدا کیا۔ چنانچہ اس نے موافقت کو خلاف (الخلاف) میں، نفرت (المنافرة) کو ضد (الضد) میں، اور مناسبت (المناسبة) کو مثل (المثل) میں رکھا۔ پس سب سے زیادہ وصل، محبت اور اتحاد خلاف (الخلاف) کا اپنے مخالف کے ساتھ ہوتا ہے۔ اسی لیے خلاف (الخلاف) اس کے مطابق ہوتا ہے جس کی وہ مخالفت کرتا ہے، اور وہ اپنے ساتھی سے صرف اپنے حکم کے ذریعے ممتاز ہوتا ہے۔ پس دونوں خلاف (الخلافان) محل میں متحد ہوتے ہیں اور اس میں حکم کے ذریعے ممتاز ہوتے ہیں۔ اور جہاں تک مثل (المثل) کا اپنے مثل کے ساتھ تعلق ہے، تو مناسبت (المناسبة) ان دونوں کو محبت میں جمع کرتی ہے، پس ہر مثل اپنے مثل سے اس مناسبتِ مثلیت کی وجہ سے محبت کرتا ہے جو اس میں موجود ہے، اگرچہ وہ دونوں جمع نہ ہوں۔ پس مثل (المثل) محبت میں خلاف (الخلاف) سے مشابہت رکھتا ہے، اگرچہ ان دونوں کی حقیقتوں میں فرق ہے۔ اور وہ ضد (الضد) سے اس میں مشابہت رکھتا ہے کہ وہ دونوں کبھی جمع نہیں ہوتے۔ پس وہ ایسے ہیں جیسے کوئی غائب کسی غائب سے محبت کرے اور عشق میں اس پر فریفتہ ہو جائے، لیکن رکاوٹوں نے حکم دیا ہو کہ وہ دونوں جمع نہ ہوں۔ اور جہاں تک ضد (الضد) کا اپنے ضد کے ساتھ تعلق ہے، تو ان کے درمیان ذاتی نفرت (المنافرة) ہوتی ہے، اور ان کے درمیان وہ محبت نہیں ہوتی جو دو خلافوں کے درمیان ہوتی ہے۔ پس ہر ایک ضد اپنے مقابل ضد کی ہستی (عین) کو وجود (الوجود) سے ختم کرنا چاہتا ہے، برخلاف دو خلافوں کے۔ ان کے درمیان جو محبت ہوتی ہے وہ ان میں سے ہر ایک کو اپنے خلاف کی ہستی کو وجود سے ختم کرنے سے روکتی ہے، لیکن وہ یہ چاہتا اور خواہش کرتا ہے کہ کاش اس کے ساتھ اتحاد ممکن ہو جائے تاکہ مشاہدہ (الشہود) صرف ایک ہی پر واقع ہو، اور دوسرا اس میں غائب ہو جائے، یہ ہر خلاف کی طرف سے اپنے خلاف پر ایثار ہے۔ لیکن وہ دونوں اپنی ذات کی وجہ سے کبھی جمع نہیں ہوتے۔ دو مثلوں کی مثال دو سفیدیاں ہیں، اور دو ضدوں کی مثال سفیدی اور سیاہی ہے، اور دو خلافوں کی مثال ایک ہی محل میں رنگ اور خوشبو یا ذائقہ ہے۔ اس سب کا مقصد جو ہم نے بیان کیا ہے، تمہیں اللہ سے بندے کی نسبت کی تعریف کرانا ہے کہ اس میں یہ نسبتیں کیا ہیں۔\n\n### [بے شک انسان اضداد کا مجموعہ ہے]\n\nپس جان لو کہ انسان کامل (الإنسان الکامل) نے اپنی ذات میں ان تمام امور کو جمع کیا ہے، اور یہ کسی اور کے لیے نہیں ہے۔ پس وہ حق (الحق) کے ساتھ مثل (المثل)، ضد (الضد) اور خلاف (الخلاف) ہے۔ جیسا کہ جو کچھ ہم نے ذکر کیا ہے، اس کا بھی ان تینوں میں سے ہر ایک پر یہی حکم ہے۔ پس سفیدی سفیدی سے محل کے اعتبار سے اختلاف (الخلاف) رکھتی ہے، کیونکہ محل اسے ممتاز کرتا ہے، چنانچہ کہا جاتا ہے کہ یہ سفیدی وہ سفیدی نہیں ہے۔ اور وہ اپنے مثل کی ضد (الضد) ہے، کیونکہ ایک محل ان دونوں کو جمع نہیں کرتا۔ اور وہ اس کے لیے مثل (المثل) ہے کیونکہ حد اور حقیقت ہر لحاظ سے ان دونوں کو شامل کرتی ہے۔ پس جو کچھ ہم نے ذکر کیا ہے، ان میں سے ہر ایک مثلیت، ضدیت اور خلافیہ کو قبول کرتا ہے جو دوسرا قبول کرتا ہے۔ اور اس باب میں جس چیز کی ضرورت ہے وہ انسان کی اپنے ہم جنس ساتھی کے ساتھ نسبت کی معرفت (المعرفۃ) ہے، اگر وہ عام ہو، یا عالم کی کسی اور چیز کے ساتھ نسبت کی معرفت ہے، اگر وہ خاص ہو، اور انسان کی حق (الحق) کے ساتھ معرفت ہے، تاکہ معلوم ہو کہ اس کی صورت حق سے کس چیز پر ہے۔ کیونکہ حق نے اس پر انتہائی توجہ دی ہے جو کسی مخلوق پر نہیں دی گئی، اس لیے کہ اسے خلیفہ بنایا، اور اسے علم الاسماء کے ذریعے کمال عطا کیا، اور اسے صورت الٰہیہ پر پیدا کیا، اور صورت الٰہیہ کو اس حد تک کامل کیا جو وجود (الوجود) میں ممکن ہے۔ پس انسان کامل (الإنسان الکامل) صورت الٰہیہ کے لحاظ سے مثل (المثل) ہے، اس لحاظ سے ضد (الضد) ہے کہ اس کے لیے جائز نہیں کہ وہ بندہ ہوتے ہوئے اس کا رب بن جائے جس کا وہ بندہ ہے، اور اس لحاظ سے خلاف (الخلاف) ہے کہ حق (الحق) اس کی سماعت، بصارت اور اس کی قوتیں بن گیا، پس حق نے اسے ثابت کیا اور خود کو ایک ہی ہستی (عین) میں ثابت کیا۔ پس جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو مثل (المثل)، ضد (الضد) اور خلاف (الخلاف) کی معرفت (المعرفۃ) کے ساتھ پہچانا۔ پس وہ ولی (دوست) بھی ہے اور عدو (دشمن) بھی ہے۔ اللہ تعالیٰ فرماتا ہے: لَا تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ (الممتحنة: 1) (اے ایمان والو! میرے دشمن اور اپنے دشمن کو دوست نہ بناؤ، تم ان کی طرف محبت کا پیغام بھیجتے ہو)۔ (یہاں) وہ مومنوں کو مخاطب کر رہا ہے، اس لیے کہ وہ تمہارے مثل (المثل) ہیں، کیونکہ دو مثلوں کے درمیان ضدیت (الضدية) ہوتی ہے۔ پس مومن سے کہا کہ دشمن کے ساتھ مثل (المثل) کی ضدیت (الضدية) کے ساتھ معاملہ کرو، نہ کہ مثل (المثل) کی محبت کے ساتھ۔ کیونکہ تمہاری حقیقت ایک ہے۔ پس سمجھو! کیونکہ دشمن تمہیں وجود (الوجود) سے نکالنا چاہتا ہے، جیسا کہ ہم نے ضد (الضد) کی معرفت میں پہلے بیان کیا۔ اسی لیے اللہ تعالیٰ نے اس آیت میں فرمایا: وَقَدْ كَفَرُوا بِمَا جَاءَكُمْ مِنَ الْحَقِّ يُخْرِجُونَ الرَّسُولَ وَإِيَّاكُمْ (الممتحنة: 1) (حالانکہ وہ اس حق کا انکار کر چکے ہیں جو تمہارے پاس آیا ہے، وہ رسول کو اور تمہیں نکالتے ہیں)۔ پس دشمن نے تمہارے ساتھ، اگرچہ وہ تمہارے مثل (المثل) ہیں، مثل (المثل) کی ضدیت (الضدية) کے ساتھ معاملہ کیا، نہ کہ اس کی محبت کے ساتھ۔ اور یہ وہی بات ہے جو ہم نے ذکر کی کہ ضد (الضد) اپنے ضد کی ہستی کو وجود (الوجود) سے ختم کرنا چاہتا ہے۔ پس جب وہ ہمارے ساتھ یہ ارادہ کریں تو ہمیں حکم دیا گیا کہ ہم ان سے قتال کریں، اور ان کی ہستیوں کو اس جگہ سے ختم کر دیں جہاں وہ ہیں، اور قتل کے ذریعے انہیں برزخ میں منتقل کر دیں۔ پس دیکھو قرآن کتنا عجیب ہے اور نبی اکرم صلی اللہ علیہ وسلم کو امور کا کتنا علم عطا کیا گیا، اگر یہ ضدیت (الضدية) مثل (المثل) کی ذات میں سرایت نہ کرے تو وہ مومن نہیں ہے اور نہ ہی اللہ کے نزدیک اس کا کوئی مقام ہے۔ لیکن صحیح میزان اور کشف (الکشف) کی ضرورت ہے تاکہ اس ذاتی دشمن کو پہچانا جائے جس کے ساتھ اس طرح کا معاملہ کرنا چاہیے، اس عارضی دشمن سے جو عارضی طور پر دشمنی کرتا ہے اور پھر اس عارض کے زائل ہونے سے وہ دشمنی بھی زائل ہو جاتی ہے جس نے اسے واجب کیا تھا۔ جیسا کہ اللہ تعالیٰ بعض بندوں کے بارے میں خبر دیتے ہوئے فرماتا ہے جو قیامت کے دن کہیں گے: يَا لَيْتَنِي اتَّخَذْتُ مَعَ الرَّسُولِ سَبِيلًا يَا وَيْلَتَى لَيْتَنِي لَمْ أَتَّخِذْ فُلَانًا خَلِيلًا لَقَدْ أَضَلَّنِي عَنِ الذِّكْرِ بَعْدَ إِذْ جَاءَنِي وَكَانَ الشَّيْطَانُ لِلْإِنْسَانِ خَذُولًا (الفرقان: 27-29) (اے کاش! میں نے رسول کے ساتھ راستہ اختیار کیا ہوتا۔ ہائے افسوس! کاش میں نے فلاں کو دوست نہ بنایا ہوتا۔ اس نے مجھے ذکر (نصیحت) سے گمراہ کر دیا بعد اس کے کہ وہ میرے پاس آ چکا تھا۔ اور شیطان (یعنی جنوں کا شیطان نہیں بلکہ انسانوں کا شیطان) انسان کو رسوا کرنے والا ہے)۔ کیونکہ اس نے کہا کہ مجھے فلاں نے ہی ذکر سے گمراہ کیا، اور اس نے ایک انسان کا نام لیا جو اس کے جیسا تھا، جب اس نے اس کی بات سنی اور اس کے قول میں اس کی تقلید کی، اور اس کے اور اس چیز کی پیروی کے درمیان رکاوٹ بن گیا جس کی پیروی کا اللہ نے اسے حکم دیا تھا، اور وہ وہی ہے جو رسول اللہ صلی اللہ علیہ وسلم اللہ کی طرف سے لائے تھے۔ اور اس کا سبب وہ نئی پابندی تھی جو وہ ان کے پاس اللہ کی طرف سے لائے تھے، اگرچہ وہ پہلے سے ہی پابندی میں تھے، کیونکہ عالم کے مصالح کے لیے پابندی ضروری ہے، لیکن وہ اس کے عادی ہو چکے تھے اور اسی پر پلے بڑھے تھے اور اس کے سوا کسی اور کو نہیں جانتے تھے۔ پس انہوں نے پابندی کا انکار نہیں کیا، بلکہ انہوں نے اس خاص پابندی کا انکار کیا، اور طبعی طور پر مانوس چیز کو چھوڑنا مشکل ہوتا ہے۔ اسی لیے طبیعت درد سے مانوس نہیں ہوتی، اگرچہ وہ طویل ہو جائے، کیونکہ وہ اس کے زائل ہونے پر خوش ہوتی ہے، کیونکہ طبیعت اس سے مانوس نہیں ہے۔ اگر وہ اس سے مانوس ہو جاتی تو اس کے زائل ہونے پر تکلیف محسوس کرتی۔ اور چونکہ ہر انسان کے لیے انسانیت میں مطلوبہ کمال کا درجہ حاصل کرنا ممکن نہیں ہے، اگرچہ بعض بعض پر فضیلت رکھتے ہیں، تو ان میں سب سے کم درجے والا وہ ہے جو حیوانی انسان ہے، اور ان میں سب سے اعلیٰ وہ ہے جو اللہ کا سایہ ہے، اور وہ انسان کامل (الإنسان الکامل) ہے جو حق (الحق) کا نائب ہوتا ہے، حق اس کی زبان اور اس کی تمام قوتیں ہوتا ہے۔ اور ان دونوں مقاموں کے درمیان کئی درجات ہیں۔ رسولوں کے زمانے میں کامل رسول ہوتا ہے، اور رسالت کے منقطع ہونے کے زمانے میں کامل وارث ہوتا ہے۔ اور رسول کی موجودگی میں وارث کا کوئی ظہور نہیں ہوتا، کیونکہ وارث اسی کے مرنے کے بعد وارث بنتا ہے جس کی وہ وراثت پاتا ہے۔ پس رسول کی موجودگی میں صحابی کے لیے یہ مرتبہ حاصل کرنا ممکن نہیں تھا۔ پس امر اللہ کی طرف سے ہمیشہ نازل ہوتا رہتا ہے، منقطع نہیں ہوتا، پس اسے صرف رسول ہی کمال کے ساتھ قبول کرتے ہیں۔ جب وہ مفقود ہو جاتے ہیں، تب یہ استعداد غیر رسولوں میں پائی جاتی ہے، پس وہ اس ظہور الٰہی (التجلی الإلهي) کو اپنے دلوں میں قبول کرتے ہیں، پس انہیں وارث کہا جاتا ہے، ان پر رسول کا نام لاگو نہیں ہوتا، اگرچہ وہ ظہور الٰہی (التجلی الإلهي) کے ذریعے اللہ کی طرف سے خبر دیتے ہیں۔ پس اگر اس ظہور الٰہی (التجلی الإلهي) میں کوئی حکم ہو تو یہ منزل والا اسے لیتا ہے اور اس کے مطابق حکم دیتا ہے۔ اور اسی کو رسمی علوم کے علماء (علماء الرسوم) کی زبان میں مجتہد کہا جاتا ہے جو ان کے نزدیک حکم کا استنباط کرتا ہے، اور وہ اللہ کے اس قول کا عالم ہوتا ہے: لَعَلِمَهُ الَّذِينَ يَسْتَنْبِطُونَهُ مِنْهُمْ (النساء: 83) (تو اسے وہ لوگ جان لیتے جو ان میں سے استنباط (نتیجہ اخذ) کرتے ہیں)۔ پس رسول اللہ صلی اللہ علیہ وسلم کے بعد تشریع (قانون سازی) میں لوگوں کا آج یہی حصہ ہے۔ اور ہم بھی اس کے قائل ہیں، لیکن ہم یہ نہیں کہتے کہ اجتہاد وہی ہے جو رسمی علوم کے علماء (علماء الرسوم) نے ذکر کیا ہے، بلکہ ہمارے نزدیک اجتہاد باطنی استعداد کے حصول میں پوری کوشش کرنا ہے جس کے ذریعے یہ خاص ظہور (التجلی الخاص) قبول کیا جاتا ہے، جسے نبوت اور رسالت کے زمانے میں نبی یا رسول کے سوا کوئی قبول نہیں کرتا۔ مگر یہ کہ کسی ثابت شدہ حکم کی مخالفت کی کوئی گنجائش نہیں ہے جو رسول صلی اللہ علیہ وسلم کی طرف سے حقیقت امر (نفس الأمر) میں مقرر ہو چکا ہو۔ پس اگر وہ حقیقت امر (نفس الأمر) میں نہ ہو، تو اس مجتہد کو جو ہم نے ذکر کیا ہے، صرف وہی حکم القا کیا جاتا ہے جو حقیقت امر (نفس الأمر) میں اس پر ہے۔ یہاں تک کہ اگر رسول اللہ صلی اللہ علیہ وسلم زندہ ہوتے تو وہ بھی اسی کے مطابق حکم دیتے، حالانکہ انہوں نے مجتہد کے حکم کو برقرار رکھا، اگرچہ اس نے غلطی کی ہو۔ پس مجتہد نے صرف استعداد میں غلطی کی، جیسا کہ ہم نے ذکر کیا۔ اگر وہ استعداد میں درست ہوتا تو کوئی مجتہد کبھی غلطی نہ کرتا، بلکہ وہ حکم میں مجتہد نہ ہوتا، بلکہ وہ صرف اس چیز کو نقل کرنے والا ہوتا جو اس نے حق (الحق) سے قبول کیا جو اس پر اس کے ظہور (التجلی) میں نازل ہوا۔ اور یہ امت میں نایاب ہے، یہ صرف چند افراد میں پایا جاتا ہے، اور ان کی علامت یہ ہے کہ وہ حکم میں بالکل اختلاف نہیں کرتے، کیونکہ اس زمانے میں رسالت کی وحدانیت ہے۔ پس اگر وہ اختلاف کریں تو وہ وہ لوگ نہیں ہیں جن کا ہم نے ذکر کیا۔ پس اگر احکام کی تقسیم محدود ہو تو حق (الحق) والا ان میں سے ایک ہوگا۔ اگر کوئی حصہ باقی رہ جائے جس پر کوئی حکم واقع نہ ہوا ہو، تو شاید حق اس میں ہو۔ اس کے باوجود، ہر ایک کو اس چیز پر عمل کرنے کا پابند کیا گیا ہے جو اس کی دلیل نے اسے دی ہے۔ اگر وہ درست ہو تو اسے دو اجر ملیں گے، اور اگر غلطی کرے تو اسے ایک اجر ملے گا۔ پس اجتہاد اجتہاد میں واقع ہوا۔ اور جب یہ بات مقرر ہو گئی کہ ظہور الٰہی (التجلی الإلهي) منقطع نہیں ہوا، اور یہ کہ اس کی کئی اقسام ہیں، اور وہ سب علم ہیں، خواہ وہ شرعی حکم کا ظہور ہو یا کوئی اور، مقامات کے مطابق۔ کیا تم آخرت کے مقام کو نہیں دیکھتے، جنت میں ظہور (التجلی) دائمی ہے، لیکن اس میں مکمل طور پر کوئی پابندی کا حکم نہیں ہے، برخلاف دنیا میں اس کے ظہور (التجلی) کے۔ پس میرا مطلب مقامات کے حکم سے ہے، اور یہ سب الٰہی تعریف ہے۔ اور چونکہ انسان کامل (الإنسان الکامل) میں مثل (المثل)، ضد (الضد) اور خلاف (الخلاف) موجود ہے، جیسا کہ اسماء الٰہیہ میں ہے: مثل (المثل) جیسے الرحمن الرحیم، خلاف (الخلاف) جیسے الرحمن الصبور، اور ضد (الضد) جیسے الضار النافع۔\n\nنبی صلی اللہ علیہ وسلم نے ہمارے حوصلوں کو بلند درجات کی طرف اٹھاتے ہوئے فرمایا: لَوْ كُنْتُ مُتَّخِذًا خَلِيلًا لَاتَّخَذْتُ أَبَا بَكْرٍ خَلِيلًا، لَكِنْ صَاحِبُكُمْ خَلِيلُ اللَّهِ! (اگر میں کسی کو خلیل (گہرا دوست) بناتا تو ابوبکر کو خلیل بناتا، لیکن تمہارا ساتھی اللہ کا خلیل ہے!)۔ اور اللہ فرماتا ہے: وَاتَّخَذَ اللَّهُ إِبْرَاهِيمَ خَلِيلًا (النساء: 125) (اور اللہ نے ابراہیم کو خلیل (گہرا دوست) بنا لیا)۔ اور نبی صلی اللہ علیہ وسلم نے اپنے رب سے فرمایا: أَنْتَ الصَّاحِبُ فِي السَّفَرِ (تو سفر میں ساتھی ہے)۔\n\nپس جب تم جان لو کہ اللہ پر اپنے بندوں کی خلت (دوستی) محال نہیں ہے، تو کوشش کرو کہ تم وہ خلیل بن جاؤ، اس چیز کو دیکھ کر جو اس شریف خلت (الخلة) کے حصول کا باعث بنتی ہے۔ پس تم اس کا کوئی سبب نہیں پاؤ گے سوائے موافقت کے۔ اور ہمیں حق (الحق) کی موافقت کا علم صرف اس کی شریعت کی موافقت سے ہوتا ہے۔ پس جس چیز کو اس نے حرام کیا، ہم نے اسے حرام کیا، اور جس کو حلال کیا، ہم نے اسے حلال کیا، اور جس کو مباح کیا، ہم نے اسے مباح کیا، اور جس کو ناپسند کیا، ہم نے اسے ناپسند کیا، اور جس کی طرف ترغیب دی، ہم نے اس کی طرف ترغیب دی، اور جس کو واجب کیا، ہم نے اسے واجب کیا۔ پس جب یہ تمہارے نفس میں عام ہو جائے اور یہ تمہاری صفت ہو، اور تم اس میں حق (الحق) کے مقام پر قائم ہو جاؤ، تو تمہارے لیے خلت (الخلة) صحیح ہو جائے گی، بلکہ محبت (المحبة) جو خلت (الخلة) سے زیادہ عظیم اور خاص ہے، کیونکہ خلیل (الخلیل) تمہارے لیے تمہارا ساتھ دیتا ہے، اور محب (الحبیب) اپنے لیے تمہارا ساتھ دیتا ہے۔ پس خلت (الخلة) اور محبت (المحبة) میں بہت فرق ہے۔ اور میں نے تمہیں ان دونوں مقامات کے حصول کا طریقہ بتا دیا ہے۔ پس خلیل اپنے خلیل سے مدد حاصل کرتا ہے، اور حبیب اپنے محب میں باطن ہوتا ہے، پس وہ اپنی جان سے اس کی حفاظت کرتا ہے۔ پس حق (الحق) محبوب کی ڈھال ہے، اور خلیل اپنے خلیل کی ڈھال ہے۔ کیا تم نہیں دیکھتے کہ اللہ نے عالم کے نفوس میں کیا جاری کیا ہے، جہاں وہ روٹی اور نمک کو ایک ایسا سبب بناتے ہیں جو دو اشخاص کے درمیان نمک حرامی (ممالحة) کی وجہ سے واجب کرتا ہے کہ ان میں سے ہر ایک اپنے ساتھی پر فدا ہو، اسے ہر ناپسندیدہ چیز سے بچائے، اور اس کی حفاظت کرے جیسے وہ اپنی حفاظت کرتا ہے۔ اور حقیقت امر (عین) میں بھی یہی معاملہ ہے۔ اور جب ہم نے حق (الحق) کا مشاہدہ (الشہود) عین کے مشاہدے کے ساتھ کیا اور نمک حرامی (ممالحة) واقع ہوئی، اور میں نے اللہ کے فضل سے اس کا اثر ایک قطعی دلیل کے طور پر دیکھا، تو میں نے اس بارے میں کہا:\n\n> میں روٹی اور نمک ضرور کھاؤں گا *** یہاں تک کہ میں دلیل اور فتح (الفتح) دیکھوں\n>\n> اور اس امر کو دیکھوں جو ظاہر ہوا *** لوح میں ثابت ہو جائے اور مٹایا نہ جائے\n>\n> اور میں دشمنوں کی خاطر جنگ طلب کروں گا *** میں امن اور صلح طلب نہیں کروں گا\n>\n> پس اگر میرے پاس اس کی طرف سے کوئی امر آئے *** ایسا امر جو مجھے کشف (الکشف) اور شرح دکھائے\n>\n> میں نے اپنے نفس کو بلندی کی طلب میں لازم کیا *** کہ وہ نیکی اور نصیحت کو ترجیح دے\n>\n> اور میں نے معمار سے کہا: میرے لیے بنا *** روحوں کے عمل سے میرے لیے ایک محل\n>\n> شاید میں بلقیس کو دیکھوں جب اس نے اپنے پنڈلی سے کپڑا اٹھایا *** جب اس نے محل دیکھا\n>\n> اس نے گمان کیا کہ وہ گہرا پانی ہے *** پس اس نے اپنے تخت سے منہ موڑ لیا\n>\n> جب اس نے اپنے نفس کو دیکھا تو نہ پردہ پہچانا *** نہ کشف (الکشف) اور نہ ہی جھلک (لمح)\n\nپس روٹی اور نمک نے اسے یہ عطا کیا کہ وہ اللہ کے کسی دشمن کو محبوب یا دوست نہ بنائے۔ اور جب اللہ نے انسان کی فطرت کو جان لیا کہ وہ محسن سے اس کے احسان کی وجہ سے محبت کرتا ہے، اور اپنے ہم شکلوں سے ان کے ساتھ محبت کا اظہار کر کے دوستی حاصل کرتا ہے، تو اسے معلوم تھا کہ جب وہ ان سے کہے گا: لَا تَتَّخِذُوا عَدُوِّي (میرے دشمن کو دوست نہ بناؤ)، تو وہ اس نہی میں حق (الحق) کی طرف سے اس مقام پر قائم نہیں ہوں گے جس کا حق مستحق ہے۔ پس اس نے خطاب میں اضافہ کیا اور فرمایا: وَعَدُوَّكُمْ (اور اپنے دشمن کو بھی)۔ اور یہ اس لیے تاکہ وہ انہیں ہمارے لیے ناپسندیدہ بنا دے، کیونکہ وہ جانتا تھا کہ ہم اپنے نفسوں سے محبت کرتے ہیں اور اس پر اپنی خواہشات کو ترجیح دیتے ہیں۔ پس قرآن میں ہمارے حق میں اللہ کی طرف سے اس سے بڑی کوئی مذمت نہیں ہے۔ کیونکہ اگر وہ جانتا کہ ہم اپنی خواہشات پر اسے ترجیح دیں گے، تو وہ صرف عَدُوِّي (میرے دشمن) کہنے پر اکتفا کرتا۔ پھر اس نے ایک ہی انداز میں بات مکمل کی اور فرمایا: يُخْرِجُونَ الرَّسُولَ (وہ رسول کو نکالتے ہیں)، یعنی اس کے وطن سے۔ کیونکہ وطن سے جدائی انسان پر سب سے زیادہ مشکل گزرنے والی چیزوں میں سے ہے۔ پس جب اللہ نے جان لیا کہ تمہارے لیے رسول کو نکالنا، تمہارے اپنے وطن میں باقی رہنے کے باوجود، اس مقام کے برابر نہیں ہے جس کا رسول تم سے مستحق ہے، تو اس نے فرمایا: وَإِيَّاكُمْ (اور تمہیں بھی)۔ پس اس نے تمہیں رسول کے ساتھ نکالنے میں شریک کیا، جیسا کہ اس نے تمہیں اللہ کے ساتھ دشمنی میں شریک کیا، تاکہ تم ان کی طرف محبت کا پیغام نہ بھیجنے اور انہیں دشمن بنانے میں زیادہ حریص ہو جاؤ۔ اور یہاں مومن سے مراد رسول کے سوا ہر کوئی ہے۔ کیونکہ جب رسول پر یہ واضح ہو جاتا ہے کہ کوئی شخص اللہ کا دشمن ہے تو وہ اس سے بیزاری کا اظہار کرتا ہے۔ اللہ تعالیٰ ابراہیم اور ان کے والد آزر کے حق میں فرماتا ہے، جب ابراہیم نے انہیں نصیحت کی اور ان پر شفقت کا اظہار کیا، کیونکہ ان کے نزدیک یہ ممکن تھا کہ وہ اپنے شرک سے اللہ کی طرف اور اس کی توحید کی طرف لوٹ آئیں۔ پس جب اللہ نے اپنے وحی میں ان پر واضح کر دیا اور ان کے والد کا معاملہ ان پر کھول دیا، اور ابراہیم پر واضح ہو گیا کہ ان کے والد آزر اللہ کے دشمن ہیں، تو انہوں نے ان سے بیزاری کا اظہار کیا، حالانکہ وہ ان کے والد تھے۔ پس اللہ نے ان کی تعریف کی اور فرمایا: فَلَمَّا تَبَيَّنَ لَهُ أَنَّهُ عَدُوٌّ لِلَّهِ تَبَرَّأَ مِنْهُ (التوبہ: 114) (پس جب ان پر واضح ہو گیا کہ وہ اللہ کا دشمن ہے تو انہوں نے اس سے بیزاری کا اظہار کیا)۔ اور ابراہیم اپنے والد کے حق میں بہت آہ و زاری کرنے والے، بردبار تھے، لیکن اب نہیں۔ اور حدیث میں آیا ہے کہ ابراہیم اپنے والد کو اپنے قدموں کے درمیان ایک بھیڑیے کی صورت میں پائیں گے، پس وہ انہیں ہاتھ سے پکڑ کر آگ میں پھینک دیں گے۔\n\nپس دیکھو کہ خلیل (الخلیل) کے نزدیک حق (الحق) کی جناب کو ترجیح دینے کا کیا اثر ہوا کہ انہوں نے اللہ تعالیٰ کی خاطر اپنے والد سے دشمنی کی۔ پس اللہ ہمیں ان لوگوں میں شامل کرے جنہوں نے حق (الحق) کو اپنی خواہش پر ترجیح دی اور اسے ہی اپنا مقصد بنایا۔ میرے نزدیک یہ کتنی بڑی حسرت ہے کہ ہم اللہ کے نزدیک اس مقام پر نہیں تھے کہ ان کی اللہ سے دشمنی اور رسول کو نکالنے کا ذکر ہی کافی ہوتا۔ پس یہاں آنسو بہانے چاہئیں۔ پس خوش نصیب ہے وہ جس نے اپنے نفس میں یہ پایا اور اس خطاب کے تحت نہیں آیا۔ اور جس قدر تم میں اس حال کی کمی ہوگی، اسی قدر اللہ کی معرفت (المعرفۃ) میں تمہاری کمی ہوگی۔ اور جس وقت اللہ نے مجھ پر یہ راستہ کھولا، میں نے اس قدم پر کسی کو نہیں پایا کہ میں اسے اس سے پہچانتا، اگرچہ وہ حقیقت امر (نفس الأمر) میں اس پر ہو، لیکن اللہ نے مجھے اس سے نہیں پہچنوایا۔ اور شاید میں نے اس کے سامنے اس کا ذکر کیا ہو، لیکن مجھے اس کے پاس اس کے برعکس ہی ملا۔ لیکن میں جانتا ہوں کہ زمین میں ایسے بندے ہیں جن کا یہ مقام ہے۔ پس تمام تعریفیں اللہ کے لیے ہیں جس نے مجھ پر اسے کھولا، اور ہم اللہ سے دعا کرتے ہیں کہ وہ ہمیں اس پر باقی رکھے۔ کیونکہ اللہ کی معرفت (المعرفۃ) کے اکثر دروازے اس مقام اور مومنوں اور علماء کے درمیان حائل ہیں۔ پس یہ ایک پوشیدہ مقام ہے، جس کا تصور مشکل ہے، اور بہت سی الٰہی معرفتیں (المعارف الإلهية) اس میں قدح کرتی ہیں۔ اور جب تک کسی کو یہ مقام ذوقاً حاصل نہ ہو:\n\n### [بے شک اللہ اور اس کے دشمن کے درمیان ایک مناسبت ہے]\n\nپس جان لو کہ اس کے اور اللہ کے دشمن کے درمیان ایک مناسبت (المناسبة) ہے۔ اور اسی مناسبت کی وجہ سے وہ اس سے بیزاری کا اظہار نہیں کرتا جب تک کہ اس پر واضح نہ ہو جائے، کیونکہ واضح ہونے سے پہلے وہ معذور ہوتا ہے۔ اللہ تعالیٰ فرماتا ہے: مَا كَانَ لِلنَّبِيِّ وَالَّذِينَ آمَنُوا أَنْ يَسْتَغْفِرُوا لِلْمُشْرِكِينَ وَلَوْ كَانُوا أُولِي قُرْبَى مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمْ أَنَّهُمْ أَصْحَابُ الْجَحِيمِ (التوبہ: 113) (نبی اور ایمان والوں کے لیے جائز نہیں کہ وہ مشرکوں کے لیے مغفرت طلب کریں، اگرچہ وہ ان کے رشتہ دار ہی کیوں نہ ہوں، اس کے بعد کہ ان پر واضح ہو چکا کہ وہ دوزخ والے ہیں)۔ اور فرمایا: مَا كَانَ لِأَهْلِ الْمَدِينَةِ وَمَنْ حَوْلَهُمْ مِنَ الْأَعْرَابِ أَنْ يَتَخَلَّفُوا عَنْ رَسُولِ اللَّهِ وَلَا يَرْغَبُوا بِأَنْفُسِهِمْ عَنْ نَفْسِهِ (التوبہ: 120) (مدینہ والوں اور ان کے ارد گرد کے دیہاتیوں کے لیے جائز نہیں تھا کہ وہ رسول اللہ سے پیچھے رہ جائیں اور اپنی جانوں کو ان کی جان سے زیادہ عزیز رکھیں۔) پس دوزخ والے صرف اللہ کے دشمن ہیں جو دوزخ کے مستحق ہیں۔\n\n> حق (الحق) کے ساتھ رہو، اس کے بدلے میں کسی اور کو مت چاہو *** اور حق (الحق) کو یکتا کرو، اس کے لیے کوئی مثل (المثل) نہ ٹھہراؤ\n\nاور اللہ مدد اور توفیق کا ولی ہے۔ اور جان لو کہ یہ منزل خیر میں اضافے کے علم پر مشتمل ہے، اور اس میں حق (الحق) کو باطل سے ممتاز کرنے کا علم ہے، اور وہ حدود جو اشیاء کو ایک دوسرے سے جدا کرتی ہیں اور بعض کو بعض سے ممتاز کرتی ہیں۔ اور اس میں کنایات کے بندوں کا علم ہے نہ کہ اسماء کے بندوں کا، اور ان دونوں کے درمیان رفعت اور شرف میں جو درجات ہیں، اور عبودیت میں سب سے زیادہ وصل کس کا ہے، کیا کنایہ کا بندہ یا اسم کا بندہ۔ اور اس میں وہ علم ہے جو پورے عالم سے متعلق ہے، اور اس میں وہ علم ہے جو حق (الحق) کے ساتھ خاص ہے نہ کہ اس کی مخلوق کے ساتھ۔ اور اس میں تنزیہ (پاکیزگی) کا علم ہے کہ وہ کس چیز کی طرف لوٹتی ہے، کیا وجود (الوجود) کی طرف یا عدم کی طرف۔ اور اس میں میزانوں کا علم ہے۔ اور اس میں اس چیز کا علم ہے جس نے عالم میں شریک ٹھہرانے کو واجب کیا، اور ہر مولود فطرت پر پیدا ہوتا ہے، تو پہلا شخص کہاں سے کافر ہوا، اور اس کے والدین ہی اسے یہودی یا نصرانی یا مشرک یا مجوسی بناتے ہیں۔ اور کیا عقل یہاں اپنے فکر کے لحاظ سے والدین کے مقام پر نازل ہوتی ہے کہ اس شخص کے غور و فکر نے اسے اس کی فطرت سے نکال کر شریک کے اثبات کی طرف لے گیا؟ اور اس میں وہ علم ہے جو انسان اپنی ذات سے مالک ہوتا ہے اور جو مالک نہیں ہوتا، اور وہ اس چیز میں تصرف کیوں کرتا ہے جس کا وہ مالک نہیں ہوتا۔ اور اس میں جھوٹ بولنے والے اور اس کی گواہی دینے والے کا انجام کا علم ہے، اور حاکم کا اپنی خواہش کی پیروی کی وجہ سے معصوم نہ ہونا، اور اللہ نے اسے ظاہری طور پر حاکم کیوں باقی رکھا، اگرچہ وہ باطنی طور پر اس حکم میں معزول تھا جو اس نے اپنی خواہش سے دیا تھا۔ اور اللہ تعالیٰ کا قول: قَالَ رَبِّ احْكُمْ بِالْحَقِّ (ص: 26) (اس نے کہا: اے میرے رب! حق کے ساتھ فیصلہ فرما)۔ اور اس میں ان علامتوں کا علم ہے جن سے سچے کو جھوٹے سے پہچانا جاتا ہے، اور یہ وہ علامتیں ہیں جو بیان نہیں کی جا سکتیں، بلکہ انسان انہیں اپنے نفس سے پاتا ہے اگر وہ اپنے احوال کی نگرانی (مراقبہ) کرنے والوں میں سے ہو، تو یہ علم اس سے فوت نہیں ہوتا۔ اور جس کی حالت مراقبہ نہ ہو، وہ ان علامتوں کو بالکل نہیں پہچانتا۔ اور مومن ان کی معرفت (المعرفۃ) کے زیادہ حقدار ہیں بہ نسبت اہل نظر کے۔ اور اس میں وہ علم ہے جو اس راستے کے شیوخ کے ساتھ خاص ہے، جس سے مریدوں کا حال پہچانا جاتا ہے کہ وہ کب مرید ہونے کے مستحق ہوتے ہیں، اور کب شیخ کو ان کی طرف افادہ کی قبولیت کے ساتھ متوجہ ہونا چاہیے۔ اور اس راستے میں شیخ کے لیے یہ جائز نہیں کہ وہ مرید کو اس صورت پر متنبہ کرے جو اس کے نفس میں اس کے معنی کے حصول سے ہوتی ہے، یعنی اس کے لیے فتح (الفتح) کا حصول اور سعادت کا حصول، تاکہ وہ اس صورت کے ساتھ ظاہر نہ ہو، جبکہ باطن اس معنی سے خالی ہو جو اس صورت کو واجب کرتا ہے۔ اگر تم کہو کہ یہ بات شیخ کو مرید سے نہیں چھپانی چاہیے، تو ہم کہیں گے: بلکہ اسے مرید سے چھپانی چاہیے اور یہ اس پر واجب ہے، کیونکہ وہ جانتا ہے کہ جب وہ معنی جو اس صورت کے ظاہر ہونے کو واجب کرتا ہے، مرید میں قائم ہو جائے گا، تو وہ اس کے لیے اس صورت کا ظاہر ہونا واجب کر دے گا۔ تب شیخ جان لے گا کہ اللہ نے اس مرید کو اہل حق (الحق) میں سے ہونے کے لیے اہل بنا دیا ہے۔ اور اگر شیخ اسے اس معنی سے آگاہ کر دے جو اس صورت کے ظاہر ہونے کو واجب کرتا ہے، اور نفس خیانت اور عدم صدق پر جبلت کیا گیا ہے، تو وہ معنی کے بغیر صورت کے ساتھ ظاہر ہو جائے گا، اور غلطی واقع ہو جائے گی، جیسا کہ منافق ظاہری عمل میں مومن کی صورت میں ظاہر ہوتا ہے، جبکہ باطن اس عمل کو واجب کرنے والے سے خالی ہوتا ہے۔ اور اس میں آگ میں تنگی کا علم ہے، اس کی وجہ کیا ہے، باوجود اس کے کہ اس میں وسعت ہے۔ اور اس میں اس چیز کا علم ہے جو جنت میں مومن کے ساتھ ملایا جائے گا، اور جو دوزخ میں مشرک کے ساتھ ملایا جائے گا۔ اور وجود (الوجود) اور توحید کے درمیان فرق کا علم ہے۔ کیونکہ مشرک وجود (الوجود) پر ایمان رکھتا ہے، موحد نہیں ہے۔ اور دوزخ میں عذاب کو عدم توحید نے واجب کیا ہے، نہ کہ اثبات وجود (الوجود) نے۔ پس یہاں سے تم مشرک کے ساتھی کو مومن کے ساتھی سے پہچانتے ہو۔ اور اس میں تمام ممکنات کا وجود (الوجود) میں داخل ہونے کا علم ہے، ان کی اجناس اور انواع کے لحاظ سے، نہ کہ ان کے اشخاص اور افراد کے لحاظ سے، بلکہ بعض کے اشخاص کے لحاظ سے، سب کے نہیں۔ اور یہاں ایک دقیق نظر ہے جو کشف (الکشف) عطا کرتا ہے کہ کیا وجود (الوجود) میں تمام صورتوں میں حاملین کے لیے نئی تخلیق (الخلق الجديد) ہے یا نہیں، جس میں بعض لوگ شک میں ہیں۔ پس جس نے تجدید کو دیکھا، اس نے کہا کہ ہر نوع کے اشخاص کبھی ختم نہیں ہوں گے۔ اور جس نے کہا کہ تجدید نہیں ہے، اس نے آخرت میں کہا کہ اس نوعِ انسانی کے اشخاص ختم ہو چکے ہیں، پس اس کے بعد کوئی انسان وجود میں نہیں آئے گا۔ اور یہ ایک دقیق مسئلہ ہے جس پر ہم مکمل طور پر بات نہیں کر سکتے، کیونکہ یہ ان اسرار میں سے ہے جو صرف ان کے اہل کے لیے ہی ظاہر کیے جاتے ہیں۔ کیونکہ یہ ان علوم میں سے ہے جو صرف اہل روائح (باطنی حس رکھنے والوں) کے لیے بیان کیے جاتے ہیں، اور جس میں سونگھنے کی حس نہیں ہے، وہ ان کی حقیقت کے بارے میں خبروں کو قبول نہیں کرتا۔ اور اس میں اس چیز کا علم ہے جو عطا کی جاتی ہے اور جو عطا نہیں کی جاتی۔ اور اس میں اس سعادت کا علم ہے کہ وہ جہالت میں ہے، کیونکہ علم عالم میں جب کسی چیز کو جان لیتا ہے تو اس پر اکتفا کرتا ہے اور دوسرا علم طلب کرنے لگتا ہے، کیونکہ حاصل شدہ چیز کی طلب نہیں کی جاتی۔ پس جب وہ کہتا ہے کہ میں نے فلاں چیز کو جان لیا، تو حصول کے بعد نفس کا اس کی طرف متوجہ ہونا محال ہے۔ پس کوئی بھی اللہ کو کبھی نہیں جانتا، کیونکہ یہ اس کے علم کے لحاظ سے اس سے بے نیازی کی طرف لے جائے گا۔ اگر تم کہو کہ بلکہ اس کا علم اسے اس سے بے نیاز نہیں کرتا، تو ہم تمہیں کہیں گے کہ یہ اس کا علم نہیں ہے، بلکہ جو علم تم نے ذکر کیا ہے وہ اس بات کا علم ہے کہ وہ اس سے بے نیاز نہیں ہو سکتا، اور اس کا علم جو ہم نے مراد لیا ہے وہ ایک اور امر ہے۔ پس تم حکم کے عالم ہو، نہ کہ اس کے۔ پس تمہارے اعتراض اور ہمارے قول کے درمیان کوئی تعارض نہیں ہے۔ پس سمجھو! اور اس میں عالم کے بعض کا بعض کے ذریعے آزمائے جانے کا علم ہے، کیا یہ عالم پر رحمت کے باب سے ہے یا شقاوت کے باب سے۔ اور اس میں ان رکاوٹوں کا علم ہے جنہوں نے اللہ کی طرف سے آنے والی چیز کو قبول کرنے سے روکا، باوجود اس کے کہ نفوس اجنبی چیز کو دیکھ کر اور اسے قبول کرنے کے لیے متوجہ ہونے کی خواہش رکھتی ہیں۔ کیونکہ شریعت کی رحمت کو صرف علماء ہی خاص طور پر سمجھتے ہیں، اسی لیے کوئی عالم اسے رد نہیں کرتا جب وہ اسے دیکھتا ہے۔ اور اسی لیے ہمیں اس پر ایمان لانے کا حکم دیا گیا ہے، اگرچہ وہ منسوخ ہو چکی ہو اور اس کا حکم اٹھا لیا گیا ہو، اور اس پر عمل کرنا ہم پر حرام ہو گیا ہو۔ اور اس میں علم کے فائدے کا علم ہے۔ اور اس میں اس چیز کا علم ہے جسے تم کوئی چیز دیکھتے ہو، حالانکہ وہ کوئی چیز نہیں ہے، اور وہ چیز ہے کیونکہ تم نے اسے چیز دیکھا۔ اس کی مثال سراب ہے، جسے تم پانی دیکھتے ہو، اور آل (سراب میں انسان کا عکس) جو سراب میں انسان کا شخص ہے، وہ بڑا دکھائی دیتا ہے، پس اس کی عظمت میں کوئی شک نہیں ہوتا۔ پس جب تم اس کے پاس آتے ہو تو اسے ویسا نہیں پاتے جیسا تم نے دیکھا تھا، اور تم اس چیز میں شک نہیں کرتے جو تم نے دیکھا تھا۔ اور تمہارے علاوہ کوئی اور جو اس فاصلے پر ہے جہاں تم نے اسے عظیم دیکھا تھا، وہ اسے عظیم دیکھتا ہے، اور جب تم اس کے پاس آئے تو تم اسے عظیم نہیں دیکھتے۔ اور یہ ایک شریف الٰہی علم ہے۔ اور اس میں دو ضدوں کے درمیان فضیلت کا علم ہے، جیسے سیاہی اور سفیدی کے درمیان فضیلت، اور یہ اس لیے کہ رنگ نے ان دونوں کو جمع کیا، پس فضیلت واقع ہوئی۔ پس وجود (الوجود) میں ہر فضیلت میں ایک جامع کا ہونا ضروری ہے جو ان دونوں کو جمع کرے، یعنی جس میں وجود (الوجود) میں موجود تمام چیزیں جمع ہوں۔ اور اسی لیے باطنیہ باری تعالیٰ کے بارے میں بھاگ گئے جب ان سے کہا گیا کہ وہ موجود ہے، معدوم نہیں ہے، اور انہیں معلوم نہیں تھا کہ وہ اسی چیز میں پڑ گئے جس سے وہ بھاگے تھے۔ کیونکہ موجود حادث پر جس طرح موجود کا لفظ بولا جاتا ہے، اسی طرح اس پر لیس بمعدوم (معدوم نہیں ہے) کا نام بھی بولا جاتا ہے۔ پس اس میں شرکت واقع ہوئی کہ وہ معدوم نہیں ہے۔ اور اسی طرح ہر وہ چیز جس کے بارے میں باطنی سے سوال کیا جاتا ہے۔ اور اسی لیے وہ حقائق سے سب سے زیادہ جاہل تھے۔ اور اس میں بادل (الغمام) کا علم ہے، اور یہ غم (الغم) سے ہے۔ اور حق (الحق) کا قیامت کے دن اس میں آنا، یا فرشتے، یا حق اور فرشتے، پس یہ غم سے کیا عطا کرتا ہے۔ اور اس میں اس بات کا علم ہے کہ حق (الحق) کب ملکیت میں منفرد ہوتا ہے، یا وہ ہمیشہ سے منفرد ہے، لیکن وہ ایک مقام پر مجہول رہا اور ایک مقام پر پہچانا گیا، اور وہ وہی ہے، کوئی اور نہیں۔ کیونکہ وہ تعالیٰ حقیقت میں بادشاہ ہے، اور مخلوق جعل (بنائے جانے) سے بادشاہ ہے۔ اللہ تعالیٰ فرماتا ہے: وَجَعَلَكُمْ مُلُوكًا (المائدہ: 20) (اور تمہیں بادشاہ بنا دیا)۔ اور یہاں سے تم جانتے ہو کہ ملک الملک (بادشاہت کا بادشاہ) کون ہے۔ اور اس میں اس ظلم کا علم ہے جو شرائع لائی ہیں اور اس کا اثر کیا ہے، اور اس ظلم کا علم جو عقل دیتی ہے اور اس کا اثر کیا ہے، اور محمود اور مذموم ظلم کا علم ہے۔ اور اس میں انسانوں کے شیاطین اور جنوں کے شیاطین کے درمیان فرق کا علم ہے، اور کس کے ساتھ صحبت رکھنی چاہیے اور کس کے ساتھ اس نوعِ انسانی میں بالکل صحبت نہیں رکھنی چاہیے۔ اور اس میں اللہ کی طرف بلانے والوں کا اللہ کی طرف پناہ لینا کا علم ہے جب ان کی دعوت نہ سنی جائے، خواہ وہ رسول ہو یا وارث۔ اور اس میں اس بات کا علم ہے کہ حق (الحق) نے ہر چیز کے لیے ضد (الضد) بنائی ہے۔ اور اس میں دو ضدوں میں سے ایک کا محبت الٰہیہ کے ساتھ خاص ہونا اور دوسرے کا بغض الٰہیہ کے ساتھ خاص ہونا، اور کیا وہ ایک ہی ہستی (عین) سے صادر ہوتے ہیں یا حکم میں مختلف دو ہاتھوں سے۔ اور اس میں نوازل کے پیدا ہونے سے احکام کے پیدا ہونے کا علم ہے، اور یہ کہ شریعت منقطع نہیں ہوئی اور نہ ہوگی جب تک اللہ زمین اور اس پر موجود ہر چیز کا وارث نہ ہو جائے، اگرچہ نبوت منقطع ہو گئی ہو، لیکن جب تک عالم میں مجتہد موجود ہے، شریعت منقطع نہیں ہوئی۔ اور اس میں اکوان (کائنات) کے لیے الٰہی مشابہت (المضاهاة الإلهية) کا علم ہے، کیا یہ اکوان کی قدر کی بلندی کی وجہ سے ہے یا کسی اور امر کی وجہ سے، جیسے اللہ تعالیٰ کا قول: وَلَا يَأْتُونَكَ بِمَثَلٍ إِلَّا جِئْنَاكَ بِالْحَقِّ وَأَحْسَنَ تَفْسِيرًا (الفرقان: 33) (اور وہ تمہارے پاس کوئی مثال نہیں لاتے مگر ہم تمہارے پاس حق اور بہترین تفسیر لے آتے ہیں)۔ اور اس میں ان انسانوں کا علم ہے جو اپنے پیٹ کے بل چلتے ہیں، اور وہ کس صورت میں حشر کیے جائیں گے جو ان کی یہ چال ہے۔ اور اس میں اس شخص کا علم ہے جس نے اپنے آپ کو ادنیٰ کے ساتھ روکے رکھا، باوجود اس کے کہ وہ اعلیٰ کو جانتا تھا، اور اعلیٰ اسے اپنی طرف بلا رہا تھا اور ادنیٰ اسے اپنی طرف نہیں بلا رہا تھا، تو اسے ادنیٰ کی طرف کون بلا رہا ہے کہ وہ اپنے آپ کو اس پر روکے رکھے؟ اور اس میں اس علم کا علم ہے جو انسان، کوئی بھی انسان ہو، اپنے نفس کے علم سے زیادہ کسی اور کے علم میں تجاوز کرتا ہے۔ اور اس میں کیفیات کے شہود (الشہود) کا علم ہے، اور ہمارے نزدیک کیفیت کے ساتھ موصوف کون ہے۔ اور اس میں انسان کامل (الإنسان الکامل) کا اپنے رب کے ساتھ الحاق کا علم ہے، اور جب انسان بالفعل اپنے رب کی صورت میں ظاہر ہوتا ہے تو مقام پر الٰہی غیرت (الغیرۃ الإلهية) کا علم ہے، اور یہ کہ کسی چیز کا بالفعل حکم دینا اس کے خلاف دیتا ہے جو وہ بالقوہ دیتا ہے، پس بالفعل عطا کرنا زیادہ قوی ہے۔ اور اس میں ظہور، خفا اور راحت کا علم ہے۔ اور اس میں عالم میں رحمت کے ذریعے ظاہر ہونے والے سانسوں کا علم ہے، اور اس کا سبب کیا ہے، اور مخلوق کا ان سانسوں میں عام طور پر داخل ہونا۔ اور اس میں اس چیز کا علم ہے جسے حق (الحق) ظاہر کرنا چاہتا ہے اور مخالف انسان اسے چھپانا چاہتا ہے، اور وہ وہی ہے جو وجود (الوجود) میں واقع ہونے والی چیز کے علاوہ میں مصلحت دیکھتا ہے۔ اور اس مقام کے مالک کو شرعی میزانوں کی وجہ سے تیز نظر کی ضرورت ہے، کیونکہ ان مصالح سے جہالت جنہیں حق (الحق) دیکھتا ہے، ان ظاہری مصالح کے علم سے زیادہ ہے جو کائنات میں ظاہر ہوتی ہیں کہ وہ عقلمندوں کے نزدیک عقلی نظر میں مصالح نہیں ہیں۔ اور یہ ایک دقیق علم ہے، اگر انسان کشف (الکشف) اور تحقیق کے ذریعے اس پر عمل کرے تو کبھی غلطی نہیں کرے گا، اور اگر وہ شخص اس پر عمل کرے جس میں یہ صفت نہیں ہے تو وہ غلطی کرے گا۔ اور اسی کو عام لوگ کہتے ہیں کہ سعید کی غلطی بھی درست ہوتی ہے، اور جو سعید نہیں ہے اس کی درستی بھی غلطی ہوتی ہے۔ اور میں نے یہ ملطیہ میں حطلحہ میں دیکھا اور اس نے مجھے یہ بالمشافہہ بتایا۔ اور اس میں اس امتزاج کا علم ہے جس میں فصل ممکن نہیں ہے، اور وہ ہر دو ضدیں ہیں جن کے درمیان کوئی واسطہ ہو، جیسے گرم اور ٹھنڈے کے درمیان نیم گرم، کوئی بھی اس نیم گرم میں حرارت کو ٹھنڈک سے جدا نہیں کر سکتا۔ اور اس میں اس شخص کے درمیان فرق کا علم ہے جو اللہ کے لیے ہے اور جو اللہ پر ہے۔ اور اس میں نیت کے ذریعے اللہ تک پہنچنے کے راستے کا علم ہے، اگرچہ وہ شرعی نہ ہو، پھر بھی وہ ہر لحاظ سے فائدہ مند ہے، کیونکہ اس نے صرف اللہ کا قصد کیا ہے۔ اور ظہور الٰہی (التجلی الإلهي) کا عام ہونا معلوم ہے، پس بندے کے لیے اس میں مشیت ہے۔ اور اس میں اس علم کا علم ہے جو اسم الرحمن کے ساتھ خاص ہے، نہ کہ دوسرے اسماء الٰہیہ کے ساتھ، اور اسم الرحمن کے ساتھ کیسا معاملہ کرنا چاہیے، نہ کہ دوسرے اسماء الٰہیہ کے ساتھ۔ اور اس میں اس چیز کا علم ہے جسے کوئی چیز کہا جاتا ہے، وہ کیا ہے۔ اور اس میں تناوب (باری باری آنا) کا علم ہے، اور یہ کہ باری باری آنے والے جمع نہیں ہوتے، اور ان دونوں سے عالمِ انسان میں کیا پیدا ہوتا ہے۔ اور اس میں ٹھہراؤ اور سکون کا علم ہے، اور وہ کہاں قابل تعریف ہیں۔ اور اس میں عقلی اور شرعی لحاظ سے نیک بختوں کی صفات کا علم ہے۔ اور اس میں ان صفات کا علم ہے جو تبدیلی کو قبول کرتی ہیں اور جو قبول نہیں کرتیں، اور کس سے قبول نہیں کرتیں۔ اور اس میں اللہ تعالیٰ کی معرفت (المعرفۃ) رکھنے والے علماء میں محفوظین اور معصومین کا علم ہے۔ اور اس میں اس چیز کا علم ہے جو مومن سے ذکر (نصیحت) پیدا کرتی ہے۔ اور اس میں اس شخص کا علم ہے جس نے امامت طلب کی اور اس پر مدد کی گئی۔ اور اس میں اللہ کی طرف بلانے والوں کی عنایت اور اللہ کے نزدیک ان کے مقام کے شرف کا علم ہے۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (الاحزاب: 4) (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و پنجاه و نهم در معرفت منزل «إياك أعني فاسمعي يا جارة» (تو را می‌گویم، پس بشنو ای همسایه) و آن منزل تفریق امر و صورت کتمان در کشف (الکشف) از حضرت محمدیه (الحقیقة المحمدیة) است.\n\nبنگر به نقص سایه شخص در آن هنگام *** که خورشید بالا می‌آید و سایه‌اش را در خود فانی می‌کند\nآن دلیل بر حرکت دائمی اوست *** در آغاز و بازگشت، و این مقدار او را بس است\nاگر لحظه‌ای سکون می‌یافت، اثری *** در هستی (الکون) از «کُن» (باش) پدیدار نمی‌شد، و آن حکم از اوست\nپس هستی (الکون) از نَفَس رحمان است و اصلی *** جز او ندارد، و حکم قول آن را آشکار می‌سازد\nبر خلاف آنچه عقل اقتضا می‌کند، پس آن را دور انداز *** زیرا حکمت شریعت الهی آن را حکم می‌کند\nمن برای آن نه عین دیدم و نه اثری *** و اگر می‌بود، عقل آن را پنهان می‌ساخت\n\n[همانا خداوند هیچ چیزی را نیافرید مگر آنکه برایش ضد، مَثَل و خلاف آفرید]\n\nبدان، خداوند تو را با روحی از جانب خود تأیید کند، هنگامی که خداوند اشیاء را بر اساس حکمی آفرید که هستی (الوجود) اصلی که او بر آن است و از آن اوست، اقتضا می‌کرد، هر آنچه غیر از خداوند متعال است، موجود شد. پس هیچ چیزی را نیافرید مگر آنکه برایش ضد، مَثَل و خلاف آفرید. پس موافقت را در خلاف، منافرت (دوری) را در ضد، و مناسبت را در مَثَل قرار داد. شدیدترین چیزها از نظر پیوستگی، محبت و اتحاد، خلاف با مخالف خود است. به همین دلیل، خلاف به حسب کسی است که با او مخالفت می‌کند و جز به حکم خود از صاحبش متمایز نمی‌شود. پس دو خلاف در محل متحد می‌شوند و در حکم متمایز می‌گردند. اما مَثَل با مَثَلش، مناسبت، آن دو را در دوستی گرد هم می‌آورد، پس هر مَثَلی، مَثَل خود را به واسطه مناسبت مِثلیت دوست می‌دارد، حتی اگر با هم جمع نشوند. پس مَثَل در محبت شبیه خلاف است، هرچند که میان آن دو به لحاظ حقایقشان تفاوت‌هایی وجود دارد؛ و شبیه ضد است از این جهت که هرگز با هم جمع نمی‌شوند. پس آن دو مانند غایبی هستند که غایبی دیگر را دوست داشته و عاشقانه شیفته او شده است، اما موانع حکم کرده‌اند که با هم جمع نشوند. اما ضد با ضدش، منافرت میان آن دو ذاتی است و آن دوستی که میان دو خلاف است، میانشان نیست. هر یک از دو ضد می‌خواهد که عین ضدش از هستی (الوجود) زائل شود، بر خلاف دو خلاف؛ زیرا دوستی میان آن دو مانع از آن می‌شود که هر یک از آن‌ها زوال عین خلافش را از هستی (الوجود) بخواهد، بلکه می‌خواهد و آرزو دارد که اگر امکان اتحاد با او باشد، تا مشاهده جز بر یک عین خاص واقع نشود و دیگری در آن پنهان گردد، این از باب ایثار هر خلاف بر نفس خود برای خلافش است، اما آن دو هرگز به ذات خود جمع نمی‌شوند. مثال دو مَثَل، دو سفیدی است؛ مثال دو ضد، سفیدی و سیاهی است؛ و مثال دو خلاف، رنگ و بو یا طعم در یک محل واحد است. مقصود از آنچه ذکر کردیم، شناساندن نسبت بنده به خداوند است، که چه نسبتی از این نسبت‌ها را داراست.\n\n[همانا انسان جامع اضداد است]\n\nپس بدان که انسان کامل (الإنسان الکامل) به ذات خود همه این امور را جمع کرده است و این برای غیر او نیست. پس او با حق (الحق) مَثَل، ضد و خلاف است؛ همان‌طور که آنچه ذکر کردیم نیز این حکم را بر هر یک از این سه دارد. زیرا سفیدی با سفیدی به واسطه محل مخالفت می‌کند، چرا که محل آن را متمایز می‌سازد و گفته می‌شود: این سفیدی، آن سفیدی نیست. و با مَثَل خود ضدیت دارد، زیرا محل واحدی آن دو را جمع نمی‌کند؛ و مَثَل آن است، زیرا حد و حقیقت از همه جهات شامل هر دو می‌شود. پس هر یک از آنچه ذکر کردیم، آنچه را دیگری می‌پذیرد، از مِثلیت، ضدیت و خلافیّت می‌پذیرد. و آنچه در این باب مورد نیاز است، معرفت انسان با قرینش از نوع انسان، اگر عام باشد، یا با غیرش از عالم، از حیث نسبتی خاص، و معرفت انسان با حق (الحق) است تا بداند صورت او از حق بر چه مبنایی است. زیرا خداوند نهایت توجه را به او مبذول داشته که به هیچ مخلوقی مبذول نداشته است، به این دلیل که او را خلیفه قرار داد و کمال را با علم اسماء به او بخشید و او را بر صورت الهی آفرید و کامل‌تر از صورت الهی را که ممکن است در هستی (الوجود) باشد، در او به کمال رساند. پس انسان کامل (الإنسان الکامل) از حیث صورت الهی مَثَل است؛ از حیث اینکه در حال بندگی، روا نیست که ربّ کسی باشد که بنده اوست، ضد است؛ و از حیث اینکه حق (الحق) گوش و چشم و قوای او شده است، خلاف است، پس او را اثبات کرد و خود را در یک عین واحد اثبات نمود. پس هر کس خود را شناخت، پروردگارش را با معرفت (المعرفة) مَثَل، ضد و خلاف شناخت. پس او ولیّ (دوست) و عدوّ (دشمن) است. خداوند متعال می‌فرماید: **«لا تَتَّخِذُوا عَدُوِّي وعَدُوَّكُمْ أَوْلِياءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ»** (دشمن من و دشمن خودتان را دوستان نگیرید که با آن‌ها اظهار دوستی می‌کنید) - مؤمنان را خطاب می‌کند - به دلیل اینکه آن‌ها مَثَل‌های شما هستند، به سبب ضدیت میان دو مَثَل. پس به مؤمن فرمود: با دشمن با ضدیت مَثَل رفتار کن، نه با مودت مَثَل، زیرا حقیقت شما یکی است، پس بفهم. زیرا دشمن می‌خواهد تو را از هستی (الوجود) خارج کند، همان‌طور که پیشتر در معرفت ضد بیان کردیم. و به همین دلیل خداوند متعال در این آیه فرمود: **«وقَدْ كَفَرُوا بِما جاءَكُمْ من الْحَقِّ يُخْرِجُونَ الرَّسُولَ وإِيَّاكُمْ»** (و حال آنکه به حقّی که برای شما آمده کافر شده‌اند، پیامبر و شما را بیرون می‌کنند). پس دشمن با شما، هرچند مَثَل شما باشد، جز با ضدیت مَثَل رفتار نکرده است، نه با مودت آن. و این عین همان چیزی است که ذکر کردیم که ضد می‌خواهد ذهاب عین ضدش از هستی (الوجود) باشد. پس به ما امر شد که اگر آن‌ها چنین قصدی نسبت به ما داشتند، با آن‌ها بجنگیم و اعیانشان را از موضعی که در آن هستند زائل کنیم و با کشتن، آن‌ها را به برزخ منتقل سازیم. پس بنگر که قرآن چقدر شگفت‌انگیز است و چه علمی از امور به پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) عطا شده است. و اگر این ضدیت در ذات مَثَل جریان نیابد، او مؤمن نیست و نزد خداوند جایگاهی ندارد. اما نیاز به میزان و کشف (الکشف) صحیح است تا دشمن ذاتی که باید با او چنین رفتاری شود، از دشمن عَرَضی که این عداوت برایش عارض شده و سپس با زوال آن عارض که موجبش بوده، از بین می‌رود، شناخته شود. همان‌طور که خداوند متعال از قول برخی بندگان در روز قیامت خبر می‌دهد که می‌گویند: **«يا لَيْتَنِي اتَّخَذْتُ مَعَ الرَّسُولِ سَبِيلًا يا وَيْلَتى‏ لَيْتَنِي لَمْ أَتَّخِذْ فُلاناً خَلِيلًا لَقَدْ أَضَلَّنِي عَنِ الذِّكْرِ بَعْدَ إِذْ جاءَنِي وكانَ الشَّيْطانُ»** (ای کاش راهی را با پیامبر برمی‌گزیدم. ای وای بر من، کاش فلانی را دوست نمی‌گرفتم. او مرا از ذکر گمراه کرد پس از آنکه به من رسید) - یعنی شیطان انس، نه شیطان جن - **«لِلْإِنْسانِ خَذُولًا»** (برای انسان بسیار خوارکننده است). زیرا او گفت: مرا از ذکر گمراه نکرد مگر فلانی، و او را انسانی مانند خود نامید، چرا که به او گوش فرا داد و در گفتارش از او تقلید کرد و میان او و پیروی از آنچه خداوند به او امر کرده بود، یعنی آنچه رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آورده بود، حائل شد. و سبب آن، تحجیر (محدودیت) جدیدی بود که از جانب خداوند برایشان آمده بود، هرچند که در تحجیر بودند، زیرا برای مصالح عالم چاره‌ای از آن نیست، اما آن‌ها به آن عادت کرده و بر آن نشو و نما یافته بودند و غیر آن را نمی‌شناختند. پس آن‌ها تحجیر را انکار نکردند، بلکه این تحجیر خاص را انکار کردند. و مفارقت از مأنوس طبع دشوار است. به همین دلیل، طبع به درد عادت نمی‌کند، حتی اگر طولانی شود، بلکه با زوال آن شاد می‌شود، به دلیل عدم الفت طبع با آن. اگر به آن الفت می‌گرفت، با زوالش متألم می‌شد. و چون ممکن نبود که هر انسانی مرتبه کمال مطلوب در انسانیت را داشته باشد، هرچند برخی بر برخی دیگر برتری دارند، پس پایین‌ترین منزلت از آن کسی است که انسان حیوانی است و بالاترین آن‌ها کسی است که ظلّ (سایه) خداوند است و او انسان کامل (الإنسان الکامل) و نایب حق (الحق) است که حق (الحق) زبان و تمام قوای او می‌شود. و میان این دو مقام، مراتبی وجود دارد. در زمان رسولان، کامل، رسول است؛ و در زمان انقطاع رسالت، کامل، وارث است. و وارث با وجود رسول ظهوری ندارد، زیرا وارث جز پس از مرگ کسی که از او ارث می‌برد، وارث نمی‌شود. پس برای صحابی با وجود رسول ممکن نبود که این مرتبه را داشته باشد. پس امر به طور دائم از جانب خداوند نازل می‌شود و قطع نمی‌گردد، و آن را جز رسولان به طور خاص و کامل نمی‌پذیرند. پس هنگامی که آن‌ها نباشند، آن استعداد در غیر رسولان یافت می‌شود و آن تنزل الهی را در قلب‌های خود می‌پذیرند و وارث نامیده می‌شوند، هرچند نام رسول بر آن‌ها اطلاق نمی‌شود، با وجود اینکه از جانب خداوند به واسطه تنزل الهی خبر می‌دهند. اگر در آن تنزل الهی حکمی باشد، این منزل‌گیرنده آن را می‌گیرد و به آن حکم می‌کند، و این همان است که در زبان علمای رسوم به مجتهد تعبیر می‌شود که حکم را نزد آن‌ها استنباط می‌کند، و او عالم به قول خداوند است: **«لَعَلِمَهُ الَّذِينَ يَسْتَنْبِطُونَهُ مِنْهُمْ»** (هر آینه کسانی که آن را استنباط می‌کنند، آن را می‌دانستند). پس این سهم مردم امروز از تشریع پس از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) است و ما به آن قائل هستیم، اما نمی‌گوییم که اجتهاد همان است که علمای رسوم ذکر کرده‌اند، بلکه اجتهاد نزد ما بذل وسع در تحصیل استعداد باطنی است که به واسطه آن این تنزل خاص پذیرفته می‌شود، تنزلی که در زمان نبوت و رسالت جز نبی یا رسول آن را نمی‌پذیرد. با این حال، راهی برای مخالفت با حکم ثابتی که از رسول (صَلَّى اللهُ عَليهِ وسَلَّم) در نفس‌الامر (واقعیت امر) مقرر شده است، وجود ندارد. اگر آن حکم در نفس‌الامر نباشد، به این مجتهدی که ذکر کردیم، جز آنچه حکم بر او در نفس‌الامر است، القا نمی‌شود، تا جایی که اگر رسول (صَلَّى اللهُ عَليهِ وسَلَّم) زنده بود، به آن حکم می‌کرد. با وجود این، حکم مجتهد را تأیید کرد، حتی اگر خطا کند. پس مجتهد خطا نکرده است مگر در استعداد، همان‌طور که ذکر کردیم. اگر در استعداد به صواب می‌رسید، هرگز مجتهدی خطا نمی‌کرد، بلکه او در حکم مجتهد نیست، بلکه ناقل چیزی است که از حق (الحق) نازل شده بر او در تجلی‌اش (التجلی) پذیرفته است. و این در امت نادر است و جز در افراد یافت نمی‌شود. و نشانه آن‌ها این است که به دلیل وحدانیت رسالت در این زمان، اصلاً در حکم اختلاف نمی‌کنند. اگر اختلاف کردند، آن‌ها کسانی نیستند که ما ذکر کردیم. پس اگر احکام منحصر به تقسیم باشد، صاحب حق (الحق) یکی از آن‌ها خواهد بود. اگر بخشی باقی بماند که حکمی بر آن واقع نشده باشد، شاید حق (الحق) در آن باشد. با این حال، هر یک به آنچه دلیلش به او داده، تعبد می‌کند. اگر به صواب رسد، دو پاداش دارد و اگر خطا کند، یک پاداش دارد. پس اجتهاد در اجتهاد واقع شد. و چون مقرر شد که تنزل الهی قطع نشده و بر انواع مختلف است و همه آن‌ها علم هستند، چه تنزل حکم شرعی باشد یا غیر آن، به حسب مواطن است. آیا نمی‌بینی که موطن آخرت در بهشت، تنزل در آن دائمی است، اما حکم تحجیر (محدودیت) به طور کلی در آن نیست، بر خلاف تنزل آن در دنیا؟ پس منظور من حکم مواطن است و همه آن‌ها تعریف الهی هستند. و چون در انسان کامل (الإنسان الکامل) مَثَل، ضد و خلاف وجود دارد، همان‌طور که در اسماء الهی نیز هست: مَثَل مانند الرحمن و الرحیم؛ خلاف مانند الرحمن و الصبور؛ و ضد مانند الضار و النافع.\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) که همت‌های ما را به مراتب عالی بالا می‌برد، فرمود: «اگر قرار بود دوستی (خلیل) برگزینم، ابوبکر را برمی‌گزیدم، اما صاحب شما خلیل الله است!»\nو خداوند می‌فرماید: **«واتَّخَذَ الله إِبْراهِيمَ خَلِيلًا»** (و خداوند ابراهیم را به دوستی (خلیل) گرفت). و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) به پروردگارش فرمود: «تو در سفر، همراه (صاحب) هستی.»\n\nپس اگر دانستی که دوستی (خُلّه) بندگان بر خداوند محال نیست، بکوش تا تو آن خلیل باشی، به این صورت که بنگری چه چیزی به تحصیل این دوستی شریف می‌انجامد. پس برای آن سببی جز موافقت نمی‌یابی. و ما علم به موافقت خود با حق (الحق) نداریم مگر به موافقت با شریعت او. پس آنچه را حرام کرد، حرام دانستیم؛ آنچه را حلال کرد، حلال دانستیم؛ آنچه را مباح کرد، مباح دانستیم؛ آنچه را مکروه داشت، مکروه دانستیم؛ آنچه را مستحب دانست، مستحب دانستیم؛ و آنچه را واجب کرد، واجب دانستیم. پس اگر این در نفس تو فراگیر شد و این صفت تو بود و در آن مقام حق (الحق) ایستادی، دوستی (الخُلّة) برای تو صحیح می‌شود، بلکه محبتی که بزرگ‌تر و خاص‌تر از دوستی است، زیرا خلیل (دوست) به خاطر تو با تو همراه می‌شود، اما حبیب (محبوب) به خاطر خودش با تو همراه می‌شود. پس چه تفاوتی است میان دوستی و محبت! من تو را به تحصیل این دو مقام راهنمایی کردم. خلیل به خلیلش تکیه می‌کند، اما حبیب در محبوبش پنهان می‌شود و او را با جان خود حفظ می‌کند. پس حق (الحق) سپر محبوب است و خلیل سپر خلیلش. آیا نمی‌بینی آنچه را خداوند در نفوس عالم جاری ساخته است، آنجا که نان و نمک را سببی قرار می‌دهند که هر یک از دو شخصی که میانشان نمک‌خوردن (ممالحه) واقع شده است، فدای صاحبش باشد و او را از هر بدی حفظ کند و او را مانند حفظ خود حفظ نماید؟ و امر در عین آن نیز چنین است. و چون ما حق (الحق) را مشاهده عین کردیم و نمک‌خوردن واقع شد و اثر آن را به حمد خدا برهانی قاطع دیدم، در این باره گفتم:\n\nنان و نمک خواهم خورد *** تا برهان و فتح (گشایش) را ببینم\nو به امری بنگرم که آشکار شده *** در لوح ثابت می‌شود و محو نمی‌گردد\nو جنگ را به خاطر دشمنان می‌طلبم *** نه صلح و آشتی را\nپس اگر امر از جانب او به من رسد *** امری که کشف (الکشف) و شرح را به من بنمایاند\nنفس خود را در طلب علو ملزم ساختم *** که نیکی و نصیحت را ترجیح دهد\nو به بناکننده گفتم: آیا برای من بنا نمی‌کنی *** از عمل ارواح، برایم قصری؟\nباشد که بلقیس را ببینم آنگاه که دامن بالا زد *** چون قصر را دید\nگمان کرد که آن گرداب است *** پس از تخت خود روی برگرداند\nهنگامی که خود را دید، نشناخت *** نه پوششی، نه کشفی (الکشف) و نه اشاره‌ای را\n\nپس نان و نمک به او این را عطا کرد که دشمن خدا را نه محبوب بگیرد و نه دوست. و چون خداوند آنچه را که انسان در سرشت خود بر آن است، از دوست داشتن نیکوکار به خاطر نیکوکاری‌اش و جلب دوستی از هم‌نوعانش با اظهار مودت به آن‌ها، می‌دانست، دانست که اگر به آن‌ها بگوید: **«لا تَتَّخِذُوا عَدُوِّي»** (دشمن من را دوست نگیرید)، آن‌ها به دلیل آنچه ذکر کردیم، در این نهی در جانب حق (الحق) به مقامی که حق (الحق) سزاوار آن است، عمل نمی‌کنند. پس در خطاب افزود و فرمود: **«وعَدُوَّكُمْ»** (و دشمن خودتان را)، و این برای آن است که آن‌ها را نزد ما مبغوض سازد، زیرا می‌دانست که ما خودمان را دوست داریم و هوای نفس خود را بر او تعالی ترجیح می‌دهیم. پس در قرآن ذمّی از جانب خداوند در حق ما بزرگ‌تر از این نیست. زیرا اگر می‌دانست که ما او را بر هوای نفس خود ترجیح می‌دهیم، به قولش **«عَدُوِّي»** اکتفا می‌کرد. سپس به یک نسق ادامه داد و فرمود: **«يُخْرِجُونَ الرَّسُولَ»** (پیامبر را بیرون می‌کنند)، یعنی از موطن او. زیرا مفارقت از اوطان از دشوارترین اموری است که بر انسان می‌گذرد. پس چون خداوند دانست که بیرون کردن رسول (صَلَّى اللهُ عَليهِ وسَلَّم) در حالی که شما در اوطان خود باقی هستید، نزد شما به مقامی که رسول از شما سزاوار آن است، عمل نمی‌شود، فرمود: **«وإِيَّاكُمْ»** (و شما را نیز)، پس شما را در بیرون شدن با رسول شریک ساخت، همان‌طور که شما را در عداوت با خداوند شریک ساخت، تا حریص‌تر باشید بر اینکه به آن‌ها اظهار مودت نکنید و آن‌ها را دشمن بگیرید. و مؤمنان در اینجا هر کسی غیر از رسول است. زیرا رسول هنگامی که برایش روشن شود که شخصی دشمن خداست، از او بیزاری می‌جوید. خداوند متعال در حق ابراهیم و پدرش آزر، پس از آنکه او را موعظه کرد و شفقت خود را بر او آشکار ساخت، به دلیل اینکه نزد او در حد امکان بود که از شرک خود به سوی خداوند و توحید او بازگردد، فرمود: پس هنگامی که خداوند در وحی خود برای او بیان کرد و امر پدرش را بر او کشف (الکشف) نمود و برای ابراهیم روشن شد که پدرش آزر دشمن خداست، با وجود اینکه پدرش بود، از او بیزاری جست. پس خداوند او را ستود و فرمود: **«فَلَمَّا تَبَيَّنَ لَهُ أَنَّهُ عَدُوٌّ لِلَّهِ تَبَرَّأَ مِنْهُ»** (پس هنگامی که برای او روشن شد که او دشمن خداست، از او بیزاری جست). و ابراهیم در حق پدرش بسیار آه کشنده و بردبار بود، نه اکنون. و در خبر آمده است که ابراهیم پدرش را در روز قیامت در صورتی شبیه کفتار میان پاهای خود می‌یابد، پس او را با دست می‌گیرد و به آتش می‌اندازد. پس بنگر که ایثار خلیل (ابراهیم) برای جناب حق (الحق)، چه تأثیری در دشمنی با پدرش در راه خداوند متعال گذاشت. پس خداوند ما را از کسانی قرار دهد که حق (الحق) را بر هوای نفس خود ترجیح دادند و این را آرزوی خود قرار دهند. پس چقدر نزد من حسرت بزرگ است که ما در نزد خداوند به این مرتبه نبودیم تا به ذکر عداوت آن‌ها با خداوند و بیرون کردن رسول اکتفا کنیم. پس در اینجا باید اشک‌ها ریخته شود. خوشبخت کسی است که این را در نفس خود یافت و زیر این خطاب قرار نگرفت. و به هر اندازه که از این حال در تو نقص باشد، به همان اندازه از معرفت (المعرفة) به خداوند در تو نقص است. و از زمانی که خداوند این راه را بر من گشود، کسی را بر این قدم نیافتم که او را به آن بشناسم، هرچند که در نفس‌الامر بر آن باشد، اما خداوند او را به من نشناسانده است. و چه بسا که آن را به او عرضه کردم، اما نزد او جز نقیض آن را نیافتم. اما می‌دانم که در زمین بندگانی هستند که این مقام را دارند. پس حمد خدایی را که آن را بر من گشود و امیدواریم ان‌شاءالله بر آن باقی بمانیم. زیرا بیشتر ابواب معرفت (المعرفة) به خداوند میان این مقام و مؤمنان و علما حائل می‌شوند. پس این مقامی است غامض و دشوارالتصور که معارف الهی بسیاری در آن قدح می‌زند. و اگر این مقام به صورت ذوقی برای کسی حاصل نشود...\n\n[همانا میان خداوند و کسی که دشمن خداست، مناسبتی وجود دارد]\n\nپس بدان که میان او و کسی که دشمن خداست، مناسبتی وجود دارد. و به دلیل آن مناسبت، هنگامی که امر برایش روشن شود، از او بیزاری نمی‌جوید، زیرا قبل از روشن شدن، معذور است. خداوند متعال می‌فرماید: **«ما كانَ لِلنَّبِيِّ والَّذِينَ آمَنُوا أَنْ يَسْتَغْفِرُوا لِلْمُشْرِكِينَ ولَوْ كانُوا أُولِي قُرْبى‏ من بَعْدِ ما تَبَيَّنَ لَهُمْ أَنَّهُمْ أَصْحابُ الْجَحِيمِ»** (برای پیامبر و کسانی که ایمان آورده‌اند، سزاوار نیست که برای مشرکان طلب آمرزش کنند، هرچند خویشاوند نزدیکشان باشند، پس از آنکه برایشان روشن شد که آن‌ها اهل دوزخند). و فرمود: **«ما كانَ لِأَهْلِ الْمَدِينَةِ ومن حَوْلَهُمْ من الْأَعْرابِ أَنْ يَتَخَلَّفُوا عَنْ رَسُولِ الله ولا يَرْغَبُوا بِأَنْفُسِهِمْ عَنْ نَفْسِهِ»** (برای اهل مدینه و بادیه‌نشینان اطرافشان سزاوار نبود که از رسول خدا تخلف کنند و جان خود را بر جان او ترجیح دهند). پس اهل دوزخ نیستند مگر دشمنان خداوند متعال که اهل دوزخند.\n\nپس با حق (الحق) باش و جایگزینی برای او مخواه *** و حق (الحق) را یگانه دان و برای او مَثَلی قرار مده\n\nو خداوند ولیّ یاری و توفیق است. و بدان که این منزل شامل علم فزونی خیر است، و در آن علم تمایز حق (الحق) از باطل و حدود جداکننده اشیاء از یکدیگر وجود دارد. و در آن علم بندگان کنایات است، نه بندگان اسماء، و مراتب میان آن دو در رفعت و شرف، و اینکه کدام یک در بندگی پیوستگی شدیدتری دارد، آیا بنده کنایه یا بنده اسم. و در آن علم مربوط به تمام عالم از علوم وجود دارد. و در آن علم صفاتی است که حق (الحق) به آن‌ها اختصاص دارد، نه خلق او. و در آن علم تنزیه است که به چه چیزی بازمی‌گردد، آیا به هستی (الوجود) یا به عدم. و در آن علم موازین است. و در آن علم چیزی است که موجب اتخاذ شریک در عالم شده است. و هر مولودی بر فطرت متولد می‌شود، پس کفر اول از کجا آمده است، در حالی که پدر و مادرش او را یهودی یا نصرانی یا مشرک یا مجوسی می‌کنند؟ و آیا عقل در اینجا از حیث تفکرش، منزلت پدر و مادر را دارد در اینکه نظر او این شخص را از فطرتش به سوی اثبات شریک خارج کرده است؟ و در آن علم چیزی است که انسان به ذات خود مالک آن است و آنچه مالک آن نیست، و تصرف او در آنچه مالک آن نیست، چرا در آن تصرف کرده است؟ و در آن علم عاقبت گوینده دروغ و شاهد بر آن است، و اینکه حاکم به دلیل پیروی از هوای نفسش معصوم نیست، و چرا خداوند او را در ظاهر امر حاکم باقی گذاشته، در حالی که در باطن امر در آنچه به هوای نفسش حکم کرده، معزول است؟ و قول خداوند متعال: **«قالَ رَبِّ احْكُمْ بِالْحَقِّ»** (گفت: پروردگارا، به حق حکم کن). و در آن علم نشانه‌هایی است که صادق از کاذب شناخته می‌شود، و این‌ها از نشانه‌هایی هستند که قابل بیان نیستند، بلکه انسان اگر از اهل مراقبه احوال خود باشد، آن‌ها را در نفس خود می‌یابد و علم به آن از او فوت نمی‌شود. و کسی که مراقبه حال او نباشد، اصلاً آن نشانه‌ها را نمی‌شناسد. و مؤمنون به شناخت آن‌ها از اصحاب نظر سزاوارترند. و در آن علم مختص به شیوخ در این راه است که به واسطه آن حال مریدان شناخته می‌شود که چه زمانی شایسته مرید بودن هستند و شیخ باید با قبول افاده به آن‌ها روی آورد. و برای شیخ در این راه روا نیست که مرید را بر صورت آنچه با حصول معنای آن در نفسش، فتح (گشایش) و نیل به سعادت برای او حاصل می‌شود، آگاه سازد، تا مبادا به صورت در آن ظاهر شود و باطن از معنای موجب آن صورت عاری باشد. اگر بگویی: پس این نباید توسط شیخ از مرید پنهان شود، می‌گوییم: بلکه باید از مرید پنهان شود و این بر او واجب است، زیرا می‌داند که اگر معنای موجب ظهور آن صورت در مرید قیام کند، ظهور آن صورت را برای او واجب می‌سازد. پس شیخ در آن هنگام می‌داند که خداوند آن مرید را شایسته اهل حق (الحق) بودن کرده است. و اگر شیخ آن معنای موجب اظهار این صورت را به او اعلام کند، و نفس بر خیانت و عدم صدق سرشته شده است، با عدم معنا، به صورت ظاهر می‌شود و غلط واقع می‌گردد، همان‌طور که منافق به صورت مؤمن در عمل ظاهر می‌شود و باطن از موجب آن عمل عاری است. و در آن علم سبب تنگی در آتش (جهنم) است، با وجود وسعتی که در آن است. و در آن علم چیزی است که با مؤمن در بهشت قرین می‌شود و آنچه با مشرک در آتش قرین می‌شود، و فرق میان هستی (الوجود) و توحید. زیرا مشرک به هستی (الوجود) مؤمن است، اما موحد نیست. و عذاب در آتش را عدم توحید واجب کرده است، نه اثبات هستی (الوجود). پس از اینجا قرین مشرک را از قرین مؤمن می‌شناسی. و در آن علم ورود تمام ممکنات در هستی (الوجود) از حیث اجناس و انواعشان است، نه از حیث اشخاص و آحادشان، بلکه اشخاص برخی از آن‌ها، نه همه آن‌ها. و در اینجا نظری دقیق وجود دارد که کشف (الکشف) آن را می‌دهد: آیا خلق جدید در تمام صور در هستی (الوجود) برای حاملان آن‌ها که برخی مردم در اشتباه هستند، وجود دارد یا خیر؟ پس کسی که تجدید را می‌بیند، می‌گوید: اشخاص هر نوعی هرگز پایان نمی‌پذیرند. و کسی که تجدید را نمی‌بیند، می‌گوید: در آخرت اشخاص این نوع انسانی پایان یافته‌اند و پس از آن انسانی یافت نمی‌شود. و این مسئله‌ای دقیق است که نمی‌توانیم به طور کامل درباره آن سخن بگوییم، زیرا از جمله اسراری است که جز برای اهلش فاش نمی‌شود، چرا که از علومی است که جز برای اهل روایح (بوها) قابل بیان نیست و کسی که شَمّ (حس بویایی) ندارد، اخبار مربوط به حقیقت آن را نمی‌پذیرد. و در آن علم چیزی است که عطا می‌شود و چیزی که عطا نمی‌شود. و در آن علم این است که سعادت در نادان بودن چیست؟ زیرا علم در عالم این را می‌دهد که اگر کسی امری را دانست، به آن اکتفا کرده و به دنبال علم دیگری می‌رود، زیرا آنچه حاصل شده، طلب نمی‌شود. پس اگر گفت: فلان چیز را دانستم، محال است که نفس پس از حصول آن، مشتاق آن شود. پس هیچ کس خداوند را هرگز نمی‌شناسد، زیرا این شناخت منجر به بی‌نیازی از او می‌شود، از حیث علم به او. اگر بگویی: بلکه علم به او باعث می‌شود که از او بی‌نیاز نشود، به تو می‌گوییم: این علم به او نیست، بلکه علمی که ذکر کردی، علم به این است که از او بی‌نیاز نمی‌شود، و علم به او که ما قصد کردیم، امر دیگری است. پس تو عالم به حکم هستی، نه به او. پس تعارضی میان آنچه بر ما اعتراض کردی و آنچه گفتیم، نیست، پس بفهم. و در آن علم ابتلای عالم به یکدیگر است، آیا از باب رحمت به عالم است یا از باب شقاوت. و در آن علم موانعی است که از پذیرش آنچه از نزد خداوند آمده، جلوگیری کرده است، با وجود اشتیاق نفوس به دیدن غریب هنگام ورود و پذیرش آن. زیرا رحمت شریعت را جز علما به طور خاص درک نمی‌کنند و به همین دلیل هیچ عالمی آن را رد نمی‌کند، هر جا که آن را ببیند. و به همین دلیل به ایمان به آن امر شدیم، هرچند که نسخ شده و حکمش برداشته شده و عمل به آن بر ما حرام گشته است. و در آن علم نفع علم است. و در آن علم چیزی است که آن را شیء می‌بینی و شیء نیست، و شیء است، زیرا تو آن را شیء دیده‌ای. مثال آن سراب است که آن را آب می‌بینی، و «آل» که شخص انسان در سراب است، بزرگ می‌شود و در بزرگی آن شکی نیست. پس وقتی به آن می‌رسی، آن را آن‌گونه که دیدی نمی‌یابی، و در آنچه دیدی شک نمی‌کنی. و دیگری در آن هنگام که در مسافتی است که تو او را در آن بزرگ دیدی، او را بزرگ می‌بیند، و تو هنگامی که به او رسیدی، او را بزرگ نمی‌بینی. و این علمی الهی و شریف است. و در آن علم برتری دادن میان دو ضد است، مانند برتری دادن میان سیاهی و سفیدی، و این به دلیل آن است که رنگ آن دو را جمع کرده و برتری دادن واقع شده است. پس در هر برتری دادنی در هستی (الوجود)، ناگزیر از جامعی است که آن دو را جمع کند، یعنی همه کسانی که در هستی (الوجود) هستند، در آن جمع شوند. و به همین دلیل باطنیه در مورد باری (خداوند) فرار کردند، هنگامی که به آن‌ها گفته شد که او موجودی است که معدوم نیست، و ندانستند که در عین همان چیزی افتادند که از آن فرار کردند. زیرا همان‌طور که لفظ «موجود» بر موجود حادث اطلاق می‌شود، اسم «نیست که معدوم باشد» نیز بر او اطلاق می‌شود. پس شرکت در «نیست که معدوم باشد» واقع شده است. و همچنین تمام آنچه باطنی از آن سؤال می‌کند. و به همین دلیل آن‌ها جاهل‌ترین مردم به حقایق هستند. و در آن علم غَمام (ابر) است که از غَم (اندوه) می‌آید، و اینکه حق (الحق) در روز قیامت در آن می‌آید یا ملائکه، یا حق (الحق) و ملائکه، پس چه چیزی از غم عطا می‌شود. و در آن علم این است که چه زمانی حق (الحق) به تنهایی مالکیت را دارد، یا همیشه به تنهایی مالک بوده است، اما در موطنی مجهول و در موطنی معلوم شده است، و او همان است و غیر او نیست. زیرا او تعالی به حقیقت مالک است و مخلوق به جعل (قرار دادن) مالک است. خداوند متعال می‌فرماید: **«وجَعَلَكُمْ مُلُوكاً»** (و شما را پادشاهان قرار داد). و از اینجا می‌دانی که ملکِ ملک کیست. و در آن علم ظلمی است که شرایع آورده‌اند و اثر آن، و علم ظلمی که عقل می‌دهد و اثر آن، و علم ظلم ستوده و نکوهیده. و در آن علم فرق میان شیاطین انس و شیاطین جن است، و اینکه با چه کسی باید مصاحبت کرد و با چه کسی نباید مطلقاً از این نوع انسانی مصاحبت کرد. و در آن علم پناه بردن دعوت‌کنندگان به سوی خداوند است، هنگامی که دعوتشان شنیده نمی‌شود، چه رسول باشند و چه وارث. و در آن علم این است که حق (الحق) برای هر چیزی ضدی قرار داده است. و در آن علم اختصاص یکی از دو ضد به حب الهی و دیگری به بغض الهی است، و اینکه آیا صدور از یک عین واحد است یا از دو دست مختلف در حکم. و در آن علم حدوث احکام با حدوث نوازل است، و اینکه شریعت قطع نشده و قطع نمی‌شود تا زمانی که خداوند زمین و هر که بر آن است را به ارث ببرد. و اگر نبوت قطع شده باشد، شریعت قطع نشده است، مادامی که در عالم مجتهدی باشد. و در آن علم همانندی الهی با اکوان است، آیا این به دلیل علو قدر اکوان است یا به دلیل امر دیگری، مانند قول خداوند متعال: **«ولا يَأْتُونَكَ بِمَثَلٍ إِلَّا جِئْناكَ بِالْحَقِّ وأَحْسَنَ تَفْسِيراً»** (و هیچ مَثَلی برای تو نمی‌آورند مگر آنکه ما حق (الحق) و بهترین تفسیر را برای تو می‌آوریم). و در آن علم کسی است که از انسان‌ها بر شکم خود راه می‌رود و در چه صورتی محشور می‌شود کسی که این راه رفتن اوست. و در آن علم کسی است که خود را با پایین‌تر حبس کرده، با وجود معرفتش به بالاتر، و بالاتر او را به سوی خود می‌خواند و پایین‌تر او را نمی‌خواند، پس چه کسی او را به سوی پایین‌تر می‌خواند تا خود را بر آن حبس کند. و در آن علم چیزی است که انسان، هر انسانی که باشد، در علمش به غیر خود، از علمش به نفس خود فراتر می‌رود. و در آن علم شهود (الشهود) کیفیات است و اینکه چه کسی نزد ما به کیفیت موصوف است. و در آن علم الحاق انسان کامل (الإنسان الکامل) به پروردگارش و غیرت الهی بر مقام است، هنگامی که انسان بالفعل به صورت پروردگارش ظاهر شود، و اینکه حکم شیء بالفعل، خلاف آنچه را بالقوه می‌دهد، می‌دهد، پس عطای آن بالفعل قوی‌تر است. و در آن علم ظهور و خفا و راحتی است. و در آن علم نَفَس‌های ظاهر در عالم به رحمت و سبب آن و عموم ورود خلق در این نَفَس‌ها است. و در آن علم چیزی است که حق (الحق) ظهور آن را می‌خواهد و انسان مخالف، پوشاندن آن را می‌خواهد، و او کسی است که مصلحت را در غیر واقع در هستی (الوجود) می‌بیند. و صاحب این مقام به بصری تیزبین برای موازین شرعی نیاز دارد، زیرا جهل به مصالحی که حق (الحق) می‌بیند، بیشتر از علم به مصالح ظاهری در هستی (الکون) است که در نظر عقلی نزد عقلا مصلحت نیستند. و این علمی دقیق است که اگر انسان با کشف (الکشف) و تحقیق به آن عمل کند، هرگز خطا نمی‌کند. و اگر کسی که این صفت را ندارد به آن عمل کند، خطا می‌کند. و این همان است که عوام درباره آن می‌گویند: خطای سعادتمند، صواب است و صواب کسی که سعادتمند نیست، خطا است. و من این را در حطلحه در ملطیه دیدم و او شفاهاً به من گفت. و در آن علم امتزاجی است که در آن فصل ممکن نیست، و آن هر دو ضدی است که میانشان واسطه‌ای باشد، مانند فاتر (ولرم) میان گرم و سرد، که هیچ کس نمی‌تواند حرارت را از برودت در این فاتر جدا کند. و در آن علم فرق میان کسی است که «لله» (برای خدا) است و کسی که «علی الله» (بر ضد خدا) است. و در آن علم راه به سوی خداوند با نیت است، و اگرچه مشروع نباشد، از هر جهت نافع است، زیرا جز خداوند را قصد نکرده است. و عموم تجلی (التجلی) الهی معلوم است، پس بنده در آن مشیت دارد. و در آن علم چیزی است که به اسم الرحمن اختصاص دارد، نه غیر آن از اسماء الهی، و آنچه سزاوار است که با اسم الرحمن با آن رفتار شود، نه غیر آن از اسماء الهی. و در آن علم مسمای شیء چیست. و در آن علم تناوب است و اینکه متناوبان با هم جمع نمی‌شوند و آنچه در عالم انسان از آن دو حادث می‌شود. و در آن علم تأنی و سکون است و اینکه کجا ستوده می‌شوند. و در آن علم صفات سعادتمندان از غیر آن‌ها، عقلاً و شرعاً است. و در آن علم چیزی است که از صفات، تبدیل را می‌پذیرد و آنچه نمی‌پذیرد و کسی که آن را نمی‌پذیرد. و در آن علم محفوظان و معصومان از علمای عارف (العارفین) به خداوند متعال است. و در آن علم چیزی است که تذکر از مؤمن نتیجه می‌دهد. و در آن علم کسی است که امامت را طلب کرد و بر آن یاری شد. و در آن علم عنایت به دعوت‌کنندگان به سوی خداوند و شرف منزلت آن‌ها نزد خداوند است. و خداوند **«يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ»** (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 6
}