{
  "id": 439,
  "title": {
    "ar": "الباب التاسع والثلاثون وأربعمائة في معرفة منازلة قاب قوسين الثاني الحاصل بالوراثة النبوية للخواص منا",
    "en": "Chapter Four Hundred and Thirty-Nine: Concerning the Gnosis (المعرفة) of the Station (منازلة) of the Second *Qāb Qawsayn* (Two Bow-Lengths), which is attained through the Prophetic Inheritance (الوراثة النبوية) for the Elect (الخواص) among us.",
    "ur": "باب چار سو انتالیس: ہم میں سے خواص کے لیے وراثت نبویہ کے ذریعے حاصل ہونے والے دوسرے قاب قوسین (قاب قوسين الثاني) کے مقام کی معرفت کا بیان۔",
    "fa": "باب چهارصد و سی و نهم در معرفت منزلگاه قوسین دوم که برای خواص ما از طریق وراثت نبوی حاصل می‌شود"
  },
  "content": {
    "ar": "## «الباب التاسع والثلاثون وأربعمائة في معرفة منازلة قاب قوسين الثاني الحاصل بالوراثة النبوية للخواص منا»\n\n\n> قاب قوسين لنا من قبلنا *** قاب قوسين لمن أسرى به‏\n\n\n> غير أني وارث مستخدم *** ولذا نلناه منه فانتبه‏\n> فحلال وحرام بين *** ما هنا بينهما من مشتبه‏\n\n\n> إنما الشبهة من قال أنا *** عين من أسرى به ما أنا به‏\n\n\n> وهو يدري أنه وارثه *** ليس يدري ذاك غير المنتبه‏\n\n\n### [ميراث الأنبياء ما هو]\n\n\nقال الله تعالى ولَقَدْ كَتَبْنا في الزَّبُورِ من بَعْدِ الذِّكْرِ أَنَّ الْأَرْضَ يَرِثُها عِبادِيَ الصَّالِحُونَ وقال صَلَّى اللهُ عَليهِ وسَلَّم العلماء ورثة الأنبياء\n\n\nوذكر أن الأنبياء ورثوا العلم ما ورثوا دينارا ولا درهما\n\n\nفالوارث مستخدم بالمعنى من ورث منه ما جمعه غير إن الموروث في مثل هذا الورث ما نقصه شي‏ء من علمه بوراثة الوارث منه ففارق ميراث الدينار والدرهم بهذه الحقيقة والله يرث الْأَرْضَ ومن عَلَيْها مما تعلق به علمه من العلم الابتلائي فهذا هو قدر ميراث الحق من عباده وهو قوله تعالى ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ فاستخدمهم بما ابتلاهم حتى يعلم المجاهدين من عباده والصابرين ويبلو أخبارهم وما عدى هذا النوع في حق الحق فهو علم لا علم وراثة فكان الورثة من طريق المعنى استخدموا من ورثوا منه العلم الذي حصله من الله بحكم الكسب ابتداء وبحكم التكليف كل ذلك ورثوا منه الورثة من علماء الأمم ومما ورثوا منه قرب قاب قوسين وهو قولنا الثاني أعني الذي ينبغي للأولياء من هذا التقريب المحمدي ممن قرب منه هذا القرب فالأول من ذلك له صَلَّى اللهُ عَليهِ وسَلَّم والثاني للوارث وهو عينه وإنما جعلناه ثانيا لكونه ما حصل له حتى تقدم به هذا الرسول المعين صَلَّى اللهُ عَليهِ وسَلَّم فناله منه فهو في غاية البيان لا يقبل الشبه هذا العلم الموروث مثل ما يقبلها العلم النظري ولهذا نبه أبو المعالي لما ذكر النظر قال بحصول العلم عقيب النظر ضرورة فلو كان ذلك العلم الحاصل عقيب النظر نتيجة النظر ضرورة لما قبل الدخل بعد ذلك ولا الشبهة مثل ما لا يقبل ذلك العلم الضروري فتأولوا على إمام الحرمين ما لم يقصده بكلامه وإنما أراد رضي الله عنه ما أردناه أن النظر جعله الله سببا من الأسباب يفعل الأشياء عنده لا به فإذا وفي النظر في الدليل حقه خلق الله له العلم الضروري في نفسه ليس غير هذا فاعتماده على العلم الضروري الذي لا يقبل الشبه فإن لم يخلق له العلم الضروري فهو العالم الذي يقبل الدخل فيما علمه فيعلم عند ذلك أنه ما علمه علما ضروريا ولهذا ما يقبل الدخل إلا دليله لا ما يقول إنه علمه عقيب النظر فرجوعه أو توقفه عما كان أنتج له ذلك الدليل أخرجه أن يكون ذلك عنده علما ضروريا فليفرق الوارث في علمه بربه بين ما يأخذه ورثا وبين ما يأخذه ابتداء من غير ورث فأي عامل من العاملين عمل بأمر مشروع له من نص لا من تأويل وحصل له عن ذلك العمل علم بالله فهو من العلم الموروث ثم إنه لا يخلو ذلك النص المعمول به هل كان شرعا لمن قبل محمد صَلَّى اللهُ عَليهِ وسَلَّم أو لم يكن إلا من الشرع المختص به لا من الشرع المقرر الذي قرره لأمته مما كان الله قد تعبد به نبيا قبله فوارث مثل هذا وارث من كان ذلك العمل شرعه من الأنبياء بلغوا ما بلغوا ووارث أيضا محمدا صَلَّى اللهُ عَليهِ وسَلَّم فيه فهو وارث من وارث فإن كان مما اختص به رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فالوارث وارث محمد صَلَّى اللهُ عَليهِ وسَلَّم فيه خاصة لا ينتسب إلى غيره من الأنبياء عليه السلام ويتميز بذلك عن سائر ورثة علماء الأنبياء عليه السلام قبله ويحشر بذلك العلم في صفوف الأنبياء عليه السلام وخلف محمد صَلَّى اللهُ عَليهِ وسَلَّم فإن نشأة الآخرة تشبه في بعض الأحكام النشأة البرزخية فترى نفسها وهي واحدة في صور كثيرة وأماكن مختلفة في الآن الواحد فيرى نفسه إن كان ورث عن وارث خلف محمد صَلَّى اللهُ عَليهِ وسَلَّم وخلف كل نبي كان ذلك العمل شرعا له ولو كانوا مائة ألف لرأى نفسه في أماكن على عددهم وفي صور ويعلم أنه هو وليس غيره في كل صورة وهو مع كونه واحدا عين كل صورة وهكذا يكون يوم القيامة فإن النبي صَلَّى اللهُ عَليهِ وسَلَّم يطلبه الناس في مواطن القيامة فيجدونه من حيث طلبهم في كل موطن يقتضيه ذلك الطلب في الوقت الذي يجده الطالب الآخر في الموطن الآخر بعينه فمن لم يجده في طلبه في موطن ما فإنما ذلك لكونه طلبه في غير الموطن الذي يقتضيه طلبه فإن طلبه في موطن اقتضى حاله الجهل لوجده فذلك الجهل إذا وقع إن وقع فسببه ما ذكرناه وهو غير واقع والله أعلم ثم نرجع ونقول وإن كان ذلك العمل الذي أقيم فيه العبد لا عن نص مشروع بل كان قلد فيه مجتهدا من علماء الأمة صاحب نظر وتأويل فيما حكم به لا عن نص من ذلك المجتهد اتبعه فإنه يكون يوم القيامة وارث ذلك المجتهد ومتبعا إياه ومتبعا أيضا والنبي ص‏\nوإن كان ذلك في نفس الأمر شرعا له كما تقدم وإن كان العامل لا عن نص ولا عن تقليد بل كان عن نظر واجتهاد وتفقه فهذا لا يكون وارثا في مثل هذه المسألة إلا إن أصاب الحكم فيها فإن أصاب الحكم كان وارثا وإن أخطأ الحكم لم يكن وارثا ويحشر في صف من هذه صفته ولهم صف مخصوص ثم هم في المواطن بحسب ما يكون عليه ذلك الحكم من صادفة من تقدمه أنه شرع له فتكون له صور متبعة خلف ذلك الموروث منه كان من كان والكل خلف محمد صَلَّى اللهُ عَليهِ وسَلَّم وتختلف مراتبه خلف رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وخلف الرسل عليه السلام لاختلاف ما ظهر له في الذي عمل به فإن انفرد به جملة عن كل رسول ونبي ومجتهد فإنه يكون أمة وحده‏\n\n\nكقُسِّ بن ساعدة قال فيه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إنه يبعث يوم القيامة أمة وحده‏\n\n\nمع كونه خلف محمد صَلَّى اللهُ عَليهِ وسَلَّم لا بد من ذلك من حيث إنه صَلَّى اللهُ عَليهِ وسَلَّم أعطاه المادة التي نظر فيها حتى انقدح له ما لم يخطر له إلا في تلك المسألة النازلة وأخطأ فيها حكم رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لا بد من ذلك بخلاف حكم المصيب فتحقق هذه المنازلة فإنها غريبة في المنازلات قليل من أهل الله من تكون له فإنها تنبئ عن تحقيق عظيم وذوق غريب ورفع إشكال وليس يكون في القيامة أدل ولا أعرف بمواطن القيامة ولا بصور ما فيها أعظم من صاحب هذه المنازلة ولا تحصل إلا بالوهب الإلهي لمن حصلت له والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Four Hundred and Thirty-Nine concerning the Gnosis of the Second Station of *Qāb Qawsayn* (قاب قوسين), attained through Prophetic Inheritance for the Elite among us\n\n> *Qāb Qawsayn* is for us, from those before us,\n> *Qāb Qawsayn* is for him by whom the Night Journey was made.\n\n> Except that I am an inheritor, one who is employed,\n> And thus we attained it from him, so pay heed.\n> For the lawful and the unlawful are clear,\n> What is here between them is ambiguous.\n\n> The ambiguity is only for him who says, \"I am\n> The very essence of him by whom the Night Journey was made,\" but I am not him.\n\n> Yet he knows that he is his inheritor,\n> None knows that except the one who is attentive.\n\n### [What is the Inheritance of the Prophets]\n\nAllah the Exalted said: <<And We have already written in the Book of Psalms (الزَّبُور), after the Reminder (الذِّكْر), that the earth shall be inherited by My righteous servants (عِبادِيَ الصَّالِحُونَ)>>. And the Prophet, peace and blessings be upon him, said: \"The scholars are the inheritors of the Prophets.\" And it was mentioned that the Prophets bequeathed Knowledge (العلم); they did not bequeath a dinar or a dirham.\n\nThe inheritor (الوارث) is employed by the meaning of what he inherited from the one who gathered it. However, the inherited thing (الموروث) in this type of inheritance is such that nothing of the knowledge of the one who bequeathed it is diminished by the inheritor’s receiving it. This fact (الحقيقة) distinguishes it from the inheritance of dinars and dirhams.\n\nAllah inherits the earth and those upon it (الْأَرْضَ ومن عَلَيْها) concerning what His Knowledge (علمه) relates to, specifically the Knowledge of Trial (العلم الابتلائي). This is the measure of the inheritance of The Real (الحق) from His servants, which is His saying: <<And We shall surely test you until We know (حَتَّى نَعْلَمَ)>>. Thus, He employs them through the trials He imposes until He knows the strivers (المجاهدين) and the patient (الصابرين) among His servants, and tests their reports. Any knowledge concerning The Real (الحق) that is outside this type is Knowledge (علم) that is not the Knowledge of Inheritance (علم وراثة).\n\nTherefore, the inheritors, by way of meaning (من طريق المعنى), are employed by the one from whom they inherited the Knowledge that he acquired from Allah, initially through acquisition (الكسب ابتداء) and through the ruling of obligation (التكليف). All of this is inherited by the inheritors among the scholars of the nations.\n\nAmong what they inherited is the proximity of *Qāb Qawsayn* (قاب قوسين), which is what we call the Second [Proximity]—meaning the proximity that is appropriate for the Friends of Allah (الأولياء) from this Muhammadan approach (التقريب المحمدي), for those who are brought near to Him by this proximity. The first of these proximities belongs to the Prophet, peace and blessings be upon him, and the second belongs to the inheritor, and it is the very essence (عينه) of the first. We only designated it as \"second\" because it was not attained by the inheritor until this specific Messenger, peace and blessings be upon him, preceded him in it, and the inheritor received it from him.\n\nThis inherited Knowledge (العلم الموروث) is of the utmost clarity; it does not accept ambiguity (الشبه) in the way that speculative knowledge (العلم النظري) accepts it. For this reason, Abu al-Ma'ali (Imam al-Haramayn al-Juwayni) drew attention to this when he mentioned speculation (النظر), saying that knowledge is attained necessarily (ضرورة) following speculation. If the knowledge attained following speculation were necessarily the result of that speculation, it would not subsequently accept intrusion (الدخل) or ambiguity, just as necessary knowledge (العلم الضروري) does not accept that.\n\nThey misinterpreted the Imam of the Two Sanctuaries regarding what he did not intend by his speech. Rather, what he intended, may Allah be pleased with him, was what we intend: that Allah made speculation a cause (سببا) among causes, effecting things *at* it, not *by* it. When speculation fulfills its right in the evidence (الدليل), Allah creates necessary Knowledge within the self, and nothing else. Thus, his reliance is upon the necessary Knowledge, which does not accept ambiguity. If Allah does not create necessary Knowledge for him, then he is the scholar whose knowledge accepts intrusion, and he knows then that he did not attain it as necessary Knowledge.\n\nFor this reason, only his evidence accepts intrusion, not what he claims he knew following speculation. His retraction or hesitation concerning what that evidence produced for him removes it from being necessary Knowledge in his view.\n\nLet the inheritor distinguish in his knowledge of his Lord between what he takes by inheritance (ورثا) and what he takes initially (ابتداء) without inheritance.\n\nAny worker who acts according to a matter legislated for him based on a textual source (نص), not on interpretation (تأويل), and thereby attains Knowledge of Allah, this is from the inherited Knowledge. Furthermore, that textual source must be examined: Was it a law (شرعا) for those before Muhammad, peace and blessings be upon him, or was it exclusively from the law specific to him (الشرع المختص به), not from the established law that He established for his community, which Allah had previously obligated a prophet before him to follow?\n\nThe inheritor of the former type (shared law) is an inheritor of the prophets for whom that action was law, reaching whatever rank they reached, and he is also an inheritor of Muhammad, peace and blessings be upon him, in it. Thus, he is an inheritor from an inheritor.\n\nIf the action was specific to the Messenger of Allah, peace and blessings be upon him, then the inheritor is specifically the inheritor of Muhammad, peace and blessings be upon him, in it, and is not attributed to any other prophet, peace be upon them. He is thereby distinguished from all other inheritor-scholars of the prophets before him. He will be gathered with that Knowledge in the ranks of the prophets, peace be upon them, and behind Muhammad, peace and blessings be upon him.\n\nSince the state of the Hereafter (نشأة الآخرة) resembles the state of the Isthmus (النشأة البرزخية) in some rulings, the soul sees itself, though it is one, in many forms and different places simultaneously. If he inherited from an inheritor, he will see himself behind Muhammad, peace and blessings be upon him, and behind every prophet for whom that action was law. Even if there were a hundred thousand of them, he would see himself in places corresponding to their number and in various forms, and he knows that it is he and no other in every form, and despite being one, he is the essence (عين) of every form.\n\nThis is how it will be on the Day of Resurrection (يوم القيامة), for people seek the Prophet, peace and blessings be upon him, in the stations (مواطن) of the Resurrection, and they find him, according to their request, in every station that necessitates that request, at the very moment the other seeker finds him in the other station. If someone does not find him in his search in a certain station, it is only because he sought him in a station other than the one necessitated by his request. If he sought him in a station whose condition necessitated ignorance, he would find him. That ignorance, if it occurs, is caused by what we mentioned, though it is not actually occurring—and Allah knows best.\n\nWe return and say: If the action in which the servant is engaged is not based on a legislated text, but rather he followed (قلد) a jurist (مجتهد) among the scholars of the community—one who relies on speculation and interpretation in his ruling, not on a textual source—then on the Day of Resurrection, he will be the inheritor of that jurist and his follower, and also a follower of the Prophet, peace and blessings be upon him, if that action was, in reality, a law for him, as previously stated.\n\nIf the worker acts neither based on a text nor on imitation, but based on speculation, independent reasoning (*ijtihad*), and jurisprudence (*tafaqquh*), then he is not an inheritor in this specific issue unless he correctly judged the ruling. If he judged correctly, he is an inheritor. If he erred in the judgment, he is not an inheritor. He will be gathered in the rank of those whose characteristic is this, and they have a specific rank.\n\nTheir stations depend on the nature of that ruling: if it corresponds to what was legislated for those who preceded him, he will have forms following that one from whom he inherited, whoever he may be. All are behind Muhammad, peace and blessings be upon him. Their ranks behind the Messenger of Allah, peace and blessings be upon him, and behind the Messengers, peace be upon them, differ according to what was revealed to him in the action he performed. If he is entirely unique in it, separate from every Messenger, Prophet, and jurist, then he is a nation unto himself (أمة وحده).\n\nLike Quss ibn Sa'ida, concerning whom the Messenger of Allah, peace and blessings be upon him, said: \"He shall be resurrected on the Day of Resurrection as a nation unto himself.\"\n\nThis is despite the fact that he must be behind Muhammad, peace and blessings be upon him, because the Prophet, peace and blessings be upon him, provided him with the material (المادة) upon which he speculated until what occurred to him was sparked, which would not have occurred to him except in that specific descending issue (المسألة النازلة). And in it, the ruling of the Messenger of Allah, peace and blessings be upon him, was necessarily missed, unlike the ruling of the one who is correct.\n\nRealize this station (المنازلة), for it is strange among the stations, and few among the People of Allah (أهل الله) possess it. It signifies a great realization (تحقيق عظيم), a unique spiritual taste (ذوق غريب), and the removal of ambiguity (رفع إشكال). On the Day of Resurrection, there will be none more indicative, nor more knowledgeable of the stations of the Resurrection, nor of the forms within them, than the possessor of this station. It is only attained through Divine Gift (الوهب الإلهي) for the one who receives it. <<And Allah speaks the Truth, and He guides to the Way (السَّبِيلَ)>>.",
    "ur": "باب نمبر چار سو انتالیس: ہمارے خواص کے لیے وراثت نبویہ کے ذریعے حاصل ہونے والے دوسرے مقام قاب قوسین کی معرفت میں۔\n\n> قاب قوسین ہمیں ہمارے پیشرو سے حاصل ہوا،\n> قاب قوسین اس کے لیے ہے جسے معراج کرائی گئی۔\n> مگر میں ایک وارث ہوں جو استعمال کرنے والا ہے،\n> اسی لیے ہم نے اسے اس (رسول) سے حاصل کیا، پس ہوشیار ہو جاؤ۔\n> حلال اور حرام واضح ہیں،\n> لیکن یہاں ان دونوں کے درمیان مشتبہ (شبہ والی) چیز ہے۔\n> شبہ صرف اس شخص کی طرف سے ہے جو کہتا ہے: میں وہی ہوں جسے معراج کرائی گئی، حالانکہ میں وہ نہیں ہوں۔\n> اور وہ جانتا ہے کہ وہ اس کا وارث ہے،\n> یہ بات صرف ہوشیار شخص ہی جانتا ہے۔\n\n### [انبیاء کی وراثت کیا ہے]\n\nاللہ تعالیٰ نے فرمایا:\n**وَلَقَدْ كَتَبْنَا فِي الزَّبُورِ مِنْ بَعْدِ الذِّكْرِ أَنَّ الْأَرْضَ يَرِثُهَا عِبَادِيَ الصَّالِحُونَ**\n(اور ہم نے زبور میں نصیحت کے بعد لکھ دیا تھا کہ زمین کے وارث میرے نیک بندے ہوں گے۔)\nاور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا:\n**العلماء ورثة الأنبياء**\n(علماء انبیاء کے وارث ہیں۔)\nاور ذکر کیا کہ انبیاء نے علم کی وراثت چھوڑی ہے، انہوں نے دینار یا درہم کی وراثت نہیں چھوڑی۔\n\nپس وارث (الوارث) اس معنی میں استعمال کرنے والا ہے کہ جس سے اس نے وراثت پائی، اس نے جو کچھ جمع کیا تھا وہ وارث نے لے لیا، مگر اس قسم کی وراثت میں موروث (جس کی وراثت ہوئی) کے علم میں وارث کے وراثت پانے سے کوئی کمی نہیں آتی۔ لہٰذا یہ حقیقت دینار اور درہم کی وراثت سے مختلف ہے۔ اور اللہ تعالیٰ زمین اور جو کچھ اس پر ہے، اس کا وارث ہے، اس علم ابتلاء پر مبنی (العلم الابتلائي) کے تعلق سے جو اس کے علم سے متعلق ہے۔ پس یہ ذات حق (الحق) کی اپنے بندوں سے وراثت کی مقدار ہے، اور یہی اس کا قول ہے:\n**وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ**\n(اور ہم تمہیں ضرور آزمائیں گے تاکہ ہم جان لیں)\nپس اس نے انہیں اس چیز کے ذریعے استعمال کیا جس سے اس نے انہیں آزمایا، تاکہ وہ اپنے بندوں میں سے مجاہدین اور صابرین کو جان لے اور ان کے حالات کو پرکھے۔ اور ذات حق (الحق) کے حق میں اس نوعیت کے علاوہ جو کچھ ہے، وہ علم ہے، نہ کہ وراثت کا علم۔\n\nچنانچہ وارثوں نے معنی کے اعتبار سے ان لوگوں کو استعمال کیا جن سے انہوں نے وہ علم ورثے میں پایا جو انہوں نے اللہ سے کسب (ابتداء) کے حکم اور تکلیف (ذمہ داری) کے حکم سے حاصل کیا تھا۔ یہ سب کچھ امتوں کے علماء وارثوں نے ان سے ورثے میں پایا۔ اور جو کچھ انہوں نے ورثے میں پایا ان میں سے ایک قرب قاب قوسین ہے، اور یہی ہمارا دوسرا قول ہے، یعنی وہ جو اولیاء کے لیے اس محمدی تقرب سے حاصل ہونا چاہیے، ان میں سے جو اس قرب سے قریب ہوئے۔ پس اس میں سے پہلا قرب تو آپ صلی اللہ علیہ وسلم کے لیے ہے، اور دوسرا وارث کے لیے ہے، اور یہ (دوسرا قرب) پہلے کی عین ذات ہے، مگر ہم نے اسے دوسرا اس لیے قرار دیا کہ یہ اسے حاصل نہیں ہوا جب تک کہ اس مخصوص رسول صلی اللہ علیہ وسلم نے اس میں سبقت نہ کی، پس اس نے یہ قرب آپ صلی اللہ علیہ وسلم سے حاصل کیا۔ یہ موروثی علم انتہائی واضح ہے اور شبہ کو قبول نہیں کرتا، جیسا کہ نظری علم (العلم النظري) شبہ کو قبول کرتا ہے۔\n\nاسی لیے ابو المعالی نے جب نظر (فکری غور و فکر) کا ذکر کیا تو تنبیہ کی کہ علم نظر کے بعد بالضرورت حاصل ہوتا ہے۔ اگر نظر کے بعد حاصل ہونے والا وہ علم نظر کا نتیجہ بالضرورت ہوتا تو اس کے بعد وہ کسی قسم کی ملاوٹ یا شبہ کو قبول نہ کرتا، جیسا کہ علم ضروری (العلم الضروري) اسے قبول نہیں کرتا۔ چنانچہ انہوں نے امام الحرمین پر اس بات کی تاویل کی جو ان کا مقصد نہیں تھا۔ بلکہ ان کا مقصد، اللہ ان سے راضی ہو، وہی تھا جو ہم نے ارادہ کیا ہے کہ اللہ نے نظر کو اسباب میں سے ایک سبب بنایا ہے جو چیزوں کو اس کے پاس (عِندَہُ) وقوع پذیر کرتا ہے نہ کہ اس کے ذریعے (بِہِ)۔ پس جب دلیل میں نظر اپنا حق پورا کرتی ہے تو اللہ اس کے نفس میں علم ضروری (العلم الضروري) پیدا کر دیتا ہے، بس یہی ہے۔ لہٰذا اس کا انحصار علم ضروری پر ہے جو شبہ کو قبول نہیں کرتا۔ اور اگر اللہ اس کے لیے علم ضروری پیدا نہ کرے تو وہ ایسا عالم ہے جو اپنے معلوم میں ملاوٹ کو قبول کرتا ہے، اور تب وہ جانتا ہے کہ اس نے اسے علم ضروری کے طور پر نہیں جانا۔ اسی لیے اس کے علم میں صرف اس کی دلیل ہی ملاوٹ کو قبول کرتی ہے، نہ کہ وہ جو وہ کہتا ہے کہ اس نے نظر کے بعد جانا۔ پس اس کا رجوع یا توقف اس چیز سے جو اس دلیل نے اسے نتیجہ خیز بنا کر دی تھی، اسے اس بات سے خارج کر دیتا ہے کہ وہ علم اس کے نزدیک علم ضروری ہو۔\n\nپس وارث کو اپنے رب کے علم میں اس چیز کے درمیان فرق کرنا چاہیے جو وہ وراثت کے طور پر لیتا ہے اور اس چیز کے درمیان جو وہ وراثت کے بغیر ابتداءً لیتا ہے۔ پس عاملین میں سے جو بھی عامل کسی ایسے امر پر عمل کرے جو اس کے لیے کسی نص (قرآنی یا حدیثی) سے مشروع کیا گیا ہو، نہ کہ کسی تاویل سے، اور اس عمل کے نتیجے میں اسے اللہ کی معرفت (المعرفۃ) حاصل ہو، تو یہ علم موروث میں سے ہے۔ پھر یہ معمول بہ نص اس سے خالی نہیں کہ آیا یہ محمد صلی اللہ علیہ وسلم سے پہلے کسی کے لیے شریعت تھی یا یہ صرف آپ صلی اللہ علیہ وسلم کے ساتھ خاص شریعت میں سے تھی، نہ کہ اس مقررہ شریعت میں سے جو آپ نے اپنی امت کے لیے مقرر کی، جو اللہ نے آپ سے پہلے کسی نبی کو بھی دی تھی۔\n\nپس ایسے شخص کا وارث ان انبیاء کا وارث ہے جن کے لیے وہ عمل شریعت تھا، خواہ وہ جہاں تک بھی پہنچے ہوں، اور وہ محمد صلی اللہ علیہ وسلم کا بھی اس میں وارث ہے۔ پس وہ وارث کا وارث ہے۔ اور اگر وہ عمل رسول اللہ صلی اللہ علیہ وسلم کے ساتھ خاص تھا، تو وارث اس میں خاص طور پر محمد صلی اللہ علیہ وسلم کا وارث ہے، اور دیگر انبیاء علیہم السلام میں سے کسی اور کی طرف منسوب نہیں ہوتا۔ اور اس طرح وہ اپنے سے پہلے کے انبیاء علیہم السلام کے علماء وارثوں سے ممتاز ہو جاتا ہے۔ اور وہ اس علم کے ساتھ انبیاء علیہم السلام کی صفوں میں اور محمد صلی اللہ علیہ وسلم کے پیچھے حشر کیا جائے گا۔\n\nآخرت کی نشأت (پیدائش) بعض احکام میں برزخی نشأت سے مشابہت رکھتی ہے، چنانچہ وہ اپنے آپ کو دیکھتا ہے، حالانکہ وہ ایک ہی ہے، لیکن ایک ہی وقت میں کئی صورتوں اور مختلف مقامات پر ہوتا ہے۔ پس وہ اپنے آپ کو دیکھتا ہے، اگر وہ وارث کا وارث ہے، تو محمد صلی اللہ علیہ وسلم کے پیچھے اور ہر اس نبی کے پیچھے جس کے لیے وہ عمل شریعت تھا، خواہ وہ ایک لاکھ ہی کیوں نہ ہوں۔ وہ اپنے آپ کو ان کی تعداد کے مطابق مقامات پر اور صورتوں میں دیکھے گا، اور وہ جانتا ہے کہ وہ ہر صورت میں وہی ہے اور کوئی دوسرا نہیں، اور وہ ایک ہونے کے باوجود ہر صورت کی عین ذات ہے۔ اور قیامت کے دن بھی ایسا ہی ہو گا، کیونکہ لوگ قیامت کے مقامات پر نبی صلی اللہ علیہ وسلم کو تلاش کریں گے، تو وہ انہیں ہر اس مقام پر پائیں گے جہاں ان کی طلب کا تقاضا ہو، عین اسی وقت جب دوسرا طالب انہیں دوسرے مقام پر پائے گا۔ پس جو شخص کسی مقام پر اپنی طلب میں انہیں نہ پائے، تو یہ صرف اس وجہ سے ہے کہ اس نے انہیں اس مقام کے علاوہ کسی اور جگہ تلاش کیا جو اس کی طلب کا تقاضا کرتا تھا۔ اگر وہ انہیں اس مقام پر تلاش کرتا جہاں اس کے حال کا تقاضا جہالت ہوتا تو وہ انہیں پا لیتا۔ پس اگر وہ جہالت واقع ہو تو اس کا سبب وہی ہے جو ہم نے ذکر کیا، حالانکہ وہ واقع نہیں ہو گی، واللہ اعلم۔\n\nپھر ہم واپس آتے ہیں اور کہتے ہیں کہ اگر وہ عمل جس پر بندہ قائم ہوا، کسی مشروع نص کی بنیاد پر نہیں تھا، بلکہ اس نے اس میں امت کے علماء میں سے کسی مجتہد کی تقلید کی، جو اپنے حکم میں نظر اور تاویل کا مالک تھا، نہ کہ اس مجتہد کی کسی نص کی پیروی کی، تو وہ قیامت کے دن اس مجتہد کا وارث اور اس کا پیروکار ہو گا، اور نبی صلی اللہ علیہ وسلم کا بھی پیروکار ہو گا، اگرچہ وہ عمل نفس الامر میں اس کے لیے شریعت تھا، جیسا کہ پہلے بیان ہوا۔\n\nاور اگر عامل نہ نص کی بنیاد پر عمل کرے اور نہ تقلید کی بنیاد پر، بلکہ نظر، اجتہاد اور تفقہ (گہری سمجھ) کی بنیاد پر عمل کرے، تو وہ اس مسئلے میں وارث نہیں ہو گا، مگر یہ کہ وہ اس حکم میں درستگی کو پا لے۔ اگر وہ حکم میں درستگی کو پا لے تو وہ وارث ہو گا، اور اگر حکم میں غلطی کرے تو وارث نہیں ہو گا۔ اور وہ اس صفت والے لوگوں کی صف میں حشر کیا جائے گا، اور ان کے لیے ایک مخصوص صف ہے۔ پھر وہ مقامات میں اس حکم کے مطابق ہوں گے جو اس نے پایا، جس میں اس سے پہلے کسی نے اسے شریعت کے طور پر پایا تھا۔ پس اس کی صورتیں ہوں گی جو اس موروث کے پیچھے چلیں گی، خواہ وہ کوئی بھی ہو، اور سب محمد صلی اللہ علیہ وسلم کے پیچھے ہوں گے۔ اور رسول اللہ صلی اللہ علیہ وسلم اور دیگر رسولوں علیہم السلام کے پیچھے ان کے درجات میں اختلاف ہو گا، اس اختلاف کی وجہ سے جو اس عمل میں اس پر ظاہر ہوا جس پر اس نے عمل کیا۔\n\nپس اگر وہ (مجتہد) ہر رسول، نبی اور مجتہد سے مکمل طور پر منفرد ہو جائے، تو وہ اکیلا ایک امت ہو گا۔\nجیسے قس بن ساعدہ، جن کے بارے میں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n**إنه يبعث يوم القيامة أمة وحده‏**\n(وہ قیامت کے دن اکیلے ایک امت کے طور پر اٹھائے جائیں گے۔)\nاس کے باوجود وہ محمد صلی اللہ علیہ وسلم کے پیچھے ہوں گے، یہ ضروری ہے، اس لحاظ سے کہ آپ صلی اللہ علیہ وسلم نے ہی اسے وہ مادہ (بنیاد) عطا کیا جس میں اس نے غور و فکر کیا، یہاں تک کہ اس کے لیے وہ چیز روشن ہوئی جو اسے صرف اس نازل شدہ مسئلے میں ہی سوجھی، اور اس میں رسول اللہ صلی اللہ علیہ وسلم کے حکم میں غلطی نہیں ہوئی، یہ ضروری ہے، برخلاف اس حکم کے جو درست ہو۔ پس اس مقام (المنازلة) کی تحقیق کرو، کیونکہ یہ مقامات میں ایک عجیب مقام ہے، اور اللہ والوں میں سے بہت کم لوگ ہیں جنہیں یہ حاصل ہوتا ہے۔ کیونکہ یہ ایک عظیم تحقیق، ایک عجیب ذوق، اور اشکال کے رفع ہونے کی خبر دیتا ہے۔ اور قیامت میں اس مقام کے مالک سے زیادہ کوئی رہنمائی کرنے والا، نہ قیامت کے مقامات کو جاننے والا، اور نہ ہی ان کی صورتوں کو جاننے والا ہو گا۔ اور یہ صرف اس شخص کو عطیہ الٰہی (الوہب الإلهي) سے حاصل ہوتا ہے جسے یہ حاصل ہو۔\n**وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ**\n(اور اللہ حق فرماتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے۔)",
    "fa": "باب چهارصد و سی و نهم در معرفت منزلت قاب قوسین دوم که از طریق وراثت نبوی برای خواص ما حاصل می‌شود.\n\nقاب قوسین (قاب قوسين) از پیش ما برای ماست *** قاب قوسین برای کسی است که به معراج برده شد.\nجز این نیست که من وارثی هستم که به کار گرفته شده‌ام *** و از این رو آن را از او (پیامبر) دریافت کردیم، پس آگاه باش.\nحلال و حرام آشکار است *** آنچه در این میان است، مشتبه است.\nشبهه تنها از کسی است که می‌گوید من *** عین کسی هستم که به معراج برده شد، در حالی که من او نیستم.\nو او می‌داند که وارث اوست *** این را جز شخص آگاه (منتبه) نمی‌داند.\n\n### [میراث انبیا چیست]\n\nخداوند متعال می‌فرماید: «وَلَقَدْ كَتَبْنَا فِي الزَّبُورِ مِن بَعْدِ الذِّكْرِ أَنَّ الْأَرْضَ يَرِثُهَا عِبَادِيَ الصَّالِحُونَ» (و به راستی، پس از ذکر [تورات] در زبور نوشتیم که زمین را بندگان شایسته من به ارث خواهند برد). و پیامبر (صلی الله علیه و سلم) فرمود: «الْعُلَمَاءُ وَرَثَةُ الْأَنْبِيَاءِ» (علما وارثان انبیا هستند).\n\nو ذکر شد که انبیا علم را به ارث گذاشتند، نه دینار و درهم را.\n\nپس وارث، به معنای کسی است که از موروث خود آنچه را جمع کرده به کار می‌گیرد، جز اینکه در این نوع وراثت، چیزی از علم موروث به واسطه وراثت وارث از او کاسته نمی‌شود. پس با این حقیقت، از میراث دینار و درهم متفاوت است. و خداوند زمین و هر که بر آن است را به ارث می‌برد، از آنچه علم او از علم ابتلائی (علم الابتلائي) به آن تعلق گرفته است. این است قدر میراث حق (الحق) از بندگانش، و آن قول خداوند متعال است: «وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ» (و قطعاً شما را می‌آزماییم تا بدانیم). پس آنان را با آنچه آزمود، به کار گرفت تا مجاهدان و صابران از بندگانش را بشناسد و اخبارشان را بیازماید. و آنچه غیر از این نوع در حق (الحق) است، علمی است که علم وراثت نیست. پس وارثان از طریق معنا، کسی را که از او ارث بردند، به کار گرفتند؛ علمی که او (موروث) به حکم کسب ابتدایی و به حکم تکلیف از خداوند به دست آورده بود. همه اینها را وارثان از علمای امت‌ها از او به ارث بردند.\n\nو از جمله آنچه به ارث بردند، قرب قاب قوسین (قاب قوسين) است، که منظور ما قول دوم است؛ یعنی آنچه برای اولیا از این تقریب محمدی (الحقیقة المحمدیة) سزاوار است، از کسانی که این قرب به او (پیامبر) نزدیک شده است. پس اولی از آن، مخصوص او (صلی الله علیه و سلم) است و دومی برای وارث است، در حالی که عین همان است. و ما آن را دوم نامیدیم، زیرا برای وارث حاصل نشد مگر پس از آنکه این رسول معین (صلی الله علیه و سلم) در آن پیشی گرفت و وارث آن را از او دریافت کرد. پس این علم موروث در نهایت وضوح است و شبهه نمی‌پذیرد، برخلاف علمی که از طریق نظر (النظر) حاصل می‌شود. به همین دلیل، ابوالمعالی (امام الحرمین جوینی) هنگامی که نظر را ذکر کرد، متذکر شد که علم به دنبال نظر به صورت ضروری حاصل می‌شود. پس اگر آن علمی که به دنبال نظر حاصل می‌شود، نتیجه ضروری نظر بود، پس از آن فساد (دخل) و شبهه نمی‌پذیرفت، همان‌طور که علم ضروری (العلم الضروري) آن را نمی‌پذیرد. پس بر امام الحرمین (رضی الله عنه) تأویل کردند آنچه را که او قصد نکرده بود. بلکه او (رضی الله عنه) همان چیزی را اراده کرد که ما اراده کردیم: اینکه خداوند نظر را سببی از اسباب قرار داده که اشیا را نزد آن (سبب) انجام می‌دهد، نه به واسطه آن. پس هنگامی که نظر در دلیل حق خود را ادا کند، خداوند علم ضروری را در نفس او خلق می‌کند و نه غیر از این. بنابراین، اعتماد او بر علم ضروری است که شبهه نمی‌پذیرد. و اگر خداوند علم ضروری را برای او خلق نکند، او عالمی است که آنچه را دانسته، فساد می‌پذیرد و در آن هنگام می‌داند که آن را به صورت علم ضروری نیاموخته است. و به همین دلیل، فساد (دخل) تنها دلیل او را می‌پذیرد، نه آنچه را که می‌گوید به دنبال نظر آموخته است. پس بازگشت یا توقف او از آنچه آن دلیل برایش نتیجه داده بود، آن را از اینکه نزد او علم ضروری باشد، خارج می‌سازد.\n\nپس وارث باید در علم خود به پروردگارش، میان آنچه به صورت وراثت می‌گیرد و آنچه به صورت ابتدایی و بدون وراثت می‌گیرد، فرق بگذارد. پس هر عاملی از عاملان که به امری مشروع برای او، از طریق نص (و نه تأویل) عمل کند و از آن عمل، علمی به خداوند برایش حاصل شود، آن علم از علم موروث است. سپس آن نص مورد عمل، خالی از این نیست که آیا شرع برای کسانی پیش از محمد (صلی الله علیه و سلم) بوده است یا تنها از شرع مختص به او بوده، نه از شرع مقرر که برای امتش وضع کرده و خداوند پیامبری پیش از او را به آن متعبد ساخته بود. پس وارث چنین عملی، وارث آن پیامبرانی است که آن عمل شرعشان بوده است، هر چند به هر مرتبه‌ای رسیده باشند، و همچنین وارث محمد (صلی الله علیه و سلم) در آن است. پس او وارث از وارث است. و اگر آن عمل از اموری باشد که مختص رسول خدا (صلی الله علیه و سلم) است، پس وارث، وارث خاص محمد (صلی الله علیه و سلم) در آن است و به هیچ یک از انبیای دیگر (علیهم السلام) منتسب نمی‌شود. و به واسطه آن، از سایر وارثان علمای انبیای پیش از او (علیهم السلام) متمایز می‌شود و با آن علم در صفوف انبیا (علیهم السلام) و پشت سر محمد (صلی الله علیه و سلم) محشور می‌گردد. زیرا نشأت آخرت در برخی احکام شبیه نشأت برزخی (النشأة البرزخية) است، پس نفس خود را می‌بیند در حالی که یکی است، اما در صورتهای بسیار و مکان‌های مختلف در یک لحظه. پس اگر از وارثی ارث برده باشد، خود را پشت سر محمد (صلی الله علیه و سلم) و پشت سر هر پیامبری که آن عمل شرع او بوده است، می‌بیند. و اگر صد هزار نفر هم باشند، خود را در مکان‌هایی به تعداد آنان و در صورتهایی می‌بیند و می‌داند که اوست و نه دیگری در هر صورت، و با وجود اینکه یکی است، عین هر صورت است. و روز قیامت نیز چنین خواهد بود؛ زیرا مردم پیامبر (صلی الله علیه و سلم) را در مواطن قیامت می‌جویند و او را در هر موطنی که آن طلب اقتضا کند، از همان جایی که طلب کرده‌اند، می‌یابند؛ در همان زمانی که طالب دیگر او را در موطن دیگر می‌یابد. پس هر کس او را در طلب خود در موطنی نیابد، تنها به این دلیل است که او را در غیر موطنی که طلبش اقتضا می‌کند، جستجو کرده است. اگر او را در موطنی که حالش اقتضای جهل دارد، طلب می‌کرد، او را می‌یافت. پس اگر آن جهل واقع شود (که واقع نمی‌شود، و خدا داناتر است)، سببش همان است که ذکر کردیم.\n\nسپس باز می‌گردیم و می‌گوییم: و اگر آن عملی که بنده در آن اقامه شده، از نص مشروع نباشد، بلکه در آن از مجتهدی از علمای امت که صاحب نظر و تأویل در حکم خود بوده (نه از نص)، تقلید کرده باشد و از آن مجتهد تبعیت کرده باشد، در روز قیامت وارث آن مجتهد و پیرو او خواهد بود و همچنین پیرو پیامبر (صلی الله علیه و سلم)، هرچند آن عمل در نفس‌الامر شرع برای او باشد، همان‌طور که پیشتر بیان شد. و اگر عامل نه از نص و نه از تقلید، بلکه از نظر (النظر)، اجتهاد و تفقه عمل کرده باشد، در چنین مسئله‌ای وارث نخواهد بود، مگر اینکه در حکم آن به صواب رسیده باشد. پس اگر حکم را به صواب رساند، وارث خواهد بود و اگر خطا کند، وارث نخواهد بود و در صف کسانی محشور می‌شود که صفتشان این است و برای آنان صفی مخصوص است. سپس آنان در مواطن (قیامت) بر حسب آن حکم خواهند بود، از کسانی که پیش از او بوده‌اند و آن حکم شرعشان بوده است. پس برای او صورتهایی خواهد بود که پیرو آن موروث از او هستند، هر که باشد، و همه پشت سر محمد (صلی الله علیه و سلم) هستند. و مراتب او پشت سر رسول خدا (صلی الله علیه و سلم) و پشت سر رسولان (علیهم السلام) به دلیل اختلاف آنچه در عملش بر او آشکار شده، متفاوت است. پس اگر به طور کلی از هر رسول و نبی و مجتهدی در آن منفرد باشد، او به تنهایی یک امت خواهد بود.\n\nمانند قُس بن ساعده که رسول خدا (صلی الله علیه و سلم) درباره او فرمود: «إِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ أُمَّةً وَحْدَهُ» (او روز قیامت به تنهایی یک امت مبعوث می‌شود). با وجود اینکه او پشت سر محمد (صلی الله علیه و سلم) است، این امر ضروری است، از آن جهت که پیامبر (صلی الله علیه و سلم) ماده‌ای را به او داده که در آن نظر کرده تا چیزی برایش روشن شده که جز در آن مسئله نازله به ذهنش خطور نکرده بود. و در آن، حکم رسول خدا (صلی الله علیه و سلم) را خطا کرده است، این امر ضروری است، برخلاف حکم کسی که به صواب رسیده است.\n\nپس این منزلت را دریاب، زیرا در میان منازلات غریب است و اندکی از اهل الله هستند که این منزلت را دارند، چرا که از تحقیقی عظیم، ذوقی غریب و رفع اشکال خبر می‌دهد. و در قیامت هیچ کس راهنما‌تر و آگاه‌تر به مواطن قیامت و صورتهای موجود در آن، بزرگتر از صاحب این منزلت نخواهد بود، و این منزلت جز با موهبت الهی (الوهب الإلهي) برای کسی که به آن دست یابد، حاصل نمی‌شود. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 3
}