{
  "id": 147,
  "title": {
    "ar": "الباب السابع والأربعون ومائة في معرفة مقام ترك الفتوة وأسراره",
    "en": "Chapter One Hundred and Forty-Seven, Concerning the Gnosis (معرفة) of the Station (مقام) of Renouncing Spiritual Chivalry (ترك الفتوة) and its Mysteries (أسرار)",
    "ur": "باب ایک سو سینتالیس: مقامِ ترکِ فتوت اور اس کے اسرار کی معرفت کے بیان میں",
    "fa": "باب صد و چهل و هفتم در معرفت مقام ترک فتوت و اسرار آن"
  },
  "content": {
    "ar": "## (الباب السابع والأربعون ومائة في معرفة مقام ترك الفتوة وأسراره)\n\n\n> ترك الفتوة إيثار لخالقنا *** هو الفتوة إن حققت معناها\n\n\n> فنفيها عين إثبات لها فمتى *** أمتها جاء ذاك الموت أحياها\n\n\n> فليس يعدمها إلا الفناء فكن *** من أهله فيكون الحق مأواها\n\n\n### [مقام ترك الفتوة متصف بالنقيضين تماما مثل الحب في الحكم‏]\n\n\nاعلم أن ترك الفتوة مشيك في حق نفسك وحظها إذا مشيت في ذلك عن أمر الله لا لما يقتضيه طبع النفس كنت صاحب فتوة فصاحب هذا المقام صاحب فتوة لا فتوة متصف بالنقيضين فالفتوة مثل الحب في الحكم سواء فإن الحب يقضي في المحب الاتصاف بالنقيضين إذا اتفق أن يكون أحد النقيضين محبوبا للمحبوب مما يكرهه المحب لكون الحب لا يطلبه ولا يقتضيه‏\n\n\n### [الفتوة هي العمل في حق الغير إيثارا على حق نفسه‏]\n\n\nفاعلم أن الإنسان إنما يرغب في الأعمال التي نص الشارع على عملها أو تركها إن كانت من التروك ليكون بامتثال ما كلف على حد ما أعطاه الكشف والايمان والعقل في أعلى المراتب ولا يكون ذا همة دنية فإذا تعرض له في وقت عملان أعني أمرين من فعل أو ترك عمد إلى أفضلهما وقد ورد الخبر أنه من قتل شخصا ولم يقتل به فأمره إلى الله إن شاء عفا عنه وإن شاء عذبه‏\n\n\nوقال فيمن قتل نفسه بادرني عبدي بنفسه حرمت عليه الجنة\n\n\nولم يجعله في المشيئة ولا جعل لعمله كفارة في ماله فعلمنا أن حق النفس في حقه آكد عليه وأعظم في الحرمة من حق غيره والفتوة العمل في حق الغير إيثارا على حق نفسه وقد قدم الشارع في غير ما موضع أن حق نفس الإنسان عليه أوجب من حق الغير عند الله والفتى هو الماشي في الأمور بأمر غيره لا بأمر نفسه وفي حق غيره لا في حق نفسه لكن بأمر ربه فهما طرفان أحدهما يسوغ وهو المشي في الأمور عن أمر الله والشطر الآخر لا يسوغ في كل موطن‏\n\n\n### [النجاة من ترك الوقوع بين متناقضات الفتوة وغيرها من متناقضات الحياة]\n\n\nفالعارف إذا أقيم في مقام أداء الحقوق إلى أصحابها وتعينت الحقوق عليه لأصحابها لم يتمكن له أن يتفتى مطلقا فيؤثر الغير على الإطلاق فإنه بأداء حق نفسه يبدأ وإذا بدأ به قدح في شرط الفتوة وإذا لم يبدأ به قدح في الطرف الآخر من الفتوة الذي هو امتثال أمر الله فيبقى هالكا والتخليص من ذلك أن يقول أنا مؤمن والله تعالى اشْتَرى‏ من الْمُؤْمِنِينَ أَنْفُسَهُمْ فنفسي‏\nللحق لا لي فابدأ بها وأوثرها على غيرها من النفوس من كونها لله لا لي فلهذا تكمل الفتوة في تركها المعلوم عند المحجوبين عن إدراك حقائق الأمور فإن مالكها أمرني بتقديمها في أداء الحقوق‏\n\n\n### [حكاية صاحب السفرة والتدقيق في شأن الفتوة التي هي شرف الفطرة]\n\n\nوأما حكاية صاحب السفرة وهي أن شيخا من المشايخ جاءه أضياف فأمر تلميذه أن يأتيه بسفرة الطعام فأبطأ عليه فسأله ما أبطأ بك فقال وجدت النمل على السفرة فلم أر من الفتوة إن أخرجهم فتربصت حتى خرجوا من نفوسهم فقال له الشيخ لقد دققت فجعل هذا الفعل من تدقيق باب الفتوة ونعم ما قال ونعم ما فاته فلو قال أحد لهذا الشيخ كيف شهد له بالتدقيق في الفتوة على جهة المدح والأضياف متالمون بالتأخير والانتظار ومراعاة الأضياف أولى من مراعاة النمل فإن قال الشيخ النمل أقرب إلى الله من حيث طاعتهم لله من الإنسان لما يوجد فيه من المخالفة وكراهة بعض الأمور التي هي غير مستلذة قلنا وجلد الإنسان وجوارحه وشعره وبشره ناطق بتسبيح الله تعالى كالنمل ولهذا تشهد يوم القيامة على النفس الناطقة الكافرة الجاحدة قال تعالى وقالُوا لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنا وقال يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ فهم عدول وشهادتهم مقبولة فكان الأولى مراعاة الأضياف الذين أمر الشارع بتعجيل تقديم الطعام لهم فلو تفتي هذا الخادم وترك السفرة للنمل واستأذن الشيخ وعرفه بالقصة ونظر في تقديم أمر آخر للاضياف كان أولى وأدق في الفتوة\n\n",
    "en": "Chapter 147: Concerning the Knowledge of the Station of Abandoning *Futuwwa* and its Secrets\n\nThe abandonment of *Futuwwa* is preference for our Creator;\nThat is *Futuwwa* if you realize its true meaning.\n\nIts negation is the very affirmation of it, so when\nYou cause its death, that very death revives it.\n\nNothing annihilates it except Annihilation (الفناء), so be\nAmong those who possess it, and The Real (الحق) will be its refuge.\n\n### [The Station of Abandoning *Futuwwa* is Characterized by Two Opposites, Exactly Like Love in its Ruling]\n\nKnow that the abandonment of *Futuwwa* (ترك الفتوة) is your movement concerning the right of your self (نفس) and its portion (حظها). If you proceed in that by the command of Allah, and not by what the natural disposition of the soul requires, then you are a possessor of *Futuwwa*. Thus, the possessor of this Station (مقام) is a possessor of *Futuwwa* who is characterized by two opposites—not a possessor of *Futuwwa*. *Futuwwa* is exactly like love in its ruling, for love necessitates that the lover be characterized by two opposites, provided that one of the opposites is beloved by the Beloved, even if the lover dislikes it, because love does not seek or necessitate it.\n\n### [*Futuwwa* is Action on Behalf of Others, Preferring Them Over One's Own Right]\n\nKnow that a human only desires actions that the Lawgiver (الشارع) has explicitly commanded to be done or abandoned (if they are among the things to be left), so that by complying with what he is obligated to do, he may be at the level granted by Unveiling (الكشف), faith, and intellect, in the highest Levels (المراتب), and not be of low aspiration. If two actions present themselves to him at a time—meaning two matters, whether an act or an omission—he intends the better of the two. A report has come down that whoever kills a person and is not killed in retaliation, his affair is up to Allah: if He wills, He forgives him, and if He wills, He punishes him.\n\nAnd He said concerning one who kills himself: \"My servant hastened his own soul (to Me); I have forbidden Paradise to him.\"\n\nHe did not place this matter under His Will, nor did He make expiation for his act possible through his wealth. Thus, we know that the right of the self (حق النفس) concerning him is more emphatic and greater in sanctity than the right of others. *Futuwwa* is action on behalf of others, preferring them (إيثارا) over one's own right. Yet, the Lawgiver has established in more than one place that the right of a person's self upon him is more obligatory before Allah than the right of others. The *Fata* (possessor of *Futuwwa*) is one who proceeds in matters by the command of another, not by his own command, and on behalf of another, not on behalf of himself, but by the command of his Lord. These are two extremes: one is permissible, which is proceeding in matters by the command of Allah; the other half is not permissible in every situation.\n\n### [Salvation from Falling Between the Contradictions of *Futuwwa* and Other Contradictions of Life]\n\nWhen the Gnostic (العارف) is established in the Station of rendering rights to their owners, and these rights are incumbent upon him for their owners, it is not possible for him to practice *Futuwwa* absolutely, preferring others unconditionally. For he must begin by rendering the right of his own self. If he begins with it, he violates the condition of *Futuwwa*. If he does not begin with it, he violates the other side of *Futuwwa*, which is compliance with the command of Allah. He thus remains ruined. The deliverance from this is for him to say: \"I am a believer, and Allah the Exalted has purchased the souls of the believers: <<اشْتَرى‏ من الْمُؤْمِنِينَ أَنْفُسَهُمْ>> (He has purchased from the believers their souls). My soul is for The Real (الحق), not for me. So I begin with it and prefer it over other souls because it belongs to Allah, not to me.\" For this reason, *Futuwwa* is perfected in its abandonment, which is known to those veiled from perceiving the realities of matters, because its Owner commanded me to prioritize it in the rendering of rights.\n\n### [The Story of the Owner of the Dining Cloth and the Precision Concerning *Futuwwa*, which is the Nobility of the Innate Nature]\n\nAs for the story of the owner of the dining cloth (*sufra*): A Shaykh had guests, and he ordered his disciple to bring the dining cloth with food. The disciple delayed. The Shaykh asked him what caused the delay. He replied, \"I found ants on the cloth, and I did not see it as *Futuwwa* to drive them away, so I waited until they left on their own.\" The Shaykh said to him, \"You have been precise.\" The Shaykh considered this act to be an example of the precision of the chapter of *Futuwwa*. What an excellent thing he said, and what an excellent thing he missed! If someone were to ask this Shaykh, \"How did you attest to his precision in *Futuwwa* in a manner of praise, when the guests were suffering from the delay and the waiting? And observing the rights of the guests is more important than observing the rights of the ants.\" If the Shaykh were to say, \"The ants are closer to Allah in terms of their obedience to Allah than humans, due to the disobedience found in humans and the dislike of certain matters that are not pleasurable,\" we would reply: The skin, limbs, hair, and epidermis of a human also speak the glorification of Allah, just like the ants. This is why they will bear witness on the Day of Resurrection against the speaking soul (النفس الناطقة) that was unbelieving and denying. Allah the Exalted said: <<وقالُوا لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنا>> (And they will say to their skins, \"Why did you testify against us?\") And He said: <<يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ>> (The Day when their tongues, their hands, and their feet will testify against them). They are just witnesses, and their testimony is accepted. Therefore, observing the rights of the guests, whom the Lawgiver commanded to be served food quickly, was more appropriate. Had this servant practiced *Futuwwa* by leaving the cloth for the ants, but then sought permission from the Shaykh and informed him of the situation, and looked into presenting another matter (food) for the guests, that would have been more appropriate and more precise in *Futuwwa*.",
    "ur": "باب ایک سو سینتالیس: مقام ترک فتوّت (ترك الفتوة) اور اس کے اسرار کی معرفت میں\n\nفتوّت (الفتوة) کو ترک کرنا ہمارے خالق کے لیے ایثار (إيثار) ہے۔\nاگر تم اس کے معنی کو حقیقت میں جان لو تو یہی فتوّت (الفتوة) ہے۔\nاس کی نفی ہی اس کا عین اثبات ہے، پس جب تم اسے مار ڈالو گے،\nتو وہی موت اسے زندہ کر دے گی۔\nاسے فنا (الفناء) کے سوا کوئی چیز ختم نہیں کر سکتی، پس تم فنا (الفناء) والوں میں سے ہو جاؤ، تاکہ ذات حق (الحق) اس کا ٹھکانہ بن جائے۔\n\n### [مقام ترک فتوّت (ترك الفتوة) بالکل محبت کی طرح حکم میں متضاد صفات (النقيضين) سے متصف ہے]\n\nجان لو کہ فتوّت (الفتوة) کو ترک کرنا تمہارے اپنے نفس اور اس کے حصے کے حق میں چلنا ہے، جب تم اس میں اللہ کے حکم سے چلو گے نہ کہ اس سے جو نفس کی طبیعت کا تقاضا ہو، تو تم صاحب فتوّت (الفتوة) ہو گے۔ پس اس مقام کا صاحب فتوّت (الفتوة) والا ہے، نہ کہ وہ جو فتوّت (الفتوة) میں متضاد صفات (النقيضين) سے متصف ہو۔ فتوّت (الفتوة) حکم میں بالکل محبت کی طرح ہے، کیونکہ محبت محب میں متضاد صفات (النقيضين) سے متصف ہونے کا تقاضا کرتی ہے، اگر یہ اتفاق ہو جائے کہ ان متضاد صفات (النقيضين) میں سے کوئی ایک محبوب کے لیے محبوب ہو، جسے محب ناپسند کرتا ہو، کیونکہ محبت اس کا مطالبہ نہیں کرتی اور نہ ہی اس کا تقاضا کرتی ہے۔\n\n### [فتوّت (الفتوة) اپنے حق پر غیر کے حق کو ایثار (إيثار) کرتے ہوئے عمل کرنا ہے]\n\nپس جان لو کہ انسان صرف ان اعمال کی طرف راغب ہوتا ہے جن کے کرنے یا چھوڑنے کا شارع نے حکم دیا ہو (اگر وہ تروک میں سے ہوں)، تاکہ وہ اس مکلف چیز کی تعمیل کے ذریعے کشف (الکشف)، ایمان اور عقل نے جو حد اسے دی ہے، اس کے اعلیٰ ترین مراتب پر فائز ہو، اور وہ پست ہمت نہ ہو۔ پس جب کسی وقت اسے دو عملوں کا سامنا ہو، یعنی فعل یا ترک کے دو امور کا، تو وہ ان میں سے افضل کی طرف قصد کرے۔ اور یہ خبر وارد ہوئی ہے کہ \"جس نے کسی شخص کو قتل کیا اور اس کے بدلے میں اسے قتل نہیں کیا گیا، تو اس کا معاملہ اللہ کے سپرد ہے، اگر چاہے تو اسے معاف کر دے اور اگر چاہے تو اسے عذاب دے۔\"\n\nاور اس شخص کے بارے میں فرمایا جس نے خود کو قتل کیا: \"میرے بندے نے اپنی جان کے ساتھ مجھ پر سبقت کی، میں نے اس پر جنت حرام کر دی۔\"\n\nاور اسے مشیئت (اختیار) میں نہیں رکھا، اور نہ ہی اس کے عمل کا کوئی کفارہ اس کے مال میں مقرر کیا، پس ہم نے جانا کہ اس کے حق میں نفس کا حق اس پر زیادہ مؤکد اور غیر کے حق سے زیادہ حرمت والا ہے۔ اور فتوّت (الفتوة) غیر کے حق میں عمل کرنا ہے، اپنے حق پر ایثار (إيثار) کرتے ہوئے۔ اور شارع نے کئی مقامات پر یہ بات مقدم رکھی ہے کہ انسان کے نفس کا حق اس پر اللہ کے نزدیک غیر کے حق سے زیادہ واجب ہے۔ اور فتیٰ (جوانمرد) وہ ہے جو امور میں اپنے حکم سے نہیں بلکہ غیر کے حکم سے چلتا ہے، اور اپنے حق میں نہیں بلکہ غیر کے حق میں، لیکن اپنے رب کے حکم سے۔ پس یہ دو انتہائیں ہیں، ان میں سے ایک جائز ہے، اور وہ اللہ کے حکم سے امور میں چلنا ہے، اور دوسرا حصہ ہر جگہ جائز نہیں ہے۔\n\n### [فتوّت (الفتوة) اور زندگی کے دیگر متناقضات کے درمیان واقع ہونے سے نجات]\n\nپس جب عارف (العارف) کو حقوق کو ان کے حقداروں تک پہنچانے کے مقام پر کھڑا کیا جائے اور حقوق ان کے حقداروں کے لیے اس پر متعین ہو جائیں، تو اس کے لیے یہ ممکن نہیں رہتا کہ وہ مطلقاً فتوّت (الفتوة) کا مظاہرہ کرے اور غیر کو مطلقاً ایثار (إيثار) دے۔ کیونکہ وہ اپنے نفس کے حق کی ادائیگی سے آغاز کرتا ہے، اور جب وہ اس سے آغاز کرتا ہے تو فتوّت (الفتوة) کی شرط میں نقص پیدا کرتا ہے۔ اور اگر وہ اس سے آغاز نہیں کرتا تو فتوّت (الفتوة) کے دوسرے پہلو میں نقص پیدا کرتا ہے جو کہ اللہ کے حکم کی تعمیل ہے، پس وہ ہلاک ہو جاتا ہے۔ اور اس سے نجات یہ ہے کہ وہ کہے: \"میں مؤمن ہوں، اور اللہ تعالیٰ نے **اشْتَرى‏ من الْمُؤْمِنِينَ أَنْفُسَهُمْ** (مؤمنوں سے ان کی جانوں کو خرید لیا ہے)۔\" پس میرا نفس میرے لیے نہیں بلکہ ذات حق (الحق) کے لیے ہے۔ لہٰذا میں اس سے آغاز کرتا ہوں اور اسے دوسرے نفوس پر ایثار (إيثار) دیتا ہوں، اس لیے کہ یہ اللہ کے لیے ہے نہ کہ میرے لیے۔ اسی وجہ سے فتوّت (الفتوة) اس کے ترک میں مکمل ہوتی ہے جو امور کی حقائق (حقائق الأمور) کو سمجھنے سے محجوبین (المحجوبين) کے نزدیک معلوم ہے۔ کیونکہ اس کے مالک نے مجھے حقوق کی ادائیگی میں اسے مقدم کرنے کا حکم دیا ہے۔\n\n### [دستخوان والے کا قصہ اور فتوّت (الفتوة) کے معاملے میں باریک بینی جو فطرت کا شرف ہے]\n\nاور جہاں تک دستخوان (السفرة) والے کا قصہ ہے، وہ یہ ہے کہ ایک شیخ کے پاس مہمان آئے، تو انہوں نے اپنے شاگرد کو حکم دیا کہ وہ کھانے کا دستخوان لائے۔ اس نے دیر لگائی، تو شیخ نے اس سے پوچھا: \"تمہیں کس چیز نے روکا؟\" اس نے کہا: \"میں نے دستخوان پر چیونٹیوں کو پایا، اور میں نے فتوّت (الفتوة) میں یہ مناسب نہ سمجھا کہ میں انہیں نکالوں، لہٰذا میں نے انتظار کیا یہاں تک کہ وہ خود ہی نکل گئیں۔\" شیخ نے اس سے کہا: \"تم نے بہت باریک بینی سے کام لیا۔\" پس اس فعل کو فتوّت (الفتوة) کے باب کی باریک بینی میں سے قرار دیا گیا، اور یہ بات اچھی ہے جو اس نے کہی، اور وہ بھی اچھا ہے جو اس سے فوت ہو گیا۔\n\nفلو اگر کوئی اس شیخ سے پوچھے کہ آپ نے مہمانوں کے تاخیر اور انتظار سے تکلیف اٹھانے کے باوجود، تعریف کے طور پر فتوّت (الفتوة) میں باریک بینی کی گواہی کیسے دی، جبکہ مہمانوں کی رعایت چیونٹیوں کی رعایت سے زیادہ اولیٰ ہے؟ اگر شیخ یہ کہے کہ چیونٹیاں انسان سے اللہ کی زیادہ قریب ہیں، اس لحاظ سے کہ وہ اللہ کی اطاعت کرتی ہیں، کیونکہ انسان میں مخالفت اور بعض ایسی چیزوں کی ناپسندیدگی پائی جاتی ہے جو لذیذ نہیں ہوتیں، تو ہم کہیں گے کہ انسان کی جلد، اس کے اعضاء، اس کے بال اور اس کی کھال بھی چیونٹیوں کی طرح اللہ کی تسبیح بیان کر رہے ہیں۔ اسی لیے وہ قیامت کے دن کافر اور منکر ناطق نفس کے خلاف گواہی دیں گے۔ اللہ تعالیٰ فرماتا ہے: **وقالُوا لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنا** (اور وہ اپنی کھالوں سے کہیں گے کہ تم نے ہمارے خلاف کیوں گواہی دی؟) اور فرمایا: **يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ** (جس دن ان کی زبانیں، ان کے ہاتھ اور ان کے پاؤں ان کے خلاف گواہی دیں گے)۔ پس وہ عادل ہیں اور ان کی گواہی مقبول ہے۔ لہٰذا مہمانوں کی رعایت زیادہ اولیٰ تھی جن کے لیے شارع نے کھانا جلد پیش کرنے کا حکم دیا ہے۔ اگر اس خادم نے فتوّت (الفتوة) کا مظاہرہ کیا ہوتا اور دستخوان کو چیونٹیوں کے لیے چھوڑ دیا ہوتا اور شیخ سے اجازت لے کر انہیں قصہ بتایا ہوتا اور مہمانوں کے لیے کوئی دوسرا انتظام کرنے پر غور کیا ہوتا، تو یہ فتوّت (الفتوة) میں زیادہ اولیٰ اور زیادہ باریک بینی ہوتی۔",
    "fa": "(باب صد و چهل و هفتم در معرفت مقام ترک فتوت و اسرار آن)\n\nترک فتوت (ترك الفتوة)، ایثار برای خالق ماست؛\nاگر معنای آن را دریابی، خودِ فتوت است.\nنفی آن، عین اثبات آن است؛ پس هرگاه\nآن را میراندی، آن مرگ، زنده‌اش می‌کند.\nهیچ چیز آن را نابود نمی‌کند مگر فنا (الفناء)؛ پس از اهل آن باش\nتا حق (الحق) پناهگاه آن گردد.\n\n### [مقام ترک فتوت متصف به دو نقیض، دقیقاً مانند حب در حکم است]\n\nبدان که ترک فتوت (ترك الفتوة)، حرکت تو در حق نفس و بهره‌ی آن است. اگر در این مسیر به فرمان خدا حرکت کنی، نه به اقتضای طبع نفس، صاحب فتوت خواهی بود. پس صاحب این مقام، صاحب فتوت است، اما فتوتی که متصف به دو نقیض است. فتوت در حکم، دقیقاً مانند حب (عشق) است. زیرا حب در محب حکم می‌کند که متصف به دو نقیض باشد، به شرطی که یکی از آن دو نقیض، محبوبِ محبوب باشد، حتی اگر محب آن را ناخوش داشته باشد، زیرا حب آن را نمی‌طلبد و اقتضای آن نیست.\n\n### [فتوت، عمل کردن در حق غیر با ایثار بر حق نفس خود است]\n\nپس بدان که انسان تنها به اعمالی رغبت می‌ورزد که شارع (قانون‌گذار) بر انجام یا ترک آن‌ها (اگر از تروک باشند) تصریح کرده است، تا با امتثال آنچه مکلف شده، بر اساس آنچه کشف (الکشف)، ایمان و عقل به او داده است، در بالاترین مراتب قرار گیرد و صاحب همت پست نباشد. پس اگر در یک زمان دو عمل، یعنی دو امر از فعل یا ترک، برای او پیش آید، به برترین آن‌ها روی می‌آورد. و خبر وارد شده است که: «هر کس شخصی را بکشد و به قصاص او کشته نشود، امرش به دست خداست؛ اگر بخواهد او را می‌بخشد و اگر بخواهد عذابش می‌کند.»\nو درباره‌ی کسی که خود را کشته است، فرمود: «بنده‌ام در مورد جان خود بر من پیشی گرفت، بهشت را بر او حرام کردم.»\nو او را در مشیت (اختیار) قرار نداد و برای عملش کفاره‌ای در مالش قرار نداد. پس دانستیم که حق نفس (جان) بر او، مؤکدتر و حرمتش نزد او بزرگ‌تر از حق غیر است. و فتوت (الفتوة)، عمل کردن در حق غیر است با ایثار (إيثار) بر حق نفس خود. و شارع در بیش از یک موضع مقدم داشته است که حق نفس انسان بر او، نزد خدا واجب‌تر از حق غیر است. و فتی (جوانمرد) کسی است که در امور به فرمان دیگری حرکت می‌کند، نه به فرمان نفس خود؛ و در حق غیر، نه در حق نفس خود، بلکه به فرمان پروردگارش. پس این دو، دو طرف هستند: یکی از آن‌ها جایز است و آن حرکت در امور به فرمان خداست، و شق دیگر در هر موطنی جایز نیست.\n\n### [نجات از ترک وقوع بین متناقضات فتوت و دیگر متناقضات زندگی]\n\nپس عارف (العارف) اگر در مقام ادای حقوق به صاحبانشان قرار گیرد و حقوق بر او برای صاحبانشان متعین شود، نمی‌تواند مطلقاً فتوت ورزد و غیر را به طور مطلق ایثار کند. زیرا او با ادای حق نفس خود آغاز می‌کند، و اگر با آن آغاز کند، شرط فتوت را نقض کرده است. و اگر با آن آغاز نکند، شق دیگر فتوت را نقض کرده است که همان امتثال امر خداست. پس هلاک می‌ماند. و رهایی از این وضعیت آن است که بگوید: «من مؤمن هستم و خداوند متعال [آیه]: **اشْتَرى‏ من الْمُؤْمِنِينَ أَنْفُسَهُمْ** (جان‌های مؤمنان را از ایشان خریده است).» پس نفس من از آنِ حق (الحق) است، نه از آنِ من. پس با آن آغاز می‌کنم و آن را بر سایر نفوس ایثار می‌کنم، به این دلیل که از آنِ خداست، نه از آنِ من. به همین دلیل، فتوت در ترک آن کامل می‌شود، که نزد کسانی که از درک حقایق امور محجوبند، معلوم است. زیرا مالک آن (خداوند) به من امر کرده است که آن را در ادای حقوق مقدم بدارم.\n\n### [حکایت صاحب سفره و دقت در شأن فتوت که شرف فطرت است]\n\nو اما حکایت صاحب سفره (سفره‌ی غذا): آن است که مهمانانی نزد یکی از مشایخ آمدند. شیخ به شاگردش امر کرد که سفره‌ی طعام را بیاورد. شاگرد تأخیر کرد. شیخ از او پرسید: «چه چیز تو را به تأخیر انداخت؟» گفت: «دیدم که مورچه‌ها بر روی سفره هستند. از فتوت ندیدم که آن‌ها را بیرون کنم، پس صبر کردم تا خودشان خارج شدند.» شیخ به او گفت: «به راستی که دقیق عمل کردی.» و این کار را از تدقیق در باب فتوت قرار داد. و چه نیکو گفت و چه نیکو از دست داد! اگر کسی به این شیخ بگوید: چگونه او را به جهت مدح، به تدقیق در فتوت شهادت دادی، در حالی که مهمانان از تأخیر و انتظار در رنج بودند؟ و مراعات مهمانان اولی‌تر از مراعات مورچه‌هاست. اگر شیخ بگوید: مورچه‌ها از جهت اطاعتشان از خدا، به خدا نزدیک‌تر از انسان هستند، به دلیل مخالفت‌ها و ناخوش داشتن برخی امور که لذت‌بخش نیستند که در انسان یافت می‌شود؛ ما می‌گوییم: پوست، جوارح، مو و بشره‌ی انسان نیز مانند مورچه‌ها به تسبیح خداوند متعال ناطق است. به همین دلیل، در روز قیامت بر نفس ناطق کافر و منکر شهادت می‌دهند. خداوند متعال می‌فرماید [آیه]: **وقالُوا لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنا** (و به پوست‌های خود می‌گویند: چرا بر ضد ما شهادت دادید؟) و می‌فرماید [آیه]: **يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ** (روزی که زبان‌ها و دست‌ها و پاهایشان بر ضد آنان شهادت می‌دهند). پس آن‌ها عادل هستند و شهادتشان پذیرفته است. بنابراین، مراعات مهمانانی که شارع به تعجیل در تقدیم طعام به آن‌ها امر کرده است، اولی‌تر بود. اگر این خادم فتوت می‌ورزید و سفره را برای مورچه‌ها می‌گذاشت و از شیخ اجازه می‌گرفت و او را از ماجرا آگاه می‌ساخت و به فکر تقدیم امر دیگری برای مهمانان می‌افتاد، اولی‌تر و در فتوت دقیق‌تر بود."
  },
  "page_count": 2
}